{"word":"overt","summary":{"en":"Overt means open and clearly noticeable, not hidden or secret.","zh":"overt 表示“公开的、明显的”，强调不隐藏、不秘密。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Open, clear, and easy to notice; not hidden or secret.","zh":"公开的；明显的；一眼就看得出来的；不隐瞒的。"},"examples":[{"en":"There was no overt sign that she was angry, but her voice sounded cold.","zh":"她没有表现出明显的生气迹象，但她的声音听起来很冷。"},{"en":"The policy aims to prevent overt discrimination in the workplace.","zh":"该政策旨在防止职场中公开的歧视行为。"},{"en":"He made an overt threat, so the school took immediate action.","zh":"他做出了明显的威胁，因此学校立即采取了行动。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/old use) To catch up with and pass; to overtake.","zh":"（较少用/较旧用法）追上并超过；超越。"},"examples":[{"en":"In older writing, you may see “overtake” shortened to “overt.”","zh":"在较旧的写作中，你可能会看到用“overt”来表示“overtake（追上/超过）”。"}]}],"synonyms":["obvious","open","clear","plain","visible","undisguised","unconcealed"],"phonetic":"/oʊˈvɝt/","extraExplanation":["“overt”常与“covert（秘密的/隐蔽的）”成对出现：overt actions（公开行动） vs. covert operations（秘密行动）。","常见搭配：overt hostility（公开敌意）、overt racism/discrimination（公然的种族主义/歧视）、overtly（副词，公开地/明显地）。","语气上，“overt”常用于较正式或学术/新闻语境，用来强调“可被直接观察到、没有隐藏”。"]}
{"word":"overtakable","summary":{"en":"“Overtakable” means “able to be overtaken”—someone or something can be caught up and passed.","zh":"“overtakable”意为“可被超越的；可被追上并超过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be overtaken; not fast or strong enough to stay ahead, so someone or something can catch up and pass.","zh":"可被超越的；可被追上并超过的（速度或优势不足以保持领先）。"},"examples":[{"en":"In the last kilometer, the leader looked tired and overtakable.","zh":"在最后一公里，领跑者看起来很疲惫，显得可被超越。"},{"en":"If the wind drops, this boat becomes more overtakable by faster boats.","zh":"如果风变小，这艘船就更容易被更快的船追上并超过。"},{"en":"A small early advantage is often overtakable with steady effort.","zh":"一开始的小优势往往可以通过持续努力来反超。"}]}],"synonyms":["easy to overtake","catchable","passable","vulnerable to being overtaken"],"phonetic":"ˌoʊvərˈteɪkəbəl","extraExplanation":["“overtakable”由“overtake（追上并超过）+ -able（能够……的）”构成，意思是“能够被追上并超过的”。在日常英语里更常见的表达是“can be overtaken / easy to overtake / vulnerable to being overtaken”，而“overtakable”相对少见，偏书面或特定语境（如比赛、竞争分析）。","注意区分：\n- “overtaken”是过去分词，常用于被动或完成意义（如“has been overtaken”=已经被超越）。\n- “overtakable”强调“具有可被超越的可能性/特征”，不一定真的已经发生。"]}
{"word":"overtake","summary":{"en":"Overtake means to pass someone/another vehicle by going faster, or to be suddenly overwhelmed or surpassed by something.","zh":"Overtake 常指在路上或比赛中“超过/超车”，也可指被情绪、灾难等“突然袭来并压倒”，或在数量/程度上“超越”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to pass another moving person or vehicle by going faster (often in traffic)","zh":"（在路上）超过、超车；（跑步等）赶超"},"examples":[{"en":"A red car overtook us on the highway.","zh":"一辆红色汽车在高速公路上超了我们的车。"},{"en":"She sped up to overtake the leader in the last lap.","zh":"她加速在最后一圈赶超领先者。"}]},{"partOfSpeech":"vt.","definition":{"en":"to happen to someone suddenly and strongly; to affect or overwhelm (often used with feelings or events)","zh":"（情绪或事件）突然袭来；压倒、使难以承受"},"examples":[{"en":"A feeling of panic overtook him.","zh":"一阵恐慌突然袭上心头。"},{"en":"The town was overtaken by a severe storm.","zh":"小镇遭遇了猛烈的暴风雨。"}]},{"partOfSpeech":"vt.","definition":{"en":"to become greater or more important than something else; to surpass","zh":"超过（数量、程度或重要性）；胜过"},"examples":[{"en":"Online sales have overtaken in-store sales for many brands.","zh":"对许多品牌来说，线上销售已超过线下门店销售。"}]}],"synonyms":["pass","pull ahead of","catch up with and pass","surpass","overwhelm"],"phonetic":"/ˌoʊvərˈteɪk/","extraExplanation":["“overtake”常见于两类语境：一是交通/比赛中的“超越”，二是抽象意义上“被（情绪、灾难、变化）席卷”。在第二种用法里，主语常是抽象名词（panic, fear, grief, storm），语气比“happen”更强，带有“压倒、控制不住”的感觉。","与“take over”不同：overtake = 追上并超过/突然袭来；take over = 接管、接手（权力/工作/控制权）。"]}
{"word":"overtaken","summary":{"en":"**Overtaken** is the past participle of *overtake*, meaning (1) caught up with and passed, or (2) suddenly overwhelmed/affected by something, and sometimes (3) surpassed in importance or amount.","zh":"**Overtaken** 是 *overtake* 的过去分词，常指（1）追上并超过；（2）突然遭遇/被…压倒；有时也指（3）在数量或重要性上超越/取代。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past participle of **overtake**: to catch up with and pass (someone or something).","zh":"**overtake** 的过去分词：追上并超过（某人或某物）。"},"examples":[{"en":"Our car was overtaken by a truck on the highway.","zh":"在高速公路上，我们的车被一辆卡车超过了。"},{"en":"She ran fast but was overtaken in the last 100 meters.","zh":"她跑得很快，但在最后100米被追上并超过了。"}]},{"partOfSpeech":"v.","definition":{"en":"To be suddenly affected or overwhelmed by something (often something unpleasant), such as fear, tiredness, a storm, or events.","zh":"（常指不愉快的事）突然遭遇、被…压倒/控制（如恐惧、疲倦、风暴或局势）。"},"examples":[{"en":"He was overtaken by exhaustion after working all night.","zh":"通宵工作后，他被疲惫压倒了。"},{"en":"The hikers were overtaken by a sudden storm.","zh":"徒步者遭遇了一场突如其来的暴风雨。"}]},{"partOfSpeech":"v.","definition":{"en":"To become greater or more important than; to surpass (often used with trends, technology, or change).","zh":"超越；取代（常用于趋势、科技或变化）。"},"examples":[{"en":"Online shopping has overtaken traditional retail in some areas.","zh":"在一些地区，网购已经超越了传统零售。"}]}],"synonyms":["passed","caught up with","surpassed","outstripped","overwhelmed (by)"],"phonetic":"/ˌoʊvərˈteɪkən/","extraExplanation":["“overtaken”常见在被动语态或完成时里：be overtaken by…（被…突然袭来/压倒）很常用，比如 be overtaken by fear/exhaustion；而“被某车/某人超过”通常也用被动：be overtaken by a car/runner。","词根上 over-（在上方/越过）+ take（抓住/拿取），形象地表示“追上并越过去”。"]}
{"word":"overtaker","summary":{"en":"An overtaker is the driver or vehicle that passes another vehicle on the road.","zh":"overtaker 指在道路上进行超车的一方（驾驶者或车辆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or vehicle that passes another moving more slowly, especially on a road (the one doing the overtaking).","zh":"超车者；超车的车辆（在道路上从后方超过较慢车辆的一方）。"},"examples":[{"en":"The overtaker must make sure the road ahead is clear before passing.","zh":"超车者在超车前必须确认前方道路安全、没有来车。"},{"en":"He signaled early so the overtaker knew what he planned to do.","zh":"他提前打转向灯，让准备超车的车辆知道他的意图。"},{"en":"In heavy traffic, an impatient overtaker can cause accidents.","zh":"在车流密集时，急躁的超车者容易引发事故。"}]}],"synonyms":["passing driver","passing car","passer"],"phonetic":"/ˈoʊvərˌteɪkər/","extraExplanation":["“overtaker”常见于英式道路用语与交通法规语境（如驾考、交通安全手册）。在美式英语里更常用说法是“the passing car/driver”或直接用动词“to pass”。","词形结构：overtake（超越/超车）+ -er（做某事的人/物）→ overtaker（执行超车的人/车）。"]}
{"word":"overtakers","summary":{"en":"“Overtakers” means people or vehicles that pass others, or (figuratively) people who move ahead of others in competition or progress.","zh":"“overtakers”指超车者/超越者；也可比喻在竞争或进步中超过他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that overtake others (especially vehicles that pass another vehicle going in the same direction).","zh":"超越者；超车者（尤指在同方向行驶时从后方超过前车的车辆或人）。"},"examples":[{"en":"Drivers should check their mirrors before overtakers pass on the left.","zh":"司机应在超车者从左侧超越前先查看后视镜。"},{"en":"Cyclists must keep a steady line so overtakers can pass safely.","zh":"骑行者要保持直线行驶，方便超车者安全通过。"}]},{"partOfSpeech":"n.","definition":{"en":"People who move ahead of others in progress, success, or competition (a metaphorical use).","zh":"（比喻）后来居上者；在进步、成功或竞争中超过他人的人。"},"examples":[{"en":"In the tech industry, today’s leaders can become tomorrow’s overtakers.","zh":"在科技行业，今天的领头者可能成为明天被超越的对象。"},{"en":"They were once followers, but they became overtakers through hard work.","zh":"他们曾是追随者，但凭努力成了后来居上者。"}]}],"synonyms":["passers","those who pass","surpassers","outstrippers"],"phonetic":"/ˈoʊvərˌteɪkərz/","extraExplanation":["“overtakers”是复数形式；单数是“overtaker”。在交通语境里，常与“pass/passing”一起出现：an overtaking vehicle（正在超车的车辆）、overtaking lane（超车道）。不同国家“从左/从右超车”的规则不同，例句里的方向要按当地驾驶规则理解。"]}
{"word":"overtakes","summary":{"en":"“Overtakes” means passes someone by going faster, or catches up and goes past; it can also mean something (like fear or illness) suddenly overwhelms someone.","zh":"“overtakes”表示（速度更快而）超过、追上并超越；也可指恐惧、疾病等突然袭来并压倒某人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"passes another person or vehicle by moving faster (especially on a road).","zh":"（尤指在路上）以更快速度超过（另一人或车辆）。"},"examples":[{"en":"The blue car overtakes the truck on the highway.","zh":"蓝色轿车在高速上超过了卡车。"},{"en":"Don’t overtake on a sharp bend.","zh":"不要在急弯处超车。"}]},{"partOfSpeech":"v.","definition":{"en":"catches up with and then goes past someone or something.","zh":"追上并超过（某人/某事）。"},"examples":[{"en":"She starts slowly, but she often overtakes others near the finish.","zh":"她起步慢，但临近终点常常反超别人。"},{"en":"Our costs are rising, and they may overtake our profits.","zh":"我们的成本在上涨，可能会超过利润。"}]},{"partOfSpeech":"v.","definition":{"en":"happens to someone suddenly and strongly; affects someone before they can react.","zh":"（尤指不愉快的事）突然袭来、让人措手不及。"},"examples":[{"en":"Dizziness overtakes him when he stands up too quickly.","zh":"他站得太快时，突然一阵眩晕袭来。"},{"en":"Panic overtakes her in the crowded room.","zh":"在拥挤的房间里，她突然被恐慌感吞没。"}]}],"synonyms":["passes","pulls ahead of","catches up with","surpasses","outpaces","overwhelms"],"phonetic":"/ˌoʊvɚˈteɪks/","extraExplanation":["“overtake(s)”是动词“overtake”的第三人称单数形式（he/she/it overtakes）。常见于驾驶语境（超车），也常被用作比喻：情绪、疾病、困难等“突然袭来/压倒”某人。"]}
{"word":"overtaking","summary":{"en":"Overtaking most often means passing another vehicle on the road; it can also mean being suddenly overwhelmed or surpassed by something.","zh":"overtaking 最常指“（道路上）超车”；也可引申为“被某事压倒/突然袭来”或“被取代、超过”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of passing another vehicle that is moving in the same direction (especially in traffic).","zh":"（尤指交通中）超过同方向行驶的车辆的行为；超车。"},"examples":[{"en":"Overtaking is not allowed on this narrow road.","zh":"这条狭窄的道路不允许超车。"},{"en":"He checked his mirrors before overtaking the truck.","zh":"他在超越卡车前先检查了后视镜。"}]},{"partOfSpeech":"v.","definition":{"en":"Passing another vehicle that is moving more slowly; going ahead of it.","zh":"（在路上）超过更慢的车辆；超越其前方。"},"examples":[{"en":"She signaled before overtaking.","zh":"她在超车前打了转向灯。"},{"en":"Overtaking on the right is illegal in many places.","zh":"在很多地方，从右侧超车是违法的。"}]},{"partOfSpeech":"v.","definition":{"en":"Becoming greater than something (such as a feeling, problem, or event) and seeming to control you; overwhelming.","zh":"（情绪、问题或事件）变得强烈并让人难以控制；压倒、吞没。"},"examples":[{"en":"A sudden fear was overtaking him as the lights went out.","zh":"灯灭时，一阵恐惧感袭来，几乎将他吞没。"},{"en":"The city is growing fast, with development overtaking the old neighborhoods.","zh":"这座城市发展很快，新建设正在取代老街区。"}]}],"synonyms":["passing","pass","going past","surpassing","outpacing","overwhelming (figurative)"],"phonetic":"/ˌoʊvərˈteɪkɪŋ/","extraExplanation":["“overtake”字面是“追上并超过”。在交通语境里非常常见：British English 更常说“overtake”，American English 也用，但口语里常见“pass (a car)”。","引申义里，“be overtaken by + 情绪/事件”常用于文学或正式表达，意思是“被（情绪/事件）压倒、突然袭来”。例如：be overtaken by grief（悲痛袭来）。"]}
{"word":"overtalk","summary":{"en":"“Overtalk” means to talk too much or for too long, often in a way that annoys others or takes over the conversation.","zh":"“Overtalk”指说得太多或太久，往往显得啰嗦、让人不耐烦，或让对话被你“占满”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To talk too much or talk for too long, especially in a way that becomes boring, unnecessary, or prevents others from speaking.","zh":"讲话太多或讲太久，常让人觉得啰嗦、没必要，或让别人插不上话。"},"examples":[{"en":"I’m sorry—I tend to overtalk when I’m nervous.","zh":"不好意思——我紧张的时候容易讲太多。"},{"en":"Let’s keep it short so we don’t overtalk the meeting agenda.","zh":"我们简短一点，别把会议议程讲得太冗长。"},{"en":"He didn’t mean to overtalk her; he just got excited.","zh":"他不是故意抢她的话；只是太兴奋了。"}]}],"synonyms":["talk too much","ramble","go on and on","dominate the conversation"],"phonetic":"/ˌoʊvərˈtɔk/","extraExplanation":["“overtalk”在日常英语里不算最常见，更常见的说法有：talk too much（说太多）、go on and on（没完没了）、ramble（东拉西扯）、dominate the conversation（主导/霸占谈话）、talk over someone（盖过别人的声音、插话）。","在职场或会议语境中，“overtalk”常带有“把话题讲得过度、把会议拖长”的含义；在人际对话里也可指“一个人说太多，别人没机会说”。","注意区分：overtalk（说太多/讲过头）≠ talk over（在别人说话时插嘴、压过对方的声音）。"]}
{"word":"overtalkative","summary":{"en":"Overtalkative means excessively talkative—talking more than is appropriate or comfortable for others.","zh":"overtalkative 指“过于健谈”，说话超过合适或让人舒服的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Talking too much, especially in a way that feels unnecessary, tiring, or distracting to others.","zh":"过于健谈的；话太多的（常带有让人觉得多余、累人或分心的意味）。"},"examples":[{"en":"He gets a bit overtalkative after a couple of coffees.","zh":"他喝了几杯咖啡后就会变得有点话太多。"},{"en":"The meeting ran late because one person was overtalkative.","zh":"会议拖到很晚，因为有一个人太爱说个不停。"}]}],"synonyms":["too talkative","long-winded","chatty (often informal)","garrulous (more formal)"],"phonetic":"/ˌoʊvərˈtɔkətɪv/","extraExplanation":["“overtalkative”由前缀 over-（过度）+ talkative（健谈的）组成，语气通常偏负面，强调“超过合适的程度”。比起 talkative（多为中性/偏正面：健谈、爱聊天），“overtalkative”更像在提醒别人可能说得太多了。","在礼貌表达上，如果不想显得太直接，可以用较委婉的说法：a little too talkative（有点太健谈）、talking a bit much（说得有点多）。"]}
{"word":"overtalkatively","summary":{"en":"Overtalkative means “excessively talkative; talking too much.”","zh":"overtalkative 指“过分健谈、话太多”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Talking too much; excessively talkative, often in a way that may annoy or tire others.","zh":"话太多的；过分健谈的（常带有让人烦或让人疲惫的含义）。"},"examples":[{"en":"He’s friendly, but he can be overtalkative in meetings.","zh":"他人很友善，但在会议上有时会话太多。"},{"en":"When I’m nervous, I become overtalkative and share too many details.","zh":"我一紧张就会变得话太多，讲出太多细节。"},{"en":"The interview went well, though I worried I sounded overtalkative.","zh":"面试进行得很顺利，不过我担心自己听起来有点话太多。"}]}],"synonyms":["too talkative","excessively talkative","chatty","long-winded","garrulous"],"phonetic":"ˌoʊvərˈtɔkətɪv","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”。所以 overtalkative = talkative（健谈的）+ over-（过度）。语气通常偏负面，暗示“说得太多、不太会停”。","日常更常见的表达还有：too talkative, talks too much, chatty（较口语，语气不一定负面）。在正式写作中可用 excessively talkative。"]}
{"word":"overtalkativeness","summary":{"en":"Overtalkativeness means talking too much in a way that can feel excessive or inappropriate.","zh":"overtalkativeness 指“过度健谈”，强调说话太多、超过合适程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or quality of talking too much, especially in a way that feels tiring, unnecessary, or socially inappropriate.","zh":"过度健谈；话太多的习惯或特质（常带有让人觉得累、没必要或不合时宜的含义）。"},"examples":[{"en":"His overtalkativeness made it hard for others to share their ideas in the meeting.","zh":"他过度健谈，让别人很难在会议上分享想法。"},{"en":"She worried that her overtalkativeness might annoy new classmates.","zh":"她担心自己话太多会惹新同学反感。"}]}],"synonyms":["excessive talkativeness","verbosity","garrulousness","chattiness"],"phonetic":"/ˌoʊvərˈtɔkətɪvnəs/","extraExplanation":["这个词由 over-（“过度、太……”）+ talkative（“健谈的”）+ -ness（名词后缀，表示“……的性质/状态”）组成。语气通常偏负面，暗示“说得超出合适的程度”。","在正式写作里，人们更常用 talkativeness（健谈程度）或 too much talking（说太多），而 overtalkativeness 更强调“过头”。"]}
{"word":"overtalker","summary":{"en":"An informal word for someone who talks too much and tends to dominate conversations.","zh":"口语：指话太多、常常主导谈话的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who talks too much, especially in a way that dominates a conversation and doesn’t let others speak.","zh":"话太多的人；（尤指）在谈话中占主导、不给别人说话机会的人。"},"examples":[{"en":"I try to avoid sitting next to an overtalker on long flights.","zh":"长途飞行时我尽量避免坐在话太多的人旁边。"},{"en":"He’s not rude—he’s just an overtalker who gets excited about his ideas.","zh":"他不是没礼貌——他只是容易兴奋、话会变多的人。"},{"en":"In meetings, an overtalker can make it hard for quieter teammates to share opinions.","zh":"在会议上，话太多的人会让更安静的队友很难表达意见。"}]}],"synonyms":["chatterbox","motor-mouth","big talker","talker","gabber"],"phonetic":"/ˈoʊvərˌtɔkər/","extraExplanation":["“overtalker”是比较口语、非正式的说法，常见于日常社交场景或职场吐槽中。比起直接说“talkative（健谈）”，它更带有“说得过多、影响他人发言”的负面意味。想更委婉一点，可以说“very talkative”或“tends to dominate the conversation（容易主导谈话）”。"]}
{"word":"overtame","summary":{"en":"Overtame means “too tame”—overly mild, timid, or easy to control.","zh":"Overtame 表示“过于温顺”，强调温顺到不合适、缺少应有的气势或活力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too tame, timid, or easily controlled; lacking enough spirit, energy, or wildness.","zh":"过于温顺的；太胆小/太容易被控制的；缺乏应有的活力或野性。"},"examples":[{"en":"The puppy was so overtame that it followed any stranger without hesitation.","zh":"这只小狗太过温顺了，几乎毫不犹豫就跟着陌生人走。"},{"en":"Some critics said the movie’s villain felt overtame and not very threatening.","zh":"一些影评人说电影里的反派显得过于“温和”，没什么威慑力。"}]}],"synonyms":["overly tame","too tame","mild","docile","meek"],"phonetic":"/ˌoʊvɚˈteɪm/","extraExplanation":["“over-”作前缀常表示“过度、太……”。因此 overtame 不只是 tame（温顺），而是强调“温顺到不合适/不够有劲”。","这个词不算特别常用，日常里更常见的表达有: too tame / overly tame / not fierce enough。"]}
{"word":"overtamely","summary":{"en":"“Overtamely” means “too tamely”—overly submissively or in a way that is excessively mild or unexciting.","zh":"“overtamely”表示“过于温顺地/太平淡地”，常用来批评过分顺从或缺乏力度与变化。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an excessively tame, submissive, or unadventurous way; too mildly or too obediently","zh":"过于温顺地；过分顺从地；太平淡无趣地"},"examples":[{"en":"He accepted the unfair criticism overtamely, without defending himself.","zh":"他过于顺从地接受了不公平的批评，连一句辩解都没有。"},{"en":"The story ends overtamely, with no real surprise or conflict.","zh":"这个故事结尾太平淡无趣，几乎没有真正的惊喜或冲突。"}]}],"synonyms":["overly submissively","too mildly","meekly","timidly","tamely"],"phonetic":"/ˌoʊvərˈteɪmli/","extraExplanation":["“overtamely”由 over-（过度）+ tamely（温顺地/平淡地）构成，语气常带批评，暗示本该更大胆、更有原则或更有戏剧张力。这个词比较少见，常出现在较正式或文学性的语境中。"]}
{"word":"overtameness","summary":{"en":"Overtameness means excessive tameness or mildness that feels overly compliant or lacking spirit.","zh":"Overtameness 指“过分温顺/温和”，常暗含过于顺从、缺乏锋芒与活力之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too tame, mild, obedient, or lacking spirit; excessive gentleness that can seem dull or overly compliant","zh":"过分温顺（或柔弱、听话）；缺乏活力与锋芒的“太乖/太温吞”"},"examples":[{"en":"Some critics said the novel’s overtameness made the conflict feel unreal.","zh":"一些评论家说，这部小说的过分温吞让冲突显得不真实。"},{"en":"Her overtameness in meetings made it hard for others to know what she truly wanted.","zh":"她在会议上过于温顺，让别人很难知道她真正想要什么。"},{"en":"The director avoided overtameness by giving the main character sharper choices.","zh":"导演通过让主角做出更果断尖锐的选择，避免了作品过于乏味温和。"}]}],"synonyms":["excessive meekness","over-compliance","docility","submissiveness","mildness","passivity"],"phonetic":"/ˌoʊvərˈteɪmnəs/","extraExplanation":["“overtameness”通常是由前缀 over-（过度）+ tame（温顺的）+ 名词后缀 -ness（……的状态/性质）构成的临时或较少见用词。更常见的表达包括：excessive meekness（过度怯懦/温顺）、too much compliance（过度顺从）、lack of edge（缺少锋芒）。","语感上它常带轻微批评：不是单纯“友善”，而是“过于没主见/没劲儿/不够有力量”。"]}
{"word":"overtapped","summary":{"en":"Overtapped means used or drawn on too much (often about money, resources, or supplies), or literally tapped too many times.","zh":"overtapped 指（资金/资源/供应等）被过度动用或消耗；也可指字面上被打孔/接管次数过多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a resource, budget, or supply) used too much; drawn on so heavily that there is little left.","zh":"（资源、预算或供应）被过度使用；被大量动用以至于所剩无几。"},"examples":[{"en":"After months of emergencies, the relief fund was overtapped.","zh":"经过数月的紧急支出，救济基金被过度动用了。"},{"en":"Their savings felt overtapped by medical bills.","zh":"医疗账单让他们的积蓄几乎被掏空了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of overtap: to tap (draw money, information, or a supply) too much or too often.","zh":"overtap 的过去式/过去分词：过度“动用/取用”（金钱、信息或供应）；过于频繁地索取。"},"examples":[{"en":"We overtapped our budget in the first quarter and had to cut back.","zh":"我们第一季度就把预算超支了，只好削减开支。"},{"en":"The journalist overtapped the same source, and they stopped responding.","zh":"记者过度依赖同一个消息源，对方后来不再回应了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Literally: tapped too many times (for example, a keg, a pipe, or a container), sometimes causing leakage, damage, or poor performance.","zh":"字面义：被开孔/接管（tap）次数过多（如酒桶、管道或容器），有时会导致渗漏、损坏或效果变差。"},"examples":[{"en":"The keg was overtapped, so the seal wouldn’t hold.","zh":"酒桶被过度打孔，密封就不牢了。"},{"en":"A fitting can fail if the line has been overtapped.","zh":"如果管线被过度开孔/接管，接头可能会失效。"}]}],"synonyms":["overused","overdrawn","drained","exhausted","overextended"],"phonetic":"/ˌoʊvərˈtæpt/","extraExplanation":["“tap”在英语里除了“轻敲”，还常用来比喻“取用/动用”（tap a fund 动用资金；tap a source 获取信息）。因此 overtapped 往往带有“用过头、把资源掏得太狠”的语气。","这个词相对少见，更常见的表达包括 overused（过度使用）、overdrawn（透支）、drained（耗尽）、stretched too thin（捉襟见肘）。"]}
{"word":"overtare","summary":{"en":"“Overtare” is a rare commercial term meaning an excessive tare deduction (or to deduct too much tare), which makes net weight look smaller than it is.","zh":"“overtare”是较少见的商贸计量用语，指皮重扣除过多（或过度扣皮），使净重看起来小于实际。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Trade/weights) an excessive deduction for tare (the container’s weight), making the net weight seem smaller than it really is.","zh":"（贸易/计量）“过度皮重扣除”：对皮重（容器重量）的扣除过多，导致净重被算得比实际更小。"},"examples":[{"en":"The inspector found an overtare on the invoice, so the net weight was corrected.","zh":"检查员在发票上发现了过度皮重扣除，因此更正了净重。"},{"en":"Overtare can lead to unfair pricing because the buyer pays for less product than expected.","zh":"过度皮重扣除会导致不公平定价，因为买方得到的货物净量比预期更少。"}]},{"partOfSpeech":"v.","definition":{"en":"To deduct too much tare weight when calculating net weight (used in technical or commercial contexts).","zh":"（技术/商业用语）在计算净重时扣除过多的皮重。"},"examples":[{"en":"If you overtare the scale, the shipment will appear lighter than it is.","zh":"如果你把秤过度扣皮，货物看起来会比实际更轻。"},{"en":"They overtared the containers by mistake and had to redo the paperwork.","zh":"他们误把容器过度扣皮，只好重做单据。"}]}],"synonyms":["excess tare deduction","over-deduct tare (technical)"],"phonetic":"ˌoʊvɚˈtɛr","extraExplanation":["“tare（皮重）”指容器/包装的重量；“net weight（净重）= gross weight（毛重）- tare（皮重）”。“overtare”多见于报关、仓储、贸易结算或检验检疫等语境，在日常英语里很少用。","如果你是想拼写更常见的词：可能是 **overtake**（超越、赶上）或 **overrate**（高估）。你可以告诉我你看到它的句子，我可以帮你确认具体意思。"]}
{"word":"overtariff","summary":{"en":"To overtariff means to impose tariffs that are too high, or to describe goods taxed with excessively high tariffs.","zh":"overtariff 指“征收过高关税”，也可形容“被征收过高关税的商品”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place an excessively high tariff (import tax) on goods or trade","zh":"对商品或贸易征收过高的关税（进口税）"},"examples":[{"en":"Some critics say the government overtariffed steel imports to protect local factories.","zh":"一些批评者说政府对钢铁进口征收了过高关税，以保护本地工厂。"},{"en":"If we overtariff basic food, prices may rise for ordinary families.","zh":"如果我们对基本食品征收过高关税，普通家庭的生活成本可能会上升。"}]},{"partOfSpeech":"adj.","definition":{"en":"subject to an excessively high tariff; taxed too heavily at the border","zh":"被征收过高关税的；在边境被过度课税的"},"examples":[{"en":"Overtariff products often become less competitive in the market.","zh":"被征收过高关税的产品往往在市场上更缺乏竞争力。"}]}],"synonyms":["overcharge","overtax","impose excessive tariffs on","tax too heavily"],"phonetic":"/ˌoʊvərˈtærɪf/","extraExplanation":["“overtariff”不是非常常见的标准词条，更常见的表达是“impose excessive tariffs / overtax / overcharge tariffs”或说“tariffs are too high”。在新闻或政策讨论中，有时会用“over-”加在动词前表示“过度、过分”（如 overpay, overcharge），因此“overtariff”在语义上容易理解，但在正式写作中建议用更常见的说法以避免读者觉得生僻。"]}
{"word":"overtarry","summary":{"en":"An uncommon/archaic verb meaning to stay or delay too long.","zh":"一个较少见/略古风的动词，意思是逗留或耽搁过久。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stay somewhere longer than you should; to delay too long (often causing you to miss a chance).","zh":"逗留或耽搁得太久；拖延过久（常导致错失机会）。"},"examples":[{"en":"Don’t overtarry—our train leaves in ten minutes.","zh":"别耽搁太久——我们的火车十分钟后就开了。"},{"en":"She overtarries at the market and arrives home after dark.","zh":"她在市场逗留过久，天黑后才到家。"}]}],"synonyms":["linger","dawdle","delay","tarry too long","stay too long"],"phonetic":"/ˌoʊvərˈtæri/","extraExplanation":["“overtarry”较为少见、带古风色彩，常见于较旧的文学或正式语境中；现代英语更常用的说法是 “tarry too long / stay too long / linger too long / delay too long”。","词形上可理解为 over-（过度）+ tarry（逗留、耽搁），强调“超过适当时间”。在故事或告诫语气里常用来表达“不要错过时机”。"]}
{"word":"overtart","summary":{"en":"“Overtart” means overly tart (too sour) in taste; it’s an uncommon spelling, often written as “over-tart.”","zh":"“overtart”指“酸得过头/过酸”，这种拼写不常见，更常写作“over-tart”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Too tart or too sour in taste; more sharp/acidic than is pleasant.","zh":"（不常见）过酸的；酸味过重的；比舒服可口的程度更“尖锐/刺激”的酸。"},"examples":[{"en":"The lemonade is overtart—add a little sugar or water.","zh":"这杯柠檬水太酸了——加点糖或水吧。"},{"en":"The yogurt tasted overtart, so I mixed in honey.","zh":"这酸奶尝起来酸得过头，所以我拌了点蜂蜜。"}]}],"synonyms":["too sour","overly tart","acidic","sharp-tasting"],"phonetic":"/ˌoʊvərˈtɑrt/","extraExplanation":["“overtart”不是很常见的标准拼写，更常见的写法是加连字符的“over-tart”，意思就是“tart（酸的）过头”。","“tart”在英文里既可以表示“酸的/带酸味的”，也有“尖刻的（言辞）”等含义；但“overtart”几乎只用于描述味道过酸。"]}
{"word":"overtartly","summary":{"en":"“overtartly” is not standard English; you probably mean “overtly” or “tartly.”","zh":"“overtartly”不是标准英语；你多半想写“overtly”或“tartly”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard / likely a misspelling. In most contexts, people mean either “overtly” (openly, clearly) or “tartly” (in a sharp, slightly rude way).","zh":"非标准拼写／很可能是拼写错误。多数语境下，人们想表达的是 “overtly”（公开地、明显地）或 “tartly”（尖刻地、有点不客气地）。"},"examples":[{"en":"If you meant “openly,” write: “He was overtly critical of the plan.”","zh":"如果你想表达“公开地/明显地”，可以写： “He was overtly critical of the plan.”（他公开/明显地批评了这个计划。）"},{"en":"If you meant “sharply,” write: “She replied tartly and walked away.”","zh":"如果你想表达“尖刻地”，可以写： “She replied tartly and walked away.”（她尖刻地回了一句就走开了。）"}]}],"synonyms":["overtly","tartly","openly","plainly","sharply"],"phonetic":"/oʊˈvɝtli/","extraExplanation":["“overtartly”并不是常见英语单词，词典里通常找不到。它看起来像把 overtly（公开地）和 tartly（尖刻地）混在一起，或是把 overtly 拼错了。写作时建议根据语气选择：想强调“公开/明显”用 overtly；想强调“语气尖酸/刻薄”用 tartly。"]}
{"word":"overtartness","summary":{"en":"“Overtartness” means an excessively sour (too tart) taste; it’s a rare/nonstandard word, and “excessive tartness” is more common.","zh":"“overtartness”指味道过酸、酸味过重；它较罕见/不太标准，更常用的说法是“excessive tartness（过度的酸味）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) the quality of being too tart (too sharply sour) in taste or flavor.","zh":"（罕见／非标准用法）过酸；酸味过重（指味道过于尖锐的酸）。"},"examples":[{"en":"The lemonade’s overtartness made it hard to drink without extra sugar.","zh":"这杯柠檬水酸味过重，不加点糖很难喝。"},{"en":"A little acidity is nice, but overtartness can hide the fruit’s natural sweetness.","zh":"一点酸度很怡人，但酸味过重会盖住水果的天然甜味。"}]}],"synonyms":["excessive tartness","too much tartness","over-tartness","sourness (when too strong)"],"phonetic":"/ˌoʊvɚˈtɑrtnəs/","extraExplanation":["“overtartness”在实际英语中非常少见，很多时候更自然的说法是“excessive tartness / too much tartness / over-tartness（常加连字符）”。","构词上可以理解为 over-（过度）+ tart（酸的）+ -ness（名词后缀，表示性质/状态）。在写作中，用更常见的表达会更地道、更容易被读者理解。"]}
{"word":"overtask","summary":{"en":"To overtask someone is to assign them too many tasks—more than is reasonable.","zh":"overtask 指给某人分配过多任务，超出合理承受范围。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone more work than they can reasonably handle; to overwork","zh":"给（某人）布置超出其合理承受范围的任务；使过度劳累"},"examples":[{"en":"The manager overtasked the team with too many projects at once.","zh":"经理一下子给团队分配了太多项目，导致大家任务过重。"},{"en":"If you overtask yourself, your work quality may drop.","zh":"如果你让自己任务过重，工作质量可能会下降。"}]}],"synonyms":["overwork","overburden","overload"],"phonetic":"/ˌoʊvərˈtæsk/","extraExplanation":["“overtask”比较偏正式、书面一些，日常口语里更常见的是“overwork someone”“give someone too much work”“load someone up with tasks”。","构词很好理解：over-（过度）+ task（任务）。注意它强调“任务分配过多”，而“overwork”更强调“工作时间/强度过大”。"]}
{"word":"overtasked","summary":{"en":"Overtasked means having too many tasks or being burdened with more work than is reasonable.","zh":"Overtasked 指任务过多、工作负担超出合理范围，处于不堪重负的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given too many tasks or too much work; overloaded with responsibilities.","zh":"任务过多的；工作量过大的；不堪重负的。"},"examples":[{"en":"I feel overtasked this week because I have three projects due.","zh":"我这周觉得任务太多，因为有三个项目要交。"},{"en":"Overtasked employees are more likely to make mistakes.","zh":"任务过多的员工更容易出错。"},{"en":"She asked her manager for help when she realized she was overtasked.","zh":"她意识到自己任务过多后，向经理请求支援。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “overtask”: to burden someone or something with too much work or demand.","zh":"“overtask”的过去式/过去分词：使（某人/某物）负担过重；分配过多任务。"},"examples":[{"en":"The team was overtasked by unrealistic deadlines.","zh":"不切实际的截止日期让团队负担过重。"},{"en":"Don’t overtask the new staff on their first day.","zh":"不要在新员工第一天就给他们分配过多任务。"}]}],"synonyms":["overloaded","overworked","swamped","burdened","stretched thin"],"phonetic":"/ˌoʊvərˈtæskt/","extraExplanation":["“overtasked”由前缀 over-（过度、太多）+ task（任务）组成，语气上强调“超出合理范围”。在职场语境里常用来表达工作量过载，接近“overworked”，但更突出“任务数量/要求”而不只是“工作时间”。"]}
{"word":"overtasking","summary":{"en":"Overtasking means having or assigning too many tasks, creating an overload.","zh":"Overtasking 指任务安排过多，造成工作超负荷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation of giving someone (or yourself) too many tasks to do, especially in a short time, so that the workload becomes stressful or unrealistic","zh":"（尤指在短时间内）给某人或自己安排过多任务的情况，导致工作量压力大或不切实际"},"examples":[{"en":"Overtasking the team before the deadline led to mistakes and burnout.","zh":"在截止日期前给团队安排过多任务，导致错误和倦怠。"},{"en":"To avoid overtasking, we limited each person to two key projects.","zh":"为了避免任务过载，我们把每个人的重点项目限制在两个。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of assigning too many tasks; overloading someone with work (used as a -ing form of the verb “overtask”)","zh":"安排过多任务；让某人工作超负荷（作为动词“overtask”的 -ing 形式使用）"},"examples":[{"en":"Managers should stop overtasking new employees during their first week.","zh":"管理者应避免在新员工第一周就让他们任务超负荷。"},{"en":"She apologized for overtasking him and reset the priorities.","zh":"她为让他任务过载道歉，并重新调整了优先级。"}]}],"synonyms":["overloading","overwork","work overload","task overload","overburdening"],"phonetic":"/ˌoʊvərˈtæskɪŋ/","extraExplanation":["“Overtasking”在职场写作中可见，但口语里更常说“overwork”（让人过度工作）、“overload”（使超负荷）或“too much on your plate”（事情太多）。","它常与“burnout（职业倦怠）”“unrealistic deadlines（不现实的截止日期）”“poor prioritization（优先级不清）”一起出现，强调问题不仅是“忙”，而是“任务分配不合理”。"]}
{"word":"overtasks","summary":{"en":"Overtask means to burden someone or something with too much work or demand.","zh":"Overtask 指让某人或某物承担过多任务或压力，导致超负荷。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone (or something) more work or demand than they can handle; to overburden","zh":"使（某人/某物）工作或负担过重；让……超负荷"},"examples":[{"en":"The manager overtasks the team and then wonders why people burn out.","zh":"经理把团队的任务分配得过多，然后又疑惑为什么大家会倦怠。"},{"en":"Try not to overtask yourself during exam week.","zh":"考试周尽量别让自己太超负荷。"}]},{"partOfSpeech":"vt.","definition":{"en":"to push a machine, system, or body beyond its capacity","zh":"使机器/系统/身体超出承受能力；过度使用"},"examples":[{"en":"Overtasking the server can slow the whole website down.","zh":"让服务器超负荷会拖慢整个网站。"},{"en":"If you overtask your muscles, you may get injured.","zh":"如果让肌肉过度负荷，可能会受伤。"}]}],"synonyms":["overwork","overload","overburden","strain"],"phonetic":"/ˌoʊvərˈtæsk/","extraExplanation":["“overtasks”通常是动词第三人称单数（he/she/it overtasks）。在现代英语里更常见的表达还有：overwork（把……累坏）、overload（使……超载）、give someone too much to do（给……太多事做）。","语气上，“overtask”常带批评或担忧的意味，暗示分配不合理、可能导致疲惫/出错/崩溃（burnout）。"]}
{"word":"overtaught","summary":{"en":"“Overtaught” means taught too much or too rigidly, often reducing creativity or real understanding.","zh":"“Overtaught”指被教得过多或过于死板，常暗示创造力或真正理解被削弱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"taught too much, or in a way that is overly controlled and focused on rules or tests, so that creativity, curiosity, or real understanding is reduced.","zh":"被教得太多；或教学方式过度强调规则/考试与控制，导致创造力、好奇心或真正理解被削弱。"},"examples":[{"en":"Some students feel overtaught and stop asking questions because they’re afraid of making mistakes.","zh":"有些学生觉得自己被教得太过头，于是因为害怕犯错而不再提问。"},{"en":"The workshop was so structured that participants became overtaught and less willing to experiment.","zh":"这个工作坊结构太死，参与者被“教过头”，反而更不敢尝试。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to teach too much or too strictly; past tense/past participle form is also written as “overtaught.”","zh":"（较少见）把……教得过多或过严；其过去式/过去分词也可写作 overtaught。"},"examples":[{"en":"If we overtaught the rules, learners might forget to communicate naturally.","zh":"如果我们把规则教得过头，学习者可能会忘了自然交流。"}]}],"synonyms":["overeducated","overtrained","overdrilled","overcoached"],"phonetic":"ˌoʊvərˈtɔt","extraExplanation":["“overtaught”在教育语境里常带批评意味：不是单纯“学得多”，而是“被灌输/被训练过度”，例如过度刷题、过度纠错、过度强调标准答案，结果学生反而不敢表达、缺少独立思考。","常见搭配：overtaught students（被教过头的学生）、feel overtaught（感觉被教过头）、overtaught and under-inspired（被教得过度、却缺乏启发）。"]}
{"word":"overtax","summary":{"en":"Overtax means to tax too much or to place too heavy a burden on someone or something.","zh":"overtax 指“课税过重/多收税”，也可引申为“使负担过重、使过度劳累”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To charge someone too much tax, or to make them pay more tax than they should.","zh":"对……课税过重；（使）缴纳超出应缴的税。"},"examples":[{"en":"The company said it was overtaxed and asked for a refund.","zh":"公司表示自己被多收了税，并申请退款。"},{"en":"If you think you were overtaxed, you can file an amended return.","zh":"如果你认为自己被多缴了税，你可以提交更正后的报税表。"}]},{"partOfSpeech":"vt.","definition":{"en":"To demand too much from someone or something; to overburden.","zh":"使负担过重；使过度劳累（常指精力、能力或资源被过度消耗）。"},"examples":[{"en":"Don’t overtax your eyes by reading in the dark.","zh":"不要在黑暗中看书，以免过度用眼。"},{"en":"The tight schedule overtaxed the staff.","zh":"紧张的日程让员工负担过重。"},{"en":"The long hike overtaxed his strength.","zh":"长途徒步让他体力透支。"}]}],"synonyms":["overburden","overload","strain","exhaust","overcharge (tax context)"],"phonetic":"/ˌoʊvɚˈtæks/","extraExplanation":["词源提示：over- 表示“过度”，tax 原义是“征税”，后来引申为“使负担/使费力”。因此 overtax 既可用于税务语境，也常用于日常表达“把……压得太重/用得太狠”。","用法提醒：在税务语境里，overtaxed 常与 refund（退税）、amended return（更正申报）、withholding（预扣税）等词搭配；在引申义里，常搭配 eyes/strength/patience/resources 等表示“精力或资源”的名词。"]}
{"word":"overtaxation","summary":{"en":"Overtaxation means excessive or unfairly heavy taxation, or the practice of taxing too much.","zh":"overtaxation 指过度征税、税负过重（常带“太重/不公平”的评价），也可指征税过度的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation of being taxed too much; taxes that are considered excessive or unfairly heavy","zh":"过度征税；（被认为）税负过重、不公平的重税"},"examples":[{"en":"Many small businesses complain that overtaxation makes it hard to hire new workers.","zh":"许多小企业抱怨过度征税让他们很难雇用新员工。"},{"en":"The candidate promised to cut overtaxation on the middle class.","zh":"这位候选人承诺要降低中产阶级的过重税负。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of taxing something more than is reasonable or necessary","zh":"对某事物征税过多的行为；征税过度的做法"},"examples":[{"en":"Some economists warn that overtaxation of investment can slow economic growth.","zh":"一些经济学家警告，对投资征税过度可能会拖慢经济增长。"},{"en":"Overtaxation of imports may raise prices for consumers.","zh":"对进口商品过度征税可能会抬高消费者的价格。"}]}],"synonyms":["excessive taxation","heavy taxation","tax burden"],"phonetic":"/ˌoʊvɚtækˈseɪʃən/","extraExplanation":["“overtaxation”由 over-（过度）+ taxation（征税）构成，常见于政治、经济评论语境，带有明显的评价色彩：说话者通常认为税负“太重”。","注意区分：overtaxation（税负过重）强调“税太多/太重”；tax evasion（逃税）是违法逃避纳税；tax avoidance（避税）多指利用规则减少税负，合法但可能有争议。"]}
{"word":"overtaxed","summary":{"en":"Overtaxed means taxed too heavily, or (figuratively) overburdened and stretched beyond capacity.","zh":"Overtaxed 指税负过重；也可引申为不堪重负、超出承受能力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, business, or income) taxed too heavily; paying more tax than feels fair or affordable.","zh":"（人、企业或收入）税负过重的；交税太多、负担不起的。"},"examples":[{"en":"Small businesses say they are overtaxed compared with large corporations.","zh":"小企业说，相比大型公司，它们的税负过重。"},{"en":"Many families feel overtaxed when property taxes rise quickly.","zh":"当房产税快速上涨时，很多家庭会觉得税负过重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) forced to do too much; overburdened or stretched beyond capacity.","zh":"（引申）负担过重的；被要求做太多而不堪重负的。"},"examples":[{"en":"Hospitals can become overtaxed during a severe flu season.","zh":"在严重流感季，医院可能会不堪重负。"},{"en":"Her schedule was overtaxed, so she started saying no to extra work.","zh":"她的日程安排负担过重，所以开始拒绝额外工作。"}]}],"synonyms":["overburdened","overloaded","strained","hard-pressed","overstretched"],"phonetic":"/ˌoʊvərˈtækst/","extraExplanation":["“overtaxed”常见于公共政策与新闻语境，既可指“税收过高”，也常用作比喻表示“系统/人手超负荷”（如 overtaxed schools/hospitals）。动词原形是 overtax（使……负担过重；对……征税过重）。"]}
{"word":"overtaxes","summary":{"en":"“Overtaxes” means “puts too much strain on” (or less commonly, “taxes too heavily”).","zh":"“overtaxes”表示“使负担过重/超负荷”（较少见：征税过重）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to demand too much from someone or something; to make a person, system, or resource work beyond a safe or reasonable limit.","zh":"（第三人称单数）使……负担过重；使人/系统/资源超出安全或合理限度地运转。"},"examples":[{"en":"The long shifts overtaxes the nurses and increases mistakes.","zh":"长时间轮班让护士负担过重，也会增加出错率。"},{"en":"In summer, the heat overtaxes the power grid.","zh":"夏季高温会让电力系统超负荷运转。"},{"en":"Don’t overtax your body—rest when you need to.","zh":"别让身体透支；需要时就休息。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to charge too much tax on; to tax excessively.","zh":"（较少见）对……征税过重；过度课税。"},"examples":[{"en":"Some residents argue the city overtaxes small businesses.","zh":"一些居民认为市政府对小企业征税过重。"},{"en":"They felt overtaxed by fees and local taxes.","zh":"他们觉得被各种费用和地方税收压得喘不过气。"}]}],"synonyms":["overburdens","overworks","overstrains","overloads","taxes too heavily"],"phonetic":"/ˌoʊvɚˈtæksɪz/","extraExplanation":["“overtaxes”来自动词 overtax（over- 表示“过度/超过”，tax 表示“使负担/征税”）。日常更常用的是“使负担过重”的意思；“征税过重”在讨论政策或财政时更常见。"]}
{"word":"overtaxing","summary":{"en":"“Overtaxing” means excessively demanding or exhausting; it can also describe the act of putting too much strain on someone or something.","zh":"“overtaxing”指“过度费力/过于吃力的”，也可表示“使……负担过重、过度消耗”的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too demanding or exhausting; requiring more effort, time, or strength than is reasonable.","zh":"过度费力的；过于吃力的；要求超出合理范围的。"},"examples":[{"en":"The schedule was overtaxing, and everyone felt drained by Friday.","zh":"这个日程安排太过紧张，到了周五大家都精疲力尽。"},{"en":"Trying to work full-time and study at night can be overtaxing.","zh":"全职工作同时晚上学习可能会让人不堪重负。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle of “overtax”) Making someone or something work too hard; putting too much demand on.","zh":"（overtax 的现在分词）使（某人/某物）负担过重；过度消耗。"},"examples":[{"en":"She worried she was overtaxing her body by training every day without rest.","zh":"她担心自己每天训练不休息是在过度消耗身体。"},{"en":"The new rules are overtaxing small businesses.","zh":"新规定让小企业负担过重。"}]}],"synonyms":["exhausting","draining","demanding","overwhelming","strenuous","taxing"],"phonetic":"/ˌoʊvərˈtæksɪŋ/","extraExplanation":["“overtax”由 over-（过度）+ tax（使负担/使吃力）构成，语气比 “tiring” 更强，常带有“超出承受范围、可能造成损害”的含义。","常见搭配：overtaxing workload（过重的工作量）, overtaxing schedule（过紧的日程）, overtaxing demands（过分的要求）, overtaxing the body/mind/resources（过度消耗身体/精神/资源）。","近义词侧重点：exhausting 更偏“让人筋疲力尽”；overwhelming 更偏“压力大到难以应付”；overtaxing 强调“把人/系统用过头”。"]}
{"word":"overteach","summary":{"en":"Overteach means to teach too much or in a way that gives learners more explanation or help than they need.","zh":"Overteach 指“过度教学”：讲解或帮助超过学习者所需，甚至让学生缺少自主思考空间。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to teach too much or for too long, especially by giving more detail, practice, or explanation than learners need","zh":"过度教学；讲得太多/太久（尤其指解释、练习或细节多于学习者所需）"},"examples":[{"en":"I overteach when I repeat the same point three different ways.","zh":"当我用三种不同方式重复同一个要点时，我就是在过度教学。"},{"en":"The lesson felt slow because the teacher overtaught the basics.","zh":"这节课感觉很慢，因为老师把基础内容讲得过多。"}]},{"partOfSpeech":"vt.","definition":{"en":"to teach in a way that reduces students’ independence (for example, by giving answers instead of letting them think)","zh":"过度包办式教学；教得让学生失去自主性（例如直接给答案而不让他们思考）"},"examples":[{"en":"If we overteach, students may stop asking questions and just wait for the solution.","zh":"如果我们过度包办式教学，学生可能不再提问，只等答案。"},{"en":"Try not to overteach—give a hint and let them struggle a little.","zh":"尽量不要过度包办——给个提示，让他们自己稍微挣扎一下。"}]}],"synonyms":["teach too much","overexplain","spoon-feed","over-instruct"],"phonetic":"/ˌoʊvɚˈtitʃ/","extraExplanation":["“over-”这个前缀常表示“过度、超过适当范围”（如 overwork 过度工作、overthink 想太多）。因此 overteach 的核心不是“教得认真”，而是“超过学生当下真正需要的量/方式”。","教学语境中常把 overteach 和“讲太满、节奏太慢、学生参与不足”联系在一起。改进思路通常是：先检查理解（提问/小测），再补充必要的讲解，而不是把所有细节一次性讲完。"]}
{"word":"overteaching","summary":{"en":"Overteaching means explaining or guiding too much, often making learning less effective or less independent.","zh":"Overteaching 指“过度教学/讲太多”，解释或指导过量，反而降低学习效果或独立性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In teaching or explaining) giving too much information, too many steps, or too much help, so the learner becomes confused, bored, or less independent.","zh":"（在教学或解释时）讲得过多、步骤太细或帮助过度，导致学习者困惑、厌烦，或更不独立。"},"examples":[{"en":"The tutorial is clear, but some parts feel like overteaching because every tiny step is explained.","zh":"这个教程很清楚，但有些地方像是过度教学，因为每个小步骤都解释得太细。"},{"en":"Try to avoid overteaching—give students time to think and attempt the problem first.","zh":"尽量避免过度教学——先给学生时间思考并自己尝试解题。"},{"en":"Overteaching can make learners rely on the teacher instead of building confidence.","zh":"过度教学会让学习者依赖老师，而不是建立自信。"}]},{"partOfSpeech":"v.","definition":{"en":"Teaching in an overly detailed or controlling way; explaining more than the situation needs.","zh":"以过于细致或控制性太强的方式教学；解释得超过情境所需。"},"examples":[{"en":"She worries she’s overteaching when she repeats the same point three different ways.","zh":"她担心自己在过度教学，因为同一个要点用三种方式反复讲。"},{"en":"When coaching, give one key tip at a time instead of overteaching.","zh":"做指导时，一次给一个关键建议就好，不要过度教学。"}]}],"synonyms":["overexplaining","spoon-feeding","micromanaging (in teaching)","over-instructing"],"phonetic":"/ˌoʊvərˈtiːtʃɪŋ/","extraExplanation":["“overteaching”常见于教育培训、教学反思或职场带教语境，强调“信息/指导过量”带来的副作用，比如认知负荷过高、学习者缺少探索空间。","它不等于“讲得认真”或“讲得清楚”。关键区别在于：是否给了学习者足够的练习与思考时间，是否把本可由学习者自行完成的部分也全包办了。","常见搭配：avoid overteaching（避免过度教学）, overteaching a lesson（把一节课讲得过满）, overteach the basics（基础讲太多）。"]}
{"word":"overtechnical","summary":{"en":"Overtechnical describes language or explanations that are unnecessarily technical and difficult for non-experts.","zh":"overtechnical 指表达或解释过于专业技术化，使非专业人士难以理解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too technical or full of specialized details in a way that is hard for a general audience to understand.","zh":"过于技术化的；（内容）充满专业细节而让一般人难以理解的。"},"examples":[{"en":"The manual is overtechnical, so new users get lost quickly.","zh":"这本说明书太过技术化，新用户很快就会看不懂。"},{"en":"Try to explain it without being overtechnical.","zh":"尽量用不那么技术化的方式解释。"}]}],"synonyms":["too technical","overly technical","jargon-heavy","needlessly complex"],"phonetic":"/ˌoʊvərˈtɛknɪkəl/","extraExplanation":["“over-”是一个常见前缀，表示“过度、超过需要的程度”（如 overconfident 过度自信、overworked 过度劳累）。因此 overtechnical 往往带有“对听众不友好、不必要地复杂”的语气。","在写作/沟通中，overtechnical 常用于批评语境：不是说内容不准确，而是说没有根据受众调整表达方式。可与 too technical、overly technical 互换。"]}
{"word":"overtechnicality","summary":{"en":"Overtechnicality means being too technical, with excessive specialized detail that makes communication hard for non-experts.","zh":"Overtechnicality 指“过度技术化”：使用太多专业细节或术语，导致非专业人士难以理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too technical or using too much specialized detail, making something hard for non-experts to understand","zh":"过度技术化；技术细节过多（导致非专业人士难以理解）的特性"},"examples":[{"en":"The article’s overtechnicality made it difficult for beginners to follow.","zh":"这篇文章太过技术化，让初学者很难看懂。"},{"en":"Try to reduce overtechnicality when you explain the idea to your customers.","zh":"向客户解释这个想法时，尽量减少过度技术化的表达。"}]}],"synonyms":["excessive technicality","too much jargon","overly technical language"],"phonetic":"/ˌoʊvərˌtɛknɪˈkælɪti/","extraExplanation":["“overtechnicality”由 over-（过度）+ technical（技术性的）+ -ity（名词后缀，表示“性质/状态”）构成，意思是“技术性过头的状态”。","这个词常用在写作、沟通和教学语境里，带有批评意味：不是反对技术本身，而是反对“对受众不友好”的表达方式。","更常见的替代表达有：“too technical”“overly technical”“excessive jargon”（术语过多）。"]}
{"word":"overtechnically","summary":{"en":"“Overtechnically” means “too technically,” using more technical detail than is helpful for the audience or context.","zh":"“overtechnically”指“过于技术化地”，用超出听众/场合需要的专业细节来表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too technical, focusing on specialized details more than the situation or audience needs.","zh":"过于技术化地；用太多专业细节地（以至于不符合场合或听众需要）。"},"examples":[{"en":"He explained the app overtechnically, so the new users felt lost.","zh":"他把这个应用讲得过于技术化，所以新用户听得一头雾水。"},{"en":"Try not to write overtechnically in an email to clients.","zh":"给客户发邮件时尽量不要写得过于技术化。"},{"en":"The instructions are overtechnically worded for beginners.","zh":"这些说明对初学者来说措辞过于技术化。"}]}],"synonyms":["too technically","overly technically","in overly technical terms","with too much jargon"],"phonetic":"ˌoʊvərˈtɛknɪkli","extraExplanation":["这个词相对少见，更常见的表达包括：“too technically / overly technical(ly) / in overly technical terms”。它由前缀 over-（表示“过度”）+ technically（技术性地）构成，常带有轻微批评语气，暗示“说得太专业以至于不清楚/不合适”。","写作中如果担心显得生硬，可以用更自然的改写：\n- He explained it overtechnically. → He got too technical.\n- overtechnically worded → worded in overly technical language / full of jargon。"]}
{"word":"overtedious","summary":{"en":"“overtedious” is not standard English; you probably mean “overly/too tedious.”","zh":"“overtedious”不是标准英语；你可能想表达“overly/too tedious（过于繁琐/乏味）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard / not a recognized English word. It is most likely a misspelling or an invented form meant to express “too tedious” or “overly tedious.”","zh":"非标准/不被认可的英语单词。很可能是拼写错误或临时造词，用来表达“太繁琐、过于乏味/冗长”。"},"examples":[{"en":"This looks like a typo—did you mean “overly tedious” or just “tedious”?","zh":"这看起来像拼写错误——你想说的是“overly tedious（过于繁琐）”还是直接“tedious（繁琐）”？"},{"en":"The report isn’t difficult, but the formatting rules are overly tedious.","zh":"报告不难，但排版规则过于繁琐。"}]}],"synonyms":["overly tedious","too tedious","extremely tedious","time-consuming","wearisome"],"phonetic":"ˌoʊvərˈtidiəs","extraExplanation":["“overtedious”在词典里通常查不到，写作时不建议使用。更自然的表达有：overly tedious / too tedious / extremely tedious。","如果你想表达“过分认真用功/过于好学”，常见词是 overstudious（过于用功的），不是 overtedious。","“tedious”常形容事情“冗长、重复、让人厌烦”；也可用 time-consuming（耗时的）、nitpicky（吹毛求疵的/过分挑剔的）根据语气选择。"]}
{"word":"overtediously","summary":{"en":"“overtediously” isn’t standard; you probably mean “tediously” (in a boring/overlong way) or “overly tediously” (too tediously).","zh":"“overtediously”不是标准用法；你可能想说“tediously”（以令人厌烦/冗长的方式）或“overly tediously”（过于繁琐地）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Not a standard English word) Likely a misspelling of “tediously,” meaning in a way that is boring, too long, or tiring because it has too much detail or repetition.","zh":"（不是标准英文单词）很可能是把“tediously”拼错了；“tediously”表示“以令人厌烦/冗长/繁琐的方式”，因为细节或重复太多而让人疲惫。"},"examples":[{"en":"This meeting is going tediously slowly.","zh":"这个会议进行得又慢又让人厌烦。"},{"en":"He explained the rules tediously, repeating the same points.","zh":"他把规则讲得很繁琐，还反复强调同样的点。"}]},{"partOfSpeech":"adv.","definition":{"en":"If you meant “overly tediously”: excessively in a tedious way (used to criticize something as more tedious than necessary).","zh":"如果你想表达“overly tediously”：过度地、太过于繁琐地（用来批评某事没必要这么无聊/冗长）。"},"examples":[{"en":"The report is overly tediously detailed; a shorter summary would help.","zh":"这份报告细节多得过于繁琐；更短的摘要会更好。"},{"en":"Don’t describe it overly tediously—just give the main idea.","zh":"别讲得太繁琐——说清主要意思就行。"}]}],"synonyms":["boringly","wearisomely","drearily","monotonously","overlongly"],"phonetic":"ˈtidiəsli","extraExplanation":["“overtediously”一般不出现在词典里，更像把“overly tediously”（过于繁琐地）连写或拼错了。英文里“over-”常表示“过度/超过正常程度”，但通常不会直接和副词拼成一个新词。更自然的表达是：overly tediously / too tediously / in an overly tedious way。","“tedious”的常见搭配：tedious task（繁琐的任务）、tedious details（繁琐的细节）、tedious meeting（无聊冗长的会议）。如果你想要更口语一点，也可以用：boringly、endlessly、painfully slowly 等。"]}
{"word":"overtediousness","summary":{"en":"“overtediousness” means “excessive tediousness,” but it’s uncommon; “tediousness” is more natural.","zh":"“overtediousness”表示“过度乏味/冗长”，但不常用；更自然的是“tediousness”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too long, repetitive, or boring in a way that tries people’s patience (an uncommon/awkward form; usually people say “tediousness” or “excessive tediousness”).","zh":"（不常用/不太自然的词形）过度冗长或重复、让人觉得无聊到失去耐心的特质；更常见的说法是“tediousness（乏味/冗长）”或“excessive tediousness（过度乏味/冗长）”。"},"examples":[{"en":"Readers complained about the overtediousness of the report and stopped halfway through.","zh":"读者抱怨这份报告过于冗长乏味，读到一半就停了。"},{"en":"Try cutting repeated details to reduce the overtediousness of your writing.","zh":"尽量删掉重复细节，减少你文章的过度冗长乏味。"}]}],"synonyms":["tediousness","excessive tediousness","monotony","dullness","wordiness"],"phonetic":"/ˌoʊvərˈtidiəsnəs/","extraExplanation":["“overtediousness”并不是常见标准词，读者可能会觉得别扭或像拼写错误。更自然的表达包括：tediousness（乏味/冗长）、excessive tediousness（过度乏味/冗长）、being overly tedious（太冗长）、overlong and repetitive（过长且重复）。在正式写作里，通常用更常见的搭配来提高可读性。"]}
{"word":"overteem","summary":{"en":"Overteem means to abound or be filled excessively (often in literary style).","zh":"Overteem 指“过度地充满/大量涌现”，多见于文学性表达。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to be filled with something in an excessive way; to abound or swarm beyond normal limits","zh":"（数量或程度）过多地充满；过度繁盛；大量涌现"},"examples":[{"en":"In summer, the riverbanks overteem with insects and wildflowers.","zh":"夏天，河岸边昆虫与野花多得成灾。"},{"en":"His notebook seemed to overteem with ideas, some brilliant and some half-formed.","zh":"他的笔记本里点子多得溢出来，有的精彩，有的还不成熟。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fill something too full; to overcrowd or overload","zh":"使……过度充满；使……拥挤/超载"},"examples":[{"en":"The legend says the sea overteemed the shore with treasures after the storm.","zh":"传说暴风雨过后，大海把海岸“塞满”了宝藏。"}]}],"synonyms":["teem","overflow","abound","swarm","brim over"],"phonetic":"/ˌoʊvərˈtiːm/","extraExplanation":["“overteem”较少见，带有文学/古典色彩，常见于描写自然景象或情感、思想“过度涌现”的语境。","它由 over-（过度）+ teem（大量出现、充满）构成。日常英语里更常用 teem with, be teeming with, overflow with, abound in 等表达。"]}
{"word":"overtell","summary":{"en":"Overtell means to tell too much (or, less commonly, to retell).","zh":"Overtell 指“讲得太多/太啰嗦”，较少见时也可指“复述、再讲一遍”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tell too much or give more details than necessary (often causing boredom, awkwardness, or revealing information you shouldn’t)","zh":"讲得太多；把细节说得过多（常导致别人觉得无聊、尴尬，或不该透露的信息被说出来）"},"examples":[{"en":"I think I overtold the story—sorry, I’ll keep it short.","zh":"我好像把故事讲得太啰嗦了——抱歉，我会简短点。"},{"en":"Be careful not to overtell personal details at work.","zh":"在工作场合要注意别把私生活细节说太多。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to tell again; to retell","zh":"（较少见）再讲一遍；复述"},"examples":[{"en":"She overtold the legend in her own words.","zh":"她用自己的话把这个传说又讲了一遍。"}]}],"synonyms":["tell too much","go on (too long)","overshare","overexplain","ramble"],"phonetic":"/ˌoʊvərˈtɛl/","extraExplanation":["“overtell”在现代英语里不算常用，口语中更常见的表达有“tell too much / go on too long / overshare”。其中“overshare”更强调把私密信息分享过度（尤其在社交媒体或不熟的人面前）。"]}
{"word":"overtelling","summary":{"en":"Overtelling means giving too much explanation, especially in storytelling or writing, instead of letting details and actions show the meaning.","zh":"Overtelling 指讲得太多、解释得太直白（尤指写作/叙事中），使信息缺少通过细节与行动自然呈现的空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Explaining too much in a story, speech, or writing—giving the audience information too directly instead of letting actions, details, or subtext show it.","zh":"（写作/叙事中）解释得太多、说得太直白；把信息直接“讲出来”，而不是让读者通过情节、细节或潜台词自己体会。"},"examples":[{"en":"The novel’s weakness is overtelling: the narrator explains every emotion instead of showing it through dialogue.","zh":"这部小说的弱点是过度讲述：叙述者把每种情绪都解释出来，而不是通过对话来呈现。"},{"en":"Try cutting overtelling and adding concrete details—what we see, hear, and do.","zh":"试着删掉过度讲述，加入更具体的细节——我们看到的、听到的、做了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of telling something too much or too often, especially repeating details the listener already knows.","zh":"（一般用法）把某事讲得太多或讲太频繁；反复重复听者已经知道的细节。"},"examples":[{"en":"Sorry for the overtelling—I’ve already told you this story twice.","zh":"抱歉我讲太多了——这个故事我已经跟你说过两次了。"},{"en":"His overtelling made the meeting longer than it needed to be.","zh":"他讲得过多让会议比必要的时间更长。"}]}],"synonyms":["overexplaining","excessive exposition","spoon-feeding","too much telling"],"phonetic":"/ˌoʊvərˈtɛlɪŋ/","extraExplanation":["“Overtelling”在写作课里常和“show, don’t tell（展示而非直说）”一起出现：不是完全不能“tell（讲述）”，而是避免把人物动机、情绪、主题都用解释句一次讲清，让读者失去参与感。","常见信号：频繁出现“he felt… / she realized… / this means that…”这类直接说明；改法通常是用动作、对话、环境细节、选择与后果来让含义自然浮现。"]}
{"word":"overtempt","summary":{"en":"“Overtempt” means to tempt someone too much or too strongly; it’s rare in modern English.","zh":"“overtempt”指“过度诱惑”，但在现代英语中较少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tempt someone too strongly or too often, making it hard for them to resist","zh":"过度诱惑；诱惑得太强或太频繁，以至于让人难以抗拒"},"examples":[{"en":"Don’t overtempt yourself by keeping snacks on your desk all day.","zh":"别把零食整天放在桌上来过度诱惑自己。"},{"en":"The store’s constant discounts can overtempt shoppers into buying things they don’t need.","zh":"商店持续打折可能会过度诱惑顾客买下不需要的东西。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to tempt too much, causing someone to make a wrong choice or take an unnecessary risk","zh":"（少见）诱惑过度，导致某人做出错误选择或承担不必要的风险"},"examples":[{"en":"He worried that easy credit would overtempt young adults into debt.","zh":"他担心容易获得的信贷会过度诱惑年轻人陷入债务。"}]}],"synonyms":["tempt too much","tempt excessively","be too tempting","overindulge"],"phonetic":"/ˌoʊvərˈtɛmpt/","extraExplanation":["“overtempt”在现代英语里非常不常见，多数词典不把它当作标准常用词。实际写作中更自然的表达通常是：tempt too much / tempt excessively / be too tempting / overindulge（偏“放纵”）。","构词很好理解：over-（过度）+ tempt（诱惑）。在正式写作中，如果担心读者不熟悉“overtempt”，建议改用更常见的搭配。"]}
{"word":"overtenacious","summary":{"en":"Overtenacious means “too persistent or unwilling to let go,” often with a critical tone.","zh":"overtenacious 指“过于执着/不肯放手”，通常带有批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively persistent, determined, or unwilling to let go; too tenacious.","zh":"过于执着的；过分顽强的；不肯放手的（带有“太过头”的语气）。"},"examples":[{"en":"He was overtenacious about winning, and it started to hurt the team’s morale.","zh":"他对赢这件事过于执着，开始伤害团队士气。"},{"en":"Her overtenacious grip on old habits made change difficult.","zh":"她对旧习惯抓得太紧（过于不放手），让改变变得很困难。"},{"en":"An overtenacious manager may keep pushing a plan even when the evidence says it’s failing.","zh":"过于执着的经理可能会在证据显示计划失败时仍继续硬推。"}]}],"synonyms":["too persistent","overly determined","unrelenting","stubborn","inflexible"],"phonetic":"/ˌoʊvərtəˈneɪʃəs/","extraExplanation":["“over-”表示“过度、过分”，所以 overtenacious 不是单纯的“坚持”，而是“坚持到不合时宜/让人困扰”的程度。","tenacious 常用于褒义（坚韧、不轻言放弃），加上 over- 之后往往带批评意味，暗示缺乏弹性或不懂得适时放手。"]}
{"word":"overtenaciously","summary":{"en":"“Overtenaciously” means doing something with excessive persistence or stubbornness.","zh":"“overtenaciously”指“过分执着/过度顽固地去做某事”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly persistent or stubborn way; with more determination than is appropriate or helpful.","zh":"过分执着地；过度顽固地（坚持到不合时宜或适得其反的程度）。"},"examples":[{"en":"He overtenaciously defended his opinion, even after seeing clear evidence.","zh":"即使看到了确凿证据，他仍过分执着地为自己的观点辩护。"},{"en":"The team overtenaciously pursued one strategy and ignored better options.","zh":"团队过度固执地追求一种策略，忽视了更好的选择。"},{"en":"She held on overtenaciously to a plan that no longer fit the situation.","zh":"她过分执着地坚持一个已不适合当前情况的计划。"}]}],"synonyms":["too stubbornly","too persistently","overly stubbornly","doggedly (often neutral/positive)","obstinately"],"phonetic":"/ˌoʊvɚtəˈneɪʃəsli/","extraExplanation":["“overtenaciously”由 over-（过度）+ tenacious（顽强的、执着的）+ -ly（副词后缀）构成，语气通常带有批评：强调“坚持过头”。","在写作中更常见的替代表达有：“too stubbornly / too persistently / overly stubbornly”。"]}
{"word":"overtenaciousness","summary":{"en":"Overtenaciousness means excessive tenacity—being too persistent or unwilling to let go.","zh":"overtenaciousness 指“过度执着/过分坚持”，即太不愿放手或坚持过头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too tenacious—holding on to an idea, goal, or person with more persistence than is helpful or appropriate","zh":"过度执着（或过分顽强/不肯放手）的状态：对想法、目标或人坚持过头，以至于不再有益或不合时宜"},"examples":[{"en":"His overtenaciousness in the meeting kept the team stuck on one minor detail for an hour.","zh":"他在会议上过度执着，让团队在一个小细节上卡了一个小时。"},{"en":"Sometimes overtenaciousness looks like loyalty, but it can turn into stubbornness.","zh":"有时过度执着看起来像忠诚，但也可能变成固执。"}]}],"synonyms":["excessive tenacity","stubbornness","obstinacy","overpersistence","inflexibility"],"phonetic":"/ˌoʊvərtəˈneɪʃəsnəs/","extraExplanation":["“overtenaciousness”由 over-（过度）+ tenacious（执着的、坚韧的）+ -ness（名词后缀）构成，意思就是“过度的执着/坚韧”。","这个词在日常英语里相对少见，更常用的表达是“excessive tenacity（过度的坚持）”“stubbornness（固执）”或“being too persistent（太过坚持）”。在正式写作中也可能写作“over-tenaciousness”。","语气上它通常带一点批评意味：不是赞美“坚韧”，而是指出“坚持到不合适的程度”。"]}
{"word":"overtenacity","summary":{"en":"Overtenacity means having too much tenacity—persistence that becomes stubborn or unproductive.","zh":"Overtenacity 指“过度的坚韧/执着”，即坚持到变得固执或没有成效。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive persistence or stubborn determination, especially when it becomes unhelpful or harmful.","zh":"过度的执着/顽强（尤其指这种坚持已经变得不合时宜，甚至有害）。"},"examples":[{"en":"Her overtenacity kept the team stuck on a failing plan.","zh":"她的过度执着让团队一直困在一个注定失败的方案里。"},{"en":"Overtenacity can look like courage, but it may also be fear of changing course.","zh":"过度的执着看起来像勇气，但也可能是害怕改变方向。"}]}],"synonyms":["excessive persistence","stubbornness","inflexibility","obstinacy"],"phonetic":"/ˌoʊvərtəˈnæsɪti/","extraExplanation":["“overtenacity”并不是非常常见的标准词汇，更常见的表达是“too much tenacity / excessive tenacity / stubborn persistence”。它由前缀“over-（过度）”+“tenacity（坚韧，顽强）”构成，用来强调“坚持过头了”。","语气通常带轻微批评：它不是在夸奖“坚持”，而是在提醒“该放手或该调整时却仍死扛”。在写作中也可用更自然的词如“stubbornness（固执）”或“inflexibility（不灵活）”来表达类似含义。"]}
{"word":"overtender","summary":{"en":"“Overtender” means overly tender/soft or overly sensitive; as a rare verb, it means to make something too tender.","zh":"“overtender”指“过于柔软/娇嫩或过于敏感”；作不常见的动词时指“使……变得过嫩”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too tender, soft, or delicate; overly sensitive (often to touch, pressure, criticism, or emotion).","zh":"过于柔软或娇嫩的；过于敏感的（常指对触碰、压力、批评或情绪反应太强）。"},"examples":[{"en":"The skin around the cut is still overtender, so try not to rub it.","zh":"伤口周围的皮肤仍然很娇嫩，所以尽量别去揉它。"},{"en":"He’s a bit overtender about feedback, so speak gently.","zh":"他对反馈有点过于敏感，所以说话委婉些。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something too tender or soft (rare).","zh":"使……变得过于柔软/过嫩（较少用）。"},"examples":[{"en":"If you cook the fish too long, you may overtender it and it will fall apart.","zh":"鱼煮太久可能会变得过嫩，最后一夹就散。"}]}],"synonyms":["oversensitive","too sensitive","overly tender","delicate","soft"],"phonetic":"/ˌoʊvɚˈtɛndɚ/","extraExplanation":["这个词在现代英语里比较少见，多见于较旧的写作或较正式的语境。结构上是 over-（“过度”）+ tender（“柔软/敏感的”），意思通常就是“过于……”。如果你想表达“太敏感”，更常用的说法还有 overly sensitive / too sensitive。"]}
{"word":"overtenderly","summary":{"en":"“Overtenderly” means “too tenderly/gently,” often suggesting excessive softness or sentiment.","zh":"“overtenderly”表示“过于温柔/过分体贴地”，常带有“温柔过头”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively tender, gentle, or sentimental way; more softly or emotionally than is appropriate or helpful.","zh":"过于温柔地；过分体贴/柔和（以至于不太合适或不一定有帮助）。"},"examples":[{"en":"She spoke overtenderly to the grown man, as if he were still a small child.","zh":"她对那个成年人说话过于温柔，仿佛他仍是个小孩子。"},{"en":"If you correct a mistake overtenderly, the message may not be clear.","zh":"如果你纠正错误时过于温柔，意思可能反而不够明确。"},{"en":"He treated the issue overtenderly, avoiding necessary criticism.","zh":"他处理这个问题时过于温和，回避了必要的批评。"}]}],"synonyms":["too tenderly","overly gently","excessively softly","overly sentimentally","too softly"],"phonetic":"/ˌoʊvərˈtɛndərli/","extraExplanation":["“over-”作前缀常表示“过度、太……”。因此 overtenderly = over + tenderly（温柔地），带有“温柔过头了”的评价色彩，常暗示这种温柔可能显得幼稚、溺爱或缺乏原则。","这个词相对少见，写作中更常用的替代表达有“too gently / too tenderly / overly sentimental(ly)”。"]}
{"word":"overtenderness","summary":{"en":"Overtenderness means being too tender or soft-hearted, sometimes to an unhelpful or overly sentimental degree.","zh":"Overtenderness 指“过度温柔/过于心软”，有时会发展成不利的感伤或缺乏原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive tenderness or softness in feeling, attitude, or behavior (often implying over-sentimentality or being too gentle).","zh":"过度的温柔或柔软（常含“过于感伤/过于心软、太轻柔”的意思）。"},"examples":[{"en":"His overtenderness made it hard for him to say no, even when he needed to set boundaries.","zh":"他过度心软，导致即使需要设立界限也很难说“不”。"},{"en":"She worried that her overtenderness would spoil the child by giving in too quickly.","zh":"她担心自己过度溺爱，会因为太快让步而把孩子惯坏。"},{"en":"The novel portrays her overtenderness as both a virtue and a weakness.","zh":"小说把她的过度温柔写成既是优点也是弱点。"}]}],"synonyms":["over-sentimentality","soft-heartedness","overindulgence","excessive gentleness"],"phonetic":"/ˌoʊvərˈtɛndərnəs/","extraExplanation":["这个词由前缀 over-（“过度”）+ tenderness（“温柔/柔情/柔软”）构成，语气上通常带一点批评或担忧：不是“温柔本身不好”，而是“温柔到影响判断或原则”。","在写作中，overtenderness 常用来描述一种容易心软、容易让步的性格特征；和 kindness（善良）相比，它更强调“过头了”的那一面。"]}
{"word":"overtense","summary":{"en":"Overtense means excessively tense or overly strained (rare in modern English).","zh":"overtense 指“过度紧张/过度紧绷”（在现代英语中较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) excessively tense; more tense than is normal or appropriate.","zh":"（罕见）过度紧张的；紧绷过头的；比正常或合适程度更紧张的。"},"examples":[{"en":"After weeks of deadlines, he felt overtense and couldn’t relax.","zh":"连续几周赶截止日期后，他感到过度紧张，怎么也放松不下来。"},{"en":"The meeting became overtense when people started blaming each other.","zh":"当人们开始互相指责时，会议气氛变得过度紧绷。"}]}],"synonyms":["overly tense","too tense","high-strung","on edge","strained"],"phonetic":"/ˌoʊvərˈtɛns/","extraExplanation":["“overtense”在现代英语里非常少见，更常见的表达是“overly tense”“too tense”“high-strung”“on edge”。在写作中如果想更自然，建议优先使用这些常见搭配。"]}
{"word":"overtensely","summary":{"en":"“Overtensely” means “too tensely; in an overly tense way,” but it’s rare/nonstandard.","zh":"“overtensely”意为“过于紧张地/太紧绷地”，但用法较少见、偏不规范。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly tense or strained way; too tensely (rare/nonstandard).","zh":"以过于紧张或绷着的方式；太紧绷地（较少见/不太规范用法）。"},"examples":[{"en":"He spoke overtensely during the interview, as if every word might be judged.","zh":"他在面试时说话过于紧张，好像每个词都会被评判。"},{"en":"The scene is acted overtensely, so the characters feel less natural.","zh":"这段戏演得过于紧绷，所以角色显得不够自然。"}]}],"synonyms":["too tensely","overly tensely","in an overly tense way","strainedly"],"phonetic":"ˌoʊvərˈtɛnsli","extraExplanation":["“overtensely”在现代英语里非常少见，很多写作者会改用更自然的表达，如“too tensely”“overly tensely”或“in an overly tense way”。","构词上可理解为 over-（过度）+ tensely（紧张地），意思清楚，但因为不常用，正式写作中建议换成更常见的说法以避免读者觉得生硬或像拼写错误。"]}
{"word":"overtenseness","summary":{"en":"Overtenseness means being too tense or overly nervous/strained.","zh":"Overtenseness 指过度紧张或过分绷紧的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being excessively tense, nervous, or strained (physically or emotionally)","zh":"过度紧张；过分绷紧（身体或情绪上的）"},"examples":[{"en":"Her overtenseness before the exam made it hard to sleep.","zh":"考试前她过度紧张，几乎睡不着。"},{"en":"The coach noticed overtenseness in the team’s movements and told them to relax.","zh":"教练注意到队员动作过于紧绷，便让大家放松。"},{"en":"Deep breathing can reduce overtenseness during stressful meetings.","zh":"在压力大的会议中，深呼吸可以减轻过度紧张。"}]}],"synonyms":["excessive tension","nervousness","strain","tightness","stress"],"phonetic":"/ˌoʊvərˈtensnəs/","extraExplanation":["“overtenseness”由 over-（过度）+ tense（紧张的）+ -ness（名词后缀）构成，强调“紧张程度超过正常或有益的范围”。","它更常见于描述心理状态或身体肌肉的紧绷；日常英语里更常用的说法通常是“excessive tension / extreme nervousness / being too tense”。"]}
{"word":"overtension","summary":{"en":"Overtension means excessive tension or strain; in some technical contexts it can also mean overvoltage.","zh":"Overtension 指过度紧张或拉力；在少数技术语境中也可指过电压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive tension or strain (physical, mental, or mechanical).","zh":"过度的紧张或拉力（身体、心理或机械方面）。"},"examples":[{"en":"Weeks of overtime led to overtension and poor sleep.","zh":"连续几周加班造成过度紧张，睡眠也变差了。"},{"en":"If the rope is under overtension, it may snap suddenly.","zh":"如果绳子受力过度，可能会突然断裂。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical, less common) a condition of unusually high electrical tension; overvoltage.","zh":"（技术用语，较少见）异常偏高的电压；过电压。"},"examples":[{"en":"The surge protector is designed to reduce damage from overtension.","zh":"浪涌保护器用于减少过电压造成的损坏。"}]}],"synonyms":["excessive tension","strain","overstrain","overstress","(technical) overvoltage"],"phonetic":"/ˌoʊvərˈtɛnʃən/","extraExplanation":["“Overtension”在现代英语里相对少见，日常表达更常用“too much tension / excessive tension”，或根据语境用“overstrain（过度用力/过度紧张）”“overstress（过度压力）”。","在电工/工程语境中，“tension”有时可指“电压”（源自法语等语言传统），因此“overtension”偶尔被用来表示“overvoltage（过电压）”。"]}
{"word":"overterrible","summary":{"en":"“Overterrible” means extremely terrible or frightening (rare/poetic).","zh":"“overterrible”指“极其可怕的/糟糕透顶的”，但用法较少见，偏文学或古风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely terrible; so frightening or bad that it feels overwhelming (rare, often poetic/old-fashioned).","zh":"极其可怕的；糟糕到令人难以承受的（少见，多用于诗歌或较旧的文体）。"},"examples":[{"en":"The storm’s overterrible noise kept the villagers awake all night.","zh":"暴风雨极其可怕的声响让村民整夜未眠。"},{"en":"She described the accident in overterrible detail, and everyone fell silent.","zh":"她把事故描述得极其骇人，所有人都沉默了。"}]}],"synonyms":["horrifying","awful","dreadful","terrible","appalling","frightful"],"phonetic":"/ˌoʊvərˈtɛrəbəl/","extraExplanation":["“overterrible”是由前缀 over-（表示“过度、非常、超出”）+ terrible 组成的复合形容词。它不是现代英语里的常用词，更常见的是 very/so/extremely terrible，或 horrifying/awful。","这种“over- + 形容词”的造法在较旧或较有文学感的英语里更常见，用来加强情绪与戏剧效果；在正式写作或日常口语中使用可能显得夸张或古风。"]}
{"word":"overtest","summary":{"en":"“Overtest” means testing too much; it can also mean an extra/repeated test (less common).","zh":"“overtest”指“过度测试/考试”；也可指“复测/追加测试”（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to test something more than necessary, especially so much that it causes problems (like stress, wasted time, or unfair evaluation)","zh":"对某事进行过度测试；测试过多（尤指多到造成压力、浪费时间或评估不公平）"},"examples":[{"en":"Some teachers worry that students are being overtested and losing time for creative projects.","zh":"一些老师担心学生被过度考试，导致创造性项目的时间被挤占。"},{"en":"If we overtest the app, we may delay the release without finding many new issues.","zh":"如果我们对这个应用过度测试，可能会在发现不了多少新问题的情况下推迟发布。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an extra or repeated test used to check results again","zh":"（较少见）复测；追加测试（用于再次核对结果）"},"examples":[{"en":"The lab ran an overtest to confirm the first measurement.","zh":"实验室做了一次复测来确认第一次测量结果。"}]}],"synonyms":["over-test","test excessively","excessive testing","overexamine","overassess"],"phonetic":"/ˌoʊvɚˈtɛst/","extraExplanation":["“overtest”不是非常固定的日常词汇，更常见的写法是“over-test”（加连字符）或用短语表达：be tested too much / excessive testing。教育语境里常指“考试过多”，工程/软件语境里常指“测试过度、投入超过收益”。"]}
{"word":"overtheatrical","summary":{"en":"“Over-theatrical” means overly dramatic or showy, as if someone is acting rather than being natural.","zh":"“over-theatrical”指过分夸张、做作、像在演戏一样不自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too dramatic or exaggerated in a way that feels like acting; not natural or sincere.","zh":"过分戏剧化的；表演痕迹太重的；夸张得不自然的。"},"examples":[{"en":"His apology sounded over-theatrical, like he was performing for the whole office.","zh":"他的道歉听起来过分戏剧化，像是在给整个办公室表演。"},{"en":"The over-theatrical music made the scene feel less believable.","zh":"过分戏剧化的配乐让这段情节显得不太真实。"},{"en":"She can be a bit over-theatrical when she tells stories.","zh":"她讲故事时有时会有点过分戏剧化。"}]}],"synonyms":["overdramatic","melodramatic","exaggerated","showy","hammy"],"phonetic":"/ˌoʊvərθiˈætrɪkəl/","extraExplanation":["“over-”是常见前缀，表示“过度/过分”（如: overconfident 过于自信）。因此 over-theatrical 通常带有轻微负面评价，暗示“为了效果而夸张”，容易让人觉得不真诚。","拼写上常见两种形式：over-theatrical（带连字符，更像复合形容词）和 overtheatrical（不带连字符，较少见）。写作中更常用 over-theatrical。"]}
{"word":"overtheatrically","summary":{"en":"“Overtheatrically” means doing something in an overly dramatic, showy way.","zh":"“overtheatrically”表示以过度夸张、做作、戏剧化的方式行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively dramatic or showy way; more theatrically than is appropriate for the situation.","zh":"以过分戏剧化、夸张做作的方式；比情境所需更“演”。"},"examples":[{"en":"He apologized overtheatrically, as if he were on stage instead of in a meeting.","zh":"他道歉时过分戏剧化，仿佛在舞台上而不是在会议室里。"},{"en":"She laughed overtheatrically to get everyone’s attention.","zh":"她为了吸引大家注意而夸张地大笑。"}]}],"synonyms":["overly dramatically","too theatrically","exaggeratedly","melodramatically"],"phonetic":"/ˌoʊvərθiˈætrɪkli/","extraExplanation":["“overtheatrically”不是最常见的标准拼写；更常见的表达是“overly theatrically”或“too theatrically”。它由“over-（过度）+ theatrically（戏剧性地）”组成，用来强调“演过头/做作”。在正式写作中建议用更常见的搭配。"]}
{"word":"overtheatricalness","summary":{"en":"“overtheatricalness” means the quality of being overly theatrical or dramatically exaggerated.","zh":"“overtheatricalness”指“过分戏剧化、夸张做作的特质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too theatrical or dramatic in behavior, speech, or presentation (often in a way that feels exaggerated or insincere).","zh":"过分戏剧化（做作、夸张）的特质；过度表演感（常带有不真诚或让人出戏的感觉）。"},"examples":[{"en":"Her overtheatricalness in the meeting made it hard to focus on the actual problem.","zh":"她在会议上过分戏剧化的表现让人很难把注意力放在真正的问题上。"},{"en":"The speech lost impact because its overtheatricalness felt more like acting than sincerity.","zh":"这场演讲因为过度表演感而削弱了感染力，让人觉得更像在演戏而不是真诚表达。"}]}],"synonyms":["overacting","excessive dramatics","too much theatrics","melodrama","affectedness"],"phonetic":"/ˌoʊvɚ θiˈætrɪkəlnəs/","extraExplanation":["“overtheatricalness”不是常见的标准拼写；更自然的写法通常是“over-theatricalness”（加连字符）或直接用更常见的名词/表达，如“overacting”（用力过猛的表演/做作）、“excessive dramatics”（过度戏剧化）、“too much theatrics”（太多戏）。","构词思路：over-（过度）+ theatrical（戏剧化的）+ -ness（把形容词变成名词，表示“……的性质/状态”）。在正式写作里，建议改用更常见词，以免读者觉得生造或难读。"]}
{"word":"overtheorization","summary":{"en":"Over-theorization means adding too much theory or abstract explanation, making something less clear or less useful.","zh":"Over-theorization 指“过度理论化”：加入过多理论或抽象解释，导致不够清楚或不够实用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of explaining something with too much theory or abstract thinking, often making it less clear or less practical","zh":"过度理论化；用过多理论或抽象思维来解释事物，反而让内容不清晰或不实用"},"examples":[{"en":"The report suffers from over-theorization and doesn’t offer clear steps we can follow.","zh":"这份报告过度理论化，没有提供我们能照着做的清晰步骤。"},{"en":"Sometimes over-theorization hides the simple truth of what happened.","zh":"有时过度理论化会掩盖事情发生的简单真相。"}]}],"synonyms":["overanalysis","overthinking","excessive theorizing","overintellectualization"],"phonetic":"/ˌoʊvɚˌθiːɚəˈzeɪʃən/","extraExplanation":["常见拼写是 **over-theorization**（美式）或 **over-theorisation**（英式）。也有人写成不加连字符的 **overtheorization**，但较少见。","这个词多用于学术写作、评论或管理沟通中，带有批评意味：不是“有理论”不好，而是“理论太多、离实际太远”。"]}
{"word":"overtheorize","summary":{"en":"Overtheorize means to overthink something in a theoretical, abstract way that becomes impractical.","zh":"overtheorize 指“过度理论化/用理论想太多”，导致不切实际或忽略重点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To think about something too much in terms of theories or abstract ideas, often in a way that becomes impractical or misses what actually matters.","zh":"过度理论化；用理论/抽象概念想得太多，以至于变得不切实际或忽略了关键事实。"},"examples":[{"en":"We’re overtheorizing this—let’s look at the data and make a simple plan.","zh":"我们把这事过度理论化了——先看数据，制定一个简单的方案吧。"},{"en":"It’s easy to overtheorize relationships instead of having an honest conversation.","zh":"人际关系很容易被过度理论化，而不是好好进行一次坦诚的交流。"},{"en":"The professor warned us not to overtheorize a poem and forget to enjoy its language.","zh":"教授提醒我们别把诗歌过度理论化，以至于忘了欣赏它的语言之美。"}]}],"synonyms":["overthink","overanalyze","intellectualize (too much)","overcomplicate"],"phonetic":"/ˌoʊvɚˈθiəˌraɪz/","extraExplanation":["更常见的拼写是 **over-theorize**（带连字符）或 **over-theorise**（英式拼写）。你写的 **overtheorize** 也能被理解，但在正式写作中不如前两种常见。","语气上通常带一点批评或自嘲：强调“想太多、讲理论讲过头”，反而拖慢决策或脱离现实。"]}
{"word":"overtheorized","summary":{"en":"“Overtheorized” means made too theoretical—explained with more theory than is useful or practical.","zh":"“overtheorized”表示“过度理论化的”：用过多理论来解释或讨论，超出了实用需要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Explained or discussed with too much abstract theory, making it feel overly complex or less practical.","zh":"被过度理论化的；用太多抽象理论来解释或讨论，显得过于复杂或不够实用。"},"examples":[{"en":"The essay is smart, but it feels overtheorized and hard to follow.","zh":"这篇文章很聪明，但感觉被过度理论化了，不太好读。"},{"en":"We need a simple plan—this meeting is getting overtheorized.","zh":"我们需要一个简单的方案——这场会议正在变得过度理论化。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “overtheorize”: to add too much theory to something, instead of focusing on evidence or real-world use.","zh":"“overtheorize”的过去式：对某事加入过多理论阐释，而不是关注证据或实际应用。"},"examples":[{"en":"They overtheorized the problem and missed the obvious solution.","zh":"他们把问题过度理论化了，反而错过了显而易见的解法。"},{"en":"I overtheorized my interview answers instead of speaking naturally.","zh":"我把面试回答过度理论化了，没有自然表达。"}]}],"synonyms":["overanalyzed","too theoretical","overcomplicated","academic","abstract"],"phonetic":"/ˌoʊvərˈθiəˌraɪzd/","extraExplanation":["“overtheorized”常见写法也会写成带连字符的“over-theorized”，意思相同；学术写作里更常见带连字符的形式。","语气上通常带一点批评：强调“理论太多、落地太少”，并不一定是否定理论本身。"]}
{"word":"overtheorizing","summary":{"en":"Overtheorizing means using too much theory—overthinking and making something more complex than it needs to be.","zh":"Overtheorizing 指过度理论化：想太多、讲理论过头，把事情搞得不必要地复杂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"spending too much time creating or debating theories, instead of focusing on facts, practical action, or simple explanations","zh":"过度理论化；花太多时间建构或争论理论，而忽略事实、行动或更简单的解释"},"examples":[{"en":"The project stalled because of overtheorizing instead of testing ideas quickly.","zh":"项目停滞了，因为大家一直过度理论化，而不是快速测试想法。"},{"en":"Her essay is smart, but some overtheorizing makes the main point harder to see.","zh":"她的文章很聪明，但有些过度理论化让主旨更难看出来。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of explaining something with too much theory, often making it complicated or unrealistic (present participle/gerund of “overtheorize”)","zh":"过度用理论来解释（常使事情变复杂或不切实际）；“overtheorize”的现在分词/动名词形式"},"examples":[{"en":"Stop overtheorizing and look at the data in front of you.","zh":"别再过度理论化了，看看眼前的数据。"},{"en":"We kept overtheorizing the relationship, but a simple conversation helped more.","zh":"我们一直在对这段关系过度理论化，但一次简单的沟通更有帮助。"}]}],"synonyms":["overthinking","overanalysis","overanalyzing","excessive theorizing","overcomplicating"],"phonetic":"ˌoʊvɚˈθiəˌraɪzɪŋ","extraExplanation":["“overtheorizing”常带轻微批评语气，表示“想太多、讲理论讲过头”。在学术讨论、影评/文评、职场决策中都常见。","更自然的常用写法是动词“overtheorize”。名词也可用“overtheorizing”（不可数）或更正式的“over-theorization/over-theorisation”。英式拼写有时会加连字符。"]}
{"word":"overthick","summary":{"en":"Overthick means “too thick” or “thicker than it should be.”","zh":"overthick 指“过厚的、厚得不合适的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too thick; thicker than is normal, comfortable, or needed.","zh":"过厚的；厚得不正常、不舒服或不需要的。"},"examples":[{"en":"The paint went on overthick and started to drip down the wall.","zh":"油漆刷得太厚，开始沿着墙面往下滴。"},{"en":"He wore an overthick coat for the mild weather and quickly got hot.","zh":"天气并不冷，他却穿了件过厚的外套，很快就觉得热。"}]}],"synonyms":["too thick","overly thick","excessively thick","thick"],"phonetic":"/ˌoʊvərˈθɪk/","extraExplanation":["“over-”是英语里常见前缀，表示“过度、超过适当程度”（如 overcook 煮过头、overconfident 过度自信）。因此 overthick 通常用于强调“厚得不合适”。","overthick 更常见于描述“涂层、液体、材料、衣物”等的厚度；更自然的替代表达有 “too thick” 或 “overly thick”。"]}
{"word":"overthickly","summary":{"en":"“Overthickly” means “too thickly” or “excessively thick/dense.”","zh":"“overthickly”表示“过于厚（浓、密）地”，相当于“too thickly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"too thickly; in a way that is excessively thick, dense, or heavy","zh":"过于厚（或过于浓、过于密）；厚得过头地"},"examples":[{"en":"The sauce was made overthickly, so it tasted heavy and starchy.","zh":"这酱汁勾芡勾得过厚，所以吃起来很厚重、带淀粉味。"},{"en":"He spread the butter overthickly on the toast.","zh":"他在吐司上抹黄油抹得太厚了。"},{"en":"The paint was applied overthickly, leaving visible brush marks.","zh":"油漆刷得太厚，留下了明显的刷痕。"}]}],"synonyms":["too thickly","overly thickly","excessively thickly","thickly (too much)"],"phonetic":"/ˌoʊvɚˈθɪkli/","extraExplanation":["“over-”是常见前缀，表示“过度/太……”，如：overcook（煮过头）、overreact（反应过度）。因此 overthickly 通常带有“做过头了”的评价意味，多用于烹饪（酱汁、汤）、涂抹（黄油、膏体）、涂漆/化妆等语境。","在实际写作中，更常见的表达是 “too thickly” 或 “overly thick(ly)”。overthickly 偏少见，但意思清晰、容易从构词猜到。"]}
{"word":"overthickness","summary":{"en":"Overthickness means being thicker than required, especially in technical or manufacturing contexts.","zh":"Overthickness 指“过厚”，多用于技术/制造场景，表示厚度超出要求或规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being thicker than required or expected; excess thickness beyond a standard or specification","zh":"过厚；超出要求或规范的厚度（多指超过公差/设计值的厚度）"},"examples":[{"en":"The inspector noted overthickness on the steel plate, so it failed the tolerance check.","zh":"检验员发现这块钢板存在过厚，因此未通过公差检查。"},{"en":"Overthickness can add weight and increase material cost in aircraft parts.","zh":"在飞机零件中，过厚会增加重量并提高材料成本。"},{"en":"We need to correct the overthickness by re-machining the surface.","zh":"我们需要通过重新加工表面来修正过厚问题。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount of extra thickness (the surplus thickness itself)","zh":"多余的厚度（指超出部分本身）"},"examples":[{"en":"The overthickness was about 0.5 millimeters after coating.","zh":"涂层后多余的厚度大约是0.5毫米。"},{"en":"They measured the overthickness at several points along the pipe.","zh":"他们在管道多个位置测量了多余厚度。"}]}],"synonyms":["excess thickness","extra thickness","oversize thickness","too much thickness"],"phonetic":"/ˌoʊvərˈθɪknəs/","extraExplanation":["“overthickness”常见于工程、制造、材料与质检语境，尤其是在图纸尺寸、公差（tolerance）、涂层/镀层厚度（coating thickness）或板材/管材壁厚（wall thickness）等指标管理中。","日常英语里更常用的表达是“too thick”“excess thickness”或“thicker than spec”。在正式技术文件或检验报告中才更可能看到“overthickness”。"]}
{"word":"overthin","summary":{"en":"Overthin means “too thin,” or “to make something too thin.”","zh":"overthin 表示“过瘦/过薄”，也可表示“使……变得过薄（过度稀释/稀疏）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too thin; thinner than is healthy, comfortable, or suitable","zh":"过瘦的；薄得过头的（不健康、不舒服或不合适）"},"examples":[{"en":"The fabric is overthin, so it tears easily.","zh":"这布料太薄了，所以很容易撕破。"},{"en":"After weeks of dieting, she looked overthin and tired.","zh":"节食了好几周后，她看起来过瘦而且很疲惫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something too thin by removing too much material or too many parts","zh":"使……变得过薄；过度稀疏（去除过多材料或部分）"},"examples":[{"en":"If you overthin the sauce, it won’t coat the noodles well.","zh":"如果把酱汁调得太稀，它就不太能裹住面条。"},{"en":"The gardener overthinned the seedlings, leaving the bed looking bare.","zh":"园丁把幼苗间苗过头了，菜畦看起来光秃秃的。"}]}],"synonyms":["too thin","thin","skinny","underweight","attenuated","overdilute"],"phonetic":"/ˌoʊvɚˈθɪn/","extraExplanation":["“overthin”更常见的写法是带连字符的“over-thin”（尤其作形容词时），表示“过于薄/过瘦”。在烹饪、园艺、林业等语境里也可作动词用，意思是“稀释/间苗/疏伐过度”。"]}
{"word":"overthink","summary":{"en":"“Overthink” means to think too much, often causing worry or making decisions harder.","zh":"“overthink”指想太多、想过头，常引发焦虑或让决策更困难。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To think about something too much or for too long, often in a way that creates unnecessary worry or makes decisions harder.","zh":"（对某事）想太多、想过头，常常导致不必要的担心或让做决定更困难。"},"examples":[{"en":"Try not to overthink it—you already made a good choice.","zh":"别想太多——你已经做了一个很好的选择。"},{"en":"I always overthink texts and worry about how they sound.","zh":"我总是对短信内容想太多，担心语气听起来怎么样。"},{"en":"We overthought the plan and wasted time instead of starting.","zh":"我们把计划想得太复杂，结果浪费了时间而没有开始。"}]}],"synonyms":["overanalyze","obsess over","dwell on","ruminate"],"phonetic":"/ˌoʊvərˈθɪŋk/","extraExplanation":["“overthink”是日常口语里很常见的自我描述，语气通常带一点自嘲或劝慰，意思不是“认真思考”，而是“过度分析”。","常见搭配：overthink it / overthink things / overthink every detail。也常和情绪词连用：overthink and worry / overthink and stress out。","近义表达（语气不同）：overanalyze（更书面、偏“过度分析”）；obsess over（更强烈，接近“纠结/执念”）；ruminate（更偏“反复琢磨/反刍”，语气较书面）。"]}
{"word":"overthinly","summary":{"en":"Overthinly means “too thinly” or “so thin that it becomes weak, insufficient, or ineffective.”","zh":"overthinly 表示「過於薄地／過於稀薄地」，薄到不夠、變弱或效果不好。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too thin, too spread out, or too weak because it has been made thin or diluted too much.","zh":"過於薄地；過於稀薄地（指被做得太薄、攤得太開，或稀釋得太多而顯得不夠）"},"examples":[{"en":"She sliced the onions overthinly, so they burned quickly in the pan.","zh":"她把洋蔥切得過薄，所以在鍋裡很快就焦了。"},{"en":"The paint was applied overthinly, and the old color showed through.","zh":"油漆刷得太薄，底下的舊顏色都透出來了。"},{"en":"He spread the butter overthinly, so the toast tasted dry.","zh":"他把奶油抹得太薄，所以吐司吃起來很乾。"}]}],"synonyms":["too thinly","overly thinly","insufficiently thickly","thinly (too much)"],"phonetic":"/ˌoʊvɚˈθɪnli/","extraExplanation":["「over-」是常見前綴，表示「過度、太……」。因此 overthinly 多用來批評結果「薄過頭／稀過頭」，常見於烹飪（切得太薄、抹得太薄）、塗料（刷得太薄）、或比喻用法（內容寫得太稀、論點太薄弱）。","這個字在日常口語中不算常見；更自然的說法常是「too thinly」或「spread/slice/apply it too thin」等。"]}
{"word":"overthinness","summary":{"en":"“Overthinness” means being too thin, often to an unhealthy or concerning degree.","zh":"“overthinness”指过度消瘦、过瘦，常带有可能不健康或令人担忧的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being too thin, often in a way that may be unhealthy or worrying","zh":"过度消瘦；过瘦（常指可能不健康或令人担忧的状态）"},"examples":[{"en":"The doctor was concerned about the child’s overthinness and ordered some tests.","zh":"医生担心孩子过度消瘦，于是安排了一些检查。"},{"en":"Her overthinness was noticeable after she skipped meals for weeks.","zh":"她连续几周不按时吃饭后，过度消瘦变得很明显。"},{"en":"The program focuses on nutrition and recovery rather than judging overthinness.","zh":"该项目强调营养与康复，而不是评判过度消瘦。"}]}],"synonyms":["extreme thinness","being underweight","underweight"],"phonetic":"/ˌoʊvərˈθɪn.nəs/","extraExplanation":["“overthinness”由 over-（过度）+ thin（瘦）+ -ness（名词后缀）构成，意思直观，但在日常英语里不算特别常用；更常见的表达包括 “being underweight”（体重过低）或 “extreme thinness”（极度消瘦）。","在谈到体重与外貌时，英语语境里常强调健康与尊重个人感受；如果涉及饮食失调等敏感话题，常用更中性的说法，如 “health concerns” 或 “medical risks”。"]}
{"word":"overthought","summary":{"en":"“Overthought” usually means you thought about something too much (past of overthink); less commonly, it describes something made overly complicated.","zh":"“overthought”通常表示“想太多了”（overthink 的过去式/过去分词）；较少情况下作形容词，指“被弄得过于复杂”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “overthink”: to think about something too much or for too long, often causing worry or confusion.","zh":"“overthink”的过去式和过去分词：对某事想得太多或太久，常导致焦虑或混乱。"},"examples":[{"en":"I overthought the interview question and gave a confusing answer.","zh":"我把面试问题想得太多，结果回答得很混乱。"},{"en":"She realized she had overthought the situation and decided to ask directly.","zh":"她意识到自己把情况想太多了，于是决定直接问清楚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) thought about too much; made more complicated than necessary.","zh":"（较少见）被想得过多的；被弄得比必要更复杂的。"},"examples":[{"en":"The plot feels overthought and hard to follow.","zh":"这个情节显得过度设计，让人难以跟上。"},{"en":"Sometimes a simple plan is better than an overthought one.","zh":"有时候简单的计划比想得过多的计划更好。"}]}],"synonyms":["overanalyzed","overconsidered","obsessed (about)","dwelt on","overcomplicated","overengineered"],"phonetic":"/ˌoʊvərˈθɔt/","extraExplanation":["“overthought”最常见用法是动词形式（overthink 的过去式/过去分词），口语里也常用完成时：I’ve overthought it. / Don’t overthink it（别想太多）。","形容词用法相对少见，更常用的表达包括：overly complicated（过于复杂）、overengineered（过度设计）、trying too hard（用力过猛）。"]}
{"word":"overthoughtful","summary":{"en":"Overthoughtful means thinking too much or being overly careful in a way that isn’t helpful.","zh":"overthoughtful 指“想太多、过度周到/谨慎”，以至于反而不太有帮助。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thinking too much about something; overly careful, detailed, or cautious in a way that can slow decisions or feel unnecessary.","zh":"想得太多的；过度谨慎或过于细致的（有时会导致犹豫、拖延或显得没必要）。"},"examples":[{"en":"I’m being overthoughtful about this email—I’ve rewritten it five times.","zh":"我写这封邮件想得太多了——我都重写了五遍。"},{"en":"Her overthoughtful planning made the simple trip feel stressful.","zh":"她过度周全的计划让原本简单的旅行变得有压力。"},{"en":"Try not to be overthoughtful; a clear, simple answer is enough.","zh":"别想得太多；清楚、简单的回答就够了。"}]}],"synonyms":["overthinking","overly cautious","too meticulous","overly careful","overanxious"],"phonetic":"/ˌoʊvɚˈθɔt.fəl/","extraExplanation":["“overthoughtful”不是最常见的标准词汇，更常见的说法是“overthinking / overthink”或“overly thoughtful”。它通常带一点“过度、反而不好”的语气：本来是体贴或认真，但因为想太多而变成负担。","语气差异：thoughtful（体贴/周到，褒义）→ overthoughtful（过度周到/过度想太多，偏贬或自嘲）。如果想更中性，可以说“very thoughtful”或“careful”。"]}
{"word":"overthoughtfully","summary":{"en":"“Overthoughtfully” means “in an overthinking, overly complicated way.”","zh":"“overthoughtfully”表示“以过度思考、把事情想复杂的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves thinking too much about something, often making it more complicated or stressful than necessary.","zh":"以过度思考的方式；想太多，常把事情弄得更复杂或更焦虑。"},"examples":[{"en":"I overthoughtfully reread the email five times before sending it.","zh":"我想太多，把那封邮件反复读了五遍才发出去。"},{"en":"She answered the simple question overthoughtfully, adding details no one needed.","zh":"她对一个简单的问题想太多，回答时加了许多没人需要的细节。"},{"en":"He planned the trip overthoughtfully and ended up feeling exhausted before it even started.","zh":"他对旅行计划想太多，结果还没出发就已经很累了。"}]}],"synonyms":["overthinkingly","excessively","too carefully","overanxiously"],"phonetic":"/ˌoʊvərˈθɔt.fəli/","extraExplanation":["“overthoughtfully”并不算非常常见，更自然的表达常用“in an overthinking way”“with too much thought”或直接说“overthink”。这个词由“over-（过度）+ thoughtfully（深思地）”构成，语气带一点自我吐槽或轻微批评，表示把简单事想得太复杂。"]}
{"word":"overthoughtfulness","summary":{"en":"Overthoughtfulness means thinking or considering something too much, often making you anxious or overly careful.","zh":"Overthoughtfulness 指“想太多/过度斟酌”，常让人焦虑或显得过分谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit of thinking too much about something, often in a way that causes worry, doubt, or makes a decision harder","zh":"过度思考（想太多），常导致焦虑、怀疑，或让决定更难做"},"examples":[{"en":"Her overthoughtfulness turned a simple email into an hour-long task.","zh":"她的过度思考把一封简单的邮件写成了一个小时的任务。"},{"en":"Overthoughtfulness can make you doubt choices that were already good enough.","zh":"过度思考会让你怀疑那些其实已经足够好的选择。"},{"en":"He struggled with overthoughtfulness before every presentation.","zh":"他每次演讲前都会因为想太多而很煎熬。"}]},{"partOfSpeech":"n.","definition":{"en":"excessive carefulness or overly detailed consideration, especially in planning or wording","zh":"过分谨慎；过度斟酌（尤其在计划或措辞上过于细致）"},"examples":[{"en":"The proposal suffered from overthoughtfulness and lost its clear main point.","zh":"这份提案因为过分斟酌而失去了清晰的重点。"},{"en":"Sometimes a little less overthoughtfulness helps your writing sound more natural.","zh":"有时少一点过度斟酌，会让你的写作更自然。"}]}],"synonyms":["overthinking","rumination","overanalysis","excessive caution","overconcern"],"phonetic":"/ˌoʊvɚˈθɔt.fəl.nəs/","extraExplanation":["这个词由 over-（过度）+ thoughtful（深思的/体贴的）+ -ness（名词后缀）组成。它不是非常常见的标准词汇，更常见的说法是 overthinking（过度思考）或 rumination（反刍式反复思考，偏心理学语境）。在正式写作中用 overthoughtfulness 会显得更“文学化”或更个人化。"]}
{"word":"overthrew","summary":{"en":"“Overthrew” is the past tense of “overthrow”: it means to remove a ruler/government from power, or to knock something over.","zh":"“Overthrew”是“overthrow”的过去式：可指推翻统治者/政府，也可指把东西打翻、推倒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense of “overthrow”) To remove a government, leader, or system from power, usually by force or a sudden change.","zh":"（overthrow 的过去式）推翻（政府、领导人或制度），通常通过武力或突发的变革。"},"examples":[{"en":"The rebels overthrew the dictator after years of conflict.","zh":"叛军在多年的冲突后推翻了独裁者。"},{"en":"In the story, the hero overthrew the cruel king and freed the people.","zh":"在故事里，英雄推翻了残暴的国王，解放了人民。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense of “overthrow”) To knock something down or turn it upside down by accident or force.","zh":"（overthrow 的过去式）（意外或用力）打翻、推倒、颠覆某物。"},"examples":[{"en":"He bumped the table and overthrew a glass of water.","zh":"他撞到桌子，把一杯水打翻了。"},{"en":"The strong wind overthrew several chairs on the patio.","zh":"大风把露台上的几把椅子吹倒了。"}]}],"synonyms":["toppled","ousted","deposed","overturned","knocked over"],"phonetic":"/ˌoʊvərˈθru/","extraExplanation":["“Overthrow”是不规则动词：overthrow（原形）→ overthrew（过去式）→ overthrown（过去分词）。","在新闻与历史语境中，overthrow常与 coup（政变）、regime（政权）、dictator（独裁者）等词搭配：overthrow a regime / overthrow the government。"]}
{"word":"overthriftily","summary":{"en":"“Overthriftily” means doing something too thriftily—saving money in an excessive, often unwise way.","zh":"“overthriftily”表示“过度节俭地”，强调省钱省到不明智、甚至产生负面后果。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly thrifty way; too focused on saving money, often to an unreasonable or harmful degree.","zh":"以过度节俭的方式；过分强调省钱，常带有不合理或有害的意味。"},"examples":[{"en":"He lived overthriftily and refused to replace even broken essentials.","zh":"他过度节俭，连坏掉的生活必需品也拒绝更换。"},{"en":"The project failed because the team planned overthriftily and cut the budget for safety.","zh":"这个项目失败了，因为团队规划得过度节俭，把安全预算也削减了。"},{"en":"Don’t shop overthriftily—buying the cheapest option can cost more later.","zh":"别过度节俭地购物——买最便宜的选项以后可能更花钱。"}]}],"synonyms":["too thriftily","overly thriftily","excessively frugally","stingily","penny-pinching (informal)"],"phonetic":"/ˌoʊvɚˈθrɪf.tə.li/","extraExplanation":["“overthriftily”= over-（过度）+ thrifty（节俭的）+ -ly（副词后缀）。语气通常偏负面，强调“省到不合理/影响质量或生活”。","日常英语里更常见的表达是：“too thriftily / overly thriftily / in an overly thrifty way”，而“overthriftily”本身相对少见，写作中可能出现。"]}
{"word":"overthriftiness","summary":{"en":"Overthriftiness means being excessively thrifty—saving money in an unreasonable, often stingy way.","zh":"overthriftiness 指“过度节俭”，省钱省到不合理、近似吝啬的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive thrift; saving money so strongly that it becomes unreasonable, unkind, or harmful (similar to being “stingy”).","zh":"过度节俭；把省钱做得太过头，以至于显得不合理、刻薄或有害（近似“吝啬”）。"},"examples":[{"en":"His overthriftiness meant he skipped necessary doctor visits just to save money.","zh":"他过度节俭，为了省钱连必要的看病都不去。"},{"en":"Overthriftiness can damage relationships when it turns every shared expense into an argument.","zh":"当过度节俭让每一笔共同开销都变成争吵时，人际关系就会受损。"},{"en":"She admired frugality, but not the overthriftiness that made people feel unwelcome.","zh":"她欣赏节俭，但不喜欢那种让人感到不受欢迎的过度节俭。"}]}],"synonyms":["stinginess","miserliness","excessive frugality","penny-pinching","tightfistedness"],"phonetic":"/ˌoʊvɚˈθrɪftiˌnɛs/","extraExplanation":["“overthriftiness”由 over-（过度）+ thrift（节俭）+ -iness（名词后缀，表示某种性质/状态）组成，字面意思就是“节俭过度的状态”。","这个词并不常见，更常用的表达是 “stinginess”（吝啬）或 “excessive frugality”（过度节俭）。与 thrift/frugality（通常偏褒义）相比，overthriftiness 带明显贬义，强调“省到不合理”。"]}
{"word":"overthrifty","summary":{"en":"Overthrifty means saving money too much—being excessively thrifty in a way that becomes unreasonable or stingy.","zh":"overthrifty 指“节俭过头”，省钱过度到不合理或显得吝啬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too thrifty; saving money so much that it becomes unreasonable, inconvenient, or even stingy.","zh":"过于节俭的；省钱省到不合理、带来不便，甚至显得吝啬的。"},"examples":[{"en":"He’s so overthrifty that he refuses to buy a winter coat, even when it’s freezing.","zh":"他节俭过头了，天寒地冻也不肯买件冬衣。"},{"en":"Being overthrifty can hurt your health if you avoid necessary checkups.","zh":"如果为了省钱而不做必要检查，节俭过头可能会伤害健康。"}]}],"synonyms":["too frugal","excessively thrifty","overly economical","penny-pinching","stingy","cheap"],"phonetic":"/ˌoʊvɚˈθrɪfti/","extraExplanation":["“Over-”是一个常见前缀，表示“过度、太……”。因此 overthrifty 带有明显的负面评价：不是单纯的“会过日子”，而是“省到过头”。","容易混淆的近义词：thrifty / frugal 通常是褒义（精打细算、不浪费）；stingy / cheap 更偏贬义（吝啬、小气）。overthrifty 往往介于两者之间：强调“过度节省”造成问题或让人不舒服。","这个词在日常口语中不算常见，更常见的说法是 “too frugal” 或 “so cheap”。"]}
{"word":"overthrong","summary":{"en":"Overthrong means to overcrowd a place with people.","zh":"overthrong 指使某处人群过度拥挤、挤满。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to crowd too many people into a place; to fill so much that movement becomes difficult","zh":"使（某处）人满为患；把人挤得过多（以致难以行动）"},"examples":[{"en":"On weekends, tourists can overthrong the narrow streets near the old harbor.","zh":"周末时，游客可能会把老港附近的狭窄街道挤得水泄不通。"},{"en":"The hall was overthronged, and people had to stand in the aisles.","zh":"大厅里人多得拥挤不堪，人们只好站在过道上。"}]}],"synonyms":["overcrowd","crowd","pack","cram","jam","overflow"],"phonetic":"/ˌoʊvərˈθrɔŋ/","extraExplanation":["“Overthrong”比较少见，常带有较强的文学/修辞色彩；日常英语更常用 crowd (into), pack, cram, jam, overflow with people。","构词上是 over-（过度）+ throng（人群；蜂拥）。在文学描写里，它常用来强调“过度拥挤”的压迫感。"]}
{"word":"overthrow","summary":{"en":"Overthrow means to remove a ruler/government from power (often by force) or to defeat someone completely; it can also be the noun for that act.","zh":"Overthrow 指（常用武力）推翻统治者/政府或彻底击败某人；也可作名词表示“推翻”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a government or leader from power, often by force","zh":"（常指通过武力）推翻政府或领导人，使其下台"},"examples":[{"en":"The military tried to overthrow the president.","zh":"军方试图推翻总统。"},{"en":"Protesters hoped to overthrow the dictatorship.","zh":"抗议者希望推翻独裁统治。"}]},{"partOfSpeech":"vt.","definition":{"en":"to defeat someone completely, especially in a contest or struggle","zh":"彻底击败（某人），尤指在竞赛或斗争中"},"examples":[{"en":"The champion was finally overthrown in the finals.","zh":"这位冠军终于在决赛中被击败。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of removing a government or leader from power; a sudden defeat","zh":"推翻（政权/统治者）的行为；（也可指）突然的败北"},"examples":[{"en":"The overthrow of the old regime changed the country overnight.","zh":"旧政权的被推翻让这个国家一夜之间发生了变化。"}]}],"synonyms":["topple","oust","depose","remove from power","unseat","overturn","bring down","defeat"],"phonetic":"/ˌoʊvərˈθroʊ/","extraExplanation":["“overthrow”既可作动词也可作名词。动词更常见于政治语境（如 overthrow a government）。在新闻或历史文本中，它通常带有“通过强硬手段夺取政权”的含义，因此语气较强。","词源上可理解为“throw over”（把……掀翻/翻倒），所以在比喻意义上延伸到“把统治者从权力位置上掀下来”。在文学或修辞中也可用来形容“旧观念、旧秩序被推翻”。"]}
{"word":"overthrowable","summary":{"en":"“Overthrowable” means capable of being overthrown—especially a government or leader (formal).","zh":"“overthrowable”意为“可被推翻的”，多指政府或领导人（较正式用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be overthrown, removed from power, or defeated (often used about governments, leaders, or rules).","zh":"可被推翻的；可被罢黜或打败的（常用于政府、领导人或制度）。"},"examples":[{"en":"Many people believed the dictator was overthrowable if the army stopped supporting him.","zh":"许多人认为，只要军队不再支持这位独裁者，他就是可以被推翻的。"},{"en":"An unjust system may seem permanent, but history shows it can be overthrowable.","zh":"不公正的制度看似牢固，但历史表明它也可能是可被推翻的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be overturned physically; capable of tipping over (less common).","zh":"（较少用）可被掀翻的；可翻倒的（指物体）。"},"examples":[{"en":"The lightweight chair is easily overthrowable in strong winds.","zh":"这种轻便椅子在大风中很容易被吹翻。"}]}],"synonyms":["vulnerable","toppleable","removable","defeatable","unstable"],"phonetic":"ˌoʊvərˈθroʊəbəl","extraExplanation":["“overthrowable”由动词“overthrow（推翻/掀翻）”+后缀“-able（能够…的/可被…的）”构成，常见于政治或评论性写作中，语气偏正式。更日常的说法常用“can be overthrown / easy to overthrow”。"]}
{"word":"overthrowal","summary":{"en":"“Overthrowal” is a rare noun meaning the act of overthrowing; most people say “overthrow.”","zh":"“overthrowal”是较罕见的名词，表示“推翻/颠覆的行为”；更常用“overthrow”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of overthrowing someone or something; a forceful removal from power or a complete defeat. (Rare; usually expressed as “overthrow.”)","zh":"推翻、颠覆的行为；以强力使某人/某事下台或彻底击败。（较罕见；通常用“overthrow”表达）"},"examples":[{"en":"The novel describes the overthrowal of a corrupt ruler after years of unrest.","zh":"这部小说描写了多年动乱后对腐败统治者的推翻。"},{"en":"In modern writing, “overthrow” is more common than “overthrowal.”","zh":"在现代写作中，“overthrow”比“overthrowal”更常见。"}]}],"synonyms":["overthrow","toppling","downfall","ouster","deposition"],"phonetic":"/ˌoʊvərˈθroʊəl/","extraExplanation":["“overthrowal”在当代英语中非常少见，常被视为非标准或过时的名词形式。写作与考试中更推荐使用“overthrow”（名词/动词）或“the overthrowing of …”来表达同样意思。","构词上可理解为“overthrow + -al”（表示“行为/过程”的名词后缀），但这一派生形式并未像“refusal/approval”等词那样固定下来，因此读者可能会觉得生硬。"]}
{"word":"overthrower","summary":{"en":"An “overthrower” is a person or group that overthrows a government, ruler, or existing power, or more generally someone/something that replaces an established leader or system.","zh":"“overthrower”指推翻政府或统治者的个人/团体，也可泛指颠覆并取代既有权力、领袖或体系的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that removes a government, ruler, or system from power (often by force or revolution).","zh":"推翻者；（常指用武力或革命）推翻政府、统治者或制度的人或团体。"},"examples":[{"en":"Some people saw the rebels as freedom fighters, while others called them overthrowers.","zh":"有些人把叛军视为自由斗士，而另一些人称他们为推翻者。"},{"en":"History books often debate whether an overthrower becomes a hero or a villain.","zh":"历史书常常争论：推翻者最终会成为英雄还是恶棍。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that defeats or replaces an existing leader, champion, rule, or tradition.","zh":"颠覆者；击败或取代既有领袖、冠军、规则或传统的人或事物。"},"examples":[{"en":"The young team became the unexpected overthrowers of last year’s champions.","zh":"这支年轻队伍成了去年冠军的意外“终结者”。"},{"en":"New technology can act as an overthrower of old habits.","zh":"新技术可能成为旧习惯的颠覆者。"}]}],"synonyms":["revolutionary","insurgent","rebel","usurper","subverter"],"phonetic":"/ˈoʊvərˌθroʊər/","extraExplanation":["“overthrower”由动词“overthrow（推翻、打倒）+ -er（做某事的人/物）”构成，语气往往比较强烈，常出现在政治或历史语境中；日常英语里更常用“revolutionary（革命者）”“coup plotter（政变策划者）”或直接说“those who overthrew the government（推翻政府的人）”。"]}
{"word":"overthrowers","summary":{"en":"“Overthrowers” means people who remove a government or ruler from power.","zh":"“overthrowers”指推翻政府或统治者的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who overthrow a ruler, government, or system; those who remove power by force or strong action.","zh":"推翻者；（用武力或强硬行动）推翻统治者、政府或制度的人。"},"examples":[{"en":"The overthrowers seized the capital and announced a new government.","zh":"推翻者占领了首都，并宣布成立新政府。"},{"en":"Some saw them as freedom fighters, while others called them overthrowers.","zh":"有人把他们视为自由斗士，也有人称他们为推翻者。"}]}],"synonyms":["rebels","insurgents","revolutionaries","coup plotters","usurpers"],"phonetic":"/ˌoʊvərˈθroʊərz/","extraExplanation":["“overthrowers”通常用于政治语境，带有强烈评价色彩：说话者可能在暗示“革命者/起义者/政变者”，也可能在批评其“颠覆者”。写作中可根据立场改用更中性或更具体的词，如“rebels（叛军）”“coup plotters（政变策划者）”“insurgents（叛乱分子）”。"]}
{"word":"overthrowing","summary":{"en":"“Overthrowing” means removing a government or leader from power, or physically knocking something over.","zh":"“overthrowing”指推翻政权/领导人，或把某物掀翻、撞倒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing a government, leader, or system from power (often suddenly or by force); the act of doing this","zh":"推翻（政府、领导人或制度）（常指突然或以武力）；推翻的行为"},"examples":[{"en":"The protesters were accused of overthrowing the government.","zh":"抗议者被指控企图推翻政府。"},{"en":"Many people feared the army was overthrowing civilian rule.","zh":"许多人担心军方正在推翻文官统治。"}]},{"partOfSpeech":"v.","definition":{"en":"turning something upside down or causing it to fall over; overturning","zh":"把某物翻倒、掀翻；使倾覆"},"examples":[{"en":"The strong wind ended up overthrowing several street signs.","zh":"强风最终把几块路牌刮倒了。"},{"en":"Be careful not to bump the table—you might be overthrowing the glass.","zh":"小心别撞到桌子——你可能会把杯子碰倒。"}]}],"synonyms":["toppling","deposing","ousting","bringing down","overturning"],"phonetic":"/ˌoʊvərˈθroʊɪŋ/","extraExplanation":["“overthrowing”是动词“overthrow”的现在分词/动名词形式，常见于进行时（was overthrowing）或作名词用（Overthrowing a regime is… 推翻政权这件事……）。","政治语境里“overthrow”语气很强，通常暗示通过武力、政变或革命等方式让政权下台；若只是“在选举中让某人下台”，更常用“defeat”或“vote out”。","常见搭配：overthrow a government/regime/king；the overthrow of the regime（该政权的垮台/被推翻）。词性上也可作名词“overthrow”（政权更迭、推翻），注意与“overturn”（翻转、推翻判决）区别：overthrow更偏政治/统治权力。"]}
{"word":"overthrown","summary":{"en":"“Overthrown” means removed from power (often a government or leader), and it is the past participle of “overthrow.”","zh":"“overthrown”表示“被推翻、被夺权”，是动词“overthrow”的过去分词，也可作形容词表示“被推翻的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past participle of “overthrow”) to remove a ruler, government, or system from power, usually by force or a sudden change.","zh":"（overthrow 的过去分词）推翻（统治者、政府或制度），通常带有武力或突发变革的含义。"},"examples":[{"en":"The dictator was overthrown after months of protests.","zh":"经过数月的抗议，这位独裁者被推翻了。"},{"en":"The old regime was overthrown in a military coup.","zh":"旧政权在军事政变中被推翻了。"},{"en":"The company’s CEO was overthrown by the board after the scandal.","zh":"丑闻之后，这家公司的首席执行官被董事会“推翻”（撤换）了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Removed from power; no longer ruling (used as an adjective).","zh":"被推翻的；失去权力的（作形容词）。"},"examples":[{"en":"The overthrown king lived in exile.","zh":"被推翻的国王流亡在外。"},{"en":"Supporters tried to restore the overthrown government.","zh":"支持者试图恢复被推翻的政府。"}]}],"synonyms":["deposed","toppled","ousted","removed from power","dethroned"],"phonetic":"/ˌoʊvərˈθroʊn/","extraExplanation":["“overthrown”常见于政治与历史语境，多用被动语态：be overthrown（被推翻）。在更广义的场景里，也可以指职位被“赶下台/撤换”（如CEO、领导层），语气比“fired”更强调权力斗争或戏剧性变化。","词形提示：overthrow（动词原形）→ overthrew（过去式）→ overthrown（过去分词）。过去分词常用于完成时（has/have been overthrown）或作形容词（the overthrown leader）。"]}
{"word":"overthrows","summary":{"en":"“Overthrows” can be the verb form meaning “removes from power,” or the plural noun meaning “acts of removing a leader/government.”","zh":"“overthrows”既可作动词（推翻、夺权）的第三人称单数，也可作名词复数，指多次推翻政权的事件。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “overthrow”) to remove a government, leader, or system from power, often by force; to defeat and replace.","zh":"（动词，overthrow 的第三人称单数）推翻（政府、领袖或制度），常指以武力；击败并取而代之。"},"examples":[{"en":"The rebel group overthrows the dictator in the final chapter of the novel.","zh":"在小说的最后一章，叛军推翻了独裁者。"},{"en":"When a military faction overthrows a civilian government, people often fear instability.","zh":"当军事派系推翻民选政府时，人们往往担心局势动荡。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun of “overthrow”) events in which a government or leader is removed from power.","zh":"（名词复数）政权更迭事件；推翻政府或领袖的行动。"},"examples":[{"en":"The textbook covers several overthrows in 20th-century Latin America.","zh":"这本教材讲到了20世纪拉丁美洲的多次政权推翻事件。"},{"en":"After the overthrows, the country struggled to build stable institutions.","zh":"多次政权更迭之后，这个国家艰难地建立稳定的制度。"}]}],"synonyms":["topples","deposes","ousts","removes","brings down","unseats","overturns"],"phonetic":"/ˌoʊvɚˈθroʊz/","extraExplanation":["“overthrow”常用于政治语境，语气比“remove/replace（撤换/替换）”更强，通常暗示暴力、政变或革命。若只是选举下台，一般用“vote out / lose the election”。","拼写提示：overthrow（原形）→ overthrew（过去式）→ overthrown（过去分词）；overthrows 是第三人称单数现在时，或名词复数。"]}
{"word":"overthrust","summary":{"en":"An overthrust is a geological thrust fault where older rocks are pushed over younger rocks; it can also mean the act of pushing something over and above.","zh":"overthrust 指地质中的逆冲推覆：老岩层被挤压推到年轻岩层之上；也可作动词表示“推挤越过/推覆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) A type of thrust fault in which older rock layers are pushed up and over younger layers, usually by strong tectonic pressure.","zh":"（地质）逆冲断层的一种：在强烈构造挤压下，较老的岩层被推挤到较新的岩层之上。"},"examples":[{"en":"Geologists mapped an overthrust that placed ancient limestone on top of much younger shale.","zh":"地质学家绘制出一条逆冲断层，使古老的石灰岩覆盖在更年轻的页岩之上。"},{"en":"The mountain range rose as large overthrusts formed during continental collision.","zh":"在大陆碰撞过程中形成了大型逆冲断层，这条山脉因此抬升。"}]},{"partOfSpeech":"v.","definition":{"en":"To push or drive something up and over something else; in geology, to force one rock mass over another along a thrust fault.","zh":"把某物向上推挤并越过另一物；（地质）沿逆冲断层将一块岩体推覆到另一块之上。"},"examples":[{"en":"Tectonic forces can overthrust older rocks onto younger strata.","zh":"构造力可以把老岩层逆冲推覆到年轻地层之上。"},{"en":"In the collision zone, one plate was overthrust onto the margin of the other.","zh":"在碰撞带中，一块板块被逆冲推覆到另一块的边缘之上。"}]}],"synonyms":["thrust fault","overthrust fault","push over","override (geology)"],"phonetic":"/ˌoʊvɚˈθrʌst/","extraExplanation":["“overthrust”常见于地质与板块构造语境，描述“挤压—缩短”作用下产生的推覆现象；它与普通的“fault（断层）”相比，更强调沿着低角度断层面发生的大规模“上冲/推覆”。","相关术语：thrust fault（逆冲断层）、nappe（推覆体/岩席）、fold-and-thrust belt（褶皱—逆冲带）。"]}
{"word":"overthwart","summary":{"en":"Overthwart is an archaic word meaning “across; crosswise,” often used in nautical descriptions (e.g., across a ship’s deck).","zh":"Overthwart 是一个古语，意思是“横跨、横向”，常见于航海或较老的描写（如“横跨甲板”）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) across; from side to side; crosswise.","zh":"（古语）横跨；从一侧到另一侧；横向地。"},"examples":[{"en":"A beam lay overthwart the doorway, blocking the entrance.","zh":"一根横梁横在门口，挡住了入口。"},{"en":"He sat with his legs overthwart the bench.","zh":"他坐着，把腿横放在长凳上。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Archaic, nautical) across the width of a ship (from one side to the other), rather than lengthwise.","zh":"（古语，航海）横穿船体宽度方向的（从一舷到另一舷），而不是沿船长方向的。"},"examples":[{"en":"The rope was stretched overthwart the deck.","zh":"绳子横跨在甲板上。"},{"en":"Cargo was stacked overthwart, making it hard to pass.","zh":"货物横向堆放，导致通行困难。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) crossing; placed crosswise.","zh":"（古语）横跨的；交叉放置的。"},"examples":[{"en":"An overthwart plank served as a simple bridge.","zh":"一块横放的木板当作简易小桥。"}]}],"synonyms":["across","crosswise","transverse","athwart"],"phonetic":"/ˌoʊvərˈθwɔrt/","extraExplanation":["“Overthwart”现在很少在日常英语中使用，更常见于较老的文学作品或航海语境。现代英语里通常用“across / crosswise / transverse”来表达相同意思。","词源上与“thwart（横向的）”有关；在船上说“overthwart the deck”指东西横着放，阻碍通行（与沿船头到船尾的方向相对）。"]}
{"word":"overthwartarchaic","summary":{"en":"Overthwart (archaic) means “across/crosswise,” and by extension “contrary or obstructive.”","zh":"Overthwart（古语）指“横跨/横向”，并可引申为“唱反调、对立或阻挠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Lying or going across something; crosswise; from side to side.","zh":"（古语）横跨的；横向的；从一边到另一边的。"},"examples":[{"en":"A fallen branch lay overthwart the narrow path.","zh":"一根倒下的树枝横在狭窄的小路上。"},{"en":"He held the oar overthwart the boat to steady it.","zh":"他把桨横放在船上让它更稳。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) In a way that goes across; crosswise.","zh":"（古语）横向地；横着地。"},"examples":[{"en":"The rope was stretched overthwart the doorway.","zh":"绳子横拉在门口。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Contrary; opposed; acting in a perverse or obstructive way.","zh":"（古语）相反的；对立的；（行为）别扭或故意阻挠的。"},"examples":[{"en":"His overthwart answer turned a simple talk into an argument.","zh":"他那句刻意唱反调的回答，把简单的谈话变成了争论。"},{"en":"She was not rude—only overthwart when challenged.","zh":"她并不粗鲁——只是被质疑时就爱顶撞。"}]}],"synonyms":["across","crosswise","transverse","contrary","opposed","obstructive"],"phonetic":"/ˌoʊvərˈθwɔrt/","extraExplanation":["“Overthwart”在现代英语中很少见，主要出现在旧文学或仿古写作里。更常见的现代替代说法有 crosswise（横着的）、across（横跨）、contrary / obstructive（唱反调的/阻挠的）。","词源上可理解为 over（在……之上/越过）+ thwart（横向的、阻碍的；也与“thwart”作动词“阻挠”有关），因此既能表示“横跨”，也引申出“对立、作对”的含义。"]}
{"word":"overthwartly","summary":{"en":"“Overthwartly” is an archaic adverb meaning ‘in a stubborn/contrary way’ or ‘in a crosswise, hindering way.’","zh":"“Overthwartly”是个古语副词，表示“固执反拗地/故意作对地”，也可指“横着阻碍地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic/rare) In a stubborn, contrary, or perverse way; in a way that goes against what is reasonable or expected.","zh":"（古语/罕用）固执地、反着来地；故意违拗、不讲理地。"},"examples":[{"en":"He answered overthwartly, refusing every sensible suggestion.","zh":"他回答得很执拗，把每个合理的建议都拒绝了。"},{"en":"The child behaved overthwartly and would not follow the rules.","zh":"那孩子很拗，怎么也不肯按规则来。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic/rare) In a crosswise or obstructing manner; so as to hinder progress.","zh":"（古语/罕用）横着地、阻碍地；以妨碍前进的方式。"},"examples":[{"en":"Branches lay overthwartly across the narrow path.","zh":"树枝横七竖八地挡在狭窄的小路上。"},{"en":"His words fell overthwartly, interrupting the flow of the discussion.","zh":"他的话插得很不合时宜，把讨论的节奏打断了。"}]}],"synonyms":["stubbornly","contrarily","perversely","obstructively","crosswise"],"phonetic":"ˌoʊvərˈθwɔrtli","extraExplanation":["“overthwartly”是由前缀“over-”（强调、加强）+ “thwart”（反对、阻挠；横向的）构成的副词形式，整体带有“过分地反着来/故意作对”的语气。","该词在现代英语里几乎不用，更多见于较早期或仿古风格的写作。日常表达更常用：stubbornly（固执地）, contrarily（反着来地）, perversely（执拗/乖张地）, obstructively（阻碍地）。"]}
{"word":"overthwartness","summary":{"en":"Overthwartness means a rare/old-fashioned kind of stubborn contrariness or perverse opposition.","zh":"overthwartness 指一种（罕见/古语的）执拗唱反调、乖戾好对抗的性格或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) The quality of being overthwart; stubbornly contrary, perverse, or inclined to oppose others.","zh":"（罕见/古语）“overthwart”的性质；指固执地唱反调、乖戾/执拗、总爱与人作对的倾向。"},"examples":[{"en":"His overthwartness made every small discussion turn into an argument.","zh":"他的执拗唱反调让每次小讨论都变成争吵。"},{"en":"She apologized for her overthwartness and agreed to listen first.","zh":"她为自己的乖戾道歉，并同意先听别人说。"}]}],"synonyms":["contrariness","stubbornness","perverseness","obstinacy"],"phonetic":"/ˌoʊvərˈθwɔrtnəs/","extraExplanation":["这是一个非常少见、带古英语/中古英语色彩的名词，来自形容词 overthwart（意为“横着的；反对的；乖戾的”）+ -ness（构成名词，表示“……的状态/性质”）。现代英语中更常用的表达是 contrariness, stubbornness, perverseness 或 being contrary。","词根上与 thwart（阻挠、挫败）有关；早期 overthwart 也可表示“横过、交叉”的空间含义，后来引申为“处处与人作对/拦阻”的性格含义。"]}
{"word":"overthwartways","summary":{"en":"An archaic adverb meaning “crosswise/diagonally; across.”","zh":"一个古语副词，意思是“横向地/斜向地；横跨着”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a crosswise or diagonal way; across, from side to side; obliquely (archaic/literary).","zh":"以横穿或斜穿的方式；横向地、斜向地（古语/文学用语）。"},"examples":[{"en":"A fallen branch lay overthwartways across the narrow path.","zh":"一根倒下的树枝横斜着挡在狭窄的小路上。"},{"en":"In old tales, the wind drives rain overthwartways against the window.","zh":"在古老故事里，风把雨横斜着刮到窗上。"}]}],"synonyms":["crosswise","diagonally","across","athwart","obliquely"],"phonetic":"ˌoʊvərˈθwɔrtˌweɪz","extraExplanation":["这是一个古体/文学色彩很强的副词，来自 overthwart（= athwart，意为“横跨、斜穿”）+ ways（表示“以……方式”）。现代英语里更常用 crosswise、across、diagonally 或 athwart。","你更可能在早期文学（如中古或近代早期英语风格的作品）中见到它；日常写作与口语里几乎不用。"]}
{"word":"overthwartwise","summary":{"en":"Overthwartwise means “crosswise/diagonally,” and in older usage it can also mean “in a contrary, opposing way.”","zh":"overthwartwise 表示“横着/斜着”，古义还可指“唱反调、以相反方式行事”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a crosswise or sideways way; diagonally or at an angle across something.","zh":"以横向、侧向的方式；斜着、交叉着穿过某物。"},"examples":[{"en":"He tied the sash overthwartwise across his chest.","zh":"他把肩带斜斜地系在胸前。"},{"en":"Lay the ribbon overthwartwise so it won’t slip.","zh":"把丝带斜着放，这样就不容易滑动。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) In an opposing or contrary way; perversely, against what is expected.","zh":"（古义）以对立、相反的方式；故意拧着来，不按常理。"},"examples":[{"en":"She answered overthwartwise, contradicting every suggestion.","zh":"她故意唱反调，把每个建议都反驳了一遍。"},{"en":"The plan went overthwartwise, as if fate resisted it.","zh":"计划处处不顺，仿佛命运在阻挠。"}]}],"synonyms":["crosswise","sideways","diagonally","athwart","contrariwise","perversely"],"phonetic":"ˌoʊvərˈθwɔrtˌwaɪz","extraExplanation":["“overthwartwise”是较罕见、偏古风的词，来自“overthwart”（意为“横穿；作对；反对”）+ “-wise”（表示“以……方式”）。现代英语里更常用的替代说法有：crosswise, sideways, diagonally（表示“斜着/横着”），以及 contrariwise / perversely（表示“反着来/唱反调”）。","这个词常见于较早期的英语或仿古、文学化的表达中；在日常写作里使用会显得很“古典”。"]}
{"word":"overtide","summary":{"en":"“Overtide” means to survive or carry someone/something through a difficult period until things improve.","zh":"“overtide”指熬过困难时期，或帮助某人/某事渡过难关直到好转。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to last through a difficult period; to survive until conditions improve (often used with “over” as in “overtide over”).","zh":"（度过难关）熬过、撑过；坚持到情况好转（常与 over 连用，如 overtide over）。"},"examples":[{"en":"The small shop managed to overtide the winter when business was slow.","zh":"那家小店在生意清淡的冬季设法熬了过去。"},{"en":"With help from friends, she could overtide over the hardest months.","zh":"在朋友的帮助下，她能撑过最艰难的几个月。"}]},{"partOfSpeech":"vt.","definition":{"en":"to carry (someone or something) safely over a period of danger or difficulty; to help get through.","zh":"（帮助某人/某事）渡过（危险或困难时期）；使度过。"},"examples":[{"en":"A short loan overtided the company until new orders arrived.","zh":"一笔短期贷款帮助公司撑到新订单到来。"},{"en":"Strong savings can overtid e a family through unexpected expenses.","zh":"充足的储蓄能帮助家庭度过意外开支带来的压力。"}]}],"synonyms":["tide over","get through","weather (the storm)","pull through","outlast"],"phonetic":"/ˌoʊvərˈtaɪd/","extraExplanation":["“overtide”较为少见，带有文学/古体色彩；它把“tide（潮汐）”引申为“时势、阶段”，表达“像等潮水退去一样熬过一段艰难时期”。现代英语里更常用：get through / tide over / weather (a storm) 等。"]}
{"word":"overtight","summary":{"en":"“Overtight” means too tight or too tightly, often used for screws, lids, belts, or clothing.","zh":"“Overtight”表示“过紧的/过紧地”，常用于螺丝、瓶盖、皮带或衣物等情境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too tight; tightened more than is safe, comfortable, or correct.","zh":"过紧的；拧得（拉得）太紧的（超过安全、舒适或正确的程度）。"},"examples":[{"en":"The lid is overtight, so it’s hard to open.","zh":"盖子拧得太紧了，所以很难打开。"},{"en":"Don’t overtight the screws, or you may crack the plastic.","zh":"螺丝别拧太紧，否则可能把塑料拧裂。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an overly tight way; too tightly.","zh":"过紧地；太紧地。"},"examples":[{"en":"If the belt is worn overtight, it can be uncomfortable.","zh":"皮带如果系得太紧，会不舒服。"}]}],"synonyms":["too tight","overly tight","tightened too much"],"phonetic":"/ˌoʊvərˈtaɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”。因此 overtight 的核心意思就是“紧得过头”。在说明书或维修语境里很常见，例如“Do not overtight.”","拼写上常见变体有 over-tight（较少见，偏强调），更常用的是 overtight / overtighten（动词：拧得过紧）。"]}
{"word":"overtighten","summary":{"en":"Overtighten means to tighten something too much, often causing problems like damage or difficulty opening/moving it.","zh":"Overtighten 指“拧得过紧”，往往会造成损坏或导致之后难以打开/拆卸。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tighten something too much, so it becomes hard to move, damaged, or unsafe","zh":"把某物拧得过紧；拧得太紧（导致难以转动、损坏或不安全）"},"examples":[{"en":"Don’t overtighten the lid, or you won’t be able to open it later.","zh":"别把盖子拧得太紧，不然以后你可能打不开。"},{"en":"He overtightened the screw and stripped the threads.","zh":"他把螺丝拧得太紧，把螺纹拧滑了。"},{"en":"If you overtighten the bolt, the part can crack.","zh":"如果把螺栓拧得过紧，零件可能会裂开。"}]}],"synonyms":["tighten too much","over-torque","overfasten"],"phonetic":"/ˌoʊvərˈtaɪtən/","extraExplanation":["overtighten 常见于维修、DIY、汽车/自行车保养等场景。过度用力可能导致“滑牙/滑丝（stripped threads）”、零件开裂，或之后难以拆卸。","使用说明书里常见相关提示：tighten firmly（拧紧即可） vs. do not overtighten（不要拧过紧）；更专业的做法是按扭矩（torque）要求拧紧。"]}
{"word":"overtightened","summary":{"en":"“Overtightened” means tightened too much; it can also be the past form of “overtighten.”","zh":"“Overtightened”表示“拧得/系得过紧”；也可作动词“overtighten”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tightened too much (so it becomes hard to move, uncomfortable, or possibly damaged).","zh":"拧得/系得过紧（导致难以移动、不舒服，甚至可能损坏）。"},"examples":[{"en":"The bolt was overtightened and the threads stripped.","zh":"螺栓拧得过紧，把螺纹都拧坏了。"},{"en":"My watch band felt overtightened and left a mark on my wrist.","zh":"我的表带系得太紧，在手腕上留下了印子。"},{"en":"If the lid is overtightened, you may not be able to open the jar later.","zh":"如果盖子拧得太紧，你之后可能打不开罐子。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overtighten”: to tighten something too much.","zh":"“overtighten”的过去式/过去分词：把某物拧得/系得过紧。"},"examples":[{"en":"I overtightened the screw and cracked the plastic.","zh":"我把螺丝拧得太紧，把塑料拧裂了。"},{"en":"The mechanic said the drain plug had been overtightened.","zh":"修理工说放油螺塞被拧得过紧了。"}]}],"synonyms":["too tight","over-tightened","excessively tightened","oversecured"],"phonetic":"/ˌoʊvərˈtaɪtənd/","extraExplanation":["在工程或维修语境里，overtightened 常和损坏风险一起出现，比如 strip the threads（拧滑/损坏螺纹）、crack（拧裂）、warp（拧变形）。相对的安全做法常说 tighten until snug（拧到刚好贴合）或 tighten to the recommended torque（按建议扭矩拧紧）。"]}
{"word":"overtightening","summary":{"en":"“Overtightening” means tightening something too much, often causing damage or problems.","zh":"“overtightening”指把东西拧得过紧，常会引发损坏或使用问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tightening something too much, often causing damage, stripping threads, cracking parts, or making it hard to remove later.","zh":"把东西拧得过紧（过度拧紧），常会导致损坏、滑牙/崩牙、零件开裂或之后难以拆卸。"},"examples":[{"en":"Overtightening the screw can strip the threads.","zh":"螺丝拧得过紧会导致螺纹滑牙。"},{"en":"The leak got worse because of overtightening the pipe fitting.","zh":"因为把管件接头拧得过紧，漏水反而更严重了。"},{"en":"Avoid overtightening—tighten until snug, then stop.","zh":"避免过度拧紧——拧到贴合、稳固就停。"}]},{"partOfSpeech":"v.","definition":{"en":"The action of tightening too much (the -ing form of “over-tighten”), used to describe what someone is doing.","zh":"“over-tighten（拧得过紧）”的 -ing 形式，用来描述正在进行的动作：正在过度拧紧。"},"examples":[{"en":"You’re overtightening it; use less force.","zh":"你拧得太紧了；用力小一点。"},{"en":"He kept overtightening the bolts instead of using a torque wrench.","zh":"他一直把螺栓拧得过紧，而不是用扭力扳手。"}]}],"synonyms":["over-tightening","tightening too much","over-torquing"],"phonetic":"/ˌoʊvərˈtaɪtənɪŋ/","extraExplanation":["在机械、管路与自行车/汽车维修里，“overtightening”很常见：过度用力会造成“滑牙（stripped threads）”、垫圈变形、塑料件开裂，甚至让密封更差。很多场景会写“tighten to spec（按规定扭矩拧紧）”，用扭力扳手（torque wrench）按扭矩值操作能避免过度拧紧。"]}
{"word":"overtightens","summary":{"en":"“Overtightens” means tightens something too much, often causing problems or damage.","zh":"“overtightens”表示“拧得过紧/锁得过紧”，常会带来麻烦或造成损坏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tighten something too much, often causing damage or making it hard to remove later","zh":"把某物拧得过紧（常导致损坏或之后难以拆卸）"},"examples":[{"en":"He overtightens the lid, so no one else can open the jar.","zh":"他把盖子拧得太紧，结果别人都打不开这个罐子。"},{"en":"If she overtightens the screw, the plastic may crack.","zh":"如果她把螺丝拧得过紧，塑料可能会裂开。"},{"en":"The mechanic warns that the bolt overtightens easily if you use too much force.","zh":"修理工提醒说，如果用力过猛，这个螺栓很容易被拧得过紧。"}]}],"synonyms":["tightens too much","over-torques","overfastens"],"phonetic":"/ˌoʊvərˈtaɪtənz/","extraExplanation":["“over-”是常见前缀，表示“过度、超过合适的程度”。类似的词有：overcook（煮过头）、overwork（过度工作）、overreact（反应过度）。","“overtightens”是动词第三人称单数形式（he/she/it overtightens）。原形是 overtighten，过去式/过去分词常写作 overtightened。"]}
{"word":"overtightly","summary":{"en":"“Overtightly” means “too tightly.”","zh":"“overtightly”表示“过紧地、太紧地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too tightly; in a way that is tighter than is comfortable, safe, or correct.","zh":"过紧地；紧得超过舒适、安全或正确的程度。"},"examples":[{"en":"The jar lid was screwed on overtightly, so it was hard to open.","zh":"罐子的盖子拧得过紧，所以很难打开。"},{"en":"If you tie the knot overtightly, it can damage the fabric.","zh":"如果把结系得过紧，可能会损坏布料。"},{"en":"Don’t fasten the tourniquet overtightly—follow the instructions.","zh":"止血带不要绑得过紧——要按说明操作。"}]}],"synonyms":["too tightly","excessively tightly","overly tightly"],"phonetic":"/ˌoʊvɚˈtaɪtli/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”。因此 overtightly = over + tightly（过度地紧）。","它多用于描述螺丝、盖子、带子、绳结等被拧/系/绑得太紧的情况；语气通常带有“这样不太好”的评价。"]}
{"word":"overtightness","summary":{"en":"Overtightness means being too tight, either physically or (figuratively) too strict/rigid.","zh":"overtightness 指“过紧”，既可指物理上太紧，也可比喻规则或控制过于严格、僵化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of being too tight (physically), so that something is uncomfortable, hard to move, or may cause damage.","zh":"（物理上）过紧的状态；紧得不舒服、影响活动，甚至可能造成损坏。"},"examples":[{"en":"The overtightness of the jar lid made it impossible to open by hand.","zh":"罐子盖拧得太紧，徒手根本打不开。"},{"en":"Check for overtightness in the belt; it shouldn’t leave deep marks on your skin.","zh":"检查腰带是不是系得太紧；不应该在皮肤上留下很深的勒痕。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Excessive strictness or rigidity in rules, behavior, or control.","zh":"（比喻）过度严格；过分僵化的规章、行为或控制方式。"},"examples":[{"en":"The overtightness of the school’s rules left little room for creativity.","zh":"学校规定过于严苛，几乎不给创造力留下空间。"},{"en":"A little flexibility can reduce the overtightness in the management style.","zh":"稍微灵活一点能缓解管理方式的僵化与过度控制。"}]}],"synonyms":["tightness (too much)","excessive tightness","over-tightening","rigidity","overstrictness"],"phonetic":"/ˌoʊvərˈtaɪtnəs/","extraExplanation":["这个词由 over-（“过度”）+ tight（“紧的”）+ -ness（名词后缀，表示“……的状态/性质”）组成，因此字面意思就是“过紧的状态”。","在日常英语里更常见的说法是 “too tight” 或 “over-tightening”（尤其在工具/机械语境中）；“overtightness”偏书面、技术或描述性用法。"]}
{"word":"overtill","summary":{"en":"Overtill means to till soil too much, which can harm the soil.","zh":"overtill 指“过度翻耕土壤”，可能对土壤造成伤害。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to till (soil) too much or too often, so that the soil structure is damaged or becomes less healthy for plants","zh":"过度翻耕（土壤）；翻耕过多/过频，导致土壤结构受损或不利于作物生长"},"examples":[{"en":"If you overtill the garden bed, the soil can become powdery and dry out quickly.","zh":"如果你过度翻耕花园的苗床，土壤可能会变得很粉、很容易变干。"},{"en":"Farmers try not to overtill because it can increase erosion and reduce soil life.","zh":"农民会尽量避免过度翻耕，因为这会加剧水土流失、减少土壤生物。"}]}],"synonyms":["overcultivate","overwork (the soil)","till too much"],"phonetic":"/ˌoʊvərˈtɪl/","extraExplanation":["“overtill”在现代英语中很少见，更常写作“over-till”或直接说“till too much”。在园艺/农业语境里，它常和“soil health（土壤健康）”“erosion（侵蚀）”等概念一起出现。"]}
{"word":"overtilt","summary":{"en":"Overtilt means to tilt too far (verb) or an excessive tilt (noun), often used in technical or safety contexts.","zh":"Overtilt 指（使）倾斜过度（动词）或“过度倾斜”的状态/程度（名词），常见于技术或安全语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tilt too far or too much, often so that something becomes unstable or goes past the intended angle","zh":"（使）倾斜过度；倾得太厉害（常导致不稳或超过预期角度）"},"examples":[{"en":"If you overtilt the ladder, it can slip and fall.","zh":"如果你把梯子倾得太厉害，它可能会打滑倒下。"},{"en":"Don’t overtilt the phone when you’re scanning the code.","zh":"扫二维码时别把手机倾得太斜。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessive tilt; the state or amount of being tilted too far","zh":"过度倾斜；倾斜过量（指过头的倾斜程度或状态）"},"examples":[{"en":"The machine shuts off automatically when it detects an overtilt.","zh":"机器检测到过度倾斜时会自动关机。"},{"en":"The warning light indicates overtilt on steep ground.","zh":"警示灯表示在陡坡上出现了过度倾斜。"}]}],"synonyms":["tilt too much","tip too far","overbalance","overlean"],"phonetic":"/ˌoʊvərˈtɪlt/","extraExplanation":["“overtilt”不是日常最常见的词，更常见于工程、机械、设备说明书或安全提示中（例如传感器检测到倾角过大）。在口语里人们更常说 “tilt too much / tip too far”。","构词法：over-（过度）+ tilt（倾斜）。因此它通常带有“超过安全/合适范围”的含义。"]}
{"word":"overtimbered","summary":{"en":"Overtimbered means either (1) having too many trees/too much timber, or (2) looking overly heavy with timber in construction.","zh":"Overtimbered 可指（1）林木过密/木材过多，或（2）建筑木构用得过多、显得厚重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having too many trees, or containing more timber than is desirable (especially in forestry or land management)","zh":"（尤指林业或土地管理）树木过密的；木材（蓄积量）过多、不理想的"},"examples":[{"en":"The hillside was overtimbered, so the forest service planned selective thinning.","zh":"那片山坡林木过密，所以林务部门计划进行选择性间伐。"},{"en":"Overtimbered stands can be more vulnerable to wildfire and disease.","zh":"林木过密的林分可能更容易遭遇山火和病虫害。"}]},{"partOfSpeech":"adj.","definition":{"en":"built or framed with an unusually large amount of timber; heavy-timbered in appearance","zh":"用木材过多建造的；木构显得过于厚重的"},"examples":[{"en":"The cottage looked overtimbered, with thick beams dominating the small rooms.","zh":"那间小屋看起来木构过于厚重，粗梁几乎占满了狭小的房间。"},{"en":"Some critics called the set overtimbered, distracting from the actors.","zh":"有些评论家说布景木结构用得太多，反而分散了观众对演员的注意力。"}]}],"synonyms":["overwooded","overstocked (forestry)","wood-heavy","heavily timbered"],"phonetic":"/ˌoʊvərˈtɪmbərd/","extraExplanation":["“overtimbered”多见于较专业或描写性语境，常可理解为“over-（过度）+ timber（木材/林木）+ -ed（…的）”。在林业里，它常暗示树太密、竞争强，需要“thinning（间伐）”。在建筑/舞台美术描写里，则偏向“木梁木构用得过多、视觉上显得厚重”。","拼写上有时也会写作“over-timbered”（加连字符），意思不变。"]}
{"word":"overtime","summary":{"en":"Overtime usually means extra work time beyond normal hours (often with extra pay), and it can also mean an extra period in sports when a game is tied.","zh":"Overtime通常指超出正常工作时间的加班（常有加班费），也可指体育比赛平局后的加时赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Time worked beyond your regular working hours (often paid at a higher rate).","zh":"加班时间；超出正常工作时间的工作（常以更高工资支付）。"},"examples":[{"en":"I worked overtime to finish the report.","zh":"我为了完成报告而加班。"},{"en":"Overtime pay is time-and-a-half at this company.","zh":"在这家公司，加班费是平时工资的1.5倍。"}]},{"partOfSpeech":"adj.","definition":{"en":"Beyond regular working hours; involving extra work time.","zh":"加班的；超出正常工作时间的。"},"examples":[{"en":"She put in overtime hours all week.","zh":"她整周都在加班。"},{"en":"We had to do overtime work before the deadline.","zh":"截止日期前我们不得不做加班工作。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports, an extra period played when the score is tied at the end of regular time.","zh":"（体育）加时赛；常规时间结束仍平局时的额外比赛时间。"},"examples":[{"en":"The game went into overtime.","zh":"比赛进入了加时赛。"},{"en":"They won in overtime with a last-second goal.","zh":"他们在加时赛最后一秒进球获胜。"}]}],"synonyms":["extra hours","extra time","after-hours work","OT"],"phonetic":"/ˈoʊvərˌtaɪm/","extraExplanation":["“Overtime”在职场语境里常与动词搭配：work overtime（加班）、do overtime（加班）、put in overtime（投入加班时间）。其中“overtime pay”指加班费。","在体育语境里，美式英语常说“go into overtime / win in overtime”；不同运动的加时规则不同，但词义一致：为决出胜负而增加的时间段。"]}
{"word":"overtimed","summary":{"en":"“Overtimed” is an uncommon word. It can mean “worked overtime” or “timed too long,” but everyday English usually uses “worked overtime” or “ran over time.”","zh":"“Overtimed”较少见，可表示“加班了的”或“超时/计时过长的”，但日常更常说“worked overtime”或“ran over time”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) having worked beyond regular working hours; having been given overtime work or pay.","zh":"（不常见）加班了的；被安排加班或获得加班工资的。"},"examples":[{"en":"I was overtired because I’d been overtimed all week.","zh":"我太累了，因为我整周都在加班（不常见说法）。"},{"en":"The staff felt overtensed after being overtimed for several nights.","zh":"员工连续几晚被安排加班后感到很紧绷。（不常见说法）"}]},{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) timed for too long; lasting longer than intended (used in technical or edited writing).","zh":"（不常见）计时过长的；持续时间超过原先设定的（多见于技术或编辑语境）。"},"examples":[{"en":"The presentation was overtimed and had to be cut.","zh":"这场演讲时间超时了，只好删减。"},{"en":"Several drills were overtimed, so the class ended late.","zh":"有几项训练计时过长，所以课程结束得很晚。"}]}],"synonyms":["worked overtime","overworked","ran over time","overran"],"phonetic":"/ˌoʊvɚˈtaɪmd/","extraExplanation":["“overtimed”不是日常英语里的常用词。表达“加班”更自然的说法通常是：worked overtime / did overtime / had to work overtime。","表达“比赛进入加时”更常见的是：the game went into overtime / an overtime game，而不是 *overtimed*。","如果你想说“时间超出计划/超时”，更常用：over time (两个词，表示“随着时间推移”)、overran、ran over、went over time。注意 *over time* 和 *overtime*（加班）意义不同。"]}
{"word":"overtimer","summary":{"en":"An informal noun for a person (or sometimes a team/player) connected with overtime—especially someone who often works extra hours.","zh":"一个非正式名词，指与“加时/加班”有关的人；最常用来指经常加班的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works extra hours beyond the normal work schedule (informal; based on “overtime”).","zh":"加班的人（非正式；来自“overtime”加班）。"},"examples":[{"en":"Our team is full of overtimers during the holiday rush.","zh":"假日旺季时，我们团队里全是加班的人。"},{"en":"She’s a regular overtimer, especially at the end of each month.","zh":"她经常加班，尤其是每个月月底。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports, a player or team that wins or scores in overtime (less common).","zh":"（体育）在加时赛获胜或得分的球员/球队（较少见）。"},"examples":[{"en":"The overtimers celebrated after the buzzer.","zh":"加时赛取胜的一方在终场哨后庆祝。"},{"en":"He became the game’s hero as the overtime scorer—an overtimer.","zh":"他在加时赛进球成了英雄——加时赛得分者。"}]}],"synonyms":["overtime worker","someone who works overtime","extra-hours worker"],"phonetic":"/ˈoʊvərˌtaɪmər/","extraExplanation":["“overtimer”不是最标准、最常见的词。日常英语里更常说：a person who works overtime（加班的人）、someone who does overtime（做加班的人）、an overtime worker（加班工）。在职场写作或正式场合，建议用这些更自然、更清晰的表达。"]}
{"word":"overtimes","summary":{"en":"“Overtimes” is usually the plural of “overtime,” meaning extra working hours or overtime pay; the “many times” meaning is rare and old-fashioned.","zh":"“overtimes”通常是“overtime”的复数，指加班时间或加班费；表示“多次”的用法较少见且偏旧式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Extra hours worked beyond regular working time; the pay for those extra hours (plural of “overtime”).","zh":"（工作）加班时间；加班费（“overtime”的复数）。"},"examples":[{"en":"I worked two hours of overtimes this week to finish the project.","zh":"这周我为了完成项目加了两小时班。"},{"en":"The company will pay overtimes at 1.5 times your normal rate.","zh":"公司会按正常工资的1.5倍支付加班费。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/old-fashioned) Many times; repeatedly.","zh":"（较少见/旧式）多次；反复地。"},"examples":[{"en":"He has been warned overtimes, but he still ignores the rules.","zh":"他已被警告多次，但仍然无视规则。"}]}],"synonyms":["overtime hours","extra hours","overtime pay","many times (for the rare sense)","repeatedly (for the rare sense)"],"phonetic":"/ˈoʊvərˌtaɪm/","extraExplanation":["现代英语里更常说“overtime”（不可数）来表示加班：work overtime（加班）/ pay overtime（付加班费）。要表达“很多次”，一般用 many times / repeatedly，而不是 overtimes。"]}
{"word":"overtimid","summary":{"en":"“Overtimid” means excessively timid or too shy to act confidently.","zh":"“overtimid”表示“过于胆怯/太害羞”，指缺乏自信而不敢行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively shy, fearful, or lacking confidence; too timid.","zh":"过于胆怯的；太害羞或缺乏自信的。"},"examples":[{"en":"He was overtimid in meetings and rarely shared his ideas.","zh":"他在会议上过于胆怯，很少分享自己的想法。"},{"en":"Don’t be overtimid—ask the teacher if you need help.","zh":"别太胆怯——需要帮助就去问老师。"},{"en":"An overtimid response can make you miss good opportunities.","zh":"过于胆怯的反应可能会让你错过好机会。"}]}],"synonyms":["overly timid","too timid","excessively timid","bashful","diffident"],"phonetic":"/ˌoʊvɚˈtɪmɪd/","extraExplanation":["“over-”是一个常见前缀，表示“过度、太……”。因此 overtimid = timid（胆怯的）+ over-（过度）→ “太胆怯”。","这个词在日常口语中不算特别常用，更常见的表达有：too timid, overly timid, excessively timid。"]}
{"word":"overtimidity","summary":{"en":"Overtimidity means excessive timidity—being too shy or fearful.","zh":"overtimidity 指“过度胆怯”，即太害羞或太害怕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive timidity; being too shy, fearful, or cautious (often to a harmful or limiting degree)","zh":"过度胆怯；过分害羞、害怕或谨慎（常常到了会限制自己、带来负面影响的程度）"},"examples":[{"en":"Her overtimidity kept her from asking questions in class, even when she was confused.","zh":"她的过度胆怯让她即使困惑也不敢在课堂上提问。"},{"en":"Overtimidity at work can make you miss chances to share good ideas.","zh":"在工作中过度胆怯会让你错过表达好点子的机会。"}]}],"synonyms":["excessive shyness","overcaution","diffidence","timorousness"],"phonetic":"/ˌoʊvərtəˈmɪdədi/","extraExplanation":["“overtimidity”并不是非常常见的标准词条，更常见的写法是带连字符的“over-timidity”，意思就是“timidity（胆怯）”前加上“over-（过度）”。在正式写作里，你也可以用更常见的表达，如“excessive timidity”或“being overly timid”。"]}
{"word":"overtimidly","summary":{"en":"“Overtimidly” means behaving or speaking in an excessively timid or shy way.","zh":"“overtimidly”表示以过分胆怯、害羞、缺乏自信的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too timid, too shy, or lacking enough confidence; excessively timidly.","zh":"过于胆怯地；过分害羞地；缺乏自信地（程度太高）。"},"examples":[{"en":"He spoke overtimidly during the interview and didn’t highlight his strengths.","zh":"他在面试中过于胆怯地说话，没有把自己的优势讲出来。"},{"en":"She apologized overtimidly, even though she hadn’t done anything wrong.","zh":"她过分怯生生地道歉，尽管她并没有做错什么。"},{"en":"If you act overtimidly, people may assume you don’t believe in your own ideas.","zh":"如果你表现得过于胆怯，别人可能会以为你自己都不相信自己的想法。"}]}],"synonyms":["overly timidly","too timidly","very timidly","shyly","bashfully","diffidently"],"phonetic":"/ˌoʊvɚˈtɪmɪdli/","extraExplanation":["“over-”作前缀常表示“过度、太……”，所以“overtimidly”强调“胆怯得过头”。在真实语境中，它不算特别常见；写作里更常用“too timidly / very timidly / overly timidly”。"]}
{"word":"overtimidness","summary":{"en":"Overtimidness means excessive timidity—being too shy or hesitant.","zh":"overtimidness 指“过度胆怯”，即过分害羞或犹豫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive timidity; being too shy, fearful, or hesitant, often in a way that causes you to miss chances or avoid speaking up.","zh":"过度胆怯；过分害羞、害怕或犹豫，常常导致不敢表达或错失机会。"},"examples":[{"en":"Her overtimidness kept her from asking questions in class, even when she was confused.","zh":"她的过度胆怯让她即使困惑也不敢在课堂上提问。"},{"en":"Overtimidness can make job interviews harder because you may undersell your strengths.","zh":"过度胆怯会让面试更难，因为你可能不敢充分展示自己的优势。"}]}],"synonyms":["excessive shyness","overcautiousness","timidity","diffidence"],"phonetic":"/ˌoʊvərˈtɪmɪdnəs/","extraExplanation":["“overtimidness”并不是非常常见或固定的标准词形，更常见的写法是 “over-timidness”（带连字符）或直接用更常用的名词如 “excessive shyness / timidity”。这里的 over- 是前缀，表示“过度、太……”。","语气上，“overtimidness”通常带有说话者的评价：认为这种胆怯已经“超过合适程度”，暗示需要更自信或更主动。"]}
{"word":"overtiming","summary":{"en":"“Overtiming” usually means getting timing wrong by doing it too early/late or too long; in mechanics it can mean engine timing set too far advanced.","zh":"“Overtiming”通常指时机/节奏把握过头（太早、太晚或太久）；在机械领域也可指发动机正时设得过于提前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of timing something incorrectly by doing it too early, too late, or for longer than needed; overdoing the timing of an action","zh":"把握时机不当（过早、过晚或持续过久）；在时机/节奏上“用力过猛”"},"examples":[{"en":"In comedy, overtiming a pause can make the joke feel awkward instead of funny.","zh":"在喜剧表演中，停顿过久（overtiming）会让笑点变尴尬，而不是更好笑。"},{"en":"The striker’s run was good, but overtiming it by half a second put him offside.","zh":"前锋的跑位不错，但时机差了半秒（overtiming），结果越位了。"}]},{"partOfSpeech":"n.","definition":{"en":"in engines and mechanical systems: setting the timing too far advanced (or otherwise beyond the recommended specification), which may cause knocking, poor performance, or damage","zh":"（发动机/机械系统）把点火/配气等“正时”设得过于提前（或偏离规定值过多），可能导致爆震、性能下降或损伤"},"examples":[{"en":"Overtiming the ignition can cause knocking under load.","zh":"点火正时过于提前（overtiming）会在负载下引发爆震。"},{"en":"The mechanic fixed the issue by correcting the overtiming.","zh":"技师通过校正过度提前的正时（overtiming）解决了问题。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “overtime” in a rare sense: to time something too much/too far (not common in everyday English)","zh":"（罕见用法）动词“overtime/over-time” 的现在分词：在时机/计时上做过头（日常英语中不常用）"},"examples":[{"en":"You’re overtiming the reveal—show the result sooner.","zh":"你把揭晓拖太久了（overtiming）——早点展示结果。"}]}],"synonyms":["mistiming","bad timing","overdoing the pause","timing too advanced"],"phonetic":"/ˌoʊvɚˈtaɪmɪŋ/","extraExplanation":["“overtiming”不是高频词，更常见的表达是：timing it wrong（时机不对）、overdoing the timing（时机/停顿过度）、too early/too late（太早/太晚）、dragging it out（拖太久）。","在汽车/发动机语境中更可能见到带连字符的写法 over-timing，或更常用的说法 ignition timing too advanced（点火正时过于提前）。"]}
{"word":"overtimorous","summary":{"en":"“Overtimorous” means excessively timid or overly fearful.","zh":"“overtimorous”表示“过分胆怯、过度害怕”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively fearful or timid; too easily scared or worried.","zh":"过分胆怯的；过于害怕的；畏首畏尾的。"},"examples":[{"en":"She was overtimorous about speaking in class, even when she knew the answer.","zh":"她在课堂上发言时过分胆怯，即使知道答案也不敢说。"},{"en":"An overtimorous reaction can stop you from trying new things.","zh":"过分胆怯的反应可能会让你不敢尝试新事物。"}]}],"synonyms":["overly timid","too cautious","fearful","timid","apprehensive"],"phonetic":"/ˌoʊvɚˈtɪm(ə)rəs/","extraExplanation":["“overtimorous”由前缀 over-（过度）+ timorous（胆怯的）构成，语气偏书面，常用于批评某人“谨慎过头、怕得不必要”。日常口语里更常说 “too timid / overly cautious / scared”。"]}
{"word":"overtimorously","summary":{"en":"“Overtimorously” means acting in an overly timid or excessively cautious way.","zh":"“overtimorously”表示“过度胆怯/过分谨慎地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively timid, fearful, or cautious way; more afraid than the situation requires.","zh":"以过度胆怯、害怕或过分谨慎的方式；比情境所需更害怕。"},"examples":[{"en":"He acted overtimorously and refused to speak up in the meeting.","zh":"他表现得过于胆怯，在会议上不敢发言。"},{"en":"The company responded overtimorously to a small mistake, apologizing again and again.","zh":"公司对一个小错误反应过于谨慎，反复道歉。"}]}],"synonyms":["overly timidly","too timidly","overcautiously","excessively cautiously","fearfully"],"phonetic":"/ˌoʊvərˈtɪmərəsli/","extraExplanation":["这是一个很少见、偏书面/文学风格的副词，来自形容词 timorous（胆怯的）加前缀 over-（过度）再加 -ly（副词后缀）。日常英语里更常用：too timidly / overly cautiously / excessively fearfully 等。","timorous 与 timid 意思接近，但 timorous 更正式、带一点“畏缩、怯懦”的语感；overtimorously 则强调“过头了”的胆怯。"]}
{"word":"overtimorousness","summary":{"en":"Overtimorousness means being excessively timid or fearful.","zh":"overtimorousness 指“过度胆怯、过分害怕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive fearfulness or shyness; an overly timid temperament","zh":"过度胆怯；过分害怕或害羞的性格"},"examples":[{"en":"His overtimorousness kept him from asking questions in class.","zh":"他过度胆怯，导致他在课堂上不敢提问。"},{"en":"With practice and support, she gradually overcame her overtimorousness around strangers.","zh":"在练习和支持下，她逐渐克服了面对陌生人时的过度胆怯。"}]}],"synonyms":["extreme timidity","excessive shyness","fearfulness","overcautiousness","timorousness"],"phonetic":"/ˌoʊvɚˈtɪmɚəsnəs/","extraExplanation":["这是一个非常少见的名词，由 over-（过度）+ timorous（胆怯的）+ -ness（名词后缀）构成，语气比 timidness 更强调“过分、超出正常程度”的胆怯。","在正式或文学语境中更可能出现；日常英语里更常说 excessive shyness / extreme timidity / being too timid。"]}
{"word":"overtinsel","summary":{"en":"“Overtinsel” means overly glittery or showy in a cheap way, or to over-decorate something with tinsel.","zh":"“overtinsel”表示过分闪亮浮夸（显得廉价），也可指用金银丝把某物装饰得过度花哨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively showy or glittery in a cheap or artificial way; too “tinsel-like.”","zh":"（装饰或风格）过分闪亮、浮夸而显得廉价或不真诚；过于“金银丝般”的。"},"examples":[{"en":"The stage design felt overtinsel—lots of sparkle, but not much substance.","zh":"舞台设计显得很 overtinsel——闪是闪了，但没什么内涵。"},{"en":"She avoided overtinsel decorations and chose simple lights instead.","zh":"她避免用过于浮夸的装饰，改用简单的灯饰。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or decorate something with too much tinsel; to make something look gaudy by over-decorating it.","zh":"用过多的金银丝装饰；把某物装饰得过度花哨、俗艳。"},"examples":[{"en":"They overtinseled the tree until it looked messy.","zh":"他们把树装饰得太夸张，结果看起来有点乱。"},{"en":"Don’t overtinsel your presentation—keep the slides clean and clear.","zh":"别把演示做得太花哨——幻灯片保持干净清晰就好。"}]}],"synonyms":["gaudy","flashy","overdecorated","tawdry"],"phonetic":"ˌoʊvərˈtɪnsəl","extraExplanation":["“overtinsel”不是非常常见的标准词，更像是由 over-（过度）+ tinsel（金银丝装饰）构成的创造性用法。写作中用它可以带一点批评意味：外表很闪，但显得廉价、浮夸或缺乏真诚。","相关表达：overdecorated（装饰过度）、gaudy（俗艳的）、flashy（浮夸的）、all show and no substance（只有排场没有实质）。"]}
{"word":"overtinseled","summary":{"en":"Overtinseled means overly decorated with glittery ornament, or (figuratively) overly embellished.","zh":"Overtinseled 指装饰得过分花哨（像堆满亮片），也可比喻“过度粉饰、浮夸包装”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"decorated too much with showy, glittery ornament (like tinsel); overly gaudy","zh":"用亮片/金葱等装饰得过多；过分华丽而显得俗艳"},"examples":[{"en":"The hall looked overtinseled for a school event—sparkly, but a bit too much.","zh":"这礼堂对学校活动来说装饰得过分花哨——闪闪发亮，但有点过头。"},{"en":"Her overtinseled dress drew attention, though it didn’t feel elegant.","zh":"她那件过分华丽的裙子很吸睛，但并不显得优雅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) made to seem better or more impressive than it really is; over-embellished","zh":"（比喻）过度粉饰的；被包装得比实际更好看的"},"examples":[{"en":"The movie’s overtinseled marketing promised a masterpiece, but the story was thin.","zh":"这部电影的过度包装式宣传把它吹成杰作，但故事内容很单薄。"},{"en":"He disliked overtinseled speeches and preferred simple, honest words.","zh":"他不喜欢过分粉饰的演讲，更偏爱朴素真诚的话。"}]}],"synonyms":["gaudy","overdecorated","overdone","flashy","tawdry","over-embellished"],"phonetic":"/ˌoʊvərˈtɪnsəld/","extraExplanation":["这个词由 over-（过度）+ tinsel（亮片、俗艳的装饰）构成，常带有“华而不实”的批评意味。","tinsel 在英语里除了指“金葱/亮片装饰”，也常用来形容“看起来闪亮但价值不高”的东西；因此 overtinseled 很容易引申到“过度包装、浮夸”。","它不是特别常见的日常词，更像文学或评论用语；日常表达里常用 gaudy, too flashy, overly decorated, overdone 等替换。"]}
{"word":"overtinseling","summary":{"en":"“Overtinseling” is a rare, informal word meaning decorating with too much tinsel.","zh":"“overtinseling”较少见、偏口语，意思是“用太多金葱/亮片装饰，把装饰弄得过头”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"decorating something with too much tinsel (excessively glittery decoration), often in a humorous or critical way","zh":"用过多的亮片/金葱装饰某物（装饰得过于花哨），常带调侃或批评语气"},"examples":[{"en":"They ruined the simple tree by overtinseling it with silver strands.","zh":"他们用一堆银色亮片把原本简洁的圣诞树装饰过头了。"},{"en":"Try not to go overtinseling—less is more.","zh":"尽量别装饰过头——少即是多。"}]}],"synonyms":["overdecorate","go overboard (with decorations)","make too gaudy"],"phonetic":"/ˌoʊvɚˈtɪnsəlɪŋ/","extraExplanation":["“overtinseling”不是常见的标准英语拼写，更像是把 over-（过度）+ tinsel（亮片；金葱装饰）+ -ing（进行/动名词）临时组合出来的说法，常用于节日语境，带一点幽默感。","如果你想表达更常见的“装饰过度/过分花哨”，也可以用：overdecorate, go overboard with decorations, too gaudy。"]}
{"word":"overtint","summary":{"en":"“Overtint” means to add too much color or tint, making something look unnaturally dark or strong.","zh":"“overtint”指给颜色/滤镜加得过多，导致颜色过深或不自然。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tint (add color to) something too strongly or too much, so the color looks unnatural or too dark","zh":"给某物上色/染色过度（颜色太浓、太深或不自然）"},"examples":[{"en":"The photo was overtinted, so everyone’s skin looked orange.","zh":"这张照片被过度调色了，所以每个人的皮肤都显得发橙。"},{"en":"Be careful not to overtint the windows, or the room will feel too dark.","zh":"小心别把窗户贴膜/染色弄得太深，不然房间会显得太暗。"}]},{"partOfSpeech":"vt.","definition":{"en":"to color something too much (often by mistake) when editing, painting, or printing","zh":"（常指在编辑、绘画或印刷中）把颜色加得过头（多为失误）"},"examples":[{"en":"I overtinted the background while editing, and the image lost detail.","zh":"我修图时把背景颜色加过头了，画面细节都丢了。"},{"en":"The printer overtinted the proof, so we asked for a reprint.","zh":"印刷厂把打样印得颜色过浓，所以我们要求重印。"}]}],"synonyms":["overcolor","over-saturate","overdo the tint","make too dark"],"phonetic":"/ˌoʊvɚˈtɪnt/","extraExplanation":["“overtint”由 over-（过度）+ tint（着色）构成，含义直观，常见于摄影/修图、印刷、油漆或汽车玻璃贴膜等语境。更常见的表达还有：over-tint / over-tinting，或用 “too dark / too saturated / overcolored” 来描述效果。"]}
{"word":"overtip","summary":{"en":"“Overtip” means to tip more money than is usual or intended.","zh":"“Overtip”表示给小费给得比通常或本来想给的更多。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give a tip (extra money for service) that is larger than usual or more than you intended","zh":"给（服务人员）小费给得过多；多给小费（超过一般标准或超出本意）"},"examples":[{"en":"I think I overtipped because I was nervous and didn’t want to seem rude.","zh":"我觉得我多给小费了，因为我紧张，不想显得没礼貌。"},{"en":"If the service charge is already included, you might accidentally overtip.","zh":"如果账单里已经包含服务费，你可能会不小心多给小费。"}]}],"synonyms":["tip too much","overpay (a tip)","be overly generous with the tip"],"phonetic":"ˌoʊvərˈtɪp","extraExplanation":["在美国等有“小费文化”的地方（如餐厅、酒吧、出租车、美发等），小费常被视为服务人员收入的重要部分，所以有人会因为不熟悉规则、算错百分比、或想表达感谢而“overtip”。如果账单上写了 gratuity included / service charge included（已含小费/服务费），通常就不需要再额外给（或只需少量补贴）。"]}
{"word":"overtipple","summary":{"en":"Overtipple means (in archaic English) to drink alcohol too much and become tipsy or drunk.","zh":"overtipple 指（古语/文语）饮酒过量，以至于微醺或醉酒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(archaic) To drink too much alcohol; to become tipsy or drunk from drinking.","zh":"（古语/文语）饮酒过量；因喝酒而微醺或醉酒。"},"examples":[{"en":"He was fined for overtipp​ling and causing trouble in the street.","zh":"他因饮酒过量、在街上闹事而被罚款。"},{"en":"The story warns that overtipp​ling can lead to poor judgment.","zh":"这个故事告诫人们，饮酒过量会导致判断失误。"}]}],"synonyms":["overdrink","drink too much","get drunk","get tipsy","imbibe (formal)"],"phonetic":"/ˌoʊvərˈtɪpəl/","extraExplanation":["“overtipple”属于较少见的旧式用法（archiac），由 over-（过度）+ tipple（小酌/喝酒，常指习惯性或频繁地喝）组成。现代英语里更常说 “drink too much / overdrink / get drunk / get tipsy”。","“tipple”本身带一点“经常喝、随手喝”的语气；加上 over- 后强调“过量”。在当代写作中使用“overtipple”会显得很古典、带文学或仿古风格。"]}
{"word":"overtippled","summary":{"en":"Overtippled means very drunk from drinking too much alcohol (a rare, literary/old-fashioned word).","zh":"overtippled 指因饮酒过量而非常醉（较少见，偏文学/旧式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"drunk from drinking too much alcohol; overly intoxicated (often literary or old-fashioned).","zh":"因饮酒过量而醉酒；烂醉（常见于文学或较旧的用法）。"},"examples":[{"en":"He came home overtippled and could barely stand.","zh":"他烂醉着回到家，几乎站不稳。"},{"en":"The innkeeper refused to serve anyone who looked overtippled.","zh":"店主拒绝再给任何看起来已经醉了的人上酒。"}]}],"synonyms":["drunk","intoxicated","inebriated","wasted","tipsy (weaker)"],"phonetic":"/ˌoʊvərˈtɪpəld/","extraExplanation":["“overtippled”来自动词“tipple”（小口/频频饮酒，尤指嗜酒）。前缀“over-”表示“过度”，因此整体意思就是“喝过头了、醉得厉害”。","这个词在现代日常英语中很少见，更可能出现在旧文本、戏剧化叙述或模仿古风的写作里；现代更常用的表达是“drunk / wasted / intoxicated”。"]}
{"word":"overtippling","summary":{"en":"“Overtippling” means excessive drinking of alcohol; it’s a somewhat old-fashioned/literary word.","zh":"“overtippling”指过度饮酒/酗酒，属于较旧式或文学化的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of drinking too much alcohol; excessive drinking","zh":"过度饮酒；酗酒"},"examples":[{"en":"His health declined because of overtippling.","zh":"他的健康因为过度饮酒而恶化。"},{"en":"The novel hints at overtippling as a coping habit during hard times.","zh":"小说暗示人们在艰难时期会以酗酒来应对。"}]},{"partOfSpeech":"v.","definition":{"en":"drinking too much alcohol (present participle/gerund of “overtipple”)","zh":"（作为动词进行式/动名词）饮酒过量；喝得太多"},"examples":[{"en":"He was overtippling at the tavern night after night.","zh":"他一夜又一夜在酒馆里喝得过量。"},{"en":"Overtippling can lead to poor decisions and unsafe situations.","zh":"饮酒过量可能导致糟糕的决定和不安全的处境。"}]}],"synonyms":["heavy drinking","excessive drinking","binge drinking","overindulgence (in alcohol)","drunkenness"],"phonetic":"/ˌoʊvərˈtɪpəlɪŋ/","extraExplanation":["“overtippling / overtipple”较少见，带有旧式或文学色彩：tipple 表示“（尤指习惯性地）小酌/喝酒”，加上 over- 强调“过度”。在现代英语中更常用 drinking too much、heavy drinking、binge drinking（暴饮）等表达。","常见搭配与替代表达：overindulgence in alcohol（过度纵酒，较正式）、alcohol abuse（酒精滥用，更偏医学/社会语境）。"]}
{"word":"overtips","summary":{"en":"“Overtip” means to give a tip that’s bigger than usual, or the unusually large tip itself.","zh":"“overtip”指小费给得过多，也可指“过高的小费”本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone a tip that is larger than usual or larger than necessary","zh":"（在餐厅、打车等）给小费给得过多；给超出一般或必要额度的小费"},"examples":[{"en":"He overtiped because he felt guilty about the delay.","zh":"他因为对延误感到愧疚，所以小费给多了。"},{"en":"Tourists sometimes overtip when they don’t know the local customs.","zh":"游客不了解当地习惯时，有时会给过多的小费。"}]},{"partOfSpeech":"n.","definition":{"en":"an unusually large tip; extra money given as a tip beyond what is typical","zh":"过高的小费；超出常规的小费金额"},"examples":[{"en":"The waiter smiled after receiving an overtip.","zh":"服务员收到一笔过高的小费后笑了。"},{"en":"A small overtip can be a kind way to show appreciation.","zh":"适当多给一点小费，有时是一种友善的感谢方式。"}]}],"synonyms":["tip too much","overpay (as a tip)","leave a big tip"],"phonetic":"/ˌoʊvɚˈtɪp/","extraExplanation":["“overtips”多半是动词“overtip”的第三人称单数（He/She overtips）或名词复数（two overtips）。","关于小费文化：在美国餐厅堂食通常会给账单金额的15%–20%作为小费；外带（takeout）不一定需要给；酒吧每杯给1–2美元也很常见。不了解规则时容易“overtip”。","拼写提醒：过去式/过去分词常见写法是“overtipped”（双写p）。"]}
{"word":"overtire","summary":{"en":"“Overtire” means to make someone too tired, or (less commonly) to become too tired.","zh":"“overtire”指使人过度疲劳，或（较少用）变得过度疲劳。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something too tired; to tire excessively","zh":"使（某人或某物）过度疲劳；让……太累"},"examples":[{"en":"The long hike overtired the children, and they fell asleep in the car.","zh":"长途徒步把孩子们累坏了，他们在车里就睡着了。"},{"en":"Try not to overtire yourself before the exam.","zh":"考试前尽量别把自己累过头。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too tired; to get exhausted (less common)","zh":"（不及物）变得过度疲劳；累过头（较不常用）"},"examples":[{"en":"If you overtire, your concentration may drop.","zh":"如果你累过头，注意力可能会下降。"},{"en":"She tends to overtire when she works late for several days in a row.","zh":"她连续几天加班到很晚时，往往会累过头。"}]}],"synonyms":["exhaust","wear out","tire out","overwork","overdo it"],"phonetic":"ˌoʊvərˈtaɪr","extraExplanation":["“overtire”由 over-（过度）+ tire（使疲劳）构成，语气中性，常用于提醒不要把自己或他人“累过头”。","更口语的替换说法常见有：“wear someone out / exhaust someone / overdo it”。其中“overdo it”强调做得太多而导致疲劳。"]}
{"word":"overtired","summary":{"en":"Overtired means too tired or exhausted, often to the point that it affects mood, focus, or sleep.","zh":"overtired 指“累过头、过度疲劳”，常会影响情绪、专注力或睡眠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too tired; exhausted, often from not getting enough sleep or resting for too long.","zh":"过度疲劳的；累过头的（常因睡眠不足或休息不够而导致）。"},"examples":[{"en":"I’m overtired, so I can’t focus on my homework.","zh":"我累过头了，所以没法专心写作业。"},{"en":"The baby got overtired and started crying.","zh":"宝宝累过头了，就开始哭闹。"},{"en":"If you feel overtired, take a short break and drink some water.","zh":"如果你觉得过度疲劳，就短暂休息一下，喝点水。"}]}],"synonyms":["exhausted","worn out","sleep-deprived","fatigued"],"phonetic":"/ˌoʊvɚˈtaɪɚd/","extraExplanation":["“overtired”在日常英语中很常见，常用来描述因为太累而变得更难入睡、情绪更不稳定的状态，尤其常见于育儿语境（比如婴儿“累过头反而闹、不睡”）。","构词法：over-（过度）+ tired（疲倦的）。同类表达还有“overworked”（过度工作），“overstressed”（压力过大）。"]}
{"word":"overtiredness","summary":{"en":"Overtiredness means being excessively tired, often causing irritability or poor focus.","zh":"Overtiredness 指过度疲劳，常伴随烦躁或注意力下降等表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being extremely tired, often so tired that you feel irritable, unfocused, or unable to sleep well.","zh":"过度疲劳；极度疲倦（常常累到烦躁、注意力不集中，甚至反而睡不好）。"},"examples":[{"en":"After three nights of little sleep, her overtiredness made it hard to concentrate at work.","zh":"连续三晚没睡好后，她的过度疲劳让她很难在工作中集中注意力。"},{"en":"The toddler’s crying wasn’t misbehavior—it was overtiredness.","zh":"这个幼儿哭闹不是故意捣乱，而是因为过度疲劳。"},{"en":"Caffeine can mask overtiredness for a while, but the crash later can feel worse.","zh":"咖啡因可以暂时掩盖过度疲劳，但之后的“崩溃感”可能更难受。"}]}],"synonyms":["extreme fatigue","exhaustion","sleep deprivation (related)","overfatigue"],"phonetic":"ˌoʊvərˈtaɪərdnəs","extraExplanation":["“overtiredness”由 over-（过度）+ tired（疲劳）+ -ness（名词后缀）构成，表示一种“状态”。日常表达里也常见写法“over-tiredness”（带连字符），意思相同。","常见搭配：overtiredness can lead to…（过度疲劳会导致……）；signs of overtiredness（过度疲劳的迹象）；fight overtiredness（对抗/缓解过度疲劳）。"]}
{"word":"overtires","summary":{"en":"“Overtires” means “(someone) becomes too tired” or “makes someone too tired”; it’s the present tense third-person form of “overtire.”","zh":"“overtires”表示“累过头/使……累过头”，是动词“overtire”的一般现在时第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (someone or yourself) too tired; to tire out excessively","zh":"使（某人或自己）过度疲劳；让……累过头"},"examples":[{"en":"Don’t overtire the kids before the trip tomorrow.","zh":"别在明天出行前把孩子们累过头。"},{"en":"I overtires myself when I try to finish everything in one night.","zh":"我想一晚上把所有事都做完时，常常把自己累过头。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too tired","zh":"变得过度疲劳；累过头"},"examples":[{"en":"If you overtire, you may get sick more easily.","zh":"如果你累过头，可能更容易生病。"},{"en":"She tends to overtire after long meetings.","zh":"她开长会后很容易累过头。"}]}],"synonyms":["tire out","wear out","exhaust","overwork"],"phonetic":"/ˌoʊvɚˈtaɪr/","extraExplanation":["“overtires”通常是动词 overtire 的第三人称单数（he/she/it overtires）。在现代英语里这个动词不算常用，更常见的表达是：tire someone out / wear someone out，或形容词 overtired（如：I’m overtired）。","拼写提醒：很多学习者会把它当成“over + tires（轮胎）”。如果你看到的是 “over tires”，需要根据上下文判断是否在说“超过/跨过轮胎”。"]}
{"word":"overtiring","summary":{"en":"Overtiring means “too tiring” or “making someone too tired.”","zh":"overtiring 表示“太累人”或“使人过度疲劳”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively tiring; causing more fatigue than is healthy or reasonable.","zh":"过度累人的；让人疲惫过头的（不健康或不合适）。"},"examples":[{"en":"Working twelve-hour shifts for weeks is overtiring.","zh":"连续几周上十二小时班是过度累人的。"},{"en":"The schedule is overtiring for new employees.","zh":"这份排班对新员工来说太累了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make (yourself or someone) too tired; to exhaust by doing too much.","zh":"使（自己或别人）过度疲劳；因做得太多而耗尽体力。"},"examples":[{"en":"Try not to overtire yourself before the exam.","zh":"考试前尽量别把自己累过头。"},{"en":"The coach warned the team not to overtire during training.","zh":"教练提醒队员训练时不要过度疲劳。"}]}],"synonyms":["too tiring","exhausting","draining","wearing","fatiguing"],"phonetic":"/ˌoʊvərˈtaɪrɪŋ/","extraExplanation":["“overtiring”在日常英语里更常见的是作形容词（= too tiring），有时也会写成带连字符的“over-tiring”。作为动词“overtire”的现在分词时，语气偏正式或书面，口语里更常说“exhaust”或“tire yourself out”。"]}
{"word":"overtitle","summary":{"en":"“Overtitle” usually means a title/heading placed above content (especially in publishing or screen text).","zh":"“Overtitle”通常指置于内容上方的标题/栏题（多见于出版排版或影视画面文字）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(publishing, TV/film) A title shown above something, especially a heading placed over an image, article, or opening sequence.","zh":"（出版、电视/电影）置于某内容上方的标题；尤指放在图片、文章或片头画面上方的标题/字幕。"},"examples":[{"en":"The magazine used a bold overtitle above the photo to introduce the story.","zh":"杂志在照片上方用了一个醒目的 overtitle 来引出报道。"},{"en":"In the opening credits, the overtitle appears before the main title.","zh":"在片头字幕中，overtitle 会在主标题之前出现。"}]},{"partOfSpeech":"v.","definition":{"en":"To give something an overtitle; to place a heading/title above content (rare).","zh":"给……加上上方标题；把标题/栏目名置于内容上方（较少用）。"},"examples":[{"en":"They overtitle the section with a short phrase to guide readers.","zh":"他们用一个简短短语给这一栏加上上方标题来引导读者。"}]}],"synonyms":["heading","headline","title","caption"],"phonetic":"/ˌoʊvərˈtaɪtəl/","extraExplanation":["“overtitle”在日常英语里不算常见，更多见于排版、出版、媒体制作等语境。更常用、更通用的说法包括：headline（标题）、heading（页眉/标题）、caption（图片说明）、title card（片名卡/标题画面）等，具体用哪个取决于它在版面或画面中的位置与功能。"]}
{"word":"overtly","summary":{"en":"“Overtly” means “openly and clearly, not hidden,” and it can also suggest “too obvious or tactless.”","zh":"“overtly”表示“公开而明显地、不隐晦”，有时也含“过于明显/不够得体”的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is open and obvious, not hidden or subtle.","zh":"以公开且明显的方式；不隐晦、不含蓄。"},"examples":[{"en":"He was overtly critical of the plan during the meeting.","zh":"他在会议上公开而明显地批评了这个计划。"},{"en":"The advertisement was overtly aimed at young consumers.","zh":"这则广告明显是针对年轻消费者的。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is too obvious or not tactful; so clear that it may feel awkward or inappropriate.","zh":"过于明显（以至于显得不圆滑/不合时宜）；直白得让人尴尬或不舒服。"},"examples":[{"en":"She was overtly friendly, which made some people uncomfortable.","zh":"她表现得过于热情，反而让一些人不自在。"},{"en":"The message was overtly political for a family event.","zh":"在家庭聚会上，这条信息显得过于政治化。"}]}],"synonyms":["openly","plainly","clearly","explicitly","manifestly"],"phonetic":"/oʊˈvɝːtli/","extraExplanation":["“overtly”来自形容词“overt”（公开的、明显的）+ 副词后缀“-ly”。它常和“covertly”（秘密地、暗中地）形成对比：overtly = 明着来，covertly = 暗着来。","语气上，“overtly”有时带一点评价色彩：说某事 overtly，可能暗示“太明显了/不够含蓄”。常见搭配：overtly hostile（明显敌对的）、overtly sexual（明显带性暗示的）、overtly racist（明显种族歧视的）。"]}
{"word":"overtness","summary":{"en":"Overtness means being open and clearly shown, not hidden.","zh":"Overtness 指“公开、明显、不隐藏”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being open, obvious, and not hidden; openness","zh":"公开、明显、不隐藏的特质；公开性"},"examples":[{"en":"The overtness of his criticism surprised everyone in the meeting.","zh":"他在会议上批评得如此公开直接，让所有人都很惊讶。"},{"en":"Some cultures value indirectness, while others prefer overtness in communication.","zh":"有些文化更重视含蓄，而另一些文化更偏好沟通中的公开直接。"}]}],"synonyms":["openness","directness","explicitness","plainness","frankness"],"phonetic":"/oʊˈvɝtnəs/","extraExplanation":["“overtness”来自形容词“overt（公开的、明显的）”。它在日常口语中不算常见，更常见的表达是“openness”“directness”或“being overt”。","它常与“covert（隐蔽的、暗中的）”成对出现：例如 overt action（公开行动） vs. covert action（秘密行动）；overt racism（公开的种族歧视） vs. covert racism（隐性的种族歧视）。"]}
{"word":"overtoe","summary":{"en":"Overtoe is a rare word meaning “to step on someone’s toe,” and it can also refer (rarely, in horse care) to an overreach-type hoof injury.","zh":"overtoe 是个很少见的词，常指“踩到某人的脚趾”；在马术/护蹄语境中也可（较罕见地）指类似“后蹄撞前蹄（overreach）”的蹄部碰撞/伤。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To step on someone’s toe; to tread on.","zh":"（罕见）踩到某人的脚趾；踩踏。"},"examples":[{"en":"Sorry—I didn’t mean to overtoe you in the crowd.","zh":"对不起——人太挤了，我不是故意踩到你的脚趾。"},{"en":"He backed up too quickly and overtoed the person behind him.","zh":"他后退得太快，踩到了身后那个人的脚趾。"}]},{"partOfSpeech":"n.","definition":{"en":"(Specialized, rare; in horse care) An injury or event where a horse’s hind hoof strikes the front foot around the toe/heel area (often called an “overreach”).","zh":"（专业且罕见；马术/护蹄）马的后蹄撞到前蹄趾部或跟部附近造成的情况或伤（更常称为 overreach）。"},"examples":[{"en":"The farrier checked the horse after an overtoe to prevent infection.","zh":"马蹄铁匠在马发生“后蹄撞前蹄”的情况后检查了它，以防感染。"},{"en":"Boots can help reduce the risk of overtoe during fast work.","zh":"在快速训练时，护靴能帮助降低“后蹄撞前蹄”的风险。"}]}],"synonyms":["tread on (someone’s toe)","step on (someone’s toe)","overreach (horse)"],"phonetic":"/ˌoʊvərˈtoʊ/","extraExplanation":["“overtoe”在现代英语里非常少见，多数场景更常用的是“step on someone’s toe / tread on someone’s toe”。","很多学习者会把“overtoe”看成或误写成“overtone”（泛音；言外之意）。如果你原本想查的是“overtone”，告诉我你的语境，我可以按“overtone”再解释一遍。"]}
{"word":"overtoil","summary":{"en":"“Overtoil” means to work excessively and become exhausted (or, less commonly, to overwork someone else).","zh":"“overtoil”指过度辛劳、劳累至疲惫（较少见也可指让别人过度劳累）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to work too hard or for too long; to exhaust yourself through excessive labor","zh":"过度劳累；过分辛劳（把自己累坏）"},"examples":[{"en":"If you overtoil every week, your body will eventually demand rest.","zh":"如果你每周都过度劳累，你的身体终究会要求休息。"},{"en":"She overtoiled to support her family and became ill.","zh":"她为了养家过度辛劳，结果病倒了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone work too hard; to overwork (less common)","zh":"使……过度劳累；过度使用（某人的劳力）（较少见）"},"examples":[{"en":"Good managers avoid overtoiling their staff during busy seasons.","zh":"好的管理者会避免在旺季让员工过度劳累。"}]}],"synonyms":["overwork","work too hard","overexert (oneself)","toil excessively","grind (away)"],"phonetic":"/ˌoʊvərˈtɔɪl/","extraExplanation":["“overtoil”较少用于日常口语，更常见的表达是“overwork / work too hard”。它带有一点文学或较正式的语气，强调“toil（辛苦劳作）”这种费力、艰辛的劳动感。","构词：over-（过度）+ toil（辛苦劳作）。因此语气往往比“work too much”更沉重、更强调疲惫与消耗。"]}
{"word":"overtoiled","summary":{"en":"“Overtoiled” means exhausted from working too hard; it can also be the past form of “overtoil” (to overwork).","zh":"“overtoiled”表示因工作过度而精疲力竭；也可作“overtoil”（使过度劳作）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(describing a person) Having worked too hard; exhausted from too much labor.","zh":"（形容人）过度劳累的；因为干活太多而精疲力竭的。"},"examples":[{"en":"After weeks of overtime, she looked overtoiled and barely slept.","zh":"连续加班几周后，她看起来过度劳累，几乎没怎么睡。"},{"en":"The overtoiled workers asked for a day off to recover.","zh":"这些过度劳累的工人请求休息一天来恢复体力。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “overtoil”: to make yourself (or someone) toil too much; to overwork.","zh":"“overtoil”的过去式/过去分词：使（自己或他人）劳作过度；过度用功/过度工作。"},"examples":[{"en":"He overtoiled himself trying to finish the project in one weekend.","zh":"他为了一个周末完成项目，把自己累过头了。"},{"en":"They had overtoiled the team, and mistakes started to appear.","zh":"他们让团队过度劳作，错误开始出现。"}]}],"synonyms":["overworked","exhausted","worn out","burned out","fatigued"],"phonetic":"ˌoʊvərˈtɔɪld","extraExplanation":["“overtoiled”是由前缀 over-（过度）+ toil（辛苦劳作）构成，语气比常见的 “overworked” 更偏文学/较少见，用来强调“辛苦地干到过量”。在现代日常英语里通常用 overworked / exhausted / worn out 更自然。"]}
{"word":"overtoiling","summary":{"en":"“Overtoiling” means working excessively hard or too long, often to the point of exhaustion.","zh":"“overtoiling”指过度辛苦地工作或工作过久，常常累到精疲力竭。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"working too hard or for too long; doing more labor than is healthy or reasonable","zh":"过度劳累；工作过久或过于辛苦（超过健康或合理范围）"},"examples":[{"en":"She was overtoiling and started to feel sick from exhaustion.","zh":"她过度劳累，开始因为精疲力竭而感到不舒服。"},{"en":"Try not to keep overtoiling just to meet impossible deadlines.","zh":"别为了不可能的截止日期而一直过度劳累。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective/participle) describing someone or something that has been made very tired by excessive work","zh":"（作形容词/分词）形容因过度工作而疲惫不堪的"},"examples":[{"en":"An overtoiling worker may lose focus and make mistakes.","zh":"过度劳累的工人可能注意力下降，容易出错。"},{"en":"He looked overtoiling and worn out after weeks of overtime.","zh":"连续加班几周后，他看起来过度劳累、疲惫不堪。"}]}],"synonyms":["overworking","overwork","working too hard","overexerting","toiling too much"],"phonetic":"/ˌoʊvərˈtɔɪlɪŋ/","extraExplanation":["“overtoiling”来自 over-（过度）+ toil（辛苦劳动）。在现代英语里更常见的表达是 overwork / overworking 或 work too hard，所以它显得比较书面或少见。","如果你在写作中想更自然：可以用 “She’s overworked.”（她工作过度/被压榨得很累）或 “He’s been working himself too hard.”（他把自己累坏了）。"]}
{"word":"overtoils","summary":{"en":"“Overtoils” means works too hard/too long or exhausts someone through excessive toil (often a rarer, more literary choice than “overworks”).","zh":"“overtoils”表示（使）过度劳累、过度辛劳（比“overworks”更少见，也更偏书面/文学色彩）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to work too hard or too long; to exhaust (yourself or someone) by excessive labor","zh":"过度劳累；（因工作过多或过久而）使自己或他人筋疲力尽"},"examples":[{"en":"Don’t overtoil yourself—take breaks and drink water.","zh":"别让自己过度劳累——要休息并补充水分。"},{"en":"The manager worried the team was being overtoiled during the busy season.","zh":"经理担心旺季时团队被过度压榨、太劳累了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to labor excessively","zh":"（较少见）过度辛劳地工作"},"examples":[{"en":"If you overtoil, you may burn out quickly.","zh":"如果你过度辛劳，可能很快就会身心倦怠。"}]}],"synonyms":["overwork","overexert","wear out","burn out","tax"],"phonetic":"/ˌoʊvərˈtɔɪl/","extraExplanation":["“overtoils”通常是动词“overtoil”的第三人称单数（he/she/it overtoils）或名词复数形式（较少见）。在现代英语中更常用“overwork / overexert / work oneself to exhaustion”。","这个词带有一点文学或较旧书面语的感觉：toil 本身就有“辛苦劳作”的意味，因此 overtoil 强调“劳作过度”。"]}
{"word":"overtoise","summary":{"en":"“Overtoise” is not a standard English word; it’s likely a misspelling. Provide the sentence for an accurate fix.","zh":"“overtoise”不是标准英语单词，可能是拼写错误；请提供句子以便准确判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a typo or misspelling. Common intended words (depending on context) include “advertise,” “overwise” (rare), or “tortoise.”","zh":"不是标准英语单词；很可能是拼写错误。根据语境，常见的目标词可能是“advertise（做广告/宣传）”、较少见的“overwise”，或“tortoise（乌龟）”。"},"examples":[{"en":"“Overtoise” isn’t in most dictionaries—did you mean “advertise”?","zh":"“overtoise”在大多数词典里找不到——你是不是想写“advertise（宣传/做广告）”？"},{"en":"Please share the full sentence you saw “overtoise” in, and I can help you identify the right word.","zh":"请把你看到“overtoise”的完整句子发出来，我可以帮你判断它到底应该是哪一个词。"}]}],"phonetic":"/ˈoʊvərˌtɔɪz/","extraExplanation":["在英语学习中，遇到词典查不到的“单词”，通常有几种可能：①拼写错误（最常见）；②专有名词（人名、地名、品牌、游戏ID等）；③网络用语/小圈子用词；④古旧或极少用的词。把上下文句子贴出来是最快的确认方法。"]}
{"word":"overtold","summary":{"en":"“Overtold” means something has been told too many times or with too much detail (past form of overtell).","zh":"“overtold”表示某事被讲得太多、太频繁或太细（overtell 的过去式/过去分词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of **overtell**: to tell something too often, too fully, or in a way that becomes repetitive or tiresome.","zh":"**overtell** 的过去式/过去分词：把某事讲得太多、太频繁、太细，导致显得重复或令人厌烦。"},"examples":[{"en":"I had overtold the story, and everyone looked bored.","zh":"我把这个故事讲太多遍了，大家看起来都听烦了。"},{"en":"The joke was funny at first, but it was overtold.","zh":"这个笑话一开始很有趣，但后来被讲烂了。"}]}],"synonyms":["repeated","overexplained","told too much","retold too often"],"phonetic":"/ˌoʊvərˈtoʊld/","extraExplanation":["“overtell”并不是非常常见的日常用词，更常见的表达是：**tell too much**（讲太多）、**repeat the story**（重复讲）、**overexplain**（解释过头）、**beat a dead horse**（老生常谈/反复强调已无意义的事）。","前缀 **over-** 常表示“过度、太……”：如 **overwork**（过度工作）、**overeat**（吃太多）、**overthink**（想太多）。因此 **overtold** 的核心感觉就是“讲过头/讲到腻”。"]}
{"word":"overtolerance","summary":{"en":"Overtolerance means being too tolerant in a way that can cause problems.","zh":"overtolerance 指“过度宽容”，宽容过头而可能带来问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive tolerance; a willingness to accept behavior, ideas, or situations to an unhelpful or harmful degree.","zh":"过度宽容；对行为、观点或情况的接受程度过高，以至于不利或有害。"},"examples":[{"en":"Some critics argue that overtolerance can allow harmful behavior to continue unchecked.","zh":"一些批评者认为，过度宽容会让有害行为在缺乏约束的情况下继续发生。"},{"en":"In parenting, overtolerance may lead to unclear boundaries for children.","zh":"在育儿中，过度宽容可能导致孩子的界限不清。"}]}],"synonyms":["excessive tolerance","too much tolerance","over-permissiveness","leniency"],"phonetic":"/ˌoʊvərˈtɑlərəns/","extraExplanation":["“overtolerance”不是非常常见的标准词汇，更常见的表达是“excessive tolerance / too much tolerance / over-permissiveness（过度放任）”。","语境上多见于评论性写作（社会议题、教育、职场管理等），用来强调“宽容本来是优点，但过了头会带来负面后果”。"]}
{"word":"overtolerant","summary":{"en":"Overtolerant means excessively tolerant or lenient, often to the point that problems or bad behavior are allowed to continue.","zh":"Overtolerant 指“过于宽容/过分包容”，往往带有负面含义，强调因为太放任而让问题或不良行为持续。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing to accept behavior, opinions, or differences; overly lenient or permissive.","zh":"过于宽容的；过分包容的（对行为、观点或差异过于放任）。"},"examples":[{"en":"Some parents worry they are being overtolerant when they never set clear rules.","zh":"有些父母担心自己太过宽容，因为他们从不设定明确的规则。"},{"en":"If a manager is overtolerant of late arrivals, the whole team’s standards may drop.","zh":"如果经理对迟到过分宽容，整个团队的标准可能会下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"Accepting problems or harmful actions for too long instead of addressing them.","zh":"对问题或有害行为忍让过久（没有及时处理）。"},"examples":[{"en":"Being overtolerant of disrespect can damage a friendship.","zh":"对不尊重过分容忍会伤害友谊。"},{"en":"The school was criticized for being overtolerant of bullying.","zh":"这所学校因对霸凌过分容忍而受到批评。"}]}],"synonyms":["overly tolerant","too lenient","permissive","soft"],"phonetic":"/ˌoʊvərˈtɑlərənt/","extraExplanation":["“overtolerant”由前缀 over-（过度、太……）+ tolerant（宽容的）构成，语气通常带有批评或担忧：强调“宽容过头”，可能导致规则不清、纵容不当行为等。","它不是特别常见的固定词，更常见的表达是 “too tolerant / overly tolerant / overly lenient / permissive”。在正式写作中，用这些更自然。"]}
{"word":"overtolerantly","summary":{"en":"“Overtolerantly” means acting too tolerant or too leniently.","zh":"“overtolerantly”表示“过度宽容/过分纵容地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too tolerant or too lenient; with more acceptance or patience than is wise or fair in the situation.","zh":"过度宽容地；过分纵容地（对某事给予超过合理或公正程度的容忍/宽待）。"},"examples":[{"en":"The school handled repeated bullying overtolerantly, so the behavior continued.","zh":"学校对反复发生的霸凌处理得过于宽容，结果这种行为持续发生。"},{"en":"If you respond overtolerantly to constant lateness, people may think the rules don’t matter.","zh":"如果你对经常迟到的行为过分宽容，别人可能会觉得规定并不重要。"}]}],"synonyms":["too leniently","overly leniently","with excessive tolerance","too permissively"],"phonetic":"ˌoʊvərˈtɑlərəntli","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超出正常/合理范围”（如 overconfident 过于自信、overprotective 过度保护）。因此 overtolerantly 通常带有批评意味：不是一般的“宽容”，而是“宽容过头”。","这个词在日常口语中不算常见，更常见的表达有 too leniently（太宽松地）、with excessive tolerance（以过度容忍的方式）、overly tolerant（过于宽容的，形容词）。"]}
{"word":"overton","summary":{"en":"Overton is mainly a surname or place name; it’s also widely recognized from the phrase “Overton window,” the socially acceptable range of ideas in public debate.","zh":"Overton主要作姓氏或地名；也因短语“Overton window（奥弗顿之窗）”而常见，指公共讨论中社会可接受的观点范围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname and place name (e.g., towns in the U.S. and U.K.); used as a proper noun.","zh":"姓氏或地名（如美国、英国的一些城镇名）；作专有名词使用。"},"examples":[{"en":"Dr. Overton will speak at the conference tomorrow.","zh":"奥弗顿博士将于明天在会议上发言。"},{"en":"She grew up in Overton, Nevada.","zh":"她在内华达州的奥弗顿长大。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in politics/media) used in the phrase “Overton window,” meaning the range of ideas a society sees as acceptable or “mainstream” at a given time.","zh":"（政治/媒体）常用于短语“Overton window（奥弗顿之窗）”，指某个时期社会认为可接受、属“主流”的观点范围。"},"examples":[{"en":"Some commentators say the debate shifted the Overton window on immigration.","zh":"一些评论员说，这场辩论改变了移民议题的奥弗顿之窗。"},{"en":"Activists sometimes use bold proposals to move the Overton window.","zh":"行动者有时会用大胆的提案来推动奥弗顿之窗的变化。"}]}],"synonyms":["Overton window (related term)"],"phonetic":"/ˈoʊvərtən/","extraExplanation":["“Overton window（奥弗顿之窗）”来自美国政策分析领域，名称源于约瑟夫·P·奥弗顿（Joseph P. Overton）。核心想法是：政治人物更容易推动“落在可接受范围内”的政策，而这个范围会随时间、媒体叙事与社会讨论而移动。"]}
{"word":"overtone","summary":{"en":"An overtone is a subtle extra meaning or mood behind what is said; in music it also means a higher note heard along with a main note.","zh":"overtone 指话语或情境中暗含的意味/情绪色彩；在音乐中也指与基音同时出现的泛音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A subtle additional meaning, feeling, or quality that is suggested along with the main message.","zh":"（除主要意思外）暗含的意味、情绪或色彩；弦外之音。"},"examples":[{"en":"Her comments had political overtones, even though she said she was only talking about public safety.","zh":"她的话带有政治意味，尽管她说自己只是谈公共安全。"},{"en":"The story has dark overtones that make it feel uneasy.","zh":"这个故事有阴暗的色彩，让人觉得不安。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a higher note that is produced at the same time as a main note (the fundamental).","zh":"（音乐）泛音；与基音同时产生的较高频音。"},"examples":[{"en":"A violin’s rich sound comes from its many overtones.","zh":"小提琴音色丰富，来自它的许多泛音。"},{"en":"Singers learn to control overtones to change the color of their voice.","zh":"歌手会学习控制泛音来改变嗓音的音色。"}]},{"partOfSpeech":"n.","definition":{"en":"A light or subtle shade of color, especially in hair, paint, or makeup.","zh":"（颜色）底色、隐约的色调（尤指发色、涂料或化妆品中的色彩倾向）。"},"examples":[{"en":"This foundation has warm overtones, so it suits yellow-toned skin.","zh":"这款粉底带暖调底色，所以适合偏黄底的肤色。"},{"en":"The brown has red overtones that show in sunlight.","zh":"这种棕色带一点红调，在阳光下更明显。"}]}],"synonyms":["implication","undertone","nuance","suggestion","connotation"],"phonetic":"/ˈoʊvərˌtoʊn/","extraExplanation":["词源上，overtone 可理解为“在……之上的音/调”。因此它既能指音乐里的“泛音”，也很自然地引申为语言或情境中“主信息之外、隐约听得出来的意味”（弦外之音）。","在写作与阅读中，overtone 常用来谈“语气/氛围”：例如 racial overtones（种族意味）、sexual overtones（性暗示）、religious overtones（宗教色彩）。它通常比 implication 更强调“情绪与氛围”，比 undertone 更偏“明显一点、浮在表面一点”的暗示。"]}
{"word":"overtones","summary":{"en":"Overtones are subtle implied meanings or feelings; in music they are harmonics; in color they can mean a slight secondary tint.","zh":"Overtones 指“弦外之音/暗含意味”；在音乐中指“泛音”；在颜色上可指“隐约的底色/色调”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Subtle or indirect meanings, feelings, or suggestions that are not stated openly (often in speech, writing, or situations).","zh":"（话语、文字或情境中）未明说但暗含的意思、情绪或暗示；弦外之音。"},"examples":[{"en":"His comments had political overtones, even though he never mentioned an election.","zh":"他的话带有政治意味，尽管他从未提到选举。"},{"en":"The conversation had overtones of anger and disappointment.","zh":"这段对话里隐约透着愤怒与失望。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, higher notes that are naturally produced along with a main note (harmonics).","zh":"（音乐）泛音；一个主音同时自然产生的较高频率的音（谐波）。"},"examples":[{"en":"A violin’s tone is rich because it contains many overtones.","zh":"小提琴的音色很丰富，因为它包含许多泛音。"},{"en":"Different instruments have different overtones, which is why they sound distinct.","zh":"不同乐器的泛音不同，所以听起来各有特色。"}]},{"partOfSpeech":"n.","definition":{"en":"A slight secondary quality in color or appearance, especially a hint of another color.","zh":"（颜色/外观）隐约的底色；带一点其他颜色的色调。"},"examples":[{"en":"The paint looks gray with blue overtones in natural light.","zh":"这种油漆在自然光下看起来是灰色中带点蓝调。"}]}],"synonyms":["undertones","implications","connotations","nuances","hints","harmonics"],"phonetic":"/ˈoʊvərtoʊnz/","extraExplanation":["“overtones”在日常语境里最常见的是“暗含意义/言外之意”，接近connotation（内涵、含义）和implication（暗示）。例如：racial overtones（带有种族意味）、sexual overtones（带有性暗示）、religious overtones（带有宗教色彩）。","文学与评论写作中常用“overtones”来表达作者不直接说破的态度或主题，比如“the scene has tragic overtones”（场景带有悲剧意味），强调一种“若隐若现”的气氛。"]}
{"word":"overtongued","summary":{"en":"“Overtongued” means overly talkative or too outspoken (often with a slightly negative tone).","zh":"“overtongued”指过于健谈或太直言（常带轻微贬义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Too talkative; speaking too much, often in an outspoken or overconfident way.","zh":"（古语/文学用法）太多话的；过于直言或说得太多，常带有冒失、自以为是的语气。"},"examples":[{"en":"He was so overtongued at the meeting that he revealed details meant to stay private.","zh":"他在会上太多话了，结果把本该保密的细节说了出来。"},{"en":"The overtongued storyteller kept interrupting others to add his own opinions.","zh":"那个话太多的讲述者总是打断别人，插入自己的看法。"}]}],"synonyms":["talkative","overly outspoken","loquacious","glib","garrulous"],"phonetic":"ˌoʊvɚˈtʌŋd","extraExplanation":["“overtongued”多见于较旧的英语或文学语境，含有“舌头太勤/话太多”的形象比喻，语气通常不太褒义。","也常写作“o’er-tongued / o’ertongued”（诗歌或戏剧中把 over 缩写为 o’er），读起来更有古典、戏剧化的感觉。"]}
{"word":"overtook","summary":{"en":"“Overtook” means “passed/caught up with” or “was suddenly affected by,” and it is the past tense of “overtake.”","zh":"“overtook”是“overtake”的过去式，既可表示“追上并超过”，也可表示（情绪、风暴等）“突然袭来/影响到”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense of “overtake”: to pass someone or something that is moving in the same direction; to catch up and go ahead.","zh":"“overtake”的过去式：超过（同方向行进的人或物）；追上并超越。"},"examples":[{"en":"The car behind us overtook us on the highway.","zh":"后面的车在高速公路上超过了我们。"},{"en":"She ran faster and overtook the leader near the finish line.","zh":"她跑得更快，在终点线附近追上并超越了领跑者。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense of “overtake”: to happen to someone suddenly and strongly (often used with feelings, events, or problems).","zh":"“overtake”的过去式：突然强烈地影响/袭来（常用于情绪、事件或麻烦）。"},"examples":[{"en":"A sudden fear overtook him in the dark.","zh":"在黑暗中，一阵突如其来的恐惧袭上心头。"},{"en":"The storm overtook the hikers before they reached the cabin.","zh":"徒步者还没到小屋，暴风雨就突然袭来。"}]}],"synonyms":["passed","caught up with","surpassed","overcame","engulfed"],"phonetic":"/ˌoʊvərˈtʊk/","extraExplanation":["“overtook”是动词“overtake”的不规则过去式（overtake → overtook → overtaken）。常见搭配：overtook someone on the road（在路上超车）、be overtaken by fear/sleep（被恐惧/困意突然“席卷”）。","在交通语境里更偏“超过”；在文学或叙述语境里常用来写情绪或灾祸“突然降临”，带有更强的画面感。"]}
{"word":"overtop","summary":{"en":"Overtop means to rise above something in height, or to surpass it in degree or achievement.","zh":"Overtop 表示在高度上高出、耸立于……之上，也可引申为在程度或成就上超过、胜过。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be higher or taller than something; to rise above it","zh":"高出或超过（某物）的高度；耸立在……之上"},"examples":[{"en":"Tall pines overtop the cabin and block much of the afternoon sun.","zh":"高大的松树高出小木屋，挡住了午后的大部分阳光。"},{"en":"The castle walls were overtopped by the surrounding hills.","zh":"城堡的城墙被周围的山丘“压”得显得更矮。"}]},{"partOfSpeech":"v.","definition":{"en":"to surpass or outdo someone or something (in size, level, or achievement)","zh":"超过；胜过（在规模、水平或成就上）"},"examples":[{"en":"Her second novel overtopped her first in popularity.","zh":"她的第二部小说在人气上超过了第一部。"},{"en":"The new model overtops the old one in speed and battery life.","zh":"新款在速度和续航方面胜过旧款。"}]}],"synonyms":["tower over","rise above","surpass","outdo","exceed"],"phonetic":"/ˌoʊvərˈtɑp/","extraExplanation":["“overtop”常写作一个词，偏书面；日常口语里更常用“tower over / rise above / surpass”。","不要和形容词“over-the-top”（夸张的、过火的）混淆：那是另一种常见表达，通常带连字符。"]}
{"word":"overtopped","summary":{"en":"Overtopped means “was higher than” or “surpassed” something (past form of overtop).","zh":"Overtopped 表示“高出/耸立于……之上”或“超过/胜过”（overtop 的过去式/过去分词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of overtop) to be higher than something; to rise above and tower over it.","zh":"（overtop 的过去式/过去分词）高出某物；耸立在……之上。"},"examples":[{"en":"The castle was overtopped by the mountains behind it.","zh":"城堡被身后的群山远远高出。"},{"en":"Tall trees overtopped the small houses along the road.","zh":"高大的树木高过路边的小房子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of overtop) to exceed or surpass something (often in a figurative sense).","zh":"（overtop 的过去式/过去分词）超过；胜过（常用于比喻）。"},"examples":[{"en":"Her later achievements overtopped her early success.","zh":"她后来的成就超过了早期的成功。"},{"en":"The noise from the crowd overtopped the music.","zh":"人群的喧闹声盖过了音乐。"}]}],"synonyms":["towered over","rose above","surpassed","outdid","exceeded"],"phonetic":"/ˌoʊvərˈtɑpt/","extraExplanation":["“overtop”在书面语里更常见，带有一种“高高在上、压过”的画面感；口语中表示“比……高”常用“be taller/higher than”，表示“超过/胜过”常用“surpass/outdo”。","在自然或地理描写中（山、树、建筑），“overtopped”很常用；在抽象语境中也可用来强调“强到压过/盖过”（如声音、名气、成就）。"]}
{"word":"overtopping","summary":{"en":"Overtopping means rising above or exceeding the top of something; in engineering it can also mean water flowing over a barrier like a seawall or levee.","zh":"Overtopping 指“高于/超过……的顶端”；在工程语境中也可指水（海浪/洪水）越过海堤或堤坝等屏障顶部的“越顶溢流”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Higher than, taller than, or rising above something else; dominating in height or prominence.","zh":"（形容词）高于……的；比……更高的；在高度或显著性上凌驾于……的。"},"examples":[{"en":"Snowy peaks formed an overtopping wall behind the village.","zh":"白雪覆盖的山峰在村庄后面形成了一道高耸的“墙”。"},{"en":"An overtopping skyscraper can make older buildings look small.","zh":"一栋高耸入云的摩天大楼会让老建筑显得很渺小。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) The present participle of “overtop”: going above the top of something; surpassing or exceeding it.","zh":"（动词）“overtop”的现在分词：越过……的顶端；超过；胜过。"},"examples":[{"en":"The floodwater was overtopping the riverbank after hours of heavy rain.","zh":"连续数小时暴雨后，洪水正在漫过河岸。"},{"en":"The tower was overtopping the surrounding trees.","zh":"那座塔高出周围的树木。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) (Engineering) Water flowing over the top of a structure such as a seawall, levee, or dam.","zh":"（名词）（工程）“越顶溢流/越顶”：海堤、堤坝或大坝等结构顶部被水漫过并流到背后的现象。"},"examples":[{"en":"The report warns that wave overtopping could damage the road behind the seawall.","zh":"报告警告说，海浪越顶可能会破坏海堤后方的道路。"},{"en":"Engineers designed the levee to reduce overtopping during storms.","zh":"工程师设计这段堤防以减少风暴期间的越顶现象。"}]}],"synonyms":["towering","looming","surpassing","exceeding","overrunning"],"phonetic":"/ˌoʊvɚˈtɑpɪŋ/","extraExplanation":["在日常英语里，overtopping 常用于描述“在高度上压过/高过”的视觉效果；在防洪与海岸工程语境中，它更常指“（海浪或洪水）越过堤顶”的专业现象，常与 wave overtopping（海浪越顶）一起出现。"]}
{"word":"overtopple","summary":{"en":"“Overtopple” means to make something fall over, or to fall over itself.","zh":"“overtopple”表示“把某物推倒/使倾倒”，也可表示“自己翻倒/倾覆”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause something to fall over; to knock something down from an upright position","zh":"使（某物）倾倒；推倒（直立的东西）"},"examples":[{"en":"The strong wind overtoppled several trees along the road.","zh":"强风把路边的几棵树刮倒了。"},{"en":"The protesters tried to overtopple the statue, but it was too heavy.","zh":"抗议者试图推倒雕像，但它太重了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to fall over; to tip and collapse","zh":"（自己）翻倒；倾覆；倒下"},"examples":[{"en":"The ladder overtoppled when he stepped on the top rung.","zh":"他踩上最上面的横档时，梯子翻倒了。"},{"en":"The boat overtoppled in the rough water.","zh":"小船在汹涌的水中倾覆了。"}]}],"synonyms":["topple","tip over","knock over","overturn","capsize"],"phonetic":"/ˌoʊvɚˈtɑpəl/","extraExplanation":["“overtopple”由 over-（过度、向外/向下）+ topple（倾倒）组成，语气上比单独的“topple”更强调“翻过去、彻底倒下”的感觉。","日常英语里更常用的是 “topple (over)” 或 “knock over”；“overtopple”相对少见，常出现在较正式或描写性较强的语境中。"]}
{"word":"overtops","summary":{"en":"Overtops means “is higher than” or “surpasses.”","zh":"overtops 表示“高于/高过”或“超过/超越”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be higher than something; to rise above and seem to tower over it","zh":"高于；高过并显得“高耸在……之上”"},"examples":[{"en":"The old castle overtops the village from the hill.","zh":"那座古堡在山上高高耸立，俯瞰着村庄。"},{"en":"Tall trees overtop the fence and shade the yard.","zh":"高树超过了围栏，给院子带来阴凉。"}]},{"partOfSpeech":"v.","definition":{"en":"to exceed or surpass (a limit, level, or achievement)","zh":"超过；超越（限度、水平或成就）"},"examples":[{"en":"This year’s sales overtops last year’s total.","zh":"今年的销售额超过了去年的总额。"},{"en":"Her enthusiasm overtops everyone else’s in the team.","zh":"在团队里，她的热情超过了其他所有人。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to cover or flow over the top of something","zh":"（较少用）漫过顶部；覆盖到上面去"},"examples":[{"en":"After the storm, the river overtops the banks in some areas.","zh":"暴风雨后，河水在一些地方漫过了河岸。"}]}],"synonyms":["tower over","rise above","surpass","exceed","top"],"phonetic":"ˌoʊvərˈtɑp","extraExplanation":["“overtops”是动词“overtop”的第三人称单数（he/she/it overtops）。在描述高度时很常见；用于“超过（指标）”时语气比“exceed”更形象，带有“压过一头”的感觉。"]}
{"word":"overtorture","summary":{"en":"“Overtorture” is a rare, nonstandard word meaning excessive torture or to torture excessively.","zh":"“overtorture”是罕见且非标准的用法，表示“过度酷刑/过度折磨”，或“过度折磨（某人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) excessive or repeated torture; torture taken “too far.”","zh":"（罕见/非标准用法）过度的折磨；把酷刑/折磨“做过头”。"},"examples":[{"en":"The report condemned the overtorture of detainees during the conflict.","zh":"报告谴责在冲突期间对被拘留者施加过度酷刑。"},{"en":"Even harsh training can feel like overtorture if there’s no rest or care.","zh":"即使是严格训练，如果没有休息和照顾，也会让人觉得像过度折磨。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare / nonstandard) to torture excessively; to inflict more pain or pressure than is necessary or acceptable.","zh":"（罕见/非标准用法）过度折磨；施加超过必要或可接受程度的痛苦/压力。"},"examples":[{"en":"They were accused of overtorturing prisoners to force confessions.","zh":"他们被指控为逼供而对囚犯施加过度酷刑。"},{"en":"Don’t overtorture the topic—ask a few clear questions and stop.","zh":"别把这个话题逼得太紧——问几个清晰的问题就停。"}]}],"synonyms":["excessive torture","torture excessively","brutalize","abuse","ill-treat"],"phonetic":"/ˌoʊvərˈtɔrtʃər/","extraExplanation":["“overtorture”并不是常见的标准英语词，更像是由 over-（过度）+ torture（折磨/酷刑）临时拼出的表达。在正式写作里，更自然的说法通常是：excessive torture（过度酷刑）、torture excessively（过度折磨）、overuse coercion（过度使用胁迫）等。","也有人会把它误写成 **overture**（序曲；提议/主动示好）。如果你原本想写“overture”，告诉我你的句子语境，我可以帮你改得更地道。"]}
{"word":"overtortured","summary":{"en":"“Overtortured” means overly strained or unnaturally complicated, especially in writing or reasoning.","zh":"“overtortured”指表达或逻辑过度牵强、复杂而不自然，常用于批评写作或论证。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively tortured or strained; made too complicated, intense, or unnatural (often said about writing, reasoning, style, or a person’s emotions).","zh":"过度“拧巴/牵强/折磨”的；过分复杂、用力过猛或不自然的（常用于形容写作、论证、风格或情绪）。"},"examples":[{"en":"The essay’s logic felt overtortured, with too many twists to prove a simple point.","zh":"这篇文章的逻辑显得过于牵强，为了证明一个简单观点硬拐了太多弯。"},{"en":"Critics said the dialogue was overtortured and didn’t sound like real conversation.","zh":"评论者说对白过度做作，听起来不像真实对话。"},{"en":"After the argument, his apology sounded overtortured rather than sincere.","zh":"争吵之后，他的道歉听起来用力过猛，反而不真诚。"}]}],"synonyms":["overwrought","strained","tortured","convoluted","forced"],"phonetic":"/ˌoʊvərˈtɔrtʃɚd/","extraExplanation":["“overtortured”不是非常常见的标准词，更常见的表达是 *overwrought*（过度煽情/用力过猛）、*strained*（牵强的）、*tortured*（别扭的/生硬的，常指推理或措辞）。在书评、影评或写作反馈里用它，通常是在批评某段表达“为了深刻而深刻”。"]}
{"word":"overtorturing","summary":{"en":"“Overtorturing” means torturing excessively (rare word), and can also be used figuratively for making something unnecessarily painful or intense.","zh":"“overtorturing”指“过度折磨/过分施虐”（较少见的词），也可作比喻，指把事情弄得过于痛苦或紧张。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"torturing someone too much or for too long; using excessive cruelty (present participle/gerund of “overtorture,” a rare form).","zh":"过度折磨；过分或过久地施以残酷折磨（“overtorture”的现在分词/动名词形式，但此词很少见）。"},"examples":[{"en":"The report accused the guards of overtorturing prisoners during interrogations.","zh":"报告指控狱警在审讯过程中对囚犯进行过度折磨。"},{"en":"Any form of overtorturing is a serious human-rights abuse.","zh":"任何形式的过度折磨都是严重的人权侵害。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) making something unnecessarily painful, intense, or complicated; pushing an issue so hard that it feels like “torture.”","zh":"（比喻）把事情弄得过于痛苦、紧张或复杂；把问题逼得太狠，令人觉得像“受折磨”。"},"examples":[{"en":"We’re overtorturing the debate—let’s simplify the plan.","zh":"我们把讨论搞得太折磨人了——把方案简化一下吧。"},{"en":"Stop overtorturing yourself over one small mistake.","zh":"别因为一个小错误就一直过度自责折磨自己。"}]}],"synonyms":["torturing excessively","over-torturing","abusing","maltreating","tormenting","overdoing (figurative)","making it harder than necessary (figurative)"],"phonetic":"/ˌoʊvɚˈtɔrtʃɚɪŋ/","extraExplanation":["“overtorturing”在现代英语里非常不常见，通常会写成带连字符的“over-torturing”，或改用更自然的表达：torturing excessively / subjecting someone to excessive torture。","由于“torture/折磨”涉及暴力与创伤话题，在正式写作中建议用更明确、客观的词（如 “abuse / mistreatment / cruel treatment”）来描述具体行为，避免夸张或误用。"]}
{"word":"overtower","summary":{"en":"Overtower means to rise far above something physically, or to greatly surpass it in importance or power.","zh":"overtower 指在高度上远高于某物，也可比喻在重要性或力量上远远超过。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be much taller or higher than something else; to rise above and dominate a view","zh":"（在高度上）远高于；高耸在……之上"},"examples":[{"en":"The cathedral overtowers the small houses around it.","zh":"这座大教堂高耸在周围的小房子之上。"},{"en":"Snowy peaks overtower the valley, making the town feel tiny.","zh":"雪山高耸在山谷之上，让小镇显得很渺小。"}]},{"partOfSpeech":"v.","definition":{"en":"to surpass someone or something greatly in importance, power, or influence (figurative)","zh":"（比喻）在重要性、力量或影响力上远远超过；压倒"},"examples":[{"en":"Her achievements overtower those of her rivals.","zh":"她的成就远远超过竞争对手。"},{"en":"In the debate, his confidence seemed to overtower everyone else’s.","zh":"在辩论中，他的自信似乎压过了其他所有人。"}]}],"synonyms":["tower over","loom over","dominate","surpass","overshadow"],"phonetic":"/ˌoʊvərˈtaʊər/","extraExplanation":["“overtower”比“tower over”更偏书面、文学化，日常英语里更常说“tower over”。既可作字面“高于”，也常用于比喻“在某方面压倒性地胜过”。"]}
{"word":"overtrace","summary":{"en":"Overtrace means to trace something too heavily or to retrace steps more than necessary.","zh":"overtrace 指“过度描线/描摹”，或“过度回溯、重复追查”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trace (lines, shapes, or text) too much or too heavily, often making the result messy, inaccurate, or hard to read","zh":"过度描摹/描线（把线条、形状或文字描得太多或太重），常导致画面杂乱、不准确或难以辨认"},"examples":[{"en":"If you overtrace the letters, they can turn into thick blobs.","zh":"如果你把字母过度描线，它们可能会变成一团很厚的墨块。"},{"en":"Try to trace lightly—don’t overtrace the outline.","zh":"尽量轻轻描线——不要把轮廓描得过重。"}]},{"partOfSpeech":"v.","definition":{"en":"to go over a path, steps, or evidence again and again when tracking something, especially more than necessary","zh":"（追踪时）反复走回头路/反复复查线索（次数过多，超出需要）"},"examples":[{"en":"The team overtraced the same route and lost valuable time.","zh":"团队反复走同一条路线，浪费了宝贵时间。"},{"en":"We kept overtracing old leads instead of finding new ones.","zh":"我们一直在反复查旧线索，而不是寻找新的方向。"}]}],"synonyms":["trace too heavily","retrace repeatedly","go over again","overdo tracing"],"phonetic":"/ˌoʊvərˈtreɪs/","extraExplanation":["“over-”常表示“过度、超过需要”（如 overwork 过度工作，overthink 想太多）。因此 overtrace 往往带有“做过头了”的语气。","在绘画/设计语境里，overtrace 常指描线太重、重复太多；在调查/追踪语境里，则更接近“反复回溯、重复追查”。这个词不算高频，日常更常用的说法有 trace too heavily / go over the same steps again。"]}
{"word":"overtrack","summary":{"en":"Overtrack usually describes how long vehicles swing wide in turns; more generally, it can mean tracking something too far.","zh":"Overtrack常指大型车辆转弯时后部外甩、后轮轨迹走外圈；也可泛指追踪过度、跟过头。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a vehicle, especially a long truck or trailer) to travel in a turn so the rear wheels follow a different—often wider—path than the front wheels; to swing wide in a corner.","zh":"（尤指长卡车或拖车）转弯时车辆后轮走的轨迹与前轮不同（常更靠外）；（转弯时）后部外甩、走外圈。"},"examples":[{"en":"The bus overtracked on the tight corner and nearly clipped the curb.","zh":"那辆公交车在急弯处后部外甩，差点擦到路缘。"},{"en":"Watch the trailer—it can overtrack when you turn right.","zh":"注意拖车——你右转时它可能会外甩走外圈。"}]},{"partOfSpeech":"v.","definition":{"en":"To follow or record a path or movement too far/too long, going beyond what was intended (less common).","zh":"（不常用）对路线/运动的追踪或记录过度，超出预期范围。"},"examples":[{"en":"The camera overtracked and kept following the actor after the scene ended.","zh":"镜头追得太过头，戏都结束了还在跟着演员。"},{"en":"If the system overtracks, it may store more location data than necessary.","zh":"如果系统追踪过度，可能会存下不必要的定位数据。"}]}],"synonyms":["swing wide","off-track (vehicle turning)","overfollow","track too far"],"phonetic":"/ˌoʊvərˈtræk/","extraExplanation":["“overtrack”在交通与工程语境里常用来描述大型车辆转弯时的“后轮外甩/轨迹偏离”。很多驾驶培训会提醒：转弯要预留空间、注意车尾与拖车的摆动路径。","在某些行业（如摄影、监控、导航记录）里也可借用“track（跟踪）”的意思，表示“跟过头、追太多”，但这一用法更口语化、也较少见。"]}
{"word":"overtrade","summary":{"en":"Overtrade means to trade or expand too much—often so much that it hurts performance or finances.","zh":"Overtrade 指“过度交易/过度扩张”，做得太多反而损害收益或财务状况。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(In investing/business) to buy and sell too much or too often, usually leading to higher costs, more risk, or worse results.","zh":"（投资/商业中）过度交易；买卖过于频繁，通常会带来更高成本、更大风险或更差的结果。"},"examples":[{"en":"Many new investors overtrade because they react to every small price change.","zh":"很多新投资者会过度交易，因为他们对每一次小的价格波动都做出反应。"},{"en":"If you overtrade, fees and taxes can quickly reduce your profit.","zh":"如果你过度交易，手续费和税费会很快侵蚀你的利润。"},{"en":"The coach told him not to overtrade the market and to stick to his plan.","zh":"教练告诉他别在市场里过度交易，要坚持自己的计划。"}]},{"partOfSpeech":"v.","definition":{"en":"(A company) to expand or sell too much on credit so that it becomes financially stressed or unable to pay its debts.","zh":"（公司）过度扩张或过度赊销，导致资金紧张甚至无力偿债。"},"examples":[{"en":"The small retailer overtraded by opening three new stores at once.","zh":"这家小零售商一次性开了三家新店，属于过度扩张。"},{"en":"Some businesses overtrade during the holiday season and then struggle to pay suppliers.","zh":"有些企业在假日季过度赊销/过度经营，之后就难以支付供应商货款。"}]}],"synonyms":["trade too much","overtrading","overextend","overdo"],"phonetic":"/ˌoʊvɚˈtreɪd/","extraExplanation":["“over-”表示“过度”，所以 overtrade 字面意思就是“交易/经营得过头”。在金融语境里最常见的是指“交易太频繁”（常被批评为情绪化操作、追涨杀跌），在商业管理语境里也可指“扩张太快导致现金流吃紧”。","常见搭配：overtrade the market（在市场里过度交易）, overtrade on credit（过度赊销/靠信用扩张）, risk of overtrading（过度交易风险）。","相关词：overtrading（n. 过度交易/过度经营），trade (v./n. 交易；经营)，overextend（过度扩张/透支）。"]}
{"word":"overtraded","summary":{"en":"Overtraded means trading or expanding beyond safe limits, often causing cash or resource strain; it can also describe a market or asset being traded excessively.","zh":"Overtraded 指交易或扩张超过安全承受范围，常导致资金或资源紧张；也可指某个市场/资产被过度频繁交易。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Business/finance) Having traded more than is safe or sustainable, often leading to a shortage of cash or resources.","zh":"（商业/金融）交易或进货过度，超过了安全或可持续的程度，常导致资金或资源紧张。"},"examples":[{"en":"The company was overtraded and couldn’t pay suppliers on time.","zh":"这家公司经营过度（周转失衡），无法按时支付供应商货款。"},{"en":"They expanded too fast and became overtraded within a year.","zh":"他们扩张太快，一年内就出现了过度经营、资金周转吃紧的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Markets) Traded excessively or too frequently, sometimes causing prices to move in unstable or uninformative ways.","zh":"（市场）被过度交易的；交易过于频繁的，有时会导致价格波动不稳或失真。"},"examples":[{"en":"Some analysts warned the stock was overtraded after the news spike.","zh":"一些分析师警告说，该股在消息刺激后出现过度交易。"},{"en":"In a highly overtraded market, short-term signals can be noisy.","zh":"在一个被过度交易的市场里，短期信号可能很“吵”、不可靠。"}]}],"synonyms":["overextended","overcommitted","overleveraged","excessively traded"],"phonetic":"ˌoʊvərˈtreɪdɪd","extraExplanation":["“overtraded”常见于英式商业语境，尤其指企业“接了太多订单/进了太多货/扩张太快”，结果需要的营运资金（working capital）超过手头现金与信用额度，出现流动性压力。","它强调的是“能力或资金承受不了的交易规模”，不等同于“生意好”（sales high）；生意很好也可能因为回款慢、库存大而overtraded。","相关名词：overtrading（过度经营/过度交易）；相关表达：cash-flow problems（现金流问题）、working capital shortage（营运资金短缺）。"]}
{"word":"overtrader","summary":{"en":"An overtrader is someone who trades too much or too often, usually in a risky, unproductive way.","zh":"overtrader 指交易过度、过于频繁（通常风险偏高且收益不佳）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who trades (especially stocks, crypto, or other financial products) too frequently or in amounts that are too large, often taking excessive risk and/or paying too much in fees.","zh":"过度交易者（尤指在股票、加密货币等金融市场中交易过于频繁或仓位过大的人），常伴随过度冒险和/或手续费成本过高。"},"examples":[{"en":"He became an overtrader during the market boom, buying and selling several times a day.","zh":"在市场繁荣期他成了过度交易者，一天内买卖好几次。"},{"en":"Overtraders often underestimate how much commissions and spreads can hurt returns.","zh":"过度交易者常常低估手续费和点差对收益的伤害。"},{"en":"She realized she was an overtrader when her portfolio barely grew but her transaction history was huge.","zh":"当她发现账户几乎没增长但交易记录却非常夸张时，她意识到自己在过度交易。"}]}],"synonyms":["excessive trader","compulsive trader","hyperactive trader","frequent trader"],"phonetic":"/ˌoʊvərˈtreɪdər/","extraExplanation":["“overtrader”常用于金融语境，带有批评或警示意味：频繁交易容易导致情绪化决策（追涨杀跌）、忽视长期策略，并让交易成本（佣金、点差、税费）侵蚀收益。","在英语里它由前缀“over-”（过度）+“trader”（交易者）构成；相关表达包括“overtrade”（过度交易，动词/名词）和“overtrading”（过度交易，名词）。"]}
{"word":"overtrading","summary":{"en":"Overtrading means trading too much or too often (especially in finance), or expanding business sales/orders beyond what a company can safely fund and manage.","zh":"Overtrading 指（尤其在金融中）过度交易、交易过于频繁；也可指企业扩张或接单过快，超出资金与管理承受能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of trading too much or too often, especially in finance, so that costs and risks become higher than the benefits","zh":"过度交易；（尤指金融市场中）交易过于频繁或过量，导致成本与风险超过收益"},"examples":[{"en":"Overtrading can quietly drain your returns through fees and taxes.","zh":"过度交易会通过手续费和税费悄悄侵蚀你的收益。"},{"en":"His overtrading came from trying to win back losses too quickly.","zh":"他的过度交易源于想太快把亏损赚回来。"}]},{"partOfSpeech":"n.","definition":{"en":"in business, the situation of having more sales or orders than a company can safely finance or manage","zh":"（商业）超出承受能力的经营扩张；订单/销售增长过快，导致资金周转或管理承压"},"examples":[{"en":"The small company collapsed after a period of overtrading and cash-flow problems.","zh":"这家小公司在一段时间的超负荷经营和现金流问题后倒闭了。"},{"en":"Rapid growth is exciting, but overtrading can leave you unable to pay suppliers on time.","zh":"快速增长令人兴奋，但超负荷经营可能让你无法按时支付供应商款项。"}]}],"synonyms":["excessive trading","overinvestment","overexpansion","overextension"],"phonetic":"/ˌoʊvərˈtreɪdɪŋ/","extraExplanation":["在金融语境里，overtrading 常与“追涨杀跌”“频繁进出”“情绪化交易”联系在一起；核心问题通常不是“方向不对”，而是交易次数太多带来的摩擦成本（手续费、点差、税）和风险暴露增加。","在英式商业用法中，overtrading 不一定指“交易频繁”，而更强调“扩张过快、资金跟不上”（例如库存、应收账款增加导致现金流吃紧）。阅读财经文章时要根据上下文判断是哪一种含义。","相关常见搭配：overtrading risk（过度交易风险）、avoid overtrading（避免过度交易）、overtrading and leverage（过度交易与杠杆）。"]}
{"word":"overtrailed","summary":{"en":"Overtrailed means “draped or covered over by something that trails,” and it’s a rare, literary word.","zh":"overtrailed 指“被下垂蔓延之物披挂或覆盖”，属于较少见的文学用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Covered or draped over with something that hangs or trails down (such as vines, hair, or fabric).","zh":"（文学用语）被下垂、蔓延的东西覆盖或披挂着（如藤蔓、头发或布料）。"},"examples":[{"en":"The old stone gate was overtrailed with ivy.","zh":"那座古老的石门上垂挂着常春藤。"},{"en":"Her shoulders were overtrailed with long, dark hair.","zh":"她的肩头披垂着又长又黑的头发。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of overtrail: to hang or trail over; to cover by trailing over.","zh":"overtrail 的过去式/过去分词：垂落在……之上；以蔓延下垂的方式覆盖。"},"examples":[{"en":"Vines had overtrailed the fence by midsummer.","zh":"到仲夏时，藤蔓已经垂覆在篱笆上了。"},{"en":"A thin curtain overtrailed the window frame.","zh":"一层薄纱帘垂覆在窗框上。"}]}],"synonyms":["draped","covered","overgrown","festooned"],"phonetic":"ˌoʊvɚˈtreɪld","extraExplanation":["“overtrailed”比较少见，更常见的表达是“covered with / draped with / overgrown with”（被……覆盖/披着/长满……）。","它常出现在描写自然景物或氛围的文学语境中，用来营造“垂挂、蔓生、柔和覆盖”的画面感。"]}
{"word":"overtrain","summary":{"en":"Overtrain means training too much so recovery can’t keep up, which may reduce performance or cause injury.","zh":"overtrain 指训练过度、恢复跟不上，可能导致表现下降或受伤。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to train or exercise too much, so your body doesn’t have enough time to recover","zh":"训练过度；运动量过大，导致身体没有足够时间恢复"},"examples":[{"en":"If you overtrain, your performance can actually get worse.","zh":"如果你训练过度，成绩反而可能变差。"},{"en":"She started overtraining for the marathon and felt tired all the time.","zh":"她为马拉松训练过度，结果总是觉得很疲惫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to push someone (or yourself) to train too hard, leading to fatigue or injury","zh":"使（某人/自己）训练过度；把训练强度推得太高，导致疲劳或受伤"},"examples":[{"en":"The coach didn’t mean to overtrain the team, but the schedule was intense.","zh":"教练并非想让队员训练过度，但训练安排确实很密集。"},{"en":"Don’t overtrain your shoulders—give them a rest day.","zh":"别把肩部练过量——给它们一天休息。"}]}],"synonyms":["overdo it","push too hard","train too much","overexert (oneself)"],"phonetic":"/ˌoʊvɚˈtreɪn/","extraExplanation":["在健身语境里，overtrain 常和“恢复不足”一起出现。长期 overtrain 可能发展为“过度训练综合征（overtraining syndrome）”，常见信号包括：持续疲劳、睡眠变差、情绪易怒、心率异常、训练表现下降、反复小伤或生病。","常见搭配：overtrain + for (a race/competition)；overtrain + a muscle group；avoid overtraining（避免过度训练）；signs of overtraining（过度训练的迹象）。","相关词：overtraining（名词，过度训练/训练过度状态）。日常更常说：train too much / push too hard。"]}
{"word":"overtrained","summary":{"en":"Overtrained means trained too much, causing tiredness, injury risk, or worse performance.","zh":"Overtrained 指训练过度，可能带来疲劳、伤病风险增加或表现下降。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"trained too much (especially for sports), so performance, energy, or health gets worse instead of better.","zh":"（尤指运动）训练过度，导致表现、精力或健康不升反降。"},"examples":[{"en":"I felt overtrained after two weeks of intense workouts with no rest days.","zh":"连续两周高强度训练又不休息后，我感觉自己训练过度了。"},{"en":"If you’re overtrained, you may run slower even though you’re practicing more.","zh":"如果你训练过度，哪怕练得更多，跑步也可能变慢。"},{"en":"The coach reduced her schedule because she looked overtrained and exhausted.","zh":"教练减少了她的训练量，因为她看起来训练过度、很疲惫。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “overtrain”; to train someone or yourself too much.","zh":"“overtrain”的过去式/过去分词；（使自己或他人）训练过度。"},"examples":[{"en":"He overtrained for the marathon and got injured before race day.","zh":"他为马拉松训练过度，在比赛前就受伤了。"},{"en":"They overtrained the young athletes, and several needed time off.","zh":"他们让年轻运动员训练过度，结果好几个人需要休息。"}]}],"synonyms":["overworked","burned out","overexerted","overtrained (as a verb: overtrained = trained too much)"],"phonetic":"/ˌoʊvərˈtreɪnd/","extraExplanation":["在运动语境中，overtrained 常与 overtraining（过度训练）/ overtraining syndrome（过度训练综合征）相关。常见信号包括持续疲劳、睡眠变差、心情低落、食欲变化、伤病频发、成绩停滞或下降。日常表达里也常说 “I’m overtraining.” 来强调当下状态。"]}
{"word":"overtraining","summary":{"en":"Overtraining means learning or training too much: in ML it causes poor generalization; in sports it causes fatigue and possible injury.","zh":"overtraining 指“训练过头”：在机器学习中会导致泛化变差；在运动中会导致疲劳甚至受伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Machine learning) When a model learns the training data too closely (including noise), so it performs well on training data but poorly on new/unseen data.","zh":"（机器学习）模型把训练数据学得“太死”（连噪声也记住），导致训练集表现很好，但在新数据/未见数据上表现变差。"},"examples":[{"en":"The model’s accuracy on the training set is 99%, but it drops on the test set—this is a sign of overtraining.","zh":"模型在训练集上准确率有99%，但在测试集上下降——这就是过度训练的迹象。"},{"en":"We used regularization and early stopping to reduce overtraining.","zh":"我们用了正则化和提前停止来减少过度训练。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports/fitness) Training too much or too intensely without enough rest, which can lead to fatigue, poor performance, or injury.","zh":"（运动/健身）训练量或强度过大且休息不足，导致疲劳、表现下降或受伤。"},"examples":[{"en":"Overtraining can make you feel tired all day and hurt your progress.","zh":"过度训练会让你整天疲惫，还会影响进步。"},{"en":"He took a rest week to recover from overtraining.","zh":"他休息了一周来从过度训练中恢复。"}]}],"synonyms":["overfitting","overtraining syndrome","excessive training"],"phonetic":"/ˌoʊvərˈtreɪnɪŋ/","extraExplanation":["在机器学习里，overtraining 常与 overfitting（过拟合）几乎同义；很多人更常说 overfitting。常见缓解方法包括：增加数据、数据增强、正则化（如 L2、dropout）、减少模型复杂度、交叉验证、以及 early stopping（提前停止）。","在运动语境中，overtraining 有时也会被更具体地称为 overtraining syndrome（过度训练综合征），强调长期恢复不佳、睡眠变差、心率异常、情绪波动等更系统性的症状。"]}
{"word":"overtrains","summary":{"en":"“Overtrains” means trains too much, leading to poor recovery and often worse performance.","zh":"“overtrains” 指训练过度，导致恢复不良，常使表现变差。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person) to train or exercise too much, so performance worsens or the body doesn’t recover well.","zh":"（指人）训练/运动过度，导致表现下降或身体恢复不良。"},"examples":[{"en":"If she overtrains, she feels tired all day and her pace gets slower.","zh":"如果她训练过度，就会整天很累，配速也会变慢。"},{"en":"He often overtrains before races and ends up getting sick.","zh":"他经常在比赛前训练过度，结果反而生病。"}]},{"partOfSpeech":"vt.","definition":{"en":"to train someone (or a body part) too much, causing fatigue or injury.","zh":"使（某人或某个身体部位）训练过度，导致疲劳或受伤。"},"examples":[{"en":"The plan overtrains beginners by adding too many hard workouts too soon.","zh":"这个计划太快加入太多高强度训练，会让初学者训练过度。"},{"en":"Doing heavy squats every day can overtrain your legs.","zh":"每天都做大重量深蹲可能会让腿部训练过度。"}]}],"synonyms":["overexercise","train too hard","push too hard","overdo it"],"phonetic":"/ˌoʊvərˈtreɪnz/","extraExplanation":["“overtrains” 是动词 “overtrain” 的第三人称单数（he/she/it overtrains）。常见搭配：overtrain for a marathon（为马拉松训练过度）、overtrain in the gym（在健身房练过头）。","在运动语境里，训练过度常与恢复不足有关：睡眠、营养、轻松日（rest/easy days）不够，容易出现长期疲劳、动力下降、受伤风险上升。"]}
{"word":"overtrample","summary":{"en":"Overtrample means to trample excessively—literally by stepping on something too much, or figuratively by being overly harsh and disrespectful.","zh":"Overtrample 指“过度践踏”，既可指字面上的踩踏过度造成损坏，也可比喻过分强压、无视他人的权利或感受。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trample too much or too hard; to crush or damage something by stepping on it repeatedly or excessively","zh":"过度踩踏；反复或用力过猛地践踏，导致压坏或损伤"},"examples":[{"en":"Too many visitors can overtrample the grass and kill it.","zh":"游客太多会过度踩踏草坪，把草踩死。"},{"en":"The herd overtrampled the young plants as it moved through the field.","zh":"牛群穿过田地时过度踩踏了幼苗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to treat someone’s rights, feelings, or ideas with excessive force or disrespect; to override or bully","zh":"（比喻）过度践踏（他人的权利、感受或观点）；强压、霸凌式地无视"},"examples":[{"en":"Good leaders disagree without overtrampling others’ opinions.","zh":"好的领导者可以不同意，但不会过度践踏他人的意见。"},{"en":"In the debate, he overtrampled her point instead of answering it.","zh":"在辩论中，他一味强压她的观点，而不是回应问题。"}]}],"synonyms":["trample","crush","stamp on","trample on","trample over","ride roughshod over"],"phonetic":"ˌoʊvərˈtræmpəl","extraExplanation":["“overtrample”不是常见词，更常见的表达是“trample (on) / trample over”或“trample on someone’s rights”。“over-”在这里表示“过度、太过”，强调程度超过合理范围。"]}
{"word":"overtravel","summary":{"en":"Overtravel is movement beyond a designed limit, especially in machines and mechanisms.","zh":"Overtravel 指（尤指机械机构的）超过设计极限的运动/行程，即“过行程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of a machine part or mechanism) movement beyond the intended or designed stopping point or limit.","zh":"（机械部件或机构）超过预定/设计停止点或极限的行程；过行程。"},"examples":[{"en":"The safety stop prevents overtravel of the elevator car.","zh":"安全止挡可以防止电梯轿厢过行程。"},{"en":"If the sensor fails, the actuator may continue moving into overtravel.","zh":"如果传感器失灵，执行器可能会继续运动并进入过行程。"},{"en":"Engineers added an extra margin to handle small amounts of overtravel.","zh":"工程师增加了额外余量来应对少量过行程。"}]},{"partOfSpeech":"v.","definition":{"en":"To move or allow something to move beyond its intended limit or travel range.","zh":"（使）超过预定极限运动；（使）发生过行程。"},"examples":[{"en":"Do not overtravel the knob, or the threads may strip.","zh":"不要把旋钮拧过头，否则螺纹可能会滑牙。"},{"en":"The operator overtraveled the platform, triggering an alarm.","zh":"操作员让平台过行程，触发了警报。"}]}],"synonyms":["excess travel","overshoot","overrun"],"phonetic":"ˈoʊvərˌtrævəl","extraExplanation":["“Overtravel”常见于工程与制造语境，比如电梯、液压/气动缸、机床、机器人轴、限位开关等。它既可以指“意外超限的行程”（风险：碰撞、损坏），也可以指某些装置故意设计的“余量行程”（例如按钮/限位开关按下后仍可再动一点点，用于保证可靠触发）。实际含义要看具体设备说明书或图纸标注。"]}
{"word":"overtread","summary":{"en":"Overtread means to step on or trample something by walking over it; it’s a rare, somewhat old-fashioned word.","zh":"Overtread 指“走过时踩踏、踏过”，较少用，带一点旧式书面语色彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to step on or trample (something) by walking over it; to tread over","zh":"踩在……上面；踏过；（走过时）踩踏"},"examples":[{"en":"In the muddy field, the soldiers overtread the young plants without noticing.","zh":"在泥泞的田地里，士兵们没注意就踩踏了幼苗。"},{"en":"Try not to overtread the wet paint near the doorway.","zh":"尽量不要踩到门口附近未干的油漆。"}]},{"partOfSpeech":"vt.","definition":{"en":"to walk too much or too often on a surface, causing wear or damage (less common)","zh":"（在某处）走得过多、踏得过频，导致磨损或损坏（较少见）"},"examples":[{"en":"If we keep using this trail in the rain, we’ll overtread it and ruin the path.","zh":"如果下雨天我们还一直走这条小路，会把路面踩坏。"}]}],"synonyms":["tread on","step on","trample","walk over"],"phonetic":"/ˌoʊvərˈtrɛd/","extraExplanation":["“overtread”在现代英语里比较少见，更多时候会用更自然的表达，如：step on、trample、tread on、walk over。","词源上可理解为 over-（在……之上）+ tread（踩、踏）。在文学或较旧的书面语中偶尔出现，用来描写“踩踏而过”的动作。"]}
{"word":"overtreading","summary":{"en":"“Overtreading” means treading/trampling too much, causing wear or damage; it can also mean the act of excessive trampling.","zh":"“overtreading”指过度踩踏、反复踩踏而造成磨损或破坏；也可指“过度踩踏”这一行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “overtread”) To tread on something too much or too heavily; to walk/step repeatedly so that it becomes worn, flattened, or damaged.","zh":"（“overtread”的现在分词/动名词）过度踩踏；反复或用力踩在某物上，导致磨损、压实或损坏。"},"examples":[{"en":"Overtreading the grass near the gate has worn a muddy path into the lawn.","zh":"大门附近的草地被过度踩踏，草坪上磨出了一条泥路。"},{"en":"The sign asked visitors to avoid overtreading the plants in the garden beds.","zh":"告示牌请游客避免过度踩踏花坛里的植物。"}]},{"partOfSpeech":"n.","definition":{"en":"Excessive stepping or trampling (used as a noun, often in writing about land, farming, or ecology).","zh":"过度踩踏（名词用法，常见于土地、农业或生态语境）。"},"examples":[{"en":"Overtreading by livestock can compact the soil and reduce water absorption.","zh":"牲畜的过度踩踏会使土壤板结，降低吸水能力。"},{"en":"The park limited access to prevent overtreading of fragile dunes.","zh":"公园限制进入，以防脆弱的沙丘遭到过度踩踏。"}]}],"synonyms":["overtrampling","trampling","excessive treading","wearing down","overuse"],"phonetic":"/ˌoʊvərˈtrɛdɪŋ/","extraExplanation":["“overtread”本身很少见，更常用的表达是“trample (on) / tread on too much / overuse / cause wear and tear”。在环境保护或园艺语境里，你也会看到更常用的“overtrampling / trampling”。","拼写容易和“overreading（过度解读）”混淆：reading=阅读/解读；treading=踩踏。"]}
{"word":"overtreat","summary":{"en":"Overtreat means to treat something more than is necessary, especially medically.","zh":"Overtreat 指（尤指在医疗上）对疾病或患者进行超过必要程度的治疗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat (a person, disease, or condition) too much or more aggressively than is needed, especially in medicine","zh":"（尤指医学上）过度治疗；治疗过头"},"examples":[{"en":"Some patients are overtreating minor colds with antibiotics.","zh":"有些患者用抗生素来治小感冒，属于过度治疗。"},{"en":"The doctor warned that trying every test could lead to overtreating the problem.","zh":"医生提醒说，什么检查都做可能会导致对这个问题过度治疗。"},{"en":"This guideline aims to prevent overtreating low-risk cases.","zh":"这份指南旨在避免对低风险病例过度治疗。"}]}],"synonyms":["overmedicate","treat too aggressively","overmanage"],"phonetic":"/ˌoʊvɚˈtrit/","extraExplanation":["“overtreat”常见于医疗与公共健康讨论（如抗生素滥用、过度筛查/检查、对低风险病人使用强治疗）。它强调“治疗本身”超过必要程度，可能带来副作用、耐药性、花费增加与心理压力等。","常见搭配：overtreat a condition/patient; overtreat with antibiotics; risk of overtreatment（过度治疗的风险）。名词形式是 overtreatment。"]}
{"word":"overtreated","summary":{"en":"Overtreated means treated too much—especially medically—often more than necessary.","zh":"overtreated 指“被过度治疗/过度处理”，尤其常指医疗上做了超出需要的治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated too much, especially with medical tests or medicines, so that the treatment is unnecessary or may cause harm.","zh":"（尤指医疗上）过度治疗；做了不必要的检查或用药，可能带来副作用或伤害。"},"examples":[{"en":"Some older patients are overtreated with antibiotics for minor infections.","zh":"有些老年患者因为轻微感染而被过度使用抗生素。"},{"en":"She worried her back pain was being overtreated instead of managed with exercise and rest.","zh":"她担心自己的背痛被过度治疗，而不是通过运动和休息来管理。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated more than needed in any process (for example, with chemicals, heat, or cleaning), which can reduce quality or cause damage.","zh":"（泛指任何处理过程）处理过度（如化学处理、加热、清洁过度），从而影响质量或造成损害。"},"examples":[{"en":"The fabric felt stiff because it was overtreated during manufacturing.","zh":"这种布料摸起来很硬，因为在生产过程中处理过度了。"},{"en":"The deck boards were overtreated with sealant, so they stayed tacky for days.","zh":"露台木板涂了过多密封剂，所以好几天都黏黏的。"}]}],"synonyms":["treated excessively","overmedicated","overmanaged","handled too much"],"phonetic":"/ˌoʊvɚˈtritɪd/","extraExplanation":["“overtreated”常见于医疗语境，常与overdiagnosed（过度诊断）、unnecessary treatment（不必要治疗）、side effects（副作用）等一起出现，用来强调“更多并不一定更好”。","它来自动词 overtreat（过度治疗/过度处理）的过去分词形式；在句子里既可作形容词（an overtreated patient 过度治疗的病人），也可出现在被动语态里（was overtreated 被过度治疗）。"]}
{"word":"overtreating","summary":{"en":"“Overtreating” means giving more medical treatment than needed, sometimes causing harm.","zh":"“Overtreating”指（医疗上）给出超过必要程度的治疗，可能带来伤害。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treating a medical condition more than is necessary, or giving more treatment than is beneficial (often causing extra cost, side effects, or harm).","zh":"（医疗）过度治疗；治疗超过必要程度，可能带来额外费用、副作用或伤害。"},"examples":[{"en":"The doctor warned that overtreating mild infections can lead to antibiotic resistance.","zh":"医生警告说，过度治疗轻微感染会导致抗生素耐药。"},{"en":"Some patients worry about overtreating conditions that could improve with rest and time.","zh":"有些患者担心把本来休息和时间就能改善的情况过度治疗。"},{"en":"The study focused on overtreating older adults with multiple medications.","zh":"这项研究关注对老年人进行多药物的过度治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of giving too much medical treatment.","zh":"过度治疗的行为或做法。"},"examples":[{"en":"Overtreating is a common concern in preventive screening programs.","zh":"在预防性筛查项目中，“过度治疗”是一个常见担忧。"},{"en":"Reducing overtreating can improve patient safety and lower healthcare costs.","zh":"减少过度治疗可以提高患者安全并降低医疗成本。"}]}],"synonyms":["overmedicating","overusing treatment","treating unnecessarily","providing excessive care"],"phonetic":"/ˌoʊvɚˈtriːtɪŋ/","extraExplanation":["“overtreating”多用于医疗语境（医院、药物、手术、筛查）。它常与“overdiagnosis（过度诊断）”一起出现：先把问题诊断得过头，接着就更容易出现过度治疗。","常见搭配：overtreating with antibiotics（滥用/过度使用抗生素）、overtreating cancer（对癌症过度治疗，尤其是进展很慢的类型）、risk of overtreating（过度治疗的风险）。"]}
{"word":"overtreatment","summary":{"en":"Overtreatment means getting more medical care than you truly need, which may not help and can sometimes cause harm.","zh":"Overtreatment 指超过实际需要的医疗治疗，可能帮助不大，甚至带来伤害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"medical care that is more aggressive, frequent, or extensive than necessary, often bringing little benefit and sometimes causing harm","zh":"过度治疗；指医疗干预过于积极、频繁或超出必要范围，收益不大，甚至可能带来伤害"},"examples":[{"en":"The doctor explained that more tests might be overtreatment and could lead to unnecessary stress.","zh":"医生解释说，再做更多检查可能属于过度治疗，还可能造成不必要的压力。"},{"en":"Some patients worry about overtreatment when a condition would improve on its own.","zh":"有些患者担心，在病情本可自行好转时接受了过度治疗。"}]}],"synonyms":["excessive treatment","unnecessary treatment","overmedicalization"],"phonetic":"/ˌoʊvɚˈtriːtmənt/","extraExplanation":["“overtreatment”常见于医疗沟通与公共卫生讨论，强调“利大于弊”的平衡：治疗越多不一定越好。它常和“overdiagnosis（过度诊断）”一起出现：先被诊断出可能永远不会造成问题的异常，再被进一步治疗。","在英文语境里，谈到overtreatment时通常不是否定医生或治疗本身，而是讨论是否有必要、是否符合患者偏好，以及是否遵循循证指南（例如先观察、保守治疗或共享决策）。"]}
{"word":"overtreats","summary":{"en":"“Overtreats” means gives more treatment than necessary (especially medical), or handles a situation more than needed.","zh":"“Overtreats”指（尤其在医疗上）过度治疗；也可指对某事处理过度、做得超过必要。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a doctor or caregiver) to give more medical treatment than is necessary, often causing extra cost, side effects, or harm.","zh":"（指医生或照护者）过度治疗；给予超过必要程度的医疗处理，可能带来额外费用、副作用或伤害。"},"examples":[{"en":"The report warns that some hospitals overtreats older patients with antibiotics.","zh":"报告警告说，一些医院对老年患者滥用抗生素，属于过度治疗。"},{"en":"She worries her father’s condition is mild, but the clinic overtreats it with too many tests.","zh":"她担心父亲的情况并不严重，但诊所做了太多检查，属于过度治疗。"}]},{"partOfSpeech":"v.","definition":{"en":"to do more than is needed when dealing with a problem or situation (not only medical).","zh":"（不只限医疗）对问题处理过度；做得超过必要程度。"},"examples":[{"en":"He overtreats small mistakes like they’re a crisis.","zh":"他把小错误处理得像危机一样，反而过度了。"},{"en":"Don’t overtreats the issue—start with a simple solution first.","zh":"别把问题处理得太复杂——先从简单的办法开始。"}]}],"synonyms":["overmedicate","overprescribe","overmanage","overdo"],"phonetic":"/ˌoʊvərˈtrit/","extraExplanation":["“overtreats”是动词“overtreat”的第三人称单数现在时（he/she/it overtreats）。常见于医疗语境，搭配如：overtreat patients / overtreat a condition / overtreat with antibiotics.","医疗讨论中常与“overdiagnose（过度诊断）”“unnecessary tests（不必要的检查）”“side effects（副作用）”一起出现，强调“治疗超过必要程度”可能带来的风险。"]}
{"word":"overtrick","summary":{"en":"An overtrick is an extra trick won beyond the contract in bridge or similar card games.","zh":"overtrick 指在桥牌等牌戏中，超过定约承诺而多赢的一墩（超墩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In contract bridge and some trick-taking card games) a trick won beyond the number promised in the bid/contract.","zh":"（在定约桥牌及部分墩牌类牌戏中）超墩；指超过叫牌/定约所承诺数量而多赢的一墩。"},"examples":[{"en":"They bid 4♥ and made five, scoring one overtrick.","zh":"他们叫了4红心并赢了五墩，所以多赢了一墩超墩分。"},{"en":"An overtrick can add points, but it depends on whether the contract is doubled.","zh":"超墩可能会加分，但是否加倍会影响得分多少。"}]}],"synonyms":["extra trick"],"phonetic":"/ˈoʊvərˌtrɪk/","extraExplanation":["在桥牌计分里，“定约（contract）”规定你至少要完成的墩数；完成后多赢的那几墩就叫 overtrick。未完成定约则相反叫 undertrick（罚墩）。","常见写法为 overtrick（一个词），也有人写作 over-trick（连字符）。在桥牌记分表里有时会写成 “+1 / +2” 表示多赢一墩/两墩。"]}
{"word":"overtrim","summary":{"en":"Overtrim means to trim something too much, beyond what is needed.","zh":"overtrim 指“修剪/裁剪过度”，剪得超过需要。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trim too much; to cut or shorten something more than is needed, often causing a bad result (e.g., damage, loss of shape, reduced usefulness).","zh":"过度修剪；剪得太多（超过需要），常导致效果变差或造成损坏。"},"examples":[{"en":"If you overtrim the hedge, it may grow back unevenly.","zh":"如果你把树篱过度修剪，它可能会长得不均匀。"},{"en":"I overtrimmed my bangs, and now they’re much shorter than I wanted.","zh":"我把刘海剪过头了，现在比我想要的短很多。"},{"en":"Be careful not to overtrim the video clip, or you’ll cut out the important part.","zh":"小心别把视频片段剪太多，不然会把重要内容剪掉。"}]}],"synonyms":["trim too much","cut too short","overcut","overprune"],"phonetic":"/ˌoʊvɚˈtrɪm/","extraExplanation":["“over-”这个前缀常表示“过度、太……”（如 overcook 煮过头、overwork 过度工作）。因此 overtrim 直观意思就是“trim（修剪/裁剪）过度”。在园艺、理发以及音视频剪辑语境里都能用。"]}
{"word":"overtrimme","summary":{"en":"“Overtrim” means to trim too much (everyday use) or to adjust trim controls too much (aviation/technical use). “Overtrimme” is likely a misspelling.","zh":"“Overtrim”指“过度修剪”（日常）或“配平调过度”（航空/技术）。 “Overtrimme”很可能是拼写错误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon; likely a misspelling of “overtrim.”) To trim too much; to remove or cut off more than is needed (for example, hair, plants, fabric, or materials).","zh":"（不常见；很可能是“overtrim”的拼写错误）过度修剪；剪得太多，超过需要的程度（如头发、植物、布料或材料）。"},"examples":[{"en":"I asked for just a little off the top, but the barber overtrimmed my hair.","zh":"我只想上面稍微修一点，但理发师把我的头发剪过头了。"},{"en":"If you overtrim the hedge, it may take months to grow back evenly.","zh":"如果你把树篱修剪过度，可能要好几个月才能重新长得均匀。"}]},{"partOfSpeech":"v.","definition":{"en":"(Aviation/engineering) To adjust a trim control too much, making an aircraft or system harder to hold steady.","zh":"（航空/工程）把配平（trim）调得过度，导致飞机或系统更难保持稳定。"},"examples":[{"en":"The pilot overtrimmed the aircraft, so it kept pitching up.","zh":"飞行员把飞机配平调过头了，结果机头一直上仰。"},{"en":"Overtrimming can make the controls feel unexpectedly heavy or light.","zh":"配平过度会让操纵感觉异常变重或变轻。"}]}],"synonyms":["trim too much","cut too short","overcut","overprune"],"phonetic":"ˌoʊvɚˈtrɪm","extraExplanation":["“overtrimme”在英语里几乎不作为标准拼写出现，更常见的是动词“overtrim”，以及过去式/过去分词“overtrimmed”。如果你是想表达“被修剪过头了”，可以用：“My hair was overtrimmed.”","词根理解：over-（过度）+ trim（修剪/修整；也指“配平”）。日常语境多用于“剪过头、修得太狠”；专业语境常见于航空里的“trim（配平）”。"]}
{"word":"overtrimmed","summary":{"en":"“Overtrimmed” means something has been trimmed or cut back too much.","zh":"“overtrimmed”指某物被修剪/删减得太多、过度了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trimmed too much; cut or reduced more than is desirable (often about hair, hedges, budgets, or text).","zh":"修剪或削减过度；剪得/删得太多（常用于头发、树篱、预算或文字等）。"},"examples":[{"en":"My bangs look overtrimmed—they’re much shorter than I wanted.","zh":"我的刘海看起来被剪过头了——比我想要的短多了。"},{"en":"The hedge is overtrimmed, so it can’t provide much privacy now.","zh":"树篱修剪过度，所以现在几乎起不到遮挡隐私的作用。"},{"en":"The article felt overtrimmed, and some key details were missing.","zh":"这篇文章删减过度，一些关键信息不见了。"}]}],"synonyms":["cut too short","overcut","overpruned","overedited","trimmed too much"],"phonetic":"/ˌoʊvɚˈtrɪmd/","extraExplanation":["“over-”表示“过度、超过适当程度”，和“trim（修剪/删减/整理）”组合后，强调“做得太过头”。常见搭配：overtrimmed hair（头发剪过头）、overtrimmed hedges（树篱修剪过度）、overtrimmed budget（预算砍得过多）、overtrimmed text（文字删得过度）。","在写作语境里，overtrimmed 常带有轻微负面评价：为了“精简”而牺牲了必要内容；在园艺/理发语境里则表示外观或功能受影响。"]}
{"word":"overtrimming","summary":{"en":"Overtrimming means trimming too much, causing something to become overly short, sparse, or damaged.","zh":"Overtrimming 指“修剪过度”，把东西剪/修得过头，导致过短、过稀或受损。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of trimming too much, so that something becomes too short, sparse, or damaged","zh":"过度修剪；修剪过头（导致过短、过稀或受损）"},"examples":[{"en":"Overtrimming the hedge made it look uneven and thin.","zh":"把树篱修剪过头后，它看起来不整齐而且很稀薄。"},{"en":"The stylist apologized for overtrimming my bangs.","zh":"发型师为把我的刘海剪得过短而道歉。"},{"en":"Overtrimming can stress plants and slow their growth.","zh":"过度修剪会让植物产生压力并减缓生长。"}]},{"partOfSpeech":"v.","definition":{"en":"trimming too much (often describing an action in progress)","zh":"正在过度修剪（常用来描述进行中的动作）"},"examples":[{"en":"He is overtrimming the branches near the window.","zh":"他正在把窗边的树枝剪得过多。"},{"en":"Be careful—you’re overtrimming the fabric edges.","zh":"小心——你把布料边缘修得太多了。"}]}],"synonyms":["excessive trimming","overcutting","overpruning"],"phonetic":"/ˌoʊvɚˈtrɪmɪŋ/","extraExplanation":["“over-”这个前缀常表示“过度、超过适当程度”，例如：overcook（煮过头）、overwork（过度工作）、overreact（反应过度）。因此 overtrimming 通常带有“造成不良后果”的含义。","在园艺语境中，过度修剪可能导致植物更容易晒伤、病虫害增加，或影响开花结果；在理发/裁缝语境中，则常指剪短过头、难以补救。"]}
{"word":"overtrims","summary":{"en":"“Overtrims” means “trims too much” (the 3rd-person singular form of overtrim).","zh":"“overtrims”意为“修剪过度/剪过头”，是 overtrim 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trim (cut, remove, or adjust) too much, so the result is shorter, thinner, or less well-shaped than intended","zh":"修剪（裁剪、去除、调整）过度，导致结果比预期更短、更薄或形状不理想"},"examples":[{"en":"She overtrims her bangs and they end up much shorter than she wanted.","zh":"她把刘海修剪过度，结果比想要的短很多。"},{"en":"If you overtrim the hedge, it may look uneven for weeks.","zh":"如果你把树篱修剪过头，可能好几周都会看起来不平整。"},{"en":"Be careful not to overtrim the fabric seam, or it will fray easily.","zh":"注意别把布料的接缝裁得太多，不然很容易起毛散边。"}]},{"partOfSpeech":"vt.","definition":{"en":"(specialized) to adjust “trim” too far in settings like sailing, aviation, or machines, causing reduced performance or control issues","zh":"（专门用法）在航海、航空或机械等情境中把“配平/平衡调整”调过头，导致性能下降或操控问题"},"examples":[{"en":"The pilot overtrims the aircraft and has to correct the pitch.","zh":"飞行员把飞机配平调过头，不得不修正俯仰。"},{"en":"Don’t overtrim the sails in light wind, or the boat will slow down.","zh":"微风时不要把帆收得太紧（调整过度），不然船会变慢。"}]}],"synonyms":["trim too much","cut too short","overcut","over-prune"],"phonetic":"ˌoʊvərˈtrɪm","extraExplanation":["“overtrims” 是动词 “overtrim” 的第三人称单数现在时（he/she/it overtrims）。日常最常见的语境是理发、修剪树篱、修边等“剪过头”。在航海/航空里，trim 也可指“配平/调整到平衡状态”，overtrim 就是“调过头”。"]}
{"word":"overtrod","summary":{"en":"“Overtrod” means “walked on so much that it became worn down” (past tense of “overtread,” literary/old-fashioned).","zh":"“overtrod”意为“被反复踩踏而磨损/踩平”，是“overtread”的过去式（偏文学/较古旧）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Simple past tense and past participle of overtread: to walk on something so much that it becomes worn down, flattened, or damaged (often literary/old-fashioned).","zh":"overtread 的过去式和过去分词：在某物上反复踩踏，以致把它踩平、踩坏或磨损（常见于文学/较古旧用法）。"},"examples":[{"en":"The grass was overtrod around the gate where everyone entered.","zh":"大门周围的草地被来往的人踩得光秃秃的。"},{"en":"In winter, the narrow path was soon overtrod and muddy.","zh":"冬天，那条窄路很快就被踩得泥泞不堪。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) Walk over; tread upon (literary/archaic).","zh":"（较少见）走过；踏过（文学/古旧用法）。"},"examples":[{"en":"He overtrod the fallen leaves without a sound.","zh":"他踏过落叶，几乎没有发出声音。"}]}],"synonyms":["trampled","worn down","trodden (on)","flattened","beaten (path)"],"phonetic":"ˌoʊvərˈtrɑd","extraExplanation":["“overtrod”更常出现在较旧的英语或文学语境中；现代日常表达里，人们更常用“worn down / trampled / beaten path”等说法。","词形来源：动词“overtread”（over- + tread），其过去式常见为“overtrod”。在现代英语里，“tread”的不规则过去式通常是“trod”，因此“overtrod”读起来也符合这种模式。"]}
{"word":"overtrodden","summary":{"en":"Overused and too familiar; not original.","zh":"因使用过度而显得熟悉、老套、缺乏新意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too familiar or used too often; lacking freshness or originality because it has been repeated many times.","zh":"（因反复使用而）陈词滥调的；老套的；缺乏新意的。"},"examples":[{"en":"The movie relies on an overtrodden storyline: the hero saves the world at the last minute.","zh":"这部电影依赖一个老套的故事线：英雄在最后一刻拯救世界。"},{"en":"Try to avoid overtrodden phrases like “time will tell” in your essay.","zh":"写作文时尽量避免像“time will tell（时间会证明一切）”这类陈词滥调。"}]}],"synonyms":["hackneyed","trite","clichéd","shopworn","stale","well-worn"],"phonetic":"/ˌoʊvɚˈtrɑd(ə)n/","extraExplanation":["“overtrodden”字面意思是“被踩得太多（over + trodden）”，常用来形容“道路/路径”被走得太多，引申为“想法、情节、说法”被用到烂，失去新鲜感。","相关表达：a well-trodden path（常走的路；老路/套路）、a tired cliché（老掉牙的陈词滥调）、hackneyed（陈腐的）。"]}
{"word":"overtrouble","summary":{"en":"Overtrouble means to trouble or worry someone too much, or to make a situation unnecessarily difficult.","zh":"overtrouble 指“过度困扰/过分担心”，或“让事情变得不必要地麻烦”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trouble, worry, or burden someone too much; to cause more difficulty than is necessary","zh":"过度困扰；使（某人）过分担心或负担过重；造成不必要的麻烦"},"examples":[{"en":"I don’t want to overtrouble you, but could you check this form once more?","zh":"我不想过度麻烦你，但你能再帮我检查一下这份表格吗？"},{"en":"Try not to overtrouble yourself with things you can’t control.","zh":"尽量别为无法控制的事情让自己过度烦恼。"},{"en":"The new rules overtroubled small businesses with extra paperwork.","zh":"新规定用额外的文书工作过度增加了小企业的负担。"}]}],"synonyms":["overburden","bother","trouble","harass","worry"],"phonetic":"/ˌoʊvərˈtrʌbəl/","extraExplanation":["“over-”这个前缀常表示“过度、太多”（如 overwork 过度工作，overthink 想太多）。因此 overtrouble 的核心感觉是“把麻烦/担忧放大到不必要的程度”。","这个词在现代日常英语里不算常用，写作或较正式语境中更可能见到。口语里更常说: bother too much / trouble someone too much / worry too much。"]}
{"word":"overtroubled","summary":{"en":"Overtroubled means excessively worried or distressed.","zh":"overtroubled 指“过度忧虑、过分烦恼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Worried or upset more than is necessary; excessively troubled.","zh":"过度烦恼的；过分忧虑的；心事重重的（超过必要程度）。"},"examples":[{"en":"Try not to get overtroubled about the exam—you’ve prepared well.","zh":"别为考试过度烦恼——你已经准备得很充分了。"},{"en":"She sounded overtroubled by a small mistake at work.","zh":"她似乎因为工作中的一个小失误而过分忧虑。"}]}],"synonyms":["overly worried","anxious","distressed","troubled"],"phonetic":"/ˌoʊvɚˈtrʌbəld/","extraExplanation":["“over-”作前缀常表示“过度、过分”（如 overworked 过度劳累的，overconfident 过分自信的）。因此 overtroubled 带有“担忧超过实际情况”的语气，常用于安慰或劝人放轻松的语境。","这个词在现代英语中不算高频，更常见的替代表达有 overly worried / very troubled / anxious / distressed（程度更强）。在较文学或较正式的语境里，overtroubled 会显得更书面一些。"]}
{"word":"overtroubling","summary":{"en":"“Overtroubling” means excessively troubling or worrying; it’s an uncommon word and often replaced by “very/deeply troubling.”","zh":"“overtroubling”表示“过分令人担忧/烦恼”。该词较少见，常用“very/deeply troubling”等更自然的说法替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively worrying, upsetting, or causing too much concern.","zh":"过分令人担忧的；太让人烦恼/不安的。"},"examples":[{"en":"The sudden drop in sales is overtroubling for a small business.","zh":"销量突然下降对小企业来说过分令人担忧。"},{"en":"She found the news overtroubling and couldn’t focus on work.","zh":"她觉得这个消息太让人不安，无法专心工作。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overtrouble”: to worry or trouble (someone) too much; to cause excessive concern.","zh":"“overtrouble”的现在分词：过度使（某人）担忧/烦恼；造成过多困扰。"},"examples":[{"en":"Try not to be overtroubling yourself with worst-case scenarios.","zh":"尽量别用最坏的假设来过度折磨自己。"},{"en":"The media was overtroubling the public with constant alarming headlines.","zh":"媒体用持续的惊悚标题让公众过度焦虑。"}]}],"synonyms":["deeply troubling","very troubling","extremely worrying","disturbing","upsetting"],"phonetic":"/ˌoʊvərˈtrʌbəlɪŋ/","extraExplanation":["“overtroubling”比较少见，更常见、更自然的表达是“very troubling / deeply troubling / extremely worrying”。","词形结构是 over-（过度）+ troubling（令人烦恼的/担忧的），常用来强调“程度太过”。在正式写作中，建议根据语境改用更常见的搭配，以免显得生硬。"]}
{"word":"overtrue","summary":{"en":"Overtrue means “too true” or “so realistic it feels exaggerated,” and it’s relatively rare and somewhat literary.","zh":"Overtrue 指“过于真实（真实得刺人）”或“过分写实到显得夸张”，用法较少见，略偏文学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too true; uncomfortably accurate or closer to the truth than you would like (often about a remark, description, or criticism).","zh":"（说法/描述/批评）过于真实；真实得让人不舒服（常形容一语中的）。"},"examples":[{"en":"Her joke was funny, but it felt a little overtrue.","zh":"她的玩笑很有趣，但真实得让人有点不舒服。"},{"en":"His comment about my habits was overtrue, so I changed the subject.","zh":"他对我习惯的评价太准了，所以我就转移话题。"}]},{"partOfSpeech":"adj.","definition":{"en":"overly faithful to reality; so realistic or exact that it seems exaggerated (often used in art, writing, or portrayal).","zh":"（艺术/写作/表演）过分写实、过度逼真；逼真到显得像夸张。"},"examples":[{"en":"The film’s violence felt overtrue, which made it hard to watch.","zh":"电影里的暴力太写实了，让人很难看下去。"},{"en":"Some reviewers said the portrait was overtrue and lacked warmth.","zh":"有些评论说这幅肖像太逼真，反而缺少温度。"}]}],"synonyms":["too true","painfully accurate","overly realistic","overly faithful","true to a fault"],"phonetic":"/ˌoʊvɚˈtruː/","extraExplanation":["“overtrue”不是现代口语里的常用词，更常见的写法是连字符“over-true”，或较文学/古体的缩写形式“o’er-true”。它通常带有“真实到刺痛人”的语气。"]}
{"word":"overtruly","summary":{"en":"Overtruly is a rare, archaic adverb meaning “all too truly / sadly true,” used for strong emphasis.","zh":"Overtruly 是少见的古语副词，表示“太真实了/千真万确（多带不幸地确实如此的强调）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare/archaic) Too truly; all too truly (used to emphasize that something is unfortunately accurate).","zh":"（少见/古语）太真实了；千真万确（常用来强调某事“不幸地确实如此”）。"},"examples":[{"en":"Your criticism is overtruly justified—my work was rushed.","zh":"你的批评千真万确有道理——我的工作确实做得太赶了。"},{"en":"It was overtruly said that time can heal, but it can also leave scars.","zh":"有人说时间能治愈，这话太真实了；但它也可能留下伤痕。"}]},{"partOfSpeech":"adv.","definition":{"en":"(very rare) Excessively or more than is proper; overly (used with the sense of “too much”).","zh":"（极少见）过度地；太……（带有“过分、太多”的意思）。"},"examples":[{"en":"Do not speak overtruly harshly to a child who is learning.","zh":"别对正在学习的孩子说得过分严厉。"}]}],"synonyms":["all too truly","too truly","all too true","sadly true","only too true"],"phonetic":"/ˌoʊvərˈtruːli/","extraExplanation":["“overtruly”不是现代英语中的常用词，常被视为古旧或文学化用法。结构上是 over-（过度/太）+ truly（真实地），语气往往接近固定表达 “all too true”（太对了/不幸地确实如此）。在现代写作里通常用 “all too truly / all too true / sadly true / too true” 来替代，更自然。"]}
{"word":"overtrump","summary":{"en":"Overtrump means to beat a card with a higher trump, or more generally to outdo someone by offering something stronger.","zh":"Overtrump 指在牌戏中用更大的王牌压过对方，也可泛指以更强的条件或表现胜过他人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to defeat or win against (someone) by playing a higher trump card, or by playing a trump when another suit was led","zh":"（牌戏中）用更大的王牌压过；（在他人出牌后）出王牌来压制"},"examples":[{"en":"In bridge, you can overtrump your partner’s card if you have a higher trump.","zh":"在桥牌里，如果你有更大的王牌，你可以用它压过搭档出的王牌。"},{"en":"She tried to overtrump his low trump with the ace.","zh":"她想用A这张大王牌压过他的小王牌。"}]},{"partOfSpeech":"v.","definition":{"en":"to outdo or surpass someone’s advantage, claim, or achievement (often by offering something bigger or stronger)","zh":"（比喻）胜过、压倒；以更强的优势或更大的条件“反超”"},"examples":[{"en":"He kept trying to overtrump everyone else’s stories with an even more dramatic one.","zh":"他总想用更夸张的故事来压过别人的经历。"},{"en":"The new proposal was designed to overtrump the rival plan.","zh":"这项新提案旨在压倒竞争对手的方案。"}]}],"synonyms":["outtrump","outdo","surpass","top","outbid"],"phonetic":"/ˌoʊvərˈtrʌmp/","extraExplanation":["“trump”最常见的来源是牌戏里的“王牌”。因此 overtrump 最自然的语境也在桥牌（bridge）、惠斯特（whist）等需要“王牌压制”的玩法里。后来才延伸到日常比喻用法，表示“用更强的条件/表现压过别人”。","拼写提示：通常写作一个词 overtrump；过去式/过去分词多见 overtrumped。"]}
{"word":"overtrust","summary":{"en":"Overtrust means trusting someone or something too much, often in a risky or unrealistic way.","zh":"overtrust 指“过度信任”，对人或事信得太多，常带来风险或判断失误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or unwarranted trust in someone or something, often leading to mistakes or risk.","zh":"对某人或某事过度（或不恰当地）信任，常会导致错误或风险。"},"examples":[{"en":"Overtrust in online reviews can lead you to buy low-quality products.","zh":"过度相信网评可能会让你买到质量很差的产品。"},{"en":"Their overtrust in the system made them ignore obvious warning signs.","zh":"他们对制度过度信任，结果忽视了明显的警讯。"}]},{"partOfSpeech":"v.","definition":{"en":"To trust someone or something too much; to place more trust than is reasonable.","zh":"过度信任；给予超出合理范围的信任。"},"examples":[{"en":"Don’t overtrust strangers with your personal information.","zh":"不要把个人信息过度托付给陌生人。"},{"en":"He overtrusted the new app’s security and reused his passwords.","zh":"他过度相信新应用的安全性，重复使用了密码。"}]}],"synonyms":["excessive trust","misplaced trust","overconfidence","naivete"],"phonetic":"/ˌoʊvərˈtrʌst/","extraExplanation":["“overtrust”不是日常口语里最常见的词；很多时候人们会用更自然的说法，比如“trust too much / place too much trust in …”。","在心理学与金融语境中更常见：例如对机构、模型或市场“过度信任”可能导致低估风险（risk underestimation）。"]}
{"word":"overtrustful","summary":{"en":"Overtrustful means too trusting, often to a risky or unwise degree.","zh":"overtrustful 指“过于轻信、太容易相信”，常含“这样不太明智/有风险”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing to trust other people or systems, sometimes in a way that can lead to being misled or harmed.","zh":"过于轻信的；太容易相信他人或系统（有时会因此受骗或受害）。"},"examples":[{"en":"He was overtrustful and shared his password with a stranger.","zh":"他太过轻信，把密码分享给了陌生人。"},{"en":"Don’t be overtrustful online—verify who you’re talking to.","zh":"在网上别太轻信——先核实你在和谁聊天。"},{"en":"Her overtrustful nature made her an easy target for scams.","zh":"她过于轻信的性格让她很容易成为诈骗的目标。"}]}],"synonyms":["too trusting","overly trusting","credulous","gullible"],"phonetic":"/ˌoʊvərˈtrʌstfəl/","extraExplanation":["这个词由 over-（“过度”）+ trustful（“信任的”）构成，语气通常带一点提醒或批评：不是说“愿意信任”本身不好，而是强调“信任得超过了合理程度”。","日常英语里更常见的表达有 too trusting、overly trusting、gullible（更偏“容易上当、轻信到有点傻”）等；overtrustful 属于可理解但相对少见的用词。"]}
{"word":"overtrustfully","summary":{"en":"“Overtrustfully” means acting in an overly trusting way.","zh":"“overtrustfully”表示“过度信任地、轻信地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that trusts too much; with more trust than is wise or safe (often without enough evidence).","zh":"过度信任地；轻信地（信任超过理智或安全范围，常指证据不足）。"},"examples":[{"en":"She overtrustfully shared her password with a stranger online.","zh":"她过度信任地把密码分享给了网上的陌生人。"},{"en":"If you act overtrustfully at work, you may ignore warning signs in a deal.","zh":"如果你在工作中过度信任地行事，可能会忽视交易中的警示信号。"}]}],"synonyms":["too trustingly","naively","gullibly","overconfidently"],"phonetic":"/ˌoʊvərˈtrʌstfəli/","extraExplanation":["“overtrustfully”不算常见，更常见的表达是“too trustingly / naively / with too much trust”。它由 over-（过度）+ trustful（信任的）+ -ly（副词后缀）构成。写作中偶尔会用来强调“信任过头”的语气。"]}
{"word":"overtrustfulness","summary":{"en":"Overtrustfulness means excessive or too-easy trust in others.","zh":"Overtrustfulness 指“过度信任、太容易相信别人”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of trusting people too easily or too much; excessive trust that can make someone vulnerable to being misled or harmed.","zh":"过度信任；太容易相信别人（可能因此容易受骗或受伤）。"},"examples":[{"en":"Her overtrustfulness made her an easy target for online scams.","zh":"她的过度信任让她很容易成为网络诈骗的目标。"},{"en":"In business, overtrustfulness can lead to signing unfair contracts.","zh":"在商业中，过度信任可能会导致签下不公平的合同。"},{"en":"He learned to balance kindness with caution after his overtrustfulness was taken advantage of.","zh":"在他的过度信任被人利用后，他学会了在善良与谨慎之间取得平衡。"}]}],"synonyms":["gullibility","naivety","credulity","overconfidence","trusting nature"],"phonetic":"/ˌoʊvɚˈtrʌstfəl.nəs/","extraExplanation":["“overtrustfulness”由 over-（过度）+ trust（信任）+ -ful（充满……的）+ -ness（名词后缀）构成，整体意思就是“过度的信任这种特质/状态”。","在日常英语里更常见的表达是 “gullibility”（轻信）、“naivety/naiveté”（天真）、或短语 “trusting nature”（容易相信别人的性格）。"]}
{"word":"overtrusting","summary":{"en":"Overtrusting means trusting people too easily or too much, often leading to risk or disappointment.","zh":"Overtrusting 指过于轻信他人、信任过度，常会带来风险或失望。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trusting too easily or too much, especially in a way that can lead to being deceived, disappointed, or harmed.","zh":"过于轻信的；太容易或太过相信他人（常因此容易受骗、失望或受伤）。"},"examples":[{"en":"He’s overtrusting and often shares personal information with strangers online.","zh":"他太轻信了，经常在网上把个人信息分享给陌生人。"},{"en":"Being overtrusting can make you an easy target for scams.","zh":"过于轻信会让你很容易成为诈骗的目标。"}]}],"synonyms":["too trusting","overly trusting","gullible","naive","unsuspecting"],"phonetic":"/ˌoʊvərˈtrʌstɪŋ/","extraExplanation":["“Overtrusting”由 over-（过度）+ trusting（信任的）组成，语气通常偏负面，强调“信任超过了合理的谨慎”。日常更常见的表达还有 “too trusting / overly trusting / naive（天真、轻信）”。","它常用于谈人际关系、网络安全、职场合作等场景：提醒在信任的同时要有边界（boundaries）和核实（verify）。"]}
{"word":"overtruthful","summary":{"en":"“Overtruthful” means being excessively honest—sharing more truth than the situation needs, sometimes awkwardly.","zh":"“overtruthful”指“过于诚实/过于直白”，把不必说的真话也说出来，可能显得尴尬或不合时宜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too truthful or too honest in a way that gives more information than is needed, sometimes causing embarrassment or problems.","zh":"过于诚实、过于直白（说出超出必要的信息），有时会让人尴尬或带来麻烦。"},"examples":[{"en":"He was overtruthful in the interview and mentioned every mistake he’d ever made.","zh":"他在面试中过于诚实，把自己犯过的每个错误都提了出来。"},{"en":"I appreciate your honesty, but that comment felt a bit overtruthful for a first meeting.","zh":"我欣赏你的坦诚，但第一次见面说那样的话有点过于直白了。"},{"en":"Kids can be overtruthful—they say what they see without thinking about feelings.","zh":"孩子有时会过于诚实——他们看到什么就说什么，不太会顾及别人的感受。"}]}],"synonyms":["too honest","overly honest","brutally honest","blunt","overly candid"],"phonetic":"/ˌoʊvɚˈtruːθfəl/","extraExplanation":["“overtruthful”不是非常常见的标准词，更偏口语/临时造词（creative wording）。它由前缀 over-（“过度”）+ truthful（“诚实的”）构成，用来强调“诚实过头”。","语气通常不是在夸奖，而是带一点提醒：内容虽然真实，但不够得体、没有必要、或缺少分寸。类似含义常用表达还有 “too honest,” “brutally honest,” “TMI (too much information)”。"]}
{"word":"overtruthfully","summary":{"en":"“Overtruthfully” means speaking or writing too truthfully—more honestly than is necessary or tactful.","zh":"“overtruthfully”指说话/写作“过于坦白、过度真实”，真实得超过了合适或得体的程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is more truthful than necessary or appropriate, often with extra detail that may feel blunt or uncomfortable.","zh":"以“过于真实/过于坦白”的方式说话或表达；比必要或合适的程度更真实，常带来直白甚至让人不舒服的感觉。"},"examples":[{"en":"He answered overtruthfully, listing every mistake in the project, and the room went quiet.","zh":"他回答得过于坦白，把项目里的每个错误都列出来，现场一下子安静了。"},{"en":"She spoke overtruthfully about his flaws, even though a gentler reply would have helped.","zh":"她过于直白地谈他的缺点，其实更温和的回答会更有帮助。"}]},{"partOfSpeech":"adv.","definition":{"en":"With excessive emphasis on factual accuracy, sometimes at the expense of tact, tone, or social harmony.","zh":"过分强调事实准确性；有时牺牲了分寸、语气或人际和谐。"},"examples":[{"en":"The report was written overtruthfully, focusing on tiny details instead of the main point.","zh":"这份报告写得过分追求“事实细节”，反而没有抓住重点。"}]}],"synonyms":["too honestly","overly honestly","with brutal honesty","bluntly","tactlessly"],"phonetic":"ˌoʊvɚˈtruθfəli","extraExplanation":["“overtruthfully”不是常用词，更自然的表达通常是：“too honestly / overly honestly / with brutal honesty / more truthfully than necessary”。","前缀“over-”有“过度、超出适当范围”的意思，所以这个词常带有“直白到不合时宜”的语感，并不等同于“very truthfully（非常真实）”。","在不同文化语境里，“过于坦白”可能被看作诚实，也可能被看作不体贴；写作或沟通时可以根据场合改用更委婉的说法。"]}
{"word":"overtruthfulness","summary":{"en":"Overtruthfulness means being excessively truthful—sometimes so direct that it becomes unnecessary or hurtful.","zh":"overtruthfulness 指“过度诚实”，真话说得太多或太直白，以至于显得不必要或伤人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or habit of being excessively truthful or overly focused on stating the truth, sometimes in a way that feels unnecessary, blunt, or unkind","zh":"过度诚实；过分强调讲真话的习惯或倾向（有时会显得没必要、太直白，甚至不够体贴）"},"examples":[{"en":"His overtruthfulness made the meeting uncomfortable when he criticized everyone’s work in detail.","zh":"他过度诚实，在会上把每个人的工作细细批评了一遍，弄得气氛很尴尬。"},{"en":"Overtruthfulness can hurt relationships if you tell every truth without considering timing or tone.","zh":"如果不顾时机和语气把所有真话都说出来，过度诚实可能会伤害人际关系。"}]}],"synonyms":["over-honesty","excessive honesty","over-candor","brutal honesty"],"phonetic":"/ˌoʊvərˈtruːθf(ə)lnəs/","extraExplanation":["“overtruthfulness”不是很常见的标准词，更像是由 over-（过度）+ truthfulness（诚实）临时组合出来的表达，用来强调“诚实过头”。日常英语里更常见的说法有：overly honest（过于诚实）、too candid（太直白）、brutal honesty（残酷的诚实）。","语用上它常带一点负面意味：不是反对诚实本身，而是指出“把真话说出来的方式/时机/分寸”可能不合适。"]}
{"word":"overtumble","summary":{"en":"Overtumble means to tumble over/overturn, or (more rarely) to do a somersault.","zh":"overtumble 指“翻倒、翻滚着倒下”，较少见时也可指“翻筋斗”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tumble over or roll over; to overturn by tumbling.","zh":"翻滚着倒下；翻倒（因翻滚而倾覆）。"},"examples":[{"en":"The bike hit the curb and overtumbled into the grass.","zh":"自行车撞到路沿后翻倒在草地上。"},{"en":"In the strong wind, loose boxes can overtumble and spill their contents.","zh":"在大风里，松散堆放的箱子可能会翻倒，里面的东西洒出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to perform a somersault or flip over (often used in older or literary writing).","zh":"翻筋斗；翻转一圈（多见于较旧或文学性的用法）。"},"examples":[{"en":"The child tried to overtumble down the soft hill.","zh":"孩子试着在柔软的山坡上翻着跟头滚下去。"}]}],"synonyms":["tumble over","tip over","overturn","capsize","somersault"],"phonetic":"/ˌoʊvərˈtʌmbəl/","extraExplanation":["“overtumble”不是现代英语里很常见的日常用词，更常见的表达是 “tumble over / tip over / overturn”。它的构词很直观：over-（翻过来）+ tumble（翻滚）。在阅读旧文学或较描写性的文本时更容易遇到。"]}
{"word":"overture","summary":{"en":"An overture is either an opening musical piece (especially for an opera or musical) or a figurative “opening move” that leads into something bigger.","zh":"overture 可指歌剧/音乐剧等的“序曲”，也可比喻为引出更大事件的“开端、序幕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opening piece of music (often orchestral) that introduces an opera, musical, or other large work, sometimes including melodies you will hear later.","zh":"（常为管弦乐）序曲：歌剧、音乐剧或大型作品的开场音乐，常会预示或引用后面会出现的旋律。"},"examples":[{"en":"The orchestra played the overture before the curtain rose.","zh":"幕布升起前，乐团演奏了序曲。"},{"en":"In the overture, you can already hear themes that return in the final act.","zh":"在序曲里，你已经能听到在终场还会回归的主题旋律。"}]},{"partOfSpeech":"n.","definition":{"en":"A beginning or first step that leads into a larger event or relationship (often used in the phrase “as an overture to”).","zh":"（引子/开端）为更大事件或关系铺垫的第一步（常见搭配：as an overture to…）。"},"examples":[{"en":"The meeting was an overture to further negotiations.","zh":"这次会面是进一步谈判的开端。"},{"en":"His apology served as an overture to rebuilding trust.","zh":"他的道歉成了重建信任的开场。"}]}],"synonyms":["prelude","introduction","opening","prologue","beginning"],"phonetic":"/ˈoʊvɚtʃɚ/","extraExplanation":["“overture”源自法语 ouverture，意思是“开口、开启”，所以它既可指音乐上的“开场”，也可引申为事情的“序幕”。在古典音乐里，常见两类：歌剧序曲（为戏剧做铺垫）与音乐会序曲（独立演出的短曲）。"]}
{"word":"overtured","summary":{"en":"“Overtured” means “made an overture”: made a tentative offer or approach (often for talks), or began something with an overture/opening piece.","zh":"“Overtured”指“提出试探性接触/提议”（常用于谈判语境），或“以序曲/开场曲开始”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of overture) to make an approach or offer, especially to start peace talks, negotiations, or a relationship.","zh":"（overture 的过去式/过去分词）提出试探性的接触或提议，尤指为开启和谈、谈判或关系而进行的示好/试探。"},"examples":[{"en":"The company overtured to a smaller rival about a possible merger.","zh":"这家公司向一家较小的竞争对手试探性提出了可能合并的意向。"},{"en":"After years of tension, the two sides finally overtured with informal talks.","zh":"多年紧张之后，双方终于以非正式会谈作为试探性接触。"}]},{"partOfSpeech":"v.","definition":{"en":"(music/performing arts) to begin an opera, play, or event with an overture or opening piece; to introduce something in a “opening” way.","zh":"（音乐/表演艺术）以序曲或开场曲开始（歌剧、戏剧或活动）；用“开场”方式引入内容。"},"examples":[{"en":"The concert was overtured by a short, dramatic orchestral piece.","zh":"音乐会以一段短小而戏剧性的管弦乐开场。"},{"en":"The program overtured the evening with a tribute to the composer.","zh":"节目以向这位作曲家的致敬作为晚上的开场。"}]}],"synonyms":["approached","proposed","initiated","made an overture","opened","introduced"],"phonetic":"ˈoʊvɚtʃɚd","extraExplanation":["“overtured”在日常英语里不算常见，更常见的说法是：make an overture (to sb)（向某人示好/提出试探性提议）。新闻报道和外交语境里会更常见。","词根上与法语有关：overture 原意有“开口、开启”之意，所以既能指“序曲”（开场音乐），也能引申为“开启谈判的试探性举动”。"]}
{"word":"overtures","summary":{"en":"Overtures are either musical introductions (overtures) or attempts/proposals to start contact, talks, or a relationship.","zh":"Overtures 既可指（复数）“序曲”，也可指为开启接触、谈判或关系而做出的“示好/提议/试探”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) An introduction to an opera, musical, or other large musical work.","zh":"（音乐）歌剧、音乐剧或其他大型音乐作品的序曲／前奏。"},"examples":[{"en":"The orchestra played the overture before the curtain rose.","zh":"幕布升起前，乐团演奏了序曲。"},{"en":"Beethoven’s Leonore Overture is often performed as a concert piece.","zh":"贝多芬的《莱奥诺拉序曲》常被当作音乐会作品演出。"}]},{"partOfSpeech":"n.","definition":{"en":"An approach, proposal, or attempt to start a relationship, agreement, or discussion (often in diplomacy or romance).","zh":"（常用于外交或感情）试探性的接触、提议、示好；为开启谈判/关系的尝试。"},"examples":[{"en":"The two sides rejected the early peace overtures.","zh":"双方拒绝了早期的和平提议。"},{"en":"She ignored his romantic overtures at work.","zh":"她无视了他在工作场合的暧昧示好。"},{"en":"The company made overtures to potential partners in Asia.","zh":"公司向亚洲的潜在合作伙伴进行了接触。"}]}],"synonyms":["prelude","introduction","opening","proposal","approach","advance","feelers","peace offer"],"phonetic":"/ˈoʊvərtʃərz/","extraExplanation":["“overture”源自法语 ouverture，意思是“开启、开场”。因此它既可指音乐作品的“开场序曲”，也可引申为人际或外交中的“开场动作/试探性接触”。","你输入的 overtures 是复数形式，表示“多个序曲”或“多次示好/多项提议”。"]}
{"word":"overturing","summary":{"en":"Overture means a musical introduction, or a friendly move to start contact or negotiation.","zh":"overture 指（音乐的）序曲，也可指（人际/外交的）示好或开启谈判的举动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrumental introduction to an opera, ballet, or other large musical work.","zh":"（歌剧、芭蕾等大型音乐作品的）序曲；开场的器乐引子。"},"examples":[{"en":"The orchestra played the overture before the curtain rose.","zh":"帷幕升起前，乐队演奏了序曲。"},{"en":"I love how the overture sets the mood for the whole opera.","zh":"我很喜欢序曲如何为整部歌剧定下氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"A friendly offer or action that shows you want to start a relationship, discussion, or negotiation.","zh":"（为建立关系或开始谈判的）示好；主动接触；提议。"},"examples":[{"en":"She made an overture to her neighbor by bringing homemade cookies.","zh":"她带了自制饼干去拜访邻居，以示友好。"},{"en":"The company rejected the rival’s overture to merge.","zh":"该公司拒绝了竞争对手提出的合并意向。"}]}],"synonyms":["prelude","introduction","opening","gesture","proposal"],"phonetic":"/ˈoʊvərtʃər/","extraExplanation":["“overturing”本身并不是常见标准词形。你可能想写的是：\n1）overture（名词）：序曲；示好\n2）overturning（动名词/现在分词）：推翻；打翻\n如果你告诉我原句，我也可以帮你判断最合适的词。","overture 源自法语 ouverture，字面意思是“开口/开启”，因此既可指音乐作品的“开场”，也可引申为人际或外交上的“开启对话的姿态”。"]}
{"word":"overturn","summary":{"en":"Overturn means to flip something over (literally) or to reverse/cancel an official decision (figuratively).","zh":"Overturn 既可指把东西掀翻/翻倒，也常指推翻或撤销判决、法律或决定。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn something over so it falls or flips; to tip upside down","zh":"把……翻倒；使……倾覆（翻过来、倒下）"},"examples":[{"en":"The strong wind overturned the boat.","zh":"强风把小船掀翻了。"},{"en":"Be careful not to overturn the glass of water.","zh":"小心别把那杯水打翻。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reverse or cancel a decision, law, or result (often by a higher authority, such as a court)","zh":"推翻（判决/法律/决定）；撤销（结果）（常指上级机构如法院）"},"examples":[{"en":"The appeals court overturned the ruling.","zh":"上诉法院推翻了该裁决。"},{"en":"The election result was overturned after an investigation.","zh":"调查后，选举结果被推翻了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change completely; to upset or disrupt an existing situation or system","zh":"彻底改变；打乱；颠覆（现状/体系）"},"examples":[{"en":"The new technology overturned the way people shop.","zh":"这项新技术颠覆了人们购物的方式。"},{"en":"One mistake can overturn a carefully made plan.","zh":"一个错误就可能打乱精心制定的计划。"}]},{"partOfSpeech":"vi.","definition":{"en":"to turn over or flip; to capsize","zh":"翻倒；倾覆（多指物体自己翻过来，如船）"},"examples":[{"en":"The canoe overturned in the fast current.","zh":"独木舟在急流中倾覆了。"}]}],"synonyms":["tip over","capsize","flip","reverse","overrule","nullify"],"phonetic":"/ˌoʊvərˈtɝn/","extraExplanation":["“overturn”常见两大语境：①物理上“掀翻/翻倒”（over + turn）；②抽象上“推翻”判决、法律或既有结论，尤其常见于法律新闻（overturn a ruling/decision/ban）。","搭配提示：overturn a verdict/ruling/decision/law/ban（推翻裁决/决定/法律/禁令）；overturn a boat/car（掀翻船/车）。"]}
{"word":"overturnable","summary":{"en":"Overturnable means able to be turned over physically or able to be reversed/canceled (especially a legal decision).","zh":"overturnable 指“可被掀翻的”（物理层面）或“可被推翻/撤销的”（尤指法律决定）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be overturned (physically turned over), usually by force, wind, or impact.","zh":"可被掀翻的；可被翻倒的（指物体在外力、风或撞击下会翻过来）。"},"examples":[{"en":"Small boats are more overturnable in rough water.","zh":"小船在风浪大时更容易被掀翻。"},{"en":"A light chair can be overturnable if someone bumps into it.","zh":"轻的椅子如果被人撞到，可能会翻倒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be reversed or canceled, especially by a court or higher authority (used for rulings, decisions, or verdicts).","zh":"可被推翻的；可被撤销的（尤指判决、决定或裁定在上级机关或法院可被改变）。"},"examples":[{"en":"The lawyer argued that the conviction was overturnable on appeal.","zh":"律师认为该定罪在上诉中有可能被推翻。"},{"en":"If the procedure wasn’t followed, the decision may be overturnable.","zh":"如果程序不合规，这个决定可能会被撤销。"}]}],"synonyms":["reversible","revocable","voidable","defeasible","susceptible to being overturned"],"phonetic":"/ˌoʊvɚˈtɝnəbəl/","extraExplanation":["“overturnable”在法律英语里更常见，常搭配 appeal（上诉）、ruling/decision/verdict（裁决/决定/判决）等，表示“有可能被上级推翻”。日常口语中，人们更常说“can be overturned”或“likely to be overturned”。","构词：overturn（推翻/掀翻）+ -able（可……的）。注意与“overturning”（正在推翻/掀翻）区分：-able强调“具有被……的可能性/性质”。"]}
{"word":"overturned","summary":{"en":"“Overturned” means flipped over (physically) or reversed/cancelled (especially a legal decision).","zh":"“overturned”可指（物体/车辆）翻倒，也可指（尤其法律上的）判决或决定被推翻/撤销。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a vehicle or object) turned upside down or onto its side.","zh":"（车辆或物体）翻倒的；倾覆的。"},"examples":[{"en":"The overturned truck blocked two lanes of traffic.","zh":"那辆翻倒的卡车堵住了两条车道。"},{"en":"An overturned chair lay on the floor after the argument.","zh":"争吵之后，一把翻倒的椅子倒在地上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a decision, verdict, or policy) officially reversed or cancelled by a higher authority.","zh":"（判决、裁决或政策）被上级机构推翻的；撤销的。"},"examples":[{"en":"The conviction was overturned on appeal.","zh":"该定罪在上诉中被推翻。"},{"en":"The rule was overturned by the court.","zh":"这项规定被法院撤销了。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “overturn”: to cause something to fall over; or to reverse a decision or result.","zh":"“overturn”的过去式/过去分词：使……翻倒；或推翻（决定/结果）。"},"examples":[{"en":"Strong winds overturned several trees.","zh":"强风刮倒了好几棵树。"},{"en":"The judge overturned the earlier ruling.","zh":"法官推翻了先前的裁定。"}]}],"synonyms":["flipped","tipped over","capsized","reversed","overruled","vacated"],"phonetic":"/ˌoʊvɚˈtɝnd/","extraExplanation":["在新闻与法律语境里，overturned 常与 on appeal（上诉中）搭配，表示“原判被上级法院撤销/改判”。也常见固定说法：overturn a verdict（推翻裁决）、overturn a ruling（推翻裁定）、overturn a law（撤销/判定某法律无效）。"]}
{"word":"overturner","summary":{"en":"Overturner means a person/thing that overturns (overthrows or reverses), or a device that flips something over.","zh":"Overturner 指“推翻/扭转者（事物）”，也可指“翻转装置”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, group, or thing that overturns something—especially someone who overthrows or reverses an existing decision, system, or result.","zh":"推翻者；颠覆者（指推翻、否决或扭转既有决定、制度或结果的人、团体或事物）。"},"examples":[{"en":"The court became an overturner of the earlier ruling.","zh":"法院成了先前判决的推翻者。"},{"en":"In the debate, new evidence acted as an overturner of the old theory.","zh":"在辩论中，新证据成了旧理论的“颠覆者”。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device designed to turn something over (for example, a machine that flips containers or materials).","zh":"翻转器；翻倒装置（用于把物体翻过来或翻倒的工具或设备）。"},"examples":[{"en":"The factory installed an overturner to flip heavy bins safely.","zh":"工厂安装了翻转器来安全翻转沉重的箱筐。"},{"en":"Use the drum overturner to empty the container without lifting it by hand.","zh":"使用桶翻转装置来倒空容器，不必手动抬起。"}]}],"synonyms":["overthrower","reverser","disrupter","disruptor","flipper (device)"],"phonetic":"/ˌoʊvərˈtɝnər/","extraExplanation":["“overturner”由动词 overturn（推翻/翻倒）+ 后缀 -er（表示“做某事的人/物”）构成。它不是最常见的日常词，更常见的替代表达有：person who overthrows（推翻者）、disrupter/disruptor（颠覆者）、reverser（扭转者）；在工业语境中也常写成 *overturning device*（翻转装置）。"]}
{"word":"overturning","summary":{"en":"Overturning means either flipping something over (physical) or reversing a decision or result (legal/political/sports).","zh":"overturning既可指“把东西翻倒/倾覆”（物理意义），也可指“推翻/撤销决定或结果”（法律/政治/体育语境）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “overturn”) causing something to tip over or turn upside down; flipping.","zh":"（overturn 的现在分词）使某物倾倒或翻转；翻倒。"},"examples":[{"en":"A strong wind was overturning chairs on the patio.","zh":"强风把露台上的椅子吹得东倒西歪。"},{"en":"Be careful not to spill the paint while overturning the can.","zh":"翻动油漆桶时小心别把油漆洒出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle of “overturn”) reversing a decision, rule, or result (often in law, politics, or sports).","zh":"（overturn 的现在分词）推翻（决定/规定/结果）；撤销（判决等）（常用于法律、政治或体育语境）。"},"examples":[{"en":"The judge is overturning the earlier ruling because of new evidence.","zh":"由于出现新证据，法官正在推翻先前的裁决。"},{"en":"The protest movement focused on overturning the policy.","zh":"抗议运动的重点是推翻该政策。"},{"en":"The team’s comeback was overturning a 10-point deficit.","zh":"球队的逆转正在扭转10分的劣势。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of tipping over or being turned upside down; a flip or capsize.","zh":"倾覆或翻转的行为/过程；翻倒；（船等）倾覆。"},"examples":[{"en":"The report mentioned the overturning of a truck on the highway.","zh":"报告提到了高速公路上一辆卡车的侧翻。"},{"en":"Life jackets reduce risk during a boat overturning.","zh":"在船只倾覆时，救生衣能降低风险。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of reversing a decision or outcome; a reversal.","zh":"推翻或撤销（决定/结果）的行为/过程；逆转。"},"examples":[{"en":"The overturning of the verdict shocked the public.","zh":"判决被推翻令公众震惊。"},{"en":"They celebrated the overturning of the ban.","zh":"他们庆祝禁令被撤销。"}]}],"synonyms":["reversing","reversal","toppling","flipping","capsizing","overruling"],"phonetic":"/ˌoʊvɚˈtɝnɪŋ/","extraExplanation":["“overturning”在新闻里常见两大搭配：\n1) overturning a ruling/decision/law（推翻裁决/决定/法律）；\n2) overturning a vehicle/boat（车辆侧翻/船只倾覆）。\n看到宾语是什么，通常就能判断是“推翻”还是“翻倒”。"]}
{"word":"overturns","summary":{"en":"Overturn(s) means either to tip something so it falls over, or to reverse an official decision; it can also mean the act/accident of tipping over.","zh":"Overturn(s) 可指把东西掀翻/翻倒，也可指（法律或官方）推翻决定；还可作名词表示侧翻事故或推翻。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn something over so it ends up upside down or on its side; to tip over","zh":"把某物翻倒、掀翻（使其倒置或侧翻）"},"examples":[{"en":"The strong wind overturned several trash cans on the street.","zh":"大风把街上的几个垃圾桶都掀翻了。"},{"en":"Be careful not to overturn the cup of coffee.","zh":"小心别把咖啡杯打翻了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially reverse a decision, law, or ruling (often in courts or government)","zh":"（常指法院或政府）推翻、撤销（裁决/决定/法律）"},"examples":[{"en":"The appeals court overturned the earlier ruling.","zh":"上诉法院推翻了先前的裁决。"},{"en":"Voters may overturn the policy in a referendum.","zh":"选民可能会在公投中推翻这项政策。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a vehicle or container) to tip over and end up on its side or upside down","zh":"（车辆或容器等）侧翻、翻倒"},"examples":[{"en":"The truck overturned on the icy road.","zh":"卡车在结冰的路上侧翻了。"},{"en":"If the boat overturns, stay calm and hold on.","zh":"如果船翻了，保持冷静并抓牢。"}]},{"partOfSpeech":"n.","definition":{"en":"an accident in which something, especially a vehicle, tips over; a reversal of a decision","zh":"（尤指车辆）侧翻事故；（决定/裁决的）推翻、逆转"},"examples":[{"en":"Two people were injured in a bus overturn.","zh":"两人在一次公交车侧翻事故中受伤。"},{"en":"The ruling was an overturn of decades of precedent.","zh":"这项裁决推翻了数十年的先例。"}]}],"synonyms":["tip over","knock over","capsize","reverse","overrule","set aside"],"phonetic":"/ˌoʊvərˈtɝn/","extraExplanation":["“Overturns” 既可以是动词 overturn 的第三人称单数（He overturns…），也可以是名词 overturn 的复数（several overturns）。","在新闻和法律语境里，overturn 常搭配 ruling / decision / verdict / law（推翻裁决/决定/判决/法律）。日常口语里更常见的“打翻”也可以用 spill（把液体洒出来）或 knock over（碰倒）。"]}
{"word":"overtutor","summary":{"en":"“Overtutor” means to tutor someone too much, often reducing their independence or increasing stress.","zh":"“Overtutor”指对某人进行过度辅导，常导致对方缺乏独立性或压力增大。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tutor or coach someone too much, so they become dependent, stressed, or lose confidence/independence","zh":"过度辅导（教得太多/管得太细），以至于让对方产生依赖、压力或失去独立性"},"examples":[{"en":"Some parents overtutor their children before exams, which can increase anxiety.","zh":"有些家长在考试前过度辅导孩子，反而会增加焦虑。"},{"en":"If you overtutor him, he may stop trying to solve problems on his own.","zh":"如果你过度辅导他，他可能就不再尝试自己解决问题了。"},{"en":"The teacher warned that constant hints can overtutor students and weaken their critical thinking.","zh":"老师提醒说，不断提示会让学生被过度辅导，从而削弱批判性思维。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who tutors too much (rare)","zh":"过度辅导的人（较少见）"},"examples":[{"en":"She didn’t want to be an overtutor; she wanted her students to explore ideas independently.","zh":"她不想成为一个过度辅导的人；她希望学生能独立探索想法。"}]}],"synonyms":["overteach","overcoach","oversupervise","spoon-feed (figurative)"],"phonetic":"/ˌoʊvərˈtuːtər/","extraExplanation":["“overtutor”不是非常常见的词，更常见的表达有：overteach（过度教学）、overcoach（过度指导）、oversupervise（过度监督）、hover（在旁边盯得太紧）。\n\n构词上是 over-（过度）+ tutor（辅导）。在教育语境里，它带有“好心但过头”的含义，强调过多介入会削弱学习者的自主性。"]}
{"word":"overtwine","summary":{"en":"Overtwine means to wrap or twist around something (or to become closely intertwined, literally or figuratively).","zh":"Overtwine 指（字面或比喻）缠绕、交缠在一起。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wind, wrap, or twist something around (or over) something else; to entwine","zh":"把某物缠绕在（或覆绕在）另一物上；使交缠"},"examples":[{"en":"Vines overtwine the fence in summer.","zh":"夏天藤蔓缠绕着篱笆。"},{"en":"She overtwined a ribbon around the bouquet.","zh":"她用丝带把花束缠绕起来。"},{"en":"Their fingers overtwined as they walked.","zh":"他们走路时十指交扣。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to become closely mixed or connected, especially ideas, feelings, or stories","zh":"（比喻）交织在一起；紧密联系（尤指思想、情感或故事）"},"examples":[{"en":"In the novel, love and grief overtwine throughout the story.","zh":"在这部小说里，爱情与悲伤贯穿全文、彼此交织。"},{"en":"Politics and business often overtwine in small towns.","zh":"在小城镇里，政治与商业常常交织在一起。"}]}],"synonyms":["entwine","intertwine","twine","wind around","coil around","wrap around"],"phonetic":"/ˌoʊvərˈtwaɪn/","extraExplanation":["词形上由 over-（在……之上/过度/额外）+ twine（缠绕）构成，因此语感上常带有“缠得更紧、覆盖在上面”的意思。日常英语里更常见的说法是 entwine / intertwine；overtwine 较偏文学或描写性用词。"]}
{"word":"overtwist","summary":{"en":"Overtwist means twisting something too much, especially fibers or yarn, or the state/result of having too much twist.","zh":"Overtwist 指“拧得过度（尤指纤维/纱线）”，也可指“过度捻度/捻得太多的状态或结果”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to twist (fiber, yarn, wire, etc.) more than is desirable, so it becomes too tight, kinked, or unbalanced","zh":"把（纤维、纱线、金属丝等）拧得过度，导致过紧、打结或失去平衡"},"examples":[{"en":"If you overtwist the yarn, the scarf may curl and feel stiff.","zh":"如果你把纱线拧得过度，围巾可能会卷边，而且摸起来很硬。"},{"en":"The technician warned that overtwisting the cable can weaken it over time.","zh":"技术员警告说，电缆拧得过度会随着时间变脆弱。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessive amount of twist in a fiber, yarn, or strand","zh":"（纤维、纱线或股线中的）过度捻度；拧得太多的状态"},"examples":[{"en":"This fabric has an overtwist that makes it springy but harder to sew.","zh":"这块布的捻度过高，弹性更强，但更难缝制。"},{"en":"Too much overtwist can cause the threads to kink and tangle.","zh":"过多的过度捻度会让线打卷、缠结。"}]}],"synonyms":["twist too tightly","over-twist","overwind"],"phonetic":"/ˌoʊvərˈtwɪst/","extraExplanation":["“overtwist”常见于纺织、纺纱、绳索/线材加工等语境，核心意思是“捻度过高”。捻度过高可能带来更强的弹性与紧密度，但也更容易出现卷曲（curl）、打结（kink）、不易缝纫或强度下降等问题。","发音和构词上可拆为 over-（过度）+ twist（扭转/捻），理解成“扭得太多”最直观。"]}
{"word":"overtype","summary":{"en":"Overtype means typing that replaces existing text (or the mode that does this). It can also mean typing too much.","zh":"Overtype 指覆盖输入（会替换已有文字的输入方式/模式）；也可指打字过多。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to type new characters on top of existing text, replacing it instead of inserting new text","zh":"（在电脑或打字时）覆盖输入；用新字符替换原有文字，而不是插入新文字"},"examples":[{"en":"Be careful—you’re in overtype mode, so your typing will replace the next letters.","zh":"小心——你现在是覆盖模式，所以你输入的内容会替换后面的字母。"},{"en":"I accidentally overtyped the last sentence and lost what I had written.","zh":"我不小心把最后一句覆盖输入了，之前写的内容就没了。"}]},{"partOfSpeech":"v.","definition":{"en":"to type too much or too long, often making the text messy or harder to read","zh":"打字过多（或过长），常导致文字显得杂乱或不易阅读"},"examples":[{"en":"Try not to overtype your email—keep it short and clear.","zh":"邮件尽量别写太长（别打字过多）——简短清晰就好。"}]},{"partOfSpeech":"n.","definition":{"en":"the action or mode of typing that replaces existing characters (the opposite of insert mode)","zh":"覆盖输入（模式）；一种会替换原字符的输入方式（与插入模式相对）"},"examples":[{"en":"Press the Insert key to switch between insert and overtype.","zh":"按 Insert 键可以在插入和覆盖输入之间切换。"}]}],"synonyms":["overwrite","replace text","type over"],"phonetic":"/ˌoʊvɚˈtaɪp/","extraExplanation":["“Overtype”在老式打字机时代更直观：如果你在已经打过字的地方再次敲击，就会把原来的字“打在上面”。在电脑编辑里，它常指一种输入状态（overtype mode），会用新字符直接替换光标后的字符。","很多软件里可以用键盘上的 Insert（Ins）键切换插入（insert）与覆盖（overtype）模式；不小心切到覆盖模式是常见的“为什么字被吃掉了”的原因。"]}
{"word":"overtyped","summary":{"en":"“Overtyped” means text was typed over existing text, often overwriting it or making it hard to read.","zh":"“overtyped”指在已有文字上覆盖输入，常导致内容被替换或变得难以辨认。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “overtype”: to type over existing text or characters (often by mistake), or to replace them by typing on top of them.","zh":"“overtype”的过去式/过去分词：在已有文字或字符上再次输入（常常是误操作），或通过覆盖式输入把原内容替换掉。"},"examples":[{"en":"I overtyped the first paragraph and lost the original sentence.","zh":"我把第一段覆盖输入了，原来的句子就没了。"},{"en":"Be careful—you overtyped the email address, so the link is wrong now.","zh":"小心——你把邮箱地址覆盖打掉了，所以链接现在不对了。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing text that has been typed on top of other text (making it messy or hard to read).","zh":"（形容）文字被覆盖输入在另一段文字上，导致看起来杂乱或难以辨认。"},"examples":[{"en":"The form was hard to read because several lines were overtyped.","zh":"这张表格很难读，因为有好几行被覆盖输入了。"},{"en":"Please reprint it—the overtyped copy looks unprofessional.","zh":"请重新打印一份——这份覆盖输入的复印件看起来不专业。"}]}],"synonyms":["overwrote","typed over","retyped over","overwritten"],"phonetic":"/ˌoʊvərˈtaɪpt/","extraExplanation":["“overtype”最常见的使用场景来自打字机和早期文字处理软件：有些系统有“overtype mode（覆盖模式）”，输入时会把光标位置后面的字符直接替换掉，而不是把新字符插入进去。很多现代编辑器主要是“insert（插入）模式”，但仍可能通过键盘上的 Insert 键切换到覆盖模式。"]}

