{"word":"overuberous","summary":{"en":"Overuberous means “excessively fertile or overly abundant,” but it is extremely rare and mainly literary.","zh":"overuberous 意为“过于肥沃/过分丰饶”，但非常罕见，多用于文学式描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Excessively fertile or producing an unusually large amount; overly abundant (especially of growth, crops, or output).","zh":"（非常少见）过于肥沃的；产出过多的；过分丰饶的（尤指生长、作物或产量）。"},"examples":[{"en":"After a wet spring, the garden looked almost overuberous, with vines spilling over every path.","zh":"在一个多雨的春天之后，花园几乎显得过分丰茂，藤蔓漫过了每一条小路。"},{"en":"The writer described the valley as overuberous, a place where fruit seemed to appear everywhere.","zh":"作者把那座山谷写成“过分丰饶”的地方，仿佛到处都会长出果实。"}]}],"synonyms":["overabundant","excessively fertile","lush","prolific"],"phonetic":"/ˌoʊvərˈuːbərəs/","extraExplanation":["“overuberous”几乎不见于现代常用词典，更像是把前缀 over-（“过度”）加在罕见形容词 “uberous”（“肥沃的/多产的”）上形成的临时造词（nonce word）。","词根来自拉丁语 *uber*，意为“乳房、乳汁”，引申出“乳汁充足的 → 肥沃的/丰饶的”。因此它常带有文学描写的色彩，而不是日常用语。","如果你想用更自然的英语表达，常用替代词有：“overabundant”（过度丰富的）、“excessively fertile”（过度肥沃的）、“lush”（繁茂的）。"]}
{"word":"overunionize","summary":{"en":"Overunionize means to unionize to an excessive degree (often used critically).","zh":"overunionize 指“过度工会化”，常用于带批评意味的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to unionize too much; to organize a workplace or industry with unions to an excessive degree (often implying negative effects such as rigidity, inefficiency, or conflict).","zh":"（常带贬义）过度工会化；把工作场所或行业工会化到“太多/过头”的程度（暗示可能带来僵化、低效率或冲突等负面影响）。"},"examples":[{"en":"Some critics argue the company was overunionized and struggled to adapt to changes in the market.","zh":"一些批评者认为这家公司工会化过度，难以适应市场变化。"},{"en":"They warned that trying to overunionize every department could create unnecessary tension.","zh":"他们警告说，想让每个部门都“过度工会化”可能会造成不必要的紧张。"}]}],"synonyms":["over-organize","unionize too much","heavily unionized (related)"],"phonetic":"/ˌoʊvɚˈjuːnjəˌnaɪz/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、太多、超过适当程度”（如 overwork 过度工作、overheat 过热）。因此 overunionize 多用于评论、社论或辩论语境，带有立场色彩；在更中性的表达中，人们更常说 heavily unionized（高度工会化）或 strongly unionized（工会力量很强）。","谈到工会（union）话题时，不同国家和行业的历史背景差异很大；同一句话在不同语境下可能被理解为对劳动权益的担忧，或对企业效率的担忧。写作时可用数据或具体现象（例如合同规则、谈判频率、罢工风险等）来避免“标签化”。"]}
{"word":"overunionized","summary":{"en":"Overunionized means “too unionized,” often implying unions have more influence or rules than is beneficial.","zh":"overunionized 指“工会化过高”，常暗示工会影响或规则被认为超过了合理程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more union membership, union rules, or union influence than is considered necessary or helpful (often used critically).","zh":"（通常带批评色彩）工会化程度过高的；工会成员/工会规则/工会影响力被认为过多的。"},"examples":[{"en":"Some critics claim the industry is overunionized and therefore slow to change.","zh":"一些批评者认为这个行业工会化过高，因此变革缓慢。"},{"en":"The company argued that the port was overunionized, raising costs and delaying shipments.","zh":"公司称港口工会化过高，导致成本上升并延误货运。"}]}],"synonyms":["highly unionized","heavily unionized","too unionized"],"phonetic":"/ˌoʊvərˈjuːnjəˌnaɪzd/","extraExplanation":["“over-”表示“过度、过分”，加在“unionized（工会化的）”前就形成“overunionized”。这个词常见于新闻评论、商业与政治讨论中，语气往往主观，暗示“工会力量过强带来效率或成本问题”。在较中性的写法里，也可以改用“highly unionized（高度工会化的）”来避免价值判断。"]}
{"word":"overunionizing","summary":{"en":"“Overunionizing” means unionizing to an excessive degree, often used critically in labor and business discussions.","zh":"“Overunionizing”指工会化过度，常用于劳资与商业语境中，语气往往偏批评。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unionizing (organizing workers into a labor union) to an excessive degree, or in a way that is seen as beyond what is helpful or appropriate.","zh":"把工人组织成工会（工会化）做得过度，或被认为超过了有益/合适的程度。"},"examples":[{"en":"Some managers argue that overunionizing can slow down decision-making at work.","zh":"一些管理者认为，过度工会化会让工作中的决策变慢。"},{"en":"Workers may disagree on whether the company’s problems come from overunionizing or from poor leadership.","zh":"员工可能会对公司的问题是来自过度工会化还是来自糟糕的领导而意见不一。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of unionizing too much (used as a gerund).","zh":"过度进行工会化的行为或过程（作动名词使用）。"},"examples":[{"en":"The debate focused on overunionizing and its impact on productivity.","zh":"辩论聚焦在过度工会化以及它对生产力的影响。"}]}],"synonyms":["excessive unionization","too much unionization","over-organizing (workers)"],"phonetic":"/ˌoʊvərˈjuːnjəˌnaɪzɪŋ/","extraExplanation":["“overunionizing”来自“unionize（使…加入/成立工会）+ over-（过度）”。它常见于政治评论、商业新闻或劳资关系讨论中，带有明显立场色彩：使用者往往在批评工会影响效率、成本或管理弹性。中性表达可用“high unionization rate（工会化率很高）”或“extensive unionization（广泛工会化）”。"]}
{"word":"overunsuitable","summary":{"en":"“Overunsuitable” is not standard; use “too/very/wholly unsuitable” or “inappropriate/ill-suited.”","zh":"“overunsuitable”不常见且不标准；建议用“too/very/wholly unsuitable”或“inappropriate/ill-suited”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word; it is usually understood as “too unsuitable” or “overly unsuitable,” but native speakers would normally say “very/too/wholly unsuitable” instead.","zh":"不是标准英语单词；通常可被理解为“过于不合适/太不合适”，但母语者更常说“very/too/wholly unsuitable（非常/太/完全不合适）”。"},"examples":[{"en":"This wording sounds overunsuitable for a formal email; try “too informal” or “inappropriate.”","zh":"这个说法在正式邮件里听起来不太自然；可以改成“too informal（太随便）”或“inappropriate（不恰当）”。"},{"en":"The job isn’t “overunsuitable”; it’s simply unsuitable for my schedule.","zh":"这份工作不是“overunsuitable”；它只是对我的时间安排不合适。"}]}],"synonyms":["inappropriate","ill-suited","unfit","improper","unsuitable"],"phonetic":"/ˌoʊvərʌnˈsuːtəbəl/","extraExplanation":["“over-”作为前缀有“过度、太……”的意思（如 overconfident 过于自信、overcooked 煮过头）。但“unsuitable”本身已经是否定含义，英语里更习惯用程度副词来加强语气：too unsuitable / wholly unsuitable / completely unsuitable，或者改用更自然的词：inappropriate（不恰当）、ill-suited（不适合）。","如果你想表达“完全不适合”，常用搭配是 “entirely/wholly/completely unsuitable (for…)”。如果表达“太不合适（以至于不行）”，常用 “too unsuitable (to…)”。"]}
{"word":"overurbanization","summary":{"en":"Overurbanization is overly rapid city growth that outpaces jobs, housing, and public services.","zh":"过度城市化指城市增长过快，超过就业、住房与公共服务的承载能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The situation where a city or urban area grows too fast for jobs, housing, services, and infrastructure to keep up, causing serious social and environmental problems.","zh":"（城市）过度城市化：城市或城镇地区增长过快，工作、住房、公共服务与基础设施跟不上，从而引发严重的社会与环境问题。"},"examples":[{"en":"Overurbanization can lead to overcrowded housing and unreliable public transportation.","zh":"过度城市化可能导致住房过度拥挤以及公共交通不稳定。"},{"en":"Some rapidly growing cities struggle with overurbanization because job creation cannot match population growth.","zh":"一些快速扩张的城市因就业增长赶不上人口增长而面临过度城市化。"},{"en":"Policies that improve public services and affordable housing can reduce the harms of overurbanization.","zh":"改善公共服务与保障性住房的政策可以减轻过度城市化带来的危害。"}]}],"synonyms":["excessive urbanization","hyperurbanization","uncontrolled urbanization"],"phonetic":"/ˌoʊvɚˌɝːbənaɪˈzeɪʃən/","extraExplanation":["“overurbanization”常用于社会学、城市研究和新闻写作中，强调“城市人口增长”超过了“经济与治理能力”的承载限度，因此常与贫民窟扩张（slum growth）、失业（unemployment）、基础设施压力（infrastructure strain）等问题一起出现。","不要和“urban sprawl（城市蔓延）”混淆：sprawl 更强调城市向外扩张、低密度用地；overurbanization 更强调增长“过快/失衡”，即使不一定向外扩张，也可能出现服务不足与生活质量下降。"]}
{"word":"overurbanize","summary":{"en":"Overurbanize means to urbanize too much, creating excessive city growth and related problems.","zh":"overurbanize 指“过度城市化”，即城市化发展过度并带来相应问题。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a place too urban (too many buildings, people, or city-style development), often causing social or environmental problems","zh":"使某地过度城市化（建筑、人口或城市式开发过多），常引发社会或环境问题"},"examples":[{"en":"Some experts warn that rapid construction can overurbanize coastal areas and damage wetlands.","zh":"一些专家警告说，快速建设可能使沿海地区过度城市化，并破坏湿地。"},{"en":"The plan aims to grow the economy without overurbanizing the countryside.","zh":"该计划旨在发展经济，同时避免让乡村过度城市化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too urbanized (to change so much toward city life that it loses balance or sustainability)","zh":"变得过度城市化（向城市生活方式转变过多，以至于失去平衡或难以持续）"},"examples":[{"en":"If smaller towns overurbanize, housing costs may rise faster than wages.","zh":"如果小城镇过度城市化，房价可能比工资涨得更快。"},{"en":"The region has overurbanized in just two decades.","zh":"该地区在短短二十年里就变得过度城市化。"}]}],"synonyms":["urbanize excessively","overdevelop","overbuild","crowd","overconcentrate"],"phonetic":"/ˌoʊvərˈɝːbəˌnaɪz/","extraExplanation":["“overurbanize”也常写作“over-urbanize”。它多用于城市规划、公共政策与环境讨论中，强调“城市化过度”带来的副作用（如交通拥堵、住房紧张、绿地减少、社区结构变化等）。常见相关名词是“overurbanization”（过度城市化）。"]}
{"word":"overurbanized","summary":{"en":"Overurbanized means “too urbanized,” suggesting city growth or development has gone beyond a healthy balance.","zh":"overurbanized 指“过度城市化”，强调城市增长或开发超过了健康的平衡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too urbanized; having more urban development, population concentration, or city-style living than is healthy, balanced, or sustainable.","zh":"过度城市化的；城市发展或人口集中程度过高，以至于不健康、不平衡或不可持续的。"},"examples":[{"en":"Some coastal areas feel overurbanized, with high-rises replacing wetlands.","zh":"一些沿海地区显得过度城市化，高楼取代了湿地。"},{"en":"Residents worry that the town is becoming overurbanized and losing its local character.","zh":"居民担心小镇正在变得过度城市化，失去本地特色。"},{"en":"Overurbanized neighborhoods often struggle with traffic, noise, and limited green space.","zh":"过度城市化的社区常常面临交通拥堵、噪音以及绿地不足的问题。"}]}],"synonyms":["overdeveloped","overbuilt","overcrowded","too urban","excessively urbanized"],"phonetic":"/ˌoʊvərˈɝːbəˌnaɪzd/","extraExplanation":["“over-”表示“过度、超过适当程度”。“urbanize”是“使城市化”，因此“overurbanized”强调城市化过头带来的负面影响（如住房紧张、基础设施压力、环境破坏、生活成本上升等）。","该词常见于城市规划、环境议题与社会评论语境，语气通常偏批评或担忧。"]}
{"word":"overurbanizing","summary":{"en":"Overurbanizing means urbanizing too much or too fast, causing strain on resources or loss of local character.","zh":"Overurbanizing 指过度或过快城市化，导致资源承压或地方特色/绿地被削弱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) Urbanizing too much or too quickly, so that cities grow beyond what jobs, housing, infrastructure, or the environment can support.","zh":"（现在分词）过度或过快城市化，使城市扩张超过就业、住房、基础设施或环境所能承受的范围。"},"examples":[{"en":"Some researchers warn that the region is overurbanizing without enough public transportation.","zh":"一些研究者警告该地区在公共交通不足的情况下正在过度城市化。"},{"en":"Overurbanizing can push low-income families to the city’s edge where services are limited.","zh":"过度城市化可能把低收入家庭挤到城市边缘，而那里的公共服务更有限。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) Making an area feel overly city-like by adding too many urban features (high-rises, roads, malls), often at the expense of local character or green space.","zh":"（现在分词）把一个地区“城市化得过头”，添加过多城市元素（高楼、道路、商业综合体等），常以牺牲地方特色或绿地为代价。"},"examples":[{"en":"Residents say the new developments are overurbanizing the historic neighborhood.","zh":"居民说这些新开发项目正在让这片历史街区过度城市化。"},{"en":"The plan risks overurbanizing the waterfront and blocking public access.","zh":"该计划可能使滨水区过度城市化，并阻碍公众通行。"}]}],"synonyms":["overdeveloping","urban sprawl (related)","rapid urbanization (related)","overbuilding"],"phonetic":"/ˌoʊvərˈɝːbəˌnaɪzɪŋ/","extraExplanation":["“over-”在英语里常表示“过度、超过适当程度”（如 overwork 过度工作、overuse 过度使用）。因此 overurbanize/overurbanizing 多用于批评语境，强调城市扩张带来的压力（住房、交通、污染、公共服务不均等）。","常见搭配：overurbanizing + area/region/country；或与 without enough housing/infrastructure/jobs 等原因状语连用。"]}
{"word":"overurge","summary":{"en":"To urge or pressure someone excessively.","zh":"过度催促或过分施压。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to urge or press someone too much; to encourage something excessively, often in a way that causes annoyance or harm","zh":"过度催促；过分怂恿/鼓动（常带负面含义，可能让人反感或造成不良后果）"},"examples":[{"en":"Don’t overurge him—he’ll decide when he’s ready.","zh":"别过度催他——他准备好了自然会决定。"},{"en":"The manager overurged the team to work overtime, and morale dropped.","zh":"经理过分催促团队加班，士气反而下降了。"},{"en":"Some ads overurge people to buy things they don’t need.","zh":"有些广告过分怂恿人们购买并不需要的东西。"}]}],"synonyms":["pressure too much","push too hard","overpressure","urge excessively"],"phonetic":"/ˌoʊvərˈɝːdʒ/","extraExplanation":["“overurge”不是高频词，更常见的表达是“pressure someone too much / push too hard / urge excessively”。在正式写作中，用这些更常见的搭配通常更自然。","词形上是 over-（过度）+ urge（催促/敦促），意思直观：把“催促”做得过头。"]}
{"word":"overurged","summary":{"en":"“Overurged” means “urged or pressured too much,” or “pushed too strongly.”","zh":"“overurged”表示“被过度催促/施压”，也可指“被推得太过、过度强调”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “overurge”) to urge or pressure someone too much; to push an idea or action excessively.","zh":"（“overurge”的过去式/过去分词）过度催促；过分施压；把某个想法或行动推得太过。"},"examples":[{"en":"The manager overurged the team, and several people burned out.","zh":"经理对团队过度催促，结果几个人都累到倦怠了。"},{"en":"She felt she had overurged him to accept the offer before he was ready.","zh":"她觉得自己在他还没准备好之前就过分催他接受那个提议了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) pushed or promoted too strongly; overemphasized because of excessive urging.","zh":"（形容词）被过度推动/宣传的；因过分催促而显得被过度强调的。"},"examples":[{"en":"His overurged apology sounded less sincere.","zh":"他那种被“逼出来”的过度道歉听起来不太真诚。"},{"en":"The campaign’s message felt overurged and repetitive.","zh":"那场宣传的讯息给人一种过度推销、重复啰嗦的感觉。"}]}],"synonyms":["pressured too much","pushed too hard","overemphasized","badgered","hounded"],"phonetic":"ˌoʊvərˈɝːdʒd","extraExplanation":["“overurged”在现代英语里非常少见；更常见的表达是“pressured too much / pushed too hard / over-persuaded / overemphasized”。写作时如果想更自然，通常用这些替代。","词根思路：over-（过度）+ urge（催促/力劝）。它的意思很直观，但因为不常用，读者可能会觉得生硬或像“自造词”。"]}
{"word":"overurges","summary":{"en":"“Overurges” means “urges too much”—pressing someone or something excessively.","zh":"“overurges”表示“过度催促/过分施压”，即催得太多、推得太用力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to urge or pressure someone too strongly or too often; to push an idea or request beyond what is reasonable","zh":"过度催促；过分施压；把请求/主张推进得超过合理程度"},"examples":[{"en":"If you overurge your child about grades, they may feel anxious and shut down.","zh":"如果你在成绩上过度催促孩子，他们可能会焦虑，甚至变得抗拒。"},{"en":"The manager overurges the team to work weekends, and morale drops.","zh":"经理过分要求团队周末加班，士气就下降了。"},{"en":"Try to persuade politely—don’t overurge or people will resist.","zh":"尽量礼貌地劝说——别过度施压，否则别人会更抵触。"}]}],"synonyms":["pressure","push","badger","hassle","hound"],"phonetic":"/ˌoʊvɚˈɝːdʒ/","extraExplanation":["“overurges”通常是动词“overurge”的第三人称单数现在时（He/She overurges...）。这个词在现代英语里比较少见，更常见的表达是“pressure too much / push too hard / overpress / badger”。","构词上，“over-”有“过度、超出”的意思（如 overwork 过度工作），加上 urge（催促、敦促）就形成“过度催促/过度敦促”。"]}
{"word":"overurging","summary":{"en":"“Overurging” means urging or pressuring someone too much (a rare word).","zh":"“overurging”指过度催促、过分施压（较少见的用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pushing or pressuring someone too much; urging beyond what is reasonable or helpful.","zh":"过度催促；过分推动（别人），超过合理或有帮助的程度。"},"examples":[{"en":"The manager’s overurging made the team anxious and more likely to make mistakes.","zh":"经理的过度催促让团队很焦虑，也更容易出错。"},{"en":"Overurging a child to perform can take the joy out of learning.","zh":"过分催孩子表现，可能会让学习失去乐趣。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of urging too much; excessive pressure or persuasion (a less common, somewhat informal/rare usage).","zh":"过度催促这一行为；过分施压或劝说（较少见、略偏口语/罕用）。"},"examples":[{"en":"Her overurging didn’t help—he needed time to decide.","zh":"她的过度催促并没有帮助——他需要时间做决定。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overurge”: to urge too much or too strongly (rare).","zh":"“overurge”的现在分词：过分催促/强烈劝说（罕用）。"},"examples":[{"en":"He was overurging his friends to join, even after they said no.","zh":"朋友们已经说不，他还是一再过分催他们加入。"}]}],"synonyms":["pressuring too much","pushing too hard","urging too strongly","badgering","hounding"],"phonetic":"/ˌoʊvɚˈɝːdʒɪŋ/","extraExplanation":["“overurging/overurge”在现代英语里不算常用。更自然的表达通常是：pressuring too much / pushing too hard / urging too strongly / badgering（纠缠式催促）。","语气差异：pushing too hard 比较中性；pressuring 强调施压；badgering 带有负面意味（烦人、纠缠）。"]}
{"word":"overuse","summary":{"en":"Overuse means using something too much or too often, sometimes causing reduced effectiveness, annoyance, or injury.","zh":"Overuse 指过度使用某物或某种表达，可能导致效果变差、让人反感，或造成伤害。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to use something too much or too often, so that it becomes less effective, annoying, or even harmful","zh":"过度使用；使用过多（以至于效果变差、让人反感，甚至有害）"},"examples":[{"en":"If you overuse antibiotics, they may stop working as well.","zh":"如果你过度使用抗生素，它们可能就没那么有效了。"},{"en":"The writer overused the same phrase, so the article felt repetitive.","zh":"作者过度使用同一个短语，所以文章读起来很重复。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use a part of your body too much, causing pain or injury","zh":"（身体部位）使用过度而导致疼痛或受伤"},"examples":[{"en":"She overused her wrist from typing all day and needed rest.","zh":"她整天打字导致手腕过度使用，需要休息。"},{"en":"Overuse injuries are common among runners.","zh":"过度使用造成的伤病在跑步者中很常见。"}]}],"synonyms":["overdo","use excessively","abuse","overwork"],"phonetic":"/ˌoʊvɚˈjus/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”。类似词：overwork（过度工作）、overeat（暴饮暴食）、overthink（想太多）。","“overuse”既可用于具体事物（如药物、资源），也常用于语言表达（如overuse a word/phrase），表示“用烂了、用到让人腻”。"]}
{"word":"overused","summary":{"en":"Overused means used too much—either it feels unoriginal (ideas/words) or it causes strain (body).","zh":"overused 指“使用过度”：要么变得不新鲜（想法/措辞），要么导致劳损（身体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used too much, so it feels boring, weak, or no longer original.","zh":"（因被使用得太多而）陈词滥调的；用滥了的；不新鲜的。"},"examples":[{"en":"The plot felt overused, so the movie didn’t surprise me.","zh":"这个剧情套路太常见了，所以电影没有让我惊喜。"},{"en":"“At the end of the day” is an overused phrase in business meetings.","zh":"“At the end of the day”在商务会议里是个被说烂了的表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used too much, so it becomes tired, sore, or injured (often about muscles or parts of the body).","zh":"（身体部位/肌肉因过度使用而）劳损的；过度疲劳的。"},"examples":[{"en":"My wrist is overused from typing all day.","zh":"我手腕因为整天打字而劳损了。"},{"en":"The doctor said the pain came from an overused shoulder.","zh":"医生说疼痛是肩膀过度使用造成的。"}]}],"synonyms":["clichéd","trite","hackneyed","worn-out","played out","overworked"],"phonetic":"/ˌoʊvɚˈjuzd/","extraExplanation":["“overused”常用于两类语境：①语言/创意（比如梗、比喻、写作套路）——强调“失去新意”；②身体/运动医学——强调“反复用导致劳损”。可替换表达：cliché（更偏“陈词滥调”）、worn-out（更偏“用旧/让人厌倦”）、played out（口语：梗玩烂了）。"]}
{"word":"overuses","summary":{"en":"“Overuses” means uses something too much (verb), or refers to instances of excessive use (plural noun).","zh":"“Overuses”表示“过度使用”（动词第三人称单数），也可作复数名词指“过度使用的情况/例子”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use something too much, too often, or more than is healthy/necessary","zh":"过度使用；用得太多（超过需要或不利于健康/效果）"},"examples":[{"en":"He overuses social media and feels tired all the time.","zh":"他过度使用社交媒体，所以总觉得很疲惫。"},{"en":"If you overuse this cream, your skin may become irritated.","zh":"如果你过度使用这种乳霜，皮肤可能会受到刺激。"},{"en":"The company overuses buzzwords in its advertisements.","zh":"这家公司在广告里过度使用流行词。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) occasions or cases of using something too much","zh":"（复数名词）过度使用的情况；滥用的例子"},"examples":[{"en":"The report lists common overuses of antibiotics.","zh":"这份报告列出了抗生素常见的过度使用情况。"},{"en":"Teachers notice overuses of “like” in some students’ speech.","zh":"老师会注意到一些学生说话时对“like”的过度使用。"}]}],"synonyms":["overutilizes","overapplies","exaggerates","overdoes","abuses"],"phonetic":"/ˌoʊvərˈjuːzɪz/","extraExplanation":["“overuse”强调“用得太多/太频繁”，常用于健康、资源或语言表达（如词语）的语境。","与“misuse（误用/用错）”不同：overuse 是“用过头”，misuse 是“用法不当”。例如：overuse antibiotics（抗生素用太多），misuse antibiotics（把抗生素用在不该用的地方，如感冒）。"]}
{"word":"overusing","summary":{"en":"“Overusing” means using something too much or too often, usually causing problems or reducing effectiveness.","zh":"“overusing”指过度使用某物或使用过频，通常会带来问题或降低效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using something too much, too often, or in a way that causes harm or reduces effectiveness","zh":"过度使用；使用过多或过频（以致有害或降低效果）"},"examples":[{"en":"She is overusing social media and feeling more anxious.","zh":"她过度使用社交媒体，变得更焦虑。"},{"en":"Overusing antibiotics can make them less effective in the future.","zh":"滥用抗生素会让它们将来变得不那么有效。"},{"en":"Try not to keep overusing the same phrase in your writing.","zh":"写作时尽量不要反复过度使用同一个短语。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) describing an action or habit that involves using something too much","zh":"（作形容词）指“过度使用的；使用过多的”"},"examples":[{"en":"His overusing of the speaker system caused it to break.","zh":"他过度使用音响系统，导致它坏了。"},{"en":"The app warns you about overusing screen time late at night.","zh":"这个应用会提醒你深夜屏幕使用过度。"}]}],"synonyms":["overuse","overdo","abuse","excessively use","use too much"],"phonetic":"/ˌoʊvɚˈjuːzɪŋ/","extraExplanation":["“overusing”来自动词“overuse”（over- 表示“过度” + use 表示“使用”）。常见搭配：overuse your phone/social media、overuse antibiotics、overuse muscles（运动中过度使用肌肉）。","写作里也常说 overuse a word/phrase（某个词/短语用得太多），会让表达显得重复或不自然。可以用同义替换或改写句子来避免。"]}
{"word":"overusual","summary":{"en":"“Overusual” (rare/nonstandard) means “more than usual” or “unusually.”","zh":"“overusual”（少见/不规范）表示“比平常更多”或“异常地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More than usual; beyond what is normal or typical. (Rare/nonstandard in modern English; usually replaced by “more than usual” or “unusually.”)","zh":"比平常更多；超出一般或正常范围。（现代英语中很少用/不规范，通常用“more than usual”或“unusually”替代）"},"examples":[{"en":"He seemed overusual quiet today—he hardly spoke at all.","zh":"他今天异常安静——几乎一句话都没说。"},{"en":"We’ve had overusual rain this week, so the roads are muddy.","zh":"这周雨下得比平常多，所以路很泥泞。"}]}],"synonyms":["more than usual","unusually","above average","higher than usual"],"phonetic":"/ˌoʊvərˈjuʒuəl/","extraExplanation":["“overusual”在现代英语里非常少见，很多读者会觉得不自然，甚至当作拼写错误。","想表达“比平常多”，更自然的说法是：more than usual / above average / higher than usual；想表达“异常地”，可用：unusually + adj./adv.（例如：unusually quiet）。"]}
{"word":"overusually","summary":{"en":"Overusually is a rare, old-fashioned adverb meaning “more than usual; unusually; excessively.”","zh":"overusually 是一个罕见的古体副词，意思是“比平常更多地；异常地；过度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/archaic) More than usual; excessively; unusually.","zh":"（罕见/古体）超过平常地；过度地；异常地。"},"examples":[{"en":"He was overusually quiet during the meeting.","zh":"他在会议上异常安静。"},{"en":"The winter was overusually cold that year.","zh":"那一年的冬天格外寒冷。"}]}],"synonyms":["unusually","exceptionally","especially","overly","more than usual"],"phonetic":"/ˌoʊvərˈjuʒuəli/","extraExplanation":["“overusually”在现代英语中几乎不用，多见于较早期的书面语或仿古写法。现代更自然的表达通常是：“especially / unusually / exceptionally / overly / more than usual”。","词形上可理解为 over-（过度）+ usually（通常地），但在当代语感里会显得生硬或不地道，除非你是在模仿旧文风格。"]}
{"word":"overutilize","summary":{"en":"Overutilize means to use something more than necessary, often leading to problems.","zh":"overutilize 指对某物使用过度，超过需要，往往会带来问题。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To use something too much or more than is needed, often causing inefficiency or negative results.","zh":"过度使用；使用过多（常导致效率下降或产生负面效果）。"},"examples":[{"en":"We may be overutilizing staff by scheduling too many long shifts in a row.","zh":"我们可能在过度使用员工，因为连续安排了太多长班次。"},{"en":"The clinic is overutilized during flu season, so patients wait longer.","zh":"流感季节诊所被过度使用，所以病人等待时间更长。"}]}],"synonyms":["overuse","overemploy","overwork","overexploit"],"phonetic":"/ˌoʊvərˈjuːtəˌlaɪz/","extraExplanation":["“overutilize”是“over-（过度）+ utilize（利用）”构成的较正式用词，常见于商业、医疗、资源管理等语境，用来强调“使用超出合理水平”。日常口语里也常用“overuse”（更常见、更口语）。","语感上它不仅表示“用得多”，还常暗含“配置不合理/过度依赖某资源”，比如“overutilize a system, capacity, equipment”。"]}
{"word":"overutilized","summary":{"en":"Overutilized means used too much or too often, especially in a way that reduces effectiveness.","zh":"Overutilized 指“被过度使用/利用”的，常暗示超负荷导致效果变差或损耗增加。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used too much or more often than is helpful, necessary, or effective","zh":"被过度使用的；使用得太频繁或超出必要、有效范围的"},"examples":[{"en":"The word “literally” is often overutilized in casual conversation.","zh":"“literally（字面上）”这个词在日常对话里常常被过度使用。"},{"en":"Overutilized resources can wear out quickly and cost more to maintain.","zh":"被过度使用的资源可能会很快损耗，并增加维护成本。"},{"en":"The overutilized staff needed more support and time off.","zh":"被过度安排、过度使用的人手需要更多支持和休息时间。"}]}],"synonyms":["overused","overworked","overtaxed","overburdened","overstretched"],"phonetic":"/ˌoʊvɚˈjuːtəˌlaɪzd/","extraExplanation":["“overutilized”常用于商业、管理、医疗与工程语境，描述“资源/人员/系统”被用得过头，带来效率下降、疲劳、故障或质量变差。","常见搭配：overutilized staff（人手被用过头）、overutilized equipment（设备过度使用）、overutilized system（系统超负荷）、overutilized jargon/phrase（术语/说法被用烂）。","近义表达的语气差别：overused更口语、常用于词语/表达；overutilized更正式，更强调“利用率过高/超负荷”。"]}
{"word":"overutilizes","summary":{"en":"“Overutilizes” means “uses something too much,” often in a way that causes harm, waste, or inefficiency.","zh":"“Overutilizes”表示“过度使用”，常暗示造成伤害、浪费或低效。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"uses something too much or more than is healthy, fair, or sustainable","zh":"过度使用；使用过多（以至于不健康、不公平或不可持续）"},"examples":[{"en":"The company overutilizes its employees by scheduling too many overtime hours.","zh":"这家公司过度使用员工，让他们排了太多加班。"},{"en":"The hospital overutilizes certain tests, which raises costs for patients.","zh":"这家医院过度使用某些检查，导致病人的费用上升。"},{"en":"This app overutilizes notifications, so users feel overwhelmed.","zh":"这个应用过度使用通知功能，让用户觉得压力很大。"}]},{"partOfSpeech":"v.","definition":{"en":"uses something more than needed or more than planned (often implying inefficiency)","zh":"使用超过需要或超过计划（常含“低效/浪费”之意）"},"examples":[{"en":"He overutilizes data in his slides, making the message hard to follow.","zh":"他在幻灯片里使用了过多数据，让信息难以理解。"},{"en":"The team overutilizes meetings instead of solving issues directly.","zh":"团队过度依赖开会，而不是直接解决问题。"}]}],"synonyms":["overuses","uses excessively","overexploits","relies on too heavily"],"phonetic":"/ˌoʊvərˈjuːtəlaɪzɪz/","extraExplanation":["“overutilizes”是动词“overutilize”的第三人称单数现在时（he/she/it overutilizes）。常用于商业、医疗、资源管理等语境，强调“超过合理限度的使用”。","构词上是 over-（过度）+ utilize（利用/使用）。英语中也常见同义替换“overuse”，更口语、更常用。"]}
{"word":"overutilizing","summary":{"en":"Overutilizing means using something too much or relying on it more than necessary, often causing harm or reduced effectiveness.","zh":"Overutilizing 指过度利用或过度依赖某事物，常带来负面后果或降低效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using something too much or too often, especially in a way that reduces its value, effectiveness, or availability","zh":"过度利用；使用过多或过频（常导致资源减少、效果变差或价值下降）"},"examples":[{"en":"The company is overutilizing its staff, so people are burning out.","zh":"公司在过度使用员工人力，所以大家都快累垮了。"},{"en":"Overutilizing antibiotics can make them less effective over time.","zh":"过度使用抗生素会让它们随着时间变得不那么有效。"},{"en":"We’re overutilizing groundwater, and the water table keeps dropping.","zh":"我们在过度抽取地下水，地下水位一直在下降。"}]},{"partOfSpeech":"v.","definition":{"en":"the act or habit of relying on something more than necessary (often used when talking about systems, tools, or services)","zh":"过度依赖；使用超过必要程度（常用于系统、工具或服务的语境）"},"examples":[{"en":"Overutilizing meetings slows down real work.","zh":"过度开会会拖慢真正的工作。"},{"en":"She worried that overutilizing GPS was weakening her sense of direction.","zh":"她担心过度依赖 GPS 会让自己的方向感变差。"}]}],"synonyms":["overusing","overexploiting","overworking","overrelying on","misusing"],"phonetic":"/ˌoʊvərˈjuːtəˌlaɪzɪŋ/","extraExplanation":["“overutilizing”是动词“overutilize”的现在分词/动名词形式，常用于书面或职场、学术语境。日常口语里也常用“overusing”。","语气上，“overutilize”更强调“把资源/能力榨得太满”（如人力、设备、医疗资源、自然资源），带有管理或资源配置的意味；而“overuse”更通用。"]}
