{"word":"overface","summary":{"en":"Overface means to overwhelm or intimidate someone by giving them a task or situation that feels too difficult.","zh":"Overface 指因任务或情境太难而使人不知所措或胆怯。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to overwhelm, intimidate, or make someone lose confidence by seeming too difficult, powerful, or demanding","zh":"（因太难、太强或要求过高而）使某人不知所措；使胆怯；压倒"},"examples":[{"en":"The exam questions overfaced many students, so they ran out of time.","zh":"这次考试题目把很多学生难住了，所以他们时间不够用。"},{"en":"Try not to overface new employees with too many tasks on the first day.","zh":"别在第一天就给新员工安排太多任务，让他们不知所措。"},{"en":"She looked calm, but the noisy crowd overfaced her at first.","zh":"她看起来很镇定，但一开始嘈杂的人群还是让她有点怯场。"}]},{"partOfSpeech":"vt.","definition":{"en":"to present a challenge that is too difficult for someone, especially in sports or competition","zh":"（尤指在体育/比赛中）让某人面对过于艰难的对手或任务"},"examples":[{"en":"The coach knew the match might overface the younger players.","zh":"教练知道这场比赛可能会让年轻球员压力过大。"},{"en":"Don’t overface yourself—choose a race distance you can train for safely.","zh":"别把自己逼得太紧——选择一个你能安全训练的比赛距离。"}]}],"synonyms":["overwhelm","intimidate","daunt","overawe","unnerve"],"phonetic":"/ˌoʊvɚˈfeɪs/","extraExplanation":["“overface”在英式英语里更常见，意思接近“make someone feel out of their depth（让人觉得自己应付不了）”。在美式英语中更常用的表达有“overwhelm / intimidate / daunt”。"]}
{"word":"overfacile","summary":{"en":"Overly easy or smooth in a way that seems shallow or not well considered.","zh":"过于容易／过于顺口而显得肤浅、欠考虑（多用于批评）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too easy, smooth, or quick—often in a way that seems superficial, overly confident, or not carefully thought through.","zh":"过于轻率／过于顺口（看似很容易、很流畅或很快，但常带有“肤浅、想得不够深、过度自信”的批评意味）。"},"examples":[{"en":"The reviewer criticized the essay for its overfacile optimism and lack of evidence.","zh":"评论者批评这篇文章过于轻率地乐观，而且缺乏证据。"},{"en":"Her overfacile answer sounded polished, but it avoided the real problem.","zh":"她的回答听起来很圆滑，但回避了真正的问题。"},{"en":"Don’t settle for an overfacile explanation—ask what assumptions it hides.","zh":"别满足于过于顺口的解释——要问它掩盖了哪些前提。"}]}],"synonyms":["superficial","glib","pat","oversimplified","shallow"],"phonetic":"/ˌoʊvərˈfæsəl/","extraExplanation":["“overfacile”是较正式、偏书面/评论性的词，常用于批评文章、观点、论证或结论：太“顺”、太“快”、太“好听”，却缺少深度与推理。","它和“simple/clear”不同：simple/clear多为中性或褒义（清楚明了），而overfacile通常是贬义，暗示把复杂问题说得过分容易。","构词上是 over-（过度）+ facile（容易的、流畅的）。英语里 facile 也常带轻微贬义（“太轻巧、太圆滑”），加上 over- 后批评意味更强。"]}
{"word":"overfacilely","summary":{"en":"“Overfacilely” means doing or saying something too easily or too readily, often in a superficial or overly simplistic way.","zh":"“overfacilely”指“过于轻率/过于容易地下结论”，常带“肤浅、简单化”的批评意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly easy or too-ready way, often suggesting shallow understanding or simplistic confidence.","zh":"过于轻率地；过于容易地下结论地（常含“理解肤浅、判断简单化”的意思）。"},"examples":[{"en":"He dismissed the criticism overfacilely, without engaging with the evidence.","zh":"他过于轻率地驳回了批评，并没有认真回应证据。"},{"en":"The article overfacilely claims the problem has a simple solution.","zh":"这篇文章过于草率地声称这个问题有一个简单的解决办法。"}]}],"synonyms":["too easily","too readily","simplistically","glibby","superficially"],"phonetic":"/ˌoʊvɚˈfæsəl̩li/","extraExplanation":["“overfacilely”来自 over-（过度）+ facile（容易的、轻率的）+ -ly（副词后缀）。它比较少见，更常见的表达是“too easily / too readily / simplistically / glibly”。","语气上通常带批评：不是单纯“很容易”，而是“把复杂问题说得太简单、显得轻飘或不够严谨”。","写作中常用于评论观点、论证或态度：例如批评某人把困难当成简单事、对问题缺乏深入分析。"]}
{"word":"overfacility","summary":{"en":"Overfacility means excessive ease or fluency, often implying something is too smooth or effortless and may lack depth.","zh":"overfacility 指过分的熟练与流畅，常暗示表达或作品过于顺滑轻易，可能显得浅薄或不够真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive ease or fluency (especially in speaking, writing, or producing work), sometimes suggesting that something is too smooth, too quick, or not thoughtful enough.","zh":"（尤指说话、写作或做事时）过分的熟练与顺畅；常带有“太轻易、太圆滑、欠缺深度或斟酌”的意味。"},"examples":[{"en":"Some critics felt the novel’s witty dialogue had a touch of overfacility, as if the author never had to struggle for a sentence.","zh":"一些评论家认为这部小说机智的对白带着一点“过分流畅”的感觉，仿佛作者写一句话都不需要费力。"},{"en":"Her overfacility in public speaking sometimes made her sound rehearsed rather than sincere.","zh":"她在公众演讲方面过分娴熟，有时反而显得像排练过的，而不够真诚。"}]}],"synonyms":["excessive fluency","slickness","glibness","too much ease","over-smoothness"],"phonetic":"ˌoʊvərfəˈsɪləti","extraExplanation":["“overfacility”是比较少见、偏书面/评论语境的词，常见于文学批评或艺术评论中，用来指出作品或表达“太顺、太快、太轻松”，因此可能缺少力度、深度或真实感。","词形上可理解为 over-（过度）+ facility（熟练、便利、灵巧）。在日常英语里，人们更常用 “too fluent / too slick / too easy / excessive fluency”等表达同样意思。"]}
{"word":"overfactious","summary":{"en":"“Overfactious” describes a group or situation that is excessively factional and prone to division and quarrels.","zh":"“overfactious”形容过度派系化、爱结党争执并容易制造分裂的群体或局面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too factious; excessively inclined to form factions, argue, or create division within a group.","zh":"过于结党（派系化）的；太爱争执、制造分裂的。"},"examples":[{"en":"The committee became overfactious, so even small decisions turned into long arguments.","zh":"这个委员会变得过于结党争执，以至于连小决定都变成了漫长的争论。"},{"en":"An overfactious political climate makes compromise feel impossible.","zh":"过于派系化的政治氛围会让妥协变得几乎不可能。"}]}],"synonyms":["overly factional","divisive","contentious","quarrelsome","factious"],"phonetic":"ˌoʊvərˈfækʃəs","extraExplanation":["“overfactious”较少见，结构是 over-（过度）+ factious（好结党/好争端的）。更常见的表达是 “too factious”“overly factional”“divisive”。","“factious”通常带贬义，强调“为了派系或争强好胜而制造纷争”，而不只是“有不同意见”。"]}
{"word":"overfactiously","summary":{"en":"“Overfactiously” means ‘in an overly factional/partisan, divisive way.’","zh":"“overfactiously”表示“以过度派系化、过分党派化、容易造成分裂的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively factious way; in a way that shows too much loyalty to a faction or party, often causing division or conflict.","zh":"以过度结党/派系化的方式；表现出对某个派别或阵营过分忠诚，从而引发分裂或冲突。"},"examples":[{"en":"The committee argued overfactiously, so even small decisions became battles.","zh":"委员会争论得过于派系化，连小决定都变成了战场。"},{"en":"Debates can turn overfactiously hostile when people treat every issue as party loyalty.","zh":"当人们把每个议题都当作党派忠诚的考验时，辩论可能会变得过度派系化、充满敌意。"}]}],"synonyms":["overly partisanly","too factionally","divisively","sectarianly"],"phonetic":"/ˌoʊvɚˈfækʃəsli/","extraExplanation":["这个词非常罕见，多见于较旧或非常正式的写作中。通常会用更常见的表达替代，例如：in an overly partisan way / too factionally / in a divisive, partisan manner。","构词上可以理解为 over-（过度）+ factious（好结党、好搞派系的）+ -ly（副词）。其中 factious 常用来批评“为了派系利益而制造分裂”的倾向。"]}
{"word":"overfactiousness","summary":{"en":"Overfactiousness means excessive factionalism or divisiveness within a group.","zh":"overfactiousness 指过度的派系化与分裂倾向（内斗、结党过甚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being excessively factious—too ready to form factions, argue, or create division within a group.","zh":"过度结党与好争的倾向；过分制造分裂、内耗的状态。"},"examples":[{"en":"The committee’s overfactiousness made it hard to agree on even simple rules.","zh":"委员会的过度内耗让大家连简单的规则都很难达成一致。"},{"en":"Leaders warned that overfactiousness could weaken the movement from the inside.","zh":"领导者警告说，过度结党内斗会从内部削弱这场运动。"}]}],"synonyms":["excessive factionalism","divisiveness","partisanship","sectarianism","infighting"],"phonetic":"/ˌoʊvərˈfækʃəsnəs/","extraExplanation":["这个词很少见，通常出现在较正式的政治或历史语境中。它由 over-（过度）+ factious（好结党、爱挑起纷争的）+ -ness（名词后缀）组成。","factious 来自 faction（派系、党派）。在写作中，用 overfactiousness 往往带有批评意味，强调“分裂过头、争斗过多”，而不是正常的意见分歧。"]}
{"word":"overfactitious","summary":{"en":"Overfactitious means excessively artificial or overdone, especially in style or expression.","zh":"overfactitious 指“过于人为、过度矫饰”的，尤用于批评文风或表达显得不自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too artificial, elaborate, or “made-up,” in a way that feels unnatural or forced; overdone.","zh":"过于矫饰的；过分做作的（显得不自然、用力过猛）。"},"examples":[{"en":"The dialogue felt overfactitious, as if every line was trying too hard to sound clever.","zh":"这段对白显得过于矫饰，仿佛每一句都在用力装聪明。"},{"en":"Her apology was so overfactitious that it didn’t seem sincere.","zh":"她的道歉太做作了，所以听起来不真诚。"},{"en":"The essay’s style is overfactitious—more show than substance.","zh":"这篇文章的文风过于矫饰——华而不实。"}]}],"synonyms":["artificial","contrived","affected","overwrought","overly elaborate","strained"],"phonetic":"/ˌoʊvɚfækˈtɪʃəs/","extraExplanation":["这是一个非常少见的词，通常用于批评某种表达“太刻意、太装饰、太不自然”。在日常口语里更常用 artificial / overly elaborate / contrived / affected 来表达类似意思。","词源上可拆为 over-（过度）+ factitious（人为的、非自然形成的）。factitious 常见于较正式或学术语境，指“人为制造的、非天然的”。","语感上，overfactitious 往往带有负面评价：不仅是“精心设计”，而是“设计过头，以至于显假”。"]}
{"word":"overfag","summary":{"en":"“Overfag” is an offensive, homophobic internet insult. Avoid using it; choose neutral alternatives instead.","zh":"“overfag”是带恐同意味的冒犯性网络辱骂语。建议避免使用，改用中性替代表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Offensive, derogatory slang) An internet insult that combines “over-” with the anti-gay slur “fag,” used to attack or mock someone (often implying they are “too” queer, feminine, or attention-seeking).","zh":"（冒犯性、贬义俚语）网络辱骂词，把“over-（过度）”与对同性恋的侮辱性脏话“fag”拼在一起，用来攻击或嘲笑他人（常暗示对方“太”同性恋化、太阴柔或太爱出风头）。"},"examples":[{"en":"That word is a homophobic slur; please don’t use it here.","zh":"那个词是恐同辱骂语；请不要在这里使用。"},{"en":"The moderator removed the comment because it contained an anti-gay slur.","zh":"版主删除了那条评论，因为里面含有恐同辱骂词。"}]}],"synonyms":["slur","homophobic insult"],"phonetic":"/ˈoʊvɚˌfæɡ/","extraExplanation":["这个词包含英语中对男同性恋的侮辱性脏话，因此即使“只是开玩笑”也会造成伤害，很多平台会将其视为仇恨言论而删帖或封禁。","如果你想表达“太夸张/太过火/太招摇”的意思，可以改用中性说法：over-the-top（太夸张）、excessive（过度的）、too much（太过了）、showy（爱炫耀的）、attention-seeking（博关注的）。"]}
{"word":"overfagged","summary":{"en":"“Overfagged” is a vulgar, derogatory insult meaning “too gay/too queer,” and it’s best avoided.","zh":"“overfagged”是粗俗且带恐同色彩的侮辱性说法，意思类似“太同性恋/太酷儿”，应避免使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(vulgar, derogatory slang) Used as an insult meaning “too gay/too queer” or “excessively associated with gay men,” often to mock someone’s appearance, behavior, or a piece of media.","zh":"（粗俗、贬义俚语）用作侮辱，意思是“太同性恋/太酷儿”“过于带有男同性恋色彩”，常用来嘲笑某人的外表、举止或某个作品。"},"examples":[{"en":"That word is a slur—please don’t call anyone “overfagged.”","zh":"那个词是侮辱性用语——请不要用“overfagged”称呼任何人。"},{"en":"Some commenters described the show as “overfagged,” which is a homophobic way to criticize it.","zh":"有些评论者把这部剧说成“overfagged”，这是一种恐同的批评方式。"}]}],"synonyms":["(avoid) homophobic slur","(neutral alternatives) over-the-top","stereotyped","campy (context-dependent)"],"phonetic":"/ˌoʊvɚˈfæɡd/","extraExplanation":["“overfagged”并不是标准英语词汇，常见于网络辱骂语境，由“over-（过度）”+“fag（对男同性恋的侮辱性称呼）”构成，因此整体带有明显恐同与贬损意味。","由于包含侮辱性词根，它在大多数正式场合、校园与职场中都被视为不可接受的仇恨言论。更安全的表达方式是具体说明你不喜欢的点，例如：\"stereotyped\"（刻板化）、\"over-the-top\"（夸张）、\"too sexualized\"（过度性化）、\"not my taste\"（不合我口味）。"]}
{"word":"overfagging","summary":{"en":"“Overfagging” is not a standard word; it is often a misspelling of “overflagging,” or it may be interpreted as offensive slur-based language.","zh":"“overfagging” 不是标准词；常见为 “overflagging”（过度标记/举报）的拼写错误，也可能被理解为带有冒犯性的侮辱用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard / very rare form. Often a misspelling of “overflagging,” meaning marking or reporting content too much (especially on social media).","zh":"非标准/非常少见的写法。常见于把 “overflagging” 拼错，指（在社交媒体等）过度标记或举报内容。"},"examples":[{"en":"We started missing real issues because the system was overflagging harmless posts.","zh":"因为系统过度标记无害内容，我们反而漏掉了真正的问题。"},{"en":"If you meant “overflagging,” try using that spelling—more people will understand it.","zh":"如果你想表达的是 “overflagging”，建议用这个拼法——更多人看得懂。"}]},{"partOfSpeech":"other","definition":{"en":"If intended as “over-” + “fagging,” it can be understood as repeatedly using a homophobic slur or making excessive slur-based insults. This usage is offensive and should be avoided.","zh":"如果原意是 “over-” + “fagging”，可能被理解为反复使用恐同侮辱性词语或进行过度的污蔑式辱骂。这种用法具有冒犯性，应避免使用。"},"examples":[{"en":"The moderator removed the thread because it contained repeated anti-gay slurs.","zh":"版主删除了该讨论串，因为里面反复出现针对同性恋的侮辱性词语。"},{"en":"Use respectful language—insults about someone’s sexuality are harmful.","zh":"请使用尊重的表达——拿他人的性取向来辱骂会造成伤害。"}]}],"synonyms":["overflagging","over-reporting","excessive flagging"],"phonetic":"/ˌoʊvɚˈfæɡɪŋ/","extraExplanation":["“overfagging” 不是常见英语词汇，因此在正式写作、学习或公开场合不建议使用。","如果你想表达的是社交平台里的“过度标记/过度举报”，标准写法通常是 **overflagging**。","词根 **fag** 在不同地区含义差异很大：在英式英语里可指“香烟”（非正式），但在美式英语中它也是针对男同性恋的严重侮辱语。把它组合成新词很容易被理解为冒犯性用语。","如果你告诉我你看到这个词的句子/平台（比如游戏聊天、社媒、论坛），我可以更准确判断它在该语境中的意思。"]}
{"word":"overfaint","summary":{"en":"Overfaint means “too faint/too weak,” and it is a rare, literary or old-fashioned word.","zh":"overfaint 表示“过于微弱/过于虚弱”，属于罕见且偏文学或旧式的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) Too faint or too weak; extremely faint, often used in literary writing.","zh":"（罕见/旧用）过于微弱的；极其虚弱或昏沉的（多见于文学语境）。"},"examples":[{"en":"His voice was overfaint to hear across the room.","zh":"他的声音太微弱了，在房间另一头几乎听不见。"},{"en":"After the long walk, she felt overfaint and had to sit down.","zh":"走了很久之后，她感到虚弱得厉害，只好坐下休息。"}]}],"synonyms":["too faint","extremely faint","very weak","feeble","faint"],"phonetic":"/ˌoʊvərˈfeɪnt/","extraExplanation":["“overfaint”通常是由前缀 over-（表示“过度、太……”）+ faint 组合而成，属于较少见的用法，更常出现在诗歌或较古典的散文中。","现代英语里更常用的表达是 “too faint / extremely faint / very weak”。如果你在当代写作中使用“overfaint”，读者可能会觉得带有古风或不太自然。"]}
{"word":"overfaintly","summary":{"en":"“Overfaintly” means “too faintly/too weakly,” making something hard to notice.","zh":"“overfaintly”表示“过于微弱地/过于淡地/过于轻声地”，以至于不容易察觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too faint, too weak, or too quiet—so much so that it becomes hard to see, hear, feel, or notice clearly.","zh":"过于微弱地；过于淡地；过于轻声地（以至于难以清楚看见、听见、感觉到或注意到）。"},"examples":[{"en":"The message was written overfaintly, so I could barely read it.","zh":"那条信息写得过于淡，我几乎读不出来。"},{"en":"She spoke overfaintly, and the people in the back couldn’t hear her.","zh":"她说话声音过于轻，后排的人听不见。"},{"en":"The scent came overfaintly through the open window.","zh":"气味透过开着的窗户传来，但非常微弱。"}]}],"synonyms":["too faintly","very faintly","so faintly","weakly","dimly","barely"],"phonetic":"/ˌoʊvɚˈfeɪntli/","extraExplanation":["“over-”在这里表示“过度、超过合适程度”。因此 overfaintly 常带有“结果不理想”的暗示：因为太淡/太轻/太弱，导致效果不好（例如看不清、听不见）。","overfaintly 不是很常见；日常表达里更常用 too faintly / very faintly / so faintly 等。"]}
{"word":"overfaintness","summary":{"en":"Overfaintness means excessive faintness or weakness, and more rarely an overly timid attitude.","zh":"overfaintness 指“过度虚弱/晕眩（接近昏厥）”，较少情况下也可指“过分胆怯、过度犹豫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of being too faint, weak, or close to fainting; excessive faintness.","zh":"过度虚弱；过分的晕眩感（接近昏厥的状态）。"},"examples":[{"en":"After the long climb, she had a moment of overfaintness and sat down to rest.","zh":"长时间攀爬之后，她一阵过度虚弱，便坐下休息。"},{"en":"He drank some water to steady himself and fight off the overfaintness.","zh":"他喝了点水稳住自己，抵抗那种过分的晕眩感。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, rare) excessive timidity or lack of courage; being overly hesitant.","zh":"（比喻义，罕见）过分胆怯；过度犹豫不决。"},"examples":[{"en":"Her overfaintness in meetings kept her from sharing good ideas.","zh":"她在会议中过分胆怯，使她无法分享好点子。"},{"en":"Don’t mistake careful planning for overfaintness.","zh":"别把谨慎规划误当成过分胆怯。"}]}],"synonyms":["extreme weakness","faintness","dizziness","lightheadedness","excessive timidity","overcautiousness"],"phonetic":"/ˌoʊvɚˈfeɪntnəs/","extraExplanation":["这是一个非常少见的名词，构词为 over-（“过度”）+ faint（“虚弱/昏厥；胆怯”）+ -ness（名词后缀）。在现代日常英语里更常说 extreme weakness / dizziness / feeling faint，或在比喻义上说 excessive timidity / hesitation。"]}
{"word":"overfaith","summary":{"en":"Overfaith means having too much faith or trust—more than is reasonable.","zh":"overfaith 指过度的信任或信仰，超过合理程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"too much faith or trust in someone or something; belief that is stronger than is reasonable or supported by evidence","zh":"过度的信任；盲目的信仰（超过合理或证据所支持的程度）"},"examples":[{"en":"His overfaith in the new investment cost him a lot of money.","zh":"他对这项新投资的过度信任让他损失了不少钱。"},{"en":"Overfaith can make people ignore warning signs.","zh":"过度信任会让人忽视危险信号。"},{"en":"She warned that overfaith in technology may lead to careless decisions.","zh":"她提醒说，对科技的过度迷信可能会导致草率的决定。"}]}],"synonyms":["blind faith","overconfidence","uncritical trust","misplaced trust"],"phonetic":"/ˌoʊvərˈfeɪθ/","extraExplanation":["“overfaith”不是日常英语里很常见的词，更常见的表达有“blind faith（盲目信仰）”“overconfidence（过度自信）”“misplaced trust（错放的信任）”。","它既可用于宗教语境（对某种教义或神迹的盲信），也常用于日常/商业/科技语境（对产品、制度、他人承诺的过度相信）。","在写作中有时也会写成“over-faith”，但现代用法里不加连字符更常见；如果想更自然，通常改用更常用的替代表达会更地道。"]}
{"word":"overfaithful","summary":{"en":"Overfaithful means “too faithful”—either overly loyal/trusting, or overly literal/rigid in copying an original.","zh":"overfaithful 指“过分忠实”：要么对人过度忠诚/信任，要么对原作过度照搬、过度直译而显得僵硬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too loyal, trusting, or devoted; faithful to an excessive degree (sometimes suggesting poor judgment or lack of independence).","zh":"过分忠诚的；过度信任/依附的（有时暗示缺乏判断力或独立性）。"},"examples":[{"en":"He was overfaithful to his boss and ignored warning signs at the company.","zh":"他对老板过分忠诚，忽视了公司出现的警讯。"},{"en":"Her overfaithful support made it hard for her friends to give honest feedback.","zh":"她过度的支持让朋友们很难坦诚提出意见。"}]},{"partOfSpeech":"adj.","definition":{"en":"too strictly loyal to an original text, rule, or style; overly literal or rigid (often used in writing, translation, or art criticism).","zh":"对原文/规则/风格过于忠实的；过度直译、僵硬的（常用于写作、翻译或艺术评论）。"},"examples":[{"en":"The translation is overfaithful to the original and sounds unnatural in English.","zh":"这份翻译对原文过于忠实，英文读起来不自然。"},{"en":"An overfaithful remake copied every scene but missed the spirit of the story.","zh":"这部过度忠实的翻拍照搬每个镜头，却失去了故事的精神。"}]}],"synonyms":["overly loyal","too devoted","too trusting","overly literal","too rigid","slavishly faithful"],"phonetic":"ˌoʊvərˈfeɪθfəl","extraExplanation":["“over-”表示“过度、过分”。因此 overfaithful 往往带一点批评意味：不是单纯称赞“忠诚”，而是强调“忠诚到影响判断/表达自然度”。","在翻译语境里，overfaithful 常对应“过度直译/死译”，强调形式上很像原文，但目标语言的自然表达与语气可能受损。"]}
{"word":"overfaithfully","summary":{"en":"“Overfaithfully” means doing something too faithfully—so loyal or obedient that it becomes excessive or unwise.","zh":"“overfaithfully”表示“过分忠实地/过分遵从地”，强调忠诚或照做到了不明智、不灵活的程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too loyal, too trusting, or too strict about following someone or something; excessively faithfully.","zh":"以过于忠诚、过于信任或过于严格遵从的方式；过分地忠实。"},"examples":[{"en":"He overfaithfully followed the instructions, even when they clearly didn’t fit the situation.","zh":"他过分地照着说明做，即使很明显这些说明并不适用于当下情况。"},{"en":"She overfaithfully defended her friend and ignored the evidence.","zh":"她过分地为朋友辩护，甚至无视证据。"}]}],"synonyms":["too faithfully","overly faithfully","blindly","unquestioningly","obediently"],"phonetic":"/ˌoʊvɚˈfeɪθfəli/","extraExplanation":["“overfaithfully”并不是高频词，更多是写作中为了强调“忠实到过头/遵从到僵化”而临时构造出来的副词。日常表达里更常用：“too faithfully / overly faithfully / blindly / unquestioningly”。","语气通常带有批评或提醒：忠诚本身是优点，但“over-”暗示超出合理范围，可能导致不灵活、盲从或判断失衡。"]}
{"word":"overfaithfulness","summary":{"en":"Overfaithfulness means being too faithful or too literal—so accurate or loyal that it becomes unhelpful, awkward, or unclear.","zh":"Overfaithfulness 指“过度忠实/过度忠诚”，准确或遵从到反而不合适、别扭或不清楚的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too faithful or too loyal; loyalty or accuracy that goes beyond what is helpful or appropriate","zh":"过度忠诚；过分忠实（忠诚或准确到了不合时宜、反而不太有帮助的程度）"},"examples":[{"en":"His overfaithfulness to the rules made teamwork difficult.","zh":"他对规则的过度遵从让团队合作变得困难。"},{"en":"In translation, overfaithfulness can produce sentences that sound unnatural in English.","zh":"在翻译中，过度忠实可能会让句子在英语里听起来不自然。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in writing or translation) an excessive attempt to copy the original wording or structure exactly, even when the result is awkward or unclear","zh":"（尤指写作或翻译中）对原文措辞或结构的过分照搬，导致表达别扭或不清晰"},"examples":[{"en":"The article reads like a literal translation; its overfaithfulness hides the author’s real meaning.","zh":"这篇文章读起来像直译；它的过度忠实反而遮住了作者真正的意思。"},{"en":"A good editor balances accuracy with readability to avoid overfaithfulness.","zh":"好的编辑会在准确与可读性之间取得平衡，避免过度忠实。"}]}],"synonyms":["excessive loyalty","over-literalness","literalism","rigidity","overaccuracy"],"phonetic":"/ˌoʊvɚˈfeɪθf(ə)lnəs/","extraExplanation":["“overfaithfulness”不是非常常见的日常词，更常见的说法是“being too faithful / overly faithful”，或在翻译领域说“over-literalness（过度直译）”。","在翻译与写作中，英语里常强调“自然（natural）”与“可读性（readability）”。因此有时“忠实”并不等于逐字逐句照搬，而是更重视把意思清楚、得体地表达出来。"]}
{"word":"overfall","summary":{"en":"Overfall usually means a sudden drop or turbulent area in moving water (river or sea); rarely, it can mean to come upon or attack suddenly.","zh":"overfall通常指水流的落差急流或海上潮流交汇形成的乱流险区；较少见时也可作动词表示突然降临或袭击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden descent or drop in a river, canal, or current, often creating rough water (a rapid or small waterfall-like place).","zh":"（河流、运河或水流的）骤降处；常形成急流或类似小瀑布的水段。"},"examples":[{"en":"The boat rocked as it passed the overfall near the bend.","zh":"船经过弯道附近的那段落差急流时剧烈摇晃。"},{"en":"Fishermen avoid the overfalls when the tide is strong.","zh":"潮水很急时，渔民会避开那些急流险段。"}]},{"partOfSpeech":"n.","definition":{"en":"(of the sea) a turbulent area where tides or currents meet, producing short, steep, breaking waves.","zh":"（海上）潮流或海流交汇造成的紊乱水域；会出现短而陡、易破碎的浪。"},"examples":[{"en":"The charts warned of dangerous overfalls at the channel entrance.","zh":"海图警告在航道入口处有危险的潮流交汇险区。"},{"en":"Small boats should keep clear of overfalls during storms.","zh":"风暴期间，小船应远离那种乱流险区。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare/old-fashioned) to attack or overwhelm someone suddenly; to come upon unexpectedly.","zh":"（罕见/旧式）突然袭击；猝然压倒；意外降临。"},"examples":[{"en":"They were overfallen by bandits on the road. (old use)","zh":"他们在路上遭到强盗突然袭击。（旧用法）"},{"en":"A strange silence overfell the room.","zh":"一种奇异的寂静突然笼罩了房间。"}]}],"synonyms":["rapid","shoal","whitewater","turbulence","breaker zone","attack (rare/old)","assail (rare/old)"],"phonetic":"/ˈoʊvərˌfɔl/","extraExplanation":["“overfalls”在航海与海图里很常见，指潮汐与海流在浅滩、海峡口等地形处相互作用，造成紊乱浪与暗涌；对小型船只尤其危险。","动词用法在现代英语里较少见，现代更常用的表达是 be overcome by / be struck by（被……突然压倒/袭来）或 be attacked suddenly（突然遭袭）。"]}
{"word":"overfallen","summary":{"en":"Overfallen is an archaic/literary word meaning suddenly attacked or unexpectedly overtaken (often by sleep, fear, or grief).","zh":"overfallen 为古雅/文学用语，表示“突然遭袭”或“被某种感觉/事件意外地压上来”（常指睡意、恐惧、悲痛等突然袭来）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic/literary) Suddenly attacked or seized; overtaken unexpectedly (often by sleep, fear, or misfortune).","zh":"（古雅/文学用语）突然遭到袭击或侵袭；被意外地“压上来”（常指睡意、恐惧、不幸等突然袭来）。"},"examples":[{"en":"She was overfallen with sleep after the long journey.","zh":"长途旅行后，她突然困意袭来。"},{"en":"The village was overfallen by enemies at dawn.","zh":"村庄在拂晓时分遭到敌人突袭。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of overfall: to attack or overwhelm suddenly; to come upon unexpectedly.","zh":"overfall 的过去分词：突然袭击；突然压倒/侵袭；出其不意地发生在……身上。"},"examples":[{"en":"Travelers were overfallen on the road and robbed.","zh":"旅人在路上遭到袭击并被抢劫。"},{"en":"He felt overfallen by grief when he heard the news.","zh":"他听到消息时，悲痛猛然袭来。"}]}],"synonyms":["overtaken","overcome","overwhelmed","assailed","attacked"],"phonetic":"/ˌoʊvərˈfɔlən/","extraExplanation":["“overfallen”在现代英语中很少单独使用，多见于较旧或文学体（如“overfallen with sleep / with sorrow”）。日常表达里更常用 overtaken, overcome, overwhelmed, attacked 等。","词根上可以理解为 over-（压过、覆盖）+ fall（落下），带有“某种力量突然落到身上”的画面感。"]}
{"word":"overfalling","summary":{"en":"“Overfalling” usually means “attacking/overwhelming suddenly,” and less commonly describes water “cascading or surging over an edge.”","zh":"“Overfalling”通常指“突然袭击/猝然压倒”，较少见的用法是形容水流“越过边缘倾泻或翻涌”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"attacking or overwhelming suddenly; coming upon someone by surprise (present participle of “overfall”).","zh":"突然袭击；猝然压倒、扑向（动词 overfall 的现在分词）。"},"examples":[{"en":"The travelers were overfalling the camp with panic when they heard footsteps in the dark.","zh":"旅人听到黑暗中的脚步声时，恐慌突然袭来，仿佛一下子扑向营地。"},{"en":"In the story, the hero is overfalling his enemies before they can react.","zh":"在故事里，英雄趁敌人来不及反应就突然发动袭击。"}]},{"partOfSpeech":"adj.","definition":{"en":"flowing down or surging over an edge; cascading or rushing (often used about water).","zh":"（水等）越过边缘倾泻而下；翻涌、奔泻（常用于描写水流）。"},"examples":[{"en":"We watched the overfalling water spill into the rocks below.","zh":"我们看着水流倾泻而下，冲到下面的岩石间。"},{"en":"Mist rose from the overfalling stream after the rain.","zh":"雨后，小溪奔泻，水雾随之升起。"}]}],"synonyms":["ambushing","assaulting","overwhelming","surging","cascading"],"phonetic":"/ˌoʊvərˈfɔlɪŋ/","extraExplanation":["“Overfall”在现代英语里不算常用：日常更常见的是“attack suddenly / ambush / overwhelm”。但在文学描写中，“overfalling”可以用来营造“突如其来、压迫感很强”的氛围。","航海/地理语境里有名词“overfalls”（常用复数），指因潮汐或海底地形造成的“急流、浪涌、翻滚水域”。在这类语境下，你也可能见到描述水流的“overfalling”。"]}
{"word":"overfamed","summary":{"en":"Overfamed means ‘too famous’ or ‘more celebrated than deserved.’","zh":"overfamed 指“过于出名/名过其实”，暗示名声超过应得程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too famous; praised or talked about more than is deserved.","zh":"过于出名的；被过度赞美或过度谈论的（常含“名过其实”的意思）。"},"examples":[{"en":"Some critics call the novel overfamed, arguing its style is more impressive than its story.","zh":"一些评论家称这部小说“过于出名”，认为它的文风比故事本身更出彩。"},{"en":"The restaurant is a bit overfamed—good, but not worth a two-hour wait.","zh":"这家餐厅有点名过其实——不错，但不值得等两小时。"}]}],"synonyms":["overhyped","overrated","too famous","overcelebrated"],"phonetic":"/ˌoʊvɚˈfeɪmd/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、太……”。因此 overfamed 字面意思就是“过度出名”。在实际使用中它比较少见，写作里更常用 overhyped（被过度炒作的）、overrated（被高估的）、too famous（太有名）来表达类似意思。","overfamed 常带有评价色彩：不是单纯“很有名”，而是暗示“名声超过了实际价值/质量”。"]}
{"word":"overfamiliar","summary":{"en":"“Overfamiliar” describes behavior that is too friendly or informal, in a way that feels disrespectful or inappropriate.","zh":"“overfamiliar”指过分熟络或随便，到了让人觉得不尊重、不得体或越界的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too friendly or informal in a way that shows a lack of respect, appropriate distance, or social boundaries.","zh":"过于熟络（过分亲近/随便）以至于显得不尊重或越界。"},"examples":[{"en":"He was overfamiliar with the staff, calling them by nicknames on the first day.","zh":"他第一天就给员工起外号，显得过于熟络、很不合适。"},{"en":"Her overfamiliar tone made the email feel unprofessional.","zh":"她邮件里过于随便的语气让人觉得不专业。"},{"en":"Don’t be overfamiliar with people you’ve just met—start politely.","zh":"别对刚认识的人过于熟络——先从礼貌开始更好。"}]}],"synonyms":["overly familiar","presumptuous","impertinent","too familiar","forward"],"phonetic":"/ˌoʊvərfəˈmɪljɚ/","extraExplanation":["“overfamiliar”常带负面评价，强调“越界感”：不是单纯“很友好”，而是友好到让人不舒服，像是太快进入私密话题、随便开玩笑、使用过于亲昵的称呼等。","在职场、客服、师生关系等情境中更常见：英语文化里对称呼、玩笑尺度、个人空间（personal space）比较敏感，太快“套近乎”容易被认为不专业或不尊重。","拼写上常见变体是“over-familiar”（加连字符）或“overly familiar”（用副词overly）。含义接近，但“overfamiliar”更像一个整体形容词。"]}
{"word":"overfamiliarity","summary":{"en":"Overfamiliarity means being too friendly or informal in a way that crosses boundaries.","zh":"overfamiliarity 指过分熟络、过度随便，以至于越界或显得不尊重/不专业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Being too friendly or informal with someone, especially in a way that feels disrespectful, unprofessional, or intrusive.","zh":"对某人过分熟络、过度随便（常让人觉得不尊重、不专业或越界）。"},"examples":[{"en":"The manager complained about the intern’s overfamiliarity with clients.","zh":"经理抱怨那位实习生对客户过分熟络。"},{"en":"Her overfamiliarity made some coworkers uncomfortable in a formal workplace.","zh":"在正式的工作场合，她过度随便的态度让一些同事感到不舒服。"},{"en":"He apologized for his overfamiliarity and promised to keep things professional.","zh":"他为自己的过分熟络道歉，并承诺会保持专业。"}]}],"synonyms":["overfriendliness","presumption","forwardness","lack of boundaries","impropriety"],"phonetic":"/ˌoʊvərfəˈmɪliˌærəti/","extraExplanation":["这个词通常带有负面评价，强调“边界感”被打破：比如对上司/客户用过于亲昵的称呼、开私人玩笑、触碰他人身体、或在不熟的关系中过度打听隐私。","常见搭配：show/display overfamiliarity（表现得过分熟络），complain about overfamiliarity（抱怨过分熟络），a sense of overfamiliarity（过分熟悉/随便的感觉）。","语气上比 friendly/informal 更强、更“越界”。如果你想表达中性或正面，可以用 friendliness（友善）、warmth（热情）、approachable manner（平易近人的态度）。"]}
{"word":"overfamiliarly","summary":{"en":"“Overfamiliarly” means acting or speaking in a way that is too familiar or personal, often making others uncomfortable.","zh":"“overfamiliarly”指言行过于熟络或过于私人化，常让人不舒服或觉得不合适。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too friendly, too personal, or too casual—often in a way that seems disrespectful or inappropriate.","zh":"以过于熟络、过于亲昵或过于随便的方式（常带有不尊重或不合适的感觉）。"},"examples":[{"en":"He spoke to the professor overfamiliarly, calling her by her first name on the first day.","zh":"他对教授说话过于熟络，第一天就直接叫她的名字。"},{"en":"The waiter leaned in and joked overfamiliarly with customers who didn’t know him.","zh":"那位服务员凑近顾客开玩笑，但对素不相识的顾客来说显得过于熟络。"},{"en":"She smiled politely, but his overfamiliarly friendly comments made her uncomfortable.","zh":"她礼貌地微笑，但他那些过于熟络的友好评论让她感到不舒服。"}]}],"synonyms":["too familiarly","overfriendly","overly casually","too informally","presumptuously"],"phonetic":"/ˌoʊvɚfəˈmɪljɚli/","extraExplanation":["“overfamiliarly”通常带负面语气，强调越界：在职场、课堂、服务场景或刚认识的人之间，过度随便可能被解读为不礼貌、轻浮，甚至带有冒犯。更中性的说法可用“too casually / too personally”。"]}
{"word":"overfamous","summary":{"en":"Overfamous means “too famous,” often implying excessive attention or overexposure.","zh":"overfamous 表示“过于有名”，常带“曝光过度、关注过头”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Too famous; famous to an excessive or annoying degree.","zh":"（非正式）过于有名的；名气大到过头（有时带反感或吐槽语气）。"},"examples":[{"en":"That song is so overfamous that I can’t escape it—it's in every café and every video.","zh":"那首歌太“过火地有名”了，我根本躲不掉——每家咖啡店、每个视频里都有。"},{"en":"He’s a good actor, but he’s become overfamous, so people focus on his private life instead of his work.","zh":"他是个好演员，但他现在名气过大了，人们反而更关注他的私生活而不是作品。"}]}],"synonyms":["too famous","overly famous","overexposed","widely known","mega-famous"],"phonetic":"/ˌoʊvɚˈfeɪməs/","extraExplanation":["“overfamous”不是非常标准的词，更常见的表达是：“too famous / overly famous / overexposed / wildly famous”。在社交媒体语境里，人们有时会用“over- + 形容词”临时造词来强调“过度”。","前缀“over-”常表示“过度、超过应有程度”，例如：overconfident（过度自信）、overworked（过度劳累）、overrated（被高估）。因此“overfamous”也能被母语者理解，但在正式写作中建议换成更常用的说法。"]}
{"word":"overfanciful","summary":{"en":"Overfanciful means overly imaginative or decorative in an unrealistic or impractical way.","zh":"overfanciful 指“过于幻想或过分花哨”，以至于显得不现实或不切实际。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too imaginative or decorative in a way that feels unrealistic, exaggerated, or not practical.","zh":"过于幻想的；过分花哨而显得不现实或不切实际的。"},"examples":[{"en":"The proposal was creative, but some details were overfanciful and hard to implement.","zh":"这个提案很有创意，但有些细节过于幻想，难以落地实施。"},{"en":"Her story was charming, though a bit overfanciful for a serious report.","zh":"她的故事很迷人，不过对于一份严肃的报告来说有点过于天马行空。"}]}],"synonyms":["overimaginative","too fanciful","overly whimsical","far-fetched","impractical"],"phonetic":"/ˌoʊvɚˈfæn.sɪ.fəl/","extraExplanation":["“overfanciful”由前缀 over-（过度）+ fanciful（富于幻想的）构成，常带轻微批评语气，强调“想象力用过头了”，尤其是在需要现实、清晰或可操作的场合（如计划、论证、预算、报告）。","与“whimsical（古怪有趣的）”相比，“overfanciful”更强调“过度”导致不切实际；与“imaginative（富有想象力的）”相比，它通常不是褒义。"]}
{"word":"overfancifully","summary":{"en":"“Overfancifully” means in an overly imaginative or unrealistically fancy way.","zh":"“overfancifully”表示“以过度想象或不切实际地花哨的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively imaginative, decorative, or unrealistically “fancy” way.","zh":"以过于富于想象、过度装饰或不切实际地“花哨”的方式。"},"examples":[{"en":"The story is told overfancifully, so it’s hard to tell what really happened.","zh":"这个故事讲得过于天马行空，所以很难分辨到底发生了什么。"},{"en":"She described the city overfancifully, as if every street were a fairy tale.","zh":"她把那座城市描述得过于梦幻，好像每条街都像童话一样。"}]}],"synonyms":["overimaginatively","too fancifully","overly romantically","ornately","floridly"],"phonetic":"ˌoʊvɚˈfæn.sɪ.fəl.i","extraExplanation":["“overfancifully”= over-（过度）+ fanciful（富于想象的/花哨的）+ -ly（副词）。常带轻微批评意味：不是“很有创意”，而是“想象过头、不够真实或过度渲染”。","在写作/评论里常用来提醒：表达可能夸张、装饰性太强，导致可信度下降。"]}
{"word":"overfancifulness","summary":{"en":"Overfancifulness means being too fanciful or imaginative, to the point of seeming unrealistic or impractical.","zh":"overfancifulness 指“过分幻想/过分花哨”，以至于显得不真实或不实用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too fanciful or imaginative in a way that feels unrealistic, overly decorative, or not practical.","zh":"过分幻想（或过分花哨、不切实际）的特质；过度的想象性。"},"examples":[{"en":"The story’s overfancifulness made it hard to take the characters’ problems seriously.","zh":"这个故事过分幻想，让人很难认真看待人物的困境。"},{"en":"Some readers loved the book’s overfancifulness, but others wanted a more realistic plot.","zh":"有些读者喜欢这本书的过分幻想感，但也有人想要更现实的情节。"},{"en":"In a business proposal, overfancifulness can distract from the main idea.","zh":"在商业提案中，过分花哨的想象可能会分散对核心观点的注意力。"}]}],"synonyms":["excessive fancifulness","overimagination","whimsy (often positive, but can be excessive)","flights of fancy (phrase)","unrealistic idealism"],"phonetic":"ˌoʊvɚˈfæn.sɪ.fəl.nəs","extraExplanation":["这个词比较少见，但结构很透明：over-（过度）+ fanciful（富于幻想的/花哨的）+ -ness（名词后缀，表示“……的性质/状态”）。意思通常带一点负面评价：不是“有想象力”本身不好，而是“太过头”，导致不真实、不实用或显得矫饰。","近义对比：imagination（想象力，偏中性/正面）≠ overfancifulness（过度幻想，常带批评）。在写作评价里，它常用来指出作品“华丽但不落地”或“设定太飘”。"]}
{"word":"overfancy","summary":{"en":"“Overfancy” means too fancy or overly elaborate; less commonly, it can mean to make something too fancy.","zh":"“overfancy”表示“过于花哨、过分繁复”；较少见时也可作动词，表示“把……弄得太花哨”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too fancy or too elaborate in style; more decorative or complicated than is appropriate.","zh":"过于花哨的；过分讲究装饰或形式（以至于不合适）。"},"examples":[{"en":"The design is nice, but the gold trim makes it feel overfancy for a classroom.","zh":"设计不错，但金色饰边让它对教室来说显得过于花哨。"},{"en":"She worried her speech sounded overfancy and hard to understand.","zh":"她担心自己的演讲听起来太过华丽，反而不好理解。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something too fancy; to add unnecessary decoration or complexity (less common).","zh":"把……弄得过于花哨；过度装饰或复杂化（较少见）。"},"examples":[{"en":"Don’t overfancy the message—keep it clear and simple.","zh":"别把信息写得太花哨——保持清晰简单就好。"}]}],"synonyms":["overly fancy","too fancy","over-elaborate","ornate","showy"],"phonetic":"/ˌoʊvɚˈfænsi/","extraExplanation":["“over-”这个前缀常表示“过度、超过需要的程度”，比如 overcook（煮过头）、overthink（想太多）。因此 overfancy 通常带有“本来可以更朴素/更清楚，但被装饰得过头”的评价色彩。","overfancy 不是非常常见的标准词；口语和写作中也常用 too fancy / overly fancy / too ornate 来表达类似意思。"]}
{"word":"overfar","summary":{"en":"“Overfar” means “too far” or “overly distant,” and is mostly used in archaic or poetic English.","zh":"“overfar”表示“太远/过于遥远”，多见于古语或诗歌式英语表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic/poetic) Too far; excessively far away or beyond a proper limit.","zh":"（古语/诗歌用语）太远；过于遥远或超出适当范围。"},"examples":[{"en":"Don’t wander overfar from the main road.","zh":"不要离主路走得太远。"},{"en":"His ambitions reached overfar, and he lost what he already had.","zh":"他的野心伸得太远，结果失去了原本拥有的东西。"},{"en":"In old poems, you may read of travelers who journeyed overfar into the wild.","zh":"在一些旧诗里，你可能会读到旅人走得太远，深入荒野。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic/poetic) Very distant; farther than is suitable or expected.","zh":"（古语/诗歌用语）非常遥远的；远得不合适或不如预期的。"},"examples":[{"en":"They spoke of an overfar land across the sea.","zh":"他们谈起海那边一个遥远的国度。"},{"en":"An overfar journey can be dangerous without supplies.","zh":"没有补给就进行过于遥远的旅程会很危险。"}]}],"synonyms":["too far","overly far","far too far","too distant","remote"],"phonetic":"/ˌoʊvɚˈfɑr/","extraExplanation":["“overfar”由 over（过度、超过）+ far（远）构成，意思直观相当于“too far / overly far”。在现代英语里较少见，多出现在古英语风格、诗歌或刻意的文学表达中。日常表达通常用 too far、far too far、too distant 等。"]}
{"word":"overfast","summary":{"en":"Overfast means ‘too fast’ or ‘at an excessively fast speed.’","zh":"overfast 表示“过快的”或“过快地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too fast; faster than is safe, correct, or comfortable","zh":"过快的；快得过头（不安全、不合适或让人不舒服）"},"examples":[{"en":"The video plays overfast, so it’s hard to read the subtitles.","zh":"这个视频播放得太快了，所以很难看清字幕。"},{"en":"If you drive overfast on this road, you could lose control around the curves.","zh":"如果你在这条路上开得过快，在弯道处可能会失控。"}]},{"partOfSpeech":"adv.","definition":{"en":"at an excessively fast speed","zh":"过快地；太快地"},"examples":[{"en":"You’re speaking overfast—could you slow down a little?","zh":"你说得太快了——能不能慢一点？"},{"en":"The machine is running overfast and making a strange noise.","zh":"机器转得太快了，发出奇怪的声音。"}]}],"synonyms":["too fast","overly fast","excessively fast","too quickly","at high speed"],"phonetic":"/ˌoʊvɚˈfæst/","extraExplanation":["“over-” 是英语里很常见的前缀，常表示“过度、超过需要/正常范围”。因此 overfast 直观上就是“快过头”。日常口语里更常见的说法是 “too fast” 或 “overly fast”。"]}
{"word":"overfastidious","summary":{"en":"Overly picky or demanding about details; too fastidious.","zh":"过分挑剔、对细节要求过高的；太讲究的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too fastidious; overly picky or hard to please, especially about small details, cleanliness, or correctness.","zh":"过分挑剔的；对细节、清洁或正确性要求过高、难以取悦的。"},"examples":[{"en":"He’s overfastidious about grammar, correcting everyone in casual conversation.","zh":"他对语法过分挑剔，在闲聊时也总纠正别人。"},{"en":"The manager was overfastidious about the layout of the report, even though the data were clear.","zh":"经理对报告版式过于吹毛求疵，尽管数据已经很清楚。"}]}],"synonyms":["overly picky","nitpicky","overly meticulous","fussy","hypercritical"],"phonetic":"/ˌoʊvərfæˈstɪdiəs/","extraExplanation":["这个词比较少见、偏书面/正式语体。更常见的表达是“too fastidious / overly picky / overly meticulous / nitpicky”。","构词上是 over-（过度）+ fastidious（挑剔的、讲究的）。fastidious 本身可指“爱整洁、讲究品味”，但加上 over- 往往带负面评价：让人觉得“太过了”。"]}
{"word":"overfastidiously","summary":{"en":"“Overfastidiously” means doing something in an overly picky or overly meticulous way.","zh":"“overfastidiously”表示做事过于挑剔或过度讲究细节。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively picky, hard-to-please, or overly meticulous way.","zh":"以过于挑剔、难以取悦或过度讲究细节的方式。"},"examples":[{"en":"He overfastidiously corrected every tiny grammar mistake in the email.","zh":"他过于挑剔地纠正邮件里每一个细小的语法错误。"},{"en":"She arranged the books overfastidiously, measuring the gaps between them.","zh":"她过度讲究地摆放书本，甚至量每本书之间的间距。"},{"en":"Don’t judge your first draft overfastidiously—revise it later.","zh":"别对初稿过于吹毛求疵——之后再修改。"}]}],"synonyms":["overmeticulously","overly punctiliously","overly fussy","hypercritically","too fastidiously"],"phonetic":"/ˌoʊvɚfæˈstɪdiəsli/","extraExplanation":["这是由前缀 over-（“过度地、太……”）+ fastidious（“挑剔的、讲究的”）+ -ly（副词后缀）构成的词。它比 fastidiously 更强调“过头了”的感觉，常带轻微负面评价，暗示标准不必要地苛刻或耗时。"]}
{"word":"overfastidiousness","summary":{"en":"Overfastidiousness means being overly picky or too concerned with minor details or cleanliness.","zh":"overfastidiousness 指“过度挑剔/过分讲究”，对小细节或洁净等要求超出合理程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive fastidiousness; being too picky or overly concerned with small details, cleanliness, correctness, or rules.","zh":"过度挑剔（过分讲究细节、洁净、正确性或规矩）。"},"examples":[{"en":"Her overfastidiousness about grammar made casual conversations feel like exams.","zh":"她对语法的过度挑剔让日常聊天变得像考试。"},{"en":"A little care is helpful, but overfastidiousness can slow the whole team down.","zh":"适度认真有帮助，但过度讲究会拖慢整个团队。"},{"en":"His overfastidiousness about the kitchen kept him from enjoying cooking with friends.","zh":"他对厨房卫生的过度讲究让他难以享受和朋友一起做饭。"}]}],"synonyms":["excessive pickiness","overcriticalness","finickiness","over-scrupulousness"],"phonetic":"/ˌoʊvərfæˈstɪdiəsnəs/","extraExplanation":["这个词由 over-（过度）+ fastidious（挑剔的、爱讲究的）+ -ness（名词后缀）构成，强调“超过正常或合理程度”的挑剔。","语气通常带轻微负面评价：不是“认真负责”，而是“太讲究、太难伺候”，常用于描述性格或工作风格。"]}
{"word":"overfasting","summary":{"en":"“Overfasting” means fasting excessively—too long or too often—so it may harm your health.","zh":"“overfasting”指过度断食：断食时间过长或频率过高，可能对健康有害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive fasting (not eating for too long or too often), especially in a way that may harm your health.","zh":"过度禁食／过度断食（不吃东西时间太长或频率太高），尤指可能伤害健康的做法。"},"examples":[{"en":"Overfasting can leave you tired, dizzy, and unable to focus.","zh":"过度禁食可能会让你疲倦、头晕、难以集中注意力。"},{"en":"Her doctor warned that overfasting could make her anemia worse.","zh":"医生警告她，过度禁食可能会让贫血更严重。"},{"en":"Some people confuse healthy fasting with overfasting.","zh":"有些人把健康的断食和过度禁食混为一谈。"}]},{"partOfSpeech":"v.","definition":{"en":"fasting too much or too long.","zh":"禁食过度；断食过久。"},"examples":[{"en":"He was overfasting to lose weight quickly.","zh":"他为了快速减重而禁食过度。"},{"en":"If you’re overfasting, you may need to shorten your fasting window.","zh":"如果你断食过度，可能需要缩短断食时间。"}]}],"synonyms":["excessive fasting","fasting too long","overdoing fasting"],"phonetic":"ˌoʊvɚˈfæs.tɪŋ","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当范围”（如 overwork 过劳、overeat 暴饮暴食）。因此 overfasting 直观含义就是“断食过头”。","这个词在正式词典里不一定常见，但在健康、健身与饮食讨论（尤其是间歇性断食 intermittent fasting）中会被用来提醒“不要做得过度”。更常见的替代表达包括: excessive fasting（过度禁食）、fasting too long（断食太久）。","涉及饮食或宗教性禁食时，英语里通常会强调“适度与安全”。如果用于医疗或健康语境，建议搭配医生/营养师建议来表达更自然、更谨慎。"]}
{"word":"overfat","summary":{"en":"“Overfat” is a rare, informal adjective meaning excessively fat; “overweight” is more common and less judgmental.","zh":"“overfat”是一个较少见、偏非正式的形容词，表示过胖；更常用且更中性的说法是“overweight”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) Excessively fat; having more body fat than is healthy or desired.","zh":"（罕见，非正式）过胖的；脂肪过多的（超过健康或理想范围）。"},"examples":[{"en":"The doctor warned that he was overfat and needed to change his diet.","zh":"医生警告他说他过胖，需要调整饮食。"},{"en":"This term can sound judgmental; many people prefer “overweight.”","zh":"这个词可能听起来带有评判性；很多人更倾向用“overweight（超重）”。"}]}],"synonyms":["overweight","obese","heavy","fat (informal)"],"phonetic":"/ˌoʊvɚˈfæt/","extraExplanation":["“overfat”在日常英语里不常用，更常见的是“overweight（超重）”“obese（肥胖）”。在谈论身材/健康时，英语里通常会选择更中性、更尊重的表达（例如在医疗语境中用“overweight/obese”，在日常对话中可说“gain weight/put on weight”）。"]}
{"word":"overfatigue","summary":{"en":"Overfatigue means extreme, excessive tiredness from overwork or overexertion.","zh":"Overfatigue 指因过度劳累或过度消耗导致的极度疲劳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"extreme tiredness caused by too much work, stress, or activity; excessive fatigue.","zh":"因过度工作、压力或活动导致的极度疲劳；过度疲劳。"},"examples":[{"en":"The doctor warned that overfatigue can weaken your immune system.","zh":"医生警告说，过度疲劳会削弱你的免疫系统。"},{"en":"After weeks of overtime, she felt deep overfatigue and could hardly focus.","zh":"连续加班几周后，她感到严重的过度疲劳，几乎无法集中注意力。"}]}],"synonyms":["exhaustion","severe fatigue","extreme fatigue","overexertion"],"phonetic":"/ˌoʊvərfəˈtiːɡ/","extraExplanation":["“overfatigue”在现代英语中不算常见，更常用的说法是“severe fatigue / extreme fatigue”或“exhaustion”。在健康、运动或工作场景里，用它强调“疲劳已经超过正常限度”。"]}
{"word":"overfatigued","summary":{"en":"Overfatigued means extremely tired—more than normal fatigue, often from overwork or too much activity.","zh":"overfatigued 表示“过度疲劳、极度疲倦”，常因过度工作或活动太多而导致。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely tired, often from too much work, stress, or activity; beyond normal fatigue.","zh":"过度疲劳的；极度疲倦的（通常因工作、压力或活动过多而超过一般疲劳程度）。"},"examples":[{"en":"After the overnight shift, she was overfatigued and could barely focus.","zh":"上完通宵班后，她过度疲劳，几乎无法集中注意力。"},{"en":"If you feel overfatigued, take a break before driving.","zh":"如果你感到过度疲劳，开车前先休息一下。"}]}],"synonyms":["exhausted","worn out","overtired","drained"],"phonetic":"/ˌoʊvɚfəˈtiɡd/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超过正常范围”（如 overwork 过度工作、overeat 暴饮暴食）。因此 overfatigued 强调“疲劳已经超出一般程度”。","在日常口语中，人们更常说“exhausted / worn out / overtired”。“overfatigued”略偏正式或书面，用于强调因过度负荷导致的疲劳。"]}
{"word":"overfatigues","summary":{"en":"“Overfatigues” means (someone) becomes extremely tired or makes someone extremely tired by doing too much.","zh":"“overfatigues”表示（某人）因做得太多而极度疲劳，或使他人过度疲劳。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Usually as a verb form of **overfatigue**) to make someone extremely tired by too much work, exercise, or stress.","zh":"（通常视为动词 **overfatigue** 的一种形式）使某人因工作、运动或压力过度而极度疲劳。"},"examples":[{"en":"The long shifts **overfatigues** the nurses, so the hospital is changing the schedule.","zh":"长时间轮班会让护士们**过度疲劳**，所以医院正在调整排班。"},{"en":"If the training plan **overfatigues** you, your performance may get worse instead of better.","zh":"如果训练计划让你**过度疲劳**，你的表现可能不会变好，反而变差。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become extremely tired because of doing too much (less common).","zh":"因做得太多而变得极度疲劳（较不常见）。"},"examples":[{"en":"He **overfatigues** easily when he doesn’t sleep enough.","zh":"他睡不够时很容易**过度疲劳**。"}]}],"synonyms":["overwork","exhaust","wear out","tire out","overtrain"],"phonetic":"/ˌoʊvɚfəˈtiɡ/","extraExplanation":["“overfatigues”是第三人称单数现在时（he/she/it overfatigues）。更常见的表达是 **overwork**（使过劳）或 **exhaust**（使精疲力竭）。在健康/运动语境里，也常见 **overtrain**（过度训练）。","拼写提示：前缀 **over-** 表示“过度”，**fatigue** 表示“疲劳”。合起来就是“过度疲劳/使过度疲劳”。"]}
{"word":"overfatiguing","summary":{"en":"Overfatiguing means excessively tiring—so tiring that it can harm performance or recovery.","zh":"overfatiguing 指“过度使人疲劳的”，累到影响表现或恢复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely tiring; causing more fatigue than is healthy or reasonable.","zh":"过度使人疲劳的；累得过头的（不健康或不合理）。"},"examples":[{"en":"Working double shifts for weeks can be overfatiguing.","zh":"连续几周上双班会让人过度疲劳。"},{"en":"The training plan was effective, but the last week felt overfatiguing.","zh":"这个训练计划很有效，但最后一周感觉太累、过度疲劳。"}]},{"partOfSpeech":"adj.","definition":{"en":"So tired that performance, attention, or recovery gets worse (often used about people, schedules, or tasks).","zh":"（常指人、日程或任务）累到影响表现、注意力或恢复的。"},"examples":[{"en":"When students are overfatiguing themselves, small mistakes become common.","zh":"当学生把自己累到过度疲劳时，小错误就会变得很常见。"},{"en":"The schedule was overfatiguing and led to more sick days.","zh":"这个日程安排让人过度疲劳，结果请病假的天数增加了。"}]}],"synonyms":["too tiring","overly fatiguing","exhausting","wearing","draining"],"phonetic":"/ˌoʊvɚfəˈtiːɡɪŋ/","extraExplanation":["“overfatiguing”由前缀 over-（过度）+ fatiguing（令人疲劳的）构成，语气比 tiring / exhausting 更强调“超过正常或健康范围”。","常见搭配：overfatiguing work/schedule/training/pace（过度累人的工作/安排/训练/节奏）。写作中有时会更常用 “overly fatiguing” 或 “too fatiguing”。"]}
{"word":"overfatness","summary":{"en":"Overfatness means excessive body fat; obesity.","zh":"overfatness指体脂过多、过度肥胖（肥胖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having too much body fat; excessive fatness (obesity)","zh":"过度肥胖；体脂过多（肥胖）"},"examples":[{"en":"The doctor warned that overfatness can increase the risk of heart disease.","zh":"医生警告说，过度肥胖会增加心脏病风险。"},{"en":"Regular exercise and balanced meals can help prevent overfatness.","zh":"规律运动和均衡饮食有助于预防过度肥胖。"}]}],"synonyms":["obesity","excessive fatness","overweight (general, less precise)","excess body fat"],"phonetic":"/ˌoʊvɚˈfætnəs/","extraExplanation":["“overfatness”在日常英语里不算常用，更常见的说法是“obesity”（肥胖）或“excess weight / being overweight”（体重超标）。","在健康语境中，“overfat”有时特指“体脂率过高”，即使体重不一定很重也可能被称为overfat；但“overfatness”作为名词仍较少见。","语气与礼貌：描述他人身体时，英语里直接说“fat/overfat”可能显得不礼貌或伤人；更常用更中性的表达是“overweight”或“having obesity”。"]}
{"word":"overfatten","summary":{"en":"“Overfatten” means to fatten too much—feeding beyond what is healthy or intended, often used for livestock.","zh":"“overfatten”指把（多因喂食过量）养得过胖、过度催肥，常用于牲畜。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make an animal (or person) too fat by feeding too much; to fatten beyond a healthy or desired level","zh":"（通过喂食过多）把（动物或人）养得过胖；过度催肥"},"examples":[{"en":"Farmers try not to overfatten pigs before transport, because it can harm their health.","zh":"农民会尽量避免在运输前把猪过度催肥，因为这会影响它们的健康。"},{"en":"The vet warned that overfattening the dog could lead to joint problems.","zh":"兽医警告说，把狗养得过胖可能会导致关节问题。"}]}],"synonyms":["overfeed","fatten up too much","overweight (cause to become)","overindulge (less direct)"],"phonetic":"/ˌoʊvərˈfætən/","extraExplanation":["“overfatten”最常见于畜牧业/养殖语境，强调“喂得过多导致超过理想体重”。日常对人更常说“overfeed”或“make someone overweight”。"]}
{"word":"overfault","summary":{"en":"“Overfault” is a rare, nonstandard verb meaning to criticize or blame too much.","zh":"“overfault”是一个很少见、偏非标准的动词，表示过度挑剔或过分责怪。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare / nonstandard) To find too much fault with; to criticize someone or something excessively.","zh":"（罕见/非标准用法）过度挑剔；过分指责（某人或某事）。"},"examples":[{"en":"Try not to overfault your teammates for one mistake.","zh":"尽量不要因为一次失误就过分责怪你的队友。"},{"en":"She tends to overfault herself when things go wrong.","zh":"事情不顺时，她往往会过度责备自己。"}]}],"synonyms":["overcriticize","be overly critical","find fault with","overblame"],"phonetic":"/ˌoʊvərˈfɔlt/","extraExplanation":["“overfault”在现代英语中非常少见，很多词典不收录，通常被视为临时造词（nonce word）或非标准表达。更自然的说法有：overcriticize（过度批评）、be overly critical（过于挑剔）、find fault with（挑……的毛病）、blame too much（过分责怪）。","构词上看，over- 表示“过度”，fault 作动词可表示“挑错/责备”，所以字面意思容易理解，但实际使用中更推荐用上面更常见的表达。"]}
{"word":"overfavor","summary":{"en":"Overfavor means to treat someone or something with too much preference, often unfairly.","zh":"overfavor 指对某人或某事过度偏爱/偏袒，通常带有“不公平”的含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to show too much favor to someone; to treat someone more positively than is fair or reasonable","zh":"过度偏爱（某人）；过分优待（以至于不公平或不合理）"},"examples":[{"en":"The coach was accused of overfavoring his own son during practice.","zh":"教练被指责在训练中过度偏袒自己的儿子。"},{"en":"If you overfavor one team member, others may feel ignored.","zh":"如果你过度偏爱某一位团队成员，其他人可能会觉得被忽视。"},{"en":"The policy was changed because it seemed to overfavor large companies.","zh":"这项政策被修改了，因为它看起来过度偏向大公司。"}]}],"synonyms":["favoritism","show favoritism","overindulge","be biased toward","coddle"],"phonetic":"/ˌoʊvɚˈfeɪvɚ/","extraExplanation":["“overfavor”不是非常常见的词，更常见的表达有：favor too much, show favoritism, be biased toward。写作中也可能看到拼写为“over-favor”（带连字符），意思相同。","语气上它常带批评意味，强调“偏爱过头”导致不公平。"]}
{"word":"overfavorable","summary":{"en":"“Overfavorable” means excessively favorable or overly positive, often suggesting bias or lack of objectivity.","zh":"“overfavorable”意为“过分正面/过于有利”，常暗示评价带偏见或不够客观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively positive or approving; more favorable than is fair, accurate, or deserved.","zh":"过分正面（或赞同）的；过于有利的（以至于不够公正或不够准确）。"},"examples":[{"en":"The review felt overfavorable and didn’t mention any weaknesses.","zh":"这篇评论感觉过分吹捧，完全没提到任何缺点。"},{"en":"The report gives an overfavorable impression of the company’s finances.","zh":"这份报告对公司的财务状况给出了过于乐观的印象。"},{"en":"Try to avoid overfavorable language when you’re writing an objective evaluation.","zh":"在写客观评价时，尽量避免使用过分正面的措辞。"}]}],"synonyms":["overly favorable","too favorable","unduly favorable","effusively positive","overly positive","biased"],"phonetic":"/ˌoʊvɚˈfeɪvɚəbəl/","extraExplanation":["“overfavorable”在现代英语中不算常见，更常见的表达是“overly favorable”或“too favorable”。但它的构词很直观：over-（过度）+ favorable（有利的/正面的）。","常见搭配：overfavorable review/comment/report/coverage（过分好评/过于正面的评论/报告/报道）。","语气上常带一点“夸大、偏颇、不客观”的暗示，适合用于批评某个评价或描述太偏向正面。"]}
{"word":"overfavorableness","summary":{"en":"Overfavorableness means being too favorable or overly positive, often in a biased way.","zh":"overfavorableness 指过度偏袒或过分正面，常带有不够客观、可能偏见的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too favorable; an excessively positive attitude, judgment, or evaluation (often suggesting bias or lack of balance)","zh":"过度偏袒（或过分正面）的特质；指态度、判断或评价过于有利，常暗示有偏见或不够客观"},"examples":[{"en":"The report’s overfavorableness toward the company raised questions about bias.","zh":"这份报告对该公司的过度偏袒引发了人们对偏见的质疑。"},{"en":"Try to avoid overfavorableness when you review your friend’s work; be fair and specific.","zh":"在评价朋友的作品时尽量避免过度偏袒；要公平而具体。"}]}],"synonyms":["excessive favorability","undue favoritism","bias","partiality","an overly favorable view"],"phonetic":"/ˌoʊvərˈfeɪvərəbəlnəs/","extraExplanation":["“overfavorableness”并不常见，更自然的表达通常是“excessive favorability / undue favoritism / an overly favorable view”。它由 over-（过度）+ favorable（有利的）+ -ness（名词后缀，表示“……的性质”）构成。","语气上它常带批评意味：不是单纯“很喜欢/很支持”，而是“好得不合理”，暗示不客观或有利益关系。"]}
{"word":"overfavorably","summary":{"en":"“Overfavorably” means “too favorably,” suggesting praise or approval that is excessive or unfair.","zh":"“overfavorably”表示“过于有利/过分好评地”，强调评价或赞扬过头、不够客观。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too favorable; with more approval or praise than is fair or accurate.","zh":"过于有利地；过分称赞地（指评价或看法好得不合理、不准确）。"},"examples":[{"en":"The report described the results overfavorably and ignored the risks.","zh":"这份报告过于有利地描述了结果，并忽略了风险。"},{"en":"Some critics think the movie was reviewed overfavorably because of the famous director.","zh":"一些评论家认为，这部电影因为导演很有名而被过分好评。"}]}],"synonyms":["too favorably","overly favorably","unduly favorably","excessively favorably"],"phonetic":"/ˌoʊvɚˈfeɪvɚəbli/","extraExplanation":["这个词更常见的写法是连字符形式 over-favorably（美式），英式拼写为 over-favourably。实际写作中也常用更自然的替代说法：too favorably / overly favorably / in an overly favorable way。","语感上，它常用于表达“评价偏颇、过度美化、报喜不报忧”，尤其在评论、报道、研究结论等语境中。"]}
{"word":"overfear","summary":{"en":"Overfear means excessive fear—being more afraid than the situation warrants.","zh":"overfear 指“过度恐惧”，即害怕的程度超过情况所需要的合理范围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or exaggerated fear; fear that is stronger than the situation reasonably calls for.","zh":"过度的恐惧；对情况反应过强、超过合理程度的害怕。"},"examples":[{"en":"Her overfear of flying kept her from visiting family for years.","zh":"她对飞行的过度恐惧让她多年无法去探望家人。"},{"en":"News headlines can sometimes create overfear about everyday risks.","zh":"新闻标题有时会引发人们对日常风险的过度恐惧。"}]},{"partOfSpeech":"v.","definition":{"en":"To fear too much; to respond with excessive fear (rare in modern English).","zh":"过度害怕；以过强的恐惧来反应（现代英语中较少见）。"},"examples":[{"en":"Try not to overfear small mistakes—use them to learn.","zh":"别对小错误过度害怕——把它们当作学习的机会。"}]}],"synonyms":["excessive fear","undue fear","irrational fear","overanxiety","panic"],"phonetic":"/ˌoʊvərˈfɪr/","extraExplanation":["“overfear”不是最常用的标准词，写作中更常见的是“excessive fear”“irrational fear”或“undue fear”。","前缀“over-”常表示“过度、太多”（如 overeat 吃太多，overreact 反应过度），因此 overfear = “fear too much”。在正式写作里，你也可以用“overreact in fear / be overly fearful”。"]}
{"word":"overfeared","summary":{"en":"“Overfeared” means “feared too much” or “seen as more dangerous than it really is.”","zh":"“overfeared”意为“被过度害怕的/被高估风险的”，即恐惧被放大。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"feared too much; regarded as more frightening or dangerous than it really is","zh":"被过度害怕的；被认为比实际更可怕或更危险的"},"examples":[{"en":"The disease was once overfeared, so people avoided anyone who seemed sick.","zh":"这种疾病曾一度被过度恐惧，因此人们会躲开任何看起来生病的人。"},{"en":"The new policy is overfeared; it will likely change less than many people expect.","zh":"这项新政策被过度担忧了；它很可能带来的变化没有许多人想的那么大。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “overfear”: to fear something excessively","zh":"“overfear”的过去式：对某事过度害怕"},"examples":[{"en":"They overfeared the storm and canceled the trip early.","zh":"他们过度害怕那场风暴，于是提前取消了行程。"}]}],"synonyms":["overly feared","feared too much","excessively feared","unduly feared","overestimated"],"phonetic":"/ˌoʊvərˈfɪrd/","extraExplanation":["“overfeared”在现代英语中不算常用，更常见的表达是“overly feared”“feared too much”或“exaggerated fear of…”。","构词上是前缀 over-（过度）+ fear（害怕），常见于较书面、评论性语境，用来指出“恐惧被放大、风险被高估”。"]}
{"word":"overfearful","summary":{"en":"Overfearful means excessively afraid or worried.","zh":"overfearful 指“过度害怕/过分担心”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling too much fear; excessively worried that something bad will happen.","zh":"过度害怕的；过分担心会发生坏事的。"},"examples":[{"en":"She became overfearful after the accident and avoided driving at night.","zh":"事故之后她变得过度害怕，晚上都不敢开车。"},{"en":"Don’t be overfearful—ask for help and take it one step at a time.","zh":"别太害怕——求助一下，一步一步来。"}]}],"synonyms":["overly fearful","too fearful","anxious","afraid","timid"],"phonetic":"/ˌoʊvɚˈfɪrfəl/","extraExplanation":["“overfearful”不是最常见的日常词（更常见的是 overly fearful / too fearful / anxious / afraid）。它由 over-（过度）+ fearful（害怕的）构成，语气强调“超过合理程度的恐惧”，有时带一点劝慰或轻微批评的感觉。","在写作中，如果你想更自然口语化，可以用“overly fearful”或“too afraid”。如果想表达更广泛的担忧和紧张，也可以用“anxious”。"]}
{"word":"overfearfully","summary":{"en":"“Overfearfully” means “in an excessively fearful way.”","zh":"“overfearfully”表示“以过度害怕的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively fearful way; more fearfully than is reasonable or necessary.","zh":"过度害怕地；害怕得不合理或不必要地。"},"examples":[{"en":"She reacted overfearfully to the harmless joke and left the room.","zh":"她对那个无害的玩笑反应得过度害怕，离开了房间。"},{"en":"If we plan overfearfully, we may avoid opportunities that are actually safe.","zh":"如果我们过度害怕地做计划，可能会回避一些其实安全的机会。"}]}],"synonyms":["overly fearfully","too fearfully","excessively fearfully","overcautiously"],"phonetic":"/ˌoʊvɚˈfɪr.fəli/","extraExplanation":["这个词由 over-（“过度、太……”）+ fearful（害怕的）+ -ly（副词后缀）构成，意思很直观，但在现代英语中相对少见；更常见的表达是 overly fearfully、too fearfully，或用 in an overly cautious/fearful way 来改写。"]}
{"word":"overfearfulness","summary":{"en":"Overfearfulness means having too much fear or anxiety.","zh":"overfearfulness 指“过度的恐惧/焦虑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive fearfulness; being too afraid or anxious, often in situations that are not truly dangerous.","zh":"过度的害怕；过分的恐惧或焦虑，常常发生在并非真正危险的情境中。"},"examples":[{"en":"His overfearfulness kept him from trying new things at work.","zh":"他的过度恐惧让他在工作中不敢尝试新事物。"},{"en":"The coach encouraged the team to replace overfearfulness with careful confidence.","zh":"教练鼓励队员用谨慎的自信取代过度恐惧。"}]}],"synonyms":["excessive fear","overanxiety","timidity","fearfulness"],"phonetic":"/ˌoʊvɚˈfɪrfəlnəs/","extraExplanation":["“overfearfulness”由 over-（过度）+ fearful（害怕的）+ -ness（名词后缀）构成，强调“程度太过”。在日常英语里更常见的说法是 “excessive fear” 或 “too much fear”。如果担心更偏向持续的忧虑，也可以用 “anxiety” 或 “overanxiety”。"]}
{"word":"overfearing","summary":{"en":"“Overfearing” means excessively afraid or worrying too much.","zh":"“overfearing”表示“过度害怕、担心过头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively afraid; fearing too much (often showing unnecessary worry about danger or problems).","zh":"过度害怕的；太过担忧的（常指对危险或问题担心过头）。"},"examples":[{"en":"An overfearing child may avoid trying new things because they imagine the worst.","zh":"过度害怕的孩子可能会因为总往坏处想而不敢尝试新事物。"},{"en":"She became overfearing after reading alarming news every day.","zh":"她每天看一些耸人听闻的新闻后变得过度害怕。"}]}],"synonyms":["overly fearful","excessively fearful","anxious","too worried","fearful"],"phonetic":"/ˌoʊvɚˈfɪrɪŋ/","extraExplanation":["“overfearing”不是现代英语里非常常见的日常词，更常见的说法是“overly fearful / excessively fearful / anxious”。它通常作为形容词使用，也可理解为“overfear（过度恐惧）”的现在分词/形容词化形式。","在较古老或宗教/文学语境中，你也可能见到类似结构来强调“过度”的心理状态；现代写作里一般会改用更常见的搭配来提高自然度。"]}
{"word":"overfears","summary":{"en":"“Overfears” is a rare form meaning ‘fears too much’ (verb) or ‘excessive fears’ (noun plural).","zh":"“overfears”较罕见，可表示“过度害怕”（动词）或“过度的恐惧/担忧”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) to fear something too much; to feel an excessive or exaggerated fear.","zh":"（罕用）过度害怕；对某事产生夸大的恐惧。"},"examples":[{"en":"She overfears failure and avoids trying new things.","zh":"她过度害怕失败，所以避免尝试新事物。"},{"en":"Don’t overfear small mistakes—they help you learn.","zh":"别过度害怕小错误——它们能帮助你学习。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, plural) excessive fears; fears that are stronger than the situation truly requires.","zh":"（罕用，复数）过度的恐惧；与实际情况不相称的担忧。"},"examples":[{"en":"His overfears about safety made travel stressful.","zh":"他对安全的过度担忧让旅行变得很紧张。"},{"en":"Talking through your overfears can make them feel smaller.","zh":"把你的过度恐惧说出来，往往会让它们显得没那么可怕。"}]}],"synonyms":["fear too much","be overly afraid","excessive fear","unwarranted fear","overreact out of fear"],"phonetic":"/ˌoʊvɚˈfɪrz/","extraExplanation":["“overfear(s)”在现代英语里不算常见，更自然的表达通常是：fear too much / be overly afraid / have excessive fears / overreact out of fear。","构词上由 over-（过度）+ fear（害怕）组成，因此含义比较直观，但写作中出现频率不高。"]}
{"word":"overfeast","summary":{"en":"Overfeast means to eat (or drink) too much, especially as if at a feast.","zh":"overfeast 指吃（或喝）得过多，常带有“像盛宴一样过度享用”的意味。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to eat or drink too much; to indulge in a very large meal","zh":"暴饮暴食；吃（喝）得过多；过度享用大餐"},"examples":[{"en":"After the holiday dinner, he felt sick because he had overfeasted.","zh":"节日晚餐后，他因为暴饮暴食而觉得不舒服。"},{"en":"Try not to overfeast at the buffet—take small portions first.","zh":"在自助餐别暴食——先少量多次取餐。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to feed someone too much; to overindulge someone with food","zh":"（较少用）使（某人）吃得过多；用食物过度款待（某人）"},"examples":[{"en":"They overfeasted their guests with rich dishes and desserts.","zh":"他们用丰盛的菜肴和甜点把客人招待得吃得过多。"}]}],"synonyms":["overeat","binge-eat","gorge","stuff oneself","indulge"],"phonetic":"/ˌoʊvɚˈfiːst/","extraExplanation":["“over-”这个前缀常表示“过度、超过正常程度”，例如：overeat（吃太多）、overwork（工作过度）、overreact（反应过度）。因此 overfeast 语气上更强调“像过节/盛宴一样吃得过多”，比 overeat 更带“宴饮、享乐”的感觉。","这个词在现代日常口语里不算常用；更常见的说法是 overeat 或 binge-eat（暴食，尤其指失控地暴食）。"]}
{"word":"overfeatured","summary":{"en":"Overfeatured means either ‘having too many features’ (often making something unwieldy) or ‘given too much attention’ in media or storytelling.","zh":"overfeatured 可指“功能过多（导致臃肿难用）”，也可指“被过度突出/过度关注（在媒体或叙事中）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too many features or options, often making something complicated, cluttered, or less user-friendly.","zh":"功能过多的；（常指）因为加入太多功能而变得复杂、臃肿、不好用的。"},"examples":[{"en":"The app feels overfeatured—there are so many buttons that it’s hard to find the main tools.","zh":"这个应用感觉功能过多——按钮太多，反而很难找到主要工具。"},{"en":"Some cars are overfeatured, so simple tasks like adjusting the air conditioning take too long.","zh":"有些车功能堆得太多，结果连调空调这种简单操作都要花很久。"}]},{"partOfSpeech":"adj.","definition":{"en":"Given too much emphasis or attention in a story, program, or media coverage.","zh":"被过度突出/过度报道的；在故事、节目或媒体中被给予过多关注的。"},"examples":[{"en":"One character was so overfeatured that the rest of the cast felt ignored.","zh":"有一个角色被过度突出，显得其他角色都被冷落了。"},{"en":"The article overfeatured minor details and missed the bigger issue.","zh":"这篇文章过度强调小细节，反而忽略了更大的问题。"}]}],"synonyms":["overcomplicated","bloated","feature-heavy","cluttered","overemphasized"],"phonetic":"/ˌoʊvərˈfiːtʃərd/","extraExplanation":["“over-”表示“过度/太多”，与“featured（被作为特色的/被重点呈现的）”结合后，常用于产品设计与营销语境，带有轻微负面评价：功能堆砌导致体验变差。","近义表达常见于科技评论：feature creep（功能膨胀/功能蔓延）、bloated（臃肿的）、overcomplicated（过于复杂的）。"]}
{"word":"overfed","summary":{"en":"“Overfed” means given too much food or having eaten too much, often to an unhealthy degree.","zh":"“Overfed”表示被喂得太多或吃得过多，常带有不健康或不适当的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given too much food; fed more than is healthy or needed","zh":"喂得太多的；吃得过多（不健康或不必要）的"},"examples":[{"en":"The puppy got overfed because everyone kept giving him treats.","zh":"小狗被喂得太多了，因为每个人都一直给它零食。"},{"en":"An overfed cat may gain weight quickly and become less active.","zh":"一只吃得过多的猫可能很快发胖，活动也会变少。"}]},{"partOfSpeech":"v.","definition":{"en":"fed too much (past tense/past participle of “overfeed”)","zh":"喂得太多；吃得过多（overfeed 的过去式/过去分词）"},"examples":[{"en":"I think we overfed the fish, so the water turned cloudy.","zh":"我觉得我们把鱼喂太多了，所以水变得浑浊。"},{"en":"He was overfed as a child and struggled with unhealthy habits later.","zh":"他小时候吃得过多，后来形成了一些不健康的习惯。"}]}],"synonyms":["overweight (result)","overstuffed (feeling)","overfed (itself)"],"phonetic":"/ˌoʊvɚˈfɛd/","extraExplanation":["“overfed”既可以当形容词（描述状态：overfed dog），也可以当动词的过去式/过去分词（描述动作：We overfed the dog）。","常见搭配：overfed baby/pet/child（被喂太多的婴儿/宠物/孩子）；feel overfed（感觉吃太撑、太腻）。与“overeat（吃太多）”相比，“overfeed”更强调“被别人喂太多/给太多食物”，尤其用于婴儿或宠物。"]}
{"word":"overfee","summary":{"en":"Overfee means to charge too much money (especially in fees).","zh":"overfee 指（尤其在费用方面）收费过高、多收费用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to charge someone too much money for a service, product, or fee","zh":"（对服务、商品或费用）收费过高；多收费用"},"examples":[{"en":"The hotel was accused of overfeeing guests for parking.","zh":"这家酒店被指控对客人的停车费收费过高。"},{"en":"Make sure the platform doesn’t overfee you for small transfers.","zh":"要确认这个平台不会对小额转账多收费。"},{"en":"If a company overfees customers, it may face refunds or penalties.","zh":"如果公司对顾客多收费，可能需要退款或面临处罚。"}]}],"synonyms":["overcharge","charge too much","charge excessive fees","overbill"],"phonetic":"/ˌoʊvərˈfiː/","extraExplanation":["“overfee”比较少见，实际使用中更常看到“overcharge（多收费）”“overprice（定价过高）”“charge excessive fees（收取过高费用）”。在法律或消费者投诉语境里，如果说某机构“overfee(s) customers”，通常指收取了不合理或未事先说明的费用。"]}
{"word":"overfeed","summary":{"en":"Overfeed means to give too much food (or, less commonly, to eat too much). It can also mean putting too much material into a machine.","zh":"Overfeed 指“喂得过多/过度喂食”（较少见也可指“吃得过多”），也可指给机器投放过多材料（如纸张）导致问题。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone or an animal more food than is healthy or needed","zh":"（给人或动物）喂得过多；过度喂食"},"examples":[{"en":"Some parents worry they might overfeed their baby.","zh":"有些父母担心自己可能把宝宝喂得太多。"},{"en":"Don’t overfeed the dog, even if it begs.","zh":"即使狗狗讨食，也不要喂太多。"},{"en":"The fish were overfed, and the tank water became dirty.","zh":"鱼被喂得过多，鱼缸水就变脏了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to take in too much food; to eat more than is good for you (less common)","zh":"（自己）吃得过多；过量进食（较少见）"},"examples":[{"en":"It’s easy to overfeed during the holidays.","zh":"节日期间很容易吃过量。"},{"en":"He realized he had overfed and felt uncomfortable afterward.","zh":"他意识到自己吃太多了，之后觉得不舒服。"}]},{"partOfSpeech":"vt.","definition":{"en":"to supply too much material to a machine or process (for example, paper into a printer), causing problems","zh":"（给机器/流程）投放过多材料（如给打印机塞太多纸），导致故障"},"examples":[{"en":"The printer jammed because someone overfed it with paper.","zh":"打印机卡纸了，因为有人塞了太多纸。"},{"en":"Overfeeding the shredder can damage the blades.","zh":"把碎纸机喂得太“满”会伤到刀片。"}]}],"synonyms":["overeat","overindulge","stuff","over-supply","feed too much"],"phonetic":"/ˌoʊvɚˈfid/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”。因此 overfeed = feed（喂/供给食物） + over-（过度）。","在育儿或宠物语境里，overfeed 常带有健康提醒：可能导致体重问题、消化不适等。也常用于比喻性表达，把机器当作“被喂东西”的对象（如 printer/shredder）。"]}
{"word":"overfeeding","summary":{"en":"Overfeeding means giving more food than needed, often causing health problems.","zh":"Overfeeding 指喂食超过需要的量，常会带来健康问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving a person or animal more food than they need","zh":"（对人或动物）喂食过量；过度喂养"},"examples":[{"en":"Overfeeding can make pets gain weight quickly.","zh":"过度喂养会让宠物很快发胖。"},{"en":"The vet warned that overfeeding is common with indoor cats.","zh":"兽医提醒说，室内猫很常见的问题就是喂食过量。"}]},{"partOfSpeech":"v.","definition":{"en":"feeding someone or something too much; giving more food than is healthy or necessary","zh":"喂得过多的；过度喂养的"},"examples":[{"en":"Overfeeding your baby may cause stomach discomfort.","zh":"给宝宝喂得过多可能会引起胃部不适。"},{"en":"They adjusted the schedule to avoid overfeeding the fish.","zh":"他们调整了时间表以避免给鱼喂得过多。"}]}],"synonyms":["excess feeding","overnutrition","overeat (related)"],"phonetic":"/ˌoʊvərˈfiːdɪŋ/","extraExplanation":["在健康与养育语境里，overfeeding 常出现在育儿建议、营养学、宠物护理中，通常带有“为健康考虑而应避免”的含义。","构词上是 over-（过度）+ feeding（喂食）。类似构词：overeat（吃太多）、overwork（过度工作）、overuse（过度使用）。"]}
{"word":"overfeeds","summary":{"en":"“Overfeeds” means “gives too much food,” and it can also mean “supplies too much of something,” causing trouble.","zh":"“Overfeeds”表示“喂得过量”；也可引申为“供给过量（信息/材料等）”，从而引发问题。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone (especially a baby) or an animal more food than is healthy or needed","zh":"（尤指给婴儿或动物）喂食过量；喂得太多"},"examples":[{"en":"She overfeeds the baby because she worries he isn’t eating enough.","zh":"她因为担心宝宝吃不够而喂得过量。"},{"en":"Don’t overfeed your dog—too many treats can cause weight gain.","zh":"别给狗喂太多——零食过量会导致发胖。"}]},{"partOfSpeech":"v.","definition":{"en":"to supply too much of something (such as fuel, information, or material) so that it causes problems","zh":"（引申）过量供给（如燃料、信息、材料等），以致造成问题"},"examples":[{"en":"The machine fails if you overfeed it with paper.","zh":"如果你一次塞太多纸，机器就会出故障。"},{"en":"Don’t overfeed the audience with details—keep the main point clear.","zh":"别给听众灌太多细节——把重点讲清楚就好。"}]}],"synonyms":["overeat (oneself)","overindulge","stuff","over-supply","overload"],"phonetic":"/ˌoʊvɚˈfid/"}
{"word":"overfeel","summary":{"en":"“Overfeel” means to feel something too intensely or be overly sensitive (informal and uncommon).","zh":"“overfeel”指过度感受、情绪反应过强或过度敏感（偏口语且不常见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel an emotion or physical sensation too strongly; to react with more feeling than the situation seems to require (informal, not very common)","zh":"（非正式用法，不太常见）过度感受；情绪或感觉太强烈；反应比情境所需更强"},"examples":[{"en":"I tend to overfeel criticism, even when it’s meant to help.","zh":"我容易对批评过度感受，即使那是出于帮助。"},{"en":"After the accident, she began to overfeel normal aches and pains.","zh":"事故之后，她开始对正常的酸痛也感受得过度强烈。"}]},{"partOfSpeech":"v.","definition":{"en":"to be overly sensitive or empathetic in a way that becomes exhausting for yourself (informal)","zh":"（非正式）过度敏感/过度共情，以至于让自己很累"},"examples":[{"en":"He overfeels other people’s moods and needs time alone to reset.","zh":"他会过度感受别人的情绪，所以需要独处一会儿来恢复。"}]}],"synonyms":["feel too strongly","be overly sensitive","be overwhelmed","overreact emotionally"],"phonetic":"/ˌoʊvərˈfiːl/","extraExplanation":["“overfeel”不是非常标准或常见的词，更像是口语/网络用语，用来表达“感觉太多、太强”。正式写作里更常用：“feel too strongly / be overly sensitive / be overwhelmed by emotions”。","构词很直观：over-（过度）+ feel（感觉）。如果你在作文或报告里使用，建议换成更常见表达以避免读者觉得生造。"]}
{"word":"overfell","summary":{"en":"Overfell is an uncommon, literary past form of overfall, meaning “suddenly attacked” or “suddenly came over.”","zh":"Overfell 是较少见、偏文学的 overfall 过去式，表示“遭到突然袭击”或“（睡意/恐惧等）突然袭来”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of overfall) to attack or rush at someone suddenly; to surprise and overwhelm.","zh":"（overfall 的过去式/过去分词）突然袭击；猛扑；使措手不及、压倒。"},"examples":[{"en":"They were overfell by bandits on the road.","zh":"他们在路上遭到强盗突袭。"},{"en":"The small guard party was overfell before it could raise an alarm.","zh":"那支小小的卫队还没来得及报警就被突然击倒了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of overfall) to come upon someone suddenly (especially sleep, fear, illness, darkness).","zh":"（overfall 的过去式/过去分词）（尤指睡意、恐惧、疾病、黑暗等）突然袭来、降临。"},"examples":[{"en":"A heavy sleep overfell him after the long journey.","zh":"长途跋涉后，浓重的睡意突然袭来。"},{"en":"A strange fear overfell her in the quiet house.","zh":"在安静的房子里，一种奇异的恐惧突然笼罩了她。"}]}],"synonyms":["attacked","set upon","assailed","overwhelmed","came over"],"phonetic":"/ˌoʊvɚˈfɛl/","extraExplanation":["“overfell”比较少见，属于偏文学/古体用法；现代英语更常用“attacked / set upon / overwhelmed / came over”来表达相近意思。","在文学语境里，它常用来营造“突如其来、压迫感强”的氛围（例如：sleep/fear/darkness overfell someone）。"]}
{"word":"overfellowlike","summary":{"en":"An archaic, very rare adjective meaning “overly familiar; too buddy-like.”","zh":"一个古旧且罕见的形容词，意思是“过分熟络、过于称兄道弟的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/very rare) Too “buddy-buddy”; behaving in an overly familiar, matey way, as if someone is more of a close friend (“fellow”) than the situation allows.","zh":"（古旧/极少见）过分“称兄道弟”的；表现得过于熟络、过分随便，好像关系比实际更亲近。"},"examples":[{"en":"He spoke to the manager in an overfellowlike way, as if they were old friends.","zh":"他用一种过分称兄道弟的口气跟经理说话，好像他们是老朋友一样。"},{"en":"Her overfellowlike jokes made some people uncomfortable at the first meeting.","zh":"她在第一次见面时那些过分熟络的玩笑让一些人不太舒服。"}]}],"synonyms":["overly familiar","too chummy","too matey","overfriendly","too casual"],"phonetic":"ˌoʊvərˈfɛloʊˌlaɪk","extraExplanation":["这个词非常罕见，多见于较早期英语或模仿古风的写作里，常写作带连字符的 over-fellowlike。核心感觉是：把“同伴/兄弟（fellow）”的姿态用得“过头（over-）”，在不合适的场合显得太随便、太亲热，甚至有点冒犯。现代英语更常用 overly familiar / too chummy / too matey 来表达类似意思。"]}
{"word":"overfellowly","summary":{"en":"“Overfellowly” is a rare/old-fashioned word meaning excessively friendly or overly familiar (often in an inappropriate way).","zh":"“overfellowly”是很少见/较古旧的词，表示过分友好或过于熟络，常带有“不太得体”的负面含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) Too friendly or familiar in a way that feels disrespectful or improper; overly buddy-buddy.","zh":"（罕见/古语）过分亲昵、过于熟络，以至于显得不够得体或有些失礼；过度“哥们儿”式。"},"examples":[{"en":"His overfellowly tone with the manager made the meeting awkward.","zh":"他对经理说话过分熟络的口气让会议变得尴尬。"},{"en":"She disliked overfellowly jokes from people she had just met.","zh":"她不喜欢刚认识的人就开过分熟络的玩笑。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare/archaic) In an overly friendly or overly familiar way.","zh":"（罕见/古语）以过分亲昵、过于熟络的方式。"},"examples":[{"en":"He spoke overfellowly, as if they were old friends.","zh":"他说话过分熟络，仿佛他们是多年的老朋友。"}]}],"synonyms":["overfamiliar","too familiar","overly friendly","chummy","buddy-buddy"],"phonetic":"/ˌoʊvərˈfɛloʊli/","extraExplanation":["“over-”表示“过度、太……”。“fellowly”本意是“像同伴/朋友一样的、友好的”。合在一起，“overfellowly”就带有“友好得过头、熟络得不合适”的批评意味。","这个词非常少见，现代英语里更常用的替代表达有：too familiar, overly friendly, overly chummy, buddy-buddy（口语），或（语气更强）overfamiliar。正式写作中一般不建议用“overfellowly”。"]}
{"word":"overfelon","summary":{"en":"“Overfelon” is not a standard English word; if used, it’s usually a creative, nonstandard form suggesting someone is labeled/treated as a felon excessively.","zh":"“Overfelon”不是标准英语词；若出现，多为作者临时造词，强调某人被过度贴上“重罪犯”标签或被过度当作重罪犯对待。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard word that is not used in modern English. If it appears, it is usually a creative/one-off formation meaning “an excessive felon” or “someone treated as a felon too easily,” but this is not an established dictionary meaning.","zh":"一个非常罕见、非标准的词，现代英语中几乎不用。若偶尔出现，多半是作者临时造词，可能表达“过度的重罪犯”或“被轻易当作重罪犯对待的人”，但这不是公认的词典义。"},"examples":[{"en":"I couldn’t find “overfelon” in standard dictionaries; it may be a made-up or misspelled word.","zh":"我在常见词典里找不到“overfelon”，它可能是造词或拼写错误。"},{"en":"In that story, the writer calls him an “overfelon” to suggest society is too quick to label people as criminals.","zh":"在那篇故事里，作者用“overfelon”来暗示社会太容易给人贴上罪犯的标签。"}]}],"synonyms":["nonstandard term","made-up word","over-criminalization (related idea)","overcharge (related idea)"],"phonetic":"/ˌoʊvɚˈfɛlən/","extraExplanation":["“over-”常见含义是“过度、太……（too much）”，例如 overwork（过度工作）、overreact（反应过度）。而 felon 是“重罪犯”。把两者硬拼成 overfelon 在英语里不常见，所以更可能是作者为了强调“过度定罪/过度犯罪化（over-criminalization）”的效果而临时造出来的词。","如果你是在法律或新闻语境里看到它，更常见、自然的表达包括：over-criminalization（过度犯罪化）、overcharge（检方以过重罪名起诉）、wrongfully convicted（被冤判）、treated like a felon（被当作重罪犯对待）。","也可能是拼写/识别错误：常见词有 “overfallen”（诗歌/文学里偶见，意为“落在……上、笼罩”）或 “felon”（重罪犯）。你可以把原句发来，我可以按上下文判断最合理的意思。"]}
{"word":"overfeminine","summary":{"en":"Overfeminine means excessively or exaggeratedly feminine.","zh":"overfeminine 指“过于（夸张地）女性化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too feminine in style, behavior, or appearance; showing femininity to an excessive or exaggerated degree.","zh":"（风格、行为或外表）过于女性化的；女性气质表现得过度或夸张的。"},"examples":[{"en":"Some reviewers called the costume overfeminine, with too many ruffles and bows.","zh":"一些评论者说那套服装过于女性化，有太多荷叶边和蝴蝶结。"},{"en":"She worried her writing would be seen as overfeminine, so she avoided emotional language.","zh":"她担心自己的写作会被看成过于女性化，所以刻意避免使用情绪化的措辞。"}]}],"synonyms":["excessively feminine","overly feminine","hyper-feminine","ultra-feminine"],"phonetic":"/ˌoʊvərˈfɛmənən/","extraExplanation":["“overfeminine”通常带有主观评价色彩，暗示“太过”“不合适”或“刻意”，容易反映说话者对性别气质的刻板印象。使用时要注意语境与尊重他人：有时更中性的说法是“very feminine / highly feminine（很女性化）”，或具体描述特点（例如“lots of lace（很多蕾丝）”“soft pastel colors（柔和的粉彩色）”）。","该词由前缀“over-（过度）”+“feminine（女性化的）”构成，多用于评论穿着、审美风格、表演方式或社会性别表达；在讨论性别议题时可能引发争议。"]}
{"word":"overfemininely","summary":{"en":"“Overfemininely” means “in an excessively (often stereotypically) feminine way.”","zh":"“overfemininely”表示“以过度（常带刻板印象）的女性化方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively or stereotypically feminine way; showing “too much” femininity for the context.","zh":"以过度或刻板印象式的女性化方式；在某种情境下显得“太女性化”。"},"examples":[{"en":"The costume was designed to look overfemininely delicate, with lots of lace and ribbons.","zh":"这套服装被设计得过度女性化、过分娇弱，配了很多蕾丝和丝带。"},{"en":"Some critics said the character was written overfemininely and didn’t feel realistic.","zh":"一些评论者认为这个角色被写得过度女性化，因此显得不真实。"}]}],"synonyms":["overly femininely","excessively femininely","stereotypically femininely","too femininely"],"phonetic":"ˌoʊvərˈfɛmənɪnli","extraExplanation":["这个词带有强烈主观评价色彩：说某人/某物“overfemininely”常暗示“过头了”或“刻板化”，可能让人感觉在用性别刻板印象评判他人。正式写作里更常见的说法是“overly feminine / excessively feminine / stereotypically feminine”。","语境上多用于批评造型、角色塑造、广告呈现等“把女性气质夸张化”的表达；谈及真实人物时建议更谨慎，避免把个人表达简单归类为“过度”。"]}
{"word":"overfemininity","summary":{"en":"Overfemininity means an exaggerated display of femininity, often discussed in relation to stereotypes or social expectations.","zh":"overfemininity 指对女性气质的夸张呈现，常用于讨论刻板印象或社会期待。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The expression or performance of femininity in an exaggerated way (for example, emphasizing traditionally “feminine” appearance, behavior, or roles more than is typical or expected).","zh":"过度女性化：以夸张的方式展现或“表演”女性气质（例如把传统上被认为“女性化”的外表、行为或角色强调得超过一般或预期）。"},"examples":[{"en":"Some critics argue that the character’s overfemininity is written to appeal to a narrow stereotype.","zh":"一些评论者认为，这个角色的过度女性化写法是在迎合一种狭隘的刻板印象。"},{"en":"In the workplace, she felt pressure toward overfemininity—always smiling, dressing a certain way, and avoiding direct disagreement.","zh":"在职场里，她感到被推向过度女性化——总要微笑、穿得“应该”的样子，并避免直接反驳。"},{"en":"The film uses overfemininity to show how social expectations can feel like a costume.","zh":"这部电影用过度女性化来呈现社会期待如何让人像在穿一套“戏服”。"}]}],"synonyms":["hyperfemininity","exaggerated femininity","ultra-feminine presentation","stereotypical femininity"],"phonetic":"/ˌoʊvərˌfɛmɪˈnɪnəti/","extraExplanation":["“over-”表示“过度、超过”，因此 overfemininity 常用于讨论社会性别（gender）与刻板印象：并不等于“女性气质不好”，而是强调“被夸大/被要求夸大”的状态。","这个词在学术写作、媒体评论与文化研究里更常见；日常口语中更常说 “too feminine” 或 “hyper-feminine / hyperfeminine”。","使用时注意语境：它可能是在批评社会压力或媒介塑造，也可能被用来描述某种风格选择。为避免冒犯，可以明确是在谈“期待/呈现方式”，而不是评价某个人“应该怎样”。"]}
{"word":"overfeminize","summary":{"en":"Overfeminize means to make something excessively feminine or to stress feminine traits too strongly.","zh":"overfeminize 指把某人或某物“过度女性化”，过分强调女性特质。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something appear too feminine, or to emphasize feminine qualities more than is appropriate or intended","zh":"使（某人或某物）过度女性化；过分强调女性特质（超过合适或原本的程度）"},"examples":[{"en":"Some critics argue that the film overfeminizes its female lead by focusing only on her appearance.","zh":"一些评论者认为这部电影把女主角过度女性化，只关注她的外表。"},{"en":"Designers tried not to overfeminize the product so it would feel inclusive to more users.","zh":"设计师尽量不把产品过度女性化，让更多用户都觉得被包容。"},{"en":"The translation overfeminized the character by adding words like “delicate” and “sweet” that weren’t in the original.","zh":"译文通过加入原文没有的“娇弱”“甜美”等词，把这个角色过度女性化了。"}]}],"synonyms":["overemphasize femininity","stereotype as feminine","feminize excessively"],"phonetic":"/ˌoʊvɚˈfɛmɪˌnaɪz/","extraExplanation":["“overfeminize”通常出现在媒体批评、性别研究、翻译与市场营销语境里，用来批评对“女性气质”的刻板化或夸张呈现。","这是一个带评价色彩的词：说某人/某作品“overfeminizes”往往暗示不够真实、过度迎合性别刻板印象。写作时注意语气与场合，避免把“女性化”本身当作负面。","相关对比：feminize（使女性化/增加女性参与）、gender-stereotype（性别刻板印象）、objectify（物化）。"]}
{"word":"overfeminized","summary":{"en":"Overfeminized means made to seem excessively feminine, often in a stereotypical or exaggerated way.","zh":"overfeminized 指被塑造成过度女性化的样子，常带有刻板或夸张的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing something (a person, character, style, or product) presented as excessively feminine, often in a stereotypical or exaggerated way.","zh":"形容某事物（人、角色、风格或产品）被塑造成“过于女性化”的样子，常带有刻板印象或夸张的意味。"},"examples":[{"en":"Some critics said the movie’s heroine felt overfeminized, as if her only purpose was to look pretty and be rescued.","zh":"一些影评人说电影女主被塑造成过度女性化，好像她的唯一作用就是漂亮、等人来救。"},{"en":"The packaging looks overfeminized, so the brand risks excluding customers who prefer a more neutral design.","zh":"包装看起来过度女性化，所以品牌可能会把更喜欢中性设计的顾客排除在外。"},{"en":"She pushed back on being labeled overfeminized and said she simply enjoys dresses and makeup.","zh":"她反对别人说她“过度女性化”，并表示自己只是喜欢裙子和化妆。"}]}],"synonyms":["overly feminine","hyper-feminine","excessively feminine","stereotypically feminine"],"phonetic":"/ˌoʊvɚˈfɛmɪˌnaɪzd/","extraExplanation":["“overfeminized”常见于社会评论、媒体研究、营销与文化批评语境，带有评价色彩：不是单纯描述“很女性化”，而是指“过头了、被刻意包装成某种女性刻板形象”。","使用时要注意语气与尊重：形容个人时可能显得在评判对方的性别表达；用于讨论角色设定、广告风格或产品定位通常更中性、更常见。","近义表达常用“hyper-feminine / overly feminine”；相对概念可能是“masculinized（男性化）”“gender-neutral（性别中性）”。"]}
{"word":"overfeminizing","summary":{"en":"“Overfeminizing” means making someone or something seem excessively feminine, often in a stereotyped way.","zh":"“overfeminizing”指把某人或某事过度女性化，常带有强化刻板印象的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making someone or something seem “too feminine,” often by exaggerating traditionally feminine traits, styles, roles, or behaviors (sometimes seen as reinforcing gender stereotypes).","zh":"把某人或某事“过度女性化”，常指夸大传统上被认为女性化的特质、风格、角色或行为（有时被认为在强化性别刻板印象）。"},"examples":[{"en":"Some viewers criticized the costume design for overfeminizing the heroine with impractical high heels.","zh":"一些观众批评服装设计让女主角过度女性化，比如穿不实用的高跟鞋。"},{"en":"The ad was accused of overfeminizing women by suggesting they should always be gentle and quiet.","zh":"这则广告被指责过度女性化女性，暗示她们应该永远温柔安静。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that tends to make a person or group seem overly feminine.","zh":"形容某事物带有让人显得过于女性化的倾向。"},"examples":[{"en":"She avoided the overfeminizing language in the article and used more neutral terms.","zh":"她避免在文章里使用过度女性化的措辞，改用更中性的表达。"},{"en":"The director said the remake would drop the overfeminizing portrayal and give the character more depth.","zh":"导演表示翻拍版会去掉那种过度女性化的塑造，让角色更有深度。"}]}],"synonyms":["stereotyping","hyper-feminizing","sexualizing (in some contexts)","typecasting"],"phonetic":"/ˌoʊvɚˈfɛmɪˌnaɪzɪŋ/","extraExplanation":["“overfeminizing”常出现在媒体评论、性别研究、广告与职场文化讨论中，语气多为批评：认为某种呈现把“女性”限定在单一模板里。","“feminine/女性化”本身并不一定是负面词，但加上“over-”表示“过度、超出合理程度”，强调不自然或带偏见的强化。","在写作中如果担心冒犯，可改用更具体的说法，比如：“stereotyping women / reinforcing gender stereotypes（强化性别刻板印象）”、“portraying her as one-dimensional（把她塑造成单一形象）”。"]}
{"word":"overfertile","summary":{"en":"Overfertile means “too fertile,” often causing excessive growth (like weeds or algae) rather than healthy balance.","zh":"overfertile 表示“过于肥沃/过度能繁殖”，常暗示生长过盛（如杂草或藻类）而破坏生态或种植平衡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too fertile; producing more plants, offspring, or growth than is normal or desirable.","zh":"过于肥沃的；（植物、动物或生长）繁殖/生长得过多，超过正常或理想程度的。"},"examples":[{"en":"In an overfertile field, weeds can spread quickly and crowd out the crops.","zh":"在过于肥沃的田地里，杂草会迅速蔓延，把作物挤掉。"},{"en":"The pond became overfertile after too much fertilizer washed into it.","zh":"大量肥料流入池塘后，池塘变得过于“肥沃”。"}]}],"synonyms":["overproductive","excessively fertile","overrich (soil)"],"phonetic":"/ˌoʊvərˈfɝːt̬aɪl/","extraExplanation":["“over-”是常见前缀，表示“过度/过多”（如 overeat 吃太多、overwork 过度工作）。因此 overfertile 直译就是“过度肥沃/过度能繁殖”。","在环境与农业语境中，过度肥沃常与“营养盐过多”相关，可能引发水体富营养化（algal blooms 藻华），导致缺氧并伤害鱼类等生物。"]}
{"word":"overfertility","summary":{"en":"Overfertility means unusually high fertility (many births) in a person or population, often discussed in demography and public health.","zh":"overfertility 指（个人或群体）生育力/生育水平异常偏高（生得很多），多用于人口学与公共卫生等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition in which fertility (the ability to have children) is unusually high, often higher than what is considered typical or expected for a population or an individual.","zh":"超高生育力；（个人或群体）生育能力异常偏高，常指高于一般或预期水平。"},"examples":[{"en":"Some researchers study overfertility and its links to education, healthcare access, and economic conditions.","zh":"一些研究者会研究超高生育力，以及它与教育、医疗可及性和经济状况的关联。"},{"en":"The report noted signs of overfertility in certain regions, where the average number of births per woman was much higher than the national average.","zh":"报告指出某些地区出现超高生育力的迹象：每位女性的平均生育数远高于全国平均水平。"}]}],"synonyms":["high fertility","very high fertility","excess fertility","elevated fertility"],"phonetic":"/ˌoʊvɚfɚˈtɪləti/","extraExplanation":["“overfertility”在日常口语中不算常见，更常出现在人口学（demography）、公共卫生、社会学或政策讨论中。","它通常是描述性的中性词：用来说明“生育率/生育力偏高”的现象；是否带有评价色彩取决于语境（例如资源压力、公共服务供给、家庭选择等话题）。","注意区分：fertility（生育力/生育率，较广义）与 fecundity（生物学上的繁殖能力，偏专业）。在谈人口时，更常见搭配是 “high fertility / very high fertility” 或 “high birth rate”。"]}
{"word":"overfertilize","summary":{"en":"Overfertilize means to use too much fertilizer (literally), or to overdo support/resources so something is pushed too hard (figuratively).","zh":"overfertilize 指（字面）施肥过量；也可（比喻）对某事投入过多帮助或资源、用力过猛。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to apply too much fertilizer to soil or plants, causing harm or unwanted effects","zh":"给土壤或植物施肥过量，导致伤害或不良后果"},"examples":[{"en":"If you overfertilize your lawn, the grass can turn yellow or burn.","zh":"如果你给草坪施肥过量，草可能会发黄甚至“烧伤”。"},{"en":"These tomatoes stopped flowering because I overfertilized them.","zh":"这些番茄不再开花了，因为我施肥过量。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to try too hard to make something grow or develop by adding too much help, pressure, or resources","zh":"（比喻）为了让某事发展得更快而“用力过猛”，投入过多帮助、压力或资源"},"examples":[{"en":"Sometimes parents overfertilize a child’s schedule with activities, leaving no time to rest.","zh":"有时父母把孩子的日程“安排得太满”，活动过多，反而没有休息时间。"},{"en":"The team overfertilized the project with meetings, and progress slowed down.","zh":"团队给项目“加了太多会议”，结果进度反而变慢。"}]}],"synonyms":["overfeed","overapply fertilizer","overdo","go overboard"],"phonetic":"/ˌoʊvərˈfɝtəˌlaɪz/","extraExplanation":["园艺里“施肥过量”常见的后果包括：叶片边缘发焦（肥害）、根系受损、开花结果变少；还可能因盐分累积影响土壤。","环境层面，过量施肥的氮、磷可能随雨水进入河湖，引发“富营养化”（藻类暴发、缺氧），因此很多地区会建议按说明少量多次施用。"]}
{"word":"overfertilized","summary":{"en":"Overfertilized means “given too much fertilizer” (or figuratively, too much support/attention), causing harm or imbalance.","zh":"overfertilized 指“施肥过量的”（也可比喻“被过度投入/关照的”），从而导致伤害或失衡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having received too much fertilizer, so the soil becomes overly rich and may harm plants or nearby water.","zh":"施肥过量的；肥料用得太多的，导致土壤养分过高，可能伤害植物或污染附近水体。"},"examples":[{"en":"The lawn turned patchy and brown because it was overfertilized.","zh":"草坪变得斑驳发黄，因为施肥过量。"},{"en":"Overfertilized fields can send extra nutrients into rivers after heavy rain.","zh":"施肥过量的农田在大雨后可能把多余养分冲进河流。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Given too much “nourishment” such as attention, money, or help, so it becomes unhealthy or unbalanced.","zh":"（比喻）被“过度滋养”的（如关注、金钱或帮助太多），以至于变得不健康或失衡。"},"examples":[{"en":"Some people think the project was overfertilized with funding but lacked a clear plan.","zh":"有人认为这个项目资金“喂得太足”，但缺乏清晰计划。"},{"en":"An overfertilized ego can grow quickly and then collapse.","zh":"被过度滋养的自我（虚荣心）可能迅速膨胀，随后崩塌。"}]}],"synonyms":["overmanured","overfed (figurative)","overenriched"],"phonetic":"/ˌoʊvərˈfɝtəˌlaɪzd/","extraExplanation":["常见搭配：overfertilized lawn/soil/garden/fields（施肥过量的草坪/土壤/花园/田地）。","词形来源：over-（过度）+ fertilize（施肥/使肥沃）+ -ed（形容词：被……的）。","相关词：overfertilize（v. 施肥过量）；overfertilization（n. 过度施肥）。"]}
{"word":"overfertilizes","summary":{"en":"“Overfertilizes” means “adds too much fertilizer,” often causing harm to plants or the environment.","zh":"“overfertilizes”指“施肥过量”，常会伤害植物或影响环境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a person or process) to apply too much fertilizer to plants or soil, which can harm growth or damage the environment.","zh":"（人或过程）对植物或土壤施用过量肥料，可能伤害植物生长或破坏环境。"},"examples":[{"en":"He overfertilizes his lawn, so the grass turns yellow at the edges.","zh":"他给草坪施肥过量，所以草的边缘发黄。"},{"en":"If a gardener overfertilizes, the roots can burn and the plant may wilt.","zh":"如果园丁施肥过量，根系可能被“烧伤”，植物就会萎蔫。"}]},{"partOfSpeech":"vi.","definition":{"en":"to use too much fertilizer (in general).","zh":"（泛指）施肥过量。"},"examples":[{"en":"In spring, some people overfertilizes without realizing the soil already has enough nutrients.","zh":"春天有些人没意识到土壤养分已足够，却还是施肥过量。"}]}],"synonyms":["overfeed (plants)","apply too much fertilizer","overapply fertilizer","overenrich (the soil)"],"phonetic":"/ˌoʊvərˈfɝt̬əˌlaɪzɪz/","extraExplanation":["“over-”表示“过度、超过需要”。园艺语境中，施肥过量常见后果包括叶片发黄、植株徒长、开花变少，甚至“肥害”（根部被高浓度盐分灼伤）。","环境层面，过量肥料（尤其含氮、磷）可能被雨水冲走进入河湖，引发藻类暴发（富营养化）。"]}
{"word":"overfertilizing","summary":{"en":"Overfertilizing means using too much fertilizer, which can damage plants and the environment.","zh":"overfertilizing 指施肥过量，会伤害植物并影响环境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Applying too much fertilizer to soil or plants, which can harm plant health and pollute water.","zh":"给土壤或植物施肥过量，可能伤害植物并污染水体。"},"examples":[{"en":"Overfertilizing can burn plant roots and turn the leaf tips brown.","zh":"施肥过量会灼伤植物根系，并让叶尖变褐。"},{"en":"He realized he was overfertilizing when the lawn grew fast but looked weak and patchy.","zh":"他发现自己施肥过量：草坪长得很快，但看起来虚弱、斑驳。"},{"en":"To prevent overfertilizing, follow the label directions and measure carefully.","zh":"为避免施肥过量，请按标签说明操作并仔细计量。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or habit of using excessive fertilizer.","zh":"施肥过量的行为或习惯。"},"examples":[{"en":"Overfertilizing is common when people think “more food means faster growth.”","zh":"当人们以为“肥越多长得越快”时，施肥过量就很常见。"},{"en":"Overfertilizing in spring can lead to weak growth that attracts pests.","zh":"春季施肥过量可能导致枝叶虚弱，更容易招虫。"}]}],"synonyms":["excessive fertilizing","overfeeding (plants)","fertilizing too heavily"],"phonetic":"ˌoʊvɚˈfɝtəˌlaɪzɪŋ","extraExplanation":["“over-”表示“过度、超过正常范围”。因此 overfertilizing 字面意思就是“施肥过度”。","施肥过量的常见后果包括：肥害（叶尖焦枯、根系受伤）、徒长（长得快但不结实）、土壤盐分累积，以及雨水径流把氮磷带入河湖造成富营养化（藻华）。","更安全的做法：先做土壤检测；选择缓释肥；少量多次；浇水帮助稀释并把肥带入土层；严格按包装标注的用量与频率。"]}
{"word":"overfervent","summary":{"en":"Overfervent means excessively enthusiastic or zealous, often to an uncomfortable or inappropriate degree.","zh":"overfervent 指“过于热情/狂热”，热情强度过头，常带轻微批评或提醒意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too enthusiastic, passionate, or zealous; showing more intensity than is appropriate or comfortable.","zh":"过于热情的；过于狂热/热衷的（热情强度超过合适或让人舒服的程度）。"},"examples":[{"en":"His overfervent praise made his coworkers feel awkward.","zh":"他过于热烈的称赞让同事们感到尴尬。"},{"en":"The coach warned the team not to become overfervent and lose focus.","zh":"教练提醒队员不要过于亢奋而失去专注。"},{"en":"An overfervent online debate can quickly turn personal.","zh":"过于激烈的网络争论很快就会变得人身化。"}]}],"synonyms":["overzealous","too enthusiastic","overenthusiastic","excessive","fanatical"],"phonetic":"/ˌoʊvərˈfɝvənt/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当范围”。因此 overfervent 字面上就是“过度热烈/过度狂热”。在语气上，它通常带有轻微的批评或提醒意味，而不只是中性地说“很热情”。","与其相比，enthusiastic（热情的）多为褒义；fervent（热烈的）也常偏褒义，但 overfervent 明确强调“过头了”。"]}
{"word":"overfervently","summary":{"en":"“Overfervently” means doing something with excessive enthusiasm or zeal.","zh":"“overfervently”指以过度的热情或热衷去做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too enthusiastic, emotional, or zealous (more than is appropriate for the situation).","zh":"过于热情地；过分热烈地；过度热衷地（超过场合所需要的程度）。"},"examples":[{"en":"He overfervently praised the manager, which made his coworkers uncomfortable.","zh":"他过于热烈地夸奖经理，让同事们感到不舒服。"},{"en":"She apologized overfervently for a small mistake.","zh":"她为一个小错误过分郑重地道歉。"},{"en":"The fans cheered overfervently, drowning out the speaker.","zh":"粉丝们欢呼得过于热烈，把演讲者的声音都盖住了。"}]}],"synonyms":["overzealously","too enthusiastically","excessively","overenthusiastically"],"phonetic":"/ˌoʊvɚˈfɝv(ə)ntli/","extraExplanation":["“overfervently”由 over-（过度）+ fervently（热诚地）构成，语气通常带一点负面评价：不仅是“很热情”，而是“热情到不合时宜/让人不自在”。在写作中常用来暗示讨好、夸张、用力过猛，甚至显得不真诚。"]}
{"word":"overferventness","summary":{"en":"Overferventness means excessive zeal or overly intense enthusiasm.","zh":"overferventness 指“过度热情/过度狂热”，即热忱太强、过于激烈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too fervent or overly zealous; excessive enthusiasm that may seem intense, pushy, or unreasonable.","zh":"过度热情/过度狂热的状态；热忱太强，可能显得激进、咄咄逼人或不合情理。"},"examples":[{"en":"Her overferventness about the cause made some teammates feel pressured.","zh":"她对这项事业的过度热情让一些队友感到有压力。"},{"en":"The speaker’s overferventness turned a friendly discussion into an argument.","zh":"演讲者的过度激动把一场友善的讨论变成了争吵。"}]}],"synonyms":["overzealousness","excessive zeal","excessive enthusiasm","overenthusiasm","undue fervor"],"phonetic":"/ˌoʊvɚˈfɝːvəntnəs/","extraExplanation":["“overferventness”在现代英语中很少见，很多情况下更常用、更自然的表达是“excessive zeal / overzealousness / too much fervor”。","构词法：over-（过度）+ fervent（热忱的）+ -ness（名词后缀，表示“……的状态/性质”）。在写作中使用时要注意语体：它更像是临时造词或修辞性用法。"]}
{"word":"overfestoon","summary":{"en":"Overfestoon means to decorate something with too many hanging ornaments or garlands.","zh":"Overfestoon 指用过多的垂挂装饰物（花环、彩带、灯饰等）把某物装饰得过头。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate something with too many garlands, ribbons, lights, or other hanging ornaments; to festoon excessively","zh":"（用花环、彩带、灯饰等）过度装饰；装饰得过于繁复、过于花哨"},"examples":[{"en":"They overfestooned the room with balloons and streamers, so it felt crowded instead of festive.","zh":"他们用气球和彩带把房间装饰得太多了，结果显得拥挤而不是喜庆。"},{"en":"The director warned the crew not to overfestoon the stage with flowers because it would distract the audience.","zh":"导演提醒工作人员别用太多花把舞台装得过头，否则会分散观众注意力。"}]}],"synonyms":["overdecorate","overadorn","overembellish","garnish too heavily"],"phonetic":"/ˌoʊvərfɛˈstuːn/","extraExplanation":["“over-”这个前缀常表示“过度、过分”（如 overcook 煮过头、overuse 过度使用）。因此 overfestoon 就是“festoon（用垂挂装饰物装点）+ 过度”。","“festoon”原意常指把花环、彩带等“成串垂挂”起来装饰；overfestoon 带有轻微的批评语气，暗示装饰太多、显得俗气或累赘。"]}
{"word":"overfew","summary":{"en":"“Overfew” is a rare, nonstandard word meaning “too few.” In modern English, use “too few” or “not enough” instead.","zh":"“overfew”是很少见的非标准词，意思是“太少/不足”。现代英语更常用“too few”或“not enough”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Too few; fewer than needed.","zh":"（罕见／非标准用法）太少；少于需要的数量。"},"examples":[{"en":"There were overfew chairs for the guests, so some people had to stand.","zh":"椅子数量太少，不够客人坐，所以有些人只能站着。"},{"en":"If your supplies are overfew, bring extras before you start the trip.","zh":"如果你的补给太少，出发前请多带一些。"}]}],"synonyms":["too few","not enough","insufficient","scarce"],"phonetic":"/ˌoʊvɚˈfjuː/","extraExplanation":["“overfew”在现代英语里几乎不用，很多读者会觉得不自然，甚至把它当作拼写错误。表达“太少/不足”更地道的说法是：too few, not enough, insufficient, in short supply。","如果你想表达“人数/数量比预期少”，也可以说：fewer than expected, less than needed。"]}
{"word":"overfierce","summary":{"en":"Overfierce means excessively fierce or aggressive.","zh":"overfierce 表示“过于凶猛/激烈/好斗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too fierce, intense, or aggressive; fiercer than is appropriate or necessary.","zh":"过于凶猛的；过于激烈或好斗的；强烈到不合适的程度。"},"examples":[{"en":"His overfierce reaction turned a small disagreement into an argument.","zh":"他过于激烈的反应把小小的分歧变成了争吵。"},{"en":"The coach warned the team not to play with an overfierce attitude.","zh":"教练警告球队不要以过于凶狠的态度比赛。"},{"en":"An overfierce tone can make helpful feedback sound like an attack.","zh":"过于强硬的语气会让有用的反馈听起来像攻击。"}]}],"synonyms":["overly fierce","too fierce","excessively aggressive","overaggressive","overviolent"],"phonetic":"/ˌoʊvɚˈfɪrs/","extraExplanation":["“over-”是常见前缀，表示“过度、过分”。因此 overfierce = fierce（凶猛/激烈）+ over-（过度）。在现代英语里，这个词不算常用，更常见的说法是 too fierce / overly fierce / excessively aggressive。","在较旧或文学化的语境中，你可能会见到类似的复合形容词（带 over- 的词）用来强调情绪或行动“强过头”，带一点评价色彩：不只是强烈，而且“强到不合时宜”。"]}
{"word":"overfiercely","summary":{"en":"“Overfiercely” means “too fiercely”—excessively aggressive or intense in manner.","zh":"overfiercely 表示“过于凶猛/激烈地”，强调强度过头、过度强硬。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too fierce, aggressive, intense, or forceful; excessively fiercely.","zh":"过于凶猛地；过于激烈/强硬地；过度地（带有“太过头”的感觉）。"},"examples":[{"en":"He spoke overfiercely, and the room went quiet.","zh":"他说话太强硬了，房间里一下子安静下来。"},{"en":"The team defended overfiercely and ended up committing too many fouls.","zh":"球队防守过于凶狠，结果犯规太多。"},{"en":"She protected her privacy overfiercely, even from close friends.","zh":"她对隐私保护得过于强硬，甚至对亲密朋友也是如此。"}]}],"synonyms":["too fiercely","overly fiercely","excessively","aggressively","intensely"],"phonetic":"/ˌoʊvərˈfɪrsli/","extraExplanation":["“over-”在英语里常表示“过度、太……”，带有负面或提醒的语气（如 overreact 反应过度，overwork 过度工作）。因此 overfiercely = fiercely（凶猛/激烈地）+ over-（过度）+ -ly（副词）。","这个词比较少见，更常见的表达是 “too fiercely / overly fiercely / excessively fiercely”。写作中用 overfiercely 往往是为了强调“强度过头、适得其反”的感觉。"]}
{"word":"overfierceness","summary":{"en":"“Overfierceness” means excessive fierceness—being too aggressive or harsh.","zh":"“overfierceness”指“过度的凶猛/强硬”，即太过咄咄逼人或严厉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Excessive fierceness; being too aggressive, intense, or harsh in behavior, attitude, or style.","zh":"（不常用）过度的凶猛/强硬；在行为、态度或表达方式上过于激烈、咄咄逼人或严厉。"},"examples":[{"en":"The coach warned that overfierceness could intimidate new players instead of motivating them.","zh":"教练提醒说，过度强硬可能会吓到新队员，而不是激励他们。"},{"en":"Her overfierceness in meetings made collaboration difficult.","zh":"她在会议中过度强势，让合作变得很困难。"},{"en":"The editorial’s overfierceness distracted readers from its main argument.","zh":"那篇社论的过度激烈语气让读者忽略了它的核心论点。"}]}],"synonyms":["excessive aggression","over-aggressiveness","undue ferocity","excessive harshness","belligerence"],"phonetic":"/ˌoʊvɚˈfɪrsnəs/","extraExplanation":["“overfierceness”由 over-（过度）+ fierceness（凶猛、激烈）构成，属于很少见、偏自造或临时造词的表达。更常见的说法包括：“excessive aggression / excessive harshness / undue ferocity / over-aggressiveness”。","使用建议：若用于正式写作，通常选用更常见的词组会更自然；若用于文学或修辞，使用“overfierceness”可以强调“过火”“太过”的评价色彩。"]}
{"word":"overfile","summary":{"en":"“Overfile” is a rare verb meaning either to file too many documents or (in US legal talk) to file additional, often more serious, charges.","zh":"“overfile”是个较少见的动词，可指“过度归档/塞入过多文件”，也可指（美国法律语境）“追加指控（常更重）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To file too many documents, or to put more papers into a folder/system than it can handle; to overfill with filings.","zh":"（罕见）过度归档；把太多文件归入同一文件夹/系统，导致“塞太满”。"},"examples":[{"en":"If you overfile the cabinet, the folders will tear and pages will get lost.","zh":"如果你把文件柜过度归档，文件夹会被撑破，纸张也容易弄丢。"},{"en":"Try not to overfile one case—keep only what you truly need.","zh":"尽量别把一个案子的材料归档得过多——只保留真正需要的。"}]},{"partOfSpeech":"v.","definition":{"en":"(US legal, informal) To file additional charges—often more serious ones—against a person after an initial charge has already been filed.","zh":"（美国法律语境，非正式）在已起诉的基础上再次加诉/追加（往往更重的）指控。"},"examples":[{"en":"The defense argued that the prosecutor chose to overfile to pressure the defendant into a plea deal.","zh":"辩方认为检方追加更重指控是为了逼被告认罪协商。"},{"en":"They were first charged with a misdemeanor, and later the state overfiled a felony.","zh":"他们一开始被控轻罪，后来州方又追加了重罪指控。"}]}],"synonyms":["overfill (a file)","file excessively","add charges","bring additional charges"],"phonetic":"/ˌoʊvɚˈfaɪl/","extraExplanation":["“overfile”在日常英语里不常见，很多场合人们会用更常用的词来表达，比如用“file too many documents / overfill the file”表示“归档太多”，用“add/bring additional charges”表示“追加指控”。","在美国刑事司法语境里，“overfile”常带一点批评意味：暗示检方“指控堆叠”，可能用来增加谈判筹码或施压。具体是否合理要看案件事实与当地程序规则。"]}
{"word":"overfill","summary":{"en":"Overfill means to fill something too full, often causing it to spill or overflow.","zh":"Overfill 指把容器装得过满，常导致洒出或溢出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put too much of something into a container so it becomes too full (and may spill)","zh":"把……装得太满；装过量（以至可能溢出或洒出）"},"examples":[{"en":"Don’t overfill the cup, or it will spill when you walk.","zh":"杯子别装太满，不然你走路时会洒出来。"},{"en":"He overfilled the gas tank and gasoline dripped onto the ground.","zh":"他把油箱加得太满，汽油滴到了地上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too full; to overflow because there is too much inside","zh":"变得太满；因内容物过多而溢出"},"examples":[{"en":"The bathtub started to overfill when the phone rang.","zh":"电话一响，浴缸就开始因水太多而溢出来。"}]}],"synonyms":["overload","fill too full","spill over"],"phonetic":"/ˌoʊvɚˈfɪl/","extraExplanation":["“overfill”强调“把容器装得超过合适容量（多半是人为动作）”；“overflow”更强调“液体/内容物自己溢出（结果状态）”。例如：Don’t overfill the glass.（别把杯子倒太满） vs. The glass overflowed.（杯子溢出来了）","常见搭配：overfill a cup/glass/bottle（把杯子/瓶子装太满）、overfill the bathtub（把浴缸放水放到太满）、overfill a form（表格填得太满/超出空间，较少见但可用）。"]}
{"word":"overfilled","summary":{"en":"“Overfilled” means too full, or the past form of “overfill” (to fill something too much).","zh":"“overfilled”表示“装得太满的”，也可作动词“overfill”的过去式/过去分词（把……装得过满）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too full; filled beyond a comfortable or safe level.","zh":"装得太满的；超过舒适或安全程度的。"},"examples":[{"en":"The trash can was overfilled, so the lid wouldn’t close.","zh":"垃圾桶装得太满，盖子都盖不上。"},{"en":"Don’t drink from an overfilled cup while walking.","zh":"走路时不要喝装得太满的杯子，容易洒出来。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “overfill”: to put too much into a container or space.","zh":"“overfill”的过去式/过去分词：把……装得过满。"},"examples":[{"en":"I overfilled the suitcase and couldn’t zip it up.","zh":"我把行李箱塞得太满，拉链拉不上。"},{"en":"The machine stopped because someone had overfilled the tank.","zh":"机器停了，因为有人把油箱加得过满。"}]}],"synonyms":["too full","stuffed","crammed","overstuffed","overpacked"],"phonetic":"/ˌoʊvərˈfɪld/","extraExplanation":["“overfilled”常作形容词用，描述结果状态（太满了）。如果强调动作本身，常用动词“overfill”（overfill/overfilled/overfilled）。","常见搭配：overfilled cup/bottle/bin/tank/suitcase（装得过满的杯子/瓶子/垃圾桶/储罐/行李箱）。"]}
{"word":"overfilling","summary":{"en":"Overfilling means filling something too full so it may spill, leak, or not work properly.","zh":"Overfilling 指把东西装得过满，可能导致溢出、渗漏或影响正常运作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or situation of putting too much of something into a container, space, or system so it becomes too full","zh":"（往容器、空间或系统里）装得过满；过量填充"},"examples":[{"en":"Overfilling the cup made coffee spill onto the table.","zh":"杯子装得太满，咖啡就洒到桌子上了。"},{"en":"Overfilling the washing machine can reduce how well your clothes get cleaned.","zh":"洗衣机塞得太满，会降低衣服洗干净的效果。"},{"en":"The technician warned that overfilling the fuel tank could cause leaks.","zh":"技师警告说油箱加得过满可能会造成渗漏。"}]},{"partOfSpeech":"v.","definition":{"en":"filling something too much (the -ing form of “overfill”)","zh":"把……装得过满（动词 overfill 的 -ing 形式）"},"examples":[{"en":"You’re overfilling the bag—try using a bigger one.","zh":"你把袋子装得太满了——换个大一点的吧。"},{"en":"Stop overfilling the printer tray; it may jam.","zh":"别把打印机纸盒塞太满；可能会卡纸。"}]}],"synonyms":["overloading","overstuffing","overpacking","overfilling (up)","filling too full"],"phonetic":"ˌoʊvərˈfɪlɪŋ","extraExplanation":["“Overfilling”常见于安全或操作说明（如油箱、锅炉、洗衣机、打印机纸盒等）。很多设备会留有“最大容量/Max line”，超过就可能溢出、卡住、影响性能，甚至带来安全风险。"]}
{"word":"overfills","summary":{"en":"“Overfills” means fills something too full, or becomes too full.","zh":"“overfills”表示把……装得太满，或（容器）变得过满、溢满。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put too much into a container so it becomes too full (often causing spilling or leaving no space)","zh":"把……装得太满；过量填充（常导致溢出或没有空间）"},"examples":[{"en":"If the machine overfills the bottle, the drink may spill during shipping.","zh":"如果机器把瓶子灌得太满，运输过程中饮料可能会洒出来。"},{"en":"The bathtub overfills when the drain is blocked.","zh":"下水道堵住时，浴缸会溢满。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a container or space) to become too full","zh":"（容器或空间）变得过满；溢满"},"examples":[{"en":"The sink overfills in seconds if you leave the tap on.","zh":"如果一直开着水龙头，水槽几秒钟就会溢满。"},{"en":"During heavy rain, the canal overfills and floods nearby roads.","zh":"大雨时，运河会涨满并淹没附近道路。"}]}],"synonyms":["overfill","fill too full","overload","stuff","overstuff"],"phonetic":"/ˌoʊvərˈfɪl/","extraExplanation":["“overfills” 是动词 “overfill” 的第三人称单数现在时：He/She/It overfills…（他/她/它会装得太满/会溢满）。也常见于说明书或设备故障描述中，比如 “The washer overfills.”"]}
{"word":"overfilm","summary":{"en":"Overfilm means to add an extra film coating to something, or (less commonly) to film too much.","zh":"Overfilm 指在物体表面额外覆一层薄膜/包膜；不太常用时也可指拍摄素材过多。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover or coat something with an extra layer of thin film (plastic, protective film, or a film-forming coating)","zh":"（用薄膜）在……上再覆一层/额外包覆一层（如塑料膜、保护膜或成膜涂层）"},"examples":[{"en":"The tablets are overfilmed to protect them from moisture.","zh":"这些药片会再进行包膜处理，以防受潮。"},{"en":"After printing, the labels were overfilmed to prevent scratching.","zh":"印刷后，标签又覆了一层膜以防刮花。"}]},{"partOfSpeech":"vt.","definition":{"en":"to film or record too much; to add more footage than necessary (less common)","zh":"（不太常用）拍摄过多；录制过量素材"},"examples":[{"en":"We overfilmed the event and spent days editing it down.","zh":"我们把活动拍了太多素材，后来花了好几天才剪到合适长度。"}]}],"synonyms":["laminate","coat","overcoat","cover","film too much","shoot too much footage"],"phonetic":"ˌoʊvɚˈfɪlm","extraExplanation":["“overfilm”不是日常高频词，更常见的表达是“laminate（覆膜/压膜）”“apply a protective film（贴保护膜）”“overcoat（再涂一层）”。","在制药与包装领域里，它常指在原有涂层或表面之上“再做一层成膜包覆”，用来防潮、防刮、增加光泽或改善手感。","在影视语境里表示“拍多了”，更口语的说法通常是“we shot too much footage / we got way too much coverage”。"]}
{"word":"overfilter","summary":{"en":"“Overfilter” means filtering too much so that important details or quality are lost.","zh":"“overfilter”指过滤过度，导致重要细节或质量被削弱/丢失。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to filter something too much, removing more material or information than intended (often causing loss of quality, detail, or usefulness)","zh":"过度过滤；过滤得太多（常导致细节、质量或有用信息被误删）"},"examples":[{"en":"If you overfilter the coffee, it can taste weak and flat.","zh":"如果咖啡过滤过度，味道会变得淡而无层次。"},{"en":"The app may overfilter comments and delete harmless messages.","zh":"这个应用可能会过度过滤评论，把无害的信息也删掉。"},{"en":"Don’t overfilter the photo—some natural texture is good.","zh":"别把照片过度滤镜处理——保留一些自然纹理更好。"}]},{"partOfSpeech":"v.","definition":{"en":"to apply filtering so strongly that signals or data become distorted or less accurate","zh":"（信号/数据）过度滤波，导致失真或精度下降"},"examples":[{"en":"Overfiltering can smooth the curve so much that real changes disappear.","zh":"过度滤波会把曲线抹得太平，真实变化反而看不见了。"},{"en":"Engineers checked the settings to make sure the sensor data wasn’t overfiltered.","zh":"工程师检查了设置，确保传感器数据没有被过度滤波。"}]}],"synonyms":["overprocess","oversmooth","overstrain","filter too much","overmoderate"],"phonetic":"/ˌoʊvɚˈfɪltɚ/","extraExplanation":["“overfilter”不是非常常见的日常词，更常见的是用“overfiltering（过度过滤/过度滤波）”来描述这种问题。","在不同语境里它指的“过滤”不一样：饮品/水处理指物理过滤；照片/音频指软件处理；数据与工程领域常对应“滤波（filtering）”；社交平台语境里常指“内容审核过严”。"]}
{"word":"overfine","summary":{"en":"“Overfine” means too fine, especially in processing or grinding; it can also mean to make something too fine.","zh":"“Overfine”表示“过细的”（常用于研磨/加工等语境）；也可作动词表示“把……弄得过细”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of something ground, processed, or made) too fine; finer than is useful or desirable.","zh":"（指研磨、加工或制作的东西）过细的；细到不实用或不理想的。"},"examples":[{"en":"The flour was overfine, so the cake turned out dense instead of fluffy.","zh":"面粉磨得过细，所以蛋糕变得扎实而不松软。"},{"en":"Try not to make the coffee grounds overfine, or the drink may taste bitter.","zh":"咖啡粉别磨得过细，不然可能会发苦。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something too fine by grinding, filtering, or refining it excessively.","zh":"把……弄得过细；过度研磨/过滤/精炼（导致细得过头）。"},"examples":[{"en":"If you overfine the powder, it may clump when you add water.","zh":"如果把粉末弄得过细，加水时可能会结块。"},{"en":"They accidentally overfined the mixture during processing.","zh":"他们在加工过程中不小心把混合物弄得过细了。"}]}],"synonyms":["too fine","overly fine","over-refined","excessively fine","ultrafine (in some contexts)"],"phonetic":"/ˌoʊvɚˈfaɪn/","extraExplanation":["“overfine”在现代英语里比较少见，更常见的表达是“too fine”或“overly fine”。在技术或工艺语境（研磨、过滤、粉体、面粉、咖啡粉等）中更容易见到。","有时也会写作带连字符的“over-fine”，尤其在说明书、工艺参数或材料描述里。"]}
{"word":"overfinished","summary":{"en":"“Overfinished” means finished too much—overly polished or detailed in a way that hurts the natural look or impact.","zh":"“overfinished”指“完成过头、过度精修”，过分打磨导致不自然或削弱效果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Finished too much or to an excessive degree; made so polished, refined, or detailed that it looks unnatural, fussy, or less effective.","zh":"过度完成的；过分精雕细琢的（以至于显得不自然、太花哨或反而影响效果）。"},"examples":[{"en":"The photo looks overfinished—every detail is so sharp that it feels unnatural.","zh":"这张照片看起来过度处理了——细节锐到不自然。"},{"en":"Her painting was strong at first, but it became overfinished after she kept adding small corrections.","zh":"她的画一开始很有力量，但不断加小修改后就变得过度完成了。"},{"en":"The design feels overfinished for a simple brand; a cleaner look would work better.","zh":"这个设计对一个简单品牌来说显得过于精致；更干净的风格会更合适。"}]}],"synonyms":["overworked","overpolished","overrefined","overprocessed","fussy"],"phonetic":"/ˌoʊvərˈfɪnɪʃt/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过需要的程度”（如 overwork 过度工作、overthink 想太多）。因此 overfinished 常用来表达“打磨过头”的负面评价，尤其在艺术、设计、摄影、写作等领域。","在艺术评论里，overfinished 往往暗示作品失去了原本的生动感或“呼吸感”，因为过多修饰让画面/语言变得僵硬、做作。"]}
{"word":"overfish","summary":{"en":"To overfish means to catch fish faster than the population can recover.","zh":"overfish 指以超过鱼群自然恢复速度的方式捕鱼，即过度捕捞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to catch fish in a way that removes too many, so the fish population cannot replace itself (often harming the ecosystem)","zh":"过度捕捞；以超过鱼类自然繁殖能力的方式捕鱼（常会破坏生态系统）"},"examples":[{"en":"Some coastal waters have been overfished for decades.","zh":"一些近海水域已经被过度捕捞了几十年。"},{"en":"If we overfish this species, it may disappear from the region.","zh":"如果我们过度捕捞这个物种，它可能会从这个地区消失。"},{"en":"Many countries are trying to stop companies from overfishing.","zh":"许多国家正试图阻止企业过度捕捞。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a place or fishery) to be fished too heavily","zh":"（某片水域/渔场）被过度捕捞"},"examples":[{"en":"The bay is overfished, so local fishermen now travel farther offshore.","zh":"这个海湾被过度捕捞了，所以当地渔民现在要去更远的外海。"},{"en":"Scientists warned that the area could become overfished within a few years.","zh":"科学家警告说，这片海域可能在几年内就会被过度捕捞。"}]}],"synonyms":["overharvest","deplete fish stocks","fish too heavily"],"phonetic":"ˌoʊvərˈfɪʃ","extraExplanation":["“overfish”常出现在环保与政策语境里，和“sustainable fishing（可持续捕捞）”“fish stocks（鱼类资源量）”“catch limits/quotas（捕捞限额/配额）”等搭配使用。","常见近义表达：overharvest（过度采收/过度捕捞，范围更广）。相关词：overfishing（n. 过度捕捞，最常见的名词形式）。"]}
{"word":"overfished","summary":{"en":"Overfished describes seas or fish populations that have been fished too heavily, reducing fish numbers.","zh":"Overfished 指海域或鱼类资源被过度捕捞，导致鱼群数量下降。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an area of ocean or a fish species) fished too much, so fish numbers become too low and cannot recover easily.","zh":"（指某片海域或某种鱼类）被过度捕捞的，导致鱼群数量过低，难以恢复。"},"examples":[{"en":"Many coastal waters are now overfished, so catches are smaller each year.","zh":"许多沿海海域现在被过度捕捞，因此每年的渔获量都更少。"},{"en":"Bluefin tuna is one of the most overfished species in some regions.","zh":"在一些地区，蓝鳍金枪鱼是被过度捕捞最严重的物种之一。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overfish”: to catch too many fish from a place or of a species.","zh":"“overfish”的过去式/过去分词：对某地或某物种捕捞过度。"},"examples":[{"en":"The fleet overfished the area for years before stricter rules were introduced.","zh":"在更严格的规定出台前，渔船队多年对该海域进行了过度捕捞。"},{"en":"If a habitat is overfished, the ecosystem can change in unexpected ways.","zh":"如果一个栖息地被过度捕捞，生态系统可能会以意想不到的方式改变。"}]}],"synonyms":["overexploited","depleted","overharvested"],"phonetic":"/ˌoʊvɚˈfɪʃt/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超过适当程度”（如: overwork 过度工作，overeat 吃太多）。因此 overfished 直观理解就是“捕捞过度导致资源不足”。","在新闻与环保语境中，overfished 常与可持续渔业（sustainable fishing）、配额（quota）、禁渔期（fishing ban/closed season）、副渔获（bycatch）等词一起出现。"]}
{"word":"overfishes","summary":{"en":"“Overfishes” means “catches too many fish, faster than the fish can replace themselves,” harming fish populations.","zh":"“Overfishes”指“过度捕捞”，即捕鱼速度超过鱼类自然补充速度，从而破坏鱼群资源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to catch fish faster than they can reproduce, damaging fish populations (third-person singular present: overfishes)","zh":"过度捕捞（以超过鱼类自然繁殖速度的方式捕鱼，导致鱼群数量下降；第三人称单数：overfishes）"},"examples":[{"en":"If a country overfishes its coastal waters, local fish populations can collapse.","zh":"如果一个国家在近海过度捕捞，当地鱼类种群可能会崩溃。"},{"en":"The company overfishes the area each season, so fewer fish return the next year.","zh":"这家公司每个季节都在该海域过度捕捞，所以下一年回来的鱼更少。"}]}],"synonyms":["overexploit","deplete (fish stocks)","harvest unsustainably"],"phonetic":"/ˌoʊvɚˈfɪʃɪz/","extraExplanation":["“overfish”常用于环保与渔业管理语境，强调“可持续性（sustainability）”：不是单纯“捕很多鱼”，而是“捕得超过生态系统能补回来的速度”。常见搭配有 overfish a river/reef/stock（过度捕捞某条河/珊瑚礁/某种鱼类资源）。","形式提示：overfishes = 第三人称单数现在时；过去式和过去分词是 overfished；现在分词是 overfishing。"]}
{"word":"overfishing","summary":{"en":"Overfishing means catching fish too quickly for populations to recover, leading to fewer fish and ecological harm.","zh":"overfishing 指过度捕捞：捕捞过快使鱼群无法恢复，导致数量下降并破坏生态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of catching fish faster than fish populations can reproduce, causing the number of fish in the ocean (or a lake/river) to decline.","zh":"过度捕捞；捕捞速度超过鱼类繁殖与补充速度，导致海洋（或湖泊/河流）鱼群数量下降。"},"examples":[{"en":"Overfishing has reduced tuna populations in many parts of the world.","zh":"过度捕捞使世界许多地区的金枪鱼数量减少。"},{"en":"Governments may set catch limits to prevent overfishing.","zh":"政府可能会设定捕捞限额来防止过度捕捞。"}]}],"synonyms":["overharvesting (fish)","unsustainable fishing"],"phonetic":"/ˌoʊvɚˈfɪʃɪŋ/","extraExplanation":["overfishing 常见于环境与政策语境，强调“不可持续”的捕捞：如果长期超过鱼群自然补充能力，就会影响生态平衡、渔业生计与食物供应。","相关概念：sustainable fishing（可持续捕捞）、fish stock（鱼类资源/鱼群存量）、bycatch（兼捕/误捕，指非目标物种被捕获）。"]}
{"word":"overfit","summary":{"en":"“Overfit” means a model learns training data too closely and then performs worse on new data.","zh":"Overfit 指模型对训练数据学得过头，导致对新数据表现变差（过拟合）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a model in statistics or machine learning) to learn the training data too closely, including noise, so it performs poorly on new data.","zh":"（统计/机器学习中）指模型把训练数据学得“太死”，连噪声和偶然性也记住了，导致对新数据表现变差。"},"examples":[{"en":"If you overfit your model, accuracy on the training set may look great, but test performance will drop.","zh":"如果模型过拟合，训练集准确率可能很好，但在测试集上的表现会下降。"},{"en":"We added regularization to reduce overfitting.","zh":"我们加入正则化来减少过拟合。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a model) showing the problem of overfitting; too complex for the amount or quality of data.","zh":"（形容模型）过拟合的；对数据量或数据质量来说过于复杂的。"},"examples":[{"en":"The decision tree is overfit, so it doesn’t generalize well.","zh":"这棵决策树过拟合了，所以泛化能力不好。"},{"en":"An overfit model can look impressive in demos but fail in real use.","zh":"过拟合的模型在演示中可能很亮眼，但实际使用会翻车。"}]}],"synonyms":["overtrain (sometimes used)","fit the noise","memorize the training data"],"phonetic":"/ˌoʊvərˈfɪt/","extraExplanation":["“over-”表示“过度/太多”，“fit”在这里指“拟合数据”。所以 overfit 字面意思是“过度拟合”。","常见对策：用更多数据、简化模型、交叉验证、早停（early stopping）、正则化（regularization）、dropout（神经网络）等。","相关对比：overfit（过拟合） vs. underfit（欠拟合：模型太简单，训练集和测试集都表现差）。"]}
{"word":"overfix","summary":{"en":"Overfix means to fix or correct something too much, often making it worse or unnecessarily trying to solve a problem.","zh":"Overfix 指“修/改过头”或“过度想解决问题”，常导致变糟或显得多余。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fix, adjust, or correct something too much, so that it becomes worse, unnatural, or causes new problems","zh":"过度修理／过度调整／矫枉过正，反而把事情弄糟或带来新问题"},"examples":[{"en":"I tried to overfix the wobbly chair, and now one leg is shorter than the others.","zh":"我想把那把摇晃的椅子修得更稳，结果修过头了，现在有一条椅子腿比其他的短。"},{"en":"Don’t overfix your essay—too many changes can make your writing less clear.","zh":"别把作文改过头了——改动太多反而会让表达更不清楚。"}]},{"partOfSpeech":"v.","definition":{"en":"to focus too much on solving a problem, especially by giving unnecessary advice or trying to control the outcome","zh":"（尤指）过度执着于“解决问题”，不断给建议或强行介入，反而不必要"},"examples":[{"en":"When my friend was upset, I overfixed instead of just listening.","zh":"朋友难过的时候，我一直忙着“帮他解决”，没有好好倾听。"},{"en":"Managers sometimes overfix small issues and miss the bigger picture.","zh":"管理者有时会对小问题过度介入，反而忽略了大局。"}]}],"synonyms":["overcorrect","overdo","tinker (too much)","overthink (in some contexts)"],"phonetic":"/ˌoʊvɚˈfɪks/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、太多”（例如 overwork 过度工作、overthink 想太多）。因此 overfix 通常带有负面含义：不是“修好”，而是“修过头”。","overfix 不是特别正式或常见的词，更常见的表达有 overcorrect（矫枉过正）、tinker too much（瞎折腾/折腾过度）、overdo it（做过头）。"]}
{"word":"overflap","summary":{"en":"“Overflap” is not standard; you probably mean “overlap,” meaning to partly cover the same space/time or to share some common part.","zh":"“overflap”不是标准用法；你可能想说“overlap”，表示空间/时间上的部分重叠或内容上的交集。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely a misspelling) To partly cover the same area or happen at the same time; to have something in common.","zh":"（可能是拼写错误）部分重叠；在时间上同时发生；有共同之处。"},"examples":[{"en":"The two circles overlap in the middle.","zh":"两个圆在中间部分重叠。"},{"en":"My work hours overlap with your class time.","zh":"我的工作时间和你的上课时间有重叠。"},{"en":"Their interests overlap, so they became friends quickly.","zh":"他们的兴趣有重合，所以很快成了朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"An area or period where two things partly cover the same space or time; a shared part.","zh":"重叠部分；交叠区域；时间上的重合。"},"examples":[{"en":"There is a lot of overlap between the two courses.","zh":"这两门课的内容有很多重叠。"},{"en":"We should avoid overlap in responsibilities.","zh":"我们应该避免职责重叠。"}]}],"synonyms":["intersect","cross","coincide","overlay","share common ground"],"phonetic":"/ˌoʊvərˈlæp/","extraExplanation":["“overflap”在英语里并不是常见或标准拼写；你很可能想写的是“overlap”。","词源上，over- 表示“在……之上/过度”，lap 在这里与“覆盖、搭接”的意思有关，所以 overlap 有“搭在一起、部分覆盖”的感觉。","常见搭配：overlap with（与……重叠/有交集），overlapping schedules（时间安排重叠），avoid overlap（避免重复/职责重叠）。"]}
{"word":"overflat","summary":{"en":"“Overflat” means “too flat,” often suggesting a lack of rise, contrast, or emotional/lively variation.","zh":"“overflat”指“过于平坦/过于平淡”，常暗示缺少膨胀、对比、层次或情绪起伏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too flat; flatter than is normal, desired, or appropriate (in shape, sound, taste, performance, etc.).","zh":"过于平坦的；平得不自然或不理想的（可形容形状、声音、味道、表现等缺乏起伏/层次）。"},"examples":[{"en":"The bread came out overflat because the dough didn’t rise enough.","zh":"这面包烤出来太扁了，因为面团发酵不够。"},{"en":"His speech felt overflat—clear, but with almost no emotion.","zh":"他的演讲显得过于平淡——很清楚，但几乎没有情感起伏。"},{"en":"The photo looks overflat; try adding some contrast.","zh":"这张照片看起来太平了；试着加一点对比度。"}]}],"synonyms":["too flat","overly flat","excessively flat","flattened","lifeless","monotone"],"phonetic":"/ˌoʊvɚˈflæt/","extraExplanation":["“overflat”不是非常常见的标准词，更常见的写法是加连字符的“over-flat”，或直接用更自然的表达：too flat / overly flat / very flat。","在影像、音频、写作评价里，“flat”常表示“缺乏对比、层次或情绪起伏”，加上“over-”就是强调“过头了”。"]}
{"word":"overflatly","summary":{"en":"“Overflatly” means speaking or doing something too flatly or bluntly, with too little emotion.","zh":"“overflatly”指说话或表达得过于平淡或生硬，情感不足，显得不合时宜。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too flat, blunt, or lacking in emotion; more plainly or monotonously than is appropriate.","zh":"过于平淡、直白或缺乏情感地；（语气/表达）平得不合适、显得单调或生硬。"},"examples":[{"en":"He apologized, but he said it overflatly, so it didn’t feel sincere.","zh":"他道了歉，但语气过于平淡，听起来不太真诚。"},{"en":"The actor delivered the line overflatly, and the joke didn’t land.","zh":"演员把台词说得过于平铺直叙，笑点就没出来。"}]}],"synonyms":["too flatly","too bluntly","too plainly","too matter-of-factly","monotonously"],"phonetic":"/ˌoʊvɚˈflætli/","extraExplanation":["“over-”表示“过度/太……”，与“flatly”（平淡地、直截了当地）组合后，强调“表达方式过头了”。","“overflatly”在现代英语里不算常见；更常见的表达包括“too flatly / too bluntly / too matter-of-factly / in a monotone”。"]}
{"word":"overflatness","summary":{"en":"Overflatness means being too flat, often in design, sound, or style.","zh":"overflatness 指“过度平坦”，常用于形容设计、声音或风格缺乏层次与起伏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive flatness; the quality of being too flat in shape, appearance, sound, or style","zh":"过度平坦；（形状、外观、声音或风格）平得过头的状态"},"examples":[{"en":"The designer worried that the logo’s overflatness made it look lifeless.","zh":"设计师担心标志过度平坦，显得没有生命力。"},{"en":"Some listeners complained about the overflatness of the recording, saying it lacked warmth and depth.","zh":"一些听众抱怨这段录音过度“平”，缺少温暖和层次感。"}]}],"synonyms":["excessive flatness","over-simplicity","lack of depth","lifelessness"],"phonetic":"/ˌoʊvɚˈflætnəs/","extraExplanation":["“overflatness”不是高频词，更常见的表达是“too flat / excessive flatness / overly flat”。它通常用于批评：比如视觉设计过于扁平、人物表演缺乏起伏，或声音/录音听起来缺少动态与空间感。","构词上：over-（过度）+ flat（平的）+ -ness（名词后缀，表示“……的状态/性质”）。"]}
{"word":"overflatten","summary":{"en":"“Overflatten” means to make something too flat, reducing its shape or detail.","zh":"“Overflatten”指把某物弄得过于扁平，导致形状或细节被削弱。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to flatten something too much, so it loses its intended shape, height, detail, or texture","zh":"把某物压得/弄得过于扁平，导致失去原本应有的形状、高度、细节或质感"},"examples":[{"en":"Be careful not to overflatten the dough, or the bread won’t rise well.","zh":"小心别把面团压得太扁，不然面包不容易发起来。"},{"en":"The designer worried the app update would overflatten the icons and remove their character.","zh":"设计师担心这次应用更新会把图标“扁平化”过头，失去原来的特色。"},{"en":"If you overflatten the pillow, it won’t support your neck.","zh":"如果把枕头压得太扁，就支撑不了你的脖子。"}]}],"synonyms":["flatten too much","compress too much","squash","oversimplify (figurative)"],"phonetic":"/ˌoʊvɚˈflætən/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、过头”。所以 overflatten 通常就是“flatten（压平/弄平）过度”。","这个词不算非常固定或常见的词典词，更像是写作或技术语境（如烘焙、设计、图像处理、数据可视化）里为了表达“过度扁平化/压得太平”而临时组合出来的用词。"]}
{"word":"overflavor","summary":{"en":"Overflavor means to make food taste too strongly by adding too much seasoning, or it can refer to that overly strong taste.","zh":"Overflavor 指调味过度使味道过重；也可指食物中那种过强、压过其他风味的味道。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add too much seasoning or flavoring so the taste becomes too strong or unbalanced","zh":"过度调味；加太多香料/调料，导致味道过重或不协调"},"examples":[{"en":"Be careful not to overflavor the soup with salt.","zh":"小心别把汤加盐加得太重。"},{"en":"The chef overflavored the sauce, so the garlic overwhelmed everything else.","zh":"厨师把酱汁调味过头了，大蒜味盖过了其他味道。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessively strong or dominant taste in food or drink","zh":"（食物/饮品中）过重的味道；压过其他风味的强烈味道"},"examples":[{"en":"The overflavor of cinnamon made the cake hard to enjoy.","zh":"肉桂味太重，让蛋糕不太好吃。"}]}],"synonyms":["overseason","overspice","over-salt","make too strongly flavored"],"phonetic":"/ˌoʊvɚˈfleɪvɚ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”。所以 overflavor 字面意思就是“把味道加过头”。日常英语里更常见的说法是 over-season（调味过度）或 too strongly flavored（味道太重）。"]}
{"word":"overfleece","summary":{"en":"Overfleece usually means an outer fleece layer—a fleece jacket/pullover worn over other clothes for warmth.","zh":"overfleece 通常指外穿的抓绒保暖层，即穿在其他衣物外面的抓绒外套/套头衫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an outer fleece layer (a fleece jacket or pullover worn over other clothing for warmth)","zh":"外穿的抓绒层（穿在其他衣物外面的抓绒外套或套头衫，用于保暖）"},"examples":[{"en":"Bring an overfleece for the evening—it gets cold after sunset.","zh":"晚上记得带一件外穿抓绒，日落后会变冷。"},{"en":"I wore a base layer, a light sweater, and an overfleece on top.","zh":"我穿了贴身打底、一件薄毛衣，外面再加一件抓绒。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) relating to an outer fleece layer","zh":"（非正式）与外穿抓绒层有关的"},"examples":[{"en":"Do you have an overfleece pocket big enough for a phone?","zh":"你这件外穿抓绒的口袋够放手机吗？"}]}],"synonyms":["outer fleece","fleece jacket","fleece pullover","midlayer fleece"],"phonetic":"/ˈoʊvərˌfliːs/","extraExplanation":["“overfleece”不是非常常见的标准词，更常见的说法是“fleece jacket / fleece pullover / outer fleece”。在户外装备语境里，它通常指“外层或更外面的抓绒保暖层”。","在书面英语中有时会写成“over-fleece”（加连字符）以强调它是复合词；口语里也可能直接说“a fleece”来指抓绒外套。"]}
{"word":"overfleshed","summary":{"en":"Overfleshed means having too much flesh—too fat or thick-bodied (often used for animals).","zh":"Overfleshed 指“肉太多”，即过于肥胖或体态过厚（常用于动物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or animal) Having too much flesh; overly fat or thick-bodied.","zh":"（指人或动物）肉太多的；过于肥胖的；体态过于厚重的。"},"examples":[{"en":"The vet said the dog was overfleshed and needed more exercise.","zh":"兽医说这只狗有点过胖，需要多运动。"},{"en":"Some farmers avoid keeping overfleshed animals because it can affect their health.","zh":"有些农场主会避免饲养过胖的牲畜，因为这可能影响健康。"}]},{"partOfSpeech":"adj.","definition":{"en":"(sometimes) Having more flesh than is ideal for a role or appearance; too fleshy or thick in build.","zh":"（有时）外形上肉感过重、不够精瘦的；显得过于厚实的。"},"examples":[{"en":"He worried the costume made him look overfleshed on stage.","zh":"他担心那套服装让他在舞台上看起来过于臃肿。"},{"en":"The director wanted a lean look, not an overfleshed silhouette.","zh":"导演想要的是精瘦的感觉，而不是臃肿的轮廓。"}]}],"synonyms":["overweight","fat","plump","fleshy","overconditioned"],"phonetic":"/ˌoʊvɚˈflɛʃt/","extraExplanation":["“overfleshed”由 over-（过度）+ fleshed（有肉的、长肉的）构成，字面意思就是“肉太多”。它不算常用词，更常见的说法是 overweight（超重的）、fat（胖的）、overweight/overconditioned（用于动物/赛马语境：过肥、状态过重）。","在畜牧或兽医语境中，这个词更偏中性、描述性；用于形容人时可能带有负面评价，交流时注意礼貌与文化敏感性。"]}
{"word":"overflew","summary":{"en":"“Overflew” is the past tense of “overfly,” meaning to fly over a place or to fly past it without landing.","zh":"“overflew”是“overfly”的过去式，表示从某地上空飞过，或飞越某地而不停留/不降落。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “overfly”: to fly above a place or area (often in an airplane).","zh":"“overfly”的过去式：从某地/某区域上空飞过（常指乘飞机）。"},"examples":[{"en":"The helicopter overflew the stadium during the ceremony.","zh":"仪式期间，直升机从体育场上空飞过。"},{"en":"We overflew the mountains just before sunset.","zh":"日落前不久，我们从群山上空飞过。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “overfly”: to fly past or beyond a place without landing there.","zh":"“overfly”的过去式：飞过某地并越过/不在当地降落。"},"examples":[{"en":"Because of bad weather, the plane overflew the island and continued to the mainland.","zh":"由于天气不好，飞机飞过那座岛，没有降落，继续飞往大陆。"},{"en":"We overflew our destination by mistake and had to turn back.","zh":"我们不小心飞过了目的地，只好返航。"}]}],"synonyms":["flew over","passed over","crossed (by air)","flew past"],"phonetic":"ˌoʊvərˈfluː","extraExplanation":["“overflew”是不规则动词变化：overfly → overflew → overflown。作形容词形式常见的是“overflown area”（被飞越的区域）。","在新闻语境里，“overfly/overflew”常用于“领空/禁飞区”（airspace / no-fly zone），例如：Aircraft overflew the border.（飞机飞越边境。）"]}
{"word":"overflexion","summary":{"en":"Overflexion means bending too much—either physically (a joint bends beyond a safe range) or, in linguistics, using too many inflectional forms.","zh":"Overflexion 指“过度屈曲”：可指身体关节弯曲过度，也可指语言学中“过度屈折/不必要的词形变化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or condition of bending a body part (especially a joint) too much or beyond a normal/safe range","zh":"过度屈曲；（尤指关节）弯曲过度，超过正常或安全范围"},"examples":[{"en":"The therapist warned that overflexion of the knee could worsen the injury.","zh":"治疗师警告说，膝盖过度屈曲可能会加重伤情。"},{"en":"Try not to force the stretch into overflexion; stop when you feel sharp pain.","zh":"拉伸时不要硬拉到过度屈曲；一旦出现刺痛就要停止。"}]},{"partOfSpeech":"n.","definition":{"en":"in linguistics/grammar, the use of too many or unnecessary inflectional endings or forms, making language sound unnatural or overly complex","zh":"（语言学/语法）过度屈折；使用过多或不必要的词形变化，使表达显得不自然或过于复杂"},"examples":[{"en":"Learners sometimes produce overflexion, adding endings that native speakers wouldn’t use.","zh":"学习者有时会出现过度屈折，添加母语者不会用的词尾。"},{"en":"The editor simplified the sentence to avoid overflexion in formal writing.","zh":"编辑简化了句子，避免正式写作中过度屈折带来的累赘。"}]}],"synonyms":["excessive flexion","hyperflexion","overbending","overinflection","overgeneralization (related)"],"phonetic":"/ˌoʊvɚˈflɛkʃən/","extraExplanation":["“Over-”表示“过度、超过”，“flexion”指“屈曲/弯曲”。因此 overflexion 字面意思就是“弯得太多”。","在医学/运动语境里，它常用于描述动作风险（如颈部、膝盖、手腕的过度屈曲）。在语言学语境里，它更接近“过度规则化/过度套用语法规则”的现象（例如把不规则形式当作规则来变化）。","这个词在日常英语里不算常见，更常见的表达包括 “excessive flexion”（过度屈曲）或在语言学习中说 “overgeneralization”（过度泛化）。"]}
{"word":"overflies","summary":{"en":"“Overflies” means “flies over (a place),” often without landing, or flies over to observe/survey from the air.","zh":"“Overflies”表示“飞越某地（通常不降落）”，也可指“飞越以从空中观察/勘察”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a plane, bird, or spacecraft) to fly over a place without landing there; to pass above.","zh":"（飞机、鸟或航天器）从某地上空飞过；飞越（不停留、不降落）。"},"examples":[{"en":"The helicopter overflies the river to reach the hospital faster.","zh":"直升机飞越河流，以便更快到达医院。"},{"en":"A flock of geese overflies our neighborhood every autumn.","zh":"每年秋天都会有一群大雁飞越我们的小区。"}]},{"partOfSpeech":"v.","definition":{"en":"To survey, observe, or photograph an area from the air by flying over it.","zh":"通过飞越从空中勘察、观察或拍摄某地区。"},"examples":[{"en":"The drone overflies the forest to map the fire damage.","zh":"无人机飞越森林，为火灾损失绘制地图。"},{"en":"The crew overflies the coastline to photograph erosion.","zh":"机组人员飞越海岸线拍摄海岸侵蚀情况。"}]}],"synonyms":["flies over","passes over","crosses (by air)","surveys (from the air)","overhead flights"],"phonetic":"/ˌoʊvɚˈflaɪz/","extraExplanation":["“overflies”是动词“overfly”的第三人称单数现在时（he/she/it overflies）。过去式和过去分词是“overflew / overflown”。","在新闻与国际关系语境中，“overfly/overflight”常与“领空（airspace）”有关：例如“未经许可飞越他国领空”会涉及外交与法律问题。"]}
{"word":"overflight","summary":{"en":"Overflight means a flight or operation that passes over a place without landing, often discussed in aviation law or military/political news.","zh":"Overflight 指飞机飞越某地上空但不降落的“航班/飞越行动”，常见于航空法规及军事或政治新闻语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flight that passes over a place (such as a country, city, or military area) without landing there.","zh":"飞越；（飞机）从某地上空飞过（如某国、城市或军事区域），但不在当地降落。"},"examples":[{"en":"The airline requested permission for an overflight of the neighboring country.","zh":"这家航空公司申请获准飞越邻国领空。"},{"en":"Because of the conflict, overflights were temporarily banned.","zh":"由于冲突，飞越航班一度被禁止。"}]},{"partOfSpeech":"n.","definition":{"en":"An act of flying over an area for observation, inspection, or showing presence (often used in military or political contexts).","zh":"（为侦察、检查或展示存在而进行的）飞越行动（常用于军事或政治语境）。"},"examples":[{"en":"The navy conducted an overflight to monitor the coastline.","zh":"海军进行了一次飞越行动以监控海岸线。"},{"en":"The overflight was criticized as a provocation.","zh":"这次飞越被批评为挑衅行为。"}]}],"synonyms":["flyover","overpass (aviation)","aerial pass"],"phonetic":"/ˈoʊvərˌflaɪt/","extraExplanation":["在国际航空与外交新闻中，overflight 常与 “overflight rights（飞越权）/ overflight permission（飞越许可）” 连用，指一国允许他国飞机使用本国领空的权利与许可；这既涉及航线成本与时间，也可能牵涉政治关系与安全议题。","与 overfly 的区别：overfly 通常是动词（fly over），强调动作；overflight 是名词，强调一次飞越“事件/航班/行动”。"]}
{"word":"overflights","summary":{"en":"“Overflights” means flights that pass over a place without landing there, often discussed in aviation, security, or monitoring contexts.","zh":"“Overflights”指飞越某地但不降落的飞行（或飞越观测行为），常用于航空、安全与监测语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flight over a particular area, especially without landing there (often used for aircraft passing over a country, city, or restricted zone).","zh":"（飞机等）飞越某地的飞行，尤指不在当地降落的飞行（常用于飞越某国、城市或敏感/受限区域）。"},"examples":[{"en":"The airline canceled overflights of the region because of safety concerns.","zh":"由于安全担忧，这家航空公司取消了飞越该地区的航班。"},{"en":"The city complained about noisy military overflights at night.","zh":"这座城市抱怨夜间军机飞越带来的噪音。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of traveling over something (for example, in satellites or drones) to observe, photograph, or monitor it.","zh":"（卫星、无人机等）飞越以观察、拍摄或监测的行为。"},"examples":[{"en":"The satellite’s overflights helped researchers track the wildfire’s spread.","zh":"卫星的飞越观测帮助研究人员追踪野火的蔓延。"},{"en":"Drone overflights were used to inspect the bridge after the storm.","zh":"暴风雨后，人们用无人机飞越检查桥梁情况。"}]},{"partOfSpeech":"v.","definition":{"en":"To fly over (a place) in an aircraft; to pass over without landing.","zh":"飞越（某地）；从上空经过而不降落。"},"examples":[{"en":"Commercial planes often overflight several countries on long international routes.","zh":"长途国际航线上，民航飞机常常飞越多个国家。"},{"en":"The aircraft was told not to overflight the restricted area.","zh":"该飞机被告知不得飞越禁区。"}]}],"synonyms":["flyover","passover (aviation)","transit flight","aerial overpass"],"phonetic":"/ˈoʊvərˌflaɪt/","extraExplanation":["“Overflights”是“overflight”的复数形式，新闻里常见于航空与国际关系语境：例如“允许/禁止飞越领空（overflight rights）”。","在国际法与外交中，是否允许他国飞机“飞越领空”可能涉及通行费、航线效率与安全风险等议题。"]}
{"word":"overfling","summary":{"en":"Overfling is a rare verb meaning to fling something over/across, or to throw too far.","zh":"overfling 是个很少见的动词，表示把东西抛过/甩过，或扔得过头、过远。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To throw or fling something over or across (something else).","zh":"（罕见/古义）把某物抛到……上方或越过……；掷过、扔过。"},"examples":[{"en":"He overflung his cloak across the saddle and mounted quickly.","zh":"他把斗篷往马鞍上一甩，然后迅速上马。"},{"en":"The child overflung the ball over the fence by accident.","zh":"孩子不小心把球扔过了篱笆。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To fling too far or with too much force; to overdo a throw.","zh":"（罕见/古义）扔得太远或用力过猛；把投掷“过头”。"},"examples":[{"en":"In his excitement, he overflung the stone and missed the target.","zh":"他一激动把石头扔过头了，没打中目标。"}]}],"synonyms":["fling over","throw over","toss over","hurl over","throw too far"],"phonetic":"/ˌoʊvɚˈflɪŋ/","extraExplanation":["“overfling”在现代英语里非常少见，更多时候会用更自然的表达：fling/throw something over/across（把……扔过/甩过）。","如果你想表达“溢出/泛滥”，常见词是“overflow / overflowing”，而不是“overfling”。","如果这是在某篇旧文学作品里看到的拼写，也可能带有古体风格；现代写作中通常不建议使用。"]}
{"word":"overfloat","summary":{"en":"“Overfloat” is a rare verb meaning to float above something or to make something float higher than normal.","zh":"“overfloat”是个较少见的动词，表示“漂浮在……之上”或“使……浮得更高”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to float above or over something; to drift on the surface higher than expected","zh":"漂浮在……之上；（在水面等）浮得比预期更高、漂在上面"},"examples":[{"en":"Oil can overfloat on water because it is less dense.","zh":"油的密度比水小，所以会漂浮在水面上。"},{"en":"The small boat began to overfloat after extra air got trapped under it.","zh":"小船底下困住了额外的空气后，开始浮得更高。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to float above or beyond its normal level","zh":"使……漂得更高；使……浮到正常高度之上"},"examples":[{"en":"The added foam overfloated the platform, making it ride higher in the water.","zh":"增加的泡沫让平台更有浮力，使它在水里浮得更高。"}]}],"synonyms":["float above","rise to the top","bob","be buoyant"],"phonetic":"ˌoʊvɚˈfloʊt","extraExplanation":["“overfloat”在现代日常英语里非常少见，很多时候人们会用更常见的“float above / rise to the top / be buoyant / overflow（注意拼写不同）”。如果你是在技术语境（如计算机、图形/数值计算）里看到它，也可能是把“overflow（溢出）”误写成了“overfloat”。","词形上可以理解为 over-（在……之上/过度）+ float（漂浮）。在写作中若想表达“漂在……上方”，更自然的搭配通常是“float over/above”。"]}
{"word":"overflog","summary":{"en":"A rare verb meaning to punish, scold, or criticize someone excessively.","zh":"一个较少见的动词，表示对某人过度惩罚、痛骂或抨击。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to flog (beat or criticize) too much; to punish, scold, or attack someone excessively","zh":"过度鞭打；过度惩罚/痛骂；对某人进行过分的攻击或抨击"},"examples":[{"en":"The coach didn’t just correct the player’s mistake—he overflogged him in front of the whole team.","zh":"教练不只是纠正球员的错误——他还当着全队的面过度羞辱/痛骂了他。"},{"en":"Online commenters can overflog a small slip-up until it feels like a public trial.","zh":"网络评论者可能会把一个小失误过度抨击到像公开审判一样。"}]}],"synonyms":["overpunish","overcriticize","lash out at","rail at","excoriate"],"phonetic":"/ˌoʊvərˈflɑɡ/","extraExplanation":["“overflog”在现代英语中非常少见，很多词典未必收录；更常见的表达是“criticize too harshly / attack unfairly / overpunish”。","注意不要和“overflow（溢出）”混淆：两者拼写相近但意思完全不同。","词源构成上可理解为 over-（过度）+ flog（鞭打；严厉批评），因此语感偏负面，带有“下手太重/说得太狠”的意味。"]}
{"word":"overflogged","summary":{"en":"“Overflogged” (rare) means punished by whipping too much; it can also mean to whip someone excessively.","zh":"“overflogged”（罕见）指被鞭打惩罚得过度；也可指“对某人过度鞭打”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Flogged too much; punished or beaten with a whip so excessively that it is unfair or cruel.","zh":"（罕见）被鞭打得过度的；被用鞭子惩罚或抽打得太厉害，以至于显得不公或残酷。"},"examples":[{"en":"The novel shows an overflogged sailor who can barely stand after the captain’s punishment.","zh":"小说描写了一名被过度鞭打的水手，在船长的惩罚后几乎站不起来。"},{"en":"She argued that the overflogged prisoner was a victim of abuse, not “discipline.”","zh":"她认为那个被过度鞭打的囚犯是受虐者，而不是在接受“管教”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To flog excessively; to whip or beat someone too much as punishment.","zh":"（罕见）过度鞭打；把某人作为惩罚抽打得太狠、太多。"},"examples":[{"en":"In some historical accounts, cruel officers would overflog men for minor mistakes.","zh":"在一些历史记载中，残酷的军官会因为小错就对士兵过度鞭打。"},{"en":"The judge said the guard had overflogged the detainee.","zh":"法官表示那名看守对被拘留者过度鞭打。"}]}],"synonyms":["excessively whipped","severely beaten","overpunished","abused"],"phonetic":"/ˌoʊvɚˈflɑɡd/","extraExplanation":["“overflogged”很少见，更多时候你会看到更常用的表达，如“whipped too much / beaten excessively / subjected to excessive flogging（遭受过度鞭打）”。","“flog”常见于历史或文学语境（如海军、军队、监狱的体罚），现代日常英语里谈到体罚或虐待更常用“beat / abuse / whip”。使用时注意语体较沉重。"]}
{"word":"overflogging","summary":{"en":"Overflogging means excessive flogging—whipping someone too much or too harshly, often in a historical or critical context.","zh":"overflogging 指“过度鞭打/鞭笞过重”，常用于历史或批判语境，强调惩罚过度、不人道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of flogging (beating with a whip or lash) too much or too severely; excessive whipping as punishment or discipline","zh":"过度鞭打；鞭笞过重（作为惩罚或管教时过量、过度的抽打）"},"examples":[{"en":"The report condemned the guards for overflogging prisoners during interrogation.","zh":"报告谴责看守在审讯过程中对囚犯进行过度鞭打。"},{"en":"Many readers saw the scene as a criticism of overflogging in the name of “discipline.”","zh":"许多读者认为那一幕是在批评以“管教”为名的过度鞭打。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice or habit of using flogging too much; relying on harsh physical punishment excessively","zh":"过度使用鞭笞的做法；对严厉体罚的过分依赖"},"examples":[{"en":"The reform movement pushed schools to abandon overflogging and adopt safer methods of discipline.","zh":"改革运动推动学校摒弃过度体罚，改用更安全的管教方式。"},{"en":"The novel portrays overflogging as a tool of control rather than justice.","zh":"小说将过度鞭笞描写为控制手段而非正义。"}]}],"synonyms":["excessive flogging","overpunishment","brutal punishment","overdiscipline"],"phonetic":"/ˌoʊvərˈflɑɡɪŋ/","extraExplanation":["“overflogging”由 over-（过度）+ flog（鞭打）构成，常见于讨论历史上的体罚、监狱惩戒或殖民时期惩罚制度等语境。","“flogging”本身带有强烈的历史与伦理色彩；在现代英语里谈到它时，语气往往偏批判或强调不人道，因此“overflogging”通常用于谴责“惩罚过度”。"]}
{"word":"overflood","summary":{"en":"Overflood means to flood excessively or inundate with too much water.","zh":"overflood 指“过度泛滥/过量淹没”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to flood too much; to cover (an area) with more water than normal or safe; to inundate excessively","zh":"（水）泛滥过度；使（某地）被过量的水淹没；过度淹没"},"examples":[{"en":"After days of heavy rain, the river overflooded the nearby fields.","zh":"连续几天暴雨后，河水泛滥过度，淹没了附近的田地。"},{"en":"Poor drainage can overflood streets during storms.","zh":"排水不良会导致暴风雨时街道积水泛滥。"},{"en":"The dam was opened to prevent the reservoir from overflooding the town.","zh":"为防止水库水位过高淹没城镇，水坝被打开泄洪。"}]}],"synonyms":["flood","inundate","overflow","deluge"],"phonetic":"/ˌoʊvɚˈflʌd/","extraExplanation":["“overflood”由前缀 over-（过度、超过）+ flood（洪水/淹没）构成，意思是“淹得太多”。在现代英语中更常见的说法是 “flood” 或 “overflow / inundate”，因此 “overflood” 偏少用，常见于描写性或较正式的语境。"]}
{"word":"overflorid","summary":{"en":"Overflorid means “too flowery or ornate,” especially in writing or speech.","zh":"overflorid 指“过分辞藻华丽、浮夸”，多用于形容写作或言语风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively flowery, ornate, or showy in style (especially in writing or speech), often sounding unnatural or too elaborate.","zh":"（尤指文章或言语风格）过于辞藻华丽、过分雕琢或浮夸，常显得不自然、太做作。"},"examples":[{"en":"The editor cut several overflorid sentences to make the paragraph clearer.","zh":"编辑删掉了几句过于华丽的句子，让段落更清楚。"},{"en":"Her apology sounded overflorid, as if it were written for an audience instead of a friend.","zh":"她的道歉听起来过于浮夸，像是写给观众而不是写给朋友的。"}]}],"synonyms":["flowery","ornate","overwrought","purple","grandiloquent"],"phonetic":"/ˌoʊvɚˈflɔrɪd/","extraExplanation":["“florid”原意与“花、开花”相关，引申为“辞藻华丽”。加上前缀“over-”（过度）后，“overflorid”带有明显的贬义，常暗示“为了好看而堆砌词藻”，影响清晰度或真诚感。","常见搭配：overflorid prose/style/language（过分华丽的散文/风格/语言）。在写作建议中，往往与“clear, concise（清晰、简洁）”形成对比。"]}
{"word":"overfloridly","summary":{"en":"“Overfloridly” means “in a too fancy, overly decorative way,” especially in language.","zh":"“overfloridly”表示“以过度华丽、过分修饰的方式（多指语言）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly ornate, fancy, or showy way (especially in writing or speech), often to the point of sounding unnatural or hard to understand.","zh":"以过于华丽、繁饰或卖弄的方式（尤指写作或说话），常带有不自然或难懂的负面含义。"},"examples":[{"en":"The travel brochure was written overfloridly, with long adjectives that didn’t add real information.","zh":"这本旅游宣传册写得过于华丽，堆砌了很多形容词，却没有提供真正的信息。"},{"en":"He described a simple dinner overfloridly, as if it were a royal banquet.","zh":"他把一顿普通的晚餐描述得过于华丽，仿佛是皇家盛宴。"}]}],"synonyms":["ornately","too elaborately","in a flowery way","grandiloquently","with purple prose"],"phonetic":"/ˌoʊvɚˈflɔrɪdli/","extraExplanation":["“florid”原义有“（脸色）红润的”，在文体上常指“辞藻华丽、装饰很多”。加上 over- 之后，overflorid / overfloridly 通常带批评意味：不是“优雅”，而是“浮夸、堆砌”。","这个词相对少见，更常见的表达有：in an overly flowery way / too ornately / with purple prose（偏文学评论用语）。"]}
{"word":"overfloridness","summary":{"en":"Overfloridness means an overly ornate, flowery style—too much decoration in language.","zh":"Overfloridness 指语言风格过度华丽、过分堆砌辞藻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too elaborate, ornate, or flowery in style (especially in writing or speech).","zh":"（尤指写作或说话风格）过于华丽、堆砌辞藻、过分修饰的特质。"},"examples":[{"en":"The editor cut some of the overfloridness to make the paragraph clearer.","zh":"编辑删掉了一些过分华丽的表达，让段落更清楚。"},{"en":"His apology sounded sincere, but its overfloridness made it feel a bit theatrical.","zh":"他的道歉听起来真诚，但辞藻过于华丽，显得有点做作。"}]}],"synonyms":["ornateness","purple prose","verbosity","flowery language","grandiloquence"],"phonetic":"/ˌoʊvərˈflɔrɪdnəs/","extraExplanation":["“overfloridness”由 over-（过度）+ florid（辞藻华丽的）+ -ness（名词后缀）组成。它不是特别常见的标准词，更常见的说法是 “overly florid style / purple prose / verbosity”。在正式写作中，用更常见的替代表达会更自然。"]}
{"word":"overflour","summary":{"en":"“Overflour” is usually a misspelling of “overflow.”","zh":"“overflour”通常是把“overflow（溢出）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; usually a misspelling of “overflow.” It is not a common English word in standard dictionaries.","zh":"非标准拼写；通常是把“overflow（溢出/泛滥）”拼错了。“overflour”一般不算标准英文单词。"},"examples":[{"en":"I think you meant “overflow,” not “overflour.”","zh":"我觉得你想写的是“overflow”，不是“overflour”。"},{"en":"If the sink keeps overflowing, the water will spill onto the floor.","zh":"如果水槽一直在溢出，水会流到地板上。"}]}],"synonyms":["overflow","spill over","run over"],"phonetic":"/ˌoʊvərˈfloʊ/","extraExplanation":["“overflour”很容易出现在打字或拼写时，因为它看起来像“over + flour（面粉）”。但英语里真正常用的是“overflow”（over + flow，流过头→溢出）。","如果你本来想表达“撒太多面粉/面粉放太多”，更自然的说法是：“use too much flour” 或 “overflour the dough”（较少见但在烘焙语境里偶尔有人这么说，通常会写成 “over-flour” 并当作动词短语使用）。"]}
{"word":"overflourish","summary":{"en":"Overflourish means to make something too fancy or showy by adding excessive decoration or dramatic language.","zh":"overflourish 指把表达或内容弄得过度华丽、过分渲染，因修饰太多而显得不够清晰或不够真实。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to decorate, praise, or write/speak in an overly fancy way; to add too many dramatic or showy details","zh":"过度修饰；过分渲染；说写得太花哨（加了太多夸张或炫耀性的细节）"},"examples":[{"en":"The report is clear, but the introduction is overflourished and hard to follow.","zh":"报告内容很清楚，但引言写得过于花哨，反而难以理解。"},{"en":"Try not to overflourish your résumé—use simple, specific achievements instead.","zh":"简历别写得太浮夸——用简洁、具体的成果来替代。"}]}],"synonyms":["embellish","over-embellish","ornament","overdo","make (something) too flowery"],"phonetic":"/ˌoʊvərˈflɝɪʃ/","extraExplanation":["“overflourish”不是非常常见的标准词，更常见的表达是 “overdo it / embellish / over-embellish / be overly ornate”。它由 over-（过度）+ flourish（华丽的修饰/炫耀）构成，含义通常带有负面评价：好看或好听，但不够清晰、真实或克制。","写作与演讲里常强调 “clarity over flourish”（清晰胜过华丽）。如果想表达更自然的英语，可以说：“The writing is too flowery/ornate.”（文风太花）或 “He embellished the story.”（他把故事添油加醋了）。"]}
{"word":"overflow","summary":{"en":"“Overflow” means to spill over because something is too full, or the extra amount beyond a limit (including in computing).","zh":"“Overflow”指因过满而溢出，也可指超出限度的多余量（包括计算机中的“溢出”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To spill or flow over the edge of a container or limit because there is too much inside.","zh":"（液体等）溢出；（数量等）超过容纳范围而“满出来”。"},"examples":[{"en":"Be careful—if you fill the cup too much, it will overflow.","zh":"小心点——杯子装得太满会溢出来。"},{"en":"After hours of rain, the river began to overflow its banks.","zh":"下了好几个小时的雨后，河水开始漫过河岸。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fill something so full that it spills over the edge or goes beyond a limit.","zh":"使……溢出；把……装/填得太满而外溢。"},"examples":[{"en":"Don’t overflow the bathtub while the water is running.","zh":"水开着的时候别把浴缸放到溢出来。"},{"en":"Too much sugar can overflow a small container when you pour it in.","zh":"糖倒太多，小容器会被“装满到溢出来”。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation where something is too full and spills over; also, an amount beyond a limit (often used in computing for numbers or memory).","zh":"溢出（现象）；超出限度的量（也常指计算机中的“溢出”，如数值/内存超出范围）。"},"examples":[{"en":"There was an overflow of water in the kitchen after the sink clogged.","zh":"水槽堵了之后，厨房里出现了积水外溢。"},{"en":"In programming, an integer overflow happens when a number is too large for its type.","zh":"在编程中，整数溢出是指数字大到超出了数据类型能表示的范围。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely full; spilling over the edges.","zh":"满到溢出的；外溢的。"},"examples":[{"en":"The trash can was overflow with paper cups.","zh":"垃圾桶里纸杯堆得满到溢出来。（更自然：The trash can was overflowing.)"}]}],"synonyms":["spill over","run over","brim over"],"phonetic":"/ˌoʊvərˈfloʊ/","extraExplanation":["用法小提示：最常见的形式是动词“overflow”。形容词通常用“overflowing”（例如：an overflowing trash can）。单独用“overflow”作形容词在现代英语里较少见。","词源简析：over-（超过）+ flow（流动），字面意思就是“流过头、流过界”。","常见搭配：overflow with（充满到溢出：The room was overflowing with people.）；overflow into（溢出到/蔓延到：The crowd overflowed into the street.）；overflow one’s banks（河水漫过河岸）。"]}
{"word":"overflowable","summary":{"en":"“Overflowable” means able to overflow or able to be overflowed (often used in technical or descriptive writing).","zh":"“Overflowable”指“会溢出的”或“可被溢出/超出容量的”（多见于描述性或技术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to overflow (have liquid or something similar rise and spill over the edge).","zh":"会溢出的；可能漫出来的（液体等超过容器边缘流出）。"},"examples":[{"en":"After the storm, the river became overflowable within hours.","zh":"暴风雨过后，河水在几小时内就可能漫出来。"},{"en":"Use a larger pot for overflowable soups like noodles or porridge.","zh":"像面汤或粥这类容易溢出的食物，最好用更大的锅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be overflowed (likely to be covered or filled beyond capacity, especially in technical writing).","zh":"可被“溢出”的；容易被超出容量填满的（常见于技术/书面语）。"},"examples":[{"en":"In some designs, the buffer is overflowable if input is not checked.","zh":"在某些设计中，如果不检查输入，缓冲区就可能被溢出。"},{"en":"The low-lying fields are overflowable during the rainy season.","zh":"雨季时，低洼的田地容易被洪水淹没。"}]}],"synonyms":["likely to overflow","prone to overflowing","spillable","susceptible to flooding","overflow-prone"],"phonetic":"/ˌoʊvərˈfloʊəbəl/","extraExplanation":["“overflowable”由 overflow + -able 构成，-able 表示“能够……的 / 可……的”。这个词不算常见，日常英语更常用 “likely to overflow / prone to overflowing”。","在计算机语境中，overflow 指“溢出”（如 buffer overflow 缓冲区溢出、integer overflow 整数溢出）。不过日常表达里要注意区分：液体“溢出”更直观，技术“溢出”多指超出容量或范围。"]}
{"word":"overflowed","summary":{"en":"Overflowed means ‘spilled over because it was too full,’ used for water/containers and also figuratively for crowds or emotions.","zh":"Overflowed 表示“因过满而溢出”，既可指水/容器，也可比喻人群或情感的“满溢”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"filled too full so that the contents spill over the edge; (for a container) having more than it can hold.","zh":"（容器）装得太满而溢出；容量超出能承受的范围。"},"examples":[{"en":"The bathtub overflowed and water ran across the floor.","zh":"浴缸溢出来了，水流到了地板上。"},{"en":"Her cup overflowed when she poured too quickly.","zh":"她倒得太快，杯子溢出来了。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of overflow) spilled over because it became too full; also used figuratively for emotions or crowds.","zh":"overflow 的过去式/过去分词：因过满而溢出；也可比喻（情感、人群等）“满溢、涌出”。"},"examples":[{"en":"The river overflowed its banks after the heavy rain.","zh":"大雨后，河水漫过了河岸。"},{"en":"The hall overflowed with people eager to hear the speaker.","zh":"大厅里挤满了人，大家都想听演讲者发言。"},{"en":"His heart overflowed with gratitude.","zh":"他心中充满了感激之情。"}]}],"synonyms":["spilled over","overfilled","flooded","brimmed over"],"phonetic":"/ˌoʊvərˈfloʊd/","extraExplanation":["“overflowed”常见两种用法：\n1) 作动词过去式/过去分词：The river overflowed... / The river has overflowed...\n2) 作形容词：an overflowed sink（溢出的水槽）。\n在日常表达中，更常见的是形容词“overflowing”（e.g., an overflowing cup）。","比喻用法很常见：overflowed with + 名词（如 joy, anger, gratitude）表示“充满到要溢出来”。"]}
{"word":"overflower","summary":{"en":"An uncommon noun meaning something (or someone) that overflows; in computing, something linked to causing an overflow error.","zh":"一个不太常见的名词：指会溢出的东西/人；在计算机中可指与触发溢出错误有关的输入、程序或攻击者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that overflows or spills over the edge; something that cannot be contained.","zh":"溢出的人或事物；（液体等）装不下而溢出来的东西/现象。"},"examples":[{"en":"After the storm, the river became an overflower, covering the fields.","zh":"暴风雨过后，河水成了“溢出者”，淹没了田地。"},{"en":"This cup is an overflower if you fill it to the top.","zh":"这个杯子你一加满就会变成“溢出型”的（会溢出来）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A program, input, or attacker associated with causing an overflow error (especially a buffer overflow).","zh":"（计算机）与“溢出错误”有关的程序/输入/攻击者（尤指缓冲区溢出）。"},"examples":[{"en":"Security teams look for overflowers that can trigger a buffer overflow.","zh":"安全团队会寻找可能触发缓冲区溢出的“溢出触发者”。"},{"en":"The overflower input crashed the old application.","zh":"那个“溢出型”输入让旧程序崩溃了。"}]}],"synonyms":["overflow","spillover","overflowing (thing)","flooder","(computing) overflow trigger"],"phonetic":"/ˌoʊvərˈfloʊər/","extraExplanation":["“overflower”在现代英语里不算常用词；日常更常见的是“overflow”（名词/动词：溢出、溢出量）或形容词“overflowing”（满得溢出来的）。","在计算机语境中，更地道的说法通常是“buffer overflow”（缓冲区溢出）、“overflow exploit”（溢出漏洞利用），而不是单独说“overflower”。如果你是在读安全文章，可能是在用更口语化/临时造的名词。"]}
{"word":"overflowing","summary":{"en":"Overflowing means so full that it spills over, or (figuratively) extremely full of something like people or emotions.","zh":"Overflowing 指“满到溢出”，也可引申为“（人/事物/情绪）多到满溢、极其充满”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled beyond capacity; having more than can be held, often spilling over.","zh":"满得装不下的；溢出的（常常会溢出来）。"},"examples":[{"en":"The sink was overflowing after someone left the tap on.","zh":"有人忘了关水龙头，水槽一直在溢水。"},{"en":"Her inbox is overflowing with unread messages.","zh":"她的收件箱里堆满了未读消息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Flowing over the edge of something because it is too full; spilling out.","zh":"（液体等）漫出边缘的；外溢的。"},"examples":[{"en":"Water came from the overflowing bathtub onto the floor.","zh":"水从满溢的浴缸里流到地板上。"},{"en":"An overflowing river flooded the nearby fields.","zh":"河水漫出河岸，淹了附近的田地。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overflow”: to flow over or to be too full and spill.","zh":"“overflow”的现在分词：溢出；（因过满而）外溢。"},"examples":[{"en":"The cup kept overflowing, so I stopped pouring.","zh":"杯子一直在溢出来，所以我就停止倒了。"},{"en":"The stadium was overflowing with fans.","zh":"体育场里挤满了球迷（多到“溢出来”的感觉）。"}]}],"synonyms":["overfull","brimming","spilling","running over","teeming (with)"],"phonetic":"/ˌoʊvɚˈfloʊɪŋ/","extraExplanation":["“overflowing”既可以字面指“水等溢出来”，也常用作比喻，表示“多得惊人/充满”：如 overflowing with joy（喜悦满溢）、overflowing with people（人潮涌动）。","和“full”相比，overflowing 强调“超过容量、已经往外溢”的画面感；在写作中更有感染力，常见于新闻与文学描写洪水、人群或强烈情绪。"]}
{"word":"overflowingly","summary":{"en":"“Overflowingly” means “in an overflowing, very abundant or excessive way.”","zh":"“Overflowingly”表示“满溢地、极其充沛/过度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overflowing or excessive way; so much that it seems to spill over (often used for feelings, praise, or abundance).","zh":"以“满到溢出来”的方式；非常充沛、过度地（常形容情感、赞美或富足到像要溢出）。"},"examples":[{"en":"She was overflowingly grateful for everyone’s help.","zh":"她对大家的帮助感激得几乎要溢出来。"},{"en":"The room was overflowingly full after the free concert started.","zh":"免费音乐会开始后，房间里挤得满满当当。"}]}],"synonyms":["abundantly","profusely","excessively","extremely","copiously"],"phonetic":"/ˌoʊvɚˈfloʊɪŋli/","extraExplanation":["“overflowingly”来自形容词“overflowing（满溢的、充沛的）”加副词后缀“-ly”。在日常英语中它不算常见，更常见的表达是“extremely / incredibly / abundantly / profusely”，或用短语“to overflowing（满得要溢出来）”。在写作里用“overflowingly”会显得更文学、更强调“多到溢出”的画面感。"]}
{"word":"overflowingness","summary":{"en":"“Overflowingness” means the state of being overflowing—too full or abundant, literally or figuratively.","zh":"“overflowingness”指“满溢的状态”，可用于字面上的溢出或比喻上的极其丰盛、情感满溢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of overflowing; an overfull, abundant condition (literal or figurative).","zh":"溢出、满溢的状态或性质；（字面或比喻）过于充满、极其丰盛的状态。"},"examples":[{"en":"After days of rain, the river’s overflowingness flooded the fields.","zh":"连日大雨后，河水的满溢淹没了田地。"},{"en":"She spoke with an overflowingness of gratitude that moved everyone.","zh":"她怀着满溢的感激之情说话，感动了所有人。"}]}],"synonyms":["overflow","abundance","fullness","profusion","plenty"],"phonetic":"/ˌoʊvərˈfloʊɪŋnəs/","extraExplanation":["“overflowingness”由“overflowing（满溢的/溢出的）+ -ness（名词后缀，表示‘……的状态/性质’）构成，但在现代英语里相对少见，更多时候人们会用更自然的表达，如“overflow (n.) / abundance / fullness / profusion”。","在写作中它偶尔用于强调“溢出来的程度”或一种强烈、几乎控制不住的情感与丰盛感（如 gratitude/joy）。正式写作里建议优先选用更常见的名词。"]}
{"word":"overflown","summary":{"en":"“Overflown” means “having overflowed,” often describing water (or crowds, feelings, etc.) going beyond limits.","zh":"“Overflown”表示“已经溢出/漫过”，常形容水（也可指人群、情绪等）超出界限。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past participle of “overflow” (used in perfect tenses and passive voice): having flowed over the edge; having been too full and spilled over.","zh":"“overflow”的过去分词：表示（液体等）已溢出；或（容器等）已满而外溢（用于完成时/被动）。"},"examples":[{"en":"After the storm, the river had overflown its banks.","zh":"暴风雨之后，河水已经漫过了河岸。"},{"en":"The sink had overflown and water soaked the floor.","zh":"水槽已经溢出来了，水把地板浸湿了。"},{"en":"Several streets were overflown by muddy water.","zh":"几条街道被泥水淹没（漫过）了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) flooded or covered because something overflowed; spilling over.","zh":"（形容词）因溢出而被淹没的；外溢的。"},"examples":[{"en":"They avoided the overflown road near the creek.","zh":"他们避开了小溪附近那条被水漫过的路。"},{"en":"An overflown bathtub can damage the ceiling below.","zh":"浴缸外溢可能会损坏下面的天花板。"}]}],"synonyms":["overflowed","flooded","spilled over","brimmed over"],"phonetic":"/ˌoʊvərˈfloʊn/","extraExplanation":["“overflow”的动词变化有两套都常见：overflow–overflowed–overflowed（规则变化）和 overflow–overflew–overflown（不规则变化）。在较正式、文学或新闻语境里，“overflown”更常见。","“overflown”常出现在完成时（had overflown）或被动结构（were overflown by…）里；日常口语中也常用“overflowed”。"]}
{"word":"overflows","summary":{"en":"“Overflows” is the third-person singular verb form or plural noun of “overflow,” meaning to spill over from being too full, or (in computing) overflow errors.","zh":"“overflows”是“overflow”的动词第三人称单数或名词复数形式，常指（液体/内容）因过满而溢出，也可指（计算机）溢出错误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To flow over the edge of a container or boundary; to spill because there is too much liquid or content.","zh":"（动词第三人称单数）溢出；漫出（因液体或内容物过多而超过容器/边界）"},"examples":[{"en":"The bathtub overflows if you forget to turn off the water.","zh":"如果你忘记关水，浴缸就会溢出来。"},{"en":"After the storm, the river overflows its banks.","zh":"暴风雨过后，河水漫过河岸。"},{"en":"The trash can overflows every weekend.","zh":"垃圾桶每到周末就满得溢出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To be so full that it spreads beyond limits; to be filled with a strong feeling that shows outward.","zh":"（动词第三人称单数）充满到外溢；（情感）满溢、洋溢（以致表现出来）"},"examples":[{"en":"Her heart overflows with gratitude.","zh":"她心中充满感激之情。"},{"en":"The room overflows with energy during the performance.","zh":"演出时，整个房间充满了活力。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) Amounts of extra liquid or content that spill over; overflow events.","zh":"（名词复数）溢出物；溢流；（多次）溢出情况"},"examples":[{"en":"The town installed drains to prevent overflows during heavy rain.","zh":"该镇安装了排水设施，以防暴雨时发生溢流。"},{"en":"Engineers tracked sewage overflows to protect the river.","zh":"工程师追踪污水溢流情况以保护河流。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural, computing) Errors or results that happen when a number is too large for a computer system to store or calculate correctly.","zh":"（名词复数，计算机）溢出（错误）；当数值过大，超过系统可表示范围而产生的错误或异常结果"},"examples":[{"en":"The program crashed because of integer overflows.","zh":"程序因整数溢出而崩溃。"},{"en":"They fixed memory overflows to improve security.","zh":"他们修复了内存溢出问题以提升安全性。"}]}],"synonyms":["spill over","run over","flood","brim over","exceed","surge"],"phonetic":"/ˌoʊvɚˈfloʊz/","extraExplanation":["在计算机语境里，overflow 常见于两类：① integer overflow（整数溢出）：数值超过可表示范围，结果会“绕回去”或变成错误值；② buffer overflow（缓冲区溢出）：写入的数据超过预留空间，可能导致崩溃甚至安全漏洞。日常英语里更常用的是“液体溢出/河水漫出”。"]}
{"word":"overfluency","summary":{"en":"Overfluency means being too fluent in a way that can seem unnatural or insincere.","zh":"Overfluency 指“过度流利”，流利到显得不自然或不够真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive fluency—speaking or performing so smoothly and easily that it seems unnatural, overly polished, or not thoughtful enough.","zh":"过度流利——说话或表现得过于顺畅、太轻松，以至于显得不自然、过分圆滑，或让人觉得缺少思考。"},"examples":[{"en":"His presentation had a kind of overfluency that made it sound rehearsed rather than sincere.","zh":"他的演讲有一种过度流利的感觉，听起来更像彩排过的，而不够真诚。"},{"en":"Teachers sometimes worry that overfluency can hide weak understanding.","zh":"老师有时会担心，过度流利可能会掩盖理解不扎实的问题。"}]}],"synonyms":["excessive fluency","overly fluent speech","glibness","slickness"],"phonetic":"/ˌoʊvɚˈfluːənsi/","extraExplanation":["“Overfluency”不是非常常见的标准词，更常见的表达是“too fluent / overly fluent / excessive fluency”。它通常带一点负面含义：不是在夸你英语好，而是在说“流利得有点不自然”“像背稿”“太会说但内容空”。","构词上：over-（过度）+ fluency（流利）。在语言学习、教学或演讲评价里更可能出现，用来提醒“流利度”不等于“内容质量/深度”。"]}
{"word":"overfluent","summary":{"en":"Overfluent means ‘too fluent’—so smooth it may feel unnatural or insincere.","zh":"overfluent 指“流利过头”，顺到不自然，甚至显得不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Excessively fluent in speaking or writing; so smooth and easy that it may sound unnatural, showy, or insincere.","zh":"（不常用）过于流利的；说话或写作太顺畅，以至于显得不自然、卖弄或不真诚。"},"examples":[{"en":"His presentation was so overfluent that it sounded rehearsed rather than sincere.","zh":"他的演讲流利得有点过头，听起来更像排练过的，而不是真诚表达。"},{"en":"Try to be clear instead of overfluent—simple words often feel more honest.","zh":"尽量清晰就好，不必过于流利——简单的词往往更显真诚。"}]}],"synonyms":["too fluent","overly polished","glib","verbose","overly eloquent"],"phonetic":"/ˌoʊvərˈfluənt/","extraExplanation":["“over-” 是英语里很常见的前缀，表示“过度、过分”（如 overconfident 过度自信、overwork 过度工作）。因此 overfluent 通常带一点负面或批评语气：不是“英语很好”的夸奖，而是指“流利到不自然/像背稿/有点油滑”。","在正式写作或口语中，“overfluent”不算常见。更常用的表达包括：too fluent, overly polished（过于“打磨”过的）, glib（口若悬河但可能不真诚）, verbose（冗长）。"]}
{"word":"overfluently","summary":{"en":"“Overfluently” means speaking or writing too fluently—so smooth that it seems unnatural or rehearsed.","zh":"“overfluently”指“过于流利地”，流畅到不自然或像事先背好的。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively fluent way; so smoothly and easily that it may sound unnatural, rehearsed, or too fast.","zh":"过于流利地；流畅得过头，以至于听起来不自然、像背诵或太快。"},"examples":[{"en":"He answered overfluently, as if he had memorized the whole interview.","zh":"他回答得过于流利，仿佛把整场面试都背下来了。"},{"en":"The speech felt overfluently delivered and a little lacking in sincerity.","zh":"这篇演讲讲得过于顺滑，显得少了点真诚。"}]}],"synonyms":["too fluently","overly fluently","excessively fluently","a little too smoothly","over-polished (in style)"],"phonetic":"/ˌoʊvərˈfluəntli/","extraExplanation":["“Overfluently”非常少见，日常英语里更常用“too fluently / overly fluently / a little too polished（过于圆滑/润色过度）”。","前缀“over-”常表示“过度”，如“overconfident（过于自信）”“overprepared（准备过度）”。把它加在“fluently（流利地）”前面，就强调“流利得不自然”。"]}
{"word":"overfluentness","summary":{"en":"“Overfluentness” means being too fluent, in a way that may sound rehearsed or reduce clarity.","zh":"“overfluentness”指“过度流利”，流畅到可能显得像背稿或影响清晰度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The quality of being overly fluent—speaking or writing very smoothly, sometimes so much that it sounds rehearsed, too fast, or less clear/sincere.","zh":"（不常用）“过度流利”的状态——说话或写作非常顺畅，但可能顺畅到显得太像背稿、太快，或不够清晰/不够真诚。"},"examples":[{"en":"In the interview, his overfluentness made his answers sound memorized.","zh":"在面试中，他的“过度流利”让答案听起来像背过的。"},{"en":"Some teachers worry that overfluentness can hide weak grammar or shallow ideas.","zh":"一些老师担心，“过度流利”可能掩盖薄弱的语法或缺乏深度的想法。"},{"en":"Her overfluentness sometimes made it hard for listeners to follow the main point.","zh":"她有时说得太顺，反而让听众不容易抓住重点。"}]}],"synonyms":["over-fluency","excessive fluency","glibness","smoothness (sometimes negative)"],"phonetic":"/ˌoʊvərˈfluːəntnəs/","extraExplanation":["这个词非常少见，更常见的表达是“over-fluency”“excessive fluency”“too fluent”。在正式写作中，建议用更常见的搭配来避免读者觉得生造词。","构词：over-（过度）+ fluent（流利的）+ -ness（名词后缀，表示“……的状态/性质”）。"]}
{"word":"overflush","summary":{"en":"Overflush means to flush more than necessary, especially in plumbing or cleaning systems; less commonly, it can mean to become overly flushed (red).","zh":"Overflush 指冲水/冲洗过量（多用于管道、清洗等语境）；较少见地也可指（脸或皮肤）过度泛红。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to flush something more than necessary, often wasting water or causing overflow/pressure problems (e.g., toilets, pipes, irrigation systems)","zh":"过度冲水；冲洗过量（常指浪费水，或导致溢出、压力异常等问题，如马桶、管道、灌溉系统）"},"examples":[{"en":"If you overflush the toilet, you can waste a lot of water.","zh":"如果马桶冲水过度，会浪费很多水。"},{"en":"The technician warned that overflushing the lines could increase pressure and cause leaks.","zh":"技术人员警告说，过度冲洗管线可能会增压并导致漏水。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become flushed or red too strongly or for too long (less common; usually said of a face or skin)","zh":"（脸或皮肤）过度泛红、潮红（较少见的用法）"},"examples":[{"en":"After the hot drink, her cheeks seemed to overflush for a moment.","zh":"喝了热饮后，她的脸颊似乎一度过度泛红。"}]}],"synonyms":["flush too much","overuse the flush","over-rinse","overwash"],"phonetic":"/ˌoʊvərˈflʌʃ/","extraExplanation":["“Overflush”在日常英语里不算常见，更常见的表达是“flush too much / flush repeatedly / overuse the flush”。在工程或维护语境（管道、过滤系统、灌溉、清洗流程）里更可能看到“overflush”，表示冲洗量或冲洗时间超标，可能带来浪费、溢流或系统负担。","词形上是 over-（过度）+ flush（冲洗/冲水；脸红）。因此它的核心感觉就是“超过必要程度”。"]}
{"word":"overflutter","summary":{"en":"Overflutter means to flutter excessively, often suggesting nervous or uncontrolled movement.","zh":"overflutter 指“过度地颤动/飘动/振翅”，常带有紧张或失控的感觉。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to flutter too much or for too long; to move or tremble with excessive light, quick motions (often suggesting nervousness or overexcitement).","zh":"过度地振翅/飘动；（常指紧张或过度兴奋而）过分地颤动、躁动。"},"examples":[{"en":"The trapped bird began to overflutter against the cage, exhausting itself.","zh":"那只被困的鸟在笼子里过度振翅挣扎，把自己弄得精疲力尽。"},{"en":"Her hands seemed to overflutter when she heard her name called.","zh":"听到点到她的名字时，她的手像是过分地颤动起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to flutter excessively.","zh":"使某物过度飘动/振动。"},"examples":[{"en":"A sudden gust overfluttered the thin curtains by the window.","zh":"一阵突如其来的风把窗边的薄窗帘吹得过度飘动。"}]}],"synonyms":["flutter excessively","flutter too much","fidget","tremble","quiver"],"phonetic":"/ˌoʊvɚˈflʌtɚ/","extraExplanation":["“overflutter”不是日常高频词，更常见的表达是“flutter too much / flutter excessively”。它由前缀“over-（过度）”+“flutter（轻快地拍动/颤动）”构成，语感上常带有“太过了、失控了”的意味。","在写作中，它有时用来营造一种细碎、紧张或不安的画面感（例如鸟被困、心慌手抖、窗帘被风吹得乱动）。"]}
{"word":"overfly","summary":{"en":"Overfly means to fly above a place, often without landing, or to fly over an area for observation/inspection.","zh":"overfly 指飞越某地上空（常不停留/不降落），也可指为观察或巡查而从某区域上空飞行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fly above a place (such as a city, airport, or country), usually without landing there","zh":"飞越（某地）；从……上空飞过（通常不停留、不降落）"},"examples":[{"en":"The plane will overfly the city before turning south.","zh":"飞机将在飞越城市上空后向南转弯。"},{"en":"Due to bad weather, some flights had to overfly the airport and wait for clearance.","zh":"由于天气恶劣，一些航班不得不从机场上空飞过并等待获准降落。"}]},{"partOfSpeech":"v.","definition":{"en":"(of an aircraft or drone) to travel over an area in order to observe, inspect, map, or take photographs","zh":"（飞机/无人机）对……进行空中巡查、观察、测绘或航拍"},"examples":[{"en":"Drones are used to overfly the coastline and check for oil spills.","zh":"无人机被用来飞越海岸线进行巡查，检查是否有漏油。"},{"en":"The helicopter overflew the forest to search for the missing hikers.","zh":"直升机飞越森林上空搜寻失踪的徒步者。"}]}],"synonyms":["fly over","pass over","cross over","survey (from the air)","reconnoiter"],"phonetic":"/ˌoʊvərˈflaɪ/","extraExplanation":["“overfly”常见于航空与新闻语境：可以是中性描述（飞越某地），也可能带有敏感含义（例如“overfly another country’s territory”涉及领空与主权）。","词形变化：overfly / overflew / overflown。","与“fly over”的区别：两者意思接近，但“overfly”更正式、更常见于技术/官方表述；“fly over”更口语。"]}
{"word":"overflying","summary":{"en":"“Overflying” means flying over a place, often without landing; it can also describe aircraft that pass overhead.","zh":"“Overflying”指飞越某地上空（常不降落）；也可形容从头顶经过的飞机/飞行活动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “overfly”) flying above or across a place (often without landing).","zh":"（overfly 的现在分词）飞越；从……上空飞过（常指不降落）。"},"examples":[{"en":"Military aircraft were overflying the border area all morning.","zh":"军用飞机整个上午都在边境地区上空飞越。"},{"en":"The helicopter is overflying the city to look for missing hikers.","zh":"直升机正在飞越城市上空寻找失踪的徒步者。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, aviation/news) happening in the sky above a place; passing overhead.","zh":"（形容词，航空/新闻）在某地上空发生的；从头顶飞过的。"},"examples":[{"en":"Residents complained about overflying aircraft noise at night.","zh":"居民抱怨夜间上空飞过的飞机噪音。"},{"en":"The park is in an area with frequent overflying planes.","zh":"这个公园位于飞机经常从上空飞过的区域。"}]}],"synonyms":["flying over","passing overhead","overflight"],"phonetic":"/ˌoʊvərˈflaɪɪŋ/","extraExplanation":["“overfly/overflying”在新闻和航空语境里很常见，尤其涉及“overflight rights（领空飞越权）”。某国允许或禁止他国飞机“overfly its territory（飞越其领土）”，常与外交、军事或航线审批有关。","注意拼写：动词是 overfly，名词常用 overflight（一次飞越/飞越行为）。"]}
{"word":"overfold","summary":{"en":"Overfold means to fold something over; in geology, it refers to (or forms) a fold where rock layers are pushed over and may be overturned.","zh":"overfold 指“把某物对折/翻折”；在地质学中指（或形成）岩层被推覆、甚至发生倒转的褶皱构造。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fold something over so that one part covers another part; to bend over on itself","zh":"把某物向上/向外折过去，使一部分覆盖另一部分；折叠成覆盖状"},"examples":[{"en":"Overfold the top edge of the paper to make a clean crease.","zh":"把纸的上边缘向下对折，压出清晰的折痕。"},{"en":"She overfolded the blanket and placed it on the sofa.","zh":"她把毯子对折好，放在沙发上。"}]},{"partOfSpeech":"vi.","definition":{"en":"(geology) to form an overfold; to become folded so strongly that one limb is pushed over the other","zh":"（地质）形成倒转褶皱；褶皱作用强烈到一侧岩层被推覆到另一侧之上"},"examples":[{"en":"In some mountain belts, layers can overfold under intense pressure.","zh":"在一些造山带里，地层在强烈挤压下会发生倒转褶皱。"},{"en":"These rocks were compressed and overfolded during the collision of tectonic plates.","zh":"这些岩石在板块碰撞时受到挤压并发生倒转褶皱。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology) an overfolded structure; a fold in rock layers where one side is pushed over the other","zh":"（地质）倒转褶皱；一侧岩层被推覆到另一侧之上的褶皱构造"},"examples":[{"en":"The outcrop shows a clear overfold, with older layers lying above younger ones.","zh":"这处露头显示出明显的倒转褶皱：较老的地层压在较新的地层之上。"}]}],"synonyms":["fold over","fold","double over","overturn (geology context)","overturned fold (related term)"],"phonetic":"ˌoʊvərˈfoʊld","extraExplanation":["在日常英语里，overfold 作为“把东西对折/翻折”的动词并不算最常用，更多时候人们会说 fold over 或 fold. 但在地质学语境中，overfold/overfolded 是相对常见的术语，用来描述褶皱强烈到“翻转”的情况。","地质里常见的相关词还有 overturned fold（倒转褶皱）和 overthrust（逆冲推覆）。当你看到“老地层在上、新地层在下”的反常层序时，往往可能与 overfold/推覆有关。"]}
{"word":"overfond","summary":{"en":"Overfond means excessively fond—liking someone or something too much, often in a way that seems unhealthy or overly doting.","zh":"overfond 指“过分喜爱/过度溺爱”，通常暗含“喜欢得有点过头”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much affection or liking for someone or something; excessively attached.","zh":"对某人或某物过分喜爱；过度依恋。"},"examples":[{"en":"She is overfond of sweets, so she tries not to keep candy at home.","zh":"她太爱吃甜食了，所以尽量不在家里放糖果。"},{"en":"He grew overfond of the child and found it hard to say goodbye.","zh":"他对那个孩子越来越过分喜爱，结果很难道别。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing too much praise or tenderness; overly doting.","zh":"表现得过分溺爱；过度亲昵或夸赞。"},"examples":[{"en":"The review felt overfond and not very honest.","zh":"那篇评论显得过分吹捧，不太真诚。"},{"en":"Her overfond attention embarrassed him in front of his friends.","zh":"她过分亲昵的关注让他在朋友面前很尴尬。"}]}],"synonyms":["excessively fond","too attached","overly doting","besotted"],"phonetic":"/ˌoʊvɚˈfɑnd/","extraExplanation":["“over-”是前缀，表示“过度、太……”，所以 overfond 常带有轻微的负面含义：喜欢到不太健康、不过分理性，或让别人不舒服。","常见搭配：be overfond of…（过分喜欢……）；overfond parent（过度溺爱的父母）。"]}
{"word":"overfondle","summary":{"en":"“Overfondle” means to fondle or touch someone excessively or in an unwanted way.","zh":"“overfondle”指对某人过度抚摸（常带性意味或不受欢迎的触碰）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to touch or handle someone (often in a sexual way) too much, for too long, or in an unwanted/excessive way","zh":"（常指带有性意味地）过度抚摸；抚摸得太久/太多，甚至让人不舒服或不愿意"},"examples":[{"en":"He kept overfondling her during the movie, and she asked him to stop.","zh":"电影期间他一直过度抚摸她，她让他停下。"},{"en":"The complaint said the coach overfondled players during “massage” sessions.","zh":"投诉称那位教练在所谓“按摩”时过度抚摸球员。"},{"en":"Don’t overfondle a pet—some animals get stressed by too much touching.","zh":"别过度抚摸宠物——有些动物被摸太多会紧张。"}]}],"synonyms":["grope","fondle too much","touch inappropriately","paw at (informal)"],"phonetic":"/ˌoʊvɚˈfɑndəl/","extraExplanation":["“over-”表示“过度、超过合适程度”。因此 overfondle 强调“超过正常/合适的抚摸”，常带有负面含义，尤其涉及边界与同意（consent）。","这个词不算常见，更常见的表达有: grope（乱摸/猥亵地摸）, fondle too much（抚摸过多）, touch inappropriately（不当触碰）。在正式语境（投诉、新闻）里常用 inappropriate touching / sexual touching。"]}
{"word":"overfondled","summary":{"en":"“Overfondled” means touched/handled in an overly affectionate way, or having been fondled too much.","zh":"“overfondled”指被过度亲昵地触摸/摆弄，或（动词）过度抚弄了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “overfondle”) to touch or handle someone or something in an overly affectionate way, especially too much or for too long.","zh":"（“overfondle”的过去式/过去分词）以过度亲昵的方式触摸或抚弄（某人/某物），尤指太多或太久。"},"examples":[{"en":"The puppy was overfondled by visitors and eventually hid under the couch to rest.","zh":"小狗被来访的人过度抚摸，最后躲到沙发下面休息。"},{"en":"The fragile fabric looked worn where it had been overfondled.","zh":"那块脆弱的布料在被过度揉搓的地方看起来更磨损。"}]},{"partOfSpeech":"adj.","definition":{"en":"touched or handled too much in an affectionate way (sometimes implying discomfort, annoyance, or inappropriate behavior depending on context).","zh":"被过度亲昵地触摸或摆弄的（有时会暗示不适、厌烦；在特定语境下也可能暗示不当行为）。"},"examples":[{"en":"After the photo session, the baby seemed overfondled and fussy.","zh":"拍完照后，宝宝看起来被折腾得太多，有些烦躁。"},{"en":"The collectible’s surface was shiny in places, as if overfondled.","zh":"这件收藏品表面有些地方发亮，像是被人把玩过度。"}]}],"synonyms":["overhandled","petted too much","fussed over too much","handled too much"],"phonetic":"ˌoʊvərˈfɑndəld","extraExplanation":["“over-”是常见前缀，表示“过度、太多”（如 overeat 吃太多，overwork 过度工作）。因此 overfondle 直观意思就是“fondle（抚弄、抚摸）得过头”。","注意语域与语境：fondle 在日常英语里可能带有性暗示；如果谈到儿童或身体接触，overfondled 可能让人联想到“不当触摸”。更中性、稳妥的表达可用 “handled too much / petted too much / fussed over too much（被过度照顾/逗弄）”。"]}
{"word":"overfondling","summary":{"en":"Overfondling means excessive or inappropriate touching/fondling.","zh":"overfondling 指过度或不恰当的触碰/爱抚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or inappropriate fondling (touching someone a lot, often in an intimate or sexual way).","zh":"过度（或不恰当的）抚摸/爱抚（指频繁触碰他人，常带有亲密或性意味）。"},"examples":[{"en":"The complaint described overfondling during the massage session.","zh":"投诉称在按摩过程中出现了过度的触摸（不当爱抚）。"},{"en":"Parents sometimes worry that overfondling a baby will spoil them, though gentle touch is usually healthy.","zh":"有些父母担心过度抱摸会把宝宝宠坏，但温柔的触摸通常是有益的。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of fondling too much; touching or handling something more than necessary.","zh":"过度把玩/揉搓（指对某物摸来摸去超过必要程度）。"},"examples":[{"en":"Overfondling the fabric can wear it out faster.","zh":"过度揉搓布料会让它更快磨损。"},{"en":"Try not to damage the specimen by overfondling it.","zh":"尽量不要因过度把玩而损坏标本。"}]}],"synonyms":["excessive touching","inappropriate touching","unwanted touching","groping (often sexual)","overhandling"],"phonetic":"/ˌoʊvɚˈfɑnd(ə)lɪŋ/","extraExplanation":["“overfondling”不是很常见的标准词，更多见于描述性或法律/投诉语境中，用来强调“越界的触碰”。在涉及人际身体接触时，这个词往往带有强烈的负面评价（不适当、可能不经同意）。在正式表达里，也常用更明确的说法，如 “inappropriate touching / unwanted touching”。"]}
{"word":"overfondly","summary":{"en":"“Overfondly” means excessively fondly—showing too much affection or approval, often in a slightly critical sense.","zh":"overfondly 意为“过于喜爱/过于偏爱地”，常含“喜欢得过头、不够客观”的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows too much affection, liking, or approval; excessively fondly.","zh":"以过分喜爱、过分溺爱或过分赞许的方式；过于偏爱地。"},"examples":[{"en":"She spoke overfondly of her hometown, ignoring its problems.","zh":"她过于偏爱地谈起自己的家乡，对它的问题视而不见。"},{"en":"The teacher wrote overfondly about the student’s work and missed several mistakes.","zh":"老师对那位学生的作业评价过于偏爱，结果漏掉了好几个错误。"},{"en":"He looked at the old photos overfondly, as if the past had been perfect.","zh":"他过于沉溺地看着旧照片，仿佛过去一切都很完美。"}]}],"synonyms":["too fondly","overly affectionately","overly admiringly","indulgently","sentimentally"],"phonetic":"ˌoʊvɚˈfɑndli","extraExplanation":["“over-”常表示“过度、超过正常程度”。因此 overfondly 往往带一点负面或提醒的语气：不是单纯“很喜欢”，而是“喜欢到不够客观/可能溺爱”。","overfondly 比 very fondly 更强调“过头了”。写作中常用来暗示说话者带偏见（例如对人、对回忆、对作品评价过于宽容）。"]}
{"word":"overfondness","summary":{"en":"Overfondness means excessive fondness—liking someone or something too much, sometimes to the point of bias.","zh":"overfondness 指“过度喜爱/偏爱”，喜欢得太多，有时会带来偏心或不客观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive liking or affection for someone or something; too much fondness, sometimes suggesting bias or lack of good judgment","zh":"过度的喜爱/偏爱；过分的喜爱之情（有时暗示偏心或判断不够客观）"},"examples":[{"en":"Her overfondness for her youngest child made it hard for her to discipline him.","zh":"她对最小的孩子过分宠爱，让她很难管教他。"},{"en":"The coach’s overfondness for one player caused tension on the team.","zh":"教练对某一名球员的过度偏爱引起了队内的紧张关系。"},{"en":"He spoke with an overfondness for the past, ignoring its problems.","zh":"他谈起过去时带着过度的眷恋，却忽视了其中的问题。"}]}],"synonyms":["excessive fondness","overattachment","partiality","bias","overindulgence"],"phonetic":"/ˌoʊvɚˈfɑndnəs/","extraExplanation":["“over-”表示“过度/太多”。因此 overfondness 常带一点负面含义：不仅是“很喜欢”，还可能暗示“宠溺、偏心、失去客观”。","语体上较正式，写作和评论中更常见；口语里更常说 “too fond of” 或 “a bit biased toward”。"]}
{"word":"overfoolish","summary":{"en":"“Overfoolish” means “too foolish” or “foolish to an excessive degree.”","zh":"“overfoolish”意为“过于愚蠢的/傻得过头的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too foolish; showing more foolishness than is sensible or acceptable.","zh":"过于愚蠢的；傻得过头的；（行为）不合时宜地愚笨。"},"examples":[{"en":"It would be overfoolish to quit your job without a plan.","zh":"没有计划就辞职会傻得过头。"},{"en":"Don’t be overfoolish—read the instructions before you start.","zh":"别傻过头——开始前先读说明。"},{"en":"His overfoolish joke offended people at the meeting.","zh":"他在会议上那个过于愚蠢的玩笑冒犯了别人。"}]}],"synonyms":["too foolish","extremely foolish","very foolish","downright foolish","absurd"],"phonetic":"/ˌoʊvərˈfuːlɪʃ/","extraExplanation":["“overfoolish”不是常见的标准词，更常见的表达是“too foolish / extremely foolish / very foolish / downright foolish”。它由前缀“over-”（表示“过度”）+ “foolish”构成，语气带有明显的评价和批评。","在正式写作中建议改用更自然的搭配；在口语、修辞或强调语气时偶尔会见到这种构词。","近义表达的语气差别：too foolish（中性、常用）≈ very foolish；downright foolish（更强烈、更直接）；reckless（强调鲁莽/不顾后果，含义略不同）。"]}
{"word":"overfoolishly","summary":{"en":"“Overfoolishly” means “too foolishly”—in an excessively unwise way.","zh":"“overfoolishly”表示“太愚蠢地/过于不明智地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively foolish or unwise way; too foolishly.","zh":"以过于愚蠢或不明智的方式；太傻地。"},"examples":[{"en":"He overfoolishly ignored the warning signs and got into trouble.","zh":"他太愚蠢地无视了警告标志，结果惹上了麻烦。"},{"en":"Overfoolishly spending all your savings at once can cause stress later.","zh":"过于不明智地一次花光所有积蓄，之后可能会带来压力。"}]}],"synonyms":["too foolishly","very foolishly","rashly","recklessly","imprudently"],"phonetic":"/ˌoʊvərˈfuːlɪʃli/","extraExplanation":["“overfoolishly”比较少见，通常人们更常用“too foolishly”或“very foolishly”。","词缀“over-”常表示“过度、超过适当程度”（如 overreact 反应过度、overconfident 过度自信）。把它加在“foolishly”（愚蠢地）前面，就强调“愚蠢得过头”。","语气上带有批评或懊悔色彩，常用于评价某个决定或行为“不只是愚蠢，而是愚蠢得离谱”。"]}
{"word":"overfoolishness","summary":{"en":"“Overfoolishness” means excessive foolishness, but it’s an uncommon, informal/creative word.","zh":"“overfoolishness”指“过度的愚蠢”，但它不常见，偏非正式/创造性用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive foolishness; behavior or thinking that is more foolish than normal.","zh":"过度的愚蠢；比一般更愚蠢的行为或想法。"},"examples":[{"en":"Calling it ‘overfoolishness’ is harsh, but the plan really ignored the facts.","zh":"把它称为“overfoolishness（过度愚蠢）”有点刻薄，但这个计划确实无视事实。"},{"en":"His overfoolishness cost the team time and money.","zh":"他的过度愚蠢让团队付出了时间和金钱的代价。"}]}],"synonyms":["excessive foolishness","extreme foolishness","stupidity","recklessness","folly"],"phonetic":"/ˌoʊvɚˈfuːlɪʃnəs/","extraExplanation":["“overfoolishness”不是常见标准词，更像是临时造词（nonce word）。它由前缀 over-（“过度、太……”）+ foolishness（“愚蠢”）组合而成，用来强调“愚蠢到了过头”的程度。","在正式写作中更常用的表达包括：excessive foolishness, extreme foolishness, sheer stupidity, reckless stupidity（语气更强）。如果你用“overfoolishness”，通常会带一点讽刺或批评的口吻。"]}
{"word":"overfoot","summary":{"en":"Overfoot is a rare/archaic verb meaning either “to trample/step on” or, less commonly, “to overtake by walking or running.”","zh":"Overfoot 是一个罕见/古旧动词，常指“踩踏、踏过”，较少见也可指“步行或奔跑追上并超过”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or dialect) To step on or trample; to tread over.","zh":"（古旧或方言）踩踏；践踏；踏过。"},"examples":[{"en":"The heavy cart had overfooted the grass, leaving it flat.","zh":"沉重的车把草地碾过（踩踏过），草都被压平了。"},{"en":"Try not to overfoot the young plants in the garden.","zh":"尽量别踩到花园里刚长出的幼苗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To overtake or outrun someone by walking or running.","zh":"（罕见）用步行或奔跑追上并超过（某人）。"},"examples":[{"en":"He overfooted his companion on the steep path.","zh":"他在陡峭的小路上赶上并超过了同伴。"},{"en":"They joked that no one could overfoot her on a long hike.","zh":"他们开玩笑说，长途徒步时没人能走得过她。"}]}],"synonyms":["trample","tread on","step on","overtake","outrun"],"phonetic":"/ˌoʊvərˈfʊt/","extraExplanation":["“overfoot”在现代英语中非常少见，多数学习与写作场景几乎不会用到；更常见的表达是“trample (on) / step on / tread on”（踩踏）以及“overtake / outrun”（追上、超过）。","如果你是在古诗、旧小说或方言材料里看到它，它有时也会写作“over-foot”（带连字符），含义通常从上下文推断：要么是“踩过/践踏”，要么是“走路追上并超过”。"]}
{"word":"overforce","summary":{"en":"Overforce means either using too much force (too hard) or overpowering by force, but it’s relatively uncommon in everyday English.","zh":"Overforce 表示“用力过猛”或“以强力制服”，但在日常英语里相对少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to use more physical force than is necessary; to push, pull, or tighten too hard","zh":"用力过猛；施加超过必要的力量（如推、拉、拧得太用力）"},"examples":[{"en":"Be careful not to overforce the lid, or the jar might crack.","zh":"小心别把盖子拧得太用力，不然玻璃罐可能会裂。"},{"en":"He overforced the door and broke the handle.","zh":"他把门推得太猛，把门把手弄坏了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overpower someone or something by force; to forcefully defeat or restrain","zh":"以强力压制；制服（某人/某物）"},"examples":[{"en":"The guards quickly overforced the intruder and took him outside.","zh":"保安很快制服了闯入者，把他带到外面。"}]}],"synonyms":["use too much force","force too hard","overtighten","overpower","subdue"],"phonetic":"/ˌoʊvɚˈfɔrs/","extraExplanation":["“overforce”在现代英语中不算常见，用在日常表达时更自然的说法常是“use too much force / force it too hard / overtighten（拧得过紧）”。","如果你想表达“以武力压倒/制服”，更常用“overpower”或“subdue”；“overforce”在这层意思上更偏书面或较少见用法。"]}
{"word":"overforced","summary":{"en":"Overforced means overly forced—too much effort, unnatural, or strained from being pushed too hard.","zh":"overforced 指“过度用力/过度勉强”的：要么显得不自然、太刻意，要么因被过度使用而变得紧绷或过劳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Forced or pushed too much; done with excessive effort so it sounds or feels unnatural.","zh":"过度用力的；用力过猛而显得不自然的。"},"examples":[{"en":"Her laugh sounded overforced, like she was trying too hard to seem relaxed.","zh":"她的笑声听起来很勉强，像是为了显得放松而用力过猛。"},{"en":"The dialogue feels overforced and doesn’t match how people really speak.","zh":"这段对白显得很生硬，不像人们真实的说话方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overworked or overstrained (especially a voice, body, or system) by being used beyond a comfortable limit.","zh":"（尤指声音、身体或系统）过度使用而过劳的；过度紧绷的。"},"examples":[{"en":"After the long rehearsal, his voice was overforced and started to crack.","zh":"长时间排练后，他的嗓子过度用力，开始破音。"},{"en":"The engine failed because it was overforced for hours under heavy load.","zh":"发动机在重负荷下连续运转数小时被过度压榨，最终故障了。"}]}],"synonyms":["strained","forced","overstrained","overworked","overdone","labored"],"phonetic":"/ˌoʊvərˈfɔrst/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”。因此 overforced = forced（强迫/用力）+ over-（过度），整体强调“用力过头”“太刻意”。","在写作与口语评价里，overforced 常用于批评表演、笑容、幽默、情感表达等“太做作、不自然”；在技术语境中也可指设备/系统被“超负荷”使用。"]}
{"word":"overforcing","summary":{"en":"Overforcing means applying too much force or pushing something beyond safe limits, often causing damage or injury.","zh":"Overforcing 指用力过大或强行超过安全限度，常导致损坏或受伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"using too much force, or forcing something beyond a safe or normal limit","zh":"用力过猛；把某物强行推到超过安全或正常范围"},"examples":[{"en":"The bolt snapped because of overforcing during installation.","zh":"螺栓在安装时因为用力过猛而断裂。"},{"en":"Overforcing the door can damage the lock.","zh":"硬推门（用力过猛）可能会把锁弄坏。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of applying too much force to something; overexerting","zh":"用力过猛的行为；过度施力（也可泛指过度用力/过度强迫）"},"examples":[{"en":"Stop overforcing—tighten it gently until it’s secure.","zh":"别再用力过猛了——轻轻拧紧到稳固就行。"},{"en":"He injured his wrist by overforcing the movement.","zh":"他因为动作用力过猛而伤了手腕。"}]}],"synonyms":["overexertion","forcing","overdoing","excessive force"],"phonetic":"/ˌoʊvɚˈfɔrsɪŋ/","extraExplanation":["“overforcing”并不是非常常见的日常词，更常见的表达是 overexertion（过度用力）、forcing it（硬来/强行）、using too much force（用力过大）。在工程、维修、运动损伤等语境里用“overforcing”比较贴切，强调“超过承受范围导致损坏/受伤”。","对应动词是 overforce（对……施加过大的力/强行使……超负荷），但也偏书面或技术语境；口语里通常说 don’t force it / don’t overdo it。"]}
{"word":"overforged","summary":{"en":"Overforged describes metal that has been forged too much (often damaging it), and by extension anything that feels overly forced or over-crafted.","zh":"Overforged 指金属锻造过度而受损；也可比喻作品或表达过于刻意、雕琢过头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of metal) forged too much or at too high a temperature, so it becomes damaged, brittle, or loses its best qualities.","zh":"（指金属）锻造过度或温度过高，导致受损、变脆或性能下降。"},"examples":[{"en":"The smith warned that the blade could become overforged if heated and hammered too many times.","zh":"铁匠警告说，如果反复加热锤打太多次，刀刃可能会锻造过度。"},{"en":"The workshop rejected the overforged parts because the metal’s strength was no longer reliable.","zh":"工坊退回了那些过度锻造的零件，因为金属强度已不可靠。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) made overly “crafted” or forced, so it feels unnatural or exaggerated.","zh":"（比喻）过于刻意打造、显得做作或夸张，不自然。"},"examples":[{"en":"Some readers felt the dialogue was overforged and didn’t sound like real speech.","zh":"有些读者觉得对话太做作，不像真实说话。"},{"en":"The poem’s imagery is powerful, but a few lines seem overforged.","zh":"这首诗的意象很有力量，但有几句显得过于雕琢。"}]}],"synonyms":["overworked","overheated","overprocessed","overwrought","overdone"],"phonetic":"/ˌoʊvərˈfɔrdʒd/","extraExplanation":["“overforged”是由前缀 over-（过度）+ forged（锻造的/伪造的）构成的过去分词形容词；在日常英语里不算常见，更常见的技术表达是 “overworked (metal)” 或更具体的工艺描述。","注意不要和 “forged”（伪造的）混淆：在金工语境里 forge=锻造；在法律/文件语境里 forge=伪造。","在文学或评论里，用“overforged”作比喻时，常带有“过度修饰、用力过猛”的批评意味。"]}
{"word":"overformalize","summary":{"en":"Overformalize means to make something unnecessarily formal.","zh":"overformalize 指把某事弄得过于正式、不必要地正式化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more formal than is necessary or helpful (in language, style, rules, or procedures)","zh":"把某事变得过于正式（在语言、文风、规则或流程上过度正式化），以致不必要或不利于沟通/执行"},"examples":[{"en":"We overformalized the email, and it sounded cold instead of friendly.","zh":"我们把这封邮件写得过于正式，结果听起来很冷淡而不友好。"},{"en":"Don’t overformalize the rules—people need something simple they can follow.","zh":"别把规则弄得过度正式化——大家需要简单好执行的东西。"},{"en":"The report overformalizes everyday issues with legal-sounding language.","zh":"这份报告用法条式的措辞把日常问题写得过于正式。"}]}],"synonyms":["make too formal","overcomplicate","bureaucratize","stiffen (the tone)"],"phonetic":"/ˌoʊvərˈfɔrməˌlaɪz/","extraExplanation":["“over-”在英语里常表示“过度、超过必要程度”（如 overthink 过度思考、overcomplicate 过度复杂化）。因此 overformalize 通常带有负面含义：太正式反而降低清晰度、亲和力或效率。","常见搭配：overformalize a message/email（把信息写得过于正式）、overformalize a process/procedure（把流程过度规范化/繁琐化）、overformalize a policy（把政策写得过于官样文章）。"]}
{"word":"overformalized","summary":{"en":"Overformalized means “too formal,” especially in a way that feels unnatural or unnecessarily complicated.","zh":"overformalized 指“过度正式化”，常带有“不自然或不必要地复杂”的批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made excessively formal in style, language, rules, or procedures, often sounding unnatural or creating unnecessary complexity.","zh":"过度正式化的；形式感过强的（在语言、规则或流程上显得不自然或徒增复杂）。"},"examples":[{"en":"The email felt overformalized and cold, even though it was meant to be friendly.","zh":"这封邮件显得过度正式而冷淡，尽管本意是友好的。"},{"en":"Their customer service process is overformalized, so simple requests take weeks.","zh":"他们的客服流程过度正式化，导致简单的请求也要拖上几周。"}]}],"synonyms":["overly formal","stiff","pompous","bureaucratic"],"phonetic":"/ˌoʊvɚˈfɔrməˌlaɪzd/","extraExplanation":["“Overformalized”常用来批评某种表达或制度把“正式”推得太过：比如用太多套话、被动语态、法律式措辞，或设置过多审批与表格，结果让沟通更疏离、效率更低。写作或职场沟通中，英语更偏好“clear and direct（清晰直接）”，因此太“官样文章”的语气容易被说成 overformalized。"]}
{"word":"overformalizing","summary":{"en":"“Overformalizing” means making something (especially language or procedures) too formal or rigid, often hurting clarity or sincerity.","zh":"“overformalizing”指把语言或流程弄得过于正式、僵硬，常会损害清晰度或真诚感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something too formal, rigid, or complicated, often in a way that reduces clarity, warmth, or practicality","zh":"把某事弄得过于正式、僵硬或复杂，常常导致不清晰、缺乏亲切感或不够实用"},"examples":[{"en":"The email was clear at first, but overformalizing it made the message harder to understand.","zh":"这封邮件一开始很清楚，但一旦过度正式化，信息反而更难理解。"},{"en":"She worried that overformalizing the apology would make it sound insincere.","zh":"她担心把道歉写得过于正式会显得不真诚。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of making language, rules, or procedures more formal than necessary","zh":"把语言、规则或流程弄得比必要程度更正式的行为或习惯"},"examples":[{"en":"Overformalizing is common in academic writing when writers try to sound “smart.”","zh":"在学术写作中，人们为了显得“更厉害”而过度正式化是很常见的。"},{"en":"The team agreed to avoid overformalizing and to keep the meeting notes simple.","zh":"团队同意避免过度正式化，让会议纪要保持简洁。"}]}],"synonyms":["being too formal","overformalization","making it overly formal","stiffening","overcomplicating"],"phonetic":"ˌoʊvərˈfɔrməˌlaɪzɪŋ","extraExplanation":["“over-”表示“过度”。因此 overformalize/overformalizing 带有轻微负面含义：不是“更正式=更好”，而是“正式过头”。","常见场景：商务邮件、求职信、学术写作、政策/流程制定。适度正式显得专业；过度正式可能显得生硬、疏离，甚至掩盖重点。","写作上可用更自然的表达来避免 overformalizing：优先用短句、常用词、主动语态，并把礼貌放在清晰之后（clear > overly formal）。"]}
{"word":"overformed","summary":{"en":"Overformed means formed or developed too much, so it looks unnatural or excessive.","zh":"overformed 指“形成/发展过度”，因此显得不自然或过头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Formed too much or more than is normal or needed; excessively developed or shaped.","zh":"过度形成的；形成过多的；过度发育/过度塑造的。"},"examples":[{"en":"The clay figure looked overformed, with details that made it less natural.","zh":"这个黏土人偶看起来有点过度塑造，细节太多反而不自然。"},{"en":"Some muscles can appear overformed if you train one area too intensely.","zh":"如果某个部位练得太狠，有些肌肉看起来会显得过度发达。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Made or expressed with too much structure or rigidity; not natural because it is overly constructed.","zh":"（较少见）过于刻板/结构过强的；因过度加工而不自然的。"},"examples":[{"en":"His apology sounded overformed and rehearsed.","zh":"他的道歉听起来太刻意、像彩排过一样。"},{"en":"The essay felt overformed, as if every sentence followed the same pattern.","zh":"这篇文章显得过于程式化，好像每句话都用同一种结构。"}]}],"synonyms":["overdeveloped","overdone","overbuilt","excessive","overly structured"],"phonetic":"/ˌoʊvərˈfɔrmd/","extraExplanation":["“overformed”在日常英语里不算常见，更常用的替代说法有：overdone（做过头的）、overdeveloped（过度发育的）、overbuilt（建得过度的）、too structured/too rigid（太刻板）。","写作中如果你想强调“自然 vs. 过度加工”的对比，可以用“overly structured”或“overpolished”。","有时也会写成带连字符的“over-formed”，用来更清楚地表达“过度形成/过度构造”的意思。"]}
{"word":"overforward","summary":{"en":"Overforward means “too forward”—overly bold, familiar, or pushy in social behavior or speech.","zh":"overforward 表示“过于唐突/冒进”，指言行太大胆、太自来熟或太咄咄逼人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too forward or bold in behavior or speech; overly familiar, pushy, or presumptuous.","zh":"（言行）过于冒失/唐突；过分自来熟、咄咄逼人；有点放肆。"},"examples":[{"en":"He can be a bit overforward in meetings, interrupting people before they finish.","zh":"他在会议上有点太冒失了，经常别人还没说完就插话。"},{"en":"She worried the question might sound overforward, so she rephrased it politely.","zh":"她担心这个问题听起来太唐突，于是改用更礼貌的说法。"},{"en":"The salesperson wasn’t rude, just overforward with personal questions.","zh":"那个销售并不算无礼，只是对私人问题问得太直接、太冒进了。"}]}],"synonyms":["pushy","too forward","overly familiar","presumptuous","bold","impertinent"],"phonetic":"/ˌoʊvɚˈfɔrwɚd/","extraExplanation":["“overforward”由 over-（过度）+ forward（唐突/冒进的）构成，语气偏书面或较少见；现代口语里更常用 pushy, too forward, overly familiar, presumptuous 等。","注意它通常是在批评某人“越界”的社交表现（比如太快谈隐私、过度主动、说话太直），并不一定等同于“自信（confident）”。"]}
{"word":"overforwardly","summary":{"en":"“Overforwardly” means behaving or speaking in a way that is too bold, familiar, or eager—often seen as pushy or improper.","zh":"“overforwardly”指言行过于大胆、熟络或急切，常给人强势、唐突、不合礼数的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too bold, too familiar, or too eager (often implying rudeness or lack of social restraint).","zh":"以过于大胆、过于熟络或过于急切的方式（常带有“冒失、没分寸”的意味）。"},"examples":[{"en":"He spoke overforwardly to the guests, as if he had known them for years.","zh":"他对客人说话太过冒失熟络，仿佛早就认识他们多年一样。"},{"en":"The intern overforwardly offered advice before understanding the problem.","zh":"实习生还没弄清问题就过于急切地提建议。"}]}],"synonyms":["pushily","overly boldly","too familiarly","overeagerly","presumptuously"],"phonetic":"/ˌoʊvɚˈfɔrwɚdli/","extraExplanation":["“overforwardly”来自形容词“overforward”（过于冒失/唐突），而“forward”除了“向前的”，也常指“冒进的、放肆的、过分主动的”。这个副词在现代英语里比较少见，更多时候会用“too boldly / too familiarly / overly eager(ly) / pushily”来表达。","语域提示：它常用于带有评判的语境，暗示说话或行为“越界”“没分寸”，尤其在社交礼仪或上下级关系中。"]}
{"word":"overforwardness","summary":{"en":"Overforwardness means being too bold or pushy in a way that can seem rude or overly familiar.","zh":"overforwardness 指言行过于大胆或强势，显得唐突、没分寸，甚至有点无礼或过度熟络。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive forwardness; being too bold, pushy, or familiar (often in a way that feels rude or presumptuous).","zh":"过分冒失/唐突；过于大胆、强势或过度熟络（常带有无礼或自以为是的感觉）。"},"examples":[{"en":"Her overforwardness in the interview made the panel uncomfortable.","zh":"她在面试中过分冒失的表现让评委感到不自在。"},{"en":"He apologized for his overforwardness after asking such personal questions.","zh":"他问了那么私人的问题后，为自己的唐突道了歉。"},{"en":"In some cultures, what seems like confidence elsewhere may be seen as overforwardness.","zh":"在某些文化中，在别处被视为自信的表现，可能会被看作过于唐突。"}]}],"synonyms":["pushiness","presumption","overfamiliarity","boldness","impertinence"],"phonetic":"/ˌoʊvərˈfɔrwərdnəs/","extraExplanation":["“forward”除了“向前的”，也常指“大胆的、主动的、（有时）过于熟络的”。加上 over- 就强调“过头了”，因此 overforwardness 通常带负面评价，接近“冒失、鲁莽、没分寸”。","这个词相对少见，更常用的表达有：pushiness（咄咄逼人）、presumption（冒昧）、overfamiliarity（过分熟络）。"]}
{"word":"overfought","summary":{"en":"“Overfought” means fought too much; it can describe someone/something worn out by excessive fighting, or be the past form of “overfight.”","zh":"“overfought”表示“打得过度”，可形容因过度争斗而疲惫/受损，也可作 overfight 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Fought too much or fought beyond what was reasonable; worn out or damaged from excessive fighting.","zh":"（形容词）打得过度的；过分争斗的；因长期/过度战斗而疲惫或受损的。"},"examples":[{"en":"The overfought army could barely move after weeks of battles.","zh":"这支过度作战的军队在连续几周的战斗后几乎走不动了。"},{"en":"Their relationship felt overfought—too many arguments over small things.","zh":"他们的关系像是“过度争斗”了——为小事争吵太多。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, past tense / past participle of “overfight”) To have fought too much or too often.","zh":"（动词，overfight 的过去式/过去分词）过度战斗；打得太多、太久或太频繁。"},"examples":[{"en":"They overfought and ran out of energy before the final round.","zh":"他们打得太猛，最后一回合前就没力气了。"},{"en":"He had overfought in earlier matches, so his hands were shaking.","zh":"他在前面的比赛里打得过度，所以手一直在抖。"}]}],"synonyms":["overworked","worn out","battle-worn","exhausted","overstrained"],"phonetic":"/ˌoʊvərˈfɔt/","extraExplanation":["“overfought”不是日常高频词，更常见的表达是：overworked（过度劳累）、worn out（筋疲力尽）、battle-worn（久经沙场的）、exhausted from fighting（因战斗而精疲力竭）。","作为动词“overfight”的变形，整体也较少见；在体育语境里更常说：fight too much / waste energy early（前期耗费太多体力）。"]}
{"word":"overfoul","summary":{"en":"“Overfoul” is a rare verb, mainly nautical, meaning to cross over and entangle (foul) ropes, cables, or gear; it can also mean to foul too much.","zh":"overfoul 是较少见的动词，主要用于航海语境，指绳索/缆等越过并缠住（造成缠扰）；也可引申为“过度犯规/过度造成缠扰”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nautical, rare) To foul (entangle) by crossing over or lying over something, such as a rope, cable, anchor, or another vessel’s gear.","zh":"（航海用语，较少见）（绳索、缆、锚链等）越过并缠住/压住某物而造成“缠扰、纠结”。"},"examples":[{"en":"In the swell, the line overfouled the anchor chain and we had to clear it by hand.","zh":"在涌浪中，缆绳越过去把锚链缠住了，我们只好手动把它解开。"},{"en":"Be careful not to overfoul the mooring lines when you turn the boat.","zh":"转向时小心别让系泊缆彼此交叉缠扰。"}]},{"partOfSpeech":"v.","definition":{"en":"(By extension, very rare) To foul excessively or more than expected.","zh":"（引申义，极少见）犯规/弄脏得过多；过度造成“弄乱、碍事”的状态。"},"examples":[{"en":"The defender was warned for overfouling during the match.","zh":"那名后卫因在比赛中过度犯规而被警告。"}]}],"synonyms":["foul","entangle","snag","tangle up"],"phonetic":"ˌoʊvɚˈfaʊl","extraExplanation":["“overfoul”不是现代日常英语中的常用词，更常见的是航海语境里围绕“foul（缠住、缠绕、挂住）”的一组表达，例如：foul the line（把绳弄缠）、a fouled anchor（锚被缠住）。","如果你想表达“过度犯规”，更自然的说法通常是: commit too many fouls / foul too much / be overly physical。","如果你本来想写的是“overfull（太满的）”或“overfoul（把……弄得很脏/很乱）”这类意思，请告诉我你的句子，我可以帮你确认最合适的词。"]}
{"word":"overfoully","summary":{"en":"“Overfoully” means “in an excessively foul/dirty/offensive way,” but it is extremely rare and archaic.","zh":"“overfoully”表示“过于肮脏/恶臭/冒犯地”，但在现代英语中极其罕见、带古体色彩。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare/archaic) In an excessively foul way; too disgustingly, offensively, or dirty in manner or condition.","zh":"（极少见/古体）以过于肮脏、恶臭、冒犯或卑劣的方式；太“污/臭/不堪”地。"},"examples":[{"en":"The room was described as overfoully kept, with stale air and grime everywhere.","zh":"那房间被形容为打理得过于肮脏，空气污浊，处处是污垢。"},{"en":"He spoke overfoully about his rivals, using insults instead of arguments.","zh":"他用极其污言秽语来谈论对手，用辱骂代替论证。"}]}],"synonyms":["too foully","disgustingly","filthily","vilely","offensively"],"phonetic":"/ˌoʊvɚˈfaʊli/","extraExplanation":["“overfoully”几乎不见于现代英语，是非常罕见的构词：over-（过度）+ foul（肮脏/恶臭/卑劣）+ -ly（副词）。在当代写作里，更常用的表达是“too foully”“disgustingly”“filthily”“vilely”“offensively”等。","如果你是在文本里看到它，也可能是拼写/转写差异（例如想写“overfully”等）。若你愿意贴出原句，我可以帮你判断最自然的现代改写。"]}
{"word":"overfoulness","summary":{"en":"Overfoulness is a rare, nonstandard noun meaning excessive foulness (extreme dirtiness/stench/obscenity) or, in some technical contexts, excessive fouling buildup on a surface.","zh":"Overfoulness 是罕见且不太规范的名词，可指“过度的恶臭／污秽／粗鄙”，在少数技术语境中也可指“过度污损附着（结垢）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) The state or quality of being excessively foul—very dirty, rotten-smelling, obscene, or unpleasant.","zh":"（罕见／非标准用法）“过度恶臭／污秽／粗鄙”的状态或性质；指非常肮脏、腐臭、下流或令人不快的程度。"},"examples":[{"en":"The room’s overfoulness made everyone step back and open the windows.","zh":"房间里那种“过度的臭与脏”让大家都后退一步，把窗户打开。"},{"en":"Some readers felt the dialogue crossed into overfoulness rather than serving the story.","zh":"一些读者觉得这些对白太粗俗了，变成“过度下流”，反而不利于剧情。"}]},{"partOfSpeech":"n.","definition":{"en":"(Specialized, very rare) Excessive fouling, especially the heavy buildup of unwanted material on a surface (for example, on a ship’s hull).","zh":"（非常少见的专业用法）过度结垢／过度附着（污损）；尤指表面上不需要的附着物堆积过多（如船体生物附着）。"},"examples":[{"en":"Engineers warned that overfoulness on the hull could increase fuel use.","zh":"工程师警告说，船体“过度附着污损”会增加燃油消耗。"},{"en":"Regular cleaning helped prevent overfoulness in the seawater intake pipes.","zh":"定期清洁有助于防止海水进水管出现“过度结垢／污损”。"}]}],"synonyms":["foulness","filthiness","nastiness","stench","excessive fouling","heavy fouling"],"phonetic":"ˌoʊvərˈfaʊlnəs","extraExplanation":["“overfoulness”并不是常见或规范的英语词，更多像是临时造词（over- + foul + -ness）。在正式写作里，通常会改用更自然的表达，例如：\n- 如果你想说“太脏太臭”：filthiness, nastiness, stench, foulness。\n- 如果你想说“东西太满／胀满”：更可能是拼错了 overfullness（过度充满、胀满）。\n- 如果是船体/管道的“附着污损”：更常见说法是 heavy fouling 或 excessive fouling。"]}
{"word":"overfragile","summary":{"en":"Overfragile means “too fragile,” either physically easy to break or emotionally too easily hurt.","zh":"overfragile 表示“过于脆弱”，可指物品容易破损，也可指情绪上太容易受伤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too fragile or delicate; likely to break or be damaged too easily","zh":"过于脆弱的；太容易破损或受损的"},"examples":[{"en":"The packaging is overfragile for long-distance shipping.","zh":"这种包装对于长途运输来说太脆弱了。"},{"en":"Some people worry the device feels overfragile in daily use.","zh":"有些人担心这款设备在日常使用中显得过于脆弱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(about a person’s feelings or confidence) overly sensitive and easily hurt or shaken","zh":"（指人的情绪或自信）过于敏感、容易受伤或被动摇的"},"examples":[{"en":"After the criticism, he seemed overfragile and avoided speaking up.","zh":"受到批评后，他显得过于敏感，不太敢再发言。"},{"en":"She’s not weak—she’s just overfragile right now because of stress.","zh":"她并不软弱——只是压力之下暂时变得过于敏感。"}]}],"synonyms":["overly fragile","too fragile","excessively delicate","breakable","delicate"],"phonetic":"/ˌoʊvərˈfrædʒaɪl/","extraExplanation":["“overfragile”不是最常见的标准词，更常见的表达是“too fragile / overly fragile / excessively fragile”。它由前缀“over-”（表示“过度、太…”）+“fragile”（脆弱的）构成，因此含义一般能被母语者理解。","用于描述“物品”时比较自然；用于描述“人”时要注意语气，可能带有评价意味（暗示对方“太敏感/太脆弱”），更礼貌的说法可以用“very sensitive”或“emotionally delicate”。"]}
{"word":"overfragmented","summary":{"en":"Overfragmented describes something divided into too many small pieces, causing inefficiency or confusion.","zh":"Overfragmented 指某事被分割得过细、过多，导致低效或混乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Broken into too many small parts; divided more than is helpful, making something harder to manage, understand, or use.","zh":"过度碎片化的；被分割成太多小部分（反而不利于管理、理解或使用）。"},"examples":[{"en":"The app feels overfragmented, with too many tiny menus and separate settings screens.","zh":"这个应用感觉过度碎片化，菜单太零散，设置页面也被拆得太多。"},{"en":"Our schedule is overfragmented, so we never have enough uninterrupted time to focus.","zh":"我们的日程过度碎片化，所以我们总是缺少不被打断的专注时间。"},{"en":"The research field became overfragmented, and scholars stopped talking across subfields.","zh":"这个研究领域变得过度碎片化，学者们不再跨子领域交流。"}]}],"synonyms":["overly fragmented","too fragmented","splintered","piecemeal","scattered"],"phonetic":"/ˌoʊvɚˈfræɡmən.tɪd/","extraExplanation":["“over-”表示“过度”，“fragment”是“碎片/使碎片化”。因此 overfragmented 常用来批评一种“被拆得太细”的状态，语气通常偏负面。","常见搭配：overfragmented market（过度分散的市场）、overfragmented system（过度碎片化的系统）、overfragmented attention/time（注意力/时间碎片化得太严重）。"]}
{"word":"overfrail","summary":{"en":"“Overfrail” means excessively frail or fragile (rare in modern English).","zh":"“overfrail”指“过于脆弱/虚弱”（现代英语中较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too frail, delicate, or physically/mentally weak; excessively fragile.","zh":"过于脆弱的；过分纤弱的（身体或精神上都可指）。"},"examples":[{"en":"After the long illness, he looked overfrail and needed time to recover.","zh":"久病之后，他看起来过于虚弱，需要时间恢复。"},{"en":"The plan depended on an overfrail hope that everything would go perfectly.","zh":"这个计划建立在一种过分脆弱的希望之上——指望一切都完美无误。"}]}],"synonyms":["too frail","overly frail","delicate","fragile","breakable"],"phonetic":"/ˌoʊvɚˈfreɪl/","extraExplanation":["“over-”作前缀常表示“过度、太……”，因此 overfrail 字面意思就是“太脆弱”。这个词在现代英语中非常少见，更多时候人们会用 more common 的表达，比如 “too frail / overly frail / extremely frail”。","在文学或较古风的语境里，overfrail 有时带一点修辞色彩，用来强调“脆弱到不堪一击”的感觉。"]}
{"word":"overfrailly","summary":{"en":"“Overfrailly” means “too frailly; in an excessively fragile/weak way,” but it’s rare and nonstandard.","zh":"“overfrailly”意为“过于虚弱/脆弱地”，但用法少见且不太标准。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively frail or delicate way; too weak, thin, or fragile (rare/nonstandard).","zh":"以过于虚弱、纤弱或脆弱的方式；太过脆弱（少见/非标准用法）。"},"examples":[{"en":"He looked overfrailly dressed for the cold weather.","zh":"他穿得过于单薄，看起来不适合这种寒冷天气。"},{"en":"The character is described as walking overfrailly, as if any wind could knock her over.","zh":"这个角色被描写为走路过于虚弱，仿佛一阵风就能把她吹倒。"}]}],"synonyms":["too frailly","overly delicately","excessively weakly","in an overly frail way"],"phonetic":"ˌoʊvərˈfreɪli","extraExplanation":["“overfrailly”在现代英语里非常少见，通常不被视为常用或标准拼写。更自然的表达一般是：too frailly（太虚弱地）、in an overly frail way（以过分脆弱的方式）、或者直接用overly frail（过于脆弱的）来改写句子。","构词上看，它像是把前缀over-（“过度”）加到副词frailly上形成的临时造词（nonce word），在文学描写或个人写作中偶尔会出现，用来强化“过分脆弱”的语气。"]}
{"word":"overfrailness","summary":{"en":"“Overfrailness” means excessive frailty—being too weak or delicate.","zh":"“overfrailness”指“过度脆弱/过分虚弱”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too frail or delicate; excessive weakness (in body, health, or sometimes character/emotions)","zh":"过度脆弱；过分虚弱（指身体、健康，有时也指性格或情绪上的软弱）"},"examples":[{"en":"The doctor worried that her overfrailness made even minor infections dangerous.","zh":"医生担心她的过度虚弱会让哪怕轻微的感染也变得危险。"},{"en":"In the story, the heroine’s overfrailness is used to show how little protection she has in society.","zh":"在故事里，女主角的过度脆弱用来表现她在社会中几乎没有保护。"}]}],"synonyms":["excessive frailty","extreme frailty","delicacy","weakness"],"phonetic":"/ˌoʊvərˈfreɪlnəs/","extraExplanation":["“overfrailness”不是常见词，更常见的表达是“excessive frailty / extreme frailty / being too frail”。如果你在写作中使用它，会显得比较“自造词/文学化”，读者可能需要根据词形猜意思。","构词法：over-（“过度”）+ frail（“虚弱的/脆弱的”）+ -ness（把形容词变成名词，表示“……的状态”）。"]}
{"word":"overfrailty","summary":{"en":"Overfrailty means excessive frailty—being unusually weak or delicate.","zh":"overfrailty 指“过度虚弱/过度脆弱”，强调虚弱程度超出正常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive frailty; an unusually weak or delicate condition (physical or emotional).","zh":"过度虚弱；异常脆弱（身体上或心理上）。"},"examples":[{"en":"The doctor warned that his overfrailty made even minor infections risky.","zh":"医生警告说，他的过度虚弱会让哪怕是小感染也变得危险。"},{"en":"She hid her overfrailty behind a confident smile at work.","zh":"她在工作中用自信的微笑掩饰自己的过度脆弱。"}]}],"synonyms":["extreme frailty","severe frailty","excessive weakness","fragility"],"phonetic":"/ˌoʊvɚˈfreɪlti/","extraExplanation":["“overfrailty”并不是常见词，更常见的表达是“extreme frailty / severe frailty（极度虚弱）”或“excessive fragility（过度脆弱）”。它由前缀 over-（过度）+ frailty（虚弱、脆弱）构成，带有强调“超出正常程度”的语气，常用于描述健康状况或性格/情绪上的脆弱。"]}
{"word":"overfranchised","summary":{"en":"Overfranchised describes a brand that has opened too many franchises in one area, causing stores to compete and profits to shrink.","zh":"Overfranchised 指某品牌在某地加盟店开得过多，导致门店互相竞争、单店利润被稀释。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a business or brand) having too many franchises or franchise locations in one area, so that sales and profits are spread too thin and stores compete with each other.","zh":"（指企业或品牌）在某一地区加盟店/特许经营店数量过多，导致市场被“过度分割”，门店相互抢生意、利润被稀释。"},"examples":[{"en":"The coffee chain became overfranchised in the suburbs, and each store’s sales dropped.","zh":"这家咖啡连锁在郊区开了太多加盟店，结果每家店的销量都下降了。"},{"en":"An overfranchised market can cause franchisees to complain about territory overlap.","zh":"市场过度加盟时，加盟商常会抱怨经营区域重叠。"},{"en":"The company paused new licenses because the region was already overfranchised.","zh":"由于该地区已经过度加盟，公司暂停发放新的加盟许可。"}]}],"synonyms":["oversaturated","overexpanded","overextended","too densely franchised","overbuilt"],"phonetic":"/ˌoʊvərˈfræn(t)ʃaɪzd/","extraExplanation":["“over-”表示“过度/太多”，“franchise”是“特许经营/加盟”。所以 overfranchised 常见于商业新闻、投资分析或公司内部报告，用来描述“门店密度过高、同品牌互相蚕食（cannibalize sales）”的情况。","它通常带有负面含义：门店太密会让单店营收下降、加盟商关系紧张，甚至影响品牌形象与服务质量。"]}
{"word":"overfrank","summary":{"en":"Overfrank means too direct or blunt, often in a way that can offend or feel awkward.","zh":"overfrank 指“过于直白/过于坦率”，常带有可能冒犯或让人尴尬的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too frank or too direct, in a way that may seem rude, insensitive, or socially awkward","zh":"过于坦率的；过于直白的（可能显得无礼、不体贴或不合时宜）"},"examples":[{"en":"He was overfrank about her mistakes, and she felt embarrassed.","zh":"他对她的错误过于直白，让她觉得很难堪。"},{"en":"I appreciate honesty, but that comment sounded overfrank for a first meeting.","zh":"我欣赏诚实，但第一次见面说那样的话显得过于直率。"},{"en":"Try not to be overfrank in emails; tone is easy to misread.","zh":"发邮件时尽量别过于直白；语气很容易被误解。"}]}],"synonyms":["too blunt","overly candid","tactless","undiplomatic"],"phonetic":"/ˌoʊvɚˈfræŋk/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overfrank 就是“frank（坦率的）过头了”。在英语社交语境中，直接不等于失礼；是否“overfrank”往往取决于关系亲疏、场合正式程度、以及是否兼顾对方感受。"]}
{"word":"overfrankly","summary":{"en":"“Overfrankly” means speaking too frankly—overly direct in a way that may seem rude or unhelpful.","zh":"“overfrankly”指“过于直率地”，直白到可能显得不礼貌或不合时宜。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too frank; more direct or honest than is polite or helpful.","zh":"过于直率地；直白得有点不礼貌或不合时宜地。"},"examples":[{"en":"He spoke overfrankly about her mistakes in front of the whole team.","zh":"他在全体团队面前过于直率地指出她的错误。"},{"en":"I was overfrankly critical, and I regret the tone I used.","zh":"我批评得太直白了，我后悔自己的语气。"},{"en":"The review was overfrankly negative and didn’t offer any solutions.","zh":"那篇评论负面得过于直白，却没有提出任何解决办法。"}]}],"synonyms":["too frankly","overly frankly","bluntly","overly bluntly","a bit too honestly"],"phonetic":"/ˌoʊvɚˈfræŋkli/","extraExplanation":["“over-”这个前缀常表示“过度、超过合适的程度”（如 overreact 反应过度、overconfident 过度自信）。因此 overfrankly 带有“直率过头”的语气，暗示说话方式可能伤人或不够得体。","在英语文化里，“being frank”通常是优点，但也强调场合与方式：更委婉的替代表达有 “to be honest,” “with respect,” “if you don’t mind me saying,” 或用 “I think…” 来软化语气。"]}
{"word":"overfrankness","summary":{"en":"Overfrankness means being overly direct or honest in a way that may offend or hurt people.","zh":"overfrankness 指“过于直率或坦白”，可能会冒犯或伤害他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too direct or too honest in a way that can feel rude, awkward, or hurtful","zh":"过于直率（或过于坦白）：直接到让人觉得粗鲁、尴尬或受伤的程度"},"examples":[{"en":"Her overfrankness in meetings sometimes embarrassed her coworkers.","zh":"她在会议中过于直率，有时会让同事感到尴尬。"},{"en":"He meant to be helpful, but his overfrankness sounded like criticism.","zh":"他本想帮忙，但过于坦白听起来像在批评。"},{"en":"In some cultures, overfrankness can be seen as disrespectful, even if you are telling the truth.","zh":"在某些文化中，即使你说的是事实，过于直率也可能被视为不尊重。"}]}],"synonyms":["bluntness","brutal honesty","tactlessness","overdirectness"],"phonetic":"ˌoʊvɚˈfræŋknəs","extraExplanation":["“over-”表示“过度、太……”，所以 overfrankness 强调“诚实/直率过头了”。它通常带负面评价，暗示缺少委婉（tact）或考虑对方感受。","日常更常见的说法包括：too blunt（太直）、brutal honesty（残酷的诚实）、lack of tact（不够圆融）。"]}
{"word":"overfraught","summary":{"en":"Overfraught means excessively stressed or burdened, often in a literary or formal tone.","zh":"overfraught 指“过度焦虑或负担过重”，多见于较书面或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively worried, tense, or emotionally burdened; overwhelmed with stress.","zh":"过度焦虑的；紧张不安的；情绪负担过重的。"},"examples":[{"en":"She sounded overfraught after a week of deadlines and family problems.","zh":"在经历了一周的截止期限和家庭问题后，她听起来非常焦虑不安。"},{"en":"Try to rest if you’re feeling overfraught—your body needs time to recover.","zh":"如果你感到压力过大、心力交瘁，就尽量休息一下——你的身体需要时间恢复。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overloaded or overfilled (with duties, details, or demands); too heavily burdened.","zh":"负担过重的；（任务、细节或要求）过多而不堪重负的。"},"examples":[{"en":"The plan is overfraught with small rules that confuse new staff.","zh":"这个计划塞进了太多细则，让新员工很困惑。"},{"en":"His schedule became overfraught once he took on a second job.","zh":"他做了第二份工作后，日程就变得负担过重了。"}]}],"synonyms":["overwhelmed","stressed","anxious","overburdened","strained","harried"],"phonetic":"/ˌoʊvɚˈfrɔt/","extraExplanation":["“overfraught”比较少见，带有偏书面/文学色彩；日常英语里更常用 overwhelmed, stressed, anxious, overburdened。","词源上可理解为 over-（过度）+ fraught（充满……的；令人紧张的）。不过注意：现代英语里“fraught”更常与 with 连用（fraught with danger/problems）。"]}
{"word":"overfree","summary":{"en":"“Overfree” means overly familiar or too casual in a way that may seem disrespectful.","zh":"“overfree”指过分熟络或太随便，以至于显得不够尊重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too familiar, casual, or uninhibited in a way that can seem disrespectful or improper (often about speech or behavior).","zh":"过于随便／过分熟络；放肆的（常指言行让人觉得不够尊重或不合适）。"},"examples":[{"en":"He was a bit overfree with the boss, joking like they were close friends.","zh":"他对老板有点太随便了，开玩笑像他们是很熟的朋友一样。"},{"en":"Don’t be overfree with strangers; keep it polite until you know them well.","zh":"别对陌生人太熟络；在真正熟悉之前先保持礼貌。"}]}],"synonyms":["overfamiliar","too familiar","overly casual","forward"],"phonetic":"/ˌoʊvɚˈfriː/","extraExplanation":["“Overfree”由 over-（过度）+ free（随意、不拘束）组成，语气多为批评，表示“太不拘礼、太放开”。在现代英语中不算常用，更常见的表达是 “overfamiliar / too familiar / overly casual”。在不同文化语境里，对“是否得体”的判断差异很大：在强调等级或边界感的场合，更容易被认为 overfree。"]}
{"word":"overfreedom","summary":{"en":"“Overfreedom” means too much or unchecked freedom that can cause problems.","zh":"“overfreedom”指过度或缺乏约束的自由，可能带来负面后果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or poorly regulated freedom, especially when too much freedom leads to harm, disorder, or irresponsible behavior.","zh":"过度的自由；（尤指）缺乏约束的自由，因自由过多而导致混乱、伤害或不负责任的行为。"},"examples":[{"en":"Some people worry that overfreedom online can spread misinformation quickly.","zh":"有些人担心网络上的过度自由会让错误信息迅速传播。"},{"en":"The teacher tried to balance creativity with rules so the class wouldn’t slip into overfreedom.","zh":"老师试着在创造力和规则之间取得平衡，避免课堂陷入过度自由。"},{"en":"In political debates, the word “overfreedom” is sometimes used to argue for reasonable limits.","zh":"在政治辩论中，“overfreedom”有时被用来主张设定合理的限制。"}]}],"synonyms":["excessive freedom","unchecked freedom","too much freedom","license","permissiveness"],"phonetic":"/ˌoʊvɚˈfriːdəm/","extraExplanation":["“overfreedom”不是特别常见的标准词，更常见的表达是“too much freedom / excessive freedom / unchecked freedom（不受约束的自由）”。它常带有批评色彩，用来强调“自由需要责任与规则”的观点。","构词上是 over-（过度）+ freedom（自由）。在新闻评论、社论或观点文章中偶尔会出现，用于强调“自由过了头”的社会或道德担忧。"]}
{"word":"overfreely","summary":{"en":"“Overfreely” means doing or saying something too freely, with insufficient restraint.","zh":"“overfreely”指“过于随意/过分自由地做或说某事”，含“缺乏克制、超出分寸”的意思。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too free, too open, or without enough restraint (e.g., speaking, spending, or acting more freely than is appropriate).","zh":"过于随意地；过分坦率/放纵地（指说话、花钱或行为缺乏必要的克制）。"},"examples":[{"en":"He spoke overfreely about company plans, and it caused trouble.","zh":"他过于随意地谈论公司的计划，结果惹出了麻烦。"},{"en":"She spent overfreely during the holiday season and later regretted it.","zh":"她在假期季花钱太随意（太大手大脚），后来很后悔。"},{"en":"I may have judged you overfreely without knowing the full story.","zh":"我可能在不了解全部情况时就过于草率地评判了你。"}]}],"synonyms":["too freely","too openly","without restraint","indiscreetly","recklessly"],"phonetic":"/ˌoʊvərˈfriːli/","extraExplanation":["“overfreely”不算常用词，更常见、更自然的表达是“too freely / too openly / too generously（视语境而定）”。","构词上是 over-（过度）+ freely（自由地），语气通常带有“超过合适界限”的批评或自我反省。"]}
{"word":"overfreight","summary":{"en":"Overfreight means to overload with cargo (and less commonly, to charge excessive freight fees).","zh":"Overfreight 指装载过多货物导致超载（较少见也可指运费收取过高）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to load a ship, vehicle, or container with too much cargo; to overload with freight","zh":"（给船/车辆/集装箱）装载过多货物；超载"},"examples":[{"en":"The truck was overfreighted and couldn’t safely climb the mountain road.","zh":"这辆卡车超载了，无法安全驶上山路。"},{"en":"If a vessel is overfreighted, it may sit too low in the water and become dangerous.","zh":"如果船只装载过多，吃水会过深，可能会很危险。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to charge too much for shipping or freight; to overcharge freight fees","zh":"（较少见）收取过高的运费；运费超收"},"examples":[{"en":"The supplier was accused of overfreighting customers on international orders.","zh":"该供应商被指控对国际订单向客户收取过高运费。"},{"en":"Always compare quotes to avoid being overfreighted on large shipments.","zh":"大批量发货时要多比价，避免被收取过高运费。"}]}],"synonyms":["overload","overburden","overcharge (for freight)","charge excessive freight"],"phonetic":"/ˌoʊvɚˈfreɪt/","extraExplanation":["“over-”表示“过度/过多”，与“freight（货运/货物）”组合后，常见含义是“装载过多而导致超载”。在现代物流语境中，更常用的表达是“overload”或“overcharge for freight”，因此“overfreight”在当代日常英语里相对少见，更可能出现在航运/货运相关的正式或旧一些的文本中。"]}
{"word":"overfreighted","summary":{"en":"Overfreighted means either carrying too much cargo (overloaded) or being charged too much for freight.","zh":"overfreighted 指“装货过多（超载）”，也可指“运费被多收/收费过高”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loaded with too much freight (cargo); carrying more than is suitable or allowed.","zh":"（船、车等）装货过多的；超载的。"},"examples":[{"en":"The truck was overfreighted and struggled to climb the hill.","zh":"这辆卡车超载，上坡时很吃力。"},{"en":"An overfreighted boat sits lower in the water and becomes more dangerous.","zh":"超载的船在水里吃得更深，更危险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Charged an excessive freight rate; made to pay too much for shipping.","zh":"（运费）被收取过高的；运费被多收的。"},"examples":[{"en":"Small exporters sometimes feel overfreighted when they don’t know the usual rates.","zh":"小型出口商不了解市场行情时，有时会觉得运费被多收了。"},{"en":"They complained that the goods had been overfreighted on the invoice.","zh":"他们抱怨发票上运费被多收了。"}]}],"synonyms":["overloaded","overburdened","overshipped","overcharged"],"phonetic":"ˌoʊvərˈfreɪtɪd","extraExplanation":["“overfreighted”多见于较正式或专业语境（航运、物流、保险、法律文件）。日常英语里更常说“overloaded”（超载）或“overcharged for shipping”（运费被多收）。"]}
{"word":"overfrequency","summary":{"en":"“Overfrequency” means something happens too often (excessive frequency), sometimes used in technical/data contexts for higher-than-expected occurrence.","zh":"“Overfrequency”表示某事发生得过于频繁（频率过高）；在技术/数据语境中也可指某事件出现次数高于预期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of happening or appearing too often; excessive frequency","zh":"发生或出现得过于频繁；过高的频率"},"examples":[{"en":"The overfrequency of ads made the app feel spammy.","zh":"广告出现得过于频繁，让这个应用显得很像垃圾信息。"},{"en":"Teachers noticed an overfrequency of the word “very” in the students’ essays.","zh":"老师注意到学生作文里“very”这个词使用过于频繁。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) a higher-than-expected frequency of an event in data, compared with a baseline or average","zh":"（技术/数据）某事件在数据中出现频率高于预期（相对基线或平均值）"},"examples":[{"en":"The report flags the overfrequency of billing errors in one department.","zh":"报告指出某个部门的账单错误出现频率高于预期。"},{"en":"We tested whether the overfrequency was statistically meaningful or just random noise.","zh":"我们检验这种“过高频率”在统计上是否有意义，还是只是随机波动。"}]}],"synonyms":["excessive frequency","too-frequent occurrence","overuse","high occurrence rate"],"phonetic":"/ˌoʊvɚˈfrikwənsi/","extraExplanation":["“overfrequency”不是非常常见的日常词，更常见的表达是“excessive frequency / too frequent / overuse”。在写作中，如果你想更自然，可以说：“The ads appear too frequently.” 或 “There is an excessive frequency of ads.”","在不同领域含义会更具体：在写作/语言学习里常指某个词或结构“用太多”；在数据分析里常指某类事件“高于正常水平”。"]}
{"word":"overfrequent","summary":{"en":"“Overfrequent” means happening too often or more often than desirable.","zh":"“overfrequent”表示“过于频繁、频率过高”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening too often; more frequent than is normal, expected, or desirable.","zh":"发生得过于频繁；比正常、预期或理想情况更频繁。"},"examples":[{"en":"Overfrequent alerts can make people ignore important warnings.","zh":"过于频繁的警报会让人们忽视重要的警告。"},{"en":"The doctor noted her overfrequent use of painkillers.","zh":"医生注意到她止痛药使用过于频繁。"}]}],"synonyms":["too frequent","excessively frequent","overly frequent","unduly frequent","recurrent"],"phonetic":"/ˌoʊvɚˈfriːkwənt/","extraExplanation":["“overfrequent”不算非常常见，但在学术写作、医学记录、统计/数据分析等较正式语境中会出现，用来强调“频率过高”这一问题。","口语里更常用的表达有：“too frequent / happening too often / excessive frequency”。"]}
{"word":"overfrequently","summary":{"en":"“Overfrequently” means “too often.”","zh":"“overfrequently”意思是“过于频繁地；太常”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too often; more often than is desirable or necessary.","zh":"过于频繁地；太常地（超过理想或需要的频率）。"},"examples":[{"en":"He checks his phone overfrequently during meetings.","zh":"他在开会时过于频繁地查看手机。"},{"en":"If you water the plant overfrequently, the roots may rot.","zh":"如果你给植物浇水过于频繁，根部可能会腐烂。"}]}],"synonyms":["too often","too frequently","all too often","excessively often"],"phonetic":"/ˌoʊvɚˈfriːkwəntli/","extraExplanation":["“overfrequently”由 over-（过度）+ frequently（频繁地）构成，但在日常英语中不算常用。更自然的表达通常是 “too often / too frequently / all too often”。","语气上，它带有“过头了、不合适”的评价色彩，常用于建议、批评或描述不良习惯。"]}
{"word":"overfret","summary":{"en":"Overfret means to worry or fret too much.","zh":"overfret 指“过度担心/过分焦虑”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to worry or be anxious too much; to fret excessively","zh":"过度担心；过分焦虑；过度烦恼"},"examples":[{"en":"Don’t overfret about the interview—just prepare and get a good night’s sleep.","zh":"别为面试过度担心——好好准备，再睡个好觉就行。"},{"en":"She tends to overfret when plans change at the last minute.","zh":"计划临时变化时，她往往会过分焦虑。"}]},{"partOfSpeech":"vt.","definition":{"en":"to worry too much (about something specific)","zh":"（对某事）过度担心"},"examples":[{"en":"He overfretted the smallest mistake, even though nobody else noticed.","zh":"他对一个小错误过度纠结，尽管别人都没注意到。"},{"en":"Try not to overfret every detail of the report; focus on the main message.","zh":"别对报告的每个细节都过度担心；把重点放在核心信息上。"}]}],"synonyms":["worry excessively","fret too much","stress","agonize","obsess"],"phonetic":"/ˌoʊvɚˈfrɛt/","extraExplanation":["“overfret”= over-（过度）+ fret（烦恼、焦虑）。它比常见的“worry too much / fret too much”更少用，语气略显书面或强调“过度”的程度。","相关用法：fret about（为……烦恼）；overthink（想太多，偏“思虑过度”）；stress out（压力大到崩溃，偏口语）。"]}
{"word":"overfrieze","summary":{"en":"An architectural decorative band or molding located above a frieze.","zh":"建筑中位于檐壁之上的装饰带或线脚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture) A decorative band or molding placed above a frieze, often acting as an additional ornamental strip between the frieze and the cornice (or at the top of a wall).","zh":"（建筑）位于檐壁（frieze）之上的装饰带或线脚，常作为介于檐壁与檐口（cornice）之间（或墙顶处）的附加装饰条带。"},"examples":[{"en":"The facade has an overfrieze carved with repeating leaf patterns above the main frieze.","zh":"这座立面的主檐壁上方还有一道刻着重复叶纹的上檐壁装饰带。"},{"en":"In the restoration, the overfrieze was repaired to match the original stonework.","zh":"在修复工程中，上檐壁装饰带被修补得与原有石作一致。"}]}],"synonyms":["upper frieze","molding","ornamental band","stringcourse"],"phonetic":"/ˌoʊvɚˈfriːz/","extraExplanation":["“over-”在这里表示“在……之上”，所以 overfrieze 字面意思就是“在 frieze（檐壁/饰带）上方的部分”。它不是日常英语词汇，更多出现在建筑史、古典建筑构件说明或修复报告中。","相关构件小提示：古典“檐部”（entablature）常见三段：architrave（额枋/楣梁）→ frieze（檐壁）→ cornice（檐口）。overfrieze 往往指 frieze 上方额外加的一道装饰线脚或带状构件，位置接近 cornice 下缘。"]}
{"word":"overfrighted","summary":{"en":"“Overfrighted” is a rare/nonstandard form meaning “extremely frightened.” In modern English, “overfrightened” or “terrified” is more common.","zh":"“overfrighted”是罕见/不规范形式，意思是“被吓得很厉害”。现代英语更常用“overfrightened”或“terrified”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Extremely frightened; overly scared. In modern English, people usually say “overfrightened” or “terrified.”","zh":"（不规范/罕见）极度害怕的；被吓过头的。现代英语更常说“overfrightened”或“terrified”。"},"examples":[{"en":"She was so overfrightened that she couldn’t speak for a moment.","zh":"她被吓得过头，一时说不出话来。"},{"en":"The child looked overfrightened by the sudden noise.","zh":"孩子被突然的响声吓得很厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare) Past form of a rarely used verb “overfright,” meaning to frighten someone too much.","zh":"（非常罕见）作为罕见动词“overfright”的过去式/过去分词，表示“把某人吓得太厉害”。"},"examples":[{"en":"The harsh prank overfrighted him and he refused to return.","zh":"那个恶劣的恶作剧把他吓得太厉害，他拒绝再回来。"}]}],"synonyms":["overfrightened","terrified","scared","frightened","panicked"],"phonetic":"/ˌoʊvɚˈfraɪtɪd/","extraExplanation":["“overfrighted”在当代英语里几乎看不到，更多时候是拼写错误或非标准用法。更自然的表达包括：overfrightened（被吓过度的）、terrified（极度害怕的）、scared to death（吓死了，口语夸张）。","构词提示：前缀 over- 常表示“过度/太……”，例如 overwork（过度工作）、overreact（反应过度）。因此 overfrightened 更符合现代英语的习惯。"]}
{"word":"overfrighten","summary":{"en":"Overfrighten means to scare someone excessively.","zh":"Overfrighten 指“过度惊吓/过分吓唬某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to frighten someone too much; to scare someone more than is reasonable or helpful","zh":"过度惊吓；把某人吓得太厉害（超过合理或有益的程度）"},"examples":[{"en":"Don’t overfrighten the child with scary stories before bed.","zh":"睡前别用恐怖故事把孩子吓得太厉害。"},{"en":"The warning was meant to keep people safe, not to overfrighten them.","zh":"这个警告是为了让大家更安全，不是为了过度吓唬人。"}]}],"synonyms":["scare too much","frighten excessively","terrify","alarm unduly"],"phonetic":"/ˌoʊvɚˈfraɪtən/","extraExplanation":["“over-”这个前缀常表示“过度、过分”（too much），所以 overfrighten = frighten（吓到）+ over-（过度）。类似结构还有 overwork（过度工作）、overreact（反应过度）。","这个词在现代英语里不算常见；更常见的表达是 “frighten/scare someone too much” 或 “terrify someone unnecessarily”。"]}
{"word":"overfroth","summary":{"en":"Overfroth means to make or become too foamy.","zh":"overfroth 指（使）泡沫过多、打泡过度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to froth (produce foam) too much; to make something overly foamy","zh":"（使）起泡过多；（使）泡沫过于丰富"},"examples":[{"en":"If you overfroth the milk, the foam becomes too stiff and dry.","zh":"如果你把牛奶打发得过头，泡沫会变得太硬、太干。"},{"en":"The soap can overfroth in hot water, making it hard to rinse.","zh":"肥皂在热水里可能会起泡过多，导致不容易冲洗干净。"}]}],"synonyms":["overfoam","froth too much","foam up","lather too much"],"phonetic":"/ˌoʊvɚˈfrɔθ/","extraExplanation":["“Overfroth”不是特别常见的独立词，更常见的表达是“froth too much / over-foam”。在咖啡语境里，它多用于描述牛奶打泡过度，口感会变粗、泡沫不细腻。"]}
{"word":"overfrown","summary":{"en":"Overfrown means to frown excessively, giving an overly disapproving or worried look.","zh":"Overfrown 指“过度皱眉”，让人看起来过分不悦或担心。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to frown too much or too intensely; to look overly disapproving or worried","zh":"过度皱眉；皱眉太多或太用力；显得过分不悦或担忧"},"examples":[{"en":"He tends to overfrown in meetings, so people think he’s angry even when he’s just concentrating.","zh":"他在会议上总是过度皱眉，所以别人以为他在生气，其实他只是很专注。"},{"en":"Try not to overfrown—your face will look tense in the photo.","zh":"别过度皱眉——照片里你的表情会显得很紧绷。"}]}],"synonyms":["frown excessively","scowl too much","glower"],"phonetic":"/ˌoʊvɚˈfraʊn/","extraExplanation":["“overfrown”不是很常见的标准词汇，更常见的表达是“frown too much / frown excessively”。它有时会被当作口语或写作中的创造性用法，用来强调“皱眉过头”。","构词上是“over-（过度）+ frown（皱眉）”，类似的还有“overthink（想太多）”“overreact（反应过度）”。"]}
{"word":"overfrozen","summary":{"en":"“Overfrozen” means frozen too much or so hard that quality or usability suffers.","zh":"“overfrozen”指“过度冷冻/冻得太久或太硬”，常暗示品质或使用体验变差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Frozen too much or for too long, often causing poorer quality (e.g., dryness, freezer burn, loss of texture).","zh":"过度冷冻的；冻得太久的（常导致品质变差，如变干、产生“冷冻灼伤”、口感变差）。"},"examples":[{"en":"The berries tasted overfrozen and a little dry.","zh":"这些莓果冻得太久，吃起来有点干。"},{"en":"If the fish is overfrozen, it can lose its soft texture after thawing.","zh":"鱼如果过度冷冻，解冻后可能会失去柔软的口感。"},{"en":"This ice cream is overfrozen—let it sit for a minute before scooping.","zh":"这冰淇淋冻得太硬了——舀之前先放一分钟。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Frozen so hard that it becomes difficult to use or handle.","zh":"（非正式）冻得特别硬，以至于难以使用或处理。"},"examples":[{"en":"The butter is overfrozen, so I can’t spread it.","zh":"黄油冻得太硬了，我抹不开。"},{"en":"My car door felt overfrozen after the storm.","zh":"暴风雪后，我车门像是被冻死了一样很难打开。"}]}],"synonyms":["freezer-burned","frozen solid","overchilled","kept frozen too long"],"phonetic":"/ˌoʊvərˈfroʊzən/","extraExplanation":["“overfrozen”由 over-（过度）+ frozen（冷冻的）构成，属于比较口语/描述性的用法，常见于厨房、冷冻保存、食物口感讨论等语境。","写法上有时也会见到“over-frozen”（加连字符）作为形容词用在名词前：over-frozen meat（冻过头的肉）。","它强调“冻过头带来负面影响”，不同于单纯的“frozen（冷冻的）”。如果想更常见、更自然，也可用“freezer-burned（被冻伤的）”“frozen solid（冻得梆硬）”“kept frozen too long（冷冻太久）”。"]}
{"word":"overfrugal","summary":{"en":"Overfrugal means being excessively frugal—saving money so much that it causes problems or seems ungenerous.","zh":"overfrugal 指“过分节俭”，省钱省到造成问题或显得不够大方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too frugal; saving money so much that it becomes excessive, inconvenient, or ungenerous","zh":"过分节俭的；省钱省到过头，以至于不方便或显得吝啬"},"examples":[{"en":"He’s so overfrugal that he won’t replace a broken phone charger.","zh":"他节俭过头了，连坏掉的手机充电器都不肯换。"},{"en":"Being overfrugal can hurt your health if you cut corners on food and rest.","zh":"如果在饮食和休息上也一味省钱，过分节俭可能会伤害健康。"},{"en":"The company’s overfrugal budget left no money for basic safety training.","zh":"公司过分节俭的预算连基本的安全培训都没钱安排。"}]}],"synonyms":["overly frugal","too frugal","excessively frugal","stingy","miserly"],"phonetic":"/ˌoʊvɚˈfruːɡəl/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、过分”。所以 overfrugal 直译就是“frugal（节俭的）过了头”。","这个词在日常英语里不算特别常用，更常见的说法是 “too frugal / overly frugal”，或用带评价色彩的词如 “stingy（吝啬的）”。overfrugal 往往强调“省钱成了问题”，不一定是在道德上批评对方。"]}
{"word":"overfrugality","summary":{"en":"Overfrugality means being too frugal—saving money in a way that causes problems.","zh":"overfrugality 指“节俭过头”，省钱省到带来不便或负面影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit of being too frugal—saving or avoiding spending so much that it causes inconvenience, poor quality, or other negative results","zh":"过度节俭；省得过头——为了省钱而过分避免花费，导致不便、质量下降或其他负面结果"},"examples":[{"en":"Overfrugality can make daily life harder, like refusing to replace a broken heater in winter.","zh":"过度节俭会让日常生活更难，比如冬天暖气坏了也拒绝更换。"},{"en":"Her overfrugality saved money, but it also damaged relationships when she never joined group meals.","zh":"她的过度节俭确实省了钱，但她从不参加集体聚餐，也影响了人际关系。"},{"en":"A little budgeting is healthy; overfrugality can become a kind of self-punishment.","zh":"适度做预算很健康；但过度节俭可能变成一种“自我惩罚”。"}]}],"synonyms":["extreme frugality","being too frugal","penny-pinching","miserliness","stinginess"],"phonetic":"/ˌoʊvɚˈfruːɡəˌlæti/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超过合理程度”（如 overwork 过劳、overthink 想太多）。因此 overfrugality 带有明显的负面评价：不是“会过日子”，而是“省过头”。","这个词在日常口语中不算常见，更常见的说法是“being too frugal / extreme frugality / penny-pinching”。其中 penny-pinching 语气更尖刻，暗示小气、斤斤计较。","语境上常用于讨论生活方式与心理：比如对金钱的焦虑、童年贫困经历、或把“节省”当作道德优越感，从而忽视健康、时间成本或人际需要。"]}
{"word":"overfrugally","summary":{"en":"“Overfrugally” means “too frugally,” suggesting excessive thrift that may be unreasonable.","zh":"overfrugally 意为“过度节俭地”，强调节省到不太合理的程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too frugal; excessively unwilling to spend money or use resources, often to an unreasonable degree.","zh":"过度节俭地；过分吝于花钱或使用资源（常带有“不太合理/太抠”的意味）。"},"examples":[{"en":"He lived overfrugally, skipping basic medical checkups to save money.","zh":"他过度节俭，甚至为了省钱而不做基本的体检。"},{"en":"Buying the cheapest option every time can be overfrugally and cost more later.","zh":"每次都买最便宜的选项可能是过度节俭，反而以后花得更多。"},{"en":"She wasn’t just careful—she budgeted overfrugally and never replaced worn-out shoes.","zh":"她不只是谨慎——她节省得过头，鞋子磨坏了也从不更换。"}]}],"synonyms":["too frugally","overly frugally","excessively frugally","overly thriftily"],"phonetic":"/ˌoʊvərˈfruːɡəli/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”。所以 overfrugally 往往带一点负面评价：不是“节俭（frugally）”，而是“节俭过头”。","日常英语里这个词不算特别常见，更常见的表达有：too frugally / overly frugal / excessively frugal。写作中用 overfrugally 可以更简洁、更强调“过度”。"]}
{"word":"overfruited","summary":{"en":"Overfruited means made with an unusually large amount of fruit, especially describing certain craft beers and drinks.","zh":"Overfruited 指（尤指精酿啤酒/饮品）加入异常大量水果制成，果味非常浓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of a beer, cider, or drink) Made with an unusually large amount of fruit, giving a very strong fruit flavor and often a thicker, sweeter, or more “juice-like” texture.","zh":"（尤指啤酒、苹果酒或饮品）加入异常大量水果制成的；果味非常浓，口感常更浓稠、更甜，甚至像果汁一样。"},"examples":[{"en":"This sour is overfruited, so it tastes more like mango juice than beer.","zh":"这款酸啤是重加水果的，所以喝起来更像芒果汁而不是啤酒。"},{"en":"I like overfruited beers, but they can be too sweet for me after one glass.","zh":"我喜欢重加水果的啤酒，但对我来说喝一杯后可能就会觉得太甜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having too much fruit on it or in it (less common), sometimes implying an overloaded or excessive amount.","zh":"（较少见）果实过多的；水果/果实多到显得“过量、堆满”的。"},"examples":[{"en":"The branch looked overfruited and started to bend under the weight.","zh":"那根树枝果实太多，重量压得它都弯了。"}]}],"synonyms":["heavily fruited","fruit-forward","fruit-loaded"],"phonetic":"/ˌoʊvɚˈfruːtɪd/","extraExplanation":["“overfruited”在精酿圈里非常常见，尤其用来形容酸啤（sour）或“smoothie sour”等风格：酿造时会加入大量果泥/果浆（puree），让果香、酸甜和稠度明显增强。","它通常是中性到偏褒义的描述（强调“果味很猛”），但在评价里也可能带一点批评意味：比如太甜、太稠、掩盖了酒体本身的麦芽或酒花风味。"]}
{"word":"overfruitful","summary":{"en":"Overfruitful means excessively fruitful—producing more fruit or results than is healthy or useful.","zh":"overfruitful 指“过于丰产/产出过多”，多到可能不健康或不实用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing too much fruit or too many results; excessively fruitful (often suggesting a problem, imbalance, or “more than is needed”).","zh":"结果（或产出）过多的；过于丰产的（常带有“多到不合适/导致问题”的含义）。"},"examples":[{"en":"The peach tree became overfruitful, so we thinned the young fruit to protect the branches.","zh":"这棵桃树结果太多了，所以我们疏掉一些幼果来保护枝条。"},{"en":"An overfruitful season can leave a plant weak the next year.","zh":"过于丰产的一季可能会让植物第二年变得虚弱。"},{"en":"The project was overfruitful in ideas, but we lacked time to develop them all.","zh":"这个项目点子多得有点“过头”，但我们没有时间把它们都做出来。"}]}],"synonyms":["too fruitful","excessively productive","overproductive","heavy-bearing","prolific"],"phonetic":"ˌoʊvɚˈfruːtfəl","extraExplanation":["“overfruitful”不是常见的标准词汇，更像是由 over-（过度）+ fruitful（多产的）临时组合出来的形容词（有点“造词/临时用词”的感觉）。写作中如果想更自然，常用表达包括：too fruitful、overproductive、excessively productive，园艺语境也常说 heavy-bearing（结果太多）。","在园艺/农业里，“结果过多”可能导致枝条折断、果实变小、或“隔年结果”（一年太多、下一年很少），所以这个词往往隐含“需要控制/疏果”的意味。"]}
{"word":"overfruitfully","summary":{"en":"“Overfruitfully” means “too fruitfully,” i.e., producing an excessive amount of results or output; it’s rare and often a creative word choice.","zh":"“overfruitfully”意为“过于多产/过于丰硕地”，强调产出多到过头；该词较罕见，常见于创意写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively fruitful way; producing more results, offspring, or output than is desirable or manageable.","zh":"过于多产地；过于丰硕地（产出、成果或后代多到不理想或难以应付）。"},"examples":[{"en":"The garden grew overfruitfully, and we couldn’t use all the vegetables before they spoiled.","zh":"花园长得过于丰硕，我们来不及把蔬菜用完就坏了。"},{"en":"If the team expands overfruitfully, coordination can become harder.","zh":"如果团队扩张得过于“多产”，协作反而会变得更困难。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/creative use) In a way that is very or unusually productive, emphasizing abundance.","zh":"（少见/偏文学或创意用法）非常高产地；强调成果丰盛、充沛。"},"examples":[{"en":"In the novel, the land is described as yielding overfruitfully after the long rains.","zh":"小说里写到，久雨之后土地出产得异常丰盛。"}]}],"synonyms":["too fruitfully","overly fruitfully","excessively","overproductively","too productively"],"phonetic":"/ˌoʊvɚˈfruːtfəli/","extraExplanation":["“overfruitfully”不是常见词，更多见于写作中的临时造词（creative coinage）。日常英语里更自然的说法通常是：too fruitfully / overly fruitfully / too productively / excessively productive（作表语或定语）。","构词上可理解为 over-（过度）+ fruitfully（富有成果地）。它常带有“多到过头”的评价意味，而不只是“很多”。"]}
{"word":"overfruitfulness","summary":{"en":"Overfruitfulness means being excessively fruitful—producing too much fruit or too many results, often with negative effects.","zh":"overfruitfulness 指“过度结果/过度多产”，产出过多且常带来负面影响（如品质下降或难以承受）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive fruitfulness; producing more fruit (or results) than is useful, healthy, or manageable.","zh":"过度结果；（产量或成果）多到不利于管理、健康或品质的程度。"},"examples":[{"en":"In some orchards, overfruitfulness can weaken branches and reduce fruit size.","zh":"在一些果园里，过度结果会削弱枝条并让果实变小。"},{"en":"The farmer thinned the peaches to prevent overfruitfulness and improve quality.","zh":"农夫给桃子疏果，以防止过度结果并提升品质。"},{"en":"Her schedule suffered from overfruitfulness—too many projects to finish well.","zh":"她的日程因为“过度产出”而吃不消——项目太多，难以高质量完成。"}]}],"synonyms":["excessive fruiting","overcropping","overproduction","excess fruit set"],"phonetic":"/ˌoʊvɚˈfrut.fəl.nəs/","extraExplanation":["这个词比较少见，通常出现在农业/园艺语境，更多人会用更常见的表达，如：too much fruit set（坐果过多）、excessive fruiting（过度结果）、overcropping（过度负载结果）。","构词法：over-（过度）+ fruitful（多产的/结果的）+ -ness（名词后缀）。常用于描述“数量过多带来负面影响”，也可比喻“成果/产出过多导致质量下降或精力分散”。"]}
{"word":"overfrustration","summary":{"en":"Overfrustration means excessive frustration—more frustration than is normal or manageable.","zh":"overfrustration 指“过度的挫折感”，即强度或累积程度超过正常/可承受范围的沮丧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive or unusually strong level of frustration; frustration that has built up too much","zh":"过度的挫折感；过强、累积过多的沮丧与不满"},"examples":[{"en":"After weeks of delays, her overfrustration turned into anger during the meeting.","zh":"拖延了好几周后，她的过度挫折感在会议上变成了愤怒。"},{"en":"Overfrustration can make small problems feel much bigger than they really are.","zh":"过度挫折感会让小问题显得比实际严重得多。"}]}],"synonyms":["overwhelming frustration","extreme frustration","pent-up frustration","intense frustration"],"phonetic":"/ˌoʊvərfrʌˈstreɪʃən/","extraExplanation":["这个词在日常英语中不算常见，更常用的表达是“extreme frustration / overwhelming frustration / pent-up frustration（积压的挫折感）”。","构词上是 over-（过度）+ frustration（挫折/沮丧）。有时写作者会用这种组合来强调“已经超过正常程度”的情绪强度，但正式写作里更倾向用常见搭配。"]}
{"word":"overfulfil","summary":{"en":"Overfulfil means to exceed what is required or expected.","zh":"overfulfil 指“超额完成；超过要求或预期”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do more than what was required, expected, or promised; to exceed a duty, target, or goal","zh":"超额完成；做得超过要求/预期/承诺"},"examples":[{"en":"The team overfulfilled the monthly sales target by 15%.","zh":"团队把月度销售目标超额完成了15%。"},{"en":"She overfulfilled her responsibilities and still made time to help others.","zh":"她不仅把自己的职责做得超出要求，还抽时间帮助别人。"},{"en":"The company overfulfilled its promise by delivering the product early.","zh":"公司提前交付产品，算是超额兑现了承诺。"}]}],"synonyms":["overachieve","exceed","outdo","go above and beyond","surpass"],"phonetic":"/ˌoʊvɚfʊlˈfɪl/","extraExplanation":["“overfulfil”是英式拼写，更常见的美式拼写是“overfulfill”。两者意思相同。","这个词常用于工作、指标、承诺等正式语境；日常口语里也常用“exceed expectations / go above and beyond”。"]}
{"word":"overfulfill","summary":{"en":"Overfulfill means to do more than what is required or expected—to exceed a request, promise, or target.","zh":"Overfulfill 指“超额完成/超出预期”，即做得超过要求、承诺或目标。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To do more than what is required or expected; to exceed what someone asked for.","zh":"（在任务、承诺等方面）做得超过要求或期待；超出他人所要求的范围。"},"examples":[{"en":"The team didn’t just meet the deadline—they overfulfilled the client’s request by delivering extra features.","zh":"团队不只按时完成了任务，还额外交付了功能，超额满足了客户的需求。"},{"en":"I try not to overfulfill, because it can create unrealistic expectations for next time.","zh":"我尽量不去过度“超额完成”，因为这会让下次的期待变得不切实际。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fulfill (a goal, plan, or order) more completely than intended; to exceed a target.","zh":"（对目标、计划或订单等）完成得比原本计划更充分；超出目标。"},"examples":[{"en":"The factory overfulfilled its monthly production target.","zh":"工厂超额完成了月度生产指标。"},{"en":"They overfulfilled the contract terms by offering free training.","zh":"他们还提供了免费培训，等于超出合同条款完成了承诺。"}]}],"synonyms":["exceed expectations","go above and beyond","overdeliver","surpass","outdo"],"phonetic":"ˌoʊvɚfʊlˈfɪl","extraExplanation":["“Overfulfill”在日常英语里不算最常见，更常见的说法有：exceed expectations（超出预期）、go above and beyond（做得远超本分）、overdeliver（交付超出承诺）。在商业或项目语境中，“overdeliver”尤其常用。","在一些历史与政治语境里（尤其谈到计划经济的“超额完成指标”），英语里也会用“overfulfill (a quota/plan/target)”。这种用法带有“完成指标甚至超过指标”的色彩。"]}
{"word":"overfull","summary":{"en":"Overfull means too full or filled beyond capacity; it can describe containers, places, or even schedules.","zh":"overfull 指“过满、超出容量”，可用于容器、空间，也可比喻日程安排过满。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled beyond its normal capacity; too full (often of a container, place, or schedule).","zh":"装得过满的；超出正常容量的（常指容器、空间或日程）。"},"examples":[{"en":"The trash can is overfull, so the lid won’t close.","zh":"垃圾桶太满了，所以盖子合不上。"},{"en":"The parking lot was overfull during the festival.","zh":"节日期间停车场爆满。"}]},{"partOfSpeech":"v.","definition":{"en":"To fill too much; to put more into something than it can comfortably hold.","zh":"把……装得过满；装入过多导致溢出或不便。"},"examples":[{"en":"Don’t overfull the suitcase, or the zipper may break.","zh":"别把行李箱塞得太满，不然拉链可能会坏。"},{"en":"She overfulls her schedule with meetings every day.","zh":"她每天把日程安排得过满，全是会议。"}]}],"synonyms":["too full","overflowing","packed","crammed","overcrowded"],"phonetic":"/ˌoʊvɚˈfʊl/","extraExplanation":["“over-”是常见前缀，表示“过度、超过”。所以 overfull = over（过度）+ full（满）。常见近义表达有：too full / overflowing（溢出的）/ packed（挤满的）。","overfull 既可描述“物理空间”太满（杯子、垃圾桶、停车场），也常用作比喻描述“时间/生活”太满（overfull schedule）。"]}
{"word":"overfullness","summary":{"en":"Overfullness means the state of being too full, or having more than is comfortable or appropriate.","zh":"Overfullness 指“太满、过度充满”的状态，也可引申为“过量、太多”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being too full; having more inside than is comfortable or appropriate (for a stomach, room, container, schedule, etc.).","zh":"过度充满；太满的状态（可指胃、房间、容器、日程等，超过舒适或合适的程度）。"},"examples":[{"en":"After the big dinner, I felt a painful overfullness in my stomach.","zh":"大吃一顿之后，我胃里感觉胀得难受，像是过度饱胀。"},{"en":"The overfullness of the closet made it hard to close the door.","zh":"衣柜塞得太满，门都很难关上。"},{"en":"She cut two meetings to reduce the overfullness of her schedule.","zh":"她取消了两场会议，来减轻日程的过度拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"An excessive amount or feeling of “too much,” especially in a place, design, or writing style.","zh":"过量；“太多”的感觉（尤指空间、设计或文字风格显得堆砌、拥挤）。"},"examples":[{"en":"The room’s overfullness of decorations made it feel smaller.","zh":"房间装饰堆得太多，让空间显得更小。"},{"en":"Some readers dislike the overfullness of detail in the first chapter.","zh":"有些读者不喜欢第一章细节过多、显得堆砌的感觉。"}]}],"synonyms":["excess","overabundance","fullness","stuffiness","crowdedness","bloating"],"phonetic":"/ˌoʊvɚˈfʊlnəs/","extraExplanation":["“overfullness”由 over-（过度）+ full（满的）+ -ness（名词后缀）构成，意思直观。日常更常用的说法是“too full / fullness / bloating（腹胀）/ overeating（吃太多）”，写作中才更可能看到“overfullness”。"]}
{"word":"overfunctioning","summary":{"en":"Overfunctioning means taking on too much responsibility or doing more than your share, often in relationships or groups.","zh":"Overfunctioning 指在关系或团队中承担过多责任、做得超过自己份内，常见于心理与人际语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Taking on too much responsibility, control, or emotional labor—especially in a relationship or group—often doing more than your fair share to keep things running.","zh":"（尤指在关系或团队中）承担过多责任、控制或情绪劳动，经常为了“维持运转”而做超出自己份内的事。"},"examples":[{"en":"In their marriage, her overfunctioning meant she managed the bills, the schedule, and even his appointments.","zh":"在他们的婚姻里，她的过度承担意味着她管账、管日程，甚至连他的预约都替他安排。"},{"en":"Overfunctioning at work can lead to burnout because you end up fixing everyone’s problems.","zh":"在工作中过度承担可能导致倦怠，因为你最后会变成替所有人收拾烂摊子的人。"},{"en":"He realized his overfunctioning was keeping others from learning to do things themselves.","zh":"他意识到自己的过度承担反而让别人没机会学会自己做事。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Describing a person or role) Acting in an over-responsible way; doing too much for others.","zh":"（形容人或角色）表现得过度负责；为别人做得太多。"},"examples":[{"en":"She’s the overfunctioning partner, and he’s the one who avoids decisions.","zh":"她是那个过度承担的伴侣，而他是那个回避做决定的人。"},{"en":"Try not to become the overfunctioning team member who always rescues deadlines.","zh":"尽量别变成那个总是救火、挽救截止日期的过度承担型队员。"}]}],"synonyms":["over-responsibility","doing too much","taking on too much","overextending oneself","people-pleasing (related)"],"phonetic":"/ˌoʊvərˈfʌŋkʃənɪŋ/","extraExplanation":["“Overfunctioning”常见于心理学与家庭/伴侣关系讨论中，尤其在“家庭系统（family systems）”语境里：一方越是过度承担（overfunction），另一方越可能变得依赖或退缩（underfunction）。","它不等于“勤奋”或“负责”本身；关键差别在于：是否长期超出界限、替别人做本该由对方承担的事，并因此损害自己的精力、情绪或关系的平衡。","相关常见搭配：overfunctioning partner / overfunctioning parent / overfunctioning at work。"]}
{"word":"overfund","summary":{"en":"“Overfund” means to give more money than needed, or to raise more money than a goal—often used for budgets, charities, and crowdfunding.","zh":"“Overfund”指为某事提供或筹集超过需要/目标的资金，常用于预算、慈善和众筹语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to provide more money than is needed for something; to fund excessively","zh":"为某事提供超过需要的资金；过度拨款/过度资助"},"examples":[{"en":"The project was overfunded, so the extra money was returned to donors.","zh":"这个项目被过度资助了，所以多余的资金退还给了捐赠者。"},{"en":"Some critics say the program is overfunded compared with other public services.","zh":"一些批评者认为，与其他公共服务相比，这个项目获得了过多资金。"},{"en":"They worried that overfunding one department would leave the rest of the company short of cash.","zh":"他们担心某个部门资金过多会导致公司其他部门现金不足。"}]},{"partOfSpeech":"vt.","definition":{"en":"to contribute more money than needed (often in crowdfunding or charity)","zh":"（常指众筹或慈善）捐款/出资超过目标或需要"},"examples":[{"en":"The campaign reached its goal in a day and ended up overfunded.","zh":"这次众筹一天就达标，最后还超额筹资。"},{"en":"Fans overfunded the fundraiser, enabling the group to expand the plan.","zh":"粉丝们超额捐助了这次募捐活动，使团队得以扩大计划。"}]}],"synonyms":["overfinance","overcapitalize","overinvest","fund too much","provide excessive funding"],"phonetic":"/ˌoʊvɚˈfʌnd/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常/需要的程度”，如 overwork（过度工作）、overpay（多付）。因此 overfund 多用于预算、公共项目、慈善与众筹语境。","实际使用中更常见的表达还有 be overfunded（被过度资助/超额筹资）以及 receive excessive funding（获得过多资金）。"]}
{"word":"overfunding","summary":{"en":"Overfunding means giving more money than needed, often implying waste or inefficiency.","zh":"Overfunding 指资金投入超过需要，常含“浪费/效率低”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of giving more money to a project, organization, or program than it needs or can use effectively.","zh":"对某个项目、组织或计划提供超出其需要或难以有效使用的资金（资金过度投入）。"},"examples":[{"en":"Some critics argued that the stadium project suffered from overfunding, with money wasted on luxury features.","zh":"一些批评者认为体育场项目存在过度拨款，资金被浪费在奢华设施上。"},{"en":"Overfunding can look positive at first, but it may reduce efficiency and accountability.","zh":"过度投入一开始看似好事，但可能降低效率并削弱问责机制。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide more money than necessary for a project, organization, or purpose.","zh":"为某个项目、组织或目的提供超过所需的资金；过度资助。"},"examples":[{"en":"The agency was accused of overfunding programs that showed little impact.","zh":"该机构被指责对成效不大的项目过度资助。"},{"en":"It’s easy to overfund a plan when the budget isn’t carefully reviewed.","zh":"如果预算审查不严，就很容易出现过度拨款。"}]}],"synonyms":["excess funding","overfinancing","overspending (related)"],"phonetic":"/ˌoʊvɚˈfʌndɪŋ/","extraExplanation":["在公共政策或机构管理语境中，overfunding 往往带有批评意味，暗示“资源配置不合理”“浪费纳税人资金”。在个人理财语境中也可能出现（如 overfunding a retirement plan），但含义更接近“投入超过最佳额度/规则上限”，语气未必强烈批评。","词形上它由 over-（过度）+ funding（资金供给）构成。实际使用里更常见的搭配包括: overfunding of a project/program; overfunding by the government; overfunded schools (某些地区“资金相对过多”的学校)。"]}
{"word":"overfurnish","summary":{"en":"Overfurnish means to put too much furniture or decoration in a space, making it feel crowded.","zh":"overfurnish 指在空间里摆放过多家具或装饰，导致拥挤。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to furnish (a room, house, etc.) with too many pieces of furniture or decorations, so it feels crowded or uncomfortable","zh":"（给房间、房子等）陈设/布置得过多（家具或装饰），使空间显得拥挤、不舒适"},"examples":[{"en":"The apartment looked smaller because it was overfurnished with bulky sofas and cabinets.","zh":"这间公寓因为摆了太多笨重的沙发和柜子，看起来更小了。"},{"en":"Try not to overfurnish a small bedroom—leave some open space to move around.","zh":"小卧室尽量不要布置过多家具——留一些空位方便走动。"}]}],"synonyms":["crowd","clutter","overdecorate","overequip"],"phonetic":"/ˌoʊvɚˈfɝnɪʃ/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、太多”。所以 overfurnish 就是“furnish（布置/配家具）过度”。日常写作里更常见的说法也可以是 “put too much furniture in a room / furnish it too heavily”。"]}
{"word":"overfurnished","summary":{"en":"Overfurnished means having too much furniture (and sometimes, figuratively, having too many details or ideas).","zh":"overfurnished 指“家具陈设过多、显得拥挤的”；也可比喻“细节或想法堆砌过多、过于繁复的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much furniture or too many decorative items; crowded with furnishings.","zh":"家具或装饰物过多的；陈设拥挤的。"},"examples":[{"en":"The apartment felt overfurnished, so the room looked smaller than it really was.","zh":"这间公寓显得家具太多，所以房间看起来比实际更小。"},{"en":"They removed two chairs to make the overfurnished living room easier to walk through.","zh":"他们搬走了两把椅子，让家具过多的客厅更好走动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, often in writing or thinking) Filled with too many details, examples, or ideas; overly elaborate.","zh":"（比喻用法，常指写作或思维）细节、例子或想法堆得过多的；过于繁复的。"},"examples":[{"en":"Her essay was clear but slightly overfurnished with extra quotations.","zh":"她的文章很清楚，但引用有点太多，显得略繁。"},{"en":"The novel’s middle chapters feel overfurnished, slowing the pace.","zh":"这本小说的中段章节细节堆叠过多，让节奏变慢。"}]}],"synonyms":["overcrowded","cluttered","cramped","overdecorated"],"phonetic":"/ˌoʊvɚˈfɝnɪʃt/","extraExplanation":["词形结构：over-（“过度”）+ furnished（“布置了家具的”）。既可字面指“家具摆太多”，也常用作隐喻，形容文字、思路或论证“堆料过多”。","语体与搭配：更常见于描述室内空间（an overfurnished room/apartment），比喻用法多见于评论写作与文学批评（an overfurnished style/mind）。","近义词区分：overcrowded更泛指“拥挤”；cluttered偏“杂乱”；overfurnished强调“家具/陈设过多”带来的拥挤感。"]}
{"word":"overfurnishes","summary":{"en":"“Overfurnishes” means (someone/something) provides or arranges more furniture or items than needed, making a space or setup excessive.","zh":"“overfurnishes”指（给空间或某人/某物）提供或摆放超过需要的家具/物品，导致布置或配置过度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to provide a room, house, or space with too much furniture or too many decorative items","zh":"（给房间/房子/空间）摆放过多家具或装饰；布置得过于拥挤"},"examples":[{"en":"The landlord says the apartment overfurnishes easily, so keep the layout simple.","zh":"房东说这套公寓很容易被过度布置，所以布局尽量简单。"},{"en":"If you overfurnishes the living room, it can feel smaller and harder to move around.","zh":"如果你把客厅家具摆得太多，空间会显得更小，也更难走动。"}]},{"partOfSpeech":"v.","definition":{"en":"to supply someone or something with more equipment, items, or resources than needed","zh":"（为某人/某物）提供过量的设备、物品或资源；配给过多"},"examples":[{"en":"The kit overfurnishes new employees with gadgets they rarely use.","zh":"这套工具包给新员工配了太多他们很少用到的设备。"},{"en":"A well-designed process avoids overfurnishes and focuses on what is truly necessary.","zh":"设计良好的流程会避免过度配置，把重点放在真正需要的东西上。"}]}],"synonyms":["overdecorate","clutter","overequip","overstock"],"phonetic":"/ˌoʊvərˈfɝnɪʃɪz/","extraExplanation":["“overfurnishes”是动词“overfurnish”的第三人称单数（he/she/it overfurnishes）。常见结构：overfurnish + a room/house/space；overfurnish + someone/something + with + items。","前缀“over-”常表示“过度、超过需要”，类似：overcrowd（过度拥挤）、overwork（过度工作）、overdecorate（过度装饰）。"]}
{"word":"overfurnishing","summary":{"en":"Overfurnishing means having or putting too much furniture in a space, making it feel crowded.","zh":"Overfurnishing 指在空间里摆放或拥有过多家具，使环境显得拥挤、杂乱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or habit of putting too much furniture in a room or space, so it feels crowded or cluttered.","zh":"（对房间或空间）家具摆放过多的行为或习惯，导致空间显得拥挤、杂乱。"},"examples":[{"en":"Overfurnishing can make a small apartment feel even smaller.","zh":"家具摆放过多会让小公寓显得更小。"},{"en":"They solved the problem of overfurnishing by removing two chairs and a side table.","zh":"他们把两把椅子和一张边几搬走，解决了家具过多的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"The result or condition of a space being filled with too much furniture.","zh":"（空间）因家具过多而呈现拥挤状态的结果或状况。"},"examples":[{"en":"The living room’s overfurnishing left little space to walk.","zh":"客厅家具过多，几乎没什么走动的空间。"},{"en":"Minimal decor helped balance the overfurnishing.","zh":"极简装饰帮助缓和了家具过多带来的拥挤感。"}]}],"synonyms":["too much furniture","overdecorating (similar idea)","cluttering (related)"],"phonetic":"/ˌoʊvərˈfɝnɪʃɪŋ/","extraExplanation":["“over-”是常见前缀，表示“过度、太多”（如 overwork 过度工作、overeat 吃太多）。因此 overfurnishing 就是“家具摆放过度/过多”。在家居与室内设计语境里，它常与 crowded（拥挤）、cluttered（杂乱）、cramped（狭小）等词一起出现。"]}

