{"word":"overlabor","summary":{"en":"Overlabor means to work too hard/too long, or to put excessive effort into something so it feels heavy or unnatural.","zh":"overlabor 指过度劳作、工作过量；也可指表达或创作时用力过猛，显得累赘不自然。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to work too hard or for too long; to make yourself or others do excessive work","zh":"过度劳作；（使自己或他人）劳累过度、工作过量"},"examples":[{"en":"If you overlabor during exam week, you may get sick afterward.","zh":"如果你在考试周过度劳作，之后可能会生病。"},{"en":"The manager warned the team not to overlabor and to take breaks.","zh":"经理提醒团队不要过度劳作，要适当休息。"}]},{"partOfSpeech":"v.","definition":{"en":"to use too much effort in making or explaining something, so it becomes heavy or unnatural","zh":"（在表达、创作或论证中）用力过猛；过分铺陈，反而显得生硬或累赘"},"examples":[{"en":"Don’t overlabor the joke—keep it simple.","zh":"别把笑话讲得太用力——简单一点就好。"},{"en":"The essay overlaboring its main point ended up sounding repetitive.","zh":"这篇文章把主旨过度强调，结果听起来有些重复。"}]}],"synonyms":["overwork","overdo","work too hard","strain","overexert"],"phonetic":"ˌoʊvərˈleɪbər","extraExplanation":["“overlabor”在现代英语中不算常用，更多见于较正式或文学化的表达。日常更常说：overwork（工作过度）、work oneself too hard（把自己累坏）。","英式拼写有时写作“overlabour”。"]}
{"word":"overlabored","summary":{"en":"Overlabored means either worked too hard or (of writing) too forced and not smooth.","zh":"overlabored 指“过度劳累的”，也可指（文字/表达）“过于刻意、不够流畅的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Worked too hard; having done more labor than is healthy or reasonable.","zh":"过度劳累的；干活过多而不健康或不合理的。"},"examples":[{"en":"After three double shifts in a row, she felt overlabored and needed a full day of rest.","zh":"连续上了三天双班后，她觉得自己过度劳累，需要休息一整天。"},{"en":"The staff were overlabored because the store was short-handed.","zh":"因为人手不足，员工们被迫过度劳作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Writing or style) showing too much effort; not natural or smooth.","zh":"（文章/表达）过于刻意的；不够自然流畅的。"},"examples":[{"en":"The speech sounded overlabored, as if every sentence had been forced into place.","zh":"这篇演讲听起来过于刻意，仿佛每句话都是硬拼出来的。"},{"en":"Try to simplify the paragraph—right now it feels a bit overlabored.","zh":"试着把这一段写得更简洁些——现在读起来有点太刻意了。"}]}],"synonyms":["overworked","overstrained","overtired","labored","forced"],"phonetic":"ˌoʊvɚˈleɪbɚd","extraExplanation":["“overlabored”比较少见，更常用的替代词是“overworked”（人过度工作）或“labored”（表达/写作显得刻意、不自然）。在写作点评里，“labored/overlabored”通常是在说句子不够顺、读起来费劲。"]}
{"word":"overlaboring","summary":{"en":"Overlaboring means overworking—putting in too much labor for too long.","zh":"overlaboring 指过度劳作/过度工作，投入过多劳动或时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"working too hard or for too long; putting in more effort than is healthy or necessary (the act of overworking)","zh":"过度劳作；过度用力（指工作或用功太多、太久，超过健康或必要的程度）"},"examples":[{"en":"Overlaboring can lead to burnout and health problems.","zh":"过度劳作可能导致倦怠和健康问题。"},{"en":"He realized that his constant overlaboring wasn’t making him more productive—it was exhausting him.","zh":"他意识到自己长期过度劳作并没有更高效，反而把自己累垮了。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) working too hard or too long; overworking","zh":"（现在分词）正在过度劳作；过度工作"},"examples":[{"en":"She’s been overlaboring all week to meet the deadline.","zh":"为了赶截止日期，她整整一周都在过度劳作。"},{"en":"Overlaboring employees often make more mistakes.","zh":"过度劳作的员工往往更容易出错。"}]}],"synonyms":["overworking","working too hard","overexertion","toil too much","burning the candle at both ends"],"phonetic":"/ˌoʊvɚˈleɪbɚɪŋ/","extraExplanation":["“over-”表示“过度、超过”，加在“labor（劳动）”前形成“overlabor”，意思是“过度劳作”。“overlaboring”可以当名词（指这种行为/状态）或当动词现在分词（描述正在过度劳作）。","日常英语里更常见的说法是“overworking / working too hard”，而“overlaboring”相对少见，略显正式或书面。"]}
{"word":"overlabour","summary":{"en":"Overlabour means working too hard or making someone/something worked on too much.","zh":"overlabour 指过度劳作，也可指让他人过度劳作，或把作品/表达处理得过于用力、繁复。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to work too hard or for too long; to overwork yourself","zh":"过度劳作；工作过久或过辛苦（把自己累坏）"},"examples":[{"en":"Don’t overlabour yourself—take a break and drink some water.","zh":"别让自己过度劳作——休息一下，喝点水。"},{"en":"During the busy season, many staff members overlabour and get sick.","zh":"旺季时，很多员工过度劳作，结果生病了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone work too hard; to overwork or burden (a person or group)","zh":"使（某人）过度劳作；让（人或群体）负担过重"},"examples":[{"en":"Good managers try not to overlabour their teams.","zh":"好的管理者会尽量不让团队过度劳作。"},{"en":"The new schedule overlaboured the nurses with extra night shifts.","zh":"新排班让护士承担了额外的夜班，导致过度劳作。"}]},{"partOfSpeech":"vt.","definition":{"en":"to work on something too much, making it overly complicated or heavy (especially writing or art)","zh":"对（作品/表达）用力过猛；把（文字或作品）处理得过于繁复或沉重（尤指写作、艺术）"},"examples":[{"en":"The essay is clear, but the ending feels overlaboured.","zh":"文章整体很清楚，但结尾显得有点用力过猛。"},{"en":"Try not to overlabour the sentence—simple wording is stronger.","zh":"尽量别把句子写得过度堆砌——简单表达反而更有力。"}]}],"synonyms":["overwork","overtire","overburden","strain","exhaust"],"phonetic":"/ˌoʊvɚˈleɪbɚ/","extraExplanation":["“overlabour”是较少见的拼写，常见于英式拼写习惯（-our），美式更常写作“overlabor”。日常英语里更常用“overwork”（更口语、最常见）。","在文学或评论语境中，形容写作/艺术“overlaboured”通常带一点批评意味：技巧太多、太刻意，反而不自然。"]}
{"word":"overlaboured","summary":{"en":"Overlaboured means either overworked and exhausted, or (of writing/art) overly forced and heavy because of too much effort or detail.","zh":"overlaboured 可指人“过劳疲惫”，也可指作品/表达“过于用力、堆砌细节而显得生硬沉重”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) made very tired because they have worked too much; overworked.","zh":"（人）因工作过度而疲惫的；过劳的。"},"examples":[{"en":"After three weeks of late nights, she felt overlaboured and irritable.","zh":"连续三周熬夜后，她感到过劳而烦躁。"},{"en":"The hospital staff were overlaboured during the flu season.","zh":"流感季期间，医院员工工作负荷过重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of writing, art, or an idea) done with too much effort or detail, so it feels heavy, forced, or less natural.","zh":"（文章、艺术或想法）过于用力、堆砌细节而显得生硬或沉重的；过分雕琢的。"},"examples":[{"en":"The essay’s conclusion felt overlaboured and repeated the same points.","zh":"这篇文章的结尾显得过于雕琢，反复强调同样的观点。"},{"en":"Some critics found the symbolism overlaboured rather than subtle.","zh":"一些评论家觉得象征手法过于用力，而不够含蓄。"}]}],"synonyms":["overworked","overburdened","strained","labored","forced","heavy-handed"],"phonetic":"/ˌoʊvərˈleɪbərd/","extraExplanation":["“overlaboured”更常见于英式拼写和较正式的书面语；美式英语里更常用“overworked”来表示“过劳的”。","第二个意思多用于文学/评论语境，常与“style（文风）”“metaphor（隐喻）”“argument（论证）”等搭配，含有“用力过猛、不够自然”的评价色彩。"]}
{"word":"overlabouring","summary":{"en":"Overlabouring means working excessively, or spending too much effort making a point or task longer than necessary.","zh":"overlabouring 指过度劳作，或在表达/处理事情时用力过猛，把内容弄得冗长复杂。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of overlabour/overlabor) working too hard or for too long; putting in excessive effort.","zh":"（overlabour/overlabor 的现在分词）过度劳作；工作时间过长或用力过度。"},"examples":[{"en":"She was overlabouring and started to feel exhausted by midweek.","zh":"她过度劳作，到周中就开始觉得筋疲力尽。"},{"en":"Don’t keep overlabouring—take a break and drink some water.","zh":"别再过度劳作了——休息一下，喝点水。"}]},{"partOfSpeech":"adj.","definition":{"en":"spending too much time or effort on an explanation or task; making something longer or more complicated than necessary.","zh":"（在解释或做事时）过分用力、过度展开；把事情弄得比必要的更冗长或更复杂。"},"examples":[{"en":"You’re overlabouring the point—one clear example is enough.","zh":"你把这个点讲得太过了——一个清楚的例子就够了。"},{"en":"The report is solid, but the introduction feels overlabouring.","zh":"报告很扎实，但引言部分显得过于铺陈。"}]}],"synonyms":["overworking","overexerting","belaboring","laboring the point","going on and on"],"phonetic":"/ˌoʊvɚˈleɪbɚɪŋ/","extraExplanation":["“overlabouring”更常见于英式拼写（overlabour）。美式英语里通常写作“overlaboring”。","在“把某个观点讲太多/写太长”的意思上，英语里更常用的词是“belabor”（美式）或“labour the point”（英式），日常写作中会更自然。"]}
{"word":"overlace","summary":{"en":"Overlace means to lace over something or to interweave in a crisscross pattern (a rare/old-fashioned word).","zh":"Overlace 指“在……上方交叉系紧”或“交织成网状”（较少见、略偏旧式用语）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lace over something; to fasten or cover by crossing laces, cords, or threads on top","zh":"（用系带、绳线等）在……上方交叉系紧；用带子覆盖并系住"},"examples":[{"en":"She overlaced the front of the boots to tighten them.","zh":"她把靴子前面的鞋带交叉系紧，让它更贴合。"},{"en":"The costume was overlaced with ribbon across the chest.","zh":"这件戏服在胸前用丝带交叉系住。"}]},{"partOfSpeech":"vt.","definition":{"en":"to interweave or crisscross (threads, patterns, or ideas) over one another; to overlay with a laced pattern","zh":"（线、图案或想法等）交织在一起；以交叉网状覆盖/叠加"},"examples":[{"en":"The design overlaces dark and light threads to create a subtle pattern.","zh":"这个设计把深浅两色的线交织在一起，形成细腻的纹样。"},{"en":"In the essay, personal memories are overlaced with historical details.","zh":"在这篇文章里，个人回忆与历史细节交织在一起。"}]}],"synonyms":["lace up","interlace","crisscross","cross-lace","weave","overlay"],"phonetic":"/ˌoʊvɚˈleɪs/","extraExplanation":["“overlace”在现代英语里非常少见，更多出现在较旧的文本、服装/纺织工艺描述中；日常表达更常用“lace up”“interlace”“crisscross”“overlay”。"]}
{"word":"overlactate","summary":{"en":"Overlactate means to produce or build up too much lactate, often in exercise physiology or fermentation/biotech contexts.","zh":"Overlactate 指（在运动生理或发酵/生物技术等语境中）产生或堆积过多乳酸。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to produce or accumulate too much lactate (lactic acid) in the body or in a biological/industrial system","zh":"（人体或生物/工业系统中）产生或积累过多的乳酸"},"examples":[{"en":"During very intense exercise, muscles can overlactate and start to burn.","zh":"在高强度运动时，肌肉可能会乳酸过多，开始出现灼烧感。"},{"en":"If the fermentation runs too hot, the culture may overlactate and the flavor can turn sharp.","zh":"如果发酵温度过高，菌群可能会乳酸过多，味道会变得偏酸、偏刺。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something (such as cells or a fermentation culture) to produce too much lactate","zh":"使（细胞、发酵菌群等）产生过多乳酸"},"examples":[{"en":"The high-sugar feed can overlactate the cells and reduce growth.","zh":"高糖投喂可能会使细胞乳酸过多，从而降低生长。"}]}],"synonyms":["produce excess lactate","build up lactate","accumulate lactate"],"phonetic":"/ˌoʊvərˈlækˌteɪt/","extraExplanation":["“overlactate”不是日常英语里的常用词，更常见的表达是“produce too much lactate / build up lactate（乳酸堆积）”或在医学语境中说“lactic acidosis（乳酸性酸中毒）”。","lactate（乳酸盐）与“lactic acid（乳酸）”在口语中常被混用；在生理和化学语境中，lactate更常指离子/盐形式。强度很高、供氧不足时，身体更容易出现乳酸堆积相关的不适感。"]}
{"word":"overlactated","summary":{"en":"“Overlactated” means having excessively high lactate (usually after intense exercise).","zh":"“overlactated”指（多在剧烈运动后）乳酸盐水平过高的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much lactate in the body (especially in the blood or muscles), often after very hard exercise; in a state of unusually high lactate.","zh":"（尤指运动后）体内（血液或肌肉中）乳酸盐含量过高的；乳酸盐偏高状态的。"},"examples":[{"en":"After several all-out sprints, some athletes feel shaky and overlactated.","zh":"连续几次全力冲刺后，有些运动员会觉得发抖、乳酸盐过高。"},{"en":"The coach slowed the workout because the team was getting overlactated too early.","zh":"教练放慢了训练节奏，因为队员们太早就出现乳酸盐过高的情况。"}]}],"synonyms":["high-lactate","elevated-lactate","lactate-overloaded","with lactate buildup"],"phonetic":"/ˌoʊvərˈlæk.teɪ.tɪd/","extraExplanation":["“overlactated”不是非常常见的标准词，更常见的说法有：high lactate / elevated lactate（乳酸盐升高）、lactate buildup（乳酸堆积）、lactate overload（乳酸负荷过高）。在运动训练语境里，有时会用它来口语化地表达“乳酸太高了”。","学习时也可注意：现代运动科学里更常说“lactate（乳酸盐）”而不是“lactic acid（乳酸）”，因为运动中主要积累的是乳酸盐形式。"]}
{"word":"overlactating","summary":{"en":"“Overlactating” means producing more breast milk than needed (having an oversupply).","zh":"“overlactating”指母乳分泌超过需求，即供奶过剩/奶量过多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"producing more breast milk than is needed (often causing an “oversupply” of milk).","zh":"（母乳喂养中）分泌的母乳量超过需要，出现“奶量过多/供奶过剩”。"},"examples":[{"en":"She realized she was overlactating because the baby often coughed during fast let-down.","zh":"她发现自己可能在奶量过多，因为宝宝在奶阵太急时常常会呛到。"},{"en":"Overlactating can make breastfeeding feel uncomfortable or stressful at first.","zh":"奶量过多一开始可能会让母乳喂养变得不舒服或压力很大。"}]},{"partOfSpeech":"vi.","definition":{"en":"to produce more breast milk than needed; to have an oversupply of milk.","zh":"（母乳喂养中）分泌过多母乳；供奶过剩。"},"examples":[{"en":"Some parents worry they are overlactating when they leak a lot between feeds.","zh":"有些家长在两次喂奶之间漏奶很多时，会担心自己是不是供奶过剩。"},{"en":"She began overlactating after frequent pumping early on.","zh":"她在早期频繁吸奶后开始出现供奶过剩的情况。"}]}],"synonyms":["having an oversupply (of milk)","milk oversupply","hyperlactation"],"phonetic":"/ˌoʊvɚˈlækˌteɪtɪŋ/","extraExplanation":["“overlactating”不是最常见的日常用词；在英语母乳喂养语境中更常见的说法是“milk oversupply / oversupply（奶量过多）”或医学/咨询语境里的“hyperlactation（泌乳过多）”。","这个词通常用于母乳喂养支持、泌乳顾问（lactation consultant）或育儿讨论中，语气中性偏描述性，并不等同于“健康/更好”。"]}
{"word":"overlactation","summary":{"en":"Overlactation means producing more breast milk than needed (milk oversupply).","zh":"overlactation 指母乳分泌过多、超过需求的“过度泌乳/奶量过多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) The production of more breast milk than a baby needs; an oversupply of milk during breastfeeding.","zh":"（医学）过度泌乳；母乳分泌量超过婴儿需求的情况（母乳过多/奶量过多）。"},"examples":[{"en":"Overlactation can cause frequent leaking and a strong let-down reflex.","zh":"过度泌乳可能导致经常漏奶和强烈的喷乳反射。"},{"en":"With guidance from a lactation consultant, she managed her overlactation by adjusting feeding patterns.","zh":"在哺乳顾问的指导下，她通过调整喂养方式来改善过度泌乳。"}]}],"synonyms":["milk oversupply","oversupply (of breast milk)","hyperlactation"],"phonetic":"/ˌoʊvɚˌlækˈteɪʃən/","extraExplanation":["“overlactation”多见于医学或哺乳咨询语境，日常英语里更常说“oversupply (of breast milk)”或“milk oversupply”。","过度泌乳有时会让婴儿在吃奶时呛到、胀气或出现“前奶多、后奶少”的摄入不平衡；也可能让母亲出现乳房胀痛、堵奶等问题。若遇到相关困扰，通常建议咨询医生或专业哺乳顾问获取个性化建议。"]}
{"word":"overlade","summary":{"en":"“Overlade” is a rare word meaning “overload/burden too much,” and it is often a misspelling of “overload” or “overlaid.”","zh":"“overlade”非常少见，主要表示“使超负荷/负担过重”，也常是“overload”或“overlaid”的拼写误写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/old-fashioned) To load or burden with too much; to overload.","zh":"（罕见/较旧）使负担过重；装载过多；使超负荷。"},"examples":[{"en":"Don’t overlade the truck, or the tires may fail.","zh":"别把卡车装得太满，不然轮胎可能会出问题。"},{"en":"She felt overladen with work and family duties.","zh":"她觉得工作和家庭责任让她压力过大。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To cover with an extra layer; to overlay.","zh":"（罕见）覆盖上一层；叠加；铺覆（相当于 overlay 的意思）。"},"examples":[{"en":"The designer overlade the image with a light texture.","zh":"设计师在图片上叠加了一层淡淡的纹理。"}]}],"synonyms":["overload","burden","overburden","encumber","overlay"],"phonetic":"/ˌoʊvɚˈleɪd/","extraExplanation":["“overlade”在现代英语里非常少见，很多时候是把“overload（使超负荷）”或“overlaid（overlay 的过去式/过去分词，意为‘覆盖/叠加’）”拼错了。","如果你想表达“让某人/某物负担太重”，日常更自然写：overload（动词/名词）。例如：Don’t overload the circuit.（别让电路超负荷。）","如果你想表达“覆盖/叠加（尤指图层、材料等）”，更常用：overlay（动词/名词）或 overlaid（过去式/过去分词）。例如：The map is overlaid with data.（地图上叠加了数据。）"]}
{"word":"overladed","summary":{"en":"“Overloaded” means having too much work or demand, or being overfilled/overburdened so a person or system can’t function well or safely.","zh":"“Overloaded”表示人或系统“超负荷/过载”，即任务、需求或装载量过多，影响正常或安全运行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much work, demand, or responsibility; carrying more than is reasonable or safe.","zh":"超负荷的；负担过重的（工作、需求或责任太多，超过合理或安全范围）。"},"examples":[{"en":"Our customer service team is overloaded during the holiday season.","zh":"假期旺季时，我们的客服团队会超负荷。"},{"en":"I felt overloaded with assignments this week.","zh":"这周我的作业多到让我觉得负担过重。"}]},{"partOfSpeech":"adj.","definition":{"en":"Containing too much data, power, or items so it cannot work properly or safely (often used for machines, systems, or vehicles).","zh":"过载的（数据/电力/物品过多，导致系统、机器或车辆无法正常或安全运行）。"},"examples":[{"en":"The server crashed because it was overloaded with requests.","zh":"服务器因为请求过多而过载崩溃了。"},{"en":"Don’t plug too many devices into one outlet—it can become overloaded.","zh":"不要在一个插座上插太多设备——可能会过载。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put too much weight, work, or demand on someone or something.","zh":"使……超负荷；使……过载（给人或物加上过多的重量、任务或需求）。"},"examples":[{"en":"Try not to overload your schedule with meetings.","zh":"尽量不要把会议塞满日程，让自己超负荷。"},{"en":"Overloading the truck is dangerous.","zh":"卡车超载是很危险的。"}]}],"synonyms":["overburdened","swamped","overworked","overloaded","overtaxed"],"phonetic":"/ˌoʊvɚˈloʊdɪd/","extraExplanation":["你写的“overladed”通常是拼写错误；更常见的正确拼写是“overloaded”。它来自动词“overload”（over- 表示“过度”，load 表示“负载/装载”）。"]}
{"word":"overladen","summary":{"en":"Overladen means “loaded with too much,” used for vehicles or figuratively for responsibilities; it can also mean “to overload.”","zh":"overladen 表示“装载过多/负担过重”，可指车辆等超载，也可比喻责任或压力太多；也可作动词表示“使超载”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loaded with too much weight or too many things; overburdened.","zh":"负载过重的；装得太满的；不堪重负的。"},"examples":[{"en":"The truck was overladen with furniture and moved very slowly.","zh":"卡车装了太多家具，开得很慢。"},{"en":"She felt overladen with responsibilities at work and at home.","zh":"她在工作和家庭两头都觉得责任太重、压力很大。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of a vehicle, person, or animal) to load with too much weight; to overload.","zh":"（对车辆、人或动物）装载过多；使超载。"},"examples":[{"en":"Don’t overladen the boat, or it could become unsafe.","zh":"别让船超载，否则会很危险。"},{"en":"They overladen the cart with sacks of grain.","zh":"他们把一袋袋谷物装到车上，装得过满。"}]}],"synonyms":["overloaded","overburdened","weighed down","encumbered"],"phonetic":"/ˌoʊvɚˈleɪdən/","extraExplanation":["“overladen”是“over-（过度）+ laden（装载的）”构成的词。更口语、更常见的对应词通常是“overloaded”。","它既可用于字面“装太多/太重”，也常用于比喻“压力、责任、任务太多”。在写作中“overladen”略显正式，常见于描述性文章或文学语境。"]}
{"word":"overlades","summary":{"en":"“Overlades” is usually a misspelling of “overloads,” meaning to burden too much or an excessive amount of work/pressure.","zh":"“overlades”通常是“overloads”的误拼，意思是“使负担过重”或“过多的工作/压力/信息量”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually written as “overloads.”) To put too much work, weight, or responsibility on someone or something.","zh":"（通常写作“overloads”。）使……负担过重；给……施加过多工作、重量或责任。"},"examples":[{"en":"Don’t overload the washing machine, or it may stop working properly.","zh":"不要把洗衣机塞得太满，不然可能无法正常运转。"},{"en":"She overloaded herself with extra classes and a part-time job.","zh":"她又选了额外课程又打工，把自己压得太紧。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Intransitive) To have too much to handle; to become overwhelmed or stressed because there is too much input or work.","zh":"（不及物）超负荷；因输入或任务过多而不堪重负。"},"examples":[{"en":"If the system overloads, the website may crash.","zh":"如果系统超负荷，网站可能会崩溃。"},{"en":"I overload easily when there’s too much noise and information.","zh":"噪音和信息太多时我很容易感到过载。"}]},{"partOfSpeech":"n.","definition":{"en":"Too much work, pressure, or information; an excessive load.","zh":"过载；超负荷的工作量/压力/信息量。"},"examples":[{"en":"The team is dealing with an overload of requests this week.","zh":"团队这周要处理大量请求，已经超负荷了。"},{"en":"Information overload can make it hard to make decisions.","zh":"信息过载会让人更难做决定。"}]}],"synonyms":["overburden","overwork","weigh down","strain","overwhelm"],"phonetic":"/ˌoʊvərˈloʊdz/","extraExplanation":["“overlades”本身在现代英语里很少见；最常见的形式是“overloads”（动词第三人称单数/名词复数）或“overloaded”（过去式/过去分词/形容词）。如果你是在写作或考试中遇到“overlades”，很可能是拼写错误，通常应改为“overloads”。"]}
{"word":"overlading","summary":{"en":"“Overlading” is usually a misspelling of “overloading,” meaning putting too much load/work/demand on someone or something.","zh":"“overlading” 通常是 “overloading” 的误拼，意思是让某人/某物负担过重或超载。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Commonly meant) putting too much load, work, or demand on someone or something; the act of giving more than can be safely or comfortably handled.","zh":"（通常指）使某人或某物负担过重；负荷过量；超出安全或舒适范围的工作量/需求。"},"examples":[{"en":"Try not to overload the washing machine, or it may stop working properly.","zh":"洗衣机不要装得太满，不然可能会运转不正常。"},{"en":"She’s overloading herself with too many classes this semester.","zh":"这学期她选了太多课，把自己搞得负担过重。"},{"en":"The website crashed because the server was overloaded with requests.","zh":"网站崩溃了，因为服务器请求量过大导致过载。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount of work, pressure, or weight that is too great; an excessive load.","zh":"过重的负担；超出承受能力的工作量/压力/重量。"},"examples":[{"en":"Students often feel overload during exam week.","zh":"考试周学生常常感到压力过大。"},{"en":"The truck was fined for carrying an overload.","zh":"那辆卡车因超载被罚款。"}]},{"partOfSpeech":"adj.","definition":{"en":"having too much to carry or do; burdened beyond normal limits.","zh":"超负荷的；负担过重的。"},"examples":[{"en":"An overloaded schedule can hurt your health.","zh":"排得过满的日程会影响健康。"},{"en":"Overloaded power strips can be a fire risk.","zh":"插线板超负荷使用可能有火灾隐患。"}]}],"synonyms":["overburden","overwork","strain","overtax","overload"],"phonetic":"/ˌoʊvɚˈloʊdɪŋ/","extraExplanation":["“overlading” 不是常见标准拼写。你很可能想写的是 **overloading**（动名词/现在分词），或 **overloaded**（形容词：超负荷的）。","构词小提示：**over-** 表示“过度/超过”，**load** 表示“负荷、装载、工作量”。合起来就是“超过可承受的负荷”。","常见搭配：overload a machine（让机器过载）、overload a schedule（把日程排太满）、information overload（信息过载）、overload the server（让服务器过载）。"]}
{"word":"overlaid","summary":{"en":"“Overlaid” means “covered with a layer” or “superimposed on top of something,” and it is the past form of “overlay.”","zh":"“overlaid”表示“覆盖上一层”或“叠加在……之上”，是“overlay”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “overlay”: to cover something by putting a layer on top of it.","zh":"“overlay”的过去式/过去分词：在某物上加一层来覆盖（铺上一层）。"},"examples":[{"en":"The table was overlaid with a sheet of glass to protect the wood.","zh":"桌面上加铺了一层玻璃来保护木头。"},{"en":"Over time, the original paint was overlaid with newer coats.","zh":"随着时间推移，原来的油漆被后来刷上的几层新漆覆盖了。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “overlay”: to place something on top of something else so both can be seen (often information, images, or text).","zh":"“overlay”的过去式/过去分词：把某物（常为信息、图像、文字）叠加在另一物上，使两者同时可见。"},"examples":[{"en":"The app overlaid directions on the live camera view.","zh":"这个应用把导航指示叠加在实时摄像画面上。"},{"en":"In the report, the designer overlaid labels on the map.","zh":"在报告里，设计师把标注叠加到地图上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a layer placed on top; covered or superimposed.","zh":"被覆盖的；被叠加的（上面有一层）。"},"examples":[{"en":"The overlaid image shows both the old street plan and the new one.","zh":"这张叠加图同时显示了旧街区规划和新规划。"},{"en":"The overlaid fabric has a smooth outer layer.","zh":"这种面料外面覆有一层光滑的表层。"}]}],"synonyms":["covered","coated","layered","superimposed","overwritten"],"phonetic":"/ˌoʊvərˈleɪd/","extraExplanation":["“overlay/overlaid”常见于印刷、地图、摄影与界面设计：比如把半透明的信息层（文字、线条、标记）叠在底图或照片上。中文常译为“覆盖、覆层、叠加、套印（印刷语境）”。"]}
{"word":"overlain","summary":{"en":"“Overlain” means “covered over with a layer,” and it’s the past participle of “overlay,” often used in passive descriptions or in geology.","zh":"“overlain”意为“被覆盖上一层”，是“overlay”的过去分词，常用于被动描述或地质语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past participle of “overlay”) covered on top with a layer; placed or spread over something else.","zh":"（overlay 的过去分词）覆盖在……之上；在……表面铺上一层。"},"examples":[{"en":"The original painting was overlain with a later coat of varnish.","zh":"原来的画作上又覆了一层后期的清漆。"},{"en":"In the old manuscript, the first text seems to be overlain by darker ink.","zh":"在这份古手稿里，最初的文字似乎被更深的墨迹覆盖了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Geology/technical) having a layer above; lying beneath an upper layer.","zh":"（地质/技术用语）被上层覆盖；处在上覆层之下。"},"examples":[{"en":"The clay bed is overlain by a thick layer of sand.","zh":"这层黏土层上覆着一层很厚的沙层。"},{"en":"Older rock is often overlain by younger deposits.","zh":"较老的岩层常常被较新的沉积物覆盖。"}]}],"synonyms":["covered","coated","layered","superimposed","overlaid"],"phonetic":"/ˌoʊvərˈleɪn/","extraExplanation":["“overlain”多用于被动或描述性语境（如“is/was overlain by…”），强调“上面又加了一层”，常见于艺术修复、写作（文字被改写覆盖）、以及地质学描述地层关系。","对应的原形动词是“overlay”（/ˌoʊvərˈleɪ/），常见搭配：overlay A with B（用B覆盖A）；be overlain by B（被B覆盖）。"]}
{"word":"overland","summary":{"en":"Overland means traveling or transporting across land rather than by sea or air.","zh":"Overland 指“经由陆路”的旅行或运输，与海运或空运相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Traveling or carried across land (not by sea or air), especially over a long distance.","zh":"经由陆路的；跨越陆地运输或旅行的（不是走海路或空路），常指长距离。"},"examples":[{"en":"They planned an overland trip from China to Europe by train and bus.","zh":"他们计划从中国到欧洲的陆路旅行，坐火车和大巴。"},{"en":"The goods were shipped overland because the port was closed.","zh":"由于港口关闭，货物改为走陆路运输。"}]},{"partOfSpeech":"adv.","definition":{"en":"By land; across land rather than by sea or air.","zh":"走陆路地；经由陆地（而非海路或空路）。"},"examples":[{"en":"We traveled overland to avoid flying.","zh":"我们走陆路出行，避免坐飞机。"},{"en":"Some refugees moved overland at night to reach safety.","zh":"一些难民在夜间走陆路前往安全地带。"}]}],"synonyms":["by land","landward","land-based","terrestrial"],"phonetic":"/ˈoʊvərˌlænd/","extraExplanation":["“overland”常出现在旅行写作与历史叙述中，强调“跨越陆地”的路线对比“by sea/air”。例如“overland route（陆路路线）”。","历史语境里常与“Silk Road（丝绸之路）”这类商贸通道相关，用来描述商队或货物穿越大陆的运输方式。"]}
{"word":"overland route","summary":{"en":"A long-distance land route for travel or transport, not by sea or air.","zh":"用于旅行或运输的长距离陆路路线（非海运或空运）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A way to travel or transport goods by land (rather than by sea or air), often across a long distance.","zh":"陆路路线；经由陆地（而非海运或空运）进行长距离旅行或运输的路线。"},"examples":[{"en":"Because of the storm at sea, they chose an overland route to deliver the supplies.","zh":"由于海上暴风雨，他们选择走陆路运送补给。"},{"en":"The overland route from the coast to the capital takes two days by bus.","zh":"从海岸到首都的陆路路线坐巴士要两天。"},{"en":"Merchants used an overland route to trade silk and spices between cities.","zh":"商人们曾经沿着陆路路线在城市之间进行丝绸和香料贸易。"}]}],"synonyms":["land route","overland way","landward route","ground route"],"phonetic":"/ˈoʊvərˌlænd ruːt/","extraExplanation":["“Overland”字面意思是“在陆地上/经由陆地”。在历史语境中，它常让人联想到商队贸易路线、穿越山脉或沙漠的长途跋涉（如欧亚大陆的丝绸之路一类的陆上贸易通道）。","与“sea route（海路）”“air route（航线）”对比时，“overland route”强调运输方式和地理路径都以陆地为主，有时也暗示更慢但可能更安全/更不受海况影响。"]}
{"word":"overlander","summary":{"en":"An overlander is a person who travels long distances overland, often by vehicle; in Australian/NZ contexts it can also mean someone who arrived by land rather than by sea.","zh":"overlander 指陆路长途旅行者（常为自驾/越野）；在澳新语境中也可指从陆路进入某地的人（相对海路）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who travels overland (by road or land routes), often on a long journey, especially in a vehicle such as a 4x4.","zh":"陆路旅行者；（常指乘车、如四驱车进行长途）越野/陆路远行的人。"},"examples":[{"en":"They met an overlander who had driven from Alaska to Argentina.","zh":"他们遇到一位从阿拉斯加一路开车到阿根廷的陆路旅行者。"},{"en":"As an overlander, she carries tools, water, and a spare tire for remote roads.","zh":"作为一名越野远行者，她会为偏远路段携带工具、水和备胎。"}]},{"partOfSpeech":"n.","definition":{"en":"(Australia, New Zealand) a migrant, traveler, or worker who comes to an area by land rather than by sea.","zh":"（澳大利亚/新西兰）从陆路进入某地的移民、旅人或劳工（相对于乘船而来）。"},"examples":[{"en":"In early records, “overlanders” are mentioned alongside people arriving by ship.","zh":"在早期记录中，“overlanders”常与乘船抵达的人并列提及。"},{"en":"Some settlers were overlanders who crossed inland routes to reach the colonies.","zh":"一些定居者是走内陆路线抵达殖民地的陆路移民。"}]}],"synonyms":["overland traveler","road-tripper","expedition traveler","4x4 traveler","off-road traveler"],"phonetic":"/ˈoʊvɚˌlændɚ/","extraExplanation":["“overland”意为“走陆路（旅行/运输）”。“overlander”原本可泛指走陆路的人，但在现代英语里很常与越野自驾长途旅行（overlanding）文化相关：自给自足、露营、穿越偏远地区等。","在澳大利亚英语中，“overlander”也常见于历史语境，指从其他殖民地或地区经陆路进入澳洲内陆的人（与海路抵达形成对比）。"]}
{"word":"overlands","summary":{"en":"“Overlands” usually means “travels/transports by land” (3rd-person singular of overland).","zh":"“overlands”通常指“走陆路旅行/用陆路运输”（overland 的第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of overland) to travel or transport something across land, especially a long distance (not by sea or air).","zh":"（overland 的第三人称单数）经由陆路长途旅行；或用陆路运输（不走海运或空运）。"},"examples":[{"en":"She overlands through Central Asia on a motorcycle.","zh":"她骑摩托车走陆路穿越中亚旅行。"},{"en":"The company overlands supplies when flights are canceled.","zh":"当航班取消时，公司改用陆路运输物资。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare as a plural form) land routes or areas traveled across by land.","zh":"（较少见的复数用法）陆路路线；陆地行程所经过的地区。"},"examples":[{"en":"Old maps marked the overlands used by traders.","zh":"旧地图标出了商人使用的陆路路线。"}]},{"partOfSpeech":"adj.","definition":{"en":"by land; happening or carried out across land (not by sea or air).","zh":"经由陆路的；在陆地上进行的（非海运或空运）。"},"examples":[{"en":"They chose an overland route to avoid storms at sea.","zh":"他们选择走陆路，以避开海上的风暴。"},{"en":"The package was shipped overland.","zh":"包裹通过陆路运送。"}]}],"synonyms":["by land","over the ground","land-based","travel overland","transport overland"],"phonetic":"ˈoʊvərˌlænd","extraExplanation":["“overland”更常见的基本形式是形容词/副词（overland route/ship overland）或动词（to overland）。你输入的“overlands”在现代英语里最常见是动词第三人称单数（he/she overlands）。","在北美历史语境中，overland 常让人联想到19世纪的“overland routes”（如向西迁移的陆路通道、驿马邮路等）。"]}
{"word":"overlaness","summary":{"en":"“overlaness” is a nonstandard/rare form, likely intended to mean “excessive lateness.”","zh":"“overlaness”多半是非规范/少见写法，常被用来表示“过度迟到”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) the state of being excessively late; extreme lateness.","zh":"（非标准/较少见用法）过度迟到；非常晚到的状态。"},"examples":[{"en":"The teacher warned him that his overlaness was becoming a serious problem.","zh":"老师警告他说，他的“过度迟到”正在变成一个严重的问题。"},{"en":"Overlaness can make other people feel disrespected.","zh":"过度迟到会让别人觉得不被尊重。"}]}],"synonyms":["lateness","tardiness","chronic lateness","being late too often"],"phonetic":"/ˌoʊvərˈleɪtnəs/","extraExplanation":["“overlaness”并不是常见或规范的英语拼写；更可能是把“overlateness（过度迟到）”拼错了，或是临时造词。","日常英语里通常会用更自然的词：lateness（迟到）、tardiness（迟到/拖延，偏正式）、chronic lateness（习惯性迟到）、being late too often（经常迟到）。"]}
{"word":"overlanguaged","summary":{"en":"“Overlanguaged” means overly wordy or language-heavy—using more words than needed.","zh":"“overlanguaged”指表达过于冗长、辞藻堆砌，话太多反而不清楚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many words; expressed in an overly wordy, complicated, or language-heavy way.","zh":"用词过多的；语言过于冗长、繁复的。"},"examples":[{"en":"The instructions are overlanguaged—can you rewrite them in plain English?","zh":"这份说明太overlanguaged了——你能用更简单的英文重写吗？"},{"en":"Her essay is thoughtful, but it feels overlanguaged and hard to follow.","zh":"她的文章观点很好，但语言太冗长，读起来不太好跟。"},{"en":"Try not to be overlanguaged in emails; short sentences are often clearer.","zh":"写邮件尽量别太overlanguaged；短句通常更清楚。"}]}],"synonyms":["wordy","verbose","overwritten","long-winded","purple"],"phonetic":"/ˌoʊvɚˈlæŋɡwɪdʒd/","extraExplanation":["“overlanguaged”不是非常常见的标准词，更像是由“over-（过度）+ languaged（用语言表达的）”临时组合出来的形容词，常见于写作/编辑语境，用来批评表达“太绕、太多话”。在正式写作里，也可以用更常见的词如“wordy”“overwritten”“overly verbose”。"]}
{"word":"overlap","summary":{"en":"Overlap means two things share some of the same space, time, or content; it can be a verb (to overlap) or a noun (an overlap).","zh":"Overlap 指两件事在空间、时间或内容上有部分相同；既可作动词（发生重叠），也可作名词（重叠部分）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to partly cover the same area, time, or activity as something else; to share some parts in common","zh":"与……部分重叠；在空间、时间或内容上有部分相同"},"examples":[{"en":"Our schedules overlap, so we can meet on Tuesday afternoon.","zh":"我们的时间表有重叠，所以我们可以在周二下午见面。"},{"en":"The two circles overlap in the middle.","zh":"两个圆在中间部分重叠。"}]},{"partOfSpeech":"n.","definition":{"en":"an area, time period, or part where two things cover or share the same space, time, or content","zh":"重叠部分；（时间/空间/内容的）交叠处"},"examples":[{"en":"There is some overlap between the two courses, so the second one may feel easier.","zh":"这两门课有一些内容重叠，所以第二门可能会觉得更容易。"},{"en":"We should avoid overlap in responsibilities.","zh":"我们应该避免职责上的重复/重叠。"}]}],"synonyms":["intersect","coincide","overlie","encroach","shared portion"],"phonetic":"/ˌoʊvərˈlæp/","extraExplanation":["“Overlap”常用于工作与学习场景：overlap in duties（职责重叠）、overlap in content（内容重合）、overlap in time（时间冲突/重叠）。口语里说日程重叠时，也常用“conflict”表示更强的“冲突”，而overlap更中性，强调“有交集”。","在学术写作中常见搭配：a significant/considerable overlap（相当大的重叠）、partial overlap（部分重叠）。"]}
{"word":"overlapped","summary":{"en":"“Overlapped” means two things partly covered the same space or occurred at the same time (past form of “overlap”), and it can also describe something as overlapping.","zh":"“overlapped”表示（overlap 的过去式/过去分词）部分重叠或同时发生；也可作形容词，表示“重叠的/交叉的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “overlap”) to partly cover the same area, time, or activity as something else.","zh":"（overlap 的过去式/过去分词）与……部分重叠；在空间、时间或活动上有交叉。"},"examples":[{"en":"The two circles overlapped in the middle.","zh":"两个圆在中间部分重叠。"},{"en":"Our schedules overlapped, so we couldn’t meet.","zh":"我们的时间表有冲突（有重叠），所以见不了面。"},{"en":"In the museum, the audio from two exhibits overlapped and became hard to hear.","zh":"在博物馆里，两个展区的讲解音频重叠在一起，变得很难听清。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) partly covering the same space or happening at the same time; intersecting.","zh":"（形容词）部分重合的；同时发生的；交叉的。"},"examples":[{"en":"The report had overlapped sections that repeated the same idea.","zh":"这份报告有重叠的段落，重复表达同一个观点。"},{"en":"They found overlapped fingerprints on the glass.","zh":"他们在玻璃上发现了重叠的指纹。"}]}],"synonyms":["intersected","crossed","coincided","overlaid","encroached"],"phonetic":"/ˌoʊvərˈlæpt/","extraExplanation":["拼写小提示：overlap 以 -p 结尾，加 -ed 时通常会双写 p，变成 overlapped；类似的还有 stop→stopped。"]}
{"word":"overlapper","summary":{"en":"An overlapper is a person or thing that overlaps another in space or time; it can also mean a part made to overlap in technical contexts.","zh":"overlapper 指在空间或时间上与其他事物重叠的人或物；在技术语境中也可指用于搭接/重叠的部件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that overlaps (covers the same area/time as something else, or partly covers it).","zh":"重叠者；重叠物（与其他事物在空间/时间上有部分相同或覆盖的东西/人）。"},"examples":[{"en":"In the photo, the two circles are overlappers, so you can see a shared area in the middle.","zh":"在这张图里，两个圆是重叠物，所以中间能看到一块共享的区域。"},{"en":"Their work schedules are overlappers, which makes it easier to meet in the afternoon.","zh":"他们的工作时间有重叠，这让下午见面更容易。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, technical) something designed to overlap another part, especially in building or manufacturing.","zh":"（较少见，偏技术）用于与另一部件搭接/重叠的结构或零件（常见于建筑或制造领域）。"},"examples":[{"en":"The roof panels include an overlapper to keep rain from leaking in.","zh":"屋顶板包含一个搭接部分，用来防止雨水渗漏。"},{"en":"Check whether the overlapper sits flush before you tighten the screws.","zh":"在拧紧螺丝前，检查搭接件是否贴合。"}]}],"synonyms":["overlapping part","overlapping section","overlapped area (contextual)","overlap (more common)"],"phonetic":"/ˌoʊvərˈlæpər/","extraExplanation":["“overlapper”由动词 overlap（重叠）+ -er（做……的人/物）构成，表示“造成重叠的东西/人”或“具有重叠关系的一方”。日常英语里更常用 overlap（动词/名词）或 overlapping area/time（重叠区域/时间），而 overlapper 相对少见，多出现在描述图形、时间安排或技术结构时。"]}
{"word":"overlapping","summary":{"en":"“Overlapping” means partly sharing the same space, time, or content; it can describe a situation (adj.) or the overlap itself (n.).","zh":"“overlapping”表示在空间、时间或内容上部分重合；可作形容词描述“重叠的”，也可作名词指“重叠本身”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covering the same area or happening at the same time as something else (partly shared).","zh":"与另一事物覆盖同一部分区域或在同一时间发生（部分重叠）。"},"examples":[{"en":"There is some overlapping content in these two chapters.","zh":"这两章里有一些内容是重叠的。"},{"en":"The two meetings are overlapping, so I can’t attend both.","zh":"这两个会议时间重叠了，所以我无法都参加。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or situation of one thing extending over part of another; partial intersection.","zh":"一个事物延伸到另一个事物的一部分之上；部分交叠的情况。"},"examples":[{"en":"We should reduce overlapping between teams to avoid doing the same work twice.","zh":"我们应该减少团队之间的工作重叠，避免重复劳动。"},{"en":"The chart shows overlapping circles to represent shared members.","zh":"图表用相互重叠的圆来表示共同成员。"}]}],"synonyms":["intersecting","overlapping","shared","coinciding","partly shared"],"phonetic":"/ˌoʊvɚˈlæpɪŋ/","extraExplanation":["“overlapping”来自动词“overlap”（over- + lap）。lap原意与“衣襟/膝上（lap）”相关，引申出“覆盖在…之上”的感觉，所以overlap常用来描述“覆盖、交叠、时间冲突、职责重复”。","常见搭配：overlapping schedules（时间冲突/重叠的日程）、overlapping responsibilities（职责重叠）、overlapping circles/areas（重叠的圆/区域）、partially overlapping（部分重叠）。","在学术写作或职场表达中，overlapping常带“冗余/重复”的含义：overlapping work/efforts（重复劳动/重复投入）。"]}
{"word":"overlaps","summary":{"en":"“Overlaps” means things partly cover the same space, share time, or share some of the same parts; it can be a verb form or a plural noun.","zh":"“overlaps”表示在空间/时间/内容上部分重叠或共享相同部分；既可作动词形式，也可作名词复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to partly cover the same space or happen at the same time as something else","zh":"（在空间或时间上）与……部分重叠；部分覆盖；同时发生"},"examples":[{"en":"The two circles overlap.","zh":"这两个圆相互重叠。"},{"en":"My work schedule overlaps with my class time.","zh":"我的工作时间和上课时间有重叠。"},{"en":"These topics overlap in many ways.","zh":"这些话题在很多方面相互交叉（有重叠）。"}]},{"partOfSpeech":"n.","definition":{"en":"areas or time periods that share some of the same parts; points where two things cover or match each other","zh":"（空间/时间/内容的）重叠部分；交集；重复之处"},"examples":[{"en":"There are overlaps between the two reports.","zh":"这两份报告之间有一些重复/重叠的内容。"},{"en":"The overlaps in their duties caused confusion.","zh":"他们职责的重叠导致了混乱。"}]}],"synonyms":["intersect","coincide","overlie","cross","share"],"phonetic":"/ˌoʊvərˈlæps/","extraExplanation":["“overlaps”可以是动词 overlap 的第三人称单数（He/She/It overlaps），也可以是名词 overlap 的复数形式（There are overlaps）。要看句子里它是作谓语动词还是作名词。","常见搭配：overlap with（与……重叠）；overlap between A and B（A与B之间的重叠）；a significant/partial overlap（明显/部分重叠）。","在学术/工作语境里，overlap 常用来表达“内容重复”或“职责交叉”；在数学里常对应“交集”（常用维恩图 Venn diagram 来表示）。"]}
{"word":"overlard","summary":{"en":"Overlard means to add too much fat to food, or (figuratively) to burden writing or speech with too many extras.","zh":"Overlard 指给食物放太多油脂；也可比喻在文章或演讲中堆砌过多内容与修饰。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add too much fat (lard) to food; to make food overly greasy","zh":"（给食物）放太多猪油/油脂；把食物弄得过于油腻"},"examples":[{"en":"Don’t overlard the pastry, or it will taste heavy and greasy.","zh":"别给酥皮放太多油脂，不然会又腻又厚重。"},{"en":"The cook overlarded the stew, so a layer of fat floated on top.","zh":"厨师把炖菜放了太多油，上面浮着一层油脂。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overload a speech, book, or writing with too many details, decorations, or extra words","zh":"（比喻）用过多细节/修饰/赘词堆砌（演讲、文章、作品）；使内容显得臃肿"},"examples":[{"en":"He overlarded the essay with long quotes that didn’t support his main point.","zh":"他在文章里堆了太多无关的长引用，反而撑不起主旨。"},{"en":"Try not to overlard your story with side plots—keep the focus clear.","zh":"写故事尽量别加太多支线，把重点写清楚。"}]}],"synonyms":["overload","weigh down","stuff","overburden"],"phonetic":"/ˌoʊvɚˈlɑrd/","extraExplanation":["“overlard”比较少见、偏文学或书面用法。它来自“lard”（猪油；给……加油脂）。在写作语境里，lard 常用作动词，表示“往文字里塞进（多余内容）”，因此 overlard 就是“塞得太多”。日常更常用的近义表达是 “overload (with) / weigh down (with) / stuff with”。"]}
{"word":"overlarge","summary":{"en":"Overlarge means “too large” or “bigger than normal/needed,” often implying it doesn’t fit well or isn’t suitable.","zh":"overlarge 表示“过大、超出需要或正常尺寸”，常暗示不合适或不太好用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too large; larger than is needed, expected, or suitable.","zh":"过大的；大得不合适的；超出需要或预期的。"},"examples":[{"en":"He wore an overlarge coat that hung off his shoulders.","zh":"他穿了一件过大的外套，肩膀处都垮下来了。"},{"en":"The handle is overlarge, so it’s hard for small hands to grip.","zh":"这个把手太大了，小手很难握住。"}]},{"partOfSpeech":"adj.","definition":{"en":"Larger than normal (often used with measurements, packaging, or clothing sizes).","zh":"比通常更大（常用于尺寸、包装或衣服尺码）。"},"examples":[{"en":"They ordered an overlarge pizza for the party.","zh":"他们为聚会点了一个超大披萨。"},{"en":"This shirt comes in regular and overlarge sizes.","zh":"这件衬衫有常规码和加大码。"}]}],"synonyms":["oversized","too big","extra-large","overgrown"],"phonetic":"/ˌoʊvɚˈlɑrdʒ/","extraExplanation":["“over-”这个前缀常表示“过度、超过正常/需要的程度”，如 overwork（过度工作）、overeat（吃太多）、overconfident（过度自信）。因此 overlarge 往往带有“不太合适”的语气。","在日常英语里，人们更常说 too big / oversized / extra-large（XL）。overlarge 更偏书面或描述性写法，常见于说明书、产品描述或较正式的文字中。"]}
{"word":"overlargely","summary":{"en":"“overlargely” means “excessively; too greatly,” but it is rare and often replaced by more natural words like “overly” or “excessively.”","zh":"“overlargely”表示“过度地；过分地”，但非常少见，通常用更自然的“overly / excessively”等替代。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessive or too great way; more than is necessary or appropriate.","zh":"过度地；过分地；超过需要或合适的程度地。"},"examples":[{"en":"The jacket is overlargely sized, so it hangs off my shoulders.","zh":"这件夹克尺码过大，所以从我肩上松垮垮地垂下来。"},{"en":"He was overlargely confident about passing the test without studying.","zh":"他过分自信，觉得不复习也能通过考试。"}]}],"synonyms":["excessively","overly","too much","unduly","far too"],"phonetic":"/ˌoʊvɚˈlɑrdʒli/","extraExplanation":["“overlargely”并不是常见的标准用词，很多情况下更自然的表达是：overly / excessively / too much / far too。","如果你想表达“尺寸过大”，更地道的是：too large, oversized, overly large（而不是 overlargely）。例如：an oversized shirt（一件过大的衬衫）。","有时人们会把“over-（过度）+ largely（很大程度上）”拼在一起来强调“过度、太多”，但在正式写作中建议换成更常用的副词。"]}
{"word":"overlargeness","summary":{"en":"“Overlargeness” means excessive or too-great size or scale.","zh":"“overlargeness”表示“过大、过度的规模或尺寸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being too large; excessive size, scale, or extent.","zh":"过大；过度的尺寸/规模/程度。"},"examples":[{"en":"The overlargeness of the jacket made it hang awkwardly on her shoulders.","zh":"这件夹克过大，披在她肩上显得很别扭。"},{"en":"Critics said the overlargeness of the project made it hard to manage and too expensive.","zh":"批评者说，这个项目规模过大，难以管理且成本太高。"}]}],"synonyms":["excessive size","oversize","oversizedness","overgrowth","bigness (too great)"],"phonetic":"/ˌoʊvɚˈlɑrdʒnəs/","extraExplanation":["“overlargeness”并不常见，更常用的表达有：oversize、excessive size、too much/too large、overly large、oversizedness（也较少见）。","构词上它由 over-（过度）+ large（大）+ -ness（名词后缀，表示“……的状态/性质”）组成，多用于较正式或批评性的语境，强调“超过合理范围的大”。"]}
{"word":"overlascivious","summary":{"en":"“Overlascivious” (rare) means excessively lustful or sexually suggestive; more than appropriate.","zh":"“overlascivious”（罕见）指过于好色或过分露骨挑逗，超过场合所能接受的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare/nonstandard) excessively lustful or sexually suggestive; more lascivious than is acceptable in a situation.","zh":"（很少见/不规范用法）过于淫荡的、过分挑逗色情的；在特定场合显得“太过火”的好色/猥亵。"},"examples":[{"en":"The editor cut a few overlascivious lines so the novel could be published for a wider audience.","zh":"编辑删掉了几句过于露骨挑逗的文字，好让小说能面向更广的读者出版。"},{"en":"His overlascivious jokes made people uncomfortable at the office party.","zh":"他那些过分下流的玩笑让办公室聚会上的人很不舒服。"}]}],"synonyms":["overly lascivious","lewd","salacious","licentious","obscene","indecent"],"phonetic":"ˌoʊvər ləˈsɪviəs","extraExplanation":["“overlascivious”并不是常见词，更常见、更规范的说法是 **overly lascivious**（过于淫荡/露骨）或直接用 **lascivious**。","构词上可理解为 **over-**（过度）+ **lascivious**（好色的、淫荡的）。在正式写作中通常不建议把 over- 直接黏在 lascivious 前面造新词，除非你刻意追求修辞效果或模仿特定文风。","语体与语感：**lascivious** 偏正式、文学/评论语气；日常口语里更常用 **creepy**, **lewd**, **gross**, **pervy** 来表达“让人不舒服的色眯眯/下流”。"]}
{"word":"overlasciviously","summary":{"en":"“Overlasciviously” means “in an excessively lewd or lustful way.”","zh":"“overlasciviously”表示“以过分淫荡、猥亵或好色的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively lustful, sexually suggestive, or lewd way.","zh":"以过分淫荡、好色或带有强烈性暗示的方式；过度猥亵地。"},"examples":[{"en":"The character is written as behaving overlasciviously, which makes the scene feel uncomfortable rather than romantic.","zh":"这个角色被写得过于淫荡，使这一幕显得令人不适，而不是浪漫。"},{"en":"The review criticized the film for focusing overlasciviously on the actors’ bodies instead of the story.","zh":"影评批评这部电影过度以性暗示的方式聚焦演员的身体，而不是剧情。"}]}],"synonyms":["overly lasciviously","too lewdly","salaciously","licentiously","lewdly"],"phonetic":"/ˌoʊvɚləˈsɪviəsli/","extraExplanation":["“overlasciviously”由 over-（过度）+ lascivious（好色的、淫荡的）+ -ly（副词后缀）构成，语气较强，常带批评或道德评判色彩。","这个词非常少见；更常见的表达是 “too lasciviously / overly lasciviously / in an overly sexual way”。在正式写作中用它，通常是为了强调“过度、令人反感”的程度。"]}
{"word":"overlasciviousness","summary":{"en":"Overlasciviousness means extreme or excessive sexual suggestiveness or lustfulness.","zh":"overlasciviousness 指“过度的性暗示/好色/淫荡”的状态，多用于较正式或带批评的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being excessively lustful, sexually suggestive, or driven by sexual desire (often used in a moralizing or literary tone).","zh":"过度淫荡、好色或带强烈性暗示的状态（常带道德批评或文学色彩）。"},"examples":[{"en":"The film was criticized for its overlasciviousness rather than for its violence.","zh":"这部电影受到批评主要是因为它过于淫靡，而不是因为暴力场面。"},{"en":"He wrote about the character’s overlasciviousness to show a lack of self-control.","zh":"他描写这个角色的过度好色，是为了表现其缺乏自制力。"}]}],"synonyms":["excessive lust","lewdness","salaciousness","licentiousness","prurience"],"phonetic":"/ˌoʊvɚləˈsɪviəsnəs/","extraExplanation":["这是一个非常少见、偏“造词感”的词：over-（过度）+ lascivious（好色的、淫荡的）+ -ness（名词后缀）。日常英语里更常见的表达是“excessive lust / extreme lewdness / being overly sexual”。","lascivious 常见于文学、新闻评论或较正式的写作，语气通常带批评意味；描述具体行为时也常用 lewd / salacious / obscene 等词。"]}
{"word":"overlash","summary":{"en":"Overlash means to secure something by lashing a rope/strap over it, or the overlying lashing itself.","zh":"overlash 指用绳索/绑带从上方捆扎固定，或指那一道覆盖在上面的捆绑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lash or fasten something over or across something else with a rope, strap, or cord (often to secure a load).","zh":"（用绳索/带子等）从上面捆扎、横跨捆紧（常用于固定货物）。"},"examples":[{"en":"They overlased the tarpaulin to keep the cargo dry.","zh":"他们把防水布从上面捆扎固定，防止货物受潮。"},{"en":"Make sure the boxes are overlased tightly before the truck moves.","zh":"卡车开动前，务必把箱子从上面捆紧。"}]},{"partOfSpeech":"n.","definition":{"en":"an act or loop of lashing that goes over something; an overlying tie-down.","zh":"覆盖在物体上方的一道捆绑；上方的捆扎圈/绑带。"},"examples":[{"en":"Add one more overlash across the top for safety.","zh":"为安全起见，在顶部再加一道捆扎。"}]}],"synonyms":["lash down","tie down","strap down","secure","fasten"],"phonetic":"ˈoʊvərˌlæʃ","extraExplanation":["“overlash”在现代英语中比较少见，更常见的是用“lash down / tie down / strap down”来表达“把东西捆牢固定”。","构词上可理解为 over-（在上方）+ lash（鞭打；用绳索捆扎）。在航海、运输、装载等语境里更容易遇到。","注意不要与“overlap（重叠）”或“lash out（猛烈抨击/突然攻击）”混淆。"]}
{"word":"overlast","summary":{"en":"“Overlast” usually means nuisance/disturbance (especially in Dutch/Belgian English).","zh":"“overlast”通常指“滋扰/扰民/干扰”（多见于荷兰或比利时英语语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mostly in Dutch/Belgian English contexts) nuisance or disturbance caused by someone’s behavior (for example noise, litter, harassment).","zh":"（多见于荷兰/比利时英语语境）滋扰；扰民；给他人带来困扰的行为（如噪音、垃圾、骚扰等）。"},"examples":[{"en":"Residents complained about noise overlast from late-night parties.","zh":"居民抱怨深夜派对带来的噪音扰民。"},{"en":"The city introduced new rules to reduce overlast in the neighborhood.","zh":"市政府推出新规定来减少社区里的滋扰行为。"},{"en":"Report any overlast to the local council or building management.","zh":"如遇任何滋扰情况，请向当地市政部门或物业管理报告。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to burden or oppress; to trouble someone heavily.","zh":"（罕见/古义）使负担沉重；压迫；使某人深受困扰。"},"examples":[{"en":"He felt overlaste(d) by debts and responsibilities.","zh":"他觉得被债务和责任压得喘不过气来。"}]}],"synonyms":["nuisance","disturbance","harassment","annoyance","public nuisance"],"phonetic":"ˈoʊvərlæst","extraExplanation":["“Overlast”在现代标准英语里并不常用；它更像是从荷兰语借入的词（荷兰语 overlast），在荷兰/比利时的英文公告、新闻或政府文件中常见，意思接近“nuisance / disturbance / public nuisance（扰民、滋扰）”。","如果你是在英美语境写作，通常用：nuisance（滋扰/扰民）、disturbance（干扰）、harassment（骚扰）、noise complaint（噪音投诉）等会更自然。"]}
{"word":"overlate","summary":{"en":"“Overlate” is a rare/nonstandard word meaning “too late.” In most modern writing, use “too late,” “late,” or “overdue.”","zh":"“overlate”是罕见/非标准用法，意思是“太晚”。现代英文中通常改用“too late / late / overdue”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard) Too late; later than acceptable or expected.","zh":"（罕见／非标准用法）太晚的；晚于可接受或预期的时间。"},"examples":[{"en":"By the time we arrived, the response was overlate and the opportunity was gone.","zh":"等我们到的时候，反应已经太晚了，机会也没了。"},{"en":"If payment is overlate, a fee may be added.","zh":"如果付款太晚，可能会加收费用。"}]}],"synonyms":["too late","late","overdue"],"phonetic":"/ˌoʊvɚˈleɪt/","extraExplanation":["“overlate”在现代英语中非常少见，很多情况下会被认为是不自然或不正确的表达。更常用的说法是：too late（太晚）、late（迟到/晚的）、overdue（逾期的，尤用于账单/作业/付款）。","如果你是在写正式英文（邮件、作业、简历等），建议避免使用“overlate”，改用更常见的词更清晰、也更地道。"]}
{"word":"overlateness","summary":{"en":"“Overlateness” means excessive lateness—being much later than is acceptable.","zh":"“overlateness”表示“过度迟到”，即比可接受范围晚很多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or more-than-acceptable lateness; being very late beyond what is normal or allowed.","zh":"过度迟到；超出正常或允许范围的迟到。"},"examples":[{"en":"The meeting started late because of his overlateness.","zh":"会议开始晚了，因为他过度迟到。"},{"en":"Overlateness can damage trust at work, even if you have a good reason.","zh":"即使你有正当理由，过度迟到也可能损害职场信任。"}]}],"synonyms":["excessive lateness","extreme lateness","chronic lateness","tardiness"],"phonetic":"/ˌoʊvɚˈleɪtnəs/","extraExplanation":["“overlateness”不是常见的标准词，更常见的表达是“extreme lateness / excessive lateness / chronic lateness”。它属于由 over-（过度）+ late（迟到）+ -ness（名词后缀）构成的“临时造词/解释性用法”，在正式写作中建议用更常见的替代表达。"]}
{"word":"overlather","summary":{"en":"Overlather means to use too much lather or foam, especially on hair or skin.","zh":"overlather 指（尤指对头发或皮肤）使用过多的泡沫/皂沫，导致“起泡过度”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cover something (especially hair or skin) with too much lather or foam; to lather excessively","zh":"（尤指头发或皮肤）涂上过多泡沫/皂沫；起泡过度"},"examples":[{"en":"If you overlather your hair, it can feel dry and tangled afterward.","zh":"如果你给头发打太多泡沫，之后可能会觉得干涩、打结。"},{"en":"Don’t overlather your face—use a small amount of shaving cream and add water as needed.","zh":"别在脸上抹太多剃须泡沫——用少量剃须膏，不够再加点水。"}]}],"synonyms":["lather too much","overfoam","use too much soap","overapply (soap/cream)"],"phonetic":"/ˌoʊvərˈlæðər/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”（如 overcook 煮过头、overwork 过度劳累）。因此 overlather 就是“lather（起泡/涂皂沫）过头”。","这个词在日常口语中不算特别常见，但在理发、美发、剃须或清洁用品的使用说明里会更容易见到。"]}
{"word":"overlaud","summary":{"en":"Overlaud means to praise someone or something excessively.","zh":"overlaud 指对人或事物进行过度称赞。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to praise someone or something too much; to give more approval than is deserved","zh":"过度称赞；过分颂扬（赞美得超过应有程度）"},"examples":[{"en":"Some reviewers overlauded the film, ignoring its weak story.","zh":"一些影评人把这部电影捧得太高，忽视了它薄弱的剧情。"},{"en":"Don’t overlaud him just because he did one good deed.","zh":"不要因为他做了一件好事就把他夸上天。"},{"en":"Her first novel was overlauded, which made readers expect too much from the second.","zh":"她的第一部小说被过度称赞，这让读者对第二部的期待过高。"}]}],"synonyms":["overpraise","extol excessively","exaggerate praise","overrate"],"phonetic":"/ˌoʊvɚˈlɔd/","extraExplanation":["“overlaud”由 over-（过度）+ laud（赞美）构成，语气通常带一点批评或提醒：不是反对赞美本身，而是强调“赞美得不够客观”。","常见搭配：overlaud a book/film/artist（过度吹捧某本书/电影/艺术家）；be overlauded（被过度称赞）。写作中比“praise too much”更正式、更书面。"]}
{"word":"overlaudation","summary":{"en":"Overlaudation means praising someone or something too much—excessive, often unrealistic praise.","zh":"overlaudation 指对人或事物“赞美过头”的夸赞，常带有不真实或吹捧的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or exaggerated praise; praising someone or something too much.","zh":"过度赞美；夸大其词的称赞。"},"examples":[{"en":"The review felt like overlaudation, ignoring the book’s obvious flaws.","zh":"这篇书评像是在过度赞美，完全忽视了这本书明显的缺点。"},{"en":"She accepted the compliment politely but was uncomfortable with the overlaudation.","zh":"她礼貌地接受了称赞，但对这种过度吹捧感到不自在。"}]}],"synonyms":["excessive praise","overpraise","lavish praise","flattery","adulation"],"phonetic":"/ˌoʊvɚˌlɔːˈdeɪʃən/","extraExplanation":["“overlaudation”由 over-（过度）+ laud（赞美）+ -ation（名词后缀）构成，语气通常带有批评或讽刺：强调赞美“不真实、过头”，而不是单纯的“称赞”。","它在现代英语中不算常用；更常见的表达有 “excessive praise”“overpraise”“lavish praise”“flattery”。"]}
{"word":"overlaudatory","summary":{"en":"Overlaudatory means “excessively praising or flattering,” often implying the praise is exaggerated or insincere.","zh":"overlaudatory 指“过度赞美/过分奉承”，常暗示夸大或不够真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving too much praise; excessively flattering.","zh":"过度赞美的；过分奉承的。"},"examples":[{"en":"The review was so overlaudatory that it didn’t feel trustworthy.","zh":"这篇评论夸得太过头了，让人觉得不太可信。"},{"en":"Her overlaudatory speech embarrassed the winner more than it honored them.","zh":"她过度吹捧的致辞让获奖者更尴尬，而不是感到被表彰。"}]}],"synonyms":["excessively flattering","overpraising","effusive","gushing","fawning"],"phonetic":"/ˌoʊvərˈlɔdəˌtɔri/","extraExplanation":["“over-”表示“过度、太……”，而“laud”意为“称赞”。因此 overlaudatory 字面就是“过度称赞的”。","语气上常带一点批评或怀疑：暗示赞美不够客观、可能夸大其词。","近义词里，flattering 可中性或正面；overlaudatory 更强调“过分、失真”的感觉。"]}
{"word":"overlaugh","summary":{"en":"“overlaugh” means to laugh excessively or longer than appropriate.","zh":"“overlaugh”表示笑得过多、过久或笑过头。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to laugh too much or for too long (more than is appropriate or comfortable)","zh":"笑得太多或太久（超过合适或舒服的程度）"},"examples":[{"en":"I overlaughed at a silly joke and couldn’t stop for a minute.","zh":"我对一个傻笑话笑过头了，一分钟都停不下来。"},{"en":"Don’t overlaugh—you’ll start coughing.","zh":"别笑过头了——你会开始咳嗽的。"}]}],"synonyms":["laugh too much","laugh too hard","overdo it","crack up (informal)"],"phonetic":"/ˌoʊvərˈlæf/","extraExplanation":["“overlaugh”不是日常最常见的词，更常见的说法是“laugh too much/too hard/too long”或“overdo it (on the laughing)”。但在写作中用“over- + 动词”可以强调“过度/过头”的感觉，如“overeat（吃太多）”“overthink（想太多）”。","它通常带有轻微的提醒或自我调侃语气：不是单纯“笑”，而是“笑到影响自己/不合时宜/有点失控”。"]}
{"word":"overlaunch","summary":{"en":"Overlaunch means launching something too much or too aggressively, often causing negative results; it can also mean the excessive launch itself.","zh":"overlaunch 指过度或过于激进地发布/投放，常带负面后果；也可指这次“过度发布/过度投放”本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to launch something too much, too often, or too aggressively (so it causes problems such as waste, confusion, or backlash)","zh":"过度推出；过于频繁或过于激进地发布/投放（以致造成浪费、混乱或反感）"},"examples":[{"en":"The company overlaunched new features, and users felt overwhelmed.","zh":"这家公司过度推出新功能，用户觉得应接不暇。"},{"en":"Don’t overlaunch your marketing campaign—test it in one city first.","zh":"别把营销活动过度铺开——先在一个城市测试。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessive or overly aggressive launch (of a product, campaign, or project)","zh":"过度发布；过度投放（产品/活动/项目的“发布行为”本身）"},"examples":[{"en":"The product’s overlaunch created supply shortages and customer frustration.","zh":"这次产品的过度发布导致供货紧张，也让顾客很沮丧。"},{"en":"After the overlaunch, the team had to pause and fix key issues.","zh":"过度发布之后，团队不得不停下来修复关键问题。"}]}],"synonyms":["launch too aggressively","overpromote","oversaturate","overrelease","push too hard"],"phonetic":"/ˌoʊvɚˈlɔntʃ/","extraExplanation":["“overlaunch”不是常见的标准词，更像商业、产品、营销语境里的临时用词（由 over- + launch 组合）。正式写作中可以改用更常见的表达，如：launch too aggressively / overpromote / release too frequently（过于激进发布/过度宣传/发布过于频繁）。","语感上它强调“启动/发布”这一步做得过头，常隐含负面结果：资源被摊薄、信息噪音变大、用户疲劳、团队支持不过来等。"]}
{"word":"overlave","summary":{"en":"Overlave is a rare, poetic verb meaning “to wash over” or “to cover like waves.”","zh":"overlave 是一个罕见、偏文学的动词，意思是“冲刷而过”或“像海浪一样覆没/淹没”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare/poetic) To wash over; to cover with water as waves do.","zh":"（罕用/诗歌用语）冲刷而过；（如海浪般）淹没、覆没。"},"examples":[{"en":"The tide overlaved the rocks, leaving them shining in the sun.","zh":"潮水冲刷过岩石，让它们在阳光下闪闪发亮。"},{"en":"Mist overlaved the valley at dawn.","zh":"黎明时分，薄雾像水波一样笼罩着山谷。"}]}],"synonyms":["wash over","bathe","inundate","engulf","flood"],"phonetic":"/ˌoʊvɚˈleɪv/","extraExplanation":["“overlave”非常少见，多出现在较旧或带诗意的英语里。它可以理解为“over-（在……之上）+ lave（冲洗、沐浴；古语/文学用）”，整体意思接近“wash over / bathe / inundate（冲刷、浸润、淹没）”。","现代英语里更常用的表达是：waves washed over… / the water covered… / the tide inundated…。如果你是在作业或正式写作中遇到它，通常可以用这些更常见的词替换。"]}
{"word":"overlavish","summary":{"en":"Overlavish means “too lavish”—excessively luxurious or overly generous.","zh":"overlavish 意为“过于奢华/过度慷慨”，强调“太过头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too generous or too luxurious; excessive in giving, spending, or decoration","zh":"过分奢华的；过度慷慨的；铺张过头的"},"examples":[{"en":"The wedding decorations felt overlavish for such a small venue.","zh":"对于这么小的场地来说，婚礼布置显得过分奢华。"},{"en":"Some critics said the company’s holiday bonuses were overlavish during a difficult year.","zh":"一些批评者说，在艰难的一年里，公司发放的节日奖金过度慷慨。"}]}],"synonyms":["too lavish","excessively lavish","overly generous","extravagant","opulent (often for appearance)"],"phonetic":"/ˌoʊvɚˈlævɪʃ/","extraExplanation":["“overlavish”由前缀 over-（“过度”）+ lavish（“奢华的/慷慨的”）构成，意思直观，但在现代英语里不算常见；更常用的表达是“too lavish”或“excessively lavish”。在正式写作中也常用“extravagant（奢侈的/挥霍的）”来替代。"]}
{"word":"overlavishly","summary":{"en":"“Overlavishly” means “too lavishly; excessively.” It often suggests criticism (more than is appropriate).","zh":"“overlavishly”表示“过于奢华/过度铺张地”，常带有批评意味，强调“超过合适的程度”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too lavish; excessively generous or showy.","zh":"过于奢华地；过度慷慨或铺张地。"},"examples":[{"en":"The wedding was overlavishly decorated, and the family later struggled with the bills.","zh":"婚礼布置得过于奢华，结果家里后来为账单发愁。"},{"en":"He praised her overlavishly, making the compliments feel a little insincere.","zh":"他对她夸得过头了，让赞美听起来有点不真诚。"}]}],"synonyms":["too lavishly","overly lavishly","excessively","extravagantly","overgenerously"],"phonetic":"/ˌoʊvərˈlævɪʃli/","extraExplanation":["“overlavishly”在现代英语中非常少见，更多时候人们会说“too lavishly”或“overly lavishly”。","结构上是 over-（过度）+ lavish（奢华的/慷慨的）+ -ly（副词），语气通常带有批评：强调“多到不合适”。"]}
{"word":"overlavishness","summary":{"en":"Overlavishness means being too lavish—excessive luxury, generosity, or decoration.","zh":"overlavishness 指“过度奢华/过分铺张”，即奢华、慷慨或装饰程度过头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too lavish; excessive richness, generosity, or decoration that goes beyond what is needed or appropriate","zh":"过度奢华；过分铺张（在金钱、装饰或慷慨程度上超过需要或得体范围）"},"examples":[{"en":"The hotel’s overlavishness made the rooms feel more like a museum than a place to rest.","zh":"这家酒店过度奢华，让房间更像博物馆而不是休息的地方。"},{"en":"Some critics felt the film’s costumes crossed from beauty into overlavishness.","zh":"一些评论家认为这部电影的服装从美感变成了过度奢华。"}]}],"synonyms":["excess","extravagance","overindulgence","opulence (too much)","superfluity"],"phonetic":"/ˌoʊvɚˈlævɪʃnəs/","extraExplanation":["“overlavishness”是由前缀 over-（“过度”）+ lavishness（“奢华；慷慨”）构成的派生名词，表达“超出适当程度的奢华/铺张”。这个词不算常见，写作中更常用的表达是 “excessive luxury / too much lavishness / overindulgence”。","语感上它常带有批评意味：暗示“好看/大方”已经变成了“浪费、浮夸或不合时宜”。常见搭配语境包括：wedding（婚礼）、decorations（装饰）、spending（开销）、lifestyle（生活方式）。"]}
{"word":"overlax","summary":{"en":"“Overlax” (informal) means to relax too much and become less alert or productive.","zh":"“overlax”（非正式）指过度放松，导致不够警觉或效率下降。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal, nonstandard) To relax too much, especially in a way that makes you careless, less alert, or less productive.","zh":"（非正式/不标准用法）过度放松；放松到变得不警觉、懒散或效率下降。"},"examples":[{"en":"If you overlax before the exam, you might forget to review the key points.","zh":"如果你在考试前过度放松，可能会忘记复习重点。"},{"en":"He overlaxed on the weekend and missed his Monday deadline.","zh":"他周末放松过头，错过了周一的截止日期。"},{"en":"Try to rest, but don’t overlax when you’re driving long distances.","zh":"可以休息，但长途开车时别放松过头。"}]}],"synonyms":["over-relax","relax too much","get too relaxed","slack off (informal)"],"phonetic":"/ˌoʊvərˈlæks/","extraExplanation":["“overlax”在标准英语里不常见，更多是口语里把“over-（过度）+ relax（放松）”直接拼在一起的写法。更常见、更自然的表达是：over-relax（带连字符）、relax too much、get too relaxed。","“over-”这个前缀表示“过度/超过适当程度”，常见搭配还有：overthink（想太多）、overwork（过度工作）、overeat（吃太多）。"]}
{"word":"overlaxative","summary":{"en":"“Overlaxative” means having an excessively strong laxative effect.","zh":"“overlaxative”表示“泻药作用过强、导致排便过度”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an overly strong laxative effect; causing too much diarrhea or bowel movement.","zh":"泻药作用过强的；导致腹泻或排便过度的。"},"examples":[{"en":"That dose was overlaxative—I had stomach cramps all afternoon.","zh":"那个剂量泻得太厉害了——我整个下午都肚子绞痛。"},{"en":"If the medicine feels overlaxative, reduce the dose and call your doctor.","zh":"如果药物让你觉得泻得过度，请减少剂量并联系医生。"}]}],"synonyms":["overly laxative","too strong (as a laxative)","excessively laxative"],"phonetic":"/ˌoʊvərˈlæksətɪv/","extraExplanation":["“overlaxative”不是很常见的标准词，更常见的写法是加连字符的“over-laxative”，或直接说“too strong a laxative / overly laxative effect”。在医学或药品说明里更常见的表达是“excessive laxative effect（过强泻下作用）”。","构词上：over- 表示“过度”，laxative 指“泻药/通便的”。因此 overlaxative 强调“泻过头了”的结果（如腹泻、腹痛、脱水风险）。"]}
{"word":"overlaxly","summary":{"en":"“overlaxly” means “too laxly/too leniently,” but it is uncommon; “too lax” or “too leniently” is more natural.","zh":"“overlaxly”可理解为“过于松懈/过于宽松地”，但不常见；更自然的是“too lax”或“too leniently”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an overly lax way; too loosely or too leniently (not strict enough)","zh":"过于松懈地；过于宽松/放任地（不够严格）"},"examples":[{"en":"The rules were enforced overlaxly, so people stopped taking them seriously.","zh":"规则执行得过于松懈，所以大家渐渐不当回事了。"},{"en":"If you grade overlaxly, students may not learn what they need.","zh":"如果评分过于宽松，学生可能学不到他们需要掌握的东西。"}]}],"synonyms":["too leniently","too loosely","with too much leniency","overly leniently","not strictly enough"],"phonetic":"ˌoʊvɚˈlæksli","extraExplanation":["“overlaxly”不是常见的标准英语拼写，读者可能会把它当作拼写错误。更自然、更常用的表达是：**too lax**, **overly lax**, **too leniently**, **with too much leniency**, **too loosely**。","构词上可以理解为 **over-（过度）+ lax（松的/不严格的）+ -ly（副词）**，因此含义容易猜到，但在正式写作中建议改用更地道的说法以避免误解。"]}
{"word":"overlaxness","summary":{"en":"“Overlaxness” means too much laxness or leniency.","zh":"“overlaxness”指过度松懈或过分宽松。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive laxness; too much leniency or lack of strictness (often in rules, discipline, or standards).","zh":"过度松懈；过分宽松、缺乏应有的严格（常指制度、纪律或标准）。"},"examples":[{"en":"Some teachers worry that overlaxness in classroom rules can lead to more disruptions.","zh":"一些老师担心课堂规则过度宽松会导致更多干扰。"},{"en":"The report blamed safety problems on overlaxness in inspections.","zh":"报告将安全问题归咎于检查中的过度松懈。"}]}],"synonyms":["excessive laxity","too much leniency","permissiveness","over-permissiveness","lack of strictness"],"phonetic":"/ˌoʊvɚˈlæksnəs/","extraExplanation":["“overlaxness”并不是非常常见的词，更常见的表达是“excessive laxity / too much leniency / over-permissiveness”。它由前缀“over-（过度）”+“laxness（松懈、宽松）”构成，语气通常带有批评或担忧。"]}
{"word":"overlay","summary":{"en":"“Overlay” means to cover something with a layer or to add a layer (often digital) on top of something else; it can also mean the layer itself.","zh":"“Overlay”指在某物上覆盖/叠加一层（常见于数字图像、视频、地图等），也可指这种覆盖层/叠加层本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place a layer of something on top of another thing, often so it covers it partly or completely","zh":"（在某物上）覆盖/铺上一层（常指部分或完全盖住）"},"examples":[{"en":"She overlaid the cake with chocolate frosting.","zh":"她在蛋糕上覆了一层巧克力糖霜。"},{"en":"The map overlays satellite images with road information.","zh":"这张地图把道路信息叠加在卫星图像上。"}]},{"partOfSpeech":"n.","definition":{"en":"a layer or covering placed on top of something else","zh":"覆盖层；叠加层"},"examples":[{"en":"The app adds a weather overlay to the video.","zh":"这个应用在视频上加了一层天气信息叠加层。"},{"en":"Use an overlay to protect the table surface.","zh":"用一层覆盖物来保护桌面。"}]},{"partOfSpeech":"n.","definition":{"en":"a transparent sheet or digital layer used in design, printing, or film to add information or effects on top of an image","zh":"（设计/印刷/影视中的）透明叠片；（数字）图层，用于在图像上添加信息或效果"},"examples":[{"en":"The designer used a text overlay to make the title stand out.","zh":"设计师用文字叠加层让标题更醒目。"},{"en":"In animation, each overlay adds depth to the scene.","zh":"在动画里，每一层叠加都能增加画面的层次感。"}]}],"synonyms":["cover","layer","superimpose","overlap","coat"],"phonetic":"ˌoʊvərˈleɪ","extraExplanation":["“overlay”在数字语境里很常见：比如“HUD overlay（抬头显示叠加层）”“subtitle overlay（字幕叠加）”“UI overlay（界面浮层）”。通常强调“在原有内容上再加一层信息/效果”，而不是替换原内容。","拼写提示：过去式/过去分词常写作 overlaid（也有人用 overlaid/overlayed 两种形式；在较正式的写作里 overlaid 更常见）。"]}
{"word":"overlayed","summary":{"en":"“Overlayed” means “covered/placed on top of something,” especially as a layer or added visual/data effect; it’s a common variant of “overlaid.”","zh":"“overlayed”表示“覆盖/叠加在……之上”，常指图层、视觉效果或数据叠加；它是“overlaid”的常见变体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “overlay”: to cover something by placing another layer, image, or piece of information on top of it (often in design, maps, or software).","zh":"“overlay”的过去式/过去分词：把另一层、图像或信息叠加在某物上（常用于设计、地图或软件）。"},"examples":[{"en":"The designer overlayed a logo on the photo for the poster.","zh":"设计师把标志叠加到照片上，用来做海报。"},{"en":"On the map, the app overlayed traffic data on the route.","zh":"在地图上，应用把交通数据叠加在路线之上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) covered or combined with another layer, image, or effect.","zh":"（形容词）被覆盖/被叠加了另一层图像或效果的。"},"examples":[{"en":"The overlayed text is hard to read against the bright background.","zh":"叠加的文字在明亮背景上很难看清。"},{"en":"We exported an overlayed video with subtitles.","zh":"我们导出了带字幕叠加效果的视频。"}]}],"synonyms":["overlaid","superimposed","layered","covered","laid over"],"phonetic":"/ˌoʊvərˈleɪd/","extraExplanation":["“overlayed”和“overlaid”都可以作“overlay”的过去式/过去分词；在现代英语里“overlaid”更常见、更偏正式，而“overlayed”在技术写作（如软件、影像、UI 领域）里也很常见。写作中若不确定，用“overlaid”通常更稳妥。"]}
{"word":"overlayer","summary":{"en":"An overlayer is a top layer or covering placed over something, or the thing that does the overlaying—used especially in technical/design contexts.","zh":"overlayer 指覆盖在其他东西上面的“覆盖层/上覆层”，也可指用来覆盖的物（或覆盖者），多见于技术或设计语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that overlays something (puts a layer or covering on top of it)","zh":"覆盖者；覆盖物（把一层东西铺在另一层之上的人或物）"},"examples":[{"en":"In the design, the text overlayer makes the title easier to read.","zh":"在这个设计里，文字覆盖层让标题更容易阅读。"},{"en":"The app uses a semi‑transparent overlayer to dim the background.","zh":"这个应用用半透明覆盖层把背景调暗。"}]},{"partOfSpeech":"n.","definition":{"en":"an upper layer placed on top of another layer (in materials, art/design, or geology)","zh":"上覆层；覆盖层（材料、艺术设计或地质中位于上方的一层）"},"examples":[{"en":"A thin plastic overlayer protects the screen from scratches.","zh":"一层薄薄的塑料覆盖层可以保护屏幕不被刮花。"},{"en":"In geology, an overlayer of clay can trap water underneath.","zh":"在地质学中，上覆的黏土层可能把水困在下面。"}]}],"synonyms":["overlay","top layer","covering","upper layer","coating"],"phonetic":"/ˈoʊvərˌleɪər/","extraExplanation":["“overlayer”在日常英语中不算常用，更常见的是“overlay”（作名词/动词都很常见，如 a color overlay；to overlay text on an image）。但在技术语境（界面设计、材料科学、地质描述）里，“overlayer”会用来强调“作为一层结构的上覆层”。"]}
{"word":"overlaying","summary":{"en":"Overlaying means layering something on top of something else, physically or digitally/figuratively.","zh":"Overlaying 指把某物覆盖或叠加在另一物之上，可用于实体覆盖，也常用于地图/设计等数字叠加或抽象意义上的“加上一层”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of overlay) putting one thing on top of another so it covers it partly or completely; layering.","zh":"（overlay 的现在分词）把一层东西覆盖在另一层之上；叠加、加一层。"},"examples":[{"en":"She is overlaying a thin jacket over her dress because it’s chilly.","zh":"天有点冷，她在裙子外面加穿了一件薄外套。"},{"en":"The app is overlaying street names on the map.","zh":"这个应用正在把街道名称叠加到地图上。"}]},{"partOfSpeech":"v.","definition":{"en":"adding something extra on top of an existing situation, often changing how it is understood or felt.","zh":"在原有情况之上再“加上”某种东西（如情绪、意义、因素），从而改变人们的理解或感受。"},"examples":[{"en":"He was overlaying humor on a serious message to make it easier to accept.","zh":"他在严肃的信息上加了一层幽默，让人更容易接受。"},{"en":"The report is overlaying new data onto last year’s results.","zh":"这份报告把新数据叠加到去年的结果上。"}]}],"synonyms":["layering","covering","superimposing","overlapping","adding on"],"phonetic":"/ˌoʊvərˈleɪɪŋ/","extraExplanation":["“overlay”在科技与设计语境中非常常见：比如地图上“叠加”路线/图层（overlay layers），视频里“叠加”字幕或水印（text/logo overlay）。","注意拼写：overlay 的现在分词是 overlaying（保留 y，不变成 i）。"]}
{"word":"overlays","summary":{"en":"“Overlays” can mean multiple covering layers (noun plural) or “covers/superimposes” (verb, third-person singular).","zh":"“overlays” 可以指“多层覆盖物/叠加层”（名词复数），也可以指“覆盖/叠加”（动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of overlay) a layer or covering placed on top of something else, often to add protection, decoration, or extra information.","zh":"（overlay 的复数）覆盖在另一物体上方的一层（覆盖物），常用于保护、装饰或补充信息。"},"examples":[{"en":"The designer tested different color overlays on the photo.","zh":"设计师在照片上测试了不同的颜色叠加层。"},{"en":"Map overlays show bike lanes and subway lines.","zh":"地图叠加层显示自行车道和地铁线路。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of overlay) to cover something with a layer; to place something on top of something else.","zh":"（overlay 的第三人称单数）用一层东西覆盖；把某物放在另一物体上面。"},"examples":[{"en":"A thin sheet of ice overlays the lake in winter.","zh":"冬天湖面覆盖着一层薄冰。"},{"en":"The app overlays directions on the camera view.","zh":"这个应用会把导航指示叠加到相机画面上。"}]},{"partOfSpeech":"vt.","definition":{"en":"To superimpose one image, pattern, or set of data onto another so they can be compared or seen together.","zh":"把一幅图像/图案/数据叠加到另一幅上，以便对比或同时查看。"},"examples":[{"en":"The report overlays this year’s sales numbers with last year’s.","zh":"报告把今年的销售数据与去年的叠加对比。"},{"en":"She overlays tracing paper on the sketch to refine the lines.","zh":"她把描图纸盖在草图上来修改线条。"}]}],"synonyms":["coverings","layers","superimpositions","masks","overprints"],"phonetic":"/ˌoʊvɚˈleɪ/","extraExplanation":["“overlays” 既可能是名词复数（many overlays），也可能是动词第三人称单数（he/she/it overlays）。看句子里是否有主语（it overlays...）或是否在谈“很多层/覆盖物”（these overlays...）来判断。","在科技/设计语境中，overlay 常指“界面叠层/信息叠加”（例如：AR 把指示叠加在镜头画面上；图像软件的 overlay layer 叠加效果）。"]}
{"word":"overlead","summary":{"en":"Overlead means to guide someone too much, or (in typography) to add extra space between lines of text.","zh":"Overlead 指过度引导/带领；在排版中指加大行距（加铅）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lead or guide someone too much, especially in a way that reduces their independence or influences their choices unfairly","zh":"过度带领；过度引导（尤其指让对方失去自主性，或不公平地影响其选择）"},"examples":[{"en":"If you overlead new employees, they may not learn to solve problems on their own.","zh":"如果你对新员工过度带领，他们可能学不会独立解决问题。"},{"en":"The interviewer tried not to overlead the witness with suggestive questions.","zh":"面试官尽量不用带有暗示性的问题去过度引导证人。"}]},{"partOfSpeech":"vt.","definition":{"en":"(printing/typography) to add extra leading (extra vertical space) between lines of text","zh":"（印刷/排版）加大行距；把文字“加铅/加行距”"},"examples":[{"en":"The designer overleaded the paragraph to make the page easier to read.","zh":"设计师把这段文字加大行距，让页面更易读。"},{"en":"If you overlead the body text, the article will look longer and more airy.","zh":"如果你把正文行距加得太大，文章看起来会更长、更空。"}]}],"synonyms":["over-guide","micromanage","lead on","(typography) add leading","increase line spacing"],"phonetic":"/ˌoʊvərˈliːd/","extraExplanation":["“overlead”在日常英语中很少见；更常用的是“lead too much / over-guide / micromanage”，或在法律语境里用“lead (a witness)”表达“诱导”。","排版里的“lead/leading”源自早期活字印刷：用铅条（lead）垫在两行字之间来增加行距，因此“overlead”就是“行距加得过多/加大行距”。","拼写上容易和“overload / mislead”混淆；如果你想表达“误导”，通常用“mislead”而不是“overlead”。"]}
{"word":"overleaf","summary":{"en":"Overleaf means on the reverse side of the page, and in some (especially British) documents it can also mean on the next page.","zh":"Overleaf 表示“在本页背面”，在一些（尤英式）文件中也可指“在下一页”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(in printed documents) on the other side of the same sheet of paper; on the reverse page.","zh":"（印刷文件中）在同一张纸的背面；在背页上。"},"examples":[{"en":"The diagram is printed overleaf.","zh":"图表印在背页上。"},{"en":"Please read the instructions overleaf before you start.","zh":"开始前请先阅读背页上的说明。"}]},{"partOfSpeech":"adv.","definition":{"en":"(in printed documents, especially British English) on the next page.","zh":"（印刷文件中，尤英式英语）在下一页。"},"examples":[{"en":"The full list appears overleaf.","zh":"完整名单见下一页。"},{"en":"See the table overleaf for more details.","zh":"更多细节请看下一页的表格。"}]},{"partOfSpeech":"n.","definition":{"en":"the reverse side of a page (used in formal or publishing contexts).","zh":"（正式/出版语境）一页纸的背面；背页。"},"examples":[{"en":"Sign on the front and write your address on the overleaf.","zh":"请在正面签名，并把地址写在背面。"}]}],"synonyms":["on the reverse","on the back","on the next page","opposite (page)"],"phonetic":"ˈoʊvɚˌlif","extraExplanation":["“Overleaf”常见于表格、合同、说明书等正式文本里，用来避免重复写“on the other side of the page/ on the next page”。","英式英语里，“overleaf”有时指“下一页”，不一定是同一张纸的背面；阅读时可结合排版判断。","“Overleaf”也是一个在线 LaTeX 写作平台的品牌名（专有名词），与上述通用词义不同。"]}
{"word":"overlean","summary":{"en":"Overlean means to lean too far (often dangerously) or to lean over something too much.","zh":"overlean 指“倾得太过（常带危险）”，也可指“探身越过某物倾得太多”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to lean too far, so that you lose balance or are in danger of falling","zh":"身体倾得太过，导致失去平衡或有跌倒危险"},"examples":[{"en":"Be careful not to overlean when you look over the balcony.","zh":"你往阳台外看时小心别倾得太过。"},{"en":"He overleaned on the chair and it tipped backward.","zh":"他椅子上后仰过头，椅子向后翻了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to lean over something (often in an unsafe or awkward way)","zh":"（常指不安全或别扭地）探身到……上方/越过……倾身"},"examples":[{"en":"She overleaned the fence to reach the flowers.","zh":"她探身越过篱笆去够那些花。"},{"en":"Don’t overlean the railing to take a photo.","zh":"别探身压在栏杆外拍照。"}]}],"synonyms":["lean too far","lean over too far","overbalance"],"phonetic":"/ˌoʊvərˈlin/","extraExplanation":["“overlean”是由 over + lean 组合而成，语感上强调“超过安全/正常的倾斜程度”。它不像“overly lean（过于瘦）”那样是形容身材的表达。","在现代英语里，这个词不算特别常见；更口语的说法常用 “lean too far (over)” 或 “lean over too far”。"]}
{"word":"overleap","summary":{"en":"Overleap means to leap over something or to go beyond a limit; it can also mean to surpass something.","zh":"Overleap 指“跃过/越过”或“超出界限”，也可表示“超越、超过”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to go over or beyond something (a limit, rule, obstacle), often by jumping or by skipping past it","zh":"越过；跨越（界限、规则、障碍等），常指跳过或直接越过"},"examples":[{"en":"The deer overleaped the fence and disappeared into the woods.","zh":"那只鹿跃过栅栏，消失在树林里。"},{"en":"In his hurry, he overleaped a few steps in the explanation.","zh":"他赶时间，讲解时跳过了几个步骤。"}]},{"partOfSpeech":"v.","definition":{"en":"to surpass or exceed (someone or something)","zh":"超越；超过（某人或某事）"},"examples":[{"en":"Her latest performance overleaped her previous best.","zh":"她最近的表现超过了自己之前的最好成绩。"}]}],"synonyms":["leap over","jump over","clear","surpass","exceed","overstep"],"phonetic":"/ˌoʊvɚˈliːp/","extraExplanation":["“overleap”带有较强的书面/文学色彩，日常英语里更常用“jump over / leap over / surpass / exceed”。","词源上由“over-（越过）+ leap（跳跃）”构成；在文学描写中常用来营造动作感或强调“越界/超出”。"]}
{"word":"overleaped","summary":{"en":"“Overleaped” means “jumped over” or “skipped/ignored,” and it’s a less common past form of “overleap” (often “overleapt”).","zh":"“overleaped”表示“跳过/越过”或“跳过步骤、无视规定”，是“overleap”的较少见过去式（更常见为“overleapt”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “overleap”: to jump over (something), or to skip/ignore (a rule, step, or limit).","zh":"“overleap”的过去式和过去分词：跳过（某物）；或越过/无视（规则、步骤或限制）。"},"examples":[{"en":"The horse overleaped the fence in one clean jump.","zh":"那匹马干净利落地一跃跳过了栅栏。"},{"en":"In his haste, he overleaped an important step in the process.","zh":"他因为匆忙，跳过了流程中一个重要步骤。"}]}],"synonyms":["jumped over","leapt over","vaulted over","skipped","bypassed","ignored"],"phonetic":"/ˌoʊvərˈliːpt/","extraExplanation":["“overleaped”在现代英语里比较少见，更常见的是“overleapt”（尤其英式写法），美式中也会看到规则变化的“overleaped”。两者意思相同。","“overleap”既可指“实际跳过去”，也常用于比喻：越过界限、无视规定、跳过步骤。写作中要注意语气：比喻用法常带有“鲁莽/不合规”的暗示。"]}
{"word":"overleaping","summary":{"en":"“Overleaping” means jumping over something or going beyond a limit (often literary).","zh":"“overleaping”指“跳过/越过”，也可指“超越界限、逾越（较文学/正式）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"jumping over something (the -ing form of the verb “overleap”)","zh":"跳过某物；越过（动词 overleap 的 -ing 形式）"},"examples":[{"en":"The deer was overleaping the fence in a single bound.","zh":"那只鹿一跃就跳过了篱笆。"},{"en":"She kept overleaping puddles to avoid getting her shoes wet.","zh":"她不停地跳过水坑，避免把鞋子弄湿。"}]},{"partOfSpeech":"vt.","definition":{"en":"going beyond a limit; surpassing or skipping past something (often used in a literary style)","zh":"超越界限；越过或略过某事（常见于文学/较正式表达）"},"examples":[{"en":"In his ambition, he was overleaping his authority.","zh":"在野心驱使下，他正在越权行事。"},{"en":"The story moves quickly, overleaping the character’s childhood.","zh":"故事推进很快，略过了角色的童年。"}]}],"synonyms":["jumping over","leaping over","vaulting over","surpassing","overstepping"],"phonetic":"/ˌoʊvərˈliːpɪŋ/","extraExplanation":["“overleap”在现代英语中不算常用，更常见的说法是“jump over / leap over”表示“跳过”，或用“go beyond / overstep”表示“越界、逾越”。","拼写提示：如果你是想表达“反复跳来跳去”，也可能在找“leaping over（跳过）”；“overleaping”本身通常就是“overleap”的现在分词/动名词。"]}
{"word":"overleaps","summary":{"en":"“Overleaps” means (1) jumps over something or (2) (literary) goes beyond a limit.","zh":"“overleaps” 表示（1）跳过某物；或（2）（文学用法）越出界限、超越限制。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a person or animal) jumps or leaps over something; clears an obstacle in a jump.","zh":"（人或动物）跳过、跃过某物；一跳越过障碍。"},"examples":[{"en":"The deer overleaps the fence in one smooth jump.","zh":"那只鹿一个利落的跳跃就跃过了篱笆。"},{"en":"She overleaps the puddle to keep her shoes dry.","zh":"她跳过水坑，好让鞋子不被弄湿。"}]},{"partOfSpeech":"v.","definition":{"en":"(More literary) goes beyond a limit or boundary; surpasses what is normal, allowed, or expected.","zh":"（较文学用法）越出界限；超越（常规、允许或预期的范围）。"},"examples":[{"en":"His ambition overleaps what his experience can support.","zh":"他的野心超出了他的经验所能支撑的范围。"},{"en":"In anger, she overleaps the rules of polite conversation.","zh":"在愤怒中，她越过了礼貌交谈的规矩。"}]}],"synonyms":["jumps over","leaps over","vaults over","clears","surpasses","oversteps"],"phonetic":"/ˌoʊvɚˈlip/","extraExplanation":["“overleaps” 是动词 “overleap” 的第三人称单数（he/she/it overleaps）。现代英语里更常用的说法通常是 “leaps over” 或 “jumps over”。","“overleap” 带有一点书面/文学色彩，常用来强调“越界、超出限度”的抽象含义。"]}
{"word":"overleapt","summary":{"en":"Overleapt means “jumped over” or, more formally, “went beyond/exceeded,” and it is the past form of the rare verb overleap.","zh":"overleapt 意为“跃过/跳过”，也可较正式地表示“超越/超过”，是较少用动词 overleap 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of overleap) to jump over something.","zh":"（overleap 的过去式/过去分词）跳过、跃过（某物）。"},"examples":[{"en":"The deer overleapt the fence and disappeared into the woods.","zh":"那只鹿跃过篱笆，消失在树林里。"},{"en":"With one quick motion, she overleapt the puddle.","zh":"她一个利落的动作就跳过了水坑。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of overleap) to go beyond or exceed a limit; to surpass (often used in a literary or formal style).","zh":"（overleap 的过去式/过去分词）超越、越过（界限）；超过（常见于文学或较正式语体）。"},"examples":[{"en":"His ambition overleapt all reasonable limits.","zh":"他的野心超越了所有合理的界限。"},{"en":"In her excitement, her words overleapt good manners.","zh":"她太兴奋了，说话有些越矩。"}]}],"synonyms":["leapt over","jumped over","vaulted over","cleared","surpassed","exceeded"],"phonetic":"/ˌoʊvərˈlɛpt/","extraExplanation":["“overleapt”比常见的“jumped over”更有文学色彩；在现代英语里，动词“overleap”本身就不算常用。日常表达更常见的是“jump over / leap over”。","“overleap”的另一种较少见过去式是“overleaped”，但“overleapt”更传统、更常见于书面语或文学语境。"]}
{"word":"overlearn","summary":{"en":"Overlearn means to practice or study something so much that it becomes automatic, or to learn more than required for a task.","zh":"overlearn 指把某事练到自动化、烂熟于心，或学得超出某个任务/考试所需。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to practice or study something so much that you can do it automatically, even under stress or distraction (learn beyond basic mastery)","zh":"过度练习/学到烂熟：把某件事练到几乎不假思索也能做出来（超出基本掌握的程度）"},"examples":[{"en":"Musicians often overlearn difficult passages so they can play confidently on stage.","zh":"音乐家常把难段落练到烂熟，这样上台表演时更有把握。"},{"en":"If you overlearn the safety steps, you’re less likely to forget them in an emergency.","zh":"如果你把安全步骤练到烂熟，遇到紧急情况就不容易忘记。"},{"en":"She overlearned the speech by rehearsing it every day for two weeks.","zh":"她连续两周每天排练，把演讲稿练到烂熟。"}]},{"partOfSpeech":"v.","definition":{"en":"to learn something more than you need for a particular test or task","zh":"学得超出实际需求：为某次考试或任务学得比需要的更多"},"examples":[{"en":"I overlearned the chapter, so the exam felt easy.","zh":"我把那一章学得超出需求，所以考试感觉很轻松。"},{"en":"He tends to overlearn details that won’t be on the quiz.","zh":"他常把小测不会考的细节也学得很深入。"}]}],"synonyms":["master","drill","rehearse","practice intensively","learn by heart"],"phonetic":"/ˌoʊvərˈlɝːn/","extraExplanation":["“overlearn”在学习心理学里很常见，强调“超过刚刚会的程度”，让技能更稳定、在压力下也不容易掉链子。","常见搭配：overlearn a skill / overlearn a routine / overlearn lines（把台词背到烂熟）。","与“memorize”不同：memorize 更偏“记住内容”；overlearn 更偏“反复练到自动化”。","也要注意平衡：如果把时间都花在过度练习旧内容，可能会挤占学习新内容的时间。"]}
{"word":"overlearned","summary":{"en":"Overlearned means learned so well through extra practice that it becomes automatic; it can also be the past form of “overlearn.”","zh":"overlearned 指通过额外练习学得非常熟练、达到自动化；也可作 overlearn 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"learned so thoroughly that it becomes automatic (often by extra practice after you already know it); memorized beyond basic mastery","zh":"学得非常熟练、几乎不需思考就能做出来（通常指在已经会了之后继续反复练习）；熟到自动化"},"examples":[{"en":"She had the speech overlearned, so she could deliver it even when she was nervous.","zh":"她把演讲稿练到滚瓜烂熟，所以即使紧张也能顺利讲出来。"},{"en":"The drummer played the overlearned rhythm without looking at the sheet music.","zh":"鼓手不用看谱就能打出那个早已练到自动化的节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “overlearn”: to practice or study something beyond the point of initial mastery","zh":"“overlearn”的过去式/过去分词：在已经掌握之后仍继续练习或学习，使之更牢固"},"examples":[{"en":"By the end of the week, we had overlearned the vocabulary through daily review.","zh":"到周末时，我们通过每天复习把这些词汇练得非常熟了。"},{"en":"He overlearned the safety steps until he could do them under pressure.","zh":"他把安全步骤反复练到在压力下也能完成。"}]}],"synonyms":["fully memorized","down cold","automatic","well-practiced","thoroughly learned"],"phonetic":"/ˌoʊvərˈlɝːnd/","extraExplanation":["“overlearning（过度学习/超额学习）”常见于心理学与教育学：指在“刚好会做/会背”之后继续练习。研究常发现它能提高长期记忆与在压力下的表现（比如演讲、考试、运动、紧急操作）。","词形上，overlearned 也可写作 overlearnt（较偏英式）。日常写作里更常用 overlearned。"]}
{"word":"overlearnedly","summary":{"en":"“Overlearnedly” means “in a pedantic, overly scholarly way.”","zh":"“overlearnedly”表示“卖弄学问地、过于学术化地（带迂腐意味）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows too much learning or scholarship; pedantically or overly academically.","zh":"以显示过多学问/学术性的方式；卖弄学问地、过于学院派地（带贬义）。"},"examples":[{"en":"He overlearnedly corrected everyone’s grammar during the meeting.","zh":"他在会议上卖弄学问地纠正每个人的语法。"},{"en":"The essay is written overlearnedly, with long quotations that don’t add much.","zh":"这篇文章写得过于学院派，堆了很多其实没什么帮助的长引用。"},{"en":"She replied overlearnedly, using technical terms instead of simple words.","zh":"她回答得很卖弄学问，用术语代替简单的说法。"}]}],"synonyms":["pedantically","pretentiously","pompously","in an overly academic way"],"phonetic":"/ˌoʊvɚˈlɝnɪdli/","extraExplanation":["“overlearnedly”由 over-（过度）+ learned（有学问的）+ -ly（副词后缀）构成，意思不是“学得很牢”，而是“显得过分博学/掉书袋”。","这个词非常少见，日常更常用的替换说法有：pedantically（迂腐地/卖弄学问地）、pretentiously（装腔作势地）、in an overly academic way（过于学术化地）。"]}
{"word":"overlearnedness","summary":{"en":"Overlearnedness is the state of practicing beyond basic mastery so a skill becomes automatic and hard to forget.","zh":"Overlearnedness 指在基本掌握之后继续反复练习，使技能自动化且不易遗忘的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of having practiced something so much that it becomes automatic and very resistant to forgetting.","zh":"过度熟练（通过大量重复练习，使某项技能变得自动化、很不容易忘记的状态）。"},"examples":[{"en":"Daily drills built overlearnedness, so she could play the piece even under pressure.","zh":"每天的重复练习形成了过度熟练，所以她即使在压力下也能把那首曲子弹好。"},{"en":"In emergency training, overlearnedness helps people act quickly without stopping to think.","zh":"在应急训练中，过度熟练能帮助人们不必停下来思考就迅速行动。"}]},{"partOfSpeech":"n.","definition":{"en":"In psychology and education, extra learning beyond basic mastery, often used to improve accuracy and performance in real-life situations.","zh":"（心理学/教育学）在“会了”的基础上继续强化学习，以提升准确性与实战表现的额外学习。"},"examples":[{"en":"The study measured overlearnedness by comparing test scores after mastery and after additional practice.","zh":"这项研究通过比较“掌握后”和“额外练习后”的测试成绩来衡量过度熟练程度。"},{"en":"Typing programs aim for overlearnedness so students can type smoothly while focusing on ideas.","zh":"打字课程追求过度熟练，让学生能在专注内容时也打得流畅。"}]}],"synonyms":["overlearning","automaticity","overpractice (context-dependent)","rote mastery (often negative)"],"phonetic":"ˌoʊvɚˈlɝnɪdnəs","extraExplanation":["“overlearnedness”来自动词 overlearn（过度学习/过度练习）+ 名词后缀 -ness。它常出现在心理学、运动训练、音乐练习与军警/医疗等需要“压力下也不出错”的场景中。","它通常是中性或正面的（强调稳定与自动化）；但在某些语境下也可能带一点负面含义，暗示训练机械、缺少灵活应变或创造性。"]}
{"word":"overleather","summary":{"en":"Overleather is a rare word meaning leather used as an outer covering layer.","zh":"overleather 是个罕见词，指用作外层覆盖的皮革（外皮层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Leather used as an outer covering, especially a piece placed over another material for protection or decoration (for example, in shoemaking or leatherwork).","zh":"（罕见）用作外层覆盖的皮革，尤指覆盖在其他材料之上的皮片，用于保护或装饰（如制鞋或皮具制作中）。"},"examples":[{"en":"The cobbler replaced the cracked overleather on the shoe’s upper.","zh":"鞋匠更换了鞋面上那块开裂的外层皮。"},{"en":"A thin overleather can protect the fabric underneath from wear.","zh":"薄薄的一层外皮可以保护下面的布料免于磨损。"}]}],"synonyms":["outer leather","leather cover","overlay","upper leather"],"phonetic":"ˈoʊvɚˌlɛðɚ","extraExplanation":["“overleather”在现代英语里非常少见，更常用的说法通常是“upper leather”（鞋面皮）、“overlay”（覆盖层/覆面材料）或直接说“a leather cover/outer layer”。如果你是在某篇特定文本、行业手册或方言材料中看到它，欢迎贴出上下文，我可以帮你更准确判断具体指哪一种部件或工艺用皮。"]}
{"word":"overleave","summary":{"en":"Overleave is a rare verb meaning to leave something behind/unused or to leave it too long.","zh":"Overleave 是个罕用动词，表示遗留/留下未用之物，或把某物放置过久。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To leave something unused, untouched, or left behind; to leave over (as a remainder).","zh":"（罕用）留下未用、未动或遗留；（作为剩余）留作余下。"},"examples":[{"en":"After the party, we overleft several unopened bottles in the kitchen.","zh":"派对结束后，我们在厨房里遗留了几瓶没开封的饮料。"},{"en":"Try not to overleave food on your plate if you won’t eat it.","zh":"如果你不打算吃，就尽量别在盘子里剩下太多食物。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To leave something too long (especially in a process), causing an unwanted result.","zh":"（罕用）把某物放置过久（尤指在某个流程中），从而导致不理想的结果。"},"examples":[{"en":"If you overleave the tea, it can taste bitter.","zh":"如果茶泡得太久，味道可能会变苦。"},{"en":"He overleft the laundry in the washer overnight, and it started to smell.","zh":"他把衣服在洗衣机里放了一整夜，结果开始有味道。"}]}],"synonyms":["leave behind","leave over","leave unused","leave too long"],"phonetic":"/ˌoʊvərˈliv/","extraExplanation":["“overleave”在现代英语里非常少见，更多时候人们会用更自然的表达来替代：\n- “leave (something) behind / leave (something) over” 表示“遗留/留下剩余”\n- “leave (something) too long” 表示“放太久”\n因此你可能在旧文献、方言或较古的文本中看到它，而在日常对话与写作中不常用。"]}
{"word":"overleaven","summary":{"en":"Overleaven means to make dough rise too much, or (figuratively) to let something be influenced too strongly by a particular element.","zh":"overleaven 指让面团发过头；也可比喻某事物被某种因素影响过度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make dough rise too much by adding too much yeast or letting it ferment too long (so the texture or flavor becomes less good).","zh":"（因酵母过多或发酵过久而）使面团发得过头，导致口感或风味变差。"},"examples":[{"en":"If you leave the dough overnight in a warm kitchen, you can easily overleaven it.","zh":"如果你把面团在温暖的厨房里放一整夜，很容易让它发过头。"},{"en":"The baker said the bread was overleavened, so it tasted overly yeasty and collapsed in the oven.","zh":"面包师说这批面包发过头了，所以酵母味太重，而且在烤箱里塌陷了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to influence or “saturate” something too strongly with an idea, feeling, or element, often in a harmful or unwanted way.","zh":"（比喻）让某种思想、情绪或因素对事物影响过度、渗透过强，常带有负面或不受欢迎的含义。"},"examples":[{"en":"He worried that anger would overleaven his speech and make it unfair.","zh":"他担心愤怒会让他的发言被“发过头”，从而变得不公正。"},{"en":"The novel is powerful, but some readers feel it is overleavened with moral lessons.","zh":"这部小说很有力量，但有些读者觉得它被道德说教“渗透过度”。"}]}],"synonyms":["overferment","overproof","make too yeasty","oversaturate","overload"],"phonetic":"/ˌoʊvɚˈliːvən/","extraExplanation":["“leaven”原指用酵母等发酵剂让面团膨松；在《圣经》等英语传统文本里也常被用作比喻，表示一种影响力在群体或思想中扩散（可正可负）。“overleaven”在比喻用法中常带贬义，强调“过度影响/过度掺杂”。"]}
{"word":"overleer","summary":{"en":"“Overleer” is not standard English; it usually means “overlearn”: to practice beyond basic mastery until a skill becomes automatic.","zh":"overleer 不是标准英语，通常是想写 overlearn：在已掌握的基础上继续反复练习，直到形成自动化反应。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or nonstandard form; in English, people almost always mean “overlearn.”","zh":"拼写错误或非标准形式；在英语里通常想表达的是 overlearn（过度学习/练到无需思考也能做对）。"},"examples":[{"en":"I think you mean “overlearn,” not “overleer.”","zh":"我觉得你想写的是 overlearn，不是 overleer。"},{"en":"Teachers sometimes ask students to overlearn basic facts so they become automatic.","zh":"老师有时会让学生把基础知识“过度练习”，直到不需要思考也能熟练掌握。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Intended meaning: “overlearn”) To practice or study something beyond basic mastery until it becomes automatic.","zh":"（常指 overlearn）把某项技能或知识练到“自动化”的程度；在已经会的基础上继续反复练习。"},"examples":[{"en":"The pianist overlearned the piece so she could play it under pressure.","zh":"那位钢琴家把曲子练到自动化，所以在压力下也能弹好。"},{"en":"If you overlearn vocabulary, you’ll recognize it faster while reading.","zh":"如果你把词汇练到自动化，阅读时会反应更快。"},{"en":"They overlearned the safety steps to avoid mistakes.","zh":"他们把安全步骤反复练到自动化，以避免出错。"}]}],"synonyms":["overlearn","drill","practice repeatedly","memorize","automatize"],"phonetic":"ˌoʊvərˈlɝn","extraExplanation":["“overleer”本身不是常见或标准英语词形。写作或考试中建议用 overlearn。","overlearn 常见于学习心理学/训练语境，强调“超过刚会的程度继续练”，让反应更稳、更快（例如背乘法表、演奏、急救流程）。","注意它通常是褒义或中性（提高熟练度），但在某些语境也可能暗示“练过头、效率不高”，可根据上下文判断。"]}
{"word":"overleg","summary":{"en":"“Overleg” is a Dutch term meaning consultation or joint discussion to reach a decision.","zh":"“overleg”是荷兰语，表示“商议／协商”，指共同讨论以做决定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Dutch word meaning consultation or deliberation—people discussing together to reach a decision.","zh":"荷兰语词，意思是“商议／协商／讨论”，指大家一起讨论以做出决定。"},"examples":[{"en":"We need some overleg before we decide on the schedule.","zh":"我们在决定时间表之前需要先商议一下。"},{"en":"After overleg with the team, she changed the plan.","zh":"和团队商议后，她调整了计划。"}]}],"synonyms":["consultation","discussion","deliberation","conference","talks"],"phonetic":"/ˈoʊvərˌlɛɡ/","extraExplanation":["“overleg”主要是荷兰语（日常与职场都常见），在英语里并不是标准常用词；你可能会在与荷兰/比利时（弗拉芒语区）相关的公司、文件、或跨文化团队里看到它被直接借用。","更常见的英语表达包括：consultation（正式）、discussion（中性）、deliberation（更强调慎重思考）、talks/negotiations（更偏谈判语境）。"]}
{"word":"overlegislate","summary":{"en":"Overlegislate means to make too many laws or regulate something too strictly.","zh":"overlegislate 指立法过多或通过立法对某事进行过度、过严的管制。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make too many laws or rules about something, or to control it too strictly through legislation","zh":"（通过立法）过度管制；立法过多（把事情管得太细、太严）"},"examples":[{"en":"Some critics say the government is starting to overlegislate in areas that families can manage themselves.","zh":"一些批评者认为，政府开始在本可由家庭自行处理的领域过度立法管制。"},{"en":"When you overlegislate, businesses may spend more time on paperwork than on innovation.","zh":"一旦过度立法，企业可能把更多时间花在文书合规上，而不是创新。"},{"en":"We need smart regulation, not a system that overlegislates every detail.","zh":"我们需要的是明智监管，而不是对每个细节都过度立法的体系。"}]}],"synonyms":["overregulate","overcontrol","micromanage (less formal)","regulate too much"],"phonetic":"/ˌoʊvərˈlɛdʒəˌsleɪt/","extraExplanation":["“over-” 是常见前缀，表示“过度、太多”。因此 overlegislate 常带有批评意味，多用于公共政策、政府监管、商业合规等语境。","常见搭配：overlegislate in/over an area（在某领域过度立法）；overlegislate on an issue（在某议题上立法过多）。"]}
{"word":"overlegislated","summary":{"en":"Overlegislated means “regulated by too many laws.”","zh":"overlegislated 指“受到过多法律/规章管制的（过度立法的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Controlled by too many laws or rules; having excessive regulation.","zh":"被过多法律或规章管制的；规章过度的。"},"examples":[{"en":"Small businesses often complain that their industry is overlegislated.","zh":"小企业常抱怨他们的行业被过度立法（管制太多）。"},{"en":"Some people feel public schools are overlegislated and can’t adapt quickly.","zh":"有些人觉得公立学校受到过多法规限制，难以快速调整。"},{"en":"An overlegislated system can create confusion instead of clarity.","zh":"过度立法的体系可能带来混乱，而不是清晰。"}]}],"synonyms":["overregulated","overcontrolled","overgoverned","rule-bound","bureaucratic"],"phonetic":"/ˌoʊvɚˈlɛdʒəˌsleɪtɪd/","extraExplanation":["这是由 over-（“过度”）+ legislate（“立法”）+ -ed 组成的形容词，常见于政治评论、新闻评论和公共政策讨论中，用来强调“规定太多、管得太细”。","语气通常带批评意味：说某个领域 overlegislated，往往暗示规则繁琐、行政负担重、执行困难，甚至产生反效果。"]}
{"word":"overlegislating","summary":{"en":"Overlegislating means making too many or too-detailed laws, often in a way that creates unnecessary complexity or burden.","zh":"overlegislating 指立法过度：法律法规过多或过于细碎，导致不必要的复杂性和负担。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Making too many laws or regulations, or making laws that are overly detailed and controlling (often causing confusion, inefficiency, or unnecessary burdens).","zh":"（政府/机构）立法过度：制定太多法律法规，或规定过于细碎、管得过宽，常导致混乱、低效或增加不必要负担。"},"examples":[{"en":"Some critics argue that the city is overlegislating, creating rules for problems that could be solved through education instead.","zh":"一些批评者认为这座城市在立法过度：本可通过教育解决的问题，却用层层规定来处理。"},{"en":"Overlegislating can make compliance harder, especially for small businesses with limited staff.","zh":"立法过度会让合规更困难，尤其是对人手有限的小企业。"}]}],"synonyms":["overregulating","overregulation","excessive regulation","micromanaging (by law)"],"phonetic":"/ˌoʊvərˈlɛdʒəˌsleɪtɪŋ/","extraExplanation":["“over-”表示“过度”，加在动词前常带批评意味（如 overreact 反应过度、overthink 想太多）。因此 overlegislating 往往用于公共政策讨论中，强调“用立法解决一切”的倾向可能带来副作用。","常见搭配：accuse someone of overlegislating（指责某人立法过度）；avoid overlegislating（避免立法过度）；a tendency toward overlegislating（立法过度的倾向）。"]}
{"word":"overlegislation","summary":{"en":"Overlegislation means excessive or overly detailed lawmaking that makes the legal system complicated.","zh":"overlegislation 指过度或过于细碎的立法，使法律体系变得复杂难行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The making of too many laws or regulations, or laws that are too detailed, so that the legal system becomes complicated and hard to follow.","zh":"（立法）过度立法；法律/规章数量过多或过于繁琐，导致体系复杂、难以遵守或执行。"},"examples":[{"en":"Some small businesses argue that overlegislation increases costs and makes it harder to operate legally.","zh":"一些小企业认为，过度立法会增加成本，让合法经营更困难。"},{"en":"Critics warned that overlegislation could create confusion for both citizens and law enforcement.","zh":"批评者警告说，过度立法可能会让民众和执法部门都感到困惑。"}]}],"synonyms":["excessive regulation","overregulation","legislative overload","regulatory burden"],"phonetic":"/ˌoʊvərˌlɛdʒəˈleɪʃən/","extraExplanation":["“overlegislation”常见于公共政策与法律评论语境，带有批评意味：说话者通常认为“规则太多/太细”，反而降低效率、增加合规负担，或造成执法不一致。","可与“underregulation（监管不足）”对照理解：前者强调“管得太多太细”，后者强调“管得不够”。"]}
{"word":"overleisured","summary":{"en":"Overleisured means having too much leisure time, often suggesting boredom or aimlessness.","zh":"overleisured 指“过于清闲”，常暗示无聊或缺乏目标。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much free time; not busy enough, sometimes implying boredom, idleness, or lack of purpose.","zh":"过于清闲的；闲暇时间太多的（有时带有无聊、懒散或缺乏目标的含义）。"},"examples":[{"en":"After quitting his job, he felt overleisured and restless.","zh":"辞职之后，他觉得自己过于清闲，反而坐立不安。"},{"en":"Some people imagine retirement is all freedom, but an overleisured life can feel empty.","zh":"有些人以为退休就是彻底自由，但过于清闲的生活也可能让人感到空虚。"},{"en":"The novel portrays an overleisured upper class drifting from party to party.","zh":"这部小说描写了一个过于清闲的上流阶层，在一场场派对之间漂流。"}]}],"synonyms":["idle","underoccupied","at loose ends","unoccupied","leisured"],"phonetic":"/ˌoʊvərˈlɛʒərd/","extraExplanation":["“over-”表示“过度、太多”。“overleisured”不是特别常见的日常词，更常见的说法有：too much time on one’s hands（手头时间太多）、idle（闲散的）、underoccupied（不够忙）。","这个词常出现在社会评论或文学描写里，用来暗示“空闲过多带来的精神问题”，比如无聊、失去方向感，或阶层差异（有的人忙到没时间休息，有的人却‘闲得发慌’）。"]}
{"word":"overlend","summary":{"en":"Overlend means to lend more money than is safe or sensible.","zh":"overlend 指“过度放贷/借出过多”，强调超出安全或合理范围。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To lend too much money, or to lend beyond what is safe or wise.","zh":"过度放贷；借出过多的钱，超过安全或明智的范围。"},"examples":[{"en":"Some banks overlent during the housing boom and later faced heavy losses.","zh":"一些银行在房地产繁荣时期过度放贷，后来遭受了严重损失。"},{"en":"If you overlend to friends, you may not get the money back on time.","zh":"如果你对朋友过度借钱，可能无法按时收回。"}]}],"synonyms":["lend too much","overextend credit","make excessive loans"],"phonetic":"/ˌoʊvɚˈlɛnd/","extraExplanation":["“overlend”常见于金融与新闻语境，尤其指银行在景气时期放贷标准过松、贷款规模过大，导致坏账风险上升。更常见的表达还包括“overextend credit（过度扩张信贷）”或“make risky loans（发放高风险贷款）”。"]}
{"word":"overlength","summary":{"en":"“Overlength” means longer than the normal or allowed length, often used in technical, regulatory, shipping, or film-length contexts.","zh":"“overlength”指长度超过正常或允许范围，常用于技术、法规、运输或电影片长等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"longer than the usual, allowed, or intended length; too long.","zh":"超过通常、允许或预期长度的；过长的。"},"examples":[{"en":"The report was rejected for being overlength and repetitive.","zh":"这份报告因为过长且重复而被退回。"},{"en":"Some theaters won’t schedule an overlength film on busy weekends.","zh":"一些影院在繁忙周末不会排片时长过长的电影。"},{"en":"The manufacturer redesigned the cable to avoid an overlength section.","zh":"制造商重新设计了电缆，以避免出现过长的部分。"}]},{"partOfSpeech":"n.","definition":{"en":"the condition or fact of being longer than the standard or permitted length (used especially in technical, shipping, or regulatory contexts).","zh":"超出标准或许可长度的状态（尤用于技术、运输或法规语境）。"},"examples":[{"en":"The inspection report noted overlength in the rear overhang.","zh":"检查报告指出后部悬伸存在超长问题。"},{"en":"To comply with regulations, the company reduced overlength on the trailer.","zh":"为符合法规，公司缩短了拖车的超长部分。"}]}],"synonyms":["too long","excessively long","overlong","longer-than-allowed","oversize (context-dependent)"],"phonetic":"/ˌoʊvɚˈlɛŋkθ/","extraExplanation":["“overlength”常见于较正式或专业的语境，比如电影/节目时长（片长过长）、运输与车辆管理（超长车辆/超长部件）、工程与制造（尺寸超差）。日常口语里更常说“too long”“longer than expected”。","在道路交通领域，常见搭配有“overlength vehicle（超长车辆）”“overlength load（超长货物）”，有时会与“oversize/overwidth/overheight（超限：超宽/超高）”一起出现。注意：不同地区法规用词可能不同。","词形上，“over-”表示“超过/过度”，加上“length（长度）”构成复合词；也常见写法为“over-length”（加连字符）用于标题或技术文件中。"]}
{"word":"overlent","summary":{"en":"Overlent means having lent too much money (rare; often used in finance).","zh":"Overlent 指“放贷/借出过多”（较少见，多用于金融语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having lent too much money, especially more than is safe or reasonable.","zh":"（少见）借出（放贷）过多的钱，尤指超过安全或合理范围。"},"examples":[{"en":"After the recession, the bank realized it had become overlent and tightened its lending rules.","zh":"经济衰退后，那家银行意识到自己放贷过度，于是收紧了放贷规则。"},{"en":"Small lenders can get overlent if they approve too many risky loans at once.","zh":"小型放贷机构如果一次批准太多高风险贷款，就可能出现放贷过度的情况。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “overlend”: to lend too much.","zh":"“overlend”的过去分词：借出（放贷）过多。"},"examples":[{"en":"The company had overlent to customers and later struggled to collect payments.","zh":"公司对客户赊放过多，后来在收款上遇到困难。"}]}],"synonyms":["overextended","overloaned","overcommitted","stretched (financially)"],"phonetic":"/ˌoʊvərˈlɛnt/","extraExplanation":["“overlent”在现代英语中不太常见，金融语境里更常用的说法是“overextended”（资金/债务过度扩张）或“overloaned”（放贷过度）。","词形来源：over-（过度）+ lend（借出）。在银行/信贷语境中，强调“贷出去的金额或风险敞口太大”，可能导致流动性或坏账风险。"]}
{"word":"overlet","summary":{"en":"Overlet is a rare word: it can mean an old-fashioned bed covering (a coverlet), or (in property/legal contexts) renting out a place beyond what is allowed.","zh":"Overlet 是个罕见词：可指古义的床罩/盖毯（coverlet），也可在房产/法律语境中指违规转租或超范围出租。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A coverlet; an outer bed covering or small blanket spread over a bed.","zh":"（古义）床罩；（铺在床上的）外层盖毯、薄毯。"},"examples":[{"en":"In old texts, an overlet might be embroidered and placed over the sheets.","zh":"在旧文献里，overlet 可能会有刺绣，用来铺在床单上面。"},{"en":"She folded the overlet neatly at the foot of the bed.","zh":"她把床罩整齐地叠好，放在床尾。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, mainly British legal/property use) To rent out (property) in a way that exceeds what is allowed, or to let out too much/too cheaply.","zh":"（罕见，偏英式法律/房产用法）违规转租/超范围出租；或（旧用法）以过低租金出租。"},"examples":[{"en":"The contract forbids the tenant to overlet the flat without written permission.","zh":"合同禁止租客在未经书面许可的情况下违规转租该公寓。"},{"en":"The landlord claimed the house had been overlet to multiple occupants.","zh":"房东称这套房子被超范围出租给了多名住户。"}]}],"synonyms":["coverlet","bedspread","sublet","rent out"],"phonetic":"/ˌoʊvərˈlɛt/","extraExplanation":["“overlet”在现代英语里非常少见；如果你是在房产语境看到它，很多时候和“（未经许可）转租/超额出租”有关，接近 sublet / over-occupy 之意。","如果你想表达“床罩/被单”，现代更常用 coverlet、bedspread、blanket。"]}
{"word":"overlets","summary":{"en":"“Overlets” is a rare form meaning “rents out again (often illegally),” especially double-letting a property.","zh":"“overlets”很少见，主要指把房产再次出租（常含非法“一房多租”的意思）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To rent out (a room or property) again—often improperly—especially when it is already rented to someone else; to “double-let.”","zh":"（罕见）把（房间/房产）再次出租（常指不当行为），尤其是已租给他人还“重复出租/一房多租”。"},"examples":[{"en":"The landlord illegally overlet the apartment to a second tenant.","zh":"房东非法把这套公寓又租给了第二位租客（一房多租）。"},{"en":"If a property is overlet, the new renter may be asked to leave suddenly.","zh":"如果房子被重复出租，新租客可能会被突然要求搬走。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To rent out more space or more units than you actually have available.","zh":"（罕见）超出实际可用数量地出租（例如房源不足却仍出租）。"},"examples":[{"en":"The company overlet its offices and had to move teams into temporary rooms.","zh":"公司把办公室超额出租，最后不得不把团队临时安置到别的房间。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular present form of “overlet.”","zh":"“overlet”的第三人称单数现在时形式。"},"examples":[{"en":"In some scams, a dishonest owner overlets the same room to multiple people.","zh":"在一些骗局中，不诚实的房东会把同一间房重复出租给多人。"}]}],"synonyms":["double-let","rent out again","re-let","sublet (related, but different)"],"phonetic":"/ˌoʊvərˈlɛt/","extraExplanation":["“overlet/overlets”在现代英语里非常少见，多出现在英式英语或与租赁、房产纠纷相关的语境中。日常更常用的表达是：double-let（一房多租）、rent out again（再次出租）、illegally rent to another tenant（非法转租给他人）。","如果你本来想查的是“outlets / overlets / overlay / overlets”等拼写相近的词，也可以告诉我上下文句子，我能帮你确认正确单词。"]}
{"word":"overlettered","summary":{"en":"Overlettered describes someone who is too bookish or overly academic, often sounding pedantic.","zh":"overlettered 指过于书本化、过于学术化而显得学究气（常带批评意味）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much book-learning; overly scholarly or academic in a way that feels pedantic or impractical.","zh":"过于书本化的；学究气的（学问太多而显得迂腐或不切实际）。"},"examples":[{"en":"His overlettered speech impressed the professors but confused everyone else.","zh":"他那过于书本化的演讲让教授们印象深刻，却把其他人都听糊涂了。"},{"en":"She worried that her writing sounded overlettered instead of clear and friendly.","zh":"她担心自己的写作听起来太学究气，而不是清晰亲切。"}]}],"synonyms":["pedantic","bookish","overly academic","scholarly (too scholarly in tone)","learned (overly learned)"],"phonetic":"/ˌoʊvɚˈlɛtɚd/","extraExplanation":["“overlettered”较少见，语气常带一点批评：不是说“读书不好”，而是强调“读得太多、太书面”，导致表达像在炫学问、缺少生活感或不够易懂。","词形上可理解为 over-（过度）+ lettered（有学问的/识字的）。“lettered”原本指“受过教育的、博学的”，加上 over- 就变成“过度博学而显得迂腐”。","常见的更日常替换：pedantic（卖弄学问的）、bookish（书生气的）、overly academic（过于学术化的）。"]}
{"word":"overletting","summary":{"en":"Overletting means renting out a place to too many people or renting it out again without permission.","zh":"Overletting 指把房屋超额出租，或未经许可进行再出租/转租。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of renting out a property (or rooms) to too many people, or beyond what is allowed, causing overcrowding or breaking lease rules","zh":"（房东/承租人）把房屋或房间出租给过多的人，或超出许可范围出租，导致拥挤或违反租约规定"},"examples":[{"en":"The city fined the landlord for overletting the apartment to six tenants.","zh":"市政府因房东把公寓超额出租给六名租客而罚款。"},{"en":"Overletting can create serious safety risks in old buildings.","zh":"在老旧建筑中，超额出租可能带来严重的安全风险。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of renting out something again, especially when you do not have the right to do so (often similar to illegal subletting)","zh":"再次转租/再出租（尤其指没有权利这样做时，常接近“非法转租”）"},"examples":[{"en":"His contract prohibited overletting without the owner's written permission.","zh":"合同禁止在未经房主书面同意的情况下再转租（overletting）。"},{"en":"They discovered the overletting only after the neighbors complained about noise.","zh":"直到邻居投诉噪音，他们才发现有人在违规转租。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of overlet: to rent out to too many people or beyond what is permitted","zh":"overlet 的现在分词：把房屋超额出租或超出许可范围出租"},"examples":[{"en":"The tenant was overletting the spare rooms to tourists.","zh":"这名租客把空房间超额转租给游客。"}]}],"synonyms":["overcrowding","over-occupancy","overleasing","double-letting","illegal subletting"],"phonetic":"/ˌoʊvərˈlɛtɪŋ/","extraExplanation":["“overletting”在房地产/租赁语境里更常见于英式或法律/政策文本中，含义通常偏负面：要么是“超额出租导致拥挤”，要么是“未经允许的再出租/转租”。在日常英语里，人们更常说 overcrowding、illegal subletting、over-occupancy 等。"]}
{"word":"overlewd","summary":{"en":"“Overlewd” means excessively lewd or too sexually explicit for the situation.","zh":"“overlewd”指“过于猥亵/过于色情露骨”，在特定场合显得不合适。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively sexual, vulgar, or obscene; more sexually explicit than is acceptable in a given context.","zh":"过于猥亵的；过于色情、粗俗或下流的（在特定场合显得不合适）。"},"examples":[{"en":"The comedian was asked to tone down a few jokes that felt overlewd for a family audience.","zh":"喜剧演员被要求把几段对家庭观众来说过于猥亵的笑话收敛一点。"},{"en":"Some viewers complained that the ad was overlewd and didn’t match the brand’s image.","zh":"一些观众抱怨这则广告过于色情，和品牌形象不符。"}]}],"synonyms":["overly lewd","too lewd","excessively lewd","too explicit","obscene"],"phonetic":"/ˌoʊvɚˈluːd/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”；“lewd”本身指“猥亵的、淫秽的”。“overlewd”并不是非常常见的标准词汇，更常见的说法是“too lewd / overly lewd / excessively lewd”。在网络评论、吐槽或内容分级讨论中更容易见到。","语域提示：这个词带有强烈的评价色彩，使用时往往是在批评某段内容“尺度太大”。正式写作中可考虑用更中性的表达（如“too sexually explicit”）。"]}
{"word":"overlewdly","summary":{"en":"Overlewdly means “in an excessively lewd or indecent way.”","zh":"overlewdly 意为“以过分下流／猥亵的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly lewd or sexually suggestive way; more obscene or indecent than is acceptable in the situation.","zh":"以过分下流或带强烈性暗示的方式；比场合所能接受的更猥亵、不雅。"},"examples":[{"en":"The comedian spoke overlewdly, and many audience members felt uncomfortable.","zh":"那位喜剧演员说得过分下流，让不少观众感到不舒服。"},{"en":"The comments were written overlewdly and were removed by the moderators.","zh":"这些评论写得过分猥亵，被版主删除了。"}]}],"synonyms":["too lewdly","vulgarly","obscenely","indecently","crassly"],"phonetic":"/ˌoʊvɚˈluːdli/","extraExplanation":["“overlewdly”比较少见，属于“over-（过度）+ lewd（下流的）+ -ly（副词）”的构词方式。更常见的表达是“too lewdly / in an overly lewd way / in a vulgar manner”。","语域提示：这个词带有较强的负面评价，常用于批评某人的言行“越界”或“不合时宜”。"]}
{"word":"overlewdness","summary":{"en":"Overlewdness means being excessively sexually crude or indecent.","zh":"overlewdness 指“过度淫秽／过分下流”，强调露骨内容超过合适界限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive lewdness; behavior, speech, or content that is more sexually crude or indecent than is acceptable in a given context.","zh":"过度淫秽／过分下流；在特定语境中显得过于露骨、粗俗或不雅的性相关言行或内容。"},"examples":[{"en":"The editor cut several lines because their overlewdness would distract readers from the story.","zh":"编辑删掉了几句，因为它们过于淫秽，会让读者偏离故事本身。"},{"en":"Some viewers complained that the comedy relied on overlewdness rather than clever jokes.","zh":"一些观众抱怨这部喜剧靠过度下流的内容，而不是巧妙的笑点。"}]}],"synonyms":["excessive lewdness","crudeness","vulgarity","indecency","obscenity"],"phonetic":"/ˌoʊvɚˈluːdnəs/","extraExplanation":["“overlewdness”由前缀 over-（“过度”）+ lewd（“淫秽的、下流的”）+ -ness（名词后缀）构成，强调“超过适当界限”。","这是一个较少见、偏书面或评论性的词，更常见的表达有 “excessive lewdness / being too lewd / overly sexual content”。使用时要注意场合与语气，避免对他人造成冒犯。"]}
{"word":"overliberal","summary":{"en":"“Overliberal” means excessively liberal—too permissive, open, or generous in a way that may cause problems.","zh":"“overliberal”指“过于自由（派）的/过分宽松的”，强调宽松到可能带来问题的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too liberal; more open, permissive, or generous than is wise or intended","zh":"过于自由（派）的；过分宽松的；过于慷慨或放任的"},"examples":[{"en":"Some critics say the policy is overliberal and may be abused.","zh":"一些批评者认为这项政策过于宽松，可能会被滥用。"},{"en":"The teacher worried that an overliberal grading system would not reflect real performance.","zh":"老师担心过于宽松的评分制度无法真实反映学生表现。"},{"en":"Courts sometimes reject an overliberal interpretation of the law.","zh":"法院有时会否定对法律过于宽泛的解释。"}]}],"synonyms":["too permissive","overly lenient","too generous","overly broad","overindulgent"],"phonetic":"/ˌoʊvərˈlɪbərəl/","extraExplanation":["“over-”是英语常见前缀，表示“过度/超过适当程度”（如 overconfident 过于自信、overreact 反应过度）。因此 overliberal 通常带有批评意味。","在政治语境里，overliberal 往往是反对者用来形容某些“太偏自由派/太放任”的立场或政策；在日常语境中，也常指“标准太宽、界限太松”。","拼写上可见 overliberal（合写）或 over-liberal（加连字符）；两者含义相同。"]}
{"word":"overliberality","summary":{"en":"Overliberality means being overly generous or overly lenient—more than is sensible.","zh":"overliberality 指“过度慷慨”或“过度宽纵”，超过合理尺度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive generosity or willingness to give money, help, or freedoms—more than is reasonable or wise in a particular situation.","zh":"过度慷慨；过度宽纵（在某种情境下给钱、帮助或自由多到不合理或不明智）。"},"examples":[{"en":"Some critics argued that the charity’s overliberality made it hard to keep enough funds for future emergencies.","zh":"一些批评者认为，这家慈善机构的过度慷慨让它难以为未来的紧急情况保留足够资金。"},{"en":"The policy was praised for compassion, but opponents warned that its overliberality could be abused.","zh":"这项政策因富有同情心而受到称赞，但反对者警告其过度宽纵可能被滥用。"}]}],"synonyms":["excessive generosity","undue leniency","overindulgence","extravagance","too much freedom"],"phonetic":"/ˌoʊvɚˌlɪbəˈrælɪti/","extraExplanation":["“overliberality”由 over-（过度）+ liberality（慷慨、宽宏）构成，语气通常带批评，强调“好心但过了头”。","在公共话语中它既可指“花钱太大方/财政过于宽松”，也可指“规则太宽、处罚太轻”，但都带有“超过应有尺度”的意思。","它不是很常见的日常词，更常见的表达有：excessive generosity / undue leniency / too much freedom。注意它通常不是指政治立场的“自由派（liberal）”，而是指“慷慨/宽容（liberality）”。"]}
{"word":"overliberalization","summary":{"en":"Overliberalization means making a system too liberal or too loosely controlled, often leading to negative consequences.","zh":"overliberalization 指把制度或政策“过度自由化”，管得太松而引发负面后果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of making laws, rules, or a system more liberal (more open or less controlled) to an excessive degree, so that problems or negative effects result.","zh":"（政策、制度等）过度自由化；把管制或限制放得太松，以至于带来问题或负面后果。"},"examples":[{"en":"Some critics say the overliberalization of the financial sector increased the risk of crises.","zh":"一些批评者认为，金融部门的过度自由化增加了危机风险。"},{"en":"The report warns that overliberalization without strong safety nets can widen inequality.","zh":"报告警告说，没有健全社会保障的过度自由化可能会扩大不平等。"}]},{"partOfSpeech":"n.","definition":{"en":"In social or cultural debates, an approach seen as being too permissive or too accepting, especially by people who prefer stricter norms.","zh":"（社会/文化讨论中）被认为过于宽松、过于放任的做法（常带批评色彩）。"},"examples":[{"en":"They blamed overliberalization of school policies for the drop in discipline.","zh":"他们把学校政策的过度宽松归咎于纪律下降。"},{"en":"The article argues that calling every change “overliberalization” oversimplifies a complex issue.","zh":"文章认为，把每一次变化都称为“过度自由化”会过分简化复杂问题。"}]}],"synonyms":["excessive liberalization","over-deregulation","over-permissiveness","too much deregulation"],"phonetic":"/ˌoʊvɚˌlɪbɚələˈzeɪʃən/","extraExplanation":["这个词通常出现在政治与经济语境中，尤其是谈到“liberalization（自由化）”的副作用：例如放松监管（deregulation）、开放市场（market opening）、资本或贸易自由化（capital/trade liberalization）。使用者往往认为改革“走过头”，强调需要配套规则与社会保障。","构词法：over-（过度）+ liberalization（自由化）。由于带有评价色彩，它在正式写作中常与“critics argue / concerns about …”等搭配，用来呈现某一方观点。"]}
{"word":"overliberalize","summary":{"en":"Overliberalize means to make something too liberal or too permissive, often causing problems.","zh":"Overliberalize 指把某事物变得过度自由化或过度宽松，常含批评意味，强调因此带来问题。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something too liberal or too permissive (for example, changing rules, policies, or attitudes so much that it causes problems)","zh":"使（规则、政策或态度）过度自由化、过度宽松（以至于带来问题）"},"examples":[{"en":"Some critics argue that the new policy would overliberalize the market and weaken consumer protections.","zh":"一些批评者认为，新政策会让市场过度自由化，从而削弱消费者保护。"},{"en":"The school tried to modernize its rules, but parents worried it might overliberalize discipline.","zh":"学校试图现代化校规，但家长担心这会让纪律管理过度宽松。"}]}],"synonyms":["make too permissive","loosen too much","deregulate excessively","over-permit"],"phonetic":"/ˌoʊvərˈlɪbərəˌlaɪz/","extraExplanation":["“over-”表示“过度、过分”。“liberalize”意为“使自由化/放宽限制”。合在一起，“overliberalize”常带批评语气，强调“放得太开”导致负面后果。","这个词较少见，常用于政治、经济与政策讨论（如市场监管、移民政策、社会规范）。在写作中也可以用更常见的表达替换，如 “make too permissive / loosen too much”。","美式英语里常用拼写 “-ize”（liberalize），英式英语也常见 “-ise”（liberalise）。"]}
{"word":"overliberalized","summary":{"en":"Overliberalized means made too liberal or too loosely regulated, often as a criticism.","zh":"overliberalized 指“过度自由化/过于宽松监管的”，常带批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often critical) Made too liberal, too permissive, or too loosely regulated—beyond what some people think is reasonable or effective.","zh":"（常含批评）过度自由化的；过于宽松/过于放任的；监管过少而被认为不合理或无效的。"},"examples":[{"en":"Some critics say the education system has become overliberalized and lacks clear standards.","zh":"一些批评者认为教育体系过度自由化，缺乏明确标准。"},{"en":"They argued that the market was overliberalized, allowing risky behavior without enough oversight.","zh":"他们认为市场过度自由化，在缺乏足够监管的情况下纵容了高风险行为。"}]}],"synonyms":["overly permissive","too deregulated","too lax","overly liberal","overrelaxed"],"phonetic":"/ˌoʊvɚˈlɪb(ə)rəˌlaɪzd/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、太……”。因此 overliberalized 通常带有价值判断（多为负面），暗示“自由化/宽松化超过了合适的程度”。","这个词常出现在政治、经济与社会议题中，例如：市场自由化（market liberalization）、政策放松管制（deregulation）、学校/媒体的价值取向等。说话者往往在强调“需要更多规则、边界或监督”。","近义表达有时可用 overly permissive（过于宽容/放任）、too deregulated（监管过少）、too lax（过于松懈）。但它们语气与侧重点不同：overliberalized 更强调“自由化”这一方向本身。"]}
{"word":"overliberalizing","summary":{"en":"Overliberalizing means loosening rules or control too much, more than is wise.","zh":"overliberalizing 指“过度自由化/过度宽松”，即把规则或管控放松得过头。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"making something (a policy, rule, market, or attitude) too liberal or too lenient; loosening control more than is wise or safe","zh":"把（政策、规则、市场或态度）变得过于自由化或过于宽松；放松管制/限制过头"},"examples":[{"en":"Critics argue that overliberalizing the financial system can increase risk.","zh":"批评者认为，对金融体系过度自由化可能会增加风险。"},{"en":"The school worried it was overliberalizing its discipline policy and losing order.","zh":"学校担心在纪律政策上过于宽松，从而失去秩序。"},{"en":"Some voters fear the government is overliberalizing immigration rules.","zh":"一些选民担心政府在移民规定上放得太开。"}]}],"synonyms":["overloosen","be too lenient","over-permit","deregulate too much"],"phonetic":"/ˌoʊvərˈlɪbərəˌlaɪzɪŋ/","extraExplanation":["“over-”表示“过度、过分”，因此 overliberalizing 往往带有批评色彩，暗示“自由化/宽松到不合适的程度”。常见于政治（移民、社会政策）、经济（市场监管、金融）、教育（纪律管理）等语境。","相关词：liberalize（使自由化/放宽管制，中性或积极）；deregulate（放松监管，更偏经济政策用语）；loosen（放松，口语更常见）。"]}
{"word":"overliberally","summary":{"en":"“Overliberally” means doing something too freely or too generously—more than is wise or appropriate.","zh":"“overliberally”表示“过度地、太随意/太慷慨地”，强调超过了合理或明智的程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too much; in an overly generous, permissive, or free way (often suggesting poor judgment or lack of restraint).","zh":"过于；太随意/太慷慨/太放任地（常含“缺乏节制、判断不当”的意思）。"},"examples":[{"en":"The company handed out bonuses overliberally, and later struggled to pay its bills.","zh":"公司奖金发得过于慷慨，后来连账单都快付不起了。"},{"en":"Some people use the word “toxic” overliberally, so it can lose its meaning.","zh":"有些人把“toxic（有毒的/有害的）”这个词用得过于泛滥，结果反而削弱了它的含义。"},{"en":"If you apologize overliberally, others may think you lack confidence.","zh":"如果你道歉道得太频繁，别人可能会觉得你缺乏自信。"}]}],"synonyms":["excessively","too freely","too generously","overly","immoderately"],"phonetic":"/ˌoʊvərˈlɪbərəli/","extraExplanation":["“overliberally” = over-（过度）+ liberally（宽松地/慷慨地）+ -ly（副词）。语气通常带一点批评，表示“用得太多/给得太多/放得太开”。","常见搭配：use/apply (a rule/word) overliberally（过度使用/过度套用），give/hand out overliberally（过度发放），forgive overliberally（过度宽容）。"]}
{"word":"overlicentious","summary":{"en":"“Overlicentious” means excessively licentious—too sexually permissive or morally unrestrained.","zh":"“overlicentious”指“过度放纵的”，常带批评意味（在性或道德上过分不受约束）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively sexually permissive or morally unrestrained; more licentious than is considered acceptable.","zh":"过度放纵的；过于淫逸/放荡的（在性或道德上过分不受约束，超出一般可接受范围）。"},"examples":[{"en":"Some critics called the film overlicentious, saying it relied on shock value rather than storytelling.","zh":"一些评论家称这部电影过于放纵，认为它靠猎奇而不是靠叙事取胜。"},{"en":"He rejected the overlicentious lifestyle he once admired.","zh":"他拒绝了自己曾经向往的那种过度放纵的生活方式。"}]}],"synonyms":["overly licentious","excessively licentious","debauched","dissolute","lewd"],"phonetic":"/ˌoʊvɚˈlaɪʃəs/","extraExplanation":["“overlicentious”不是非常常见的标准词，更常见的表达是“too licentious / overly licentious / excessively licentious”。其中 over- 表示“过度”，licentious 表示“放纵的、道德上不受约束的”，语气往往带有批评色彩。","在文学或评论语境里，licentious 常用来形容作品内容“淫靡/粗俗/放荡”，也可以更广义地指“无视社会规范的放任”。使用时注意语体偏正式，且容易引发价值判断。"]}
{"word":"overlicentiously","summary":{"en":"“Overlicentiously” means ‘in an excessively licentious (sexually unrestrained or morally loose) way.’","zh":"“overlicentiously”意为“以过度放纵（尤其指性方面或道德方面不检点）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively sexually unrestrained, indecent, or morally loose way.","zh":"以过度放纵、淫荡或不端的方式；过分不检点地。"},"examples":[{"en":"The novel was criticized for portraying its characters overlicentiously.","zh":"这部小说因把人物描写得过于放纵而受到批评。"},{"en":"He joked overlicentiously at the party, which made some guests uncomfortable.","zh":"他在聚会上开了过于露骨的玩笑，让一些客人感到不舒服。"},{"en":"The film avoids showing relationships overlicentiously and focuses on emotion instead.","zh":"这部电影避免把关系拍得过于放纵露骨，而更强调情感。"}]}],"synonyms":["too licentiously","in an overly indecent way","in an overly permissive way","lewdly (often stronger/colder)","immodestly"],"phonetic":"/ˌoʊvərlaɪˈsɛnʃəsli/","extraExplanation":["“overlicentiously”由 over-（过度）+ licentious（放纵的、不道德的）+ -ly（副词后缀）构成。它很少见、语气偏书面/批评性，实际写作中更常用的表达是 “too licentiously / in an overly sexual way / in an overly permissive way”（视语境而定）。"]}
{"word":"overlicentiousness","summary":{"en":"Overlicentiousness means excessive, extreme licentious behavior—too morally lax or unrestrained, often with a sexual or rule-breaking implication.","zh":"overlicentiousness 指“过度放纵/过分放荡”，常带批评意味，可涉及性方面或对规则与道德界限的极端不约束。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or extreme licentiousness (behavior that is too sexually unrestrained, morally lax, or disrespectful of rules and social norms)","zh":"过度放纵（在性行为、道德或行为规范上极端不受约束、过分放荡或轻视规则与社会规范）"},"examples":[{"en":"The author was criticized for the novel’s overlicentiousness, which many readers found unnecessary and distracting.","zh":"这位作者因小说中过度放纵而受到批评，许多读者认为这既没必要又分散注意力。"},{"en":"The school’s policy tried to balance freedom of expression with concerns about overlicentiousness in student performances.","zh":"学校政策试图在表达自由与对学生演出过度放纵的担忧之间取得平衡。"}]}],"synonyms":["excess","debauchery","dissoluteness","immorality","license"],"phonetic":"/ˌoʊvɚˈlaɪsənʃəsnəs/","extraExplanation":["这个词非常少见，多用于较正式、带评价色彩的语境。它由 over-（“过度”）+ licentiousness（“放纵、放荡、行为不受约束”）构成，强调“比一般的放纵更过分”。","licentiousness 不一定只指性方面，也可指对规则、礼仪或道德界限的轻慢与放任；overlicentiousness 则是在此基础上再加强批判意味。"]}
{"word":"overlick","summary":{"en":"“Overlick” is rare; it can mean “to lick too much,” but it’s often a misspelling of “overlook.”","zh":"“overlick”很少见；可表示“舔过头/舔太多”，但更常见是把“overlook（忽略；俯瞰）”拼错了。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare / informal) To lick something too much or for too long.","zh":"（罕见/非正式）过度舔；舔得太多或太久。"},"examples":[{"en":"The puppy overlicked his paws until they turned red.","zh":"小狗把爪子舔得太多，直到都发红了。"},{"en":"Try not to overlick the stamp, or the paper may tear.","zh":"别把邮票舔得太湿，不然纸可能会破。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “overlook.”","zh":"常见为“overlook”的拼写错误。"},"examples":[{"en":"If you meant “overlook,” you could say: I overlooked the email.","zh":"如果你想表达“overlook”，可以说：I overlooked the email.（我忽略/漏看了那封邮件。）"},{"en":"They overlooked the park from their balcony.","zh":"他们从阳台俯瞰公园。"}]}],"synonyms":["lick too much","over-lick (hyphenated)","overlook (if that’s what you meant)"],"phonetic":"ˌoʊvɚˈlɪk","extraExplanation":["“overlick”不是常见标准词汇，在词典中通常查不到。偶尔会被用来直译“舔过头”，但更常见的情况是把“overlook（忽略；俯瞰）”拼错了。","如果你是在写作或考试中，建议优先确认是否要用“overlook”。想表达“舔太多”，更自然的说法是“lick too much / over-lick（加连字符更清晰）”。"]}
{"word":"overlie","summary":{"en":"Overlie means “be on top of; cover from above,” and it’s especially common in geology for rock layers.","zh":"Overlie 表示“位于……之上、从上方覆盖”，在地质学中常用来指地层叠覆关系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rest, lie, or be placed on top of something; to cover something by being above it","zh":"（在上方）覆盖在……之上；压在……上面"},"examples":[{"en":"A thick layer of snow overlies the ground in winter.","zh":"冬天厚厚的积雪覆盖着地面。"},{"en":"Her coat overlies the suitcase in the trunk.","zh":"她的外套在后备箱里压在行李箱上面。"}]},{"partOfSpeech":"v.","definition":{"en":"(geology) to lie above another rock layer or formation","zh":"（地质）位于（另一层岩石/地层）之上"},"examples":[{"en":"Sandstone overlies the older limestone in this area.","zh":"在这个地区，砂岩位于更古老的石灰岩之上。"},{"en":"The report explains which layers overlie the coal seams.","zh":"报告解释了哪些地层位于煤层之上。"}]}],"synonyms":["cover","lie on top of","rest on","be above"],"phonetic":"ˌoʊvərˈlaɪ","extraExplanation":["“overlie”常见于较正式或学术语境，尤其是地质学；日常口语里也可用“cover / lie on top of”来表达类似意思。","注意变形：overlie–overlies–overlaid–overlaid；过去式和过去分词是“overlaid”，容易和“overlay”混淆。"]}
{"word":"overlier","summary":{"en":"A rare noun meaning something (often a rock layer) that lies over another thing.","zh":"一个较少见的名词，指覆盖在另一物之上的东西，常用于地质学中表示“上覆层”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that lies on top of or covers something else; in geology, a layer of rock that lies above another layer.","zh":"覆盖在……之上的东西；（地质）上覆层，指位于另一层之上的岩层。"},"examples":[{"en":"In this cliff, a newer rock is the overlier above the older sandstone.","zh":"在这处悬崖里，较新的岩层是覆盖在较老砂岩之上的上覆层。"},{"en":"The ash layer acted as an overlier, protecting what was beneath it.","zh":"火山灰层作为上覆层，保护了下面的物质。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that lies on top of something else (rare).","zh":"（罕见）指在某物之上的人或物。"},"examples":[{"en":"A heavy blanket can be an overlier on a cold night.","zh":"寒冷的夜晚，一条厚毯子可以成为“覆盖在上面之物”。"}]}],"synonyms":["overlying layer","covering layer","cap layer"],"phonetic":"/ˌoʊvɚˈlaɪɚ/","extraExplanation":["“overlier”在现代英语中很少见，多用于地质/技术语境；日常表达更常用“layer above”“overlying layer”“covering layer”。","很多学习者把“overlier”误写成“outlier”（离群值/异类）。如果你想表达“统计中的异常值/不合群的人或事”，正确词通常是“outlier”。","相关常见形容词是“overlying”（上覆的）与“underlying”（下覆的/潜在的）。"]}
{"word":"overlies","summary":{"en":"“Overlies” means “is on top of / covers from above,” often used for layers, especially in geology.","zh":"“overlies”表示“在……之上/覆盖在上方”，常用于描述层状结构，尤其常见于地质语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lie or be placed on top of something; to cover something by being above it","zh":"位于……之上；覆盖在……上面"},"examples":[{"en":"In many places, a layer of soil overlies the rock.","zh":"在很多地方，一层土壤覆盖在岩石之上。"},{"en":"A thin blanket overlies the sheets on the bed.","zh":"床上有一条薄毯子盖在床单上面。"}]},{"partOfSpeech":"v.","definition":{"en":"(geology) to be positioned above another rock layer","zh":"（地质）位于另一岩层之上"},"examples":[{"en":"You can see sandstone that overlies older limestone near the cliff.","zh":"在悬崖附近你能看到砂岩覆盖在更古老的石灰岩之上。"},{"en":"The younger deposits overlie the ancient volcanic rock.","zh":"较年轻的沉积物位于古老火山岩之上。"}]}],"synonyms":["cover","lie over","rest on","overlay"],"phonetic":"ˌoʊvərˈlaɪz","extraExplanation":["“overlies”是动词“overlie”的第三人称单数（he/she/it overlies）。常见于说明文与学术写作，尤其是地质学，用来描述地层的上下关系。","和“overlap（部分重叠）”不同，“overlie”强调“在上方覆盖/压在上面”，通常是上下层的概念，而不一定有“部分相交”的意思。"]}
{"word":"overlift","summary":{"en":"Overlift means to lift more than is safe—often causing strain or injury; less commonly, to lift something too high.","zh":"Overlift 指举得过重（超过安全范围，常导致拉伤或受伤）；较少见时也可指抬得过高。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lift something that is too heavy or lift more than is safe, often causing strain or injury","zh":"（因重量过大或方法不当而）举得过重；用力过度搬举（常导致拉伤或受伤）"},"examples":[{"en":"He overlifted at the gym and hurt his lower back.","zh":"他在健身房举得过重，伤了下背。"},{"en":"Don’t overlift—ask for help with that box.","zh":"别硬搬那么重的箱子，找人帮忙。"}]},{"partOfSpeech":"v.","definition":{"en":"to lift something too much or too high (less common)","zh":"把……抬得过高；抬起过多（较少见）"},"examples":[{"en":"Overlift the lid and it may snap off.","zh":"把盖子抬得太高，它可能会断掉。"},{"en":"The forklift operator overlifted the pallet and bumped the shelf.","zh":"叉车司机抬得过高，撞到了货架。"}]}],"synonyms":["lift too much","lift something too heavy","overexert","strain"],"phonetic":"/ˌoʊvərˈlɪft/","extraExplanation":["“overlift”在日常英语里不算特别常见，更常见的表达是“lift too much / lift something too heavy / overexert yourself”。在健身语境中，它常用来提醒不要因为重量选择不当而受伤。","写作中也常见连字符形式“over-lift”。如果你要表达“违反动作标准、借力举起”，也可以用“lift with poor form / use bad form”。"]}
{"word":"overlight","summary":{"en":"Overlight means overly bright or to make something too brightly lit (often in photos, film, or lighting).","zh":"Overlight 指“过亮/光线过强”，也可作动词表示“把……照得太亮”，多见于摄影、影视或灯光语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too bright; excessively lit (often making details hard to see).","zh":"过亮的；光线过强的（常导致细节看不清）。"},"examples":[{"en":"The photo looks overlight, so the sky lost its details.","zh":"这张照片看起来过亮，所以天空的细节丢失了。"},{"en":"Turn the screen down—it's a bit overlight at night.","zh":"把屏幕亮度调低一点——晚上有点过亮。"}]},{"partOfSpeech":"vt.","definition":{"en":"to light something too strongly; to make a scene or image overly bright.","zh":"使（某物）光线过强；把场景/图像照得过亮。"},"examples":[{"en":"If you overlight the subject, the face can look washed out.","zh":"如果把人物打光打得过强，脸可能会显得发白、没层次。"},{"en":"They overlit the stage, and the actors looked flat.","zh":"他们把舞台灯打得太亮，演员看起来缺少立体感。"}]}],"synonyms":["too bright","overbright","overlit","overexposed","washed out"],"phonetic":"/ˌoʊvɚˈlaɪt/","extraExplanation":["“overlight”在现代英语里不算常用，尤其在日常口语中更常说“too bright”。在摄影/影视语境里，常见替代词有“overexposed（过曝的）”“overlit（灯光过强的）”“washed out（颜色发白/褪色的）”。","拼写上也容易和“overlook（忽视/俯瞰）”“overlight（过亮）”混淆；注意“-light”这里指“光/照明”。"]}
{"word":"overlighted","summary":{"en":"Overlighted means lit too much—either as a verb (“made too bright”) or an adjective (“too brightly lit”).","zh":"overlighted 指“照得过亮”：既可作动词表示“把……照得太亮”，也可作形容词表示“光线过强的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of overlight) to light something too much; to make it excessively bright.","zh":"（overlight 的过去式/过去分词）把……照得过亮；使……光线过强。"},"examples":[{"en":"The photographer overlighted the scene, washing out the colors.","zh":"摄影师把场景打光过强，导致颜色被冲淡了。"},{"en":"The stage was overlighted, so the actors’ faces looked flat on camera.","zh":"舞台灯光太强，所以镜头里演员的脸看起来缺少立体感。"}]},{"partOfSpeech":"adj.","definition":{"en":"too brightly lit; flooded with light.","zh":"照得过亮的；光线泛滥的。"},"examples":[{"en":"The hallway felt overlighted and uncomfortable at night.","zh":"晚上走廊灯光太亮，让人觉得不舒服。"},{"en":"In the overlighted room, it was hard to relax.","zh":"在光线过强的房间里，很难放松。"}]}],"synonyms":["overlit","too brightly lit","over-illuminated","floodlit (context-dependent)","overexposed (photo/video)"],"phonetic":"/ˌoʊvɚˈlaɪtɪd/","extraExplanation":["“overlighted”在现代英语里很少见；更常见的表达是“overlit”或直接说“too brightly lit”。在摄影/视频语境中，也常用“overexposed（曝光过度的）”来描述画面过亮、细节丢失。"]}
{"word":"overlightheaded","summary":{"en":"“Overlightheaded” means feeling unusually or excessively lightheaded (very dizzy or faint).","zh":"“overlightheaded”指异常或过度的头晕（很晕、发昏、像要晕倒）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling more than normally lightheaded; unusually dizzy, faint, or unsteady (often from standing up too fast, dehydration, anxiety, or lack of food).","zh":"比平常更头晕；异常眩晕、发昏或站不稳（常见原因包括起身太快、脱水、焦虑或没吃东西）。"},"examples":[{"en":"After skipping breakfast, I felt overlightheaded and had to sit down.","zh":"没吃早餐后，我头晕得厉害，只好坐下。"},{"en":"The room was hot, and she became overlightheaded while waiting in line.","zh":"房间很闷热，她排队时头晕得更厉害。"},{"en":"If you feel overlightheaded, drink water and stand up slowly.","zh":"如果你头晕得厉害，先喝点水并慢慢站起来。"}]}],"synonyms":["very lightheaded","extremely lightheaded","really dizzy","faint","woozy"],"phonetic":"/ˌoʊvɚˈlaɪtˌhɛdɪd/","extraExplanation":["“overlightheaded”不是很常见的标准词，更自然的表达通常是“very lightheaded / extremely lightheaded / really dizzy”。这里的“over-”表示“过度、太……”，强调程度。","注意区分：lightheaded（头晕、发飘）通常比 dizzy（眩晕、天旋地转）更偏“发轻、要晕倒”的感觉；如果出现胸痛、呼吸困难或持续昏厥等症状，应及时就医。"]}
{"word":"overlightly","summary":{"en":"“Overlightly” means ‘too lightly’—not seriously or carefully enough.","zh":"“overlightly”表示“过于轻率地/太不当回事地”，相当于“too lightly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too light or not serious enough; with too little care, effort, or respect.","zh":"过于轻率地；不够认真地；（对待某事）太随便地。"},"examples":[{"en":"He spoke overlightly about the accident, which upset everyone.","zh":"他对那场事故说得太轻率，惹得大家都很不高兴。"},{"en":"Don’t take your health overlightly—small problems can grow.","zh":"别把健康看得太随便——小问题也可能变严重。"}]}],"synonyms":["too lightly","overly lightly","carelessly","thoughtlessly"],"phonetic":"/ˌoʊvərˈlaɪtli/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overlightly = overly + lightly（太轻率地/太不当回事地）。在现代英语里，更常用的说法是 “too lightly” 或 “overly lightly”。","这个词在日常口语和常见写作中比较少见；如果你想更自然，通常直接说：take it too lightly / treat it too lightly / speak too lightly about it。"]}
{"word":"overlightness","summary":{"en":"Overlightness means an excessive degree of lightness—too light in weight, too bright in tone/color, or too unserious in manner.","zh":"Overlightness 指“过度的轻/亮/轻松”：可能是重量过轻、画面过亮，或语气过于不严肃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too light in weight, amount, or intensity (often in a way that causes a problem).","zh":"过轻；过少；（强度）过弱（常指因此带来问题）。"},"examples":[{"en":"The overlightness of the fabric made it tear easily.","zh":"这种布料过轻，导致它很容易撕裂。"},{"en":"Critics complained about the overlightness of the dessert—sweet but not satisfying.","zh":"评论家抱怨这道甜点“过于清淡”——甜是甜，但不够有满足感。"}]},{"partOfSpeech":"n.","definition":{"en":"excessive brightness or a too-light tone in an image, painting, or design (similar to overexposure).","zh":"（图像/绘画/设计中）过亮；明度过高（类似“曝光过度”）。"},"examples":[{"en":"The photo lost detail because of overlightness in the sky.","zh":"天空区域过亮，照片细节被冲掉了。"},{"en":"Reduce the overlightness so the text is easier to read.","zh":"把明度过高的问题降下来，文字会更清晰易读。"}]},{"partOfSpeech":"n.","definition":{"en":"an overly cheerful, casual, or unserious tone in speech or writing.","zh":"（说话或写作中）过于轻佻/不严肃的语气。"},"examples":[{"en":"The apology sounded insincere because of its overlightness.","zh":"这份道歉因为语气过于轻佻，听起来不真诚。"}]}],"synonyms":["excessive lightness","overbrightness","overexposure","levity","flippancy"],"phonetic":"/ˌoʊvɚˈlaɪtnəs/","extraExplanation":["“overlightness”由前缀 over-（过度）+ lightness（轻、明亮、轻松）构成，但在现代英语里并不算常用词；实际写作中，人们更常用更具体的表达：表示重量过轻可用 “too light”；表示照片过亮更常用 “overexposure / too bright”；表示语气不严肃可用 “flippancy / levity”。","在摄影/后期语境里，如果你想表达“整体明度偏高”，也可以说 “high brightness” 或 “the image is too bright”；若是“高光溢出、细节丢失”，用 “overexposed highlights” 更地道。"]}
{"word":"overlightsome","summary":{"en":"“Overlightsome” means overly cheerful or lighthearted, especially in a way that feels inappropriate or frivolous.","zh":"“overlightsome”表示“过于轻快欢乐的”，常含“显得不合时宜、轻佻”的批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too cheerful or lighthearted in a way that seems inappropriate; frivolously merry.","zh":"过于轻快欢乐的（以至于显得不合时宜）；轻佻的、轻浮欢乐的。"},"examples":[{"en":"His jokes at the memorial felt overlightsome, and a few people looked uncomfortable.","zh":"他在追悼会上开玩笑显得过于轻快欢乐，让一些人感到不舒服。"},{"en":"The novel’s early chapters are charming but slightly overlightsome for such a serious theme.","zh":"这部小说前几章很迷人，但对于如此严肃的主题来说略显轻佻欢乐。"}]}],"synonyms":["too lighthearted","frivolous","giddy","overly cheerful","flippant"],"phonetic":"ˌoʊvɚˈlaɪtsəm","extraExplanation":["“over-”表示“过度、过分”，与“lightsome（轻快的、愉快的）”组合成“overlightsome”。这个词较罕见，带一点旧式/文学色彩，用来批评某种“不合场合的过分轻松”。"]}
{"word":"overliing","summary":{"en":"“Overlying” means ‘on top of; covering,’ and it can also be the -ing form of “overlie.”","zh":"“Overlying”表示“在……之上；覆盖”，也可作动词 overlie 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Lying or placed on top of something else; covering it.","zh":"（形容词）位于……之上；覆盖在……上面的。"},"examples":[{"en":"The overlying soil protects the buried pipes from damage.","zh":"上覆的土壤保护埋在地下的管道不受损坏。"},{"en":"Overlying clouds kept the temperature cool all day.","zh":"上空的云层让气温一整天都很凉爽。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Present participle of “overlie”: to lie on top of or cover something.","zh":"（动词）“overlie”的现在分词：覆盖在……上；位于……之上。"},"examples":[{"en":"A thin layer of sand is overlying the clay.","zh":"一层薄沙覆盖在黏土之上。"},{"en":"In this region, newer rock is overlying older layers.","zh":"在这个地区，较新的岩层覆盖在较老的岩层之上。"}]}],"synonyms":["covering","upper","superior","lying over","overlaying"],"phonetic":"/ˌoʊvərˈlaɪɪŋ/","extraExplanation":["“overliing”通常是拼写错误，正确拼法是 **overlying**（常见于科学/地质/医学语境，如“overlying tissue 上覆组织”“overlying strata 上覆地层”）。","动词原形是 **overlie**（overlie–overlaid–overlaid / overlie–overlain 也可见于较旧或特定用法）；日常英语里更常用 **cover / lie over** 来表达类似意思。"]}
{"word":"overliking","summary":{"en":"Overliking means liking someone or something too much—more than is healthy or reasonable.","zh":"Overliking 指“过度喜欢”，喜欢到不太健康或不太合理的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of liking someone or something too much (excessive liking)","zh":"过度喜欢；太喜欢（对某人或某物的喜欢超过适当程度）"},"examples":[{"en":"Her overliking of online shopping made it hard to save money.","zh":"她对网购的过度喜欢让她很难存下钱。"},{"en":"Overliking a new app can make you ignore its problems.","zh":"太喜欢一个新应用可能会让你忽视它的问题。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overlike”: to like someone or something too much","zh":"“overlike”的现在分词：过度喜欢；太喜欢"},"examples":[{"en":"He’s overliking the attention and forgetting to do his work.","zh":"他太享受（太喜欢）这些关注，结果忘了做工作。"},{"en":"I think I’m overliking this show—I’ve watched it three times.","zh":"我觉得我有点太喜欢这部剧了——我都看了三遍。"}]}],"synonyms":["excessive liking","being too fond of","overattachment","infatuation (often romantic)","obsession (stronger/negative)"],"phonetic":"ˌoʊvərˈlaɪkɪŋ","extraExplanation":["“overliking”不是非常常见的标准词汇；日常表达里更常用“liking something too much / being too fond of … / having an unhealthy attachment to …”。","写作中如果想更自然，也可以改成“excessive liking”或“over-attachment（过度依恋）”，语气更正式。"]}
{"word":"overlimit","summary":{"en":"“Overlimit” means exceeding an allowed limit, especially in transport contexts (weight/size/speed).","zh":"“overlimit”表示“超过规定限制/超限”，常见于运输等行业语境（重量/尺寸/速度等）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to go beyond an allowed or safe limit (such as speed, weight, or time); to exceed a limit","zh":"超过规定或安全的限制（如速度、重量、时间等）；超限"},"examples":[{"en":"The truck was stopped because it was overlimit for weight.","zh":"这辆卡车被拦下了，因为它的载重超限。"},{"en":"If you overlimit the speed, you may get a ticket.","zh":"如果你超速（超过限速），你可能会收到罚单。"}]},{"partOfSpeech":"adj.","definition":{"en":"beyond the permitted limit; over the maximum allowed (often used about size, weight, or speed)","zh":"超出规定上限的；超限的（常指尺寸、重量、速度等）"},"examples":[{"en":"This is an overlimit load and needs a special permit.","zh":"这是超限载荷，需要特殊许可。"},{"en":"Overlimit vehicles must use the designated route.","zh":"超限车辆必须走指定路线。"}]}],"synonyms":["exceed the limit","be over the limit","overweight","oversized","go beyond the maximum"],"phonetic":"/ˌoʊvɚˈlɪmɪt/","extraExplanation":["“overlimit”在一些行业语境（尤其是交通运输、物流、工程）里能看到，意思通常是“超限/超标”。但在更自然的日常英语中，人们更常说“exceed the limit / be over the limit / overweight / oversized / speeding”等，具体用哪个取决于超的是什么。","常见更地道的替换：\n- 重量超限：overweight / exceed the weight limit\n- 尺寸超限：oversized / exceed size limits\n- 速度超限：speeding / exceed the speed limit"]}
{"word":"overline","summary":{"en":"An overline is a line written above text or symbols, especially in math; it can also mean to draw that line.","zh":"overline 指写在文字或符号上方的一条横线（常用于数学等），也可作动词表示“在上方画横线”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Typography/Math) A line drawn above a letter, number, or word to show a special meaning.","zh":"（排版/数学）写在字母、数字或词上方的一条横线，用来表示特定含义。"},"examples":[{"en":"In math, an overline can show a repeating decimal, like 0.3̅.","zh":"在数学里，上横线可以表示循环小数，比如 0.3̅。"},{"en":"The teacher wrote an overline above the variable to mark the average value.","zh":"老师在变量上方加了一条上横线，用来表示平均值。"}]},{"partOfSpeech":"v.","definition":{"en":"To draw a line above (a letter, number, or word).","zh":"在（字母、数字或词）上方画一条横线。"},"examples":[{"en":"Overline the digit to indicate it repeats.","zh":"在数字上方加上横线，表示它是循环的。"},{"en":"In the worksheet, please overline the terms you want to emphasize.","zh":"在练习纸上，请把你想强调的词上方加横线。"}]}],"synonyms":["overbar","vinculum","macron (often longer/linguistics)"],"phonetic":"/ˈoʊvɚˌlaɪn/","extraExplanation":["“overline”常见于数学与工程记号：\n1) 循环小数：0.1̅6̅ 表示 0.1666…\n2) 平均值：\n\\n x̅ 常表示样本平均数（x-bar）。\n3) 集合/逻辑：A̅ 可能表示补集（依领域而定）。\n4) 复数：z̅ 常表示复共轭。\n不同学科约定可能不同，读题时最好看上下文或符号说明。"]}
{"word":"overling","summary":{"en":"“Overling” is not standard English; it’s usually a typo for “overlong” or “overlying.”","zh":"“overling”不是标准英语词，通常是把“overlong”或“overlying”等词写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern usage. It is most often a typo or mishearing of words like “overlong” (too long) or “overlying” (lying on top of).","zh":"不是现代英语中的标准单词。它通常是拼写/听写错误，常见可能想写的是“overlong”（过长的）或“overlying”（覆盖在……上方的）。"},"examples":[{"en":"I couldn’t find “overling” in a dictionary—did you mean “overlong” (too long)?","zh":"我在词典里找不到“overling”——你是不是想写“overlong”（过长的）？"},{"en":"In geology, you might say “the overlying layer” (the layer on top), not “overling.”","zh":"在地质学里一般说“the overlying layer”（上覆地层），而不是“overling”。"}]}],"phonetic":"/ˈoʊvər.lɪŋ/","extraExplanation":["“overling”在英语里没有稳定、通行的词义与用法，所以写作或考试中不建议使用。","如果你能提供原句/上下文（比如你在哪里看到它、前后句是什么），我可以帮你判断最可能的正确词：常见候选包括 overlong（过长的）、overlying（覆盖在上方的）、overlearn（过度学习/死记硬背，较少见）等。"]}
{"word":"overlinger","summary":{"en":"“Overlinger” means someone who stays too long, or the act of lingering longer than appropriate (rare/less common word).","zh":"“Overlinger”指逗留过久的人，或指逗留太久这一行为（较少见用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who stays somewhere longer than is welcome or necessary; someone who lingers too long","zh":"在某处逗留过久的人；待得太久（以至不合时宜）的人"},"examples":[{"en":"He’s a bit of an overlinger at parties—he never seems to notice when people are ready to leave.","zh":"他在派对上有点“赖着不走”——好像从来没察觉大家已经想走了。"},{"en":"The host tried to end the conversation politely, but the overlinger kept talking.","zh":"主人想礼貌地结束谈话，但那位逗留过久的人还在继续聊。"}]},{"partOfSpeech":"vi.","definition":{"en":"to stay longer than is needed or appropriate; to linger too long","zh":"逗留过久；拖延不走"},"examples":[{"en":"Don’t overlinger in the meeting room—another team booked it after us.","zh":"别在会议室里逗留太久——后面还有团队预订了。"},{"en":"She overlingered at the doorway, unsure how to say goodbye.","zh":"她在门口逗留太久，不知道该怎么道别。"}]}],"synonyms":["overstay","linger too long","hang around","overstay one’s welcome"],"phonetic":"/ˌoʊvɚˈlɪŋɡɚ/","extraExplanation":["“overlinger”不是特别常见的标准词，更像是由 over-（过度、太……）+ linger（逗留）临时组合出来的用法；在口语或写作中偶尔会见到，用来带一点幽默或轻微批评的语气。","更常见、自然的表达包括：linger too long（逗留太久）、overstay one’s welcome（待到不受欢迎了还不走）。"]}
{"word":"overlinked","summary":{"en":"Overlinked means something has too many (hyper)links, making it cluttered or unnecessarily connected.","zh":"overlinked 指内容被加了太多（超）链接，显得杂乱或过度关联。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too many links (especially hyperlinks) added to something, so it looks cluttered or is less useful.","zh":"被加入了过多链接（尤指网页超链接）的；链接过多导致内容显得杂乱或降低可用性。"},"examples":[{"en":"The article is overlinked, so it’s hard to focus on the main point.","zh":"这篇文章链接过多，很难集中注意力看重点。"},{"en":"Our landing page became overlinked after we added every related product link.","zh":"我们把所有相关产品链接都加上后，落地页就变得链接过多了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Linked too much to other pages or topics, often in a way that is unnecessary or repetitive.","zh":"过度链接到其他页面或话题的（常指不必要或重复的链接）。"},"examples":[{"en":"Some keywords are overlinked across the site, which can feel spammy.","zh":"网站上一些关键词被过度链接，会让人感觉像在刷链接。"},{"en":"Try not to overlink common words like “home” or “click here.”","zh":"尽量不要过度链接“home”或“click here”这种常见词。"}]}],"synonyms":["too heavily linked","link-heavy","cluttered with links","over-hyperlinked"],"phonetic":"/ˌoʊvɚˈlɪŋkt/","extraExplanation":["“overlinked”常见于网站编辑、SEO（搜索引擎优化）和内容写作语境。一般建议：只在真正能帮助读者时才加链接，避免同一关键词反复链接，或在一段话里塞太多链接，否则会影响阅读体验，也可能被认为是“刻意优化/像广告”。"]}
{"word":"overlip","summary":{"en":"“Overlip” (rare) means to form or be a projecting, overhanging rim/edge, and it can also name that rim/edge.","zh":"“overlip”（较少见）指形成或存在向外突出的悬垂边缘，也可指这种凸缘/外凸边。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to form a projecting edge (a “lip”) that hangs over something; to overlap with an overhanging rim","zh":"形成向外突出的“唇边”，覆盖/悬垂在某物之上；以凸缘向外重叠"},"examples":[{"en":"Over time, ice can overlip the roof edge and make icicles form.","zh":"随着时间推移，冰可能会在屋檐边缘形成外凸的“唇边”，并长出冰柱。"},{"en":"The glaze began to overlip the rim of the cup during firing.","zh":"烧制过程中，釉料开始在杯口边缘外凸并向外溢出。"}]},{"partOfSpeech":"n.","definition":{"en":"a projecting rim or overhanging edge; an overhanging “lip”","zh":"外凸的边缘；悬垂的“唇边”（凸缘）"},"examples":[{"en":"The rock had an overlip that provided a little shelter from the rain.","zh":"那块岩石有一处外凸的边缘，能稍微挡雨。"},{"en":"Check the container’s overlip before sealing the lid.","zh":"盖盖子前先检查容器口部外凸的边缘。"}]}],"synonyms":["overhang","protrude","project","overlap","rim","ledge"],"phonetic":"/ˌoʊvɚˈlɪp/","extraExplanation":["“overlip”属于较少见、偏技术/描述性的词，更多出现在地质、工程、陶艺或材料描述里。日常英语里通常会改用更常见的说法，如：an overhanging edge / a projecting rim / to overhang / to protrude / to overlap the rim。","词形可以直观拆解：over-（在……之上/覆盖）+ lip（边缘像“嘴唇”一样突出的部分）。这里的 lip 是“边缘/凸缘”的意思，不是只指人的嘴唇。"]}
{"word":"overlipping","summary":{"en":"“Overlipping” is not standard; it usually means “overlapping” (partly covering or happening at the same time).","zh":"“overlipping”不是标准用法；通常是想写“overlapping”（部分重叠/同时发生）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard / misspelling) Usually meant to be “overlapping”: covering the same area, time, or topic partly; happening at the same time.","zh":"（非标准拼写/常见拼错）通常指“overlapping（重叠的）”：在面积、时间或话题上部分重合；同时发生。"},"examples":[{"en":"These two meetings are overlapping, so I can’t attend both.","zh":"这两场会议时间重叠，所以我不能都参加。"},{"en":"There is overlapping content in chapters 2 and 3.","zh":"第2章和第3章有重叠的内容。"}]},{"partOfSpeech":"v.","definition":{"en":"(If you meant the verb form) “overlap”: to partly cover the same area; to happen at the same time; to share some features.","zh":"（如果你想表达动词）“overlap”：部分覆盖同一区域；在时间上同时发生；在特征上有部分相同。"},"examples":[{"en":"The shingles overlap to keep rain out.","zh":"瓦片相互搭接以防雨水渗入。"},{"en":"Our responsibilities overlap, so we need to communicate clearly.","zh":"我们的职责有重叠，所以需要清晰沟通。"}]}],"synonyms":["overlapping","intersecting","coinciding","partly shared"],"phonetic":"ˌoʊvɚˈlæpɪŋ","extraExplanation":["“overlipping”在标准英语里非常少见，写作或考试中一般会被当作拼写错误。最常见的目标词是“overlapping”（形容词/现在分词）或“to overlap”（动词）。","如果你是在描述“嘴唇遮住/盖住”的动作，英语更常说“cover (with the lip/lips)”或用具体情境动词，而不是“overlip”。"]}
{"word":"overlisted","summary":{"en":"“Overlisted” most often means priced/listed too high; it can also mean having too many things listed (past form of “overlist”).","zh":"“overlisted”常指标价/挂牌过高；也可指清单列得过多（“overlist”的过去式/过去分词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"listed at a price that is too high (often used for homes, products, or services).","zh":"（尤指房屋、商品或服务）挂牌/标价过高的。"},"examples":[{"en":"The house sat on the market for months because it was overlisted.","zh":"这套房子挂了好几个月都卖不掉，因为挂牌价定得太高了。"},{"en":"If a product is overlisted online, customers will scroll past it.","zh":"如果商品在网上标价过高，顾客往往会直接划走不买。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “overlist”: to put on a list too many items or include things that don’t really belong.","zh":"“overlist”的过去式/过去分词：把太多项目列入清单，或把不该列的也列进去。"},"examples":[{"en":"I overlisted my duties on the resume, and the interviewer asked for proof.","zh":"我在简历里把职责写得太多了，面试官就要求我举证。"},{"en":"They overlisted the ingredients, making the recipe look more complicated than it is.","zh":"他们把配料列得过多，让食谱看起来比实际更复杂。"}]}],"synonyms":["overpriced","listed too high","overvalued","overstated","overinclusive"],"phonetic":"/ˌoʊvɚˈlɪstɪd/","extraExplanation":["“overlisted”在日常英语中不算常见，更常见的说法是“overpriced（定价过高）”或“listed too high（挂牌价太高）”。在房地产语境里，“overlisted”通常指房源挂牌价高于市场合理价，导致“days on market（在售天数）”变长、需要“price cut（降价）”。","在写作或工作场景中，若想表达“清单列得过多/过细”，也可用“overly detailed list（过于详细的清单）”“bloated list（臃肿的清单）”等更自然的表达。"]}
{"word":"overlisten","summary":{"en":"Overlisten means listening too much/too closely (often unhelpfully), and less commonly listening in order to overhear (eavesdrop).","zh":"overlisten 指“过度倾听/听得太仔细（往往不利）”，较少见的用法是“为偷听而听”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to listen too much or too carefully, often past what is helpful (e.g., overanalyzing sounds, words, or feedback)","zh":"过度倾听；听得太多或太仔细（常指不必要地过度在意、反复琢磨所听到的内容）"},"examples":[{"en":"If you overlisten to every tiny mistake in your recording, you’ll never feel satisfied.","zh":"如果你对录音里每个微小的错误都过度倾听，你永远不会觉得满意。"},{"en":"Try not to overlisten to other people’s opinions—focus on the main message.","zh":"尽量别对别人的看法过度倾听——把注意力放在主要信息上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to listen in order to overhear; to eavesdrop by listening closely","zh":"（较少见）为偷听而听；通过仔细听来听到别人不想让你听到的话"},"examples":[{"en":"They were accused of overlistening at the door during the meeting.","zh":"他们被指责在会议时趴在门边偷听。"}]}],"synonyms":["listen too closely","overanalyze","eavesdrop","overhear"],"phonetic":"/ˌoʊvərˈlɪsən/","extraExplanation":["“over-”这个前缀常表示“过度、超出适当范围”，如 overthink（想太多）、overreact（反应过度）、overwork（过度工作）。因此 overlisten 通常带有“听得过头”的语气，暗示这样做可能带来压力或误读。","overlisten 不是最常用的日常词，更常见的表达包括 listen too closely（听得太仔细）、overanalyze what you heard（把听到的东西过度解读）、eavesdrop（偷听，语气更明确）。"]}
{"word":"overlit","summary":{"en":"Overlit means ‘too brightly lit,’ often making a space feel harsh or making images look washed out.","zh":"Overlit 指“光线过强/照明过度”，常让环境显得刺眼，或让照片画面发白、细节丢失。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too brightly lit; having more light than is desirable, often causing details to be washed out or uncomfortable to look at.","zh":"光线过强的；照明过度的（常导致画面细节发白、过曝，或让人看着不舒服）。"},"examples":[{"en":"The hallway was overlit, so the white walls looked harsh and glaring.","zh":"走廊光线过强，白墙看起来很刺眼。"},{"en":"In the photo, her face is overlit and the details around her eyes disappear.","zh":"在这张照片里，她的脸过曝了，眼周的细节都看不清。"},{"en":"The restaurant felt overlit at night, like an office rather than a cozy place to eat.","zh":"这家餐馆晚上灯光太亮，感觉像办公室，不够温馨。"}]}],"synonyms":["too bright","harshly lit","overbright","washed out","overexposed (for photos)"],"phonetic":"/ˌoʊvərˈlɪt/","extraExplanation":["“overlit”在摄影/影视语境中常和“overexposed（过曝）”相关：光线太强或曝光过高，会让高光区域变成一片白，细节丢失。","日常写作里，“overlit”多用于室内空间氛围（刺眼、缺乏舒适感）；想更口语一些也可说“too bright”或“harsh lighting”。"]}
{"word":"overliterarily","summary":{"en":"“Overliterarily” means “in an overly literary, too bookish way,” and it’s rare/nonstandard in everyday English.","zh":"“overliterarily”指“过于文学化/书面化地”，属于较少见、偏非标准的用法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly literary way—using language or style that is too bookish, formal, or “written” for the situation.","zh":"以过于“文学化/书面化”的方式；用词或文风太像书面文章、太讲究，和场合不太匹配。"},"examples":[{"en":"The email was written overliterarily, so it sounded cold and unnatural.","zh":"这封邮件写得过于书面化，所以听起来很冷淡、不自然。"},{"en":"He explained it overliterarily, using long sentences and rare words.","zh":"他解释得太文学化了，用了很长的句子和生僻词。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/nonstandard) To an excessive degree in a literary sense; more literary than necessary.","zh":"（少见/非标准用法）在“文学性”方面过度；比需要的更文学化。"},"examples":[{"en":"The dialogue feels overliterarily polished for two teenagers.","zh":"这段对话对两个青少年来说显得过度雕琢、太文学化了。"}]}],"synonyms":["overly literary","too literary","in a bookish way","overly formal","in an overly formal style"],"phonetic":"/ˌoʊvɚˈlɪtərˌɛrəli/","extraExplanation":["“overliterarily”并不是常见词，更常用的表达是：too literary、overly literary、in an overly literary style。","构词：over-（过度）+ literarily（以文学方式）。因为本身生僻，用在正式写作里可能显得别扭；多见于评论/吐槽写作风格时。"]}
{"word":"overliterariness","summary":{"en":"Overliterariness means an overly literary, ornate writing style that can reduce clarity.","zh":"overliterariness 指“过度文学化”的文风：辞藻或书卷气太重，可能牺牲清晰与易读性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too literary in style—using language that feels overly ornate, bookish, or self-consciously “writerly,” especially when a simpler style would be clearer.","zh":"“过度文学化”的特质——语言风格过于讲究辞藻、书卷气或刻意“像作家在写作”，尤其在本应更清晰简洁的场合会显得不合适。"},"examples":[{"en":"The editor liked the ideas, but the overliterariness made the article hard to follow.","zh":"编辑喜欢这些观点，但文章过度文学化，导致不太好读。"},{"en":"Her speech needed clarity; the overliterariness distracted the audience from the main message.","zh":"她的演讲需要更清楚；过度文学化反而让听众忽略了核心信息。"}]}],"synonyms":["purple prose","overly ornate style","flowery writing","overwritten style","literary excess"],"phonetic":"/ˌoʊvɚˈlɪtərɚinəs/","extraExplanation":["这是一个不太常见、偏“自造/临时造词”的名词（在词典里未必收录）。它由 over-（过度）+ literary（文学的）+ -ness（名词后缀，表示“……的状态/性质”）组成。","常见的替代表达有：purple prose（华丽但堆砌的文风）、overly literary style（过于文学化的风格）、self-indulgent writing（自我陶醉式写作）、too flowery（太花哨）。其中 purple prose 带较强贬义、常用于批评写作。","语感上，这个词多用于写作评语、编辑反馈、文学/媒体评论等语境，强调“风格压过内容”或“为了文采牺牲清晰”。"]}
{"word":"overliterary","summary":{"en":"Overliterary means “too literary in style,” often sounding overly formal, ornate, or bookish for the situation.","zh":"overliterary 指“过于文学化的文风”，往往在特定场合显得太正式、太华丽或太书面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too literary in style—overly concerned with sounding like literature (formal, ornate, or bookish), often at the cost of clarity or naturalness.","zh":"（文风）过于“文学化”的——太追求像文学作品那样正式、华丽或书面，常常影响清晰度或自然表达。"},"examples":[{"en":"The dialogue feels overliterary; real people usually speak more simply.","zh":"这段对话显得过于文学化；现实中人们通常说得更简单。"},{"en":"Her essay is smart, but the language is a bit overliterary for a business report.","zh":"她的文章很聪明，但用语对商业报告来说有点过于文学化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having too many literary references, allusions, or stylistic flourishes in a way that can seem showy or pretentious.","zh":"（引用/修辞）文学典故、暗示或修饰过多，给人卖弄或矫饰的感觉。"},"examples":[{"en":"His speech was overliterary, packed with quotes that many listeners didn’t recognize.","zh":"他的演讲太文学化，塞满了许多听众不认识的引语。"},{"en":"The poem becomes overliterary when the metaphors pile up and the meaning gets lost.","zh":"当隐喻堆得太多、意思反而不清楚时，这首诗就显得过于文学化了。"}]}],"synonyms":["overwritten","too flowery","too formal","too bookish","ornate","pretentious"],"phonetic":"/ˌoʊvɚˈlɪtərɛri/","extraExplanation":["“overliterary”不是特别常见，更常用的表达有：overwritten（写得过度修饰）、too flowery（过于华丽）、too formal（过于正式）、too bookish（太书面/太像书本）、purple prose（华丽但空洞的文风，带贬义）。","语气通常带轻微批评：不是说“有文学性”不好，而是说在某个场景（如口语对话、商务写作、说明文）里显得不自然或不够清楚。"]}
{"word":"overlittle","summary":{"en":"“Overlittle” means “too little / not enough,” and it’s rare and old-fashioned.","zh":"“overlittle”意为“太少/不足”，属于少见、偏古风的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too little; less than is needed or appropriate (often used in a slightly old-fashioned or literary style).","zh":"太少的；不足的（常见于较古风或文学表达）。"},"examples":[{"en":"We brought overlittle water for the hike, so everyone felt thirsty.","zh":"我们带去远足的水太少了，所以大家都口渴。"},{"en":"He showed overlittle patience with beginners.","zh":"他对初学者表现得太缺乏耐心。"}]},{"partOfSpeech":"adv.","definition":{"en":"To an insufficient degree; not enough (rare, old-fashioned).","zh":"不足地；不够地（少见、较古风）。"},"examples":[{"en":"I slept overlittle last night and couldn’t focus in class.","zh":"我昨晚睡得太少，上课无法专心。"}]}],"synonyms":["too little","not enough","insufficient","scant","meager"],"phonetic":"/ˌoʊvɚˈlɪt̬əl/","extraExplanation":["“overlittle”不是现代日常英语中的常用词，更常见的说法是“too little / too few / not enough”。它带有一种较古典或修辞化的味道，有时会出现在旧文本、诗歌或模仿古风的写作里。","注意不要把“overlittle”误当成“a little over（多一点点）”。“overlittle”表达的是“不足、太少”，而不是“稍微超过”。"]}
{"word":"overlive","summary":{"en":"“Overlive” means to outlive someone or to survive an event; it is fairly uncommon in modern English.","zh":"“overlive”表示“比……活得久（outlive）”或“幸存/熬过（survive）”，在现代英语中较少用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to live longer than someone; to outlive someone","zh":"比某人活得久；比某人更长寿"},"examples":[{"en":"She overlived her husband by ten years.","zh":"她比丈夫多活了十年。"},{"en":"Many parents fear they might overlive their children.","zh":"许多父母担心自己可能会比孩子活得久。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remain alive after an event; to survive (something difficult)","zh":"在某事之后仍活着；幸存；熬过（困难）"},"examples":[{"en":"He overlived the accident, but needed months to recover.","zh":"他在那场事故中幸存，但康复花了好几个月。"},{"en":"Some traditions have overlived their original purpose.","zh":"有些传统在原本的用途消失后仍延续至今。"}]}],"synonyms":["outlive","survive","live through","remain alive"],"phonetic":"/ˌoʊvɚˈlɪv/","extraExplanation":["“overlive”在现代英语里不算常用，更常见的同义词是“outlive”（比……活得久）或“survive”（幸存）。在文学或较正式的语境中仍可能看到“overlive”，语气往往更书面、略带古典色彩。"]}
{"word":"overlived","summary":{"en":"“Overlived” means “outlived” or “survived,” and can also mean something continued to exist longer than expected.","zh":"“Overlived”意为“比……活得更久/幸存”，也可指某事物（观念、传统等）持续存在得比预期更久。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of overlive: to live longer than someone or something; to outlive.","zh":"overlive 的过去式/过去分词：比某人或某物活得更久；比……更长寿。"},"examples":[{"en":"She overlived her husband by many years.","zh":"她比丈夫多活了很多年。"},{"en":"The old poet overlived most of his friends.","zh":"那位老诗人比他的大多数朋友都活得更久。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to continue to exist longer than expected, especially for an idea, custom, or style.","zh":"（较少见）持续存在得比预期更久（尤指观念、习俗或风格）。"},"examples":[{"en":"Some outdated traditions have overlived their usefulness.","zh":"一些过时的传统已经“超过了它们的用处”，却仍然存在。"},{"en":"The slogan overlived the movement that created it.","zh":"那句口号比创造它的运动本身存在得更久。"}]}],"synonyms":["outlived","survived","endured","lasted"],"phonetic":"/ˌoʊvɚˈlɪvd/","extraExplanation":["“overlive”在现代英语里相对少见，更常用的是“outlive / survive”。在正式写作或带一点文学色彩的语境中，才更可能看到“overlived”。","第二个意思里常见搭配是“overlive one’s usefulness / purpose”，表示“早已失去用途却仍继续存在”。"]}
{"word":"overliveliness","summary":{"en":"Overliveliness means being too lively or too excited, often in a way that doesn’t fit the situation.","zh":"overliveliness 指“过度活泼/过度兴奋”，常带有“不合场合、太吵闹”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive liveliness; too much energetic or excited behavior (often seen as inappropriate for the situation).","zh":"过度活泼；过分兴奋（常含“不合时宜、太闹”的意味）。"},"examples":[{"en":"The teacher asked the class to calm down because their overliveliness was distracting others.","zh":"老师让全班冷静下来，因为他们的过度活泼影响了别人。"},{"en":"At a formal meeting, his overliveliness made some people uncomfortable.","zh":"在正式会议上，他的过度兴奋让一些人感到不自在。"}]}],"synonyms":["overexcitement","excessive liveliness","hyperactivity","high spirits (sometimes)"],"phonetic":"/ˌoʊvɚˈlaɪvlinəs/","extraExplanation":["“overliveliness”不是常见的标准词汇，更常见的表达是“overexcitement / excessive liveliness / hyperactivity（多用于医学或教育语境）”。在正式写作里，建议用这些更自然的说法。","构词上可理解为 over-（过度）+ liveliness（活泼、生气）。因此语气通常带一点“太过头了”的评价，而不只是中性地描述精力充沛。"]}
{"word":"overlively","summary":{"en":"“Overlively” means too lively or overexcited, often in a way that’s distracting or not appropriate for the situation.","zh":"“overlively”指“过于活跃/过分兴奋”，常含“让人分心或不合时宜”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too lively, energetic, or excited (often in a way that feels inappropriate, distracting, or hard to control)","zh":"过于活跃的；过分兴奋的（常含“不合时宜、让人分心或难以控制”的意味）"},"examples":[{"en":"The kids got overlively after drinking soda at the party.","zh":"孩子们在派对上喝了汽水后变得过于兴奋。"},{"en":"His overlively behavior during the meeting made it hard for others to focus.","zh":"他在会议上过于活跃的表现让别人很难专注。"},{"en":"The puppy is sweet, but a bit overlively for a small apartment.","zh":"这只小狗很可爱，但在小公寓里有点太闹腾了。"}]}],"synonyms":["overly lively","too lively","overexcited","hyper","boisterous"],"phonetic":"/ˌoʊvɚˈlaɪvli/","extraExplanation":["“overlively”由前缀 over-（“过度、太……”）+ lively（“活泼的”）构成，语气通常带一点负面评价，表示“活泼过头”。日常更常用的说法有：too lively / overly lively / hyper / overexcited。","拼写上常见两种：overlively 和 overly lively；后者更常见、更自然。"]}
{"word":"overliver","summary":{"en":"An overliver is someone who lives longer than another person; a survivor, often used in formal or legal contexts.","zh":"overliver 指比他人活得更久的人；可理解为幸存者，常见于较正式或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives longer than someone else (especially a spouse or close relative); a survivor","zh":"比他人活得更久的人（尤指配偶或近亲）；幸存者"},"examples":[{"en":"After the accident, she was the only overliver in the family.","zh":"那场事故后，她成了家里唯一的幸存者。"},{"en":"In the will, the house goes to the overliver of the two sisters.","zh":"在遗嘱中，房子归两姐妹中活得更久的一位所有。"}]}],"synonyms":["survivor","one who outlived (someone)","remainderman (legal, sometimes related)"],"phonetic":"/ˌoʊvɚˈlɪvɚ/","extraExplanation":["“overliver”较少见，更多出现在较正式或法律/遗嘱语境中，用来表达“活得比某人更久的人”。日常英语里更常用的是“survivor”（幸存者）或“the one who outlived the other”（活得更久的那个人）。","它来自动词“outlive/overlive（比……活得久）”。其中“overlive”更偏古旧；现代更常说“outlive”。"]}
{"word":"overlives","summary":{"en":"“Overlives” means “lives longer than” or “outlasts.”","zh":"“overlives”表示“比……活得更久”或“比……持续更久、仍然存在”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to live longer than someone; to survive someone","zh":"比某人活得更久；比某人长寿；在某人之后仍然活着"},"examples":[{"en":"She overlives her husband by many years.","zh":"她比丈夫多活了很多年。"},{"en":"No parent expects to outlive a child, but some sadly do—some even overlive them.","zh":"没有父母会希望自己比孩子活得更久，但有些人不幸真的会——甚至会比孩子更长寿。"}]},{"partOfSpeech":"v.","definition":{"en":"to last longer than something; to remain after something has ended (ideas, customs, buildings, etc.)","zh":"比某事物持续更久；在某事结束后仍然存在（常指观念、习俗、制度、建筑等）"},"examples":[{"en":"Some traditions overlive the reasons they began.","zh":"有些传统延续至今，早已超出了它们最初产生的理由。"},{"en":"His influence overlives his time in office.","zh":"他的影响力在他卸任后仍然持续。"}]}],"synonyms":["outlive","survive","outlast"],"phonetic":"/ˌoʊvɚˈlɪv/","extraExplanation":["“overlives” 是动词 overlive 的第三人称单数（he/she/it overlives）。这个词较偏正式或文学化；日常英语里更常用 outlive（比……活得久）或 survive（幸存）。","常见搭配：overlive someone（比某人长寿）；overlive one’s fame / one’s generation（名声/一代人之后仍被记得或仍有影响）。"]}
{"word":"overliving","summary":{"en":"Overliving means outliving someone or surviving beyond a person, time, or thing.","zh":"overliving 表示比某人活得更久，或在某人/某时代/某事物之后仍然存在、幸存。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of living longer than someone else; outliving someone","zh":"比他人活得更久；比……长寿（outlive）"},"examples":[{"en":"She feared overliving her friends and feeling lonely later in life.","zh":"她害怕自己会比朋友们活得更久，晚年会感到孤独。"},{"en":"In the novel, the king’s curse is overliving everyone he loves.","zh":"在小说里，国王的诅咒是他会比所有所爱之人都活得更久。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of overlive) continuing to live after someone or something; surviving","zh":"（overlive 的现在分词/动名词）在……之后继续活着；幸存"},"examples":[{"en":"Overliving a spouse can be emotionally difficult.","zh":"在配偶去世后继续活着，情感上可能很艰难。"},{"en":"The tradition survived, overliving the empire that created it.","zh":"这一传统延续了下来，甚至在那个创造它的帝国灭亡后仍然存在。"}]}],"synonyms":["outliving","surviving","living on","enduring"],"phonetic":"/ˌoʊvɚˈlɪvɪŋ/","extraExplanation":["“overlive/overliving”在现代英语里不算常用，更常见的说法是“outlive”。在文学或较正式的语境中，它可以带一点沉重或宿命感，用来强调“活得太久、被迫目送他人离去”的情绪。"]}
{"word":"overload","summary":{"en":"Overload means to put too much load, work, or information on something/someone, or the state/amount of being too much to handle.","zh":"Overload 指使某物/某人“超负荷”，也可指“过载/过多的工作量或信息量”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To load something with too much weight, work, or demand; to give more than it can handle.","zh":"使（某物/某人）超负荷；施加过多重量、工作或要求，超过承受能力。"},"examples":[{"en":"Try not to overload the power strip with too many devices.","zh":"尽量不要在插线板上接太多设备，避免超负荷。"},{"en":"The manager overloaded the team with deadlines.","zh":"经理给团队安排了过多的截止日期，导致大家负担过重。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put too much information, decoration, or detail into something, making it confusing or heavy.","zh":"（信息/装饰/细节）堆砌过多；使内容显得臃肿、难理解。"},"examples":[{"en":"Don’t overload your slides with text—use key points.","zh":"别在幻灯片上堆太多文字——用要点就好。"},{"en":"The explanation was overloaded with technical terms.","zh":"这个解释塞满了术语，反而更难懂。"}]},{"partOfSpeech":"n.","definition":{"en":"An excessive load or amount of work/information; too much to handle.","zh":"过载；过多的工作量/信息量，超出可承受范围。"},"examples":[{"en":"I’m dealing with an overload of emails today.","zh":"我今天要处理的邮件多到爆（信息过载）。"},{"en":"The network crashed because of an overload.","zh":"网络因为过载而崩溃了。"}]}],"synonyms":["overburden","overwork","overfill","overwhelm","strain"],"phonetic":"/ˌoʊvərˈloʊd/","extraExplanation":["“over-”表示“过度、超过”，比如 overwork（过度工作）、overeat（吃太多）。所以 overload 很直观：load（负载/装载）+ over-（过度）。","在技术语境里，overload 常指“电路/服务器/系统过载”，接近于“超过容量上限而故障或变慢”。在日常生活里，也常用于“信息过载（information overload）”“工作过载”。"]}
{"word":"overloaded","summary":{"en":"“Overloaded” means having more work or load than can be handled comfortably (for people) or safely/efficiently (for systems).","zh":"“overloaded”表示“超出可承受范围的负担/负载”：对人是事情太多、压力过大；对系统是过载导致变慢或故障。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much work, responsibility, or demand; burdened beyond a comfortable level.","zh":"工作/责任/需求过多的；不堪负荷的；超负荷的。"},"examples":[{"en":"I’m overloaded with homework this week.","zh":"我这周作业多到不堪负荷。"},{"en":"The staff is overloaded, so replies may be slow.","zh":"员工人手超负荷，所以回复可能会慢。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a machine/system/network) Given more load than it can handle, so performance becomes slow or it fails.","zh":"（机器/系统/网络）负载过大，导致变慢或崩溃的。"},"examples":[{"en":"The server was overloaded and the website went down.","zh":"服务器负载过大，网站就宕机了。"},{"en":"Avoid running too many apps at once, or your phone may get overloaded.","zh":"避免同时开太多应用，不然手机可能会过载。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something with too much content, detail, or decoration; overly full or complicated.","zh":"（内容/细节/装饰）过多的；过于繁杂的。"},"examples":[{"en":"The presentation felt overloaded with data.","zh":"这个演示文稿数据太多，显得很臃肿。"},{"en":"Her sentence was overloaded with long clauses.","zh":"她的句子从句太多，读起来很累。"}]}],"synonyms":["overburdened","swamped","overworked","overloaded (system)","overtaxed"],"phonetic":"/ˌoʊvərˈloʊdɪd/","extraExplanation":["“overloaded”来自“over-（过度）+ load（负载/负担）”。既可形容人（事情太多、压力太大），也常用于技术语境（系统过载）。在日常表达里，它比“busy”更强调“多到影响效率/状态”的感觉。"]}
{"word":"overloading","summary":{"en":"Overloading means putting too much load on something (weight, work, electricity), and in programming it also means giving one name to multiple functions/operators with different inputs.","zh":"Overloading 指“超载/过度负荷”（重量、工作量、电学负载等）；在编程里还特指“重载”（同名不同参数的函数/运算符）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting too much weight, work, or responsibility on something or someone so it becomes strained or fails","zh":"超载；过度负荷：给某物/某人施加过多重量、工作量或责任，导致吃不消或出问题"},"examples":[{"en":"Overloading the truck can damage the tires and make driving dangerous.","zh":"卡车超载会损坏轮胎，也会让驾驶变得危险。"},{"en":"The teacher avoided overloading students with homework before the exam week.","zh":"老师避免在考试周前给学生布置过多作业。"}]},{"partOfSpeech":"n.","definition":{"en":"in engineering and electricity, the condition where a machine or circuit receives more load or current than it is designed to handle","zh":"（工程/电学）过载：机器或电路承受的负载或电流超过设计承受范围"},"examples":[{"en":"The fuse blew because of overloading in the circuit.","zh":"由于电路过载，保险丝烧断了。"}]},{"partOfSpeech":"n.","definition":{"en":"in computing and programming, using the same name for different functions/operators so the computer chooses the right one based on the input types (e.g., in C++ or Java)","zh":"（计算机/编程）重载：用同一个名称表示不同的函数/运算符，系统根据参数类型选择合适的版本（如 C++、Java）"},"examples":[{"en":"Method overloading lets you define several functions with the same name but different parameters.","zh":"方法重载允许你定义多个同名但参数不同的函数。"},{"en":"Operator overloading can make code look cleaner, but it should be used carefully.","zh":"运算符重载能让代码更简洁，但要谨慎使用。"}]}],"synonyms":["overburdening","overworking","excess loading","overstrain"],"phonetic":"/ˌoʊvərˈloʊdɪŋ/","extraExplanation":["词形提示：overloading 来自动词 overload（over- “过度” + load “负载/装载/工作量”）。在日常英语里，常见搭配有 overload a truck（使卡车超载）、overload students with homework（让学生作业过多）、information overload（信息过载）。","语域区别：在工程/电学语境中，overloading 常指“电路/设备过载”；在编程语境中，overloading 特指“函数/方法/运算符重载”，与 everyday 的“负担过重”不是同一概念，但核心都有“超过单一承载的范围”这一隐喻。"]}
{"word":"overloads","summary":{"en":"“Overloads” can mean (1) too many demands beyond capacity (noun plural), or (2) the action of putting too much load on something (verb).","zh":"“overloads”既可指“超出承受能力的负荷/超载情况”（名词复数），也可指“使超载、使负担过重”（动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Too many things/people/tasks for a system or person to handle; situations where capacity is exceeded.","zh":"（复数名词）超出系统或个人承受/处理能力的负荷；“超载”的情况。"},"examples":[{"en":"After the storm, the hospital faced patient overloads.","zh":"暴风雨之后，医院面临病人超载的情况。"},{"en":"The website crashed due to traffic overloads during the sale.","zh":"促销期间网站因访问量超载而崩溃。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present tense, third-person singular) Adds too much weight, work, or information; puts more demand on something than it can handle.","zh":"（动词第三人称单数）使负担过重；使超载；给某物施加超过其承受能力的重量/工作量/信息量。"},"examples":[{"en":"This new schedule overloads the team with meetings.","zh":"这个新安排让团队会议过多、负担过重。"},{"en":"Don’t overload your backpack with heavy books.","zh":"不要在背包里塞太多重书，免得超载。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/electronics) Extra methods in programming with the same name but different inputs; or a situation where an electrical/system load becomes too high.","zh":"（计算机/电子）在编程中“重载”：同名但参数不同的方法/函数；或电路/系统负载过高的情况。"},"examples":[{"en":"In C++, the class overloads the + operator to add two objects.","zh":"在 C++ 中，这个类重载了 + 运算符，用来相加两个对象。"},{"en":"The circuit kept tripping because of overloads.","zh":"电路因为过载而反复跳闸。"}]}],"synonyms":["overburdens","overworks","overfills","overcharges","strains"],"phonetic":"/ˈoʊvərˌloʊdz/","extraExplanation":["“overloads”可能是名词复数（overloads）或动词第三人称单数（overloads）。看句子结构判断：前面若有 the/these/many 等，多半是名词；若主语是 he/she/it 或单数名词，多半是动词。","日常英语里更常见的搭配是：information overload（信息过载）、work overload（工作超负荷）、traffic overload（流量过大）。","文学/写作中也常用 overload 来表达“感官或情绪被淹没”的感觉，如：sensory overload（感官过载），强调刺激太多导致不适或难以专注。"]}
{"word":"overloan","summary":{"en":"Overloan means to lend or borrow too much money—more than is safe or manageable.","zh":"Overloan 指过度放贷或过度借贷，即借出或借入的金额超过安全或可承受范围。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lend (someone) more money than is safe, reasonable, or allowed; to make a loan that exceeds proper limits","zh":"（向某人）过度放贷；发放超过安全、合理或规定额度的贷款"},"examples":[{"en":"Some small lenders overloan customers who already have heavy debt.","zh":"一些小型放贷机构会对已负债很重的客户过度放贷。"},{"en":"The bank was criticized for overlending and taking on too much risk.","zh":"这家银行因过度放贷、承担过高风险而受到批评。"}]},{"partOfSpeech":"vi.","definition":{"en":"to borrow more than you can realistically repay (less common)","zh":"（不太常见）过度借贷；借入超过自己实际偿还能力的金额"},"examples":[{"en":"If you overloan, you may struggle to make the monthly payments.","zh":"如果你过度借贷，可能会难以按月还款。"}]}],"synonyms":["overlend","lend too much","overextend credit","overborrow"],"phonetic":"/ˌoʊvɚˈloʊn/","extraExplanation":["“overloan/overlend”多用于金融与监管语境，强调“超过审慎标准”的放贷行为，常与risk（风险）、default（违约）、credit bubble（信贷泡沫）等话题一起出现。日常英语里更常见的是 overlend（过度放贷）和 overborrow（过度借贷）。"]}
{"word":"overloath","summary":{"en":"“Overloath” is rare/nonstandard. It’s usually intended to mean “very reluctant” (like loath), or it’s a misspelling of “loathe” (to hate strongly).","zh":"“overloath”较少见且不太规范。通常想表达“非常不情愿”（类似 loath），或是把“loathe”（强烈厌恶）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) excessively unwilling or reluctant to do something; strongly averse.","zh":"（非标准/少见）过度不愿意做某事；非常反感。"},"examples":[{"en":"I’m overloath to change plans at the last minute.","zh":"我非常不愿意在最后一刻改计划。"},{"en":"She seemed overloath to apologize, even when she knew she was wrong.","zh":"即使她知道自己错了，她似乎也非常不愿意道歉。"}]},{"partOfSpeech":"other","definition":{"en":"(Often a misspelling) sometimes used when people mean “loathe” (to hate strongly) or “overloathe” (to hate too much).","zh":"（常见拼写错误）有时人们想写的是“loathe”（强烈厌恶/憎恨）或“overloathe”（过度厌恶）。"},"examples":[{"en":"If you mean “hate,” the standard verb is “loathe”: I loathe doing paperwork.","zh":"如果你想表达“讨厌/憎恨”，标准动词是“loathe”：我很讨厌做文书工作。"},{"en":"If you mean “reluctant,” the standard adjective is “loath”: I’m loath to complain.","zh":"如果你想表达“不情愿”，标准形容词是“loath”：我不太愿意抱怨。"}]}],"synonyms":["overly reluctant","very unwilling","too unwilling","averse","disinclined"],"phonetic":"/ˌoʊvərˈloʊθ/","extraExplanation":["“loath / loathe”是英语学习者常见混淆：\n- loath（形容词）= reluctant（不情愿的），结尾是清音 /θ/。\n- loathe（动词）= hate strongly（强烈厌恶），结尾是浊音 /ð/。\n“overloath”不算常见标准拼写；正式写作中建议改用“very/too/extremely loath to …”或直接用“loathe”。"]}
{"word":"overlock","summary":{"en":"Overlock is a sewing stitch (or the act of sewing) that wraps thread around a fabric edge to stop fraying and often joins seams.","zh":"Overlock 指包缝线或包缝/锁边这一动作：用线包住布边防脱线，且常用于拼接缝份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In sewing) a stitch made with an overlock machine that wraps thread around the fabric edge to prevent fraying and to join pieces of fabric.","zh":"（缝纫）用包缝机做的包缝线，用线把布边包住以防脱线，也可同时把布料拼接在一起。"},"examples":[{"en":"She overlocked the raw edges so the fabric wouldn’t fray.","zh":"她把布料的毛边包缝起来，这样就不会脱线了。"},{"en":"This T-shirt has overlocked seams inside.","zh":"这件T恤里面的接缝是包缝处理的。"}]},{"partOfSpeech":"v.","definition":{"en":"To sew with an overlock machine, usually to finish a fabric edge or join seams.","zh":"（用包缝机）包缝；锁边（通常用于处理布边或拼接布料）。"},"examples":[{"en":"After cutting the fabric, overlock the edges to keep them neat.","zh":"裁好布后，把边锁一下，让边缘更整齐。"},{"en":"I can overlock this seam in a minute.","zh":"我一分钟就能把这条缝包缝好。"}]}],"synonyms":["serge","overedge","overcast"],"phonetic":"/ˈoʊvərˌlɑk/","extraExplanation":["“overlock”在美式英语里也常被称为“serge / serging”（包缝/拷边）。很多家用“serger（包缝机）”做出来的线迹就是overlock stitch。","在服装生产中，overlock常用于针织面料（如T恤）内侧的弹性包缝，既能防脱线又更有弹性。"]}
{"word":"overlocker","summary":{"en":"An overlocker is a sewing machine that trims and overcasts fabric edges to prevent fraying (often called a serger in the U.S.).","zh":"overlocker 指一种能修齐并包缝布边、防止散线的缝纫机（在美国多称 serger）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sewing machine (often called a “serger” in the U.S.) that trims the fabric edge and stitches it at the same time, creating a neat, strong seam that won’t fray.","zh":"一种缝纫机（在美国常叫“serger”包缝机），能在缝合的同时修齐布边并包住边缘，使缝口整齐牢固、不易脱线。"},"examples":[{"en":"I finished the inside seams with an overlocker so the fabric wouldn’t fray.","zh":"我用包缝机处理了内侧缝口，这样布料就不容易散边。"},{"en":"If you sew knits, an overlocker makes the edges look clean and professional.","zh":"如果你常缝针织面料，包缝机会让边缘看起来更干净、更专业。"}]}],"synonyms":["serger","overedge machine"],"phonetic":"/ˈoʊvərˌlɑkər/","extraExplanation":["“Overlocker”这个词在英式英语、澳大利亚英语等更常见；美式英语里更常用“serger”。","Overlocker常见用途是“包缝/锁边”（把布边包住防止散线），有些机型还可以做卷边（rolled hem）等效果。"]}
{"word":"overloftily","summary":{"en":"“Overloftily” means ‘too proudly or haughtily,’ often in a way that sounds condescending.","zh":"“overloftily”表示“过于高傲/摆架子地”，常带有居高临下的批评意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too lofty, proud, or haughty; excessively high-minded in tone or attitude.","zh":"以过于高傲、矜持或自命不凡的方式；语气或态度过分“高高在上”。"},"examples":[{"en":"He spoke overloftily to the staff, as if their opinions didn’t matter.","zh":"他用过分傲慢的口气对员工说话，仿佛他们的意见无关紧要。"},{"en":"The essay sounds overloftily moral, so it may distance readers instead of persuading them.","zh":"这篇文章的道德说教口吻过于“高高在上”，可能会让读者疏离而不是被说服。"}]}],"synonyms":["haughtily","arrogantly","condescendingly","superciliously","pompously"],"phonetic":"/ˌoʊvɚˈlɔftəli/","extraExplanation":["这个词比较少见，多见于较老的文学或评论性文字中。构词上是 over-（过度）+ lofty（高尚的/高傲的）+ -ly（副词后缀），强调“过分高姿态”。","语感上常带批评意味：不是“高尚”，而是“自以为高尚、摆架子”。写作中更常用的替代词有 haughtily / arrogantly / condescendingly。"]}
{"word":"overloftiness","summary":{"en":"Overloftiness means being excessively lofty—too proud, too formal, or too high-minded in a way that feels arrogant or out of touch.","zh":"overloftiness 指“过度的高傲/高高在上”，也可指文风或语言过分高调、显得傲慢或不接地气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too lofty in attitude, style, or language; excessive pride, arrogance, or high-mindedness that feels distant from ordinary people","zh":"过度的高傲或“高高在上”；（态度、文风或语言）过分高调、脱离大众的感觉"},"examples":[{"en":"Some readers felt the essay’s overloftiness made its message hard to relate to.","zh":"一些读者觉得这篇文章的过度高调让人难以产生共鸣。"},{"en":"Her overloftiness in meetings came across as arrogance rather than confidence.","zh":"她在会议中的过度高傲让人感觉是傲慢而不是自信。"},{"en":"The speech avoided overloftiness by using simple stories and clear words.","zh":"这场演讲用朴素的故事和清晰的表达避免了过分的高调。"}]}],"synonyms":["arrogance","haughtiness","pretentiousness","pompousness","snobbery"],"phonetic":"/ˌoʊvɚˈlɔf.ti.nəs/","extraExplanation":["“overloftiness”并不是常见词，更常见的表达是“arrogance / haughtiness / pretentiousness”，或说“too lofty / overly lofty tone”。它由 over-（过度）+ loftiness（高远、崇高；也可指高傲的气质）构成，通常带负面评价。","“lofty”既可以褒义（崇高的理想、宏大的目标：lofty goals），也可以贬义（高傲、疏离：a lofty attitude）。加上 over- 后，基本强调“过了头”，多指后者的贬义。"]}
{"word":"overlofty","summary":{"en":"“Overlofty” means excessively lofty or high-and-mighty, often in a pretentious way.","zh":"“overlofty”指过于高傲或过分高雅夸张，常带“装、不接地气”的贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too proud, high-minded, or grand in style; overly lofty (often sounding pretentious or out of touch).","zh":"过于高傲的；（文风/措辞）过分高雅或夸张的，显得做作、不接地气。"},"examples":[{"en":"His speech sounded overlofty, so many listeners felt he was talking down to them.","zh":"他的演讲听起来过于高高在上，所以很多听众觉得他在居高临下。"},{"en":"The essay is clear, but some overlofty phrases make it harder to understand.","zh":"这篇文章很清晰，但一些过分“高大上”的措辞让它更难懂。"}]}],"synonyms":["pretentious","pompous","high-flown","grandiloquent","self-important"],"phonetic":"ˌoʊvɚˈlɔfti","extraExplanation":["“overlofty”由 over-（过度）+ lofty（高的；崇高的）构成，常用来批评语气或风格“太端着/太装”。它不一定表示内容本身不好，而是强调表达方式给人距离感、优越感或不够朴实。","近义词里，pretentious 更强调“装腔作势”，pompous 更强调“浮夸自大”；overlofty 则更聚焦于“过度崇高/过度拔高”的风格。"]}
{"word":"overlogical","summary":{"en":"Overlogical describes someone or something that is excessively logical, often ignoring emotions or real-life complexity.","zh":"overlogical 指“过度讲逻辑”，常带批评意味：太理性、太死板，容易忽略情感或现实复杂性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too logical in a way that feels excessive, rigid, or lacking emotional or human understanding.","zh":"过度讲逻辑的；逻辑至上而显得僵硬、缺乏人情味或忽略情感与现实情况的。"},"examples":[{"en":"His advice was overlogical—it made sense on paper, but it ignored how stressed she felt.","zh":"他的建议太“过度讲逻辑”了——纸面上很合理，但忽略了她有多焦虑。"},{"en":"Don’t be overlogical when you apologize; people also need warmth and empathy.","zh":"道歉时别太过度讲逻辑；人们也需要温度和共情。"}]}],"synonyms":["overly logical","too rational","overly rational","rigid","coldly logical"],"phonetic":"/ˌoʊvərˈlɑdʒɪkəl/","extraExplanation":["“overlogical”不是非常常见、也不算很标准的固定词（更常见的是“overly logical”“too logical”）。但在口语或写作中，人们会用它来表达“逻辑没错，却不够体贴/不够贴近人性”的批评语气。","前缀“over-”常表示“过度、超过适当程度”（如 overconfident 过度自信）。所以 overlogical 通常带有负面评价：不是“逻辑强”，而是“逻辑强到不合时宜”。"]}
{"word":"overlogicality","summary":{"en":"Overlogicality means excessive reliance on logic, often at the expense of emotion or context.","zh":"Overlogicality 指过度依赖逻辑，常常忽视情感或语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency to rely on strict logic too much, especially in a way that ignores emotions, context, or common sense; excessive logical reasoning","zh":"过度逻辑化；过分依赖逻辑（尤其指忽视情感、语境或常识的倾向）"},"examples":[{"en":"Her overlogicality made it hard for her to comfort her friend; she kept offering solutions instead of empathy.","zh":"她的过度逻辑化让她很难安慰朋友；她一直在给解决方案，而不是表达共情。"},{"en":"In teamwork, a bit of logic helps, but overlogicality can shut down creativity and compromise.","zh":"团队合作中，适度的逻辑很有帮助，但过度逻辑化可能会扼杀创意与妥协。"}]}],"synonyms":["excessive logic","over-rationalization","hyper-rationality","overthinking"],"phonetic":"/ˌoʊvɚˌlɑdʒɪˈkælɪti/","extraExplanation":["“overlogicality”不是常见的标准词汇，更像是由 over-（过度）+ logical + -ity（名词后缀）临时造出来的词，用来批评或描述“太讲道理/太理性”的风格。正式写作中更常用 excessive logic, over-rationalization, hyper-rationality 等表达。"]}
{"word":"overlogically","summary":{"en":"“Overlogically” means ‘too logically’—overly rational in a way that can miss feelings or real-world context.","zh":"“overlogically”表示“过于讲逻辑/过分理性地”，常暗示忽略情感或现实语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too logical or too focused on formal reasoning, often ignoring emotions, context, or practical realities.","zh":"过于讲逻辑地；过分理性地（常指忽视情感、语境或现实情况）。"},"examples":[{"en":"He approached the argument overlogically and missed how hurt she felt.","zh":"他处理这场争论时过于讲逻辑，忽略了她有多受伤。"},{"en":"The plan sounds neat on paper, but you’re thinking overlogically about people’s behavior.","zh":"这个计划在纸面上听起来很漂亮，但你对人的行为想得过于理性了。"},{"en":"Don’t judge the story overlogically; it’s meant to be symbolic.","zh":"别用过于讲逻辑的方式去评判这个故事；它本来就是象征性的。"}]}],"synonyms":["too logically","overly logically","in an overly logical way","over-rationally"],"phonetic":"/ˌoʊvɚˈlɑdʒɪkli/","extraExplanation":["“overlogically”不是非常常见的标准词，更常见的表达是“too logically / overly logically / in an overly logical way”。","构词：over-（过度）+ logically（合乎逻辑地）。用于批评某人把逻辑当成唯一标准，从而忽略人情、直觉或复杂语境。"]}
{"word":"overlogicalness","summary":{"en":"Overlogicalness means being too strictly logical and ignoring feelings or context.","zh":"overlogicalness 指“过度讲逻辑”，过分依赖逻辑而忽视情感或语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too strictly logical, focusing on logic so much that human feelings, context, or practical reality are ignored","zh":"过度讲逻辑（过分依赖逻辑推理，以至于忽视情感、语境或现实可行性）"},"examples":[{"en":"Her overlogicalness made the conversation feel cold and unfriendly.","zh":"她的过度讲逻辑让谈话显得冷冰冰、不够友好。"},{"en":"In family arguments, a little empathy helps balance overlogicalness.","zh":"在家庭争执中，一点同理心能平衡过度讲逻辑。"},{"en":"The plan failed because overlogicalness ignored real-world limits like time and money.","zh":"这个计划失败了，因为过度讲逻辑忽视了时间和金钱等现实限制。"}]}],"synonyms":["excessive rationality","being overly logical","overthinking","hyper-rationality"],"phonetic":"/ˌoʊvərˈlɑdʒɪkəlnəs/","extraExplanation":["这是一个比较少见、偏口语化/自造的词（neologism），通常用来带一点评价或吐槽的语气。","构词法：over-（“过度”）+ logical（“合乎逻辑的”）+ -ness（把形容词变成名词，表示“……的状态/特质”）。","常见的更自然表达包括：“being overly logical / too logical / excessively rational / overthinking”。"]}
{"word":"overlong","summary":{"en":"“Overlong” means too long, especially in writing or speech.","zh":"“overlong”表示“太长、过长”，常用于文章、邮件或演讲等较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too long; longer than is needed or acceptable (in length, time, or amount).","zh":"过长的；超出需要或可接受范围的（长度、时间或数量）。"},"examples":[{"en":"The report was overlong, so I cut two pages.","zh":"报告太长了，所以我删掉了两页。"},{"en":"Sorry for the overlong email—I wanted to explain everything clearly.","zh":"抱歉这封邮件写得太长——我想把事情解释清楚。"}]}],"synonyms":["too long","lengthy","long-winded","verbose"],"phonetic":"/ˌoʊvɚˈlɔŋ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”（如: overwork 过度工作，overcrowded 过于拥挤）。因此 overlong 直观地表示“长得过头”。","overlong 多用于较正式的书面语或编辑场景（文章、演讲、邮件、段落等），日常口语里更常说 too long / really long。"]}
{"word":"overlook","summary":{"en":"Overlook most commonly means “fail to notice” and can also mean “have a view from above.”","zh":"Overlook最常见是“忽略/漏看”，也可以表示“俯瞰（从高处看）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fail to notice something; to miss something by accident","zh":"忽略；没注意到（通常是无意的）"},"examples":[{"en":"I’m sorry—I overlooked your email.","zh":"对不起——我漏看了你的邮件。"},{"en":"It’s easy to overlook small mistakes when you’re in a hurry.","zh":"赶时间时很容易忽略小错误。"}]},{"partOfSpeech":"vt.","definition":{"en":"to have a view from above; to look down on or over a place","zh":"俯瞰；从高处眺望（某地）"},"examples":[{"en":"Their apartment overlooks the park.","zh":"他们的公寓俯瞰公园。"},{"en":"From the hill, we overlooked the whole city.","zh":"从山上我们俯瞰整座城市。"}]},{"partOfSpeech":"vt.","definition":{"en":"to choose not to consider or mention something; to ignore on purpose","zh":"不予理会；刻意略过（某事）"},"examples":[{"en":"Let’s overlook that detail for now and focus on the main point.","zh":"那点细节我们先略过，先抓住重点。"}]}],"synonyms":["miss","fail to notice","ignore","neglect","have a view of"],"phonetic":"/ˌoʊvɚˈlʊk/","extraExplanation":["“Overlook”有两个最常见的方向：一是“漏看/忽略”（注意力没到位），二是“俯瞰”（视线在上方）。学习时可以用场景区分：工作邮件、作业检查更常用“忽略”；房子、窗户、山坡更常用“俯瞰”。","在职场写作里，“I overlooked…”语气通常比“I forgot…”更委婉一些，暗示是无意疏忽而不是完全忘记。"]}
{"word":"overlooked","summary":{"en":"“Overlooked” most often means ‘ignored or not noticed.’ It can also be the past form of “overlook” meaning ‘to miss’ or ‘to have a view over.’","zh":"“overlooked”最常见意思是“被忽视的/未被注意到的”。也可作“overlook”的过去式/过去分词，表示“疏忽漏看”或“俯瞰”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not noticed, not seen, or not given enough attention; ignored.","zh":"被忽视的；未被注意到的；未得到足够关注的。"},"examples":[{"en":"Her contributions were overlooked during the meeting.","zh":"会议上，她的贡献被忽视了。"},{"en":"This is an overlooked problem that affects many families.","zh":"这是一个被忽视的问题，影响着许多家庭。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overlook”: to fail to notice something or someone; to miss by mistake.","zh":"“overlook”的过去式/过去分词：没注意到；疏忽；（无意中）漏掉。"},"examples":[{"en":"I overlooked the typo in the final report.","zh":"我在最终报告里漏看了那个拼写错误。"},{"en":"They overlooked him for promotion despite his strong performance.","zh":"尽管他表现出色，他们还是没有提拔他（把他排除在外）。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overlook”: to have a view over a place (often from a higher position).","zh":"“overlook”的过去式/过去分词：俯瞰；眺望（通常从较高处）。"},"examples":[{"en":"Their apartment overlooked the river.","zh":"他们的公寓俯瞰着那条河。"},{"en":"We ate on a terrace that overlooked the city.","zh":"我们在一个俯瞰城市的露台上吃饭。"}]}],"synonyms":["ignored","unnoticed","missed","neglected","forgotten"],"phonetic":"/ˌoʊvərˈlʊkt/","extraExplanation":["“overlook”有两个很常见、但意义差很大的用法：①“忽视/没注意到”（最常用）；②“俯瞰/眺望”（多用于风景、房间、窗户、阳台等）。所以“overlooked”既可能表示“被忽视的”，也可能表示“俯瞰着……的/俯瞰过……的”。","固定搭配：be overlooked by…（被……忽视）；overlook a detail/error（疏忽细节/漏掉错误）；overlook someone for promotion（提拔时把某人忽略/跳过）。注意这里不是“看过去”，而是“没把他算进去”。"]}
{"word":"overlooker","summary":{"en":"An overlooker is someone who watches over work or checks something by looking it over; it’s an uncommon word today.","zh":"overlooker 指监督工作的人或过目检查的人；现代英语中较少用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who watches over or supervises work or workers; an overseer.","zh":"监督或看管工作/工人的人；监工。"},"examples":[{"en":"The overlooker checked the workers’ safety gear before the shift started.","zh":"监工在开工前检查了工人的安全装备。"},{"en":"In the old factory, an overlooker walked the floor to make sure rules were followed.","zh":"在那家旧工厂里，监工会在车间巡视，确保大家遵守规定。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who looks over something quickly, especially to check it (less common).","zh":"快速查看、审阅某物的人（较少见）。"},"examples":[{"en":"Ask a careful overlooker to read your email before you send it.","zh":"在你发送邮件前，请一个细心的人帮你过目一下。"}]}],"synonyms":["overseer","supervisor","manager","foreman","inspector","reviewer"],"phonetic":"/ˌoʊvɚˈlʊkɚ/","extraExplanation":["“overlooker”不是特别常用的词。现代英语里更常见的是“supervisor / manager / overseer”。在某些历史语境（如工厂、庄园、矿场）里，用“overlooker”指“监工/监督者”更贴切。","注意“overlook”这个动词有两个常见方向：①“俯瞰”（have a view of）；②“忽视/漏看”（fail to notice）。因此“overlooker”在不同语境里可能让人产生歧义，写作时更推荐用更明确的词（如“overseer”或“reviewer”）。"]}
{"word":"overlooking","summary":{"en":"“Overlooking” can mean (1) having a view from above, (2) failing to notice, or (3) supervising.","zh":"“overlooking”可表示（1）俯瞰的，（2）忽略/没注意到，（3）监督/看管。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a place) Having a view of something from above; looking down on or facing a place.","zh":"（地点）俯瞰的；从高处能看到某处的。"},"examples":[{"en":"Our hotel room is overlooking the ocean.","zh":"我们的酒店房间俯瞰大海。"},{"en":"They bought a house overlooking a quiet park.","zh":"他们买了一套俯瞰安静公园的房子。"}]},{"partOfSpeech":"v.","definition":{"en":"Failing to notice something; not seeing or considering it (often by accident).","zh":"忽略；未注意到（常指无意的）。"},"examples":[{"en":"I’m sorry—I was overlooking your email in my inbox.","zh":"对不起——我在收件箱里没注意到你的邮件。"},{"en":"The report is good, but it’s overlooking some key data.","zh":"这份报告不错，但忽略了一些关键数据。"}]},{"partOfSpeech":"v.","definition":{"en":"Supervising or managing work; watching over an activity or people.","zh":"监督；管理；看管（工作或活动）。"},"examples":[{"en":"She is overlooking the construction project this week.","zh":"这周她在监督这个施工项目。"},{"en":"A teacher was overlooking the students during the exam.","zh":"考试时有老师在监考/看着学生。"}]}],"synonyms":["viewing","looking down on","missing","neglecting","overseeing","supervising"],"phonetic":"/ˌoʊvərˈlʊkɪŋ/","extraExplanation":["“overlooking”常有两种常见用法：①作形容词，表示地点“俯瞰……（be overlooking + 地点）”；②作动词，既可以表示“忽略”，也可以表示“监督/看管”。语境通常决定含义。","易混点：overlook = “忽略/俯瞰/监督”，而“故意不追究、放过”更常用 overlook + someone’s mistake（对错误不计较）。此外，“oversee”更偏正式，主要表示“监督管理”。"]}
{"word":"overlooks","summary":{"en":"“Overlooks” means (1) doesn’t notice/misses something, (2) has a view over something, or (3) supervises something; it’s the third-person singular form of “overlook.”","zh":"“overlooks”可表示（1）忽略/没注意到，（2）俯瞰，（3）监督；是动词“overlook”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “overlook”) to fail to notice or consider something; to miss it by accident.","zh":"（overlook 的第三人称单数）忽视、没注意到；无意中漏掉。"},"examples":[{"en":"She often overlooks small mistakes in homework.","zh":"她常常会忽略作业中的小错误。"},{"en":"The report overlooks the cost of maintenance.","zh":"这份报告忽略了维护成本。"}]},{"partOfSpeech":"v.","definition":{"en":"to have a view of something from above or from a distance.","zh":"俯瞰；从高处/远处看得到。"},"examples":[{"en":"Their apartment overlooks the river.","zh":"他们的公寓俯瞰这条河。"},{"en":"A small café overlooks the town square.","zh":"有一家小咖啡馆能俯瞰城镇广场。"}]},{"partOfSpeech":"v.","definition":{"en":"to supervise or watch over a person or activity (often in formal or work settings).","zh":"监督；监管（常用于较正式或工作语境）。"},"examples":[{"en":"The manager overlooks the entire project.","zh":"经理负责监督整个项目。"},{"en":"A senior nurse overlooks the training of new staff.","zh":"一位资深护士负责监督新员工培训。"}]}],"synonyms":["miss","ignore","neglect","have a view of","look out on","oversee","supervise"],"phonetic":"/ˌoʊvərˈlʊks/","extraExplanation":["“overlook”最常见的两种意思是：①“忽略/没注意到”（偏抽象）；②“俯瞰”（偏具体、描述景观）。语境通常能帮助你判断，比如后面接“mistakes / details / risks”多为“忽略”，接“river / park / city”多为“俯瞰”。","“overlook”与“oversee”都可表示“监督”，但“oversee”更强调“负责管理/统筹”，更常用在工作职责里；“overlook”作“监督”时相对正式，也可带一点“高处看着下面”的比喻感。"]}
{"word":"overloose","summary":{"en":"Overloose means “too loose” or “overly loose,” describing something not tight or controlled enough.","zh":"overloose 指“过于宽松/太松”，形容不够紧或不够受控。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too loose; not tight or controlled enough (often describing clothing, rules, or movement).","zh":"过于宽松的；太松、不够紧或不够受控（常形容衣物、规则或动作）。"},"examples":[{"en":"The belt was overloose, so his pants kept slipping.","zh":"皮带太松了，所以他的裤子一直往下滑。"},{"en":"Some people felt the new safety rules were overloose and needed to be stricter.","zh":"一些人觉得新的安全规定过于宽松，需要更严格。"},{"en":"Her overloose grip made it easy to drop the glass.","zh":"她握得太松，玻璃杯很容易掉下去。"}]}],"synonyms":["too loose","overly loose","slack","baggy"],"phonetic":"ˌoʊvərˈlus","extraExplanation":["“overloose”不是常见的日常用词，更常见的表达是“too loose / overly loose”。在正式写作里也常见连字符写法“over-loose”，用来强调“松过头了”。如果你在文学或旧文本里看到它，通常就是强调程度（over- = “过度”）。"]}
{"word":"overloosely","summary":{"en":"“Overloosely” means “too loosely,” either physically (not tight enough) or figuratively (too imprecisely).","zh":"“overloosely”表示“过于松地/过于宽泛地”，既可指物理上的不够紧，也可指表达或规则不够严谨。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too loose (not tight enough), often causing a poor fit or lack of control.","zh":"过于松散地；松得不合适，常导致不贴合或难以控制。"},"examples":[{"en":"He tied the knot overloosely, so the package came open.","zh":"他把结打得太松，所以包裹散开了。"},{"en":"The helmet was worn overloosely and kept sliding down.","zh":"头盔戴得太松，一直往下滑。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an overly relaxed or imprecise way (about rules, wording, or reasoning).","zh":"过于宽松或不严谨地（指规则、措辞或推理）。"},"examples":[{"en":"The policy was written overloosely, which led to confusion.","zh":"这项政策写得过于宽泛，导致大家困惑。"},{"en":"She used the term overloosely, so readers misunderstood her point.","zh":"她对这个术语用得不够严谨，读者就误解了她的意思。"}]}],"synonyms":["too loosely","overly loosely","slackly","in a lax manner"],"phonetic":"/ˌoʊvərˈluːsli/","extraExplanation":["“over-”有“过度、太……”的意思，所以 overloosely = too loosely。它不算特别常见，更自然的表达常是 “too loosely / overly loosely”。","注意拼写：loose（松的）≠ lose（失去）。很多学习者会混淆；overloosely 来自 loose。"]}
{"word":"overlooseness","summary":{"en":"Overlooseness means being too loose or not controlled enough.","zh":"Overlooseness 指“过度松散/过度放松，缺乏必要的约束”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too loose, too relaxed, or not controlled enough (in rules, structure, clothing, writing, behavior, etc.)","zh":"过度松散；过度放松；缺乏必要的约束（可指规则、结构、衣物、写作、行为等）"},"examples":[{"en":"The overlooseness of the company’s rules caused confusion about who was responsible for what.","zh":"公司规章过度松散，导致大家不清楚各自该负责什么。"},{"en":"In editing, overlooseness can make the argument feel unclear and unfocused.","zh":"在编辑写作时，过度松散会让论点显得不清晰、缺乏重点。"},{"en":"The overlooseness of the belt made it slip down all day.","zh":"腰带太松，一整天都在往下滑。"}]}],"synonyms":["excessive looseness","lack of control","over-relaxation","slackness","laxity"],"phonetic":"/ˌoʊvɚˈluːsnəs/","extraExplanation":["“overlooseness”并不是特别常见的标准词汇，更常见的表达是“too much looseness / excessive looseness / lack of control”。它由 over-（过度）+ looseness（松散、宽松、放任）构成，常用于强调“松到不合适的程度”。"]}
{"word":"overlord","summary":{"en":"An overlord is a very powerful ruler—or, more generally, someone who dominates others (often with a negative tone).","zh":"overlord 指权力极大的统治者；也可泛指以压迫方式支配他人的人/体制（常带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ruler who has great power and control over other people or regions; a supreme lord.","zh":"拥有极大权力、统治他人或领土的统治者；最高领主/霸主。"},"examples":[{"en":"In the story, the overlord demands taxes from every village.","zh":"在故事里，霸主要求每个村庄纳税。"},{"en":"Many people rebelled against the overlord’s harsh rule.","zh":"许多人反抗这位统治者的残酷统治。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or system that dominates others in an oppressive way (often used critically).","zh":"以压迫方式支配他人的人或体制（常带批评意味）。"},"examples":[{"en":"He treated his employees like an overlord, controlling every small decision.","zh":"他像个专制的“老板/主子”，控制员工的每个小决定。"},{"en":"Some critics call big tech companies data overlords.","zh":"一些批评者称大型科技公司是“数据霸主”。"}]}],"synonyms":["ruler","tyrant","despot","master","supreme ruler","dominant power"],"phonetic":"/ˈoʊvərˌlɔrd/","extraExplanation":["“overlord”由 over-（在……之上）+ lord（领主/主人）组成，字面意思是“在领主之上的人”，常见于中世纪封建语境，也常用于奇幻文学、游戏或历史题材中。","语气与使用场景：在现代英语里，它通常带有“专横、压迫”的负面色彩；如果只是中性地说“统治者/领导者”，更常用 ruler、leader、governor 等。"]}
{"word":"overlorded","summary":{"en":"“Overlorded” means “dominated or ruled over as an overlord” (past tense).","zh":"“overlorded”表示“以霸主/领主的方式统治、专横支配”（过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle) to rule over people or a place as an overlord; to dominate or control in a heavy-handed way.","zh":"（过去式/过去分词）以“领主/霸主”的姿态统治；以强势、专横的方式支配或控制。"},"examples":[{"en":"For decades, the empire overlorded the surrounding kingdoms through fear and tribute.","zh":"几十年来，这个帝国靠恐惧和进贡来霸权统治周边王国。"},{"en":"He felt his boss had overlorded the whole team, leaving no room for discussion.","zh":"他觉得老板对整个团队专横控制，几乎不给讨论空间。"}]}],"synonyms":["dominated","controlled","ruled over","subjugated","oppressed"],"phonetic":"ˌoʊvərˈlɔrdɪd","extraExplanation":["“overlorded”来自动词 overlord（像“overlord/领主”那样统治）。现代英语里更常见的说法通常是 dominated / controlled / ruled over，因此 overlorded 带有更强的“封建领主式、霸权式、专横”的语气，写作或叙事风格更明显。","overlord 原本是中世纪语境里的“最高领主/大领主”，常见于历史写作、奇幻文学或游戏设定中；用 overlorded 往往是在营造一种压迫、臣服与等级制度的氛围。"]}
{"word":"overlording","summary":{"en":"“Overlording” means ruling or controlling others in an arrogant, domineering way, like an overlord.","zh":"“overlording”指像“领主/主宰者”一样傲慢专横地统治或控制他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"acting as an overlord; ruling or controlling others in a proud, domineering way","zh":"以“主宰者/领主”的姿态行事；傲慢专横地统治或控制他人"},"examples":[{"en":"He spoke to the team in an overlording tone, as if no one else’s ideas mattered.","zh":"他用一种主宰式的语气对团队说话，好像别人的想法都不重要。"},{"en":"The novel criticizes overlording leaders who treat people like tools.","zh":"这部小说批判那些把人当工具的专横统治者。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of ruling as an overlord; domineering control","zh":"（作为领主的）统治行为；专横的控制"},"examples":[{"en":"Her resignation was a protest against the overlording of upper management.","zh":"她辞职是为了抗议高层管理的专横控制。"},{"en":"The story traces how overlording can grow out of fear and insecurity.","zh":"故事描写了专横如何可能源于恐惧与不安全感。"}]},{"partOfSpeech":"v.","definition":{"en":"to rule or control others like an overlord (rare)","zh":"像领主一样统治或压制他人（较少见）"},"examples":[{"en":"He tried to overlord his neighbors, but they pushed back.","zh":"他试图像领主一样压制邻居，但邻居们反击了。"}]}],"synonyms":["domineering","bossy","authoritarian","overbearing","high-handed"],"phonetic":"/ˌoʊvərˈlɔrdɪŋ/","extraExplanation":["“overlord”原本指封建社会中的“最高领主/宗主”，与“vassal（封臣）”等制度相关。现代英语里更多用于批评某人“摆架子、爱发号施令”，带明显贬义。","“overlording”在日常口语中不算常见；更常用的表达是“bossy / domineering / controlling / authoritarian”。"]}
{"word":"overlords","summary":{"en":"Overlords means powerful rulers or controlling forces; it can be literal (political rulers) or figurative (dominant, unfair controllers).","zh":"overlords 指“统治者/霸主”，既可字面指政治上的上级统治者，也可比喻指强势、不公平的控制者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful ruler or leader who has authority over other rulers or people (often used for someone who controls others from above).","zh":"（常指高高在上的）统治者；霸主；对他人或其他统治者拥有支配权的人。"},"examples":[{"en":"In the story, the villagers lived under an overlord who demanded heavy taxes.","zh":"在故事里，村民生活在一位要求沉重税赋的霸主统治之下。"},{"en":"The empire treated neighboring kings like subjects of an overlord.","zh":"那个帝国把周边的国王当作霸主的臣属。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that dominates others in an unfair or controlling way (often used critically or in science fiction/fantasy).","zh":"（贬义）以不公平或强势方式支配他人的人或团体；（科幻/奇幻中常指）压迫性的统治者。"},"examples":[{"en":"He complained that the company’s new policies were written by overlords who never meet the workers.","zh":"他抱怨公司的新政策是那些从不接触员工的“掌权者”制定的。"},{"en":"In many sci‑fi movies, alien overlords control Earth.","zh":"在许多科幻电影里，外星统治者控制着地球。"}]}],"synonyms":["ruler","master","tyrant","oppressor","lord","boss"],"phonetic":"/ˈoʊvərˌlɔrd/","extraExplanation":["“overlords”是复数形式，单数是“overlord”。词面意思是“在上面的领主/主宰者”。在历史语境中常与封建制度相关；在现代语境中也常用于讽刺或夸张，指“高高在上、脱离现实的掌权者”。"]}
{"word":"overlordship","summary":{"en":"Overlordship means the power or status of an overlord—dominant rule over others, especially in feudal or imperial settings.","zh":"Overlordship 指“宗主权/宗主地位”，强调在封建或帝国背景下对他者的支配性统治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state, right, or power of being an overlord; control or rule over others (often in a feudal or imperial context).","zh":"宗主权；宗主地位；对他者的统治或支配权（常用于封建或帝国背景）。"},"examples":[{"en":"The treaty recognized the empire’s overlordship over the smaller kingdom.","zh":"该条约承认了帝国对这个小王国的宗主权。"},{"en":"In medieval Europe, overlordship shaped the relationship between lords and vassals.","zh":"在中世纪欧洲，宗主关系影响着领主与封臣之间的关系。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation where one person, group, or institution dominates others (often used in a critical or political tone).","zh":"（常带批评或政治语气）某个人、群体或机构对他者的强势支配或霸权。"},"examples":[{"en":"Critics argued that corporate overlordship was weakening local communities.","zh":"批评者认为企业霸权正在削弱地方社区。"},{"en":"The novel explores the overlordship of a ruling class over ordinary people.","zh":"这部小说探讨了统治阶级对普通人的支配。"}]}],"synonyms":["domination","suzerainty","hegemony","lordship","supremacy"],"phonetic":"/ˈoʊvərˌlɔrdʃɪp/","extraExplanation":["“overlordship”常见于历史与政治写作，尤其讨论封建制度（lord–vassal 领主—封臣关系）或强国与附庸国之间的从属关系。它比一般的“rule/authority”更强调上下等级与不对等的支配。","词形上由“overlord（宗主/霸主）+ -ship（表示‘身份/状态/职位’）”构成，类似：friendship（友谊）、leadership（领导地位）。"]}
{"word":"overloud","summary":{"en":"“Overloud” means too loud or excessively loud.","zh":"“overloud”表示“太吵/声音过大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too loud; louder than is comfortable, appropriate, or safe.","zh":"太吵的；过于响亮的（让人不舒服、不合适或不安全）。"},"examples":[{"en":"The music was overloud, so we couldn’t talk at the table.","zh":"音乐太吵了，所以我们在桌边没法聊天。"},{"en":"Please turn it down—your headphones are overloud.","zh":"请把音量调小一点——你的耳机声音太大了。"},{"en":"An overloud alarm can startle people and stress pets.","zh":"过于响的警报会吓到人，也会让宠物紧张。"}]}],"synonyms":["too loud","overly loud","excessively loud","deafening"],"phonetic":"/ˌoʊvərˈlaʊd/","extraExplanation":["“overloud”在日常英语里不算特别常见，更口语、更自然的说法通常是“too loud”或“overly loud”。写作中用“overloud”会带一点强调“超过合适程度”的感觉。"]}
{"word":"overloudly","summary":{"en":"“Overloudly” means “too loudly,” in a way that feels excessive or inappropriate.","zh":"“overloudly”表示“太大声地”，带有“过度、不得体”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively loud way; louder than is appropriate for the situation.","zh":"过于大声地；大到不合时宜地。"},"examples":[{"en":"He laughed overloudly during the quiet part of the movie.","zh":"电影安静的片段里，他笑得过于大声。"},{"en":"She spoke overloudly in the library and got a warning.","zh":"她在图书馆说话太大声，被提醒了。"}]}],"synonyms":["too loudly","overly loudly","excessively loudly","much too loud","at full volume"],"phonetic":"/ˌoʊvɚˈlaʊdli/","extraExplanation":["“over-”是常见前缀，表示“过度/超过正常程度”。所以 overloudly = over + loudly，强调“比应该的更大声”，常带一点批评或尴尬的语气。","这个词相对不常见；更自然的说法有 “too loudly / overly loudly / much too loud”。不过在文学或叙事中用 overloudly 能更直接表现人物“刻意或失控地太大声”。"]}
{"word":"overloudness","summary":{"en":"Overloudness means excessive loudness—being too loud.","zh":"overloudness 指“过于响亮、音量过大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being too loud; excessive loudness (often used when something is uncomfortably or harmfully loud).","zh":"过于响亮；音量过大（常指声音让人不适或可能有害）。"},"examples":[{"en":"The overloudness of the speakers made it hard to talk.","zh":"音箱的过大音量让人很难交谈。"},{"en":"Please turn it down—the overloudness is giving me a headache.","zh":"请把音量调小——这么吵让我头疼。"},{"en":"Engine overloudness can be a sign that something needs repair.","zh":"发动机声音过大可能是需要检修的信号。"}]}],"synonyms":["excessive loudness","too much noise","overly loud sound","high volume"],"phonetic":"/ˌoʊvɚˈlaʊdnəs/","extraExplanation":["“overloudness”由 over-（过度）+ loud（响的）+ -ness（名词后缀，表示“……的状态/性质”）构成，意思很直观，但在日常英语里并不算常见。更自然的表达通常是 “excessive loudness / too much noise / it’s too loud / overly loud”。在音频或工程语境中，有时也会用更专业的说法（如“excessive volume”“noise level too high”）。"]}
{"word":"overloup","summary":{"en":"“Overloup” is a Scots/archaic verb meaning either “to leap over” or “to pass over/omit; overlook.”","zh":"“overloup”是苏格兰英语/古用动词，意思是“跃过、跳过”，也可指“略过、省略；忽略”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots/archaic) to leap over; to jump across something.","zh":"（苏格兰英语/古用）跳过；跃过（某物）。"},"examples":[{"en":"In old Scots tales, a hero might overloup a ditch in one bound.","zh":"在古老的苏格兰故事里，英雄可能一跃就把沟渠跳过去。"},{"en":"The sheep overlouped the low wall and ran into the field.","zh":"羊跳过矮墙，跑进了田里。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scots/archaic) to pass over or omit something; to overlook a detail.","zh":"（苏格兰英语/古用）略过；省略；忽略（细节）。"},"examples":[{"en":"Don’t overloup the small print when you sign the contract.","zh":"签合同的时候别把小字条款给忽略了。"},{"en":"He overlouped one important point in his speech.","zh":"他在演讲中略过了一个重要点。"}]}],"synonyms":["leap over","jump over","vault over","skip","omit","overlook"],"phonetic":"/ˌoʊvɚˈluːp/","extraExplanation":["“overloup”主要见于苏格兰英语与较旧的文学/民间叙事中；现代标准英语里更常用的是“leap over / jump over”（表示跳过）或“overlook / skip / omit”（表示忽略、略过）。","词形上可理解为 over-（越过）+ loup（苏格兰英语：跳跃，常对应现代英语 leap）。如果你本来想查的是“overlook”，也可以告诉我语境，我可以对比两者用法。"]}
{"word":"overlove","summary":{"en":"“Overlove” means loving someone too much in an overwhelming or unhealthy way.","zh":"“overlove”指对某人爱得过多，到了让人有压力或不健康的程度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to love someone too much, in a way that becomes overwhelming or unhealthy (often by being too protective, needy, or controlling)","zh":"过度地爱（某人）；爱得太多以至于让人感到压力或不健康（常指过分保护、黏人或控制）"},"examples":[{"en":"She didn’t mean to hurt him, but she began to overlove him and check his phone all the time.","zh":"她并不是想伤害他，但她开始过度地爱他，甚至总是查看他的手机。"},{"en":"Some parents overlove their children and never let them try things alone.","zh":"有些父母过度疼爱孩子，从不让他们独立尝试。"}]}],"synonyms":["love too much","smother","dote on","overprotect","overindulge","spoil"],"phonetic":"/ˌoʊvɚˈlʌv/","extraExplanation":["“overlove”不是非常常见的标准词汇，更常见的表达有：love someone too much, smother someone, be overprotective, dote on someone, spoil someone（语气和场景不同）。","在亲密关系或育儿语境中，它通常带有负面含义：爱本身是好的，但“过度的爱”可能会压得对方喘不过气，或剥夺对方的独立性。"]}
{"word":"overloved","summary":{"en":"Overloved means “loved too much,” often implying someone is spoiled; less commonly, it can describe a much-used, well-loved object.","zh":"overloved 指“被爱得太多/被溺爱”，常暗示被宠坏；较少见时也可形容物品因常被喜爱使用而显旧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loved too much; given more affection, attention, or praise than is healthy or necessary (often implying the person becomes spoiled or dependent).","zh":"被过度疼爱/溺爱；得到超出健康或必要程度的爱与关注（常暗示因此被宠坏或变得依赖）。"},"examples":[{"en":"He was an overloved child who struggled to handle criticism at school.","zh":"他从小被过度宠爱，上学后很难接受批评。"},{"en":"The puppy is so overloved that it barks whenever it wants food.","zh":"这只小狗被宠得太过分了，想吃东西就乱叫。"},{"en":"She worries that constant praise may leave her son feeling overloved and unprepared for real life.","zh":"她担心一味夸奖会让儿子被“爱得太多”，反而不适应现实生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing that you have loved something a lot, sometimes to the point of wear or looking well-used (less common; often about objects like books or toys).","zh":"被长期喜爱、常被使用而显得旧旧的（较少见；多用于书、玩具等物品）。"},"examples":[{"en":"She kept an overloved paperback with notes in the margins.","zh":"她一直留着那本被翻得很旧的平装书，书页边上还有笔记。"},{"en":"The teddy bear was overloved, missing one button eye.","zh":"那只泰迪熊被抱得太久太常用，少了一只纽扣眼。"}]}],"synonyms":["overcherished","spoiled","pampered","doted-on","overindulged"],"phonetic":"ˌoʊvɚˈlʌvd","extraExplanation":["“over-”前缀表示“过度/太……”，所以 overloved 通常带一点负面或担忧的语气：不是“很爱”而是“爱得过头”。","日常更常见的表达是“spoiled / pampered / doted on（被宠坏/被娇惯/被溺爱）”；overloved 更像书面或评论性用语，强调“过多的爱”本身。"]}
{"word":"overlover","summary":{"en":"“Overlover” is an informal, nonstandard word for someone who loves too intensely or becomes overly attached.","zh":"“overlover”是一个非正式、非标准用法，指爱得过于强烈或过度依恋的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who loves someone too intensely or in an overly attached way.","zh":"（非正式）对某人爱得过于强烈、过度依恋的人。"},"examples":[{"en":"He’s a bit of an overlover—he texts her every hour.","zh":"他有点像个“过度爱恋的人”——每小时都给她发信息。"},{"en":"I used to be an overlover, but I’m learning to give people space.","zh":"我以前很容易过度爱人，但我正在学着给别人一些空间。"}]}],"synonyms":["clingy partner","overly attached person","someone who loves too much"],"phonetic":"/ˌoʊvɚˈlʌvɚ/","extraExplanation":["“overlover”不是常见的标准词，更像是由 over-（过度）+ lover（爱人/恋人）临时拼出来的口语或网络用词，常带一点自嘲或玩笑的语气。","更常见、也更自然的表达包括：someone who loves too much（爱得太多的人）、clingy partner（黏人的伴侣）、overly attached（过度依恋的）。使用“overlover”时要注意语境，正式写作中建议避免。"]}
{"word":"overloves","summary":{"en":"“Overloves” means “loves too much,” often in a way that becomes unhealthy or controlling.","zh":"“overloves”指“爱得过头”，常带有不健康或控制倾向的含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “overlove”) to love someone too much, in a way that becomes harmful, controlling, or unhealthy.","zh":"（“overlove”的第三人称单数）过度地爱某人；爱得太多，以至于变得有害、控制欲强或不健康。"},"examples":[{"en":"He overloves his child and never lets her make her own choices.","zh":"他过度地爱孩子，从不让她自己做选择。"},{"en":"She means well, but she overloves and ends up smothering people.","zh":"她本意是好的，但她爱得太过，结果让人喘不过气。"}]},{"partOfSpeech":"v.","definition":{"en":"To show too much affection or attention toward something or someone; to “overdo” love.","zh":"对某人或某物表现出过多的关爱或关注；把“爱”做过头。"},"examples":[{"en":"He overloves his pets, buying them treats every day.","zh":"他太宠爱自己的宠物，每天都给它们买零食。"},{"en":"If a partner overloves, the relationship can start to feel unbalanced.","zh":"如果伴侣爱得过头，这段关系可能会开始失衡。"}]}],"synonyms":["loves too much","spoils","smothers","overindulges","is overprotective"],"phonetic":"/ˌoʊvɚˈlʌvz/","extraExplanation":["“overlove(s)”在现代英语里不算常见，更自然的表达通常是：love too much（爱得太多）、spoil（溺爱）、smother（用过度关爱让人窒息）、be overprotective（过度保护）。","语气上，“overlove(s)”往往带一点批评或提醒：不是否认爱本身，而是强调“爱过头”带来的副作用（例如控制、依赖、失去界限）。"]}
{"word":"overloving","summary":{"en":"Overloving means showing too much love or affection, often in a way that feels smothering or overprotective.","zh":"overloving 指“过度宠爱/过分表达爱意”，常带有让人感到窒息或被过度保护的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or behavior) Showing too much love or affection, in a way that can feel smothering or overprotective. Example: “An overloving parent may not give a child enough independence.”","zh":"（指人或行为）过度宠爱、过分表达爱意，以至于让人感到窒息或被过度保护。例： “过度宠爱的父母可能不给孩子足够的独立空间。”"},"examples":[{"en":"She’s kind, but her overloving attention makes him feel trapped.","zh":"她很善良，但她那种过度关爱的关注让他觉得喘不过气。"},{"en":"The teacher warned that overloving parenting can prevent children from learning resilience.","zh":"老师提醒说，过度溺爱的养育方式会让孩子难以学会抗挫力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Loving something too much; excessively devoted. Example: “He became overloving of his work and forgot to rest.”","zh":"（较少见）对某事爱得过头；过分投入或迷恋。例： “他对工作过度投入，连休息都忘了。”"},"examples":[{"en":"She grew overloving of control and struggled to delegate.","zh":"她对掌控变得过度迷恋，难以把任务交给别人。"}]}],"synonyms":["overaffectionate","overprotective","smothering","clingy","too attentive"],"phonetic":"/ˌoʊvɚˈlʌvɪŋ/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过正常程度”（如 overeat 吃太多、overwork 过劳）。因此 overloving 通常带有“好心但过头了”的语气。","日常表达中，更常见的说法是 overprotective（过度保护）、smothering（令人窒息的关爱/控制）、too affectionate（太黏/太爱表达）。overloving 本身相对不算高频词，写作或描述关系动态时更常出现。"]}
{"word":"overlow","summary":{"en":"“Overlow” is not standard in modern English; it is usually a misspelling of “overflow” or “overload.”","zh":"“overlow”在现代英语中不规范，通常是把“overflow”或“overload”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling; in modern English, people usually mean “overflow” (spill over / exceed capacity) or “overload” (load too much).","zh":"非标准或常见的拼写错误；现代英语里人们通常想表达的是“overflow（溢出/超出容量）”或“overload（超载/负荷过重）”。"},"examples":[{"en":"I think you meant “overflow”: The river overflowed after the heavy rain.","zh":"你可能想写“overflow”：大雨后河水泛滥（溢出河岸）。"},{"en":"If you mean “overload”: Don’t overload the circuit, or the breaker will trip.","zh":"如果你想表达“overload”：不要让电路超载，否则断路器会跳闸。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To lower too much; to depress excessively.","zh":"（罕见/古旧）把……降得太低；过度压低、使过分低落。"},"examples":[{"en":"Some older texts use “overlow” meaning to lower something too far.","zh":"一些较旧的文本里，“overlow”可表示把某物降得过低。"}]}],"synonyms":["overflow","overload"],"phonetic":"/ˌoʊvərˈloʊ/","extraExplanation":["“overlow”在现代英语中几乎不用，因此在写作或考试里建议避免使用。最常见的目标词是：\n- overflow /ˌoʊvərˈfloʊ/（液体或数量“溢出、超出”）\n- overload /ˌoʊvərˈloʊd/（负荷“过重、超载”）\n如果你告诉我句子原文，我可以帮你判断该用哪一个。"]}
{"word":"overlowness","summary":{"en":"“Overlowness” means exaggeratedness—being too grand, inflated, or overdramatic, especially in speech or writing.","zh":"“overlowness”指“夸大、浮夸、过度戏剧化”的特质，常见于言语或写作风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being exaggerated, too grand, or made to seem more important than it really is; over-exaggeration.","zh":"夸大、夸张（的程度）；把事物说得过于重要或过于宏大。"},"examples":[{"en":"Some readers disliked the overlowness of the hero’s speeches because it felt unnatural.","zh":"一些读者不喜欢主人公演讲的夸张感，因为听起来不自然。"},{"en":"The marketing had a sense of overlowness that didn’t match the product’s real value.","zh":"这次营销带有一种夸大的味道，与产品的真实价值不相符。"}]},{"partOfSpeech":"n.","definition":{"en":"(In writing or style) language that is too ornate, inflated, or melodramatic.","zh":"（文体/写作中）辞藻过度华丽或夸饰、矫揉造作的风格。"},"examples":[{"en":"Her teacher advised her to cut the overlowness and use simpler, clearer words.","zh":"老师建议她删掉那些过度夸饰的表达，用更简洁清晰的词。"},{"en":"The poem’s overlowness can be effective in satire, but here it distracts from the message.","zh":"诗歌的夸饰在讽刺作品中可能有效，但在这里反而分散了主题。"}]}],"synonyms":["exaggeration","overstatement","inflation","bombast","grandiloquence"],"phonetic":"ˈoʊvərˌbloʊnəs","extraExplanation":["“overlowness”来自形容词“overblown”（夸大的、言过其实的）+ 名词后缀“-ness”。在现代英语里，人们更常用“exaggeration”或“overstatement”，描述写作风格时也常用“bombast”（浮夸之辞）或“purple prose”（过度华丽的文笔）。"]}
{"word":"overloyal","summary":{"en":"Overloyal means excessively loyal, sometimes to an unhealthy or uncritical extent.","zh":"Overloyal 指“过度忠诚”，常暗示忠诚得不理性或不健康。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too loyal; showing loyalty to an excessive degree, sometimes in a way that is unthinking, unhealthy, or harmful.","zh":"过度忠诚的；忠诚到过头的（有时显得盲目、不健康，甚至会带来伤害）。"},"examples":[{"en":"He was overloyal to his boss and ignored clear signs of wrongdoing.","zh":"他对老板过度忠诚，甚至无视明显的不当行为。"},{"en":"Being overloyal in a friendship can make it hard to set boundaries.","zh":"在友谊中过度忠诚，会让人很难设立界限。"},{"en":"The coach warned the team not to be overloyal to tradition when change was needed.","zh":"教练提醒球队：需要改变时，不要对传统过度忠诚。"}]}],"synonyms":["too loyal","overdevoted","blindly loyal","uncritically loyal"],"phonetic":"/ˌoʊvɚˈlɔɪəl/","extraExplanation":["“over-”这个前缀表示“过度/太……”，所以 overloyal 通常带有轻微负面含义：不是单纯夸赞“很忠诚”，而是暗示忠诚到了不理性、可能纵容错误或牺牲自我利益的程度。","在更自然的日常表达里，英语母语者也常用 “too loyal” 或 “blindly loyal（盲目忠诚）” 来传达类似意思；overloyal 属于可理解但不算特别常见的构词。"]}
{"word":"overloyally","summary":{"en":"“Overloyally” means acting too loyally in an excessive or uncritical way.","zh":"“overloyally”指过度、缺乏判断地忠诚。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too loyal, especially when the loyalty is excessive, unquestioning, or harmful.","zh":"过度忠诚地；盲目忠诚地（指忠诚到了不理性、可能带来伤害的程度）"},"examples":[{"en":"He defended his boss overloyally, even when the evidence was clear.","zh":"即使证据很清楚，他仍过度忠诚地为老板辩护。"},{"en":"Overloyally supporting a friend can sometimes stop them from learning from mistakes.","zh":"对朋友盲目支持有时会让他们无法从错误中学习。"}]}],"synonyms":["too loyally","blindly","unquestioningly","overly loyally","with excessive loyalty"],"phonetic":"/ˌoʊvərˈlɔɪəli/","extraExplanation":["“overloyally”不是很常见的标准词，更常见的表达有：too loyally, blindly loyal(ly), overly loyal(ly) 等。你也可能想查的是 “overly loyally”（更常见拼写）或形容词 “overloyal / overly loyal”。","构词法：over-（过度）+ loyal（忠诚的）+ -ly（副词后缀）。语气通常带批评，暗示这种“忠诚”缺少判断，甚至会纵容不当行为。"]}
{"word":"overloyalties","summary":{"en":"“Overloyalties” means excessive, often uncritical loyalties (plural), especially when they interfere with fairness or good judgment.","zh":"“overloyalties”指（复数）过度、往往不加批判的忠诚，尤其当它影响公正或判断时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or uncritical loyalty (to a person, group, cause, or organization), sometimes to the point of harming fairness or good judgment; plural form: overloyalties","zh":"过度的或不加批判的忠诚（对某个人、团体、事业或组织），有时会影响公正与判断；复数：overloyalties"},"examples":[{"en":"The investigation showed that overloyalties within the team made people hide mistakes.","zh":"调查显示，团队内部的过度忠诚让人们隐瞒错误。"},{"en":"Her overloyalty to her manager stopped her from speaking up about the problem.","zh":"她对经理的过度忠诚让她无法就问题发声。"},{"en":"In politics, overloyalties can create conflicts of interest.","zh":"在政治中，过度忠诚可能会造成利益冲突。"}]}],"synonyms":["blind loyalty","excessive loyalty","misplaced loyalty","overcommitment","partisanship"],"phonetic":"/ˌoʊvɚˈlɔɪəlti/","extraExplanation":["“overloyalties”并不是很常见的标准词汇，更常见的是用单数形式“overloyalty”（过度忠诚），或用更自然的表达如“blind loyalty（盲目忠诚）/ misplaced loyalty（错置的忠诚）/ excessive loyalty（过分忠诚）”。","词形结构：over-（过度）+ loyalty（忠诚）。用于强调忠诚“过了头”，可能带来偏袒、包庇或判断失真等负面效果。"]}
{"word":"overloyalty","summary":{"en":"Overloyalty means loyalty taken too far, often in a way that harms good judgment or fairness.","zh":"overloyalty 指“忠诚过头”，常带贬义，可能损害判断力或公平性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive loyalty; loyalty that is so strong it becomes unhealthy, unfair, or harmful (for example, ignoring evidence, ethics, or other relationships).","zh":"过度忠诚；忠诚强到不健康、不公平或有害（例如无视证据、道德或其他关系）。"},"examples":[{"en":"His overloyalty to his boss made him defend clearly wrong decisions.","zh":"他对老板的过度忠诚让他为明显错误的决定辩护。"},{"en":"Overloyalty can stop a team from admitting mistakes and improving.","zh":"过度忠诚会让团队不愿承认错误、难以改进。"},{"en":"She worried that overloyalty to one friend might hurt her other friendships.","zh":"她担心对一个朋友过度忠诚会伤害她与其他朋友的友谊。"}]}],"synonyms":["blind loyalty","excessive loyalty","misplaced loyalty","unquestioning loyalty"],"phonetic":"/ˌoʊvɚˈlɔɪəlti/","extraExplanation":["“over-”这个前缀表示“过度、太多”（如 overwork 过度工作）。因此 overloyalty 常带批评意味：不是赞美“很忠诚”，而是强调忠诚已经影响判断、原则或公平。","常见语境：职场（对上司/公司不加批判的站队）、政治（对党派/领袖盲目支持）、人际关系（为了“站在朋友一边”而忽略事实）。","更自然的表达有：blind loyalty（盲目忠诚）、misplaced loyalty（错置/不该有的忠诚）、excessive loyalty（过度忠诚）。"]}
{"word":"overlubricate","summary":{"en":"Overlubricate means to put too much lubricant on something; figuratively, it can mean using overly smooth, flattering language.","zh":"overlubricate 指“过度润滑”；比喻义可指“用过分圆滑或奉承的语言把事情说得太顺”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to apply too much lubricant (oil/grease) to a machine or moving part, often causing mess or problems","zh":"给机器或活动部件涂抹过多的润滑油（机油/黄油），常导致脏乱或反而出问题"},"examples":[{"en":"Don’t overlubricate the chain, or it will attract dirt and grit.","zh":"别给链条上太多油，不然会吸附灰尘和砂砾。"},{"en":"The technician warned that overlubricating can damage seals over time.","zh":"技术员提醒说，长期过度润滑可能会损坏密封件。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to make something overly smooth or “slippery,” especially by using too much politeness, praise, or pleasing language","zh":"（比喻）把事情“弄得太圆滑/太滑”，尤指过度客气、过度奉承或用过分讨好的措辞"},"examples":[{"en":"He tried to overlubricate the conversation with compliments, but it felt insincere.","zh":"他用一堆夸奖把对话弄得过于“润滑”，反而显得不真诚。"},{"en":"The memo overlubricated the bad news with soft language.","zh":"那份备忘录用过分委婉的措辞“润滑”坏消息。"}]}],"synonyms":["over-oil","overgrease","apply too much lubricant","overdo the flattery","over-smooth"],"phonetic":"/ˌoʊvɚˈluːbrɪˌkeɪt/","extraExplanation":["这个词由 over-（过度）+ lubricate（润滑）构成，字面意思最常见于机械维护语境：太多润滑剂可能吸灰、结垢、甩油，甚至影响刹车或密封件。","比喻用法不如字面用法常见，但在写作或评论中可以用来批评“过度圆滑/过度粉饰”的表达方式。"]}
{"word":"overlubricated","summary":{"en":"Overlubricated means something has been lubricated too much.","zh":"overlubricated 指“润滑过度、上油过多”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much lubricant (oil/grease), so that something becomes excessively slick, messy, or may malfunction.","zh":"润滑过度的；加了太多润滑油/润滑脂的，导致过于滑、脏乱或可能影响运作。"},"examples":[{"en":"The chain kept slipping because it was overlubricated.","zh":"链条一直打滑，因为润滑过度。"},{"en":"Wipe off the excess oil—this motor sounds overlubricated.","zh":"把多余的油擦掉——这台马达听起来像是润滑过度。"},{"en":"His hair looked overlubricated with pomade.","zh":"他的头发看起来抹发油抹得太多，油腻腻的。"}]}],"synonyms":["over-oiled","overgreased","too oily"],"phonetic":"/ˌoʊvərˈluːbrəˌkeɪtɪd/","extraExplanation":["“over-”是常见前缀，表示“过度、超过需要”。因此 overlubricated 通常带有“多此一举/反效果”的语气，常见于机械保养说明、维修对话中。","在日常描述里也可引申为“油太多、太滑/太油腻”，例如形容头发或表面被抹得过多而显得黏腻。"]}
{"word":"overlubricating","summary":{"en":"Overlubricating means using too much lubricant; it can also (less commonly) mean overdoing smooth, flattering talk.","zh":"overlubricating 指润滑过度；也可（较少）指用过多奉承或客套话来“润滑”交流。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Applying too much lubricant (oil, grease, etc.) to a machine or part, often causing problems like leaking, dirt buildup, or reduced performance.","zh":"给机器或零件上了过多的润滑油（机油、黄油等），常会导致漏油、积灰或性能下降等问题。"},"examples":[{"en":"The bike chain kept attracting dust because I was overlubricating it.","zh":"自行车链条总是吸灰，因为我给它上油上得太多了。"},{"en":"Overlubricating the motor can make it run hotter, not cooler.","zh":"电机润滑过度反而可能让它更热，而不是更凉。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative, less common) Smoothing things over too much with excessive praise or polite talk, sometimes making it feel insincere.","zh":"（比喻用法，较少见）用过多的夸奖或客套话来“润滑”关系，可能显得不真诚。"},"examples":[{"en":"He started overlubricating the conversation with compliments to avoid the hard topic.","zh":"他用一堆夸奖把谈话“润滑”得过头，想避开难题。"}]}],"synonyms":["overgreasing","over-oiling","using too much lubricant","overdoing flattery"],"phonetic":"ˌoʊvərˈlubrɪˌkeɪtɪŋ","extraExplanation":["“over-”表示“过度、超过需要”，与“overwork（过度工作）”“overcook（煮过头）”类似。","在机械保养里，润滑并不是越多越好：过多的油脂容易吸附灰尘形成油泥，或被甩出/渗出，反而加速磨损。通常应按说明书的用量与周期操作。"]}
{"word":"overlubricatio","summary":{"en":"Overlubrication means using too much lubricant, which can create problems instead of preventing them.","zh":"Overlubrication 指润滑过量，往往会带来问题而不是保护设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"too much lubrication (using more oil/grease than needed), which can cause leakage, mess, overheating, or damage.","zh":"过度润滑（油或润滑脂加得太多），可能导致渗漏、脏污、过热或损坏。"},"examples":[{"en":"Overlubrication can attract dust and make the machine wear faster.","zh":"过度润滑会吸附灰尘，反而让机器磨损得更快。"},{"en":"The manual warns that overlubrication may cause grease to leak into the motor.","zh":"说明书警告：过度润滑可能导致润滑脂渗入电机。"}]}],"synonyms":["excess lubrication","over-greasing","over-oiling"],"phonetic":"/ˌoʊvɚˌluːbrɪˈkeɪʃən/","extraExplanation":["你输入的“overlubricatio”很可能是拼写未完成或拼写错误；常见正确拼写是 **overlubrication**。","在设备维护里，润滑并非越多越好：多余的油脂可能搅拌发热（特别是轴承）、把密封挤坏，或把杂质带入关键部位。通常按说明书的油量/油嘴次数来做最安全。"]}
{"word":"overlubrication","summary":{"en":"Overlubrication means using too much lubricant, which can cause mechanical problems.","zh":"overlubrication 指润滑剂使用过量，反而导致机械故障或不良影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of too much lubricant (oil, grease, etc.), especially in machines, so that it causes problems instead of helping","zh":"（尤指机器中）润滑剂（机油、黄油等）使用过量，反而造成问题的情况"},"examples":[{"en":"The motor failed because of overlubrication; excess grease attracted dust and clogged the parts.","zh":"电机因为过度润滑而损坏；多余的黄油吸附灰尘，把零件堵住了。"},{"en":"Our maintenance guide warns that overlubrication can be as harmful as not lubricating at all.","zh":"我们的保养指南提醒：过度润滑可能和完全不润滑一样有害。"},{"en":"To prevent overlubrication, apply only a thin film of oil and wipe off the excess.","zh":"为避免过度润滑，只需涂一层薄油膜，并把多余的擦掉。"}]}],"synonyms":["over-greasing","excess lubrication","over-oiling"],"phonetic":"/ˌoʊvɚˌluːbrəˈkeɪʃən/","extraExplanation":["在工业与设备保养语境中，过度润滑常见后果包括：温度升高（搅拌/剪切阻力变大）、密封件受压损坏、润滑脂被挤入不该进入的部位（如电机绕组或传感器）、以及吸附粉尘导致磨损加剧。很多保养手册强调“适量”与“按周期/按规格（例如 NLGI 等级、加注量）”比“越多越好”更重要。"]}
{"word":"overluscious","summary":{"en":"Overluscious means “too richly sweet or sensuous,” often in a cloying, overdone way.","zh":"overluscious 指“甜腻/浓艳到过头”，带有“过度、发腻”的批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively sweet, rich, or sensual in a way that becomes too much; cloying or overly indulgent.","zh":"过于甜腻、浓重或感官刺激到让人觉得“太过头”的；甜腻得发齁/过分娇艳的。"},"examples":[{"en":"The dessert looked beautiful, but the frosting was overluscious and made it hard to finish.","zh":"这道甜点看起来很漂亮，但糖霜太甜腻了，让人很难吃完。"},{"en":"Some readers find the love scenes overluscious, preferring a simpler style.","zh":"有些读者觉得那些爱情场景过于腻味，更喜欢更简洁的写法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language, art, or style) Overly ornate, sentimental, or “flowery,” sometimes to the point of seeming unrealistic or insincere.","zh":"（指语言、艺术或风格）过分华丽/煽情/辞藻堆砌，甚至显得不真实或不真诚。"},"examples":[{"en":"The ad’s overluscious wording promised happiness in every sip.","zh":"这则广告用过分煽情的措辞，声称每一口都能带来幸福。"},{"en":"Her early poems were vivid but sometimes overluscious in their imagery.","zh":"她早期的诗歌画面感很强，但有时意象过于浓艳。"}]}],"synonyms":["cloying","saccharine","overly sweet","overrich","overindulgent","gooey","flowery"],"phonetic":"/ˌoʊvɚˈlʌʃəs/","extraExplanation":["“over-”表示“过度”，luscious常指“美味多汁/甜美诱人”，也可形容声音、颜色、气氛等“感官上很享受”。overluscious带有明显的批评意味：不是“很好吃/很迷人”，而是“甜到发腻、浓到压人”。","多用于评论食物（甜点、酒、酱汁）或文风/描写（romantic、sentimental、flowery）。在写作评价里，它常暗示“缺少克制（restraint）”。"]}
{"word":"overlusciously","summary":{"en":"“Overlusciously” means “too richly sweet or sensually pleasant,” often to the point of feeling cloying or overdone.","zh":"“overlusciously”表示“过于甜美/浓郁/诱人”，常带“甜腻、过头”的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly rich, sweet, or sensually pleasing way—so much that it can feel too much (cloying).","zh":"以过于甜美、浓郁或感官享受的方式（甜腻到让人觉得过头）。"},"examples":[{"en":"The dessert was overlusciously sweet, and I couldn’t finish it.","zh":"这道甜点甜得过于腻口，我吃不完。"},{"en":"She described the beach in an overlusciously romantic tone.","zh":"她用一种过分甜蜜浪漫的语气描写那片海滩。"}]}],"synonyms":["cloyingly","overly sweetly","lusciously (too much)","overly richly"],"phonetic":"/ˌoʊvɚˈlʌʃəsli/","extraExplanation":["“overlusciously”比较少见，更常见的表达是“too lusciously / overly lush / cloyingly sweet”。它由“over-（过度）+ luscious（甜美/诱人/浓郁）+ -ly（副词）”构成，带有一点写作上的夸张或调侃意味。","在文学或影评里，它常用来暗示“美得不真实、甜得发腻、华丽到显得矫饰”，语气可能是赞叹，也可能是轻微批评。"]}
{"word":"overlusciousness","summary":{"en":"Overlusciousness means “excessive lusciousness”—rich, sweet, or sensuous in a way that feels too much.","zh":"overlusciousness 指“过度的甜美/浓郁/诱人”，强烈到让人觉得太腻、太过头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too luscious: excessively rich, sweet, or sensually pleasing (often to the point of feeling heavy, cloying, or “too much”).","zh":"“过于甜美/浓艳/丰腴”的特质：美味、甜腻或感官享受强烈到让人觉得厚重、腻人或“过头了”。"},"examples":[{"en":"Some diners loved the cake’s richness, but others complained about its overlusciousness.","zh":"有些食客喜欢蛋糕的浓郁，但也有人抱怨它过于甜腻。"},{"en":"The perfume’s overlusciousness made it feel overwhelming in a small room.","zh":"这款香水过于浓艳，在小房间里让人觉得很压迫。"}]}],"synonyms":["cloying richness","overrichness","saccharinity","sickly sweetness","excessive sweetness"],"phonetic":"/ˌoʊvɚˈlʌʃəsnəs/","extraExplanation":["这个词比较少见，多用于强调“luscious（甜美/浓郁/诱人）”到了“过度”的程度。构词上是 over-（过度）+ luscious（甜美、浓郁、诱人）+ -ness（名词后缀，表示性质/状态）。在写作里常带一点主观评价：不一定完全负面，但通常暗示“太腻、太满、太强烈”。"]}
{"word":"overlush","summary":{"en":"“Overlush” means excessively lush—too rich, dense, or elaborately beautiful in a way that can feel overdone.","zh":"“Overlush”指“过于葱郁或过分浓艳华丽”，美感过头而显得累赘或夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too lush; excessively rich, green, elaborate, or sensually “full,” sometimes in a way that feels heavy or overdone.","zh":"过于茂密的；过分浓艳/华丽的；（氛围或描写）过度丰盛、浓重，甚至显得腻或夸张。"},"examples":[{"en":"The garden looked beautiful, but the vines were so overlush that they blocked the windows.","zh":"花园很美，但藤蔓过于茂密，把窗户都挡住了。"},{"en":"Some readers felt the novel’s descriptions were overlush and slowed down the story.","zh":"有些读者觉得这部小说的描写过于浓艳铺陈，拖慢了叙事节奏。"},{"en":"The room’s overlush decor—velvet curtains, gold frames, and heavy perfume—felt overwhelming.","zh":"房间的装饰过于华丽浓重——天鹅绒窗帘、金色画框加上浓香水味——让人有点喘不过气。"}]}],"synonyms":["overgrown","too lush","overabundant","overly ornate","too rich","cloying"],"phonetic":"/ˌoʊvɚˈlʌʃ/","extraExplanation":["“Lush”常带正面意思（郁郁葱葱、丰盈迷人），加上前缀“over-”后语气转为“过度”，常含轻微批评：太多、太浓、太满，失去清爽或节制。","也可用于写作/艺术评论：overlush descriptions（描写过度华丽/堆砌）、overlush style（过分浓艳的风格）。在自然场景里则多指植物长得“太密/太旺”，影响采光、通风或维护。"]}
{"word":"overlushly","summary":{"en":"“Overlushly” means “in an overly lush or overly romantic/ornate way,” often implying “too much.”","zh":"“overlushly”表示“过分繁茂/浓艳或过分浪漫华丽地”，通常暗含“太过头”的意思。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively lush, rich, or heavily decorative way (often suggesting something is too green, too ornate, or “too much”).","zh":"以过分繁茂、浓艳或过度华丽的方式（常带有“太过头”的评价，指太绿、太装饰或太浓重）。"},"examples":[{"en":"The garden was overlushly planted, so many flowers fought for space and light.","zh":"花园种得过于繁茂，太多花争抢空间和阳光。"},{"en":"The hotel lobby was overlushly decorated with velvet and gold, which some guests found overwhelming.","zh":"酒店大堂用天鹅绒和金色装饰得过于华丽，一些客人觉得很压迫、眼花缭乱。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an overly sensual, soft, or romantic style (especially about writing, music, or imagery).","zh":"以过分感官化、柔软或浪漫的风格（常用于形容文字、音乐或画面过于“甜腻/肉麻”）。"},"examples":[{"en":"The movie’s soundtrack swelled overlushly during every emotional scene.","zh":"电影配乐在每个煽情场景里都过分“膨胀”地渲染情绪。"},{"en":"Her description of the sunset was overlushly poetic for a simple travel note.","zh":"她对日落的描写诗意得过头了，不太像一篇朴素的旅行记录。"}]}],"synonyms":["excessively","overly richly","too ornately","lavishly (often neutral)","opulently","cloyingly (when too sweet/romantic)"],"phonetic":"/ˌoʊvərˈlʌʃli/","extraExplanation":["“overlushly”不算常见词，多见于评论性写作（影评、书评、艺术评论、园艺/景观描述）里，用来表达“太浓、太满、太甜、太装饰”的审美判断。","构词很好理解：over-（过度）+ lush（繁茂/浓艳/感官丰富）+ -ly（副词）。实际使用时，语气常偏批评或带一点调侃。"]}
{"word":"overlushness","summary":{"en":"Overlushness means an excessive, too-rich lush quality in appearance, style, or growth.","zh":"overlushness 指“过度的葱郁/浓艳/华丽”，常暗示美感过头、显得腻或喧宾夺主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too lush, rich, or luxuriant (often in a way that feels excessive or heavy)","zh":"过于繁茂、浓艳或奢华的状态（常带“过头、显得沉重/腻”的意味）"},"examples":[{"en":"Some critics felt the film’s visual style had a kind of overlushness that distracted from the story.","zh":"一些评论家觉得这部电影的视觉风格有种“过度浓艳”的感觉，反而分散了对剧情的注意力。"},{"en":"The garden’s overlushness made it beautiful, but also hard to maintain.","zh":"花园过于繁茂，虽然好看，但也更难打理。"}]}],"synonyms":["excessive lushness","overabundance","luxuriance (often neutral)","ornateness (in style)","overgrowth (for plants)"],"phonetic":"/ˌoʊvɚˈlʌʃnəs/","extraExplanation":["“overlushness”并不是特别常见的标准词条，更常见的表达是“over-lush (style/imagery)”或用“excessive lushness / too much lushness”。它由前缀 over-（过度）+ lush（葱郁/浓艳）+ -ness（名词后缀）构成。","在文学与影评/艺术评论里，“lush”常形容语言、音乐、画面“华丽、丰盛、感官强烈”；加上 over- 后，语气往往转为批评：强调“甜腻、堆砌、喧宾夺主”。"]}
{"word":"overlustiness","summary":{"en":"Overlustiness means excessive lust or overly vigorous, boisterous behavior.","zh":"overlustiness 指“过度的欲望（常指性欲）”，也可指“过分精力旺盛、喧闹粗放的表现”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive lustiness; too much strong desire (often sexual) or overly vigorous, hearty behavior.","zh":"过度的“lustiness（欲望/精力旺盛）”；指欲望（常指性欲）太强，或表现得过分精力充沛、粗放热烈。"},"examples":[{"en":"The novel hints that his downfall began with overlustiness rather than love.","zh":"小说暗示他的堕落起于过度的欲望，而不是爱情。"},{"en":"Her boss criticized the team’s overlustiness at the party—too loud, too wild.","zh":"老板批评团队在派对上的“过分放纵与闹腾”——太吵、太疯。"}]}],"synonyms":["excessive lust","lecherousness","overindulgence","boisterousness"],"phonetic":"/ˌoʊvɚˈlʌstinəs/","extraExplanation":["这个词非常少见，多出现在较文学化或带调侃的语境里。更常用的表达包括：excessive lust（过度欲望）、oversexed（性欲过强，口语且略带评判）、overly rowdy（过于闹腾）、too boisterous（太喧闹）。","构词：over-（过度）+ lusty（欲望强/精力旺盛）+ -ness（名词后缀）。lusty 既可指“性欲强”，也可指“健壮、有活力、热烈”（如 lusty laugh “爽朗的大笑”）。因此 overlustiness 可能偏“色欲过强”，也可能偏“过分粗豪热烈”，具体看上下文。"]}
{"word":"overlusty","summary":{"en":"Overlusty means excessively lusty—often suggesting too much sexual desire; less commonly, it can mean overly vigorous or exuberant.","zh":"overlusty 指“过于好色/欲望太强”（更常见）；也可较少见地指“过于旺盛、亢奋”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) excessively lusty; showing too much sexual desire or earthy passion.","zh":"（古旧或文学用语）过于好色的；性欲或肉欲表现得太强烈的。"},"examples":[{"en":"The poet warns against overlusty desires that can cloud one’s judgment.","zh":"诗人告诫人们要警惕过于强烈的欲望，因为它会蒙蔽判断。"},{"en":"In the old tale, an overlusty knight brings trouble upon himself.","zh":"在那个古老故事里，一位过于好色的骑士给自己招来麻烦。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) overly exuberant, high-spirited, or vigorous; too “lusty” in energy or appetite.","zh":"（较少见）过于兴旺有劲的；精力或胃口“太旺盛”的。"},"examples":[{"en":"The coach calmed the overlusty crowd before the game began.","zh":"比赛开始前，教练让过于亢奋的观众冷静下来。"},{"en":"The garden looked overlusty after weeks of heavy rain and sun.","zh":"连着几周雨水和日照后，花园显得过于繁茂旺盛。"}]}],"synonyms":["overly lustful","lecherous","lustful","libidinous","overheated"],"phonetic":"/ˌoʊvɚˈlʌsti/","extraExplanation":["“over-”表示“过度、太……”，加在“lusty”（强健的；（有时）性欲强的）前面，形成“overlusty”。","这个词在现代日常英语中很少用，更常见的表达是“overly lustful / too lustful / lecherous”。在阅读古典文学或较老的文本时更可能见到。"]}
{"word":"overluxuriance","summary":{"en":"Overluxuriance means “too much luxuriance”—an excess of richness or lushness that becomes heavy or overdone.","zh":"overluxuriance 指“过度的繁茂或华丽”，丰富到显得累赘、过头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive richness, abundance, or luxuriant growth/style (so much that it feels heavy, messy, or overly ornate).","zh":"过度的繁茂／丰盛；（风格或装饰）过分华丽、堆砌，以至显得累赘或失衡。"},"examples":[{"en":"Some readers felt the novel’s overluxuriance of description slowed the story down.","zh":"有些读者觉得这部小说描写过于繁复华丽，反而拖慢了叙事。"},{"en":"The garden’s overluxuriance made it beautiful, but also hard to maintain.","zh":"花园过于繁茂，虽然很美，但也很难打理。"}]}],"synonyms":["excess","overabundance","exuberance (often neutral/positive)","ornateness","profusion"],"phonetic":"/ˌoʊvɚˈlʌɡʒʊriəns/","extraExplanation":["“over-”表示“过度、太过”，加在“luxuriance（繁茂；华丽）”前面，构成一个较少见、偏书面/评论性用词，常用于文学批评、艺术评论或描写自然景观。","语气上往往带一点负面评价：不是单纯“很美/很丰富”，而是“多到影响效果”。更常见的近似表达有：excessive luxuriance / overabundance / too ornate。"]}
{"word":"overluxuriancy","summary":{"en":"Overluxuriancy means “too much luxuriance”—excessive richness or profuse growth, often with a critical tone.","zh":"overluxuriancy 指“过度的繁茂/华丽丰盛”，常带批评意味，强调“多到过头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive luxuriance; too much richness, fullness, or profuse growth (often said of vegetation, decoration, or writing style).","zh":"过度繁茂；过分的华丽/丰盛/浓密（常形容植物长势、装饰或文风过于铺张）。"},"examples":[{"en":"The garden’s overluxuriancy made the paths hard to find.","zh":"花园过度繁茂，连小路都快找不到了。"},{"en":"Some readers felt the novel’s descriptions had an overluxuriancy that slowed the story.","zh":"有些读者觉得这部小说的描写过于繁复华丽，拖慢了叙事节奏。"}]}],"synonyms":["excess","overabundance","profusion","rank growth","ornateness"],"phonetic":"/ˌoʊvɚlʌɡˈʒʊriənsi/","extraExplanation":["这是一个非常少见的词，多见于较正式或批评性的语境。结构上是 over-（“过度”）+ luxuriancy（“繁茂；华丽丰盛”）。","常带有评价色彩：不只是“很美/很丰富”，而是“多到有点过头”，可能造成杂乱、负担或分散重点。","更常见的表达包括：excessive luxuriance（过度繁茂/过度华丽）、overabundance（过量）、overgrowth（杂草丛生/过度生长）、ornateness（过分华丽的文风）。"]}
{"word":"overluxuriant","summary":{"en":"“Overluxuriant” means excessively lush or overly ornate.","zh":"“overluxuriant”指过于繁茂，或（风格上）过分华丽繁复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively lush, abundant, or richly grown; more luxuriant than is normal or desirable.","zh":"过于繁茂的；过度茂盛或丰盛的（多到不太正常或不太合适）。"},"examples":[{"en":"After weeks of rain, the garden became overluxuriant and started to crowd the walkway.","zh":"连下了几周雨，花园变得过于繁茂，开始挤占人行道。"},{"en":"Some critics called his writing style overluxuriant—beautiful, but sometimes too ornate.","zh":"一些评论家说他的文风过于华丽繁复——很美，但有时过于雕琢。"}]}],"synonyms":["exuberant","overgrown","lush","profuse","ornate"],"phonetic":"/ˌoʊvɚlʌɡˈʒʊriənt/","extraExplanation":["这个词由 over-（过度）+ luxuriant（繁茂的/华丽的）构成，语气通常带一点“过头了”的评价色彩。","在文学评论里，它常用来形容描写或修辞“太浓、太满”（比如形容词太多、意象过密），与 plain（朴素）或 restrained（克制的）形成对比。"]}
{"word":"overluxuriantly","summary":{"en":"“Overluxuriantly” means “in an excessively lush or ornate way.”","zh":"“overluxuriantly”表示“过分繁茂或过分华丽地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is excessively luxuriant—too rich, abundant, lush, or ornate.","zh":"以过分繁茂／丰盛／华丽的方式；过于浓丽、过于铺张地。"},"examples":[{"en":"The garden was overluxuriantly planted, so the paths quickly disappeared under leaves and vines.","zh":"花园种得过分繁茂，小径很快就被叶子和藤蔓淹没了。"},{"en":"Her prose felt overluxuriantly descriptive, full of long images that slowed the story down.","zh":"她的文笔显得过于浓丽堆砌，冗长的意象让故事节奏变慢。"},{"en":"The hotel lobby was decorated overluxuriantly, with gold trim on nearly every surface.","zh":"酒店大堂装饰得过于奢华，几乎每个表面都有金色镶边。"}]}],"synonyms":["excessively","overly","lavishly","opulently","lushly"],"phonetic":"/ˌoʊvɚlʌɡˈʒʊriəntli/","extraExplanation":["这个词比较少见，常见于描写自然景象或写作风格的文学化表达。它由前缀 over-（“过度、太……”）+ luxuriant（“繁茂的；华丽的”）构成，所以语气通常带一点“太过了”的评价。","在写作里可以用来批评“过度修饰”（比如语言太堆砌、装饰太浮夸），也可以用来形容自然生长得“旺到失控”。"]}
{"word":"overluxurious","summary":{"en":"Overluxurious means “too luxurious,” often with a critical tone.","zh":"overluxurious 指“过于奢华的”，常带批评语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too luxurious; more elaborate, expensive, or comfortable than is necessary or appropriate.","zh":"过于奢华的；奢侈到超过必要或合适程度的。"},"examples":[{"en":"The hotel room felt overluxurious for a one-night business trip.","zh":"对一次只住一晚的出差来说，这间酒店房间显得过于奢华。"},{"en":"Some critics called the wedding overluxurious and out of touch with ordinary people.","zh":"一些评论者认为这场婚礼过于奢华，脱离普通人的生活。"}]}],"synonyms":["overly luxurious","too luxurious","excessively luxurious","opulent (often approving/neutral)","lavish (sometimes critical)"],"phonetic":"/ˌoʊvɚlʌɡˈʒʊriəs/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常/合理范围”（如 overconfident 过度自信、overpriced 价格过高）。因此 overluxurious 通常带有负面评价，暗示“奢华得不必要/不合适”。","这个词在日常口语中不算高频，更常见的说法有 “too luxurious / overly luxurious / excessively luxurious”。在正式写作或评论中用 overluxurious 会更强调“过度”并带一点批评语气。"]}
{"word":"overluxuriously","summary":{"en":"Overluxuriously means “in an excessively luxurious way.”","zh":"overluxuriously 的意思是“过度奢华地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively luxurious way; with more comfort, richness, or expense than is necessary or appropriate.","zh":"过度奢华地；以超出必要或合适程度的舒适、华丽或花费来进行。"},"examples":[{"en":"The hotel room was decorated overluxuriously, with gold trim and heavy velvet curtains.","zh":"这间酒店客房装饰得过度奢华，镶着金边，还挂着厚重的天鹅绒窗帘。"},{"en":"They lived overluxuriously for a year, then realized they needed to save money.","zh":"他们过度奢华地生活了一年，后来才意识到需要存钱。"},{"en":"The party felt overluxuriously planned for such a small, informal gathering.","zh":"对这样一个小型、随意的聚会来说，这场派对安排得显得过度奢华。"}]}],"synonyms":["too luxuriously","overly lavishly","extravagantly","opulently"],"phonetic":"/ˌoʊvərˈlʌɡʒəriəsli/","extraExplanation":["构词提示：over- 常表示“过度、过分”，luxuriously 表示“奢华地”。所以 overluxuriously = “过分奢华地”。","语气与使用：这个词通常带有评价色彩，暗示“太夸张、没必要、铺张”。日常写作里更常见的表达是 “too luxuriously / in an overly luxurious way”。"]}
{"word":"overluxuriousness","summary":{"en":"Overluxuriousness means “too much luxury,” often with a negative sense (wasteful or showy).","zh":"overluxuriousness 指“过度奢华”，常带贬义（浪费、炫耀或不合时宜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being excessively luxurious—having (or showing) too much luxury in a way that can feel wasteful, showy, or inappropriate.","zh":"过度奢华的状态或特质——奢侈得过头，常带有浪费、炫耀或不合时宜的感觉。"},"examples":[{"en":"Some critics said the hotel’s redesign crossed the line into overluxuriousness, with gold everywhere and little comfort.","zh":"一些评论者说这家酒店的重新设计越界成了过度奢华：到处都是金色装饰，却谈不上舒适。"},{"en":"During an economic downturn, the overluxuriousness of the party looked insensitive.","zh":"在经济不景气时，这场聚会的过度奢华显得不太体贴、缺乏分寸。"}]}],"synonyms":["excessive luxury","overindulgence","opulence (often critical)","extravagance"],"phonetic":"/ˌoʊvɚlʌɡˈʒʊriəsnəs/","extraExplanation":["“overluxuriousness”是由 over-（过度）+ luxurious（奢华的）+ -ness（名词后缀）组成的派生名词，意思很直观，但在真实语料中相对少见；更常见的说法是“excessive luxury”“overindulgence”或直接用“luxury”加上语境说明。","语感上它常带批评意味：不仅是“很豪华”，而是“豪华得不必要/不合时宜”。在写作中适合用来强调“过头”的程度与价值判断。"]}
{"word":"overly","summary":{"en":"“Overly” means “too much” and often suggests something goes beyond a reasonable level.","zh":"“overly”表示“过度/太……”，常暗示超过合理程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too much; more than is reasonable, necessary, or desirable.","zh":"过度地；太多地（超过合理、必要或理想的程度）。"},"examples":[{"en":"The instructions are overly complicated.","zh":"这些说明太复杂了。"},{"en":"She was overly critical of her own work.","zh":"她对自己的作品过于挑剔。"},{"en":"Don’t worry overly about small mistakes.","zh":"别为小错误过度担心。"}]}],"synonyms":["too","excessively","unduly"],"phonetic":"/ˈoʊvɚli/","extraExplanation":["“overly”常用来修饰形容词或副词，语气比“very”更偏负面，强调“过头了/不必要地”。例如“overly strict（过于严格）”“overly optimistic（过度乐观）”。","近义表达对比：\n- overly：偏“超过合适范围”（常带批评或提醒）\n- too：更口语、直接（too expensive 太贵）\n- excessively：更正式、更强烈（excessively noisy 过分吵闹）","常见搭配：overly sensitive（过于敏感）、overly cautious（过于谨慎）、overly dependent on（过度依赖……）、overly concerned about（过度担心……）。"]}
{"word":"overlying","summary":{"en":"“Overlying” means lying on top of or covering something; in geology, it describes one layer resting above another.","zh":"“overlying”意为“在……上方的/覆盖的”；在地质学中指一层地层上覆于另一层之上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lying on top of something; covering it","zh":"在……上方的；覆盖在……上面的"},"examples":[{"en":"The overlying blanket kept the child warm.","zh":"盖在上面的毯子让孩子很暖和。"},{"en":"Remove the overlying layer of dust before you paint.","zh":"上漆前先把表面的灰尘层清理掉。"},{"en":"The overlying clouds blocked the sun.","zh":"上方的云层挡住了阳光。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “overlie”) to lie on top of something, especially in geology (one layer resting above another)","zh":"（overlie 的现在分词）位于……之上；（尤指地质）上覆于（另一地层之上）"},"examples":[{"en":"A younger rock layer is overlying the older one.","zh":"较年轻的岩层上覆在较老的岩层之上。"},{"en":"Clay is overlying the sand in this section.","zh":"在这一段剖面里，黏土层上覆着砂层。"}]}],"synonyms":["covering","upper","superior","overlaying","superjacent"],"phonetic":"/ˌoʊvərˈlaɪɪŋ/","extraExplanation":["“overlying”在日常英语里多指“覆盖在上面的（东西）”，比如overlying layer（表层/覆盖层）。在地质学语境里非常常见，常用来描述地层关系：A is overlying B（A层位于B层之上）。"]}

