{"word":"overbade","summary":{"en":"“Overbade” is a rare, old-fashioned past tense of “overbid,” meaning to bid higher than others.","zh":"“overbade”是“overbid”的少见旧式过去式，意思是出价高于他人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Simple past form of “overbid” (rare/old-fashioned): to bid more than someone else; to offer a higher price than others, especially at an auction.","zh":"“overbid”的一般过去式（少见/较旧用法）：出价高于他人；（尤指在拍卖中）以更高价格竞价。"},"examples":[{"en":"At the auction, a collector overbade everyone and won the painting.","zh":"在拍卖会上，一位收藏家出价高过所有人，拍下了那幅画。"},{"en":"She overbade her rival by fifty dollars.","zh":"她比竞争对手多出价50美元。"}]}],"synonyms":["overbid","outbid"],"phonetic":"ˌoʊvɚˈbeɪd","extraExplanation":["“overbade”之所以少见，是因为现代英语里“overbid”的过去式通常仍写作“overbid”。“overbade”属于较古老的类比形式：bid 的旧式过去式是 bade，所以有人也把 overbid 的过去式写成 overbade。今天在正式或常用写作中，建议用 overbid（过去式/过去分词同形）。"]}
{"word":"overbait","summary":{"en":"“Overbait” means using or adding too much bait, especially in fishing.","zh":"“overbait”指（尤其在钓鱼时）用或投放过多的饵/窝料。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use too much bait (especially when fishing), or to bait something more than is necessary","zh":"（尤指钓鱼时）放过多的饵；过度下饵"},"examples":[{"en":"If you overbait the hook, small fish may steal the bait before you get a bite.","zh":"如果你钩上饵放得太多，小鱼可能会在你中鱼前把饵偷走。"},{"en":"Try not to overbait—just a small piece is enough.","zh":"尽量别下饵过量——一小块就够了。"}]},{"partOfSpeech":"v.","definition":{"en":"to add too much bait or groundbait to the water, which can make fish full and less likely to bite","zh":"（向水中）撒窝料/诱饵过量，导致鱼吃饱而不太咬钩"},"examples":[{"en":"We overbaited the spot, and the fish stopped biting after ten minutes.","zh":"我们那块地方撒窝料太多了，十分钟后鱼就不怎么咬钩了。"}]}],"synonyms":["use too much bait","overfeed (fish)","bait too heavily"],"phonetic":"/ˌoʊvɚˈbeɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、太多”（如 overcook 煮过头、overwork 过度工作）。因此 overbait 很直观：bait（下饵/诱饵）+ over（过度）＝下饵过量。","该词更多见于钓鱼语境，在日常口语里不算高频；更常见的表达还有 “use too much bait / put on too much bait”。"]}
{"word":"overbake","summary":{"en":"Overbake means to bake something too long so it becomes dry, hard, or burnt.","zh":"Overbake 指把食物烤得太久，导致变干、变硬或烤焦。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bake for too long, so food becomes too dry, hard, or burnt","zh":"烤得太久（导致食物变干、变硬或烤焦）"},"examples":[{"en":"Don’t overbake the cookies, or they’ll turn hard.","zh":"别把饼干烤过头，不然会变硬。"},{"en":"I overbaked the cake and the edges burned.","zh":"我把蛋糕烤过头了，边缘都烤焦了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of food) to be baked too long and become dry or burnt","zh":"（食物）被烤过头，变干或烤焦"},"examples":[{"en":"If it overbakes, the bread will lose its softness.","zh":"如果烤过头，面包就会失去柔软。"}]}],"synonyms":["overcook","burn","char","dry out"],"phonetic":"/ˌoʊvɚˈbeɪk/","extraExplanation":["在食谱里常见的提示有“Do not overbake.”，尤其用于饼干、蛋糕、布朗尼等：它们从烤箱取出后还会靠“余温”继续熟一点（carryover cooking），所以通常建议在“刚刚定型/边缘变金黄、中心略软”时就出炉。"]}
{"word":"overbaked","summary":{"en":"Overbaked means baked too long (too dry/hard/burned). Informally, it can also mean overly complicated or overworked.","zh":"overbaked 指“烤过头的”（太干/太硬/烤焦）；口语中也可指“过度设计、过度加工”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cooked in an oven for too long, so it becomes too dry, too hard, or burned.","zh":"烤得过久的；因烘烤时间太长而变得太干、太硬或烤焦。"},"examples":[{"en":"The cookies were overbaked and turned crunchy instead of chewy.","zh":"饼干烤过头了，变得很脆，而不是有嚼劲。"},{"en":"I overbaked the cake, so the edges are dry.","zh":"我蛋糕烤过头了，所以边缘很干。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having too many details or too much planning; not natural, fresh, or original (informal).","zh":"（非正式）过度设计的；太繁琐、太“用力”，显得不自然、不新鲜或缺乏创意。"},"examples":[{"en":"The plot feels overbaked, with too many twists that don’t matter.","zh":"这个剧情感觉“过度烘焙”，无关紧要的反转太多。"},{"en":"Her speech sounded a bit overbaked—every sentence was polished, but it didn’t feel real.","zh":"她的演讲听起来有点“过度加工”——每句都很精致，但不太真实。"}]}],"synonyms":["overcooked","burnt","overdone","overthought","overcomplicated","contrived"],"phonetic":"/ˌoʊvɚˈbeɪkt/","extraExplanation":["字面意思来自烘焙：over-（过度）+ baked（烤过的）。因此它既能描述食物“烤过头”，也常被借用来形容想法、剧本、方案“做得太满、太复杂”，像面包烤太久一样失去原本的口感与自然感。","近义表达（不同语气）：用于食物时可说 overcooked / burnt（更严重时）；用于想法或作品时可说 overthought（想太多）、overcomplicated（过度复杂）、contrived（刻意、做作）。"]}
{"word":"overbakes","summary":{"en":"“Overbakes” means bakes something too long, making it dry, hard, too dark, or burnt.","zh":"“overbakes”指把食物烤得太久，导致变干、变硬、颜色过深或烤焦。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bake something for too long, so it becomes too dry, hard, dark, or burnt","zh":"把（食物）烤得太久，导致变干、变硬、颜色过深或烤焦"},"examples":[{"en":"She overbakes the cookies if she leaves them in for even two extra minutes.","zh":"她只要多烤两分钟就会把饼干烤过头。"},{"en":"Don’t overbake the cake—check it with a toothpick at 30 minutes.","zh":"别把蛋糕烤过头——30分钟时用牙签检查一下。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to heat or cook something too much in a way similar to baking, ruining the texture","zh":"（较少见）把某物加热/烹调过度（类似烘烤），从而破坏口感或质地"},"examples":[{"en":"The casserole overbakes easily, so cover it with foil for the first half.","zh":"这道砂锅菜很容易烤过头，所以前半段先用锡纸盖住。"}]}],"synonyms":["overcook","burn","scorch","cook too long"],"phonetic":"ˌoʊvərˈbeɪk","extraExplanation":["“overbakes”是动词“overbake”的第三人称单数（he/she/it overbakes）。常见相关形式：overbake（原形），overbaked（过去式/过去分词），overbaking（现在分词）。","前缀“over-”常表示“过度、过头”（如 overcook 煮过头、overheat 过热、overwork 过度工作）。理解这个前缀能帮助你快速猜词义。"]}
{"word":"overbaking","summary":{"en":"Overbaking means baking food too long, causing it to become too dry, hard, dark, or burnt.","zh":"Overbaking 指食物烤得太久，导致变干、变硬、上色过深或烤焦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or result of baking something for too long, so it becomes too dry, hard, dark, or burnt","zh":"烤得太久（的行为或结果），导致食物变得太干、太硬、颜色过深或烤焦"},"examples":[{"en":"The cake was dry because of overbaking.","zh":"蛋糕很干，是因为烤过头了。"},{"en":"Overbaking can ruin cookies by making them hard instead of chewy.","zh":"烤过头会毁了饼干：本来该有嚼劲，却变得很硬。"},{"en":"To avoid overbaking, check the bread a few minutes before the recipe time ends.","zh":"为了避免烤过头，可以在食谱时间结束前几分钟就检查面包。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “overbake”: baking something longer than needed","zh":"“overbake”的 -ing 形式：把食物烤得比需要的时间更久"},"examples":[{"en":"She kept opening the oven door and still ended up overbaking the muffins.","zh":"她一直开烤箱门，结果还是把玛芬烤过头了。"},{"en":"Overbaking the fish will make it tough.","zh":"鱼烤过头会变老、变韧。"}]}],"synonyms":["overcooking (general)","baking too long","overbrowning","burning"],"phonetic":"/ˌoʊvərˈbeɪkɪŋ/","extraExplanation":["在烘焙语境里，overbaking 常见的“后果词”有：dry（太干）、hard（太硬）、burnt（烤焦）、overbrowned（上色过深）。有时外观看起来没问题，但内部水分已经流失，所以也算 overbaking。","和 overcook（一般“煮/炒/烹饪过头”）相比，overbake 更偏向“烤箱烘烤”的场景，如 cake、cookies、bread、muffins 等。"]}
{"word":"overbalance","summary":{"en":"Overbalance means to lose (or cause) physical balance, or to outweigh something in influence.","zh":"overbalance 可指（使）失去身体/物体平衡，也可指在影响或利弊上“超过、压倒”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to lose balance or stability and start to fall, especially by leaning too far","zh":"失去平衡、失稳而要跌倒（尤指身体倾斜过度）"},"examples":[{"en":"He overbalanced on the wet steps and grabbed the rail just in time.","zh":"他在湿滑的台阶上失去平衡，及时抓住扶手才没摔倒。"},{"en":"The child overbalanced while reaching for the ball.","zh":"孩子伸手去够球时失去平衡了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone or something lose balance; to upset the stability of","zh":"使（人或物）失去平衡；使不稳"},"examples":[{"en":"A sudden push overbalanced him.","zh":"突然的一推把他弄得失去平衡。"},{"en":"Loading too much weight on one side can overbalance the boat.","zh":"一侧装载过重会使船失去平衡。"}]},{"partOfSpeech":"v.","definition":{"en":"to be greater or stronger than something else; to outweigh or counteract","zh":"胜过；超过；抵消（某事物的影响）"},"examples":[{"en":"The benefits overbalance the risks for most patients.","zh":"对大多数病人来说，收益胜过风险。"},{"en":"Her kindness overbalanced his impatience.","zh":"她的善意抵消了他的不耐烦。"}]}],"synonyms":["lose balance","topple","unbalance","upset","outweigh"],"phonetic":"/ˌoʊvɚˈbæləns/","extraExplanation":["“over-”常表示“过度/超过”，而“balance”是“平衡”。因此 overbalance 既可以指“身体/物体失衡”，也可以引申为“（影响、力量、利弊）超过/压倒”。","在现代日常英语里，“lose your balance / fall over / outweigh”更常见；overbalance 稍偏书面或描述性写法，常见于叙述、新闻或文学描写。"]}
{"word":"overbalanced","summary":{"en":"Overbalanced means not properly balanced (too much weight on one side) or, figuratively, outweighed/overpowered by something stronger.","zh":"Overbalanced 指一边过重而失衡（易倾倒），也可比喻被更强因素压过、被压倒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much weight on one side; not properly balanced, so it may tip or fall.","zh":"（重量）一边过重的；失去平衡、容易倾倒的。"},"examples":[{"en":"The overbalanced ladder slipped, and he had to grab the railing.","zh":"这把一边过重、失去平衡的梯子滑了一下，他只好抓住栏杆。"},{"en":"Be careful—if the box is overbalanced, it can topple when you lift it.","zh":"小心——如果箱子重心偏了，你一抬它就可能翻倒。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Weighed down by something stronger or more influential; outweighed or overpowered.","zh":"（比喻）被更强的力量压过的；被压倒的、被“胜过”的。"},"examples":[{"en":"His argument felt overbalanced by the facts in the report.","zh":"他的论点在报告里的事实面前显得被压倒了。"},{"en":"Their excitement was overbalanced by worry about the future.","zh":"他们的兴奋被对未来的担忧压过了。"}]}],"synonyms":["unbalanced","off-balance","lopsided","outweighed","overpowered","overshadowed"],"phonetic":"/ˌoʊvərˈbælənst/","extraExplanation":["“overbalanced”来自动词“to overbalance”，既可以指物理上的“重心偏、失衡”，也可以指抽象意义上的“某种因素在比较中占了上风”。在写作里常见于描述“力量对比”或“情绪被另一种情绪盖过”。","近义表达（按语境选择）：物理失衡可用“off-balance / unbalanced / lopsided”；比喻意义可用“outweighed / overshadowed / overpowered”。"]}
{"word":"overbalances","summary":{"en":"“Overbalances” means (1) causes something to lose balance or tip, or (2) outweighs/is stronger than something else; it can also mean someone loses balance.","zh":"“overbalances”表示（1）使失去平衡或倾倒，（2）在比较中胜过/超过；也可表示（人）自己失去平衡。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone or something lose balance; to tip so it is no longer stable","zh":"使（人或物）失去平衡；使倾斜而不稳"},"examples":[{"en":"The sudden push overbalances the cyclist, and he falls.","zh":"突然的一推让骑车的人失去平衡，结果摔倒了。"},{"en":"Be careful—if you lean too far, the chair may overbalance.","zh":"小心——如果你靠得太远，椅子可能会失去平衡而翻倒。"}]},{"partOfSpeech":"v.","definition":{"en":"to be greater or stronger than something else; to outweigh (often used figuratively)","zh":"（常作比喻）超过；胜过；抵消并占上风"},"examples":[{"en":"Her kindness overbalances his harsh words.","zh":"她的善意盖过了他的刻薄话。"},{"en":"The risks overbalance the benefits in this plan.","zh":"这个计划的风险超过了收益。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose balance and start to fall or tip over","zh":"（自身）失去平衡而要跌倒／翻倒"},"examples":[{"en":"He overbalances on the icy steps and grabs the railing.","zh":"他在结冰的台阶上失去平衡，赶紧抓住栏杆。"}]}],"synonyms":["outweigh","overweigh","tip","unbalance","overturn"],"phonetic":"/ˌoʊvɚˈbæləns/","extraExplanation":["“overbalances”是动词“overbalance”的第三人称单数形式（he/she/it overbalances）。既可用于字面意义（身体、物体的平衡），也常用于抽象意义（优缺点、情感、因素之间“哪一方更占优势/更有分量”）。"]}
{"word":"overbalancing","summary":{"en":"Overbalancing means tipping or falling because balance is lost, or the act of making something tip; it can also mean outweighing (less common).","zh":"overbalancing 指因失去平衡而倾倒/跌倒，或使某物倾倒的行为；也可指在影响或力量上“压过”（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of making something tip over by shifting weight too far to one side.","zh":"（因重心偏移而）使某物倾倒、翻倒的行为。"},"examples":[{"en":"The overbalancing of the ladder happened when he leaned too far to the left.","zh":"他身体向左倾得太多，导致梯子失去平衡而翻倒。"},{"en":"Careless overbalancing of the load can cause the cart to tip.","zh":"装载不当让重心偏一边，可能会把手推车弄翻。"}]},{"partOfSpeech":"v.","definition":{"en":"Losing balance and falling or tipping over (present participle of “overbalance”).","zh":"失去平衡而跌倒或倾倒（“overbalance”的现在分词）。"},"examples":[{"en":"She grabbed the rail to avoid overbalancing on the steep steps.","zh":"楼梯很陡，她抓住扶手以免失去平衡摔倒。"},{"en":"The child was overbalancing on the chair and nearly fell.","zh":"孩子在椅子上失去平衡，差点摔下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"Exceeding the opposite side in weight, force, or influence; outweighing (less common).","zh":"在重量、力量或影响上超过对方；压过（较少见）。"},"examples":[{"en":"One strong argument ended up overbalancing the rest of the discussion.","zh":"一个有力的论点最终压过了讨论中的其他观点。"}]}],"synonyms":["losing balance","tipping over","falling over","toppling","overturning","outweighing"],"phonetic":"ˌoʊvərˈbælənsɪŋ","extraExplanation":["“overbalancing”来自动词 overbalance（over- 超过 + balance 平衡）。日常英语里更常用 lose balance（失去平衡）、tip over（翻倒）、fall over（摔倒）来表达。","在写作中，overbalance/overbalancing 比较偏书面或描述性，用来强调“重心偏移导致翻倒/失衡”的过程感。"]}
{"word":"overballast","summary":{"en":"Overballast means to add too much ballast (extra stabilizing weight), making something unnecessarily heavy or less effective.","zh":"overballast 指“配重/压载过量”，把稳定用的额外重量加得太多，导致过重或效率变差。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add too much ballast (extra weight) to a ship, vehicle, or structure, making it heavier than necessary or less stable/efficient","zh":"（给船只、车辆或结构）加压载物过多；配重过量，导致过重或影响稳定/效率"},"examples":[{"en":"If you overballast a small boat, it may sit too low in the water and handle poorly.","zh":"如果你给小船配重过量，它可能会吃水太深，操控变差。"},{"en":"The engineer warned that overballasting the platform could stress the supports.","zh":"工程师警告说，平台配重过量会让支撑结构承受更大压力。"}]},{"partOfSpeech":"v.","definition":{"en":"to become weighed down by too much ballast; to be made overly heavy by added weight (less common)","zh":"因压载物过多而变得过重（较少见）"},"examples":[{"en":"In rough seas, the vessel overballasted and responded slowly to the waves.","zh":"在风浪中，这艘船因压载过多而反应迟缓。"}]}],"synonyms":["overload","weigh down","overburden"],"phonetic":"/ˌoʊvɚˈbælæst/","extraExplanation":["“ballast”常指船舶的“压载物/压舱物”（如水、砂石、铁块），用于保持稳定与重心；“over-”表示“过度”。因此 overballast 多见于航海、工程等语境，日常英语里很少用。","也可引申为比喻用法，表示“加入过多负担/累赘”（例如规则、细节、材料过多），但这种比喻用法不如其他词（如 overload, weigh down）常见。"]}
{"word":"overbalm","summary":{"en":"A rare, literary verb meaning “to soothe/heal (as if with balm)” or “to coat with balm.”","zh":"一个罕见的文学用语动词，意为“像香膏一样抚慰/疗愈”，或“用香膏覆盖、涂抹”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, literary) To soothe or heal by applying balm; to soften or calm something as if with a soothing ointment.","zh":"（罕见/文学用语）用香膏般的方式抚慰或疗愈；像涂抹香膏一样使事物变得柔和、平静。"},"examples":[{"en":"Time seemed to overbalm her grief, though it never fully disappeared.","zh":"时间似乎抚平了她的悲伤，尽管它从未完全消失。"},{"en":"The warm breeze overbalmed the sting of the cold night.","zh":"温暖的微风缓和了寒夜带来的刺痛感。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To cover or coat with balm (a fragrant, soothing substance).","zh":"（罕见）用香膏覆盖/涂抹（在某物上）。"},"examples":[{"en":"The healer overbalmed the wound before wrapping it.","zh":"疗愈者先在伤口上涂了香膏，然后再包扎。"}]}],"synonyms":["soothe","heal","comfort","salve"],"phonetic":"/ˌoʊvɚˈbɑm/","extraExplanation":["“overbalm”不是现代英语中的常用词，更多见于仿古或诗歌式表达。它由 over-（加强/覆盖之意）+ balm（香膏；抚慰）组成，带有“过度地抚慰/像香膏一样覆盖并缓和”的文学色彩。","如果你是在日常语境里看到它，可能是拼写误差；常见的近形词有 “overwhelm”（压倒/使不堪重负）或 “overbalance”（使失去平衡）。如果你能提供原句，我可以帮你判断更准确的词义。"]}
{"word":"overbanded","summary":{"en":"Overbanded means “secured or wrapped with extra bands,” often more than necessary; it can also describe something with too much banding/striping.","zh":"overbanded 指“用额外绑带/包扎物固定或缠绕（常偏多余）”；也可形容“条带/条纹过多”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Bound or secured with an extra band, strap, or wrapping (often more than needed).","zh":"（较少见）用额外的带子/绑带/包扎物绑住或固定（常指绑得过多、超过需要）。"},"examples":[{"en":"The package was overbanded with plastic straps, so it was hard to open.","zh":"包裹被塑料绑带过度捆扎，所以很难打开。"},{"en":"After the repair, the hose looked overbanded with layers of tape.","zh":"修理后，管子看起来被一层层胶带过度缠绕。"}]},{"partOfSpeech":"adj.","definition":{"en":"(textiles/design) Marked with too many bands or stripes; having heavy banding.","zh":"（纺织/设计）条纹或带状纹理过多；条带感很重。"},"examples":[{"en":"The overbanded fabric made the outfit look busy.","zh":"这块条纹过多的布料让整套衣服显得很花、很乱。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “overband” (to bind or wrap over something).","zh":"“overband”的过去式/过去分词：在……外面再绑一层、再包扎一层。"},"examples":[{"en":"They overbanded the cables to keep them from moving during shipping.","zh":"他们给电缆外面又加绑了一层，以免运输中晃动。"}]}],"synonyms":["overwrapped","overstrapped","overbound","overwrapped with straps","heavily banded"],"phonetic":"/ˌoʊvərˈbændɪd/","extraExplanation":["“overbanded”在日常英语里不常见，更常见的表达是：overwrapped（过度包裹）、overstrapped（绑带过多）、overbanded with…（用……过度捆扎/加带）。在技术或包装语境中更可能出现。","写法上有时也会看到连字符：over-banded，尤其在说明书、产品规格或行业文档里。"]}
{"word":"overbandy","summary":{"en":"Overbandy means to exchange words or arguments back and forth (and, in older/literary use, to toss something back and forth).","zh":"Overbandy 指（言语/争论等）你来我往地互相抛掷或争辩；古旧/文学用法也可指把某物来回抛掷。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pass words, arguments, or insults back and forth; to discuss or dispute something by exchanging remarks","zh":"（言语、争论、指责等）来回抛掷；互相争辩、你一言我一语地讨论"},"examples":[{"en":"The two speakers overbandied accusations during the debate.","zh":"两位演讲者在辩论中你来我往地互相指责。"},{"en":"Reporters overbandied rumors in the hallway, but no one confirmed them.","zh":"记者们在走廊里来回传播传闻，但没人证实。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary/archaic) to toss something back and forth, as if in a game","zh":"（文学/古旧用法）像玩球一样把某物来回抛掷"},"examples":[{"en":"In the poem, the wind overbandies the leaves across the empty road.","zh":"在这首诗里，风把落叶在空寂的路上吹得来回翻飞。"}]}],"synonyms":["bandy (about)","exchange words","trade insults","argue back and forth","bat around"],"phonetic":"/ˌoʊvərˈbændi/","extraExplanation":["“overbandy”比较少见，偏文学或古旧用法。核心意思来自“bandy”（互相抛接、你来我往），加上“over-”强调“反复、来回”或“过度地把某事挂在嘴边/抛来抛去”。现代英语更常用：bandy about / trade insults / exchange words / argue back and forth。"]}
{"word":"overbank","summary":{"en":"“Overbank” describes or refers to river water (and sediment) that spills out of the main channel onto the floodplain during high water.","zh":"“Overbank”指（或描述）河水在高水位时溢出主河道，漫到河漫滩上的水流及其夹带的泥沙；多用于专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a river) outside the main channel and onto the floodplain, especially during high water or flooding.","zh":"（河流）溢出主河道、流到泛滥平原（河漫滩）上的，尤指水位很高或发生洪水时。"},"examples":[{"en":"After days of heavy rain, the river went overbank and flooded nearby fields.","zh":"连续几天暴雨后，河水发生溢岸漫流，淹没了附近的农田。"},{"en":"Engineers designed the levee to reduce overbank flooding in the town.","zh":"工程师设计了堤坝来降低城镇的漫溢洪水风险。"}]},{"partOfSpeech":"n.","definition":{"en":"Water, sediment, or flow that moves out of a river channel onto surrounding land during high flow.","zh":"（河流）在高流量时从河道漫出、进入周围陆地的水流或夹带的泥沙（也可指这种漫溢过程）。"},"examples":[{"en":"Overbank deposits can enrich the soil on a floodplain.","zh":"漫溢沉积物可以让河漫滩的土壤更肥沃。"},{"en":"The report measured overbank flow during the spring melt.","zh":"报告测量了春季融雪期间的溢岸水流。"}]}],"synonyms":["overflowing","floodplain","floodwater","spillover"],"phonetic":"/ˈoʊvərˌbæŋk/","extraExplanation":["“overbank”常见于水文学与地貌学搭配：overbank flow（溢岸水流/漫流）、overbank flooding（漫溢洪水）、overbank deposits（漫溢沉积物）。这种漫溢会把细颗粒泥沙带到河漫滩，长期可形成肥沃土壤，但也会带来洪水风险。","词形上可理解为 over（越过）+ bank（河岸/堤岸）。在日常英语里更常说 “the river overflowed its banks”（河水漫过河岸），而 “overbank”更偏技术/学术用语。"]}
{"word":"overbanked","summary":{"en":"Overbanked describes water (especially a river) that has overflowed its banks; it can also mean a turn or surface is banked too steeply.","zh":"overbanked 常指河水漫过河岸、发生泛滥；也可指弯道或倾斜角度过大（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a river, stream, or water) having risen and spilled over its banks; flooded.","zh":"（河流、溪流或水）水位上涨并漫过河岸的；泛滥的。"},"examples":[{"en":"After two days of heavy rain, the creek was overbanked and flooded the fields.","zh":"连续下了两天大雨后，小溪漫过河岸，淹了田地。"},{"en":"Several roads were closed because the river was overbanked.","zh":"由于河水泛滥，有几条道路被关闭。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) banked too much; tilted more than is safe or comfortable (for a road, track, or aircraft).","zh":"（较少见）倾斜（弯道/跑道/飞机转弯）角度过大，超过安全或舒适范围的。"},"examples":[{"en":"The turn felt overbanked, and the passengers gripped their seats.","zh":"那个转弯倾斜得太厉害，乘客都紧紧抓住座椅。"}]}],"synonyms":["overflowing","flooded","in flood","banked too steeply"],"phonetic":"/ˌoʊvɚˈbæŋkt/","extraExplanation":["“overbanked”在地理与水文学里常与“overbank flow（漫滩水流）”“overbank flooding（漫堤洪水）”一起出现，指河水越过河槽两侧的天然堤岸，进入泛滥平原（floodplain）。","相关名词还有“overbank deposit（漫滩沉积）”，指洪水退去后在河漫滩上留下的细泥沙沉积，这也是冲积平原形成的重要过程。"]}
{"word":"overbar","summary":{"en":"An overbar is a line above a symbol, used to show meanings like averages, repeating decimals, or line segments.","zh":"overbar 指符号上方的一条横线，可表示平均值、循环小数或线段等含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A horizontal line written above a letter, number, or symbol (used in math, science, and typography).","zh":"写在字母、数字或符号上方的一条水平线（常用于数学、科学与排版）。"},"examples":[{"en":"In math, an overbar can show a repeating decimal, like 0.3̅.","zh":"在数学中，overbar 可以表示循环小数，例如 0.3̅。"},{"en":"Some textbooks use an overbar to represent the average value, like x̄.","zh":"一些教材用 overbar 表示平均值，例如 x̄。"},{"en":"In geometry, an overbar over AB can mean the line segment AB.","zh":"在几何中，AB 上方的 overbar 可以表示线段 AB。"}]}],"synonyms":["overline","macron","vinculum"],"phonetic":"/ˈoʊvərˌbɑr/","extraExplanation":["“overbar”在不同学科里含义会有点不一样：\n- 统计学：x̄ 表示“样本均值/平均值”。\n- 小数：3̅ 表示“3循环”。\n- 几何：\u0010\u0010AB̅ 常表示“线段AB”（不同教材符号习惯可能不同）。\n- 复数：z̅ 有时表示复共轭（也常见写作 z* 或 \u0010\u0010\\bar{z}）。\n\n排版/字体领域中也常叫 overline；在更专业的术语里，数学上这条线有时叫 vinculum（连接线）。"]}
{"word":"overbarish","summary":{"en":"“Overbarish” is usually a misspelling of “overbearish,” meaning excessively bearish (too pessimistic about markets).","zh":"“overbarish”通常是“overbearish”的拼写错误，意思是过度看空（对市场过分悲观）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance) excessively pessimistic about the market; more bearish than is reasonable.","zh":"（金融）过度看空的；比合理情况更悲观的（看跌）。"},"examples":[{"en":"Some analysts think the market reaction was overbearish after the earnings report.","zh":"一些分析师认为，财报发布后市场的反应过度看空。"},{"en":"Don’t get overbearish based on one bad day—look at the longer trend.","zh":"不要因为一天的下跌就过度看空——要看更长期的趋势。"}]}],"synonyms":["too bearish","overly pessimistic","unduly bearish","excessively negative"],"phonetic":"/ˌoʊvɚˈbɛrɪʃ/","extraExplanation":["“overbarish”并不是常见标准英语拼写；多数情况下它是把 **overbearish** 拼错了（over- + bearish）。","**bearish** 来自 “bear（熊）”，在英语金融文化里常用 “bull vs. bear（牛市/熊市）” 来比喻看涨与看跌；因此 **overbearish** 就是“过度看跌/过度悲观”。"]}
{"word":"overbark","summary":{"en":"Overbark means to bark excessively (or to bark so loudly that it covers other sounds).","zh":"overbark 指“过度吠叫”，也可指“吠叫声盖过其他声音”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to bark too much or for too long (often so that it becomes annoying or unnecessary)","zh":"过度吠叫；叫得太多或太久（常指令人烦躁或没有必要）"},"examples":[{"en":"Some dogs overbark when they’re bored or anxious.","zh":"有些狗在无聊或焦虑时会过度吠叫。"},{"en":"The trainer taught the puppy not to overbark at every sound.","zh":"训练师教小狗不要对每个声音都过度吠叫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bark over (and drown out) another sound or voice","zh":"吠叫声盖过（压过）别的声音或说话声"},"examples":[{"en":"The guard dog overbarked my greeting, so the neighbor couldn’t hear me.","zh":"看门狗的吠叫盖过了我的问候，邻居听不见我说话。"}]}],"synonyms":["bark too much","bark excessively","yap (informal)","yelp"],"phonetic":"/ˌoʊvɚˈbɑrk/","extraExplanation":["“overbark”不是很常见的标准词汇，更自然的说法通常是“bark too much / bark excessively”。不过在口语或写作里，人们会用“over- + 动词”来表达“过度做某事”，因此“overbark”容易被理解。","“over-”这个前缀常见于：overeat（吃太多）、overwork（过劳）、overreact（反应过度）。你看到“overbark”时，可以用同样逻辑来把握意思。"]}
{"word":"overbarren","summary":{"en":"“Overbarren” means excessively barren or, figuratively, overly unproductive.","zh":"“overbarren”意为“过分贫瘠/荒芜”，也可比喻“过于空洞、无成果”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively barren; too dry, empty, or infertile to support normal growth (often used for land, soil, or a place).","zh":"过分贫瘠的；极度荒芜干旱、几乎无法支持正常生长的（常指土地、土壤或某地）。"},"examples":[{"en":"The crops failed because the fields were overbarren after years without rain.","zh":"多年无雨后田地变得过分贫瘠，庄稼因此歉收。"},{"en":"They tried to restore the overbarren soil by adding compost and planting cover crops.","zh":"他们通过施堆肥、种植覆盖作物来修复过分贫瘠的土壤。"}]},{"partOfSpeech":"adj.","definition":{"en":"figuratively, overly empty or unproductive; lacking ideas, results, or meaningful activity.","zh":"（比喻）过于空洞或无成果的；缺乏想法、产出或有意义的活动的。"},"examples":[{"en":"After the initial excitement, the discussion turned overbarren and repetitive.","zh":"最初的兴奋过去后，讨论变得空洞乏味且重复。"},{"en":"He described the months as overbarren—lots of motion, but no real progress.","zh":"他形容那几个月“过于无成果”——忙来忙去，却没有真正进展。"}]}],"synonyms":["extremely barren","sterile","arid","desolate","depleted","unproductive"],"phonetic":"/ˌoʊvərˈbærən/","extraExplanation":["“overbarren”由前缀 over-（过度、太……）+ barren（贫瘠的、不结果的）构成，但在现代英语里非常少见，更多见于诗歌化/文学化或个人造词的表达。日常写作更常用 very/extremely barren，或用更具体的词如 sterile（不毛的）、arid（干旱的）、depleted（耗竭的）。","文学或修辞上，它常用来强调“贫瘠到过头”的强烈感受，既可写实（荒地、土壤），也可比喻（思想枯竭、创作无产出）。"]}
{"word":"overbarrenness","summary":{"en":"Overbarrenness means an extreme or excessive state of barrenness—little or no fertility, growth, or productive output.","zh":"overbarrenness 指“过度贫瘠/极度缺乏产出”的状态，可用于字面（如土地）或比喻（如创意、内容）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive barrenness or extreme lack of fertility, productivity, or growth (often used about land, nature, or figuratively about ideas and creativity).","zh":"过度的贫瘠；极端的不孕/不结果；（常指土地、自然环境，也可比喻）极度缺乏产出、发展或创意。"},"examples":[{"en":"The overbarrenness of the soil made farming nearly impossible without irrigation and fertilizer.","zh":"土壤过度贫瘠，使得没有灌溉和化肥就几乎无法耕作。"},{"en":"Critics blamed the overbarrenness of the plot on weak character development.","zh":"评论家把情节的“过度贫乏”归咎于人物塑造薄弱。"}]}],"synonyms":["extreme barrenness","sterility","infertility","unproductiveness","desolation"],"phonetic":"/ˌoʊvɚˈbɛrənnəs/","extraExplanation":["“overbarrenness”不是常见标准词，更像是由 over-（过度）+ barrenness（贫瘠、不孕、缺乏成果）临时组合出来的名词，用于强调“贫瘠/缺乏”到了过头的程度。","更自然、常见的表达通常是：extreme barrenness（极度贫瘠）、severe infertility（严重不孕）、lack of productivity/creativity（缺乏产出/创意）。在正式写作中可优先考虑这些更常用的说法。"]}
{"word":"overbase","summary":{"en":"Overbase means either to rely too heavily on one basis, or (in technical use) to make something too alkaline by adding too much base.","zh":"overbase 可指把某事过度建立在某个依据上；在技术语境中也指加入过多碱而使物质碱性过强。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to base something too much on a particular idea, reason, or piece of information (to rely on it excessively)","zh":"把某事过度建立在某个观点、理由或信息之上（过分依赖）"},"examples":[{"en":"The plan is overbased on one customer, so it’s risky if they leave.","zh":"这个计划过度依赖一个客户，所以如果对方离开就会很危险。"},{"en":"Don’t overbase your decision on one bad review—read several sources.","zh":"别因为一条差评就做决定——多看几个来源。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a material too alkaline by adding too much base (used in chemistry/industry)","zh":"加入过多碱，使材料碱性过强（化学/工业用语）"},"examples":[{"en":"If you overbase the mixture, the final product may become unstable.","zh":"如果把混合物碱化过头，成品可能会变得不稳定。"},{"en":"Some lubricants use overbased additives to neutralize acids during engine operation.","zh":"有些润滑油使用“过碱化”添加剂来在发动机运行时中和酸性物质。"}]}],"synonyms":["over-rely on","base too much on","overemphasize","over-alkalize (technical)"],"phonetic":"ˌoʊvərˈbeɪs","extraExplanation":["“overbase”在日常英语里很少见；更常见的表达是“base something too much on … / rely too heavily on … / overemphasize …”。","在石油、润滑油和添加剂行业里更常见的是形容词“overbased / overbased detergent”，指含有过量碱性储备（用于中和酸）。因此你可能在技术资料或产品说明中见到这个词。"]}
{"word":"overbaseness","summary":{"en":"Overbaseness means an extreme level of baseness—very immoral, contemptible behavior; more rarely, excessive servility.","zh":"overbaseness 指“极端卑劣/卑下”，常指非常不道德、卑鄙的行为；较少见时也可指过度卑躬屈膝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"extreme baseness; very low moral character or behavior (cruel, dishonest, or contemptible conduct).","zh":"极端卑劣；极其低下的品行或行为（残忍、不诚实、令人鄙视的举动）。"},"examples":[{"en":"The scandal exposed not just corruption, but a kind of overbaseness that shocked the public.","zh":"这起丑闻暴露的不只是腐败，还有一种令公众震惊的极端卑劣。"},{"en":"In the novel, the villain’s overbaseness is shown through repeated betrayals.","zh":"在小说里，反派的极端卑劣通过一次次背叛表现出来。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, often literary/archaic) excessive servility or self-humiliation; being too “low” in a social or personal sense.","zh":"（较少见，多为文学/古旧用法）过度卑躬屈膝或自我贬低；在社交或人格层面“太卑下”。"},"examples":[{"en":"He mistook politeness for overbaseness and refused to apologize.","zh":"他把礼貌误当成卑躬屈膝，于是拒绝道歉。"},{"en":"The speech warns leaders not to demand overbaseness from their followers.","zh":"演讲警告领导者不要要求追随者对自己过度卑躬屈膝。"}]}],"synonyms":["depravity","vileness","meanness","contemptibleness","servility"],"phonetic":"/ˌoʊvərˈbeɪsnəs/","extraExplanation":["这个词很少在现代日常英语里使用，通常出现在较正式或文学性的语境中。","构词上是 over-（“过度、太……”）+ baseness（“卑劣；卑下”）。读到它时，可以先抓住核心词 baseness 的含义，再理解 over- 带来的“程度更强”。","更常见、自然的替代说法包括：extreme cruelty（极端残忍）、utter depravity（彻底堕落）、shamelessness（无耻）、contemptible behavior（卑鄙行为）。"]}
{"word":"overbashful","summary":{"en":"Overbashful means too shy or self-conscious.","zh":"overbashful 指「過分害羞／太拘謹」。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too shy, timid, or self-conscious (often to the point that it becomes awkward or gets in the way).","zh":"過分害羞、畏縮或不自在（常到會造成尷尬或影響表現的程度）。"},"examples":[{"en":"He was overbashful at parties and rarely started a conversation.","zh":"他在派對上過分害羞，很少主動開口聊天。"},{"en":"Don’t be overbashful—your question is completely normal.","zh":"別太害羞——你的問題很正常。"},{"en":"She smiled, overbashful, and looked down at her shoes.","zh":"她害羞地笑了笑，低頭看著自己的鞋子。"}]}],"synonyms":["overly shy","too shy","very shy","timid","self-conscious","diffident"],"phonetic":"/ˌoʊvərˈbæʃfəl/","extraExplanation":["「over-」這個前綴常表示「過度、太……」，所以 overbashful = bashful（害羞的）+ over-（過度）。語氣上常帶有「其實不需要那麼害羞」或「害羞到影響行動」的含意。","這個詞相對少見；日常更常用 very shy / extremely shy / overly shy / too shy 來表達相同意思。"]}
{"word":"overbashfully","summary":{"en":"Overbashfully means acting or speaking in a way that is too shy or too easily embarrassed.","zh":"overbashfully 指“过于害羞/过于拘谨地”，带有“害羞到有点过头”的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively shy, self-conscious, or easily embarrassed way.","zh":"以过度害羞、过度拘谨或容易尴尬的方式。"},"examples":[{"en":"He spoke overbashfully and avoided eye contact during the interview.","zh":"他在面试中说话过于拘谨，还避免眼神交流。"},{"en":"She laughed overbashfully when someone complimented her.","zh":"别人夸她时，她尴尬又害羞地笑了笑。"}]}],"synonyms":["too shyly","overly shyly","awkwardly","self-consciously"],"phonetic":"/ˌoʊvərˈbæʃfəli/","extraExplanation":["“over-”表示“过度、太……”，所以 overbashfully = bashfully（害羞地）+ 过度。它常带有说话者的评价：这种害羞程度可能不太自然、甚至影响表达。","这个词在日常口语中不算常见；更常见的表达有 “too bashfully / very shyly / awkwardly”。写作中用 overbashfully 可以更强调“过头了”的感觉。"]}
{"word":"overbashfulness","summary":{"en":"Overbashfulness means excessive shyness.","zh":"overbashfulness 指“过度害羞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive shyness; being more timid or self-conscious than is helpful or necessary.","zh":"过度害羞；过分胆怯或过度在意他人眼光，以至于影响表达或行动。"},"examples":[{"en":"His overbashfulness kept him from introducing himself at the meeting.","zh":"他过度害羞，导致他在会议上一直没敢自我介绍。"},{"en":"With practice, she learned to speak up and overcome her overbashfulness.","zh":"通过练习，她学会大胆发言，克服了自己的过度害羞。"}]}],"synonyms":["excessive shyness","extreme shyness","timidity","self-consciousness","diffidence"],"phonetic":"/ˌoʊvərˈbæʃfəlnəs/","extraExplanation":["“overbashfulness”并不是特别常见的固定词汇，更多时候人们会说“extreme shyness / excessive shyness”或“social anxiety”（更偏心理层面）。它的构词很透明：over-（过度）+ bashful（害羞的）+ -ness（名词后缀）。用于写作时带一点强调或文学色彩，突出“害羞过了头”。"]}
{"word":"overbattle","summary":{"en":"“Overbattle” is a rare word meaning to defeat completely in battle or to be worn out by too much fighting/struggle.","zh":"“overbattle”较少见，指在战斗中彻底击败，或因过多/过久的战斗与挣扎而被耗尽。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to defeat (someone) in battle; to overpower in fighting","zh":"在战斗中击败（某人）；压倒、战胜"},"examples":[{"en":"The smaller army was overbattled and forced to retreat.","zh":"较小的军队被彻底击败，被迫撤退。"},{"en":"In the novel, the general seems overbattled not only by enemies but by time.","zh":"在小说里，这位将军似乎不仅被敌人打败，也被时间压垮。"}]},{"partOfSpeech":"vi.","definition":{"en":"to fight too much or too long; to wear yourself out by constant struggle","zh":"战斗过多或过久；因持续拼搏而疲惫不堪"},"examples":[{"en":"After years of conflict, the country felt overbattled and needed peace.","zh":"多年冲突之后，这个国家感到身心俱疲，需要和平。"},{"en":"Don’t try to solve everything at once—you’ll end up overbattling.","zh":"别想一次解决所有问题——你会把自己耗垮的。"}]}],"synonyms":["overwhelm","defeat","overpower","wear out","exhaust"],"phonetic":"ˌoʊvɚˈbætəl","extraExplanation":["“overbattle”不是现代日常英语里的常用词，更常见于文学或较旧的语体中，用来强调“被战斗压倒/被长期冲突耗尽”的感觉。","更常见的现代替代表达包括：defeat soundly（彻底击败）, overwhelm（压倒）, wear out/exhaust（耗尽）。"]}
{"word":"overbear","summary":{"en":"“Overbear” means to dominate others in an unpleasantly forceful way, or to overpower/overwhelm by force or strong feeling.","zh":"“overbear”指以令人不适的强势方式压制他人，或指被力量/压力/强烈情绪所压倒、制服。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To act in a dominant, controlling way; to insist on your own will too strongly.","zh":"以强势、专横的方式行事；过度坚持己见、控制他人。"},"examples":[{"en":"He can be overbearing in meetings, so it’s hard for others to share ideas.","zh":"他在会议上有时很强势，所以别人很难发表想法。"},{"en":"Her overbearing attitude made the team feel stressed.","zh":"她专横的态度让团队感到压力很大。"}]},{"partOfSpeech":"vt.","definition":{"en":"To overcome or defeat someone or something by force or pressure; to overpower.","zh":"以力量或压力压倒；制服；击败。"},"examples":[{"en":"The waves overbore the small boat during the storm.","zh":"暴风雨中海浪把小船压得难以招架。"},{"en":"She was overborne by emotion and couldn’t speak.","zh":"她被情绪压倒，开不了口。"}]}],"synonyms":["dominate","bully","oppress","overpower","overwhelm"],"phonetic":"/ˌoʊvɚˈbɛr/","extraExplanation":["“overbear”较常见于书面语，日常口语更常用“dominate / overpower”。描述人的性格时，更常见的形容词是“overbearing（专横的、盛气凌人）”。","词源上可理解为 over-（过度）+ bear（承受/负担/支撑），有“压得别人承受不了”的感觉。"]}
{"word":"overbearance","summary":{"en":"Overbearance means domineering, overly controlling behavior.","zh":"Overbearance 指专横、过度控制、盛气凌人的行为/特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or quality of being too forceful, controlling, or dominant; domineering behavior.","zh":"过于强势、专横或爱支配人的行为/特质；盛气凌人。"},"examples":[{"en":"Her overbearance in meetings made quieter teammates afraid to share ideas.","zh":"她在会议上的盛气凌人让比较安静的队友不敢表达想法。"},{"en":"He apologized for his overbearance and promised to listen more.","zh":"他为自己的专横道歉，并承诺会多倾听。"},{"en":"The novel portrays a father whose overbearance slowly pushes his children away.","zh":"小说描写了一位父亲的专横如何逐渐把孩子们推远。"}]}],"synonyms":["domineeringness","bossiness","high-handedness","arrogance","authoritarianism"],"phonetic":"/ˌoʊvərˈbɛrəns/","extraExplanation":["“overbearance”较少见，现代英语里更常用的词是“overbearing”（形容词，意为“专横的/盛气凌人的”）或“overbearingness”（名词）。","词源上来自 overbear（压倒、制服、压过），因此这个名词强调“把别人的意见或空间压过去”的感觉。正式写作中若想更自然，可用“domineering behavior”“bossiness”“high-handedness”等表达。"]}
{"word":"overbearer","summary":{"en":"An overbearer is a domineering person who tries to control others.","zh":"overbearer 指专横、爱压制他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is domineering—someone who tries to control others by force of personality, pressure, or intimidation.","zh":"专横的人；盛气凌人、喜欢压制他人的人。"},"examples":[{"en":"He was an overbearer in meetings, interrupting everyone to push his own plan.","zh":"他在会议上很专横，总是打断别人来推自己的方案。"},{"en":"She left the job because her overbearer of a supervisor never listened to feedback.","zh":"她辞职了，因为她那位专横的上司从不听取反馈。"}]}],"synonyms":["domineer","bully","tyrant","controller","strong-arm"],"phonetic":"/ˌoʊvərˈbɛrər/","extraExplanation":["“Overbearer”是由动词“overbear”（压倒、压制；以强势使人屈服）派生出来的名词，但在现代英语里相对少见。更常用的说法是“domineering person”“bully”或“overbearing person”。","词形上，“overbearing”（专横的）比“overbearer”常见得多：例如“He’s very overbearing.” 更自然。"]}
{"word":"overbearing","summary":{"en":"Overbearing describes someone who is unpleasantly controlling, domineering, or arrogantly forceful.","zh":"Overbearing 形容一个人专横爱控制、盛气凌人，或傲慢强势到让人不舒服。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to control others in an unpleasant way; too bossy or dominating.","zh":"（令人不快地）爱控制别人、专横的；盛气凌人的。"},"examples":[{"en":"Her overbearing manager checked every tiny detail and never trusted the team.","zh":"她那位专横的经理事无巨细都要检查，从不信任团队。"},{"en":"He sounded overbearing when he told everyone what to do without listening.","zh":"他不听别人意见就指挥大家做事，听起来很盛气凌人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Too confident and proud, in a way that makes other people feel small or uncomfortable.","zh":"过于自负、傲慢到让人不舒服的；咄咄逼人的。"},"examples":[{"en":"The speaker’s overbearing tone made the audience feel dismissed.","zh":"演讲者咄咄逼人的语气让听众觉得被轻视。"},{"en":"She tried to stay calm around his overbearing attitude.","zh":"面对他那种傲慢的态度，她尽量保持冷静。"}]}],"synonyms":["domineering","bossy","controlling","pushy","high-handed","imperious"],"phonetic":"/ˌoʊvərˈbɛrɪŋ/","extraExplanation":["词源上，overbearing 来自 over（过度）+ bearing（举止/态度，也与“承受、负担”相关）。在现代英语里，它主要指“态度或行为上过度压人、爱支配别人”，而不是字面意义的“承受过多”。","常见搭配：overbearing parent/boss（控制欲强的父母/上司）、overbearing manner/tone（专横的举止/语气）。语气强度比 bossy 更重，通常带有明显负面评价。"]}
{"word":"overbearingly","summary":{"en":"“Overbearingly” means “in a domineering, too-controlling way.”","zh":"“overbearingly”表示“以专横、过度控制人的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an overbearing way; in a manner that is too controlling, proud, or demanding","zh":"以专横的方式；以过于强势、爱控制、傲慢或强迫人的方式"},"examples":[{"en":"He spoke overbearingly to the staff, as if no one else’s opinion mattered.","zh":"他对员工说话很专横，仿佛别人的意见都不重要。"},{"en":"Her overbearingly confident tone made the discussion tense.","zh":"她那种咄咄逼人的自信语气让讨论变得紧张。"},{"en":"The manager acted overbearingly, giving orders without listening.","zh":"经理表现得很强势，只会下命令却不听别人说。"}]}],"synonyms":["domineeringly","bossily","authoritatively","high-handedly","imperiously"],"phonetic":"/ˌoʊvərˈbɛrɪŋli/","extraExplanation":["“overbearingly”来自形容词“overbearing”（专横的、盛气凌人的）加副词后缀“-ly”。“bear”有“承受/支撑”的意思，“overbearing”带有“压过别人、把别人压住”的感觉，因此常用于批评某人态度强势到让人不舒服。","语气上，“overbearingly”通常是负面评价；若想更中性，可以用“firmly（坚定地）”“confidently（自信地）”，但它们不一定包含“压迫别人”的含义。"]}
{"word":"overbearingness","summary":{"en":"Overbearingness is the trait of being too controlling or domineering.","zh":"Overbearingness 指“过度控制、专横支配”的性格/特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too controlling, bossy, or dominating in a way that ignores other people’s feelings or choices.","zh":"专横；盛气凌人；过度控制（指以强势方式支配他人、忽视他人感受或选择的特质）"},"examples":[{"en":"Her overbearingness made it hard for the team to share ideas.","zh":"她的专横让团队很难分享想法。"},{"en":"He apologized for his overbearingness and tried to listen more.","zh":"他为自己的强势专断道歉，并试着多倾听。"},{"en":"In the novel, the father’s overbearingness pushes his daughter to rebel.","zh":"在小说里，父亲的专横逼得女儿开始反抗。"}]}],"synonyms":["domineeringness","bossiness","authoritarianism","pushiness","high-handedness"],"phonetic":"/ˌoʊvɚˈbɛrɪŋnəs/","extraExplanation":["“overbearingness”来自形容词“overbearing”（专横的、压人的）+ 名词后缀“-ness”（表示“……的状态/性质”）。更常见、也更自然的表达通常是“overbearing behavior / an overbearing manner”（专横的行为/态度）或直接用名词“dominance / bossiness”（支配欲/爱摆架子），因为“overbearingness”本身在日常口语中相对少见。"]}
{"word":"overbears","summary":{"en":"“overbears” means “overpowers or overwhelms,” often by strength, authority, or pressure.","zh":"“overbears”指“压倒、压制或使难以承受”，常含以力量、权威或压力压过对方之意。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to overpower or dominate (someone), often by using strength, authority, or pressure","zh":"（以力量、权威或压力）压倒、制伏、压制（某人）"},"examples":[{"en":"His loud voice overbears everyone in the meeting.","zh":"他的大嗓门在会议上压过了所有人。"},{"en":"She felt overborne by the constant demands at work.","zh":"她觉得自己被工作中不断的要求压得喘不过气。"}]},{"partOfSpeech":"v.","definition":{"en":"(of feelings or circumstances) to overwhelm; to be too strong to resist","zh":"（指情绪或处境）使难以承受、使无法抗拒"},"examples":[{"en":"Grief overbears him whenever he hears that song.","zh":"每当他听到那首歌，悲伤就会将他淹没。"},{"en":"The heat overbears you in the afternoon.","zh":"下午的酷热让人难以招架。"}]},{"partOfSpeech":"v.","definition":{"en":"to defeat or silence (someone) in an argument by forceful pressure rather than reason","zh":"（在争论中）用强势压制而非讲道理来压倒（对方）"},"examples":[{"en":"He overbears his opponents instead of answering their questions.","zh":"他不是回答问题，而是用强势压住对手。"},{"en":"Try not to overbear others when you disagree.","zh":"有分歧时尽量不要用强势去压制别人。"}]}],"synonyms":["overpower","overwhelm","dominate","oppress","crush","subdue","steamroll"],"phonetic":"ˌoʊvɚˈbɛrz","extraExplanation":["“overbears”是动词“overbear”的第三人称单数现在时（he/she/it overbears）。常见的其他形式还有：overbore（过去式），overborne（过去分词）。","这个词常带有“强势压制/令人不适”的语气，比“win”或“convince”更强调用力量、权威或压力取得上风。"]}
{"word":"overbeat","summary":{"en":"Overbeat means to beat or strike too much, and (rarely) describes something that feels overly forceful or overemphasized.","zh":"overbeat 指“过度敲打/殴打”，也可（较少见）形容“强调或节奏过于用力、过度”的状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to beat (someone or something) too much or too hard; to strike repeatedly beyond what is necessary","zh":"过度打击；过分殴打（某人或某物）；反复敲打过头"},"examples":[{"en":"The blacksmith warned his apprentice not to overbeat the metal, or it would become brittle.","zh":"铁匠告诫徒弟不要把金属敲打过头，否则会变脆。"},{"en":"He was arrested for overbeating the animal.","zh":"他因过度殴打动物而被逮捕。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) too strongly stressed or repeated; excessively forceful in rhythm or emphasis","zh":"（罕见）节奏或强调过强的；重复得过头的；过于用力的"},"examples":[{"en":"The chorus felt overbeat and tiring by the final minute.","zh":"到最后一分钟，副歌显得强调过度、让人疲惫。"},{"en":"Try a softer touch—the pattern sounds a little overbeat.","zh":"试着轻一点——这个节奏听起来有点过于用力。"}]}],"synonyms":["beat too hard","overdo","overstrike","overemphasize","heavy-handed"],"phonetic":"/ˌoʊvərˈbit/","extraExplanation":["“overbeat”在现代英语里不算常见，更常见的表达是“beat too much/too hard”或“overdo it”。在一些语境中也会写作“over-beat”（加连字符），意思仍是“过度敲打/过度强调”。","如果你想表达“节拍过强/过度强调”，音乐或写作评论里更自然的词包括“overemphasized（过度强调的）”、“heavy-handed（用力过猛的）”。"]}
{"word":"overbeating","summary":{"en":"Overbeating means beating, mixing, or whipping something too much or too hard.","zh":"overbeating 指把某物敲打/殴打或搅拌、打发过度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of beating (hitting, whipping, or pounding) something too much or too hard; excessive beating","zh":"过度敲打／击打／鞭打；打得太多或太用力"},"examples":[{"en":"The recipe warns that overbeating the eggs can make the cake tough.","zh":"食谱提醒：鸡蛋打发过度会让蛋糕变硬。"},{"en":"Overbeating the metal can weaken it instead of strengthening it.","zh":"金属敲打过度反而会让它变脆、变弱。"}]},{"partOfSpeech":"adj.","definition":{"en":"beating or mixing something too much (often used like an adjective, especially in cooking or making materials)","zh":"（常作形容词用）打发／搅拌过度的；敲打过度的"},"examples":[{"en":"Overbeating cream can turn it grainy or even into butter.","zh":"鲜奶油打发过度会变粗糙，甚至变成黄油。"},{"en":"The dough is sticky because of overbeating.","zh":"面团发黏是因为搅拌过度。"}]}],"synonyms":["excessive beating","overmixing","overwhipping","overworking"],"phonetic":"/ˌoʊvɚˈbiːtɪŋ/","extraExplanation":["“overbeating”不是非常常见的独立词条，更常见的表达是动词短语“overbeat something”（把……打/搅拌过度）。在日常英语里，你更常听到与厨房相关的说法，如“don’t overbeat the eggs/cream”。","在文学或正式写作中，它也可指“过度殴打/鞭打”这一行为（带有负面评价），但这种用法相对少见，通常会直接用“beating”并加“excessive/too much”。"]}
{"word":"overbed","summary":{"en":"“Overbed” is a rare word, most often used in mining/geology to mean the material covering a mineral bed (overburden).","zh":"“overbed”很少见，最常用于采矿/地质，指覆盖在矿层上的岩土层（overburden）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mining/Geology) The layer of rock or soil lying above a mineral seam or bed; overburden.","zh":"（采矿/地质）覆盖在矿层或地层之上的岩土层；覆盖层（overburden）。"},"examples":[{"en":"The miners had to remove the overbed before they could reach the coal.","zh":"矿工必须先移除覆盖层，才能挖到煤。"},{"en":"Too much overbed can make a site expensive to mine.","zh":"覆盖层过厚会让矿区开采成本很高。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To cover something with a layer (“bed”) of material.","zh":"（罕用）用一层（“床层”）材料覆盖某物。"},"examples":[{"en":"The road was overbedded with gravel to improve drainage.","zh":"这条路铺了一层碎石以改善排水。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To provide with too many beds; to overcrowd with beds.","zh":"（罕用）床位设置过多；用床把空间塞得过满。"},"examples":[{"en":"The small room was overbedded, leaving little space to walk.","zh":"这间小房间床放得太多，几乎没地方走路。"}]}],"synonyms":["overburden","covering layer","caprock"],"phonetic":"/ˌoʊvɚˈbɛd/","extraExplanation":["“overbed”在日常英语里非常少见，更常见的说法是：采矿/地质语境用“overburden”（覆盖层）；一般“铺一层材料”多用“cover (with) / layer / bed (with)”等表达。","如果你本来想查的是“overbid（出价过高）”或“overbred（娇生惯养/繁殖过度）”，告诉我语境我可以帮你确认。"]}
{"word":"overbeetling","summary":{"en":"Overbeetling describes something that juts out or overhangs, often used in literary writing for a looming look (especially brows or cliffs).","zh":"Overbeetling 指“突出、外伸、下覆”的样子，多见于文学描写，常形容浓眉或峭壁带来的压迫感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Projecting or overhanging (especially of a brow, cliff, roof, etc.), creating a looming or threatening look.","zh":"（尤指眉毛、峭壁、屋檐等）突出、外伸、下覆的；给人压迫感或阴沉感的。"},"examples":[{"en":"He stared at me from under his overbeetling brows.","zh":"他从那双突出的浓眉下盯着我看。"},{"en":"An overbeetling cliff rose above the narrow path.","zh":"一段外伸的峭壁耸立在狭窄的小路上方。"},{"en":"The old house had an overbeetling roof that cast deep shadows on the porch.","zh":"那座老房子的屋檐向外伸出，在门廊上投下浓重的阴影。"}]}],"synonyms":["overhanging","jutting","projecting","looming","heavy-browed"],"phonetic":"/ˌoʊvərˈbiːtəlɪŋ/","extraExplanation":["“overbeetling”较为文学/古风，常用来描写“眉骨/浓眉外凸、压低”的外观，营造阴沉、威严或威胁的气氛。现代日常英语更常说：overhanging（下覆的/悬垂的）、jutting（突出的）、heavy-browed（浓眉的）。","词源上与动词“beetle”有关：古义可表示“向外凸出、伸出”。因此它并不是“甜菜(beet)”相关的词。","你可能会在经典文学或戏剧译注中见到它，用来加强人物的“阴影感”或“压迫感”的视觉形象。"]}
{"word":"overbelief","summary":{"en":"Overbelief means a belief held beyond what the evidence strictly supports, often used in philosophy or religion.","zh":"Overbelief 指超出证据支持范围的信念，常用于哲学或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief that goes beyond what the available evidence strictly proves; a belief accepted with more confidence than the facts alone guarantee.","zh":"超出证据所能严格证明的信念；对某个观点的确信程度超过现有事实所能支持的程度。"},"examples":[{"en":"His overbelief that the project would succeed made him ignore the risks.","zh":"他对项目一定会成功的“过度信念”让他忽视了风险。"},{"en":"In debates, it helps to separate evidence from overbelief.","zh":"在辩论中，把证据与“超出证据的信念”区分开会很有帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"(Philosophy/psychology) A personal or religious conviction that extends beyond rational proof, often shaping how someone interprets life and experience.","zh":"（哲学/心理学）一种超越理性证明的个人或宗教确信，常常影响一个人如何理解人生与经验。"},"examples":[{"en":"For her, faith wasn’t a conclusion from data but an overbelief about the meaning of suffering.","zh":"对她来说，信仰不是从数据推导的结论，而是一种关于苦难意义的“超证据确信”。"},{"en":"William James discussed how overbeliefs can guide people even when certainty is impossible.","zh":"威廉·詹姆斯谈到，当确定性不可能时，overbelief 仍可能指引人们。"}]}],"synonyms":["belief beyond the evidence","unsupported belief","unwarranted belief","conviction"],"phonetic":"/ˌoʊvɚbɪˈlif/","extraExplanation":["“overbelief”常与美国哲学家威廉·詹姆斯（William James）相关，尤其出现在他关于宗教经验与信仰的讨论中：人在面对无法完全用证据解决的问题时，往往会以某种“更进一步的相信”来生活与行动。","这个词在日常英语里不算常见，更常见的近义表达包括“unsupported belief（缺乏证据的信念）”“belief beyond the evidence（超出证据的信念）”。使用时通常带有分析或批判意味，但不一定是贬义。"]}
{"word":"overbend","summary":{"en":"Overbend means to bend too much, beyond the intended or safe limit.","zh":"overbend 指把某物弯得过度，超过预期或安全限度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bend something too much, past the desired shape or limit","zh":"把某物弯得过度；弯过头（超过需要的形状或限度）"},"examples":[{"en":"Be careful not to overbend the wire, or it may snap.","zh":"小心别把金属丝弯过头，不然可能会断。"},{"en":"I overbent the paper clip and it wouldn’t hold its shape.","zh":"我把回形针掰得太过了，它就保持不住形状了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to bend too much (often accidentally), so the object ends up past the intended position","zh":"弯曲过度（常指不小心），导致超过原本要达到的位置"},"examples":[{"en":"If you overbend, the strip will curve the wrong way.","zh":"如果你弯过头，那条薄片就会朝不对的方向弯。"},{"en":"The metal tends to overbend when it’s heated.","zh":"金属加热时容易弯过头。"}]}],"synonyms":["bend too far","overflex","overcurve","overstrain"],"phonetic":"/ˌoʊvɚˈbɛnd/","extraExplanation":["在工程与制造中，overbend 常用来描述“超过目标角度”的弯折。与之相关的概念是 springback（回弹）：有些材料弯完会回弹，所以工人有时会“刻意多弯一点”来抵消回弹；但如果多弯过量，就会 overbend。"]}
{"word":"overbepatched","summary":{"en":"“Overbepatched” is a rare/nonstandard word meaning “patched too many times,” often implying something messy or unreliable.","zh":"“overbepatched”较少见/非标准，意思是“补丁或修补过多”，常带有杂乱、不可靠的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard / rare) patched or repaired too many times; covered with so many fixes that it becomes messy or unreliable.","zh":"（非标准 / 少见）被补丁或修补得过多；加了太多“修复”导致杂乱或不稳定。"},"examples":[{"en":"The old jacket was overbepatched and looked more like a quilt than clothing.","zh":"那件旧夹克补得太多了，看起来更像一条拼布被，而不像衣服。"},{"en":"This codebase is overbepatched, so we should refactor instead of adding another quick fix.","zh":"这份代码已经“补丁过度”了，所以我们应该重构，而不是再加一个临时修复。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard / rare) to patch something excessively by adding too many small fixes.","zh":"（非标准 / 少见）对某物进行过度打补丁/修补；用太多小修小补来处理问题。"},"examples":[{"en":"If we overbepatch the system, future updates may break more easily.","zh":"如果我们对系统打补丁过度，以后的更新可能更容易出问题。"},{"en":"They kept overbepatching the roof instead of replacing it.","zh":"他们一直对屋顶过度修补，而不是直接更换。"}]}],"synonyms":["overpatched","patched up too much","full of patches","overfixed"],"phonetic":"ˌoʊvɚbiˈpætʃt","extraExplanation":["“overbepatched”不是常见的标准英语词，更像是把 over-（过度）+ be patched（被打补丁/被修补）硬拼出来的写法。日常更自然的表达通常是：overpatched（补得太多/补丁太多）、patched up too much（修补过头）、full of patches（满是补丁/满是补片）。","在软件语境里，更常见的说法是：overpatched codebase / too many hotfixes（热修太多）/ needs refactoring（需要重构）。","如果你是在某篇文章或游戏/小说里看到它，它可能是作者为了强调“修补痕迹太重、勉强维持”的感觉而造的词。"]}
{"word":"overberg","summary":{"en":"Overberg is a region (and district) in South Africa’s Western Cape, known for coastal towns, farming, and nature.","zh":"Overberg（奥弗贝赫）是南非西开普省的一个地区/行政区，以海滨城镇、农业与自然景观闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the Western Cape province of South Africa (east of Cape Town), known for coastal towns, agriculture, and nature reserves.","zh":"南非西开普省的一个地区（开普敦以东），以海滨城镇、农业和自然保护区闻名。"},"examples":[{"en":"We drove through the Overberg to reach Hermanus on the coast.","zh":"我们穿过奥弗贝赫地区，前往海岸边的赫曼努斯。"},{"en":"The Overberg is famous for whale watching in season.","zh":"奥弗贝赫在季节里以观鲸闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(more specific) the Overberg District Municipality, an administrative district in the Western Cape.","zh":"（更具体）奥弗贝赫区市政体：西开普省的一个行政区。"},"examples":[{"en":"The project is funded by the Overberg District Municipality.","zh":"该项目由奥弗贝赫区市政体资助。"},{"en":"Overberg District’s main towns include Bredasdorp and Swellendam.","zh":"奥弗贝赫区的主要城镇包括布雷达斯多普和斯韦伦丹。"}]}],"synonyms":["Overberg region","Overberg District Municipality","Overberg District"],"phonetic":"/ˈoʊvərbɝːɡ/","extraExplanation":["“Overberg”来自南非荷兰语/荷兰语：over-（越过、在……那边）+ berg（山）。历史上可理解为“越过山那边的地区”，指从开普敦一带翻越山脉向东南延伸的区域。","在旅行与葡萄酒语境中，你也可能看到“The Overberg wine region（奥弗贝赫葡萄酒产区）”，指该区域内的葡萄种植与酿酒地带。"]}
{"word":"overbet","summary":{"en":"Overbet means betting too much, especially more than you can afford; in poker it can also mean making a bet larger than the pot.","zh":"Overbet 指下注过多、超过承受范围；在扑克中也可指对底池进行超额下注（下注额大于底池）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To bet more money than is reasonable or safe (especially more than you can afford to lose).","zh":"下注过多；押得超过合理或可承受的范围（尤其是超过自己输得起的金额）。"},"examples":[{"en":"He overbet on the game and ended up owing money he didn’t have.","zh":"他在那场比赛上下注过多，最后欠下了自己根本没有的钱。"},{"en":"Don’t overbet—set a limit before you start gambling.","zh":"别下注过多——开始赌博前先设定上限。"}]},{"partOfSpeech":"v.","definition":{"en":"In poker, to make a bet that is unusually large compared with the pot (the money already in the pot).","zh":"（扑克）在下注时下出相对底池异常大的注（远高于底池金额）。"},"examples":[{"en":"On the river, she overbet the pot to pressure her opponent into folding.","zh":"在河牌圈，她用超额下注（超过底池的下注）施压对手弃牌。"},{"en":"That overbet looked strong, but it was actually a bluff.","zh":"那个超额下注看起来很强，但其实是在诈唬。"}]}],"synonyms":["bet too much","wager too much","overwager"],"phonetic":"/ˌoʊvɚˈbɛt/","extraExplanation":["“overbet”在日常语境里常带有劝诫意味：强调“超过承受能力”的风险；在扑克语境里则更中性，指一种具体的下注尺寸策略（比如“overbet the pot”=下注额大于底池）。","常见搭配：overbet on (a game/stock)（在……上押太多）；overbet the pot（对底池超额下注）。"]}
{"word":"overbets","summary":{"en":"“Overbets” means bets bigger than the pot in poker, or the act of betting more than the pot.","zh":"“Overbets”指扑克里超过底池大小的下注，或指进行这种超池下注的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poker) bets that are larger than the current size of the pot, often used to apply maximum pressure or to polarize your range (very strong hands or bluffs).","zh":"（扑克）“超池下注”：下注金额大于当前底池大小的下注，常用来施加巨大压力或让自己的范围更“两极化”（要么很强要么在诈唬）。"},"examples":[{"en":"On the river, his overbets made it hard for me to call with a medium-strength hand.","zh":"在河牌圈，他的超池下注让我很难用中等强度的牌去跟注。"},{"en":"The solver sometimes recommends overbets when you have a big range advantage.","zh":"当你在牌力范围上占明显优势时，求解器有时会建议用超池下注。"}]},{"partOfSpeech":"v.","definition":{"en":"(Poker) to bet more than the size of the pot.","zh":"（扑克）进行超池下注；下注超过底池大小。"},"examples":[{"en":"He overbets the turn to force folds from one-pair hands.","zh":"他在转牌圈超池下注，逼迫只有一对的牌弃牌。"},{"en":"Don’t overbet every time—you’ll become predictable.","zh":"别每次都超池下注——你会变得很容易被读牌。"}]}],"synonyms":["overbet","bet big","bet bigger than the pot","overbet shove"],"phonetic":"ˈoʊvərˌbɛt","extraExplanation":["“overbet”主要用于德州扑克语境。常见表达有“overbet the pot / overbet jam（超池全下）”。这种下注尺寸通常代表两种极端：要么拿到很强的价值牌想赢更多，要么用强压力进行诈唬。是否合适取决于位置、牌面结构、对手类型与筹码深度。"]}
{"word":"overbetted","summary":{"en":"“Overbetted” is a nonstandard form; the usual word is “overbet,” meaning to bet or risk too much.","zh":"“overbetted”属非标准形式；常用词是“overbet”，意思是下注/冒风险过大。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"A nonstandard past tense/spelling of “overbet.” The standard past tense is usually “overbet” (same form as the base verb).","zh":"“overbet”的非标准过去式/拼写。标准过去式通常是“overbet”（与原形同形）。"},"examples":[{"en":"He wrote “overbetted” in his notes, but “overbet” is the usual past tense.","zh":"他在笔记里写了“overbetted”，但常见的过去式是“overbet”。"},{"en":"I overbet on that game and lost more than I could afford.","zh":"我在那场比赛上押得太大，输得超过了我能承受的范围。"}]},{"partOfSpeech":"vt.","definition":{"en":"To bet too much money or risk too much, often because you are too confident about winning.","zh":"下注过大；冒过大的风险（常因过度自信而押注太多）。"},"examples":[{"en":"Don’t overbet—set a budget before you start playing.","zh":"别下注过大——开始玩之前先设定预算。"},{"en":"The company overbet on one product, and the failure hurt the whole business.","zh":"公司把赌注压在单一产品上押得太大，结果失败拖累了整个业务。"},{"en":"She overbet her savings on a risky investment.","zh":"她把积蓄在高风险投资上押得太重。"}]}],"synonyms":["bet too much","risk too much","overcommit","go all in (informal)"],"phonetic":"/ˌoʊvɚˈbɛt/","extraExplanation":["“overbetted”在实际英语里很少见，常被视为拼写或动词变形错误。更自然的写法是：present/infinitive：overbet；past：overbet；past participle：overbet。","“bet”的过去式既可用“bet”，也可用“betted”（更少见、较正式或强调动作），但“overbet”通常沿用不规则形式“overbet”。"]}
{"word":"overbetting","summary":{"en":"Overbetting means betting too much; in poker it can also mean making a very large bet (often bigger than the pot).","zh":"Overbetting 指下注过多；在扑克中也可指超额下注（常常大于底池的下注）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Betting more money than is sensible or affordable; placing too many or too large bets so that the risk becomes excessive.","zh":"下注过多；押得不理性或超出承受能力，导致风险过高。"},"examples":[{"en":"Overbetting can quickly turn a fun game into a serious financial problem.","zh":"下注过多会很快把娱乐游戏变成严重的财务问题。"},{"en":"He lost his savings because of overbetting during the tournament.","zh":"他因为在比赛期间下注过多而把积蓄都输掉了。"},{"en":"Setting a budget helps prevent overbetting.","zh":"设定预算有助于避免下注过多。"}]},{"partOfSpeech":"n.","definition":{"en":"(Poker) Making an unusually large bet—often larger than the size of the pot—to put strong pressure on an opponent.","zh":"（扑克）超额下注；下一个异常大的注（常常大于底池），用来给对手强压。"},"examples":[{"en":"On the river, she used overbetting to force a tough decision.","zh":"在河牌圈，她用超额下注迫使对手做出艰难决定。"},{"en":"Overbetting the pot can work, but it’s risky if your opponent calls.","zh":"超额下注底池可能有效，但一旦对手跟注就很冒险。"}]}],"synonyms":["excessive betting","betting too much","overwagering","overspending (on bets)","overbet (poker)"],"phonetic":"/ˌoʊvərˈbɛtɪŋ/","extraExplanation":["“overbetting”来自动词 overbet（下得过大）+ -ing，常用于博彩、体育投注与扑克语境。日常语境更偏向“押太多/不理性投注”；扑克语境则是一个具体的下注尺度策略。","学习中可顺带区分：overbet（动词：超额下注） vs. overbetting（名词/动名词：这种行为或策略）。","在现实投注中，英语里常把 overbetting 和 bankroll management（资金管理）、responsible gambling（理性博彩）放在一起讨论，强调设定上限、避免情绪化加码。"]}
{"word":"overbias","summary":{"en":"Overbias means applying too much bias (especially in electronics), or making something excessively biased or skewed.","zh":"Overbias 指（尤其在电子学中）施加过大的偏置；也可指让观点/结果过度偏向、被扭曲。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Electronics) To apply too much bias (a steady voltage or current) to a device or circuit, pushing it away from its intended operating point.","zh":"（电子学）对器件或电路施加过大的偏置（恒定电压或电流），使其偏离预期的工作点。"},"examples":[{"en":"If you overbias the transistor, it may distort the signal or overheat.","zh":"如果你把晶体管偏置得过大，信号可能会失真或过热。"},{"en":"The amplifier sounded harsh because the output stage was overbiased.","zh":"这台功放听起来刺耳，因为输出级偏置过大。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make a judgment or model too strongly biased in one direction; to skew unfairly.","zh":"使判断或模型在某一方向上产生过强偏向；不公平地扭曲。"},"examples":[{"en":"Using only one source can overbias the report.","zh":"只用单一来源可能会让报告过度偏向。"},{"en":"The training data can overbias the algorithm toward certain results.","zh":"训练数据可能会让算法对某些结果产生过度偏向。"}]}],"synonyms":["overpolarize","overcompensate","skew","bias too heavily"],"phonetic":"/ˌoʊvɚˈbaɪəs/","extraExplanation":["在电子学里，bias（偏置）通常是为了让晶体管、二极管或功放工作在合适的“静态工作点”。overbias 常见后果包括：失真增加、功耗上升、温度更高，甚至缩短器件寿命。与之相对的词常是 underbias（偏置不足）。"]}
{"word":"overbid","summary":{"en":"Overbid means to bid higher than others or to offer too high a price, often more than something is worth.","zh":"Overbid 指出价高于他人，或出价过高（往往超过物品/项目的实际价值）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bid more than someone else, especially in an auction","zh":"（尤指拍卖中）出价高于他人"},"examples":[{"en":"She overbid everyone and won the painting.","zh":"她出价高过所有人，拍下了那幅画。"},{"en":"In a bidding war, it’s easy to overbid and regret it later.","zh":"在竞价大战里，很容易出价过高，之后又后悔。"}]},{"partOfSpeech":"v.","definition":{"en":"to bid more than something is worth; to offer an excessively high price","zh":"出价高于其价值；出价过高"},"examples":[{"en":"Don’t overbid on that car—it needs expensive repairs.","zh":"别把那辆车出价太高——它还需要昂贵的维修。"},{"en":"They overbid for the contract and then struggled to make a profit.","zh":"他们为拿下合同出价过高，后来很难盈利。"}]}],"synonyms":["outbid","bid too much","overpay"],"phonetic":"/ˌoʊvərˈbɪd/","extraExplanation":["“overbid”常见于拍卖（auction）或招标（tender）语境，强调“出价过高”可能带来的后果（亏损、后悔等）。","动词过去式和过去分词通常还是“overbid”（不规则变化）：overbid–overbid–overbid。"]}
{"word":"overbidden","summary":{"en":"“Overbidden” is a rare word, most often meaning “outbid/overbid” (someone offered a higher bid).","zh":"“overbidden”很少见，多数情况下表示“被别人出更高价压过（outbid/overbid）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Past participle of “overbid”: offered a higher price than someone else in an auction or competition.","zh":"（罕见/古语）“overbid”的过去分词：在拍卖或竞争中出价高于他人。"},"examples":[{"en":"She was disappointed to learn she had been overbidden at the last second.","zh":"她失望地得知自己在最后一秒被别人出价压过了。"},{"en":"The painting was overbidden by a private collector.","zh":"这幅画被一位私人收藏家以更高价格抢先出价买走了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Forbidden or prohibited too strongly or beyond what is reasonable.","zh":"（非常罕见）被过度禁止的；被禁止得太严、超出合理范围的。"},"examples":[{"en":"Some critics argued the topic had become overbidden in public discussion.","zh":"一些评论者认为这个话题在公共讨论中被过度禁止了。"}]}],"synonyms":["outbid","overbid","bid higher","surpass a bid"],"phonetic":"/ˌoʊvɚˈbɪdən/","extraExplanation":["“overbidden”在现代英语里非常少见，最常见的用法其实是当作“overbid”的旧式过去分词（类似于某些动词的旧式变化）。在当代写作中，更自然的表达通常是：“was outbid”或“was overbid”。","如果你想表达“过度禁止”，现代更常用的词是“overly restricted”“unduly prohibited”或“excessively banned”，读者更容易理解。"]}
{"word":"overbidding","summary":{"en":"Overbidding means bidding too much—offering a price higher than something is worth, especially in auctions.","zh":"Overbidding 指出价过高——报出高于物品实际价值的价格，尤其常见于拍卖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of bidding more money than something is worth (often in an auction), or offering too high a price","zh":"（常指拍卖中）出价过高；报出高于实际价值的价格"},"examples":[{"en":"Overbidding at an auction can lead to buyer’s remorse later.","zh":"在拍卖会上出价过高，之后可能会后悔。"},{"en":"The excitement of the room pushed him into overbidding.","zh":"现场的兴奋气氛让他不知不觉出价过高。"},{"en":"To avoid overbidding, set a maximum price before you start bidding.","zh":"为了避免出价过高，在竞拍前先设定一个最高价。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overbid”: to bid too high for something","zh":"“overbid”的现在分词：出价过高；竞价超过合理范围"},"examples":[{"en":"She realized she was overbidding and stopped raising her paddle.","zh":"她意识到自己出价过高，就不再举牌加价了。"},{"en":"People often start overbidding when they feel competitive.","zh":"人们在竞争心强时往往会开始出价过高。"}]}],"synonyms":["bidding too high","overpaying (in bidding)","excessive bidding"],"phonetic":"/ˌoʊvɚˈbɪdɪŋ/","extraExplanation":["在英语里，bid 是“出价/投标”。over- 这个前缀常表示“过度、超过”（如 overpay 付太多钱、overeat 吃太多），所以 overbid/overbidding 很直观地表示“出价超过合理水平”。拍卖情境中常见，也可用于商业投标或谈判中表示“报得太高”。"]}
{"word":"overbide","summary":{"en":"An archaic verb meaning “to endure or wait through something until it passes.”","zh":"一个古用动词，意为“忍受并熬过去；等到某事过去”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) To endure or outlast something; to wait through a period of difficulty until it passes.","zh":"（古用）忍受并挺过（困难时期）；熬过去，等到（不好的事）过去。"},"examples":[{"en":"We must overbide this hard winter, and better days will come.","zh":"我们必须熬过这个严冬，更好的日子会到来。"},{"en":"She overbide the pain in silence.","zh":"她默默忍受疼痛。"}]}],"synonyms":["endure","outlast","wait out","weather","get through"],"phonetic":"/ˌoʊvərˈbaɪd/","extraExplanation":["“overbide”是非常少见的古用词，现代英语里通常用“abide / endure / outlast / wait out / weather (a storm)”来表达类似意思。","它可以理解为“over-（越过、度过）+ bide（停留、等待）”，语感接近“wait out（等到……结束）”或“get through（挺过）”。"]}
{"word":"overbids","summary":{"en":"“Overbids” means bids too high, or (as a verb) offers more money than others or more than something is worth.","zh":"“overbids”表示（动词）出价高于他人或高于价值，或（名词复数）过高的出价。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “overbid”) to bid more money than someone else, especially in an auction.","zh":"（动词，overbid 的第三人称单数）出价高于别人，尤指在拍卖中。"},"examples":[{"en":"She overbids everyone at the auction and wins the painting.","zh":"她在拍卖会上出价高过所有人，最终拍下了那幅画。"},{"en":"If he overbids again, he may run out of budget.","zh":"如果他再一次出价过高，预算可能会不够。"}]},{"partOfSpeech":"v.","definition":{"en":"to bid more than something is worth; to offer too high a price.","zh":"出价超过物品的实际价值；给出过高的价格。"},"examples":[{"en":"New buyers sometimes overbids because they feel pressure to win.","zh":"新买家有时会因为想赢而在压力下出价过高。"},{"en":"Don’t overbids—set a maximum price before you start.","zh":"别出价过高——开始前先设定一个最高价。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) bids that are too high, often higher than the true value.","zh":"（复数名词）过高的出价；高于真实价值的报价。"},"examples":[{"en":"The seller rejected the low offers and waited for overbids.","zh":"卖家拒绝了低价报价，等待更高的出价。"},{"en":"Overbids can inflate prices in a hot market.","zh":"在火热的市场里，过高出价会推高价格。"}]}],"synonyms":["outbids","bids too much","overpays","offers too much"],"phonetic":"/ˌoʊvɚˈbɪdz/","extraExplanation":["“overbid”常见于拍卖（auction）与房产竞价（bidding war）语境。实用策略是先设定自己愿意支付的最高价（maximum bid），避免因为情绪或竞争心理而 overbid。"]}
{"word":"overbig","summary":{"en":"Overbig means “too big” or “oversized,” usually in informal usage.","zh":"overbig 意为“过大、太大、超大号”，多用于非正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too big; bigger than is needed, suitable, or comfortable (often used informally).","zh":"过大；大得不合适、超出需要或不舒服（多为非正式用法）。"},"examples":[{"en":"This jacket is overbig on me, so the sleeves cover my hands.","zh":"这件夹克对我来说太大了，所以袖子把手都盖住了。"},{"en":"They bought an overbig sofa, and now it blocks the walkway.","zh":"他们买了个过大的沙发，现在把过道都挡住了。"}]}],"synonyms":["too big","oversized","overlarge","too large"],"phonetic":"/ˌoʊvɚˈbɪɡ/","extraExplanation":["“overbig”在现代英语中不算常见，更常见、更自然的表达是“too big / oversized / overlarge”。在口语或非正式写作里，有时会用“over- + 形容词”来强调“过度、超过正常范围”的感觉（如 overconfident 过于自信）。","如果你是在衣服尺码语境中想表达“偏大/宽松”，也可以用“runs large”（This shirt runs large. 这件衬衫偏大）。"]}
{"word":"overbigness","summary":{"en":"Overbigness means being too big—an excessive size that may be inconvenient or out of proportion.","zh":"overbigness 指“过于巨大”，强调尺寸大到不合适、失衡或带来不便。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too big; excessive size or largeness (often implying it causes problems or looks awkward)","zh":"过于巨大；太大（常含“因此不方便、不协调或不合适”的意思）"},"examples":[{"en":"The overbigness of the sofa made the living room feel cramped.","zh":"沙发过于巨大，让客厅显得很拥挤。"},{"en":"People complained about the overbigness of the new building compared with the old neighborhood.","zh":"人们抱怨新建筑相对老街区来说过于庞大。"}]}],"synonyms":["excessive size","oversize","overlarge","undue largeness","bulkiness"],"phonetic":"/ˌoʊvɚˈbɪɡnəs/","extraExplanation":["“overbigness”不算常用词，更常见、更自然的表达是：oversize/overlarge/excessive size/too big。","构词上由 over-（过度）+ bigness（巨大）组成，因此语气通常带有“超过合理范围”的评价色彩。"]}
{"word":"overbill","summary":{"en":"Overbill means to charge too much on a bill or invoice.","zh":"Overbill 指在账单或发票上多收费、超额收费。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to charge someone too much by putting an excessive or incorrect amount on a bill or invoice","zh":"（在账单/发票上）多收费；超额开账单"},"examples":[{"en":"The contractor overbilled us for materials we never received.","zh":"承包商把我们没收到的材料也算进去了，向我们多收费。"},{"en":"If you think you were overbilled, ask for an itemized receipt.","zh":"如果你觉得被多收费了，可以要求提供明细收据。"}]}],"synonyms":["overcharge","overprice","overinvoice"],"phonetic":"/ˌoʊvɚˈbɪl/","extraExplanation":["“Overbill”常见于商业、医疗账单、服务合同等场景，语气通常带有“收费不合理/可能有错误甚至不诚信”的暗示。实际沟通中也常用被动：be overbilled（被多收费）。"]}
{"word":"overbillow","summary":{"en":"Overbillow means to billow or surge like waves, often covering something (a poetic/literary word).","zh":"Overbillow 指像波浪一样翻涌、鼓起并覆盖（多为诗歌/文学用词）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(often poetic) To rise, swell, or surge in large waves, especially so as to cover or flow over something.","zh":"（常为诗歌/文学用语）像巨浪一样翻涌、鼓起，尤指翻卷着覆盖或漫过某物。"},"examples":[{"en":"Mist overbillowed the valley at dawn, hiding the river.","zh":"黎明时分，薄雾翻涌着漫过山谷，把河流遮住了。"},{"en":"The curtains overbillowed in the wind and brushed the floor.","zh":"窗帘在风中鼓起翻卷，拂过地板。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause something to billow or surge over; to overwhelm or cover in a wave-like way.","zh":"使（某物）翻涌着漫过；以波浪般的方式淹没或覆盖。"},"examples":[{"en":"A sudden gust overbillowed the sail and pulled the boat forward.","zh":"一阵骤风把船帆吹得鼓起翻卷，带着小船向前冲去。"},{"en":"Dark clouds overbillowed the hills, turning the afternoon dim.","zh":"乌云翻涌着压过群山，让下午变得昏暗。"}]}],"synonyms":["billow over","surge over","roll over","swell","engulf"],"phonetic":"ˌoʊvərˈbɪloʊ","extraExplanation":["“over-”有“在……之上/越过/覆盖”的意思，“billow”指“（像帆、云、烟、布）鼓起翻滚”。合在一起的 overbillow 多见于诗歌或描写性散文，用来营造“波浪般涌动并覆盖”的画面感。","现代日常英语里更常用的表达包括：billow over, roll over, surge over, swell, engulf。写作时用 overbillow 会显得更文学、更古典。"]}
{"word":"overbit","summary":{"en":"Orbit means the path of something moving around another body in space, and it can also mean a figurative sphere of influence; it can be a noun or a verb.","zh":"Orbit 指天体绕另一物体运行的“轨道”，也可引申为“影响范围”；既可作名词也可作动词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the curved path that an object in space follows as it moves around another object because of gravity","zh":"（天体因引力作用而）绕另一物体运行的轨道"},"examples":[{"en":"The Moon’s orbit around Earth takes about 27 days.","zh":"月球绕地球运行一周大约需要27天。"},{"en":"Satellites stay in orbit because they are moving fast enough to keep falling around Earth.","zh":"卫星能保持在轨道上，是因为它们速度足够快，能够一直“绕着地球下落”。"}]},{"partOfSpeech":"v.","definition":{"en":"to move in a curved path around something, especially in space","zh":"（尤指在太空中）沿轨道绕……运行"},"examples":[{"en":"The Earth orbits the Sun once a year.","zh":"地球每年绕太阳公转一周。"},{"en":"A space station can orbit Earth for years.","zh":"空间站可以绕地球运行很多年。"}]},{"partOfSpeech":"n.","definition":{"en":"a range or area of activity, influence, or attention (often used figuratively)","zh":"（比喻）活动/影响/关注的范围"},"examples":[{"en":"Small businesses often work outside the orbit of big corporations.","zh":"小企业往往在大公司的影响范围之外运作。"},{"en":"The topic stayed in the orbit of local politics.","zh":"这个话题一直围绕地方政治展开。"}]}],"synonyms":["path","trajectory","revolve","circle","sphere (of influence)"],"phonetic":"/ˈɔrbɪt/","extraExplanation":["你输入的“overbit”不是常见英语单词；多数情况下人们想写的是“orbit（轨道；绕行）”。如果你确实指“overbit”，请告诉我上下文句子，我可以帮你判断是否是专有名词、拼写变体或打字错误。","“orbit”除了天文学含义，也常用作比喻：某人/某事“进入某人的orbit”表示进入其影响圈或社交圈；“in someone’s orbit”表示与某人有联系或在其影响之下。"]}
{"word":"overbite","summary":{"en":"Overbite is a dental condition where the upper front teeth overlap the lower front teeth more than normal; it can also be a less common verb meaning to bite in that way.","zh":"overbite 指覆咬合：上前牙覆盖下前牙过多；也可作较少见的动词，表示以这种方式咬合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry) A condition where the upper front teeth overlap the lower front teeth more than usual when the mouth is closed.","zh":"（牙科）上前牙在咬合时覆盖下前牙过多的情况（上牙“盖”下牙太多）。"},"examples":[{"en":"My dentist said my overbite is mild and doesn’t need braces right now.","zh":"牙医说我的覆咬合（龅牙倾向）很轻微，现在不一定需要戴牙套。"},{"en":"An overbite can sometimes cause jaw pain or uneven tooth wear.","zh":"覆咬合有时会导致下颌疼痛或牙齿磨损不均。"}]},{"partOfSpeech":"v.","definition":{"en":"To close the jaws so that the upper teeth overlap the lower teeth; to bite with an overbite (less common).","zh":"（较少用）指用上牙覆盖下牙的方式咬合；呈覆咬合状态地咬。"},"examples":[{"en":"Some people naturally overbite when they clench their teeth.","zh":"有些人咬紧牙时会自然形成覆咬合。"}]}],"synonyms":["deep bite","malocclusion"],"phonetic":"/ˈoʊvərˌbaɪt/","extraExplanation":["“overbite”是口语和牙科里都常见的词，常被误当作“buck teeth（龅牙）”。两者有关但不完全一样：overbite强调上下牙的“垂直覆盖”关系；而buck teeth更偏向形容上门牙“向前突出”的外观（更口语，带评价色彩，使用时注意礼貌）。","在牙科里还常见对比词：overjet（水平覆盖/上牙向前突出距离），underbite（反颌/地包天：下牙在前）。如果你是在描述外观或症状，最好用中性词overbite/underbite，避免让人感觉被评判。"]}
{"word":"overbites","summary":{"en":"“Overbites” is the plural of “overbite,” meaning an excessive overlap of the upper front teeth over the lower front teeth.","zh":"“Overbites”是“overbite”的复数，指上前牙对下前牙覆盖过大的咬合情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of overbite) A dental condition where the upper front teeth overlap the lower front teeth more than usual.","zh":"（overbite 的复数）一种牙齿咬合情况：上前牙对下前牙的覆盖量比正常更大。"},"examples":[{"en":"The dentist said her overbites could cause jaw discomfort over time.","zh":"牙医说她的上颌前突咬合（overbites）久了可能会引起下颌不适。"},{"en":"Braces are sometimes used to correct overbites in teenagers.","zh":"牙套有时用于矫正青少年的上颌前突咬合（overbites）。"}]}],"synonyms":["overbite (singular)","deep bite","excessive overjet (related, not identical)"],"phonetic":"ˈoʊvərˌbaɪt","extraExplanation":["在日常英文里，人们更常说单数 overbite（一个人的一种咬合问题），或说 someone has an overbite。用复数 overbites 往往出现在：讨论多位患者/多种病例（e.g., “overbites and underbites”）或统计研究中。","overbite 在牙科语境中常与 underbite（地包天/反颌）、crossbite（交叉咬合）、open bite（开颌）一起出现。是否需要矫正通常取决于功能（咀嚼、发音、颞下颌关节不适）和美观等因素。"]}
{"word":"overbitten","summary":{"en":"Overbitten describes someone who has an overbite (upper front teeth overlap the lower ones too much).","zh":"Overbitten 指“有深覆合/上颌前突咬合”的（上排门牙覆盖下排门牙过多）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an overbite (the upper front teeth extend too far over the lower front teeth).","zh":"（牙齿）有“上颌前突/深覆合”（上排门牙覆盖下排门牙过多）的。"},"examples":[{"en":"The dentist said he was slightly overbitten and might benefit from braces.","zh":"牙医说他有轻微的深覆合，可能适合戴牙套矫正。"},{"en":"Her overbitten bite made it hard to close her lips comfortably.","zh":"她的深覆合让她很难自然舒适地闭合嘴唇。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Too eager or excessive in “biting” or attacking an idea; overdone.","zh":"（比喻，用法少）在“咬住/抨击”某个观点时过于用力；做得过头。"},"examples":[{"en":"His critique felt overbitten—sharp, but not very fair.","zh":"他的批评有点“咬得太狠”——尖锐，但不太公允。"}]}],"synonyms":["overbited (rare)","having an overbite","buck-toothed (informal, can be insensitive)"],"phonetic":"/ˌoʊvɚˈbɪtən/","extraExplanation":["“overbitten”主要用于牙科语境，对应名词“overbite”（深覆合/上颌前突的咬合关系）。日常英语里更常见的说法是“have an overbite”或“be overbitten”。比喻义较少见，写作中用来形容攻击性过强或用力过猛的表达。"]}
{"word":"overbitter","summary":{"en":"Overbitter means “too bitter,” usually describing food, drinks, or medicine whose bitterness is stronger than desired.","zh":"Overbitter 意为“过苦”，多用于形容食物、饮品或药物的苦味过强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too bitter in taste; having more bitterness than is pleasant or intended","zh":"（味道）过苦的；苦味过重的（不舒服或不符合预期）"},"examples":[{"en":"The coffee is overbitter because it was brewed too long.","zh":"这杯咖啡太苦了，因为萃取（冲泡）时间太长。"},{"en":"The sauce turned overbitter after the herbs burned in the pan.","zh":"香草在锅里烧焦后，酱汁就变得苦得过头了。"},{"en":"This medicine tastes overbitter, so I take it with water.","zh":"这药苦得厉害，所以我会配水一起吞下去。"}]}],"synonyms":["too bitter","overly bitter","excessively bitter","unduly bitter"],"phonetic":"/ˌoʊvɚˈbɪtɚ/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”。因此 overbitter 直观意思就是“苦过头”。在日常英语里更常见的说法是 too bitter 或 overly bitter；overbitter 更像是描述性的写法，常见于食物、饮品、草药、药物风味等语境。","口味表达里，bitter（苦）不一定是负面：比如黑巧克力、啤酒花、柚子皮都有“适度的苦味”。但 overbitter 强调“苦味压过了其他风味”，通常带有负面评价。"]}
{"word":"overbitterly","summary":{"en":"“Overbitterly” means “too bitterly”—either overly resentful in tone or excessively bitter in taste.","zh":"“overbitterly”表示“苦（或苦涩、怨恨）得过头”，可指语气/情绪过分怨怼，也可指味道苦过重。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively bitter or resentful way (often about feelings, words, or tone).","zh":"以过分苦涩、怨恨的方式（常指情绪、言语或语气）。"},"examples":[{"en":"He spoke overbitterly about his former friend, as if nothing good had ever happened between them.","zh":"他过分怨恨地谈起以前的朋友，仿佛他们之间从未有过任何美好的事。"},{"en":"She laughed overbitterly, and the room went quiet.","zh":"她苦涩地笑得过头了，房间一下子安静下来。"}]},{"partOfSpeech":"adv.","definition":{"en":"With too strong a bitter taste (about food, drink, or medicine).","zh":"（指食物、饮料或药物）苦味过重地。"},"examples":[{"en":"The coffee was brewed overbitterly, so he added a little milk.","zh":"咖啡冲得苦过头了，所以他加了一点牛奶。"},{"en":"If you cook the greens too long, they can taste overbitterly.","zh":"如果把青菜煮太久，味道可能会苦得过头。"}]}],"synonyms":["too bitterly","very bitterly","with bitterness","resentfully","acidly"],"phonetic":"/ˌoʊvərˈbɪtərli/","extraExplanation":["“over-”常表示“过度、太……”。“bitterly”既可指味觉上的“苦”，也常用于情感上的“苦涩、怨怼”。因此“overbitterly”多用于强调“苦/怨”已经超过正常或合理的程度。","这个词在日常口语中不算常见，更常见的表达是“too bitterly / very bitterly / with deep bitterness”。但在文学或较强调语气的写作里，用“overbitterly”能突出“过分、失衡”的感觉。"]}
{"word":"overbitterness","summary":{"en":"Overbitterness means too much bitterness, either in taste or in emotion.","zh":"overbitterness 指“苦味/苦涩过度”，可用于味觉或情绪层面的“过分怨苦”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive bitterness; more bitterness (in taste or in feelings) than is normal, pleasant, or helpful","zh":"过度的苦味；（味觉或情绪上的）过分苦涩，超过正常、愉快或有益的程度"},"examples":[{"en":"The soup’s overbitterness made it hard to finish.","zh":"这汤的苦味过重，让人很难喝完。"},{"en":"Years of disappointment turned his sadness into overbitterness.","zh":"多年的失望把他的悲伤变成了过度的苦涩。"},{"en":"A little bitterness can add depth to dark chocolate, but overbitterness ruins the balance.","zh":"一点苦味能让黑巧更有层次，但苦过头就会破坏平衡。"}]}],"synonyms":["excessive bitterness","too much bitterness","overly bitter taste","resentment (emotional sense)","acerbity"],"phonetic":"/ˌoʊvɚˈbɪtɚnəs/","extraExplanation":["“overbitterness”由前缀 over-（过度、太多）+ bitterness（苦味；怨恨、愤懑）构成，属于不太常见的名词。日常英语里更常说 excessive bitterness / too much bitterness。","可用于两种常见语境：①味觉（咖啡、可可、药味、蔬菜等的苦味过强）；②情绪与态度（对人或命运的怨恨、愤懑过重，影响判断或关系）。"]}
{"word":"overblack","summary":{"en":"Overblack means excessively black or too dark, or to make something too black—mainly used in image/print contexts.","zh":"overblack 指“过黑/过暗”，或“把……弄得过黑”，多用于图像处理或印刷语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too dark or excessively black in color (often describing an image, print, or shadow).","zh":"颜色过黑的；黑得过度的（常形容图像、印刷品或阴影）。"},"examples":[{"en":"The photo looks overblack—details in the jacket are lost.","zh":"这张照片太过黑了——夹克上的细节都看不见了。"},{"en":"Try lowering the contrast so the shadows don’t go overblack.","zh":"把对比度调低一点，避免阴影变得过黑。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something too black or too dark, especially in printing or editing.","zh":"把某物弄得过黑/过暗（尤指印刷或后期编辑时）。"},"examples":[{"en":"The printer overblacked the text, and the letters bled slightly.","zh":"打印把文字印得过黑，字边有点糊开了。"},{"en":"Don’t overblack the background, or the subject won’t stand out naturally.","zh":"背景别处理得太黑，不然主体看起来不自然地突出。"}]}],"synonyms":["too dark","overly dark","pitch-black (informal)","crushed (blacks)","over-inked"],"phonetic":"/ˌoʊvɚˈblæk/","extraExplanation":["“overblack”不是日常英语里的高频词，更常见的表达是“too dark / overly dark / crushed blacks（暗部死黑）”。","在摄影与调色里，暗部细节因为过暗而消失，常说“the blacks are crushed”。在印刷里，如果黑墨量过高、导致糊字或发闷，也可能用“overblack/over-ink”。"]}
{"word":"overblame","summary":{"en":"Overblame means blaming someone too much or more than is fair.","zh":"overblame 指对某人过度责怪或不公平地过分归咎。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to blame someone too much or more than is fair (often ignoring other causes or shared responsibility)","zh":"过度责怪；过分归咎于（常指忽略其他原因或共同责任）"},"examples":[{"en":"Don’t overblame yourself for the mistake—everyone was under pressure.","zh":"别为这个错误过度责怪自己——当时大家压力都很大。"},{"en":"The report warns against overblaming one person when the problem is systemic.","zh":"报告提醒不要把系统性问题过度归咎于某一个人。"}]}],"synonyms":["blame too much","overcriticize","fault too heavily","scapegoat","place too much blame on"],"phonetic":"/ˌoʊvɚˈbleɪm/","extraExplanation":["“over-”是一个常见前缀，表示“过度、太……”。因此 overblame 的语气通常带有“责怪得不公平/不成比例”的意味。日常写作中更常见的表达包括 blame too much / place too much blame on / scapegoat（找替罪羊）。"]}
{"word":"overblamed","summary":{"en":"“Overblamed” means someone was blamed too much or unfairly (or the act of blaming too much).","zh":"“overblamed”表示（某人）被过度责备/不公平归咎，或指“过度责备”的行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle) blamed someone too much or more than was fair.","zh":"（过去式/过去分词）对某人过度责备；责怪得不公平、超过应有程度。"},"examples":[{"en":"The coach later admitted he had overblamed the goalkeeper for the loss.","zh":"教练后来承认，他把输球过度归咎于守门员了。"},{"en":"She felt overblamed for a mistake that the whole team contributed to.","zh":"她觉得自己为一个全队都有责任的错误背了过多的锅。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a person who has been blamed too much or unfairly.","zh":"（形容人）被过度责备的；被不公平归咎的。"},"examples":[{"en":"He was the overblamed intern, even though the problem came from poor planning.","zh":"他成了那个被过度责备的实习生，尽管问题源自糟糕的规划。"},{"en":"In the story, the overblamed character becomes quiet and withdrawn.","zh":"在故事里，那位被过度责备的角色变得沉默寡言、逐渐退缩。"}]}],"synonyms":["unfairly blamed","blamed too much","scapegoated","wrongly accused"],"phonetic":"/ˌoʊvɚˈbleɪmd/","extraExplanation":["“over-”这个前缀常表示“过度、超过正常/合理程度”，如 overwork（过度工作）、overreact（反应过度）。因此 overblame 强调“责备过头、把责任推得太多”。","overblame/overblamed 不是最常见的固定词，但在口语和写作中可用来清晰表达“背锅背多了/被怪得太多”。更常见的替代表达有: unfairly blamed, blamed too much, made a scapegoat（被当替罪羊）。"]}
{"word":"overblaming","summary":{"en":"“Overblaming” means blaming too much or unfairly; it can also refer to the habit of doing this.","zh":"“overblaming”指过度责怪/不公平地归咎；也可指这种过度归责的行为或习惯。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “overblame”) blaming someone or something too much, or more than is fair or helpful.","zh":"（动词 overblame 的现在分词/动名词）过度责怪；把责任归咎得过多，超过公平或有帮助的程度。"},"examples":[{"en":"We’re overblaming the new employee for a problem caused by poor training.","zh":"我们把问题过度归咎于新员工了，其实原因是培训不足。"},{"en":"Overblaming one person can stop the team from fixing the real issue.","zh":"过度责怪某一个人，会让团队无法解决真正的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of assigning too much blame.","zh":"过度责怪（的行为或习惯）；过分归责。"},"examples":[{"en":"Overblaming creates fear and makes people hide mistakes.","zh":"过度责怪会制造恐惧，让人们隐瞒错误。"},{"en":"The manager tried to reduce overblaming and focus on solutions.","zh":"经理试图减少过度责怪，把重点放在解决方案上。"}]}],"synonyms":["blaming too much","overcriticizing","placing too much blame","scapegoating (sometimes)","being overly harsh"],"phonetic":"ˌoʊvərˈbleɪmɪŋ","extraExplanation":["“overblaming”在日常英语里不算特别常见，更常见的表达有：“blaming too much / blaming unfairly / placing too much blame on … / being overly critical”。不过在讨论职场文化、心理健康或冲突沟通时，用“overblaming”能很直接地强调“责怪过度”这一点。","常见搭配：overblaming someone for something（因某事过度责怪某人）；overblaming yourself（过度自责）。与其相对的说法有：take responsibility（承担责任）、focus on solutions（专注解决）。"]}
{"word":"overblanch","summary":{"en":"Overblanch means to blanch food for too long, harming its texture, flavor, or color.","zh":"overblanch 指把食材焯水/汆烫过久，导致口感、风味或颜色变差。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to blanch (briefly boil or scald) for too long, so the food loses texture, flavor, or color","zh":"（烹饪）焯水/汆烫过久，导致食材口感变差、风味流失或颜色变暗"},"examples":[{"en":"If you overblanch broccoli, it turns mushy and dull green.","zh":"如果西兰花焯过头，就会变得软烂，绿色也会发暗。"},{"en":"Don’t overblanch the spinach—ten seconds is enough.","zh":"菠菜别焯太久——十秒就够了。"},{"en":"She overblanched the beans, so they lost their crisp bite.","zh":"她把四季豆焯过头了，所以不再脆爽。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something lose its brightness or color by blanching too much (often said of vegetables)","zh":"（常指蔬菜）因焯水过度而使颜色变淡、失去鲜亮"},"examples":[{"en":"Overblanching can overblanch the peas until they look grayish.","zh":"焯得太久会让豌豆颜色变淡，甚至看起来发灰。"},{"en":"The recipe warns that longer boiling will overblanch the greens.","zh":"食谱提醒：煮得太久会让绿叶菜颜色变得不鲜亮。"}]}],"synonyms":["overcook (in blanching step)","blanch too long","overboil (briefly)"],"phonetic":"/ˌoʊvərˈblæntʃ/","extraExplanation":["“blanch”在烹饪里指把食材短时间放入沸水（有时再过冷水）以定色、去涩、便于后续烹调；“over-”表示“过度/过头”。所以“overblanch”多见于食谱或烹饪讨论中，强调时间太长带来的负面结果。","常见做法是焯完立刻“ice bath/ice-water shock”（冰水冷却）来停止余温继续加热，减少“overblanch”的风险。"]}
{"word":"overblaze","summary":{"en":"Overblaze is a rare verb meaning to blaze or make something blaze too strongly or too brightly.","zh":"Overblaze 是个较罕见的动词，指燃烧（或使其燃烧）得过旺、过亮。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare) To blaze too strongly or too brightly; to burn with excessive flames or light.","zh":"（罕见）燃烧得过旺；火焰或光亮过强、过亮。"},"examples":[{"en":"The bonfire began to overblaze when someone poured on more fuel.","zh":"有人又加了燃料后，篝火开始烧得过旺。"},{"en":"Be careful—the stove can overblaze if the airflow is too strong.","zh":"小心——如果进风太强，炉火可能会烧得过旺。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) To make something blaze too strongly; to intensify a flame or brightness beyond what is safe or appropriate.","zh":"（罕见，文学用法）使……燃烧过旺；把火势或亮度增强到不安全或不合适的程度。"},"examples":[{"en":"He overblazed the torch with oil, and it flared up suddenly.","zh":"他往火把上加了太多油，把火势弄得过旺，结果突然窜起火苗。"},{"en":"Don’t overblaze the room with harsh lights; a softer lamp is enough.","zh":"别用刺眼的灯把房间照得太亮；用柔和一点的灯就够了。"}]}],"synonyms":["blaze too fiercely","flare up","burn too brightly","overheat (related)"],"phonetic":"/ˌoʊvərˈbleɪz/","extraExplanation":["“over-”常见表示“过度/超过”，如 overheat（过热）、overwork（过劳）。因此 overblaze 直观含义就是“火/光过度地 blaze（燃烧、闪耀）”。","这个词在现代日常英语中很少见，更可能出现在诗歌或较文学化的描写里。日常表达更常用 burn too brightly / flare up / blaze too fiercely 等。"]}
{"word":"overbleach","summary":{"en":"Overbleach means to bleach too much, causing damage or an overly pale result.","zh":"overbleach 指漂白过度，导致过白或受损。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To bleach something too much, so it becomes too light, weak, damaged, or loses its natural color/quality.","zh":"过度漂白；漂白过头，导致颜色过浅、变脆、受损或失去原本质感。"},"examples":[{"en":"If you overbleach your hair, it can become dry and break easily.","zh":"如果你把头发漂白过头，头发会变得很干而且容易断。"},{"en":"The shirts were overbleached, so the fabric looks thin and worn.","zh":"这些衬衫被漂白过头了，所以布料看起来很薄、很旧。"},{"en":"Try not to overbleach the paper; it can weaken the fibers.","zh":"尽量不要把纸漂白过头；那会削弱纤维。"}]}],"synonyms":["bleach too much","overwhiten","over-lighten"],"phonetic":"/ˌoʊvɚˈblitʃ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”（如 overcook 煮过头、overwork 过劳）。因此 overbleach 通常暗示结果是不好的：颜色变得不自然、材质变脆或受损。","在日常语境里，overbleach 常见于护发/染发、洗衣漂白、纺织与纸张加工等场景；有时也可引申为“把照片/画面漂得太白、细节被洗掉”。"]}
{"word":"overblessed","summary":{"en":"Overblessed means having more blessings or good things than you can easily manage, often said humorously.","zh":"Overblessed 指好事或“祝福”多到一时难以应付，常带幽默的“幸福的烦恼”语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more good things, opportunities, or advantages than you can easily handle; sometimes said humorously or with mild complaint.","zh":"（拥有）好事、机会或优势多到一时难以应付；有时带点幽默或轻微抱怨的语气。"},"examples":[{"en":"Since the product went viral, our small team has been overblessed with orders.","zh":"自从产品爆红后，我们这个小团队订单多到有点“幸福的烦恼”。"},{"en":"I’m overblessed with invitations this weekend—I can’t go to everything.","zh":"这个周末邀约多到我分身乏术，真是“好事太多”。"},{"en":"She joked that she was overblessed with helpful relatives during the move.","zh":"她开玩笑说搬家时亲戚们太热心，热心到让她有点招架不住。"}]}],"synonyms":["overfortunate","blessed (informal)","spoiled (sometimes, depending on context)","too lucky","fortunate"],"phonetic":"/ˌoʊvɚˈblest/","extraExplanation":["“overblessed”常见于口语或轻松的书面表达，带有“too much of a good thing（好事也会过头）”的感觉。","词根是 bless（祝福），因此有时会带一点宗教/感恩语感；在语境中既可以真诚表达“很受眷顾”，也可以用反讽表达“好到成了负担”。"]}
{"word":"overblessedness","summary":{"en":"Overblessedness means being extremely blessed or fortunate, sometimes with a slightly ironic sense that having too many good things can feel burdensome.","zh":"overblessedness 指“极其蒙福/非常幸运”的状态，有时也带一点反讽，表示“好事太多反而成负担”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being extremely blessed or fortunate; having more good fortune than usual.","zh":"极其蒙福或幸运的状态；拥有超出寻常的好运。"},"examples":[{"en":"She spoke about her overblessedness with gratitude, knowing many people were struggling.","zh":"她怀着感恩谈到自己的“过度蒙福”，也知道很多人正处在困境中。"},{"en":"His overblessedness showed in the way he thanked everyone who helped him succeed.","zh":"他对每一个帮助过他的人表达感谢，体现出他那种“幸运过多”的感受。"}]},{"partOfSpeech":"n.","definition":{"en":"A (often slightly ironic) feeling that having too many advantages or good things can be burdensome or uncomfortable.","zh":"（常带一点反讽）一种感觉：好处或优势太多反而变成负担或让人不自在。"},"examples":[{"en":"He joked about the overblessedness of having three great job offers at once.","zh":"他开玩笑说同时拿到三份很棒的工作邀约，真是“幸福的烦恼”。"},{"en":"Her overblessedness made it hard to complain, even when she felt overwhelmed.","zh":"即使她感到压力很大，因为“太幸运了”，也很难开口抱怨。"}]}],"synonyms":["good fortune","blessedness","great fortune","abundance","embarrassment of riches (idiom)"],"phonetic":"/ˌoʊvɚˈblɛsɪdnəs/","extraExplanation":["这是一个比较少见、偏创造性的名词：over-（过度）+ blessed（被祝福的、幸运的）+ -ness（名词后缀）。更常见的表达是“feel very blessed / be extremely fortunate / have an embarrassment of riches / first-world problems（带点吐槽意味）”。","语气上常见两种：①真诚地强调“我很受眷顾”；②半开玩笑地表达“好事太多也会有压力”（类似中文“幸福的烦恼”）。使用时注意场合，避免在他人遭遇困难时显得不合时宜。"]}
{"word":"overblew","summary":{"en":"“Overblew” is the past tense of “overblow,” meaning to blow too strongly or for wind to blow something away; less commonly, it means something passed over or died down.","zh":"“overblew”是“overblow”的过去式，常指吹得太猛或风把东西吹走/吹倒；较少见时可指事情过去、平息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Simple past tense of “overblow”: to blow too strongly, or for wind to blow something away/over.","zh":"“overblow”的一般过去式：吹得太猛；（风）把某物吹走/吹倒。"},"examples":[{"en":"The storm overblew the fence during the night.","zh":"夜里暴风把篱笆吹倒了。"},{"en":"He overblew the candle, and hot wax splashed onto the table.","zh":"他把蜡烛吹得太猛，热蜡溅到了桌子上。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative, less common) To pass over or blow over; to end as time goes by.","zh":"（比喻，较少见）过去；平息；随着时间推移而结束。"},"examples":[{"en":"After a few days, the argument overblew and everyone moved on.","zh":"几天后，争吵就过去了，大家也都继续向前了。"}]}],"synonyms":["blew too hard","blew over","gusted","knocked down (by wind)"],"phonetic":"/ˌoʊvɚˈbluː/","extraExplanation":["“overblew”来自动词“overblow”，在现代英语里相对少见；更常见的表达通常是“blew too hard”（吹得太猛）或“blew over”（平息/过去）。","拼写上要注意：现在时是“overblow”，过去式是“overblew”，过去分词常见为“overblown”（也可作形容词，表示“夸张的/言过其实的”，如 an overblown rumor）。"]}
{"word":"overblind","summary":{"en":"Overblind is a rare word meaning “to blind too much” or “excessively blinded,” often used figuratively.","zh":"Overblind 是个较少见的词，表示“使过度失明/过度蒙蔽”或“过于被蒙蔽的”，常用于比喻。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) to blind someone too much or too completely; to make it hard for them to see or notice something (literally or figuratively).","zh":"（罕用）使某人过度失明或过于看不见；（字面或比喻）让人难以看清或察觉某事。"},"examples":[{"en":"The sudden spotlight overblinded the audience for a moment.","zh":"突如其来的聚光灯让观众一时间被强光照得看不清。"},{"en":"Anger can overblind people to the consequences of their actions.","zh":"愤怒可能让人被情绪蒙蔽，看不清自己行为的后果。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) excessively blind; unable to see clearly because of too much light or too much “blindness” (often figurative).","zh":"（罕用）过于失明的；因强光或“盲目”（多为比喻）而难以看清的。"},"examples":[{"en":"He felt overblind with panic and couldn’t think straight.","zh":"他被恐慌彻底冲昏了头脑，难以清晰思考。"}]}],"synonyms":["dazzle","blind","overwhelm","obscure"],"phonetic":"/ˌoʊvərˈblaɪnd/","extraExplanation":["“overblind”不是现代英语里的常用词，更常见的表达是“blind (someone) completely / temporarily blind / dazzle / be blinded by…”。它由前缀 over-（过度、过分）+ blind（使失明/盲目的）构成，因此含义通常可从构词直接推断。","比喻用法常接介词 to：be overblinded to sth（对某事过于“看不见/忽视”），意思接近“be blinded to sth”。"]}
{"word":"overblindly","summary":{"en":"“Overblindly” means “too blindly; excessively without thinking.” It is uncommon, and “too blindly” is usually more natural.","zh":"“overblindly”表示“过于盲目地、不加思考地”。该词不常用，通常用“too blindly”等更自然。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively unthinking or unquestioning way; too blindly.","zh":"过于盲目地；不加思考、不过问地（程度太过）。"},"examples":[{"en":"Don’t overblindly follow advice online—check the source first.","zh":"不要过于盲目地相信网上的建议——先核实来源。"},{"en":"She overblindly trusted the salesperson and regretted it later.","zh":"她过于盲目地相信销售人员，后来后悔了。"}]}],"synonyms":["too blindly","blindly","unquestioningly","uncritically","without thinking"],"phonetic":"/ˌoʊvɚˈblaɪndli/","extraExplanation":["“overblindly”不是常见标准用词，更自然的表达通常是：too blindly / blindly / unquestioningly / without thinking / without question。","构词上可理解为 over-（过度）+ blindly（盲目地）。在正式写作中建议改用更常见的搭配，以免读者觉得生硬或不地道。"]}
{"word":"overblithe","summary":{"en":"“Overblithe” means overly carefree or cheerful in a way that seems insensitive or not serious enough.","zh":"“overblithe”指过分轻松/乐观，以至显得不够严肃或缺乏同理心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too cheerful or carefree in a way that seems careless, insensitive, or not serious enough about a problem.","zh":"过分轻快/乐观（以至显得漫不经心、缺乏同理心或不够严肃）。"},"examples":[{"en":"His overblithe response to the crisis made the team feel unheard.","zh":"他对这场危机过分轻描淡写的回应，让团队觉得自己的担忧没有被听见。"},{"en":"She gave an overblithe promise that everything would be fine, but there was no plan.","zh":"她过分乐观地保证“一切都会好起来”，但其实并没有任何计划。"}]}],"synonyms":["overly carefree","too lighthearted","glib","insouciant","nonchalant"],"phonetic":"/ˌoʊvɚˈblaɪð/","extraExplanation":["“overblithe”由前缀 over-（过度）+ blithe（轻快、无忧无虑）构成。它通常带有批评意味：不是单纯的“开心”，而是“开心得不合时宜”，常用来指出对风险、痛苦或严肃问题的轻忽。","blithe 在文学里有时是正面的（轻松愉快），但加上 over- 往往转为负面语气，强调“过头了”。"]}
{"word":"overbloom","summary":{"en":"Overbloom means to bloom excessively (often with negative effects) or the state of excessive blooming.","zh":"Overbloom 指（植物）开花过盛（常带负面影响），或指花开过盛的状态。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to bloom too much or too long, often resulting in fewer fruits/seeds or a tired-looking plant; to be in excessive bloom","zh":"（植物）开花过盛或花期过长，常导致结果变少或植株看起来“透支”；花开得过多"},"examples":[{"en":"If a tree overblooms in spring, it may set fewer fruits later.","zh":"如果一棵树在春天开花过盛，之后可能结果更少。"},{"en":"The roses overbloomed during the warm spell and then faded quickly.","zh":"那阵暖流让玫瑰花开得太旺，结果很快就凋谢了。"}]},{"partOfSpeech":"n.","definition":{"en":"a period or state of excessive blooming; an overabundance of flowers","zh":"（一段时间或一种状态的）花开过盛；花朵过于繁多"},"examples":[{"en":"After the heavy rains, the garden went into an overbloom.","zh":"大雨过后，花园进入了花开过盛的状态。"},{"en":"The orchard’s overbloom worried growers who wanted a balanced crop.","zh":"果园花开过盛让种植者担心，因为他们希望产量更均衡。"}]}],"synonyms":["bloom too much","excessive bloom","heavy bloom","flower profusely"],"phonetic":"/ˌoʊvɚˈblum/","extraExplanation":["“overbloom”不是特别常见的日常词，更常见的表达是“bloom too much / excessive bloom / heavy bloom”。不过在园艺、农业语境里用它很直观，强调“开花多到不一定是好事”。","在写作上它也带一点诗意：不仅表示“花开得盛”，还暗含“盛极而衰/过度消耗”的感觉。"]}
{"word":"overblouse","summary":{"en":"An overblouse is a loose outer blouse worn over other clothes, often for protection or as a uniform.","zh":"overblouse 指套在衣服外面的宽松罩衫，常用于防护或作为制服上衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loose blouse or smock-like top, often worn over other clothing as a protective or uniform garment (for example by artists, workers, or schoolchildren).","zh":"罩衫；（类似工作罩衣的）外穿宽松上衣，常套在其他衣服外面，用作保护或制服（如画画、工作或学生穿）。"},"examples":[{"en":"She wore an overblouse to keep paint off her clothes in art class.","zh":"她在美术课上穿了罩衫，防止颜料弄脏衣服。"},{"en":"The students put on their overblouses before the science experiment.","zh":"做科学实验前，学生们先穿上罩衫。"}]}],"synonyms":["smock","work blouse","overall (garment)","protective blouse"],"phonetic":"/ˈoʊvərˌblaʊs/","extraExplanation":["“overblouse”由 over-（在……外面）+ blouse（女式衬衫/上衣）构成，强调“外穿、罩在外面”。在英式或欧陆语境里也常见类似词：smock、overall、apron（围裙）。在时尚语境中，它有时也指较长、较宽松、可当外搭的上衣，但最常见用法仍是“保护性罩衣/制服上衣”。"]}
{"word":"overblow","summary":{"en":"Overblow most often means “exaggerate,” and it can also mean “blow too hard,” especially when playing a wind instrument.","zh":"Overblow 最常指“夸大”，也可指“吹得过猛”，尤其用于管乐器吹奏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To exaggerate something and make it seem more important, serious, or worse than it really is.","zh":"夸大；把某事说得更重要、更严重或更糟。"},"examples":[{"en":"The media sometimes overblows small problems into big scandals.","zh":"媒体有时会把小问题夸大成大丑闻。"},{"en":"Don’t overblow the mistake—everyone makes errors.","zh":"别把这个错误夸大——每个人都会犯错。"}]},{"partOfSpeech":"v.","definition":{"en":"To blow too hard (for example, into a horn or a wind instrument).","zh":"（对着号角或管乐器等）吹得过猛；用力过度地吹。"},"examples":[{"en":"If you overblow the flute, the note can sound sharp or squeaky.","zh":"如果你把长笛吹得过猛，音会偏高或发出刺耳的吱吱声。"},{"en":"He overblew the trumpet and cracked the note.","zh":"他把小号吹得太猛，把音吹破了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To overwhelm or defeat by blowing, especially in a storm or strong wind (less common today).","zh":"（尤指风暴中）以强风压倒、吹垮（较少见）。"},"examples":[{"en":"The gale overblew the small boat and forced it back to shore.","zh":"狂风压过了小船，迫使它返回岸边。"}]}],"synonyms":["exaggerate","overstate","inflate","magnify","blow out of proportion"],"phonetic":"/ˌoʊvɚˈbloʊ/","extraExplanation":["“overblow”最常见的用法是比喻义“夸大”，常见搭配有：overblow the issue / the problem / the danger（夸大问题/危险）。","在音乐语境里，“overblow”是很实用的术语：指吹奏时气流过强，可能导致音高偏高或出现尖锐杂音。"]}
{"word":"overblowing","summary":{"en":"Overblowing usually means exaggerating something; it can also mean producing higher notes on a wind instrument by blowing harder, or (less commonly) a storm/wind dying down after blowing strongly.","zh":"overblowing 通常指“夸大”；也可指管乐器“加大气流吹出更高音”，较少见时指风暴/大风“吹过后减弱或结束”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"exaggerating something or making it seem more important, serious, or dramatic than it really is","zh":"夸大某事；把事情说得比实际更重要／更严重／更戏剧化"},"examples":[{"en":"The media was accused of overblowing the story.","zh":"媒体被指责把这件事夸大了。"},{"en":"Try not to be anxious—your mistake is being overblown.","zh":"别太焦虑——你的错误被夸大了。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) the technique of producing a higher note on a wind instrument by blowing harder (often reaching a higher harmonic)","zh":"（音乐）在管乐器上通过加大气流来吹出更高音（常进入更高的泛音/谐波）"},"examples":[{"en":"Overblowing can help a flute player reach notes in the upper register.","zh":"加大气流（overblowing）可以帮助长笛演奏者吹到高音区的音。"},{"en":"He practiced overblowing to make the clarinet sound brighter and higher.","zh":"他练习加大气流吹奏，让单簧管听起来更明亮、更高。"}]},{"partOfSpeech":"vi.","definition":{"en":"becoming less intense or ending after blowing strongly (used especially of storms or strong winds)","zh":"（尤指风暴/大风）强烈吹过后减弱或结束；风势变小、过去"},"examples":[{"en":"The worst of the storm is overblowing now.","zh":"风暴最严重的部分现在正在过去。"},{"en":"We waited indoors until the wind finished overblowing.","zh":"我们在室内等到大风吹过。"}]}],"synonyms":["exaggeration","overstatement","inflation","hyperbole","making a big deal out of (something)"],"phonetic":"/ˌoʊvɚˈbloʊɪŋ/","extraExplanation":["“overblow”在日常英语里最常见的意思是“夸大”。名词形式“overblowing”常指“夸大这件事/这种做法”。","音乐语境里的“overblowing”是比较专门的说法：在长笛、单簧管等管乐器上，通过更强气流让音高跳到更高的音区（常与“泛音/谐波”有关）。","表示“风暴吹过去”的用法在现代口语里相对少见，更常见的表达是“blow over”（如：The storm will blow over. 风暴会过去的）。"]}
{"word":"overblown","summary":{"en":"Overblown means exaggerated—bigger, more serious, or more dramatic than it really is; it can also describe overly grand or showy style.","zh":"overblown 指“夸大、言过其实”，也可形容风格“过于华丽浮夸”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too large, too important, or too emotional in a way that feels exaggerated or not realistic.","zh":"夸大的；言过其实的；（情绪或说法）过火的、不真实的。"},"examples":[{"en":"The article’s claims about the new product were overblown.","zh":"那篇文章对新产品的说法被夸大了。"},{"en":"People worried about an overblown threat that wasn’t actually likely.","zh":"人们担心一个被夸大的威胁，但它其实并不太可能发生。"},{"en":"His reaction felt overblown for such a small mistake.","zh":"对这么小的错误，他的反应显得过火了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to look too grand or decorated; overly fancy or showy in style.","zh":"（风格）过于华丽的；堆砌的；浮夸的。"},"examples":[{"en":"The speech was full of overblown language and empty promises.","zh":"这篇演讲充满了浮夸的辞藻和空洞的承诺。"},{"en":"Some critics called the movie’s visuals overblown.","zh":"一些评论家认为这部电影的视觉效果过于夸张浮华。"}]}],"synonyms":["exaggerated","overstated","inflated","hyperbolic","overdramatic"],"phonetic":"/ˌoʊvərˈbloʊn/","extraExplanation":["overblown 字面意思是“被吹得过头”。它常用来评价某种说法、担忧、宣传或反应“被夸大了”，语气通常偏负面，暗示“并没有那么严重/重要/真实”。","搭配很常见：overblown claims（夸大的说法）、overblown fears（被夸大的恐惧/担忧）、overblown rhetoric（浮夸的修辞）、overblown reaction（反应过度）。"]}
{"word":"overblows","summary":{"en":"“Overblows” means either ‘blows too strongly’ or ‘passes/blows over (like a storm or trouble).’","zh":"“overblows”可指“吹得太猛”，也可指“（风暴或麻烦）过去/平息”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of wind, a person, or a machine) to blow too strongly; to blow beyond what is needed or safe.","zh":"（风、人或机器）吹得太猛；过度吹、超出需要或安全范围。"},"examples":[{"en":"The fan overblows and makes the papers fly off the desk.","zh":"风扇吹得太猛，把桌上的纸都吹飞了。"},{"en":"If the bellows overblows, the fire can get out of control.","zh":"如果风箱吹得过猛，火势可能会失控。"}]},{"partOfSpeech":"v.","definition":{"en":"(especially of a storm or a period of trouble) to pass; to blow over and come to an end.","zh":"（尤指暴风雨或一段麻烦时期）过去；平息、结束。"},"examples":[{"en":"The storm overblows by morning, and the roads reopen.","zh":"暴风雨到早晨就过去了，道路重新开放。"},{"en":"Don’t panic—this problem will overblow soon.","zh":"别慌——这个问题很快会过去。"}]}],"synonyms":["blows too hard","overinflate (context-dependent)","blow over","pass","subside"],"phonetic":"/ˌoʊvərˈbloʊz/","extraExplanation":["“overblows”是动词“overblow”的第三人称单数形式（he/she/it overblows）。","在现代英语里，“（风暴/麻烦）过去”的意思有时带点文学或较正式的感觉；日常口语更常用“blow over”。"]}
{"word":"overboard","summary":{"en":"Overboard means into the water from a boat, or (figuratively) too extreme/excessive.","zh":"overboard 指“从船上落入水中”，也可引申为“过分、过头”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"from a boat or ship into the water (often used after the verbs “fall,” “jump,” or “throw”).","zh":"从船上落入/被扔入水中（常与 fall/jump/throw 连用）。"},"examples":[{"en":"One passenger fell overboard during the storm.","zh":"暴风雨中，一名乘客从船上落水了。"},{"en":"They threw the broken chair overboard to save space.","zh":"他们把坏椅子扔下船，以节省空间。"}]},{"partOfSpeech":"adj.","definition":{"en":"too extreme; doing more than is reasonable or necessary (often used with “go”).","zh":"过分的；做得太过头（常与 go 连用）。"},"examples":[{"en":"Don’t go overboard with the decorations.","zh":"装饰别搞得太夸张。"},{"en":"He went overboard trying to impress his new boss.","zh":"他为了给新老板留下好印象，做得有点过头了。"}]}],"synonyms":["over the side","excessive","extreme","too much"],"phonetic":"ˈoʊvɚˌbɔrd","extraExplanation":["“Overboard”原本是航海用语：board 指船舷/甲板边缘，overboard 就是“越过船舷到船外”。后来引申为比喻义：做事“越过合理界限”，也就是“过头、失控”。常见搭配是 go overboard (with/on sth)。"]}
{"word":"overboast","summary":{"en":"Overboast means to boast excessively or brag too much.","zh":"overboast 指过度吹嘘、夸得太过。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to boast too much; to brag in an excessive way (often making yourself look foolish or annoying)","zh":"过度吹嘘；夸夸其谈（常让人觉得讨厌或显得不稳重）"},"examples":[{"en":"He tends to overboast about his achievements, so people stop taking him seriously.","zh":"他总是过度吹嘘自己的成就，所以别人渐渐不把他当回事了。"},{"en":"Don’t overboast—let your work speak for itself.","zh":"别过度吹嘘——让你的成果自己说话。"}]},{"partOfSpeech":"vt.","definition":{"en":"to boast too much about something specific","zh":"对某件事夸得过头"},"examples":[{"en":"She overboasted her experience and struggled during the interview.","zh":"她把自己的经验夸得过头，结果面试时表现得很吃力。"},{"en":"The company overboasted its product’s abilities, which disappointed customers.","zh":"这家公司把产品能力吹得太夸张，导致顾客失望。"}]}],"synonyms":["brag too much","boast too much","exaggerate","overstate"],"phonetic":"/ˌoʊvɚˈboʊst/","extraExplanation":["“overboast”比较少见，更常用的表达是“boast too much / brag too much / exaggerate”。写作中用“overboast”会带一点正式或文学化的味道，但在日常口语里用“brag”更自然。"]}
{"word":"overboastful","summary":{"en":"Overboastful means excessively boastful—bragging more than is appropriate.","zh":"overboastful 指“过分自夸、吹嘘过头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too proud and talkative about your own achievements or abilities; bragging more than is appropriate.","zh":"过分自夸的；夸耀得不合适的。"},"examples":[{"en":"His speech sounded overboastful, so some listeners didn’t take him seriously.","zh":"他的演讲听起来过分自夸，所以有些听众没有认真对待。"},{"en":"Try not to be overboastful in an interview—show confidence with facts instead.","zh":"面试时尽量别过分自夸——用事实来展示自信会更好。"}]}],"synonyms":["overconfident","braggy","boastful","self-aggrandizing"],"phonetic":"/ˌoʊvərˈboʊstfəl/","extraExplanation":["“over-”这个前缀常表示“过度、超过适当程度”，所以 overboastful 就是“boastful（爱吹嘘的）”的加强版，含有更强的负面评价。","这个词在日常英语里不算常见，更常用的表达是 “too boastful” 或 “braggy”。写作中用 overboastful 会显得更书面、更强调“过头了”。"]}
{"word":"overboastfully","summary":{"en":"“Overboastfully” means speaking or acting with excessive bragging.","zh":"“overboastfully”指“过分自夸、夸耀过度”的样子。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively boastful way; with too much bragging or self-praise.","zh":"以过分自夸的方式；夸耀过度、自我吹嘘得太多。"},"examples":[{"en":"He spoke overboastfully about his achievements, which made others uncomfortable.","zh":"他过分自夸自己的成就，让别人感到不舒服。"},{"en":"The advertisement overboastfully promised results that were impossible to guarantee.","zh":"这则广告夸耀过度，承诺了无法保证的效果。"}]}],"synonyms":["boastfully","braggingly","conceitedly","arrogantly","self-importantly"],"phonetic":"/ˌoʊvɚˈboʊstfəli/","extraExplanation":["构词提示：over- 表示“过度”，boast 表示“自夸”，-fully 构成副词，整体意思就是“夸得太过头”。","语气与使用场景：overboastfully 带明显的批评意味，常用来指出某人说话/宣传“太自大、太夸张”。日常口语里更常用 overly boastful / bragging too much 来表达类似意思。"]}
{"word":"overboastfulness","summary":{"en":"Overboastfulness means excessive bragging or boasting too much.","zh":"overboastfulness 指“过度吹嘘/过分自夸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of bragging too much; excessive boasting","zh":"过度吹嘘；夸口过头的行为或特质"},"examples":[{"en":"His constant name-dropping came across as pure overboastfulness.","zh":"他不停地提名人、拉关系的说法听起来就是纯粹的过度吹嘘。"},{"en":"A little confidence helps, but overboastfulness can make people distrust you.","zh":"适度自信有帮助，但过度吹嘘会让人不信任你。"},{"en":"The essay lost credibility because of its overboastfulness and lack of evidence.","zh":"这篇文章因为过度自夸、缺乏证据而失去了可信度。"}]}],"synonyms":["excessive boasting","bragging","boastfulness","braggadocio","showing off"],"phonetic":"/ˌoʊvɚˈboʊstfʊlnəs/","extraExplanation":["这个词由 over-（过度）+ boast（吹嘘）+ -ful（充满……的）+ -ness（名词后缀）构成，意思很直观，但在现代英语里并不常见。日常表达更常用 boastfulness（爱吹嘘）、bragging（吹牛）、braggadocio（夸张自夸的言行，稍偏文学/正式）、showing off（炫耀）。","语气/场景：overboastfulness 往往带批评意味，强调“超过了正常自信的界限”，让人觉得不真诚或不可靠。"]}
{"word":"overbodice","summary":{"en":"An outer bodice worn over another bodice or dress, mainly used when talking about historical or costume clothing.","zh":"外层胸衣/上身外搭，罩在内层胸身或裙装外，多用于历史服饰或戏服语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An outer bodice (the upper part of a dress) worn over another bodice or dress, often as a decorative layer in historical women’s clothing.","zh":"罩在另一件上衣或连衣裙胸身（上身部分）外面的外层胸衣/上身衣片，常见于历史女性服饰中，用于装饰或增加层次。"},"examples":[{"en":"In the portrait, she wears an overbodice embroidered with silver thread.","zh":"在这幅肖像里，她穿着一件用银线刺绣的外层胸衣。"},{"en":"The costume designer added an overbodice to give the dress a more formal, period look.","zh":"服装设计师加了一件外层胸衣，让这条裙子更正式、更有时代感。"}]}],"synonyms":["outer bodice","overlay bodice"],"phonetic":"/ˈoʊvɚˌbɑdɪs/","extraExplanation":["这个词多见于服装史、戏服（theatrical costume）或复古时装语境中；日常现代英语里不算常用。","bodice 指女装“上身/胸衣”部分；over- 表示“在……之上”。因此 overbodice 字面意思就是“穿在上面的胸衣/上身外层”。不同年代与地区的款式可能不同，有时是可拆卸的装饰层。"]}
{"word":"overboding","summary":{"en":"Overboding means ‘very foreboding’—having a strong sense that something bad will happen (rare in modern English).","zh":"overboding 意为“强烈的不祥预感；不祥的”（现代英语中较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Feeling that something bad is going to happen; ominous; foreboding.","zh":"（罕见）预感不祥的；让人感到会出坏事的；不祥的。"},"examples":[{"en":"She had an overboding sense that the trip would not go smoothly.","zh":"她有一种不祥的预感，觉得这趟旅行不会顺利。"},{"en":"The overboding silence before the announcement made everyone tense.","zh":"宣布前那种不祥的沉默让每个人都很紧张。"}]}],"synonyms":["foreboding","ominous","threatening","ill-omened","sinister"],"phonetic":"/ˌoʊvɚˈboʊdɪŋ/","extraExplanation":["“overboding”在现代英语里非常少见，更常用的是“foreboding”（不祥的、预示坏事的）或“ominous”（不祥的、凶兆的）。","词形上可理解为 over-（加强）+ boding（预兆、预感）；“bode”意为“预示（尤指坏事）”。在文学或较旧的文本中更可能见到。"]}
{"word":"overbody","summary":{"en":"Overbody usually refers to a vehicle’s upper body structure; outside technical contexts it’s rare and may mean an outer covering.","zh":"Overbody通常指车辆的上部车身结构；在非技术语境中较少见，也可泛指外部覆盖层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Automotive/engineering) the upper outer body structure of a vehicle (the main body shell), as opposed to the chassis or frame underneath.","zh":"（汽车/工程）车辆的上部外壳/车身结构（主要车身壳体），相对于下方的底盘或车架。"},"examples":[{"en":"The overbody was redesigned to improve aerodynamics and reduce wind noise.","zh":"车身上部外壳经过重新设计，以改善空气动力学并降低风噪。"},{"en":"Rust was found on the overbody panels, but the chassis was still solid.","zh":"车身外板发现了锈蚀，但底盘仍然很结实。"}]},{"partOfSpeech":"n.","definition":{"en":"an outer covering or layer on top of the body; an ‘outer body’ (rare, not common in everyday English).","zh":"身体外面的覆盖层；“外层身体/外部覆盖”（较少见，不是日常英语常用词）。"},"examples":[{"en":"In some sci‑fi stories, the character sheds an overbody like a shell.","zh":"在一些科幻故事里，角色会像脱壳一样脱去一层外部躯体。"}]}],"synonyms":["car body (technical)","body shell","upper body structure","outer body (general)","outer layer"],"phonetic":"/ˈoʊvərˌbɑdi/","extraExplanation":["“overbody”在日常英语里很少单独使用，更常见于技术语境（尤其汽车制造、车身结构讨论）。如果你想表达“身体外层/外表”，更自然的说法通常是“outer layer”“outer body”“shell”等。"]}
{"word":"overboil","summary":{"en":"Overboil means to boil something too long or (for liquids) to boil over and spill.","zh":"overboil 指“煮过头”，也可指（液体）“沸溢、溢出”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cook something too long by boiling, so it becomes too soft, loses flavor, or breaks apart","zh":"把……煮得过久；煮过头（导致变软、失去口感或碎烂）"},"examples":[{"en":"If you overboil pasta, it turns mushy.","zh":"如果把意大利面煮过头，它会变得软烂。"},{"en":"Try not to overboil the vegetables—steam them lightly instead.","zh":"尽量别把蔬菜煮过头——改成稍微蒸一下更好。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a liquid) to boil so strongly that it rises and spills over the edge of the pot","zh":"（液体）沸腾得太猛而溢出（从锅边溢出来）"},"examples":[{"en":"The milk started to overboil and spill onto the stove.","zh":"牛奶开始沸溢，洒到炉子上。"},{"en":"Turn down the heat before the soup overboils.","zh":"在汤溢出来之前把火调小。"}]}],"synonyms":["overcook","boil over","cook too long","let it boil over"],"phonetic":"/ˌoʊvɚˈbɔɪl/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超过适当程度”。因此 overboil 的核心意思就是“煮得太过”或“沸腾过猛而溢出”。在日常口语里，人们也常用更简单的说法：overcook（煮过头）或 boil over（沸溢）。"]}
{"word":"overbold","summary":{"en":"“Overbold” means excessively bold or daring, often suggesting rashness or impropriety.","zh":"“overbold”指“过于大胆/过分自信”，常暗示鲁莽或不得体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too bold or daring; excessively confident in a way that may seem rash or disrespectful.","zh":"过于大胆的；过分自信的（可能显得鲁莽或无礼）。"},"examples":[{"en":"It was an overbold claim, and he couldn’t provide evidence to support it.","zh":"那是个过于大胆的说法，而他拿不出证据来支持。"},{"en":"She made an overbold joke that offended some people in the room.","zh":"她开了个过分大胆的玩笑，冒犯了房间里的一些人。"},{"en":"The plan felt overbold for a small team with limited time.","zh":"对一个时间有限的小团队来说，这个计划显得太冒进了。"}]}],"synonyms":["overly bold","too bold","rash","audacious","presumptuous"],"phonetic":"/ˌoʊvɚˈboʊld/","extraExplanation":["“over-”在这里表示“过度、过分”。因此 overbold 强调“大胆过头”，常带轻微的负面评价（鲁莽、冒进、不得体）。","overbold 相对少见，较偏书面或文学语境；日常口语里更常用 “too bold / overly bold / rash / audacious”。"]}
{"word":"overboldly","summary":{"en":"Overboldly means doing or speaking too boldly, in a way that seems rash or overly confident.","zh":"overboldly 指“过于大胆地”，带有鲁莽或过分自信的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too bold, too confident, or too daring (often implying poor judgment or lack of caution).","zh":"过于大胆地；过分自信地；鲁莽地（常含“不够谨慎/判断失误”的意思）。"},"examples":[{"en":"He spoke overboldly to his boss and regretted it later.","zh":"他对老板说话过于大胆，后来很后悔。"},{"en":"The team overboldly ignored the warning signs and kept climbing.","zh":"团队鲁莽地无视警告标志，继续攀登。"},{"en":"She overboldly assumed everyone would agree with her plan.","zh":"她过分自信地以为所有人都会同意她的计划。"}]}],"synonyms":["too boldly","rashly","recklessly","overconfidently","presumptuously"],"phonetic":"/ˌoʊvɚˈboʊldli/","extraExplanation":["“over-”这个前缀常表示“过度、太……”，所以 overboldly 带有“大胆过头”的评价色彩，通常偏负面。","在现代英语里，overboldly 不算高频词；更常见的替代表达有 “too boldly / rashly / overly confidently”。在写作中用 overboldly 会显得更正式或更文学化。"]}
{"word":"overboldness","summary":{"en":"Overboldness means being too bold—excessively daring or confident in a way that can cause trouble.","zh":"Overboldness 指“过分大胆”——过度冒险或自信，可能带来麻烦或让人反感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too bold; excessive confidence or daring, often in a way that seems rude, reckless, or inappropriate","zh":"过分大胆；过度自信或鲁莽（常带有唐突、冒失或不合时宜的含义）"},"examples":[{"en":"His overboldness in the meeting offended several coworkers.","zh":"他在会议上的过分大胆冒犯了几位同事。"},{"en":"Overboldness can look like confidence, but it may hide poor judgment.","zh":"过分大胆看起来像自信，但可能掩盖了糟糕的判断。"},{"en":"The climber’s overboldness put the whole team at risk.","zh":"那位攀登者的鲁莽大胆让整个团队陷入危险。"}]}],"synonyms":["recklessness","overconfidence","audacity","rashness","imprudence"],"phonetic":"/ˌoʊvɚˈboʊldnəs/","extraExplanation":["“overboldness”由 over-（过度）+ bold（大胆）+ -ness（名词后缀）构成，强调“超过适当程度”的大胆。日常写作中更常见的表达包括 “recklessness”（鲁莽）、“overconfidence”（过度自信）或 “audacity”（放肆/胆大妄为，语气更强）。"]}
{"word":"overbook","summary":{"en":"Overbook means to sell or accept more reservations than available spaces.","zh":"Overbook 指超额预订/超卖，卖出或接受的预订超过实际可用名额。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to accept more reservations or sell more tickets than there are places available (for a flight, hotel, event, etc.)","zh":"（对航班、酒店、活动等）超额预订；超卖（票/房间/座位）"},"examples":[{"en":"The airline overbooked the flight, so a few passengers were asked to take a later one.","zh":"航空公司把这趟航班超卖了，所以有几位乘客被要求改乘下一班。"},{"en":"The hotel apologized for overbooking and paid for our first night at another hotel.","zh":"酒店为超额预订道歉，并为我们安排了另一家酒店的第一晚费用。"}]}],"synonyms":["oversell","overreserve","overcommit"],"phonetic":"ˌoʊvɚˈbʊk","extraExplanation":["“Overbook”常见于旅行与服务业场景，尤其是航空公司和酒店。商家会基于“部分客人可能临时取消/不出现（no-show）”的概率多卖一些名额，以提高入住率或上座率。","在航空语境里，被迫改签或让座的补偿常被称为“denied boarding compensation（拒载补偿）”，有时会先征求“volunteers（自愿改签的人）”。"]}
{"word":"overbooked","summary":{"en":"Overbooked means either (1) your schedule is too full, or (2) a company has taken more reservations than capacity.","zh":"overbooked 指（1）日程排得太满，或（2）机构超额预订/超售，预订量超过容量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no time left because you have too many appointments, tasks, or plans scheduled.","zh":"（日程）排得太满的；忙得没有空的。"},"examples":[{"en":"I’m overbooked this week, so can we meet next Monday instead?","zh":"我这周行程排满了，所以我们能不能改到下周一见？"},{"en":"She’s overbooked with work meetings and can’t join dinner tonight.","zh":"她被工作会议排得太满，今晚不能一起吃饭。"}]},{"partOfSpeech":"adj.","definition":{"en":"If a business (like an airline, hotel, or restaurant) is overbooked, it has accepted more reservations than it can handle.","zh":"（航空公司/酒店/餐厅等）超额预订的；接受的预订超过实际容量的。"},"examples":[{"en":"The flight is overbooked, so they’re offering vouchers to volunteers.","zh":"这趟航班超售了，所以他们给自愿改签的人提供代金券。"},{"en":"The hotel was overbooked and had to move some guests to another place.","zh":"酒店超额预订了，只好把一些客人安排到别的地方。"}]}],"synonyms":["too busy","fully booked","oversold","overcommitted"],"phonetic":"/ˌoʊvərˈbʊkt/","extraExplanation":["在旅行和服务行业里，overbooked 常和 overbook（动词）相关：公司会“超售/超订”来降低空座或空房的风险，但有时会导致乘客被拒载（bumped）或客人被改安排（relocated）。","口语里形容自己“忙到爆”也很常见：I’m overbooked. 语气比 busy 更强调“安排多到不合理、几乎挤不出时间”。"]}
{"word":"overbooking","summary":{"en":"Overbooking means accepting more reservations than there are seats/rooms, expecting some no-shows.","zh":"Overbooking 指超额预订/超卖：预订数量超过实际座位或房间，假设会有人爽约或取消。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of accepting more reservations or bookings than available places, expecting some people will cancel or not show up","zh":"（为防止退订或爽约而）超额预订；超卖（把预订人数/数量接得超过实际座位或名额）"},"examples":[{"en":"The airline admitted it was overbooking the flight, so some passengers had to take a later one.","zh":"航空公司承认这趟航班发生了超额预订，所以一些乘客不得不改乘更晚的航班。"},{"en":"Hotels sometimes use overbooking during busy seasons to reduce empty rooms caused by last-minute cancellations.","zh":"酒店在旺季有时会采用超额预订，以减少临时取消导致的空房。"}]},{"partOfSpeech":"v.","definition":{"en":"accepting too many reservations or bookings, more than the actual capacity","zh":"超额预订；超卖（动作为：接单/订位超过实际容量）"},"examples":[{"en":"They were overbooking seats for the concert to make sure it sold out.","zh":"他们为确保演唱会坐满，进行了超额预订。"},{"en":"The company stopped overbooking after repeated customer complaints.","zh":"在顾客多次投诉后，公司停止了超额预订。"}]}],"synonyms":["overreservation","overselling","overcommitment"],"phonetic":"/ˌoʊvɚˈbʊkɪŋ/","extraExplanation":["“Overbooking”常见于航空、酒店、火车/长途巴士、活动门票等场景。若真的出现人数超过容量，航空业常用“denied boarding（被拒绝登机）”“bumped（被挤下/被改签）”来描述乘客被安排改乘。","语气上它通常是中性偏负面：从经营角度是策略，但从乘客角度常与不便、补偿（compensation）联系在一起。"]}
{"word":"overbookish","summary":{"en":"Overly academic or book-focused in a way that feels unnatural or impractical.","zh":"过于学院派、书本化，显得不自然或不切实际。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too academic or focused on books and theory; sounding like someone who reads a lot but may seem unnatural or impractical in real life.","zh":"过于学院派或书本化的；说话/写作像“读书人”，但可能显得不自然或不切实际。"},"examples":[{"en":"Your essay is clear, but some sentences feel overbookish—try simpler words.","zh":"你的文章很清楚，但有些句子显得过于书本化——试着用更简单的词。"},{"en":"He gave an overbookish explanation that didn’t help the new employees.","zh":"他的解释太学院派了，对新员工并没有帮助。"},{"en":"Her overbookish manner made casual conversation a little awkward.","zh":"她过于“书生气”的方式让随意聊天有点尴尬。"}]}],"synonyms":["too academic","pedantic","overly formal","high-flown","scholarly (sometimes)"],"phonetic":"/ˌoʊvərˈbʊkɪʃ/","extraExplanation":["“over-”表示“过度、太……”，“-ish”表示“有点……的/带点……风格的”。所以 overbookish 常带有轻微批评语气：不是单纯“爱读书”（bookish），而是“过头了”，在口语、写作或行为上显得不自然或脱离实际。","语感对比：bookish（书卷气/爱读书，偏中性或褒义）→ overbookish（过于书本化，偏贬义）。"]}
{"word":"overbookishly","summary":{"en":"“Overbookishly” means doing or speaking in an overly bookish, academic, or pedantic way.","zh":"“overbookishly”表示以过分书面、学院派或迂腐的方式表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively bookish, academic, or overly “literary” way (often sounding pedantic or unnatural in everyday conversation).","zh":"以过分书呆子气、过度学院派或过于“书面/文绉绉”的方式（常带有迂腐、不自然的口吻）。"},"examples":[{"en":"He spoke overbookishly, dropping rare words that made the meeting harder to follow.","zh":"他说话很“过分书面”，老是抛出冷僻词，让会议更难听懂。"},{"en":"Her overbookishly formal email sounded strange to her coworkers.","zh":"她那封过分正式、文绉绉的邮件让同事觉得有点怪。"}]}],"synonyms":["pedantically","academically","formally","stiltedly"],"phonetic":"/ˌoʊvɚˈbʊkɪʃli/","extraExplanation":["“overbookishly”比较少见，属于带有幽默或批评意味的造词：over-（过度）+ bookish（书卷气/书呆子气）+ -ly（副词）。常用来评价说话、写作或表达方式“太像书本/论文”，不够自然口语。更常见的替代表达有：too bookishly, in an overly academic way, pedantically。"]}
{"word":"overbookishness","summary":{"en":"Overbookishness means being excessively bookish or overly focused on theory and books rather than real-world practice.","zh":"Overbookishness 指“过度书卷气”，即过分偏重书本与理论、缺少现实与实践感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too bookish; an excessive focus on academic, literary, or theoretical knowledge rather than practical experience","zh":"过度书卷气；过分偏重学术/书本/理论知识而忽视实际经验的特质"},"examples":[{"en":"Some readers enjoyed the essay, but others felt its overbookishness made it hard to relate to everyday life.","zh":"有些读者喜欢这篇文章，但也有人觉得它过于书卷气，难以与日常生活产生共鸣。"},{"en":"Her advice was intelligent, yet its overbookishness ignored what people actually do under pressure.","zh":"她的建议很聪明，但过度书卷气忽略了人们在压力下真实会怎么做。"}]}],"synonyms":["excessive bookishness","over-intellectualism","pedantry","academicism"],"phonetic":"/ˌoʊvɚˈbʊkɪʃnəs/","extraExplanation":["“over-”表示“过度/过分”，加在“bookishness（书卷气、偏学院派的气质）”前面，强调程度太高，常带轻微批评意味。","语气与使用场景：通常用来评价写作风格、观点、谈吐或思维方式，暗示“太理论、太像书里学来的”，不够接地气。"]}
{"word":"overbooks","summary":{"en":"Overbook means accepting more reservations than capacity (or packing a schedule too full).","zh":"overbook 指超额预订（超过容量的预订），也可指把日程安排得过满。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to sell or accept more reservations/bookings than there are available seats, rooms, or spots (often expecting some people won’t show up)","zh":"（为防止爽约而）超额预订；卖出/接受超过实际容量的预订（如机票、房间等）"},"examples":[{"en":"The airline overbooked the flight, so some passengers had to take a later one.","zh":"航空公司把这趟航班超额预订了，所以一些乘客不得不改乘更晚的航班。"},{"en":"Hotels sometimes overbook during busy seasons.","zh":"酒店在旺季有时也会超额预订。"},{"en":"We were overbooked on Friday night, so we couldn’t accept any more reservations.","zh":"我们周五晚上已经超额预订了，所以不能再接更多预订。"}]},{"partOfSpeech":"vt.","definition":{"en":"to schedule yourself or someone for too many activities in the same time period","zh":"（把自己/他人）安排得过满；超量安排日程"},"examples":[{"en":"I overbooked myself this week and barely have time to eat lunch.","zh":"我这周把自己安排得太满了，连午饭都快没时间吃。"},{"en":"Don’t overbook the team—people need breaks.","zh":"别把团队的日程排得过满——大家需要休息。"}]}],"synonyms":["oversell","overreserve","double-book","overcommit"],"phonetic":"/ˌoʊvɚˈbʊk/","extraExplanation":["在旅行语境里，overbook 很常见：航空公司可能根据“爽约率（no-show rate）”来超售机位。如果因此无法让所有乘客登机，通常会先征求“自愿改签（volunteer to take a later flight）”，并提供补偿；若仍不够，可能出现“被拒绝登机（denied boarding / bumped）”。不同国家/地区对补偿规则不同。"]}
{"word":"overbooming","summary":{"en":"Overbooming means “too booming”—either excessively loud/resonant sound or overly rapid, possibly unhealthy growth.","zh":"overbooming 表示“过于 booming”：要么形容声音过分洪亮/轰鸣，要么形容增长过快、可能不健康的繁荣。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too loud, deep, or resonant in a way that feels excessive or unnatural (usually describing a voice or sound).","zh":"（声音或嗓音）过于洪亮、低沉或有回响，以至于显得夸张或不自然。"},"examples":[{"en":"His microphone made his voice sound overbooming and hard to understand.","zh":"麦克风把他的声音弄得过于洪亮，反而听不清。"},{"en":"The theater’s speakers were overbooming during the opening scene.","zh":"开场那一幕时，剧院的音响声音过于轰鸣。"}]},{"partOfSpeech":"adj.","definition":{"en":"Growing or expanding too rapidly and strongly (often about business, markets, or popularity), with a sense that it may be unhealthy or unsustainable.","zh":"（商业、市场或人气）过度繁荣、增长过快，带有不健康或难以持续的意味。"},"examples":[{"en":"Some analysts warned that the housing market was overbooming and could cool down suddenly.","zh":"一些分析人士警告说房地产市场过度繁荣，可能会突然降温。"},{"en":"The city worried about overbooming tourism putting pressure on local life.","zh":"这座城市担心旅游业过度火爆会给本地生活带来压力。"}]}],"synonyms":["overly booming","too booming","boomy","overblown","overheated"],"phonetic":"/ˌoʊvɚˈbuːmɪŋ/","extraExplanation":["“Overbooming”不是特别常见的标准词，更常见的表达是“overly booming / too booming / booming too much”，在经济语境里也常用“overheated（过热）”“unsustainable（不可持续）”。在声音语境里也常用“boomy（低频过重、嗡嗡作响）”“overblown（夸张的）”。","它通常是由“over-（过度）+ booming（繁荣的/轰鸣的）”构成的描述性用法，常见于评论、批评或技术/媒体评价（例如音响效果）。"]}
{"word":"overboot","summary":{"en":"Overboot usually means a protective boot cover worn over shoes/boots; less commonly, it can be used as a verb meaning to put such covers on.","zh":"overboot 通常指套在鞋/靴外面的防护外靴（靴套）；较少情况下也可作动词，表示给鞋子套上外靴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protective boot or boot-like cover worn over shoes/boots to keep out water, snow, mud, or chemicals; an overshoe.","zh":"（穿在鞋/靴外面的）防护外靴、靴套；用于防水、防雪、防泥或防化学品的外层鞋套。"},"examples":[{"en":"Workers put on rubber overboots before entering the wet area.","zh":"工人进入潮湿区域前会穿上橡胶外靴。"},{"en":"In heavy snow, overboots can keep your regular shoes dry.","zh":"大雪天穿外靴能让你的普通鞋子保持干燥。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover or protect (shoes/boots/feet) by putting overboots on.","zh":"给（鞋/靴/脚）套上外靴；用外靴进行保护。"},"examples":[{"en":"They overbooted their shoes before walking through the muddy field.","zh":"他们走进泥地前给鞋子套上了外靴。"}]}],"synonyms":["overshoe","galosh","boot cover","shoe cover"],"phonetic":"/ˈoʊvɚˌbut/","extraExplanation":["“overboot”在日常英语中不算常见，更常见的说法是“overshoe”“galosh”或“boot cover”。在工业/实验室安全语境里也会用“protective overboots”。","如果你是在电脑语境里看到“overboot”，它可能是特定产品/项目的术语或拼写变体；一般英语里更常见的是“reboot”（重启）或“boot”（启动）。"]}
{"word":"overbore","summary":{"en":"Overbore means to enlarge a barrel, cylinder, or hole beyond its original or intended diameter.","zh":"overbore 指把枪管、汽缸或孔的内径加工扩大到原本或设计尺寸以上。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to enlarge the diameter of a gun barrel or an engine cylinder beyond its original standard size (usually by machining)","zh":"（通过机械加工）把枪管口径或发动机汽缸内径扩大到原本标准尺寸以上"},"examples":[{"en":"The gunsmith overbored the shotgun to improve its pattern with certain loads.","zh":"枪匠把这把霰弹枪的口径加大，以便它在某些弹药下的散布更理想。"},{"en":"After years of wear, the mechanic overbored the engine cylinders and fitted larger pistons.","zh":"多年磨损后，修理师把发动机汽缸扩缸，并装上更大的活塞。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use a tool (such as a drill or boring bar) to make an existing hole larger than its intended size","zh":"（用钻头或镗刀等）把已有孔加工得比原设计更大"},"examples":[{"en":"Be careful not to overbore the hole, or the bolt will be loose.","zh":"小心别把孔镗大了，不然螺栓会松动。"}]}],"synonyms":["bore out","enlarge","ream out","oversize"],"phonetic":"/ˌoʊvɚˈbɔr/","extraExplanation":["在枪械语境里，overbore 常见于霰弹枪：指“加大口径/加大膛径”（如 12 gauge 的某些枪管会做成更大的膛径）。厂商或枪匠可能为了减小后坐、改善散布或配合特定弹药而这样做。","在发动机语境里，overbore 常译“扩缸/镗缸”，常发生在大修时：把汽缸镗大后需要匹配“加大活塞（oversize pistons）”。日常对话里不常用，多见于技术文章、维修手册、论坛等。"]}
{"word":"overborn","summary":{"en":"Overborn is a rare literary word meaning “overwhelmed or overpowered.”","zh":"overborn 是较少见的文学用词，意思是“被压倒/被征服”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Overwhelmed, defeated, or brought under control by a stronger force (feelings, people, circumstances).","zh":"（文学用语）被压倒的；被征服的；被更强的力量（情绪、他人或环境）制服的。"},"examples":[{"en":"He was overborn by grief and could not speak.","zh":"他被悲伤压倒，一句话也说不出来。"},{"en":"The small army was overborn by the enemy’s numbers.","zh":"这支小部队被敌军的人数优势所压制。"},{"en":"She stayed calm, refusing to be overborn by fear.","zh":"她保持冷静，拒绝被恐惧击垮。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of an older verb sense related to “overbear”: to overpower or overcome.","zh":"（旧用法）与 overbear 同源的过去分词：压倒；战胜；克服。"},"examples":[{"en":"Their resistance was soon overborn.","zh":"他们的抵抗很快就被压制了。"},{"en":"He felt his resolve overborn by doubt.","zh":"他感到自己的决心被怀疑压了下去。"}]}],"synonyms":["overwhelmed","overpowered","overcome","subdued","defeated"],"phonetic":"/ˌoʊvərˈbɔrn/","extraExplanation":["“overborn”在现代英语中很少见，更多出现在较古典或文学化的语境里，意思接近“overcome/overpowered”。","它和动词“overbear”（压倒、制服）关系很近，可把它理解为“被某种更强力量压过去”。","读到文学作品中它常用于抽象事物：grief（悲伤）、fear（恐惧）、passion（激情）、numbers（人数优势）等。"]}
{"word":"overborne","summary":{"en":"Overborne means “overwhelmed or overpowered,” and it is the past participle of overbear.","zh":"overborne 意为“被压倒、被压垮、被制服”，是 overbear 的过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past participle of **overbear**: to overwhelm, overpower, or defeat (someone or something) by greater force, numbers, emotion, or authority.","zh":"**overbear** 的过去分词：以更强的力量、人数、情绪或权威压倒、制服或击败（某人/某事）。"},"examples":[{"en":"She was **overborne** by grief after the funeral.","zh":"葬礼后她被悲伤**压垮**了。"},{"en":"The smaller team was quickly **overborne** by the opponent’s numbers.","zh":"人数较少的队伍很快就被对手的人数优势**压制**了。"},{"en":"His objections were **overborne** in the meeting by louder voices.","zh":"在会议上，他的反对意见被更强势的声音**压了下去**。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Used like an adjective: overwhelmed or dominated.","zh":"（较少见）作形容词用：被压倒的、被支配的。"},"examples":[{"en":"An **overborne** speaker struggled to finish her point.","zh":"一位被压制的发言者努力把观点说完。"},{"en":"He looked **overborne** by responsibility.","zh":"他看起来被责任压得喘不过气。"}]}],"synonyms":["overwhelmed","overpowered","subdued","crushed","dominated"],"phonetic":"ˌoʊvɚˈbɔrn","extraExplanation":["“overborne”来自动词“overbear”（over- + bear）。bear 原意是“承受、 تحمل（carry/endure）”，所以 overbear 有“用更大的力量让对方承受不住”的感觉。","在现代英语里更常见的是 overbear / overborne 这组搭配表达“情绪或压力把人压垮”（例如 overborne by grief）。日常口语里也常用 overwhelmed 来替代。"]}
{"word":"overborrow","summary":{"en":"Overborrow means to borrow too much, especially more than you can afford to repay or more than a limit allows.","zh":"overborrow 指“过度借款”，尤其是借得超过自身偿还能力或超过规定额度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to borrow more money than you can reasonably repay; to take on too much debt","zh":"过度借款；借超出自己偿还能力的钱"},"examples":[{"en":"Many households overborrow when interest rates are low and then struggle when payments rise.","zh":"利率低时，许多家庭会过度借款；一旦还款金额上升就会吃不消。"},{"en":"If you overborrow, you may damage your credit and limit future options.","zh":"如果你过度借款，可能会损害信用并限制未来的选择。"}]},{"partOfSpeech":"v.","definition":{"en":"(finance/banking) to borrow more than a limit, guideline, or policy allows","zh":"（金融/银行）借款超过额度、规定或政策限制"},"examples":[{"en":"The company was found to have overborrowed against its assets.","zh":"该公司被发现以资产作抵押借款超额。"},{"en":"Some lenders charge fees if you overborrow from a credit line.","zh":"有些放贷机构会在你从信用额度中超借时收取费用。"}]}],"synonyms":["borrow too much","take on too much debt","overextend (oneself)","overleverage"],"phonetic":"/ˌoʊvərˈbɑroʊ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”（如 overeat 吃太多、overwork 过劳）。因此 overborrow 通常强调“借太多”带来的风险。","在日常表达中，也常用 borrow too much / take on too much debt 来替代；在财经报道或政策讨论中，overborrow 更常见。"]}
{"word":"overborrowed","summary":{"en":"Overborrowed means having borrowed too much money and being under heavy debt or financial strain.","zh":"overborrowed 指借款过多、负债过重，因而承受较大的财务压力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having borrowed too much money, especially beyond what is safe or affordable; heavily in debt.","zh":"借款过多的；负债过重的（尤其指超过安全或可负担的程度）。"},"examples":[{"en":"Some homeowners became overborrowed during the housing boom and struggled when rates rose.","zh":"一些房主在房市繁荣期借贷过多，利率上升后就陷入困境。"},{"en":"The company was overborrowed, so it couldn’t get new loans to expand.","zh":"这家公司借债过多，因此无法再获得新贷款来扩张。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to describe an economy, sector, or financial system where borrowing is excessive compared with income or value (often seen in news and finance writing).","zh":"（用于经济/行业/金融体系）过度借贷的；借贷规模相对收入或资产价值过高的（常见于财经语境）。"},"examples":[{"en":"Analysts warned that an overborrowed economy is more vulnerable to a downturn.","zh":"分析师警告说，过度借贷的经济体更容易在衰退时受冲击。"},{"en":"Banks tightened lending rules to reduce risk in an overborrowed market.","zh":"银行收紧放贷规则，以降低在过度借贷市场中的风险。"}]}],"synonyms":["overleveraged","heavily indebted","deep in debt","debt-laden","highly leveraged"],"phonetic":"/ˌoʊvɚˈbɑroʊd/","extraExplanation":["“overborrowed”= over-（过度）+ borrowed（已借的）。常用来强调“杠杆过高/债务压力过大”，语气偏警示，常见于新闻、报告、财经评论中。","近义概念可联想：overleveraged（杠杆过高，更偏金融术语）、heavily indebted（负债累累，更通用）。反义方向可用: low-debt / debt-free（低负债/无债）。"]}
{"word":"overborrowing","summary":{"en":"Overborrowing means borrowing too much, especially in a way that creates financial risk.","zh":"Overborrowing 指借钱过多，尤其是会带来财务风险的过度借贷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of borrowing too much money, often causing financial risk or debt problems","zh":"过度借贷；借钱过多（常导致财务风险或债务问题）"},"examples":[{"en":"Overborrowing can make it hard to pay bills when interest rates rise.","zh":"过度借贷会让人在利率上升时更难支付账单。"},{"en":"The company’s overborrowing led to cash-flow problems and layoffs.","zh":"这家公司因过度借贷而出现现金流问题并裁员。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) taking or using more resources than is sustainable, by relying on borrowing","zh":"（更广义）依赖借用而过度占用资源，超过可持续水平"},"examples":[{"en":"Some critics say the project is overborrowing from the future by delaying costs.","zh":"一些批评者认为这个项目是在向未来“过度借用”，把成本推迟到以后。"}]}],"synonyms":["excessive borrowing","overindebtedness","overleveraging"],"phonetic":"/ˌoʊvɚˈbɑroʊɪŋ/","extraExplanation":["“overborrowing”常见于财经与公共政策语境，强调“借得太多”带来的风险，例如债务负担、违约风险、信用评分下降等。","可与“overleveraging（过度加杠杆）”类比：两者都指风险被债务放大，但“overborrowing”更直观地强调“借款数量/频率过多”。","常见搭配：avoid overborrowing（避免过度借贷），overborrowing by households/companies（家庭/企业过度借贷），the dangers/risks of overborrowing（过度借贷的危险/风险）。"]}
{"word":"overborrows","summary":{"en":"“Overborrows” means “borrows too much,” usually money (creating repayment risk) or sometimes too many items.","zh":"“Overborrows”表示“借得过多”，通常指借钱过度（带来还款风险），也可指借物品借太多。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to borrow too much (especially money), so that it becomes difficult to repay or manage","zh":"（尤指借钱）借得过多，以至于难以偿还或难以管理"},"examples":[{"en":"He overborrows and ends up paying high interest every month.","zh":"他借钱过多，结果每个月都要付很高的利息。"},{"en":"If a company overborrows, it may struggle during an economic slowdown.","zh":"如果一家公司借贷过度，在经济放缓时可能会陷入困境。"}]},{"partOfSpeech":"v.","definition":{"en":"to borrow more items than you need or can reasonably handle","zh":"借（物品）过多，超过需要或自己能合理处理的范围"},"examples":[{"en":"She overborrows books from the library and can’t finish them on time.","zh":"她从图书馆借书借太多，结果无法按时看完归还。"},{"en":"Don’t overborrow tools—take only what you’ll use this weekend.","zh":"别把工具借太多——这周末用得上的再借。"}]}],"synonyms":["borrow too much","take on too much debt","overextend (financially)","overdraw (in some contexts)"],"phonetic":"/ˌoʊvərˈbɑroʊz/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”（如: overeat 吃太多, overwork 过度工作）。因此 overborrow = borrow（借）+ over-（过度）。","在金融语境里，overborrow 常和 debt（债务）、interest（利息）、repay（偿还）、credit card（信用卡）等搭配使用，强调“借贷过度带来的压力或风险”。"]}
{"word":"overbought","summary":{"en":"Overbought usually means a market/asset has been bought too heavily and may be priced too high (possible pullback). It can also mean simply ‘bought too much.’","zh":"Overbought 通常指（市场/资产）被过度买入、价格可能偏高（可能回调）；也可指日常意义上的“买太多”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(finance) Bought so heavily that the price may be too high and could fall soon.","zh":"（金融）买盘过度、买得太多，导致价格可能被推得过高，短期内可能回落。"},"examples":[{"en":"After a week of nonstop gains, the stock looked overbought.","zh":"连续上涨了一周后，这只股票看起来处于超买状态。"},{"en":"Some traders sold because they thought the market was overbought.","zh":"一些交易者卖出，因为他们认为市场已经超买。"}]},{"partOfSpeech":"adj.","definition":{"en":"Bought more of something than you really need.","zh":"买得过多；买超出实际需要。"},"examples":[{"en":"I overbought snacks for the trip and couldn’t finish them.","zh":"我为旅行零食买太多了，最后吃不完。"}]}],"synonyms":["overvalued","overextended","too expensive","bought too much"],"phonetic":"/ˌoʊvɚˈbɔt/","extraExplanation":["在技术分析里，“overbought（超买）”常用来形容价格短期涨得太快，可能出现回调或盘整。很多人会结合RSI（相对强弱指数）来判断：例如RSI高于70常被称为“超买”，但这不是必然会跌的信号，更像是“风险在上升/需要更谨慎”。","“Overbought”更多用于金融语境；日常生活里表达“买太多”也可以说：I bought too much."]}
{"word":"overbound","summary":{"en":"Overbound usually means a book is bound with a cover larger than its pages, or (in technical contexts) to set an upper bound for a value.","zh":"Overbound 通常指书的封面比内页更大、向外伸出的装订方式；在技术语境中也可指为某个数值设定上界（保守高估）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Bookbinding) Bound so the cover or boards extend beyond the edges of the pages.","zh":"（装订）过包边装订的；封面（书壳）比书页边缘更大、向外伸出的。"},"examples":[{"en":"This photo album is overbound, so the cover protects the page corners.","zh":"这本相册是过包边装订的，所以封面能保护纸张的边角。"},{"en":"Libraries often choose overbound editions to make books last longer.","zh":"图书馆常选用过包边版本，让书更耐用。"}]},{"partOfSpeech":"vt.","definition":{"en":"To set an upper bound for something (to give a value that is definitely not too small).","zh":"对……给出上界；用一个肯定不小于真实值的数去“高估”界限。"},"examples":[{"en":"We overbound the error by assuming the worst case.","zh":"我们按最坏情况来估计，从而给误差设定了上界。"},{"en":"The report overbounds the cost at $2 million to stay conservative.","zh":"报告采用保守估计，把成本上界定为200万美元。"}]}],"synonyms":["(adj.) over-edge bound","(vt.) upper-bound","cap","bound above"],"phonetic":"/ˌoʊvərˈbaʊnd/","extraExplanation":["“overbound”在日常英语里不算常见，最常见的使用场景之一是装订领域，描述封面“盖过”内页边缘，以增加保护性。","在工程、数学与计算机领域里，overbound 常与 underbound（下界）并用：overbound 强调“宁可高估也不低估”的保守界限，用来做安全裕度或风险控制。"]}
{"word":"overbounteous","summary":{"en":"“Overbounteous” means excessively generous or overly abundant, often with a literary or slightly critical tone.","zh":"“Overbounteous”指“过于慷慨”或“过于丰盛”，常带文学或轻微批评语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More than bounteous; excessively generous or abundant (often used in a slightly critical or literary tone).","zh":"过于慷慨的；过于丰富的（常带一点批评或文学色彩）。"},"examples":[{"en":"The charity was grateful, but the donor’s overbounteous promises were hard to fulfill.","zh":"慈善机构很感激，但捐赠者过于慷慨的承诺很难兑现。"},{"en":"An overbounteous buffet can feel wasteful if too much food is thrown away.","zh":"过于丰盛的自助餐如果造成大量浪费，会让人觉得不太妥当。"},{"en":"Her overbounteous praise embarrassed him in front of the team.","zh":"她过于夸张的夸奖让他在团队面前很尴尬。"}]}],"synonyms":["overly generous","too generous","lavish","profuse","superabundant","overabundant"],"phonetic":"/ˌoʊvɚˈbaʊntiəs/","extraExplanation":["“Overbounteous”带有较强的书面/文学感，日常口语中更常用“overly generous”“too generous”“excessive/abundant”。","词根提示：over-（过度）+ bounteous（慷慨的；丰富的）。在描写“多到不合适”时，常含轻微负面评价。"]}
{"word":"overbounteously","summary":{"en":"“Overbounteously” means doing something with excessive generosity or abundance.","zh":"“overbounteously”表示“过分慷慨地/过度丰盛地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively generous or abundant way; more than is needed or appropriate.","zh":"过分慷慨地；过度丰盛地（多到超过需要或合适的程度）。"},"examples":[{"en":"The host fed us overbounteously, so we could barely move after dinner.","zh":"主人招待得过分丰盛，我们晚饭后几乎动不了。"},{"en":"She praised the team overbounteously, which made some people feel the compliment wasn’t fully sincere.","zh":"她对团队的夸奖过于热烈，反而让一些人觉得不太真诚。"}]}],"synonyms":["too generously","overly generously","lavishly","excessively","more than enough"],"phonetic":"/ˌoʊvɚˈbaʊntiəsli/","extraExplanation":["这个词非常少见，多用于带点文学/修辞色彩的写作。日常英语里更常用：too generously / overly generous(ly) / more than enough / lavishly。","构词上是 over-（“过度”）+ bounteous（“慷慨的；丰富的”）+ -ly（副词）。理解了前缀 over-，很多词都能举一反三：overconfident（过度自信）、overreact（反应过度）、overdo（做过头）。"]}
{"word":"overbounteousness","summary":{"en":"Overbounteousness means excessive abundance or generosity—so much that it feels like “too much.”","zh":"overbounteousness 指“过度的丰盛或慷慨”，多到让人觉得“太多了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being overly bountiful; excessive generosity or an overly abundant amount","zh":"过分慷慨；过度丰盛（指给予或数量多到“太多”的程度）"},"examples":[{"en":"The festival’s overbounteousness left the volunteers exhausted from serving so much food.","zh":"节庆的过度丰盛让志愿者疲于应付，因为要分发的食物太多了。"},{"en":"Her overbounteousness was kind, but it sometimes made others feel uncomfortable accepting so much.","zh":"她的过分慷慨出于好意，但有时会让别人不自在，觉得不好意思收下那么多。"}]}],"synonyms":["overabundance","excess","excessive generosity","profusion","superfluity"],"phonetic":"/ˌoʊvɚˈbaʊntiəsnəs/","extraExplanation":["这是一个非常少见、偏书面/文学色彩的名词，常用来带一点评价意味：不仅是“很多/很慷慨”，而是“多到不合适、显得过头”。","构词上可以拆成 over-（过度）+ bounteous（丰盛的/慷慨的）+ -ness（名词后缀）。日常英语更常用 excessive generosity / overabundance / too much。"]}
{"word":"overbow","summary":{"en":"“Overbow” means using the bow too heavily (or the resulting harsh sound) in string playing.","zh":"“overbow”指拉弦乐器时运弓过猛（或因此产生的刺耳、紧绷的音色）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to use a bow (especially on a string instrument) with too much pressure or for too long, producing a harsh or strained sound","zh":"（尤指拉弦乐器时）用弓过猛或过久，导致声音刺耳、紧绷"},"examples":[{"en":"The note sounded rough because the player overbowed the string.","zh":"这个音听起来很粗糙，因为演奏者拉弓过猛。"},{"en":"Try to relax your right hand so you don’t overbow during the loud passage.","zh":"试着放松右手，这样在强奏段落里就不会拉弓过猛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a tone or performance) produced with excessive bowing; harsh or strained in sound","zh":"（指音色或演奏）因运弓过度而产生的；音色刺耳、紧绷的"},"examples":[{"en":"The violin tone became overbow and lost its warmth.","zh":"小提琴的音色变得运弓过度，失去了温暖感。"},{"en":"If the sound feels overbow, reduce pressure and increase bow speed slightly.","zh":"如果声音听起来像“运弓过度”，就减轻压力并稍微加快弓速。"}]}],"synonyms":["overbowed","bow too hard","use too much bow pressure"],"phonetic":"/ˌoʊvərˈboʊ/","extraExplanation":["“overbow”不是日常高频词，更常见的说法是“overbowed”（形容音色/演奏）或说“use too much bow pressure”。在弦乐学习语境中，它通常指右手（持弓手）压力过大，造成噪音、刮弦感或音色发硬。"]}
{"word":"overbowed","summary":{"en":"Overbowed describes a sound (especially on string instruments) made harsh by too much bowing, or something that is bent too much.","zh":"overbowed 可指弦乐因用弓过猛而音色刺耳，也可指物体弯曲过度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Music) Played with too much bow pressure or bow speed, producing a harsh, forced, or scratchy sound.","zh":"（音乐）拉弓用力过猛或弓速不当，导致声音刺耳、紧绷或带“刮擦感”。"},"examples":[{"en":"The violin sounded overbowed in the loud passage, so the tone turned scratchy.","zh":"那段强奏里小提琴听起来有点过度用弓，所以音色变得刺耳。"},{"en":"Try using less weight in your right hand—the note is getting overbowed.","zh":"右手放轻一点——这个音被你拉得过度用弓了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Bent, arched, or bowed too much; excessively curved.","zh":"弯得过度的；过分拱起的。"},"examples":[{"en":"The old shelf was overbowed in the middle from years of heavy books.","zh":"那块旧书架中间被多年重书压得过度下弯了。"},{"en":"The overbowed branch finally snapped under the snow.","zh":"那根被雪压得过度弯曲的树枝最终折断了。"}]}],"synonyms":["overplayed","strained","harsh-sounding","scratchy","overbent","overcurved"],"phonetic":"/ˌoʊvɚˈboʊd/","extraExplanation":["“overbowed”在日常英语里不算常见，更常出现在弦乐教学或乐评中，用来指出“右手拉弓太重/太硬”，造成音色不够圆润（常见描述有 scratchy / harsh / forced）。改进方法通常是减少弓压、调整接触点（更靠近指板或琴码的选择）、以及让弓速与弓压更平衡。"]}
{"word":"overbowl","summary":{"en":"A cricket verb meaning to use a bowler for too many overs.","zh":"一个板球用语动词，指让投球手投球过多（用人过度）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Cricket) to make a bowler bowl too many overs, so they become tired or less effective.","zh":"（板球）让某位投球手投球过多（超出合适的轮换/负荷），导致疲劳或效果下降。"},"examples":[{"en":"The captain overbowled his fastest bowler, and he lost speed late in the match.","zh":"队长让最快的投球手投得太多，比赛后段他的球速就掉下来了。"},{"en":"They avoided overbowling the young spinner to protect his shoulder.","zh":"他们避免让年轻的旋转投球手投球过量，以保护他的肩膀。"},{"en":"If you overbowl your best bowler, you may not have him fresh for the final overs.","zh":"如果你把最强的投球手用得过度，他可能无法在最后几轮保持最佳状态。"}]}],"synonyms":["overuse","overwork","bowl too many overs"],"phonetic":"/ˌoʊvərˈboʊl/","extraExplanation":["“overbowl”主要用于英联邦国家的板球语境（如英国、印度、澳大利亚等）。它强调“用人过度”的管理问题：队长为了追求当下的压制力，让同一位投球手连续或总计投太多轮（overs），结果可能带来疲劳、受伤风险上升、控球变差等。","相关概念：over（轮）是板球计量单位之一，一轮通常由同一位投球手连续投6个有效球；比赛中需要轮换投球手来维持体能与战术效果。"]}
{"word":"overbrace","summary":{"en":"An overbrace is a brace drawn above an expression to group or label part of it.","zh":"overbrace 指写在表达式上方的括号，用于分组或标注该部分内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curved bracket written above part of an expression to show that the grouped terms belong together or to label them (common in math and LaTeX).","zh":"（数学/排版）写在表达式上方的弯括号，用来表示上方括起来的部分属于同一组，或用来给该部分加注释（常见于数学与 LaTeX）。"},"examples":[{"en":"Use an overbrace to show that these three terms form one group.","zh":"用 overbrace 表示这三项构成一组。"},{"en":"In LaTeX, you can write \\overbrace{a+b+c}^{\\text{sum}}.","zh":"在 LaTeX 里，你可以写 \\overbrace{a+b+c}^{\\text{sum}} 来表示“和”。"}]}],"synonyms":["brace","bracket","grouping symbol"],"phonetic":"/ˈoʊvərˌbreɪs/","extraExplanation":["overbrace 常与 underbrace（下括号）成对出现：overbrace 放在上方，underbrace 放在下方，用于“标注/强调某一段表达式”。","在 LaTeX 中，overbrace 常搭配上标文字来写说明：\\overbrace{...}^{...}；例如 \\overbrace{x+x+\\cdots+x}^{n\\text{ times}} 表示“n 次相加”。"]}
{"word":"overbraced","summary":{"en":"Overbraced means reinforced with too much bracing, making something overly rigid; it can also describe something overly constrained in a figurative sense.","zh":"Overbraced 指“加固过度、过于僵硬”，也可比喻“过度约束而不自然”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too strongly supported or stiffened with braces; made overly rigid by extra bracing.","zh":"（用支撑、斜撑等）加固过度的；因支撑过多而显得过于僵硬的。"},"examples":[{"en":"The roof frame was overbraced, which made it heavy and difficult to adjust on site.","zh":"屋顶框架加固过度，导致结构很重，而且在工地上难以调整。"},{"en":"Some older bridges look overbraced because they use many extra metal supports.","zh":"有些老桥看起来支撑过多，因为用了很多额外的金属支架。"},{"en":"The design feels overbraced—stable, but lacking elegance.","zh":"这个设计显得“加固过度”——很稳，但不够优雅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Overly constrained, controlled, or “tight,” so it loses natural movement or flexibility.","zh":"（比喻）过度约束的；被控制得太紧而缺乏自然灵活性的。"},"examples":[{"en":"His writing became overbraced after too many edits.","zh":"经过太多次修改后，他的文章变得过于拘谨僵硬。"},{"en":"The performance felt overbraced, as if every gesture was planned.","zh":"这场表演显得过于刻意，好像每个动作都事先安排好了。"}]}],"synonyms":["overreinforced","overrigid","overstiffened","overcontrolled","constrained"],"phonetic":"/ˌoʊvɚˈbreɪst/","extraExplanation":["“braced”常见于建筑/工程语境，指用斜撑、支撑杆（braces）来增强稳定性；“over-”表示“过度”。因此 overbraced 多用于描述结构“稳是稳了，但用料多、重量大、灵活性差”。","在写作与艺术评论里，overbraced 也可比喻“过于用力/过于控制”，从而显得不自然。"]}
{"word":"overbracing","summary":{"en":"Overbracing means adding too much support (or being too supported), and it can also refer to using an overbrace in math/typography.","zh":"Overbracing 指过度支撑/加固（或支撑过多的状态）；在数学/排版中也可指用上大括号（overbrace）进行分组。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of adding too much bracing/support, or the state of being excessively braced (so something becomes too stiff, heavy, or restricted)","zh":"（对结构或物体）过度加支撑/加固；或处于支撑过多的状态（导致过硬、过重或受限）"},"examples":[{"en":"The engineer warned that overbracing the frame could make it heavier without improving safety.","zh":"工程师警告说，框架过度加固可能只会增加重量，并不提升安全性。"},{"en":"Overbracing can reduce flexibility, which matters in designs that need to move slightly.","zh":"过度支撑会降低柔韧性，而某些需要轻微位移的设计正需要这种柔韧性。"}]},{"partOfSpeech":"adj.","definition":{"en":"excessively braced or supported","zh":"支撑/加固过度的；被过多支撑的"},"examples":[{"en":"The overbracing beams left little room for wiring and pipes.","zh":"那些加固过度的梁几乎不给走线和管道留空间。"},{"en":"The overbracing straps made the backpack uncomfortable to wear.","zh":"过度支撑的绑带让背包背起来不舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"in math/typography: using an overbrace (a curly bracket drawn above symbols) to group items; the act of adding an overbrace","zh":"（数学/排版）使用上大括号（写在符号上方的分组括号）进行分组；加上上大括号的行为"},"examples":[{"en":"In the solution, overbracing shows which terms belong together.","zh":"在解题过程中，用上大括号分组能清楚显示哪些项属于同一组。"},{"en":"The teacher used overbracing to highlight the repeated pattern.","zh":"老师用上大括号标出重复的模式。"}]}],"synonyms":["overreinforcement","excessive bracing","oversupporting","overstiffening"],"phonetic":"/ˌoʊvɚˈbreɪsɪŋ/","extraExplanation":["“overbracing”不是很常见的日常词，更常出现在工程、建筑、产品设计等语境里，强调“加固过头”带来的负面效果（例如更重、更贵、反而更不灵活）。","数学排版里常见的“overbrace”在 LaTeX 里写作 \\overbrace{...}^{...}；“overbracing”可理解为“加上 overbrace 来分组说明”。"]}
{"word":"overbrag","summary":{"en":"“Overbrag” means to brag too much, often in a way that bothers or turns off other people.","zh":"“overbrag”表示过度吹嘘、炫耀过头，常带有让人反感的意味。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to brag too much; to talk about your achievements or possessions in an excessive way that may annoy others","zh":"过度吹嘘；过分炫耀（以至于让人反感）"},"examples":[{"en":"He kept overbragging about his salary, and everyone got uncomfortable.","zh":"他一直过度吹嘘自己的薪水，让大家都很不自在。"},{"en":"Try not to overbrag in interviews—show confidence, but stay respectful.","zh":"面试时尽量别过度炫耀——自信可以，但要保持分寸。"}]},{"partOfSpeech":"vt.","definition":{"en":"to brag excessively about (something)","zh":"对（某事）过度吹嘘；把（某事）夸得过头"},"examples":[{"en":"She overbragged her connections, but it didn’t impress the team.","zh":"她过度吹嘘自己的人脉，但并没有打动团队。"}]}],"synonyms":["brag too much","boast excessively","show off","crow"],"phonetic":"/ˌoʊvɚˈbræɡ/","extraExplanation":["“overbrag”在英语里比较口语化、也不算特别常见；更常用的表达是“brag too much / brag excessively”。","如果你想表达“表面谦虚、实则炫耀”，更贴近的常用词是“humblebrag（凡尔赛式炫耀）”。"]}
{"word":"overbragged","summary":{"en":"Overbragged means “bragged too much,” often in a way that annoys others or sounds exaggerated.","zh":"overbragged 表示“吹嘘过头、过度炫耀”，常带有让人反感或夸大其词的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"bragged too much; talked about one’s achievements in an excessive or annoying way","zh":"过度吹嘘；夸大其词地炫耀自己的成就（让人反感或显得不合时宜）"},"examples":[{"en":"He overbragged about his promotion, and the room went quiet.","zh":"他对升职过度吹嘘，结果房间里一下子安静了。"},{"en":"I think I overbragged in the interview—I should have sounded more balanced.","zh":"我觉得我在面试里吹得有点过头了——我应该更客观一些。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) described something as better than it really was by bragging excessively","zh":"（非正式）通过过度炫耀把某事说得比实际更好"},"examples":[{"en":"She overbragged the project’s results, so the team had to manage expectations later.","zh":"她把项目成果夸得太厉害，后来团队不得不去控制大家的期待。"}]}],"synonyms":["boasted excessively","bragged too much","showed off","crowed","talked big"],"phonetic":"/ˌoʊvərˈbræɡd/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”。所以 overbrag = brag too much。日常写作里更常见的说法是 “brag too much / brag excessively / humblebrag（假装谦虚的炫耀）”。","“overbragged”不是特别常见的标准词形（更多见于口语或网络表达）。正式场合可以用 “boasted excessively” 或 “spoke boastfully”。"]}
{"word":"overbragging","summary":{"en":"Overbragging means bragging too much, often making you sound annoying or rude.","zh":"overbragging 指“过度吹嘘”，往往会让人觉得烦或失礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of bragging too much, in a way that sounds annoying, rude, or insecure","zh":"过度吹嘘；吹得太过头（让人觉得烦、失礼，或显得不自信）"},"examples":[{"en":"His constant overbragging about money made people uncomfortable.","zh":"他一直过度吹嘘自己有钱，让大家很不舒服。"},{"en":"There’s a difference between sharing good news and overbragging.","zh":"分享好消息和过度吹嘘是有区别的。"}]},{"partOfSpeech":"v.","definition":{"en":"bragging too much; talking about your achievements in an excessive way","zh":"过度吹嘘的；把自己的成就讲得太夸张的"},"examples":[{"en":"She apologized for overbragging and tried to be more modest.","zh":"她为自己过度吹嘘道歉，并试着更谦虚一些。"},{"en":"He came off as overbragging instead of confident.","zh":"他给人的感觉不是自信，而是过度吹嘘。"}]}],"synonyms":["excessive bragging","bragging too much","boasting","showing off","self-promotion (sometimes)","humblebrag (related)"],"phonetic":"/ˌoʊvɚˈbræɡɪŋ/","extraExplanation":["“overbragging”不是最常见的标准词条，更常见的说法是“bragging too much / excessive bragging / humblebrag（假谦虚式炫耀）”。在口语或社交媒体里，“over-”常用来表示“过度”，语气带有批评。","语用提示：英语文化中适度自我介绍是可以的，但反复强调、比较、贬低别人来抬高自己，往往会被听者解读为“overbragging”。如果你想更中性，可以说“I’m proud of it”或“I’m excited about it”，避免显得在炫耀。"]}
{"word":"overbrained","summary":{"en":"Overly intellectual or overcomplicated in thinking; prone to overthinking.","zh":"形容想法过于理智/复杂，带有“聪明过头、想太多”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too intellectual or too full of ideas; thinking in an overly complicated way (often suggesting overthinking or being impractically clever).","zh":"过于聪明/过度理智；想得太复杂（常带有“过度思考、不切实际地聪明”的语气）。"},"examples":[{"en":"The plan sounded overbrained—great on paper, but hard to do in real life.","zh":"这个计划听起来太“过度聪明”了——纸上很漂亮，但现实中很难执行。"},{"en":"I’m being overbrained about this; the simplest answer is probably right.","zh":"我在这件事上想太复杂了；最简单的答案很可能才是对的。"},{"en":"Her overbrained explanation confused everyone in the room.","zh":"她那套过于复杂的解释把房间里的人都说糊涂了。"}]}],"synonyms":["overintellectual","too cerebral","overcomplicated","overthinking","highbrow"],"phonetic":"/ˌoʊvɚˈbreɪnd/","extraExplanation":["“overbrained”不是常见的日常用词，更像是带点幽默或批评的形容：形容一个想法/解释“太绕、太学究、太爱动脑筋”。","语气通常偏负面：强调聪明用过头，反而不清楚、不实用。更常见的替换说法有“overthink(ing)”“too cerebral”“too intellectual”。"]}
{"word":"overbrake","summary":{"en":"Overbrake means to brake too hard or too much, often reducing smooth control.","zh":"overbrake 指刹车过猛或过度刹车，常影响行车平顺与控制。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to brake too hard or too much, especially in a vehicle (often causing a sudden stop, skidding, or loss of smooth control)","zh":"（开车等）刹车过猛或过度刹车，常导致突然减速、打滑或操控不平顺"},"examples":[{"en":"The car behind almost hit us because I overbraked at the yellow light.","zh":"我在黄灯时刹车太猛，后面的车差点撞上来。"},{"en":"If you overbrake on ice, you can lose control of the car.","zh":"在结冰路面上如果刹车过度，车可能会失控。"},{"en":"Try to slow down earlier so you don’t overbrake at the corner.","zh":"尽量提前减速，这样进弯时就不会刹车过猛。"}]}],"synonyms":["brake too hard","brake too much","slam on the brakes"],"phonetic":"/ˌoʊvɚˈbreɪk/","extraExplanation":["“overbrake”在日常英语中不算特别常见，但在驾驶、赛车或骑行语境里很直观，常见形式也包括“over-brake”“overbraking”。含义通常是“制动输入过大”，与更中性的“brake too hard/too much”意思相近。","在更专业的驾驶/赛车表达里，过度刹车可能导致“lock up”（车轮抱死）或“skid”（打滑）。如果车辆有ABS，可能会减少抱死风险，但仍可能因为制动过猛而不够平顺或增加追尾风险。"]}
{"word":"overbraked","summary":{"en":"“Overbraked” means you braked too hard/too long (often in driving or racing), causing instability or a slower corner entry.","zh":"“Overbraked”指刹车过猛或过久（多用于驾驶/赛车），导致车身不稳或入弯变慢。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of overbrake) to brake too hard or too long, often causing loss of control, skidding, or missing the best turning point (common in driving and motorsport).","zh":"（overbrake 的过去式/过去分词）刹车过猛或刹车过久，常导致失控、打滑，或错过最佳入弯点（多用于驾驶与赛车语境）。"},"examples":[{"en":"He overbraked into the corner and ran wide.","zh":"他入弯时刹车过猛，结果冲到外线去了。"},{"en":"I overbraked on the wet road and the car started to slide.","zh":"路面很湿，我刹车过猛，车子开始打滑。"},{"en":"The driver admitted he overbraked and lost time.","zh":"车手承认自己刹车过度，浪费了时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"(especially in racing) describing a car/driver that has braked too much, leading to a slower or unstable entry.","zh":"（尤指赛车）形容车或车手“刹过头了”，导致入弯变慢或不稳定。"},"examples":[{"en":"The car looked overbraked on entry, so it couldn’t rotate well.","zh":"这车入弯看起来刹过头了，所以转向不够顺。"},{"en":"An overbraked approach makes the corner harder to exit quickly.","zh":"刹车过度会让出弯更难加速。"}]}],"synonyms":["braked too hard","braked too much","overdid the braking","overapplied the brakes"],"phonetic":"/ˌoʊvərˈbreɪkt/","extraExplanation":["“overbrake/overbraked”在日常英语里不如“brake too hard”常见，但在F1、拉力赛、摩托GP等解说和车迷讨论中很常用。","常见搭配：overbrake into a corner（入弯刹过头）、overbrake on entry（入弯阶段刹过度）。与之相对的说法有 underbrake（刹不够）或 brake too late（刹得太晚）。"]}
{"word":"overbraking","summary":{"en":"Overbraking means braking too hard/suddenly or using the brakes more than necessary.","zh":"overbraking 指刹车过猛/过急，或不必要地刹车过度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"braking too hard or too suddenly, especially so the wheels begin to skid or the vehicle becomes unstable.","zh":"（驾驶时）刹车过猛/过急，尤其指车轮打滑或车辆变得不稳定。"},"examples":[{"en":"Overbraking on a wet road can make the car skid.","zh":"在湿滑路面上刹车过猛可能会让车打滑。"},{"en":"The instructor warned her about overbraking in corners.","zh":"教练提醒她在弯道里不要刹车过猛。"}]},{"partOfSpeech":"n.","definition":{"en":"using the brakes more than necessary (too frequently or for too long), often causing slower driving and extra wear on the brakes.","zh":"不必要地频繁或长时间踩刹车（刹车过度），常导致车速更慢并加速刹车系统磨损。"},"examples":[{"en":"Overbraking in traffic wastes momentum and wears out brake pads faster.","zh":"在车流中刹车过度会浪费惯性，并让刹车片磨损更快。"},{"en":"Try to look ahead to avoid overbraking and sudden stops.","zh":"尽量提前观察路况，避免过度刹车和急停。"}]}],"synonyms":["excessive braking","hard braking","overuse of the brakes","panic braking"],"phonetic":"ˌoʊvərˈbreɪkɪŋ","extraExplanation":["“Overbraking”常见于驾驶教学、赛车评论和交通安全语境。它既可指“刹得太猛”（导致打滑/失控风险），也可泛指“刹车用得太多”（影响平顺性与刹车寿命）。","在湿滑路面或骑摩托车时更要避免过猛制动；如果车辆配有ABS，通常应“持续用力踩住”而不是快速点刹，以减少抱死风险（具体仍以当地驾校与车辆说明为准）。"]}
{"word":"overbranch","summary":{"en":"Overbranch means (of a plant) to extend its branches too far, often overhanging or crowding nearby space.","zh":"overbranch 指（植物）枝条生长过界、伸到上方或挤占邻近空间，常见于园艺/树木修剪语境。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a tree or plant) to grow branches beyond a usual boundary, especially so they hang over a path, a wall, a roof, or another plant.","zh":"（树木或植物）枝条长得超过通常的范围，尤指伸出并遮到小路、墙面、屋顶或另一株植物上方。"},"examples":[{"en":"The old maple began to overbranch the sidewalk, so the city scheduled a trim.","zh":"那棵老枫树的枝条开始伸到人行道上方了，所以市政府安排了修剪。"},{"en":"Vines can overbranch the fence and block the gate if you don’t cut them back.","zh":"藤蔓如果不修剪，可能会长到围栏外面，甚至挡住大门。"}]},{"partOfSpeech":"vt.","definition":{"en":"To let something (such as a garden hedge or tree canopy) extend too far so that it overhangs or crowds nearby space; to cause excessive branching.","zh":"使（如树篱或树冠）生长过度、伸得太远，以致下垂遮挡或挤占附近空间；使分枝过多。"},"examples":[{"en":"If you overbranch the hedge, it will shade the flowers underneath.","zh":"如果让树篱分枝长得过多，就会把下面的花遮住阳光。"},{"en":"The gardener warned that heavy fertilizer can overbranch young trees.","zh":"园丁提醒说，施肥过多会让幼树分枝过旺。"}]}],"synonyms":["overhang","spread over","encroach","extend over","grow over"],"phonetic":"/ˌoʊvɚˈbræntʃ/","extraExplanation":["“over-”有“过度、在……之上/越过”的意思；和“branch（分枝/树枝）”组合后，多用于园艺或树木管理语境，表示枝条“伸过界/伸到上方”。","这个词在日常英语里不算常见；更常见的表达是：branches overhang…, grow over…, spread over…, encroach over/into…。"]}
{"word":"overbravado","summary":{"en":"“Overbravado” means too much bravado—exaggerated confidence or swagger, often used to cover insecurity.","zh":"“overbravado”指“过度的逞强/虚张声势”，常是为了掩饰不安或恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or exaggerated bravado; showy confidence that is often used to hide fear or insecurity.","zh":"过度逞强；夸张的虚张声势（常用来掩饰害怕或不安）。"},"examples":[{"en":"His jokes and loud voice were overbravado, masking how nervous he felt before the interview.","zh":"他开玩笑、说话很大声，其实是一种过度逞强，用来掩饰面试前的紧张。"},{"en":"The team’s overbravado backfired when they ignored basic safety rules.","zh":"团队的过度逞强适得其反，因为他们无视了基本的安全规则。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing too much bravado; overly swaggering or boastful.","zh":"表现得过于逞强的；过分自负、爱摆架子的。"},"examples":[{"en":"He sounded overbravado in meetings, but he avoided taking responsibility.","zh":"他在会议上口气很逞强，但却回避承担责任。"},{"en":"An overbravado attitude can make others feel dismissed or unsafe.","zh":"过度逞强的态度会让别人觉得不被尊重，甚至缺乏安全感。"}]}],"synonyms":["excessive bravado","swagger","bluster","overconfidence","boastfulness"],"phonetic":"/ˌoʊvərbrəˈvɑːdoʊ/","extraExplanation":["“overbravado”不是特别常见的标准词，更常见的说法是“excessive bravado / too much bravado / overconfidence / swagger”。","构词上可以理解为前缀“over-（过度）”+“bravado（逞强、虚张声势）”，强调“超过正常程度的逞强”。在写作里用它会显得更有风格，但正式场合建议用更常见的表达以避免读者困惑。"]}
{"word":"overbrave","summary":{"en":"“Overbrave” means brave to an unsafe, reckless degree.","zh":"“overbrave” 指勇敢过头、变得鲁莽的不顾危险。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too brave in a way that becomes reckless or careless about danger; overconfidently bold.","zh":"过于勇敢（以至于变得鲁莽或不顾危险）；逞勇、过分自信地大胆。"},"examples":[{"en":"He was overbrave and ran toward the fire without any protection.","zh":"他逞勇冲向火场，连基本防护都没有。"},{"en":"Being overbrave can put your team at risk, even if your intentions are good.","zh":"即使出发点是好的，过于勇敢也可能让团队陷入危险。"}]}],"synonyms":["reckless","foolhardy","rash","overconfident"],"phonetic":"/ˌoʊvɚˈbreɪv/","extraExplanation":["“over-” 常见表示“过度、超过适当程度”（如 overconfident 过度自信，overprotective 过度保护）。因此 overbrave 通常带有批评意味：不是单纯的“很勇敢”，而是“勇敢过头→鲁莽”。","这个词在现代英语里不算常见，更常用的表达有: reckless（鲁莽的）, foolhardy（蛮勇的）, overconfident（过度自信的）。"]}
{"word":"overbravely","summary":{"en":"“Overbravely” means acting too bravely—so boldly that it can become rash or unsafe.","zh":"“overbravely”表示“勇敢过头”，即大胆到显得鲁莽或不安全。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively brave way; too boldly, often so that it becomes rash or unsafe.","zh":"过于勇敢地；太大胆地（常因鲁莽或不顾风险而显得不安全）。"},"examples":[{"en":"He overbravely ran toward the burning building without waiting for the firefighters.","zh":"他过于勇敢地冲向着火的楼房，没有等消防员到场。"},{"en":"She spoke overbravely, ignoring the real consequences of her words.","zh":"她说得过于大胆，没有顾及自己话语可能带来的真实后果。"},{"en":"The team overbravely attacked, leaving their defense wide open.","zh":"球队过于冒进地进攻，导致防守漏洞百出。"}]}],"synonyms":["rashly","recklessly","foolhardily","too boldly"],"phonetic":"/ˌoʊvərˈbreɪvli/","extraExplanation":["“overbravely”在现代英语里很少见，通常会用更常用的副词来表达同样意思，比如“rashly（鲁莽地）”“recklessly（不计后果地）”“too boldly（太大胆地）”。","它带有“勇敢过头”这一层评价：不是单纯夸奖，而是暗示做法不明智、风险控制不足。"]}
{"word":"overbraveness","summary":{"en":"Overbraveness means excessive bravery that turns into recklessness.","zh":"overbraveness 指“过度的勇敢”，勇敢过头而显得鲁莽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or exaggerated bravery that becomes risky, reckless, or unwise; too much boldness.","zh":"过度的勇敢；鲁莽的胆大（勇敢到不明智、带来风险的程度）。"},"examples":[{"en":"His overbraveness made him charge ahead without a plan, putting the whole team in danger.","zh":"他过度的勇敢让他在没有计划的情况下冲在前面，把整个团队置于危险之中。"},{"en":"The coach praised her courage but warned that overbraveness can lead to unnecessary injuries.","zh":"教练表扬了她的勇气，但也提醒过度的勇敢可能导致不必要的受伤。"}]}],"synonyms":["recklessness","rashness","foolhardiness","overbravery","overconfidence"],"phonetic":"/ˌoʊvɚˈbreɪvnəs/","extraExplanation":["“overbraveness”由 over-（过度）+ brave（勇敢的）+ -ness（名词后缀）构成，意思是“过度勇敢”。实际使用中更常见的写法/替代词是 “overbravery” 或直接用 “recklessness / rashness”（鲁莽）。","语感上它通常带有批评或提醒：不是否定勇敢本身，而是强调“勇敢过头就变成不理智的冒险”。"]}
{"word":"overbravery","summary":{"en":"Overbravery means too much bravery—courage taken to an unwise or risky extreme.","zh":"overbravery 指“勇敢过头”，即把勇气用到不明智或过于冒险的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or showy bravery; courage that goes beyond what is sensible or safe.","zh":"过度的勇敢；逞强式的勇气（超过理性或安全范围的胆量）。"},"examples":[{"en":"His overbravery made him rush into danger without a plan.","zh":"他的过度勇敢让他没有计划就冲进了危险之中。"},{"en":"In the story, the hero’s overbravery turns a small risk into a disaster.","zh":"在故事里，主角的逞强把小风险变成了灾难。"}]}],"synonyms":["recklessness","foolhardiness","rashness","overconfidence"],"phonetic":"/ˌoʊvɚˈbreɪvəri/","extraExplanation":["“overbravery”不是特别常见的标准词，更多时候人们会用“recklessness（鲁莽）”“foolhardiness（有勇无谋）”“overconfidence（过度自信）”来表达相近意思。","构词上它可以理解为 over-（过度）+ bravery（勇敢）。在写作中用它能强调“勇敢过了头”，带有批评或提醒的语气。"]}
{"word":"overbray","summary":{"en":"Overbray means to bray excessively or to bray so loudly that it overpowers other sounds.","zh":"overbray 指（像驴一样）叫得过度，或叫声大到盖过其他声音。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bray too loudly or for too long; to bray excessively (like a donkey).","zh":"（像驴一样）叫得过响或过久；过度嘶叫。"},"examples":[{"en":"The donkey began to overbray at dawn and woke the whole farm.","zh":"天一亮，那头驴就开始过度嘶叫，把整个农场都吵醒了。"},{"en":"Please calm the animal down—it's starting to overbray again.","zh":"请把动物安抚一下——它又开始叫个不停了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to drown out another sound by braying; to bray over something.","zh":"用嘶叫声盖过别的声音；以叫声压过……。"},"examples":[{"en":"The mule’s cries overbrayed the music from the yard.","zh":"骡子的叫声盖过了院子里传来的音乐。"}]}],"synonyms":["bray loudly","bray incessantly","bellow","heehaw (informal)"],"phonetic":"/ˌoʊvɚˈbreɪ/","extraExplanation":["“over-”常表示“过度/过分”或“在……之上、盖过”，所以 overbray 字面意思就是“叫得过头”或“叫声盖过别的声音”。","这个词非常少见，多出现在较老的文本或带有文学/夸张描写的语境里。日常英语更常说 bray loudly、bray nonstop、make a terrible braying noise 等。","在文学里，bray/overbray 有时会被借用来形容人的笑声或说话声“刺耳、粗俗、像驴叫一样”，带有贬义和讽刺色彩。"]}
{"word":"overbreak","summary":{"en":"Overbreak is a rare, literary word meaning “to dawn” or “the first light of day.”","zh":"overbreak 是较少见的文学用词，常指“破晓/天亮”或“黎明的第一缕光”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(literary, intransitive) To break over or come on (especially of dawn/daylight); to begin to appear and spread across the sky.","zh":"（文学/诗歌用语，不及物）“破晓；天光乍现；晨光渐渐铺开”。常用来形容黎明到来、光线越过地平线。"},"examples":[{"en":"As the sun began to overbreak the hills, the valley slowly filled with light.","zh":"当太阳开始越过群山破晓时，山谷里渐渐充满了光。"},{"en":"We waited in silence for the morning to overbreak.","zh":"我们安静地等待天亮。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) To break or burst through something from above; to break over in waves.","zh":"（少见）从上方冲破/突破；（浪）翻涌着拍打、漫过。"},"examples":[{"en":"Heavy waves overbroke the seawall during the storm.","zh":"暴风雨中，大浪翻过了海堤。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary, noun) The first breaking of daylight; dawn.","zh":"（文学/诗歌用语，名词）破晓；拂晓；天亮之初。"},"examples":[{"en":"They set out at the overbreak, before the town had fully awakened.","zh":"他们在拂晓时分出发，那时小镇还没完全醒来。"}]}],"synonyms":["dawn","daybreak","break (of day)","sunrise"],"phonetic":"/ˌoʊvɚˈbreɪk/","extraExplanation":["“overbreak”在现代日常英语里很少见，更常出现在诗歌或带古风的描写中，用来营造“光线从地平线/山脊上方涌出”的画面感。","更常用的现代替代说法包括：“dawn,” “daybreak,” “the sun rises,” 或“light spread across the sky”。写作时若面向普通读者，用这些会更自然。"]}
{"word":"overbreakage","summary":{"en":"Overbreakage means breakage beyond what is expected or normal; in some business contexts it can also mean an unexpected excess discrepancy, often discussed with “overage and breakage.”","zh":"Overbreakage 指超出预期或正常范围的破损；在部分商业语境中也可指超出预期的差额，常与“overage and breakage（盘盈与破损/差额）”一起讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Breakage that is more than expected or considered normal (for example, too many items broken during shipping or manufacturing).","zh":"超出预期或正常范围的破损（例如运输或生产过程中损坏数量过多）。"},"examples":[{"en":"The warehouse reported overbreakage after several pallets were handled without proper padding.","zh":"由于多托盘在未做好防护的情况下被搬运，仓库报告出现了超额破损。"},{"en":"We changed the packaging to reduce overbreakage during delivery.","zh":"我们更换了包装方式，以减少配送过程中的超额破损。"}]},{"partOfSpeech":"n.","definition":{"en":"In some business/accounting contexts, an excess amount beyond what was expected—especially when discussing “overage and breakage” in cash handling or inventory counts.","zh":"在某些商业/会计语境中，指超出预期的差额（尤其在现金或库存盘点中，与“overage and breakage（盘盈与破损/差额）”并提）。"},"examples":[{"en":"The cashier’s report showed a small overbreakage that had to be investigated.","zh":"收银员的报表显示有一笔小的超额差额，需要进一步核查。"},{"en":"Managers track overage and overbreakage to spot counting errors early.","zh":"管理者会追踪盘盈和超额差额，以便及早发现计数错误。"}]}],"synonyms":["excess breakage","abnormal breakage","unexpected loss","overage (context-dependent)"],"phonetic":"/ˌoʊvərˈbreɪkɪdʒ/","extraExplanation":["“overbreakage”不是日常高频词，更常见的搭配是“breakage（破损）”或在会计里用“overage/shortage（盘盈/盘亏）”。在零售、仓储、运输或生产中，如果破损率超过基准（allowance/expected breakage），就可能被标记为 overbreakage，用于追责、改进包装/流程或控制损耗。"]}
{"word":"overbreathe","summary":{"en":"Overbreathe means to breathe too much or too fast, often from anxiety or exertion, sometimes causing hyperventilation.","zh":"Overbreathe 指过度呼吸（呼吸过快或过深），常由焦虑或用力引起，有时会导致过度换气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to breathe too much or too fast (often because of anxiety, panic, or exertion), sometimes leading to hyperventilation","zh":"过度呼吸；呼吸过快或过深（常因焦虑、恐慌或用力导致），有时会引起“过度换气”"},"examples":[{"en":"When he started to panic, he began to overbreathe and felt dizzy.","zh":"他一开始恐慌，就开始过度呼吸，感觉头晕。"},{"en":"Try to slow down if you notice you’re overbreathing during your workout.","zh":"如果你发现自己在锻炼时过度呼吸，试着放慢节奏。"},{"en":"The instructor taught us how to relax so we wouldn’t overbreathe before the test.","zh":"教练教我们如何放松，以免在测试前过度呼吸。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to breathe more than necessary into a device or system (for example, breathing hard through a mask or regulator)","zh":"（较少见）对设备/系统呼吸过量（例如对着面罩或呼吸调节器喘得很厉害）"},"examples":[{"en":"If you overbreathe the mask, it may feel uncomfortable and dry your mouth.","zh":"如果你对着面罩过度呼吸，可能会觉得不舒服，还会让口腔变干。"},{"en":"New divers sometimes overbreathe their regulator when they’re nervous.","zh":"新手潜水员紧张时有时会对着调节器过度呼吸。"}]}],"synonyms":["hyperventilate","breathe too fast","breathe too much","pant (in some contexts)"],"phonetic":"ˌoʊvɚˈbrið","extraExplanation":["“overbreathe”在日常英语里不算特别常见，更常见的说法是“hyperventilate（过度换气）”或“breathe too fast/too much”。不过“overbreathe”很直观：over-（过度）+ breathe（呼吸）。","当你“overbreathe/hyperventilate”时，往往会出现头晕、手脚发麻、心慌等感受。一般建议放慢呼吸、尝试鼻吸口呼、把注意力放回身体；如果症状严重或反复出现，应寻求专业帮助。"]}
{"word":"overbred","summary":{"en":"Overbred means bred too much (often through inbreeding) leading to weakness, or figuratively too refined and unnatural.","zh":"Overbred 指过度繁殖（常因近亲繁殖）导致体弱，也可比喻过于矫饰、过度精致而不自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal or plant) bred too much, especially through repeated inbreeding, often causing weakness or health problems.","zh":"（动物或植物）过度繁殖的；尤指反复近亲繁殖导致体质变弱或出现健康问题的。"},"examples":[{"en":"Some purebred dogs can become overbred and develop serious genetic diseases.","zh":"有些纯种犬可能因为过度繁殖而出现严重的遗传疾病。"},{"en":"The farmer worried the herd was overbred and less resistant to illness.","zh":"农场主担心牛群过度繁殖，抗病能力下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) too carefully “refined” or cultivated; lacking natural strength or simplicity.","zh":"（比喻）过于矫饰或过度“精致化”的；缺乏自然的力量或朴素感的。"},"examples":[{"en":"The novel criticizes an overbred society that values manners over kindness.","zh":"这部小说批评了一个过于矫饰的社会：重礼仪胜过善良。"},{"en":"His overbred style sounded polished but not very sincere.","zh":"他的风格很圆滑，却不太真诚。"}]}],"synonyms":["inbred","overdeveloped","overrefined","too refined"],"phonetic":"/ˌoʊvərˈbrɛd/","extraExplanation":["“overbred”常用于谈论育种（breeding）。在动物育种语境里，它往往暗示“近亲繁殖过度（inbreeding）”带来的问题，如遗传病风险上升、体质变弱、繁殖能力下降等。","比喻义在文学或评论中也会出现，带一点批评色彩，指人或文化过度讲究“精致、教养、规矩”，反而显得不自然或缺少真诚。"]}
{"word":"overbreed","summary":{"en":"Overbreed means to breed too much, producing more offspring than is healthy or sustainable; it can also be used figuratively for producing too many of the same kind.","zh":"overbreed 指“过度繁殖”，使后代数量多到不健康或不可持续；也可比喻“产生/培养出过多同类”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to breed (animals, plants, etc.) too much, producing more offspring than is healthy, useful, or sustainable","zh":"（对动物、植物等）过度繁殖；繁殖过多（以致不健康、不实用或不可持续）"},"examples":[{"en":"If rabbits are overbred, they may become weaker and more prone to disease.","zh":"如果兔子被过度繁殖，它们可能会变得更虚弱、更容易生病。"},{"en":"The farm learned not to overbreed pigs because it strained feed supplies.","zh":"农场意识到不能让猪过度繁殖，因为这会紧张饲料供应。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to produce too many of something, especially people with the same training or ideas","zh":"（比喻）培养/产生过多同类的人或事物（尤其指相同背景、训练或想法的人）"},"examples":[{"en":"Some critics argue the industry has overbred a narrow style of pop music.","zh":"一些评论家认为这个行业“过度生产”了单一风格的流行音乐。"},{"en":"The program didn’t want to overbreed the same kind of expert; it encouraged diverse skills.","zh":"该项目不想培养出过多同一种专家；它鼓励多样化技能。"}]}],"synonyms":["breed too much","overpopulate","proliferate"],"phonetic":"/ˌoʊvərˈbrid/","extraExplanation":["“over-”表示“过度、过分”，加在动词前常构成“做得太多/太过头”的意思，如 overwork（过度工作）、overeat（吃太多）。","overbreed 在日常口语中不算特别常见，更常见的表达还有 “breed too much/too many” 或在生态语境下用 “overpopulate（数量过多）”。"]}
{"word":"overbreeding","summary":{"en":"Overbreeding means breeding too much, often leading to health or genetic problems.","zh":"overbreeding 指过度繁殖/过度育种，常导致健康或遗传方面的问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of breeding animals or plants too much, especially in a way that causes health problems, weakness, or loss of genetic diversity.","zh":"（对动物或植物）过度繁殖；过度育种，尤指导致健康问题、体质变差或遗传多样性下降。"},"examples":[{"en":"Overbreeding in some dog lines can increase the risk of inherited diseases.","zh":"某些狗的血统中过度育种会增加遗传疾病的风险。"},{"en":"Farmers try to avoid overbreeding because it can reduce fertility over time.","zh":"农民会尽量避免过度繁殖，因为长期可能会降低繁殖能力。"}]},{"partOfSpeech":"v.","definition":{"en":"Breeding too frequently or too many times; producing too many offspring (often used when talking about animals).","zh":"过度繁殖（指繁殖过于频繁或数量过多，常用于谈论动物）。"},"examples":[{"en":"If you keep the males and females together, they may overbreed.","zh":"如果你把公母一直养在一起，它们可能会过度繁殖。"},{"en":"Rabbits can overbreed quickly in warm conditions.","zh":"在温暖环境下，兔子会很快过度繁殖。"}]}],"synonyms":["excessive breeding","overproduction","overreproduction"],"phonetic":"/ˌoʊvɚˈbriːdɪŋ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常/健康的程度”，如 overwork（过度工作）、overeat（暴饮暴食）。因此 overbreeding 的核心语感是“繁殖本身没错，但超过了合理范围，带来负面后果”。","在育种语境中，overbreeding 常与“近亲繁殖”（inbreeding）一起讨论：两者相关但不同。inbreeding 强调“亲缘关系太近”，overbreeding 强调“繁殖次数/强度太高”或“为了某些性状而过度繁育”，都可能导致遗传问题与健康风险。"]}
{"word":"overbribe","summary":{"en":"Overbribe means to offer an excessively large bribe, or to outbid others by bribing more.","zh":"overbribe 指“行贿过头/给出过大的贿赂”，也可指“用更大的贿赂压过他人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bribe someone with too much money or too many favors; to offer an excessive bribe","zh":"以过多金钱或好处行贿；给出过大的贿赂"},"examples":[{"en":"He tried to overbribe the official to speed up the permit.","zh":"他试图用过大的贿赂收买那名官员，以加快许可证的办理。"},{"en":"If you overbribe, you may attract suspicion instead of cooperation.","zh":"如果你行贿过头，可能会引起怀疑，而不是得到配合。"}]},{"partOfSpeech":"vt.","definition":{"en":"to outbid others by offering a larger bribe","zh":"用更大的贿赂压过他人；以更高的贿赂“竞标”"},"examples":[{"en":"Rivals tried to overbribe one another for influence.","zh":"竞争对手们试图用更大的贿赂彼此压过，以争取影响力。"},{"en":"The contractor overbribed his competitors and won the deal.","zh":"那位承包商用更大的贿赂压过竞争对手，拿下了交易。"}]}],"synonyms":["bribe heavily","offer a bigger bribe","outbribe","buy off (informal)"],"phonetic":"/ˌoʊvərˈbraɪb/","extraExplanation":["“overbribe”不是非常常见的日常用词，多见于需要强调“贿赂过多/压过他人”的语境。更常见的表达包括：offer a bigger bribe（给更大的贿赂）、bribe heavily（重金行贿）、outbribe（用更高贿赂胜过他人，较少见）。","在法律与新闻语境中，bribery（行贿受贿）属于严重违法行为；学习该词时建议把重点放在理解语义与阅读能力，而不是在现实中使用。"]}
{"word":"overbridge","summary":{"en":"An overbridge is a bridge that goes over another road or railway (an overpass).","zh":"Overbridge 指跨越另一条道路或铁路的桥（相当于 overpass/立交桥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bridge that carries a road, path, or railway over another road, railway, or river; an overpass","zh":"（让道路/人行道/铁路）跨越另一条道路、铁路或河流的桥；立交桥；跨线桥"},"examples":[{"en":"Take the next left after the overbridge.","zh":"过了跨线桥后在下一个路口左转。"},{"en":"The train slowed as it passed under an overbridge.","zh":"火车从跨线桥下通过时减速了。"},{"en":"They built an overbridge to separate traffic and reduce accidents.","zh":"他们修建了立交桥来分离车流、减少事故。"}]}],"synonyms":["overpass","flyover","bridge"],"phonetic":"/ˈoʊvərˌbrɪdʒ/","extraExplanation":["“Overbridge”在英式英语（以及一些英联邦地区的英语）里更常见；美式英语更常说“overpass”。在某些地区也会用“flyover”（通常指更大型的高架立交/高架道路结构）。","在铁路语境中，overbridge 常指“跨越铁路的桥”（桥在上方）；相对的 “underbridge” 则是“桥在下方，让铁路/道路从桥上通过”。"]}
{"word":"overbright","summary":{"en":"“Overbright” means too bright, especially in lighting, screens, or photos.","zh":"“overbright”表示“过亮的”，常用于灯光、屏幕或照片等场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too bright; brighter than is comfortable, appropriate, or intended.","zh":"过亮的；亮得不舒服、过分或不合适的。"},"examples":[{"en":"The classroom lights were overbright, so we lowered them.","zh":"教室灯光太亮了，所以我们把亮度调低。"},{"en":"The overbright screen hurt my eyes at night.","zh":"晚上屏幕太亮，刺得我眼睛难受。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Photo/tech) Brighter than it should be because of too much light or too high a setting; often causing loss of detail.","zh":"（摄影/技术）因光线过强或设置过高而过亮的；常导致细节丢失。"},"examples":[{"en":"Her face looks overbright in this photo—try reducing the exposure.","zh":"这张照片里她的脸看起来过亮——试着降低曝光。"},{"en":"The projector image is overbright and washes out the colors.","zh":"投影画面过亮，把颜色都冲淡了。"}]}],"synonyms":["too bright","overly bright","glaring","dazzling","overexposed (photo)"],"phonetic":"/ˌoʊvɚˈbraɪt/","extraExplanation":["“over-”表示“过度、超过正常程度”（如 overwork 过度工作、overcook 煮过头），所以 overbright 很直观：亮度“超过合适范围”。","在摄影里，overbright 常和 overexposed（过曝）意思接近：亮部太强，细节被“冲掉”。在屏幕设置中也常说 “the display is overbright”（屏幕亮度过高）。"]}
{"word":"overbrightly","summary":{"en":"“Overbrightly” means “too brightly,” either literally (light) or figuratively (an unnaturally cheerful manner).","zh":"overbrightly 表示“过于明亮地/过于欢快地”，可指灯光太亮，也可指笑容或态度过分热情而显得不自然。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too bright or too cheerful, often seeming unnatural or exaggerated.","zh":"过于明亮地；过于欢快地（常给人不自然、夸张的感觉）。"},"examples":[{"en":"She smiled overbrightly, trying to hide how nervous she was.","zh":"她笑得过于灿烂，试图掩饰自己的紧张。"},{"en":"The room was lit overbrightly, making it hard to relax.","zh":"房间灯光打得过于明亮，让人很难放松。"}]}],"synonyms":["too brightly","overly brightly","garishly","forcedly","too cheerfully"],"phonetic":"/ˌoʊvɚˈbraɪtli/","extraExplanation":["“over-”常表示“过度、过分”，加在形容词或副词前，强调“超过合适的程度”。因此 overbrightly 往往带有评价色彩：不是单纯“很亮/很开心”，而是“亮得不合适/开心得有点做作”。","在文学或叙事写作中，overbrightly 常用来暗示人物情绪的“掩饰”：表面很热情、很灿烂，但内心可能紧张、难过或在说谎。"]}
{"word":"overbrightness","summary":{"en":"Overbrightness means being too bright (often on screens or in images), sometimes as a deliberate visual style.","zh":"Overbrightness 指亮度过高（常见于屏幕或影像），有时也指刻意营造的过亮视觉风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or problem of being too bright, especially on a screen, in a photo, or in lighting, making details hard to see or colors look washed out","zh":"过亮；亮度过高（尤指屏幕、照片或照明太亮，导致细节看不清或颜色发白）"},"examples":[{"en":"Lower the screen brightness—overbrightness can cause eye strain.","zh":"把屏幕亮度调低一点——过亮可能会让眼睛疲劳。"},{"en":"The overbrightness in the photo blew out the highlights in her face.","zh":"照片过亮，把她脸上的高光细节都“炸白”了。"}]},{"partOfSpeech":"n.","definition":{"en":"an intentionally very bright look or effect used for style, sometimes to suggest heat, glare, or a dreamlike mood","zh":"（刻意的）强烈明亮效果；过曝风格（有时用来表现炫光、炎热或梦幻感）"},"examples":[{"en":"The director used overbrightness to make the desert scenes feel blinding.","zh":"导演用强烈的过亮效果，让沙漠场景看起来刺眼。"},{"en":"Some ads use overbrightness to make products look clean and fresh.","zh":"有些广告用偏过亮的画面，让产品显得更干净清爽。"}]}],"synonyms":["excessive brightness","glare","overexposure","washed-out look","too-brightness"],"phonetic":"/ˌoʊvɚˈbraɪtnəs/","extraExplanation":["“Overbrightness”在日常英语里不算特别常用，更常见的说法是“too bright / excessive brightness / glare / overexposure（过曝）”。在摄影与视频里常搭配“highlights（高光）”一起说：highlights are blown out（高光炸白）表示过亮导致细节丢失。","在显示器与手机设置里，类似问题也常用“brightness is too high（亮度太高）”或“screen is glaring（屏幕刺眼）”。如果强调视觉不适，可以用“glare（眩光）”更地道。"]}
{"word":"overbrilliance","summary":{"en":"Overbrilliance means excessive brightness or (figuratively) excessive showy brilliance.","zh":"overbrilliance 指过度的明亮（刺眼的强光），也可比喻过度卖弄的“才华/聪明”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive brightness or strong shining light (often to the point of glare).","zh":"过度的明亮；刺眼的强光（常指亮到让人不舒服）。"},"examples":[{"en":"The overbrilliance of the stage lights made it hard to see the actors’ faces.","zh":"舞台灯光过于刺眼，让人很难看清演员的脸。"},{"en":"Reduce the screen’s overbrilliance to avoid eye strain.","zh":"把屏幕亮度调低，避免眼睛疲劳。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Excessive showiness or “trying too hard” to sound clever or impressive.","zh":"（比喻）过度卖弄、过分炫耀聪明或才华。"},"examples":[{"en":"The essay’s overbrilliance distracted from its main argument.","zh":"这篇文章过分卖弄，反而分散了对核心论点的注意力。"},{"en":"Her speech was powerful, but a little overbrilliance made it feel less sincere.","zh":"她的演讲很有力量，但有点过度炫技，让人感觉不够真诚。"}]}],"synonyms":["glare","excessive brightness","dazzle","showiness","overstatement"],"phonetic":"/ˌoʊvɚˈbrɪljəns/","extraExplanation":["“overbrilliance”不是非常常见的标准词，更常见的说法是“excessive brightness / glare”（指光）或“overly clever/showy writing”（指文风）。但它由前缀 over-（过度）+ brilliance（光辉/才华）组成，意思清晰，读者通常能理解。","如果你写作想更自然：谈屏幕/灯光可用“glare”“too bright”；谈文风可用“overly ornate”“showy”“purple prose”（偏文学/批评语境）。"]}
{"word":"overbrilliancy","summary":{"en":"Overbrilliancy means too much brightness (sometimes uncomfortably bright), and more rarely, an overly showy or clever style.","zh":"overbrilliancy 指“过度明亮、刺眼的光”，更少见时也可指“过度炫技/卖弄的风格”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive brightness or shine that feels too strong, glaring, or unpleasant.","zh":"过度的明亮；刺眼的光亮（亮得让人不舒服）。"},"examples":[{"en":"The overbrilliancy of the stage lights made it hard to see the actors’ faces.","zh":"舞台灯光过于刺眼，让人很难看清演员的脸。"},{"en":"She lowered the screen brightness to reduce the overbrilliancy.","zh":"她调低了屏幕亮度，以减少过度的刺眼感。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A showy or overly clever style that draws attention to itself instead of the main message.","zh":"（比喻，较少见）过分炫技或过度聪明的表达方式，反而抢走主题的注意力。"},"examples":[{"en":"Some readers felt the essay’s overbrilliancy distracted from its argument.","zh":"有些读者觉得这篇文章过度炫技，反而分散了对论证的注意力。"},{"en":"The director avoided overbrilliancy and kept the film’s tone simple and honest.","zh":"导演避免卖弄，把电影的基调保持得简单而真诚。"}]}],"synonyms":["glare","dazzle","overbrightness","showiness","overstatement"],"phonetic":"/ˌoʊvərˈbrɪljənsi/","extraExplanation":["这个词非常少见，多见于较旧或较文学化的语境。结构上是 over-（“过度”）+ brilliancy（“光辉；才华”），因此既可指“光线太亮”，也可比喻“才华/风格太炫”。","更常用的替代表达包括：too much brightness / glare（太亮/眩光），或在比喻义上用 showiness, over-cleverness（炫耀、过度机巧）。"]}
{"word":"overbrilliant","summary":{"en":"Overbrilliant means excessively bright or (figuratively) excessively clever/showy.","zh":"overbrilliant 指“过于明亮刺眼”，也可指（比喻）“过分机智或炫耀、用力过猛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too bright, shining, or dazzling—so much that it can feel harsh or uncomfortable.","zh":"过于明亮、耀眼（亮到让人不舒服或刺眼）。"},"examples":[{"en":"The overbrilliant spotlight made it hard to see the actors’ faces clearly.","zh":"那盏过于耀眼的聚光灯让人很难看清演员的脸。"},{"en":"In the overbrilliant noon sun, the white sand seemed to glow.","zh":"在过于明亮的正午阳光下，白沙仿佛在发光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Too clever, flashy, or showy in a way that feels excessive or unnatural.","zh":"（比喻）过分聪明或过于炫技/华丽，显得用力过猛、不自然。"},"examples":[{"en":"His overbrilliant jokes impressed some people, but others found them exhausting.","zh":"他那些过分机智的笑话让一些人佩服，但也让另一些人觉得很累。"},{"en":"The essay’s overbrilliant style distracted from its main argument.","zh":"那篇文章过于炫技的文风反而分散了对主论点的注意力。"}]}],"synonyms":["too bright","glaring","dazzling","overly clever","showy"],"phonetic":"/ˌoʊvɚˈbrɪljənt/","extraExplanation":["“over-”作前缀常表示“过度、太……”，带有“超过合适程度”的评价色彩（不一定是赞美）。因此 overbrilliant 往往暗示“亮/聪明得过头”，语气可能偏批评或提醒。","这个词相对少见，更常见的表达有：too bright / glaring（刺眼的），以及（比喻）too clever / showy / overly polished（过于卖弄/过于雕琢）。"]}
{"word":"overbrilliantly","summary":{"en":"“Overbrilliantly” means ‘too brilliantly/too brightly/too showily,’ beyond what feels appropriate.","zh":"“overbrilliantly”表示“过于耀眼/过于出色/过于炫目地”，带有“超过适度”的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too brilliant, too bright, or too showy—more than is appropriate for the situation.","zh":"以过于耀眼、过于出色或过于炫目的方式；亮得或表现得超过场合所需。"},"examples":[{"en":"The chandelier shone overbrilliantly, making it hard to relax in the room.","zh":"吊灯亮得过于刺眼，让人在房间里很难放松。"},{"en":"He spoke overbrilliantly, as if trying to impress everyone instead of sharing a simple idea.","zh":"他说话过于“机智耀眼”，像是在努力取悦所有人，而不是在表达一个简单的想法。"},{"en":"Her outfit looked overbrilliantly colorful for a quiet memorial service.","zh":"她的穿着颜色过于鲜艳，不太适合安静的追思仪式。"}]}],"synonyms":["too brightly","too brilliantly","overly","excessively","showily"],"phonetic":"/ˌoʊvɚˈbrɪljəntli/","extraExplanation":["这个词由前缀 over-（“过度、太……”）+ brilliantly（“灿烂地/出色地”）构成，强调“超过适度”的感觉。","overbrilliantly 在现代日常英语中很少见；更常用的表达有 too brightly / too brilliantly / overly bright(ly) / showily。"]}
{"word":"overbrim","summary":{"en":"Overbrim means to overflow or be so full that it spills over the brim.","zh":"Overbrim 指“满到溢出”，强调超过边缘而溢出来。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to fill past the brim; to overflow (often used with “with” to show what something is full of)","zh":"满到溢出；（常与 with 连用）充满到快要溢出来"},"examples":[{"en":"The cup overbrimmed when I poured in too much water.","zh":"我倒水倒太多，杯子满得溢出来了。"},{"en":"Her eyes overbrimmed with tears.","zh":"她泪水盈眶，几乎要溢出来。"},{"en":"The room seemed to overbrim with excitement.","zh":"房间里仿佛充满了兴奋的气氛，快要溢出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to overflow; to fill something beyond its brim (rare)","zh":"使……溢出；把……装得超过杯口/边缘（较少见）"},"examples":[{"en":"The sudden rain overbrimmed the gutters.","zh":"突如其来的大雨让排水沟都溢出来了。"},{"en":"Too much sauce can overbrim the bowl.","zh":"酱汁放太多会让碗溢出来。"}]}],"synonyms":["overflow","brim over","spill over","run over"],"phonetic":"/ˌoʊvɚˈbrɪm/","extraExplanation":["“overbrim”由 over（超过）+ brim（杯口/边缘）构成，语感上比更常见的“overflow”更形象，强调“刚好到边缘却又超过一点”。","在现代英语中，更常见的表达是“brim over (with…) / overflow (with…)”。“overbrim”偏文学或较少用的用法，但在描写情绪或泪水时很贴切。"]}
{"word":"overbrimmed","summary":{"en":"Overbrimmed describes something with a brim that is very wide (usually a hat), or something filled beyond its brim.","zh":"Overbrimmed 可形容（多指帽子）帽檐很宽，也可形容（容器）装到超过边缘、快溢出的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a hat) having an unusually wide brim; wide-brimmed, sometimes to an excessive degree.","zh":"（指帽子）帽檐特别宽的；（有时指）宽得有点夸张的。"},"examples":[{"en":"He shaded his eyes with an overbrimmed hat while walking across the desert.","zh":"他走在沙漠里，戴着一顶帽檐很宽的帽子遮住眼睛。"},{"en":"In old photos, she often wears an overbrimmed straw hat that frames her face.","zh":"在老照片里，她常戴一顶帽檐很宽的草帽，把脸衬得很好看。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a container) filled past the brim; brimming over.","zh":"（指容器）装到溢出边缘的；满得要溢出来的。"},"examples":[{"en":"He carried an overbrimmed cup of coffee and tried not to spill it.","zh":"他端着一杯装到快溢出的咖啡，尽量不洒出来。"},{"en":"The bucket was overbrimmed after the heavy rain.","zh":"大雨过后，水桶装得满到溢出来。"}]}],"synonyms":["wide-brimmed","brimming","filled to the brim","overflowing"],"phonetic":"/ˌoʊvɚˈbrɪmd/","extraExplanation":["“overbrimmed”在现代英语里不算常见，更常见的表达是：hat → “wide-brimmed”；容器 → “brimming (over)” / “filled to the brim”。","它有时也会写成带连字符的形式“over-brimmed”，尤其在描述“帽檐很宽”的时候，属于偏文学/描写性的用法。"]}
{"word":"overbrimming","summary":{"en":"Overbrimming means “overflowing” or “brimming over,” often used for liquids or strong feelings.","zh":"overbrimming 表示“满到溢出、洋溢”，既可形容液体溢出，也常形容情感或气氛非常充沛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overflowing; so full that the contents spill over the edge (literal or figurative).","zh":"满到溢出来的；洋溢的（可指字面溢出，也可指情感、气氛等充沛外露）。"},"examples":[{"en":"The cup was overbrimming with tea, so she carried it carefully.","zh":"杯子里的茶满到快溢出来了，所以她小心地端着。"},{"en":"He spoke with overbrimming joy about the new job.","zh":"他谈起新工作时喜悦之情溢于言表。"},{"en":"The room felt overbrimming with energy during the rehearsal.","zh":"排练时房间里仿佛充满到溢出来的活力。"}]}],"synonyms":["overflowing","brimming","teeming","abundant","effusive"],"phonetic":"/ˌoʊvɚˈbrɪmɪŋ/","extraExplanation":["“overbrimming”由 over-（过度、超过）+ brim（杯口、边缘；满到边缘）组成，画面感很强：液体满到杯沿并溢出。引申义常用来形容情绪、氛围或人群“多得装不下”。","它在文学描写中很常见，用来制造“充盈、丰沛”的意象，例如“overbrimming with gratitude / hope / love（满溢着感激/希望/爱）”。正式写作里也常用同义词 overflowing 或 brimming。"]}
{"word":"overbrimmingly","summary":{"en":"Overbrimmingly means “in an overly full or overflowing way.”","zh":"overbrimmingly 表示“满得溢出来地；过于充盈地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly full or overflowing way; more than enough.","zh":"满得溢出来地；过于充盈地；多得超过所需地。"},"examples":[{"en":"The cup was filled overbrimmingly, and coffee spilled onto the saucer.","zh":"杯子被倒得满到溢出来，咖啡流到了杯碟上。"},{"en":"She spoke overbrimmingly about her gratitude, thanking everyone again and again.","zh":"她表达感激时显得过于充沛，一遍又一遍地向大家道谢。"}]}],"synonyms":["to overflowing","exceedingly","abundantly","overflowingly","excessively"],"phonetic":"/ˌoʊvɚˈbrɪmɪŋli/","extraExplanation":["这是一个比较少见的副词，多由 over-（过度）+ brim（边缘；满到边缘）+ -ingly 组合而成，语气带有“满到溢出”的画面感。日常写作里更常用的替代表达有 to overflowing / exceedingly / abundantly。"]}
{"word":"overbroad","summary":{"en":"Overbroad means too wide or general, often covering more than intended; in law, it can mean a restriction that limits lawful or protected activity too much.","zh":"overbroad 表示“范围过大/过于笼统”，包含了超出必要范围的内容；在法律中常指对合法或受保护行为限制过多的规定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too general or wide in scope; including more people, things, or situations than is necessary or intended.","zh":"过于笼统或范围过大；把不必要或不相关的人、事、情况也包含进去。"},"examples":[{"en":"The new rule is overbroad and affects employees who don’t work with customer data.","zh":"这项新规定范围过大，影响到了不接触客户数据的员工。"},{"en":"Her conclusion felt overbroad because it was based on only two examples.","zh":"她的结论显得过于泛化，因为只基于两个例子就下了判断。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law) Describing a law, policy, or restriction that goes beyond what is allowed, often limiting protected rights more than necessary.","zh":"（法律）指法律、政策或限制“管得太宽”，超出允许范围，往往对受保护的权利造成不必要的限制。"},"examples":[{"en":"The judge ruled the ban overbroad because it restricted lawful speech.","zh":"法官认定该禁令过于宽泛，因为它限制了合法言论。"},{"en":"The court said the policy was overbroad and needed a narrower definition.","zh":"法院认为该政策范围过大，需要更精确、更窄的定义。"}]}],"synonyms":["too broad","overly broad","sweeping","generalized","blanket","all-encompassing"],"phonetic":"ˌoʊvərˈbrɔd","extraExplanation":["“overbroad”常用于批评规则/说法“抓得太多”。在日常英语里，它常搭配 rule, policy, law, statement, definition, restriction 等词。","在美国法律语境中常见“overbreadth（过度宽泛）”概念：如果一项规定为了打击某些不当行为，却连大量合法行为（尤其是受宪法保护的言论）也一并禁止，就可能被认为 overbroad。"]}
{"word":"overbroaden","summary":{"en":"Overbroaden means to make something too broad in scope, often causing it to become unclear or inaccurate.","zh":"Overbroaden 指把某事的范围扩得过头，常导致不够清晰或不够准确。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(often in academic or policy contexts) to make an idea, rule, category, or interpretation too broad, so it includes things it shouldn’t.","zh":"（常用于学术或政策语境）把观点、规则、类别或解释扩大得过头，以至于把不该包含的内容也算进去。"},"examples":[{"en":"The reviewer said the author overbroadened the definition of “culture.”","zh":"审稿人说作者把“文化”的定义扩得太宽了。"},{"en":"If we overbroaden the policy, it may punish people who did nothing wrong.","zh":"如果我们把政策扩大得过头，可能会惩罚到无辜的人。"}]},{"partOfSpeech":"v.","definition":{"en":"to expand the scope of something too much (often unintentionally), reducing clarity or accuracy.","zh":"把某事物的范围扩展过多（常常是无意的），从而降低清晰度或准确性。"},"examples":[{"en":"In trying to be inclusive, the discussion overbroadened and lost focus.","zh":"为了更包容，这场讨论范围扩得过头，结果失去了焦点。"},{"en":"Don’t overbroaden your thesis statement; keep it specific.","zh":"不要把论文论点写得太泛；要保持具体。"}]}],"synonyms":["overgeneralize","stretch too far","make too broad","overextend"],"phonetic":"/ˌoʊvɚˈbrɔdən/","extraExplanation":["“over-”表示“过度”，搭配“broaden（扩大范围）”构成“overbroaden”。它多见于正式写作（论文、法律、政策、评论），口语中更常用 overgeneralize（过度概括）或 make it too broad（说得太宽/太泛）。","常见搭配：overbroaden a definition / rule / category / scope（把定义/规则/类别/范围扩得过头）。"]}
{"word":"overbroil","summary":{"en":"Overbroil means to broil food too long so it becomes overcooked or burnt.","zh":"Overbroil 指把食物用上火炙烤烤太久，导致过熟或烤焦。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to broil something for too long, so it becomes overcooked (often dry, tough, or burnt on the surface).","zh":"把（食物）用上火/炙烤烤太久，导致过熟（常见变干、变硬或表面焦黑）。"},"examples":[{"en":"Don’t overbroil the salmon—two minutes per side is usually enough.","zh":"别把三文鱼烤过头——通常每面两分钟就够了。"},{"en":"I overbroiled the chicken, and the edges turned black.","zh":"我把鸡肉炙烤过头了，边缘都变黑了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become overcooked because it is broiled for too long.","zh":"（食物）因炙烤时间过长而变得过熟。"},"examples":[{"en":"If you walk away for even a minute, thin cuts can overbroil quickly.","zh":"你哪怕走开一分钟，薄切的肉也可能很快就烤过头。"}]}],"synonyms":["overcook","burn","char","scorch"],"phonetic":"/ˌoʊvɚˈbrɔɪl/","extraExplanation":["“Broil”在美式英语里通常指把食物放在烤箱上火（上方热源）下快速高温加热，表面很容易上色甚至焦掉；因此“overbroil”常用于提醒时间要短、要盯紧。","“Overbroil”在日常口语里不算特别常见，很多人也会直接说“overcook it under the broiler”或“burn it.”"]}
{"word":"overbrood","summary":{"en":"“Overbrood” means to brood excessively—to dwell on worries, sadness, or a problem too long.","zh":"“overbrood”表示“过度忧思/过分纠结”，即对烦恼、悲伤或问题反复想着太久。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to brood too much; to think about worries or sadness for too long","zh":"过度忧思；想太多、过分沉溺于烦恼或悲伤之中"},"examples":[{"en":"Try not to overbrood on what you said yesterday—everyone makes mistakes.","zh":"尽量别对你昨天说的话过度忧思——人人都会犯错。"},{"en":"He tends to overbrood when plans change suddenly.","zh":"计划突然改变时，他往往会想太多、反复忧虑。"}]},{"partOfSpeech":"vt.","definition":{"en":"to brood over something excessively; to dwell on it longer than is helpful","zh":"对某事过度反复思量；纠结于某事，超过有益的程度"},"examples":[{"en":"She overbrooded the small criticism until it felt huge.","zh":"她把那点小批评反复纠结，结果觉得问题变得很大。"},{"en":"Don’t overbrood your past failures; focus on what you can do next.","zh":"别对过去的失败过度纠结；把注意力放在下一步能做什么上。"}]}],"synonyms":["overthink","dwell (on)","brood (over)","obsess (over)","ruminate"],"phonetic":"/ˌoʊvərˈbrud/","extraExplanation":["这个词很少见，多用于较文学或较旧的语境。构词上是 over-（过度）+ brood（沉思/忧思）。日常英语里更常用的表达是: overthink（想太多）、dwell on（反复纠结）、brood over（闷闷不乐地反复想着）。"]}
{"word":"overbrook","summary":{"en":"Overbrook is most commonly a U.S. place name; it can also be a surname.","zh":"Overbrook最常见的是美国的地名；也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for several neighborhoods/towns in the U.S. (for example, areas in Philadelphia, Pennsylvania, and in Kansas City, Missouri). It can also appear as a station name or in street/school names.","zh":"地名（专有名词），“Overbrook”在美国用于多个社区/城镇的名称（例如宾夕法尼亚州费城、密苏里州堪萨斯城等地的区域），也常见于车站名、街道名或学校名。"},"examples":[{"en":"She moved to Overbrook, Philadelphia for work.","zh":"她为了工作搬到了费城的Overbrook社区。"},{"en":"Let’s meet at Overbrook Station after class.","zh":"下课后我们在Overbrook站见。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common in everyday conversation than the place-name use.","zh":"姓氏（不如地名用法常见）。"},"examples":[{"en":"Mr. Overbrook will join the meeting at 3 p.m.","zh":"Overbrook先生将于下午三点参加会议。"}]}],"synonyms":["(no direct synonym; it’s a proper name)"],"phonetic":"/ˈoʊvɚˌbrʊk/","extraExplanation":["“Overbrook”由 over（在……之上/越过）+ brook（小溪）组成，字面感觉像“溪流上方/越过小溪的地方”。许多英语地名来自地形特征，因此这个名字常给人一种“靠近小溪、地势较高”的印象。","作为专有名词，它的具体指代取决于语境：通常需要结合州名、城市名或附近地标（如“Overbrook, Philadelphia”）来确定是哪一个Overbrook。"]}
{"word":"overbrow","summary":{"en":"Overbrow means to intimidate or dominate someone; more rarely, it can mean to overhang or overshadow like a brow.","zh":"Overbrow 指用强势气场或严厉目光威慑、压制；较少见时也可指像“眉”一样悬在上方、遮蔽。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to intimidate or dominate someone by a stern look, strong presence, or aggressive manner; to overawe","zh":"用严厉的目光或强势的态度威慑、压制（某人）；使不敢反抗"},"examples":[{"en":"The manager tried to overbrow the staff into silence.","zh":"经理试图用强势态度压得员工不敢出声。"},{"en":"She refused to be overbrowed by their threats.","zh":"她拒绝被他们的威胁吓住。"}]},{"partOfSpeech":"v.","definition":{"en":"(literal, rare) to hang over like an eyebrow; to overhang or overshadow","zh":"（字面义，较少见）像眉毛一样悬在上方；突出、遮蔽"},"examples":[{"en":"Dark cliffs overbrow the narrow valley.","zh":"黑色的峭壁高高突出，笼罩着狭窄的山谷。"},{"en":"A heavy branch overbrowed the path.","zh":"一根粗重的树枝悬在小路上方。"}]}],"synonyms":["intimidate","bully","overawe","cow","dominate","browbeat"],"phonetic":"/ˌoʊvɚˈbraʊ/","extraExplanation":["“overbrow”属于较古老/文学性用词，现代英语里更常用的表达是：intimidate（威吓）、bully（霸凌/欺压）、overawe（使敬畏而不敢反抗）、dominate（压制）。","字面义与“brow（眉/额头；山脊）”有关：像“眉”一样压在上方，因此引申出“以气势压人”的含义。"]}
{"word":"overbrown","summary":{"en":"“Overbrown” means to brown food too much (or food that has become too brown).","zh":"“overbrown”指把食物煎/烤得过焦（或指食物上色过深）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to brown (food) too much while cooking, so it becomes darker than intended and may taste bitter or burnt","zh":"（烹饪时）把（食物）煎/烤得过焦、上色过深，可能带苦味或焦味"},"examples":[{"en":"Be careful not to overbrown the onions, or the soup will taste bitter.","zh":"小心别把洋葱炒得过焦，不然汤会发苦。"},{"en":"I overbrowned the toast because I forgot it in the toaster.","zh":"我把吐司烤过头了，因为我忘了它还在烤面包机里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(describing food) browned too much; overly dark from cooking","zh":"（形容食物）烤/煎得过焦的；颜色过深的"},"examples":[{"en":"The overbrown cookies looked fine, but they were a little dry.","zh":"那些饼干烤得有点过焦，看起来还行，但有点干。"},{"en":"If the crust is overbrown, cover it with foil and keep baking.","zh":"如果外皮上色过深，就盖上锡纸再继续烤。"}]}],"synonyms":["brown too much","overcook","burn (slightly)","overbrowned"],"phonetic":"/ˌoʊvɚˈbraʊn/","extraExplanation":["“overbrown”在日常英语里不算常见，更常用的表达有：\n- 动词：brown too much / overcook / burn (slightly)\n- 形容词：overbrowned / too brown / burnt\n在食谱或烹饪语境中使用“overbrown”会更自然。"]}
{"word":"overbrowse","summary":{"en":"Overbrowse means to browse excessively—most often online, and less commonly in ecology, to overfeed on vegetation.","zh":"overbrowse 指“过度浏览”，多用于上网刷太久；较少见的生态学用法指动物“过度啃食植被”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to browse too much or for too long (especially online), often in a way that wastes time or leads to information overload","zh":"（尤指在网上）过度浏览、刷太久（常带有浪费时间或信息过载的意味）"},"examples":[{"en":"I overbrowsed last night and ended up reading random articles until 2 a.m.","zh":"我昨晚刷太久了，结果一直看各种随机文章到凌晨两点。"},{"en":"Try not to overbrowse when you’re researching—set a timer and stick to your questions.","zh":"做资料搜集时尽量别过度浏览——设个计时器，只围绕你的问题查。"}]},{"partOfSpeech":"v.","definition":{"en":"(ecology, less common) to feed on plants so heavily that the vegetation is damaged or reduced","zh":"（生态学/较少见）过度啃食植物，导致植被受损或减少"},"examples":[{"en":"In some areas, deer can overbrowse young trees before they have a chance to grow.","zh":"在一些地区，鹿会过度啃食幼树，导致它们还没长大就被吃坏。"}]}],"synonyms":["browse too much","scroll too much","doomscroll","overconsume (content)","overgraze (ecology)"],"phonetic":"/ˌoʊvərˈbraʊz/","extraExplanation":["这个词由 over-（过度）+ browse（浏览/啃食嫩叶）构成，因此既可用于“上网刷内容太多”，也可用于“动物啃食植被过量”。在日常英语里，更常见的说法通常是 browse too much、doomscroll、scroll for hours 等；overbrowse 更偏描述性、较不常见。"]}
{"word":"overbrowsed","summary":{"en":"Overbrowsed means having browsed too much (often online), or being heavily viewed.","zh":"overbrowsed 指“浏览过多（常指上网）导致信息过载”，也可指“被大量浏览过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) having browsed too much, especially online, so you feel tired, unfocused, or overwhelmed by information.","zh":"（指人）浏览过多（尤其是上网刷信息），以至于感到疲惫、分心或信息过载。"},"examples":[{"en":"After two hours of news and social media, I felt overbrowsed and anxious.","zh":"刷了两个小时新闻和社交媒体后，我觉得自己信息过载，还很焦虑。"},{"en":"Take a break—you look overbrowsed.","zh":"休息一下吧——你看起来已经刷太多了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of content or a page) already viewed repeatedly by many people; heavily browsed.","zh":"（指内容/页面）被大量浏览过的；浏览量很高的。"},"examples":[{"en":"The homepage is overbrowsed during big sales.","zh":"大促期间首页会被大量浏览。"},{"en":"Try a less overbrowsed article if you want something new.","zh":"如果你想看点新东西，可以选一篇没那么多人点过的文章。"}]}],"synonyms":["overstimulated","information-overloaded","browsed too much","heavily viewed","well-trafficked"],"phonetic":"/ˌoʊvɚˈbraʊzd/","extraExplanation":["“overbrowsed”来自前缀 over-（过度）+ browse（浏览）。在日常英语里更常见的表达是 “I browsed too much” 或 “information overload（信息过载）”。“overbrowsed”偏口语/非正式，用来强调“刷得太多”的状态。"]}
{"word":"overbrowsing","summary":{"en":"Overbrowsing means excessive feeding on leaves and young plants by animals, causing ecological damage.","zh":"overbrowsing 指动物对叶片和幼苗的过度啃食，造成植被和生态系统受损。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive feeding by animals (especially deer, goats, or livestock) on leaves, shoots, or young trees, which damages plants and can change an ecosystem","zh":"（尤指鹿、山羊或家畜等）对植物叶、嫩枝或幼树的过度啃食，导致植被受损并可能改变生态系统"},"examples":[{"en":"Overbrowsing by deer prevented young trees from growing back in the forest.","zh":"鹿的过度啃食使森林里的幼树无法恢复生长。"},{"en":"The park introduced controlled hunting to reduce overbrowsing.","zh":"公园引入了控制性狩猎来减少过度啃食。"},{"en":"Scientists linked overbrowsing to fewer wildflowers and less habitat for insects.","zh":"科学家将过度啃食与野花减少、昆虫栖息地缩小联系起来。"}]}],"synonyms":["excessive browsing","overgrazing (related)","herbivore overuse","vegetation overuse"],"phonetic":"/ˌoʊvərˈbraʊzɪŋ/","extraExplanation":["“Overbrowsing”常见于生态学与野生动物管理语境，强调“数量过多的食草动物”对植被造成持续压力；与一般的“browsing（取食嫩枝叶）”不同，它带有明显的负面后果。","在北美语境中，这个词常与鹿群数量失衡有关：捕食者减少、狩猎不足或栖息地变化，都可能导致鹿数量上升，从而出现林下层（幼树、灌木、野花）被长期吃光的现象。","相关对比：browsing（取食嫩枝叶）vs. grazing（吃草地、啃食草本植物）；两者都可能出现“over-”的过度形式（overbrowsing / overgrazing）。"]}
{"word":"overbrush","summary":{"en":"Overbrush means to brush (or paint with a brush) too much, causing damage or an unnatural, heavy look.","zh":"Overbrush 指“刷过头/画过头”，因为过度刷拭或过多笔触而造成损伤或不自然的厚重感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to brush something too much or too strongly, so the surface gets damaged, rough, or messy","zh":"过度刷拭；刷得太多或太用力，导致表面受损、粗糙或变乱"},"examples":[{"en":"Don’t overbrush the fabric, or the fibers will start to look fuzzy.","zh":"别把布料刷得太狠，不然纤维会开始起毛。"},{"en":"He overbrushed the shoes and removed some of the polish.","zh":"他把鞋刷过头了，连一些鞋油都被刷掉了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to apply paint with too many brush strokes, making the painting look heavy, flat, or less natural","zh":"（绘画）笔触过多；画得过度，导致画面厚重、僵硬或不自然"},"examples":[{"en":"The background looked overbrushed, so she softened it with a lighter touch.","zh":"背景看起来笔触过重，所以她用更轻的手法把它处理柔和。"},{"en":"Try not to overbrush the sky—too many strokes can make it look muddy.","zh":"天空部分尽量别画过头——笔触太多会显得发灰、浑浊。"}]}],"synonyms":["overdo","brush too hard","overwork","scrub too much"],"phonetic":"/ˌoʊvərˈbrʌʃ/","extraExplanation":["“over-”是常见前缀，表示“过度/太过”（如 overcook 煮过头、overwork 过度工作）。因此 overbrush 通常指“刷过头”，在清洁、护理（如鞋子、布料）和绘画语境里都能用。","在艺术语境里，overbrush 常带一点评价意味：笔触太多会让画面失去空气感或层次；更自然的效果往往来自“少而准”的笔触。"]}
{"word":"overbrutal","summary":{"en":"“Overbrutal” means excessively brutal—too violent or cruel.","zh":"“overbrutal”指“过度残暴的”，强调暴力或残忍程度超出必要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively or unnecessarily brutal; more violent, harsh, or cruel than is reasonable or needed.","zh":"过度残暴的；过分粗暴/严苛的（指比合理或必要程度更暴力、更无情）。"},"examples":[{"en":"Many viewers felt the scene was overbrutal and distracted from the story.","zh":"很多观众觉得那一幕过度残暴，反而让人出戏。"},{"en":"The critic called the punishment overbrutal for such a small mistake.","zh":"评论家认为，对这样的小错误施加这种惩罚过于残暴。"},{"en":"Try to show the consequences without making the description overbrutal.","zh":"尽量呈现后果，但不要把描写写得过度血腥残暴。"}]}],"synonyms":["overly brutal","excessively brutal","unnecessarily brutal","savage","merciless","cruel"],"phonetic":"/ˌoʊvərˈbruːtəl/","extraExplanation":["“overbrutal”不是特别常见的标准词，更多是一种口语/写作中临时造词（over- + brutal），用来强调“残暴到过头”。在正式写作里，也常用“excessively brutal / unnecessarily brutal / overly brutal”来表达同样意思。","前缀 over- 常表示“过度、过头”（如 overwork 过度工作、overreact 反应过度），所以 overbrutal 的核心语感就是“比该有的更残忍”。"]}
{"word":"overbrutalities","summary":{"en":"“Overbrutalities” means excessive acts of brutality (plural) and is uncommon in everyday English.","zh":"“overbrutalities”指“过度的残暴行为”（复数），但在日常英语中不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive acts of cruelty or violence; brutalities that go beyond what is necessary or acceptable (plural).","zh":"过度的残暴行为；超出必要或可接受范围的暴行（复数）。"},"examples":[{"en":"The report condemned the overbrutalities committed during the crackdown.","zh":"报告谴责了镇压期间实施的过度暴行。"},{"en":"Even in war, leaders are expected to prevent overbrutalities against civilians.","zh":"即使在战争中，领导者也应当防止针对平民的过度残暴行为。"}]}],"synonyms":["excessive brutalities","extreme brutality","unnecessary brutality","atrocities","cruelties"],"phonetic":"/ˌoʊvɚbruˈtælətiz/","extraExplanation":["“overbrutalities”并不常见，更自然的表达通常是“excessive brutalities”“extreme brutality”或“unnecessary brutality”。","构词上可理解为：over-（过度）+ brutalities（暴行，brutality 的复数）。在正式写作中，用更常见的搭配会更清晰、更地道。"]}
{"word":"overbrutality","summary":{"en":"Overbrutality means excessive or unnecessary brutality.","zh":"overbrutality 指“过度残暴/不必要的暴力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or unnecessary brutality; more violence or cruelty than a situation reasonably requires.","zh":"过度残暴；不必要的暴力或残忍（超出合理需要的程度）。"},"examples":[{"en":"The report criticized the police for overbrutality during the protest.","zh":"报告批评警方在抗议活动中存在过度暴力。"},{"en":"Many viewers felt the film’s overbrutality distracted from the story.","zh":"许多观众觉得这部电影的过度残暴场面分散了故事重点。"}]}],"synonyms":["excessive brutality","undue force","unnecessary violence","overkill"],"phonetic":"/ˌoʊvɚbruˈtæləti/","extraExplanation":["这个词并不常见，更常见的表达是 excessive brutality（过度暴力/残暴）、undue force（不当用力/过度使用武力）或 police brutality（警察暴力）。","构词上是 over-（过度）+ brutality（残暴）。在新闻、法律评论或社会议题讨论中，有时会用来强调“超出必要限度”的暴力。"]}
{"word":"overbrutalization","summary":{"en":"Overbrutalization means excessive, unnecessary brutal treatment, or a broader tendency to intensify cruelty.","zh":"overbrutalization 指“过度残酷对待/过度暴力”，也可泛指让残酷不断升级的倾向或系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or unnecessary brutal treatment of someone; the act of making violence or cruelty worse than what is already severe.","zh":"对某人施加过度、没有必要的残酷对待；指把暴力或残忍程度推到“过头”的行为。"},"examples":[{"en":"The report warned that overbrutalization during arrests can destroy public trust.","zh":"报告警告说，逮捕过程中的过度残暴对待会摧毁公众信任。"},{"en":"Activists argued that the policy encourages overbrutalization instead of de-escalation.","zh":"活动人士认为，这项政策鼓励的是过度残暴而不是降温缓和。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader sense, a pattern or system that intensifies cruelty or harshness (for example, in institutions, media, or social conditions).","zh":"更广义地指一种模式或体制使残酷/严厉不断升级（如在机构、媒体或社会环境中）。"},"examples":[{"en":"Some critics see the film’s constant violence as a kind of overbrutalization of the story.","zh":"一些评论者认为电影持续的暴力呈现是一种对故事的“过度残酷化”。"},{"en":"Overbrutalization in the workplace can show up as routine humiliation and threats.","zh":"职场中的过度残酷化可能表现为日常羞辱与威胁。"}]}],"synonyms":["excessive brutality","unnecessary violence","overuse of force","escalation of violence","cruelty"],"phonetic":"ˌoʊvɚˌbruːtələˈzeɪʃən","extraExplanation":["这个词比较少见，更多见于学术、新闻评论或社会议题讨论（如执法、战争、制度性暴力）。日常口语里更常用的说法是 “excessive brutality / unnecessary violence / overuse of force”。","构词上是 over-（过度）+ brutalize（使残酷对待）+ -ation（名词后缀，表示“行为/过程”）。理解构词能帮助你读懂类似词：overcriminalization（过度刑事化）、overpolicing（过度执法）。"]}
{"word":"overbrutalize","summary":{"en":"Overbrutalize means to brutalize excessively—making something too violent, harsh, or cruel.","zh":"overbrutalize 指“过度施暴/过分残酷化”，让某事变得太暴力、太苛刻或太残忍。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to brutalize someone or something too much; to make something excessively violent, harsh, or cruel (more than is necessary or appropriate)","zh":"过度施暴；把某人/某事过分地变得残酷、暴力或苛刻（超过必要或合适的程度）"},"examples":[{"en":"The director didn’t want to overbrutalize the story, so he cut several graphic scenes.","zh":"导演不想把故事拍得过于残酷，所以删掉了几段过于血腥的镜头。"},{"en":"Some critics argued that the remake overbrutalized the characters to seem “gritty.”","zh":"一些评论家认为翻拍版为了显得“硬核”，把角色塑造得过分残暴。"},{"en":"When we punish children, we should never overbrutalize discipline into fear.","zh":"管教孩子时，绝不应该把纪律过度“残酷化”，变成恐惧。"}]}],"synonyms":["overdo","exaggerate","make too brutal","go too far","overharden"],"phonetic":"/ˌoʊvərˈbruːtəˌlaɪz/","extraExplanation":["这个词由前缀 over-（“过度、过分”）+ brutalize（“使残酷/施暴”）构成，属于可理解但不常见的“创造性用词”。在正式写作中，更常见的表达是 “make it too brutal / overly brutalize / go too far in brutalizing …”。","常见搭配语境：影评/文学评论（“把作品拍得过于暴力/残酷”）、社会讨论（“过度暴力化某种政策或手段”）。"]}
{"word":"overbrutalized","summary":{"en":"Overbrutalized means harmed or treated with excessive brutality; it’s the past participle/adjective form of “overbrutalize.”","zh":"overbrutalized 指“遭到过度残暴对待/施暴过度”，是 overbrutalize 的过去分词/形容词形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past participle/adj.) Treated with excessive brutality or harsh violence; harmed or punished far more than is reasonable or necessary.","zh":"（过去分词/形容词）被过度残暴地对待；遭受远超合理范围的暴力或严酷惩罚。"},"examples":[{"en":"Some critics argue the character is overbrutalized in the film to shock the audience.","zh":"一些影评人认为电影把这个角色写得过度受虐，是为了震撼观众。"},{"en":"The report warns that detainees were overbrutalized during interrogation.","zh":"报告警告说，被拘留者在审讯中遭到过度残暴对待。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt., past tense/past participle) To brutalize someone too much; to use excessive violence or cruelty against someone.","zh":"（及物动词，过去式/过去分词）对某人过度施暴；以过度残忍的方式对待某人。"},"examples":[{"en":"The writer said the script overbrutalized the villain instead of developing motives.","zh":"作者说剧本对反派的暴力描写过度，而没有好好塑造动机。"},{"en":"They accused the guards of having overbrutalized prisoners.","zh":"他们指控狱警对囚犯施暴过度。"}]}],"synonyms":["severely abused","brutally mistreated","subjected to excessive brutality","overpunished"],"phonetic":"/ˌoʊvɚˈbruːtəˌlaɪzd/","extraExplanation":["“overbrutalized”来自前缀 over-（过度）+ brutalize（使变残暴/虐待）。它不是特别常见的标准词，更多见于评论性写作（例如影评、社会评论、新闻报道）中，用来强调“过头了、过分残忍”。在正式写作中，也常用更常见的表达替代，如 “subjected to excessive brutality / severely abused / brutally mistreated”。"]}
{"word":"overbrutalizing","summary":{"en":"“Overbrutalizing” means using excessive brutality or cruelty toward someone or something.","zh":"“overbrutalizing”指对人或事物采取过度的残暴/残忍手段。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treating someone or something too brutally; using excessive force or cruelty (present participle/gerund of “overbrutalize”).","zh":"过度残暴地对待；使用过分的暴力或残忍手段（“overbrutalize”的现在分词/动名词）。"},"examples":[{"en":"The report warned that the policy could lead to overbrutalizing minor offenders.","zh":"报告警告说，这项政策可能导致对轻罪者的过度残暴对待。"},{"en":"He argued that overbrutalizing the protesters would only increase public anger.","zh":"他认为对抗议者采取过度残暴手段只会加剧公众愤怒。"}]}],"synonyms":["using excessive force","being overly harsh","overly brutal","cracking down too hard","maltreating"],"phonetic":"/ˌoʊvərˈbruːtəlaɪzɪŋ/","extraExplanation":["“overbrutalizing”并不是非常常见或固定的词，更多见于评论、新闻、学术写作或社交媒体中，用来强调“brutalizing（残酷对待）”的程度“过头了”。","构词法：over-（过度）+ brutalize（使残暴/残酷对待）→ overbrutalize（过度残酷对待）→ overbrutalizing（正在/持续过度残酷对待）。","更常见、自然的替代表达包括：“using excessive force（使用过度武力）”“being overly harsh（过于严厉）”“cracking down too hard（镇压/打击过猛）”。"]}
{"word":"overbrutally","summary":{"en":"“Overbrutally” means “too brutally”—in an excessively harsh or violent way.","zh":"“overbrutally”意为“过于残忍地/过于粗暴地”，强调超出合理程度的残酷或暴力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too brutal, harsh, or violent; more brutally than is acceptable or necessary.","zh":"过于残忍地；过于粗暴地；以不必要或不可接受的残酷方式。"},"examples":[{"en":"The critic said the movie treated its characters overbrutally, with violence that felt pointless.","zh":"影评人说这部电影对角色处理得过于残酷，暴力显得毫无必要。"},{"en":"He overbrutally punished the dog, and everyone around him was shocked.","zh":"他过于粗暴地惩罚那只狗，周围的人都很震惊。"},{"en":"Some people feel the police acted overbrutally during the protest.","zh":"有些人认为警方在抗议活动中执法过于粗暴。"}]}],"synonyms":["too brutally","excessively brutally","with unnecessary brutality","overly harshly"],"phonetic":"/ˌoʊvərˈbruːtəli/","extraExplanation":["“over-”这个前缀常表示“过度、太……”，加在形容词/副词前强调“超过合理程度”（如 overreact 反应过度，overconfident 过度自信）。因此 overbrutally 通常带强烈批评语气，暗示“本可以不必这么残忍”。","这个词在日常口语中不算常见，更常见的表达是 “too brutally” 或 “with unnecessary brutality”。"]}
{"word":"overbubbling","summary":{"en":"“Overbubbling” means bubbling excessively, often so much that it may boil over or create too many bubbles.","zh":"“overbubbling”表示“过度冒泡/起泡”，常指泡太多以至于可能溢出或影响质地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a liquid or mixture) bubbling too much or more than expected; bubbling excessively.","zh":"（液体或混合物）起泡/冒泡过多；沸腾或翻涌得过头。"},"examples":[{"en":"The soup started overbubbling as soon as I turned the heat up.","zh":"我刚把火开大，汤就开始过度冒泡了。"},{"en":"To prevent overbubbling, keep the pot partially covered and lower the heat.","zh":"为了防止过度冒泡，可以把锅盖半盖上并把火调小。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of bubbling too much; excessive bubbling.","zh":"过度冒泡的状态或过程；起泡过多。"},"examples":[{"en":"Overbubbling can make pasta water boil over and spill onto the stove.","zh":"过度冒泡会让煮意大利面的水溢出来，流到炉子上。"},{"en":"The brewer adjusted the temperature to reduce overbubbling during fermentation.","zh":"酿酒师调整了温度，以减少发酵时的过度冒泡。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overbubble”: to bubble too much or to make something bubble too much.","zh":"“overbubble”的现在分词：过度冒泡；使（某物）过度冒泡。"},"examples":[{"en":"The mixture is overbubbling—turn the heat down.","zh":"这混合物正在过度冒泡——把火关小。"},{"en":"If you keep whisking so fast, you’re overbubbling the batter.","zh":"你要是继续搅这么快，就会把面糊打出过多气泡。"}]}],"synonyms":["boiling over","bubbling too much","over-foaming","frothing excessively","effervescing too much"],"phonetic":"/ˌoʊvɚˈbʌbəlɪŋ/","extraExplanation":["“overbubbling”不是特别常见的标准词条，更常见的表达有：boiling over（沸腾溢出）、bubbling too much（冒泡太多）、over-foaming（过度起泡）。在食谱、酿造、发酵、化学实验等语境中更容易见到。","构词上是 over-（过度）+ bubble（冒泡）+ -ing（进行/状态）。作为形容词时常修饰 soup/water/mixture 等；作为名词时指“过度冒泡”这种现象。"]}
{"word":"overbuild","summary":{"en":"Overbuild means to build or develop too much, or to make something more complex than necessary.","zh":"overbuild 指“过度建设/过度开发”，也可指把某事做得过于复杂或规格过高。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to build more than is needed or sensible (too many buildings, too much space, or too much development)","zh":"过度建设；建得过多（房子、设施或开发量超过需要或合理范围）"},"examples":[{"en":"The city began to overbuild, and soon there were more apartments than people who wanted to rent them.","zh":"这座城市开始过度建设，很快公寓数量就超过了愿意租房的人。"},{"en":"Developers were warned not to overbuild near the coast.","zh":"有人警告开发商不要在海岸附近过度建设。"}]},{"partOfSpeech":"vt.","definition":{"en":"(often in tech/engineering) to make something more complex or powerful than necessary; to overengineer","zh":"（常用于科技/工程）把东西做得过于复杂或规格过高；过度设计"},"examples":[{"en":"We don’t need to overbuild the app—let’s keep the first version simple.","zh":"我们不需要把这个应用做得过度复杂——先把第一版做简单。"},{"en":"He tends to overbuild solutions instead of using a basic tool.","zh":"他常常把解决方案做得过度复杂，而不是用一个基本工具就够了。"}]}],"synonyms":["overdevelop","overconstruct","oversupply (housing)","overengineer","do too much"],"phonetic":"/ˌoʊvɚˈbɪld/","extraExplanation":["“over-”这个前缀表示“过度、超过正常或需要的程度”（如 overeat 吃太多，overwork 过度工作）。所以 overbuild 的核心就是“建/做得过头了”。","在房地产语境里，overbuild 常和 “housing market（住房市场）/vacancy（空置）/bubble（泡沫）”等话题一起出现；在工作场景里，它常带一点劝告语气：别把事情做得太大太复杂。"]}
{"word":"overbuilded","summary":{"en":"“Overbuilded” is nonstandard; use “overbuilt” (past/past participle of overbuild) to mean “built too much.”","zh":"“overbuilded”不标准；应使用“overbuilt”（overbuild 的过去式/过去分词），表示“建得过多/过度建设”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A mistaken past tense/past participle of “overbuild.” The standard form is “overbuilt.”","zh":"（非标准用法）“overbuild”的错误过去式/过去分词。标准形式是“overbuilt”。"},"examples":[{"en":"Nonstandard: The city has overbuilded in the last decade.","zh":"非标准：这座城市在过去十年里过度建设了。"},{"en":"Standard: The city has overbuilt in the last decade.","zh":"标准：这座城市在过去十年里过度建设了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard adjective) Built too much or more than needed; “overbuilt” is the usual adjective.","zh":"（少见/非标准形容词）建得过多、超过需要；通常用“overbuilt”。"},"examples":[{"en":"Nonstandard: The resort feels overbuilded for such a small island.","zh":"非标准：对这样一个小岛来说，这个度假村建得太多了。"},{"en":"Standard: The resort feels overbuilt for such a small island.","zh":"标准：对这样一个小岛来说，这个度假村建得太多了。"}]}],"synonyms":["overbuilt","overdeveloped","built up too much","overconstructed"],"phonetic":"/ˌoʊvɚˈbɪlt/","extraExplanation":["“overbuild”由 over-（过度）+ build（建造）构成，规则变化时常用过去式/过去分词“overbuilt”（类似 build→built）。因此“overbuilded”多被视为拼写或语法错误。","“overbuilt”既可作动词的过去式/过去分词（has overbuilt），也可作形容词（an overbuilt area = 过度开发的地区）。"]}
{"word":"overbuilding","summary":{"en":"Overbuilding means building too much—more buildings or space than needed, often causing oversupply.","zh":"Overbuilding 指过度建设——建得太多、超出需求，常导致供过于求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of building too much (too many buildings or too much space), especially in a way that creates oversupply and waste","zh":"过度建设；建得太多（楼/面积过量），尤指导致供过于求与浪费"},"examples":[{"en":"The city’s overbuilding led to many empty apartments.","zh":"这座城市的过度建设导致许多公寓空置。"},{"en":"After years of overbuilding, prices started to fall.","zh":"经过多年的过度建设后，价格开始下跌。"},{"en":"Experts warned that overbuilding could hurt the local economy.","zh":"专家警告说，过度建设可能会伤害当地经济。"}]},{"partOfSpeech":"n.","definition":{"en":"(in construction/engineering) building more than needed, or making a structure larger/stronger than necessary","zh":"（建筑/工程）建造超出需求；把结构做得过大或过度加固"},"examples":[{"en":"Overbuilding the bridge increased costs without improving safety much.","zh":"把桥梁过度加固增加了成本，但对安全提升不大。"},{"en":"The project was criticized for overbuilding instead of using a simpler design.","zh":"该项目因过度建设而不是采用更简单的设计而受到批评。"}]}],"synonyms":["overdevelopment","excess construction","overexpansion","oversupply (in real estate context)"],"phonetic":"/ˌoʊvɚˈbɪldɪŋ/","extraExplanation":["“overbuilding”常见于房地产与城市规划语境，强调“供给超过真实需求”，结果可能是空置率上升、资金占用、维护成本增加，甚至引发房价/租金下行。","也可用于工程语境，指“为求保险而做得过大/过强”，不一定违法，但常被认为效率低、成本高。"]}
{"word":"overbuilds","summary":{"en":"“Overbuilds” means builds too much or adds extra construction on/over an existing structure (it’s the third-person singular of “overbuild”).","zh":"“Overbuilds”指过度建设，或在既有建筑之上/之内加建（是“overbuild”的第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person, company, or city) to build too many buildings, or build more than is needed, often causing waste or later problems (like empty apartments).","zh":"（人、公司或城市）过度建设；建得太多或超过需求，常导致浪费或后续问题（如空置房）。"},"examples":[{"en":"The city overbuilds when it approves too many luxury condos at once.","zh":"当这座城市一次性批准太多高端公寓时，就会出现过度建设。"},{"en":"Some developers overbuild and then struggle to sell the units.","zh":"一些开发商过度建设，之后很难把房子卖出去。"}]},{"partOfSpeech":"vt.","definition":{"en":"to build additional structures on top of or over an existing building or space (especially in real estate).","zh":"（尤指房地产）在原有建筑或空间之上/之内加建、叠建。"},"examples":[{"en":"The owner overbuilds the old shop by adding two floors.","zh":"房主在旧商铺上加建两层。"},{"en":"The plan overbuilds the courtyard with a glass roof.","zh":"该方案在院子上方加建玻璃顶棚。"}]}],"synonyms":["overdevelop","overconstruct","build up excessively","overexpand"],"phonetic":"ˌoʊvərˈbɪld","extraExplanation":["“overbuilds”通常是动词“overbuild”的第三人称单数（He/She/It overbuilds）。在新闻与商业语境里，更常见名词“overbuilding”（过度建设）来描述房地产供给过剩。"]}
{"word":"overbuilt","summary":{"en":"Overbuilt means built too heavily/complexly for its purpose, or (in real estate) built in excessive quantity.","zh":"Overbuilt 指为用途而言建得过于结实或复杂；也可指（房地产）开发过度、建造数量过多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Built more heavily, strongly, or elaborately than necessary; too big or too complex for its purpose.","zh":"建得过于结实或复杂的；为用途而言过大、过度设计的。"},"examples":[{"en":"The app feels overbuilt for such a simple task.","zh":"这个应用为了这么简单的任务显得过度设计。"},{"en":"Their house is overbuilt, with thick walls and extra supports that they don’t really need.","zh":"他们的房子建得过于结实，有很厚的墙和额外的支撑，其实并不需要。"}]},{"partOfSpeech":"adj.","definition":{"en":"Built too much in a place (too many buildings or homes compared with demand).","zh":"（某地区）开发过度的；建造数量超过需求的。"},"examples":[{"en":"Some coastal towns became overbuilt after years of rapid development.","zh":"一些海滨小镇在多年快速开发后变得开发过度。"},{"en":"The market is overbuilt, so rents are starting to fall.","zh":"市场供给过多（开发过度），所以租金开始下降。"}]}],"synonyms":["overengineered","too elaborate","excessively built","oversupplied"],"phonetic":"/ˌoʊvɚˈbɪlt/","extraExplanation":["“over-”表示“过度、超过需要”。“overbuilt”常见于两类语境：①形容产品/系统“为小需求做了大工程”（类似“overengineered”）；②房地产语境指“房子或楼建得太多”，接近“oversupplied”。","近义表达：overengineered（过度工程化）、too elaborate（过于复杂）、oversupplied（供给过剩，房地产/市场）。反义表达：streamlined（精简的）、well-designed（设计恰当的）。"]}
{"word":"overbulk","summary":{"en":"“Overbulk” means to make something too bulky, or the state/amount of being excessively bulky.","zh":"“Overbulk”指把某物弄得过于臃肿，或“过度臃肿/体积过大”的状态与程度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(vt.) To make something too bulky or too large in volume, often so it becomes inefficient, awkward, or out of proportion.","zh":"（及物动词）使……过于臃肿/体积过大，常导致不够高效、不方便或比例失衡。"},"examples":[{"en":"Try not to overbulk the backpack with extra shoes—you’ll regret the weight.","zh":"背包别塞太多鞋把它弄得过于臃肿——你会后悔那么重。"},{"en":"Adding too many features can overbulk the app and confuse new users.","zh":"功能加得太多会让应用变得过于臃肿，反而让新用户困惑。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) Excessive bulk; an amount of size/volume that is more than needed.","zh":"（名词）过度的体积/臃肿；超过需要的尺寸或容量。"},"examples":[{"en":"The jacket’s overbulk makes it hard to move your arms freely.","zh":"这件夹克太臃肿，让你很难自如地活动手臂。"},{"en":"We reduced the overbulk in the packaging to save shipping costs.","zh":"我们减少了包装的过度体积来节省运费。"}]}],"synonyms":["excess bulk","unnecessary bulk","bulk up too much","overstuff","make bulky"],"phonetic":"ˌoʊvɚˈbʌlk","extraExplanation":["“Overbulk”不是日常高频词，更常见的表达是“make something too bulky / add unnecessary bulk / excessive bulk”。它多出现在工程、包装、产品设计、软件功能讨论等语境里，用来强调“多出来的体积/复杂度带来的负担”。","在写作中，它带有轻微的批评意味：不是单纯“变大”，而是“变得大到不划算、笨重或不协调”。"]}
{"word":"overbulkily","summary":{"en":"“Overbulkily” means “in an overly bulky, awkwardly large/heavy way.”","zh":"“overbulkily”表示“过于臃肿/笨重地（以显得太大太重的方式）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly bulky way; so large, thick, or heavy that it feels excessive, awkward, or inefficient.","zh":"以过于笨重/臃肿的方式；大到、厚到或重到显得多余、不方便或不够高效。"},"examples":[{"en":"The coat hung overbulkily on his small frame.","zh":"那件外套在他瘦小的身形上显得过于臃肿。"},{"en":"She packed overbulkily for a weekend trip and struggled to close her suitcase.","zh":"她周末出行打包得过于笨重，行李箱都很难合上。"},{"en":"The design was overbulkily reinforced, adding weight without improving safety much.","zh":"这个设计加固得过于笨重，增加了重量却没明显提升安全性。"}]}],"synonyms":["too bulkily","overly","excessively","cumbersomely","awkwardly"],"phonetic":"/ˌoʊvərˈbʌkəli/","extraExplanation":["“overbulkily”由 over-（过度）+ bulky（笨重的/臃肿的）+ -ly（副词后缀）构成，表示“过度地显得笨重”。在现代英语中较少见，更常用的表达包括：“too bulkily / in an overly bulky way / overly bulky（作形容词）”。","它常用来评价衣物、行李、包装、设计或结构等“体积/重量超过需要”的情况，语气偏批评或不满。"]}
{"word":"overbulkiness","summary":{"en":"Overbulkiness means being too bulky—excessively large or heavy in an inconvenient way.","zh":"Overbulkiness 指“过于笨重/体积过大”，大到不方便或显得不够高效。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too large, thick, or heavy in a way that is inconvenient, awkward, or inefficient.","zh":"过于庞大、笨重或厚重的特性（以至于不方便、显得笨拙或效率低）。"},"examples":[{"en":"The overbulkiness of the winter coat made it hard to move freely.","zh":"这件冬外套太过笨重，让人很难活动自如。"},{"en":"Engineers reduced the overbulkiness of the device so it could fit in a pocket.","zh":"工程师降低了设备的过度体积，让它能放进口袋。"},{"en":"Some readers complained about the overbulkiness of the book, even though the content was excellent.","zh":"尽管内容很棒，一些读者还是抱怨这本书太厚太重、不方便携带。"}]}],"synonyms":["excessive bulk","unnecessary bulk","cumbersomeness","heaviness","awkwardness"],"phonetic":"/ˌoʊvɚˈbʌlkinəs/","extraExplanation":["“overbulkiness”不是非常常见的标准词汇，更常见的说法是“bulkiness”（笨重/体积大）或用句子表达“too bulky / overly bulky”。它是由前缀“over-”（过度）+ “bulky”（庞大、笨重）+ 名词后缀“-ness”（性质）组合而成，用来强调“过度的笨重/体积大”。","在写作中，如果想更自然，可以根据语境改用：“excessive bulk / unnecessary bulk / too much bulk”，在工程、产品设计、服装等场景尤其常见。"]}
{"word":"overbulky","summary":{"en":"Overbulky means excessively bulky—too big or heavy to be convenient.","zh":"Overbulky 指“过于笨重/庞大”，大到不方便使用或携带。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too large, thick, or heavy for what is needed; awkwardly big and hard to handle or wear.","zh":"过于庞大或笨重（超过需要的程度）；显得累赘、不好携带或穿戴。"},"examples":[{"en":"The winter coat looked warm, but it was overbulky for everyday commuting.","zh":"那件冬衣看起来很暖和，但对每天通勤来说太笨重了。"},{"en":"We replaced the overbulky packaging with a smaller box to save space.","zh":"我们把过于庞大的包装换成了更小的盒子来节省空间。"},{"en":"Her backpack felt overbulky because she packed two textbooks she didn’t need.","zh":"她的背包显得特别臃肿笨重，因为她装了两本不需要的课本。"}]}],"synonyms":["too bulky","overly bulky","cumbersome","unwieldy","clunky"],"phonetic":"/ˌoʊvɚˈbʌlki/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常或需要的程度”。所以 overbulky 带有“太……了”的评价色彩，常用于衣物、包装、设备、设计等语境。","在日常英语里，很多人更常用 bulky / too bulky / overly bulky 来表达类似意思；overbulky 属于可理解但相对少见的写法。"]}
{"word":"overbumptious","summary":{"en":"Overly pushy and self-important; arrogantly confident.","zh":"过分咄咄逼人、自以为是；自负到让人反感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively self-important, pushy, or arrogantly confident; even more so than “bumptious.”","zh":"过分自以为是、爱出风头、咄咄逼人的；比“bumptious（傲慢冒失）”更夸张。"},"examples":[{"en":"He was overbumptious in the meeting, interrupting everyone as if he ran the company.","zh":"他在会议上过分咄咄逼人，老打断别人，好像公司是他开的。"},{"en":"Her overbumptious tone made the friendly discussion feel like a contest.","zh":"她那种过分自负的语气把原本友好的讨论弄得像比赛一样。"}]}],"synonyms":["pushy","overconfident","cocky","arrogant","self-important","bumptious"],"phonetic":"/ˌoʊvɚˈbʌm(p)ʃəs/","extraExplanation":["“overbumptious”不是非常常见的标准词，更像是带点幽默或夸张效果的写法：在“bumptious（自负、冒失、爱出头）”前加上“over-（过度）”，强调“太过分了”。","语气上通常带有批评或讽刺：不是单纯“自信”，而是“自信过头、让人不舒服”。","更常见的表达包括：overconfident（过度自信）、pushy（咄咄逼人）、cocky（自负的）。"]}
{"word":"overbumptiously","summary":{"en":"“Overbumptiously” means acting or speaking in a way that is too pushy and self-important.","zh":"“overbumptiously”指以过分强势、过度自信、带点自以为是甚至冒失无礼的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly confident and pushy way; too self-important or presumptuous.","zh":"以过分自信、咄咄逼人、过于自以为是（甚至有点冒失、无礼）的方式。"},"examples":[{"en":"He spoke overbumptiously, as if everyone owed him an apology.","zh":"他说话过分自以为是，好像所有人都欠他一句道歉。"},{"en":"She didn’t mean to be rude—she just answered overbumptiously in the meeting.","zh":"她并非故意无礼——只是开会时回答得有些过分强势。"}]}],"synonyms":["arrogantly","overconfidently","pushily","presumptuously","self-importantly","cockily"],"phonetic":"ˌoʊvərˈbʌmpʃəsli","extraExplanation":["“overbumptiously”来自形容词“overbumptious”（过分自负/咄咄逼人）+ 副词后缀“-ly”。其中“bumptious”常形容一个人自信到有点讨人嫌（爱出风头、爱指挥、很冒进）。加上“over-”强调“过头了”。","这个词非常少见、偏文学或幽默夸张的语气；日常更常用“overconfidently / arrogantly / pushily”。","语气差别：overbumptiously往往带有“莽撞的自信”和“越界的强势”，不只是“骄傲（proud）”，而是“自以为是到让人不舒服”。"]}
{"word":"overbumptiousness","summary":{"en":"Overly pushy, rude self-confidence; excessive arrogance.","zh":"过分咄咄逼人、自以为是的自信；过度傲慢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive self-confidence in a rude or pushy way; overly forward, arrogant behavior (the quality of being overbumptious).","zh":"过分自信而显得粗鲁、咄咄逼人；过度自大和冒失的行为（“overbumptious”的名词形式）。"},"examples":[{"en":"His overbumptiousness in meetings made coworkers feel ignored.","zh":"他在会议上的过分咄咄逼人让同事觉得被忽视。"},{"en":"The interview panel mistook her overbumptiousness for strong leadership.","zh":"面试官一度把她的过度自大误认为很有领导力。"},{"en":"A little confidence helps, but overbumptiousness can hurt your reputation.","zh":"适度自信有帮助，但过分自大可能损害你的名声。"}]}],"synonyms":["arrogance","pushiness","overconfidence","cockiness","conceit"],"phonetic":"/ˌoʊvərˈbʌm(p)ʃəsnəs/","extraExplanation":["“bumptious”常指一种“很有自信但让人不舒服”的态度：爱出风头、插话、显得粗鲁或自以为是；加上前缀“over-”表示“过度”，所以“overbumptiousness”强调“过头了的咄咄逼人/自大”。","这是较少见、偏书面或幽默讽刺的词；更常用的近义表达有“arrogance / pushiness / overconfidence”。"]}
{"word":"overburden","summary":{"en":"Overburden means to load someone or something with too much work, responsibility, stress, or weight.","zh":"overburden 指让人或物承受过多的工作、责任、压力或重量，以至于难以承担。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone or something more work, responsibility, or weight than they can reasonably handle","zh":"使（某人或某物）负担过重；加重（工作、责任或重量）到难以承受"},"examples":[{"en":"Don’t overburden yourself with too many commitments.","zh":"别用太多承诺把自己压得喘不过气。"},{"en":"The extra paperwork overburdened the staff.","zh":"额外的文书工作让员工不堪重负。"},{"en":"Be careful not to overburden the shelf with heavy boxes.","zh":"小心别在架子上放太多重箱子导致承重过大。"}]}],"synonyms":["overload","weigh down","saddle (with)","encumber"],"phonetic":"/ˌoʊvɚˈbɝdən/","extraExplanation":["“over-”表示“过度/超过”，burden表示“负担”。合在一起就强调“超过承受范围”。","语气上常带有“这样做不合理、会造成压力或损害”的暗示，既可指工作/心理压力，也可指物理承重。","常见搭配：overburdened with (work/debt/responsibilities)（被……压得喘不过气）。也常用形容词：overburdened workers（负担过重的工人/员工）。"]}
{"word":"overburdened","summary":{"en":"Overburdened means having more work or responsibility than you can reasonably handle.","zh":"overburdened 指承担的工作或责任超出合理承受范围，因而不堪重负。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much work, responsibility, or pressure; loaded with more than is manageable.","zh":"负担过重的；不堪重负的（工作、责任或压力太多，难以承受）。"},"examples":[{"en":"She felt overburdened with schoolwork and a part-time job.","zh":"她同时要应付课业和兼职工作，感到负担过重。"},{"en":"Hospitals can become overburdened during flu season.","zh":"流感季时，医院可能会不堪重负。"},{"en":"Don’t take on extra tasks if you’re already overburdened.","zh":"如果你已经不堪重负，就别再接额外的任务了。"}]}],"synonyms":["overloaded","overworked","swamped","weighed down","burdened","strained"],"phonetic":"/ˌoʊvɚˈbɝːdənd/","extraExplanation":["词源上由 over-（过度）+ burden（负担）构成，强调“超出正常承受范围”。常用于描述人（overburdened employees）、系统/机构（overburdened courts/hospitals）或资源（overburdened staff）。","常见搭配：overburdened with + 名词（overburdened with debt/chores/responsibilities）；become/grow overburdened；feel overburdened。语气多为中性到负面，含“需要减负”的暗示。","近义词辨析：overworked 更强调“工作时间长/工作量大”；stressed 强调“心理压力”；overburdened 强调“承担的责任或负担太多”这一原因。"]}
{"word":"overburdening","summary":{"en":"“Overburdening” means adding too much work, responsibility, or pressure, so someone or something becomes overloaded.","zh":"“overburdening”指施加过多工作、责任或压力，使人或事物超负荷、不堪重负。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Putting too much work, responsibility, or pressure on someone or something; making it harder than it should be.","zh":"给某人或某事物加上过多的工作、责任或压力；使其不堪重负。"},"examples":[{"en":"Overburdening students with homework can reduce their motivation to learn.","zh":"给学生布置过多作业可能会降低他们的学习动力。"},{"en":"The new rules are helpful, but overburdening small businesses with paperwork can be harmful.","zh":"新规很有帮助，但让小企业承担过多文书工作可能会有害。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of giving someone or something too much to carry, do, or handle.","zh":"使某人或某事物承担过多负担（工作/压力/责任）的行为或过程。"},"examples":[{"en":"Overburdening of nurses often leads to burnout and higher turnover.","zh":"让护士长期超负荷工作往往会导致职业倦怠和更高的离职率。"},{"en":"They discussed ways to prevent the overburdening of the power grid during heat waves.","zh":"他们讨论了在热浪期间如何避免电网负荷过重。"}]}],"synonyms":["overloading","overworking","overtaxing","overstraining","encumbering"],"phonetic":"/ˌoʊvɚˈbɝdənɪŋ/","extraExplanation":["“overburdening”来自动词“overburden”（使负担过重）。日常写作中常见两种用法：\n1) 作形容词：overburdening workload（令人不堪重负的工作量）；\n2) 作名词/动名词：the overburdening of staff（对员工的过度加压）。\n常与with连用：overburden someone with responsibilities（让某人承担过多责任）。"]}
{"word":"overburdeningly","summary":{"en":"“Overburdeningly” means “in an excessively burdensome way.”","zh":"“overburdeningly”表示“以负担过重、过于沉重的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that places too much work, responsibility, or pressure on someone or something; excessively and unfairly heavily.","zh":"以让人或事物负担过重的方式；过度地、沉重地（常带不公平或难以承受之意）。"},"examples":[{"en":"The team was overburdeningly short-staffed, so deadlines kept slipping.","zh":"团队人手少得让人负担过重，所以截止日期一再延后。"},{"en":"She was overburdeningly responsible for both childcare and full-time work.","zh":"她同时承担育儿和全职工作，责任重得让人难以承受。"},{"en":"The rules were applied overburdeningly to small businesses.","zh":"这些规定对小企业执行得过于苛重，造成沉重负担。"}]}],"synonyms":["excessively","too heavily","unduly","oppressively"],"phonetic":"/ˌoʊvɚˈbɝdənɪŋli/","extraExplanation":["“overburdeningly”在日常英语中比较少见，写作或口语里更常用的替代词有：“excessively”（过度地）、“too heavily”（过于沉重地）、“unduly”（过分地/不适当地）。","词形上是 overburden（使负担过重）→ overburdening（令人负担过重的）→ overburdeningly（以…方式）。用于强调“负担大到不合理/难以承受”的程度。"]}
{"word":"overburdens","summary":{"en":"“Overburdens” means “puts too much burden or responsibility on someone/something.”","zh":"“overburdens”表示“使（某人/某物）负担过重，施加过多责任或压力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone or something too much work, responsibility, or weight; to load beyond what is reasonable or safe","zh":"使（某人/某物）负担过重；施加过多的工作、责任或重量（超过合理或安全范围）"},"examples":[{"en":"The new reporting system overburdens teachers with extra paperwork.","zh":"新的汇报系统用额外的文书工作让老师负担过重。"},{"en":"If the truck overburdens the bridge, it could cause damage.","zh":"如果卡车让桥梁承受过重负荷，可能会造成损坏。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to put too many emotional demands on someone","zh":"（较少见）在情感上对某人提出过多要求，使其压力过大"},"examples":[{"en":"He tries not to overburden his friends with his worries.","zh":"他尽量不把自己的担忧过多地压在朋友身上。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, as a noun) excessive burdens; too many obligations or loads","zh":"（罕见，作名词复数）过重的负担；过多的义务或负载"},"examples":[{"en":"She spoke about the overburdens many caregivers face.","zh":"她谈到了许多照护者面临的沉重负担。"}]}],"synonyms":["overload","weigh down","encumber","tax","strain","burden"],"phonetic":"ˌoʊvərˈbɝdənz","extraExplanation":["“overburdens”通常是动词“overburden”的第三人称单数（He/She/It overburdens...）。词根“burden”是“负担”，加上前缀“over-”表示“过度、超过限度”，所以整体意思是“负担过重”。","在正式写作里更常见的形式是动词原形/过去式（overburden/overburdened），名词用法“overburdens”相对少见。"]}
{"word":"overburdensome","summary":{"en":"Overburdensome means excessively burdensome—too heavy, costly, or demanding to be reasonable.","zh":"overburdensome 指“负担过重的”，即过于沉重、昂贵或要求过高，超过合理范围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too heavy or difficult to handle; placing an excessive load of work, cost, or responsibility on someone or something.","zh":"过于沉重或难以承担的；给某人或某事施加过多工作、费用或责任的。"},"examples":[{"en":"The paperwork became overburdensome for a small team.","zh":"对一个小团队来说，这些文书工作变得过于沉重。"},{"en":"High fees can be overburdensome for low-income families.","zh":"高额费用可能会让低收入家庭不堪重负。"},{"en":"We need a policy that protects workers without being overburdensome to employers.","zh":"我们需要一项既保护工人、又不会过度增加雇主负担的政策。"}]}],"synonyms":["too demanding","oppressive","onerous","excessive","unduly burdensome"],"phonetic":"/ˌoʊvɚˈbɝːdnsəm/","extraExplanation":["这个词常见于正式语境（政策、法律、商业写作），用来表达“负担过重”的担忧，语气比 overworked（工作过度）更广，既可以指工作量，也可以指费用、手续、责任等。","构词：over-（过度）+ burdensome（负担重的）。burden 原意是“担子/负担”，因此 overburdensome 强调“超出合理承受范围”。"]}
{"word":"overburn","summary":{"en":"Overburn means to burn something too much, or to burn too intensely/too long, causing damage or poor results.","zh":"Overburn 指“烧得过头”或“燃烧过猛/过久”，从而导致焦糊、损坏或效果变差。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to burn something too much, so it becomes damaged, too dark, or unusable (often in cooking or processing)","zh":"（把某物）烧得过头；烤糊；因过度燃烧而损坏（常用于烹饪或加工）"},"examples":[{"en":"I overburned the toast, so it tastes bitter.","zh":"我把吐司烤糊了，所以吃起来发苦。"},{"en":"Be careful not to overburn the sauce—keep the heat low and stir often.","zh":"小心别把酱汁煮糊了——用小火并经常搅拌。"},{"en":"If the kiln overburns the clay, the pieces can warp or crack.","zh":"如果窑烧过度，陶土制品可能会变形或开裂。"}]},{"partOfSpeech":"vi.","definition":{"en":"to burn too intensely or for too long (so the fire or heat becomes excessive)","zh":"（火/热）燃烧过猛或过久；过度燃烧"},"examples":[{"en":"The furnace can overburn if the airflow is too high.","zh":"如果进风量过大，炉子可能会燃烧过猛。"},{"en":"Dry wood may overburn and raise the temperature too quickly.","zh":"干木头可能会烧得太猛，让温度升得过快。"}]}],"synonyms":["burn too much","overcook","scorch","char","burn up"],"phonetic":"/ˌoʊvərˈbɝn/","extraExplanation":["“overburn”在日常英语里不算常见，更常用的说法是“burn (something) too much / overcook / scorch”。不过在烘焙、窑炉、工业燃烧等语境中，用“overburn”可以更直接地表达“烧过度”。"]}
{"word":"overburned","summary":{"en":"Overburned means burned or cooked too much, usually making food too dark or bitter.","zh":"overburned 指“烧（烤、煮）过头”，常形容食物因过度加热而焦黑发苦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Burned too much; cooked or heated for too long so that the surface becomes very dark, bitter, or charred.","zh":"烧过头的；烤（煮）过度的，因加热太久而变得焦黑、发苦或炭化。"},"examples":[{"en":"The toast is overburned, so it tastes bitter.","zh":"这片吐司烤过头了，所以吃起来发苦。"},{"en":"I turned down the heat because the onions were getting overburned.","zh":"我把火调小了，因为洋葱快要炒糊了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Burned beyond the intended level, such as wood, fuel, or materials that were scorched too heavily.","zh":"（较少见）烧得超过需要的程度；材料（如木头、燃料等）被烧焦得太厉害。"},"examples":[{"en":"Some parts of the wooden frame were overburned and had to be replaced.","zh":"木框有些部分烧得太焦了，只能更换。"}]}],"synonyms":["overcooked","charred","scorched","burned to a crisp"],"phonetic":"/ˌoʊvɚˈbɝnd/","extraExplanation":["“overburned”是由“over-（过度）+ burned（烧过/烧焦的）”构成，常用于食物情境，语气比单纯的“burned”更强调“过头”。","日常更常说“overcooked（煮过头）”“burnt/ burned to a crisp（烤/烧得很脆、很焦）”。在美式英语里，过去分词通常写作“burned”（英式也常见“burnt”）。"]}
{"word":"overburningly","summary":{"en":"“Overburningly” means “in an excessively burning/overly hot way,” used literally or figuratively and is quite rare.","zh":"“overburningly”意为“灼热得过分地/燃烧得过度地”，可作字面或比喻用法，且非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively burning or overly hot way; with too much heat or burning intensity (literal or figurative).","zh":"以过度燃烧或过热的方式；带着过强的灼热感（可指字面或比喻）。"},"examples":[{"en":"The metal glowed overburningly in the furnace, risking damage to the mold.","zh":"金属在炉中灼热得过分，可能会损坏模具。"},{"en":"Under the noon sun, the sand felt overburningly hot on bare feet.","zh":"正午的太阳下，沙子烫得过分，赤脚踩上去很难受。"},{"en":"His shame returned overburningly, as if it could scorch his thoughts.","zh":"他的羞愧感强烈地涌回，仿佛会灼伤他的思绪。"}]}],"synonyms":["scorchingly","intensely","painfully","too hot","overheatingly"],"phonetic":"/ˌoʊvɚˈbɝːnɪŋli/","extraExplanation":["“overburningly”非常少见，多数情况下人们会用更常见的表达来替代，比如“too hot / intensely / painfully hot / scorching(ly)”。它是由“over-（过度）+ burning（燃烧/灼热）+ -ly（副词）”构成，读起来有些文学化或刻意强调的感觉。","如果你在阅读中遇到它，通常是在强调“过头了、已经到了不舒服或有危险的程度”的‘热/灼烧’，既可以是物理温度，也可以是情绪（羞愧、渴望、愤怒）等比喻性的“灼热”。"]}
{"word":"overburnt","summary":{"en":"Overburnt means burned too much, especially food cooked too long; it can also mean “overdone” in a figurative sense.","zh":"overburnt 指“烧焦/烤过头”，多用于食物；也可比喻“做得过度、用力过猛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Burned too much; cooked for too long so the surface becomes very dark, dry, or bitter.","zh":"烤/烧过头的；煮太久导致表面变得很黑、很干或发苦。"},"examples":[{"en":"The toast is overburnt—let’s make a new slice.","zh":"这片吐司烤过头了——我们再烤一片吧。"},{"en":"The cookies came out overburnt and tasted bitter.","zh":"饼干烤得过头，吃起来有点苦。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Done too strongly or too much; overdone in style or effect.","zh":"（比喻）过度的；用力过猛、效果做得太过。"},"examples":[{"en":"The joke felt overburnt after being repeated all night.","zh":"这个笑话讲了一整晚，听起来就有点“过度使用”了。"}]}],"synonyms":["burnt","overcooked","charred","scorched","overdone"],"phonetic":"/ˌoʊvɚˈbɝnt/","extraExplanation":["“overburnt”在口语里能用，但更常见的拼法是“overburned”（美式）或“overburnt”（偏英式/较少见）。","它由 over-（过度）+ burnt/burned（烧焦的）构成，常用来形容食物；形容“风格/表达过头”的比喻用法相对少一些，但在口语中也能理解。"]}
{"word":"overburst","summary":{"en":"Overburst is a rare word meaning “to burst out violently/suddenly,” or (very rarely) “an outburst.”","zh":"Overburst 是个较罕见的词，表示“猛烈或突然地爆发/涌出”；极少情况下也可作名词表示“一次爆发”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to burst out suddenly and strongly; to break out in a rush (often used about feelings, water, light, or action).","zh":"（罕见）突然猛烈地爆发；骤然涌出（常用于情绪、水流、光线或行动等）。"},"examples":[{"en":"Anger overburst in his voice, and everyone fell silent.","zh":"他的声音里怒气骤然爆发，大家都安静了。"},{"en":"After days of rain, the river seemed ready to overburst its banks.","zh":"连日大雨后，河水似乎快要漫过河岸、猛然决堤了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) a sudden bursting out; an outburst.","zh":"（极罕见）突然的爆发；喷涌；（同 outburst）。"},"examples":[{"en":"Her laughter came in an overburst that surprised even her.","zh":"她突然爆发出一阵笑声，连她自己都惊到了。"}]}],"synonyms":["burst out","break out","erupt","flare up","outburst"],"phonetic":"/ˌoʊvərˈbɝst/","extraExplanation":["“overburst”在现代英语中非常少见，多带有文学/诗歌色彩。日常表达更常用“burst out / break out / erupt / outburst”。","前缀“over-”常有“过度、越过、覆盖”的感觉，所以“overburst”往往强调“冲破边界、喷涌而出”的力度（例如河水漫堤、情绪失控）。"]}
{"word":"overburthen","summary":{"en":"Overburthen means to put too much burden or responsibility on someone or something (an older form of overburden).","zh":"overburthen 表示让某人或某事物负担过重（是 overburden 的较旧拼写/形式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to burden someone or something too much; to load with more work, weight, or responsibility than is reasonable","zh":"使（人或事物）负担过重；加诸超过合理范围的工作、重量或责任"},"examples":[{"en":"Don’t overburthen yourself with extra duties if you’re already exhausted.","zh":"如果你已经很疲惫了，就别再用额外职责把自己压得喘不过气。"},{"en":"The small team was overburthened by unrealistic deadlines.","zh":"这个小团队因不切实际的截止日期而负担过重。"}]}],"synonyms":["overburden","overload","weigh down","encumber"],"phonetic":"/ˌoʊvɚˈbɝðən/","extraExplanation":["“overburthen”是较古老的拼写与用法，现代英语更常见的是“overburden”。两者意思相同，都表示“使负担过重”。","词根思路：over-（过度）+ burden/burthen（负担）。其中“burthen”本身也是“burden”的旧式拼写，常见于较老的文学或法律文体。"]}
{"word":"overbusily","summary":{"en":"Overbusily means “in an excessively busy, often rushed or stressed way.”","zh":"overbusily 表示“过于忙碌地（常带忙乱、紧张的意味）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively busy way; so busy that it seems unnecessary, stressed, or not well organized.","zh":"过于忙碌地；忙得过头、显得紧张或不够有条理地。"},"examples":[{"en":"She moved overbusily from meeting to meeting and forgot to eat lunch.","zh":"她过于忙碌地在一个会议赶到另一个会议，连午饭都忘了吃。"},{"en":"The office ran overbusily before the deadline, and small mistakes started to appear.","zh":"截止日期前办公室忙得过头，一些小错误开始出现。"}]}],"synonyms":["too busily","overly","excessively","frantically","rushedly"],"phonetic":"/ˌoʊvɚˈbɪzɪli/","extraExplanation":["“overbusily”= over-（过度）+ busily（忙碌地）。这个词在日常口语中不算常见，更常用的表达有：“too busily / overly busy / in a frantic way / rushed”。","在语气上，“overbusily”常带一点评价：不仅是“很忙”，还暗示“忙得不必要、忙乱、或效率不高”。"]}
{"word":"overbusiness","summary":{"en":"Overbusiness means excessive busyness or more business than can be handled well.","zh":"Overbusiness 指过度忙碌，或生意/事务多到难以应付。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive busyness or too many business affairs; being overloaded with work or business.","zh":"过度忙碌；事务/生意过多导致的超负荷状态。"},"examples":[{"en":"The team’s overbusiness caused mistakes that could have been avoided with a slower pace.","zh":"团队的过度忙碌导致了一些本可通过放慢节奏避免的错误。"},{"en":"She stepped back from overbusiness to protect her health.","zh":"她从过度忙碌中抽身，以保护自己的健康。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of having more customers, orders, or business activity than can be handled well.","zh":"（生意）过旺、订单过多而难以应付的状态。"},"examples":[{"en":"The small shop struggled with overbusiness during the holiday season.","zh":"这家小店在假期旺季因生意过旺而应接不暇。"},{"en":"Overbusiness can hurt service quality if a company grows too fast.","zh":"如果公司增长过快，生意过旺可能会影响服务质量。"}]}],"synonyms":["overwork","overload","excessive busyness","too much on one’s plate","being swamped"],"phonetic":"/ˌoʊvɚˈbɪznəs/","extraExplanation":["“overbusiness”在现代英语里比较少见，更常见的表达是“overwork”（过度工作）、“too much on one’s plate”（事情太多）、“being overloaded”（超负荷）、或“excessive busyness”。在较老的文本中也可能写作“over-business”。"]}
{"word":"overbusy","summary":{"en":"Overbusy means too busy or overloaded with work or activities.","zh":"overbusy 指“过于忙碌、事务超负荷”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too busy; having more work, duties, or activities than you can comfortably handle.","zh":"过于忙碌的；忙得不可开交的（工作、事务或活动多到难以轻松应付）。"},"examples":[{"en":"I’m overbusy this week, so I can’t meet until Friday.","zh":"我这周忙得不可开交，所以要到周五才能见面。"},{"en":"She felt overbusy and started to forget small things.","zh":"她觉得自己太忙了，开始忘记一些小事。"},{"en":"The office is overbusy during tax season.","zh":"报税季办公室特别忙。"}]}],"synonyms":["overworked","overloaded","swamped","too busy"],"phonetic":"/ˌoʊvɚˈbɪzi/","extraExplanation":["“over-” 是常见前缀，表示“过度、超过正常程度”。类似表达还有 overworked（过度劳累的）、overloaded（超负荷的）。日常口语里更常说 very busy / too busy / swamped。"]}
{"word":"overbusyness","summary":{"en":"Overbusyness means the state of being too busy or having too many commitments.","zh":"overbusyness 指“过度忙碌、忙不过来”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being too busy; having too many tasks, commitments, or activities.","zh":"过度忙碌；事情或安排太多而忙不过来的一种状态。"},"examples":[{"en":"Her overbusyness left her exhausted and unable to sleep well.","zh":"她的过度忙碌让她精疲力尽，睡眠也不好。"},{"en":"Overbusyness can make you feel productive, but it may hide stress and burnout.","zh":"过度忙碌可能让你觉得自己很有效率，但它也可能掩盖压力和倦怠。"}]}],"synonyms":["overwork","work overload","too much on one’s plate","a packed schedule","hustle (context-dependent)"],"phonetic":"/ˌoʊvɚˈbizinəs/","extraExplanation":["“overbusyness”由 over-（过度）+ busy（忙）+ -ness（名词后缀）构成，语义直观，但在日常英语里不算常见。更自然的说法常用：being too busy、overwork（过劳/过度工作）、a packed schedule（排得很满的日程）。","语气上，“overbusyness”常带有批评或反思的意味，强调忙到不健康、不可持续，而不只是“很忙”。"]}
{"word":"overbuy","summary":{"en":"Overbuy means to buy more than you need or can use.","zh":"Overbuy 指购买过多，超过实际需要或可用量。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To buy more of something than you need, can use, or can afford; to purchase in excess.","zh":"（因需求判断失误、情绪或促销影响等）买得过多；超量购买。"},"examples":[{"en":"I overbought groceries, so half the vegetables went bad.","zh":"我菜买太多了，所以一半蔬菜都坏了。"},{"en":"During the sale, she overbought clothes she didn’t really need.","zh":"打折时她买了太多其实并不需要的衣服。"},{"en":"Try not to overbuy if you don’t have enough storage space.","zh":"如果你没有足够的储存空间，尽量别买太多。"}]}],"synonyms":["buy too much","overpurchase","stock up too much","overspend"],"phonetic":"/ˌoʊvɚˈbaɪ/","extraExplanation":["“over-”是常见前缀，表示“过度、过多”（如: overeat 吃太多、overwork 过度工作）。因此 overbuy 很直观地表示“买过量”。","在商业语境里，overbuy 也常与促销、囤货、冲动消费相关；在个人理财语境里，它常带有“买超预算/不必要”的提醒意味。"]}
{"word":"overbuying","summary":{"en":"Overbuying means buying more than you need or can reasonably use/afford.","zh":"Overbuying 指“买得过多”，超过实际需要或合理能用/能负担的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of buying more than you need, can use, or can afford","zh":"超量购买；买得过多（超过需要、能用或负担得起的程度）"},"examples":[{"en":"Overbuying groceries often leads to wasted food.","zh":"超量买菜常常会导致食物浪费。"},{"en":"During the sale, she regretted her overbuying once she saw the credit card bill.","zh":"打折期间她买太多了，看到信用卡账单后就后悔了。"}]},{"partOfSpeech":"v.","definition":{"en":"buying more than is necessary or sensible","zh":"过度购买；买得不必要或不明智"},"examples":[{"en":"They were overbuying because they feared prices would rise.","zh":"他们因为担心涨价而过度购买。"},{"en":"Try not to overbuy—make a list before you shop.","zh":"尽量别买过量——购物前先列清单。"}]}],"synonyms":["buy too much","overpurchase","overspend","stock up too much","panic buying"],"phonetic":"/ˌoʊvərˈbaɪɪŋ/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过正常程度”。因此 overbuy = buy too much（买太多）。","在新闻或商业语境中，overbuying 常与恐慌性抢购（panic buying）、囤货（hoarding）一起出现，用来描述因焦虑、促销或不确定性导致的“买超”。"]}
{"word":"overbuys","summary":{"en":"“overbuys” means someone buys more than they need, or a business buys too much stock.","zh":"“overbuys”表示（某人）买过量，或（企业）进货/订货过多导致库存过剩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"buys more of something than needed; purchases in excess.","zh":"买得过多；购买超过需要的数量。"},"examples":[{"en":"He often overbuys groceries and some food goes to waste.","zh":"他经常杂货买太多，结果有些食物浪费了。"},{"en":"If she overbuys, she can return some items later.","zh":"如果她买过量了，之后可以退掉一部分东西。"}]},{"partOfSpeech":"v.","definition":{"en":"(business) purchases or orders more stock than can be sold, leading to extra inventory.","zh":"（商业）进货/订货过多，超过销量所需，导致库存积压。"},"examples":[{"en":"The store overbuys before the holiday season and ends up discounting leftovers.","zh":"这家店在节日前进货过多，最后只好打折处理剩余商品。"},{"en":"When demand drops, a company that overbuys may face cash-flow problems.","zh":"当需求下降时，进货过多的公司可能会面临现金流问题。"}]}],"synonyms":["buys too much","overpurchases","overorders","stocks up too much"],"phonetic":"/ˌoʊvɚˈbaɪz/","extraExplanation":["“overbuys”是动词“overbuy”的第三人称单数（he/she/it overbuys）。常见于零售、采购、库存管理语境，强调“买超/备货过量”的结果（浪费、积压、打折清库存等）。"]}
{"word":"overby","summary":{"en":"“Overby” is mainly used as a surname or place name, not a standard everyday English word.","zh":"“Overby”主要用作姓氏或地名，并非标准的日常英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname). It is not a common everyday English vocabulary word.","zh":"（姓氏）Overby 是一个英文姓氏；不是常见的日常英语词汇。"},"examples":[{"en":"Dr. Overby will see you now.","zh":"Overby 医生现在要见你。"},{"en":"My teacher’s last name is Overby.","zh":"我老师的姓是 Overby。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in some English-speaking contexts (used as a proper name for a town/area).","zh":"（地名）在一些英语语境中作地名使用（作为城镇或地区的专有名称）。"},"examples":[{"en":"They drove through Overby on the way to the coast.","zh":"他们去海边的路上开车经过了 Overby。"},{"en":"Overby is marked on the map.","zh":"地图上标出了 Overby。"}]}],"phonetic":"/ˈoʊvɚˌbaɪ/","extraExplanation":["Overby 更常见于姓名或地名，很多情况下与斯堪的纳维亚语系的拼写/移民改写有关，例如挪威语姓氏或地名“Øverby/Overby”，含义接近“上面的农场/上村”（øver=上方，by=村/农场/定居点）。","如果你原本想查的是动词或形容词，可能是拼写接近的词：overbuy（买太多）、overly（过于）、overbid（出价过高）。你可以告诉我你看到它的句子，我可以帮你判断。"]}

