{"word":"overobedience","summary":{"en":"Overobedience means excessive, often unquestioning obedience.","zh":"overobedience 指过度且常常不加质疑的服从。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive obedience; being more obedient than is reasonable or healthy, often without questioning orders or rules.","zh":"过度服从；不合理或不健康地过分听从命令或规则，往往不加质疑。"},"examples":[{"en":"The team’s overobedience meant no one questioned the unsafe plan.","zh":"团队的过度服从导致没人质疑那个不安全的计划。"},{"en":"In some workplaces, overobedience can silence creativity and honest feedback.","zh":"在一些职场里，过度服从会压制创造力和真实反馈。"},{"en":"Her overobedience to authority made it hard for her to set personal boundaries.","zh":"她对权威的过度服从让她很难建立个人界限。"}]}],"synonyms":["blind obedience","overcompliance","unquestioning obedience","excessive obedience"],"phonetic":"/ˌoʊvər oʊˈbiːdiəns/","extraExplanation":["“overobedience”不是非常常见的标准词汇，更常见的近义说法包括“overcompliance（过度配合/过度顺从）”“blind obedience（盲目服从）”“unquestioning obedience（不加质疑的服从）”。","这个词常用于讨论权力关系与组织文化：当人们因为害怕惩罚、想讨好上级或习惯性顺从而不敢提出不同意见时，就可能出现“overobedience”。"]}
{"word":"overobedient","summary":{"en":"“Overobedient” means excessively obedient—so willing to obey that it can seem unthinking or unhealthy.","zh":"“overobedient”指“过度顺从、过分服从”，常暗示缺少独立判断或不太健康的顺从。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing to obey; obedient to an excessive degree, sometimes in a way that seems unthinking or unhealthy.","zh":"过度顺从的；过分服从的（有时带有不加思考或不健康的意味）。"},"examples":[{"en":"The manager didn’t want an overobedient team; she wanted people who could speak up with ideas.","zh":"经理不想要一支过度顺从的团队；她希望大家能提出想法、敢于发声。"},{"en":"He was so overobedient that he apologized even when he had done nothing wrong.","zh":"他太过分服从了，甚至在自己并没有做错时也会道歉。"},{"en":"Overobedient children may follow rules, but they can struggle to make decisions on their own.","zh":"过度顺从的孩子也许很守规矩，但可能会难以独立做决定。"}]}],"synonyms":["overly obedient","too compliant","submissive","docile"],"phonetic":"/ˌoʊvɚəˈbiːdiənt/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、过分”（如 overwork 过度工作、overprotect 过度保护）。因此 overobedient 通常带一点负面或担忧的语气：不是单纯的“听话”，而是“太听话、缺少界限或独立判断”。","在实际写作里，overobedient 不是特别常用；更常见的替代表达有 overly obedient、too compliant、submissive（更强烈、偏负面）。"]}
{"word":"overobediently","summary":{"en":"“Overobediently” means doing something in an excessively obedient way, often without independent judgment.","zh":"“overobediently”表示“过分顺从地”，常含“缺乏独立判断、顺从过头”的意思。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too obedient; obeying excessively, often without thinking independently.","zh":"过分顺从地；过度服从地（常带有不加思考、缺乏独立判断的意味）。"},"examples":[{"en":"He followed the manager’s instructions overobediently, even when they seemed unfair.","zh":"他过分顺从地照着经理的指示做，即使那些指示看起来并不公平。"},{"en":"The child nodded overobediently and didn’t ask a single question.","zh":"孩子过分顺从地点头，一个问题也没问。"},{"en":"She responded overobediently to every request, afraid of disappointing anyone.","zh":"她对每一个请求都过分顺从地回应，生怕让任何人失望。"}]}],"synonyms":["submissively","obediently","servilely","meekly","docilely"],"phonetic":"/ˌoʊvɚəˈbiːdiəntli/","extraExplanation":["这个词由 over-（“过度、太……”）+ obedient（“顺从的”）+ -ly（副词后缀）组成，语气通常偏负面，暗示“顺从到不合理/不健康”的程度。","常用于批评在权威、制度、家庭或职场中“照单全收”的行为：不仅听话，而且缺乏质疑与自主判断。"]}
{"word":"overobese","summary":{"en":"“Overobese” means extremely obese, but it’s not a very standard everyday word; more common terms are “severely obese” or “class III obesity.”","zh":"“Overobese”指“极度肥胖”，但并非很规范的日常用词；更常见的说法是“severely obese（重度肥胖）”或“class III obesity（III级肥胖）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely obese; having very excessive body fat (often used in medical or technical contexts, though not a standard everyday term).","zh":"极度肥胖的；体脂过多到非常严重的程度（多见于医学或技术语境，但不是日常常用的规范词）。"},"examples":[{"en":"The clinic uses more standard terms like “severely obese” rather than “overobese” in its reports.","zh":"这家诊所在报告里更常用“重度肥胖”之类的规范说法，而不是“overobese”。"},{"en":"He was described as overobese in the old notes, but the newer records use BMI categories instead.","zh":"旧病历里写他“极度肥胖”，但新记录改用 BMI 分类来描述。"}]}],"synonyms":["severely obese","extremely obese","morbidly obese","class III obese","super obese"],"phonetic":"/ˌoʊvərˈoʊbis/","extraExplanation":["“overobese”并不是非常规范或常见的标准词。在健康/医学写作中，更常见、更准确的表达是：severely obese（重度肥胖）、morbidly obese（病态性肥胖，较旧或更敏感的说法）、class III obesity（III级肥胖）。","涉及体型时，英语里用词需要注意礼貌与尊重。日常交流中，通常用“has obesity / is living with obesity（患有/正在与肥胖共处）”比直接给人贴标签更委婉。","如果是在医学讨论里，常会用 BMI（体质指数）或腰围等指标来分级描述，而不是用笼统的“over-”前缀。"]}
{"word":"overobesely","summary":{"en":"“Overobesely” is a very rare/nonstandard adverb meaning “in an excessively obese way.”","zh":"“overobesely”是非常少见、非标准的副词，大意是“胖得过分地/以过度肥胖的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard/very rare) In an excessively obese way; in a way that is *too* overweight.","zh":"（非标准/极少见）以过度肥胖的方式；胖得过分地。"},"examples":[{"en":"The costume was made to look overobesely padded for comedic effect.","zh":"这套服装被做成“过度臃肿”的填充效果，用来制造喜剧感。"},{"en":"The character is portrayed as overobesely large, which can feel insensitive.","zh":"这个角色被塑造成“胖得过分”，这可能会让人觉得不够尊重。"}]}],"synonyms":["excessively overweight (more natural)","morbidly obese (medical/neutral)","extremely overweight"],"phonetic":"/ˌoʊvɚˈoʊbiːsli/","extraExplanation":["“overobesely”不是常见或规范的英语词。它看起来像是把 over-（过度）+ obese（肥胖的）+ -ly（副词后缀）拼出来的临时造词（nonce word）。在正式写作中通常不建议使用。","如果你想表达“过度肥胖/胖得过分”，更自然的说法是：morbidly obese（病态性肥胖，医学/中性语境更常用）、extremely overweight（非常超重）。如果你本来想写的是“明显地/显然地”，很可能是拼错了 obviously。","涉及体重与外貌时，英语中更常用中性、描述性的表达（例如 overweight / obesity）来避免冒犯。"]}
{"word":"overobeseness","summary":{"en":"“Overobeseness” means extreme or very severe obesity, but it is rare and not a standard term.","zh":"“overobeseness”指“极度/非常严重的肥胖”，但该词很少见，也不算标准用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being extremely obese; very severe obesity (a nonstandard or rare word).","zh":"极度肥胖的状态；非常严重的肥胖（较少见、非标准用词）。"},"examples":[{"en":"The doctor described his condition as severe obesity rather than using rare terms like “overobeseness.”","zh":"医生把他的情况描述为“严重肥胖”，而不是用像 overobeseness 这样少见的词。"},{"en":"Her research focuses on health risks linked to extreme obesity.","zh":"她的研究聚焦于与极度肥胖相关的健康风险。"}]}],"synonyms":["severe obesity","extreme obesity","morbid obesity","class III obesity"],"phonetic":"/ˌoʊvɚoʊˈbisnəs/","extraExplanation":["“overobeseness”主要是由 over-（过度）+ obese（肥胖的）+ -ness（名词后缀，表示“……的状态/性质”）构成，意思容易猜到，但在正式英语里非常少用。","在医学或公共健康语境中，更常见、更自然的表达是：severe obesity（严重肥胖）、morbid obesity（病态肥胖，较旧/带价值判断的说法，使用时要注意语气）、class III obesity（III级肥胖，更中性、分类化）。","谈到体重与健康时，英语里越来越强调用中性、尊重的表达（如 “a person with obesity” 而非 “an obese person”），避免给人贴标签。"]}
{"word":"overobesity","summary":{"en":"“Overobesity” is a rare, nonstandard word sometimes used to mean extreme/severe obesity.","zh":"“overobesity”是较少见且不规范的词，有时用来指极度/重度肥胖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard term sometimes used to mean extreme or severe obesity (very high body fat).","zh":"一个不标准的用法，有时被用来指“极度/重度肥胖”（体脂非常高）。"},"examples":[{"en":"Some online posts use “overobesity” to describe severe obesity, but the term is not common in medical writing.","zh":"一些网络帖子用“overobesity”来形容重度肥胖，但这个词在医学写作中并不常见。"},{"en":"If you see “overobesity” in a text, it usually means the person is extremely overweight.","zh":"如果你在文章里看到“overobesity”，通常是在说这个人肥胖程度非常严重。"}]}],"synonyms":["severe obesity","morbid obesity","extreme obesity","extreme overweight"],"phonetic":"/ˌoʊvɚoʊˈbisɪti/","extraExplanation":["“overobesity”不是常见或规范的英语词汇，更常见、也更中性的表达是：severe obesity（重度肥胖）或 morbid obesity（病态性肥胖；医学语境更常见）。日常交流中也可以用 extremely overweight（非常超重），语气更委婉。","前缀 over- 常表示“过度、过量”（如 overeat 过量进食），所以读者通常能猜到它想表达“超过正常范围的肥胖”，但在正式写作里建议改用标准术语。"]}
{"word":"overobject","summary":{"en":"Overobject means to object or protest excessively (rare word).","zh":"overobject 指“过度反对/抗议”，是个较少见的词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to object too much or too often; to protest excessively (rare).","zh":"过度反对；反对得太多/太频繁（较少见用法）。"},"examples":[{"en":"If you overobject in every meeting, people may stop listening to your concerns.","zh":"如果你在每次会议上都过度反对，人们可能就不再认真听你的担忧了。"},{"en":"She didn’t disagree—she just didn’t want to overobject and slow the decision.","zh":"她并不是不同意，只是不想过度反对而拖慢决定。"}]},{"partOfSpeech":"vt.","definition":{"en":"to criticize a plan by raising too many objections (rare).","zh":"以提出过多异议来批评/阻挠某个计划（较少见用法）。"},"examples":[{"en":"The committee felt he was overobjecting the proposal instead of offering solutions.","zh":"委员会觉得他是在对提案提出过多异议，而不是提供解决方案。"}]}],"synonyms":["object too much","protest","complain","raise objections"],"phonetic":"/ˌoʊvərəbˈdʒɛkt/","extraExplanation":["这个词在现代英语里非常少见，更多时候人们会说：object too much / complain too much / raise too many objections。","写法上也可能见到带连字符的形式 over-object，意思相同；在正式写作中建议用更常见的表达以避免读者困惑。"]}
{"word":"overobjectification","summary":{"en":"Overobjectification means excessively treating a person as an object, often by reducing them to appearance or use.","zh":"overobjectification 指过度物化，即过分把人当作“物品”，把价值缩减为外表或用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or tendency of treating someone (especially a woman) as an object in an excessive way—focusing too much on their body, appearance, or usefulness rather than their full humanity","zh":"过度物化：把某人（尤其是女性）过分当作“物品”来看待，过度强调其身体、外貌或用途，而忽视其完整的人格与人性"},"examples":[{"en":"The ad was criticized for overobjectification because it showed women only as decoration.","zh":"这则广告因过度物化而受到批评，因为它只把女性当作装饰。"},{"en":"Overobjectification in media can affect how young people view relationships and self-worth.","zh":"媒体中的过度物化会影响年轻人对亲密关系和自我价值的看法。"},{"en":"She spoke out against overobjectification at work and asked to be evaluated for her skills.","zh":"她公开反对职场中的过度物化，并要求以能力而非外表来评估自己。"}]}],"synonyms":["excessive objectification","dehumanization (partial overlap)","oversexualization (related in many contexts)"],"phonetic":"/ˌoʊvɚɑːbˌdʒɛk.tə.fɪˈkeɪ.ʃən/","extraExplanation":["“objectification（物化）”常见于性别研究、社会学与媒体批评语境；加上前缀“over-”强调“过度、太过分”，表示不仅是把人当作对象，还带有明显的贬低与不尊重。","在讨论中，它常与“sexualization（性化）”“male gaze（男性凝视）”“dehumanization（去人性化）”等概念并列出现，用来批评把人的价值缩减为外表或可被消费的形象。"]}
{"word":"overobjectified","summary":{"en":"Overobjectified means excessively treated as an object rather than as a whole person.","zh":"overobjectified 指被过度当作“物品”对待，而不是被当作完整的人来看待。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated as an object (especially for someone else’s pleasure or use) too much or in an unfair way; excessively objectified","zh":"被过度当作“物品”来对待（尤其是为了他人的享乐或利用）；被过分物化"},"examples":[{"en":"Some critics say the female characters in the movie are overobjectified and given no real personalities.","zh":"一些评论者认为这部电影里的女性角色被过度物化，没有真正的个性。"},{"en":"She felt overobjectified by the advertising campaign and asked to change the images.","zh":"她觉得自己在那次广告宣传中被过度物化，于是要求更换图片。"},{"en":"When a person is overobjectified, people may ignore their feelings and boundaries.","zh":"当一个人被过度物化时，别人可能会忽视他们的感受和界限。"}]}],"synonyms":["excessively objectified","dehumanized","treated like an object","reduced to a body","sexualized (in some contexts)"],"phonetic":"/ˌoʊvɚəbˈdʒɛktəˌfaɪd/","extraExplanation":["“objectify/物化”常见于讨论性别、媒体与职场文化：把人（常见是女性，但不限于女性）当成外表、身体或功能来评价，而不是把他们当作有思想、情感与自主权的完整个体。“overobjectified”强调程度更严重，带有批评意味。","词形上它更像是临时造词/评论用语（尤其在社交媒体、影评、文化研究语境中），不如“objectified”常见；写正式文章时也可用“excessively objectified”来表达。"]}
{"word":"overobjectify","summary":{"en":"“Overobjectify” means to objectify someone excessively—treating them too much like an object rather than a whole person.","zh":"“overobjectify”指过度物化某人：把对方过分当作物品/工具或仅看外表（常与性物化相关），忽视其作为完整个体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone too much like an object (often a body or a thing to be used), rather than as a whole person with thoughts and feelings","zh":"过度物化；把某人过分当作“物品/工具”（常指只看身体或可被利用的价值），而忽视其作为完整的人（思想与感受）"},"examples":[{"en":"Some ads overobjectify women by focusing only on their bodies.","zh":"有些广告通过只强调女性的身体来过度物化女性。"},{"en":"The film was criticized for overobjectifying its female characters.","zh":"这部电影因过度物化女性角色而受到批评。"},{"en":"Try not to overobjectify people online—remember there’s a real person behind the profile.","zh":"在网上尽量不要过度物化别人——记住头像背后是真实的人。"}]}],"synonyms":["oversexualize","dehumanize","reduce (someone) to an object","commodify"],"phonetic":"/ˌoʊvɚəbˈdʒɛktɪˌfaɪ/","extraExplanation":["“overobjectify”由 over-（过度）+ objectify（物化）构成，常用于性别议题、媒体批评与职场/社交语境，强调“程度太过”。相比 objectify（物化），overobjectify 更明确带有“过头了/不恰当”的价值判断。","在英语讨论中，“objectify”常与“sexual objectification（性物化）”并用，但也可指把人当作“工具/资源”（例如只把员工当产能）。使用该词时，通常暗含批评与呼吁尊重对方的主体性。"]}
{"word":"overobjectifying","summary":{"en":"Overobjectifying means objectifying someone too much—treating them like an object rather than a whole person; it can also mean oversimplifying people or issues into “things.”","zh":"overobjectifying 指“过度物化”：把人过分当成物品/外貌或性对象来看待，而非完整的人；也可指把复杂的人或议题过度简化为“东西”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) Treating a person too much as an object—often focusing on appearance or sexual value instead of their feelings, skills, and agency.","zh":"（现在分词）过度把人当作“物品”来看待——常指过分关注外貌或性价值，而忽视对方的感受、能力与自主性。"},"examples":[{"en":"The ad is overobjectifying women by showing only their bodies and not their personalities.","zh":"这个广告在过度物化女性，只展示身体而不呈现她们的个性。"},{"en":"Some comments online are overobjectifying—talking about her looks while ignoring her achievements.","zh":"网上有些评论很过度物化——只谈她的长相，却无视她的成就。"}]},{"partOfSpeech":"v.","definition":{"en":"Overly describing something complex as a simple “thing,” ignoring its human, emotional, or social aspects.","zh":"把复杂事物过度“物化”为简单的“东西”，忽略其人性、情感或社会层面。"},"examples":[{"en":"In the debate, he was overobjectifying poverty as just a numbers problem.","zh":"在辩论中，他把贫困过度物化成“只是数字问题”。"},{"en":"We risk overobjectifying students when we see them only as test scores.","zh":"如果我们只把学生看成分数，就会有过度物化学生的风险。"}]}],"synonyms":["overly objectifying","sexualizing","reducing someone to their looks","dehumanizing"],"phonetic":"/ˌoʊvərəbˈdʒɛktəˌfaɪɪŋ/","extraExplanation":["“objectify（物化）”常用于讨论性别与媒体再现，尤其指把人当成供观看、消费或评价的对象；加上前缀“over-”表示“过度、太过头”。","常见搭配：overobjectifying women/men/people（过度物化女性/男性/人们）；overobjectifying someone in a film/ad（在电影/广告中过度物化某人）。","近义表达（语气不同）：sexualizing（性化，强调把一切变成性）、reducing someone to a body/looks（把人简化成身体/外貌）、dehumanizing（非人化，语气更重、更严厉）。","写作提示：在正式语境里，这个词带强烈批评意味；如果想更中性，可用“objectifying too much / overly objectifying”。"]}
{"word":"overoblige","summary":{"en":"Overoblige means to help or accommodate someone too much—more than necessary.","zh":"overoblige 指“过度帮忙/过分殷勤”，做得超过必要或合理的程度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To do more for someone than is necessary or reasonable; to be too eager to help or please.","zh":"过度帮忙；过分殷勤（做得超过必要或合理的程度）。"},"examples":[{"en":"Thank you, but please don’t overoblige—you’ve already done enough.","zh":"谢谢你，但别太过分帮忙——你已经做得够多了。"},{"en":"He tends to overoblige at work, taking on extra tasks even when he’s exhausted.","zh":"他在工作中常常过度承担，即使很累也会接下额外任务。"},{"en":"I don’t want to overoblige my friends, so I try not to ask for too many favors.","zh":"我不想让朋友为难或付出太多，所以我尽量不求太多帮忙。"}]}],"synonyms":["overdo","go too far","be too accommodating","be overly helpful","bend over backward"],"phonetic":"/ˌoʊvərəˈblaɪdʒ/","extraExplanation":["“overoblige”语气偏正式、略带书面感，常用于礼貌地提醒对方：不必如此客气或不必做这么多。","它通常带有“好意但过头了”的含义：并非批评对方不好，而是强调界限与分寸。"]}
{"word":"overobsequious","summary":{"en":"“Overobsequious” describes someone who is excessively eager to please or obey, in a way that feels servile or insincere.","zh":"“overobsequious”指一个人过分讨好、过度恭顺，显得卑躬屈膝或不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too eager to please or obey; excessively polite in a way that seems insincere or servile.","zh":"过分谄媚的；过度恭顺讨好的（常带有不真诚、卑躬屈膝的感觉）。"},"examples":[{"en":"The new assistant was overobsequious, laughing at every joke the manager made.","zh":"新来的助理过分谄媚，经理说什么笑话他都要笑。"},{"en":"Her overobsequious compliments made people uncomfortable.","zh":"她过度讨好的赞美让人感到不自在。"},{"en":"Try to be respectful without sounding overobsequious in your email.","zh":"写邮件时可以礼貌，但别显得过分谄媚。"}]}],"synonyms":["servile","fawning","sycophantic","groveling","toadying"],"phonetic":"/ˌoʊvərəbˈsiːkwiəs/","extraExplanation":["“over-”表示“过度”，所以 overobsequious 就是“比 obsequious（谄媚、恭顺）更过分”。它通常用于批评某人为了取悦权威而显得不自然、没有骨气。","语域偏正式、书面语更常见；日常口语里更常说 “too eager to please / brown-nosing / suck-up behavior”（注意后两者偏贬义、较口语）。","词源上 obsequious 来自拉丁语 obsequium（顺从、服从），因此这个词常与“权力关系”“拍马屁文化”相关。"]}
{"word":"overobsequiously","summary":{"en":"Overobsequiously means “too flatteringly or servilely.”","zh":"overobsequiously 指“过分谄媚、过度讨好地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively flattering, servile, or “too eager to please” way (often in order to gain approval or advantage).","zh":"以过分谄媚、卑躬屈膝、讨好人的方式（通常是为了获得认可或好处）。"},"examples":[{"en":"He spoke overobsequiously to the manager, laughing too hard at every joke.","zh":"他对经理说话过分谄媚，每个笑话都笑得太夸张。"},{"en":"The assistant nodded overobsequiously, even when the instructions didn’t make sense.","zh":"助理点头点得过分殷勤，即使那些指示根本说不通。"}]}],"synonyms":["fawningly","servilely","sycophantically","grovelingly"],"phonetic":"ˌoʊvərəbˈsiːkwiəsli","extraExplanation":["“over-”表示“过度”，因此 overobsequiously = “过度地 + 谄媚地”。它常带强烈的负面评价，暗示不真诚、带目的的讨好。","词根来自 obsequious（谄媚的、逢迎的）。在职场或权力关系场景中更常见，用来批评“拍马屁/卑躬屈膝”的行为。"]}
{"word":"overobsequiousness","summary":{"en":"Overobsequiousness means excessive, often insincere, flattery or submissive eagerness to please.","zh":"overobsequiousness 指过度（往往显得不真诚的）奉承与卑躬屈膝式的讨好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive flattery or eagerness to please in a way that feels servile or insincere.","zh":"过度的逢迎拍马、卑躬屈膝（让人觉得谄媚、不真诚）。"},"examples":[{"en":"Her overobsequiousness toward the manager made her coworkers uncomfortable.","zh":"她对经理过度逢迎，让同事们很不舒服。"},{"en":"The customer could tell the apology was driven by overobsequiousness rather than genuine regret.","zh":"顾客看得出来，这个道歉更多是出于过度讨好，而不是真心后悔。"},{"en":"In the meeting, his overobsequiousness sounded like praise without substance.","zh":"在会议上，他过度奉承，听起来像是空洞的称赞。"}]}],"synonyms":["sycophancy","servility","fawning","toadyism","brown-nosing"],"phonetic":"/ˌoʊvərəbˈsiːkwiəsnəs/","extraExplanation":["“overobsequiousness”由 over-（过度）+ obsequious（卑躬屈膝的、谄媚的）+ -ness（名词后缀）构成，常用来批评一种“讨好得太明显”的行为或态度。","obsequious 源自拉丁语词根，和“顺从、跟随”有关；现代英语里语气偏负面，暗示不自然、缺乏尊严或带有功利目的。","近义词中，servility 更强调“奴性/卑贱的顺从”，sycophancy 更强调“拍马屁、阿谀奉承”；而 politeness（礼貌）通常是中性或正面的，不等同于 overobsequiousness。"]}
{"word":"overobvious","summary":{"en":"Overobvious means “too obvious,” often implying it reduces subtlety or feels unnecessary to say.","zh":"overobvious 指“过于明显/太直白”，常暗含“缺少含蓄、说出来多余或影响效果”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) So obvious that it feels unnecessary, awkward, or even a little insulting to point out.","zh":"（非正式）明显到不需要说、说出来反而尴尬，甚至让人觉得有点被冒犯的程度。"},"examples":[{"en":"The movie’s message was overobvious, so it didn’t feel very powerful.","zh":"这部电影的主题表达得太直白（太明显）了，所以不太有冲击力。"},{"en":"His hint was overobvious—I understood immediately.","zh":"他的暗示太明显了——我马上就懂了。"}]}],"synonyms":["too obvious","painfully obvious","blatant","on-the-nose","heavy-handed"],"phonetic":"/ˌoʊvərˈɑbviəs/","extraExplanation":["“over-”作前缀表示“过度/太……”，所以 overobvious 直译就是“过于明显”。它更偏口语或网络用法，在正式写作里常用更标准的说法，如 “too obvious / painfully obvious / heavy-handed / on-the-nose”。","语气上，overobvious 常带一点评价：不只是“容易看出来”，而是“明显到影响效果”（比如剧情、提示、道理讲得太直白）。"]}
{"word":"overoffend","summary":{"en":"“Overoffend” means to offend excessively (a rare, nonstandard word).","zh":"“overoffend”指“过度冒犯”，但属于较少见、偏非标准的用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to offend someone too much or too often; to give greater offense than intended (rare).","zh":"过度冒犯；冒犯得太过分或太频繁（较少见）。"},"examples":[{"en":"He tried to joke, but he overoffended the guests and the room went quiet.","zh":"他想开个玩笑，但结果过度冒犯了客人，房间里一下安静了下来。"},{"en":"Be careful with sarcasm—you can overoffend people who don’t know you well.","zh":"讽刺要小心；对不太熟的人，你可能会过度冒犯他们。"}]}],"synonyms":["offend too much","go too far","cause offense","overstep","push it too far"],"phonetic":"/ˌoʊvɚəˈfɛnd/","extraExplanation":["“overoffend”不是现代英语里常用的标准词，更常见的表达是“offend too much/too often”“go too far”“cause unnecessary offense”。它是由前缀“over-（过度）”+“offend（冒犯）”构成，读者多半能理解，但写作中建议用更常见的说法以避免显得生硬或不地道。"]}
{"word":"overoffensive","summary":{"en":"Overoffensive means excessively offensive or overly aggressive in a way that upsets people.","zh":"overoffensive 指“过于冒犯的”或“过度攻击性的”，让人不舒服或不必要地咄咄逼人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively offensive; too rude, insulting, or likely to upset people.","zh":"过于冒犯的；太无礼、侮辱性太强或容易让人不舒服的。"},"examples":[{"en":"That joke was overoffensive for a family dinner.","zh":"那个笑话在家庭晚餐上太冒犯人了。"},{"en":"The ad was criticized for being overoffensive and insensitive.","zh":"那则广告因过于冒犯、缺乏体贴而受到批评。"},{"en":"Try to express your opinion without sounding overoffensive.","zh":"尽量在表达观点时不要显得过于冒犯。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of behavior or language) excessively aggressive or attacking, beyond what the situation requires.","zh":"（行为或语言）过度攻击性的；超出情境所需要的咄咄逼人的。"},"examples":[{"en":"His reply felt overoffensive when a calm explanation would have worked.","zh":"他的回复显得过度攻击，其实冷静解释就够了。"},{"en":"The discussion turned unproductive because one side became overoffensive.","zh":"讨论变得没有成效，因为一方变得过度攻击。"}]}],"synonyms":["overly offensive","too offensive","highly offensive","needlessly aggressive","abrasive","insulting"],"phonetic":"/ˌoʊvər əˈfɛnsɪv/","extraExplanation":["“overoffensive”不是特别常见的标准词，更常见的表达有：too offensive / overly offensive / unnecessarily aggressive。","前缀 over- 常表示“过度、超过合理程度”（如 overconfident 过度自信、overreact 反应过度）。因此 overoffensive 直观理解就是“冒犯得过头/攻击性太强”。在正式写作中，用 overly offensive 往往更自然。"]}
{"word":"overoffensively","summary":{"en":"“Overoffensively” means “too offensively; in an overly rude or upsetting way.”","zh":"“overoffensively”表示“过于冒犯地；以太粗鲁或令人不快的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is too offensive, rude, or likely to upset people; overly offensively","zh":"以过于冒犯、粗鲁或容易惹人不快的方式；太过冒犯地"},"examples":[{"en":"The joke came across overoffensively, so several people left the room.","zh":"这个玩笑听起来太过冒犯了，所以有几个人离开了房间。"},{"en":"Try to rephrase your comment so it doesn’t sound overoffensively direct.","zh":"试着把你的评论换个说法，别让它听起来过于冒犯、太直接。"},{"en":"He criticized the policy overoffensively instead of offering a constructive alternative.","zh":"他用过于冒犯的方式批评政策，而不是提出建设性的替代方案。"}]}],"synonyms":["too offensively","overly offensively","rudely","insultingly","inappropriately"],"phonetic":"/ˌoʊvɚˈɔfɛnsɪvli/","extraExplanation":["“overoffensively”并不是非常常见或固定的标准用词，更常见的写法是用连字符的“over-offensively”，或者直接用更自然的表达：\"too offensively\"、\"overly offensively\"、\"in an offensive way\"。","这个词的结构是 over-（过度）+ offensively（冒犯地）。在正式写作里，读者可能觉得它生硬或不自然；如果你想表达“过度冒犯”，通常选择“too/overly + offensive(rude/harsh)”会更地道。"]}
{"word":"overoffensiveness","summary":{"en":"“Overoffensiveness” means excessive offensiveness—being too rude or insulting for the context.","zh":"“overoffensiveness”指“过度冒犯性”，即言行在特定语境下显得太无礼或侮辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive offensiveness; the quality of being more offensive (rude, insulting, or inappropriate) than is acceptable in a situation.","zh":"过度冒犯性；指言行在某种情境下显得过于无礼、侮辱或不合适的特质。"},"examples":[{"en":"Some viewers complained about the overoffensiveness of the jokes in the show.","zh":"一些观众抱怨这部剧里的笑话过度冒犯。"},{"en":"The policy aims to reduce online harassment without punishing people for minor mistakes or perceived overoffensiveness.","zh":"该政策旨在减少网络骚扰，同时避免因为小失误或被认为“过度冒犯”而惩罚他人。"}]}],"synonyms":["excessive offensiveness","undue offensiveness","needless offensiveness","overly offensive behavior","unnecessary insult"],"phonetic":"/ˌoʊvər əˈfɛnsɪvnəs/","extraExplanation":["“overoffensiveness”在实际英语中不算常见，更像是临时造词（nonce word）。更自然的表达通常是：excessive offensiveness（过度冒犯性）、being overly offensive（过于冒犯）、unnecessary offensiveness（不必要的冒犯）、needlessly insulting language（不必要的侮辱性语言）。","构词上是 over-（过度）+ offensive（冒犯的）+ -ness（名词后缀，表示“……的性质/状态”）。如果你在写作中使用，建议在正式场合改用更常见的搭配，以免读者觉得生硬。"]}
{"word":"overofficered","summary":{"en":"Overofficered means having too many officers or leaders, often causing inefficiency.","zh":"Overofficered 指军官或领导层过多，常暗示效率低下。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having too many officers (especially in the military or an organization), so that there are more leaders than needed","zh":"（尤指军队或机构）军官/管理层过多的；“官多兵少”的"},"examples":[{"en":"The unit was overofficered, with too many captains and not enough trained staff.","zh":"这个单位军官太多，却缺少足够的受训人员。"},{"en":"Some critics said the department had become overofficered and slow to make decisions.","zh":"一些批评者认为这个部门管理层过多，导致决策缓慢。"}]}],"synonyms":["overstaffed (with managers)","top-heavy","overmanaged","bureaucratic"],"phonetic":"/ˌoʊvɚˈɔfɪsɚd/","extraExplanation":["“overofficered”更常见的写法是带连字符的“over-officered”。它多用于军事或官僚体系的语境，带有批评意味，暗示层级过多、效率下降。"]}
{"word":"overofficious","summary":{"en":"Overofficious means annoyingly too eager to manage, correct, or interfere in others’ affairs.","zh":"overofficious 指“过分爱插手、过度热心到惹人烦”的性格或行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too eager to advise, correct, or control other people in a way that feels annoying or unnecessary.","zh":"过分爱插手（好管闲事）的；过度热心到让人觉得烦、没必要的。"},"examples":[{"en":"The overofficious supervisor corrected every tiny detail, even when no one asked.","zh":"那位爱管闲事的主管连很小的细节都要纠正，即使没人请他这么做。"},{"en":"Her overofficious comments made the meeting feel tense and uncomfortable.","zh":"她过度插手的评论让会议气氛变得紧张、不舒服。"}]}],"synonyms":["officious","meddlesome","interfering","pushy","bossy"],"phonetic":"/ˌoʊvər.əˈfɪʃəs/","extraExplanation":["“Overofficious”由 over-（过度）+ officious（爱插手的、爱发号施令的）构成，语气通常偏负面，强调“自以为在帮忙，其实在干扰/越界”。","它常用于描述职场或服务场景里那种“管太多”的人，例如过度检查、过度指导、替别人做决定等。","与 “helpful” 不同：helpful 是受欢迎的帮助；overofficious 是不请自来、让人反感的干预。"]}
{"word":"overofficiously","summary":{"en":"“Overofficiously” means acting in an overly meddling, bossy, unasked-for helpful way.","zh":"“Overofficiously”指以过分热心、爱插手、未经请求却要管事的方式行事，常带贬义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly eager, intrusive, or bossy way—trying to manage or “help” without being asked, often causing annoyance.","zh":"以过分热心、爱插手或爱指挥的方式——在别人没要求时硬要帮忙或管事，常让人反感。"},"examples":[{"en":"The clerk overofficiously corrected my pronunciation, even though I didn’t ask for help.","zh":"店员过分热心地纠正我的发音，虽然我并没有请他帮忙。"},{"en":"She overofficiously reorganized the group chat rules, and everyone felt uncomfortable.","zh":"她过分爱管闲事地重新整理群聊规则，大家都觉得不舒服。"}]}],"synonyms":["meddlingly","intrusively","pushily","bossily","officiously"],"phonetic":"/ˌoʊvɚəˈfɪʃəsli/","extraExplanation":["“overofficiously”来自形容词 officious（爱管闲事的、过分热心的）加上 over-（过度）与副词后缀 -ly。语气通常偏负面，强调“未经请求的干预”。","注意区分：helpfully（有帮助地，偏正面） vs. officiously/overofficiously（越俎代庖、让人烦，偏负面）。"]}
{"word":"overofficiousness","summary":{"en":"Overofficiousness means being too officious—meddling or giving unwanted help and control.","zh":"overofficiousness 指“过分好管闲事/过度干预”，带明显贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive officiousness; an overly eager tendency to interfere, give unwanted help, or enforce rules in a meddling way.","zh":"过度的好管闲事（或过分热心地干预他人）；一种爱插手、爱指挥、爱管人的劲头。"},"examples":[{"en":"Her overofficiousness at work—correcting everyone’s emails and micromanaging small tasks—made the team uncomfortable.","zh":"她在工作中过度好管闲事——纠正每个人的邮件、连小事都要微管理——让团队很不舒服。"},{"en":"The customer complained about the clerk’s overofficiousness, saying the advice felt more like pressure than help.","zh":"顾客抱怨店员过度干预，说那些“建议”更像施压而不是帮助。"}]}],"synonyms":["meddlesomeness","interference","intrusiveness","busybodiness"],"phonetic":"/ˌoʊvər əˈfɪʃəsnəs/","extraExplanation":["这是一个相对少见、偏正式的名词，由 over-（过度）+ officious（爱管闲事的、好插手的）+ -ness（名词后缀）构成。语气通常带贬义，强调“帮助/管理”变成了不请自来的干涉。","与 overhelping（过度帮忙）相比，overofficiousness 更强调“爱管、爱指挥、爱以规则或权威姿态介入”。","常见搭配：complain about / dislike / resent someone’s overofficiousness（抱怨/不喜欢/反感某人的过度干预）。"]}
{"word":"overoptimism","summary":{"en":"Overoptimism means excessive, unrealistic optimism that ignores risks or evidence.","zh":"overoptimism 指“过度乐观”：不切实际地看好结果，忽视风险或证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive optimism; an unrealistically positive belief that things will go well, often ignoring risks or evidence.","zh":"过度乐观；对事情会顺利发展的不切实际的积极判断，常常忽视风险或事实依据。"},"examples":[{"en":"Her overoptimism made her underestimate how long the project would take.","zh":"她的过度乐观让她低估了这个项目需要多长时间。"},{"en":"Investors’ overoptimism can inflate prices and create a bubble.","zh":"投资者的过度乐观可能推高价格并造成泡沫。"}]}],"synonyms":["unrealistic optimism","excessive optimism","wishful thinking"],"phonetic":"/ˌoʊvɚˈɑptəˌmɪzəm/","extraExplanation":["这是由 over-（“过度”）+ optimism（“乐观”）构成的名词，常见于商业、心理学、新闻评论等语境，用来批评“乐观到不合理”。","语气通常偏负面或警示：不是反对乐观本身，而是提醒“乐观要基于证据并考虑风险”。","相关表达：unrealistic optimism（不切实际的乐观）、rose-colored glasses（玫瑰色眼镜＝把事情看得太美好）、overconfident（过度自信，侧重自信而非对结果的乐观）。"]}
{"word":"overoptimist","summary":{"en":"An overoptimist is someone who is excessively optimistic and may ignore realistic risks.","zh":"overoptimist 指“过度乐观的人”，往往会忽视现实风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is too optimistic; someone who expects things to go well even when there is little evidence","zh":"过度乐观者；过分相信事情会顺利的人（即使缺乏证据）"},"examples":[{"en":"He’s an overoptimist who assumes every project will finish early.","zh":"他是个过度乐观者，总以为每个项目都会提前完成。"},{"en":"As an overoptimist, she underestimated the risks of the trip.","zh":"作为一个过度乐观者，她低估了这次旅行的风险。"},{"en":"Don’t be an overoptimist—make a backup plan.","zh":"别太过度乐观——做个备用计划。"}]}],"synonyms":["unrealistic optimist","Pollyanna (informal)","overly optimistic person"],"phonetic":"/ˌoʊvɚˈɑptəmɪst/","extraExplanation":["“overoptimist”由前缀 over-（过度、超过）+ optimist（乐观主义者）构成，强调“乐观到不现实”的程度。日常写作里更常见的说法是“overly optimistic”（过于乐观的）或“unrealistically optimistic”（不切实际地乐观）。","语气上它通常带一点提醒或批评：不是反对乐观，而是强调需要更贴近现实（例如评估风险、准备备选方案）。"]}
{"word":"overoptimistic","summary":{"en":"Overoptimistic means unrealistically or excessively optimistic, often overlooking risks.","zh":"overoptimistic 指不切实际或过度乐观，往往忽视风险。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too confident that things will turn out well, often ignoring real problems or risks.","zh":"过度乐观的；对结果过分有信心，常常忽视现实问题或风险。"},"examples":[{"en":"I love your enthusiasm, but your schedule is a bit overoptimistic.","zh":"我喜欢你的热情，但你的时间安排有点过于乐观了。"},{"en":"The report was criticized for being overoptimistic about the economy.","zh":"这份报告因对经济形势过度乐观而受到批评。"},{"en":"Don’t be overoptimistic—let’s make a backup plan in case things go wrong.","zh":"别太过乐观——我们做个备选方案，以防出问题。"}]}],"synonyms":["too optimistic","unrealistically optimistic","rose-colored","overconfident"],"phonetic":"/ˌoʊvərˌɑptəˈmɪstɪk/","extraExplanation":["“over-”表示“过度、超过正常程度”，所以 overoptimistic 通常带有轻微批评意味：不是单纯“积极”，而是“乐观到不切实际”。常见搭配：an overoptimistic estimate/forecast/timeline（过于乐观的估计/预测/时间表）。"]}
{"word":"overoptimistically","summary":{"en":"Overoptimistically means being too optimistic in an unrealistic way.","zh":"overoptimistically 指“过分乐观地”，常暗示不切实际。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too optimistic; expecting the best outcome more than is reasonable in the situation.","zh":"过分乐观地；（对情况）不太合理地抱有过高期待。"},"examples":[{"en":"He overoptimistically assumed the project would finish in two weeks.","zh":"他过分乐观地以为这个项目两周就能完成。"},{"en":"The team planned overoptimistically and ran out of time.","zh":"团队计划得过于乐观，结果时间不够用了。"},{"en":"She spoke overoptimistically about profits, ignoring the risks.","zh":"她谈利润时过分乐观，却忽视了风险。"}]}],"synonyms":["too optimistically","overly hopefully","unrealistically","naively"],"phonetic":"/ˌoʊvɚˌɑp.təˈmɪs.tɪk.li/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常/合理范围”。所以 overoptimistically 通常带有轻微的批评意味，暗示这种乐观可能不切实际。","更自然的替换说法有：too optimistically / unrealistically / overly hopeful（语气从客观到主观略有不同）。"]}
{"word":"overorder","summary":{"en":"Overorder means to order more than you need.","zh":"overorder 指“订购过量、订得超过需要”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to order more of something than is needed (often causing extra cost, waste, or storage problems)","zh":"过量订购；订得超过需要（常导致额外成本、浪费或库存压力）"},"examples":[{"en":"We overordered supplies for the event and ended up with dozens of unopened boxes.","zh":"我们为活动过量订购了物资，结果剩下好几十箱没拆封的。"},{"en":"If you overorder food, you’ll waste money and throw a lot away.","zh":"如果你食物订太多，就会浪费钱，还得丢掉很多。"},{"en":"The store overordered winter coats, so they had to discount them in spring.","zh":"那家店冬外套进货过多，所以春天不得不打折清仓。"}]}],"synonyms":["order too much","overstock","overbuy"],"phonetic":"/ˌoʊvɚˈɔɹdɚ/","extraExplanation":["“overorder”在日常英语里不算常见，更常写成“over-order”（加连字符）或用更常用的表达：order too much / overstock / overbuy。商业、采购、餐饮、零售等语境里更容易见到。","词义结构很透明：over-（过度）+ order（订购/点单）。多用于说明“订购决策失误”带来的后果，比如库存积压、保质期风险或资金占用。"]}
{"word":"overorganization","summary":{"en":"Overorganization means organizing too much—so many rules or procedures that work becomes slow or inflexible.","zh":"overorganization 指“过度组织”：规则/流程太多，导致工作变慢或缺乏弹性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of organizing something too much, with too many rules, procedures, layers, or controls, so that it becomes slow, rigid, or less effective","zh":"过度组织；组织得太复杂（指规则、流程、层级或控制过多，导致效率下降、僵化）"},"examples":[{"en":"Overorganization can slow down decision-making because every small step needs approval.","zh":"过度组织会拖慢决策，因为每个小步骤都需要批准。"},{"en":"The team’s creativity suffered from overorganization and constant paperwork.","zh":"团队的创造力因过度组织和不断的文书工作而受损。"}]}],"synonyms":["excessive bureaucracy","too much red tape","over-structuring","overmanagement","rigidity"],"phonetic":"/ˌoʊvɚˌɔrɡənəˈzeɪʃən/","extraExplanation":["这个词在日常口语里不算特别常见，更常见的表达有：\"too much bureaucracy\"（官僚作风太重）、\"overly structured\"（过于结构化）、\"red tape\"（繁文缛节）。","常用于管理、组织行为、公司文化等语境，带有负面评价：强调“本来为了提高效率的组织与流程，反而变成阻碍”。","拼写通常写作一个词 overorganization；也有人写作 over-organization（较少见）。"]}
{"word":"overorganize","summary":{"en":"Overorganize means to organize something too much, making it rigid or inefficient.","zh":"overorganize 指“整理/组织得过度”，使事情变得死板或反而低效。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to organize something too much or in an overly rigid way, so it becomes inefficient, stressful, or less flexible","zh":"把某事安排得过度、过于死板，导致效率下降、压力增加或缺乏弹性"},"examples":[{"en":"We overorganized the trip with a minute-by-minute schedule, and no one could relax.","zh":"我们把旅行安排得过于细碎，按分钟排计划，结果大家都放松不了。"},{"en":"If you overorganize meetings, people spend more time planning than doing.","zh":"如果你把会议流程组织得过度，大家就会把更多时间花在计划上，而不是做事。"}]},{"partOfSpeech":"v.","definition":{"en":"to put too many systems, rules, categories, or labels on something that doesn’t need them","zh":"给不需要复杂管理的事情加上过多制度、规则、分类或标签"},"examples":[{"en":"Don’t overorganize your notes—simple headings are enough.","zh":"别把笔记整理得过度——用简单的标题就够了。"},{"en":"The app overorganizes your photos with too many folders.","zh":"这个应用把照片分得过细，文件夹太多，反而显得过度整理。"}]}],"synonyms":["overstructure","overmanage","micromanage","overplan","be too rigid"],"phonetic":"/ˌoʊvərˈɔrɡənaɪz/","extraExplanation":["“over-” 这个前缀常表示“过度、太……”，带一点负面含义（比如 overwork 过度工作、overthink 想太多）。因此 overorganize 通常是在提醒：组织管理本来是好事，但过头会适得其反。","常见搭配：overorganize a project/meeting/schedule/notes（把项目/会议/日程/笔记组织得过度）。","写作与语气上，overorganize 比较口语化、偏现代职场/学习场景；在正式写作里也可用，但更常见的表达是 “be too rigid” 或 “overly structured”。"]}
{"word":"overorganized","summary":{"en":"“Overorganized” means organized too much—so strict or detailed that it becomes unhelpful.","zh":"“overorganized”指“过度有条理/过度组织”，细到或严到反而不方便、不灵活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too organized in a way that feels excessive, rigid, or unnecessary, often making things less flexible or more complicated than they need to be.","zh":"过度有条理的；组织得太过头（显得僵硬、繁琐或不必要，反而降低灵活性或把事情弄复杂）。"},"examples":[{"en":"The schedule is so overorganized that there’s no time for breaks or surprises.","zh":"这份日程安排得太过头了，连休息或临时变化的空间都没有。"},{"en":"Her notes were overorganized—color codes, tabs, and charts for every tiny detail.","zh":"她的笔记整理得过度了——每个小细节都有颜色标记、分页标签和图表。"},{"en":"We became overorganized and spent more time planning than actually doing the work.","zh":"我们变得过度规划了，花在计划上的时间比真正做事的时间还多。"}]}],"synonyms":["too structured","overly structured","too rigid","overplanned","overmanaged"],"phonetic":"/ˌoʊvərˈɔrɡəˌnaɪzd/","extraExplanation":["“over-”是常见前缀，表示“过度、过分”。因此“overorganized”通常带一点负面评价：不是“很会整理”，而是“整理到影响效率/弹性”。","常见近义表达：too structured（太刻板）、too rigid（太僵硬）、micromanaged（被过度管控/事无巨细地管理）。语气上，“overorganized”更口语、更轻微，有时也带一点调侃。"]}
{"word":"overorganizes","summary":{"en":"“Overorganizes” means organizes something too much, making it rigid or inefficient.","zh":"“overorganizes”指把事情组织/安排得过度，导致僵化或低效。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to organize something too much or in an overly strict, detailed way, so it becomes inefficient, rigid, or stressful","zh":"把某事安排得过度、过于细致或过于严格，以至于变得低效、僵化或让人有压力"},"examples":[{"en":"She overorganizes every trip, scheduling every minute, so no one can relax.","zh":"她把每次旅行都安排得过度，连每一分钟都排好，结果大家都放松不下来。"},{"en":"We’re overorganizing this meeting—let’s just decide the main points.","zh":"我们把这次会议安排得太复杂了——干脆先决定重点就好。"}]}],"synonyms":["overplan","micromanage","overmanage","overstructure"],"phonetic":"ˌoʊvərˈɔrɡənaɪzɪz","extraExplanation":["“overorganizes”是动词“overorganize”的第三人称单数（he/she/it overorganizes）。常见语气是轻微批评或自嘲，强调“组织/规划”本来是好事，但“过头了”会适得其反。","搭配提示：overorganize a schedule/meeting/event/plan（把时间表/会议/活动/计划安排得过度）。常与“micromanage（事无巨细地管）”“overplan（过度计划）”意思相近，但overorganize更强调“结构、分类、流程”弄得太复杂。"]}
{"word":"overorganizing","summary":{"en":"Overorganizing means organizing or planning too much, so it becomes rigid, unnecessary, or stressful.","zh":"overorganizing 指“过度整理／过度规划”，导致安排僵化、没必要或增加压力。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to organize something too much, in a way that becomes unnecessary, rigid, or stressful (often reducing flexibility or creativity)","zh":"过度整理／过度规划；把事情组织得太“细”“死”，以至于不必要、僵化或增加压力（常常降低灵活性或创造力）"},"examples":[{"en":"I spent the whole weekend overorganizing my notes, and I still didn’t start studying.","zh":"我整个周末都在过度整理笔记，结果还是没开始复习。"},{"en":"Overorganizing the schedule left no time for breaks or unexpected problems.","zh":"把日程过度规划后，连休息和处理突发问题的时间都没有了。"},{"en":"She worries that overorganizing every trip makes it less fun.","zh":"她担心把每次旅行都过度安排会让它变得没那么好玩。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of organizing too much; excessive planning/structuring","zh":"过度整理（的行为或习惯）；过度计划／过度结构化"},"examples":[{"en":"His overorganizing can slow the team down.","zh":"他这种过度整理的习惯会拖慢团队进度。"},{"en":"A little planning helps, but overorganizing can create anxiety.","zh":"适度计划有帮助，但过度规划可能会带来焦虑。"}]}],"synonyms":["overplanning","overstructuring","micromanaging","overmanaging"],"phonetic":"ˌoʊvərˈɔrɡənaɪzɪŋ","extraExplanation":["“over-”是常见前缀，表示“过度、太多”（例如: overwork 过度工作, overthink 想太多）。因此 overorganize/overorganizing 通常带有轻微负面评价：不是“更有条理”，而是“条理过头”。","使用建议：当你想表达“整理得很细致（正面）”，更常用 well-organized / carefully organized；当你想表达“为了控制感而安排太满（负面）”，可以用 overorganizing / micromanaging（更强调管得太细）。"]}
{"word":"overornament","summary":{"en":"“Overornament” means “too decorated or too fancy,” often criticizing something as overly ornate.","zh":"overornament 表示“装饰得太多、过分华丽”，常用于批评某物过于繁复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively decorated or fancy; having too many ornaments or details (often with a negative tone).","zh":"过度装饰的；过分华丽的（常带贬义）"},"examples":[{"en":"The hotel lobby looked overornamented, with gold trim on every surface.","zh":"酒店大堂看起来装饰过度，几乎每个表面都有金色镶边。"},{"en":"Her speech felt overornamented, so the main message got lost.","zh":"她的演讲显得过于辞藻堆砌，导致重点信息被淹没。"}]}],"synonyms":["overornamented","over-decorated","too ornate","gaudy","overelaborate"],"phonetic":"/ˌoʊvərˈɔrnəmənt/","extraExplanation":["“over-”表示“过度/太多”，加在形容词或动词前很常见：overconfident（过于自信）、overcook（煮过头）。因此 overornament 的核心语感就是“装饰得太多”。","这个词更常见的形式是 overornamented（过度装饰的）或 over-ornamented（带连字符），尤其在描述建筑、艺术设计、写作风格时。"]}
{"word":"overornamental","summary":{"en":"“Overornamental” describes something that is decorated too much, in a way that feels excessive or not tasteful.","zh":"“overornamental”指“装饰过度”，强调华丽堆砌到显得多余或不够得体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too decorative; having more ornament or decoration than is tasteful, necessary, or appropriate.","zh":"过于装饰的；装点太多而显得不合宜、不必要或不够得体的。"},"examples":[{"en":"The designer simplified the room because the original plan felt overornamental.","zh":"设计师把房间设计简化了，因为原来的方案显得过于装饰。"},{"en":"Her overornamental writing style made the main point hard to follow.","zh":"她过于堆砌辞藻的写作风格让重点变得难以把握。"},{"en":"The building’s overornamental façade distracts from its overall shape.","zh":"这栋建筑过于繁复的外立面让人忽略了整体的造型。"}]}],"synonyms":["overly ornate","too ornate","overdecorated","gaudy","overelaborate"],"phonetic":"/ˌoʊvərˌɔrnəˈmɛntəl/","extraExplanation":["“over-”这个前缀常表示“过度、太……”（如 overconfident 过于自信、overcooked 煮过头）。因此 overornamental 直观含义就是“装饰过度”。","该词在日常口语中不算高频，更常见的替代表达有 overly ornate、too ornate、overdecorated；用于设计、建筑、写作风格等语境时很贴切。"]}
{"word":"overornamentality","summary":{"en":"Overornamentality means having too much ornamentation or decorative detail, often to the point that it harms clarity or function.","zh":"overornamentality 指“过度装饰/过分华丽”，常用于批评：装饰或修辞多到影响清晰度或功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive use of decoration, detail, or stylistic flourish; being too ornate.","zh":"过度装饰；过分华丽（指装饰、细节或文风堆砌得太多）。"},"examples":[{"en":"The critic felt the building’s overornamentality distracted from its overall design.","zh":"评论家认为这座建筑的过度装饰分散了人们对整体设计的注意力。"},{"en":"In her essay, she argued that the novel’s overornamentality made the story harder to follow.","zh":"在她的文章中，她认为这部小说的过度辞藻堆砌让故事更难读懂。"},{"en":"The editor asked him to cut the overornamentality and write in a clearer style.","zh":"编辑让他删掉那些过度华丽的修饰，改用更清晰的文风。"}]}],"synonyms":["excessive ornamentation","over-ornamentation","ornateness","floridness","overembellishment"],"phonetic":"/ˌoʊvərˌɔrnəmenˈtæləti/","extraExplanation":["这个词比较少见，常见于批评语境（艺术、建筑、文学写作），带有负面评价：强调“装饰多到影响功能、清晰度或结构”。","更常用、更自然的表达包括：over-ornamentation、excessive ornamentation、too ornate（形容词）。"]}
{"word":"overornamentally","summary":{"en":"“Overornamentally” means “too decoratively; with excessive ornamental detail.”","zh":"“overornamentally”表示“过度装饰地；装饰细节过多”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly decorative way; with too many ornamental details.","zh":"以过度装饰的方式；装饰细节太多。"},"examples":[{"en":"The room was decorated overornamentally, so it felt busy and hard to relax in.","zh":"房间装饰得过于繁复，让人觉得很“满”、难以放松。"},{"en":"She wrote overornamentally, using too many adjectives and metaphors in every sentence.","zh":"她的写作过度堆砌辞藻，每句话都用了太多形容词和隐喻。"}]}],"synonyms":["too ornately","overly ornately","excessively","overdecoratively","with excessive decoration"],"phonetic":"/ˌoʊvərˌɔrnəˈmɛntəli/","extraExplanation":["这个词比较少见，常用于带批评语气的评价：比如批评建筑、室内设计、服装、文章风格“太花”“太繁”。","构词上是 over-（过度）+ ornamentally（装饰性地）。在更自然的表达里，人们更常说 too ornately / overly ornate / excessively decorative。"]}
{"word":"overornamentation","summary":{"en":"Overornamentation means excessive decoration that becomes distracting or less tasteful.","zh":"overornamentation 指“过度装饰”，装饰太多反而分散注意力或显得不够美观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"too much decorative detail; an excessive use of ornaments that makes something look busy or less tasteful","zh":"过度装饰；装饰细节太多，以至于显得繁杂或不够得体"},"examples":[{"en":"The designer warned that overornamentation would distract customers from the brand message.","zh":"设计师警告说，过度装饰会让顾客忽略品牌要传达的信息。"},{"en":"Some critics felt the building’s overornamentation hid its strong structure.","zh":"一些评论家认为，这座建筑的过度装饰掩盖了它坚实的结构。"},{"en":"In writing, overornamentation can make a simple idea hard to understand.","zh":"在写作中，过度“雕花式”的修饰会让简单的想法变得难懂。"}]}],"synonyms":["excessive ornamentation","over-decoration","gaudiness","floridness","excess"],"phonetic":"/ˌoʊvərˌɔrnəmenˈteɪʃən/","extraExplanation":["这个词由 over-（过度）+ ornamentation（装饰）构成，语气通常偏负面，常用于艺术、建筑、设计、写作等场景，强调“装饰多到影响清晰度或美感”。"]}
{"word":"overornamented","summary":{"en":"Overornamented means too heavily decorated or unnecessarily elaborate, in a way that can feel excessive.","zh":"overornamented 指“过度装饰/过于繁复”，常含“多得过头、影响美感或清晰度”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too decorated or detailed in a way that feels excessive and may look less tasteful.","zh":"过度装饰的；过于繁复的（常带贬义，指装饰太多反而显得不够雅致）。"},"examples":[{"en":"The room felt overornamented, with too many patterns competing for attention.","zh":"这个房间显得过度装饰，太多花纹抢着吸引注意力。"},{"en":"Her writing is clear, not overornamented with unnecessary adjectives.","zh":"她的写作很清晰，没有用不必要的形容词过度堆砌。"}]}],"synonyms":["overly ornate","overdecorated","too elaborate","florid","fussy"],"phonetic":"/ˌoʊvərˈɔrnəˌmɛntɪd/","extraExplanation":["“overornamented”由 over-（过度）+ ornament（装饰）+ -ed（形容词后缀）构成，语气通常偏负面，暗示“装饰多到影响整体效果”。","在艺术与设计语境中，它常与“简洁/克制”（simple, restrained, minimalist）形成对比；在写作语境中，常指文风“辞藻堆砌”，可近似理解为 overly ornate。"]}
{"word":"overoxidization","summary":{"en":"Overoxidization means excessive oxidation that causes unwanted changes or damage.","zh":"overoxidization 指“过度氧化”，即氧化过头而引发不良变化或损害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive oxidation; the process of being oxidized too much, often causing damage, loss of quality, or unwanted chemical changes.","zh":"过度氧化；被氧化得过多的过程，常导致损坏、品质下降或不希望发生的化学变化。"},"examples":[{"en":"Overoxidization can make cooking oil taste rancid and smell unpleasant.","zh":"过度氧化会让食用油产生哈喇味并散发难闻气味。"},{"en":"The chemist adjusted the temperature to prevent overoxidization of the sample.","zh":"化学家调整温度以防止样品过度氧化。"},{"en":"Exposure to air and light speeds up overoxidization in some products.","zh":"空气和光照会加速某些产品的过度氧化。"}]},{"partOfSpeech":"n.","definition":{"en":"(In materials and industry) an unwanted oxidative reaction that weakens or degrades a material (for example, metals, polymers, or battery components).","zh":"（材料与工业）不期望的氧化反应，使材料（如金属、聚合物或电池部件）变脆、变弱或性能下降。"},"examples":[{"en":"A protective coating helps reduce overoxidization of the metal surface.","zh":"保护涂层有助于减少金属表面的过度氧化。"},{"en":"Overoxidization of the electrode can shorten the battery’s lifespan.","zh":"电极过度氧化会缩短电池寿命。"}]}],"synonyms":["over-oxidation","overoxidation","excessive oxidation","oxidative degradation"],"phonetic":"/ˌoʊvərˌɑksɪdəˈzeɪʃən/","extraExplanation":["“overoxidization”在实际写作中较少见，更常见的拼写是“over-oxidation”或“overoxidation”。三者意思基本相同；科学论文里常用“over-oxidation”。","词根拆解：over-（过度）+ oxidation（氧化）。理解为“氧化得太多/太久”。","常见搭配：prevent overoxidation（防止过度氧化）、overoxidation of the surface/electrode（表面/电极的过度氧化）、oxidative degradation（氧化降解，常与该概念相关）。"]}
{"word":"overoxidize","summary":{"en":"Overoxidize means to oxidize too much, causing spoilage or damage (often in wine, oils, or food).","zh":"overoxidize 指“过度氧化”，因与氧气反应过度而导致变质或受损（常见于葡萄酒、油脂或食物）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to oxidize too much; to expose something to oxygen so long or so strongly that it becomes damaged, spoiled, or loses quality (common with food/drink, oils, and some materials).","zh":"过度氧化；使（某物）与氧气反应过度，从而导致变质、品质下降或受损（常用于食物/饮品、油脂及某些材料）。"},"examples":[{"en":"If you leave the wine bottle open overnight, you can overoxidize the wine and dull its flavor.","zh":"如果把葡萄酒瓶开着放一夜，酒可能会过度氧化，风味会变得平淡。"},{"en":"High heat can overoxidize cooking oil, making it smell stale.","zh":"高温可能会让食用油过度氧化，闻起来有哈喇味。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become oxidized too much (often describing wine, oils, or reactive surfaces).","zh":"（某物）过度氧化（常指葡萄酒、油脂或易反应的表面）。"},"examples":[{"en":"The sauce overoxidized after sitting uncovered for hours.","zh":"酱汁敞开放了好几个小时后发生了过度氧化。"},{"en":"Some delicate wines overoxidize quickly once opened.","zh":"有些细腻的葡萄酒开瓶后很快就会过度氧化。"}]}],"synonyms":["oxidize too much","over-oxidize","spoil (by oxidation)","go rancid (for oils)"],"phonetic":"/ˌoʊvərˈɑːksɪdaɪz/","extraExplanation":["在食品与饮料语境里，oxidize（氧化）不一定是“生锈”，更多指与氧接触后发生化学变化：风味变钝、颜色变深、产生陈腐气味等。葡萄酒里常见的相关词还有 oxidative（氧化风格的）与 oxidation（氧化过程）。","在科学/材料语境中，overoxidize 也可指把材料“氧化过头”，例如形成不理想的氧化层，影响导电性、强度或外观。"]}
{"word":"overoxidized","summary":{"en":"“Overoxidized” means oxidized too much, often resulting in damage or poorer quality.","zh":"“overoxidized”指“过度氧化”，常暗示因此受损或品质变差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Oxidized too much; having undergone more oxidation than is desirable or intended (often causing damage or a lower quality).","zh":"过度氧化的；氧化程度超过理想或预期（常导致损坏或品质下降）。"},"examples":[{"en":"The metal surface became overoxidized and developed a rough, flaky layer.","zh":"金属表面过度氧化，形成了粗糙、片状剥落的氧化层。"},{"en":"The wine tasted flat because it was overoxidized after the bottle was left open.","zh":"这瓶酒因为开瓶后放太久而过度氧化，喝起来变得寡淡无味。"}]}],"synonyms":["too oxidized","badly oxidized","over-oxidized","over-oxidated (less common)"],"phonetic":"/ˌoʊvərˈɑːksəˌdaɪzd/","extraExplanation":["“overoxidized”常见于化学、材料（金属/电池）、食品与饮料（如葡萄酒、油脂）等语境，表达“氧化过头”导致性能或风味变差。","相关表达：overoxidation（过度氧化，名词）、oxidize（氧化，动词）、oxidized（已氧化的，形容词）。在日常写作中，有时也会用“too oxidized / badly oxidized”来替代。"]}
{"word":"overoxidizing","summary":{"en":"“Overoxidizing” means oxidizing too much, causing damage or unwanted results.","zh":"“overoxidizing”指“过度氧化”，会造成损伤或不良结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"oxidizing something too much, so its quality worsens or unwanted byproducts form (often in chemistry, food, or materials).","zh":"（把某物）氧化过度，导致品质变差或产生不需要的副产物（常见于化学、食品或材料领域）。"},"examples":[{"en":"Overoxidizing the oil can create unpleasant flavors.","zh":"油脂过度氧化会产生令人不快的味道。"},{"en":"The metal surface turned dull because it was overoxidizing in humid air.","zh":"金属表面变暗，是因为在潮湿空气中过度氧化。"}]},{"partOfSpeech":"v.","definition":{"en":"the act/process of oxidizing too much; present participle of “overoxidize.”","zh":"过度氧化的过程；“overoxidize”的现在分词形式。"},"examples":[{"en":"If you keep heating it, you’re overoxidizing the compound.","zh":"如果你一直加热，你就是在让这种化合物过度氧化。"},{"en":"They adjusted the temperature to avoid overoxidizing the sample.","zh":"他们调整了温度以避免样品过度氧化。"}]}],"synonyms":["over-oxidation","excessive oxidation","oxidizing too much"],"phonetic":"ˌoʊvərˈɑːksəˌdaɪzɪŋ","extraExplanation":["“oxidize（氧化）”常指物质与氧发生反应或失去电子；“over-”表示“过度”。所以 overoxidizing 常用于说明“氧化超过理想程度”。","常见语境：食品（油脂酸败、异味）、材料（金属表面变暗/腐蚀加剧）、化学反应（生成过多副产物、降低产率）。在护发/染发语境中也可能指染膏或漂粉处理过度导致头发受损。"]}
