{"word":"overvaliant","summary":{"en":"“Overvaliant” means excessively brave, often to the point of being rash.","zh":"“overvaliant”指过分勇敢，常带有鲁莽、逞强的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too brave in a way that becomes rash or impractical; excessively daring","zh":"过分英勇的；过于胆大的（以至于显得鲁莽或不切实际）"},"examples":[{"en":"His overvaliant charge left him surrounded and quickly exhausted.","zh":"他那次过分英勇的冲锋让他陷入包围，很快就筋疲力尽了。"},{"en":"Be courageous, but don’t be overvaliant—think before you act.","zh":"要勇敢，但别过分逞勇——行动前先想清楚。"}]}],"synonyms":["foolhardy","reckless","overly bold","rash","daredevil"],"phonetic":"/ˌoʊvərˈvæljənt/","extraExplanation":["“overvaliant”比较少见，带一点文学/古风色彩。它由 over-（过度）+ valiant（英勇的）构成，常用来暗示“勇气过头就变成鲁莽”。在现代英语里，更常见的表达是 “recklessly brave / foolhardy / overly bold”。"]}
{"word":"overvaliantly","summary":{"en":"Overvaliantly means acting too bravely—so brave that it becomes unwise or risky.","zh":"overvaliantly 指“勇敢过头”，以至于显得不明智或带来风险。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is excessively brave or daring; more bravely than is wise or appropriate.","zh":"以过度英勇/鲁莽的方式；勇敢过头，以至于不够明智或不合时宜。"},"examples":[{"en":"He charged forward overvaliantly, ignoring the danger and the plan.","zh":"他过于英勇（近乎鲁莽）地冲了上去，无视危险和原定计划。"},{"en":"The speech praised her courage, but admitted she had acted overvaliantly.","zh":"演讲称赞了她的勇气，但也承认她的做法有些过度英勇。"}]}],"synonyms":["too bravely","overly boldly","recklessly","foolhardily","rashly"],"phonetic":"/ˌoʊvərˈvæljəntli/","extraExplanation":["这个词非常少见，更多时候英语会用更自然的表达来替代，例如: “too bravely,” “overly boldly,” “recklessly,” 或 “foolhardily”。","构词上是 over-（过度）+ valiantly（英勇地）。在文学或较正式的叙述中偶尔会用来强调“勇敢得过头”，带一点批评或惋惜的语气。"]}
{"word":"overvaliantness","summary":{"en":"Overvaliantness means excessive, sometimes reckless bravery.","zh":"overvaliantness 指“过度的英勇/逞勇”，常带批评意味，暗示接近鲁莽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or showy bravery; being “too valiant,” sometimes to the point of recklessness","zh":"过度的英勇；逞勇好胜到近乎鲁莽的程度"},"examples":[{"en":"His overvaliantness pushed him to take risks that endangered the whole team.","zh":"他那种过度逞勇的劲头让他冒了险，反而把整个团队置于危险之中。"},{"en":"The novel criticizes the hero’s overvaliantness as a kind of pride, not true courage.","zh":"小说批评主人公的过度英勇其实是一种傲气，并非真正的勇气。"}]}],"synonyms":["recklessness","foolhardiness","rashness","overconfidence","needless heroics"],"phonetic":"/ˌoʊvɚˈvæljəntnəs/","extraExplanation":["这是一个非常少见、带有“临时造词/文学用词”色彩的名词：over-（过度）+ valiant（英勇的）+ -ness（名词后缀）。常用来带一点批评意味，强调“勇敢过头”导致鲁莽或逞强。","在日常英语里更常见的表达是：recklessness（鲁莽）、overconfidence（过度自信）、needless heroics（不必要的逞英雄）、foolhardiness（有勇无谋）。"]}
{"word":"overvaluable","summary":{"en":"Overvaluable means too valuable or valued too highly (often suggesting overestimation).","zh":"overvaluable 指“过于珍贵/被看得过于重要”，常含“高估”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too valuable, or considered more valuable than is appropriate; excessively valued.","zh":"过于珍贵的；被看得过于重要的；价值被高估的。"},"examples":[{"en":"Some fans treat the limited edition card as overvaluable, even though it was mass-produced.","zh":"有些粉丝把那张限量卡看得过于珍贵，尽管它其实是大量生产的。"},{"en":"In the early stage, the startup’s shares were overvaluable compared with its actual profits.","zh":"在早期阶段，这家初创公司的股票相对其实际利润来说被高估了。"}]}],"synonyms":["overvalued","too valuable","overpriced","overestimated"],"phonetic":"/ˌoʊvərˈvæljuəbəl/","extraExplanation":["“overvaluable”并不常见；在日常英语里更自然的说法通常是“overvalued（被高估的）”或“too valuable（太贵重/太有价值）”。","注意不要和“invaluable（极其宝贵的）”混淆：invaluable 表示“非常有价值”，不是“价值太高/被高估”。","语感上，“overvaluable”更像是“价值或重要性被抬得过高”，带一点批评意味。"]}
{"word":"overvaluableness","summary":{"en":"Overvaluableness means the state or quality of being valued too highly; it is rare, and “overvaluation” is more common.","zh":"overvaluableness 指“被看得过高／被高估的状态”，但很少用，更常见的是 overvaluation。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being valued too highly; an exaggerated sense of worth (often used about someone’s importance, a product, or an idea)","zh":"被估价过高／被看得过重的状态；（对某人、某物或某种想法的）价值夸大"},"examples":[{"en":"The overvaluableness of the brand faded after the scandal.","zh":"丑闻之后，这个品牌被看得过高的光环逐渐消退。"},{"en":"Her essay argues that the overvaluableness of test scores can harm creativity.","zh":"她的文章认为，把考试分数看得过于重要会伤害创造力。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the degree to which something is overpriced or overrated","zh":"（罕见）某物被高估／被高价出售的程度"},"examples":[{"en":"Investors debated the overvaluableness of the company’s stock.","zh":"投资者在争论该公司股票被高估的程度。"}]}],"synonyms":["overvaluation","overrating","inflated value","overpricing","overestimating"],"phonetic":"/ˌoʊvərˈvæljuəbəlnəs/","extraExplanation":["“overvaluableness”在现代英语里非常少见，通常更自然的表达是“overvaluation”（高估、估价过高）或“overvaluing”（过度重视）。在正式写作或金融语境中，优先用“overvaluation”。","构词理解：over-（过度）+ valuable（有价值的）+ -ness（名词后缀，表示“性质/状态”）。因此它直译就是“过度有价值的性质”，语感上会显得笨重。"]}
{"word":"overvaluably","summary":{"en":"“Overvaluably” means “in an overvalued or excessively valued way,” but it is uncommon in everyday English.","zh":"“overvaluably”表示“以过高估值/过度看重的方式”，但在日常英语中不常用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that assigns too high a value, importance, or price; excessively and unrealistically.","zh":"以（对价格、价值或重要性）估计过高的方式；过度地、不切实际地。"},"examples":[{"en":"The startup was overvaluably priced during the boom, and investors later lost money.","zh":"在繁荣期，这家初创公司被过高定价，后来投资者亏了钱。"},{"en":"Some people treat prestige overvaluably and ignore basic well-being.","zh":"有些人把“名望”看得过高，而忽视了基本的幸福感。"}]}],"synonyms":["excessively","overly","unduly","at an inflated value","too highly"],"phonetic":"/ˌoʊvɚˈvæljuəbli/","extraExplanation":["“overvaluably”在现代英语中很少见，写作和口语更常用“overly / excessively / at an inflated value（以虚高的价格）”。在正式财经语境里，也常写“was overvalued”或“was valued too highly”。"]}
{"word":"overvaluation","summary":{"en":"Overvaluation means valuing something too highly compared with its fair or real value, especially in finance, or praising/estimating someone or something more than it deserves in everyday contexts.","zh":"Overvaluation 指“高估”，即把某物的价值估得高于其真实/公允价值（多用于金融），也可指日常中对某人或某事评价过高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of valuing something (such as a company, stock, home, or currency) too highly compared with its real or fair value.","zh":"（对公司、股票、房产或货币等的）高估；估价过高，超过其真实或公允价值。"},"examples":[{"en":"The report warned that the stock’s price reflects overvaluation rather than real growth.","zh":"报告警告说，这只股票的价格反映的是高估，而不是真实增长。"},{"en":"Overvaluation of housing can lead to a market correction later.","zh":"房价的高估可能会在之后引发市场回调。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday use, treating someone or something as more important, talented, or successful than is justified.","zh":"（日常用法）对某人/某事评价过高；把其重要性、能力或成就看得过头。"},"examples":[{"en":"There’s an overvaluation of popularity online as a measure of real influence.","zh":"人们往往高估网络人气，把它当成真实影响力的衡量标准。"},{"en":"His confidence came from an overvaluation of his own experience.","zh":"他的自信源于对自己经验的过度高估。"}]}],"synonyms":["overpricing","overestimation","inflated valuation","exaggeration"],"phonetic":"/ˌoʊvɚˌvæljuˈeɪʃən/","extraExplanation":["在金融语境中，overvaluation 常与 undervaluation（低估）相对，常见搭配有 overvalued stock/currency/asset（被高估的股票/货币/资产）。当市场普遍高估时，后续可能出现 correction（回调）或 bubble（泡沫）破裂等说法。","词形：over-（过度）+ valuation（估价/评价）。更常见的形容词形式是 overvalued（被高估的）。"]}
{"word":"overvalue","summary":{"en":"Overvalue means to value something too highly—either in price (finance) or in importance (everyday life).","zh":"Overvalue 指“高估/过分看重”，既可指价格或估值过高（金融），也可指把重要性看得过高（日常）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to consider someone or something more important, useful, or valuable than it really is; to place too high a value on something","zh":"高估；过分看重（某人或某物）；把……估价过高"},"examples":[{"en":"People often overvalue brand names and ignore quality.","zh":"人们常常过分看重品牌，而忽视质量。"},{"en":"Don’t overvalue one test score—it doesn’t define your ability.","zh":"别高估一次考试成绩——它不能定义你的能力。"},{"en":"The stock was overvalued, so the price later dropped.","zh":"这只股票被高估了，所以后来价格下跌了。"}]}],"synonyms":["overestimate","overrate","inflate","exaggerate","overprice"],"phonetic":"/ˌoʊvɚˈvæljuː/","extraExplanation":["在金融语境里，overvalue 常指“估值高于真实/合理价值（overvalued）”，例如股票、货币或公司；相对词是 undervalue（低估）。","在日常生活里，overvalue 更偏“过分看重”，常用于抽象事物（名气、头衔、外表、一次表现等），语气通常带提醒或批评。","构词：over-（过度）+ value（价值/重视），所以字面意思就是“给得太多价值”。"]}
{"word":"overvalued","summary":{"en":"Overvalued means priced or judged as more valuable/important than it truly is.","zh":"overvalued 指“被高估的”，即价格或评价高于其真实价值或重要性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Worth more than it should be; priced too high for its real quality or value.","zh":"被高估的；价值或价格高于其实际应有水平的。"},"examples":[{"en":"That stock looks overvalued right now, so I’m not buying it.","zh":"那只股票现在看起来被高估了，所以我不买。"},{"en":"The apartment is overvalued for such a small space.","zh":"这么小的房子却要这么高的价格，明显被高估了。"},{"en":"Some people think fame is overvalued compared with a quiet life.","zh":"有些人认为名声相较于安静的生活被高估了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Considered more important or better than it really is.","zh":"被认为比实际更重要或更好；被过分看重的。"},"examples":[{"en":"In that company, long meetings are overvalued as a sign of productivity.","zh":"在那家公司，冗长的会议被过分看重，被当作“高产出”的标志。"},{"en":"He felt his role was overvalued by the media.","zh":"他觉得媒体把他的角色过分拔高了。"}]}],"synonyms":["overpriced","inflated","overestimated","overrated"],"phonetic":"/ˌoʊvɚˈvæljud/","extraExplanation":["“overvalued”常用于金融与商业语境：例如“an overvalued stock / currency（被高估的股票/货币）”。也可用于日常评价，表示某件事被过度吹捧或被赋予过高意义。","词形结构：over-（过度）+ valued（被评估/被赋值）。常见反义表达包括“undervalued（被低估的）”。"]}
{"word":"overvalues","summary":{"en":"“Overvalues” means values something too highly or overestimates its true worth, often used for opinions, importance, prices, or financial assets.","zh":"“overvalues” 表示把某事物看得过于重要或把其真实价值估得过高，常用于评价重要性、价格或金融资产等。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to judge something’s worth or importance as higher than it really is; to value too highly","zh":"高估；把……看得过于重要（价值或重要性被估得过高）"},"examples":[{"en":"He overvalues other people’s opinions and forgets his own goals.","zh":"他过于看重别人的看法，反而忘了自己的目标。"},{"en":"Many beginners overvalue speed and undervalue accuracy.","zh":"很多初学者高估速度、低估准确性。"},{"en":"She tends to overvalue small successes and feel discouraged by normal mistakes.","zh":"她容易把小小的成功看得过重，却会被正常的错误打击到。"}]},{"partOfSpeech":"vt.","definition":{"en":"(business/finance) to set or treat a price, asset, or company as worth more than its real market value","zh":"（商业/金融）把（价格、资产或公司）估值定得过高；高估（市场价值）"},"examples":[{"en":"Some investors think the market overvalues the company’s stock.","zh":"一些投资者认为市场把这家公司的股票估值过高。"},{"en":"If a house is overvalued, buyers may pay more than it’s truly worth.","zh":"如果房子被高估，买家可能会付出超过真实价值的价格。"}]}],"synonyms":["overestimate","exaggerate","rate too highly","inflate","overprice"],"phonetic":"/ˌoʊvərˈvæljuː/","extraExplanation":["“overvalues” 是动词 “overvalue” 的第三人称单数形式（he/she/it overvalues）。常见搭配：overvalue something；be overvalued（被高估）。也常与 undervalue（低估）成对出现，帮助对比记忆。"]}
{"word":"overvaluing","summary":{"en":"Overvaluing means valuing something too highly—more than it deserves in price, importance, or worth.","zh":"Overvaluing 指“高估/过度看重”，把某事物的价格、重要性或价值看得超过实际。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of valuing something too highly; treating it as more important, valuable, or costly than it really is","zh":"高估；过度看重（把某事物的价值、重要性或价格看得比实际更高）"},"examples":[{"en":"Overvaluing a brand name can make you ignore better and cheaper options.","zh":"过度看重品牌名，可能会让你忽视更好、更便宜的选择。"},{"en":"His overvaluing of short-term success hurt the team’s long-term growth.","zh":"他过度看重短期成功，伤害了团队的长期发展。"}]},{"partOfSpeech":"v.","definition":{"en":"valuing something too highly; assigning it a value, price, or importance that is greater than it should be","zh":"高估；把……估得过高（在价值、价格或重要性上给出过高判断）"},"examples":[{"en":"Investors are overvaluing the stock based on hype rather than results.","zh":"投资者在炒作影响下高估了这只股票，而不是基于实际业绩。"},{"en":"She is overvaluing that comment—it was probably just a joke.","zh":"她把那句话看得太重了——那大概只是个玩笑。"}]}],"synonyms":["overestimate","overrate","exaggerate the value of","inflate","overprice"],"phonetic":"/ˌoʊvərˈvæljuɪŋ/","extraExplanation":["“overvaluing”常见于金融语境，表示“估值过高”（例如股票、房产被高估），暗示价格可能偏离真实价值，存在回落风险。","和“overestimate”相比，“overvalue”更强调“价值/价格/重要性”的判断；“overestimate”更泛指对数量、能力、影响等的高估。"]}
{"word":"overvariation","summary":{"en":"Overvariation means an excessive amount of variation, especially in technical or academic contexts.","zh":"Overvariation 指“过度的变化/变异”，常见于技术或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"too much variation (difference or diversity) in something, often seen as unnecessary or harmful; an excessive level of variability","zh":"过度变异；过度变化（某事物的差异或多样性过多，常被认为没有必要或会带来负面影响）"},"examples":[{"en":"The engineer reduced overvariation in the parts so they would fit together more reliably.","zh":"工程师减少了零件的过度变异，这样它们能更可靠地装配在一起。"},{"en":"In the data, overvariation can hide the real trend.","zh":"在数据中，过度变异可能会掩盖真实趋势。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/genetics) a level of variation in a population that is greater than expected under a simple model","zh":"（生物/遗传）在某个群体中，变异程度高于简单模型所预测的水平"},"examples":[{"en":"Researchers observed overvariation in the gene frequencies and looked for environmental explanations.","zh":"研究人员观察到基因频率存在过度变异，并寻找环境方面的解释。"},{"en":"The model failed because it could not account for the overvariation in the population.","zh":"这个模型失败了，因为它无法解释群体中的过度变异。"}]}],"synonyms":["excessive variation","too much variation","overdispersion (statistics)","high variability"],"phonetic":"/ˌoʊvərˌvɛriˈeɪʃən/","extraExplanation":["“over-”表示“过度”，与“variation（变化/变异）”组合后常用于学术或技术语境（统计、质量控制、生物学）。日常英语里更常说“too much variation”“excessive variation”或在统计里说“overdispersion（过度离散）”。","在统计学中，人们有时用“overvariation”泛指“比模型预期更大的波动”，更标准的术语往往是“overdispersion”。注意不要与机器学习里的“overfitting（过拟合）”混淆：过拟合强调模型“学得太细”导致泛化差，而“overvariation/overdispersion”强调数据本身波动过大。"]}
{"word":"overvaried","summary":{"en":"“Overvaried” means excessively varied—having too many different elements, often in a way that feels unfocused or messy.","zh":"“Overvaried”表示“过于多样化”，指元素太多、变化太杂，常带有不够统一或显得杂乱的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having too many different kinds or elements; excessively varied or mixed","zh":"种类或成分过多的；过于多样化（以至于显得杂乱或不统一）"},"examples":[{"en":"The menu felt overvaried, so it was hard to choose one dish.","zh":"菜单种类太多，反而很难选一道菜。"},{"en":"Her essay was overvaried in style, jumping from formal language to slang.","zh":"她的文章风格过于多变，一会儿正式一会儿又用俚语。"},{"en":"An overvaried color palette can make a design look busy.","zh":"配色过于繁杂会让设计看起来很乱。"}]}],"synonyms":["overly varied","too varied","overly diverse","mixed","busy","cluttered"],"phonetic":"/ˌoʊvɚˈvɛrid/","extraExplanation":["“Overvaried”并不是非常常见的日常用词，更常见的表达包括：too varied / overly varied / too diverse / cluttered / busy（用于设计或表达）。","构词上是 over-（“过度”）+ varied（“多样的”），通常带有“多到不协调、不统一”的负面语气。"]}
{"word":"overvariety","summary":{"en":"Overvariety means an excessive amount of variety—too many options or types.","zh":"overvariety 指“过度多样性”：选择或种类多到不利于理解与决策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive amount of variety; having too many different options or types, often to the point that it becomes confusing or unhelpful","zh":"过度多样性；种类或选择太多，多到令人困惑或反而不方便"},"examples":[{"en":"The menu’s overvariety made it hard to decide what to order.","zh":"菜单的种类过多，让人很难决定点什么。"},{"en":"In design, overvariety can distract users from the main message.","zh":"在设计中，过度多样性会分散用户对主要信息的注意力。"},{"en":"Too much overvariety in a schedule can make planning stressful.","zh":"日程安排如果变化太多、种类过多，会让规划变得有压力。"}]}],"synonyms":["excessive variety","too much variety","choice overload","overabundance of options"],"phonetic":"/ˌoʊvərvəˈraɪəti/","extraExplanation":["“overvariety”并不是非常常见或固定的标准词汇，更常见的表达是“too much variety / excessive variety / an overload of choices”。在日常写作中使用“overvariety”通常带有“自造复合词”或较书面化的感觉。","含义上它和“choice overload（选择过载）”“paradox of choice（选择的悖论）”相关：选择越多不一定越幸福，反而可能更难下决定、也更容易后悔。"]}
{"word":"overvary","summary":{"en":"“Overvary” is not standard English; it may be intended to mean “vary too much,” but clearer alternatives are recommended.","zh":"“overvary”不是标准英语；可能想表达“变化过度”，但建议换用更常见、更清晰的表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"A rare or nonstandard word; most English speakers do not use “overvary.” It may be a misspelling or an ad‑hoc coinage meaning “to vary too much.”","zh":"一个很少见、非标准的词；大多数英语母语者不会使用“overvary”。它可能是拼写错误，或临时造词，想表达“变化过度/变来变去太多”。"},"examples":[{"en":"This word is not common in dictionaries; consider using a clearer verb like “vary too much.”","zh":"这个词在词典里并不常见；建议用更清楚的表达，比如“vary too much（变化太多）”。"},{"en":"In reports, avoid overvarying your terms—use consistent wording.","zh":"写报告时，避免把术语变来变去太多——尽量保持用词一致。"}]}],"synonyms":["vary too much","make too many changes","overcomplicate","be inconsistent"],"phonetic":"ˌoʊvərˈvɛri","extraExplanation":["“overvary”更可能是把“overwary（过于警惕）”或“overworry（过度担心）”打错了。如果你想表达“过于警惕”，正确词通常是“overwary”。","如果你想表达“变化太多/过度变化”，更自然的说法有：“vary too much,” “make too many changes,” “overcomplicate,” 或 “be inconsistent.”"]}
{"word":"overvarying","summary":{"en":"“Overvarying” means changing or varying too much, causing inconsistency or confusion.","zh":"“overvarying”指“变化过度、太不稳定”，容易导致不一致或混乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"varying too much; changing so often or in so many ways that it becomes confusing, inconsistent, or hard to control.","zh":"变化过度的；变动太频繁或差异太大，以至于让人困惑、不一致或难以控制。"},"examples":[{"en":"The overvarying schedule made it hard for employees to plan their week.","zh":"过度变动的排班让员工很难规划一周。"},{"en":"Try to simplify the design—too many overvarying colors can distract the reader.","zh":"尽量简化设计——颜色过度变化会分散读者注意力。"}]},{"partOfSpeech":"vi.","definition":{"en":"the -ing form of “overvary,” meaning to vary or change too much.","zh":"“overvary”的 -ing 形式，表示“过度变化；变化过多”。"},"examples":[{"en":"The system is overvarying its responses instead of following a stable pattern.","zh":"系统的反应过度变化，而不是遵循稳定的模式。"},{"en":"Overvarying the rules can make the game feel unfair.","zh":"规则变化过度会让游戏显得不公平。"}]}],"synonyms":["too variable","overly varied","inconsistent","changeable"],"phonetic":"/ˌoʊvərˈvɛriɪŋ/","extraExplanation":["“overvarying / overvary”都不是常见词，在日常英语里更常用的表达有：“too variable（太不稳定）”“overly varied（过于多样）”“inconsistent（不一致）”“changing too much（变化太多）”。如果你在写作里想更自然，通常用这些更地道。"]}
{"word":"overvault","summary":{"en":"Overvault means either to vault/leap over an obstacle or (in architecture) to cover something with a vaulted roof or arch.","zh":"overvault 可指“跃过/撑越过障碍”，也可指（建筑）“在上方建拱顶、用拱顶覆盖”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to leap or vault over something; to clear (an obstacle) by vaulting","zh":"（用撑杆跳等方式）跃过、撑越过某物；越过（障碍）"},"examples":[{"en":"The athlete overvaulted the barrier with ease.","zh":"运动员轻松地撑越过了栏架。"},{"en":"He tried to overvault the fence but slipped on the wet ground.","zh":"他试图跃过栅栏，但在湿滑的地面上打滑了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to form an arch or vaulted roof over something; to cover with vaulting (architecture)","zh":"（建筑）在……上方建拱顶；用穹顶/拱顶覆盖"},"examples":[{"en":"The hallway is overvaulted with stone arches.","zh":"走廊上方用石拱顶覆盖。"},{"en":"Medieval builders often overvaulted chapels to create a sense of height and awe.","zh":"中世纪的建造者常在小礼拜堂上方建拱顶，以营造高耸与庄严之感。"}]}],"synonyms":["vault over","leap over","clear","arch over","roof over (architecture)"],"phonetic":"/ˌoʊvɚˈvɔlt/","extraExplanation":["“overvault”不是日常高频词，更常见于两类语境：①运动/体操（vault over = 跃过）；②建筑史与建筑描述（vault = 拱顶、穹顶）。在建筑语境里，它强调“在上方用拱顶覆盖”，常见于教堂、回廊等结构的说明文字。"]}
{"word":"overvehemence","summary":{"en":"Overvehemence means showing too much intensity or strong emotion, especially in speech or argument.","zh":"Overvehemence 指在言语或争论中表现出“过度的激烈/强烈情绪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive force, intensity, or strong emotion in speaking, arguing, or expressing feelings; too much vehemence.","zh":"（言语、争论或情绪表达中）过度的激烈、强烈或情绪冲动；过分的激动。"},"examples":[{"en":"Her overvehemence in the meeting made it hard for others to share their ideas.","zh":"她在会议上过于激烈的表达，让别人很难发表自己的想法。"},{"en":"The editor cut a few lines to reduce the overvehemence of the article’s tone.","zh":"编辑删掉了几句话，以减弱文章语气中过度的激烈感。"},{"en":"He apologized for his overvehemence and tried to restate his point calmly.","zh":"他为自己的过度激烈道歉，并试着平静地重述观点。"}]}],"synonyms":["excessive intensity","overzealousness","aggressiveness","overreaction","excessive fervor"],"phonetic":"/ˌoʊvərˈviəməns/","extraExplanation":["这个词由 over-（“过度”）+ vehemence（“激烈、强烈”）构成，语感上强调“强烈得有点过头”，常带负面评价，暗示影响沟通或显得不够理性。","用法上多出现在较正式的写作或评论里；日常口语更常说 “too intense / too aggressive / overreacting”。"]}
{"word":"overvehement","summary":{"en":"“Overvehement” means excessively forceful or intense (rare in modern English).","zh":"“overvehement”指“过于激烈/过分强烈”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Too forceful, emotional, or intense in expression; excessively vehement.","zh":"（罕用）过于激烈的；情绪或表达过分强烈的；过度愤慨的。"},"examples":[{"en":"His overvehement reaction made the discussion feel like a personal attack.","zh":"他过于激烈的反应让讨论变得像人身攻击。"},{"en":"Try not to sound overvehement in emails—strong words can be misunderstood.","zh":"邮件里尽量别显得过于激烈——强硬措辞容易被误解。"}]}],"synonyms":["overly vehement","too vehement","excessive","overzealous","intemperate"],"phonetic":"/ˌoʊvɚˈviəmənt/","extraExplanation":["“overvehement”在现代英语里非常少见，更多时候人们会说“too vehement / overly vehement / excessively vehement”。","构词上：over- 表示“过度”，vehement 表示“激烈的、强烈的”。因此它的意思很直观，但因为不常用，正式写作里更推荐用更常见的表达。"]}
{"word":"overvehemently","summary":{"en":"“Overvehemently” means “too forcefully or intensely,” often suggesting the intensity is inappropriate or counterproductive.","zh":"“overvehemently”表示“过于激烈/过分强烈地”，常暗示这种强烈态度不恰当，甚至可能适得其反。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively forceful, intense, or emotional way; too strongly.","zh":"过于激烈地；过分强烈或情绪化地。"},"examples":[{"en":"She overvehemently denied the rumor, which made people even more suspicious.","zh":"她过于激烈地否认那个谣言，反而让人更起疑。"},{"en":"He argued overvehemently in the meeting and didn’t leave room for others to speak.","zh":"他在会议上争辩得过于激烈，没有给别人发言的空间。"}]}],"synonyms":["too vehemently","too strongly","too forcefully","overpassionately","excessively"],"phonetic":"/ˌoʊvɚˈviəməntli/","extraExplanation":["“overvehemently”由 over-（过度）+ vehemently（激烈地）构成，语气通常带有批评或提醒：不仅是“很激烈”，而是“激烈得不合适/超过必要程度”。","这个词在日常口语中不算常见；更自然的替换说法包括：“too vehemently / too strongly / too passionately”。在正式写作或评论中使用更常见。","使用场景多与“否认、抗议、争论、反对”等搭配，暗示说话者的强烈态度可能适得其反（越用力越显得不可信或不理性）。"]}
{"word":"overvehementness","summary":{"en":"“Overvehementness” (rare/nonstandard) means excessive vehemence—being too intense or forceful, especially in speech or argument.","zh":"“overvehementness”（罕见/非标准）指“过度激烈”，尤其指在言语或争论中过分强硬、情绪过强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare or nonstandard) the quality of being too vehement—showing excessively strong or intense feelings, especially in speech or argument.","zh":"（罕见或非标准用法）过度激烈（言辞/态度过于强烈）的状态；过分强硬或情绪化的表达。"},"examples":[{"en":"His overvehementness in the meeting made it hard for others to share their ideas.","zh":"他在会议上表现得过于激烈，让别人很难表达自己的想法。"},{"en":"The teacher asked her to tone down her overvehementness and respond more calmly.","zh":"老师让她收敛一下过度激烈的态度，更冷静地回应。"}]}],"synonyms":["overvehemence","excessive vehemence","overemphasis","overzealousness","intensity"],"phonetic":"/ˌoʊvɚˈviəməntnəs/","extraExplanation":["“overvehementness”在现代英语里非常少见，很多情况下会被视为不太自然的造词或拼写。更常见、更地道的表达是：**overvehemence**（过度激烈）、**excessive vehemence**（过分激烈）、或直接说 **being too vehement**（太激烈）。","词根理解：**vehement** 表示“情绪/措辞强烈的、激烈的”。前缀 **over-** 表示“过度”。因此整体意思很好猜，但写作中建议用更常见的替代词以显得更自然。"]}
{"word":"overveil","summary":{"en":"Overveil means to cover or obscure something as if with a veil.","zh":"overveil 指“如同蒙上面纱般遮盖或使变得朦胧/隐约”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To cover with a veil, or to hide/soften something as if a veil were placed over it.","zh":"用面纱遮盖；（比喻）像蒙上一层纱一样使事物变得朦胧、隐约。"},"examples":[{"en":"A thin mist seemed to overveil the hills at dawn.","zh":"清晨，一层薄雾仿佛给群山蒙上了一层纱。"},{"en":"Grief can overveil even happy memories for a while.","zh":"悲伤有时会在一段时间里给快乐的回忆蒙上阴影。"}]}],"synonyms":["veil","shroud","obscure","cloud","mask","cover"],"phonetic":"/ˌoʊvɚˈveɪl/","extraExplanation":["“overveil”比较少见，带有文学/诗意色彩；日常英语更常用“veil, shroud, obscure, cloud, cover”。","常用于描写自然景象（雾、云、暮色）或抽象感受（悲伤、恐惧）“像面纱一样遮住/淡化”某物，语气比普通的“cover”更含蓄、柔和。"]}
{"word":"overventilate","summary":{"en":"Overventilate means to breathe too fast/deeply (often from anxiety) or to ventilate a space more than needed.","zh":"Overventilate 指（常因焦虑等）呼吸过快/过深，或对空间通风过度。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to breathe too fast or too deeply, often because of anxiety, pain, or panic (which can cause dizziness or tingling)","zh":"（常因紧张、疼痛或惊恐而）呼吸过快或过深，可能引起头晕、手脚发麻等"},"examples":[{"en":"She started to overventilate during the panic attack.","zh":"她在惊恐发作时开始呼吸过快。"},{"en":"If you feel dizzy and your fingers tingle, you might be overventilating.","zh":"如果你觉得头晕、手指发麻，你可能是在过度换气。"}]},{"partOfSpeech":"vt.","definition":{"en":"to ventilate a room or space more than necessary","zh":"（对房间/空间）通风过度，换气过多"},"examples":[{"en":"In winter, it’s easy to overventilate the room and waste heat.","zh":"冬天很容易把房间通风过度，白白散失热量。"},{"en":"Don’t overventilate the greenhouse; the plants need stable warmth.","zh":"别把温室通风过度；植物需要稳定的温度。"}]}],"synonyms":["hyperventilate","breathe too fast","over-aerate","over-ventilate"],"phonetic":"ˌoʊvərˈvɛntəˌleɪt","extraExplanation":["在医学语境里，overventilate 常与 hyperventilate（过度换气）意思非常接近；日常更常见的是 hyperventilate。过度换气会让体内二氧化碳下降，可能出现头晕、胸闷、手脚发麻等感觉。若症状严重或持续，应寻求专业医疗帮助。"]}
{"word":"overventilated","summary":{"en":"Overventilated means either breathing too fast/deeply (often from stress) or being ventilated more than necessary (a room/building).","zh":"overventilated 指“（人）呼吸过快/过深导致不适”，也可指“（空间）通风过度”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) having breathed too fast or too deeply, often causing dizziness, tingling, or feeling faint (a state similar to hyperventilation).","zh":"（指人）呼吸过快或过深，常导致头晕、手脚刺痛或快要昏倒（类似“过度换气/呼吸过度”）。"},"examples":[{"en":"After the panic attack, she felt light-headed and realized she had overventilated.","zh":"恐慌发作后，她觉得头晕，意识到自己呼吸过度了。"},{"en":"He tried to slow his breathing because he was starting to feel overventilated.","zh":"他试着放慢呼吸，因为他开始感觉自己呼吸过度了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a room/building) supplied with more fresh air than needed, which can make it uncomfortably cold, dry, or waste energy.","zh":"（指房间/建筑）通风过度，导致太冷、太干，或浪费能源。"},"examples":[{"en":"The office was overventilated in winter, so everyone kept their coats on.","zh":"冬天办公室通风过度，大家都一直穿着外套。"},{"en":"An overventilated classroom can feel dry and drafty.","zh":"通风过度的教室会让人觉得干燥、有穿堂风。"}]}],"synonyms":["hyperventilated","breathing too fast","over-aired","over-ventilated"],"phonetic":"/ˌoʊvərˈvɛntəˌleɪtɪd/","extraExplanation":["“overventilated”是动词“overventilate”的过去分词/形容词用法。描述人时，多与焦虑、恐慌有关；本质是把二氧化碳呼出太多，可能引起头晕、手麻等不适。","描述空间时，常出现在暖通空调（HVAC）、节能或室内舒适度的语境里，强调“空气交换量过大”。"]}
{"word":"overventilating","summary":{"en":"“Overventilating” means breathing too fast or too deeply, often from anxiety or stress.","zh":"“Overventilating”指呼吸过快或过深，常由焦虑或压力引起的呼吸过度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"breathing too fast or too deeply, often because of anxiety, stress, pain, or excitement (similar to hyperventilating).","zh":"呼吸过快或过深，常因焦虑、压力、疼痛或激动引起（类似“过度换气/呼吸过度”）。"},"examples":[{"en":"She started overventilating during the flight when the turbulence got worse.","zh":"飞机颠簸加重时，她在机上开始呼吸过度。"},{"en":"If you feel dizzy and your hands tingle, you may be overventilating.","zh":"如果你感到头晕、手发麻刺痛，你可能正在呼吸过度。"},{"en":"Try to slow your breathing—you’re overventilating a little.","zh":"试着把呼吸放慢一点——你有点呼吸过度了。"}]},{"partOfSpeech":"vi.","definition":{"en":"the action of breathing too fast or too deeply (present participle of “overventilate”).","zh":"呼吸过快或过深的动作（“overventilate”的现在分词）。"},"examples":[{"en":"He sat down because he was overventilating after the sprint.","zh":"他坐下来，因为短跑后他呼吸过度。"},{"en":"Overventilating can make you feel lightheaded even if you’re getting enough oxygen.","zh":"呼吸过度会让你觉得头昏，即使你并不缺氧。"}]}],"synonyms":["hyperventilating","breathing too fast","breathing heavily"],"phonetic":"/ˌoʊvərˈvɛntəˌleɪtɪŋ/","extraExplanation":["“Overventilating”在日常英文里常用来描述因紧张/恐慌导致的“呼吸过度”，医学上更常见的词是“hyperventilating”。两者意思非常接近。","呼吸过度时，身体可能把二氧化碳呼出太多，从而出现头晕、手脚发麻、胸闷等感觉；这也是为什么安抚时常说“slow down your breathing / breathe slowly”。","在口语中也可带一点夸张意味，表示“反应太紧张”：如“Don’t overventilate—it’s not a big deal.”（别这么紧张，没那么严重。）"]}
{"word":"overventilation","summary":{"en":"Overventilation means breathing too fast or too deeply, often causing dizziness or tingling.","zh":"overventilation 指呼吸过快或过深的过度换气，常引起头晕或麻刺感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Breathing too fast or too deeply (more than the body needs), which can lower carbon dioxide in the blood and cause symptoms like dizziness or tingling.","zh":"过度换气（呼吸过快或过深，超过身体需要），会使血液中的二氧化碳下降，导致头晕、手脚麻刺等症状。"},"examples":[{"en":"During a panic attack, some people experience overventilation and feel lightheaded.","zh":"在恐慌发作时，有些人会过度换气，感到头晕。"},{"en":"Slow, steady breathing can help reduce overventilation.","zh":"缓慢、稳定的呼吸有助于减轻过度换气。"},{"en":"The doctor asked if chest pain came with overventilation or numb fingers.","zh":"医生询问胸痛是否伴随过度换气或手指发麻。"}]}],"synonyms":["hyperventilation","rapid breathing"],"phonetic":"/ˌoʊvɚˌvɛn.təˈleɪ.ʃən/","extraExplanation":["“overventilation”常见于医学与心理健康语境，尤其与焦虑、恐慌发作相关。由于呼出二氧化碳过多，可能出现头晕、胸闷、口周或四肢麻刺等感觉。日常表达中也常用“hyperventilation（过度呼吸）”，更为常见。"]}
{"word":"overventuresome","summary":{"en":"Overventuresome means too risky or excessively adventurous.","zh":"overventuresome 指「過於冒險、風險過高」的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing to take risks; excessively adventurous or bold in a way that may be unwise.","zh":"過於愛冒險的；太大膽而可能不明智的。"},"examples":[{"en":"The plan sounded exciting, but it was overventuresome for a first-time team.","zh":"這個計畫聽起來很刺激，但對第一次合作的團隊來說太冒險了。"},{"en":"He was overventuresome with money, investing in projects he barely understood.","zh":"他在金錢上太愛冒險，投資了自己幾乎不了解的專案。"}]}],"synonyms":["reckless","overbold","rash","foolhardy","too adventurous"],"phonetic":"ˌoʊvərˈvɛn.tʃər.səm","extraExplanation":["「overventuresome」由 over-（過度）+ venturesome（愛冒險的）組成，帶有「冒險到不太理智」的提醒或批評語氣。","常用於描述決策、計畫、投資、旅行安排等「風險超出承受範圍」的情況；比 adventurous 更偏向「過頭了」。"]}
{"word":"overventurous","summary":{"en":"Overventurous means excessively adventurous or risky, often suggesting poor judgment.","zh":"overventurous 指“过于冒险/过分大胆”，常暗示不够明智、令人担忧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too willing to take risks; excessively bold or daring, often in a way that may cause trouble or danger","zh":"过于冒险的；过分大胆的（常带有可能惹麻烦或带来危险的含义）"},"examples":[{"en":"His overventurous plan to hike alone in winter worried his family.","zh":"他打算冬天独自徒步的过分冒险的计划让家人很担心。"},{"en":"Don’t be overventurous with your savings—start with safer investments.","zh":"别拿你的存款太冒险——先从更稳妥的投资开始。"}]}],"synonyms":["reckless","rash","overly daring","foolhardy"],"phonetic":"/ˌoʊvɚˈvɛn.tʃɚ.əs/","extraExplanation":["这是一个比较少见、偏书面/文学风格的形容词，由 over-（“过度”）+ venturesome/venturous（“爱冒险的”）构成。日常更常用的表达是 “too adventurous,” “reckless,” 或 “overly daring”。","语气通常带一点批评或担忧：不是单纯称赞勇敢，而是强调“胆子大到不太明智”。"]}
{"word":"overventurously","summary":{"en":"“Overventurously” means doing something in an overly risky, too-daring way.","zh":"“overventurously”表示“过于冒险、过于大胆（以至于不稳妥）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly risky or daring way; in a way that takes more chances than is sensible.","zh":"以过于冒险或鲁莽的方式；以超过合理程度去冒险的方式。"},"examples":[{"en":"He overventurously invested all his savings in a single startup.","zh":"他过于冒险地把所有积蓄都投进了一家创业公司。"},{"en":"The team acted overventurously, rushing into the market without enough research.","zh":"团队行事过于冒进，在没有足够调研的情况下就匆忙进入市场。"},{"en":"She spoke overventurously, making promises she couldn’t guarantee.","zh":"她说话过于大胆，做出了无法保证兑现的承诺。"}]}],"synonyms":["recklessly","rashly","too boldly","imprudently","overboldly"],"phonetic":"/ˌoʊvərˈvɛntʃərəsli/","extraExplanation":["“overventurously”来自形容词“overventurous”（过于敢闯/过于冒险）+ 副词后缀“-ly”。其中“venture”有“冒险尝试”的意思；前缀“over-”表示“过度、超过适当程度”。因此它带有“太冒进、不够稳妥”的语气，常用于评价决策、投资、计划或言行。","这个词比较少见，日常写作里更常用的替代表达有：“too boldly / too rashly / recklessly / imprudently”。正式写作或文学语境中才更可能看到“overventurously”。"]}
{"word":"overventurousness","summary":{"en":"Overventurousness means excessive risk-taking or boldness, often seen as rash.","zh":"overventurousness 指“过度冒险、过分大胆”，常含“鲁莽、不谨慎”的负面意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too willing to take risks; excessive boldness that may become rash or imprudent.","zh":"过度冒险（的倾向）；过分大胆，以至于显得鲁莽或不谨慎。"},"examples":[{"en":"His overventurousness in business led him to invest all his savings in a risky startup.","zh":"他在生意上的过度冒险让他把所有积蓄都投进了一个高风险的创业公司。"},{"en":"The expedition failed not because of bad weather, but because of the leader’s overventurousness.","zh":"这次探险失败并不是因为天气不好，而是因为领队过度冒险。"}]}],"synonyms":["rashness","recklessness","overboldness","imprudence"],"phonetic":"/ˌoʊvərˈvɛn(t)ʃərəsnəs/","extraExplanation":["这是一个比较少见的名词，来自形容词 overventurous（“过于冒险的”）+ 名词后缀 -ness（表示“性质/状态”）。","venturous 和 adventurous 意思接近，都有“敢于冒险的”之意；但加上 over- 后通常带负面评价，强调“超过合理限度”。"]}
{"word":"overview","summary":{"en":"Overview most often means a general summary of the main points; less commonly it can mean to view something from above.","zh":"overview通常指对主要内容的概述/总览；较少情况下也可指从高处俯瞰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A general description or summary that gives the main idea without many details.","zh":"概述；总览：用较少细节说明主要内容的总体介绍。"},"examples":[{"en":"Can you give me an overview of the report?","zh":"你能给我这份报告的概述吗？"},{"en":"The lecture provided an overview of modern American history.","zh":"这场讲座对美国近现代史做了总览。"}]},{"partOfSpeech":"v.","definition":{"en":"To look over or examine something from above or from a higher place (less common).","zh":"俯瞰；从高处眺望（较不常用）。"},"examples":[{"en":"From the hill, we could overview the entire valley.","zh":"从山上我们可以俯瞰整个山谷。"}]}],"synonyms":["summary","outline","survey","general picture","big picture"],"phonetic":"/ˈoʊvərˌvjuː/","extraExplanation":["“overview”最常见是名词，写作/会议里很常用：overview = 大方向 + 主要点，不展开细节。常见搭配：an overview of…（……的概述）、provide/give an overview（提供概述）、brief/quick overview（简要概述）。","动词用法在现代英语中相对少见，很多时候人们会用“overlook”来表达“俯瞰/眺望”。注意：overlook 还可以表示“忽视”，而 overview 没有“忽视”的意思。"]}
{"word":"overviews","summary":{"en":"“Overviews” is the plural of “overview,” meaning general summaries that highlight the main points.","zh":"“overviews”是“overview”的复数，指突出要点的概述/总览。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A general description or summary that shows the main points without many details.","zh":"概述；总览（用较少细节呈现主要内容的总体介绍）。"},"examples":[{"en":"The report begins with an overview of the project.","zh":"这份报告以项目概述开头。"},{"en":"Can you give me a quick overview of what happened?","zh":"你能简单概述一下发生了什么吗？"},{"en":"This chapter provides an overview of basic grammar rules.","zh":"这一章对基础语法规则作了概述。"}]}],"synonyms":["summary","outline","general picture","survey","snapshot"],"phonetic":"/ˈoʊvərˌvjuː/","extraExplanation":["“overviews”是名词“overview”的复数形式，表示多个概述/总览：e.g., Several overviews are included at the end.（末尾包含了几个概述。）","常见搭配是“an overview of + 名词/动名词”：an overview of the market（市场总览）、an overview of how it works（工作原理概述）。","在学术与商业写作里，overview通常用于引出主题、交代结构或帮助读者先抓住全局；比“summary”更强调“整体框架/全景”，不一定是结尾的总结。"]}
{"word":"overvigorous","summary":{"en":"Overvigorous means excessively vigorous or forceful.","zh":"overvigorous 指“过于有力、过度用力或过于强烈”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too energetic, forceful, or intense; more vigorous than is appropriate in the situation","zh":"过于精力充沛或用力过猛的；（在某种情境下）过度强烈的"},"examples":[{"en":"The coach warned the team not to be overvigorous during warm-ups to avoid injury.","zh":"教练提醒队员热身时别太用力，以免受伤。"},{"en":"An overvigorous scrubbing can damage the fabric.","zh":"过度用力地刷洗会损坏布料。"},{"en":"Her overvigorous criticism shut down the conversation instead of improving it.","zh":"她过于强烈的批评反而让对话冷场，并没有带来改善。"}]}],"synonyms":["too vigorous","overly vigorous","excessive","overzealous","overly forceful","too intense"],"phonetic":"ˌoʊvɚˈvɪɡərəs","extraExplanation":["“over-”是常见前缀，表示“过度、超出适当程度”。所以 overvigorous 直译就是“过度有力/过度用劲”。日常写作中更常见的表达有 too vigorous、overly forceful、excessive 等；overvigorous 属于较正式或书面一点的用词。"]}
{"word":"overvigorously","summary":{"en":"“Overvigorously” means doing something with too much energy or force.","zh":"“overvigorously”表示做某事过于用力或过于激烈。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too energetic, forceful, or intense; with more vigor than is appropriate.","zh":"过于用力地；过于激烈地；精力过盛地（指用力或强度超过合适程度）。"},"examples":[{"en":"He shook the bottle overvigorously, and it sprayed everywhere when he opened it.","zh":"他把瓶子摇得太用力了，打开时喷得到处都是。"},{"en":"The editor said the article was argued overvigorously and needed a calmer tone.","zh":"编辑说这篇文章论证得过于咄咄逼人，需要更冷静的语气。"},{"en":"She apologized for responding overvigorously in the meeting.","zh":"她为自己在会议上反应过于激烈而道歉。"}]}],"synonyms":["too vigorously","overly vigorously","excessively","with excessive force","too forcefully"],"phonetic":"/ˌoʊvɚˈvɪɡɚəsli/","extraExplanation":["“overvigorously”由前缀 over-（“过度、超过”）+ vigorously（“有力地、精力充沛地”）构成，语气上常带轻微批评：不是“很努力”，而是“努力到不合时宜/适得其反”。","写作中更常见的替代表达有：too vigorously / overly vigorously / with excessive force。该词本身相对少见，但含义透明，读到时可以用构词法快速理解。"]}
{"word":"overvigorousness","summary":{"en":"Overvigorousness means being excessively vigorous or forceful.","zh":"overvigorousness 指“过度有力/精力过盛”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too vigorous; excessive energy or force, often in a way that causes problems or seems inappropriate.","zh":"过度有力（或精力过盛）的状态；力量或劲头太大，常带来不良后果或显得不合时宜。"},"examples":[{"en":"The overvigorousness of his grip made the handshake uncomfortable.","zh":"他握手太用力，让人觉得不舒服。"},{"en":"Her overvigorousness in training led to a minor injury.","zh":"她训练时过于拼命，导致了轻微受伤。"},{"en":"The coach warned that overvigorousness can cause burnout.","zh":"教练提醒说，过度用力可能会导致倦怠。"}]}],"synonyms":["excessive force","overexertion","overenthusiasm","excessive vigor","strain"],"phonetic":"/ˌoʊvɚˈvɪɡɚəsnəs/","extraExplanation":["这个词较少见，通常由 over-（过度）+ vigorous（有活力的、有力的）+ -ness（名词后缀，表示“……的状态/性质”）构成。日常表达中更常用 too much energy / excessive force / overexertion 等说法。"]}
{"word":"overviolent","summary":{"en":"“Overviolent” means excessively violent or too violent.","zh":"“overviolent”表示“过度暴力的、过于激烈的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively or too violent; showing more violence than is necessary, appropriate, or expected.","zh":"过度暴力的；过于激烈的；暴力程度超出必要或可接受范围的。"},"examples":[{"en":"The director cut several scenes because the film felt overviolent for a general audience.","zh":"导演删掉了几段镜头，因为这部电影对普通观众来说显得过于暴力。"},{"en":"Some people found the video game’s fights overviolent and stopped playing.","zh":"有些人觉得这款游戏的打斗过度暴力，就不再玩了。"},{"en":"The protest turned overviolent after a small group began throwing objects.","zh":"在一小群人开始投掷物品后，抗议活动变得过于激烈、带有过度暴力。"}]}],"synonyms":["overly violent","excessively violent","too violent","ultraviolent","brutal"],"phonetic":"/ˌoʊvɚˈvaɪələnt/","extraExplanation":["“overviolent”不是特别常见的标准词汇，更常见的表达是“too violent”“excessively violent”“ultraviolent（极端暴力的）”或“overly violent”。在正式写作里，用“overly/excessively violent”通常更自然。"]}
{"word":"overviolently","summary":{"en":"“Overviolently” means “too violently” or “with excessive force.”","zh":"overviolently 表示“过于暴力地/过分强硬地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively violent or forceful way; more violently than is appropriate or necessary.","zh":"以过度暴力、过分强硬的方式；比合适或必要的程度更暴力。"},"examples":[{"en":"The police responded overviolently, which escalated the situation instead of calming it down.","zh":"警方的反应过于暴力，反而让局势升级，而不是让它冷静下来。"},{"en":"He grabbed her arm overviolently, leaving bruises.","zh":"他过分用力地抓住她的手臂，留下了淤青。"},{"en":"The film was criticized for portraying conflict overviolently.","zh":"这部电影因把冲突表现得过度暴力而受到批评。"}]}],"synonyms":["too violently","excessively","with excessive force","brutally (context-dependent)"],"phonetic":"ˌoʊvɚˈvaɪələntli","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过正常范围”（如：overreact 反应过度，overcook 煮过头）。因此 overviolently 通常用于批评某种行为“用力过猛/手段过激”。","overviolently 这个词比较少见；在日常写作里更常用的表达有 “too violently”, “excessively violently”, “with excessive force”。"]}
{"word":"overviolentness","summary":{"en":"“Overviolentness” means excessive violence, but it’s rare and nonstandard; “excessive violence” is more common.","zh":"“overviolentness”指“过度暴力”，但很少见且不太规范；更常用的说法是“excessive violence”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The quality of being excessively violent; too much violence in behavior, language, or imagery.","zh":"（罕见、非标准用法）过度暴力；在行为、言语或画面中“太暴力”的特质或程度。"},"examples":[{"en":"Some viewers complained about the movie’s overviolentness, saying it relied too much on gore.","zh":"一些观众抱怨这部电影过于暴力，认为它太依赖血腥画面。"},{"en":"The editor asked the author to tone down the overviolentness of the fight scenes.","zh":"编辑要求作者把打斗场面的过度暴力程度降一降。"}]}],"synonyms":["excessive violence","extreme violence","gratuitous violence","brutality","savagery"],"phonetic":"/ˌoʊvɚˈvaɪələntnəs/","extraExplanation":["“overviolentness”不是常见词，多见于临时造词（nonce word）。结构是 over-（过度）+ violent（暴力的）+ -ness（名词后缀，表示“……的性质/状态”）。正式写作里更常用：excessive violence（过度暴力）、extreme violence（极端暴力）、gratuitous violence（为刺激而加入的无必要暴力）。"]}
{"word":"overvoltage","summary":{"en":"Overvoltage means voltage above the normal/rated level; it can also mean applying too much voltage to a device.","zh":"Overvoltage 指电压高于正常/额定水平（过电压）；也可指对设备施加过高电压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Voltage that is higher than the normal or rated (safe) level in an electrical system, which can damage equipment or cause failure.","zh":"过电压：电力系统中电压高于正常或额定（安全）水平的情况，可能导致设备损坏或故障。"},"examples":[{"en":"A sudden overvoltage can destroy sensitive chips in a computer.","zh":"突发过电压可能会烧毁电脑里敏感的芯片。"},{"en":"The engineer added a surge protector to prevent overvoltage damage.","zh":"工程师加装了浪涌保护器，以防过电压造成损坏。"}]},{"partOfSpeech":"vt.","definition":{"en":"To subject a device or circuit to a voltage that is too high.","zh":"使过电压：对设备或电路施加过高的电压。"},"examples":[{"en":"If you overvoltage the motor, it may overheat and fail.","zh":"如果你让电机过电压运行，它可能会过热并损坏。"},{"en":"They accidentally overvolted the sensor during testing.","zh":"他们在测试时不小心让传感器承受了过高电压。"}]}],"synonyms":["excess voltage","voltage surge","voltage spike"],"phonetic":"/ˌoʊvɚˈvoʊltɪdʒ/","extraExplanation":["“overvoltage”是工程领域常用词，日常口语里更常说“voltage spike（电压尖峰）”“power surge（电涌）”。但要注意：surge/spike多强调“瞬间升高”，而overvoltage可以指“持续或瞬时高于额定值”的更泛概念。","常见原因包括：雷击、开关操作（如大功率设备启停）、电网故障、静电放电等。对应的防护器件/措施常见有：保险丝、浪涌保护器（SPD）、压敏电阻（MOV）、TVS二极管、稳压电源等。"]}
{"word":"overvote","summary":{"en":"Overvote means to choose more options than allowed on a ballot, often making that contest not count; it can also refer to the invalid vote itself.","zh":"Overvote 指在选票某个项目中选择超过规定数量的选项，常导致该项目不计票；也可指这类无效投票本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mark or cast more votes on a ballot (or in a contest) than the rules allow, so the vote may not be counted","zh":"（选票上）投了超过规定数量的票；在同一项目中勾选/选择过多，导致该项可能作废"},"examples":[{"en":"In that race you can choose only one candidate; if you select two, you overvote and your ballot may not count for that race.","zh":"那场选举只能选一名候选人；如果你选了两名，就属于overvote，该项可能不会被计入。"},{"en":"Election workers check for overvotes when they review ballots.","zh":"选举工作人员在复核选票时会检查是否出现overvote（超额投票）。"}]},{"partOfSpeech":"n.","definition":{"en":"an instance of marking too many choices on a ballot, causing that contest to be invalid or not counted","zh":"（一次）超额投票；在同一项目中选择过多而造成该项无效/不计票的情况"},"examples":[{"en":"The scanner flagged an overvote in the mayoral contest.","zh":"扫描仪在市长选举项目中标记出一次overvote（超额投票）。"},{"en":"Clear instructions can reduce the number of overvotes.","zh":"清晰的说明可以减少overvote（超额投票）的数量。"}]}],"synonyms":["(n.) invalid vote (in that contest)","(related) overvoting","(contrast) undervote"],"phonetic":"/ˌoʊvərˈvoʊt/","extraExplanation":["在美国选务语境里，overvote 常见于“纸质选票/电子选票”统计与审计：例如某个项目规定“只能选 1 人”，但选民同时勾选了 2 人，该项目通常会被判定为无效（是否作废取决于当地规则与设备设置）。它与 undervote（少投/漏投，即该项目未作任何选择）常一起出现。","不要把 overvote 和 outvote（以票数战胜对方、比……票多）混淆：outvote 更常用，含义不同。"]}
{"word":"overvoted","summary":{"en":"“Overvoted” means a ballot (or a contest on a ballot) was marked for more choices than allowed, so it may not count.","zh":"“Overvoted”指选票（或其中某一项）多选了超过规定数量的候选人/选项，因此该项可能不计票。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In elections) marked a ballot for more candidates or choices than allowed, so that contest may not be counted.","zh":"（选举中）在同一项选举/题目上勾选了超过规定数量的候选人或选项，导致该项可能作废或不计入统计。"},"examples":[{"en":"Her ballot was flagged as overvoted because she selected two candidates for a one-seat race.","zh":"她的选票被标记为“overvoted”，因为在只选一人的选举中她选了两位候选人。"},{"en":"The machine rejected the overvoted contest and recorded no vote for that office.","zh":"机器拒绝了这项“overvoted”的选项，并在该职位上记为未投票。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overvote”: to vote for too many candidates/choices on one contest.","zh":"“overvote”的过去式/过去分词：在同一项中投了超过规定数量的票（多选导致该项无效）。"},"examples":[{"en":"He accidentally overvoted the mayoral race and had to request a new ballot.","zh":"他不小心在市长选举那一项多选了，只好申请换一张新选票。"},{"en":"If you overvoted, ask an election worker what your options are.","zh":"如果你发生了 overvote（多选），可以询问选务人员你有哪些处理方式。"}]}],"synonyms":["overvoted ballot","overvote","invalid (in that contest)","spoiled (in that contest)"],"phonetic":"/ˌoʊvərˈvoʊtɪd/","extraExplanation":["在美国选举语境里，overvote 常和 undervote（少选/漏选）一起出现：overvote 是“选太多”，undervote 是“没选满或没选”。两者都可能导致该“项”（contest）不计票，但具体规则因州/地区而异。","注意区分：overvote 通常不是“投票人数太多”，而是“同一项里选了超过允许数量的候选人/选项”。","在选举结果报告或审计（audit）中，你可能会看到 “overvoted ballots/contests” 这类表述，意思是被系统识别为多选的选票/项目。"]}
{"word":"overvotes","summary":{"en":"An overvote is when a voter selects more options than allowed on a ballot, often making that contest invalid.","zh":"overvote 指选举中在某一项里勾选超过规定数量的选项，常导致该项投票无效。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mark a ballot for more choices than the rules allow (for example, selecting two candidates in a “choose one” race), usually making that contest invalid","zh":"（选举中）在同一选项/职位上勾选超过规定数量的候选人（如“只能选1人”却选了2人），通常会导致该项投票无效"},"examples":[{"en":"If you overvote in a “vote for one” race, your vote in that race may not be counted.","zh":"如果你在“只能选1人”的项目中多选（overvote），该项目的票可能不会被计入。"},{"en":"Some voting machines warn you when you overvote.","zh":"一些投票机会在你多选（overvote）时发出提示。"}]},{"partOfSpeech":"n.","definition":{"en":"an instance of voting for too many choices on a ballot; a ballot (or contest) that contains too many selections","zh":"（选举中）多选的情况；（某一项）因多选而产生的无效投票/无效选项"},"examples":[{"en":"The audit found a small number of overvotes in the mayoral contest.","zh":"审计发现市长选举项目中有少量多选（overvotes）。"},{"en":"Election officials separate overvotes from valid ballots for review.","zh":"选举工作人员会把多选的票与有效选票分开以便复核。"}]}],"synonyms":["cast too many votes (in a contest)","mark too many choices","invalid vote (context-dependent)"],"phonetic":"/ˌoʊvɚˈvoʊt/","extraExplanation":["“overvote”是美国选举语境里很常见的术语，通常与“undervote（少选/漏选）”成对出现：undervote指本可选但没有做出选择（如空着不选）。","在很多地区，多选往往只会让“该项比赛/该职位”无效，而不是整张选票都作废；具体规则因州或地区而异。"]}
{"word":"overvoting","summary":{"en":"Overvoting means casting more votes than allowed, either illegally (voting more than once) or on a ballot by selecting too many options.","zh":"Overvoting 指超出规定投票：可能是违规重复投票，也可能是选票上勾选超过允许数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of casting more votes than allowed (for example, voting multiple times or voting illegally) in order to influence an election result.","zh":"（选举中）超额投票；违规多投票（例如重复投票或非法投票），以影响选举结果。"},"examples":[{"en":"The investigation focused on allegations of overvoting in several precincts.","zh":"调查重点是关于几个选区存在超额投票的指控。"},{"en":"Election officials introduced stricter ID checks to prevent overvoting.","zh":"选举官员引入更严格的身份证明检查以防止超额投票。"}]},{"partOfSpeech":"n.","definition":{"en":"In some election systems, the situation where a ballot contains more selections than permitted (for example, marking two candidates when only one is allowed), which may cause that contest to be rejected or counted in a limited way depending on the rules.","zh":"（某些选举制度中）选票上勾选的人数超过规定（例如只能选1人却选了2人），可能导致该项目作废或按规则部分计票。"},"examples":[{"en":"If you select more than one candidate, your ballot may be recorded as an overvote.","zh":"如果你选择了不止一名候选人，你的选票可能会被记录为“超选/超额选择”。"},{"en":"The voting machine warned the user about overvoting before final submission.","zh":"投票机在最终提交前提醒用户出现超额选择。"}]}],"synonyms":["illegal multiple voting","overvote","ballot overvote","voting more than once"],"phonetic":"/ˌoʊvɚˈvoʊtɪŋ/","extraExplanation":["在美国选举语境里，overvoting 常与选举诚信讨论相关，但它不一定意味着“舞弊”：第二条释义所说的“超选”（overvote）有时只是选民误操作（多选了候选人），系统会提示或让该项目不计入。","相关词对比：overvote（名词/动词）强调“超出允许的选择”；undervote 指“少选/漏选”（该选项留空或未按最大数选择）。不同州/不同投票方式对 overvote 的处理规则可能不同。"]}

