{"word":"oveta","summary":{"en":"Oveta is mainly used as a feminine personal name; it is best known from the American figure Oveta Culp Hobby.","zh":"Oveta 主要作为女性人名使用；最广为人知的是美国人物 Oveta Culp Hobby。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A feminine given name (a personal name).","zh":"女性名字（人名）。"},"examples":[{"en":"Oveta is an uncommon first name in English-speaking countries.","zh":"Oveta 在英语国家是不太常见的名字。"},{"en":"Her name is Oveta, but friends call her Ovie.","zh":"她叫 Oveta，但朋友叫她 Ovie。"}]},{"partOfSpeech":"other","definition":{"en":"Most famously, the first name of Oveta Culp Hobby (1905–1995), an American public official and publisher.","zh":"最著名的是 Oveta Culp Hobby（1905–1995）的名字：美国公共官员与出版人。"},"examples":[{"en":"Oveta Culp Hobby helped lead the Women’s Army Corps during World War II.","zh":"Oveta Culp Hobby 在二战期间协助领导美国陆军妇女军团（WAC）。"},{"en":"Some U.S. history books mention Oveta Culp Hobby as the first U.S. Secretary of Health, Education, and Welfare.","zh":"一些美国历史书会提到 Oveta Culp Hobby：她是首任美国卫生、教育与福利部部长。"}]}],"synonyms":["(no direct synonyms; it is a name)"],"phonetic":"/oʊˈviːtə/","extraExplanation":["“Oveta”通常被当作专有名词（人名）来用，而不是常见英语词汇。","如果你本来想查的是形容词 **ovate**（“卵形的/蛋形的”），那是另一个单词，拼写不同、意思也不同。你可以告诉我你想要哪一个，我可以给出对应释义与例句。"]}
{"word":"ovett","summary":{"en":"Ovett is mainly a surname, most famously associated with British runner Steve Ovett.","zh":"Ovett主要是一个姓氏，最著名的关联是英国跑步运动员Steve Ovett（史蒂夫·奥维特）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname, best known from Steve Ovett, a famous British middle-distance runner (especially in the 1970s–1980s).","zh":"一个姓氏；最知名的用法来自英国著名中距离跑步运动员史蒂夫·奥维特（Steve Ovett，尤以20世纪70–80年代闻名）。"},"examples":[{"en":"Steve Ovett was one of the great rivals of Sebastian Coe in middle-distance running.","zh":"史蒂夫·奥维特是中距离跑项目中塞巴斯蒂安·科的主要劲敌之一。"},{"en":"The article compared Ovett’s racing style with Coe’s.","zh":"那篇文章比较了奥维特和科的比赛风格。"}]}],"phonetic":"/ˈoʊvət/","extraExplanation":["“Ovett”通常作为专有名词（姓氏）出现，不是常见英语词汇，所以在词典里多以人物姓名或姓氏条目被提及。","如果你是在某段文本里看到“ovett”而不确定含义，可能是指某个人名、作者署名、品牌/用户名等；也可能是拼写错误。你可以把原句发来，我可以帮你判断语境。"]}
