{"word":"ovo","summary":{"en":"“ovo” is most commonly seen as the prefix “ovo-” meaning ‘egg-’; it can also refer to the brand/label name OVO (October’s Very Own).","zh":"“ovo”最常见的是作前缀“ovo-”，表示“蛋/卵的”；也可指品牌/厂牌名 OVO（October’s Very Own）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in compounds) relating to eggs; egg-","zh":"（用于合成词）与“蛋/卵”有关的；蛋的"},"examples":[{"en":"An ovo-lacto vegetarian eats eggs and dairy but not meat.","zh":"蛋奶素者会吃鸡蛋和乳制品，但不吃肉。"},{"en":"The label says the product is ovo-vegetarian friendly.","zh":"标签上写着该产品适合蛋素者。"}]},{"partOfSpeech":"other","definition":{"en":"A name/abbreviation used as a brand or label, especially “October’s Very Own” (often connected with the artist Drake).","zh":"用作品牌或标识的名称/缩写，尤其指“October’s Very Own”（常与艺人 Drake 相关）。"},"examples":[{"en":"He’s wearing an OVO hoodie.","zh":"他穿着一件 OVO 连帽衫。"},{"en":"OVO is also used as a label name in music and fashion.","zh":"OVO 也常被用作音乐与潮流领域的厂牌名称。"}]}],"synonyms":["egg-","OVO (October’s Very Own)"],"phonetic":"ˈoʊvoʊ","extraExplanation":["“ovo-”来自拉丁语 *ovum*（蛋、卵），常见于饮食与生物学相关词汇：*ovo-lacto vegetarian*（蛋奶素）、*oviparous*（卵生的）等。","写作时注意区分：表示前缀时通常写作 “ovo-”；而表示品牌/厂牌时多写作大写 “OVO”。"]}
{"word":"ovocyte","summary":{"en":"An ovocyte is an immature egg cell (oocyte) in the ovary.","zh":"ovocyte 指卵巢中的未成熟卵细胞（常写作 oocyte）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female germ cell (an immature egg cell) in the ovary that can develop into an ovum (egg) after maturation.","zh":"卵母细胞（卵巢中的未成熟卵细胞），成熟后可发育为卵子。"},"examples":[{"en":"During ovulation, an ovocyte is released from the ovary.","zh":"在排卵过程中，卵母细胞会从卵巢释放出来。"},{"en":"Scientists can study ovocytes to understand fertility and early development.","zh":"科学家可以研究卵母细胞，以了解生育力与早期发育。"}]}],"synonyms":["oocyte","egg cell"],"phonetic":"/ˈoʊ.və.saɪt/","extraExplanation":["“ovocyte”在英语里相对少见，更常用的词是“oocyte”（卵母细胞）。在一些医学/生物学语境或受法语影响的写作中，可能会看到“ovocyte”作为变体拼写。","词源上，“ovo-/oo-”与“egg（卵）”有关，“-cyte”来自希腊语，表示“cell（细胞）”。"]}
{"word":"ovoelliptic","summary":{"en":"Ovoelliptic describes a shape that blends egg-like (ovoid) and elliptical features.","zh":"ovoelliptic 指介于蛋形与椭圆形之间的“卵椭圆形”轮廓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shape that is between an egg-shape (ovoid) and an ellipse; egg-like but smoothly elliptical.","zh":"形状介于“卵形（蛋形）”与“椭圆形”之间；像鸡蛋一样但轮廓更接近平滑的椭圆。"},"examples":[{"en":"The designer chose an ovoelliptic window to soften the building’s sharp lines.","zh":"设计师选用了卵椭圆形的窗户，让建筑的硬朗线条更柔和。"},{"en":"In the diagram, the cross-section is roughly ovoelliptic rather than perfectly circular.","zh":"图中这个横截面大致呈卵椭圆形，而不是完美的圆形。"}]}],"synonyms":["oval","ovoid","egg-shaped","elliptical"],"phonetic":"/ˌoʊvoʊɪˈlɪptɪk/","extraExplanation":["这个词比较少见，常见于建筑、工程制图、工业设计或生物形态描述中，用来强调“蛋形的微微偏置感”与“椭圆的平滑对称感”结合在一起。","构词上可理解为 ovo-（egg，蛋/卵）+ elliptic（椭圆的）。日常英语里更常用 oval / ovoid / egg-shaped 来表达类似意思。"]}
{"word":"ovoflavin","summary":{"en":"Ovoflavin is an older term for riboflavin (vitamin B2), a yellow compound found especially in egg white.","zh":"Ovoflavin 是核黄素（维生素B2）的旧称，指一种黄色化合物，尤见于蛋清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow, vitamin-like compound found especially in egg white; an older name for riboflavin (vitamin B2).","zh":"一种黄色的维生素样化合物，尤其存在于蛋清中；是核黄素（维生素B2）的旧称。"},"examples":[{"en":"Egg white contains ovoflavin, which is another name for riboflavin (vitamin B2).","zh":"蛋清中含有 ovaflavin（卵黄素/卵核黄素），这是核黄素（维生素B2）的另一种叫法。"},{"en":"In older nutrition texts, ovoflavin is listed as a growth factor later identified as vitamin B2.","zh":"在较早的营养学资料中，ovoflavin 被列为一种“促生长因子”，后来被确认就是维生素B2。"}]}],"synonyms":["riboflavin","vitamin B2"],"phonetic":"/ˌoʊvoʊˈfleɪvɪn/","extraExplanation":["词源上可拆为 ovo-（与“蛋/卵”有关）+ flavin（来自拉丁语 flavus“黄色”），指这种物质呈黄色、且与鸡蛋相关。","在现代医学与营养学写作中更常用 riboflavin 或 vitamin B2；ovoflavin 多见于较早的文献或化学/生物学历史语境。"]}
{"word":"ovogenesis","summary":{"en":"Ovogenesis is the biological process of forming and maturing egg cells in the ovaries.","zh":"Ovogenesis 指在卵巢中形成并成熟卵子的生物学过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process by which egg cells (ova) are formed and mature in the ovaries","zh":"卵发生（卵子生成与成熟的过程）：在卵巢中形成并成熟为卵子的生物学过程"},"examples":[{"en":"In humans, ovogenesis begins before birth and continues in stages until ovulation.","zh":"在人类中，卵发生在出生前就开始，并分阶段持续到排卵。"},{"en":"The textbook compared spermatogenesis and ovogenesis to show key differences in timing and number of cells produced.","zh":"教材比较了精子发生与卵发生，以展示在时间安排和产生细胞数量上的关键差异。"}]}],"synonyms":["oogenesis","egg formation","egg development"],"phonetic":"/ˌoʊvoʊˈdʒɛnəsɪs/","extraExplanation":["“ovogenesis”常见于生物学与医学语境；更常见的近义术语是“oogenesis（卵子发生）”。在一些教材或写作中两者可互换，但“oogenesis”更标准、更常用。","词源上，ovo- 来自拉丁语 ovum（卵），-genesis 表示“产生/形成”。"]}
{"word":"ovogenetic","summary":{"en":"Ovogenetic means “related to the formation or production of egg cells (ova).”","zh":"ovogenetic 指“与卵子（卵细胞）的形成/产生有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the formation or development of egg cells (ova); producing eggs.","zh":"与卵细胞（卵子）的形成或发育有关的；产生卵子的。"},"examples":[{"en":"In many animals, ovogenetic processes begin long before adulthood.","zh":"在许多动物中，卵子发生相关的过程在成年之前很久就开始了。"},{"en":"The researchers examined ovogenetic tissues to understand egg development.","zh":"研究人员检查了与卵子形成相关的组织，以了解卵子发育。"}]}],"synonyms":["oogenetic","oogenic","ovogenic"],"phonetic":"/ˌoʊvoʊdʒəˈnɛtɪk/","extraExplanation":["“ovogenetic”是生物学/胚胎学里的较少见词，常见的表达更偏向“oogenesis（卵子发生）”及其形容词“oogenetic / oogenic（卵子发生的）”。","构词上可拆为 ovo-（卵、卵子）+ genetic（生成的/起源的），表示“与卵子生成有关”。写作中更常用于学术语境而非日常英语。"]}
{"word":"ovogenous","summary":{"en":"Ovogenous means “egg-producing” or “related to the formation of eggs.”","zh":"ovogenous 指“产卵的/产生卵的”，或“与卵生成有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"producing or giving rise to eggs (ova); egg-forming.","zh":"产卵的；产生卵（卵细胞）的；与卵生成有关的。"},"examples":[{"en":"In some species, females have ovogenous tissue that produces mature eggs.","zh":"在一些物种中，雌性具有产卵组织，用来产生成熟的卵。"},{"en":"The researchers compared ovogenous cells with non-reproductive cells.","zh":"研究人员将产卵细胞与非生殖细胞进行了比较。"}]}],"synonyms":["egg-producing","ovigenic","oogenic","ovary-related"],"phonetic":"/oʊˈvɑːdʒənəs/","extraExplanation":["“ovogenous”多见于生物学/解剖学语境，构词为 ovo-（卵）+ -genous（产生……的）。在现代学术写作中，更常见的近义表达有“ovigenic / oogenic（卵生成的）”或“egg-producing（产卵的）”。"]}
{"word":"ovoglobulin","summary":{"en":"Ovoglobulin is a globulin protein found in egg white.","zh":"Ovoglobulin 指蛋清中的一种球蛋白（卵球蛋白）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of protein (globulin) found in egg white (albumen), important in the structure and functional properties of eggs in cooking and food science.","zh":"卵球蛋白：存在于蛋清（卵白）中的一种球蛋白，属于蛋清蛋白质的一部分，在烹饪与食品科学中影响蛋的结构与功能特性。"},"examples":[{"en":"Egg white contains several proteins, including ovoglobulin.","zh":"蛋清含有多种蛋白质，包括卵球蛋白。"},{"en":"Heating can change how ovoglobulin behaves, which affects the texture of cooked egg whites.","zh":"加热会改变卵球蛋白的性质，从而影响熟蛋清的口感与质地。"}]}],"synonyms":["egg-white globulin","egg white protein"],"phonetic":"/ˌoʊvoʊˈɡlɑːbjəlɪn/","extraExplanation":["词源提示：ovo- 来自拉丁语 ovum（“蛋”），globulin 指“球蛋白”（一类蛋白质）。因此 ovoglobulin 字面意思就是“蛋中的球蛋白”。","使用场景：这个词多见于生物化学、营养学与食品科学文章，日常英语里更常用的说法是 “egg-white proteins（蛋清蛋白）”。"]}
{"word":"ovogonium","summary":{"en":"An early female germ cell in the ovary that develops into an oocyte (egg precursor).","zh":"卵巢中的早期雌性生殖细胞，可发育为卵母细胞（卵细胞前体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female germ cell in an ovary that can develop into an oocyte (egg cell); an oogonium.","zh":"卵原细胞；位于卵巢中的雌性生殖细胞，可发育成卵母细胞（卵细胞的前体）；亦作 oogonium。"},"examples":[{"en":"In fetal development, an ovogonium divides many times before becoming an oocyte.","zh":"在胎儿发育过程中，卵原细胞会多次分裂，然后才发育成卵母细胞。"},{"en":"Researchers stained the ovary tissue to identify ovogonia under the microscope.","zh":"研究人员对卵巢组织进行染色，以便在显微镜下识别卵原细胞。"}]}],"synonyms":["oogonium","female germ cell"],"phonetic":"/ˌoʊvəˈɡoʊniəm/","extraExplanation":["词源：来自拉丁语 ovum（卵）+ -gonium（与“生殖细胞/生殖腺”相关的词根）。","用法提示：在现代生物学与医学写作中，oogonium 更常见；ovogonium 属于较少见的同义形式。","概念区分：ovogonium（卵原细胞）通常指更早期、可分裂增殖的阶段；之后发育为 oocyte（卵母细胞），再进一步成熟为 ovum/egg（卵/卵细胞）。"]}
{"word":"ovoid","summary":{"en":"Ovoid means egg-shaped; it can describe something (adj.) or name an egg-shaped object (n.).","zh":"Ovoid 指“卵形的”，既可作形容词，也可作名词表示“卵形物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an egg: an oval form that is a bit longer on one end.","zh":"卵形的；像鸡蛋一样的形状（通常一端更长或更尖）。"},"examples":[{"en":"The artist drew an ovoid face with a narrow chin.","zh":"画家画了一张卵形脸，下巴较尖。"},{"en":"The building has an ovoid dome that looks smooth from every angle.","zh":"这座建筑有一个卵形圆顶，从各个角度看都很圆润。"}]},{"partOfSpeech":"n.","definition":{"en":"An egg-shaped object or figure.","zh":"卵形物；卵形的物体或图形。"},"examples":[{"en":"The logo is a simple blue ovoid.","zh":"这个标志是一个简单的蓝色卵形图案。"},{"en":"In the diagram, label the ovoid near the center.","zh":"在图中把中心附近的卵形标出来。"}]}],"synonyms":["egg-shaped","oval","elliptical"],"phonetic":"/ˈoʊ.vɔɪd/","extraExplanation":["“ovoid”常见于科学与艺术语境（如生物学、医学、几何、设计），比日常的“oval”更正式、更精确。通常暗示“一端略大或略尖”的蛋形，而“oval”更偏一般的椭圆/椭圆形。","词源来自拉丁语 *ovum*（蛋）+ *-oid*（……形状的），类似的词还有 “spheroid”（球状体）、“asteroid”（小行星，原意“星状的”）。"]}
{"word":"ovoidal","summary":{"en":"Ovoidal describes something egg-shaped—an oval form that is typically wider at one end.","zh":"ovoidal 指“卵形的、蛋形的”，通常一端更宽，常用于科学或医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an egg; oval but slightly uneven, often wider at one end.","zh":"卵形的；类似鸡蛋的形状（通常一端更宽），比一般的椭圆更“蛋形”。"},"examples":[{"en":"Many bird eggs are ovoidal rather than perfectly round.","zh":"许多鸟蛋是卵形的，而不是完全的圆形。"},{"en":"The doctor noted an ovoidal lump on the scan.","zh":"医生在扫描中注意到一个卵形的肿块。"}]}],"synonyms":["ovoid","egg-shaped","oval"],"phonetic":"/oʊˈvɔɪdəl/","extraExplanation":["“ovoidal”来自拉丁语词根 ov-（意为“蛋”，同源词如 ovum=卵、ovary=卵巢）。在科学写作里更常见的是 ovoid（卵形的/卵形物），而 ovoidal 听起来更偏正式、技术性。"]}
{"word":"ovoids","summary":{"en":"“Ovoids” is the plural of “ovoid,” meaning egg-shaped forms; it can be a noun (egg-shaped objects) or an adjective (egg-shaped).","zh":"“ovoids”是“ovoid”的复数，表示卵形/蛋形；既可作名词（卵形物），也可作形容词（呈卵形的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ovoid: egg-shaped objects or forms (shapes that are like an egg).","zh":"ovoid 的复数：卵形物；蛋形的形状（像鸡蛋一样的形态）。"},"examples":[{"en":"Under the microscope, the pollen grains looked like tiny ovoids.","zh":"在显微镜下，花粉颗粒看起来像微小的卵形体。"},{"en":"The artist filled the background with pale, floating ovoids.","zh":"艺术家在背景里填满了浅色、漂浮的卵形图形。"}]},{"partOfSpeech":"adj.","definition":{"en":"Plural of ovoid (adjective use): having an egg-like shape.","zh":"ovoid 的复数（形容词用法）：呈卵形的；蛋形的。"},"examples":[{"en":"Some seeds are ovoids rather than perfectly round.","zh":"有些种子是卵形的，而不是完全圆的。"}]}],"synonyms":["egg-shaped","oval (approx.)","elliptical (approx.)"],"phonetic":"/ˈoʊ.vɔɪd/","extraExplanation":["“ovoid”常见于生物学、医学、解剖学和几何/设计语境，用来描述“蛋形/卵形”。复数既可以指“卵形的东西”（名词），也可以用于描述多个事物“呈卵形”（形容词）。","学习提示：日常英语里更常说“egg-shaped”。“ovoid(s)”更偏学术或说明性写作。"]}
{"word":"ovolemma","summary":{"en":"A rare botanical term for the protective covering around a plant ovule.","zh":"一个较少见的植物学术语，指植物胚珠周围的保护性外被。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The protective covering or envelope around an ovule (the structure in plants that develops into a seed).","zh":"（植物学）胚珠的外被/包膜；包围胚珠、起保护作用的结构（胚珠后来可发育成种子）。"},"examples":[{"en":"In some plants, the ovolemma helps protect the ovule as it develops.","zh":"在一些植物中，ovolemma 会在胚珠发育过程中起到保护作用。"},{"en":"The researcher examined the ovolemma under a microscope to compare species.","zh":"研究人员在显微镜下观察胚珠外被（ovolemma），以比较不同物种。"}]}],"synonyms":["ovule covering","ovule envelope"],"phonetic":"/ˌoʊvoʊˈlɛmə/","extraExplanation":["这个词非常少见，多见于专门的植物学语境。词形上可拆为 ovo-（与“卵/胚珠”相关）+ -lemma（“外皮/壳/包被”之意，常见于学术构词）。在一般英语学习或日常阅读中几乎不会遇到。"]}
{"word":"ovoli","summary":{"en":"“ovoli” usually means Caesar’s mushrooms (plural of Italian ovolo), and sometimes refers to egg-shaped young amanitas.","zh":"“ovoli”通常指凯撒蘑菇（意大利语 ovolo 的复数），有时也指“蛋状期”的幼年鹅膏菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) Caesar’s mushrooms; the plural of Italian ovolo, referring especially to Amanita caesarea, a prized edible wild mushroom.","zh":"（意大利语外来词）凯撒蘑菇；意大利语 ovolo 的复数，尤指凯撒鹅膏（Amanita caesarea），一种很受推崇的可食用野生蘑菇。"},"examples":[{"en":"In some Italian regions, ovoli are considered a delicacy and cooked simply with olive oil and garlic.","zh":"在意大利一些地区，ovoli 被视为珍馐，常用橄榄油和大蒜简单烹调。"},{"en":"The menu listed tagliatelle with ovoli and porcini.","zh":"菜单上写着“配 ovoli 和牛肝菌的宽面”。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly in mushroom talk, “ovoli” can refer to egg-shaped young amanitas still enclosed in their veil (the ‘egg’ stage).","zh":"在更广义的蘑菇语境中，“ovoli”也可指仍包在菌幕里的、呈“蛋状”的幼年鹅膏菌（“蛋状期”）。"},"examples":[{"en":"Collectors warn that identifying ovoli at the egg stage can be risky.","zh":"采集者提醒：在“蛋状期”辨认 ovoli 可能有风险。"}]}],"synonyms":["Caesar’s mushrooms","Amanita caesarea"],"phonetic":"/oʊˈvoʊli/","extraExplanation":["“Ovolo/ovoli”源自意大利语，和 uovo（鸡蛋）同源，因这种蘑菇幼年时像白色“蛋”一样被菌幕包裹而得名。","重要提醒：鹅膏属（Amanita）里既有名贵可食的种（如凯撒鹅膏），也有剧毒种（如致命鹅膏）。仅凭外观或“蛋状期”很容易混淆；不建议自行野采食用，应由专业人士鉴定。"]}
{"word":"ovolo","summary":{"en":"“Ovolo” is most commonly a proper name, especially the Ovolo boutique hotel brand; it can also carry an Italian-linked sense of “oval/egg-shaped.”","zh":"“Ovolo”最常见是专有名词，尤其指 Ovolo 精品酒店品牌；它也带有源自意大利语的“椭圆/蛋形”联想。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for a chain of boutique hotels (e.g., in Hong Kong, Australia).","zh":"（专有名词）“Ovolo”是一家精品酒店连锁品牌（例如在香港、澳大利亚等地）。"},"examples":[{"en":"We stayed at Ovolo in Hong Kong for two nights.","zh":"我们在香港的 Ovolo 住了两晚。"},{"en":"Ovolo Hotels often focuses on modern design and a playful style.","zh":"Ovolo 酒店通常主打现代设计和有趣活泼的风格。"}]},{"partOfSpeech":"other","definition":{"en":"(rare in English) an Italian word used as a name, linked to the idea of something “egg-shaped/oval.”","zh":"（英语中较少见）一个源自意大利语的词，常被用作名称，含有“蛋形/椭圆形”的联想。"},"examples":[{"en":"The name “Ovolo” suggests an oval, egg-like shape.","zh":"“Ovolo”这个名字让人联想到椭圆、像蛋一样的形状。"}]}],"synonyms":["(proper name) Ovolo Hotels"],"phonetic":"oʊˈvoʊloʊ","extraExplanation":["在英语语境里，“Ovolo”最常见的是作为品牌/专名出现（尤其是酒店）。它本身不是常用英语词汇，所以通常不需要翻译，直接当作名称使用即可。","从词源联想看，它与意大利语中表示“蛋形/椭圆”的词根有关，因此一些品牌会用它来传达“圆润、柔和、设计感”的形象。"]}
{"word":"ovological","summary":{"en":"Ovological means “connected with the study of eggs (especially bird eggs) or relating to eggs/ova.”","zh":"ovological 指“与卵/蛋（尤指鸟卵）的研究有关”或“与卵/卵子相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the study of eggs (especially birds’ eggs) or to eggs/ova in general.","zh":"（尤指鸟类）与“卵/蛋”的研究有关；或泛指与卵/蛋（卵子、卵）相关的。"},"examples":[{"en":"The museum has a small ovological collection of bird eggs and nests.","zh":"这家博物馆有一小部分与鸟卵和鸟巢相关的卵学（蛋类研究）收藏。"},{"en":"Her ovological notes focused on how shell color varies by habitat.","zh":"她的卵学笔记重点研究了蛋壳颜色如何随栖息地变化。"}]}],"synonyms":["oological","ovular","egg-related"],"phonetic":"/ˌoʊvəˈlɑːdʒɪkəl/","extraExplanation":["“ovological”较少见，更常见的词是“oological”（卵学的）和“oology”（卵学，研究鸟卵的学科）。在一些文本里，“ovological”可能是为了强调“ovum/ova（卵、卵子）”而形成的变体，也可能是对“oological”的误写。","词根提示：ov- 来自拉丁语 ovum（卵/蛋），-logy 表示“学科/研究”，-ical 表示“……的”。"]}
{"word":"ovologist","summary":{"en":"Ovologist is a rare word meaning someone who studies eggs or egg cells (ova).","zh":"ovologist 是个较少见的词，指研究蛋或卵细胞（卵）的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies ova (egg cells) or eggs, especially in a scientific context (a rare term).","zh":"研究卵（卵细胞）或蛋的学者（较少见的用法）。"},"examples":[{"en":"The museum invited an ovologist to explain how bird eggs develop.","zh":"博物馆邀请了一位研究鸟蛋的学者来讲解鸟蛋如何发育。"},{"en":"In the lab, the ovologist examined the ova under a microscope.","zh":"在实验室里，这位研究卵细胞的学者在显微镜下观察卵细胞。"}]}],"synonyms":["oologist","reproductive biologist","embryologist"],"phonetic":"/oʊˈvɑːlədʒɪst/","extraExplanation":["这个词在现代英语里非常少见；更常见的说法是 oologist（研究鸟蛋，尤其是鸟类学/自然史语境）或 reproductive biologist / embryologist（生殖生物学家/胚胎学家，更多用于医学与生物学研究）。","构词上由 ov-（与 ova/ovum“卵”有关）+ -logist（“……学者/研究者”）组成。写作时若想更自然地表达，通常改用更常见的术语会更清晰。"]}
{"word":"ovology","summary":{"en":"Ovology means the study of eggs (especially bird eggs), but it’s a rare word; oology is much more common.","zh":"Ovology 指研究蛋（尤其鸟蛋）的“卵学”，但很少用；更常见的是 oology。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of eggs, especially bird eggs; a less common term for oology.","zh":"卵学；研究蛋（尤其是鸟蛋）的学问；是更少见的说法，常用词是 oology。"},"examples":[{"en":"In older books, you may see ovology used for the study of bird eggs.","zh":"在一些较旧的书里，你可能会看到用 ovology 来表示研究鸟蛋的学问。"},{"en":"Her interest in ovology began when she started observing nests in the spring.","zh":"她对卵学的兴趣始于春天开始观察鸟巢的时候。"}]}],"synonyms":["oology"],"phonetic":"/oʊˈvɑːlədʒi/","extraExplanation":["ovology 在现代英语中非常少见；更常见、更标准的词是 oology（卵学、鸟蛋研究）。","词源上，ovo- 来自拉丁语 ovum（卵、蛋），-logy 表示“学科/研究”。因此字面意思就是“研究卵的学科”。","在实际使用中，如果写学术或科普文章，建议优先用 oology；ovology 可能会让读者觉得生僻或像拼写错误。"]}
{"word":"ovolos","summary":{"en":"Ovolos is a rare spelling/transliteration meaning an ancient Greek small coin (obol/obolus).","zh":"Ovolos 是较少见的拼写/转写，指古希腊的小面额硬币（obol/obolus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant transliteration of Greek obolos/obolus: a very small ancient Greek coin (and, by extension, a small amount of money).","zh":"（较少见的拼写/转写）源自希腊语 obolos/obolus：古希腊的一种小面额硬币；引申为“一点点钱”。"},"examples":[{"en":"The museum display mentions an ovolos (obol), a small coin used in ancient Greece.","zh":"博物馆的展柜提到 ovolos（即 obol），一种古希腊使用的小硬币。"},{"en":"In some retellings of Greek myth, an ovolos was placed with the dead as a token for the journey.","zh":"在一些希腊神话的复述里，人们会给死者放一枚 ovolos，作为旅途的象征性“路费”。"}]}],"synonyms":["obol","obolus","coin","small sum"],"phonetic":"/ˈɑːbələs/","extraExplanation":["“ovolos”在英语里非常少见，更常见的写法是 obol（也写作 obolus），来自古希腊语 ὀβολός（obolós）。","它在文化语境中常与“卡戎的渡河钱”（Charon’s obol）相关：传说死者口中或手中放一枚硬币，用来付费给冥河摆渡人卡戎。文学与神话改写中常借此象征“死亡的通行费/最后的费用”。","如果你是在特定文本（例如历史、考古、希腊语转写）里看到“ovolos”，通常可以把它理解为 obol/obolus 的另一种拼写。"]}
{"word":"ovolytic","summary":{"en":"Ovolytic means “able to destroy or dissolve eggs,” mainly used in scientific contexts.","zh":"Ovolytic 指“能破坏/溶解卵的”，主要用于科研或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) able to break down or destroy eggs (especially the eggs of parasites or microbes).","zh":"（生物/医学）能分解或破坏卵（尤其指寄生虫或微生物的卵）的。"},"examples":[{"en":"Researchers tested an ovolytic compound to reduce parasite eggs in water.","zh":"研究人员测试了一种溶卵化合物，以减少水中的寄生虫卵。"},{"en":"The disinfectant showed ovolytic activity against the worm’s eggs.","zh":"这种消毒剂对该蠕虫的卵表现出溶卵活性。"}]}],"synonyms":["ovicidal","egg-destroying","lytic"],"phonetic":"ˌoʊvəˈlɪtɪk","extraExplanation":["词源上可拆为 ovo-（卵）+ -lytic（溶解/裂解的）。因此它的核心含义是“把卵破坏掉”。","它是较少见的专业词，学术写作中更常见的相关词还有 ovicidal（杀卵的，强调“杀死”）与 ovicidal activity（杀卵活性）。","在论文或报告里，ovolytic 常与 activity、effect、agent、compound 等搭配，如 ovolytic activity（溶卵活性）。"]}
{"word":"ovomucoid","summary":{"en":"Ovomucoid is a heat-stable egg-white protein and a major egg allergen.","zh":"卵黏蛋白是蛋清中的一种相对耐热的蛋白质，也是主要的鸡蛋过敏原之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein found in egg white that can trigger allergic reactions; it is one of the main egg allergens and is relatively heat-stable.","zh":"卵黏蛋白（存在于蛋清中的一种蛋白质），可能引发过敏反应；是主要的鸡蛋过敏原之一，并且相对耐热。"},"examples":[{"en":"Some people with egg allergy react strongly to ovomucoid in egg whites.","zh":"有些鸡蛋过敏的人会对蛋清中的卵黏蛋白反应很强烈。"},{"en":"Because ovomucoid is fairly heat-stable, baking eggs does not always prevent symptoms.","zh":"由于卵黏蛋白相对耐热，烘烤鸡蛋并不一定能防止过敏症状。"},{"en":"The doctor ordered a test for IgE antibodies to ovomucoid.","zh":"医生安排了针对卵黏蛋白的 IgE 抗体检测。"}]}],"synonyms":["egg-white allergen","Gal d 1"],"phonetic":"/ˌoʊvoʊˈmjuːkɔɪd/","extraExplanation":["“Ovomucoid”常见于过敏科与食品标签/检验语境。它是鸡蛋蛋清中的一种糖蛋白，常被认为是“更难因加热而失活”的过敏原之一，所以有些对鸡蛋过敏的人即使吃到烘焙食品（含蛋）也可能仍会反应。","词源拆分有助记忆：ovo- 表示“蛋”，mucoid 表示“黏液样的/黏蛋白样的”（与其化学性质相关）。"]}
{"word":"ovonic","summary":{"en":"Ovonic usually means “related to Ovshinsky’s energy/materials technologies,” and it is also used as a battery brand name.","zh":"Ovonic 通常指“与奥夫辛斯基的能源/材料技术相关”，同时也常作为电池品牌名称使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to technologies invented or developed by Stanford R. Ovshinsky, especially certain battery and amorphous-semiconductor technologies (often seen in product names like “Ovonic battery”).","zh":"与斯坦福·R·奥夫辛斯基（Stanford R. Ovshinsky）发明或推动发展的技术有关，尤指某些电池技术与非晶半导体技术（常见于产品名，如“Ovonic 电池”）。"},"examples":[{"en":"This device uses an Ovonic battery designed for high cycle life.","zh":"这款设备使用了主打高循环寿命的 Ovonic 电池。"},{"en":"The article discusses Ovonic thin-film materials for energy storage.","zh":"这篇文章讨论了用于储能的 Ovonic 薄膜材料。"}]},{"partOfSpeech":"n.","definition":{"en":"(Trademark/brand use) A name used by some companies for rechargeable batteries or battery-related products, especially in hobby electronics.","zh":"（商标/品牌用法）一些公司用于可充电电池或电池相关产品的名称，尤其常见于电子爱好者圈。"},"examples":[{"en":"I bought an Ovonic 3S LiPo pack for my RC car.","zh":"我买了一块 Ovonic 的 3S 锂电（LiPo）电池给我的遥控车用。"},{"en":"Check whether the Ovonic charger supports your battery’s connector type.","zh":"检查一下这款 Ovonic 充电器是否支持你电池的接口类型。"}]}],"synonyms":["Ovshinsky-related (descriptive)","(brand-specific; no true general synonym)"],"phonetic":"/oʊˈvɑːnɪk/","extraExplanation":["“Ovonic”源自发明家 Stanford R. Ovshinsky 的姓氏（Ovshinsky → Ovonic，意为“与奥夫辛斯基相关的”）。在材料与能源领域，常与“非晶/薄膜材料”“储能”“镍氢电池（NiMH）”“金属氢化物（metal hydride）”等话题一起出现。","在消费市场里，“Ovonic”也常被当作品牌名使用（尤其是航模/无人机常用的 LiPo 电池）。因此它既可能是技术系词汇（学术/工程语境），也可能只是商品牌子（购物/评测语境）。"]}
{"word":"ovonics","summary":{"en":"Ovonics is a proper name linked to a company/brand known for battery and energy‑storage technology.","zh":"Ovonics 是一个专有名词，指与电池与储能技术相关的公司/品牌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name and company name (founded by inventor Stanford R. Ovshinsky) associated especially with battery and energy‑storage technologies, such as nickel‑metal hydride (NiMH) batteries.","zh":"“Ovonics”是一个品牌名/公司名（由发明家斯坦福·R·奥夫辛斯基创立），主要与电池与储能技术相关，尤其与镍氢（NiMH）电池等技术有关。"},"examples":[{"en":"The old hybrid used an Ovonics NiMH battery pack.","zh":"那辆旧款混动车使用的是Ovonics的镍氢电池组。"},{"en":"Researchers cited Ovonics patents in early discussions of large‑scale battery systems.","zh":"研究人员在早期讨论大规模电池系统时引用了Ovonics的专利。"}]}],"synonyms":["a proper noun (company/brand name)"],"phonetic":"/oʊˈvɑnɪks/","extraExplanation":["“Ovonics”来自创办人姓氏 Ovshinsky 的缩写/衍生称呼，常见于产业语境（电动车、电池、储能材料等）。因此它更像专有名词，而不是普通英文单词。","在新闻或技术文章里，你可能会看到与它相关的词组：Ovonics battery（Ovonics电池）、Ovonics NiMH（Ovonics镍氢）、Ovonics patents（Ovonics专利）等。","大小写通常为首字母大写（Ovonics）。在句中它常作定语使用（如 Ovonics battery），也可直接作名词指“该公司/该品牌”。"]}
{"word":"ovoplasm","summary":{"en":"Ovoplasm is the cytoplasm of an egg cell (ovum).","zh":"Ovoplasm 指卵细胞（卵子）的细胞质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The cytoplasm (cell substance) inside an egg cell (ovum), surrounding the nucleus; also called ooplasm.","zh":"卵细胞（卵子）内部的细胞质（细胞内容物），围绕细胞核的部分；也称为“卵质”（ooplasm）。"},"examples":[{"en":"Early embryonic development depends on nutrients stored in the ovoplasm.","zh":"胚胎早期发育依赖储存在卵质（ovoplasm）中的营养物质。"},{"en":"Researchers observed how organelles move within the ovoplasm after fertilization.","zh":"研究人员观察了受精后细胞器在卵质（ovoplasm）中的移动。"}]}],"synonyms":["ooplasm","egg cytoplasm"],"phonetic":"/ˈoʊvəˌplæzəm/","extraExplanation":["“Ovoplasm”是较偏专业、较少见的用词；在生物学与胚胎学教材和论文中更常见的是“ooplasm”。两者通常指同一概念（卵细胞的细胞质）。","词根提示：ovo- / ova- 与“egg（卵）”有关（如 ovary 卵巢）；-plasm 与“形成的物质/细胞质”相关（如 cytoplasm 细胞质）。理解词根有助于记忆生物学词汇。"]}
{"word":"ovoplasmic","summary":{"en":"“Ovoplasmic” means “related to the cytoplasm of an egg cell.”","zh":"“ovoplasmic”表示“与卵细胞（卵子）的细胞质/卵浆有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cytoplasm of an egg cell (ovum), called ovoplasm.","zh":"与卵细胞（卵子）的细胞质有关的；卵浆的。"},"examples":[{"en":"Researchers compared ovoplasmic factors that influence early embryo development.","zh":"研究人员比较了影响早期胚胎发育的卵浆（卵细胞质）因素。"},{"en":"Some ovoplasmic components help control the first cell divisions after fertilization.","zh":"某些卵浆成分有助于控制受精后的最初细胞分裂。"}]}],"synonyms":["ooplasmic","ovum-cytoplasmic","ooplasm-related"],"phonetic":"ˌoʊvəˈplæzmɪk","extraExplanation":["“ovoplasmic”是生物学/胚胎学中的专业词：ovo- 表示“卵、卵子”，-plasmic 与“plasm（浆、细胞质）”相关。它通常用于描述卵细胞内部细胞质环境中的物质与作用（例如影响受精与早期发育的母源因子）。"]}
{"word":"ovopyriform","summary":{"en":"Ovopyriform means egg/pear-shaped, especially in scientific descriptions.","zh":"Ovopyriform 指“卵梨形（蛋形/梨形）”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shape between egg-shaped and pear-shaped; broadly, egg/pear-shaped (often used in biology and botany to describe a body, organ, or fruit).","zh":"卵梨形的；介于卵形与梨形之间的形状（常用于生物学、植物学描述器官或果实的外形）。"},"examples":[{"en":"The fruit is described as ovopyriform, wider at one end and slightly narrowed at the other.","zh":"这种果实被描述为卵梨形，一端较宽，另一端略收窄。"},{"en":"Under the microscope, the egg case appears ovopyriform rather than perfectly oval.","zh":"在显微镜下，这个卵囊看起来是卵梨形，而不是完全的椭圆形。"}]}],"synonyms":["egg-shaped","pear-shaped","ovoid","pyriform","ovate"],"phonetic":"/ˌoʊvoʊˈpɪrɪfɔrm/","extraExplanation":["这是一个比较少见的形态学术语，常见于植物学/动物学的“形状描述词”。词根来自拉丁语：ovo-（卵、蛋）+ pyriform（梨形的）。通常表示“整体像蛋/梨”，或更具体地指“上部较圆宽、下部稍收窄”的轮廓。写作时多用于正式的科学描述，而日常英语更常说 egg-shaped / pear-shaped。"]}
{"word":"ovorhomboid","summary":{"en":"A rare adjective meaning ‘ovoid-and-rhomboid in shape,’ used in technical descriptions.","zh":"一个罕见形容词，表示“形状介于卵形与菱形之间”，多见于技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Having a shape that is partly ovoid (egg-like) and partly rhomboid (diamond-like), often used to describe leaves, crystals, or other forms.","zh":"（罕见/技术用语）指形状介于卵形（像鸡蛋）与菱形（像钻石/斜方形）之间，常用于描述叶片、晶体或其他物体的外形。"},"examples":[{"en":"The botanist described the leaf as ovorhomboid, broader near the middle and slightly diamond-shaped in outline.","zh":"植物学家把这片叶子描述为“ovorhomboid”，中部较宽，外轮廓略呈菱形。"},{"en":"Under the microscope, the particles appear ovorhomboid rather than perfectly oval.","zh":"在显微镜下，这些颗粒看起来是卵—菱形，而不是完全的椭圆形。"}]}],"synonyms":["ovoid","rhomboid","oval","diamond-shaped","ovate-rhomboid"],"phonetic":"ˌoʊvoʊˈrɑmˌbɔɪd","extraExplanation":["这个词在现代英语里非常少见，很多读者会把它当作拼写变体或临时造词。你更可能想找的是更常用的形状词：ovoid（卵形/椭圆偏卵形）、rhomboid（菱形/斜方形）、oval（椭圆形）、diamond-shaped（菱形的）。","构词上可以理解为 ovo-（卵/卵形）+ rhomboid（菱形的），含义直观，但并非日常写作常用词；学术写作更常直接写 “ovoid to rhomboid” 或 “ovate-rhomboid”。"]}
{"word":"ovorhomboidal","summary":{"en":"An adjective used in scientific description meaning “between oval and diamond-shaped.”","zh":"多用于科学描述的形容词，表示“介于卵形与菱形之间的形状”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shape that is between oval (egg-shaped) and rhomboid (diamond-shaped); an egg-like form with somewhat angled sides.","zh":"形状介于卵形（椭圆/蛋形）与菱形（钻石形）之间；整体像蛋但边缘带有些许棱角的形态。"},"examples":[{"en":"Under the microscope, the pollen grains looked ovorhomboidal rather than perfectly oval.","zh":"在显微镜下，这些花粉颗粒看起来是卵菱形的，而不是完全的椭圆形。"},{"en":"The description notes an ovorhomboidal outline with slightly pointed corners.","zh":"描述中提到其轮廓为卵菱形，角部略微尖。"}]}],"synonyms":["ovoid-rhomboid","subovate-rhomboid (context-dependent)"],"phonetic":"/ˌoʊvoʊˌrɑmˈbɔɪdəl/","extraExplanation":["“ovorhomboidal”多见于生物学（如植物学、昆虫学、显微形态学）或描述物体外形的技术性写作中，日常英语里几乎不用。","构词可以拆开理解：ovo- 表示“卵、蛋形”（如 ovary 卵巢；oval 椭圆相关），rhomboid 表示“菱形/斜方形”，-al 表示“……的”。","有时也会见到拼写变体（如 ovorrhomboidal / ovorhomboid）。如果你是在论文或标本描述里看到的，建议对照原文或图示确认作者想表达的是“偏卵形但带角”的那种外轮廓。"]}
{"word":"ovotesticular","summary":{"en":"A medical word meaning “having both ovarian and testicular tissue,” or referring to a gonad that contains both (ovotestis).","zh":"医学词，指“同时具有卵巢组织和睾丸组织”，也可指含两者的性腺（卵睾/ovotestis）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having both ovarian tissue and testicular tissue in the same individual (in one gonad or in separate gonads). Often used when talking about certain differences/disorders of sex development (DSD).","zh":"（医学）指同一个体同时具有卵巢组织和睾丸组织（可能在同一个性腺内，也可能分别存在于不同性腺）。常用于描述某些性发育差异/性发育障碍（DSD）。"},"examples":[{"en":"The report described ovotesticular tissue found during surgery.","zh":"报告描述了在手术中发现的卵睾组织。"},{"en":"Ovotesticular DSD is one possible diagnosis when both ovarian and testicular tissue are present.","zh":"当同时存在卵巢和睾丸组织时，“卵睾型性发育差异/障碍（ovotesticular DSD）”可能是其中一种诊断。"}]},{"partOfSpeech":"n.","definition":{"en":"An ovotesticular gonad (a gonad that contains both ovarian and testicular tissue); also called an ovotestis.","zh":"卵睾（含有卵巢组织与睾丸组织的性腺）；也称 ovotestis。"},"examples":[{"en":"Pathology confirmed an ovotesticular gonad (ovotestis).","zh":"病理检查证实为卵睾（ovotestis）。"}]}],"synonyms":["ovotestis","ovotesticular DSD","true hermaphroditism (older term; often considered outdated/insensitive in many contexts)"],"phonetic":"/ˌoʊvoʊtɛˈstɪkjələr/","extraExplanation":["“ovotesticular”由 ovo-（与卵/卵巢有关）+ testicular（与睾丸有关）组成，是非常专业的医学词汇，日常英语里很少用。","在临床语境中更常见的搭配是“ovotesticular DSD（卵睾型性发育差异/障碍）”。DSD 是一个医学术语，用于描述先天性性发育的多样性；讨论时通常强调尊重个体与以患者为中心的沟通。"]}
{"word":"ovotestis","summary":{"en":"Ovotestis is rare gonadal tissue containing both ovarian and testicular tissue.","zh":"Ovotestis 指同时含有卵巢组织与睾丸组织的罕见性腺组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare type of gonadal tissue that contains both ovarian tissue and testicular tissue (either in the same gonad or in different gonads).","zh":"一种罕见的性腺组织，同时含有卵巢组织和睾丸组织（可能在同一个性腺内，也可能分别位于不同性腺）。"},"examples":[{"en":"In some intersex variations, an ovotestis may be present at birth.","zh":"在某些双性/间性个体的性别发育差异中，出生时可能存在卵睾组织（ovotestis）。"},{"en":"The diagnosis of ovotestis often requires imaging and microscopic (histologic) examination.","zh":"卵睾组织的诊断常需要影像检查以及显微镜下的组织学检查。"}]}],"synonyms":["ovotesticular tissue","ovotesticular gonad"],"phonetic":"/ˌoʊ.voʊˈtɛs.tɪs/","extraExplanation":["“ovotestis”是医学/生物学术语：ovo- 表示“卵巢/卵”，testis 表示“睾丸”。因此该词字面意思就是“卵巢+睾丸的组合组织”。","在临床语境中，这个词常与“intersex（间性）”或“differences of sex development / DSD（性别发育差异）”相关。讨论此类话题时，使用尊重性的措辞很重要：个体身份与身体特征并不等同，且具体医疗决策通常需要多学科团队与当事人/监护人充分沟通。","历史上曾使用过“true hermaphroditism（真两性畸形）”等旧称，但在很多现代医学与公共健康语境中更倾向使用更中性、减少污名的表述（如 DSD 或间性相关术语）。"]}
{"word":"ovovitellin","summary":{"en":"Ovovitellin is a yolk protein in eggs that helps nourish the developing embryo.","zh":"Ovovitellin 指蛋黄中的一种卵黄蛋白，用于为胚胎发育提供营养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yolk protein found in bird (and some other egg-laying animal) eggs, used as a nutrient source for the developing embryo; it is related to vitellin/egg-yolk proteins.","zh":"卵黄蛋白之一（常见于鸟类及部分卵生动物的蛋黄中），为胚胎发育提供营养；与“vitellin（卵黄蛋白）”等蛋黄蛋白相关。"},"examples":[{"en":"Scientists analyzed ovovitellin to understand the nutritional makeup of egg yolk.","zh":"科学家分析了 ovovitellin，以了解蛋黄的营养组成。"},{"en":"During embryo development, proteins such as ovovitellin serve as stored food.","zh":"在胚胎发育过程中，像 ovovitellin 这样的蛋白质充当储存的“食物”。"}]}],"synonyms":["vitellin","egg-yolk protein"],"phonetic":"/ˌoʊvoʊvaɪˈtɛlɪn/","extraExplanation":["这是一个生物化学/胚胎学术语，日常英语中几乎不使用，更多见于科研论文、实验报告或教材。","词形可拆解理解：ovo- 表示“卵/蛋”，vitell- 来自拉丁语 vitellus（“蛋黄”），-in 常用于表示“蛋白质/物质名”（如 insulin）。"]}
{"word":"ovovivipara","summary":{"en":"Ovovivipara are animals whose eggs develop and hatch inside the mother, resulting in live birth.","zh":"ovovivipara 指卵在母体内发育并孵化、最终以活体方式产出的卵胎生动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animals that develop eggs inside the mother’s body and give birth to live young (the eggs hatch inside the parent, so there is no external egg laying)","zh":"卵胎生动物；卵在母体内发育并在体内孵化，随后以“活体出生”的方式产仔（不在体外产卵）"},"examples":[{"en":"Some sharks and many snakes are ovovivipara, giving birth to live young instead of laying eggs.","zh":"一些鲨鱼和许多蛇属于卵胎生动物，它们会产下活体幼崽而不是产卵。"},{"en":"In this species, the ovovivipara keep the eggs inside the body until the babies hatch.","zh":"在这种物种中，卵胎生动物会把卵留在体内，直到幼体孵化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to ovoviviparous animals or reproduction","zh":"（与）卵胎生（动物/繁殖方式）有关的；卵胎生的"},"examples":[{"en":"Researchers compared ovovivipara reproduction with true viviparity in reptiles.","zh":"研究人员比较了爬行动物的卵胎生繁殖与真正的胎生。"}]}],"synonyms":["ovoviviparous animals","ovoviviparous species","live-bearing (in some contexts)"],"phonetic":"/ˌoʊ.voʊ.vɪˈvɪp.ə.rə/","extraExplanation":["“ovovivipara”在生物学里常见作名词复数（相当于“ovoviviparous animals”）。单数有时写作“ovoviviparum/ovoviviparous animal”，但学习与写作中更常用、更自然的是“ovoviviparous”。","卵胎生与“胎生（viviparous）”的关键差别：卵胎生通常主要依靠卵黄供养胚胎；胎生则更多通过母体（如胎盘或类似结构）直接供养。两者都可能表现为“生下活体幼体”，但营养来源不同。"]}
{"word":"ovoviviparism","summary":{"en":"Ovoviviparism is reproduction in which eggs develop and hatch inside the parent, so the young are born live, usually nourished by yolk.","zh":"卵胎生指卵在亲体内发育并孵化，幼体活体出生，营养多来自卵黄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reproductive method where eggs develop and hatch inside the parent’s body, and the young are born live (the embryo is usually nourished by the egg’s yolk rather than a placenta).","zh":"卵胎生：一种繁殖方式，卵在亲体体内发育并在体内（或刚产出时）孵化，因此幼体以“活体”形式出生（胚胎通常主要靠卵黄供养，而不是胎盘）。"},"examples":[{"en":"Many sharks and some snakes show ovoviviparism.","zh":"许多鲨鱼和一些蛇类属于卵胎生。"},{"en":"In ovoviviparism, the eggs are retained inside the mother until they hatch.","zh":"在卵胎生中，卵会留在母体内直到孵化。"}]}],"synonyms":["ovoviviparity","ovoviviparous reproduction"],"phonetic":"ˌoʊvoʊˌvɪvəˈpɛrɪzəm","extraExplanation":["词源拆解：ovo-（卵）+ vivi-（活的）+ -parism（生育/产仔方式）。因此它强调“卵在体内发育、幼体以活体出生”。","学习对比：\n- oviparity（卵生）：在体外产卵并发育，如多数鸟类。\n- viviparity（胎生）：胚胎通常通过胎盘等结构从母体获得营养，如多数哺乳动物。\n- ovoviviparism（卵胎生）：胚胎主要靠卵黄营养，但卵留在体内直到孵化。","现代生物学写作中也常用 ovoviviparity（卵胎生）表示同一概念；具体分类在不同动物类群里可能有更细的讨论。"]}
{"word":"ovoviviparity","summary":{"en":"Ovoviviparity is reproduction where eggs hatch inside the parent, leading to live birth, with embryos fed mainly by yolk.","zh":"卵胎生指卵在亲体体内孵化，幼体活体出生，但主要由卵黄供养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reproductive method in which eggs develop and hatch inside the parent’s body, so the young are born live, but they are mainly nourished by the egg yolk (not by a placenta).","zh":"卵胎生：一种繁殖方式，卵在亲体体内发育并孵化，因此幼体以“活体出生”，但主要营养来自卵黄（而不是胎盘）。"},"examples":[{"en":"Some sharks show ovoviviparity, giving birth to live young that developed inside eggs.","zh":"一些鲨鱼属于卵胎生：幼体在卵中于母体内发育，最后以活体产出。"},{"en":"In ovoviviparity, the embryo usually depends on yolk rather than receiving nutrients through a placenta.","zh":"在卵胎生中，胚胎通常依赖卵黄供养，而不是通过胎盘获取营养。"}]}],"synonyms":["egg-retention (biological context)","ovoviviparous reproduction"],"phonetic":"/ˌoʊ.voʊ.vɪˈvɪp.ə.ri/","extraExplanation":["“卵胎生”常被拿来与两种方式对比：\n1) 卵生（oviparity）：把卵产到体外再孵化（如多数鸟类）。\n2) 胎生（viviparity）：胚胎在体内发育，并通过类似胎盘的结构从母体获得主要营养（如多数哺乳动物）。\n卵胎生介于两者之间：体内孵化 + 营养主要来自卵黄。","常见例子因物种而异，常在某些鲨鱼、鳐鱼、蛇、蜥蜴、部分鱼类中提到。日常科普中也可能看到相关形容词 ovoviviparous（卵胎生的）。"]}
{"word":"ovoviviparous","summary":{"en":"Ovoviviparous describes animals whose eggs hatch inside the parent, so the young are born alive, mainly nourished by yolk.","zh":"Ovoviviparous（卵胎生）指卵在母体内发育并孵化，幼体活体出生，主要依靠卵黄营养。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of some animals) producing young by eggs that develop and hatch inside the parent’s body, so the young are born alive (they are not fed by a placenta like in true live birth).","zh":"（指某些动物）卵在母体内发育并在体内孵化，幼体以“活体”方式出生；但不像真正的胎生那样通过胎盘获得营养。"},"examples":[{"en":"Some sharks and snakes are ovoviviparous, so their young hatch inside the mother and are born alive.","zh":"一些鲨鱼和蛇是卵胎生的，所以幼体在母体内孵化并以活体出生。"},{"en":"The textbook says this species is ovoviviparous rather than egg-laying.","zh":"教材说这种物种是卵胎生的，而不是卵生。"}]}],"synonyms":["egg-retaining (in biological context)","ovovivipary (related noun)","live-bearing (broader/less precise)"],"phonetic":"/ˌoʊvoʊvɪˈvɪpərəs/","extraExplanation":["“ovoviviparous”常见于生物学/动物学写作，用来区分三种繁殖方式：\n- oviparous 卵生：在体外产卵并孵化（如大多数鸟类）。\n- viviparous 胎生：胚胎在体内发育并由母体直接供养（如大多数哺乳动物）。\n- ovoviviparous 卵胎生：胚胎主要依靠卵黄营养，但卵留在体内直到孵化/出生（常见于部分鲨鱼、鳐鱼、蛇等）。\n不同学科对边界的划分有时不完全一致，所以在学术语境中也可能看到更细的分类。"]}
{"word":"ovoviviparously","summary":{"en":"ovoviviparously = in an ovoviviparous way (eggs hatch inside the parent; young are born live).","zh":"ovoviviparously＝以卵胎生的方式（卵在亲体内孵化，幼体活产）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves producing eggs that hatch inside the parent’s body, so the young are born live (with little or no placental nourishment).","zh":"以卵胎生的方式：卵在亲体内孵化，幼体以“活体”形式出生（通常几乎没有或没有胎盘供养）。"},"examples":[{"en":"Some sharks reproduce ovoviviparously, giving birth to live pups after the eggs hatch internally.","zh":"一些鲨鱼以卵胎生方式繁殖：卵在体内孵化后，直接产下活的幼鲨。"},{"en":"The researcher noted that the species develops ovoviviparously rather than laying eggs in the open.","zh":"研究者指出，这个物种是卵胎生发育，而不是把卵产在外界。"}]}],"synonyms":["in an ovoviviparous manner","internally hatching (in reproduction)"],"phonetic":"/ˌoʊvoʊvɪˈvɪpərəsli/","extraExplanation":["这个词来自三部分：ovo-（卵）+ vivi-（活）+ -parous（生产/生育）+ -ly（副词）。意思是“像卵胎生那样”。","常见对比：oviparous（卵生：产卵到体外发育，如多数鸟类）；viviparous（胎生：通过胎盘等获得营养并在体内发育，如人类）；ovoviviparous（卵胎生：胚胎主要靠卵黄营养，在体内孵化后出生）。","多用于生物学/动物学写作，日常英语中非常少见。"]}
{"word":"ovoviviparousness","summary":{"en":"Ovoviviparousness is the condition of reproducing by eggs that develop and hatch inside the parent, so the young are born live and usually fed by yolk.","zh":"Ovoviviparousness 指“卵胎生”的状态：卵在亲体内发育并孵化，幼体活产，营养多来自卵黄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reproductive mode in which eggs develop and hatch inside the parent’s body, so the young are born live, usually nourished mainly by the egg yolk (not by a placenta).","zh":"卵胎生：一种生殖方式，卵在亲体内发育并在体内孵化，因此幼体以“活体”出生，营养通常主要来自卵黄（而不是胎盘）。"},"examples":[{"en":"Some sharks show ovoviviparousness, giving birth to live pups after the eggs hatch inside the mother.","zh":"一些鲨鱼具有卵胎生，会在卵于母体内孵化后产下活的小鲨。"},{"en":"The researcher compared ovoviviparousness with egg-laying to understand how the species adapts to cold water.","zh":"研究人员将卵胎生与产卵进行比较，以理解该物种如何适应冷水环境。"}]}],"synonyms":["ovoviviparity","ovoviviparism","live-bearing (in an ovoviviparous sense)"],"phonetic":"ˌoʊvoʊˌvaɪˈvɪpərəsnəs","extraExplanation":["“卵胎生（ovoviviparousness）”常被用来对比三种常见繁殖方式：\n1）oviparous 卵生：把卵产到体外（如大多数鸟类）；\n2）viviparous 胎生：胚胎在体内发育，并从母体获得较多营养（如多数哺乳动物有胎盘）；\n3）ovoviviparous 卵胎生：卵留在体内发育，主要靠卵黄供给，孵化后再出生，因此看起来是“生小宝宝”，但本质仍是“卵在体内孵化”。\n\n这个词在日常英语很少见，更常见的写法是 ovoviviparity（卵胎生，名词）或 ovoviviparous（卵胎生的，形容词）。"]}
