{"word":"ovula","summary":{"en":"Ovula is the plural form of ovulum, meaning small eggs or (in botany) ovules.","zh":"Ovula 是 ovulum 的复数，指小卵；在植物学中常指胚珠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ovulum; small eggs or egg-like bodies. In biology and botany this often refers to ovules (the structures in plants that can develop into seeds after fertilization).","zh":"ovulum 的复数；小卵或卵状结构。在生物学/植物学中常指“胚珠”（受精后可发育成种子的结构）。"},"examples":[{"en":"Under the microscope, the researcher counted several ovula inside the ovary.","zh":"在显微镜下，研究人员数了数子房里有几个 ovula（小卵/胚珠）。"},{"en":"After pollination, some ovula develop into seeds.","zh":"授粉后，一些 ovula 会发育成种子。"}]}],"synonyms":["ovules","eggs (general)"],"phonetic":"/ˈɑːvjʊlə/","extraExplanation":["“ovula”在现代英语里多见于学术或较旧的生物学/植物学文献；日常或现代教材更常用“ovules”（胚珠的复数）或直接用“eggs”（卵）。","词源上与拉丁语 ovum（卵）有关；“-ula”带有“小”的含义，因此 ovulum/ovula 有“较小的卵/卵状体”的意味。"]}
{"word":"ovular","summary":{"en":"Ovular means egg-shaped (oval-like), used more in formal/scientific contexts than everyday speech.","zh":"ovular 指“卵形的/像鸡蛋一样的”，比日常更常见的 oval 更正式、更偏学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an egg; oval-like (often used in biology, medicine, and art/design descriptions).","zh":"卵形的；像鸡蛋一样的；近似椭圆形的（常用于生物学、医学、艺术/设计描述）。"},"examples":[{"en":"The technician noted an ovular mass on the scan.","zh":"技术员在影像检查中记录到一个卵形的肿块。"},{"en":"She chose an ovular frame because it softened the look of the portrait.","zh":"她选了一个卵形的画框，因为它能让肖像看起来更柔和。"},{"en":"Many bird eggs have an ovular shape that helps them roll in a circle instead of away from the nest.","zh":"许多鸟蛋呈卵形，这有助于它们滚动时更容易绕圈而不是滚离巢穴。"}]}],"synonyms":["oval","egg-shaped","ovoid"],"phonetic":"/ˈoʊ.vjə.lɚ/","extraExplanation":["“ovular”来自拉丁语词根 ov-（意为“卵/蛋”）。在日常英语中，人们更常用 “oval” 来表示“椭圆形的”；“ovular”更偏正式或更学术，常见于医学影像、解剖学或生物学描述中。","不要把 “ovular” 和 “ovulation”（排卵）混淆：两者都与“卵”有关，但 “ovular”主要说“形状像卵”，而 “ovulation”说的是“生理过程（排卵）”。"]}
{"word":"ovularian","summary":{"en":"Ovularian is a rare adjective meaning “related to an ovule,” especially in botany.","zh":"Ovularian 是一个较少见的形容词，意为“与胚珠有关的”，多用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an ovule (a plant egg cell/structure that becomes a seed after fertilization) or to the production of ovules; ovular.","zh":"与（植物的）胚珠有关的；与胚珠的形成或产生有关的；胚珠的。"},"examples":[{"en":"In some botany texts, the ovularian structures are described as developing inside the ovary of the flower.","zh":"在一些植物学教材中，会描述胚珠相关结构在花的子房内发育。"},{"en":"The researcher compared ovularian development across several species of flowering plants.","zh":"研究者比较了几种开花植物的胚珠相关发育过程。"}]}],"synonyms":["ovular","ovule-related","ovular (botany)"],"phonetic":"ˌɑv.jəˈlɛr.i.ən","extraExplanation":["“ovularian”在现代英语中非常少见，多见于较旧或非常专业的植物学语境；更常见的表达通常是“ovular”（与胚珠有关的）。","学习时要注意别和“ovarian”混淆：ovarian 指“卵巢的/子房的”（动物的卵巢或植物的子房），而 ovularian/ovular 更偏向“胚珠（ovule）的”。"]}
{"word":"ovulary","summary":{"en":"Ovulatory means “related to ovulation.”","zh":"Ovulatory 意为“与排卵有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to ovulation (the release of an egg from an ovary).","zh":"与排卵有关的；指卵巢释放卵子的过程。"},"examples":[{"en":"Ovulatory pain can happen around the middle of the menstrual cycle.","zh":"排卵期疼痛可能发生在月经周期的中间阶段。"},{"en":"The doctor asked about her ovulatory cycle to understand her fertility timing.","zh":"医生询问了她的排卵周期，以了解她的受孕时间。"}]}],"synonyms":["ovulation-related","reproductive"],"phonetic":"/ˈɑv.jə.ləˌtɔr.i/","extraExplanation":["“ovulary” 不是常见或标准的英语拼写。你可能想写的是 **ovulatory**（与排卵有关的）或 **ovary**（卵巢）。","词根提示：**ovul-** 来自拉丁语 *ovum*（“卵”），所以常出现在生物/医学相关词汇中（如 ovulation 排卵）。"]}
{"word":"ovulate","summary":{"en":"Ovulate means to release an egg from an ovary as part of the reproductive cycle.","zh":"Ovulate 指（卵巢）释放卵子，即排卵。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a person or animal) to release an egg (ovum) from an ovary; this is part of the menstrual/reproductive cycle.","zh":"（人或动物）排卵；卵巢释放卵子，这是月经/生殖周期的一部分。"},"examples":[{"en":"Many people ovulate about halfway through their menstrual cycle.","zh":"很多人会在月经周期的中间左右排卵。"},{"en":"A home test can help estimate when you ovulate.","zh":"家用测试可以帮助估算你何时排卵。"},{"en":"Some conditions can affect whether you ovulate regularly.","zh":"一些状况会影响你是否规律排卵。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause an ovary to release an egg (often used in medical contexts).","zh":"（多用于医学语境）促使卵巢排出卵子；诱导排卵。"},"examples":[{"en":"The medication may help patients ovulate by stimulating the ovaries.","zh":"这种药物可能通过刺激卵巢来帮助患者排卵。"},{"en":"Doctors sometimes use hormones to help the body ovulate.","zh":"医生有时会用激素来帮助身体排卵。"}]}],"synonyms":["release an egg","produce an egg"],"phonetic":"/ˈɑv.jəˌleɪt/","extraExplanation":["“ovulate”源自拉丁语 ovum（卵）。与它相关的常见词还有：ovary（卵巢）、ovulation（排卵，名词）、ovum（卵子，单数；复数 ova）。","在日常英语里，人们更常说“ovulate”而不是更专业的表达；但谈到受孕与生育时，也常见搭配如 “ovulation cycle / ovulation test / ovulation date”。在正式或医疗场景中表达时，注意使用尊重、非评判性的措辞。"]}
{"word":"ovulated","summary":{"en":"“Ovulated” is the past form of “ovulate,” meaning an egg was released from an ovary (or, in plants, ovules were formed).","zh":"“ovulated”是“ovulate”的过去式/过去分词，指（人或动物）已排卵；也可指（植物）形成胚珠。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a female human or animal) to release an egg (ovum) from an ovary as part of the menstrual or reproductive cycle.","zh":"（指女性或雌性动物）排卵；卵巢释放卵子，是月经或生殖周期的一部分。"},"examples":[{"en":"She ovulated around day 14 of her cycle.","zh":"她大约在周期的第14天排卵。"},{"en":"Some animals ovulate only once a year.","zh":"有些动物一年只排卵一次。"},{"en":"The doctor said she may have ovulated earlier than usual.","zh":"医生说她可能比平时更早排卵。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of a plant) to form or produce ovules (structures that can become seeds after fertilization).","zh":"（指植物）形成或产生胚珠（受精后可发育成种子）。"},"examples":[{"en":"In many flowering plants, the ovary contains ovules that later develop into seeds.","zh":"在许多开花植物中，子房里有胚珠，之后会发育成种子。"}]}],"synonyms":["released an egg","had ovulation","produced ovules"],"phonetic":"ˈɑv.jəˌleɪ.tɪd","extraExplanation":["“ovulated”是动词“ovulate”的过去式/过去分词，常用于描述“已经排卵”（过去发生）或与完成时搭配（如 has ovulated）。在日常健康语境中更常见的是名词“ovulation（排卵）”以及短语“ovulate on/around + 日期（在……左右排卵）”。","在医学与性健康话题中属于中性、正式用词；更口语的表达有“release an egg（释放卵子）”。"]}
{"word":"ovulates","summary":{"en":"“Ovulates” means “releases an egg from an ovary” (third-person singular of ovulate).","zh":"“ovulates”意为“排卵”，是动词“ovulate”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person or animal with ovaries) to release an egg from an ovary; this is a normal part of the menstrual/estrous cycle.","zh":"（指有人类或雌性动物的卵巢）从卵巢排出卵子；是月经周期/动情周期中的正常过程。"},"examples":[{"en":"She usually ovulates around the middle of her cycle.","zh":"她通常在月经周期的中期排卵。"},{"en":"Many mammals ovulate seasonally.","zh":"许多哺乳动物会在特定季节排卵。"},{"en":"A doctor can estimate when she ovulates based on symptoms and tests.","zh":"医生可以根据症状和检测来估计她何时排卵。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a plant) to form or produce ovules (structures that can develop into seeds).","zh":"（指植物）形成或产生胚珠（可发育成种子的结构）。"},"examples":[{"en":"In flowering plants, the ovary contains ovules, and the plant ovulates before fertilization.","zh":"在开花植物中，子房内含胚珠，植物会在受精前形成胚珠。"}]}],"synonyms":["releases an egg","has ovulation"],"phonetic":"/ˈɑv.jəˌleɪts/","extraExplanation":["“ovulates”是动词“ovulate”的第三人称单数现在时：he/she/it ovulates。常见于医学、科普与生育相关语境。","日常英语中更常说“release an egg（排出卵子）”或“be ovulating（正在排卵）”。在备孕语境里，也常见“ovulation（排卵）”“fertile window（易孕期）”。","如果你在写作或对话中使用该词，通常需要明确主语（谁在排卵）以及时间点（周期中期、某一天等），以避免表达含糊。"]}
{"word":"ovulating","summary":{"en":"“Ovulating” means releasing an egg from the ovary, or being in the ovulation stage of the menstrual cycle.","zh":"“ovulating”指正在排卵，或处于月经周期的排卵阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or animal with ovaries) releasing an egg (ovum) from an ovary; in the part of the menstrual cycle when an egg is released.","zh":"（指有卵巢的人或动物）正在排卵；处于月经周期中卵子从卵巢释放出来的阶段。"},"examples":[{"en":"She is ovulating this week, so she’s tracking her symptoms.","zh":"她这周在排卵，所以在记录自己的症状。"},{"en":"Some people notice mild pain when they’re ovulating.","zh":"有些人排卵时会感觉到轻微疼痛。"},{"en":"The app estimates that I’m ovulating tomorrow.","zh":"这个应用估计我明天会排卵。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “ovulate”: to release an egg from an ovary.","zh":"“ovulate”的现在分词：排卵；从卵巢释放卵子。"},"examples":[{"en":"Hormones control when the ovaries are ovulating.","zh":"激素控制卵巢何时排卵。"},{"en":"The doctor explained that she may not be ovulating regularly.","zh":"医生解释说她可能没有规律排卵。"}]}],"synonyms":["releasing an egg","in the fertile window"],"phonetic":"/ˈɑv.jəˌleɪ.tɪŋ/","extraExplanation":["“Ovulating”常用于健康、备孕与避孕语境，是较中性、医学感的词。日常更口语的说法有“in my fertile window（在易孕期）”。","常见相关词：ovulation（排卵，名词）、ovulate（排卵，动词）、fertile window（易孕期）、period（月经）、cycle（周期）。"]}
{"word":"ovulation","summary":{"en":"Ovulation is the monthly release of an egg from the ovary, a key part of the menstrual cycle and fertility.","zh":"Ovulation 指每月卵巢释放卵子的过程，是月经周期与受孕相关的重要环节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the release of an egg (ovum) from an ovary, usually occurring about once each menstrual cycle","zh":"排卵：卵巢释放卵子（卵细胞）的过程，通常在每个月经周期中发生一次"},"examples":[{"en":"Ovulation usually happens about halfway through the menstrual cycle.","zh":"排卵通常发生在月经周期的中间左右。"},{"en":"Some people track ovulation to understand their most fertile days.","zh":"有些人会追踪排卵，以了解自己最容易受孕的日子。"},{"en":"Stress and illness can sometimes delay ovulation.","zh":"压力和疾病有时会导致排卵延迟。"}]}],"synonyms":["egg release","ovum release"],"phonetic":"/ˌɑv.jəˈleɪ.ʃən/","extraExplanation":["词源提示：ovulation 来自拉丁语 ovum（“卵/蛋”）。因此你会在相关词里看到同一个词根，比如 ovary（卵巢）、ovum（卵子）。","语境用法：在日常英语里，人们常说 “I’m ovulating.”（我在排卵期）或 “I’m around ovulation.”（接近排卵期），在医疗/科普语境也会说 “predict/track ovulation”（预测/追踪排卵）。","文化与表达：谈论生育与月经相关话题在不同文化里敏感程度不同；英语中在医疗与健康语境直接使用 ovulation 很常见，也相对中性。"]}
{"word":"ovulations","summary":{"en":"“Ovulations” means the release of eggs from the ovaries, referring to multiple occurrences/cycles.","zh":"“Ovulations”意为“排卵（复数）”，指卵巢释放卵子的过程，强调多次发生或多个周期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the release of an egg (ovum) from an ovary; part of the menstrual cycle","zh":"（女性）排卵；卵巢释放卵子的过程，是月经周期的一部分"},"examples":[{"en":"Ovulation usually happens about two weeks before a period.","zh":"排卵通常发生在月经来潮前大约两周。"},{"en":"Some people track ovulations to better understand their fertility window.","zh":"有些人会追踪排卵来更好了解自己的易孕期。"},{"en":"Stress can sometimes affect ovulations and make cycles irregular.","zh":"压力有时会影响排卵，使月经周期变得不规律。"}]},{"partOfSpeech":"n.","definition":{"en":"multiple instances or cycles of ovulation (plural of “ovulation”)","zh":"多次排卵；（ovulation 的复数）指多个周期或多次发生的排卵"},"examples":[{"en":"The study compared hormone levels across several ovulations.","zh":"这项研究比较了多个排卵周期中的激素水平。"},{"en":"Irregular ovulations can make it harder to predict a fertile window.","zh":"不规律的多次排卵情况会让易孕期更难预测。"}]}],"synonyms":["egg release","ovarian egg release","fertile phase (context-dependent)"],"phonetic":"/ˌɑv.jəˈleɪ.ʃənz/","extraExplanation":["“Ovulations”是名词复数，日常英语里更常见单数“ovulation”，因为人们通常在谈“排卵”这一过程；当讨论“多个周期/多次发生”时才常用复数。","常见搭配：ovulation cycle（排卵周期）, ovulation test/kit（排卵试纸/测试）, ovulation pain（排卵痛，也叫 mittelschmerz）。这是健康相关话题，用语较为中性，但在不同文化语境中可能偏私密。"]}
{"word":"ovulatory","summary":{"en":"“Ovulatory” means “connected with ovulation (releasing an egg).”","zh":"“ovulatory”表示“与排卵有关的；排卵期的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ovulation (the release of an egg from an ovary).","zh":"与排卵有关的；排卵期的（排卵是卵巢释放卵子的过程）。"},"examples":[{"en":"Ovulatory pain can happen around the middle of the menstrual cycle.","zh":"排卵痛可能发生在月经周期的中期左右。"},{"en":"Some people track their ovulatory days to understand their fertility window.","zh":"有些人会记录排卵日，以了解自己的易孕期。"}]}],"synonyms":["related to ovulation","ovulation-related"],"phonetic":"/ˈɑv.jəˌleɪ.təɹ.i/","extraExplanation":["“Ovulatory”常用于医学或健康语境（如 ovulatory cycle 排卵周期、ovulatory phase 排卵期、ovulatory disorder 排卵障碍）。日常英语里更常说 “ovulation” 或 “ovulating”。","如果你看到 “ovulatory pain”，也常叫 “mittelschmerz”（德语借词，指排卵期一侧下腹的疼痛）。","与生育相关的表达：fertile window（易孕期）、ovulation predictor kit/OPK（排卵试纸）、basal body temperature/BBT（基础体温）。"]}
{"word":"ovule","summary":{"en":"An ovule is usually a plant structure in the ovary that becomes a seed after fertilization.","zh":"ovule 通常指植物的“胚珠”，位于子房内，受精后发育成种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small structure inside the ovary of a plant that, after being fertilized, develops into a seed.","zh":"（植物）胚珠：位于子房内的小结构，受精后会发育成种子。"},"examples":[{"en":"After fertilization, each ovule can develop into a seed.","zh":"受精后，每个胚珠都可能发育成一粒种子。"},{"en":"The pollen tube delivers sperm cells to the ovule.","zh":"花粉管把精子细胞输送到胚珠中。"}]},{"partOfSpeech":"n.","definition":{"en":"A structure in female animals (including humans) that can develop into an egg cell (oocyte).","zh":"（动物/人类）卵原细胞/卵泡前体：女性体内可发育成卵细胞（卵母细胞）的结构（较少用法）。"},"examples":[{"en":"In some older biology texts, “ovule” may refer to an early form of an egg cell.","zh":"在一些较早的生物学教材里，“ovule”有时指卵细胞的早期形态。"}]}],"synonyms":["(plant) seed bud (informal/rare)","(contextual) megasporangium (technical)"],"phonetic":"/ˈɑːvjuːl/","extraExplanation":["在现代英语里，ovule 最常见、最标准的用法是植物学：胚珠（在子房里）。受精后胚珠变成“seed（种子）”，而子房通常发育成“fruit（果实）”。","常见易混词：ovary（子房/卵巢）是“装着 ovules 的地方”；oocyte/egg cell（卵母细胞/卵细胞）是动物学更常用的说法。"]}
{"word":"ovules","summary":{"en":"Ovules are tiny structures in a plant’s ovary that can become seeds after fertilization.","zh":"ovules 指植物子房内的胚珠，受精后可发育成种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/Botany) The small structures inside a plant’s ovary that can develop into seeds after fertilization.","zh":"（生物/植物学）胚珠：位于植物子房内的小结构，受精后可发育成种子。"},"examples":[{"en":"After pollination, the ovules may be fertilized and grow into seeds.","zh":"授粉后，胚珠可能受精并发育成种子。"},{"en":"The ovary contains many ovules, which helps the plant produce multiple seeds.","zh":"子房内含有许多胚珠，这有助于植物产生多粒种子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology, less common) Small egg-like structures in some animals; related to female reproduction.","zh":"（动物学，较少用）某些动物体内的小型卵样结构，与雌性生殖有关。"},"examples":[{"en":"In some insects, ovules develop as part of the reproductive system.","zh":"在一些昆虫中，胚珠会作为生殖系统的一部分发育。"}]}],"synonyms":["seed (result, not the same thing)","ova (animal context)","egg (informal, animal context)"],"phonetic":"ˈoʊv.juːlz","extraExplanation":["“ovules”是“ovule”的复数形式。植物学里最常见：胚珠在子房里，受精后变成“seed（种子）”；而“ovary（子房）”成熟后通常变成“fruit（果实）”。","注意区分：植物的“ovule（胚珠）”不等同于动物的“ovum/egg（卵/卵细胞）”。日常英语里谈到动物通常说“eggs”或“ova”，而“ovule”更多出现在植物学或较专业语境中。"]}
{"word":"ovuliferous","summary":{"en":"Ovuliferous means “bearing eggs or ovules,” used mainly in biology and botany.","zh":"ovuliferous 意为“具卵的/具胚珠的”，主要用于生物学与植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Botany) Bearing or carrying eggs or ovules (structures that can develop into seeds after fertilization).","zh":"（生物学/植物学）“具卵的；具胚珠的”，指携带卵或胚珠（受精后可发育成种子的结构）。"},"examples":[{"en":"In some plants, the ovuliferous scale protects the ovules on the cone.","zh":"在一些植物中，具胚珠的鳞片会保护球果上的胚珠。"},{"en":"The scientist examined the ovuliferous tissue under a microscope.","zh":"科学家在显微镜下观察了具卵（具胚珠）的组织。"}]}],"synonyms":["egg-bearing","ovule-bearing"],"phonetic":"/ˌoʊvjəˈlɪfərəs/","extraExplanation":["这个词比较少见，多用于植物学/生物学的正式语境。词源来自拉丁语：ovulum（“小卵/卵”）+ -ferous（“携带、产生”）。在针叶树（如松、杉）的球果结构里，常见搭配是 ovuliferous scale（“具胚珠鳞片/胚珠鳞片”），指承载胚珠的鳞片结构。"]}
{"word":"ovuligerous","summary":{"en":"Ovuligerous describes a plant structure that bears or produces ovules.","zh":"ovuligerous 指植物结构“具胚珠的/产生胚珠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bearing or producing ovules (the structures in plants that can develop into seeds after fertilization).","zh":"（植物）具胚珠的；产生胚珠的（胚珠受精后可发育成种子）。"},"examples":[{"en":"In a flower, the ovary contains the ovuligerous tissue where ovules develop.","zh":"在花中，子房含有具胚珠的组织，胚珠在其中发育。"},{"en":"The botanist examined the ovuligerous part of the cone under a microscope.","zh":"植物学家在显微镜下观察了球果中具胚珠的部分。"}]}],"synonyms":["ovule-bearing","ovulate (context-dependent)"],"phonetic":"/ˌoʊ.vjəˈlɪdʒ.ɚ.əs/","extraExplanation":["这是一个较少见、偏植物学/生物学的形容词，常用于描述能“携带胚珠”的结构（例如某些花的子房内部组织，或部分裸子植物球果中与胚珠相关的结构）。在日常英语中很少用到，多出现在学术文章、植物解剖或分类学描述里。","词形来源可拆理解：ovuli-（与 ovule“胚珠”相关）+ -gerous（“携带、产生”的意思，类似于 confluent 的那种构词思路；常见于 -ferous/-gerous 这类后缀，如 “carboniferous” 表示“含碳的/产碳的”一类）。"]}
{"word":"ovulist","summary":{"en":"“Ovulist” is a rare noun meaning either (1) someone focused on ovulation (especially in older/less common usage) or (2) historically, a supporter of ovulism, the idea that the embryo was preformed in the egg.","zh":"“Ovulist”是个较少见的名词：可指（1）专注于排卵研究/预测的人（多见于较旧或不常用表达），也可指（2）历史上“卵先成说/卵预成说”的支持者，认为胚胎预先存在于卵子中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies ovulation or specializes in detecting/predicting ovulation (rare; often replaced by “fertility specialist” or “reproductive endocrinologist”).","zh":"研究排卵或专门检测/预测排卵的人（较少用；常用“生育/不孕专科医生”“生殖内分泌科医生”等表达）。"},"examples":[{"en":"The clinic referred her to an ovulist to help track her cycle more accurately.","zh":"诊所把她转介给一位专门研究排卵的人，帮助她更准确地追踪周期。"},{"en":"Some older texts use “ovulist,” but modern writing usually says “fertility specialist.”","zh":"一些较旧的文本会用“ovulist”，但现代写作通常说“生育专科医生”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a supporter of “ovulism,” the early scientific idea that a fully formed embryo was pre-existing in the egg (a kind of preformation theory).","zh":"（历史义）“卵先成说/卵预成说”（ovulism）的支持者：早期科学观点之一，认为胚胎在卵子中预先完整存在（属于预成论的一种）。"},"examples":[{"en":"In the history of biology, ovulists argued that development was already contained in the egg.","zh":"在生物学史上，“卵先成说”的支持者认为发育早已包含在卵子之中。"},{"en":"The debate between ovulists and spermists helped shape later ideas about embryology.","zh":"“卵先成说”与“精先成说”的争论推动了后来胚胎学观念的发展。"}]}],"synonyms":["fertility specialist","reproductive endocrinologist","embryology theorist (historical)"],"phonetic":"/ˈɑv.jə.lɪst/","extraExplanation":["“ovulist”在现代医学英语里非常少见；如果你在学术或医院语境中表达“排卵/生育方面的专家”，更常用的说法是 fertility specialist / reproductive endocrinologist（生殖内分泌科医生）。","历史上的“ovulist”对应的是17—18世纪与“spermist（精先成说支持者）”相对的一派。两者都属于“preformationism（预成论）”的范畴，后来被现代胚胎学与遗传学的发展所取代。"]}
{"word":"ovulite","summary":{"en":"Likely meant: ovulate — to release an egg (ovulation), or (in plants) to form ovules.","zh":"很可能想查：ovulate——（人/动物）排卵；（植物）形成胚珠。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person or animal) to release an egg from an ovary; to have ovulation.","zh":"（人或动物）排卵；释放卵子。"},"examples":[{"en":"Many people use a calendar or an app to estimate when they ovulate.","zh":"很多人会用日历或应用程序来估算自己何时排卵。"},{"en":"Some conditions can make it harder to ovulate regularly.","zh":"一些疾病会让规律排卵变得更困难。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a plant) to form or produce ovules (the structures that can develop into seeds after fertilization).","zh":"（植物）形成/产生胚珠（受精后可发育成种子的结构）。"},"examples":[{"en":"After the flower forms, the plant begins to ovulate inside the ovary of the flower.","zh":"花形成后，植物会在花的子房内开始产生胚珠。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause an ovary to release an egg (often used in medical or scientific contexts).","zh":"（医学/科学语境）促使卵巢排卵。"},"examples":[{"en":"Doctors may use medication to help a patient ovulate.","zh":"医生可能会用药物帮助患者排卵。"}]}],"synonyms":["have ovulation","release an egg","produce ovules"],"phonetic":"/ˈɑv.jəˌleɪt/","extraExplanation":["“ovulite” 不是常见标准英语单词。你很可能想查的是 **ovulate**（排卵）。如果你是在药品名、品牌名或特定领域资料里看到 “Ovulite”，它也可能是专有名词（例如产品名），需要结合上下文才能确定准确含义。"]}
{"word":"ovulum","summary":{"en":"Ovulum means a small ovule (seed-forming structure in a plant ovary), a term seen mostly in older or specialized botany.","zh":"ovulum 指“小胚珠/胚珠”，多见于较旧或较专门的植物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small ovule; in botany, the structure in a flower’s ovary that can develop into a seed after fertilization (a diminutive form of “ovum”).","zh":"小胚珠；植物学中指花的子房内、受精后可发育成种子的结构（源自“ovum/卵”的指小形式）。"},"examples":[{"en":"In some older botany texts, the term ovulum is used for what modern books usually call an ovule.","zh":"在一些较早的植物学教材中，会用 ovulum 指现代教材通常称为 ovule（胚珠）的结构。"},{"en":"After pollination, each ovulum may develop into a seed if fertilization occurs.","zh":"授粉后，如果发生受精，每个 ovulum 都可能发育成一粒种子。"}]}],"synonyms":["ovule"],"phonetic":"/ˈɑv.jə.ləm/","extraExplanation":["“ovulum”来自拉丁语，是“ovum（卵）”的指小形式，字面意思是“小卵”。在现代英语中更常用的对应词是“ovule（胚珠）”，所以你可能更多在旧式或专门的植物学文献里见到 ovulum。"]}
{"word":"ovum","summary":{"en":"An ovum is a female reproductive cell (an egg), a formal/scientific term often used in medicine and biology.","zh":"ovum 指“卵细胞/卵”，是较正式、偏医学或生物学的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female reproductive cell (egg) that can be fertilized to form an embryo.","zh":"雌性生殖细胞（卵细胞）；可与精子结合受精并形成胚胎。"},"examples":[{"en":"In humans, one ovum is usually released each month during ovulation.","zh":"在人类中，排卵期通常每个月会释放一个卵细胞。"},{"en":"If a sperm fertilizes the ovum, pregnancy can begin.","zh":"如果精子使卵细胞受精，就可能开始怀孕。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology (especially in plants or animals), an egg or egg-like structure involved in reproduction.","zh":"（生物学）卵或类似卵的结构（常指与繁殖有关的结构，尤其在植物或动物中）。"},"examples":[{"en":"The scientist observed the ovum under a microscope.","zh":"科学家在显微镜下观察卵。"},{"en":"Some textbooks use “ovum” for animal eggs and “ovule” for plant structures.","zh":"一些教材用“ovum”指动物的卵，用“ovule”指植物的胚珠结构。"}]}],"synonyms":["egg","female gamete"],"phonetic":"/ˈoʊvəm/","extraExplanation":["“Ovum”是拉丁语来源，意思是“蛋/卵”。在日常英语里，人们更常说“egg”，而“ovum”更偏医学或生物学语境（更正式）。","复数是“ova”（读作 /ˈoʊvə/），例如：The ovaries contain many ova.（卵巢里有许多卵细胞。）","相关词：ovary（卵巢）、ovulation（排卵）、fertilization（受精）、zygote（受精卵）。","在文学或修辞中，“ovum/ova”有时会被用作“生命起源/孕育”的象征，但通常仍带有较强的学术或正式色彩。"]}

