{"word":"oyahoga","summary":{"en":"“Cuyahoga” is a proper name in Ohio, best known for the Cuyahoga River and places named after it.","zh":"“Cuyahoga”是美国俄亥俄州的专有地名，最常指凯霍加河，以及以它命名的县与国家公园等地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cuyahoga: a river in northeast Ohio that flows through Akron and Cleveland and empties into Lake Erie.","zh":"凯霍加河（Cuyahoga River）：美国俄亥俄州东北部的一条河流，流经阿克伦与克利夫兰，最终注入伊利湖。"},"examples":[{"en":"The Cuyahoga River runs through downtown Cleveland.","zh":"凯霍加河穿过克利夫兰市中心。"},{"en":"We walked along the Cuyahoga River Trail in the Cuyahoga Valley.","zh":"我们在凯霍加谷沿着凯霍加河步道散步。"}]},{"partOfSpeech":"n.","definition":{"en":"Cuyahoga: used in place names in Ohio, especially Cuyahoga County and Cuyahoga Valley National Park.","zh":"Cuyahoga：常见于俄亥俄州的地名中，如凯霍加县（Cuyahoga County）与凯霍加谷国家公园（Cuyahoga Valley National Park）。"},"examples":[{"en":"She grew up in Cuyahoga County.","zh":"她在凯霍加县长大。"},{"en":"Cuyahoga Valley National Park is a popular weekend trip from Cleveland.","zh":"凯霍加谷国家公园是从克利夫兰出发很受欢迎的周末短途旅行地。"}]}],"synonyms":["Cuyahoga River","Cuyahoga County","Cuyahoga Valley","Cuyahoga Valley National Park"],"phonetic":"/ˌkaɪ.əˈhoʊ.ɡə/","extraExplanation":["你输入的“oyahoga”不是常见英文词，更像是把 **Cuyahoga** 拼错了（读音接近“kai-uh-HOH-guh”）。如果你想查的是别的词/地名，也可以告诉我所在句子或国家/地区，我再帮你确认。","“Cuyahoga”来自美洲原住民语言（常被解释为“弯曲的河/曲流的河”）。","凯霍加河曾因工业污染而著名：1969年河面起火事件成为美国环保运动的重要象征之一，推动了公众对水污染治理的关注。"]}
{"word":"oyster","summary":{"en":"An oyster is a shellfish; it can be eaten and is sometimes linked to pearls and idioms about hidden value or opportunity.","zh":"oyster 指牡蛎（一种贝类海鲜）；也常与珍珠及“隐藏价值/机会”的英语习语相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea animal with a soft body that lives inside a hard shell; some oysters make pearls and some are eaten as seafood","zh":"牡蛎；一种生活在坚硬贝壳里的海洋软体动物；有的会产珍珠，有的可作为海鲜食用"},"examples":[{"en":"They ordered a dozen oysters and shared them as an appetizer.","zh":"他们点了一打牡蛎，作为开胃菜一起分享。"},{"en":"An oyster filters seawater to find tiny bits of food.","zh":"牡蛎会过滤海水来获取微小的食物颗粒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is quiet and does not show feelings easily (used in the phrase “as/like an oyster”)","zh":"沉默寡言、不轻易表露情感的人（常见于短语“as/like an oyster”）"},"examples":[{"en":"He’s like an oyster in meetings—he rarely says what he thinks.","zh":"他在会议上像个闷葫芦——很少说出自己的想法。"}]}],"synonyms":["shellfish","bivalve"],"phonetic":"/ˈɔɪstɚ/","extraExplanation":["常见习语：\"The world is your oyster\" 意为“世界任你施展/机会无限”。它来自莎士比亚《温莎的风流娘儿们》(The Merry Wives of Windsor) 中的台词：\"Why then the world's mine oyster\"，意思是“我会像撬开牡蛎一样打开世界，获得我想要的东西”。","文化小贴士：英语里牡蛎常与“珍贵的东西藏在坚硬外壳里”联系在一起，因此相关比喻多指“潜力、机会、隐藏的价值”。"]}
{"word":"oysters","summary":{"en":"Oysters are saltwater shellfish, often eaten as seafood; the word can also be used metaphorically to mean something full of hidden opportunities.","zh":"Oysters 指牡蛎/生蚝等海水贝类，也可作比喻表示“蕴藏机会或宝藏的事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A saltwater shellfish with a rough shell, often eaten raw or cooked.","zh":"牡蛎；一种海水贝类，外壳粗糙，常生吃或熟食。"},"examples":[{"en":"They ordered a dozen oysters with lemon at the restaurant.","zh":"他们在餐厅点了一打牡蛎，配柠檬。"},{"en":"Some people prefer oysters grilled with garlic butter.","zh":"有些人更喜欢蒜香黄油烤牡蛎。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing believed to hide something valuable inside (used in the saying “The world is your oyster”).","zh":"（比喻）蕴藏机会或宝藏的人/事物（常见于谚语“世界是你的牡蛎”）。"},"examples":[{"en":"With her new skills, the world felt like her oyster.","zh":"有了新技能，她觉得世界充满机会。"}]}],"synonyms":["shellfish","bivalve"],"phonetic":"/ˈɔɪstɚ/","extraExplanation":["“oyster”在英语文化里常和“珍珠”联想在一起，因为珍珠可能在牡蛎体内形成，所以它也引申出“里面藏着好东西/机会”的比喻意义。","饮食文化上，生蚝（raw oysters）在一些地区被视为海鲜冷盘；但对初学者来说，点餐时常见搭配词有：lemon（柠檬）、vinegar（醋）、hot sauce（辣酱）、grilled（烤的）。"]}
{"word":"oysterseed","summary":{"en":"Oyster seed means juvenile oysters used to stock oyster beds or farms.","zh":"oyster seed 指用于投放养殖的牡蛎苗（幼牡蛎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Young oysters (spat) used to start or stock an oyster bed or farm; juvenile oysters for aquaculture.","zh":"（养殖用的）牡蛎苗；用于投放到牡蛎床/牡蛎养殖场的幼牡蛎（又称牡蛎“苗”“蚝苗”）。"},"examples":[{"en":"The farm buys oyster seed every spring to restock the beds.","zh":"这家养殖场每年春天都会购买牡蛎苗来补充牡蛎床。"},{"en":"Clean water and good oyster seed are both essential for a successful harvest.","zh":"干净的水质和优质的牡蛎苗对丰收都很关键。"},{"en":"They moved the oyster seed to deeper water to protect it from heat.","zh":"他们把牡蛎苗转移到更深的水域，以避免高温影响。"}]}],"synonyms":["spat","juvenile oysters","oyster spat"],"phonetic":"ˈɔɪstɚ siːd","extraExplanation":["在英语里更常见的写法是 **oyster seed**（分开写），也常用更专业的词 **spat** 指“刚附着不久的幼牡蛎”。在贝类养殖语境中，seed 并不是“种子”，而是“用来繁殖/投放的幼体”。"]}
{"word":"oysterwomen","summary":{"en":"An oysterwoman is a woman who gathers or sells oysters, especially in traditional coastal work.","zh":"oysterwoman 指采挖或售卖牡蛎的女性，常带有沿海传统职业的语境色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who harvests (digs, gathers) oysters or works selling/handling oysters, often as a traditional coastal occupation","zh":"采挖牡蛎的女性；从事牡蛎捕捞、分拣或售卖工作的女性（常见于沿海传统行业）"},"examples":[{"en":"The oysterwomen went out at low tide to gather oysters from the mudflats.","zh":"退潮时，采蚝女们会到滩涂上采集牡蛎。"},{"en":"In the old port, oysterwomen sold fresh oysters by the basket.","zh":"在老港口，采蚝女们一篮一篮地卖新鲜牡蛎。"},{"en":"She comes from a family of oysterwomen and fishermen.","zh":"她出身于一个采蚝女和渔民世家。"}]}],"synonyms":["oyster harvester","oyster worker","shellfish harvester","oyster farmer"],"phonetic":"/ˈɔɪstərˌwʊmən/","extraExplanation":["“oysterwoman”由“oyster（牡蛎）+ woman（女性）”构成，语体上偏历史/地域色彩，在描写沿海社区生计、民俗或旧时劳作时更常见。","有时也会看到复数写作“oysterwomen”，表示“采蚝女们”。在现代英语里，更常用更中性的表达如“oyster harvesters / oyster farmers / oyster workers”。"]}
