{"word":"oy","summary":{"en":"“Oy” is an exclamation expressing annoyance, frustration, surprise, or resignation.","zh":"“Oy”是一个感叹词，用来表达烦恼、无奈、惊讶或不耐烦。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show annoyance, frustration, surprise, or tired resignation (similar to “oh,” “ugh,” or “come on”).","zh":"感叹词，用来表达烦恼、无奈、惊讶或不耐烦（类似“哦”“唉”“拜托”）。"},"examples":[{"en":"Oy, the bus is late again.","zh":"唉，公交又晚点了。"},{"en":"Oy! Watch where you’re going!","zh":"哎！看着点路！"},{"en":"Oy vey, what a mess.","zh":"哎呀/我的天哪，太乱了。"}]}],"synonyms":["oh","ugh","geez","come on"],"phonetic":"/ɔɪ/","extraExplanation":["“Oy”常见于带有犹太/意第绪语（Yiddish）文化背景的英语表达，在美国英语里也很常听到。语气可以从轻松吐槽到真烦恼不等，具体看语境和语调。","常见搭配：\"Oy vey\"（更强烈的“哎呀/天哪/真受不了”）。在正式写作中不常用，更适合口语或对话描写。"]}
{"word":"oyahoga","summary":{"en":"“Cuyahoga” is a proper name in Ohio, best known for the Cuyahoga River and places named after it.","zh":"“Cuyahoga”是美国俄亥俄州的专有地名，最常指凯霍加河，以及以它命名的县与国家公园等地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cuyahoga: a river in northeast Ohio that flows through Akron and Cleveland and empties into Lake Erie.","zh":"凯霍加河（Cuyahoga River）：美国俄亥俄州东北部的一条河流，流经阿克伦与克利夫兰，最终注入伊利湖。"},"examples":[{"en":"The Cuyahoga River runs through downtown Cleveland.","zh":"凯霍加河穿过克利夫兰市中心。"},{"en":"We walked along the Cuyahoga River Trail in the Cuyahoga Valley.","zh":"我们在凯霍加谷沿着凯霍加河步道散步。"}]},{"partOfSpeech":"n.","definition":{"en":"Cuyahoga: used in place names in Ohio, especially Cuyahoga County and Cuyahoga Valley National Park.","zh":"Cuyahoga：常见于俄亥俄州的地名中，如凯霍加县（Cuyahoga County）与凯霍加谷国家公园（Cuyahoga Valley National Park）。"},"examples":[{"en":"She grew up in Cuyahoga County.","zh":"她在凯霍加县长大。"},{"en":"Cuyahoga Valley National Park is a popular weekend trip from Cleveland.","zh":"凯霍加谷国家公园是从克利夫兰出发很受欢迎的周末短途旅行地。"}]}],"synonyms":["Cuyahoga River","Cuyahoga County","Cuyahoga Valley","Cuyahoga Valley National Park"],"phonetic":"/ˌkaɪ.əˈhoʊ.ɡə/","extraExplanation":["你输入的“oyahoga”不是常见英文词，更像是把 **Cuyahoga** 拼错了（读音接近“kai-uh-HOH-guh”）。如果你想查的是别的词/地名，也可以告诉我所在句子或国家/地区，我再帮你确认。","“Cuyahoga”来自美洲原住民语言（常被解释为“弯曲的河/曲流的河”）。","凯霍加河曾因工业污染而著名：1969年河面起火事件成为美国环保运动的重要象征之一，推动了公众对水污染治理的关注。"]}
{"word":"oyana","summary":{"en":"“Oyana” is most commonly used in English as a personal name rather than a standard vocabulary word.","zh":"“Oyana”在英语中最常见的用法是作为人名，而不是常规词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually used for a girl or woman); not a common standard English vocabulary word, but used as a personal name in different cultures.","zh":"人名（多为女性名）；不是常见的英语词汇，但在不同文化中可作为名字使用。"},"examples":[{"en":"Oyana introduced herself and asked where the meeting room was.","zh":"Oyana 做了自我介绍，并问会议室在哪里。"},{"en":"I met someone named Oyana at a language exchange event.","zh":"我在语言交换活动上认识了一个叫 Oyana 的人。"}]}],"synonyms":["Ayana","Oriana"],"phonetic":"/oʊˈjɑːnə/","extraExplanation":["“Oyana”在英语里通常被当作专有名词（名字）来使用，而不是像 common words 那样有固定词义。","作为名字时，读音可能因地区与个人偏好而不同；在美国英语里常见的读法可接近 /oʊˈjɑːnə/（大致类似“哦-呀-娜”）。","如果你是在歌词、影视台词或某种语言（如巴斯克语/西班牙语/日语罗马字等）中看到“oyana”，它可能是外来词或专门用法；你可以把原句发我，我能根据上下文更准确解释。"]}
{"word":"oyapock","summary":{"en":"Oyapock: a river forming most of the border between French Guiana and Brazil.","zh":"Oyapock：构成法属圭亚那与巴西大部分边界的河流（奥亚波克河）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in northeastern South America that forms most of the border between French Guiana (France) and the Brazilian state of Amapá; it flows into the Atlantic Ocean.","zh":"奥亚波克河：南美洲东北部的一条河流，构成法属圭亚那（法国海外属地）与巴西阿马帕州大部分边界，最终注入大西洋。"},"examples":[{"en":"The Oyapock River marks much of the boundary between French Guiana and Brazil.","zh":"奥亚波克河标示了法属圭亚那与巴西之间的大部分边界。"},{"en":"We crossed the Oyapock by bridge to travel between Saint-Georges and Oiapoque.","zh":"我们通过桥梁跨越奥亚波克河，在圣乔治（Saint-Georges）与奥亚波克（Oiapoque）之间往返。"}]}],"synonyms":["Oiapoque River"],"phonetic":"/ɔɪ.əˈpɑk/","extraExplanation":["“Oyapock”常见于地理与新闻语境，属于专有名词（河流名），通常首字母大写：the Oyapock (River)。","在法语语境中也常写作“l’Oyapock”；在葡萄牙语中你可能会看到相关地名“Oiapoque”（巴西一侧的城市名），拼写不同但地理位置相关。"]}
{"word":"oyelet","summary":{"en":"“Oyelet” isn’t a common English word; it’s likely a name or a misspelling of another term.","zh":"“Oyelet”不是常见英语词；更可能是人名或其他词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a personal name or a misspelling/variant of another word.","zh":"不是标准英语词；更常见为人名，或是其他词的拼写错误/变体。"},"examples":[{"en":"I’m not sure what “oyelet” means—could it be a name?","zh":"我不确定“oyelet”是什么意思——它可能是个名字吗？"},{"en":"Her username is Oyelet on that app.","zh":"她在那个应用上的用户名是 Oyelet。"}]}],"phonetic":"/oʊˈjɛlət/","extraExplanation":["“oyelet”在常见英语词典里通常查不到。如果你是在某个句子/文章里看到的，发我原句我可以根据上下文判断意思。","它也可能是拼写接近的词：比如你想写的是“outlet（出口/渠道/插座）”“omelet（煎蛋卷）”或某个外语词/人名的音译。","如果你能告诉我：1) 你在哪里看到它（书/歌词/聊天/品牌）2) 你想表达的中文意思或发音，我可以帮你锁定正确词。"]}
{"word":"oyer","summary":{"en":"Oyer is a historical legal term meaning a request/right to have a document read aloud in court; it also appears in “oyer and terminer,” referring to a court hearing authorized to hear and decide serious cases.","zh":"Oyer 是历史法律用语，指在法庭上要求/享有权利让法律文书当庭宣读；也常出现在“oyer and terminer”中，指有权审理并裁决重大案件的法庭/审判程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, historical) A request or right to have a legal document read aloud in court, especially when the other side refers to it in their pleadings.","zh":"（法律，历史用语）在法庭上要求（或享有权利）让某份法律文书被当庭宣读，常见于对方在诉状中引用该文书时。"},"examples":[{"en":"The defendant demanded oyer of the bond mentioned in the complaint.","zh":"被告要求对诉状中提到的保证书进行当庭宣读（oyer）。"},{"en":"In older common-law practice, a party could ask for oyer to know the exact wording of a document.","zh":"在较早的英美普通法实践中，当事人可以请求 oyer 以了解文件的确切措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, in the phrase “oyer and terminer”) A hearing or court session, especially one authorized to hear and decide serious criminal cases.","zh":"（法律，常见于短语“oyer and terminer”）开庭审理；尤指被授权审理并裁决严重刑事案件的法庭/审判程序。"},"examples":[{"en":"The case was brought before the court of oyer and terminer.","zh":"该案被提交至“oyer and terminer”法庭审理。"},{"en":"Historically, commissions of oyer and terminer were used to try major felonies.","zh":"历史上，“oyer and terminer”的委任状常用于审理重大重罪案件。"}]}],"synonyms":["(historical) reading aloud","recital (of a document)","(phrase) oyer and terminer"],"phonetic":"/ˈɔɪ.ər/","extraExplanation":["“Oyer”来自法语（古法语）“ouïr”，意为“听见/听”。在中世纪和近代早期的英美普通法诉讼中，很多当事人并不一定能拿到对方引用的文书副本，因此会请求法院“宣读”该文书，以便准确回应其内容。","现代法律实践中，这个词多见于历史文献、判例讨论或固定搭配“oyer and terminer”。在日常英语里几乎不会使用。"]}
{"word":"oyers","summary":{"en":"“Oyers” is the plural of “oyer,” an old legal word meaning a court hearing, often seen in “oyer and terminer.”","zh":"“oyers”是“oyer”的复数，是较旧的法律用语，指法庭听审/审理，常见于“oyer and terminer”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(law, formal/old-fashioned) A hearing in court; the act of hearing or examining a case, especially in the historical phrase “oyer and terminer.”","zh":"（法律，正式/旧式）法庭听审；对案件的审理与裁决（常见于历史短语“oyer and terminer”）"},"examples":[{"en":"The judge scheduled an oyer to review the disputed documents.","zh":"法官安排了一次听审来审查有争议的文件。"},{"en":"In old legal texts, you may see “oyer and terminer,” meaning to hear and decide a case.","zh":"在旧法律文本中，你可能会看到“oyer and terminer”，意思是“听审并裁决案件”。"}]}],"synonyms":["hearing","trial","proceeding"],"phonetic":"ˈɔɪ.ɚ","extraExplanation":["“oyer”源自古法语/法律法语，和动词“to hear（听）”有关；在现代英语里非常少见，主要出现在历史法律用语或特定法学写作中。","你输入的“oyers”通常是复数形式（多个听审/审理）。如果你其实想查的是别的常用词（如“orders / odors / owners”），告诉我上下文句子我可以帮你确认。"]}
{"word":"oyes","summary":{"en":"“Oyez” is an old ceremonial call meaning “Listen!”, mainly used in courts or formal announcements.","zh":"“Oyez”是古老的仪式性喊话，意思是“请听/肃静”，主要用于法庭或正式公告场合。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A traditional call meaning “Listen!” used to open court sessions or make public announcements (especially in the U.S. and U.K.).","zh":"（传统用语）“肃静/请听！”常用于法庭开庭或发布公告时的宣告（尤指英美）。"},"examples":[{"en":"Oyez, oyez, oyez—all persons having business before this court draw near and give your attention.","zh":"肃静，肃静，肃静——凡在本庭有事务者请靠前并注意聆听。"},{"en":"The bailiff began with “Oyez” before reading the judge’s order.","zh":"法警在宣读法官命令前先以“Oyez”开场。"}]}],"synonyms":["hear ye","listen","attention"],"phonetic":"/oʊˈjeɪ/","extraExplanation":["你输入的“oyes”常见正确拼写是 **oyez**（读音接近“哦-耶”）。它源自古法语“oyez”，相当于“hear ye（诸位请听）”。","在美国，最高法院开庭时的固定开场白就会用到“Oyez”。因此它多见于法律/仪式语境，日常口语里很少用。"]}
{"word":"oyesses","summary":{"en":"“oyesses” is not standard; it likely means “oh, yes” or the plural “yeses.”","zh":"“oyesses”不是标准用词；多半是想写“oh, yes”或“yeses”（yes 的复数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a playful spelling of “oh, yes” (an enthusiastic agreement) or “yeses” (plural of “yes”).","zh":"不是标准英语单词；更可能是拼写错误或一种俏皮写法，想表达“oh, yes”（热情的赞同）或“yeses”（“yes”的复数）。"},"examples":[{"en":"Did you mean “oh, yes”?","zh":"你是想写“oh, yes”吗？"},{"en":"I heard a lot of “yeses” in the meeting.","zh":"我在会议上听到很多人说“yes”（很多次同意）。"}]}],"synonyms":["oh, yes","yes","yeses"],"phonetic":"/ɔɪˈjɛsɪz/","extraExplanation":["“oyesses”在常见词典里一般查不到。如果你能告诉我它出现的句子（上下文）或你想表达的意思，我可以帮你判断最可能的正确拼写。","如果你想表达强烈同意，常见写法是“oh, yes!”；如果是“yes”的复数（很多次/很多人的同意），写作“yeses”（/ˈjɛsɪz/）。"]}
{"word":"oyez","summary":{"en":"“Oyez” is an old formal call meaning “Hear ye!”, used to open official announcements, especially in courts.","zh":"“Oyez”是一个古老而正式的呼喊，意思是“大家听着！”，常用于法庭等正式公告开头。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A cry used by a public crier to call for attention, meaning “Hear ye!” (often at the start of official announcements, especially in courts).","zh":"（公告员的）呼喊，用来引起注意，意思是“大家听着！”（常用于正式公告开头，尤其在法庭场合）"},"examples":[{"en":"Oyez, oyez, oyez—this court is now in session.","zh":"大家听着，大家听着，大家听着——本法庭现在开庭。"},{"en":"The announcer began with “Oyez” to get the crowd’s attention.","zh":"主持人用“oyez”开场来吸引人群注意。"}]}],"synonyms":["hear ye","attention","listen up (less formal)"],"phonetic":"/oʊˈjeɪ/","extraExplanation":["“oyez”来自古法语/英法语的“oyez”（意为“你们听！”），是动词“ouïr”（听见）的命令式形式。现代英语里多作为一种仪式化、带历史感的用语。","在美国语境中最常见于最高法院开庭时的传统开场词：“Oyez! Oyez! Oyez!”（相当于庄严的“肃静，请听宣告/开庭了”）。","作为书面语或日常对话里很少用；更多出现在历史题材作品、法庭场景台词或仿古风格的公告中。"]}
{"word":"oylet","summary":{"en":"Owlet means a young or small owl.","zh":"Owlet 指幼小的猫头鹰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young owl; a small owl.","zh":"幼鸮；小猫头鹰。"},"examples":[{"en":"We found an owlet on the ground and called a wildlife rescue center.","zh":"我们在地上发现了一只幼猫头鹰，于是联系了野生动物救助中心。"},{"en":"The owlet stayed close to its nest while learning to fly.","zh":"幼鸮在学习飞行时一直待在巢附近。"}]}],"synonyms":["young owl","baby owl"],"phonetic":"ˈaʊlɪt","extraExplanation":["“oylet”通常不是标准英语拼写；你很可能想写的是 **owlet**（幼猫头鹰）。","**owlet** 由 **owl**（猫头鹰）+ 后缀 **-let** 构成，**-let** 常表示“小的/幼小的”（如 booklet=小册子）。"]}
{"word":"oyster","summary":{"en":"An oyster is a shellfish; it can be eaten and is sometimes linked to pearls and idioms about hidden value or opportunity.","zh":"oyster 指牡蛎（一种贝类海鲜）；也常与珍珠及“隐藏价值/机会”的英语习语相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea animal with a soft body that lives inside a hard shell; some oysters make pearls and some are eaten as seafood","zh":"牡蛎；一种生活在坚硬贝壳里的海洋软体动物；有的会产珍珠，有的可作为海鲜食用"},"examples":[{"en":"They ordered a dozen oysters and shared them as an appetizer.","zh":"他们点了一打牡蛎，作为开胃菜一起分享。"},{"en":"An oyster filters seawater to find tiny bits of food.","zh":"牡蛎会过滤海水来获取微小的食物颗粒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is quiet and does not show feelings easily (used in the phrase “as/like an oyster”)","zh":"沉默寡言、不轻易表露情感的人（常见于短语“as/like an oyster”）"},"examples":[{"en":"He’s like an oyster in meetings—he rarely says what he thinks.","zh":"他在会议上像个闷葫芦——很少说出自己的想法。"}]}],"synonyms":["shellfish","bivalve"],"phonetic":"/ˈɔɪstɚ/","extraExplanation":["常见习语：\"The world is your oyster\" 意为“世界任你施展/机会无限”。它来自莎士比亚《温莎的风流娘儿们》(The Merry Wives of Windsor) 中的台词：\"Why then the world's mine oyster\"，意思是“我会像撬开牡蛎一样打开世界，获得我想要的东西”。","文化小贴士：英语里牡蛎常与“珍贵的东西藏在坚硬外壳里”联系在一起，因此相关比喻多指“潜力、机会、隐藏的价值”。"]}
{"word":"oysterage","summary":{"en":"Oysterage means an oyster bed/fishery, and sometimes (in legal or historical contexts) the right to harvest oysters in a place.","zh":"oysterage 指牡蠣產區/牡蠣床/牡蠣漁場；也可指（法律或歷史語境中）在某地採捕牡蠣的權利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an area (such as an oyster bed or shoreline) where oysters are found, gathered, or farmed; an oyster fishery.","zh":"（可採集或養殖牡蠣的）牡蠣產區／牡蠣床／牡蠣漁場。"},"examples":[{"en":"The village depended on the nearby oysterage for income during the winter.","zh":"這個村莊冬季的收入主要靠附近的牡蠣產區。"},{"en":"Pollution can quickly damage an oysterage and the livelihoods tied to it.","zh":"污染會很快破壞牡蠣漁場，也會影響依賴它維生的人們。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in legal or historical writing) the right, privilege, or practice of taking/harvesting oysters in a particular place.","zh":"（多見於法律或歷史語境）在特定地點採捕牡蠣的權利／特許／慣例。"},"examples":[{"en":"The deed mentioned oysterage rights along the tidal flats.","zh":"地契提到在潮間帶的牡蠣採捕權。"},{"en":"Local disputes sometimes arose over oysterage in shared waters.","zh":"在共用水域中，地方上有時會因牡蠣採捕權而起爭端。"}]}],"synonyms":["oyster bed","oyster fishery","oyster farm","oyster grounds"],"phonetic":"ˈɔɪstərɪdʒ","extraExplanation":["「oysterage」屬於較少見、偏書面或歷史/法律用語；現代日常英文更常用 *oyster bed*（牡蠣床）、*oyster fishery*（牡蠣漁業/漁場）、*oyster farm*（牡蠣養殖場）。","字尾 *-age* 常用來表示「場所、集合、活動或權利」（如 *anchorage* 可停泊處、*sewerage* 下水道系統），因此 *oysterage* 也帶有「牡蠣資源所在之地/其採捕活動或權利」的語感。"]}
{"word":"oysterbird","summary":{"en":"An oysterbird is a shorebird (often an oystercatcher) that feeds on shellfish.","zh":"oysterbird 指一种以贝类为食的滨鸟，常指“蛎鹬/蛎鸻”（oystercatcher）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shorebird (often called an oystercatcher) with a strong, bright bill used to pry open or pick up shellfish such as oysters and mussels.","zh":"一种滨鸟（常称“蛎鹬/蛎鸻”，英文常用 oystercatcher），有强壮而醒目的喙，用来撬开或拾取牡蛎、贻贝等贝类。"},"examples":[{"en":"We saw an oysterbird probing the sand for shellfish at low tide.","zh":"退潮时，我们看到一只蛎鹬在沙滩上探寻贝类。"},{"en":"The oysterbird’s long bill helps it open mussels.","zh":"蛎鹬的长喙能帮助它打开贻贝。"}]}],"synonyms":["oystercatcher"],"phonetic":"/ˈɔɪstərˌbɝd/","extraExplanation":["“oysterbird”在日常英语里不如“oystercatcher”常见，很多时候指的就是蛎鹬这类鸟（多个物种都可能被这样叫）。","这类鸟常见于海岸、河口、滩涂等地；它们不只吃牡蛎，也会吃蛤、贻贝、螺等贝类，因此名字带有“oyster-”但食性更广。"]}
{"word":"oystercatcher","summary":{"en":"An oystercatcher is a shorebird known for its strong bill and shellfish diet.","zh":"oystercatcher 指一种以贝类为食、嘴强壮的海岸鸟类（蛎鹬）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shorebird with a strong, bright bill used to pry open or cut shellfish such as oysters and mussels.","zh":"蛎鹬（海岸鸟类，嘴粗壮且颜色鲜亮，用来撬开或切开牡蛎、贻贝等贝类）。"},"examples":[{"en":"We watched an oystercatcher searching for mussels along the rocky shore.","zh":"我们看到一只蛎鹬在岩石海岸边寻找贻贝。"},{"en":"The oystercatcher’s long bill helps it open shells.","zh":"蛎鹬的长嘴能帮助它打开贝壳。"}]}],"synonyms":["shorebird","wader"],"phonetic":"/ˈɔɪstərˌkætʃər/","extraExplanation":["“oystercatcher”由“oyster（牡蛎）+ catcher（捕捉者）”组成，但它并不只吃牡蛎，也常吃贻贝、蛤蜊等贝类。","常见于欧洲与北美等海岸与河口地带；一些物种的外形特征是黑白羽色和显眼的橙红色嘴（不同种略有差异）。"]}
{"word":"oystered","summary":{"en":"“Oystered” usually means ‘covered with oysters/oyster shells,’ and it can also be the past form of “oyster” meaning ‘to gather oysters’ or ‘to add oysters (in cooking).’","zh":"“oystered”通常指“长满牡蛎/被牡蛎壳附着的”；也可作动词“oyster”的过去式/过去分词，表示“采牡蛎”或“（烹饪中）加牡蛎”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered or encrusted with oysters (or oyster shells), often because something has been in the sea for a long time.","zh":"被牡蛎（或牡蛎壳）附着、结壳的；常指物体在海里久了而长满牡蛎。"},"examples":[{"en":"The old pier posts were oystered and slippery.","zh":"老码头的木桩上长满牡蛎，又滑又难走。"},{"en":"We pulled up an oystered rope from the water.","zh":"我们从水里拉起一根长满牡蛎的绳子。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “oyster”: to gather oysters, or to supply something with oysters (usually in cooking).","zh":"“oyster”的过去式/过去分词：采牡蛎；（烹饪中）加牡蛎、用牡蛎配制。"},"examples":[{"en":"They oystered along the coast at low tide.","zh":"他们在退潮时沿海岸采牡蛎。"},{"en":"The chef oystered the stuffing with chopped oysters.","zh":"厨师在馅料里加入了切碎的牡蛎。"}]}],"synonyms":["encrusted","barnacled","shell-covered"],"phonetic":"/ˈɔɪstərd/","extraExplanation":["“oystered”作形容词时多见于描写海边景象或物体表面（如桩、绳、船底）被海生物附着的画面，带一点“粗粝、潮湿、海味”的质感。","作动词时，“to oyster”在现代英语里不算常用，更常见的说法是“to go oyster fishing / to harvest oysters（去捕捞/采收牡蛎）”。在菜谱语境里，可能会看到“oystered stuffing/sauce”等写法，表示“加了牡蛎的”。"]}
{"word":"oysterer","summary":{"en":"An oysterer is someone who works with oysters—collecting, farming, or selling them.","zh":"oysterer 指从事生蚝相关工作的人，如采捞、养殖或售卖生蚝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who collects, farms, or sells oysters; someone who works in the oyster trade.","zh":"采蚝者；养蚝/捞蚝的人；从事生蚝行业的人。"},"examples":[{"en":"Her grandfather was an oysterer on the coast for forty years.","zh":"她的祖父在海边做了四十年的采蚝人。"},{"en":"The oysterer brought in a fresh catch before sunrise.","zh":"采蚝人天亮前就把新鲜的生蚝运回来了。"},{"en":"Many oysterers worry about pollution affecting the beds.","zh":"许多采蚝者担心污染会影响蚝床。"}]}],"synonyms":["oysterman","oyster fisher","oyster farmer"],"phonetic":"/ˈɔɪstərər/","extraExplanation":["“oysterer”由“oyster（生蚝）+ -er（表示从事某工作的人）”构成，意思直观，但在日常英语里更常见的说法是“oysterman”。","在文学或纪实写作中，这类词常用来突出沿海社区的传统生计与海洋文化，例如描写渔港、潮汐、蚝床（oyster beds）等场景时会出现。"]}
{"word":"oysterers","summary":{"en":"“Oysterers” means people who harvest, farm, or sell oysters.","zh":"“oysterers”指採捕、養殖或販賣牡蠣的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who gather, farm, or sell oysters (the plural of “oysterer”).","zh":"採捕、養殖或販賣牡蠣的人（“oysterer”的複數）。"},"examples":[{"en":"The oysterers worked at low tide, raking oysters from the mudflats.","zh":"採蠣人趁退潮時工作，用耙子從泥灘裡撈起牡蠣。"},{"en":"Local oysterers asked the town to protect the bay from pollution.","zh":"當地採蠣人請求鎮上保護海灣免受污染。"}]}],"synonyms":["oystermen","oyster harvesters","oyster farmers"],"phonetic":"/ˈɔɪstərərz/","extraExplanation":["“oysterer”在現代英語中不如“oysterman / oystermen（採蠣人）”常見；你在書面語、地方性報導或較舊的文本裡更可能看到它。","相關常見搭配：oyster beds（牡蠣床／牡蠣養殖區）、to harvest oysters（採收牡蠣）、oyster farm（牡蠣養殖場）。"]}
{"word":"oysterfish","summary":{"en":"Oysterfish is a common name, often referring to the oyster toadfish, a fish found around oyster beds.","zh":"Oysterfish 是一种俗称，常指生活在牡蛎床附近的牡蛎蟾鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common name) A fish that lives around oyster beds, especially the oyster toadfish found on the Atlantic coast of North America.","zh":"（俗名）生活在牡蛎床附近的鱼，尤指北美大西洋沿岸常见的“牡蛎蟾鱼”（oyster toadfish）。"},"examples":[{"en":"Fishermen sometimes pull up an oysterfish when they’re working near the oyster beds.","zh":"渔民在牡蛎床附近作业时，有时会捞起一条“牡蛎鱼”（oysterfish）。"},{"en":"The oysterfish can make a low, croaking sound underwater.","zh":"牡蛎蟾鱼在水下会发出低沉、像蛙叫一样的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, any fish that is said to eat oysters or be found among oysters.","zh":"较少见：泛指据说会吃牡蛎或常出没在牡蛎群中的鱼。"},"examples":[{"en":"Some locals call any small fish hiding in the oysters an oysterfish.","zh":"有些当地人把躲在牡蛎里的小鱼统称为“牡蛎鱼”。"}]}],"synonyms":["oyster toadfish","toadfish"],"phonetic":"ˈɔɪstərˌfɪʃ","extraExplanation":["“oysterfish”并不是非常标准、固定的物种名称；在不同地区可能指不同的鱼。北美语境里它常被当作“oyster toadfish（牡蛎蟾鱼）”的俗称。正式写作或科普中，建议用更明确的名称（如 oyster toadfish 或学名）以避免误解。"]}
{"word":"oysterfishes","summary":{"en":"“Oysterfishes” means more than one oysterfish (a common-name fish associated with oyster beds; sometimes the oyster toadfish).","zh":"“oysterfishes”是 oysterfish 的复数，指多条（或多种）常在牡蛎床附近活动的鱼；有时也特指牡蛎蟾鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oysterfish: fishes (fish species) commonly found around oyster beds or rocky shores; in some regions this name is used especially for the oyster toadfish.","zh":"oysterfish 的复数：常见于牡蛎床、礁石或近岸水域的一类鱼；在一些地区这个名称也特指“牡蛎蟾鱼（oyster toadfish）”。"},"examples":[{"en":"Divers reported seeing several oysterfishes hiding among the oyster shells.","zh":"潜水员说他们看到几条 oysterfishes 藏在牡蛎壳之间。"},{"en":"The fisherman warned that oysterfishes can be hard to spot because they blend into the rocks.","zh":"渔夫提醒说 oysterfishes 很难发现，因为它们很容易和岩石融为一体。"}]}],"synonyms":["oysterfish (plural)","oyster toadfish (regional)"],"phonetic":"ˈɔɪstərˌfɪʃɪz","extraExplanation":["“oysterfish”属于俗名（common name），不同地区可能指不同鱼类，并不是一个严格对应单一物种的科学名称。阅读或查资料时，最好结合产地/水域信息或同时查该名称对应的拉丁学名（scientific name）。","英语里复数既可用“fish”（强调数量），也可用“fishes”（强调不同种类/物种）。这里的“oysterfishes”通常更偏向“不同种类的牡蛎栖息鱼类/被这样称呼的鱼类”。"]}
{"word":"oystergreen","summary":{"en":"Oystergreen is a soft, pale gray-green color name often used in design and product descriptions.","zh":"Oystergreen（牡蛎绿）是一种柔和的浅灰绿色，常用于设计与产品配色描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a pale, muted green with gray tones (a soft “shell-like” green), often used to name a paint, fabric, or design color","zh":"一种带灰调的浅淡绿色（类似牡蛎壳的柔和绿），常用于油漆、布料或设计配色名称"},"examples":[{"en":"They painted the bedroom oystergreen to make it feel calm and airy.","zh":"他们把卧室刷成牡蛎绿，让空间感觉更安静、通透。"},{"en":"The sofa comes in oystergreen or sand beige.","zh":"这款沙发有牡蛎绿或沙米色可选。"}]},{"partOfSpeech":"n.","definition":{"en":"the oystergreen color itself","zh":"牡蛎绿这种颜色本身"},"examples":[{"en":"Oystergreen works well with white trim and natural wood.","zh":"牡蛎绿很适合搭配白色线条和原木。"}]}],"synonyms":["sage green","seafoam green","gray-green","pale green"],"phonetic":"/ˈɔɪstɚ ɡrin/","extraExplanation":["“oyster green / oystergreen”多见于室内设计、油漆色卡、服装配色等语境，属于“颜色命名词”。它通常不是日常口语里最常用的基础颜色词（如 light green / mint / sage），更偏产品或品牌命名。","写法上既可能分开写（oyster green），也可能连写（oystergreen），取决于品牌或色卡风格；含义通常相同。"]}
{"word":"oysterhood","summary":{"en":"“Oysterhood” is a very rare, playful noun meaning the state of being like an oyster, or (less often) oysters considered as a group.","zh":"“oysterhood” 是一个非常少见、偏玩笑的名词，可指“像牡蛎一样的状态”，或（较少）指“牡蛎整体/群体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare, humorous) The state or condition of being an oyster; “oyster-ness.”","zh":"（很少见、带幽默色彩）作为牡蛎的状态或特性；“牡蛎的样子/牡蛎性”。"},"examples":[{"en":"In a silly poem, the narrator dreamed of retiring into oysterhood—quiet, closed, and safe.","zh":"在一首搞笑的诗里，叙述者梦见自己退隐到“牡蛎状态”里——安静、紧闭、又安全。"},{"en":"He joked that after a long meeting he entered oysterhood and refused to speak to anyone.","zh":"他开玩笑说开完冗长的会议后自己进入了“牡蛎模式”，谁也不想说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Oysters as a group or collective, formed like words such as “brotherhood.”","zh":"（很少见）牡蛎的群体/整体（仿照 brotherhood 这类词的构词方式）。"},"examples":[{"en":"The chef praised the local oysterhood for its clean, briny flavor.","zh":"主厨称赞本地“牡蛎群体”的风味干净、带海水咸香。"},{"en":"A cold tide brought the oysterhood closer to the shore.","zh":"寒潮把牡蛎群落带得更靠近岸边。"}]}],"synonyms":["oyster-ness (informal)","oyster life (informal)","oyster community (approx.)"],"phonetic":"/ˈɔɪstərˌhʊd/","extraExplanation":["这个词几乎不在现代常用英语里出现，更像是“临时造词（nonce word）/玩笑式造词”。它由 oyster（牡蛎）+ -hood（表示“身份、状态、群体”的后缀，如 childhood, neighborhood, brotherhood）构成，所以读者通常能凭构词法猜到大概意思。","在写作里用 oysterhood 往往带有夸张或幽默效果：把人描写得像牡蛎一样“紧闭、不说话、躲起来”，或把牡蛎当作一个“群体”来拟人化。"]}
{"word":"oysterhouse","summary":{"en":"An oysterhouse is usually a restaurant specializing in oysters; historically it could also mean a place where oysters are processed or sold.","zh":"oysterhouse 通常指主打生蚝的餐馆/蚝吧；历史上也可指牡蛎加工或售卖的场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A restaurant or seafood place that specializes in oysters (often served raw on the half shell) and other shellfish.","zh":"（主打生蚝/牡蛎的）蚝吧；生蚝餐馆；海鲜馆（常供应生蚝及其他贝类）。"},"examples":[{"en":"We had dinner at an oysterhouse near the harbor.","zh":"我们在港口附近的一家生蚝餐馆吃了晚饭。"},{"en":"This oysterhouse is famous for its fresh oysters and chowder.","zh":"这家蚝吧以新鲜生蚝和浓汤闻名。"},{"en":"Let’s meet at the oysterhouse after work.","zh":"下班后我们在蚝吧见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, historical) A place where oysters are shucked, stored, or prepared for sale, sometimes near docks or markets.","zh":"（较少见，偏历史）牡蛎加工/存放/售卖的场所（如码头或市场附近的剥蚝作坊/铺子）。"},"examples":[{"en":"In the 1800s, many coastal towns had small oysterhouses by the docks.","zh":"在19世纪，许多沿海城镇在码头旁都有小型的牡蛎作坊/铺子。"},{"en":"The old oysterhouse supplied oysters to local markets.","zh":"那家老牡蛎铺为本地市场供应牡蛎。"}]}],"synonyms":["oyster bar","seafood restaurant","shellfish house"],"phonetic":"/ˈɔɪstɚˌhaʊs/","extraExplanation":["“Oysterhouse”在美式英语里常指主打生蚝的海鲜餐厅，尤其在沿海城市（如新英格兰、纽约、旧金山等）很常见。菜单里常见表达包括：raw oysters（生蚝）、oysters on the half shell（半壳生蚝）、oyster bar（蚝吧/生蚝吧台）。","拼写上既可写作一个词 oysterhouse，也常见分开写 oyster house；含义通常相同，取决于店名或风格。"]}
{"word":"oysteries","summary":{"en":"Oysteries are places where oysters are grown, harvested, or sometimes sold (a less common word).","zh":"oysteries 指牡蛎养殖、采捕（有时也指售卖）的地点，是比较少见的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Places where oysters are cultivated, harvested, or sold; oyster beds, oyster fisheries, or (less commonly) oyster markets/shops.","zh":"牡蛎被养殖、采捕或售卖的地方；牡蛎养殖场/牡蛎床/牡蛎渔场（较少也可指卖牡蛎的市场或店）。"},"examples":[{"en":"After the storm, several coastal oysteries were closed to protect public health.","zh":"暴风雨过后，为了保障公众健康，几处沿海牡蛎养殖区被关闭了。"},{"en":"The river once supported thriving oysteries, but pollution reduced the harvest.","zh":"这条河过去曾有兴盛的牡蛎产区，但污染让产量下降了。"}]}],"synonyms":["oyster beds","oyster farms","oyster fisheries"],"phonetic":"/ˈɔɪstəriz/","extraExplanation":["“oysteries”是较少见的词，通常被理解为“oystery（牡蛎产地/牡蛎渔场）”的复数。更常见的表达是“oyster beds”（牡蛎床/牡蛎养殖区）、“oyster farms”（牡蛎养殖场）或“oyster fisheries”（牡蛎渔场）。","拼写上也可能是把更常见的“oysteries”（如口语或旧文献中的用法）当作复数来用；在正式写作中，建议根据语境改用更常见的搭配（例如谈养殖用“oyster farms”，谈自然栖息地用“oyster beds”）。"]}
{"word":"oystering","summary":{"en":"Oystering means harvesting oysters, and it can also refer to the act of collecting or preparing/serving oysters.","zh":"Oystering 指“采蚝/捞蚝”，也可指“采集或处理、供应牡蛎（如开蚝）”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of collecting or harvesting oysters (from the sea, tidal flats, or farms)","zh":"采蚝；捞蚝；收获牡蛎（从海里、潮间带或养殖场）"},"examples":[{"en":"They went oystering at low tide and brought home a bucket of oysters.","zh":"他们在退潮时去采蚝，带回家一桶牡蛎。"},{"en":"Oystering is common in many coastal communities during the cooler months.","zh":"在许多沿海社区，采蚝在较凉的月份很常见。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “oyster”: collecting oysters, or preparing/serving oysters (especially by opening them)","zh":"“oyster”的现在分词：采牡蛎；（尤指）开蚝并供应牡蛎"},"examples":[{"en":"He was oystering all morning and barely noticed the time.","zh":"他一整个上午都在采蚝，几乎没注意到时间。"},{"en":"She’s oystering at the raw bar—shucking and plating oysters quickly.","zh":"她在生蚝吧台忙着“开蚝”——快速撬开并装盘。"}]}],"synonyms":["oyster harvesting","gathering oysters","shucking oysters (food context)"],"phonetic":"/ˈɔɪstərɪŋ/","extraExplanation":["“oystering”在英语里更常见的是指一种沿海的工作/活动（采蚝、捞蚝），属于比较生活化、带地域色彩的词。","在餐饮语境中也可能指“处理牡蛎”的工作，尤其是shuck（开蚝、撬开牡蛎壳）这一动作；如果你想更准确表达“开蚝”，常用说法是“shucking oysters”。"]}
{"word":"oysterings","summary":{"en":"“Oysterings” usually means the activity of collecting oysters, and less commonly the oyster beds/grounds where they are gathered.","zh":"“oysterings”通常指采牡蛎的活动；较少见时也可指牡蛎床/牡蛎采集区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or practice of collecting oysters (oystering), especially as a local job or seasonal work.","zh":"采牡蛎的活动；捕捞/拾取牡蛎的工作（尤指地方性或季节性的生计）。"},"examples":[{"en":"In winter, many families earned extra money from oysterings along the bay.","zh":"冬天，许多家庭靠海湾一带的采牡蛎来赚外快。"},{"en":"The guide told us about old oysterings on the muddy flats at low tide.","zh":"导游给我们讲了退潮时泥滩上的旧时采牡蛎活动。"}]},{"partOfSpeech":"n.","definition":{"en":"Oyster beds or grounds where oysters are found and gathered (less common; sometimes used in older writing).","zh":"牡蛎生长与采集的水域/牡蛎滩（较少见；有时见于较旧的文字）。"},"examples":[{"en":"Fishing boats avoided the oysterings to protect the beds.","zh":"渔船避开牡蛎滩，以保护牡蛎床。"},{"en":"The map marked the oysterings near the river mouth.","zh":"地图标出了河口附近的牡蛎采集区。"}]}],"synonyms":["oystering","oyster harvesting","oyster picking","oyster beds","oyster grounds"],"phonetic":"ˈɔɪstərɪŋz","extraExplanation":["“oysterings”多见于较旧或带地域色彩的英语（沿海社区、历史叙述）。现代更常说：oystering（采牡蛎的活动）、oyster harvesting（牡蛎采收）、oyster beds/grounds/reefs（牡蛎床/采集区）。"]}
{"word":"oysterish","summary":{"en":"Oysterish means “somewhat like an oyster,” literally (taste/texture) or figuratively (quiet/closed-off).","zh":"oysterish 指“有点像牡蛎的”，可指味道口感等字面相似，也可比喻人沉默封闭。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an oyster in appearance, texture, taste, or smell (often used creatively rather than as a standard dictionary word).","zh":"像牡蛎的；带有牡蛎的外观、口感、味道或气味（多为创意用法，不算常见标准词）。"},"examples":[{"en":"The sauce had an oysterish brininess that made the noodles taste like the sea.","zh":"这酱汁带着一种像牡蛎般的咸鲜海味，让面条尝起来像大海。"},{"en":"The broth turned slightly oysterish after we added the seafood stock.","zh":"我们加入海鲜高汤后，汤的味道变得有点“牡蛎味”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suggesting an oyster in behavior—quiet, closed-off, or hard to read (a figurative, informal use).","zh":"（比喻、非正式）像牡蛎一样沉默、封闭、让人难以看透。"},"examples":[{"en":"He got oysterish around strangers, answering in one-word replies.","zh":"他在陌生人面前就变得很“牡蛎式”，总是用一个词敷衍回答。"},{"en":"She stayed oysterish during the meeting, revealing almost nothing.","zh":"她在会议上一直很“牡蛎式”，几乎不透露任何信息。"}]}],"synonyms":["oyster-like","briny","seafood-y","shellfish-like","taciturn"],"phonetic":"/ˈɔɪstərɪʃ/","extraExplanation":["“-ish”是英语里很常见的后缀，表示“有点像……/带点……的感觉”（如 greenish 微绿的、childish 孩子气的）。所以 oysterish 通常就是“像牡蛎的感觉”。","oysterish 并不是高频词，更常见的表达是 “oyster-like” 或 “briny (咸鲜的海味)”；在写作或美食评论里，oysterish 这种说法显得更口语、更有画面感。"]}
{"word":"oysterishness","summary":{"en":"Oysterishness means “the quality of being oyster-like,” usually about taste/texture, and more rarely a figurative “closed-off” personality.","zh":"Oysterishness 指“像牡蛎的特质”，多用于形容味道/口感；更少见时也可比喻“像牡蛎壳一样不容易打开”的拘谨沉默性格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being oyster-like (for example, briny, slightly metallic, or slippery in taste/texture), or resembling an oyster in look or smell","zh":"“像牡蛎的特质”（例如咸鲜海味、略带金属感、口感滑润），或在外观/气味上像牡蛎"},"examples":[{"en":"The chef liked the oysterishness of the sauce and added a little lemon to brighten it.","zh":"主厨喜欢这酱汁带点“牡蛎感”，于是加了点柠檬提亮味道。"},{"en":"The wine’s oysterishness made it a good match for seafood.","zh":"这款酒的“牡蛎风味/海味感”很适合配海鲜。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, rare) a tendency to be closed-off, quiet, or hard to “open,” like an oyster shell","zh":"（比喻，少见）像牡蛎壳一样“紧闭”的性格：沉默、难以亲近或不容易敞开心扉"},"examples":[{"en":"His oysterishness faded once he felt welcome.","zh":"一旦感到被欢迎，他那种“像牡蛎一样不爱开口”的劲儿就淡了。"},{"en":"Don’t mistake her oysterishness for rudeness—she’s just shy.","zh":"别把她的“牡蛎式沉默”当成无礼——她只是害羞。"}]}],"synonyms":["oyster-like quality","brininess","seafoodiness","marine savor","reserve","reticence"],"phonetic":"/ˈɔɪstərɪʃnəs/","extraExplanation":["这个词非常少见，更像是临时造词（nonce word）。结构是 oyster（牡蛎）+ -ish（“有点像……”）+ -ness（“……的性质/状态”），意思通常取决于语境。","写作里用它能带一点幽默或文学感，但在正式场合更常用 briny taste（海水般咸鲜的味道）、oyster-like flavor/texture（像牡蛎的风味/口感）、reserved/closed-off（拘谨/不爱说话）等更常见表达。"]}
{"word":"oysterlike","summary":{"en":"Oysterlike means “similar to an oyster,” literally (shell/texture) or figuratively (quiet, closed-off).","zh":"oysterlike 表示“像牡蛎的”，既可指外观/质地，也可比喻“沉默、封闭、难以接近”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an oyster in appearance, texture, or behavior (for example, having a hard shell, being tightly closed, or seeming quiet and guarded).","zh":"像牡蛎的；具有牡蛎特征的（如外壳坚硬、紧闭、或显得沉默而有戒心）。"},"examples":[{"en":"The rock had an oysterlike shell that was rough and layered.","zh":"那块岩石有一种像牡蛎一样的外壳，粗糙而呈层状。"},{"en":"He kept an oysterlike silence during the meeting.","zh":"开会时他保持着一种“牡蛎般”的沉默。"}]}],"synonyms":["shell-like","clamlike","guarded","close-mouthed"],"phonetic":"/ˈɔɪstərˌlaɪk/","extraExplanation":["“oysterlike”由“oyster（牡蛎）+ -like（像……一样的）”构成，常见于描写外观/质地（生物、岩石、贝壳等），也可用于比喻人的性格：外表冷淡、话少、难以打开话匣子。拼写上也常见作“oyster-like”。"]}
{"word":"oysterling","summary":{"en":"An oysterling is a young, very small oyster; the word is occasionally used playfully for something tiny that looks like an oyster.","zh":"oysterling 指幼小的牡蛎（牡蛎苗/幼体）；也偶尔用来戏称像小牡蛎一样的微小事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young oyster (especially a small, newly settled oyster); an oyster “spat.”","zh":"幼牡蛎；（尤指刚附着、生长很小的）牡蛎苗／牡蛎幼体（亦称 spat）。"},"examples":[{"en":"The bay was full of oysterlings growing on the rocks.","zh":"海湾里的岩石上长满了幼牡蛎。"},{"en":"Farmers protect oysterlings until they are large enough to move to open-water cages.","zh":"养殖户会先保护牡蛎苗，等它们长到足够大再移到外海的网箱里。"}]},{"partOfSpeech":"n.","definition":{"en":"something very small that resembles an oyster (rare; often playful).","zh":"像小牡蛎一样的东西（较少见；常带玩笑或拟态意味）。"},"examples":[{"en":"Tiny shells clung to the pier like oysterlings.","zh":"小小的贝壳像幼牡蛎一样附在码头桩上。"}]}],"synonyms":["spat","juvenile oyster","young oyster"],"phonetic":"/ˈɔɪstərlɪŋ/","extraExplanation":["“oysterling”由 oyster（牡蛎）+ 后缀 -ling 构成；-ling 常表示“幼小的/小的”（如 duckling 小鸭）。因此它直观地表示“幼牡蛎”。","在英语里它不算非常常用；在海洋生物、渔业或养殖语境中，你更常看到 spat（牡蛎幼体/苗）或 juvenile oyster（幼牡蛎）。"]}
{"word":"oysterman","summary":{"en":"An oysterman is someone who harvests or sells oysters as a job.","zh":"oysterman 指以采收或售卖牡蛎为职业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to collect, harvest, or sell oysters; an oyster fisherman or oyster seller.","zh":"采蚝者／牡蛎渔民；（也可指）卖牡蛎的人。"},"examples":[{"en":"The oysterman worked at dawn, gathering oysters from the shallow beds.","zh":"这位采蚝者天一亮就开始工作，从浅滩的蚝床上采集牡蛎。"},{"en":"Local restaurants buy fresh shellfish directly from an oysterman.","zh":"当地餐馆会直接从采蚝人那里购买新鲜贝类。"}]}],"synonyms":["oyster fisherman","oyster harvester","shellfish harvester"],"phonetic":"/ˈɔɪstɚmən/","extraExplanation":["在英语里，-man 常见于职业名词（如 fisherman, milkman）。现代英语也越来越常用更中性的说法：oyster harvester（牡蛎采收者）、oyster fisher（牡蛎渔民）、shellfish harvester（贝类采收者）。","在美国沿海地区（如切萨皮克湾、路易斯安那等），“oysterman”常与传统手工采蚝、渔业监管、以及海湾生态保护联系在一起。"]}
{"word":"oystermen","summary":{"en":"Oystermen are people who harvest or farm oysters for a living.","zh":"oystermen 指以采收或养殖牡蛎为生的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to catch, farm, or harvest oysters (often for food).","zh":"以捕捞、养殖或采收牡蛎为职业的人（通常供食用）。"},"examples":[{"en":"Local oystermen start work before sunrise when the tide is right.","zh":"当地的牡蛎渔民会在潮水合适时天没亮就开工。"},{"en":"The restaurant buys oysters directly from oystermen along the coast.","zh":"这家餐厅直接向沿海的牡蛎渔民采购牡蛎。"}]}],"synonyms":["oyster harvesters","oyster fishers","oyster farmers"],"phonetic":"/ˈɔɪstərmən/","extraExplanation":["“oystermen”是复数形式；单数是“oysterman”（也可见更中性的说法“oyster farmer / oyster harvester / oyster fisher”。）","在美国沿海文化里，“oystermen”常让人联想到切萨皮克湾（Chesapeake Bay）、路易斯安那、太平洋西北等地的传统渔业与社区生活。","相关词：oyster bed（牡蛎床/牡蛎养殖区）、shucking（撬/剥牡蛎）、aquaculture（水产养殖）。"]}
{"word":"oysterous","summary":{"en":"“Oysterous” is a very rare adjective meaning “related to oysters” or “oyster-like.”","zh":"“oysterous”是非常少见的形容词，意思是“与牡蛎有关的”或“像牡蛎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) relating to oysters; oyster-like in taste, smell, or appearance.","zh":"（非常少见）与牡蛎有关的；像牡蛎的（味道、气味或外观）。"},"examples":[{"en":"The broth had an oysterous smell, like the sea at low tide.","zh":"这汤有种牡蛎般的气味，像退潮时的海边。"},{"en":"Some writers describe certain mushrooms as having an oysterous flavor.","zh":"有些作者形容某些蘑菇带有“牡蛎般”的风味。"}]}],"synonyms":["oyster-like","oystery","of oysters"],"phonetic":"/ˈɔɪstərəs/","extraExplanation":["“oysterous”不是现代英语里常用的词，很多情况下更自然的说法是“oyster-like”（像牡蛎的）或“oystery”（有牡蛎味/像牡蛎的，口语里偶尔用）。","也有人把“oysterous”误写成常见词“boisterous”（喧闹的、热闹的）。如果你想表达“吵闹/热闹”，更可能要用“boisterous”。"]}
{"word":"oysterroot","summary":{"en":"Oysterroot is a root vegetable (salsify) sometimes described as having an oyster-like flavor when cooked.","zh":"Oysterroot 指一种根茎蔬菜（多为 salsify），煮熟后有时被形容带有类似牡蛎的风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a root vegetable (salsify) whose cooked taste is sometimes compared to oysters; also used as the name of the plant that produces it","zh":"一种根茎蔬菜（常指“西洋婆罗门参”/salsify）；煮熟后有时被形容带有“像牡蛎”的风味，也可指这种植物本身"},"examples":[{"en":"Oysterroot is often peeled, sliced, and added to soups or stews.","zh":"Oysterroot 常被削皮切片，加入汤或炖菜中。"},{"en":"She said oysterroot tasted a little like oysters, especially in cream sauce.","zh":"她说 oysterroot 的味道有点像牡蛎，尤其配奶油酱时更明显。"}]}],"synonyms":["salsify","oyster plant","vegetable oyster"],"phonetic":"/ˈɔɪstɚˌruːt/","extraExplanation":["“oysterroot”在日常英语里并不算特别常见，更常见的叫法是 **salsify** 或 **oyster plant**。之所以得名，是因为传统上有人觉得它煮熟后有淡淡的海鲜（牡蛎）风味，但这是一种主观描述。","烹饪上常见做法：去皮（外皮较粗糙）、切片后泡水防止变色，再煮、烤或做成泥；在西式浓汤、奶油炖菜里较常见。"]}
{"word":"oysters","summary":{"en":"Oysters are saltwater shellfish, often eaten as seafood; the word can also be used metaphorically to mean something full of hidden opportunities.","zh":"Oysters 指牡蛎/生蚝等海水贝类，也可作比喻表示“蕴藏机会或宝藏的事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A saltwater shellfish with a rough shell, often eaten raw or cooked.","zh":"牡蛎；一种海水贝类，外壳粗糙，常生吃或熟食。"},"examples":[{"en":"They ordered a dozen oysters with lemon at the restaurant.","zh":"他们在餐厅点了一打牡蛎，配柠檬。"},{"en":"Some people prefer oysters grilled with garlic butter.","zh":"有些人更喜欢蒜香黄油烤牡蛎。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing believed to hide something valuable inside (used in the saying “The world is your oyster”).","zh":"（比喻）蕴藏机会或宝藏的人/事物（常见于谚语“世界是你的牡蛎”）。"},"examples":[{"en":"With her new skills, the world felt like her oyster.","zh":"有了新技能，她觉得世界充满机会。"}]}],"synonyms":["shellfish","bivalve"],"phonetic":"/ˈɔɪstɚ/","extraExplanation":["“oyster”在英语文化里常和“珍珠”联想在一起，因为珍珠可能在牡蛎体内形成，所以它也引申出“里面藏着好东西/机会”的比喻意义。","饮食文化上，生蚝（raw oysters）在一些地区被视为海鲜冷盘；但对初学者来说，点餐时常见搭配词有：lemon（柠檬）、vinegar（醋）、hot sauce（辣酱）、grilled（烤的）。"]}
{"word":"oysterseed","summary":{"en":"Oyster seed means juvenile oysters used to stock oyster beds or farms.","zh":"oyster seed 指用于投放养殖的牡蛎苗（幼牡蛎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Young oysters (spat) used to start or stock an oyster bed or farm; juvenile oysters for aquaculture.","zh":"（养殖用的）牡蛎苗；用于投放到牡蛎床/牡蛎养殖场的幼牡蛎（又称牡蛎“苗”“蚝苗”）。"},"examples":[{"en":"The farm buys oyster seed every spring to restock the beds.","zh":"这家养殖场每年春天都会购买牡蛎苗来补充牡蛎床。"},{"en":"Clean water and good oyster seed are both essential for a successful harvest.","zh":"干净的水质和优质的牡蛎苗对丰收都很关键。"},{"en":"They moved the oyster seed to deeper water to protect it from heat.","zh":"他们把牡蛎苗转移到更深的水域，以避免高温影响。"}]}],"synonyms":["spat","juvenile oysters","oyster spat"],"phonetic":"ˈɔɪstɚ siːd","extraExplanation":["在英语里更常见的写法是 **oyster seed**（分开写），也常用更专业的词 **spat** 指“刚附着不久的幼牡蛎”。在贝类养殖语境中，seed 并不是“种子”，而是“用来繁殖/投放的幼体”。"]}
{"word":"oystershell","summary":{"en":"An oystershell is an oyster’s hard shell; it can also mean crushed shell used as a material (for paths, soil, or calcium).","zh":"oystershell 指牡蛎的硬壳；也可指碎牡蛎壳这种材料（用于铺路、改良土壤或补钙）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hard outer covering of an oyster.","zh":"牡蛎的坚硬外壳；牡蛎壳。"},"examples":[{"en":"She found a smooth oystershell on the beach.","zh":"她在海滩上捡到一枚光滑的牡蛎壳。"},{"en":"Be careful—an oystershell can be very sharp.","zh":"小心——牡蛎壳可能非常锋利。"}]},{"partOfSpeech":"n.","definition":{"en":"A material made from crushed oyster shells, used for soil, paths, or as a source of calcium.","zh":"（常用复数或作材料名）碎牡蛎壳制成的材料，用于改良土壤、铺路，或作为钙源。"},"examples":[{"en":"The garden path was covered with crushed oystershell.","zh":"花园小路上铺着碎牡蛎壳。"},{"en":"Some farmers add ground oystershell to provide calcium.","zh":"一些农场会添加磨碎的牡蛎壳来补充钙。"}]}],"synonyms":["oyster shell","shell","seashell (broader)"],"phonetic":"/ˈɔɪstərˌʃɛl/","extraExplanation":["在英语里更常见的写法是 two words：oyster shell / oyster shells；合写 oystershell 也能见到，但多见于商品名、材料名或较老/较少见的用法。","牡蛎壳在一些沿海地区常被用作建筑材料或装饰（例如把碎壳混入灰浆做成“tabby”一类的墙体材料），也常出现在海岸文化相关的写作中，用来营造“海边、渔港、咸味海风”的意象。"]}
{"word":"oysterwife","summary":{"en":"An old-fashioned word for a woman who sells oysters, often as a street vendor.","zh":"旧式用语：指卖牡蛎的女人，常指街头叫卖的小贩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who sells oysters, especially as a street vendor (an older, historical use)","zh":"卖牡蛎的女人；（尤指旧时的）街头卖牡蛎女贩"},"examples":[{"en":"In old London, an oysterwife might call out her oysters in the street.","zh":"在旧时的伦敦，卖牡蛎的妇女可能会在街上吆喝叫卖。"},{"en":"The novel mentions an oysterwife near the market, carrying a basket of shellfish.","zh":"小说提到集市附近有个卖牡蛎的妇女，提着一篮贝类。"}]}],"synonyms":["oysterwoman","oyster seller","oyster vendor"],"phonetic":"/ˈɔɪstɚˌwaɪf/","extraExplanation":["“oysterwife”是较旧的词，也常写作“oyster-wife”或更常见的“oysterwoman”。它让人联想到18—19世纪英国城市街头叫卖海鲜的小贩形象（有时还会出现在当时的插画与民俗描写中）。在现代英语里，这个职业称呼更可能用“oyster seller / oyster vendor”。"]}
{"word":"oysterwoman","summary":{"en":"An oysterwoman is a woman who works with oysters—collecting, farming, or selling them.","zh":"oysterwoman 指以采集、养殖或售卖牡蛎为业的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who gathers, farms, or sells oysters, especially as a job in a coastal community","zh":"（尤指沿海社区中）以采集、养殖或售卖牡蛎为业的女性；采蚝女/卖蚝女"},"examples":[{"en":"The oysterwoman went out at low tide to collect oysters from the beds.","zh":"那位采蚝女在退潮时出海，到蚝床上采集牡蛎。"},{"en":"At the market, an oysterwoman shucked oysters and talked with customers.","zh":"在市场上，一位卖蚝女一边开牡蛎一边和顾客聊天。"}]}],"synonyms":["oyster seller","shellfish harvester","oysterman (gender-neutral in some contexts, but often refers to a man)"],"phonetic":"/ˈɔɪstərˌwʊmən/","extraExplanation":["这是一个相对少见、较具地方色彩的职业称呼，常见于描写沿海渔业与传统市集生活的语境。也可写作“oyster woman”（分开写），含义相同。","在文学或纪实写作里，这个词常用来营造海岸社区的生活氛围，强调劳动、潮汐与渔业经济之间的联系。"]}
{"word":"oysterwomen","summary":{"en":"An oysterwoman is a woman who gathers or sells oysters, especially in traditional coastal work.","zh":"oysterwoman 指采挖或售卖牡蛎的女性，常带有沿海传统职业的语境色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who harvests (digs, gathers) oysters or works selling/handling oysters, often as a traditional coastal occupation","zh":"采挖牡蛎的女性；从事牡蛎捕捞、分拣或售卖工作的女性（常见于沿海传统行业）"},"examples":[{"en":"The oysterwomen went out at low tide to gather oysters from the mudflats.","zh":"退潮时，采蚝女们会到滩涂上采集牡蛎。"},{"en":"In the old port, oysterwomen sold fresh oysters by the basket.","zh":"在老港口，采蚝女们一篮一篮地卖新鲜牡蛎。"},{"en":"She comes from a family of oysterwomen and fishermen.","zh":"她出身于一个采蚝女和渔民世家。"}]}],"synonyms":["oyster harvester","oyster worker","shellfish harvester","oyster farmer"],"phonetic":"/ˈɔɪstərˌwʊmən/","extraExplanation":["“oysterwoman”由“oyster（牡蛎）+ woman（女性）”构成，语体上偏历史/地域色彩，在描写沿海社区生计、民俗或旧时劳作时更常见。","有时也会看到复数写作“oysterwomen”，表示“采蚝女们”。在现代英语里，更常用更中性的表达如“oyster harvesters / oyster farmers / oyster workers”。"]}
