{"word":"oz","summary":{"en":"“Oz” usually means “ounce” (oz) in measurements; it can also refer informally to Australia, or to the land of Oz in The Wizard of Oz.","zh":"“Oz”最常见是计量单位“盎司（ounce）”的缩写；也可口语指澳大利亚，或指《绿野仙踪》中的奥兹国。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “ounce,” a unit of weight (and sometimes fluid volume).","zh":"“ounce（盎司）”的缩写，用于表示重量单位（有时也指液体容量单位）。"},"examples":[{"en":"Add 2 oz of cheese to the salad.","zh":"在沙拉里加 2 盎司的奶酪。"},{"en":"This bottle contains 12 oz of water.","zh":"这瓶水是 12 盎司。"}]},{"partOfSpeech":"other","definition":{"en":"informal short form for Australia or Australian (often written “Aussie” in everyday speech).","zh":"非正式地指“澳大利亚”或“澳大利亚的/澳大利亚人”的简称（口语中更常写作“Aussie”）。"},"examples":[{"en":"He moved to Oz for work.","zh":"他为了工作搬去了澳大利亚。"},{"en":"Oz slang can be different from American English.","zh":"澳洲俚语可能和美式英语不一样。"}]},{"partOfSpeech":"other","definition":{"en":"the fantasy land in the story “The Wizard of Oz.”","zh":"童话/奇幻故事《绿野仙踪（The Wizard of Oz）》中的“奥兹国”。"},"examples":[{"en":"Dorothy dreams of going back to Oz.","zh":"多萝西梦想到回到奥兹国。"},{"en":"The Wizard of Oz is a classic film.","zh":"《绿野仙踪》是一部经典电影。"}]}],"synonyms":["ounce (abbr.)","fl oz (fluid ounce)","Australia (informal: Oz)"],"phonetic":"/ɑz/","extraExplanation":["在食谱、营养标签、饮料容量里常见“oz”。表示重量时是“avoirdupois ounce（常衡盎司）”，约等于 28.35 克；表示液体容量时常写作“fl oz（fluid ounce，液体盎司）”，美制 1 fl oz 约等于 29.57 毫升。","“Oz”指澳大利亚时带有轻松口语色彩；正式写作更常用“Australia / Australian”。"]}
{"word":"oza","summary":{"en":"“Oza” is usually a proper name (surname/place) or an abbreviation; it isn’t a common English word.","zh":"“Oza”通常是专有名词（姓氏/地名）或缩写；不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name used as a surname or place name in several countries; not a common English vocabulary word.","zh":"一个专有名词（人名/姓氏或地名），在多个国家和地区都可能出现；不是常见的英语词汇。"},"examples":[{"en":"Oza is her family name.","zh":"Oza 是她的姓。"},{"en":"They visited the Oza district during their trip.","zh":"他们旅行时去了 Oza 地区。"}]},{"partOfSpeech":"other","definition":{"en":"In some contexts, “OZA” is used as an abbreviation (its meaning depends on the field, organization, or country).","zh":"在某些语境中，“OZA”可作为缩写使用（具体含义取决于行业、组织或国家/地区）。"},"examples":[{"en":"The email signature included OZA, but the meaning wasn’t explained.","zh":"邮件签名里有 OZA，但没有解释它的意思。"}]}],"phonetic":"/ˈoʊzə/","extraExplanation":["“oza”在英语里通常不作为普通单词使用，所以要判断它的意思，需要你提供上下文（例如：出现在哪句话里、是不是人名/地名、是否全大写 OZA）。","如果你本来想查的是“oz”（ounce 的缩写，表示“盎司”），或西班牙语相关的词（如 onza），也可以告诉我，我可以一起对比解释。"]}
{"word":"ozalid","summary":{"en":"“Ozalid” refers to a diazo-copy print/process used to duplicate technical drawings.","zh":"“Ozalid”指用于复制工程/建筑图纸的重氮法复制品或复制工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of diazo copying process (and the resulting print) once widely used to duplicate architectural or engineering drawings; also used as a trademark name for such prints.","zh":"一种重氮（diazo）复制工艺（及其成品图纸），过去常用于复制建筑/工程图；也常作该类图纸的商标名。"},"examples":[{"en":"The architect asked for a clean ozalid copy of the floor plan.","zh":"建筑师要一份干净的 Ozalid（重氮法）平面图复印件。"},{"en":"Old project files sometimes include ozalids that have yellowed with age.","zh":"老项目档案里有时会有随着时间发黄的 Ozalid 图纸。"}]}],"synonyms":["diazo print","whiteprint","blueprint copy"],"phonetic":"/ˈoʊzəˌlɪd/","extraExplanation":["“Ozalid”最初常见于建筑、工程制图领域，指一种用重氮显影来复制大幅图纸的“白图/蓝图”类印刷（不同配方会呈现蓝、紫或棕色线条）。","在现代办公环境中，它多被大幅面扫描/打印取代；你可能在老式图纸档案或施工文件里见到这个词。","它常被当作通用名词使用，但在历史上也与具体品牌/商标有关，因此有时会首字母大写。"]}
{"word":"ozan","summary":{"en":"An ozan is a Turkish folk bard: a poet-singer who performs traditional songs and stories, often with a saz/bağlama.","zh":"ozan 指土耳其传统民间吟游诗人：会写诗作曲并自弹自唱、讲故事，常用 saz/bağlama 伴奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Turkish culture) a traditional folk poet-singer or bard who composes and performs songs, often with a long‑necked lute (saz/bağlama).","zh":"（土耳其文化中）传统民间诗人兼歌者、吟游诗人，常自作自唱，通常伴奏长颈鲁特琴（saz/bağlama）。"},"examples":[{"en":"The documentary follows an ozan who sings epics about love and war.","zh":"这部纪录片跟拍了一位吟游诗人，他唱着关于爱情与战争的史诗。"},{"en":"In the village café, an ozan performed with a bağlama and told stories between songs.","zh":"在村里的咖啡馆里，一位民间歌诗人用 bağlama 伴奏演出，并在歌曲之间讲故事。"}]}],"synonyms":["bard","folk poet","minstrel (context-dependent)"],"phonetic":"/oʊˈzɑn/","extraExplanation":["“Ozan”是土耳其语词，常被英语借用来指一种类似“bard/folk poet”的人物。与英语里的“bard”很接近，但语境更偏土耳其/安纳托利亚民间传统。","在现代语境中，“ozan”有时也可用来称赞某位歌手或词作者“像传统民间诗人一样会讲故事、会写诗”。"]}
{"word":"ozawkie","summary":{"en":"“ozawkie” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“ozawkie”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a proper name.","zh":"不是标准英语单词；可能是拼写错误、用户名、品牌名或专有名词。"},"examples":[{"en":"I searched for “ozawkie,” but I couldn’t find it in an English dictionary.","zh":"我查了“ozawkie”，但在英语词典里找不到。"},{"en":"If “ozawkie” is a name, please tell me where you saw it so I can help explain it.","zh":"如果“ozawkie”是名字，请告诉我你在哪看到的，我才能更好地解释。"}]}],"phonetic":"/oʊˈzɑːki/","extraExplanation":["“ozawkie”看起来更像拼写变体或专有名词，而不是常见英语词汇。你可能想输入：\n1) “Ozark” / “Ozarky”（与美国奥扎克地区有关）\n2) “Okeechobee”（地名的一部分拼写）\n3) 某个姓氏/网名/游戏ID\n把你看到它的句子或来源（书、歌曲、游戏、地名等）发我，我可以根据语境判断最可能的意思与读法。"]}
{"word":"ozen","summary":{"en":"Ozone is a gas (O₃): helpful in the upper atmosphere but harmful as pollution near the ground; it can also mean disinfecting with ozone.","zh":"臭氧是一种气体（O₃）：高空中有保护作用，但在近地面可能是污染物；也可作动词，指用臭氧消毒/除味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gas in the atmosphere made of three oxygen atoms (O₃); it forms a protective layer high above Earth but can be a harmful pollutant near the ground","zh":"臭氧（O₃），由三个氧原子组成的气体；在高空能形成保护地球的臭氧层，但在近地面时可能成为有害污染物"},"examples":[{"en":"The ozone layer helps block harmful ultraviolet (UV) rays from the sun.","zh":"臭氧层有助于阻挡太阳的有害紫外线（UV）。"},{"en":"On hot summer days, ground-level ozone can make breathing harder.","zh":"在炎热的夏天，近地面臭氧会让呼吸更困难。"},{"en":"Scientists track ozone levels to understand air quality and climate effects.","zh":"科学家监测臭氧水平，以了解空气质量和气候影响。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat something (often water or air) with ozone in order to disinfect or remove odors","zh":"用臭氧处理（常指水或空气）以消毒或去除异味"},"examples":[{"en":"The hotel ozoned the room to remove the smoke smell.","zh":"酒店用臭氧处理房间来去除烟味。"},{"en":"Some systems ozone drinking water to kill bacteria.","zh":"一些系统用臭氧处理饮用水来杀灭细菌。"}]}],"synonyms":["(n.) O₃","(n.) smog component","(v.) disinfect","(v.) deodorize"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["你输入的“ozen”在英文里不常见；很多学习者其实想查的是“ozone（臭氧）”。如果你确实想查人名/姓氏 Ozen 或土耳其语的“özen”（意为“用心、细致”），告诉我你的语境，我可以按正确词条解释。"]}
{"word":"ozenfant","summary":{"en":"Ozenfant is best known as the name of Amédée Ozenfant, a French artist and co-founder of Purism.","zh":"Ozenfant通常指法国艺术家阿梅代·奥赞方，他与勒·柯布西耶共同创立纯粹主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Amédée Ozenfant (1886–1966), a French painter, writer, and teacher who co-founded the modern art movement called Purism with Le Corbusier.","zh":"阿梅代·奥赞方（Amédée Ozenfant，1886–1966），法国画家、作家与艺术教育者，与勒·柯布西耶共同创立现代艺术流派“纯粹主义（Purism）”。"},"examples":[{"en":"Ozenfant and Le Corbusier argued that modern painting should emphasize clear forms and order.","zh":"奥赞方与勒·柯布西耶主张现代绘画应强调清晰的形体与秩序感。"},{"en":"In art history class, we studied Ozenfant’s role in the Purist movement.","zh":"在艺术史课上，我们学习了奥赞方在纯粹主义运动中的作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A French surname; used to refer to someone from the Ozenfant family.","zh":"法国姓氏；用于指代奥赞方家族的人。"},"examples":[{"en":"The article mentioned an interview with Ozenfant’s students.","zh":"文章提到对奥赞方学生的采访。"}]}],"synonyms":["Amédée Ozenfant","Purism","Le Corbusier"],"phonetic":"/oʊzɑ̃ˈfɑ̃/","extraExplanation":["“Ozenfant”多见于艺术史语境，常与“Purism（纯粹主义）”并提：它强调理性、简洁、结构清楚的造型，某种程度上是对当时部分立体主义（Cubism）过度碎片化的一种“整理与澄清”。","奥赞方与勒·柯布西耶合著《Après le cubisme》（《立体主义之后》），用以阐述纯粹主义理念；因此在阅读相关英文材料时，你会经常看到两人并列出现。"]}
{"word":"ozias","summary":{"en":"Ozias is an older/less common form of the biblical name Uzziah (king of Judah).","zh":"Ozias 是圣经人名 Uzziah（犹大王乌西雅）的较旧或较少见写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ozias: a less common (Latin/Greek) form of the biblical name Uzziah, a king of Judah mentioned in the Hebrew Bible/Old Testament.","zh":"Ozias：圣经人名 Uzziah（乌西雅）的较少见写法（源自拉丁/希腊译名），指《希伯来圣经/旧约》中提到的犹大王。"},"examples":[{"en":"In some older Bible translations, Uzziah is called Ozias.","zh":"在一些较早的《圣经》译本里，Uzziah 会写作 Ozias。"},{"en":"The story of Ozias/Uzziah is used to discuss pride and humility in religious lessons.","zh":"在宗教课程中，Ozias/Uzziah 的故事常被用来讨论骄傲与谦卑。"}]}],"synonyms":["Uzziah"],"phonetic":"/oʊˈzaɪ.əs/","extraExplanation":["“Ozias”多见于早期或特定传统的《圣经》译名（如拉丁语传统），现代英语更常用“Uzziah”。在文学或宗教写作中遇到“Ozias”，通常可理解为同一人物的不同拼写。"]}
{"word":"ozkum","summary":{"en":"“ozkum” is not a recognized English word; it’s likely a name, typo, or non-English term.","zh":"“ozkum”不是公认的英语单词；更可能是名字、拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a proper noun from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名，或来自其他语言的专有名词。"},"examples":[{"en":"I couldn’t find “ozkum” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“ozkum”——你能提供你看到它的句子吗？"},{"en":"Maybe you meant “Ockham” (as in “Occam’s razor”) or another similar-looking word.","zh":"你可能想写的是“Ockham”（如“Occam’s razor / 奥卡姆剃刀”）或其他长得像的词。"}]}],"phonetic":"/ˈɑz.kʌm/","extraExplanation":["“ozkum”看起来不像常见英语词形：不符合常见词根/词缀组合，也不像常见缩写。为了准确帮你查词，请你：1）提供出现它的上下文句子或截图；2）确认大小写（例如 Ozkum / OZKUM）；3）说明它来自哪里（游戏、社媒、品牌、土耳其语/其他语言等）。我也可以根据你想表达的意思，帮你找最可能的正确拼写。"]}
{"word":"ozmo","summary":{"en":"Ozmo is mainly a brand/product name rather than a common English word.","zh":"Ozmo 主要是品牌/产品名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand or product name (proper noun), not a standard dictionary word in general English; commonly seen in names like ECOVACS “OZMO” robot vacuums/mopping systems or related products.","zh":"（专有名词）品牌或产品名称，一般不算常规英语词汇；常见于科沃斯（ECOVACS）“OZMO”等扫地/拖地机器人或相关产品名称中。"},"examples":[{"en":"I bought an ECOVACS OZMO robot to vacuum and mop the floor.","zh":"我买了一台科沃斯（ECOVACS）OZMO 扫拖机器人来吸尘和拖地。"},{"en":"The manual says the OZMO system controls the water flow while mopping.","zh":"说明书说 OZMO 系统在拖地时会控制出水量。"}]}],"phonetic":"/ˈɑzmoʊ/","extraExplanation":["“OZMO”多用于商品命名，含义通常由品牌方定义，不像普通词那样有稳定、通用的词义。","发音在日常交流中通常按英语读作“oz-mo”，重音多在第一个音节。"]}
{"word":"ozobrome","summary":{"en":"Ozobrome is a historical pigment-based photographic printing process, and it can also mean a print made by that process.","zh":"Ozobrome 指一种历史上的颜料型摄影印相工艺，也可指用该工艺制作的印相成品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical photographic printing process (a type of pigment printing) that transfers a carbon image onto paper using a bromide print as the starting image","zh":"（历史上的）一种摄影印相工艺（颜料/碳转印印相法的一种），以溴化银相纸照片为底，通过转印把碳印影像移到纸上"},"examples":[{"en":"The museum displayed early 20th‑century Ozobrome prints alongside other carbon processes.","zh":"博物馆展出了20世纪初的 Ozobrome 印相作品，并与其他碳印工艺并列展示。"},{"en":"She read about the Ozobrome process in a book on alternative photographic techniques.","zh":"她在一本关于替代摄影工艺的书里读到了 Ozobrome 工艺。"}]},{"partOfSpeech":"n.","definition":{"en":"a photographic print made using the Ozobrome process","zh":"用 Ozobrome 工艺制作的照片印相（成品）"},"examples":[{"en":"This Ozobrome has a rich, matte surface and deep shadows.","zh":"这张 Ozobrome 印相表面呈哑光质感，暗部层次很深。"}]}],"synonyms":["Ozobrome process","carbon transfer process","pigment printing (general)","ozotype (related)"],"phonetic":"/ˈoʊzoʊˌbroʊm/","extraExplanation":["Ozobrome 与“carbon print（碳印/碳转印）”家族有关，特点是使用颜料形成影像，因此成像稳定、耐久，常被用于艺术印相与收藏。","它在20世纪初较为流行；随着更便捷的现代印相技术普及，Ozobrome 主要作为历史摄影工艺在研究、展览与替代工艺爱好者圈子中出现。"]}
{"word":"ozocerite","summary":{"en":"Ozocerite is a natural mineral wax used historically in wax products like candles and polishes.","zh":"Ozocerite（地蜡）是一种天然矿物蜡，历史上用于蜡烛、上光剂等蜡制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural mineral wax (a kind of solid hydrocarbon) found in some rocks and soils, used to make products like candles, polishes, and some wax blends.","zh":"地蜡；一种天然矿物蜡（固态烃类混合物），产于某些岩层或土壤中，可用于制作蜡烛、上光剂及混合蜡等产品。"},"examples":[{"en":"In the 1800s, ozocerite was mined in parts of Eastern Europe and used as a source of wax.","zh":"在19世纪，东欧一些地区开采地蜡（ozocerite），并把它作为蜡的来源。"},{"en":"Some early industrial polishes used ozocerite because it could be blended into a hard, shiny wax.","zh":"一些早期的工业上光剂使用地蜡，因为它可以调配成坚硬、光亮的蜡。"}]}],"synonyms":["ozokerite","mineral wax","earth wax"],"phonetic":"/oʊˈzɑsəraɪt/","extraExplanation":["“ozocerite”也常写作“ozokerite”。词源来自希腊语：ozo-（有气味的）+ keros（蜡），字面意思接近“有味道的蜡”。","它在工业史上与“石蜡（paraffin wax）”有联系：地蜡曾是早期蜡制品的重要原料之一，但后来更便宜、更易获得的石蜡在许多用途上取代了它。"]}
{"word":"ozona","summary":{"en":"“Ozona” is usually a U.S. place name, most often Ozona, Texas.","zh":"“Ozona”通常是美国的地名，最常指德克萨斯州的 Ozona。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), most commonly referring to Ozona, a small community in Texas, USA.","zh":"地名（专有名词），最常指美国德克萨斯州的 Ozone（Ozona），一个小社区。"},"examples":[{"en":"We stopped in Ozona, Texas to get gas and snacks on our road trip.","zh":"我们自驾途中在德克萨斯州的 Ozona 停下来加油、买零食。"},{"en":"Ozona is known as a quiet stopping point along Interstate 10.","zh":"Ozona 以州际公路 I-10 沿线的安静补给站而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"a less common place name that may refer to other locations called Ozona (for example, a neighborhood/place in Florida).","zh":"较少见的地名，也可能指其他名为 Ozona 的地点（例如佛罗里达州的某个地区/地点）。"},"examples":[{"en":"They rented a house near Ozona in Florida for the weekend.","zh":"他们周末在佛罗里达州 Ozona 附近租了一套房子。"}]}],"synonyms":["(no direct synonyms; proper noun/place name)"],"phonetic":"/oʊˈzoʊnə/","extraExplanation":["“Ozona”通常作为地名使用，不是常见英语词汇。德州的 Ozona 位于 I-10 公路沿线，常被旅行者当作中途休息或补给的地方。","拼写上容易让人联想到“ozone（臭氧）”，但它们意义不同：ozone 是气体名词，而 Ozona 多为专有名词（地名）。"]}
{"word":"ozonation","summary":{"en":"Ozonation is the process of using ozone (O₃) to disinfect or remove pollutants, often in water treatment.","zh":"Ozonation 指用臭氧（O₃）进行消毒或去除污染物的处理过程，常见于水处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a treatment process that uses ozone gas (O₃) to disinfect, deodorize, or break down pollutants, especially in water treatment and air purification","zh":"臭氧化处理：使用臭氧气体（O₃）进行消毒、除臭或分解污染物的处理过程，常用于水处理与空气净化"},"examples":[{"en":"The city upgraded its water plant to include ozonation to kill bacteria and viruses.","zh":"这座城市升级了自来水厂，加入臭氧化处理来杀灭细菌和病毒。"},{"en":"After ozonation, the water had less odor and fewer organic contaminants.","zh":"经过臭氧化处理后，水的异味更少，有机污染物也更少。"}]}],"synonyms":["ozone treatment","ozone disinfection","ozone oxidation"],"phonetic":"/ˌoʊzəˈneɪʃən/","extraExplanation":["“ozonation”多见于环保、公共卫生与工业领域（如饮用水处理、泳池消毒、食品加工设备清洁等）。相较于氯消毒，臭氧通常作用更强、残留更少，但设备成本更高，且臭氧对人体呼吸道有刺激性，需要良好通风与安全控制。","词源上来自 ozone（臭氧）+ -ation（表示“过程/作用”的名词后缀）。常见搭配：ozonation system（臭氧化系统）、ozonation treatment（臭氧化处理）、pre-ozonation / post-ozonation（预臭氧化/后臭氧化）。"]}
{"word":"ozone","summary":{"en":"Ozone is a form of oxygen gas (O₃). High in the atmosphere it protects us from UV rays, but near the ground it can be a harmful air pollutant.","zh":"臭氧是氧气的一种形式（O₃）。在高层大气中它能阻挡紫外线保护地球，但在近地面时它可能成为有害的空气污染物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gas made of three oxygen atoms (O₃), found especially high in the atmosphere; it helps protect Earth by blocking much of the sun’s harmful ultraviolet (UV) radiation.","zh":"由三个氧原子组成的气体（O₃），主要存在于高层大气中；它通过吸收/阻挡太阳有害的紫外线（UV）来保护地球。"},"examples":[{"en":"The ozone layer helps protect us from ultraviolet radiation.","zh":"臭氧层帮助我们抵御紫外线辐射。"},{"en":"Scientists monitor changes in ozone over Antarctica.","zh":"科学家监测南极上空臭氧的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"Ozone near the ground, a major air pollutant formed when sunlight reacts with car exhaust and industrial chemicals; it can irritate the lungs and harm plants.","zh":"近地面臭氧：一种主要空气污染物，由阳光与汽车尾气、工业化学物质发生反应形成；会刺激肺部并伤害植物。"},"examples":[{"en":"On hot summer days, ozone levels can rise and trigger air-quality alerts.","zh":"在炎热的夏天，臭氧浓度可能上升并触发空气质量警报。"},{"en":"People with asthma may feel worse when ground-level ozone is high.","zh":"当近地面臭氧浓度较高时，哮喘患者可能会感觉更不舒服。"}]}],"synonyms":["O3","ozone gas","ground-level ozone","stratospheric ozone"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["“臭氧”在英语里常和“ozone layer（臭氧层）”一起出现，语境通常偏“保护地球”。但在环保/健康新闻中，“ozone”也常指“近地面臭氧”，语境偏“污染与危害”。判断含义时，看它是在说高空大气（layer、stratosphere）还是地面空气质量（smog、air quality、alerts）。"]}
{"word":"ozoner","summary":{"en":"An ozoner is a device (or less commonly, an agent) that produces ozone, typically for air or water treatment.","zh":"ozoner 指产生臭氧的装置（较少也可指臭氧化的施行者/事物），常用于空气或水处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that produces ozone (O₃), often used for air or water treatment","zh":"臭氧发生器；产臭氧装置（用于空气或水处理等）"},"examples":[{"en":"They installed an ozoner to remove odors from the storage room.","zh":"他们安装了一台臭氧发生器来去除储藏室的异味。"},{"en":"Some pools use an ozoner to help disinfect the water.","zh":"有些游泳池会用臭氧发生器来辅助给水消毒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that ozonates something; something that adds ozone to air or water","zh":"对……进行臭氧化的人/事物；使空气或水臭氧化的装置"},"examples":[{"en":"The technician checked the ozoner settings before the treatment started.","zh":"技术员在处理开始前检查了臭氧化装置的设置。"}]}],"synonyms":["ozone generator","ozonizer","ozonation unit"],"phonetic":"/ˈoʊzoʊnər/","extraExplanation":["“ozoner”在日常英语中不算特别常见，更常见的说法是 **ozone generator** 或 **ozonizer**。","臭氧可用于除味、杀菌与水处理，但高浓度臭氧对呼吸道有刺激性；在英语语境里也常会看到安全提示，如 *Do not occupy the room during ozone treatment.*（臭氧处理时不要在房间内停留）。"]}
{"word":"ozones","summary":{"en":"“Ozones” means more than one amount/type of ozone (O₃), though “ozone” is more common in everyday English.","zh":"“ozones”是“ozone（臭氧）”的复数，表示多处/多种/多份臭氧；但日常更常用“ozone”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ozone: a gas (O₃) with a strong, fresh smell, found in the atmosphere and sometimes produced by electricity (for example, after lightning) or by machines used to clean air or water.","zh":"ozone 的复数：臭氧（O₃），一种带有强烈、清新气味的气体，存在于大气中；也可能由电（如闪电后）或用于净化空气/水的设备产生。"},"examples":[{"en":"Scientists measure ozones and other gases to understand air pollution.","zh":"科学家会测量臭氧等气体来了解空气污染。"},{"en":"After the storm, some people say they can smell ozones in the air (more commonly: “smell ozone”).","zh":"暴风雨过后，有些人说能闻到空气里的臭氧味（更常见说法是“smell ozone”）。"}]}],"synonyms":["ozone (more common)","O₃"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["“ozones”在日常英语里不算常见，更常用的是不可数或单数形式“ozone”（例如：high ozone levels / the ozone layer）。当强调不同来源、不同测量点或不同类型的臭氧时，才可能用复数。","臭氧（O₃）和氧气（O₂）不同：臭氧在高空能保护地球免受紫外线伤害（臭氧层），但在近地面浓度过高会刺激呼吸道，属于污染物之一。"]}
{"word":"ozonic","summary":{"en":"Ozonic means “related to ozone” or “having an ozone-like fresh, sharp smell.”","zh":"ozonic 指“与臭氧有关的”，或“带有臭氧般清新、略刺鼻的气味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ozone, or having the fresh, sharp smell often noticed after lightning, near the sea, or around some air-cleaning devices.","zh":"与臭氧有关的；带有臭氧那种清新、略刺鼻的气味（常在雷雨后、海边或某些空气净化设备附近闻到）。"},"examples":[{"en":"After the storm, the air smelled ozonic and clean.","zh":"暴风雨过后，空气闻起来有臭氧般的清新。"},{"en":"Some people describe the scent near waterfalls as slightly ozonic.","zh":"有些人形容瀑布附近的气味带一点臭氧感。"},{"en":"The lab noted an ozonic odor when ozone was being generated.","zh":"实验室在生成臭氧时记录到一种臭氧味。"}]}],"synonyms":["ozone-like","ozonous","fresh-smelling","pungent (in smell)"],"phonetic":"/oʊˈzɑːnɪk/","extraExplanation":["“ozonic”来自“ozone（臭氧）”。日常写作里更常见的是“ozone/ozonic smell（臭氧味）”或“ozone-related（与臭氧有关的）”。","注意区分：有“ozonic”气味并不等于空气一定健康。低浓度臭氧可能让人觉得“清新”，但臭氧在地面层是刺激性气体，浓度高会刺激眼睛和呼吸道。"]}
{"word":"ozonid","summary":{"en":"An ozonide is a reactive chemical compound formed by reaction with ozone.","zh":"ozonide（臭氧化物）指由臭氧反应形成、通常反应性较强的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed when ozone reacts with another substance; ozonides contain the ozonide group (O3−) and are often unstable or highly reactive","zh":"臭氧化物；臭氧与其他物质反应生成的化合物，含有臭氧根（O3−），通常不稳定或反应性很强"},"examples":[{"en":"Some alkali metals can form ozonides under special laboratory conditions.","zh":"在特定的实验室条件下，一些碱金属可以形成臭氧化物。"},{"en":"Because certain ozonides are reactive, they must be handled with care.","zh":"由于某些臭氧化物反应性很强，必须小心处理。"}]}],"synonyms":["ozone compound","ozone-derived compound"],"phonetic":"/ˈoʊzoʊˌnaɪd/","extraExplanation":["你输入的 **ozonid** 更常见的标准拼写是 **ozonide**（臭氧化物）。在化学语境里更容易被理解与检索。","在有机化学中，ozone 对烯烃进行“臭氧化反应”（ozonolysis）会生成中间体（如 molozonide / ozonide），但日常英语里这个词多出现在专业化学材料中。"]}
{"word":"ozonoscopic","summary":{"en":"Ozonoscopic means “related to detecting or measuring ozone,” often in older scientific contexts.","zh":"ozonoscopic 指“与臭氧的检测或测量有关”，多用于较早期的科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to an ozonoscope (a device or method used to detect or measure ozone in the air).","zh":"与臭氧检测器（ozonoscope，用来检测或测量空气中臭氧的装置或方法）有关的。"},"examples":[{"en":"The scientist recorded ozonoscopic readings each morning to track changes in the air.","zh":"科学家每天早晨记录臭氧检测读数，以追踪空气变化。"},{"en":"Early reports described ozonoscopic tests using chemical papers that changed color.","zh":"早期报告描述了使用会变色的化学试纸进行臭氧检测的测试。"}]}],"synonyms":["ozone-detecting","ozone-monitoring","ozone-measuring"],"phonetic":"/ˌoʊzoʊnəˈskɑpɪk/","extraExplanation":["“ozonoscopic”比较罕见，多见于较早期的科学/气象学文献。现代英语更常说“ozone monitoring / ozone measurement / ozone detection（臭氧监测/测量/检测）”。","词形来源可拆解为：ozone（臭氧）+ -scopic（与观察/检测有关，类似 microscope 的 -scope）。"]}
{"word":"ozonosphere","summary":{"en":"The ozonosphere is the ozone-rich region of the atmosphere (the ozone layer) that protects Earth by absorbing harmful UV radiation.","zh":"ozonosphere 指大气中富含臭氧的区域（即臭氧层），通过吸收有害紫外线来保护地球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the layer of Earth’s atmosphere (mainly in the stratosphere) that contains a relatively high amount of ozone (O₃) and helps block harmful ultraviolet (UV) radiation from the Sun","zh":"臭氧层；（主要位于平流层的）大气层中臭氧（O₃）含量较高的一层，可吸收/阻挡太阳的有害紫外线"},"examples":[{"en":"Scientists monitor the ozonosphere to understand how well it is recovering.","zh":"科学家监测臭氧层，以了解它恢复得如何。"},{"en":"Damage to the ozonosphere can increase the risk of skin cancer because more UV radiation reaches the ground.","zh":"臭氧层受损会增加皮肤癌风险，因为更多紫外线会到达地面。"},{"en":"International agreements helped reduce chemicals that were harming the ozonosphere.","zh":"国际协定帮助减少了破坏臭氧层的化学物质。"}]}],"synonyms":["ozone layer","ozone region"],"phonetic":"/oʊˈzoʊnəˌsfɪr/","extraExplanation":["“ozonosphere”由“ozone（臭氧）+ -sphere（圈/层）”构成，常被当作“ozone layer（臭氧层）”的同义词使用。在日常科普与新闻中，“ozone layer”更常见。","臭氧层主要位于平流层，并不是一层“实体外壳”，而是指臭氧相对集中的区域；它对生命重要，因为能吸收大部分UV-B和UV-C紫外线。","注意区分：高空的臭氧对人体有保护作用；但地面附近的臭氧是空气污染物（形成“光化学烟雾”），对呼吸系统有害。"]}
{"word":"ozostomia","summary":{"en":"Ozostomia is a medical term meaning bad breath (unpleasant mouth odor).","zh":"ozostomia 是“口臭”的医学术语，指口腔散发出的难闻气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bad breath; an unpleasant smell coming from the mouth (a medical term).","zh":"口臭；口腔散发出的难闻气味（医学用语）。"},"examples":[{"en":"The dentist explained that ozostomia can be caused by gum disease or dry mouth.","zh":"牙医解释说，口臭可能由牙龈疾病或口干引起。"},{"en":"If ozostomia lasts for weeks, it’s a good idea to see a dentist or doctor.","zh":"如果口臭持续数周，最好去看牙医或医生。"}]}],"synonyms":["halitosis","bad breath","mouth odor"],"phonetic":"/ˌoʊzoʊˈstoʊmiə/","extraExplanation":["这是一个较少见的医学术语，日常英语里更常用的是 halitosis（更正式）或 bad breath（更口语）。","词源上可理解为“气味 + 口腔”：来自希腊语根 ozo-（有气味/发臭）与 -stomia（口/口腔）。","学习与就医沟通时可用：persistent ozostomia（持续口臭）、oral hygiene（口腔卫生）、dry mouth/xerostomia（口干）、gum disease（牙龈疾病）。"]}
{"word":"ozotype","summary":{"en":"Ozotype is an early photographic printing process that produces durable, carbon-like prints using pigmented gelatin.","zh":"Ozotype（奥佐印相法）是一种早期摄影印相工艺，用含颜料的明胶制作耐久、类似碳素相片的印相。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a photographic printing process (early 1900s) that makes permanent images using pigmented gelatin and a light-sensitive chemical, producing a carbon-like print known for rich tones and durability","zh":"（早期摄影）奥佐印相法：一种20世纪初的摄影印相工艺，利用含颜料的明胶与感光化学物质制成影像，成品类似碳素相片，以色调浓郁、耐久著称"},"examples":[{"en":"The museum displayed portraits made with the ozotype process because the prints have lasted for more than a century.","zh":"博物馆展出了用奥佐印相法制作的人像，因为这些印相保存了一百多年。"},{"en":"She studies ozotype to understand how photographers achieved deep blacks before modern printing.","zh":"她研究奥佐印相法，以了解在现代印刷出现之前摄影师如何获得深邃的黑色层次。"}]}],"synonyms":["carbon print","pigment print"],"phonetic":"/ˈoʊzəˌtaɪp/","extraExplanation":["“Ozotype”主要出现在摄影史与暗房工艺文献中，属于较罕见的专业词。它与“carbon print（碳素印相）”同属耐久型颜料印相的传统路线，常被提及于19世纪末至20世纪初的影像印制技术演变。","词形中“ozo-”与“ozone（臭氧）”同源，源于希腊语，带有“有气味/与氧有关”的词根色彩；但在日常英语里几乎不会用到，更多是工艺名称。"]}
{"word":"ozs","summary":{"en":"“ozs” is an informal written abbreviation for “ounces” (plural of oz.), used for weight or volume on labels and recipes.","zh":"“ozs”是“ounces（盎司）”的非正式书面缩写，用于标签和食谱中表示重量或容量。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A written abbreviation meaning “ounces,” the plural of “oz.” It is used to show weight or volume (especially in recipes and product labels).","zh":"书面缩写，表示“盎司（ounces）”，是“oz.”的复数形式。常用于表示重量或容量（尤其在食谱、商品标签上）。"},"examples":[{"en":"Add 2 ozs of cheese to the salad.","zh":"在沙拉里加2盎司奶酪。"},{"en":"The label says the bottle contains 12 ozs.","zh":"标签上写着这瓶有12盎司。"},{"en":"I bought 8 ozs of coffee beans.","zh":"我买了8盎司咖啡豆。"}]}],"synonyms":["oz","ounces","fl oz (for fluid ounces)"],"phonetic":"/aʊns/","extraExplanation":["在正式英文里，更常见的写法是“oz”（既可表示单复数），例如“12 oz”。“ozs”属于更口语/非正式或随手记的写法。","“ounce/oz”在美国常见两种：重量的盎司（约28.35克）和液体盎司“fluid ounce/fl oz”（体积单位，约29.57毫升）。标签上如果写“fl oz”通常指液体体积。"]}
{"word":"ozzie","summary":{"en":"“Ozzie” is an informal word most often meaning an Australian (similar to “Aussie”), and it can also be a nickname like Ozzy/Oswald.","zh":"“Ozzie”多用于非正式场合，通常指“澳大利亚人/澳式的”（类似“Aussie”），也可作 Ozzy/Oswald 等名字的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) An Australian person; someone from Australia.","zh":"（非正式）澳大利亚人；来自澳大利亚的人。"},"examples":[{"en":"She married an Ozzie she met while traveling in Sydney.","zh":"她在悉尼旅行时认识了一位澳大利亚人，后来结婚了。"},{"en":"A bunch of Ozzies were watching the cricket match at the pub.","zh":"一群澳大利亚人在酒吧看板球比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A nickname for someone named Ozzy/Oswald (sometimes used as a friendly personal name).","zh":"（非正式）Ozzy/Oswald 的昵称；也可作友好的名字称呼。"},"examples":[{"en":"Ozzie, can you help me carry these boxes?","zh":"Ozzie，你能帮我搬这些箱子吗？"},{"en":"His friends have called him Ozzie since high school.","zh":"从高中起，朋友们就叫他 Ozzie。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Australian; relating to Australia (less common than “Aussie”).","zh":"（非正式）澳大利亚的；与澳大利亚有关的（不如“Aussie”常见）。"},"examples":[{"en":"They cooked an Ozzie-style barbecue in the backyard.","zh":"他们在后院做了澳式烧烤。"}]}],"synonyms":["Aussie","Australian","Ozzy"],"phonetic":"/ˈɔzi/","extraExplanation":["“Ozzie”常被当作“Aussie”的另一种拼写（Aussie 是更常见的写法），意思是“澳大利亚人/澳大利亚的”。在口语或网络上你可能会看到 Ozzie/Aussie 混用，但在正式写作中通常用 “Australian”。","“Ozzy/Ozzie”也常见于人名昵称（例如歌手 Ozzy Osbourne）。具体含义要看语境：是在说国籍（澳洲人）还是在叫某个人的名字。"]}
{"word":"ozzy","summary":{"en":"Ozzy is usually a person’s nickname or name, and it often refers to the rock singer Ozzy Osbourne.","zh":"Ozzy 通常是人名/昵称；在流行文化中常指摇滚歌手 Ozzy Osbourne。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname or given name (short form of names like Oswald, Oscar, or Osmond).","zh":"昵称或名字（常见于 Oswald、Oscar、Osmond 等名字的简称）。"},"examples":[{"en":"His friends call him Ozzy, but his full name is Oscar.","zh":"朋友都叫他 Ozzy，但他的全名是 Oscar。"},{"en":"Ozzy is an informal name you might hear in English-speaking countries.","zh":"Ozzy 是英语国家里可能会听到的非正式名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(often referring to) Ozzy Osbourne, a famous British rock singer (lead singer of Black Sabbath).","zh":"（常指）奥兹·奥斯本（Ozzy Osbourne），著名英国摇滚歌手（Black Sabbath 黑色安息日乐队主唱）。"},"examples":[{"en":"Ozzy became famous in the 1970s with Black Sabbath.","zh":"Ozzy 在 1970 年代凭借 Black Sabbath 成名。"},{"en":"My dad loves Ozzy’s music.","zh":"我爸爸很喜欢 Ozzy 的音乐。"}]}],"synonyms":["(as a name)","Ozzy Osbourne","Aussie (similar-looking, different meaning)"],"phonetic":"/ˈɑzi/","extraExplanation":["“Ozzy”在英文里更多被当作人名/昵称使用，而不是普通词汇。最常见的文化指向是摇滚歌手 Ozzy Osbourne，因此在音乐语境中别人说“Ozzy”通常就是指他。","不要把“Ozzy”和“Aussie（澳大利亚人/澳洲的）”混淆：两者发音和拼写相近，但“Aussie”更常见、更标准。"]}
