{"word":"oz","summary":{"en":"“Oz” usually means “ounce” (oz) in measurements; it can also refer informally to Australia, or to the land of Oz in The Wizard of Oz.","zh":"“Oz”最常见是计量单位“盎司（ounce）”的缩写；也可口语指澳大利亚，或指《绿野仙踪》中的奥兹国。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “ounce,” a unit of weight (and sometimes fluid volume).","zh":"“ounce（盎司）”的缩写，用于表示重量单位（有时也指液体容量单位）。"},"examples":[{"en":"Add 2 oz of cheese to the salad.","zh":"在沙拉里加 2 盎司的奶酪。"},{"en":"This bottle contains 12 oz of water.","zh":"这瓶水是 12 盎司。"}]},{"partOfSpeech":"other","definition":{"en":"informal short form for Australia or Australian (often written “Aussie” in everyday speech).","zh":"非正式地指“澳大利亚”或“澳大利亚的/澳大利亚人”的简称（口语中更常写作“Aussie”）。"},"examples":[{"en":"He moved to Oz for work.","zh":"他为了工作搬去了澳大利亚。"},{"en":"Oz slang can be different from American English.","zh":"澳洲俚语可能和美式英语不一样。"}]},{"partOfSpeech":"other","definition":{"en":"the fantasy land in the story “The Wizard of Oz.”","zh":"童话/奇幻故事《绿野仙踪（The Wizard of Oz）》中的“奥兹国”。"},"examples":[{"en":"Dorothy dreams of going back to Oz.","zh":"多萝西梦想到回到奥兹国。"},{"en":"The Wizard of Oz is a classic film.","zh":"《绿野仙踪》是一部经典电影。"}]}],"synonyms":["ounce (abbr.)","fl oz (fluid ounce)","Australia (informal: Oz)"],"phonetic":"/ɑz/","extraExplanation":["在食谱、营养标签、饮料容量里常见“oz”。表示重量时是“avoirdupois ounce（常衡盎司）”，约等于 28.35 克；表示液体容量时常写作“fl oz（fluid ounce，液体盎司）”，美制 1 fl oz 约等于 29.57 毫升。","“Oz”指澳大利亚时带有轻松口语色彩；正式写作更常用“Australia / Australian”。"]}
{"word":"oza","summary":{"en":"“Oza” is usually a proper name (surname/place) or an abbreviation; it isn’t a common English word.","zh":"“Oza”通常是专有名词（姓氏/地名）或缩写；不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name used as a surname or place name in several countries; not a common English vocabulary word.","zh":"一个专有名词（人名/姓氏或地名），在多个国家和地区都可能出现；不是常见的英语词汇。"},"examples":[{"en":"Oza is her family name.","zh":"Oza 是她的姓。"},{"en":"They visited the Oza district during their trip.","zh":"他们旅行时去了 Oza 地区。"}]},{"partOfSpeech":"other","definition":{"en":"In some contexts, “OZA” is used as an abbreviation (its meaning depends on the field, organization, or country).","zh":"在某些语境中，“OZA”可作为缩写使用（具体含义取决于行业、组织或国家/地区）。"},"examples":[{"en":"The email signature included OZA, but the meaning wasn’t explained.","zh":"邮件签名里有 OZA，但没有解释它的意思。"}]}],"phonetic":"/ˈoʊzə/","extraExplanation":["“oza”在英语里通常不作为普通单词使用，所以要判断它的意思，需要你提供上下文（例如：出现在哪句话里、是不是人名/地名、是否全大写 OZA）。","如果你本来想查的是“oz”（ounce 的缩写，表示“盎司”），或西班牙语相关的词（如 onza），也可以告诉我，我可以一起对比解释。"]}
{"word":"ozaena","summary":{"en":"Ozaena is an older medical term for atrophic rhinitis, a chronic nasal condition often associated with crusting and a foul smell.","zh":"Ozaena 是较旧的医学术语，指萎缩性鼻炎，常见表现为鼻腔结痂并伴随明显恶臭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical term for chronic atrophic rhinitis (a long-lasting condition where the nasal lining becomes thin and dry), often causing a strong, unpleasant smell and crusting inside the nose.","zh":"一种医学术语，指“萎缩性鼻炎”（鼻腔黏膜长期变薄、干燥的慢性疾病），常伴随鼻腔结痂及明显的恶臭。"},"examples":[{"en":"The doctor noted symptoms consistent with ozaena, including crusting and a foul odor.","zh":"医生记录了与 ozaena（萎缩性鼻炎）相符的症状，包括结痂和恶臭。"},{"en":"In older medical texts, ozaena is mentioned as a cause of persistent bad smell from the nose.","zh":"在较早的医学文献中，ozaena 常被提到是鼻腔持续异味的原因之一。"}]}],"synonyms":["ozena","atrophic rhinitis"],"phonetic":"/oʊˈziːnə/","extraExplanation":["ozaena 也常写作 ozena；在现代临床语境中，医生更常用 “atrophic rhinitis（萎缩性鼻炎）” 来表达，更直接也更常见。","词源来自希腊语，原意与“臭味/恶臭”相关；因此这个词在阅读旧的医学资料或病理学文献时更容易遇到。"]}
{"word":"ozalid","summary":{"en":"“Ozalid” refers to a diazo-copy print/process used to duplicate technical drawings.","zh":"“Ozalid”指用于复制工程/建筑图纸的重氮法复制品或复制工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of diazo copying process (and the resulting print) once widely used to duplicate architectural or engineering drawings; also used as a trademark name for such prints.","zh":"一种重氮（diazo）复制工艺（及其成品图纸），过去常用于复制建筑/工程图；也常作该类图纸的商标名。"},"examples":[{"en":"The architect asked for a clean ozalid copy of the floor plan.","zh":"建筑师要一份干净的 Ozalid（重氮法）平面图复印件。"},{"en":"Old project files sometimes include ozalids that have yellowed with age.","zh":"老项目档案里有时会有随着时间发黄的 Ozalid 图纸。"}]}],"synonyms":["diazo print","whiteprint","blueprint copy"],"phonetic":"/ˈoʊzəˌlɪd/","extraExplanation":["“Ozalid”最初常见于建筑、工程制图领域，指一种用重氮显影来复制大幅图纸的“白图/蓝图”类印刷（不同配方会呈现蓝、紫或棕色线条）。","在现代办公环境中，它多被大幅面扫描/打印取代；你可能在老式图纸档案或施工文件里见到这个词。","它常被当作通用名词使用，但在历史上也与具体品牌/商标有关，因此有时会首字母大写。"]}
{"word":"ozan","summary":{"en":"An ozan is a Turkish folk bard: a poet-singer who performs traditional songs and stories, often with a saz/bağlama.","zh":"ozan 指土耳其传统民间吟游诗人：会写诗作曲并自弹自唱、讲故事，常用 saz/bağlama 伴奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Turkish culture) a traditional folk poet-singer or bard who composes and performs songs, often with a long‑necked lute (saz/bağlama).","zh":"（土耳其文化中）传统民间诗人兼歌者、吟游诗人，常自作自唱，通常伴奏长颈鲁特琴（saz/bağlama）。"},"examples":[{"en":"The documentary follows an ozan who sings epics about love and war.","zh":"这部纪录片跟拍了一位吟游诗人，他唱着关于爱情与战争的史诗。"},{"en":"In the village café, an ozan performed with a bağlama and told stories between songs.","zh":"在村里的咖啡馆里，一位民间歌诗人用 bağlama 伴奏演出，并在歌曲之间讲故事。"}]}],"synonyms":["bard","folk poet","minstrel (context-dependent)"],"phonetic":"/oʊˈzɑn/","extraExplanation":["“Ozan”是土耳其语词，常被英语借用来指一种类似“bard/folk poet”的人物。与英语里的“bard”很接近，但语境更偏土耳其/安纳托利亚民间传统。","在现代语境中，“ozan”有时也可用来称赞某位歌手或词作者“像传统民间诗人一样会讲故事、会写诗”。"]}
{"word":"ozarkite","summary":{"en":"Ozarkite means a person from the Ozarks, or something related to the Ozarks and its culture.","zh":"Ozarkite 指奥扎克山区的人，或与奥扎克山区及其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Ozarks (a highland region in the central United States).","zh":"奥扎克山区（美国中部高地区域）的人；奥扎克人。"},"examples":[{"en":"She’s an Ozarkite who grew up fishing in the White River.","zh":"她是奥扎克人，在白河边钓鱼长大。"},{"en":"Many Ozarkites have deep family roots in rural Missouri and Arkansas.","zh":"许多奥扎克人的家族在密苏里州和阿肯色州的乡村扎根已久。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ozarks or its people, culture, or landscape.","zh":"与奥扎克山区及其居民、文化或自然环境有关的。"},"examples":[{"en":"They collected Ozarkite folk songs and stories.","zh":"他们收集奥扎克地区的民歌与故事。"},{"en":"The cabin had a distinctly Ozarkite style—simple, practical, and wood-built.","zh":"这间小屋有很典型的奥扎克风格——朴素、实用、以木材为主。"}]}],"synonyms":["Ozarks resident","Ozarker (common alternative)"],"phonetic":"/oʊˈzɑrˌkaɪt/","extraExplanation":["“Ozarkite”由“Ozark（奥扎克山区）+ -ite（表示某地的人/物）”构成，像“New Yorker（纽约人）”或“Brooklynite（布鲁克林人）”一样，是常见的英语构词方式。","奥扎克山区（the Ozarks）主要涵盖密苏里州南部与阿肯色州北部，也延伸到俄克拉荷马州与堪萨斯州的一小部分；谈到“Ozarkite”时，语境常涉及乡村生活、民间音乐与山区地貌等。"]}
{"word":"ozawkie","summary":{"en":"“ozawkie” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“ozawkie”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a proper name.","zh":"不是标准英语单词；可能是拼写错误、用户名、品牌名或专有名词。"},"examples":[{"en":"I searched for “ozawkie,” but I couldn’t find it in an English dictionary.","zh":"我查了“ozawkie”，但在英语词典里找不到。"},{"en":"If “ozawkie” is a name, please tell me where you saw it so I can help explain it.","zh":"如果“ozawkie”是名字，请告诉我你在哪看到的，我才能更好地解释。"}]}],"phonetic":"/oʊˈzɑːki/","extraExplanation":["“ozawkie”看起来更像拼写变体或专有名词，而不是常见英语词汇。你可能想输入：\n1) “Ozark” / “Ozarky”（与美国奥扎克地区有关）\n2) “Okeechobee”（地名的一部分拼写）\n3) 某个姓氏/网名/游戏ID\n把你看到它的句子或来源（书、歌曲、游戏、地名等）发我，我可以根据语境判断最可能的意思与读法。"]}
{"word":"ozen","summary":{"en":"Ozone is a gas (O₃): helpful in the upper atmosphere but harmful as pollution near the ground; it can also mean disinfecting with ozone.","zh":"臭氧是一种气体（O₃）：高空中有保护作用，但在近地面可能是污染物；也可作动词，指用臭氧消毒/除味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gas in the atmosphere made of three oxygen atoms (O₃); it forms a protective layer high above Earth but can be a harmful pollutant near the ground","zh":"臭氧（O₃），由三个氧原子组成的气体；在高空能形成保护地球的臭氧层，但在近地面时可能成为有害污染物"},"examples":[{"en":"The ozone layer helps block harmful ultraviolet (UV) rays from the sun.","zh":"臭氧层有助于阻挡太阳的有害紫外线（UV）。"},{"en":"On hot summer days, ground-level ozone can make breathing harder.","zh":"在炎热的夏天，近地面臭氧会让呼吸更困难。"},{"en":"Scientists track ozone levels to understand air quality and climate effects.","zh":"科学家监测臭氧水平，以了解空气质量和气候影响。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat something (often water or air) with ozone in order to disinfect or remove odors","zh":"用臭氧处理（常指水或空气）以消毒或去除异味"},"examples":[{"en":"The hotel ozoned the room to remove the smoke smell.","zh":"酒店用臭氧处理房间来去除烟味。"},{"en":"Some systems ozone drinking water to kill bacteria.","zh":"一些系统用臭氧处理饮用水来杀灭细菌。"}]}],"synonyms":["(n.) O₃","(n.) smog component","(v.) disinfect","(v.) deodorize"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["你输入的“ozen”在英文里不常见；很多学习者其实想查的是“ozone（臭氧）”。如果你确实想查人名/姓氏 Ozen 或土耳其语的“özen”（意为“用心、细致”），告诉我你的语境，我可以按正确词条解释。"]}
{"word":"ozena","summary":{"en":"Ozena is an old medical term for a foul-smelling, crusting chronic nasal disease (often treated as atrophic rhinitis).","zh":"Ozena 是一个较旧的医学术语，指伴有恶臭和结痂的慢性鼻部疾病（常被视为萎缩性鼻炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chronic nasal condition (an old medical term) involving atrophy of the nasal lining, crusting, and a strong foul smell; often linked to what is now called atrophic rhinitis.","zh":"一种慢性鼻部疾病（较旧的医学用语），特点是鼻黏膜萎缩、结痂并伴有明显恶臭；常与现在所说的“萎缩性鼻炎”相关。"},"examples":[{"en":"The textbook mentioned ozena as a classic form of atrophic rhinitis with a fetid odor.","zh":"教材提到“ozena”是萎缩性鼻炎的一种典型形式，伴有恶臭。"},{"en":"In older medical reports, ozena was used to describe severe, crusting nasal disease.","zh":"在较早的医学报告中，“ozena”用来描述严重、结痂的鼻部疾病。"}]}],"synonyms":["atrophic rhinitis","chronic atrophic rhinitis"],"phonetic":"/oʊˈziːnə/","extraExplanation":["“ozena”属于较旧或较少使用的医学词汇；现代临床更常用“atrophic rhinitis（萎缩性鼻炎）”等表述，因此在当代日常英语中很少见，多出现在旧文献、医学史或特定专业语境中。","词源来自希腊语，原意与“气味/臭味”相关，所以这个词本身就带有“恶臭”的含义。"]}
{"word":"ozenfant","summary":{"en":"Ozenfant is best known as the name of Amédée Ozenfant, a French artist and co-founder of Purism.","zh":"Ozenfant通常指法国艺术家阿梅代·奥赞方，他与勒·柯布西耶共同创立纯粹主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Amédée Ozenfant (1886–1966), a French painter, writer, and teacher who co-founded the modern art movement called Purism with Le Corbusier.","zh":"阿梅代·奥赞方（Amédée Ozenfant，1886–1966），法国画家、作家与艺术教育者，与勒·柯布西耶共同创立现代艺术流派“纯粹主义（Purism）”。"},"examples":[{"en":"Ozenfant and Le Corbusier argued that modern painting should emphasize clear forms and order.","zh":"奥赞方与勒·柯布西耶主张现代绘画应强调清晰的形体与秩序感。"},{"en":"In art history class, we studied Ozenfant’s role in the Purist movement.","zh":"在艺术史课上，我们学习了奥赞方在纯粹主义运动中的作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A French surname; used to refer to someone from the Ozenfant family.","zh":"法国姓氏；用于指代奥赞方家族的人。"},"examples":[{"en":"The article mentioned an interview with Ozenfant’s students.","zh":"文章提到对奥赞方学生的采访。"}]}],"synonyms":["Amédée Ozenfant","Purism","Le Corbusier"],"phonetic":"/oʊzɑ̃ˈfɑ̃/","extraExplanation":["“Ozenfant”多见于艺术史语境，常与“Purism（纯粹主义）”并提：它强调理性、简洁、结构清楚的造型，某种程度上是对当时部分立体主义（Cubism）过度碎片化的一种“整理与澄清”。","奥赞方与勒·柯布西耶合著《Après le cubisme》（《立体主义之后》），用以阐述纯粹主义理念；因此在阅读相关英文材料时，你会经常看到两人并列出现。"]}
{"word":"ozias","summary":{"en":"Ozias is an older/less common form of the biblical name Uzziah (king of Judah).","zh":"Ozias 是圣经人名 Uzziah（犹大王乌西雅）的较旧或较少见写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ozias: a less common (Latin/Greek) form of the biblical name Uzziah, a king of Judah mentioned in the Hebrew Bible/Old Testament.","zh":"Ozias：圣经人名 Uzziah（乌西雅）的较少见写法（源自拉丁/希腊译名），指《希伯来圣经/旧约》中提到的犹大王。"},"examples":[{"en":"In some older Bible translations, Uzziah is called Ozias.","zh":"在一些较早的《圣经》译本里，Uzziah 会写作 Ozias。"},{"en":"The story of Ozias/Uzziah is used to discuss pride and humility in religious lessons.","zh":"在宗教课程中，Ozias/Uzziah 的故事常被用来讨论骄傲与谦卑。"}]}],"synonyms":["Uzziah"],"phonetic":"/oʊˈzaɪ.əs/","extraExplanation":["“Ozias”多见于早期或特定传统的《圣经》译名（如拉丁语传统），现代英语更常用“Uzziah”。在文学或宗教写作中遇到“Ozias”，通常可理解为同一人物的不同拼写。"]}
{"word":"ozkum","summary":{"en":"“ozkum” is not a recognized English word; it’s likely a name, typo, or non-English term.","zh":"“ozkum”不是公认的英语单词；更可能是名字、拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a proper noun from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名，或来自其他语言的专有名词。"},"examples":[{"en":"I couldn’t find “ozkum” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“ozkum”——你能提供你看到它的句子吗？"},{"en":"Maybe you meant “Ockham” (as in “Occam’s razor”) or another similar-looking word.","zh":"你可能想写的是“Ockham”（如“Occam’s razor / 奥卡姆剃刀”）或其他长得像的词。"}]}],"phonetic":"/ˈɑz.kʌm/","extraExplanation":["“ozkum”看起来不像常见英语词形：不符合常见词根/词缀组合，也不像常见缩写。为了准确帮你查词，请你：1）提供出现它的上下文句子或截图；2）确认大小写（例如 Ozkum / OZKUM）；3）说明它来自哪里（游戏、社媒、品牌、土耳其语/其他语言等）。我也可以根据你想表达的意思，帮你找最可能的正确拼写。"]}
{"word":"ozmo","summary":{"en":"Ozmo is mainly a brand/product name rather than a common English word.","zh":"Ozmo 主要是品牌/产品名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand or product name (proper noun), not a standard dictionary word in general English; commonly seen in names like ECOVACS “OZMO” robot vacuums/mopping systems or related products.","zh":"（专有名词）品牌或产品名称，一般不算常规英语词汇；常见于科沃斯（ECOVACS）“OZMO”等扫地/拖地机器人或相关产品名称中。"},"examples":[{"en":"I bought an ECOVACS OZMO robot to vacuum and mop the floor.","zh":"我买了一台科沃斯（ECOVACS）OZMO 扫拖机器人来吸尘和拖地。"},{"en":"The manual says the OZMO system controls the water flow while mopping.","zh":"说明书说 OZMO 系统在拖地时会控制出水量。"}]}],"phonetic":"/ˈɑzmoʊ/","extraExplanation":["“OZMO”多用于商品命名，含义通常由品牌方定义，不像普通词那样有稳定、通用的词义。","发音在日常交流中通常按英语读作“oz-mo”，重音多在第一个音节。"]}
{"word":"ozobrome","summary":{"en":"Ozobrome is a historical pigment-based photographic printing process, and it can also mean a print made by that process.","zh":"Ozobrome 指一种历史上的颜料型摄影印相工艺，也可指用该工艺制作的印相成品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical photographic printing process (a type of pigment printing) that transfers a carbon image onto paper using a bromide print as the starting image","zh":"（历史上的）一种摄影印相工艺（颜料/碳转印印相法的一种），以溴化银相纸照片为底，通过转印把碳印影像移到纸上"},"examples":[{"en":"The museum displayed early 20th‑century Ozobrome prints alongside other carbon processes.","zh":"博物馆展出了20世纪初的 Ozobrome 印相作品，并与其他碳印工艺并列展示。"},{"en":"She read about the Ozobrome process in a book on alternative photographic techniques.","zh":"她在一本关于替代摄影工艺的书里读到了 Ozobrome 工艺。"}]},{"partOfSpeech":"n.","definition":{"en":"a photographic print made using the Ozobrome process","zh":"用 Ozobrome 工艺制作的照片印相（成品）"},"examples":[{"en":"This Ozobrome has a rich, matte surface and deep shadows.","zh":"这张 Ozobrome 印相表面呈哑光质感，暗部层次很深。"}]}],"synonyms":["Ozobrome process","carbon transfer process","pigment printing (general)","ozotype (related)"],"phonetic":"/ˈoʊzoʊˌbroʊm/","extraExplanation":["Ozobrome 与“carbon print（碳印/碳转印）”家族有关，特点是使用颜料形成影像，因此成像稳定、耐久，常被用于艺术印相与收藏。","它在20世纪初较为流行；随着更便捷的现代印相技术普及，Ozobrome 主要作为历史摄影工艺在研究、展览与替代工艺爱好者圈子中出现。"]}
{"word":"ozocerite","summary":{"en":"Ozocerite is a natural mineral wax used historically in wax products like candles and polishes.","zh":"Ozocerite（地蜡）是一种天然矿物蜡，历史上用于蜡烛、上光剂等蜡制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural mineral wax (a kind of solid hydrocarbon) found in some rocks and soils, used to make products like candles, polishes, and some wax blends.","zh":"地蜡；一种天然矿物蜡（固态烃类混合物），产于某些岩层或土壤中，可用于制作蜡烛、上光剂及混合蜡等产品。"},"examples":[{"en":"In the 1800s, ozocerite was mined in parts of Eastern Europe and used as a source of wax.","zh":"在19世纪，东欧一些地区开采地蜡（ozocerite），并把它作为蜡的来源。"},{"en":"Some early industrial polishes used ozocerite because it could be blended into a hard, shiny wax.","zh":"一些早期的工业上光剂使用地蜡，因为它可以调配成坚硬、光亮的蜡。"}]}],"synonyms":["ozokerite","mineral wax","earth wax"],"phonetic":"/oʊˈzɑsəraɪt/","extraExplanation":["“ozocerite”也常写作“ozokerite”。词源来自希腊语：ozo-（有气味的）+ keros（蜡），字面意思接近“有味道的蜡”。","它在工业史上与“石蜡（paraffin wax）”有联系：地蜡曾是早期蜡制品的重要原料之一，但后来更便宜、更易获得的石蜡在许多用途上取代了它。"]}
{"word":"ozoena","summary":{"en":"Ozoena is a medical term for a chronic nasal condition that causes dryness, crusts, and a strong foul smell.","zh":"ozoena 是医学用语，指一种会导致鼻腔干燥、结痂并产生明显恶臭的慢性鼻部疾病（常与萎缩性鼻炎相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chronic nasal disease (atrophic rhinitis) in which the lining of the nose becomes thin and dry, causing crusts and a strong bad smell","zh":"（医学）臭鼻症；萎缩性鼻炎：鼻腔黏膜变薄、干燥并形成结痂，常伴有明显恶臭"},"examples":[{"en":"The doctor diagnosed her with ozoena after years of nasal dryness and a foul odor.","zh":"在多年鼻腔干燥并伴有恶臭后，医生诊断她患有臭鼻症（ozoena）。"},{"en":"Ozoena can cause crusting inside the nose and persistent bad breath-like smell.","zh":"臭鼻症可能导致鼻内结痂，并出现类似持续口臭的异味。"}]}],"synonyms":["ozaena","atrophic rhinitis"],"phonetic":"/ˌoʊziˈiːnə/","extraExplanation":["“ozoena”更常见的拼写是“ozaena”。属于较偏医学/耳鼻喉科用词，日常英语中不常用。","词源来自希腊语“ozēn”，与“气味/臭味”相关，因此这个词本身就带有“恶臭”的含义。","在现代医学语境里，医生更常使用“atrophic rhinitis（萎缩性鼻炎）”来描述这一类情况；“ozoena”强调其典型的臭味表现。"]}
{"word":"ozokerit","summary":{"en":"Ozokerite (also spelled ozocerite) is a natural mineral wax used historically in candles, polishes, and insulation.","zh":"Ozokerite（也写作 ozocerite）是一种天然矿蜡，历史上用于蜡烛、上光剂和绝缘材料等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring mineral wax (a paraffin-like hydrocarbon) found in some petroleum deposits and used to make products like candles, polishes, and electrical insulation.","zh":"一种天然矿蜡（类似石蜡的烃类混合物），常见于某些石油沉积中，可用于制作蜡烛、上光剂和电绝缘材料等。"},"examples":[{"en":"Ozokerite was once refined to produce wax for candles and polishes.","zh":"过去人们会精炼地蜡（ozokerite）来制作蜡烛和上光剂。"},{"en":"Some historical insulating materials contained ozokerite-based wax.","zh":"一些早期的绝缘材料含有以地蜡为基础的蜡质成分。"}]}],"synonyms":["mineral wax","earth wax","ozokerite","ozocerite"],"phonetic":"/oʊˈzoʊkəˌraɪt/","extraExplanation":["“ozokerit”常见为“ozokerite / ozocerite”的拼写变体，来源于希腊语词根，意为“发出气味的蜡”（早期样品常带石油气味）。","它属于天然矿物蜡的一类，19世纪在中东欧等地曾被开采并用于工业与日用品；现代更多由石油精炼石蜡等材料取代。"]}
{"word":"ozokerite","summary":{"en":"Ozokerite is a natural mineral wax used for making and refining wax products.","zh":"Ozokerite（地蜡）是一种天然矿物蜡，可用于制造与精制多种蜡类产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring mineral wax (a waxy hydrocarbon found in some rocks), used in polishes, waxes, insulation, and as a source material for refined waxes such as ceresine.","zh":"一种天然矿物蜡（存在于某些岩层中的蜡状烃类物质），可用于抛光剂、蜡制品、绝缘材料，也可作为精制蜡（如地蜡 ceresine）的原料。"},"examples":[{"en":"Ozokerite was mined and processed into wax for industrial use.","zh":"人们开采并加工地蜡，用于工业用途。"},{"en":"Some historical candles and polishes used ozokerite as an ingredient.","zh":"一些早期的蜡烛和抛光剂曾把地蜡作为成分之一。"}]}],"synonyms":["mineral wax","earth wax"],"phonetic":"/oʊˈzoʊkəˌraɪt/","extraExplanation":["词源来自希腊语：ozein（“有气味/发出气味”）+ keros（“蜡”），因为这种矿物蜡常带有明显的气味。","在现代日常英语中较少见，多出现在地质、矿业、材料科学或历史工业（蜡、抛光剂）相关语境中。"]}
{"word":"ozon","summary":{"en":"“ozon” is usually a nonstandard form of “ozone” (O₃) in English, or it can refer to the Russian company name “Ozon.”","zh":"“ozon”在英语中通常是“ozone（臭氧）”的非标准写法；也可能指俄罗斯公司名“Ozon”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (rare/nonstandard) spelling of “ozone,” a gas made of three oxygen atoms (O₃), found in the upper atmosphere and sometimes used for cleaning/disinfecting.","zh":"（罕见/非标准）“ozone（臭氧）”的拼写变体；臭氧是一种由三个氧原子组成的气体（O₃），存在于高层大气中，也有时用于清洁/消毒。"},"examples":[{"en":"In English, you will almost always see “ozone,” not “ozon.”","zh":"在英语里几乎总是写作“ozone”，而不是“ozon”。"},{"en":"The ozone layer helps protect Earth from harmful ultraviolet rays.","zh":"臭氧层能帮助地球抵御有害的紫外线。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) “Ozon”: a major Russian online retailer (company name).","zh":"（专有名词）“Ozon”：俄罗斯大型电商平台/公司名称。"},"examples":[{"en":"She ordered the book on Ozon.","zh":"她在 Ozon 上订了那本书。"}]}],"synonyms":["ozone","O₃"],"phonetic":"ˈoʊzoʊn","extraExplanation":["“ozon”更常见于一些语言（如德语/俄语的转写或品牌名）里；在英语学习与写作中，如果你想表达“臭氧”，建议使用标准拼写“ozone”。","臭氧在日常语境里常见搭配：ozone layer（臭氧层）、ground-level ozone（近地面臭氧，属于空气污染物之一）。"]}
{"word":"ozona","summary":{"en":"“Ozona” is usually a U.S. place name, most often Ozona, Texas.","zh":"“Ozona”通常是美国的地名，最常指德克萨斯州的 Ozona。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), most commonly referring to Ozona, a small community in Texas, USA.","zh":"地名（专有名词），最常指美国德克萨斯州的 Ozone（Ozona），一个小社区。"},"examples":[{"en":"We stopped in Ozona, Texas to get gas and snacks on our road trip.","zh":"我们自驾途中在德克萨斯州的 Ozona 停下来加油、买零食。"},{"en":"Ozona is known as a quiet stopping point along Interstate 10.","zh":"Ozona 以州际公路 I-10 沿线的安静补给站而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"a less common place name that may refer to other locations called Ozona (for example, a neighborhood/place in Florida).","zh":"较少见的地名，也可能指其他名为 Ozona 的地点（例如佛罗里达州的某个地区/地点）。"},"examples":[{"en":"They rented a house near Ozona in Florida for the weekend.","zh":"他们周末在佛罗里达州 Ozona 附近租了一套房子。"}]}],"synonyms":["(no direct synonyms; proper noun/place name)"],"phonetic":"/oʊˈzoʊnə/","extraExplanation":["“Ozona”通常作为地名使用，不是常见英语词汇。德州的 Ozona 位于 I-10 公路沿线，常被旅行者当作中途休息或补给的地方。","拼写上容易让人联想到“ozone（臭氧）”，但它们意义不同：ozone 是气体名词，而 Ozona 多为专有名词（地名）。"]}
{"word":"ozonate","summary":{"en":"Ozonate means to treat something with ozone, usually for disinfection or odor removal.","zh":"Ozonate 指用臭氧处理某物，通常用于消毒或除味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat or disinfect something with ozone (O₃), often to remove odors, kill germs, or break down pollutants","zh":"用臭氧（O₃）处理/消毒（某物），常用于除味、杀菌或分解污染物"},"examples":[{"en":"The company ozonates drinking water to reduce harmful microbes.","zh":"这家公司用臭氧处理饮用水，以减少有害微生物。"},{"en":"After the fire, the building was ozonated to help remove the smoke smell.","zh":"火灾后，建筑物用臭氧处理，以帮助去除烟味。"}]}],"synonyms":["ozone-treat","treat with ozone","ozonize"],"phonetic":"/ˈoʊzoʊneɪt/","extraExplanation":["“ozonate”在日常英语中相对少见，更常见的是说“ozone-treat (something)”（用臭氧处理某物）或“treat with ozone”。","用于空气净化、除味或水处理的语境较多；但在真实生活中也常会提醒：高浓度臭氧对人体有刺激/危害，因此通常需要在无人环境下使用并通风。"]}
{"word":"ozonation","summary":{"en":"Ozonation is the process of using ozone (O₃) to disinfect or remove pollutants, often in water treatment.","zh":"Ozonation 指用臭氧（O₃）进行消毒或去除污染物的处理过程，常见于水处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a treatment process that uses ozone gas (O₃) to disinfect, deodorize, or break down pollutants, especially in water treatment and air purification","zh":"臭氧化处理：使用臭氧气体（O₃）进行消毒、除臭或分解污染物的处理过程，常用于水处理与空气净化"},"examples":[{"en":"The city upgraded its water plant to include ozonation to kill bacteria and viruses.","zh":"这座城市升级了自来水厂，加入臭氧化处理来杀灭细菌和病毒。"},{"en":"After ozonation, the water had less odor and fewer organic contaminants.","zh":"经过臭氧化处理后，水的异味更少，有机污染物也更少。"}]}],"synonyms":["ozone treatment","ozone disinfection","ozone oxidation"],"phonetic":"/ˌoʊzəˈneɪʃən/","extraExplanation":["“ozonation”多见于环保、公共卫生与工业领域（如饮用水处理、泳池消毒、食品加工设备清洁等）。相较于氯消毒，臭氧通常作用更强、残留更少，但设备成本更高，且臭氧对人体呼吸道有刺激性，需要良好通风与安全控制。","词源上来自 ozone（臭氧）+ -ation（表示“过程/作用”的名词后缀）。常见搭配：ozonation system（臭氧化系统）、ozonation treatment（臭氧化处理）、pre-ozonation / post-ozonation（预臭氧化/后臭氧化）。"]}
{"word":"ozonator","summary":{"en":"An ozonator is a device that generates ozone for cleaning, deodorizing, or water/air treatment.","zh":"ozonator 指“臭氧发生器”，用来产生臭氧以进行消毒、除味或水/空气处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or machine that produces ozone (O₃), often used for disinfecting, deodorizing, or treating water and air.","zh":"臭氧发生器；一种产生臭氧（O₃）的设备，常用于消毒、除味，或进行水/空气处理。"},"examples":[{"en":"The hotel used an ozonator to remove smoke odors from the room.","zh":"酒店用臭氧发生器来去除房间里的烟味。"},{"en":"A small ozonator can be installed to help treat water in a fish tank.","zh":"可以安装一台小型臭氧发生器来帮助处理鱼缸里的水。"},{"en":"Follow the safety instructions before turning on the ozonator.","zh":"在开启臭氧发生器之前要遵守安全说明。"}]}],"synonyms":["ozone generator","ozone machine","ozone generator unit"],"phonetic":"/oʊˈzoʊ.neɪ.tɚ/","extraExplanation":["“ozonator”由“ozone（臭氧）+ -ator（表示‘做某事的器具/装置’）”构成，常见于家用除味、车内除味、泳池/水处理等场景。","臭氧具有强氧化性：在合适条件下可用于杀菌和分解异味来源，但高浓度臭氧会刺激呼吸道，对人和宠物不友好。使用时通常需要在无人环境运行，并在之后充分通风。","有些产品会写成“ozone generator（臭氧发生器）”，意思基本相同；“ozonator”更像一种较口语/产品命名的说法。"]}
{"word":"Ozone","summary":{"en":"Ozone is O₃: helpful in the upper atmosphere as the ozone layer, but harmful near the ground as an air pollutant.","zh":"Ozone（臭氧）是 O₃：高空形成臭氧层可保护地球，但近地面时常作为空气污染物有害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gas made of three oxygen atoms (O₃), found naturally in the atmosphere; high in the sky it helps protect Earth from the sun’s harmful ultraviolet (UV) rays, but near the ground it can be a harmful air pollutant.","zh":"一种由三个氧原子组成的气体（O₃）。在高空（平流层）它能帮助阻挡太阳的有害紫外线；但在近地面时，它可能成为有害的空气污染物。"},"examples":[{"en":"The ozone layer helps protect us from ultraviolet radiation.","zh":"臭氧层帮助我们抵御紫外线辐射。"},{"en":"On hot summer days, ground-level ozone can make the air unhealthy to breathe.","zh":"在炎热的夏天，近地面臭氧会让空气变得不利于呼吸健康。"},{"en":"Scientists measure ozone levels to track air quality and climate patterns.","zh":"科学家会测量臭氧水平来追踪空气质量与气候变化模式。"}]}],"synonyms":["O₃","ozone gas"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["学习提示：英语里常见搭配是 the ozone layer（臭氧层）和 ground-level ozone（近地面臭氧）。注意区分：臭氧层的“臭氧”一般被视为有益；近地面臭氧则常与雾霾/光化学烟雾（photochemical smog）和呼吸道刺激相关。","发音与拼写：ozone 的重音在第二个音节（o-ZONE）。"]}
{"word":"ozone","summary":{"en":"Ozone is a form of oxygen gas (O₃). High in the atmosphere it protects us from UV rays, but near the ground it can be a harmful air pollutant.","zh":"臭氧是氧气的一种形式（O₃）。在高层大气中它能阻挡紫外线保护地球，但在近地面时它可能成为有害的空气污染物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gas made of three oxygen atoms (O₃), found especially high in the atmosphere; it helps protect Earth by blocking much of the sun’s harmful ultraviolet (UV) radiation.","zh":"由三个氧原子组成的气体（O₃），主要存在于高层大气中；它通过吸收/阻挡太阳有害的紫外线（UV）来保护地球。"},"examples":[{"en":"The ozone layer helps protect us from ultraviolet radiation.","zh":"臭氧层帮助我们抵御紫外线辐射。"},{"en":"Scientists monitor changes in ozone over Antarctica.","zh":"科学家监测南极上空臭氧的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"Ozone near the ground, a major air pollutant formed when sunlight reacts with car exhaust and industrial chemicals; it can irritate the lungs and harm plants.","zh":"近地面臭氧：一种主要空气污染物，由阳光与汽车尾气、工业化学物质发生反应形成；会刺激肺部并伤害植物。"},"examples":[{"en":"On hot summer days, ozone levels can rise and trigger air-quality alerts.","zh":"在炎热的夏天，臭氧浓度可能上升并触发空气质量警报。"},{"en":"People with asthma may feel worse when ground-level ozone is high.","zh":"当近地面臭氧浓度较高时，哮喘患者可能会感觉更不舒服。"}]}],"synonyms":["O3","ozone gas","ground-level ozone","stratospheric ozone"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["“臭氧”在英语里常和“ozone layer（臭氧层）”一起出现，语境通常偏“保护地球”。但在环保/健康新闻中，“ozone”也常指“近地面臭氧”，语境偏“污染与危害”。判断含义时，看它是在说高空大气（layer、stratosphere）还是地面空气质量（smog、air quality、alerts）。"]}
{"word":"ozoned","summary":{"en":"“Ozon ed” means something has been treated with ozone for disinfection or deodorizing.","zh":"“ozoned”表示某物已用臭氧处理，通常用于消毒或除味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “ozone”: to treat or disinfect something with ozone gas.","zh":"“ozone”的过去式/过去分词：用臭氧气体处理或消毒某物。"},"examples":[{"en":"The water was ozoned to reduce bacteria and odors.","zh":"这批水用臭氧处理，以减少细菌和异味。"},{"en":"They ozoned the room after the smoke damage.","zh":"烟熏损坏后，他们用臭氧处理了房间。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated with ozone; disinfected or deodorized using ozone.","zh":"经臭氧处理的；用臭氧消毒或除味的。"},"examples":[{"en":"Ozon ed air can smell sharp or “clean” to some people.","zh":"臭氧处理过的空气对一些人来说会闻起来刺鼻或“很清新”。"},{"en":"The ozoned laundry had less musty odor.","zh":"用臭氧处理过的衣物霉味更少。"}]}],"synonyms":["ozonized","disinfected","deodorized","sanitized"],"phonetic":"/ˈoʊzoʊnd/","extraExplanation":["“ozoned”在日常英语里不算特别常见，更常见的动词是“ozonize”（用臭氧处理）。但在水处理、空气净化、除味等场景中，“ozone/ozoned”作为动词或形容词会出现。","注意：臭氧（ozone）在高浓度下会刺激呼吸道，相关设备使用通常需要通风与安全规范。"]}
{"word":"ozoner","summary":{"en":"An ozoner is a device (or less commonly, an agent) that produces ozone, typically for air or water treatment.","zh":"ozoner 指产生臭氧的装置（较少也可指臭氧化的施行者/事物），常用于空气或水处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that produces ozone (O₃), often used for air or water treatment","zh":"臭氧发生器；产臭氧装置（用于空气或水处理等）"},"examples":[{"en":"They installed an ozoner to remove odors from the storage room.","zh":"他们安装了一台臭氧发生器来去除储藏室的异味。"},{"en":"Some pools use an ozoner to help disinfect the water.","zh":"有些游泳池会用臭氧发生器来辅助给水消毒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that ozonates something; something that adds ozone to air or water","zh":"对……进行臭氧化的人/事物；使空气或水臭氧化的装置"},"examples":[{"en":"The technician checked the ozoner settings before the treatment started.","zh":"技术员在处理开始前检查了臭氧化装置的设置。"}]}],"synonyms":["ozone generator","ozonizer","ozonation unit"],"phonetic":"/ˈoʊzoʊnər/","extraExplanation":["“ozoner”在日常英语中不算特别常见，更常见的说法是 **ozone generator** 或 **ozonizer**。","臭氧可用于除味、杀菌与水处理，但高浓度臭氧对呼吸道有刺激性；在英语语境里也常会看到安全提示，如 *Do not occupy the room during ozone treatment.*（臭氧处理时不要在房间内停留）。"]}
{"word":"ozones","summary":{"en":"“Ozones” means more than one amount/type of ozone (O₃), though “ozone” is more common in everyday English.","zh":"“ozones”是“ozone（臭氧）”的复数，表示多处/多种/多份臭氧；但日常更常用“ozone”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ozone: a gas (O₃) with a strong, fresh smell, found in the atmosphere and sometimes produced by electricity (for example, after lightning) or by machines used to clean air or water.","zh":"ozone 的复数：臭氧（O₃），一种带有强烈、清新气味的气体，存在于大气中；也可能由电（如闪电后）或用于净化空气/水的设备产生。"},"examples":[{"en":"Scientists measure ozones and other gases to understand air pollution.","zh":"科学家会测量臭氧等气体来了解空气污染。"},{"en":"After the storm, some people say they can smell ozones in the air (more commonly: “smell ozone”).","zh":"暴风雨过后，有些人说能闻到空气里的臭氧味（更常见说法是“smell ozone”）。"}]}],"synonyms":["ozone (more common)","O₃"],"phonetic":"/ˈoʊzoʊn/","extraExplanation":["“ozones”在日常英语里不算常见，更常用的是不可数或单数形式“ozone”（例如：high ozone levels / the ozone layer）。当强调不同来源、不同测量点或不同类型的臭氧时，才可能用复数。","臭氧（O₃）和氧气（O₂）不同：臭氧在高空能保护地球免受紫外线伤害（臭氧层），但在近地面浓度过高会刺激呼吸道，属于污染物之一。"]}
{"word":"ozonic","summary":{"en":"Ozonic means “related to ozone” or “having an ozone-like fresh, sharp smell.”","zh":"ozonic 指“与臭氧有关的”，或“带有臭氧般清新、略刺鼻的气味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ozone, or having the fresh, sharp smell often noticed after lightning, near the sea, or around some air-cleaning devices.","zh":"与臭氧有关的；带有臭氧那种清新、略刺鼻的气味（常在雷雨后、海边或某些空气净化设备附近闻到）。"},"examples":[{"en":"After the storm, the air smelled ozonic and clean.","zh":"暴风雨过后，空气闻起来有臭氧般的清新。"},{"en":"Some people describe the scent near waterfalls as slightly ozonic.","zh":"有些人形容瀑布附近的气味带一点臭氧感。"},{"en":"The lab noted an ozonic odor when ozone was being generated.","zh":"实验室在生成臭氧时记录到一种臭氧味。"}]}],"synonyms":["ozone-like","ozonous","fresh-smelling","pungent (in smell)"],"phonetic":"/oʊˈzɑːnɪk/","extraExplanation":["“ozonic”来自“ozone（臭氧）”。日常写作里更常见的是“ozone/ozonic smell（臭氧味）”或“ozone-related（与臭氧有关的）”。","注意区分：有“ozonic”气味并不等于空气一定健康。低浓度臭氧可能让人觉得“清新”，但臭氧在地面层是刺激性气体，浓度高会刺激眼睛和呼吸道。"]}
{"word":"ozonid","summary":{"en":"An ozonide is a reactive chemical compound formed by reaction with ozone.","zh":"ozonide（臭氧化物）指由臭氧反应形成、通常反应性较强的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed when ozone reacts with another substance; ozonides contain the ozonide group (O3−) and are often unstable or highly reactive","zh":"臭氧化物；臭氧与其他物质反应生成的化合物，含有臭氧根（O3−），通常不稳定或反应性很强"},"examples":[{"en":"Some alkali metals can form ozonides under special laboratory conditions.","zh":"在特定的实验室条件下，一些碱金属可以形成臭氧化物。"},{"en":"Because certain ozonides are reactive, they must be handled with care.","zh":"由于某些臭氧化物反应性很强，必须小心处理。"}]}],"synonyms":["ozone compound","ozone-derived compound"],"phonetic":"/ˈoʊzoʊˌnaɪd/","extraExplanation":["你输入的 **ozonid** 更常见的标准拼写是 **ozonide**（臭氧化物）。在化学语境里更容易被理解与检索。","在有机化学中，ozone 对烯烃进行“臭氧化反应”（ozonolysis）会生成中间体（如 molozonide / ozonide），但日常英语里这个词多出现在专业化学材料中。"]}
{"word":"ozonide","summary":{"en":"An ozonide is a compound containing the ozonide ion (O3−) or, in organic chemistry, a reactive intermediate formed when ozone adds to a double bond.","zh":"ozonide 指含臭氧离子（O3−）的化合物；在有机化学中也可指臭氧加成到双键后形成的反应性中间体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains the ozonide ion (O3−), often formed as a salt of an alkali metal (such as potassium ozonide, KO3); in organic chemistry, the term can also refer to an ozonide intermediate formed when ozone reacts with a double bond.","zh":"臭氧化物；含有臭氧离子（O3−）的化合物，常见为碱金属的盐（如臭氧化钾 KO3）。在有机化学中也可指臭氧与双键反应时生成的臭氧化物中间体。"},"examples":[{"en":"Potassium ozonide (KO3) is an example of a salt containing the ozonide ion.","zh":"臭氧化钾（KO3）是含有臭氧离子的盐类例子。"},{"en":"During ozonolysis, an ozonide intermediate can form before it breaks down into smaller molecules.","zh":"在臭氧分解反应（ozonolysis）中，可能先形成臭氧化物（ozonide）中间体，随后再裂解成较小分子。"}]}],"synonyms":["ozonide salt","O3− compound"],"phonetic":"ˈoʊzəˌnaɪd","extraExplanation":["“ozonide”在不同化学语境里指的东西略有差别：无机化学里更常指含 O3− 的离子化合物（如 KO3），而有机化学里常指臭氧加成到烯烃/炔烃后形成、随后会裂解的中间体（与“ozonolysis/臭氧裂解”相关）。这类物质通常反应性较强，实验室处理中需要注意安全规范。"]}
{"word":"ozonides","summary":{"en":"Ozonides are chemical compounds called “ozonides” (plural), either salts containing the ozonide ion (O3−) or ozonolysis products formed from ozone reacting with double bonds.","zh":"Ozonides（复数）指“臭氧化物”：可指含臭氧根离子（O3−）的盐/化合物，也可指臭氧与双键反应（臭氧分解）生成的产物/中间体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Salts or compounds that contain the ozonide ion (O3−), often formed when ozone reacts with certain metals; “ozonides” is the plural form of “ozonide.”","zh":"（化学）含有臭氧根离子（O3−）的盐或化合物，常由臭氧与某些金属反应生成；“ozonides”为“ozonide”的复数形式。"},"examples":[{"en":"Alkali-metal ozonides are highly reactive and must be handled carefully.","zh":"碱金属臭氧化物反应性很强，必须小心处理。"},{"en":"In a dry, cold environment, researchers can prepare ozonides for laboratory study.","zh":"在干燥、低温的环境中，研究人员可以制备用于实验研究的臭氧化物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) Compounds formed when ozone adds to a carbon–carbon double bond during ozonolysis; these intermediate products are also called ozonides.","zh":"（有机化学）臭氧分解反应（ozonolysis）中，臭氧加成到碳碳双键后形成的化合物（中间体），也称为臭氧化物。"},"examples":[{"en":"Ozonolysis can form ozonides before they break down into smaller carbonyl compounds.","zh":"臭氧分解反应可能先生成臭氧化物，然后再分解为较小的羰基化合物。"},{"en":"Because some ozonides can be unstable, chemists often avoid isolating them.","zh":"由于某些臭氧化物不稳定，化学家通常避免将其分离出来。"}]}],"synonyms":["ozonide compounds","ozonide salts (inorganic context)","ozonolysis ozonides (organic context)"],"phonetic":"/oʊˈzoʊnaɪdz/","extraExplanation":["“ozonide”在化学里有两类常见用法：①无机化学中的臭氧根盐（含O3−）；②有机反应“臭氧分解（ozonolysis）”过程里的加成中间体。具体指哪一种，通常要看上下文（是否谈到金属盐，或是否在讨论烯烃/双键反应）。","发音与拼写提示：词根来自“ozone（臭氧）+ -ide（表示阴离子或相关化合物的后缀）”。"]}
{"word":"ozoniferous","summary":{"en":"Ozoniferous means producing or containing ozone, often describing air with an ozone-like smell.","zh":"ozoniferous 指“产臭氧的/含臭氧的”，常用来形容带臭氧气味的空气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or containing ozone (O₃); associated with ozone or its smell, often in air after lightning or near certain electrical/chemical processes.","zh":"产臭氧的；含有臭氧的；与臭氧（O₃）或其气味有关的（常指雷雨后或某些电气/化学过程附近的空气）。"},"examples":[{"en":"After the thunderstorm, the air smelled faintly ozoniferous and clean.","zh":"雷雨过后，空气里有一种淡淡的臭氧味，闻起来很清新。"},{"en":"The lab uses an ozoniferous mixture for controlled oxidation experiments.","zh":"实验室使用一种产臭氧的混合物来进行可控的氧化实验。"}]}],"synonyms":["ozonic","ozonous","ozone-producing","ozone-rich"],"phonetic":"/oʊˌzoʊˈnɪfərəs/","extraExplanation":["词源提示：ozoniferous = ozone（臭氧）+ -ferous（“产生/携带”的意思，来自拉丁语 ferre“携带”）。","用法提示：这是较偏科学/技术写作的词，日常更常说 “ozone-rich air（富含臭氧的空气）” 或 “smell of ozone（臭氧味）”。","文化/自然场景：人们常把“雷电后那股清新刺鼻的味道”描述为臭氧味（ozone smell），不过实际也可能混合了其他化学物质的气味。"]}
{"word":"ozonification","summary":{"en":"Ozonification means treating something with ozone, often for disinfection or deodorizing.","zh":"Ozonification 指用臭氧对某物进行处理，常用于消毒或除味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of treating something with ozone (O₃), usually to disinfect, deodorize, or chemically change it (for example, in water treatment or air purification).","zh":"臭氧化：用臭氧（O₃）处理某物的过程，通常用于消毒、除味或使其发生化学变化（如水处理或空气净化）。"},"examples":[{"en":"Ozonification is used in some cities to disinfect drinking water without leaving a chlorine smell.","zh":"一些城市会用臭氧化来给饮用水消毒，而且不会留下氯味。"},{"en":"The company promoted ozonification as a way to reduce bacteria on food-processing equipment.","zh":"该公司宣传用臭氧化来减少食品加工设备上的细菌。"}]}],"synonyms":["ozonization","ozonisation","ozonation","ozone treatment"],"phonetic":"/ˌoʊ.zɑː.nə.fəˈkeɪ.ʃən/","extraExplanation":["“ozonification”是较偏专业、较少见的词，更常见的同义词是“ozonization”（美式）或“ozonisation”（英式）。","臭氧化常见于饮用水/污水处理、游泳池消毒、空气除味等场景；优点是残留少，但臭氧本身对呼吸道有刺激性，需要安全控制。","不要和“ozonation”混淆：两者都可指加入臭氧/进行臭氧处理，但具体用法会因学科与行业而异。"]}
{"word":"ozonify","summary":{"en":"Ozonify means to treat something with ozone, usually to disinfect or remove odors.","zh":"Ozonify 指用臭氧处理某物，通常用于消毒或除味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat or disinfect something by using ozone (O₃), often to remove odors or kill germs","zh":"用臭氧（O₃）处理或消毒某物，常用于除味或杀菌"},"examples":[{"en":"The company ozonified the water to reduce bacteria without adding chlorine.","zh":"该公司用臭氧处理水，以在不添加氯的情况下减少细菌。"},{"en":"Some gyms ozonify lockers overnight to help control smells.","zh":"一些健身房会在夜间用臭氧处理储物柜，以帮助控制异味。"}]}],"synonyms":["ozonate","ozone-treat","deodorize (contextual)","disinfect (contextual)"],"phonetic":"/oʊˈzoʊnəˌfaɪ/","extraExplanation":["“ozonify”由“ozone（臭氧）+ -ify（使变成／使具有……的）”构成，意思直观：让某物接受臭氧处理。","臭氧常用于水处理、食品加工设备消毒、空气除味等场景；但臭氧在高浓度下对人体有刺激性，实际使用通常需要专业设备与通风。","在更技术/行业化的语境里，也可能看到近义词“ozonate”或写法“ozone-treat”。"]}
{"word":"ozonise","summary":{"en":"Ozonise means to treat something with ozone, usually for disinfection or deodorizing.","zh":"ozonise 指用臭氧处理某物，通常用于消毒或除味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat (air, water, or a surface) with ozone in order to disinfect, deodorize, or oxidize impurities","zh":"用臭氧处理（空气、水或表面），以消毒、除味或氧化分解杂质"},"examples":[{"en":"The company ozonised the drinking water to kill bacteria without adding chlorine.","zh":"该公司用臭氧处理饮用水，在不加氯的情况下杀灭细菌。"},{"en":"Hospitals may ozonise rooms after contamination incidents to reduce odors and microbes.","zh":"医院在发生污染事件后可能会用臭氧处理房间，以减少异味和微生物。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become infused with ozone; to be ozonated (rare)","zh":"（罕见）变得含有臭氧；被臭氧化"},"examples":[{"en":"After the storm, the air seemed to ozonise near the coast.","zh":"暴风雨过后，海岸附近的空气似乎带上了臭氧味。"}]}],"synonyms":["ozonize","ozonate","disinfect (with ozone)","deodorize (with ozone)"],"phonetic":"/ˈoʊzoʊnaɪz/","extraExplanation":["“ozonise”是英式拼写；美式更常写作“ozonize”。两者意思相同。","臭氧（ozone）常用于水处理、空气净化与部分工业消毒，但高浓度臭氧会刺激呼吸道，因此相关设备与操作通常有安全规范。"]}
{"word":"ozonised","summary":{"en":"Ozonised means treated with ozone, often for disinfection or deodorizing.","zh":"ozonised 指“经臭氧处理的”，常用于消毒或除味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with ozone (O₃) to disinfect, deodorize, or chemically change something (such as water, air, or food).","zh":"用臭氧（O₃）处理过的（用于消毒、除味或使物质发生化学变化，如水、空气或食品）。"},"examples":[{"en":"The pool uses ozonised water to reduce the need for chlorine.","zh":"这个游泳池使用臭氧处理过的水，以减少对氯的需求。"},{"en":"Ozonised air can help remove certain odors in closed rooms.","zh":"臭氧处理过的空气可以帮助去除密闭房间里的某些异味。"}]},{"partOfSpeech":"v.","definition":{"en":"(past form of “ozonise/ozonize”) to treat something with ozone.","zh":"（“ozonise/ozonize”的过去式/过去分词）用臭氧处理某物。"},"examples":[{"en":"They ozonised the storage room overnight to control smells.","zh":"他们在夜间用臭氧处理了储藏室，以控制异味。"},{"en":"After the spill, the company ozonised the water before releasing it.","zh":"泄漏事件后，公司在排放之前对水进行了臭氧处理。"}]}],"synonyms":["ozonized","ozone-treated","disinfected (by ozone)"],"phonetic":"/ˈoʊzoʊˌnaɪzd/","extraExplanation":["“ozonised”是英式拼写；美式更常写作“ozonized”。两者意思相同。","臭氧常用于水处理与食品加工的消毒步骤，但在高浓度下会刺激呼吸道，因此相关设备通常需要专业操作与通风。"]}
{"word":"ozonises","summary":{"en":"“ozonises” means “treats with ozone” (BrE spelling of “ozonizes”).","zh":"“ozonises”意为“用臭氧处理/加入臭氧”（英式拼写，对应美式“ozonizes”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to treat something with ozone in order to disinfect, deodorize, or purify it.","zh":"（第三人称单数）用臭氧处理某物，以达到消毒、除味或净化的目的。"},"examples":[{"en":"The system ozonises the water to kill bacteria without adding chlorine.","zh":"该系统用臭氧处理水，以杀死细菌而无需添加氯。"},{"en":"This machine ozonises the room after a fire to reduce smoke smells.","zh":"这台机器在火灾后用臭氧处理房间，以减轻烟味。"}]},{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to add ozone to a substance or environment.","zh":"（第三人称单数）向某种物质或环境中加入臭氧。"},"examples":[{"en":"The device automatically ozonises the air when pollution levels rise.","zh":"当污染水平上升时，该设备会自动向空气中加入臭氧。"}]}],"synonyms":["ozonizes","treats with ozone","disinfects (with ozone)","deodorizes (with ozone)"],"phonetic":"/ˈoʊzoʊnaɪzɪz/","extraExplanation":["“ozonises”是英式拼写，对应美式“ozonizes”。词根来自“ozone（臭氧）”。在环保、饮用水处理、泳池管理、食品加工与除味等语境中更常见。"]}
{"word":"ozonising","summary":{"en":"Ozonising means treating something with ozone, often for disinfection or odor removal; it can also refer to the process itself.","zh":"ozonising 指用臭氧对某物进行处理（常用于消毒或除味），也可指这一处理过程本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of treating air, water, or a material with ozone (O₃) to disinfect, remove odors, or bleach","zh":"用臭氧（O₃）处理空气、水或材料的过程，用于消毒、除味或漂白"},"examples":[{"en":"Ozonising drinking water can reduce bacteria without leaving a strong chemical taste.","zh":"对饮用水进行臭氧处理可以减少细菌，而且不会留下明显的化学味。"},{"en":"The hotel used ozonising after a smoke incident to remove lingering odors.","zh":"酒店在发生烟雾事件后使用臭氧处理来去除残留气味。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of ozonise/ozonize: to treat something with ozone","zh":"ozonise/ozonize 的现在分词：用臭氧处理某物"},"examples":[{"en":"They are ozonising the storage room to kill mold.","zh":"他们正在对储藏室进行臭氧处理以杀死霉菌。"},{"en":"Ozonising equipment must be used carefully and with proper ventilation.","zh":"使用臭氧处理设备必须谨慎，并确保良好通风。"}]}],"synonyms":["ozone treatment","ozonation","ozonization","disinfecting (with ozone)"],"phonetic":"/ˈoʊzoʊnaɪzɪŋ/","extraExplanation":["“ozonising”更常见于英式拼写（-ise）；美式拼写通常是“ozonizing”（-ize）。两者意思相同。","臭氧具有强氧化性，常用于水处理、空气净化与工业漂白；但高浓度臭氧会刺激呼吸道，因此相关场景常会强调通风、限时、无人环境等安全措施。"]}
{"word":"ozonium","summary":{"en":"Ozonium is a chemistry term for the positively charged ozone-related ion, typically O3+.","zh":"Ozonium 是化学术语，指与臭氧相关的带正电离子，通常为 O3+。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A positively charged ion related to ozone, usually written as O3+, found in some chemical reactions or in salts under special conditions.","zh":"一种与臭氧有关的带正电离子，通常写作 O3+；在某些化学反应或特定条件下的盐类中出现。"},"examples":[{"en":"In advanced inorganic chemistry, you may see the ozonium ion written as O3+.","zh":"在较深入的无机化学中，你可能会看到“ozonium ion（臭氧鎓离子）”写作 O3+。"},{"en":"Ozonium compounds are discussed mostly in specialized research, not in everyday chemistry.","zh":"ozonium 化合物多见于专业研究讨论，而不是日常化学学习中。"}]}],"synonyms":["ozonium ion","O3+"],"phonetic":"/oʊˈzoʊniəm/","extraExplanation":["“ozonium”来自“ozone（臭氧）”加上表示离子的后缀“-ium”，常用于命名带电的化学物种。","不要把“ozonium”与“ozone（臭氧，O3）”混淆：ozone 是中性的分子，而 ozonium 指带正电的离子（常写作 O3+），语境通常更偏理论或研究文献。"]}
{"word":"ozonization","summary":{"en":"Ozonization is the process of using ozone to disinfect or oxidize substances, commonly in water/air treatment and in chemistry.","zh":"Ozonization 指用臭氧进行消毒或氧化的过程，常见于水/空气处理与化学反应中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of treating something (especially water or air) with ozone to disinfect, remove odors, or break down pollutants","zh":"臭氧化：用臭氧处理某物（尤指水或空气）的过程，以消毒、除臭或分解污染物"},"examples":[{"en":"Many cities use ozonization to improve the taste and safety of drinking water.","zh":"许多城市使用臭氧化来改善饮用水的口感与安全性。"},{"en":"Ozonization can reduce certain odors in wastewater treatment.","zh":"在污水处理中，臭氧化可以降低某些异味。"},{"en":"After ozonization, the water is filtered again before it enters the distribution system.","zh":"臭氧化之后，水在进入供水管网前会再次过滤。"}]},{"partOfSpeech":"n.","definition":{"en":"a chemical reaction in which ozone causes oxidation (especially in organic compounds)","zh":"（化学）臭氧引发的氧化反应过程（尤指对有机化合物）"},"examples":[{"en":"In the lab, ozonization of alkenes can produce different products after further steps.","zh":"在实验室里，烯烃的臭氧化在后续步骤后可生成不同产物。"},{"en":"The researcher measured the ozonization rate under controlled temperature and pressure.","zh":"研究人员在控制温度与压力的条件下测量臭氧化速率。"}]}],"synonyms":["ozone treatment","ozonation","oxidation (in chemistry context)"],"phonetic":"ˌoʊzoʊnəˈzeɪʃən","extraExplanation":["“ozonization”也常拼作“ozonisation”（英式拼写）。","在环保与公共卫生语境中，它常指水处理/空气净化中的“臭氧消毒”。臭氧反应后通常会分解为氧气，因此相较某些含氯消毒方式，可能减少某些持久性副产物；但具体效果与副产物取决于水质与工艺。"]}
{"word":"ozonize","summary":{"en":"Ozonize means to treat something with ozone for disinfection/deodorizing, or to generate ozone.","zh":"Ozonize 指用臭氧处理以消毒除味，或指生成臭氧。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat something with ozone (O₃) to disinfect, deodorize, or remove contaminants","zh":"用臭氧（O₃）处理（某物），以消毒、除味或去除污染物"},"examples":[{"en":"The company ozonized the water to kill bacteria without using chlorine.","zh":"这家公司用臭氧处理水，以在不使用氯的情况下杀死细菌。"},{"en":"Some hotels ozonize rooms after smoking or mildew odors are reported.","zh":"有些酒店在接到烟味或霉味报告后，会用臭氧处理房间除味。"},{"en":"The lab ozonized the equipment to reduce germs before the experiment.","zh":"实验前，实验室用臭氧处理设备以减少细菌。"}]},{"partOfSpeech":"v.","definition":{"en":"to produce or generate ozone","zh":"产生或生成臭氧"},"examples":[{"en":"Certain devices ozonize the air by creating ozone from oxygen.","zh":"某些设备会把氧气转化为臭氧，从而在空气中生成臭氧。"},{"en":"High-voltage discharge can ozonize the surrounding air.","zh":"高压放电会使周围空气产生臭氧。"}]}],"synonyms":["ozonate","disinfect","deodorize","sanitize"],"phonetic":"ˈoʊzəˌnaɪz","extraExplanation":["“ozonize”常见于水处理、空气净化、工业消毒等语境。臭氧有强氧化性，能杀菌除味，但在高浓度下会刺激呼吸道；日常使用相关设备时应注意通风与安全说明。","词形来自“ozone（臭氧）+ -ize（使……化/使成为）”。在英语中也可见拼写变体“ozonise”（英式拼写）。"]}
{"word":"ozonized","summary":{"en":"Ozonized means treated with ozone, commonly for disinfection, deodorizing, or cleaning/bleaching.","zh":"ozonized 指「經臭氧處理的」，常用於消毒、除臭或清潔／漂白。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Treated with ozone (O₃), usually to disinfect, remove odors, or help bleach/clean something (such as water, air, or fabric).","zh":"經過臭氧（O₃）處理的；通常用於消毒、除臭，或幫助漂白／清潔（如水、空氣或織物）。"},"examples":[{"en":"The swimming pool uses ozonized water to reduce the smell of chlorine.","zh":"這座游泳池使用臭氧處理過的水，來減少氯的味道。"},{"en":"After the room was ozonized, the smoke odor was much weaker.","zh":"房間經過臭氧處理後，煙味淡了很多。"},{"en":"Some factories use ozonized air in certain cleaning steps.","zh":"有些工廠在某些清潔步驟中會使用臭氧處理過的空氣。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having ozone added or infused into something.","zh":"加入／注入臭氧的。"},"examples":[{"en":"The clinic advertises ozonized oils for skincare.","zh":"那家診所宣傳用於護膚的臭氧油。"},{"en":"They sealed the bag with ozonized gas to help control bacteria.","zh":"他們用含臭氧的氣體封袋，以幫助控制細菌。"}]}],"synonyms":["ozone-treated","ozone-processed","disinfected (context-dependent)"],"phonetic":"/ˈoʊzoʊnaɪzd/","extraExplanation":["「ozonized」多見於水處理（飲用水、泳池）、空氣除味、食品與醫療/保健品宣傳等語境。學習時可把它理解為「用臭氧處理過」。","注意：臭氧在高濃度下會刺激呼吸道並有害健康，因此「臭氧消毒/除味」通常需要專業設備、控制濃度並在通風後再進入空間。"]}
{"word":"ozonizer","summary":{"en":"An ozonizer is a device that generates ozone, commonly for deodorizing or disinfection.","zh":"ozonizer 指产生臭氧的设备，常用于除味或消毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that produces ozone (O₃), often used to remove odors, disinfect air or water, or treat industrial processes.","zh":"臭氧发生器；一种产生臭氧（O₃）的设备，常用于除味、空气/水消毒或工业处理。"},"examples":[{"en":"The hotel used an ozonizer to remove smoke odors from the room.","zh":"酒店用臭氧发生器去除房间里的烟味。"},{"en":"Some water systems add an ozonizer to help disinfect the water without chlorine smell.","zh":"一些供水系统会加装臭氧发生器，以帮助消毒并减少氯味。"}]}],"synonyms":["ozone generator","ozone machine"],"phonetic":"/ˈoʊzəˌnaɪzər/","extraExplanation":["“ozonizer”在日常与商业语境中也常被称为“ozone generator（臭氧机/臭氧发生器）”。","注意：臭氧对呼吸道有刺激性。在有人或宠物在场的空间使用臭氧设备可能不安全；应遵循当地法规与产品说明，并确保充分通风。"]}
{"word":"ozonizers","summary":{"en":"Ozonizers are devices that generate ozone, commonly used for deodorizing or disinfecting air or water.","zh":"ozonizers 指“臭氧发生器”（复数），用于产生臭氧，常见用途是除味或对空气/水进行消毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or machine that produces ozone (O₃), often used to remove odors or to disinfect air or water.","zh":"臭氧发生器；产生臭氧（O₃）的设备，常用于除味、空气或水的消毒。"},"examples":[{"en":"The hotel used ozonizers to remove smoke odors from some rooms.","zh":"这家酒店用臭氧发生器来去除部分房间的烟味。"},{"en":"Some water-treatment systems include ozonizers to help kill bacteria.","zh":"一些水处理系统会配备臭氧发生器来帮助杀灭细菌。"}]}],"synonyms":["ozone generator","ozone machine","ozonator"],"phonetic":"/ˈoʊzoʊˌnaɪzɚ/","extraExplanation":["“ozonizers”是“ozonizer”的复数形式。","臭氧有较强的氧化性：能除味、消毒，但在高浓度下也会刺激呼吸道。使用臭氧发生器时要注意通风、遵循说明，并避免人在密闭空间内长时间暴露。"]}
{"word":"ozonizes","summary":{"en":"“Ozonizes” means “treats something with ozone,” usually for disinfection or odor removal.","zh":"“ozonizes”表示“用臭氧处理（某物）”，通常用于消毒或除味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “ozonize”: to treat something with ozone (O₃) in order to disinfect, deodorize, or clean it.","zh":"“ozonize”的第三人称单数：用臭氧（O₃）处理某物，以进行消毒、除味或清洁。"},"examples":[{"en":"The system ozonizes the water before it enters the swimming pool.","zh":"该系统在水进入游泳池之前用臭氧处理水。"},{"en":"This machine ozonizes rooms to remove lingering odors after a fire.","zh":"这台机器会对房间进行臭氧处理，以去除火灾后的残留气味。"}]},{"partOfSpeech":"v.","definition":{"en":"to turn into ozone or cause oxygen to form ozone (less common in everyday English; used more in scientific contexts).","zh":"（较少见，多用于科学语境）变成臭氧，或使氧气形成臭氧。"},"examples":[{"en":"Under certain conditions, electrical discharge ozonizes the surrounding oxygen.","zh":"在某些条件下，电放电会使周围的氧气生成臭氧。"}]}],"synonyms":["disinfects","deodorizes","sanitizes","purifies"],"phonetic":"/ˈoʊzəˌnaɪz/","extraExplanation":["“ozonize”常见于水处理、食品加工、医疗/清洁设备等领域，表示“用臭氧进行处理”。臭氧杀菌能力强，但也可能刺激呼吸道，因此实际使用会强调通风、浓度与安全规范。","英式拼写常见为“ozonise”；美式更常用“ozonize”。"]}
{"word":"ozonizing","summary":{"en":"“Ozonizing” means treating something with ozone, often for disinfection or deodorizing.","zh":"“ozonizing”指用臭氧进行处理，常用于消毒或除臭。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treating something with ozone (O₃) to disinfect, deodorize, or remove color/impurities.","zh":"用臭氧（O₃）处理（如消毒、除臭、脱色或去除杂质）。"},"examples":[{"en":"The company is ozonizing the water to kill bacteria without adding chlorine.","zh":"这家公司用臭氧处理水，以在不添加氯的情况下杀灭细菌。"},{"en":"Ozonizing the room can reduce odors, but it should be done carefully.","zh":"用臭氧处理房间可以减少异味，但必须谨慎进行。"}]},{"partOfSpeech":"v.","definition":{"en":"(chemistry) converting oxygen into ozone, or increasing ozone levels in a gas mixture.","zh":"（化学）把氧转化为臭氧，或提高气体混合物中的臭氧含量。"},"examples":[{"en":"The device is ozonizing oxygen with an electrical discharge.","zh":"该装置用电放电把氧气转化为臭氧。"}]}],"synonyms":["ozone-treating","ozonation (related noun)","ozone treatment"],"phonetic":"/ˈoʊzəˌnaɪzɪŋ/","extraExplanation":["“ozonizing”是动词 ozonize 的现在分词/动名词形式，常见于水处理、食品加工、空气净化等语境，也会写作 ozonising（英式拼写）。","臭氧具有强氧化性：在消毒除味方面很有效，但高浓度臭氧对人体呼吸道有刺激性；涉及“房间臭氧处理/臭氧发生器”时，通常意味着需要遵循安全规范（如无人环境、通风、检测浓度）。"]}
{"word":"ozonolysis","summary":{"en":"Ozonolysis is a reaction where ozone cleaves C=C (or C≡C) bonds to form smaller carbonyl-type products.","zh":"臭氧分解是用臭氧把碳碳双键（或三键）切断，生成较小的羰基类产物的反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical reaction in which ozone (O₃) breaks a carbon–carbon double bond (alkene) or triple bond (alkyne), producing smaller molecules such as aldehydes, ketones, or carboxylic acids after workup.","zh":"一种化学反应：臭氧（O₃）把碳—碳双键（烯烃）或三键（炔烃）“切开”，在后处理后生成较小分子，如醛、酮或羧酸。"},"examples":[{"en":"Ozonolysis is commonly used to identify where a double bond is located in an alkene.","zh":"臭氧分解常用于判断烯烃中双键的位置。"},{"en":"After ozonolysis and a reductive workup, the alkene can give aldehydes and ketones.","zh":"烯烃经过臭氧分解并进行还原性后处理后，可能生成醛和酮。"},{"en":"In organic synthesis, ozonolysis helps chemists cut a molecule into simpler carbonyl compounds.","zh":"在有机合成中，臭氧分解能把一个分子切割成更简单的羰基化合物。"}]}],"synonyms":["ozone cleavage"],"phonetic":"/oʊˌzoʊˈnɑːləsɪs/","extraExplanation":["词源与构词：ozone（臭氧）+ -lysis（分解、裂解）。很多化学名词里，-lysis 都表示“把某种键或结构裂开”。","常见“后处理”(workup)：还原性后处理（如用二甲基硫 DMS 或 Zn/AcOH）通常得到醛/酮；氧化性后处理（如 H2O2）更容易把醛进一步氧化成羧酸。不同条件会改变产物类型。","使用语境：这是有机化学教材与实验论文中很常见的术语，日常英语里几乎不用。写作中常见搭配有 “ozonolysis of alkenes”、“reductive/oxidative workup”。"]}
{"word":"ozonometer","summary":{"en":"An ozonometer is a device for measuring ozone levels.","zh":"ozonometer 指用于测量臭氧浓度/水平的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the amount or concentration of ozone (O₃) in air or another sample.","zh":"用来测量空气或其他样本中臭氧（O₃）含量/浓度的仪器。"},"examples":[{"en":"The researchers installed an ozonometer on the rooftop to track ozone levels during summer.","zh":"研究人员在屋顶安装了臭氧测量仪，以追踪夏季的臭氧水平。"},{"en":"High readings on the ozonometer can indicate a risk of smog-related air pollution.","zh":"臭氧测量仪读数偏高可能表示存在与烟雾（光化学污染）相关的空气污染风险。"}]}],"synonyms":["ozone monitor","ozone analyzer","ozone meter"],"phonetic":"/oʊˈzoʊnɑːmɪtɚ/","extraExplanation":["“ozonometer”是由“ozone（臭氧）+ -meter（测量仪）”构成的复合词，常见于大气科学、环境监测与实验室检测语境。","在更日常或技术文件中，你也可能看到更常用的说法，如“ozone monitor（臭氧监测仪）”或“ozone analyzer（臭氧分析仪）”，含义相近但设备原理可能不同。"]}
{"word":"ozonometry","summary":{"en":"Ozonometry means measuring ozone, especially ozone concentration for scientific or environmental purposes.","zh":"Ozonometry 指对臭氧（尤其是臭氧浓度）进行测量，常见于科学或环境监测语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of ozone (especially ozone concentration in air or water), usually for scientific or environmental monitoring","zh":"臭氧测量；臭氧浓度测定（多用于空气或水中的臭氧监测，属科学/环境领域用语）"},"examples":[{"en":"Ozonometry is used to track changes in urban air quality during summer smog season.","zh":"在夏季光化学烟雾季，臭氧测量常用于追踪城市空气质量的变化。"},{"en":"The lab performed ozonometry to confirm that the sterilization chamber reached the required ozone level.","zh":"实验室进行了臭氧测定，以确认消毒舱达到了所需的臭氧浓度。"}]}],"synonyms":["ozone measurement","ozone monitoring","ozone analysis"],"phonetic":"/ˌoʊzoʊˈnɑːmətri/","extraExplanation":["“ozonometry”较少见，更多时候你会在科研或环境报告中看到更常用的说法，如“ozone measurement / ozone monitoring（臭氧测量/监测）”。","词源可拆为“ozone（臭氧）+ -metry（测量）”，与“thermometry（测温）”“ometry/metry（测量学）”构词方式相同。","在环境科学中常与地面臭氧（ground-level ozone，对健康有害）和臭氧层臭氧（stratospheric ozone，能阻挡紫外线）区分使用。"]}
{"word":"ozonoscope","summary":{"en":"An ozonoscope is a device used to detect ozone in the air.","zh":"ozonoscope 指用于检测空气中臭氧的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to detect the presence of ozone (O₃) in air, sometimes indicating its approximate level.","zh":"臭氧检测器；用于检测空气中是否存在臭氧（O₃），有时也可粗略判断其浓度的仪器。"},"examples":[{"en":"The technician used an ozonoscope to check for ozone leaks near the generator.","zh":"技术员用臭氧检测器检查发生器附近是否有臭氧泄漏。"},{"en":"In older laboratory notes, an ozonoscope is mentioned as a simple way to confirm ozone in the room.","zh":"在较早的实验室记录中，提到用臭氧检测器作为确认室内有臭氧的一种简便方法。"}]}],"synonyms":["ozone detector","ozone monitor","ozone sensor"],"phonetic":"/oʊˈzoʊnəˌskoʊp/","extraExplanation":["这是一个较少见、偏历史/技术领域的词。现代环境监测更常用“ozone detector / ozone monitor（臭氧检测仪/监测仪）”，并以 ppb（十亿分之一）或 ppm（百万分之一）等单位显示浓度。","词形可拆解为：ozono-（臭氧）+ -scope（观察/检测的器具，如 microscope 显微镜、telescope 望远镜）。"]}
{"word":"ozonoscopic","summary":{"en":"Ozonoscopic means “related to detecting or measuring ozone,” often in older scientific contexts.","zh":"ozonoscopic 指“与臭氧的检测或测量有关”，多用于较早期的科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to an ozonoscope (a device or method used to detect or measure ozone in the air).","zh":"与臭氧检测器（ozonoscope，用来检测或测量空气中臭氧的装置或方法）有关的。"},"examples":[{"en":"The scientist recorded ozonoscopic readings each morning to track changes in the air.","zh":"科学家每天早晨记录臭氧检测读数，以追踪空气变化。"},{"en":"Early reports described ozonoscopic tests using chemical papers that changed color.","zh":"早期报告描述了使用会变色的化学试纸进行臭氧检测的测试。"}]}],"synonyms":["ozone-detecting","ozone-monitoring","ozone-measuring"],"phonetic":"/ˌoʊzoʊnəˈskɑpɪk/","extraExplanation":["“ozonoscopic”比较罕见，多见于较早期的科学/气象学文献。现代英语更常说“ozone monitoring / ozone measurement / ozone detection（臭氧监测/测量/检测）”。","词形来源可拆解为：ozone（臭氧）+ -scopic（与观察/检测有关，类似 microscope 的 -scope）。"]}
{"word":"ozonosphere","summary":{"en":"The ozonosphere is the ozone-rich region of the atmosphere (the ozone layer) that protects Earth by absorbing harmful UV radiation.","zh":"ozonosphere 指大气中富含臭氧的区域（即臭氧层），通过吸收有害紫外线来保护地球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the layer of Earth’s atmosphere (mainly in the stratosphere) that contains a relatively high amount of ozone (O₃) and helps block harmful ultraviolet (UV) radiation from the Sun","zh":"臭氧层；（主要位于平流层的）大气层中臭氧（O₃）含量较高的一层，可吸收/阻挡太阳的有害紫外线"},"examples":[{"en":"Scientists monitor the ozonosphere to understand how well it is recovering.","zh":"科学家监测臭氧层，以了解它恢复得如何。"},{"en":"Damage to the ozonosphere can increase the risk of skin cancer because more UV radiation reaches the ground.","zh":"臭氧层受损会增加皮肤癌风险，因为更多紫外线会到达地面。"},{"en":"International agreements helped reduce chemicals that were harming the ozonosphere.","zh":"国际协定帮助减少了破坏臭氧层的化学物质。"}]}],"synonyms":["ozone layer","ozone region"],"phonetic":"/oʊˈzoʊnəˌsfɪr/","extraExplanation":["“ozonosphere”由“ozone（臭氧）+ -sphere（圈/层）”构成，常被当作“ozone layer（臭氧层）”的同义词使用。在日常科普与新闻中，“ozone layer”更常见。","臭氧层主要位于平流层，并不是一层“实体外壳”，而是指臭氧相对集中的区域；它对生命重要，因为能吸收大部分UV-B和UV-C紫外线。","注意区分：高空的臭氧对人体有保护作用；但地面附近的臭氧是空气污染物（形成“光化学烟雾”），对呼吸系统有害。"]}
{"word":"ozonospheric","summary":{"en":"Ozonospheric means “related to the ozone-rich region of the upper atmosphere (the ozone layer).”","zh":"ozonospheric 指“与上层大气中富含臭氧的区域（臭氧层）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the ozonosphere (the ozone-rich region of Earth’s upper atmosphere, especially in the stratosphere).","zh":"与臭氧层（地球上层大气中富含臭氧的区域，主要在平流层）有关的。"},"examples":[{"en":"Scientists measured ozonospheric ozone levels to track recovery of the ozone layer.","zh":"科学家测量臭氧层中的臭氧含量，以追踪臭氧层的恢复情况。"},{"en":"Ozonospheric chemistry is strongly affected by sunlight and certain pollutants.","zh":"臭氧层化学过程会受到阳光和某些污染物的强烈影响。"}]}],"synonyms":["ozone-layer","stratospheric (in context)","atmospheric (broader)"],"phonetic":"/ˌoʊzoʊnəˈsfɪrɪk/","extraExplanation":["“Ozonospheric”来自“ozone（臭氧）+ -spheric（与‘大气层/球层’有关的）”。在现代英语里更常见的说法是“ozone-layer (ozone layer)”或“stratospheric（平流层的）”，所以你在科普文章中更可能看到“ozone-layer depletion（臭氧层消耗）”而不是“ozonospheric depletion”。"]}
{"word":"ozonous","summary":{"en":"Ozonous means “ozone-like” or “containing ozone,” often used for air with a sharp, fresh smell (a less common word).","zh":"ozonous 意为“含臭氧的/臭氧般的”，常形容空气中清冽略刺鼻的气味（较少见的用词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having, containing, or relating to ozone; ozone-like (often describing air with a sharp, fresh smell).","zh":"含有臭氧的；与臭氧有关的；带有类似臭氧的（常指空气中那种清冽、略刺鼻的气味）。"},"examples":[{"en":"After the thunderstorm, the air smelled faintly ozonous.","zh":"雷雨过后，空气里隐约有一股臭氧般的气味。"},{"en":"The lab monitored ozonous gases to protect workers’ health.","zh":"实验室监测含臭氧的气体，以保护工作人员的健康。"},{"en":"Some people describe the scent near electrical equipment as ozonous.","zh":"有些人把电气设备附近的气味形容为“臭氧味”。"}]}],"synonyms":["ozonic","ozone-rich","ozone-containing"],"phonetic":"/oʊˈzoʊnəs/","extraExplanation":["“ozonous”较少见，更常用的是“ozonic”或直接说“ozone-rich / containing ozone（富含/含有臭氧的）”。","很多人把雷雨后或电火花附近那种“清冽又有点刺鼻”的气味叫作“臭氧味”，但现实中这种气味也可能混有其他化学物质；在健康语境里，高浓度臭氧对呼吸道有刺激性。"]}
{"word":"ozophen","summary":{"en":"“Ozophen” is not a common dictionary English word; it’s likely a misspelling or a specialized name/term.","zh":"“ozophen”不是常见词典词汇；更可能是拼写错误或某种专门名称/术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; it may be a misspelling, a brand/trade name, or a highly specialized technical term.","zh":"不是标准英语词汇；可能是拼写错误、商标/商品名，或非常专业的术语。"},"examples":[{"en":"I couldn’t find “ozophen” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“ozophen”——你能把看到它的句子发我吗？"},{"en":"If you meant “ozone,” the spelling is different: ozone.","zh":"如果你想写的是“ozone（臭氧）”，拼写不一样：ozone。"}]}],"phonetic":"ˈoʊzəfɛn","extraExplanation":["“ozophen”在常见英语语料与权威词典中非常少见/几乎不存在，因此更可能是：\n1）拼写误差（例如想写 ozone / phenol / ozophene 等）；\n2）某个产品名、药品名或化学品商品名（这类词往往不收录在普通词典里）；\n3）来自特定领域的内部缩写。\n\n如果你提供来源（书/论文/网站链接）或上下文句子，我可以帮你判断它具体指什么、是否该大写、以及更自然的英文表达。"]}
{"word":"ozophene","summary":{"en":"“Ozophene” is not a common English word; it’s likely a misspelling or a specialized name/term.","zh":"“ozophene”不是常见英语词；更可能是拼写错误或某个专门名称/术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a brand name, or a specialized scientific/medical term used in a specific context.","zh":"不是常见英语词典中的标准词；可能是拼写错误、品牌名，或某个特定科学/医学领域里的专用词。"},"examples":[{"en":"I searched several dictionaries, but I couldn’t find “ozophene.” Do you have a sentence with it?","zh":"我查了几本词典，但没找到“ozophene”。你能给我一个包含它的句子吗？"},{"en":"It might be a product name or a technical term from chemistry or medicine.","zh":"它可能是产品名，或来自化学/医学的技术术语。"}]}],"phonetic":"/ˈoʊzoʊfiːn/","extraExplanation":["“ozophene”很可能是拼写接近的词被写错了。你可以检查一下是否想写：ozone（臭氧）、azophene/azo-（与“偶氮”化合物相关的前缀或词根）、或某个药品/化学品的商品名。","如果你把它出现的上下文（例如一句话、图片、或来源领域：药品说明、化学论文、小说等）发我，我可以更准确判断它的含义与正确拼写。"]}
{"word":"ozostomia","summary":{"en":"Ozostomia is a medical term meaning bad breath (unpleasant mouth odor).","zh":"ozostomia 是“口臭”的医学术语，指口腔散发出的难闻气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bad breath; an unpleasant smell coming from the mouth (a medical term).","zh":"口臭；口腔散发出的难闻气味（医学用语）。"},"examples":[{"en":"The dentist explained that ozostomia can be caused by gum disease or dry mouth.","zh":"牙医解释说，口臭可能由牙龈疾病或口干引起。"},{"en":"If ozostomia lasts for weeks, it’s a good idea to see a dentist or doctor.","zh":"如果口臭持续数周，最好去看牙医或医生。"}]}],"synonyms":["halitosis","bad breath","mouth odor"],"phonetic":"/ˌoʊzoʊˈstoʊmiə/","extraExplanation":["这是一个较少见的医学术语，日常英语里更常用的是 halitosis（更正式）或 bad breath（更口语）。","词源上可理解为“气味 + 口腔”：来自希腊语根 ozo-（有气味/发臭）与 -stomia（口/口腔）。","学习与就医沟通时可用：persistent ozostomia（持续口臭）、oral hygiene（口腔卫生）、dry mouth/xerostomia（口干）、gum disease（牙龈疾病）。"]}
{"word":"ozotype","summary":{"en":"Ozotype is an early photographic printing process that produces durable, carbon-like prints using pigmented gelatin.","zh":"Ozotype（奥佐印相法）是一种早期摄影印相工艺，用含颜料的明胶制作耐久、类似碳素相片的印相。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a photographic printing process (early 1900s) that makes permanent images using pigmented gelatin and a light-sensitive chemical, producing a carbon-like print known for rich tones and durability","zh":"（早期摄影）奥佐印相法：一种20世纪初的摄影印相工艺，利用含颜料的明胶与感光化学物质制成影像，成品类似碳素相片，以色调浓郁、耐久著称"},"examples":[{"en":"The museum displayed portraits made with the ozotype process because the prints have lasted for more than a century.","zh":"博物馆展出了用奥佐印相法制作的人像，因为这些印相保存了一百多年。"},{"en":"She studies ozotype to understand how photographers achieved deep blacks before modern printing.","zh":"她研究奥佐印相法，以了解在现代印刷出现之前摄影师如何获得深邃的黑色层次。"}]}],"synonyms":["carbon print","pigment print"],"phonetic":"/ˈoʊzəˌtaɪp/","extraExplanation":["“Ozotype”主要出现在摄影史与暗房工艺文献中，属于较罕见的专业词。它与“carbon print（碳素印相）”同属耐久型颜料印相的传统路线，常被提及于19世纪末至20世纪初的影像印制技术演变。","词形中“ozo-”与“ozone（臭氧）”同源，源于希腊语，带有“有气味/与氧有关”的词根色彩；但在日常英语里几乎不会用到，更多是工艺名称。"]}
{"word":"ozs","summary":{"en":"“ozs” is an informal written abbreviation for “ounces” (plural of oz.), used for weight or volume on labels and recipes.","zh":"“ozs”是“ounces（盎司）”的非正式书面缩写，用于标签和食谱中表示重量或容量。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A written abbreviation meaning “ounces,” the plural of “oz.” It is used to show weight or volume (especially in recipes and product labels).","zh":"书面缩写，表示“盎司（ounces）”，是“oz.”的复数形式。常用于表示重量或容量（尤其在食谱、商品标签上）。"},"examples":[{"en":"Add 2 ozs of cheese to the salad.","zh":"在沙拉里加2盎司奶酪。"},{"en":"The label says the bottle contains 12 ozs.","zh":"标签上写着这瓶有12盎司。"},{"en":"I bought 8 ozs of coffee beans.","zh":"我买了8盎司咖啡豆。"}]}],"synonyms":["oz","ounces","fl oz (for fluid ounces)"],"phonetic":"/aʊns/","extraExplanation":["在正式英文里，更常见的写法是“oz”（既可表示单复数），例如“12 oz”。“ozs”属于更口语/非正式或随手记的写法。","“ounce/oz”在美国常见两种：重量的盎司（约28.35克）和液体盎司“fluid ounce/fl oz”（体积单位，约29.57毫升）。标签上如果写“fl oz”通常指液体体积。"]}
{"word":"ozzie","summary":{"en":"“Ozzie” is an informal word most often meaning an Australian (similar to “Aussie”), and it can also be a nickname like Ozzy/Oswald.","zh":"“Ozzie”多用于非正式场合，通常指“澳大利亚人/澳式的”（类似“Aussie”），也可作 Ozzy/Oswald 等名字的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) An Australian person; someone from Australia.","zh":"（非正式）澳大利亚人；来自澳大利亚的人。"},"examples":[{"en":"She married an Ozzie she met while traveling in Sydney.","zh":"她在悉尼旅行时认识了一位澳大利亚人，后来结婚了。"},{"en":"A bunch of Ozzies were watching the cricket match at the pub.","zh":"一群澳大利亚人在酒吧看板球比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A nickname for someone named Ozzy/Oswald (sometimes used as a friendly personal name).","zh":"（非正式）Ozzy/Oswald 的昵称；也可作友好的名字称呼。"},"examples":[{"en":"Ozzie, can you help me carry these boxes?","zh":"Ozzie，你能帮我搬这些箱子吗？"},{"en":"His friends have called him Ozzie since high school.","zh":"从高中起，朋友们就叫他 Ozzie。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Australian; relating to Australia (less common than “Aussie”).","zh":"（非正式）澳大利亚的；与澳大利亚有关的（不如“Aussie”常见）。"},"examples":[{"en":"They cooked an Ozzie-style barbecue in the backyard.","zh":"他们在后院做了澳式烧烤。"}]}],"synonyms":["Aussie","Australian","Ozzy"],"phonetic":"/ˈɔzi/","extraExplanation":["“Ozzie”常被当作“Aussie”的另一种拼写（Aussie 是更常见的写法），意思是“澳大利亚人/澳大利亚的”。在口语或网络上你可能会看到 Ozzie/Aussie 混用，但在正式写作中通常用 “Australian”。","“Ozzy/Ozzie”也常见于人名昵称（例如歌手 Ozzy Osbourne）。具体含义要看语境：是在说国籍（澳洲人）还是在叫某个人的名字。"]}
{"word":"ozzy","summary":{"en":"Ozzy is usually a person’s nickname or name, and it often refers to the rock singer Ozzy Osbourne.","zh":"Ozzy 通常是人名/昵称；在流行文化中常指摇滚歌手 Ozzy Osbourne。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname or given name (short form of names like Oswald, Oscar, or Osmond).","zh":"昵称或名字（常见于 Oswald、Oscar、Osmond 等名字的简称）。"},"examples":[{"en":"His friends call him Ozzy, but his full name is Oscar.","zh":"朋友都叫他 Ozzy，但他的全名是 Oscar。"},{"en":"Ozzy is an informal name you might hear in English-speaking countries.","zh":"Ozzy 是英语国家里可能会听到的非正式名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(often referring to) Ozzy Osbourne, a famous British rock singer (lead singer of Black Sabbath).","zh":"（常指）奥兹·奥斯本（Ozzy Osbourne），著名英国摇滚歌手（Black Sabbath 黑色安息日乐队主唱）。"},"examples":[{"en":"Ozzy became famous in the 1970s with Black Sabbath.","zh":"Ozzy 在 1970 年代凭借 Black Sabbath 成名。"},{"en":"My dad loves Ozzy’s music.","zh":"我爸爸很喜欢 Ozzy 的音乐。"}]}],"synonyms":["(as a name)","Ozzy Osbourne","Aussie (similar-looking, different meaning)"],"phonetic":"/ˈɑzi/","extraExplanation":["“Ozzy”在英文里更多被当作人名/昵称使用，而不是普通词汇。最常见的文化指向是摇滚歌手 Ozzy Osbourne，因此在音乐语境中别人说“Ozzy”通常就是指他。","不要把“Ozzy”和“Aussie（澳大利亚人/澳洲的）”混淆：两者发音和拼写相近，但“Aussie”更常见、更标准。"]}

