{"word":"paba","summary":{"en":"PABA most commonly means para-aminobenzoic acid, a former common sunscreen ingredient now often avoided; it can also refer to a vitamin-like compound mentioned in older nutrition sources.","zh":"PABA最常指对氨基苯甲酸（曾常用于防晒霜、如今常被避开）；也可指旧营养资料中提到的类维生素成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"para-aminobenzoic acid: a chemical once commonly used in sunscreens to help absorb UVB sunlight; today it is used less often because it can irritate skin or cause allergic reactions in some people.","zh":"对氨基苯甲酸：一种化学物质，过去常用于防晒霜中以吸收UVB紫外线；如今较少使用，因为可能引起皮肤刺激或过敏。"},"examples":[{"en":"This sunscreen is labeled “PABA-free,” meaning it does not contain para-aminobenzoic acid.","zh":"这款防晒霜标注“无PABA”，意思是不含对氨基苯甲酸。"},{"en":"Some people avoid PABA because it can cause a rash on sensitive skin.","zh":"有些人会避免使用PABA，因为它可能让敏感肌起疹子。"}]},{"partOfSpeech":"n.","definition":{"en":"a vitamin-like substance sometimes grouped with the B vitamins in older sources, though it is not an essential vitamin for most people.","zh":"一种“类维生素”物质，旧资料中有时把它归为B族维生素的一员，但对多数人来说并非必需维生素。"},"examples":[{"en":"Older supplement labels may mention PABA as part of a “B-complex” blend.","zh":"较旧的保健品标签可能会把PABA写进“复合维生素B”的配方里。"}]}],"synonyms":["para-aminobenzoic acid","4-aminobenzoic acid"],"phonetic":"/ˈpeɪbə/","extraExplanation":["PABA常见读法是“PAY-buh”。在防晒领域，“PABA-free（不含PABA）”是很常见的标签，主要是为了降低致敏或染色（有时会让衣物变黄）的风险。","在医学与营养类文章里，PABA也可能出现在与叶酸（folic acid）相关的讨论中，但日常英语里最常见的语境仍是防晒霜或化学成分列表。"]}
{"word":"pabalum","summary":{"en":"Pabulum means nourishment, or (more commonly) easy, often shallow information or entertainment that “feeds” the mind.","zh":"Pabulum 指“营养/食物”，更常用于比喻：指“浅显、易消化（有时偏肤浅）的信息或娱乐内容”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food or nourishment (often used in a formal or literary way).","zh":"食物；营养（较正式或文学用法）。"},"examples":[{"en":"Milk is important pabulum for infants.","zh":"牛奶对婴儿来说是重要的营养来源。"},{"en":"The soup provided warm pabulum on a cold night.","zh":"在寒冷的夜晚，这碗汤提供了温暖的食物与补给。"}]},{"partOfSpeech":"n.","definition":{"en":"Intellectual or emotional “food”: information, ideas, or entertainment that feeds the mind (often suggesting it is easy, shallow, or meant for mass taste).","zh":"精神食粮：滋养头脑的信息、观点或娱乐内容（常带“浅显、迎合大众口味”的含义）。"},"examples":[{"en":"The article was more pabulum than serious analysis.","zh":"这篇文章更像是浅显的“精神快餐”，而不是严肃分析。"},{"en":"Some viewers want challenging films; others prefer light pabulum.","zh":"有些观众想看有挑战性的电影；另一些人更喜欢轻松浅显的娱乐。"},{"en":"The podcast offers daily pabulum for commuters.","zh":"这档播客为通勤者提供每日的轻量信息与消遣。"}]}],"synonyms":["nourishment","food","sustenance","fodder","brain food","banal entertainment"],"phonetic":"/ˈpæbjələm/","extraExplanation":["你输入的“pabalum”通常是拼写误差，常见正确拼写是 **pabulum**。","词源来自拉丁语 *pabulum*（意为“饲料、食物”）。现代英语里除了“食物/营养”，更常见的是比喻义：指“给大众的、容易消化的内容”，语气往往略带批评。","用法提示：在评论媒体、新闻、流行文化时常见，如 *media pabulum*（媒体的浅层内容）、*political pabulum*（流于表面的政治宣传/话术）。"]}
{"word":"pabble","summary":{"en":"“Pabble” is very rare; it’s usually a misspelling of “babble.” In some dialects it can mean “to paddle/splash in shallow water.”","zh":"“pabble”非常罕见；通常是把“babble”拼错了。在某些方言里也可指“在浅水里戏水/溅水”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Very rare / nonstandard) Often seen as a misspelling of “babble” (to talk in a fast, silly, or excited way).","zh":"（非常少见/非标准）常被当作“babble”的拼写错误（指喋喋不休、语无伦次或兴奋地说个不停）。"},"examples":[{"en":"If you meant “babble,” it’s spelled with a B: The kids began to babble excitedly.","zh":"如果你想写的是“babble”，首字母应为B：孩子们兴奋地叽叽喳喳说个不停。"},{"en":"Sorry, I was babbling—I’m just nervous.","zh":"抱歉，我刚才有点语无伦次——我只是紧张。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Dialect, rare) To paddle or dabble in shallow water; to splash about.","zh":"（方言/罕见）在浅水里趟水、戏水；扑腾溅水。"},"examples":[{"en":"They pabble in the stream near the bank on hot days.","zh":"炎热的日子里，他们会在溪边浅水处戏水。"}]}],"synonyms":["babble","chatter","prattle","ramble","splash","paddle"],"phonetic":"/ˈpæbəl/","extraExplanation":["“pabble”在现代标准英语里几乎不用；日常写作中最常见的情况是把“babble”（喋喋不休）误拼成了“pabble”。如果你是在某本旧书、地方口语或方言材料里看到它，才可能是“在浅水里戏水/趟水”的意思。","如果你告诉我你看到“pabble”的句子或上下文，我可以帮你判断它到底是拼写错误还是方言用法。"]}
{"word":"Pablo","summary":{"en":"“Pablo” is a common Spanish male name (like “Paul” in English).","zh":"“Pablo”是常见的西班牙语男性名字（类似英文名 Paul）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish male given name (the Spanish form of “Paul”); also used as a surname in some contexts.","zh":"“Pablo”是一个西班牙语男性名字（相当于英文名 Paul）；在某些情况下也可作姓氏。"},"examples":[{"en":"Pablo is my classmate from Mexico.","zh":"Pablo 是我来自墨西哥的同学。"},{"en":"Pablo called me after work.","zh":"Pablo 下班后给我打了电话。"}]}],"synonyms":["Paul (English equivalent)"],"phonetic":"ˈpɑbloʊ","extraExplanation":["“Pablo”来自拉丁语名字“Paulus”（意为“矮小的、谦逊的”），在西班牙语世界很常见。英语里通常不翻译名字，但在介绍时可以补充国籍或地区，帮助听者理解发音与文化背景。","你可能会在文化与历史中遇到一些著名的 Pablo，例如画家 Pablo Picasso（巴勃罗·毕加索）。当别人说“Pablo”时，通常需要根据上下文判断指的是具体哪一位。"]}
{"word":"pablo","summary":{"en":"Pablo is a common Spanish male name (the Spanish form of Paul) and can also be a surname.","zh":"Pablo是常见的西班牙语男性名字（相当于英文名Paul/保罗），也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name common in Spanish-speaking cultures (the Spanish form of “Paul”).","zh":"男性名字，常见于西班牙语文化中（相当于英文名“Paul/保罗”的西语形式）。"},"examples":[{"en":"My friend Pablo is from Mexico City.","zh":"我的朋友巴勃罗来自墨西哥城。"},{"en":"Pablo’s English is improving quickly.","zh":"巴勃罗的英语进步很快。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name), often in Spanish-speaking contexts.","zh":"姓氏（家族姓），常见于西班牙语语境中。"},"examples":[{"en":"Ms. Pablo will call you back this afternoon.","zh":"巴勃罗女士今天下午会回你电话。"}]}],"synonyms":["Paul","Paolo","Paúl"],"phonetic":"/ˈpɑbloʊ/","extraExplanation":["“Pablo”源自拉丁语名字“Paulus”（意为“渺小/谦卑”），通过西班牙语演变而来，对应英文名“Paul”。","在文化语境中，“Pablo”常让人联想到一些知名人物，如画家Pablo Picasso（毕加索）与诗人Pablo Neruda（聂鲁达）。不同地区发音会略有差异，但在美式英语中常读作 /ˈpɑbloʊ/。"]}
{"word":"pablum","summary":{"en":"Pablum means bland baby food, and figuratively it means dull, oversimplified content that’s easy to accept without thinking.","zh":"pablum 原指婴儿的清淡软食；引申为“乏味、过度简化、让人不动脑就接受”的内容（贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"soft, bland food for babies; (also) any simple, easily swallowed food","zh":"婴儿吃的软烂、清淡食物；（也可指）容易下咽的清淡食物"},"examples":[{"en":"The doctor suggested starting the baby on pablum and pureed fruit.","zh":"医生建议先让宝宝吃婴儿米糊一类的软食，再配合水果泥。"},{"en":"After the surgery, he could only manage pablum and soup for a few days.","zh":"手术后那几天，他只能吃些软烂清淡的东西和汤。"}]},{"partOfSpeech":"n.","definition":{"en":"ideas, writing, or entertainment that is dull, oversimplified, and meant to be accepted easily without thinking","zh":"（贬义）乏味、过度简化、让人不加思考就接受的观点/文字/娱乐内容；“精神快餐”"},"examples":[{"en":"The critic dismissed the movie as pablum—pretty to look at but empty.","zh":"影评人把这部电影斥为“精神快餐”——画面好看却空洞。"},{"en":"He was tired of political pablum and wanted real answers.","zh":"他厌倦了政治上的空话套话，想要真正的答案。"}]}],"synonyms":["baby food","gruel","bland fare","drivel","pap","fluff","tripe"],"phonetic":"/ˈpæbləm/","extraExplanation":["“pablum”最初是一个商标名（指一种婴儿谷物食品），后来在英语里逐渐泛化为普通名词。","比喻义常用于批评媒体内容：意思是“像婴儿食物一样被处理得很软很淡”，强调缺乏深度、营养或挑战性。","语域偏书面、偏评论/批评场景；口语里更常说“junk”或“fluff”，但“pablum”更带“过度幼稚化/被喂食”的讽刺味。"]}
{"word":"pabouch","summary":{"en":"“Pabouch” is not a standard English word; it is probably “babouche,” meaning a traditional backless leather slipper.","zh":"“pabouch”不是标准英语词；更可能是“babouche”，指传统的无后跟皮质拖鞋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of **babouche**) a soft, backless slipper, often made of leather, traditionally worn in North Africa and the Middle East.","zh":"（可能是 **babouche** 的拼写错误）一种柔软的无后跟拖鞋，常用皮革制作，传统上见于北非和中东地区。"},"examples":[{"en":"She bought a pair of leather babouches at the market in Marrakech.","zh":"她在马拉喀什的集市买了一双皮质 babouche 拖鞋。"},{"en":"He slipped off his shoes and walked around the house in babouches.","zh":"他脱下鞋子，穿着 babouche 拖鞋在屋里走动。"}]}],"synonyms":["slipper","mule (shoe)","loafer (some styles)"],"phonetic":"/bəˈbuːʃ/","extraExplanation":["“babouche”常见于英语中，源自法语 *babouche*，而法语又借自阿拉伯语（与“拖鞋/软鞋”相关的词根）。在旅行写作、时尚与手工艺语境里比较常见。","如果你原本想表达的是别的词（例如 *pouch* 小袋子，或 *babushka* 头巾/奶奶），告诉我你想用它造句的语境，我可以帮你确认正确拼写和用法。"]}
{"word":"pabular","summary":{"en":"Pabular means “related to nourishment/food,” and it can also describe ideas or entertainment that “feed” the mind (often in a slightly formal or critical tone).","zh":"pabular 指“与食物/营养有关的”，也可比喻“滋养思想的”（常带书面或略带批评的语气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to food or nourishment; providing something that “feeds” (the body or the mind)","zh":"与食物或营养有关的；（比喻）能“滋养”（身体或思想）的"},"examples":[{"en":"The doctor recommended a more pabular diet with plenty of vegetables and protein.","zh":"医生建议采用更有营养的饮食，多吃蔬菜和蛋白质。"},{"en":"Some critics say the show offers pabular entertainment—pleasant but not very thoughtful.","zh":"一些评论家认为这部剧提供的是“营养不高”的消遣——轻松好看，但不太发人深省。"}]}],"synonyms":["nourishing","nutritious","nutrient","alimentative","sustaining"],"phonetic":"/ˈpæbjələr/","extraExplanation":["“pabular”比较少见，带有书面语/学术语气。更常见的表达是 nourishing（有营养的）、nutritious（营养丰富的）、food-related（与食物有关的）。","词源上与拉丁语 pabulum（食物、饲料）有关，所以它既可指真实的“营养/食物”，也常被用作比喻，指“精神食粮”（如书籍、艺术、信息等）。"]}
{"word":"pabulary","summary":{"en":"“Pabulary” is not standard; it’s usually a misspelling of “vocabulary,” meaning the words someone knows or uses.","zh":"“pabulary”不是标准英语，通常是“vocabulary”的误拼；“vocabulary”指一个人掌握/使用的词汇或某领域的词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling or mishearing of “vocabulary.” It is not a standard English word.","zh":"“vocabulary”的常见拼写错误或误听形式；不是标准英语单词。"},"examples":[{"en":"I think you meant “vocabulary,” not “pabulary.”","zh":"我想你是想写“vocabulary”，不是“pabulary”。"},{"en":"To improve your vocabulary, read a little every day.","zh":"要提升词汇量，每天读一点东西。"}]},{"partOfSpeech":"n.","definition":{"en":"(Correct word) “Vocabulary”: the set of words a person knows or uses, or the words used in a particular subject or field.","zh":"（正确单词）“vocabulary”：一个人掌握或使用的词汇；或某个领域/学科使用的词汇。"},"examples":[{"en":"Her English vocabulary grew quickly after she moved to the U.S.","zh":"她搬到美国后，英语词汇量增长很快。"},{"en":"Medical vocabulary can be confusing at first.","zh":"医学词汇一开始可能会让人困惑。"},{"en":"This textbook teaches vocabulary through short stories.","zh":"这本教材通过短篇故事来教词汇。"}]}],"synonyms":["lexicon","word stock","terminology (for a field)","word list (contextual)"],"phonetic":"/voʊˈkæbjəˌlɛri/","extraExplanation":["“Vocabulary”来自拉丁语 vocabulum（“名称、词语”）。学习中常见搭配：build/expand/improve your vocabulary（扩大词汇量）；basic/advanced vocabulary（基础/高级词汇）；vocabulary list（词汇表）。"]}
{"word":"pabulation","summary":{"en":"Pabulation means nourishment—either literal food or (figuratively) mental/spiritual “food.” It’s a formal, literary word.","zh":"pabulation 指“营养、食物”，也可比喻为“精神食粮”。属于较正式、偏文学的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"food or nourishment; something that sustains life or gives strength","zh":"食物；营养；维持生命或给予力量的东西"},"examples":[{"en":"Fresh vegetables provide good pabulation for growing children.","zh":"新鲜蔬菜能为成长中的孩子提供很好的营养。"},{"en":"After the hike, they looked for warm pabulation and a place to rest.","zh":"徒步后，他们想找些热乎的食物和一个休息的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) mental or spiritual “food,” such as ideas, entertainment, or reading material","zh":"（比喻）精神食粮；如思想、娱乐或阅读材料等能滋养心灵的东西"},"examples":[{"en":"Novels can be pabulation for the mind.","zh":"小说可以成为心灵的精神食粮。"},{"en":"She wanted news that offered more than gossip—real pabulation.","zh":"她想要的不只是八卦新闻——而是真正有内容的精神滋养。"}]}],"synonyms":["nourishment","food","sustenance","aliment","(figurative) fodder","(figurative) mental nourishment"],"phonetic":"/ˌpæbjəˈleɪʃən/","extraExplanation":["这个词比较正式、偏书面，现代日常英语里不常用；更常见的说法是 nourishment / food（指食物）或 mental nourishment / intellectual food（指精神食粮）。","词源来自拉丁语 *pabulum*（饲料、食物）。在旧文学或讲究文风的写作里，pabulation 常用来强调“滋养、供给”的感觉，有时也带一点讽刺意味（比如说某些媒体只提供廉价的“精神饲料”）。"]}
{"word":"pabulatory","summary":{"en":"Pabulatory means “related to nourishment or feeding,” often used in formal or humorous contexts.","zh":"pabulatory 指“与营养/喂养有关的”，多用于正式或带幽默感的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to food, nourishment, or feeding; providing something that sustains (often used in formal or humorous writing).","zh":"与食物、营养或喂养有关的；提供滋养/维持的（多见于正式或带幽默感的表达）。"},"examples":[{"en":"The author joked that the internet offers endless pabulatory content for bored minds.","zh":"作者开玩笑说，互联网为无聊的头脑提供了无穷无尽的“精神饲料”。"},{"en":"After the long hike, we focused on the pabulatory needs of the group—water and a hot meal.","zh":"长途徒步之后，我们优先解决大家的“补给需求”——水和热饭。"}]}],"synonyms":["nourishing","nutritive","nutritional","food-related"],"phonetic":"/ˈpæbjəˌlətɔri/","extraExplanation":["“pabulatory”非常少见，更多时候人们会用更自然的词：nourishing（有营养的）、nutritive（营养的）、food-related（与食物有关的）。","词根来自拉丁语 pabulum（食物/饲料）。在现代英语中，pabulum 也可比喻“精神食粮”，因此 pabulatory 有时会被拿来幽默地形容“信息/内容的喂养”。","写作中它带一点文绉绉或戏谑的味道；日常交流里一般不推荐使用，除非你想要一种刻意的文风效果。"]}
{"word":"pabulous","summary":{"en":"“Pabulous” is not standard English; it usually means “fabulous.”","zh":"“pabulous”不是标准英语，通常是“fabulous”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling—most often a typo—for “fabulous,” meaning extremely good, impressive, or enjoyable.","zh":"非标准拼写，通常是把“fabulous”（极好的、令人赞叹的、很棒的）拼错了。"},"examples":[{"en":"I think you meant “fabulous,” not “pabulous.”","zh":"我觉得你想写的是“fabulous”，不是“pabulous”。"},{"en":"The party was fabulous—everyone had a great time.","zh":"派对太棒了——大家都玩得很开心。"}]}],"synonyms":["fabulous","amazing","wonderful","great","fantastic","excellent"],"phonetic":"/ˈfæbjələs/","extraExplanation":["“pabulous”在英语里不是常见或标准词汇，多数情况下是把“fabulous”打错（f→p）或玩笑式的拼写。正式写作、考试、简历里建议用“fabulous”。"]}
{"word":"pabulum","summary":{"en":"Pabulum means bland, unchallenging content (often criticism), or less commonly simple nourishment.","zh":"Pabulum 指“浅薄、无挑战性的内容（常用于批评）”，也可较少见地指“易消化的营养食物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often negative) Intellectual or artistic content that is too simple, bland, or meant only to be easily consumed rather than to challenge people.","zh":"（常含贬义）过于简单、平淡的思想或艺术内容，只求好消化、好接受，而不去启发或挑战读者/观众。"},"examples":[{"en":"Some critics said the movie was just sentimental pabulum with no real ideas.","zh":"一些评论家说这部电影只是煽情的“精神快餐”，没有真正的思想。"},{"en":"He stopped reading the pabulum in his feed and started choosing longer essays.","zh":"他不再刷信息流里那些浅薄内容，开始主动读更长的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"Food or nourishment, especially for infants or people who are ill (less common in modern everyday use).","zh":"食物；营养品（尤指婴儿或病人食用的流质/易消化食物；现代日常用法较少）。"},"examples":[{"en":"The nurse prepared pabulum suitable for the patient’s weak stomach.","zh":"护士准备了适合病人虚弱胃口的易消化营养食物。"},{"en":"In older texts, “pabulum” can mean simple nourishment.","zh":"在较早的文本中，“pabulum”可以指简单的营养食物。"}]}],"synonyms":["pap","fodder","bland fare","junk food (figurative)","thin gruel (figurative)"],"phonetic":"/ˈpæbjələm/","extraExplanation":["这个词来自拉丁语 pabulum，原意是“食物、饲料”。后来在英语里引申出“精神食粮”的用法，因此常见搭配是 intellectual pabulum（精神快餐/浅薄内容）。","语气提醒：说某作品是 pabulum 通常是在批评它“太迎合、太浅、太好卖”，类似于 junk food for the mind（给大脑吃的垃圾食品）。"]}
{"word":"pabulums","summary":{"en":"“Pabulums” means foods/nourishment, or (often critically) shallow mental “food” like bland media or simplistic ideas.","zh":"“pabulums”指食物/营养物；也可（常带批评）指肤浅的“精神食粮”，如乏味媒体内容或过于简单的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of pabulum) Food or nourishment; something that feeds the body.","zh":"（pabulum 的复数）食物；营养物（给身体提供养分的东西）。"},"examples":[{"en":"Babies need pabulums that are easy to digest.","zh":"婴儿需要容易消化的食物和营养。"},{"en":"In hard times, people searched for any pabulums they could find.","zh":"在艰难时期，人们寻找一切能充饥的食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(often critical) Something that feeds the mind or emotions in a shallow or overly simple way; bland information or entertainment.","zh":"（常含贬义）“精神食粮”，但指内容肤浅、过于简单的资讯或娱乐；乏味的材料。"},"examples":[{"en":"The article was popular, but many readers felt it was just pabulums.","zh":"这篇文章很受欢迎，但很多读者觉得它只是肤浅的“快餐内容”。"},{"en":"He wanted serious debate, not pabulums designed to please everyone.","zh":"他想要严肃的讨论，而不是为了讨好所有人的肤浅内容。"}]}],"synonyms":["nourishment","food","sustenance","fodder","pap","drivel"],"phonetic":"/ˈpæbjələm/","extraExplanation":["“pabulum”源自拉丁语，原意是“食物/饲料”。英语里既可指真正的“营养/食物”，也常被引申为“精神食粮”。当用作批评时，常暗示内容像“营养不高的快餐”，让人容易接受但缺乏深度。","复数“pabulums”并不如单数常见：很多时候英语更常写作 pabulum（作为不可数名词）来泛指“肤浅的内容”。"]}

