{"word":"pac","summary":{"en":"“PAC” most commonly means a U.S. Political Action Committee; “pac” can also be an informal short form of “package/pack” in some contexts.","zh":"“PAC”最常见指美国的政治行动委员会；“pac”在某些语境中也可作“package/pack（包裹/打包）”的非正式简写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) Political Action Committee: an organization that raises and spends money to support or oppose political candidates or policies.","zh":"（美国）政治行动委员会：为支持或反对候选人或政策而筹款并花钱进行政治活动的组织。"},"examples":[{"en":"The senator received donations from several PACs.","zh":"这位参议员收到了几个政治行动委员会（PAC）的捐款。"},{"en":"Some PACs run ads during election season.","zh":"一些PAC会在选举季投放广告。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Package; a packed bundle or box (less common, often short for “pack”/“package”).","zh":"（非正式）包裹；打包好的东西（较少见，常作为“pack/package”的简写）。"},"examples":[{"en":"I’ll send the pac tomorrow if the post office is open.","zh":"如果邮局开门，我明天把包裹寄出。"},{"en":"Did you get the pac I left at the front desk?","zh":"你拿到我放在前台的那个包裹了吗？"}]}],"synonyms":["political action committee","committee","advocacy group","package","parcel","pack"],"phonetic":"/pæk/","extraExplanation":["“PAC”在美国新闻与社会讨论中非常常见，通常直接大写使用；它和竞选资金（campaign finance）话题密切相关。","“Pac”也可能是专有名词或昵称（如歌手Tupac常被称为“Pac”，或游戏角色Pac-Man），这类用法取决于具体语境。"]}
{"word":"PAC-MAN","summary":{"en":"PAC-MAN is a classic arcade game and its famous character; informally, it can also mean to gobble something up quickly.","zh":"PAC-MAN 指经典街机游戏《吃豆人》及其著名角色；口语中也可指快速把东西吃光或耗尽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous yellow character in an arcade video game who eats dots in a maze while avoiding ghosts","zh":"经典街机游戏中的黄色角色，在迷宫里吃豆子并躲避幽灵"},"examples":[{"en":"PAC-MAN eats the dots to clear the level.","zh":"PAC-MAN 吃掉豆子来通关这一关。"},{"en":"The ghosts chase PAC-MAN around the maze.","zh":"幽灵在迷宫里追着 PAC-MAN 跑。"}]},{"partOfSpeech":"n.","definition":{"en":"the classic arcade video game featuring this character","zh":"《吃豆人》这款经典街机电子游戏（以该角色为主角）"},"examples":[{"en":"We played PAC-MAN at the arcade after school.","zh":"放学后我们在游戏厅玩了《吃豆人》。"},{"en":"PAC-MAN was one of the biggest hits of early arcade culture.","zh":"《吃豆人》是早期街机文化中最成功的作品之一。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) to eat or consume something quickly and completely; to gobble up","zh":"（非正式）快速把东西吃光/消耗掉；狼吞虎咽；“吃掉”"},"examples":[{"en":"He pac-manned the whole bowl of popcorn during the movie.","zh":"看电影时他把整碗爆米花都“吃豆人式”地吃光了。"},{"en":"This app pac-mans your phone battery if you leave it running.","zh":"这个应用如果一直开着，会把手机电量“吃豆人式”地耗光。"}]}],"synonyms":["arcade game","gobble (up)","devour"],"phonetic":"/ˈpæk mæn/","extraExplanation":["“PAC-MAN”最初是日本公司 Namco 于 1980 年推出的街机游戏，英文名常写成全大写，并常被当作商标使用。","名字与形象常被认为来自日语拟声词“paku paku”（表示张嘴吃东西的动作），以及披萨少一角的形状联想。","在英语里把它当动词（pac-man something）属于口语/幽默用法，意思是“像吃豆人一样把东西迅速吃光或耗尽”。"]}
{"word":"paca","summary":{"en":"Alpaca: a South American animal kept for its soft wool.","zh":"Alpaca（羊驼）：南美动物，常被饲养以获取柔软的毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large South American camel-like animal with long, soft wool, often kept for its fiber (used to make warm clothing).","zh":"羊驼：一种产于南美、外形像骆驼的动物，毛又长又柔软，常被饲养用来取纤维（做保暖衣物）。"},"examples":[{"en":"Alpacas are raised for their soft fleece.","zh":"人们饲养羊驼是为了它们柔软的毛。"},{"en":"We saw a herd of alpacas on a farm during our trip.","zh":"旅行时我们在农场看到一群羊驼。"}]}],"synonyms":["alpaca (the animal)","camelid (broader category)"],"phonetic":"/ælˈpækə/","extraExplanation":["“paca”本身也是一个独立的英文单词，指一种生活在中南美洲的啮齿动物（类似大豚鼠/无尾刺豚一类），但你写的“paca”在日常学习中最常见是误拼“alpaca（羊驼）”。如果你想查的是啮齿动物“paca”，告诉我我可以补充该词条。"]}
{"word":"pacable","summary":{"en":"Capable means having the ability to do something well, or being able to do something.","zh":"capable 表示“有能力的、能胜任的”，也可表示“能够做某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the ability or qualities needed to do something well; able.","zh":"有能力的；能胜任的。"},"examples":[{"en":"She is capable of solving the problem on her own.","zh":"她有能力自己解决这个问题。"},{"en":"He’s a capable manager who stays calm under pressure.","zh":"他是一位能干的经理，在压力下也很冷静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to have or do something (often used with “of”).","zh":"能够（做某事/具备某种性质）（常与 of 连用）。"},"examples":[{"en":"This phone is capable of taking great photos in low light.","zh":"这部手机能在弱光下拍出很好的照片。"},{"en":"The child is capable of kindness, even when upset.","zh":"这个孩子即使生气，也仍然能够表现出善意。"}]}],"synonyms":["able","competent","skilled","qualified","proficient"],"phonetic":"/ˈkeɪpəbəl/","extraExplanation":["“pacable” 不是常见的英语单词，最可能是拼写错误，通常想写的是 “capable”（有能力的）。也有人会把 “passable”（勉强过得去的/还算可以的）拼错。你想表达的是哪一个？","常见搭配：be capable of + V-ing（能够做……）。例如：be capable of handling pressure（能承受压力）。","近义词小区别：capable 强调“有能力、能胜任”；able 更中性；competent 更强调“合格/称职（达到标准）”。"]}
{"word":"pacaguara","summary":{"en":"Pacaguara refers to an Indigenous people in the Bolivian Amazon and their highly endangered language (often spelled Pacahuara).","zh":"Pacaguara 指玻利维亚亚马孙地区的一个原住民族及其极度濒危的语言（常拼作 Pacahuara）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of the Bolivian Amazon (often spelled Pacahuara), traditionally living in northern Bolivia.","zh":"（常拼作 Pacahuara）玻利维亚亚马孙地区的一个原住民族成员，传统上居住在玻利维亚北部。"},"examples":[{"en":"The museum exhibit includes information about the Pacaguara people and neighboring Amazonian groups.","zh":"博物馆展览包含关于 Pacaguara 人以及周边亚马孙族群的介绍。"},{"en":"Researchers work with Pacaguara families to document oral histories.","zh":"研究者与 Pacaguara 家庭合作记录口述历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the highly endangered language associated with the Pacaguara people (more commonly called Pacahuara).","zh":"Pacaguara 人所使用、极度濒危的语言（更常称为 Pacahuara 语）。"},"examples":[{"en":"A linguist published a small dictionary of Pacaguara to support language revitalization.","zh":"一位语言学家出版了 Pacaguara 的小词典，以支持语言复振。"},{"en":"Only a few speakers of Pacaguara are reported in recent sources.","zh":"据近期资料显示，Pacaguara 语的使用者人数非常少。"}]}],"synonyms":["Pacahuara","Pacawara"],"phonetic":"/ˌpɑːkəˈɡwɑːrə/","extraExplanation":["“Pacaguara”常见于学术或人类学语境，也常与拼写“Pacahuara”互指同一族群/语言；不同资料可能采用不同转写方式。","谈到该族群与语言时，英语写作中常用更尊重与准确的表达，如“the Pacaguara people”或“Pacaguara language”，并避免把族群当作泛称或刻板标签。","相关背景：该语言通常被描述为极度濒危（speakers 很少），因此在文献中常与语言记录、文化保存与语言复振（revitalization）等主题一起出现。"]}
{"word":"pacane","summary":{"en":"“Pecan” is a sweet, buttery nut (and also the tree that grows it), widely used in American cooking and baking.","zh":"“Pecan”指美洲山核桃（仁）或美洲山核桃树，是美国烹饪与烘焙中常用的坚果与树种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a smooth, oval nut with a sweet, buttery flavor, often used in baking (especially in the U.S.)","zh":"美洲山核桃仁（口感香甜、带奶油风味的坚果，常用于烘焙，尤其在美国很常见）"},"examples":[{"en":"I added chopped pecans to the banana bread.","zh":"我在香蕉面包里加了切碎的美洲山核桃仁。"},{"en":"Pecan pie is a classic dessert in the southern United States.","zh":"山核桃派是美国南部很经典的甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"the North American tree that produces pecans","zh":"美洲山核桃树（产山核桃的北美树种）"},"examples":[{"en":"There’s a tall pecan tree in my grandparents’ yard.","zh":"我祖父母家的院子里有一棵高大的山核桃树。"}]}],"synonyms":["pecan nut","hickory nut (related, not the same)"],"phonetic":"/pɪˈkɑn/","extraExplanation":["“pacane”通常不是标准英语拼写；你可能想查的是“pecan”。","“pecan”在美国有两种常见读法（不同地区不同家庭会坚持不同发音），但拼写相同；点餐或聊天时听到不同发音都很正常。","在美国文化里，“pecan pie（山核桃派）”很有代表性，常见于感恩节和节庆聚餐。"]}
{"word":"pacare","summary":{"en":"Pacare is a Latin verb meaning “to make peaceful; to calm or pacify,” mainly seen in mottos or word origins, not everyday English.","zh":"Pacare 是拉丁语动词，意为“使和平、安抚/平息”，多见于格言或词源讨论中，不是日常英语用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; not a modern English word) to make peaceful; to calm or pacify; to bring under control.","zh":"（拉丁语；不是现代英语常用词）使和平；安抚、平息；使受控制。"},"examples":[{"en":"The Latin verb pacare is the root behind English words like pacify.","zh":"拉丁语动词 pacare 是英语单词 pacify（使平静/安抚）的词根来源之一。"},{"en":"In a motto, pacare can suggest “to calm conflict and restore peace.”","zh":"在格言或铭文里，pacare 常带有“平息冲突、恢复和平”的含义。"}]}],"synonyms":["pacify","appease","calm","soothe","quell"],"phonetic":"/pəˈkɑːreɪ/","extraExplanation":["pacare 常出现在拉丁文文本、校训/座右铭或词源学讨论中，而不用于现代英语日常表达。现代英语一般用 pacify / appease / calm 来表达类似意思。","词源关联：pacare 与“和平”有关的词族相连，英语中常见的派生/相关词包括 pacify（安抚）、pax（拉丁语“和平”，常见于短语 Pax Romana）、peace（和平）等。"]}
{"word":"pacas","summary":{"en":"“Pacas” means more than one paca, a large spotted rodent from Central and South America.","zh":"“Pacas”是 paca 的复数，指中南美洲的一种大型有斑点的啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of paca: a large, spotted rodent from Central and South America.","zh":"paca 的复数：一种产于中南美洲、体型较大、身上有白色斑点的啮齿动物。"},"examples":[{"en":"Pacas are mostly active at night and hide during the day.","zh":"Pacas 多在夜间活动，白天会躲藏起来。"},{"en":"In some regions, pacas are hunted for their meat.","zh":"在一些地区，人们会猎捕 paca 作为肉食来源。"}]}],"synonyms":["spotted paca","lowland paca"],"phonetic":"/ˈpɑːkə/","extraExplanation":["“paca”常指“斑点刺豚鼠/斑点竹鼠”（spotted paca），主要分布在中南美洲的森林与河流附近，善于游泳。","这个词来自南美原住民语言（如图皮语系）进入西班牙语/葡萄牙语，再进入英语；在饮食与野生动物保护的语境里也常出现。"]}
{"word":"pacate","summary":{"en":"Placate means to calm someone who is angry or upset, often by doing or saying something that pleases them.","zh":"Placate 指安抚生气或不满的人，使其冷静下来，常用一些让对方满意的话或做法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to calm someone down or make them less angry, often by saying or doing something pleasing","zh":"安抚；平息（某人的怒气），常通过说好话或做让人满意的事"},"examples":[{"en":"She tried to placate her boss by apologizing and offering a solution.","zh":"她试图通过道歉并提出解决方案来安抚老板。"},{"en":"The company offered a refund to placate unhappy customers.","zh":"公司提供退款以平息不满的顾客。"}]}],"synonyms":["calm","soothe","appease","pacify"],"phonetic":"/pləˈkeɪt/","extraExplanation":["你输入的“pacate”通常是“placate”的拼写错误；标准拼写是 placate。","placate 常见搭配：placate someone / placate anger / placate fears（安抚某人/平息怒气/安抚恐惧）。语气上表示“让对方先冷静下来”，不一定真正解决问题。"]}
{"word":"pacately","summary":{"en":"“Pacately” means “in a calm, peaceful way,” but it is very rare in modern English.","zh":"“pacately” 意为“平静地、安宁地”，但在现代英语中非常罕用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a peaceful, calm way; quietly and without conflict.","zh":"（罕用）平静地；安宁地；不带冲突地。"},"examples":[{"en":"The lake lay pacately under the morning light.","zh":"湖面在晨光下安宁地静卧着。"},{"en":"They discussed the problem pacately, without raising their voices.","zh":"他们平和地讨论这个问题，没有提高音量。"}]}],"synonyms":["calmly","peacefully","quietly","placidly","serenely"],"phonetic":"/ˈpækətli/","extraExplanation":["“pacately” 很少见，来自形容词 “pacate”（意为“平静的、和缓的”），同源于拉丁语 pac-（和平），与 peace / pacify / pacific 这一组词有关。","在现代英语里，更常用的替代词是 “calmly / peacefully / quietly / placidly”。如果你在写作中使用 “pacately”，会显得比较书面、古典，读者也可能不熟悉。"]}
{"word":"pacation","summary":{"en":"“Pacation” is not standard; it’s usually a misspelling of “vacation,” meaning time off for rest or travel.","zh":"“pacation”不是规范拼写，通常是“vacation”的误拼，意思是用于休息或旅行的假期/度假。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) The correct word is “vacation”: a period of time when you stop working or studying to rest or travel.","zh":"（常见拼写错误）正确拼写是“vacation”：指一段不用工作或上学、用来休息或旅行的时间。"},"examples":[{"en":"I’m going on vacation next week.","zh":"我下周要去度假。"},{"en":"We’re taking a short vacation to the beach.","zh":"我们要去海边度个短假。"}]},{"partOfSpeech":"n.","definition":{"en":"“Vacation” can also mean a trip you take for rest or pleasure.","zh":"“vacation”也可指一次为了休息或娱乐而进行的旅行。"},"examples":[{"en":"Our vacation to New York was amazing.","zh":"我们去纽约的旅行非常棒。"},{"en":"That was the best vacation I’ve ever had.","zh":"那是我经历过最棒的一次旅行。"}]},{"partOfSpeech":"v.","definition":{"en":"To take time off from work or school; to spend a vacation somewhere (less common in everyday speech).","zh":"休假；去某地度假（作动词时日常较少用）。"},"examples":[{"en":"They vacation in Hawaii every winter.","zh":"他们每年冬天都去夏威夷度假。"}]}],"synonyms":["holiday (BrE)","break","time off","trip","getaway"],"phonetic":"/veɪˈkeɪʃən/","extraExplanation":["“pacation”通常是把 /v/ 误写成 /p/ 的拼写错误。英语里 vacation 的首音是 /v/，类似中文“微”的摩擦感，不是爆破音 /p/。","相关常用表达：on vacation（在度假）、take a vacation（休假/去度假）、vacation days（年假/休假天数）。英式英语更常说 holiday（假期/度假）。"]}
{"word":"pacative","summary":{"en":"Pacative is a rare adjective meaning “calming or peace-making; intended to pacify.”","zh":"Pacative 是个很罕见的形容词，意思是“安抚的、息事宁人的；旨在平息冲突的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having a calming or peace-making effect; intended to pacify or reduce conflict.","zh":"（罕见）有安抚、息事宁人的作用；旨在平息冲突、使人平静。"},"examples":[{"en":"The mediator used pacative language to keep the discussion respectful.","zh":"调解人用了安抚性的措辞，让讨论保持尊重。"},{"en":"A pacative gesture can stop an argument from getting worse.","zh":"一个安抚性的举动可以阻止争吵恶化。"}]}],"synonyms":["pacifying","soothing","conciliatory","peace-making","calming"],"phonetic":"/ˈpæsətɪv/","extraExplanation":["“pacative”在现代英语里非常少见，很多情况下是拼写错误或不常用的变体。更常见、更自然的表达包括：pacifying（安抚的/使平静的）、soothing（舒缓的）、conciliatory（调和的/和解的）、peace-making（促成和平的）。","词源上与拉丁语“pax（和平）”同源，和 pacify（使平静/平息）是同一词根家族。写作或考试中建议优先用更常见的替代词，以避免读者不认识。"]}
{"word":"pacay","summary":{"en":"Pacay is a South American tree and its sweet pod fruit, also called the ice-cream bean.","zh":"Pacay 指一种南美洲树及其甜荚果，也叫“冰淇淋豆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (and its long pod fruit) from South America; the sweet white pulp around the seeds is eaten and is sometimes called an “ice-cream bean.”","zh":"（南美洲的）帕卡伊树（及其长荚果）；种子外包裹的白色甜果肉可食用，也常被称为“冰淇淋豆”。"},"examples":[{"en":"In Peru, you can buy pacay pods in local markets when they’re in season.","zh":"在秘鲁，到了产季你可以在当地市场买到帕卡伊果荚。"},{"en":"The pacay’s soft, sweet pulp tastes mild—some people compare it to vanilla.","zh":"帕卡伊的果肉柔软香甜、味道温和——有人说有点像香草。"}]}],"synonyms":["ice-cream bean","pacae"],"phonetic":"/pəˈkaɪ/","extraExplanation":["“pacay”多见于拉丁美洲（尤其秘鲁、厄瓜多尔一带）的用法，也常拼作“pacae”。在英文中它通常作为外来词使用，指一种可食用的荚果。","如果你原本想输入的是别的英文词（例如“pacify”“package”等），告诉我你想表达的意思/句子，我可以帮你确认正确拼写和用法。"]}
{"word":"pacaya","summary":{"en":"Pacaya most commonly refers to a well-known active volcano in Guatemala; it can also mean an edible palm flower used as a vegetable in Central America.","zh":"Pacaya 最常指危地马拉著名的活火山“帕卡亚火山”；也可指中美洲可食用的棕榈花苞/花序（常当作蔬菜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcano in southern Guatemala, near Antigua; known for frequent eruptions","zh":"（危地马拉南部的）帕卡亚火山；以活动频繁闻名"},"examples":[{"en":"We saw smoke rising from Pacaya while visiting Antigua.","zh":"我们在安提瓜旅游时看见帕卡亚火山冒烟。"},{"en":"Pacaya is one of Guatemala’s most active volcanoes.","zh":"帕卡亚火山是危地马拉最活跃的火山之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a Central American palm (often referring to its edible flower buds/inflorescences), used as a vegetable in local cooking","zh":"（中美洲）一种棕榈植物（常指其可食用的花苞/花序），在当地料理中当作蔬菜食用"},"examples":[{"en":"They served pacaya with eggs for breakfast.","zh":"他们早餐把 pacaya 和鸡蛋一起做来吃。"},{"en":"In some markets, pacaya is sold as a seasonal vegetable.","zh":"在一些市场里，pacaya 会作为时令蔬菜出售。"}]}],"synonyms":["Volcán de Pacaya"],"phonetic":"/pəˈkaɪə/","extraExplanation":["“Pacaya”在英语里多作为专有名词使用（火山名），因此常大写为 Pacaya。","作为食材时，pacaya 通常指一种棕榈的花序（在中美洲尤其常见，如危地马拉、萨尔瓦多），常见做法包括裹粉/裹蛋煎、或做成配菜。点菜或看食谱时，它更像“地方特色蔬菜名”，不一定会被翻成通用英文蔬菜名。"]}
{"word":"paccanarist","summary":{"en":"A rare historical term meaning a follower of Niccolò Paccanari’s Catholic group (the Society of the Faith of Jesus).","zh":"一个罕见的历史用语，指帕卡纳里所创天主教团体“耶稣信德会”的追随者/成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or follower of Niccolò Paccanari’s Roman Catholic group, the “Society of the Faith of Jesus” (late 1700s), formed during a period when the Jesuit order was suppressed in many places","zh":"帕卡纳里派成员；指追随尼科洛·帕卡纳里（Niccolò Paccanari）的罗马天主教团体“耶稣信德会”（18世纪末）的成员，该团体出现于耶稣会在多地受压制的时期"},"examples":[{"en":"Some historians mention the Paccanarists when discussing Catholic renewal movements after the suppression of the Jesuits.","zh":"一些历史学者在讨论耶稣会遭到压制后的天主教复兴运动时，会提到帕卡纳里派。"},{"en":"He wrote a paper about the Paccanarists and their short-lived influence in Italy.","zh":"他写了一篇论文，研究帕卡纳里派及其在意大利短暂的影响。"}]}],"synonyms":["follower","member (of a religious order)"],"phonetic":"/ˌpɑkəˈnɑrɪst/","extraExplanation":["“Paccanarist”来自人名 Paccanari（帕卡纳里）+ 表示“某派别/追随者”的后缀 -ist。这个词非常罕见，主要出现在教会史或18世纪末欧洲宗教团体的研究文章中。","背景要点：耶稣会在1773年被教宗克雷芒十四世正式取缔（后于1814年恢复）。在这段时期，一些团体试图延续类似耶稣会的灵修与教育传统，“耶稣信德会”就是其中之一。","使用提醒：日常英语里几乎不会用到；写作时若读者不熟悉，通常需要加一句解释（如“a member of Paccanari’s Society of the Faith of Jesus”）。"]}
{"word":"paccha","summary":{"en":"A paccha is an Inca/Andean ceremonial pouring vessel used for ritual offerings (libations).","zh":"paccha 指印加/安第斯祭祀中用于倾倒奠酒的仪式器具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Andean cultures, especially Inca) A ceremonial vessel or spout used to pour libations (often chicha, a corn beer) as an offering, sometimes designed to let liquid flow onto the ground or onto a sacred object.","zh":"（安第斯文化，尤指印加）一种祭祀用的灌酒器/祭酒器，用来倾倒奠酒（常为玉米酒 chicha）作为供奉；有时设计成让液体流到地面或圣物上。"},"examples":[{"en":"The guide explained that a paccha was used to pour chicha as an offering to Pachamama.","zh":"导游解释说，paccha 用来把玉米酒倾倒出来，作为献给大地母神（Pachamama）的供奉。"},{"en":"Archaeologists found a stone paccha near the temple platform.","zh":"考古学家在神庙台基附近发现了一件石制 paccha。"}]}],"synonyms":["libation vessel","ritual pouring vessel","offering vessel"],"phonetic":"/ˈpɑːtʃə/","extraExplanation":["“paccha”常见于关于印加与安第斯宗教仪式的英文资料中，属于借用词（多与克丘亚语 Quechua 相关）。在一些博物馆或学术语境里，你也会看到它指带有出水口、用于“献酒/奠酒”的器物。","不要与英语里的“pacca/pukka”（意为“真正的、地道的”）混淆；拼写和来源不同。"]}
{"word":"pacchionian","summary":{"en":"A medical adjective meaning “related to Pacchionian (arachnoid) granulations,” which help drain cerebrospinal fluid.","zh":"医学形容词，表示“与帕基奥尼（蛛网膜）颗粒有关”，这些结构帮助引流脑脊液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Relating to Pacchionian granulations (also called arachnoid granulations)—small structures involved in draining cerebrospinal fluid (CSF) into the venous system.","zh":"（解剖/医学）与帕基奥尼颗粒（亦称蛛网膜颗粒）有关的——这些小结构帮助将脑脊液（CSF）引流进入静脉系统。"},"examples":[{"en":"The radiology report mentioned prominent Pacchionian granulations near the superior sagittal sinus.","zh":"影像学报告提到在上矢状窦附近可见较明显的帕基奥尼颗粒。"},{"en":"Pacchionian bodies can sometimes create small impressions on the inner surface of the skull.","zh":"帕基奥尼小体有时会在颅骨内板形成轻微的压迹。"}]}],"synonyms":["arachnoid (granulations)","meningeal (context-dependent)"],"phonetic":"/pəˈkiːoʊniən/","extraExplanation":["“Pacchionian”是人名派生的医学形容词，来自意大利解剖学家 Antonio Pacchioni（17–18世纪）。临床与教材中更常见的搭配是“Pacchionian granulations / Pacchionian bodies”，日常英语里很少单独使用这个词。"]}
{"word":"paccioli","summary":{"en":"“Paccioli” is usually a misspelling of “Pacioli,” referring to Luca Pacioli, a Renaissance mathematician known for describing double-entry bookkeeping.","zh":"“paccioli”通常是“Pacioli”的误拼，指文艺复兴时期数学家卢卡·帕乔利，以记载复式记账法而闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) Luca Pacioli, an Italian Renaissance mathematician and Franciscan friar, often called the “father of accounting” for describing double-entry bookkeeping in print.","zh":"（专有名词）卢卡·帕乔利（Luca Pacioli），意大利文艺复兴时期的数学家与方济各会修士，因在著作中系统描述“复式记账法”而常被称为“会计学之父”。"},"examples":[{"en":"Many accounting textbooks mention Luca Pacioli as an early writer on double-entry bookkeeping.","zh":"许多会计教材都会提到卢卡·帕乔利是早期记载复式记账法的重要作者。"},{"en":"Our professor said Pacioli helped standardize how merchants recorded debits and credits.","zh":"教授说帕乔利推动了商人记录借贷（借方与贷方）方式的规范化。"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “Pacioli.” (The correct spelling is usually P-a-c-i-o-l-i.)","zh":"“Pacioli”的常见拼写错误（通常正确拼法是 P-a-c-i-o-l-i）。"},"examples":[{"en":"I wrote “paccioli” in my notes, but the correct spelling is “Pacioli.”","zh":"我在笔记里写成了“paccioli”，但正确拼法是“Pacioli”。"}]}],"synonyms":["Pacioli","Luca Pacioli"],"phonetic":"/ˌpɑːtʃiˈoʊli/","extraExplanation":["“帕乔利”最常被提到的是他在 1494 年出版的《算术、几何、比例与比例关系概要》（Summa de arithmetica）中介绍了威尼斯商人的复式记账方法：每笔交易同时记录“借方（debit）/贷方（credit）”。","如果你是在会计/财务语境中看到“paccioli”，几乎可以确定是指 Pacioli（人名）而不是一个普通英文单词。"]}
{"word":"pace","summary":{"en":"“Pace” most often means speed or rhythm (progress), and it can also mean a step or the act of walking back and forth.","zh":"“pace”最常指速度/节奏（进度）；也可指一步，或指来回踱步（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the speed or rate at which someone does something or something happens, often in a steady rhythm","zh":"（做事或事情发生的）速度；步调（常指稳定的节奏）"},"examples":[{"en":"The course moves at a fast pace, so review your notes every day.","zh":"这门课进度很快，所以每天都要复习笔记。"},{"en":"She set the pace for the team during the first mile.","zh":"她在第一英里为全队定下了节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"a single step when walking, especially in formal writing","zh":"（走路的）一步（多见于较正式的表达）"},"examples":[{"en":"He took a few paces back to see the whole painting.","zh":"他往后退了几步，好看清整幅画。"}]},{"partOfSpeech":"v.","definition":{"en":"to walk back and forth, usually because you are nervous, bored, or thinking hard","zh":"（因紧张、无聊或思考）来回踱步"},"examples":[{"en":"She paced the hallway while waiting for the phone call.","zh":"她一边等电话一边在走廊里来回踱步。"}]},{"partOfSpeech":"vt.","definition":{"en":"to control the speed of an activity so you don’t get tired too early; to do something at a steady rate","zh":"控制节奏；（为避免过早疲劳而）调整速度、匀速进行"},"examples":[{"en":"Pace yourself during the exam—you have plenty of time.","zh":"考试时注意把握节奏——时间很充足。"},{"en":"He paced his speech so everyone could follow.","zh":"他放慢并调整演讲节奏，让大家都能跟上。"}]}],"synonyms":["speed","rate","rhythm","tempo","stride","step","stroll (context-dependent)","walk back and forth"],"phonetic":"/peɪs/","extraExplanation":["名词 pace 常用于学习、工作等语境，表示“进度/节奏”（例如 at your own pace 按自己的节奏）。动词 pace 最常见的画面是“紧张地来回走”。","词源上 pace 与“脚步/步伐”有关，所以既能指“步调（抽象）”，也能指“步数（具体）”。"]}
{"word":"paceboard","summary":{"en":"A paceboard is a sign/board used during races to show pace or timing information; it’s also sometimes a misspelling of “pasteboard.”","zh":"paceboard 指比赛中用来提示配速或计时信息的牌子；有时也会被误写成 pasteboard（硬纸板）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a board or sign used in races (especially motorsports/cycling) to show a competitor their pace, lap time, or position","zh":"（比赛中用的）配速板／计时板；用来提示选手速度、单圈时间或名次的牌子"},"examples":[{"en":"The coach held up a paceboard to show her target split for the next lap.","zh":"教练举起配速板，提示她下一圈的目标分段时间。"},{"en":"In the pit lane, the team used a paceboard to tell the driver to push.","zh":"在维修区通道里，车队用计时板告诉车手加速冲刺。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a misspelling of “pasteboard” (thick paper/cardboard)","zh":"（少见）“pasteboard”（厚纸板、硬纸板）的误拼"},"examples":[{"en":"If you mean thick cardboard, the usual word is “pasteboard,” not “paceboard.”","zh":"如果你指的是厚纸板，常用词是“pasteboard”，而不是“paceboard”。"}]}],"synonyms":["lap board","pit board","timing board","signboard"],"phonetic":"ˈpeɪsˌbɔrd","extraExplanation":["“paceboard”多见于赛车场景：比如F1、摩托车或自行车比赛中，车队/教练在赛道边举牌，给选手传递单圈时间、差距（gap）、名次（P1/P2）或指令（push/box等）。在英语里也常写作two words：pace board。","如果你的语境是“硬纸板/纸壳”，更标准的拼写是“pasteboard”（较文学或较旧用法），现代更常说cardboard。"]}
{"word":"paced","summary":{"en":"“Paced” most often describes a set rhythm or speed (fast-paced, slow-paced). It can also be the past tense of “pace,” meaning to walk back and forth or to control your speed.","zh":"“paced”常用来形容有特定节奏或速度的（如 fast-paced、slow-paced）。也可作动词 pace 的过去式，表示踱步或控制速度/配速。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Having a particular speed or rhythm; moving, written, or spoken at a certain rate.","zh":"（形容词）有特定速度或节奏的；以某种速度推进、书写或表达的。"},"examples":[{"en":"The movie is fast-paced, so it never feels boring.","zh":"这部电影节奏很快，所以从不觉得无聊。"},{"en":"Choose a paced breathing pattern to help you relax.","zh":"选择一种有节奏的呼吸方式来帮助放松。"}]},{"partOfSpeech":"v.","definition":{"en":"(v., past tense/past participle of “pace”) Walked back and forth or moved at a steady speed, often because of thinking, waiting, or worrying; or carefully controlled the speed of something.","zh":"（动词，pace 的过去式/过去分词）来回踱步或以稳定速度行走（常因思考、等待或焦虑）；或对某事的速度进行控制。"},"examples":[{"en":"She paced the room while she waited for the phone call.","zh":"她等电话时在房间里来回踱步。"},{"en":"He paced himself during the marathon and saved energy for the end.","zh":"他在马拉松中控制配速，把体力留到最后。"}]}],"synonyms":["fast-paced","slow-paced","rhythmic","steady","controlled"],"phonetic":"/peɪst/","extraExplanation":["“paced”常见于复合形容词：fast-paced（快节奏的）、slow-paced（慢节奏的）、well-paced（节奏把握得好的）。在影评、小说评论、演讲训练里很常用。","作为动词时，pace 既指“踱步（常带焦虑/思索的意味）”，也指“控制速度/配速”（尤其在运动语境里常说 pace yourself）。","名词“pace”表示“步伐/速度/配速”。口语里也会说 “at your own pace”（按自己的节奏）。"]}
{"word":"pacemake","summary":{"en":"“Pacemake” means to set the pace for others—leading and controlling speed in a race or activity.","zh":"“pacemake”指为他人设定配速、领跑控速，常用于比赛或集体活动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to set the speed or rhythm for others in a race, group, or activity; to act as the leader who controls the pace","zh":"为他人设定速度或节奏；在比赛或活动中领跑、控速"},"examples":[{"en":"She tried to pacemake the group so everyone could finish the hike comfortably.","zh":"她尽量为队伍控速，让大家都能舒服地走完全程。"},{"en":"In the first mile, he pacemade conservatively to save energy for the end.","zh":"在第一英里，他保守地控速，为最后冲刺留体力。"}]},{"partOfSpeech":"v.","definition":{"en":"(sports, especially horse racing) to lead early in order to maintain a steady tempo, sometimes to help a teammate or a favored competitor","zh":"（体育，尤指赛马）前段领跑以保持稳定节奏；有时为队友或被看好的选手“带速”"},"examples":[{"en":"One runner was assigned to pacemake for the team’s star athlete.","zh":"有一名选手被安排为队里的明星选手带速。"},{"en":"The horse pacemade through the first half of the race, then faded.","zh":"那匹马在比赛前半程领跑带速，之后速度下降了。"}]}],"synonyms":["set the pace","lead","pace","front-run"],"phonetic":"/ˈpeɪsˌmeɪk/","extraExplanation":["“pacemake”在现代英语里不算常见，更常见的写法是“pace-make”（连字符）或直接用名词“pacemaker”（领跑者/配速员；也可指心脏起搏器）。在跑步语境中更自然的表达还有“set the pace”“lead the pack”“keep a steady pace”。","拼写变化：过去式/过去分词常写作“pacemade”，也有人写“pace-made”。实际写作中建议优先用更常见的“set the pace”来避免读者不熟悉。"]}
{"word":"pacemaker","summary":{"en":"A pacemaker is usually a device that regulates heart rhythm; it can also mean a leader that sets the pace or standard.","zh":"pacemaker通常指调节心律的（心脏）起搏器；也可指领跑者或行业标杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small medical device that helps control an irregular heartbeat by sending electrical signals to the heart.","zh":"（心脏）起搏器：一种小型医疗装置，通过向心脏发送电信号来帮助控制心律不齐。"},"examples":[{"en":"My grandfather got a pacemaker after his heartbeat became too slow.","zh":"我爷爷心跳变得太慢后装了起搏器。"},{"en":"The doctor checked her pacemaker during the follow-up visit.","zh":"复诊时医生检查了她的起搏器。"},{"en":"Some people with a pacemaker should avoid strong magnetic fields.","zh":"一些装有起搏器的人应避免强磁场。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that sets the speed or standard that others follow (often used in sports, business, or trends).","zh":"（比喻）领跑者；标杆：指设定速度或标准、让他人跟随的人或事（常用于运动、商业或潮流）。"},"examples":[{"en":"In the first mile, she stayed close to the pacemaker to keep a steady pace.","zh":"第一英里她紧跟领跑员，以保持稳定配速。"},{"en":"That company has become a pacemaker for the entire industry.","zh":"那家公司已成为整个行业的标杆。"}]}],"synonyms":["cardiac pacemaker","pacer","trendsetter","pace-setter","front-runner"],"phonetic":"/ˈpeɪsˌmeɪkɚ/","extraExplanation":["“pacemaker”字面意思是“使节奏保持的人/物”。在医疗语境中，pace指“心跳节律”，-maker表示“制造/促成者”。","医学上的起搏器通常植入胸部皮下，通过电极与心脏相连；日常交流中也常说“have a pacemaker”表示“装了起搏器”。"]}
{"word":"pacemakers","summary":{"en":"Pacemakers are either implanted heart devices that regulate heartbeat, or people/things that set the pace for others.","zh":"Pacemakers既可指植入体内调节心跳的心脏起搏器，也可指为他人设定节奏的领跑者或带头者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small medical device placed in the chest to help control an irregular or slow heartbeat by sending electrical signals to the heart.","zh":"一种植入胸部的小型医疗装置，通过向心脏发送电脉冲来帮助控制心跳过慢或心律不齐。"},"examples":[{"en":"My grandfather got a pacemaker after his heartbeat became too slow.","zh":"我爷爷在心跳变得过慢后植入了起搏器。"},{"en":"People with pacemakers may need to avoid certain strong magnetic devices.","zh":"装有起搏器的人可能需要避免某些强磁设备。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that sets the speed, pace, or standard for others.","zh":"起带头作用的人或事物；为他人设定速度、节奏或标准的东西。"},"examples":[{"en":"In the first mile, she ran as the pacemaker for the whole team.","zh":"在第一英里，她作为“领跑员”带着全队的节奏。"},{"en":"That company became a pacemaker in the industry by introducing new technology.","zh":"那家公司通过引入新技术成为行业的“领头羊”。"}]}],"synonyms":["cardiac pacers","heart pacers","pace-setters","trailblazers"],"phonetic":"/ˈpeɪsˌmeɪkərz/","extraExplanation":["“pacemakers”是复数形式；单数是“pacemaker”。在医学语境里更常见，中文也常译为“心脏起搏器”。日常新闻/运动语境中，“pacemaker”也可指马拉松或比赛中的“配速员/领跑员”。"]}
{"word":"pacemaking","summary":{"en":"Pacemaking means setting a pace for others (especially in sports) or controlling heartbeat rhythm in medicine; it can also mean managing the tempo of an activity.","zh":"Pacemaking 指带节奏领跑（常用于体育），也指医学上的起搏（控制心跳节律）；还可引申为掌控某事的进度/节奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of setting a steady speed or rhythm for others to follow, especially in sports (being the “pace-setter”).","zh":"（尤指体育比赛中）带节奏、领跑；为他人设定稳定速度/节奏的行为。"},"examples":[{"en":"Her pacemaking helped the team finish the race strongly.","zh":"她的领跑带节奏帮助全队强势完赛。"},{"en":"The coach asked him to do pacemaking for the first 10 kilometers.","zh":"教练让他在前10公里负责领跑控速。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine/physiology: the production or control of the heartbeat’s rhythm by a pacemaker (natural heart tissue or an implanted device).","zh":"（医学/生理）起搏；由起搏点（心脏自然组织）或植入式起搏器产生/控制心跳节律。"},"examples":[{"en":"The device provides pacemaking when the heart beats too slowly.","zh":"当心跳过慢时，这个装置会提供起搏功能。"},{"en":"Some cells in the heart are responsible for pacemaking.","zh":"心脏里有些细胞负责起搏。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally: the act of setting the tempo or progress of an activity or change.","zh":"（引申）掌控进度/节奏；推动某事按一定速度发展。"},"examples":[{"en":"Careful pacemaking is important when you return to work after illness.","zh":"生病后重返工作时，谨慎控制节奏很重要。"},{"en":"The company’s pacemaking of new releases kept customers interested.","zh":"公司对新品发布节奏的把控让顾客保持兴趣。"}]}],"synonyms":["pace-setting","pacing","leading","tempo-setting","heart pacing"],"phonetic":"/ˈpeɪsˌmeɪkɪŋ/","extraExplanation":["“Pace”本义是“步伐/速度”。在耐力运动（长跑、自行车）里，pacemaking常指由“兔子/配速员”带领选手跑出目标配速；在医学语境中，它与“pacemaker（起搏器/起搏点）”同源，但更强调“起搏这一功能/过程”。"]}
{"word":"pacer","summary":{"en":"A pacer is someone (or something) that helps set and maintain a steady speed, especially in running or racing; it can also mean a type of horse.","zh":"pacer 指帮助设定并保持稳定速度的人或工具（常见于跑步/比赛中的领跑员），也可指一种快步马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that sets the speed for others, especially in a race or training.","zh":"（比赛或训练中）领跑者；（赛马等）领步的动物。"},"examples":[{"en":"The pacer helped the runners keep a steady pace for the first 10 miles.","zh":"领跑员帮助跑者在前10英里保持稳定配速。"},{"en":"In some marathons, pacers carry signs showing the target finish time.","zh":"在一些马拉松里，领跑员会举着写有目标完赛时间的牌子。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of horse trained to move in a smooth two-beat gait called a pace.","zh":"（一种）快步马；以“两拍快步（pace）”步态行走的马。"},"examples":[{"en":"Harness racing often features pacers and trotters.","zh":"轻驾车赛马常见两种：快步马（pacers）和对角小跑马（trotters）。"}]},{"partOfSpeech":"n.","definition":{"en":"A device (or app) that helps someone keep a regular speed or rhythm, especially for walking or running.","zh":"（帮助保持速度或节奏的）配速器；节奏器（如用于步行/跑步的设备或应用）。"},"examples":[{"en":"She used a pacer app to maintain her running pace during training.","zh":"她用配速应用在训练时保持跑步节奏。"}]}],"synonyms":["pace setter","pace-maker","leader","rabbit"],"phonetic":"/ˈpeɪsɚ/","extraExplanation":["在英语体育语境中，pacer最常见指“领跑员”。很多大型路跑会有官方配速员（pace group），他们的任务是尽量以稳定速度带队，帮助参赛者按目标完赛时间前进。","pacer 来自 pace（步伐、速度）+ -er（表示“做某事的人/物”）。相关常见搭配：pace setter（配速/定速的人）、set the pace（带节奏/定速度）、keep pace (with)（跟上……的步伐）。"]}
{"word":"pacers","summary":{"en":"“Pacers” usually means people/animals that set the pace, or it can refer to the NBA team Indiana Pacers.","zh":"“pacers”通常指领跑者/定速者（人或动物），也可能指NBA球队“印第安纳步行者队”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, animal, or device that sets the speed (pace) for others","zh":"领跑者；定速者（为他人设定速度的人/动物/装置）"},"examples":[{"en":"The pacers helped the runners keep a steady speed.","zh":"领跑员帮助跑者保持稳定的速度。"},{"en":"In the first mile, she followed the pacers to avoid starting too fast.","zh":"在第一英里，她跟着领跑者，避免起跑过快。"}]},{"partOfSpeech":"n.","definition":{"en":"a horse trained to move with a pacing gait; in sports, a horse used in pacing races","zh":"（赛马）溜蹄马；以“溜蹄步态”行进的马"},"examples":[{"en":"The pacers are common in harness racing.","zh":"溜蹄马在挽具赛马中很常见。"},{"en":"That pacer can maintain speed smoothly over long distances.","zh":"那匹溜蹄马能在长距离上平稳保持速度。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indiana Pacers, an NBA basketball team based in Indianapolis (plural team name)","zh":"印第安纳步行者队（NBA印第安纳波利斯球队；队名为复数）"},"examples":[{"en":"The Pacers play their home games in Indianapolis.","zh":"步行者队在印第安纳波利斯打主场比赛。"},{"en":"He’s a big Pacers fan.","zh":"他是步行者队的铁杆球迷。"}]}],"synonyms":["pace-setters","leaders","rabbits (running)","Indiana Pacers (team name)"],"phonetic":"ˈpeɪsər","extraExplanation":["“pacer”来自“pace（步速）”。跑步比赛里的 pacer 常被称为“配速员/领跑员”，他们的工作是把速度跑得很稳定，帮助其他选手达成目标时间。","“Pacers”作为 NBA 球队名时通常不翻译成“领跑者”，中文常用官方译名“步行者”。在新闻里看到大写的 Pacers，通常指球队。"]}
{"word":"paces","summary":{"en":"“Paces” can mean several steps (distance) or different speeds/rhythms; as a verb, it means walks back and forth or sets/keeps a steady speed.","zh":"“paces”可指几步路（距离）或不同的速度/节奏；作动词时表示来回踱步，或控制/保持稳定的速度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Steps taken while walking or running; often used to talk about distance in an informal way.","zh":"（行走或奔跑的）步数；常用来非正式地表示距离。"},"examples":[{"en":"It’s only a few paces to the door.","zh":"到门口只有几步路。"},{"en":"She backed away several paces.","zh":"她后退了好几步。"}]},{"partOfSpeech":"n.","definition":{"en":"Different speeds or rhythms of movement (e.g., walking pace vs. running pace).","zh":"不同的速度或节奏（如走路的速度、跑步的配速）。"},"examples":[{"en":"The coach taught us to change paces during the race.","zh":"教练教我们在比赛中变换配速。"},{"en":"The dancers practiced fast and slow paces.","zh":"舞者练习快慢不同的节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"Moves back and forth; walks repeatedly, often because of thinking, stress, or waiting.","zh":"来回踱步；反复走动，常因思考、焦虑或等待。"},"examples":[{"en":"He paces the room when he’s nervous.","zh":"他紧张时会在房间里来回踱步。"},{"en":"She paces near the window, waiting for the call.","zh":"她在窗边踱步，等电话。"}]},{"partOfSpeech":"v.","definition":{"en":"Sets or keeps a particular speed (for oneself or for others).","zh":"设定或保持某个速度（自己或带着别人）。"},"examples":[{"en":"She paces herself so she doesn’t get tired too early.","zh":"她控制节奏，避免太早疲劳。"},{"en":"The runner paces the team at a steady speed.","zh":"那位跑者以稳定的速度带着队伍前进。"}]}],"synonyms":["steps","strides","gait","speed","rhythm","walk back and forth","stroll"],"phonetic":"/ˈpeɪsɪz/","extraExplanation":["“pace”很常出现在固定搭配里：\n- keep pace with… = 跟上（发展/进度/节奏）\n- at this pace = 按这样下去（常带预测结果）\n- put someone through their paces = 让某人展示本领/测试能力（常用于工作、体育、表演等语境）\n这些表达里即使写的是“pace”，意思也常和“进度/节奏/能力展示”有关。"]}
{"word":"pacesetter","summary":{"en":"A pacesetter is someone (or a team/company) that leads by setting the pace or standard, especially a runner who leads to maintain a target speed.","zh":"pacesetter 指领跑者或标杆：通过设定速度或标准来引领他人，尤指田径比赛中负责带配速的领跑员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or team that sets the speed, level, or standard that others try to follow; a leader in performance or trends.","zh":"领跑者；标杆人物/团队（设定速度、水平或标准，别人跟随）"},"examples":[{"en":"The Kenyan runner was the pacesetter for most of the race.","zh":"那位肯尼亚选手在比赛的大部分时间里都在领跑。"},{"en":"In smartphone design, the company has been a pacesetter for years.","zh":"在智能手机设计方面，这家公司多年来一直是行业标杆。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports (especially track), a runner who intentionally runs in front to keep a planned pace for others, often to help them achieve a target time.","zh":"（体育，尤指田径）配速员；领跑员（按计划速度带跑，帮助他人达成目标成绩）"},"examples":[{"en":"They hired a pacesetter to help the marathon group finish under four hours.","zh":"他们请了配速员帮助这组马拉松选手跑进四小时。"},{"en":"The pacesetter dropped out after 30 kilometers, as planned.","zh":"按计划，配速员在30公里后退出比赛。"}]}],"synonyms":["leader","front-runner","pace-maker","trailblazer","standard-setter"],"phonetic":"/ˈpeɪsˌsɛtɚ/","extraExplanation":["“pace”意为“步速/节奏”，“setter”是“设定者”。合在一起就是“设定节奏的人/事物”。","在商业和媒体语境中，pacesetter 常带有“引领潮流、树立行业标准”的褒义色彩。","相关表达：set the pace（带节奏/领跑）；pace yourself（控制配速）；trendsetter（潮流引领者，侧重时尚与文化趋势）。"]}
{"word":"pacesetters","summary":{"en":"“Pacesetters” are leaders who set the pace—either literally in a race or figuratively in a field by setting standards and direction.","zh":"“pacesetters”指“领跑者/先行者”：既可指比赛中带配速的领跑者，也可指在某领域树立标杆、引领方向的人或团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or groups that set the standard or lead the way in a field, industry, or activity (often through innovation or strong performance).","zh":"在某个领域、行业或活动中树立标杆、引领方向的人或团体（通常靠创新或出色表现）。"},"examples":[{"en":"In renewable energy, several Scandinavian companies are pacesetters in offshore wind technology.","zh":"在可再生能源领域，一些斯堪的纳维亚公司在海上风电技术方面是领跑者。"},{"en":"These researchers are pacesetters, publishing influential studies that others build on.","zh":"这些研究人员是先行者，发表有影响力的研究，供他人继续发展。"}]},{"partOfSpeech":"n.","definition":{"en":"In a race, the runners who run in front to set a fast, steady speed for others (also called “pacers”).","zh":"在比赛中，为他人设定较快且稳定配速、跑在前面带节奏的选手（也可称 pacers）。"},"examples":[{"en":"The marathon pacesetters went out fast, and the pack followed closely.","zh":"马拉松的领跑者一开始速度很快，大部队紧跟其后。"},{"en":"Without pacesetters, it’s harder for athletes to judge their pace early in the race.","zh":"没有领跑者，运动员在比赛前段更难判断自己的配速。"}]}],"synonyms":["leaders","front-runners","trendsetters","pioneers","pacers"],"phonetic":"/ˈpeɪsˌsɛtɚz/","extraExplanation":["“pacesetters”是复数形式；单数为“pacesetter”。由“pace（步速/节奏）+ setter（设定者）”构成，意思是“设定节奏的人/事物”。","在商业或科技语境里，“pacesetter”常带褒义，接近“industry leader（行业领军者）”“trendsetter（潮流引领者）”。但它更强调“定标准/定速度”，不一定意味着规模最大。"]}
{"word":"pacesetting","summary":{"en":"Pacesetting describes something or someone that sets the pace or standard for others to follow.","zh":"pacesetting 指“领跑/定节奏”或“树立标杆、引领他人”的人或事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Setting a speed, level, or standard that others try to match; leading the way in performance or progress.","zh":"制定（他人想要追赶的）速度、水平或标准的；起带头作用的、领先的。"},"examples":[{"en":"The company is known for its pacesetting work in renewable energy.","zh":"这家公司以在可再生能源领域的领先性工作而闻名。"},{"en":"Her pacesetting pace forced the rest of the runners to push harder.","zh":"她的领跑速度迫使其他选手更加努力。"},{"en":"They introduced pacesetting rules that changed how the industry operates.","zh":"他们推出了开创性的规则，改变了行业的运作方式。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of setting the pace for a group, especially in sports or competitions; leadership in speed or rhythm.","zh":"（尤指体育或竞赛中）带领队伍定速/领跑的行为；在速度或节奏上的带动。"},"examples":[{"en":"Strong pacesetting early in the race helped the team stay confident.","zh":"比赛前段强有力的领跑让团队保持了信心。"},{"en":"Coaches practiced pacesetting so the runners wouldn’t start too fast.","zh":"教练训练大家如何领跑，以免选手开局过快。"}]}],"synonyms":["leading","trailblazing","groundbreaking","innovative","front-running"],"phonetic":"/ˈpeɪsˌsɛtɪŋ/","extraExplanation":["“Pacesetting”来自短语“set the pace”（定速度/领跑）。在商业、科技与社会议题语境中，它常带有“树立行业标杆、引领趋势”的褒义色彩，比单纯的“fast（快）”更强调“别人会跟随”。","拼写提示：常见写法是连字符形式“pace-setting”，也可写作合写“pacesetting”，含义相同。"]}
{"word":"paceway","summary":{"en":"Paceway usually means a harness-racing track (often in a venue name) or, less commonly, a guided channel such as a mill waterway.","zh":"Paceway 通常指挽具赛马的赛场（常见于场馆名），较少见时也指类似磨坊水道的导流渠/导向通道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a racetrack, especially one used for harness racing (often used as part of a venue’s name, e.g., “___ Paceway”)","zh":"赛马场；尤指挽具赛马（harness racing）的赛场（常用于场馆名称中，如“___ Paceway”）"},"examples":[{"en":"We went to the Paceway to watch the harness races.","zh":"我们去赛马场看了挽具赛。"},{"en":"The local Paceway hosts races on Saturday nights.","zh":"当地的赛马场每周六晚上举办比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"a channel or track that guides movement, especially a water channel leading to or from a mill (similar to a millrace)","zh":"导流渠；导向通道（尤指通往或离开磨坊的水渠，类似 millrace）"},"examples":[{"en":"Water ran through the paceway to power the old mill.","zh":"水流通过导流渠为那座老磨坊提供动力。"},{"en":"Leaves clogged the paceway after the storm.","zh":"暴风雨后，树叶堵住了导流渠。"}]}],"synonyms":["racetrack","track","harness-racing track","millrace","water channel"],"phonetic":"/ˈpeɪsˌweɪ/","extraExplanation":["“Paceway”在英语里常见于挽具赛马场的专有名称：pacing 指马的一种步态（对侧前后腿同向迈步），因此不少赛场会用 Paceway 来强调“pacing races（快步马赛）”。","第二个意思较偏历史/技术语境，常与旧式水力磨坊一起出现；阅读地方史、老建筑说明或乡村旅游介绍时更可能见到。"]}
{"word":"pacha","summary":{"en":"Pacha is an Andean term meaning the world/cosmos (often linking time and space) and is closely associated with Pachamama, the Earth Mother.","zh":"Pacha 是安第斯语词，意为世界/宇宙（常含时间与空间相连之意），并常与地母 Pachamama 的概念相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Andean languages, especially Quechua/Aymara) the world or cosmos; sometimes also the notions of time and space together.","zh":"（安第斯语言，尤指克丘亚语/艾马拉语）世界、宇宙；有时也指“时间与空间”的整体概念。"},"examples":[{"en":"In Quechua, pacha can refer to the world and to time as a connected idea.","zh":"在克丘亚语中，pacha 可指“世界”，也可指“时间”，两者常被视为相连的概念。"},{"en":"Many Andean stories describe how people should live in balance with pacha.","zh":"许多安第斯地区的故事会讲人们应如何与 pacha 保持平衡。"}]},{"partOfSpeech":"n.","definition":{"en":"often used in the name Pachamama (“Mother Earth”), a revered Earth Mother figure in Andean Indigenous traditions.","zh":"常见于 Pachamama（“大地之母/地母”）一词中，指安第斯原住民传统中受敬奉的“地母”形象。"},"examples":[{"en":"People may give thanks to Pachamama before planting crops.","zh":"人们在播种前可能会向 Pachamama 表达感谢。"},{"en":"The ceremony honors pacha and the land that supports the community.","zh":"这个仪式敬奉 pacha，也敬奉养育社区的土地。"}]}],"synonyms":["Pachamama","Mother Earth","the cosmos","the world"],"phonetic":"/ˈpɑːtʃə/","extraExplanation":["“pacha”在安第斯文化里常带有精神与伦理意味：不仅是“世界/土地”，也隐含“秩序、关系与平衡”。因此在英语语境中出现时，往往与自然、土地、传统仪式（如对大地的感谢与供奉）相关。","英语文本里更常见的是“Pachamama”（地母/大地之母）；单独写“pacha”时，通常是在讨论克丘亚语词源、安第斯宇宙观或文化概念。"]}
{"word":"pachadom","summary":{"en":"“pachadom” is not a standard English word; it may be a misspelling or a proper name.","zh":"“pachadom”不是标准英文词；可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a name, or a term from a specific community or language.","zh":"不是标准英语单词；更可能是拼写错误、专有名词（人名/地名/品牌名），或来自特定社群/其他语言的用语。"},"examples":[{"en":"I can’t find “pachadom” in an English dictionary—could it be a name or a typo?","zh":"我在英文词典里找不到“pachadom”——它会不会是名字或拼写错误？"},{"en":"If you tell me where you saw “pachadom,” I can help identify what it means.","zh":"如果你告诉我你在哪儿看到“pachadom”，我可以帮你确认它的意思。"}]}],"phonetic":"/ˈpɑːtʃədəm/","extraExplanation":["“pachadom”在常见英语语料与主流词典中不收录。你可能想写的是：\n1) pachyderm /ˈpækɪdɝːm/（厚皮动物，如大象、犀牛；也可比喻“行动迟缓的人/事物”）\n2) “Pachadam/Pachadi”（南亚语境里的食物名，常见于印度喀拉拉等地；不同拼写很多）\n如果你能提供：①完整句子 ②出处（书/游戏/社交媒体/歌曲）③你想表达的意思（比如“某种食物/某种动物/人名”），我就能给出准确释义与例句。"]}
{"word":"pachadoms","summary":{"en":"Poppadoms (also spelled papadums) are thin, crispy Indian lentil-flour crackers served as a snack or side.","zh":"Poppadoms（也拼作 papadums）是薄而脆的印度扁豆粉薄脆片，常作零食或配菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, crisp Indian flatbread (often made from lentil or chickpea flour), usually served as an appetizer or side dish, sometimes with chutney or pickles.","zh":"一种薄而脆的印度薄饼（常用扁豆粉或鹰嘴豆粉制作），通常作为开胃菜或配菜，常搭配酸辣酱或腌菜食用。"},"examples":[{"en":"We ordered poppadoms with mango chutney before the curry arrived.","zh":"咖喱还没上，我们先点了薄脆饼配芒果酸辣酱。"},{"en":"Some restaurants serve papadums roasted instead of fried.","zh":"有些餐厅会把薄脆饼烤制而不是油炸。"}]}],"synonyms":["poppadoms","poppadums","papadums","papadoms"],"phonetic":"/ˈpɑːpəˌdʌmz/","extraExplanation":["“pachadoms”看起来像拼写误差；英语里更常见的是 **poppadoms / poppadums**（英式拼写常见）或 **papadums / papadoms**（也很常见）。","这个词来自南亚语言（如泰米尔语 *pappadam*），在英语语境中多指印度餐馆里先上的那种“薄脆片”。不同地区口味与做法会有差异：可油炸、烘烤或用明火烤。"]}
{"word":"pachak","summary":{"en":"Pachak is a South Asian (especially Indian) digestive mix or snack eaten after meals.","zh":"Pachak 指印度等南亚常见的饭后助消化调味粉或小零食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian, especially Indian) A digestif or digestive snack/seasoning, often a tangy-spicy mix (commonly including roasted cumin, black salt, dried mango powder, fennel, etc.) eaten after meals to help digestion.","zh":"（南亚/印度常用）“助消化零食/调味料”，通常是酸辣咸香的混合粉或小零嘴（常含烤孜然、黑盐、芒果干粉、茴香等），饭后少量食用以帮助消化。"},"examples":[{"en":"My grandmother always keeps pachak at home for after heavy meals.","zh":"我奶奶家里总备着 pachak，吃完油腻大餐后会来一点。"},{"en":"The street vendor sells pachak in small sachets near the school.","zh":"学校附近的小摊会卖小包的 pachak。"},{"en":"Try a pinch of pachak on fruit for a tangy, spicy kick.","zh":"在水果上撒一小撮 pachak，会有酸辣开胃的味道。"}]}],"synonyms":["digestive mix","digestif (general sense)","churan (related term)"],"phonetic":"/pəˈtʃɑk/","extraExplanation":["“Pachak”源自印地语/乌尔都语等南亚语言，和动词词根“pach-（消化）”相关，所以它的核心含义就是“帮助消化的东西”。","不同地区的 pachak 配方差异很大：有的更像酸辣粉末（类似果味调味粉），有的更接近“口气清新+助消化”的饭后小零嘴。购买时常见包装写作“pachak/ digestive/ churan”。","英语里它多作为借词出现在与印度饮食文化相关的语境中；在正式英文中有时会用更通用的说法 like “digestive mix” 来解释。"]}
{"word":"pachalic","summary":{"en":"“Pachalic” means “of a pashalik,” an Ottoman province governed by a pasha.","zh":"“pachalic”意为“与帕夏辖区有关的”，指奥斯曼帝国由帕夏统治的省区/领地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pashalik (also spelled “pachalique”): a province or territory governed by a pasha in the Ottoman Empire.","zh":"与“帕夏辖区/帕夏领地”（pashalik，也作 pachalique）有关的；指奥斯曼帝国中由帕夏（pasha）统治的省区或领地的。"},"examples":[{"en":"The novel describes life on the edges of a remote pachalic under Ottoman rule.","zh":"这部小说描写了奥斯曼统治下一个偏远帕夏辖区边缘的生活。"},{"en":"Merchants crossed from one pachalic to another, paying taxes at each checkpoint.","zh":"商人从一个帕夏辖区进入另一个，在每个关卡都要缴税。"}]}],"synonyms":["pashalic","Ottoman provincial"],"phonetic":"/pəˈʃælɪk/","extraExplanation":["“pachalic”在现代英语里很少见，更常见的拼写是“pashalic”。二者都来自“pasha（帕夏）”，帕夏是奥斯曼帝国中高级官员/总督的称号。","历史与语境：在18—19世纪的旅行记、历史著作或文学作品中更容易遇到该词，用来营造“奥斯曼时期行政区划/异域历史背景”的氛围。"]}
{"word":"pachalics","summary":{"en":"“Pachalics” is the plural of pachalic (more commonly spelled pashalik): an Ottoman province governed by a pasha.","zh":"“pachalics”是 pachalic（更常见拼写 pashalik）的复数：指奥斯曼帝国中由帕夏统治的省区/行政区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a province or territory governed by a pasha in the Ottoman Empire; an Ottoman administrative district","zh":"（奥斯曼帝国中）由帕夏（pasha）统治的省区、辖区；奥斯曼的行政区"},"examples":[{"en":"In the 18th century, the region was administered as an Ottoman pachalic.","zh":"在18世纪，这一地区作为奥斯曼的一个帕夏辖区（pachalic）进行管理。"},{"en":"The revolt spread from one pachalic to the next along the coast.","zh":"叛乱沿海岸线从一个帕夏辖区蔓延到另一个。"}]}],"synonyms":["pashalik","province","governorship"],"phonetic":"/ˈpæʃəlɪk/","extraExplanation":["“pachalic”更常见的拼写是“pashalik”（也写作“pashalik / pashalick”）。你输入的“pachalics”很可能是复数形式或拼写变体。","词源上与“pasha”（帕夏，奥斯曼帝国的高级官员/总督称号）有关，因此该词多出现在历史书写、旅行记或研究奥斯曼行政制度的语境中。"]}
{"word":"pachanga","summary":{"en":"Pachanga means a lively Latin-style party, and it can also refer to a related Cuban music/dance style.","zh":"Pachanga 指热闹的拉丁风格派对，也可指相关的古巴音乐/舞蹈风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively Latin American (especially Cuban/Puerto Rican) party with music and dancing; also the music/dance style associated with it.","zh":"热闹的拉丁美洲派对（尤指古巴/波多黎各风格），有音乐和舞蹈；也可指与之相关的音乐/舞蹈风格。"},"examples":[{"en":"We went to a pachanga with salsa music and lots of dancing.","zh":"我们去参加了一场 pachanga，有萨尔萨音乐，大家跳了很多舞。"},{"en":"They played pachanga all night, and the dance floor stayed full.","zh":"他们整晚都在放 pachanga 音乐，舞池一直人满为患。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, mainly in U.S. Spanish) Any big, fun celebration or get-together; a festive time.","zh":"（非正式，多见于美国西语语境）泛指任何热闹、有趣的庆祝或聚会；欢乐的场面。"},"examples":[{"en":"After finals, our friends threw a pachanga at their apartment.","zh":"期末考完后，我们朋友在公寓里办了个热闹的聚会。"},{"en":"Come by this weekend—there’s a pachanga for my cousin’s birthday.","zh":"这周末来吧——我表亲生日要办一场热闹的庆祝。"}]}],"synonyms":["fiesta","party","celebration","dance party"],"phonetic":"/pɑˈtʃɑŋɡɑ/","extraExplanation":["“Pachanga”来自西班牙语，在加勒比西语文化里常用来指热闹的派对。它也指一种在1960年代流行的古巴音乐/舞蹈风格（常和恰恰、曼波等拉丁舞曲文化一起被提到）。","英语里通常直接借用这个词，带有文化色彩：说“a pachanga”往往暗示拉丁音乐、跳舞、热闹氛围。正式写作中不太常用，更常见于口语、社交媒体或文化相关语境。","相关表达：fiesta（更通用的“派对/节庆”）、bailar（跳舞）、salsa night（萨尔萨之夜）。"]}
{"word":"pachas","summary":{"en":"“Pachas” is usually the plural of “pacha,” meaning Andean worlds/realms of time-and-space, or (less commonly) the plural of “pacha/pasha,” meaning Ottoman high officials or powerful people.","zh":"“pachas”通常是“pacha”的复数，指安第斯文化中的“世界/时空领域”；较少见时也可作“pacha/pasha（帕夏）”的复数，指奥斯曼帝国高级官员或（引申）有权势的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of pacha) In Andean culture, “pachas” are worlds or realms of time-and-space (often understood as the earth/world and its connected dimensions).","zh":"（pacha 的复数）在安第斯文化中，“pachas”指“世界/时空的领域”，常可理解为大地、世界及其相连的不同层面。"},"examples":[{"en":"In some stories, the pachas are linked, so what happens in one realm affects another.","zh":"在一些故事里，不同的 pachas 是相连的，所以一个领域发生的事会影响另一个。"},{"en":"The ritual was meant to honor the pachas and keep balance in the world.","zh":"这个仪式旨在敬奉 pachas，维持世界的平衡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of pacha, a variant of pasha) High-ranking officials in the former Ottoman Empire; by extension (often humorous), very powerful or important people.","zh":"（pacha 的复数，pasha 的变体）指奥斯曼帝国时期的高级官员；引申义（常带幽默）指“有权势的大人物”。"},"examples":[{"en":"The novel describes pachas living in luxury at the imperial court.","zh":"小说描写了宫廷里过着奢华生活的 pachas。"},{"en":"He acts like one of the pachas in the office—always giving orders.","zh":"他在办公室里像个 pacha 一样——总是发号施令。"}]}],"synonyms":["realms","worlds","domains","dignitaries","big shots"],"phonetic":"/ˈpɑːtʃəz/","extraExplanation":["“Pacha”在克丘亚语（Quechua）中常与“时间/空间、世界/大地”相关，比如“Pachamama”（大地母亲）。在安第斯世界观里，它不只是“地球”，也带有“时空与秩序”的概念。","“Pacha/Pasha（帕夏）”源自奥斯曼帝国的官衔，英语更常见拼写是“pasha”。在现代口语或文学里，有时会用来调侃“像大人物一样摆架子的人”。"]}
{"word":"pacher","summary":{"en":"“Pacher” is not a standard English word; it is usually a misspelling of “poacher” (an illegal hunter; or to illegally hunt / to recruit unfairly).","zh":"“pacher”不是标准英语单词；通常是把“poacher”拼错（偷猎者；或非法捕猎/不正当挖人）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling in English; most often a misspelling of “poacher.”","zh":"英语中不规范的拼写；最常见是把 “poacher” 拼错。"},"examples":[{"en":"I couldn’t find “pacher” in the dictionary—did you mean “poacher”?","zh":"我在词典里找不到 “pacher”——你是不是想写 “poacher”？"},{"en":"The correct spelling is “poacher,” not “pacher.”","zh":"正确拼写是 “poacher”，不是 “pacher”。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you mean “poacher”) a person who hunts, fishes, or collects wild animals/plants illegally.","zh":"（如果你想写 “poacher”）偷猎者；非法捕猎、捕鱼或采集野生动植物的人。"},"examples":[{"en":"Park rangers arrested a poacher for hunting deer out of season.","zh":"护林员逮捕了一名在禁猎期猎鹿的偷猎者。"},{"en":"Poachers threaten endangered species like rhinos and elephants.","zh":"偷猎者威胁着犀牛和大象等濒危物种。"}]},{"partOfSpeech":"v.","definition":{"en":"(If you mean “poacher”) to hunt, fish, or take wildlife illegally, or to take something unfairly (e.g., employees from another company).","zh":"（如果你想写 “poacher”）非法捕猎/捕鱼；（引申）不正当地挖走（他公司员工等）。"},"examples":[{"en":"It’s illegal to poach animals in a protected area.","zh":"在保护区偷猎是违法的。"},{"en":"The startup tried to poach engineers from a bigger company.","zh":"那家初创公司试图从大公司挖走工程师。"}]}],"synonyms":["(for poacher, n.) illegal hunter","(for poacher, v.) hunt illegally","(business sense) headhunt"],"phonetic":"/ˈpoʊtʃər/","extraExplanation":["“poacher”常和野生动物保护语境一起出现：poaching（偷猎）是全球性问题，新闻里常见于“anti-poaching patrols（反偷猎巡逻）”“wildlife trafficking（野生动物走私）”。","如果你原本想表达“补丁/修补的人”，英语更常用“patcher”（修补者/补丁程序）而不是“pacher”。"]}
{"word":"pachinko","summary":{"en":"Pachinko is a Japanese pinball-like gambling game, and by extension the machine or the parlor; it can also symbolize aspects of modern Japanese leisure culture.","zh":"Pachinko是一种日本常见、类似弹珠台的博彩游戏，也可指机器或店铺；引申上还可作为现代日本娱乐文化的象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Japanese arcade gambling game played on a vertical pinball-like machine; also the machine itself or the parlor where it’s played.","zh":"一种日本常见的街机博彩游戏（类似直立式弹珠台）；也可指这种机器本身或经营它的店（弹珠店）。"},"examples":[{"en":"After dinner, they walked past a pachinko parlor filled with flashing lights and loud music.","zh":"晚饭后，他们路过一家灯光闪烁、音乐很吵的弹珠店（pachinko店）。"},{"en":"He spent a few hours playing pachinko, hoping to win enough balls to exchange for prizes.","zh":"他玩了几个小时的pachinko，希望赢到足够的钢珠去换奖品。"},{"en":"In some Japanese cities, pachinko shops are as common as convenience stores.","zh":"在一些日本城市，pachinko店和便利店一样常见。"}]},{"partOfSpeech":"n.","definition":{"en":"A popular cultural symbol used to suggest Japan’s neon nightlife, leisure culture, and debates about gambling and regulation.","zh":"（引申）一种文化符号，常用来指涉日本霓虹夜生活、娱乐文化，以及关于赌博与监管的争议。"},"examples":[{"en":"The film uses pachinko as a backdrop to show the loneliness of city life.","zh":"这部电影以pachinko为背景，表现都市生活的孤独感。"},{"en":"Her essay mentions pachinko to discuss how entertainment and money can mix uneasily.","zh":"她的文章提到pachinko，用来讨论娱乐与金钱如何产生微妙冲突。"}]}],"synonyms":["Japanese pinball (informal)","pachinko parlor"],"phonetic":"/pəˈtʃiŋkoʊ/","extraExplanation":["“Pachinko（パチンコ）”在日本非常普遍，法律上常被归为“娱乐”而非直接赌博：玩家赢到钢珠后通常换奖品，再通过其他渠道间接换取现金，因此也常引发社会讨论。","英文里“pachinko”也常因文学与影视作品而被更多人认识，例如李珉贞（Min Jin Lee）的小说《Pachinko》，书名借用这一文化符号来呈现人物命运与社会结构的复杂性。"]}
{"word":"pachisi","summary":{"en":"Pachisi is a traditional Indian board game where players race pieces around a cross-shaped board to reach home.","zh":"Pachisi 是一种传统印度棋盘游戏，玩家让棋子沿十字形路线竞速回家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Indian cross-and-circle board game (often called the national game of India), played with cowrie shells or dice and pieces that race around the board to reach home.","zh":"一种传统印度“十字与圆”棋盘游戏（常被称为“印度的民族游戏”），用贝壳或骰子掷点，棋子沿路线竞速回到终点。"},"examples":[{"en":"We learned about pachisi while studying Indian culture and traditional games.","zh":"我们在学习印度文化和传统游戏时了解了帕奇西（pachisi）。"},{"en":"Pachisi is similar in idea to Ludo, but the rules and board details can be different.","zh":"帕奇西的玩法理念和飞行棋（Ludo）相近，但规则和棋盘细节可能不同。"}]}],"synonyms":["Indian cross-and-circle game","Ludo (related/variant)","Parcheesi (adapted form)"],"phonetic":"/pəˈtʃiːsi/","extraExplanation":["“Pachisi”一词来自印地语/乌尔都语“pachīs（二十五）”，与游戏中常见的得分/掷点方式有关（传统上常用贝壳计点）。","在英语世界里，pachisi 常被用来指“印度传统原版”，而更简化、商业化的版本常以 Ludo、Parcheesi（英语商品名）等名称出现；Parcheesi 是美国常见的改编版拼写。","在文学与文化语境中，它常被用来象征“人生如棋/命运的推进”，也会在介绍莫卧儿宫廷娱乐或印度民俗时出现。"]}
{"word":"pachisis","summary":{"en":"“Pachisis” is a very rare technical word used to mean abnormal thickening of tissue.","zh":"“pachisis”是极少见的技术用语，通常用来表示组织异常增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare; medical/technical) An abnormal thickening of a tissue or structure.","zh":"（极少见；医学/技术用语）指组织或结构出现异常增厚。"},"examples":[{"en":"The report mentioned pachisis of the affected membrane.","zh":"报告提到受影响的膜出现了增厚（pachisis）。"},{"en":"Doctors looked for signs of pachisis on the scan.","zh":"医生在影像检查中寻找组织增厚（pachisis）的迹象。"}]}],"synonyms":["thickening"],"phonetic":"/ˈpækɪsɪs/","extraExplanation":["“pachisis”并不是现代英语里常见或规范的词条，很多词典中找不到。它看起来像由希腊语词根 *pachy-*（厚的）+ 后缀 *-isis*（……的状态/过程）构成，因此有时会被用来表示“增厚”。","如果你是在医学文献里看到的，也有可能是拼写或转写差异。你可以核对原文是否其实是 **pachysis**（增厚）或其他以 **pachy-** 开头的术语（如 *pachydermia* 皮肤增厚、*pachymeningitis* 硬脑膜炎/硬脑膜增厚等）。","如果你把看到它的句子或领域（例如眼科、神经科、解剖学）发我，我可以更准确地判断它指的具体结构与更合适的常用术语。"]}
{"word":"pachnolite","summary":{"en":"Pachnolite is a rare fluoride mineral, typically found in association with cryolite.","zh":"Pachnolite 是一种罕见的氟化物矿物，通常与冰晶石伴生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral (a hydrated sodium-calcium-aluminum fluoride) usually found as small crystals, often associated with cryolite deposits.","zh":"一种罕见矿物（含水的钠—钙—铝氟化物），常以细小晶体出现，常与冰晶石矿床伴生。"},"examples":[{"en":"Pachnolite is a rare fluoride mineral that may appear alongside cryolite in certain deposits.","zh":"Pachnolite 是一种罕见的氟化物矿物，在某些矿床中可能与冰晶石共生。"},{"en":"The museum’s display includes a tiny specimen labeled “pachnolite,” noted for its association with cryolite minerals.","zh":"博物馆展柜里有一小块标注为“pachnolite”的标本，并注明它常与冰晶石类矿物伴生。"}]}],"synonyms":["(no common everyday synonyms)"],"phonetic":"/pækˈnoʊ.laɪt/","extraExplanation":["词源常解释为来自希腊语 *pachnē*（霜、霜花）+ *lithos*（石头），用来形容其“像霜一样的外观”。","它属于矿物学/地质学术语，日常英语中几乎不会用到；在阅读矿物名录、矿物鉴定或博物馆标签时更常见。"]}
{"word":"pachometer","summary":{"en":"A pachometer is a thickness-measuring instrument, often used for thin materials or the eye’s cornea.","zh":"pachometer 指“厚度计/测厚仪”，常用于测量薄材料或眼科中的角膜厚度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure thickness, especially of thin materials or biological tissue (such as the cornea in eye exams).","zh":"厚度计；用于测量厚度的仪器，尤其常用于薄材料或生物组织（如眼科检查中的角膜厚度）。"},"examples":[{"en":"The technician used a pachometer to measure the thickness of the cornea before surgery.","zh":"技术人员在手术前用厚度计测量角膜厚度。"},{"en":"In quality control, a pachometer can help check whether a sheet is within the required thickness range.","zh":"在质量控制中，厚度计可以帮助检查薄片是否在规定的厚度范围内。"}]}],"synonyms":["pachymeter","thickness gauge","micrometer (in some contexts)"],"phonetic":"/pæˈkɑːmɪtər/","extraExplanation":["“pachometer”在英语里较少见，更常见的拼写是“pachymeter”。在眼科场景中也常用“pachymeter / pachymetry（角膜测厚/角膜测厚术）”。","词源来自希腊语“pachy-（厚）+ -meter（测量器）”，因此核心含义就是“测厚”。","如果你是在眼科报告、医疗器械说明书或验光/眼压相关语境里看到它，通常指“角膜测厚仪”。"]}
{"word":"pachomian","summary":{"en":"Pachomian means “related to Saint Pachomius or his early Christian communal monastic system.”","zh":"Pachomian 意为“与帕科米乌斯圣人或其早期基督宗教团体共住式修道制度有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Saint Pachomius (c. 292–348) or to the monastic system he founded, especially communal (cenobitic) Christian monastic life in early Egypt.","zh":"与帕科米乌斯圣人（约公元292–348年）或其所创立的修道制度有关的；尤指埃及早期基督宗教的“团体共住式”（共住修道）修道生活。"},"examples":[{"en":"The book explains Pachomian monastic rules for daily work, prayer, and meals.","zh":"这本书解释了帕科米乌斯式修道规条中关于日常劳动、祈祷与用餐的安排。"},{"en":"Scholars often contrast Pachomian communities with the solitary life of desert hermits.","zh":"学者常把帕科米乌斯式团体修道与沙漠隐修士的独居生活作对比。"}]}],"synonyms":["cenobitic"],"phonetic":"/pəˈkoʊmiən/","extraExplanation":["“Pachomian”来自圣人 Pachomius（中文常译“帕科米乌斯/帕科米”）之名。他被视为早期“共住修道”（cenobitic monasticism）的重要奠基者之一：修士不再各自独居，而是在同一团体中共同生活、劳动与祈祷，并遵守统一规章。","在宗教史或教会史写作中，Pachomian 常用来描述与其修道院制度相关的组织形式、规条（rule）、灵修传统与文献。"]}
{"word":"pachons","summary":{"en":"“Pachons” most often refers to Pachón Navarro dogs (plural), a rare term in English.","zh":"“pachons”在英文中多指帕孔犬/纳瓦拉帕孔犬（复数），属于较少见的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) plural of pachon; usually refers to Pachón Navarro dogs (a Spanish pointing/gun-dog breed).","zh":"（罕见）pachon 的复数；通常指西班牙的帕孔犬/纳瓦拉帕孔犬（Pachón Navarro，一种指示/猎枪犬品种）。"},"examples":[{"en":"They keep two pachons for hunting quail in the fall.","zh":"他们养了两只帕孔犬，秋天用来打鹌鹑。"},{"en":"Pachons are known for their strong nose and steady pointing.","zh":"帕孔犬以嗅觉灵敏、指示姿势稳定而出名。"}]}],"synonyms":["Pachón Navarro","Spanish pointer","pointing dog","gun dog"],"phonetic":"/pɑˈtʃoʊn/","extraExplanation":["“Pachón”是西班牙语拼写，常见于犬种名称“Pachón Navarro”（纳瓦拉帕孔犬），与西班牙纳瓦拉地区有关。在英文里这个词很少单独使用，多出现在犬种介绍、狩猎/猎犬语境中。","如果你是在别的语境看到 pachons（例如人名、地名、品牌或游戏/小说里的专有名词），含义可能不同；可以告诉我完整句子，我能更准确解释。"]}
{"word":"pachouli","summary":{"en":"Patchouli is a fragrant plant and the essential oil from its leaves, widely used in perfumes and incense.","zh":"Patchouli 指广藿香（或其精油），常用于香水与熏香等，气味浓郁持久。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong-smelling plant whose leaves produce an essential oil used in perfumes, incense, and soaps.","zh":"一种气味浓烈的植物，其叶子可提取精油，用于香水、熏香和肥皂等。"},"examples":[{"en":"This perfume has a warm patchouli base note.","zh":"这款香水的基调带有温暖的广藿香味。"},{"en":"Some people love patchouli, but others find it too strong.","zh":"有些人很喜欢广藿香，但也有人觉得味道太浓。"}]}],"synonyms":["patchouli oil","essential oil (general)"],"phonetic":"/pəˈtʃuːli/","extraExplanation":["你输入的“pachouli”常见为拼写错误；标准拼写是 **patchouli**（中文常译“广藿香”）。","Patchouli 的香味常被形容为“木质、泥土气、微甜、带草本感”，在香水里常作“基调（base note）”，留香时间较长。","词源来自南亚语言（如泰米尔语一带的称呼），通过贸易进入欧洲语言；在西方文化中也常与香薰、精油、某些复古香水风格相关联。"]}
{"word":"pachoulis","summary":{"en":"“Pachoulis” is probably a misspelling of “patchouli,” a fragrant plant/oil used in perfume and incense.","zh":"“pachoulis”很可能是“patchouli（广藿香）”的误拼，指用于香水与熏香的芳香植物或其精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “patchouli”: a strong-smelling plant (or its oil) used in perfumes, incense, and scented products.","zh":"很可能是“patchouli（广藿香）”的拼写错误：一种气味浓烈的植物（或其精油），常用于香水、熏香和各种香氛产品。"},"examples":[{"en":"This perfume has a warm patchouli base note.","zh":"这款香水的基调里有温暖的广藿香味。"},{"en":"The shop smelled like incense and patchouli oil.","zh":"那家店闻起来像熏香和广藿香精油的味道。"}]}],"synonyms":["patchouli oil","fragrance","perfume note"],"phonetic":"/pəˈtʃuːli/","extraExplanation":["“pachoulis”在英语中不算常见规范拼写，最常见对应词是“patchouli”。如果你想表达复数（多种/多瓶广藿香产品），通常仍会说“patchouli”作不可数名词；需要强调种类时可说“patchouli scents/oils/products”。","广藿香（patchouli）在西方香水里常被描述为“earthy（土壤气息）/woody（木质）/musky（麝香感）”。在一些文化语境中，它也与20世纪60—70年代的嬉皮士（hippie）香氛风格有关。"]}
{"word":"pacht","summary":{"en":"“Pacht” is a German/Dutch term meaning a lease (often for land) or the rent paid for it.","zh":"“Pacht”是德语/荷兰语用词，指（常见于土地的）租赁/承租合同或其租金（地租）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In German/Dutch contexts) a lease or tenancy agreement, especially for renting land or a farm; the rent paid under such an agreement.","zh":"（德语/荷兰语语境）租赁；（尤指土地、农场的）承租合同；以及由此支付的租金（地租）。"},"examples":[{"en":"The farmer renewed the Pacht for another five years.","zh":"那位农民把土地承租合同（Pacht）又续了五年。"},{"en":"Under the Pacht, the tenant pays rent and maintains the land.","zh":"按照这份租约（Pacht），承租人既要付租金，也要负责维护土地。"}]}],"synonyms":["lease","tenancy","rent","land lease"],"phonetic":"/pɑkt/","extraExplanation":["“Pacht”主要是德语词（在荷兰语中也有类似用法），在英语里通常出现在讨论德国/欧洲历史、法律、农业或地产制度的文章中，作为外来词使用。","德语里的“ch”常接近清音擦音 /x/（类似轻微的“哈”音），但英语使用者常把它近似读成 /k/。"]}
{"word":"pachuco","summary":{"en":"A “pachuco” is a Mexican American youth linked to a 1940s urban subculture known for zoot suits, slang, and distinctive style.","zh":"“pachuco”指与20世纪40年代城市青年亚文化有关的墨西哥裔美国青年，常以佐特装、俚语和鲜明风格著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mexican American youth (especially in the 1940s in the U.S. Southwest) known for a distinctive urban style, slang, and often the zoot suit; also, a person associated with that subculture","zh":"（尤指20世纪40年代美国西南部的）墨西哥裔美国青年，因独特的城市风格、俚语以及常见的“宽肩长衣的zoot suit（佐特装）”而闻名；也指与这种亚文化有关的人"},"examples":[{"en":"In the 1940s, pachucos in Los Angeles popularized the zoot suit and a bold street style.","zh":"在20世纪40年代，洛杉矶的pachuco群体让佐特装和大胆的街头风格流行起来。"},{"en":"The film shows a young man trying to balance family expectations with the identity of a pachuco.","zh":"电影展现了一位年轻人试图在家庭期待与pachuco身份之间取得平衡。"}]}],"synonyms":["zoot-suiter","zoot suiter","Chicano (context-dependent)"],"phonetic":"/pəˈtʃuːkoʊ/","extraExplanation":["“Pachuco”通常与1940年代墨西哥裔美国人的城市青年文化联系紧密，常见元素包括zoot suit（宽肩、长外套、宽松长裤）、特定发型与姿态，以及带有双语色彩的俚语表达。这个词在历史上有时曾被带有偏见地使用；在一些语境中也可能被部分社群重新认同为一种文化身份。","历史语境常与“Zoot Suit Riots（佐特装骚乱，1943年）”并置讨论：当时围绕服饰、种族与社会紧张关系产生冲突，因此该词在不同文本中可能带有社会阶层与族裔政治的含义。","在文学与戏剧中，pachuco形象常用于呈现身份认同与文化夹缝。例如路易斯·巴尔德斯（Luis Valdez）的戏剧《Zoot Suit》中就出现了象征性的“Pachuco”角色。"]}
{"word":"pachucos","summary":{"en":"“Pachucos” are Mexican American youths linked to a 1940s subculture famous for zoot suits, slang, and a rebellious style.","zh":"“Pachucos”指与20世纪40年代佐特装、俚语和反叛风格相关的墨裔美国青年群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mexican American youths (especially in the U.S. Southwest) associated with a 1940s urban subculture known for zoot suits, distinctive slang, and a rebellious style.","zh":"指（尤指美国西南部）与20世纪40年代城市亚文化相关的墨裔美国年轻人，以穿“佐特装”（zoot suit）、独特俚语和反叛风格著称。"},"examples":[{"en":"In the 1940s, pachucos were often recognized by their zoot suits and sharp, exaggerated style.","zh":"在20世纪40年代，pachucos 常因穿佐特装以及夸张利落的造型而被认出。"},{"en":"The film includes characters inspired by pachucos and their street slang.","zh":"这部电影里有一些角色受到 pachucos 及其街头俚语的启发。"}]}],"synonyms":["zoot-suiters (informal)","Mexican American youth subculture members"],"phonetic":"/pɑˈtʃuːkoʊz/","extraExplanation":["“Pachucos”是复数形式，单数是“pachuco”。在历史语境中，它常与1943年的“Zoot Suit Riots（佐特装骚乱）”一起被提到，反映当时对墨裔青年文化的偏见与社会紧张。","在文学与戏剧中，这个形象常被用来讨论身份认同与文化冲突；例如路易斯·巴尔德斯（Luis Valdez）的戏剧《Zoot Suit》中就借用了pachuco的形象。"]}
{"word":"pachy","summary":{"en":"“Pachy” means “thick/bulky” (often informal), and it also connects to the scientific prefix pachy- meaning “thick.”","zh":"“pachy”可指“厚、臃肿”（多为非正式用法），也与科学前缀 pachy-（表示“厚”）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) thick, heavy, or bulky—often used humorously.","zh":"（非正式）厚的、笨重的、臃肿的；常带一点开玩笑的语气。"},"examples":[{"en":"These pachy winter boots are warm but hard to pack.","zh":"这双厚重的冬靴很暖和，但不好打包。"},{"en":"The jacket looks a bit pachy on me—do you have a slimmer one?","zh":"这件外套穿在我身上有点臃肿——有更修身的吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical/biology, from the prefix pachy-) relating to thickness; used in scientific terms (e.g., “pachyderm” = thick-skinned animal).","zh":"（医学/生物学，源自前缀 pachy-）与“厚度”有关；常见于科学术语中（如 pachyderm 指“厚皮动物”）。"},"examples":[{"en":"The term comes from pachy-, meaning “thick,” plus derm, meaning “skin.”","zh":"这个词由表示“厚”的 pachy- 和表示“皮肤”的 derm 构成。"},{"en":"Doctors may use pachy- in technical words that describe tissue thickness.","zh":"医生可能会在描述组织厚度的专业词汇中使用 pachy-。"}]}],"synonyms":["thick","bulky","chunky","heavy","puffy"],"phonetic":"/ˈpæki/","extraExplanation":["“pachy”本身在日常英语里不算常见，更常见的是作为词根/前缀“pachy-”出现在学术词里：如 pachyderm（厚皮动物：大象、犀牛等）、pachycephaly（头骨过厚/头大的一种医学表达）。如果你是在医学报告或生物学文章里看到它，通常是在提示“厚/增厚”的概念。"]}
{"word":"pachyacria","summary":{"en":"A rare medical term for thickened, enlarged hands/feet (enlarged extremities).","zh":"一个少见的医学词，指手脚等肢端增厚、增大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) Thickening and enlargement of the extremities (especially the hands and feet), often associated with conditions such as acromegaly.","zh":"（医学，少见）四肢末端（尤其手和脚）的增厚与增大，常与肢端肥大症等情况相关。"},"examples":[{"en":"The doctor noted signs of pachyacria, including unusually large hands.","zh":"医生注意到肢端增厚增大的迹象，包括异常大的手。"},{"en":"In older medical writing, pachyacria was sometimes discussed alongside acromegaly.","zh":"在较早的医学文献中，“pachyacria”有时会与“肢端肥大症（acromegaly）”一起讨论。"}]}],"synonyms":["acromegaly","enlarged extremities","acral thickening"],"phonetic":"/ˌpækiˈækriə/","extraExplanation":["这个词很少在日常英语中出现，更常见的医学用语是“acromegaly（肢端肥大症）”。","词源上可拆分理解：pachy- 表示“厚、粗”（如 pachyderm 厚皮动物），-acria 与“末端/肢端”有关。整体意思就是“肢端变厚、变大”。","如果你是在报告、化验单或论文里看到它，建议结合上下文确认是否在描述肢端肥大症、肢端软组织增厚，或相关的体征（如手足增大）。"]}
{"word":"pachyaemia","summary":{"en":"A rare medical term meaning abnormally thick/viscous blood.","zh":"较少见的医学词，指血液异常增稠（黏稠度过高）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal condition in which the blood is unusually thick or viscous; “thickened blood.”","zh":"（医学）血液异常增稠、黏稠度过高的状态；“血变稠”。"},"examples":[{"en":"Severe dehydration can contribute to pachyaemia by reducing plasma volume.","zh":"严重脱水会因血浆容量减少而导致血液更黏稠，进而出现 pachyaemia（血液增稠）。"},{"en":"Symptoms may relate to reduced circulation when pachyaemia is pronounced.","zh":"当血液增稠（pachyaemia）较明显时，症状可能与循环变差有关。"}]}],"synonyms":["hyperviscosity","thickened blood","increased blood viscosity"],"phonetic":"/ˌpækiˈimiə/","extraExplanation":["这是一个较少见的医学用词，来自希腊语 pachy-（厚、稠）+ haima（血）。现代医学更常用的表达是 hyperviscosity（高黏滞/高黏稠度）或描述性说法 thickened blood（血液变稠）。","拼写上 pachyaemia 属于英式 -aemia 形式；美式更常见 -emia（如 anemia）。如果你在美式资料中查找，可能需要用类似含义的词（例如 hyperviscosity syndrome）来检索。"]}
{"word":"pachyblepharon","summary":{"en":"Pachyblepharon means abnormally thick eyelids (a medical/ophthalmology term).","zh":"Pachyblepharon 指眼睑异常增厚（医学/眼科学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition in which the eyelids are abnormally thick (often due to swelling or tissue overgrowth).","zh":"眼睑异常增厚的情况（常因肿胀或组织增生导致）。"},"examples":[{"en":"The ophthalmologist noted pachyblepharon during the exam because the patient’s eyelids looked unusually thick.","zh":"眼科医生在检查时注意到患者有 pachyblepharon，因为他的眼睑看起来异常增厚。"},{"en":"Allergies and chronic inflammation can sometimes be discussed when evaluating pachyblepharon.","zh":"在评估 pachyblepharon 时，有时会讨论过敏和慢性炎症等因素。"}]}],"synonyms":["thickened eyelids","eyelid thickening"],"phonetic":"/ˌpækiˈblɛfərɑn/","extraExplanation":["这是一个较少见、偏医学/眼科学用语，常见于专业文献或病历记录中。","词源可拆解理解：pachy- 来自希腊语，表示“厚”；blepharon 表示“眼睑”。合起来就是“眼睑增厚”。","它通常描述一种体征（外观/检查所见），并不一定单独作为最终诊断；临床上需要结合原因（如炎症、过敏、感染、皮肤或结缔组织疾病等）来判断。"]}
{"word":"pachycarpous","summary":{"en":"Pachycarpous describes plants that have thick-walled or thick-fleshed fruits.","zh":"pachycarpous 用来形容结出果壁厚或果肉厚的果实的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having thick-walled or thick-fleshed fruit; producing thick fruits.","zh":"（植物学）果实壁厚或果肉厚的；结厚果的。"},"examples":[{"en":"Some desert plants are pachycarpous, with thick fruit walls that help reduce water loss.","zh":"一些沙漠植物具有厚果性（pachycarpous），厚厚的果壁有助于减少水分流失。"},{"en":"The botanist described the species as pachycarpous, noting its unusually sturdy pericarp.","zh":"植物学家将该物种描述为厚果性的，并指出它的果皮（果被）异常坚实。"}]}],"synonyms":["thick-fruited","thick-walled (fruit)","fleshy-fruited (sometimes, context-dependent)"],"phonetic":"/ˌpækiˈkɑrpəs/","extraExplanation":["词源提示：pachy- 来自希腊语，意为“厚的”；-carpous 来自希腊语 karpos，意为“果实”。因此 pachycarpous 字面意思就是“厚果的”。","使用场景：该词多见于植物学描述、分类学论文或植物形态学笔记中，日常英语中很少使用。"]}
{"word":"pachycephal","summary":{"en":"Pachycephal means “thick-skulled,” mainly used in medical/anatomical contexts; it can also (rarely) refer to a thick-skulled person/animal.","zh":"pachycephal 指“厚颅的/颅骨增厚的”，主要用于医学或解剖语境；也可很少见地指“厚颅者/厚颅动物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a thick skull; relating to a condition in which the skull bones are abnormally thick (pachycephaly).","zh":"厚颅的；与“厚颅（颅骨异常增厚）”有关的。"},"examples":[{"en":"The report described pachycephal changes in the skull on the X-ray.","zh":"报告描述了X光片上颅骨的厚颅性改变。"},{"en":"In medical writing, pachycephal features may be mentioned when discussing certain bone disorders.","zh":"在医学写作中，讨论某些骨骼疾病时可能会提到厚颅性特征。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or animal characterized by a thick skull (rare).","zh":"厚颅者；厚颅的动物（较少见）。"},"examples":[{"en":"The term pachycephal is rare outside older anatomical texts.","zh":"“pachycephal”一词在较早的解剖学文献之外并不常见。"}]}],"synonyms":["pachycephalic","thick-skulled","broad-skulled"],"phonetic":"/ˌpækiˈsɛfəl/","extraExplanation":["词源：来自希腊语 pachy-（厚的）+ cephal-（头）。在现代医学英语里，更常见的相关词是 pachycephaly（名词：厚颅）、pachycephalic（形容词：厚头/厚颅的）。","使用场景：多见于解剖学、影像学或疾病描述中；日常英语几乎不会用到。学习时可把它当作“词根组合”的例子：pachy- 表示“厚”，cephal- 表示“头/颅”。"]}
{"word":"pachycephalia","summary":{"en":"Pachycephalia is a medical term for an abnormally thick skull.","zh":"pachycephalia 是医学术语，指头骨（颅骨）异常增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) An unusually thick skull (a condition where the bones of the head are abnormally thick).","zh":"（医学）颅骨增厚；头骨异常变厚的一种情况。"},"examples":[{"en":"The CT scan suggested pachycephalia, with noticeably thickened skull bones.","zh":"CT 扫描提示可能有 pachycephalia（颅骨增厚），可见颅骨明显变厚。"},{"en":"In some patients, pachycephalia can be linked to an underlying bone or genetic disorder.","zh":"在一些患者中，pachycephalia（颅骨增厚）可能与潜在的骨骼或遗传性疾病有关。"}]}],"synonyms":["pachycephaly","cranial hyperostosis","thickened skull"],"phonetic":"/ˌpækiˈsɛfeɪliə/","extraExplanation":["词源来自希腊语：pachy-（厚的）+ kephalē（头）。在医学语境中，它描述的是“头骨厚”，而不是“头大”。","在临床写作里更常见的相关词是 pachycephaly（颅骨增厚/厚头畸形，拼写更常用）或 cranial hyperostosis（颅骨骨质增生/增厚，偏描述性）。具体诊断通常还需要结合病因与影像学表现。"]}
{"word":"pachycephalic","summary":{"en":"Pachycephalic means “broad- and short-headed,” mainly used in anatomy/anthropology.","zh":"pachycephalic 指“短头型的（头较宽且短）”，主要用于解剖学/人类学等学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a relatively broad, short head (especially used in anthropology and anatomy).","zh":"（尤用于人类学、解剖学）短头型的；头颅相对较宽而短的。"},"examples":[{"en":"Some older anthropology texts described certain groups as pachycephalic, but modern discussions avoid using the term to label people.","zh":"一些较早的人类学教材会把某些群体描述为 pachycephalic（短头型），但现代讨论中通常避免用它给人群贴标签。"},{"en":"In veterinary anatomy, a breed may be described as pachycephalic if its skull is broad compared with its length.","zh":"在兽医解剖学中，如果某个品种的头骨相对长度更宽，可能会被描述为 pachycephalic（短头型）。"}]}],"synonyms":["brachycephalic","short-headed"],"phonetic":"/ˌpækiˈsɛfəlɪk/","extraExplanation":["词源：来自希腊语 pachys（“厚的、粗的”）+ kephalē（“头”）。相关词包括 dolichocephalic（长头型的）与 mesocephalic（中等头型的）。","语域提示：该词多见于学术或技术语境（人类学、解剖学、动物品种描述）。用于描述人的头型时容易带有过时分类或刻板印象色彩，写作时建议在明确科学语境下谨慎使用。"]}
{"word":"pachycephalous","summary":{"en":"Pachycephalous means “thick-skulled,” literally (having a thick skull) or figuratively (thick-headed, slow to understand).","zh":"pachycephalous 意为“厚头骨的/颅骨很厚的”，也可比喻“愚笨的、不开窍的（厚脑壳）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a thick head or thick skull; thick-skulled.","zh":"头很厚的；颅骨很厚的；（常指）厚头骨的。"},"examples":[{"en":"The fossil was identified as pachycephalous because of its unusually thick skull dome.","zh":"这块化石因其异常厚的圆顶状头骨而被鉴定为厚头骨的。"},{"en":"In some animals, pachycephalous skulls may help protect the brain during impacts.","zh":"在一些动物中，厚头骨可能有助于在撞击时保护大脑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, often humorous or insulting) Stupid; slow to understand; “thick-headed.”","zh":"（比喻，常带玩笑或侮辱）愚笨的；不开窍的；“死脑筋的/榆木脑袋的”。"},"examples":[{"en":"I was pachycephalous about the instructions and kept making the same mistake.","zh":"我对这些说明太不开窍了，一直犯同样的错误。"},{"en":"Calling someone pachycephalous is rude—use it carefully.","zh":"说别人“pachycephalous”是很不礼貌的，用的时候要谨慎。"}]}],"synonyms":["thick-skulled","thick-headed","dense (informal)","dull","slow-witted"],"phonetic":"/ˌpæk.iˈsɛf.ə.ləs/","extraExplanation":["词源：来自希腊语词根 pachy-（厚）+ cephal-（头）。因此它字面意思就是“厚头的”。","使用场景：在科学写作里多指“颅骨很厚”；在日常语境里用于比喻“厚脸皮/厚脑壳”时，语气往往偏刻薄或调侃，远不如 dumb / slow 常见。"]}
{"word":"pachycephaly","summary":{"en":"Pachycephaly means an unusually thick skull.","zh":"pachycephaly 指“颅骨异常增厚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition in which the skull (head) is unusually thick.","zh":"（医学）颅骨（头骨）异常增厚的状况。"},"examples":[{"en":"The report mentioned pachycephaly as a possible bone-growth abnormality.","zh":"报告提到颅骨增厚（pachycephaly）可能是一种骨生长异常。"},{"en":"Doctors may use imaging tests to check for signs of pachycephaly.","zh":"医生可能会用影像检查来查看是否有颅骨增厚的迹象。"}]}],"synonyms":["thickened skull","cranial thickening"],"phonetic":"/ˌpækiˈsɛfəli/","extraExplanation":["词源提示：pachy- 来自希腊语，意为“厚”；-cephaly 与“头”有关（如 cephalic 表示“头部的”）。因此 pachycephaly 字面意思就是“头很厚/颅骨很厚”。","使用场景：这是较少见的医学术语，多见于临床记录、放射学（影像学）或学术写作中；日常英语里通常会用更直白的说法，如 “thickened skull”。","相关词：pachyderm（厚皮动物，如象、犀牛）；macrocephaly（头围/头部过大，偏“尺寸大”而非“骨厚”）；brachycephaly（短头型，指头部形状）。"]}
{"word":"pachychilia","summary":{"en":"Pachychilia is a medical term meaning abnormally thick or enlarged lips.","zh":"Pachychilia 是医学术语，指嘴唇异常增厚或肥大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Abnormally thick or enlarged lips.","zh":"（医学）唇部异常增厚或肥大。"},"examples":[{"en":"The clinician noted pachychilia during the facial exam.","zh":"临床医生在面部检查时记录到唇部肥厚（pachychilia）。"},{"en":"Pachychilia can appear as part of a broader syndrome and may require further evaluation.","zh":"唇部肥厚可能是更广泛综合征的一部分，可能需要进一步评估。"}]}],"synonyms":["thick lips","enlarged lips","lip hypertrophy"],"phonetic":"/ˌpækiˈkaɪliə/","extraExplanation":["词源：pachy- 来自希腊语，意为“厚的”；-chilia 与希腊语 cheilos（“嘴唇”）有关，所以整体字面意思是“厚嘴唇”。","使用场景：这是较少见的医学术语，更多见于临床记录或学术写作；日常英语更常说 thick lips / enlarged lips。","注意：它是描述性术语本身，不一定表示疾病原因；若出现在医学语境，通常需要结合家族史、其他体征或相关检查来判断原因。"]}
{"word":"pachycholia","summary":{"en":"A rare medical term meaning abnormally thick/viscous bile.","zh":"一个少见的医学术语，指胆汁异常增稠、变得黏稠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) Abnormally thick or viscous bile; the condition of having thickened bile.","zh":"（医学）胆汁异常增稠、变得黏稠；指“胆汁过稠”的状态。"},"examples":[{"en":"The report mentioned pachycholia, which can contribute to sluggish bile flow.","zh":"报告提到“胆汁过稠”（pachycholia），这可能导致胆汁流动变慢。"},{"en":"In some cases, dehydration may worsen pachycholia by making bile more concentrated.","zh":"在某些情况下，脱水可能使胆汁更浓缩，从而加重胆汁过稠（pachycholia）。"}]}],"synonyms":["thick bile","viscous bile","bile thickening"],"phonetic":"/ˌpækiˈkoʊliə/","extraExplanation":["这是一个非常少见的医学词，多见于旧式或专业文献中。词根来自希腊语：pachy-（厚的、粗的）+ chole（胆汁）。日常英语里更常见的说法是“thick bile / viscous bile”（黏稠的胆汁），或在具体语境中谈“bile sludge（胆泥）”“cholestasis（胆汁淤积）”等相关概念，但它们并不完全等同。"]}
{"word":"pachychymia","summary":{"en":"Pachychymia is a rare medical term meaning unusually thick body fluids, especially thickened blood.","zh":"Pachychymia 是一个罕见医学术语，指体液异常增稠，尤指血液变稠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal thickness (increased viscosity) of body fluids, especially of the blood","zh":"体液异常增稠（黏度增高），尤指血液变稠"},"examples":[{"en":"The report mentioned pachychymia, suggesting the patient’s blood was unusually thick.","zh":"报告提到 pachychymia，提示患者的血液异常增稠。"},{"en":"Dehydration can sometimes contribute to signs that resemble pachychymia.","zh":"脱水有时会导致类似 pachychymia 的表现。"}]}],"synonyms":["hyperviscosity","increased blood viscosity","thickened blood"],"phonetic":"/ˌpækiˈkaɪmiə/","extraExplanation":["这是一个非常少见、偏医学/古典的术语：pachy- 来自希腊语，意为“厚、粗”；-chymia 与“体液/汁液（如血液、乳糜、食糜）”有关，整体强调“体液变得更浓稠”。","现代临床语境里更常见的相关表达包括：increased blood viscosity（血液黏度升高）、hyperviscosity（高黏滞/高黏度状态）。","注意它通常不是日常英语词汇，多见于医学史、词源学或少数专业文献中。"]}
{"word":"pachycladous","summary":{"en":"Pachycladous means “thick-branched,” mainly used in botanical or scientific descriptions.","zh":"pachycladous 意为“粗枝的/粗枝状的”，主要用于植物学或科学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in botany) Having thick branches; thick-branched.","zh":"（尤用于植物学）有粗枝的；粗枝状的。"},"examples":[{"en":"The botanist described the shrub as pachycladous, with stout, woody side branches.","zh":"植物学家把这种灌木描述为 pachycladous（粗枝状的），侧枝粗壮而木质化。"},{"en":"In dry habitats, some pachycladous plants store water in their thickened stems and branches.","zh":"在干旱生境中，一些 pachycladous（粗枝的）植物会在加粗的茎和枝中储存水分。"}]}],"synonyms":["thick-branched","stout-branched","robustly branched"],"phonetic":"/ˌpækiˈkleɪdəs/","extraExplanation":["这是一个相对少见、偏学术的词，多见于植物学或生物形态描述中，而不常用于日常英语。","词源上由 pachy-（“厚、粗”，源自希腊语）+ -cladous（“枝、分枝”，与 clade / clad- “分支”有关）构成，字面意思就是“粗枝的/厚枝的”。","写作中它常用于正式的物种描述（taxonomy）或形态学对比；更通俗的表达通常会用 “thick-branched” 或 “with thick branches”。"]}
{"word":"pachydactyl","summary":{"en":"“Pachydactyl” means having unusually thick fingers or toes; it’s a rare, medical-style descriptive adjective.","zh":"“pachydactyl”指手指或脚趾异常粗厚的（多用于医学式描述），是比较少见的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick fingers or toes; relating to unusually broad digits.","zh":"（手指或脚趾）粗厚的；指（异常）宽厚的指（趾）。"},"examples":[{"en":"The doctor described the swelling as making his hands look pachydactyl.","zh":"医生形容肿胀让他的手看起来像“手指粗厚”。"},{"en":"Some medical descriptions mention pachydactyl features in the toes.","zh":"一些医学描述会提到脚趾的“粗厚指（趾）”特征。"}]}],"synonyms":["thick-fingered","thick-toed","broad-fingered"],"phonetic":"/ˌpækɪˈdæk.təl/","extraExplanation":["这是一个较少见、偏医学/描写用的词，来自希腊语词根：pachy- 表示“厚、粗”，dactyl 表示“手指/脚趾”（也见于 dactylology“指语学/手语学”、pterodactyl“翼手龙”）。","在临床语境中，它可能被用作描述体征（外观特征），并不等同于具体诊断名称；具体含义要看上下文（如水肿、关节问题或先天特征等）。"]}
{"word":"pachydactylous","summary":{"en":"Pachydactylous means having unusually thick or broad fingers or toes (a medical term).","zh":"pachydactylous 指手指或脚趾异常粗厚、宽大（医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having unusually thick or broad fingers or toes.","zh":"（医学）指手指或脚趾异常粗厚、宽大。"},"examples":[{"en":"The doctor described the patient’s hands as pachydactylous.","zh":"医生把这位病人的手描述为“手指粗厚的”。"},{"en":"Pachydactylous digits can appear in some genetic conditions.","zh":"在一些遗传性疾病中，可能会出现手指（或脚趾）粗厚的表现。"}]}],"synonyms":["thick-fingered","thick-toed","broad-fingered"],"phonetic":"/ˌpækiˈdæk.tə.ləs/","extraExplanation":["词源：来自希腊语 pachy-（“厚的、粗的”）+ dactyl-（“手指/脚趾”）。在医学写作中更常见，日常英语很少用，常用更简单的说法如 “thick-fingered / thick-toed”。","使用场景：多见于临床描述、遗传学或解剖学语境；如果是在普通对话中描述外观，通常不建议使用这个专业词。"]}
{"word":"pachydactyly","summary":{"en":"Pachydactyly is a medical term for unusually thick fingers and/or toes.","zh":"pachydactyly 是指手指和/或脚趾异常粗厚的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the fingers and/or toes are unusually thick (and sometimes short), often present from birth or linked to certain syndromes","zh":"（医学）指手指和/或脚趾异常粗厚（有时也较短）的一种状况，常为先天性，或与某些综合征相关"},"examples":[{"en":"The doctor noted pachydactyly during the physical exam and recommended further testing.","zh":"医生在体检中注意到指（趾）粗厚，并建议做进一步检查。"},{"en":"Pachydactyly can occur on its own or as part of a genetic syndrome.","zh":"指（趾）粗厚可能单独出现，也可能是某种遗传综合征的一部分。"},{"en":"The X-ray helped confirm that the swelling was not an injury but pachydactyly.","zh":"X 光检查帮助确认这不是外伤导致的肿胀，而是指（趾）粗厚。"}]}],"synonyms":["finger/toe thickening","digital thickening"],"phonetic":"/ˌpækiˈdæktəli/","extraExplanation":["词源提示：pachy- 表示“厚、粗”（如 pachyderm“厚皮动物”），-dactyly 表示“手指/脚趾”（如 polydactyly“多指/趾”）。这是偏医学/遗传学用语，日常英语中较少见。","写作与语境：在医学记录或论文中更常用；和“finger/toe thickening（手指/脚趾增厚）”相比更正式、更专业。"]}
{"word":"pachyderm","summary":{"en":"A pachyderm is a large thick-skinned animal (especially an elephant), and it can also jokingly mean a clumsy person.","zh":"pachyderm 指大型厚皮动物（尤指大象），也可幽默地指笨拙的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large, thick-skinned mammal—especially an elephant; also sometimes a rhinoceros or hippopotamus.","zh":"厚皮动物；（尤指）大象；也可泛指犀牛或河马等大型厚皮哺乳动物。"},"examples":[{"en":"The zoo’s newest pachyderm is a young Asian elephant.","zh":"动物园最新来的厚皮动物是一头年轻的亚洲象。"},{"en":"Elephants are the best-known pachyderms because of their size and wrinkled skin.","zh":"大象因体型巨大、皮肤褶皱明显而是最知名的厚皮动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Humorous or figurative) A clumsy or slow-moving person.","zh":"（幽默/比喻）笨拙或行动迟缓的人。"},"examples":[{"en":"I felt like a pachyderm trying to dance in those heavy boots.","zh":"穿着那双沉重的靴子跳舞时，我感觉自己像个厚皮动物一样笨拙。"},{"en":"He’s no pachyderm—he moves quietly when he wants to.","zh":"他可不笨重——想安静行动时，他走路很轻。"}]}],"synonyms":["elephant","rhinoceros","hippopotamus","thick-skinned mammal"],"phonetic":"/ˈpækɪˌdɝm/","extraExplanation":["“pachyderm”来自希腊语词根：pachy-（厚的）+ derm/derma（皮肤）。过去“Pachydermata（厚皮类）”曾作为动物分类名使用，但现代生物分类学不再把它当作正式类群；如今该词在日常英语里更常指“大象等大型厚皮动物”。","在写作语气上，“pachyderm”比直接说“elephant”更偏书面/俏皮；用于形容人时通常带幽默感，注意避免在严肃场合用来评价他人以免显得不礼貌。"]}
{"word":"pachyderma","summary":{"en":"Pachyderma is an old zoological term for thick-skinned mammals (especially elephants, rhinos, and hippos), and it can rarely mean “thick skin” itself.","zh":"Pachyderma 是动物学中的旧称，指厚皮类大型哺乳动物（尤指大象、犀牛、河马等）；少数情况下也可指“厚皮”本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, old-fashioned) A former scientific group name for large, thick-skinned mammals—especially elephants, rhinoceroses, and hippopotamuses; used today mainly in historical or informal contexts.","zh":"（动物学，较旧用法）旧时对“厚皮类动物”的分类名称，主要指大象、犀牛、河马等大型厚皮哺乳动物；如今多用于历史或非正式语境。"},"examples":[{"en":"In older textbooks, elephants and rhinos were sometimes grouped under Pachyderma.","zh":"在较早的教科书里，大象和犀牛有时被归为 Pachyderma（厚皮类）。"},{"en":"The museum label mentions Pachyderma, an outdated category for thick-skinned mammals.","zh":"博物馆的标签提到 Pachyderma，这是对厚皮哺乳动物的一种过时分类。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Thick skin or hide; the idea of “thickness of skin.”","zh":"（罕见）厚皮、厚皮肤；强调“皮肤很厚”的概念。"},"examples":[{"en":"The writer uses pachyderma to emphasize the animal’s heavy, protective skin.","zh":"作者用 pachyderma 来强调这种动物厚重、具有保护性的皮肤。"}]}],"synonyms":["pachyderms","thick-skinned mammals","elephants and rhinoceroses (informal grouping)"],"phonetic":"/ˌpækəˈdɝmə/","extraExplanation":["词源上可拆为 pachy-（厚的）+ derma（皮肤），来自希腊语词根，因此能从构词直接理解为“厚皮”。","作为分类学名称的 Pachyderma 在现代动物分类中基本已不用；现在更常说 “pachyderms” 来泛指大象、犀牛等“厚皮大型动物”（但这并非严格的科学分类）。"]}
{"word":"pachydermal","summary":{"en":"Pachydermal means ‘thick-skinned,’ especially in medical contexts, and can also mean emotionally ‘not easily hurt by criticism.’","zh":"pachydermal 表示“皮肤增厚的/厚皮的”（多用于医学语境），也可比喻“脸皮厚、不易被批评伤到”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, biology) Having unusually thick skin; relating to thickening of the skin.","zh":"（医学/生物）皮肤异常增厚的；与皮肤增厚有关的。"},"examples":[{"en":"The doctor noted pachydermal changes on the patient’s lower legs.","zh":"医生注意到患者小腿出现皮肤增厚的变化。"},{"en":"Certain chronic conditions can cause pachydermal swelling and rough skin.","zh":"某些慢性疾病会导致皮肤增厚性肿胀和皮肤粗糙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figurative: Thick-skinned; not easily hurt by criticism or insults.","zh":"（比喻）脸皮厚的；不容易被批评或侮辱伤到的。"},"examples":[{"en":"Working in customer service, she became a bit pachydermal about rude comments.","zh":"在客服岗位工作后，她对无礼评论变得有点“脸皮厚”。"},{"en":"You need a pachydermal attitude to survive in that competitive industry.","zh":"在那个竞争激烈的行业里，你需要更“抗骂”的心态才能撑下去。"}]}],"synonyms":["thick-skinned","leathery","calloused","insensitive","hard to offend"],"phonetic":"/ˌpækəˈdɝməl/","extraExplanation":["“pachydermal”来自希腊语词根：pachy-（厚）+ derma（皮肤）。因此它既可用于医学上的“皮肤增厚”，也常借“厚皮动物（pachyderm，如象、犀牛）”来比喻“厚脸皮/不易受伤”。","在正式写作中更常见于医学或学术语境；日常口语里表达“厚脸皮”更常用 thick-skinned、hard to offend 等。"]}
{"word":"pachydermata","summary":{"en":"Pachydermata is an outdated zoological term for “thick-skinned” mammals such as elephants and rhinoceroses.","zh":"Pachydermata 是一个过时的动物学术语，指“大型厚皮哺乳动物”，如大象和犀牛等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific group (order) of large, thick-skinned mammals, especially elephants, rhinoceroses, and hippopotamuses; now considered an outdated classification","zh":"（旧式分类）厚皮类动物：曾用来指一类大型、皮肤较厚的哺乳动物，尤指大象、犀牛、河马等；现多被认为是过时的分类法"},"examples":[{"en":"In older zoology books, elephants and rhinos were often placed in the Pachydermata.","zh":"在较早的动物学书籍里，大象和犀牛常被归入“厚皮类（Pachydermata）”。"},{"en":"The museum label mentioned Pachydermata, but modern taxonomy no longer uses that group.","zh":"博物馆的说明牌提到“厚皮类（Pachydermata）”，但现代分类学已不再使用这一类群。"}]}],"synonyms":["thick-skinned mammals (informal description)","pachyderms (general term, not the same taxonomic rank)"],"phonetic":"/ˌpækɪˈdɝːmətə/","extraExplanation":["词源来自希腊语：pachy-（厚的）+ derma（皮肤）。因此它字面意思就是“厚皮的动物”。","在19世纪的自然史写作中较常见，但现代生物分类更重视进化关系，所以不再把这些动物简单地因为“皮厚”而归为一类。"]}
{"word":"pachydermateous","summary":{"en":"“Pachydermateous” means having very thick skin (literally), and can also mean “thick-skinned” emotionally (figuratively).","zh":"“pachydermateous”指（字面上）皮肤很厚，亦可比喻“脸皮厚/不易受伤”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having very thick, tough, wrinkled skin; like that of an elephant, rhinoceros, or hippopotamus.","zh":"（罕见）皮肤非常厚、坚韧、起皱的；像大象、犀牛或河马那样的厚皮。"},"examples":[{"en":"The old tortoise’s pachydermateous skin looked like cracked leather.","zh":"那只老乌龟的厚皮看起来像裂开的皮革。"},{"en":"Writers sometimes use “pachydermateous” to describe a character’s weathered face.","zh":"作家有时用“pachydermateous”来形容人物饱经风霜的脸。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Thick-skinned; not easily hurt by criticism or insults.","zh":"（比喻）脸皮厚的；不容易被批评或侮辱伤到的。"},"examples":[{"en":"In politics, a pachydermateous attitude can help you survive constant attacks.","zh":"在政治中，比较“脸皮厚”的态度能帮助你扛住不断的抨击。"},{"en":"She stayed calm and pachydermateous when people mocked her accent.","zh":"别人嘲笑她的口音时，她依然冷静，不容易受伤。"}]}],"synonyms":["thick-skinned","tough-skinned","leathery","hidebound"],"phonetic":"/ˌpækəˌdɝːməˈtiːəs/","extraExplanation":["这个词来自希腊语词根：pachy-（厚）+ derma（皮肤）。它和“pachyderm”（厚皮动物，如大象）同源。","日常英语里更常用的说法是 thick-skinned（不容易受伤）或 tough-skinned。","这是一个非常书面、偏文学/学术的词；用在描写外貌（皮肤粗厚、皱裂）或性格（不怕讥讽）时会显得夸张但很有画面感。"]}
{"word":"pachydermatocele","summary":{"en":"A rare medical term for a sac-like swelling associated with abnormally thickened skin.","zh":"一个较罕见的医学词，指伴随皮肤异常增厚的囊状肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A sac-like swelling or hernia-like protrusion characterized by unusually thickened skin.","zh":"（医学，罕见）一种囊状肿胀或类似疝气的膨出，其特点是皮肤异常增厚。"},"examples":[{"en":"The report described a pachydermatocele with markedly thickened skin over the swelling.","zh":"报告描述了一例皮肤明显增厚的囊状肿胀（pachydermatocele）。"},{"en":"Because the term is rare, the clinician clarified the finding as a thick-skinned, sac-like mass.","zh":"由于该术语较少见，临床医生将其说明为“皮肤增厚的囊状肿块”。"}]}],"synonyms":["thick-skinned swelling","hernia-like swelling","(related) pachydermia","(related) elephantiasis"],"phonetic":"/ˌpækɪˌdɝːməˈtoʊsiːl/","extraExplanation":["这个词多见于较老或较少使用的医学语境。可拆解理解：pachy-（厚）、dermato-（皮肤）、-cele（疝/囊状肿胀）。因此它字面意思就是“皮肤变厚的囊状肿胀/疝样突出”。在现代写法中，医生往往会改用更具体的诊断名（例如描述为某部位的肿胀、疝气或皮肤肥厚等），而不一定使用该词。"]}
{"word":"pachydermatoid","summary":{"en":"Pachydermatoid means “thick-skinned” or “pachyderm-like,” sometimes used medically for abnormal skin thickening.","zh":"pachydermatoid 指“皮肤很厚/像厚皮动物一样”，也可用于医学上描述皮肤异常增厚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very thick skin; resembling a pachyderm (such as an elephant or rhinoceros).","zh":"皮肤很厚的；像厚皮动物（如大象、犀牛）那样的。"},"examples":[{"en":"The sculpture’s pachydermatoid texture made it feel like elephant hide.","zh":"这座雕塑粗厚的表面质感让人感觉像大象皮。"},{"en":"Some writers describe the character as pachydermatoid to suggest toughness and insensitivity.","zh":"有些作家用“pachydermatoid”来形容这个角色，暗示他既强硬又有些麻木。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to or characterized by an abnormal thickening of the skin.","zh":"（医学）与皮肤异常增厚有关的；表现为皮肤异常增厚的。"},"examples":[{"en":"The clinician noted pachydermatoid changes in the affected area.","zh":"临床医生记录到患处出现了类似皮肤增厚的改变。"},{"en":"The report mentioned a pachydermatoid appearance of the lesion.","zh":"报告提到该病灶呈现皮肤增厚样外观。"}]}],"synonyms":["thick-skinned","pachydermous","leathery","callused"],"phonetic":"/ˌpækəˈdɝːməˌtɔɪd/","extraExplanation":["这个词来自“pachyderm”（厚皮动物）+ “-oid”（……样的）。在日常英语中很少见，更常出现在文学描写（强调“厚皮、耐受、迟钝”的意象）或医学语境（描述皮肤增厚样改变）。","注意它与比喻用法的“thick-skinned”（脸皮厚/不容易受伤）有相近之处，但“pachydermatoid”更偏正式、书面，且常强调外观或质地。"]}
{"word":"pachydermatosis","summary":{"en":"Pachydermatosis means abnormal thickening of the skin (a medical term).","zh":"Pachydermatosis 指皮肤异常增厚（医学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the skin becomes abnormally thick, often rough and sometimes wrinkled.","zh":"（医学）皮肤异常增厚的病症，常伴随粗糙，有时出现皱褶。"},"examples":[{"en":"The doctor noted pachydermatosis on the patient’s lower legs.","zh":"医生发现患者小腿部位出现皮肤增厚（pachydermatosis）。"},{"en":"Chronic swelling can sometimes lead to pachydermatosis over time.","zh":"长期肿胀有时会随着时间发展为皮肤增厚（pachydermatosis）。"}]}],"synonyms":["skin thickening","thickened skin","hyperkeratosis (related)"],"phonetic":"/ˌpækɪˌdɝməˈtoʊsɪs/","extraExplanation":["词源提示：pachy- 表示“厚”，derm(a) 表示“皮肤”，-osis 表示“（疾病）状态”。因此这个词直观地就是“皮肤变厚的病理状态”。","使用语境：这是较专业的医学词，日常英语里更常用 thickened skin（皮肤变厚）或 skin thickening（皮肤增厚）来表达。"]}
{"word":"pachydermatous","summary":{"en":"Pachydermatous means “thick-skinned,” either literally (having thick skin) or figuratively (not easily affected by criticism).","zh":"pachydermatous 意为“厚皮的”，既可指字面上皮肤很厚，也可比喻对批评不敏感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very thick skin; thick-skinned (literally, like an elephant or rhinoceros).","zh":"皮肤很厚的；厚皮的（字面义，像大象或犀牛那样）。"},"examples":[{"en":"Elephants have pachydermatous skin that helps protect them from scratches and sunburn.","zh":"大象有厚皮的皮肤，有助于保护它们免受擦伤和晒伤。"},{"en":"The veterinarian noted the pachydermatous folds around the animal’s neck.","zh":"兽医注意到这只动物颈部周围厚厚的皮肤褶皱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not easily hurt by criticism; insensitive or unresponsive (figurative, often critical).","zh":"对批评不太在意的；麻木、不敏感的（比喻义，常带批评色彩）。"},"examples":[{"en":"After years in politics, he grew pachydermatous to online insults.","zh":"在政坛多年后，他对网络辱骂变得麻木不敏感。"},{"en":"Her pachydermatous reaction to the complaint made the customer feel ignored.","zh":"她对投诉的冷漠反应让顾客觉得被忽视了。"}]}],"synonyms":["thick-skinned","leathery","callous","insensitive"],"phonetic":"/ˌpækɪˈdɝmətəs/","extraExplanation":["词源来自希腊语：pachy-（厚）+ derma（皮肤）。因此它的字面核心就是“厚皮”。","在现代英语里，这个词偏正式、偏书面，常见于医学/生物学描述（皮肤增厚、皱褶）或文学式讽刺（形容人“脸皮厚/不敏感”）。日常口语更常用 thick-skinned 或 insensitive。"]}
{"word":"pachydermatously","summary":{"en":"An uncommon adverb meaning “in a thick-skinned or thick-textured way,” literally or figuratively.","zh":"一个较少见的副词，表示“以厚皮／粗厚质感的方式”，可用于字面或比喻（脸皮厚、不易受影响）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pachydermatous way; with very thick skin or a thick, rough outer layer (literal or figurative).","zh":"以“厚皮的／皮肤粗厚的”方式；带着厚皮或粗厚外层（可指字面，也可指比喻意义上的“脸皮厚、不易受影响”）。"},"examples":[{"en":"The elephant’s legs were covered in folds, almost pachydermatously textured.","zh":"大象的腿布满褶皱，质感几乎可以说是“厚皮般”的。"},{"en":"He responded pachydermatously to the criticism, as if nothing could embarrass him.","zh":"他对批评的反应很“厚脸皮”，仿佛怎么说都不会让他难堪。"}]}],"synonyms":["thick-skinnedly","insensitively","callously","unfazedly"],"phonetic":"/ˌpækəˈdɝːmətəsli/","extraExplanation":["这个词非常少见，多用于写作或幽默的夸张表达。更常见的说法是用形容词 pachydermatous（厚皮的）或短语 with a thick skin（脸皮厚／不易受影响）。","构词上：pachyderm（厚皮动物，如大象、犀牛）→ pachydermatous（厚皮的）→ pachydermatously（以厚皮的方式）。词源来自希腊语：pachy-（厚）+ derma（皮肤）。"]}
{"word":"pachydermia","summary":{"en":"Pachydermia is a medical term meaning abnormal thickening of the skin, sometimes described as elephant-like.","zh":"pachydermia 是医学用语，指皮肤异常增厚，有时形容为“象皮样”的粗厚皮肤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Abnormal thickening of the skin, often with a rough, elephant-like texture.","zh":"（医学）皮肤异常增厚，常呈粗糙、似象皮的外观。"},"examples":[{"en":"The dermatologist noted pachydermia on the patient’s neck folds.","zh":"皮肤科医生注意到患者颈部皱褶处有皮肤增厚（pachydermia）。"},{"en":"Chronic inflammation can sometimes lead to pachydermia in affected areas.","zh":"慢性炎症有时会导致患处出现皮肤增厚。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A condition or appearance resembling the thick skin of a pachyderm (such as an elephant or rhinoceros).","zh":"（罕见）外观或状态像厚皮动物（如大象、犀牛）的厚皮。"},"examples":[{"en":"In older texts, the term pachydermia was used to describe elephant-like thick skin.","zh":"在较早的文献中，pachydermia 用来描述“像大象一样的厚皮”。"}]}],"synonyms":["skin thickening","thickened skin","hyperkeratosis (related)"],"phonetic":"/ˌpækɪˈdɝːmiə/","extraExplanation":["词源提示：pachy- 意为“厚”（源自希腊语），-dermia 与“皮肤”有关（如 dermatitis 皮炎）。因此 pachydermia 字面意思就是“厚皮”。","使用场景：该词主要出现在医学语境（皮肤科、耳鼻喉科等）或学术写作中；日常英语里更常用 thickened skin / skin thickening 来表达。"]}
{"word":"pachydermial","summary":{"en":"Pachydermial (more commonly pachydermal) means “related to thick-skinned animals like elephants,” and rarely in medicine it can mean “related to abnormal skin thickening.”","zh":"pachydermial（更常见写法 pachydermal）意为“与大象等厚皮动物有关”；在医学中少见地可指“与皮肤/黏膜异常增厚有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually “pachydermal”) relating to pachyderms—animals with very thick skin, especially elephants, rhinoceroses, and hippopotamuses.","zh":"（通常写作 pachydermal）与“厚皮动物”有关的，尤指大象、犀牛、河马等皮肤很厚的动物。"},"examples":[{"en":"Elephants’ pachydermal skin helps protect them from scratches and insect bites.","zh":"大象的厚皮能帮助它们防止刮伤和昆虫叮咬。"},{"en":"The exhibit focused on pachydermal mammals, especially elephants and rhinos.","zh":"这个展览聚焦于厚皮类哺乳动物，尤其是大象和犀牛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare; medical) relating to pachydermia, an abnormal thickening of the skin or mucous membrane.","zh":"（少见；医学）与 pachydermia（皮肤或黏膜异常增厚）有关的。"},"examples":[{"en":"The doctor noted pachydermial changes in the tissue during the examination.","zh":"检查时医生注意到组织出现了与增厚相关的变化。"}]}],"synonyms":["pachydermal","thick-skinned (literal)"],"phonetic":"/ˌpækɪˈdɝːmiəl/","extraExplanation":["“pachydermial”在现代英文里比较少见，更常见的形容词拼法是 **pachydermal**。名词 **pachyderm** 来自希腊语词根：*pachy-*（厚）+ *derm*（皮肤）。","在日常语境里，pachyderm 常指“大象、犀牛、河马”等“厚皮的大型动物”（并非严格的现代生物分类）。在写作或科普中更常用 **pachyderm/pachydermal**。"]}
{"word":"pachydermic","summary":{"en":"Pachydermic means thick-skinned, literally (like an elephant) or figuratively (not easily offended). It can also mean related to pachyderms.","zh":"pachydermic意为“厚皮的”，可指字面上的皮肤厚（像大象），也可引申为“不易被冒犯/脸皮厚”；也可表示“与厚皮类动物有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick skin; sometimes used figuratively to mean not easily offended or emotionally sensitive.","zh":"皮肤很厚的；（引申）脸皮厚的、不太容易被冒犯或受伤的。"},"examples":[{"en":"Elephants are famously pachydermic animals with thick, tough skin.","zh":"大象是典型的厚皮动物，皮肤厚实而坚韧。"},{"en":"You need to be a bit pachydermic to work in customer service and stay calm when people complain.","zh":"做客服时最好“脸皮厚”一点，别人抱怨时也能保持冷静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to pachyderms (large mammals such as elephants, rhinoceroses, and hippos).","zh":"与厚皮类动物有关的（如大象、犀牛、河马等大型哺乳动物）。"},"examples":[{"en":"The zoo’s pachydermic enclosure houses elephants and rhinos.","zh":"动物园的厚皮动物馆养着大象和犀牛。"}]}],"synonyms":["thick-skinned","tough-skinned","insensitive","unyielding","elephantine"],"phonetic":"/ˌpækɪˈdɝmɪk/","extraExplanation":["“pachydermic”来自希腊语词根：pachy-（厚）+ derm-（皮肤）。在日常英语中更常见的是形容词“thick-skinned”（不易受伤/不敏感）或名词“pachyderm”（厚皮动物，尤其指大象等）。","注意语气：用来形容人“pachydermic”时，常带一点批评意味，暗示对别人的感受不够敏感；若只是说“not easily offended”则较中性。"]}
{"word":"pachydermoid","summary":{"en":"Pachydermoid means “thick-skinned like an elephant,” literally or figuratively.","zh":"pachydermoid 指“像大象等厚皮动物一样皮厚”，可用于字面描写或比喻“脸皮厚/不敏感”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pachyderm (such as an elephant or rhinoceros), especially in having thick, tough skin; figuratively, thick-skinned or insensitive.","zh":"像厚皮动物（如大象、犀牛）一样的，尤指皮肤厚而粗糙的；引申为“脸皮厚、麻木不敏感的”。"},"examples":[{"en":"Under the harsh desert sun, the lizard’s skin looked almost pachydermoid.","zh":"在刺眼的沙漠阳光下，那只蜥蜴的皮肤看起来几乎像厚皮动物一样粗厚。"},{"en":"After years in politics, he developed a pachydermoid calm toward criticism.","zh":"在政坛多年后，他对批评变得异常“厚脸皮”般冷静。"},{"en":"The novel describes a pachydermoid creature lumbering through the jungle.","zh":"小说描写了一种厚皮般的生物在丛林里笨重地行走。"}]}],"synonyms":["thick-skinned","tough-skinned","hidebound","insensitive"],"phonetic":"/ˌpækiˈdɝˌmɔɪd/","extraExplanation":["词源提示：pachy- 来自希腊语，表示“厚”；derm 表示“皮肤”。因此 pachydermoid 字面意思就是“厚皮一样的”。","用法提醒：该词较少见、偏书面/描写性；在日常英语里更常用 thick-skinned（脸皮厚/不敏感）或 tough-skinned（能吃苦、抗压）来表达相近意思。"]}
{"word":"pachydermous","summary":{"en":"Pachydermous means thick-skinned (literally or figuratively) or relating to animals like elephants and rhinos.","zh":"pachydermous 指“皮肤很厚（字面或比喻）”，也可指“与大象、犀牛等厚皮动物有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very thick skin; thick-skinned (literally or figuratively).","zh":"（字面或比喻）皮肤很厚的；脸皮厚的／不易受伤的。"},"examples":[{"en":"The pachydermous elephant is well protected from sun and scratches.","zh":"皮肤厚实的大象能很好地抵御日晒和刮擦。"},{"en":"After years in politics, she became somewhat pachydermous and ignored harsh criticism.","zh":"从政多年后，她变得有点“脸皮厚”，不太在意尖刻的批评。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to pachyderms (animals like elephants, rhinoceroses, and hippos).","zh":"与厚皮动物有关的（如大象、犀牛、河马等）。"},"examples":[{"en":"The museum has a pachydermous exhibit featuring elephants and rhinos.","zh":"博物馆有一个厚皮动物展区，展示大象和犀牛。"}]}],"synonyms":["thick-skinned","tough-skinned","callous","hidebound","elephantine"],"phonetic":"/ˌpækəˈdɝməs/","extraExplanation":["“pachydermous”来自希腊语：pachys（厚的）+ derma（皮肤）。常见名词是“pachyderm”（厚皮动物）。","这个词在日常口语中不算常见，写作里更常用“thick-skinned”。在较正式或带一点文学色彩的语境中，用“pachydermous”会显得更生动或讽刺。"]}
{"word":"pachyderms","summary":{"en":"Pachyderms are large, thick-skinned animals, especially elephants (and sometimes rhinos or hippos).","zh":"pachyderms 指皮厚的大型动物，尤指大象（有时也包括犀牛或河马）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very large, thick-skinned mammals—especially elephants, and sometimes rhinoceroses or hippopotamuses (depending on context).","zh":"皮厚的大型哺乳动物——尤其指大象；有时也可泛指犀牛或河马（视语境而定）。"},"examples":[{"en":"Elephants are the best-known pachyderms.","zh":"大象是最广为人知的厚皮动物。"},{"en":"The zoo’s pachyderms need extra space and strong barriers.","zh":"动物园的厚皮动物需要更大的活动空间和坚固的围栏。"}]}],"synonyms":["elephants","thick-skinned mammals","megafauna"],"phonetic":"/ˈpækɪˌdɝmz/","extraExplanation":["“pachyderm(s)”来自希腊语词根：pachy-（厚）+ derm/derma（皮肤），字面意思是“厚皮的动物”。","在现代生物分类学里，“Pachydermata（厚皮类）”并不是一个被广泛采用的正式分类；因此在科普或日常英语中它更多是一个描述性、泛称的词。","在英文里有时会带一点书面或幽默的语气，用来指“像大象那样的大块头动物”。"]}
{"word":"pachyemia","summary":{"en":"Pachyemia is a medical term for abnormally thick (high-viscosity) blood.","zh":"pachyemia 指血液异常增稠（黏稠度过高）的医学状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal condition in which the blood is unusually thick or viscous.","zh":"（医学）血液异常增稠、黏稠度过高的状态。"},"examples":[{"en":"The doctor investigated possible causes of pachyemia after the blood tests showed unusually high viscosity.","zh":"血液检查显示黏稠度异常升高后，医生开始调查可能导致血液增稠（pachyemia）的原因。"},{"en":"Severe dehydration can contribute to pachyemia by reducing the water content in the bloodstream.","zh":"严重脱水可能因降低血液中的水分含量而导致血液增稠（pachyemia）。"}]}],"synonyms":["hyperviscosity","thickened blood","increased blood viscosity"],"phonetic":"/ˌpækiˈiːmiə/","extraExplanation":["词源上可拆为 pachy-（厚、粗）+ -emia（血液状况）。因此它直观表达“血液变厚/变黏”的概念。","这是相对少见、偏专业的医学词汇；临床上更常用的相关表达包括“hyperviscosity（高黏滞/高黏稠状态）”或直接说“thickened blood（血液变稠）”。"]}
{"word":"pachyglossal","summary":{"en":"Pachyglossal means having a thick/enlarged tongue, or speaking as if the tongue feels thick and speech is unclear.","zh":"pachyglossal 指“舌头肥厚/增大”的，或引申为说话像舌头发沉一样含糊不清。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an unusually thick or enlarged tongue; thick-tongued (often used in medical contexts).","zh":"（多用于医学语境）舌头异常肥厚或增大；“厚舌”的。"},"examples":[{"en":"The doctor noted a pachyglossal appearance that could affect breathing during sleep.","zh":"医生记录到患者呈现厚舌样外观，这可能会影响睡眠时的呼吸。"},{"en":"Pachyglossal patients may have trouble pronouncing certain sounds clearly.","zh":"厚舌的患者可能难以清晰发某些音。"}]},{"partOfSpeech":"adj.","definition":{"en":"Spoken with the tongue feeling thick; sounding unclear, as if the tongue is heavy.","zh":"（引申）说话像“舌头发沉”一样含糊不清的。"},"examples":[{"en":"After the dental anesthesia, his speech was briefly pachyglossal.","zh":"牙科麻醉后，他的说话短时间内变得舌头发沉、含糊不清。"},{"en":"She tried to read aloud, but the words came out pachyglossal and slow.","zh":"她想朗读，但声音听起来舌头发沉，又慢又含糊。"}]}],"synonyms":["thick-tongued","macroglossal","enlarged-tongue","inarticulate (context-dependent)"],"phonetic":"/ˌpækiˈɡlɑsəl/","extraExplanation":["词源拆解：pachy- 表示“厚、粗”（如 pachyderm“厚皮动物/皮厚的动物”），glossal 来自希腊语 glōssa“舌头”。合在一起就是“厚舌的/舌头肥厚的”。","这是比较少见、偏医学的词，更常见的表达是 thick-tongued 或 enlarged tongue（医学上也常见 macroglossia “巨舌/舌肥大”）。在日常英语里通常不会用 pachyglossal。"]}
{"word":"pachyglossate","summary":{"en":"Pachyglossate means “having a thick tongue,” mainly used in zoology (especially for birds).","zh":"pachyglossate 意为“厚舌的”，主要用于动物学语境（尤其描述鸟类）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially a bird) having a thick or fleshy tongue.","zh":"（动物，尤指鸟类）厚舌的；舌头肥厚的。"},"examples":[{"en":"Some nectar-feeding birds have a specialized, pachyglossate tongue for handling food.","zh":"一些食蜜的鸟类有特殊的厚舌（pachyglossate）结构，用来处理食物。"},{"en":"The report described the specimen as pachyglossate, noting a noticeably fleshy tongue.","zh":"报告把该标本描述为厚舌的，并指出它的舌头明显较肥厚。"}]}],"synonyms":["thick-tongued","broad-tongued"],"phonetic":"/ˌpækiˈɡlɑːseɪt/","extraExplanation":["这是一个较罕见、偏生物学/动物学用语的形容词，多见于分类描述或学术写作。","词源构词：pachy- 表示“厚、粗”（如 pachyderm“厚皮动物”），gloss- 表示“舌”（如 glossary 与“词汇/舌头”同源），-ate 这里用于构成形容词。","日常英语中几乎不用来形容人；如果要说人“口齿不清/舌头不灵活”，更常见的说法是 tongue-tied, thick-tongued, slurred speech 等。"]}
{"word":"pachyglossia","summary":{"en":"Pachyglossia is a medical term meaning an abnormally thick tongue.","zh":"pachyglossia 是医学术语，指舌头异常增厚（舌肥厚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) an abnormal thickness of the tongue; a “thick tongue.”","zh":"（医学）舌肥厚；舌体异常增厚（“厚舌”）。"},"examples":[{"en":"The dentist noted possible pachyglossia during the oral exam and recommended a specialist consult.","zh":"牙医在口腔检查中注意到可能存在舌肥厚，并建议转诊专科评估。"},{"en":"In rare cases, pachyglossia can affect speech clarity or swallowing.","zh":"在少数情况下，舌肥厚可能影响发音清晰度或吞咽。"}]}],"synonyms":["thick tongue","macroglossia (related)"],"phonetic":"/ˌpækiˈɡlɑːsiə/","extraExplanation":["词源拆解：pachy- 表示“厚”（如 pachyderm 厚皮动物），-glossia 来自希腊语 glōssa，表示“舌/语言”。合起来就是“舌头变厚/舌肥厚”。","使用场景：这是较偏医学的术语，临床交流中有时也会用更常见的相关词，如 macroglossia（巨舌，强调“舌头变大”）；pachyglossia 更强调“变厚”。若你在非医学语境写作，通常用 thick tongue 更容易被理解。"]}
{"word":"pachyglossous","summary":{"en":"“Pachyglossous” describes someone with a thick or enlarged tongue, mainly in medical writing.","zh":"“pachyglossous”指舌体肥厚或增大，主要见于医学书写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a thick or unusually enlarged tongue (often used in medical contexts).","zh":"（多用于医学语境）舌头肥厚的；舌体异常增大的。"},"examples":[{"en":"The clinician noted that the patient appeared pachyglossous, which can affect speech and breathing.","zh":"临床医生注意到患者似乎有舌体肥厚的表现，这可能影响说话和呼吸。"},{"en":"Pachyglossous features may be associated with certain congenital or endocrine conditions.","zh":"舌体肥厚的特征可能与某些先天性或内分泌疾病有关。"}]}],"synonyms":["thick-tongued","enlarged-tongued","macroglossic"],"phonetic":"/ˌpækiˈɡlɔsəs/","extraExplanation":["词源提示：pachy- 表示“厚、粗”，gloss- / glossa 表示“舌”。合起来就是“舌头很厚”。","这是较少见、偏专业的词；日常英语里更常说 “enlarged tongue” 或医学上用 “macroglossia（巨舌）”。","使用时注意语境：它通常是中性、描述性的医学用语；与人交流时可用更委婉的表达（如“tongue enlargement”）以避免冒犯。"]}
{"word":"pachyhaemia","summary":{"en":"Pachyhaemia is a rare medical term meaning unusually thick or viscous blood.","zh":"pachyhaemia 是较少见的医学词，指血液异常增稠/黏稠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal condition in which the blood is unusually thick or viscous; “thick blood,” often associated with increased concentration of cells or proteins.","zh":"（医学）血液异常增稠/黏稠的状态；即“血变稠”，常与血细胞或血浆蛋白浓度升高有关。"},"examples":[{"en":"The doctor considered pachyhaemia as a possible explanation for the patient’s sluggish blood flow.","zh":"医生把血液增稠（pachyhaemia）视为患者血流缓慢的一个可能原因。"},{"en":"Conditions that raise red blood cell counts can sometimes lead to pachyhaemia.","zh":"某些会升高红细胞数量的疾病有时会导致血液增稠（pachyhaemia）。"}]}],"synonyms":["hyperviscosity","thick blood","hemoconcentration"],"phonetic":"/ˌpækiˈhiːmiə/","extraExplanation":["该词较少见，多用于医学/学术语境；临床上更常用的相关概念是“blood hyperviscosity（血液高黏滞）”或“hyperviscosity syndrome（高黏滞综合征）”。","词源：来自希腊语词根 pachy-（厚、粗）+ haemia（血），字面意思就是“厚血/稠血”。"]}
{"word":"pachyhaemic","summary":{"en":"A rare medical adjective meaning “having unusually thick, viscous blood.”","zh":"一个罕见的医学形容词，意思是“血液异常黏稠/血黏度增高的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having unusually thick blood; relating to increased blood viscosity.","zh":"（医学）血液异常黏稠的；与血液黏度增高有关的。"},"examples":[{"en":"The lab results suggested a pachyhaemic state, so the doctor checked for causes of high blood viscosity.","zh":"化验结果提示可能存在血液黏稠（pachyhaemic）状态，所以医生进一步检查导致血黏度升高的原因。"},{"en":"In severe dehydration, the blood can become more concentrated and temporarily pachyhaemic.","zh":"在严重脱水时，血液会更浓缩，可能暂时呈现“血液更黏稠”的状态。"}]}],"synonyms":["hyperviscous","thick-blooded","viscous"],"phonetic":"ˌpækiˈhiːmɪk","extraExplanation":["这是一个非常少见、偏旧式的医学词，通常出现在专业文献或历史性描述中。更常见的表达是 increased blood viscosity（血液黏度增高）、hyperviscosity（高黏滞/高黏度状态）。","词源上可拆为 pachy-（厚、粗；来自希腊语）+ -haemic（与血有关；与 heme/hem- 同源）。","注意它描述的是“血液黏稠/黏度高”的性质，并不等同于某一种具体疾病；可能与脱水、红细胞增多（polycythemia）、某些蛋白异常等情况相关。"]}
{"word":"pachyhaemous","summary":{"en":"Pachyhaemous means having unusually thick (viscous) blood; it’s a rare, old-fashioned medical adjective.","zh":"pachyhaemous 指“血液异常黏稠的”，是较罕见、偏旧式的医学形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Having unusually thick or viscous blood; thick-blooded.","zh":"（医学用语，罕见）血液异常黏稠的；“浓血”的。"},"examples":[{"en":"The report described the patient as pachyhaemous, suggesting abnormally thick blood.","zh":"报告称病人呈“pachyhaemous（血液黏稠）”状态，提示血液异常浓稠。"},{"en":"In older texts, pachyhaemous conditions were linked to sluggish circulation.","zh":"在较早的文献中，pachyhaemous 的状况常被认为与血液循环迟缓有关。"}]}],"synonyms":["hyperviscous","thick-blooded","viscous-blood"],"phonetic":"/ˌpækiˈhiːməs/","extraExplanation":["词源上可拆为 pachy-（厚、粗）+ haem-/haemato-（血）。这种拼写更偏英式（haem-），在现代临床英语里更常用的表达是“hyperviscous / hyperviscosity（高黏滞/高黏滞综合征）”或直接说“thick/viscous blood（血液黏稠）”。","该词非常少见，多出现在旧医学著作或词源学语境中；日常学习和写作中不建议频繁使用。"]}
{"word":"pachyhematous","summary":{"en":"A rare medical adjective meaning “having unusually thick/viscous blood.”","zh":"一个很少见的医学形容词，意思是“血液异常黏稠/很稠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Having unusually thick or viscous blood; thick-blooded.","zh":"（医学用语，少见）血液异常黏稠的；“血很稠/浓”的。"},"examples":[{"en":"Severe dehydration can make the blood more viscous, sometimes described in older texts as pachyhematous.","zh":"严重脱水会让血液更黏稠，在一些较旧的文献里有时会用 pachyhematous 来描述。"},{"en":"The clinician considered a pachyhematous state when the lab results suggested increased viscosity.","zh":"当化验结果提示血液黏稠度升高时，临床医生考虑可能存在 pachyhematous 的状态。"}]}],"synonyms":["hyperviscous","thick-blooded","high-viscosity"],"phonetic":"/ˌpækiˈhiːmətəs/","extraExplanation":["这个词非常罕见，多见于旧式或非主流的医学写法。构词上通常可理解为 pachy-（希腊语词根，意为“厚/粗”）+ hemat-（血）。在现代医学英语里，更常用的表达是 “high blood viscosity（血液黏稠度高）”、“hyperviscosity（高黏滞综合征/高黏度）” 或 “thickened blood”。","拼写上也可能见到英式变体 pachyhaematous（含 haema-），与美式 hemat- 的差异类似于 haemoglobin vs hemoglobin。"]}
{"word":"pachyhemia","summary":{"en":"Pachyhemia is a rare term for an abnormal “thick blood” condition (increased blood viscosity).","zh":"Pachyhemia 是罕见用语，指血液异常增稠（血液黏稠度升高）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical term meaning an abnormal condition of “thick blood,” often referring to increased blood viscosity (thickness) because there are too many blood cells or too much protein in the blood","zh":"（罕见医学用语）“血液增稠/稠血”的异常状态，常指因血细胞过多或血浆蛋白过多而导致血液黏稠度升高"},"examples":[{"en":"The doctor considered whether the patient’s symptoms could be related to pachyhemia (abnormally thick blood).","zh":"医生考虑患者的症状是否可能与 pachyhemia（血液异常增稠）有关。"},{"en":"In older medical writing, pachyhemia might be discussed alongside conditions like polycythemia.","zh":"在较早的医学文献中，pachyhemia 可能会与 polycythemia（真性红细胞增多症）等疾病一起被讨论。"}]}],"synonyms":["hyperviscosity","polycythemia","thick blood"],"phonetic":"/ˌpækiˈhiːmiə/","extraExplanation":["这个词非常少见，现代临床更常用的相关术语包括 hyperviscosity（高黏滞综合征/血液黏稠度升高）和 polycythemia（红细胞增多）。","词源上可拆为 pachy-（厚、粗）+ -hemia（与血有关的状态）。如果你是在检验报告或论文里看到它，建议结合上下文或请医生/专业人士确认具体所指。"]}
{"word":"pachyhymenia","summary":{"en":"Pachyhymenia is a scientific (Latin-based) genus name used for certain lichen-forming fungi.","zh":"Pachyhymenia 是一个拉丁化的科学属名，用于指代某些形成地衣的真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of lichen-forming fungi (a scientific name used in biology).","zh":"（生物学中的）地衣型真菌的一个属名（科学分类名称）。"},"examples":[{"en":"Pachyhymenia is a genus name you might see in lichen field guides or research papers.","zh":"Pachyhymenia 这个属名可能会出现在地衣的野外图鉴或研究论文中。"},{"en":"The specimen was tentatively identified as Pachyhymenia based on its microscopic features.","zh":"根据显微特征，这个标本被暂时鉴定为 Pachyhymenia 属。"}]}],"synonyms":["(no common English synonym; it is a proper scientific genus name)"],"phonetic":"/ˌpækihaɪˈmiːniə/","extraExplanation":["这是一个拉丁化的学名，通常用于学术语境而不是日常英语。","词形常被解释为 pachy-（“厚的”）+ hymenium（“子实层/产孢层”，真菌产生孢子的组织层）+ -ia（名词后缀），暗示它与“较厚的产孢层”等形态特征有关。具体特征仍需参考专业分类文献。","如果你是在医学语境里看到类似拼写，可能想查的是 pachymeningitis（硬脑膜炎/硬膜炎），两者是不同领域的词。建议你确认拼写与上下文。"]}
{"word":"pachyhymenic","summary":{"en":"A rare scientific adjective meaning “having a thick hymenium (spore-bearing layer),” used mainly in mycology and lichen studies.","zh":"一个较少见的科学形容词，意为“子实层（产孢组织层）较厚”，主要用于真菌与地衣研究。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mycology/Botany) Having a thick hymenium (the spore-bearing tissue layer), especially in some fungi and lichens.","zh":"（真菌学/植物学）具有较厚的子实层（产生孢子的组织层）的；常用于描述某些真菌或地衣的结构特征。"},"examples":[{"en":"Under the microscope, the lichen shows a pachyhymenic structure with a noticeably thick spore-bearing layer.","zh":"在显微镜下，这种地衣呈现出“子实层较厚”的结构，产孢组织层非常明显。"},{"en":"The researcher described the specimen as pachyhymenic to distinguish it from species with a thin hymenium.","zh":"研究者用“pachyhymenic（子实层厚）”来区分它与子实层较薄的物种。"}]}],"synonyms":["thick-hymenial","thick-hymenium"],"phonetic":"/ˌpækihaɪˈmɛnɪk/","extraExplanation":["这个词非常少见，主要出现在真菌学/地衣学的形态描述中。词根来自希腊语：pachy- 表示“厚的”，hymen- 指“膜/子实层（hymenium）”。","hymenium 指子囊菌、担子菌等产生孢子的关键组织层；“pachyhymenic”强调这层组织比常见情况更厚，通常用于分类或鉴定时的专业描述。"]}
{"word":"pachylophus","summary":{"en":"“Pachylophus” is a rare scientific name (likely a genus) meaning roughly “thick-crested,” not a common everyday English word.","zh":"“Pachylophus”是较少见的科学名称（多半为属名），大意为“厚冠/厚脊”，并非日常英语常用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare scientific (Latinized) name used as a genus label in biology; based on Greek roots meaning “thick crest/ridge.” It is not a common English word in everyday use.","zh":"一个较少见的科学（拉丁化）名称，用作生物分类学中的属名；源自希腊语词根，大意为“厚的冠/脊”。它不是日常英语常用词。"},"examples":[{"en":"I couldn’t find much information on “Pachylophus,” so I checked whether the spelling matched a known genus.","zh":"我几乎查不到“Pachylophus”的资料，所以我先核对拼写是否对应已知的属名。"},{"en":"In scientific writing, a genus name like Pachylophus is usually italicized.","zh":"在科学写作中，像 Pachylophus 这样的属名通常要用斜体。"}]}],"phonetic":"/ˌpækiˈloʊfəs/","extraExplanation":["这个词看起来像“学名/属名”，但在常见英语词典里通常查不到。你可能想找的是拼写相近的词（例如某些以 -lophus 结尾、表示“冠/脊”的学名）。如果你告诉我它出现的领域（恐龙/昆虫/植物等）或给我原句/截图，我可以更准确地确认它对应的物种或正确拼写。","词根提示：pachy-（厚的）+ lophus/lophos（冠、脊、嵴）。许多生物学名用这些希腊语词根来描述外形特征。"]}
{"word":"pachylosis","summary":{"en":"Pachylosis means an abnormal thickening of tissue, especially thickened skin.","zh":"pachylosis 指组织异常增厚，尤指皮肤增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal thickening of tissue, especially thickening of the skin (epidermis).","zh":"组织异常增厚；尤指皮肤（表皮）增厚。"},"examples":[{"en":"The dermatologist noted pachylosis on the patient’s palms after long-term friction.","zh":"皮肤科医生发现患者手掌因长期摩擦出现皮肤增厚（pachylosis）。"},{"en":"In some medical reports, pachylosis is described alongside callus formation and hyperkeratosis.","zh":"在一些医学报告中，pachylosis 常与胼胝形成和角化过度一起被描述。"}]}],"synonyms":["thickening","skin thickening","hyperkeratosis","callus formation"],"phonetic":"ˌpækiˈloʊsɪs","extraExplanation":["这是一个较少见的医学用词，多用于病理/皮肤科语境。日常英语里更常见的相关表达有 **thickening of the skin**（皮肤增厚）、**callus**（胼胝/老茧）、**hyperkeratosis**（角化过度）。","词根来源：**pachy-**（厚，源自希腊语 *pachys*）+ **-osis**（状态/病变）。看到类似结构的词时，常可用词根推测大意。"]}
{"word":"pachyma","summary":{"en":"Pachyma is an older scientific name for a fungus, often referring to the medicinal fungus known today as Poria/Wolfiporia (fu ling).","zh":"Pachyma 是一种真菌的旧称，常指今天更常称为 Poria/Wolfiporia 的药用真菌（与“茯苓”相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fungus (genus name), especially used in older scientific writing; often refers to the medicinal fungus now more commonly called Poria/Wolfiporia (e.g., “pachyma cocos”).","zh":"一种真菌（属名），多见于较旧的科学文献；常指现在更常称为茯苓相关的真菌（如“pachyma cocos”）。"},"examples":[{"en":"Some older herb books list the fungus as pachyma cocos instead of Wolfiporia extensa.","zh":"一些较旧的本草或药用资料会把这种真菌写作 pachyma cocos，而不是 Wolfiporia extensa。"},{"en":"The researcher compared pachyma samples from different regions.","zh":"研究人员比较了来自不同地区的 pachyma 样本。"}]}],"synonyms":["Poria","Wolfiporia","Poria cocos","fu ling"],"phonetic":"/ˈpækɪmə/","extraExplanation":["“Pachyma”在现代分类学里多被视为旧称（历史用名）。在中药语境中，它常与“茯苓（fu ling）”相关；茯苓是真菌菌核（sclerotium），常用于传统方剂。学术写作中更常见的现行名称包括 *Wolfiporia extensa* 或 *Poria cocos*。使用时最好结合具体文献的年代与命名体系（旧名/新名）。"]}
{"word":"pachymenia","summary":{"en":"“Pachymenia” is a rare anatomical word meaning the dura mater, the tough outer layer of the meninges.","zh":"“pachymenia”是较少使用的解剖学词，指硬脑膜（脑膜中最外层、最坚韧的一层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, rare) The dura mater—the tough outer membrane covering the brain and spinal cord.","zh":"（解剖学，较少用）硬脑膜——覆盖大脑与脊髓的坚韧外层脑膜。"},"examples":[{"en":"In older anatomy texts, “pachymenia” may be used to mean the dura mater.","zh":"在较早的解剖学教材中，“pachymenia”有时用来指硬脑膜。"},{"en":"The surgeon carefully separated the pachymenia from the underlying tissues.","zh":"外科医生小心地将硬脑膜与下方组织分离。"}]}],"synonyms":["dura mater","pachymeninx"],"phonetic":"/ˌpækiˈmiːniə/","extraExplanation":["词源来自希腊语：pachy-（厚、粗）+ meninx（脑膜）。现代医学英语更常用的是 dura mater（硬脑膜）或 pachymeninx（硬脑膜/厚脑膜）。","相关词：pachymeningitis 指“硬脑膜炎”（硬脑膜的炎症），比 pachymenia 更常见。"]}
{"word":"pachymenic","summary":{"en":"“Pachymenic” means “related to the dura mater (outer meningeal layer).” It is a rare/technical term, often replaced by “pachymeningeal.”","zh":"“pachymenic”意为“与硬脑膜（外层脑膜）有关的”。属于较少见的医学术语，常用“pachymeningeal”替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pachymeninx (the dura mater), the tough outer membrane covering the brain and spinal cord.","zh":"与硬脑膜（覆盖大脑和脊髓的坚韧外层脑膜）有关的；硬脑膜的。"},"examples":[{"en":"The MRI showed pachymenic thickening, suggesting inflammation of the dura mater.","zh":"核磁共振显示硬脑膜增厚，提示硬脑膜可能存在炎症。"},{"en":"Doctors considered a pachymenic process as a cause of the patient’s persistent headache.","zh":"医生将硬脑膜相关病变作为患者持续头痛的可能原因之一。"}]}],"synonyms":["pachymeningeal","dural"],"phonetic":"/ˌpækiˈmɛnɪk/","extraExplanation":["“pachymenic”在现代医学英语里较少见，更常用的是“pachymeningeal”或“pachymeningitis”（硬脑膜炎）。","词源提示：pachy- 表示“厚/厚的”，meninx 表示“脑膜”。因此该词从构词上就带有“（硬）脑膜相关”的含义。","使用场景多见于影像学或神经科语境，例如描述“pachymeningeal enhancement（硬脑膜强化）/ thickening（增厚）”。"]}
{"word":"pachymeningitic","summary":{"en":"Pachymeningitic means “related to inflammation of the dura mater (hard outer brain/spinal membrane).”","zh":"pachymeningitic 指“与硬脑膜（脑/脊髓外层厚脑膜）炎症有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to inflammation of the dura mater (the thick outer membrane covering the brain and spinal cord).","zh":"（与）硬脑膜炎有关的；指硬脑膜（覆盖脑和脊髓的最外层厚膜）发生炎症的。"},"examples":[{"en":"The MRI findings were consistent with pachymeningitic changes.","zh":"核磁共振检查结果与硬脑膜炎性改变相一致。"},{"en":"Doctors considered an autoimmune cause of the pachymeningitic process.","zh":"医生考虑这种硬脑膜炎性过程可能由自身免疫原因引起。"}]}],"synonyms":["dural (inflammatory)","related to pachymeningitis","hypertrophic pachymeningitic (in some contexts)"],"phonetic":"/ˌpækiˌmɛnɪnˈdʒɪtɪk/","extraExplanation":["这是一个医学术语，常见于影像学报告或神经科/感染科病历中。词根来源于希腊语：pachy- 表示“厚的”，mening- 表示“脑膜”，-itic 表示“与炎症有关的”。","相关概念：leptomeningitis（软脑膜炎，指蛛网膜与软脑膜的炎症）与 pachymeningitis（硬脑膜炎）相对。","在临床语境里也可能看到近似表达：pachymeningitis / hypertrophic pachymeningitis（肥厚性硬脑膜炎，指硬脑膜增厚并伴随炎症）。"]}
{"word":"pachymeningitis","summary":{"en":"Pachymeningitis is inflammation with thickening of the meninges, especially the dura mater.","zh":"Pachymeningitis 指脑膜（尤其硬脑膜）发生炎症并出现增厚的医学状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition involving inflammation and abnormal thickening of the meninges (the membranes covering the brain and spinal cord), especially the outer layer (dura mater).","zh":"一种医学状况：脑膜（覆盖大脑与脊髓的膜）发生炎症并出现异常增厚，尤其常累及最外层的硬脑膜（dura mater）。"},"examples":[{"en":"The MRI suggested hypertrophic pachymeningitis, so the doctor ordered more tests to find the cause.","zh":"核磁共振提示“肥厚性硬脑膜炎（pachymeningitis）”，医生因此安排了更多检查来寻找病因。"},{"en":"Symptoms of pachymeningitis can include chronic headache and nerve-related problems, depending on which areas are affected.","zh":"硬脑膜炎的症状可能包括长期头痛以及神经相关问题，具体取决于受累部位。"}]}],"synonyms":["hypertrophic pachymeningitis","dural inflammation","pachymeningeal inflammation"],"phonetic":"/ˌpækiˌmɛnɪnˈdʒaɪtɪs/","extraExplanation":["词源提示：pachy- 表示“厚的”（来自希腊语），mening- 与“脑膜”有关，-itis 表示“炎症”。合起来就是“脑膜增厚相关的炎症”。","医学上常见搭配是 hypertrophic pachymeningitis（肥厚性硬脑膜炎），强调“硬脑膜明显增厚”。它可能与感染、自身免疫性疾病、肉芽肿性疾病等有关，需要医生进一步鉴别诊断。","学习提示：它是偏专业的医学词，在日常英语中很少出现；一般在影像学报告、神经科/感染科文献或病历中见到。"]}
{"word":"pachymeninx","summary":{"en":"Pachymeninx is a medical term meaning the dura mater, the tough outer layer of the meninges.","zh":"Pachymeninx 是医学术语，指硬脑膜，即脑膜中坚韧的外层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the dura mater; the tough outer membrane covering the brain and spinal cord","zh":"硬脑膜；包覆大脑与脊髓的坚韧外层脑膜"},"examples":[{"en":"In anatomy class, we learned that the pachymeninx is another name for the dura mater.","zh":"在解剖课上，我们学到 pachymeninx 是硬脑膜的另一种说法。"},{"en":"Bleeding between the pachymeninx and the skull may be described as an epidural hematoma.","zh":"发生在 pachymeninx（硬脑膜）与颅骨之间的出血，可能被称为硬膜外血肿。"}]}],"synonyms":["dura mater","dura"],"phonetic":"/ˌpækiˈmɛnɪŋks/","extraExplanation":["这是一个医学/解剖学术语，来自希腊语词根：pachy- 表示“厚的”，meninx 表示“脑膜”。因此 pachymeninx 字面意思是“厚的脑膜”，对应较坚韧的外层脑膜（硬脑膜）。","在现代英语医学写作中，更常用的词是 dura mater；pachymeninx 多见于较正式或较旧的解剖学文献。","相关对照：leptomeninx（“薄脑膜”）通常指较薄的两层脑膜——蛛网膜与软脑膜。"]}
{"word":"pachymeter","summary":{"en":"A pachymeter is a device for measuring thickness, often used in engineering and eye care.","zh":"pachymeter 指“测厚仪”，用于测量厚度，常见于工程与眼科等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure thickness, especially very small thicknesses (for example, metal sheets, paper, or corneal thickness in eye care).","zh":"测厚仪；用于测量厚度的仪器，尤其是非常细微的厚度（如金属薄板、纸张，或眼科中的角膜厚度）。"},"examples":[{"en":"The technician used a pachymeter to check the thickness of the metal plate.","zh":"技术员用测厚仪检查金属板的厚度。"},{"en":"In an eye exam, the doctor measured the patient’s corneal thickness with a pachymeter.","zh":"在眼科检查中，医生用测厚仪测量患者的角膜厚度。"}]}],"synonyms":["thickness gauge","micrometer (in some contexts)","caliper (general)"],"phonetic":"/ˌpækiˈmitər/","extraExplanation":["“pachymeter”由希腊语词根组成：pachy- 表示“厚”，-meter 表示“测量仪”。因此它字面意思就是“测厚的仪器”。","在现代英语中，这个词常见于技术语境；在医学里更常见的具体说法是“corneal pachymeter”（角膜测厚仪）。"]}
{"word":"pachynathous","summary":{"en":"A rare adjective meaning “thick-jawed,” mainly used in zoology/anatomy.","zh":"一个罕见形容词，意为“厚颚/厚下颌的”，主要用于动物学或解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; zoology/anatomy) Having a thick or stout jaw; thick-jawed.","zh":"（罕用；动物学/解剖学）颌（下巴/颚部）厚实的；厚颚的。"},"examples":[{"en":"Some older zoological descriptions call the species pachynathous because its lower jaw is unusually thick.","zh":"一些较早的动物学描述会用 pachynathous 来形容该物种，因为它的下颌异常厚实。"},{"en":"The fossil skull looks pachynathous, suggesting a powerful bite.","zh":"这具化石头骨看起来“厚颚”，暗示咬合力很强。"}]}],"synonyms":["thick-jawed","strong-jawed","robust-jawed"],"phonetic":"/ˌpækiˈnæθəs/","extraExplanation":["这个词非常少见，多见于较旧或专业的分类/形态学写作。更常见、也更规范的拼写是 **pachygnathous**（pachy- “厚的” + -gnathous “颚/颌的”）。如果你是在论文或词典里看到 pachynathous，很可能是变体拼写或排版差异。"]}
{"word":"pachynema","summary":{"en":"Pachynema is the pachytene stage of meiosis (prophase I), when paired chromosomes undergo crossing over.","zh":"Pachynema 指减数分裂前期I的粗线期：同源染色体紧密配对并常发生交叉互换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stage of prophase I in meiosis when homologous chromosomes are closely paired (synapsed) and crossing over typically occurs; also called the pachytene stage","zh":"（生物）减数分裂第一次前期（前期I）中的一个阶段，此时同源染色体紧密联会（配对），通常会发生基因交换（交叉互换）；也称“粗线期（pachytene）”"},"examples":[{"en":"During pachynema, homologous chromosomes are tightly paired and genetic recombination can occur.","zh":"在 pachynema（粗线期）期间，同源染色体紧密配对，并可能发生基因重组。"},{"en":"The lab report described synapsis forming earlier, with crossing over becoming evident in pachynema.","zh":"实验报告指出联会在更早阶段形成，而交叉互换在 pachynema（粗线期）中变得明显。"}]}],"synonyms":["pachytene","pachytenema"],"phonetic":"/ˌpækiˈniːmə/","extraExplanation":["“pachynema”在一些教材或论文中用来指“pachytene（粗线期）”或其时期/状态名词化的表达，属于较偏专业的细胞生物学/遗传学词汇。","粗线期发生在“前细线期 leptotene → 偶线期 zygotene → 粗线期 pachytene → 双线期 diplotene → 终变期 diakinesis”的序列中，理解它有助于把握减数分裂中遗传多样性来源（交叉互换）。"]}
{"word":"pachynsis","summary":{"en":"“pachynsis” is not a standard English word; it’s likely a misspelling or a niche technical term.","zh":"“pachynsis”不是标准英语单词；很可能是拼写错误或小众技术术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a specialized term used in a narrow context (for example, medical/scientific writing).","zh":"不是标准英语单词。很可能是拼写错误，或只在非常特定的语境（如医学/科学写作）中使用的术语。"},"examples":[{"en":"I couldn’t find “pachynsis” in general English dictionaries—did you mean “synopsis”?","zh":"我在常见英语词典里查不到“pachynsis”——你是不是想写“synopsis（概要）”？"},{"en":"If you tell me the sentence where you saw “pachynsis,” I can help identify the correct word.","zh":"如果你把看到“pachynsis”的原句发给我，我可以帮你判断正确的词。"}]}],"phonetic":"/ˌpækiˈnsaɪs/","extraExplanation":["这个拼写看起来可能包含前缀 pachy-（源自希腊语，常见于医学术语里，表示“厚”），但“pachynsis”本身并不是常见或规范的英语词形。","发音 /ˌpækiˈnsaɪs/ 只是按字母拼写做的猜测读法；如果你提供来源（书名、论文、截图或上下文句子），我可以更准确地判断它是不是某个医学术语（或是否应为 synopsis、psychosis、pachy... 等其他词）。"]}
{"word":"pachyntic","summary":{"en":"“Pachyntic” is not standard; it likely means “pachytenic,” relating to the pachytene stage of meiosis.","zh":"“pachyntic”不是标准词，通常是“pachytenic”的误拼，指与减数分裂粗线期有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. It is likely a misspelling of “pachytenic” (also “pachytene”), a biology term meaning “relating to the pachytene stage of meiosis,” when paired chromosomes are thick and closely aligned.","zh":"不是标准英语单词。很可能是把生物学术语“pachytenic”（也写作“pachytene”）拼错了；该词表示“与减数分裂的粗线期有关”，此时期同源染色体加厚并紧密配对。"},"examples":[{"en":"The cells were observed in the pachytenic stage of meiosis under a microscope.","zh":"在显微镜下观察到这些细胞处于减数分裂的粗线期（pachytenic stage）。"},{"en":"Researchers analyzed pachytenic chromosomes to study crossing over.","zh":"研究人员分析粗线期染色体以研究交换（crossing over）。"}]}],"synonyms":["pachytene (noun, stage name)","pachytenic (adj.)"],"phonetic":"/ˌpækiˈtɛnɪk/","extraExplanation":["“pachy-”是词根/前缀，源自希腊语，意思是“厚的、粗的”（如 pachyderm 厚皮动物）。因此 pachytene/pachytenic 与“变厚的线（染色体形态）”这一阶段特征有关。","如果你是在论文或教材里看到“pachyntic”，建议回去核对原文拼写；在常见的生物学文献中更常见的是 pachytene（名词，阶段名）和 pachytenic（形容词）。"]}
{"word":"pachyodont","summary":{"en":"Pachyodont means “thick-toothed,” a scientific term used to describe animals (especially fossils) with unusually thick teeth.","zh":"pachyodont 意为“厚牙的”，是科学用语，用来描述牙齿特别厚的动物（常见于化石/古生物描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having unusually thick teeth; thick-toothed (used in zoology/paleontology).","zh":"（动物学/古生物学）厚牙的；牙齿特别厚的。"},"examples":[{"en":"Some fossil mammals are described as pachyodont because their molars have very thick enamel.","zh":"一些哺乳动物化石被描述为 pachyodont，因为它们的臼齿釉质非常厚。"},{"en":"The researcher compared pachyodont species with those that have thinner teeth.","zh":"研究者比较了厚牙物种和牙齿较薄的物种。"}]},{"partOfSpeech":"n.","definition":{"en":"An animal characterized by thick teeth (less common).","zh":"厚牙动物（较少用法）。"},"examples":[{"en":"In the paper, the author groups several pachyodonts together based on tooth structure.","zh":"在论文中，作者根据牙齿结构把几种厚牙动物归为一组。"}]}],"synonyms":["thick-toothed","pachydont"],"phonetic":"/ˌpækiˈɑːdɑːnt/","extraExplanation":["词源：pachy- 来自希腊语，意思是“厚、粗”；-odont 来自希腊语 odous/odont-，意思是“牙”。这个词多见于学术写作（动物学、古生物学、比较解剖）中，用来描述牙齿（常指臼齿或牙釉质/牙本质）特别厚、适合磨碎坚硬食物的特征。","拼写提示：有时也会看到变体 pachydont（含义相同），但 pachyodont 更贴近“pachy- + odont”的构词形式。"]}
{"word":"pachyotia","summary":{"en":"Pachyotia is a rare medical term meaning abnormal thickening of the outer ear.","zh":"Pachyotia 是较少见的医学术语，指外耳（耳廓）异常增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal thickening of the external ear (the auricle/pinna).","zh":"（医学）外耳（耳廓/耳郭）异常增厚。"},"examples":[{"en":"The doctor noted pachyotia, with the outer ear appearing unusually thick.","zh":"医生记录到外耳增厚（pachyotia），外耳廓看起来异常厚。"},{"en":"In some endocrine disorders, changes in soft tissue can include pachyotia.","zh":"在某些内分泌疾病中，软组织变化可能包括外耳增厚（pachyotia）。"}]}],"synonyms":["thickening of the auricle","thickened pinna"],"phonetic":"/ˌpækiˈoʊʃiə/","extraExplanation":["词源拆解：pachy- 表示“厚、增厚”（如 pachyderm“厚皮动物”），-otia 与“耳”有关（与 ot- / oto- 同源，如 otitis“耳炎”）。这个词偏医学用语，日常英语里很少见。","如果你原本想查的是拼写相近但更常见的词（例如 pachycephaly、pachyderm、pachytene 等），把上下文或原句发我，我可以帮你确认。"]}
{"word":"pachyotous","summary":{"en":"Pachyotous is a rare technical adjective meaning “thick-eared” or “having thickened ears.”","zh":"Pachyotous 是一个罕见的技术性形容词，意思是“耳朵很厚的/耳部增厚的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having thick or thickened ears; thick-eared.","zh":"（罕见/技术用语）耳朵很厚的；耳部增厚的。"},"examples":[{"en":"Some early zoological notes described certain rodents as pachyotous because of their unusually thick ear tissue.","zh":"一些早期的动物学记录把某些啮齿动物称为 pachyotous，因为它们的耳组织异常厚。"},{"en":"In older medical writing, a scarred, thickened ear might be called pachyotous.","zh":"在较旧的医学写作中，出现疤痕并增厚的耳朵有时会被称为 pachyotous。"}]}],"synonyms":["thick-eared","thickened (ear)","auricular thickening (technical phrase)"],"phonetic":"/ˌpækiˈoʊtəs/","extraExplanation":["这个词非常少见，多见于较早的动物学/医学描写中。词根 pachy- 来自希腊语，表示“厚、粗”；-otous 与“耳（otos）”有关，因此字面意思接近“厚耳的”。","如果你是在找更常见的词：形容“厚皮的”常用 pachydermatous（厚皮的）；表示“厚”也常用 thick 或 thickened。你也可以确认一下是否想拼写 pachyotic / pachy- 开头的其他词。"]}
{"word":"pachyperitonitis","summary":{"en":"A rare medical term meaning peritonitis with abnormal thickening of the peritoneum.","zh":"罕见医学术语：指伴随腹膜异常增厚的腹膜炎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the peritoneum (the lining of the abdomen) that is characterized by abnormal thickening of the peritoneal membrane; a rare, technical medical term.","zh":"（医学）腹膜炎的一种，特点是腹膜（腹腔内衬膜）出现异常增厚；较少见、偏专业的术语。"},"examples":[{"en":"The radiology report mentioned pachyperitonitis with marked peritoneal thickening.","zh":"影像学报告提到“pachyperitonitis（增厚性腹膜炎）”，并指出腹膜明显增厚。"},{"en":"Doctors considered pachyperitonitis because the patient had chronic abdominal pain and thickened peritoneal layers on imaging.","zh":"由于患者长期腹痛且影像显示腹膜层增厚，医生考虑“pachyperitonitis（增厚性腹膜炎）”。"}]}],"synonyms":["peritonitis with peritoneal thickening","chronic peritonitis (context-dependent)"],"phonetic":"/ˌpækiˌpɛrɪtəˈnaɪtɪs/","extraExplanation":["词源提示：pachy- 来自希腊语，意思是“厚的、增厚的”；peritonitis 指“腹膜炎”。合在一起强调“伴随腹膜增厚的腹膜炎”。","使用场景：这是偏病理/影像/学术写作的术语，日常临床更常直接写 peritonitis（腹膜炎）并描述“peritoneal thickening（腹膜增厚）”。","学习提示：如果你在英文病历或论文中看到该词，可以先抓住核心：peritonitis（炎症部位：腹膜）+ pachy-（特征：变厚）。"]}
{"word":"pachyphyllous","summary":{"en":"Pachyphyllous describes plants that have thick, fleshy leaves.","zh":"pachyphyllous 用于描述叶片肥厚（厚叶、肉质叶）的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having thick, fleshy leaves.","zh":"（植物学）厚叶的；叶片肥厚的。"},"examples":[{"en":"Many desert succulents are pachyphyllous to reduce water loss.","zh":"许多沙漠多肉植物是厚叶的，以减少水分流失。"},{"en":"The botanist described the shrub as pachyphyllous with waxy leaf surfaces.","zh":"植物学家形容这种灌木为厚叶的，且叶面带蜡质。"}]}],"synonyms":["thick-leaved","fleshy-leaved"],"phonetic":"/ˌpækiˈfɪləs/","extraExplanation":["词源：来自希腊语 pachy-（厚的）+ phyll-（叶）。因此它字面意思就是“厚叶”。","使用场景：多见于植物学/生态学描述（尤其是多肉植物、干旱或强日照环境中的植物），日常英语里非常少用。","相关概念：厚叶常与“保水、抗强光、减少蒸腾”有关；不过“pachyphyllous”只是形态描述，并不必然说明具体生态功能。"]}
{"word":"pachypleuritic","summary":{"en":"A medical adjective meaning “related to pleural thickening, often from pleuritis.”","zh":"一个医学形容词，表示“与胸膜增厚有关，常由胸膜炎导致”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to thickening of the pleura (the membrane around the lungs), usually as a result of pleuritis or chronic inflammation.","zh":"（医学）指胸膜（包绕肺的膜）增厚的，通常由胸膜炎或长期炎症引起。"},"examples":[{"en":"The CT report described pachypleuritic changes along the right lung base.","zh":"CT报告描述右肺底部出现胸膜增厚（pachypleuritic）改变。"},{"en":"Old infections can leave pachypleuritic scarring that may restrict lung expansion.","zh":"既往感染可能遗留胸膜增厚性瘢痕（pachypleuritic），从而限制肺的扩张。"}]}],"synonyms":["pleural thickening (related to)","pleuritic (context-dependent)","fibropleural (related, not identical)"],"phonetic":"/ˌpækiˌplʊˈrɪtɪk/","extraExplanation":["这个词在日常英语中非常少见，主要出现在影像学报告、病理描述或临床记录里，用来概括“胸膜增厚/胸膜肥厚”这一类表现。","词源拆解：pachy-（厚的）+ pleur-（胸膜）+ -itic（与炎症/炎性有关）。因此它通常暗示“炎症后导致的胸膜增厚”，而不只是单纯的“厚”。","在报告中常与 fibrosis（纤维化）、scarring（瘢痕）、pleural thickening（胸膜增厚）等搭配；是否影响呼吸功能要结合范围、部位和肺功能检查判断。"]}
{"word":"pachypod","summary":{"en":"A pachypod is a drought‑adapted plant with a thickened, swollen base or trunk that stores water.","zh":"pachypod 指一种基部或树干肥厚膨大、用来储水的耐旱植物（多见于园艺语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant with a thick, swollen base or trunk (often a succulent) that stores water; used especially in horticulture for certain drought‑adapted plants.","zh":"（园艺用语）指基部或树干肥厚膨大、能储水的植物（常为多肉植物）；尤用于描述一些耐旱植物。"},"examples":[{"en":"This pachypod needs bright light and careful watering to avoid rot.","zh":"这种“粗脚”植物需要充足光照，并且浇水要谨慎以免烂根。"},{"en":"Many pachypods come from dry regions and store water in their swollen stems.","zh":"许多粗脚植物来自干旱地区，会把水分储存在膨大的茎干里。"}]}],"synonyms":["caudiciform plant","succulent (general)","bottle tree (some types)"],"phonetic":"/ˈpækiˌpɑd/","extraExplanation":["词源上来自希腊语：pachy- 表示“厚、粗”，-pod 表示“足”。因此 pachypod 字面意思接近“粗脚的（植物）”，形象地指基部或主干像“脚”一样肥厚的形态。","它更常见于植物爱好者/园艺圈的描述性用法，而不是严格的植物分类学名称；常被用来谈论具有“膨大基部/块茎状主干”的耐旱植物。"]}
{"word":"pachypodous","summary":{"en":"“Pachypodous” means thick-footed, mainly used as a scientific adjective in biology/zoology.","zh":"“pachypodous”意为“粗足的、足部粗厚的”，主要作为生物/动物学中的形容词使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick or stout feet; thick-footed (used mainly in biology/zoology).","zh":"（多用于生物/动物学）足部粗厚的；粗足的。"},"examples":[{"en":"Some desert animals are described as pachypodous because their thick feet help them walk on hot sand.","zh":"一些沙漠动物被描述为“pachypodous（粗足的）”，因为它们粗厚的脚有助于在滚烫的沙地上行走。"},{"en":"In the field guide, the lizard’s pachypodous build is noted as an adaptation for digging.","zh":"在野外图鉴中，这种蜥蜴“pachypodous（粗足的）”的体型被认为是适应挖掘的特征。"}]}],"synonyms":["thick-footed","stout-footed","broad-footed"],"phonetic":"/ˌpækiˈpoʊdəs/","extraExplanation":["词源可拆解为希腊语前缀 pachy-（“厚、粗”）+ -pod / -pous（“脚、足”）。因此它字面意思就是“厚脚的”。","这是比较少见、偏专业的词，日常英语里更常用 thick-footed / big-footed 来表达类似意思。"]}
{"word":"pachypterous","summary":{"en":"Pachypterous means “thick-winged,” a scientific term used especially in zoology/entomology.","zh":"pachypterous 意为“厚翅的/翅膀增厚的”，多用于动物学与昆虫学等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick or thickened wings; used mainly in zoology/entomology to describe certain insects or animals.","zh":"（多用于动物学/昆虫学）厚翅的；翅膀增厚的。"},"examples":[{"en":"Some pachypterous beetles have wings that look thick and tough rather than thin and transparent.","zh":"一些厚翅的甲虫翅膀看起来又厚又硬，而不是薄而透明。"},{"en":"The field guide notes that this species is pachypterous, so it does not fly well.","zh":"野外图鉴注明这种物种是厚翅的，因此不太会飞/飞得不好。"}]}],"synonyms":["thick-winged","thick-winged (scientific)","robust-winged"],"phonetic":"/ˌpækiˈptɚəs/","extraExplanation":["“pachypterous”由希腊语词根构成：pachy-（厚）+ pterous（有翅的）。因此它是一个典型的科学描写词，日常英语里很少用，最常见于昆虫学论文、物种描述或鉴定手册中。","在一些昆虫描述里，它不只是“翅膀厚”，往往也暗示翅结构更硬、更不适于飞行（具体仍取决于物种与语境）。"]}
{"word":"pachyrhizus","summary":{"en":"Pachyrhizus is a genus of tropical bean-family plants known for edible tuberous roots (including jicama).","zh":"Pachyrhizus是豆科的一属热带植物，以可食用的块根著称（包括豆薯/凉薯等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical legumes (bean family) that produce edible, starchy tuberous roots; some species are grown as food crops (for example, the jicama/yam bean).","zh":"豆科的一属热带植物，会形成可食用的淀粉质块根；其中一些种类作为作物栽培（例如豆薯/凉薯 jicama，也称“yam bean”）。"},"examples":[{"en":"Jicama (Pachyrhizus erosus) is a Pachyrhizus plant grown for its crisp, edible root.","zh":"豆薯（Pachyrhizus erosus）属于Pachyrhizus属，因其爽脆可食的块根而栽培。"},{"en":"Researchers studied Pachyrhizus to improve tuber yield in tropical agriculture.","zh":"研究人员研究Pachyrhizus属植物，以提高热带农业中的块根产量。"}]}],"synonyms":["yam bean","jicama (a species in the genus)"],"phonetic":"/ˌpækiˈraɪzəs/","extraExplanation":["词源小贴士：Pachyrhizus来自希腊语词根，pachy- 意为“厚、粗”，rhiza 意为“根”，合起来大意是“粗根的”。","学习与使用提醒：这是植物学属名（拉丁学名的一部分），常见于学术、农学或食品资料中；日常英语里更常说具体作物名，如 jicama（豆薯/凉薯）或 yam bean（山药豆/豆薯类的俗称）。"]}
{"word":"pachyrhynchous","summary":{"en":"Pachyrhynchous means “thick-billed,” used mainly in zoology (especially ornithology).","zh":"pachyrhynchous 意为“厚嘴的/厚喙的”，主要用于动物学（尤其鸟类学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a bird or animal) having a thick, strong bill or beak.","zh":"（鸟类或动物）厚嘴的；喙粗厚而强壮的。"},"examples":[{"en":"Some finches are pachyrhynchous, with thick beaks suited for cracking seeds.","zh":"一些雀科鸟类是厚嘴的，粗厚的喙适合啄开种子。"},{"en":"The field guide describes the species as pachyrhynchous compared with similar birds.","zh":"这本野外图鉴称该物种相比相近鸟类更“厚嘴”。"}]}],"synonyms":["thick-billed","thick-beaked","strong-billed"],"phonetic":"/ˌpækiˈrɪŋkəs/","extraExplanation":["词源：来自希腊语词根 pachy-（厚、粗）+ rhynch-（喙、嘴、吻部），所以字面意思就是“厚喙的”。","使用场景：多见于动物学/鸟类学的描述性写作，日常英语里很少用；写作时常与“beak/bill（鸟喙）”一起出现以避免读者不熟悉该词。"]}
{"word":"pachysalpingitis","summary":{"en":"A medical term for inflammation of a fallopian tube, emphasizing thickening of the tube wall.","zh":"医学术语：输卵管的炎症，强调输卵管壁增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of a fallopian tube (salpinx), often described as a form of salpingitis with a thickened tube wall.","zh":"输卵管炎症（salpingitis）的一种描述方式，强调输卵管壁增厚/变厚。"},"examples":[{"en":"The pathology report mentioned pachysalpingitis, suggesting chronic inflammation of the fallopian tube.","zh":"病理报告提到 pachysalpingitis，提示输卵管存在慢性炎症。"},{"en":"Her doctor explained that pachysalpingitis can be associated with pelvic inflammatory disease.","zh":"医生解释说，pachysalpingitis 可能与盆腔炎（PID）有关。"}]}],"synonyms":["salpingitis","chronic salpingitis (context-dependent)"],"phonetic":"/ˌpækiˌsælpɪnˈdʒaɪtɪs/","extraExplanation":["这是一个较少见、偏专业的医学术语，常见于病理或影像学描述中；临床上更常用的总称是 salpingitis（输卵管炎）。","词源可拆解理解：pachy- 表示“厚/增厚”，salping- 表示“输卵管”，-itis 表示“炎症”。","相关背景：输卵管慢性炎症可能造成粘连、管腔狭窄或积液，进而影响受孕；具体诊断与治疗需由专业医生结合症状、检查结果判断。"]}
{"word":"pachysandra","summary":{"en":"Pachysandra is an evergreen groundcover plant commonly used to cover shaded ground in gardens.","zh":"Pachysandra是一种常绿地被植物，常用于花园中覆盖阴凉处地面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen groundcover plant with glossy leaves, often used in landscaping to cover shady areas","zh":"一种常绿地被植物（铺地植物），叶片有光泽，常用于园林绿化中覆盖阴凉处地面"},"examples":[{"en":"We planted pachysandra under the trees where grass wouldn’t grow.","zh":"我们在树下种了pachysandra，因为那里草长不起来。"},{"en":"Pachysandra spreads slowly and can form a dense green carpet.","zh":"Pachysandra蔓延得比较慢，但能形成厚密的绿色“地毯”。"}]}],"synonyms":["groundcover","Japanese pachysandra"],"phonetic":"/ˌpækiˈsændrə/","extraExplanation":["“pachysandra”在北美园艺语境里很常见，很多人指的是“Japanese pachysandra（日本富贵草）”，常见学名为 *Pachysandra terminalis*，适合半阴到全阴环境，用来做地被、减少杂草。","在园艺对话中，它常与“groundcover（地被）”“shade-tolerant（耐阴）”“spreads（蔓延/扩展）”一起出现。拼写里有“chy”，发音以 /k/ 音出现，别读成 /tʃ/。"]}
{"word":"pachysandras","summary":{"en":"“Pachysandras” means multiple pachysandra groundcover plants used in landscaping.","zh":"“pachysandras”指多株/多处的富贵草（一种常用于绿化的常绿地被植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of pachysandra: low-growing evergreen groundcover plants often used in landscaping (especially Japanese pachysandra).","zh":"pachysandra（富贵草/日本富贵草） 的复数：一种常绿、低矮匍匐的地被植物，常用于园林绿化。"},"examples":[{"en":"The landscaper planted pachysandras under the trees where grass wouldn’t grow well.","zh":"园艺工在树下种了很多富贵草，因为那里草坪不容易长好。"},{"en":"In shady areas, pachysandras can form a thick green carpet.","zh":"在阴凉处，富贵草能长成一层厚厚的绿色“地毯”。"}]}],"synonyms":["Japanese spurge","pachysandra"],"phonetic":"/ˌpækɪˈsændrəz/","extraExplanation":["“Pachysandra”在园艺语境里常被当作不可数名词来指这一类地被植物整体（如：We planted pachysandra. 我们种了富贵草）。当强调“几丛/几片/几处种植”时，也会用复数“pachysandras”。","常见别名是“Japanese spurge”（日本富贵草/日本草）；它喜阴或半阴，常用于树下、北向墙边等不适合草坪的地方。"]}
{"word":"pachysaurian","summary":{"en":"Pachysaurian is a rare adjective meaning “related to a thick-skulled dinosaur,” and sometimes (figuratively) “thick-headed or stubborn.”","zh":"Pachysaurian 是个少见的形容词，主要指“与厚头（厚颅）类恐龙相关/类似”，也可引申为“不开窍、顽固”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a thick-skulled dinosaur (especially a pachycephalosaur); “thick-skulled” in a literal, paleontological sense.","zh":"（古生物学）与厚头（厚颅）类恐龙有关的；类似厚头恐龙的；字面意义上的“厚头骨”。"},"examples":[{"en":"Some fossils show pachysaurian skulls built for head-butting.","zh":"一些化石显示出厚头类恐龙的头骨结构，可能适合顶撞。"},{"en":"The museum’s display includes a pachysaurian model with a domed head.","zh":"博物馆的展区里有一具厚头类恐龙的圆顶头骨模型。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, figurative) Slow to understand; stubbornly “thick-headed.”","zh":"（罕见，引申）理解迟钝的；顽固得像“厚头”一样的。"},"examples":[{"en":"He was being pachysaurian about the simplest instructions.","zh":"他对最简单的指示也表现得很“厚头”，怎么都不开窍。"},{"en":"Try a clearer explanation—don’t assume your audience is pachysaurian.","zh":"试着讲得更清楚些——别假设你的听众都很“不开窍”。"}]}],"synonyms":["pachycephalosaurian","thick-skulled","thick-headed","stubborn"],"phonetic":"ˌpækiˈsɔriən","extraExplanation":["这个词很少见，多出现在科普、古生物相关写作或带一点幽默感的比喻中。","词根来自希腊语：pachy- 表示“厚”，-saur- 与“蜥蜴/恐龙”相关（如 dinosaur）。因此 pachysaurian 直观上就是“厚（头骨）的恐龙那类”的意思。","更常见、标准的学术用词通常是 pachycephalosaur（厚头龙）及其形容词 pachycephalosaurian。"]}
{"word":"pachysomia","summary":{"en":"Pachysomia is a rare medical term meaning marked obesity or an abnormally large/thick body.","zh":"Pachysomia 是一个较少见的医学词，指明显的肥胖或身体异常粗大/肥厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A condition of having an abnormally large or thick body; obesity or marked corpulence.","zh":"（医学用语，较少见）体形异常粗大或肥厚的状态；肥胖；明显的臃肿。"},"examples":[{"en":"The doctor noted pachysomia in the chart and recommended gradual weight management.","zh":"医生在病历中记录了“pachysomia（肥胖/体形异常粗大）”，并建议循序渐进地进行体重管理。"},{"en":"In older medical writing, pachysomia was sometimes used as a formal term for severe obesity.","zh":"在较早的医学写作中，pachysomia 有时被用作“重度肥胖”的较正式说法。"}]}],"synonyms":["obesity","corpulence","stoutness","adiposity"],"phonetic":"/ˌpækiˈsoʊmiə/","extraExplanation":["这个词非常少见，多见于旧式或较学术的医学语境。日常英语里更常用 obesity（肥胖）、overweight（超重）、weight gain（体重增加）。","词源可拆为希腊语词根 pachy-（厚、粗）+ soma（身体），整体意思就是“身体变厚/变粗”。写作或翻译时，除非原文就是该词，一般会用更常见的 obesity 来表达。"]}
{"word":"pachysomous","summary":{"en":"Pachysomous means thick-bodied or heavily built (stout, bulky).","zh":"pachysomous 指“身体粗壮、体形厚重（敦实、笨重）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or animal) having a thick, heavy body; stout; bulky.","zh":"（指人或动物）身体粗壮的；体形厚重的；敦实的。"},"examples":[{"en":"The pachysomous cattle were bred for strength and endurance.","zh":"这些体形厚重的牛被培育来拥有力量和耐力。"},{"en":"In the painting, the artist contrasts a pachysomous figure with a slender one.","zh":"在这幅画里，画家用一个敦实的形象来对比一个苗条的形象。"}]}],"synonyms":["thick-bodied","stout","bulky","heavyset","stocky"],"phonetic":"ˌpækiˈsoʊməs","extraExplanation":["这个词很少见，属于偏学术/文学用语。常用于生物学描述或较正式的描写文体。","词源可拆解为 pachy-（厚、粗）+ -somous（与“身体”有关，源自希腊语 soma “身体”）。理解词根有助于猜测含义。","写作中若想更自然，日常英语更常用：stout, bulky, thick-bodied, heavyset（形容人时更常见）。"]}
{"word":"pachystichous","summary":{"en":"Pachystichous means “arranged in thick, dense rows,” mainly used in botany.","zh":"pachystichous 指“以厚密行列排列”，主要用于植物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) arranged in thick, dense rows or ranks (often referring to leaves, flowers, or scales packed closely along an axis).","zh":"（植物学）以厚密的行列/排列方式生长；（叶、花或鳞片等）沿着轴紧密成行排列。"},"examples":[{"en":"The botanist described the bracts as pachystichous, forming tight rows along the stem.","zh":"植物学家描述这些苞片为 pachystichous，沿着茎形成紧密的行列。"},{"en":"In this species, the flowers are pachystichous rather than loosely spaced.","zh":"在这个物种中，花是 pachystichous（密排列）的，而不是稀疏分布的。"}]}],"synonyms":["densely ranked","thickly arranged","closely packed"],"phonetic":"/ˌpækiˈstɪkəs/","extraExplanation":["这是一个偏专业的植物学形容词，日常英语里很少见，多出现在植物形态描述（flora、taxonomy、field guide）中。","词源可拆成 pachy-（厚、粗）+ -stichous（成行、成列；同源于表示“行/列”的希腊语词根）。理解为“厚密成行”最实用。","可与 distichous（两列对生/二列排列）对比：distichous 强调“二列”，pachystichous 更强调“厚、密、成行”。"]}
{"word":"pachystima","summary":{"en":"Pachystima is an evergreen shrub (and the genus name) found mainly in western North America.","zh":"pachystima 指北美西部常见的一类常绿灌木（厚蕊木属），也可指该属名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small evergreen shrub (genus *Pachystima*, in the staff-tree family) found mainly in western North America; also used as the plant’s name in gardening and botany.","zh":"厚蕊木属（*Pachystima*）的常绿小灌木（卫矛科/苦木科近缘类群之一），主要分布于北美西部；也常用作该植物的通称（园艺与植物学用语）。"},"examples":[{"en":"In the shaded forest understory, pachystima forms low, glossy green patches.","zh":"在阴湿的森林下层，厚蕊木常形成一片片低矮、叶面有光泽的绿色植被。"},{"en":"The field guide lists pachystima as a common evergreen shrub in the Rocky Mountains.","zh":"野外图鉴把厚蕊木列为落基山脉常见的常绿灌木。"}]}],"synonyms":["Oregon boxwood","Pachystima myrsinites"],"phonetic":"/ˌpækiˈstaɪmə/","extraExplanation":["“Pachystima”多用于植物学/园艺语境，日常英语里不算常见词。北美常见种是 *Pachystima myrsinites*，有时也被叫作 “Oregon boxwood”（俄勒冈黄杨，俗名）。","词源来自希腊语成分：*pachy-*（厚的）+ 词根与“柱头/痕迹”相关，用来描述植物结构特征；不同资料对后半部分的解释略有差异。"]}
{"word":"pachytene","summary":{"en":"Pachytene is a meiosis stage (prophase I) when paired chromosomes look thick and crossing over commonly happens.","zh":"Pachytene（粗线期）是减数分裂第一次前期的阶段，同源染色体显得粗厚清晰，并常发生交叉互换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stage of prophase I in meiosis when paired chromosomes (tetrads) become thick and clearly visible, and crossing over (genetic recombination) commonly occurs","zh":"（减数分裂第一次前期的一个阶段）染色体（四分体）变得粗厚、清晰可见，并常发生交叉互换（遗传重组）"},"examples":[{"en":"During pachytene, homologous chromosomes are tightly paired and look thicker under a microscope.","zh":"在粗线期（pachytene），同源染色体紧密配对，在显微镜下看起来更粗。"},{"en":"Crossing over often occurs in pachytene, increasing genetic variation in offspring.","zh":"交叉互换常发生在粗线期，从而增加后代的遗传多样性。"}]}],"synonyms":["pachynema"],"phonetic":"/ˌpækiˈtin/","extraExplanation":["“pachytene”常译为“粗线期”，属于减数分裂I的前期（prophase I）五个分期之一：细线期 leptotene → 偶线期 zygotene → 粗线期 pachytene → 双线期 diplotene → 终变期 diakinesis。学习时可用“越来越清楚”的顺序记忆：从细到粗，再到开始分离。","词源来自希腊语：pachy-（厚、粗）+ -tene（线、带），字面意思是“粗的线”。这也对应显微镜下染色体变粗、易观察的特征。"]}
{"word":"pachytrichous","summary":{"en":"Pachytrichous means “having thick or coarse hair; very hairy,” and it’s a rare, formal word used mostly in scientific descriptions.","zh":"pachytrichous 指“毛发粗而浓密、较多毛的”，较少用于日常英语，多见于较正式的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick or coarse hair; very hairy.","zh":"（毛发）粗而浓密的；多毛的。"},"examples":[{"en":"Some breeds of dogs are naturally pachytrichous, especially in cold climates.","zh":"有些犬种天生毛发浓密，尤其适应寒冷气候。"},{"en":"The researcher described the specimen as pachytrichous along the back and tail.","zh":"研究人员描述该标本背部和尾部的毛发较为浓密。"}]}],"synonyms":["thick-haired","hairy","hirsute","bushy"],"phonetic":"/ˌpækiˈtraɪkəs/","extraExplanation":["词根帮助记忆：pachy- 表“厚、粗”（如 pachyderm 厚皮动物），trich- 表“毛发”（如 trichology 头发学）。","该词较少用于日常英语，更常见于生物学、动物学或医学/解剖学等较正式的描述语境中。日常表达通常用 “hairy / thick-haired / bushy” 等。"]}
{"word":"pachytylus","summary":{"en":"Pachytylus is an older scientific genus name for certain grasshoppers/locusts, now mostly replaced by updated taxonomy.","zh":"Pachytylus 是一个较旧的昆虫属名，用于某些蚱蜢/蝗虫；现代分类多已改用其他属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name formerly used for certain grasshoppers/locusts (family Acrididae); in modern taxonomy many species once placed here have been reassigned to other genera.","zh":"（动物学）一种曾用于某些蚱蜢/蝗虫（蝗科 Acrididae）的属名；在现代分类中，许多原归入该属的物种已被重新归入其他属。"},"examples":[{"en":"Older entomology books may list some locusts under the genus Pachytylus.","zh":"较早的昆虫学书籍可能会把某些蝗虫列在 Pachytylus 这个属名之下。"},{"en":"The name Pachytylus appears mainly in historical scientific literature rather than everyday English.","zh":"Pachytylus 这个名称主要见于历史性的科学文献，而不是日常英语。"}]}],"synonyms":["(no common everyday synonym; scientific name)"],"phonetic":"/ˌpækiˈtaɪləs/","extraExplanation":["这是一个拉丁化的学名（genus name，属名），通常用于生物分类学语境；日常对话里几乎不会用到。","词源上常被解释为来自希腊语 pachy-（“厚、粗”）与 -tylus（“突起、结节”）等成分，属于典型的“描述形态特征”的命名方式。","如果你是在某篇论文/旧教材里看到它，建议同时查该物种的“现行有效学名”（current valid name），因为分类修订后可能已改属或改名。"]}
{"word":"pachyvaginitis","summary":{"en":"Pachyvaginitis is a rare/older medical term for vaginitis with thickening of the vaginal lining.","zh":"Pachyvaginitis 是较少见/较旧的医学词，指伴随阴道黏膜增厚的阴道炎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical term for vaginitis (inflammation of the vagina) in which the vaginal lining is unusually thickened.","zh":"医学用语：指伴随阴道黏膜（阴道壁内层）异常增厚的阴道炎。"},"examples":[{"en":"The doctor noted pachyvaginitis during the pelvic exam and ordered further tests.","zh":"医生在盆腔检查中记录为“增厚性阴道炎”，并安排了进一步检查。"},{"en":"Pachyvaginitis is an older, rarely used term in modern clinical practice.","zh":"“pachyvaginitis”是较旧、在现代临床中较少使用的术语。"}]}],"synonyms":["vaginitis (general term)"],"phonetic":"/ˌpækiˌvædʒəˈnaɪtɪs/","extraExplanation":["词源：pachy- 来自希腊语，意为“厚、增厚”；vaginitis 意为“阴道炎”。合起来强调“阴道黏膜增厚的炎症”。","使用提醒：这是偏专业、且较少见/较旧的医学词；日常或较新的医学表达通常直接用 vaginitis（阴道炎），并用具体原因来描述（如 bacterial vaginosis、yeast infection 等）。如需就医沟通，建议用更常见的术语并描述症状。"]}
{"word":"pacifiable","summary":{"en":"“Pacifiable” means capable of being calmed or made peaceful.","zh":"“pacifiable”指“可被安抚、可被平息、可劝和的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be calmed down or made peaceful; willing or likely to stop being angry, aggressive, or in conflict.","zh":"可被安抚的；可被平息的；（人或局势）有可能被劝和、变得平静的。"},"examples":[{"en":"The child was upset at first, but she was pacifiable with a gentle voice and a hug.","zh":"孩子一开始很生气，但用温柔的声音和一个拥抱就能把她安抚下来。"},{"en":"Some disputes are pacifiable if both sides are willing to listen.","zh":"如果双方都愿意倾听，有些争端是可以平息的。"}]}],"synonyms":["calmable","appeasable","soothable","manageable","tractable"],"phonetic":"/ˈpæsɪˌfaɪəbəl/","extraExplanation":["“pacifiable”来自动词“pacify”（使平静、平息），常用于描述“情绪、冲突、群体、局势”等是否“有希望被安抚/劝和”。","与“peaceful（和平的/平静的）”不同，pacifiable强调“现在可能不平静，但可以被变得平静”；与“calm（冷静的）”相比，它更强调“通过外力或方法去安抚、平息”。","常见搭配：pacifiable child/person（可安抚的孩子/人）；pacifiable crowd（可安抚的人群）；pacifiable tensions/conflict（可平息的紧张/冲突）。"]}
{"word":"Pacific","summary":{"en":"Pacific most commonly refers to the Pacific Ocean; as an adjective, it means peaceful or calm.","zh":"Pacific最常指“太平洋”；作形容词时表示“和平的、平静的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Pacific Ocean, the largest ocean on Earth, between Asia/Australia and the Americas","zh":"太平洋：地球上最大的海洋，位于亚洲/澳大利亚与美洲之间"},"examples":[{"en":"Japan lies on the western edge of the Pacific.","zh":"日本位于太平洋的西缘。"},{"en":"Many islands in the Pacific have unique cultures and languages.","zh":"太平洋上的许多岛屿都有独特的文化和语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"peaceful and calm; not wanting conflict","zh":"和平的；平静的；不喜欢冲突的"},"examples":[{"en":"She has a pacific nature and avoids arguments.","zh":"她性格温和，尽量避免争吵。"},{"en":"We tried to reach a pacific solution to the disagreement.","zh":"我们努力以和平方式解决分歧。"}]}],"synonyms":["peaceful","calm","nonviolent","tranquil"],"phonetic":"/pəˈsɪfɪk/","extraExplanation":["“Pacific”作“太平洋”时，源于拉丁语“pacificus”，意为“带来和平的”。16世纪探险者麦哲伦（Magellan）在穿越这片海域时遇到相对平静的天气，因而用“Mar Pacifico（平静的海）”来称呼它，后来英语沿用为“Pacific Ocean”。","注意拼写与词义区分：Pacific（太平洋/和平的）与specific（具体的）很容易混淆。"]}
{"word":"pacific","summary":{"en":"“Pacific” most often refers to the Pacific Ocean or things related to it; it can also mean peaceful and calm.","zh":"“Pacific”最常指太平洋或与之相关的事物；也可表示“和平的、宁静的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the Pacific Ocean or the lands around it.","zh":"与太平洋或其周边地区有关的。"},"examples":[{"en":"Japan lies in the Pacific region.","zh":"日本位于太平洋地区。"},{"en":"We shipped the goods across the Pacific Ocean.","zh":"我们把货物跨太平洋运过去。"}]},{"partOfSpeech":"n.","definition":{"en":"(Pacific) the world’s largest ocean, between Asia/Australia and the Americas.","zh":"（大写 Pacific）太平洋：世界最大的大洋，位于亚洲/澳大利亚与美洲之间。"},"examples":[{"en":"The Pacific is deeper than the Atlantic in many places.","zh":"太平洋在许多地方比大西洋更深。"},{"en":"They sailed across the Pacific.","zh":"他们横渡了太平洋。"}]},{"partOfSpeech":"adj.","definition":{"en":"peaceful and calm; not wanting to argue or fight.","zh":"和平的；温和宁静的；不爱争吵或打斗的。"},"examples":[{"en":"She has a pacific nature and avoids conflict.","zh":"她性格温和，避免冲突。"},{"en":"The lake looked pacific in the early morning light.","zh":"清晨的光线里，湖面显得宁静安详。"}]}],"synonyms":["peaceful","calm","tranquil"],"phonetic":"/pəˈsɪfɪk/","extraExplanation":["“Pacific”作“宁静的/爱好和平的”时，词源来自拉丁语 pac-（和平），与 peace、pacify（使平静/安抚）同源。","作专有名词时常用 the Pacific；作形容词表示地区或航线时常见 Pacific Rim（环太平洋地区）、Pacific coast（太平洋沿岸）。"]}
{"word":"pacifica","summary":{"en":"Pacifica is most commonly a proper noun: a coastal city in Northern California; it can also be used as a name or brand with a Pacific/peaceful association.","zh":"Pacifica最常见是专有名词：美国加州北部的一座海滨城市；也可作人名或品牌名，常带有“太平洋/宁静和平”的联想。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a coastal city in northern California (San Mateo County), south of San Francisco, known for beaches and ocean views","zh":"（专有名词）美国加利福尼亚州北部圣马特奥县的海滨城市，位于旧金山以南，以海滩与海景闻名"},"examples":[{"en":"We drove to Pacifica to walk along the cliffs and watch the sunset.","zh":"我们开车去Pacifica沿着悬崖散步，看日落。"},{"en":"Pacifica is foggy in the morning but often clears up later.","zh":"Pacifica早上常有雾，但之后往往会放晴。"}]},{"partOfSpeech":"other","definition":{"en":"a given name or brand name used by various organizations and products (often suggesting an ocean or ‘Pacific’ theme)","zh":"（专有名词）用作人名或品牌名的“Pacifica”（常用来表达海洋或“太平洋”的意象）"},"examples":[{"en":"She chose the stage name Pacifica because she loves the ocean.","zh":"她选用Pacifica作为艺名，因为她喜欢海洋。"},{"en":"Pacifica is also used as a brand name for some products.","zh":"Pacifica也被一些产品用作品牌名。"}]}],"synonyms":["(for the city) none (proper noun)","(related words) Pacific","(related words) pacific (adj.)"],"phonetic":"pəˈsɪfɪkə","extraExplanation":["“Pacifica”常让人联想到“Pacific（太平洋/和平的）”。它与拉丁语词根 *pax*（和平）有关：*pacificus* 意为“带来和平的、和平的”，因此“Pacifica”在取名时常带有“宁静、海洋、和平”的文化联想。","在英语里它通常作为专有名词出现（地名/人名/品牌名），首字母大写。说到加州的 Pacifica，语境里往往指那座临海城市。"]}
{"word":"pacifical","summary":{"en":"Pacifical is a rare, old-fashioned adjective meaning “peaceful” or “promoting peace,” and it is generally replaced today by peaceful or pacific (or Pacific for the ocean).","zh":"Pacifical 是一个罕见的古旧形容词，主要表示“和平的/促成和平的”；现代英语一般用 peaceful 或 pacific（若指太平洋则用 Pacific）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) Peaceful; tending to make peace rather than war.","zh":"（罕见/古旧用法）和平的；倾向于促成和平、反对战争的。"},"examples":[{"en":"In older writings, a leader might be praised for a pacifical spirit.","zh":"在较早的著作中，领导者可能会因其“pacifical”的精神而受到称赞。"},{"en":"They hoped for a pacifical settlement instead of further conflict.","zh":"他们希望以和平方式解决问题，而不是让冲突升级。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Relating to the Pacific Ocean; “Pacific.”","zh":"（非常罕见）与太平洋有关的；相当于“Pacific”。"},"examples":[{"en":"Most modern texts would say “Pacific islands,” not “pacifical islands.”","zh":"大多数现代文本会说“Pacific islands（太平洋岛屿）”，而不是“pacifical islands”。"}]}],"synonyms":["peaceful","pacific","nonviolent","peace-loving"],"phonetic":"/pəˈsɪfɪkəl/","extraExplanation":["“pacifical”在现代英语里非常少见，多见于较早的书面语。日常表达通常用“peaceful（和平的）”“pacific（爱好和平的）”“peace-making（促成和平的）”。","容易和“Pacific（太平洋；太平洋的）”混淆：现代英语表示“太平洋的”几乎只用“Pacific”，不用“pacifical”。","词源上都与拉丁语“pax（和平）”相关，因此带有“和平/安宁”的核心意义。"]}
{"word":"pacifically","summary":{"en":"Pacifically means “peacefully; in a calm, non-violent way.” It is sometimes (incorrectly) used when people mean specifically.","zh":"pacifically 意为“和平地；平静地；以非暴力方式”。它有时会被误用来表示 specifically（具体地）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a peaceful or non-violent way; calmly.","zh":"以和平的方式；平静地；非暴力地。"},"examples":[{"en":"They agreed to resolve the conflict pacifically through discussion.","zh":"他们同意通过讨论以和平方式解决冲突。"},{"en":"The protest remained pacifically organized and orderly.","zh":"这场抗议始终保持和平、有序。"}]},{"partOfSpeech":"adv.","definition":{"en":"In relation to the Pacific Ocean or the Pacific region (rare).","zh":"与太平洋或太平洋地区有关地（较少用）。"},"examples":[{"en":"The islands are located pacifically, far from the mainland.","zh":"这些岛屿位于太平洋区域，远离大陆。"}]}],"synonyms":["peacefully","calmly","nonviolently","amicably"],"phonetic":"/pəˈsɪfɪkli/","extraExplanation":["“pacifically”经常被误用来代替“specifically”（具体地）。例如有人说“I meant pacifically…”其实想表达“I meant specifically…”。两者发音和拼写相近，但意思完全不同：pacifically=和平地；specifically=具体地。","词根提示：pacific 来自拉丁语“pax”（和平）。因此 pacifically 的核心语感是“和平、安宁、无冲突”。"]}
{"word":"pacificate","summary":{"en":"“Pacificate” is a rare verb meaning to pacify—bring peace, calm people, or reduce conflict.","zh":"“Pacificate”是个少见动词，意思接近“pacify”：带来和平、安抚他人或平息冲突。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make a person, group, or situation peaceful; to calm, quiet, or end conflict.","zh":"（少见）使人、团体或局势恢复平和；安抚、平息、止争。"},"examples":[{"en":"The leader tried to pacificate the crowd after the argument.","zh":"争吵之后，领导试图安抚人群。"},{"en":"They offered a compromise to pacificate tensions between the two sides.","zh":"他们提出妥协方案，以平息双方的紧张局势。"}]}],"synonyms":["pacify","appease","calm","soothe","mollify"],"phonetic":"/pəˈsɪfɪˌkeɪt/","extraExplanation":["“pacificate”在现代英语里非常少用，更常见、更自然的动词是“pacify”。写作或考试中一般建议用“pacify”，除非你在模仿古旧/正式文风。","词源与拉丁语“pax”（和平）有关，同根词包括“peace”“pacific（和平的）”“pacification（平定/绥靖）”。"]}
{"word":"pacificated","summary":{"en":"“pacificated” is usually a misspelling of “pacified,” meaning made calm/peaceful or brought under control.","zh":"“pacificated”通常是“pacified”的误拼，意思是被安抚、变得平静/和平，或被平定、受到控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/misspelling) Usually meant to be **pacified**: made calm, peaceful, or no longer angry; brought under control.","zh":"（非标准/拼写错误）通常想表达 **pacified**：使平静、安抚，使不再生气；或使局势/地区恢复和平、受到控制。"},"examples":[{"en":"After the apology, she seemed pacified and stopped arguing.","zh":"道歉之后，她似乎被安抚了，不再争论。"},{"en":"The government tried to pacify the region by negotiating with local leaders.","zh":"政府试图通过与当地领导人谈判来平定该地区。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of **pacify**: to calm someone down or make a situation peaceful.","zh":"**pacify** 的过去式/过去分词：安抚（某人），或使局势和平、平定。"},"examples":[{"en":"The mother pacified the crying baby with a lullaby.","zh":"妈妈用摇篮曲安抚了哭闹的婴儿。"},{"en":"They hoped the new policy would pacify tensions at work.","zh":"他们希望新政策能缓和工作中的紧张气氛。"}]}],"synonyms":["calmed","soothed","appeased","placated","quieted"],"phonetic":"/ˈpæsəˌfaɪd/","extraExplanation":["“pacificated”在现代英语里基本不作为标准词使用；常见正确形式是“pacified”。","词根来自拉丁语 *pax*（和平）。因此 *pacify/pacified* 与“使和平、使安静”相关。","容易混淆的词：**Pacific**（太平洋；和平的、温和的）。它和 *pacify* 同源，但用法不同。"]}
{"word":"pacificating","summary":{"en":"“Pacificating” means trying to make a situation peaceful or calm, but it’s rare; “pacifying” is the common word.","zh":"“pacificating”表示使局势和平或安抚他人，但非常少见；更常用的是“pacifying”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle) trying to bring peace to a situation, group, or conflict; making someone calmer or less angry.","zh":"（现在分词）试图使局势、群体或冲突恢复和平；安抚他人、让人平静或不那么生气。"},"examples":[{"en":"The manager spent the afternoon pacificating the two teams after the argument.","zh":"经理花了一下午安抚两支团队，处理争吵后的情绪。"},{"en":"She spoke softly, pacificating the child who was crying.","zh":"她轻声说话，安抚正在哭泣的孩子。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) the act or process of establishing peace between groups or nations.","zh":"（较少见）在群体或国家之间建立和平的行为或过程。"},"examples":[{"en":"The treaty was aimed at pacificating the region through cooperation.","zh":"该条约旨在通过合作让该地区实现和平。"}]}],"synonyms":["pacifying","calming","soothing","appeasing","reconciling"],"phonetic":"/pəˈsɪfɪˌkeɪtɪŋ/","extraExplanation":["“pacificating”非常少见。现代英语里更常用的是“pacifying”（安抚、平息）或“making peace/peacekeeping”。","来源上它和“pacific”（和平的；太平洋的）同源，来自拉丁语表示“使和平”的词根（pax=和平 + facere=做/使）。","使用提示：描述“让人冷静/平息争端”时，用“pacifying”更自然；“pacificating”往往显得书面、古旧或不地道。"]}
{"word":"pacification","summary":{"en":"Pacification means restoring peace and calm, and in some historical/military contexts it can mean subduing an area to gain control.","zh":"Pacification 指使局势恢复和平与平静；在某些历史/军事语境中也可指为取得控制而“平定”某地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making a situation calm and peaceful again, especially after conflict or violence","zh":"使局势恢复平静与和平的行为，尤指在冲突或暴力之后"},"examples":[{"en":"The pacification of the region took months of negotiations and community work.","zh":"该地区的平定花了数月的谈判与社区工作。"},{"en":"After the protest, the city focused on pacification through dialogue and reforms.","zh":"抗议之后，城市通过对话与改革来促成局势平息。"}]},{"partOfSpeech":"n.","definition":{"en":"in military or colonial contexts, the process of bringing an area under control by force or pressure (often viewed as harsh or controversial)","zh":"在军事或殖民语境中，用武力或强制手段使某地区“受控/平定”的过程（常被认为严厉且具争议）"},"examples":[{"en":"Historians debate whether the campaign was security or pacification.","zh":"历史学者争论这场行动究竟是治安维护还是“平定”。"},{"en":"The novel portrays pacification as costly for ordinary families.","zh":"这部小说把“平定”描写为让普通家庭付出沉重代价。"}]}],"synonyms":["calming","appeasement","conciliation","quieting","subjugation"],"phonetic":"/ˌpæsəfəˈkeɪʃən/","extraExplanation":["词源：来自拉丁语词根 pac-（peace，和平），与 peace、pacify（使平静/平定）、pacifist（和平主义者）同源。","语感提示：在日常英语里，pacification 多指“平息/安抚”局势；但在历史、军事报道中常带有“以控制为目的”的意味，可能隐含权力不对等，因此在写作中要注意语境与立场。","搭配：pacification efforts（平息行动/安抚举措）、the pacification of + 地区/局势、a policy/program of pacification（平定政策/计划）。"]}
{"word":"pacifications","summary":{"en":"“Pacifications” means actions or processes that make a situation peaceful; in historical/political contexts it can also mean forceful “pacifying” campaigns.","zh":"“pacifications”指使局势恢复和平的行动/过程；在历史或政治语境中也可指带有强制性的“平定行动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of making a place, group, or situation peaceful again; ending conflict or unrest.","zh":"使某地、某群体或某种局势恢复和平的过程；平息冲突或动乱。"},"examples":[{"en":"After weeks of protests, the government announced new measures aimed at pacifications in the capital.","zh":"在持续数周的抗议之后，政府宣布了旨在让首都恢复平静的新措施。"},{"en":"Community leaders helped with pacifications by encouraging dialogue between the two sides.","zh":"社区领袖通过鼓励双方对话来帮助平息事态。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/political) Military or police actions used to “pacify” a population by enforcing order, sometimes through force.","zh":"（历史/政治）以“安抚/平定”为名的军事或警察行动，通过强制维持秩序（有时伴随武力）。"},"examples":[{"en":"The report criticized the pacifications carried out in the region, saying civilians were harmed.","zh":"报告批评了该地区的“平定行动”，称平民受到了伤害。"},{"en":"The novel depicts colonial pacifications and the lasting resentment they created.","zh":"这部小说描写了殖民时期的“平定行动”以及它们造成的长期怨恨。"}]}],"synonyms":["peace-making","appeasement","calming","settlement","suppression"],"phonetic":"/ˌpæsəfəˈkeɪʃənz/","extraExplanation":["“pacification”在中性语境里常指“恢复和平/平息动乱”，但在历史与政治语境中（如殖民扩张、反叛镇压）常带有批判意味：表面是“让局势平静”，实际上可能包含强制控制与暴力。阅读新闻或史料时要结合语境判断语气。"]}
{"word":"pacificator","summary":{"en":"A pacificator is a person who helps stop conflict and bring peace.","zh":"pacificator 指帮助化解冲突、带来和平的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who pacifies others; a peacemaker or reconciler","zh":"使人平静/调停的人；和平缔造者；调解者"},"examples":[{"en":"In the heated meeting, she acted as a pacificator and helped both sides agree on a plan.","zh":"在那场激烈的会议上，她充当了调停者，帮助双方就计划达成一致。"},{"en":"The community needed a pacificator to calm fears after the incident.","zh":"事件之后，社区需要一位安抚者来平息人们的恐惧。"}]}],"synonyms":["peacemaker","mediator","conciliator","reconciler"],"phonetic":"/pəˈsɪfɪˌkeɪtɚ/","extraExplanation":["“pacificator”比较少见、更偏正式或古风；日常英语里更常用的是“peacemaker（调解者/和事佬）”“mediator（调停者）”“conciliator（和解促成者）”。","词根来自拉丁语：pax（和平）+ facere（做、创造），核心意思是“促成和平/使平静”。","在宗教或历史语境里，有时也用来指“带来和平的人/调停冲突的人”，语气比“peacemaker”更庄重。"]}
{"word":"pacificatory","summary":{"en":"Pacificatory describes something meant to calm conflict and promote peace or reconciliation.","zh":"Pacificatory 指“用于平息冲突、促成和解与和平的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to calm anger or conflict; meant to make people stop arguing and become peaceful; conciliatory.","zh":"旨在平息愤怒或冲突的；用于和解、安抚的；缓和的。"},"examples":[{"en":"The manager sent a pacificatory email to ease tensions between the two teams.","zh":"经理发了一封安抚性的邮件，以缓和两个团队之间的紧张关系。"},{"en":"His pacificatory tone helped the discussion stay respectful.","zh":"他和解的语气帮助讨论保持尊重。"}]}],"synonyms":["conciliatory","appeasing","soothing","peace-making","mollifying"],"phonetic":"/pəˈsɪfɪkəˌtɔri/","extraExplanation":["“pacificatory”较为书面、偏正式，在日常口语中更常用“conciliatory”（和解的）或“peace-making”（促成和平的）。","词源与拉丁语“pax / pac-（和平）”相关，和“pacify（平息、安抚）”“pacific（和平的）”同源。","在文学或政治评论中，它常用来描述“安抚性政策/姿态”（例如为避免冲突升级而采取的温和措施）。"]}
{"word":"pacificism","summary":{"en":"Pacificism is the belief that war and violence are wrong and that conflicts should be resolved peacefully.","zh":"Pacificism 指“和平主义”，主张反对战争与暴力，用和平方式解决冲突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief that war and violence are wrong, and that conflicts should be solved through peaceful means.","zh":"和平主义：认为战争与暴力是错误的，主张用和平方式解决冲突的信念或立场。"},"examples":[{"en":"Her pacificism led her to join anti-war protests.","zh":"她的和平主义信念促使她参加反战示威。"},{"en":"The group promotes pacificism and nonviolent action.","zh":"这个团体提倡和平主义和非暴力行动。"},{"en":"In class we debated whether pacificism is practical during a national crisis.","zh":"课堂上我们讨论了在国家危机时期，和平主义是否现实可行。"}]}],"synonyms":["pacifism","nonviolence","antiwar stance"],"phonetic":"/ˈpæsəfɪˌsɪzəm/","extraExplanation":["“pacificism”更常见的拼写是“pacifism”。两者意思相同，但在现代英语里“pacifism”使用频率更高，写作时建议优先用“pacifism”。","词根“pac-”来自拉丁语“pax（和平）”，同源词还有“peace（和平）”“pacify（使平息）”“Pacific（太平洋；平静的）”。","在文化与历史语境中，和平主义常与“conscientious objection（良心拒服兵役）”相关：一些人基于宗教或道德理由拒绝参战。"]}
{"word":"pacificist","summary":{"en":"A pacifist is someone who opposes war and violence and supports peaceful ways to solve conflicts.","zh":"pacifist 指反对战争与暴力、主张以和平方式解决冲突的人（或和平主义的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that war and violence are wrong and should be avoided, especially by using peaceful methods to solve conflicts","zh":"和平主义者；主张避免战争与暴力、用和平方式解决冲突的人"},"examples":[{"en":"As a pacifist, she refused to carry a weapon during the war.","zh":"作为和平主义者，她在战争期间拒绝携带武器。"},{"en":"Many pacifists join marches to protest violence and support dialogue.","zh":"许多和平主义者参加游行，反对暴力并支持对话。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to war or violence; favoring peace","zh":"反对战争或暴力的；主张和平的"},"examples":[{"en":"He wrote pacifist essays arguing that conflicts should be settled through negotiation.","zh":"他写了主张和平主义的文章，认为冲突应通过谈判解决。"},{"en":"The group took a pacifist approach and focused on nonviolent protest.","zh":"该团体采取和平主义方式，专注于非暴力抗争。"}]}],"synonyms":["peace advocate","antiwar activist","nonviolent protester"],"phonetic":"/ˈpæsəfɪst/","extraExplanation":["“pacifist”来自拉丁语词根 *pax*（和平）+ *-fic*（做、制造，见于 *pacify* “使平息”）。常与“nonviolence/非暴力”“conscientious objector/良心拒服兵役者”一起出现，但两者不完全等同：和平主义者强调反对战争与暴力；良心拒服兵役者强调因信念拒绝参战。","在英语中更常见的拼写是 **pacifist**（不要和 *Pacific* “太平洋”混淆）。发音也不同：*pacifist* 的重音在前面。","语域提示：在政治与历史语境中常见，如反战运动、民权运动中的“非暴力抵抗”。著名相关人物常被提及：Mohandas Gandhi（甘地）、Martin Luther King Jr.（马丁·路德·金）等（他们常与“非暴力”理念联系在一起）。"]}
{"word":"pacificistic","summary":{"en":"Pacifistic means favoring peace and opposing war or violence; “pacificistic” is a rare variant and is usually intended to mean “pacifistic.”","zh":"pacifistic 指“和平主义的、反对战争或暴力的”；pacificistic 很少见，通常是想表达 pacifistic（有时是变体或误拼）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Favoring peace; opposed to war or violence; supporting pacifism.","zh":"爱好和平的；反对战争或暴力的；支持和平主义的。"},"examples":[{"en":"She has a pacifistic approach to conflict and prefers negotiation over fighting.","zh":"她处理冲突的方式很和平主义，更倾向于谈判而不是争斗。"},{"en":"Many pacifistic groups organized marches calling for an end to the war.","zh":"许多和平主义团体组织游行，呼吁结束战争。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to or resembling the Pacific Ocean or Pacific region; “Pacific” + “-istic.”","zh":"（罕见）与太平洋或太平洋地区有关的；由“Pacific（太平洋）”+“-istic”构成。"},"examples":[{"en":"The museum featured pacifistic art influences from island cultures.","zh":"博物馆展出了受岛屿文化影响的“太平洋风”艺术（较少见的用法）。"}]}],"synonyms":["peace-loving","nonviolent","antiwar","conciliatory"],"phonetic":"/ˌpæsəˈfɪstɪk/","extraExplanation":["“pacificistic”在现代英语中非常少见，通常人们想表达的是“pacifistic”（和平主义的）。如果你写的是“反战、反暴力”的意思，建议用更常见、更标准的拼写“pacifistic”。","词源上，“pacifistic”来自“pacifism（和平主义）”，而不是“Pacific（太平洋）”。因为拼写相近，偶尔会出现“pacificistic”这种变体或误拼。"]}
{"word":"pacificistically","summary":{"en":"An adverb meaning “in a pacifist/pacifistic manner.”","zh":"表示“以和平主义（反战）方式地”的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pacifistic way; favoring peace and opposing war or violence.","zh":"以和平主义的方式；主张和平、反对战争或暴力地。"},"examples":[{"en":"She spoke pacificistically about resolving the conflict through negotiation, not force.","zh":"她以和平主义的立场谈到要通过谈判而不是武力来解决冲突。"},{"en":"The group acted pacificistically, refusing to carry weapons even in dangerous areas.","zh":"该团体以和平主义方式行事，即使在危险地区也拒绝携带武器。"}]}],"synonyms":["pacifistically","peacefully","nonviolently"],"phonetic":"/ˌpæsɪˈfɪstɪkli/","extraExplanation":["“pacificistically”比较少见，更常见的是“pacifistically”（同义）或直接用短语“in a pacifist way / from a pacifist perspective”。","词根提示：pacifist（和平主义者）→ pacifistic（和平主义的）→ pacificistically（以和平主义方式地）。注意不要和“Pacific”（太平洋）混淆。"]}
{"word":"pacificity","summary":{"en":"Pacificity means peacefulness or a calm, nonviolent nature.","zh":"Pacificity 指“和平、平和、不好争斗的特质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being peaceful; peacefulness and a tendency to avoid conflict","zh":"和平的性质；温和、避免冲突的倾向"},"examples":[{"en":"The leader’s pacificity helped calm tensions during the negotiation.","zh":"这位领导人的温和与和平倾向帮助在谈判中缓解了紧张气氛。"},{"en":"Many people admired her pacificity, even when others argued loudly.","zh":"即使别人激烈争吵，许多人仍钦佩她的平和与不争。"}]}],"synonyms":["peacefulness","calmness","nonviolence","tranquility","placidity"],"phonetic":"/pəˈsɪfɪsəti/","extraExplanation":["“pacificity”比较罕见，日常英语里更常用“peacefulness”“calmness”“nonviolence”来表达类似意思。","词根来自“pacific”（和平的）与拉丁语“pax”（和平）有关，也与动词“pacify”（使平静、安抚）同源。","不要和地名含义的“Pacific”（太平洋）混淆；这里的含义指“和平/温和”，而不是“太平洋的”。"]}
{"word":"pacifico","summary":{"en":"“Pacifico/Pacífico” is mainly used as a borrowed Spanish/Italian word meaning “peaceful,” or as a proper name (often a brand or name).","zh":"“Pacifico/Pacífico”多用于西/意语借词，意为“和平的”，或作为专有名词（常见于品牌或姓名）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Spanish/Italian) peaceful; calm; non-violent.","zh":"（源自西班牙语/意大利语）和平的；平静的；非暴力的。"},"examples":[{"en":"In Spanish, “pacífico” can describe a peaceful protest.","zh":"在西班牙语里，“pacífico”可以用来形容“和平抗议”。"},{"en":"The guide said the village was pacifico—quiet and safe at night.","zh":"导游说那个村子很“pacifico”——夜里安静又安全。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used for people, places, or brands (e.g., “Pacífico,” a Mexican beer brand).","zh":"专有名词：用于人名、地名或品牌名（例如“Pacífico”，一个墨西哥啤酒品牌）。"},"examples":[{"en":"He ordered a Pacífico with lime.","zh":"他点了一瓶加青柠的Pacífico啤酒。"},{"en":"Pacífico is sometimes written with an accent mark in Spanish: “Pacífico.”","zh":"在西班牙语中，Pacífico有时会带重音符号写作“Pacífico”。"}]}],"synonyms":["peaceful","calm","nonviolent"],"phonetic":"/pəˈsifikoʊ/","extraExplanation":["“pacifico”本身不是常见的英语词汇；在英语语境里多见于西班牙语/意大利语借用、姓名、地名或品牌名。","西班牙语标准写法常为“pacífico”（重音在第二个音节），意为“太平的、和平的”，也可指“太平洋的”（如 Océano Pacífico=太平洋）。"]}
{"word":"pacificos","summary":{"en":"“pacificos” is most often Spanish for “peaceful” (plural), and sometimes an informal plural for the Mexican beer Pacífico.","zh":"“pacificos”多为西语“和平的/温和的”（复数）；也可能是墨西哥啤酒品牌 Pacífico 的非正式复数说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) plural form of “pacífico,” meaning “peaceful” or “pacific” (not aggressive).","zh":"（西语）“pacífico”的复数形式，意思是“和平的、温和的；不具攻击性的”。"},"examples":[{"en":"In Spanish, “pacíficos” describes a group of peaceful people.","zh":"在西语里，“pacíficos”可以用来形容一群和平的人。"},{"en":"Los manifestantes fueron pacíficos. (The protesters were peaceful.)","zh":"Los manifestantes fueron pacíficos.（抗议者很和平。）"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, U.S.) a plural reference to Pacífico, a Mexican lager beer brand (you might see it on a menu or in conversation).","zh":"（非正式，美式语境）指墨西哥拉格啤酒品牌 Pacífico 的复数说法（在菜单或聊天中可能会看到/听到）。"},"examples":[{"en":"Can we get two Pacificos, please?","zh":"我们要两瓶 Pacífico，可以吗？"},{"en":"They brought a bucket of Pacificos to the table.","zh":"他们端来一桶 Pacífico 啤酒到桌上。"}]}],"synonyms":["peaceful (for the meaning)","nonviolent","calm"],"phonetic":"/pəˈsɪfɪkoʊs/","extraExplanation":["“pacífico”在西语里有重音符号（pacífico），复数是“pacíficos”。英语里有时会把它当作外来词使用，但在正式英文写作中通常会改写为“peaceful / pacific”。","如果你指的是啤酒品牌，常见写法是“Pacífico”（带重音）或“Pacifico”（不带重音也常见）；点单时直接说“two Pacificos”很常见。"]}
{"word":"pacificus","summary":{"en":"“Pacificus” most commonly refers to Alexander Hamilton’s 1793 pen name for essays supporting U.S. neutrality; it can also mean “peaceful” in Latin-derived usage and appears as a Latin species epithet in scientific names.","zh":"“Pacificus”最常见的用法是指汉密尔顿在1793年为支持美国中立政策而使用的笔名；它也可作拉丁语衍生用法表示“和平的”，并常见于生物学命名中的拉丁种加词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, proper name) The pen name used by Alexander Hamilton in 1793 for a series of essays defending President Washington’s neutrality policy during the French Revolutionary Wars.","zh":"（历史/专有名）亚历山大·汉密尔顿在1793年使用的笔名，用于发表一组文章，为华盛顿总统在法国大革命战争时期的中立政策辩护。"},"examples":[{"en":"Hamilton signed the essays as “Pacificus” to argue that the U.S. should remain neutral.","zh":"汉密尔顿以“Pacificus”为署名写文章，主张美国应保持中立。"},{"en":"In early American political writing, “Pacificus” is often contrasted with “Helvidius.”","zh":"在早期美国政治论战中，“Pacificus”常与“Helvidius”相对照。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Latin-derived, rare) Peaceful; tending to promote peace.","zh":"（源自拉丁语/少见）和平的；促成和平的。"},"examples":[{"en":"The author adopted a pacificus tone, urging compromise instead of conflict.","zh":"作者采取了更“pacificus”的语气，呼吁妥协而非对抗。"}]},{"partOfSpeech":"other","definition":{"en":"(scientific naming) A Latin species epithet meaning “peaceful,” “of the Pacific,” or “Pacific-associated,” depending on context.","zh":"（生物命名）拉丁语种加词，可表示“温和的/和平的”“太平洋的”或“与太平洋有关的”，含义取决于具体命名背景。"},"examples":[{"en":"In taxonomy, “pacificus” in a species name may point to a Pacific region connection.","zh":"在分类学里，物种名中的“pacificus”可能暗示与太平洋地区有关。"}]}],"synonyms":["peaceful","conciliatory","pacific"],"phonetic":"/pəˈsɪfɪkəs/","extraExplanation":["“Pacificus”来自拉丁语，和英语 pacify（使平息）、pacific（和平的）同源，核心含义与“和平/平息”有关。","1793年的《Pacificus》文章是在美国是否要卷入英法冲突的争论中写成的；詹姆斯·麦迪逊用笔名“Helvidius”写文反驳，因此常被一起提到，作为美国早期宪政与外交权力之争的重要文本。"]}
{"word":"pacificy","summary":{"en":"Pacify means to calm someone down or to bring peace by ending conflict.","zh":"Pacify 指“安抚某人、使其平静”，也可指“平定局势、结束冲突”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to calm someone down and make them less angry, worried, or upset","zh":"安抚；平息（某人的愤怒、担忧或不安）"},"examples":[{"en":"She tried to pacify the crying baby with a lullaby.","zh":"她用摇篮曲安抚哭闹的宝宝。"},{"en":"The manager offered a refund to pacify the upset customer.","zh":"经理提出退款来安抚不满的顾客。"},{"en":"He spoke softly to pacify the crowd.","zh":"他轻声说话来平息人群的情绪。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring peace to a place or situation by ending conflict or violence","zh":"使（地区/局势）平定；平息（冲突或暴力）"},"examples":[{"en":"The government sent negotiators to pacify the region.","zh":"政府派出谈判代表去平定该地区。"},{"en":"They worked to pacify tensions between the two groups.","zh":"他们努力平息两组之间的紧张局势。"}]}],"synonyms":["calm","soothe","appease","mollify","placate"],"phonetic":"/ˈpæsəˌfaɪ/","extraExplanation":["你输入的“pacificy”通常是拼写错误；正确拼写是 **pacify**。常见混淆来自 **Pacific**（太平洋的/太平洋）这个词的拼写。","词源提示：**pacify** 来自拉丁语 *pax*（和平）相关词根，因此核心含义是“使和平、使平静”。"]}
{"word":"pacified","summary":{"en":"“Pacified” means calmed and made peaceful (often by soothing words or concessions).","zh":"“pacified”表示被安抚、平静下来（常通过安慰或让步来平息情绪/冲突）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"calmed down; made peaceful; no longer angry or upset","zh":"被安抚的；平静下来的；不再生气或激动的"},"examples":[{"en":"After a few minutes of gentle talking, the baby was pacified.","zh":"轻声安慰了几分钟后，宝宝被安抚好了。"},{"en":"She felt pacified once she understood what had happened.","zh":"当她明白发生了什么之后，情绪就平复了。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “pacify”: to calm someone down or stop conflict, often by giving something they want or by using soothing words","zh":"“pacify”的过去式/过去分词：安抚；平息冲突（常通过安慰的话或满足对方需求）"},"examples":[{"en":"The teacher pacified the class by promising a short break.","zh":"老师承诺休息一会儿，安抚了全班同学。"},{"en":"Local leaders were pacified with offers of jobs and support.","zh":"当地领导因获得工作和支持的承诺而被安抚/平息下来。"}]}],"synonyms":["calmed","soothed","settled","quieted","appeased"],"phonetic":"/ˈpæsəˌfaɪd/","extraExplanation":["“pacify”来自拉丁语词根“pax”（和平）。日常口语里常说“calm down/settle down”，语气更自然；“pacify”更正式，有时带一点“用让步或好处来平息不满”的意味。","搭配小提示：pacify a baby/child（安抚婴儿/孩子）；pacify protesters（平息抗议者情绪）；pacified tone/expression（平静的语气/表情）。","注意区别：pacify（让情绪或冲突平息）不等于“satisfy”（满足需求）或“appease”（姑息、安抚以避免麻烦，常带负面色彩）。"]}
{"word":"pacifier","summary":{"en":"A pacifier is mainly a baby’s soothing nipple; it can also mean anything used to calm people or reduce conflict.","zh":"pacifier 主要指婴儿用的“安抚奶嘴”；也可比喻指用来安抚情绪或缓和矛盾的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rubber or silicone nipple (often with a shield) that a baby sucks to calm down; also called a “dummy” (UK) or “soother” (Canada).","zh":"（婴儿用）安抚奶嘴；帮助宝宝吸吮以安抚情绪。（英式也常说 dummy，加拿大常说 soother）"},"examples":[{"en":"The baby stopped crying when we gave her a pacifier.","zh":"我们给宝宝一个安抚奶嘴后，她就不哭了。"},{"en":"He fell asleep with his pacifier in his mouth.","zh":"他含着安抚奶嘴睡着了。"},{"en":"Some parents wean their child off the pacifier around age two.","zh":"有些家长会在孩子两岁左右让孩子戒掉安抚奶嘴。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that calms anger, fear, or conflict; a soothing influence or “appeasement.”","zh":"（比喻）安抚物；缓和愤怒、恐惧或冲突的事物；安抚手段。"},"examples":[{"en":"Music can be a pacifier after a stressful day.","zh":"压力大的一天后，音乐可以起到安抚作用。"},{"en":"The apology was meant as a pacifier, not a real solution.","zh":"那句道歉只是用来安抚人心，并不是真正的解决方案。"}]}],"synonyms":["soother","dummy","comforter","appeasement (figurative)"],"phonetic":"/ˈpæsəˌfaɪɚ/","extraExplanation":["词源提示：pacifier 来自 pacify（安抚、平息）+ -er（表示“……的人/物”），字面意思就是“用来安抚的东西”。","文化用法：在美式英语里 pacifier 最常指婴儿“安抚奶嘴”。在英式英语里更常说 dummy；在加拿大英语里常说 soother。"]}
{"word":"pacifiers","summary":{"en":"“Pacifiers” usually means baby pacifiers; it can also mean something that calms people temporarily.","zh":"“pacifiers”通常指婴儿安抚奶嘴；也可比喻指暂时安抚情绪的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baby item (usually rubber or silicone) that a baby sucks on to feel calm; also called a “dummy” (UK) or “soother” (Canada).","zh":"安抚奶嘴（婴儿含在嘴里吸吮、用来安抚情绪的用品）。"},"examples":[{"en":"The baby stopped crying when we gave her a pacifier.","zh":"我们给她一个安抚奶嘴后，宝宝就不哭了。"},{"en":"Some parents use pacifiers only at bedtime.","zh":"有些家长只在睡觉时给孩子用安抚奶嘴。"},{"en":"We keep an extra pacifier in the diaper bag.","zh":"我们在尿布包里放了一个备用的安抚奶嘴。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that calms people or reduces tension (often used critically, meaning it only helps temporarily).","zh":"（比喻）安抚人心的东西；缓和紧张情绪的手段（常带批评意味，指只是暂时的安慰/权宜之计）。"},"examples":[{"en":"The small pay raise was just a pacifier for unhappy workers.","zh":"这点小幅加薪只是用来安抚不满员工的权宜之计。"},{"en":"He used jokes as a pacifier during the awkward meeting.","zh":"在尴尬的会议中，他用讲笑话来缓和气氛。"}]}],"synonyms":["soother","dummy","comforter","calmer","stopgap"],"phonetic":"/ˈpæsəˌfaɪɚ/","extraExplanation":["“Pacifier”来自动词“pacify”（使平静、安抚）。在不同英语地区叫法不同：美国常用 pacifier；英国常说 dummy；加拿大也常说 soother。","写作中把 pacifier 用作比喻时，常暗示“治标不治本”，需要根据语气判断是否带讽刺或批评。"]}
{"word":"pacifies","summary":{"en":"“Pacifies” means makes someone calm or less angry, or brings peace by reducing conflict.","zh":"“pacifies” 指“安抚使人冷静”，也可指“平定冲突、使恢复和平”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to calm someone down or make them less angry, worried, or excited","zh":"使（某人）平静下来；安抚；使不那么生气/担心/激动"},"examples":[{"en":"The mother pacifies her baby by singing softly.","zh":"妈妈轻声唱歌来安抚宝宝。"},{"en":"He tried to pacify the crowd after the long delay.","zh":"长时间延误后，他试图安抚人群。"},{"en":"A sincere apology can pacify an upset friend.","zh":"真诚的道歉可以安抚生气的朋友。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring peace to a place or group by ending conflict, sometimes by using control or force","zh":"使（地区/群体）恢复和平；平定（冲突），有时带有控制或武力的含义"},"examples":[{"en":"The government sent negotiators to pacify the region.","zh":"政府派出谈判人员去平定该地区。"},{"en":"The plan aimed to pacify tensions between the two groups.","zh":"该计划旨在缓解两派之间的紧张关系。"}]}],"synonyms":["calms","soothes","appeases","placates","eases","quells"],"phonetic":"/ˈpæsəˌfaɪz/","extraExplanation":["“pacifies” 是动词 “pacify” 的第三人称单数（he/she/it pacifies）。","语气与搭配：用于人时通常是“安抚、哄好”（pacify a child/customer）；用于社会政治语境时常带有“以控制手段平定”的历史色彩，因此有时听起来不够中性，可根据语境改用 “calm down / soothe / ease tensions”。"]}
{"word":"pacifism","summary":{"en":"Pacifism is the belief that violence and war are wrong and that peace is the best way to resolve conflict.","zh":"Pacifism 指“和平主义”：反对战争与暴力，主张以和平方式解决冲突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that war and violence are wrong, and that conflicts should be solved through peaceful methods.","zh":"和平主义；认为战争与暴力是错误的，主张用和平方式解决冲突的信念。"},"examples":[{"en":"Pacifism teaches that disagreements should be settled through dialogue, not violence.","zh":"和平主义强调分歧应通过对话解决，而不是诉诸暴力。"},{"en":"Because of her pacifism, she refused to carry a weapon during military training.","zh":"由于她信奉和平主义，她在军事训练中拒绝携带武器。"},{"en":"The movement’s pacifism gained support after the horrors of war became widely known.","zh":"当战争的恐怖广为人知后，这个运动的和平主义理念获得了更多支持。"}]}],"synonyms":["nonviolence","peace advocacy","anti-war belief","peacefulness"],"phonetic":"/ˈpæsəˌfɪzəm/","extraExplanation":["“pacifism”来自拉丁语词根 *pax*（和平）+ 词缀 *-ism*（主义/信仰）。常用于政治、宗教与社会运动语境。","注意区分：pacifism（反对战争与暴力的原则）不一定等同于“软弱”或“什么都不做”；很多和平主义者会支持非暴力抗争（nonviolent resistance），例如罢工、游行、抵制等。","相关文化语境：20世纪一些著名人物与运动常与和平主义联系在一起，如甘地倡导的非暴力不合作、马丁·路德·金的非暴力民权运动等。"]}
{"word":"pacifisms","summary":{"en":"“Pacifisms” is the plural of “pacifism,” meaning different forms of the belief that war and violence should be avoided.","zh":"“Pacifisms”是“pacifism”的复数，指主张避免战争与暴力的信念，以及这种信念的不同流派与形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"belief in or advocacy of peace, especially the idea that war and violence are wrong and should be avoided","zh":"和平主义；主张以和平方式解决冲突，尤其认为战争与暴力是错误并应避免的信念"},"examples":[{"en":"Her pacifism made it hard for her to support any military action.","zh":"她的和平主义让她很难支持任何军事行动。"},{"en":"Many people admired his pacifism during a time of conflict.","zh":"在冲突时期，许多人钦佩他的和平主义立场。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: pacifisms) different types, traditions, or expressions of pacifist beliefs (e.g., religious, political, or philosophical forms)","zh":"（复数：pacifisms）不同形式/传统的和平主义（如宗教的、政治的或哲学的和平主义）"},"examples":[{"en":"The course compared several pacifisms, including religious pacifism and political pacifism.","zh":"这门课比较了多种和平主义，包括宗教和平主义和政治和平主义。"},{"en":"Historians study how pacifisms developed in different countries.","zh":"历史学家研究不同国家的多种和平主义如何发展起来。"}]}],"synonyms":["nonviolence","antiwar belief","peace advocacy"],"phonetic":"/ˈpæsəˌfɪzəm/","extraExplanation":["“pacifism”来自拉丁语词根 pax（和平）+ -fic-（做、使）+ -ism（主义/思想体系）。","“pacifisms”作为复数，通常出现在学术写作或讨论流派时，用来强调“和平主义并非只有一种”，而是有多种思想路径与实践方式。"]}
{"word":"pacifist","summary":{"en":"A pacifist is someone who opposes war and violence; it can also describe ideas or groups that are anti-war.","zh":"pacifist 指“和平主义者/反战者”，也可作形容词表示“反对战争与暴力的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that war and violence are wrong and who tries to avoid or oppose them","zh":"和平主义者；反战者（认为战争与暴力是错误的，并主张避免或反对它们的人）"},"examples":[{"en":"She’s a pacifist who refuses to carry a weapon.","zh":"她是和平主义者，拒绝携带武器。"},{"en":"As a pacifist, he protested the war but supported helping refugees.","zh":"作为和平主义者，他反对战争，但支持援助难民。"}]},{"partOfSpeech":"adj.","definition":{"en":"strongly opposed to war or violence","zh":"和平主义的；反对战争（或暴力）的"},"examples":[{"en":"They belonged to a pacifist religious community.","zh":"他们属于一个倡导和平主义的宗教团体。"},{"en":"His pacifist views made military service impossible for him.","zh":"他的和平主义观点使他无法服兵役。"}]}],"synonyms":["peace advocate","antiwar activist","nonviolent activist"],"phonetic":"/ˈpæsəfɪst/","extraExplanation":["“pacifist”来自拉丁语词根“paci-”（和平，见 peace）+“‑fist”（做某事的人）。常与“peaceful（爱好和平的）”区分：peaceful 更偏“性格/氛围平和”，pacifist 更强调“反对战争与暴力”的立场与理念。","历史语境中，pacifist 常与反战运动、良心拒服兵役（conscientious objector）相关；文学与公共写作里也常用来讨论“道德信念”与“现实冲突”的张力。"]}
{"word":"pacifistic","summary":{"en":"Pacifistic means opposing war and supporting nonviolence.","zh":"pacifistic 指反对战争、支持非暴力的“和平主义的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Believing in or supporting pacifism; opposed to war or violence, especially as a way to solve conflicts.","zh":"主张和平主义的；反对战争或暴力（尤其反对用暴力解决冲突）的。"},"examples":[{"en":"She has pacifistic beliefs and refuses to support any war.","zh":"她信奉和平主义，拒绝支持任何战争。"},{"en":"The group took a pacifistic approach, focusing on dialogue and nonviolent protest.","zh":"这个团体采取和平主义的方式，专注于对话与非暴力抗议。"}]}],"synonyms":["pacifist","nonviolent","antiwar","peace-loving"],"phonetic":"/ˌpæsəˈfɪstɪk/","extraExplanation":["“pacifistic”常用来描述个人的信念、态度或组织的立场，比“peaceful”（平和的、安静的）更强调反战与非暴力的政治/道德立场。","常见搭配：pacifistic beliefs/values（和平主义信念/价值观），pacifistic stance（和平主义立场），pacifistic movement（和平主义运动）。","词源提示：来自“pacify”（使平静、和解）相关词族；“pacifism”是名词（和平主义），而“pacifist”既可作名词（和平主义者）也可作形容词。"]}
{"word":"pacifistically","summary":{"en":"“Pacifistically” means “in a pacifist (peace-seeking, anti-violence) way.”","zh":"“pacifistically”表示“以和平主义、反对暴力的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that supports peace and opposes war or violence.","zh":"以主张和平、反对战争或暴力的方式；和平主义地。"},"examples":[{"en":"She spoke pacifistically during the debate, urging negotiation instead of force.","zh":"她在辩论中以和平主义的方式发言，呼吁谈判而不是使用武力。"},{"en":"The group pacifistically organized a candlelight vigil for the victims.","zh":"该团体以和平方式组织了为受害者举行的烛光守夜活动。"}]}],"synonyms":["peacefully","nonviolently","without violence","in a pacifist way"],"phonetic":"/ˌpæsəˈfɪstɪkli/","extraExplanation":["词形关系：pacifist（n. 和平主义者）→ pacifism（n. 和平主义）→ pacifistic（adj. 和平主义的）→ pacifistically（adv. 以和平主义方式）。","语气与搭配：pacifistically 常用于描述“说话/主张/行动”的方式（例如 speak/argue/act pacifistically）。写作中也可用 more peacefully、nonviolently 等更常见的副词替换，语感更自然。"]}
{"word":"pacifists","summary":{"en":"Pacifists are people who oppose war and violence and support peace; “pacifist” can also describe peace-supporting beliefs or actions.","zh":"pacifists 指反对战争与暴力、主张和平的人；pacifist 也可作形容词，指和平主义的观点或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes war and violence are wrong and who supports peace instead","zh":"和平主义者；反战者（认为战争与暴力是错误的，主张以和平方式解决冲突的人）"},"examples":[{"en":"Many pacifists marched to protest the war.","zh":"许多和平主义者参加游行，抗议战争。"},{"en":"He is a pacifist and refuses to carry a weapon.","zh":"他是和平主义者，拒绝携带武器。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the belief that war and violence are wrong; supporting peace","zh":"和平主义的；反战的（与“反对战争与暴力、主张和平”这一信念有关的）"},"examples":[{"en":"She gave a pacifist speech about nonviolent change.","zh":"她发表了一次和平主义演讲，谈到用非暴力推动改变。"},{"en":"The group has pacifist values.","zh":"这个团体有和平主义的价值观。"}]}],"synonyms":["peace activist","antiwar protester","nonviolent advocate","peace-loving person"],"phonetic":"/ˈpæsəfɪsts/","extraExplanation":["“pacifists”是复数形式，单数是“pacifist”。","在英语文化语境里，“pacifist”常与“nonviolence（非暴力）”“conscientious objector（出于良心拒服兵役者）”一起出现；但“pacifist”不一定完全等同于“拒服兵役者”，有些和平主义者仍支持非暴力的公共服务或其他方式。"]}
{"word":"pacify","summary":{"en":"Pacify means to calm someone down or to make a tense situation more peaceful and controlled.","zh":"Pacify 指安抚某人使其平静，或缓和紧张局势使其更和平可控。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to calm someone who is angry, upset, or excited; to make them feel peaceful again","zh":"安抚；使平静（让生气、难过或激动的人冷静下来）"},"examples":[{"en":"The mother tried to pacify her crying baby with a lullaby.","zh":"妈妈用摇篮曲安抚哭闹的婴儿。"},{"en":"He offered an apology to pacify his friend after the argument.","zh":"争吵后他道歉来安抚朋友。"},{"en":"The teacher spoke softly to pacify the nervous students before the test.","zh":"考试前老师轻声说话，让紧张的学生平静下来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reduce conflict or violence by making a group or situation calmer and more controlled","zh":"平定；缓和（冲突或暴力，使局势更稳定）"},"examples":[{"en":"The government sent negotiators to pacify the protesters.","zh":"政府派出谈判人员来缓和抗议者的情绪。"},{"en":"Local leaders worked to pacify tensions between the two communities.","zh":"当地领导努力缓和两个社区之间的紧张关系。"}]}],"synonyms":["calm","soothe","appease","placate","mollify"],"phonetic":"/ˈpæsəˌfaɪ/","extraExplanation":["“pacify”来自拉丁语词根，和“peace（和平）”同源，所以核心感觉是“带来平静/和平”。","语气上，“pacify”通常比“calm”更强调“对方原本不安、愤怒或可能引发冲突”，带有“安抚、压下火气”的意味；在政治或历史语境里也可能隐含“以强硬手段‘平定’”的色彩，用时要注意语境。"]}
{"word":"pacifying","summary":{"en":"Pacifying means calming someone or reducing anger or conflict; it can describe soothing behavior or the act of calming.","zh":"Pacifying 指“安抚、使平静”，可形容安抚性的言行，也可指正在安抚他人或平息冲突的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone calmer or less angry; soothing","zh":"使人平静下来、缓和怒气的；安抚的"},"examples":[{"en":"Her pacifying voice helped the children stop crying.","zh":"她安抚的声音帮助孩子们停止哭泣。"},{"en":"He gave a pacifying smile to ease the tension in the room.","zh":"他给了一个安抚性的微笑，缓解房间里的紧张气氛。"}]},{"partOfSpeech":"v.","definition":{"en":"trying to calm someone down or make a situation more peaceful","zh":"（正在）安抚、平息；使局势更和平"},"examples":[{"en":"She is pacifying the customer by offering a refund.","zh":"她通过提供退款来安抚顾客。"},{"en":"The manager spent the morning pacifying angry neighbors.","zh":"经理花了一上午在平息愤怒的邻居情绪。"}]}],"synonyms":["soothing","calming","placating","appeasing","reassuring"],"phonetic":"/ˈpæsəˌfaɪɪŋ/","extraExplanation":["“pacifying”常用来描述语气、态度或行动带来的“降火/安抚”效果。和“appeasing”相比，pacify 更强调让情绪或冲突变得平静；appease 常带有“为了让对方不生气而让步”的意味，有时暗含不情愿或短期的妥协。","在历史或政治语境中，pacify 有时指“平定/绥靖某地区”，可能带有权力压制的色彩；日常口语里更多是温和的“安抚”。"]}
{"word":"pacifyingly","summary":{"en":"“Pacifyingly” means “in a calming, soothing, or tension-reducing way.”","zh":"“pacifyingly”意为“以安抚、平息紧张或情绪的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that calms someone down or reduces anger, fear, or tension.","zh":"以安抚的方式；让人平静下来、缓解愤怒/紧张/恐惧地。"},"examples":[{"en":"She spoke pacifyingly to the child after the loud thunder.","zh":"打雷声很大之后，她用安抚的语气对孩子说话。"},{"en":"He raised his hands pacifyingly to show he didn’t want to argue.","zh":"他举起双手作出安抚的姿势，表示不想争吵。"},{"en":"The manager smiled pacifyingly and promised to fix the mistake.","zh":"经理安抚地笑了笑，并承诺会改正这个错误。"}]}],"synonyms":["calmingly","soothingly","reassuringly","placatingly"],"phonetic":"/ˈpæsəˌfaɪ.ɪŋ.li/","extraExplanation":["“pacifyingly”来自动词“pacify”（使平静、安抚）+ 副词后缀“-ingly”。它常用于描写说话的语气（tone）、表情（smile）、动作（gesture）等，表示“试图让对方冷静下来”。","语体上更偏书面或叙述性写作；日常口语里更常说“in a calming way / soothingly / to calm someone down”。","注意语感：pacifyingly 往往暗示对方正在生气或情绪激动，说话者在“缓和局面”（de-escalate）。在某些情境也可能带一点“敷衍式安抚/息事宁人”的暗示，需看上下文。"]}
{"word":"pacing","summary":{"en":"“Pacing” most commonly means the speed/flow of progress (especially in stories or tasks), and it can also mean walking back and forth nervously.","zh":"“pacing”常指（故事或任务的）推进节奏/速度，也可指因紧张等原因来回踱步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The speed or rate at which something happens or progresses (especially in a story, speech, lesson, or project).","zh":"（事情发展或进行的）速度、节奏（尤指故事、演讲、课程或项目的推进节奏）。"},"examples":[{"en":"The movie’s pacing is slow at the beginning but exciting later.","zh":"这部电影一开始节奏很慢，但后面很精彩。"},{"en":"Good pacing keeps readers interested.","zh":"好的节奏能让读者保持兴趣。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of walking back and forth, often because you feel nervous, impatient, or are thinking deeply.","zh":"来回踱步（常因紧张、不耐烦或在思考）。"},"examples":[{"en":"He was pacing in the hallway while waiting for the call.","zh":"他在走廊里来回踱步，等电话。"},{"en":"Stop pacing and sit down for a moment.","zh":"别来回走了，先坐一会儿。"}]},{"partOfSpeech":"v.","definition":{"en":"Making the speed of something steady or controlled; guiding the rate of progress.","zh":"使速度保持稳定；控制或引导推进速度。"},"examples":[{"en":"She is pacing herself so she doesn’t get tired too early.","zh":"她在控制自己的节奏，避免太早疲劳。"},{"en":"The teacher is pacing the lesson to match the students’ level.","zh":"老师在按学生的水平调整课程进度。"}]}],"synonyms":["tempo","rhythm","rate","speed","flow","stride","walk back and forth","progression"],"phonetic":"/ˈpeɪsɪŋ/","extraExplanation":["“pacing”常和写作/影视一起用，指“节奏控制”：比如信息给得太快会让人跟不上，太慢又会无聊。可以用“tight pacing（紧凑的节奏）/ slow pacing（缓慢的节奏）/ poor pacing（节奏不好）”。","“pacing”也常用于运动：pacing yourself（给自己配速/控制体力）强调不要一开始冲太快，保持可持续的速度。"]}
{"word":"pacinian","summary":{"en":"“Pacinian” means “related to Pacinian corpuscles,” nerve endings that detect pressure and vibration.","zh":"“Pacinian”意为“与帕奇尼小体有关”，帕奇尼小体是感受压力与振动的神经末梢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pacinian corpuscles (large pressure- and vibration-sensing nerve endings in the skin and some internal tissues).","zh":"与帕奇尼小体（皮肤及部分内部组织中感受压力与振动的神经末梢）有关的。"},"examples":[{"en":"Pacinian receptors respond strongly to vibration, such as from a phone buzzing.","zh":"帕奇尼受体对振动反应很强，比如手机的震动。"},{"en":"The textbook describes Pacinian corpuscles as deep pressure sensors.","zh":"教材把帕奇尼小体描述为感受深部压力的感受器。"}]}],"synonyms":["pressure-sensitive","vibration-sensitive","mechanosensory"],"phonetic":"/pəˈsɪniən/","extraExplanation":["“Pacinian”是医学中的“人名作形容词”的用法，来自意大利解剖学家Filippo Pacini（菲利波·帕奇尼）。常见搭配是“Pacinian corpuscle(s)”（帕奇尼小体）或“Pacinian receptor(s)”（帕奇尼受体）。通常首字母大写（Pacinian），但在部分文章中也会见到小写写法。"]}
{"word":"pacinko","summary":{"en":"“Pacinko” usually refers to “pachinko,” a Japanese pinball-like arcade game (and the parlor where it’s played).","zh":"“pacinko”通常指“pachinko（柏青哥）”，一种日本类似弹珠台的街机游戏，也可指玩这种机器的店铺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “pachinko”) a popular Japanese arcade game similar to pinball, where players shoot small steel balls and can win more balls or prizes.","zh":"（通常拼作“pachinko”）日本很常见的一种街机游戏，类似弹珠台；玩家发射小钢珠，可赢得更多钢珠或奖品。"},"examples":[{"en":"He spent an hour playing pachinko near the train station.","zh":"他在车站附近玩了一个小时的柏青哥（pachinko）。"},{"en":"Pachinko parlors are bright and very loud.","zh":"柏青哥店灯光很亮，而且非常吵。"}]},{"partOfSpeech":"n.","definition":{"en":"a place (parlor/arcade) where people play pachinko machines.","zh":"经营柏青哥机器的店铺（柏青哥店/游戏厅）。"},"examples":[{"en":"They walked past a pachinko parlor on their way to dinner.","zh":"他们去吃晚饭的路上经过一家柏青哥店。"}]}],"synonyms":["pachinko","pinball (similar concept)","pachinko parlor"],"phonetic":"/pəˈtʃɪŋkoʊ/","extraExplanation":["“pacinko”多半是对日语外来词“pachinko（パチンコ）”的误拼；英语里标准拼法是 pachinko。","在日本，柏青哥常与“赌博”联想在一起，但通常以“赢钢珠→换奖品→再换现金”等方式运作，法律与社会观感也因此比较复杂。作为旅行或文化话题时，用中性表述更合适。"]}
{"word":"pack","summary":{"en":"“Pack” most often means to put things into a bag or suitcase, but it can also mean to fill something tightly, or a group/set (a pack of wolves, a pack of cards).","zh":"“pack”最常见是“打包/收拾行李”，也可指“塞满/挤满”，或名词“一群/一包（一组）”（如一群狼、一副牌）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put things together into a bag, box, or suitcase for moving or travel","zh":"把东西装进包、箱子等里（为搬运或旅行做准备）"},"examples":[{"en":"I packed my clothes for the trip.","zh":"我把衣服打包好准备旅行。"},{"en":"Please pack your lunch in this container.","zh":"请把午餐装进这个盒子里。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fill a place tightly or crowdedly; to press things close together","zh":"把……塞满；使拥挤；把……紧密挤在一起"},"examples":[{"en":"The fans packed the stadium.","zh":"球迷把体育场挤得水泄不通。"},{"en":"She packed the books tightly into the box.","zh":"她把书紧紧地塞进箱子里。"}]},{"partOfSpeech":"v.","definition":{"en":"to prepare and put your belongings in luggage (for travel); to get ready to leave","zh":"收拾行李；准备离开"},"examples":[{"en":"We need to pack tonight because we leave early tomorrow.","zh":"我们今晚得收拾行李，因为明天一大早就走。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of animals (often dogs or wolves) that live or hunt together; a group of people acting together","zh":"（常指狗或狼的）一群；（也可指）结伙的一群人"},"examples":[{"en":"A pack of wolves crossed the road.","zh":"一群狼穿过了马路。"},{"en":"He ran with a pack that loved trouble.","zh":"他跟一帮爱惹事的人混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"a set of items sold together; a bundle (e.g., a pack of cards, a six-pack)","zh":"（一起出售的）一包/一组（如一副牌、六罐装）"},"examples":[{"en":"She bought a pack of cards.","zh":"她买了一副扑克牌。"},{"en":"I grabbed a six-pack of soda.","zh":"我拿了一组六罐装汽水。"}]},{"partOfSpeech":"n.","definition":{"en":"a backpack or a bag carried on your back","zh":"背包（背在背上的包）"},"examples":[{"en":"He carried a pack with water and snacks.","zh":"他背着一个装有水和零食的背包。"}]}],"synonyms":["bundle","bag","box up","stuff","cram","group"],"phonetic":"/pæk/","extraExplanation":["“pack”很常见、也很“多义”。动词里最核心的感觉是“把东西收拢并装进去”，因此它既可以用于旅行收拾（pack a suitcase），也可以用于“塞满/挤满”（pack the box; pack the stadium）。名词里既可以指“一包/一组商品”（a pack of gum, a pack of cards），也可以指“（动物）一群”（a pack of wolves）。","常见搭配：pack up（把东西收拾好/打包好），pack in（把人/东西塞进狭小空间；也可口语指“停止做某事”），unpack（打开行李/拆包）。"]}
{"word":"packability","summary":{"en":"Packability means how easily something can be packed and carried, especially for travel or outdoor use.","zh":"Packability 指物品是否容易收纳打包、便于携带，常用于旅行或户外装备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"How easy something is to pack, carry, or fit into a bag or suitcase (often because it is light, compact, or foldable).","zh":"（物品的）可收纳性／易打包性：指东西是否容易装进包或行李箱、是否便于携带（通常因为轻便、体积小或可折叠）。"},"examples":[{"en":"This jacket’s packability makes it perfect for travel.","zh":"这件夹克的易打包性很强，非常适合旅行。"},{"en":"I chose a sleeping bag with good packability so it wouldn’t take up much space.","zh":"我选了一个收纳性好的睡袋，这样就不会占太多空间。"},{"en":"For hikers, packability can matter as much as warmth.","zh":"对徒步者来说，收纳性可能和保暖性一样重要。"}]}],"synonyms":["compactness","portability","pack-friendly design"],"phonetic":"/ˌpækəˈbɪləti/","extraExplanation":["“packability”是由动词 pack（打包、装箱）+ 形容词后缀 -able（可……的）+ 名词后缀 -ity（……性）构成，字面意思就是“可被打包的性质”。","这个词在户外装备、旅行用品、电商商品描述中很常见，常与 lightweight（轻量）、compact（紧凑）、foldable（可折叠）、compressible（可压缩）一起出现。"]}
{"word":"packable","summary":{"en":"Packable means easy to pack and carry, especially for travel.","zh":"packable指“便于打包、便于携带”，常用于旅行或户外用品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be packed (put into a bag, box, or suitcase) easily or conveniently, often because it is small, light, or folds well.","zh":"可打包的；便于装箱/装包的（通常因为体积小、重量轻或可折叠）。"},"examples":[{"en":"This jacket is packable and fits in a small pouch.","zh":"这件夹克很便于收纳，可以装进一个小袋子里。"},{"en":"Bring packable snacks for the train ride.","zh":"坐火车时带些便于携带的零食。"},{"en":"She prefers packable shoes when she travels.","zh":"她旅行时更喜欢便于打包的鞋子。"}]}],"synonyms":["easy to pack","travel-friendly","compact","portable","foldable"],"phonetic":"/ˈpækəbəl/","extraExplanation":["“packable”常见于旅行与户外用品的宣传文案（如packable jacket / packable umbrella），强调“省空间、好收纳”。很多时候暗含“可折叠/可压缩（foldable / compressible）”的特点，但并不完全等同。","词形上是 pack（打包）+ -able（“可以……的”），表示“能够被……”。日常口语里也会用 easy to pack / packs well 来表达同样意思。"]}
{"word":"package","summary":{"en":"“Package” most commonly means a parcel to be delivered, and it can also mean a bundled set (a package deal). As a verb, it means to wrap/pack or to present something in a planned, attractive way.","zh":"“package”最常指要递送的包裹，也可指捆绑出售/提供的套餐或套装；作动词时表示打包包装，或把内容/形象“包装”得更有吸引力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wrapped parcel or box containing something to be delivered or sent.","zh":"（要寄送或递送的）包裹；包件。"},"examples":[{"en":"I’m expecting a package from my family this week.","zh":"我这周在等家里寄来的一个包裹。"},{"en":"Please leave the package at the front desk.","zh":"请把包裹放在前台。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of items or services sold or offered together as one unit (often at a better price).","zh":"（作为一个整体出售或提供的）套装；套餐；一揽子服务。"},"examples":[{"en":"The phone comes with a data package.","zh":"这部手机配有一个流量套餐。"},{"en":"We chose a travel package that includes flights and hotels.","zh":"我们选了一个包含机票和酒店的旅行套餐。"}]},{"partOfSpeech":"vt.","definition":{"en":"To wrap or pack something for shipping, storage, or sale.","zh":"把……打包；包装（用于寄送、储存或出售）。"},"examples":[{"en":"They packaged the cookies in small bags.","zh":"他们把饼干包装进小袋子里。"},{"en":"Please package the gift nicely.","zh":"请把礼物好好包装一下。"}]},{"partOfSpeech":"vt.","definition":{"en":"To present or promote something in an attractive, carefully planned way (often about ideas, products, or a public image).","zh":"（用更吸引人的方式）包装、推介（观点/产品/形象等）。"},"examples":[{"en":"The company packaged the new policy as a major improvement.","zh":"公司把这项新政策包装成一次重大改进。"},{"en":"He knows how to package his message for different audiences.","zh":"他很懂得如何针对不同受众来包装自己的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A bundle of related software files distributed and installed together.","zh":"（计算机）软件包；程序包（一起发布与安装的一组相关文件）。"},"examples":[{"en":"Install the package and then restart your computer.","zh":"安装这个软件包，然后重启电脑。"},{"en":"This package includes tools for data analysis.","zh":"这个软件包包含数据分析工具。"}]}],"synonyms":["parcel","bundle","box","shipment","package deal","wrap","pack"],"phonetic":"/ˈpækɪdʒ/","extraExplanation":["“package”既可以指“实体包裹”，也常见于商业语境指“套餐/组合”，还可以作动词表示“打包/包装”。在媒体与公关语境里，“package an idea/message”常带有“把内容包装得更好看、更容易被接受”的意味，有时会隐含“修饰过度”的批评色彩。","词源上与“pack（打包）”相关，核心概念是“把东西整理成一个可携带、可运输、可销售的整体”。因此无论是快递包裹、旅行套餐还是软件包，本质都是“打成一包的一组东西”。"]}
{"word":"packaged","summary":{"en":"“Packaged” most often means “already wrapped and prepared in a package,” and it can also be the past form of “package” meaning “to wrap or bundle for sale or delivery.”","zh":"“packaged”通常表示“已包装好的/预包装的”，也可作“package”的过去式/过去分词，表示“把……包装/打包用于销售或递送”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wrapped and prepared for sale or shipping; already put into a package.","zh":"已包装好的；为了销售或运输而装入包装中的。"},"examples":[{"en":"The cookies come packaged in a reusable tin.","zh":"这些饼干用可重复使用的铁盒包装出售。"},{"en":"Packaged meals can be convenient, but check the nutrition label.","zh":"预包装餐食很方便，但要查看营养标签。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “package”: to wrap, box, or bundle something for sale, storage, or delivery.","zh":"“package”的过去式/过去分词：把……包装、装箱或捆扎起来，用于销售、储存或递送。"},"examples":[{"en":"They packaged the product carefully to prevent damage.","zh":"他们把产品仔细包装以防损坏。"},{"en":"The company packaged the app with extra features for premium users.","zh":"公司把这款应用与额外功能打包，提供给高级用户。"}]}],"synonyms":["prepackaged","wrapped","boxed","sealed","bundled"],"phonetic":"/ˈpækɪdʒd/","extraExplanation":["“packaged”在日常英语里很常见，尤其用于食品、药品、日用品等语境；有时也引申为“以某种方式呈现/包装”（比如把一个想法或产品“包装成”更容易被接受的样子）。","在软件语境里，package 可以指“打包/封装”（把多个组件放在一起发布），所以 packaged app/features 常表示“捆绑发布的应用/功能”。"]}
{"word":"packager","summary":{"en":"A packager is a person/company/machine that packages products, or (in computing) someone/something that prepares software for distribution.","zh":"packager 指负责给商品做包装的个人/公司/机器；在计算机领域也指把软件整理打包并发行的人或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, company, or machine that puts products into packages (boxes, bottles, wrappers) for sale or shipping","zh":"把商品装入包装（盒子、瓶子、包装纸等）以便销售或运输的人、公司或机器（包装者/包装商）"},"examples":[{"en":"The food packager seals each bag to keep the chips fresh.","zh":"食品包装机把每一袋封口，以保持薯片新鲜。"},{"en":"We hired a local packager to box and label the candles for our online shop.","zh":"我们雇了一家本地包装商，为网店把蜡烛装盒并贴标签。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) someone or something that prepares software to be distributed as an installable package (for example, for Linux or an app store)","zh":"（计算机）把软件整理并打包成可安装发行包的人或工具（如 Linux 发行版或应用商店的安装包）"},"examples":[{"en":"The packager updated the app to include the new security patch.","zh":"打包维护者更新了应用，把新的安全补丁包含进去。"},{"en":"On Linux, a packager may create and maintain the package for a specific distribution.","zh":"在 Linux 上，打包者可能为某个发行版制作并维护软件包。"}]}],"synonyms":["packaging company","packer","packaging contractor","software packager","package maintainer"],"phonetic":"/ˈpækɪdʒɚ/","extraExplanation":["“packager”来自动词 package（打包、包装）+ -er（表示“做某事的人/物”）。在商业语境里常指“包装商/代工包装公司”；在软件语境里常指“软件打包维护者”（把源码整理成可安装的发行包，并负责版本更新与依赖关系）。","常见搭配：contract packager（代工包装商）、food/cosmetic packager（食品/化妆品包装商）、package maintainer（软件包维护者，含义接近）。"]}
{"word":"packagers","summary":{"en":"“Packagers” are people/companies that package products, or (in software) those who prepare software packages for distribution.","zh":"“packagers”指负责包装商品的人/公司；在软件领域也指负责制作与维护软件安装包/发行包的人或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that put products into packages for sale, shipping, or storage.","zh":"为销售、运输或储存而将产品进行包装的人或公司（包装商）。"},"examples":[{"en":"The packagers labeled each box with the destination address.","zh":"包装人员在每个箱子上贴上目的地地址标签。"},{"en":"Food packagers must follow strict hygiene rules.","zh":"食品包装商必须遵守严格的卫生规定。"}]},{"partOfSpeech":"n.","definition":{"en":"(Software) People or tools that prepare software to be distributed and installed (for example, building installers or distribution packages).","zh":"（软件）将软件整理、打包并用于发布与安装的人或工具（例如制作安装包或发行版软件包）。"},"examples":[{"en":"The Linux packagers updated the app to the newest version.","zh":"Linux 的打包维护者把这个应用更新到了最新版本。"},{"en":"Please report the bug to the packagers, not just the upstream developers.","zh":"请把这个漏洞报告给打包维护者，而不只是上游开发者。"}]}],"synonyms":["packers","packaging companies","packaging workers","(software) package maintainers","(software) builders"],"phonetic":"/ˈpækɪdʒɚ/","extraExplanation":["“packager”来自动词 pack（打包、装箱）+ 后缀 -er（表示“做某事的人/物”）。因此 packagers 通常指“负责打包的人/机构”。","在软件语境里，packagers 常指发行版/平台的“打包维护者”（例如把上游源码做成可安装的软件包、处理依赖、写安装脚本）。与 upstream developers（上游开发者）不同，他们更关注“分发与安装体验”。"]}
{"word":"packages","summary":{"en":"“Packages” usually means multiple parcels/boxes, or bundles such as service/benefit deals; it can also relate to software sets. As a verb, it means to wrap/box something or to present an idea attractively.","zh":"“packages” 通常指多个包裹/包裹箱，也可指成套方案（如服务、福利、优惠），还可指软件套件。作动词时表示包装装箱，或把观点/形象加以“包装”呈现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wrapped and sealed parcel or box that is sent or delivered.","zh":"（可寄送或递送的）包裹，包裹箱。"},"examples":[{"en":"I have two packages waiting at the front desk.","zh":"前台有两个包裹在等我领取。"},{"en":"Please check the package for damage before you sign.","zh":"签收前请先检查包裹是否有破损。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of things offered together as one unit; a bundle (often of services, benefits, or deals).","zh":"（作为一个整体出售或提供的）一套，一揽子（服务/福利/优惠等）。"},"examples":[{"en":"The job comes with a great benefits package.","zh":"这份工作有很好的福利待遇。"},{"en":"We chose the travel package that includes flights and a hotel.","zh":"我们选了包含机票和酒店的旅行套餐。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of related software programs sold or installed together.","zh":"（软件）套件，软件包。"},"examples":[{"en":"Install the security package to protect your computer.","zh":"安装安全软件套件来保护你的电脑。"},{"en":"This package includes a word processor and a spreadsheet app.","zh":"这个软件包包含文字处理和表格应用。"}]},{"partOfSpeech":"vt.","definition":{"en":"To wrap or put something into a box or container for transport, storage, or sale.","zh":"把……包装（装箱/装袋），打包。"},"examples":[{"en":"They packaged the glass carefully to prevent breaking.","zh":"他们小心地把玻璃制品包装好以免破碎。"},{"en":"The company packages the product in recyclable materials.","zh":"公司用可回收材料来包装产品。"}]},{"partOfSpeech":"vt.","definition":{"en":"To present something in an attractive or simplified way (especially an idea, image, or message).","zh":"（以更吸引人或更易懂的方式）包装、呈现（观点/形象/信息等）。"},"examples":[{"en":"The ad packages the same old idea as something new.","zh":"这则广告把老观点包装成新东西。"},{"en":"She packaged her proposal clearly for the meeting.","zh":"她把提案整理得很清晰，用于会议呈现。"}]}],"synonyms":["parcels","boxes","bundles","kits","sets","software suite","wrap","box up","bundle","present"],"phonetic":"/ˈpækɪdʒ/","extraExplanation":["“packages” 通常是名词复数（多个包裹/多套方案）或动词第三人称单数（He/She packages...）。在电商语境里，package≈parcel（包裹）；在职场语境里，package 常指“薪酬福利组合”（compensation/benefits package）。"]}
{"word":"packaging","summary":{"en":"Packaging usually means the materials and design used to wrap/protect a product; it can also mean the packaging industry or a (sometimes negative) way of making something look better than it is.","zh":"Packaging 通常指用于包裹与保护商品的包装材料和设计；也可指包装行业，或（常带贬义）对事物进行“美化包装”的方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Materials and design used to wrap and protect a product, and often to present/market it (boxes, bottles, labels, etc.).","zh":"（商品的）包装；用于包裹、保护产品并常用于展示/营销的材料与设计（如盒子、瓶子、标签等）。"},"examples":[{"en":"The packaging protects the cookies so they don’t break.","zh":"包装保护饼干，让它们不容易碎。"},{"en":"We changed the packaging to make the brand look more modern.","zh":"我们更换了包装，让品牌看起来更现代。"},{"en":"This product uses recyclable packaging.","zh":"这款产品使用可回收包装。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity or industry of designing and producing packages for goods.","zh":"包装业；为商品设计与制作包装的工作/行业。"},"examples":[{"en":"She works in packaging for a cosmetics company.","zh":"她在一家化妆品公司做包装相关工作。"},{"en":"Packaging costs went up because of higher paper prices.","zh":"由于纸价上涨，包装成本提高了。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of presenting something so it seems more attractive than it really is (often negative).","zh":"（常含贬义）用“漂亮的包装/说法”来美化或掩饰真实情况；包装。"},"examples":[{"en":"It’s just clever packaging—the plan still has serious problems.","zh":"这只是巧妙的包装——这个计划仍然有严重问题。"},{"en":"Don’t be fooled by the packaging; read the ingredients.","zh":"别被包装迷惑；要看成分表。"}]}],"synonyms":["packing","package","wrapping","presentation"],"phonetic":"/ˈpækɪdʒɪŋ/","extraExplanation":["在日常英语里，packaging 多用作不可数名词（the packaging is…），表示“包装整体”；但也可以作可数名词，尤其在商业语境中指“包装方案/包装形式”（e.g., different packagings for different markets）。","常见搭配：eco-friendly/recyclable/sustainable packaging（环保/可回收/可持续包装），excessive packaging（过度包装），packaging design（包装设计），outer/inner packaging（外包装/内包装）。"]}
{"word":"packagings","summary":{"en":"“Packagings” means multiple packages/packaging types—materials or designs used to protect and present products.","zh":"“Packagings”指多种包装（材料或设计/类型），用于保护并展示商品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Materials or containers used to wrap, protect, and present products (plural of “packaging”).","zh":"（“packaging”的复数）包装材料或包装容器，用于包裹、保护并展示商品。"},"examples":[{"en":"The store is switching to eco-friendly packagings to reduce plastic waste.","zh":"这家店正在改用更环保的包装，以减少塑料垃圾。"},{"en":"Different packagings are used for glass bottles and for canned drinks.","zh":"玻璃瓶和罐装饮料会使用不同的包装。"}]},{"partOfSpeech":"n.","definition":{"en":"Different packaging designs or types considered as separate options (often in business/marketing contexts).","zh":"（多用于商业/营销语境）不同的包装设计或包装类型，被当作多个方案来讨论。"},"examples":[{"en":"The team compared three packagings to see which one looked most premium.","zh":"团队比较了三种包装，看哪一种更显高端。"},{"en":"We tested several packagings for shelf impact and customer appeal.","zh":"我们测试了多种包装，以评估货架吸引力和顾客好感度。"}]}],"synonyms":["types of packaging","packaging options","packages","wrappings","containers"],"phonetic":"ˈpækɪdʒɪŋz","extraExplanation":["“Packaging”通常是不可数名词（the packaging was damaged）。在商务写作或需要强调“不同种类/不同方案”时，才较常见复数“packagings”。日常英语里也常用“packages / packaging options / types of packaging”来表达同样意思。"]}
{"word":"packall","summary":{"en":"“Pack all” means to pack everything, or (as a command) to gather all belongings and leave.","zh":"“pack all”表示“把所有东西都打包”，也可作命令用法，表示“把东西都收拾好并离开”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to put all items into bags, boxes, or a suitcase so they can be moved or stored","zh":"把所有东西都打包（装进行李箱、袋子或箱子里），以便搬运或存放"},"examples":[{"en":"We need to pack all our clothes before tomorrow morning.","zh":"我们得在明天早上之前把所有衣服都打包好。"},{"en":"Please pack all the documents in one box.","zh":"请把所有文件装进一个箱子里。"}]},{"partOfSpeech":"phrase","definition":{"en":"(imperative) used to tell someone to gather everything and leave, often in an emotional or urgent situation","zh":"（祈使句）让某人把东西都收拾好并离开，常带有情绪或紧迫感"},"examples":[{"en":"Pack all your things and come with me.","zh":"把你的东西都收拾好，跟我走。"},{"en":"After the argument, he told her to pack all and move out.","zh":"争吵之后，他让她把东西都收拾好搬出去。"}]}],"synonyms":["pack everything","pack up everything","box up everything","gather all your things"],"phonetic":"/pæk ɔl/","extraExplanation":["“pack all”更常见的写法是分开写作“pack all”，而不是连写“packall”。在日常英语里，它通常就是动词pack（打包）+ all（全部）。","如果想表达“收拾好所有东西（然后离开）”，也常用更口语的说法：“pack up everything”或“pack up all your things”。"]}
{"word":"packboard","summary":{"en":"A stiff board used inside a package to support and protect items during shipping.","zh":"放在包裹内用于支撑与防护的硬质衬板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A board used to provide a stiff back or support in a package or wrapped item, so it keeps its shape during shipping or storage.","zh":"（包装用）衬板；硬纸板/背板：用于在包裹或捆扎物中提供硬挺支撑，使其在运输或存放时保持形状。"},"examples":[{"en":"The poster was shipped with a packboard to keep it from bending.","zh":"海报寄送时夹了一块packboard（衬板）以防弯折。"},{"en":"Add a packboard behind the fabric so the package stays flat.","zh":"在布料后面加一块packboard（衬板），让包裹保持平整。"}]}],"synonyms":["backing board","cardboard insert","stiffener","support board"],"phonetic":"/ˈpækˌbɔrd/","extraExplanation":["这个词在现代日常英语里不算常见；更常见的说法是 backing board / cardboard insert / stiffener（衬板/硬纸板内衬/加硬片）。在一些行业语境（包装、印刷品寄送、仓储）里仍可能见到 packboard。","注意不要和 packboard（外出背负用的背板/背架，常见于“packboard frame”）混淆；是否指“包装衬板”还是“背负背架”，通常要看上下文（shipping/package vs. hiking/gear）。"]}
{"word":"packbuilder","summary":{"en":"A packbuilder is a person or (more often) a tool that builds a bundled “pack,” especially a software package or installer.","zh":"packbuilder 指打包者或（更常见）打包工具，用来生成“打包后的集合”，尤其是软件包或安装包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or tool that creates a pack (a bundled set of items), especially in computing where it builds software packages or installers","zh":"打包者；打包工具（尤指在计算机领域用于生成软件包或安装包的工具）"},"examples":[{"en":"We use a packbuilder to generate the installer for each release.","zh":"我们用一个打包工具为每次发布生成安装包。"},{"en":"The packbuilder failed because a required file was missing.","zh":"打包工具失败了，因为缺少一个必需文件。"}]}],"synonyms":["package builder","build tool","packaging tool","installer builder"],"phonetic":"/ˈpækˌbɪldɚ/","extraExplanation":["“packbuilder”不是最常见的标准词典词条，更常见的写法可能是 **pack builder**（分开写）或具体工具名（如 build tool / package builder）。在软件语境里，它通常指“把文件、依赖和元数据整理并输出为可分发格式”的程序。","如果你在某个项目中看到 Packbuilder/PackBuilder 作为专有名词（产品名、模块名或类名），含义可能更具体，最好结合该项目的文档或上下文确认。"]}
{"word":"packcloth","summary":{"en":"Packcloth is a tough cloth used to wrap or bag goods for packing and transport.","zh":"Packcloth 指用于打包、包裹或装载货物的结实粗厚布料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, coarse fabric used for making sacks, wrapping goods, or covering packages (often heavy cotton or linen)","zh":"包布；包装用粗厚布（常为厚棉布或亚麻布，用于做麻袋、包裹货物或覆盖包装）"},"examples":[{"en":"The tools were wrapped in packcloth to protect them during shipping.","zh":"这些工具用包布包起来，以便运输时保护它们。"},{"en":"Older warehouses stored grain in packcloth sacks.","zh":"一些老仓库会用包布麻袋来存放谷物。"}]}],"synonyms":["canvas","burlap","sacking","heavy cloth"],"phonetic":"/ˈpækˌklɔθ/","extraExplanation":["“packcloth”是较偏旧式或行业用语，常见于航运、仓储、军需或历史语境中，指用于“打包/包裹（pack）”的结实布料。现代日常英语里更常用的说法是“canvas,” “sacking,” “burlap,” 或直接说“heavy cloth for packing”。"]}
{"word":"packed","summary":{"en":"Packed means crowded or very full, and it can also be the past form of “pack” (to put things into a bag/box).","zh":"Packed 可表示“拥挤的/挤满的、充满的”，也可作 pack 的过去式/过去分词，表示“打包、收拾”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"crowded; very full of people or things","zh":"拥挤的；挤满人或物的"},"examples":[{"en":"The train was packed during rush hour.","zh":"高峰期时火车里挤得满满的。"},{"en":"The auditorium was packed with fans.","zh":"礼堂里挤满了粉丝。"}]},{"partOfSpeech":"adj.","definition":{"en":"full of something; containing a lot of something","zh":"充满……的；含有大量……的"},"examples":[{"en":"This snack is packed with protein.","zh":"这款零食富含蛋白质。"},{"en":"Her schedule is packed this week.","zh":"她这周的日程排得很满。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “pack”: to put things into a bag or box for travel, storage, or sending","zh":"“pack”的过去式/过去分词：把物品装进包、箱子里以便旅行、存放或寄送"},"examples":[{"en":"I packed my suitcase the night before the trip.","zh":"旅行前一晚我把行李箱收拾好了。"},{"en":"The books were packed carefully to avoid damage.","zh":"这些书被仔细打包以避免损坏。"}]}],"synonyms":["crowded","crammed","full","jammed","stuffed"],"phonetic":"/pækt/","extraExplanation":["“packed”很常见的搭配有：a packed house（满座/爆满的观众席）、a packed lunch（事先装好的午餐便当）、packed schedule（排满的日程）。","口语里 “I’m packed today.” 表示“我今天安排得满满的/忙不过来”。注意与 “busy” 相近，但 “packed” 更强调“塞得满、几乎没有空档”。"]}
{"word":"packer","summary":{"en":"A packer is someone (or a machine) that packs goods or belongings.","zh":"packer 指为货物或行李打包的人（或打包/装填的机器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that packs goods for shipping, storage, or sale","zh":"（为运输、储存或销售）打包货物的人；包装商"},"examples":[{"en":"The packer wrapped each glass bottle in bubble wrap.","zh":"包装工把每个玻璃瓶都用气泡膜包好。"},{"en":"We hired a professional packer to prepare the furniture for moving.","zh":"我们雇了专业打包人员来为搬家准备家具。"}]},{"partOfSpeech":"n.","definition":{"en":"a machine that packs, compresses, or stuffs material into a container or space","zh":"打包机；装填机；压实机"},"examples":[{"en":"The factory uses an automatic packer to fill bags of rice.","zh":"工厂使用自动装袋机来装米。"},{"en":"A hydraulic packer compressed the waste into tight blocks.","zh":"液压打包机把废料压成紧实的块。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who packs their belongings, especially for travel or a move","zh":"（尤指为旅行或搬家）收拾行李的人"},"examples":[{"en":"I’m a light packer—I only bring one small bag.","zh":"我行李带得很少——只带一个小包。"},{"en":"He’s a last-minute packer and always forgets something.","zh":"他总是临出发才收拾行李，所以总会忘带东西。"}]}],"synonyms":["packager","wrapper","packer machine","bagger","shipper"],"phonetic":"/ˈpækɚ/","extraExplanation":["在美国文化里，“the Packers”常指NFL球队“Green Bay Packers（绿湾包装工队）”。队名来自当地早期的肉类包装业（meatpacking），所以它既是体育名词，也带有地方产业历史的背景。"]}
{"word":"packeries","summary":{"en":"“Packeries” (rare) means packing houses/places where goods are packed; it’s the plural of “packery.”","zh":"“packeries”（较少见）指包装厂/打包场所，是“packery”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “packery”: a place where goods (especially food) are packed for shipping; a packing house/packing plant (rare).","zh":"“packery”的复数：指用于把货物（尤指食品）包装后运送的地方；包装厂/加工包装车间（较少见用法）。"},"examples":[{"en":"The fish were cleaned and boxed at nearby packeries before being sent to market.","zh":"这些鱼在附近的包装厂清洗并装箱后，再运往市场。"},{"en":"Older reports mention packeries along the river where produce was packed for export.","zh":"一些较早的报告提到河边有包装厂，把农产品打包后出口。"}]}],"synonyms":["packing houses","packing plants","packing facilities","packing sheds"],"phonetic":"/ˈpækəriz/","extraExplanation":["“packery / packeries”在现代英语中不算常用词；很多时候更常见的说法是“packing house / packing plant”，或者直接用“packers”（负责包装的人/公司）。","如果你本来想表达“包装工人/打包的人”，更自然的复数通常是“packers”。","拼写上，“packery”的复数规则是把 -y 变成 -ies → “packeries”。"]}
{"word":"packers","summary":{"en":"“Packers” usually means people/companies that pack items for shipping; it can also refer to the NFL team, the Green Bay Packers.","zh":"“packers”通常指打包/包装货物的人或公司；也可特指NFL球队“绿湾包装工队”（Green Bay Packers）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that pack goods into boxes, bags, or containers, especially for shipping or storage.","zh":"打包工人；包装公司（把货物装箱/装袋以便运输或储存的人或机构）。"},"examples":[{"en":"The movers and packers finished boxing up the dishes by noon.","zh":"搬家公司和打包人员在中午前把餐具都装箱好了。"},{"en":"We hired professional packers to prepare everything for the overseas move.","zh":"我们请了专业打包人员来准备海外搬家的所有东西。"}]},{"partOfSpeech":"n.","definition":{"en":"A sports team name, especially the Green Bay Packers (an NFL team in the United States).","zh":"球队名称，尤其指美国国家橄榄球联盟（NFL）的“绿湾包装工队”（Green Bay Packers）。"},"examples":[{"en":"My uncle is a lifelong Packers fan.","zh":"我叔叔是铁杆包装工队球迷。"},{"en":"The Packers play their home games in Green Bay, Wisconsin.","zh":"包装工队在威斯康星州的绿湾进行主场比赛。"}]}],"synonyms":["packagers","wrappers","packaging workers","the Green Bay Packers"],"phonetic":"/ˈpækərz/","extraExplanation":["在美国文化里，“the Packers”常特指NFL球队 Green Bay Packers（绿湾包装工队）。队名源自当地早期的肉类包装/罐头加工产业（packing industry），所以和“包装工人”这个普通含义有关联。"]}
{"word":"packery","summary":{"en":"“Packery” is a rare word meaning deceit or trickery, often in older or Scots usage.","zh":"“packery”是个较少见的词，意思是欺骗或耍花招，多见于较旧用法或苏格兰英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"deceitful behavior; trickery (rare; chiefly Scots/older usage).","zh":"欺骗行为；诡计（较少见；多见于苏格兰英语/较旧用法）。"},"examples":[{"en":"He was known for his packery, so people double-checked every deal.","zh":"他以耍花招出名，所以人们每笔交易都会再三核对。"},{"en":"The villagers refused to be drawn into the packery of the false salesman.","zh":"村民们拒绝被那个骗子推销员的诡计牵着走。"}]},{"partOfSpeech":"n.","definition":{"en":"dishonest or sneaky tactics used to get an advantage.","zh":"为占便宜而使用的不正当、偷偷摸摸的手段。"},"examples":[{"en":"No packery—tell me the real price.","zh":"别耍花招——告诉我真实价格。"},{"en":"The coach warned the team against packery on the field.","zh":"教练告诫队员不要在场上使阴招。"}]}],"synonyms":["trickery","deceit","fraud","deception","dishonesty"],"phonetic":"/ˈpækəri/","extraExplanation":["“packery”在现代标准英语里非常少见，更常见的近义词是“trickery / deceit / fraud”。","这个词在苏格兰英语和较旧的英语文本中更可能出现，语气通常带有批评或不信任。","如果你是在科技/排版领域看到“Packery”，也可能是专有名词（例如某些布局/前端库或产品名），那就不是上述词义。"]}
{"word":"packet","summary":{"en":"Packet usually means a small package or a small measured bag (like sugar), and in technology it means a unit of data sent over a network.","zh":"packet 常指“小包裹/小袋（定量装的东西，如糖包）”，在科技语境中指“数据包”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small package or bundle, often wrapped and easy to carry.","zh":"小包裹；小捆（通常包好、便于携带）。"},"examples":[{"en":"She put a packet of letters into her bag.","zh":"她把一小包信件放进了包里。"},{"en":"Please open the packet carefully.","zh":"请小心打开这个小包裹。"}]},{"partOfSpeech":"n.","definition":{"en":"A small paper or plastic container holding a measured amount of something (often food or medicine).","zh":"小袋；小包（装有定量的食物、药品等）。"},"examples":[{"en":"Add a packet of sugar to the tea.","zh":"在茶里加一小包糖。"},{"en":"He took a packet of instant noodles from the cupboard.","zh":"他从橱柜里拿出一包方便面。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing and networking, a unit of data sent over a network.","zh":"（计算机/网络）数据包（在网络中传输的数据单位）。"},"examples":[{"en":"The router sends the packet to the correct address.","zh":"路由器把数据包发送到正确的地址。"},{"en":"Some packets were lost during the video call.","zh":"视频通话过程中有一些数据包丢失了。"}]}],"synonyms":["package","bundle","sachet","bag","data packet"],"phonetic":"/ˈpækɪt/","extraExplanation":["在英式与美式用法中，packet 都很常见：日常生活里多指“小包/小袋”（如 sugar packet），在技术语境中几乎固定指“数据包（packet）”。如果你想表达更正式的“包裹（邮寄）”，美式英语里也常用 package/parcel（parcel 更偏英式）。"]}
{"word":"packeted","summary":{"en":"“Packeted” usually means divided into packets (especially data packets), or put into small packets for sale/storage.","zh":"“Packeted”通常指（尤指网络数据）被分成数据包，或指被装入小袋/小包中用于售卖或保存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of data or a signal) divided into small units called packets, especially for sending over a network.","zh":"（数据或信号）被分割成称为“数据包/分组（packet）”的小单元，尤指用于网络传输。"},"examples":[{"en":"The video stream is packeted before it is sent over the internet.","zh":"视频流在通过互联网发送前会被分组（打成数据包）。"},{"en":"Packeted data can arrive out of order and still be reassembled correctly.","zh":"分组后的数据可能会乱序到达，但仍然可以被正确重组。"}]},{"partOfSpeech":"adj.","definition":{"en":"put into a packet (a small paper or plastic container), often for sale or storage.","zh":"被装入小袋/小包（packet）中，常用于售卖或保存。"},"examples":[{"en":"The seeds are packeted and labeled by variety.","zh":"这些种子被装进小袋并按品种贴好标签。"},{"en":"They bought packeted soup for a quick dinner.","zh":"他们买了袋装速食汤做一顿快捷晚餐。"}]},{"partOfSpeech":"adj.","definition":{"en":"having pockets (rare; mainly descriptive).","zh":"有口袋的（较少见，多用于描写）。"},"examples":[{"en":"He wore a packeted vest to carry small tools.","zh":"他穿了一件带口袋的马甲来装小工具。"}]}],"synonyms":["packetized","packaged","bagged","boxed"],"phonetic":"/ˈpækɪtɪd/","extraExplanation":["“packeted”在科技语境里最常见，来自名词packet（数据包）。与之相关的常见词有：packet switching（分组交换）、packet loss（丢包）、packet capture/sniffing（抓包/嗅探）。","日常生活中更常用的搭配通常是“packaged/packed”，而不是“packeted”。比如食品更常说 packaged soup（包装汤料）或 packet soup（英式：袋装汤料）。"]}
{"word":"packeting","summary":{"en":"“Packeting” means putting things into small packets (packaging/portioning), or—especially in networking—splitting data into packets for transmission.","zh":"“packeting”指把东西分装成小包（小包装/分份）；在网络语境中也指把数据切分成数据包以便传输。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of putting something into packets (small packages), or dividing something into separate packets for handling, shipping, or selling.","zh":"把东西装进小包装（小包裹）里；或把某物分成若干“包/份”以便处理、运输或销售的过程。"},"examples":[{"en":"The factory improved packeting to reduce damage during shipping.","zh":"工厂改进了小包装流程，以减少运输过程中的破损。"},{"en":"Packeting the samples separately helps prevent contamination.","zh":"把样品分别分装成小包有助于防止污染。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing and telecommunications, the act or process of breaking data into packets for transmission across a network.","zh":"（计算机/通信）把数据切分成“数据包（packet）”以便在网络中传输的过程。"},"examples":[{"en":"Packeting allows large files to travel efficiently over the internet.","zh":"数据包化使大文件能够更高效地通过互联网传输。"},{"en":"Network delays can happen during packeting and reassembly.","zh":"在数据包化和重新组装过程中可能会出现网络延迟。"}]}],"synonyms":["packaging","portioning","repackaging","packetization"],"phonetic":"/ˈpækətɪŋ/","extraExplanation":["“packeting”来自“packet（小包；数据包）+ -ing”。在日常商业语境里，它更常指“分装/小包装”；在技术语境里常说“packetization（数据包化）”，但“packeting”也能被理解为同一概念。","在包装行业中常见的更地道说法还有：“packaging（包装，泛指）”“repackaging（重新包装）”“portioning（分份/分装）”。在网络领域更常见：“packetization（数据包化）”“encapsulation（封装）”。"]}
{"word":"packets","summary":{"en":"“Packets” is the plural of “packet”: small packages, sets of materials, or (in computing) units of data sent over a network.","zh":"“Packets”是“packet”的复数：可指小包装/小袋、成套资料/文件包，也可指（计算机）网络传输的数据包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small package or bundle, often used for a product that is sold or given in a measured amount (e.g., sugar, sauce, seeds).","zh":"小包；小袋（常指按固定量包装或分发的商品，如糖包、调味酱包、种子包）。"},"examples":[{"en":"Could I have two packets of sugar for my coffee?","zh":"我可以要两包糖放进咖啡里吗？"},{"en":"The ketchup packets are on the counter.","zh":"番茄酱小包在柜台上。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) a unit of data sent over a network, usually as part of a larger message.","zh":"（计算机）数据包（网络中传输的数据单位，通常是更大信息的一部分）。"},"examples":[{"en":"The video keeps freezing because some packets are getting lost.","zh":"视频一直卡住，因为有些数据包丢失了。"},{"en":"The app sends packets to the server every few seconds.","zh":"这个应用每隔几秒就会向服务器发送数据包。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of documents or materials grouped together for someone to use (e.g., an information packet).","zh":"资料包；文件包（为某人准备的一组文件或材料）。"},"examples":[{"en":"New students receive packets with campus maps and rules.","zh":"新生会收到包含校园地图和规定的资料包。"},{"en":"Please read the packets before the meeting.","zh":"请在开会前阅读这些资料。"}]}],"synonyms":["small packages","sachets","bundles","data packets","info packs"],"phonetic":"/ˈpækɪt/","extraExplanation":["“packets”是“packet”的复数形式。口语里常说“a packet of + 名词”（英式也常用），美式中“a packet of sugar”也很常见。","在网络语境里，“packet loss（丢包）”“packet delay（包延迟）”等搭配非常常见；这里的packet通常不可直接对应“包裹”，更像“数据的一小段”。"]}
{"word":"packhorse","summary":{"en":"A packhorse is a horse used to carry loads; figuratively, it can mean a person who does most of the heavy work.","zh":"packhorse 指驮马；也可比喻承担大部分辛苦工作、负担过重的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A horse (or other animal) used to carry heavy loads, especially supplies, on its back.","zh":"驮马；（尤指）用来背负重物、运输补给的马（或其他驮畜）。"},"examples":[{"en":"They hired a packhorse to carry food and tents into the mountains.","zh":"他们雇了一匹驮马把食物和帐篷运进山里。"},{"en":"In the past, packhorses moved salt and wool along narrow village roads.","zh":"过去，驮马在狭窄的乡村道路上运输盐和羊毛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A person who does a lot of hard work, carrying more than their fair share.","zh":"（比喻）做苦工的人；承担大量辛苦工作、负担过重的人。"},"examples":[{"en":"At the office, she’s the packhorse who keeps projects moving.","zh":"在办公室里，她就像“驮马”一样把项目一直推进下去。"},{"en":"Don’t let one teammate become the packhorse for the whole group.","zh":"别让某个队友成了全组的“驮马”。"}]}],"synonyms":["pack animal","burden horse","workhorse","beast of burden"],"phonetic":"/ˈpækˌhɔrs/","extraExplanation":["“packhorse”由pack（包裹、驮载）+ horse（马）组成，常见于英国乡村和山地运输的历史语境；在道路狭窄、车辆难以通行的年代，驮马队曾是重要的物流方式。","比喻义常用于描述“承担主要体力或事务性工作的人”，语气多为中性到略带同情；如果用于批评分工不公，也可能带点不满。"]}
{"word":"packhorses","summary":{"en":"Packhorses are horses that carry loads; figuratively, they are hard-working people or things that bear heavy responsibilities.","zh":"packhorses 指驮运货物的马；也可比喻承担重任、特别能干的“主力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a horse used for carrying heavy loads (goods or supplies), especially in places where vehicles cannot easily travel","zh":"驮马；运货马（尤指车辆难以通行的地方，用来驮运货物或补给）"},"examples":[{"en":"Before roads were built, packhorses carried salt and wool over the mountains.","zh":"在修建道路之前，驮马把盐和羊毛运过群山。"},{"en":"The hikers hired two packhorses to carry tents and food.","zh":"徒步者雇了两匹驮马来驮帐篷和食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a person or thing that does a lot of hard work and carries much of the burden","zh":"（比喻）苦干的人；承担重任的“主力”"},"examples":[{"en":"She became the packhorse of the team, handling most of the tasks.","zh":"她成了团队的“主力”，承担了大部分任务。"}]}],"synonyms":["packhorse","pack horse","beast of burden","workhorse","packer"],"phonetic":"/ˈpækˌhɔrs/","extraExplanation":["“packhorse”由 pack（包裹、负载）+ horse（马）构成，历史上常用于“packhorse trails（驮马道）”与“pack trains（驮队）”。在英国北部等地区，驮马曾是运输盐、矿石、羊毛等货物的重要方式。现代英语里也常用作比喻，接近 workhorse（干活主力）。"]}
{"word":"packhouse","summary":{"en":"A packhouse is a facility where products—especially fresh produce—are sorted and packed for shipping.","zh":"packhouse 指进行分拣并包装发运的设施，尤用于水果蔬菜等农产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building or facility where goods—especially farm produce like fruit and vegetables—are sorted, cleaned, graded, and packed for shipping","zh":"包装厂；（尤指农产品的）分拣、清洗、分级并装箱发运的加工与包装设施"},"examples":[{"en":"The apples are washed and packed in the packhouse before they are shipped overseas.","zh":"苹果在包装厂清洗并装箱后，再出口运输。"},{"en":"Workers in the packhouse check each mango for bruises and quality.","zh":"包装厂的工人会检查每个芒果是否有磕碰并评估品质。"}]},{"partOfSpeech":"n.","definition":{"en":"a facility where meat or seafood is prepared and packed for sale (less common; often called a packing plant)","zh":"（较少用）肉类/海鲜加工包装厂（更常说 packing plant）"},"examples":[{"en":"The company runs a small packhouse for preparing and packing seafood products.","zh":"这家公司经营一家小型海鲜加工包装厂。"}]}],"synonyms":["packinghouse","packing facility","packing plant","packaging plant"],"phonetic":"/ˈpækˌhaʊs/","extraExplanation":["“packhouse”在农业供应链里很常见，常与“orchard（果园）/farm（农场）”“cold storage（冷库）”“export（出口）”等词一起出现。","在美式英语里也常见拼写“packinghouse”，尤其在历史语境中（如芝加哥早期肉类加工行业）。现代商业语境中，“packing plant”或“packing facility”也很常用。"]}
{"word":"packing","summary":{"en":"“Packing” usually means putting items into a suitcase/box, or the protective materials inside a package; it can also be the -ing form of “pack.”","zh":"“packing”通常指把东西装进行李箱/箱子里（打包、收拾），也可指包装内的防护填充物；还可以是动词 pack 的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of putting things into a bag, box, or suitcase, especially for travel or shipping","zh":"打包；装箱；（尤指旅行前）收拾行李"},"examples":[{"en":"I finished my packing the night before the flight.","zh":"我在航班前一晚收拾完行李。"},{"en":"Packing for a long trip takes time.","zh":"为长途旅行打包很花时间。"}]},{"partOfSpeech":"n.","definition":{"en":"material used to protect items inside a package (for example, paper, foam, or plastic)","zh":"包装填充物；防震材料（如纸、泡沫、塑料等）"},"examples":[{"en":"Please remove the packing before using the product.","zh":"使用产品前请先取出包装填充物。"},{"en":"They added extra packing to prevent damage.","zh":"他们加了额外的填充物以防损坏。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of putting things into containers or wrapping them tightly; the present participle of “pack”","zh":"（pack 的现在分词）把东西装入容器；把……塞满/紧密放入"},"examples":[{"en":"She is packing her suitcase right now.","zh":"她正在收拾她的行李箱。"},{"en":"They’re packing the books into boxes for the move.","zh":"他们正在把书装进箱子准备搬家。"}]}],"synonyms":["packing up","boxing","wrapping","packaging","cushioning"],"phonetic":"/ˈpækɪŋ/","extraExplanation":["“packing”最常见有三类用法：①作名词表示“打包/收拾行李”；②作名词表示“包装填充物”；③作动词现在分词（pack + -ing）表示“正在打包”。在电商与物流场景里，第②种也很常见。","常见搭配：packing list（装箱单/装箱清单）、packing tape（封箱胶带）、packing slip（出货单/装箱单）、packing peanuts（泡沫填充颗粒）。"]}
{"word":"packinghouse","summary":{"en":"A packinghouse is a factory that processes and packages food—especially meat—for sale.","zh":"packinghouse 指加工并包装食品（尤其是肉类）以供销售的工厂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a factory where animals or food products are processed and packed for sale, especially meat","zh":"（尤指肉类的）屠宰加工与包装厂；食品加工包装厂"},"examples":[{"en":"He got a job at a meat packinghouse after high school.","zh":"他高中毕业后在一家肉类加工包装厂找到了工作。"},{"en":"The town grew around the packinghouse, which provided steady work for many families.","zh":"这个小镇围绕着那家加工包装厂发展起来，它为许多家庭提供了稳定的工作。"}]}],"synonyms":["meatpacking plant","packing plant","processing plant"],"phonetic":"/ˈpækɪŋˌhaʊs/","extraExplanation":["这个词在美国历史语境中很常见，尤其与19—20世纪初芝加哥等城市的肉类加工产业有关。相关名著包括厄普顿·辛克莱（Upton Sinclair）的小说《屠场》（The Jungle, 1906），描写了当时packinghouse工人的生活与工作环境，并推动了食品安全改革。","常见近义表达有 meatpacking plant（肉类加工厂）或 packing plant（包装/加工厂）。在现代行业语境中，也可能指处理并包装家禽、鱼类或农产品的工厂。"]}
{"word":"packings","summary":{"en":"“Packings” usually means packing materials for shipping, and in technical contexts it can mean sealing materials used in machinery to prevent leaks.","zh":"“Packings”通常指运输用的包装/填充材料；在技术语境中也可指机械中用于防漏的密封填料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Materials used to pack or protect goods during shipping or storage (plural of “packing”).","zh":"（packing 的复数）用于装箱、保护货物以便运输或存放的包装/填充材料。"},"examples":[{"en":"Please remove all packings before using the product.","zh":"使用产品前请移除所有包装材料。"},{"en":"The fragile items were surrounded by soft packings.","zh":"易碎物品周围塞满了柔软的填充物。"}]},{"partOfSpeech":"n.","definition":{"en":"Sealing or cushioning materials placed around a part (often in machines or pipes) to prevent leaks or reduce friction.","zh":"（常用于机械/管道）用于密封或缓冲的填料/密封材料，用来防漏或减少摩擦。"},"examples":[{"en":"Worn packings can cause the valve to leak.","zh":"密封填料磨损会导致阀门漏水。"},{"en":"The technician replaced the pump’s packings during maintenance.","zh":"技术员在维护时更换了泵的密封填料。"}]}],"synonyms":["packaging","packing materials","padding","wrapping","seals","gaskets"],"phonetic":"/ˈpækɪŋz/","extraExplanation":["在工程语境里，packing/packings 常译为“填料/密封填料”，和日常的“包装材料”不同：它指填在轴、阀门、泵等部位的密封材料（如石墨填料、PTFE 填料），用来防止液体或气体泄漏。","词形上，packings 通常是 packing 的复数名词；若要表达“正在打包”，更常用动词形式 packing（如：I’m packing my bag）。"]}
{"word":"packless","summary":{"en":"“Packless” means not carrying a pack (or, less commonly, not being in a pack).","zh":"“packless”指不背包/不带负载（较少见：不成群/离群）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a pack (such as a backpack or load); not carrying gear or baggage.","zh":"没有背包或负载的；不携带装备或行李的。"},"examples":[{"en":"We went packless on the short hike and carried only water in our hands.","zh":"这段短途徒步我们没背包，只手拿着水。"},{"en":"Packless travel feels freeing, but you have to plan carefully.","zh":"不带背包旅行很自在，但必须仔细规划。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Without a group or bundle; not gathered into a pack.","zh":"（较少见）没有成群或成捆的；不成“pack（群/包）”的。"},"examples":[{"en":"In winter, wolves are rarely packless for long.","zh":"在冬季，狼很少会长时间离群（不成狼群）。"}]}],"synonyms":["unburdened","unladen","gear-free","traveling light"],"phonetic":"/ˈpæk.ləs/","extraExplanation":["“packless”不是非常常见的标准词，更常见的表达是“without a backpack / without baggage / traveling light”。在户外语境里，“pack”常指背包（backpack）或装备负载；在动物语境里，“pack”常指“兽群/狼群”。"]}
{"word":"packly","summary":{"en":"“Packly” is usually a proper name (brand/surname) rather than a common English word; as an adverb it’s rare and nonstandard.","zh":"“Packly”通常是专有名词（品牌/姓氏），不是常见英语词；当副词用很少见且不标准。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (rare): used as a brand name or a surname; not a standard dictionary word in common English.","zh":"专有名词（少见）：可用作品牌名或姓氏；并非常见英语词典词汇。"},"examples":[{"en":"Packly is a company name you might see on packaging-related websites.","zh":"Packly 可能是你在包装相关网站上看到的公司名称。"},{"en":"Ms. Packly spoke at the event.","zh":"Packly 女士在活动上发言。"}]},{"partOfSpeech":"adv.","definition":{"en":"Nonstandard/rare: sometimes used as an adverb meaning “in a packed way,” but most writers would say “tightly,” “closely,” or “densely packed.”","zh":"非标准/少见：有时被当作副词表示“拥挤地/紧密地（被）装在一起的样子”，但更常见的表达是 tightly、closely 或 densely packed。"},"examples":[{"en":"The books were stacked tightly on the shelf.","zh":"书在书架上堆得很紧。"},{"en":"People stood closely together near the door.","zh":"人们在门口附近挨得很近。"}]}],"synonyms":["tightly","closely","densely (packed)"],"phonetic":"/ˈpækli/","extraExplanation":["“packly”在现代英语里并不常见，因此更可能是：1）品牌/公司名（尤其与包装 packaging 有关）；2）拼写误差（你可能想查的是 pack、packed、packing、compactly、tightly 等）。","如果你告诉我你看到“packly”的句子或链接，我可以根据上下文判断它具体指什么，并给出更自然的替换表达。"]}
{"word":"packmaker","summary":{"en":"A packmaker makes packs or packing/packaging products.","zh":"packmaker 指制作背包或包装/打包用品的人或公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes packs (bags/backpacks) or packing products for transporting goods","zh":"制作背包、包裹或包装用品（用于运输货物）的人或公司"},"examples":[{"en":"The outdoor brand works with a local packmaker to produce durable hiking backpacks.","zh":"这个户外品牌与当地的背包制造商合作，生产耐用的徒步背包。"},{"en":"We changed packmakers to improve the quality of the shipping cartons.","zh":"我们更换了包装供应商，以提升运输纸箱的质量。"}]}],"synonyms":["backpack manufacturer","packaging manufacturer","packer","supplier"],"phonetic":"/ˈpækˌmeɪkər/","extraExplanation":["“packmaker”是由 pack（包、包裹；打包）+ maker（制造者）组成的复合词，但在现代英语中并不算常见。日常更常见的说法会是 backpack manufacturer（背包制造商）、packaging manufacturer（包装制造商）或 supplier（供应商）。在某些行业语境里（如户外装备、物流包装），它可能作为较口语/内部用语出现，也可能作为姓氏出现。"]}
{"word":"packmaking","summary":{"en":"Packmaking means the work of making packs (bags/backpacks) or producing bundled packs of goods.","zh":"Packmaking 指制作背包/袋子或把商品制成成包产品的工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or work of making packs (bags/backpacks) or bundled packs of goods; pack production","zh":"制作背包/袋子或把货物打包成“成包”产品的工作；包具制作/打包生产"},"examples":[{"en":"She learned packmaking in a small workshop that produced canvas backpacks.","zh":"她在一家制作帆布背包的小作坊里学习包具制作。"},{"en":"Packmaking requires careful stitching so the straps don’t tear.","zh":"包具制作需要细致的缝线处理，肩带才不容易撕裂。"},{"en":"In the warehouse, packmaking and labeling are done on the same line.","zh":"在仓库里，打包制作和贴标签在同一条生产线上完成。"}]}],"synonyms":["bag making","backpack making","pack-making","packing","packaging"],"phonetic":"/ˈpækˌmeɪkɪŋ/","extraExplanation":["“packmaking”不是非常常见的标准词，更常见的表达包括：backpack making（背包制作）、bag making（包袋制作）、packaging（包装/包装业）、packing（打包）。在正式写作中也常见写成“pack-making”（加连字符）。","如果语境是户外装备行业，“pack”常指backpack（背包）；如果语境是仓储物流，“pack”更可能指一包货物或成组产品，因此“packmaking”可能接近“打包生产/组装成套”。"]}
{"word":"packman","summary":{"en":"“Packman” most often refers to the classic video game character/game “Pac-Man,” but it can also mean an old-fashioned traveling seller (peddler).","zh":"“packman”最常见是指经典游戏《Pac-Man/吃豆人》，但也可指较旧用法的走街串巷小贩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often written “Pac-Man”) A classic Japanese arcade video game (1980) where a yellow character eats dots in a maze while avoiding ghosts.","zh":"（常写作“Pac-Man”）经典日本街机游戏（1980年）：一个黄色角色在迷宫里吃豆，同时躲避鬼怪。"},"examples":[{"en":"My dad used to play Pac-Man at the arcade after school.","zh":"我爸爸以前放学后常在游戏厅玩《吃豆人》。"},{"en":"This sticker looks like Pac-Man chasing the dots.","zh":"这张贴纸看起来像《吃豆人》在追着豆子跑。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A person who sells goods by traveling from place to place; a peddler (older usage).","zh":"（较少见）走街串巷卖货的人；小贩（较旧用法）。"},"examples":[{"en":"In the old story, a packman came to the village with cloth and tools.","zh":"在那个老故事里，有个小贩带着布料和工具来到村子。"},{"en":"The word “packman” is old-fashioned in modern English.","zh":"“packman”在现代英语里比较过时。"}]}],"synonyms":["Pac-Man","arcade game","peddler","traveler (seller)"],"phonetic":"/ˈpækˌmæn/","extraExplanation":["更常见、最标准的拼写是 **Pac-Man**（有连字符与大写），它原本是品牌名/游戏名；写成 **packman** 时，读者可能会以为你想表达“背着货物到处卖的小贩”这个较旧的词义，或只是拼写错误。","文化背景：Pac-Man 是流行文化代表之一，常被用来象征“吃掉/清除小点点”的画面（例如图标、贴纸、复古游戏主题）。"]}
{"word":"packmanship","summary":{"en":"“Packmanship” means skill in packing things well and safely; it’s a rare, informal-sounding word.","zh":"packmanship 指“把东西打包/装箱装得又稳又省空间的技巧”，属于较少见、偏口语或自造色彩的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Skill or craft in packing items efficiently and safely (especially for moving or shipping); good judgment about how to pack.","zh":"打包/装箱的技巧与手艺（尤指搬家或运输时）；懂得如何把东西装得高效又安全的能力。"},"examples":[{"en":"Her packmanship kept all the dishes from breaking during the move.","zh":"她的装箱技巧让所有餐具在搬家时都没有破。"},{"en":"With a little packmanship, you can fit a week’s clothes into a carry-on.","zh":"只要有点打包技巧，你就能把一周的衣服装进随身行李箱。"},{"en":"The warehouse trained new workers in packmanship and labeling.","zh":"仓库培训新员工学习装箱技巧和贴标。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s practical ability to organize and prepare supplies for a trip or task (less common).","zh":"把行程或任务所需物资整理、准备好的能力（较不常见的引申义）。"},"examples":[{"en":"Good packmanship is essential for long hikes.","zh":"长途徒步需要很好的物资整理与打包能力。"},{"en":"His packmanship meant the team always had the right tools on site.","zh":"他的整理与打包能力让团队在现场总能带齐合适的工具。"}]}],"synonyms":["packing skills","packing technique","packing expertise","careful packing","efficient packing"],"phonetic":"/ˈpæk.mən.ʃɪp/","extraExplanation":["“packmanship”并不是非常常见的标准词汇，更像是把 pack（打包）+ -manship（某种“技艺/风格”，如 sportsmanship）组合出来的造词，用来强调“打包这件事也有技巧与门道”。在正式写作里，更常用 packing skills、packing technique、packing expertise。"]}
{"word":"packmen","summary":{"en":"“Packmen” most often refers to “Pac-Man” (or the plural “Pac-Men”); less commonly, it can mean people who pack goods, though “packers” is the usual word.","zh":"“packmen”最常见是指“Pac-Man”（或其复数“Pac-Men”）；较少见时可指打包货物的人，但更常用的词是“packers”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly: Pac-Man) A famous arcade video game character (a yellow, round figure) and the game featuring him; “Pac-Men” can be used as the plural.","zh":"（常见写法：Pac-Man）著名街机游戏角色（黄色圆形角色）以及以他为主角的游戏；其复数可写作“Pac-Men”。"},"examples":[{"en":"I used to play Pac-Man at the arcade after school.","zh":"我以前放学后常去街机厅玩《Pac-Man》。"},{"en":"The museum has several classic machines, including Pac-Man.","zh":"博物馆里有几台经典街机，包括《Pac-Man》。"},{"en":"In old gaming magazines, you sometimes see “Pac-Men” used as the plural.","zh":"在一些老的游戏杂志里，你有时会看到把复数写成“Pac-Men”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) People who pack goods for delivery, sale, or transport; also spelled “packmen,” but more commonly expressed as “packers.”","zh":"（较少见）负责把货物打包以便运输、销售或投递的人；可写作“packmen”，但更常用的说法是“packers（打包工/包装工）”。"},"examples":[{"en":"The warehouse hired extra packers during the holiday rush.","zh":"假日高峰期仓库雇了更多包装工。"},{"en":"In older texts, packmen prepared goods for long journeys.","zh":"在较早的文字中，packmen 会为长途运输准备并打包货物。"}]}],"synonyms":["Pac-Man","Pac-Men","packers","packagers"],"phonetic":"/ˈpækˌmæn/","extraExplanation":["“packmen”很可能是把“Pac-Man”的复数或拼写写成了普通形式。正式写法通常是“Pac-Man”（有连字符、首字母大写），复数常写“Pac-Men”，也有人直接写“Pac-Man games”。","Pac-Man 是 1980 年由日本南梦宫（Namco）推出的经典街机游戏角色与作品，后来成为流行文化符号。"]}
{"word":"packness","summary":{"en":"“Packness” is a rare/nonstandard noun meaning how tightly something is packed; “packedness,” “compactness,” or “density” are more common.","zh":"“packness”是少见/非标准名词，表示“装得多紧/多满”；更常用的是“packedness / compactness / density”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) the state or quality of being packed closely together; tightness or density.","zh":"（少见/非标准用法）被紧密装在一起的状态；紧密度、密度。"},"examples":[{"en":"The packness of the suitcase made it hard to zip closed.","zh":"行李箱里塞得太紧，很难拉上拉链。"},{"en":"In some notes, “packness” is used to describe how tightly items are arranged.","zh":"在一些笔记里，“packness”用来形容物品摆放得有多紧。"}]}],"synonyms":["packedness","compactness","density","tightness"],"phonetic":"/ˈpæk.nəs/","extraExplanation":["“packness”在现代英语里非常不常见，很多情况下会被认为是拼写或造词不自然。更常用的表达是：packedness（拥挤/装得很满的程度）、compactness（紧凑性）、density（密度）、tight packing（紧密包装/紧密堆放）。","如果你是在学术或技术语境（如材料、颗粒堆积、包装工程）想表达“堆积得有多紧”，通常用“packing density（堆积密度）”或“packing fraction（填充率）”更标准。"]}
{"word":"packnesses","summary":{"en":"“packnesses” is a rare plural noun meaning levels or instances of tight packing (crowding/density).","zh":"“packnesses”是一个很少见的名词复数，表示“塞得很紧/很满的程度”，可理解为拥挤度或密度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of packness: the state of being tightly packed; crowding or density (rare/uncommon word).","zh":"packness 的复数：被紧密塞满的状态；拥挤或密度（较少见/不常用）。"},"examples":[{"en":"The packnesses of the storage boxes made it hard to pull anything out.","zh":"收纳箱里塞得太满（紧密程度太高），很难把东西拿出来。"},{"en":"We compared the packnesses of different suitcases to see which held more clothes.","zh":"我们比较了不同手提箱的“装得有多满”，看哪个能装更多衣服。"}]}],"synonyms":["crowdedness","density","compactness","fullness","congestion"],"phonetic":"/ˈpæk.nəs.ɪz/","extraExplanation":["“packnesses”非常少见；日常英语里更常用的说法是 crowdedness（拥挤程度）、density（密度）、compactness（紧密度）或 fullness（装满程度）。","很多时候你可能想写的是 packedness（被塞满/拥挤的程度），更容易被读者理解。"]}
{"word":"packplane","summary":{"en":"A packplane is a small aircraft used to transport supplies or cargo, especially to remote places.","zh":"packplane 指用于运输补给或货物的小型飞机，尤用于偏远地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small airplane used to carry supplies or cargo (often to remote areas), similar in purpose to a pack animal.","zh":"（常指运送补给到偏远地区的）运货小飞机；补给运输机，功能类似“驮运牲畜”。"},"examples":[{"en":"The packplane delivered food and medicine to the mountain village after the storm.","zh":"暴风雨过后，那架补给运输机把食物和药品送到了山里的村庄。"},{"en":"Because there were no roads, they relied on a packplane to bring in fuel and tools.","zh":"因为没有公路，他们只能依靠运货小飞机运来燃料和工具。"}]}],"synonyms":["cargo plane","freighter","bush plane","supply plane"],"phonetic":"/ˈpækˌpleɪn/","extraExplanation":["“packplane”多见于较早的英语或特定场景（如边远地区补给、林区/矿区作业等），强调“像pack animal（驮兽）一样负责驮运”。现代更常见的说法是 cargo plane（货机）、freighter（货运机）或 bush plane（丛林/荒野小飞机，常用于偏远地区）。"]}
{"word":"packrat","summary":{"en":"A packrat is someone who keeps lots of things and hates throwing things away.","zh":"packrat 指爱囤东西、舍不得丢东西的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps and collects many things, often items that are not very useful, because they don’t want to throw anything away.","zh":"囤积癖的人；爱把各种东西都留着的人（常常连不太有用的东西也舍不得丢）。"},"examples":[{"en":"My dad is a packrat—he keeps old cables and boxes in the garage.","zh":"我爸很爱囤东西——车库里留着一堆旧电线和盒子。"},{"en":"She isn’t a hoarder, just a packrat who saves every birthday card.","zh":"她不是严重的囤积者，只是个爱留东西的人，每张生日卡都收着。"}]}],"synonyms":["collector","hoarder","pack (away)","save (everything)"],"phonetic":"/ˈpækˌræt/","extraExplanation":["“packrat”原本指北美的一种林鼠（woodrat），会把闪亮或有趣的小东西叼回窝里；后来引申为形容“什么都舍不得丢、爱收集杂物”的人。","语气通常是轻松、略带调侃的；若要表达更严重、可能影响生活的“病理性囤积”，英语更常用 hoarder / hoarding disorder（语气更严肃）。"]}
{"word":"packs","summary":{"en":"“packs” can mean multiple packs/groups, or the verb “packs” meaning someone puts things into a container (or crowds into a place).","zh":"“packs”既可表示“多包/多捆/多群”，也可作动词表示“装包/打包”，或“（人群）挤满某处”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pack”: a group or set of things (or animals) gathered together, or a bundle/container used for carrying things.","zh":"“pack”的复数：指一组/一群（东西或动物），或指用于携带物品的包、捆、包装。"},"examples":[{"en":"She bought two packs of batteries.","zh":"她买了两包电池。"},{"en":"A pack of wolves moved through the forest.","zh":"一群狼穿过森林。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “pack”: to put things into a bag, box, or container for travel, storage, or shipping.","zh":"“pack”的第三人称单数：把物品装进包、箱子或容器里，以便旅行、存放或运输。"},"examples":[{"en":"He packs his lunch every morning.","zh":"他每天早上都把午餐装好带走。"},{"en":"She packs the books into a box carefully.","zh":"她把书小心地装进箱子里。"}]},{"partOfSpeech":"v.","definition":{"en":"To fill or crowd a space tightly (often followed by “into”).","zh":"把某处塞满/挤满（常与“into”连用）。"},"examples":[{"en":"The fans pack into the stadium before the game.","zh":"比赛前球迷们挤进体育场。"},{"en":"People pack the subway at rush hour.","zh":"高峰期地铁里挤满了人。"}]}],"synonyms":["bundles","sets","groups","boxes","bags","loads"],"phonetic":"/pæks/","extraExplanation":["“packs”在日常中最常见的是可数名词复数：a pack of gum / a pack of cards / packs of instant noodles（几包口香糖/一副牌/几包方便面）。","注意区分：pack（包、捆、群） vs. package（包裹、包件，强调邮寄或商品包装） vs. backpack（背包）。"]}
{"word":"packsack","summary":{"en":"A packsack is a backpack used to carry things, especially for hiking or travel.","zh":"packsack 指背包，常用于携带物品，尤指徒步或旅行时使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a backpack; a bag carried on your back with shoulder straps, used for carrying supplies (especially for hiking or travel).","zh":"背包；（尤指徒步或旅行用的）双肩背的行囊。"},"examples":[{"en":"He put a water bottle and snacks in his packsack before the hike.","zh":"徒步前，他把水瓶和零食放进背包里。"},{"en":"My packsack is heavy because I packed a laptop and books.","zh":"我的背包很重，因为我装了笔记本电脑和书。"}]}],"synonyms":["backpack","rucksack","knapsack"],"phonetic":"/ˈpækˌsæk/","extraExplanation":["“packsack”在现代英语里不如“backpack”常见，更多见于口语或作为“pack sack”（两个词）的写法。日常美式英语里最常用的是“backpack”；在户外/军用语境中也常用“rucksack”。","在文学或叙事描写里，用“packsack”有时会带一点朴素、户外冒险或较旧式的语感，但实际含义通常就是“背包”。"]}
{"word":"packsacks","summary":{"en":"“packsack” means a backpack; it’s an uncommon term today.","zh":"“packsack”表示“背包”，但现在不太常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a backpack; a bag carried on your back, usually with shoulder straps (also written as “pack sack”)","zh":"背包；（用肩带背在背上的）背袋（也可写作“pack sack”）"},"examples":[{"en":"I packed a rain jacket in my packsack before the hike.","zh":"徒步前我把雨衣装进背包里。"},{"en":"She carried a small packsack to school.","zh":"她背着一个小背包去上学。"}]}],"synonyms":["backpack","rucksack","knapsack"],"phonetic":"/ˈpækˌsæk/","extraExplanation":["“packsack”在现代英语里不算常见，更常用的说法是“backpack”（美式）或“rucksack”（英式/欧式）。在户外、军用或旧式用法中偶尔会见到“pack sack/ packsack”。","如果你想表达“很多背包”，更自然的复数是“backpacks”；“packsacks”也可以被理解为“packsack”的复数，但会显得不太地道。"]}
{"word":"packsaddle","summary":{"en":"A packsaddle is equipment used to strap loads onto a pack animal.","zh":"packsaddle 指用于把货物固定在驮畜身上的驮鞍/驮架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of saddle or frame strapped to an animal (especially a pack horse or mule) for carrying loads rather than a rider","zh":"驮鞍；驮架（系在动物身上用来驮运货物，而不是供人骑乘）"},"examples":[{"en":"They strapped the boxes to the packsaddle before starting up the mountain trail.","zh":"他们把箱子绑在驮鞍上，然后开始沿着山路上行。"},{"en":"A well-fitted packsaddle keeps the load from shifting and hurting the animal.","zh":"合身的驮鞍能防止货物晃动，避免伤到动物。"}]}],"synonyms":["pack saddle","pack frame","cargo saddle"],"phonetic":"/ˈpækˌsædəl/","extraExplanation":["“packsaddle”常见于户外探险、牧场生活或历史语境（如边疆运输、早期旅行）。与普通“saddle（骑鞍）”不同，它的重点是分散重量、固定货物，让动物能更稳定地驮运。"]}
{"word":"packsaddles","summary":{"en":"A packsaddle is a saddle used to carry loads on an animal; “packsaddles” is the plural form.","zh":"packsaddle 指用于驮运货物的驮鞍；packsaddles 是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special saddle placed on an animal (often a horse, mule, or donkey) so it can carry loads, usually with bags or bundles attached on both sides","zh":"驮鞍；驮垫（放在马、骡、驴等背上，用来固定两侧行李或货物的专用鞍具）"},"examples":[{"en":"The mule carried two heavy packs secured to a packsaddle.","zh":"那头骡子用驮鞍固定着两袋沉重的行李。"},{"en":"They loaded water and food onto the packsaddles before crossing the desert.","zh":"他们在穿越沙漠前把水和食物装到驮鞍上。"},{"en":"In the old photo, you can see a donkey with a simple packsaddle and rope.","zh":"在那张老照片里，你能看到一头驴背上有一个简易驮鞍和绳子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fit an animal with a packsaddle (rare)","zh":"给（牲畜）装上驮鞍（较少用）"},"examples":[{"en":"They packsaddled the horses at dawn and started the climb.","zh":"他们天一亮就给马装上驮鞍，开始攀登。"}]}],"synonyms":["pack saddle","saddlebag (context-dependent)","packframe (related)"],"phonetic":"/ˈpækˌsædəl/","extraExplanation":["“packsaddle”在英语里常出现在旅行、探险、牧场和旧西部（Old West）等语境。现代更多用“pack saddle”（两词）或更具体的说法，如“saddlebag(s)（鞍袋）”。","你输入的“packsaddles”更可能是复数形式：packsaddles = 多个驮鞍。"]}
{"word":"packstaff","summary":{"en":"A historical term for a staff used to support or carry a pack while traveling.","zh":"旧时指用于支撑或背负货包的杖（多见于历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stick or staff used to help carry or support a pack (a load carried on the back), especially by travelers or peddlers (historical).","zh":"（旧时）用于帮助背负或支撑背包/货包的杖、撑杆，常见于旅行者或小贩背负货物时。"},"examples":[{"en":"The peddler rested his pack on a packstaff before walking on.","zh":"小贩把货包靠在背包杖上歇了歇，然后继续赶路。"},{"en":"In the old account, he traveled with a packstaff and a bundle of goods.","zh":"那篇旧记载里说，他带着背包杖和一捆货物在路上行走。"}]}],"synonyms":["pack stick","staff","walking stick"],"phonetic":"ˈpækˌstæf","extraExplanation":["“packstaff”多见于较旧的英语文本（尤其是描写行商、旅行者、乡间道路的叙述）。现代日常英语里更常说“walking stick / staff”，或更具体地说“pack frame（背架）”“hiking pole（登山杖）”。","词形可理解为 pack（背负的包裹）+ staff（杖）。在一些历史语境中，它不只是“拄杖”，也暗示人物的身份与处境：背着货物讨生活、长途步行、旅途艰辛。"]}
{"word":"packstaves","summary":{"en":"Packstaves are traditional frames or staves used to carry loads on the back (plural).","zh":"packstaves 指用于背负货物的传统背架/木条支架（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) wooden or metal staves/frames used to support and carry a load (a “pack”) on a person’s back; a traditional carrying frame, especially in older Scottish/UK usage.","zh":"（复数）用来支撑并背负货物（背包/货担）的木条或背负架；一种传统背架，尤见于旧时苏格兰/英国用法。"},"examples":[{"en":"In the old story, the traveler strapped his goods to packstaves and set off before dawn.","zh":"在那个老故事里，旅人把货物绑在背架上，天没亮就出发了。"},{"en":"Before modern backpacks, heavy loads were often carried with packstaves.","zh":"在现代背包出现之前，人们常用背架来背负重物。"}]}],"synonyms":["pack frame","carrying frame","backpack frame"],"phonetic":"/ˈpækˌsteɪvz/","extraExplanation":["“packstaves”来自“pack（包袱、货物）+ stave（木条、杆）”。常见于较古老或地域性的描写（尤其是苏格兰/英国历史语境），现代英语里更常说“backpack frame / carrying frame / pack frame”。"]}
{"word":"packthread","summary":{"en":"Strong thread/twine used to tie up packages or bundles.","zh":"用于捆扎包裹或货物的结实线/细绳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong thread or twine used for tying parcels, bundles, or packages (packing string).","zh":"（用于捆扎包裹、货物的）包装绳；捆扎线。"},"examples":[{"en":"Tie the box with packthread so it doesn’t open during shipping.","zh":"用包装绳把箱子捆好，这样运输时就不会散开。"},{"en":"He used packthread to bundle the newspapers together.","zh":"他用捆扎线把报纸捆成一捆。"}]}],"synonyms":["packing twine","string","twine","parcel string"],"phonetic":"/ˈpækˌθrɛd/","extraExplanation":["“packthread”在现代英语中不算常见，更常见的说法是“string / twine / packing twine”。它带有一点较旧或英式用法的感觉，通常出现在与打包、寄送、捆扎相关的语境中。"]}
{"word":"packthreaded","summary":{"en":"“Packthreaded” is not standard English; it’s likely a technical compound meaning “packed and threaded” or “threaded (often for sealing/assembly).”","zh":"“packthreaded”不是标准英语词，多为技术复合写法，通常指“装填并带螺纹”或“带螺纹（常用于密封/装配）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a standard dictionary word) Likely a technical or in-house compound meaning “packed and threaded,” or “fitted with threads (and sometimes packing/sealing material),” describing a part that has screw threads and is prepared for assembly/sealing.","zh":"（非标准词条）多半是技术/行业自造复合词，意思可能是“已装填并带螺纹”，或“带有螺纹（有时也指配有填料/密封材料）”，用来描述具有螺纹、便于装配或密封的零件。"},"examples":[{"en":"The valve stem is packthreaded so it can be sealed before installation.","zh":"这个阀杆做成 packthreaded（带螺纹并便于密封），以便安装前先完成密封处理。"},{"en":"Check whether the connector is packthreaded or smooth before ordering the replacement.","zh":"下单替换件前先确认连接头是 packthreaded（带螺纹/可配密封）还是光滑无螺纹的。"}]}],"synonyms":["threaded","pre-threaded","sealed (context-dependent)"],"phonetic":"/ˈpækˌθrɛdɪd/","extraExplanation":["这个词在通用英语里几乎不出现，更像是特定公司/工程图纸/产品目录里的写法。有时也可能是把“pack-threaded / packed-threaded / pack threaded”连写造成的。","如果你能提供它出现的句子、行业（机械/管件/软件等）或相关图片/零件名称，我可以更准确地判断它到底指“带螺纹”、还是“已经装填（packing）并上螺纹/可密封”的那一类含义。"]}
{"word":"packthreads","summary":{"en":"“Pack threads” usually means either (1) to bundle sewing threads for storage/transport, or (2) to describe fabric with tightly packed threads.","zh":"“pack threads”通常指：(1) 把缝纫线等打包收纳/运输；或(2) 形容织物纱线排列很密。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to bundle or prepare sewing thread(s) for storage, travel, or shipping","zh":"把（缝纫）线打包、整理好以便收纳、携带或运输"},"examples":[{"en":"Before the move, I packed threads in small labeled bags.","zh":"搬家前，我把线装进贴好标签的小袋子里。"},{"en":"She packed her embroidery threads by color to keep them organized.","zh":"她按颜色把刺绣线打包整理，方便收纳。"}]},{"partOfSpeech":"phrase","definition":{"en":"threads that are positioned very close together in a fabric or material (i.e., tightly packed threads)","zh":"（织物或材料中）排列得很密的纱线/线（即“线很密”）"},"examples":[{"en":"This fabric feels smooth because it has tightly packed threads.","zh":"这块布摸起来很滑，因为纱线织得很密。"},{"en":"Higher-quality cloth often has more tightly packed threads.","zh":"品质更好的布料通常纱线更密。"}]}],"synonyms":["bundle threads","pack up threads","organize threads","tightly packed threads","dense weave"],"phonetic":"/pæk θrɛdz/","extraExplanation":["“packthreads”作为连写形式并不常见；更自然的写法通常是分开写成“pack threads”。如果你是在某个特定领域（如纺织、缝纫工具、软件/账号名）看到“packthreads”，它可能是品牌名、项目名或用户名。","在纺织语境里，“threads packed tightly”常与“thread count（支数/密度）”相关：线越密，织物往往更耐用、手感更细致，但也取决于纤维材质与织法。"]}
{"word":"packtong","summary":{"en":"Packtong is a historical term for a silvery alloy (often nickel silver) used in decorative metalwork and utensils.","zh":"Packtong 是一个偏历史的词，指外观像银的合金（常为镍银/白铜），常用于餐具和装饰金属制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pale, silvery metal alloy (often copper + nickel + zinc), historically imported from China and used to make tableware, ornaments, and decorative metalwork; also called “nickel silver.”","zh":"一种呈银白色的金属合金（常由铜、镍、锌组成），历史上从中国输入并用于制作餐具、饰品与装饰性金属制品；也常被称为“镍银”（nickel silver）。"},"examples":[{"en":"The antique teapot isn’t real silver—it’s made of packtong (nickel silver).","zh":"这把古董茶壶不是真银做的——它是白铜/镍银（packtong）制成的。"},{"en":"Victorian makers often used packtong for cutlery because it looked like silver but cost less.","zh":"维多利亚时期的工匠常用白铜/镍银（packtong）做刀叉，因为它像银但更便宜。"}]}],"synonyms":["paktong","nickel silver","German silver"],"phonetic":"ˈpæk.tɔŋ","extraExplanation":["“packtong”常见的另一种拼写是“paktong”。它在旧文献里指从中国输入、外观近似白银的一类合金，中文常对应“白铜”。在现代英语中更常用的说法是“nickel silver”（镍银）或“German silver”（德银，名称里有silver但不含真正的银）。","作为词汇，“packtong/paktong”偏历史与工艺领域用语，日常口语中不常见；如果你是在珠宝、古董或金属工艺语境里看到它，通常就是指这种“像银的合金”。"]}
{"word":"packtrain","summary":{"en":"A packtrain is a group of pack animals traveling together to carry supplies.","zh":"packtrain 指一队一起行进、用于驮运补给的驮兽队伍（驮队）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line or group of pack animals (such as mules, horses, donkeys, or camels) carrying loads, usually used to transport supplies through places where vehicles cannot easily go.","zh":"（驮队）一队驮运货物的牲畜（如骡、马、驴或骆驼），通常用于车辆难以通行的地区运送补给。"},"examples":[{"en":"The expedition hired a packtrain of mules to carry food and tents into the mountains.","zh":"探险队雇了一支骡子驮队，把食物和帐篷运进山里。"},{"en":"In winter the road closes, so a packtrain brings medicine to the remote village.","zh":"冬天道路封闭，所以驮队把药品送到偏远村庄。"}]}],"synonyms":["pack train","caravan","mule train","pack string"],"phonetic":"/ˈpækˌtreɪn/","extraExplanation":["“packtrain”常见于历史与户外语境（如探险、边疆运输、军队补给）。其中 pack 指“驮运的包裹/负载”，train 在这里不是“火车”，而是“成列行进的一队（人或动物）”。现代写法也常见作两词：pack train。"]}
{"word":"packwall","summary":{"en":"A packwall is a tightly packed wall of stones or rubble, often used for support in mines or rough construction.","zh":"packwall 指用石块或碎石紧密堆砌成的墙，常用于矿井支撑或粗石砌工程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wall built by tightly packing stones, rubble, or other material (often without mortar), used to support, separate, or fill space—especially in mining or rough construction.","zh":"（用石块、碎石等材料）紧密堆砌成的墙（常不使用砂浆），用于支撑、隔离或填充空间；尤见于采矿或粗石砌工程。"},"examples":[{"en":"In the old mine, workers built a packwall to support the tunnel roof.","zh":"在老矿井里，工人砌了一道 packwall 来支撑巷道顶部。"},{"en":"Loose rock was packed into a low packwall along the edge of the work area.","zh":"他们把松散的石块紧密堆成一堵矮 packwall，沿着施工区边缘。"}]}],"synonyms":["pack wall","stone packing wall","dry-stone wall (similar)","gob wall (mining, similar)"],"phonetic":"ˈpæk.wɔl","extraExplanation":["packwall 常见于采矿语境：用废石、矸石等“干砌/堆砌”成墙，用来支撑巷道、隔开采空区或控制落石。不同矿区也可能写作 pack wall。","在一般建筑语境中，它可指“填砌墙/填充墙”式的做法：用碎石等材料塞紧、填实，以增加稳定性或填补空隙。"]}
{"word":"packwaller","summary":{"en":"“Packwaller” is usually a surname/proper name, not a common English word.","zh":"“Packwaller”通常是姓氏/专有名词，不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname). It is not a common English vocabulary word, so meaning depends on the person, family, or brand using it.","zh":"专有名词（通常是姓氏）。它不是常见英语词汇，因此含义取决于使用它的人、家族或品牌。"},"examples":[{"en":"Dr. Packwaller will give the keynote speech tomorrow.","zh":"Packwaller 博士将于明天发表主题演讲。"},{"en":"I found an article by Packwaller in the journal.","zh":"我在期刊里找到一篇 Packwaller 写的文章。"}]}],"phonetic":"/ˈpækˌwɔlər/","extraExplanation":["“Packwaller”在英语里不算标准词汇，更常见的是作为人名/姓氏出现。若你是在某段文字里看到它，也有可能是拼写错误或识别错误（例如把两个词连在一起）。如果你把出现它的句子发来，我可以帮你判断它具体指什么、是否应拆分或更正拼写。"]}
{"word":"packware","summary":{"en":"Packware usually means packaging materials or containers used for packing and shipping; it’s an uncommon word and meaning can vary by context.","zh":"Packware 通常指用于打包和运输的包装材料或容器；该词不常见，具体含义可能随语境而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"packaging materials or containers used to pack, store, or ship products (a less common, industry-style word).","zh":"用于包装、储存或运输产品的包装材料或容器（较少见的行业用词）。"},"examples":[{"en":"The factory switched to recyclable packware to reduce waste.","zh":"工厂改用可回收的包装材料来减少浪费。"},{"en":"Please remove the packware before using the product.","zh":"使用产品前请先拆除包装。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sometimes) a set of items designed to be packed together for travel or outdoor use (usage is uncommon).","zh":"（有时）指为旅行或户外活动设计、可打包携带的一套用品（用法不常见）。"},"examples":[{"en":"He brought lightweight packware for the weekend camping trip.","zh":"他带了轻便的可打包装备去周末露营。"}]}],"synonyms":["packaging","packing materials","containers","packing supplies"],"phonetic":"/ˈpækˌwɛr/","extraExplanation":["“packware”不是非常标准、普遍的词，更常见的说法是：packaging（包装）、packing materials（包装材料）、containers（容器）、packing supplies（打包用品）。","它的构词方式类似于“hardware / software / tableware”，其中“-ware”常表示“一类物品/器具”。因此在不同公司或行业里，“packware”的具体含义可能略有差异，最好结合上下文判断。"]}
{"word":"packwax","summary":{"en":"Packwax is wax used in packing—typically to seal, protect, or reduce sticking during packaging and shipping.","zh":"Packwax 指用于包装/运输的蜡，常用于封口、防护或减少粘连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wax used to seal or protect packages, containers, or packed goods (for example, coating paper, sealing a box, or protecting a surface during shipping).","zh":"用于封口或保护包装、容器或已打包货物的蜡（例如给纸张上蜡、封箱口，或在运输中保护表面）。"},"examples":[{"en":"The museum used packwax to seal the crate before shipping the artifact.","zh":"博物馆在运送文物前，用封蜡把木箱封好。"},{"en":"Coating the paper with packwax helps keep moisture out.","zh":"给纸张涂上一层包装蜡有助于防潮。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of wax applied to reduce sticking and help materials slide or release during packing (for example, on cardboard, wood, or tools used in packaging).","zh":"在打包过程中涂抹的一种蜡，用来减少粘连、让材料更顺滑或更容易脱模/脱离（例如用于纸板、木材或包装工具）。"},"examples":[{"en":"They rubbed a little packwax on the tool so it wouldn’t stick to the tape residue.","zh":"他们在工具上抹了一点包装蜡，避免粘到胶带残胶。"},{"en":"Packwax can make tight-fitting parts easier to separate after storage.","zh":"包装蜡能让紧密贴合的零件在存放后更容易分开。"}]}],"synonyms":["pack wax","packing wax","sealing wax","paraffin wax"],"phonetic":"/ˈpækˌwæks/","extraExplanation":["“packwax”更常见的写法是两词形式“pack wax”（包装用蜡/封蜡）。在不同产业里，它可能指封箱封口用的蜡、给包装材料做防潮涂层的蜡，或是用于减少摩擦与粘连的蜡。具体含义通常要看上下文（shipping/packing/warehouse等）。"]}
{"word":"packwaxes","summary":{"en":"“Packwaxes” usually means waxes used for packing—coating or sealing packages to protect them, especially from moisture.","zh":"“packwaxes”通常指用于包装的蜡：用于给包装涂层或封口，以保护物品（尤其防潮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"waxes used to seal, coat, or protect items during packing and shipping (for example, coating paper, cardboard, or wood to resist moisture).","zh":"用于包装和运输时封口、涂层或保护物品的蜡（例如给纸张、纸板或木材上蜡以防潮）。"},"examples":[{"en":"The factory uses pack waxes to coat cartons so they don’t absorb moisture in transit.","zh":"工厂用包装蜡给纸箱上涂层，避免运输途中吸潮。"},{"en":"We sealed the edges with pack waxes to keep the contents clean.","zh":"我们用包装蜡封住边缘，让里面的东西保持干净。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) different types of wax products sold in small units for travel or storage (for example, “wax packs”).","zh":"（较少见）以小包装形式出售、便于携带或储存的各类蜡制品（类似“蜡块/蜡包”）。"},"examples":[{"en":"She ordered several pack waxes for her candle-making kit.","zh":"她为做蜡烛的工具包买了几种小包装蜡料。"}]}],"synonyms":["sealing wax","packing wax","packaging wax","paraffin wax"],"phonetic":"/ˈpæk wæks/","extraExplanation":["“packwaxes”更常见的写法通常是分开写作“pack waxes”或写作“packing wax(es)”。在不同领域（如包装材料、工业防潮涂层、手工蜡烛材料）里，指代会略有差异。","如果你是在某个特定场景看到这个词（例如产品说明、牙科/铸造/冲浪等），告诉我上下文句子，我可以帮你锁定最准确的含义与对应译法。"]}
{"word":"packway","summary":{"en":"A packway is a (rare) term for a trail or route used to carry loads, especially by pack animals.","zh":"packway（较罕见）指用于驮运货物的道路/路线，常指驮畜行走的山道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trail or route used by pack animals (such as horses, mules, or llamas) to carry loads, especially in mountains or wilderness areas","zh":"（尤指山地或荒野中）供驮畜（如驮马、骡、羊驼等）驮运货物行走的山道/驮运路线"},"examples":[{"en":"The supplies were taken up the packway by mule.","zh":"补给品由骡子沿着驮运道运上山。"},{"en":"In the past, remote villages depended on a packway for trade.","zh":"过去，偏远村庄靠驮运道进行贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a road or passageway for carrying or transporting packs (loads)","zh":"（罕见）用于搬运或运输包裹/货物的道路或通道"},"examples":[{"en":"Workers cleared a narrow packway through the forest.","zh":"工人们在森林里清出一条狭窄的运货通道。"}]}],"synonyms":["pack trail","mule track","trail","path"],"phonetic":"/ˈpækˌweɪ/","extraExplanation":["“packway”在现代英语中非常少见，多见于历史/地理语境（如山地驮运路线）。日常英语里更常用的是“trail / path / mule track（驮道）”。","很多学习者会把“packway”误写成“parkway（公园大道/高速景观道路）”或想表达“pathway（小路/途径）”。如果你想说的是城市道路，通常应选“parkway”；如果是一般的小路或方法，多用“pathway”。"]}
{"word":"paco","summary":{"en":"“Paco” is most commonly a Spanish male name/nickname, often short for “Francisco.”","zh":"“Paco”最常见是西班牙语男性人名/昵称，常作“Francisco”的昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Spanish male given name or nickname, especially a common nickname for “Francisco.”","zh":"西班牙语男性名字或昵称；尤其常用作“Francisco（弗朗西斯科）”的昵称。"},"examples":[{"en":"My coworker Paco is from Mexico City.","zh":"我的同事Paco来自墨西哥城。"},{"en":"His full name is Francisco, but everyone calls him Paco.","zh":"他的全名是Francisco，但大家都叫他Paco。"}]}],"synonyms":["Francisco","Frank"],"phonetic":"/ˈpɑːkoʊ/","extraExplanation":["“Paco”最常见的来源是西班牙语名字“Francisco”的昵称，用法类似英语里“William→Bill”“Robert→Bob”。在英语语境中，常直接把Paco当作人名使用（首字母大写）。"]}
{"word":"pacolet","summary":{"en":"Pacolet is a proper name most commonly referring to a town and related place names (like the Pacolet River) in South Carolina, USA.","zh":"Pacolet 是一个专有名词，最常指美国南卡罗来纳州的帕科莱特镇及相关地名（如帕科莱特河）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small town in South Carolina, USA (Spartanburg County).","zh":"（美国）南卡罗来纳州的一个小镇（斯帕坦堡县）。"},"examples":[{"en":"She grew up in Pacolet, South Carolina, and later moved to Atlanta.","zh":"她在南卡罗来纳州的帕科莱特长大，后来搬到了亚特兰大。"},{"en":"The event is held near Pacolet every spring.","zh":"这个活动每年春天都会在帕科莱特附近举行。"}]},{"partOfSpeech":"other","definition":{"en":"(in local geography) used in names such as the Pacolet River in South Carolina.","zh":"（地名用法）用于一些地理名称中，例如南卡罗来纳州的帕科莱特河。"},"examples":[{"en":"They went kayaking on the Pacolet River.","zh":"他们去帕科莱特河划皮划艇了。"},{"en":"The trail follows parts of the Pacolet watershed.","zh":"这条步道沿着帕科莱特河流域的部分区域延伸。"}]}],"phonetic":"/ˈpækəlɪt/","extraExplanation":["“Pacolet”多见于美国南卡罗来纳州的地名（城镇、河流等），通常作为专有名词使用，首字母大写。","关于词源：一些资料认为它可能与当地原住民语言有关，但来源与具体含义在不同解释中并不完全一致；如果需要写作或研究，建议查阅当地历史或权威地名辞典。"]}
{"word":"pacos","summary":{"en":"“Pacos” usually means “more than one person named Paco” (a Spanish name, often from Francisco).","zh":"“Pacos”通常指“多个名叫 Paco 的人”（Paco 是西班牙语名字，常源自 Francisco 的昵称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Plural form of “Paco,” a Spanish male given name (often a nickname for Francisco). In English, “Pacos” is usually used when referring to multiple people named Paco, or as a family name/proper noun in some contexts.","zh":"“Paco”的复数形式。Paco 是西班牙语男性名字，常作为 Francisco（弗朗西斯科）的昵称。在英语里，“Pacos”多用于指多个名叫 Paco 的人，或作为姓氏/专有名词出现在特定语境中。"},"examples":[{"en":"Two Pacos in our class always get mistaken for each other.","zh":"我们班有两个叫 Paco 的人，总是被认错。"},{"en":"The article mentions the Pacos as key figures in the neighborhood festival.","zh":"文章提到那几位叫 Paco 的人是社区节日的关键人物。"}]}],"synonyms":["Pacoes (rare variant spelling)"],"phonetic":"/ˈpɑːkoʊz/","extraExplanation":["“pacos”不是常见英语词汇，更常见于西班牙语语境（人名的复数）或作为专有名词出现。若你其实想查的是别的词（例如 tacos、pockets、PAX 等），告诉我你看到它的句子/上下文，我可以更准确解释。","Paco 常被视为 Francisco 的昵称，这个昵称的来源有多种民间说法；在学习与使用时，把它当作“常见西语人名/昵称”来理解最稳妥。"]}
{"word":"pacota","summary":{"en":"“Pacota” is usually a proper name, not a common English word.","zh":"“pacota”通常是专有名词（名字/姓氏等），不是英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname, given name, or place/brand name). It is not a standard English vocabulary word with a widely agreed meaning.","zh":"专有名词（姓氏、名字、地名或品牌名）。“pacota”并不是英语里常见、通用的词汇。"},"examples":[{"en":"My coworker’s last name is Pacota.","zh":"我同事的姓是 Pacota。"},{"en":"Pacota appears as a name in some online profiles.","zh":"Pacota 会在一些网络账号/资料里作为名字出现。"}]}],"phonetic":"/pəˈkoʊtə/","extraExplanation":["“pacota”在英语里不常作为普通词使用。如果你是在某个句子、游戏/动漫、或商品标签里看到它，含义往往取决于具体语境（可能是人名、地名、用户名或品牌名）。","也有可能是拼写/听写造成的误差：常见的相近词包括 **pakora**（印度油炸小吃）、或葡语 **pacote**（“包、套餐/套票”）等。如果你把完整句子或来源贴出来，我可以帮你确定最可能的意思。"]}
{"word":"pacouryuva","summary":{"en":"“pacouryuva” isn’t a standard English word; please provide context or the intended spelling.","zh":"“pacouryuva”不是标准英文单词；请提供上下文或确认你想查的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word; likely a misspelling, username, or a word from another language.","zh":"不是常见的英文单词；可能是拼写错误、用户名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “pacouryuva” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“pacouryuva”——你能提供它出现的句子吗？"},{"en":"If you meant a different spelling, I can define it once you confirm the exact word.","zh":"如果你想查的是另一个拼写，确认准确单词后我就能解释它的意思。"}]}],"extraExplanation":["我没有在常见英语词典/语料中找到“pacouryuva”。如果你是想查某个相近拼写，请告诉我：\n1）它出现的上下文句子；\n2）你想表达的意思（比如“parkour 跑酷”？“pachauri/yuva”（人名/组织名）？）；\n3）是否来自某种语言（如印地语、尼泊尔语等）。\n我拿到这些信息后，可以更准确地判断并给出释义与例句。"]}
{"word":"pacquet","summary":{"en":"“Pacquet” is a rare/old spelling of “packet,” meaning a small package (and in modern contexts, a data packet).","zh":"“pacquet”是“packet”的少见/旧式拼写，指小包裹（现代语境也可指网络数据包）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare spelling) A packet: a small package or bundle, often something wrapped and ready to send or carry.","zh":"（非标准/少见拼写）相当于 packet：小包裹；小捆，常指包好便于携带或寄送的东西。"},"examples":[{"en":"She slipped a small pacquet of letters into her bag.","zh":"她把一小包信件塞进了包里。"},{"en":"The shop sold tea in tiny pacquets for travelers.","zh":"那家店把茶叶装成适合旅行者携带的小包出售。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, modern use of packet) A unit of data sent over a computer network.","zh":"（引申为现代 packet 的用法）网络中传输的数据包。"},"examples":[{"en":"Each pacquet (packet) contains part of the video stream.","zh":"每个数据包（packet）都包含视频流的一部分。"},{"en":"If a pacquet is lost, the sound may cut out briefly.","zh":"如果有数据包丢失，声音可能会短暂中断。"}]}],"synonyms":["packet","bundle","parcel","package"],"phonetic":"/ˈpækɪt/","extraExplanation":["“pacquet”在现代英语里几乎不作为标准拼写使用，通常被视为“packet”的旧式/变体拼写，或受法语“paquet”（包裹）影响的写法。正式写作与考试中建议用“packet”。"]}
{"word":"pacs","summary":{"en":"“PACS” most commonly means a medical imaging system for storing and sharing scans; in politics, “PACs” can mean political action committees.","zh":"“PACS”最常见指用于存储与共享医学影像的系统；在政治语境中，“PACs”也可指政治行动委员会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(PACS) Picture Archiving and Communication System: a hospital/clinic computer system used to store, manage, and share medical images (like X-rays, CT, MRI) so doctors can view them digitally.","zh":"（PACS）医学影像存档与通信系统：医院/诊所用来存储、管理并共享医学影像（如X光、CT、MRI）的计算机系统，方便医生数字化查看。"},"examples":[{"en":"The radiology department uses PACS to store and review CT scans.","zh":"放射科使用PACS来存储并查看CT扫描。"},{"en":"With PACS, doctors can open your X-ray on a computer instead of using film.","zh":"有了PACS，医生可以在电脑上打开你的X光片，不必使用胶片。"},{"en":"The images were uploaded to PACS and shared with the specialist.","zh":"影像已上传到PACS并与专科医生共享。"}]},{"partOfSpeech":"n.","definition":{"en":"(PACs) Political action committees: organizations that raise and spend money to support or oppose political candidates and policies.","zh":"（PACs）政治行动委员会：为支持或反对政治候选人及政策而筹款并花费资金的组织。"},"examples":[{"en":"Many PACs donate to candidates during election season.","zh":"在选举季，许多PACs会向候选人捐款。"},{"en":"The report lists how much money PACs spent on advertising.","zh":"报告列出了PACs在广告上花了多少钱。"}]}],"synonyms":["medical imaging system","digital imaging archive","Political Action Committee (PAC)"],"phonetic":"/pæks/","extraExplanation":["“PACS”在医学语境里几乎总是指影像系统（Picture Archiving and Communication System），通常读作一个整体的字母缩写发音（听起来像“packs”）。","在新闻与政治语境里，“PACs”多指政治行动委员会（Political Action Committees）的复数；写作时常见“a PAC / two PACs”。","判断含义的小技巧：若和X-ray/CT/MRI/radiology/scan等词同现，多半是医学PACS；若和election/candidates/donations/campaign等词同现，多半是政治PACs。"]}
{"word":"pact","summary":{"en":"A pact is a serious, formal agreement—often between countries or between people who promise to do something.","zh":"pact 指严肃、正式的协议或约定，常用于国家之间的条约或人们之间郑重的承诺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal agreement between people, groups, or countries, especially one with clear promises or duties.","zh":"（尤指有明确承诺或义务的）正式协议；契约；条约。"},"examples":[{"en":"The two countries signed a defense pact.","zh":"两国签署了防务条约。"},{"en":"They made a pact to keep the plan secret.","zh":"他们立下约定要对计划保密。"}]}],"synonyms":["agreement","treaty","compact","deal"],"phonetic":"/pækt/","extraExplanation":["“pact”常用于比较正式或严肃的场合，尤其是政治、军事、法律语境（如 peace pact 和 defense pact）。日常生活里也可以用来表示“郑重约定”，但语气比“agreement/plan”更强调承诺感。","文学或叙事作品中常见“make a pact (with someone/the devil)”：表示立下强烈、可能带有风险或代价的约定（如“与魔鬼交易/订契约”的意象）。"]}
{"word":"pacta","summary":{"en":"Pacta is a Latin plural noun meaning “pacts/agreements,” most often seen in the legal phrase “pacta sunt servanda.”","zh":"pacta 是拉丁语复数名词，意为“若干份协议/契约”，在英语中最常见于法律短语“pacta sunt servanda（条约必须遵守）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in English mainly in law) “pacts” or “agreements”; the plural of pactum.","zh":"（拉丁语；英语中多用于法律语境）“契约/协议”；为 pactum 的复数，意为“若干份协议/约定”。"},"examples":[{"en":"The phrase “pacta sunt servanda” is a basic principle of international law.","zh":"“pacta sunt servanda（条约必须遵守）”是国际法的一项基本原则。"},{"en":"In the document, the parties listed the pacta they had already accepted.","zh":"在文件中，各方列出了他们已经接受的各项协议（pacta）。"}]}],"synonyms":["pacts","agreements","contracts"],"phonetic":"/ˈpæk.tə/","extraExplanation":["“pacta”在日常英语里几乎不会单独使用，最常见是固定搭配“pacta sunt servanda”，直译为“契约应当被遵守”，强调签订的协议具有约束力。","发音上，英语使用者通常按英语规则读作 /ˈpæk.tə/，并不一定严格还原古典拉丁语读音。","相关词：pact（协议/条约），compact（正式协议），treaty（条约）；相关短语：keep a pact（遵守协议）。"]}
{"word":"paction","summary":{"en":"“Paction” is a rare/formal word meaning an agreement or pact.","zh":"“paction”是较少见、较正式/古语的词，意思是“协议、盟约”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an agreement or contract; a pact (formal or archaic)","zh":"协议；契约；盟约（较正式或古语）"},"examples":[{"en":"They entered into a paction to share profits equally.","zh":"他们订立了一份协议，约定平分利润。"},{"en":"In the old text, the king made a paction with neighboring rulers.","zh":"在那部古文里，国王与邻邦统治者缔结盟约。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making an agreement; negotiating a settlement (rare)","zh":"达成协议的行为；协商解决（罕见用法）"},"examples":[{"en":"After weeks of debate, paction finally brought peace to the region.","zh":"经过数周争论，最终的协议达成给该地区带来了和平。"}]}],"synonyms":["agreement","contract","pact","compact","covenant"],"phonetic":"/ˈpækʃən/","extraExplanation":["“paction”在现代英语中非常少见，多见于历史、法律或文学语境。日常表达通常用“agreement / contract / pact”。","词源来自拉丁语“pactio”（约定、协定），与常见词“pact”（条约、协定）同源。"]}
{"word":"pactional","summary":{"en":"“Pactional” is a rare adjective meaning “related to an agreement or pact; contractual.”","zh":"“pactional”是个较罕见的形容词，意思是“与协议/契约有关的；合同性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Relating to a pact or agreement; contractual.","zh":"（罕见/较正式）与契约、协定有关的；基于协议的。"},"examples":[{"en":"The treaty created pactional obligations for both countries.","zh":"这项条约为两国设立了基于协议的义务。"},{"en":"They settled the dispute through a pactional arrangement rather than a court case.","zh":"他们通过协议性的安排解决了争端，而不是走诉讼程序。"}]}],"synonyms":["contractual","by agreement","agreed-upon","stipulated"],"phonetic":"/ˈpækʃənəl/","extraExplanation":["“pactional”在现代英语里非常少见，多见于较旧的法律/学术语境，用来表示“源于协议（pact/paction）”。日常表达更常用：contractual（合同的）、by agreement（经双方同意）、based on an agreement（基于协议）。","词根提示：pact（协议/条约）来自拉丁语 *pactum*（agreement）。你也可能是在找“fractional（部分的/分数的）”或“partisan（党派的）”，可以告诉我你的上下文我再帮你确认。"]}
{"word":"pactionally","summary":{"en":"“Pactionally” is a very rare word meaning “by agreement; contractually.”","zh":"“pactionally”是非常罕见的词，意思是“以协议方式；按契约/双方约定”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare/archaic) By agreement; in a contractual or mutually agreed way.","zh":"（非常罕见/古旧）以协议方式；按契约或双方同意的方式。"},"examples":[{"en":"The two sides settled the dispute pactionally, without going to court.","zh":"双方以协议方式解决了纠纷，没有上法庭。"},{"en":"Payments were arranged pactionally between the landlord and tenant.","zh":"房东与房客按双方约定安排了付款方式。"}]}],"synonyms":["contractually","by agreement","by mutual consent","consensually","as agreed"],"phonetic":"/ˈpækʃənəli/","extraExplanation":["“pactionally”在现代英语中几乎不用，多半只会在非常旧的文本、法律/契约语境，或扫描/OCR误识别的资料里看到。","词源上可联系拉丁语 *pact-*（agreement/契约），因此语义接近“by agreement / contractually”。","如果你是在日常写作中想表达这个意思，更自然的替代说法有：**by agreement**, **by mutual consent**, **contractually**, **as agreed**。","如果你的原句来自某段材料，也可能是把常见词误写/误读成了它（例如 *practically* 等）；你可以把原句发来，我可以帮你判断最可能的目标词。"]}
{"word":"pactions","summary":{"en":"“Pactions” is the plural of “paction,” meaning a formal agreement or contract (rare today).","zh":"“pactions”是“paction”的复数，意为正式协议或契约（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal agreement or contract (rare/old-fashioned)","zh":"正式的协议；契约（较少见/偏古旧）"},"examples":[{"en":"The two sides entered into a paction to share the profits.","zh":"双方订立了一份契约来分享利润。"},{"en":"In the old record, the paction was written in careful legal language.","zh":"在那份旧档案中，这份协议用非常严谨的法律措辞写成。"}]}],"synonyms":["agreement","contract","pact","accord","covenant"],"phonetic":"/ˈpækʃən/","extraExplanation":["“pactions”通常是名词“paction”的复数形式，但这个词在现代英语里非常少见，更常用的是“agreement / contract / pact”。","词源与拉丁语有关，含义接近“pact（条约、协定）”。如果你是想写“actions（行动）”或“pact（协定）”，也很可能是拼写输入错误。"]}
{"word":"pactolian","summary":{"en":"Pactolian means “of the Pactolus River,” often implying gold-rich or golden in literary writing.","zh":"Pactolian 指“与帕克托罗斯河有关”，常在文学中引申为“含金的、富饶如金的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the Pactolus River (an ancient river in Lydia, in present-day Turkey), especially in literary use suggesting “gold-bearing” or “rich with gold.”","zh":"与帕克托罗斯河（古代吕底亚、今土耳其一带的河流）有关；文学语境中常引申为“含金的、富于黄金的”。"},"examples":[{"en":"In the poem, the king dreams of Pactolian sands that glitter with gold.","zh":"在诗中，国王梦见帕克托罗斯河的沙粒闪烁着金光。"},{"en":"She describes the valley as Pactolian, as if wealth flowed through it.","zh":"她把那片山谷形容为“帕克托罗斯式的”，仿佛财富在其中流淌。"}]}],"synonyms":["golden","gold-bearing","auriferous"],"phonetic":"/pækˈtoʊliən/","extraExplanation":["“Pactolian”来自 Pactolus（帕克托罗斯河）。在希腊神话里，迈达斯王（King Midas）因“点石成金”的诅咒而痛苦，后来在帕克托罗斯河中洗去能力，于是河沙被认为含金；因此英语文学中常用 “Pactolian” 来营造“黄金、富饶、奢华”的意象。","这个词比较书面、诗歌化，现代日常英语里很少用；常见搭配有 Pactolian sands（帕克托罗斯河沙/含金沙）一类。"]}
{"word":"pactolus","summary":{"en":"Pactolus is a legendary river associated with gold and is used to mean a source of great wealth.","zh":"Pactolus 指传说中“带金”的帕克托罗斯河，并可引申为“巨额财富的来源”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient geography) a small river in Lydia (near Sardis, in modern-day Turkey) that was famous in Greek legend for carrying gold dust; often used allusively to mean a rich source of wealth.","zh":"（古代地理）帕克托罗斯河：位于古代吕底亚（今土耳其一带、靠近萨迪斯）的河流，因希腊传说中河沙含金而闻名；在英语中常被典故化用，指“财富的源泉/滚滚财源”。"},"examples":[{"en":"In classical poetry, the Pactolus is a symbol of overflowing riches.","zh":"在古典诗歌里，“帕克托罗斯河”常象征财富滚滚。"},{"en":"The author compared the new trade route to a modern Pactolus for the city.","zh":"作者把这条新贸易路线比作这座城市的“现代帕克托罗斯河”，意指带来巨额财富。"}]}],"synonyms":["source of wealth","fountain of riches","gold-bearing river","cash cow (figurative)"],"phonetic":"/ˈpæk.tə.ləs/","extraExplanation":["“Pactolus（帕克托罗斯河）”常与“迈达斯王（King Midas）”的神话联系：传说迈达斯拥有“点石成金”的能力，后来在河中洗去（或净化）这一能力，使河沙从此带金，因此该河成了“财富”的文学典故。","在英语写作中，这类典故性专名多用于较文学化或修辞性语境；若读者不熟悉古典典故，通常需要上下文提示，否则可能显得生僻。"]}
{"word":"pacts","summary":{"en":"“Pacts” means formal agreements or promises (plural of “pact”), often between groups or countries, sometimes implying a serious or secret deal.","zh":"“pacts”是“pact”的复数，指正式的协议/条约/约定，有时带有严肃或秘密交易的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Formal agreements or promises between people, groups, or countries, often written and meant to be kept.","zh":"（人、团体或国家之间的）正式协议；条约；协定，通常是书面的并应当遵守。"},"examples":[{"en":"The two countries signed a peace pact after years of conflict.","zh":"两国在多年冲突后签署了和平条约。"},{"en":"They made a pact to support each other during the difficult semester.","zh":"他们立下约定，在艰难的学期里互相支持。"}]},{"partOfSpeech":"n.","definition":{"en":"Agreements—often secret or controversial—made for a specific purpose (commonly used in phrases like “a pact with the devil”).","zh":"（常带神秘或争议色彩的）约定/交易（常见于“与魔鬼订约”等说法）。"},"examples":[{"en":"In the story, the hero makes a pact with a dark power for knowledge.","zh":"在故事里，主角为获得知识与黑暗力量订下契约。"},{"en":"Some critics accused the politician of making a pact with extremists.","zh":"一些批评者指责这位政治人物与极端派达成交易。"}]}],"synonyms":["agreements","treaties","accords","deals","compacts"],"phonetic":"/pækts/","extraExplanation":["“pacts”是“pact”的复数形式。单数pact常见搭配：make a pact（订约/立誓）、sign a pact（签署条约）、enter into a pact（达成协定）。","语体上，pact比agreement更正式、更“庄重”，常用于政治、外交、军事（如defense pact 防务条约）。在文学或影视中，pact也常用于“以交换为代价的契约”这一母题。"]}
{"word":"pactum","summary":{"en":"“Pactum” is a legal Latin word meaning an agreement or pact, mainly used in Roman-law or scholarly legal contexts.","zh":"“pactum”是法律拉丁语用词，指协议或契约，主要用于罗马法或学术/法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, from Latin) An agreement or pact, especially in Roman law or legal Latin; a promise that may or may not be enforceable depending on the legal system.","zh":"（法律，源自拉丁语）协议／契约，尤指罗马法或法律拉丁语中的“约定”；在不同法律体系下，可能具有或不具有可强制执行力。"},"examples":[{"en":"In Roman-law writing, a pactum could be a simple agreement without all the formalities of a contract.","zh":"在罗马法著作中，pactum 可以指一种较简单的约定，不一定具备合同的全部形式要件。"},{"en":"The judge discussed whether the parties’ pactum created enforceable obligations.","zh":"法官讨论了当事人的 pactum 是否产生可强制执行的义务。"}]}],"synonyms":["pact","agreement","compact","contract"],"phonetic":"/ˈpæk.təm/","extraExplanation":["“pactum”是拉丁语词，在英语中多见于法学语境（如论文、判例引用或民法传统的比较法讨论），日常英语里很少单独使用；一般英语更常用 pact / agreement / contract。","在罗马法传统里，常会区分 pactum（约定）与 contractus（更严格意义上的合同）。不同历史时期与法域对“是否可诉/可执行”的标准不一样，因此你会看到它与“可执行性（enforceability）”一起被讨论。","相关拉丁法谚：pacta sunt servanda（协议必须遵守/契约应当被履行），常用于国际法与合同法的原则性表述。"]}
{"word":"pacu","summary":{"en":"A pacu is a South American freshwater fish that resembles a piranha but is usually more plant-eating.","zh":"pacu 指一种南美淡水鱼，外形像食人鱼但通常更偏草食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American freshwater fish (genus *Piaractus* and related genera), similar to a piranha but usually more plant-eating; often kept in aquariums and also eaten as food.","zh":"一种南美洲淡水鱼（常指帕库鱼，属名 *Piaractus* 等），外形像食人鱼但通常更偏草食；常见于观赏鱼缸，也可食用。"},"examples":[{"en":"The pacu looks like a piranha, but it usually eats fruit and seeds.","zh":"帕库鱼看起来像食人鱼，但通常吃水果和种子。"},{"en":"Some aquariums keep pacu because they grow large and are interesting to watch.","zh":"一些水族馆饲养帕库鱼，因为它们会长得很大，观赏性强。"},{"en":"Pacu is served grilled in parts of the Amazon region.","zh":"在亚马孙地区的一些地方，帕库鱼会被烤着吃。"}]}],"synonyms":["South American characin (general group)","piranha look-alike (informal)"],"phonetic":"/ˈpɑːkuː/","extraExplanation":["“pacu”一词常见于英语的渔业、南美饮食与水族圈语境，来源于南美原住民语言（经葡萄牙语/西班牙语传播）对这类鱼的称呼。","学习提醒：pacu 幼鱼在水族店可能看起来不大，但成鱼体型可明显变大；在英语里也常见到复数直接用 pacu（如：two pacu）。"]}
