{"word":"pad","summary":{"en":"“Pad” most often means a soft cushion/protective piece, a writing paper pad, or (in context) a sanitary pad; as a verb it can mean to add padding, to walk softly, or to “pad” text with extra details.","zh":"“pad”最常见是“垫子/护垫”，也可指“便笺本/拍纸本”或“卫生巾”；作动词可表示“加垫填充”“轻轻走”，也可非正式地指“凑字数/注水”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft piece of material used for protection, comfort, or cleaning","zh":"（柔软的）垫子；护垫；（用于保护、舒适或清洁的）软垫/擦拭垫"},"examples":[{"en":"She put a pad on the chair to make it more comfortable.","zh":"她在椅子上放了个垫子，让它更舒服。"},{"en":"Wear knee pads when you skate.","zh":"滑冰时要戴护膝。"}]},{"partOfSpeech":"n.","definition":{"en":"a thick block of paper sheets used for writing or drawing","zh":"（写字或画画用的）便笺本；拍纸本"},"examples":[{"en":"I keep a notepad on my desk for quick notes.","zh":"我在桌上放一本便笺本，方便随手记。"},{"en":"He bought a sketch pad for art class.","zh":"他买了一个素描本上美术课。"}]},{"partOfSpeech":"n.","definition":{"en":"a sanitary product used to absorb menstrual flow (also called a sanitary pad)","zh":"（女性）卫生巾（也可说 sanitary pad）"},"examples":[{"en":"She bought pads at the pharmacy.","zh":"她在药店买了卫生巾。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add soft material to something to make it thicker, safer, or more comfortable","zh":"给……加垫；把……垫厚（使更安全/更舒适）"},"examples":[{"en":"They padded the package with bubble wrap.","zh":"他们用气泡膜把包裹垫好防震。"},{"en":"The jacket is padded to keep you warm.","zh":"这件夹克有填充物，用来保暖。"}]},{"partOfSpeech":"vi.","definition":{"en":"to walk softly and quietly","zh":"（轻轻地）走；悄悄地走"},"examples":[{"en":"The cat padded across the floor.","zh":"猫轻轻地走过地板。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something longer or larger by adding extra, often unnecessary details (informal)","zh":"（非正式）给内容“注水”；用多余细节把……拉长/扩充"},"examples":[{"en":"He padded his essay with extra quotes to reach the word limit.","zh":"他在作文里加了很多引文来凑字数。"}]}],"synonyms":["cushion","notepad","padding","protective pad","stuff (with padding)"],"phonetic":"/pæd/","extraExplanation":["“pad”作名词非常常见，意思会因语境变化很大：cushion/护具/便笺本/卫生巾都可能。口语里如果没有上下文，最好说清楚：notepad（便笺本）、sanitary pad（卫生巾）、knee pad（护膝）。","作动词时，“pad”既可以表示“加垫/填充”（padded jacket, padded envelope），也可以表示动物或人“轻轻地走”（常用于猫、狗等：The cat padded in）。","“pad”表示“凑字数/注水”多用于写作或报销等情境（pad an essay / pad the bill），带一点负面含义：暗示不必要或不诚实的添加。"]}
{"word":"padal","summary":{"en":"“Padal” is not a standard English word; it is most likely a misspelling of “pedal,” meaning a foot-operated lever or the action of riding by pushing pedals.","zh":"“padal”不是常见英语单词；最可能是“pedal”的拼写错误，意思是“踏板”或“踩踏板骑行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A foot-operated lever used to control or power a machine (especially on a bicycle, piano, or car).","zh":"（踏板）用脚踩来控制或驱动机器的杠杆装置（尤指自行车、钢琴或汽车上的踏板）。"},"examples":[{"en":"Press the brake pedal slowly.","zh":"慢慢踩下刹车踏板。"},{"en":"The bike pedal is loose.","zh":"自行车踏板松了。"},{"en":"She practiced the piano pedals to make the sound smoother.","zh":"她练习钢琴的踏板，让声音更连贯。"}]},{"partOfSpeech":"v.","definition":{"en":"To move a bicycle forward by pushing the pedals with your feet.","zh":"踩踏板骑行；用脚蹬车前进。"},"examples":[{"en":"He pedaled up the hill.","zh":"他踩着踏板骑上了山坡。"},{"en":"She pedaled to school every day.","zh":"她每天骑车去上学。"}]}],"synonyms":["treadle","cycle"],"phonetic":"/ˈpɛdəl/","extraExplanation":["“padal”在英语里不是常见标准拼写，最可能是把“pedal（踏板/踩踏板）”拼错了。","易混词：pedal（踏板；踩踏板） vs. paddle（桨；用桨划）。骑自行车用 pedal；划船/玩皮划艇用 paddle。"]}
{"word":"padang","summary":{"en":"Padang is a city in West Sumatra, Indonesia, and it also refers to the famous Padang/Minangkabau style of cuisine.","zh":"Padang指印度尼西亚西苏门答腊的城市“巴东”，也常指著名的巴东/米南加保菜系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city on the west coast of Sumatra, Indonesia (the capital of West Sumatra).","zh":"巴东（印度尼西亚苏门答腊西海岸城市，西苏门答腊省省会）。"},"examples":[{"en":"I flew to Padang and then took a bus to Bukittinggi.","zh":"我飞到巴东，然后坐巴士去武吉丁宜。"},{"en":"Padang is known as a gateway to the Mentawai Islands.","zh":"巴东被认为是通往明打威群岛的门户。"}]},{"partOfSpeech":"n.","definition":{"en":"the style of food associated with Padang/Minangkabau people, often served as many small dishes (sometimes called “Padang food” or “Padang cuisine”).","zh":"巴东菜（与巴东/米南加保人相关的菜系，常以许多小盘菜一起上桌的方式供应）。"},"examples":[{"en":"Let’s get Padang food—rendang and spicy vegetables.","zh":"我们去吃巴东菜吧——仁当牛肉和辣味蔬菜。"},{"en":"In a Padang restaurant, you choose from many dishes displayed at the front.","zh":"在巴东餐馆里，你可以从前台陈列的许多菜中挑选。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Padang or its people/culture (often used before a noun).","zh":"与巴东（城市/文化）有关的；巴东的（常作定语）。"},"examples":[{"en":"We visited a Padang restaurant in Jakarta.","zh":"我们在雅加达去了一家巴东餐馆。"},{"en":"She enjoys Padang music and dance from West Sumatra.","zh":"她喜欢来自西苏门答腊的巴东音乐和舞蹈。"}]}],"synonyms":["Minangkabau cuisine","Padang food","Padang cuisine"],"phonetic":"/pɑˈdɑŋ/","extraExplanation":["“Padang”常与“米南加保（Minangkabau）文化/饮食”一起出现：许多所谓“巴东菜”其实是米南加保菜系的代表。典型菜包括rendang（仁当牛肉）、sambal（辣椒酱）、curry类菜肴等。","在英语中，Padang多作为专有名词（城市名）使用；谈到食物时，常见表达有“Padang food / Padang cuisine / a Padang restaurant”。"]}
{"word":"padasha","summary":{"en":"“Padasha” is usually a nonstandard spelling of “padishah/padshah,” meaning an emperor or supreme ruler in historical Islamic contexts.","zh":"“padasha”通常是“padishah/padshah”的非标准拼写，指历史伊斯兰语境中的皇帝或至高统治者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling/variant) A high-ranking ruler or noble in parts of the Islamic world; especially an emperor or sovereign (often spelled “padishah” or “padshah”).","zh":"（常见拼写变体/误拼）伊斯兰世界部分地区的高级统治者或贵族；尤指皇帝、君主（常拼作 padishah 或 padshah）。"},"examples":[{"en":"In the novel, the padasha ruled from a vast palace and commanded great loyalty.","zh":"在小说里，这位“padasha”从宏大的宫殿统治国家，并获得极高的忠诚。"},{"en":"Some English texts use “padishah” instead of “padasha.”","zh":"一些英文文本会用“padishah”而不是“padasha”。"}]}],"synonyms":["padishah","padshah","emperor","sovereign","monarch"],"phonetic":"/ˈpɑːdɪʃɑː/","extraExplanation":["“padasha”在英语里并不算标准拼写；你更常见到的是 **padishah / padshah**（多用于指波斯语、莫卧儿帝国、奥斯曼语境中的“皇帝/至高君主”）。","如果你其实想表达的是 **pasha**（奥斯曼帝国的高级官衔/总督/将军一类），拼写和含义会不同；你可以告诉我你在哪个句子或语境里看到它，我可以帮你确认。"]}
{"word":"padauk","summary":{"en":"Padauk is a reddish tropical hardwood widely used in woodworking and instruments, and it often darkens with age.","zh":"Padauk 指一种常见的红色热带硬木（木工用材），颜色醒目但会随时间加深。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of tropical hardwood (from several Pterocarpus tree species) known for its bright reddish-orange color that often darkens over time; commonly used for furniture, flooring, instruments, and decorative woodworking.","zh":"紫檀木（此处多指“非洲紫檀/缅甸紫檀”等红木类的英文俗称，来自紫檀属等树种的一类热带硬木），颜色常呈鲜艳的橘红至深红，时间久了会变深；常用于家具、地板、乐器和装饰性木工。"},"examples":[{"en":"The guitar’s body is made of padauk, which gives it a warm, reddish look.","zh":"这把吉他的琴身用的是 padauk（紫檀木），呈现出温暖的红色外观。"},{"en":"Padauk can darken with age, so the finish you choose matters.","zh":"padauk 会随着时间变深，所以选择什么样的表面处理很重要。"},{"en":"Many woodworkers like padauk for its color and stability.","zh":"很多木工喜欢 padauk，因为它颜色漂亮、材质也相对稳定。"}]}],"synonyms":["African padauk","Burmese padauk","Pterocarpus wood"],"phonetic":"/pəˈdɔk/","extraExplanation":["“Padauk”在木工圈非常常见，但中文里常被笼统翻成“紫檀”。需要注意：它并不等同于传统意义上的“紫檀（sandalwood/rosewood 类）”，而是多指紫檀属（Pterocarpus）的一些树种，例如非洲 padauk（Pterocarpus soyauxii）或缅甸 padauk（Pterocarpus macrocarpus）。","发音上也常见拼写变体：padauk / padouk；在不同地区读法略有差异，但学习者记住常见的英语读法即可。","文化与用途：因颜色醒目，padauk 常用于点缀（inlay）、高对比配色的家具设计，或乐器背侧板；不过暴露在光照下颜色会逐渐从橘红转为偏棕红，这是选材时常被讨论的特点。"]}
{"word":"padauks","summary":{"en":"Padauks are tropical hardwoods (or the trees) prized for vivid reddish color and durability.","zh":"padauks 指热带硬木（或其树木），因鲜艳的红色与耐用性而受重视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Padauks (plural of padauk): a tropical hardwood (or the tree that produces it), known for its bright reddish-orange color that can darken to a deep brown over time.","zh":"padauks（padauk 的复数）：一种热带硬木（或产这种木材的树），以鲜艳的橙红色著称，时间久了颜色可能加深为深棕色。"},"examples":[{"en":"The workshop stocks several padauks for turning and carving projects.","zh":"这家工坊备有几种 padauk 木料，用于车木和雕刻项目。"},{"en":"Padauks are popular for guitar bodies because the wood is hard and visually striking.","zh":"padauk 常用于吉他琴身，因为木材坚硬、外观醒目。"}]}],"synonyms":["padauk","paduak","padauk wood"],"phonetic":"/pəˈdɔk/","extraExplanation":["“padauk”常见于木工与乐器制作语境；复数写作“padauks”。有时也会看到拼写变体“paduak”。","这种木材刚加工时常呈橙红或红褐色，随着光照与氧化会逐渐变暗；因此成品颜色可能与新切面不同。","不同产地的“padauk”可能来自不同树种（如非洲 padauk、缅甸 padauk 等），在硬度、纹理与颜色上会略有差异。"]}
{"word":"Padaung","summary":{"en":"Padaung refers to a Kayan (Karenni) ethnic group from Myanmar/Thailand, and also means ‘related to’ that people or culture.","zh":"Padaung 指缅甸/泰国一支克耶（Kayan，卡伦尼）族群（巴东族），也可作形容词表示“巴东族的、与其文化相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Kayan (Karenni) ethnic group originally from Myanmar and now also living in northern Thailand, known in popular media for some women wearing stacked brass neck rings","zh":"巴东族人；克耶（卡伦尼）族群之一，原居缅甸，现也分布于泰国北部；在大众媒体中常因部分女性佩戴层层黄铜颈环而被提及"},"examples":[{"en":"The Padaung are one of several Kayan groups from Myanmar.","zh":"巴东族是来自缅甸的多个克耶（Kayan）族群之一。"},{"en":"Some articles focus on Padaung neck rings, but it’s important to talk about their broader history and culture too.","zh":"有些文章只聚焦巴东族的颈环，但同样重要的是了解他们更广泛的历史与文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Padaung people or their culture","zh":"巴东族的；与巴东族文化相关的"},"examples":[{"en":"We visited a small museum with Padaung textiles on display.","zh":"我们参观了一家小博物馆，里面展出了巴东族的纺织品。"},{"en":"The festival included Padaung music and dance.","zh":"节庆活动包含了巴东族的音乐与舞蹈。"}]}],"synonyms":["Kayan","Kayan Lahwi","Karenni (broader grouping)"],"phonetic":"/pəˈdɔŋ/","extraExplanation":["“Padaung”在英文里常作为外称（exonym）使用；更中性、较常见的自称/学术称呼包括“Kayan”或更具体的分支名称（如Kayan Lahwi等）。在写作或介绍时，可以优先用对方自称，并把“Padaung”作为补充说明。","与颈环相关的报导有时会带有猎奇或刻板印象。更尊重的表达方式是把颈环视为一种传统与身份标记之一，同时也介绍其语言、迁徙历史、手工艺、宗教与日常生活等多方面。"]}
{"word":"padcloth","summary":{"en":"A padcloth is a protective/padding cloth used to shape or protect fabric, especially in tailoring or pressing.","zh":"padcloth 指用于垫衬、保护或塑形的垫布，常见于裁缝或熨烫场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloth used as padding or as a protective layer (for example, in tailoring, upholstery, or when pressing/ironing) to shape fabric and prevent marks.","zh":"（用于裁缝、软装或熨烫时的）垫布/衬垫布；起到缓冲、保护或塑形作用的布。"},"examples":[{"en":"The tailor placed a padcloth under the lapel to shape it neatly.","zh":"裁缝在翻领下面垫了垫布，让它定型得更利落。"},{"en":"Use a padcloth when pressing delicate fabric to avoid shine marks.","zh":"熨烫娇嫩面料时用垫布，可以避免出现发亮的压痕。"}]}],"synonyms":["pad cloth","pressing cloth","padding cloth","protective cloth"],"phonetic":"/ˈpædˌklɔθ/","extraExplanation":["“padcloth”并不是日常非常常见的单词；更常见的写法是分开写成“pad cloth”。在服装制作语境里，它常与“pressing cloth（熨烫布）”“padding（垫料）”等概念相关：用一层布隔开熨斗与面料，或在特定部位加垫以便塑形。"]}
{"word":"padcluoth","summary":{"en":"Padcloth means a padding cloth, often a cloth placed under a saddle to protect a horse.","zh":"Padcloth 指“垫布”，常指垫在马鞍下保护马背的鞍垫布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloth used as padding, especially a thick cloth placed under a saddle to protect a horse’s back (also called a saddle pad).","zh":"垫布；（尤指）马鞍垫布，用于垫在马鞍下面保护马背（也常叫 saddle pad）。"},"examples":[{"en":"The rider adjusted the padcloth before tightening the saddle.","zh":"骑手在系紧马鞍前先把鞍垫布调整好。"},{"en":"Make sure the padcloth is clean and dry to avoid rubbing the horse’s skin.","zh":"确保鞍垫布干净、干燥，避免磨伤马的皮肤。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of cloth used to add cushioning or protection under or around something.","zh":"（泛指）垫布；用于增加缓冲或保护的布。"},"examples":[{"en":"She folded a padcloth under the box to stop it from sliding.","zh":"她把一块垫布折好垫在箱子下面，防止它滑动。"},{"en":"Wrap the glass in bubble wrap or a padcloth before packing it.","zh":"打包前用气泡膜或垫布把玻璃包起来。"}]}],"synonyms":["saddle pad","padding","pad","protective cloth"],"phonetic":"ˈpædklɔθ","extraExplanation":["你输入的 “padcluoth” 很可能是拼写错误；常见拼法是 **padcloth**（一个词）或 **pad cloth**（两个词）。","这个词更常见于与马术相关的语境；日常英语里，人们更常说 **saddle pad**（马鞍垫）或 **padding**（垫料/缓冲层）。"]}
{"word":"padda","summary":{"en":"A (rare) English noun for the Java sparrow/Java finch, linked to an older genus name.","zh":"英语里较少见的名词，指爪哇禾雀/爪哇雀，与较旧的属名有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tropical finch, especially the Java sparrow (Java finch), sometimes referred to by the older scientific genus name *Padda*.","zh":"一种热带小型雀鸟，尤指爪哇禾雀（又称爪哇雀、Java finch）。英语里有时用较旧的属名 *Padda* 来指它。"},"examples":[{"en":"The pet store had a pair of padda birds with black heads and pink bills.","zh":"宠物店里有一对 padda 鸟，黑色头部、粉色鸟喙。"},{"en":"In older books, the Java sparrow is sometimes listed under the name Padda.","zh":"在较旧的书里，爪哇禾雀有时会被归在 Padda 这个名称下。"}]}],"synonyms":["Java sparrow","Java finch"],"phonetic":"/ˈpɑdə/","extraExplanation":["“padda”在现代英语中不算常用词，更常见的说法是 “Java sparrow” 或 “Java finch”。","分类学上它曾被归入属名 *Padda*（如 *Padda oryzivora*），但现在很多资料改用 *Lonchura oryzivora*；因此你在新旧鸟类书籍里可能会看到不同名称。"]}
{"word":"padded","summary":{"en":"“Padded” most often means “with soft padding,” and it can also be the past form of “pad,” meaning “walk softly” or “add extra unnecessary words.”","zh":"“padded”最常表示“有衬垫的”；也可作动词 pad 的过去式/过去分词，表示“轻轻走”或“用多余内容凑篇幅”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having padding (soft material) inside for comfort, warmth, or protection.","zh":"有衬垫的；加了填充物的（用于舒适、保暖或防护）。"},"examples":[{"en":"She wore a padded jacket because it was freezing outside.","zh":"外面很冷，她穿了一件有衬垫的夹克。"},{"en":"The padded seat is more comfortable on long rides.","zh":"这种有衬垫的座椅长时间乘坐更舒服。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “pad”) To walk softly and quietly, often with light steps.","zh":"（pad 的过去式/过去分词）轻轻地走；悄悄地走（脚步轻）。"},"examples":[{"en":"The cat padded across the floor without making a sound.","zh":"猫悄无声息地从地板上走过去。"},{"en":"He padded into the kitchen in his slippers.","zh":"他穿着拖鞋轻轻走进了厨房。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of “pad”) To add extra, unnecessary words or details to make something seem longer.","zh":"（pad 的过去式/过去分词）用废话充数；加入不必要的内容使篇幅变长。"},"examples":[{"en":"The report was padded with repeated points.","zh":"这份报告用重复的观点来凑篇幅。"},{"en":"Try not to pad your essay—use clear, strong ideas instead.","zh":"写作文尽量别凑字数——用清晰、有力的观点更好。"}]}],"synonyms":["cushioned","quilted","stuffed","padded out","tiptoed","crept"],"phonetic":"/ˈpædɪd/","extraExplanation":["“padded”常见于衣物和装备：padded jacket（棉服/带衬垫外套）、padded bra（有衬垫胸罩）、padded gloves（带衬垫手套）、padded envelope（气泡信封）。","写作里的“pad”带贬义，表示为了达到字数要求而“堆砌内容”；更自然的表达还包括“wordy（啰嗦的）”或“full of filler（充满水分/填充内容）”。"]}
{"word":"padder","summary":{"en":"“Padder” usually means someone or something that adds padding; it can also mean a computing tool that adds padding to data. An older British use refers to a traveler on foot.","zh":"“Padder”通常指加衬垫的人或装置；也可指（计算机）对数据进行“填充/补齐”的工具。较旧的英式用法还可指步行旅人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that adds padding (extra soft material or extra content) to make something thicker, safer, or more comfortable","zh":"加衬垫的人；用于加衬垫的物/工具（把东西变厚、更安全或更舒适）"},"examples":[{"en":"The padder added foam to the chair seat to make it more comfortable.","zh":"加衬垫的人在椅子座面加了泡棉，让它更舒服。"},{"en":"This machine works as a padder for envelopes, filling them with protective material.","zh":"这台机器相当于信封的加衬装置，会往里填充保护材料。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) a tool or program that adds extra characters or bits to data to reach a required length (padding)","zh":"（计算机）填充器；用于给数据补齐长度的工具/程序（添加“填充”字符或位）"},"examples":[{"en":"Use a padder to make every ID exactly 10 characters long.","zh":"用填充器把每个ID补齐到10个字符。"},{"en":"The encryption scheme requires a padder before the data is processed.","zh":"这个加密方案要求在处理数据前先进行填充。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, especially British) a traveler on foot; sometimes used historically for a robber who traveled on foot","zh":"（旧式，尤英式）步行的旅人；历史上有时也指徒步行走的盗匪"},"examples":[{"en":"In older stories, a “padder” might mean a person who traveled long distances on foot.","zh":"在一些旧故事里，“padder”可能指长途步行的人。"},{"en":"The novel uses the word “padder” in an old-fashioned way that feels historical.","zh":"那本小说用“padder”这个词，带有明显的历史旧式风格。"}]}],"synonyms":["paddler (less common in this sense)","padding machine","filler","buffer (computing, related)"],"phonetic":"/ˈpædər/","extraExplanation":["“padder”来自动词 pad（加衬垫、填充）。现代最常见是字面意义：给物品加软垫的人或装置；在计算机语境里，padding 是“补齐长度”的常用术语，因此 padder 也可指执行填充的程序/组件。","第三条“步行者/徒步盗匪”的用法较少见，偏英式或文学/历史语境；日常英语中更常用 walker、hiker，或用更具体的词描述。"]}
{"word":"padders","summary":{"en":"“Padders” usually means people/things that add padding or unnecessary extra content; it can also refer to technical tools that add data padding.","zh":"“padders”通常指添加填充物或给内容“注水”的人/物；在技术语境中也可指用于数据填充的工具/事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “padder”: someone or something that adds extra material or extra content (sometimes unnecessarily) to make something thicker, longer, or seem more impressive.","zh":"“padder”的复数：指给某物加衬垫/填充物的人或物；也可指给内容“注水”、为了显得更长或更厉害而添加多余信息的人。"},"examples":[{"en":"Some essay padders add long quotes just to reach the word count.","zh":"有些作文“注水的人”会加很长的引用，只为了凑字数。"},{"en":"The jacket has shoulder padders to make the shoulders look broader.","zh":"这件外套有垫肩填充物，让肩膀看起来更宽。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing or technical writing, things (or tools) that add “padding” (extra characters/bytes) to data to reach a required length or format.","zh":"在计算机/技术语境中：给数据添加“padding（填充字符/字节）”以满足长度或格式要求的东西（或工具）。"},"examples":[{"en":"Some encryption schemes use padders to fill blocks to a fixed size.","zh":"一些加密方案会用填充器把数据块补到固定大小。"}]}],"synonyms":["fillers","stuffers","inflaters","padding tools"],"phonetic":"/ˈpædɚz/","extraExplanation":["“padders”比较少见，更常见的是“paddler(s)”（划桨/划船的人）或“padding”（填充/注水）本身。如果你想表达“划桨的人”，拼写通常是 paddlers。","口语里把“pad”理解为“往简历/文章里加料”，padder(s) 就带有一点贬义：为了好看或凑数而加不必要的内容。"]}
{"word":"paddies","summary":{"en":"“Paddies” means rice fields (usually flooded) where rice is grown.","zh":"“paddies”指种植水稻的稻田/水田（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rice fields (especially flooded fields) where rice is grown; the plural form of “paddy.”","zh":"稻田；水田（尤指灌水种植水稻的田地）；“paddy”的复数。"},"examples":[{"en":"In many parts of Asia, farmers plant rice seedlings in paddies.","zh":"在亚洲许多地区，农民会在稻田里插秧。"},{"en":"After the rain, the paddies reflected the sky like mirrors.","zh":"雨后，稻田像镜子一样映出天空。"}]}],"synonyms":["rice fields","rice paddies"],"phonetic":"/ˈpædiz/","extraExplanation":["“paddy”常用于英式和美式英语，指“稻田/水田”或“稻米（未碾的稻谷）”。在“paddies”这个形式里，最常见的意思是“稻田（复数）”。","词源上，“paddy”与马来语/泰米尔语等南亚、东南亚语言中表示“稻/稻谷”的词有关，因此在谈到亚洲农业景观、乡村生活或旅行写作时很常出现。"]}
{"word":"padding","summary":{"en":"Padding most commonly means soft cushioning material; it can also mean unnecessary extra words, or extra data added to meet a required length in computing.","zh":"padding最常指软垫/衬垫；也可指写作或讲话中的冗余内容；在计算机领域还指为满足长度要求而添加的填充数据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft material used to make something thicker, safer, or more comfortable (often inside clothing, packaging, or furniture).","zh":"用于让物品更厚、更安全或更舒适的软垫材料（常见于衣物、包装或家具内部）。"},"examples":[{"en":"The jacket has extra padding in the shoulders.","zh":"这件夹克的肩部有额外的垫衬。"},{"en":"Use bubble wrap as padding to protect the glass.","zh":"用气泡膜作填充物来保护玻璃。"},{"en":"The helmet’s padding makes it more comfortable to wear.","zh":"头盔里的衬垫让佩戴更舒适。"}]},{"partOfSpeech":"n.","definition":{"en":"Unnecessary extra content added to make something seem longer or fuller (especially writing or speech).","zh":"为显得更长或更充实而加入的无用内容（尤指写作或讲话）。"},"examples":[{"en":"Your essay has good ideas, but there’s a lot of padding.","zh":"你的作文观点不错，但有不少凑字数的内容。"},{"en":"Try to remove padding and make your email more direct.","zh":"尽量删掉冗余内容，让邮件更直接。"}]},{"partOfSpeech":"n.","definition":{"en":"Extra data added to a message or file to reach a required length or format (used in computing and cryptography).","zh":"为满足规定长度或格式而添加到信息或文件中的额外数据（用于计算机与密码学）。"},"examples":[{"en":"The system adds padding so the encrypted message fits the block size.","zh":"系统会添加填充数据，使加密信息符合分组长度。"},{"en":"Incorrect padding can cause a decoding error.","zh":"填充不正确可能导致解码错误。"}]},{"partOfSpeech":"other","definition":{"en":"The act of making something thicker, safer, or more comfortable by adding soft material.","zh":"通过添加软垫来使物品更厚、更安全或更舒适的行为。"},"examples":[{"en":"Padding around the knees is useful for skating.","zh":"溜冰时膝部加垫很有用。"},{"en":"They focused on padding the seats for long trips.","zh":"他们重点给座椅加垫，以适合长途乘坐。"}]}],"synonyms":["cushioning","stuffing","filler","extra material","buffer","fluff"],"phonetic":"/ˈpædɪŋ/","extraExplanation":["“Padding”在不同语境里含义差别很大：日常最常见的是“软垫/衬垫”；写作里常指“凑字数、灌水”；计算机里则是为满足固定长度而加的“填充数据”。看到搭配词（如 essay/email vs. encrypted/block size）通常就能判断是哪一种。"]}
{"word":"paddings","summary":{"en":"“Paddings” is the plural of “padding,” meaning protective/comfort material, or (less often) unnecessary extra content added to make something longer.","zh":"“paddings”是“padding”的复数，常指用于舒适或防护的衬垫/填充物；也可指（较少见、常带贬义）为拉长而添加的不必要内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft material used to make something more comfortable or to protect it from impact; the thicker parts inside clothing, furniture, or packaging.","zh":"（用于舒适或防护的）衬垫、填充物；衣物、家具或包装中较厚、起缓冲作用的材料。"},"examples":[{"en":"The helmet has extra padding to protect your head.","zh":"这顶头盔有额外的衬垫来保护头部。"},{"en":"I added padding to the chair so it’s more comfortable.","zh":"我给椅子加了衬垫，这样更舒服。"},{"en":"Use padding in the box so the glass won’t break during shipping.","zh":"在箱子里放些填充物，这样玻璃在运输中不容易碎。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of adding extra material, words, or time to make something longer or fuller (often unnecessary).","zh":"（常指不必要地）添加内容/材料/时间，使其变长或更充实；“凑字数/拉长”。"},"examples":[{"en":"The essay felt like padding because many sentences repeated the same idea.","zh":"这篇文章读起来像是在“凑字数”，很多句子反复说同一个意思。"},{"en":"Let’s avoid padding and get to the main point.","zh":"我们别“注水”，直接说重点吧。"}]}],"synonyms":["cushioning","stuffing","filling","liner","extra material","fluff (informal)"],"phonetic":"/ˈpædɪŋz/","extraExplanation":["“paddings”通常是名词padding的复数形式，表示多处/多种衬垫或填充物（如衣服的肩垫、运动护具的护垫、包装填充物）。在服装里也常见到“shoulder padding（垫肩）”。","在写作或表达中，padding带有轻微贬义，指为了显得更长而加入不必要的内容；更中性的说法可以用“additional details（补充细节）”。"]}
{"word":"Paddington","summary":{"en":"Paddington usually refers to the famous fictional bear, or to the London area and its major station.","zh":"Paddington通常指“帕丁顿熊”这位著名虚构角色，或指伦敦的帕丁顿地区及其重要车站。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous fictional bear from Peru who lives in London; the main character of the children’s books by Michael Bond and related films.","zh":"帕丁顿熊：来自秘鲁、住在伦敦的著名虚构小熊；出自迈克尔·邦德的儿童文学作品及其电影改编。"},"examples":[{"en":"Paddington is kind, polite, and always getting into trouble by accident.","zh":"帕丁顿很善良、有礼貌，但常常不小心惹出麻烦。"},{"en":"We watched the movie Paddington with English subtitles.","zh":"我们看了《帕丁顿熊》这部电影，配了英文字幕。"}]},{"partOfSpeech":"n.","definition":{"en":"a district in central London, known especially for Paddington Station (a major railway and subway hub).","zh":"帕丁顿：伦敦市中心的一个地区，尤其以帕丁顿车站（重要铁路与地铁枢纽）而闻名。"},"examples":[{"en":"Let’s meet at Paddington Station at 3 p.m.","zh":"我们下午三点在帕丁顿车站见。"},{"en":"Our hotel is near Paddington, so it’s easy to travel around London.","zh":"我们的酒店在帕丁顿附近，所以在伦敦出行很方便。"}]}],"synonyms":["Paddington Bear","Paddington Station","(London) Paddington"],"phonetic":"/ˈpædɪŋtən/","extraExplanation":["“Paddington Bear（帕丁顿熊）”这个名字来自伦敦的Paddington Station：作者Michael Bond据说在车站附近看到一只被遗弃的泰迪熊，买回家后由此得到灵感。","帕丁顿熊常被视为“移民/新来者”的温柔象征：他带着写有“Please look after this bear. Thank you.”（请照顾这只熊，谢谢。）的标签来到伦敦，被布朗一家收留。这个设定也让作品带有关于善意与包容的文化意味。","在伦敦的Paddington Station外常有帕丁顿熊相关的雕像或纪念点，属于很受欢迎的观光打卡元素。"]}
{"word":"paddle","summary":{"en":"Paddle can mean a boat oar (noun) or the action of moving through water with an oar or your feet (verb). It can also mean a flat bat/tool, such as a ping-pong paddle.","zh":"Paddle既可指“桨”（名词），也可指“用桨划水前进”或“在浅水里戏水”（动词）；还可指“球拍/扁平工具”（如乒乓球拍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short-handled, flat-bladed tool used to move a small boat through water (by pushing against the water)","zh":"（划船用的）短柄桨；桨板（通过拨水推动小船前进的工具）"},"examples":[{"en":"She dipped the paddle into the water and the canoe glided forward.","zh":"她把桨插入水中，小艇便向前滑行。"},{"en":"Bring an extra paddle in case one breaks.","zh":"多带一把桨，以防有一把坏了。"}]},{"partOfSpeech":"v.","definition":{"en":"to move through water by using a paddle; to paddle a canoe, kayak, etc.","zh":"用桨划（水上前进）；划（独木舟、皮划艇等）"},"examples":[{"en":"We paddled across the lake at sunrise.","zh":"我们在日出时划过了湖面。"},{"en":"He learned to paddle a kayak in one afternoon.","zh":"他一个下午就学会了划皮划艇。"}]},{"partOfSpeech":"v.","definition":{"en":"to move your hands or feet in water in a relaxed way, often while standing or sitting near the edge","zh":"（在浅水处）用手脚戏水；踩水玩"},"examples":[{"en":"The children paddled in the shallow water near the beach.","zh":"孩子们在海滩边的浅水里戏水。"}]},{"partOfSpeech":"n.","definition":{"en":"a flat piece used to hit a ball in some sports (for example, table tennis), or a similar flat tool used to stir, mix, or press","zh":"（某些运动的）球拍（如乒乓球拍）；（搅拌、按压用的）扁平工具/板"},"examples":[{"en":"He bought a new ping-pong paddle.","zh":"他买了一副新的乒乓球拍。"},{"en":"Use a wooden paddle to stir the soup.","zh":"用木铲/木板来搅拌汤。"}]}],"synonyms":["oar","row (for boats, related but not identical)","canoe (as a verb in some contexts, less common)","wade (related to shallow-water movement)","bat (sports sense, general)"],"phonetic":"/ˈpædəl/","extraExplanation":["“paddle”既可指名词“桨”，也可作动词“划（船）”。在英式英语里，“paddle”常指在浅水里用脚“戏水/踩水”，而在美式英语中也常用，但“paddle a boat/kayak”更偏“用桨划行”的意思。","文学与叙事中，“paddle”常用来营造安静、缓慢、贴近自然的氛围，例如描写独木舟穿过湖面、桨叶轻拍水声等意象。"]}
{"word":"paddleball","summary":{"en":"Paddleball can mean a paddle-and-ball game, or the paddleball toy with a ball on an elastic string.","zh":"paddleball既可指板式球运动，也可指“球用弹力绳连着拍子”的拍球玩具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a game in which players hit a ball with a small paddle (a short-handled racket), often against a wall or back and forth with another player","zh":"（用短柄球拍击球的）板式球运动；可对墙击打或两人对打"},"examples":[{"en":"We played paddleball at the park after school.","zh":"放学后我们在公园玩了板式球。"},{"en":"You can practice paddleball by hitting the ball against a wall.","zh":"你可以通过对墙击球来练习板式球。"}]},{"partOfSpeech":"n.","definition":{"en":"a paddle and ball toy, usually with a ball attached by an elastic string","zh":"（常见为弹力绳连着球的）拍球玩具；拍球板玩具"},"examples":[{"en":"The souvenir shop sold a paddleball with a bright rubber ball on a string.","zh":"纪念品店卖一种拍球玩具：一颗鲜艳的橡胶球用绳子连在拍子上。"},{"en":"He kept trying to hit the paddleball without missing.","zh":"他一直努力让拍球玩具不掉拍。"}]}],"synonyms":["paddle ball","paddle-and-ball"],"phonetic":"/ˈpædəlˌbɔl/","extraExplanation":["在美式英语里，paddleball既可以指一种“运动”，也可以指常见的“拍球玩具”（球用弹力绳连在拍子上）。根据语境判断：提到park/gym/play a game多半是运动；提到toy/string/souvenir多半是玩具。","相关词：paddle（桨；板式球拍）、paddle tennis（另一种类似的球类运动）、pickleball（匹克球；近年来在美国很流行，器材也用paddle）。"]}
{"word":"paddleboard","summary":{"en":"A paddleboard is a board you stand on and move with a paddle; to paddleboard means to do that sport.","zh":"paddleboard 指用桨划行的立式划桨板；作动词表示进行这项运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, wide board used to stand on and move across water with a paddle (stand-up paddleboarding/SUP).","zh":"立式划桨板；一种又长又宽、可站立在水面上用桨前进的板（常用于SUP运动）。"},"examples":[{"en":"We rented a paddleboard and paddled around the calm lake.","zh":"我们租了一块立式划桨板，在平静的湖面上划了一圈。"},{"en":"Bring a life jacket if you’re going paddleboarding on the ocean.","zh":"如果要去海上玩立式划桨，记得带救生衣。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel on a paddleboard; to do stand-up paddleboarding.","zh":"在立式划桨板上划行；进行立式划桨运动。"},"examples":[{"en":"They paddleboard every weekend when the weather is warm.","zh":"天气暖和时他们每个周末都会玩立式划桨。"},{"en":"I’m still learning how to paddleboard without wobbling.","zh":"我还在学怎么在板上划得更稳、不晃。"}]}],"synonyms":["stand-up paddleboard","SUP board","paddleboarding (the sport)"],"phonetic":"/ˈpædəlˌbɔrd/","extraExplanation":["在英语里更常见的说法是 stand-up paddleboard（板）和 stand-up paddleboarding / SUP（这项运动）。日常口语中也会直接说 paddleboard / paddleboarding。","拼写上也常见作两个词：paddle board；作动词时通常写作 paddleboard（如：to paddleboard）。"]}
{"word":"paddleboat","summary":{"en":"A paddleboat is a boat that moves using paddle wheels, often a small leisure boat you pedal on a lake.","zh":"paddleboat 指用桨轮推进的船，日常多指在湖上踩踏板游玩的脚踏（明轮）船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small boat moved by paddle wheels (often rented for leisure on a lake or in a park)","zh":"明轮船；脚踏（或电动）桨轮船（常用于湖泊、公园的休闲游玩）"},"examples":[{"en":"We rented a paddleboat and went around the lake for an hour.","zh":"我们租了一艘脚踏船，在湖上转了一个小时。"},{"en":"The kids took turns pedaling the paddleboat.","zh":"孩子们轮流踩踏板来驱动脚踏船。"}]}],"synonyms":["pedal boat","paddle boat"],"phonetic":"/ˈpædəlˌboʊt/","extraExplanation":["在美式英语里，paddleboat 常指公园或湖上租用的“脚踏船/明轮船”，通常由人踩踏板带动两侧的桨轮。它也可泛指带明轮的大型船（如早期蒸汽明轮船），但日常口语里更常见的是休闲用的小船。","相关词：paddle boat（两词写法也常见）；pedal boat（更强调“脚踏”）；rowboat（用船桨划的，不是桨轮）。"]}
{"word":"paddlecock","summary":{"en":"A paddlecock is a shuttlecock used in badminton; it can also mean an old paddle-and-shuttlecock game.","zh":"paddlecock 指羽毛球（羽毛球运动用球）；也可指一种较旧的用小拍击打羽毛球的游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shuttlecock used in the sport of badminton (a small cork with feathers or a plastic skirt).","zh":"（羽毛球运动中的）羽毛球（球头多为软木，带羽毛或塑料裙边）。"},"examples":[{"en":"He served the paddlecock high over the net.","zh":"他把羽毛球高高发过网。"},{"en":"The paddlecock fell just inside the back line.","zh":"羽毛球刚好落在底线内。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) A game in which people hit a shuttlecock back and forth with small paddles.","zh":"（较旧用法）板羽毛球游戏：用小拍把羽毛球来回击打的游戏。"},"examples":[{"en":"In the novel, the children played paddlecock in the garden.","zh":"在小说里，孩子们在花园里玩板羽毛球游戏。"}]}],"synonyms":["shuttlecock"],"phonetic":"/ˈpædəlˌkɑk/","extraExplanation":["“paddlecock”在现代英语里多被“shuttlecock”取代；在日常语境里，说羽毛球运动时更常用“shuttlecock”（球）和“badminton racket”（球拍）。","词源上由“paddle（小拍子）+ cock（公鸡）”构成，早期的羽毛球常用羽毛制作，可能让人联想到鸡羽。"]}
{"word":"paddled","summary":{"en":"“Paddled” means moved a boat with a paddle, splashed/moved through water with hands or feet, or (less commonly) hit someone with a paddle as punishment.","zh":"“paddled”指用桨划船、用手脚在水里拍打/蹚水前进，或（较少见）用拍板打人作为惩罚。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “paddle”: to move a small boat by pushing water with a paddle (oar-like tool).","zh":"“paddle”的过去式/过去分词：用桨划水来推动小船前进。"},"examples":[{"en":"We paddled across the lake before sunset.","zh":"日落前我们划桨穿过了湖面。"},{"en":"They had paddled for hours and were exhausted.","zh":"他们划了好几个小时，已经筋疲力尽了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “paddle”: to move through water by using your hands/feet (or to walk with short steps, often through shallow water).","zh":"“paddle”的过去式/过去分词：用手脚在水里拍打前进；或（常指在浅水中）小步蹚水走。"},"examples":[{"en":"The kids paddled in the shallows near the beach.","zh":"孩子们在海滩附近的浅水区玩水。"},{"en":"She paddled her feet in the stream to cool off.","zh":"她把脚在小溪里拨动，凉快一下。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “paddle”: to hit someone with a flat piece of wood (a paddle), usually as punishment (less common today).","zh":"“paddle”的过去式/过去分词：用木板（拍板）打人，通常作为惩罚（如今较少见）。"},"examples":[{"en":"In the story, the student was paddled for breaking the rules.","zh":"在故事里，那名学生因违反规定被打了板子。"},{"en":"Many schools have banned paddling as a punishment.","zh":"许多学校已禁止用打板子的方式惩罚学生。"}]}],"synonyms":["rowed","canoed","splashed","waded","spanked"],"phonetic":"/ˈpæd(ə)ld/","extraExplanation":["“paddled”常见于叙述过去发生的动作（一般过去时）或完成时/被动结构（过去分词）：We paddled… / We have paddled… / He was paddled…","在美国文化语境中，paddling 也可指某些学校或家庭过去使用的体罚方式；如今在很多地区已被禁止或不被接受。"]}
{"word":"paddlefish","summary":{"en":"A North American freshwater fish with a long paddle-shaped snout.","zh":"一种北美淡水鱼，特征是长而扁平的“桨状”吻部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large freshwater fish with a long, flat, paddle-shaped snout, found mainly in North America and valued for its roe (eggs).","zh":"匙吻鲟（或称“桨鱼”）：一种大型淡水鱼，吻部长而扁平像桨，主要分布在北美，因鱼卵（常做鱼子酱）而有经济价值。"},"examples":[{"en":"Paddlefish live in big rivers like the Mississippi and feed mostly on tiny organisms in the water.","zh":"匙吻鲟生活在密西西比河等大河里，主要以水中的微小生物为食。"},{"en":"Some states limit paddlefish fishing to protect wild populations.","zh":"一些州限制捕捞匙吻鲟，以保护野生种群。"}]}],"synonyms":["American paddlefish","spoonbill (fish)"],"phonetic":"/ˈpæd(ə)lˌfɪʃ/","extraExplanation":["“paddlefish”由paddle（桨）+ fish（鱼）组成，名字来自它非常显眼的“桨状吻”。","它不是“paddle（用桨划）+ fish（钓鱼）”的动作短语，而是一个具体的鱼类名称。","在美国文化语境里，paddlefish常与大型河流生态、渔业管理，以及鱼卵（roe / caviar）相关。"]}
{"word":"paddlefishes","summary":{"en":"Paddlefishes are large freshwater fish (plural) with a distinctive paddle-shaped snout.","zh":"paddlefishes 指“匙吻鲟”（复数），一种吻部像桨/匙的大型淡水鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of large freshwater fish (plural), known for its long, flat, paddle-shaped snout; paddlefishes are related to sturgeons and are found mainly in North America and China.","zh":"匙吻鲟（复数）：一种大型淡水鱼，因其又长又扁、像“桨/匙”一样的吻部而得名；与鲟鱼近缘，主要分布在北美和中国。"},"examples":[{"en":"Paddlefishes use their long snouts to help sense tiny prey in the water.","zh":"匙吻鲟用它们长长的吻部来帮助感知水中的微小猎物。"},{"en":"In some rivers, paddlefishes are protected because their numbers have declined.","zh":"在一些河流里，匙吻鲟受到保护，因为它们的数量减少了。"},{"en":"The aquarium’s exhibit explains how paddlefishes filter-feed on plankton.","zh":"水族馆的展区解释了匙吻鲟如何通过滤食来吃浮游生物。"}]}],"synonyms":["paddlefish"],"phonetic":"/ˈpædəlˌfɪʃɪz/","extraExplanation":["“paddlefish”的复数是“paddlefishes”（也常见复数形式“paddlefish”，两者都对；在日常表达中“paddlefish”更常用作复数）。","词源很直观：paddle（桨）+ fish（鱼），指它们像桨一样的吻部（snout/rostrum）。","常见物种包括北美的American paddlefish（美洲匙吻鲟）以及中国的Chinese paddlefish（白鲟，已被宣布灭绝）。"]}
{"word":"paddlefoot","summary":{"en":"“Paddlefoot” is mainly an old-fashioned slang word for a police officer; it can also mean someone with very large feet.","zh":"“paddlefoot”主要是（略旧的）俚语，指警察；也可指脚很大的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, sometimes old-fashioned) A police officer; a cop.","zh":"（俚语，略旧）警察；警官。"},"examples":[{"en":"The kids ran when they saw a paddlefoot coming down the street.","zh":"孩子们看见有个警察顺着街走来，就赶紧跑开了。"},{"en":"It’s an old movie—everyone calls the cops “paddlefoots.”","zh":"那是一部老电影——里面大家都把警察叫“paddlefoots”。"}]},{"partOfSpeech":"n.","definition":{"en":"A person with very large or broad feet (a nickname or humorous description).","zh":"脚很大或很宽的人（绰号或幽默说法）。"},"examples":[{"en":"My brother’s a real paddlefoot—he wears size 13 shoes.","zh":"我弟弟脚真大——他穿 13 码的鞋。"}]}],"synonyms":["cop","police officer","flatfoot","fuzz (slang)"],"phonetic":"/ˈpædəlˌfʊt/","extraExplanation":["“paddlefoot”在美式英语里常被当作对警察的俚语称呼，语气可能带点戏谑或轻蔑，常见于老电影/侦探小说。它和更常见的俚语“flatfoot”很接近，通常被解释为指警察走路巡逻多、脚步重，或指早期警察穿的鞋底较厚、脚掌看起来更“宽大”。在正式场合不建议使用。"]}
{"word":"paddlelike","summary":{"en":"“Paddlelike” means shaped like a paddle—broad and flat, often widening at one end.","zh":"“paddlelike”表示“桨状的”，形状宽而扁，常在一端变宽。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a paddle: broad and flat, often widening at the end.","zh":"桨状的；像桨一样的：宽而扁，常在末端变宽。"},"examples":[{"en":"The turtle has paddlelike flippers that help it swim long distances.","zh":"海龟有桨状的鳍，帮助它长距离游泳。"},{"en":"The plant has paddlelike leaves—wide, flat, and easy to spot.","zh":"这种植物的叶子呈桨状——又宽又扁，很容易辨认。"},{"en":"Engineers tested a paddlelike blade design to move more water with each turn.","zh":"工程师测试了一种桨状叶片设计，让每次转动能推动更多水。"}]}],"synonyms":["paddle-shaped","spatulate","blade-like"],"phonetic":"/ˈpædəlˌlaɪk/","extraExplanation":["这是由“paddle（桨）+ -like（像……的）”组成的复合形容词，常用于生物学、医学或工程等语境，描述形状特征。","写作中也常用连字符形式“paddle-like”，两种拼写都能见到；作定语时用来让读者快速想象“宽扁、像桨”的外形。"]}
{"word":"paddler","summary":{"en":"A paddler is someone who uses a paddle to move a small boat, often as a sport or hobby.","zh":"paddler 指用桨划动小船的人，常见于运动或休闲划桨活动中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who moves a small boat (such as a canoe or kayak) using a paddle.","zh":"用桨划动小船（如独木舟、皮划艇等）的人。"},"examples":[{"en":"The paddler glided quietly across the lake in a kayak.","zh":"那位划手坐在皮划艇里，安静地从湖面滑过。"},{"en":"Wearing a life jacket is important for every paddler.","zh":"对每一位划手来说，穿救生衣都很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who takes part in paddle sports or paddling as a hobby or activity.","zh":"从事划桨运动、把划桨当作爱好的人。"},"examples":[{"en":"She’s a weekend paddler who loves exploring slow rivers.","zh":"她是周末划手，喜欢探索水流缓慢的河道。"},{"en":"Many paddlers join local clubs to learn safety and technique.","zh":"很多划手会加入当地俱乐部，学习安全知识和技巧。"}]}],"synonyms":["kayaker","canoeist","paddleboarder"],"phonetic":"/ˈpæd(ə)lɚ/","extraExplanation":["“paddler”来自“paddle（桨；用桨划）+ -er（做某事的人）”。在北美语境里，它常见于户外运动（canoeing/ kayaking/ stand-up paddleboarding 等）中。","近义表达可按情境选择：更口语/泛指可说“boater（泛指划船/驾船的人）”；更强调比赛或技巧时常用“kayaker（皮划艇运动员/划手）”“canoeist（独木舟划手）”。"]}
{"word":"paddlers","summary":{"en":"“Paddlers” means people who move a small boat with a paddle, or people who paddle in shallow water.","zh":"“paddlers”指用桨划小船的人，也可指在浅水中用脚划水、戏水的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who move a canoe, kayak, paddleboard, or similar small boat using a paddle.","zh":"使用桨来划独木舟、皮划艇、立式桨板等小船的人；划桨者。"},"examples":[{"en":"The paddlers crossed the lake before sunset.","zh":"划桨者们在日落前穿过了湖面。"},{"en":"Skilled paddlers can steer quickly through narrow channels.","zh":"熟练的划桨者能在狭窄水道里快速转向。"},{"en":"The guide gave the paddlers a short safety talk.","zh":"向导给划桨者们做了简短的安全说明。"}]},{"partOfSpeech":"n.","definition":{"en":"People who paddle (kick their legs) in shallow water, often to play or cool off.","zh":"（在浅水中）用脚划水、戏水的人。"},"examples":[{"en":"There were paddlers along the edge of the beach.","zh":"海滩边缘有一些在浅水里戏水的人。"},{"en":"The kids became happy paddlers as soon as they reached the water.","zh":"孩子们一到水边就开心地在浅水里划水玩。"}]}],"synonyms":["canoeists","kayakers","rowers (not exact)","boaters"],"phonetic":"/ˈpæd(ə)lərz/","extraExplanation":["“paddlers”是复数形式；单数是“paddler”。它来自动词“paddle”（用桨划/在水里划动）。","在户外运动语境里，“paddlers”最常指皮划艇/独木舟/桨板运动的人；在海边或浅水区，也可指“戏水的人”，需根据上下文判断。"]}
{"word":"paddles","summary":{"en":"“Paddles” can mean multiple paddles (for boats or ping-pong), or it can be the verb form meaning “moves/splashes through water.”","zh":"“paddles”既可指多把桨/球拍（如划船桨、乒乓球拍），也可作动词，表示“用桨划行”或“在浅水中戏水/涉水”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Short, flat tools used to push through water (for a canoe/kayak) or to hit a ball (especially in table tennis).","zh":"（名词复数）用来在水中划行的短桨（如独木舟/皮划艇用），或用来击球的球拍（尤指乒乓球拍）。"},"examples":[{"en":"We forgot the paddles, so we couldn’t take the kayak out.","zh":"我们忘了带桨，所以没法把皮划艇划出去。"},{"en":"Bring your paddles—let’s play ping-pong after dinner.","zh":"带上球拍——晚饭后我们打乒乓球吧。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present) Third-person singular of “paddle”: to move through water using a paddle; or to kick/splash through shallow water.","zh":"（动词现在时）“paddle”的第三人称单数：用桨划水前进；或在浅水中用脚踢水、涉水（常带“戏水”的感觉）。"},"examples":[{"en":"She paddles the canoe steadily across the lake.","zh":"她稳稳地划着独木舟穿过湖面。"},{"en":"The kids paddles in the stream near the bank.","zh":"孩子们在河岸附近的小溪里戏水。"}]}],"synonyms":["oars","boat paddles","ping-pong paddles","table tennis paddles","rows (for boats)","splashes (in water)"],"phonetic":"/ˈpædəlz/","extraExplanation":["“paddle”和“oar”常被混用，但有区别：paddle（桨）通常不固定在船上，用双手握着划（如独木舟、皮划艇）；oar（橹/桨）一般固定在船舷的桨架上，以杠杆方式划（常见于划艇、赛艇）。","在美式英语里，乒乓球拍更常说“paddle”，而网球拍通常是“racket”。"]}
{"word":"paddlewood","summary":{"en":"“Paddlewood” usually means wood used to make paddles; less commonly it can be a local name for a tree that provides such wood.","zh":"“paddlewood”通常指制作船桨/划桨用的木材；较少见时也可作某些产此类木材树种的地方俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood used for making paddles (for boats, canoes, or paddles used in sports), or a piece of wood shaped for that purpose.","zh":"用来制作船桨/划桨（如独木舟桨、船桨或运动用桨）的木材；也可指做成桨状的木制品。"},"examples":[{"en":"The canoe club prefers light, strong paddlewood for long trips.","zh":"独木舟俱乐部长途出行更喜欢轻而结实的桨木。"},{"en":"He carved a simple paddle from a block of paddlewood.","zh":"他用一块桨木雕了一把简单的船桨。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A tree or timber source known locally for producing wood suitable for paddles.","zh":"（较少见）在某些地区的俗称：指一种以适合做船桨的木材而闻名的树或木材来源。"},"examples":[{"en":"In some regions, the local “paddlewood” was traditionally used to make river paddles.","zh":"在一些地区，当地所谓的“桨木树”传统上用来制作河上用的船桨。"}]}],"synonyms":["wood for paddles","timber","paddle timber"],"phonetic":"/ˈpædəlˌwʊd/","extraExplanation":["“paddlewood”不是非常常见的标准词，更多时候是描述性用法（paddle + wood），表示“做桨的木料”。在不同国家/地区，它也可能被当作某些树种的俗名，但具体指哪一种树会因地方而异。正式写作中如果需要更精确，可以直接说“wood for paddles”或写明木材种类（如 ash、cedar 等）。"]}
{"word":"paddling","summary":{"en":"Paddling usually means moving a boat with a paddle, or splashing/moving hands or feet in shallow water; in some contexts it also means corporal punishment with a paddle.","zh":"paddling 通常指用桨划船/划行，或在浅水里用手脚划水、戏水；在某些语境中也可指用木板打人的体罚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of moving a small boat by using a paddle; canoeing or kayaking","zh":"用桨划船的活动；（尤指）皮划艇/独木舟运动"},"examples":[{"en":"We went paddling on the lake at sunrise.","zh":"我们在日出时去湖上划船（划桨）。"},{"en":"She learned paddling techniques for kayaking.","zh":"她学习了皮划艇的划桨技巧。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of moving your hands or feet through water, usually while swimming or playing","zh":"在水中用手脚划动（多指游泳或玩水时）"},"examples":[{"en":"The kids were paddling in the shallow water.","zh":"孩子们在浅水里戏水、划水。"},{"en":"He sat on the edge and started paddling his feet.","zh":"他坐在边上，开始用脚在水里划动。"}]},{"partOfSpeech":"n.","definition":{"en":"a punishment in which someone is hit with a flat object (such as a paddle)","zh":"用扁平物（如木板）打人的体罚；打屁股"},"examples":[{"en":"The film shows paddling as a form of old-fashioned discipline.","zh":"这部电影把打板子（体罚）表现为一种老式的管教方式。"},{"en":"Many schools have banned paddling.","zh":"许多学校已经禁止体罚（打板子）。"}]},{"partOfSpeech":"v.","definition":{"en":"moving a boat through water with a paddle (present participle of “paddle”)","zh":"（用桨）划行；划船（paddle 的现在分词）"},"examples":[{"en":"They are paddling downstream.","zh":"他们正在顺流划行。"},{"en":"I was paddling slowly to avoid disturbing the birds.","zh":"我慢慢划着，避免惊扰鸟儿。"}]}],"synonyms":["canoeing","kayaking","paddling (in water)","splashes","wading","spanking (punishment)"],"phonetic":"/ˈpædəlɪŋ/","extraExplanation":["“paddling”在英式英语里常出现在短语“paddling pool”（儿童浅水池）中，指小朋友可以安全玩水的那种小池子。","在美国语境中，“paddling”也可能特指某些学校或家庭过去使用的体罚方式（用木板打屁股）。这个用法带有较强的文化与历史色彩，如今在很多地方已被禁止或引起争议。","注意区分“paddling”和“rowing”：一般说来，rowing（赛艇）用的是固定在船上的桨（oar），而 paddling（皮划艇/独木舟）多用手持的桨（paddle）。"]}
{"word":"paddling pool","summary":{"en":"A small shallow pool for kids to splash and play in.","zh":"供儿童玩水嬉戏的小型浅水池。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, shallow pool (usually inflatable) for children to sit in, splash, and play in, often placed in a yard.","zh":"（通常为充气的）儿童浅水池/戏水池，多放在院子里供孩子坐着玩水、嬉水。"},"examples":[{"en":"We set up a paddling pool in the backyard so the kids could cool off.","zh":"我们在后院支起一个儿童戏水池，让孩子们凉快一下。"},{"en":"Don’t leave a child alone in a paddling pool, even for a minute.","zh":"即使只有一分钟，也不要让孩子单独待在戏水池里。"}]}],"synonyms":["wading pool","kiddie pool","inflatable pool"],"phonetic":"/ˈpæd(ə)lɪŋ puːl/","extraExplanation":["英式英语里更常说 paddling pool；美式英语里更常见的说法是 wading pool（涉水池/浅水池）。含义基本相同。","paddle 原意是“用手脚在水里拍打/划动”，所以 paddling pool 强调“在浅水里玩水、拍水”的感觉。","安全小提醒（英美常见公共提示）：浅水也可能有风险，因此常会看到类似 Never leave children unattended（切勿让儿童无人看护）的警示语。"]}
{"word":"paddlings","summary":{"en":"Paddlings can mean punishments with a paddle, or strokes/instances of paddling a boat.","zh":"paddlings 可指用拍板体罚的次数/行为，也可指划船的桨次/划桨动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) acts of hitting someone with a flat board (a paddle) as punishment; spankings with a paddle.","zh":"（复数）用木板状的“拍板”（paddle）打人作为惩罚；用拍板打屁股的体罚。"},"examples":[{"en":"The school banned paddlings years ago.","zh":"那所学校多年前就禁止了用拍板体罚。"},{"en":"Some parents strongly oppose paddlings for children.","zh":"一些家长强烈反对对孩子进行拍板体罚。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) instances of paddling a boat; strokes made with a paddle.","zh":"（复数）划船的动作/次数；用桨划水的桨次。"},"examples":[{"en":"After a few paddlings, the canoe moved into deeper water.","zh":"划了几下之后，独木舟就进入了更深的水域。"},{"en":"We took turns counting our paddlings to keep the same rhythm.","zh":"我们轮流数桨次来保持同样的节奏。"}]}],"synonyms":["spankings","beatings","strokes","paddle strokes"],"phonetic":"/ˈpæd(ə)lɪŋz/","extraExplanation":["在美式英语里，paddling 常指用木板打屁股的体罚（corporal punishment）。它在一些美国学校和家庭曾较常见，但在许多州/学区已被禁止或受到严格限制；在讨论时常带有争议与强烈情绪色彩。","在水上运动语境中，paddlings 更偏“划桨的次数/动作”，不过更常见的说法是 strokes 或 paddling（不可数/单数）。"]}
{"word":"paddock","summary":{"en":"A paddock is usually a small enclosed field for horses; it can also mean the motorsports area where cars and teams stay.","zh":"paddock 通常指圈养马等动物的小围场；也可指赛车运动中的维修区/停放区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small field or enclosed area, especially for keeping horses or other animals","zh":"（尤指用于圈养马等动物的）小围场；小牧场"},"examples":[{"en":"The horses were grazing in the paddock behind the barn.","zh":"马在谷仓后面的小围场里吃草。"},{"en":"Please close the gate when you enter the paddock.","zh":"进入围场后请把门关好。"}]},{"partOfSpeech":"n.","definition":{"en":"(in motorsports) a fenced area where racing cars, teams, and equipment are kept before and after a race","zh":"（赛车运动中的）维修区；停放区（比赛前后停放赛车、团队与设备的区域）"},"examples":[{"en":"Fans waited near the paddock to see the drivers up close.","zh":"粉丝在维修区附近等待，想近距离看到车手。"},{"en":"The team made last-minute checks in the paddock.","zh":"车队在维修区做了最后检查。"}]}],"synonyms":["enclosure","pen","corral","pasture","(motorsports) pit area"],"phonetic":"/ˈpædək/","extraExplanation":["“paddock”在英式英语里也常指“（小）牧场/围栏草地”，美式英语中同样常见，尤其在马术语境。","词源上与“pad”（脚掌、踏步）有关，带有“被踩踏的地面/圈起来的一块地”的历史含义。","延伸义（赛车维修区）来自“把参赛车辆集中在围起来的区域”这一场景类比。"]}
{"word":"paddocked","summary":{"en":"“Paddocked” means an animal was put into (or kept in) a small fenced field, especially for horses.","zh":"“paddocked”指（尤指马等）被赶进或被圈在小围场/牧围里放牧或休息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “paddock”) to put an animal—especially a horse—into a small fenced field (a paddock), usually to graze or rest; to keep confined in such an area.","zh":"（“paddock”的过去式/过去分词）把动物（尤指马）赶入小围场/牧围里放牧或休息；使圈在围场里。"},"examples":[{"en":"After training, the horses were paddocked for the afternoon.","zh":"训练结束后，这些马被赶到围场里待到下午。"},{"en":"The cattle were paddocked near the barn overnight.","zh":"牛群夜里被圈在谷仓附近的围场里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Kept or housed in a paddock; placed in a fenced grazing area.","zh":"被关在围场里的；被放在有围栏的放牧区里的。"},"examples":[{"en":"The paddocked horses looked calmer after they had time to graze.","zh":"这些被圈在围场里的马有时间吃草后看起来更平静了。"}]}],"synonyms":["enclosed","confined","corralled","penned"],"phonetic":"/ˈpædək(t)/","extraExplanation":["“paddock”常见于农场、马场和赛马语境，指比“pasture（大牧场）”更小、更便于管理的围栏草地或活动区。赛马场里也会说“paddock area”，指赛前牵马亮相、检视的区域。"]}
{"word":"paddocking","summary":{"en":"Paddocking means keeping or managing animals in fenced paddocks (often by rotating them), and it can also refer to activity in a motorsport paddock area.","zh":"paddocking 指把动物圈放在围场里并进行分栏/轮换管理；在赛车语境中也可指在维修区（paddock）内的整备活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of keeping animals (especially horses or livestock) in a small fenced field, or moving them between fenced areas (often for controlled feeding or grazing).","zh":"（尤指马或家畜的）圈放/分栏放牧；把动物关在小围场里饲养，或在不同围场之间轮换（常用于控制采食与放牧）。"},"examples":[{"en":"Paddocking helps prevent the pasture from being overgrazed.","zh":"分栏放牧有助于防止牧场被过度啃食。"},{"en":"They use paddocking to rotate the horses onto fresh grass each week.","zh":"他们用分栏轮换的方式，让马每周换到新的草地上。"}]},{"partOfSpeech":"v.","definition":{"en":"Putting an animal into a paddock; managing animals by assigning them to paddocks.","zh":"把动物赶入围场；通过分配围场来管理动物。"},"examples":[{"en":"After training, the stable hands began paddocking the horses for the night.","zh":"训练结束后，马房工人开始把马赶进围场过夜。"},{"en":"They are paddocking the cattle in smaller groups this season.","zh":"这个季节他们把牛分成更小的组来分栏圈放。"}]},{"partOfSpeech":"n.","definition":{"en":"In motorsports, the activity of bringing vehicles into the paddock area and preparing/servicing them between sessions.","zh":"（赛车运动）把车辆带入维修区（paddock）并在间歇进行整备与检修的活动。"},"examples":[{"en":"Paddocking was busy as the teams checked tire wear between runs.","zh":"两次出车之间，各车队检查轮胎磨损，维修区里很忙。"},{"en":"Media access to paddocking is restricted during the race weekend.","zh":"比赛周末媒体进入维修区的活动范围会受限制。"}]}],"synonyms":["paddock rotation","rotational grazing","penning","pasture management","stalling (for horses)"],"phonetic":"/ˈpædəkɪŋ/","extraExplanation":["“paddocking”来自名词/动词“paddock”（围场）。在农业语境里，它常与“rotational grazing（轮牧）”“strip grazing（条带放牧）”一起出现，强调把草地分区轮换使用，以保护草场、控制寄生虫、提高草地利用率。","在赛车语境中，“paddock”指维修区/车队工作区，因此“paddocking”更多是圈内说法，指车辆回到维修区、进行检修与准备的阶段。正式写作中也常直接说“in the paddock”或“paddock work”。"]}
{"word":"paddockride","summary":{"en":"“Paddock ride” usually means a short ride in/around a paddock, especially in horse racing or training.","zh":"“paddock ride”通常指在围场内/周边进行的短途骑乘，尤用于赛马或训练场景。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Horse racing/equestrian) A short ride in or around the paddock (the enclosed area near the stables) to warm up, check a horse’s condition, or show the horse before an event.","zh":"（赛马/马术）在围场（靠近马厩的封闭区域）内或周边进行的短途骑乘，用于热身、检查马匹状态，或在比赛前展示马匹。"},"examples":[{"en":"The trainer watched the paddock ride to see whether the horse looked calm and sound.","zh":"训练师观察围场骑乘，看看这匹马是否状态放松、步态正常。"},{"en":"After a quick paddock ride, she tightened the girth and headed to the starting area.","zh":"短暂在围场骑了一圈后，她收紧肚带，前往起跑区域。"}]},{"partOfSpeech":"phrase","definition":{"en":"(General) A leisurely ride within a fenced field or enclosure (a paddock), often on horseback.","zh":"（泛指）在有围栏的草地或圈地（paddock）内进行的悠闲骑行，通常指骑马。"},"examples":[{"en":"We went for a paddock ride at sunset behind the barn.","zh":"我们在谷仓后面日落时分到围场里骑了一圈。"},{"en":"For beginners, the instructor started with a gentle paddock ride before going on trails.","zh":"对初学者，教练先安排在围场里轻松骑行，再去走野外路线。"}]}],"synonyms":["warm-up ride","schooling ride","parade ring appearance"],"phonetic":"/ˈpædək raɪd/","extraExplanation":["“paddock”在英式语境里常见于马术与赛马：指靠近马厩、用于放马或牵马展示的围场；在赛马场也可指马匹赛前亮相的区域（有时接近“parade ring/马匹亮相圈”的概念）。因此“paddock ride”多用于描述赛前/训练中的短距离骑乘与观察。","你输入的“paddockride”更像把短语连写；更常见的写法是分开写作“paddock ride”。"]}
{"word":"paddocks","summary":{"en":"“Paddocks” means fenced fields for animals, especially horses; it can also mean the pre-race horse area in horse racing.","zh":"“paddocks”指围起来供动物（尤指马）活动或放牧的地块；在赛马中也指赛前圈马/集合区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fenced fields or small areas of land (especially on a farm) used for keeping horses or other animals, or sometimes for grazing.","zh":"（尤指农场的）围栏牧场/小块围起来的草地，用来圈养马或其他牲畜，或用于放牧。"},"examples":[{"en":"The horses were turned out into the paddocks after breakfast.","zh":"早餐后，马被放到围栏牧场里活动。"},{"en":"We walked past several paddocks filled with sheep.","zh":"我们走过几块养着羊的围栏草地。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some sports, especially horse racing) an enclosed area where horses are kept or shown before a race.","zh":"（体育中，尤指赛马）赛前圈马、展示马匹的围场/集合区。"},"examples":[{"en":"The jockey met the trainer in the paddock before the race.","zh":"比赛前，骑师在圈马区见了教练。"}]}],"synonyms":["fields","enclosures","pastures","pens","corrals"],"phonetic":"/ˈpæd.əkz/","extraExplanation":["“paddock”在英式与澳新英语中非常常见，常指农场里圈起来的牧草地；在美式英语中也用，但有时更常说“pasture”（牧场/草地）或“corral/pen”（牲畜围栏）。","词源上与“pad”（走路、踩踏）有关，带有“供动物走动/放牧的地块”的意思。"]}
{"word":"paddockstone","summary":{"en":"A large stone in a paddock (fenced field), sometimes used as a marker or step.","zh":"牧场围栏内田地里的大石头/巨石，有时用作标记或踏步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large stone or boulder in a paddock (a fenced field for animals), often left in place or used as a simple marker or stepping/mounting stone","zh":"（牧场围栏内的）田地/草场里的大石头或巨石；常被原地保留，或用作简易标记、踏步石/上马石"},"examples":[{"en":"The horse paused beside a paddockstone near the gate.","zh":"马在大门附近的一块田间大石头旁停了下来。"},{"en":"Farmers sometimes leave paddockstones because moving them is expensive.","zh":"农场主有时会把田里的大石头留在原处，因为搬走成本很高。"},{"en":"She used the paddockstone as a step to climb over the fence.","zh":"她把那块田间大石头当作踏脚石翻过了栅栏。"}]}],"synonyms":["fieldstone","boulder","rock"],"phonetic":"/ˈpædəkˌstoʊn/","extraExplanation":["“paddockstone”是由“paddock（围起来放牧的草地/小牧场）+ stone（石头）”构成的复合名词，属于比较少见、偏乡村语境的用法。在澳大利亚/新西兰等英语地区更容易在口语或地方性写作中见到。","书写上也可能分开写成“paddock stone”。具体含义通常依上下文决定：可能只是“田里的石头”，也可能带有“用作标记/踏脚”的功能。"]}
{"word":"paddockstool","summary":{"en":"A rare/nonstandard noun meaning either a small stool used in a paddock area, or (very rarely) a mushroom/toadstool found in a paddock.","zh":"一个罕见/非标准名词：多指围场里用的小凳子；极少也可指围场里长出的蘑菇/毒蘑菇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A small stool used in or near a paddock (an enclosed field for horses or livestock), for tasks like grooming or resting.","zh":"（罕见/非标准用法）放在围场（paddock：马或牲畜的围栏牧场）里或附近使用的小凳子，可用于梳理马匹、短暂休息等。"},"examples":[{"en":"She kept a paddockstool by the gate so she could sit while brushing the horse’s coat.","zh":"她在围场门边放了一张小凳子，方便给马刷毛时坐着。"},{"en":"Grab the paddockstool and the tack box before you head out.","zh":"出发前把围场小凳子和马具箱拿上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare; sometimes used humorously) A toadstool/mushroom found growing in a paddock.","zh":"（非常罕见；有时带玩笑意味）长在围场里的蘑菇/毒蘑菇（toadstool）。"},"examples":[{"en":"After the rain, little paddockstools popped up all over the grass.","zh":"下雨后，草地上冒出了许多小蘑菇。"}]}],"synonyms":["paddock stool","stool","milking stool","toadstool","mushroom"],"phonetic":"ˈpædəkˌstuːl","extraExplanation":["“paddockstool”不是常见的标准词，实际写作中更常见的是两词形式“paddock stool”。如果你是在某本书、地方用语或特定行业（马术/畜牧）里看到它，通常指与围场相关的“小凳子”。","如果你原本想查的是别的词（例如 *paddock*、*stool*、*toadstool*），也可以告诉我上下文句子，我能帮你确认最准确的意思。"]}
{"word":"paddoing","summary":{"en":"Padding most commonly means soft protective or comfort material; it can also mean extra unnecessary words added just to make something longer.","zh":"Padding 最常指用于保护或舒适的衬垫/填充物；也可指为凑长度而添加的赘述内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"soft material used to make something thicker, safer, or more comfortable (for example in clothing, furniture, or packaging).","zh":"（用于衣物、家具或包装等的）衬垫；填充物；保护垫，使物品更厚、更安全或更舒适。"},"examples":[{"en":"This jacket has extra padding in the shoulders.","zh":"这件夹克的肩部有额外的垫料。"},{"en":"Add more padding to the box so the glass doesn’t break.","zh":"在盒子里多放些填充物，这样玻璃就不会碎。"}]},{"partOfSpeech":"n.","definition":{"en":"unnecessary extra words, details, or time added to make something seem longer or more important.","zh":"（文章、演讲等的）“灌水”；赘述；为凑长度而添加的无用内容。"},"examples":[{"en":"The essay is mostly padding and needs to be shorter.","zh":"这篇文章大多是凑字数的内容，需要更精炼。"},{"en":"Cut the padding and get to the main point.","zh":"删掉赘述，直接说重点。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of walking quietly and carefully; moving with soft steps.","zh":"（脚步轻柔地）悄悄走；轻手轻脚地走。"},"examples":[{"en":"We heard the cat padding across the floor.","zh":"我们听到猫轻轻走过地板的声音。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something thicker, softer, or safer by adding soft material.","zh":"给……加垫；填充；加衬里以使其更厚、更柔软或更安全。"},"examples":[{"en":"She padded the chair for comfort.","zh":"她给椅子加了垫子让它更舒服。"},{"en":"The envelope was padded to protect the device.","zh":"这个信封是加厚的，用来保护设备。"}]}],"synonyms":["cushioning","stuffing","filler","insulation","wadding"],"phonetic":"/ˈpædɪŋ/","extraExplanation":["“paddoing” 不是常见英文单词，最可能是拼写错误。常见的目标词有：\n1) padding（本条目）：指“衬垫/填充物”，或“凑字数的赘述”。\n2) paddling：指“划桨；划船；用桨拍水（或轻拍）”。如果你想表达“在水上划桨/划船”，告诉我你的句子，我可以给你对应的词条。"]}
{"word":"paddy","summary":{"en":"“Paddy” most commonly means a flooded field for growing rice; it can also refer to an Irish person (often offensive/outdated) or be a nickname for Patrick.","zh":"“paddy”最常指稻田（水田）；也可指爱尔兰人（多被视为冒犯或过时），或作 Patrick 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flooded field where rice is grown; also called a rice paddy","zh":"稻田；水田（种植水稻的淹水田地）"},"examples":[{"en":"Farmers were working in the rice paddies during the rainy season.","zh":"雨季里，农民在稻田里干活。"},{"en":"We walked past bright green paddies on the way to the village.","zh":"去村子的路上，我们经过了一片翠绿的稻田。"}]},{"partOfSpeech":"n.","definition":{"en":"a person of Irish background (often considered offensive or outdated); also used as a nickname for Patrick","zh":"爱尔兰人（常被视为冒犯或过时的称呼）；也可作 Patrick 的昵称"},"examples":[{"en":"That term for Irish people is often seen as offensive today, so it's better to avoid it.","zh":"那个称呼如今常被认为带有冒犯性，所以最好避免使用。"},{"en":"Paddy is short for Patrick in some English-speaking countries.","zh":"在一些英语国家，Paddy 是 Patrick 的昵称。"}]}],"synonyms":["rice paddy","rice field"],"phonetic":"/ˈpædi/","extraExplanation":["“paddy（稻田）”这个意思来自马来语/印地语等南亚、东南亚语言中对“稻米/稻作”的称呼，后来进入英语，常见于描述亚洲稻作景观与农业。","“Paddy（爱尔兰人）”与爱尔兰的守护圣人圣帕特里克（St. Patrick）有关，因为 Patrick 是常见的爱尔兰名字。该用法在历史上常带刻板印象色彩，现代语境中容易冒犯，因此建议只在解释历史文本或引用时使用。"]}
{"word":"paddybird","summary":{"en":"A South Asian name for the (Indian) pond heron, often seen around rice paddies.","zh":"南亚地区对（印度）池鹭的常用称呼，常在稻田附近出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) A pond heron, especially the Indian pond heron, a small heron often seen in rice paddies and wetlands.","zh":"（南亚英语）稻田鹭（池鹭的一种），尤指印度池鹭；常见于稻田与湿地的小型鹭鸟。"},"examples":[{"en":"A paddybird stood motionless at the edge of the rice field, waiting for frogs.","zh":"一只稻田鹭一动不动地站在稻田边，等着青蛙出现。"},{"en":"In the monsoon season, paddybirds are common near flooded fields.","zh":"在雨季，淹水的田地附近常能见到稻田鹭。"}]}],"synonyms":["pond heron","Indian pond heron","heron"],"phonetic":"/ˈpædiˌbɝd/","extraExplanation":["“paddybird”多见于印度、斯里兰卡等地的英语用法；在更通用的国际英语里，人们更常说“(Indian) pond heron”。","名称里的“paddy”指稻田（paddy field），因为这种鸟常在稻田、沟渠、浅水区觅食。"]}
{"word":"paddyism","summary":{"en":"Paddyism most commonly means a (often offensive) stereotyped idea of ‘Irishness’; more rarely, it can mean things related to paddy (rice) farming.","zh":"Paddyism 最常指（常具冒犯性的）对“爱尔兰性”的刻板印象；较少见时也可指与稻田（水稻）种植相关的做法或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often offensive) ‘Irishness’ seen through a stereotype; behavior, speech, or customs associated (sometimes mockingly) with Irish people.","zh":"（常具冒犯性）以刻板印象理解的“爱尔兰性”；（有时带嘲讽地）指被认为属于爱尔兰人的行为、口音或习俗。"},"examples":[{"en":"The reviewer criticized the movie for relying on paddyism instead of real character development.","zh":"评论者批评这部电影依赖“刻板的爱尔兰人形象”，而不去塑造真实人物。"},{"en":"Some old writings use paddyism to mock Irish accents and manners.","zh":"一些旧文会用 paddyism 来嘲笑爱尔兰口音和举止。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Ideas, policies, or practices connected to paddy (rice) farming; rice-agriculture interests.","zh":"（罕见）与水稻（稻田）种植相关的观念、政策或做法；稻作农业的利益取向。"},"examples":[{"en":"In a few historical texts, paddyism refers to policies favoring rice cultivation.","zh":"在少数历史文本里，paddyism 指偏向水稻种植的政策。"}]}],"synonyms":["Irishness (neutral)","stereotyped Irishness","Hibernianism (rare)"],"phonetic":"ˈpædiˌɪzəm","extraExplanation":["“Paddy”在英语里曾是对爱尔兰人的外号，也常被当作贬称使用（类似以族群外号来概括一群人）。因此 paddyism 在谈到“爱尔兰性”时往往带有嘲弄或歧视意味。写作或交流中更安全的中性表达通常是 Irishness（爱尔兰特质/爱尔兰文化）。","如果你是在农业语境中想表达“稻作/稻田相关的思想或政策”，更常见、更清晰的说法是 rice farming, paddy cultivation, rice-agriculture policy 等。"]}
{"word":"paddymelon","summary":{"en":"A paddymelon is a small Australian wild melon, similar to a wild cucumber.","zh":"paddymelon 指澳大利亚的一种小型野生甜瓜，外形和口感常被形容为类似野黄瓜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wild melon native to Australia (often called a wild cucumber), with green-and-white striped skin and crisp, cucumber-like flesh.","zh":"澳大利亚原生的一种小型野生甜瓜（也常被称为“野黄瓜”），外皮绿白相间条纹，果肉爽脆，口感类似黄瓜。"},"examples":[{"en":"We saw paddymelons growing near the creek during our walk.","zh":"我们散步时在小溪附近看到有paddymelon在生长。"},{"en":"Some people pickle paddymelon like cucumbers.","zh":"有些人会把paddymelon像腌黄瓜一样腌制。"},{"en":"The farmer said paddymelon can spread quickly in warm weather.","zh":"农夫说在温暖天气里paddymelon会扩散得很快。"}]}],"synonyms":["wild cucumber","wild melon"],"phonetic":"/ˈpædiˌmɛlən/","extraExplanation":["“Paddymelon”主要是澳大利亚英语用词，在澳洲乡村或野外语境更常见；在其他英语地区更可能用“wild cucumber / wild melon”来描述。","它也可指某些入侵性或野生葫芦科植物的俗名，用法可能因地区而略有差异。"]}
{"word":"paddywack","summary":{"en":"Paddywack usually means a light playful tap, and it’s also a well-known rhythm word from the children’s rhyme “This Old Man.”","zh":"paddywack 通常指轻轻、带玩笑性质的拍打；也常作为儿童歌谣《This Old Man》中的节奏词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light tap or slap; a playful hit.","zh":"轻轻一拍／一打；带玩笑性质的拍打。"},"examples":[{"en":"He gave his friend a friendly paddywack on the shoulder.","zh":"他友好地在朋友肩膀上轻拍了一下。"},{"en":"The kids ran around, laughing and giving each other little paddywacks.","zh":"孩子们跑来跑去笑着，互相轻轻拍打。"}]},{"partOfSpeech":"n.","definition":{"en":"In children’s rhymes (especially “This Old Man”), a rhythmic phrase: “paddywack,” meaning a light tap (often on a body part).","zh":"在儿童歌谣（尤其是《This Old Man》）里用作节奏词：“paddywack”，指轻轻一敲（常敲在身体部位上）。"},"examples":[{"en":"In the song, he ‘gave the dog a bone’ and ‘paddywack’ on a knee.","zh":"在歌里，他“给狗一根骨头”，并在膝盖上“啪嗒”轻敲一下。"},{"en":"Teachers sometimes use “paddywack” to keep the beat in a class chant.","zh":"老师有时用“paddywack”来带领课堂口令的节奏。"}]}],"synonyms":["tap","pat","light slap","swat"],"phonetic":"/ˈpædiˌwæk/","extraExplanation":["“paddywack”在现代英语里不算常用，更常见于童谣《This Old Man》（常唱作“knick-knack, paddywack”）。在这种语境中，它带有拟声和节奏作用，听起来像轻轻拍打的声音。","在一些非正式用法里，paddywack 也可能指“愚蠢的话/胡说八道”，但这个意思较少见，且更常用的说法是“poppycock / nonsense”。"]}
{"word":"paddywatch","summary":{"en":"Paddywatch usually means guarding rice paddies; very rarely it’s a dated, offensive term for a police patrol.","zh":"Paddywatch 通常指看守稻田；极少数情况下是过时且带冒犯性的“警方巡逻”说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Guard duty or a shift spent watching over rice paddies (rice fields), especially to prevent theft or animal damage.","zh":"看守稻田的值班/守望（稻田巡守），常指为防止偷盗或动物破坏而进行的守卫。"},"examples":[{"en":"During harvest season, villagers took turns doing paddywatch at night.","zh":"收割季节，村民们轮流在夜里守稻田。"},{"en":"The farmer hired two workers for paddywatch to keep wild boars away.","zh":"农夫雇了两名工人守稻田，以防野猪来破坏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, dated, and often offensive) A police watch/patrol, using “Paddy” as a slur for Irish people.","zh":"（少见、过时且常带冒犯性）指警方的巡逻/盯梢，其中 “Paddy” 被用作对爱尔兰人的蔑称。"},"examples":[{"en":"That term shows bias; it’s better to say “police patrol” or “police watch.”","zh":"这个说法带有偏见；更好的说法是 “police patrol（警方巡逻）” 或 “police watch（警方守望）”。"}]}],"synonyms":["guard duty","watch","patrol","night watch"],"phonetic":"/ˈpædiˌwɑtʃ/","extraExplanation":["“paddywatch”并不是常见标准英语词，更多像是临时拼合或地区性写法；更常见的写法是分开写作 “paddy watch”。","“paddy”在英语里既可指“稻田/稻米”，也曾被用作对爱尔兰人的蔑称（带冒犯性）。在涉及人群身份时应避免使用可能带歧视色彩的表达，改用中性说法如 “police patrol”。"]}
{"word":"paddywhack","summary":{"en":"“Paddywhack” is an informal word for a light smack, and it also appears as a rhythmic nonsense phrase in the nursery rhyme “This Old Man.”","zh":"“paddywhack”是非正式说法，指轻轻一击；也常作为童谣《This Old Man》里押韵节奏用的无实义词组出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A quick, light hit or smack; a playful whack.","zh":"（非正式）轻轻一击；（常带玩笑意味的）拍打。"},"examples":[{"en":"He gave his brother a playful paddywhack on the arm.","zh":"他开玩笑地在弟弟胳膊上轻轻拍了一下。"},{"en":"The coach didn’t yell—just a friendly paddywhack on the shoulder.","zh":"教练没吼人，只是友好地拍了拍他的肩膀。"}]},{"partOfSpeech":"phrase","definition":{"en":"(often in the phrase “knickknack paddywhack”) A nonsense/folksy word used in a children’s rhyme and song.","zh":"（常见于短语“knickknack paddywhack”）童谣歌曲里用的拟声/无实义的民俗用语。"},"examples":[{"en":"The line “knickknack paddywhack” comes from the nursery rhyme “This Old Man.”","zh":"“knickknack paddywhack”这句出自童谣《This Old Man》。"},{"en":"Kids sang, “Knickknack paddywhack, give a dog a bone,” while clapping along.","zh":"孩子们一边拍手一边唱：“Knickknack paddywhack, give a dog a bone”。"}]}],"synonyms":["smack","tap","light whack","swat"],"phonetic":"ˈpædiˌwæk","extraExplanation":["“paddywhack”在现代英语里多用于轻松、俏皮的语境，表示“啪的一下轻打”。但它最常被许多人听到的场景，是童谣《This Old Man》里的固定搭配“knickknack paddywhack”，其中“paddywhack”更像是押韵/节奏用词，并不一定有明确含义。","文化敏感点：词中“Paddy”历史上曾被用作对爱尔兰人的绰号，某些场合可能带有贬义色彩。虽然在童谣和“轻轻一击”的常用法中通常不带冒犯意图，但在正式写作或跨文化沟通中，建议优先选用更中性的词（如“smack / tap / whack”）。"]}
{"word":"padelion","summary":{"en":"“Padelion” isn’t a standard English word; it’s most likely a misspelling of “dandelion.”","zh":"“padelion”不是标准英语词；最可能是“dandelion（蒲公英）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling of “dandelion,” a common yellow-flowered plant with fluffy white seed heads.","zh":"很可能是“dandelion（蒲公英）”的拼写错误：一种常见的黄色开花植物，成熟后会长出白色绒球状的种子头。"},"examples":[{"en":"I think you meant “dandelion”—those yellow flowers in the yard.","zh":"我想你是想写“dandelion（蒲公英）”——院子里那些黄色的小花。"},{"en":"The dandelion seeds blew away in the wind.","zh":"蒲公英的种子被风吹散了。"}]}],"synonyms":["dandelion","blowball (informal)"],"phonetic":"/ˈdændəˌlaɪən/","extraExplanation":["“Dandelion”来自法语 *dent de lion*，意思是“狮子的牙齿”，形容它锯齿状的叶子。","英语里常说“blow a dandelion”（吹蒲公英绒球）来许愿；在一些文化中，蒲公英也象征坚韧、希望与新的开始。","蒲公英也可入菜（dandelion greens 指蒲公英叶），或泡茶；但在野外采食需确认无农药与正确辨识。"]}
{"word":"padell","summary":{"en":"“Padell” is not a standard English word; it is usually a misspelling of “padel” (a racket sport) or “paddle.”","zh":"“padell”不是标准英文词；通常是把“padel”（球拍运动）或“paddle”（桨；划）拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or uncommon spelling; in English it is most often seen as a misspelling of “padel” (the racket sport) or “paddle.”","zh":"一种不标准或不常见的拼写；在英文中多见于把“padel”（板式网球/帕德尔球运动）或“paddle”（桨；用桨划）拼错。"},"examples":[{"en":"Did you mean “padel” (the sport) rather than “padell”?","zh":"你想写的是“padel”（那项运动）而不是“padell”吗？"},{"en":"I typed “padell” by mistake; I meant “paddle.”","zh":"我把“padell”打错了；我想写的是“paddle”。"}]}],"synonyms":["padel","paddle"],"phonetic":"/pəˈdɛl/","extraExplanation":["“padel”是一种在西班牙和拉丁美洲很流行的球拍运动，通常译为“板式网球/帕德尔球”，在封闭球场里进行，规则有点像网球+壁球。英语里更常见的拼写是 padel。","如果你指的是“桨/用桨划”，正确拼写通常是 paddle（名词：桨；动词：划船、趟水）。"]}
{"word":"padella","summary":{"en":"Padella means a frying pan (an Italian loanword), and it can also be a surname.","zh":"Padella 指“平底锅”（源自意大利语的外来词），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Italian) a frying pan; a flat pan used for cooking, especially sautéing or frying.","zh":"（源自意大利语）平底锅；用于烹饪（尤其是煎、炒）的平底锅。"},"examples":[{"en":"Heat the olive oil in a padella and add the garlic.","zh":"在平底锅里加热橄榄油，然后放入大蒜。"},{"en":"She made a quick pasta sauce in a small padella.","zh":"她用一个小平底锅快速做了意面酱。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Dr. Padella will see you now.","zh":"Padella 医生现在可以见你了。"}]}],"synonyms":["frying pan","skillet","sauté pan"],"phonetic":"/pɑˈdɛlə/","extraExplanation":["“Padella”在英语里不算常用词，更多出现在意大利菜谱、餐厅语境或保留原文的写法中。日常英语里更常说 frying pan（通用）或 skillet（更偏厚底、常用于煎烤）。","意大利语里 padella 的复数常见为 padelle（在菜单或食谱中可能会看到）。"]}
{"word":"pademelon","summary":{"en":"A pademelon is a small Australian wallaby-like marsupial that lives in forests and thick bush.","zh":"pademelon 指澳大利亚特有的一种小型沙袋鼠类有袋动物，多生活在森林和灌木丛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wallaby (a marsupial) native to Australia and nearby islands, smaller than a kangaroo and usually living in forests or dense bush.","zh":"帕德梅隆（又称“矮沙袋鼠/小袋鼠”）：澳大利亚及周边岛屿特有的一种小型沙袋鼠类有袋动物，比袋鼠更小，常生活在森林或灌木丛中。"},"examples":[{"en":"We spotted a pademelon at the edge of the rainforest just before sunset.","zh":"日落前，我们在雨林边缘看见了一只帕德梅隆。"},{"en":"Pademelons are shy and often stay close to thick vegetation for cover.","zh":"帕德梅隆很胆小，经常靠近茂密植被以便躲藏。"}]}],"synonyms":["wallaby (general term)","small wallaby"],"phonetic":"/ˌpædəˈmɛlən/","extraExplanation":["“pademelon”主要用于澳大利亚语境，常见于自然纪录片、野生动物保护宣传和澳洲旅游介绍。","它属于袋鼠科（macropods，意为“长足类”）的一类小型成员，外形像缩小版的沙袋鼠。","词源一般认为来自澳大利亚原住民语言（具体语族与拼写在不同资料中略有差异），体现了澳洲许多动物名称借自原住民语言的特点。"]}
{"word":"padesoy","summary":{"en":"“padesoy” isn’t a recognized English word; it’s likely a misspelling or phonetic spelling, so its meaning depends on context.","zh":"“padesoy”不是规范英语词；多半是误拼或按发音拼写，含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a phonetic spelling of another word/phrase (meaning depends on context).","zh":"不是标准英语单词。可能是拼写错误或按发音写出来的词（具体含义取决于上下文）。"},"examples":[{"en":"I keep seeing “padesoy” online, but I can’t find it in a dictionary.","zh":"我在网上老看到“padesoy”，但在词典里查不到。"},{"en":"Could you share the full sentence where you saw “padesoy”?","zh":"你能把出现“padesoy”的完整句子发我吗？"}]}],"synonyms":["(none—unclear term)"],"phonetic":"/ˈpæd.ə.sɔɪ/","extraExplanation":["“padesoy”很可能是以下几种情况之一：\n1）拼写误差：比如把别的单词/短语拼错了。\n2）按发音写的外来语：例如有人可能想写法语“pas de souci”（意思类似“别担心/没事”），但写成了不规范的拼法。\n3）菜名/专有名词的误拼：也可能来自某种菜名或品牌名。\n\n如果你把它出现的句子、聊天上下文或截图发来，我可以更准确判断你想找的词是什么，并给出正确拼写与用法。"]}
{"word":"padeye","summary":{"en":"A padeye is a strong metal attachment point with a hole, used to secure or lift with ropes, shackles, or chains.","zh":"padeye 指带孔的加固金属连接点，用于系固或起吊时连接绳索、卸扣或链条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong metal plate or fitting with a hole (an “eye”) used as an attachment point for a rope, shackle, chain, or lifting gear, especially on boats and in engineering.","zh":"（尤指船舶与工程中）一种带孔的加固金属板/连接件（“眼”），用作绳索、卸扣、链条或起吊装置的固定连接点。"},"examples":[{"en":"Clip the safety line to the padeye before you move forward on deck.","zh":"在你往甲板前部移动前，先把安全绳扣到 padeye 上。"},{"en":"The rigger installed padeyes on the frame to create secure lifting points.","zh":"索具工在框架上安装了 padeye，作为可靠的起吊点。"},{"en":"Make sure the padeye is rated for the load and properly bolted through the deck.","zh":"确保该 padeye 的承载等级符合载荷要求，并且已正确穿透甲板用螺栓固定。"}]}],"synonyms":["eye plate","lifting eye","tie-down point","anchor point"],"phonetic":"/ˈpædˌaɪ/","extraExplanation":["“padeye”常见于航海与起重/结构领域：它通常是焊接或螺栓固定在甲板、舱壁或钢结构上的“带眼孔连接点”。英文里 pad- 有“加固/垫片式基座”的感觉，eye 指“孔/环眼”，合起来就是“加固的眼孔连接件”。","在使用场景中要注意承载等级（working load limit/WLL）、安装方式（焊接或贯穿螺栓）以及受力方向；这些都会影响安全性。"]}
{"word":"padeyes","summary":{"en":"Padeyes are fixed metal attachment points used for securing or lifting.","zh":"padeyes 指固定在结构上的金属系固/起吊连接点（系固环、吊耳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong metal loop or eye fixed to a surface (like a ship’s deck, a wall, or equipment) used as an attachment point for ropes, chains, cables, or lifting gear.","zh":"（常见于船舶、甲板或设备上的）系固环/吊耳：固定在表面上的坚固金属环，用作绳索、链条、钢缆或起吊装置的连接点。"},"examples":[{"en":"The crew clipped the safety line to the padeye on the deck.","zh":"船员把安全绳扣到甲板上的系固环上。"},{"en":"Make sure the padeyes are rated for the load before lifting the crate.","zh":"起吊木箱前要确认吊耳的承载等级足够。"},{"en":"We installed new padeyes to secure the kayak during transport.","zh":"我们安装了新的系固环，用来在运输时固定皮划艇。"}]}],"synonyms":["padeye (singular)","tie-down point","lashing point","lifting eye","eye plate"],"phonetic":"/ˈpædˌaɪ/","extraExplanation":["“padeye”的复数是“padeyes”。它多用于航海、船舶工程、起重与索具（rigging）语境，强调“固定在结构上的受力连接点”。","与“cleat（系缆柱/系缆栓）”不同，padeye通常是一个“金属环/眼”，常配合卸扣（shackle）、吊钩（hook）、钢缆（cable）使用。"]}
{"word":"padfoot","summary":{"en":"“Padfoot” means a ghostly black dog in British folklore, and it’s also Sirius Black’s nickname in Harry Potter.","zh":"“Padfoot”在英国民间传说中指幽灵黑狗；在《哈利·波特》中也是小天狼星·布莱克的绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Folklore) a ghostly black dog said to appear at night, especially in Northern England; often seen as an omen.","zh":"（民间传说）夜间出没的幽灵黑狗，尤指英格兰北部传说中出现的“黑犬”，常被视为不祥之兆。"},"examples":[{"en":"In old stories, a padfoot might follow travelers along lonely roads at night.","zh":"在古老的故事里，padfoot 可能会在夜里沿着荒僻小路跟着旅人。"},{"en":"Some people believed seeing a padfoot meant trouble was coming.","zh":"有人相信看到 padfoot 预示着麻烦将至。"}]},{"partOfSpeech":"n.","definition":{"en":"(Harry Potter, nickname) Sirius Black’s code name, used by his friends in the Marauders’ group.","zh":"（《哈利·波特》中的绰号）小天狼星·布莱克（Sirius Black）的代号/外号，由“掠夺者”小团体使用。"},"examples":[{"en":"In the story, Harry learns that “Padfoot” is Sirius Black.","zh":"在故事中，哈利得知“Padfoot”就是小天狼星·布莱克。"},{"en":"The message warned that Padfoot was in danger.","zh":"信息警告说 Padfoot 处于危险之中。"}]}],"synonyms":["black dog","ghost dog","(Harry Potter) Sirius Black"],"phonetic":"/ˈpædˌfʊt/","extraExplanation":["“Padfoot”在英格兰北部与苏格兰边境一带的传说里，常与“black dog（黑犬）”类幽灵形象同类；有时也被当作“死亡预兆（omen）”的象征。","在《哈利·波特》中，这个外号与人物的“阿尼马格斯（Animagus，能变成动物的人）”身份相关：Sirius能变成一只大黑狗，因此朋友们用“Padfoot”作暗号称呼他。"]}
{"word":"padge","summary":{"en":"“padge” is usually a nonstandard spelling; most often it’s a typo for “page” or “badge.”","zh":"“padge”通常是不规范拼写；多半是把“page（页）”或“badge（徽章）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling in modern English; it is not a common dictionary word. In most contexts, people likely mean “page” or “badge.”","zh":"现代英语中不规范或常见的拼写错误；通常不作为标准词条使用。多数语境下人们可能想写的是“page（页）”或“badge（徽章）”。"},"examples":[{"en":"I couldn’t find “padge” in the dictionary—did you mean “page” or “badge”?","zh":"我在词典里找不到“padge”——你是不是想写“page（页）”或“badge（徽章）”？"},{"en":"The app says “padge,” but I think it’s a typo for “badge.”","zh":"这个应用写的是“padge”，但我觉得这是把“badge（徽章）”拼错了。"}]}],"synonyms":["page","badge"],"phonetic":"/pædʒ/","extraExplanation":["“padge”偶尔会出现在用户名、姓氏、品牌名或旧文献的变体拼写里，但在日常英语写作与考试中通常会被当作拼写错误。","如果你告诉我你看到“padge”的句子或上下文（例如一整句或截图），我可以帮你判断更可能是“page /peɪdʒ/（书页、页面）”还是“badge /bædʒ/（徽章、证章）”，或是否是专有名词。"]}
{"word":"padi","summary":{"en":"Padi means the rice plant or unhusked rice, especially in Southeast Asian English.","zh":"padi 指稻子或带壳稻谷，常见于东南亚英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Southeast Asia) The rice plant while it is growing, or rice grains that still have their husk (unhusked rice).","zh":"（东南亚用法）指正在生长的稻子；或指仍带稻壳的稻谷（未碾的米）。"},"examples":[{"en":"In Indonesia, farmers grow padi in flooded fields during the rainy season.","zh":"在印度尼西亚，农民常在雨季的水田里种植稻子（padi）。"},{"en":"The padi is dried before it is milled into rice.","zh":"稻谷（padi）在碾成大米之前要先晒干。"}]}],"synonyms":["rice plant","unhusked rice","paddy (regional/related)"],"phonetic":"/ˈpɑːdi/","extraExplanation":["“padi”常见于马来语/印尼语语境的英语（尤其在马来西亚、新加坡、印度尼西亚相关报道或对话中）。在更通用的英语里，人们更常说“rice plant / rice”或用“paddy”表示“稻田/稻谷”。","容易混淆：padi（稻子/稻谷，偏“作物/带壳谷粒”） vs. paddy field（稻田） vs. rice（米/稻米，常指去壳后的食用米）。"]}
{"word":"padige","summary":{"en":"“Padige” isn’t a recognized common English word; it’s likely a misspelling or a proper noun.","zh":"“padige”不是常见的英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a proper name (e.g., a surname, place name, or brand).","zh":"不是标准英语单词；更可能是拼写错误，或是专有名词（如姓氏、地名或品牌名）。"},"examples":[{"en":"I can’t find “padige” in an English dictionary—could you mean “padding” or “padlock”?","zh":"我在英语词典里找不到“padige”——你是不是想写“padding（填充/衬垫）”或“padlock（挂锁）”？"}]}],"extraExplanation":["“padige”在常见英语词典中不收录。如果你是在课本/文章/字幕里看到的，请把完整句子或截图发来，我可以根据上下文判断它可能是哪一个词。","常见的可能目标（按外形接近）：padding（衬垫；填充）、padlock（挂锁）、paradigm（范式/典范，拼写相差较大但读音可能被误听）、badge（徽章，字母相近）。"]}
{"word":"padina","summary":{"en":"Padina is a scientific name for a genus of brown seaweeds, sometimes called “peacock’s tail.”","zh":"Padina 指扇藻属，是一类褐藻的属名，有时被称为“孔雀尾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of brown seaweeds (marine algae), often called “peacock’s tail,” found in warm and temperate seas.","zh":"（生物）扇藻属：一种褐藻的属名，常被称为“孔雀尾”（peacock’s tail），分布于温暖与温带海域。"},"examples":[{"en":"Padina seaweeds often grow attached to rocks in shallow coastal water.","zh":"扇藻属的海藻常附着在近岸浅水区的岩石上生长。"},{"en":"Padina pavonica is sometimes nicknamed “peacock’s tail” because of its fan shape.","zh":"扇藻（Padina pavonica）因扇形外观，有时被昵称为“孔雀尾”。"}]}],"synonyms":["peacock’s tail (common name for some species)"],"phonetic":"/pəˈdiːnə/","extraExplanation":["“Padina”是拉丁化的生物分类名称（属名），在英文里通常用于科学或自然纪录片语境，而不是日常口语。","常见物种如 Padina pavonica，叶片呈扇形、表面常有同心环纹；在潮间带或浅海岩礁环境较常见。"]}
{"word":"padis","summary":{"en":"“Padis” means rice plants or unhusked rice (plural of “padi”), mainly used in South/Southeast Asian contexts.","zh":"“padis”指稻子或带壳稻谷（padi的复数），多见于南亚/东南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rice plants in the field, or rice grains still in their husks (a plural form of “padi,” used mainly in South and Southeast Asian contexts).","zh":"稻田里的稻子；或仍带稻壳的稻谷（“padi”的复数形式，多用于南亚与东南亚语境）。"},"examples":[{"en":"After the flood, many padis in the low fields were ruined.","zh":"洪水过后，低洼田里的许多稻子都毁了。"},{"en":"The farmer dried the padis before storing them.","zh":"农民把稻谷晒干后再储存。"}]}],"synonyms":["rice plants","rice crops","unhusked rice"],"phonetic":"/ˈpɑdiːz/","extraExplanation":["“padis”在标准英语里不算常见词，更多见于报道或描写马来西亚、印度尼西亚等地农业时的英语用法；在这些语境中，“padi/padis”常指“稻谷（带壳）”或“稻作/稻田里的稻子”。","在更常见的通用英语里，人们通常直接说“rice plants”“rice crops”或“unhusked rice”。"]}
{"word":"padishah","summary":{"en":"Padishah is a historical title meaning “emperor,” especially for Ottoman rulers.","zh":"Padishah 是历史性头衔，意为“皇帝/大帝”，尤指奥斯曼统治者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A title meaning “emperor,” used historically for the rulers of the Ottoman Empire and some Persian and South Asian empires.","zh":"“皇帝/大帝”的头衔；历史上用于奥斯曼帝国统治者，以及部分波斯和南亚帝国的君主。"},"examples":[{"en":"The Ottoman padishah ruled from Istanbul and commanded vast territories.","zh":"奥斯曼帝国的帕迪沙（皇帝）以伊斯坦布尔为都城，统治着广阔的领土。"},{"en":"In some historical texts, the ruler is addressed as the padishah to show supreme authority.","zh":"在一些历史文献中，人们称统治者为帕迪沙，以显示其至高无上的权威。"}]}],"synonyms":["emperor","sultan","shah"],"phonetic":"/ˈpɑːdɪˌʃɑː/","extraExplanation":["词源与用法：padishah（也常见拼写 padişah / padshah）来自波斯语，意为“国王之王/大王”，在英语里多用于历史语境，特别指奥斯曼苏丹的正式尊号之一。","文化与语体：这个词带有明显的历史与文学色彩，现代日常英语中很少用；在小说、历史书或带东方主义风格的文本里更常见。","相关词：sultan（苏丹，奥斯曼常用称号）、shah（沙阿，波斯国王）、emperor（皇帝，更通用的英语词）。"]}
{"word":"padishahs","summary":{"en":"“Padishahs” means “emperors/supreme rulers,” the plural of padishah, used mainly in historical Islamic-imperial contexts.","zh":"“padishahs”意为“皇帝/至高统治者”，是 padishah 的复数，主要用于历史上的伊斯兰帝国语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of padishah: a powerful emperor or supreme ruler, especially in the historical Islamic empires (notably the Ottoman and Persian worlds).","zh":"padishah 的复数：皇帝、至高统治者；尤指历史上的伊斯兰帝国中的最高君主（如奥斯曼、波斯等）。"},"examples":[{"en":"The chronicles describe Ottoman padishahs who ruled from Istanbul.","zh":"史书记载了从伊斯坦布尔统治的奥斯曼帝国诸位帕迪沙（皇帝）。"},{"en":"In some novels, the padishahs appear as distant figures of immense authority.","zh":"在一些小说里，帕迪沙常被写成遥远却权势滔天的统治者。"}]}],"synonyms":["emperors","sovereigns","monarchs","rulers"],"phonetic":"/ˈpɑːdəˌʃɑːz/","extraExplanation":["“Padishah”来自波斯语“pādishāh”（大王/皇帝），后来也用于奥斯曼土耳其语等语境。历史上它常被译作“皇帝”或“苏丹（的尊号）”，具体翻译取决于时代与国家。","在英文文学与流行文化中，这个词常用于营造“宫廷/帝国/东方历史”的氛围；例如在《沙丘》（Dune）系列中，“Padishah Emperor（帕迪沙皇帝）”是一个带有古典帝国色彩的称号。"]}
{"word":"padle","summary":{"en":"“Padle” is usually a misspelling of “paddle,” meaning a boat oar (noun) or to move a boat / wade in shallow water (verb).","zh":"“padle”通常是“paddle”的误拼，意思是“桨”（名词），或“划船/在浅水中趟水走”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat-bladed tool used to move a boat through water, usually by pushing and pulling it by hand.","zh":"（通常用手划的）桨；橹。"},"examples":[{"en":"He dipped the paddle into the water and the canoe moved forward.","zh":"他把桨插入水里，小独木舟就向前移动了。"},{"en":"Bring a paddle if you want to go kayaking on the lake.","zh":"如果你想在湖上划皮划艇，记得带桨。"}]},{"partOfSpeech":"v.","definition":{"en":"To move a small boat by using a paddle; to travel by paddling.","zh":"用桨划（船）；划行。"},"examples":[{"en":"We paddled across the river before sunset.","zh":"日落前我们划船过了河。"},{"en":"She learned to paddle in calm water first.","zh":"她先在平静水域学习划桨。"}]},{"partOfSpeech":"v.","definition":{"en":"To walk in shallow water, moving your feet slowly through it.","zh":"（在浅水中）涉水走；趟水。"},"examples":[{"en":"The kids paddled at the edge of the beach.","zh":"孩子们在海滩边的浅水处趟水玩。"}]}],"synonyms":["oar","row (for boats with oars)","wade (in shallow water)"],"phonetic":"/ˈpædəl/","extraExplanation":["“padle”通常不是标准拼写；你可能想找的是“paddle”。“paddle”既可以指名词“桨”，也可以作动词表示“划船/趟水走”。","常见搭配：paddle a canoe（划独木舟）, paddleboarding / stand-up paddleboarding（桨板运动）。"]}
{"word":"padles","summary":{"en":"“Paddles” usually means the plural of “paddle”: blades used to move a boat, or (in sports) small rackets; it can also be the verb form meaning “moves with a paddle.”","zh":"“paddles”通常是“paddle”的复数：指划船用的桨，也可指乒乓球等运动用的小球拍；也可作动词形式，表示“用桨划行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Flat blades used to push a boat through water, usually held in the hands (as in canoeing/kayaking) or attached to a boat (oars).","zh":"（名词复数）桨；橹：用来推动船在水中前进的扁平叶片，常见于皮划艇/独木舟（手持）或连接在船上（如橹）。"},"examples":[{"en":"We brought two paddles for the canoe.","zh":"我们给独木舟带了两把桨。"},{"en":"He dropped his paddles into the river by accident.","zh":"他不小心把桨掉进了河里。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Small handheld rackets used in games like ping-pong/table tennis.","zh":"（名词复数）球拍（多指乒乓球/桌球用的小拍）。"},"examples":[{"en":"Do we have extra paddles for table tennis?","zh":"我们还有多余的乒乓球拍吗？"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Moves through water by using a paddle; or pushes a boat forward with a paddle.","zh":"（动词第三人称单数）用桨划水前进；用桨推动小船前进。"},"examples":[{"en":"She paddles across the lake every morning.","zh":"她每天早上都划船穿过湖面。"},{"en":"He paddles the kayak close to the shore.","zh":"他把皮划艇划到靠近岸边。"}]}],"synonyms":["oars","blades","table tennis paddles","row"],"phonetic":"/ˈpædəlz/","extraExplanation":["你输入的 **padles** 常见是拼写错误，正确拼写通常是 **paddles**（中间有两个 d）。","**paddles** 既可以是名词复数（两把桨/多把桨、多个球拍），也可以是动词 **paddle** 的第三人称单数（“她划水/他划船”）。"]}
{"word":"padlike","summary":{"en":"“Padlike” means “like a pad”—soft, cushioned, or pad-shaped.","zh":"“padlike”表示“像垫子一样的”——柔软、有缓冲感或呈垫状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pad; cushion-like or shaped like a pad.","zh":"像垫子一样的；有软垫感的；呈垫状的。"},"examples":[{"en":"The padlike lining makes the helmet more comfortable.","zh":"这种垫状内衬让头盔更舒适。"},{"en":"She placed the cup on a padlike coaster to protect the table.","zh":"她把杯子放在垫状杯垫上以保护桌面。"}]}],"synonyms":["cushionlike","padded","spongy","soft"],"phonetic":"/ˈpædˌlaɪk/","extraExplanation":["“padlike”是由 pad（垫子、软垫）+ -like（像……一样的）构成的复合形容词，常见于说明书、产品描述、医学或工程写作，用来强调“外形/触感像垫子”。"]}
{"word":"padlock","summary":{"en":"A padlock is a portable lock; to padlock means to secure something with one.","zh":"padlock 指“挂锁”；作动词表示“用挂锁锁住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a portable lock (often with a U-shaped shackle) that can be opened with a key or combination and is used to secure things like gates, lockers, or luggage","zh":"挂锁；一种可携带的锁（常见为U形锁梁），用钥匙或密码打开，用来锁门、柜子、行李等"},"examples":[{"en":"He put a padlock on the gate to keep the yard secure.","zh":"他在大门上挂了把挂锁，确保院子安全。"},{"en":"My suitcase has a small padlock for travel.","zh":"我的行李箱有一把小挂锁，方便旅行时使用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fasten or secure something with a padlock","zh":"用挂锁锁住；用挂锁固定"},"examples":[{"en":"Please padlock the storage room after you finish.","zh":"你用完后请把储藏室用挂锁锁上。"},{"en":"They padlocked the bikes to the rack.","zh":"他们把自行车用挂锁锁在车架上。"}]}],"synonyms":["lock","combination lock","security lock"],"phonetic":"/ˈpædˌlɑk/","extraExplanation":["“padlock”通常指带锁梁（shackle）的挂锁；在美式英语中，人们也常说“combination lock（密码锁）”来强调不用钥匙。","常见搭配：padlock the gate/door（把门/门口上挂锁），a padlock on the locker（储物柜上的挂锁）。","相关词：lock（锁，泛称）；deadbolt（门闩锁，装在门上的）；shackle（锁梁/手铐的扣环）。"]}
{"word":"padlocked","summary":{"en":"Padlocked means secured with a padlock; it’s also the past form of “padlock.”","zh":"padlocked 指“用挂锁锁住的”，也可作动词 padlock 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"locked or fastened with a padlock (a small portable lock).","zh":"用挂锁锁住的；用挂锁固定的。"},"examples":[{"en":"The gate was padlocked to keep strangers out.","zh":"大门被挂锁锁上，以防陌生人进入。"},{"en":"All the storage rooms were padlocked after closing time.","zh":"打烊后，所有储藏室都用挂锁锁了起来。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past tense / past participle of “padlock”: to lock something with a padlock.","zh":"“padlock”的过去式/过去分词：用挂锁把某物锁上。"},"examples":[{"en":"They padlocked the shed and left for the weekend.","zh":"他们把工具棚用挂锁锁上，然后周末就离开了。"},{"en":"The door had been padlocked for months.","zh":"那扇门已经被挂锁锁了好几个月。"}]}],"synonyms":["locked","secured","fastened","bolted (sometimes)"],"phonetic":"/ˈpædˌlɑkt/","extraExplanation":["“padlocked”也可用于比喻，表示“被封口/被严密控制”。例如：My lips are padlocked.（我绝不透露秘密。）这种用法更偏口语或修辞表达。"]}
{"word":"padlocking","summary":{"en":"Padlocking means securing something with a padlock, or the act of doing so.","zh":"padlocking 指“用挂锁把某物锁住”，也可指“上挂锁的行为”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"locking something with a padlock; securing something by fastening it shut with a padlock.","zh":"用挂锁把某物锁住；用挂锁固定并加以保护。"},"examples":[{"en":"They were padlocking the gate after closing time.","zh":"他们在打烊后用挂锁把大门锁上。"},{"en":"She started padlocking her bike to the rack every day.","zh":"她开始每天把自行车用挂锁锁在车架上。"},{"en":"The staff finished padlocking the storage room for the night.","zh":"员工把储藏室用挂锁锁好，准备过夜。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of securing something with a padlock.","zh":"用挂锁上锁的行为；用挂锁加固的做法。"},"examples":[{"en":"The padlocking of emergency exits is illegal in many places.","zh":"在许多地方，把紧急出口上挂锁是违法的。"},{"en":"Regular padlocking of the shed helped prevent theft.","zh":"定期给棚屋上挂锁有助于防盗。"}]}],"synonyms":["locking","securing","bolting","fastening","latching"],"phonetic":"/ˈpædˌlɑkɪŋ/","extraExplanation":["“padlocking”来自名词“padlock（挂锁）”。除了字面“上挂锁”外，在新闻/商业语境里也可比喻为“把某事彻底封住或限制”，例如：padlocking an account（把账户锁住/冻结）或 padlocking a feature（暂时封禁某功能）。注意这类比喻用法通常出现在技术、平台规则或执法语境中。"]}
{"word":"padlocks","summary":{"en":"Padlocks are portable locks, or the action of securing something with a padlock.","zh":"Padlocks 指“挂锁”（复数），也可作动词表示“用挂锁锁住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Locks that are not fixed to a door or object and can be opened with a key, combination, or other mechanism; the plural of “padlock.”","zh":"挂锁；不固定在门或物体上的锁，可用钥匙、密码或其他方式打开；是“padlock”的复数。"},"examples":[{"en":"We bought two padlocks for our bikes.","zh":"我们买了两把挂锁来锁自行车。"},{"en":"The gym lockers require your own padlocks.","zh":"健身房的储物柜需要自带挂锁。"}]},{"partOfSpeech":"v.","definition":{"en":"To fasten or secure something with a padlock; the third-person singular present form of “padlock.”","zh":"用挂锁把某物锁住、固定；是动词“padlock”的第三人称单数现在时。"},"examples":[{"en":"He padlocks the gate every night.","zh":"他每晚都会用挂锁把大门锁上。"},{"en":"She padlocks her suitcase when she travels.","zh":"她旅行时会把行李箱上挂锁。"}]}],"synonyms":["locks","combination locks"],"phonetic":"/ˈpædˌlɑks/","extraExplanation":["“padlock”里“pad-”有“可移动/附加”的感觉，表示这种锁不是安装在门上的，而是可以随身携带、挂在链条、门闩或拉链孔上使用。","常见搭配：a padlock and key（挂锁和钥匙）、a combination padlock（密码挂锁）、to put a padlock on…（在……上挂锁）。"]}
{"word":"padmasana","summary":{"en":"Padmasana is the “lotus pose,” a classic cross-legged seated posture used in yoga and meditation.","zh":"Padmasana 指“莲花坐”，是一种经典的盘坐姿势，常用于瑜伽与冥想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seated yoga and meditation posture in which the legs are crossed and the feet rest on the opposite thighs; often used for steady breathing and mindfulness practice","zh":"（瑜伽/冥想中的）莲花坐：双腿交叉盘坐，双脚分别放在对侧大腿上；常用于稳定呼吸与专注冥想"},"examples":[{"en":"She sat in padmasana and focused on her breath for ten minutes.","zh":"她以莲花坐（padmasana）坐好，专注呼吸十分钟。"},{"en":"Padmasana can feel difficult at first if your hips are tight.","zh":"如果髋部比较紧，刚开始做莲花坐可能会觉得很难。"}]}],"synonyms":["lotus pose"],"phonetic":"/ˌpʌd.məˈsɑː.nə/","extraExplanation":["Padmasana 来自梵语：padma 意为“莲花”，āsana 意为“坐姿/体式”。英文中常写作 Padmasana（首字母大写）或 padmasana。","在瑜伽文化里，莲花象征“纯净与觉醒”，因此 padmasana 常与冥想、静坐练习联系在一起。","初学者不必勉强进入完整莲花坐；很多课程会先练“简易坐（easy pose）/半莲花坐（half lotus）”，以避免膝盖和髋部受伤。"]}
{"word":"padmelon","summary":{"en":"“Padmelon” is not a common English word; it’s likely a name, a coined term, or a misspelling.","zh":"“Padmelon”不是常见英语词；更可能是名称、自造词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a made-up term, a username/brand name, or a misspelling of something like “pad” + “melon” (two separate words).","zh":"不是标准英语单词。更可能是自造词、用户名/品牌名，或把类似“pad + melon”（两个词）拼在一起/拼错了。"},"examples":[{"en":"I can’t find “padmelon” in an English dictionary—did you mean “pad” or “melon”?","zh":"我在英语词典里找不到“padmelon”——你是想说“pad”还是“melon”？"},{"en":"“Padmelon” might be a product or account name rather than a real vocabulary word.","zh":"“Padmelon”可能是产品名或账号名，而不是正规的词汇。"}]}],"phonetic":"/ˈpædˌmɛlən/","extraExplanation":["如果你能告诉我你在哪里看到“padmelon”（例如一句话、游戏/软件界面、商品名、网名），我可以更准确判断它的意思。","若你想表达“用来垫着的西瓜/瓜类”，英语通常会说“a melon used as padding”（较少见）或直接用更自然的表达描述用途，而不会把它合成一个词。","也可能是拼写错误；把原句发来，我可以帮你定位可能的正确单词。"]}
{"word":"padnag","summary":{"en":"“padnag” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“padnag”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a username/proper name, so it does not have a fixed dictionary meaning in English.","zh":"不是标准英语单词。更可能是拼写错误、用户名或专有名词，因此在英语里没有固定的词典释义。"},"examples":[{"en":"I couldn’t find “padnag” in the dictionary—did you mean “Padang” or “pad and nag”?","zh":"我在词典里找不到“padnag”——你是不是想写“Padang”或“pad and nag”？"},{"en":"If you tell me the sentence you saw it in, I can help you guess the intended word.","zh":"如果你把它出现的句子发我，我可以帮你推测你想表达的词。"}]}],"phonetic":"/ˈpæd.næɡ/","extraExplanation":["“padnag”看起来像是把两个部分连在一起（例如 pad + nag）或把字母顺序打乱/漏空格导致的拼写问题。最常见的可能是：\n1) 你想写的是 **Padang**（印尼的一个城市名，也常见于菜名如 Padang food）；\n2) 你想写的是 **pad and nag**（两个词的组合）；\n3) 可能是某个专有名词（网名、游戏ID、产品名等）。\n把原句或你想表达的意思发来，我可以更准确判断。"]}
{"word":"padnags","summary":{"en":"“padnags” is not a standard English word; it’s likely a misspelling or a name/slang term.","zh":"“padnags”不是标准英语单词；更可能是拼写错误或某种名称/俚语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a slang/term from another language.","zh":"不是标准英语单词。可能是拼写错误，或来自其他语言/圈子的俚语或术语。"},"examples":[{"en":"I can’t find “padnags” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主流英语词典里找不到“padnags”——你能把看到它的句子发我吗？"},{"en":"If you meant “padlocks,” the meaning is very different.","zh":"如果你想写的是“padlocks（挂锁）”，那意思会完全不同。"}]}],"phonetic":"/ˈpædˌnæɡz/","extraExplanation":["“padnags”在英语里不常见/基本不存在。最常见的情况是：\n1）拼写误差（例如想写：padlocks 挂锁；paddings 填充物；pads 垫子；nagging 唠叨/纠缠）。\n2）专有名词（人名、网名、品牌名、游戏ID等）。\n3）来自其他语言或社群的用语。\n把它所在的上下文句子发来，我可以帮你判断最可能的目标词，并给出准确释义与用法。"]}
{"word":"padou","summary":{"en":"“Padou” is a rare/archaic spelling, usually referring to Padua (a city in Italy), and it can also be a surname.","zh":"“Padou”是罕见/古旧拼写，通常指意大利城市帕多瓦（Padua），也可能用作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare/archaic) An older French/English form of the place name “Padua,” a city in northern Italy.","zh":"（罕见/古旧）“Padua（帕多瓦）”这一意大利北部城市名的旧式法语/英语写法。"},"examples":[{"en":"In some older texts, Padua may appear as “Padou.”","zh":"在一些较老的文本中，Padua（帕多瓦）有时会写作“Padou”。"},{"en":"He studied medicine at Padou (Padua), according to the historical record.","zh":"史料记载，他曾在帕多瓦（Padou/Padua）学习医学。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"一个姓氏（家族姓氏）。"},"examples":[{"en":"Ms. Padou will join the meeting at 3 p.m.","zh":"Padou 女士将于下午三点参加会议。"}]}],"synonyms":["Padua"],"phonetic":"/pəˈduː/","extraExplanation":["“Padou”不是现代英语里常见的标准词汇；如果你是在学英语，通常应写作 **Padua**（帕多瓦）。帕多瓦以历史悠久的大学（University of Padua）以及与伽利略（Galileo）等人物的关联而闻名。","如果你原本想查的是发音类似的词，可能是 **paddle**（划桨/用桨划）、**padlock**（挂锁）、或 **padu**（多见于其他语言/专名）。你可以告诉我你看到它的句子，我可以帮你确认意思。"]}
{"word":"padouk","summary":{"en":"Padouk is a vivid orange-red tropical hardwood used in woodworking.","zh":"Padouk 指颜色鲜艳的橘红色热带硬木，常用于木工与家具等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical hardwood (often from Africa or Southeast Asia) known for its vivid orange-red color that can darken to reddish-brown over time; used for furniture, flooring, instruments, and carving.","zh":"紫檀木属（常见于非洲或东南亚的热带硬木）的木材，以鲜艳的橘红色著称，久了会逐渐变深成红褐色；常用于家具、地板、乐器和雕刻。"},"examples":[{"en":"The tabletop is made of padouk, so it has a bright reddish-orange tone.","zh":"这张桌面是用紫檀木（padouk）做的，所以呈现明亮的红橘色调。"},{"en":"Many woodworkers like padouk because it’s strong and visually striking.","zh":"很多木工喜欢紫檀木（padouk），因为它结实又很抢眼。"}]}],"synonyms":["padauk","Pterocarpus (wood)"],"phonetic":"/pəˈdʊk/","extraExplanation":["“Padouk / padauk”在英语里常见两种拼写。它并不等同于“rosewood（玫瑰木）”或“sandalwood（檀香木）”，而是另一类木材来源；不同地区的“padouk”可能指不同物种（如非洲的Pterocarpus soyauxii、亚洲的Pterocarpus indicus等）。","这种木材刚切开时颜色常非常鲜艳，随着光照与氧化会逐渐变暗；做木制品时常会用表面处理来减缓变色。"]}
{"word":"padouks","summary":{"en":"Padouks are pieces or types of padouk hardwood, known for a vivid reddish color and used in woodworking.","zh":"Padouks 指 padouk 硬木的复数，常见特点是颜色鲜红/橘红，常用于木工与家具等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of padouk: a type of tropical hardwood, often reddish-orange, used for furniture, flooring, instruments, and decorative woodworking.","zh":"padouk（帕杜克木/非洲紫檀等的俗称之一）的复数：一种热带硬木，常呈橘红到红褐色，用于家具、地板、乐器和装饰性木工。"},"examples":[{"en":"The woodworker compared padouks to walnut and maple for color and grain.","zh":"木工师把 padouks 和胡桃木、枫木在颜色和纹理上作了比较。"},{"en":"Many padouks darken over time from bright orange to a deeper reddish brown.","zh":"许多 padouks 会随着时间从亮橘色变深，变成更深的红褐色。"}]}],"synonyms":["padouk","padauk","Pterocarpus (padouk wood)"],"phonetic":"/pəˈduːk/","extraExplanation":["“padouk/padauk”两种拼写都常见；“padouks”是其复数形式。不同地区的“padouk”可能指不同树种，常见的是非洲产的 Pterocarpus soyauxii（在木材贸易中很常见）。","这种木材以颜色鲜艳著称，但会在光照与空气作用下逐渐变暗；在木工语境里常与“heartwood（心材）/sapwood（边材）”“grain（纹理）”“finish（表面涂装）”等词一起出现。"]}
{"word":"padpiece","summary":{"en":"A padpiece is a piece of padding used for protection, cushioning, or support.","zh":"padpiece 指一块用于保护、缓冲或支撑的垫片/衬垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of padding (often soft material) used to protect, cushion, or support something","zh":"（用来保护、缓冲或支撑的）垫片；衬垫的一块"},"examples":[{"en":"Put a padpiece under the laptop so it doesn’t scratch the table.","zh":"在笔记本电脑下面垫一块垫片，这样就不会刮花桌面。"},{"en":"The helmet’s padpiece came loose and needed to be replaced.","zh":"头盔里的垫片松了，需要更换。"},{"en":"The technician added a padpiece to reduce vibration.","zh":"技术人员加了一块垫片来减少震动。"}]}],"synonyms":["pad","padding","cushion","liner","insert"],"phonetic":"/ˈpædˌpis/","extraExplanation":["“padpiece”比较少见，更常见的写法是分开写成“pad piece”，意思就是“一块垫子/一块衬垫”。在不同场景里，它可能指护具里的海绵垫、设备减震用的软垫、家具/电子产品底部的防滑垫等。"]}
{"word":"padraic","summary":{"en":"Padraic is an Irish male name, the Irish form of Patrick.","zh":"Padraic 是一个爱尔兰男性名字，相当于 Patrick 的爱尔兰形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name of Irish origin (often spelled Pádraig in Irish). It is the Irish form of “Patrick.”","zh":"一个源自爱尔兰的男性名字（爱尔兰语常写作 Pádraig），相当于英文名“Patrick（帕特里克）”。"},"examples":[{"en":"Padraic is an Irish name related to Patrick.","zh":"Padraic 是一个与 Patrick（帕特里克）相关的爱尔兰名字。"},{"en":"Padraic introduced himself at the meeting.","zh":"Padraic 在会议上做了自我介绍。"}]}],"synonyms":["Patrick","Pádraig"],"phonetic":"/ˈpædriːk/","extraExplanation":["Padraic 通常来自爱尔兰语名 Pádraig（带长音符号 á），英语语境中常去掉重音写作 Padraic。","其来源可追溯到拉丁语 Patricius，常被解释为“贵族的 / 出身高贵的”。在文化上，这个名字也常让人联想到爱尔兰的圣帕特里克（St. Patrick）。","发音在不同地区可能有差异；在爱尔兰英语里常接近“PAW-drig / PAW-drik”的感觉。"]}
{"word":"padraig","summary":{"en":"Pádraig (also spelled Padraig) is an Irish male name, equivalent to Patrick.","zh":"Pádraig（也可写作 Padraig）是爱尔兰男性名字，相当于英文名 Patrick。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an Irish male given name; the Irish form of “Patrick.”","zh":"爱尔兰男性名字；相当于英文名“Patrick（帕特里克）”的爱尔兰语形式。"},"examples":[{"en":"Pádraig is the Irish form of the name Patrick.","zh":"Pádraig 是名字 Patrick 的爱尔兰语形式。"},{"en":"I met a guy named Pádraig at the conference.","zh":"我在会议上认识了一个叫 Pádraig 的人。"},{"en":"How do you pronounce Pádraig?","zh":"Pádraig 怎么读？"}]}],"synonyms":["Patrick","Pat"],"phonetic":"/ˈpɑːdrɪɡ/","extraExplanation":["“Pádraig”常见的爱尔兰语拼写是“Pádraig”（a 上有长音符号 fada：á 表示元音拉长）；在英语语境里也有人写作“Padraig”。","读音在不同地区会有差异；在北美英语里常被近似读作 /ˈpɑːdrɪɡ/（类似“PAH-drig”）。","它对应的英文名“Patrick”与爱尔兰的守护圣人 Saint Patrick（圣帕特里克）有关；因此这个名字在爱尔兰文化中很常见。"]}
{"word":"padre","summary":{"en":"“Padre” usually means a Catholic priest (often a military chaplain); it can also mean “father” in Spanish/Italian contexts.","zh":"“padre”通常指天主教神父（常见于军队语境的随军牧师）；在西/意语语境中也可表示“父亲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Catholic priest (especially used in the military or informally in English)","zh":"（尤指军队中或英语口语里用的）天主教神父；随军牧师"},"examples":[{"en":"The soldiers spoke with the padre before the mission.","zh":"士兵们在行动前和随军神父谈了谈。"},{"en":"We invited the padre to bless the new chapel.","zh":"我们请神父为新教堂祝福。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Spanish or Italian) “father”; a respectful form of address for a priest or one’s dad in some contexts","zh":"（源自西班牙语或意大利语）“父亲”；在某些语境中对神父或父亲的尊称/称呼"},"examples":[{"en":"In Spanish, “padre” means “father.”","zh":"在西班牙语里，“padre”的意思是“父亲”。"},{"en":"He called his dad “padre” as a family nickname.","zh":"他把爸爸当作家里的昵称叫“padre”。"}]}],"synonyms":["priest","chaplain","father (priest)"],"phonetic":"ˈpɑːdreɪ","extraExplanation":["“Padre”最常见于英语里指“天主教神父”，尤其在英美军队语境中常用来指“随军牧师/军中神父”（chaplain）。","它来自拉丁语词根，经过西班牙语/意大利语进入英语；因此在西语文化语境里也常直接表示“父亲”。","在美国文化中你还可能见到专有名词如 San Diego Padres（圣迭戈教士队，MLB球队名），这里的 Padres 是复数形式。"]}
{"word":"padres","summary":{"en":"“Padres” can mean Catholic priests (Spanish plural for “fathers”) or refer to the MLB team San Diego Padres.","zh":"“padres”在英语中可指天主教神父/教士（源自西语“父亲们”），也可指MLB球队圣迭戈教士队（San Diego Padres）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) Spanish word used in English to mean “fathers,” especially Catholic priests or clergy members.","zh":"（复数）源自西班牙语，在英语中常用来指“父亲们”，尤指天主教神父/教士。"},"examples":[{"en":"The padres at the mission held a community service on Sunday.","zh":"传教站的神父们在周日举行了社区礼拜。"},{"en":"Local history books describe how the padres built schools and churches.","zh":"地方史书描述了神父们如何修建学校和教堂。"}]},{"partOfSpeech":"n.","definition":{"en":"The San Diego Padres, a Major League Baseball (MLB) team.","zh":"圣迭戈教士队（San Diego Padres），美国职业棒球大联盟（MLB）球队。"},"examples":[{"en":"I’m watching the Padres game tonight.","zh":"我今晚要看教士队的比赛。"},{"en":"The Padres signed a new pitcher this season.","zh":"教士队本赛季签下了一位新投手。"}]}],"synonyms":["priests","clergy","fathers (Catholic clergy)","San Diego Padres (team name)"],"phonetic":"ˈpɑːdreɪz","extraExplanation":["“padres”来自西班牙语 padre（父亲）。在美国英语里，它常出现在与西班牙语文化相关的历史/宗教语境（如加州早期的传教站 missions）中。","作为球队名时，“Padres”通常大写，发音和含义与“神父/教士”这一文化背景相关。"]}
{"word":"padri","summary":{"en":"Padri can mean a priest (like “padre”), or historically a member of the Padri Islamic reform movement in West Sumatra, Indonesia.","zh":"Padri可指“神父/牧师”（类似padre），也可作历史用语，指印度尼西亚西苏门答腊帕德里伊斯兰改革运动的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Italian- or Spanish-speaking contexts) a priest, especially a Catholic priest; similar to “padre.”","zh":"（在意大利语/西班牙语语境中）神父、牧师（尤指天主教神父）；类似“padre”。"},"examples":[{"en":"The villagers asked the padri to bless the new school.","zh":"村民请那位神父为新学校祝福。"},{"en":"In the novel, the padri is a calm voice of advice for the family.","zh":"在小说里，那位神父是这个家庭冷静的建议者。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Padri movement, a group of Islamic reformists in West Sumatra (Indonesia) in the early 1800s.","zh":"（历史用语）帕德里运动成员：19世纪初印度尼西亚西苏门答腊的伊斯兰改革派群体成员。"},"examples":[{"en":"The conflict involved the Padri and local traditional leaders.","zh":"这场冲突涉及帕德里派与当地传统领袖。"},{"en":"Historians study how the Padri influenced religious and political life in the region.","zh":"历史学者研究帕德里派如何影响该地区的宗教与政治生活。"}]}],"synonyms":["padre","priest","clergyman"],"phonetic":"/ˈpɑːdri/","extraExplanation":["“Padri/帕德里”也常出现在“Padri War（帕德里战争，约1803–1837）”的历史语境中，指西苏门答腊的宗教与政治冲突。","在日常英语里更常见的是“padre”（如军队或宗教语境中的“神父/牧师”）。看到“padri”时，常意味着借用了意大利语/西班牙语的称呼，或是在讲印尼历史。"]}
{"word":"padrino","summary":{"en":"Padrino is Spanish for “godfather,” and it can also mean a sponsor/mentor; in pop culture it may refer to a powerful patron or crime boss.","zh":"padrino 是西语“教父”，也可指赞助人/导师；在流行文化中有时指有权势的靠山或黑帮头目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A godfather; in many Spanish-speaking cultures, a man chosen to support a child (often at baptism) and guide or help the family.","zh":"教父；在许多西语文化中，指被选来在宗教仪式（常见为洗礼）中担任孩子的教父，并在生活上支持孩子与家庭的男性。"},"examples":[{"en":"My padrino came to my baptism and has supported me ever since.","zh":"我的教父参加了我的洗礼，从那以后一直支持我。"},{"en":"In our family, the padrino gives advice and helps during important milestones.","zh":"在我们家里，教父会在重要的人生阶段给建议并提供帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"A sponsor or mentor who supports someone’s success (for example, at a wedding, a community event, or in a program).","zh":"赞助人；引路人/导师（例如在婚礼、社区活动或某个项目中支持他人成功的人）。"},"examples":[{"en":"She found a padrino who helped her apply for college.","zh":"她找到了一位“padrino”，帮助她申请大学。"},{"en":"The event needed padrinos to sponsor the costumes and food.","zh":"这个活动需要赞助人来资助服装和食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Pop culture) A powerful patron or crime boss; this sense is strongly associated with films and stories about the mafia.","zh":"（流行文化）有权势的靠山/黑帮头目；这一含义常与黑手党题材影视作品相关。"},"examples":[{"en":"In the movie, the padrino controls the neighborhood through fear and favors.","zh":"在电影里，这个“padrino”通过恐惧与人情控制着社区。"},{"en":"Be careful with this meaning—it can sound like you’re referring to organized crime.","zh":"使用这个意思要小心——听起来像是在指涉有组织犯罪。"}]}],"synonyms":["godfather","sponsor","mentor","patron"],"phonetic":"/pɑˈdɾino/","extraExplanation":["“Padrino”是西班牙语词，字面来自“padre（父亲）”。对应的女性形式是“madrina（教母）”。","在拉丁美洲与西班牙的许多地区，“padrino/madrina”不仅是宗教身份，也是一种社会关系：在关键时刻提供帮助、资源或建议，被视为一种长期的承诺与互相照应。","英语里有时会直接借用padrino（尤其在双语社区），但更常见的标准表达仍是“godfather”或“sponsor/mentor”，具体看语境。"]}
{"word":"padroadist","summary":{"en":"“Padroadist” isn’t a standard English word; you likely mean “parodist,” a person who makes parodies (humorous imitations).","zh":"“padroadist”不是标准英文词；你可能想写“parodist”，指创作或表演戏仿（幽默模仿）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a person who creates parodies—humorous imitations of another work, style, or person.","zh":"（可能是你想写的词）写/表演“戏仿”（parody）的人——用幽默方式模仿某个作品、风格或人物。"},"examples":[{"en":"The parodist posted a funny video that copied the singer’s style.","zh":"那位戏仿作者发了一段搞笑视频，模仿了那位歌手的风格。"},{"en":"As a parodist, she exaggerates small details to make people laugh.","zh":"作为戏仿者，她会夸大小细节来逗人发笑。"}]},{"partOfSpeech":"n.","definition":{"en":"a performer or writer known for parodying public figures or genres (often in comedy).","zh":"（常用于喜剧语境）以模仿、调侃公众人物或某一类型作品而出名的表演者/作者。"},"examples":[{"en":"The TV show hired a parodist to imitate famous politicians.","zh":"这个电视节目请了一位戏仿演员来模仿知名政客。"},{"en":"He became a popular parodist online because his sketches were clever, not mean.","zh":"他在网上成了很受欢迎的戏仿者，因为他的短剧很机智但不刻薄。"}]}],"synonyms":["parody writer","impersonator (in comedy)","satirist (close, but not identical)"],"phonetic":"/ˈpɛrəˌdɪst/","extraExplanation":["“padroadist”不是常见英文单词，可能是拼写错误。最接近、最常用的词是 **parodist**（戏仿者）。","相关词：**parody**（n./v. 戏仿）、**parody someone/something**（动词短语：戏仿某人/某物）。","文化提示：英语里 *parody* 通常指“幽默模仿”，不一定是恶意嘲讽；若带攻击性、更接近 *mock* 或 *satirize*。"]}
{"word":"padroado","summary":{"en":"Padroado is a historical Portuguese system of royal control and patronage over Catholic Church affairs in overseas territories.","zh":"Padroado 指葡萄牙历史上的一种王室对海外殖民地天主教会事务进行资助并加以控制的“保教权”制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A system of royal patronage in the Portuguese (and sometimes Spanish) empires in which the crown had the right to organize, fund, and influence Catholic Church affairs in overseas territories (for example, appointing bishops and controlling missions).","zh":"（历史）“保教权/王室护教权”制度：葡萄牙（有时也指西班牙）王室在海外殖民地对天主教会拥有组织、资助与干预的权力（如任命主教、管理传教事务）。"},"examples":[{"en":"Under the Padroado, the Portuguese crown played a major role in appointing church officials in Goa.","zh":"在“Padroado（保教权）”制度下，葡萄牙王室在果阿任命教会官员方面起了重要作用。"},{"en":"Historians debate how the Padroado shaped Catholic missions in Asia and Africa.","zh":"历史学者讨论“Padroado”如何影响天主教在亚洲与非洲的传教活动。"}]}],"synonyms":["royal patronage","(Portuguese) royal patronage system","Patronato Real"],"phonetic":"ˌpɑːdrəˈwɑːdoʊ","extraExplanation":["“Padroado”是葡萄牙语词，常见于历史写作（尤其是葡萄牙帝国、果阿、澳门、巴西等地的教会史）。英语文章里通常保留原词并首字母大写（the Padroado）。","它与西班牙语体系中的“Patronato Real（王室保教权）”相近：王权与教会在殖民扩张中相互依赖，王室提供经费与保护，换取对教会人事与行政的影响力。"]}
{"word":"padrona","summary":{"en":"Padrona is an Italian loanword meaning a female boss/owner or woman in charge (often a landlady).","zh":"padrona是意大利语借词，指女老板/女主人/女房东，即掌管事务的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Italian) a female boss, owner, or the woman in charge (for example, a landlady or female employer).","zh":"（源自意大利语）女老板；女主人；女房东；负责掌管事务的女性（如女雇主）。"},"examples":[{"en":"In the novel, the padrona runs the household with strict rules.","zh":"在小说里，这位padrona用严格的规矩管理整个家。"},{"en":"The tenants complained that the padrona raised the rent again.","zh":"房客抱怨这位女房东（padrona）又涨房租了。"},{"en":"He spoke politely to the padrona of the café before asking for a job.","zh":"他在求职前先礼貌地跟咖啡馆的女老板（padrona）打了招呼。"}]}],"synonyms":["female boss","owner","landlady","mistress (of the house)"],"phonetic":"/pɑˈdroʊnə/","extraExplanation":["“Padrona”是意大利语阴性名词，对应阳性形式是“padrone”（男主人/老板）。在英语里多作为外来词出现在文学作品、移民社区语境或意大利文化相关场景中，用来带出“意大利氛围”。","有时在美国英语中（尤其在影视/黑帮题材里）会借用意大利语称呼来指“女当家/女掌权者”，但日常英语更常说“boss / owner / landlady”。使用时注意语境，避免把它当作通用英语词。"]}
{"word":"padrone","summary":{"en":"A loanword from Italian meaning “boss/master,” and historically in the U.S. an often-exploitative labor contractor for immigrants.","zh":"意大利语借词，意为“老板/主人”；在美国历史语境中也指常带剥削色彩的移民劳工包工头/中间人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Italian contexts) a boss or master; an employer or person in control.","zh":"（尤指意大利语语境）老板、主人；雇主或掌控者。"},"examples":[{"en":"In the old neighborhood, everyone knew who the padrone of the restaurant was.","zh":"在老街区里，大家都知道那家餐馆的老板是谁。"},{"en":"He spoke to his padrone with great respect.","zh":"他非常恭敬地和他的主人/老板说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, U.S.) a labor contractor or middleman who recruited and managed immigrant workers, often exploiting them.","zh":"（历史用法，美国）招募并管理移民劳工的包工头/中间人，常带有剥削意味。"},"examples":[{"en":"The book describes how padrones controlled jobs and housing for new arrivals.","zh":"这本书描述了包工头如何掌控新移民的工作和住宿。"},{"en":"Reformers criticized the padrone system for taking unfair fees from workers.","zh":"改革者批评“包工头制度”向工人收取不公平的费用。"}]}],"synonyms":["boss","master","employer","labor contractor","foreman"],"phonetic":"/pəˈdroʊni/","extraExplanation":["“padrone”源自意大利语，字面意思接近“主人/老板”。在美国史上，它常和19世纪末至20世纪初的“padrone system（包工头制度）”一起出现：一些中间人替移民（尤其是意大利移民）找工作、安排住处与交通，但也可能通过抽成、收费、控制信息等方式剥削工人。","语体提示：现代英语里单独使用 padrone 往往带一点“旧时代/特定族群历史”的色彩；若只想表达“老板”，更常用 boss / employer / manager。"]}
{"word":"padrones","summary":{"en":"“Padrones” is a Spanish plural meaning official registers—often voter rolls or census lists.","zh":"“Padrones”是西班牙语复数，常指官方登记名册，尤指选民名册或人口普查名单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural) official registers or lists, especially voter rolls or census/household registers.","zh":"（西班牙语复数）官方登记册/名单，尤指选民名册或人口普查、住户登记册。"},"examples":[{"en":"The journalists compared the names on the padrones with the official voter database.","zh":"记者把选民名册（padrones）上的名字与官方选民数据库进行了对比。"},{"en":"Families were recorded in the local padrones during the census.","zh":"在人口普查期间，当地登记册（padrones）记录了各个家庭信息。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural) standards or patterns used as a model (less common in English contexts).","zh":"（西班牙语复数）规范；模式/范式（在英语语境中较少见）。"},"examples":[{"en":"The report discusses governance padrones used across different regions.","zh":"报告讨论了不同地区采用的治理规范（padrones）。"}]}],"synonyms":["registry","register","roll","roster","census list"],"phonetic":"/pəˈdɾoʊneɪs/","extraExplanation":["“Padrones”是西班牙语单数“padrón”的复数形式。在英语新闻、历史研究或拉美相关语境中常直接借用，用来指“选民名册/登记册”。常见搭配：padrón electoral（选民名册）、padrón municipal（市政登记）、padrón de habitantes（居民登记）。","西班牙语里重音在第二个音节（pa-DRON-es）。不同国家/地区对“padrón”的具体所指可能略有差异，但核心概念都是“用于官方管理的登记名录”。"]}
{"word":"padroni","summary":{"en":"Padroni refers to Italian “bosses,” especially the labor contractors who controlled immigrant workers in US history.","zh":"Padroni 指意大利语“老板/主人”，在美国历史中常特指控制并常剥削移民工人的意大利裔包工头/劳工中介。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US history) Italian labor bosses or contractors who controlled and often exploited immigrant workers, especially in the late 1800s and early 1900s.","zh":"（美国历史）“包工头/老板”，多指意大利裔劳工中介或工头，常控制并剥削移民工人（尤指19世纪末至20世纪初）。"},"examples":[{"en":"Many Italian immigrants depended on padroni to find jobs, but the arrangement could be abusive.","zh":"许多意大利移民依赖 padroni 找工作，但这种安排可能带有虐待和剥削。"},{"en":"Reformers criticized the padrone system for trapping workers in debt.","zh":"改革者批评“padrone 制度”让工人陷入债务困境。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of Italian padrone (“boss; master; proprietor”), sometimes used in English writing about Italian society or culture.","zh":"意大利语 padrone（“老板；主人；业主”）的复数形式，有时在英语中用于描述意大利社会或文化语境。"},"examples":[{"en":"In the novel, the servants fear the padroni of the estate.","zh":"在小说里，仆人们害怕庄园的主人们（padroni）。"},{"en":"The guide explained how shop owners—padroni—ran family businesses.","zh":"导游解释了店主们（padroni）如何经营家族生意。"}]}],"synonyms":["labor contractor","boss","foreman","middleman","padrone system"],"phonetic":"/pɑˈdroʊni/","extraExplanation":["“padroni”常出现在美国移民史与劳工史语境中，尤其与“padrone system（包工头制度/劳工中介制度）”相关：一些中介替移民安排工作、食宿与交通，但也可能收取高额费用、扣薪或用债务控制工人。","语感提示：在现代英语里它并不常用，且带有明显历史与批判色彩；如果只是泛指“老板”，更常用 boss, employer, manager 等。","词源提示：来自意大利语 padrone（主人/老板），英语里偶尔直接借用其复数 padroni。"]}
{"word":"padronism","summary":{"en":"Padronism is a rare term meaning a system or practice based on a padrón (official register), sometimes implying political manipulation through control of registration lists.","zh":"Padronism 是个少见词，指以 padrón（官方名册）为基础的制度或做法；有时也暗指通过控制登记名册来进行政治操控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system or practice centered on a padrón (an official register or list, especially a census list or voter roll in Spanish-speaking contexts).","zh":"以 padrón（官方名册；常指西语国家的人口普查名册或选民名册）为核心的一种制度或做法。"},"examples":[{"en":"Some historians describe padronism as the habit of organizing local politics around the voter roll.","zh":"一些历史学者把 padronism 描述为围绕选民名册来组织地方政治的习惯。"},{"en":"Critics argued that padronism made public services depend too much on being listed in the register.","zh":"批评者认为 padronism 让公共服务过度依赖是否被登记在名册中。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, a political practice in which control of the register (the padrón) is used to influence elections or distribute benefits.","zh":"较少见：一种政治操作，通过控制名册（padrón）来影响选举或分配资源与利益。"},"examples":[{"en":"The report accused local officials of padronism—using registration records to pressure voters.","zh":"报告指控地方官员搞 padronism——利用登记资料向选民施压。"},{"en":"Reforms were introduced to reduce padronism and increase transparency in voter registration.","zh":"为减少 padronism、提高选民登记透明度，政府推出了改革。"}]}],"synonyms":["registration system","voter-roll politics","patronage (context-dependent)"],"phonetic":"/ˈpɑːdrəˌnɪzəm/","extraExplanation":["这个词非常少见，通常出现在讨论西语地区行政与政治的语境中。它来自西班牙语 padrón（名册、登记簿），在不同国家可能特指人口普查名册、户籍名册或选民名册。","如果你是在特定文章/书里看到 padronism，它的具体含义往往取决于作者：可能是中性地指“名册制度”，也可能带批评意味，指“用名册控制资源或影响选举”的做法。"]}
{"word":"pads","summary":{"en":"“Pads” usually means protective/soft cushions (plural of pad), and it can also mean sanitary pads or notepads; as a verb, it means to add padding or move quietly.","zh":"“pads”通常是pad的复数，指护垫/软垫；也常指卫生巾或便签本；作动词时表示加衬垫或轻手轻脚地走。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft cushions or layers used to protect, support, or make something more comfortable (often attached to the body or equipment).","zh":"（常指固定在身体或装备上的）护垫；软垫；用于保护、支撑或增加舒适度的垫子。"},"examples":[{"en":"Wear knee pads when you skate.","zh":"滑冰时要戴护膝（护垫）。"},{"en":"The shoulder pads make the backpack more comfortable.","zh":"背包的肩垫让背起来更舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"Absorbent products used for menstruation (sanitary pads).","zh":"（月经用）卫生巾。"},"examples":[{"en":"She bought pads at the pharmacy.","zh":"她在药店买了卫生巾。"},{"en":"Do you have an extra pad?","zh":"你有多一片卫生巾吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Small pads of paper used for writing notes (notepads).","zh":"（写字记事用的）便签本；记事本。"},"examples":[{"en":"I keep a pad by the phone for messages.","zh":"我在电话旁放了一个记事本用来记留言。"},{"en":"He filled three pads with ideas.","zh":"他写满了三本记事本的点子。"}]},{"partOfSpeech":"n.","definition":{"en":"The soft, thick parts on the bottom of an animal’s feet (paw pads).","zh":"（动物脚掌底部的）肉垫。"},"examples":[{"en":"The dog’s pads were dirty after the walk.","zh":"散步回来后狗狗的肉垫很脏。"}]},{"partOfSpeech":"v.","definition":{"en":"Adds soft material for protection or comfort; also, to walk or move softly and quietly.","zh":"加衬垫以起到保护/舒适作用；也可指轻轻地走（动作轻、声音小）。"},"examples":[{"en":"He pads the package with bubble wrap.","zh":"他用气泡膜把包裹垫好防震。"},{"en":"She pads across the room in slippers.","zh":"她穿着拖鞋轻轻走过房间。"}]}],"synonyms":["cushions","padding","protectors","sanitary pads","notepads"],"phonetic":"/pædz/","extraExplanation":["“pads”最常见是名词复数（护垫/垫子/卫生巾/便签本等）。在句子里如果作动词，通常是第三人称单数（He pads...），表示“加垫”或“轻手轻脚地走”。","与运动相关的固定搭配很多：knee pads（护膝）、elbow pads（护肘）、shoulder pads（肩垫）。与写作相关：notepad / writing pad（记事本）。与航天相关：launch pad（发射台）。"]}
{"word":"padsaw","summary":{"en":"Pad saw: a small hand saw used mainly to cut holes in drywall/plasterboard.","zh":"Pad saw：主要用于在石膏板/干墙上开孔的小型手持锯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hand saw with a narrow blade used for cutting holes or small openings, especially in drywall or plasterboard","zh":"（尤指切割石膏板/干墙用的）手持小锯，常用于开孔或切小开口"},"examples":[{"en":"He used a pad saw to cut an opening for the electrical outlet in the drywall.","zh":"他用干墙锯在石膏板上切了一个插座开口。"},{"en":"A pad saw is handy for small jobs where a power tool is unnecessary.","zh":"做一些不需要电动工具的小活儿时，干墙锯很顺手。"}]}],"synonyms":["drywall saw","jab saw","keyhole saw"],"phonetic":"/ˈpæd ˌsɔ/","extraExplanation":["“pad saw”在北美更常见于装修/木工语境，尤其是切干墙（drywall）时。也常被叫作“jab saw”或“drywall saw”。有些款式的锯片可更换。","你输入的“padsaw”更像是把两个词连写；标准写法通常是分开的“pad saw”。"]}
{"word":"padshah","summary":{"en":"Padshah is a historical title meaning “emperor,” most often referring to Mughal rulers in India.","zh":"Padshah 是一个历史称号，意为“皇帝”，最常用来指印度莫卧儿帝国的君主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A title meaning “emperor” or “great king,” especially used for the Mughal rulers of India and some Persian/Ottoman monarchs.","zh":"“皇帝 / 大王”的称号，尤其指印度莫卧儿帝国的统治者，也可指部分波斯或奥斯曼君主。"},"examples":[{"en":"Akbar was a powerful padshah of the Mughal Empire.","zh":"阿克巴是莫卧儿帝国一位强大的帕德沙（皇帝）。"},{"en":"The chronicle describes the padshah’s court as wealthy and highly ceremonial.","zh":"史书把这位帕德沙（皇帝）的宫廷描写得富丽而礼仪繁复。"}]}],"synonyms":["padishah","emperor","sovereign","monarch"],"phonetic":"/pɑːdˈʃɑː/","extraExplanation":["“padshah”常见的另一种拼写是“padishah”（更接近原词音形）。在英语里它多出现在历史、文学或影视语境中，带有特定文化与时代色彩，通常不用于现代国家元首的正式称呼。","词源来自波斯语等语言体系，核心含义是“至高统治者/皇帝”。在南亚历史语境里，最常指莫卧儿帝王（如阿克巴、沙贾汗、奥朗则布等）。"]}
{"word":"padshahs","summary":{"en":"Padshahs means “kings/emperors,” especially Muslim rulers in Persianate and Mughal contexts.","zh":"padshahs 指“国王/皇帝们”，尤用于波斯文化圈与莫卧儿帝国语境中的穆斯林君主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of padshah: a king or emperor, especially a Muslim ruler in Persia, Afghanistan, or the Mughal Empire in India.","zh":"padshah 的复数：国王或皇帝，尤指波斯、阿富汗或印度莫卧儿帝国的穆斯林统治者。"},"examples":[{"en":"The chronicle praises the padshahs who expanded the empire.","zh":"编年史称颂了那些扩张帝国的帕迪沙（皇帝们）。"},{"en":"Many stories describe how the padshahs ruled with both ceremony and power.","zh":"许多故事描写帕迪沙们如何以仪式与权力并行来统治。"}]}],"synonyms":["emperors","kings","monarchs","sovereigns"],"phonetic":"/pɑdˈʃɑz/","extraExplanation":["“padshah”（也写作 *padishah*）来自波斯语 *pādshāh*，大意是“君王/大王”。在英语语境里常用来指莫卧儿帝国的皇帝（如阿克巴 Akbar、沙贾汗 Shah Jahan 等），也可更广义地指伊朗、阿富汗一带的君主。","拼写提示：*padshahs* 是常见复数写法；也可能见到 *padishahs*。在历史类或文学类文本中较常出现。"]}
{"word":"padstone","summary":{"en":"A padstone is a load-spreading stone/concrete block built into a wall under the end of a beam, girder, lintel, or arch.","zh":"padstone 指嵌入墙体中、用于在梁/钢梁/过梁/拱端部下分散荷载的承垫石（或混凝土承垫块）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone block (or concrete block) built into a wall to spread the weight from the end of a beam, girder, or arch onto a larger area of masonry","zh":"（建筑）垫石；承垫石：嵌在墙体中的石块（或混凝土块），用来把梁、钢梁或拱的端部荷载分散到更大的砌体面积上"},"examples":[{"en":"The steel beam rests on a padstone to prevent cracking in the brickwork.","zh":"这根钢梁搁在垫石上，以防止砖墙开裂。"},{"en":"The engineer specified a larger padstone under the lintel.","zh":"工程师要求在过梁下面使用更大的垫石。"}]}],"synonyms":["bearing stone","bearing block","concrete bearing pad","support block"],"phonetic":"ˈpædˌstoʊn","extraExplanation":["“padstone”在英式建筑英语中更常见，也常写作两个词：pad stone。美式语境里也会用，但更常见的说法可能是“bearing stone / bearing block（承压石/承压块）”或直接说“concrete bearing pad”。","垫石的核心作用是“分散集中荷载（spread the load）”，避免梁端把压力集中在少量砖或砌块上，从而导致压碎或开裂。"]}
{"word":"padtree","summary":{"en":"“padtree” is not a common dictionary word; it’s likely a proper name or a misspelling of “pad tree.”","zh":"“padtree”不是常见词典词汇；更可能是专有名词或把“pad tree”误写成一个词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a proper name (e.g., a project/library name) or a misspelling of “pad tree” (two words). If you tell me the context (software, hardware, biology, etc.), I can define it more precisely.","zh":"不是标准英语词汇；通常是专有名称（如某个项目/库的名字），或是把“pad tree”（两个词）写成了一个词。如果你提供使用场景（软件、硬件、生物等），我可以给出更准确的释义。"},"examples":[{"en":"I couldn’t find a dictionary definition for “padtree,” but it may be a product or library name.","zh":"我查不到“padtree”的词典释义，但它可能是某个产品或程序库的名称。"},{"en":"Did you mean “pad tree” (two words) or a specific tool called “PadTree”?","zh":"你是想写“pad tree”（两个词），还是指一个叫“PadTree”的特定工具？"}]}],"synonyms":["pad tree","PadTree (proper name)"],"phonetic":"/ˈpædˌtri/","extraExplanation":["在英语里，很多“看起来像单词”的写法其实是专有名词（产品名、开源项目名、公司内部工具名），词典一般不会收录。","如果你是在代码/论文/说明书里看到的，请贴出一句原文或说明领域；我可以按该领域的常见用法解释，顺便给出同义表达和更自然的英文写法。"]}
{"word":"paduan","summary":{"en":"“Paduan” means a combination or blend (commonly used in Malay/Indonesian contexts).","zh":"“paduan”意为“组合/融合/混合”，多见于马来语或印尼语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword, Malay/Indonesian) a combination; a blend or mixture of things put together.","zh":"（马来语/印尼语借词）组合；混合；把多种事物融合在一起的搭配。"},"examples":[{"en":"This dish is a paduan of sweet, spicy, and sour flavors.","zh":"这道菜是甜、辣、酸风味的融合（paduan）。"},{"en":"The music is a paduan of traditional instruments and modern beats.","zh":"这段音乐是传统乐器与现代节拍的结合（paduan）。"}]}],"synonyms":["combination","blend","mixture","fusion"],"phonetic":"/pəˈduːən/","extraExplanation":["“paduan”主要见于马来语/印尼语语境（如菜单、旅游介绍、文化文章），英语里不算常用词；在正式英文写作中通常用 combination / blend / mixture / fusion 来表达。","在马来语/印尼语中它与“融合、整合”的意思相关，常用来描述口味、文化元素、风格或材料的“搭配与融合”。"]}
{"word":"paduanism","summary":{"en":"Paduanism means a style or influence associated with Padua (Italy), most often in art or cultural history.","zh":"Paduanism 指与意大利帕多瓦相关的风格或影响，多见于艺术史或文化史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The style, characteristics, or influence associated with Padua (Paduan), especially in Renaissance art, architecture, or scholarship.","zh":"（帕多瓦式）与意大利帕多瓦（Padua）相关的风格、特征或影响，尤指文艺复兴时期的艺术、建筑或学术传统。"},"examples":[{"en":"Some historians describe the painting’s sharp perspective and sculptural figures as a kind of Paduanism.","zh":"一些历史学者把这幅画锐利的透视和雕塑般的人物形体称为一种“帕多瓦式”（Paduanism）。"},{"en":"The church decoration shows traces of Paduanism, likely linked to artists trained near Padua.","zh":"这座教堂的装饰带有帕多瓦风格的痕迹，可能与在帕多瓦附近受训的艺术家有关。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, anything considered characteristically Paduan, including language habits or local cultural features.","zh":"更广义地指任何被认为具有帕多瓦地方特色的事物，包括语言习惯或地方文化特征。"},"examples":[{"en":"The play uses a few words of dialect as a light touch of Paduanism.","zh":"这部戏剧加入了少量方言词，作为一点点帕多瓦地方色彩。"}]}],"synonyms":["Paduan style","Paduan influence","Padua-related characteristics"],"phonetic":"/pæˈduːəˌnɪzəm/","extraExplanation":["“Paduanism”非常少见，更多时候人们会直接用形容词“Paduan（帕多瓦的）”来描述风格或影响。","帕多瓦是意大利威尼托大区的重要城市，文艺复兴时期以大学与学术传统闻名，也与一些艺术流派与技法发展有关；因此该词常在艺术史/文化史语境中偶尔出现。"]}
{"word":"paduasoy","summary":{"en":"“paduasoy” isn’t a standard English word; it likely combines “Padua” + “soy” or is a name/label.","zh":"“paduasoy”不是标准英语词；可能是“Padua（帕多瓦）+ soy（大豆）”的组合，或是名称/标签。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a combination of “Padua” (a city in Italy) + “soy” (soybean/soy products), or possibly a username/brand name. If you meant one of those words, see the examples below.","zh":"不是标准英语词。看起来像把“Padua（意大利城市帕多瓦）”+“soy（大豆/豆制品）”连在一起，或可能是用户名/品牌名。如果你想查其中一个词，可参考下面例句。"},"examples":[{"en":"Padua is a city in northern Italy, near Venice.","zh":"Padua（帕多瓦）是意大利北部的一座城市，靠近威尼斯。"},{"en":"Soy milk is a common dairy-free drink.","zh":"豆奶（soy milk）是一种常见的无乳制品饮料。"},{"en":"This label says “Padua soy,” but I’m not sure if it’s a brand name or a place-of-origin note.","zh":"这个标签写着“Padua soy”，但我不确定这是品牌名还是产地说明。"}]}],"synonyms":["Padua","soy","soybean"],"phonetic":"/ˈpædʒuə sɔɪ/","extraExplanation":["“Padua”在英语里通常指意大利城市“帕多瓦”（也与“圣安东尼（St. Anthony of Padua）”相关）。 “soy”是“大豆/豆制品”。两者连写成“paduasoy”并非常见词汇，可能是拼写、分词（Padua soy）、商品标签、用户名或特定语境用法。","如果你能提供一句原文（它出现的句子/网页/包装）或说明你想表达的是地名、食品、还是品牌/账号名，我可以给出更准确的释义与用法。"]}
{"word":"paduasoys","summary":{"en":"“paduasoys” isn’t a recognized English dictionary word; it’s likely a name, a typo, or “Padua” + “soys.”","zh":"“paduasoys”不是常见词典词；更可能是专有名称、拼写错误，或“Padua”与“soys”的组合。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a combined phrase (for example, “Padua” + “soys”), a brand/username, or a project name.","zh":"不是标准英语单词。它看起来像拼写错误或把两个词合在一起（例如“Padua”+“soys”），也可能是品牌名/用户名/项目名。"},"examples":[{"en":"I can’t find “paduasoys” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“paduasoys”——你能把它出现的句子发我吗？"},{"en":"Did you mean “Padua” (a city in Italy) or “soy/soys” (a type of bean/food ingredient)?","zh":"你是想写“Padua”（意大利的一座城市）还是“soy/soys”（大豆/豆制品原料）吗？"}]}],"phonetic":"/pəˈduːə sɔɪz/","extraExplanation":["从拼写看，“paduasoys”可能是：\n1）把两个词连写：Padua（帕多瓦/意大利城市）+ soys（soy 的复数/指大豆或豆制品）；\n2）人名、网名、店名或品牌名（这类专有名词通常不进普通词典）；\n3）单纯拼错了（例如多打/少打字母）。\n\n如果你把它出现的上下文（整句或截图）发来，我可以更准确判断含义，并给出对应词条。"]}
{"word":"padus","summary":{"en":"Padus is a botanical term for bird-cherry-type trees, sometimes treated as a genus or as part of the cherry genus Prunus.","zh":"Padus 是植物学术语，指稠李/鸟樱等一类樱属植物，有时被当作一个属，也常被视为樱属（Prunus）的一部分（亚属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical name for a group of cherry trees, especially bird cherry, often treated as a genus or as a subgenus of cherry (Prunus) with flowers in long clusters (racemes).","zh":"植物学用语：指一类樱属植物，尤指“稠李/鸟樱”（bird cherry）等，常被视为一个属或作为樱属（Prunus）的一个亚属，其花常成细长的总状花序（成串开放）。"},"examples":[{"en":"In some older botany books, bird cherry is listed under the genus Padus.","zh":"在一些较早的植物学书籍中，稠李（鸟樱）会被归入“Padus 属”。"},{"en":"The Padus group is known for its long clusters of small white flowers in spring.","zh":"Padus 这一类植物以春天成串开放的小白花而闻名。"}]}],"synonyms":["bird cherry","Prunus subg. Padus","racemose cherries"],"phonetic":"/ˈpeɪdəs/","extraExplanation":["“Padus”源自拉丁语名称，在现代分类中常与樱属（Prunus）合并或作为其亚属使用，因此你可能会在不同资料里看到不同写法（例如 Prunus subg. Padus）。","在园艺与科普语境里，更常见的叫法是“bird cherry（鸟樱/稠李）”，而“Padus”更偏学术或旧式分类用法。"]}

