{"word":"paean","summary":{"en":"A paean is a formal song, poem, or piece of writing that gives enthusiastic praise or celebrates something.","zh":"paean 指较正式的颂歌、赞美诗或颂词，用来热烈赞美或庆祝某人或某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a song, poem, or speech that expresses strong praise or celebration (often for a person, idea, or victory)","zh":"颂歌；赞美诗；颂词（用来热烈赞美或庆祝某人、某事或胜利的歌曲、诗或讲话）"},"examples":[{"en":"The article was a paean to her dedication as a teacher.","zh":"这篇文章是一首对她作为教师奉献精神的颂歌。"},{"en":"After the team won, fans wrote a paean celebrating the victory.","zh":"球队获胜后，球迷写了一首颂歌来庆祝胜利。"}]}],"synonyms":["hymn","ode","tribute","encomium","panegyric"],"phonetic":"ˈpiːən","extraExplanation":["“paean”源自古希腊语，最早指献给阿波罗（Apollo）的赞歌，也可指为求医治或为胜利而唱的歌；后来引申为对任何对象的热烈赞美。","现代英语里它多用于较正式、书面语境（如评论、演讲、文学评论）来表示“高度赞扬”，语气通常比普通的“praise”更隆重、更有仪式感。","常见搭配：a paean to + 名词（对……的颂歌/赞美），如 a paean to freedom（对自由的颂歌）。"]}
{"word":"paeanism","summary":{"en":"Paeanism means enthusiastic, often lofty praise—sometimes to the point of being overly flattering.","zh":"paeanism 指赞歌式的热烈颂扬，语气常较崇高，也可能含“过度吹捧”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act, style, or habit of giving enthusiastic praise (often in a formal, lofty, or celebratory way)","zh":"（常带正式、崇高或庆祝语气的）颂扬、赞歌式的称颂；一味赞美的作风/倾向"},"examples":[{"en":"The article slipped into paeanism, treating the new policy as perfect and beyond criticism.","zh":"这篇文章写着写着就变成了赞歌式的颂扬，把新政策说得完美无缺、不可批评。"},{"en":"Her speech was full of paeanism, praising the volunteers as heroes.","zh":"她的演讲充满颂扬之辞，把志愿者称作英雄。"}]},{"partOfSpeech":"n.","definition":{"en":"an instance or piece of writing/speech that functions like a paean (a song or poem of praise)","zh":"一段颂词；起到“赞歌/颂歌”（paean）作用的文字或讲话"},"examples":[{"en":"The preface reads like a paeanism to the author’s mentors.","zh":"序言读起来像是对作者导师们的颂词。"}]}],"synonyms":["eulogy","panegyric","glorification","adulation","praise"],"phonetic":"ˈpiːənɪzəm","extraExplanation":["“paeanism”来自“paean（颂歌、赞歌）+ -ism（……主义/倾向）”。“paean”原指古希腊献给阿波罗（Apollo）的胜利或治愈之歌，后来泛指赞美之歌。因此“paeanism”常带有“过度颂扬、偏颇吹捧”的语感，写作或评论中用于提醒语气太像宣传或歌功颂德。"]}
{"word":"paeanisms","summary":{"en":"“Paeanisms” means enthusiastic expressions of praise—laudatory words or passages.","zh":"“paeanisms”指热情的赞美之词/赞颂性的表达（常带书面语色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Expressions or writings that praise someone or something enthusiastically; instances of giving a “paean” (a song or speech of praise).","zh":"热情的赞颂之词或赞美性的文字；“颂歌/赞歌”式的称颂表达。"},"examples":[{"en":"The article was full of paeanisms about the new coach’s leadership.","zh":"这篇文章充满了对新教练领导力的颂扬之词。"},{"en":"Her memoir includes paeanisms to the teachers who changed her life.","zh":"她的回忆录里有不少对改变她人生的老师们的赞美之语。"}]}],"synonyms":["encomiums","panegyrics","tributes","praise","accolades"],"phonetic":"/ˈpiːənɪzəmz/","extraExplanation":["“paean”原指古希腊献给阿波罗（Apollo）的赞歌，后来引申为“凯歌、颂歌、赞颂”。“paeanism(s)”较少见，带一点书面语或修辞色彩，常用来形容“过度称颂、满篇赞歌式措辞”。"]}
{"word":"paeanize","summary":{"en":"“Paeanize” means to enthusiastically praise or celebrate someone or something in a public, hymn-like way.","zh":"“paeanize”指以颂歌式、较隆重的方式公开热情赞美或歌颂某人或某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to praise or celebrate someone or something publicly, often enthusiastically (to sing or speak a hymn of praise)","zh":"公开地（常常热情地）赞美或颂扬某人或某事；唱颂歌式的赞美"},"examples":[{"en":"Critics paeanized the director’s new film as a breakthrough.","zh":"评论家们把这位导演的新电影热情地颂扬为一次突破。"},{"en":"The article paeanized the volunteers for their courage during the storm.","zh":"这篇文章盛赞志愿者在风暴中的勇气。"}]}],"synonyms":["praise","celebrate","hail","extol","laud","acclaim"],"phonetic":"/ˈpiːəˌnaɪz/","extraExplanation":["“paeanize”来自名词“paean”（颂歌、赞美诗），原指古希腊献给阿波罗等神祇的赞歌，后来泛指对胜利、英雄或成就的热烈歌颂。","这个词比较少见、偏书面；日常英语里更常用 praise、celebrate、hail、extol 等。语气通常更“隆重/高调”，带有一种写文章或公开演说式的赞美。"]}
{"word":"paeanized","summary":{"en":"“Paeanized” means “praised in an enthusiastic, hymn-like way,” often with a literary or formal tone.","zh":"“paeanized”意为“以赞歌般的方式热烈颂扬”，语气偏文学、正式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"praised enthusiastically, often in a formal, poetic, or celebratory way (as if writing or speaking a “paean,” a song of praise).","zh":"热烈称颂；以较正式、诗意或庆祝性的方式赞美（仿佛写/唱一首“赞歌”）。"},"examples":[{"en":"The novelist was paeanized in reviews as the voice of a new generation.","zh":"评论把这位小说家热烈称颂为“新一代的代言人”。"},{"en":"After the victory, the team’s coach was paeanized in speeches at the city hall.","zh":"胜利之后，在市政厅的演讲中，人们对球队教练大加赞颂。"}]}],"synonyms":["praised","lauded","acclaimed","extolled","celebrated","glorified"],"phonetic":"/ˈpiːənˌaɪzd/","extraExplanation":["“paean”原指古希腊献给阿波罗等神祇的赞歌，后来泛指对人或事物的颂扬之词；因此“paeanize/paeanized”带有文学色彩，比常见的“praise”更夸张、更仪式化。","现代英语里“paeanize”相对少见，写作中常用来暗示“过度颂扬”或“把某人捧成英雄”的语气。"]}
{"word":"paeanizing","summary":{"en":"Paeanizing means praising or celebrating someone/something in an enthusiastic, tribute-like way.","zh":"paeanizing 指以“颂歌式”的热情方式赞美或歌颂某人/某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"praising someone or something enthusiastically (often in a formal or literary way); singing or writing a tribute.","zh":"热情地赞美（常带正式或文学色彩）；唱颂歌或写赞歌来致敬。"},"examples":[{"en":"The article is paeanizing the scientist’s achievements rather than analyzing the data critically.","zh":"这篇文章在热烈颂扬那位科学家的成就，而不是批判性地分析数据。"},{"en":"Fans kept paeanizing the team online after the championship win.","zh":"球队夺冠后，粉丝们在网上不断地颂扬这支队伍。"}]}],"synonyms":["praising","lauding","extolling","eulogizing","celebrating"],"phonetic":"/ˈpiːənaɪzɪŋ/","extraExplanation":["“paeanizing”来自动词“paeanize”，而“paean”原指古希腊献给阿波罗（Apollo）的赞歌，后来泛指“赞美诗/颂歌”。因此这个词常见于较正式、带修辞色彩的语境，语气比普通的“praise”更“隆重、歌颂式”。","用法提示：在写作里说某篇评论“paeanizes”某人/某事，常暗示它“过度吹捧、缺少客观”。"]}
{"word":"paeans","summary":{"en":"“Paeans” means songs or writings that strongly praise or celebrate something.","zh":"“paeans”指强烈赞美或庆祝某人某事的颂歌、赞词（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"songs, poems, or speeches that express strong praise, joy, or thanks (plural of *paean*)","zh":"赞歌；颂歌；（表达强烈赞美、喜悦或感谢的）诗歌/演讲（*paean* 的复数）"},"examples":[{"en":"The newspaper editorials were paeans to the team’s hard work.","zh":"那些报社社论是对球队辛勤付出的颂扬。"},{"en":"After the rescue, people wrote paeans celebrating the volunteers.","zh":"救援之后，人们写下赞歌来赞美志愿者。"},{"en":"Her memoir is full of paeans to her grandmother’s kindness.","zh":"她的回忆录里充满了对外祖母善良的颂扬。"}]}],"synonyms":["hymns","tributes","praises","encomiums","ode(s)"],"phonetic":"/ˈpiːənz/","extraExplanation":["“paean”源自古希腊语 *paíān*，最早指献给阿波罗（Apollo）的赞歌，也可指为胜利或治愈而唱的歌。后来在英语中泛指“热烈的赞美之词/颂歌”。","用法提示：*paeans to + 人/事物* 很常见，表示“对……的颂扬”。该词带有较正式、文学性的语气，常用于写作或公共表达。"]}
{"word":"paed","summary":{"en":"“Paed” is mainly British: it can mean an offensive short form of “paedophile,” or medical shorthand for “paediatric/paediatrics.”","zh":"“paed”主要见于英式英语：既可作对“paedophile（恋童癖者）”的冒犯性缩写，也可作“paediatric/paediatrics（儿科的/儿科学）”的医学速记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British, informal, offensive) A shortened form of “paedophile”; a person who is sexually attracted to children.","zh":"（英式口语，冒犯性）“paedophile（恋童癖者）”的缩写；指对儿童有性吸引的人。"},"examples":[{"en":"The police arrested a man suspected of being a paed.","zh":"警方逮捕了一名涉嫌为恋童癖者的男子。"},{"en":"Please avoid using slurs like “paed” in public discussion; use precise, neutral terms instead.","zh":"在公开讨论中请避免使用像“paed”这样的蔑称；尽量用准确、中性的说法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical/workplace shorthand, chiefly British) Short for “paediatric” or “paediatrics,” relating to children’s medicine.","zh":"（医学/职场速记，主要英式）“paediatric/paediatrics（儿科的/儿科学）”的缩写。"},"examples":[{"en":"She’s doing a paed rotation next month.","zh":"她下个月要去儿科轮转。"},{"en":"The child was referred to paed for follow-up.","zh":"这个孩子被转到儿科做后续复诊。"}]}],"synonyms":["(medical) paeds","pediatric (AmE spelling)","paediatric (BrE spelling)","(person) paedophile/pedophile"],"phonetic":"/pɛd/","extraExplanation":["“paed- / paedo-”来自希腊语词根，意为“儿童”。在英式英语中常见拼写 paediatric / paediatrics（美式多写 pediatric / pediatrics）。","作“恋童癖者”的缩写时，语气粗俗且带强烈指责，容易造成伤害或引发冲突；正式语境更常用 paedophile / pedophile，或在报道中用更中性的表达（如“suspected child sex offender”）。"]}
{"word":"paedagogic","summary":{"en":"Paedagogic (also spelled pedagogic) means “related to teaching/education,” sometimes with a negative sense of “too preachy or instructive.”","zh":"paedagogic（也拼作 pedagogic）意为“与教学/教育有关的”，有时也带贬义，指“过于说教、像在上课”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to teaching or education; intended to instruct.","zh":"与教学或教育有关的；旨在启发或指导学习的。"},"examples":[{"en":"The book takes a paedagogic approach, using short chapters and practice questions.","zh":"这本书采用教学性的写法，用短章节和练习题来帮助学习。"},{"en":"Her paedagogic style makes difficult grammar feel manageable.","zh":"她的教学风格让困难的语法变得更容易掌握。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overly focused on teaching in a way that feels moralizing or dull (often negative).","zh":"（常含贬义）过于说教的；让人觉得枯燥或像在训诫的。"},"examples":[{"en":"Some readers found the movie too paedagogic, as if it was lecturing them.","zh":"一些观众觉得这部电影太说教了，像是在给他们上课。"},{"en":"The article becomes paedagogic when it tells people what they ‘should’ do.","zh":"当文章开始告诉人们“应该”怎么做时，就显得有些说教。"}]}],"synonyms":["educational","instructional","didactic","pedagogical"],"phonetic":"/ˌpɛdəˈɡɑdʒɪk/","extraExplanation":["英式拼写是 paedagogic（也写作 pedagogic），美式更常见 pedagogic。两者意思相同。","词源来自希腊语：paid-（孩子）+ agogos（引导者）。因此它的核心含义是“引导学习/教育”。","语用上：在学术或教学语境里通常是中性或褒义；在影评、评论里也可能指“太爱教育别人/太说教”。"]}
{"word":"paedagogism","summary":{"en":"Paedagogism means an overly teacher-like, preachy style—too much instruction or lecturing.","zh":"Paedagogism 指过度“教师腔/说教味”的表达方式，像在讲课或教训人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a teacher-like, overly instructive or preachy manner; excessive concern with teaching rules or methods (often used critically).","zh":"（常带贬义）教师腔、过度说教的作风；对教学规则或方法的过分讲究。"},"examples":[{"en":"The talk was interesting, but a bit of paedagogism made it feel like a lecture.","zh":"这场演讲很有意思，但夹杂了一点教师腔，让它听起来像上课。"},{"en":"Her writing avoids paedagogism and lets the story teach its own lessons.","zh":"她的写作避免了说教味，让故事自己传达道理。"}]}],"synonyms":["didacticism","pedantry","schoolmasterishness","preachiness"],"phonetic":"/ˈpɛdəˌɡɑːdʒɪzəm/","extraExplanation":["“paedagogism”较少见，更多时候你会看到拼写为“pedagogism”（美式更常用）。两者意思相同。","词根来自“paedagogue/pedagogue”（教师、教育者）与后缀“-ism”（……主义/……作风）。在语境中通常含批评意味，指把沟通变成“像老师在教训/讲课”的口吻。"]}
{"word":"paedagogue","summary":{"en":"A (often formal, sometimes critical) word for a teacher or educator, especially one who is strict or old-fashioned.","zh":"指教师/教育者（较正式，有时带贬义），尤指严格、守旧或刻板的老师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(BrE, formal) A teacher; especially one who is strict, old-fashioned, or overly focused on rules.","zh":"（英式英语，较正式）教师；尤指刻板、守旧或过分强调规矩与条文的老师。"},"examples":[{"en":"Some students found him a talented paedagogue, but a little too strict.","zh":"有些学生觉得他是位很有才能的教师，但有点太严格了。"},{"en":"The novel portrays her as a paedagogue who cares deeply but insists on discipline.","zh":"小说把她刻画成一位很关心学生但强调纪律的老师。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who teaches or promotes a particular approach to education; an education specialist (formal).","zh":"（正式）教育学者/教育工作者；推广或研究某种教育方法的人。"},"examples":[{"en":"The paedagogue argued that reading aloud helps language learners.","zh":"这位教育学者认为朗读能帮助语言学习者。"},{"en":"As a paedagogue, she designs training for new teachers.","zh":"作为教育工作者，她为新教师设计培训。"}]}],"synonyms":["teacher","educator","schoolmaster","instructor"],"phonetic":"/ˈpɛdəˌɡɑːɡ/","extraExplanation":["“paedagogue”在英式拼写中常见；美式通常拼作“pedagogue”。词源来自希腊语，原意是“带领孩子的人”（古代常指陪同并督促孩子学习的仆从/导师），因此后来发展为“教师、教育者”。","在现代英语里，这个词有时带一点贬义，暗示“迂腐、卖弄学问、过分讲规矩”。正式写作中若想中性表达“教育者”，也可以用“educator/teacher”。"]}
{"word":"paedagogy","summary":{"en":"Paedagogy (more commonly spelled pedagogy) means the methods and principles of teaching, or a specific teaching approach.","zh":"paedagogy（更常见拼写为 pedagogy）指“教育学/教学法”，也可指某种具体的教学取向或教学风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The science or art of teaching; the methods and principles teachers use to help people learn.","zh":"教育学；教学法：指教学的原理与方法，以及教师帮助学习者学习的方式。"},"examples":[{"en":"The course introduces modern pedagogy for teaching reading and writing.","zh":"这门课程介绍用于阅读与写作教学的现代教学法。"},{"en":"Good pedagogy focuses on clear goals, practice, and feedback.","zh":"好的教学法强调明确目标、练习与反馈。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular teaching style or approach used in a school, subject, or culture.","zh":"某种特定的教学风格/教学取向（在某所学校、某门学科或某种文化中常见）。"},"examples":[{"en":"Their pedagogy emphasizes group discussion rather than lectures.","zh":"他们的教学取向强调小组讨论而不是讲授。"},{"en":"Different countries may have different pedagogies for math education.","zh":"不同国家在数学教育上可能有不同的教学法。"}]}],"synonyms":["teaching methods","instructional methods","didactics","teaching approach","educational methodology"],"phonetic":"/ˈpɛdəˌɡɑːdʒi/","extraExplanation":["拼写说明：英语里更常见的拼写是 pedagogy（美式、英式都常用）；paedagogy 属于较偏英式的旧式/学术拼写，其中 ae 来自希腊词根。两者意义相同。","词源小知识：来自希腊语 paid-（孩子）与 -agogos（引导者），原意与“引导孩子学习”有关。现代用法更广泛，不只用于儿童教育，也适用于成人与职业培训。","常见搭配：pedagogy of + 学科（pedagogy of science/English）；teaching pedagogy（教学法）；student-centered pedagogy（以学生为中心的教学法）。"]}
{"word":"paedarchy","summary":{"en":"“Paedarchy” means rule by children (a rare word, often used jokingly or in fiction).","zh":"“Paedarchy”指“儿童统治”，是个少见词，常见于玩笑或虚构语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Government or rule by children; a society in which children hold political power (rare).","zh":"儿童统治；由儿童掌权的政治体制或社会（较罕见）。"},"examples":[{"en":"The novel imagines a paedarchy where adults must follow rules written by schoolchildren.","zh":"这部小说设想了一个“儿童统治”的世界，成年人必须遵守由小学生制定的规则。"},{"en":"Some people use “paedarchy” humorously to describe a family where the kids make all the decisions.","zh":"有些人会用“paedarchy”开玩笑地形容一个“孩子说了算”的家庭。"}]}],"synonyms":["pedarchy","child rule","child-led government","juvenocracy (rare)"],"phonetic":"/ˈpɛdɑrki/","extraExplanation":["这个词很少见，更多出现在讽刺、科幻或评论性写作中，用来夸张地表达“孩子掌控局面”。","词源上可拆为 pae(d)-（与“儿童”相关）+ -archy（统治、政体，如 monarchy 君主制、anarchy 无政府状态）。现代英语里更常见的拼写是 pedarchy（美式也常见 ped- 这一写法）；paed- 更偏英式拼写风格。"]}
{"word":"paedatrophia","summary":{"en":"A rare medical term meaning childhood atrophy or poor development.","zh":"一个罕见的医学词，指儿童萎缩、消瘦或发育不良。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, medical) Wasting or underdevelopment in a child; childhood atrophy.","zh":"（罕见，医学）儿童的消瘦或发育不良；儿童萎缩。"},"examples":[{"en":"The old case report described paedatrophia in an infant with chronic malnutrition.","zh":"这份旧病例报告描述了一名长期营养不良婴儿的 paedatrophia（儿童消瘦/发育不良）。"},{"en":"Doctors today would more often discuss “failure to thrive” rather than paedatrophia.","zh":"如今医生更常说“failure to thrive（生长发育不良）”，而不是 paedatrophia。"}]}],"synonyms":["childhood atrophy","failure to thrive","wasting in children"],"phonetic":"/ˌpiːdəˈtroʊfiə/","extraExplanation":["这个词非常少见，多见于较早期的医学拉丁化用语或个别文献中；现代英语医学写作通常改用更具体的诊断或描述（如 malnutrition、growth retardation、failure to thrive）。","词源可拆解为 paed(o)-（儿童）+ atrophia（萎缩/消耗），意思直观，但在当代并非标准常用术语。"]}
{"word":"paedatrophy","summary":{"en":"Paedatrophy is a rare medical term for severe wasting/failure to thrive in children, especially infants.","zh":"Paedatrophy 是一个少见的医学术语，指婴幼儿（儿童）的严重消瘦/萎缩或生长发育不良。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) Severe wasting or failure to thrive in infants or young children; child atrophy.","zh":"（医学、少见）婴幼儿或儿童的严重消瘦/萎缩；生长发育不良（类似“消耗性衰弱/营养不良导致的萎缩”）。"},"examples":[{"en":"The doctor noted signs consistent with paedatrophy, including marked weight loss and low muscle tone.","zh":"医生记录到符合 paedatrophy（儿童消耗性萎缩）的表现，包括明显体重下降和肌张力低。"},{"en":"In older medical texts, paedatrophy was sometimes used to describe severe malnutrition in infants.","zh":"在较早的医学文献中，paedatrophy 有时用来描述婴儿的严重营养不良。"}]}],"synonyms":["failure to thrive","wasting","severe malnutrition","atrophy","athrepsia"],"phonetic":"/ˌpiːdəˈtrɑːfi/","extraExplanation":["词源上可理解为 paed-/ped-（“儿童”）+ atrophy（“萎缩、消瘦”）。这是比较旧或少用的医学术语；现代临床更常用 failure to thrive（生长发育不良）、severe malnutrition（重度营养不良）、wasting（消耗/消瘦）等更具体的表述。","拼写提示：该词非常少见，实际写作中可能会遇到不同拼法或被更常见术语替代。若这是从文献中抄录的词，建议核对原文是否为 pediatrophy/paediatrophy 或其他近似词。"]}
{"word":"paederast","summary":{"en":"“Paederast” is a dated, offensive term for a man who has sexual relations with a boy, sometimes seen in historical discussions of ancient Greek pederasty.","zh":"“Paederast”是一个过时且具冒犯性的词，指与男童发生性行为的成年男性，有时见于对古希腊“男童性关系”的历史讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Offensive/dated) A man who engages in sexual activity with a boy; a practitioner of pederasty.","zh":"（具冒犯性／过时）与男童发生性行为的成年男性；“男童恋／古希腊式男童性关系”的实施者。"},"examples":[{"en":"The historian notes that the term “paederast” is now considered offensive and is rarely used in modern writing.","zh":"这位历史学者指出，“paederast”一词如今被认为具有冒犯性，在现代写作中很少使用。"},{"en":"In older texts, “paederast” sometimes appears in discussions of ancient Greek pederasty.","zh":"在较早的文本中，“paederast”有时会出现在关于古希腊“男童性关系”的讨论里。"}]}],"synonyms":["pederast","(dated) sodomite","child abuser (not an exact synonym; broader/legal term)"],"phonetic":"/ˈpiːdəræst/","extraExplanation":["该词带有强烈贬义与冒犯性，现代英语中通常避免使用；如果需要中性、法律或新闻语境的表达，常用更具体、更规范的说法（如“child sexual abuse/child abuser”等），并依据语境选择准确用词。","词源与语境：源自希腊语相关词根，历史上常见于对“古希腊男童恋（pederasty）”的学术讨论。英式拼写多为 paederast，另有 pederast。它与 paedophile/pedophile（恋童者，泛指对儿童有性吸引）在含义范围上不完全等同，但现实写作中都属于高度敏感词。"]}
{"word":"paederastic","summary":{"en":"“Paederastic” means relating to pederasty; it is usually used in historical or academic contexts and is strongly negative in modern usage.","zh":"“paederastic”意为“与恋童男色有关的”。多见于历史/学术语境；在现代用法中通常带强烈贬义与谴责。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pederasty (historically, a sexual relationship between an adult man and an adolescent boy), or showing sexual interest in boys; now usually used in a strongly negative, condemnatory way.","zh":"与“恋童男色”（历史上指成年男子与青春期男孩之间的性关系）有关的；或指对男童/少年有性兴趣的。现代英语中通常带有强烈贬义与谴责。"},"examples":[{"en":"The historian discusses pederastic practices in some ancient Greek city-states.","zh":"这位历史学家讨论了古希腊一些城邦中的男色恋童现象。"},{"en":"Modern readers often find pederastic themes in old texts disturbing.","zh":"现代读者常常觉得旧文本中的恋童男色主题令人不安。"},{"en":"The article avoids romanticizing pederastic relationships and stresses the power imbalance involved.","zh":"这篇文章避免美化恋童男色关系，并强调其中的权力不对等。"}]}],"synonyms":["pederastic","pederast (related noun)","pederasty (related noun)"],"phonetic":"/ˌpiːdəˈræs.tɪk/","extraExplanation":["“paederastic”是较少见、偏学术或历史语境的拼写（也常见为“pederastic”）。它源自希腊语相关词根，常用于讨论古希腊等历史文化现象。","在当代英语中，这类词汇很容易与对未成年人的性侵害联系在一起，因此通常带有强烈负面评价；在法律与新闻语境里更常用更明确的术语来描述犯罪行为。"]}
{"word":"paederastically","summary":{"en":"“Paederastically” is a rare adverb meaning “in a way related to pederasty,” usually used in historical or academic discussion and often carries a negative, sensitive connotation.","zh":"“paederastically”是一个很少见的副词，意为“以与（历史语境中的）男色恋童/恋童行为相关的方式”，多用于学术或历史讨论，语感敏感且常带负面含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way related to pederasty (adult–adolescent male sexual relations); in a pederastic manner.","zh":"以（涉及）恋童癖/男色恋童行为的方式；以“恋童”相关的方式。"},"examples":[{"en":"The author uses the term to describe a historical practice, not to endorse it.","zh":"作者用这个词是在描述一种历史现象，并非表示认同。"},{"en":"Modern scholars usually avoid describing relationships paederastically and instead use more specific, neutral terms.","zh":"现代学者通常避免用这个词来“恋童化”地描述关系，而会改用更具体、更中性的术语。"}]}],"synonyms":["pederastically","in a pederastic manner"],"phonetic":"/ˌpiːdəˈræstɪkli/","extraExplanation":["这个词非常罕见，多见于学术或历史语境（尤其讨论古希腊等时期的社会习俗）。“paederast-”来自希腊语，传统拼写也常见为 pederast / pederastic（美式更常用）。在现代英语中，它通常带有强烈负面含义，且可能让人联想到对未成年人性侵害的讨论；使用时务必谨慎，避免在日常场合随意使用。"]}
{"word":"paederasty","summary":{"en":"Paederasty is a term—especially in historical writing—for sexual relations between an adult man and a boy; in modern usage it typically refers to child sexual abuse and is illegal.","zh":"Paederasty 多用于历史语境，指成年男性与男童之间的性关系；在现代用法中通常指对未成年人的性侵害并属违法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical/technical) Sexual activity or a relationship between an adult man and a boy; in modern contexts it is generally understood as sexual abuse of a minor and is illegal in many places.","zh":"（历史/术语）指成年男性与男童之间的性关系或关系；在现代语境中通常被理解为对未成年人的性侵/性虐待，在许多地区属于违法行为。"},"examples":[{"en":"The book discusses paederasty as an institution in some ancient societies.","zh":"这本书讨论了某些古代社会中“paederasty（成年男性与男童关系）”作为一种制度的存在。"},{"en":"Modern law and ethics treat paederasty as child sexual abuse.","zh":"现代法律与伦理通常将其视为对儿童的性侵害。"}]}],"synonyms":["pederasty","child sexual abuse (modern sense)","sexual abuse of a minor"],"phonetic":"ˈpɛdəræsti","extraExplanation":["该词也常拼作 pederasty。词源来自古希腊语 paiderastia（pais“男孩” + erastēs“情人/爱人”）。在古希腊研究语境中，有时用于描述一种带有社会与教育色彩的成年男性与少年之间的关系；但在现代英语里，该词多用于指涉对未成年人的性剥削，因此带有强烈负面与犯罪含义。阅读历史材料时要注意语境差异。"]}
{"word":"paedeutics","summary":{"en":"Paedeutics means the theory or science of teaching (pedagogy).","zh":"Paedeutics 指“教育学/教学理论”，相当于 pedagogy。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science or theory of teaching; pedagogy (education methods and principles).","zh":"教育学；教学理论（研究教学方法与原则）。"},"examples":[{"en":"She studied paedeutics to understand how children learn languages.","zh":"她学习教育学，以理解孩子如何学习语言。"},{"en":"The course compares paedeutics in different countries’ school systems.","zh":"这门课比较不同国家学校体系中的教学理论。"}]}],"synonyms":["pedagogy","didactics","educational theory","teaching methods"],"phonetic":"/piːˈdjuːtɪks/","extraExplanation":["“paedeutics”是非常少见、偏学术/旧式的词，在现代英语里更常用“pedagogy”或“educational theory”。","词源与希腊语“paideia”（教育、培养）有关，强调“教与学的原则/方法”，而不只是“上课”本身。"]}
{"word":"paediatric","summary":{"en":"Paediatric means related to the medical care of children (British spelling of pediatric).","zh":"Paediatric 指与儿童医疗护理有关（pediatric 的英式拼写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mainly British spelling) relating to the medical care of babies, children, and teenagers.","zh":"（主要为英式拼写）与婴儿、儿童和青少年医疗护理有关的。"},"examples":[{"en":"She works in a paediatric hospital.","zh":"她在一家儿科医院工作。"},{"en":"The child was referred to a paediatric specialist.","zh":"这个孩子被转诊给一位儿科专科医生。"},{"en":"Paediatric patients often need different medicine doses from adults.","zh":"儿科病人通常需要与成人不同的药物剂量。"}]}],"synonyms":["pediatric","child-health","children’s"],"phonetic":"/ˌpiːdiˈætrɪk/","extraExplanation":["“paediatric”是英式拼写；美式拼写通常是“pediatric”。两者意思完全相同，差别主要来自拼写习惯（源于希腊语词根：paed- ‘孩子’ + -iatric ‘医治/医疗’）。在医学、医院科室、学术文章中都很常见。","常见搭配：paediatric care（儿科护理/诊疗）、paediatrician（儿科医生）、paediatric ward/unit（儿科病房/病区）、paediatric emergency（儿科急诊）。"]}
{"word":"paediatrician","summary":{"en":"A paediatrician is a doctor for children and teens (British spelling: paediatrician; American: pediatrician).","zh":"paediatrician 指“儿科医生”，是英式拼写；美式拼写为 pediatrician。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical doctor who specializes in the health and medical care of babies, children, and teenagers","zh":"儿科医生（专门为婴儿、儿童和青少年提供医疗照护的医生）"},"examples":[{"en":"We took our baby to the paediatrician for a routine checkup.","zh":"我们带宝宝去看儿科医生做例行体检。"},{"en":"The paediatrician explained the vaccine schedule clearly.","zh":"儿科医生把疫苗接种时间表解释得很清楚。"}]}],"synonyms":["pediatrician","children's doctor"],"phonetic":"/ˌpiːdiəˈtrɪʃən/","extraExplanation":["“Paediatrician”是英式拼写；美式英语更常写作“pediatrician”，读音相同。","词根来自希腊语：paed-（儿童）+ iatr-（医生/治疗），因此和“pediatrics（儿科学）”同源。"]}
{"word":"paediatrics","summary":{"en":"Paediatrics is the medical specialty focused on infants, children, and teenagers (UK spelling of “pediatrics”).","zh":"Paediatrics 指儿科学/小儿科，是关注婴儿、儿童与青少年健康的医学专科（英式拼写，等同于美式 pediatrics）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the branch of medicine that focuses on the health and medical care of infants, children, and teenagers","zh":"儿科学；小儿科（研究与治疗婴儿、儿童与青少年健康问题的医学分支）"},"examples":[{"en":"She wants to specialize in paediatrics after medical school.","zh":"她想在医学院毕业后专攻儿科学。"},{"en":"The hospital has a strong paediatrics department and a busy children’s clinic.","zh":"这家医院的儿科很强，儿童门诊也很繁忙。"}]}],"synonyms":["pediatrics","child medicine","pediatric medicine"],"phonetic":"/ˌpiːdiˈætrɪks/","extraExplanation":["“paediatrics”是英式拼写；美式英语更常写作“pediatrics”。两者意思完全相同，发音也非常接近。","词源来自希腊语：paidos（孩子）+ iatreia（治疗/医学），字面意思是“治疗孩子的医学”。","在实际使用中，paediatrics不仅包括治疗疾病，也包括儿童生长发育监测、疫苗接种、营养与行为/心理健康等预防与长期管理。"]}
{"word":"paediatry","summary":{"en":"Paediatry is the medical specialty focused on the health of children and teenagers (UK spelling).","zh":"Paediatry 指儿科学/小儿科，是关注儿童与青少年健康的医学专科（英式拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the branch of medicine that deals with the health and medical care of babies, children, and teenagers","zh":"儿科学；小儿科（研究与治疗婴儿、儿童和青少年健康的医学分支）"},"examples":[{"en":"She wants to specialize in paediatry because she enjoys working with children.","zh":"她想专攻儿科学，因为她喜欢与孩子们打交道。"},{"en":"The hospital has a strong paediatry department with child-friendly wards.","zh":"这家医院的小儿科很强，病房也更适合儿童。"}]}],"synonyms":["pediatrics","child medicine","paediatric medicine"],"phonetic":"/ˈpiːdiətri/","extraExplanation":["“Paediatry”是英式拼写（常见于英国、澳大利亚等）；美式拼写通常是“pediatrics”。两者含义相同。","词根提示：paed-/ped-与“儿童”有关（源自希腊语），-iatry表示“医学治疗/医疗专科”（如 psychiatry 精神病学）。"]}
{"word":"paedo","summary":{"en":"“Paedo” is a British informal and offensive short form of “paedophile/pedophile.”","zh":"“paedo”是英式英语中“paedophile/pedophile（恋童癖者）”的非正式且带冒犯性的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(BrE, informal, offensive) A short form of “paedophile”: an adult who is sexually attracted to children.","zh":"（英式英语，非正式，具冒犯性）“paedophile（恋童癖者）”的缩写：指对儿童有性吸引的成年人。"},"examples":[{"en":"That word is offensive; it’s better to use “paedophile/pedophile” in formal writing.","zh":"这个词带有冒犯性；在正式写作中最好用“paedophile/pedophile”。"},{"en":"The police arrested a man suspected of being a paedophile.","zh":"警方逮捕了一名涉嫌为恋童癖者的男子。"}]}],"synonyms":["paedophile","pedophile","pedo","child molester"],"phonetic":"/ˈpiːdoʊ/","extraExplanation":["“paedo”主要见于英式英语口语/网络语境，语气往往很强、带辱骂色彩；在新闻、学术或法律语境中更常用中性一些的“paedophile”（英式拼写）或“pedophile”（美式拼写）。","不要把“paedo”与词根/前缀“paedo- / paedi-（与儿童相关）”混淆，例如“paediatrics/ pediatrics（儿科学）”。前者是贬义称呼，后者是医学相关词根。"]}
{"word":"paedobaptism","summary":{"en":"Paedobaptism means the practice of baptizing infants or very young children.","zh":"Paedobaptism 指“婴儿洗礼”，即为婴幼儿施洗的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of baptizing infants or very young children","zh":"（基督教）婴儿洗礼；为婴幼儿施洗的做法"},"examples":[{"en":"In some Christian traditions, paedobaptism is seen as welcoming a child into the church community.","zh":"在一些基督教传统中，婴儿洗礼被视为欢迎孩子进入教会群体。"},{"en":"They discussed whether paedobaptism or believer’s baptism better matched their understanding of faith.","zh":"他们讨论婴儿洗礼和信徒洗礼哪一种更符合他们对信仰的理解。"}]}],"synonyms":["infant baptism","christening"],"phonetic":"/ˌpiːdoʊˈbæp.tɪ.zəm/","extraExplanation":["“paedo-”来自希腊语，意为“儿童”；“-baptism”指“洗礼”。这个词多用于神学/教会历史语境，与“believer’s baptism（信徒洗礼，通常指成年人或能表达信仰者受洗）”相对。","不同宗派对婴儿洗礼的意义理解不一：有的强调“圣约/恩典的记号”，有的强调“个人信仰告白后再受洗”。日常对话中较少使用，更多见于学术写作、宗教讨论或教会文件。","拼写说明：英式拼法常见 paedobaptism（含 ae）；美式有时写作 pedobaptism。发音通常接近“PEE-doh-BAP-tiz-əm”。"]}
{"word":"paedobaptist","summary":{"en":"A paedobaptist is someone (or something) that supports infant baptism.","zh":"paedobaptist 指支持“婴儿洗礼”的人或相关立场/事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or viewpoint) that supports infant baptism.","zh":"支持婴儿洗礼的人（或主张婴儿洗礼的观点）。"},"examples":[{"en":"Many Presbyterians are paedobaptists and baptize infants as part of their church tradition.","zh":"许多长老会信徒主张婴儿洗礼，把为婴儿施洗当作教会传统的一部分。"},{"en":"In the debate, the paedobaptist argued that baptism is a sign of God’s covenant with families.","zh":"在辩论中，主张婴儿洗礼的一方认为洗礼是上帝与家庭立约的记号。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or supporting the practice of infant baptism.","zh":"与婴儿洗礼有关的；支持婴儿洗礼的。"},"examples":[{"en":"They attend a paedobaptist church where babies may be baptized.","zh":"他们参加一间支持婴儿洗礼的教会，那里的婴儿可以受洗。"},{"en":"Her paedobaptist views differ from her friend’s believer’s-baptism views.","zh":"她支持婴儿洗礼的观点与朋友“信徒洗礼”的观点不同。"}]}],"synonyms":["infant-baptism advocate","pedobaptist"],"phonetic":"/ˌpiːdoʊˈbæptɪst/","extraExplanation":["这个词来自希腊语词根：paedo-（儿童）+ baptize（施洗/浸礼）。在基督教神学与教会传统中，它常与 credobaptist（主张“信徒洗礼”，即需个人信仰告白后受洗的人）相对。","拼写说明：英式拼写常见 paedobaptist；美式有时写作 pedobaptist。两者意思相同。","语境提醒：paedobaptist 是宗教/神学术语，只描述对洗礼对象（婴儿 vs. 有信仰告白者）的立场；不要与英语里不相关、且含义敏感的词形混淆。"]}
{"word":"paedogenesis","summary":{"en":"Paedogenesis is reproduction that happens while an organism is still in a larval or juvenile stage.","zh":"Paedogenesis 指生物在幼体或未成熟阶段就进行繁殖的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of reproduction in which an organism reproduces while still in a larval or juvenile stage (before reaching full adulthood).","zh":"一种在幼体或未成熟阶段就进行繁殖的方式（尚未完全成体就能生殖）。"},"examples":[{"en":"Some insects can show paedogenesis, producing young while they are still larvae.","zh":"有些昆虫会出现幼体生殖（paedogenesis），在仍是幼虫时就能产下后代。"},{"en":"The researcher studied paedogenesis to understand how development and reproduction can overlap.","zh":"研究人员研究幼体生殖，以了解发育与繁殖如何发生重叠。"}]}],"synonyms":["larval reproduction","precocious reproduction"],"phonetic":"/ˌpiːdoʊˈdʒɛnəsɪs/","extraExplanation":["词源：paedo- 来自希腊语，意为“儿童/幼体”；-genesis 意为“产生/生成”。合起来就是“在幼体阶段产生后代”。","注意不要与“paedophilia（恋童癖）”混淆：paedogenesis 是生物学术语，指繁殖方式，与性偏好无关。","常见相关词：neoteny（幼态持续：保留幼体特征到成体）；parthenogenesis（孤雌生殖：未受精卵发育成个体）。这些概念都和“发育与繁殖/性成熟之间的关系”有关。"]}
{"word":"paedogenetic","summary":{"en":"Paedogenetic means “able to reproduce while still immature (larval/juvenile),” or “related to paedogenesis.”","zh":"paedogenetic 指“在幼体/未成熟阶段即可繁殖的”，或“与幼体生殖（童体生殖）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to paedogenesis: reproduction that occurs in an organism’s immature or larval stage (before it becomes an adult).","zh":"与“幼体生殖/童体生殖”有关的：指生物在未成熟或幼虫阶段（尚未成体前）就进行繁殖的现象。"},"examples":[{"en":"Some insects have paedogenetic larvae that can reproduce without becoming adults.","zh":"有些昆虫的幼虫具有幼体生殖能力，不必长成成虫也能繁殖。"},{"en":"The researcher described a paedogenetic life cycle in this species of gall midge.","zh":"研究者描述了这种瘿蚊具有幼体生殖的生活史。"}]}],"synonyms":["pedogenetic","paedogenetic (variant spelling)","related to paedogenesis"],"phonetic":"/ˌpiːdoʊdʒəˈnɛtɪk/","extraExplanation":["该词多用于动物学、昆虫学与发育生物学语境，比较书面且专业；日常英语中不常见。","拼写上也常见 pedogenetic（省略 ae），两者在现代英语中通常可互换，但学术写作会按期刊或地区偏好选择。","可与 paedogenesis（幼体生殖，名词）一起记：-genetic 在这里更接近“与产生/发生有关”，而不是“遗传学 genetic”的日常含义。"]}
{"word":"paedogenic","summary":{"en":"Paedogenic describes reproduction that happens while an organism is still immature (often in the larval stage).","zh":"Paedogenic 指个体在未成熟（常为幼虫期）就发生的繁殖。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of reproduction) producing young in an immature or larval stage; reproducing before reaching full adult form (a type of early reproduction).","zh":"（指繁殖方式）在未成熟或幼体阶段就能繁殖；在未完全发育为成体前就繁殖（早熟繁殖的一种）。"},"examples":[{"en":"Some insects show paedogenic reproduction, producing offspring while still in a larval form.","zh":"有些昆虫会出现 paedogenic 繁殖，在仍为幼虫形态时就能产生后代。"},{"en":"The paper discusses paedogenic larvae and how this strategy helps populations grow quickly.","zh":"这篇论文讨论了 paedogenic 幼虫，以及这种策略如何帮助种群快速增长。"}]}],"synonyms":["pedogenic (variant spelling in this biological sense)","paedogenetic","pedogenetic"],"phonetic":"/ˌpiːdəˈdʒɛnɪk/","extraExplanation":["词源提示：paedogenic 来自希腊语词根 paedo-（儿童、幼体）+ -genic（产生……的）。拼写上与英式拼写 paedo- 相关，在美式英语中常见对应词根 pedo-（如 pedogenesis / paedogenesis）。","使用场景：该词几乎只出现在动物学、昆虫学与发育生物学等学术语境中，日常英语很少用。容易与“pedogenic（成土的、土壤形成的）”混淆；两者含义完全不同。","相关词：paedogenesis / pedogenesis（幼体生殖、幼体繁殖）；paedomorphosis（幼态持续：成年仍保留幼体特征，但不一定指繁殖）。"]}
{"word":"paedological","summary":{"en":"Paedological most commonly means “related to the study of soils”; rarely, it can mean “related to the (older) study of children’s development.”","zh":"paedological最常见指“与土壤学（研究土壤）有关”；较少见的旧用法可指“与儿童发展研究有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the scientific study of soils (soil science).","zh":"与土壤学（研究土壤的科学）有关的。"},"examples":[{"en":"The team did a paedological survey before choosing where to plant the trees.","zh":"团队在决定在哪里植树前做了土壤学调查。"},{"en":"Paedological data can help predict how well crops will grow in a region.","zh":"土壤学数据可以帮助预测某个地区作物的生长情况。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, older use) Relating to the study of children’s development (paedology).","zh":"（罕见、较旧用法）与儿童发展研究（paedology）有关的。"},"examples":[{"en":"Early 20th-century writers sometimes used “paedological” when discussing children’s learning.","zh":"二十世纪早期的作者有时用“paedological”来讨论儿童学习。"}]}],"synonyms":["pedological","soil-science-related","edaphic (more general: relating to soil)"],"phonetic":"/ˌpɛdəˈlɑːdʒɪkəl/","extraExplanation":["“paedological”在英文里可能有两条来源：\n1）更常见的是与 pedology（土壤学）相关；美式拼写多为 “pedological”。\n2）较少见的是与 paedology（儿童发展研究，已较过时）相关。\n实际阅读中可看上下文：谈土壤、农作物、地质时通常是土壤学义；谈儿童、教育、发展时才可能是旧的儿童研究义。"]}
{"word":"paedologist","summary":{"en":"A (rare, old-fashioned) term for someone who studies children and their development.","zh":"一个较少见、偏旧式的词，指研究儿童及其发展的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialist who studies children and their development (an old-fashioned term; related to “paedology”)","zh":"研究儿童及其发展的人（较旧的用法；与“paedology 儿童学”相关）"},"examples":[{"en":"In early 20th-century writings, a paedologist might observe children’s learning and behavior in school.","zh":"在20世纪早期的著作里，paedologist 可能会在学校观察儿童的学习与行为。"},{"en":"The museum exhibit mentioned a paedologist who collected data on child growth.","zh":"博物馆展览提到一位 paedologist 收集了儿童生长发育的数据。"}]}],"synonyms":["child-development specialist","developmental psychologist (close meaning)","child psychologist (close meaning)"],"phonetic":"/ˌpiːdəˈlɑːdʒɪst/","extraExplanation":["这个词比较少见，也带有历史感：20世纪初“paedology”曾指一门结合心理学、教育学与生理学来研究儿童发展的领域，但后来多被更常见的说法（如 child psychologist 儿童心理学家、developmental psychologist 发展心理学家、educational researcher 教育研究者）取代。","注意拼写容易与 pedologist 混淆：pedologist（少一个 a）通常指“土壤学家”，研究土壤（pedology）。读写时可用 a=age（年龄）的小提示来记 paed- 更偏“儿童/年龄发展”，而 ped- 更常见于“土壤”。"]}
{"word":"paedology","summary":{"en":"Paedology means the scientific study of children’s development, especially psychology and learning.","zh":"Paedology 指对儿童发展进行科学研究的领域，尤侧重心理与学习。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of children’s development (especially their psychology, behavior, and growth); child study","zh":"儿童学；儿童研究（对儿童的发展进行科学研究，尤指心理、行为与成长）"},"examples":[{"en":"Early paedology tried to understand how children learn and develop in school.","zh":"早期的儿童学试图理解儿童在学校里如何学习与发展。"},{"en":"Her research sits between paedology and educational psychology.","zh":"她的研究介于儿童学与教育心理学之间。"}]}],"synonyms":["child study","child development","developmental psychology","educational psychology"],"phonetic":"/piˈdɑlədʒi/","extraExplanation":["“Paedology”常见于较早期或英式拼写的学术语境（paed- 与 pedi- 同源，都与“儿童”有关）。现代英语里更常用的表达是 child development（儿童发展）、child study（儿童研究）、developmental psychology（发展心理学）。","注意不要与“pedology”混淆：pedology 在现代英语中更常指“土壤学”（soil science）。两者拼写接近，但研究对象完全不同。","历史上，“paedology”曾作为一门跨学科领域，结合教育、医学与心理学来研究儿童；如今其内容多被发展心理学与教育学等学科吸收。"]}
{"word":"paedometer","summary":{"en":"A paedometer is a step counter used to track walking activity.","zh":"paedometer 指“计步器”，用来统计步数、追踪步行活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device (or app feature) that counts how many steps you take, often used to track walking exercise and estimate distance or calories.","zh":"计步器；（或应用功能）用于记录你走了多少步，常用来追踪步行运动，并可估算距离或消耗的热量。"},"examples":[{"en":"I use a paedometer to make sure I walk at least 10,000 steps a day.","zh":"我用计步器来确保自己每天至少走一万步。"},{"en":"Her phone’s paedometer shows she walked three miles yesterday.","zh":"她手机的计步功能显示她昨天走了三英里。"}]}],"synonyms":["pedometer","step counter","fitness tracker (broader)"],"phonetic":"/pəˈdɑːmɪtər/","extraExplanation":["“paedometer”在英式英语中较常见；美式英语里更常用拼写“pedometer”。两者意思相同。","词源来自希腊语：paed-/ped-（脚）+ -meter（测量器）。现代很多智能手机和手环都内置计步功能。"]}
{"word":"paedometrical","summary":{"en":"Paedometrical means “related to measuring walking by counting steps,” especially using a pedometer.","zh":"paedometrical 指“与通过计数步数来测量步行有关”，常指使用计步器的测量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pedometer (a device that measures steps) or to the measuring of walking by counting steps.","zh":"与计步器（测量步数的装置）有关的；或指通过计数步伐来测量步行（距离/活动量）的。"},"examples":[{"en":"Paedometrical methods are useful for estimating how far someone walked in a day.","zh":"计步测量法有助于估算一个人一天走了多远。"},{"en":"The study compared paedometrical data with GPS tracking.","zh":"这项研究把计步测量数据与GPS追踪作了比较。"}]}],"synonyms":["pedometrical","pedometric","step-counting","pedometer-based"],"phonetic":"/ˌpiːdoʊməˈtrɪkəl/","extraExplanation":["“paedometrical”非常少见，更多时候你会看到“pedometrical / pedometric”来表达“与计步测量有关的”。在现代英语中，“pedometer（计步器）”里的 pedo- 来自拉丁语 pes（脚），而 paedo- 常见于“paediatric（儿科的）”，来自希腊语 pais（儿童）。因此“paedometrical”可能会让人误以为与“儿童测量”有关；在写作中建议优先用更常见、歧义更少的“pedometrical / pedometric”或“step-counting”。"]}
{"word":"paedomorphic","summary":{"en":"Paedomorphic describes an adult organism (or a form/design) that keeps youthful, juvenile features.","zh":"paedomorphic 指“幼态化的”：成体仍保留幼体特征，或外形呈现年轻/幼态特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having adult forms that retain juvenile or larval features; showing neoteny.","zh":"（生物学）成体仍保留幼体/幼虫特征的；幼态持续的（即“幼态化/新幼态”）。"},"examples":[{"en":"Axolotls are famous for being paedomorphic, keeping their gills into adulthood.","zh":"墨西哥钝口螈很有名，因为它们具有幼态特征，成年后仍保留外鳃。"},{"en":"Some paedomorphic traits in humans include a relatively flat face compared with other primates.","zh":"与其他灵长类相比，人类的一些幼态特征包括相对更平的面部。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, resembling something youthful or childlike in form or features.","zh":"（更广义）外形或特征显得年轻/幼态的；带“孩童感”的（多用于学术或描述性语境）。"},"examples":[{"en":"The character was drawn with paedomorphic proportions—large eyes and a small nose.","zh":"这个角色被画成幼态比例——大眼睛、小鼻子。"},{"en":"Designers sometimes use paedomorphic cues to make products feel friendly and harmless.","zh":"设计师有时会用幼态线索，让产品显得更友好、无威胁。"}]}],"synonyms":["neotenic","juvenile-looking","childlike (in form)","larviform (in biology)"],"phonetic":"/ˌpiːdəˈmɔrfɪk/","extraExplanation":["词源：paedo- 表示“儿童”（英式拼写；美式也常见 pedo-），-morphic 来自 “形态/形状（morph）”。在学术写作中常与 neoteny（新幼态）一起出现。","用法提醒：该词主要用于生物学、人类学与设计/视觉研究等中性描述场景；它的 paedo-/pedo- 词形有时会让学习者联想到不相关且敏感的词，但在这里指的是“儿童/幼体”这一词根含义。"]}
{"word":"paedomorphism","summary":{"en":"Paedomorphism means an adult organism keeps juvenile traits, used mainly in biology and evolution.","zh":"Paedomorphism 指成年个体仍保留幼年特征的现象，主要用于生物学与进化相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the retention of juvenile (childlike) physical features or behaviors in an adult organism","zh":"幼态持续：成年个体仍保留幼年（像幼体/孩子般）的外形特征或行为"},"examples":[{"en":"In biology class, we learned that axolotls are famous for paedomorphism because they keep larval traits as adults.","zh":"在生物课上我们学到，墨西哥钝口螈以幼态持续闻名，因为它们成年后仍保留幼体特征。"},{"en":"Some scientists discuss paedomorphism when explaining how certain species evolve new forms.","zh":"一些科学家在解释某些物种如何演化出新形态时，会讨论幼态持续。"}]},{"partOfSpeech":"n.","definition":{"en":"in humans, the tendency for adult appearance to show youthful traits (a term used mainly in anthropology/evolutionary discussions)","zh":"（用于人类研究）成人外貌呈现较多年轻化特征的倾向（多见于人类学/演化讨论）"},"examples":[{"en":"The article mentioned paedomorphism in humans when comparing facial features across populations and time periods.","zh":"文章在比较不同人群与不同时期的面部特征时提到了人类的幼态持续。"}]}],"synonyms":["pedomorphism","juvenilization"],"phonetic":"/ˌpiːdoʊˈmɔːrfɪzəm/","extraExplanation":["拼写与词源提示：paedo- 来自希腊语，意为“儿童”；-morphism 与“形态/形变”相关。美式英语里常见拼写为 paedomorphism 或 pedomorphism（少见）；英式更常保留 ae（paedo-）。","概念关联：幼态持续常与 neoteny（幼态延缓）一起出现；neoteny 更强调“发育速度变慢”，而 paedomorphism 更广，指“成年仍呈现幼体特征”的结果。","使用场景：该词主要是学术/科普语境（生物学、进化论、古生物、人类学）。日常英语里很少用，更常用表达是 “childlike features” 或 “juvenile traits”。"]}
{"word":"paedomorphosis","summary":{"en":"Paedomorphosis is a biological pattern where an adult keeps juvenile features, sometimes shaping evolution toward a more youthful form.","zh":"Paedomorphosis（幼态持续）指成体保留幼体特征的生物学现象，也可指一种让物种整体更“幼态化”的进化模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The retention of juvenile or larval features in an adult organism (often because development slows or stops early).","zh":"（生物学）成体仍保留幼体或幼虫的特征（通常由于发育速度减慢或过早停止）。"},"examples":[{"en":"Axolotls are a famous example of paedomorphosis because they keep larval traits like external gills as adults.","zh":"美西螈（六角恐龙）是“幼态持续”的著名例子，因为它们成体仍保留外鳃等幼体特征。"},{"en":"Scientists study paedomorphosis to understand how small changes in development can create new body forms.","zh":"科学家研究幼态持续，以理解发育过程中的微小变化如何产生新的体型特征。"}]},{"partOfSpeech":"n.","definition":{"en":"The evolutionary process or pattern in which a species becomes more juvenile-looking compared with its ancestors.","zh":"一种进化模式：与祖先相比，某物种整体呈现更“幼态”的外形或特征。"},"examples":[{"en":"Some researchers argue that certain traits in modern humans reflect paedomorphosis compared with earlier hominins.","zh":"一些研究者认为，现代人相较早期人族的某些特征可能体现了幼态持续的趋势。"},{"en":"In evolutionary discussions, paedomorphosis is often contrasted with peramorphosis (more exaggerated adult traits).","zh":"在进化讨论中，幼态持续常与“超形进化”（更夸张的成体特征）相对。"}]}],"synonyms":["neoteny","juvenilization","heterochrony (broader term)"],"phonetic":"/ˌpiːdoʊmɔːrˈfoʊsɪs/","extraExplanation":["词源：paedo-（儿童）+ morph（形态）+ -osis（过程/状态）。","相关概念常出现在“异时性（heterochrony，发育时间改变）”的框架下：当性成熟发生时，身体某些结构还没发育到祖先那种“更成体”的程度，就会出现幼态持续。","常见例子是美西螈（axolotl）的“幼体性成熟”（neoteny）；不过在不同教材中，neoteny 有时被视为 paedomorphosis 的一种机制或子类型。"]}
{"word":"paedonymic","summary":{"en":"Paedonymic describes naming or addressing someone by reference to their child’s name.","zh":"paedonymic 指用子女的名字来称呼或识别某人（常是父母）的命名/称呼方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a naming practice in which an adult (often a parent) is referred to by the name of their child (similar to teknonymy).","zh":"（人名学/人类学）指一种以子女名字来称呼成人（常为父母）的命名或称呼方式；类似“以子为名”（teknonymy）。"},"examples":[{"en":"In some communities, paedonymic forms like “Fatima’s mother” are used more often than personal names.","zh":"在一些社群里，比起直呼其名，更常用“法蒂玛的妈妈”这类以子女为依据的称呼（paedonymic）。"},{"en":"The researcher noted a paedonymic pattern: parents were identified through their eldest child’s name.","zh":"研究者指出一种 paedonymic 模式：父母常通过长子（长女）的名字来被识别。"}]}],"synonyms":["teknonymic","child-based naming"],"phonetic":"/ˌpiːdəˈnɪmɪk/","extraExplanation":["这个词非常少见，多出现在学术语境（人类学、社会语言学、人名学）。日常英语里通常直接说“teknonymic”或用解释性表达：“being called by your child’s name / ‘X’s mom/dad.’”","可与常见的 -onymic 术语对比理解：patronymic（父名衍生）、matronymic（母名衍生）；而 paedonymic 则是“从子女之名出发”的称呼或命名。"]}
{"word":"paedonymy","summary":{"en":"Paedonymy means the practice or system of naming children (a rare word).","zh":"Paedonymy 指“给孩子取名的做法/体系”（很少用的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or system of naming children; the study or use of children’s names (a very rare term in onomastics, the study of names)","zh":"给儿童取名的做法或体系；对儿童名字的研究或使用（在姓名学/专名学中非常少见的词）"},"examples":[{"en":"In some cultures, paedonymy follows strict rules about which relatives a baby may be named after.","zh":"在一些文化中，paedonymy（给婴儿取名）有严格规则，例如孩子可以以哪些亲属的名字命名。"},{"en":"Her research compares paedonymy in immigrant families with naming practices in their home countries.","zh":"她的研究比较了移民家庭的 paedonymy（儿童取名方式）与其原籍国的取名习惯。"}]}],"synonyms":["child naming","baby-naming practices","naming customs"],"phonetic":"/ˈpiːdəˌnɪmi/","extraExplanation":["这个词很少见，更多时候你会看到更常用的表达：\"child naming\"（给孩子取名）、\"baby-naming practices\"（婴儿取名习惯）。","词源可拆解为 paedo-（儿童）+ -onymy（命名方式/命名体系）。在姓名学（onomastics）语境里，它指“针对孩子的命名”。","容易和相关术语混淆：teknonymy（父母以孩子为名被称呼，如“某某的爸爸/妈妈”）；patronym/matronym（源自父/母名的名字或姓氏）。"]}
{"word":"paedophilia","summary":{"en":"Paedophilia (BrE; AmE: pedophilia) means a sexual interest in prepubescent children.","zh":"paedophilia（英式；美式：pedophilia）指对未进入青春期儿童的性兴趣（临床语境下也可指相关障碍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sexual interest in prepubescent children; in clinical contexts, it may refer to a psychiatric condition involving persistent attraction to young children","zh":"对未进入青春期儿童的性兴趣；在临床语境中，也可指一种精神疾病/障碍，即对年幼儿童持续产生性吸引"},"examples":[{"en":"Pedophilia is widely condemned and is associated with serious harm to children.","zh":"恋童癖受到普遍谴责，并与对儿童造成的严重伤害相关。"},{"en":"The report discusses how clinicians assess pedophilia and how the law protects children.","zh":"该报告讨论了临床如何评估恋童癖，以及法律如何保护儿童。"}]}],"synonyms":["pedophilia"],"phonetic":"/ˌpiːdəˈfɪliə/","extraExplanation":["拼写说明：paedophilia 是英式拼写；美式更常写作 pedophilia（发音相同）。","用法与语境：在新闻与法律语境里，常会同时出现与儿童性侵（child sexual abuse）相关的讨论；需要注意的是，“性兴趣/倾向”（临床概念）与“实施性侵行为”（犯罪行为）在概念上不同，但无论如何对儿童的伤害与法律后果都极其严重。","词源小知识：paedo- 源自希腊语，意为“儿童”；-philia 表示“爱好/倾向”。在现代英语中，这个词带有强烈负面含义，通常用于严肃、正式的语境。"]}
{"word":"paedopsychologist","summary":{"en":"A paedopsychologist is a psychologist who works with children’s mental and emotional development and problems (more common in British English).","zh":"paedopsychologist 指儿童心理学家，主要用于英式英语；美式更常用 child psychologist 或 pediatric psychologist。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a psychologist who studies, assesses, or treats children’s mental, emotional, and behavioral development and problems","zh":"儿童心理学家；研究、评估或治疗儿童心理、情绪与行为发展及相关问题的心理学家"},"examples":[{"en":"The paedopsychologist evaluated the child’s anxiety at school.","zh":"儿童心理学家评估了孩子在学校的焦虑情况。"},{"en":"After the accident, the family met with a paedopsychologist to help their son cope.","zh":"事故之后，这家人见了儿童心理学家，帮助儿子应对心理压力。"}]}],"synonyms":["child psychologist","pediatric psychologist (AmE)","developmental psychologist (related)"],"phonetic":"/ˌpiːdoʊsaɪˈkɑːlədʒɪst/","extraExplanation":["“paedopsychologist”主要是英式拼写与用法（BrE）；美式英语里更常说“child psychologist”或“pediatric psychologist”。","词源上，paedo- 来自希腊语，表示“儿童”；psychologist 表示“心理学家”。","与“psychiatrist（精神科医生）”不同，psychologist 通常不具备开药资格（具体取决于国家/地区与执照）。"]}
{"word":"paedotribe","summary":{"en":"A paedotribe is an Ancient Greek trainer of boys, especially a gymnastics/physical-education teacher.","zh":"paedotribe 指古希腊训练男童的老师，尤指体操或体育教师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) a trainer of boys, especially a gymnastics or physical-education instructor.","zh":"（古希腊）男童的训练者，尤指体操或体育教师。"},"examples":[{"en":"In ancient Athens, a paedotribe taught boys exercises for strength and discipline.","zh":"在古雅典，paedotribe 教男孩训练以培养力量与纪律。"},{"en":"The writer compared the coach to a paedotribe, shaping both body and character.","zh":"作者把那位教练比作 paedotribe，既塑造身体也塑造品格。"}]}],"synonyms":["physical trainer","gymnastics instructor","coach"],"phonetic":"/ˈpiːdoʊtraɪb/","extraExplanation":["词源来自希腊语：paido-（孩子）+ tribein（摩擦、训练）。在古希腊的体育教育体系中，paedotribe 常与“gymnastes（体操教练）”等角色相关，负责指导少年进行跑步、摔跤等训练，也与当时关于公民教育（身心并重）的理念有关。","拼写上也常见 paidotribe / paidotribes（更接近原希腊语转写），paedotribe 属于较少见的变体。"]}
{"word":"paedotrophic","summary":{"en":"Paedotrophic describes a reproductive/developmental strategy where a parent supplies extra nutrition to developing young.","zh":"Paedotrophic 指亲体向发育中的幼体提供额外营养的一种繁殖/发育策略。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, zoology) Providing nourishment to developing young (embryos or larvae), beyond what is contained in the egg yolk.","zh":"（生物学/动物学）指母体或亲体向发育中的幼体（胚胎或幼虫）提供营养，超出卵黄本身所含的营养。"},"examples":[{"en":"Some sharks show paedotrophic reproduction, where the embryo receives extra nutrition from the mother.","zh":"一些鲨鱼具有 paedotrophic 的繁殖方式，胚胎会从母体获得额外营养。"},{"en":"The paper compares lecithotrophic (yolk-feeding) and paedotrophic larvae in marine invertebrates.","zh":"这篇论文比较了海洋无脊椎动物中“卵黄营养型”（lecithotrophic）幼体与“亲体供养型”（paedotrophic）幼体。"}]}],"synonyms":["matrotrophic","nutritive","parentally nourished"],"phonetic":"/ˌpiːdoʊˈtrɑːfɪk/","extraExplanation":["这个词较罕见，多见于学术语境（繁殖生物学、发育与生活史研究）。词根 paedo- 表示“幼体/年轻个体”（在生物学语境中常指幼体，不是日常所说的“儿童”），-trophic 来自 troph-（营养、摄食、供养）。","相关对比术语：lecithotrophic（依靠卵黄营养）、matrotrophic（母体供养；更常见、更广义的说法，常用于胎生或卵胎生动物）。"]}
{"word":"paedotrophist","summary":{"en":"A rare noun meaning a specialist in feeding or nutrition for children.","zh":"一个罕见名词，指研究或负责儿童喂养与营养的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who specializes in feeding, nourishing, or caring for the nutrition of children; a child nutrition specialist (rare word).","zh":"专门研究或负责儿童喂养与营养的人；儿童营养/喂养方面的专家（罕见用词）。"},"examples":[{"en":"In early medical writing, a paedotrophist might advise parents on how to feed infants safely.","zh":"在早期医学著作中，paedotrophist 可能会向父母提供如何安全喂养婴儿的建议。"},{"en":"The clinic hired a paedotrophist to design meal plans for children with growth concerns.","zh":"诊所聘请了一位 paedotrophist，为有生长发育顾虑的儿童制定饮食计划。"}]}],"synonyms":["child nutritionist","pediatric dietitian","infant-feeding specialist","child feeding specialist"],"phonetic":"/ˌpiːdoʊˈtrɑːfɪst/","extraExplanation":["这个词非常少见，现代英语里更常用的表达是 child nutritionist（儿童营养师）、pediatric dietitian（儿科营养师/注册营养师）或 infant-feeding specialist（婴幼儿喂养专家）。","词源可拆解理解：paedo- 表示“儿童”（源自希腊语 pais/pedos），-troph- 表示“喂养/营养”（如 trophic, trophism），合起来就是“与儿童喂养/营养有关的人”。","英式拼写常见 paedo-；美式语境中更常见 pedo-（但在当代英语里 pedo- 容易让人联想到 pedophile 的缩写 pedo，因此正式场合通常直接用 pediatric/child 来避免歧义）。"]}
{"word":"paedotrophy","summary":{"en":"Paedotrophy means the feeding and nourishment of children, especially infants.","zh":"Paedotrophy 指儿童（尤其婴幼儿）的喂养与营养供给。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feeding or nourishment of children; especially the care and methods used to provide food for infants and young children (e.g., breastfeeding, formula feeding, weaning).","zh":"儿童的喂养与营养供给；尤指对婴幼儿提供食物与营养的方法与照护（如母乳喂养、配方奶、断奶等）。"},"examples":[{"en":"The study compared paedotrophy practices in urban and rural communities.","zh":"这项研究比较了城市与农村社区的婴幼儿喂养方式。"},{"en":"Doctors once wrote about paedotrophy when discussing infant health and breastfeeding.","zh":"医生过去在讨论婴儿健康与母乳喂养时，常会写到“婴幼儿喂养”（paedotrophy）。"}]}],"synonyms":["infant feeding","child nutrition","child nourishment","pediatric nutrition"],"phonetic":"/ˌpiːdoʊˈtrɑːfi/","extraExplanation":["这是一个非常少见、偏学术/历史文献用词，常见于早期医学、儿科或营养学写作。现代英语更常用 infant feeding（婴儿喂养）、child nutrition（儿童营养）、breastfeeding（母乳喂养）等表达。","词源可拆为 paedo-（儿童）+ -trophy（营养、滋养；同源于 troph- “喂养/营养”）。与 atrophy（萎缩）中的 -trophy 同源，但含义相反/不同语境。"]}
{"word":"paegel","summary":{"en":"“Paegel” is not a standard English word; it is most likely a misspelling of “bagel,” a ring-shaped bread roll.","zh":"“paegel”不是标准英语词，最可能是“bagel”（贝果）的拼写误差，指一种圆环形面包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a small, chewy, ring-shaped bread roll, usually boiled briefly and then baked, often topped with seeds and eaten with fillings such as cream cheese.","zh":"（可能是你想写的）一种有嚼劲的圆环形面包，通常先短暂水煮再烘烤，常撒芝麻等配料，可夹奶油奶酪等食用。"},"examples":[{"en":"I had a toasted bagel with cream cheese for breakfast.","zh":"我早餐吃了一个烤过的贝果，抹了奶油奶酪。"},{"en":"She ordered an everything bagel and a cup of coffee.","zh":"她点了一个“全料”贝果和一杯咖啡。"},{"en":"You can make a sandwich by slicing the bagel in half.","zh":"你可以把贝果从中间切开，做成三明治。"}]}],"synonyms":["(food) bread roll","ring-shaped bread"],"phonetic":"/ˈbeɪɡəl/","extraExplanation":["“paegel”不是常见的英语单词拼写，最接近且最常用的可能是“bagel”（贝果）。如果你指的是人名/地名或其他语言（例如德语里的“Pegel”有“水位/水平/表针读数”的意思），告诉我上下文，我可以按你真正想查的词来解释。"]}
{"word":"paegle","summary":{"en":"“paegle” is not a common English word; it is likely a misspelling or a name.","zh":"“paegle”不是常见英语单词；更可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often it is a misspelling or a name (e.g., a surname/username).","zh":"不是常见英语词典中的标准词；多见于拼写错误，或作为名字（如姓氏/用户名）。"},"examples":[{"en":"I couldn’t find “paegle” in the dictionary—could you check the spelling?","zh":"我在词典里找不到“paegle”，你能确认一下拼写吗？"},{"en":"The email was signed “Paegle,” which may be a family name.","zh":"邮件署名为“Paegle”，这可能是一个姓氏。"}]}],"phonetic":"/ˈpeɪɡəl/","extraExplanation":["“paegle”在英语里不像一个常规单词。如果你想查的是某个单词，可能是拼错了。你可以核对是否想写：\n- pebble（小卵石）\n- eagle（鹰）\n- bagel（百吉饼）\n- Peggle（一个游戏名/专有名词）\n如果你告诉我出现的句子或想表达的意思，我可以帮你锁定正确的词。"]}
{"word":"paelignian","summary":{"en":"Paelignian means “of the ancient Paeligni people in central Italy,” or a person from that group.","zh":"Paelignian 指“与意大利中部古代佩利尼人有关的”，也可指“佩利尼人（部族成员）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Paeligni, an ancient Italic people who lived in central Italy (roughly in today’s Abruzzo).","zh":"与佩利尼人（Paeligni，古代意大利中部的一个意大利克部族，约在今阿布鲁佐地区）有关的；佩利尼人的。"},"examples":[{"en":"Archaeologists found Paelignian inscriptions near Sulmo, a town linked to the Paeligni.","zh":"考古学家在苏尔莫（与佩利尼人相关的城镇）附近发现了佩利尼人的铭文。"},{"en":"The museum exhibits Paelignian jewelry and pottery from pre-Roman graves.","zh":"博物馆展出了出土自罗马前墓葬的佩利尼人珠宝和陶器。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Paeligni people.","zh":"佩利尼人（Paeligni 部族的成员）。"},"examples":[{"en":"A Paelignian might have spoken an Italic language before Latin became dominant.","zh":"在拉丁语占主导地位之前，一位佩利尼人可能使用一种意大利克语。"},{"en":"The text mentions a Paelignian serving as an ally in early Roman campaigns.","zh":"文献提到一名佩利尼人在早期罗马战役中作为盟友参战。"}]}],"synonyms":["Paeligni (related form)","Italic (broader category)"],"phonetic":"/paɪˈlɪɡniən/","extraExplanation":["“Paelignian”是一个历史/考古语境下的民族与地域形容词（也可作名词），日常英语中很少用，常见于古罗马史、意大利古代部族研究和铭文学（inscriptions）相关资料。","与它常一起出现的词包括：Italic peoples（意大利克诸族）、pre-Roman（罗马之前的）、tribe（部族）、inscription（铭文）。","文化/文学背景：古罗马诗人奥维德（Ovid）出生在苏尔莫（Sulmo），这一地区与佩利尼人的活动范围相关，因此在讨论奥维德家乡的历史语境时有时会提到Paeligni/Paelignian。"]}
{"word":"paella","summary":{"en":"Paella is a traditional Spanish saffron rice dish, usually cooked and served from a wide shallow pan.","zh":"Paella 指传统的西班牙藏红花米饭料理，通常用宽浅平底锅烹调并直接分享食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Spanish rice dish, originally from Valencia, cooked in a wide shallow pan and typically made with saffron and ingredients such as seafood, chicken, rabbit, and vegetables.","zh":"西班牙海鲜饭/西班牙烩饭：起源于瓦伦西亚的一种西班牙米饭料理，用宽浅平底锅烹调，常加入藏红花，并搭配海鲜、鸡肉、兔肉或蔬菜等。"},"examples":[{"en":"We ordered seafood paella with mussels and shrimp.","zh":"我们点了海鲜西班牙海鲜饭，有贻贝和虾。"},{"en":"Paella is often cooked in a large pan so everyone can share.","zh":"西班牙海鲜饭常用大平底锅煮，好让大家一起分享。"},{"en":"The saffron gives paella its warm yellow color and aroma.","zh":"藏红花让西班牙海鲜饭呈现温暖的黄色并带来香气。"}]}],"synonyms":["Spanish saffron rice","Spanish rice dish"],"phonetic":"/paɪˈeɪjə/","extraExplanation":["“Paella”是西班牙语词，源自瓦伦西亚语/古西班牙语中与“平底锅（pan）”相关的词；因此它既指“这道饭”，也让人联想到“用来煮它的那口宽浅锅”。","文化上，瓦伦西亚的经典做法常被称为“paella valenciana”，传统上可能用兔肉、鸡肉、四季豆等；而“seafood paella（海鲜版）”在旅游区和国际上更常见。","点餐时常见搭配说法：chicken paella（鸡肉版）、mixed paella（混合版：肉类+海鲜）、vegetable paella（素食版）。"]}
{"word":"paellas","summary":{"en":"“Paellas” is the plural of “paella,” a Spanish saffron rice dish cooked in a shallow pan, often with seafood or meat.","zh":"“Paellas”是“paella”的复数，指西班牙用浅锅烹煮的藏红花米饭料理，常搭配海鲜或肉类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Paellas are Spanish rice dishes (plural of paella), usually cooked in a wide, shallow pan and often made with saffron, vegetables, and meats or seafood.","zh":"Paellas 是西班牙米饭料理（paella 的复数），通常用宽而浅的平底锅烹煮，常加入藏红花、蔬菜，以及肉类或海鲜等食材。"},"examples":[{"en":"We ordered two paellas—one seafood and one chicken.","zh":"我们点了两份 paellas——一份海鲜的，一份鸡肉的。"},{"en":"The restaurant serves paellas on weekends because they take time to cook.","zh":"这家餐厅周末才供应 paellas，因为做起来比较耗时。"},{"en":"They learned to make paellas while traveling in Spain.","zh":"他们在西班牙旅行时学会了做 paellas。"}]}],"synonyms":["Spanish rice dish","saffron rice (dish)"],"phonetic":"/paˈeɪjə/","extraExplanation":["“Paella”源自西班牙瓦伦西亚（Valencia）地区，是当地非常具代表性的传统料理；英文里常直接使用西班牙语外来词 paella，复数写作 paellas。","常见类型包括：paella de mariscos（海鲜饭）、paella mixta（海鲜+肉类的混合版）、paella valenciana（较传统的版本，常含鸡肉、兔肉和豆类等）。"]}
{"word":"paen","summary":{"en":"Paen is a rare spelling of *paean*, meaning a song or expression of praise or celebration.","zh":"paen 是 *paean* 的罕见拼写，意思是“赞歌/颂诗”，也可泛指对某人或某事的热烈颂扬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled **paean**) a song, poem, or piece of writing that expresses strong praise or celebration.","zh":"（通常拼作 **paean**）赞歌；颂诗；表达强烈赞美或庆祝的文章/作品。"},"examples":[{"en":"The article was a paean to teachers who work in underfunded schools.","zh":"这篇文章是一首献给在经费不足学校工作的教师们的赞歌。"},{"en":"The crowd sang a paean after the team won the championship.","zh":"球队夺冠后，人群唱起了赞歌。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong praise or a tribute (not necessarily a literal song).","zh":"（不一定是真正的歌曲）热烈的颂扬；致敬。"},"examples":[{"en":"Her speech was a paean of gratitude to the volunteers.","zh":"她的演讲是对志愿者们充满感激的颂扬与致敬。"},{"en":"The film is a paean to friendship and courage.","zh":"这部电影是对友谊与勇气的礼赞。"}]}],"synonyms":["paean","ode","tribute","anthem","encomium","panegyric"],"phonetic":"/ˈpiːən/","extraExplanation":["“paen”在现代英语中很少见，更多时候你会看到标准拼写 **paean**。","词源来自古希腊语 *paian*：最早指献给阿波罗等神祇的胜利/治愈颂歌；后来意义扩展为“赞歌、颂扬”。","用法提示：**a paean to + 人/事物** 很常见，表示“对……的礼赞”。"]}
{"word":"paene","summary":{"en":"Paene is a rare Latin-derived adverb meaning “almost” or “nearly,” mainly seen in scholarly or literary contexts.","zh":"paene 是源自拉丁语的罕见副词，意思是“几乎/近乎”，主要见于学术引用或文学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare, literary or scientific) almost; nearly; very close to being or happening.","zh":"（罕见，多见于文学/学术）几乎；差一点；接近于（某种状态或发生）"},"examples":[{"en":"The expedition was paene disastrous, saved only by good weather at the last moment.","zh":"这次远征几乎酿成灾难，幸亏最后关头天气转好。"},{"en":"In some academic writing, paene is used to mean “nearly,” especially in Latin quotations.","zh":"在一些学术写作中，paene 常用于拉丁文引语里，表示“几乎/近乎”。"}]}],"synonyms":["almost","nearly","practically","virtually","all but"],"phonetic":"/ˈpeɪni/","extraExplanation":["“paene”是拉丁语副词，原义就是“几乎”。在现代英语中它很少作为普通词使用，更多出现在引用拉丁语的学术语境（如古典学、法律、神学等）或带有古典风格的文学写作里。","在科学命名中也能见到它的痕迹：一些属名/词根用拉丁语 paene 表示“近似但不完全是……”，例如 Paenibacillus（可理解为“几乎是 bacillus（杆菌）那样的”）。"]}
{"word":"paeninsula","summary":{"en":"Paeninsula is the Latin form of “peninsula,” meaning land almost surrounded by water.","zh":"paeninsula 是“peninsula（半岛）”的拉丁语形式，指几乎被水包围、但仍与大陆相连的陆地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of land almost surrounded by water but connected to the mainland (like Florida or the Korean Peninsula)","zh":"半岛；三面环水、一面与大陆相连的陆地"},"examples":[{"en":"Florida is a peninsula surrounded by the Atlantic Ocean and the Gulf of Mexico.","zh":"佛罗里达是一座半岛，周围有大西洋和墨西哥湾。"},{"en":"They traveled along the peninsula to reach the small fishing towns.","zh":"他们沿着这座半岛旅行，去到一些小渔村。"}]}],"synonyms":["peninsula","headland","cape"],"phonetic":"/pəˈnɪn.sə.lə/","extraExplanation":["“paeninsula”原本是拉丁语拼写（现代英语对应词是 peninsula）。其中 pae(n)- 来自拉丁语 paene（意为“几乎、差不多”），insula 意为“岛”。合起来就是“几乎是岛的地方”，也就是“半岛”。","在古典拼写中 “ae” 有时在英语化过程中简化成 “e”，所以会出现 paeninsula → peninsula 的变化。学习时可把它当作“词源/学术拼写”来理解。"]}
{"word":"paenula","summary":{"en":"Paenula is a Latin-derived term for an ancient Roman hooded cloak, often worn for travel and rain.","zh":"Paenula 源自拉丁语，指古罗马常用于旅行和雨天的带兜帽斗篷/披风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hooded cloak or cape worn in ancient Rome, often used for travel or rainy weather","zh":"（古罗马的）带兜帽斗篷/披风，常用于旅行或雨天御寒挡雨"},"examples":[{"en":"In the museum, you can see a paenula similar to the ones Roman travelers wore.","zh":"在博物馆里，你可以看到一种类似古罗马旅行者所穿的 paenula（兜帽斗篷）。"},{"en":"The actor put on a paenula to look like a Roman messenger in bad weather.","zh":"那位演员穿上 paenula，来扮演恶劣天气中奔走的古罗马信使。"}]}],"synonyms":["cloak","cape","mantle"],"phonetic":"/pɪˈnuːlə/","extraExplanation":["Paenula 是拉丁词（也常写作 paenula/penula），在英语里属于较少见的历史/考古用词，多出现在古罗马服饰、文学注释或博物馆说明中。","它通常指一种较实用的外衣：披在身上、常带兜帽，便于赶路或挡雨；与更“正式”的罗马长袍（toga）在场合与用途上不同。"]}
{"word":"paenulae","summary":{"en":"Paenulae are Roman hooded cloaks (plural of Latin paenula), often used for travel and bad weather.","zh":"Paenulae 指古罗马的连帽斗篷/雨披式外衣（拉丁语 paenula 的复数），常用于旅行和恶劣天气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of the Latin word paenula: hooded cloaks or poncho-like outer garments worn in ancient Rome, often for travel or rainy weather.","zh":"拉丁语 paenula 的复数形式：古罗马人穿的连帽斗篷/披风，类似雨披，常用于旅行或雨天御寒挡雨。"},"examples":[{"en":"In the museum case, the label mentions paenulae worn by travelers on Roman roads.","zh":"在博物馆展柜里，标签提到罗马道路上旅行者穿的 paenulae（斗篷）。"},{"en":"The novel describes soldiers pulling their paenulae tight against the cold wind.","zh":"小说描写士兵把 paenulae（斗篷）裹紧来抵挡寒风。"}]}],"synonyms":["Roman cloak","hooded cloak","poncho-like cloak","travel cloak"],"phonetic":"/piˈnuːli/","extraExplanation":["“paenulae”严格来说是拉丁语形式，不是现代英语常用词；你多半会在古典学、考古、历史小说或博物馆说明牌中见到。","“paenula”可理解为一种实用型外衣：像斗篷与雨披的结合，有时带帽，便于在雨天或长途出行时穿着。","读音在英语语境中常被英文化处理；如果你在学拉丁语，不同教材/传统的读法可能略有差异。"]}
{"word":"paenulas","summary":{"en":"Paenulas are Roman hooded cloaks (plural of paenula).","zh":"paenulas 指古罗马的带兜帽斗篷（paenula 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of paenula) hooded outer cloaks worn in ancient Rome, usually made of thick wool and used for warmth or rain protection.","zh":"（paenula 的复数）古罗马人穿的带兜帽外披/斗篷，通常用厚羊毛制成，用来保暖或挡雨。"},"examples":[{"en":"In cold weather, travelers might wear paenulas to keep warm on the road.","zh":"天气寒冷时，旅人可能会穿 paenulas 在路上保暖。"},{"en":"The museum display included paenulas alongside Roman tunics and sandals.","zh":"博物馆展柜里把 paenulas 和罗马束腰外衣、凉鞋一起展示。"}]}],"synonyms":["cloaks","capes","ponchos"],"phonetic":"/pɪˈnjuːləz/","extraExplanation":["“paenula”来自拉丁语，指一种类似“斗篷/雨披”的外衣，在罗马帝国时期很常见，常见于出行、军旅或日常防风雨的场景。","拼写上有时也会见到变体“penula”（少见），含义相同。作为英语词汇，它多出现在历史、考古、古典学或文学描写中。"]}
{"word":"paeon","summary":{"en":"Paeon is a rare form of “paean,” meaning a song of praise; it can also refer to a Greek mythic healer or a classical metrical foot.","zh":"paeon多作“paean”的少见拼写，意为赞歌；也可指希腊神话中的医师或古典诗律中的一种音步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A song or poem of praise, celebration, or thanksgiving; a hymn of triumph (a less common spelling of “paean”).","zh":"赞歌；颂歌；凯歌（“paean”的较少见拼写）。"},"examples":[{"en":"After the team won the championship, the crowd broke into a paeon of celebration.","zh":"球队夺冠后，人群爆发出一片庆祝的颂歌。"},{"en":"The article reads like a paeon to small-town life.","zh":"这篇文章读起来像是在歌颂小镇生活。"}]},{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the physician of the gods (sometimes treated as a name or title connected to healing and Apollo).","zh":"（希腊神话）诸神的医师（常被视为与疗愈、阿波罗有关的名字或称号）。"},"examples":[{"en":"In the myth, Paeon heals the wounded god with divine medicine.","zh":"在神话中，Paeon用神药治愈受伤的神。"},{"en":"The poet invokes Paeon as a symbol of healing.","zh":"诗人把Paeon作为疗愈的象征来呼唤。"}]},{"partOfSpeech":"n.","definition":{"en":"In classical meter, a metrical foot of four syllables with one stressed/long syllable and three unstressed/short syllables (with several possible patterns).","zh":"（古典诗律）一种四音节的音步：一个重读/长音节加三个轻读/短音节（有多种排列形式）。"},"examples":[{"en":"The scholar notes a paeon pattern in the opening line.","zh":"学者指出开头一行出现了paeon音步。"},{"en":"Ancient rhetoricians used paeons to vary rhythm in speeches.","zh":"古代修辞学家用paeon来变化演讲的节奏。"}]}],"synonyms":["paean","hymn","ode","encomium"],"phonetic":"/ˈpiːən/","extraExplanation":["“paeon”常被当作“paean”的变体拼写。两者都源自希腊语，和对阿波罗（医神/光明之神）及“疗愈、赞美”的传统有关。","在现代英语里，表示“赞歌/颂扬”的用法更常见于拼写“paean”；“paeon”更容易出现在古典学、神话或诗律/修辞的语境中。"]}
{"word":"paeonia","summary":{"en":"Paeonia is the scientific (Latin) name for peonies—plants known for large, showy flowers.","zh":"Paeonia 是牡丹/芍药的拉丁学名（芍药属），以花朵大而华丽著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a peony (a flowering plant with large, often fragrant blooms), especially in the genus Paeonia; also used as the Latin/scientific name for peonies","zh":"牡丹／芍药属植物（花朵大、常带香味的观赏花），Paeonia 也常作为牡丹/芍药的拉丁学名"},"examples":[{"en":"In the botanical garden, several Paeonia varieties bloom in late spring.","zh":"在植物园里，几种芍药属（Paeonia）的品种在晚春开花。"},{"en":"She planted paeonia in the sunny bed to enjoy the big flowers each year.","zh":"她把牡丹/芍药（paeonia）种在向阳的花坛里，每年都能欣赏到大花。"}]}],"synonyms":["peony"],"phonetic":"/piˈoʊniə/","extraExplanation":["“Paeonia”源自希腊神话中的医神Paeon（派翁），传说他用这种植物治病，因此该属名带有“疗愈”的文化联想。","日常英语更常说“peony”。“Paeonia”多见于植物学、园艺标签、学术文章等较正式语境。","中文里常见的对应包括“牡丹”（木本、Paeonia suffruticosa 等）与“芍药”（草本、Paeonia lactiflora 等）。不同地区的俗称可能略有差异。"]}
{"word":"paeoniaceae","summary":{"en":"Paeoniaceae is the botanical family name for peonies (the peony family).","zh":"Paeoniaceae 指芍药科，即牡丹/芍药所属的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes peonies (genus Paeonia), known for large, often fragrant flowers; the peony family","zh":"芍药科（包含芍药属 Paeonia 的植物科），以花朵大、常带香气而闻名；即“牡丹/芍药家族”"},"examples":[{"en":"Peonies belong to the family Paeoniaceae.","zh":"芍药（牡丹、芍药）属于芍药科（Paeoniaceae）。"},{"en":"In botanical gardens, Paeoniaceae is often represented by several peony cultivars.","zh":"在植物园里，芍药科常以多种栽培的芍药/牡丹品种展示。"}]}],"synonyms":["peony family"],"phonetic":"/ˌpiːəˌnaɪˈeɪsiːi/","extraExplanation":["“Paeoniaceae”是拉丁化的植物分类学名称，通常用于科学写作与植物学教材中；日常英语更常说“the peony family”或直接说“peonies”。","在现代分类中，芍药科通常被认为主要包含一个属（Paeonia，芍药属）。不同学派与不同时期的分类系统可能在科的范围上有细微差异。"]}
{"word":"paeonian","summary":{"en":"Paeonian means “connected with Paeonia (an ancient Balkan region) or its people,” and it can also mean “a person from Paeonia.”","zh":"Paeonian 指“与派奥尼亚（巴尔干古代地区）及其居民有关的”，也可指“派奥尼亚人/派奥尼亚地区的居民”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Paeonia, an ancient region in the Balkans (north of ancient Macedonia), or its people.","zh":"与派奥尼亚（Paeonia，巴尔干地区的古代区域，位于古马其顿以北）或其居民有关的。"},"examples":[{"en":"Historians study Paeonian tribes to understand early Balkan cultures.","zh":"历史学家研究派奥尼亚部族，以了解巴尔干早期文化。"},{"en":"The inscription uses a style typical of Paeonian art.","zh":"这段铭文采用了典型的派奥尼亚艺术风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Paeonia (an inhabitant of the ancient region).","zh":"派奥尼亚人；派奥尼亚地区（古代）的居民。"},"examples":[{"en":"Ancient writers mention the Paeonians living near the Axios (Vardar) River.","zh":"古代作者提到派奥尼亚人居住在阿克西奥斯河（瓦尔达尔河）附近。"},{"en":"A Paeonian served as a soldier in a neighboring kingdom.","zh":"一位派奥尼亚人在邻近王国担任士兵。"}]}],"synonyms":["(adj.) of Paeonia","(n.) Paeonian person"],"phonetic":"/peɪˈoʊniən/","extraExplanation":["“Paeonian”主要是历史/考古语境用词，常见于古希腊、马其顿与巴尔干史研究。派奥尼亚大致位于今天北马其顿及周边地区；在不同史料中，其疆域与族群范围可能略有变化。","拼写上容易与植物学里的“Paeonia”（芍药属/牡丹相关的拉丁学名）混淆；但描述“牡丹/芍药”更常用的是“peony/peony-related”，而不是“Paeonian”。"]}
{"word":"paeonic","summary":{"en":"Paeonic means “related to a paeon,” a poetic rhythm unit (one stressed syllable + three unstressed). Rarely, it can mean “related to peonies.”","zh":"paeonic 指“与 paeon（培翁格）音步有关”（一个重读音节+三个轻读音节）；很少情况下也可指“与芍药/牡丹属有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a *paeon*, a metrical foot in poetry or classical verse made of one stressed (long) syllable and three unstressed (short) syllables (in any order).","zh":"（诗歌/古典韵律）与“pæon（培翁格）”这种音步有关；它由一个重读（长）音节和三个轻读（短）音节组成（顺序可不同）。"},"examples":[{"en":"The poem’s rhythm shifts into a paeonic pattern to create a more flowing, chant-like sound.","zh":"这首诗的节奏转为 paeonic（培翁格）音步，使声音更流畅、更像吟唱。"},{"en":"In classical metrics, a paeonic foot can add variety compared with regular iambs.","zh":"在古典格律中，paeonic 音步相比规则的抑扬格能带来更多变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to the peony (genus *Paeonia*).","zh":"（罕用）与芍药/牡丹属（*Paeonia*）有关的。"},"examples":[{"en":"The garden featured paeonic varieties that bloom in late spring.","zh":"花园里种了几种 paeonic（芍药/牡丹属的）品种，晚春开花。"}]}],"synonyms":["paeonian","peonic (less common)"],"phonetic":"/piˈɑːnɪk/","extraExplanation":["“paeonic”常见于诗歌分析与古典格律（classical meter）语境，来自希腊语 *paión*（与赞歌、颂歌传统有关）。现代英语里，这个词在日常对话中很少见，更常出现在文学评论、古典语言/诗律教材中。"]}
{"word":"paeonin","summary":{"en":"Paeonin is a scientific term for a natural compound found in peony plants, often mentioned in studies of plant pigments.","zh":"Paeonin 是一个科学术语，指芍药（peony）等植物中的一种天然化合物，常见于对植物色素的研究中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical compound found in peony (Paeonia) plants, especially a pigment-like substance studied in plant chemistry","zh":"（植化/生化）芍药属（Paeonia）植物中发现的一种天然化合物，常作为与花色有关的色素类物质被研究"},"examples":[{"en":"Researchers analyzed paeonin in peony petals to better understand how the flower gets its color.","zh":"研究人员分析了芍药花瓣中的 paeonin，以更好地理解花朵颜色的来源。"},{"en":"Paeonin is discussed mainly in scientific writing about plant pigments.","zh":"paeonin 主要出现在关于植物色素的科学写作中。"}]}],"synonyms":["peony pigment","plant compound","anthocyanin (related term)"],"phonetic":"/piˈoʊnɪn/","extraExplanation":["该词非常专业，常见于植物化学/天然产物化学文献中；日常英语里几乎不会用到。","词源上与拉丁学名 Paeonia（芍药属/牡丹属相关称呼）有关；在阅读论文时可把它理解为“芍药中某种被命名的成分/色素”。"]}
{"word":"paeons","summary":{"en":"“Paeons” means songs or words of strong praise; it can also refer to a classical poetic meter (paeon).","zh":"“paeons”指赞歌/颂扬之辞；也可指古典诗歌中的“拍昂”音步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Songs, speeches, or pieces of writing that express strong praise, celebration, or thanks.","zh":"颂歌；赞歌；（对人或事的）热烈赞美之辞。"},"examples":[{"en":"The newspaper printed paeons to the athlete after her victory.","zh":"那家报纸在她夺冠后刊登了对这位运动员的赞歌。"},{"en":"At the ceremony, several speakers offered paeons to the volunteers’ hard work.","zh":"在典礼上，几位演讲者对志愿者的辛勤付出给予了高度赞扬。"}]},{"partOfSpeech":"n.","definition":{"en":"In classical poetry, metrical units (called paeons) made up of one long syllable and three short syllables, in various orders.","zh":"（古典诗歌）“拍昂”音步：由一个长音节和三个短音节组成（顺序可不同）的格律单位。"},"examples":[{"en":"The scholar analyzed how paeons shape the rhythm of the ode.","zh":"这位学者分析了“拍昂”音步如何塑造这首颂歌的节奏。"},{"en":"Some ancient hymns use paeons to create a lively, marching beat.","zh":"一些古代赞美诗用“拍昂”音步营造轻快、行进般的节拍。"}]}],"synonyms":["praises","tributes","encomiums","eulogies","hymns"],"phonetic":"/ˈpiː.ən/","extraExplanation":["“paeons”是复数形式；单数常写作“paean”或“paeon”，在现代英语里多用“paean”表示“颂歌/赞歌”。","词源来自古希腊语，与医神/疗愈之神的称号“Paean”有关，最初指献给神的赞歌；后来引申为对任何人或事的热烈赞美。","在文学/评论语境中常见搭配：“paeans to + 名词”（对……的颂扬），有时带一点“过度吹捧”的批评意味，需结合语气判断。"]}
{"word":"paeony","summary":{"en":"“Paeony” is a less common spelling of “peony,” a large, showy garden flower.","zh":"“paeony”是“peony”的较少见拼写，指花朵大而艳丽的园艺花卉（常译牡丹/芍药）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, showy flowering plant (peony), often grown in gardens; it has big, fragrant blooms in spring or early summer.","zh":"芍药属（牡丹/芍药）植物；常见园艺花卉，花朵大而艳丽，常带香味，多在春末夏初开花。"},"examples":[{"en":"She planted paeonies along the front fence for their rich color and scent.","zh":"她在前院栅栏旁种了芍药（牡丹/芍药），因为花色浓郁又很香。"},{"en":"A vase of pink paeonies brightened the room.","zh":"一瓶粉色的芍药（牡丹/芍药）让房间明亮起来。"}]}],"synonyms":["peony"],"phonetic":"/ˈpiːəni/","extraExplanation":["“paeony”是“peony”的较少见拼写形式，含义相同；日常英语里更常用“peony”。","在中文里常把“peony”译作“牡丹”，但在英语里peony既可指木本牡丹（tree peony），也可指草本芍药（herbaceous peony）。具体看植物品种与语境。","词源与希腊神话有关：Paeon（派翁）是医神的医师，传说用这种植物治病，因此得名。"]}
{"word":"paeounlae","summary":{"en":"“paeounlae” is not an English word in standard dictionaries; it’s likely a typo or non-word string.","zh":"“paeounlae”不是词典中的标准英语单词，很可能是拼写错误或非词语字符串。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word (possibly a misspelling or random letter sequence).","zh":"不是常见或可识别的英语单词（可能是拼写错误或随机字母）。"},"examples":[{"en":"I couldn’t find “paeounlae” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“paeounlae”，你可以把它出现的句子发我吗？"},{"en":"If you meant “peon,” the spelling is different.","zh":"如果你想表达“peon（低级雇员/苦力）”，拼写是不一样的。"}]}],"extraExplanation":["“paeounlae”看起来不像标准英语单词，也不像常见外来词的固定拼写。比较可能的情况：\n1）你在打字时按错了键；\n2）你看到的是用户名/密码/编码；\n3）它原本是另一个词（例如“peon”“paeon”等）的误拼。\n\n为了帮你准确查词，请你提供：\n- 它出现的完整句子或上下文；\n- 你想表达的中文意思；\n- 你是在什么场景看到的（书、游戏、网站、课堂等）。"]}
{"word":"paepae","summary":{"en":"Paepae is a Māori word used in NZ contexts meaning a doorstep/threshold, and in cultural use the formal speaking place on a marae.","zh":"Paepae 是毛利语词，在新西兰语境中可指门槛/门口台阶；在文化语境中也指 marae 上的正式演说席（发言位置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Māori, often used in New Zealand English) a threshold, doorstep, or raised step at the entrance of a building.","zh":"（毛利语，常见于新西兰英语语境）门槛、门口台阶、入口处的抬高边缘。"},"examples":[{"en":"Please wipe your shoes before you step over the paepae.","zh":"请在跨过门槛（paepae）前把鞋底擦干净。"},{"en":"They sat on the paepae and talked while the rain passed.","zh":"他们坐在门口台阶（paepae）上聊天，等雨停。"}]},{"partOfSpeech":"n.","definition":{"en":"(Māori cultural context) the formal speaking place on a marae (meeting grounds), especially the area/seat for orators; often seen in the phrase “paepae tapu.”","zh":"（毛利文化语境）会堂/集会场（marae）上的正式发言位置（演说席/演说区）；常见于短语“paepae tapu”。"},"examples":[{"en":"Only invited speakers stepped onto the paepae during the ceremony.","zh":"仪式中只有受邀的发言者才会走上演说席（paepae）。"},{"en":"He learned the protocols before speaking from the paepae.","zh":"他在从演说席（paepae）发言前先学习相关礼仪规范。"}]}],"synonyms":["doorstep","threshold","speaking place","orators' bench"],"phonetic":"/paɪˈpaɪ/","extraExplanation":["“Paepae”来自毛利语，常以重叠形式出现（pae + pae），在英语文本里多用于新西兰背景。","在毛利文化中，marae 是重要的社区/族群聚会场所；“paepae（tap u）”与发言顺序、礼仪（protocols/tikanga）相关，属于较庄重的用法。","发音在毛利语里更接近两个音节的“pae-pae”。英语使用者有时会用接近“pie-pie”的读法来近似。"]}
{"word":"paesan","summary":{"en":"Paesan is an informal Italian-American term meaning a close friend or someone you consider “one of us,” often implying shared Italian roots.","zh":"Paesan 是意大利裔美国人常用的非正式称呼，指好朋友或“自己人”，常暗示同为意大利背景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Italian American) A close friend or buddy; someone you feel a warm sense of kinship with, especially another person of Italian background.","zh":"（非正式，主要见于意大利裔美国人用语）好朋友、哥们儿；带有亲近感的“自己人”，尤其指同为意大利背景的人。"},"examples":[{"en":"Hey, paesan, how’ve you been?","zh":"嘿，哥们儿，你最近怎么样？"},{"en":"He called everyone in the neighborhood “paesan,” even if they weren’t related.","zh":"他把邻里的人都叫“自己人/哥们儿”，即使并不是亲戚。"},{"en":"She greeted her grandfather’s old friends with a smile: “Ciao, paesans!”","zh":"她笑着跟爷爷的老朋友打招呼：“嗨，老伙计们！”"}]}],"synonyms":["buddy","pal","friend","mate","paisan","paisano"],"phonetic":"/paɪˈzɑn/","extraExplanation":["“paesan”常被认为来自意大利语/方言里的“paesano”（同乡、老乡），在美国口语中逐渐演变成带有亲切感的称呼。","常见拼写还有“paisan / paisano / paesano”。在影视作品里有时带点江湖、街区（neighborhood）氛围，但多数情况下只是随意的“兄弟/朋友”称呼。","使用时要注意语境：对不熟的人或正式场合可能显得过于随便，甚至让人觉得在刻意模仿口音。"]}
{"word":"paesani","summary":{"en":"Paesani means “people from the same hometown/region,” especially used by Italian immigrants to refer to fellow Italians from back home.","zh":"paesani 指“同乡/老乡”，尤其常用于意大利移民语境，表示“家乡来的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Especially in the U.S.) fellow countrymen from the same hometown or region; compatriots—often used among Italian immigrants to mean “people from back home.”","zh":"（尤指在美国）同乡、老乡；同一地区的乡亲——常见于意大利移民语境，指“家乡来的人”。"},"examples":[{"en":"In the old neighborhood, he still meets his paesani for coffee every Sunday.","zh":"在老社区里，他每个周日仍会和老乡们一起喝咖啡。"},{"en":"She found work through her paesani when she first arrived in New York.","zh":"她刚到纽约时，是通过同乡的人脉找到工作的。"}]}],"synonyms":["compatriots","fellow countrymen","people from my hometown","hometown friends"],"phonetic":"/paɪˈzɑni/","extraExplanation":["“paesani”来自意大利语，单数是“paesano”，字面与“村庄/家乡（paese）”有关；英语里常以复数形式出现，带有移民社区中“同乡互助、彼此照应”的文化背景。","在英语对话中使用时，语气通常亲切、带点怀旧，但也比较特定于意大利裔社群语境；对不熟悉该文化的人，直接说“people from my hometown/compatriots”会更通用。"]}
{"word":"paesano","summary":{"en":"“Paesano” is an informal word meaning an Italian friend or fellow countryman—like “buddy” or “pal,” often used in Italian-American communities.","zh":"“Paesano”是非正式说法，指意大利朋友或同乡，类似“哥们/老乡”，常见于意裔美国人社群口语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) An Italian friend or fellow Italian; a close buddy, especially among Italian Americans.","zh":"（非正式）意大利朋友/同乡；（尤指意裔美国人之间）亲近的哥们、老友。"},"examples":[{"en":"Hey, paesano—how’ve you been?","zh":"嗨，老乡/哥们——你最近怎么样？"},{"en":"He calls everyone from his neighborhood “paesano.”","zh":"他把街区里的人都叫“老乡/兄弟”。"}]},{"partOfSpeech":"n.","definition":{"en":"A casual form of address to someone Italian or from the same hometown/region.","zh":"对意大利人或同乡/同地区人的随口称呼（类似“老乡”“兄弟”）。"},"examples":[{"en":"Thanks, paesano. I appreciate the help.","zh":"谢啦，老乡/兄弟。我很感激你的帮忙。"},{"en":"Don’t worry, paesano—we’ll figure it out.","zh":"别担心，老乡/兄弟——我们会解决的。"}]}],"synonyms":["paisan","compadre","buddy","pal"],"phonetic":"/ˌpaɪˈzɑːnoʊ/","extraExplanation":["“Paesano”来自意大利语，字面和“paese”（城镇/家乡）有关，本意接近“同乡”。在美国语境里常见于意裔社区的口语称呼，带亲昵、团体认同的色彩。","使用时要注意场合与关系：在熟人之间常显得亲切；对陌生人或不熟的对象使用，可能显得唐突，甚至被误解为刻板印象（尤其在带黑帮影视语气时）。"]}
{"word":"paesanos","summary":{"en":"Paesanos means “fellow countrymen,” often “fellow Italians/Italian Americans,” and sometimes simply “buddies” in an Italian-American context.","zh":"paesanos 指“同乡/同胞”，在美国常指“同为意大利人或意大利裔的人”，也可引申为“自己人/哥们儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Italian word (used in English) meaning a fellow countryman or compatriot; in the U.S., often used to mean a fellow Italian or Italian American (a friendly “one of us”).","zh":"意大利语借词（在英语中使用）：指同乡、同胞；在美国语境中常指“同为意大利人/意大利裔的人”（带亲近感的“自己人”）。"},"examples":[{"en":"At the festival, he greeted a few paesanos from his neighborhood.","zh":"在节日上，他和社区里几个同乡（意大利裔朋友）打了招呼。"},{"en":"My grandpa called his old friends his paesanos.","zh":"我爷爷把他的老朋友称作“paesanos”（同乡/自己人）。"}]},{"partOfSpeech":"n.","definition":{"en":"More loosely: a close friend or buddy (usually within an Italian/Italian‑American setting).","zh":"引申义：好哥们、老朋友（通常出现在意大利/意大利裔美国人的语境中）。"},"examples":[{"en":"Don’t worry—he’s a paesano; he’ll help you out.","zh":"别担心——他是自己人（老熟人/哥们儿），会帮你的。"}]}],"synonyms":["compatriots","countrymen","fellow Italians","friends","buddies"],"phonetic":"/paɪˈsɑːnoʊz/","extraExplanation":["“Paesano”来自意大利语，字面与“村庄/家乡（paese）”有关，原意偏“同乡”。英语里常见于美式意大利裔社群口语。","词形：单数 paesano；复数可写 paesanos（英语化复数）或 paesani（更意大利语的复数）。","语体与语气：多为口语、带亲昵与群体认同感；若对方不在该文化圈或不熟悉该词，可能显得刻板或不合适，使用时注意场合与关系。"]}
{"word":"paesans","summary":{"en":"“Paesans” is the plural of “paesan,” meaning fellow Italians or (informally) buddies, especially in Italian American speech.","zh":"“Paesans”是“paesan”的复数，常指意大利同乡／同为意大利人，也可口语引申为“哥们儿/朋友”，多见于意大利裔美国人语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A fellow Italian, especially used among Italian Americans; a person from the same Italian hometown or background.","zh":"（非正式）意大利同乡／同为意大利人（尤指意大利裔美国人之间的称呼）；同一背景或同一地方来的人。"},"examples":[{"en":"At the festival, he ran into a few paesans from his neighborhood.","zh":"在节日上，他遇到了几个来自同一社区的意大利同乡。"},{"en":"My grandfather always called other Italian guys “paesans.”","zh":"我爷爷总把其他意大利人叫作“paesans”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, by extension) A close friend or buddy (often within an Italian American community).","zh":"（非正式，引申）哥们儿／朋友（常见于意大利裔美国人语境）。"},"examples":[{"en":"How you doing, paesan? Long time no see.","zh":"最近怎么样，哥们儿？好久不见。"},{"en":"He brought a couple of paesans to help him move.","zh":"他带了几个朋友来帮他搬家。"}]}],"synonyms":["compatriots","fellow countrymen","friends","buddies","pals"],"phonetic":"/pɑˈzɑnz/","extraExplanation":["“Paesan(s)”来自意大利语/方言中的“paesano”，字面意思是“同村的人、同乡”。在美国英语里多见于意大利裔社区的口语。","语气通常亲切、带身份认同感，但如果由非意大利背景的人使用，可能显得刻板化或冒犯；使用时注意场合与对象。"]}
{"word":"paest","summary":{"en":"“Paest” is a dialect/archaic spelling of “past” (and sometimes “passed”).","zh":"“paest”是“past”（有时也指“passed”）的方言/古旧拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A dialect or old spelling of “past” (meaning time before now).","zh":"“past”的方言或旧拼写形式（指“过去的、从前的”）。"},"examples":[{"en":"In some older texts, you may see “paest” where modern English uses “past.”","zh":"在一些较旧的文本里，你可能会看到用“paest”来代替现代英语的“past”。"},{"en":"We should learn from the paest and move forward.","zh":"我们应当从过去吸取教训并继续前行。"}]},{"partOfSpeech":"n.","definition":{"en":"A dialect or old spelling of “past,” meaning the time before the present.","zh":"“past”的方言或旧拼写形式，指“过去（的时光）”。"},"examples":[{"en":"The paest can’t be changed, but the future can.","zh":"过去无法改变，但未来可以。"}]},{"partOfSpeech":"v.","definition":{"en":"A dialect or old spelling of “passed” (the past tense of “pass”).","zh":"“passed”（pass 的过去式）的方言或旧拼写形式。"},"examples":[{"en":"He paest the test at last.","zh":"他终于通过了考试。"}]}],"synonyms":["past","passed"],"phonetic":"/pæst/","extraExplanation":["“paest”不是现代标准英语里的常用拼写，更常见于苏格兰英语（Scots）或较早期的英文写作中，通常对应现代英语的“past”或“passed”。如果你是在作业/考试/正式写作中使用，建议写成“past / passed”。","如果你看到“paest”出现在诗歌、方言对白或历史文本里，它往往是在营造地域口音或古风语感。"]}
{"word":"paetrick","summary":{"en":"“Paetrick” is not a standard English word; it is most likely a misspelling of the name “Patrick.”","zh":"“paetrick”不是标准英文词；很可能是人名“Patrick”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (first name). Often a misspelling of “Patrick.”","zh":"男性名字（名）。常见为“Patrick”的拼写错误。"},"examples":[{"en":"Patrick is my older brother’s name.","zh":"Patrick 是我哥哥的名字。"},{"en":"I think you misspelled Patrick as “paetrick.”","zh":"我觉得你把 Patrick 拼成了“paetrick”。"}]}],"synonyms":["Patrick","Pat"],"phonetic":"/ˈpætrɪk/","extraExplanation":["“Patrick”是非常常见的英文名，来源与爱尔兰有关；著名人物有“Saint Patrick（圣帕特里克）”，与“St. Patrick’s Day（圣帕特里克节，3月17日）”相关。","口语里常用昵称有“Pat”。在英语环境中，名字拼写很重要（用于邮箱、证件、订票等），建议写作时用标准拼写“Patrick”。"]}
