{"word":"pag","summary":{"en":"“pag” is not standard English; it’s often an informal/incorrect way to write “pg.” meaning “page.”","zh":"“pag”不是标准英语；常见于把“pg.”（page 的缩写，表示“页”）写错或写得很随意的情况。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling or informal typing of “pg.”, an abbreviation for “page.”","zh":"（非标准）常见的拼写/输入误差或非正式写法，多用于表示“pg.”（page 的缩写），意为“页”。"},"examples":[{"en":"See pag 12 for the chart.","zh":"图表见第 12 页。（更标准：See p. 12 / pg. 12）"},{"en":"The answer is on pag 45 of the manual.","zh":"答案在手册第 45 页。（更标准：on page 45 / on p. 45）"}]}],"synonyms":["page (standard)","p. (abbr.)","pg. (informal abbr.)"],"phonetic":"/pæɡ/","extraExplanation":["“pag”本身不是常见的标准英语词。英语里表示“页”通常写：page（完整拼写）、p.（单数页）、pp.（复数页）；在一些非正式场景也会看到 pg.。如果你想查的是“page”，告诉我我可以给你标准词条（发音、词性、常用搭配等）。"]}
{"word":"paga","summary":{"en":"“Paga” is Spanish (not standard English) meaning “pay/payment,” sometimes seen in Spanish-language contexts.","zh":"“paga”是西班牙语（非标准英语），意为“支付/付款（金额）”，常见于西语场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A Spanish word meaning “pay” or “payment,” sometimes seen on signs, receipts, or menus in Spanish-speaking contexts.","zh":"（非标准英语）西班牙语词，意思是“支付/付款”或“付款（金额）”，有时会在西语环境的标牌、收据或菜单上看到。"},"examples":[{"en":"The receipt shows “Paga aquí” (“Pay here”).","zh":"收据上写着“Paga aquí”（“在这里付款”）。"},{"en":"If you’re writing in English, use “pay” or “payment,” not “paga.”","zh":"如果用英语写作，应使用“pay”或“payment”，而不是“paga”。"}]},{"partOfSpeech":"other","definition":{"en":"(In Spanish grammar) “paga” is also a verb form meaning “he/she pays” or a command meaning “pay!” (informal).","zh":"（西班牙语语法中）“paga”也可作动词形式，表示“他/她付钱”，或作非正式命令“付钱！”"},"examples":[{"en":"In Spanish: “Ella paga la cuenta.” (“She pays the bill.”)","zh":"西语：Ella paga la cuenta.（“她付账。”）"},{"en":"In Spanish: “Paga ahora.” (“Pay now.”)","zh":"西语：Paga ahora.（“现在付钱。”）"}]}],"synonyms":["pay","payment"],"phonetic":"/ˈpɑɡə/","extraExplanation":["“paga”来自西班牙语动词 pagar（付钱/支付）。在现代西班牙语里，paga 常见用法包括：第三人称单数现在时（él/ella paga：他/她付钱）以及 tú 命令式（Paga：付钱！）。英语里一般不把它当作英语词使用；在英语句子中通常改用 pay / payment。"]}
{"word":"pagador","summary":{"en":"Pagador means “payer” in Spanish—someone (or an entity) responsible for paying.","zh":"Pagador 是西班牙语，意思是“付款人/支付方”，指负责付款的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a person or organization that pays; a payer (often used in legal, banking, or business contexts).","zh":"（西语）付款人；支付方（常见于法律、银行或商业语境）。"},"examples":[{"en":"The contract lists the company as the pagador and the supplier as the recipient.","zh":"合同中把公司列为付款方（pagador），把供应商列为收款方。"},{"en":"In some documents, pagador is used like “payor” in English.","zh":"在一些文件里，pagador 的用法类似英语里的“payor（付款方）”。"}]}],"synonyms":["payer","payor","paying party","paymaster"],"phonetic":"/ˌpɑɡəˈdɔr/","extraExplanation":["“Pagador”是西班牙语词，来自动词“pagar”（支付、付款）。在英语环境中通常不会作为日常词汇使用，但在涉及西语国家的合同、发票、银行或法律文件里，可能会直接保留原词。","英语中更常见的对应表达有：payer / payor（偏正式、法律/保险常用）、paymaster（发工资或负责支付的人/部门）、the paying party（付款方）。"]}
{"word":"pagan","summary":{"en":"Pagan means a follower of non-mainstream (often ancient, polytheistic) religions, or something related to such religions; it can also be used offensively as a judgmental label.","zh":"Pagan 指异教徒或与（常见于古代多神）非主流宗教相关的事物；也可能被当作带贬义的标签使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows a religion other than the main world religions (especially in historical or Christian contexts); often used for people in ancient polytheistic religions","zh":"异教徒；（尤指在历史或基督教语境中）指信奉主流宗教以外宗教的人；常用于指古代多神信仰者"},"examples":[{"en":"In ancient Rome, many people were pagans who worshiped many gods.","zh":"在古罗马，许多人是异教徒，崇拜多位神祇。"},{"en":"Early Christian writers sometimes called non-Christians in the empire ‘pagans.’","zh":"早期基督教作者有时把帝国内的非基督徒称为“异教徒”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to ancient religions that worship many gods, or to nature-based, non-Christian religious traditions","zh":"异教的；与古代多神信仰有关的；或指以自然为中心、非基督教的宗教传统的"},"examples":[{"en":"The museum has pagan symbols from pre-Christian Europe.","zh":"博物馆里有来自基督教之前欧洲的异教符号。"},{"en":"Some festivals include pagan traditions mixed with later religious customs.","zh":"有些节日包含与后来的宗教习俗混合在一起的异教传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often offensive) used to mean ‘not religious,’ ‘immoral,’ or ‘uncivilized’—this use can be judgmental and disrespectful","zh":"（常具冒犯性）用来表示“不虔诚/不信教”“不道德”或“未开化”等——这种用法带有评判和不尊重"},"examples":[{"en":"It’s better to avoid calling someone ‘pagan’ as an insult.","zh":"最好避免把“pagan/异教徒”当作侮辱用语。"},{"en":"The novel shows how the word ‘pagan’ was used to label outsiders.","zh":"这部小说展示了“pagan”一词如何被用来给“外人”贴标签。"}]}],"synonyms":["heathen","polytheist","non-Christian","paganistic"],"phonetic":"/ˈpeɪɡən/","extraExplanation":["词源提示：pagan 来自拉丁语 paganus，原意与“乡村居民/乡下人”有关。随着基督教在城市更早传播开来，这个词在后来的宗教语境里逐渐被用来指“非基督徒、旧信仰的人”。","文化使用建议：现代语境中，有些人会自称 Pagan（常见于某些现代异教或自然崇拜传统，如 Wicca 等），此时更像是身份认同；但在历史或宗教争论语境中，pagan 也可能带贬义。写作或对话中可根据场景选择更中性说法，如 non-Christian religions（非基督教宗教）、polytheistic religions（多神宗教）等。"]}
{"word":"paganalia","summary":{"en":"Paganalia: an ancient Roman rural midwinter festival for agricultural gods (especially Ceres), involving offerings to bless the fields.","zh":"Paganalia：古罗马乡村冬季的农业祭典，祭祀农业神（尤指刻瑞斯），以献祭祈求田地丰收。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Roman rural festival honoring agricultural deities, especially the goddess Ceres, held in midwinter (often in January) with offerings for the fields and villages.","zh":"古罗马的乡村农业节庆（常在冬季、约一月举行），用来祭祀农业神祇，尤其是谷物女神刻瑞斯（Ceres），村社会向田地与神明献祭祈求丰收。"},"examples":[{"en":"In Roman history, the Paganalia was a time for villages to make offerings for good harvests.","zh":"在罗马史中，Paganalia 是村落为求丰收而献祭的节日。"},{"en":"The novel mentions the Paganalia to show how closely Roman life followed the farming calendar.","zh":"小说提到 Paganalia，用来表现罗马人的生活与农事节令紧密相连。"}]}],"synonyms":["Roman agricultural festival","festival of Ceres"],"phonetic":"ˌpeɪɡəˈneɪliə","extraExplanation":["Paganalia 是拉丁语复数名词，常被当作单数节名使用。它与“pagan”（异教徒）在词源上相关：paganus 原意偏向“乡村的、村民的”，后才逐渐发展出“非基督徒/异教的”含义。","它属于罗马宗教与农业周期的一部分，常见描写包括乡村社群集会、向神祇献饼酒或谷物、为田界与村社祈福等；现代英语里多用于历史、古典学或文学语境。"]}
{"word":"paganalian","summary":{"en":"“Paganalian” is not standard English; it’s probably meant to mean “pagan” or “pagan-like.”","zh":"“paganalian”不是标准英文词，通常是想表达“异教的/类似异教的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) Likely a misspelling or invented form meant to mean “pagan” or “pagan-like” (connected to religions outside the major world faiths, especially pre-Christian traditions).","zh":"（非标准/罕见）很可能是拼写错误或自造词，用来表达“异教的/类似异教的”（与主流宗教以外的信仰有关，尤其指基督教兴起之前的传统信仰）。"},"examples":[{"en":"I couldn’t find “paganalian” in standard dictionaries; did you mean “pagan”?","zh":"我在标准词典里查不到“paganalian”；你是不是想写“pagan”？"},{"en":"The novel describes pagan rituals in the forest, not anything called “paganalian.”","zh":"小说描写的是森林里的异教仪式，而不是所谓“paganalian”。"}]}],"synonyms":["pagan","heathen (often offensive)","non-Christian (context-dependent)"],"phonetic":"/pəˈɡeɪnəliən/","extraExplanation":["“paganalian”不是常见英文单词，主流词典一般不收录。它看起来像把“pagan（异教的）”加了一个不常见的后缀而形成的自造形容词。","如果你能提供出现它的句子或来源（书名/文章/截图），我可以帮你判断它在特定语境里是否是专有名词、拼写错误，还是作者刻意创造的词。","你可能想要的标准词：pagan（adj./n. 异教的；异教徒）、paganism（n. 异教信仰）、pagan rites/rituals（异教仪式）。"]}
{"word":"pagandom","summary":{"en":"“Pagandom” is a rare, old-fashioned word meaning paganism or the pagan world/community.","zh":"“pagandom”是较古旧且少见的词，意为“异教（paganism）”或“异教世界/异教群体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) the state, culture, or community of pagans; paganism.","zh":"（罕见/较古旧）异教徒的状态、文化或群体；异教（信仰）。"},"examples":[{"en":"Some older books use “pagandom” to mean paganism in general.","zh":"一些较老的书会用“pagandom”来泛指异教（paganism）。"},{"en":"The author contrasts Christianity with “pagandom” in the ancient world.","zh":"作者把基督教与古代世界的“异教”作对比。"}]}],"synonyms":["paganism","the pagan world","heathenism (often negative/old-fashioned)"],"phonetic":"/ˈpeɪɡəndəm/","extraExplanation":["“Pagandom”不是现代常用词，更常见的表达是“paganism”（异教/多神或非一神教的传统信仰）或“the pagan world”（异教世界）。","词根来自“pagan”（异教徒）+ “-dom”（表示“领域/状态/群体”，类似 kingdom, freedom）。因此 pagandom 有“异教领域/异教世界”的感觉，常见于历史或宗教对比语境。","用词提醒：在不同文化与宗教语境中，“pagan”有时带有历史上的贬义色彩；现代讨论中也有人用它作自我认同（如某些新异教传统）。写作时注意语境与尊重性。"]}
{"word":"pagandoms","summary":{"en":"“Pagandom(s)” is a rare, old-fashioned noun meaning paganism or the pagan world collectively.","zh":"“Pagandom(s)”是较少见、偏旧式的名词，意思是“异教信仰”或“异教世界（泛指）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: pagandoms) The state, religion, or world of pagans; paganism collectively (rare/old-fashioned).","zh":"（复数：pagandoms）异教的状态、宗教或异教徒的世界；泛指异教信仰（较少见/偏旧式用法）。"},"examples":[{"en":"In some older history books, “pagandom” is used to mean the non-Christian world.","zh":"在一些较老的历史书里，pagandom 用来指“非基督教的世界”。"},{"en":"The novel contrasts the rise of Christianity with the traditions of pagandom.","zh":"这部小说把基督教的兴起与异教世界的传统作对比。"}]}],"synonyms":["paganism","heathenism (older/stronger tone)","the pagan world"],"phonetic":"/ˈpeɪɡəndəm/","extraExplanation":["“pagandom”是由“pagan（异教的/异教徒）+ -dom（……的领域/状态，如 kingdom、freedom）”构成，语感类似“异教领域/异教世界”。现代英语里更常用的是“paganism（异教信仰）”或“pagan religions（异教宗教）”。","你输入的“pagandoms”是复数形式，但在实际语料中很少需要用复数；如果你想表达“多种异教信仰/传统”，更自然的说法通常是“pagan religions/traditions”。","有时学习者会把它和“pagan gods（异教诸神）”混淆：gods 是“神”，pagandom/paganism 是“信仰/宗教体系或文化圈”。"]}
{"word":"paganic","summary":{"en":"“Paganic” (adj.) means “related to pagans or pagan religions.” It’s uncommon today; “pagan” is more common.","zh":"“paganic”（形容词）意为“与异教或异教信仰有关的”。现代较少用，更常用“pagan”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to pagans or pagan religions; not Christian, Jewish, or Muslim (often used in an old-fashioned or scholarly way).","zh":"与异教徒或异教信仰有关的；非基督教/犹太教/伊斯兰教的（常见于较旧或学术语境）。"},"examples":[{"en":"Some medieval writers described local festivals as “paganic” to contrast them with church traditions.","zh":"一些中世纪作家把当地节日称为“paganic”，用来和教会传统作对比。"},{"en":"The museum has artifacts from paganic rituals in Northern Europe.","zh":"博物馆里有来自北欧异教仪式的文物。"}]}],"synonyms":["pagan","heathen","non-Christian"],"phonetic":"/pəˈɡænɪk/","extraExplanation":["“paganic”在现代英语中相对少见，更常见的词是“pagan”（名词/形容词）或“paganism”（名词，异教/多神信仰）。如果你是在写作中想表达“异教的”，通常用“pagan”更自然。","在历史语境里，“pagan”最初常被基督徒用来指称非基督教信仰者；现代使用时需要注意语气，避免把它当作贬义词。"]}
{"word":"paganical","summary":{"en":"Paganical means “pagan” (rare/archaic), describing something related to pagan beliefs or rituals.","zh":"paganical 意为“异教的/异教徒的”（罕见、较古风），形容与异教信仰或仪式有关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, often humorous or archaic) Pagan; relating to pagan people, beliefs, or worship (i.e., non-Christian/non-Abrahamic religions, especially in older European contexts).","zh":"（罕见，多带幽默或古风色彩）异教的；与异教徒、异教信仰或异教崇拜有关的（在较传统的欧洲语境中常指非基督教/非亚伯拉罕宗教）。"},"examples":[{"en":"The novel describes the villagers’ paganical rituals at midsummer.","zh":"小说描写了村民在仲夏时节进行的异教式仪式。"},{"en":"He jokingly called their campfire gathering “paganical.”","zh":"他开玩笑把他们的篝火聚会称作“异教风的”。"}]}],"synonyms":["pagan","paganistic","heathenish"],"phonetic":"/peɪˈɡænɪkəl/","extraExplanation":["“paganical”不是常用词，更常见的是“pagan”或“paganistic”。在现代英语里，它往往带一点戏谑或复古的语感，用来渲染“古老、神秘、异教气息”的氛围，而不一定是严肃的宗教学术用语。","历史文学中偶尔可见这种带“-ical”的变体（类似“poetical”），有时只是作者为了节奏、押韵或文风而选择的形式。使用时要注意语境，避免在正式写作中造成不自然的感觉。"]}
{"word":"paganically","summary":{"en":"“Paganically” means “in a pagan way,” relating to pagan (non-Christian or pre-Christian) beliefs or customs.","zh":"“paganically”意为“以异教的方式”，指与异教（非基督教或基督教出现前）的信仰或习俗相关的做法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pagan way; in a manner associated with pagan religions or pre-Christian beliefs and practices.","zh":"以异教的方式；以与异教宗教或基督教出现前的信仰与习俗相关的方式。"},"examples":[{"en":"Some festivals are celebrated paganically, focusing on nature, seasons, and old symbols.","zh":"有些节日会以异教式来庆祝，强调自然、季节和古老的象征。"},{"en":"The novel describes a village that still lives paganically, with rituals tied to the forest.","zh":"这部小说描写了一个仍以异教式生活的村庄，其仪式与森林紧密相关。"}]}],"synonyms":["in a pagan way","heathenishly","non-Christianly"],"phonetic":"peɪˈɡænɪkli","extraExplanation":["“paganically”在现代英语里非常少见，写作中更常用“in a pagan way / in a pagan manner”来表达同样意思。","“pagan”在英语语境中通常指古罗马/希腊、多神信仰或与自然崇拜相关的传统；在历史上也曾被用作带有贬义的称呼，因此在描述他人信仰时要注意语气与尊重。"]}
{"word":"paganisation","summary":{"en":"Paganisation means the process of becoming more pagan or adding pre-Christian/non-monotheistic elements, often discussed in history, religion, and culture.","zh":"Paganisation 指“异教化”的过程：变得更趋向异教，或吸收前基督教/非一神教元素，常用于历史、宗教与文化研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making someone, a community, or a culture more pagan (less influenced by Christianity or another organized religion, and more associated with pre-Christian or non-monotheistic beliefs and practices)","zh":"“异教化”；使某人、某个群体或文化更趋向“异教/多神或前基督教信仰与习俗”的过程（相对减少基督教或其他组织化宗教的影响）"},"examples":[{"en":"Some historians describe the festival’s paganisation over time, as older seasonal rituals blended into public celebrations.","zh":"一些历史学者把这个节日随时间发生的“异教化”描述为：更古老的季节性仪式逐渐融入了公共庆祝活动中。"},{"en":"The author argues that the story shows a paganisation of Christian symbols in early medieval literature.","zh":"作者认为，这个故事体现了早期中世纪文学中对基督教象征的“异教化”处理。"}]}],"synonyms":["paganization","paganizing process","heathenization"],"phonetic":"/ˌpeɪɡənaɪˈzeɪʃən/","extraExplanation":["“paganisation / paganization”多见于学术语境（历史学、宗教学、文化研究）。它常用来讨论：某些基督教节日或符号如何吸收、保留或重新解释更早的民间/前基督教元素。","在不同语境中，这个词可能带有评价色彩：有人用它表达担忧或批评（认为“背离正统”），也有人中性使用（描述文化混合与变迁）。写作时可根据立场选择更中性的表达，如“the incorporation of pre-Christian elements（吸收前基督教元素）”。","拼写上英式常见“paganisation”，美式常见“paganization”。发音通常相同。"]}
{"word":"paganise","summary":{"en":"Paganise means to make something pagan or give it pagan features, often used in discussions of religion, history, and cultural influence.","zh":"Paganise 指“使异教化/赋予异教特征”，常用于宗教史、文化影响与融合的讨论中。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something pagan; to convert to pagan beliefs or practices","zh":"使（某人/某事）异教化；使改信或转向异教信仰与习俗"},"examples":[{"en":"Some writers claimed that certain festivals were later paganised by local customs.","zh":"一些作者认为某些节日后来被地方习俗异教化了。"},{"en":"He argued that the old religion was being paganised rather than preserved in its original form.","zh":"他认为这种古老宗教正在被异教化，而不是以原本形式被保存。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give something a pagan character or style (for example, in art, stories, or symbols)","zh":"赋予（作品/符号/故事等）异教色彩或风格"},"examples":[{"en":"The myth was paganised in later retellings, adding more nature gods and rituals.","zh":"这个神话在后来的改写中被异教化，加入了更多自然神祇与仪式。"},{"en":"Critics said the imagery had been paganised to feel more ancient and mysterious.","zh":"评论者说这些意象被异教化，以营造更古老、更神秘的感觉。"}]}],"synonyms":["paganize","convert (to paganism)","paganize (something)","give a pagan character to"],"phonetic":"/ˈpeɪɡəˌnaɪz/","extraExplanation":["“paganise”是英式拼写；美式更常见“paganize”。在学术写作里常用于讨论宗教史与文化融合（例如某些习俗在传播过程中被重新解释或吸收）。","注意语气：在不同语境中，“paganise”可能是中性描述（文化/宗教研究），也可能带有批评意味（指责某事“偏离正统”）。使用时要留意说话者立场与对象的感受。"]}
{"word":"paganised","summary":{"en":"“Paganised” means made pagan or influenced by pagan beliefs; it is also the past form of “paganise/paganize.”","zh":"“paganised”表示“被异教化的/带有异教影响的”，也可作动词“paganise/paganize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(UK spelling) Made pagan; influenced by pagan (non-Christian) beliefs, customs, or symbols.","zh":"（英式拼写）被“异教化”的；受到异教（非基督教）信仰、习俗或符号影响的。"},"examples":[{"en":"Some historians argue that certain winter celebrations were later paganised with older local customs.","zh":"一些历史学者认为，某些冬季庆典后来被加入更早的地方习俗，从而出现了“异教化”的现象。"},{"en":"The story uses paganised imagery—forests, spirits, and seasonal rituals—to create an ancient mood.","zh":"这个故事使用了带有异教色彩的意象——森林、精灵和季节性仪式——来营造古老氛围。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “paganise/paganize”: to make something pagan or give it pagan features.","zh":"“paganise/paganize”的过去式/过去分词：使某物异教化；给某事物增添异教特征。"},"examples":[{"en":"The author claims later writers paganised the original legend by adding new gods and rituals.","zh":"作者声称后来的写作者通过加入新的神祇与仪式，把原始传说异教化了。"},{"en":"Over time, the ceremony was paganised and mixed with pre-Christian traditions.","zh":"随着时间推移，这个仪式被异教化，并与基督教之前的传统混合在一起。"}]}],"synonyms":["paganized","heathenized","non-Christianized","pre-Christian"],"phonetic":"/ˈpeɪɡəˌnaɪzd/","extraExplanation":["“paganised”是英式拼写；美式更常写作“paganized”。两者意思相同，发音也基本一致。","pagan（异教）在英语历史语境中常与“非基督教/前基督教（pre-Christian）传统”有关。现代写作中使用时要注意语境：学术讨论多为中性描述，但在某些宗教语境里可能带有贬义色彩。","常见搭配：paganised festival/ritual/imagery（被异教化的节庆/仪式/意象）；也常用于讨论“基督教化（Christianised）”与“异教化（paganised）”之间的文化融合。"]}
{"word":"paganiser","summary":{"en":"A paganiser is someone who paganizes others or promotes pagan beliefs, often as a critical label.","zh":"paganiser 指使他人或事物“异教化”的人，或推动异教信仰的人，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes someone or something more pagan; a person who promotes pagan beliefs or practices (often used critically).","zh":"使某人或某事更“异教化”的人；推动异教信仰或习俗的人（常带批评语气）。"},"examples":[{"en":"Some writers accused the poet of being a paganiser because his work praised nature more than church teaching.","zh":"一些评论家指责这位诗人是“异教化者”，因为他的作品赞美自然多于教会教义。"},{"en":"In the debate, he was labeled a paganiser for borrowing symbols from ancient religions.","zh":"在辩论中，他因借用古代宗教的象征而被贴上“异教化者”的标签。"}]}],"synonyms":["paganizer","paganiser (UK spelling)","advocate of paganism","promoter of paganism"],"phonetic":"/ˈpeɪɡənaɪzər/","extraExplanation":["“paganiser”是英式拼写，对应美式更常见的“paganizer”。它来自动词“paganise/paganize”（使……异教化）。","“pagan”（异教徒/异教的）在历史上常被基督教作者用来指非基督宗教（尤其古罗马、希腊等多神信仰）。因此“paganiser”在很多语境里带有贬义或争议色彩，使用时要注意语气与文化敏感性。"]}
{"word":"paganises","summary":{"en":"“paganises” means ‘makes something pagan’ or ‘adds pagan elements’; it is the UK spelling of “paganizes.”","zh":"“paganises”意为“使……异教化/加入异教元素”，是英式拼写，对应美式“paganizes”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to make something more pagan; to convert someone or something to pagan beliefs or practices.","zh":"（动词第三人称单数）使某事物更具异教色彩；使某人或某事转向异教信仰或做法。"},"examples":[{"en":"Some critics say the movie paganises the holiday by focusing only on myths and magic.","zh":"一些评论者说，这部电影通过只强调神话与魔法，让这个节日变得更“异教化”。"},{"en":"The writer argues that modern culture paganises old traditions rather than preserving their original meaning.","zh":"作者认为，现代文化并非保留传统的本义，而是在把旧传统“异教化”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to add pagan elements to a religion, practice, or story; to interpret it through pagan ideas.","zh":"（动词第三人称单数）把异教元素加入某种宗教、习俗或故事中；用异教观念来解读它。"},"examples":[{"en":"A few historians claim later retellings paganises the legend with references to multiple gods.","zh":"一些历史学者认为，后来的复述通过提到多位神祇，把这个传说“异教化”了。"},{"en":"He worries the festival programme paganises the ceremony with symbols that don’t belong to it.","zh":"他担心节庆节目加入不相干的象征，从而把仪式“异教化”。"}]}],"synonyms":["paganizes","convert","paganify","reinterpret"],"phonetic":"/ˈpeɪɡənaɪzɪz/","extraExplanation":["“paganises”是英式拼写（-ise）。美式拼写更常见的是“paganizes”（-ize）。两者意思相同。","这个词通常用于评论、历史或宗教语境，带有“把某事变得更像异教/多神信仰或非基督教传统”的意味；语气可能中性，也可能带批评色彩，取决于说话者立场。"]}
{"word":"paganish","summary":{"en":"Paganish means “somewhat pagan” or “having a pagan feel,” describing beliefs, rituals, or imagery outside mainstream Christianity, often linked to ancient or nature-based traditions.","zh":"paganish 指“有点异教的/带异教气息的”，用来形容基督教主流之外的信仰、仪式或意象，常与古代或自然崇拜传统相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to paganism; non-Christian (or more broadly, non-Abrahamic), often describing religious beliefs, rituals, or aesthetics associated with ancient or nature-based traditions.","zh":"与异教（paganism）有关的；（历史上常指）非基督教的，或更广义指非亚伯拉罕诸教的，常用来形容古代或自然崇拜传统相关的信仰、仪式或风格。"},"examples":[{"en":"The novel uses paganish symbols like sacred groves and seasonal festivals.","zh":"这部小说使用了带有异教色彩的象征，比如神圣的树林和季节性节庆。"},{"en":"Some critics called the music “paganish,” meaning it felt wild and close to nature.","zh":"有些评论家称这音乐“有点异教味”，意思是它带着野性、贴近自然的感觉。"}]}],"synonyms":["pagan","pagan-like","heathenish"],"phonetic":"/ˈpeɪɡənɪʃ/","extraExplanation":["“paganish”比“pagan”更少见，语气上常带“有点像异教/带异教气息”的感觉（-ish 表示“有点……、……味”）。","历史语境里，“pagan”有时被用作外来者对他者信仰的称呼，可能带评判色彩；现代语境中也有人以中性或自我认同的方式使用（如当代新异教/新派异教）。写作时可根据场合选择更中性的表达，例如 “pagan” 或更具体的宗教名称。"]}
{"word":"paganishly","summary":{"en":"“Paganishly” means “in a pagan(-like) way,” sometimes neutrally (traditional pagan practices) and sometimes critically (seen as irreligious).","zh":"“Paganishly”意为“以异教（或类似异教）的方式”，既可中性指传统异教风俗，也可带批评意味指不虔敬、非主流宗教。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a manner associated with pagan beliefs or practices (non-Christian, especially traditional polytheistic or nature-based religions).","zh":"以异教（尤指传统多神教或自然崇拜、非基督教）信仰或习俗的方式。"},"examples":[{"en":"The villagers celebrated the harvest paganishly, with bonfires and songs for the old gods.","zh":"村民以带有异教色彩的方式庆祝丰收，点起篝火、唱歌祭拜古老的神祇。"},{"en":"Some critics said the play was staged paganishly because it used ancient fertility symbols.","zh":"一些评论家说这部戏的呈现方式很“异教化”，因为它使用了古老的生育象征。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that seems irreligious or not following mainstream religion (often a judgmental tone).","zh":"以看似不虔敬、或不遵循主流宗教的方式（常带评判语气）。"},"examples":[{"en":"He spoke paganishly about church traditions, which upset his relatives.","zh":"他用带轻蔑的口吻谈论教会传统，让亲戚们很不高兴。"},{"en":"The article described the party as paganishly indulgent.","zh":"文章把那场派对形容为“放纵得像异教徒一样”。"}]}],"synonyms":["in a pagan way","paganly","heathenishly"],"phonetic":"/ˈpeɪɡənɪʃli/","extraExplanation":["“pagan”在英语里历史上常被基督教作者用来指“非基督教的信仰者”，所以“paganishly”有时会带负面或贬义色彩；现代语境中也可能更中性，表示“带有古老/自然崇拜/多神传统的风格”。","词形：pagan（异教的/异教徒）+ -ish（有点……的、……似的）+ -ly（副词后缀）。它相对少见，更常用的说法是“in a pagan way”或“paganly”（也较少见）。"]}
{"word":"paganising","summary":{"en":"“Paganising” means making something more pagan or describing it as pagan, often in a religious or cultural context.","zh":"“Paganising”指使某事更具异教色彩，或把某事称为“异教”，常用于宗教或文化语境中。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of paganise/paganize) making something or someone more pagan; introducing or adopting pagan beliefs, symbols, or customs.","zh":"（paganise/paganize 的现在分词/动名词）使……更具异教色彩；引入或采用异教的信仰、象征或习俗。"},"examples":[{"en":"Some critics accused the festival of paganising a traditional religious holiday.","zh":"一些批评者指责这个节日把传统宗教节日“异教化”。"},{"en":"The novel describes the gradual paganising of local rituals over several centuries.","zh":"小说描写了当地仪式在数百年间逐渐“异教化”的过程。"}]},{"partOfSpeech":"v.","definition":{"en":"using language that labels something as “pagan,” often to criticize it as non-Christian or not aligned with a dominant religion.","zh":"（常带批评色彩）用“异教”的说法给某事贴标签，暗示其不符合基督教或主流宗教。"},"examples":[{"en":"The speech was condemned for paganising minority spiritual practices.","zh":"这次演讲因把少数群体的灵性实践称作“异教”而受到谴责。"},{"en":"Be careful not to paganise other cultures’ traditions when you describe them.","zh":"描述其他文化传统时要注意，不要轻率地把它们说成“异教”。"}]}],"synonyms":["paganizing","heathenizing","non-Christianizing","syncretizing"],"phonetic":"/ˈpeɪɡəˌnaɪzɪŋ/","extraExplanation":["“paganising”多见于英式拼写（paganise）；美式常写作“paganizing”（paganize）。两者意思相同。","“pagan”（异教徒/异教的）在历史上常出现在基督教语境中，用来指非基督教的多神信仰或民间宗教。因此“paganising”有时会带有价值判断或贬义色彩；在跨文化讨论中建议用更中性的说法（如“incorporating pre-Christian traditions/folk practices”）。"]}
{"word":"paganism","summary":{"en":"Paganism is a broad term for non-monotheistic or pre-Christian religious traditions, and it can also refer to modern nature-based spiritual movements inspired by older practices.","zh":"Paganism（异教/多神信仰）是对一神教传统之外宗教的宽泛称呼，常指前基督教时代的多神与自然崇拜；也可指受古老传统启发的现代自然灵性运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a general term for religions or spiritual practices outside the major monotheistic traditions (especially Christianity, Judaism, and Islam), often referring to pre-Christian polytheistic nature-based worship in Europe","zh":"对主要一神教传统（尤其是基督教、犹太教、伊斯兰教）之外宗教或灵性实践的总称；常特指欧洲基督教化之前以多神与自然崇拜为特色的宗教"},"examples":[{"en":"The museum has an exhibit on ancient European paganism and its seasonal festivals.","zh":"博物馆有一个关于古代欧洲异教（多神信仰）及其季节性节庆的展览。"},{"en":"Some scholars study how paganism influenced local customs after the spread of Christianity.","zh":"一些学者研究在基督教传播之后，异教信仰如何影响了地方习俗。"},{"en":"In the novel, the village’s paganism is shown through rituals tied to the forest and the harvest.","zh":"在小说中，村庄的异教信仰通过与森林和丰收相关的仪式表现出来。"}]},{"partOfSpeech":"n.","definition":{"en":"modern or revived nature-centered spiritual movements (often called “Neo-Paganism”), such as Wicca, that draw inspiration from older traditions","zh":"现代或复兴的、以自然为中心的灵性运动（常称“新异教/新异教主义”），如巫术宗教（Wicca）等，常从古老传统汲取灵感"},"examples":[{"en":"She practices a form of modern paganism that celebrates solstices and the changing seasons.","zh":"她实践一种现代异教形式，庆祝至日与四季更替。"},{"en":"The community center hosted a talk on paganism and contemporary environmental values.","zh":"社区中心举办了一场关于异教信仰与当代环保价值观的讲座。"}]}],"synonyms":["polytheism","heathenism","Neo-Paganism"],"phonetic":"/ˈpeɪɡəˌnɪzəm/","extraExplanation":["“paganism”在历史上常由基督徒用来指称“非基督教的多神/民间信仰”，带有外部命名的色彩；在现代语境中，许多信仰者更倾向使用更具体的名称（如 Wicca、Druidry 等），以避免被笼统或带偏见地概括。","词源上与拉丁语 paganus（原意“乡村的、乡民”）有关：在城市更早基督教化后，“乡村仍保留旧信仰”的社会印象逐渐让该词带上“异教徒/异教”的含义。使用时注意语境与语气，避免当作贬义标签。"]}
{"word":"paganisms","summary":{"en":"“Paganisms” is the plural of “paganism,” meaning various pagan beliefs and practices, sometimes used neutrally in scholarship and sometimes critically.","zh":"“paganisms”是“paganism”的复数，指多种异教信仰与实践；在学术语境多为中性，在批评语境中可能带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Beliefs, customs, or practices associated with pagan (non-Christian) religions; more generally, non-mainstream religious elements that may contrast with a dominant religion.","zh":"与“异教”（通常指非基督教传统）相关的信仰、习俗或做法；也可泛指与主流宗教相对的非主流宗教元素。"},"examples":[{"en":"Some scholars study paganisms to understand local festivals and seasonal rituals in Europe.","zh":"一些学者研究异教传统，以理解欧洲各地的节庆与季节性仪式。"},{"en":"The novel contrasts official religion with older paganisms that survive in village customs.","zh":"这部小说把官方宗教与在乡村习俗中延续的古老异教传统作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"Ideas or behaviors considered ‘pagan’ by a particular religious or cultural viewpoint, often used critically or judgmentally.","zh":"从某种宗教或文化立场看被视为“异教”的观念或行为；常带批评或评判意味。"},"examples":[{"en":"He argued that certain superstitions were paganisms that should be abandoned.","zh":"他认为某些迷信属于应被摒弃的“异教陋习”。"},{"en":"Be careful with the term, because calling someone’s traditions ‘paganisms’ can sound dismissive.","zh":"使用这个词要谨慎，因为把别人的传统称作“异教”可能显得不尊重。"}]}],"synonyms":["pagan traditions","pagan practices","non-Christian rites","folk religious practices"],"phonetic":"/ˈpeɪɡəˌnɪzəmz/","extraExplanation":["“paganisms”是“paganism”的复数形式，用复数常见于学术写作，表示多种不同的异教传统（例如古希腊宗教、北欧传统、各地民间宗教等），强调它们并非单一体系。","词语语气取决于语境：在宗教学、人类学语境中较中性；在争论或宗教批评语境中可能带贬义。","相关词：pagan（异教的/异教徒）、polytheism（多神教）、folk religion（民间宗教）、heathen（较旧且可能冒犯的“异教徒”说法，需谨慎）。"]}
{"word":"paganist","summary":{"en":"“Paganist” means a follower of paganism, or something related to pagan beliefs; it’s less common today than “pagan.”","zh":"“paganist”指异教/多神信仰的追随者，或与这种信仰相关的事物；现代英语中不如“pagan”常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows paganism (a religion/spiritual path that is not one of the major world religions, often connected with nature or pre-Christian traditions)","zh":"信奉异教/多神信仰的人；泛指不属于主要世界宗教、常与自然或基督教之前传统相关的宗教/灵性道路的追随者"},"examples":[{"en":"She identifies as a paganist and celebrates seasonal festivals.","zh":"她自认为是异教信仰者，并庆祝一些季节性的节日。"},{"en":"In older texts, “paganist” was sometimes used to label people outside Christianity.","zh":"在较早的文本中，“paganist”有时用来指基督教之外的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to paganism or to paganist beliefs and practices","zh":"与异教/多神信仰有关的；具有异教信仰色彩的"},"examples":[{"en":"The novel describes paganist rituals in a fictional village.","zh":"这部小说描写了一个虚构村庄里的异教仪式。"}]}],"synonyms":["pagan","pagan believer","adherent of paganism","neopagan (often modern)"],"phonetic":"/ˈpeɪɡənɪst/","extraExplanation":["“paganist”在现代英语里不算常用，更常见的是“pagan”（人）和“paganism”（信仰/体系）。","历史上“pagan”/“paganist”有时带有贬义或“非基督徒/未开化”的偏见色彩；谈论真实社群时更建议用当事人自称（如“pagan”“Neopagan”“Wiccan”等），并避免把它当作骂人的标签。"]}
{"word":"paganistic","summary":{"en":"“Paganistic” means relating to paganism or, sometimes critically, describing something as non-Christian or irreligious.","zh":"“paganistic”意为“与异教/异教信仰有关的”；也可带批评地指“非基督教/不虔敬的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to paganism (religions or spiritual beliefs outside the major “world religions,” especially in historical Europe), or showing beliefs/practices associated with it.","zh":"与异教/异教信仰有关的；带有异教色彩的（常指欧洲历史语境中的非主流宗教或灵性信仰）。"},"examples":[{"en":"Some early Christian writers described local festivals as paganistic rituals.","zh":"一些早期基督教作者把当地的节庆描述为带有异教色彩的仪式。"},{"en":"The novel includes paganistic symbols connected to nature and the seasons.","zh":"这部小说包含与自然和季节相关的异教象征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often critical) Suggesting “non-Christian” or “not religious,” sometimes implying something is immoral, uncivilized, or overly pleasure-focused.","zh":"（常带批评）指“非基督教的/不虔敬的”，有时暗含“不道德、粗野或过度追求享乐”等贬义。"},"examples":[{"en":"He condemned the city’s nightlife as paganistic and corrupt.","zh":"他谴责这座城市的夜生活“异教式的”且腐化堕落。"},{"en":"Be careful: calling someone’s culture “paganistic” can sound judgmental.","zh":"要注意：把别人的文化说成“paganistic（异教式的）”可能显得很武断、带偏见。"}]}],"synonyms":["pagan","paganist (rare)","heathen (often offensive/dated)","non-Christian","pre-Christian"],"phonetic":"/peɪˈɡænɪstɪk/","extraExplanation":["“paganistic”在现代英语中不算常用；更常见的是“pagan”（形容词/名词）或“paganism”（名词）。写作时如果只是表达“与异教有关”，用“pagan”往往更自然。","历史上“pagan/paganistic”常被基督教作者用来指代“非基督教”的信仰与习俗，因此容易带有价值判断；谈论当代宗教（如现代异教/新异教，neo-paganism）时，较中性的说法是“pagan”或“pagan traditions”。"]}
{"word":"paganists","summary":{"en":"“Paganists” means people who practice or support pagan religions; it’s a less common alternative to “pagans.”","zh":"“paganists”指信奉或支持异教信仰的人；现代英语中比“pagans”更少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “paganist”: a person who follows pagan religions or who supports paganism (often used in religious or historical discussions).","zh":"“paganist”的复数：指信奉异教（多神/自然崇拜等传统宗教）的人，或主张异教信仰的人（常见于宗教或历史语境）。"},"examples":[{"en":"Early Christian writers sometimes described rural worshippers as paganists.","zh":"早期基督教作者有时把乡村的崇拜者称为异教徒。"},{"en":"The novel portrays paganists celebrating seasonal festivals in the forest.","zh":"小说描写异教信徒在森林里庆祝季节性节日。"}]}],"synonyms":["pagans","heathens","followers of paganism","neo-pagans"],"phonetic":"/ˈpeɪɡənɪsts/","extraExplanation":["“paganists”在现代英语里不如“pagans”常用；很多时候更自然的说法是“pagans”（异教徒/异教信徒）或“followers of paganism”。","“pagan/paganist”在不同语境可能带有评价色彩：在学术/历史叙述中多为中性，但在宗教争论中可能被当作贬义标签。若想更尊重当代信仰群体，可用更具体的名称（如“Wiccans”“Neo-Pagans”）或说“people who practice modern Paganism”。"]}
{"word":"paganity","summary":{"en":"“Paganity” means pagan character or pagan beliefs/practices, but it’s rare today; “paganism” is the usual word.","zh":"“paganity”指“异教性质/异教信仰与习俗”，但现代英语较少用；更常用的是“paganism”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being pagan; pagan beliefs, practices, or culture (rare; often replaced by “paganism”)","zh":"异教性质；异教信仰、习俗或文化（较少见，常用“paganism”代替）"},"examples":[{"en":"Some writers used the word “paganity” to describe the old rural festivals that survived after Christianity spread.","zh":"一些作家用“paganity”来形容基督教传播后仍然保留下来的古老乡村节庆。"},{"en":"The novel contrasts the city’s strict rules with the forest’s sense of freedom and paganity.","zh":"这部小说把城市的严格规矩与森林中的自由感和“异教气息”作对比。"}]}],"synonyms":["paganism","heathenism","idolatry (context-dependent)"],"phonetic":"/peɪˈɡænɪti/","extraExplanation":["“paganity”在现代英语里非常少见，写作中通常用更常见的“paganism”（异教/异教信仰）或“pagan”作形容词（如 pagan rituals 异教仪式、pagan festival 异教节庆）。","“pagan”原意与“乡村/平民”有关，后来在历史语境中常指基督教、伊斯兰教或犹太教之外的传统多神信仰；当代也可指一些现代异教传统（如 Wicca），使用时注意语境，有时在历史或宗教争论中可能带有贬义。"]}
{"word":"paganization","summary":{"en":"Paganization means the process of becoming or making something pagan, or (rarely) labeling something as “pagan.”","zh":"Paganization 指“异教化”的过程；少见用法是把某事物贴上“异教”标签。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making someone or something pagan; the spread or adoption of pagan beliefs and practices.","zh":"使（某人/某事）变得“异教化”的过程；异教信仰与习俗的传播或被接受。"},"examples":[{"en":"Some writers described the festival’s commercialization as a kind of paganization of a religious holiday.","zh":"一些作者把这个节日的商业化描述为一种对宗教节日的“异教化”。"},{"en":"The historian argued that certain local customs showed paganization in rural areas.","zh":"这位历史学家认为，一些地方习俗显示出乡村地区的异教化现象。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of viewing people, cultures, or ideas as “pagan,” often from a Christian-centered perspective.","zh":"（少见）从以基督教为中心的视角，把某些人、文化或观念贴上“异教”标签的做法。"},"examples":[{"en":"The article criticizes the paganization of Indigenous traditions in older textbooks.","zh":"这篇文章批评旧教材把原住民传统“异教化”（贴上异教标签）的做法。"}]}],"synonyms":["paganisation","pagan influence","syncretism","de-Christianization"],"phonetic":"/ˌpeɪɡənaɪˈzeɪʃən/","extraExplanation":["“paganization”较少见，更常见的拼写是“paganisation”（英式）或更常用的表达如“pagan influence / pagan revival / syncretism（宗教融合）”。","在学术或历史语境中，它常与“Christianization（基督教化）”对照使用，用来讨论宗教传播、改宗、以及节庆与民俗如何相互影响。使用时要注意它可能带有价值判断色彩（把某些传统视为“异教”），在跨文化讨论中可选择更中性的词，如“cultural blending / syncretism”。"]}
{"word":"paganize","summary":{"en":"Paganize means to make something pagan or to add pagan (pre-Christian/folk) elements to it.","zh":"Paganize 指使某人/某事异教化，或给某事加入异教（前基督教/民俗）元素。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something pagan; to convert (a person or group) to pagan beliefs or practices","zh":"使（某人/某群体）变成异教徒；使改信或转向异教信仰与习俗"},"examples":[{"en":"Some historians argue that Roman religion influenced local customs, but it did not fully paganize the entire region.","zh":"一些历史学者认为罗马宗教影响了当地习俗，但并没有让整个地区完全异教化。"},{"en":"The author claims the empire tried to paganize public ceremonies.","zh":"作者声称帝国试图让公共仪式异教化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add pagan elements to something (such as a festival, story, or symbol), often by blending older pre-Christian traditions with newer ones","zh":"给某事物加入异教元素（如节日、故事或象征），常指把更早的前基督教传统与后来传统混合"},"examples":[{"en":"Over time, folk traditions may paganize a holiday by adding seasonal rituals.","zh":"随着时间推移，民俗传统可能会通过加入季节性仪式让一个节日带上异教色彩。"},{"en":"Critics said the new version of the myth paganized the original religious message.","zh":"批评者说这个神话的新版本让原本的宗教信息变得更异教化。"}]}],"synonyms":["convert to paganism","paganise","make pagan","secularize (in some contexts)"],"phonetic":"/ˈpeɪɡəˌnaɪz/","extraExplanation":["“paganize”由“pagan（异教的）+ -ize（使……化）”构成，语体偏书面/学术，日常口语中不常用。","它常出现在宗教史、文化研究的语境里，用来讨论“改宗”或“传统混融（syncretism）”等现象；使用时注意语气可能带有评价色彩（褒贬取决于说话者立场）。"]}
{"word":"paganized","summary":{"en":"“Paganized” means “made pagan” or “having pagan influence,” often used in discussions of religion, history, and culture.","zh":"“paganized”表示“被异教化/使异教化”，常用于宗教、历史与文化讨论，指吸收异教或前基督教元素。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle) Made something adopt pagan (non-Christian) beliefs, practices, or style; gave it a pagan character.","zh":"（过去式/过去分词）使某事物带有异教（非基督教）信仰、习俗或风格；使其“异教化”。"},"examples":[{"en":"Some critics said the old festival was paganized over time, mixing Christian and pre-Christian customs.","zh":"一些评论者说，这个古老节庆随着时间被“异教化”了，混合了基督教与更早的习俗。"},{"en":"The writer claimed the ceremony had been paganized by adding symbols of nature worship.","zh":"作者声称这场仪式因加入自然崇拜的象征而被异教化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Having been made pagan in character; influenced by pagan ideas or imagery.","zh":"（形容词）已被异教化的；受异教观念或意象影响的。"},"examples":[{"en":"The novel describes a paganized version of a medieval legend.","zh":"这部小说描写了一个被异教化的中世纪传说版本。"},{"en":"They debated whether the art style was Christian or heavily paganized.","zh":"他们争论这种艺术风格是基督教的，还是被严重异教化的。"}]}],"synonyms":["heathenized","pagan-influenced","non-Christianized","syncretized"],"phonetic":"/ˈpeɪɡəˌnaɪzd/","extraExplanation":["“paganize”常见于宗教史、文化史或批评性写作中，语气有时带评判色彩：说某传统被“paganized”，可能暗示它偏离了正统宗教（尤其是基督教）并吸收了更早或不同的民间/多神信仰元素。","词源上与“pagan（异教徒）”相关；在英语语境里，pagan既可指历史上的非基督教宗教，也可能被宽泛用来指“自然崇拜、民间信仰、前基督教传统”等。使用时注意具体语境与对方文化立场。"]}
{"word":"paganizer","summary":{"en":"A “paganizer” is a person who makes beliefs or culture more pagan, often used in religious or cultural criticism.","zh":"“paganizer”指使信仰或文化更“异教化/非基督化”的人，常用于宗教或文化批评语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes someone or something more pagan (less Christian or less aligned with mainstream religion), especially by influencing beliefs, practices, or culture.","zh":"使某人或某事更“异教化/非基督化”的人；尤指通过影响信仰、习俗或文化，使其更像异教传统的人。"},"examples":[{"en":"Some writers accused the poet of being a paganizer because his work used Greek gods and rituals.","zh":"一些评论家指责这位诗人是在“异教化”，因为他的作品使用了希腊诸神与仪式。"},{"en":"In the debate, the reformers warned against paganizers who blended old customs into church festivals.","zh":"在争论中，改革者警告要提防把旧习俗掺进教会节庆的“异教化者”。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader (often critical) sense, someone who promotes pagan ideas or styles in society, art, or politics.","zh":"（更广义、常带批评色彩）在社会、艺术或政治中推崇异教观念或风格的人。"},"examples":[{"en":"The essay labels certain artists as paganizers for celebrating nature as sacred without reference to God.","zh":"这篇文章把某些艺术家称为“异教化者”，因为他们把自然当作神圣之物来赞美，却不提上帝。"},{"en":"He rejected the claim that he was a paganizer and said he was simply interested in mythology.","zh":"他否认自己是“异教化者”，说他只是对神话感兴趣。"}]}],"synonyms":["paganizer","promoter of paganism","one who paganizes"],"phonetic":"/ˈpeɪɡənaɪzər/","extraExplanation":["“paganizer”来自动词“paganize”（使……异教化/非基督化）+ 后缀“-er”（做某事的人）。它并不常用，更多见于宗教史、文化批评或争论性写作中。","这个词常带立场色彩：在一些基督教语境里可能是贬义（指责某人把“异教元素”带入宗教或文化）；在学术讨论中也可能较中性，用来描述历史上的“异教化过程”。","相关词：paganize（动词），paganization（名词）；近义表达可用“promoter of paganism / one who paganizes”。"]}
{"word":"paganizes","summary":{"en":"“Paganizes” means “makes something pagan” or “treats someone as a pagan,” usually from a Christian or historical viewpoint.","zh":"“paganizes”意为“使……异教化”或“把……视为异教徒”，多用于基督教立场的评论或历史语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something pagan; to give it a pagan character (often said from a Christian viewpoint)","zh":"使（某人或某事物）变成异教的；使带有异教色彩（常从基督教视角来表达）"},"examples":[{"en":"Some critics argue that modern culture paganizes religious holidays by focusing only on shopping and parties.","zh":"一些批评者认为，现代文化通过只关注购物和聚会，把宗教节日“异教化”了。"},{"en":"The writer says the film paganizes the story by replacing Christian symbols with nature worship.","zh":"作者说这部电影通过用自然崇拜取代基督教象征，把故事“异教化”了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat someone as a pagan (a non-Christian), often in a judgmental or historical context","zh":"把（某人）当作异教徒/非基督徒来看待（常用于带评判色彩或历史语境）"},"examples":[{"en":"In the novel, the colonizers paganizes local people and dismisses their traditions as 'uncivilized.'","zh":"在小说里，殖民者把当地人“视为异教徒”，并把他们的传统斥为“不文明”。"}]}],"synonyms":["secularizes","de-Christianizes","heathenizes","gives a pagan character to"],"phonetic":"/ˈpeɪɡənaɪzɪz/","extraExplanation":["“paganizes”是动词“paganize”的第三人称单数形式（he/she/it paganizes）。常见于宗教、文化批评或历史讨论中，语气可能带有评价或贬义；在跨文化表达时更中性、具体的说法可以是“secularizes（世俗化）”“adds non-Christian elements（加入非基督教元素）”。","“pagan / paganism”在当代也可能是一些新异教（Neopagan）群体的自我认同用语，因此用“paganize”描述他人信仰时要注意语境与尊重。"]}
{"word":"paganizing","summary":{"en":"“Paganizing” means making something adopt pagan beliefs or adding pagan (often pre-Christian) elements to a religion or tradition.","zh":"“paganizing”指使某事物带有异教信仰/习俗，或在宗教与传统中加入（常指前基督教的）异教元素。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making someone or something adopt pagan beliefs or practices; giving something a pagan character","zh":"使某人或某事物接受异教（多神/非基督教）信仰或习俗；使带有异教色彩"},"examples":[{"en":"Some critics accused the festival of paganizing a religious holiday.","zh":"一些批评者指责这个节日把一个宗教节日“异教化”。"},{"en":"The church leaders worried that local customs were slowly paganizing the community’s worship.","zh":"教会领袖担心当地习俗正在慢慢使社区的敬拜方式异教化。"}]},{"partOfSpeech":"v.","definition":{"en":"(in history or cultural studies) mixing pre-Christian or non-Christian elements into a religion or tradition","zh":"（历史/文化研究中）把前基督教或非基督教元素融入某种宗教或传统"},"examples":[{"en":"The author argues that the new rituals were paganizing older beliefs rather than replacing them.","zh":"作者认为这些新仪式是在把旧信仰异教化，而不是完全取代它们。"},{"en":"In some regions, converting populations involved compromise, which outsiders later described as paganizing.","zh":"在一些地区，改宗过程包含妥协，后来外人把这种现象称为“异教化”。"}]}],"synonyms":["paganize","heathenize","secularize (sometimes, depending on context)","syncretize (related, more neutral)"],"phonetic":"/ˈpeɪɡəˌnaɪzɪŋ/","extraExplanation":["“paganizing”来自动词“paganize”（使异教化）。它常见于宗教史、文化批评或争论语境，语气往往带有评判色彩，暗示“偏离正统/掺杂不纯”。使用时要注意对不同信仰与文化保持尊重。","在英语里“pagan”历史上常被基督徒用来指代非基督教的多神或民间宗教信仰；现代语境中也可能指当代的新异教（neopagan）传统。"]}
{"word":"paganly","summary":{"en":"“Paganly” means “in a pagan manner,” often used in literary writing to suggest pagan rituals or a nature-centered, earthy feeling.","zh":"“paganly”意为“以异教的方式”，多见于文学表达，用来暗示异教仪式或崇尚自然、质朴原始的氛围。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pagan way; in a manner associated with pagan beliefs, rituals, or values (not Christian/monotheistic).","zh":"以异教的方式；带有异教信仰、仪式或价值观色彩地（非基督教/一神教）。"},"examples":[{"en":"The villagers celebrated paganly around the bonfire, singing old seasonal songs.","zh":"村民们围着篝火以异教式地庆祝，唱着古老的季节歌谣。"},{"en":"The poet describes the forest as a place where people still live paganly, close to earth and sky.","zh":"诗人把森林写成一个人们仍以异教式地生活、亲近大地与天空的地方。"}]},{"partOfSpeech":"adv.","definition":{"en":"More generally (often literary): in a sensual, nature-centered, or “earthy” way, as if worshipping nature.","zh":"更广义（常见于文学语境）：以感官化、崇尚自然或“质朴原始”的方式，仿佛在敬拜自然。"},"examples":[{"en":"They ate paganly, savoring each bite as if it were a small ritual.","zh":"他们吃得很“异教式地”投入，细细品味每一口，仿佛那是一场小仪式。"},{"en":"The music rose paganly—wild, rhythmic, and joyful.","zh":"音乐带着一种“异教式”的气息升腾起来——狂野、有节奏而欢快。"}]}],"synonyms":["in a pagan way","heathenly (often negative/old-fashioned)","ritually","earthily (sense-dependent)"],"phonetic":"/ˈpeɪɡənli/","extraExplanation":["“paganly”比较少见、偏文学用法；日常英语更常用“in a pagan way”或用形容词“pagan”来改写句子（例如：a pagan ritual）。","词形来源很直观：pagan + -ly（构成副词）。在写作中它常用来营造“古老、自然崇拜、仪式感或原始感”的氛围；但在现实语境中使用时要注意文化敏感性，避免把“pagan”当作贬义标签。"]}
{"word":"paganry","summary":{"en":"Paganry means paganism—pagan beliefs and practices—and sometimes (in older usage) pagan people as a group.","zh":"paganry 指“异教信仰与习俗”（类似 paganism），旧用法中也可指“异教徒群体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pagan beliefs, religions, or practices; the state of being pagan.","zh":"异教（信仰/宗教/习俗）；异教状态。"},"examples":[{"en":"In the Middle Ages, Christian writers often described local folk customs as paganry.","zh":"在中世纪，基督教作者常把一些地方民俗称为“异教习俗”。"},{"en":"The novel contrasts the village’s old paganry with the new church’s teachings.","zh":"这部小说对比了村里古老的异教信仰与新教会的教义。"}]},{"partOfSpeech":"n.","definition":{"en":"pagan people collectively (an older, sometimes dismissive use).","zh":"异教徒（泛指一群异教信仰者；较旧用法，有时带贬义）。"},"examples":[{"en":"Some historical texts speak of “the paganry” in a way that reflects the author’s bias.","zh":"一些历史文本提到“异教徒群体”时，会显露作者的偏见。"}]}],"synonyms":["paganism","heathenism","polytheism (sometimes)","folk religion (context-dependent)"],"phonetic":"/ˈpeɪɡənri/","extraExplanation":["“paganry”在现代英语里不算常用，更常见的是“paganism”（异教/异教信仰）。在历史语境中，它有时带有旁观者（常为基督教作者）给出的评价色彩，因此使用时要注意语气与文化敏感度。","词尾“-ry”常表示“集体/状态”（如 peasantry 农民阶层），所以 paganry 既可指“异教信仰与习俗”，也可指“异教徒群体”。"]}
{"word":"pagans","summary":{"en":"“Pagans” means people who follow non-mainstream (often ancient) religions, and it can also describe things related to such religions.","zh":"“pagans”指异教徒（常指古代或非主流宗教的信徒），也可作形容词表示“异教的/多神或自然崇拜相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who follow a religion other than the main world religions (often used historically to mean people who were not Christian, Jewish, or Muslim).","zh":"异教徒；（常指历史上）不信奉基督教、犹太教或伊斯兰教的人。"},"examples":[{"en":"Early Christians sometimes described the people who still worshiped the old Roman gods as pagans.","zh":"早期基督徒有时把仍然崇拜古罗马诸神的人称为异教徒。"},{"en":"The museum has artifacts from pagan temples and festivals.","zh":"博物馆里有来自异教神庙和节庆的文物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to religions that worship many gods or nature, especially in ancient times.","zh":"（尤指古代）异教的；多神信仰或自然崇拜相关的。"},"examples":[{"en":"They studied pagan rituals in ancient Europe.","zh":"他们研究了古代欧洲的异教仪式。"},{"en":"The story includes pagan symbols like sacred trees and seasonal celebrations.","zh":"这个故事包含一些异教象征，例如神圣的树木和季节性庆典。"}]}],"synonyms":["non-Christians (historical context)","polytheists","heathens (often negative/old-fashioned)"],"phonetic":"/ˈpeɪɡənz/","extraExplanation":["“pagan”一词在不同语境里语气差别很大：在历史文献或宗教争论中，它有时带有贬义；但在现代学术或自我认同语境中（如“Modern Paganism/新异教”），常是中性甚至是自称。使用时注意尊重对方的身份与信仰。","词源上，pagan 来自拉丁语 *paganus*，原意与“乡村/村民”有关。随着基督教在城市传播，这个词逐渐被用来指仍保留传统多神信仰的人。","在当代英语里，如果你想更中性地表达“非某一宗教的人”，通常不会用 pagans，而会用更具体的说法（如 “followers of traditional religions” 或直接说具体信仰名称）。"]}
{"word":"pagatpat","summary":{"en":"“pagatpat” is not recognized as a standard English word; please provide context to identify it.","zh":"“pagatpat”不是常见英语词；请提供上下文以便确认它的来源、拼写与含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language (for example, Filipino/Tagalog).","zh":"不是标准英语单词。它可能是拼写错误、人名/地名，或来自其他语言（例如菲律宾语/他加禄语）。"},"examples":[{"en":"I couldn’t find “pagatpat” in an English dictionary—can you share a sentence where you saw it?","zh":"我在英语词典里找不到“pagatpat”——你能把它出现在什么句子里发给我吗？"},{"en":"If it’s a name, the pronunciation and meaning may depend on the family or region.","zh":"如果它是名字，发音和含义可能因家族或地区而不同。"}]}],"extraExplanation":["“pagatpat”更像是非英语词形。若你是在菲律宾语语境里见到的，它可能与“pat-pat”（轻拍、拍打）这类拟声或叠音形式有关，但需要原句才能确认含义与用法。把上下文（整句/来源/你想表达的意思）发我，我可以帮你判断最可能的词、正确拼写、发音和对应英文表达。"]}
{"word":"page","summary":{"en":"Page most commonly means a numbered sheet in a book or a screen on a website; as a verb, it can mean to call someone via a paging system or to flip through pages.","zh":"page最常指书中的一页或网站/应用的页面；作动词时可指用传呼/广播系统呼叫某人，或指快速翻阅书页。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sheet of paper in a book, magazine, or document (one side of a leaf), usually numbered.","zh":"（书、杂志或文件的）一页（通常有页码；指纸张的一面）。"},"examples":[{"en":"Please turn to page 10.","zh":"请翻到第10页。"},{"en":"This page is torn.","zh":"这一页被撕破了。"}]},{"partOfSpeech":"n.","definition":{"en":"The content shown on one screen of a website, app, or document (a web page/screen page).","zh":"（网站、应用或电子文档的）页面（屏幕上显示的一页内容）。"},"examples":[{"en":"The page won’t load.","zh":"页面加载不出来。"},{"en":"Click “Next” to go to the next page.","zh":"点击“下一页”进入下一页。"}]},{"partOfSpeech":"n.","definition":{"en":"A young servant in the past (especially in a royal or noble household).","zh":"（旧时，尤指王室或贵族家中的）男侍从；小侍从。"},"examples":[{"en":"In the story, the knight travels with a page.","zh":"在故事里，那位骑士带着一名小侍从旅行。"}]},{"partOfSpeech":"v.","definition":{"en":"To call someone by using a loudspeaker or a paging system.","zh":"（用广播/传呼系统）呼叫；传呼。"},"examples":[{"en":"They paged Dr. Lee to the emergency room.","zh":"他们用广播呼叫李医生到急诊室。"},{"en":"Please page me if the client arrives.","zh":"如果客户到了，请呼叫我。"}]},{"partOfSpeech":"v.","definition":{"en":"To turn pages (usually quickly) in a book or document.","zh":"（通常快速地）翻页；翻阅。"},"examples":[{"en":"She paged through the report looking for the chart.","zh":"她快速翻阅报告，寻找那张图表。"}]}],"synonyms":["sheet","leaf (book)","webpage","screen","call","summon","flip through"],"phonetic":"/peɪdʒ/","extraExplanation":["“page”在书里常和“turn to page…”（翻到……页）、“on page…”（在……页）搭配使用。","在数字环境里，“web page”指网页；“home page”是主页。","动词“page”更常用于美式英语的医院、商场等场景：用广播系统“page someone”。"]}
{"word":"pageant","summary":{"en":"A pageant is either (1) a judged public competition/show (often beauty or talent) or (2) a grand ceremonial display or procession.","zh":"pageant 指（1）带评审的公开竞赛/展示（常见选美或才艺），也可指（2）盛大的庆典式展示或游行表演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A public show or competition with performances and judging, often based on beauty, talent, or themed presentation (e.g., a beauty pageant).","zh":"一种公开的表演或竞赛活动，通常包含展示与评审，常见于选美、才艺或主题展示（如选美比赛）。"},"examples":[{"en":"She won first place in a local beauty pageant.","zh":"她在当地的选美比赛中获得了第一名。"},{"en":"The pageant included talent, interviews, and an evening-wear presentation.","zh":"这场选美活动包含才艺表演、采访问答和晚礼服展示。"},{"en":"Some people criticize pageants for focusing too much on appearance.","zh":"有些人批评选美比赛过于强调外貌。"}]},{"partOfSpeech":"n.","definition":{"en":"A large, colorful public display or ceremony, often historical or religious, with costumes and a procession.","zh":"一种大型、华丽的公众展示或仪式，常带有历史或宗教色彩，包含服装表演和游行。"},"examples":[{"en":"The town held a pageant to celebrate its history.","zh":"这个小镇举办了一场庆典式表演来庆祝它的历史。"},{"en":"The holiday pageant featured costumes and traditional music.","zh":"节日庆典表演有服装展示和传统音乐。"}]}],"synonyms":["beauty contest","competition","show","spectacle","ceremony","procession"],"phonetic":"/ˈpædʒənt/","extraExplanation":["“pageant”除了“选美比赛”，还常指“盛大的庆典/游行式表演”。在英语文化里，beauty pageant（选美）很常见，如 Miss America、Miss Universe；但在教会或学校里也常有 Christmas pageant（圣诞节戏剧/庆典表演），更偏向表演与仪式感，而不一定与外貌评比有关。","词源来自中古法语，核心感觉是“公开展示、壮观场面”。因此它既能指比赛，也能指大型仪式性的演出或游行。"]}
{"word":"pageanted","summary":{"en":"“Pageanted” is a rare word meaning “made into or presented like a pageant”—showy, ceremonial, and spectacle-like.","zh":"“Pageanted”很少见，意思是“被以盛典式的方式呈现/庆祝”，带有华丽、仪式感和场面感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Presented or performed with the showy, ceremonial style of a pageant; staged as a spectacle.","zh":"（少见）以盛典/游行式的华丽、仪式感来呈现的；被当作一种“盛大表演/场面”来上演的。"},"examples":[{"en":"The town’s history was pageanted in a colorful parade each summer.","zh":"小镇的历史每年夏天都会通过一场色彩缤纷的游行被“盛典式”地呈现出来。"},{"en":"The director pageanted the coronation scene with music, banners, and crowds.","zh":"导演用音乐、旗帜和人群把加冕场景“盛典化”地呈现出来。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of a rare verb meaning “to present as a pageant; to celebrate with ceremony and spectacle.”","zh":"一个少见动词的过去式/过去分词：指“以盛典/游行/隆重仪式的方式来展示或庆祝”。"},"examples":[{"en":"Their victory was pageanted across the capital with fireworks.","zh":"他们的胜利在首都以烟火与庆典的方式被隆重庆祝。"},{"en":"In the novel, the hero’s return is pageanted as a public festival.","zh":"在小说里，英雄的归来被写成一场公开的节庆盛典。"}]}],"synonyms":["ceremonial","spectacular","pomp-filled","festive","staged","presented with pageantry"],"phonetic":"/ˈpædʒəntɪd/","extraExplanation":["“pageanted”在现代英语里非常少见，更多时候人们用名词pageant（盛典；选美；游行式表演）或pageantry（盛典的排场/华丽仪式感）。","如果你想表达“像盛典一样隆重展示”，也可以用更常见的说法：staged as a spectacle / celebrated with ceremony / presented with pageantry。","拼写上请确认是不是想查pageant（名词）或pageantry（名词）。"]}
{"word":"pageanteer","summary":{"en":"“Pageanteer” is a nonstandard, informal word meaning a person who participates in a pageant (a pageant contestant).","zh":"“pageanteer”是非标准、较少见的非正式用法，意思是参加选美或其他pageant的选手（参赛者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, nonstandard) A person who takes part in a pageant (especially a beauty pageant); a pageant contestant.","zh":"（非正式、非标准拼写）参加选美比赛或其他“盛典/竞赛式表演”（pageant）的人；选手。"},"examples":[{"en":"She became a pageanteer to build confidence and practice public speaking.","zh":"她参加选美比赛当选手，是为了建立自信并练习公众演讲。"},{"en":"Several pageanteers volunteered at the charity event after the competition.","zh":"比赛结束后，几位参赛选手参加了慈善活动的志愿服务。"}]}],"synonyms":["pageant contestant","contestant","participant"],"phonetic":"/ˌpædʒənˈtɪr/","extraExplanation":["“pageanteer”并不是常见或标准的英语词拼写。更常见的说法是：pageant contestant（选美/选拔赛选手）、pageant participant（参赛者），有时也会看到较少用的 pageantier / pageanter 作为“参赛者”的非正式称呼。","词根来自 pageant（盛典、巡游、选美比赛等）。后缀 -eer 常表示“从事某活动的人”（如 engineer, volunteer），所以按构词逻辑能理解为“参加 pageant 的人”，但实际使用频率不高。"]}
{"word":"pageantic","summary":{"en":"“Pageantic” means pageant-like: grand, ceremonial, and visually showy.","zh":"“pageantic”表示“像盛典/游行一样的”：盛大、仪式感强、很华丽。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a pageant; showy, ceremonial, and visually impressive.","zh":"如同盛典/游行般的；华丽的、仪式感强的、视觉上很壮观的。"},"examples":[{"en":"The opening ceremony was pageantic, with flags, music, and dancers filling the stadium.","zh":"开幕式非常pageantic：旗帜、音乐和舞者把体育场都填满了。"},{"en":"They staged a pageantic parade to celebrate the city’s anniversary.","zh":"他们举办了一场华丽的庆祝游行来纪念城市周年。"},{"en":"Her pageantic costume sparkled under the bright lights.","zh":"她那套盛典般华丽的服装在强光下闪闪发亮。"}]}],"synonyms":["ceremonial","spectacular","grand","showy","processional"],"phonetic":"/pædʒˈæntɪk/","extraExplanation":["“pageantic”相对少见，更常见的是“pageant”（n. 盛典/选美/游行）和“pageantry”（n. 盛大的仪式、排场）。写作时如果想更自然，也可以用“ceremonial / spectacular / grand / showy”等词来替换。"]}
{"word":"pageantries","summary":{"en":"Pageantry means an elaborate ceremony or show; it can also mean showy display that hides a lack of substance.","zh":"Pageantry 指华丽的仪式/盛典；也可指华而不实的排场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Elaborate public display or ceremony, often with costumes, music, and formal rituals.","zh":"（常指有服装、音乐与仪式的）盛典；华丽的公众展示；排场"},"examples":[{"en":"The opening ceremony was full of pageantry, with flags, drums, and dancers.","zh":"开幕式充满盛典气氛，有旗帜、鼓乐和舞者。"},{"en":"Royal pageantry attracts tourists from around the world.","zh":"王室的盛典仪式吸引了世界各地的游客。"}]},{"partOfSpeech":"n.","definition":{"en":"A showy or impressive appearance that may hide a lack of real substance.","zh":"（有时带贬义）虚饰的排场；华而不实的表面"},"examples":[{"en":"Behind the pageantry of the event, there were serious financial problems.","zh":"在活动的华丽排场背后，其实有严重的财务问题。"},{"en":"He preferred honest work to empty pageantry.","zh":"他更喜欢踏实的工作，而不是空洞的排场。"}]}],"synonyms":["ceremony","spectacle","pomp","splendor","display"],"phonetic":"/ˈpædʒəntri/","extraExplanation":["你输入的“pageantries”很可能是拼写或词形的小错误。常见词是 **pageantry**（名词，不可数时多见）；若要表达“多场盛典/多种排场”，可以用 **pageantries** 作为复数，但在日常英语里并不常见，更常写成 *acts of pageantry*、*ceremonies* 等。","词源上，pageantry 与 *pageant*（盛典/游行表演）相关，常用于描述国庆、王室活动、毕业典礼等带有“仪式感”和“视觉效果”的场合。"]}
{"word":"pageantry","summary":{"en":"Pageantry means grand, colorful ceremony or display, sometimes suggesting it is mainly for show.","zh":"Pageantry 指盛大华丽的仪式场面或排场，有时也带“只是做给人看”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorful, formal display with ceremony—often involving costumes, music, marching, or ritual (for example, in parades, royal events, or public celebrations).","zh":"（常指盛大活动中的）华丽的仪式场面；排场；盛典（常伴随服饰、音乐、游行或礼仪）。"},"examples":[{"en":"The wedding had all the pageantry of a royal ceremony.","zh":"这场婚礼有着堪比王室典礼的盛大排场。"},{"en":"People lined the streets to watch the pageantry of the national parade.","zh":"人们站在街道两旁观看国庆游行的盛典场面。"},{"en":"Some critics say politics today is more about pageantry than real change.","zh":"一些批评者说，如今的政治更像是在做表面排场，而不是真正带来改变。"}]},{"partOfSpeech":"n.","definition":{"en":"Beauty or impressiveness that is mostly for show; a grand look that may hide a lack of substance.","zh":"（常含贬义）做给人看的华丽外表；虚饰的壮观。"},"examples":[{"en":"Behind the pageantry, the event was poorly organized.","zh":"华丽排场背后，这次活动组织得很糟糕。"},{"en":"Don’t be fooled by the pageantry—read the details before you agree.","zh":"别被表面的排场迷惑——同意之前先看清细节。"}]}],"synonyms":["ceremony","pomp","spectacle","splendor","display","ritual"],"phonetic":"/ˈpædʒəntri/","extraExplanation":["“pageantry”常与英国王室、阅兵、毕业典礼等语境相关，强调“仪式感 + 视觉上的华丽”。","词源与“page”（中世纪的侍从/扮演角色的人）相关，后来引申为大型庆典中呈现出来的“队列、服饰与仪式”的整体效果。","在写作中，它既可中性地赞美“庄严隆重”，也可用来批评“只重形式、不重内容”（常见搭配：the pageantry of…）。"]}
{"word":"pageants","summary":{"en":"Pageants are (1) judged contests like beauty or talent competitions, or (2) colorful public ceremonies/performances with costumes.","zh":"pageants 可指（1）选美/才艺等评审比赛，也可指（2）盛大、华丽的公共庆典或服装表演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A public contest or event with participants, often featuring a formal presentation (such as beauty, talent, or Q&A), and judged for awards or titles.","zh":"选美/才艺等比赛；（有评审与奖项的）公开竞赛或展示活动。"},"examples":[{"en":"She competed in several beauty pageants in college.","zh":"她大学时参加过好几场选美比赛。"},{"en":"The pageant included a talent show and an interview round.","zh":"这场比赛包括才艺展示和问答环节。"}]},{"partOfSpeech":"n.","definition":{"en":"A large, colorful public show or ceremony, often historical or religious, with costumes and performances.","zh":"盛大的游行/庆典式表演；（常带历史或宗教色彩的）华丽公开演出。"},"examples":[{"en":"The town held a holiday pageant with music and costumes.","zh":"小镇举办了带音乐和服装的节日庆典表演。"},{"en":"In December, many schools put on a Christmas pageant.","zh":"十二月，很多学校会上演圣诞节庆表演。"}]}],"synonyms":["competitions","contests","shows","ceremonies","parades"],"phonetic":"/ˈpædʒənts/","extraExplanation":["“pageant”既可以指“选美/竞赛”（如beauty pageant, Miss Universe），也常指“带服装与表演的庆典演出”（如school pageant）。语境不同，中文翻译会在“比赛/选美”和“庆典表演/游行”之间切换。","常见搭配：enter/compete in a pageant（参加比赛）；win a title（赢得头衔）；judges’ scores（评委评分）；stage/pageant director（舞台/导演）。","词源上与“展示、排场”有关，因此第二义强调“场面盛大、可看性强”。"]}
{"word":"pageboy","summary":{"en":"A pageboy is usually a young male attendant (often in ceremonies like weddings), and it can also mean a uniformed errand worker (BrE) or a rounded bob hairstyle.","zh":"pageboy 通常指（婚礼等仪式中的）小男侍从/小男傧相；也可指（英式）穿制服的跑腿男工，或一种齐耳内扣的波波头发型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young male attendant (especially in the past) who ran errands or served in a household, hotel, or as part of a ceremony (such as a wedding).","zh":"（尤指过去的）男侍从/小男仆；跑腿的男服务员；（婚礼等仪式中的）小男傧相。"},"examples":[{"en":"At the wedding, the pageboy walked in before the bride, carrying the rings.","zh":"在婚礼上，小男傧相在新娘之前入场，手里拿着戒指。"},{"en":"In old novels, a pageboy might deliver letters for a wealthy family.","zh":"在旧小说里，小男侍从可能为富人家递送信件。"}]},{"partOfSpeech":"n.","definition":{"en":"In some stores or hotels (more common in British English), a uniformed boy or young man employed to run errands or guide customers.","zh":"（英式用法较常见）商店或酒店里穿制服的跑腿男工/引导员。"},"examples":[{"en":"The pageboy carried their bags to the room.","zh":"那个跑腿小伙把他们的行李送到房间。"}]},{"partOfSpeech":"n.","definition":{"en":"A hairstyle with straight hair cut in a rounded shape, often with bangs; also called a “pageboy cut.”","zh":"（一种发型）齐耳内扣的“波波头/蘑菇头”（常带刘海）；也叫 pageboy cut。"},"examples":[{"en":"She wore her hair in a classic pageboy cut.","zh":"她留着经典的波波头发型。"},{"en":"The singer’s pageboy hairstyle became a trend in the 1960s.","zh":"这位歌手的波波头发型在20世纪60年代成为潮流。"}]}],"synonyms":["ring bearer","attendant","messenger","bellboy (related)","pageboy cut"],"phonetic":"/ˈpeɪdʒˌbɔɪ/","extraExplanation":["“pageboy”来自“page”（侍童、侍从）+ “boy”（男孩）。在中世纪与近代欧洲，page 常指贵族家中或宫廷里学习礼仪并服侍的少年。","婚礼语境里，pageboy 相当于“ring bearer（捧戒指的小男孩）”或更广义的“小男傧相”，具体职责因地区与家庭习惯而异。","在美式英语里，婚礼含义较常见；“酒店/商店跑腿员”这一义项在英式英语里更常见。"]}
{"word":"pageboys","summary":{"en":"“Pageboys” can mean young male attendants (e.g., at weddings or hotels) or the plural of “pageboy” as a classic bob-like hairstyle.","zh":"“Pageboys”既可指在婚礼、酒店等场合帮忙的男童/年轻随从，也可指“pageboy”这种经典娃娃头（齐刘海、长度齐平）发型的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pageboy: a young male attendant or helper, especially in places like hotels, ceremonies, or formal events.","zh":"pageboy 的复数：男童或年轻男仆/随从，常见于酒店、典礼或正式场合，负责传递信息、引路或协助服务。"},"examples":[{"en":"The pageboys carried the rings down the aisle at the wedding.","zh":"婚礼上，几位小男童（伴童/随从）把戒指沿着过道送到前方。"},{"en":"Two pageboys helped guests with their coats in the lobby.","zh":"大堂里有两名年轻服务员帮客人拿外套。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of pageboy: a short haircut with straight bangs and hair cut to about the same length around the head (often called a “pageboy cut”).","zh":"pageboy 的复数：一种“娃娃头/齐耳短发（齐刘海）”发型，头发长度大致齐平，常配直刘海（pageboy cut）。"},"examples":[{"en":"In the 1960s, pageboys were a popular hairstyle for women.","zh":"在20世纪60年代，pageboy（娃娃头）是女性很流行的发型。"},{"en":"She asked the stylist to show her different pageboys before choosing one.","zh":"她让发型师先展示几种不同的 pageboy（娃娃头）再做决定。"}]}],"synonyms":["attendants","pages","ushers (wedding context)","bellboys (hotel context)","pageboy cuts (hairstyle context)"],"phonetic":"ˈpeɪdʒˌbɔɪz","extraExplanation":["“pageboy”原指在贵族或宫廷中担任随从的少年（page），后来也用于酒店等场所的年轻服务员。用在婚礼里时，常指“伴童/花童团队”中的男孩（有时也说 ring bearer，但 ring bearer 更强调“拿戒指的人”。）","“pageboy cut”这种发型名称和历史形象有关：人们想象中“随从少年”的发型较整齐、长度齐平，因此用 pageboy 来命名。"]}
{"word":"paged","summary":{"en":"“Paged” is the past form of “page,” meaning someone was called or contacted, especially via a pager or a building’s announcement system.","zh":"“paged”是“page”的过去式，常指通过传呼机或广播系统呼叫/联系某人（多用于医院等工作场合）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “page”: to contact someone using a pager (or similar alert system), usually with a short message or signal.","zh":"“page”的过去式和过去分词：用传呼机（或类似呼叫系统）联系某人，通常发送简短信息或提示。"},"examples":[{"en":"The nurse paged the doctor right away.","zh":"护士立刻呼叫了医生。"},{"en":"I was paged during the meeting, so I stepped outside to call back.","zh":"我在开会时被呼叫了，所以我到外面回拨电话。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “page”: to call for someone’s attention over a public-address system (common in hospitals, airports, and large buildings).","zh":"“page”的过去式和过去分词：用广播/扩音系统呼叫某人（常见于医院、机场、大型建筑）。"},"examples":[{"en":"They paged Mr. Lee to the front desk.","zh":"他们广播呼叫李先生到前台。"},{"en":"She was paged to gate 12 for a phone call.","zh":"她被广播到12号登机口接电话。"}]}],"synonyms":["called","summoned","contacted","alerted"],"phonetic":"/peɪdʒd/","extraExplanation":["“paged”在现代口语里常和医院值班、紧急联络有关。虽然传统的“pager/传呼机”在很多场景已被手机取代，但英语里仍常用“page someone”表示“呼叫某人（尤其是紧急或工作场合）”。"]}
{"word":"pagedom","summary":{"en":"Pagedom is a website monitoring and performance-testing service (a brand name).","zh":"Pagedom 是一种网站监控与性能测试服务（品牌名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a website monitoring and performance-testing service that checks whether a website is online and how fast it loads (often used in web development and DevOps).","zh":"（品牌名）一种网站监控与性能测试服务，用来检测网站是否在线、加载速度如何（常见于网站开发与运维/DevOps 场景）。"},"examples":[{"en":"We use Pagedom to monitor uptime and get alerts when the site goes down.","zh":"我们用 Pagedom 监控网站可用性，网站宕机时会收到提醒。"},{"en":"Pagedom reports showed that our homepage was slower in Asia than in the U.S.","zh":"Pagedom 的报告显示，我们的首页在亚洲的加载速度比在美国更慢。"}]}],"synonyms":["uptime monitoring service","website monitoring tool","performance monitoring"],"phonetic":"/ˈpeɪdʒ.dɑm/","extraExplanation":["这是一个专有名词/品牌名，在实际写作中通常首字母大写（Pagedom）。在英文技术语境里，人们也会把它当作“监控工具”的代称来用，但严格来说仍是产品名称。","词形上常被理解为 page（网页）+ dom（常见于域名、系统/领域的后缀），用来暗示“网页监控/网页领域”的含义。"]}
{"word":"pageful","summary":{"en":"“Pageful” means the amount that fills one page, especially a full page of writing or information.","zh":"“Pageful”指“一页的量”，尤指“写满一页的文字或信息”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount of text, writing, or information that fits on one page","zh":"一页的内容量；满满一页的文字/信息"},"examples":[{"en":"She wrote a pageful of notes during the lecture.","zh":"她在课上记了满满一页的笔记。"},{"en":"The report contains a pageful of charts and figures.","zh":"这份报告里有一整页的图表和数据。"}]}],"synonyms":["page","full page","page’s worth","a page of"],"phonetic":"/ˈpeɪdʒfəl/","extraExplanation":["“pageful”由 page（页）+ -ful（充满……的；……的量）组成，表示“装满一页的量”。常用于非正式或一般写作中，强调“信息很多、写得很满”。"]}
{"word":"pagehood","summary":{"en":"“Pagehood” means the period or state of being a page (a young attendant), especially in historical or royal settings.","zh":"“pagehood”指担任侍童/侍从的时期或身份，多见于历史或宫廷语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time in someone’s life when they served as a page (a young attendant, especially in a royal or noble household); the condition or status of being a page","zh":"担任侍童/侍从（尤指王室或贵族家庭中的少年侍者）的时期；做侍童的身份或状态"},"examples":[{"en":"In the memoir, he recalls his pagehood at court and the strict rules he had to follow.","zh":"在回忆录中，他回忆起自己在宫廷做侍童的那段时期，以及必须遵守的严格规矩。"},{"en":"Her pagehood taught her how to speak politely and move quietly in formal settings.","zh":"她的侍童经历教会了她在正式场合如何礼貌说话、安静行动。"}]}],"synonyms":["service as a page","apprenticeship (in a courtly sense)","youthful service"],"phonetic":"/ˈpeɪdʒˌhʊd/","extraExplanation":["“pagehood”很少见，多用于带有历史、文学色彩的语境（如宫廷生活、骑士故事）。日常英语里更常说：the time he was a page / his years as a page。","词尾“-hood”常表示“身份/状态/时期”，如 childhood（童年）、neighborhood（社区）、brotherhood（兄弟情谊/团体）。因此 page + hood = “当侍童的身份或时期”。"]}
{"word":"pageless","summary":{"en":"“Pageless” means “without pages” or “not divided into pages,” especially in digital formats.","zh":"“pageless”指“无页/不分页”，尤其用于数字内容（如可滚动的网页或不显示页码的电子文档）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no pages; not divided into pages (often describing a digital document or a scrollable layout).","zh":"无页的；不分页的（常指电子文档或可滚动的页面布局）。"},"examples":[{"en":"The report is pageless, so you just scroll down to read it.","zh":"这份报告是不分页的，所以你只需要向下滚动阅读。"},{"en":"Some websites use a pageless design that keeps loading more content as you scroll.","zh":"有些网站采用不分页设计，你滚动时会不断加载更多内容。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having a specific page number (because pages are not used or are not shown).","zh":"没有具体页码的（因为不使用或不显示页面）。"},"examples":[{"en":"The e-book version is pageless, so citations use chapters and sections instead of page numbers.","zh":"这个电子书版本没有页码，所以引用时用章节和小节而不是页码。"}]}],"synonyms":["unpaged","unpaginated","scrolling","continuous"],"phonetic":"/ˈpeɪdʒləs/","extraExplanation":["“pageless”常见于科技与出版语境：例如网页的“无限滚动”(infinite scroll)、在线报告、某些电子书阅读器模式。由于不分页，引用资料时往往改用章节、段落或定位码（如location）来标注。"]}
{"word":"pagelike","summary":{"en":"“Pagelike” means resembling a page—flat, rectangular, or arranged like a page layout.","zh":"“pagelike”表示“像页面的”——外观扁平矩形，或排版布局像纸页/网页。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a page in shape, layout, or flat, rectangular appearance (often describing a screen, surface, or document design).","zh":"像“页面/纸页”的；在形状、排版或扁平矩形外观上类似页面的（常用于描述屏幕、表面或文档设计）。"},"examples":[{"en":"The app uses a pagelike layout with clear margins and headings.","zh":"这个应用采用类似页面的排版，有清晰的页边距和标题。"},{"en":"On the tablet, the article appears as a pagelike sheet you can swipe through.","zh":"在平板上，这篇文章看起来像一张可滑动浏览的页面。"},{"en":"They designed a pagelike panel for the museum display.","zh":"他们为博物馆展览设计了一个页面式的展示面板。"}]}],"synonyms":["page-like","flat","sheetlike","rectangular","document-style"],"phonetic":"/ˈpeɪdʒˌlaɪk/","extraExplanation":["“pagelike”更常见的写法是带连字符的“page-like”。在正式写作中，第一次出现时用“page-like”会更清晰；在产品/界面语境里也常用“page-like layout”“page-like view”。"]}
{"word":"pager","summary":{"en":"A pager is usually a small device that receives short alerts or messages; less commonly, it can mean a person who pages others in a building.","zh":"pager通常指接收简短提醒或信息的传呼机；较少情况下也可指在建筑内负责广播找人的呼叫员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small electronic device that receives short messages or alerts (often makes a beep or vibration)","zh":"传呼机；呼机（接收简短信息或提醒的小型电子设备，常以蜂鸣或震动提示）"},"examples":[{"en":"Doctors in the hospital still use pagers for urgent messages.","zh":"医院里的医生仍然用传呼机接收紧急信息。"},{"en":"My pager went off during the meeting, so I stepped outside to call back.","zh":"开会时我的传呼机响了，所以我到外面回电话。"}]},{"partOfSpeech":"n.","definition":{"en":"someone whose job is to page (announce or call) people, especially in a hotel or large building","zh":"（在酒店或大型建筑里）呼叫员；传唤人员（负责广播或通知找人）"},"examples":[{"en":"The pager announced that the guest’s car was ready.","zh":"呼叫员通知客人的车已经准备好了。"}]}],"synonyms":["beeper"],"phonetic":"/ˈpeɪdʒɚ/","extraExplanation":["“pager”最常指传呼机。它在20世纪80—90年代非常流行，常用于医疗、安保等需要“随时待命”的行业；后来随着手机普及而减少，但在一些医院仍常见，因为覆盖稳定、耗电低、在某些环境里更可靠。","别和动词“page（呼叫/传唤）”混淆：page 是“呼叫某人”，pager 是“传呼机”或“负责呼叫的人”。"]}
{"word":"pagers","summary":{"en":"“Pagers” are small devices that receive short messages or alerts (plural of “pager”).","zh":"“pagers”是“pager（传呼机）”的复数，指接收简短信息或提醒的小型设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “pager”) a small wireless device that receives short messages or alerts; common in hospitals and some workplaces.","zh":"（pager 的复数）传呼机：一种小型无线设备，用来接收简短信息或提醒；常见于医院等工作场所。"},"examples":[{"en":"Many doctors still carry pagers in case the phone signal is weak.","zh":"很多医生仍然随身带传呼机，以防手机信号不好。"},{"en":"The nurse checked the pagers when the emergency alert went off.","zh":"紧急警报响起时，护士查看了传呼机。"},{"en":"In the 1990s, pagers were a popular way to stay in touch.","zh":"在20世纪90年代，传呼机是一种很流行的联络方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) people or systems that page someone (for example, in a building or over an intercom).","zh":"（不太常见）负责呼叫/广播找人的人或系统（例如在大楼里或通过广播系统呼叫）。"},"examples":[{"en":"The pagers announced that the meeting had moved to Room 204.","zh":"广播呼叫系统通知会议改到204室。"},{"en":"At the airport, pagers called passengers by name.","zh":"在机场，广播会按名字呼叫乘客。"}]}],"synonyms":["beepers","paging devices","pagers (medical context)"],"phonetic":"/ˈpeɪdʒɚz/","extraExplanation":["“pager（传呼机）”在英语里也常叫“beeper”。它在手机普及前非常常见，尤其在医疗行业至今仍有人使用，因为设备简单、待机久、覆盖稳定。","注意：动词“page”表示“用传呼机呼叫/（通过广播）呼叫某人”，例如：They paged the doctor.（他们呼叫医生。）"]}
{"word":"pages","summary":{"en":"“Pages” usually means multiple pages in a book/document, or webpages; it can also be the verb form meaning “calls (someone) via a paging system.”","zh":"“pages”通常指书/文件的很多页或网页；也可作动词，表示“用传呼/广播系统呼叫某人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “page”: sheets of paper in a book, magazine, or document (or the numbered sides of those sheets).","zh":"“page”的复数：书、本、杂志或文件中的一页页纸（或其带页码的页面）。"},"examples":[{"en":"This book has 300 pages.","zh":"这本书有300页。"},{"en":"Please read pages 10–15 for homework.","zh":"作业请读第10到15页。"}]},{"partOfSpeech":"n.","definition":{"en":"webpages (screens of information) on a website.","zh":"网页（网站上的一个页面/信息界面）。"},"examples":[{"en":"The site has a few pages about customer support.","zh":"这个网站有几页关于客服支持的内容。"},{"en":"Some pages take longer to load on slow internet.","zh":"网速慢时，有些网页加载更久。"}]},{"partOfSpeech":"v.","definition":{"en":"calls someone (often by intercom or a paging system); third-person singular form of “page.”","zh":"（用传呼/广播系统）呼叫某人；动词“page”的第三人称单数形式。"},"examples":[{"en":"The nurse pages the doctor right away.","zh":"护士马上呼叫医生。"},{"en":"If you need help, the front desk pages security.","zh":"如果你需要帮助，前台会呼叫安保。"}]}],"synonyms":["leaves (book pages)","sheets","web pages","screens","call (page someone)","summon"],"phonetic":"ˈpeɪdʒɪz","extraExplanation":["“pages”最常见是名词复数（很多页）。也可能是动词“page”的第三人称单数（他/她/它呼叫某人）。","在口语里谈“网页”时常直接说“pages”或“web pages”。"]}
{"word":"pageship","summary":{"en":"Pageship means the office or period of serving as a page (a young attendant), especially at a royal or noble court.","zh":"Pageship 指担任侍童/小侍从的职位或任职时期，常用于王室或贵族宫廷的历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, duties, or time period of serving as a page (especially in a royal or noble household); the office of a page","zh":"（尤指王室或贵族家中）担任侍童/小侍从（page）的职位、职责或任职时期；侍童之职"},"examples":[{"en":"He began his pageship at court when he was fourteen.","zh":"他十四岁时开始在宫廷担任侍童。"},{"en":"During his pageship, he learned formal manners and how to serve at ceremonies.","zh":"在担任侍童期间，他学习了礼仪以及如何在典礼上侍奉。"}]}],"synonyms":["service as a page","pagehood","attendancy (context-dependent)"],"phonetic":"/ˈpeɪdʒʃɪp/","extraExplanation":["“pageship”较为少见、偏历史语境，多见于描写中世纪或近代早期宫廷生活的作品。现代英语里更常直接说“to serve as a page / his time as a page”。","后缀“-ship”常表示“身份/职位/状态/任期”（如 friendship 友谊、leadership 领导地位、apprenticeship 学徒期），所以 pageship 就是“page 的身份或任期”。","这里的 page 指“侍童/小侍从”，不是“书页/网页”。读历史或文学时可通过上下文判断。"]}
{"word":"pagesize","summary":{"en":"“Pagesize/page size” usually means either the paper/page format (A4, Letter) or how many items appear per page in a paginated list.","zh":"“pagesize/page size”通常指两类：纸张/页面规格（A4、Letter）或分页列表中每页显示的条目数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The number of items shown on one page (especially in a document, report, print layout, or a paginated list on a website/app).","zh":"（尤指文档、报表、打印版式或网页/应用的分页列表中）每一页显示的项目数量。"},"examples":[{"en":"Set the page size to A4 before you print the document.","zh":"打印文档前，把页面大小设置为 A4。"},{"en":"Increase the page size to 50 so you don’t have to click “Next” so often.","zh":"把每页条数调到 50，这样就不用老点“下一页”了。"}]},{"partOfSpeech":"n.","definition":{"en":"The physical size/format of a page in a document (for example, A4, Letter, Legal).","zh":"页面的物理尺寸/纸张规格（例如 A4、Letter、Legal）。"},"examples":[{"en":"This form must be printed on Letter page size.","zh":"这份表格必须用 Letter 纸张规格打印。"},{"en":"The PDF is set to the wrong page size, so the margins look strange.","zh":"这个 PDF 的页面大小设错了，所以页边距看起来很奇怪。"}]}],"synonyms":["page size","paper size","items per page","page length","results per page"],"phonetic":"/ˈpeɪdʒ saɪz/","extraExplanation":["“page size / pagesize”在不同场景下有两种常见含义：\n1）打印/排版：更偏“纸张规格”（A4、Letter）。\n2）网页/数据库/API：更偏“每页条数”（如每页 10/20/50 条）。\n写作时更常见的拼写是“page size”（分开写），而“pagesize”常见于变量名、参数名或设置项。"]}
{"word":"paggle","summary":{"en":"Paggle means to potter around or work in a slow, casual way (mainly British/Scottish dialect).","zh":"paggle 指（主要为英式/苏格兰方言）慢慢磨蹭地忙活、东一下西一下地做事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(chiefly British/Scottish dialect) to work or move in a slow, casual, or slightly aimless way; to potter around.","zh":"（主要为英式/苏格兰方言）慢慢地、随意地做事或走动；磨蹭着干活；闲逛式地忙活。"},"examples":[{"en":"He spent the morning paggling about the garden, pulling a few weeds here and there.","zh":"他一上午都在花园里慢慢磨蹭着忙活，这里拔几根杂草，那里弄一下。"},{"en":"Stop paggling and finish your homework before dinner.","zh":"别再磨蹭了，晚饭前把作业做完。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to handle or poke at something repeatedly in a fiddly way; to fuss with something.","zh":"（较少见）反复摆弄/捣鼓某物；对某事过分琐碎地折腾。"},"examples":[{"en":"Don’t paggle with the settings unless you know what they do.","zh":"除非你清楚这些设置的作用，否则别乱折腾。"},{"en":"She kept paggling at the zipper until it finally worked.","zh":"她一直反复摆弄拉链，最后终于拉好了。"}]}],"synonyms":["potter (around)","dawdle","mess about","fiddle (with)","poke at"],"phonetic":"/ˈpæɡəl/","extraExplanation":["“paggle”不是常见的标准英语词，更常见于英国（尤其苏格兰）口语/方言里，语气通常带一点“磨蹭、慢吞吞、东一下西一下”的感觉。","如果想用更通用的英语表达，可以用：potter around（悠闲地做点零碎事）、mess about（瞎忙/乱弄）、dawdle（磨蹭）、fiddle with（摆弄）。"]}
{"word":"pagina","summary":{"en":"“Pagina” is a formal/technical word meaning a “page,” and it can also mean a thin plate-like layer in anatomy/biology.","zh":"“pagina”是较正式/技术性的词，意思是“（书或文件的）一页”；在解剖学/生物学中也可指薄片状的层或表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a page of a book, document, or manuscript (a formal or technical word; plural: paginae)","zh":"（书、文件或手稿的）一页（较正式/技术性用词；复数：paginae）"},"examples":[{"en":"The illustration appears on the second pagina of the manuscript.","zh":"这幅插图出现在手稿的第二页上。"},{"en":"In the notes, each pagina is numbered in pencil.","zh":"在注释里，每一页都用铅笔编号。"}]},{"partOfSpeech":"n.","definition":{"en":"a thin plate-like layer or surface in anatomy or biology (also plural: paginae)","zh":"（解剖学/生物学）薄片状的层或表面（复数：paginae）"},"examples":[{"en":"The textbook describes the bone’s outer pagina.","zh":"教材描述了骨的外层薄片。"},{"en":"Several paginae form the structure seen under the microscope.","zh":"在显微镜下可见的结构由多层薄片构成。"}]}],"synonyms":["page","leaf (of a book)","folio (formal)","sheet"],"phonetic":"/pəˈdʒaɪnə/","extraExplanation":["“pagina”源自拉丁语，原意与“书写的纸张/卷页”有关，所以在英语里常见于学术写作、古籍研究或解剖学等专业语境。日常英语通常直接用“page”。","复数常写作“paginae”（拉丁式复数），在学术文章中较常见；一般读者写作中也有人用英语规则复数“paginas”，但不如“paginae”正式。"]}
{"word":"paginae","summary":{"en":"*Paginae* means “pages” (Latin plural of *pagina*), used mainly in scholarly contexts.","zh":"*Paginae* 指“页面/页”（拉丁语 *pagina* 的复数），主要用于学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in scholarly writing) plural of *pagina*, meaning “pages,” especially when referring to pages in a manuscript, book, or document.","zh":"（拉丁语；学术写作中使用）*pagina* 的复数，意为“页、页面”，常指手稿、书籍或文件的页码/页面。"},"examples":[{"en":"The editor compared the damaged paginae to reconstruct the original text.","zh":"编辑对比了受损的页面（paginae），以还原原始文本。"},{"en":"Notes in the margin appear on several paginae of the manuscript.","zh":"手稿的好几页（paginae）边缘都有批注。"}]}],"synonyms":["pages","pp. (in citations)"],"phonetic":"/pəˈdʒaɪniː/","extraExplanation":["“paginae”主要是拉丁语形式，在英语里多见于古典学、文献学、手稿研究等语境，用来显得更“原典/学术”。日常英语通常直接说 *pages*。","词源上，拉丁语 *pagina* 原意与“书页、纸张”有关；英语中的 *page* 也与其同源。","在学术引用中更常见的是缩写 **p.**（单页）与 **pp.**（多页）；“paginae”本身在普通参考文献格式里不算常用。"]}
{"word":"paginal","summary":{"en":"“Paginal” means “related to a page,” often used in formal or publishing contexts.","zh":"“paginal”意为“与书页/页码有关的”，多用于出版或较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a page of a book or document.","zh":"与书页或文档页有关的；页的。"},"examples":[{"en":"The editor checked the paginal numbers to make sure the chapters were in the right order.","zh":"编辑检查了页码，确保各章顺序正确。"},{"en":"There is a paginal reference at the bottom of the article.","zh":"文章底部有一个页码引用。"}]}],"synonyms":["page-related","of the page","pagination-related"],"phonetic":"/ˈpædʒənəl/","extraExplanation":["“Paginal”较少用于日常口语，更常见于出版、排版、学术写作或图书馆学等语境。更常用的表达包括：page, page number, pagination, on page X 等。","词源上与拉丁语 pagina（书页、纸页）有关，因此常用于强调“与页有关”的正式/技术性描述。"]}
{"word":"paginary","summary":{"en":"“Paginary” means “having to do with pages or pagination.”","zh":"“paginary”指“与书页或分页（页码编排）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to pages, pagination, or the arrangement/numbering of pages in a book or document","zh":"与书页有关的；与分页、页码编排有关的"},"examples":[{"en":"The editor fixed several paginary errors before the book went to print.","zh":"编辑在付印前修正了几处分页（页码编排）错误。"},{"en":"We need to check the paginary layout so the chapter headings don’t land at the bottom of a page.","zh":"我们需要检查分页版式，避免章节标题落在页末。"}]}],"synonyms":["pagination-related","page-related","paginational","typographic"],"phonetic":"/ˈpædʒəˌnɛri/","extraExplanation":["“paginary”是一个比较少见、偏书面/出版行业用语的形容词，常见于讨论书籍排版、分页（pagination）、页码顺序等情境。","词根来自拉丁语“pagina”（书页）。在日常英语里，人们更常用“pagination / page numbering / page layout”等表达来替代。"]}
{"word":"paginate","summary":{"en":"Paginate means to divide content into pages or to move through content page by page.","zh":"Paginate 指把内容分页，或按页浏览/翻页浏览内容。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a book, document, or website) to divide content into separate pages, or to show content one page at a time.","zh":"（书籍、文档或网站）把内容分成页；以分页方式显示内容（一次显示一页）。"},"examples":[{"en":"The editor paginated the manuscript before sending it to the printer.","zh":"编辑在把稿件送去印刷前给它做了分页。"},{"en":"This report is paginated, so you can jump to page 10 quickly.","zh":"这份报告已经分页，所以你可以快速跳到第10页。"},{"en":"Our app paginates long lists to improve loading speed.","zh":"我们的应用会把长列表分页，以提升加载速度。"}]},{"partOfSpeech":"vi.","definition":{"en":"(computing) to move through a long document or list page by page, often by clicking “Next” or scrolling in sections.","zh":"（计算机）按页浏览/翻页浏览长文档或列表，通常通过点击“下一页”或分段滚动。"},"examples":[{"en":"I paginated through the search results until I found the right article.","zh":"我一页页翻看搜索结果，直到找到正确的文章。"},{"en":"You can paginate forward or backward using the arrows.","zh":"你可以用箭头向前或向后翻页。"}]}],"synonyms":["divide into pages","number the pages (publishing)","page through","flip through"],"phonetic":"/ˈpædʒəˌneɪt/","extraExplanation":["在出版领域，paginate 常指“给书稿编号并排成页”，与 page numbering（页码编号）和 layout/typesetting（排版）有关。","在网页/软件开发里，pagination（分页）是常见设计：把大量数据分成多页，常见于电商商品列表、搜索结果、评论区等。相关词：pagination, paginated, page size。","词源上来自 page（页），-ate 常见于动词后缀，表示“使……成为/使……具有某种状态”。"]}
{"word":"paginated","summary":{"en":"“Paginated” means content is divided into pages (often with page numbers or page links).","zh":"“paginated”表示内容被分成一页一页的（常带页码或分页链接）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"divided into pages (especially in a book, document, or on a website/app), often with page numbers or page links.","zh":"被分成一页一页的（尤指书籍、文件或网站/应用的内容），通常带有页码或分页链接。"},"examples":[{"en":"The report is paginated, so you can jump to page 10 easily.","zh":"这份报告做了分页，所以你可以很容易跳到第10页。"},{"en":"On the website, search results are paginated into 20 items per page.","zh":"在这个网站上，搜索结果按每页20条进行分页。"}]},{"partOfSpeech":"v.","definition":{"en":"(past participle of “paginate”) to divide a document or digital content into pages, often adding page numbers.","zh":"（“paginate”的过去分词）把文件或数字内容分成页面，常常会加上页码。"},"examples":[{"en":"The book was paginated by the publisher before printing.","zh":"这本书在印刷前由出版社进行了分页（编页码）。"},{"en":"The PDF has been paginated automatically by the software.","zh":"这个PDF已被软件自动分页。"}]}],"synonyms":["paged","divided into pages","numbered (pages)"],"phonetic":"/ˈpædʒəˌneɪtɪd/","extraExplanation":["在网页与产品语境里，paginated 常对应“分页加载/分页展示”，与 infinite scroll（无限滚动）相对：前者分成第1页、第2页；后者不断往下滑自动加载。","在印刷与排版语境中，paginated 更偏“编页码/确定版面页序”的意思（也常见于学术论文、书籍排版）。"]}
{"word":"paginates","summary":{"en":"“Paginates” means (someone/something) divides content into pages or adds page numbers.","zh":"“paginates”表示把内容分页排版，或给文件/书籍编页码。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to divide a document, book, or digital content into separate pages and arrange them in page order","zh":"把文件、书籍或数字内容分成一页页并按页序排版"},"examples":[{"en":"The designer paginates the report so each section starts on a new page.","zh":"设计师为报告分页排版，让每个部分都从新的一页开始。"},{"en":"This app paginates long articles to make them easier to read on a phone.","zh":"这个应用会把长文章分页，方便在手机上阅读。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add page numbers to a book or document","zh":"给书或文件编页码（加页码）"},"examples":[{"en":"She paginates the manuscript before sending it to the editor.","zh":"她在把手稿寄给编辑前先给它编页码。"},{"en":"The print shop paginates the booklet from page 1 to page 32.","zh":"印刷店把小册子从第1页编到第32页。"}]}],"synonyms":["divides into pages","numbers the pages","formats","lays out"],"phonetic":"/ˈpædʒəˌneɪts/","extraExplanation":["“paginate”常见于出版与排版（layout/design）领域，也常用于网页/软件中表示“分页显示”。在网页语境里，pagination（分页）常指“下一页/上一页”或按页加载数据。"]}
{"word":"paginating","summary":{"en":"“Paginating” means dividing content into pages or adding page numbers.","zh":"“paginating”指对内容进行分页，或给页面编页码。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"dividing a document, book, or screen content into separate pages (often for easier reading or printing).","zh":"把文件、书籍或屏幕内容分成一页一页（通常为了更易阅读或打印）。"},"examples":[{"en":"The designer is paginating the report so each chapter starts on a new page.","zh":"设计师正在给报告分页，让每一章都从新的一页开始。"},{"en":"The app is paginating the article to make it load faster on phones.","zh":"这个应用正在把文章分页，以便在手机上加载更快。"}]},{"partOfSpeech":"v.","definition":{"en":"numbering the pages of a document.","zh":"给文件的页码编号。"},"examples":[{"en":"She’s paginating the thesis before submitting it.","zh":"她在提交论文前正在给论文编页码。"},{"en":"Make sure you’re paginating from the first page of the introduction.","zh":"确保你从引言的第一页开始编页码。"}]}],"synonyms":["paging","dividing into pages","adding page numbers","numbering pages"],"phonetic":"/ˈpædʒəˌneɪtɪŋ/","extraExplanation":["“Paginating”是动词“paginate”的现在分词/动名词形式，常见于出版排版与软件开发语境。","在网页与应用里，pagination（分页）通常指把长列表分成多页或“下一页/上一屏”加载（有时也包含“无限滚动”的对比概念）。"]}
{"word":"pagination","summary":{"en":"Pagination means splitting content into pages (common in websites/apps) or adding/arranging page numbers in documents.","zh":"Pagination 指把内容分页展示（常见于网站/应用），也可指文件中的页码编排或标注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of dividing content into separate pages, especially on websites or in apps, so users can browse a long list or article bit by bit.","zh":"（尤指网站/应用中）把内容分成多页展示的过程，使用户能分批浏览长列表或文章。"},"examples":[{"en":"This website uses pagination to show 20 products per page.","zh":"这个网站使用分页，每页显示20个商品。"},{"en":"Good pagination helps users find information faster.","zh":"良好的分页能帮助用户更快找到信息。"}]},{"partOfSpeech":"n.","definition":{"en":"The numbering of pages in a book, document, or report.","zh":"（书籍、文件、报告等的）页码编排；页码标注。"},"examples":[{"en":"Check the pagination before you print the final version.","zh":"在打印最终版本之前检查一下页码编排。"},{"en":"The pagination is wrong—page 10 comes after page 12.","zh":"页码顺序不对——第10页出现在第12页之后。"}]}],"synonyms":["paging","page numbering","page division"],"phonetic":"/ˌpædʒəˈneɪʃən/","extraExplanation":["在网页/产品设计中，pagination 常与 “infinite scroll（无限滚动）” 对比：分页更利于定位与返回（例如第5页），无限滚动更适合连续浏览（例如短视频流）。","词源上来自 page（页面）+ -ation（名词后缀，表示“过程/行为”）。"]}
{"word":"pagine","summary":{"en":"Pagine is Italian for “pages,” often seen in Italian books or citations.","zh":"pagine 是意大利语“页（pages）”的意思，常见于意大利语书籍或引用信息中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Italian, plural noun) “pages”; the plural of pagina, often seen in Italian books, indexes, or citations.","zh":"（意大利语，名词复数）“页、页面”；为 pagina 的复数形式，常见于意大利语书籍的目录、索引或引用信息中。"},"examples":[{"en":"In the table of contents, it says “pagine 12–15.”","zh":"在目录里写着“pagine 12–15（第12到15页）”。"},{"en":"The exhibition catalog lists the artwork on several pagine at the end.","zh":"展览图录在末尾用几页（pagine）列出了作品信息。"}]}],"synonyms":["pages","pp. (in citations)"],"phonetic":"/pɑˈdʒiːneɪ/","extraExplanation":["“Pagine”本身不是常用英语词汇，而是意大利语里“页”的复数。你通常会在意大利出版物或学术引用（例如目录、索引、注释）里遇到。","如果你想查英语里的相近词：page（单数）/ pages（复数）；如果你本来想输入的是英语 paging（呼叫/传呼；或计算机的“分页/换页”），告诉我语境我可以一起解释。"]}
{"word":"paging","summary":{"en":"Paging usually means calling someone over a system (e.g., “Paging Dr. Lee”). Less commonly, it can mean turning through pages.","zh":"Paging 通常指通过系统呼叫某人（如“呼叫李医生”）；较少见时也可指翻阅书页。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of calling someone (often by name) over a public-address system, phone system, or pager","zh":"（通过广播系统、电话系统或传呼机）呼叫某人（通常点名）的行为"},"examples":[{"en":"Paging Dr. Lee to the emergency room.","zh":"呼叫李医生到急诊室。"},{"en":"The nurse tried paging the surgeon, but there was no reply.","zh":"护士试着呼叫外科医生，但没有回应。"},{"en":"We heard the paging announcement at the airport.","zh":"我们在机场听到了广播呼叫通知。"}]},{"partOfSpeech":"n.","definition":{"en":"the action of turning or moving through pages (less common in modern use)","zh":"翻页、翻动书页的动作（现代较少用）"},"examples":[{"en":"After hours of paging through old records, she found the document.","zh":"翻了几个小时的旧档案后，她找到了那份文件。"},{"en":"The sound of paging filled the quiet library.","zh":"安静的图书馆里都是翻页的声音。"}]},{"partOfSpeech":"phrase","definition":{"en":"used to announce that you are trying to reach someone: “Paging …”","zh":"用于表示正在找某人、呼叫某人：“Paging … / 呼叫……”"},"examples":[{"en":"Paging Mr. Johnson—your car is blocking the entrance.","zh":"呼叫约翰逊先生——您的车挡住入口了。"},{"en":"Paging all staff: the meeting starts in five minutes.","zh":"呼叫全体员工：会议五分钟后开始。"}]}],"synonyms":["calling","summoning","announcing","broadcasting","page (someone)"],"phonetic":"/ˈpeɪdʒɪŋ/","extraExplanation":["在美国影视和日常场景里，“Paging Dr. Smith”是非常典型的医院广播用语，表示通过内部广播系统寻找某位医生。现在也常用“page”当动词：page someone / page the doctor（呼叫某人）。","在计算机领域里，paging 还有“（内存）分页/调页”的意思，指系统在内存与硬盘之间移动数据以管理内存；这是技术用法，和“广播找人”不是同一个场景。"]}
{"word":"pagings","summary":{"en":"“Pagings” means multiple paging alerts/messages, often in hospitals or workplaces.","zh":"“Pagings”指多次/多条寻呼提醒或信息，常见于医院或职场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"messages or alerts sent through a paging system (for example, to a pager or over a hospital/office intercom); the plural form of “paging.”","zh":"通过寻呼系统发送的消息或提醒（例如发到传呼机，或在医院/办公室用广播呼叫）；是“paging”的复数形式。"},"examples":[{"en":"The nurse said the doctor missed three pagings during the night shift.","zh":"护士说医生在夜班时漏接了三次寻呼。"},{"en":"Too many pagings can interrupt deep work, so the team set quiet hours.","zh":"太多寻呼会打断深度工作，所以团队设置了静默时段。"}]}],"synonyms":["pages","alerts","notifications","calls"],"phonetic":"/ˈpeɪdʒɪŋz/","extraExplanation":["“pagings”常见于医院、客服中心或安保等需要快速呼叫的场景，强调“多次/多条寻呼”。日常口语里更常说“pages”（如：I got three pages），但在制度或记录用语中也会看到“pagings”。","相关词：page（呼叫/寻呼，动词）；pager（传呼机）；overhead page（广播呼叫）；on-call paging（值班寻呼）。"]}
{"word":"pagiopod","summary":{"en":"A very rare scientific term meaning “fixed-footed,” describing an organism whose feet/appendages are attached or not freely movable.","zh":"非常罕见的科技术语，意为“足部固定的”，指足/附肢附着、不能自由活动的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, scientific) A “fixed-footed” organism; an animal described as having feet/appendages that are attached or not freely movable (used in older zoological descriptions).","zh":"（罕见，科技术语）“足部固定的”生物；指在较早的动物学描述中，被认为足/附肢附着、不能自由活动的动物。"},"examples":[{"en":"Some older zoology texts contrast free-moving forms with more sessile, “pagiopod” forms.","zh":"一些较早的动物学著作会把能自由移动的类型与更固着的“pagiopod（足部固定）”类型作对比。"},{"en":"The author uses “pagiopod” to emphasize that the animal’s appendages are not adapted for walking.","zh":"作者用“pagiopod”来强调这种动物的附肢并不适合行走。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, scientific) Fixed-footed; having feet/appendages that are attached or relatively immobile.","zh":"（罕见，科技术语）足部固定的；足/附肢附着或相对不灵活的。"},"examples":[{"en":"A “pagiopod” condition is sometimes mentioned in historical classification notes.","zh":"“pagiopod”的状态有时会出现在历史分类的注释里。"},{"en":"In this passage, “pagiopod” functions like an adjective meaning “sessile or fixed.”","zh":"在这段文字里，“pagiopod”起到形容词作用，意思接近“固着的/固定的”。"}]}],"synonyms":["sessile","fixed","immobile","non-motile"],"phonetic":"/ˈpædʒi.oʊˌpɑd/","extraExplanation":["这个词非常少见，很多现代词典与教材里找不到；更常用、也更容易让读者理解的表达通常是 sessile（固着的）、fixed（固定的）或 immobile（不动的）。","词源上可拆为 pagi-（来自希腊语，含“固定/坚固”之意）+ -pod（“足”，见于 octopod、arthropod 等）。如果你是在某篇论文/老书里看到它，给我上下文句子，我可以帮你更准确地判断作者想表达的具体生物学含义。"]}
{"word":"pagiopoda","summary":{"en":"“Pagiopoda” is most likely a biological genus name rather than a regular English vocabulary word.","zh":"“Pagiopoda”更可能是生物分类学中的属名，而不是常规英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientific taxonomic name (a genus name) used in biology; it is not a common English word in general dictionaries, and its exact reference depends on the field/source where you saw it.","zh":"生物学中的分类学名称（属名）。它不是常见英语词汇，通常不收录于一般词典；具体指代的生物类群需要结合你看到它的出处来确定。"},"examples":[{"en":"I couldn’t find “Pagiopoda” in a standard English dictionary, so it’s likely a Latin-based genus name from a biology text.","zh":"我在常见英语词典里找不到“Pagiopoda”，所以它很可能是生物学资料里的拉丁化属名。"},{"en":"If you share the sentence or the webpage where you saw Pagiopoda, I can help identify what organism it refers to.","zh":"如果你把看到 Pagiopoda 的句子或网页发来，我可以帮你判断它具体指哪类生物。"}]}],"phonetic":"/ˌpædʒiˈoʊpədə/","extraExplanation":["很多分类学名称（属名/种名）来自拉丁语或希腊语的词根，常见于论文、物种名录、化石或海洋生物资料中；单独看一个属名往往无法确定它属于哪一类动物/植物，最好结合上下文（例如是否在讲软体动物、节肢动物、腕足动物、化石等）。"]}
{"word":"pagne","summary":{"en":"A pagne is a wrap cloth worn like a skirt or dress, especially in West/Central Africa.","zh":"pagne 指一种裹布式的衣料/服饰，尤常见于西非与中非。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rectangular piece of cloth worn as a wrap (around the waist, hips, or chest), especially in West and Central Africa; it can function like a skirt, dress, or baby-carrying cloth.","zh":"（尤指西非和中非常见的）一块长方形布，用来缠裹在腰部、胯部或胸前；可当作裙子/连衣裙式裹布，也常用于背婴儿等。"},"examples":[{"en":"She tied a pagne around her waist before going to the market.","zh":"她去市场前把一块 pagne 缠在腰间。"},{"en":"In many families, a bright pagne is used to carry a baby on the back.","zh":"在很多家庭里，颜色鲜艳的 pagne 常用来把宝宝背在背上。"},{"en":"The designer used pagne fabric to make a modern jacket.","zh":"设计师用 pagne 布料做了一件现代夹克。"}]}],"synonyms":["wrap","wrap skirt","waist cloth","kanga","sarong"],"phonetic":"/pɑːnj/","extraExplanation":["“pagne”常见于英语对非洲服饰的介绍中，是从法语借入的词（法语里也指裹布/腰布）。在不同国家和地区，功能相近的布也可能叫不同名字：如东非常见的“kanga / kitenge”，南亚与东南亚常见的“sarong”。在写作中用“pagne”会带有较强的地域与文化指向（多与西非/中非法语区相关）。"]}
{"word":"pagnes","summary":{"en":"Pagnes are wraparound cloths worn around the waist/hips, especially in West and Central Africa.","zh":"pagnes 指（尤指西非、中非的）裹在腰或臀部穿的围布/裹腰布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rectangular piece of cloth worn wrapped around the waist or hips, especially in West and Central Africa (similar to a wrap skirt or loincloth)","zh":"（尤指西非、中非常见的）裹腰布/围裙式布料；把一块布围在腰或臀部当作衣物穿（类似裹裙或兜裆布）"},"examples":[{"en":"In the market, many women wore bright pagnes with matching headwraps.","zh":"在集市上，许多女性穿着色彩鲜艳的裹腰布，还搭配同色头巾。"},{"en":"He bought two pagnes as gifts during his trip to Senegal.","zh":"他在塞内加尔旅行时买了两块裹腰布当礼物。"}]}],"synonyms":["wrap skirt","wrap cloth","loincloth","sarong"],"phonetic":"/pæn/","extraExplanation":["“pagnes”是法语借词“pagne”的复数形式，在英语里也会直接用“pagne / pagnes”来指西非与中非常见的传统裹布。不同地区用法与图案寓意各异，有的印花还会传达身份、场合或祝福。","在英语语境中，它通常出现在旅行写作、人类学/文化研究、时尚报道里；更通用的近义表达可以用“wrap skirt”“wrap cloth”“loincloth”（更偏男性/传统）或类比“sarong”（东南亚更常见）。"]}
{"word":"pagod","summary":{"en":"“Pagod” is likely a misspelling of “pagoda,” meaning a multi-tiered Asian temple tower.","zh":"“pagod”很可能是“pagoda”的拼写错误，指亚洲寺庙中的多层宝塔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely spelling: pagoda) A tower-like building with several roofs that curve upward at the edges, common in East and Southeast Asian Buddhist or Hindu temples.","zh":"（多半是拼写：pagoda）宝塔；多层塔状建筑，屋檐翘角，常见于东南亚与东亚的佛教或印度教寺庙建筑。"},"examples":[{"en":"We visited a beautiful pagoda near the lake.","zh":"我们参观了湖边一座漂亮的宝塔。"},{"en":"The pagoda’s curved roofs are a classic feature of traditional temple architecture.","zh":"宝塔的翘檐屋顶是传统寺庙建筑的典型特征。"}]}],"synonyms":["temple tower","tower","shrine"],"phonetic":"/pəˈɡoʊdə/","extraExplanation":["“pagod”不是常见英文单词，最可能是把“pagoda（宝塔）”少写了一个字母a。","“pagoda”在英语里通常指亚洲寺庙中的塔形建筑；在旅游介绍、建筑与历史语境中很常见。"]}
{"word":"pagoda","summary":{"en":"A pagoda is a multi-tiered tower seen in Asian (often Buddhist) architecture, or a building made in that style.","zh":"pagoda 指亚洲（多与佛教相关）的多层宝塔，也可指仿宝塔风格的建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall, tiered tower with multiple roofs, common in East and Southeast Asian Buddhist architecture.","zh":"宝塔；（常见于东亚与东南亚佛教建筑的）多层塔楼"},"examples":[{"en":"We visited an ancient pagoda at the temple.","zh":"我们在寺庙里参观了一座古老的宝塔。"},{"en":"The skyline was marked by a red-and-gold pagoda.","zh":"天际线被一座红金相间的宝塔勾勒出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A building or structure designed in the style of a pagoda, sometimes used for decoration in gardens or parks.","zh":"宝塔式建筑；（花园或公园中）仿宝塔风格的装饰性建筑"},"examples":[{"en":"A small pagoda stood by the lake in the park.","zh":"公园的湖边立着一座小小的宝塔式建筑。"},{"en":"They built a pagoda-style pavilion as a garden centerpiece.","zh":"他们建了一座宝塔式亭子作为花园的中心景观。"}]}],"synonyms":["tower","temple tower","shrine (context-dependent)"],"phonetic":"/pəˈɡoʊdə/","extraExplanation":["“pagoda”在英语里通常指与佛教相关的塔式建筑。不同地区的宝塔外观差异很大：比如中国的砖塔、日本的木塔、缅甸金色佛塔等；英语里有时也会把不同类型的佛塔或塔状寺庙建筑统称为pagoda。","词源上，“pagoda”经由葡萄牙语进入英语，历史上也曾被用来泛指一些亚洲宗教建筑；现代使用时更常指层层檐的塔形结构。"]}
{"word":"pagodalike","summary":{"en":"“Pagodalike” means having the tiered, tower-like shape of a pagoda.","zh":"“pagodalike”表示外形像宝塔一样层层递减、塔状的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pagoda (a traditional Asian tower with multiple, gradually smaller tiers), especially in having a tiered, tower-like shape.","zh":"像宝塔的；宝塔式的（尤指层层递减、塔状的外形）。"},"examples":[{"en":"The museum’s pagodalike roof rises in stacked tiers above the entrance.","zh":"博物馆的宝塔式屋顶在入口上方层层叠起。"},{"en":"She wore a pagodalike hat that narrowed toward the top.","zh":"她戴着一顶宝塔状的帽子，越往上越收窄。"},{"en":"The cake was decorated in a pagodalike shape, with smaller layers on top.","zh":"蛋糕被装饰成宝塔形，上面一层比一层小。"}]}],"synonyms":["pagoda-like","tiered","towering","stacked","stepped"],"phonetic":"/pəˈɡoʊdəˌlaɪk/","extraExplanation":["“pagodalike”通常写作带连字符的“pagoda-like”，也可能拆开写作“pagoda like”。多用于描述建筑、屋顶、装饰物或造型呈“多层叠起、逐层变小”的视觉特征。","“pagoda（宝塔）”一词在英语里常用来指东亚或东南亚传统的多层塔式建筑，因此“pagoda-like”带有明显的文化与建筑意象；在写作中使用时，注意避免把它当成对某种文化的刻板化标签，最好明确描述具体的“层叠/塔状”形态。"]}
{"word":"pagodas","summary":{"en":"“Pagodas” means more than one pagoda—multi-tiered Asian towers often associated with Buddhism.","zh":"“pagodas”是 pagoda 的复数：多层的亚洲塔式建筑，常与佛教相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall, many-tiered tower common in Asian architecture, often linked to Buddhism and used as a religious building or landmark.","zh":"（亚洲常见的）宝塔；多层塔楼，常与佛教有关，可作为宗教建筑或地标。"},"examples":[{"en":"We visited an ancient pagoda near the temple.","zh":"我们参观了寺庙附近的一座古老宝塔。"},{"en":"The city skyline includes a pagoda on the hill.","zh":"城市天际线里有一座山上的宝塔。"},{"en":"Many pagodas were built to store Buddhist relics.","zh":"许多宝塔建来用以供奉佛教舍利。"}]},{"partOfSpeech":"other","definition":{"en":"Plural of “pagoda.”","zh":"“pagoda”的复数形式。"},"examples":[{"en":"The guide showed us several pagodas in the area.","zh":"导游带我们看了这一带的几座宝塔。"}]}],"synonyms":["temple tower","tower","stupa (related)"],"phonetic":"/pəˈɡoʊdəz/","extraExplanation":["“pagoda”在英语里常用来指东亚、东南亚的塔式建筑（如中国的塔、日本的五重塔、缅甸的佛塔等）。不同地区的建筑形制与宗教含义不完全相同，但在英语日常表达中常被统称为 pagoda。","词源来自葡萄牙语 pagode，和南亚、东南亚的宗教场所称呼有关，后来被欧洲语言用来泛指“塔形的宗教建筑”。"]}
{"word":"pagodite","summary":{"en":"Pagodite is a soft ornamental stone used for carving, sometimes treated as a variety of pyrophyllite.","zh":"Pagodite 指一种用于雕刻的软质观赏石，有时被视为叶蜡石（或相近岩石）的一种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, easily carved ornamental stone (often a variety of pyrophyllite or related rock) used for small sculptures and seals, especially associated with East Asia.","zh":"一种质地较软、易于雕刻的观赏石（常指叶蜡石或相关岩石的一种），常用于制作小型雕刻品与印章，尤其与东亚工艺相关。"},"examples":[{"en":"The artist carved a small seal from pagodite because it cuts smoothly.","zh":"艺术家用 pagodite 雕刻了一枚小印章，因为它很好下刀。"},{"en":"In the museum shop, you can see pagodite figurines beside jade carvings.","zh":"在博物馆商店里，你能看到 pagodite 小摆件和玉雕摆在一起。"}]}],"synonyms":["pagoda stone","carving stone","pyrophyllite (sometimes)"],"phonetic":"/ˈpæɡəˌdaɪt/","extraExplanation":["“Pagodite”这个词来自“pagoda（宝塔）+ -ite（矿物/岩石后缀）”，意思大致是“宝塔石”。它并不是日常英语常用词，更常见于矿物学、工艺品或收藏语境。","不同资料里对 pagodite 的指称可能不完全一致：有时被当作叶蜡石（pyrophyllite）或与其相近、适合雕刻的软石的俗称，因此在购买或研究时通常需要看产地与矿物成分说明。"]}
{"word":"pagods","summary":{"en":"“Pagods” is usually the plural of archaic “pagod,” meaning either (1) a pagoda (temple tower) or (2) a historical Indian gold coin.","zh":"“pagods”通常是古拼写“pagod”的复数，可指（1）宝塔/塔状寺庙建筑，或（2）旧时印度使用的一种金币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a pagoda; a tiered tower-like temple building, common in parts of Asia.","zh":"（古义）宝塔；（亚洲常见的）层层叠起的塔状寺庙建筑。"},"examples":[{"en":"In old travel books, you may see “pagod” used where we would now write “pagoda.”","zh":"在一些旧的游记或旅行书里，你可能会看到用“pagod”来表示我们现在写的“pagoda（宝塔）”。"},{"en":"The painting shows a pagod rising above the trees near a temple.","zh":"这幅画描绘了一座宝塔从寺庙旁的树梢上方高高耸起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) an old gold coin used in parts of India, especially during the colonial period.","zh":"（历史）帕戈德金币；旧时在印度部分地区流通的金币（殖民时期尤常见）。"},"examples":[{"en":"The merchant paid in pagods and silver, according to the record.","zh":"据记载，那位商人用帕戈德金币和白银付款。"},{"en":"Some museum labels mention the value of goods in pagods.","zh":"一些博物馆的说明牌会用“pagods（帕戈德金币）”来标注货物价格。"}]}],"synonyms":["pagoda","temple tower","shrine","(coin) gold coin"],"phonetic":"/pəˈɡoʊd/","extraExplanation":["“pagods”多半是“pagod”的复数；但在现代英语里，更常用的拼写是“pagoda / pagodas（宝塔）”。如果你想表达“宝塔（复数）”，写“pagodas”最自然。","词源上，“pagoda”经由葡萄牙语等欧洲语言进入英语，早期英文文献里常出现变体拼写（如 pagod）。因此在较老的文学、旅行记、殖民地史料中更容易见到“pagod(s)”。","“pagod”表示“金币”时属于历史用法，常见于与印度贸易、殖民行政或钱币史相关的文本；日常对话里几乎不会用到。"]}
{"word":"pagoscope","summary":{"en":"“Pagoscope” is a very rare/nonstandard noun likely meaning a tool for viewing or inspecting pages.","zh":"“pagoscope”是非常罕见／非标准名词，多半指用于观看或检查页面的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A device or tool for viewing, inspecting, or examining pages (for example, pages of a book or document).","zh":"（罕见／非标准用词）用于观看、检查或检视书页／文件页面的装置或工具。"},"examples":[{"en":"The archivist joked that she needed a “pagoscope” to inspect fragile pages without touching them.","zh":"档案管理员开玩笑说，她需要一个“pagoscope”来检查脆弱的书页，避免直接触碰。"},{"en":"In the lab notes, “pagoscope” seems to mean a simple page-viewing setup with a camera and stand.","zh":"在实验记录里，“pagoscope”似乎指一种用相机和支架组成的简易页面观察装置。"}]}],"synonyms":["page viewer","document viewer","inspection scope"],"phonetic":"/ˈpæɡoʊˌskoʊp/","extraExplanation":["“pagoscope”并不是常见英语词汇，在主流词典中通常查不到；更像是由 page（页面）+ -scope（观察器、镜）构成的自造词或行业内临时用语。","如果你是在某篇文章/专利/说明书里看到它，含义往往要依上下文确定：可能指用于“看页面、检视印刷质量、拍摄页面”的任何装置。","如果你愿意贴出原句或来源领域（印刷、档案修复、摄影、软件等），我可以帮你更精确地判断它在该语境下的意思，并给出更自然的对应译法。"]}
{"word":"pagrus","summary":{"en":"Pagrus is the scientific genus name for certain seabream (saltwater fish).","zh":"Pagrus 是部分海鲷（海水鲷科鱼类）的科学属名（鲷属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of seabream (saltwater fish) in the sparid family, including species such as the red seabream.","zh":"鲷属（海水鱼类的一属，属鲷科），包含如真鲷/红鲷等物种。"},"examples":[{"en":"Pagrus major is a well-known species of seabream in East Asian cuisine.","zh":"Pagrus major（真鲷/红鲷）是在东亚料理中很有名的一种鲷鱼。"},{"en":"Scientists recorded several Pagrus species living near rocky reefs.","zh":"科学家记录到多种鲷属（Pagrus）鱼类生活在岩礁附近。"}]}],"synonyms":["seabream","sea bream","sparid (fish)"],"phonetic":"/ˈpeɪɡrəs/","extraExplanation":["“Pagrus”是拉丁化的学名（科学分类名称），日常英语里更常直接说“seabream / sea bream（海鲷）”，在菜市场或菜单上也常用具体物种名（如“red seabream”）。","不同地区把多种鲷科鱼都叫“bream/鲷”，容易混淆；如果是科学写作或看渔业资料，用属名“Pagrus”能更精确。"]}
{"word":"paguma","summary":{"en":"“Paguma” is not a standard English word; it is most likely meant to be “pajama(s),” meaning sleepwear.","zh":"“paguma”不是标准英语词；很可能指“pajama(s)”（睡衣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a misspelling of “pajama/pyjama”: loose, comfortable clothes worn for sleeping, usually a top and pants.","zh":"（很可能）是“pajama/pyjama”的拼写错误：睡觉时穿的宽松舒适的衣服，通常包括上衣和裤子。"},"examples":[{"en":"I put on my pajamas after taking a shower.","zh":"我洗完澡后穿上睡衣。"},{"en":"These pajama pants are really soft.","zh":"这条睡裤特别柔软。"}]},{"partOfSpeech":"n.","definition":{"en":"pajamas (plural): a set of nightclothes (top and bottoms) worn for sleeping.","zh":"pajamas（复数）：一套睡衣（上衣和下装），用来睡觉时穿。"},"examples":[{"en":"He bought new pajamas for the winter.","zh":"他买了新的冬季睡衣。"},{"en":"Kids often wear matching pajamas on holiday mornings.","zh":"孩子们常在节日早晨穿成套的睡衣。"}]}],"synonyms":["sleepwear","nightclothes","PJs"],"phonetic":"/pəˈdʒɑːmə/","extraExplanation":["“paguma”不是常见英语单词；最接近且最常见的可能是“pajama(s)”（美式拼写）或“pyjama(s)”（英式拼写）。","“pajama”一词来源于南亚语言（如印地语/乌尔都语 pāyjāma），原指宽松的裤子，后来在英语里多指睡衣。"]}
{"word":"pagurian","summary":{"en":"Likely intended word: Pythagorean—related to Pythagoras, especially the Pythagorean theorem; also a follower of his school.","zh":"可能想写的是：Pythagorean——与毕达哥拉斯及其思想有关（尤指勾股定理）；也可指其学派的追随者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Greek mathematician Pythagoras or to his ideas (especially the Pythagorean theorem).","zh":"与古希腊数学家毕达哥拉斯（Pythagoras）或其思想有关的（尤指“勾股定理/毕达哥拉斯定理”）。"},"examples":[{"en":"In a right triangle, the Pythagorean theorem says a² + b² = c².","zh":"在直角三角形中，勾股定理（毕达哥拉斯定理）表示 a² + b² = c²。"},{"en":"We used a Pythagorean triple (3, 4, 5) to check our measurements.","zh":"我们用一组勾股数（3，4，5）来核对测量结果。"}]},{"partOfSpeech":"n.","definition":{"en":"a follower of Pythagoras or a member of the ancient Pythagorean school.","zh":"毕达哥拉斯学派的追随者；古代毕达哥拉斯学派成员。"},"examples":[{"en":"Some Pythagoreans believed that numbers were the key to understanding the universe.","zh":"一些毕达哥拉斯学派的人认为数字是理解宇宙的关键。"}]}],"synonyms":["right-triangle (context)","Pythagoras-related"],"phonetic":"/ˌpaɪθəˈɡɔriən/","extraExplanation":["“pagurian”不是常见英语单词，最可能是拼写误差，常见目标词是 **Pythagorean**（毕达哥拉斯的/勾股的）。","Pythagorean 的词源来自人名 **Pythagoras**（毕达哥拉斯）。在英语里常见搭配有：**Pythagorean theorem**（勾股定理）、**Pythagorean triple**（勾股数/勾股数组）。"]}
{"word":"pagurians","summary":{"en":"“Pagurians” usually means hermit crabs (or relating to them), especially in scientific or nature-writing contexts.","zh":"“pagurians”通常指“寄居蟹（或与寄居蟹有关）”，多见于科普或自然写作语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hermit crabs; animals of the hermit-crab group (especially those in the family Paguridae).","zh":"寄居蟹；指寄居蟹类动物（尤指寄居蟹科 Paguridae）。"},"examples":[{"en":"The tide pool was full of pagurians carrying borrowed shells.","zh":"潮池里满是背着“借来”贝壳的寄居蟹（pagurians）。"},{"en":"Pagurians often switch shells as they grow.","zh":"寄居蟹（pagurians）长大后常会更换更大的壳。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to hermit crabs (Pagurus / Paguridae).","zh":"与寄居蟹（Pagurus 属 / Paguridae 科）有关的；寄居蟹的。"},"examples":[{"en":"Scientists noted pagurian behavior, including shell selection.","zh":"科学家记录了寄居蟹的（pagurian）行为，包括挑选贝壳。"}]}],"synonyms":["hermit crabs","pagurid hermit crabs","Paguridae"],"phonetic":"/pəˈɡjʊriənz/","extraExplanation":["“pagurian”来自拉丁化的属名/词根 Pagurus（寄居蟹相关），在科普写作中偶尔出现，但日常英语更常用 “hermit crab(s)”。","在生物分类里，“Paguridae”是“寄居蟹科”；“pagurians”通常可理解为“寄居蟹类（成员）”。"]}
{"word":"pagurid","summary":{"en":"A scientific term for a hermit crab (especially in the family Paguridae) or something relating to that family.","zh":"一个偏学术的词：指寄居蟹（尤指寄居蟹科 Paguridae 的种类），或表示“与该科寄居蟹有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hermit crab, especially one belonging to the family Paguridae","zh":"寄居蟹（尤指寄居蟹科 Paguridae 的种类）"},"examples":[{"en":"A pagurid will often move into a larger empty shell as it grows.","zh":"寄居蟹长大后常会换到更大的空贝壳里。"},{"en":"The researcher recorded the behavior of several pagurids on the rocky shore.","zh":"研究人员记录了岩岸上几只寄居蟹的行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to hermit crabs of the family Paguridae","zh":"寄居蟹科（Paguridae）寄居蟹的；与其有关的"},"examples":[{"en":"Pagurid species differ in shell preference and habitat.","zh":"寄居蟹科的不同物种在壳的偏好与栖息地上有所不同。"}]}],"synonyms":["hermit crab","pagurid hermit crab"],"phonetic":"/ˈpæɡjərɪd/","extraExplanation":["“pagurid”常见于生物学/海洋学写作中，属于学术词；日常英语里更常用的是“hermit crab（寄居蟹）”。","词源与分类有关：来自拉丁化的属名/科名“Pagurus / Paguridae”，用于指代某一类寄居蟹，而不是所有寄居蟹的通称。"]}
{"word":"paguridae","summary":{"en":"Paguridae is the scientific family name for many hermit crabs.","zh":"Paguridae 指“寄居蟹科”，是许多寄居蟹的科学分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of hermit crabs (crustaceans) that typically live in empty sea-snail shells to protect their soft abdomen.","zh":"寄居蟹科；一种寄居蟹的分类群（甲壳类），常住在空海螺壳中以保护柔软的腹部。"},"examples":[{"en":"Many members of the Paguridae carry a borrowed shell as a mobile home.","zh":"许多寄居蟹科成员把借来的贝壳当作可移动的家。"},{"en":"The researcher identified the crab as belonging to the family Paguridae.","zh":"研究人员鉴定这只螃蟹属于寄居蟹科。"}]}],"synonyms":["hermit crab family"],"phonetic":"/ˌpæɡjʊˈraɪdiː/","extraExplanation":["“Paguridae”是动物分类学名称：科（family）一级，常见于生物学、海洋学论文与图鉴中。日常英语里人们更常说“hermit crab（寄居蟹）”。","词源上与拉丁语/新拉丁语的“Pagurus（寄居蟹属名）”有关；这类学名常用拉丁化形式，复数/单复数在英语中通常都写作“Paguridae”。"]}
{"word":"paguridea","summary":{"en":"Paguroidea is the scientific taxonomic name for the hermit crab superfamily.","zh":"Paguroidea 是“寄居蟹超科”的科学分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for a superfamily of crustaceans commonly known as hermit crabs (animals that often protect their soft abdomen by living in empty seashells).","zh":"（生物）寄居蟹超科：一类甲壳动物的科学分类名称，常见成员被称为寄居蟹（常用空贝壳保护柔软的腹部）。"},"examples":[{"en":"Many species in the superfamily Paguroidea use abandoned snail shells as shelter.","zh":"寄居蟹超科（Paguroidea）中的许多物种会用废弃的蜗牛壳作庇护所。"},{"en":"The guidebook lists Paguroidea as part of the decapod crustaceans found along the coast.","zh":"这本图鉴把 Paguroidea 列为海岸常见的十足目甲壳动物之一。"}]}],"synonyms":["hermit crab(s)","hermit-crab superfamily"],"phonetic":"/ˌpæɡjʊˈrɔɪdiə/","extraExplanation":["你输入的“paguridea”更常见的标准拼写是 **Paguroidea**（寄居蟹超科）。在英文科普或学术写作里，这类拉丁化分类名通常首字母大写。","“Paguroidea”来自拉丁语/新拉丁语的分类命名传统；日常英语里更常用的说法是 **hermit crabs**（寄居蟹）。"]}
{"word":"pagurids","summary":{"en":"“Pagurids” means hermit crabs (family Paguridae).","zh":"“pagurids”指寄居蟹（寄居蟹科 Paguridae）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of crustaceans known as hermit crabs (family Paguridae), which often live in empty snail shells to protect their soft abdomen.","zh":"一种甲壳动物类群，即寄居蟹（寄居蟹科 Paguridae）；它们常住在空的螺壳里，用来保护柔软的腹部。"},"examples":[{"en":"In the tide pools, we saw pagurids crawling into empty shells.","zh":"在潮池里，我们看到寄居蟹爬进空贝壳里。"},{"en":"Pagurids switch shells as they grow larger.","zh":"寄居蟹长大后会更换更大的壳。"},{"en":"Many pagurids survive by hiding quickly when predators approach.","zh":"许多寄居蟹会在捕食者靠近时迅速躲藏来生存。"}]}],"synonyms":["hermit crabs","Paguridae"],"phonetic":"/ˈpæɡjʊrɪdz/","extraExplanation":["“Pagurids”是复数形式，单数可说“pagurid”，更常见的日常用词是“hermit crab（寄居蟹）”。","“Paguridae”是生物分类学中的“科”名（寄居蟹科）。在科普、海洋生物学或自然观察文章中更常用这个术语。","寄居蟹并不是“长在壳里”的；它们会寻找合适的空螺壳并随生长不断换壳。壳对它们来说像“可移动的家”。"]}
{"word":"pagurine","summary":{"en":"“Pagurine” is a biology word meaning “related to hermit crabs,” and more rarely it can mean “a hermit crab.”","zh":"“pagurine”是生物学用语，意思是“与寄居蟹有关的”；较少情况下也可指“寄居蟹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology) Relating to hermit crabs (especially those in the genus *Pagurus* or family Paguridae).","zh":"（生物学）与寄居蟹有关的；尤指与*Pagurus*属或寄居蟹科（Paguridae）有关的。"},"examples":[{"en":"Scientists described the pagurine species living among the coral rubble.","zh":"科学家描述了生活在珊瑚碎石间的寄居蟹类物种。"},{"en":"The museum label mentions a pagurine crab that carries a borrowed shell.","zh":"博物馆标签提到一种会“借用”贝壳的寄居蟹。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A hermit crab.","zh":"（较少用）寄居蟹。"},"examples":[{"en":"A small pagurine crawled into an empty snail shell for protection.","zh":"一只小寄居蟹爬进空蜗牛壳里以获得保护。"}]}],"synonyms":["hermit-crab (adj.)","pagurid (adj.)"],"phonetic":"/ˈpæɡjəˌraɪn/","extraExplanation":["“pagurine”多见于较正式或较旧的生物学写作中；日常英语更常说“hermit crab”（寄居蟹）。","词源来自拉丁语 *pagurus*（寄居蟹）。在动物分类学语境里，它常用作形容词，修饰“crab / species / group”等名词。","如果你是在资料里看到“pagurine”，也可能与“Paguridae（寄居蟹科）”“pagurid（寄居蟹科的）”并列出现；其中“pagurid”在现代文献里更常见。"]}
{"word":"pagurinea","summary":{"en":"Pagurinea is a rare scientific-looking form; in English, pagurine means ‘related to’ or ‘a’ hermit crab.","zh":"Pagurinea 更像罕见的学术/拉丁化写法；英语中更常用 pagurine，表示“与寄居蟹有关的”或“寄居蟹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; zoology) Relating to hermit crabs, especially the family Paguridae; hermit-crab-like.","zh":"（罕用；动物学）与寄居蟹有关的，尤指寄居蟹科（Paguridae）的；类似寄居蟹的。"},"examples":[{"en":"Scientists described a pagurine crab living inside an empty snail shell.","zh":"科学家描述了一种寄居蟹科的螃蟹住在空蜗牛壳里。"},{"en":"The pagurine habit of borrowing shells helps protect a soft abdomen.","zh":"寄居蟹“借壳而居”的习性有助于保护柔软的腹部。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; zoology) A hermit crab (a member of Paguridae or related groups).","zh":"（罕用；动物学）寄居蟹（寄居蟹科或相关类群的成员）。"},"examples":[{"en":"A small pagurine scuttled across the tide pool.","zh":"一只小寄居蟹匆匆爬过潮池。"}]}],"synonyms":["hermit-crab (adj.)","hermit crab (n.)","Paguridae"],"phonetic":"/ˈpæɡjəˌraɪn/","extraExplanation":["“pagurinea”在现代英语里几乎不作为常用拼写出现，更常见的是 **pagurine**。它源自拉丁语 *Pagurus*（寄居蟹属名）以及更早的希腊语词根，主要出现在生物分类、动物学论文或标本描述中。","如果你是在阅读学术文本看到“Pagurinea”，它也可能指某个分类层级名称（不同文献的分法可能不一致）；日常英语中通常直接说 **hermit crab**（寄居蟹）。"]}
{"word":"paguroid","summary":{"en":"Paguroid means “related to hermit crabs,” and it can also mean “a hermit crab” in scientific contexts.","zh":"paguroid 表示“与寄居蟹有关的/寄居蟹类的”，在科学语境中也可指“寄居蟹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to hermit crabs (animals in the group Paguroidea), especially in scientific writing.","zh":"（尤用于科学写作中）与寄居蟹（Paguroidea 这一类群）有关的；寄居蟹类的。"},"examples":[{"en":"Researchers recorded several paguroid species living in empty snail shells.","zh":"研究人员记录了几种寄居蟹类物种住在空蜗牛壳里。"},{"en":"The report compares paguroid behavior across different habitats.","zh":"该报告比较了不同栖息地中寄居蟹类的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"a hermit crab; a member of the hermit-crab group.","zh":"寄居蟹；寄居蟹类的一员。"},"examples":[{"en":"A small paguroid crawled into a larger shell for protection.","zh":"一只小寄居蟹爬进更大的壳里以获得保护。"}]}],"synonyms":["hermit-crab (adj.)","hermit crab (n.)","pagurid (technical)"],"phonetic":"/ˈpæɡjəˌrɔɪd/","extraExplanation":["“paguroid”多见于动物学/海洋生物学语境，日常英语里更常说 hermit crab（寄居蟹）。","词源来自拉丁化学名 Pagurus（与寄居蟹相关的属名/名称）+ -oid（“……似的/……类的”）。因此 paguroid 常表示“寄居蟹类的/与寄居蟹有关的”。"]}
{"word":"paguroidea","summary":{"en":"Paguroidea is the scientific name for the superfamily that includes hermit crabs.","zh":"Paguroidea 是“寄居蟹总科”的科学名称，包含寄居蟹等类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a superfamily of crustaceans that includes the hermit crabs (animals that often live in empty seashells to protect their soft abdomen).","zh":"寄居蟹总科：甲壳类动物中的一个总科，包含各类寄居蟹（常借用空贝壳保护柔软腹部的动物）。"},"examples":[{"en":"Many animals in Paguroidea protect themselves by living in empty snail shells.","zh":"寄居蟹总科里的许多动物会住进空的螺壳里来保护自己。"},{"en":"In marine biology class, we learned that Paguroidea is the superfamily that includes hermit crabs.","zh":"在海洋生物课上，我们学到 Paguroidea 是包含寄居蟹的总科。"}]}],"synonyms":["hermit crab superfamily","Paguroidea (taxonomic group)"],"phonetic":"/ˌpæɡjəˈrɔɪdiə/","extraExplanation":["“Paguroidea”是生物分类学（taxonomy）用语，常见于科研文章、图鉴、博物馆标本说明等语境，日常英语更常说“hermit crab(s)”（寄居蟹）。","词源上与拉丁语/新拉丁语中的“Pagurus”（寄居蟹属名）相关，属于以拉丁化形式命名的科学词汇；首字母通常大写，表示分类单元名称（如同“Hominidae”等）。"]}
{"word":"pagurus","summary":{"en":"Pagurus is the genus name for certain hermit crabs in scientific classification.","zh":"Pagurus是某些寄居蟹在科学分类中的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for hermit crabs (family Paguridae), used in biology to classify certain hermit crab species.","zh":"（生物学）寄居蟹属：寄居蟹科（Paguridae）中的一个属名，用于分类某些寄居蟹物种。"},"examples":[{"en":"Scientists identified the specimen as a Pagurus hermit crab.","zh":"科学家将该标本鉴定为寄居蟹属（Pagurus）的一种寄居蟹。"},{"en":"In the field guide, several Pagurus species are listed along the Atlantic coast.","zh":"在野外图鉴中，大西洋沿岸列出了多种寄居蟹属（Pagurus）的物种。"}]}],"synonyms":["hermit crab (general term)","genus Pagurus"],"phonetic":"/pəˈɡjʊrəs/","extraExplanation":["“Pagurus”是拉丁化的学名，常见于科研论文、物种名（如 Pagurus bernhardus）和自然史资料中。日常英语里更常说“hermit crab”（寄居蟹）。","学名里的属名通常首字母大写并用斜体（Pagurus），具体物种名则是“属名 + 种加词”（如 Pagurus longicarpus）。"]}
{"word":"pagus","summary":{"en":"Pagus is a Latin-derived term meaning a rural district or administrative area in ancient Rome and medieval Europe.","zh":"Pagus 是源自拉丁语的术语，指古罗马及中世纪欧洲的乡村行政区或地方辖区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rural district or local administrative area in ancient Rome; later, a similar district in medieval Europe (especially in Frankish lands).","zh":"（古罗马的）乡村行政区、地方辖区；后来也指（中世纪欧洲，尤指法兰克地区的）类似行政区。"},"examples":[{"en":"In Roman records, a pagus could refer to a countryside district outside a major city.","zh":"在罗马文献中，pagus 可指大城市之外的乡村辖区。"},{"en":"Medieval historians sometimes use pagus when discussing early regional administration in Gaul.","zh":"中世纪史学者讨论高卢早期地方治理时，有时会使用 pagus 这个词。"}]}],"synonyms":["district","canton","region","administrative area"],"phonetic":"/ˈpeɪɡəs/","extraExplanation":["pagus 是拉丁语借词，常见于历史、考古和古典研究写作中，日常英语里很少使用。","它与英语单词 pagan（异教徒）在词源上相关：paganus 原意与“乡村的、乡下人”有关，后来才发展出“非基督徒/异教徒”的含义。"]}
