{"word":"pah","summary":{"en":"“Pah” is an interjection (mainly British) meaning “not impressive / who cares,” or showing annoyance or contempt.","zh":"“pah”是感叹词（多见于英式英语），表示“没什么了不起/谁在乎”，也可表达不耐烦或轻蔑。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you think something is not impressive, not worth attention, or is unimportant; similar to “meh” or “whatever.”","zh":"表示你觉得某事不怎么样、不值得在意或无关紧要；类似“meh / 随便啦”。"},"examples":[{"en":"Pah—I've seen better movies than that.","zh":"Pah——那种电影我看过更好的。"},{"en":"He bragged about his score, and she just said, “Pah.”","zh":"他炫耀自己的分数，她只回了一句：“Pah。”"}]},{"partOfSpeech":"int.","definition":{"en":"(UK, informal) Used to express annoyance or contempt, like “tsk” or “hmph.”","zh":"（英式口语）表示不耐烦、轻蔑或不屑，类似“tsk / 哼”。"},"examples":[{"en":"Pah! Don’t waste my time.","zh":"Pah！别浪费我的时间。"},{"en":"“Pah,” he muttered, turning away.","zh":"“Pah，”他嘟囔着，转身走开。"}]}],"synonyms":["meh","whatever","hmph","tsk"],"phonetic":"/pɑ/","extraExplanation":["“pah”更常见于英式英语的对白、小说或戏剧里，用来表现人物的态度（不屑、烦躁、轻蔑）。在美式英语里不算常用，更常见的对应表达是“meh”“whatever”“hmph”。","书写时常用感叹号（Pah!），也可以单独成句。语气偏负面，正式场合不建议使用。"]}
{"word":"paha","summary":{"en":"“Paha” is usually a loanword in English: it can mean “bad/evil” in Finnish, or “thigh” in Malay/Indonesian/Tagalog.","zh":"“paha”在英语里通常作为外来词出现：在芬兰语中可指“坏的/邪恶的”，在马来语/印尼语/他加禄语中可指“大腿”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finnish, loanword) bad; evil; unfortunate.","zh":"（芬兰语借词）坏的；邪恶的；不幸的。"},"examples":[{"en":"In Finnish, “paha” means “bad,” as in “paha sää” (bad weather).","zh":"在芬兰语里，“paha”表示“坏的”，例如“paha sää”（坏天气）。"},{"en":"The story describes a “paha henki,” meaning an evil spirit in Finnish.","zh":"故事里提到“paha henki”，在芬兰语中意思是“恶灵/邪恶的灵”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Malay/Indonesian/Tagalog, loanword) thigh; the upper part of the leg.","zh":"（马来语/印尼语/他加禄语借词）大腿；腿的上部。"},"examples":[{"en":"In Indonesian, “paha ayam” means chicken thigh.","zh":"在印尼语中，“paha ayam”意思是“鸡腿（大腿部位）/鸡大腿”。"},{"en":"The recipe asks for “paha” rather than breast meat.","zh":"食谱要求用“paha”（大腿肉），而不是胸肉。"}]}],"synonyms":["bad","evil","thigh"],"phonetic":"/ˈpɑhɑ/","extraExplanation":["“paha”不是常见英语词汇；在英文语境中多半是外来词（比如谈到芬兰文化或东南亚菜谱时出现）。如果你是在某篇英文文章/菜单/歌词里看到它，可以把原句发来，我可以帮你判断具体是哪一种语言与意思。"]}
{"word":"pahachroma","summary":{"en":"“pahachroma” is not a standard English word; it likely refers to “dense/strong color” or is a misspelling/technical name.","zh":"“pahachroma”不是标准英语词；可能指“色彩浓厚/浓烈”，或是拼写错误/技术名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard term; likely a coined word based on Greek roots meaning “thick/strong color” or “dense coloration.” It is not a common dictionary English word and may also be a misspelling of a scientific or technical term.","zh":"一个非常罕见、非标准的词；很可能是根据希腊语词根造出的词，含义接近“厚重/浓烈的颜色”“色彩浓密”。它并不是常见的英文字典词，也可能是某个科学或技术术语的拼写错误。"},"examples":[{"en":"In the artist’s notes, “pahachroma” seems to describe a palette with dense, saturated color.","zh":"在艺术家的笔记里，“pahachroma”似乎用来形容一种色彩浓郁、饱和度很高的调色盘。"},{"en":"I can’t find “pahachroma” in standard dictionaries—do you mean a different spelling?","zh":"我在常见词典里找不到“pahachroma”——你是不是想写另一个拼法？"}]}],"synonyms":["dense color","rich color","strong coloration","saturated color"],"phonetic":"/ˌpæhəˈkroʊmə/","extraExplanation":["这个词在英语里几乎没有固定、权威的词典释义；更像是（1）个人造词，（2）某个学科里的专门名词/拉丁学名的转写，或（3）拼写误差。","从构词上看，它可能想借用希腊语词根：pachy-（厚、粗、厚重）+ chroma（颜色），因此可被理解为“色彩厚重/浓密”。如果你能提供出现它的句子、领域（艺术/生物/摄影等）或原始拼写，我可以更准确地判定它指的是什么。"]}
{"word":"pahareen","summary":{"en":"Pahareen is a loanword meaning a woman from North India’s hill regions; it’s not common in standard English.","zh":"Pahareen 是借词，指印度北部山区的女性；在标准英语中并不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman from a hill region in North India (especially Himachal Pradesh or Uttarakhand); a feminine form used in some Hindi/Punjabi/Urdu contexts. (Not a standard everyday English word; usually treated as a loanword or transliteration.)","zh":"（多见于印地语/旁遮普语/乌尔都语语境的借词/音译）指来自印度北部山区（尤指喜马偕尔邦、北阿坎德邦等）的女性；“山里人/山区女子”的女性形式。"},"examples":[{"en":"In the story, he falls in love with a Pahareen from a small mountain village.","zh":"在故事里，他爱上了一位来自小山村的 Pahareen（山区女子）。"},{"en":"Some songs use words like Pahari and Pahareen to highlight mountain identity and culture.","zh":"有些歌曲会用 Pahari、Pahareen 这类词来强调“山地身份”和文化。"}]}],"synonyms":["Pahari (woman)","a woman from the hills"],"phonetic":"/pəˈhɑːriːn/","extraExplanation":["“Pahareen”常被视为南亚语言里的称呼或身份标签，而不是标准英语词汇；在英语写作中更常见的是用 “Pahari (person)” 或直接写 “a woman from the hills / from Himachal/Uttarakhand”。","拼写与发音可能因地区而变化（如 Paharin、Pahareen 等）。如果你是在歌词、小说或社交媒体里看到的，它往往带有亲切或地方认同的色彩。"]}
{"word":"pahari","summary":{"en":"“Pahari” refers to the hill regions/people of northern South Asia; it can also mean Pahari languages/dialects or the Pahari painting tradition.","zh":"“pahari”指南亚北部山地地区/山地居民；也可指帕哈里语（语群/方言）或帕哈里画派。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asia) Related to the hills or hill people, especially in the Himalayan foothills of northern India and nearby regions.","zh":"（南亚）与山地/丘陵地区或山地居民有关的，尤指印度北部喜马拉雅山麓及周边地区。"},"examples":[{"en":"She bought a Pahari shawl while traveling in the Himalayan foothills.","zh":"她在喜马拉雅山麓旅行时买了一条帕哈里（山地风格的）披肩。"},{"en":"The festival features Pahari folk songs and dances.","zh":"这个节日展示帕哈里民歌和舞蹈。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of languages/dialects spoken in the hill regions of northern India and parts of Nepal and Pakistan (often called “Pahari languages”).","zh":"（通常作“Pahari languages”）印度北部山地及尼泊尔、巴基斯坦部分地区使用的一组语言/方言（帕哈里语群）。"},"examples":[{"en":"He speaks Pahari at home and Hindi at school.","zh":"他在家说帕哈里语，在学校说印地语。"},{"en":"Researchers are documenting several Pahari dialects.","zh":"研究者正在记录几种帕哈里方言。"}]},{"partOfSpeech":"n.","definition":{"en":"A style of North Indian painting from the Himalayan hill kingdoms (often called “Pahari painting”), known for delicate lines and romantic or devotional themes.","zh":"（常作“Pahari painting”）源自喜马拉雅山地诸王国的北印度绘画风格（帕哈里画派），以线条细腻、题材浪漫或宗教虔敬著称。"},"examples":[{"en":"The museum has a small collection of Pahari paintings.","zh":"这家博物馆收藏了一小批帕哈里画派作品。"},{"en":"Pahari art often illustrates scenes from Krishna stories.","zh":"帕哈里艺术常描绘与奎师那相关的故事场景。"}]}],"synonyms":["hill","Himalayan","Pahari languages","Pahari painting"],"phonetic":"/pəˈhɑri/","extraExplanation":["“Pahari”来自印地语等语言中的词根“pahāṛ”（山/山地），字面意思与“山里”“山地人”相关。不同语境里，它既可以指语言/方言，也可以指文化产品（如服饰、音乐）或艺术史上的“帕哈里画派”。","书写上常见搭配：Pahari language(s)（帕哈里语/语群）、Pahari people（帕哈里人/山地居民）、Pahari painting（帕哈里画派）。如在学术或新闻语境中，建议加上具体地区（如Himachali Pahari等）以避免泛指。"]}
{"word":"paharia","summary":{"en":"“Paharia” most commonly refers to Indigenous communities in eastern India, or something related to their culture/language.","zh":"“Paharia”通常指印度东部的帕哈里亚族群（原住民群体）或与其文化/语言相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to one of several Indigenous communities in eastern India (especially in Jharkhand and West Bengal), often living in hilly areas; sometimes written as “Pahariya.”","zh":"帕哈里亚人：印度东部（尤指贾坎德邦与西孟加拉邦）若干原住民群体之一的成员，多居住在丘陵地带；也常拼作 “Pahariya”。"},"examples":[{"en":"The museum exhibit included photographs of Paharia villages in the hills.","zh":"博物馆展览中有帕哈里亚人丘陵村落的照片。"},{"en":"A Paharia elder shared stories about seasonal farming and forest life.","zh":"一位帕哈里亚族长讲述了季节性耕作与森林生活的故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Paharia people or their language(s) and culture.","zh":"帕哈里亚的：与帕哈里亚族群或其语言与文化有关的。"},"examples":[{"en":"She is studying Paharia folk songs for her research project.","zh":"她正在为研究项目学习帕哈里亚民歌。"},{"en":"The guide pointed out a Paharia weaving style unique to the region.","zh":"导游指出了一种当地独特的帕哈里亚织造风格。"}]}],"synonyms":["Pahariya","Pahari (related term)"],"phonetic":"/pəˈhɑːriə/","extraExplanation":["“Paharia / Pahariya”一词常与印度语系中表示“山、丘陵”的词根相关（如印地语 pahāṛ，意为“山”），因此带有“山地居民”的含义。","在不同资料与地区语境中，Paharia 可能指不同但相近的族群与语言变体；写作上也常见 Pahariya、Pahari 等近形词。若你有具体地区（例如 Rajmahal Hills 拉杰马哈尔丘陵）或语境，我可以帮你更精准对应。"]}
{"word":"pahautea","summary":{"en":"Pahautea is a Māori name used in New Zealand for a native mountain conifer (a small tree).","zh":"Pahautea 是新西兰语境中的毛利语名称，指一种原生的山地针叶小乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a New Zealand native conifer (a small tree) known in Māori and New Zealand English as the mountain tōtara / mountain toatoa (genus *Phyllocladus*, especially *Phyllocladus alpinus*).","zh":"一种新西兰原生的针叶类小乔木，在毛利语与新西兰英语中常称为“山托塔拉/山托阿托阿”（*Phyllocladus* 属，尤指 *Phyllocladus alpinus*）。"},"examples":[{"en":"Pahautea grows in cool, mountainous areas of New Zealand.","zh":"Pahautea 生长在新西兰较凉爽的山地区域。"},{"en":"The guide pointed out pahautea and explained it’s a native conifer.","zh":"向导指着 pahautea 解释说它是一种原生针叶树。"}]}],"synonyms":["mountain toatoa","mountain tōtara","Phyllocladus alpinus"],"phonetic":"/ˌpɑːhaʊˈteɪə/","extraExplanation":["“pahautea”来自毛利语（Māori），在新西兰语境里多指一种山地树种；在英文资料中常见的对应名包括 *mountain toatoa* / *mountain tōtara*。拼写与重音在不同资料里可能略有差异。","它并不是现代通用英语里的常见词，更常出现在新西兰的自然、植物、地理或文化介绍中。"]}
{"word":"pahi","summary":{"en":"“Pahi” is usually a proper name rather than a common English word.","zh":"“Pahi”通常是专有名词，而不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most often used as a proper name (a person’s name, place name, or brand) in different languages.","zh":"不是标准英语词汇；最常见作专有名词（人名、地名或品牌名），可能来自不同语言。"},"examples":[{"en":"I met Pahi at the conference yesterday.","zh":"我昨天在会议上认识了Pahi。"},{"en":"Pahi is a small place on the map.","zh":"Pahi 是地图上的一个小地方。"}]}],"phonetic":"/ˈpɑːhi/","extraExplanation":["“pahi”在英语词典中通常找不到固定词条，所以更可能是：\n1）专有名词（人名/地名/公司名）；\n2）其他语言的词（例如某些南亚语言或波利尼西亚语系中可能出现类似拼写）。\n如果你告诉我它出现的句子、国家/地区或你想表达的意思，我可以帮你判断正确含义、发音以及是否是拼写错误。"]}
{"word":"Pahlavi","summary":{"en":"Pahlavi usually refers to Middle Persian (the language and script of Sasanian Iran) and can also describe the Pahlavi dynasty (Iran, 1925–1979).","zh":"Pahlavi 通常指中古波斯语（巴列维语）及其文字体系，也可指伊朗1925–1979年的巴列维王朝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Middle Persian—the language used in Iran mainly during the Sasanian Empire (about AD 224–651)—or to the writing system used for it.","zh":"与“巴列维语/中古波斯语”（主要用于萨珊王朝时期的伊朗，约公元224–651年）或其书写体系有关的。"},"examples":[{"en":"Many Zoroastrian religious texts were preserved in Pahlavi.","zh":"许多琐罗亚斯德教的宗教文献以巴列维文保存下来。"},{"en":"The inscription is written in Pahlavi script.","zh":"这段铭文是用巴列维文字写的。"}]},{"partOfSpeech":"n.","definition":{"en":"the Middle Persian language or its script.","zh":"巴列维语（中古波斯语）；巴列维文字。"},"examples":[{"en":"She is learning to read Pahlavi to study early Iranian history.","zh":"她正在学习阅读巴列维文，以研究早期伊朗历史。"},{"en":"This manuscript includes a short passage in Pahlavi.","zh":"这份手稿包含一段简短的巴列维语文字。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Pahlavi dynasty, the royal family that ruled Iran from 1925 to 1979.","zh":"与巴列维王朝有关的（伊朗1925–1979年的统治王朝）。"},"examples":[{"en":"The museum has an exhibit on Pahlavi-era Iran.","zh":"这家博物馆有一个关于巴列维时期伊朗的展览。"},{"en":"He wrote a book about politics under the Pahlavi monarchy.","zh":"他写了一本关于巴列维君主制下政治的书。"}]}],"synonyms":["Middle Persian","Pahlavi script","Pahlavi dynasty"],"phonetic":"/pəˈlɑːvi/","extraExplanation":["“Pahlavi”一词常让人混淆，因为它既可指古代的“巴列维语/中古波斯语”与其文字系统，也可指近现代的“巴列维王朝”。看上下文：如果谈铭文、手稿、语言学，多半是前者；如果谈20世纪伊朗政治与历史，多半是后者。","“Pahlavi script（巴列维文字）”常被说明为一种源自阿拉姆文字母体系的书写传统，拼写与读法有时不完全对应，因此学习时会觉得比现代波斯语更难。"]}
{"word":"pahlavis","summary":{"en":"“Pahlavis” usually refers to the Pahlavi royal family/dynasty of Iran; less commonly, it can mean multiple Pahlavi (Middle Persian) texts or script forms.","zh":"“Pahlavis”通常指伊朗的巴列维王室/巴列维王朝；较少见时也可指多种巴列维（中古波斯语）文献或文字形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the Pahlavi royal family (the House of Pahlavi), who ruled Iran from 1925 until the 1979 Iranian Revolution","zh":"巴列维王室（巴列维王朝），1925年至1979年伊朗革命前统治伊朗的王族"},"examples":[{"en":"The Pahlavis ruled Iran for more than fifty years before the monarchy ended in 1979.","zh":"巴列维王室在君主制于1979年结束之前统治伊朗五十多年。"},{"en":"Some histories compare reforms under the Pahlavis with those in neighboring countries.","zh":"一些历史著作会把巴列维王朝时期的改革与周边国家作比较。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) plural of “Pahlavi,” referring to Middle Persian language forms, texts, or the Pahlavi script","zh":"（较少见）“Pahlavi”的复数，指中古波斯语的形式/文献或巴列维文字（书写系统）"},"examples":[{"en":"Scholars study different Pahlavis preserved in religious manuscripts.","zh":"学者研究保存在宗教手稿中的不同巴列维文献。"},{"en":"The museum label mentions Pahlavis used to record Middle Persian.","zh":"博物馆说明牌提到用于记录中古波斯语的巴列维文字。"}]}],"synonyms":["House of Pahlavi","Pahlavi dynasty"],"phonetic":"/pɑːləˈviːz/","extraExplanation":["“Pahlavi”既可指伊朗近代的巴列维王朝（Reza Shah与其子Mohammad Reza Shah），也可指更早期的“中古波斯语/巴列维文字”。在历史或新闻语境里，复数“Pahlavis”通常更可能是在说“巴列维王室/巴列维家族”。"]}
{"word":"pahmi","summary":{"en":"“Pahmi” isn’t a recognized English word; it’s likely a misspelling or a name. Provide a sentence for the intended meaning.","zh":"“pahmi”不是常见英语词，可能是拼写错误或名字。请提供句子以确认你想表达的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “pahmi” in an English dictionary—did you mean “palm” or “psalm”?","zh":"我在英语词典里找不到“pahmi”——你是不是想写“palm（手掌/棕榈）”或“psalm（圣诗）”？"},{"en":"Can you share a full sentence with “pahmi” so I can help you accurately?","zh":"你能把包含“pahmi”的完整句子发我吗？这样我才能更准确地帮你。"}]}],"phonetic":"/ˈpɑːmi/","extraExplanation":["“pahmi”看起来更像是：①拼写输入错误（常见候选：palm, psalm, pamphlet 的开头 pam- 等）；②人名/网名；③其他语言的词（例如南亚/东南亚语言的转写）。\n如果你告诉我它出现的语境（哪篇文章/哪句话/你想表达什么），我可以帮你确认正确拼写，并给出对应词的发音、词性和例句。"]}
{"word":"paho","summary":{"en":"“paho/PAHO” is most commonly an acronym for the Pan American Health Organization; in tech, it can also refer to the Eclipse Paho MQTT client project.","zh":"“paho/PAHO”最常见是“泛美卫生组织”的缩写；在技术领域也可能指 Eclipse Paho（MQTT 客户端）项目。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Pan American Health Organization (PAHO): a public health agency that works to improve health and living standards in the Americas; it is the World Health Organization’s (WHO’s) regional office for the Americas.","zh":"泛美卫生组织（PAHO）：在美洲地区推动公共卫生与健康改善的国际机构；也是世界卫生组织（WHO）在美洲的区域办事处。"},"examples":[{"en":"PAHO supports vaccination programs across Latin America and the Caribbean.","zh":"PAHO 支持拉丁美洲和加勒比地区的疫苗接种项目。"},{"en":"During the outbreak, PAHO published guidance for hospitals and travelers.","zh":"疫情期间，PAHO 发布了面向医院和旅客的指导建议。"}]},{"partOfSpeech":"other","definition":{"en":"Eclipse Paho: an open-source software project that provides MQTT (messaging) client libraries for connecting devices and applications (common in IoT).","zh":"Eclipse Paho：一个开源软件项目，提供 MQTT（消息传输协议）的客户端库，用于连接设备与应用（常见于物联网）。"},"examples":[{"en":"We used Eclipse Paho to connect our sensor to the MQTT broker.","zh":"我们用 Eclipse Paho 把传感器连接到 MQTT 代理服务器。"},{"en":"The Python app publishes data through the Paho MQTT client.","zh":"这个 Python 应用通过 Paho MQTT 客户端发布数据。"}]}],"synonyms":["Pan American Health Organization","Eclipse Paho"],"phonetic":"/ˈpɑːhoʊ/","extraExplanation":["“PAHO”通常全大写，表示机构缩写；写作“paho”小写时，多见于技术语境（如 Eclipse Paho 项目名）或用户名/代号。","如果你是在某篇文章里看到“paho”，可以告诉我上下文句子，我可以帮你判断它指的是“泛美卫生组织”还是软件项目（或其他专有名词）。"]}
{"word":"pahoehoe","summary":{"en":"Pahoehoe is smooth, ropy basaltic lava (and the rock it becomes) formed by very fluid lava flows.","zh":"pahoehoe 指由高流动性玄武质熔岩形成的表面光滑、绳纹状的熔岩（及其冷却后的岩石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of smooth, ropy lava (and the rock it becomes) that forms when very fluid basaltic lava flows and cools in a gentle, rippled surface.","zh":"一种表面光滑、呈绳纹状的熔岩（及其冷却后形成的岩石），多由流动性很强的玄武质熔岩流动并冷却形成，表面常呈波浪或绳索般纹理。"},"examples":[{"en":"We walked along a field of pahoehoe, and the lava looked like frozen waves.","zh":"我们走在一片绳状熔岩上，熔岩看起来像凝固的海浪。"},{"en":"Pahoehoe forms when lava stays hot and runny long enough to flow smoothly.","zh":"当熔岩保持高温且流动性强，并能持续顺畅流动时，就会形成绳状熔岩。"},{"en":"The guide explained how pahoehoe differs from rough ‘a‘ā lava.","zh":"导游解释了绳状熔岩与粗糙的“阿阿熔岩”（‘a‘ā）有什么不同。"}]}],"synonyms":["ropy lava","smooth lava"],"phonetic":"/pɑːˈhoʊ.iˌhoʊ.i/","extraExplanation":["“pahoehoe”源自夏威夷语（常见拼写为 pāhoehoe），意思大致与“光滑、绳状”有关。该词多用于火山学与地质学语境，尤其常见于介绍夏威夷火山与玄武岩熔岩流的资料中。","与之常被对比的术语是‘a‘ā（阿阿熔岩）：pahoehoe 表面更平滑、像绳索盘绕；而 ‘a‘ā 更锋利粗糙、呈碎块状。两者常是同一股熔岩在不同冷却与流速条件下形成的不同外观。","读音提示：英语里常读作 /pɑːˈhoʊ.iˌhoʊ.i/，分成四拍接近“pah-HOH-ee hoh-ee”。","在科普文章与自然文学（尤其是描写夏威夷或火山地貌的作品）中，这个词常用来营造强烈的地景画面感，如“ropey lava”或“frozen waves”之类的描写。"]}
{"word":"pahos","summary":{"en":"Pathos means deep sadness or pity, and also an emotional appeal used to move an audience.","zh":"Pathos 指深切的悲伤/怜悯之情，也指用来打动受众的“情感诉求”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling of sadness, pity, or deep emotion that makes people feel sympathy.","zh":"一种强烈的悲伤、怜悯或深沉情感，使人产生同情。"},"examples":[{"en":"The movie’s ending was full of pathos, and many people cried.","zh":"电影的结尾充满了悲怆感，很多人都哭了。"},{"en":"Her letter was written with real pathos after the loss of her father.","zh":"在失去父亲后，她的信写得非常动人、充满悲伤。"}]},{"partOfSpeech":"n.","definition":{"en":"In speaking or writing, the emotional appeal that tries to move an audience (often by creating sympathy).","zh":"（演讲或写作中）通过激发情感（常是同情）来打动听众/读者的“情感诉求”。"},"examples":[{"en":"The speaker used pathos by sharing a personal story about his childhood.","zh":"演讲者通过讲述童年经历来运用情感诉求。"},{"en":"Good charity ads often rely on pathos to encourage donations.","zh":"好的公益广告常借助情感诉求来促使人们捐款。"}]}],"synonyms":["pity","sadness","poignancy","emotional appeal","sentiment"],"phonetic":"/ˈpeɪθɑːs/","extraExplanation":["你输入的“pahos”常见是拼写误差；正确拼写通常是 **pathos**。","pathos 源自希腊语，和修辞学里的三大说服方式并列：**ethos**（品格/信誉）、**logos**（逻辑）、**pathos**（情感）。在英语写作课或演讲分析中很常见。","在文学与评论里，pathos 常用来描述作品中“令人心酸/引人同情”的气氛或笔触，例如描写贫困、失去、战争创伤等主题时。"]}
{"word":"pahouin","summary":{"en":"Pahouin is an older umbrella term for several related Bantu-speaking peoples (and sometimes their languages) in Central Africa, especially including Fang and Beti/Bulu groups.","zh":"Pahouin 是一个较旧的统称，用来指中非若干相关的班图语民族（有时也指其语言），尤其包括芳族与贝蒂/布鲁等群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anthropology, history) A collective name formerly used for several closely related Bantu-speaking peoples of Central Africa (especially in Cameroon, Equatorial Guinea, and Gabon), such as the Fang and Beti/Bulu groups.","zh":"（人类学/历史）一个旧称，用来统称中非若干关系密切、讲班图语支语言的民族（主要在喀麦隆、赤道几内亚、加蓬），如芳族（Fang）及贝蒂/布鲁（Beti/Bulu）等群体。"},"examples":[{"en":"Some older French colonial writings refer to the Fang and related groups as the Pahouin.","zh":"一些较早的法属殖民时期文献把芳族及其相关群体称为 Pahouin。"},{"en":"In many modern sources, writers prefer specific names like Fang or Beti rather than the umbrella term Pahouin.","zh":"在许多现代资料中，作者更倾向使用“Fang（芳族）”或“Beti（贝蒂）”等具体名称，而不是统称 Pahouin。"}]},{"partOfSpeech":"n.","definition":{"en":"A language or language variety associated with these peoples (often treated as part of the Fang–Beti language continuum).","zh":"与这些群体相关的语言或方言（常被视为芳语—贝蒂语连续体的一部分）。"},"examples":[{"en":"The researcher compared word lists from Pahouin varieties spoken in different regions.","zh":"研究者比较了不同地区所使用的 Pahouin 各种变体的词表。"}]}],"synonyms":["Fang","Beti","Bulu"],"phonetic":"/pɑːˈwaɪn/","extraExplanation":["“Pahouin”多见于19—20世纪早期的民族志或殖民文献，带有外部命名与概括的色彩；在当代语境中，为了更准确也更尊重当事群体，通常建议使用更具体的族名（如 Fang、Beti、Bulu）或直接写明具体语言名称。","拼写与使用上可能会出现大小写差异（Pahouin/pahouin），但作为民族/语言名称时一般首字母大写。"]}
{"word":"pahutan","summary":{"en":"“Pahutan” is not standard English; it’s likely a misspelling of “Pashtun/Pakhtun.”","zh":"“pahutan”不是标准英语词；很可能是“Pashtun/Pakhtun（普什图人）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or nonstandard spelling of “Pashtun” (also spelled “Pakhtun”), the ethnic group native mainly to Afghanistan and Pakistan.","zh":"不是标准英语词；最常见是对“Pashtun”（也拼作“Pakhtun”）的拼写错误或非标准拼法，指主要分布在阿富汗和巴基斯坦的普什图人（族群）。"},"examples":[{"en":"I think “pahutan” might be a misspelling of “Pashtun.”","zh":"我觉得“pahutan”可能是“Pashtun”的拼写错误。"},{"en":"Many Pashtun communities speak Pashto as their first language.","zh":"许多普什图人社区以普什图语为第一语言。"}]}],"synonyms":["Pashtun","Pakhtun"],"phonetic":"/ˈpɑːʃtuːn/","extraExplanation":["“pahutan”本身在常见英语词典里通常查不到；如果你是在课本、新闻或人名/地名里看到它，很可能是把 Pashtun / Pakhtun（普什图人）拼错了。","如果你能提供一句包含“pahutan”的原句或来源（例如书名、地区、上下文），我可以更准确判断它到底是拼写错误、专有名词，还是来自其他语言的词。"]}

