{"word":"paiche","summary":{"en":"“paiche” is Chinese pinyin meaning “dispatch/assign a vehicle,” commonly used in Chinese contexts; in English, say “dispatch a vehicle” or “send a car.”","zh":"“paiche”是拼音，意思是“派车/调度车辆”，多用于中文语境；英语里通常说“dispatch a vehicle”或“send a car”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chinese pinyin) to dispatch or assign a vehicle (e.g., sending a car/van/truck and driver to pick someone up or deliver something). Not a standard English word; used mainly in Chinese contexts.","zh":"（汉语拼音）派车；调度/安排车辆（如安排车和司机去接人或送货）。不是标准英语单词，多见于中文语境。"},"examples":[{"en":"Can you paiche a car to the airport at 6 a.m.?","zh":"你能安排一辆车早上6点去机场吗？"},{"en":"The logistics team will paiche a truck for tomorrow’s delivery.","zh":"物流团队会为明天的配送安排一辆卡车。"}]},{"partOfSpeech":"n.","definition":{"en":"vehicle dispatching; the act/system of scheduling and sending vehicles in a fleet.","zh":"车辆调度；车队的派车/排班与发车系统。"},"examples":[{"en":"We need a better paiche system during peak hours.","zh":"高峰时段我们需要更好的派车系统。"},{"en":"Paiche is handled by the operations desk.","zh":"派车由运营台负责。"}]}],"synonyms":["dispatch (a vehicle)","send a car","assign a vehicle","fleet dispatch"],"phonetic":"/ˈpaɪ.tʃeɪ/","extraExplanation":["“paiche”对应中文“派车/排车”，在中文公司或跨境业务里有时会直接用拼音说。但在正式英语中建议用：dispatch a vehicle / send a car / assign a driver / fleet dispatch（车队调度）。","如果你是在写邮件或做产品界面（如“派车”按钮/功能），常见翻译：Dispatch / Assign vehicle / Vehicle dispatch。","注意：英语里“dispatch”既可表示“派遣/派出（车辆、人）”，也可表示“迅速处理（事务）”。在物流/出行场景下更贴近“派车”。"]}
{"word":"paichi","summary":{"en":"“Paichi” isn’t a standard modern spelling; it most likely refers to tai chi, a Chinese martial art practiced for health and meditation.","zh":"“paichi”不是现代英语里的常见标准拼写；最可能指“tai chi（太极）”，一种用于健康与静心练习的中国武术。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a less common romanization/spelling referring to tai chi (taijiquan), a Chinese martial art practiced as slow, flowing movements for health, balance, and meditation","zh":"一种较不常见的英文拼写/罗马化写法，指“太极（太极拳）”，一种中国武术，常以缓慢连贯的动作练习，用于强身健体、平衡与静心"},"examples":[{"en":"My neighbor practices Pai Chi (tai chi) in the park every morning.","zh":"我的邻居每天早上都在公园练习 Pai Chi（太极）。"},{"en":"The community center offers beginner Pai Chi / tai chi classes for seniors.","zh":"社区中心为老年人开设初级 Pai Chi / 太极课程。"}]}],"synonyms":["tai chi","taijiquan"],"phonetic":"/ˌtaɪ ˈtʃiː/","extraExplanation":["“Pai Chi”并不是最常见的英文写法；现代英语里更常见的是“tai chi”。“Pai Chi”可能来自旧式拼写/不同的拼音或转写习惯，指向同一个概念：太极/太极拳。","如果你原本想查的是发音类似的英文单词（比如“patchy”= 斑驳的/零星的），告诉我你想表达的意思或给个例句，我可以帮你确认正确拼写。"]}
{"word":"paiconeca","summary":{"en":"“paiconeca” is not a recognized English word; it likely needs context or a corrected spelling.","zh":"“paiconeca”不是常见英语词；需要上下文或可能是拼写需要更正。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “paiconeca” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“paiconeca”——你能提供看到它的句子吗？"},{"en":"Did you mean “picaresque” (a story about a clever rogue’s adventures)?","zh":"你是不是想写“picaresque”（指描写狡黠流浪汉/无赖冒险经历的故事风格）？"}]}],"synonyms":["(possible correction) picaresque","(if it’s a name) provide context","(if it’s another language) specify the language"],"extraExplanation":["“paiconeca”看起来更像是其他语言（如西班牙语/葡萄牙语/意大利语）中的拼写，或是把几个词连在一起的结果。","如果你能提供：1）出现它的原句/截图；2）大概语言（英语/西语等）；3）你想表达的意思（比如“某种食物/人物/文学风格”），我可以更准确判断并给出正确词条。"]}
{"word":"paid","summary":{"en":"“Paid” usually means “gave money (past of pay)” or “receiving money (paid work/leave).”","zh":"“paid”通常表示“已付款/已支付（pay 的过去式）”，也可作形容词表示“有报酬的/带薪的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “pay” (to give money for something; to give someone money for work or a debt).","zh":"“pay”的过去式和过去分词（为某物付款；为工作或债务付钱给某人）。"},"examples":[{"en":"I paid $10 for the ticket.","zh":"我花10美元买了票。"},{"en":"Have you paid the rent yet?","zh":"你付房租了吗？"},{"en":"She has already paid him back.","zh":"她已经把钱还给他了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) receiving money; involving payment (often used in “paid work,” “paid leave,” “paid internship”).","zh":"（形容词）有报酬的；带薪的；需要付费的（常用于“paid work”“paid leave”“paid internship”等）。"},"examples":[{"en":"He is looking for paid work this summer.","zh":"他在找暑期的有薪工作。"},{"en":"She took two weeks of paid leave.","zh":"她休了两周带薪假。"},{"en":"It was a paid event, so we bought tickets online.","zh":"那是收费活动，所以我们在网上买了票。"}]}],"synonyms":["compensated","remunerated","settled","repaid"],"phonetic":"/peɪd/","extraExplanation":["“paid”作形容词时，常见于职场语境：paid leave（带薪休假）、paid holiday（带薪假日/带薪休假日）、paid position（有薪职位）。","注意与“payed”区分：日常表示“付款”时过去式/过去分词几乎总是“paid”。“payed”主要用于航海等少数专业用法（如 pay out a rope 放出绳索）。"]}
{"word":"paideia","summary":{"en":"Paideia means the ideal of forming a well-rounded person through education and culture, especially in ancient Greece; today it can also mean broad humanistic (liberal arts) education.","zh":"Paideia 指通过教育与文化陶冶来培养“全面的人”的理念，源自古希腊；现代也可指强调人文素养与批判思维的博雅/文理教育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Greece) the ideal education and cultural upbringing that forms a well-rounded person—training the mind, character, and civic responsibility.","zh":"（古希腊）“理想的教育与文化陶冶”，强调培养全面的人：知识、品格与公民责任。"},"examples":[{"en":"In Greek thought, paideia was not just schooling; it was a way of shaping a citizen’s character.","zh":"在希腊思想中，paideia 不只是上学，更是一种塑造公民品格的方式。"},{"en":"The program aims to offer a modern paideia through reading, debate, and community service.","zh":"该项目希望通过阅读、辩论和社区服务提供一种现代版的 paideia（全面教育）。"}]},{"partOfSpeech":"n.","definition":{"en":"A modern term for a broad, humanistic education (often linked to the liberal arts) that emphasizes critical thinking, ethics, and culture.","zh":"现代用法：指一种广泛的人文教育（常与“博雅教育/文理教育”相关），强调批判性思维、伦理与文化素养。"},"examples":[{"en":"Some educators argue that paideia is essential in the age of AI because it strengthens judgment and values.","zh":"一些教育者认为在 AI 时代，paideia 依然重要，因为它能强化判断力与价值观。"},{"en":"Her writing defends paideia as a foundation for democracy and thoughtful public life.","zh":"她的文章捍卫 paideia，认为它是民主与理性公共生活的基础。"}]}],"synonyms":["classical education","liberal education","humanistic education","cultural formation"],"phonetic":"/paɪˈdiə/","extraExplanation":["词源来自希腊语 παιδεία（paideia），与“孩子/教育”有关；核心不只是“学知识”，而是“人成其为人”的整体培养。","在古典语境里，paideia 常与公民生活相连：一个受过良好 paideia 的人，应能参与公共讨论、承担社会责任。","在英文写作中它常出现在古典学、教育学、政治哲学讨论里；有时会提到柏拉图、亚里士多德等关于“理想公民与教育”的思想传统。"]}
{"word":"paideutic","summary":{"en":"Paideutic means educational or formative, especially in the classical Greek sense of shaping character and culture.","zh":"Paideutic 指“教育陶冶性的”，尤强调古希腊式对人格与文化素养的培养。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to education or the process of forming a person’s character and culture (especially in the classical Greek sense).","zh":"与教育有关的；（尤指古希腊意义上的）人格、文化与素养的培养过程相关的。"},"examples":[{"en":"The author argues that reading classics has a paideutic value beyond job training.","zh":"作者认为，阅读经典著作具有超越职业培训的教育陶冶价值。"},{"en":"In philosophy classes, “paideutic” often refers to learning that shapes how you live, not just what you know.","zh":"在哲学课里，“paideutic”常指塑造生活方式的学习，而不只是增加知识。"}]},{"partOfSpeech":"adj.","definition":{"en":"Serving as instruction; intended to teach or guide (a rarer, more formal use).","zh":"具有教导作用的；用于指导或启发的（较少见、较正式的用法）。"},"examples":[{"en":"The professor’s paideutic remarks helped students connect theory with practice.","zh":"教授带有启发性的指导性评论帮助学生把理论与实践联系起来。"}]}],"synonyms":["educational","formative","instructional","cultivating","character-building"],"phonetic":"/paɪˈdjuːtɪk/","extraExplanation":["“paideutic”来源于希腊语 paideia（常译为“教化/陶冶/教育理想”），在古希腊不仅指学校教育，还强调通过文学、哲学、体育与公民生活来塑造人的品格与公共责任。","这个词在现代英语里比较罕见，更多见于人文、古典学、教育哲学或神学写作中；日常表达通常用 “educational”、 “formative” 或 “character-building”。","相关概念常与“liberal education（博雅教育）”“Bildung（德语：陶冶/自我形成）”等并读，用来强调“成为怎样的人”而不仅是“学会什么技能”。"]}
{"word":"paideutics","summary":{"en":"Paideutics means the theory or study of education (a rare, academic word, close to “pedagogy”).","zh":"Paideutics 指“教育学/教育理论与方法”，是较少见、偏学术的词，意思接近 pedagogy。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or theory of education; principles and methods of teaching (similar to “pedagogy”).","zh":"教育学；关于教育的理论与方法（类似 pedagogy“教学法/教育学”）。"},"examples":[{"en":"Her research focuses on paideutics in classical Greece and what it can teach modern schools.","zh":"她的研究聚焦古希腊的教育学思想，以及它能给现代学校带来的启示。"},{"en":"The book is less about classroom tips and more about paideutics—what education is for.","zh":"这本书与其说提供课堂技巧，不如说讨论教育学：教育的目的是什么。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) educational training or upbringing; the act of educating.","zh":"（罕见）教育培养；教养；进行教育的过程。"},"examples":[{"en":"He credited his early paideutics to his grandparents’ love of reading.","zh":"他把早期的教养归功于祖父母对阅读的热爱。"}]}],"synonyms":["pedagogy","educational theory","education","instruction","didactics"],"phonetic":"/paɪˈduːtɪks/","extraExplanation":["词源背景：paideutics 来自希腊语词根 *paideia*（教育、教养、文化修养），在讨论“古典教育/人文教育”或教育哲学时更常见。日常英语里更常用 **education**（教育）或 **pedagogy**（教育学/教学法）。","使用提醒：它形式上像复数（-s 结尾），但通常当作一个不可数概念来用；在学术语境中出现较多。"]}
{"word":"paidle","summary":{"en":"“Paidle” is likely a misspelling of “paddle,” meaning a boat oar or the action of moving through water with one.","zh":"“paidle” 很可能是 “paddle” 的拼写错误，意思是“桨”，或“用桨划水/（在浅水处）拨水前进”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most likely) a short flat tool used to move a small boat through water, or the act of moving a boat this way.","zh":"（最可能的意思）桨；或用桨划（水上）移动小船的动作。"},"examples":[{"en":"He grabbed a paddle and pushed the canoe away from the shore.","zh":"他拿起桨，把独木舟从岸边推开。"},{"en":"We paddled across the lake before sunset.","zh":"我们在日落前划船穿过了湖面。"}]},{"partOfSpeech":"v.","definition":{"en":"to move a small boat through water using a paddle; to move your hands or feet through water while swimming slowly.","zh":"用桨划（船）；（游泳时）用手脚缓慢拨水前进。"},"examples":[{"en":"They paddled down the river for two hours.","zh":"他们沿着河划了两个小时。"},{"en":"The kids paddled in the shallow water near the beach.","zh":"孩子们在海边的浅水区戏水。"}]},{"partOfSpeech":"n.","definition":{"en":"a flat tool (often wooden) used to mix or stir something, such as food or clay.","zh":"（搅拌用的）木勺/搅拌板；（如搅拌食物或陶泥的）扁平工具。"},"examples":[{"en":"Use a wooden paddle to stir the sauce.","zh":"用木制搅拌板来搅拌酱汁。"}]}],"synonyms":["oar","row (close in meaning)","stirrer"],"phonetic":"/ˈpæd(ə)l/","extraExplanation":["“paidle” 不是常见的标准英语拼写；最接近、最常用的单词通常是 “paddle”。如果你想表达“已经付钱”的意思，则可能想写 “paid”（pay 的过去式/过去分词）。你可以告诉我你的句子，我能帮你确认正确用法与拼写。"]}
{"word":"paidological","summary":{"en":"“Paidological” means related to the scientific study of children and their development.","zh":"“paidological”指与儿童学/儿童研究（尤其是儿童发展研究）相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to paidology (the scientific study of children, especially their development, behavior, and education).","zh":"与“儿童学/儿童研究（paidology）”有关的；研究儿童（发展、行为、教育等）的。"},"examples":[{"en":"The article takes a paidological approach to early childhood learning.","zh":"这篇文章用一种“儿童学/儿童研究”的视角来探讨幼儿学习。"},{"en":"Paidological findings helped shape the school’s new child-development program.","zh":"儿童研究方面的发现帮助学校制定了新的儿童发展项目。"}]}],"synonyms":["child-development","developmental (psychology)","pediatric (context-dependent)"],"phonetic":"/ˌpeɪdəˈlɑːdʒɪkəl/","extraExplanation":["“paidological”比较少见，多出现在较早期或较学术的语境中。更常见的相关词是：child development（儿童发展）、developmental psychology（发展心理学）、pediatrics（儿科）。","注意别和拼写很像的词混淆：\n- pedological：与土壤学（soil science）有关（不是“儿童”）。\n- pedagogical：与教学法、教育学有关（teaching methods）。\n“paid-”来自希腊语 pais / paidos（孩子），而“pedo-”在英语里既可能指“孩子”（源头相同），也常被误解或带有敏感联想，因此在正式写作中很多人更倾向用更明确的表达（如 child-development research）。"]}
{"word":"paidologist","summary":{"en":"A paidologist is someone who studies children and child development (an older/rare term today).","zh":"paidologist 指研究儿童及其发展的学者（现代较少用的旧术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialist who studies children—their development, behavior, learning, or growth (a researcher or expert in “paidology,” an older term for the scientific study of children).","zh":"研究儿童的专家——关注儿童的发展、行为、学习或成长（“paidology/儿童学”是较早期用来指儿童科学研究的术语）。"},"examples":[{"en":"In the early 1900s, some paidologists tried to use new psychological tests to understand how children learn.","zh":"在20世纪初，一些儿童学研究者（paidologists）尝试用新的心理测验来了解孩子如何学习。"},{"en":"The article described the paidologist as a researcher of child development rather than a medical doctor.","zh":"文章把这位儿童学研究者（paidologist）描述为儿童发展研究者，而不是医学医生。"}]}],"synonyms":["child development researcher","developmental psychologist","child psychologist (sometimes)"],"phonetic":"/peɪˈdɑlədʒɪst/","extraExplanation":["“paidologist”来自希腊语词根 *pais/paidos*（儿童）+ *-logist*（研究者）。它常见于19世纪末到20世纪初的教育学、心理学史语境中；现代英语里更常用的说法是 *child development researcher*（儿童发展研究者）、*developmental psychologist*（发展心理学家）等。","注意不要和 *pediatrician*（儿科医生）混淆：儿科医生是医学职业；paidologist更偏向学术研究/教育与心理领域。"]}
{"word":"paidology","summary":{"en":"Paidology is an older term meaning the scientific study of children and child development.","zh":"Paidology 指“儿童学”，是较旧的说法，表示对儿童及其发展的科学研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of children, especially child development and behavior (an older, less common term).","zh":"儿童学；对儿童（尤其是儿童发展与行为）的科学研究（较旧、较少用的词）。"},"examples":[{"en":"In early 20th-century writings, some researchers used paidology to describe the emerging study of child development.","zh":"在20世纪早期的一些著作中，研究者用 paidology 来指代正在兴起的儿童发展研究。"},{"en":"Today, fields like developmental psychology and pediatrics have largely replaced the term paidology.","zh":"如今，“发展心理学”和“儿科学”等领域基本取代了 paidology 这个说法。"}]}],"synonyms":["child study","child development","developmental psychology","pediatrics"],"phonetic":"/paɪˈdɑlədʒi/","extraExplanation":["这个词较罕见，更多出现在历史文献里。现代英语通常用 developmental psychology（发展心理学）、child development（儿童发展研究）或 pediatrics（儿科学）来表达类似概念。","词源来自希腊语 pais/paid-（孩子）+ -logy（学科、研究）。注意不要和 pedology 混淆：pedology 在现代更常指“土壤学”。"]}
{"word":"paidonosology","summary":{"en":"Paidonosology is the study and classification of diseases in children.","zh":"Paidonosology 指对儿童疾病进行研究与系统分类的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and classification (systematic listing) of diseases in children; pediatric nosology.","zh":"儿童疾病分类学；研究并系统分类儿童疾病的学科（儿科疾病分类/儿科病名学）。"},"examples":[{"en":"Paidonosology focuses on how illnesses in children are grouped and named.","zh":"Paidonosology 关注儿童疾病如何被归类和命名。"},{"en":"In a research paper, the author discussed paidonosology to clarify which disorders belong under each pediatric category.","zh":"在一篇研究论文中，作者讨论了 paidonosology，以澄清哪些疾病应归入各个儿科类别。"}]}],"synonyms":["pediatric nosology","classification of pediatric diseases","pediatric disease taxonomy"],"phonetic":"/ˌpaɪdoʊnəˈsɑlədʒi/","extraExplanation":["这是一个非常少见、偏学术的词，更多出现在医学史、分类学或术语学语境中。日常英语里通常会说 “pediatric classification of diseases” 或 “pediatric nosology”。","词源可拆为：paido-（来自希腊语，意为“儿童”）+ nosology（疾病分类学）。理解词根能帮助你推断意思：看到 -nosology 往往与“疾病分类/病名体系”有关。"]}
{"word":"Paier","summary":{"en":"“Paier” is not a standard English word; it is usually a misspelling of “payer” or “pair.”","zh":"“Paier”不是标准英语词，通常是“payer（付款人）”或“pair（一对）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard in modern English.) Most often a misspelling of “payer” (a person who pays) or “pair” (two things together).","zh":"（现代英语中不常见/非标准拼写。）通常是把“payer”（付款人）或“pair”（一对/两个）拼错了。"},"examples":[{"en":"I think “paier” here should be “payer,” meaning the person who pays the bill.","zh":"我觉得这里的“paier”应该是“payer”，意思是付账的人。"},{"en":"If you mean two of something, the correct spelling is “pair,” not “paier.”","zh":"如果你想表达“两件/一双”，正确拼写是“pair”，不是“paier”。"}]},{"partOfSpeech":"n.","definition":{"en":"(If intended as “payer”) A person or organization that pays money, especially for a service, bill, or insurance plan.","zh":"（若你想写的是“payer”）付款人；支付方（尤指支付服务费、账单、保险费用的一方）。"},"examples":[{"en":"The payer must sign the form before we can process the refund.","zh":"付款人必须签字，我们才能处理退款。"},{"en":"In health insurance, the payer covers part of the medical cost.","zh":"在医疗保险中，支付方会承担部分医疗费用。"}]},{"partOfSpeech":"n.","definition":{"en":"(If intended as “pair”) Two things that are the same or used together.","zh":"（若你想写的是“pair”）一对；两个（同类的东西或一起使用的东西）。"},"examples":[{"en":"I bought a pair of shoes.","zh":"我买了一双鞋。"},{"en":"They are a perfect pair for this project.","zh":"他们是做这个项目的绝佳搭档。"}]}],"synonyms":["payer","pair"],"phonetic":"/ˈpeɪər/","extraExplanation":["“Paier”有时也会出现在人名/姓氏里（如某些欧洲姓氏的拼写变体）。如果你是在表格、合同或账号信息里看到它，可能不是英语单词而是专有名词。你可以告诉我它出现的句子或场景，我可以帮你判断更准确的意思。"]}
{"word":"paier","summary":{"en":"“Paier” is not standard; it usually means “payer,” the person or organization that pays.","zh":"“paier”不是标准拼写；通常指“payer”，即付款的人或机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard spelling) “paier” is not a common standard English word. It is most often a misspelling of “payer” (the person who pays).","zh":"（非标准拼写）“paier”不是常见的标准英文单词，最常见是把“payer”（付款的人/支付方）拼错了。"},"examples":[{"en":"If you mean “payer,” the payer is responsible for the fee.","zh":"如果你想表达“payer”，那么payer（付款方）需要负责这笔费用。"},{"en":"Please check the spelling: it’s usually “payer,” not “paier.”","zh":"请检查拼写：通常是“payer”，不是“paier”。"}]},{"partOfSpeech":"n.","definition":{"en":"payer: a person or organization that pays money, especially for a service, bill, or benefit.","zh":"payer：付款的人或机构；（尤指）支付服务费、账单或福利费用的一方。"},"examples":[{"en":"The payer must sign the form before payment is processed.","zh":"付款方必须先签署表格，付款才能处理。"},{"en":"In insurance, the payer may be the company, not the patient.","zh":"在保险中，payer可能是保险公司，而不是病人本人。"},{"en":"Taxpayers are payers of taxes to the government.","zh":"纳税人（taxpayers）是向政府缴税的付款方。"}]}],"synonyms":["payor","payer (correct spelling)","paying party"],"phonetic":"/ˈpeɪər/","extraExplanation":["“payer”来自动词“pay”（支付）+ 表示“做这件事的人/物”的后缀“-er”。","容易混淆的拼写：英语里 /eɪ/ 这个音常见拼法有“ay”（pay）、“ai”（pain）、“ei”（eight）。但“payer”固定拼成“pay+er”。"]}
{"word":"paigle","summary":{"en":"“Paigle” is usually a surname or a nonstandard spelling, not a common English word.","zh":"“Paigle”通常是姓氏或非标准拼写，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare spelling that is most often seen as a family name (surname) or a misspelling of similar-looking words (such as “Paige” or “pagle”). It is not a standard English vocabulary word.","zh":"一种较少见的拼写，通常作为姓氏出现，或是对外形相近词（如“Paige”或“pagle”）的误拼；它不是常见的英语词汇。"},"examples":[{"en":"Dr. Paigle will speak at the conference tomorrow.","zh":"Paigle 医生将在明天的会议上发言。"},{"en":"I think you meant “Paige,” not “paigle.”","zh":"我觉得你想写的是“Paige”，不是“paigle”。"}]}],"phonetic":"/ˈpeɪɡəl/","extraExplanation":["“Paigle”在英语里不算常见单词，更像是人名/姓氏的拼写。若你是在查词义，请提供一句原句或说明是人名、地名还是要找相近词，我可以帮你准确判断。","如果你想表达类似发音/拼写的词，常见的有：Paige（常见人名）、pagle（指一种鱼名，但很少见）。"]}
{"word":"paijama","summary":{"en":"Pajamas are comfortable clothes you wear for sleeping (often said as “pajamas” in plural).","zh":"pajamas 指睡觉穿的舒适衣服（英语中常用复数 pajamas）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Loose, comfortable clothes worn for sleeping; also called sleepwear.","zh":"（通常用复数）睡觉时穿的宽松舒适衣服；也叫睡衣。"},"examples":[{"en":"I changed into my pajamas after dinner.","zh":"晚饭后我换上了睡衣。"},{"en":"He wore warm pajamas on cold winter nights.","zh":"在寒冷的冬夜他会穿保暖的睡衣。"},{"en":"The kids had a pajama party with movies and snacks.","zh":"孩子们开了个睡衣派对，一起看电影吃零食。"}]}],"synonyms":["sleepwear","nightwear","pjs"],"phonetic":"/pəˈdʒɑːmə/","extraExplanation":["“paijama”常见为拼写错误，标准拼写是 **pajama**（美式）或 **pyjama**（英式）。","在英语里更常说 **pajamas**（复数）来表示“一套睡衣”；单数 **a pajama** 较少用，多出现在“a pajama top（一件睡衣上衣）/ a pajama set（一套睡衣）”等表达中。","词源来自南亚地区（如印地语/乌尔都语 *pāy-jāma*），原意与“腿部衣物/宽松裤子”有关，后来在英语中发展为“睡衣”。"]}
{"word":"paik","summary":{"en":"“Paik” is most commonly a romanized Korean surname (often also spelled Baek/Paek).","zh":"“Paik”最常见的是韩国姓氏的罗马拼写（也常写作 Baek/Paek）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Korean family name (surname), often written as Paik, Baek, or Paek in English.","zh":"韩国姓氏之一（常见罗马拼写为 Paik、Baek 或 Paek）。"},"examples":[{"en":"Nam June Paik is famous for pioneering video art.","zh":"白南准（Nam June Paik）以开创录像艺术而闻名。"},{"en":"Ms. Paik will join the meeting at 3 p.m.","zh":"Paik 女士将于下午三点参加会议。"}]},{"partOfSpeech":"other","definition":{"en":"a person’s name written as “Paik” (a romanized spelling used in some Korean names).","zh":"写作“Paik”的人名拼写（常见于部分韩文姓名的英语拼写）。"},"examples":[{"en":"Paik is his family name; Jiyoon is his given name.","zh":"Paik 是他的姓；Jiyoon 是他的名。"}]}],"synonyms":["Baek","Paek"],"phonetic":"/paɪk/","extraExplanation":["“Paik”通常对应韩文姓氏“백”。因为不同的罗马化（拼音化）系统与个人偏好，同一个韩文字可能出现 Baek / Paik / Paek 等拼写；发音在英语里常被读成类似 /paɪk/，但在韩语原音更接近“bek”（类似“贝克”的开头音）。","文化提示：在韩国姓名里，姓在前名在后；例如“Paik Nam-june”中 Paik 是姓。著名人物包括艺术家 Nam June Paik（白南准）。"]}
{"word":"paiked","summary":{"en":"“Paiked” is a Scots form meaning “walked/roamed (a long way),” the past tense of “paik.”","zh":"“paiked”多为苏格兰方言用法，意思是“走了很远/跋涉、到处走”，是“paik”的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots, informal) Past tense/past participle of “paik”: walked a long way; roamed or trudged about.","zh":"（苏格兰英语/方言，非正式）“paik”的过去式/过去分词：走了很远；四处闲逛或跋涉。"},"examples":[{"en":"We paiked all the way to the next village before dark.","zh":"天黑前我们一路走到了隔壁村子。"},{"en":"He paiked about town looking for work.","zh":"他在城里到处走，找工作。"}]}],"synonyms":["trudged","walked","hiked","roamed"],"phonetic":"/peɪkt/","extraExplanation":["“paiked”在标准英语里很少见，多见于苏格兰口语/文学方言（Scots）。如果你是在聊天、作业或字幕里看到“paiked”，很可能是在表达“走了很远/跋涉”这种感觉。","如果你的原词来自拼写检查或听写，“paiked”也常被误写为：\n- packed（打包/挤满）\n- parked（停车/停放）\n- piked（常见于“pike”相关含义，如“piked”=用长矛刺；或“turnpike”的相关用法）\n你可以把原句发我，我能帮你判断到底是哪一个意思。"]}
{"word":"paiker","summary":{"en":"“Paiker” is usually a misspelling of “piker,” meaning a stingy/cautious person, or something small and unimpressive (informal).","zh":"“paiker”通常是“piker”的非标准拼写，指吝啬/不敢冒险的人，或指小得可怜、不怎么样的事物（口语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled: piker) a person who is not willing to spend much money or take risks; a stingy or overly cautious person (informal).","zh":"（也常拼作 piker）不愿花钱或不愿冒险的人；吝啬或过于谨慎的人（非正式）。"},"examples":[{"en":"Don’t be a piker—just buy the ticket and come with us.","zh":"别这么抠门/别这么畏首畏尾——把票买了跟我们一起去吧。"},{"en":"He’s a real piker when it comes to tipping.","zh":"他在给小费这件事上特别抠。"}]},{"partOfSpeech":"adj.","definition":{"en":"small, weak, or not impressive (often used to criticize an amount, effort, or result; informal).","zh":"小得可怜的；不怎么样的（常用来批评数量、努力或结果；非正式）。"},"examples":[{"en":"They offered me a piker raise, so I started job hunting.","zh":"他们给我的加薪少得可怜，所以我开始找工作了。"},{"en":"That’s a piker excuse.","zh":"那是个很烂/很不成立的借口。"}]}],"synonyms":["cheapskate","skinflint","miser","tightwad","coward","small-time"],"phonetic":"/ˈpaɪkɚ/","extraExplanation":["“Paiker”并不是常见标准拼写；你很可能想查的是 **piker**。在美式英语里，piker 常带有口语、带点贬义的语气，用来批评人“太抠”或“胆小不敢下本”。","词源上常被认为与 *pike*（长矛/梭鱼）及早期俚语用法有关，但现代使用中更重要的是它的语气：偏口语、偏批评。"]}
{"word":"paiking","summary":{"en":"“Paiking” isn’t a standard word; it is usually a misspelling of “parking.”","zh":"“paiking”不是标准英文，通常是把“parking（停车/停车场）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) likely meant “parking”: the act or place of leaving a vehicle for a time.","zh":"（常见拼写错误）多半想写“parking”：指停车这一行为，或停车的地方。"},"examples":[{"en":"There’s no parking on this street after 6 p.m.","zh":"这条街晚上6点后禁止停车。"},{"en":"The parking lot is full, so we need to find another place.","zh":"停车场满了，所以我们得找别的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"“Parking” used as an adjective: related to parking or a place to park.","zh":"“parking”作形容词：与停车有关的；用于停车的。"},"examples":[{"en":"Do you have a parking permit?","zh":"你有停车许可证吗？"},{"en":"We couldn’t find a parking space.","zh":"我们找不到停车位。"}]}],"synonyms":["car park","parking lot","parking area"],"phonetic":"/ˈpɑrkɪŋ/","extraExplanation":["“paiking”不是标准英文单词，最常见是把“parking”拼错了（少写了r）。如果你想表达“徒步旅行/远足”，可能是“hiking”；如果想表达“达到最高点”，可能是“peaking”。你可以告诉我句子原文，我能更准确判断。"]}
{"word":"paiks","summary":{"en":"“Paiks” is usually a misspelling of “pikes,” meaning either long spears or the fish called pike.","zh":"“paiks”通常是“pikes”的误拼，意思多为长矛（长枪）或名为狗鱼（pike）的一种鱼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling of “pikes” (the plural of “pike”), usually seen as a typo or an informal/phonetic spelling.","zh":"“pikes”的非标准拼写（通常是拼写错误或按读音写法）；“pike”的复数。"},"examples":[{"en":"I think “paiks” is a typo—did you mean “pikes”?","zh":"我觉得“paiks”可能是拼写错误——你是不是想写“pikes”？"},{"en":"The recipe says “paiks,” but it probably means “pikes” (a kind of fish).","zh":"食谱里写“paiks”，但很可能是指“pikes”（一种鱼）。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of pike: a long spear-like weapon, or a type of fish (the northern pike).","zh":"“pike”的复数：可指长矛/长枪一类武器；也可指一种鱼（狗鱼/北方狗鱼）。"},"examples":[{"en":"In the museum, you can see soldiers’ pikes from the 1600s.","zh":"在博物馆里，你能看到17世纪士兵用的长矛。"},{"en":"Pikes are freshwater fish known for their sharp teeth.","zh":"狗鱼是淡水鱼，以牙齿锋利著称。"}]}],"synonyms":["pikes"],"phonetic":"/paɪks/","extraExplanation":["“paiks”在标准英语词典里通常不会作为独立词条出现；多数情况下是把“pikes”拼错了。","如果你是在特定语境里看到“Paiks”（首字母大写），它也可能是姓氏或品牌名；给我一句原句我可以帮你判断更准确的意思。"]}
{"word":"pail","summary":{"en":"A pail is a (usually handled) bucket, or the amount it holds.","zh":"pail 指（通常带提手的）桶，也可指一桶的量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bucket; a container with an open top, usually with a handle, used for carrying liquids or other materials.","zh":"桶；（通常带提手的）开口容器，用来装水或搬运其他材料。"},"examples":[{"en":"She carried a pail of water from the well.","zh":"她从井里提了一桶水。"},{"en":"Please fill the pail with sand for the kids.","zh":"请把桶装满沙子给孩子们玩。"}]},{"partOfSpeech":"n.","definition":{"en":"The amount that a pail can hold; a bucketful.","zh":"一桶的量；一桶（的容量）。"},"examples":[{"en":"Add two pails of water to the cement mix.","zh":"往水泥混合物里加两桶水。"}]}],"synonyms":["bucket","container","tub"],"phonetic":"/peɪl/","extraExplanation":["“pail”和“bucket”意思非常接近，但“pail”更常让人联想到较小、较轻、带提手的桶（如打水、清洁用）。在美式英语里“bucket”更常见；“pail”带一点日常/传统的感觉。","常见固定搭配：a pail of water（一桶水）；milk pail（牛奶桶）。另外，“kick the bucket”是“去世”的俚语，但这里用的是“bucket”而不是“pail”。"]}
{"word":"paile","summary":{"en":"“Pail” means a bucket with a handle.","zh":"“Pail”指带提手的桶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bucket, usually with a handle, used for carrying liquids or other materials","zh":"（通常带提手的）桶；提桶，用来装水或其他东西"},"examples":[{"en":"She filled a pail with water from the well.","zh":"她从井里打了一桶水。"},{"en":"Please rinse the paintbrush in the pail.","zh":"请把刷子在桶里涮一涮。"}]}],"synonyms":["bucket"],"phonetic":"/peɪl/","extraExplanation":["“paile”通常不是标准英语单词；最常见的情况是把“pail”（桶）拼错了。","“pail”在美式英语里常见于日常场景（如装水、装清洁用品），也常出现在“a pail of milk / sand / water”等搭配中。"]}
{"word":"pailette","summary":{"en":"Pailette (more commonly spelled paillette) means a small decorative sequin-like disc sewn onto fabric.","zh":"pailette（更常见拼写为 paillette）指缝在布料上的小装饰亮片，类似 sequin。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shiny disc (often metal or plastic) sewn onto clothing or fabric for decoration; a sequin","zh":"（缝在衣物或布料上的）小亮片；装饰片（常为金属或塑料）；亮片（同 sequin）"},"examples":[{"en":"Her dress was covered in silver paillettes that caught the light.","zh":"她的裙子上缀满银色亮片，在灯光下闪闪发光。"},{"en":"The designer added a row of paillettes along the collar.","zh":"设计师在领口沿边加了一排亮片。"}]}],"synonyms":["sequin","spangle"],"phonetic":"/peɪˈjɛt/","extraExplanation":["“pailette”常见为拼写变体或误拼，更标准的拼写是 **paillette**（也可直接用更常见的 **sequin**）。","词源上来自法语 *paillette*，本义与“稻草碎片/薄片”有关，后来引申为“闪亮装饰片”。在时尚语境里偏书面或偏“设计师用语”，日常英语里更常说 **sequins**。"]}
{"word":"pailful","summary":{"en":"A noun meaning “a full pail; the amount a pail can hold.”","zh":"名词：一桶的量；满满一桶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The amount that a pail (bucket) can hold; a full pail.","zh":"一桶（提桶）之量；满满一桶。"},"examples":[{"en":"He carried a pailful of water back to the garden.","zh":"他提了一桶水回到花园。"},{"en":"Add a pailful of sand to the mix.","zh":"往混合料里加一桶沙子。"}]}],"synonyms":["bucketful","pail load"],"phonetic":"/ˈpeɪlˌfʊl/","extraExplanation":["“pailful”由“pail（桶）+ -ful（……的量）”构成，表示“装满一桶的量”。类似构词还有“handful（一把）”“spoonful（一勺）”“cupful（一杯）”。","在现代英语中，“bucketful”比“pailful”更常见；“pail”更容易让人联想到较小的提桶，或带有较传统/乡村的语感。"]}
{"word":"pailfuls","summary":{"en":"“Pailfuls” means “bucketfuls”—several pail-sized amounts.","zh":"“pailfuls”表示“几桶的量”，相当于“bucketfuls”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) The amount that fills a pail (bucket); bucketfuls.","zh":"（复数）一桶（提桶）装满的量；一桶桶。"},"examples":[{"en":"They carried pailfuls of water from the well.","zh":"他们从井里一桶桶地提水。"},{"en":"She added two pailfuls of sand to the mix.","zh":"她往混合物里加了两桶沙子。"}]}],"synonyms":["bucketfuls","pail loads","bucketloads"],"phonetic":"/ˈpeɪlˌfʊlz/","extraExplanation":["“pailful”=“pail + -ful”（表示“装满……的量”），复数通常写作“pailfuls”。在日常英语里，“bucketful(s)”更常见；“pailful(s)”略带乡村/劳动场景的感觉（如打水、喂牲口、园艺等）。"]}
{"word":"paillard","summary":{"en":"Paillard is a rare, old-fashioned word meaning “lewd/immoral,” used for a lecher or for vulgar sexual behavior or talk.","zh":"paillard 是较少见、偏旧式的词，表示“好色下流的/不道德的”，可指好色之徒，也可形容猥亵的言行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lewd or immoral person; a lecher (a rude, old-fashioned or literary insult)","zh":"好色、下流的人；淫荡之徒（粗鲁、较古老或文学用语的侮辱）"},"examples":[{"en":"The novelist describes him as a paillard who can’t stop making crude jokes.","zh":"小说家把他描写成一个下流之徒，停不下低俗玩笑。"},{"en":"She refused to work with a paillard who harassed people on set.","zh":"她拒绝与在片场骚扰他人的好色之徒共事。"}]},{"partOfSpeech":"adj.","definition":{"en":"lewd; sexually vulgar or indecent (describing speech, behavior, humor, etc.)","zh":"猥亵的；粗鄙下流的（形容言语、行为、笑话等）"},"examples":[{"en":"He was fired for paillard comments at a company dinner.","zh":"他因在公司晚宴上发表猥亵言论而被解雇。"},{"en":"The play avoids paillard humor and focuses on character and grief.","zh":"这部戏避免低俗下流的笑料，而聚焦人物与悲伤。"}]}],"synonyms":["lecher","dirty-minded person","degenerate","sleazy (informal)","lascivious (formal)"],"phonetic":"/ˈpaɪ.ərd/","extraExplanation":["“paillard”源自法语，传统上带有强烈的道德谴责色彩，语气接近“下流胚/色鬼”。在现代英语里比较少见，常见于较文学化或带讽刺的语境。","使用时要注意语域：它比“flirt（调情者）”更重、更具攻击性，通常指令人反感的性骚扰、猥亵言语或行为。"]}
{"word":"paillasse","summary":{"en":"Paillasse means a clown/buffoon in traditional European theater; less commonly, it can mean a laboratory workbench (from French).","zh":"Paillasse可指传统欧洲戏剧中的小丑/滑稽角色；较少见地也可指实验室工作台（源自法语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clown or buffoon character, especially in older French/European theater (similar to a “comic clown” in pantomime).","zh":"（尤指旧时法语/欧洲戏剧中的）小丑、滑稽角色（类似哑剧里的搞笑小丑）。"},"examples":[{"en":"In the comedy, the paillasse keeps interrupting the serious scene with silly jokes.","zh":"在这出喜剧里，那个paillasse不断用傻笑话打断严肃场面。"},{"en":"The actor played the paillasse with exaggerated makeup and clumsy movements.","zh":"那位演员用夸张的妆容和笨拙的动作来演paillasse。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) a laboratory workbench; a lab bench (used mainly in French contexts).","zh":"（英语中较少见）实验室工作台；实验台（多见于法语语境）。"},"examples":[{"en":"The technician placed the samples on the paillasse before labeling them.","zh":"技术员把样品放到实验台（paillasse）上再贴标签。"},{"en":"Keep the chemicals organized on the paillasse.","zh":"把化学品在实验台（paillasse）上整理好。"}]}],"synonyms":["clown","buffoon","jester","comic"],"phonetic":"/paɪˈlæs/","extraExplanation":["“paillasse”是法语借词。在法语里常指“实验台/工作台”；在戏剧语境中也可指“滑稽小丑”。英语里更常见的是戏剧意义（小丑角色），而“实验台”意义通常出现在引用法语或法式实验室用语时。","相关文化提示：在欧洲传统喜剧/哑剧里，小丑角色常用夸张动作、插科打诨来制造反差与笑点。"]}
{"word":"pailles","summary":{"en":"“Pailles” is a French plural noun meaning “straw(s)” or “drinking straw(s),” depending on context.","zh":"“Pailles” 是法语复数名词，意思是“稻草/麦秆”或“吸管”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) plural of *paille*: straw (the dry stems of grain plants), or drinking straws.","zh":"（法语）*paille* 的复数：稻草/麦秆；也可指（喝饮料用的）吸管。"},"examples":[{"en":"In French, *pailles* can mean straws used for drinking or straw from wheat.","zh":"在法语里，*pailles* 既可以指吸管，也可以指小麦等作物的麦秆（稻草）。"},{"en":"Could I have two straws? → *Je peux avoir deux pailles ?*","zh":"我可以要两根吸管吗？→ *Je peux avoir deux pailles ?*"}]}],"synonyms":["straws","straw"],"phonetic":"/pɑj/","extraExplanation":["注意：在法语中复数 *pailles* 的发音通常和单数 *paille* 一样，结尾的 -s 不发音。","语境区分很重要：在餐饮场景里 *paille(s)* 常指“吸管”；在农业/材料语境里常指“稻草、麦秆”。"]}
{"word":"paillette","summary":{"en":"A paillette is a shiny decorative sequin/spangle (often larger) or a small glittering flake.","zh":"paillette 指亮片（常指较大的亮片）或用于闪光效果的细小闪亮薄片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shiny decorative piece (often a flat, round disc of metal or plastic), sewn onto clothing; a sequin or spangle (often used for larger sequins in fashion).","zh":"（常指缝在衣服上的）亮片、金属/塑料小圆片装饰；类似 sequin（亮片）或 spangle（闪片）（在时尚语境里常指较大的亮片）。"},"examples":[{"en":"Her dress was covered with silver paillettes that caught the light.","zh":"她的裙子上缀满了银色亮片，一照光就闪闪发亮。"},{"en":"The costume designer added paillettes along the collar for extra sparkle.","zh":"服装设计师在领口加了一圈亮片，让它更闪。"},{"en":"Try not to iron directly on the paillettes—they can melt.","zh":"熨烫时尽量别直接烫到亮片——它们可能会融化。"}]},{"partOfSpeech":"n.","definition":{"en":"a tiny shiny flake or fragment, especially one used to create a glittering effect.","zh":"（尤指用于制造闪光效果的）细小闪亮薄片、碎片。"},"examples":[{"en":"Under the stage lights, paillettes of glitter drifted through the air.","zh":"在舞台灯光下，细小的闪粉薄片在空气中飘散。"},{"en":"The craft glue held the paillettes in place on the paper star.","zh":"手工胶把那些闪亮小薄片固定在纸星星上。"}]}],"synonyms":["sequin","spangle","glitter","confetti","sparkle"],"phonetic":"/paɪˈlɛt/","extraExplanation":["“Paillette”是法语外来词，来自法语 paille（“稻草”）的引申义，带有“细小闪亮片状物”的感觉。在英语里多见于时尚、戏服、舞台服装与手工艺语境。","与更常见的 sequin 相比，paillette 在一些时尚写作中常被用来指“较大、存在感更强的亮片”，但日常英语里两者常可互换。"]}
{"word":"pailletted","summary":{"en":"“Pailletted” means decorated with sequins/paillettes—shiny little discs on fabric.","zh":"“pailletted”指“缀有亮片的”，常用于描述衣物或布料上装饰了闪亮小圆片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"decorated or covered with small shiny discs (paillettes/sequins), especially on clothing or fabric","zh":"（尤指衣物或布料）缀有亮片的；装饰有小圆亮片（paillettes/sequins）的"},"examples":[{"en":"She wore a pailletted dress that caught the light with every step.","zh":"她穿着一件缀有亮片的连衣裙，每走一步都闪闪发光。"},{"en":"The costume designer chose pailletted fabric for the stage so it would sparkle under spotlights.","zh":"服装设计师为舞台选了缀亮片的布料，好让它在聚光灯下闪耀。"}]}],"synonyms":["sequined","spangled","sparkly","glittering"],"phonetic":"/pæɪˈjɛtɪd/","extraExplanation":["“Pailletted”来自法语“paillette”（小片金属箔/亮片），在英语里多用于时尚与戏服语境，意思接近更常见的“sequined”（缀亮片的）。","拼写提示：也常见写法“pailleted”（一个 t），两种拼写都能见到；但在日常英语里，“sequined”更普遍、更容易被理解。"]}
{"word":"paillettes","summary":{"en":"Paillettes are small shiny decorative pieces—like sequins—often used on clothes or costumes.","zh":"Paillettes 指用于衣服或舞台服装上的小亮片（类似 sequins）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small shiny pieces (like sequins) used to decorate clothing, costumes, or fabric; sometimes also used to mean glittery confetti","zh":"（装饰衣服或布料的）亮片、珠片；有时也指闪亮的彩纸碎屑（类似亮粉/彩屑）"},"examples":[{"en":"Her dress was covered in silver paillettes that caught the light.","zh":"她的裙子上缀满了银色亮片，在灯光下闪闪发亮。"},{"en":"The costume designer added paillettes to make the jacket look more festive.","zh":"服装设计师在夹克上加了亮片，让它看起来更喜庆。"}]}],"synonyms":["sequins","glitter (sometimes)","confetti (sometimes)"],"phonetic":"/paɪˈɛts/","extraExplanation":["“paillettes”来自法语“paillette”（小片稻草/小薄片），在时尚语境里常指衣物上的“亮片、珠片”。英语里也有人直接用法语复数“paillettes”，尤其出现在时装、舞台服装、化妆造型等领域。","在日常英语中，更常见的说法是“sequins（亮片）”。如果你想表达“亮粉/闪粉”，通常用“glitter”；表达“彩纸屑”，常用“confetti”。"]}
{"word":"paillon","summary":{"en":"Paillon can mean a straw mattress (a simple straw bed), and it is also a French place name (the Paillon River/Valley).","zh":"Paillon 可指“稻草床垫/稻草铺床”，也可作法国地名（帕永河/帕永谷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly Canadian English; from French) A straw mattress or straw-filled sleeping pad; a simple pallet made of straw.","zh":"（主要见于加拿大英语，源自法语）稻草床垫；用稻草填充的简易睡垫/铺床。"},"examples":[{"en":"They slept on a paillon on the cabin floor.","zh":"他们在小屋地板上铺着稻草床垫睡觉。"},{"en":"In the old days, a paillon was a cheap way to make a bed.","zh":"过去，稻草床垫是一种便宜的做床方式。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name for places in France, especially the Paillon River and the Paillon Valley near Nice.","zh":"法国的地名专名，尤指尼斯附近的帕永河（Paillon River）与帕永谷（Paillon Valley）。"},"examples":[{"en":"The Paillon runs through the area near Nice.","zh":"帕永河流经尼斯附近地区。"}]}],"synonyms":["straw mattress","pallet","straw bed"],"phonetic":"/paɪˈjɑn/","extraExplanation":["“Paillon”（稻草床垫）来自法语 *paill(on)*，与 *paille*（稻草）同源。在英语中属于较少见的借词，多出现在法裔加拿大历史、民俗或旧时代生活描写里。","地名 Paillon 通常按法语习惯读，英语里常用近似读音；在旅游或地理语境中更常见。"]}
{"word":"paillons","summary":{"en":"Paillons are tiny pieces of metallic foil used under transparent enamel (especially in jewelry) to add sparkle or pattern.","zh":"Paillons 指用于珠宝/珐琅工艺的细小金属箔片，放在透明珐琅下用来增加闪光或纹理效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Jewelry/enameling) Tiny pieces of metallic foil (often gold or silver) placed under transparent enamel or glass to create sparkle or a patterned shine.","zh":"（珠宝/珐琅工艺）放在透明珐琅或玻璃下面的细小金属箔片（常为金或银），用来产生闪光或图案般的光泽。"},"examples":[{"en":"The artist added gold paillons under the enamel to make the pendant shimmer.","zh":"艺术家在珐琅下加入金色 paillons，让吊坠更加闪耀。"},{"en":"In traditional enameling, paillons can create a delicate, lace-like effect.","zh":"在传统珐琅工艺中，paillons 能做出精致、像蕾丝一样的光泽效果。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of “paillon” (a French loanword); used mainly in craft contexts.","zh":"“paillon”的复数形式（法语借词）；主要用于手工艺语境。"},"examples":[{"en":"She ordered several sizes of paillons for her next enamel project.","zh":"她为下一个珐琅项目订了好几种尺寸的 paillons。"}]}],"synonyms":["metal foil","gold foil","silver foil","metal leaf","silver leaf"],"phonetic":"/paɪˈjɑn/","extraExplanation":["“Paillon(s)”来自法语，在英语里多见于珐琅（enameling）、珠宝与玻璃工艺圈子，不算日常高频词。常见做法是把金属箔片剪成小形状，放在透明珐琅层下面，通过反光形成“闪点/花纹”的视觉效果。","如果你是在普通英语文本里看到“paillons”，也可能是法语原文或专门术语；在一般英语里更常用的表达是 metal foil / gold foil / silver leaf（但这些不一定特指珐琅用的那种小片）。"]}
{"word":"pailolo","summary":{"en":"“Pailolo” most commonly refers to the Pailolo Channel in Hawaiʻi, an often-rough channel between Molokaʻi and Maui; it can also describe wild, turbulent conditions.","zh":"“Pailolo”最常指夏威夷的帕伊洛洛海峽（莫洛凱島與茂宜島之間、常風浪大）；也可引申形容狂烈、湍急的狀況。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Hawaiian; used mainly as a place name) the name of the Pailolo Channel, the ocean channel between the islands of Molokaʻi and Maui in Hawaiʻi, known for strong currents and rough seas.","zh":"（夏威夷語；多用作地名）“Pailolo”常指夏威夷的帕伊洛洛海峽（Pailolo Channel），位於莫洛凱島（Molokaʻi）與茂宜島（Maui）之間，以海流強、風浪大而聞名。"},"examples":[{"en":"The ferry route crosses the Pailolo Channel between Maui and Molokaʻi.","zh":"渡輪航線會穿越茂宜島與莫洛凱島之間的帕伊洛洛海峽。"},{"en":"Sailors respect the Pailolo Channel because the water can get rough quickly.","zh":"水手很敬畏帕伊洛洛海峽，因為海況可能很快就變得惡劣。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common; Hawaiian word sense) “wild, turbulent, crazy,” especially describing the sea or conditions.","zh":"（較少見；夏威夷語詞義）“狂烈的、湍急的、瘋狂的”，常用來形容海面或環境狀況。"},"examples":[{"en":"The weather turned pailolo, so we stayed near shore.","zh":"天氣變得很狂烈，所以我們待在近岸。"}]}],"synonyms":["Pailolo Channel"],"phonetic":"/paɪˈloʊloʊ/","extraExplanation":["「Pailolo」常被解釋為帶有「瘋狂、狂亂」的語感；在夏威夷地名中，常用來點出某地（特別是海域）的危險或多變。不同來源對其詞源拆解可能略有差異，但在現代使用上最常見的就是指「Pailolo Channel」。"]}
{"word":"pailoo","summary":{"en":"“Pailoo” means a traditional Chinese ceremonial archway or gateway (often spelled “pailou”).","zh":"“pailoo”指中国传统的牌楼/牌坊式门楼（英语中更常见拼作 pailou）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese ceremonial archway or gateway, often marking an entrance to a temple, neighborhood, or memorial area (also spelled “pailou”).","zh":"（中国传统）牌楼、牌坊；常见于寺庙、街区或纪念性建筑入口处的装饰性门楼（也常拼作 pailou）。"},"examples":[{"en":"We walked through a stone pailoo at the entrance to the old town.","zh":"我们从古镇入口处的一座石牌楼走了进去。"},{"en":"The park’s main gate is designed like a pailoo with carved columns.","zh":"公园的正门设计成牌楼样式，有雕刻的柱子。"}]}],"synonyms":["pailou","paifang","Chinese archway","ceremonial archway"],"phonetic":"/paɪˈloʊ/","extraExplanation":["“pailoo”在英语里属于较少见的拼写，更常见的是“pailou”或用更通用的说法“Chinese archway / ceremonial archway”。在中文里对应“牌楼/牌坊”，既可能是纪念性的（表彰功德、纪念人物），也可能是标志性的（作为街区、景区入口）。","如果你是在旅游介绍、建筑或历史语境中看到这个词，它通常指具有屋檐、匾额、雕刻装饰的中国式门楼。"]}
{"word":"pailou","summary":{"en":"A pailou is a traditional Chinese ornamental archway or gateway, often used as an entrance marker or memorial structure.","zh":"pailou 指中国传统的装饰性牌楼/牌坊，常作为入口标志或纪念性建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese ornamental archway or gateway, often built of stone, wood, or brick, usually marking the entrance to a temple, memorial site, street, or community.","zh":"（中国传统）牌楼；牌坊（常用石、木或砖建成的装饰性拱门/门楼，多用于寺庙、纪念地、街巷或社区入口的标志）。"},"examples":[{"en":"At the entrance of the old town, a tall pailou welcomed visitors.","zh":"在古镇入口处，一座高大的牌楼迎接着游客。"},{"en":"Many Chinese temples have a pailou that frames the main gate.","zh":"很多中国寺庙在山门前都有一座牌楼，用来衬托主入口。"},{"en":"The street was lined with red lanterns under the pailou.","zh":"牌楼下挂着一排排红灯笼，街道显得格外热闹。"}]}],"synonyms":["archway","gateway","paifang"],"phonetic":"/ˈpaɪˌloʊ/","extraExplanation":["“pailou（牌楼）”在英文里属于借词，常用于旅游、建筑与中国文化语境中；在学术或更常见的英语资料里也常见拼写“paifang（牌坊）”。","牌楼/牌坊不仅是装饰性建筑，也常具有纪念与象征意义：例如表彰功德、纪念人物或事件，或作为城市/街区入口的地标。"]}
{"word":"pailow","summary":{"en":"“Pailow” means a traditional Chinese decorative archway or gateway (often spelled pailou/paifang).","zh":"“pailow”指中国传统的装饰性牌楼/牌坊（常见拼法为 pailou/paifang）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese ornamental archway or gateway, often marking an entrance to a street, temple, cemetery, or memorial site (also spelled “pailou,” “paifang”).","zh":"（中国传统）牌楼/牌坊：一种装饰性拱门或门楼，常用于标示街区、寺庙、陵园或纪念地入口（也常拼作 pailou/paifang）。"},"examples":[{"en":"We walked under a pailow at the entrance to the old town.","zh":"我们从古镇入口的牌楼下面走过。"},{"en":"The temple’s pailow was covered with carved dragons and gold paint.","zh":"寺庙的牌楼上雕着龙纹，还涂着金色。"}]}],"synonyms":["paifang","pailou","archway","ornamental gateway","memorial arch"],"phonetic":"ˈpaɪˌloʊ","extraExplanation":["“pailow”在英语里不算最常见拼法，更常见的是 **pailou** 或 **paifang**（多来自中文普通话拼音/威妥玛等不同转写习惯）。","在英文旅游/建筑语境中，它通常指具有象征意义的“门面地标”，既可能是入口标记，也可能是纪念性建筑。"]}
{"word":"pails","summary":{"en":"“Pails” means buckets with handles (plural of “pail”).","zh":"“pails”指“水桶/提桶”，是“pail”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of pail) buckets—containers with a handle, used for carrying liquids (like water) or loose materials (like sand).","zh":"（pail 的复数）水桶；提桶——带把手的容器，用来装和提液体（如水）或散料（如沙子）。"},"examples":[{"en":"The kids carried pails of water to the garden.","zh":"孩子们提着一桶桶水去浇花园。"},{"en":"We built a sandcastle with plastic pails and shovels.","zh":"我们用塑料小桶和铲子堆了一个沙堡。"}]}],"synonyms":["buckets","containers","pails (plural)"],"phonetic":"/peɪlz/","extraExplanation":["“pails”是可数名词“pail”的复数形式；单数：a pail，复数：two/three pails。","常见搭配：a pail of water（一桶水）、a pail of paint（一桶油漆）、carry/haul pails（提/搬桶）。","在《One, two, buckle my shoe》等童谣或“Jack and Jill went up the hill… to fetch a pail of water”这类传统儿歌中常出现“pail of water（打一桶水）”，属于文化常识表达。"]}
{"word":"pailsful","summary":{"en":"Pailful means the amount that fits in one pail (bucket).","zh":"Pailful 指“一桶的量”，即装满一只水桶（提桶）的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quantity that fills one pail (bucket); a bucketful","zh":"一桶的量；一满桶"},"examples":[{"en":"He carried two pailfuls of water from the well.","zh":"他从井里提了两桶水。"},{"en":"Add a pailful of sand to the mix.","zh":"往混合物里加一桶沙子。"}]}],"synonyms":["bucketful","pail-load","a bucket of (informal)"],"phonetic":"/ˈpeɪlˌfʊl/","extraExplanation":["“pailsful”一般被视为不规范或拼写错误的复数形式。标准写法更常见的是：单数 **pailful**，复数 **pailfuls**（也有人用 **pailful** 作不变复数，但在现代英语里 **pailfuls** 更常用）。","**pail** 在美式英语里更常指“水桶/提桶”，在一些语境也可用 **bucket** 替换，更口语。"]}
{"word":"paimaneh","summary":{"en":"Paimaneh is a Persian-derived word meaning a cup/goblet or a measured portion (often of wine); more rarely it can mean a pledge or covenant in literary use.","zh":"Paimaneh 源自波斯语，主要指酒杯/酒盏或（常指酒的）定量一杯；更少见时在文学语境中可指誓约、盟约。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Persian) a cup or goblet; by extension, a measured portion (especially of wine or another drink).","zh":"（源自波斯语）酒杯、酒盏；引申为（尤指酒等饮品的）一杯/一份的定量。"},"examples":[{"en":"In the poem, he raises a paimaneh of wine to celebrate spring.","zh":"在诗中，他举起一盏（paimaneh）酒来庆祝春天。"},{"en":"The host offered each guest a paimaneh and a quiet blessing.","zh":"主人给每位客人奉上一杯（paimaneh），并轻声祝福。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a measure or standard amount; a fixed portion used in trade or cooking.","zh":"（较少见）度量单位；用于交易或烹饪的固定分量/标准量。"},"examples":[{"en":"Add one paimaneh of rice before you pour in the water.","zh":"倒水前先加入一份定量的米（paimaneh）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) a pledge or covenant; a bond made between people (related to the Persian root for “promise”).","zh":"（罕见，文学用法）誓约、盟约；人与人之间的约定（与波斯语中“承诺/约定”的词根相关）。"},"examples":[{"en":"They spoke of friendship as a paimaneh that should not be broken.","zh":"他们把友谊说成一种不该被打破的誓约（paimaneh）。"}]}],"synonyms":["cup","goblet","measure","portion","draft"],"phonetic":"/paɪˈmɑnə/","extraExplanation":["“paimaneh”（常见转写也有 *paymaneh / پیمانه*）在波斯诗歌里很常与“酒、酒杯、春天、宴饮、苏菲意象”一起出现，既可指真实的酒杯，也常带象征意味（如精神的陶醉、爱的渴望）。","在英文语境中它多见于翻译作品、学术写作或带异国风格的文学描写，并非日常英语常用词。日常表达更常用 *cup, goblet, measure, portion* 等。"]}
{"word":"pain","summary":{"en":"Pain can mean physical hurt, emotional suffering, or (informally) something annoying; it can also be a verb meaning “to cause suffering.”","zh":"pain 可指身体疼痛、情感痛苦，也可（口语）指麻烦事；作动词时表示“使痛苦/使难受”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"physical suffering or an unpleasant feeling in the body, often caused by injury or illness","zh":"（身体的）疼痛；痛感，常由受伤或疾病引起"},"examples":[{"en":"I have a sharp pain in my lower back.","zh":"我的下背部有一阵刺痛。"},{"en":"She took medicine to ease the pain.","zh":"她吃了药来缓解疼痛。"}]},{"partOfSpeech":"n.","definition":{"en":"emotional suffering; deep sadness, worry, or distress","zh":"（精神/情感的）痛苦；悲伤、焦虑或折磨"},"examples":[{"en":"He spoke openly about the pain of losing a friend.","zh":"他坦诚谈到失去朋友的痛苦。"},{"en":"Time can lessen the pain, but it may not disappear completely.","zh":"时间能减轻痛苦，但未必会完全消失。"}]},{"partOfSpeech":"v.","definition":{"en":"to cause someone physical or emotional suffering; to hurt","zh":"使（某人）疼痛或痛苦；伤害"},"examples":[{"en":"It pains me to see you so disappointed.","zh":"看到你这么失望，我很难受。"},{"en":"The memory still pained her years later.","zh":"多年后，那段回忆仍让她痛苦。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is very annoying or difficult (informal)","zh":"令人头疼的人/事；麻烦（非正式）"},"examples":[{"en":"Filling out these forms is a real pain.","zh":"填这些表格真是件麻烦事。"},{"en":"My old printer is such a pain to set up.","zh":"我那台旧打印机安装起来太折腾了。"}]}],"synonyms":["ache","hurt","suffering","distress","agony"],"phonetic":"/peɪn/","extraExplanation":["“pain”既可指身体疼痛，也常用于表达心理痛苦，因此在英语里很常见于文学与歌词中，用来突出失去、遗憾或创伤等情绪。","固定搭配：painkiller（止痛药）、in pain（疼痛中/痛苦中）、no pain, no gain（不吃苦就没有收获，常用于运动与学习语境）。"]}
{"word":"painch","summary":{"en":"“Painch” is not standard; it’s usually a misspelling of “pinch,” meaning to squeeze with fingers, a small amount, or a difficult/limited situation.","zh":"“painch”不是标准拼写，通常是“pinch”的误写；“pinch”可指用手指掐/捏、少量（一小撮）、或困难/拮据的处境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “painch” is not a standard English word. It is most often a misspelling of “pinch.”","zh":"（非标准）“painch”不是标准英语单词，最常见是把“pinch”拼错了。"},"examples":[{"en":"I think you meant “pinch,” not “painch.”","zh":"我想你想写的是“pinch”，不是“painch”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(pinch) to press something tightly between two fingers (often causing pain).","zh":"（pinch）用拇指和食指等把某物夹紧/掐住（常会疼）。"},"examples":[{"en":"Don’t pinch your little brother.","zh":"别掐你弟弟。"},{"en":"She pinched the fabric to check its thickness.","zh":"她用手指捏了一下布料，看看有多厚。"}]},{"partOfSpeech":"n.","definition":{"en":"(pinch) a painful squeeze made by pressing skin between fingers; also, a small amount (of something).","zh":"（pinch）掐/捏造成的疼痛；也指“一小撮/少量”（尤用于食盐等）。"},"examples":[{"en":"I felt a pinch on my arm.","zh":"我胳膊上感到一阵掐痛。"},{"en":"Add a pinch of salt.","zh":"加一小撮盐。"}]},{"partOfSpeech":"n.","definition":{"en":"(pinch, informal) a difficult situation or a time when resources (money, time) are limited.","zh":"（pinch，非正式）紧要关头；拮据/缺钱缺时间的困难时期。"},"examples":[{"en":"In a pinch, you can call me anytime.","zh":"紧要关头，你随时可以给我打电话。"},{"en":"We’re feeling the pinch because rent is higher.","zh":"因为房租涨了，我们手头更紧了。"}]}],"synonyms":["pinch","squeeze","nip (lightly)","a small amount","in a tight spot"],"phonetic":"/pɪntʃ/","extraExplanation":["“pinch of + 名词”在食谱里非常常见，表示“很少量”，通常不是精确计量（大约用两指捏起的量）。","“feel the pinch”是常用搭配，意思是“感到经济压力/日子变紧”，多用于物价上涨、收入减少等语境。"]}
{"word":"painches","summary":{"en":"“Painches” is likely a misspelling of “pinches,” meaning small squeezes with fingers or small amounts (e.g., a pinch of salt), and also “to pinch” can mean to squeeze or to press uncomfortably.","zh":"“painches”很可能是“pinches”的拼写错误，常指用手指轻捏/夹，也可指“少量（一小撮）”；动词“pinch”还可表示夹得疼、勒人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “pinches”) small squeezes or grips with your fingers, often using the thumb and another finger.","zh":"（通常拼作“pinches”）用手指（常为拇指和另一根手指）做的小幅度捏、夹。"},"examples":[{"en":"Add a pinch of salt to the soup.","zh":"在汤里加一小撮盐。"},{"en":"She gave his cheek a quick pinch.","zh":"她快速捏了一下他的脸颊。"}]},{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “pinch”) to press or squeeze something tightly between two fingers; to take a small amount using your fingers.","zh":"（动词“pinch”的第三人称单数）用两指捏紧；用手指捏取少量。"},"examples":[{"en":"He pinches the dough to seal the edges.","zh":"他把面团边缘捏紧封口。"},{"en":"She pinches a little sugar between her fingers.","zh":"她用手指捏了一点糖。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause a sharp, brief pain or discomfort, or to fit too tightly and press the skin.","zh":"（衣物等）夹得疼、勒人；造成短暂刺痛或不适。"},"examples":[{"en":"These shoes pinch my toes.","zh":"这双鞋夹得我脚趾疼。"},{"en":"The cold air pinches my face.","zh":"冷空气刺得我脸发疼。"}]}],"synonyms":["squeeze","nip","grip","a little bit","small amount"],"phonetic":"/pɪntʃ/","extraExplanation":["“painches”不是常见英文拼写，很可能是把“pinches / pinch”拼错了。","“a pinch of …”是非常常用的搭配，意思是“少量/一小撮（盐、糖、香料等）”。在菜谱里尤其常见。"]}
{"word":"paindemaine","summary":{"en":"“paindemaine” isn’t standard English; it appears to be a French-style label meaning “bread of Maine,” likely a product/menu name.","zh":"“paindemaine”不是标准英语词；看起来像法式写法，意为“缅因州的面包”，多半是产品名/菜单用名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling that looks like French “pain de Maine” (“bread of Maine”). It is not a common English word; in English it would usually be treated as a French-style name for a bread or a bakery product.","zh":"一种不规范拼写，看起来像法语“pain de Maine”（直译“缅因州的面包”）。它不是常见英语词；在英语里通常会被当作某种面包/烘焙品的法式名称。"},"examples":[{"en":"The menu listed “paindemaine,” but I couldn’t find a clear description of what kind of bread it was.","zh":"菜单上写着“paindemaine”，但我找不到清楚的说明它是哪一种面包。"},{"en":"If it’s meant to be French, you might see it written as “pain de Maine” with spaces.","zh":"如果它本来想写成法语，你可能会看到它写作“pain de Maine”，中间有空格。"}]}],"synonyms":["pain de Maine (spaced form)"],"phonetic":"/ˌpæn də ˈmeɪn/","extraExplanation":["“Pain”在法语里是“面包”的意思；“de”是“……的”。“Maine”一般指美国的缅因州，所以字面会被理解为“来自缅因的面包/缅因风格的面包”。不过这并不是常见的固定短语或广为人知的面包名称。","你输入的“paindemaine”连写更像是品牌名、菜单上的自造词或拼写合并。若你是在烘焙/餐厅语境看到它，可能是店家给某款面包起的名字。","如果你原本想查的是法语常见面包名，可能会混淆到：pain de mie（吐司/白吐司类）、pain de campagne（乡村面包）等。你可以告诉我它出现的句子或图片，我能更准确判断。"]}
{"word":"paine","summary":{"en":"“Paine” is mainly a surname, especially associated with Thomas Paine, a key writer of the American Revolution.","zh":"“Paine”主要是一个姓氏，尤其常指美国独立革命时期的重要作者托马斯·潘恩。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname, best known from Thomas Paine (1737–1809), an English-born writer and political thinker whose pamphlets strongly influenced the American Revolution.","zh":"一个姓氏，最著名的是托马斯·潘恩（Thomas Paine，1737–1809），英裔政治作家与思想家，他的小册子对美国独立革命影响很大。"},"examples":[{"en":"In U.S. history class, we read excerpts from Paine’s pamphlet Common Sense.","zh":"在美国历史课上，我们读了潘恩《常识》小册子的节选。"},{"en":"Paine argued that independence was not only possible but necessary.","zh":"潘恩主张独立不仅可行，而且是必要的。"}]},{"partOfSpeech":"other","definition":{"en":"A family name used for people (and sometimes places or institutions) named “Paine.”","zh":"用作人名（有时也用于地名或机构名）的“Paine”这一姓氏。"},"examples":[{"en":"Dr. Paine will see you now.","zh":"潘恩医生现在会见你。"},{"en":"The Paine family has lived here for generations.","zh":"潘恩家族在这里住了好几代。"}]}],"phonetic":"/peɪn/","extraExplanation":["“Paine”的读音与常见单词“pain”（痛苦）相同，但含义不同：前者多为姓氏/专有名词，后者是普通名词或动词。写作时注意大小写：Paine（姓氏）通常首字母大写。","托马斯·潘恩最著名的作品之一是《Common Sense》（《常识》，1776），用通俗有力的语言劝说殖民地民众支持独立；此外还有《The American Crisis》（《美国危机》）等，对当时的公众舆论影响深远。"]}
{"word":"pained","summary":{"en":"“Pained” usually describes a hurt or distressed expression or feeling, and it can also be the past form of “pain” (to cause pain).","zh":"“pained”多指（神情或感受）痛苦、受伤，也可作“pain”的过去式/过去分词，表示“使疼痛/使难过”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing emotional or mental suffering; looking hurt, worried, or distressed.","zh":"（表情或语气）痛苦的；受伤的；忧虑不安的。"},"examples":[{"en":"He gave a pained smile when he heard the news.","zh":"听到这个消息时，他勉强挤出一个痛苦的微笑。"},{"en":"Her pained expression showed she didn’t want to talk about it.","zh":"她痛苦的表情显示她不想谈这件事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Feeling physical pain; sore or hurting.","zh":"感到身体疼痛的；酸痛的。"},"examples":[{"en":"After the long hike, my legs were pained and tired.","zh":"长途徒步后，我的腿又酸又累。"},{"en":"He walked carefully, with a pained knee.","zh":"他小心地走着，膝盖疼得厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pain”: to cause someone pain or sadness.","zh":"“pain”的过去式/过去分词：使（某人）疼痛或难过。"},"examples":[{"en":"I was pained to hear that she was treated unfairly.","zh":"听说她受到不公平对待，我很难过。"},{"en":"His rude comment pained her.","zh":"他粗鲁的话让她很伤心。"}]}],"synonyms":["hurt","distressed","anguished","sorrowful","aching"],"phonetic":"/peɪnd/","extraExplanation":["“pained”常见于书面语或较正式的表达，尤其搭配情绪与表情：a pained look/smile/expression（痛苦的神情/勉强的微笑）。","固定结构：be pained to + 动词（对……感到难过/遗憾），语气比“sad”更正式、更含蓄。"]}
{"word":"painful","summary":{"en":"Painful means causing physical pain or emotional suffering; it can also describe an awkward, uncomfortable situation.","zh":"painful 指“疼痛的、痛苦的”，既可形容身体疼痛，也可形容情绪上的痛苦；有时也指“尴尬到让人不舒服”的场面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing physical pain; hurting the body.","zh":"引起身体疼痛的；让身体受伤或难受的。"},"examples":[{"en":"I had a painful headache all day.","zh":"我一整天都头痛得厉害。"},{"en":"It was painful to walk on my injured ankle.","zh":"脚踝受伤后走路很疼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing emotional pain; upsetting or difficult to experience or talk about.","zh":"令人情感上痛苦的；让人难过、难以面对或难以谈起的。"},"examples":[{"en":"It was painful to say goodbye to my friends.","zh":"和朋友告别是一件很痛苦的事。"},{"en":"Talking about the accident is still painful for her.","zh":"对她来说，谈起那场事故仍然很痛苦。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very uncomfortable, awkward, or hard to watch (often about social situations).","zh":"令人尴尬或不自在的；让人看着难受的（常形容社交场面）。"},"examples":[{"en":"There was a painful silence after his joke failed.","zh":"他的笑话冷场后，现场出现了令人尴尬的沉默。"},{"en":"It was painful to watch them argue in public.","zh":"看他们在公共场合吵架让人很难受。"}]}],"synonyms":["sore","hurtful","aching","distressing","uncomfortable"],"phonetic":"/ˈpeɪn.fəl/","extraExplanation":["“painful”既可指“身体疼痛”，也常用来形容“情绪上的伤痛”（painful memories/experience）。在口语里，“painful”还可委婉表示“尴尬到让人不忍直视”，如“a painful conversation/silence”。","常见搭配：painful + noun（painful lesson / painful truth / painful decision / painful memory）。与“hurt”相比，“painful”更强调“带来痛感或痛苦的性质/程度”。"]}
{"word":"painfuller","summary":{"en":"“painfuller” is nonstandard. Use “more painful.” “Painful” means causing physical pain or emotional distress.","zh":"“painfuller”属于非标准/常见拼写错误。请用“more painful”。“painful”表示身体疼痛或情感上令人难过。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or misspelled comparative of “painful.” The standard form is “more painful” (or, less commonly, “painfuller,” but it is generally avoided).","zh":"“painful”的非标准/拼写错误比较级。标准说法是“more painful”（较少情况下有人写“painfuller”，但一般不推荐）。"},"examples":[{"en":"After the operation, the second day was more painful than the first.","zh":"手术后，第二天比第一天更痛。"},{"en":"Correct: This injection is more painful than I expected.","zh":"正确：这针比我想的更痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having physical pain or causing pain; emotionally upsetting or hard to experience.","zh":"（身体上）疼痛的/引起疼痛的；（情感上）令人难过的、难以承受的。"},"examples":[{"en":"He has a painful knee injury.","zh":"他的膝盖受伤很疼。"},{"en":"It was a painful memory to talk about.","zh":"那是一段说起来很难受的回忆。"}]}],"synonyms":["more painful","hurtful","agonizing","distressing"],"phonetic":"/ˈpeɪnfəl/","extraExplanation":["“painful”以 -ful 结尾，构成比较级通常用“more + 形容词”（more painful），而不是加 -er。日常英语里“painfuller”很少见，写作或考试建议避免。","拼写提示：painful 只有一个 l（pain + ful）。很多人会因为发音或类比而误写成 painfuller（双写 l）。"]}
{"word":"painfullest","summary":{"en":"“Painfullest” means “most painful,” but “most painful” is more common and more natural in modern English.","zh":"“painfullest”表示“最痛苦的/最疼的”，但现代英语中更常用、更自然的是“most painful”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “painful”: causing the greatest physical or emotional pain among a group (often expressed more naturally as “most painful”).","zh":"“painful”的最高级：在一组事物中造成最强烈的身体或情感痛苦（更自然的说法通常是“most painful”）。"},"examples":[{"en":"That was the painfullest part of the recovery for me.","zh":"对我来说，那是康复过程中最痛苦的部分。"},{"en":"Losing her trust was the painfullest lesson I’ve learned.","zh":"失去她的信任是我学到的最痛苦的一课。"},{"en":"This injection is the painfullest, but it’s quick.","zh":"这一针最疼，但很快就结束。"}]}],"synonyms":["most painful","worst","most agonizing","most distressing"],"phonetic":"/ˈpeɪnfəlɪst/","extraExplanation":["“painfullest”在现代英语中较少见，很多写作/考试/正式场合更推荐用“most painful”。","拼写注意：painful 只有一个 l（pain + ful），所以更规范的写法通常是“most painful”，而不是再加 -est。口语里偶尔会用“painfullest”来强调，但可能显得不够正式。"]}
{"word":"painfully","summary":{"en":"“Painfully” means “with pain” or “in a very uncomfortable/too obvious way,” often used to emphasize how strong a feeling or situation is.","zh":"“painfully”既可指“疼痛地”，也常作强调，表示“极其令人不适/尴尬/明显得刺痛”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that causes physical pain; so as to hurt","zh":"以造成身体疼痛的方式；疼得"},"examples":[{"en":"My ankle was painfully swollen after the fall.","zh":"摔倒后我的脚踝肿得很疼。"},{"en":"The medicine went down painfully.","zh":"药咽下去时很难受、很疼。"}]},{"partOfSpeech":"adv.","definition":{"en":"in an extremely uncomfortable, embarrassing, or distressing way; very much so","zh":"以令人极度不舒服／尴尬／难受的方式；非常、极其"},"examples":[{"en":"It was painfully awkward to sit through the silence.","zh":"在那段沉默中干坐着，尴尬得要命。"},{"en":"She is painfully shy in new situations.","zh":"她在新环境里害羞得厉害。"},{"en":"The truth was painfully clear.","zh":"真相清楚得让人心里发痛。"}]}],"synonyms":["agonizingly","uncomfortably","acutely","exceedingly","severely"],"phonetic":"/ˈpeɪn.fəl.i/","extraExplanation":["“painfully”既可以字面表示“疼痛地”，也常用于强调程度，意思接近“非常/极其”（如 painfully obvious/awkward/shy）。这种用法带有一种“让人难受”的情绪色彩，比单纯的 “very” 更强、更带讽刺或无奈。","常见搭配：painfully obvious（明显得令人难堪/刺痛）、painfully aware（痛切地意识到）、painfully slow（慢得让人抓狂）、painfully thin（瘦得令人担心/刺眼）。"]}
{"word":"painfulness","summary":{"en":"“Painfulness” means the state or quality of being painful, either physically or emotionally, and it’s often more formal than “pain.”","zh":"“painfulness”指“痛苦/疼痛的状态或性质”，可指身体或情感层面，语气较“pain”更书面、更强调痛苦的程度或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being painful; physical or emotional suffering.","zh":"痛苦；（身体或情感上的）疼痛、折磨的状态。"},"examples":[{"en":"He spoke about the painfulness of recovery after the surgery.","zh":"他谈到手术后康复过程的痛苦。"},{"en":"She tried to hide the painfulness of the breakup at work.","zh":"她在工作时努力掩饰分手带来的痛苦。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being hard to endure or unpleasant (often describing an experience or process).","zh":"难以忍受；令人不快（常指经历或过程带来的难受感）。"},"examples":[{"en":"The painfulness of starting over can make people feel stuck.","zh":"重新开始的难受感会让人觉得被困住。"},{"en":"They underestimated the painfulness of learning a new system under pressure.","zh":"他们低估了在压力下学习新系统的艰难。"}]}],"synonyms":["pain","suffering","agony","distress","hurt"],"phonetic":"/ˈpeɪnfəlnəs/","extraExplanation":["“painfulness”是由形容词“painful”（痛苦的）加名词后缀“-ness”（……的状态/性质）构成的抽象名词。日常口语里更常用“pain”或“suffering”；“painfulness”更偏书面、强调“痛苦这一性质/程度”。"]}
{"word":"paining","summary":{"en":"“Paining” means ‘causing pain’ or ‘feeling pain’ (the -ing form of “pain”), but it’s less common than “hurting.”","zh":"“paining”是“pain”的-ing形式，表示“使痛苦/正在疼”，但日常中常用“hurting”更自然。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the present participle of “pain”; causing someone to feel physical or emotional pain, or feeling pain yourself","zh":"“pain”的现在分词；使（某人）感到身体或情感上的痛苦，或自己正在疼痛"},"examples":[{"en":"It’s paining me to see you so upset.","zh":"看到你这么难过，我也很心痛。"},{"en":"My knee has been paining me since yesterday.","zh":"我的膝盖从昨天起一直在疼。"}]}],"synonyms":["hurting","aching","distressing"],"phonetic":"/ˈpeɪnɪŋ/","extraExplanation":["“paining”在日常英语中不算常见，尤其表示“（某部位）疼”时，更自然的说法通常是：“My knee hurts.” 或 “My knee has been hurting.”\n\n很多学习者把“paining”和“painting（绘画/油漆）”拼混：\n- painting /ˈpeɪntɪŋ/ = 绘画；油漆；一幅画\n- paining /ˈpeɪnɪŋ/ = 使痛苦；正在疼（较少用）\n\n如果你本来想查“painting”，告诉我，我可以给你“painting”的详细释义与例句。"]}
{"word":"painingly","summary":{"en":"“Painfully” means (1) with physical pain, (2) in an emotionally uncomfortable/awkward way, or (3) extremely (often with negative feeling).","zh":"“Painfully”可表示（1）疼痛地（身体），（2）难受/尴尬地（情绪），或（3）非常、到令人不适的程度（常带负面感受）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that causes physical pain; with pain.","zh":"以疼痛的方式；痛苦地（身体上的疼痛）。"},"examples":[{"en":"My ankle was painfully swollen after the fall.","zh":"摔倒后我的脚踝肿得很疼。"},{"en":"She painfully climbed the stairs with an injured knee.","zh":"她膝盖受伤，疼痛地爬上楼梯。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an emotionally uncomfortable way; awkwardly or embarrassingly.","zh":"在情感上不舒服地；尴尬地、难堪地。"},"examples":[{"en":"The silence became painfully awkward.","zh":"沉默变得尴尬得让人难受。"},{"en":"He was painfully aware that everyone was watching him.","zh":"他难堪地意识到大家都在看他。"}]},{"partOfSpeech":"adv.","definition":{"en":"Extremely; to a degree that feels unpleasant or hard to ignore (often with adjectives like obvious, slow, shy).","zh":"非常；到让人不舒服或难以忽视的程度（常与 obvious、slow、shy 等形容词搭配）。"},"examples":[{"en":"It was painfully obvious that they disagreed.","zh":"他们意见不合简直明显得刺眼。"},{"en":"The computer is painfully slow.","zh":"这台电脑慢得让人抓狂。"}]}],"synonyms":["sorely","uncomfortably","awkwardly","acutely","exceedingly"],"phonetic":"/ˈpeɪnfəli/","extraExplanation":["你输入的“painingly”通常是拼写错误；更常见、正确的词是 **painfully**。","拼写提示：pain + ful + ly → **painfully**（注意只有一个 n）。","语气提示：用来强调“让人不舒服的程度”时，painfully 常带夸张/抱怨色彩，比如 painfully slow（慢得要命）。"]}
{"word":"painkiller","summary":{"en":"A painkiller is a medicine for relieving pain; it can also be used figuratively for something that eases emotional pain.","zh":"painkiller 指止痛药；也可作比喻，指缓解情绪痛苦的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine that reduces or stops pain.","zh":"止痛药；镇痛药（减轻或消除疼痛的药物）。"},"examples":[{"en":"I took a painkiller for my headache.","zh":"我吃了一片止痛药来缓解头痛。"},{"en":"Ask a doctor which painkiller is safe for you.","zh":"咨询医生哪种止痛药对你来说更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone or something that stops pain or emotional suffering (often used in a figurative way).","zh":"（比喻）让人暂时忘记痛苦的人或事；“精神止痛药”。"},"examples":[{"en":"Music can be a painkiller after a stressful day.","zh":"压力大的一天之后，音乐可以成为一种“精神止痛药”。"},{"en":"For her, talking to friends was a painkiller for loneliness.","zh":"对她来说，和朋友聊天是治疗孤独的“止痛药”。"}]}],"synonyms":["analgesic","pain reliever"],"phonetic":"/ˈpeɪnˌkɪlər/","extraExplanation":["在日常英语里，painkiller常指非处方止痛药（如 ibuprofen 布洛芬、acetaminophen 对乙酰氨基酚）或处方止痛药（如含阿片类的药物）。不同药物对人群（如孕妇、肝肾问题、胃病患者）风险不同，“take painkillers”最好搭配“as directed / as prescribed（按说明/按医嘱）”。","拼写上 painkiller 也可写作 pain-killer（较少见）。与之相关的更正式词是 analgesic（镇痛剂）。"]}
{"word":"painkillers","summary":{"en":"“Painkillers” are medicines used to relieve pain.","zh":"painkillers 指用来缓解疼痛的药物（止痛药/镇痛药）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines that reduce or relieve pain (also called analgesics).","zh":"止痛药；镇痛药（也叫 analgesics）。"},"examples":[{"en":"The dentist gave me painkillers after the tooth extraction.","zh":"拔牙后，牙医给我开了止痛药。"},{"en":"Be careful mixing painkillers with alcohol.","zh":"把止痛药和酒精混在一起要特别小心。"},{"en":"Over-the-counter painkillers can help with headaches, but follow the label.","zh":"非处方止痛药能缓解头痛，但要按说明使用。"}]}],"synonyms":["analgesics","pain relievers"],"phonetic":"/ˈpeɪnˌkɪlərz/","extraExplanation":["“Painkillers”通常作复数名词使用，指“一类止痛药”或“一些止痛药”。也可以说“a painkiller”（一片/一种止痛药）。","常见类别：非处方（如 acetaminophen/对乙酰氨基酚、ibuprofen/布洛芬）与处方止痛药（如 opioid 类）。不同药物的用法与风险不同，尤其要注意剂量、与其他药物同服、以及肝脏/胃部等副作用。","口语里也可用作比喻：something is a painkiller = “能暂时缓解问题但不治本的东西”。例如：“Social media can be a painkiller for loneliness.”"]}
{"word":"painkilling","summary":{"en":"“Painkilling” means relieving or reducing pain, usually describing medicine or treatment.","zh":"“painkilling”表示“止痛的、减轻疼痛的”，多用于形容药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relieving or reducing pain; used to describe medicine, treatment, or effects that stop pain.","zh":"止痛的；减轻疼痛的（用于形容药物、治疗或效果能缓解疼痛）"},"examples":[{"en":"The doctor prescribed a painkilling medicine after the surgery.","zh":"手术后，医生开了止痛药。"},{"en":"She took a painkilling tablet for her headache.","zh":"她吃了一片止痛药来缓解头痛。"},{"en":"The cream has a mild painkilling effect.","zh":"这种药膏有轻微的止痛效果。"}]}],"synonyms":["pain-relieving","analgesic","soothing"],"phonetic":"/ˈpeɪnˌkɪlɪŋ/","extraExplanation":["“painkilling”也常写作“pain-killing”（带连字符），意思相同；更正式的医学/药学用词常用“analgesic（镇痛的/止痛药）”。","搭配很常见：painkilling medication/tablet/cream（止痛药物/药片/药膏），painkilling effect（止痛效果）。"]}
{"word":"painless","summary":{"en":"“Painless” means without pain, either physically or emotionally; it can also mean easy and not troublesome.","zh":"“painless”表示“无痛的/不疼的”，也可引申为“不会让人难受或麻烦的、轻松的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not causing physical pain; comfortable or not hurting.","zh":"不疼的；无痛的；不会引起身体疼痛的。"},"examples":[{"en":"The dentist said the procedure would be painless.","zh":"牙医说这个治疗过程会是无痛的。"},{"en":"These shoes are surprisingly painless to wear all day.","zh":"这双鞋穿一整天居然很舒服，不怎么磨脚。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not causing emotional pain, trouble, or difficulty; easy and stress-free.","zh":"不让人难受的；不麻烦的；轻松无压力的。"},"examples":[{"en":"Moving to a new apartment is rarely painless.","zh":"搬新家很少会是轻松不麻烦的。"},{"en":"They tried to make the breakup as painless as possible.","zh":"他们尽量让分手过程不那么痛苦。"}]}],"synonyms":["pain-free","comfortable","easy","effortless","trouble-free"],"phonetic":"/ˈpeɪnləs/","extraExplanation":["“painless”常用来安慰别人：如 “It’ll be quick and painless.”（很快、不会疼）。也常用于比喻：例如 “a painless transition”（平稳/不折腾的过渡）。","词形上是 pain（疼痛）+ -less（没有……的），类似结构还有 “harmless”（无害的）、“hopeless”（无望的）。"]}
{"word":"painlessly","summary":{"en":"“Painlessly” means “without pain,” either physically (no discomfort) or emotionally/figuratively (easy and trouble-free).","zh":"“painlessly”表示“无痛地”，既可指身体上不疼，也可指过程/情绪上轻松顺利、没有烦恼。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not cause physical pain or discomfort.","zh":"无痛地；不会引起身体疼痛或不适地。"},"examples":[{"en":"The dentist removed the tooth painlessly.","zh":"牙医无痛地把牙拔掉了。"},{"en":"With proper anesthesia, the procedure can be done almost painlessly.","zh":"在合适的麻醉下，这个手术几乎可以无痛完成。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not cause emotional pain, trouble, or difficulty; easily and without stress.","zh":"不痛苦地；轻松地；不费力地（指情感上或过程上没有烦恼/困难）。"},"examples":[{"en":"She transitioned to her new job painlessly.","zh":"她很顺利、几乎不费劲地适应了新工作。"},{"en":"We painlessly updated the app after following the instructions.","zh":"按照说明操作后，我们很轻松地完成了应用更新。"}]}],"synonyms":["without pain","pain-free","easily","smoothly","effortlessly"],"phonetic":"/ˈpeɪn.ləs.li/","extraExplanation":["“painlessly”来自形容词“painless”（无痛的）+ 副词后缀“-ly”。常用于医疗语境（强调身体无痛），也常用于比喻语境（强调过程顺利、没有情绪负担）。","在比喻用法中，语气通常偏积极（顺利、省心），但也可能带一点讽刺意味，取决于上下文，例如：\"painlessly replaced\"（被“毫不费力地”取代）。"]}
{"word":"painlessness","summary":{"en":"Painlessness means the state or quality of having no pain, physically or emotionally.","zh":"Painlessness 指“无痛”的状态或性质，也可指情感上“不那么痛苦”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having no pain; the quality of being painless (physically or emotionally)","zh":"无痛；无疼痛的状态；（身体或情感上的）不痛苦"},"examples":[{"en":"The dentist promised the procedure would be quick and painless, and the patient appreciated the painless­ness afterward.","zh":"牙医保证手术又快又不痛，病人很感激术后的无痛感。"},{"en":"She described the recovery as surprising in its painless­ness.","zh":"她形容恢复过程出乎意料地几乎无痛。"},{"en":"After years of stress, he wanted a sense of painless­ness in his daily life, at least emotionally.","zh":"经历多年压力后，他希望日常生活里至少在情感上能有一种不那么痛苦的感觉。"}]}],"synonyms":["absence of pain","pain-free condition","comfort"],"phonetic":"/ˈpeɪnləsnəs/","extraExplanation":["词形来源：painless（无痛的）+ -ness（名词后缀，表示“……的状态/性质”）。因此 painlessness 常用于描述“无痛”这一性质，语气偏客观、正式，常见于医疗、说明书、科普或较书面语境。","使用提示：日常口语里更常说 “It doesn’t hurt.” / “It’s painless.”；painlessness 更像是在总结一种“特性或体验”（例如手术的无痛性、恢复过程的无痛程度）。"]}
{"word":"painproof","summary":{"en":"“Painproof” means resistant to pain or intended to prevent/reduce pain, but it’s informal and not very common.","zh":"painproof 指“抗痛的/减轻或避免疼痛的”，但较非正式、也不太常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to pain, or designed to prevent or reduce pain (often used informally or in advertising-style language).","zh":"（非正式）抗痛的；减轻/避免疼痛的（常见于宣传或口语表达）。"},"examples":[{"en":"There’s no such thing as a completely painproof treatment—most procedures still cause some discomfort.","zh":"并不存在完全“抗痛”的治疗——大多数操作还是会有些不适。"},{"en":"The clinic promised a “painproof” injection, but I still felt a sharp sting.","zh":"诊所承诺打针“无痛/抗痛”，但我还是感到一阵刺痛。"}]}],"synonyms":["painless","pain-free","pain-relieving","pain-resistant"],"phonetic":"/ˈpeɪnˌpruːf/","extraExplanation":["“painproof”由 pain（疼痛）+ -proof（能防……的/不受……影响的）构成，类似 waterproof（防水）、soundproof（隔音）。但它不是非常常见的标准词汇，更常见、更自然的表达是 painless（无痛的）、pain-free（无痛的）、pain-relieving（止痛的）、pain-resistant（抗痛的）。","在医疗或美容语境中，商家可能用“painproof”作为夸张说法；正式写作中建议改用更明确的词（如 “painless procedure” 或 “pain relief”）以避免误导。"]}
{"word":"pains","summary":{"en":"“Pains” usually means physical or emotional suffering, or careful effort taken to do something well (as in “take pains”).","zh":"“pains”通常指身体/情感上的痛苦；也可指为把事情做好而付出的苦心（如“take pains”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"physical suffering or discomfort; also emotional suffering","zh":"身体上的疼痛；也可指情感上的痛苦"},"examples":[{"en":"The pains in my back got worse after I lifted the box.","zh":"我抬起箱子后背痛得更厉害了。"},{"en":"She spoke openly about the pains of losing a loved one.","zh":"她坦然谈到失去亲人的痛苦。"}]},{"partOfSpeech":"n.","definition":{"en":"careful effort or trouble taken to do something well (often in the phrase “take pains”)","zh":"为把事情做好而付出的细心努力/苦心（常用于短语“take pains”）"},"examples":[{"en":"They took great pains to make the guests feel welcome.","zh":"他们煞费苦心让客人感到受欢迎。"},{"en":"He goes to a lot of pains to check every detail.","zh":"他费了很大劲去核对每一个细节。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) causes someone emotional pain; hurts (third-person singular of “pain”)","zh":"（较少见）使某人难过/伤心；伤害（动词 pain 的第三人称单数）"},"examples":[{"en":"It pains me to see you so disappointed.","zh":"看到你这么失望，我很难过。"}]}],"synonyms":["aches","soreness","hurt","suffering","distress","efforts","trouble","care"],"phonetic":"/peɪnz/","extraExplanation":["“pain”既可作不可数名词（表示抽象的“疼痛/痛苦”），也可作可数名词（常指某种具体的疼痛：a sharp pain）。因此“pains”常见于：1）复数表示多处/多次疼痛（back pains）；2）固定搭配“take pains / go to great pains”，表示“煞费苦心、格外用心”。","“It pains me to…”是一种较正式的表达，用来礼貌地说明“我为此感到难过/遗憾”。日常口语也可用“I'm sorry to…”或“It hurts to…”。"]}
{"word":"painstaker","summary":{"en":"“Painstaker” is not standard. The correct word is usually “painstaking,” meaning very careful and thorough, often requiring a lot of time and effort.","zh":"“painstaker”不是标准用法。通常应写作“painstaking”，意思是非常细致认真、周密彻底，往往也指费时费力。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling of “painstaking” (adj.) or an incorrect form for “a painstaking person.”","zh":"（非标准）“painstaking”（形容词）的拼写错误；或误用来表示“做事很细致/很辛苦的人”。"},"examples":[{"en":"“Painstaker” is not standard English; most people mean “painstaking.”","zh":"“painstaker” 不是标准英语；多数人想表达的是 “painstaking”。"},{"en":"She did a painstaking review of the report.","zh":"她对报告做了非常细致的审查。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done with great care and attention to detail; very thorough.","zh":"（工作等）非常细致的；一丝不苟的；极其认真彻底的。"},"examples":[{"en":"The team made a painstaking plan before the launch.","zh":"团队在发布前制定了一个非常周密的计划。"},{"en":"He took painstaking notes during the lecture.","zh":"他在课上做了非常细致的笔记。"}]},{"partOfSpeech":"adj.","definition":{"en":"Taking a lot of time and effort; laborious.","zh":"费时费力的；辛苦的。"},"examples":[{"en":"Restoring old photos can be painstaking work.","zh":"修复老照片可能是一项费时费力的工作。"},{"en":"Learning pronunciation takes painstaking practice.","zh":"学习发音需要下苦功练习。"}]}],"synonyms":["careful","thorough","meticulous","detailed","laborious"],"phonetic":"/ˈpeɪnˌsteɪkɪŋ/","extraExplanation":["“painstaking”字面可理解为“像承受痛苦一样去做（a pain + taking）”，强调为了把事情做好而付出大量耐心与努力。","若想表达“做事一丝不苟的人”，英语更常说：a careful person / a meticulous person / someone who is very detail-oriented，而不是 *painstaker。"]}
{"word":"painstaking","summary":{"en":"“Painstaking” describes work that is extremely careful, detailed, and often time-consuming.","zh":"“painstaking”表示做事非常细致认真、一丝不苟，通常也暗示费时费力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done with great care and attention to detail; very thorough and careful.","zh":"非常细致认真的；一丝不苟的；十分周到的。"},"examples":[{"en":"She kept painstaking notes during every meeting.","zh":"她在每次会议中都认真细致地做笔记。"},{"en":"The report was prepared with painstaking care.","zh":"这份报告是经过一丝不苟的准备完成的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Requiring a lot of time, effort, and careful work.","zh":"费时费力的；需要投入大量精力并仔细完成的。"},"examples":[{"en":"Restoring the old painting was a painstaking process.","zh":"修复这幅老画是一个费时费力的过程。"},{"en":"Learning to write neatly can be painstaking at first.","zh":"一开始学习把字写工整可能会很费劲。"}]}],"synonyms":["meticulous","thorough","careful","detailed","diligent"],"phonetic":"/ˈpeɪnˌsteɪkɪŋ/","extraExplanation":["“painstaking”由“pain（痛苦/辛苦）+ taking（承受/承担）”发展而来，原意强调“愿意承受辛劳”，所以它常用来形容那种“慢、细、认真”的努力。","语气通常是褒义：赞赏一个人做事认真、严谨。但也可能暗含“很耗时、很辛苦”。","常见搭配：painstaking effort（艰苦细致的努力）, painstaking work/research（细致的工作/研究）, with painstaking care（以一丝不苟的态度）。"]}
{"word":"painstakingly","summary":{"en":"“Painstakingly” means doing something very carefully and thoroughly, with great effort and attention to detail.","zh":"“painstakingly”表示“非常细致认真地、一丝不苟地做某事”，强调费心费力并关注细节。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very careful way, paying close attention to every small detail, usually over a long time.","zh":"非常细致认真地；一丝不苟地（通常花费较长时间、关注每个小细节）。"},"examples":[{"en":"She painstakingly checked every number in the report before sending it.","zh":"她在发送报告前一丝不苟地核对了每一个数字。"},{"en":"The scientist painstakingly recorded the results day after day.","zh":"那位科学家日复一日地仔细记录实验结果。"}]}],"synonyms":["meticulously","carefully","thoroughly","diligently"],"phonetic":"/ˈpeɪnˌsteɪkɪŋli/","extraExplanation":["“painstakingly”来自“painstaking”（adj. 费力而细致的）+ “-ly”（构成副词）。这里的“pain”不是指身体疼痛，而是指“费力、辛苦”。因此它强调的是“花很多精力、认真到细节”的做事方式，而不一定表示真的痛苦。","语体上常用于较正式的写作或说明文，和“meticulously / carefully”接近，但更突出“耗时、费心”。"]}
{"word":"painstakingness","summary":{"en":"Painstakingness means great care and thoroughness, especially attention to small details.","zh":"painstakingness 指做事非常认真细致、周全彻底，尤其注重细节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of doing something very carefully and thoroughly, paying close attention to small details.","zh":"一丝不苟；极其细致周到（做事非常认真仔细，关注每个小细节的品质）。"},"examples":[{"en":"Her painstakingness in editing the report removed even tiny mistakes.","zh":"她在编辑报告时一丝不苟，连很小的错误都清除了。"},{"en":"The model was built with painstakingness, so every part fits perfectly.","zh":"这个模型制作得极其细致，所以每个部件都严丝合缝。"}]}],"synonyms":["meticulousness","thoroughness","carefulness","diligence","attention to detail"],"phonetic":"/ˈpeɪnˌsteɪ.kɪŋ.nəs/","extraExplanation":["“painstakingness”来自形容词“painstaking”（费力的、极其细致的）。其中“painstaking”不是“造成痛苦”的意思，而是指“像经历辛苦一样投入大量耐心与努力”。","在现代英语里，“painstakingness”相对少见，更常用的表达是“carefulness”“thoroughness”“meticulousness”，或直接用形容词：“painstaking work / painstaking research”。","语体上偏正式，常用于学术研究、编辑校对、工艺制作、调查取证等需要精确与耐心的场景。"]}
{"word":"painsworthy","summary":{"en":"“Painsworthy” is not standard English; it likely intends “praiseworthy” (deserving praise) or a phrase like “worth the effort.”","zh":"“painsworthy”不是标准英语；更可能是想写“praiseworthy（值得称赞的）”，或表达“worth the effort（值得付出）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “praiseworthy” (deserving praise) or a mistaken blend with “pains” (effort).","zh":"不是标准英语词。更可能是把“praiseworthy（值得称赞的）”拼错了，或与“pains（辛劳/付出）”混淆造成的误拼。"},"examples":[{"en":"I couldn’t find “painsworthy” in standard dictionaries—did you mean “praiseworthy”?","zh":"我在常见词典里找不到“painsworthy”——你是不是想写“praiseworthy”？"},{"en":"Her patience is truly praiseworthy.","zh":"她的耐心确实值得称赞。"}]}],"synonyms":["praiseworthy","commendable","admirable","laudable","worthy of praise"],"phonetic":"/ˈpeɪnzˌwɝði/","extraExplanation":["“praiseworthy”= praise（称赞）+ worthy（值得的），常用于正式或书面表达：a praiseworthy effort/decision（值得称赞的努力/决定）。","如果你本意是“值得付出辛劳的/费力但值得的”，英语更常用：worth the effort / worth the trouble / worth the pain（值得付出）。也可以用“painstaking”（煞费苦心的、细致的）描述做事方式，而不是“painsworthy”。","如果“Painsworthy”是人名/地名/用户名，通常不需要按词义理解；可以告诉我它出现的句子，我能帮你判断最合适的含义。"]}
{"word":"paint","summary":{"en":"Paint can mean the colored liquid used on surfaces, the act of covering something with it, making art with paint, or describing something vividly in words.","zh":"Paint 可指“油漆/涂料”，也可作动词表示“刷漆、绘画”，还可引申为“用语言生动描绘/把……说成……”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colored liquid you spread on a surface to protect it or make it look nicer (e.g., on walls, wood, metal).","zh":"油漆；涂料：一种有颜色的液体，涂在表面上用来保护或美化（如墙壁、木头、金属）。"},"examples":[{"en":"We need two cans of paint to finish the living room.","zh":"我们需要两罐油漆才能刷完客厅。"},{"en":"The paint is still wet—don’t touch the door.","zh":"油漆还没干——别碰门。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover a surface with paint.","zh":"给……上漆；刷漆：用油漆覆盖某个表面。"},"examples":[{"en":"They painted the kitchen white.","zh":"他们把厨房刷成了白色。"},{"en":"I’m going to paint the fence this weekend.","zh":"我这个周末要给栅栏刷漆。"}]},{"partOfSpeech":"v.","definition":{"en":"to create a picture using paint (as an artist).","zh":"绘画；画：用颜料创作图画（艺术创作）。"},"examples":[{"en":"She paints landscapes and portraits.","zh":"她画风景画和肖像画。"},{"en":"He learned to paint in art school.","zh":"他在艺术学院学习绘画。"}]},{"partOfSpeech":"vt.","definition":{"en":"to describe something in a vivid way, especially with words; to present a particular impression.","zh":"（用语言）生动描绘；把……说得像……：用描述塑造某种印象。"},"examples":[{"en":"The article painted a hopeful picture of the future.","zh":"这篇文章把未来描绘得很有希望。"},{"en":"Don’t paint him as a villain—there’s more to the story.","zh":"别把他说成坏人——事情还有别的面。"}]}],"synonyms":["coat","decorate","depict","portray"],"phonetic":"/peɪnt/","extraExplanation":["词源小知识：paint 来自拉丁语 pingere（“画、描绘”），后来经法语进入英语，所以它既能指“油漆/涂料”，也能指“绘画”和“描绘（形象地讲述）”。","常见搭配：paint the wall（刷墙）、paint a picture（画一幅画 / 描绘一种景象）、paint someone as + 身份（把某人描绘成……）。"]}
{"word":"paintability","summary":{"en":"Paintability means how easy it is to apply paint and get a good-looking, even, durable finish.","zh":"Paintability 指材料或表面「可塗性」：上漆是否容易、是否能形成均勻好看且耐久的漆面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to paint well (how well paint spreads, covers, and looks on a surface)","zh":"可塗性；（材料）容易被塗裝且能達到良好效果的特性（如塗料的鋪展、遮蓋與外觀表現）"},"examples":[{"en":"This primer improves the paintability of bare metal.","zh":"這種底漆能提升裸金屬的可塗性。"},{"en":"We tested the paintability of the new plastic before mass production.","zh":"量產前，我們測試了新塑膠的可塗性。"},{"en":"Good surface cleaning can greatly increase paintability.","zh":"良好的表面清潔能大幅提高可塗性。"}]}],"synonyms":["coatability","finishability"],"phonetic":"/ˌpeɪn.təˈbɪl.ə.ti/","extraExplanation":["“paintability”常見於製造業、材料科學與塗裝工藝（如汽車、金屬件、塑膠件、木工）。它不只指「能不能上漆」，更常指「上漆的效果是否穩定好看」，例如附著力、流平性、遮蓋力、起泡/橘皮等缺陷風險。","近義但不完全相同：有時會和“paintability”一起出現的相關指標包括 adhesion（附著力）、wettability（潤濕性）、coatability（可塗覆性，範圍更廣）、finish quality（表面成品品質）。實務上寫報告時常會把這些分開評估。"]}
{"word":"paintable","summary":{"en":"Paintable means “able to be painted,” most often describing a surface that can take paint well.","zh":"paintable 的意思是“可涂漆的/适合上漆的”，最常用来形容某个表面能很好地上漆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be painted; suitable for having paint applied (often describing a surface or material).","zh":"可涂漆的；适合上漆的（常指某种表面或材料）。"},"examples":[{"en":"The walls are paintable, but you should clean them first.","zh":"墙面是可以刷漆的，但你应该先把它们清洁干净。"},{"en":"Make sure the wood is paintable by sanding it smooth.","zh":"把木头打磨光滑，才能确保它适合上漆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be represented with paint; likely to look good in a painting (less common).","zh":"适合入画的；很适合用绘画表现的（较不常用）。"},"examples":[{"en":"The village is especially paintable at sunset.","zh":"这个村庄在日落时分特别适合入画。"},{"en":"She chose a paintable scene with strong light and shadows.","zh":"她选了一个光影对比强烈、很适合画的景色。"}]}],"synonyms":["paint-ready","coatable","coatable (with paint)"],"phonetic":"/ˈpeɪn.tə.bəl/","extraExplanation":["“paintable”通常由动词“paint（涂漆/绘画）”+ 后缀“-able（能够……的）”构成，意思是“能够被……”。在家装/工程语境里最常见，强调材质表面是否适合上漆（例如是否需要打磨、底漆、除油除尘）。"]}
{"word":"paintableness","summary":{"en":"Paintableness means how suitable a surface or material is for being painted.","zh":"Paintableness 指材料或表面“适不适合上漆/能不能刷漆”的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be painted; suitability for having paint applied","zh":"可涂漆性；适合上漆/刷漆的性质"},"examples":[{"en":"The paintableness of the wall depends on how clean and dry the surface is.","zh":"墙面的可涂漆性取决于表面是否干净、干燥。"},{"en":"They tested the paintableness of the plastic to see if the color would stick.","zh":"他们测试这种塑料的可涂漆性，看看颜色是否能附着。"}]}],"synonyms":["paintability","suitability for painting","coatability"],"phonetic":"/ˈpeɪn.tə.bəl.nəs/","extraExplanation":["“paintableness”在现代英语中非常少见，通常人们更常用“paintability”。“paintable + -ness”表示“……的性质/状态”，属于常见构词法，但这个具体词形不太固定，多见于技术写作或临时造词。","在涂装/施工语境里，可涂漆性常与表面处理有关（如清洁、打磨、底漆、含水率、材质孔隙度等）。"]}
{"word":"paintably","summary":{"en":"“Paintably” (rare) means “in a way that looks good to paint” or “in a vivid, picture-like way.”","zh":"“paintably”（较少见）指“如画般、适合入画地”，也可指“描述得很有画面感地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is suitable to be painted; in a visually pleasing or “picturesque” way.","zh":"以适合绘画的方式；以画面感强、如画般的方式。"},"examples":[{"en":"The village sits paintably on the hillside, with white houses and red roofs.","zh":"这个村庄如画般地坐落在山坡上，白色房子配着红色屋顶。"},{"en":"They chose a paintably quiet corner of the lake for the scene.","zh":"他们为那一幕选了湖边一个如画般宁静的角落。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a vivid, graphic way, as if “painting a picture” with words.","zh":"（少见）生动形象地；仿佛用语言“画出画面”一样。"},"examples":[{"en":"She described the storm paintably, so everyone could imagine it.","zh":"她把暴风雨描述得很形象，大家都能想象出来。"},{"en":"The memoir recounts childhood scenes paintably but without exaggeration.","zh":"这本回忆录把童年场景写得很有画面感，但并不夸张。"}]}],"synonyms":["picturesquely","vividly","graphically","in a painterly way"],"phonetic":"/ˈpeɪntəbli/","extraExplanation":["“paintably”由形容词 paintable（可画的、适合上漆的）+ 副词后缀 -ly 构成，但在现代英语里非常少见，更多人会说 picturesquely（如画地）、vividly（生动地）、graphically（形象地）或 in a way that would make a good painting（很适合入画）。","如果你想表达“适合上漆/容易刷漆”，通常不用 paintably，而会说 paint easily / be easy to paint。"]}
{"word":"paintball","summary":{"en":"Paintball is a sport/game where players tag others by shooting paint-filled balls; it can also mean the paint-filled balls themselves.","zh":"Paintball 指彩弹运动/游戏；也可指用于射击的彩弹（装有颜料的小球）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A game or sport in which players shoot small paint-filled balls from a special gun (marker) to tag opponents, usually in teams.","zh":"彩弹游戏/彩弹运动：玩家用专用的彩弹枪（marker）发射装有颜料的小球来“标记”对手，通常分队进行。"},"examples":[{"en":"We played paintball last weekend, and my team won two rounds.","zh":"我们上周末去玩彩弹，我的队赢了两局。"},{"en":"You should wear a mask when you play paintball.","zh":"玩彩弹时你应该戴好面罩。"}]},{"partOfSpeech":"n.","definition":{"en":"A small ball filled with paint that is shot in the game of paintball.","zh":"彩弹：在彩弹游戏中射出的、内部装有颜料的小球。"},"examples":[{"en":"These paintballs break easily, so don’t drop them.","zh":"这些彩弹很容易碎，所以别摔到地上。"},{"en":"He bought two bags of paintballs for the match.","zh":"他为比赛买了两袋彩弹。"}]}],"synonyms":["paintball game","paintball sport","paintball pellet"],"phonetic":"/ˈpeɪntˌbɔl/","extraExplanation":["“Paintball”在美式英语里既指这项运动，也可指“彩弹”本身；语境通常能分辨：play paintball（玩彩弹） vs. buy paintballs（买彩弹）。","日常表达中常把发射器叫marker（marker gun），因为更强调“做记号”而非“枪”。在正式场合或安全说明中也常见这个说法。"]}
{"word":"paintbox","summary":{"en":"A paintbox is a box of paints (often watercolors), and it can also mean a rich mix of colors in a figurative sense.","zh":"paintbox 指装颜料（常为水彩）的颜料盒；也可比喻“丰富多彩的一套色彩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A box or small case that holds paints (often watercolor), sometimes including a palette and brushes.","zh":"装颜料的盒子（常指水彩颜料盒），有时也包含调色盘和画笔。"},"examples":[{"en":"She opened her paintbox and chose a bright blue.","zh":"她打开颜料盒，挑了一块亮蓝色。"},{"en":"Bring a paintbox to art class if you have one.","zh":"如果你有颜料盒，上美术课时带来。"}]},{"partOfSpeech":"n.","definition":{"en":"A set or range of colors, used especially in a creative or descriptive way (figurative).","zh":"（比喻）一整套/一系列色彩，常用于形容创作或描写中的丰富色彩。"},"examples":[{"en":"At sunset, the sky looked like a paintbox of orange and pink.","zh":"日落时，天空像一盒彩色颜料，铺满橙色和粉色。"},{"en":"The designer worked with a soft, natural paintbox of greens and browns.","zh":"设计师采用了一套柔和自然的色彩：绿色和棕色。"}]}],"synonyms":["watercolor set","paint set","palette","case of paints","(figurative) array of colors"],"phonetic":"/ˈpeɪntˌbɑks/"}
{"word":"paintbrush","summary":{"en":"A paintbrush is a brush used to apply paint; it can also (less commonly) be a verb meaning to paint with a brush.","zh":"paintbrush 指用来涂颜料或油漆的刷子/画笔；较少见时也可作动词，表示用刷子上漆或涂画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool with a handle and bristles (or synthetic fibers) used for applying paint.","zh":"画笔；油漆刷（带手柄和刷毛/纤维，用来涂抹颜料或油漆的工具）"},"examples":[{"en":"She cleaned her paintbrush after finishing the watercolor.","zh":"她画完水彩后把画笔清洗干净。"},{"en":"Use a small paintbrush to paint the corners neatly.","zh":"用一支小刷子把角落刷得更整齐。"}]},{"partOfSpeech":"v.","definition":{"en":"To apply paint using a paintbrush (less common than “paint”).","zh":"用画笔涂；用刷子上漆（不如直接用 paint 常见）"},"examples":[{"en":"He paintbrushed a thin layer of varnish onto the wood.","zh":"他用刷子在木头上刷了一层薄薄的清漆。"}]}],"synonyms":["brush","painting brush","artist’s brush"],"phonetic":"/ˈpeɪntˌbrʌʃ/","extraExplanation":["“paintbrush”在美式英语里通常写作一个词（paintbrush）；也常见两词写法“paint brush”。在家装语境中，人们也会说“brush”（刷子）来泛指油漆刷。","按用途常见搭配：a fine/tiny paintbrush（细画笔），a wide paintbrush（宽刷），a foam brush（海绵刷），a bristle brush（鬃毛刷）。"]}
{"word":"paintbrushes","summary":{"en":"Paintbrushes are brushes used to apply paint; it is the plural form of paintbrush.","zh":"paintbrushes 指用来涂抹颜料或油漆的画笔/油漆刷，是 paintbrush 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **paintbrush**: tools with bristles (or synthetic fibers) on a handle, used to apply paint.","zh":"**paintbrush** 的复数：**画笔/油漆刷**，带刷毛（或人造纤维）和手柄的工具，用来涂抹颜料或油漆。"},"examples":[{"en":"She bought new paintbrushes for her watercolor class.","zh":"她为水彩课买了新的画笔。"},{"en":"Clean your paintbrushes with soap and water after you finish painting.","zh":"画完后用肥皂和清水把画笔洗干净。"},{"en":"Different paintbrushes create different textures on the canvas.","zh":"不同的画笔会在画布上产生不同的纹理。"}]}],"synonyms":["brushes","paint brushes"],"phonetic":"/ˈpeɪntˌbrʌʃ/","extraExplanation":["在日常英语里也常说 **brushes**（刷子）来泛指各种刷子；但如果是在画画/涂漆的语境里，说 **paintbrush(es)** 更明确。","常见搭配：**a set of paintbrushes**（一套画笔）、**fine/soft paintbrushes**（细/软的画笔）、**clean/dry paintbrushes**（干净的/干燥的画笔）。","相关词区分：**paintbrush** 多指手持的“画笔/油漆刷”；**paint roller** 是“滚筒刷”；**brush** 更泛指刷子（牙刷、发刷等也可以）。"]}
{"word":"painted","summary":{"en":"“Painted” usually means ‘covered with paint’ or is the past form of “paint”; in some contexts it can suggest an artificially made-up look.","zh":"“painted”通常表示“涂过漆/画过的”，也可作“paint”的过去式/过去分词；在某些语境下还可暗示“刻意修饰、不自然的妆容/表情”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with paint; decorated by painting.","zh":"被涂上油漆的；用绘画装饰的。"},"examples":[{"en":"The door is freshly painted, so don’t touch it.","zh":"门刚刷过漆，所以别碰。"},{"en":"They live in a white-painted house near the river.","zh":"他们住在河边一栋刷成白色的房子里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to look a certain way using paint, often to create a false or enhanced appearance (especially for the face).","zh":"（常指脸）用化妆/涂抹颜料使外表看起来不同，常带“修饰或不自然”的含义。"},"examples":[{"en":"He didn’t recognize her with her face painted for the performance.","zh":"她为了演出把脸画了妆/彩绘，他都认不出来了。"},{"en":"The villain in the story is described as having a painted smile.","zh":"故事里反派被描写成带着“画出来的”笑容（假笑）。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past and past participle of “paint.”","zh":"“paint”的过去式和过去分词。"},"examples":[{"en":"She painted the room blue last weekend.","zh":"上周末她把房间刷成了蓝色。"},{"en":"The artist has painted three portraits this month.","zh":"这位画家这个月已经画了三幅肖像画。"}]}],"synonyms":["colored","coated","decorated","illustrated","depicted"],"phonetic":"/ˈpeɪntɪd/","extraExplanation":["“painted”作形容词时，既可以是中性描述（painted wall=刷过漆的墙），也可能带一点评价色彩，尤其在描述妆容或表情时：a painted face（浓妆/不自然的妆脸）、a painted smile（勉强的假笑）。语境会决定它是单纯“上了颜色”，还是在暗示“虚假、刻意修饰”。"]}
{"word":"paintedness","summary":{"en":"Paintedness means the quality of being painted, and (less commonly, literary) an artificial, made-up appearance.","zh":"Paintedness 指“被涂绘/上漆的性质”，也可（较少见、偏文学）指“矫饰的、粉饰出来的外表”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being painted (having paint applied), or having a painted look","zh":"被涂上颜料的状态；带有“涂绘感/彩绘感”的性质"},"examples":[{"en":"The fence’s paintedness was fading after a harsh winter.","zh":"经历了一个严冬后，篱笆上那层“刷过漆的状态”正在褪去。"},{"en":"The room’s paintedness made it feel newly renovated.","zh":"房间的“上漆感”让人觉得像刚翻新过一样。"}]},{"partOfSpeech":"n.","definition":{"en":"a deliberately artificial or made-up appearance, especially from cosmetics or showy decoration (literary, uncommon)","zh":"（尤指化妆或夸张装饰带来的）刻意的人工感、矫饰感（文学用法，较少见）"},"examples":[{"en":"She disliked the paintedness of the portrait and preferred a more natural style.","zh":"她不喜欢那幅肖像的矫饰感，更偏爱自然一点的风格。"},{"en":"In the novel, the heroine rejects the paintedness of court life.","zh":"在小说里，女主角拒绝宫廷生活的虚假与矫饰。"}]}],"synonyms":["painted quality","coatedness","artificiality","cosmetic appearance","made-up look"],"phonetic":"/ˈpeɪn.tɪd.nəs/","extraExplanation":["“paintedness”由 painted（被涂绘的/化了妆的）+ -ness（名词后缀，表示“……的状态/性质”）构成，因此既可指字面意义上的“上了漆/涂了颜料”，也可在文学语境中引申为“粉饰出来的、不自然的外表”。","在较老的英语里，painted 常可指“浓妆/涂脂抹粉”（如 painted face），因此 paintedness 有时带一点批评意味：强调外表的“装出来”“不真诚”。"]}
{"word":"painter","summary":{"en":"A painter is either an artist who creates paintings or a worker who paints houses and surfaces, depending on context.","zh":"painter 可指“画家”或“油漆工/粉刷工”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job or hobby is painting pictures (art), especially with paint on canvas or paper","zh":"画家；从事绘画艺术的人（通常指用颜料在画布或纸上作画）"},"examples":[{"en":"Frida Kahlo is a famous Mexican painter known for her self-portraits.","zh":"弗里达·卡罗是一位著名的墨西哥画家，以自画像闻名。"},{"en":"He wants to be a painter and show his work in a gallery one day.","zh":"他想成为一名画家，有一天在画廊展出作品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is painting buildings or surfaces (a house painter)","zh":"油漆工；给房屋或表面刷漆的人（如室内外墙面）"},"examples":[{"en":"We hired a painter to repaint the living room.","zh":"我们请了一位油漆工来重新粉刷客厅。"},{"en":"The painter covered the floor to protect it from drips.","zh":"油漆工把地面盖起来，防止滴漆弄脏。"}]}],"synonyms":["artist (for the art meaning)","house painter (for the building meaning)","decorator (often for interior painting in some contexts)"],"phonetic":"/ˈpeɪntər/","extraExplanation":["英语里 painter 既可以指“画家”（fine art），也可以指“油漆工/粉刷工”（trade）。语境通常能区分：art gallery（画廊）、portrait（肖像）更偏“画家”；repaint（重刷）、walls（墙面）更偏“油漆工”。","词源上，painter 来自 paint（涂颜料/油漆），因此两种职业都共享同一个核心动作：把颜色涂到表面上。"]}
{"word":"painterish","summary":{"en":"“Painterish” means having a painting-like, artistic look or style—similar to a painter’s work (often used informally; “painterly” is more common).","zh":"“Painterish”表示“像绘画/有绘画感的”，带艺术化的画面或笔触效果（较口语、较少见；更常用的是“painterly”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a painter or painting; having a style, look, or brushstroke quality that reminds people of art made with paint (often used about writing, photos, or visual design).","zh":"像画家或绘画的；具有“绘画感/画面感”的风格或效果（常用于形容文字、照片或视觉设计带有类似笔触与色彩的艺术气质）。"},"examples":[{"en":"The sunset photo looks painterish, with soft edges and rich colors.","zh":"这张夕阳照片看起来很有绘画感，边缘柔和、色彩浓郁。"},{"en":"Her descriptions are painterish—you can almost see the scene.","zh":"她的描写很有画面感，你几乎能“看见”那个场景。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Somewhat like a painter; showing a hint of a painterly style, but not strongly.","zh":"（较少见）有点像画家/绘画的；带一点绘画风格，但不算非常明显。"},"examples":[{"en":"The background is painterish, but the faces are very realistic.","zh":"背景略带绘画感，但人物脸部非常写实。"}]}],"synonyms":["painterly","artistic","picturesque","visual","illustrative"],"phonetic":"/ˈpeɪntərɪʃ/","extraExplanation":["“painterish”在现代英语中相对少见，更常见、也更自然的说法是“painterly”（绘画般的、具有绘画笔触/构图效果的）。如果你想表达“有点……的感觉”，英语里常用后缀“-ish”（表示“有点、稍微、近似”），所以“painterish”听起来像“有点绘画风”。","使用场景上，这类词常用来形容照片、电影画面、插画风格、文字描写的“画面感”，而不一定表示“真的与画家有关”。"]}
{"word":"painterlike","summary":{"en":"“Painterlike” means “like a painter’s work”—pictorial, artistic, or arranged in a way that looks painted.","zh":"“painterlike”表示“像画家作品一样的”，强调如画般、富有绘画感或具有艺术化构图与光影效果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities typical of a painter’s work; looking like it was made or arranged the way a painter would (pictorial, artistic).","zh":"具有画家作品的特征；看起来像画家创作或布置出来的（如画般的、富有绘画感的）。"},"examples":[{"en":"The light on the mountains was so painterlike that it felt unreal.","zh":"山上的光影美得像画一样，简直不真实。"},{"en":"She described the street in painterlike detail, focusing on color and shadow.","zh":"她用很有“画面感”的细节描写那条街，特别强调色彩和阴影。"},{"en":"The film uses painterlike composition, almost like a series of canvases.","zh":"这部电影的构图很有绘画感，几乎像一幅幅画布作品。"}]}],"synonyms":["painterly","pictorial","picturesque","artistic"],"phonetic":"/ˈpeɪntɚˌlaɪk/","extraExplanation":["“painterlike”是由“painter（画家）+ -like（像……一样的）”构成的形容词，常用来形容风景、光影、构图或描写方式很“有画面感”。在日常表达中也常见近义说法如“pictorial / picturesque / painterly”。","注意拼写：更常见的形式是“painterly”（更偏“具有绘画笔触/风格”），而“painterlike”更直观地表示“像画家那样/像画一样”。"]}
{"word":"painterliness","summary":{"en":"“Painterliness” means the quality of being painterly—having a painting-like look with visible brushwork and emphasis on overall effect.","zh":"“Painterliness”指“绘画性/画意”：呈现像绘画一样的视觉效果，常见笔触感明显、重整体氛围与色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or style of looking like a painting—especially with visible brushstrokes, soft edges, rich color, and emphasis on overall visual effect rather than sharp detail.","zh":"（绘画或视觉作品的）绘画性；画意；指具有“像画一样”的风格特征，常见为笔触可见、边缘柔和、色彩丰厚，重整体效果而非清晰细节。"},"examples":[{"en":"The photographer increased the painterliness of the image by using warmer colors and softer focus.","zh":"摄影师通过更暖的色调和更柔的焦点增强了画面的绘画性。"},{"en":"Critics praised the film’s painterliness, noting how each scene resembled an oil painting.","zh":"评论家称赞这部电影很有画意，认为每个镜头都像一幅油画。"},{"en":"Her watercolor has a strong painterliness, with loose strokes and subtle transitions of light.","zh":"她的水彩画绘画性很强，笔触松动，明暗过渡细腻。"}]}],"synonyms":["painterly quality","pictorial quality","paint-like style","artistic texture"],"phonetic":"/ˈpeɪntərlinəs/","extraExplanation":["“painterliness”常用于艺术评论与美术史写作，强调作品的“画面感/笔触感”（如纹理、色块、气氛），而不是线条的精确与轮廓的清晰。","在西方艺术理论中，常与“linear（线性、线描感强）”相对，用来描述更重色彩与光影、边缘更模糊、整体更自由的视觉效果。"]}
{"word":"painterly","summary":{"en":"“Painterly” describes something that looks or feels like a painting, especially in color, light, and brushstroke-like texture.","zh":"“Painterly”形容某物具有绘画般的效果，尤其体现在色彩、光影与类似笔触的质感上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the look, style, or texture of a painting (often with visible brushstrokes, rich color, or a soft, artistic feel).","zh":"具有绘画般的外观、风格或质感（常见特征是可见笔触、浓郁色彩或柔和的艺术感）。"},"examples":[{"en":"The film uses painterly lighting, so many scenes look like oil paintings.","zh":"这部电影用了绘画般的光影效果，所以很多镜头看起来像油画。"},{"en":"Her photographer’s eye creates a painterly composition of ordinary streets.","zh":"她以摄影师的眼光把普通街景构图得很有画意。"},{"en":"The designer chose a painterly floral print for the dress.","zh":"设计师为这条裙子选了带有绘画感的花卉印花。"}]}],"synonyms":["pictorial","artistic","picture-like","paintlike","illustrative"],"phonetic":"/ˈpeɪntɚli/","extraExplanation":["“painterly”常用于艺术评论、摄影、电影、设计与文学描写中，强调“像画一样”的视觉效果，而不一定真的用颜料画出来。","常见搭配：painterly style/lighting/colors/brushstrokes/composition。与“photorealistic（照片般逼真）”相对。","词源上由 painter（画家）+ -ly（构成形容词，表示“具有……特质”）构成。"]}
{"word":"painters","summary":{"en":"“Painters” is the plural of “painter”: either artists who paint pictures or workers who paint buildings/surfaces.","zh":"“painters”是“painter”的复数：可指画家，也可指给房屋/表面刷漆的油漆工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who paint pictures or create art using paint (artists).","zh":"画家；用颜料创作绘画作品的人。"},"examples":[{"en":"Many famous painters lived and worked in Paris in the 1800s.","zh":"19世纪有许多著名画家在巴黎生活并创作。"},{"en":"She wants to become a painter and show her work in a gallery.","zh":"她想成为一名画家，并在画廊展出作品。"}]},{"partOfSpeech":"n.","definition":{"en":"People whose job is to paint houses, walls, or other surfaces (a trade).","zh":"油漆工；以给房屋、墙面等刷漆为职业的人。"},"examples":[{"en":"The painters will repaint the living room next week.","zh":"油漆工下周会给客厅重新刷漆。"},{"en":"We hired painters to paint the outside of the building.","zh":"我们雇了油漆工给建筑外墙刷漆。"}]}],"synonyms":["artists","house painters","decorators"],"phonetic":"/ˈpeɪntərz/","extraExplanation":["“Painter”既可以指“画家（fine art）”，也可以指“油漆工（house painter）”。在语境里常用地点/对象来区分：gallery、canvas（画布）多半指画家；house、wall、repaint 多半指油漆工。","发音里 -er 结尾常读作 /ər/，复数 -s 读作 /z/（因为前一个音是浊辅音 /r/）。"]}
{"word":"paintership","summary":{"en":"“Paintership” means a painter’s skill or workmanship, but it’s a rare word in modern English.","zh":"“paintership”指画家的绘画技艺/功力，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the art, skill, or practice of being a painter; a painter’s workmanship (rare).","zh":"（罕见）绘画技艺；画家的技法与创作实践；画作的手艺/功力。"},"examples":[{"en":"Her paintership is confident, especially in the way she uses light.","zh":"她的绘画功力很扎实，尤其体现在用光的方式上。"},{"en":"Critics praised his paintership, noting the careful brushwork and color choices.","zh":"评论家称赞他的绘画技法，特别提到细致的笔触与配色。"}]}],"synonyms":["painting","artistry","craftsmanship","brushwork","painterly style"],"phonetic":"/ˈpeɪntərʃɪp/","extraExplanation":["“paintership”在现代英语里很少见，日常与学术写作中更常用：“painting”（绘画/绘画作品）、“painterly style”（画家式的风格）、“brushwork”（笔触/笔法）、“craftsmanship”（工艺/手艺，强调技艺层面）。","语感上，“-ship”常用于表示“状态/身份/技艺”（如 friendship, leadership），因此“paintership”可理解为“作为画家的技艺/身份”，但因为不常用，正式写作中建议改用更常见的表达。"]}
{"word":"paintier","summary":{"en":"“Paintier” means more paint-covered or more paint-like; it’s the comparative form of the uncommon adjective “painty.”","zh":"“Paintier”表示更像被油漆覆盖或更有油漆感；是较少见形容词“painty”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More covered with paint, or having a stronger paint-like look or smell (comparative of “painty,” a less common adjective).","zh":"更“有油漆感”的；更像被油漆覆盖的（“painty”的比较级；“painty”本身不太常见）。"},"examples":[{"en":"After the second coat, the door looked paintier and more evenly colored.","zh":"刷了第二遍之后，门看起来更“油漆感”了，颜色也更均匀。"},{"en":"This room smells paintier than the hallway, so let’s open a window.","zh":"这个房间闻起来比走廊更有油漆味，我们开扇窗吧。"}]}],"synonyms":["more painted","more paint-covered","more paint-like","more heavily painted"],"phonetic":"/ˈpeɪntiər/","extraExplanation":["“paintier”是形容词“painty”的比较级（-y 结尾常变成 -ier，如 happy → happier）。但在日常英语里，“painty / paintier”并不算常用；更自然的表达通常是：more painted（更像被刷过漆）、more heavily painted（漆更厚）、more paint-like（更像油漆的）、stronger paint smell（油漆味更重）。","如果你想表达“更会画画/更擅长画画”，英语一般不会用“paintier”，而会说: better at painting / more artistic / a better painter。"]}
{"word":"paintiest","summary":{"en":"“Paintiest” means “the most paint-covered or most paint-like,” often used informally.","zh":"“paintiest”意为“最沾满油漆/颜料的”或“最像油漆效果的”，多为非正式用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “painty”: having the most paint on it, or looking the most like paint (often meaning brightly colored, thickly coated, or messy with paint).","zh":"“painty”的最高级：最“像油漆/颜料”的；涂得油漆最多、颜色最浓、涂层最厚，或最沾满油漆（常带有“很花、很糊、很脏”的感觉）。"},"examples":[{"en":"Of all the chairs, this one is the paintiest—there are drips down every leg.","zh":"在所有椅子里，这把最“paintiest”——每条椅腿上都有油漆往下滴的痕迹。"},{"en":"After the art project, Mia had the paintiest hands in the class.","zh":"做完美术作业后，米娅的手是全班最沾满颜料的。"},{"en":"The paintiest part of the wall is near the corner, where someone used too many layers.","zh":"墙上最“油漆感”的地方在角落附近，因为有人刷了太多层。"}]}],"synonyms":["most paint-covered","most painted","most coated","messiest with paint","most splattered"],"phonetic":"/ˈpeɪntiɪst/","extraExplanation":["“paintiest”不是特别常见的标准词，更常见的是用“most painted / most covered in paint / messiest with paint”。不过在口语、儿童语言、创意写作里，人们会用“painty / paintiest”来表达更直观的感觉。","构词：形容词“painty”加最高级词尾“-est”。当形容词以辅音字母 + y 结尾时，通常变为“y → i + est”，所以是“paintiest”（像：happy → happiest）。","语气与场景：它通常带点轻松、夸张、带画面感的语气，常用于描述手、衣服、桌面等“沾得很惨”的状态。"]}
{"word":"paintiness","summary":{"en":"“Paintiness” means a noticeable paint-like quality, especially a strong paint smell or an artificial, paint-like look.","zh":"“Paintiness”指明显的“油漆感”，常指油漆味很重，或外观显得很像油漆、偏假。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of looking, smelling, or feeling like paint; a strong “paint-like” character (often used when the paint smell or appearance is noticeable).","zh":"像油漆的特征；带有明显“油漆感”的性质（常指气味、外观或触感很像油漆）。"},"examples":[{"en":"The room had a noticeable paintiness after we finished the walls.","zh":"墙刷完后，房间里有很明显的油漆味。"},{"en":"I don’t like the paintiness of this cheap varnish—it looks too glossy and artificial.","zh":"我不喜欢这种便宜清漆的“油漆感”——看起来太亮、太假了。"},{"en":"Even after it dried, there was still some paintiness in the air.","zh":"即使干了，空气里还是残留一些油漆味。"}]}],"synonyms":["paint smell","smell of paint","paint-like odor","paint odor","chemical smell"],"phonetic":"/ˈpeɪn.ti.nəs/","extraExplanation":["“paintiness”不是非常常见的标准词，更常见的表达是“a paint smell / smell of paint”“paint-like smell”“paint odor”。它属于可理解但偏口语/描述性的造词。","词尾“-iness”常用来把形容词变成名词，表示“……的性质/状态”，例如：clean → cleanliness（清洁）、happy → happiness（幸福）、sticky → stickiness（黏性）。对应地，painty（像油漆的）→ paintiness（油漆感/油漆味）。"]}
{"word":"painting","summary":{"en":"Painting can mean a painted artwork, the art/activity of making pictures with paint, or the job of covering surfaces with paint.","zh":"painting 可指画作、绘画活动/艺术，也可指给墙面等刷漆的工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A picture made with paint; the artwork itself.","zh":"（用颜料创作的）绘画作品；画作。"},"examples":[{"en":"That painting looks like it was done in watercolor.","zh":"那幅画看起来是用水彩画的。"},{"en":"The museum bought a famous painting by Monet.","zh":"博物馆买下了一幅莫奈的名画。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity or art of making pictures with paint.","zh":"绘画（这项活动/艺术）；画画。"},"examples":[{"en":"Painting helps her relax after work.","zh":"下班后画画能帮助她放松。"},{"en":"He is studying painting at art school.","zh":"他正在艺术学校学习绘画。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of covering a surface with paint (such as a wall or a fence).","zh":"（给墙、栅栏等）刷漆；涂油漆的工作。"},"examples":[{"en":"The painting of the living room took all weekend.","zh":"刷客厅的漆花了整个周末。"},{"en":"Wear old clothes for painting.","zh":"刷漆时穿旧衣服。"}]}],"synonyms":["artwork","picture","work of art","canvas","paint job"],"phonetic":"/ˈpeɪn.tɪŋ/","extraExplanation":["在英语里，painting 既可以指“画作”（一幅具体的画），也可以指“绘画这项艺术/活动”，还常用于指“刷墙、刷漆”的工作。理解时可以看上下文：在 museum/artist/portrait 等语境里多半是“画作/绘画”；在 wall/room/house 等语境里多半是“刷漆”。","常见搭配：oil painting（油画）, watercolor painting（水彩画）, landscape painting（风景画）, portrait painting（肖像画）；the painting of + 地点/物体（……的刷漆工程）。"]}
{"word":"paintingness","summary":{"en":"“Paintingness” is a rare, playful noun meaning the quality of looking or feeling like a painting.","zh":"“Paintingness”是少见且偏口语/随意的名词，指“像画一样的特质/绘画感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) The quality or feeling of being like a painting; a painting-like look (often used playfully or in art talk).","zh":"（非标准/少见）“像画一样”的特质或感觉；具有绘画感、画面感（常见于较随意的艺术讨论中）。"},"examples":[{"en":"The soft light gives the photo a kind of paintingness.","zh":"柔和的光线让这张照片有一种“绘画感”。"},{"en":"I like the paintingness of her landscapes—everything looks calm and unreal.","zh":"我喜欢她风景作品的“画面感”——一切看起来安静又有点不真实。"}]}],"synonyms":["painterliness","painterly quality","pictorial quality","painting-like feel"],"phonetic":"/ˈpeɪn.tɪŋ.nəs/","extraExplanation":["“paintingness”不是常见标准词，更像是临时造词（nonce word）。英语里常用“-ness”把形容词变成名词（如 darkness, kindness），表示“……的性质/状态”。但“painting”本身是名词/动名词，所以“paintingness”多用于口语或艺术评论里，带一点幽默或强调效果。","在更自然的表达中，你可以用：“painterly quality”（绘画质感）、“a painterly look/style”（绘画般的外观/风格）、“the painting-like feel”（像画一样的感觉）、或“pictorial quality”（画面感/图像美感）。"]}
{"word":"paintings","summary":{"en":"“Paintings” most often means multiple works of art made with paint; “painting” can also mean the activity of painting.","zh":"“paintings”通常指多幅绘画作品（画作）；“painting”也可指绘画/刷漆这项活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Works of art made with paint (pictures painted on canvas, paper, walls, etc.).","zh":"绘画作品；画作（用颜料画出的艺术作品，如画布、纸张或墙上的画）。"},"examples":[{"en":"The museum has a new exhibition of Impressionist paintings.","zh":"博物馆有一个新的印象派绘画展。"},{"en":"She collects landscape paintings from the 19th century.","zh":"她收藏19世纪的风景画。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity or process of putting paint on a surface (often used as an uncountable noun: “painting”).","zh":"涂漆；绘画（把颜料涂在表面上的过程；常作不可数名词“painting”）。"},"examples":[{"en":"Painting the kitchen took all weekend.","zh":"给厨房刷漆花了整个周末。"},{"en":"He relaxed by painting after work.","zh":"他下班后靠画画放松。"}]}],"synonyms":["artworks","pictures","works (of art)","canvases","oil paintings"],"phonetic":"/ˈpeɪntɪŋ/","extraExplanation":["“paintings”通常是可数名词，指多幅“画作”。如果你想表达“绘画/刷漆这项活动”，更常用不可数的“painting”（例如：I enjoy painting）。"]}
{"word":"paintless","summary":{"en":"“Paintless” means “done without paint,” especially in car repair (paintless dent repair).","zh":"“Paintless”意为“无需喷漆/不需要上漆”，尤其常见于汽车修复（免喷漆凹痕修复）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not requiring paint; done without applying paint (often used for repair methods that keep the original paint).","zh":"无需喷漆的；不需要上漆即可完成的（常用于指保留原车漆的修复方式）。"},"examples":[{"en":"The shop specializes in paintless dent repair.","zh":"这家店专门做免喷漆凹痕修复。"},{"en":"A paintless method can fix small dings without changing the car’s color.","zh":"免喷漆的方法可以修复小凹点，而不改变车身颜色。"}]}],"synonyms":["no-paint","without paint","nonpainting"],"phonetic":"/ˈpeɪntləs/","extraExplanation":["“paintless”最常见于汽车行业，尤其是“paintless dent repair (PDR) 免喷漆凹痕修复”。这种工艺通常从车身背面把金属顶回原形，前提是原车漆没有破裂或严重掉漆。","构词法：paint（油漆/喷漆）+ -less（“没有……的”）。类似结构还有：wireless（无线的）、sugarless（无糖的）。","在日常英语里它不是特别常用，更常见的替代表达有“without paint / no-paint / no repaint needed”。"]}
{"word":"paintpot","summary":{"en":"A paintpot is a small container used to hold paint while you’re painting.","zh":"paintpot 指用于盛放油漆的小容器，常在涂刷时使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (often a small pot or can) that holds paint, especially while painting.","zh":"装油漆的容器（常见为小罐/小桶），尤指在涂刷或作画时用来盛放油漆。"},"examples":[{"en":"He dipped the brush into the paintpot and started on the fence.","zh":"他把刷子蘸进油漆罐里，开始刷栅栏。"},{"en":"Keep the lid on the paintpot so the paint doesn’t dry out.","zh":"把油漆罐盖好，免得油漆变干。"}]}],"synonyms":["paint pot","paint can","paint bucket","paint tin"],"phonetic":"/ˈpeɪntˌpɑt/","extraExplanation":["“paintpot”多写作两个词“paint pot”，日常更常见的说法还有“paint can”（油漆罐，通常更大）或“paint bucket”（油漆桶）。","这是一个复合名词：paint（油漆）+ pot（罐/小锅）。在英式英语里“paint pot”也可用于指小容量的颜料/油漆罐。"]}
{"word":"paintproof","summary":{"en":"“Paintproof” means paint-resistant: paint won’t easily stick, soak in, or damage the surface.","zh":"“paintproof”指“防涂漆/抗油漆的”：油漆不易附着、渗透或造成损坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Protected against paint—designed so paint will not stick, soak in, or cause damage; paint-resistant.","zh":"防涂漆的；抗油漆的——经过处理或设计，使油漆不易附着、渗透或造成损坏。"},"examples":[{"en":"Use a paintproof drop cloth to protect the floor during the renovation.","zh":"装修时用防涂漆的防护布来保护地板。"},{"en":"The label says the fabric is paintproof, but test it on a small area first.","zh":"标签写这块布料防涂漆，但最好先在小范围测试。"}]}],"synonyms":["paint-resistant","paint-repellent","paint-safe"],"phonetic":"/ˈpeɪntˌpruːf/","extraExplanation":["“paintproof”不是特别常见的标准词，更常见的说法是“paint-resistant（耐油漆/防油漆）”“paint-repellent（拒漆）”“paint-safe（不怕油漆弄脏/对油漆安全）”。在装修、工业涂装、防护用品或材料说明里可能会看到“paintproof”作为营销或技术描述。","注意与“waterproof（防水）”类比：proof在这里有“能抵御/不受影响”的含义，但对油漆来说效果常取决于油漆类型（乳胶漆、油性漆等）和材料表面处理。"]}
{"word":"paintress","summary":{"en":"“Paintress” is an old-fashioned word meaning a woman painter; today people usually say “painter.”","zh":"“paintress”是较旧式的说法，意为“女画家”；现代英语通常直接说“painter”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who paints (a female painter); an old-fashioned word that is rare in modern English.","zh":"女画家；（较旧式、现代英语中少用的说法）"},"examples":[{"en":"In older writings, she was described as a talented paintress from London.","zh":"在较早的文字中，她被描述为一位来自伦敦的才华横溢的女画家。"},{"en":"Today, most people would simply say “painter” instead of “paintress.”","zh":"今天，大多数人会说“painter”，而不是“paintress”。"}]}],"synonyms":["painter","woman painter (less common)","female artist"],"phonetic":"/ˈpeɪntrəs/","extraExplanation":["“paintress”属于带有性别标记的旧式名词，结尾 -ess 常用来表示“女性”（如 actress, waitress）。现代英语更倾向使用不分性别的职业称呼（painter, actor, server），因为更中性也更常见。","在文学或历史语境里你可能会见到“paintress”，用来强调人物是女性或呼应当时的语言习惯；在日常写作与正式场合通常建议用“painter”。"]}
{"word":"paintrix","summary":{"en":"“Paintrix” is not a common dictionary word; it’s likely a name or a creative spelling related to painting.","zh":"“Paintrix”不是常见词典词汇；多半是名称或与“绘画/油漆”相关的创意拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a brand name, username, or a creative spelling of another word (such as “painter” or “paint tricks”).","zh":"不是标准英文单词；更可能是品牌名、用户名，或是对其他词（如“painter（画家）”或“paint tricks（绘画技巧/花招）”）的创意拼写。"},"examples":[{"en":"I couldn’t find “Paintrix” in a dictionary—do you mean “painter”?","zh":"我在词典里找不到“Paintrix”——你是想说“painter（画家）”吗？"},{"en":"Paintrix is the name of an app the artist uses to design posters.","zh":"Paintrix 是这位艺术家用来设计海报的一个应用名称。"}]}],"phonetic":"/ˈpeɪntrɪks/","extraExplanation":["“Paintrix”看起来像把 paint（绘画/油漆）和一个有科技感的后缀（-rix/-trix）组合在一起的造词，所以经常会出现在产品名、游戏名、账号名里，而不是正规词汇。","如果你想表达“画家”，最常用的是 painter；如果你想表达“女画家”，可以用 woman painter（更中性、常见），也可能见到 paintress（较少用，带点旧式/不常见）。","如果你告诉我你是在什么场景看到的（网站/游戏/软件/一句话里），我可以帮你判断它具体指什么。"]}
{"word":"paintroot","summary":{"en":"Paintroot is a plant (often Carolina redroot) known for roots used to make red dye.","zh":"Paintroot 指一种因根可制红色染料而得名的植物（常指卡罗莱纳红根）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (especially Carolina redroot) whose root was traditionally used to make a red dye; also the root itself used as dye material","zh":"（尤指）卡罗莱纳红根等植物的俗名；其根传统上可用来染成红色，也可指用于染料的根"},"examples":[{"en":"Indigenous communities used paintroot to produce a reddish dye for fibers and baskets.","zh":"一些原住民社群会用“paintroot”（红根）来制成偏红的染料，用于染纤维和篮筐。"},{"en":"The swampy field had wild paintroot growing along the edge.","zh":"那片潮湿的田地边缘长着野生的“paintroot”。"}]}],"synonyms":["Carolina redroot","redroot"],"phonetic":"/ˈpeɪntˌruːt/","extraExplanation":["“paintroot”不是日常高频词，更常出现在植物学、民俗史或自然写作中。它常指一种名为 Carolina redroot 的植物（学名常见为 *Lachnanthes tinctoria*），因根部可取色而得名。","拼写提示：如果你本来想查的是“paint roller（滚筒刷）”“paintbrush（画笔/画刷）”或“root（根/根源）”，告诉我你的语境，我可以给对应词条。"]}
{"word":"paintry","summary":{"en":"“Paintry” is usually a misspelling of “pantry,” meaning a place where you store food and kitchen supplies.","zh":"“paintry”通常是“pantry”的拼写错误，意思是存放食物和厨房用品的储藏间/储物柜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “pantry”) A small room or closet used to store food, drinks, and kitchen supplies.","zh":"（通常拼作“pantry”）食品储藏间；餐具或厨房用品的储藏柜/储物间。"},"examples":[{"en":"We keep rice, canned beans, and snacks in the pantry.","zh":"我们把米、罐装豆子和零食放在食品储藏间里。"},{"en":"Check the pantry before you go grocery shopping.","zh":"你去买菜之前先看看储藏间里还有什么。"}]}],"synonyms":["larder","storeroom","cupboard"],"phonetic":"/ˈpæntri/","extraExplanation":["“paintry”在英语里不常见，通常是把“pantry”（食品储藏间）拼错了。","“pantry”在美国家庭语境中很常见，常与“walk-in pantry”（可走入式储藏间）或“kitchen pantry”（厨房储藏间）搭配使用。"]}
{"word":"paints","summary":{"en":"“Paints” can mean different colors/types of paint (plural noun), or it can be the third-person singular form of the verb “paint.”","zh":"“paints”既可以是复数名词，表示多种颜料/油漆；也可以是动词 paint 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Colored substances used to cover surfaces or to make pictures; different colors/types of paint.","zh":"（复数名词）颜料；油漆（不同颜色/种类的涂料，用于上色、涂覆表面或作画）。"},"examples":[{"en":"She bought acrylic paints for her art class.","zh":"她为美术课买了丙烯颜料。"},{"en":"Keep the paints away from small children.","zh":"把颜料/油漆放在小孩够不到的地方。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “paint”) To cover a surface with paint; to create a picture using paint; to describe something in words in a vivid way.","zh":"（动词，为 paint 的第三人称单数）给……上漆/涂色；用颜料作画；（比喻）用生动的语言描绘。"},"examples":[{"en":"He paints the fence every summer.","zh":"他每年夏天都会给篱笆刷漆。"},{"en":"She paints landscapes in her free time.","zh":"她空闲时画风景画。"},{"en":"The writer paints a clear picture of life in the city.","zh":"这位作家把城市生活描绘得很清晰。"}]}],"synonyms":["colors","pigments","coatings","varnishes","lacquers"],"phonetic":"/peɪnts/","extraExplanation":["英语里 **paint** 通常既可作不可数名词（指“油漆这种材料”：Some paint），也可作可数名词（指“一幅画”或“一种/一罐油漆”：a paint / three paints）。在日常学习中更常见的是不可数用法；**paints** 多见于指“多种颜色/种类的颜料/油漆”。"]}
{"word":"painture","summary":{"en":"“Painture” is a nonstandard/old word meaning “painting/picture.” In modern English, use “painting,” “picture,” or “portrait.”","zh":"“painture”是非标准/旧用法，意思接近“painting/picture（画作/图片）”。现代英语请用“painting”“picture”或“portrait”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/obsolete) A painting or picture; an image made with paint or drawn artfully. In modern English, people usually say “painting,” “picture,” or “portrait.”","zh":"（非标准/旧用法）绘画作品；图画；用颜料画出的形象。现代英语通常用“painting”“picture”或“portrait”。"},"examples":[{"en":"In older writing, “painture” could mean a picture or painting.","zh":"在较早的文字中，“painture”可以指“图画/画作”。"},{"en":"Today you would usually say: “This painting is beautiful.”","zh":"如今你通常会说：“This painting is beautiful.”（这幅画很美。）"}]}],"synonyms":["painting","picture","portrait","artwork"],"phonetic":"ˈpeɪntʃər","extraExplanation":["“painture”在现代英语里几乎不用，更多会被当成拼写错误。你可能想写的是：\n1) painting（画作/绘画）\n2) picture（图片/图画）\n3) portrait（肖像画）\n拼写上，“painture”常见于把 paint + -ure 误拼成类似 picture 的形式。"]}
{"word":"paintwork","summary":{"en":"Paintwork means the painted surface (especially on a vehicle) and its condition.","zh":"Paintwork 指（尤其是车辆的）漆面/涂装层及其外观状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the painted surface or the layers of paint on a vehicle, machine, or building (often referring to its condition and appearance)","zh":"（车辆、机器或建筑物的）漆面；涂装层（常指其状况与外观）"},"examples":[{"en":"The car’s paintwork is scratched along the door.","zh":"这辆车的车门处漆面被刮花了。"},{"en":"Regular washing helps protect the paintwork from damage.","zh":"定期清洗有助于保护漆面不受损伤。"},{"en":"They restored the old bike’s paintwork to its original color.","zh":"他们把那辆旧自行车的漆面修复成了原来的颜色。"}]}],"synonyms":["paint","paint job","finish","coating"],"phonetic":"/ˈpeɪntˌwɝk/","extraExplanation":["“paintwork”在英式英语里更常见，尤其用于汽车保养与修复语境；美式英语里也会用，但有时会说“the paint”或“paint job”。","常见搭配：scratch/damage the paintwork（刮花/损坏漆面），protect the paintwork（保护漆面），paintwork restoration（漆面修复），factory paintwork（原厂漆）。"]}
{"word":"painty","summary":{"en":"“Painty” is an informal adjective meaning covered with paint or having a strong paint-like look/smell.","zh":"“Painty”是一个非正式形容词，表示“沾满油漆/有湿漆”或“油漆味、油漆感很强”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Covered with paint, or having wet paint on it.","zh":"（非正式）沾满油漆的；表面有（未干）油漆的。"},"examples":[{"en":"Be careful—the door is still painty.","zh":"小心点——门上还有湿漆。"},{"en":"My hands are painty from the art project.","zh":"我做美术作业把手弄得都是油漆。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Having a strong “paint” look or smell; seeming like there is too much paint.","zh":"（非正式）很“油漆味/油漆感”的；看起来或闻起来像刷了太多漆的。"},"examples":[{"en":"The room feels painty after we repainted the walls.","zh":"我们把墙重新刷了一遍后，房间里感觉油漆味很重。"},{"en":"The finish looks a little painty—maybe use a thinner coat next time.","zh":"这个表面看起来有点“糊漆感”——下次可以刷薄一点。"}]}],"synonyms":["paint-covered","paint-splattered","paint-stained","paint-smelling","paint-like"],"phonetic":"/ˈpeɪnti/","extraExplanation":["“painty”是口语/非正式用法，在正式写作里更常用“paint-covered / paint-splattered / smells of paint / paint-like”等表达。","它常见于日常对话，尤其描述“还有湿漆”或“油漆味很重”的感觉。"]}
{"word":"paiock","summary":{"en":"“Paddock” means a fenced field for animals (often horses), and it can also mean putting animals into that area.","zh":"“paddock”指（常用于马的）围场/小牧场，也可作动词指把动物赶进或关进围场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small enclosed field or fenced area, especially one used for keeping horses","zh":"（尤指养马的）围场；小牧场"},"examples":[{"en":"The horses were turned out into the paddock after breakfast.","zh":"早餐后，马被放到围场里活动。"},{"en":"There’s a small paddock behind the barn.","zh":"谷仓后面有一块小围场。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep or move (animals, especially horses) into a paddock","zh":"把（动物，尤指马）关进/赶进围场"},"examples":[{"en":"They paddocked the pony for the night.","zh":"他们把小马关进围场过夜。"}]}],"synonyms":["enclosure","pen","corral","pasture"],"phonetic":"/ˈpædək/","extraExplanation":["“paiock” 不是标准英语单词，最常见的可能是拼写想写 **paddock**（围场）。也有人会把 **peacock**（孔雀）误拼成类似形式；如果你想查的是“孔雀”，请再发一次正确拼写我可以给你对应释义。","词源小提示：**paddock** 来自较早的英语用法，原本指“小围栏/小圈地”，后来常用于马术与农场语境。"]}
{"word":"paiocke","summary":{"en":"Peacock usually means the male peafowl, famous for its colorful tail; informally it can also mean to show off.","zh":"Peacock 通常指雄孔雀，以华丽的尾羽著称；非正式用法中也可表示“炫耀、显摆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large male bird (the male peafowl) known for its bright blue-green feathers and long tail with “eye” patterns, which it can fan out to attract a mate","zh":"孔雀（雄孔雀/雄孔雀属鸟类），以蓝绿色羽毛和带“眼状斑”的长尾羽闻名，常开屏以吸引配偶"},"examples":[{"en":"The peacock spread its tail feathers like a fan.","zh":"孔雀把尾羽像扇子一样展开。"},{"en":"We saw a peacock walking proudly in the garden.","zh":"我们看到一只孔雀在花园里骄傲地走着。"}]},{"partOfSpeech":"v.","definition":{"en":"to show off in a proud or flashy way (informal)","zh":"（非正式）炫耀；卖弄；显摆"},"examples":[{"en":"He likes to peacock in front of his friends.","zh":"他喜欢在朋友面前显摆。"},{"en":"She didn’t want to peacock about her success.","zh":"她不想拿自己的成功来炫耀。"}]}],"synonyms":["peafowl","show off","flaunt","strut"],"phonetic":"/ˈpiːkɑːk/","extraExplanation":["你输入的“paiocke”看起来像拼写错误，最接近的常见英文单词是“peacock”（孔雀）。如果你想查的是别的词（比如“pancake”或其他），把正确拼写或一句例句发我，我可以再确认。","文化补充：在英语里，peacock 也常被用来形容“爱打扮、爱出风头的人”，类似中文里说“花枝招展/爱显摆”。"]}
{"word":"paip","summary":{"en":"“Pipe” most commonly means a tube for carrying water/gas, and it can also mean a smoking pipe or the pipes of musical instruments; as a verb, it means to send something through pipes or to make a clear high sound.","zh":"“Pipe”最常见指输送水/气的管道，也可指烟斗或乐器的音管；作动词可指用管道输送，或发出清亮的高音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tube used to carry water, gas, or other liquids; also a hollow tube people may smoke tobacco in (a smoking pipe).","zh":"管道；（也可指）烟斗。"},"examples":[{"en":"There’s a leak in the kitchen pipe.","zh":"厨房的管道漏水了。"},{"en":"The house has old gas pipes, so we need an inspection.","zh":"这房子的燃气管道很旧，所以需要检查。"},{"en":"In some stories, an old sailor smokes a pipe by the fire.","zh":"在一些故事里，老水手会在火炉旁抽烟斗。"}]},{"partOfSpeech":"v.","definition":{"en":"To send something (liquid, gas, or sound) through a pipe or tube; or to play/produce a high clear sound.","zh":"用管道输送（液体/气体/声音）；（也可指）吹奏/发出清亮的高音。"},"examples":[{"en":"Water is piped into the building from the reservoir.","zh":"水从水库通过管道输送到大楼里。"},{"en":"They piped hot air into the room.","zh":"他们把热空气通过管道送进房间。"},{"en":"Birds were piping in the early morning.","zh":"清晨鸟儿在清亮地鸣叫。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of pipes on an instrument such as an organ; or bagpipes as an instrument.","zh":"（管风琴等的）音管；风笛（乐器）。"},"examples":[{"en":"The church organ pipes filled the hall with sound.","zh":"教堂管风琴的音管让大厅充满了声音。"},{"en":"He learned to play the bagpipes for a cultural festival.","zh":"他为了文化节学习吹风笛。"}]}],"synonyms":["tube","conduit","duct","pipeline","smoking pipe"],"phonetic":"/paɪp/","extraExplanation":["“paip”本身不是常见英文单词；很多学习者会用它来按发音拼写“pipe”。如果你想查的是缩写“PIPE”，它在不同领域可能代表不同含义（例如项目、计算机等），需要你给出上下文句子我才能准确解释。"]}
{"word":"pair","summary":{"en":"“Pair” means two things that belong together, or two people/animals together; as a verb, it means to match or team up.","zh":"“pair”表示“一对/一双”或“两个人（一起）”；作动词表示“配对、搭配、结伴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two things of the same kind that belong together or are used together.","zh":"一对；一双（同类事物成双出现、配套使用）。"},"examples":[{"en":"I bought a pair of shoes.","zh":"我买了一双鞋。"},{"en":"These earrings come as a pair.","zh":"这副耳环是一对卖的。"},{"en":"The socks are a matching pair.","zh":"这两只袜子是一双配对的。"}]},{"partOfSpeech":"n.","definition":{"en":"Two people or animals that are together, especially in a relationship or working together.","zh":"一对（人/动物）；一对搭档；一对情侣（一起行动或有关系）。"},"examples":[{"en":"They make a great pair on stage.","zh":"他们在舞台上搭档很棒。"},{"en":"The pair walked home after dinner.","zh":"那两个人晚饭后一起走回家。"}]},{"partOfSpeech":"phrase","definition":{"en":"A set of two items; often used with “a pair of + noun.”","zh":"两件一组（常用结构：a pair of + 名词）。"},"examples":[{"en":"Can you lend me a pair of scissors?","zh":"你能借我一把剪刀吗？"},{"en":"She wore a pair of glasses.","zh":"她戴着一副眼镜。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put two things together so that they match or work as a set.","zh":"把……配对；使成对；使相配。"},"examples":[{"en":"Pair the socks after you wash them.","zh":"洗完袜子后把它们配成双。"},{"en":"She paired the salad with soup.","zh":"她把沙拉和汤搭配在一起。"}]},{"partOfSpeech":"vi.","definition":{"en":"To join with someone as a partner.","zh":"结成一对；结伴；搭档。"},"examples":[{"en":"We paired up for the project.","zh":"我们为这个项目两人一组。"},{"en":"In class, students pair off to practice speaking.","zh":"在课堂上，学生两两结对练口语。"}]}],"synonyms":["couple","duo","set","match","team up"],"phonetic":"/pɛr/","extraExplanation":["“a pair of”常用在由两部分组成、但英语里习惯用单数的物品上，比如 scissors（剪刀）、pants（裤子）、glasses（眼镜）。口语中说“a pair of scissors is…”（用 is），因为核心名词是 pair。","在美式英语里，pants 通常指“长裤”；英式英语里 trousers 更常用。两者都可以说 “a pair of pants/trousers”。"]}
{"word":"paire","summary":{"en":"“Pair” means two matching things or people, or the act of matching/putting two things together.","zh":"“pair”表示“一对（成套的两件/两人）”，也可作动词表示“配对/把……搭配在一起”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two things (or people) that are the same or go together.","zh":"一对；两个成套或相配的事物（或人）。"},"examples":[{"en":"I bought a pair of shoes.","zh":"我买了一双鞋。"},{"en":"They are a pair of good friends.","zh":"他们是一对好朋友（形影不离的朋友）。"}]},{"partOfSpeech":"n.","definition":{"en":"One of two matching things.","zh":"（一对中的）一个；配对物之一。"},"examples":[{"en":"This sock doesn’t match the other one in the pair.","zh":"这只袜子和那一对里的另一只不匹配。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put two things together because they match or work well together.","zh":"把……配成一对；使配对。"},"examples":[{"en":"Pair the wine with fish.","zh":"把葡萄酒和鱼搭配。"},{"en":"The teacher paired the students for a project.","zh":"老师把学生两两分组做项目。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become two things that go together; to form a pair.","zh":"配对；成双成对。"},"examples":[{"en":"The birds pair up in spring.","zh":"鸟在春天配对。"}]}],"synonyms":["duo","couple","set","match","partner"],"phonetic":"/pɛr/","extraExplanation":["“paire”不是常见英文单词，通常是把 **pair**（一对）拼错了；也可能是法语 **paire**（意为“同等的/一双”）。","相关常见表达：**pair up**（结对/配对）、**a pair of**（一双/一副/一条等）、**au pair**（住家互惠生：在国外家庭住家、帮忙照顾孩子并学习语言）。"]}
{"word":"paired","summary":{"en":"“Paired” usually means matched in twos or having a partner; it’s also the past form of “pair,” meaning to put two things or people together.","zh":"“paired”常指“成对的/配对的”，也可作动词“pair”的过去式/过去分词，表示“把两者配在一起”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Matched or put together in twos; having a partner or corresponding item.","zh":"成对的；配对的；有对应搭档/另一半的。"},"examples":[{"en":"The socks were neatly paired in the drawer.","zh":"袜子在抽屉里被整齐地配成一对。"},{"en":"Each student was paired with a conversation partner.","zh":"每个学生都被安排了一个对话搭档。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pair”: to match or join two people or things together.","zh":"“pair”的过去式/过去分词：把两个人或两样东西配在一起；使成对。"},"examples":[{"en":"The coach paired the new players with experienced teammates.","zh":"教练把新队员和有经验的队友配在一起。"},{"en":"In the experiment, subjects were paired based on age.","zh":"在实验中，受试者按年龄进行配对。"}]}],"synonyms":["matched","coupled","partnered","twinned"],"phonetic":"/pɛrd/","extraExplanation":["常见搭配是 “paired with … / be paired with …”，强调“与……搭配/配对”。在学术或数据语境里也常见，如 “paired samples / paired t-test（配对样本/配对t检验）”，表示两组数据一一对应（同一个人前后测量等）。"]}
{"word":"pairedness","summary":{"en":"Pairedness means the state or degree of being in a pair.","zh":"Pairedness 指“成对的状态”或“成对匹配的程度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being paired; being arranged or connected in pairs.","zh":"成对状态；成对的性质（指事物以两两一组的方式排列、出现或相互对应）。"},"examples":[{"en":"The socks were organized by their pairedness, not by color.","zh":"这些袜子是按是否成对来整理的，而不是按颜色。"},{"en":"In this activity, students check the pairedness of each card before matching it.","zh":"在这个活动中，学生在配对之前先检查每张卡片是否成对。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized) the degree to which two things are matched as a pair, such as in experiments, data, or biological structures.","zh":"（专门用法）成对匹配的程度（如在实验、数据处理或生物结构中，两者作为一对的匹配程度）。"},"examples":[{"en":"Researchers measured the pairedness between the two samples to reduce bias.","zh":"研究人员测量两组样本的成对匹配程度，以减少偏差。"},{"en":"The pairedness of the chromosomes is important during cell division.","zh":"染色体的成对状态在细胞分裂过程中很重要。"}]}],"synonyms":["pairing","paired state","coupling","matching"],"phonetic":"/ˈpɛrdnəs/","extraExplanation":["“pairedness”在日常英语中不算常见，更常用的表达是“pairing”“being paired”“paired state”。但在学术写作或技术语境里，人们会用它来强调一种“性质/指标”（类似于“-ness”构成的抽象名词，如“kindness”“darkness”）。"]}
{"word":"pairer","summary":{"en":"A “pairer” is someone or something that makes pairs—either a person who matches items/people or a tool/feature that connects two things (often devices).","zh":"“pairer”指“配对者/配对工具”：可以是把人或物配成一对的人，也可以是用于连接两样东西（常指设备）的工具或功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who pairs things or people together (someone who matches two items).","zh":"把东西或人配成一对的人；配对者。"},"examples":[{"en":"In the lab, the pairer matched each sample with its label before testing.","zh":"在实验室里，配对者在测试前把每个样本和标签配好。"},{"en":"At the event, a volunteer pairer helped newcomers find conversation partners.","zh":"在活动中，一位志愿配对者帮助新人找到聊天搭档。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device that pairs things (especially in computing: a system or feature that connects two devices).","zh":"用于配对的工具或装置（尤指计算机领域：把两台设备连接起来的系统或功能）。"},"examples":[{"en":"This Bluetooth pairer connects your headphones to your phone in seconds.","zh":"这个蓝牙配对工具能在几秒内把你的耳机连接到手机。"},{"en":"The app includes an automatic pairer for devices on the same network.","zh":"这个应用包含一个可为同一网络内设备自动配对的功能。"}]}],"synonyms":["matcher","matchmaker","connector","pairing tool"],"phonetic":"/ˈpɛrər/","extraExplanation":["“pairer”不是非常常见的日常词，更常见的表达是“matchmaker / matcher”（人）或“pairing feature / pairing tool”（功能/工具）。","在科技语境里，你也会看到“pairing”作名词或动名词（如 device pairing 设备配对）比“pairer”更自然。"]}
{"word":"pairial","summary":{"en":"“pairial” is not a standard English word; it’s likely a misspelling of “partial” or “parietal.”","zh":"“pairial”不是标准英语单词；很可能是“partial”或“parietal”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling. Most likely you meant “partial” (not complete) or “parietal” (related to the wall/side of the head or body).","zh":"非标准拼写。你很可能想写的是“partial”（部分的/不完全的）或“parietal”（顶骨的；与头部/身体壁相关的）。"},"examples":[{"en":"Did you mean partial (not complete) or parietal (anatomy term)?","zh":"你想写的是 partial（不完全的）还是 parietal（解剖学术语）？"}]}],"synonyms":["partial","parietal"],"phonetic":"ˈpɛriəl","extraExplanation":["“pairial”在常见英语词典中通常查不到，属于拼写错误的可能性较大。","partial /ˈpɑrʃəl/ 常用于日常英语：partial payment（部分付款）、partial success（部分成功）、I’m partial to…（我偏爱……）。","parietal /pəˈraɪətl/ 更偏学术/医学：parietal bone（顶骨）、parietal lobe（顶叶）。如果你告诉我你看到这个词的句子或领域（医学/日常/写作），我可以帮你确认正确单词。"]}
{"word":"pairing","summary":{"en":"“Pairing” means matching two things or people as a good pair, commonly used for food-and-drink matches, partners/teams, or device connections.","zh":"“pairing”指把两样东西或两个人配成一对，常用于美食搭配、搭档/组合，以及设备（如蓝牙）连接配对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of matching or combining two things so they work well together; a good match","zh":"配对；搭配；把两样东西配在一起使其合适/协调"},"examples":[{"en":"The chef suggested a wine pairing for the fish.","zh":"主厨为这道鱼推荐了合适的葡萄酒搭配。"},{"en":"In class, we did a pairing activity to practice new vocabulary.","zh":"课上我们做了配对活动来练习新词汇。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of forming a couple or partnership (in dating, sports, work, etc.)","zh":"结成一对；配成搭档（用于约会、运动、工作等）"},"examples":[{"en":"Their pairing in doubles tennis was surprisingly strong.","zh":"他们在网球双打中的搭档组合出人意料地强。"},{"en":"The movie focuses on an unlikely pairing between two strangers.","zh":"这部电影聚焦于两个陌生人之间一段意想不到的组合。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of arranging people or things into pairs; to pair (often used as a noun, and as a present participle in verb phrases)","zh":"配对的过程；把……分成一对对（常作名词；也可作动词短语中的现在分词）"},"examples":[{"en":"The teacher is pairing students by skill level.","zh":"老师正在按能力水平给学生配对。"},{"en":"Pairing devices is quick if Bluetooth is on.","zh":"如果蓝牙开着，设备配对会很快。"}]}],"synonyms":["matching","pairing up","coupling","partnering","combination"],"phonetic":"/ˈpɛrɪŋ/","extraExplanation":["“pairing”常见于美食语境（wine/food pairing，强调“相配、互相提升”），也常见于科技语境（Bluetooth pairing，指设备之间建立连接/绑定）。","在写作里，“an unlikely pairing”是很常见的表达，用来制造故事张力：两个性格、背景差异很大的人被迫合作或走到一起。"]}
{"word":"pairings","summary":{"en":"“Pairings” means combinations or matches—often food-and-drink matches, but also team/project matches or tournament matchups.","zh":"“pairings”指“搭配/配对/对阵安排”：常见于餐饮（食物与饮品搭配），也可指团队配对或比赛对阵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"combinations of two things that go well together, especially food and drink chosen to match in flavor.","zh":"（尤指食物与饮品的）搭配；相配的组合（强调风味相合）。"},"examples":[{"en":"The menu suggests wine pairings for each dish.","zh":"菜单为每道菜都推荐了葡萄酒搭配。"},{"en":"Cheese-and-fruit pairings are popular at parties.","zh":"奶酪与水果的搭配在聚会上很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"matches or groupings of people or things put together for a purpose.","zh":"（为某种目的而进行的）配对；配合；组合。"},"examples":[{"en":"We discussed possible pairings for the project teams.","zh":"我们讨论了项目小组的可能配对。"},{"en":"The coach tried different player pairings in practice.","zh":"教练在训练中尝试了不同的球员搭配。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of opponents/teams matched to play each other, especially in a tournament.","zh":"（尤指比赛/锦标赛中的）对阵安排；分组对阵。"},"examples":[{"en":"The tournament pairings will be announced tomorrow.","zh":"锦标赛的对阵安排将于明天公布。"},{"en":"She checked the pairings to see who she would play next.","zh":"她查看对阵表，看自己下一轮要和谁比赛。"}]}],"synonyms":["matches","combinations","pair-ups","couplings","matchups"],"phonetic":"/ˈperɪŋz/","extraExplanation":["“pairing(s)”在餐饮语境里非常常见，尤其是“wine pairings（葡萄酒配餐）”。这里的核心意思不是简单“放在一起”，而是强调口味、口感与香气的互相衬托：例如“酸度高的白葡萄酒常用来搭配更油腻的食物”。"]}
{"word":"pairle","summary":{"en":"“Pairle” is not a standard spelling; it is likely “parley,” meaning a negotiation or to negotiate with an opposing side.","zh":"“pairle”不是标准拼写；很可能是“parley”，意思是（与对立方）谈判/会谈，或进行谈判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “parley”) A discussion between opposing sides, especially to negotiate a peace agreement or deal.","zh":"（可能是想写：parley）对立双方之间的会谈，尤指为谈判停战、和平或达成协议而进行的谈判。"},"examples":[{"en":"The two armies agreed to a parley before the battle began.","zh":"两支军队在战斗开始前同意先进行谈判。"},{"en":"The captain sent an officer to request a parley with the pirates.","zh":"船长派一名军官去请求与海盗进行会谈。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Likely intended: “parley”) To talk with an opposing side in order to reach an agreement.","zh":"（可能是想写：parley）与对方谈判；和对立方会谈以达成协议。"},"examples":[{"en":"They parleyed for hours but still couldn’t agree on the terms.","zh":"他们谈判了好几个小时，但仍无法就条款达成一致。"},{"en":"The leaders met to parley over a ceasefire.","zh":"领导人会面就停火进行谈判。"}]}],"synonyms":["negotiation","talks","conference","bargain","negotiate"],"phonetic":"ˈpɑrli","extraExplanation":["“pairle”不是常见的英语单词拼写；最接近、最常见的可能是“parley”。如果你想查的是别的词（例如“pearl / pair / parable”等），把上下文句子发我，我可以精准判断。","parley常见于历史题材、海盗故事或军事语境中，带有“交战双方暂时停火、派代表出来谈”的画面感。文学/影视里也常出现“request a parley（请求谈判）”。"]}
{"word":"pairmasts","summary":{"en":"“pairmasts” means a pair of masts on a ship (two masts together).","zh":"“pairmasts”指船上的一对桅杆（两根桅杆合称）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"two masts considered together on a ship (often said when talking about a vessel’s rig or mast arrangement)","zh":"（船上的）一对桅杆；两根桅杆合称（常用于描述船的桅杆配置或帆装）"},"examples":[{"en":"The small sailing boat has a pair of masts, so it can carry more sail.","zh":"这艘小帆船有一对桅杆，所以能挂更多的帆。"},{"en":"In the old drawings, you can see a pairmasts arrangement near the center of the deck.","zh":"在旧图纸里，你能看到甲板中部附近有“一对桅杆”的配置。"}]}],"synonyms":["a pair of masts","two masts","twin masts"],"phonetic":"/per mæsts/","extraExplanation":["“pairmasts”更常见的写法是“a pair of masts”（两根桅杆）。把它连写成一个词通常见于较老的航海/造船资料、图纸标注或非标准拼写。","航海语境里，桅杆（mast）的数量和位置会影响船的帆装（rig）与操控方式；例如两桅常见于一些双桅帆船类型（如ketch、yawl、schooner等），但具体名称取决于前后桅的大小与帆的布置。"]}
{"word":"pairment","summary":{"en":"“Pairment” is likely a misspelling of “impairment,” meaning reduced ability or function (damage), often used in health or legal contexts.","zh":"“pairment”很可能是“impairment”的拼写错误，意为能力/功能减弱或损害，常用于健康或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in “impairment”) a reduction in ability or function; damage that makes something work less well.","zh":"（常见于“impairment”）功能或能力的减弱；使运作变差的损害。"},"examples":[{"en":"Hearing impairment can make it hard to follow conversations in a noisy room.","zh":"听力损伤会让人在嘈杂的房间里很难听清对话。"},{"en":"The accident caused a temporary impairment in his vision.","zh":"那次事故造成了他视力的暂时损害。"}]},{"partOfSpeech":"n.","definition":{"en":"A legal/medical term for being under the influence (e.g., alcohol or drugs) so that normal skills—especially driving—are reduced.","zh":"（法律/医学用语）因酒精或药物影响而导致正常能力（尤其驾驶能力）下降的状态。"},"examples":[{"en":"Driving with alcohol impairment is dangerous and illegal.","zh":"酒精影响下驾驶既危险又违法。"},{"en":"The test checks for impairment, not just the amount of alcohol consumed.","zh":"该测试检查的是是否影响能力，而不只是喝了多少酒。"}]}],"synonyms":["damage","harm","disability","diminishment","deterioration","decline"],"phonetic":"/ɪmˈper.mənt/","extraExplanation":["“pairment”本身不是常见英语单词；你可能想写的是 **impairment**（损害、功能减弱）。","词根提示：**impair-** 表示“使变差/损害”（来自法语词源），加上名词后缀 **-ment** 变成“……的结果/状态”，所以 **impairment** 就是“被损害的状态”。"]}
{"word":"Pairs","summary":{"en":"“Pairs” usually means sets of two that go together, or groups of two people; it can also be the verb “pairs” meaning matches into twos.","zh":"“pairs”通常指成对的东西或两人一组；也可作动词，表示“配对/搭配”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two things that go together or are used together (plural of “pair”).","zh":"（pair 的复数）一对；两件配套或一起使用的东西。"},"examples":[{"en":"I bought two pairs of socks.","zh":"我买了两双袜子。"},{"en":"These shoes come in pairs.","zh":"这些鞋是成双出售的。"}]},{"partOfSpeech":"n.","definition":{"en":"Two people or things matched or grouped together, often for an activity.","zh":"（为某种活动）配对的一组人或物；搭档。"},"examples":[{"en":"The teacher put the students into pairs.","zh":"老师把学生两两分组。"},{"en":"Work in pairs and discuss the question.","zh":"两人一组讨论这个问题。"}]},{"partOfSpeech":"v.","definition":{"en":"To match or connect people or things into twos (third-person singular: pairs).","zh":"把……配成一对；使成双（动词第三人称单数：pairs）。"},"examples":[{"en":"The app pairs users with similar interests.","zh":"这个应用会把兴趣相近的用户配对。"},{"en":"He pairs red wine with steak.","zh":"他会把红酒和牛排搭配在一起。"}]}],"synonyms":["couples","sets of two","duos","twosomes","matchups"],"phonetic":"/pɛrz/","extraExplanation":["“a pair of + 复数名词”很常见：a pair of shoes / a pair of scissors。虽然名词是复数形式，但常把整个短语当作一个整体，用单数动词：A pair of shoes is on the floor。若强调数量，可用复数：Two pairs of shoes are on the floor。","在课堂/活动指“分组”时，英语常说 in pairs（两人一组），也可说 pair work（两人合作练习）。"]}
{"word":"pairs","summary":{"en":"“Pairs” most often means two things together (the plural of “pair”), and it can also mean matching cards in games or the verb “pairs” (= puts into twos).","zh":"“pairs”最常指“两件一组/成对的东西”（pair 的复数）；也可指牌类游戏中的“对子们”，或作动词表示“配对/两两分组”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two things (or people) that are together or matched; the plural of “pair.”","zh":"两件（或两个人）一组；“pair”的复数。"},"examples":[{"en":"I bought two pairs of socks.","zh":"我买了两双袜子。"},{"en":"The shoes come in pairs.","zh":"鞋子是成双成对的。"},{"en":"We worked in pairs during the activity.","zh":"活动中我们两人一组合作。"}]},{"partOfSpeech":"n.","definition":{"en":"In some games, two cards of the same value; the plural of “pair” (as in poker).","zh":"（某些牌类游戏中）两张点数相同的牌；“pair”的复数（如扑克）。"},"examples":[{"en":"She won with two pairs.","zh":"她用两对赢了。"},{"en":"I only had one pair, so I folded.","zh":"我只有一对，所以我弃牌了。"}]},{"partOfSpeech":"v.","definition":{"en":"To put people or things into twos; third-person singular of “pair.”","zh":"把人或物配成两人/两件一组；“pair”的第三人称单数。"},"examples":[{"en":"The teacher pairs students for speaking practice.","zh":"老师把学生两两分组练口语。"},{"en":"This app pairs your phone with the speaker.","zh":"这个应用把你的手机和音箱配对。"}]}],"synonyms":["couples","twosomes","duos","sets of two"],"phonetic":"/pɛrz/","extraExplanation":["“pair”常见搭配：a pair of + 复数名词（a pair of shoes / scissors）。但“pairs”通常直接表示“几双/几对”（two pairs of shoes）。","在扑克牌里，“two pairs”更常说成“two pair”（尤其在美式口语/牌桌语境中）。"]}
{"word":"pairt","summary":{"en":"“pairt” is not standard; it likely means “part”: a section of something, a role, or to separate/leave.","zh":"“pairt”不是标准拼写；很可能是“part”：表示“部分/角色”，也可作动词表示“分开/离开”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Likely a misspelling of “part.”","zh":"（不是标准英文单词）很可能是“part”的拼写错误。"},"examples":[{"en":"Did you mean “part” (not “pairt”)?","zh":"你是想写“part”（不是“pairt”）吗？"},{"en":"This is my favorite part of the movie.","zh":"这是电影里我最喜欢的部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece, section, or portion of something larger.","zh":"（整体中的）部分；片段。"},"examples":[{"en":"Only part of the cake is left.","zh":"蛋糕只剩下一部分了。"},{"en":"This part of the city is very quiet at night.","zh":"这座城市的这一带晚上很安静。"}]},{"partOfSpeech":"n.","definition":{"en":"A role or character in a play, movie, or story.","zh":"（戏剧/电影/故事中的）角色；戏份。"},"examples":[{"en":"She got a small part in the film.","zh":"她在那部电影里得到一个小角色。"},{"en":"He learned his part quickly.","zh":"他很快就把自己的台词/戏份学会了。"}]},{"partOfSpeech":"v.","definition":{"en":"To separate or divide; to go in different directions.","zh":"分开；分离；（人/物）各自离开。"},"examples":[{"en":"The crowd parted to let the ambulance through.","zh":"人群分开让救护车通过。"},{"en":"We parted at the train station.","zh":"我们在火车站分别了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To leave someone (often used in fixed expressions).","zh":"（常用于固定表达）离开；告别。"},"examples":[{"en":"I hate to part with this old book.","zh":"我很舍不得把这本旧书送走/卖掉。"},{"en":"We had to part ways after graduation.","zh":"毕业后我们不得不各奔东西。"}]}],"synonyms":["piece","section","portion","role","separate","divide"],"phonetic":"/pɑrt/","extraExplanation":["“part”非常常用，常见搭配：\n- part of + 名词：a part of the plan（计划的一部分）\n- take part in：参加（活动）\n- for the most part：大体上；多半\n- part-time：兼职的\n\n拼写提示：你写的“pairt”里多了一个 i。正确拼写是 part。"]}
{"word":"pairwise","summary":{"en":"Pairwise means “in pairs” or “considering each pair within a group,” often used in math, data, and comparisons.","zh":"pairwise 指“成对/两两地”，或“在一组中对每一对元素逐一处理”，常用于数学、数据与比较语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to two items at a time; considering or comparing each possible pair within a set.","zh":"成对的；两两之间的；在一组事物中按“每两个一组”来考虑或比较的。"},"examples":[{"en":"We compared the models pairwise to see which one performed better.","zh":"我们把这些模型两两比较，看看哪一个表现更好。"},{"en":"Pairwise distances between cities were calculated for the map.","zh":"为了绘图，我们计算了城市之间两两的距离。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves pairs; two by two.","zh":"以成对的方式；两两地。"},"examples":[{"en":"Students lined up pairwise before entering the lab.","zh":"学生们两两排队，然后进入实验室。"},{"en":"The algorithm checks the data pairwise for inconsistencies.","zh":"这个算法两两检查数据是否有不一致。"}]}],"synonyms":["in pairs","two by two","by pairs"],"phonetic":"/ˈperˌwaɪz/","extraExplanation":["“pairwise”在日常英语里不算常见，更常出现在数学、统计、计算机与数据分析语境中，表示“对集合里的每一对元素进行比较/计算”。例如：pairwise comparison（两两比较）、pairwise distance（两两距离）、pairwise testing（两两检验）。","常见近义表达：two by two（两两地，口语更常用）；in pairs（成对地）。但“pairwise”更强调“对所有可能的配对都逐一处理”。"]}
{"word":"pais","summary":{"en":"“pais” is usually the Spanish word “país,” meaning “country.”","zh":"“pais”通常指西班牙语“país”，意思是“国家”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Spanish) a country; a nation (often written with an accent as “país”).","zh":"（源自西班牙语）国家；国度（常写作带重音符号的“país”）。"},"examples":[{"en":"Spain in Spanish is “España,” and a country is “país.”","zh":"“Spain”用西班牙语是“España”，而“国家”是“país”。"},{"en":"Mi país es México.","zh":"我的国家是墨西哥。"},{"en":"El País is a well-known newspaper from Spain.","zh":"《El País》是一份西班牙很有名的报纸。"}]}],"synonyms":["country","nation","homeland"],"phonetic":"/paɪs/","extraExplanation":["“país”里有重音符号（í），表示重读在第二个音节：pa-ÍS。很多英语语境中会省略重音写成“pais”，但在正式西语写作里通常应写“país”。","在英语文章里看到“pais”时，常见于专有名词（如《El País》）或引用西班牙语/葡萄牙语文本；它不是常见的英语单词。"]}
{"word":"paisa","summary":{"en":"“Paisa” usually means a very small money unit (1/100 of a rupee) and can also informally mean “money” in general in South Asia.","zh":"“paisa”通常指卢比的百分之一（小面额货币单位），在南亚口语中也可泛指“钱/现金”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of money worth one hundredth of a rupee, used in India, Pakistan, Nepal, and some other South Asian contexts (like “cent” is to “dollar”).","zh":"（南亚多国使用的）派萨；卢比的百分之一，类似于“分”或“美分”之于元/美元。"},"examples":[{"en":"This snack costs 50 paisa.","zh":"这份小吃要50派萨。"},{"en":"In everyday speech, people often round prices so you may not hear paisa mentioned much.","zh":"在日常口语里，人们常常把价格四舍五入，所以不一定常听到“派萨”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, South Asia) money in general; cash.","zh":"（非正式，南亚）钱；现金（泛指）。"},"examples":[{"en":"He doesn’t have enough paisa to buy a new phone.","zh":"他没有足够的钱买新手机。"},{"en":"Save your paisa for emergencies.","zh":"把钱存起来以备不时之需。"}]}],"synonyms":["cent (rough equivalent)","small change","cash (informal sense)"],"phonetic":"/ˈpaɪsə/","extraExplanation":["“paisa/paise”在印地语-乌尔都语口语中很常见：严格说单数常写paisa，复数常写paise；但在英语语境里也常把paise当作不变形式使用（尤其是在谈价格时）。","很多地方因为通货膨胀与找零习惯，日常交易中“派萨”这种小面额硬币不如过去常见，但在标价、税率或精确计算中仍会出现。","词源来自波斯语“pāy/pa”相关词根，历史上也与旧币制的小额单位有关；不同国家/地区的拼写与发音可能略有差异。"]}
{"word":"paisan","summary":{"en":"“Paisan” is slang for a friend/buddy, often implying a fellow Italian or countryman.","zh":"“Paisan”是俚语，指朋友/老兄，常含“同为意大利人或同乡”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, especially in Italian American communities) A friend or buddy; often used to mean “fellow Italian” or “countryman.”","zh":"（俚语，尤指意裔美国人社群）朋友、老兄；也常指“同为意大利人/同乡”。"},"examples":[{"en":"Hey, paisan, how’ve you been?","zh":"嗨，老兄，你最近怎么样？"},{"en":"He calls everyone from the neighborhood his paisans.","zh":"他把街区里的人都当作自己的“老伙计/同乡”。"}]}],"synonyms":["buddy","pal","friend","bro","homie","countryman"],"phonetic":"/paɪˈzɑn/","extraExplanation":["“paisan”来自意大利语/意裔方言的“paesano”（同乡、乡亲），本义偏“同一个地方的人”，在美国语境里常带有意裔社群的身份色彩。","使用时要注意语境：它可能听起来很亲切、带点街头口吻，但也可能让不熟悉的人觉得刻板化（尤其在黑帮影视语境中）。和熟人、在合适的社群语境中使用更稳妥。"]}
{"word":"paisana","summary":{"en":"Paisana means a female compatriot or woman from the same place, commonly used in Spanish-influenced contexts.","zh":"Paisana 指“女同乡/女性同胞”，多用于受西班牙语影响的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) A female compatriot; a woman from the same country, region, or community (often used in Latin American contexts).","zh":"（源自西班牙语）女同乡；同胞女性；来自同一国家、地区或社群的女性（常见于拉丁美洲语境）。"},"examples":[{"en":"When I moved to the U.S., meeting a paisana from my hometown made me feel less alone.","zh":"我搬到美国后，遇到一位来自我家乡的女同乡，让我没那么孤单。"},{"en":"She introduced me to her paisanas at the community event.","zh":"她在社区活动上把我介绍给她的几位女同乡。"}]}],"synonyms":["compatriot","countrywoman","fellow countrywoman","hometown woman"],"phonetic":"/paɪˈsɑːnə/","extraExplanation":["“paisana”是西班牙语词，在英语对话中多出现在双语或拉丁裔社群语境里；英语正式写作更常用“compatriot / countrywoman”。","对应的阳性形式是“paisano”。在不同国家/地区，“paisano/paisana”也可带有“老乡、自己人”的亲切感，语气通常比中性词“compatriot”更口语、更有社群认同。"]}
{"word":"paisanas","summary":{"en":"“Paisanas” means female compatriots or women from the same community (Spanish plural of “paisana”).","zh":"“paisanas”指女同乡/女同胞，即西班牙语“paisana”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Spanish) women from the same country or community; female compatriots (plural of “paisana”).","zh":"（源自西班牙语）同一国家或同一社区的女性；女同乡、女同胞（“paisana”的复数）。"},"examples":[{"en":"At the festival, she greeted her paisanas with hugs and laughter.","zh":"在节庆上，她用拥抱和笑声向自己的女同乡们打招呼。"},{"en":"Many paisanas in the neighborhood helped organize the food drive.","zh":"社区里很多女同乡一起帮忙组织了食物募捐活动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) women from the countryside; rural women (plural), emphasizing a traditional or local background.","zh":"（较少见）乡下女性、农村妇女（复数），强调较传统或本地的背景。"},"examples":[{"en":"The story describes paisanas who sell produce at the market every morning.","zh":"故事描写了一些乡下妇女每天早晨到市场卖农产品。"}]}],"synonyms":["compatriots","countrywomen","fellow nationals","women from the same community"],"phonetic":"/paɪˈsɑːnəz/","extraExplanation":["“paisanas”是西班牙语“paisana”的复数形式（对应阳性“paisano”，复数“paisanos”）。在美国西南部与拉丁裔社群语境中，有时会把它当作亲切的称呼，意思接近“同乡/自己人”。","在英语里也常见相关借词“paisan”（源自意大利语，常指“老乡、同乡、自己人”），但它和西语“paisana(s)”来源不同、用法也不完全一样。"]}
{"word":"paisanite","summary":{"en":"A slang word (Italian-American context) meaning a fellow Italian/compatriot; also an adjective meaning “related to paisan culture.”","zh":"意裔美国人语境的俚语：指同乡/同胞（尤指意大利人）；也可作形容词表示“与同乡圈子文化有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, mainly Italian-American) A fellow Italian or fellow person from the same hometown/region; a compatriot (often used as a friendly form of address).","zh":"（俚语，主要见于意裔美国人语境）同乡、同胞；常作亲切的称呼，尤其指“同为意大利人/同一地区的人”。"},"examples":[{"en":"Hey, paisanite—come sit with us.","zh":"嘿，同乡——过来跟我们坐一起。"},{"en":"He greeted the older man like a paisanite from the old neighborhood.","zh":"他像对老街坊的同乡一样跟那位老人打招呼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or typical of “paisan” culture or identity (Italian-American community context).","zh":"与“paisan（同乡/意裔同胞）”文化或身份有关的；带有意裔美国人社群语境色彩的。"},"examples":[{"en":"The film uses a lot of paisanite slang and gestures.","zh":"这部电影用了很多带“同乡圈子”色彩的俚语和手势。"}]}],"synonyms":["compatriot","countryman","fellow Italian","paisan"],"phonetic":"/paɪˈzɑn.aɪt/","extraExplanation":["“paisanite”并不是最常见的标准词形；更常见的是 **paisan**（也拼作 *paesan*），来源于意大利语 **paesano**（同村/同乡的人）。在美国流行文化里（如黑帮电影/电视剧、纽约/新泽西意裔社区语境）常用作亲昵称呼，但在不熟悉的人之间使用可能显得冒昧，甚至带刻板印象。使用时要看场合和关系。"]}
{"word":"paisano","summary":{"en":"Paisano means a fellow countryman/compatriot; in U.S. usage it can also refer to a Mexican/Latino person, sometimes warmly but potentially stereotypical.","zh":"Paisano 指同乡/同胞；在美国语境中也可指墨西哥裔或拉丁裔人士，可能亲切也可能带刻板印象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fellow countryman or compatriot; someone from the same country or region as you (often used among immigrants).","zh":"同乡；同胞；来自同一国家或地区的人（常见于移民语境中）。"},"examples":[{"en":"When I moved to New York, I was happy to meet a few paisanos from my hometown.","zh":"我搬到纽约后，很高兴遇到几个来自我家乡的同乡。"},{"en":"He greeted her like a paisano, speaking in the accent they both shared.","zh":"他像见到同乡一样跟她打招呼，用的是他们共有的口音。"}]},{"partOfSpeech":"n.","definition":{"en":"(In the U.S.) A term for a person of Mexican or Latin American background, especially used in the Southwest; sometimes friendly, but it can sound stereotypical depending on who says it and how.","zh":"（美国用法）指墨西哥裔或拉丁美洲裔的人，尤见于美国西南部；有时带友好意味，但也可能因说话者与语气而显得刻板或冒犯。"},"examples":[{"en":"In some older Western novels, “paisano” is used for local Mexican American characters.","zh":"在一些较早的西部小说里，“paisano”常用来称呼当地的墨西哥裔美国角色。"},{"en":"It’s better to use a person’s specific identity (like Mexican American) unless you know they welcome the word paisano.","zh":"除非你确定对方接受“paisano”这个说法，否则更好用更具体的身份称呼（如 Mexican American）。"}]}],"synonyms":["compatriot","countryman","fellow national","fellow townsman","paisan"],"phonetic":"/paɪˈsɑnoʊ/","extraExplanation":["“Paisano”来自西班牙语，词根与“país（国家）”有关，字面上有“同一国家的人”的意思。","在英语里它多出现在移民社区、美国西南部口语、以及一些带地域色彩的文学/影视作品中。","语体上偏口语、带群体认同感；但当它被外群体用来概括他人身份时，可能带有标签化或时代感。使用时注意场合与对方感受。"]}
{"word":"paisanos","summary":{"en":"Paisanos means ‘people from the same place’—fellow countrymen or hometown friends; in some U.S. contexts it especially refers to fellow Mexicans/Mexican Americans.","zh":"paisanos 指“同乡/同胞”；在一些美国语境中也常特指同为墨西哥人或墨西哥裔美国人的“自己人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the same country, region, or hometown; compatriots or fellow countrymen (often used in Spanish-influenced English).","zh":"同乡；同胞；来自同一国家、地区或家乡的人（常见于受西班牙语影响的英语语境）。"},"examples":[{"en":"In the new city, he quickly looked for other paisanos who spoke his dialect.","zh":"在新城市里，他很快就去找会说他家乡方言的同乡。"},{"en":"The restaurant became a gathering place for paisanos from the same region.","zh":"那家餐馆成了来自同一地区的同乡们的聚会地点。"}]},{"partOfSpeech":"n.","definition":{"en":"In the U.S. Southwest, a respectful or familiar term for fellow Mexicans or Mexican Americans, especially those from a similar background.","zh":"在美国西南部语境中，对同为墨西哥人或墨西哥裔美国人的一种亲切/尊重称呼，尤指背景相近的人。"},"examples":[{"en":"He greeted the workers as paisanos and asked where they were from.","zh":"他用“paisanos”向工人们打招呼，并问他们来自哪里。"},{"en":"At the festival, many paisanos shared food and stories from back home.","zh":"在节日上，许多同乡分享家乡的食物和故事。"}]}],"synonyms":["compatriots","countrymen","fellow nationals","hometown folks","fellow immigrants (context-dependent)"],"phonetic":"/paɪˈsɑːnoʊz/","extraExplanation":["“paisanos”是西班牙语“paisano”的复数形式，字面与“país（国家）/paisaje（乡土）”有关，常用于强调“来自同一地方的人”的亲近感。","在英语文本里，这个词常出现在拉美裔/边境文化背景、移民叙事或社区生活描写中；使用时要注意语境与身份认同，有时带亲密的团体内用法。"]}
{"word":"paisans","summary":{"en":"“Paisans” is the plural of “paisan,” a U.S. slang word meaning a fellow Italian/Italian American or someone from the same community; it can be friendly in-group talk but may sound stereotyped or offensive from outsiders.","zh":"“Paisans”是“paisan”的复数，在美国俚语中指意大利人/意裔美国人的同乡或同圈子朋友；圈内可显亲切，但外人使用可能带刻板印象甚至冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, mainly U.S.) A fellow Italian or Italian American; a friend from the same community.","zh":"（俚语，主要用于美国）意大利人或意裔美国人的同乡/同族人；同圈子的朋友。"},"examples":[{"en":"He greeted the older men at the bakery like they were all his paisans.","zh":"他在面包店里跟那些年长的男人打招呼，像大家都是他的同乡兄弟一样。"},{"en":"In that neighborhood, calling someone a paisan can mean “you’re one of us.”","zh":"在那个社区里，叫别人一声 paisan 往往是在说“你是自己人”。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes offensive) A casual label for an Italian person, used by outsiders; can sound stereotyped.","zh":"（有时带冒犯）外人对意大利人的随口称呼；可能带刻板印象的味道。"},"examples":[{"en":"Be careful with that word—it can come off as mocking if you’re not part of the group.","zh":"用这个词要小心——如果你不是圈内人，听起来可能像在取笑。"},{"en":"Some people dislike hearing “paisan” from strangers.","zh":"有些人不喜欢陌生人叫他们“paisan”。"}]}],"synonyms":["paesan","compatriot","fellow Italian","buddy","pal"],"phonetic":"/paɪˈzɑn/","extraExplanation":["词形：你输入的 **paisans** 是复数；单数常写 **paisan**（也常见拼写 **paesan**）。","发音：在美式英语里常读作 /paɪˈzɑn/（中间的 s 常变成 /z/ 的感觉）。","来源与语境：来自意大利语 **paesano**（同乡、同村的人）。在意裔美国人社群内有时是亲切的“自己人”称呼；但在电影/黑帮刻板印象语境中被外人使用时，可能显得不尊重。常见于影视对白（如描写意裔社区的作品）中。","使用建议：如果你不是意裔或不在相关社群里，日常更安全的说法是 **friend, buddy, local, fellow Italian/Italian American**；除非对方先这样自称或明确表示不介意。"]}
{"word":"paisas","summary":{"en":"“Paisas” is the plural of “paisa,” a small South Asian money unit (1/100 of a rupee), and it can also mean “money” informally.","zh":"“Paisas”是“paisa”的复数，指南亚的货币小单位（通常为1卢比的1/100），口语中也可泛指“钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of paisa: a small unit of money used in South Asia (especially India, Pakistan, Nepal, and Bangladesh), equal to 1/100 of a rupee (or of the local rupee-based currency).","zh":"paisa 的复数：南亚常用的货币小单位（尤指印度、巴基斯坦、尼泊尔、孟加拉国），通常等于 1 卢比的 1/100（或当地以卢比为基础的货币的 1/100）。"},"examples":[{"en":"This pen costs 50 paisas (0.50 rupee).","zh":"这支笔要 50 paisas（也就是 0.50 卢比）。"},{"en":"The shopkeeper rounded the price to the nearest paisa.","zh":"店主把价格四舍五入到最接近的 1 paisa。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, South Asian English) Money or cash in general.","zh":"（非正式，南亚英语）泛指钱、现金。"},"examples":[{"en":"I don’t have enough paisas to eat out today.","zh":"我今天没带够钱去外面吃饭。"},{"en":"He’s always looking for ways to make more paisas.","zh":"他总在想办法多赚点钱。"}]}],"synonyms":["cents","small change","cash","money","rupees"],"phonetic":"/ˈpaɪsə/","extraExplanation":["在日常口语里，paisa/paisas 有时像英语里的 “bucks” 一样，泛指“钱”，不一定严格指“分”（1/100 卢比）。","虽然 1 卢比 = 100 paisa 的概念很常见，但在现实交易中，小额硬币的使用会因国家与通胀情况而减少；你可能在标价或账目里更常见到它，而不是实际找零。","拼写上也常见 paisa（单数）/ paisas（复数）；有时在南亚语境里，人们也会用复数形式来泛指“钱”。"]}
{"word":"paise","summary":{"en":"Paise is a small unit of Indian money: 100 paise make 1 rupee, and it can also mean “small change.”","zh":"Paise 是印度货币的小单位：100 paise 等于 1 卢比，也可泛指“零钱/小钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of money in India and some neighboring countries; 100 paise = 1 rupee (₹). In everyday speech it can also mean a very small amount of money.","zh":"（印度及部分南亚国家的）货币单位“派萨/派士”；100 paise = 1 卢比（₹）。口语中也可泛指“一点点钱/零钱”。"},"examples":[{"en":"This costs 50 paise, so it’s less than one rupee.","zh":"这个要50 paise，所以不到1卢比。"},{"en":"I don’t have any paise left after buying tea.","zh":"买了茶之后我一点零钱（paise）都不剩了。"}]}],"synonyms":["paisa","small change","coins"],"phonetic":"/ˈpaɪseɪ/","extraExplanation":["“paise”常被视为“paisa”的复数形式（paisa → paise），但在口语里也经常把“paise”当作泛指零钱或小额钱的说法。","现代印度日常交易中，1卢比以下的硬币使用频率因物价与地区而异；你可能更多在价格标注、旧故事或固定说法中见到它。","常见写法与符号：₹1 = 100 paise；也可能见到缩写“p”表示paise（如“50p”）。"]}
{"word":"paisent","summary":{"en":"“Patient” means (1) calm and able to wait, or (2) a person receiving medical care.","zh":"“patient”可指（1）有耐心的；（2）病人/患者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to stay calm and not get angry or upset, especially when something takes time or is difficult","zh":"有耐心的；能沉住气的（尤其在事情耗时或困难时）"},"examples":[{"en":"Please be patient—the doctor will see you soon.","zh":"请耐心一点——医生很快就会见你。"},{"en":"She is very patient with children.","zh":"她对孩子非常有耐心。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is receiving medical care or treatment","zh":"病人；患者（正在接受医疗护理或治疗的人）"},"examples":[{"en":"The nurse checked on the patients every hour.","zh":"护士每小时查看一次病人。"},{"en":"He is a patient at this hospital.","zh":"他是这家医院的病人。"}]}],"synonyms":["tolerant","calm","understanding","sick person","medical patient"],"phonetic":"/ˈpeɪʃənt/","extraExplanation":["你输入的“paisent”很可能是拼写错误，正确拼写通常是 **patient**（有耐心的／病人）。常见混淆点是中间的字母顺序：**pa-tie-nt**，发音里有 /ʃ/ 的音（像“sh”）。","词源上与“忍受、承受”有关，因此 **patient**（有耐心的）和 **patience**（耐心）在意义上相连：能“承受等待或困难”。"]}
{"word":"paisley","summary":{"en":"Paisley is a teardrop-shaped, swirly decorative pattern, commonly seen in prints on clothing and fabrics.","zh":"Paisley 指一种水滴形、带卷曲装饰的佩斯利花纹，常见于服装与布料印花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative teardrop-shaped pattern with curved, swirling details, often used on fabric (scarves, shirts, ties) and in home décor.","zh":"佩斯利花纹；一种装饰性的“水滴形/腰果形”卷曲图案，常见于布料（围巾、衬衫、领带）和家居装饰。"},"examples":[{"en":"She wore a red paisley scarf in the winter.","zh":"冬天她戴了一条红色的佩斯利花纹围巾。"},{"en":"The sofa has a bold paisley print.","zh":"这张沙发是醒目的佩斯利印花。"},{"en":"Paisley patterns often look classic and a little retro.","zh":"佩斯利花纹常给人一种经典又有点复古的感觉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that has a paisley pattern.","zh":"佩斯利花纹的；带佩斯利图案的。"},"examples":[{"en":"He chose a paisley tie for the wedding.","zh":"他选了一条佩斯利花纹领带参加婚礼。"},{"en":"I like paisley shirts, but the design can feel busy.","zh":"我喜欢佩斯利花纹衬衫，但这个图案有时会显得很“密/花”。"}]}],"synonyms":["boteh (pattern)","printed pattern","ornamental motif"],"phonetic":"/ˈpeɪzli/","extraExplanation":["“Paisley”这个名字来自苏格兰的佩斯利镇（Paisley）。19世纪时当地大量仿制并流行起受波斯/印度纺织品启发的“腰果形（boteh）”纹样，于是这种图案在英语里就常被称为 paisley。","文化上它在20世纪60年代也常与嬉皮士与迷幻风格联系在一起；现代服饰中既可走复古路线，也可做成更简洁的现代印花。"]}
{"word":"paisleys","summary":{"en":"“Paisleys” is the plural of “paisley,” meaning the decorative teardrop-shaped pattern often seen on fabrics and designs.","zh":"“Paisleys”是“paisley”的复数，指常见于布料与装饰设计中的水滴状（弯曲叶形）装饰花纹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of curved, teardrop-shaped pattern used in fabric, wallpaper, or design (often in rich, decorative prints).","zh":"一种常见于布料、墙纸或装饰设计的“水滴状/弯曲叶形”花纹（通常图案繁复、装饰感强）。"},"examples":[{"en":"She wore a scarf with colorful paisleys.","zh":"她戴了一条有彩色佩斯利花纹的围巾。"},{"en":"The curtains are printed with blue and gold paisleys.","zh":"窗帘上印着蓝色和金色的佩斯利花纹。"},{"en":"Paisleys became popular in some Western fashion trends in the 1960s.","zh":"在20世纪60年代的一些西方时尚潮流中，佩斯利花纹曾非常流行。"}]}],"synonyms":["paisley patterns","teardrop motif","ornamental pattern"],"phonetic":"/ˈpeɪzliːz/","extraExplanation":["“paisley”既可指“佩斯利花纹（图案）”，也可指“印有这种花纹的布料/物品”。你输入的“paisleys”是复数形式，常用于表示“多种佩斯利图案/多处佩斯利花纹”。","名称来自苏格兰城镇Paisley（佩斯利），19世纪该地以仿制并大量生产这种源于波斯与印度的纹样织物而闻名；因此这种图案在英语中就叫paisley pattern。","在文化语境中，佩斯利图案常让人联想到复古、波西米亚风（boho）或某些时期的流行文化（如60年代的时尚与音乐场景）。"]}
{"word":"paiute","summary":{"en":"Paiute refers to Indigenous peoples of the Great Basin and to things related to them, including their languages.","zh":"Paiute 指美国大盆地地区的派尤特原住民，也可作形容词表示与其人民或语言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of one of several Indigenous peoples traditionally living in the Great Basin region of the western United States (especially Nevada, Utah, and parts of California, Oregon, and Idaho)","zh":"派尤特人：美国西部“大盆地”地区（尤指内华达、犹他及加州、俄勒冈、爱达荷部分地区）传统居住的多个原住民群体之一的成员"},"examples":[{"en":"The museum has an exhibit on Paiute history and basketry.","zh":"博物馆有一个关于派尤特历史与编篮工艺的展览。"},{"en":"She is Northern Paiute and teaches her community’s traditions.","zh":"她是北派尤特人，并教授自己社区的传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Paiute people or their languages","zh":"派尤特人的；与派尤特人或其语言有关的"},"examples":[{"en":"They attended a Paiute cultural festival near the reservation.","zh":"他们参加了保留地附近的派尤特文化节。"},{"en":"He is learning Paiute words from elders.","zh":"他在向长者学习派尤特语词汇。"}]}],"synonyms":["Northern Paiute","Southern Paiute"],"phonetic":"/ˈpaɪ.juːt/","extraExplanation":["“Paiute”通常指两个主要群体：Northern Paiute（北派尤特）与Southern Paiute（南派尤特）；他们的语言同属尤托-阿兹特克语系（Uto-Aztecan），但并不完全相同。","在写作中更尊重与准确的做法是尽可能具体：例如写“Northern Paiute”或“Southern Paiute”，或使用具体部落/社区名称。","用法上常首字母大写（Paiute）。当指语言时也常写作“Paiute language(s)”。"]}
{"word":"paiwari","summary":{"en":"“paiwari” is not a common English vocabulary word; it’s likely a proper name or a romanized spelling from another language.","zh":"“paiwari”不是常见英语词汇；更可能是专有名词或来自其他语言的罗马字拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is most likely a proper name (e.g., a surname or place name) used in South Asia.","zh":"不是主流英语词典中的标准词汇；更可能是专有名词（如姓氏或地名），在南亚语境中使用。"},"examples":[{"en":"I couldn’t find “paiwari” in an English dictionary; it may be a family name.","zh":"我在英语词典里查不到“paiwari”；它可能是一个姓。"},{"en":"Could you tell me which language “paiwari” comes from, or where you saw it?","zh":"你能告诉我“paiwari”来自哪种语言，或你是在哪里看到的吗？"}]}],"phonetic":"/ˌpaɪˈwɑːri/","extraExplanation":["“paiwari”看起来像是南亚地区（如印度、尼泊尔、巴基斯坦、孟加拉等）常见的罗马字拼写形式之一：同一个词/名字在不同人手里可能会写成不同拼法（例如元音 a/i/u 的变化，或 w/v 的变化）。","如果你想查“英文单词意思”，请提供：①出现的完整句子；②它是否是人名/地名/公司名；③你希望的语言方向（例如从印地语/尼泊尔语/乌尔都语翻成英文）。我就能更准确地解释与翻译。"]}
{"word":"paized","summary":{"en":"“Paized” isn’t a standard English word; it’s most likely “praised,” meaning “said good things about; expressed approval.”","zh":"“paized”不是标准英语单词；最可能是“praised”，意思是“称赞/表扬；表达认可”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely a misspelling) past tense and past participle of “praise”: to express approval or admiration for someone or something.","zh":"（很可能是拼写错误）“praise”的过去式/过去分词：称赞、赞美某人或某事。"},"examples":[{"en":"The teacher praised her for helping a classmate.","zh":"老师称赞她帮助了同学。"},{"en":"He was praised for his hard work.","zh":"他因努力工作而受到表扬。"}]}],"synonyms":["complimented","commended","applauded","admired","lauded"],"phonetic":"/preɪzd/","extraExplanation":["“paized”不是常见英语单词，更可能是把“praised”（/preɪzd/）少写了字母 r 的拼写错误。","“praise”常用于学校、工作或正式场合表示认可；也可用于宗教语境（praise God 表示“赞美上帝”）。"]}
{"word":"paizing","summary":{"en":"“Paizing” isn’t a standard word; it most likely means “praising” (giving approval/compliments).","zh":"“paizing”不是标准英文词，最可能是“praising”（称赞、表扬）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended) the present participle of “praise”: giving someone approval or saying they did something well.","zh":"（很可能是想写）“praise”的现在分词：称赞某人、表示认可或说做得很好。"},"examples":[{"en":"She is praising her team for finishing the project on time.","zh":"她在称赞团队按时完成了项目。"},{"en":"Stop praising him for everything—be honest and specific.","zh":"别事事都夸他——要真诚而具体。"}]}],"synonyms":["praising","complimenting","applauding","commending"],"phonetic":"/ˈpreɪzɪŋ/","extraExplanation":["“paizing”不是常见英文单词，最可能是拼写错误，想写的是“praising”（称赞）或“pausing”（暂停）。如果你告诉我你看到它的句子语境，我可以更准确判断。","“praise”常用于正式或日常场景，表示对表现、品质或努力的积极评价；也常见搭配：praise someone for something（因某事称赞某人）。"]}

