{"word":"Pak","summary":{"en":"“Pak” can mean “Pakistan” in abbreviations, but it can also be an offensive informal term for a Pakistani person in some contexts.","zh":"“Pak”既可作“Pakistan（巴基斯坦）”的简称，但在某些语境中也可能是对巴基斯坦人的冒犯性称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal; often offensive in the UK) a Pakistani person.","zh":"（非正式；在英国语境中常被视为冒犯/歧视用语）指巴基斯坦人。"},"examples":[{"en":"It’s better to say “Pakistani” instead of “Pak,” because “Pak” can sound insulting in some places.","zh":"最好说“Pakistani（巴基斯坦人）”，不要说“Pak”，因为在一些地方“Pak”可能听起来带有侮辱性。"},{"en":"The teacher explained why certain shortened words can become slurs.","zh":"老师解释了为什么某些缩略词会演变成歧视性用语。"}]},{"partOfSpeech":"n.","definition":{"en":"a short form of “Pakistan,” used in names, headlines, or abbreviations.","zh":"“Pakistan（巴基斯坦）”的简称，常用于名称、标题或缩写中。"},"examples":[{"en":"Some sports headlines shorten Pakistan to “Pak.”","zh":"一些体育新闻标题会把 Pakistan 简写成“Pak”。"},{"en":"The file name includes “Pak” to mark it as related to Pakistan.","zh":"文件名里包含“Pak”，用来标记它与巴基斯坦有关。"}]}],"synonyms":["Pakistan","Pakistani (person)"],"phonetic":"/pɑk/","extraExplanation":["“Pak”作为“巴基斯坦人”的简称在部分英语地区（尤其英国）常被当作贬称或带偏见的称呼。中性、礼貌的说法是“Pakistani person / Pakistani people（巴基斯坦人）”。","如果你只是想表达“巴基斯坦（国家）”，在正式写作中建议直接用“Pakistan”，避免歧义与不必要的冒犯。"]}
{"word":"pak","summary":{"en":"“Pak” is most commonly an abbreviation for Pakistan; as a label for a person, it’s informal and may be disrespectful—prefer “Pakistani.”","zh":"“Pak”最常见是“Pakistan（巴基斯坦）”的缩写；指人时较口语且可能不礼貌，建议用“Pakistani（巴基斯坦人）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Pakistan (abbreviation, often seen in sports scores, country codes, headlines, or on maps).","zh":"巴基斯坦（缩写；常见于体育比分、国家代码、新闻标题或地图中）。"},"examples":[{"en":"PAK will play India in the next match.","zh":"PAK 将在下一场比赛对阵印度。"},{"en":"The package was shipped to PAK.","zh":"包裹已寄往 PAK（巴基斯坦）。"}]},{"partOfSpeech":"n.","definition":{"en":"A Pakistani person (informal; can sound disrespectful in some contexts—use “Pakistani” instead).","zh":"巴基斯坦人（非正式；在一些语境中可能显得不礼貌，建议用“Pakistani”）。"},"examples":[{"en":"He is Pakistani, not “Pak.”","zh":"他是巴基斯坦人，不要说“Pak”。"},{"en":"In formal writing, use “Pakistani” to be respectful.","zh":"在正式写作中，用“Pakistani”更礼貌。"}]}],"synonyms":["Pakistan","Pakistani"],"phonetic":"/pæk/","extraExplanation":["“Pak”在英文里最常见是“Pakistan”的缩写（如体育转播、新闻标题、国家代码场景）。","把“Pak”用来指人时，可能被理解为带有轻蔑色彩的简称（与更明显的侮辱性词汇有关联）。为了尊重与避免误会，建议用中性词“Pakistani”。"]}
{"word":"pakawa","summary":{"en":"“Pakawa” is usually a proper name and not a standard English word; its meaning depends on context.","zh":"“Pakawa”通常是专有名词，不是标准英语单词；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). “Pakawa” is most commonly seen as a personal name, brand name, or place name, and its meaning depends on the language/culture or the specific context.","zh":"专有名词（不是标准英语词汇）。“Pakawa”更常见于人名、品牌名或地名；其含义取决于所属语言/文化及具体语境。"},"examples":[{"en":"Pakawa is the name of the main character in this story.","zh":"Pakawa 是这个故事里主角的名字。"},{"en":"I couldn’t find “pakawa” in an English dictionary; it may be a name or a word from another language.","zh":"我在英语词典里找不到“pakawa”；它可能是名字或来自其他语言的词。"}]}],"phonetic":"/pəˈkɑːwə/","extraExplanation":["“Pakawa”不是常见英语单词，所以英语学习中一般不会当作词汇来背。它更可能是：①某种语言里的词（需要知道来源语言）；②人名/地名/品牌名；③拼写误差（例如你本来想查另一个词）。","如果你告诉我它出现的句子、来源国家/语言，或你想表达的意思（例如“某种食物/动作/称呼”），我可以更准确地解释或帮你找到正确拼写。"]}
{"word":"pakawan","summary":{"en":"“Pakawan” means an attendant group or entourage, used mostly in Thailand/Southeast Asia cultural or historical contexts.","zh":"“pakawan”指随从/侍从群体（类似“entourage/retinue”），多用于泰国或东南亚历史文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mainly in writing about Thailand/Southeast Asian history) a group of attendants or followers who accompany an important person; an entourage or retinue.","zh":"（多见于描写泰国/东南亚历史文化的英文语境）随从、侍从群体；随行的扈从、随员；（相当于）随行人员/随从队伍。"},"examples":[{"en":"The general arrived with his pakawan and several guards.","zh":"将军带着他的随从和几名卫兵一起到达。"},{"en":"In the story, the prince travels with a loyal pakawan.","zh":"故事里，王子带着忠诚的随从一同旅行。"}]}],"synonyms":["entourage","retinue","attendants","followers"],"phonetic":"/ˌpɑːkəˈwɑːn/","extraExplanation":["“pakawan”多被视为来自泰语的文化词（常用来解释传统宫廷或贵族出行时的“随从/侍从群体”）。在一般英语日常表达中不常用；通常会直接用更常见的词如 entourage、retinue、attendants。","如果你是在泰剧、泰国历史文章或翻译作品里看到它，作者往往用它来保留当地色彩：它不仅指“人”，也暗含身份关系（主从/侍奉）与礼仪场景。"]}
{"word":"pakchoi","summary":{"en":"Pak choi is a kind of Chinese cabbage often used in Asian cooking.","zh":"Pak choi 是一种常用于亚洲料理的小白菜/青梗菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Chinese cabbage with dark green leaves and pale, crunchy stalks, often used in stir-fries and soups","zh":"一种小白菜/青梗菜（叶深绿、茎浅色且脆），常用于炒菜和汤"},"examples":[{"en":"I added pak choi to the noodles for extra crunch.","zh":"我在面里加了小白菜，让口感更脆。"},{"en":"Pak choi cooks quickly, so put it in at the end.","zh":"小白菜很快就熟，所以最后再放。"}]}],"synonyms":["bok choy","Chinese cabbage (general)"],"phonetic":"/ˌpɑk ˈtʃɔɪ/","extraExplanation":["“Pak choi”也常写作“bok choy”。两者指的通常是同一种或非常接近的蔬菜；拼写差异多与粤语/普通话音译和地区用法有关。","在英语菜单里，pak choi/bok choy常被归在“Chinese greens（中式绿叶菜）”里。常见搭配动词有：stir-fry（快炒）、blanch（汆烫）、steam（清蒸）。"]}
{"word":"pakeha","summary":{"en":"Pākehā means a New Zealander of European (non-Māori) ancestry, and it can also describe things related to European New Zealand people or culture.","zh":"Pākehā 指欧洲裔（非毛利）新西兰人，也可作形容词表示与欧洲裔新西兰人或其文化有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a New Zealander of European (non-Māori) ancestry; often used to mean “white/European New Zealander.”","zh":"（新西兰）指欧洲裔（非毛利）新西兰人；常用来表示“白人／欧洲裔新西兰人”。"},"examples":[{"en":"She is Pākehā, and her partner is Māori.","zh":"她是帕克哈（欧洲裔新西兰人），她的伴侣是毛利人。"},{"en":"The book explores relationships between Māori and Pākehā communities.","zh":"这本书探讨了毛利与帕克哈社群之间的关系。"},{"en":"In New Zealand history classes, students often discuss Māori–Pākehā relations.","zh":"在新西兰历史课上，学生常会讨论毛利人与帕克哈之间的关系。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pākehā people or European New Zealand culture.","zh":"与帕克哈（欧洲裔新西兰人）有关的；欧洲裔新西兰文化的。"},"examples":[{"en":"He grew up in a mostly Pākehā neighborhood.","zh":"他在一个以帕克哈（欧洲裔新西兰人）为主的社区长大。"},{"en":"The museum has both Māori and Pākehā exhibits.","zh":"博物馆里既有毛利展区，也有帕克哈展区。"}]}],"synonyms":["European New Zealander","European-descent New Zealander","non-Māori New Zealander"],"phonetic":"/pɑːˈkɑːhɑː/","extraExplanation":["“Pākehā”来自毛利语（Māori）。英文里也常写作“Pakeha”（不加长音符号 macron），但在新西兰语境中写作“Pākehā”更尊重原词拼写。","语气与接受度会因人而异：不少欧洲裔新西兰人把它当作中性自称，但也有人觉得被贴标签或在某些语境里带负面色彩。使用时注意场合与对方偏好；正式写作可用“European New Zealander/European-descent New Zealander”等更中性的表达。","这是强烈的新西兰文化语境词汇，常出现在历史、政治与族群关系讨论中（如“Treaty of Waitangi/怀唐伊条约”相关话题）。"]}
{"word":"pakhpuluk","summary":{"en":"“pakhpuluk” doesn’t appear to be a standard English word; it likely needs context (sentence/source) to identify.","zh":"“pakhpuluk”不是标准英语词，可能需要提供句子/来源才能确认含义与正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not found as a standard English word; it may be a misspelling, a name, or a transliteration from another language.","zh":"不是标准英语词；可能是拼写错误、人名/地名，或来自其他语言的音译。"},"examples":[{"en":"I couldn’t find “pakhpuluk” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“pakhpuluk”，你能把它出现的句子发我吗？"},{"en":"It might be a place name or a word from another language written in Latin letters.","zh":"它可能是地名，或是其他语言用拉丁字母写出来的词。"}]}],"phonetic":"/ˌpækˈpjuːlʌk/","extraExplanation":["目前在常见英语词典与语料中没有“pakhpuluk”的固定词条。最常见的情况有三类：\n1）拼写误差：例如多打/少打字母；\n2）专有名词：人名、地名、品牌名；\n3）其他语言音译：如南亚、中亚或东欧语言的词用拉丁字母拼写。\n\n如果你把它所在的整句、来源（书/网站/字幕/聊天）、以及你想表达的意思发来，我可以帮你判断它可能是哪一个词、是否有正确拼写，以及如何翻译。"]}
{"word":"pakhtun","summary":{"en":"Pakhtun refers to a Pashto-speaking ethnic group mainly in Afghanistan and northwestern Pakistan, and also means “related to their culture or language.”","zh":"Pakhtun 指主要分布在阿富汗和巴基斯坦西北部、传统上使用普什图语的普什图民族，也可作形容词表示与其语言或文化有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group mainly from Afghanistan and northwestern Pakistan, traditionally speaking Pashto","zh":"普什图人；主要分布在阿富汗和巴基斯坦西北部、传统上使用普什图语的民族成员"},"examples":[{"en":"Many Pakhtuns in Pakistan live in Khyber Pakhtunkhwa and nearby areas.","zh":"巴基斯坦的许多普什图人居住在开伯尔-普什图赫瓦省及其周边地区。"},{"en":"He is a Pakhtun poet who writes in Pashto.","zh":"他是一位用普什图语写作的普什图诗人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Pakhtun people, their language (Pashto), or their culture","zh":"普什图人的；与普什图语（Pashto）或普什图文化有关的"},"examples":[{"en":"Pakhtun culture places strong value on hospitality.","zh":"普什图文化非常重视待客之道。"},{"en":"She studies Pakhtun history and Pashto literature.","zh":"她研究普什图历史和普什图语文学。"}]}],"synonyms":["Pashtun"],"phonetic":"/ˈpɑk.tuːn/","extraExplanation":["“Pakhtun”常与“Pashtun”互换使用：一般来说，“Pashtun”更常见于英语写作，“Pakhtun”更贴近部分地区的发音与拼写习惯。","与之相关的常见文化概念有“Pashtunwali / Pakhtunwali”（普什图传统行为准则），例如强调荣誉、待客与保护来客等。"]}
{"word":"Pakistan","summary":{"en":"Pakistan: a country in South Asia; “Pakistani” describes things or people from Pakistan.","zh":"Pakistan：南亚国家；“Pakistani”用于表示“巴基斯坦的/巴基斯坦人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in South Asia, officially called the Islamic Republic of Pakistan.","zh":"巴基斯坦：南亚国家，全称“巴基斯坦伊斯兰共和国”。"},"examples":[{"en":"Pakistan borders India, Afghanistan, Iran, and China.","zh":"巴基斯坦与印度、阿富汗、伊朗和中国接壤。"},{"en":"My friend is from Pakistan, so he speaks Urdu.","zh":"我的朋友来自巴基斯坦，所以他说乌尔都语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Pakistan or its people, culture, or languages (used before a noun).","zh":"巴基斯坦的；与巴基斯坦及其人民、文化或语言相关的（作定语）。"},"examples":[{"en":"Pakistani food often includes dishes like biryani and kebabs.","zh":"巴基斯坦菜常见的有比尔亚尼炒饭和烤肉串等。"},{"en":"She studies Pakistani history at university.","zh":"她在大学学习巴基斯坦历史。"}]}],"synonyms":["Islamic Republic of Pakistan"],"phonetic":"/ˌpɑːkɪˈstɑːn/","extraExplanation":["“Pakistan”这个国名由“Pak”（纯洁）+“-stan”（地方/国家）构成，常见于一些中亚、南亚国家名中（如 Afghanistan, Kazakhstan）。","英语里指“巴基斯坦人”通常用“Pakistani”（可数名词：a Pakistani / Pakistanis）。口语中有时有人用缩写“Pak”，但在一些语境里可能带有冒犯性，建议学习者尽量避免使用，改用“Pakistani”。","巴基斯坦的官方语言是乌尔都语（Urdu），英语在政府、教育和商业中也较常使用。"]}
{"word":"Pakistan's","summary":{"en":"“Pakistan’s” is the possessive form of “Pakistan,” meaning “of Pakistan” or “belonging to Pakistan.”","zh":"“Pakistan’s”是“Pakistan”的所有格，表示“巴基斯坦的/属于巴基斯坦的”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"belonging to or connected with Pakistan (used to show possession or association).","zh":"巴基斯坦的；属于巴基斯坦的（用于表示所属或关联）。"},"examples":[{"en":"Pakistan's capital is Islamabad.","zh":"巴基斯坦的首都是伊斯兰堡。"},{"en":"The article discusses Pakistan's economy and trade.","zh":"这篇文章讨论了巴基斯坦的经济和贸易。"},{"en":"We learned about Pakistan's history in class.","zh":"我们在课堂上学习了巴基斯坦的历史。"}]}],"synonyms":["of Pakistan","Pakistani (often used as an adjective)"],"phonetic":"/ˌpɑːkɪˈstɑːnz/","extraExplanation":["“Pakistan’s”是专有名词“Pakistan”的所有格形式：通常用“名词 + ’s”表示“……的”。例如“Pakistan’s culture（巴基斯坦的文化）”。","发音上，’s常读作/z/（如Pakistan’s /…nz/），如果前一个音是清辅音则更接近/s/（如“cat’s”）。","如果你想表达“来自巴基斯坦的人/事物”，常用形容词是“Pakistani”（如“Pakistani food 巴基斯坦食物”）；而“Pakistan’s”更强调“巴基斯坦所拥有/相关的”。"]}
{"word":"Pakistani","summary":{"en":"“Pakistani” means a person from Pakistan or something related to Pakistan.","zh":"“Pakistani”指“巴基斯坦人”，或“巴基斯坦的／与巴基斯坦有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Pakistan; someone who is a citizen or native of Pakistan","zh":"巴基斯坦人；巴基斯坦的公民或本地人"},"examples":[{"en":"My neighbor is Pakistani, and she speaks Urdu and English.","zh":"我的邻居是巴基斯坦人，她会说乌尔都语和英语。"},{"en":"Many Pakistanis live and work abroad.","zh":"许多巴基斯坦人在海外生活和工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pakistan, its people, language, or culture","zh":"巴基斯坦的；与巴基斯坦、其人民、语言或文化有关的"},"examples":[{"en":"Pakistani cuisine includes dishes like biryani and nihari.","zh":"巴基斯坦菜有比尔亚尼（香料饭）和尼哈里（炖肉汤）等。"},{"en":"She studies Pakistani history in her university class.","zh":"她在大学课程里学习巴基斯坦历史。"},{"en":"We listened to Pakistani music at the festival.","zh":"我们在节日上听了巴基斯坦音乐。"}]}],"synonyms":["from Pakistan","Pakistani person"],"phonetic":"/ˌpɑːkɪˈstɑːni/","extraExplanation":["“Pakistani”既可作名词也可作形容词。写作时可把它当作国籍/身份的中性词使用。","注意区分：Pakistan（国家名）→ Pakistani（国籍/形容词）。例如：a Pakistani student（巴基斯坦学生）。","文化语境：巴基斯坦的主要语言是乌尔都语（Urdu），也有旁遮普语、信德语、普什图语等多种语言。提到文化时，尽量具体（例如“Pakistani Punjabi music”）会更准确、更尊重多样性。"]}
{"word":"pakistani","summary":{"en":"“Pakistani” means a person from Pakistan (noun) or something related to Pakistan (adjective).","zh":"“Pakistani”既可作名词表示“巴基斯坦人”，也可作形容词表示“巴基斯坦的/与巴基斯坦有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Pakistan, or someone whose family background is from Pakistan","zh":"巴基斯坦人；有巴基斯坦血统/背景的人"},"examples":[{"en":"My neighbor is Pakistani, and his family speaks Urdu at home.","zh":"我的邻居是巴基斯坦人，他家里说乌尔都语。"},{"en":"There is a large Pakistani community in this city.","zh":"这座城市有一个很大的巴基斯坦人社区。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pakistan, its people, culture, or languages","zh":"巴基斯坦的；与巴基斯坦（人民、文化、语言等）有关的"},"examples":[{"en":"We tried Pakistani food, like biryani and kebabs.","zh":"我们尝了巴基斯坦食物，比如香饭（biryani）和烤肉串（kebabs）。"},{"en":"Pakistani music is popular at the festival.","zh":"在节日上，巴基斯坦音乐很受欢迎。"}]}],"synonyms":["(adj.) from Pakistan","(adj.) relating to Pakistan"],"phonetic":"/ˌpɑːkɪˈstɑːni/","extraExplanation":["在英语中，国籍/国民形容词（如 Pakistani）常同时作名词和形容词：a Pakistani（一个巴基斯坦人）；Pakistani culture（巴基斯坦文化）。","写作时注意大小写：Pakistani 必须首字母大写，因为是专有名词/国籍词。","如果你想更具体、也更尊重对方身份，可以用“Pakistani American（巴裔美国人）”“Pakistani British（巴裔英国人）”等表达。"]}
{"word":"pakistanis","summary":{"en":"“Pakistanis” means people from Pakistan (plural).","zh":"“Pakistanis”意为“巴基斯坦人（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Pakistan; the plural of “Pakistani.”","zh":"巴基斯坦人；“Pakistani”的复数。"},"examples":[{"en":"Many Pakistanis speak more than one language, such as Urdu and English.","zh":"许多巴基斯坦人会说不止一种语言，比如乌尔都语和英语。"},{"en":"Pakistanis living abroad often keep close ties with their families back home.","zh":"旅居海外的巴基斯坦人常常与国内家人保持紧密联系。"}]},{"partOfSpeech":"other","definition":{"en":"relating to Pakistan or its people (plural form used as a noun; the adjective is usually “Pakistani”).","zh":"与巴基斯坦或其人民有关（此复数形式多作名词使用；作形容词通常用“Pakistani”）。"},"examples":[{"en":"Pakistani food is known for dishes like biryani and nihari.","zh":"巴基斯坦美食以手抓饭（biryani）和炖肉汤（nihari）等菜肴闻名。"},{"en":"She studies Pakistani history and literature.","zh":"她研究巴基斯坦的历史与文学。"}]}],"synonyms":["people from Pakistan","Pakistani people"],"phonetic":"/ˌpɑːkɪˈstɑːniz/","extraExplanation":["“Pakistani”既可以作名词（一个巴基斯坦人），也可以作形容词（巴基斯坦的）。而“Pakistanis”通常是名词复数：Pakistanis = 巴基斯坦人（复数）。","使用时注意语境与礼貌：谈论人群时尽量避免以偏概全的表述（如“Pakistanis are all …”），更自然的表达是“Many/Some Pakistanis …”（许多/一些巴基斯坦人……）。"]}
{"word":"Pakstan","summary":{"en":"Pakistan: a country in South Asia.","zh":"Pakistan：南亚国家（巴基斯坦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: Pakistan) A country in South Asia, bordering India, Afghanistan, Iran, and China, with coastline on the Arabian Sea.","zh":"（正确拼写：Pakistan）巴基斯坦：南亚国家，邻国包括印度、阿富汗、伊朗和中国，并濒临阿拉伯海。"},"examples":[{"en":"Pakistan is famous for its diverse landscapes, from mountains in the north to deserts in the south.","zh":"巴基斯坦以多样的地形闻名：北部有高山，南部有沙漠。"},{"en":"My friend moved from Pakistan to the United States for graduate school.","zh":"我的朋友为了读研究生从巴基斯坦搬到了美国。"}]}],"phonetic":"ˈpækɪstæn","extraExplanation":["你输入的“Pakstan”少了字母“i”。标准拼写是 **Pakistan**，常见形容词/国籍说法是 **Pakistani**（巴基斯坦的；巴基斯坦人）。","“Pakistan”常被解释为“纯洁之地”（源自乌尔都语/波斯语 **pak** ‘纯洁’ + **-stan** ‘地方/国家’）。现代国名在20世纪由政治与历史背景推动而确立。"]}
{"word":"paktong","summary":{"en":"Paktong is a Chinese “white metal” alloy similar to nickel silver, often used for decorative items.","zh":"Paktong 指一种中国的“白色金属”合金，类似镍银/洋白，常用于装饰性器物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese alloy (a kind of “white metal”), similar to nickel silver, used to make decorative objects such as bowls, trays, and fittings; it usually contains copper mixed with nickel (and often zinc).","zh":"白铜/“白色金属”的一种合金（与“洋白/镍银”相似），常用于制作碗、托盘、装饰件等；通常含铜与镍（且常含锌）。"},"examples":[{"en":"The antique teapot was described as paktong rather than solid silver.","zh":"这把古董茶壶被描述为“白铜（paktong）”材质，而不是纯银。"},{"en":"Victorian makers sometimes used paktong for items that looked like silver but cost less.","zh":"维多利亚时期的工匠有时用白铜制作外观像银但更便宜的器物。"}]}],"synonyms":["nickel silver","German silver","white copper"],"phonetic":"/ˈpæk.tɔŋ/","extraExplanation":["“paktong”一词常被认为来自粤语“白铜”（bak tung，字面义为“白色的铜”），早期通过贸易进入英语，用来指代一种外观近似银的中国合金。","在古董/收藏语境里，商家可能用“paktong”标注材质以区别于纯银（silver）或镀银（silver-plated）。实际配比可能因年代与地区不同而变化。"]}

