{"word":"pap","summary":{"en":"Pap can mean soft mushy food, (negative) shallow/over-sentimental writing or news, or a Pap smear (cervical cancer screening).","zh":"Pap 可指糊状软食，也可（贬义）指煽情肤浅的内容/新闻，还可指巴氏涂片检查（宫颈癌筛查）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"soft, bland food made into a thick mush (often for babies or people who are ill); porridge-like food","zh":"（常指给婴儿或病人吃的）糊状的淡味食物；粥糊"},"examples":[{"en":"The doctor suggested warm pap because it’s easy to swallow.","zh":"医生建议吃温热的糊状食物，因为容易吞咽。"},{"en":"In the past, many babies were fed pap made from milk and cereal.","zh":"过去很多婴儿会吃由牛奶和谷物做成的糊。"}]},{"partOfSpeech":"n.","definition":{"en":"(often negative) information or news that is too sentimental, simple, or meant only to please people rather than inform them seriously","zh":"（常带贬义）迎合大众、过于煽情或肤浅的报道/内容；“鸡汤式”的东西"},"examples":[{"en":"He’s tired of tabloids printing pap instead of real journalism.","zh":"他厌倦了小报只刊登煽情八卦而不做真正的新闻。"},{"en":"The speech was mostly pap—lots of nice words, little substance.","zh":"那篇演讲大多是空洞的漂亮话，没什么实质内容。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical) a Pap test (Pap smear), a screening test for cervical cancer","zh":"（医学）巴氏涂片检查（Pap test / Pap smear），用于筛查宫颈癌"},"examples":[{"en":"She scheduled her annual Pap smear with her gynecologist.","zh":"她预约了每年的巴氏涂片检查。"},{"en":"Regular Pap tests can help detect changes early.","zh":"定期做巴氏涂片检查有助于及早发现异常变化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to feed someone soft mushy food","zh":"喂（某人）糊状软食"},"examples":[{"en":"They had to pap him with soft food after the surgery.","zh":"手术后他们不得不喂他吃软糊状的食物。"}]}],"synonyms":["mush","gruel","porridge","slop","drivel","sentimentality","fluff"],"phonetic":"/pæp/","extraExplanation":["“Pap smear / Pap test”来自希腊裔美国医生 Georgios Papanikolaou（帕帕尼科劳）的姓氏，缩写为 Pap，用于宫颈癌筛查。","作为“肤浅煽情内容”的 pap 多见于英式英语语境（尤其谈小报/tabloid），语气通常带批评。"]}
{"word":"papa","summary":{"en":"“Papa” is a warm, familiar word meaning “father/dad.”","zh":"“Papa”是温暖、亲昵的说法，意思是“爸爸/父亲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a father; a familiar word for “dad,” often used by children","zh":"爸爸；对“dad”的亲昵称呼，常由孩子使用"},"examples":[{"en":"Papa, can you help me with my homework?","zh":"爸爸，你能帮我做作业吗？"},{"en":"Her papa picks her up from school every day.","zh":"她爸爸每天都去学校接她。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some families/regions) a respectful or affectionate way to refer to an older man, especially a father figure","zh":"（在一些家庭/地区）对年长男性的尊称或亲昵称呼，尤其指“父亲般的人”"},"examples":[{"en":"The kids in the neighborhood call him Papa because he always takes care of them.","zh":"邻居孩子们叫他“Papa”，因为他总是照顾他们。"},{"en":"He wasn’t my real papa, but he raised me like his own child.","zh":"他不是我亲生爸爸，但他像亲儿子一样把我养大。"}]}],"synonyms":["dad","daddy","father","pop"],"phonetic":"/ˈpɑpə/","extraExplanation":["“papa”在英语里很口语、很亲密，常见于家庭对话；正式场合更常用“father”。","在不同地区用法略有差异：例如在美式英语里“papa”有时带一点温柔、童真或家庭氛围；在某些社群中也可能作为对祖父或长辈男性的昵称（但更常见的仍是“grandpa”）。"]}
{"word":"papability","summary":{"en":"“Papability” is not standard; it’s usually a misspelling of “capability.”","zh":"“papability”不是标准拼写，通常是把“capability”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard word: “papability” is not an accepted English spelling in most dictionaries. It is usually a misspelling of “capability” (ability or power to do something).","zh":"非标准词：“papability”通常不被英语词典收录，多数情况下是把“capability”（能力、胜任力）拼错了。"},"examples":[{"en":"I think you mean “capability,” not “papability.”","zh":"我觉得你想写的是“capability”，不是“papability”。"},{"en":"The team has the capability to finish the project on time.","zh":"这个团队有能力按时完成项目。"}]}],"synonyms":["ability","capacity","competence","potential","power"],"phonetic":"/ˌkeɪpəˈbɪləti/","extraExplanation":["“capability” 常见于工作与学习语境，强调“具备做某事的能力/条件”。如果你原本想表达“可触知性、明显可感”，更接近的词是 “palpability / palpable”（比如：a palpable tension 明显可感的紧张气氛）。建议你告诉我原句，我可以帮你确认最合适的词。"]}
{"word":"papable","summary":{"en":"“Papable” is usually a misspelling of “palpable,” meaning something you can physically feel or something obviously noticeable.","zh":"“papable”通常是“palpable”的误拼，意思是“摸得到的”或“明显可感的（如气氛、情绪）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be felt or touched; real enough that you can physically notice it.","zh":"可触摸到的；能明显感觉到的（有真实的触感）。"},"examples":[{"en":"The doctor found a palpable lump under his skin.","zh":"医生摸到了他皮下一个明显的肿块。"},{"en":"You could feel a palpable vibration from the speakers.","zh":"你能感受到音箱传来的明显震动。"}]},{"partOfSpeech":"adj.","definition":{"en":"So obvious and strong that people can easily notice it (often used for feelings or atmosphere).","zh":"（常指情绪或氛围）明显到人人都能察觉的；强烈可感的。"},"examples":[{"en":"There was a palpable sense of excitement in the room.","zh":"房间里有一种明显的兴奋感。"},{"en":"The tension between them was palpable.","zh":"他们之间的紧张气氛非常明显。"}]}],"synonyms":["tangible","noticeable","evident","clear","perceptible"],"phonetic":"/ˈpælpəbəl/","extraExplanation":["“papable”在英语里不常见，很多情况下是把“palpable”拼错了；标准拼法是 palpable。","palpable 源自拉丁语 palpare（“抚摸、触摸”），所以它既可以指“摸得到”，也常引申为“明显到像摸得到一样”。"]}
{"word":"papabot","summary":{"en":"Papabot usually means a “dad/papa-style” bot or a specific bot named Papabot; it’s informal and context-dependent.","zh":"Papabot 通常指“爸爸风格”的机器人，或名为 Papabot 的特定机器人；属于非正式用法，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal, nonstandard term for a bot (automated account or program) that acts like a “papa/dad” figure—e.g., giving fatherly advice, comforting messages, or playful “dad” responses online.","zh":"（非正式、非标准用语）指一种“爸爸/老爸风格”的机器人（自动化账号或程序），常在网上提供像父亲一样的建议、安慰或带点“老爸梗”的回应。"},"examples":[{"en":"In that server, the papabot welcomes new members and gives them simple rules.","zh":"在那个社群里，papabot 会欢迎新成员并告诉他们基本规则。"},{"en":"People joked that the papabot sounded like a supportive dad.","zh":"大家开玩笑说 papabot 听起来像个很支持人的老爸。"}]},{"partOfSpeech":"n.","definition":{"en":"a username, brand name, or project name built from “papa” + “bot,” used to label a specific chatbot or automated tool.","zh":"由 “papa” + “bot” 组合而成的用户名、品牌名或项目名，用来指某个特定的聊天机器人或自动化工具。"},"examples":[{"en":"Papabot is down for maintenance, so the auto-replies aren’t working.","zh":"Papabot 在维护中，所以自动回复暂时不能用。"}]}],"synonyms":["dadbot","chatbot","auto-reply bot","bot"],"phonetic":"/ˈpɑːpəˌbɑːt/","extraExplanation":["“papabot”不是常见词典词汇，更多见于网络语境或作为某个机器人的名字。理解时可以拆开：papa（爸爸/老爸）+ bot（机器人/自动程序）。","在不同社区里它的具体功能可能不一样：有的用于欢迎新人、提醒规则，有的专门讲“dad jokes（老爸笑话）”，也可能只是一个人的账号昵称。"]}
{"word":"papabote","summary":{"en":"“papabote” isn’t recognized as standard English; it’s likely a name, misspelling, or foreign word.","zh":"“papabote”不是标准英语词；更可能是名字、拼写错误或外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “papabote” is most likely a misspelling, a username/nickname, or a word from another language.","zh":"不是标准英语单词。“papabote”很可能是拼写错误、用户名/绰号，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “papabote” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“papabote”——你能把它所在的句子发给我吗？"},{"en":"Is “papabote” a name or a brand?","zh":"“papabote”是名字还是品牌吗？"}]}],"phonetic":"/ˈpɑːpəboʊt/","extraExplanation":["从拼写来看，它可能是其他语言的组合（例如西语里“bote”可指“船/容器/罐子”等，具体取决于地区与语境），也可能是把两个词连写在一起的昵称（如“papa + bote”）。","也可能是你想输入的英语词被打错了。你可以告诉我：①出现在哪个平台/国家的内容里；②完整句子；③你想表达的意思。我就能更准确地判断并给出对应的正确英语词与用法。"]}
{"word":"papacies","summary":{"en":"“Papacies” is the plural of “papacy,” meaning either the pope’s institution/authority or the reigns of different popes.","zh":"“Papacies”是“papacy”的复数，可指教皇的制度/权威，也可指不同教皇的在位任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of papacy: the office, authority, or institution of the pope (the leader of the Roman Catholic Church).","zh":"papacy 的复数：教皇的职位、权威或教皇制度（罗马天主教会的最高领袖与其体制）。"},"examples":[{"en":"Historians compare different papacies to understand how the Church changed over time.","zh":"历史学家比较不同时期的教皇制度，以了解教会如何随时间变化。"},{"en":"In this course, we’ll look at medieval papacies and their political influence in Europe.","zh":"在这门课中，我们将研究中世纪的教皇制度及其在欧洲的政治影响。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of papacy: the period of time when a particular pope is in office (a pope’s reign).","zh":"papacy 的复数：某位教皇在位的时期（教皇任期）。"},"examples":[{"en":"The museum has documents from several papacies, including letters and official decrees.","zh":"博物馆收藏了来自数位教皇任期的文件，包括书信和官方法令。"},{"en":"Reforms began in one papacy and continued into the next.","zh":"改革在一位教皇任期中开始，并延续到下一位任期。"}]}],"synonyms":["pontificates","reigns (of popes)","the Papacy (institution)"],"phonetic":"/ˈpeɪpəsiz/","extraExplanation":["“papacy”来自拉丁语 papa（意为“父亲”），与英语中的“pope（教皇）”同源。现代英语里讨论“the Papacy”常指整个教皇制度（类似一个机构），而说“the papacy of Pope John Paul II”则更偏向“某位教皇的在位时期”。"]}
{"word":"papacy","summary":{"en":"Papacy means the Pope’s office/institution or the time a particular Pope is in power.","zh":"papacy 指教皇的职位/制度（机构），也可指某位教皇的在位时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The office, authority, or institution of the Pope (the leader of the Roman Catholic Church).","zh":"教皇的职位、权力或教皇制度（罗马天主教会的最高领袖与其机构）。"},"examples":[{"en":"During the Middle Ages, the papacy had major political influence in Europe.","zh":"在中世纪，教皇制度在欧洲具有很大的政治影响力。"},{"en":"Some reforms aimed to reduce corruption within the papacy.","zh":"一些改革旨在减少教皇制度内部的腐败。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time when a particular Pope rules; a pontificate.","zh":"某位教皇在位的时期；教皇任期。"},"examples":[{"en":"The papacy of John Paul II lasted more than twenty-six years.","zh":"若望·保禄二世的教皇任期持续了二十六年多。"},{"en":"Historians often compare different papacies to understand changes in church policy.","zh":"历史学家常比较不同教皇任期，以理解教会政策的变化。"}]}],"synonyms":["pontificate","Holy See (related)","Vatican (context-dependent)"],"phonetic":"/ˈpeɪpəsi/","extraExplanation":["“papacy”来自“pope（教皇）”，常见于历史与宗教语境，既可指“教皇这一制度/机构”（较抽象），也可指“某位教皇的在位时期”（更具体）。","搭配上常见：the papacy of + 教皇名（某位教皇的任期）；the Papacy（有时大写）可指罗马教廷/教皇制度这一机构概念。"]}
{"word":"papagallo","summary":{"en":"Papagallo means “parrot,” mainly used in Italian/Spanish-flavored contexts rather than everyday English.","zh":"Papagallo 指“鹦鹉”，多用于带有意大利语/西语风格的语境，日常英语通常说 parrot。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mostly in Italian or Spanish contexts) a parrot; a colorful tropical bird known for mimicking sounds.","zh":"（多见于意大利语或西班牙语语境）鹦鹉；一种色彩鲜艳、常能模仿声音的热带鸟类。"},"examples":[{"en":"In the story, a papagallo sits on the balcony and repeats the old sailor’s words.","zh":"故事里，一只 papagallo 坐在阳台上，重复老水手说过的话。"},{"en":"We saw a bright green papagallo in the market, and it whistled when people walked by.","zh":"我们在集市上看到一只亮绿色的 papagallo，有人经过时它就吹口哨。"}]}],"synonyms":["parrot","macaw","cockatoo"],"phonetic":"/ˌpɑːpəˈɡɑːloʊ/","extraExplanation":["“Papagallo”并不是常见的英语词，更常见于意大利语（papagallo）或与西班牙语相关的写法（更常见是 papagayo）。在英语里通常直接说 parrot。","在文学或旅行写作中，作者有时会保留原词（如 papagallo）来营造地中海或拉丁文化氛围；读者一般可按“鹦鹉”来理解。"]}
{"word":"papagay","summary":{"en":"Papagay is an old word meaning “parrot,” and sometimes figuratively a showy person.","zh":"Papagay 是一个古老用词，主要指“鹦鹉”，有时也讽刺指“爱出风头的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a parrot; a brightly colored talking bird.","zh":"（古义）鹦鹉；一种色彩鲜艳、会学人说话的鸟。"},"examples":[{"en":"In old stories, a papagay often appears in a royal garden.","zh":"在一些古老故事里，papagay（鹦鹉）常出现在王宫花园中。"},{"en":"The sailor kept a papagay on his shoulder during the voyage.","zh":"那位水手在航行中把一只鹦鹉（papagay）养在肩上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic, figurative) a showy or silly person who likes to attract attention; similar to “popinjay.”","zh":"（古义，引申）爱出风头、装腔作势的人；类似于 popinjay。"},"examples":[{"en":"He dressed like a papagay, trying to impress everyone.","zh":"他打扮得像个爱显摆的人（papagay），想让所有人都注意他。"},{"en":"Don’t be a papagay—let your work speak for you.","zh":"别当个爱出风头的人（papagay）——让你的实力来说明一切。"}]}],"synonyms":["parrot","popinjay","dandy"],"phonetic":"/ˈpæpəˌɡeɪ/","extraExplanation":["“papagay”是较古老的英语词形，现代英语更常用“parrot”。在文学或历史文本中见到它时，通常就是指“鹦鹉”。","它也可能带有讽刺意味，用来形容穿着花哨、喜欢炫耀的人，这层意思和“popinjay”很接近。","在苏格兰传统与一些历史记载中，papegay/papagay还可指一种立在杆顶的木制“鹦鹉”靶标（射箭或射击比赛用），但日常英语里很少见。"]}
{"word":"papagayo","summary":{"en":"Papagayo means “parrot” in Spanish and is also used as a name for a strong regional wind in Central America.","zh":"Papagayo在西班牙语中意为“鹦鹉”，也可指中美洲一种强烈的地区性季节风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Spanish word meaning “parrot,” sometimes used in English when talking about Spanish-speaking places, culture, or names.","zh":"西班牙语中的“鹦鹉”；在英语里有时会在谈到西语文化、地名或语境时借用。"},"examples":[{"en":"In the market they sold bright green papagayos in small cages.","zh":"在集市上，他们把翠绿色的鹦鹉（papagayos）装在小笼子里卖。"},{"en":"The children laughed when the papagayo repeated a few words.","zh":"那只鹦鹉（papagayo）重复了几句人话，孩子们就笑了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Papagayo) A strong seasonal wind in parts of Central America (especially near Nicaragua and Costa Rica), also used in names like “Papagayo winds.”","zh":"（Papagayo）中美洲部分地区（尤指尼加拉瓜、哥斯达黎加附近）的强季节性风，也用于“Papagayo winds（帕帕加约风）”等名称。"},"examples":[{"en":"Sailors waited for the Papagayo winds to weaken before leaving the bay.","zh":"水手们等到帕帕加约风减弱后才离开海湾。"},{"en":"The forecast warned of rough seas during Papagayo wind events.","zh":"预报提醒：帕帕加约风出现时海况会很差。"}]}],"synonyms":["parrot","macaw"],"phonetic":"ˌpɑpəˈɡaɪoʊ","extraExplanation":["“Papagayo”来自西班牙语，字面就是“鹦鹉”。在英语中多见于地名、文化描写或专有名词（如地名、风名），日常英语更常用“parrot”。","“Papagayo winds（帕帕加约风）”是气象/航海语境里的固定说法，指中美洲地形通道形成的强风，常影响海面风浪与航行安全。"]}
{"word":"papago","summary":{"en":"“Papago” is an older, now often avoided name for the Tohono O’odham people; use “Tohono O’odham” in modern contexts.","zh":"“Papago”是托霍诺·奥奥达姆族人的旧称，如今多建议在现代语境中改用“Tohono O’odham”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older name for the Tohono O’odham people of southern Arizona and northern Mexico (now usually avoided; Tohono O’odham is preferred).","zh":"对美国亚利桑那州南部及墨西哥北部托霍诺·奥奥达姆（Tohono O’odham）族人的旧称（现多避免使用，通常以 Tohono O’odham 为较合适称呼）。"},"examples":[{"en":"Many museum labels have replaced “Papago” with “Tohono O’odham.”","zh":"许多博物馆的展签已把“Papago”改为“Tohono O’odham”。"},{"en":"In older books, you may see the term “Papago Indians,” but today it’s better to say “Tohono O’odham people.”","zh":"在较早的书里你可能会看到“Papago Indians”，但现在更建议说“Tohono O’odham people（托霍诺·奥奥达姆族人）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Tohono O’odham people, their culture, or their language (often seen in older titles and place names).","zh":"与托霍诺·奥奥达姆族、其文化或语言有关的（常见于旧书名、旧称或地名中）。"},"examples":[{"en":"The library has an older section labeled “Papago language materials.”","zh":"图书馆里有一部分旧分类标着“Papago language materials（帕帕戈语资料）”。"},{"en":"Some older research discusses Papago basket weaving.","zh":"一些较早的研究会讨论 Papago（托霍诺·奥奥达姆）篮编工艺。"}]}],"synonyms":["Tohono O’odham","Tohono O’odham people","Tohono O’odham language"],"phonetic":"/ˈpɑːpəˌɡoʊ/","extraExplanation":["“Papago”通常被认为是外来称呼（exonym），来源与西班牙语用法有关。如今很多社群与学术、媒体写作更倾向使用族人自称“Tohono O’odham”（意为“沙漠之民/沙漠人”）。","语用提醒：在写作或谈话中，如果指当代社群与文化，优先使用“Tohono O’odham”。“Papago”更多出现在历史文献、旧地图、旧学术标题或某些地名中；在引用旧文本时可使用，但建议说明这是旧称。"]}
{"word":"papain","summary":{"en":"Papain is a papaya-derived enzyme that breaks down proteins.","zh":"Papain 是从木瓜提取、能分解蛋白质的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural enzyme from papaya that breaks down proteins; used in meat tenderizers, digestion aids, and some medical or cosmetic products","zh":"木瓜蛋白酶：一种从木瓜中提取的天然酶，能分解蛋白质；常用于嫩肉粉、助消化产品，以及部分医疗或护肤产品"},"examples":[{"en":"This meat tenderizer contains papain to help soften tough cuts.","zh":"这种嫩肉粉含有木瓜蛋白酶，用来软化较硬的肉。"},{"en":"Some people take papain supplements to support digestion, but you should follow medical advice.","zh":"有些人会服用木瓜蛋白酶补充剂来帮助消化，但应遵循医生或专业建议。"},{"en":"The lab used papain to break proteins into smaller pieces for testing.","zh":"实验室用木瓜蛋白酶把蛋白质分解成更小的片段以便检测。"}]}],"synonyms":["papaya enzyme","protease"],"phonetic":"/ˈpeɪpeɪn/","extraExplanation":["“papain”来自“papaya（木瓜）”。它属于“酶（enzyme）”，常被描述为“蛋白水解酶”，意思是能把蛋白质分解。","日常生活里最常见的场景是嫩肉：腌肉时少量使用能让肉更软，但用太多或时间太久可能让口感变得过烂、像糊一样。","注意易混淆：papain（木瓜蛋白酶）不是“pain（疼痛）”。发音不同，拼写也不同。"]}
{"word":"papains","summary":{"en":"Papain is an enzyme from papaya that breaks down proteins, often used as a meat tenderizer or in supplements.","zh":"Papain（木瓜蛋白酶）是来自木瓜的酶，能分解蛋白质，常用于嫩肉或某些补充剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein-cutting enzyme (protease) found in papaya fruit, used to break down meat or other proteins","zh":"一种来自木瓜的蛋白质分解酶（蛋白酶），可分解肉类或其他蛋白质"},"examples":[{"en":"This meat tenderizer contains papain to soften tough cuts.","zh":"这种嫩肉粉含有木瓜蛋白酶，可以软化较硬的肉。"},{"en":"Some digestive supplements use papain to help break down protein.","zh":"一些助消化补充剂会使用木瓜蛋白酶来帮助分解蛋白质。"}]}],"synonyms":["protease","papaya enzyme"],"phonetic":"/pəˈpeɪn/","extraExplanation":["“Papain”常见于食品与保健品语境：在烹饪中用于“嫩肉”，在实验或工业中也可用于分解蛋白质。","有些人对木瓜或乳胶（latex）过敏时，可能也会对木瓜蛋白酶敏感；含该成分的产品应留意过敏提示。"]}
{"word":"papaio","summary":{"en":"“papaio” isn’t standard English; it likely means “papaya.”","zh":"“papaio”不是标准英语；很可能指“papaya（木瓜）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; most likely a misspelling of “papaya,” a tropical fruit.","zh":"非标准拼写；很可能是“papaya（木瓜）”的拼写错误，指一种热带水果。"},"examples":[{"en":"Did you mean “papaya”? It’s a sweet tropical fruit often used in smoothies.","zh":"你是不是想写“papaya（木瓜）”？它是一种甜的热带水果，常用来做奶昔/果昔。"},{"en":"I bought papaya at the market to make a fruit salad.","zh":"我在市场买了木瓜来做水果沙拉。"}]}],"synonyms":["papaya","papaw"],"phonetic":"/pəˈpaɪə/","extraExplanation":["“papaio”不是常见英语单词。在英语里最接近、也最常见的对应是“papaya（木瓜）”，美式 IPA 常读作 /pəˈpaɪə/。在美国英语中，木瓜有时也会被叫作“papaw”，但“papaw”在不同地区也可能指另一种果树（北美番荔枝），所以写“papaya”最清楚。"]}
{"word":"papal","summary":{"en":"“Papal” means “related to the Pope or the Vatican.”","zh":"“papal”表示“与教皇或梵蒂冈有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pope (the head of the Roman Catholic Church) or to the Vatican.","zh":"与教皇（罗马天主教会领袖）或梵蒂冈有关的；教皇的。"},"examples":[{"en":"The Vatican released a papal statement on peace talks.","zh":"梵蒂冈发布了一份关于和平谈判的教皇声明。"},{"en":"They visited Rome during a papal visit to a nearby country.","zh":"他们在教皇访问附近国家期间去了罗马。"}]}],"synonyms":["pontifical","Vatican (as an adjective in news)"],"phonetic":"/ˈpeɪpəl/","extraExplanation":["“papal”来自拉丁语 papa（“父亲”，后来专指“教皇”）。在英文里它常用于正式新闻与历史语境：papal decree（教皇敕令）、papal election（教皇选举）、papal authority（教皇权威）。","文化语境提醒：Pope 在天主教中是一个特定职衔，因此 papal 通常只指“教皇/罗马教廷”的事务，不泛指一般宗教领袖。"]}
{"word":"papalise","summary":{"en":"Papalise means to make something (or become) more controlled by or aligned with the Pope and the Roman Catholic Church.","zh":"Papalise 指使某事物（或自身）更受教皇及罗马天主教会控制或更趋向其立场。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (a church, country, or policy) more controlled by or influenced by the Pope or the Roman Catholic Church; to bring under papal authority","zh":"使（教会、国家或政策）更受教皇或罗马天主教会控制/影响；使归于教皇权威"},"examples":[{"en":"Some critics argued that the reform would papalise the national church.","zh":"一些批评者认为这项改革会使国家教会“教皇化”。"},{"en":"The movement was accused of trying to papalise local religious life.","zh":"该运动被指责试图使当地宗教生活“教皇化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become more closely aligned with the Pope or the Roman Catholic Church (rare)","zh":"（罕见）变得更趋向于教皇或更贴近罗马天主教会"},"examples":[{"en":"Over time, the organization seemed to papalise rather than remain independent.","zh":"随着时间推移，该组织似乎越来越“教皇化”，而不再保持独立。"}]}],"synonyms":["papalize","romanize (in some contexts)","bring under papal authority","centralize (when focusing on power)"],"phonetic":"/ˈpeɪpəˌlaɪz/","extraExplanation":["“papalise”是较少见的拼写形式，更常见的是“papalize”（美式更偏好 -ize），两者意义相同。","该词多出现在历史、宗教或政治评论语境中，带有评价色彩（常见于批评：认为某事过度向罗马教廷集中权力）。"]}
{"word":"papalism","summary":{"en":"Papalism is a belief or system that stresses the pope’s supreme authority in the Catholic Church.","zh":"Papalism 指强调教皇在天主教会中至高权威的观念或体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or system that emphasizes the pope’s authority as the supreme leader of the Roman Catholic Church, especially the idea that the pope should have strong control over church matters (and sometimes influence in politics).","zh":"教皇主义；强调教皇作为罗马天主教会最高领袖的权威的观念或体系，尤其指主张教皇对教会事务（有时也包括政治事务）应拥有强大控制力。"},"examples":[{"en":"Some critics argued that the council’s reforms were limited by papalism.","zh":"一些批评者认为，该会议的改革受到教皇主义的限制。"},{"en":"In the history of Europe, debates about papalism often involved questions about the power of kings versus the power of the pope.","zh":"在欧洲历史中，关于教皇主义的争论常常涉及国王权力与教皇权力的较量。"}]}],"synonyms":["papal supremacy","ultramontanism (related)"],"phonetic":"/ˈpeɪpəˌlɪzəm/","extraExplanation":["“papalism”多用于历史、宗教学与政治思想语境，常与“教皇权威是否高于地方主教、国家君主或世俗政府”相关的争论相连。","词源上来自“papal”（教皇的）+ “-ism”（主义/体系），通常带有评论性语气：可能是中性描述某种立场，也可能含批评意味（认为权力过度集中）。","相关词可对比：ultramontanism（强调教皇至上、常与19世纪天主教内部思潮有关）、conciliarism（大公会议至上，强调会议权威可高于教皇）。"]}
{"word":"papalist","summary":{"en":"“Papalist” means a person who supports the Pope, or something that favors the Pope’s authority.","zh":"“papalist”指拥护教皇权威的人，或指支持教皇/罗马教廷权威的（立场、言论等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports the Pope’s authority, especially in religious or political matters","zh":"拥护教皇权威的人（尤指在宗教或政治问题上）"},"examples":[{"en":"In the 16th century, some writers attacked Papalists and defended the Protestant Reformation.","zh":"在16世纪，一些作家抨击拥护教皇者，并为新教改革辩护。"},{"en":"He was labeled a Papalist by his opponents because he defended the Pope’s influence.","zh":"他的对手给他贴上“拥护教皇者”的标签，因为他为教皇的影响力辩护。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the Pope or the Roman Catholic Church’s authority","zh":"支持教皇的；拥护天主教会（罗马教廷）权威的"},"examples":[{"en":"The pamphlet used strongly Papalist language.","zh":"这本小册子使用了强烈的拥护教皇立场的措辞。"},{"en":"The debate included Papalist and anti-papal arguments.","zh":"辩论中既有拥护教皇的观点，也有反教皇的论点。"}]}],"synonyms":["pro-papal","ultramontane","Romanist (often historical)"],"phonetic":"/ˈpæpəlɪst/","extraExplanation":["“papalist”常见于历史与宗教争论语境，尤其是宗教改革（Reformation）及其后的英国、欧洲政治写作中。它有时带有贬义（对立阵营用来指责别人“亲教皇”或“亲罗马”），在现代中性学术写作里也可仅作描述用语。"]}
{"word":"papalistic","summary":{"en":"Papalistic means connected with the Pope/papacy, or strongly supportive of papal authority.","zh":"papalistic 指“与教皇/教皇制度有关的”，也可指“强烈拥护教皇权威的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pope or the papacy (the office and authority of the Pope).","zh":"与教皇或教皇制度（教皇的职位与权威）有关的。"},"examples":[{"en":"The article discusses papalistic authority in the medieval Church.","zh":"这篇文章讨论了中世纪教会中的教皇制权威。"},{"en":"Some laws were challenged because they seemed too papalistic for a secular state.","zh":"有些法律因在世俗国家里显得过于教皇化而受到质疑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Strongly supportive of the Pope’s power or viewpoint; pro-papal.","zh":"强烈支持教皇权力或立场的；拥护教皇的。"},"examples":[{"en":"His critics called the plan papalistic, saying it gave too much influence to Rome.","zh":"批评者称该计划“过于拥护教皇”，认为它让罗马获得了太多影响力。"},{"en":"The debate turned heated when one side accused the other of being papalistic.","zh":"当一方指责另一方“拥护教皇”时，辩论变得激烈起来。"}]}],"synonyms":["papal","pro-papal","papalist","papistic"],"phonetic":"/ˌpeɪpəˈlɪstɪk/","extraExplanation":["“papalistic”在现代英语中较少见，更多出现在宗教史、政治史或带有评论色彩的写作里。有时它会带一点批评或贬义（暗示“过度强调教皇权威”），语气取决于上下文。","更常见、更中性的表达通常是 “papal” （如 papal authority / papal visit）。"]}
{"word":"papality","summary":{"en":"Papality means the pope’s office/authority, or a pope’s period of rule; it is less common today than “papacy.”","zh":"Papality 指教皇的职位/权威或某位教皇的在位时期；现代英语中更常用 papacy。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The office, position, or authority of the pope (the leadership of the Roman Catholic Church).","zh":"教皇的职位、地位或权威；教皇统治（罗马天主教会的最高领导权）。"},"examples":[{"en":"In medieval Europe, papality influenced both religion and politics.","zh":"在中世纪欧洲，教皇权不仅影响宗教，也影响政治。"},{"en":"The reforms aimed to strengthen papality and unify church administration.","zh":"这些改革旨在加强教皇权并统一教会管理。"}]},{"partOfSpeech":"n.","definition":{"en":"A period when a particular pope rules; the papacy of a specific pope.","zh":"某位教皇在位的时期；某一任教皇时期（相当于“某某教皇任期/教皇在位期”）。"},"examples":[{"en":"During the papality of Pope John Paul II, the Vatican played a visible role in world affairs.","zh":"在若望·保禄二世教皇在位期间，梵蒂冈在世界事务中扮演了引人注目的角色。"}]}],"synonyms":["papacy","pontificate","Holy See (context-dependent)","Vatican (metonym, context-dependent)"],"phonetic":"/pəˈpæləti/","extraExplanation":["“papality”在现代英语中相对少见，更常用的是“papacy”（教皇职位/教皇制度/教皇任期）。写历史或学术英文时，你更常看到“the papacy”而不是“papality”。","词源上与“pope（教皇）”同根，常出现在讨论中世纪教会权力、教权与王权关系、以及梵蒂冈外交等语境中。"]}
{"word":"papalization","summary":{"en":"“Papalization” means the process of making something more papal or placing it under papal influence or control.","zh":"“papalization”指使某事物更具教皇色彩，或使其逐步受教皇影响/控制的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something “papal” (related to the Pope or the Roman Catholic Church), or bringing it under papal influence or control","zh":"使某事物“教皇化”（与教皇或罗马天主教会相关），或使其受教皇影响/控制的过程"},"examples":[{"en":"Some historians discuss the papalization of church administration in the Middle Ages.","zh":"一些历史学家讨论中世纪教会行政的教皇化过程。"},{"en":"The document was criticized as a step toward papalization of local religious authority.","zh":"该文件被批评为迈向地方宗教权威教皇化的一步。"}]}],"synonyms":["Romanization (in some contexts)","centralization under the papacy","papal control"],"phonetic":"/ˌpeɪpələˈzeɪʃən/","extraExplanation":["“papalization”属于学术/历史写作中较少见的名词，常用来描述制度、政治或宗教权力逐渐集中到教皇（the Pope）或罗马教廷（the papacy/Vatican）的一种趋势。","词根与构词：papal（教皇的）+ -ization（……化、……的过程）。与之相近的表达还有“centralization under the papacy”（在教皇权威下的集中化）。"]}
{"word":"papalize","summary":{"en":"Papalize means to make something more papal (under papal influence/authority), or less commonly, to convert someone to Roman Catholicism.","zh":"Papalize 指使某事物更“教皇化”（受教皇影响/权威支配），较少见时也可指使人改宗罗马天主教。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more like the pope or the Roman Catholic Church (especially by giving it papal authority or influence).","zh":"使……更像教皇／使……教皇化（尤指赋予教皇权威或使其受教皇影响）。"},"examples":[{"en":"Some critics claimed the reform would papalize the local church administration.","zh":"一些批评者声称这项改革会使地方教会的管理体制教皇化。"},{"en":"The movement was accused of trying to papalize national religious practices.","zh":"该运动被指责试图使国家的宗教实践教皇化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to convert someone to Roman Catholicism (an older or less common use).","zh":"使某人改宗为罗马天主教（较旧或较少见的用法）。"},"examples":[{"en":"In older writings, the term was sometimes used to describe efforts to papalize Protestants.","zh":"在较早的著作中，这个词有时用来描述试图使新教徒改宗天主教的努力。"}]}],"synonyms":["romanize (in a Catholic context)","catholicize","convert (to Catholicism)","bring under papal authority"],"phonetic":"ˈpeɪpəˌlaɪz","extraExplanation":["“papalize”来自“papal（教皇的）+ -ize（使……化）”。它多见于历史、宗教或政治语境，常带有评论或批判色彩，用来指某个制度、组织或风格变得更受教皇权威影响。日常英语里不常用。"]}
{"word":"papalizer","summary":{"en":"“Papalizer” is a rare, often critical term for someone (or something) that makes things more aligned with papal authority; the more common verb is “papalize.”","zh":"“papalizer”很少见，常带批评意味，指推动事物更服从教皇权威的人/事物；更常见的相关动词是“papalize（教皇化）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A person or thing that makes something more like the Pope or the Roman Catholic Church; someone who promotes papal authority or influence.","zh":"（罕见，非标准用法）使某事更像教皇或罗马天主教会的人/事物；推动教皇权威或影响力的人。"},"examples":[{"en":"Some critics accused the advisor of being a “papalizer” who tried to bring local churches under Rome’s control.","zh":"一些批评者指责那位顾问是“papalizer”，试图让地方教会受罗马控制。"},{"en":"The term “papalizer” is usually used as a label in political or religious debates, not in neutral descriptions.","zh":"“papalizer”这个词通常在政治或宗教争论中用来贴标签，而不是中性描述。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To make something more papal in character; to bring under papal influence or control.","zh":"（罕见，非标准用法）使某事具有更多“教皇色彩”；使其受教皇影响或控制。"},"examples":[{"en":"Opponents claimed the reforms would “papalize” the institution, though supporters disagreed.","zh":"反对者声称这些改革会把该机构“papalize（教皇化）”，但支持者不同意。"},{"en":"You will more commonly see the verb as “papalize,” not “papalizer.”","zh":"你更常见到的动词形式是“papalize”，而不是“papalizer”。"}]}],"synonyms":["papalist","pro-papal advocate","papalize (verb)","papalization (noun)"],"phonetic":"/ˈpeɪpəˌlaɪzər/","extraExplanation":["“papalizer”并不是常见标准词汇，更像是由“papal（教皇的）+ -ize（使……化）/ -er（……者）”临时造出来的词。写作中如果想更自然，通常用更常见的“papalize（使教皇化）”或“papalization（教皇化）”。","语境上，这类词经常带有立场或批评色彩（在宗教史、政治争论中指责某方“过度亲罗马/强调教皇权威”）。使用时要注意语气与场合，避免在中性陈述中造成冒犯或误解。"]}
{"word":"papally","summary":{"en":"“Papally” means “in a papal way; by the Pope’s authority.”","zh":"“papally”意为“以教宗的方式；依教宗权威（颁布/决定）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a papal way; by the authority or style of the Pope (the head of the Roman Catholic Church).","zh":"以教宗（罗马天主教教会领袖）的方式；依教宗的权威或作风。"},"examples":[{"en":"The decree was issued papally, not by a local bishop.","zh":"这项法令是由教宗权威颁布的，而不是由地方主教发布的。"},{"en":"Some matters can only be decided papally.","zh":"有些事务只能由教宗来裁决。"}]}],"synonyms":["by papal authority","by the Pope","under papal authority"],"phonetic":"/ˈpeɪpəli/","extraExplanation":["“papally”来自形容词“papal”（教宗的、教皇的），在现代英语中较少见，更多时候会用更自然的表达，如“by the Pope / under papal authority / by papal decree（以教宗名义/在教宗权威之下/通过教宗诏令）”。","文化语境：英语里的“Pope”通常指罗马天主教的教宗；“papal”相关表达常出现在宗教史、教会法、梵蒂冈新闻与正式文书中。"]}
{"word":"papaloi","summary":{"en":"“papaloi” refers to a male Vodou priest/ritual leader, often used in Haitian Vodou contexts or related fiction.","zh":"“papaloi”指海地巫毒教语境（或相关作品）中的男性祭司/仪式领袖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Haitian Vodou, or in fiction influenced by it) a male Vodou priest or ritual leader; a sorcerer figure sometimes described as a “witch doctor.”","zh":"（海地巫毒教，或受其影响的文学/影视作品中）男性巫毒教祭司或仪式主持者；有时也被描写为“巫医/巫师”式人物。"},"examples":[{"en":"In the novel, the papaloi leads a night ceremony to call on the spirits.","zh":"在小说里，那位 papaloi 主持夜间仪式来召唤灵体。"},{"en":"Some movies use the word papaloi as a spooky stereotype, but real Vodou is a religion with community leaders.","zh":"有些电影把 papaloi 当成恐怖刻板印象，但真实的巫毒教是一种宗教，也有服务社区的领袖人物。"}]}],"synonyms":["houngan","Vodou priest","ritual leader","(less neutral) witch doctor"],"phonetic":"ˌpɑːpəˈloʊi","extraExplanation":["“papaloi”在英语里不算常见词，多出现在描写海地（Haiti）巫毒教（Vodou/Voodoo）的语境或带有“异域/恐怖”风格的作品中。实际生活中更常见、更准确的称呼是海地克里奥尔语/法语体系里的术语（如 houngan 指男性祭司）。","注意文化语境：英语里把相关人物直接翻成“witch doctor（巫医）”在某些语境下带贬义或刻板印象；如果你是在做写作或学习，更中性表达可以用 “Vodou priest/ritual leader（巫毒教祭司/仪式领袖）”。","拼写可能有变体或混用（例如和“loa/loas”（巫毒教中的灵体/神灵）相关的写法），如果你能提供看到它的句子或出处（书名/电影/歌词），我可以帮你确认具体含义和更地道的用法。"]}
{"word":"papalty","summary":{"en":"“Papalty” is a rare, old word meaning the pope’s office or power (the papacy).","zh":"“papalty”是罕见的古语，意思是教皇的职位或权力，即“papacy（教皇制度/教皇职位）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) The office, authority, or government of the pope; the papacy.","zh":"（罕见/古语）教皇的职位、权力或统治；教皇制度（即“papacy”）。"},"examples":[{"en":"In medieval Europe, conflicts sometimes arose between kings and the papalty.","zh":"在中世纪欧洲，国王与教皇权威（papalty）之间有时会发生冲突。"},{"en":"The writer criticized the papalty for interfering in political affairs.","zh":"作者批评教皇当局（papalty）干预政治事务。"}]}],"synonyms":["papacy","pontificate","Holy See (contextual)"],"phonetic":"/ˈpeɪpəlti/","extraExplanation":["“papalty”在现代英语中非常少见，多数情况下人们用“papacy”（教皇职位/教皇制度）或“the Pope/the Vatican”（视语境）来表达。","如果你是在历史文献或宗教/政治史语境中看到它，它通常带有“教皇当局/教廷权力”的色彩，有时在论战性文字里会显得更尖锐。","拼写上也容易与“papal”（形容词：教皇的）混淆：papal + 名词（例如 papal authority/ papal decree）是更常见的现代搭配。"]}
{"word":"papane","summary":{"en":"“Papane” is not a standard English word; it is usually a misspelling of “papain,” an enzyme from papaya used to break down proteins.","zh":"“papane”不是规范英文词；通常是把“papain（木瓜蛋白酶）”拼错了，它是木瓜中的一种分解蛋白质的酶。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most commonly a misspelling of “papain,” an enzyme from papaya.","zh":"一种不规范拼写；最常见是把“papain（木瓜蛋白酶）”拼错了。"},"examples":[{"en":"I couldn’t find “papane” in the dictionary—did you mean “papain”?","zh":"我在词典里找不到“papane”——你是不是想写“papain”？"},{"en":"Papain is often used in meat tenderizers.","zh":"木瓜蛋白酶常用于嫩肉粉/嫩肉剂中。"}]},{"partOfSpeech":"n.","definition":{"en":"(If intended as “papain”) An enzyme from papaya used to break down proteins, especially in food and some medical or laboratory uses.","zh":"（若想表达“papain”）木瓜中的一种酶，用来分解蛋白质，常见于食品加工，也用于部分医疗或实验用途。"},"examples":[{"en":"This powder contains papain to help soften tough cuts of meat.","zh":"这种粉末含有木瓜蛋白酶，可以让较硬的肉更嫩。"},{"en":"Some people may be allergic to papain.","zh":"有些人可能对木瓜蛋白酶过敏。"}]}],"synonyms":["papain"],"phonetic":"/pəˈpeɪn/","extraExplanation":["“papain（木瓜蛋白酶）”来自 papaya（木瓜）。在英语里它更常出现在配料表、食品加工说明或实验/医药相关文本中。","如果你是在聊天或社交媒体里看到“papane”，也可能是人名、品牌名或拼写错误；给我一句原句我可以帮你判断语境。"]}
{"word":"papaphobia","summary":{"en":"Papaphobia means an irrational fear of the Pope or papal (Catholic) authority.","zh":"papaphobia 指对教皇或教皇（天主教）权威的不理性恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense or irrational fear of the Pope, the papacy, or (more broadly) Roman Catholic authority.","zh":"对教皇、教皇制度，或（更广义地）对罗马天主教权威的强烈或不理性的恐惧。"},"examples":[{"en":"His papaphobia made him avoid news about the Vatican.","zh":"他的“恐教皇症”让他刻意回避有关梵蒂冈的新闻。"},{"en":"The article warned that papaphobia can fuel unfair stereotypes about Catholics.","zh":"文章警告说，“恐教皇症”可能会加深对天主教徒的不公平刻板印象。"}]}],"synonyms":["fear of the Pope","anti-Catholic prejudice","anti-Catholic hostility"],"phonetic":"/ˌpɑpəˈfoʊbiə/","extraExplanation":["这个词比较少见，多用于讨论偏见或历史上的反天主教情绪（anti-Catholic sentiment）。在实际交流中，人们更常说“fear of the Pope/the papacy”或用更宽泛的词如“anti-Catholic prejudice/hostility”（反天主教偏见/敌意）。","词源上由“papa-”（教皇，来自拉丁语 papa，意为“父亲”，也是教皇的称呼之一）+ “-phobia”（恐惧症，源自希腊语 phobos，意为“恐惧”）构成。使用时要注意语境，避免把宗教群体污名化。"]}
{"word":"papaphobist","summary":{"en":"Papaphobist means a person who fears or strongly dislikes the Pope or the papacy.","zh":"Papaphobist 指害怕或强烈反感教皇或教皇制度的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has an extreme fear or strong dislike of the Pope or the papacy (the institution and authority of the Pope)","zh":"对教皇或教皇制度（教皇权威与机构）感到强烈恐惧或强烈反感的人"},"examples":[{"en":"He described himself online as a papaphobist and avoided news about the Vatican.","zh":"他在网上自称是“papaphobist”，并刻意回避有关梵蒂冈的新闻。"},{"en":"Using labels like “papaphobist” can inflame arguments about religion instead of helping people understand each other.","zh":"使用像“papaphobist”这样的标签，可能会激化宗教争论，而不是帮助人们互相理解。"}]}],"synonyms":["papaphobe","anti-papal person","critic of the papacy"],"phonetic":"/ˌpɑpəˈfoʊbɪst/","extraExplanation":["这个词非常少见，更多属于“自造词/网络用语”风格，而不是常见词典里的标准词。","构词上：papa- 指“教皇（Pope）/教皇相关”，-phobist 指“恐惧者/厌恶者”（类似 arachnophobist 蜘蛛恐惧者）。更常见的相关词是 papaphobia（对教皇/教皇制度的恐惧或强烈反感）。","语境上它可能既指“恐惧（phobia）”，也可能被用作“贬义标签”来指反教皇、反天主教权威的人；因此在正式写作中建议用更中性、更具体的表达（如 “anti-papal,” “critical of the papacy”）。"]}
{"word":"papaprelatical","summary":{"en":"A rare/archaic adjective meaning “papal and prelatical; linked to church hierarchy (especially Roman Catholic).”","zh":"一个罕见/古语形容词，意为“与教皇及主教等高级神职有关；带有（尤指天主教）教会等级权威色彩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pope (papal) and to prelates/high-ranking clergy (prelatical); characteristic of Roman Catholic church hierarchy. (Rare/archaic)","zh":"与教皇（papal）及主教等高级神职人员（prelatical）有关的；具有天主教教会等级制度色彩的。（罕见/古语）"},"examples":[{"en":"The writer attacked what he called “papaprelatical power” in the state.","zh":"这位作者抨击他所说的国家中的“教皇—主教式权力”。"},{"en":"Some pamphlets from that period use papaprelatical as a negative label for church authority.","zh":"那个时期的一些小册子用 papaprelatical 作为贬义标签来指称教会权威。"}]}],"synonyms":["papal","prelatical","clerical","ecclesiastical"],"phonetic":"/ˌpɑːpəprɪˈlætɪkəl/","extraExplanation":["这是一个非常少见的复合形容词，通常可拆成 papa-（指“教皇/罗马教廷”，相当于 papal）+ prelatical（指“主教/高级神职人员的”）。","多见于宗教或政治论战语境，带有批评“教会等级权威/教权干预世俗”的意味；现代英语里更常用 papal、prelatical、clerical 或 ecclesiastical 来表达。","拼写也可能来自旧文本或印刷误差；如果你能提供句子原文，我可以帮你更准确判断它在语境中的含义与语气。"]}
{"word":"papaprelatist","summary":{"en":"A rare term for someone who supports papal and prelate (bishop) authority.","zh":"一个罕见词，指支持教皇与主教等教长权威的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who strongly supports the pope (the papacy) and the authority of high church leaders (prelates such as bishops); a pro‑papal, pro‑hierarchy church partisan. (Rare/archaic)","zh":"强烈支持教皇（教廷）以及高级教会领袖（如主教等“教长”）权威的人；亲教皇、亲教会等级制度的派别支持者。（罕见/古旧用法）"},"examples":[{"en":"In the polemical pamphlet, the author attacks his opponents as papaprelatists who want Rome to control local churches.","zh":"在那本争论性小册子里，作者抨击对手是“papaprelatists”，想让罗马控制地方教会。"},{"en":"The term papaprelatist appears in older religious disputes about church authority and governance.","zh":"“papaprelatist”常见于较早期关于教会权威与治理的宗教论战。"}]}],"synonyms":["papist","ultramontane","pro-papal partisan"],"phonetic":"/ˌpɑpəˈprɛlətɪst/","extraExplanation":["这个词非常少见，多出现在历史性的宗教论战或政治讽刺语境中，带有强烈的立场色彩，常用于指责对方“过度亲罗马教廷/过度强调主教阶层权威”。","构词上可理解为 papa-（教皇）+ prelat-（教长、主教阶层）+ -ist（……主义者/支持者）。现代英语更常用的说法包括 papist（亲教皇者，常带贬义）或 ultramontane（强调教皇至上，历史术语）。"]}
{"word":"paparazzi","summary":{"en":"Paparazzi are photographers who closely follow celebrities to take candid photos, often in an intrusive way.","zh":"paparazzi 指追踪名人、常以打扰方式偷拍抓拍的“狗仔队/狗仔摄影师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Photographers (often working for newspapers, magazines, or websites) who aggressively follow famous people to take candid photos.","zh":"（常为媒体工作、较为“追拍”式的）狗仔队；追踪名人偷拍的摄影记者/摄影师。"},"examples":[{"en":"The paparazzi waited outside the restaurant for the actress to come out.","zh":"狗仔队守在餐厅外，等那位女演员出来。"},{"en":"He tried to avoid the paparazzi by using a back entrance.","zh":"他为了躲避狗仔队，改走后门。"},{"en":"Celebrities often complain about paparazzi invading their privacy.","zh":"名人常抱怨狗仔队侵犯他们的隐私。"}]}],"synonyms":["press photographers","tabloid photographers"],"phonetic":"/ˌpɑpəˈrɑtsi/","extraExplanation":["“paparazzi”是意大利语复数形式（单数是“paparazzo”），英语里常把“paparazzi”当作单复数都可用的名词（口语里尤其常见）。","这个词因费德里科·费里尼（Federico Fellini）的电影《甜蜜的生活》（La Dolce Vita，1960）而流行：片中有个摄影记者角色名叫Paparazzo，后来被用来泛指追拍名人的摄影记者/狗仔。","语体与语感：在英语里“paparazzi”通常带有负面色彩，暗示打扰、纠缠、侵犯隐私；更中性时可说“press photographers”或“photographers from the media”。"]}
{"word":"paparazzo","summary":{"en":"A paparazzo is a photographer who aggressively takes candid photos of celebrities.","zh":"paparazzo 指跟拍名人、抢拍抓拍照的狗仔队摄影师（单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A freelance photographer who follows famous people to take candid photos, often for newspapers, magazines, or websites.","zh":"（通常为自由职业的）狗仔队摄影师；跟拍名人以获取抓拍照片的人（常供报刊、杂志或网站使用）。"},"examples":[{"en":"Paparazzi waited outside the restaurant for the actor to come out.","zh":"狗仔队在餐厅外等着那位演员出来。"},{"en":"She tried to cover her face to avoid the paparazzi.","zh":"她试着遮住脸来躲开狗仔队。"}]}],"synonyms":["celebrity photographer","press photographer","photojournalist"],"phonetic":"/ˌpɑpəˈrɑtsoʊ/","extraExplanation":["“paparazzo”是单数，复数是“paparazzi”。很多英语使用者会把“paparazzi”也当作单数用，但在正式写作里建议区分清楚。","这个词因费里尼电影《甜蜜的生活》（La Dolce Vita，1960）而流行：片中一位摄影记者名叫Paparrazo，后来逐渐成为“追拍名人的摄影师”的通用称呼。","在文化语境中，“paparazzi”常带负面含义，暗示对隐私的侵犯；中性表达可用“photographers”或更具体的“press photographers”。"]}
{"word":"paparchical","summary":{"en":"Paparchical means ‘connected with the pope or rule by the pope,’ often in historical or critical contexts.","zh":"paparchical 指“与教皇有关或由教皇统治的”，多用于历史或带批评色彩的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pope or to government by the pope (papal rule); sometimes used critically to suggest excessive papal control.","zh":"与教皇有关的；或指由教皇统治的（教皇政体）；有时带批评意味，暗示教皇权力过度。"},"examples":[{"en":"Some critics described the policy as paparchical, arguing it gave too much power to Rome.","zh":"一些批评者称这项政策带有“教皇政体色彩”，认为它把过多权力交给了罗马。"},{"en":"In older writings, paparchical authority is contrasted with secular government.","zh":"在较早的著作中，“教皇式权威”常与世俗政府形成对照。"}]}],"synonyms":["papal","pontifical","ultramontane (context-dependent)"],"phonetic":"/pəˈpɑr.kɪ.kəl/","extraExplanation":["“paparchical”较少见，更多出现在历史、宗教争论或批评性语境中。它来自“paparchy”（教皇统治/教皇政体）+ 形容词后缀“-al”，含义接近“papal（教皇的）”，但语气往往更强调“由教皇主导的统治/控制”。","使用时注意语境：在中性描述中更常用“papal”（如 papal authority 教皇权威）；“paparchical”更像是在讨论政治权力结构或带有立场色彩的评论。"]}
{"word":"paparchy","summary":{"en":"Paparchy means the pope’s rule or the papal system of authority.","zh":"Paparchy 指教皇的统治或教皇权力体系（教皇制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The system of government or authority of the pope; rule by the pope (the papal system).","zh":"教皇制；教皇的统治或权力体系（由教皇掌权的制度）。"},"examples":[{"en":"Some writers criticized the paparchy for mixing religion with political power.","zh":"一些作者批评教皇制把宗教与政治权力混在一起。"},{"en":"In medieval Europe, debates about the paparchy shaped conflicts between kings and the Church.","zh":"在中世纪欧洲，关于教皇制的争论影响了国王与教会之间的冲突。"}]}],"synonyms":["papacy","papal rule","the papal system","pontificate"],"phonetic":"ˈpeɪpɑrki","extraExplanation":["“paparchy”较少见，更常用的词是“papacy”（教皇职位/教皇权）或“papal rule”（教皇统治）。","词根来自“papa”（教皇/父亲，源自拉丁语与希腊语，意为“父亲”）+ “-archy”（统治/政体，如 monarchy 君主制、oligarchy 寡头制）。因此 paparchy 字面意思就是“教皇的统治”。","语体上，“paparchy”常带有评论色彩（有时偏批判或政治化），使用时注意场合与语气。"]}
{"word":"papas","summary":{"en":"“Papas” most often means “dads” (plural of papa). In Spanish-influenced contexts, it can also mean “potatoes.”","zh":"“Papas”通常指“爸爸们”（papa 的复数）。在受西语影响的语境中也可指“土豆/马铃薯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Dads; affectionate term for fathers (“papas” = “papas/dads”).","zh":"（复数）爸爸们；对父亲的亲昵称呼（“papas”=“爸爸们/老爸们”）。"},"examples":[{"en":"All the papas came to the school play to cheer for their kids.","zh":"所有爸爸们都来学校演出给孩子加油。"},{"en":"The kids ran to their papas after the game.","zh":"比赛结束后，孩子们跑向他们的爸爸们。"}]},{"partOfSpeech":"n.","definition":{"en":"Potatoes (common in Spanish; sometimes used in English menus or contexts influenced by Spanish).","zh":"土豆/马铃薯（西班牙语常用；在受西语影响的英文菜单或语境中也会出现）。"},"examples":[{"en":"The menu says “papas bravas,” which are spicy potatoes.","zh":"菜单上写着“papas bravas”，就是辣味土豆。"},{"en":"In some places, people order tacos with papas.","zh":"在一些地方，人们会点加土豆的塔可。"}]}],"synonyms":["dads","fathers","pops","potatoes (Spanish use)"],"phonetic":"/ˈpɑpəz/","extraExplanation":["“Papa”在英语里常见为儿童或家人对父亲的亲昵称呼；复数为“papas”。","“Papas”在西班牙语里通常指“土豆”。在美国的餐馆菜单、拉美/西语文化语境中，你可能会在英语对话里直接看到或听到“papas”。常见搭配有“papas fritas（薯条）”、“papas bravas（西班牙辣土豆）”。"]}
{"word":"papaship","summary":{"en":"“Papaship” is an informal, playful word meaning the state or identity of being a papa (father).","zh":"“papaship”是较口语、带玩笑感的说法，表示“当爸爸的身份或状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or role of being a papa (father); fatherhood, often used in a playful or informal way.","zh":"当爸爸的身份或状态；父亲身份/父职（多为俏皮、非正式用法）。"},"examples":[{"en":"He’s adjusting to papaship after the baby arrived.","zh":"宝宝出生后，他正在适应“当爸爸”的生活。"},{"en":"Papaship looks good on you—you're so patient with the kids.","zh":"你很适合“爸爸身份”——你对孩子们特别有耐心。"}]},{"partOfSpeech":"n.","definition":{"en":"A humorous label for a dad-focused community, account, or content style (similar to “mom-ship”/parenting identity talk).","zh":"对“爸爸向”的社群、账号或内容风格的幽默称呼（类似“身份认同/育儿圈”的说法）。"},"examples":[{"en":"His videos are pure papaship: lunch-box ideas, bedtime routines, and dad jokes.","zh":"他的视频完全是“爸爸风”：便当点子、睡前流程、还有各种冷笑话。"}]}],"synonyms":["fatherhood","being a dad","dad life","parenthood (broader)"],"phonetic":"/ˈpɑːpəʃɪp/","extraExplanation":["“papaship”不是非常常见的标准词，更像是口语里的创造词。它由 papa（爸爸）+ -ship 构成；-ship 常用来表示“身份/状态/职位”（如 friendship 友谊、leadership 领导力、membership 会员身份）。所以 papaship 可以理解为“当爸爸这件事/爸爸身份”。","在正式写作里，更常用的词是 fatherhood（父亲身份/为人父）或 being a dad（当爸爸）。如果你是在社交媒体昵称、标题或玩笑里用，papaship 会更自然。"]}
{"word":"papaver","summary":{"en":"Papaver is the scientific (Latin) genus name for poppies.","zh":"Papaver 是“罂粟属”的植物学（拉丁）学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of poppy plants (family Papaveraceae), including species with showy flowers; some species are used for seeds or medicines","zh":"罂粟属（罂粟科）植物的属名，常见于观赏花卉；部分种类用于食用种子或药用"},"examples":[{"en":"The garden catalog lists several Papaver varieties with bright red flowers.","zh":"园艺目录里列出了几种花色鲜红的罂粟属（Papaver）品种。"},{"en":"Papaver somniferum is the species most associated with poppy seeds and opium.","zh":"Papaver somniferum（药用罂粟）是最常与罂粟籽和鸦片相关的物种。"}]}],"synonyms":["poppy"],"phonetic":"/pəˈpeɪvər/","extraExplanation":["Papaver 是拉丁语学名，在植物学写作中常用斜体（Papaver）。日常英语里更常说 poppy（罂粟/虞美人等的统称）。","一些 Papaver 物种与“罂粟籽（poppy seeds）”或“鸦片（opium）”相关，但并非所有罂粟属植物都用于这些用途；在不同国家和地区也有不同的法律与文化语境。"]}
{"word":"papaveraceae","summary":{"en":"Papaveraceae is the scientific name for the poppy family of flowering plants.","zh":"Papaveraceae 是“罂粟科”的学名（罂粟类开花植物的一个植物科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the poppy family: a plant family that includes poppies and related flowering plants, many with milky sap and showy flowers","zh":"罂粟科：一个植物科，包含罂粟及其近缘的开花植物，许多成员有乳白色汁液和显眼的花"},"examples":[{"en":"The common poppy belongs to the Papaveraceae family.","zh":"常见的罂粟属于罂粟科（Papaveraceae）。"},{"en":"In botany class, we learned to identify Papaveraceae by its distinctive flowers and sap.","zh":"在植物学课上，我们学习通过其独特的花和汁液来辨认罂粟科（Papaveraceae）。"}]}],"synonyms":["poppy family"],"phonetic":"/ˌpæpəvəˈreɪsi.iː/","extraExplanation":["Papaveraceae 是拉丁化的植物科名，常见英文通俗名是 “poppy family”（罂粟科/罂粟科植物）。在正式写作中它通常作为专有名词使用，首字母大写。","该科的一些物种与药用生物碱有关（例如罂粟相关成分），因此在科学、医药或法规语境中可能会被提及；日常英语里更常说 poppy 或 poppy family。"]}
{"word":"papaveraceous","summary":{"en":"Papaveraceous means “of or related to the poppy family (Papaveraceae).”","zh":"papaveraceous 指“罂粟科的；与罂粟科（Papaveraceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the poppy family (Papaveraceae), or resembling poppy plants in botanical features.","zh":"（植物学）罂粟科的；与罂粟科（Papaveraceae）有关的；或在形态特征上类似罂粟类植物的。"},"examples":[{"en":"California poppy is a papaveraceous plant known for its bright orange flowers.","zh":"加州罂粟是一种罂粟科植物，以亮橙色花朵闻名。"},{"en":"The researcher compared papaveraceous species to other flowering plants in the region.","zh":"研究人员把罂粟科物种与该地区其他开花植物作比较。"}]}],"synonyms":["poppy-family","Papaveraceae (related)"],"phonetic":"/pəˌpævəˈreɪʃəs/","extraExplanation":["“papaveraceous”来自拉丁语 papaver（罂粟），常用于植物分类与描述文章里；日常英语很少用，更多会直接说 “poppy family / Papaveraceae”。","罂粟科包含多种观赏或野生植物（如罂粟、冰岛罂粟等）；其中“鸦片罂粟（opium poppy）”具有药用与管制相关背景，因此在科普或历史语境中可能会被提及，但“papaveraceous”本身只是中性分类形容词。"]}
{"word":"papaverales","summary":{"en":"Papaverales is a botanical term for the (traditional) order of plants associated with poppies; its exact use depends on the classification system.","zh":"Papaverales是植物学术语，传统上指与罂粟相关的“目”（类群）；具体范围取决于所采用的分类系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A taxonomic order of flowering plants traditionally known as the poppy order, including poppies and related families (usage varies by classification system).","zh":"（植物学）被称为“罂粟目/罂粟类群”的被子植物分类单元，传统上包括罂粟及其近缘科（不同分类系统中的使用与范围可能不同）。"},"examples":[{"en":"In older botany books, the poppy family is sometimes placed in Papaverales.","zh":"在较早的植物学书籍中，罂粟科有时被归入Papaverales（罂粟目）。"},{"en":"The term Papaverales may appear in historical plant classification charts.","zh":"Papaverales这个术语可能会出现在历史性的植物分类图表中。"}]}],"synonyms":["poppy order"],"phonetic":"/pəˌpævəˈræliz/","extraExplanation":["Papaverales在现代系统分类中不一定被广泛采用：不同学派（尤其是传统形态学分类与较新的分子系统学分类）对“目”的划分和命名可能不同。学习时可把它理解为“与罂粟（poppy）相关的一组植物”的历史分类名称，并结合你所用教材/数据库的分类体系核对。","词源上来自属名Papaver（罂粟属）+ -ales（植物分类中表示“目”的后缀，如Rosales蔷薇目）。"]}
{"word":"papaverin","summary":{"en":"Papaverine is a drug used to relax smooth muscles and dilate blood vessels.","zh":"Papaverine（罂粟碱）是一种用于放松平滑肌、扩张血管的药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (an alkaloid) used to relax smooth muscles and widen blood vessels, helping relieve spasms and improve blood flow","zh":"一种药物（生物碱），可放松平滑肌并扩张血管，用于缓解痉挛、改善血流"},"examples":[{"en":"The doctor prescribed papaverine to reduce muscle spasms in the digestive tract.","zh":"医生开了罂粟碱来减轻消化道的肌肉痉挛。"},{"en":"Papaverine can act as a vasodilator, which may improve circulation in certain conditions.","zh":"罂粟碱可作为血管扩张剂，在某些情况下可能有助于改善循环。"}]}],"synonyms":["antispasmodic (general)","vasodilator (general)"],"phonetic":"/pəˈpævəriːn/","extraExplanation":["你输入的“papaverin”常见为“papaverine”的拼写变体或简写；标准英文拼写通常是 papaverine。","Papaverine 这个词来自拉丁语 papaver（“罂粟”），因为它最初从罂粟属植物中分离得到。","学习提示：虽然它来源于罂粟，但 papaverine 不是阿片类止痛药（不用于“止痛成瘾”那一类的用途），主要作用是“解痉、扩血管”。"]}
{"word":"papaverine","summary":{"en":"Papaverine is a vasodilator medicine that relaxes smooth muscles and helps improve blood flow.","zh":"Papaverine（罂粟碱）是一种血管扩张剂，可放松平滑肌并帮助改善血流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine that relaxes smooth muscles and widens blood vessels (a vasodilator), used to improve blood flow and relieve spasms in some organs.","zh":"一种能放松平滑肌并扩张血管的药物（血管扩张剂），用于改善血流、缓解某些器官的痉挛。"},"examples":[{"en":"The doctor prescribed papaverine to help improve blood flow.","zh":"医生开了罂粟碱来帮助改善血流。"},{"en":"Papaverine can relax smooth muscle and reduce spasms.","zh":"罂粟碱可以放松平滑肌并减轻痉挛。"}]}],"synonyms":["vasodilator (general term)","antispasmodic (general term)"],"phonetic":"/pəˈpævɚˌin/","extraExplanation":["“Papaverine”来自拉丁语 papaver（罂粟）。它最早从鸦片中分离出来，但与吗啡不同：罂粟碱主要用于“解痉/扩张血管”，而不是作为强镇痛药。","在医学语境中你更常看到它出现在处方、药理或血管相关治疗的说明里；是否适合使用、剂量和风险需要由专业医生判断。"]}
{"word":"papaverous","summary":{"en":"Papaverous means “related to poppies” and, in literary use, “sleep-inducing.”","zh":"papaverous 指“与罂粟有关的”，文学用法也可指“催眠的、令人昏昏欲睡的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made from the poppy plant (Papaver), especially the opium poppy.","zh":"罂粟的；与罂粟属植物有关的；由罂粟制成的（尤指鸦片罂粟）。"},"examples":[{"en":"The researcher studied papaverous plants used in traditional medicine.","zh":"研究人员研究了用于传统医学的罂粟属植物。"},{"en":"The museum displayed papaverous motifs in ancient pottery designs.","zh":"博物馆展出了古代陶器上的罂粟图案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Sleep-inducing; causing drowsiness, by association with opium from poppies.","zh":"（文学用法）催眠的；令人昏昏欲睡的（因罂粟/鸦片的联想）。"},"examples":[{"en":"A papaverous haze seemed to settle over the quiet room.","zh":"一种催眠般的朦胧感仿佛笼罩了安静的房间。"},{"en":"The warm air had a papaverous effect after a long walk.","zh":"走了很久之后，温暖的空气让人有种昏昏欲睡的感觉。"}]}],"synonyms":["poppy","poppy-related","soporific","drowsy","sleepy"],"phonetic":"/pəˈpævərəs/","extraExplanation":["“papaverous”来自动物/植物学拉丁语词根 papaver（罂粟）。在现代英语里较少见，更常出现在植物学写作或较文艺的描写中。","在日常表达里，如果只是说“让人想睡”，更常用 sleepy / drowsy / soporific；如果强调“与罂粟有关”，可用 poppy-related 或 of the poppy。"]}
{"word":"papaw","summary":{"en":"Papaw most commonly means “grandfather” in informal regional American English; less commonly it can refer to papaya (or locally to pawpaw fruit).","zh":"Papaw 最常见的意思是（美式方言中）对“祖父”的亲昵称呼；较少情况下也可指木瓜（或在某些地区指北美番木瓜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, especially in some parts of the U.S.) a grandfather; a name children may use for their grandpa.","zh":"（非正式，尤指美国部分地区）祖父；孩子对“爷爷/外公”的亲昵称呼。"},"examples":[{"en":"Papaw is picking me up after school.","zh":"爷爷放学后来接我。"},{"en":"We’re visiting Papaw and Mamaw this weekend.","zh":"这周末我们要去看爷爷和奶奶。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; regional) a papaya, or sometimes the pawpaw fruit—meaning depends on local usage.","zh":"（较少见；方言用法）木瓜，或有时指北美番木瓜（pawpaw）——具体指哪种取决于当地说法。"},"examples":[{"en":"At that market, people called papaya “papaw.”","zh":"在那个市场里，人们把木瓜叫作“papaw”。"}]}],"synonyms":["grandpa","grandfather","granddad","gramp(a)","papa"],"phonetic":"/ˈpɑˌpɔ/","extraExplanation":["“Papaw”常见于美国南部和阿巴拉契亚地区（Appalachia）等地，是家庭内部的亲昵称呼，不太用于正式场合。","拼写上常与“pawpaw”混淆；“pawpaw”更常指北美的一种水果（Asimina triloba），而“papaya”在少数地区口语里也可能被叫作“papaw”。"]}
{"word":"papaws","summary":{"en":"“Papaws” can mean grandfathers (a regional U.S. nickname) or the plural of pawpaw fruit/trees, depending on context.","zh":"“papaws”既可指“爷爷/外公们”（美式方言式昵称），也可指北美番木瓜（pawpaw）水果/树的复数，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of papaw/papaw: a grandfather (a common family nickname in parts of the U.S., especially the South and Midwest).","zh":"papaw（也拼作 papaw/pawpaw）的复数：外公/爷爷的亲昵称呼（在美国部分地区，尤其南部和中西部较常见）。"},"examples":[{"en":"My papaws always tell the best stories about when they were young.","zh":"我的爷爷/外公们总是讲他们年轻时最好听的故事。"},{"en":"We’re visiting the papaws this weekend for dinner.","zh":"这周末我们要去看爷爷/外公们，一起吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of papaw/pawpaw: the pawpaw fruit (or the pawpaw tree), a North American fruit with soft, sweet flesh.","zh":"papaw/pawpaw 的复数：北美番木瓜（pawpaw）这种水果（或其树），果肉柔软香甜。"},"examples":[{"en":"They picked papaws from the trees along the river.","zh":"他们从河边的树上摘了些北美番木瓜。"},{"en":"Papaws ripen in early fall in many places.","zh":"在很多地方，北美番木瓜通常在初秋成熟。"}]}],"synonyms":["grandpa","grandfather","papa","pawpaws"],"phonetic":"/ˈpɔˌpɔ/","extraExplanation":["“papaw(s)”在口语里常指“爷爷/外公”的昵称，带有亲昵、家庭氛围，也有明显的地域色彩（美国南部、中西部更常听到）。不同家庭也会写作“papaw / pawpaw / papa”。","指水果时，“pawpaw”（也有人写“papaw”）是北美原生水果，并不是热带的“papaya（木瓜）”。两者中文都可能被叫作“番木瓜/木瓜”，容易混淆；英语里一般用 papaya 指热带木瓜，用 pawpaw 指北美 pawpaw。"]}
{"word":"papaya","summary":{"en":"Papaya is a sweet tropical fruit (and also the tree it grows on).","zh":"Papaya 指香甜的热带水果“木瓜”，也可指“木瓜树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical fruit with sweet orange flesh and many black seeds, usually eaten fresh or used in drinks and desserts","zh":"木瓜：一种热带水果，果肉橙色香甜，内部有许多黑色种子，常直接食用或做饮品、甜点"},"examples":[{"en":"I had papaya with yogurt for breakfast.","zh":"我早餐吃了木瓜配酸奶。"},{"en":"This smoothie tastes like mango and papaya.","zh":"这杯奶昔喝起来像芒果和木瓜。"},{"en":"Cut the papaya in half and scoop out the seeds.","zh":"把木瓜切成两半，把籽挖出来。"}]},{"partOfSpeech":"n.","definition":{"en":"the papaya tree (the plant that produces papayas)","zh":"木瓜树：结木瓜这种果实的植物"},"examples":[{"en":"A papaya grows well in warm, sunny climates.","zh":"木瓜树在温暖、阳光充足的气候里长得很好。"},{"en":"They planted a papaya behind the house.","zh":"他们在房子后面种了一棵木瓜树。"}]}],"synonyms":["pawpaw (regional)"],"phonetic":"/pəˈpaɪə/","extraExplanation":["“Papaya”在美式英语里常读作/ pəˈpaɪə /，重音在第二个音节。","很多文化里木瓜被当作日常水果；在一些地方也会用未熟的青木瓜做沙拉或炖煮（口感更脆、味道更清淡）。"]}
{"word":"papayaceae","summary":{"en":"Papayaceae means “the papaya family,” a botanical plant family.","zh":"Papayaceae 指“番木瓜科”，是一个植物学上的科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes papaya and its relatives (tropical flowering plants).","zh":"番木瓜科：一个植物科，包含番木瓜及其近缘的热带开花植物。"},"examples":[{"en":"Papaya (Carica papaya) is the best-known species in the family Papayaceae.","zh":"番木瓜（Carica papaya）是番木瓜科（Papayaceae）中最著名的物种。"},{"en":"Some Papayaceae plants produce a milky sap that contains enzymes.","zh":"一些番木瓜科植物会分泌乳白色汁液，里面含有酶。"}]}],"synonyms":["papaya family"],"phonetic":"/ˌpɑːpaɪˈeɪsi.i/","extraExplanation":["“Papayaceae”是植物分类学用语，通常出现在生物课本、植物百科、学术论文或食品/药用植物资料中；日常英语里更常说“the papaya family（番木瓜科/番木瓜家族）”。","该科中最常被提到的特点之一是乳汁（latex）及其中的蛋白酶（如木瓜蛋白酶 papain），因此与嫩肉粉、消化酶等应用常有关联。"]}
{"word":"papayaceous","summary":{"en":"An adjective meaning “related to or resembling papaya,” especially in botanical classification (Caricaceae).","zh":"形容词，表示“与木瓜（番木瓜）有关或像木瓜的”，尤用于植物学分类（番木瓜科）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to papayas, or resembling a papaya; especially referring to the papaya family (Caricaceae) in botany.","zh":"与木瓜（番木瓜）有关的；或像木瓜的；（尤指植物学中）番木瓜科（Caricaceae）的。"},"examples":[{"en":"The botanist described the plant as papayaceous because it belongs to the Caricaceae family.","zh":"植物学家称这种植物为 papayaceous，因为它属于番木瓜科。"},{"en":"Some leaves in the garden looked papayaceous—large and deeply lobed like papaya leaves.","zh":"花园里有些叶子看起来很“papayaceous”——像木瓜叶一样又大又深裂。"}]}],"synonyms":["papaya-related","of the Caricaceae","papaya-like"],"phonetic":"/ˌpəpaɪˈeɪʃəs/","extraExplanation":["这是一个偏学术/植物学用词，日常英语里很少用。更常见的说法是用 “papaya + 名词”（例如 papaya tree/papaya family）或直接说 “related to papaya”。","词尾 “-aceous” 常表示“……的、像……的”（例如 herbaceous=草本的，curvaceous=曲线优美的）。因此 papayaceous 字面意思就是“木瓜（番木瓜）般的/木瓜相关的”。"]}
{"word":"papayan","summary":{"en":"Papayan is a rare English word meaning a papaya plant/tree, or (rarely) something related to papaya.","zh":"Papayan 在英语中很少见，通常指木瓜（番木瓜）植株/木瓜树；也可（罕见）作形容词表示“与木瓜有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A papaya plant or papaya tree.","zh":"（罕见用法）木瓜（番木瓜）植株；木瓜树。"},"examples":[{"en":"A papayan grew behind the house, and we picked ripe fruit in summer.","zh":"房子后面长着一棵木瓜树，夏天我们会采摘成熟的果实。"},{"en":"The garden has a young papayan that needs warm weather to thrive.","zh":"花园里有一株小木瓜苗，需要温暖的天气才能长得好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to or made from papaya.","zh":"（罕见用法）与木瓜有关的；由木瓜制成的。"},"examples":[{"en":"She added a papayan dressing to the fruit salad.","zh":"她在水果沙拉里加了木瓜风味的酱汁。"},{"en":"The sauce has a papayan sweetness.","zh":"这款酱带着木瓜般的甜味。"}]}],"synonyms":["papaya","papaya tree","papaya plant"],"phonetic":"/pəˈpaɪən/","extraExplanation":["“papayan”在现代英语里非常少见。大多数情况下，人们会用“papaya”表示“木瓜/番木瓜（果实）”，用“papaya tree / papaya plant”表示“木瓜树/木瓜植株”。如果你是在菜单、品牌名、或某些地区（例如受西班牙语或菲律宾语影响的语境）看到“papayan”，它可能是方言/借词用法，或是把“papaya”加上后缀写出来的变体。"]}
{"word":"papayas","summary":{"en":"Papayas are sweet tropical fruits; “papayas” is the plural of “papaya.”","zh":"Papayas 指香甜的热带水果木瓜；是 papaya 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical fruit with sweet orange flesh and many small black seeds, usually eaten fresh or used in drinks and desserts.","zh":"木瓜（热带水果），果肉橙色香甜，内有许多黑色小籽，常生吃或做饮品、甜点。"},"examples":[{"en":"I had papaya for breakfast with yogurt and honey.","zh":"我早餐吃了木瓜，配酸奶和蜂蜜。"},{"en":"This smoothie tastes fresh because it has papayas and lime juice.","zh":"这杯奶昔很清爽，因为加了木瓜和青柠汁。"},{"en":"Papayas are common in many tropical markets.","zh":"在许多热带地区的市场里，木瓜很常见。"}]}],"synonyms":["papaya fruit"],"phonetic":"/pəˈpaɪə/","extraExplanation":["“papayas”是“papaya”的复数形式；在日常对话里也常用作不可数名词谈论这种水果整体：e.g., “Do you like papaya?”（你喜欢吃木瓜吗？）","有时“papaya”也指“木瓜树”（植物本身），但更常见的意思是指水果。"]}
{"word":"papayotin","summary":{"en":"Papayotin is an older term for papain, an enzyme from papaya that breaks down proteins.","zh":"Papayotin 是 papain（木瓜蛋白酶）的旧称，指木瓜来源、可分解蛋白质的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proteolytic enzyme (or enzyme mixture) obtained from papaya latex, used to break down proteins; an older or less common name for papain","zh":"从木瓜乳汁中提取的蛋白分解酶（或酶的混合物），用于分解蛋白质；是 papain（木瓜蛋白酶）的较旧或较少见名称"},"examples":[{"en":"This product contains papayotin to help break down protein stains.","zh":"这款产品含有 papayotin，用于分解蛋白质污渍。"},{"en":"In older texts, papayotin is often listed as another name for papain.","zh":"在较旧的资料中，papayotin 常被列为 papain 的另一种名称。"}]}],"synonyms":["papain","protease"],"phonetic":"/ˌpæpəˈjoʊtɪn/","extraExplanation":["“Papayotin”在现代日常英语里很少见，更常用的词是“papain”。如果你在食品、清洁剂或实验材料说明里看到它，通常指的就是木瓜来源的蛋白酶，用来“分解蛋白质”。","词根提示：papa- 来自 papaya（木瓜），后面的形式常见于早期化学/生物命名，用来指某种从植物中分离出的物质。"]}
{"word":"papboat","summary":{"en":"An old-fashioned boat-shaped dish for feeding a baby (or patient) soft food or medicine.","zh":"旧式的船形小器皿，用于给婴儿（或病人）喂糊状软食或喂药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A small boat-shaped dish used to give pap (soft food) or medicine to a baby or sick person.","zh":"（旧式用语）一种小而呈船形的喂食器皿，用来给婴儿或病人喂“pap”（糊状软食）或喂药。"},"examples":[{"en":"In the museum display, a silver papboat sat beside other baby-feeding tools from the 1700s.","zh":"在博物馆展柜里，一只银制 papboat 与其他18世纪的婴儿喂食工具摆放在一起。"},{"en":"The nurse warmed the thin porridge and poured it into a papboat for the infant.","zh":"护士把稀粥加热后倒进 papboat 里喂婴儿。"}]}],"synonyms":["pap-boat","feeding spoon (modern equivalent)","medicine spoon (modern equivalent)"],"phonetic":"/ˈpæpˌboʊt/","extraExplanation":["“pap”在历史英语中常指给婴儿或病人吃的糊状软食（类似米糊、稀粥）。因此 papboat 常见于较早期的家庭护理与育儿语境，现代英语里多用 spoon、feeding cup、medicine spoon 等更通用的说法。","该词也常写作 pap-boat。因为器皿形状像小船，所以用 boat 来比喻命名。"]}
{"word":"pape","summary":{"en":"“Pape” is mainly an archaic spelling of “pope,” and it can also be a surname.","zh":"“Pape”主要是“pope（教皇）”的旧拼写，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic or regional) An old spelling of “pope” (the leader of the Roman Catholic Church).","zh":"（古用或方言）“pope（教皇）”的旧拼写。"},"examples":[{"en":"Some older texts spell “pope” as “pape.”","zh":"一些较早的文本会把“pope（教皇）”拼作“pape”。"},{"en":"The character calls him the “Pape of Rome” in the old manuscript.","zh":"在那份旧手稿里，角色称他为“罗马的教皇（Pape of Rome）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname): Pape.","zh":"姓氏：Pape。"},"examples":[{"en":"Her last name is Pape.","zh":"她的姓是 Pape。"},{"en":"Dr. Pape will see you now.","zh":"Pape 医生现在可以见你了。"}]}],"synonyms":["pope"],"phonetic":"/peɪp/","extraExplanation":["“pape”在现代英语里不常用，更多见于古文、历史拼写或特定方言背景（例如苏格兰英语的一些旧式用法）。","如果你是在法语语境里看到“pape”，法语里它就直接是“教皇”的意思（英语对应 pope）。写英语时通常用“pope”，除非是在引用原文/旧拼写。"]}
{"word":"papegay","summary":{"en":"Papegay is an old word for a parrot, and it can also mean a parrot-shaped target in traditional archery contests.","zh":"Papegay 是“鹦鹉”的古语，也可指传统射箭比赛中的“鹦鹉形靶子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A parrot; also used as a poetic or old-fashioned word for a brightly colored bird.","zh":"（古语）鹦鹉；也可作诗意或旧式用法，指色彩鲜艳的鸟。"},"examples":[{"en":"In old ballads, the papegay often appears as a bright companion in a noble garden.","zh":"在古老民谣里，papegay 常被写作贵族花园里色彩明艳的伴鸟。"},{"en":"The lady kept a papegay that could mimic short phrases.","zh":"那位女士养了一只会模仿短句的 papegay（鹦鹉）。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) A parrot-shaped target used in medieval archery contests, especially in Scotland; hitting it could win a prize.","zh":"（历史）中世纪射箭比赛中使用的“鹦鹉形”靶子（尤见于苏格兰）；射中者可赢得奖赏。"},"examples":[{"en":"The archers took turns shooting at the papegay set high on a pole.","zh":"弓箭手轮流向竖在高杆上的 papegay（鹦鹉靶）射箭。"},{"en":"He trained all spring for the town’s papegay shoot.","zh":"他整个春天都在为镇上的 papegay 射箭赛训练。"}]}],"synonyms":["parrot","popinjay (archaic variant/related)"],"phonetic":"/ˈpæpəˌɡeɪ/","extraExplanation":["“papegay”是非常古老的英语词形之一，常见于中古英语与苏格兰语（Scots）语境，现代更常用的对应词是“parrot”。","在历史用法中，它常与射箭民俗有关：把木制或金属的“鹦鹉”固定在高杆顶端作为靶子，比赛名在苏格兰等地可见，类似的词还有“popinjay”（也可指“花孔雀/爱炫耀的人”，但“papegay”本身更偏向字面意义）。"]}
{"word":"papelera","summary":{"en":"“Papelera” is Spanish for a trash can/wastebasket, and in some regions it can also mean a paper mill/company.","zh":"“papelera”是西班牙语，常指垃圾桶/废纸篓；在一些地区也可指造纸厂/造纸公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a trash can or wastebasket; a container for throwing away small pieces of trash (often paper).","zh":"（西班牙语）垃圾桶；废纸篓（常指丢小垃圾、纸屑的容器）。"},"examples":[{"en":"Throw it in the papelera, please.","zh":"请把它丢进垃圾桶（废纸篓）里。"},{"en":"There’s a papelera next to the desk for used tissues and paper.","zh":"桌旁有一个废纸篓，用来丢用过的纸巾和纸张。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin America) a paper company or paper mill (a business that makes paper).","zh":"（拉美）造纸公司；造纸厂。"},"examples":[{"en":"The town grew around a large papelera that provided many jobs.","zh":"这座城镇因一家大型造纸厂而发展起来，提供了很多工作。"}]}],"synonyms":["trash can","wastebasket","bin","paper bin"],"phonetic":"/ˌpɑpəˈlɛrə/","extraExplanation":["“papelera”在西班牙语里来自“papel（纸）”。在日常生活中最常见的意思是“废纸篓/垃圾桶”。在部分拉美地区，它也常指“造纸厂/造纸公司”，语境通常与工业、企业或地方经济有关。","在英语对话中直接说“papelera”多见于双语环境或在西语国家旅行时；在纯英语里更常用“trash can / wastebasket / bin”（英式更常说“bin”）。"]}
{"word":"papeleras","summary":{"en":"“Papeleras” is Spanish (plural) meaning trash cans/wastebaskets, and sometimes paper companies.","zh":"“papeleras”是西班牙语复数，常指垃圾桶/废纸篓；有时也指造纸公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural noun) Trash cans / wastebaskets; containers where you throw away small pieces of trash (often paper).","zh":"（西班牙语，复数名词）垃圾桶/废纸篓；用来丢弃小垃圾（常见是纸张）的容器。"},"examples":[{"en":"There are papeleras on every corner, so please don’t litter.","zh":"每个街角都有垃圾桶（papeleras），所以请不要乱丢垃圾。"},{"en":"Put the used tissues in the papeleras, not on the table.","zh":"用过的纸巾请丢进垃圾桶（papeleras），不要放在桌上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural noun) Paper companies / paper mills (companies related to paper production).","zh":"（西班牙语，复数名词）造纸公司/纸业公司（与纸张生产相关的企业）。"},"examples":[{"en":"Several papeleras in the region export paper products.","zh":"该地区有多家造纸公司（papeleras）出口纸制品。"}]}],"synonyms":["trash cans","wastebaskets","bins","basureros (Spanish)"],"phonetic":"/ˌpɑːpəˈlɛrɑs/","extraExplanation":["“papelera”的本义与“papel（纸）”有关，所以在很多地方它常指“废纸篓/丢纸的桶”，但日常也常被用来泛指小型垃圾桶。","地区用法会不同：有些国家更常说“basurero/basura（垃圾桶）”。在公共场所看到“Papelera”标识，通常就是指投放垃圾的桶。"]}
{"word":"papelon","summary":{"en":"Papelon usually means unrefined cane sugar (like panela/piloncillo) and can also mean an embarrassing blunder in some Latin American slang.","zh":"Papelon 通常指未精制的甘蔗黑糖块（类似 panela/piloncillo），在部分拉美口语中也可指“出糗的失误”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin American Spanish loanword) Unrefined cane sugar molded into a block or cone; similar to panela or piloncillo.","zh":"（拉丁美洲西语借词）未精制的甘蔗糖，通常压成砖状或锥状；类似 panela（黑糖块）或 piloncillo（墨西哥锥形黑糖）。"},"examples":[{"en":"The recipe calls for papelon instead of white sugar.","zh":"这个食谱要用 papelon，而不是白砂糖。"},{"en":"In Venezuela, people often sweeten drinks with papelon.","zh":"在委内瑞拉，人们常用 papelon 给饮料增甜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, some Latin American regions) An embarrassing mistake or public blunder.","zh":"（非正式，拉美部分地区）尴尬的失误；出丑的错误。"},"examples":[{"en":"He made a papelon during the presentation and forgot his main point.","zh":"他在演讲时出了个大糗，忘了重点。"},{"en":"Don’t worry—it was a small papelon, not the end of the world.","zh":"别担心——只是个小尴尬，不是什么大事。"}]}],"synonyms":["panela","piloncillo","unrefined cane sugar","brown sugar (block)","blunder","fiasco"],"phonetic":"ˌpɑːpəˈloʊn","extraExplanation":["“papelón”原本带重音符号（papelón）。很多英语语境或不方便打重音时会写成“papelon”。","不同国家用法有差异：在委内瑞拉等地常指黑糖块（也常见饮品“papelón con limón”＝黑糖柠檬饮）；在部分地区口语里也可指“出糗/丢脸的错误”。"]}
{"word":"papelonne","summary":{"en":"papelonne: a heraldic term for a surface covered with overlapping rounded, scale-like shapes; also the name of that pattern.","zh":"papelonne：纹章学用语，指表面覆有重叠的圆弧鳞片状纹样；也可指这种纹样本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Covered with a pattern of small, overlapping, rounded scales (often drawn like fish scales or butterfly wings).","zh":"（纹章学）呈“鱼鳞状/蝶翼状”重叠小圆鳞片图案的；覆以这种鳞片纹样的。"},"examples":[{"en":"The shield is described as papelonne, meaning it is filled with overlapping scale-like shapes.","zh":"该盾徽被描述为 papelonne，意思是盾面布满重叠的鳞片状图形。"},{"en":"In some coats of arms, a papelonne pattern gives the design a textured, shimmering look.","zh":"在一些家族徽章中，papelonne 的鳞片纹样会让图案看起来更有质感、像在闪烁。"}]},{"partOfSpeech":"n.","definition":{"en":"A scale-like pattern used in heraldic designs, made of many small, overlapping rounded shapes.","zh":"（纹章学）一种鳞片状纹样：由许多小的、圆弧形的图形相互重叠组成。"},"examples":[{"en":"The artist added papelonne to the background to suggest armor or protective covering.","zh":"艺术家在背景加入 papelonne 鳞片纹样，用来暗示盔甲或防护层。"}]}],"synonyms":["papelonny","scaled","imbricated"],"phonetic":"/ˌpæpəˈloʊn/","extraExplanation":["这个词主要见于“纹章学（heraldry）”，属于较冷门的专门词汇。它源自法语，与 papillon（蝴蝶）有关，因为这种重叠纹样在视觉上有点像蝶翼或鳞片。","在英语纹章描述中，你也可能更常看到拼写变体 papelonny（同义、同一概念）。"]}
{"word":"paper","summary":{"en":"Paper is a thin material used for writing or wrapping; it can also mean a newspaper, an academic article, or official documents (papers). As a verb, it can mean to cover with paper/wallpaper or to “paper over” problems.","zh":"paper 指“纸”，也可指“报纸”“论文/文章”，或（常用复数）“证件/文件”。作动词可指用纸/墙纸覆盖，或用 paper over 表示“掩盖问题”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin material made from wood pulp (or other fibers) used for writing, printing, wrapping, and many other purposes.","zh":"纸；一种由木浆（或其他纤维）制成的薄材料，用于书写、印刷、包装等。"},"examples":[{"en":"Please write your name on a piece of paper.","zh":"请把你的名字写在一张纸上。"},{"en":"She wrapped the gift in colorful paper.","zh":"她用彩色包装纸把礼物包起来。"},{"en":"This book is printed on recycled paper.","zh":"这本书用再生纸印刷。"}]},{"partOfSpeech":"n.","definition":{"en":"A newspaper or a specific newspaper company.","zh":"报纸；（某一家）报社/报纸。"},"examples":[{"en":"I read the paper every morning.","zh":"我每天早上看报纸。"},{"en":"The story was reported in a local paper.","zh":"这条新闻在当地报纸上报道了。"}]},{"partOfSpeech":"n.","definition":{"en":"An academic article or an official piece of writing, especially for school, work, or publication.","zh":"论文；（学校/工作/出版用的）文章、报告。"},"examples":[{"en":"He is writing a paper on climate change.","zh":"他正在写一篇关于气候变化的论文。"},{"en":"Please submit your paper by Friday.","zh":"请在周五前提交你的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"Official documents, especially those that prove identity or rights (often plural: papers).","zh":"（常用复数）证件；文件（尤其是证明身份或权利的）。"},"examples":[{"en":"Do you have your papers with you?","zh":"你带了证件吗？"},{"en":"The police asked for his papers.","zh":"警察要求查看他的证件。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover something with wallpaper or a paper layer.","zh":"用墙纸裱糊；用纸覆盖。"},"examples":[{"en":"They papered the walls in light blue.","zh":"他们用浅蓝色墙纸贴了墙面。"}]},{"partOfSpeech":"v.","definition":{"en":"To hide problems by covering them up in a way that looks nice but does not fix them (common in: paper over).","zh":"（常用于 paper over）掩盖问题；粉饰（并未真正解决）。"},"examples":[{"en":"The company tried to paper over the mistakes with a quick apology.","zh":"公司试图用一句匆忙的道歉来掩盖这些错误。"}]}],"synonyms":["sheet (of paper)","newspaper","document","article","wallpaper (v.)"],"phonetic":"/ˈpeɪpər/","extraExplanation":["“paper”作“论文/文章”时，在美式英语里很常见：a paper 既可以指课堂作业的短文，也可以指学术期刊论文（research paper）。如果要更正式地说“期末论文”，常用 term paper。","“papers”表示“证件/文件”时，常出现在移民、旅行或警察盘查等语境中，相当于中文里的“证件”“手续”。","常见搭配：paper bag（纸袋）、paper plane（纸飞机）、paperwork（文书工作/手续）、paper towel（厨房纸巾）、paper cut（纸割伤）。"]}
{"word":"paperasserie","summary":{"en":"Paperasserie means annoying, excessive paperwork and bureaucratic red tape.","zh":"paperasserie 指令人厌烦的繁琐文件手续与官僚式的“繁文缛节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive paperwork and bureaucratic formalities; red tape.","zh":"繁琐的文书手续与官僚作风；繁文缛节（类似 red tape）。"},"examples":[{"en":"We lost a week to paperasserie before we could start the project.","zh":"在项目能开始之前，我们被一堆繁琐的手续耽误了整整一周。"},{"en":"She complained that the permit process was pure paperasserie.","zh":"她抱怨说办许可证的流程全是繁文缛节。"}]}],"synonyms":["red tape","bureaucracy","excessive paperwork","administrative hassle","bureaucratic formalities"],"phonetic":"/ˌpeɪpəˈræsəri/","extraExplanation":["这个词源自法语 paperasserie，在英语里比较少见，常用于带一点讽刺或抱怨的语气，意思接近 “bureaucracy / red tape”。","使用场景多和政府机关、公司流程、申请许可、报销、盖章等有关：强调“文件很多、流程很慢、形式大于内容”。","在正式英语写作中更常用 red tape, bureaucracy, excessive paperwork；paperasserie更像一种较文艺或法式的表达。"]}
{"word":"paperback","summary":{"en":"“Paperback” means a book (or edition) with a soft paper cover, usually cheaper and lighter than a hardcover.","zh":"“Paperback”指平装书/平装版，纸封面、通常比精装更便宜也更轻便。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book with a flexible paper cover (not a hard cover); also called a softcover","zh":"（书的）平装本；纸封面、非精装（也叫 softcover）"},"examples":[{"en":"I bought the paperback because it was cheaper than the hardcover.","zh":"我买了平装本，因为它比精装本便宜。"},{"en":"This novel is available in both hardcover and paperback.","zh":"这本小说既有精装版也有平装版。"},{"en":"Paperbacks are light, so they’re easy to carry on trips.","zh":"平装书很轻，旅行时很方便携带。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a flexible paper cover; not hardback","zh":"平装的；纸封面的（非精装的）"},"examples":[{"en":"I’m looking for the paperback edition of this textbook.","zh":"我在找这本教材的平装版。"},{"en":"The paperback version was released a year after the hardcover.","zh":"平装版在精装版发行一年后推出。"}]}],"synonyms":["softcover","paperbound"],"phonetic":"/ˈpeɪpərˌbæk/","extraExplanation":["在出版行业里，paperback 常与 hardcover（精装）对比：精装更耐用、通常更贵；平装更轻便、价格更亲民。你也会看到 mass-market paperback（大众市场平装，小开本、更便宜）和 trade paperback（商业平装，尺寸较大、纸张更好）这两种更细的分类。"]}
{"word":"paperbacks","summary":{"en":"Paperbacks are books with soft paper covers (plural noun).","zh":"paperbacks 指“平装书”（复数名词），即软封面纸质装订的书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Books with flexible paper covers (not hardcovers); plural of “paperback.”","zh":"平装书；纸质软封面的书（非精装书），“paperback”的复数。"},"examples":[{"en":"I prefer paperbacks because they’re lighter to carry on the train.","zh":"我更喜欢平装书，因为坐火车携带更轻便。"},{"en":"This bookstore has a whole shelf of used paperbacks for cheap.","zh":"这家书店有一整排便宜的二手平装书。"}]}],"synonyms":["paperback books","softcovers","paperback editions"],"phonetic":"/ˈpeɪpərˌbæks/","extraExplanation":["在英语里，paperback 常和 hardcover（精装书）对比。平装书通常更便宜、更轻，但耐用度一般不如精装。","在美式英语中也常说 paperback edition（平装版）或 mass-market paperback（小开本、面向大众市场的平装版，通常更小更便宜）。"]}
{"word":"paperbark","summary":{"en":"Paperbark is an Australian tree with bark that peels in papery layers, or the bark itself.","zh":"paperbark 指树皮像纸一样层层剥落的纸皮树（多见于澳大利亚），也可指这种纸状树皮本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tree (especially in Australia) with soft, papery bark that peels off in layers; often a melaleuca (genus Melaleuca).","zh":"（尤指澳大利亚的）纸皮树；树皮柔软呈纸状、会一层层剥落的树，常指白千层属（Melaleuca）的树。"},"examples":[{"en":"Paperbark trees grow well near wetlands and creeks.","zh":"纸皮树很适合生长在湿地和小溪旁。"},{"en":"The park path is lined with paperbarks, and you can see their bark peeling like paper.","zh":"公园小路两旁种着纸皮树，你能看到它们的树皮像纸一样一层层剥落。"}]},{"partOfSpeech":"n.","definition":{"en":"The papery bark of a paperbark tree, used as a natural wrapping or for making fires.","zh":"纸皮树的纸状树皮，可用作天然包裹材料或引火物。"},"examples":[{"en":"In a survival lesson, we used dry paperbark to help start a campfire.","zh":"在野外生存课上，我们用干燥的纸皮树皮来帮助生火。"},{"en":"They carefully wrapped the food in paperbark for the journey.","zh":"他们小心地用纸皮树皮把食物包起来带上路。"}]}],"synonyms":["melaleuca","paper-bark tree","broad-leaved paperbark"],"phonetic":"/ˈpeɪpɚˌbɑrk/","extraExplanation":["“paperbark”常见于澳大利亚英语，很多时候特指白千层属（Melaleuca）的树。它们的树皮像纸一样层层堆叠、易剥落，这是这种树非常显著的识别特征。","在澳大利亚原住民的传统生活中，纸皮树皮曾被用作包裹、铺垫、临时遮雨等用途；现代语境里也常出现在自然步道、湿地景观与园艺介绍中。","近义词里常见“melaleuca”“bottlebrush”（但注意：bottlebrush多指另一类外形相似、花序像瓶刷的植物，并不总等同于paperbark）。"]}
{"word":"paperboard","summary":{"en":"Paperboard is a thick, stiff paper material commonly used for packaging and boxes.","zh":"paperboard 指较厚较硬的纸板，常用于包装和盒子等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick, stiff paper material used to make boxes, packaging, and displays; a general term for cardboard-like sheets.","zh":"纸板；一种较厚、较硬的纸质材料，常用于制作盒子、包装和展示架等（泛指类似硬纸板的纸片）。"},"examples":[{"en":"The cereal box is made from paperboard.","zh":"麦片盒是用纸板做的。"},{"en":"We designed a paperboard display for the new product.","zh":"我们为新产品设计了一个纸板展示架。"}]}],"synonyms":["cardboard","boxboard"],"phonetic":"/ˈpeɪpərˌbɔrd/","extraExplanation":["在包装领域里，paperboard 通常比普通 paper（纸）厚且更硬，但一般又比 corrugated cardboard（瓦楞纸板/波纹纸板）更薄、更平。常见用途包括食品盒（如麦片盒）、化妆品盒、礼盒内衬等。","相关词区分：cardboard 在日常口语里常被当作“纸板”的泛称；更专业的语境里，paperboard 常指单层的厚纸板，而 corrugated cardboard 指有波纹夹层、用于运输纸箱的那种更结实的材料。"]}
{"word":"paperboards","summary":{"en":"“Paperboards” is the plural of “paperboard,” meaning thick, stiff paper material or sheets/boards made from it.","zh":"paperboards 是 paperboard 的复数，指厚而硬的纸板材料，或由纸板制成的一张张/一块块板材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick, stiff paper material used for making boxes, packaging, book covers, and similar products (plural form).","zh":"（复数）纸板；一种较厚、较硬的纸材料，常用于制作盒子、包装、书封等。"},"examples":[{"en":"The cereal boxes are made from paperboards that can be recycled.","zh":"麦片盒是用可回收的纸板做的。"},{"en":"We tested different paperboards to find the strongest one for the package.","zh":"我们测试了不同的纸板，找出最适合包装的那种。"}]},{"partOfSpeech":"n.","definition":{"en":"Boards or sheets made of paperboard, used as flat pieces for backing, displays, or crafts (plural form).","zh":"（复数）纸板板材；由纸板制成的一块块板或一张张板材，用作衬板、展示板或手工材料。"},"examples":[{"en":"The artist mounted the photos on paperboards for the exhibition.","zh":"艺术家把照片贴在纸板上用于展览。"},{"en":"Cut the paperboards into smaller pieces for the project.","zh":"把纸板切成更小的块来做这个项目。"}]}],"synonyms":["paperboard","cardboard (general use)","chipboard","carton board"],"phonetic":"/ˈpeɪpərbɔrdz/","extraExplanation":["在日常英语里，paperboard 常指“纸板材料”，强调它比普通纸厚、比硬纸板（cardboard）更“纸质”。很多时候人们会用 cardboard 泛指各种纸板，但在包装行业里，paperboard（纸板）与 corrugated cardboard（瓦楞纸板）常被区分：前者通常是单层或多层压合的厚纸，后者有波浪形夹层，更适合做结实的运输箱。"]}
{"word":"paperbound","summary":{"en":"“Paperbound” means “paperback”: a book with a soft paper cover, or describing something that has a paper cover.","zh":"“paperbound”意为“平装（书）”：指纸质软封面（非精装）的书，或形容具有纸封面的版本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a soft paper cover (not a hard cover); paperback.","zh":"纸质软封面的；平装的（非精装）。"},"examples":[{"en":"I bought the paperbound edition because it was cheaper.","zh":"我买了平装版，因为更便宜。"},{"en":"The novel is available in both hardback and paperbound forms.","zh":"这本小说既有精装版，也有平装版。"}]},{"partOfSpeech":"n.","definition":{"en":"A book with a paper cover; a paperback book.","zh":"平装书；纸封面的书。"},"examples":[{"en":"She packed a few paperbounds for the long trip.","zh":"她为长途旅行带了几本平装书。"},{"en":"Used bookstores often have shelves full of paperbounds.","zh":"二手书店常常有一整排平装书。"}]}],"synonyms":["paperback","softcover","softbound"],"phonetic":"/ˈpeɪpərˌbaʊnd/","extraExplanation":["“paperbound”在美式英语里能用，但更常见、更日常的说法是“paperback”（名词：平装书；形容词：平装的）。在出版语境中，“paperbound edition”≈“paperback edition”。","和“hardcover/hardback（精装）”相对。平装通常更便宜、更轻便，但更容易磨损。"]}
{"word":"paperboy","summary":{"en":"A paperboy is a young person who delivers newspapers to homes.","zh":"paperboy 指送报童/送报员，即把报纸送到住户家的年轻人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boy (or young person) who delivers newspapers to people’s homes, usually on a regular route.","zh":"（通常指）送报童；负责把报纸按固定线路送到住户家的男孩（或年轻人）。"},"examples":[{"en":"When my dad was a paperboy, he rode his bike before school to deliver newspapers.","zh":"我爸爸小时候当过送报童，上学前骑自行车送报纸。"},{"en":"The paperboy threw the newspaper onto the porch every morning.","zh":"送报童每天早上把报纸扔到门廊上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a newspaper delivery worker, especially in a traditional or old-fashioned sense.","zh":"与送报（送报员/送报童）有关的（常带传统、旧时的感觉）。"},"examples":[{"en":"He had a paperboy route in the neighborhood.","zh":"他在社区有一条送报路线。"},{"en":"It’s a classic paperboy job: early mornings, bike, and a stack of newspapers.","zh":"这是典型的送报童工作：清晨、骑车、还要带一摞报纸。"}]}],"synonyms":["newspaper delivery boy","newspaper carrier","paper carrier"],"phonetic":"/ˈpeɪpərˌbɔɪ/","extraExplanation":["“paperboy”带有一定时代感：在美国等英语国家，过去很多孩子会通过送报纸赚零花钱。随着电子媒体普及，传统“paperboy”更常见于回忆、电影或文学描写中。","在文化语境里，送报童常象征“勤快、独立、早起工作”的青少年形象。"]}
{"word":"paperboys","summary":{"en":"Paperboys are people—traditionally boys—who deliver or (in older use) sell newspapers.","zh":"paperboys 指送报（传统上多为男孩）的送报员；旧用法也可指街头卖报的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boys or (more broadly) people who deliver newspapers to homes, usually on a regular route.","zh":"送报的男孩；也可泛指送报员（负责把报纸按路线送到住户）。"},"examples":[{"en":"When my grandpa was a paperboy, he rode his bike before school to deliver newspapers.","zh":"我爷爷小时候当过送报童，上学前骑自行车送报纸。"},{"en":"The paperboys dropped the newspaper on the porch every morning.","zh":"送报员每天早上把报纸放在门廊上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Older use) Boys who sell newspapers in public places, calling out headlines to attract buyers.","zh":"（较旧用法）街头卖报的男孩，会喊头条来招揽顾客。"},"examples":[{"en":"In old movies, paperboys shout the news on busy street corners.","zh":"在老电影里，卖报童会在繁忙的街角大声喊新闻。"}]}],"synonyms":["newspaper carriers","paper carriers","newspaper delivery people","newsboys"],"phonetic":"/ˈpeɪpərˌbɔɪz/","extraExplanation":["“paperboy”这个词在英语里带有年代感，也有性别色彩；现在更中性、常见的说法是“newspaper carrier / paper carrier / newspaper delivery person”。","随着纸质报纸发行减少，这个职业在一些地区不如过去常见，所以在电影、小说、回忆录中更容易出现。"]}
{"word":"paperclip","summary":{"en":"A paperclip is a small clip used to hold papers together; it can also be used as a verb meaning to fasten papers with a paperclip.","zh":"paperclip 指“回形针”，用来夹住多张纸；也可作动词，表示“用回形针夹起来”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bent piece of wire or plastic used to hold sheets of paper together without staples.","zh":"回形针（用来把几张纸夹在一起的小金属丝或塑料夹子，不用订书钉）。"},"examples":[{"en":"Can you hand me a paperclip to keep these pages together?","zh":"你能递我一个回形针把这些页夹在一起吗？"},{"en":"She clipped the receipts with a paperclip and put them in her bag.","zh":"她用回形针夹好收据，然后放进包里。"}]},{"partOfSpeech":"v.","definition":{"en":"To fasten papers together using a paperclip.","zh":"用回形针把纸张夹在一起。"},"examples":[{"en":"Please paperclip your assignment before you turn it in.","zh":"请在交作业前用回形针把纸夹好。"},{"en":"I paperclipped the notes to the front of the report.","zh":"我把便签用回形针夹在报告的第一页。"}]}],"synonyms":["clip","binder clip (similar use, different tool)","fastener"],"phonetic":"/ˈpeɪpərˌklɪp/","extraExplanation":["“paperclip”是一个复合词（paper + clip）。在办公室英语里很常见，也常见于学校场景。","口语中也常说“a clip”，但“clip”含义更广（夹子、剪辑等），不一定特指回形针。","回形针在英语文化中有时象征“简单但有效的解决方案”，也常被用来做小工具（如临时取出SIM卡托），但正式场合仍建议用专用工具。"]}
{"word":"papercut","summary":{"en":"A papercut is a small, painful cut caused by paper.","zh":"papercut 指被纸张边缘划出的细小但常很刺痛的伤口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, sharp cut on the skin caused by the edge of paper (or something similarly thin, like cardboard).","zh":"（被纸张或类似很薄的东西，如纸板）边缘划出的细小伤口。"},"examples":[{"en":"I got a papercut from the envelope, and it stings a lot.","zh":"我被信封边缘划了个纸割伤，特别刺痛。"},{"en":"Be careful turning pages—you can get a papercut easily.","zh":"翻页时小心点——很容易被纸划伤。"}]}],"synonyms":["small cut","scratch"],"phonetic":"/ˈpeɪpərˌkʌt/","extraExplanation":["“papercut”常让人觉得“伤口不大但很痛”，因为手指上神经末梢多，伤口又细且容易摩擦到；因此在口语里也可比喻“小问题却很烦人/很折磨”。例如：That comment was a papercut—small but it hurt.（那句话像纸割伤一样，不大但很伤人。）","也常写作两词“paper cut”。作名词时两种拼法都能见到；作动词时通常写“paper-cut”（如：paper-cut edges 纸裁切的边缘）。"]}
{"word":"papercutting","summary":{"en":"Papercutting means cutting paper, especially to create decorative designs as an art or craft.","zh":"Papercutting 指剪纸，尤其是作为手工或艺术来剪出装饰图案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or craft of cutting paper, especially to make decorative designs (paper-cutting art)","zh":"剪纸；（尤指）用剪裁纸张制作装饰图案的工艺"},"examples":[{"en":"We tried papercutting in art class and made snowflake patterns.","zh":"我们在美术课上尝试了剪纸，做了雪花图案。"},{"en":"Traditional papercutting is often used to decorate windows during festivals.","zh":"传统剪纸常用于节日期间装饰窗户。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of cutting something out of paper (more general, not necessarily decorative)","zh":"剪纸（泛指用纸剪出某物的行为，不一定是装饰艺术）"},"examples":[{"en":"Papercutting is a quick way to make simple labels for jars.","zh":"剪纸是一种快速制作简易瓶罐标签的方法。"},{"en":"The project involves papercutting and gluing shapes onto a poster.","zh":"这个项目包括剪纸并把形状粘到海报上。"}]}],"synonyms":["paper-cutting","paper cutting","paper art","cut-paper art"],"phonetic":"/ˈpeɪpərˌkʌtɪŋ/","extraExplanation":["“papercutting / paper-cutting”既可写作一个词，也可加连字符。作为艺术形式时，常与中国传统剪纸相关（如春节窗花、红色纸艺），也见于其他文化（例如墨西哥的 papel picado）。在英语语境中，若强调“传统民间艺术”，常说 traditional paper-cutting 或 Chinese paper-cutting。"]}
{"word":"papered","summary":{"en":"“Papered” most often means “covered with paper (especially wallpaper),” and it is also the past tense/participle of “paper.” In the phrase “paper over,” it means to hide a problem rather than solve it.","zh":"“papered”常指“被纸覆盖（尤指贴了墙纸）”，也是动词“paper”的过去式/过去分词；在短语“paper over”中表示“掩盖问题而非解决”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “paper” (to cover with paper, especially wallpaper; or to deal with something by using paper such as forms).","zh":"“paper”的过去式/过去分词（用纸覆盖，尤指贴墙纸；或用文件/表格处理某事）。"},"examples":[{"en":"They papered the bedroom walls with a light blue wallpaper.","zh":"他们用浅蓝色墙纸把卧室墙面贴好了。"},{"en":"The office papered the application quickly, but the real work started later.","zh":"办公室很快把申请材料手续办齐了，但真正的工作是后来才开始的。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with paper, especially wallpaper.","zh":"被纸覆盖的；（尤指）贴了墙纸的。"},"examples":[{"en":"We moved into a small apartment with papered walls.","zh":"我们搬进了一套小公寓，墙上贴着墙纸。"},{"en":"The papered hallway looked brighter after new lighting was installed.","zh":"装上新灯后，贴墙纸的走廊看起来更明亮了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in “paper over”) to hide or make a problem seem smaller without truly solving it.","zh":"（用于“paper over”）掩盖问题；用表面办法遮丑而不真正解决。"},"examples":[{"en":"They tried to paper over the disagreement with a quick apology.","zh":"他们想用一句匆忙的道歉来掩盖分歧。"},{"en":"New paint can paper over the damage, but the wall still needs repair.","zh":"新油漆能暂时遮住损坏，但墙还是需要修。"}]}],"synonyms":["wallpapered","covered","wrapped","masked (paper over)","glossed over (paper over)"],"phonetic":"/ˈpeɪpərd/","extraExplanation":["“paper”表示“贴墙纸”时，在英语里很常见：paper the walls / paper a room。对应名词是 wallpaper（墙纸）。","“paper over”是常用比喻：像用纸把裂缝盖住一样，意思是“遮掩/粉饰”，通常暗含“不彻底、不长久”的批评意味。"]}
{"word":"paperer","summary":{"en":"“Paperer” means a person who covers things with paper, especially someone who puts up wallpaper.","zh":"“paperer”指用纸覆盖物品的人，尤指贴墙纸的工人（较少见用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who papers something, especially someone who puts up wallpaper.","zh":"贴纸（或贴墙纸）的人；尤指贴墙纸的工人。"},"examples":[{"en":"We hired a paperer to wallpaper the living room.","zh":"我们雇了一位贴墙纸的工人来给客厅贴墙纸。"},{"en":"The paperer measured the wall carefully before cutting the rolls.","zh":"贴墙纸的人在裁剪墙纸卷之前先仔细测量了墙面。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who covers something with paper (for protection or decoration).","zh":"用纸包裹或覆盖物品的人（用于保护或装饰）。"},"examples":[{"en":"At the gift shop, a paperer wrapped each souvenir neatly.","zh":"在礼品店里，负责包装的人把每件纪念品都包得很整齐。"},{"en":"The paperer used brown paper to protect the books during the move.","zh":"包装的人用牛皮纸在搬家时保护书籍。"}]}],"synonyms":["paperhanger","wallpaper installer","wrapper"],"phonetic":"/ˈpeɪpərər/","extraExplanation":["“paperer”这个词在现代英语里比较少见，日常更常说“wallpaper installer / paperhanger”（贴墙纸的工人）或“wrapper”（包装的人）。","它来自动词“paper”（用纸覆盖、贴墙纸）+ 表示“做某事的人”的后缀“-er”。如果你本来想表达“纸张相关的人/物”，也可能是把“paper”（纸、论文、报纸）或“papermaker”（造纸工人）拼错了。"]}
{"word":"paperers","summary":{"en":"“Paperers” (plural of “paperer”) usually means people who put up wallpaper or cover something with paper; it’s uncommon in modern English.","zh":"“paperers”（“paperer”的复数）通常指贴墙纸或用纸覆盖表面的人；在现代英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who papers something, especially someone who puts up wallpaper or covers surfaces with paper","zh":"贴纸/糊纸的人；尤指贴墙纸（壁纸）的人"},"examples":[{"en":"The paperers finished the living room wallpaper in one afternoon.","zh":"贴墙纸的工人一个下午就把客厅的壁纸贴好了。"},{"en":"We hired professional paperers to avoid bubbles and crooked seams.","zh":"我们请了专业贴壁纸的人来避免起泡和接缝歪斜。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) people who produce or distribute papers such as newspapers, leaflets, or official documents","zh":"（罕见）制作或分发报纸、传单或文件的人"},"examples":[{"en":"During the campaign, paperers handed out flyers outside the station.","zh":"竞选期间，发传单的人在车站外派发宣传单。"}]}],"synonyms":["wallpaper hangers","decorators","flyer distributors","canvassers"],"phonetic":"/ˈpeɪpərər/","extraExplanation":["“paperers”是“paperer”的复数，但在现代英语里不常见。日常更常说：\n- 贴墙纸的人：wallpaper hanger / decorator\n- 发传单的人：flyer distributor / canvasser\n- 做报纸的人：journalists / newspaper staff\n如果你是想表达“论文作者/写论文的人”，通常用“authors”或“paper writers”（学术语境下也可说“researchers”）。"]}
{"word":"paperful","summary":{"en":"“Paperful” is a rare word meaning “full of papers” (adj.) or “a sheetful of writing” (n.).","zh":"“paperful”较罕见，可指“满是文件的”（形容词）或“一整页的文字/内容”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Full of papers; containing a lot of paper (documents, notes, etc.).","zh":"（罕用）装满纸张或文件的；纸张很多的。"},"examples":[{"en":"Her desk drawer was paperful, stuffed with old receipts and letters.","zh":"她的抽屉里塞满了纸，堆着旧收据和信件。"},{"en":"The backpack was paperful after the conference.","zh":"开完会议后，背包里装满了资料。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) An amount that fills a sheet or piece of paper; a sheetful (of writing).","zh":"（罕用，非正式）一张纸能写满的量；一整页（文字/内容）。"},"examples":[{"en":"He handed me a paperful of quick notes.","zh":"他递给我一整页匆匆写下的笔记。"},{"en":"She wrote a paperful before lunch.","zh":"午饭前她就写满了一页。"}]}],"synonyms":["paper-filled","full of papers","a pageful","a sheetful"],"phonetic":"/ˈpeɪpɚfəl/","extraExplanation":["“paperful”不是常见的标准词汇，更多见于仿照“spoonful（满一勺）”“handful（一把）”这类结构的创造性用法。日常英语里更常说“a stack of papers（一些/一摞文件）”“a drawer full of papers（抽屉里装满文件）”“a page full of notes（满页笔记）”。","如果你想表达“有很多论文/作业”，通常用“a lot of papers / lots of paperwork（很多文书工作）”，而不是“paperful”。"]}
{"word":"papergirl","summary":{"en":"A papergirl is a girl who delivers newspapers to homes.","zh":"papergirl 指送报纸到住户家的女孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A girl who delivers newspapers to people’s homes (often on a regular route).","zh":"（通常按固定路线）送报纸到住户家门口的女孩。"},"examples":[{"en":"She worked as a papergirl before school every morning.","zh":"她每天早上上学前都做送报女孩。"},{"en":"The papergirl rode her bike down the street and tossed newspapers onto porches.","zh":"送报女孩骑着自行车沿街骑行，把报纸扔到各家门廊上。"}]}],"synonyms":["newspaper carrier","paper carrier","delivery girl (for newspapers)","paperboy (traditional; not gender-neutral)"],"phonetic":"/ˈpeɪpərˌɡɝːl/","extraExplanation":["“papergirl / paperboy”在英美文化里常让人联想到一种传统的兼职：青少年清晨送报（paper route）。随着纸质报纸订阅减少，这种工作现在比过去少见，但在影视作品中仍常用来表现“早起、负责、赚零花钱”的生活场景。","“Paper Girls”也是一部较知名的英文漫画/剧集标题；如果你看到大写并用复数（Paper Girls），通常指作品名而不是一般名词。"]}
{"word":"paperhanger","summary":{"en":"A paperhanger is someone whose job is to hang wallpaper.","zh":"paperhanger 指以贴壁纸为职业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who puts up wallpaper (hangs paper) on walls; a wallpaper installer.","zh":"贴墙纸工人；壁纸安装工。"},"examples":[{"en":"We hired a paperhanger to redo the living room walls.","zh":"我们雇了一位贴墙纸工人来重新装饰客厅的墙面。"},{"en":"The paperhanger measured carefully before cutting the wallpaper.","zh":"贴墙纸工人在裁剪壁纸前仔细测量。"}]}],"synonyms":["wallpaper installer","wallpaper hanger","wallpaperer"],"phonetic":"/ˈpeɪpərˌhæŋɚ/","extraExplanation":["“paperhanger”由 paper（纸）+ hanger（悬挂者）构成，主要指“贴壁纸的人”。在现代口语中更常见的说法是 wallpaper installer 或 wallpaper hanger / wallpaperer。","由于壁纸曾常被称作 wallpaper 或 wall covering，早期也有人说 hang paper（贴纸、贴壁纸），所以出现了 paperhanger 这个职业名词。"]}
{"word":"paperhangers","summary":{"en":"Paperhangers are workers who hang (install) wallpaper.","zh":"paperhangers 指贴壁纸（安装墙纸）的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to put up wallpaper (to cover walls with decorative paper).","zh":"贴壁纸工人；以张贴墙纸（壁纸）为职业的人。"},"examples":[{"en":"We hired paperhangers to wallpaper the living room.","zh":"我们雇了贴壁纸工人来给客厅贴墙纸。"},{"en":"The old house needed skilled paperhangers because the walls were uneven.","zh":"那栋老房子需要手艺好的贴壁纸工人，因为墙面不平。"}]}],"synonyms":["wallpaper installers","wallpaper hangers","decorators (broad)"],"phonetic":"/ˈpeɪpərˌhæŋərz/","extraExplanation":["“paperhanger(s)”是一个职业称呼，单数是paperhanger。它由paper（纸）+ hanger（悬挂/张贴的人）构成，指专门把壁纸贴到墙上的工匠。现代装修中也常说“wallpaper installer”（壁纸安装工）。"]}
{"word":"paperhanging","summary":{"en":"Paperhanging means the work of putting wallpaper on walls, or something connected to that work.","zh":"paperhanging 指贴壁纸的工作/活动，也可作形容词表示“与贴壁纸有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the job or activity of putting wallpaper on walls","zh":"贴壁纸（把墙纸贴到墙上）的工作或活动"},"examples":[{"en":"We hired a professional for the paperhanging in the living room.","zh":"我们请了专业人士给客厅贴壁纸。"},{"en":"Paperhanging can be tricky because the pattern must match at the seams.","zh":"贴壁纸可能很难，因为接缝处的图案必须对齐。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or used for hanging wallpaper","zh":"与贴壁纸有关的；用于贴壁纸的"},"examples":[{"en":"He brought paperhanging tools like a smoothing brush and a sharp knife.","zh":"他带来了贴壁纸的工具，比如刮平刷和锋利的小刀。"},{"en":"She learned paperhanging techniques from her uncle.","zh":"她从叔叔那里学了贴壁纸的技巧。"}]}],"synonyms":["wallpapering","hanging wallpaper","putting up wallpaper"],"phonetic":"/ˈpeɪpərˌhæŋɪŋ/","extraExplanation":["“paperhanging”在英语里常指贴墙纸这门手艺或工作（类似“painting”“plumbing”）。在日常表达中也常写作“paper hanging”，而更常见的动词短语是“hang wallpaper”或“put up wallpaper”。"]}
{"word":"paperhangings","summary":{"en":"Paperhangings are decorative wall coverings, especially wallpaper.","zh":"paperhangings 指室内墙面装饰材料，尤其是墙纸/壁纸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative material (usually wallpaper) used to cover and decorate the inside walls of a room.","zh":"（通常指墙纸/壁纸等）用于覆盖并装饰室内墙面的装饰材料。"},"examples":[{"en":"The old paperhangings in the hallway were faded and peeling.","zh":"走廊里旧的墙纸已经褪色并开始脱落。"},{"en":"They chose light-colored paperhangings to make the small room feel brighter.","zh":"他们选了浅色墙纸，让小房间看起来更明亮。"},{"en":"The museum preserved the original paperhangings to show how the house looked in the 1800s.","zh":"博物馆保留了原来的墙纸，用来展示这座房子在19世纪的样子。"}]}],"synonyms":["wallpaper","wall covering","wallcovering"],"phonetic":"/ˈpeɪpərˌhæŋɪŋz/","extraExplanation":["“paperhangings”是一个较偏正式或较旧的说法，现代口语更常用“wallpaper”。在英国和美国的历史建筑、室内设计、文物保护等语境中更常见。","它常以复数形式出现（paperhangings），强调“墙面装饰材料”这一类物品，而不一定指一卷具体的墙纸。"]}
{"word":"paperiness","summary":{"en":"Paperiness means the papery quality of something—thin, dry, or paper-like in texture or sometimes taste.","zh":"Paperiness 指某物“像纸一样”的特性：薄、干、硬挺的触感，有时也指干涩的口感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being like paper—thin, dry, stiff, or slightly rough in texture.","zh":"像纸一样的特性——很薄、干、硬挺或略粗糙的质感。"},"examples":[{"en":"The paperiness of the old pages made them crackle when I turned them.","zh":"那些旧书页的纸感很强，我翻页时会沙沙作响。"},{"en":"If the lettuce feels paperiness instead of crisp, it’s probably past its best.","zh":"如果生菜摸起来是干干的纸感而不是爽脆，它可能已经不新鲜了。"}]},{"partOfSpeech":"n.","definition":{"en":"A dry, papery taste or mouthfeel (often used in describing food, tea, or wine).","zh":"干涩、像纸一样的味道或口感（常用于描述食物、茶或葡萄酒）。"},"examples":[{"en":"The tea had a slight paperiness, as if the leaves were over-dried.","zh":"这杯茶有一点纸般的干涩感，像是茶叶烘得太干了。"},{"en":"The wine finished with a faint paperiness on the tongue.","zh":"这款酒的余味在舌头上留下淡淡的纸感干涩。"}]}],"synonyms":["papery texture","dryness","thinness","stiffness"],"phonetic":"/ˈpeɪpərinis/","extraExplanation":["“paperiness”由“paper（纸）+ -iness（……的性质/状态）”构成。-iness 很常见，用来把形容词变成名词，例如：dry → dryness（干燥）、lazy → laziness（懒惰）。这里表示“像纸那样的感觉/特征”。"]}
{"word":"papering","summary":{"en":"Papering usually means covering walls with wallpaper; it can also mean distributing/adding lots of paper items, or (figuratively) hiding a problem (‘papering over’).","zh":"papering 通常指贴墙纸；也可指大量张贴/投放纸质材料；比喻用“papering over”表示掩盖问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(gerund/present participle) covering a wall or surface with wallpaper or sheets of paper.","zh":"（动名词/现在分词）用墙纸或纸张覆盖墙面或表面。"},"examples":[{"en":"They spent the weekend papering the living room with floral wallpaper.","zh":"他们周末在客厅贴了花卉图案的墙纸。"},{"en":"Papering is easier with two people: one holds the roll and the other smooths the bubbles.","zh":"两个人一起贴墙纸更容易：一个拿着墙纸卷，另一个把气泡刮平。"}]},{"partOfSpeech":"n.","definition":{"en":"(gerund/present participle) putting paper on or into many places, often in large quantities (e.g., adding flyers, notices, or documents).","zh":"（动名词/现在分词）大量张贴、散发或投放纸质材料（如传单、告示或文件）。"},"examples":[{"en":"The campaign began papering the neighborhood with posters.","zh":"竞选活动开始在社区大量张贴海报。"},{"en":"She was papering the folder with sticky notes to mark key pages.","zh":"她用便签纸在文件夹里做了很多标记来标出重点页面。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) hiding or covering up a problem so it looks fixed, without really solving it.","zh":"（比喻）掩盖问题、粉饰太平，看起来解决了但实际上没有。"},"examples":[{"en":"They kept papering over the budget issues instead of cutting costs.","zh":"他们一直在掩盖预算问题，而不是削减开支。"},{"en":"An apology that avoids responsibility is just papering over the conflict.","zh":"不承担责任的道歉只是掩盖矛盾。"}]}],"synonyms":["wallpapering","covering","plastering (with posters)","posting","papering over (covering up)"],"phonetic":"/ˈpeɪpərɪŋ/","extraExplanation":["“papering over”常用来形容“用表面手段遮住问题”，相当于中文的“掩耳盗铃/治标不治本/粉饰太平”。在正式写作里也很常见，带有批评意味。"]}
{"word":"paperings","summary":{"en":"“Paperings” most often means layers of wallpaper or the act of wallpapering; it can also mean superficial attempts to hide a problem (“papering over”).","zh":"“paperings”多指墙纸层/贴墙纸；也可比喻“敷衍掩盖问题”（papering over）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Covering a surface with paper, especially putting up wallpaper; the layers of paper used for this.","zh":"用纸覆盖表面（尤指贴墙纸）；用于覆盖的纸层（如墙纸层）。"},"examples":[{"en":"The old house still has three different paperings under the paint.","zh":"那栋老房子在油漆下面还有三层不同的墙纸。"},{"en":"We spent the weekend stripping off the paperings in the hallway.","zh":"我们整个周末都在把走廊里的墙纸一层层撕下来。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of covering or hiding something with a thin, superficial “paper” layer (often in the phrase “papering over”).","zh":"用表面的“纸层”来掩盖问题（常见于短语 papering over，强调治标不治本）。"},"examples":[{"en":"They were papering over deeper conflicts with polite smiles.","zh":"他们用客气的微笑在掩盖更深层的矛盾。"},{"en":"Quick apologies can feel like paperings over real harm.","zh":"草草道歉可能只是对真实伤害的敷衍掩盖。"}]}],"synonyms":["wallpaper layers","wallpapering","coverings","paper-over attempts"],"phonetic":"ˈpeɪpərɪŋz","extraExplanation":["“paperings”通常是名词“papering”的复数形式，较常见于谈装修/修复时，指不同年代留下的多层墙纸。","在比喻用法中，英语常说“paper over the cracks”（把裂缝用纸糊上），意思是表面修补、掩盖问题而不真正解决。"]}
{"word":"paperknife","summary":{"en":"A paperknife is a small knife used to open envelopes or cut uncut pages in older books.","zh":"paperknife 指一种小刀，用来拆信封或裁开旧式书籍未裁开的书页。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small knife (often blunt) used for opening envelopes or cutting the pages of a book that were printed with uncut edges","zh":"开信刀；裁纸刀（常较钝，用来拆信封或切开旧式书籍未裁开的书页）"},"examples":[{"en":"She used a paperknife to open the sealed envelope carefully.","zh":"她用开信刀小心地拆开了封好的信封。"},{"en":"In the old library, a paperknife was kept for cutting uncut pages in antique books.","zh":"在那座老图书馆里，放着一把裁纸刀，用来裁开古旧书中未裁开的书页。"}]}],"synonyms":["letter opener","paper knife"],"phonetic":"/ˈpeɪpərˌnaɪf/","extraExplanation":["“paperknife”也常写作“paper knife”。除了拆信封，它还有一个较文学/历史的用法：过去很多书装订时书页边缘没有完全裁开，读者需要用纸刀把两页之间的纸边轻轻划开才能阅读。如今这种用法较少见，但在旧书或古籍场景中仍会出现。"]}
{"word":"paperknives","summary":{"en":"Paperknives are tools (paper knives) used to open envelopes or cut uncut book pages.","zh":"paperknives 指拆信刀/裁页刀，用于开信封或裁开未裁开的书页。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “paper knife”: a small, often blunt tool used to open envelopes or cut the pages of a new book.","zh":"“paper knife”的复数：一种小型（通常不锋利的）工具，用来拆信封或裁开新书未裁开的纸页。"},"examples":[{"en":"The librarian kept several paperknives at the desk for opening donations.","zh":"图书管理员在服务台放了几把拆信刀，用来打开捐赠包裹。"},{"en":"He used a paperknife to open the sealed envelope carefully.","zh":"他用拆信刀小心地拆开密封的信封。"}]}],"synonyms":["letter openers","envelope openers","paper knives"],"phonetic":"/ˈpeɪpər naɪvz/","extraExplanation":["“paper knife”也常写作 two words（paper knife）。在英式英语里更常指“裁书刀/裁页刀”（用来裁开旧式书籍未裁开的纸页）；在现代日常语境里更常被理解为“拆信刀/开信刀”（letter opener）。"]}
{"word":"paperless","summary":{"en":"Paperless means using digital systems instead of paper documents.","zh":"paperless 指用电子系统替代纸质文件的“无纸化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using digital methods instead of printed documents; not relying on paper records.","zh":"无纸化的；使用电子方式替代纸质文件的。"},"examples":[{"en":"Our office is trying to become paperless by using e-signatures and cloud storage.","zh":"我们办公室正尝试通过电子签名和云端存储实现无纸化。"},{"en":"Paperless billing means you receive your bill by email instead of mail.","zh":"无纸化账单表示你通过电子邮件收到账单，而不是邮寄。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without any paper documents (often used about a process or system).","zh":"没有任何纸质文件的（常用于描述流程或系统）。"},"examples":[{"en":"The application process is completely paperless now.","zh":"现在申请流程已经完全无纸化了。"},{"en":"They created a paperless workflow for new employees.","zh":"他们为新员工建立了无纸化工作流程。"}]}],"synonyms":["digital","paper-free","electronic"],"phonetic":"/ˈpeɪpərləs/","extraExplanation":["“paperless”常与办公与生活服务场景搭配：paperless office（无纸化办公室）、paperless billing/statements（无纸化账单/对账单）、paperless transactions（无纸化交易）。通常带有“更环保、更高效”的语气，但也可能涉及隐私与数据安全（例如需要密码、双重验证）。"]}
{"word":"paperlike","summary":{"en":"Paperlike means “similar to paper,” either in texture/thinness or (informally) in a stiff, overly formal writing style.","zh":"paperlike 表示“像纸一样的”，可指材质/质感像纸，也可（非正式）指语言风格过于书面、刻板。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the look, texture, or thinness of paper; similar to paper.","zh":"像纸一样的；具有纸的外观、质感或薄度的。"},"examples":[{"en":"The leaves are paperlike and tear easily in dry weather.","zh":"这些叶子薄得像纸一样，在干燥天气里很容易撕破。"},{"en":"The packaging felt paperlike, not plastic.","zh":"这个包装摸起来像纸，不像塑料。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of writing or a style) overly formal, stiff, or as if copied from a document.","zh":"（指写作或表达风格）过于正式、刻板，像照着文件写的。"},"examples":[{"en":"His speech sounded a bit paperlike, so the audience didn’t feel a connection.","zh":"他的演讲听起来有点“文件腔”，所以观众不太有共鸣。"},{"en":"Try to make your essay less paperlike by using clear, natural sentences.","zh":"尽量用清晰自然的句子，让你的作文不要那么“论文腔/公文腔”。"}]}],"synonyms":["papery","paper-thin","sheetlike","document-like","stilted"],"phonetic":"/ˈpeɪpərˌlaɪk/","extraExplanation":["“paperlike”= paper + -like。后缀“-like”表示“像……一样/具有……特征”（如 childlike 像孩子的，lifelike 逼真的）。","“paperlike”既可描述真实的材质（薄、脆、可撕），也可在口语里形容表达方式“太像书面文件”，带一点轻微的批评意味。"]}
{"word":"papermaker","summary":{"en":"A papermaker is someone who makes paper, either by hand or in a factory.","zh":"papermaker 指制造纸张的人，可为手工造纸者或工厂造纸工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is making paper, especially in a paper mill or traditional workshop.","zh":"造纸工；造纸者（指以造纸为职业的人，常在造纸厂或传统作坊工作）。"},"examples":[{"en":"Her grandfather was a papermaker at the local mill for thirty years.","zh":"她的祖父在当地造纸厂当了三十年的造纸工。"},{"en":"In the museum, we watched a papermaker form a sheet by hand from pulp.","zh":"在博物馆里，我们观看了一位造纸匠用纸浆手工抄纸成形。"}]}],"synonyms":["paper manufacturer","paper maker"],"phonetic":"/ˈpeɪpərˌmeɪkər/","extraExplanation":["“Papermaker”由 paper（纸）+ maker（制造者）组成，属于常见的“名词+maker”构词方式（如 shoemaker 鞋匠、filmmaker 电影制作人）。","历史上“papermaker”也可指传统手工造纸者：把植物纤维打成纸浆（pulp），用抄网捞起成片，再压榨、晾干。现在更多是在工业化纸厂中完成，但手工纸在书画、装帧、艺术纸等领域仍很常见。"]}
{"word":"papermaking","summary":{"en":"Papermaking means the craft/process of making paper, or the paper-producing industry.","zh":"papermaking 指“造纸工艺/过程”，也可指“造纸业”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process or craft of making paper from plant fibers (such as wood pulp, cotton, or recycled paper).","zh":"造纸；造纸工艺（用木浆、棉纤维或回收纸等植物纤维制成纸张的过程或技艺）。"},"examples":[{"en":"Papermaking requires clean water, fiber, and careful drying.","zh":"造纸需要干净的水、纤维，以及仔细的干燥过程。"},{"en":"Traditional papermaking uses a screen to form a thin sheet of wet pulp.","zh":"传统造纸会用网筛把湿纸浆抄成一张薄薄的纸页。"}]},{"partOfSpeech":"n.","definition":{"en":"The industry or business of producing paper.","zh":"造纸业（生产纸张的产业或行业）。"},"examples":[{"en":"Papermaking is an important industry in some forest-rich regions.","zh":"在一些森林资源丰富的地区，造纸业是一项重要产业。"},{"en":"The company invested in cleaner technology for papermaking.","zh":"这家公司投资了更清洁的造纸技术。"}]}],"synonyms":["paper production","paper manufacturing","paper industry","pulping"],"phonetic":"/ˈpeɪpərˌmeɪkɪŋ/","extraExplanation":["“Papermaking”既可指“造纸这门手艺/过程”，也可指“造纸行业”。在学术或新闻语境中，若谈环保、产能、工厂，常指“造纸业”；若谈手工艺、材料与步骤，多指“造纸工艺”。","文化背景：纸在中国历史上影响深远，东汉蔡伦改进造纸术常被提及；造纸技术后来传播到中亚、阿拉伯世界与欧洲，对教育与出版发展有重要推动。"]}
{"word":"papermouth","summary":{"en":"Papermouth is a rare informal noun for someone who talks big but lacks real substance or action; it can also be used creatively to mean a “paper mouth.”","zh":"Papermouth 是较少见的非正式名词，指“嘴上很会说但缺乏实质或行动的人”；也可在文学表达中指“纸做的嘴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A person who talks a lot—often making promises or bold claims—but whose words have little real substance or follow-through.","zh":"（非正式，用法较少）指一个人很会说、爱夸口或做承诺，但言语缺乏实际内容或行动兑现。"},"examples":[{"en":"Don’t be a papermouth—if you say you’ll help, show up and do it.","zh":"别光会说（别当“papermouth”）——你说要帮忙，就要来做。"},{"en":"He sounded confident in the meeting, but later everyone realized he was a papermouth.","zh":"他在会议上讲得很自信，但后来大家发现他只是嘴上厉害。"}]},{"partOfSpeech":"n.","definition":{"en":"(literal/creative use) A mouth made of paper, or something described as paper-like and fragile in the mouth area (often used in poetry or imagery).","zh":"（字面/文学化用法）“纸做的嘴”，或形容嘴部像纸一样脆弱、单薄的意象（多见于诗歌或创造性表达）。"},"examples":[{"en":"In the poem, the puppet has a papermouth that can’t hold a secret.","zh":"在那首诗里，木偶有一张“纸嘴”，守不住秘密。"}]}],"synonyms":["all talk","big talker","windbag","braggart","blowhard"],"phonetic":"/ˈpeɪpərmaʊθ/","extraExplanation":["“papermouth”不是常见标准词，更像是由 paper + mouth 组合出来的口语/写作用词。理解时可以类比：paper tiger（纸老虎：外强中干）、paper thin（薄如纸：很脆弱）。因此它常带有“言语轻飘、缺乏分量或兑现”的语气。"]}
{"word":"papern","summary":{"en":"Paper most commonly means the material you write or print on; it can also mean a newspaper, a school/academic article, or the verb meaning to cover with wallpaper or to hide a problem.","zh":"paper 最常指“纸”；也可指“报纸”“论文/文章”，还可作动词表示“贴墙纸”或“掩盖问题”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin material made from wood pulp (or other fibers) used for writing, printing, wrapping, or making things.","zh":"纸：由木浆（或其他纤维）制成的薄材料，用于书写、印刷、包装或制作物品。"},"examples":[{"en":"Please write your name on the paper.","zh":"请把你的名字写在纸上。"},{"en":"He wrapped the gift in brown paper.","zh":"他用棕色纸把礼物包起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A newspaper (especially in everyday speech).","zh":"报纸（口语中常用）。"},"examples":[{"en":"I read the paper every morning.","zh":"我每天早上看报纸。"}]},{"partOfSpeech":"n.","definition":{"en":"An academic article or a piece of writing for school or work.","zh":"论文；（学校或工作中的）文章、报告。"},"examples":[{"en":"She is working on a research paper about climate change.","zh":"她正在写一篇关于气候变化的研究论文。"},{"en":"I have to finish my history paper tonight.","zh":"我今晚必须完成我的历史论文。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover a wall or surface with wallpaper.","zh":"贴墙纸；用壁纸覆盖（墙面或表面）。"},"examples":[{"en":"They decided to paper the living room in a light color.","zh":"他们决定用浅色墙纸贴客厅。"}]},{"partOfSpeech":"vt.","definition":{"en":"To provide official documents (such as passports or permits), or to cover something with documents in order to hide problems (often used critically).","zh":"提供（证件、许可等）文件；（常带批评）用文件/手续掩盖问题。"},"examples":[{"en":"The company tried to paper over the mistake with a quick apology.","zh":"公司试图用一句快速的道歉来掩盖错误。"}]}],"synonyms":["sheet","newspaper","article","document"],"phonetic":"/ˈpeɪpɚ/","extraExplanation":["你输入的“papern”很可能是把“paper”后面的词性标记“n.”（名词）一起打进去了。在词典里常写作“paper (n.)”。","常见搭配：a piece/sheet of paper（一张纸），paperwork（文书工作），paper towel（厨房纸巾），to paper over（掩盖问题，语气偏负面）。"]}
{"word":"papers","summary":{"en":"“Papers” most commonly means official documents/ID, newspapers, academic papers, or sheets of paper.","zh":"“papers”常指证件/官方文件、报纸、论文，或若干张纸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Documents, especially official ones (such as identification, permits, or certificates).","zh":"文件；证件（尤指官方文件，如身份证明、许可、证书等）"},"examples":[{"en":"The officer asked to see my papers.","zh":"警官要求查看我的证件。"},{"en":"Keep your travel papers in a safe place.","zh":"把旅行证件放在安全的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"Newspapers (often used in the plural).","zh":"报纸（常用复数）"},"examples":[{"en":"I read the papers every morning.","zh":"我每天早上看报纸。"},{"en":"The story was all over the papers.","zh":"这条新闻登上了各大报纸。"}]},{"partOfSpeech":"n.","definition":{"en":"Academic writing or research articles, often written for school or publication.","zh":"论文；学术文章（用于学习或发表）"},"examples":[{"en":"She’s writing two papers this semester.","zh":"她这学期要写两篇论文。"},{"en":"The conference accepted his paper on climate policy.","zh":"会议接收了他关于气候政策的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"Pieces or sheets of paper used for writing, printing, or wrapping.","zh":"纸张（若干张；用于书写、打印或包装）"},"examples":[{"en":"There are papers all over the desk.","zh":"桌上到处都是纸。"},{"en":"Please hand out the papers to everyone.","zh":"请把这些纸发给大家。"}]}],"synonyms":["documents","ID","credentials","newspapers","press","articles","research papers","sheets"],"phonetic":"/ˈpeɪpərz/","extraExplanation":["“Papers, please.” 是英语里很常见的固定说法，多出现在边检、警察盘查等场景，意思是“请出示证件/文件”。","在英美校园语境里，paper 常指“课程论文/研究论文”；在媒体语境里，the papers 常指“报纸（作为整体媒体）”。"]}
{"word":"papershell","summary":{"en":"A papershell is a thin casing made of paper, especially a paper casing for fireworks or light packaging.","zh":"papershell 指纸制外壳/纸壳，常见于烟花的纸质外壳或轻量包装外套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin outer covering or casing made of paper (or papier-mâché), used to hold, protect, or shape something.","zh":"纸制外壳；纸壳（用纸或纸浆做成的薄外层，用来装、保护或定型某物）。"},"examples":[{"en":"The small gift came in a papershell that looked like a tiny egg.","zh":"这个小礼物装在一个像小蛋一样的纸壳里。"},{"en":"Some decorations use a papershell to keep the shape light and easy to hang.","zh":"有些装饰品用纸壳来保持造型，既轻便又容易悬挂。"}]},{"partOfSpeech":"n.","definition":{"en":"A paper casing used for certain fireworks (the paper tube or container that holds the charge).","zh":"（烟花）纸壳；纸筒外壳（装火药或效果药剂的纸制容器）。"},"examples":[{"en":"The fireworks maker packed the powder into a tight papershell.","zh":"烟花师把火药装进一个紧实的纸壳里。"},{"en":"Wet weather can ruin a papershell and cause the firework to fail.","zh":"潮湿天气会弄坏烟花的纸壳，导致烟花无法正常燃放。"}]}],"synonyms":["paper shell","paper casing","paper wrapper","paper covering"],"phonetic":"/ˈpeɪpərˌʃɛl/","extraExplanation":["“papershell”不是日常高频词，更常见的写法是分开写作“paper shell”。在烟花语境里，它指用纸做的外壳/筒身（相对金属外壳更轻、更便宜）。","在较旧的工艺或历史文本中，也可能见到“paper shell”指某些容器、包装或（少见）弹药/爆炸物的纸质外套；理解时主要抓住“纸做的外壳/套子”这个核心含义即可。"]}
{"word":"paperweight","summary":{"en":"A paperweight is a heavy object that holds papers down; it can also mean something useless that just sits there.","zh":"paperweight 指用来压住纸张的镇纸；也可幽默地指“没用的东西/摆设”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small heavy object used to hold papers down so they don’t blow or move around.","zh":"（压纸用的）镇纸；纸镇，用来压住纸张防止被风吹起或滑动。"},"examples":[{"en":"She put a glass paperweight on the contract so it wouldn’t curl up.","zh":"她把一个玻璃镇纸放在合同上，防止纸张卷起来。"},{"en":"The paperweight kept my notes from blowing off the desk.","zh":"镇纸防止我的笔记从桌上被风吹走。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that looks useful but is actually not useful, so it just sits around like a paperweight (often used humorously).","zh":"（幽默/比喻）看似有用却没用的东西；只能当摆设、当“镇纸”的东西。"},"examples":[{"en":"Without the right software, this device is just an expensive paperweight.","zh":"没有合适的软件，这个设备就是个昂贵的摆设。"},{"en":"My old phone is basically a paperweight now.","zh":"我那部旧手机现在基本就是个摆设了。"}]}],"synonyms":["desk weight","paper holder","ornament (figurative)","dead weight (figurative)"],"phonetic":"/ˈpeɪpərˌweɪt/","extraExplanation":["“paperweight”既可以指真实的办公用品，也常用作比喻，尤其在科技语境里：某个设备/工具一旦不能正常工作，就被戏称为“a paperweight”。这种说法带点自嘲或吐槽意味。","常见搭配：glass/crystal paperweight（玻璃/水晶镇纸），desk paperweight（桌面镇纸），use something as a paperweight（把某物当镇纸用）。"]}
{"word":"paperweights","summary":{"en":"Paperweights are heavy objects that keep papers from moving; they can also be decorative collectibles.","zh":"paperweights 指镇纸，用来压住纸张；也可指装饰性或收藏性的镇纸摆件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Heavy objects used to hold papers in place on a desk so they don’t blow or slide away.","zh":"（压纸用的）镇纸；用来压住纸张、防止被风吹走或滑动的重物。"},"examples":[{"en":"She put a paperweight on the contract so the pages wouldn’t curl.","zh":"她把镇纸放在合同上，防止纸张卷起来。"},{"en":"The office keeps paperweights near the window because it gets windy.","zh":"办公室在窗边放着镇纸，因为那里风比较大。"},{"en":"He collects glass paperweights as souvenirs from different cities.","zh":"他收集玻璃镇纸，当作不同城市的纪念品。"}]},{"partOfSpeech":"n.","definition":{"en":"Objects kept mainly for decoration or collecting, even if they are not used to hold paper anymore.","zh":"（延伸义）主要用于装饰或收藏的物件，即使不再用来压纸。"},"examples":[{"en":"Those “paperweights” are really just decorations on her bookshelf.","zh":"那些“镇纸”其实只是她书架上的装饰品。"},{"en":"The museum shop sells handmade paperweights with flowers inside.","zh":"博物馆商店卖手工镇纸，里面封着花朵。"}]}],"synonyms":["paperweight","desk weight","desk ornament"],"phonetic":"/ˈpeɪpərˌweɪts/","extraExplanation":["“paperweights”是复数形式；单数是“paperweight”。日常交流里也常把它们当作礼品或纪念品来讲，尤其是玻璃镇纸（glass paperweight）在欧美较常见。","在现代办公中，电子化让镇纸的“实用性”减少了，但在有窗风、纸张较多或重视桌面摆设的场景里仍会使用。"]}
{"word":"paperwork","summary":{"en":"Paperwork means the documents and forms you must handle for official or work purposes, often seen as tedious administrative work.","zh":"Paperwork 指工作或办事过程中需要处理的文件和表格（文书工作），常暗示手续繁琐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Documents and forms that must be completed or processed as part of a job, legal matter, or official procedure.","zh":"（工作、法律或官方流程中）需要填写、提交或处理的文件和表格；文书工作。"},"examples":[{"en":"I spent the afternoon doing paperwork for the new hire.","zh":"我整个下午都在处理新员工的入职文件。"},{"en":"There’s a lot of paperwork when you buy a house.","zh":"买房时要办很多手续和文件。"},{"en":"Please bring the paperwork to the front desk.","zh":"请把相关文件带到前台。"}]}],"synonyms":["documents","forms","administrative work","documentation"],"phonetic":"/ˈpeɪpərˌwɝːk/","extraExplanation":["“Paperwork”通常是不可数名词（uncountable），表示“文书工作/一堆文件”，一般不说“a paperwork”。如果要强调“几份文件/材料”，更常说 “documents / forms / paperwork documents”。","日常语境里它常带有“繁琐、耗时的手续”的感觉：例如 “too much paperwork”（文书工作太多）常用于抱怨行政流程。"]}
{"word":"paperworker","summary":{"en":"“Paperworker” usually means someone who mainly handles paperwork; it can also mean a person who works with paper products, but that sense is less common.","zh":"“paperworker”通常指主要处理文书/文件工作的人；也可指与造纸或纸制品相关的工人，但这种用法较少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job mainly involves paperwork (forms, documents, administrative tasks).","zh":"主要做文书工作的人（处理表格、文件、行政事务等）。"},"examples":[{"en":"As a paperworker in the clinic, she spends most of her day processing patient forms.","zh":"作为诊所的文书人员，她一天大部分时间都在处理病人的表格。"},{"en":"He moved from fieldwork to being a paperworker, doing reports and approvals.","zh":"他从外勤转为文书工作，主要做报告和审批。"}]},{"partOfSpeech":"n.","definition":{"en":"A worker involved in making or handling paper products (less common).","zh":"从事造纸或处理纸制品的工人（较少见）。"},"examples":[{"en":"In the early days, paperworkers often learned the craft through apprenticeships.","zh":"在早期，造纸工人常通过学徒制学习这门手艺。"}]}],"synonyms":["office worker","clerk","administrator","caseworker","paper pusher (informal)","bureaucrat (sometimes negative)"],"phonetic":"/ˈpeɪpərˌwɝːkɚ/","extraExplanation":["“paperworker”并不是非常常见的标准用词。日常英语里更常说 office worker（办公室职员）、administrator（行政人员）、clerk（文员）、caseworker（个案社工/个案专员）等，具体取决于工作内容。","如果你想表达“文书工作/纸面工作”本身，常用的是 “paperwork”（不可数名词），例如：I have a lot of paperwork to do.（我有很多文书工作要做。）"]}
{"word":"papery","summary":{"en":"“Papery” describes something that is thin, dry, and paper-like in texture, or something made of/looking like paper.","zh":"“Papery”用来形容“像纸一样薄、干、脆的触感”，也可指“纸做的或看起来像纸的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thin, dry, and like paper in texture (often describing skin, leaves, or packaging).","zh":"纸一样的；薄而干、摸起来像纸（常形容皮肤、叶子或包装）。"},"examples":[{"en":"The old book had papery pages that tore easily.","zh":"那本旧书的纸张很“纸脆”，很容易撕破。"},{"en":"In winter my hands get dry and papery.","zh":"冬天我的手会变得干燥、薄薄的像纸一样。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of paper or resembling paper in appearance.","zh":"纸制的；外观像纸的。"},"examples":[{"en":"The candy came in a papery wrapper.","zh":"糖果用一层纸质的包装纸包着。"},{"en":"They decorated the room with papery lanterns.","zh":"他们用纸质灯笼装饰了房间。"}]}],"synonyms":["paper-like","thin","dry","brittle","parchmenty"],"phonetic":"/ˈpeɪpəri/"}
{"word":"papess","summary":{"en":"Papess means a female pope (usually in legend) or the tarot card more commonly called The High Priestess.","zh":"Papess 指“女教皇”（多见于传说）或塔罗牌中更常称为“女祭司（The High Priestess）”的那张牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female pope; historically, this is mainly used for the legendary figure “Pope Joan,” and is not an official title in the Catholic Church.","zh":"女教皇；历史上多用于传说人物“女教皇琼（Pope Joan）”，并非天主教会的正式头衔。"},"examples":[{"en":"The novel retells the legend of a papess who secretly became pope.","zh":"这部小说重述了一位女教皇秘密成为教宗的传说。"},{"en":"Some medieval stories mentioned a papess, but historians generally treat it as a legend.","zh":"一些中世纪故事提到过女教皇，但历史学家普遍认为那是传说。"}]},{"partOfSpeech":"n.","definition":{"en":"In tarot, “The Papess” (more commonly “The High Priestess”) is a major card symbolizing intuition, inner knowledge, and mystery.","zh":"在塔罗牌中，“The Papess”（更常见称“女祭司／The High Priestess”）是一张大阿卡那牌，象征直觉、内在智慧与神秘。"},"examples":[{"en":"She drew the Papess/High Priestess card and interpreted it as a sign to trust her intuition.","zh":"她抽到了“女祭司／Papess”牌，并把它解读为要相信自己的直觉。"},{"en":"In some older decks, the card is called the Papess instead of the High Priestess.","zh":"在一些较旧的牌组里，这张牌叫 Papess，而不是 High Priestess。"}]}],"synonyms":["female pope","(tarot) The High Priestess"],"phonetic":"/ˈpeɪpəs/","extraExplanation":["“papess”由“pope（教宗）”类比构成的女性形式（-ess 常见于表示女性身份，如 actress）。但在现代英语中，这个词很少用于现实宗教职位，更多见于文学、传说或历史讨论。","“女教皇琼（Pope Joan）”是欧洲中世纪广为流传的故事：一位女性乔装成男性进入教会体系并当上教宗。主流历史研究普遍认为缺乏可靠证据，因此常被当作传说或寓言。","塔罗语境里，“Papess”反映了早期欧洲牌组受宗教符号影响的命名习惯；现代更常用“High Priestess”以避免直接指涉教会职位。"]}
{"word":"papeterie","summary":{"en":"Papeterie usually means a French-style stationery shop, and sometimes (less commonly in English) stationery/paper goods.","zh":"Papeterie 通常指带法式风格的文具店；在英语中较少也可指文具/纸制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) A stationery shop; a store that sells paper goods such as notebooks, cards, and writing supplies.","zh":"（源自法语）文具店；销售纸制品与书写用品（如笔记本、贺卡、信纸等）的商店。"},"examples":[{"en":"We stopped at a small papeterie to buy postcards and a nice pen.","zh":"我们在一家小文具店停下来买明信片和一支好看的笔。"},{"en":"This papeterie specializes in handmade paper and wedding invitations.","zh":"这家文具店专营手工纸和婚礼请柬。"}]},{"partOfSpeech":"n.","definition":{"en":"Stationery or paper goods (used less commonly in English; more common in French contexts).","zh":"文具；纸制品（英语中较少这样用，更常见于法语语境）。"},"examples":[{"en":"The boutique offers luxury papeterie, including embossed letter sets.","zh":"这家精品店提供高端文具，包括压纹信纸套装。"}]}],"synonyms":["stationery store","stationery shop","paper goods store","stationery"],"phonetic":"/ˌpæpəˈtɛri/","extraExplanation":["“papeterie”是法语词，来自“papier（纸）”。在英语里多出现在旅行、时尚或精品店语境中，用来营造法式氛围；日常英语更常说“stationery store / stationery shop”。","在法语中，“papeterie”既可指“文具店”，也可指“文具/纸品”这一类商品；英语借用后主要保留“文具店”这一含义。"]}
{"word":"papey","summary":{"en":"“Papey” is uncommon; people usually mean “papery,” meaning paper-like (thin, dry, or crisp).","zh":"“papey”很少见；通常是指“papery”，意思是“像纸一样的（薄、干、脆）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Like paper in texture or appearance; a misspelling or informal shortening of “papery.”","zh":"（不常见）像纸一样的；常见于把“papery”（纸质的、像纸的）拼错或口语缩写。"},"examples":[{"en":"The old leaves felt papery and dry.","zh":"老叶子摸起来像纸一样又干又薄。"},{"en":"I think you meant “papery,” not “papey.”","zh":"我觉得你想写的是“papery”，不是“papey”。"}]}],"synonyms":["papery","paper-like","thin","dry","crisp"],"phonetic":"/ˈpeɪpɚi/","extraExplanation":["“papey”在标准英语里非常少见，通常会被视为拼写错误。更常用的是：\n- papery（形容词）：纸质的；薄而干、像纸一样容易碎\n- paper（名词/动词）：纸；用纸覆盖等\n如果你是在小说、歌词或方言文本里见到“papey”，也可能是作者刻意用来表现口音或口语感。"]}
{"word":"paphian","summary":{"en":"Paphian means “from Paphos (Cyprus),” and in literature often “associated with Aphrodite (Venus).”","zh":"Paphian 指“与塞浦路斯帕福斯有关的”，文学中常引申为“与爱神阿佛洛狄忒（维纳斯）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Paphos (ancient Paphus), a city in Cyprus; often used in literature to mean “of Aphrodite (Venus),” because Paphos was a major center of her worship.","zh":"与塞浦路斯的帕福斯（古称帕福斯/帕弗斯）有关的；在文学中常用来指“与爱神阿佛洛狄忒（罗马神话中的维纳斯）有关的”，因为帕福斯曾是她的重要崇拜中心。"},"examples":[{"en":"In some poems, “Paphian” is another way to describe Aphrodite, the goddess of love.","zh":"在一些诗歌里，“Paphian”是形容爱神阿佛洛狄忒的一种说法。"},{"en":"The novel uses Paphian imagery—doves, roses, and the sea—to suggest romance.","zh":"这部小说用“帕福斯式”的意象——鸽子、玫瑰与海——来暗示爱情。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Paphos (less common).","zh":"帕福斯人（较少见）。"},"examples":[{"en":"A few Paphian merchants are mentioned in the historical record.","zh":"史料中提到过少数帕福斯商人。"}]}],"synonyms":["Paphos (attributive)","Cypriot (broader)","Aphrodisian (contextual)"],"phonetic":"/ˈpeɪfiən/","extraExplanation":["“Paphian”常见于较文学化或古典风格的英语中，尤其在诗歌里用来含蓄指代爱神阿佛洛狄忒（Aphrodite）或与爱情、魅力相关的意象。","帕福斯（Paphos）在古代与阿佛洛狄忒的神话联系紧密，因此“Paphian”有时带有“爱情之地/爱神之地”的联想色彩。"]}
{"word":"paphians","summary":{"en":"“Paphians” means the people of ancient Paphos (Cyprus), and in literature it can refer to worshippers linked to Aphrodite’s shrine there.","zh":"“Paphians”指（古代）塞浦路斯帕福斯的人；在文学中也可诗意地指与当地阿佛洛狄忒神庙相关的信众。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from Paphos (Paphos/Paphus), an ancient city in Cyprus; inhabitants of Paphos.","zh":"来自（古代）塞浦路斯帕福斯（Paphos/Paphus）的人；帕福斯居民。"},"examples":[{"en":"In the old texts, the Paphians were known for their devotion to Aphrodite.","zh":"在古代文献中，Paphians（帕福斯人）以崇拜阿佛洛狄忒而闻名。"},{"en":"Archaeologists study what Paphians ate and traded in the ancient Mediterranean.","zh":"考古学家研究古代地中海地区的帕福斯人吃什么、做什么贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/poetic) People associated with Aphrodite’s cult at Paphos; sometimes used as a poetic label for the goddess’s worshippers.","zh":"（文学/诗歌用法）与帕福斯的阿佛洛狄忒崇拜相关的人；有时诗意地指这位女神的崇拜者。"},"examples":[{"en":"Poets sometimes mention “Paphians” when writing about Aphrodite and love.","zh":"诗人写到阿佛洛狄忒与爱情时，有时会提到“Paphians”。"},{"en":"The hymn calls on the Paphians to honor the goddess at her sacred shrine.","zh":"赞歌呼唤帕福斯的信众在神圣的神庙敬奉女神。"}]}],"synonyms":["Paphos residents","people of Paphos","Paphian people","worshippers of Aphrodite (literary)"],"phonetic":"/ˈpeɪfiənz/","extraExplanation":["“Paphian”来自Paphos（古称Paphus），那里有著名的阿佛洛狄忒（Aphrodite）圣地，因此在英语诗歌或古典题材中，“Paphian”/“Paphians”常带有“与阿佛洛狄忒、爱情崇拜有关”的联想。","用法提示：现代日常英语里更常说“people from Paphos”或“Paphos residents”；“Paphians”更偏古典/文学语境。"]}
{"word":"paphiopedilum","summary":{"en":"Paphiopedilum: a genus of “lady’s slipper” orchids with a pouch-shaped flower, often grown as ornamentals.","zh":"Paphiopedilum：兜兰属（拖鞋兰/女鞋兰），花朵有兜状“鞋”形结构，常作观赏栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of orchids known as “lady’s slipper orchids,” recognized by a pouch-shaped lip (like a slipper) and often grown as ornamental houseplants.","zh":"兜兰属（又称“拖鞋兰/女鞋兰”），一种兰科植物属，其花朵唇瓣呈兜状（像拖鞋），常作为观赏植物栽培。"},"examples":[{"en":"Paphiopedilum orchids are popular because their flowers look like tiny slippers.","zh":"兜兰很受欢迎，因为它的花看起来像小小的拖鞋。"},{"en":"She grows a Paphiopedilum on a bright windowsill, keeping it out of direct sun.","zh":"她把一盆兜兰养在明亮的窗边，避免阳光直射。"},{"en":"Many Paphiopedilum species are protected, so buy only from reputable growers.","zh":"许多兜兰物种受保护，所以要从可信赖的种植者那里购买。"}]}],"synonyms":["lady’s slipper orchid","slipper orchid","paph (informal)"],"phonetic":"/ˌpæf.i.oʊˈpiː.də.ləm/","extraExplanation":["“Paphiopedilum”来自希腊语：Paphos（帕福斯，传说与爱神阿佛洛狄忒有关的地名）+ pedilon（凉鞋/拖鞋），因此常见英文名是“lady’s slipper orchid”（女鞋兰/拖鞋兰）。","在园艺语境中，人们常简称为“paph”（口语缩写），例如：a paph in bloom（开花的一盆兜兰）。","这类兰花常见于东南亚到中国南部一带的林下环境，许多野生种因栖息地破坏与盗采而受保护；购买时注意合法来源。"]}
{"word":"papiamento","summary":{"en":"Papiamento is a creole language spoken mainly in Aruba, Bonaire, and Curaçao.","zh":"Papiamento（帕皮阿门托语）是一种主要在阿鲁巴、博奈尔和库拉索使用的克里奥尔语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Portuguese- and Spanish-based creole language spoken mainly in Aruba, Bonaire, and Curaçao (the ABC islands in the Caribbean).","zh":"帕皮阿门托语：一种以葡萄牙语和西班牙语为基础的克里奥尔语，主要在加勒比海的阿鲁巴、博奈尔和库拉索（ABC群岛）使用。"},"examples":[{"en":"Many people in Curaçao speak Papiamento at home and Dutch at school or work.","zh":"库拉索的许多人在家说帕皮阿门托语，在学校或工作场合说荷兰语。"},{"en":"The museum offers audio guides in English, Dutch, and Papiamento.","zh":"博物馆提供英语、荷兰语和帕皮阿门托语的语音导览。"},{"en":"She is learning basic Papiamento phrases before traveling to Aruba.","zh":"她在去阿鲁巴旅行前正在学习一些基础的帕皮阿门托语短语。"}]}],"synonyms":["Papiamentu"],"phonetic":"/ˌpɑːpiəˈmɛntoʊ/","extraExplanation":["“Papiamento”也常见拼写为“Papiamentu”，两者通常指同一种语言；在不同岛屿或出版物中会偏好不同拼写。","词名与葡语/西语中表示“说话、闲聊”的词根有关（例如葡语 *papear*），体现了其作为多语言接触环境中形成的语言。","帕皮阿门托语在当地文化中非常重要，常用于日常交流、音乐与媒体；同时当地也普遍使用荷兰语、英语和西班牙语，呈现多语社会的特点。"]}
{"word":"papicolar","summary":{"en":"“Papicolar” isn’t a standard word; it’s most likely a misspelling of “particular,” meaning “specific” or “picky/careful about details.”","zh":"“papicolar” 不是标准单词；多半是把 “particular” 拼错了，意思是“特定的/具体的”或“挑剔的/讲究的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“papicolar” is not a standard English word. It is most likely a misspelling of “particular.”","zh":"“papicolar” 不是标准英语单词，最可能是把 “particular” 拼错了。"},"examples":[{"en":"I think you meant “particular,” not “papicolar.”","zh":"我觉得你想写的是 “particular”，而不是 “papicolar”。"},{"en":"She is very particular about the details. (NOT: papicolar)","zh":"她对细节非常讲究。（不要写：papicolar）"}]},{"partOfSpeech":"adj.","definition":{"en":"Particular: specific; one exact person, thing, or detail (not general).","zh":"Particular：特定的；具体的；指某一个明确的人、事或细节（不是泛指）。"},"examples":[{"en":"Is there a particular reason you’re late?","zh":"你迟到有什么特别的原因吗？"},{"en":"I’m looking for a particular book—the one with a blue cover.","zh":"我在找一本特定的书——那本蓝色封面的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Particular: very careful or picky about quality or details; hard to please.","zh":"Particular：很挑剔的；对质量或细节很讲究的；不容易满意的。"},"examples":[{"en":"He’s particular about how his coffee is made.","zh":"他对咖啡怎么做很讲究。"},{"en":"Our teacher is particular with grammar.","zh":"我们老师对语法要求很严格。"}]}],"synonyms":["specific","certain","distinct","picky","fussy","selective"],"phonetic":"/pərˈtɪkjələr/","extraExplanation":["“papicolar” 常见于打字或听写导致的拼写错误。英语里 /pərˈtɪkjələr/ 的发音在快速语流中会让人误以为中间有别的字母组合。正确拼写是 particular（有 -ticu- 这一段）。","如果你原本想表达“受欢迎的 / 大众的”，那对应的词通常是 popular；如果想表达“尤其、特别地”，常用 especially 或 particularly。你也可以告诉我你要表达的中文意思，我可以帮你选最合适的英文词。"]}
{"word":"papicolist","summary":{"en":"“Papicolist” is not recognized as a standard English word; its meaning likely depends on context (often a misspelling or proper name).","zh":"“Papicolist”不是标准英语词；含义多取决于上下文（常见为拼写错误或专有名词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a username/proper name, or a very niche term. Meaning depends on the context where you saw it.","zh":"不是标准英语单词；很可能是拼写错误、用户名/专有名词，或非常小众的术语。具体含义需要结合你看到它的上下文。"},"examples":[{"en":"I couldn’t find “papicolist” in a dictionary—can you share the sentence you saw it in?","zh":"我在词典里找不到“papicolist”——你能把它出现的句子发我吗？"},{"en":"“Papicolist” might be a misspelling; check if it was meant to be a different word.","zh":"“Papicolist”可能是拼写错误；可以确认一下是不是想写另一个词。"}]}],"phonetic":"/ˌpæpɪˈkoʊlɪst/","extraExplanation":["从拼写来看，它可能被误写成了某个更常见的词。你可以检查是否想表达：\n1) papalist / papist（与罗马教皇或天主教相关的立场/人，带历史语境，使用需谨慎）；\n2) “-logist”结尾的职业词（如 biologist 生物学家）——但 papicolist 并不常见；\n3) 专有名词（人名、网名、项目名）。\n如果你把原句或来源（文章/游戏/社交媒体）发来，我可以帮你更准确判断。"]}
{"word":"papier","summary":{"en":"Papier is a French-derived word meaning “paper,” used in English mostly in phrases like papier-mâché.","zh":"Papier源自法语，意为“纸”，在英语中多见于如papier-mâché等固定搭配。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) paper; used in English mainly in set phrases like “papier-mâché.”","zh":"（源自法语）纸；在英语中主要出现在固定搭配中，如“papier-mâché（纸浆塑形/纸糊工艺）”。"},"examples":[{"en":"The mask was made from papier-mâché and painted by hand.","zh":"这个面具是用纸浆塑形（papier-mâché）做的，并且手工上色。"},{"en":"She learned how to build papier-mâché sculptures in art class.","zh":"她在美术课上学会了做纸浆塑形（papier-mâché）雕塑。"}]}],"synonyms":["paper (in meaning)","papier-mâché (common phrase)"],"phonetic":"/ˌpæpiˈeɪ/","extraExplanation":["“papier”在英语里通常不是一个单独常用词，而是保留法语形式出现在复合词/短语中，最常见的是“papier-mâché”，字面意思是“嚼碎/捣烂的纸”，指把纸和胶水（或浆糊）混合成可塑材料，用来做面具、道具、装饰等。","发音上，英语里常把重音落在第二音节，听起来接近“pap-ee-AY”。"]}
{"word":"papilio","summary":{"en":"Papilio is the scientific genus name for many swallowtail butterflies.","zh":"Papilio 是许多燕尾蝶（凤蝶）的学名属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large, colorful swallowtail butterflies (family Papilionidae).","zh":"凤蝶属（凤蝶科）的一属大型、色彩鲜艳的燕尾蝶。"},"examples":[{"en":"The garden guide highlights Papilio species because they are easy to spot by their long “tails.”","zh":"这本花园指南特别介绍了凤蝶属（Papilio）的物种，因为它们有明显的“尾突”，很容易辨认。"},{"en":"In many field guides, Papilio is listed as a common genus of swallowtail butterflies.","zh":"在许多野外图鉴中，Papilio 常被列为常见的燕尾蝶属。"}]}],"synonyms":["swallowtail (context)","butterfly (general)"],"phonetic":"/pəˈpɪlioʊ/","extraExplanation":["Papilio 是拉丁语“蝴蝶”的意思，也被用作生物分类学中的属名（例如 *Papilio machaon*，常见名为“欧凤蝶/大凤蝶”一类）。在英文里它通常作为学名出现，写作时常用斜体，首字母大写。"]}
{"word":"papilionaceae","summary":{"en":"Papilionaceae is an older botanical name for the pea/bean-type legumes, now usually treated as Papilionoideae within the Fabaceae family.","zh":"Papilionaceae 是一个较旧的植物分类名称，指豌豆/豆类这类蝶形花类群；现代多把它作为豆科（Fabaceae）中的蝶形花亚科 Papilionoideae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) An older/less common name for the pea-and-bean group of flowering plants; roughly the butterfly-shaped-flower subfamily of the legume family (Fabaceae), now usually called Papilionoideae.","zh":"（植物）一种较旧/较少用的名称，指豌豆、豆类等这一类开花植物；大致相当于豆科（Fabaceae）中“蝶形花亚科”，现代多称 Papilionoideae。"},"examples":[{"en":"Peas and beans are commonly placed in the legume family, Fabaceae, which older books may call Papilionaceae.","zh":"豌豆和豆类通常归入豆科（Fabaceae），而旧一些的书可能称其为 Papilionaceae。"},{"en":"The plant has a typical papilionaceous (butterfly-like) flower, a feature often linked with Papilionaceae/Papilionoideae.","zh":"这种植物有典型的蝶形花（像蝴蝶一样的花形），这一特征常与 Papilionaceae / Papilionoideae 相关。"}]}],"synonyms":["Fabaceae (broader modern family name)","Papilionoideae (modern subfamily name)","legume family (common name)"],"phonetic":"/pəˌpɪlioʊˈneɪsiˌi/","extraExplanation":["“Papilionaceae”来自拉丁语 papilio（蝴蝶），因为这一类植物常见的“蝶形花”看起来像蝴蝶。","在现代分类中，多数植物学资料把它并入豆科（Fabaceae），并使用“Papilionoideae（蝶形花亚科）”而不是把它当作独立的“科”。因此你在新版教材、植物百科或学术论文中更常见到的是 Papilionoideae/Fabaceae。","相关形容词：papilionaceous（蝶形花的、蝶形的），常用来描述这类花冠结构。"]}
{"word":"papilionaceous","summary":{"en":"Papilionaceous describes a butterfly-like, pea-family type of flower shape.","zh":"papilionaceous 指“蝶形的”，尤指豆科植物典型的蝶形花结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a butterfly-like shape; especially describing the typical pea-family (bean-family) flower with one large upper petal and two side petals.","zh":"蝴蝶状的；尤指豆科（豌豆/豆类）典型花形：上方一大片“旗瓣”，两侧“翼瓣”，下方常有合成的“龙骨瓣”。"},"examples":[{"en":"Pea plants have papilionaceous flowers with a distinct banner and wings.","zh":"豌豆的花是典型的蝶形花，有明显的旗瓣和翼瓣。"},{"en":"Many legumes are recognized by their papilionaceous blossoms.","zh":"许多豆科植物可以通过它们的蝶形花来辨认。"}]}],"synonyms":["butterfly-shaped","pea-flowered"],"phonetic":"/ˌpæpəˌlajəˈneɪʃəs/","extraExplanation":["这个词常见于植物学描述（field guide、学术文章）。它来自拉丁语 papilio（“蝴蝶”），所以核心联想就是“像蝴蝶一样的形状”。","在英语里常与 legume（豆科植物/豆类）、pea family（豆科）、blossom/flower（花）搭配使用。相关词：papilionaceous corolla（蝶形花冠）。"]}
{"word":"papiliones","summary":{"en":"Papiliones is a Latin/scientific plural meaning “butterflies,” mostly found in older or formal biological contexts.","zh":"Papiliones 是拉丁语/科学用语的复数，意思是“蝴蝶”，多见于较早或较正式的生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scientific/Latin, plural) butterflies; used in older or formal biological classification to refer to butterflies as a group.","zh":"（科学/拉丁语复数）蝴蝶；在较早或较正式的生物分类语境中，用来泛指“蝴蝶”这一类群。"},"examples":[{"en":"In some older texts, Papiliones are contrasted with moths (Noctuae).","zh":"在一些较早的文献中，Papiliones 常与蛾类（Noctuae）作对比。"},{"en":"The museum label lists the specimen under Papiliones (butterflies).","zh":"博物馆标签把这件标本归在 Papiliones（蝴蝶）之下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the plural form of the Latin word papilio (“butterfly”).","zh":"（罕见）拉丁语 papilio（“蝴蝶”）的复数形式。"},"examples":[{"en":"The Latin passage uses papilio for one butterfly and papiliones for many.","zh":"这段拉丁文用 papilio 表示“一只蝴蝶”，用 papiliones 表示“多只蝴蝶”。"}]}],"synonyms":["butterflies","Lepidoptera (broader)","Papilionidae (more specific)"],"phonetic":"/pəˈpɪliˌoʊniːz/","extraExplanation":["“Papiliones”严格来说是拉丁语复数形式（单数 papilio）。在现代英语里更常直接用 butterflies；在生物分类学中，常见的是更具体的分类单位，如 Papilionidae（凤蝶科）。","如果你是在找英文单词拼写，最常用的是 butterfly / butterflies；“papiliones”多见于学术、拉丁文引语或旧式分类写法。"]}
{"word":"papilionid","summary":{"en":"A papilionid is a swallowtail-type butterfly (family Papilionidae) or something related to that family.","zh":"papilionid 指凤蝶科（Papilionidae）的蝴蝶（如燕尾蝶、鸟翼蝶），也可作形容词表示“与凤蝶科有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a butterfly of the family Papilionidae (the swallowtails and birdwings), often large and brightly colored.","zh":"凤蝶科（Papilionidae）的蝴蝶；常指“凤蝶/燕尾蝶/鸟翼蝶”等，通常体型较大、色彩鲜明。"},"examples":[{"en":"We saw a papilionid butterfly with long “tails” on its hind wings.","zh":"我们看到一只后翅带“尾突”的凤蝶科蝴蝶。"},{"en":"Papilionids are often used in biology lessons to talk about mimicry and warning colors.","zh":"凤蝶科常被用于生物课中讲解拟态和警戒色。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or belonging to the butterfly family Papilionidae.","zh":"与凤蝶科（Papilionidae）有关的；属于凤蝶科的。"},"examples":[{"en":"The museum has a papilionid collection from Southeast Asia.","zh":"博物馆有一批来自东南亚的凤蝶科标本收藏。"},{"en":"This paper describes papilionid wing patterns in different habitats.","zh":"这篇论文描述了不同栖息地中凤蝶科的翅纹。"}]}],"synonyms":["swallowtail","papilionid butterfly","Papilionidae (scientific family name)"],"phonetic":"/pəˈpɪliəˌnɪd/","extraExplanation":["词源：来自拉丁语 papilio（“蝴蝶”）+ 英语后缀 -id（“某类/某科的成员”），因此 papilionid 字面意思就是“凤蝶科的一员”。","常见相关名词：swallowtail（燕尾蝶/凤蝶的俗称之一），birdwing（鸟翼蝶，凤蝶科中体型很大的一类）。"]}
{"word":"papilionidae","summary":{"en":"Papilionidae is the scientific family name for swallowtail butterflies.","zh":"Papilionidae 是鳳蝶科的學名，包含鳳蝶（燕尾蝶）等蝴蝶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of butterflies that includes the swallowtails, often large and brightly colored species found worldwide.","zh":"鳳蝶科（蝴蝶的一科），包含常見的鳳蝶類；多為體型較大、色彩鮮明，分布於世界各地。"},"examples":[{"en":"The Papilionidae are famous for swallowtail butterflies with tail-like extensions on their hindwings.","zh":"鳳蝶科以鳳蝶類聞名，牠們的後翅常有像燕尾一樣的尾狀突起。"},{"en":"In the field guide, the butterfly was classified under Papilionidae.","zh":"在野外圖鑑中，這隻蝴蝶被歸類為鳳蝶科。"}]}],"synonyms":["swallowtail family"],"phonetic":"/ˌpæpɪˈlɪənɪˌdi/","extraExplanation":["「Papilionidae」是生物分類學用語，屬於「科」（family）階層；其下還會分成不同的「屬」（genus）與「種」（species）。","字根來自拉丁文 papilio（蝴蝶），因此 Papilionidae 字面上可理解為「蝴蝶（鳳蝶）的一科」。","日常英文中常用更口語的說法 swallowtail butterflies（鳳蝶／燕尾蝶）來指這一科中最知名的一群。"]}
{"word":"papilionides","summary":{"en":"Papilionides is an older taxonomic term for a group of butterflies, often referring to swallowtails and related butterflies.","zh":"Papilionides 是一种较旧的分类术语，指一类蝴蝶，常用来指凤蝶及其近缘类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A taxonomic name used in some (often older) entomology sources for a group of butterflies, especially the swallowtail butterflies and their relatives.","zh":"（多见于较旧的昆虫学资料）一种分类名称，指一类蝴蝶，常特指凤蝶及其近缘类群。"},"examples":[{"en":"In some 19th‑century texts, the Papilionides were treated as a major group of butterflies.","zh":"在一些19世纪的著作中，Papilionides 被视为蝴蝶的一个重要类群。"},{"en":"The author lists Papilionides alongside other butterfly groups when describing wing patterns.","zh":"作者在描述翅纹时，把 Papilionides 与其他蝴蝶类群并列列出。"}]}],"synonyms":["swallowtails","Papilionidae (related modern term)"],"phonetic":"/pəˌpɪliəˈnaɪdiːz/","extraExplanation":["Papilionides 来自拉丁语 papilio（“蝴蝶”）。在现代更常见、也更标准的用法里，你会看到 Papilionidae（凤蝶科，swallowtail butterflies）等更明确的分类名；Papilionides 往往出现在旧式分类体系或特定作者的分组方式中。使用时最好结合上下文确认它指的是“凤蝶类”还是更广义的“蝴蝶类”。"]}
{"word":"papilioninae","summary":{"en":"Papilioninae is the taxonomic subfamily of swallowtail butterflies within the family Papilionidae.","zh":"Papilioninae 指凤蝶科中的“凤蝶亚科”，属于凤蝶（swallowtails）的一类分类单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of swallowtail butterflies (family Papilionidae), including many large, colorful species found around the world","zh":"凤蝶科（Papilionidae）中的一个亚科（Papilioninae），包含许多体型较大、色彩鲜艳、分布广泛的凤蝶类群"},"examples":[{"en":"The Papilioninae include many of the swallowtails commonly seen in gardens and parks.","zh":"Papilioninae（凤蝶亚科）包含许多在花园和公园里常见的凤蝶。"},{"en":"In the museum collection, specimens were labeled by family, subfamily (Papilioninae), genus, and species.","zh":"在博物馆馆藏中，标本按科、亚科（Papilioninae）、属和种进行标注。"}]}],"synonyms":["swallowtail subfamily","Papilionidae subfamily (Papilioninae)"],"phonetic":"/ˌpæpɪliəˈnaɪ.iː/","extraExplanation":["Papilioninae 是生物分类学名称：科（Papilionidae 凤蝶科）之下的一层是“亚科”（subfamily）。在科普或论文里，常用它来更精确地说明某只蝴蝶在凤蝶科中的分支。","词源来自拉丁语 papilio（“蝴蝶”）。学术名称通常按拉丁/希腊语构词规则形成，因此在英语中多按“学术拉丁化读法”发音。"]}
{"word":"papilionine","summary":{"en":"Papilionine means “butterfly-related,” especially connected to the swallowtail butterfly family (Papilionidae).","zh":"papilionine 指“与蝴蝶有关的”，尤指与凤蝶科（Papilionidae，燕尾蝶类）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) relating to butterflies, especially to the swallowtail butterfly family (Papilionidae).","zh":"（生物）与蝴蝶有关的；尤指与凤蝶科（Papilionidae，常称“凤蝶/燕尾蝶”）有关的。"},"examples":[{"en":"Researchers compared papilionine species with other butterfly groups to study wing-color evolution.","zh":"研究人员将凤蝶科（papilionine）的物种与其他蝴蝶类群比较，以研究翅色的演化。"},{"en":"The garden attracts papilionine butterflies such as swallowtails.","zh":"这个花园吸引了凤蝶科的蝴蝶，例如燕尾蝶。"}]}],"synonyms":["papilionid","swallowtail (related)","butterfly-like"],"phonetic":"/ˌpæpɪliəˈnaɪn/","extraExplanation":["“papilionine”来自拉丁语 papilio（蝴蝶）+ 英语后缀 -ine（表示“……的/与……有关的”）。在日常英语里较少见，更常出现在昆虫学、分类学等学术语境。","和它常一起出现的相关词有 Papilionidae（凤蝶科，名词）与 papilionid（凤蝶科的；凤蝶科成员，形容词/名词）。"]}
{"word":"papilionoid","summary":{"en":"A botanical adjective meaning “butterfly-like (pea-family) flower type.”","zh":"植物学形容词：指“豆科常见的蝶形（像蝴蝶）的花型/结构”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or belonging to the papilionoid type of flower (often butterfly-shaped), typical of many plants in the pea/bean family (Fabaceae).","zh":"（植物学）指与蝶形花有关的；呈蝶形花结构的；属于豆科中常见的蝶形花类型（花冠常像蝴蝶）。"},"examples":[{"en":"Peas and beans often have papilionoid flowers with a banner, wings, and keel.","zh":"豌豆和豆类常见蝶形花，花冠由旗瓣、翼瓣和龙骨瓣组成。"},{"en":"The botanist described the plant’s papilionoid corolla as a key feature for identification.","zh":"植物学家把该植物的蝶形花冠描述为鉴定的重要特征。"}]}],"synonyms":["pea-flowered","papilionaceous"],"phonetic":"/pəˈpɪl.jəˌnɔɪd/","extraExplanation":["“Papilionoid”源自拉丁语 papilio（蝴蝶），因为这类花冠外形常被形容为“像蝴蝶”。在豆科中，蝶形花常见的三部分是：上方较大的旗瓣（banner/standard）、两侧的翼瓣（wings）、以及下方常包裹雄蕊与雌蕊的龙骨瓣（keel）。","在分类学中，Papilionoideae（蝶形花亚科）是豆科的重要类群之一；“papilionoid”既可泛指这种花型，也常用于描述该类群的典型形态特征。"]}
{"word":"papilionoidea","summary":{"en":"Papilionoidea is the scientific name for the superfamily that includes the true butterflies.","zh":"Papilionoidea 是包含真正蝴蝶的“凤蝶总科”的学名（超科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a superfamily of insects that includes the true butterflies (as distinct from most moths).","zh":"（昆虫分类）凤蝶总科：包含真正的蝴蝶的一大类群（通常与大多数飞蛾区分）。"},"examples":[{"en":"Researchers recorded several Papilionoidea species during the summer survey.","zh":"研究人员在夏季调查中记录了几种凤蝶总科（Papilionoidea）的物种。"},{"en":"Many people casually say “butterflies,” but scientists may specify Papilionoidea in formal writing.","zh":"很多人日常会说“蝴蝶”，但在正式写作中，科学家可能会具体写作 Papilionoidea（凤蝶总科）。"}]}],"synonyms":["butterflies (informal/common term)","butterfly superfamily (informal paraphrase)"],"phonetic":"/ˌpæpɪliˈɔɪnɔɪdiə/","extraExplanation":["Papilionoidea 是生物分类学名称（拉丁化学名），常见于学术论文、昆虫图鉴与博物馆标本标签中。日常英语里通常直接说 butterflies。","词源上 papilio 在拉丁语中意为“蝴蝶”，-oidea 表示“……样的/……类的”，合起来大致是“蝴蝶类群”。"]}
{"word":"papilla","summary":{"en":"Papilla means a small nipple-like projection in the body, especially the tiny bumps on the tongue.","zh":"Papilla 指身体上的乳头状小突起，尤其常指舌头表面的细小突起（舌乳头）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, nipple-like bump or projection on a surface in the body, especially on the tongue (some papillae contain taste buds).","zh":"（解剖）乳头状突起；小乳头状隆起，尤指舌头表面的突起（有些舌乳头含味蕾）。"},"examples":[{"en":"The doctor examined the papillae on the patient’s tongue.","zh":"医生检查了病人舌头上的舌乳头。"},{"en":"Some papillae contain taste buds that help us detect flavors.","zh":"有些乳头含有味蕾，帮助我们分辨味道。"}]},{"partOfSpeech":"n.","definition":{"en":"In anatomy, a small projection in an organ (for example, where a duct opens into the body).","zh":"（解剖）器官内的小突起；（例如）导管开口处附近的突起。"},"examples":[{"en":"The textbook labeled the papilla where the duct opens.","zh":"教材标出了导管开口处的乳头状结构。"}]}],"synonyms":["nipple","projection","bump","(related) taste bud"],"phonetic":"/pəˈpɪlə/","extraExplanation":["“papilla”来自拉丁语，意思与“乳头/小突起”相关；复数常用 papillae（读作类似“puh-PIL-ee”）。","日常英语里多用于医学或生物学语境；在普通口语中，人们更常说 “taste buds（味蕾）”，但严格来说味蕾是位于某些舌乳头内的结构。"]}
{"word":"papillae","summary":{"en":"Papillae are small, bump-like projections in the body, especially on the tongue and in certain organs.","zh":"Papillae 指身体上的乳头状小突起，常见于舌头及某些器官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, nipple-like bumps on a surface in the body, especially on the tongue (where they help you sense taste) or on the skin.","zh":"（身体表面的）乳头状小突起；尤指舌头上的乳头（与味觉有关）或皮肤上的突起。"},"examples":[{"en":"The tiny papillae on your tongue help you detect different tastes.","zh":"你舌头上的微小乳头帮助你分辨不同的味道。"},{"en":"Spicy food can sometimes irritate the tongue’s papillae.","zh":"辛辣食物有时会刺激舌头的乳头。"}]},{"partOfSpeech":"n.","definition":{"en":"In anatomy, small projections in certain organs (for example, in the kidneys) that increase surface area or help move fluid.","zh":"（解剖）某些器官中的小突起（如肾脏的乳头），可增加表面积或帮助液体流动。"},"examples":[{"en":"In the kidney, the renal papillae help drain urine into the collecting system.","zh":"在肾脏中，肾乳头帮助将尿液排入集合系统。"}]}],"synonyms":["papillae (plural of papilla)","projections","bumps"],"phonetic":"/pəˈpɪli/","extraExplanation":["“Papillae”是复数形式；单数是“papilla”（/pəˈpɪlə/）。日常说“taste buds（味蕾）”更常见，但味蕾位于舌乳头上（不是所有乳头都有味蕾）。"]}
{"word":"papillar","summary":{"en":"Papillar means “related to a papilla” (a small nipple-like projection), used mainly in medical or biological contexts.","zh":"Papillar 指“乳头状的/与乳头突有关的”，主要用于医学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or shaped like a papilla (a small, nipple-like projection on a surface, especially in the body).","zh":"乳头状的；与乳头突（papilla）有关的（指表面小而突起、常呈“乳头状”的结构，尤指人体组织）。"},"examples":[{"en":"Doctors examined the papillar structures on the patient’s tongue.","zh":"医生检查了病人舌头上的乳头状结构。"},{"en":"Under the microscope, the tissue showed papillar growth.","zh":"在显微镜下，这种组织显示出乳头状增生。"}]}],"synonyms":["papillary","nipple-like","papillate"],"phonetic":"/pəˈpɪlər/","extraExplanation":["“papillar”多用于医学/生物学语境，来自“papilla”（乳头突、乳头状突起）。日常英语里更常见的相关词有“papillary”（乳头状的）和“papillae”（papilla的复数）。例如：papillary tumor（乳头状肿瘤）、papillae on the tongue（舌乳头）。"]}
{"word":"papillary","summary":{"en":"Papillary means “related to papillae” or “having nipple-like/finger-like projections,” often used in anatomy and medical descriptions (including tumor patterns).","zh":"Papillary 指“与乳头状小突起（papillae）有关/呈乳头状的”，常用于解剖与医学描述（也可指肿瘤的乳头状生长模式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or shaped like small nipple-like bumps (papillae), especially in anatomy or medicine.","zh":"（尤指解剖学/医学）与乳头状突起（乳突、乳头状小突起）有关的；呈乳头状的。"},"examples":[{"en":"The doctor noted papillary growths on the skin.","zh":"医生注意到皮肤上有乳头状增生。"},{"en":"Papillary structures are common in some glands and tissues.","zh":"在某些腺体和组织中，乳头状结构很常见。"}]},{"partOfSpeech":"adj.","definition":{"en":"In medicine, describing certain tumors that have a finger-like or frond-like (papillae-forming) pattern under the microscope.","zh":"（医学）形容某些肿瘤在显微镜下呈乳头状（指状/绒毛状）生长模式的。"},"examples":[{"en":"Papillary thyroid carcinoma is a common type of thyroid cancer.","zh":"甲状腺乳头状癌是一种常见的甲状腺癌。"},{"en":"The pathology report described papillary features.","zh":"病理报告描述了乳头状特征。"}]}],"synonyms":["papillate","papilliform","nipple-like","papillose"],"phonetic":"/ˈpæpəˌlɛri/","extraExplanation":["“papillary”来自“papilla”（乳头/乳突；小突起）。在医学语境里它通常是一个“形态学描述词”，意思是“看起来像小乳头/指状突起”，常用于病理报告或解剖描述。","学习提示：不要把 papillary 理解成“与乳头（nipple）有关”的日常含义；它更常指“表面或组织结构呈小突起状”。"]}
{"word":"papillate","summary":{"en":"Papillate means “covered with small nipple-like bumps (papillae),” mainly used in scientific descriptions.","zh":"papillate 指“表面有乳头状小突起”，主要用于生物/医学等科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small, nipple-like bumps or projections (papillae) on a surface; covered with papillae.","zh":"表面有乳头状小突起（乳头、乳突）的；呈乳头状的。"},"examples":[{"en":"Under the microscope, the leaf surface looked papillate, with many tiny bumps.","zh":"在显微镜下，叶片表面呈乳头状，有许多细小突起。"},{"en":"Some mushrooms have a papillate cap, meaning the top has a small pointed bump.","zh":"有些蘑菇的菌盖呈乳头状，也就是顶部有一个小尖突起。"},{"en":"The report described the tissue as papillate, which can help with identification.","zh":"报告把该组织描述为乳头状，这有助于鉴别。"}]}],"synonyms":["papillary","bumpy","knobbed","warted","tuberculate"],"phonetic":"/ˈpæpəˌleɪt/","extraExplanation":["“papillate”多见于生物学、医学、植物学或真菌学的描述性文字，用来说明表面形态特征（是否有细小突起），日常英语中不常用。","词根来自拉丁语 papilla（“乳头、乳突”）。相关词：papilla（乳头/乳突）、papillary（乳头状的，常用于解剖学/医学）、papilloma（乳头状瘤，指肿瘤名称，不等同于 papillate 这种“外观描述”）。"]}
{"word":"papillated","summary":{"en":"Papillated means “covered with small, nipple-like bumps (papillae),” often used in medical or biological descriptions.","zh":"Papillated 指“表面有乳头状小突起（乳突）的”，常用于医学或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small, nipple-like bumps or projections on a surface; covered with papillae.","zh":"表面有乳头状小突起的；有乳突（乳头状突起）的。"},"examples":[{"en":"Under the microscope, the tumor showed a papillated surface.","zh":"在显微镜下，这个肿瘤呈现乳头状的表面。"},{"en":"The botanist described the leaf as slightly papillated along the edge.","zh":"植物学家描述这片叶子的边缘略呈乳头状突起。"}]}],"synonyms":["papillate","papillary","bumpy","knobbed"],"phonetic":"/ˈpæpəˌleɪtɪd/","extraExplanation":["“papillated”多见于医学/病理学与生物学描述，用来形容组织表面呈“乳头状突起”（papillae）。在日常英语中很少使用，更常见的近义形容词是“papillate”。","词源来自拉丁语 papilla（乳头、乳突）。在病理报告里，papillated/papillary 常与生长形态相关，但是否良性或恶性需要结合完整诊断，不能仅凭这个词判断。"]}
{"word":"papillectomy","summary":{"en":"Papillectomy is the surgical removal of a papilla, most often the major duodenal papilla.","zh":"Papillectomy 指切除乳头状结构的手术，最常指十二指肠大乳头切除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove a papilla (a small nipple-like structure), especially the major duodenal papilla (ampulla of Vater) in the digestive tract.","zh":"切除乳头状结构的手术；尤指切除十二指肠大乳头（Vater壶腹/胆胰管开口处）的手术。"},"examples":[{"en":"The gastroenterologist discussed papillectomy as an option for removing a benign tumor at the major duodenal papilla.","zh":"胃肠科医生讨论了用乳头切除术来切除十二指肠大乳头处良性肿瘤的方案。"},{"en":"After imaging and biopsy, the team planned an endoscopic papillectomy to reduce the risk of obstruction.","zh":"在影像检查和活检后，团队计划进行内镜下乳头切除术，以降低梗阻风险。"}]}],"synonyms":["papilla excision","endoscopic papillectomy","ampullectomy"],"phonetic":"/ˌpæpɪˈlɛktəmi/","extraExplanation":["词源拆解：papilla（乳头/乳头状突起）+ -ectomy（切除术）。因此它字面意思就是“乳头切除术”。","临床语境中更常见的是“endoscopic papillectomy（内镜下乳头切除术）”，多用于处理十二指肠大乳头部位的腺瘤等病变；具体适应证与风险需要由专科医生评估。"]}
{"word":"papilledema","summary":{"en":"Papilledema means swelling of the optic disc, most often due to raised intracranial pressure.","zh":"Papilledema 指视乳头水肿，多由颅内压升高导致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Swelling of the optic disc (the place where the optic nerve enters the eye), usually caused by increased pressure inside the skull (raised intracranial pressure).","zh":"视乳头水肿：视神经进入眼球处（视乳头）的肿胀，通常由颅内压升高引起。"},"examples":[{"en":"The eye exam showed papilledema, so the doctor ordered urgent brain imaging.","zh":"眼底检查发现视乳头水肿，所以医生安排了紧急脑部影像检查。"},{"en":"Papilledema can be a warning sign of dangerously high intracranial pressure.","zh":"视乳头水肿可能是颅内压危险升高的警示信号。"},{"en":"In suspected papilledema, clinicians often check vision, headaches, and neurological symptoms together.","zh":"怀疑视乳头水肿时，临床通常会综合评估视力、头痛和神经系统症状。"}]}],"synonyms":["optic disc swelling","choked disc"],"phonetic":"/ˌpæpɪˈliːdiːmə/","extraExplanation":["词源：papi(l)- 指“乳头”（这里指“视乳头”），-edema 指“水肿”。合起来就是“视乳头的肿胀”。","学习提示：papilledema 通常不是单纯的“眼睛问题”，而是提示可能存在颅内压升高等需要尽快评估的情况；它不同于一般的“视神经炎（optic neuritis）”或“视乳头炎（papillitis）”。"]}
{"word":"papilliferous","summary":{"en":"Papilliferous means ‘having papillae’—a surface with many small nipple-like projections, used mainly in medical/pathology and botany contexts.","zh":"papilliferous 指“具有乳头状突起的”，常用于医学/病理与植物学等专业描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or covered with small nipple-like projections (papillae).","zh":"有乳头状小突起的；布满乳头状突起的。"},"examples":[{"en":"Under the microscope, the surface looked papilliferous with many tiny projections.","zh":"在显微镜下，这个表面呈乳头状，布满许多细小突起。"},{"en":"The report described a papilliferous growth on the mucosa.","zh":"报告描述黏膜上有乳头状增生。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany) Bearing papillae or papilla-like bumps, often on leaves or petals.","zh":"（植物学）带有乳头状突起的（常见于叶片或花瓣表面）。"},"examples":[{"en":"Some desert plants have papilliferous leaves that help reduce water loss.","zh":"一些沙漠植物的叶片带乳头状突起，有助于减少水分散失。"}]}],"synonyms":["papillate","papillary","papilla-bearing"],"phonetic":"/ˌpæpɪˈlɪfərəs/","extraExplanation":["词源上与 papilla（乳头状突起）有关：papill- 表示“乳头”，-ferous 表示“携带/具有”（如 carboniferous “含碳的”）。因此 papilliferous 直译就是“带乳头状突起的”。","该词多见于医学、病理学与植物学的描述性语境，偏书面与专业；日常英语更常用的说法是 “with papillae / papilla-like bumps”。"]}
{"word":"papilliform","summary":{"en":"Papilliform means “shaped like a small nipple/bump (a papilla),” often used in medical or anatomical descriptions.","zh":"papilliform 指“乳头状/乳突状的”，常用于医学或解剖学对形态的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nipple-shaped; resembling a small rounded bump (a papilla), especially in anatomy.","zh":"乳头状的；像小突起（乳头、乳突）一样的，尤用于解剖学语境。"},"examples":[{"en":"The doctor noted a papilliform surface on the tissue under the microscope.","zh":"医生在显微镜下观察到该组织表面呈乳头状。"},{"en":"Some parts of the tongue have papilliform projections that help with texture and taste.","zh":"舌头的某些部位有乳头状突起，有助于感知口感与味觉。"}]}],"synonyms":["papillary","nipple-shaped","papilla-like","protuberant"],"phonetic":"/pəˈpɪlɪˌfɔrm/","extraExplanation":["“papilliform”多见于医学/生物学写作，用来描述“外观形态”，不一定表示疾病本身；是否异常要结合部位、大小、数量和医生判断。","词源上与拉丁语 papilla（乳头、突起）有关，后缀 -form 表示“……形状的”。常见相关词：papilla（乳头/乳突）、papillary（乳头状的，常用于组织结构或肿瘤类型描述）。"]}
{"word":"papillitis","summary":{"en":"Papillitis means inflammation of a papilla, most commonly inflammation of the optic disc in the eye.","zh":"Papillitis 指乳头状结构的炎症，最常见的是眼睛视神经乳头（视盘）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of a papilla (a small, nipple-like structure on the body), especially the optic disc (papilla) in the eye.","zh":"乳头炎：乳头状结构（身体上小的突起）发生的炎症，尤指眼睛视神经乳头（视盘）的炎症。"},"examples":[{"en":"The doctor examined her eye and diagnosed papillitis related to optic nerve inflammation.","zh":"医生检查了她的眼睛，诊断为与视神经炎症相关的视神经乳头炎（papillitis）。"},{"en":"Papillitis can cause blurred vision and pain when moving the eye.","zh":"乳头炎可能导致视力模糊，并在转动眼球时出现疼痛。"}]},{"partOfSpeech":"n.","definition":{"en":"Inflammation of the papillae on the tongue (sometimes used for certain tongue conditions).","zh":"（有时指）舌乳头炎：舌头表面的乳头发生炎症。"},"examples":[{"en":"Spicy food may irritate the mouth, and a clinician might mention papillitis of the tongue papillae.","zh":"辛辣食物可能刺激口腔，临床上有时会提到舌乳头的乳头炎（papillitis）。"}]}],"synonyms":["inflammation of the optic disc","optic disc inflammation","(related) optic neuritis"],"phonetic":"/ˌpæpəˈlaɪtɪs/","extraExplanation":["词源上，papilla 表示“乳头/小突起”，-itis 表示“炎症”，所以 papillitis 字面意思就是“乳头的炎症”。","在眼科语境中，papillitis 常用来指视神经乳头（视盘）的炎症，常与 optic neuritis（视神经炎）相关。该词属于医学专业用语，日常英语中不常见。"]}
{"word":"papilloadenocystoma","summary":{"en":"A medical term for a typically benign cyst-forming gland tumor with papillary growths (often similar to “papillary cystadenoma”).","zh":"医学术语：通常为良性的、形成囊性结构并伴乳头状增生的腺体肿瘤（常近似于“乳头状囊腺瘤”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A usually benign gland-related tumor that forms cysts (fluid-filled sacs) and papillary (finger-like) growths inside them; an older/less common term often used similarly to “papillary cystadenoma.”","zh":"（医学）一种通常为良性的腺体相关肿瘤，特点是在囊肿（充满液体的囊）内形成乳头状（指状）增生；属于较旧或较少用的术语，常与“乳头状囊腺瘤（papillary cystadenoma）”近义使用。"},"examples":[{"en":"The pathology report described the mass as a papilloadenocystoma with papillary projections lining a cystic space.","zh":"病理报告将该肿块描述为乳头状腺囊瘤样改变，囊性腔隙内衬可见乳头状突起。"},{"en":"Because the lesion was benign, the patient was treated mainly with surgical removal and follow-up.","zh":"由于该病变为良性，治疗主要以手术切除并随访为主。"}]}],"synonyms":["papillary cystadenoma","cystadenoma papilliferum"],"phonetic":"/pəˌpɪloʊˌædɪnoʊsɪˈstoʊmə/","extraExplanation":["这是一个较为罕见、偏“病理/医学文献”用语的名词，不是日常英语词汇；在现代写作中更常见的表达往往是 papillary cystadenoma（乳头状囊腺瘤）或更具体的诊断名称。","词源可拆解理解：papillo-（乳头状）+ adeno-（腺体）+ cyst-（囊）+ -oma（肿瘤）。这种构词方式在医学英语里很常见，有助于看到词就大致猜到“形态 + 来源组织 + 结构 + 肿瘤”的含义。","不同器官系统可能有更精确的术语与分类；实际诊断以医生/病理报告用词为准。"]}
{"word":"papillocarcinoma","summary":{"en":"Papillocarcinoma is a medical term for a carcinoma with papillary (finger-like) growth patterns.","zh":"Papillocarcinoma 指具有乳头状（指状分支）生长结构的癌（上皮性恶性肿瘤）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a malignant tumor (cancer) whose cells grow in finger-like, branching (“papillary”) structures; a type of carcinoma described by its papillary pattern.","zh":"乳头状癌；一种恶性肿瘤（癌），其肿瘤细胞呈“乳头状/指状分支”的生长结构；按乳头状形态特征命名的癌种。"},"examples":[{"en":"The biopsy report described the mass as a papillocarcinoma with papillary features.","zh":"活检报告将该肿块描述为具有乳头状特征的乳头状癌（papillocarcinoma）。"},{"en":"Papillocarcinoma is a pathology term that may appear in reports for organs such as the thyroid.","zh":"“Papillocarcinoma”是病理学术语，可能出现在例如甲状腺等器官的病理报告中。"}]}],"synonyms":["papillary carcinoma","papillary cancer"],"phonetic":"/ˌpæpɪloʊˌkɑɹsɪˈnoʊmə/","extraExplanation":["这是偏专业、偏病理学的词：papillo- 表示“乳头状”，carcinoma 表示“癌（上皮来源的恶性肿瘤）”。临床上更常见的具体名称是 “papillary carcinoma（乳头状癌）”，例如 papillary thyroid carcinoma（甲状腺乳头状癌）。","该词不用于日常表达，通常只在病理报告、医学论文或诊断讨论中出现。阅读报告时要注意它描述的是“肿瘤结构/类型”，具体分期、分级、预后与治疗仍需结合器官部位、大小、扩散情况等信息，由专业医生解释。"]}
{"word":"papilloedema","summary":{"en":"Papilloedema is optic-disc swelling caused by raised pressure inside the skull.","zh":"Papilloedema指因颅内压升高引起的视神经乳头（视盘）肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Swelling of the optic disc (the spot where the optic nerve enters the eye) caused by increased pressure inside the skull (raised intracranial pressure).","zh":"（因颅内压升高导致的）视神经乳头水肿／视乳头水肿：视神经进入眼球处的“视神经乳头”发生肿胀。"},"examples":[{"en":"The eye exam showed papilloedema, so the doctor ordered brain imaging to check for raised intracranial pressure.","zh":"眼底检查发现视神经乳头水肿，因此医生安排了颅脑影像检查以排查颅内压升高的原因。"},{"en":"Headache with papilloedema is considered a warning sign that needs urgent medical evaluation.","zh":"头痛合并视神经乳头水肿通常被视为警讯，需要尽快就医评估。"}]}],"synonyms":["papilledema","optic disc swelling (due to raised intracranial pressure)"],"phonetic":"/ˌpæpɪloʊˈidimə/","extraExplanation":["“papilloedema”是英式拼写；美式更常写作“papilledema”。两者意思相同。","它通常提示“颅内压升高”的问题（例如脑肿瘤、脑出血、脑膜炎、颅内静脉窦血栓等），因此在医学上属于需要尽快评估的体征。","不要与“optic neuritis（视神经炎）”混淆：视神经炎多为炎症/脱髓鞘导致，常见眼痛（尤其转眼时）与视力下降；papilloedema的关键机制是颅内压升高引起的视乳头肿胀。"]}
{"word":"papilloma","summary":{"en":"Papilloma = a usually benign, wart-like growth, often linked to HPV.","zh":"papilloma＝乳头状瘤：通常为良性的、像疣一样的赘生物，常与 HPV 有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually non-cancerous growth (tumor) on the skin or inside the body, often caused by a virus such as HPV.","zh":"乳头状瘤：一种小的肿物（通常为良性），可长在皮肤或体内，常与病毒（如人乳头瘤病毒 HPV）有关。"},"examples":[{"en":"The doctor said the papilloma was benign and could be removed easily.","zh":"医生说这个乳头状瘤是良性的，而且可以很容易切除。"},{"en":"Some papillomas are linked to HPV infection, so follow-up testing may be needed.","zh":"有些乳头状瘤与 HPV 感染有关，因此可能需要进一步检查。"}]}],"synonyms":["wart (informal, not always the same)","benign tumor","growth"],"phonetic":"/ˌpæpɪˈloʊmə/","extraExplanation":["“papilloma”来自拉丁语词根 papilla（乳头、小突起）+ -oma（肿瘤），字面意思是“乳头状的肿物”。","日常英语里更常听到的是相关的通俗说法，比如 wart（疣）、skin tag（皮赘/皮肤赘生物），但它们不一定和 papilloma 完全等同；医学场景下用 papilloma 更准确。","学习上要注意：papilloma 指一种“形态/类型”的肿物（乳头状突起），不等于“癌”。不过医学上仍需要由医生判断性质（良性或少数情况下可能有风险）。"]}
{"word":"papillomas","summary":{"en":"Papillomas are small, usually benign growths (papilloma is singular), often wart-like and sometimes linked to HPV.","zh":"Papillomas 指乳头状瘤（复数），是小的、通常为良性的赘生物，常像疣，有时与 HPV 有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of papilloma) a small, usually benign (non-cancerous) growth on the skin or inside the body, often caused by a virus such as HPV; it can look like a wart.","zh":"（papilloma 的复数）乳头状瘤：皮肤或身体内部出现的小型、通常为良性（非癌性）的赘生物，外观常类似疣，有时与 HPV 等病毒感染有关。"},"examples":[{"en":"The doctor found several papillomas on the patient’s vocal cords.","zh":"医生在患者的声带上发现了几个乳头状瘤。"},{"en":"Some papillomas are linked to HPV, so follow-up tests may be recommended.","zh":"有些乳头状瘤与 HPV 有关，因此医生可能会建议做进一步检查。"},{"en":"The biopsy confirmed the growths were benign papillomas.","zh":"活检证实这些增生物是良性的乳头状瘤。"}]}],"synonyms":["warts (common term, not exact)","benign growths","papillary tumors (medical)"],"phonetic":"ˌpæpɪˈloʊməz","extraExplanation":["“Papillomas”是复数形式；单数是“papilloma”。在日常英语里，这个词偏医学语境，比“wart（疣）”更正式、更具体。","不少乳头状瘤与人乳头瘤病毒（HPV）相关，但是否需要治疗取决于位置、大小、是否出血/疼痛、以及是否影响器官功能；出现相关症状应咨询医生。","发音与拼写提示：papilloma 重音通常在“-lo-”音节上：pa-PIL-LO-ma（美式 IPA 见下）。"]}
{"word":"papillomata","summary":{"en":"Papillomata means more than one papilloma—usually benign, wart-like epithelial growths.","zh":"Papillomata 是 papilloma 的复数，指多个通常为良性的、疣状/指状的上皮赘生物（乳头状瘤）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of papilloma: small, usually benign (non-cancerous) growths that rise from an epithelial surface (such as skin or mucous membranes), often with a wart-like or finger-like shape.","zh":"papilloma 的复数：指从上皮表面（如皮肤或黏膜）长出的、通常为良性（非癌性）的赘生物，常呈疣状或指状突起。"},"examples":[{"en":"The doctor noted multiple papillomata on the patient’s vocal cords.","zh":"医生记录到患者声带上有多个乳头状瘤。"},{"en":"Most papillomata are benign, but they may still require treatment depending on location and symptoms.","zh":"大多数乳头状瘤是良性的，但是否需要治疗仍取决于部位和症状。"}]}],"synonyms":["papillomas","benign papillomas","warts (informal, not exact)"],"phonetic":"/ˌpæpəˌloʊˈmoʊtə/","extraExplanation":["“papillomata”是源自拉丁/希腊式复数的医学用语（-oma 的复数有时写作 -omata）。在现代英文中也常见更规则的复数“papillomas”。两者意思相同，但“papillomata”更偏正式、学术或病理报告语境。","乳头状瘤在不同部位可能有不同临床意义：例如声带乳头状瘤可能影响发声；某些类型与 HPV（人乳头瘤病毒）相关。是否需要治疗与感染类型、部位、症状及医生评估有关。"]}
{"word":"papillomatosis","summary":{"en":"Papillomatosis is a medical condition involving multiple papillomas (wart-like growths), often on skin or mucous membranes.","zh":"Papillomatosis 指多发性乳头状瘤（类似疣的赘生物）的医学状况，常见于皮肤或黏膜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which many papillomas (small, usually noncancerous, wart-like growths) develop, often on skin or mucous membranes such as the throat or genitals.","zh":"一种医学状况：出现多个乳头状瘤（通常为良性、类似疣的小赘生物），常见于皮肤或黏膜，如喉咙或生殖器等部位。"},"examples":[{"en":"Recurrent respiratory papillomatosis can cause hoarseness because growths form on the vocal cords.","zh":"复发性呼吸道乳头状瘤病会引起声音嘶哑，因为赘生物长在声带上。"},{"en":"The doctor explained that papillomatosis may require repeated treatments if the growths come back.","zh":"医生解释说，如果赘生物复发，乳头状瘤病可能需要反复治疗。"}]}],"synonyms":["multiple papillomas","papilloma formation","recurrent respiratory papillomatosis (specific type)"],"phonetic":"/ˌpæpɪˌloʊməˈtoʊsɪs/","extraExplanation":["“papillomatosis”由 papilla（乳头状突起/乳头状结构）+ -oma（肿瘤/瘤样增生）+ -tosis（某种疾病或增多的状态）组成，字面意思是“乳头状赘生物增多的状态”。","在临床语境中，这个词常用于描述“多发性”或“成群出现”的乳头状瘤；有些类型与 HPV（人乳头瘤病毒）相关，例如“复发性呼吸道乳头状瘤病（RRP）”。","这是医学术语，日常英语里更常听到的是“warts（疣）”或“papillomas（乳头状瘤）”。如需用于沟通，可说：“multiple papillomas”或“wart-like growths”。"]}
{"word":"papillomatous","summary":{"en":"A medical adjective meaning ‘wart-like’ or ‘covered with small papillae,’ related to papillomas.","zh":"医学形容词，指“疣样/乳头状、有许多小突起的”，与乳头瘤或其形态特征有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a surface covered with small, nipple-like projections (papillae), often resembling a wart; relating to or characterized by papillomas.","zh":"乳头状的；表面有许多小突起（乳头/乳头样结构）的，常呈疣状外观；与乳头瘤或其特征有关的。"},"examples":[{"en":"The doctor described the lesion as papillomatous in appearance.","zh":"医生形容这个病灶外观看起来呈乳头状。"},{"en":"Biopsy showed a papillomatous growth on the vocal cord.","zh":"活检显示声带上有乳头状增生。"},{"en":"The report mentioned papillomatous changes in the tissue.","zh":"报告提到组织出现乳头状改变。"}]}],"synonyms":["warty","papillary","verrucous"],"phonetic":"/ˌpæpəˈloʊmətəs/","extraExplanation":["“papillomatous”多用于医学语境，常见于病理报告或临床描述（如皮肤、口腔、喉部、膀胱等部位）。它描述的是形态特征（像小突起/小乳头一样的表面），不等同于“癌”，但是否良恶性需要结合部位、检查结果（如活检）判断。","词根提示：papilla（乳头、小突起）+ -oma（瘤）→ papilloma（乳头瘤）；-tous 表示“充满……/具有……特征的”。"]}
{"word":"papillon","summary":{"en":"Papillon usually means the toy dog breed with butterfly-like ears; it can also mean “butterfly” in French and is sometimes used as a name in English.","zh":"Papillon 通常指“蝴蝶犬”（耳朵像蝴蝶翅膀的小型犬）；它也源自法语，意为“蝴蝶”，在英语中有时用作名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small toy dog breed (Papillon) known for its large, butterfly-like ears","zh":"（犬种）蝴蝶犬；一种小型玩赏犬，以大而像蝴蝶翅膀的耳朵著称"},"examples":[{"en":"She adopted a papillon because it’s small and friendly.","zh":"她领养了一只蝴蝶犬，因为它体型小又很友好。"},{"en":"The papillon’s ears look like butterfly wings.","zh":"蝴蝶犬的耳朵看起来像蝴蝶的翅膀。"}]},{"partOfSpeech":"n.","definition":{"en":"(from French) a butterfly; used occasionally in English, especially as a name or stylistic word","zh":"（源自法语）蝴蝶；在英语中偶尔作为名称或风格化用词出现"},"examples":[{"en":"The boutique is called Papillon, meaning “butterfly” in French.","zh":"这家精品店叫 Papillon，在法语里意思是“蝴蝶”。"},{"en":"A papillon landed on the flower in the illustration.","zh":"插画里一只“papillon”（蝴蝶）落在花上。"}]}],"synonyms":["butterfly","toy spaniel"],"phonetic":"/ˌpæpɪˈjoʊn/","extraExplanation":["Papillon 是法语“蝴蝶”的意思，发音更接近“pa-pee-YON”。英语里常见作犬种名（Papillon dog / Papillon）或店名、人名、作品名。","文化提示：Papillon 也常让人联想到法国作家 Henri Charrière 的回忆录《Papillon》（后改编成电影），书名取“蝴蝶”的含义，也指主角的绰号。"]}
{"word":"papillons","summary":{"en":"“Papillons” is a French plural meaning “butterflies,” sometimes used in English names or titles; it can also refer to bow ties.","zh":"“Papillons”是法语复数，意思是“蝴蝶”，在英语里多见于名称或标题；也可指领结／蝴蝶结。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Butterflies (French plural of *papillon*), sometimes used in English in titles, names, or to add a French feel.","zh":"蝴蝶（法语 *papillon* 的复数），在英语里偶尔用于书名、作品名、店名等，带一点法式风格。"},"examples":[{"en":"The café is called “Papillons,” which is French for “butterflies.”","zh":"这家咖啡馆叫“Papillons”，这是法语，意思是“蝴蝶”。"},{"en":"In the program, the dance piece is titled “Les Papillons.”","zh":"节目单里，这支舞的作品名叫“Les Papillons（蝴蝶们）”。"}]},{"partOfSpeech":"n.","definition":{"en":"Bow ties (from French *papillon* “butterfly,” because the shape looks like butterfly wings).","zh":"领结／蝴蝶结（源自法语 *papillon*“蝴蝶”，因为形状像蝴蝶翅膀）。"},"examples":[{"en":"The waiter wore a black papillon; the shop listed them as “papillons.”","zh":"服务员戴着黑色领结；店里把它们标成“papillons”。"}]}],"synonyms":["butterflies","bow ties"],"phonetic":"/ˌpæpɪˈjɑnz/","extraExplanation":["“papillons”本质上是法语复数（单数是 papillon）。在英语中更常见的说法是 “butterflies”。如果你在英文语境里看到 “Papillons/Les Papillons”，常常是作品名、品牌名或刻意营造法式氛围。","发音在英语里通常会英文化；很多人会把 -s 读成 /z/。正式法语里词尾 -s 一般不单独发音，但在英语借词中常按英语规则处理。"]}
{"word":"papilloretinitis","summary":{"en":"Papilloretinitis is inflammation of the optic disc with associated retinal inflammation.","zh":"Papilloretinitis 指视神经乳头（视盘）炎症肿胀并伴随视网膜炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An inflammation of the optic nerve head (optic disc) with swelling (papillitis) plus inflammation of the retina (retinitis), which can cause blurred vision and other visual symptoms.","zh":"一种眼部炎症：视神经乳头（视盘）发生炎症并肿胀（乳头炎/视盘炎），同时伴有视网膜炎症（视网膜炎），可引起视力模糊等症状。"},"examples":[{"en":"The ophthalmologist diagnosed papilloretinitis after noticing optic disc swelling and retinal inflammation.","zh":"眼科医生在发现视盘肿胀并伴有视网膜炎症后，诊断为乳头视网膜炎（papilloretinitis）。"},{"en":"Papilloretinitis can lead to blurred vision, so she was advised to return immediately if symptoms worsened.","zh":"乳头视网膜炎可能导致视力模糊，因此医生嘱咐她若症状加重需立刻复诊。"}]}],"synonyms":["neuroretinitis (related term)","optic disc inflammation with retinitis (descriptive)"],"phonetic":"/ˌpæpɪloʊˌrɛtəˈnaɪtɪs/","extraExplanation":["这是医学专用词，多用于眼科病历、检查报告或学术文章，不是日常会话词。","临床上常与感染或炎症相关的原因一起讨论（例如某些细菌/病毒感染等），医生通常会结合眼底检查、视力变化及相关化验来判断病因与治疗方案。","与“optic neuritis（视神经炎）”有重叠但不完全相同：papilloretinitis 强调视盘（乳头）肿胀并合并视网膜炎症；具体诊断仍以眼科检查所见为准。"]}
{"word":"papillosarcoma","summary":{"en":"Papillosarcoma is a rare/older term for a sarcoma with papillary (finger-like) growth patterns.","zh":"Papillosarcoma 是较少见/较旧的术语，指具有乳头状（指状突起）生长结构的肉瘤（恶性肿瘤）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare medical term for a malignant tumor (a sarcoma) that shows papillary (finger-like) growth patterns under the microscope; the term is uncommon in modern English and is mostly seen in older or specialized pathology writing.","zh":"一个较少见的医学术语，指在显微镜下呈现乳头状（指状突起）生长结构的恶性肿瘤（肉瘤）；在现代英语中不常用，多见于较旧或较专业的病理学文献。"},"examples":[{"en":"The report mentioned papillosarcoma, but the doctor explained that the name is rarely used today.","zh":"报告里提到“papillosarcoma”，但医生解释说这个名称如今很少使用。"},{"en":"In older textbooks, papillosarcoma was sometimes used to describe a sarcoma with papillary features.","zh":"在较旧的教材中，“papillosarcoma”有时用来描述具有乳头状特征的肉瘤。"}]}],"synonyms":["papillary sarcoma","sarcoma with papillary features"],"phonetic":"/pəˌpɪloʊ sɑrˈkoʊmə/","extraExplanation":["词形上可拆解为 papillo-（乳头状的、乳头）+ sarcoma（肉瘤，来源于间叶组织的恶性肿瘤）。因此它强调的是“乳头状结构”这一显微形态，而不一定对应今天某一种标准、常用的肿瘤诊断名称。","现代病理诊断通常更倾向使用更具体、标准化的术语（例如明确的组织来源与分型）。如果你是在检查报告或文献里看到该词，最好结合原文上下文与医生/病理科的解释来理解。"]}
{"word":"papillose","summary":{"en":"Papillose means covered with small nipple-like bumps (papillae), often used in biology and botany.","zh":"Papillose 指表面布满乳头状小突起（乳突），常用于生物学与植物学的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many papillae (small, nipple-like bumps or projections); covered with tiny raised points.","zh":"具乳头状突起的；表面布满细小凸起（乳突）的。"},"examples":[{"en":"Under the microscope, the leaf surface looked papillose rather than smooth.","zh":"在显微镜下，这片叶子的表面呈乳突状，而不是光滑的。"},{"en":"Some orchids have papillose petals that scatter light and appear velvety.","zh":"有些兰花的花瓣带乳突状结构，会散射光线，看起来像天鹅绒一样。"},{"en":"The scientist described a papillose texture along the edge of the tissue sample.","zh":"科学家描述说，这份组织样本边缘有乳突状的质地。"}]}],"synonyms":["papillary","papillate","warty","bumpy"],"phonetic":"ˈpæpɪˌloʊs","extraExplanation":["“papillose”常见于生物学、植物学与解剖学的描述性写作中，用来强调“表面有许多微小突起”，语气比日常的“bumpy（凹凸不平）”更专业、更精确。","词根来自拉丁语 *papilla*（意为“乳头/小突起”）。相关形容词还会看到 *papillate*、*papillary*，都与“乳突状结构”有关。"]}
{"word":"papillosity","summary":{"en":"Papillosity means the presence or quality of having small, nipple-like bumps (papillae) on a surface.","zh":"Papillosity 指表面具有乳头状小突起（papillae）的状态或特征，多用于生物学/医学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition or quality of having papillae (small, nipple-like bumps or projections) on a surface, especially in biology or medicine.","zh":"（生物学/医学）具有乳头状突起（papillae，小而像乳头的凸起）的状态或特征；表面呈乳头状凹凸的性质。"},"examples":[{"en":"Under the microscope, the tissue showed increased papillosity along the epithelial surface.","zh":"在显微镜下，这块组织的上皮表面显示出乳头状突起增多的特征。"},{"en":"The report noted papillosity of the tongue, which can be normal depending on context.","zh":"报告提到舌面的乳头状突起特征；在特定情况下这也可能属于正常表现。"}]}],"synonyms":["papillation","papillarity","papillose texture"],"phonetic":"/ˌpæpɪˈlɑsɪti/","extraExplanation":["词源拆解：papilla（乳头/乳头状突起）+ -osity（“……的性质/状态”）。因此 papillosity 字面意思就是“乳头状结构的性质”。","使用场景：多见于解剖学、组织学、皮肤科/病理描述，用来客观描述表面“有小突起、呈颗粒或乳头状”的形态特征；日常英语中很少用。"]}
{"word":"papillote","summary":{"en":"Papillote most commonly means food baked in a sealed parchment/foil packet (or the packet). It can also mean a hair curl made with wrapping paper, an older styling sense.","zh":"Papillote 最常指“纸包/锡纸包烤”（或那个包）；也可指用纸卷出来的发卷/卷发，属于较旧式的发型用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cooking method where food is wrapped (usually in parchment paper or foil) and baked so it steams in its own juices; also the packet itself.","zh":"一种烹饪方法：把食物（通常用烘焙纸或锡纸）包起来烤，让食物在自身汁液中蒸熟；也可指这种“纸包/锡纸包”。"},"examples":[{"en":"The chef cooked the salmon en papillote with lemon and herbs.","zh":"主厨用纸包法把三文鱼和柠檬、香草一起烤熟。"},{"en":"Open the papillote carefully—the hot steam escapes quickly.","zh":"小心打开纸包/锡纸包——热蒸汽会一下子冒出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A curl or wave of hair shaped by wrapping it (traditionally around paper); also a small paper used for curling hair.","zh":"用缠绕（传统上用纸）做出的发卷/卷发；也可指用于卷发的小纸条。"},"examples":[{"en":"She wore her bangs in neat papillotes for a vintage look.","zh":"她把刘海卷成整齐的纸卷发，呈现复古风。"},{"en":"In old-fashioned styling, hair was set with papillote papers.","zh":"在旧式造型里，人们会用卷发纸来定型。"}]}],"synonyms":["parchment packet","foil packet","paper-wrapped baking","en papillote"],"phonetic":"/ˈpæpəˌloʊt/","extraExplanation":["“Papillote”是法语借词，常见于菜单写法“en papillote”（直译“在纸包里”）。英语里多用于烹饪语境；做法强调“密封包裹→蒸汽加热”，成品通常更嫩、香气更集中。","发型用法偏古典/文学或历史语境；现代更常说“curlers/rollers（卷发器）”。"]}
{"word":"papillous","summary":{"en":"Papillous describes something with many tiny nipple-like bumps (papillae), often used in medical or biological descriptions.","zh":"Papillous 指“具有许多乳头状小突起”的状态，常用于医学或生物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with small, nipple-like projections (papillae); having a bumpy surface because of tiny raised bumps.","zh":"布满乳头状小突起（乳突）的；因许多微小凸起而呈颗粒/凹凸表面的。"},"examples":[{"en":"The doctor noted a papillous surface on the tissue sample.","zh":"医生在组织样本上观察到乳头状的表面。"},{"en":"Some plants have papillous leaves that feel slightly rough.","zh":"有些植物的叶片有乳突状结构，摸起来会有点粗糙。"}]}],"synonyms":["papillary","bumpy","knobby"],"phonetic":"/ˈpæpɪləs/","extraExplanation":["“Papillous”多见于医学、病理学和生物学描述中，意思与“papillary（乳头状的）”很接近，都是从“papilla（乳突/乳头状突起）”派生而来。","学习时可把它理解为“表面有很多细小凸起”，常用来形容组织表面、皮肤、黏膜或植物表皮等的形态特征。"]}
{"word":"papillulate","summary":{"en":"Papillulate describes a surface that has many tiny papillae (small, nipple-like bumps).","zh":"Papillulate 用来形容表面布满许多细小乳突（乳头状小凸起）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Covered with small, nipple-like bumps (papillae); having tiny projections on the surface.","zh":"（生物学）表面布满细小乳突（小凸起）的；有许多微小突起的。"},"examples":[{"en":"Under the microscope, the leaf surface appears papillulate, which helps it shed water.","zh":"在显微镜下，叶片表面呈乳突状，这有助于它把水滴甩开。"},{"en":"Some desert plants have papillulate stems that reduce glare and water loss.","zh":"一些沙漠植物的茎表面有乳突状小突起，可减少反光并降低水分流失。"}]}],"synonyms":["papillose","papillary","bumpy (less technical)"],"phonetic":"/pəˈpɪljəˌleɪt/","extraExplanation":["“papillulate”是较正式、偏科学的词，常见于植物学、动物学与解剖学描述，用来精确说明“表面微观结构”。","它来自“papilla（乳头状突起/乳突）+ -ate（形容词后缀）”，强调“有乳突状结构”，比日常的“bumpy（凹凸不平的）”更专业、更具体。"]}
{"word":"papillule","summary":{"en":"A papillule is a very small nipple-like bump or projection, used mostly in medical descriptions.","zh":"papillule 指非常小的乳头状突起或微小凸起，多用于医学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small, nipple-like projection or bump (especially a tiny papilla on the skin or a mucous membrane).","zh":"（尤指皮肤或黏膜上的）极小乳头状突起；微小凸起。"},"examples":[{"en":"The dermatologist noted a few tiny papillules along the edge of the lesion.","zh":"皮肤科医生注意到病灶边缘有一些细小的乳头状突起。"},{"en":"Under the microscope, the surface showed scattered papillules.","zh":"在显微镜下，表面可见零星的微小乳头状突起。"}]}],"synonyms":["tiny papilla","small projection","minute bump"],"phonetic":"/ˈpæpɪˌluːl/","extraExplanation":["“papillule”在日常英语里很少见，更多出现在医学/皮肤科或显微观察的描述中。","它和更常见的“papule（丘疹）”“papilla（乳头状突起/乳头）”相关：papillule通常强调“更小的乳头状突起”，而papule更偏向“皮肤上的小疙瘩/丘疹”的临床说法。"]}
{"word":"papinachois","summary":{"en":"“papinachois” isn’t a recognized English word; its meaning likely depends on context (often a name/handle or misspelling).","zh":"“papinachois”不是常见英语单词；含义多半依赖语境（常见为名字/网名或拼写错误）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/handle, or a made-up term, so its meaning depends on where you saw it.","zh":"不是标准英语单词。它可能是拼写错误、用户名/网名或自造词，因此含义取决于你看到它的语境。"},"examples":[{"en":"I couldn’t find “papinachois” in a dictionary—do you mean a different word?","zh":"我在词典里找不到“papinachois”——你是不是想写别的词？"},{"en":"“papinachois” appears to be a screen name rather than a common English word.","zh":"“papinachois”看起来更像是网名，而不是常见英语词。"}]}],"extraExplanation":["我目前无法把“papinachois”对应到常见英语词或固定短语。你可以告诉我：1）你在哪看到的（句子/截图/平台）；2）它是不是人名、店名或ID；3）你想表达的可能拼法（比如是否想写“papi nachos / papier mâché / Papi Chulo”等）。给我原句我就能更准确解释。"]}
{"word":"papingo","summary":{"en":"Papingo is an old Scottish word for a parrot, and it can also mean a wooden parrot used as an archery target.","zh":"Papingo 是较古老的苏格兰用语，指“鹦鹉”；也可指射箭比赛中用作靶子的“木鹦鹉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) A parrot; a brightly colored talking bird.","zh":"（苏格兰用语，较古老）鹦鹉；一种色彩鲜艳、可学人说话的鸟。"},"examples":[{"en":"In old Scottish writing, a “papingo” means a parrot kept as a pet.","zh":"在较早的苏格兰文字里，“papingo”指的是被当作宠物饲养的鹦鹉。"},{"en":"The sailor returned with a papingo on his shoulder.","zh":"水手回来时，肩上停着一只鹦鹉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A wooden parrot used as a target in traditional archery contests (similar to a “popinjay”).","zh":"（历史用法）传统射箭比赛中用作靶子的“木鹦鹉”（类似 popinjay 靶）。"},"examples":[{"en":"They practiced by shooting at the papingo set high on a pole.","zh":"他们练习时射向竖在高杆上的木鹦鹉靶。"},{"en":"The festival included a papingo shoot, a very old local tradition.","zh":"节庆活动包含“射木鹦鹉靶”，这是非常古老的地方传统。"}]}],"synonyms":["parrot","popinjay"],"phonetic":"/pəˈpɪŋɡoʊ/","extraExplanation":["“papingo”主要见于苏格兰英语与历史语境中，现代日常英语里更常用 parrot（鹦鹉）。","它与“popinjay”（原意也指鹦鹉、后来也指“靶上的木鹦鹉”）在历史上有关联：一些欧洲地区会把木制鸟（常做成鹦鹉）立在高处，作为射箭或射击比赛的目标。"]}
{"word":"papio","summary":{"en":"Papio is the scientific genus name for baboons.","zh":"Papio 是狒狒的科学属名（狒狒属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for baboons (large Old World monkeys found mainly in Africa).","zh":"（动物学）狒狒属：狒狒的一个科学属名（主要分布在非洲的大型旧大陆猴类）。"},"examples":[{"en":"In biology class, we learned that baboons belong to the genus Papio.","zh":"在生物课上，我们学到狒狒属于狒狒属（Papio）。"},{"en":"Researchers compared the social behavior of Papio species across different habitats.","zh":"研究人员比较了不同栖息地中狒狒属（Papio）物种的社会行为。"}]}],"synonyms":["baboon","genus Papio"],"phonetic":"/ˈpeɪpiˌoʊ/","extraExplanation":["Papio 是拉丁化的学名，用于科学分类（属名）。在正式写作中常以斜体 *Papio* 出现，且属名首字母要大写。","狒狒属（Papio）包含多种狒狒，例如黄狒狒（*Papio cynocephalus*）、橄榄狒狒（*Papio anubis*）、豚尾狒狒（*Papio hamadryas*）等。"]}
{"word":"papion","summary":{"en":"“Papion” is uncommon in English; it is often a misspelling of “papillon,” or it may be a proper name depending on context.","zh":"“Papion”在英语中不常见；常见情况是“papillon”的误拼，或在不同语境下作为专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare spelling variant or misspelling; most often people mean “papillon” (a small dog breed, or the French word for “butterfly”).","zh":"一种很少见的拼写变体或拼写错误；多数情况下人们想表达的是“papillon”（蝴蝶犬，或法语“蝴蝶”）。"},"examples":[{"en":"I searched for “papion,” but the correct spelling is usually “papillon.”","zh":"我搜索了“papion”，但正确拼写通常是“papillon”。"},{"en":"Do you mean the Papillon dog breed?","zh":"你是指蝴蝶犬（Papillon）这个犬种吗？"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (surname, username, or place/brand name), depending on context.","zh":"专有名词（可能是姓氏、用户名，或地名/品牌名等），具体含义取决于语境。"},"examples":[{"en":"Papion appears as a username in several online communities.","zh":"Papion 在一些网络社区里会作为用户名出现。"},{"en":"Please confirm whether “Papion” is a person’s name in this text.","zh":"请确认这段文字里的“Papion”是否是人名。"}]}],"synonyms":["papillon (likely intended)"],"phonetic":"/ˈpæpiˌɑn/","extraExplanation":["“Papion”在标准英语词典中并不常见，所以最实用的做法是先确认你看到它的语境：是在谈狗、蝴蝶、还是某个人名/网名。","如果你想表达“蝴蝶犬/蝴蝶”，常见正确拼写是法语借词“papillon”（英语里也直接用这个拼写）。"]}
{"word":"papiopio","summary":{"en":"“papiopio” isn’t a standard English word; it’s likely a name or a misspelling (possibly “Papio” or “papi”).","zh":"“papiopio”不是标准英语词；更可能是专有名或拼写错误（可能是“Papio”或“papi”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a username, or a proper name. Common close matches include “Papio” (a scientific genus name for baboons) or “papi” (slang for “dad,” often used as a term of address).","zh":"不是标准英语单词；更可能是拼写错误、用户名或专有名。常见的相近词包括“Papio”（狒狒的属名，科学名称）或“papi”（俚语“爸爸/老爸”，也可作称呼）。"},"examples":[{"en":"I can’t find “papiopio” in an English dictionary—did you mean “Papio” or “papi”?","zh":"我在英语词典里查不到“papiopio”——你是想写“Papio”还是“papi”吗？"},{"en":"If you meant “Papio,” it refers to a genus of baboons in scientific writing.","zh":"如果你想写“Papio”，在科学写作中它指“狒狒属”。"}]}],"synonyms":["Papio","papi"],"phonetic":"/ˌpɑpiˈoʊpiˌoʊ/","extraExplanation":["“Papio”是拉丁化的动物分类学名称（属名），通常出现在生物学或动物学语境中，首字母大写并用斜体：*Papio*。","“papi”在美式英语里常见于口语与流行文化中，语气可能带亲昵、调侃或调情意味；在不同文化/关系中使用要注意礼貌与场合。","如果你告诉我你看到“papiopio”的语境（句子、语言、地区/文化背景），我可以更准确判断它到底想表达哪个词或是否来自其他语言。"]}
{"word":"papish","summary":{"en":"“Papish” means relating to the pope or Roman Catholicism, but it is often derogatory and old-fashioned.","zh":"“papish”指与教皇或罗马天主教有关，但多为过时且带贬义的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pope or the Roman Catholic Church; often used in a negative or insulting way.","zh":"与教皇或罗马天主教会有关的；（常带）贬义或侮辱色彩。"},"examples":[{"en":"In some older writings, the author uses “papish” as a slur against Catholics.","zh":"在一些较早的作品中，作者把“papish”当作对天主教徒的辱称。"},{"en":"The pamphlet warned people about “papish” influence in politics.","zh":"那本小册子警告人们提防政治中的“教皇派/天主教”影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A Roman Catholic person (now very old-fashioned and usually offensive).","zh":"天主教徒（现多为过时用法，通常带冒犯性）。"},"examples":[{"en":"The term “papish” was used to label someone as an outsider in that period.","zh":"在那个时期，“papish”常被用来给人贴上“外人”的标签。"}]}],"synonyms":["Catholic","Roman Catholic","papal"],"phonetic":"/ˈpeɪpɪʃ/","extraExplanation":["“papish”来自“pope（教皇）”，历史上在英国等地宗教冲突（尤其新教与天主教对立）背景下常被用作贬称。现代英语中不建议使用，除非是在讨论历史文本、引用原文或进行语言研究；日常表达可用中性词如“Catholic / Roman Catholic”或“papal（与教皇有关的）”。"]}
{"word":"papisher","summary":{"en":"“Papisher” is not standard; it likely means “publisher” (a person or company that publishes content).","zh":"“papisher” 不是标准用词；很可能指 “publisher”（出版者/出版社、发行方）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“Papisher” is not a standard English word; it is most likely a misspelling of “publisher.” A publisher is a person or company that produces and sells books, magazines, newspapers, or other content.","zh":"“papisher” 不是标准英语单词；很可能是 “publisher”（出版者/出版社）的拼写错误。publisher 指负责出版并发行书籍、杂志、报纸或其他内容的个人或公司。"},"examples":[{"en":"She sent her novel to a publisher in New York.","zh":"她把小说寄给了纽约的一家出版社。"},{"en":"The publisher released the book in paperback and hardcover.","zh":"出版社同时推出了平装版和精装版。"}]}],"synonyms":["publishing house","press"],"phonetic":"/ˈpʌblɪʃər/","extraExplanation":["“publisher” 来自动词 “publish”（出版、发表）+ “-er”（表示“做某事的人/物”）。如果你想表达“发表文章的人/机构”，通常也是用 publisher。","如果你是在游戏、软件或广告行业里看到这个词，publisher 也常指“发行商/发布方”（例如：游戏发行商）。"]}
{"word":"papism","summary":{"en":"Papism means Roman Catholic beliefs or practices—often used critically to suggest excessive papal authority.","zh":"Papism 指天主教的信仰或制度，但多用于批评语境，暗示过度强调教皇权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The beliefs, practices, or system of the Roman Catholic Church, especially when viewed (often critically) as giving too much authority to the Pope.","zh":"（常带贬义）对罗马天主教的信仰、制度或做法的称呼，尤指被认为过度强调教皇权威。"},"examples":[{"en":"In some 19th-century pamphlets, the writer attacked papism as a threat to national independence.","zh":"在一些19世纪的小册子中，作者把“papism”抨击为对国家独立的威胁。"},{"en":"The novel reflects the era’s fear of papism and foreign influence.","zh":"这部小说反映了当时社会对“papism”和外来影响的恐惧。"}]},{"partOfSpeech":"n.","definition":{"en":"Support for, or loyalty to, the Pope’s authority in church matters (a less common, more specific sense).","zh":"（较少见、更具体）对教皇在教会事务中权威的拥护或效忠。"},"examples":[{"en":"His opponents accused him of papism because he defended the Pope’s role in church governance.","zh":"反对者指责他有“papism”倾向，因为他为教皇在教会治理中的角色辩护。"}]}],"synonyms":["Roman Catholicism","Catholicism","papalism (related)"],"phonetic":"/ˈpeɪˌpɪzəm/","extraExplanation":["“papism”主要见于宗教争论、历史写作或政治宣传语境，尤其在英美新教传统中常被用作贬义标签，带有“反天主教/反教皇”的立场色彩。现代中性写法更常用 “Roman Catholicism”（天主教）或直接说 “the authority of the Pope”（教皇权威）。","词源上与 “pope（教皇）”相关，后缀 -ism 常表示“主义/体系”。在学术或跨宗教交流中使用时要注意语气与尊重。"]}
{"word":"papist","summary":{"en":"“Papist” means a Roman Catholic or something related to support for the Pope; it is often an old-fashioned, derogatory term.","zh":"“papist”指天主教徒或支持教皇的（事物），多为旧式且常带贬义的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often derogatory) A Roman Catholic; a person seen as supporting the Pope’s authority.","zh":"（常含贬义）天主教徒；（尤指被认为）拥护教皇权威的人。"},"examples":[{"en":"In some older political writings, the author uses “papist” to attack Catholics.","zh":"在一些较早的政治文献里，作者用“papist”来抨击天主教徒。"},{"en":"The term “papist” is usually considered offensive today, so many people say “Catholic” instead.","zh":"“papist”如今通常被认为冒犯，所以很多人会改用“Catholic（天主教徒）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Roman Catholicism or support for the Pope (often negative in tone).","zh":"（常带负面语气）与天主教有关的；支持教皇的。"},"examples":[{"en":"The pamphlet warned readers about “papist” influence in government.","zh":"那本小册子警告读者政府中存在“papist（亲教皇/亲天主教的）”影响。"}]}],"synonyms":["Catholic","Roman Catholic"],"phonetic":"/ˈpeɪpɪst/","extraExplanation":["“papist”来源于“pope（教皇）”。在16–18世纪英国及北美的宗教与政治冲突中，这个词常被新教徒用作贬称，用来强调“听命于罗马/教皇”而非本国政权。","在现代英语里，它通常被视为带有偏见或侮辱性。中性表达一般用“Catholic / Roman Catholic”。","文学与历史语境中仍可能出现该词（如反天主教宣传册、历史小说、政治演讲节选等），阅读时可理解其时代背景与立场色彩。"]}
{"word":"papistic","summary":{"en":"“Papistic” means relating to the Pope or Roman Catholicism, often used historically and sometimes as a negative label.","zh":"“papistic”指与教皇或罗马天主教有关，常见于历史语境，且有时带贬义或攻击性标签色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often historical, sometimes offensive) Relating to the Pope or to Roman Catholicism; “papal.”","zh":"（多为历史用法，有时带冒犯）与教皇或罗马天主教有关的；教皇的／天主教的。"},"examples":[{"en":"In some 17th-century English pamphlets, the writer attacks “papistic” practices.","zh":"在一些17世纪的英文小册子里，作者抨击所谓“papistic（天主教式的）”做法。"},{"en":"The term was used as a political label rather than a neutral description.","zh":"这个词常被当作政治标签使用，而不是中性描述。"}]}],"synonyms":["papal","Roman Catholic","Catholic (context-dependent)"],"phonetic":"/pəˈpɪstɪk/","extraExplanation":["“papistic”源自拉丁语“papa”（教皇）相关词形，常见于英格兰宗教改革后到近代早期的争论文本中，带有强烈的立场色彩。","在现代英语中，这个词比较少用；若需要中性表达，通常改用“papal”（教皇的）或“Roman Catholic”（罗马天主教的）。","由于历史上常被用作贬称或攻击性用语，在当代语境中使用可能被视为不尊重。"]}
{"word":"papistical","summary":{"en":"Papistical means “connected with the Pope or Roman Catholicism,” often with a negative, anti-Catholic tone in older texts.","zh":"papistical 指“与教皇或罗马天主教有关”，在旧文献中常带反天主教的贬义色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pope or to Roman Catholicism; often used in a negative, critical way by opponents.","zh":"与教皇或罗马天主教有关的；常带贬义，用于反对者的批评语境。"},"examples":[{"en":"In some older political writings, the author attacks “papistical” influence in government.","zh":"在一些较早的政治文章里，作者抨击政府中的“教皇派/天主教式”的影响。"},{"en":"The pamphlet used papistical as a label to suggest people were loyal to the Pope instead of the nation.","zh":"那本小册子用 papistical 作为标签，暗示人们效忠教皇而非国家。"}]}],"synonyms":["papal","Roman Catholic","Catholic","ultramontane (often historical)"],"phonetic":"/pəˈpɪstɪkəl/","extraExplanation":["该词多见于16–19世纪的英国/新教语境，常用于反天主教的争论、宣传或政治指控中，因此语气往往带偏见。现代英语里更常用中性表达如 Catholic / papal / Roman Catholic；写作时用 papistical 需要注意语境与礼貌。","词根来自 pope（教皇）及其相关形容词 papist（历史上对天主教徒的称呼，常带贬义）。papistical 比 papal 更容易带“指控/讽刺”色彩。"]}
{"word":"papistically","summary":{"en":"“Papistically” means “in a pro-Pope or Roman Catholic way,” often with a critical, historical tone.","zh":"“papistically”指“以拥护教皇或罗马天主教的方式”，多带历史语境下的批评色彩。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that supports or resembles the Pope or the Roman Catholic Church (often used in a critical or old-fashioned way).","zh":"以支持或类似教皇/罗马天主教会的方式（常带批评或古旧色彩）。"},"examples":[{"en":"Some writers in the past accused their opponents of acting papistically.","zh":"过去有些作者指责对手行事“papistically”（带有拥护教皇/天主教的倾向）。"},{"en":"The pamphlet complained that the new rules were papistically influenced.","zh":"那本小册子抱怨新规定受“papistically”的影响（暗指过于天主教化）。"}]}],"synonyms":["Catholically (neutral, rarer)","in a Catholic way","pro-papal","ultramontanely (more specific/academic)"],"phonetic":"/pəˈpɪstɪkli/","extraExplanation":["“papistically”来自“papist / papistic”，历史上在英美新教语境里常作为贬义词，用来指称“拥护教皇权威、偏向天主教”的立场。现代日常英语中很少用；如果要中性表达，通常改用“Catholically / in a Catholic way”或直接说“in support of the Pope/the Catholic Church”。","在写作或讨论宗教时要注意语气：该词可能让天主教读者感到被贴标签或被贬低，除非是在引用历史材料或分析当时的宗教论战文本。"]}
{"word":"papistlike","summary":{"en":"“Papistlike” means “Catholic-like,” often with an old-fashioned or critical tone.","zh":"“papistlike”意为“像天主教（教皇派）的”，常带旧式或批评语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or characteristic of a Papist (a Roman Catholic), especially in worship style, beliefs, or church authority; often used as a critical or old-fashioned term.","zh":"像“教皇派/天主教徒”（Papist，指罗马天主教徒）的；具有天主教特征的（多指礼拜方式、信仰或教会权威），常带批评或旧式语感。"},"examples":[{"en":"Some writers in the past called the use of incense in church “papistlike.”","zh":"过去有些作者把教堂里使用香（乳香）称为“papistlike（像天主教的）”。"},{"en":"The pamphlet attacked the new ceremony as papistlike and dangerous.","zh":"那本小册子抨击这项新仪式“像天主教的”，并称其很危险。"}]}],"synonyms":["Catholic-like","Roman Catholic-like","papistical"],"phonetic":"/ˈpeɪpɪstˌlaɪk/","extraExplanation":["“papistlike”由“Papist + -like”构成，意思是“像Papist的”。其中 Papist 在英语历史上常被新教作者用来指天主教徒，很多语境里带有贬义或对立色彩；在现代写作中更中性、常见的说法通常是 “Catholic” 或 “Roman Catholic.”","这种词更常见于历史文本、宗教争论、政治宣传（如16–19世纪英国/北美）或模仿旧式语气的文学写作中；日常英语里很少用。"]}
{"word":"papistly","summary":{"en":"“Papistly” means “in a Roman Catholic (‘Papist’) way,” a rare, often old-fashioned and potentially biased adverb.","zh":"“papistly”意为“以（被称为）天主教徒（Papist）的方式”，很少见，常带旧式且可能偏见/敌意的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way associated with Roman Catholic beliefs, practices, or people; “like a Papist” (often used in older or hostile/biased writing).","zh":"以（被称为）“罗马天主教徒（Papist）”的方式；带有天主教色彩地（常见于较旧或带敌意/偏见的表达）。"},"examples":[{"en":"The pamphlet accused the queen of ruling papistly, stirring fear among Protestants.","zh":"这本小册子指控女王以“天主教式”的方式统治，从而在新教徒中煽动恐惧。"},{"en":"Some seventeenth-century writers used words like “papistly” to criticize Catholic rituals.","zh":"一些十七世纪的作者会用“papistly”之类的词来批评天主教仪式。"}]}],"synonyms":["Catholically","in a Catholic way","according to Catholic tradition"],"phonetic":"/ˈpeɪpɪstli/","extraExplanation":["“papistly”来自“Papist（教宗派/天主教徒）+ -ly”。Papist 在英语里历史上常由新教立场的人用来指罗马天主教徒，很多语境带贬义或敌意；因此 papistly 也常出现在争论性、政治宗教对立的旧文本中。","在现代英语里，这个词非常少见且容易冒犯他人；更中性、常用的说法通常是 “Catholically / in a Catholic way / according to Catholic tradition”等，具体看语境。"]}
{"word":"papistries","summary":{"en":"“Patisseries” means French-style pastry shops, or the French pastries/desserts sold there.","zh":"“patisseries”指法式甜点店（也可指法式糕点/甜点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Patisseries: shops (or departments) that sell French-style cakes, pastries, and desserts; also the French pastries/desserts themselves.","zh":"patisseries：法式甜点店（或甜点柜台）；也可指法式糕点、甜点本身。"},"examples":[{"en":"We stopped by a patisserie to buy macarons and a fruit tart.","zh":"我们去了一家法式甜点店买了马卡龙和水果挞。"},{"en":"Paris is full of small patisseries with beautiful window displays.","zh":"巴黎到处都是橱窗陈列很精美的小法式甜点店。"}]}],"synonyms":["pastry shops","bakeries","dessert shops"],"phonetic":"/pəˈtisəri/","extraExplanation":["你输入的“papistries”很可能是拼写错误，常见目标词是 **patisseries**（patisserie 的复数）。","**patisserie** 来自法语，常用于英语里指“法式甜点店/法式甜点”。在美式英语里也有人直接说 **bakery**（面包店）或 **pastry shop**（甜点/酥皮点心店），但 **patisserie** 更强调“法式、精致甜点”。","容易混淆：**pastries**（各种酥皮点心/糕点）指食物本身更常见；**patisseries** 更常指店铺（也可指甜点风格）。"]}
{"word":"papistry","summary":{"en":"Papistry is a historical (often derogatory) term for Roman Catholicism or for doctrines and practices centered on the Pope’s authority.","zh":"Papistry 是历史上（常带贬义）指天主教或以教皇权威为中心的教义与做法的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often derogatory, historical) The Roman Catholic Church, Roman Catholicism, or what some critics saw as “rule by the Pope.”","zh":"（常带贬义，历史用语）指罗马天主教会/天主教，或批评者所说的“教皇统治/教皇势力”。"},"examples":[{"en":"In some old Protestant pamphlets, “papistry” was used as a negative label for Roman Catholicism.","zh":"在一些旧时的新教小册子里，“papistry”被用作对天主教的贬称。"},{"en":"The author accused his opponents of supporting papistry rather than reform.","zh":"作者指责对手支持“教皇势力”，而不是改革。"}]},{"partOfSpeech":"n.","definition":{"en":"The doctrines or practices associated with the Pope’s authority (especially the idea of papal supremacy).","zh":"与教皇权威相关的教义或做法（尤指“教皇至上”的观念）。"},"examples":[{"en":"The debate focused on whether papistry had too much influence over politics.","zh":"争论集中在“教皇权威”是否对政治有过多影响。"},{"en":"Some writers contrasted papistry with local church governance.","zh":"一些作者把“教皇权威体系”与地方教会治理作对比。"}]}],"synonyms":["Roman Catholicism","the Roman Catholic Church","papal authority","papalism (related)"],"phonetic":"/ˈpeɪpɪstri/","extraExplanation":["“papistry”源自“pope（教皇）+ -istry（体系/做法）”。在16—19世纪英国及北美的新教语境中常见，尤其在宗教论战、政治宣传里用来攻击天主教，因此语气往往带强烈偏见。","现代英语中该词较少用于中性描述；在正式或尊重的表达里，通常用“Roman Catholicism / the Roman Catholic Church”来指代天主教。阅读历史文献时遇到该词，需要注意作者立场与时代背景。"]}
{"word":"papists","summary":{"en":"“Papists” means Roman Catholics, but it is often a derogatory historical term; “Catholics” is the neutral modern word.","zh":"“papists”指天主教徒，但常是带贬义的历史用语；现代中性说法是“Catholics（天主教徒）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are Roman Catholics; often used by Protestants as a negative or hostile term, especially in historical or political writing.","zh":"天主教徒（罗马天主教徒）；该词常由新教徒使用，带有贬义或敌意，尤见于历史或政治语境。"},"examples":[{"en":"In some old pamphlets, the writer attacks “papists” and warns readers against the pope’s influence.","zh":"在一些旧传单里，作者抨击“papists（天主教徒）”，并警告读者提防教皇的影响。"},{"en":"Modern historians may quote the word “papists” to show the prejudice of the period.","zh":"现代历史学家可能会引用“papists”一词，用来展示当时的偏见。"},{"en":"Today, it’s usually better to say “Catholics” instead of “papists.”","zh":"在今天，通常用“Catholics（天主教徒）”比用“papists”更合适。"}]}],"synonyms":["Catholics","Roman Catholics"],"phonetic":"/ˈpeɪpɪsts/","extraExplanation":["“Papist”来自“pope（教皇）”。在16—18世纪欧洲宗教改革及其后的英格兰/苏格兰政治与宗教冲突中，这个词常被新教阵营用来指责天主教徒“听命于教皇”，因此带强烈立场色彩。","在阅读历史文献、小说或戏剧（如描写宗教冲突的作品）时，你可能会见到该词；在当代日常交流中它多被视为冒犯性用语，除非是在引用原文或讨论历史语境。"]}
{"word":"papize","summary":{"en":"Papize means to convert someone to Roman Catholicism or to become more Roman Catholic in beliefs or practices (usually historical and often disapproving).","zh":"Papize 指“使（某人）皈依天主教”或“变得更天主教化”（多为历史用语，且常带贬义）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(often disapproving, historical) To make someone become Roman Catholic; to convert to the authority, beliefs, or practices of the Pope.","zh":"（常含贬义，历史用语）使某人皈依天主教；使接受教皇权威或天主教信仰与礼仪。"},"examples":[{"en":"Some Protestant writers accused the king of trying to papize the nation.","zh":"一些新教作家指责国王企图让全国“天主教化”。"},{"en":"The pamphlet warned that schools were being papized through new religious rules.","zh":"那本小册子警告说，学校正通过新的宗教规定被“天主教化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"(historical) To adopt Roman Catholic ideas or practices; to become more Roman Catholic in style.","zh":"（历史用语）采纳天主教的观念或做法；在风格上变得更“天主教化”。"},"examples":[{"en":"Critics said the church was slowly papizing under foreign influence.","zh":"批评者说，这座教会在外来影响下正逐渐“天主教化”。"},{"en":"He feared that traditional worship would papize over time.","zh":"他担心传统礼拜会随着时间推移而“天主教化”。"}]}],"synonyms":["convert (to Catholicism)","Catholicize","romanize (religion context)"],"phonetic":"/ˈpeɪpaɪz/","extraExplanation":["“papize”源自“pope（教皇）/papacy（教皇制度）”。它多见于16–19世纪英语宗教争论语境，尤其在英国宗教改革及其后时期，常被新教作者当作指责对方“向罗马靠拢”的带有强烈立场的词。","现代英语里较少使用；更中性的表达可用“convert to Catholicism（改宗天主教）”“become Catholic（成为天主教徒）”“introduce Catholic practices（引入天主教做法）”。在写作中使用“papize”时要注意其历史色彩与可能的冒犯性。"]}
{"word":"papless","summary":{"en":"“Papless” is a rare, nonstandard adjective meaning “without pap,” often implying something has real substance instead of bland or empty content.","zh":"“Papless”是罕见且非标准的形容词，意为“没有pap”；常用来强调内容有真材实料、不空洞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) Without “pap” (soft food, bland information, or nonsense).","zh":"（罕见/非标准）没有“pap”（可指软烂的食物；也可指缺乏实质内容的“无聊/陈词滥调/废话”）。"},"examples":[{"en":"Some critics called the article papless, saying it had real facts instead of fluff.","zh":"一些评论家说那篇文章“papless”，意思是它有真材实料，而不是空话套话。"},{"en":"He wanted a papless diet of news—just the key details.","zh":"他想要一种“papless”的新闻摄取方式——只要关键信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Without pap (the soft, mushy food sometimes given to babies or people who are ill).","zh":"（极罕见）没有“pap”（一种软烂糊状食物，有时给婴儿或病人吃）。"},"examples":[{"en":"The menu offered papless options for people who preferred firmer foods.","zh":"菜单提供了不含糊状软食（papless）的选择，给更喜欢有口感食物的人。"}]}],"synonyms":["substantial","meaty","no-nonsense","fact-based"],"phonetic":"/ˈpæpləs/","extraExplanation":["“papless”不是常见的标准英语词。你更可能想写的是：\n1) paperless（无纸化的，如 paperless billing 无纸化账单）；\n2) painless（无痛的/轻松的，如 a painless process 轻松的过程）。\n如果你告诉我语境（句子/你想表达的意思），我可以帮你确认正确用词并给出更自然的表达。","“pap”在比喻用法里常指“缺乏营养的内容/空洞的文字”（类似 fluff、drivel）。因此 papless 在少数语境里可被临时造出来表示“没有水分、很硬核”。"]}
{"word":"paplike","summary":{"en":"Paplike means “like pap”: soft and mushy, or (figuratively) lacking substance.","zh":"Paplike 表示“像糊（pap）一样”：软烂成糊；也可引申为内容空洞、缺乏实质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling pap (soft, bland food such as porridge or mush); soft, mushy, or lacking substance.","zh":"像“pap”（糊状/粥状的清淡食物）一样的；软烂成糊的；（引申）缺乏实质内容的。"},"examples":[{"en":"The overcooked vegetables turned paplike and watery.","zh":"蔬菜煮过头后变得软烂成糊，而且水汪汪的。"},{"en":"Some critics called the speech paplike because it was full of clichés and no real plans.","zh":"有些评论者说这场演讲“像糊一样”，因为充满陈词滥调，却没有实际计划。"}]}],"synonyms":["mushy","pasty","bland","insipid","watery"],"phonetic":"/ˈpæpˌlaɪk/","extraExplanation":["“paplike”并不常见，更常写作“pap-like”。其中“pap”本义可指给婴儿或病人吃的稀粥/糊状软食，因此“paplike”常用来形容食物“软烂无形”。","在比喻用法里，“pap”也可指“空洞、缺乏营养的内容”（例如某些媒体内容或讲话），所以“paplike”可以委婉或带批评地表示“没料、没深度”。"]}
{"word":"papmeat","summary":{"en":"Papmeat is a rare word meaning soft, mushy, pap-like food.","zh":"Papmeat 是个罕见词，指软烂成糊状、像粥/泥一样的食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Soft, mushy food; food reduced to a pap-like paste (similar to porridge or purée).","zh":"（罕见）糊状的食物；被煮烂、捣碎成“粥/糊”一样的食物（类似稀粥或泥状食物）。"},"examples":[{"en":"After boiling the vegetables too long, they turned into papmeat.","zh":"蔬菜煮得太久，就变成了一团糊状物。"},{"en":"The baby could only eat papmeat for a few days after the surgery.","zh":"手术后几天，宝宝只能吃糊状食物。"}]}],"synonyms":["mush","porridge","puree","gruel","baby food"],"phonetic":"/ˈpæpˌmit/","extraExplanation":["“papmeat”不是现代英语里的常用词，更像是由 pap（稀粥/糊；也可指软烂的食物）+ meat（这里泛指“食物/可吃的东西”）拼成的旧式或临时用法。日常表达通常会用 mush, porridge, puree, baby food 等。","如果你是在某篇文章/小说里看到这个词，也可能是作者为了强调“软烂、缺乏嚼劲、像糊一样”的口感而创造或使用的复合词。"]}
{"word":"papolater","summary":{"en":"“papolater” is nonstandard slang used like “see/talk to you later.”","zh":"“papolater”是非标准的俚语/网聊写法，用法类似“回头见/回头聊”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal, nonstandard texting) A playful way to say “talk/see you later”; used as a casual goodbye.","zh":"（非正式、非标准的短信写法）一种俏皮的说法，表示“回头再聊/回头见”；用作随意的告别。"},"examples":[{"en":"Gotta run—papolater!","zh":"我得走了——papolater（回头聊）！"},{"en":"I’ll message you after class, papolater.","zh":"下课后我给你发消息，papolater（回头见）。"}]}],"synonyms":["see you later","talk to you later","catch you later","TTYL"],"phonetic":"/ˌpɑpoʊˈleɪtər/","extraExplanation":["“papolater”不是标准英语单词，更像是把口语告别语（如“’posed to / talk / see you later”一类）用俏皮方式连写出来的网络写法。不同圈子可能有不同拼法与用法。","更常见、别人更容易看懂的写法包括：“talk to you later / see you later / catch you later / ttyl”。"]}
{"word":"papolatrous","summary":{"en":"“Papolatrous” means excessively devoted to the Pope or papacy, often in a critical tone.","zh":"“papolatrous”指对教皇/教廷过度崇拜或盲目忠诚，常带批评语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing excessive devotion or unquestioning loyalty to the Pope or the papacy (often used critically).","zh":"对教皇或教廷表现出过度崇拜或不加质疑的忠诚（常带贬义或批评意味）。"},"examples":[{"en":"Some critics called the politician’s views papolatrous, saying he always sided with the Vatican.","zh":"一些批评者称这位政治家的观点是“papolatrous”（教皇崇拜式的），认为他总是站在梵蒂冈一边。"},{"en":"The article attacks papolatrous attitudes rather than Catholic faith itself.","zh":"这篇文章批评的是“papolatrous”的态度，而不是天主教信仰本身。"}]}],"synonyms":["ultramontane","papist (often derogatory)","idolatrous (figurative)","uncritical","blindly loyal"],"phonetic":"/ˌpæpəˈleɪtrəs/","extraExplanation":["这个词来自“papal（教皇的）”+ “-latrous”（源自希腊语，意为“崇拜/敬奉”，也见于 idolatrous“偶像崇拜的”）。因此 papolatrous 常带有“把教皇当作几乎不可质疑的权威来崇拜”的批判色彩。","多见于宗教辩论、历史与政治评论语境，尤其在英语世界的宗教争论传统中，用来指责对教皇权威的“过度服从/迷信式拥护”。使用时注意语气可能冒犯他人信仰立场。"]}
{"word":"papolatry","summary":{"en":"Papolatry means excessive, worship-like devotion to the Pope, usually said in a critical way.","zh":"papolatry 指对教皇过度、近乎敬拜式的崇拜与拥护，通常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive devotion to, or worship-like reverence for, the Pope (often used critically).","zh":"对教皇过度崇拜或近乎“敬拜式”的尊奉（常带批评色彩）。"},"examples":[{"en":"Some critics accused the group of papolatry, claiming it treated the Pope as beyond question.","zh":"一些批评者指责该团体有“教皇崇拜”，认为他们把教皇视为不可质疑。"},{"en":"The article argued that healthy Catholic faith is different from papolatry.","zh":"文章认为，健康的天主教信仰不同于“教皇崇拜”。"}]}],"synonyms":["ultramontanism (related, historical)","excessive papal devotion","(pejorative) pope-worship"],"phonetic":"/pəˈpɑlətri/","extraExplanation":["这个词很少在日常英语中使用，多见于宗教争论或历史写作中，语气往往偏负面（暗示“盲从”“过度神化”）。","词形由“pap-（pope，教皇）+ -latry（崇拜，如 idolatry 偶像崇拜）”构成，因此常用来类比“idolatry（偶像崇拜）”。在表达时要注意语境与礼貌：若在跨宗教/跨文化交流中使用，可能显得冒犯。"]}
{"word":"papoose","summary":{"en":"“Papoose” means a baby (especially in older references to Native Americans) or a baby carrier, but the word can feel dated or culturally insensitive today.","zh":"“papoose”可指（旧用法中）原住民婴儿/幼儿，或指婴儿背带；但如今常被视为过时且可能不够文化敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A North American Indigenous baby, or a young child (often considered old-fashioned and can be culturally insensitive today).","zh":"（旧用法）北美原住民的婴儿或幼儿；此用法如今常被认为过时且可能带有文化不敏感。"},"examples":[{"en":"In older books, the word “papoose” was sometimes used to mean a Native American baby.","zh":"在较早的书里，“papoose”有时被用来指原住民的婴儿。"},{"en":"Many modern writers avoid this word and instead say “baby” or name the specific nation when relevant.","zh":"许多现代作者会避免使用这个词，而改用“baby/婴儿”，或在需要时直接写明具体部族/民族名称。"}]},{"partOfSpeech":"n.","definition":{"en":"A soft carrier for carrying a baby on a parent’s back or chest; a baby sling/back carrier (also somewhat dated compared with “baby carrier”).","zh":"用来把婴儿背在背上或抱在胸前的软式背带/婴儿背带（也较常用更中性的说法如“baby carrier”）。"},"examples":[{"en":"She carried the baby in a soft carrier on her back.","zh":"她用软式背带把宝宝背在背上。"},{"en":"The catalog described it as a “papoose,” but today most people would call it a baby carrier.","zh":"目录把它写成“papoose”，但现在大多数人会称之为婴儿背带（baby carrier）。"}]}],"synonyms":["baby","infant","child","baby carrier","baby sling"],"phonetic":"/pəˈpus/","extraExplanation":["这个词来自阿尔冈昆语系中的某些语言（常被认为与“儿童/婴儿”的意思有关），后来被英语借用。在当代语境中，用它泛指原住民婴儿可能让人感觉把多元的原住民族群“概括化/刻板化”，因此更建议使用“baby”，或在需要时写明具体部族/民族名称（例如 Navajo、Cherokee 等，视情境而定）。","文学与流行文化中（尤其是较早的儿童读物、西部题材作品）偶尔会出现该词；现代出版物通常会改用更中性的表达，以避免不必要的文化冒犯。"]}
{"word":"papooseroot","summary":{"en":"“Papooseroot” usually means “papoose root,” a common name for blue cohosh, a North American plant used historically in herbal medicine.","zh":"“papooseroot”通常指“papoose root”，多为蓝升麻（blue cohosh）的俗名，是一种北美植物，历史上曾用于草药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also written “papoose root” or “papoose-root”) A North American woodland plant whose root has been used in traditional herbal medicine; most commonly this name refers to **blue cohosh** (*Caulophyllum thalictroides*).","zh":"（也写作 papoose root / papoose-root）一种北美林地植物，其根在传统草药中曾被使用；该名称最常指 **蓝升麻/蓝独活**（blue cohosh，*Caulophyllum thalictroides*）。"},"examples":[{"en":"Some herbal books list blue cohosh as “papoose root.”","zh":"一些草药书把 blue cohosh 记作“papoose root”。"},{"en":"The plant called papoose root grows in shady forests in eastern North America.","zh":"被称为“papoose root”的植物生长在北美东部的阴湿林地里。"},{"en":"Do not use papoose root without medical guidance; it can be harmful.","zh":"不要在没有医疗指导的情况下使用“papoose root”；它可能有害。"}]}],"synonyms":["papoose root","papoose-root","blue cohosh"],"phonetic":"/pəˈpuːs ruːt/","extraExplanation":["“papoose”一词源自美洲原住民语言（Algonquian 语系），历史上被英语借用来指“婴儿”。在现代英语里，用它称呼原住民婴儿可能被视为过时或不尊重；但在一些旧的植物名、草药名中仍会出现。","在草药语境中，“papoose root”常与助产/催产的民间用法联系在一起，但蓝升麻（blue cohosh）被报告可能引发不良反应，尤其对孕期与新生儿风险更高；学习词义即可，切勿自行服用。"]}
{"word":"papooses","summary":{"en":"“Papooses” is the plural of “papoose,” meaning children (in older, sometimes insensitive usage) or a baby carrier.","zh":"“papooses”是“papoose”的复数，可指孩子（较旧且可能不够尊重的用法），也可指背婴带/婴儿背带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of papoose: a young child (especially in older or stereotyped use), or a soft carrier used to carry a baby on an adult’s back or chest.","zh":"papoose 的复数：指幼儿（尤其在较旧或带刻板印象的用法中），也可指用来背/抱婴儿的软式背带、背婴带。"},"examples":[{"en":"The museum text used the word “papooses,” but today many people avoid it and say “children” instead.","zh":"博物馆说明牌用了“papooses”这个词，但现在很多人会避免使用，改说“children（孩子们）”。"},{"en":"Some outdoor brands used to advertise baby carriers as “papooses.”","zh":"一些户外品牌过去会把背婴带宣传为“papooses”。"}]}],"synonyms":["children","kids","babies","baby carriers"],"phonetic":"/pəˈpus/","extraExplanation":["“papoose”源自阿尔冈昆语系的词（经由早期殖民时期的英语借用），历史上常被用来指美洲原住民的孩子。由于它在英语里长期与刻板印象、过时的描写方式相连，如今在指“原住民孩子”时可能被认为不尊重或冒犯；更中性的说法是用“child/children（孩子）”“baby/babies（婴儿）”，若需具体可用“Indigenous child/children（原住民孩子）”。","在表示“背婴带/背带”这一物品义时，现代英语更常用“baby carrier”“child carrier”“back carrier”等。"]}
{"word":"papoosh","summary":{"en":"Papoosh means a soft slipper; less commonly, a protective shoe covering.","zh":"papoosh 指软拖鞋；较少见时也指保护鞋子的鞋套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft slipper (often a flat, backless house shoe); sometimes used for a decorative or traditional style of slipper.","zh":"软拖鞋（常指平底、无后跟的家居拖鞋；也可指装饰性或传统风格的拖鞋）。"},"examples":[{"en":"She kicked off her boots and slipped into her warm papooshes by the door.","zh":"她踢掉靴子，在门口换上暖和的软拖鞋。"},{"en":"In the boutique, they sold embroidered papooshes made of leather.","zh":"那家精品店卖刺绣皮质软拖鞋。"}]},{"partOfSpeech":"n.","definition":{"en":"a loose covering worn over a shoe to protect it (a less common use).","zh":"套在鞋外面的松软鞋套，用来保护鞋子（较少见）。"},"examples":[{"en":"He put on rubber papooshes to keep his shoes dry in the rain.","zh":"他套上橡胶鞋套，雨天好让鞋子保持干燥。"}]}],"synonyms":["slipper","house slipper","mule (slipper)","shoe cover","overshoe"],"phonetic":"/pəˈpuʃ/","extraExplanation":["“papoosh”在英语里较少见，更常见的拼写是“papoo(s)h”或“papoosh/papush”等变体。","词源上常被认为来自中东与南亚地区的词（如波斯语/土耳其语一类表示“鞋、拖鞋”的词），因此在描述传统服饰、旅行见闻或异域风格商品时更可能出现。","注意不要与“papoose”（指北美原住民婴儿或背婴方式的旧称）混淆；两者拼写相近但意思不同。"]}
{"word":"papoula","summary":{"en":"“Papoula” is Portuguese for “poppy” (a poppy flower).","zh":"“papoula”是葡萄牙语，意思是“poppy（罂粟花/虞美人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Portuguese) a poppy; a poppy flower (often the bright red wild poppy).","zh":"（葡萄牙语）罂粟花；虞美人（常指鲜红色的野生罂粟花）。"},"examples":[{"en":"In Portuguese, “papoula” usually means “poppy.”","zh":"在葡萄牙语里，“papoula”通常就是“poppy（罂粟花/虞美人）”。"},{"en":"The field was full of red papoulas in spring.","zh":"春天时，田野里开满了红色的虞美人。"}]}],"synonyms":["poppy"],"phonetic":"/pəˈpaʊlə/","extraExplanation":["“papoula”不是常见英语词；在英语语境中更常写作“poppy”。如果你在英文文章里看到“papoula”，多半是作者保留了葡语/西语色彩，或在描述葡语国家（如葡萄牙、巴西）的植物与文化。","在一些语境里，“poppy/罂粟”可能让人联想到鸦片（opium poppy），但日常提到花时通常是观赏性的“poppy（虞美人/罂粟花）”。阅读时可根据上下文判断是否涉及药用或历史话题。"]}
{"word":"papovavirus","summary":{"en":"Papovavirus is an outdated term for viruses once grouped together (papillomaviruses and polyomaviruses).","zh":"Papovavirus 是旧术语，指曾被归为同一类的病毒（主要包括乳头瘤病毒和多瘤病毒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a virus once grouped in the former “Papovaviridae” family, including papillomaviruses and polyomaviruses (the term is now outdated in modern taxonomy).","zh":"（旧分类）“乳头瘤-多瘤病毒科（Papovaviridae）”中的病毒，主要包括乳头瘤病毒和多瘤病毒（该名称在现代病毒分类中已基本淘汰）。"},"examples":[{"en":"In older textbooks, human papillomavirus (HPV) was sometimes described as a type of papovavirus.","zh":"在较旧的教材中，人乳头瘤病毒（HPV）有时被描述为一种 papovavirus（乳头瘤-多瘤病毒）。"},{"en":"Modern virology no longer uses “papovavirus” as an official family name.","zh":"现代病毒学不再把 “papovavirus” 当作正式的科名来使用。"}]}],"synonyms":["Papovaviridae (obsolete)","papillomavirus","polyomavirus"],"phonetic":"/ˌpæp.oʊˈvɑːr.əˌvaɪr.əs/","extraExplanation":["“Papovavirus”这个词来自早期的拼合命名：PA（papilloma，乳头瘤）+ PO（polyoma，多瘤）+ VA（vacuolating，指细胞出现空泡样变化）。后来随着基因组与结构研究更清楚，乳头瘤病毒与多瘤病毒被分开归入不同的科，因此该术语多见于旧文献。"]}
{"word":"pappain","summary":{"en":"Papain is a protein-breaking enzyme from papaya, commonly used as a meat tenderizer.","zh":"Papain（木瓜蛋白酶）是来自木瓜、能分解蛋白质的酶，常用于嫩肉等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Papain: an enzyme from the papaya fruit that breaks down proteins; used in meat tenderizers and sometimes in medicine or cosmetics.","zh":"木瓜蛋白酶：从木瓜中提取的一种酶，能分解蛋白质；常用于嫩肉粉，也用于某些药品或化妆品中。"},"examples":[{"en":"This meat tenderizer contains papain to help soften tough cuts.","zh":"这种嫩肉粉含有木瓜蛋白酶，能帮助软化较硬的肉块。"},{"en":"Some people are allergic to papain, especially if they are sensitive to latex or papaya.","zh":"有些人会对木瓜蛋白酶过敏，尤其是对乳胶或木瓜敏感的人。"}]}],"synonyms":["protease","papaya enzyme"],"phonetic":"/pəˈpeɪ.ən/","extraExplanation":["你输入的“pappain”更常见的正确拼写是“papain”。发音重音在第二个音节：pa-PAIN。","papain常见于食品加工（嫩肉、澄清饮料等）和护肤/清洁类产品；如果你在配料表看到它，通常表示“蛋白分解酶”。","过敏提示：少数人可能对papain刺激或过敏；与乳胶-水果交叉过敏（如木瓜、香蕉、牛油果等）有时有关。"]}
{"word":"pappea","summary":{"en":"“pappea” is usually a misspelling of Poppaea/Poppea, a Roman historical name (Poppaea Sabina, Nero’s wife).","zh":"“pappea” 通常是 Poppaea/Poppea 的拼写误写；它是一个古罗马历史人物名字（波帕埃娅·萨宾娜，尼禄之妻）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) Poppaea (also spelled Poppaea/Poppea): a woman of ancient Rome, best known as Poppaea Sabina, the second wife of Emperor Nero (1st century CE).","zh":"（专有名词）Poppaea（也拼作 Poppaea/Poppea）：古罗马女性人物，最著名的是波帕埃娅·萨宾娜（Poppaea Sabina），罗马皇帝尼禄在公元1世纪的第二任妻子。"},"examples":[{"en":"Poppaea Sabina is often portrayed in histories as influential at Nero’s court.","zh":"历史著作中常把 Poppaea Sabina 描写成在尼禄宫廷里很有影响力的人物。"},{"en":"Monteverdi’s opera The Coronation of Poppea features Poppaea as a central character.","zh":"蒙特威尔第的歌剧《波佩亚的加冕》（The Coronation of Poppea）里，Poppaea 是核心人物。"}]},{"partOfSpeech":"other","definition":{"en":"A likely misspelling of “Poppaea/Poppea”; “pappea” is not a standard English word.","zh":"很可能是对 “Poppaea/Poppea” 的拼写错误；“pappea” 并不是标准英文单词。"},"examples":[{"en":"Did you mean Poppaea (Poppea), the historical figure connected to Emperor Nero?","zh":"你是想写 Poppaea（Poppea）吗——那位与罗马皇帝尼禄有关的历史人物？"}]}],"synonyms":["Poppaea","Poppea","Poppaea Sabina"],"phonetic":"/pɑˈpiːə/","extraExplanation":["“Poppaea” 来自拉丁语拼写；英文与艺术作品中常见变体包括 Poppaea 与 Poppea（意大利语形式更常见于歌剧标题）。","如果你是在读历史或看歌剧资料，建议用 “Poppaea Sabina” 来指尼禄的妻子；用 “Poppea” 则更贴近歌剧语境（如《L’incoronazione di Poppea》）。"]}
{"word":"pappenheimer","summary":{"en":"Pappenheimer most often means someone whose behavior you know well (often said ironically). Historically, it refers to a soldier from Count von Pappenheim’s cavalry.","zh":"Pappenheimer 常指“你很了解其德行/行为的人”（常带一点讽刺）；历史上也指帕彭海姆伯爵麾下的骑兵士兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in the plural) A person (or group of people) whose character, habits, or likely behavior you know well—sometimes said with irony or mild distrust.","zh":"（常用复数）你很了解其性格、习惯或可能行为的人（或一群人）；有时带讽刺或不太信任的语气。"},"examples":[{"en":"Don’t worry—if he tries to cause trouble, I know my Pappenheimers.","zh":"别担心——要是他想惹事，我了解这种人会怎么做。"},{"en":"She smiled and said, “I know my Pappenheimers,” meaning she wasn’t fooled by their excuses.","zh":"她笑着说“我知道这些人是什么德行”，意思是她不会被他们的借口骗到。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Pappenheim cavalry (cuirassiers) in the Thirty Years’ War; historically, a soldier serving under Count Gottfried Heinrich von Pappenheim.","zh":"（历史）帕彭海姆骑兵（胸甲骑兵）的一员；三十年战争时期在帕彭海姆伯爵麾下作战的士兵。"},"examples":[{"en":"In the play, the Pappenheimers are portrayed as fiercely loyal soldiers.","zh":"在这部戏里，帕彭海姆的士兵被描写为极其忠诚的战士。"}]}],"synonyms":["the usual suspects","that type","those people","someone I know well"],"phonetic":"/ˈpɑpənˌhaɪmər/","extraExplanation":["这个词的“成语式”用法主要来自德国诗人席勒（Friedrich Schiller）的戏剧《瓦伦斯坦之死》（Wallensteins Tod）。剧中有句著名台词大意是“我了解我的帕彭海姆人”（Ich kenne meine Pappenheimer），原本指将领很了解自己手下的士兵；后来在日常语境里常被引申为“我太了解你们这类人了”，有时带一点讽刺或看穿对方意图的意味。"]}
{"word":"pappescent","summary":{"en":"Pappescent means becoming soft and pulpy (mushy), often from heat, decay, or overcooking.","zh":"pappescent 指“逐渐变得软烂成糊状（糊糊的）”，常因高温、腐坏或煮过头等导致。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) becoming soft, pulpy, or mushy; turning into a paste-like state.","zh":"（罕见）变得柔软、糊状或烂熟的；逐渐变成糊糊（膏状）的。"},"examples":[{"en":"In the heat, the berries quickly became pappescent and hard to transport.","zh":"在高温下，这些浆果很快变得糊烂，不好运输。"},{"en":"The overcooked vegetables were pappescent rather than crisp.","zh":"蔬菜煮过头后变得软烂成糊，而不是爽脆的。"},{"en":"After days in the fridge, the cut fruit turned pappescent and watery.","zh":"切好的水果在冰箱里放了几天后变得软烂、出水。"}]}],"synonyms":["mushy","pulpy","softening","pulping","soggy"],"phonetic":"/pæˈpɛsənt/","extraExplanation":["这个词非常少见，多见于较正式或学术语境（如植物学、食品描述、旧式写作）里，用来强调“逐渐变软烂、呈糊状”的变化过程。日常英语更常用 mushy、pulp(y)、soft、soggy 等。","词源可追溯到拉丁语 pappescere（“变成糊状/变软”），与 pap（稀粥、糊状物）有关。"]}
{"word":"pappier","summary":{"en":"“Pappier” means more mushy/soft like pulp, or (figuratively) more overly sentimental.","zh":"“pappier”表示更软烂、更糊状；也可比喻更矫情、更煽情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “pappy”) softer, mushier, or more like wet pulp (pap).","zh":"（“pappy”的比较级）更软烂的；更糊状的；更像湿浆（糊糊）的。"},"examples":[{"en":"Cook the vegetables longer if you want them pappier.","zh":"如果你想让蔬菜更软烂，就再煮久一点。"},{"en":"The rice got pappier after sitting in the pot.","zh":"米饭在锅里放了一会儿后变得更糊更软了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) more sentimental, overly sweet, or emotionally gushy.","zh":"（比喻）更感伤的；更矫情的；更肉麻的。"},"examples":[{"en":"As he got older, his messages became pappier and more emotional.","zh":"随着年纪增长，他的留言变得更感伤、更肉麻。"},{"en":"The movie’s ending is pappier than I expected.","zh":"这部电影的结局比我想的更煽情。"}]}],"synonyms":["mushier","softer","more pulpy","gushier","more sentimental"],"phonetic":"ˈpæpiər","extraExplanation":["“pappier”不算常用词，更多见的是“mushier / softer / more sentimental”。“pap”原指婴儿吃的软糊食物（类似米糊/麦片糊），因此“pappy”有“像糊一样软烂”的意思，也可引申为“感情上过于软、过于甜腻”。","如果你原本想拼的是“happier（更开心的）”或“papery（像纸一样的）”，告诉我句子语境我可以帮你确认。"]}
{"word":"pappies","summary":{"en":"“Pappies” means fathers or (more often) grandfathers in a warm, informal way.","zh":"“pappies”指“爸爸们”或（更常见）“爷爷/外公们”，语气亲切、非正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pappy”: an informal, affectionate word for a father or (more commonly) a grandfather.","zh":"“pappy”的复数：非正式、带亲昵称呼的“爸爸”或（更常见）“爷爷/外公”。"},"examples":[{"en":"All the kids ran to hug their pappies after the game.","zh":"比赛结束后，孩子们都跑去拥抱他们的爸爸/爷爷们。"},{"en":"My pappies used to tell stories about growing up on a farm.","zh":"我的爷爷/外公们以前常讲他们在农场长大的故事。"}]}],"synonyms":["dads","grandpas","papas","fathers (formal)","grandfathers (formal)"],"phonetic":"ˈpæpiz","extraExplanation":["“pappy/pappies”多见于美式口语，尤其在美国南部/乡村语境里，语气亲切随意；在正式写作中一般用“father/grandfather”。","在流行文化中，“Pappy”也常让人联想到波本威士忌品牌“Pappy Van Winkle”（专有名词），但这与日常称呼的“pappy”不是一回事。"]}
{"word":"pappiest","summary":{"en":"“Pappiest” means “most pappy”: either the most fatherly/old-fashioned (humorous) or the most soft and mushy (especially of food).","zh":"“pappiest”是“pappy”的最高级：要么指最“老爹/长辈范儿”（常带幽默），要么指最软烂、最糊状（多形容食物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of pappy) most like a fatherly, old-fashioned, or “grandpa-ish” person; often used humorously.","zh":"（pappy 的最高级）最像“爸爸/老爹/爷爷”那种感觉的；很有长辈气质、老派的（常带幽默语气）。"},"examples":[{"en":"He wears suspenders, tells corny jokes, and carries candy for kids—he’s the pappiest guy in the office.","zh":"他穿背带裤、讲老掉牙的笑话、还给孩子带糖——他简直是办公室里最“老爹范儿”的人。"},{"en":"That was the pappiest advice: “Get some rest and drink water.”","zh":"那建议太“老爹”了：“去睡一觉，多喝水。”"}]},{"partOfSpeech":"adj.","definition":{"en":"(Superlative of pappy) softest or most mushy (used especially for food); like wet pulp.","zh":"（pappy 的最高级）最软烂、最糊状的（常用于形容食物）；像湿软的浆糊。"},"examples":[{"en":"The bananas were the pappiest ones in the bunch—perfect for banana bread.","zh":"那串香蕉里它最软烂——做香蕉面包正合适。"},{"en":"I don’t like oatmeal when it gets pappiest and bland.","zh":"我不喜欢燕麦粥变得又糊又淡的时候。"}]}],"synonyms":["most fatherly","most grandpa-ish","most old-fashioned","softest","mushiest"],"phonetic":"ˈpæpiəst","extraExplanation":["“pappy”在美式英语里也可作名词，口语指“爸爸/老爹/老头儿”（有时带亲昵或玩笑语气）。因此“pappiest”常被用来调侃某人的言行很“长辈式”。","另外，“Pappy”也常让人联想到美国著名波本威士忌品牌 *Pappy Van Winkle*；但“pappiest”这个词本身通常不是在说酒，除非上下文明确。"]}
{"word":"pappiferous","summary":{"en":"Pappiferous describes seeds/fruits that have a pappus (tuft of hairs/bristles) for dispersal.","zh":"Pappiferous 指种子或果实“具冠毛的”，常用于描述帮助传播的毛状/刺状结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having or bearing a pappus (a tuft or ring of hairs/bristles on certain seeds, helping them disperse by wind).","zh":"（植物学）具冠毛的；带有冠毛的（某些种子上的毛状或刺状结构，常帮助随风传播）。"},"examples":[{"en":"Dandelion seeds are pappiferous, so they can be carried easily by the wind.","zh":"蒲公英的种子是具冠毛的，所以很容易被风带走。"},{"en":"The botanist noted that the achenes were pappiferous, a common trait in the daisy family.","zh":"植物学家指出这些瘦果具冠毛，这是菊科植物常见的特征。"}]}],"synonyms":["pappose","pappus-bearing"],"phonetic":"/pæˈpɪfərəs/","extraExplanation":["这是一个较少见的学术词，多用于植物分类或形态描述。常见于菊科（Asteraceae）等植物：冠毛（pappus）可以是绒毛、细刺或鳞片，功能多与种子传播有关。词根上来自 pappus（冠毛）+ -ferous（“带有……的”）。"]}
{"word":"pappiform","summary":{"en":"“Pappiform” means pappus-like—having a tuft of fine hairs or bristles like the fluff on certain seeds.","zh":"“pappiform”意为“冠毛状的”，指像某些种子上细毛/刺毛形成的绒毛结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pappus (a tuft, plume, or ring of fine hairs/bristles) like the “fluff” on some seeds, especially in the daisy family (Asteraceae).","zh":"呈冠毛状的；像冠毛（种子上细毛/刺毛形成的绒毛、羽状或环状结构）的，常用于描述菊科植物的种子结构。"},"examples":[{"en":"Dandelion seeds have a pappiform tuft that helps them float on the wind.","zh":"蒲公英种子有冠毛状的绒毛，帮助它们随风飘散。"},{"en":"The botanist described the fruit as bearing pappiform bristles.","zh":"植物学家描述这种果实带有冠毛状的刺毛。"}]}],"synonyms":["pappus-like","tufted","feathery"],"phonetic":"/ˈpæpəˌfɔrm/","extraExplanation":["“pappiform”主要见于植物学、分类学描述中：pappus（冠毛）是很多菊科植物瘦果顶端的附属物，能帮助种子传播（风传播最常见）。","词形上由 pappus（冠毛）+ -form（……形状的）构成，意思直观就是“像冠毛一样的”。"]}
{"word":"pappoose","summary":{"en":"“Pappoose” is a dated term for a Native American baby, and it can also mean a cradleboard used to carry a baby.","zh":"“pappoose”多被视为过时用法，指美洲原住民的婴儿；也可指用于背婴儿的摇篮板式背架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often considered dated; may be seen as insensitive) a Native American baby or young child.","zh":"（常被认为是过时用法；可能被视为不够尊重）美洲原住民的婴儿或幼儿。"},"examples":[{"en":"Older books sometimes use the word “pappoose” to mean a Native American baby.","zh":"一些较早的书里会用“pappoose”来指美洲原住民的婴儿。"},{"en":"In respectful writing today, it’s usually better to say “a baby” or name the child’s specific tribe or nation if relevant.","zh":"在当代更尊重的写法中，通常更建议直接说“a baby（婴儿）”，或在合适时注明孩子所属的具体部族/民族。"}]},{"partOfSpeech":"n.","definition":{"en":"a cradleboard or carrier used to carry a baby (especially in some Native American cultures).","zh":"（尤指某些美洲原住民文化中的）婴儿背板/摇篮板式背架，用来背负婴儿。"},"examples":[{"en":"The museum displayed a traditional cradleboard sometimes labeled as a “pappoose board.”","zh":"博物馆展出了传统的摇篮板，有时会被标注为“pappoose board”。"},{"en":"Many communities have their own names and designs for baby carriers.","zh":"许多族群都有各自对婴儿背具的称呼与设计。"}]}],"synonyms":["papoose","baby","infant","cradleboard"],"phonetic":"/pəˈpus/","extraExplanation":["“pappoose / papoose”源自阿尔冈昆语族相关语言的借词，最初指“孩子/婴儿”。在英语里长期被泛化为“印第安婴儿”，也常出现在旧小说、西部片或早期儿童读物中。","因为它把不同部族一概而论，并且常带有刻板印象色彩，现代写作与日常交流中有时会被认为不够尊重或显得过时。更中性的选择是直接说“baby/infant”，或在需要时使用具体部族/民族名称与其自称（如 Navajo/Diné 等）。"]}
{"word":"pappooses","summary":{"en":"“Pappooses” usually means the plural of “papoose”: an old term for a Native American baby, and sometimes a cradleboard baby carrier; it can be outdated or offensive, so prefer “baby” or “cradleboard.”","zh":"“pappooses”通常是“papoose”的复数：旧时指北美原住民的婴儿，也可指摇篮板等婴儿背具；该词可能过时或带冒犯性，建议用“baby/infant”或“cradleboard”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American baby (now often considered old-fashioned, and sometimes offensive if used broadly)","zh":"（旧用）北美原住民的婴儿（如今常被视为过时，用得不当可能带冒犯性）"},"examples":[{"en":"In the museum label, the guide avoided the word “papoose” and simply said “baby.”","zh":"在博物馆的说明牌上，导览刻意避开“papoose”，只说“婴儿”。"},{"en":"Older books sometimes describe a “papoose” riding in a cradleboard on a parent’s back.","zh":"较早的书里有时会描写“papoose”坐在摇篮板上，由父母背着。"}]},{"partOfSpeech":"n.","definition":{"en":"a baby carrier used by some Indigenous peoples, especially a cradleboard","zh":"（旧用）一些原住民族使用的婴儿背具，尤指摇篮板（cradleboard）"},"examples":[{"en":"The exhibit displayed a cradleboard used to carry infants safely.","zh":"展览展示了一种用于安全背婴儿的摇篮板。"},{"en":"Instead of saying “papoose,” many sources prefer the clearer term “cradleboard.”","zh":"比起说“papoose”，许多资料更偏好更清楚的说法“cradleboard（摇篮板）”。"}]}],"synonyms":["baby","infant","cradleboard","baby carrier"],"phonetic":"/pəˈpus/","extraExplanation":["“papoose”源自阿尔冈昆语系（Algonquian languages）相关词汇，英语里多见于旧时叙述原住民生活的文本。现代语境中，它常被认为带有刻板印象或不够尊重；在一般英语表达里，用“baby/infant”，或在需要文化准确时用具体族群名称与更精确的词（如“cradleboard”）更合适。","你输入的“pappooses”是一个常见的拼写变体/误拼；标准复数通常写作“papooses”。"]}
{"word":"pappose","summary":{"en":"Pappose means having a tuft of soft hairs (a pappus) on a seed or fruit, often for wind dispersal.","zh":"pappose 指（植物种子或果实）具冠毛、带绒毛毛簇，常用于描述能随风传播的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Covered with or having a pappus (a tuft or ring of soft hairs/bristles on a seed or fruit), often helping it spread by wind.","zh":"（植物学）具冠毛的；被冠毛覆盖的（冠毛指种子或果实上像绒毛/细刺一样的毛簇或毛环，常帮助随风传播）。"},"examples":[{"en":"Dandelion seeds are carried by the wind because they are pappose.","zh":"蒲公英的种子因为有冠毛（具冠毛）所以能随风飘散。"},{"en":"The botanist described the fruit as small, dry, and pappose.","zh":"植物学家把这种果实描述为小而干、并且具冠毛的。"}]}],"synonyms":["pappus-bearing","downy (in some contexts)","hairy (general)"],"phonetic":"/ˈpæpoʊs/","extraExplanation":["“pappose”常见于植物学描写，尤其是菊科（Asteraceae）等植物的种子/果实结构。冠毛（pappus）像降落伞一样增加空气阻力，帮助风力传播。","词源上来自拉丁语 pappus（意为“绒毛”），加上形容词后缀 -ose（表示“充满……的/具有……的”）。"]}
{"word":"pappous","summary":{"en":"Pappous means “grandfather” in Greek family use; it can also refer to the fluffy seed hairs in botany (more commonly spelled pappus).","zh":"pappous 在希腊家庭称呼中指“祖父/爷爷”；也可指植物种子的冠毛（该义更常拼作 pappus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Greek) a grandfather; often used as a family term for “grandpa,” especially in Greek/Greek-American families.","zh":"（源自希腊语）祖父；常作家庭称呼“爷爷/外公/姥爷”，在希腊或希腊裔家庭中尤常见。"},"examples":[{"en":"My pappous tells stories about growing up in Greece.","zh":"我爷爷（pappous）会讲他在希腊长大的故事。"},{"en":"We’re visiting my pappous and yiayia this weekend.","zh":"这个周末我们要去看望爷爷（pappous）和奶奶（yiayia）。"}]},{"partOfSpeech":"n.","definition":{"en":"(botany) a tuft or ring of fine hairs or bristles attached to some seeds (like dandelions), helping them spread by wind; also spelled “pappus.”","zh":"（植物学）某些种子上附着的一簇细毛或冠毛（如蒲公英），帮助借风传播；也拼作 pappus。"},"examples":[{"en":"A dandelion seed floats because of its pappous.","zh":"蒲公英的种子能飘起来，是因为它的冠毛（pappous）。"},{"en":"Under a microscope, the pappous looks like a tiny umbrella.","zh":"在显微镜下，冠毛（pappous）看起来像一把小伞。"}]}],"synonyms":["grandfather","grandpa","pap","pappus"],"phonetic":"/ˈpæpʊs/","extraExplanation":["“pappous”对应希腊语 παππούς，日常意思就是“爷爷/外公”。在英语里常见于希腊裔社区的家庭称呼。","植物学义项更常写作“pappus”（单词更标准），但“pappous”有时也会被用来指同一个结构，尤其在非专业文本或拼写变体中。"]}
{"word":"pappox","summary":{"en":"“pappox” isn’t a standard word; it’s probably “paradox.”","zh":"“pappox” 不是标准单词；很可能是 “paradox（悖论）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“pappox” is not a standard English word. It is most likely a misspelling of “paradox.”","zh":"“pappox” 不是标准英语单词；很可能是把 “paradox” 拼错了。"},"examples":[{"en":"I can’t find “pappox” in a dictionary—did you mean “paradox”?","zh":"我在词典里找不到 “pappox”——你是不是想写 “paradox”？"},{"en":"The correct spelling is “paradox,” not “pappox.”","zh":"正确拼写是 “paradox”，不是 “pappox”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) paradox: a situation or statement that seems impossible or contradictory at first, but may be true or make sense after you think more about it.","zh":"（可能想表达的词）paradox：乍看矛盾或不可能，但深入思考后可能成立或有道理的说法/现象。"},"examples":[{"en":"It’s a paradox that the more choices we have, the less satisfied we feel.","zh":"这是个悖论：选择越多，我们反而越不满足。"},{"en":"The sentence “Less is more” is a famous paradox.","zh":"“Less is more（少即是多）” 是一个著名的悖论。"},{"en":"The book explores the paradox of freedom and control.","zh":"这本书探讨了自由与控制之间的悖论。"}]}],"synonyms":["(for “paradox”) contradiction (sometimes)","(for “paradox”) puzzle","(for “paradox”) irony (in some contexts)"],"phonetic":"/ˈpærəˌdɑks/","extraExplanation":["“paradox” 常见于写作、哲学、社会话题中，用来强调“表面矛盾但可能合理”的观点。不要和 “contradiction（矛盾/冲突）” 完全等同：contradiction 通常表示逻辑上无法同时成立；paradox 更强调“看似不可能却引人思考”。"]}
{"word":"pappus","summary":{"en":"Pappus is the tuft of hairs or bristles on certain seeds (like dandelions) that helps them fly and spread.","zh":"pappus 指某些植物种子（如蒲公英）上的冠毛，用来帮助种子随风飘散、传播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A tuft or ring of fine hairs, bristles, or scales on a seed (especially in the daisy family), helping it disperse by wind.","zh":"（植物学）种子上的冠毛（尤其常见于菊科），由细毛、刚毛或鳞片组成，帮助种子随风传播。"},"examples":[{"en":"The dandelion’s pappus works like a tiny parachute in the wind.","zh":"蒲公英的冠毛像小降落伞一样，能借风飘散。"},{"en":"Many asters spread their seeds using a light pappus.","zh":"许多菊科植物靠轻盈的冠毛来传播种子。"},{"en":"Under a microscope, you can see the pappus attached to the seed.","zh":"在显微镜下，你可以看到冠毛连接在种子上。"}]}],"synonyms":["seed tuft","seed hairs","coma (botany)","bristles (in this context)"],"phonetic":"/ˈpæpəs/","extraExplanation":["词源来自拉丁语 *pappus*，再上溯到希腊语 *pappos*，有“祖父、老人”的意思；因为冠毛像白发或绒毛一样而得名。","常见搭配：*pappus hairs*（冠毛毛状结构）、*pappus bristles*（冠毛刚毛）。在菊科植物（如蒲公英、蓟、向日葵的近亲）中非常常见。"]}
{"word":"pappy","summary":{"en":"“Pappy” is an informal, affectionate word meaning “dad,” and in some families it can also mean “grandpa.”","zh":"“pappy”是非正式且亲昵的称呼，常指“爸爸”，在一些家庭也可指“爷爷/外公”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, often affectionate) Dad; a father figure. In some places it can also mean “grandpa.”","zh":"（非正式，常带亲昵）爸爸；父亲般的人。在某些地区也可指“爷爷/外公”。"},"examples":[{"en":"My pappy taught me how to ride a bike.","zh":"我爸爸教我骑自行车。"},{"en":"When I was little, I stayed with Pappy during the summer.","zh":"我小时候夏天会和爷爷（Pappy）住在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A warm, family nickname used to address or refer to one’s dad (or sometimes grandfather).","zh":"用来称呼或指代爸爸（有时也指爷爷/外公）的亲昵称呼。"},"examples":[{"en":"Pappy, can you help me with my homework?","zh":"爸爸，你能帮我做作业吗？"},{"en":"I miss you, Pappy.","zh":"我想你了，爸爸。"}]}],"synonyms":["dad","daddy","papa","pa","father"],"phonetic":"/ˈpæpi/","extraExplanation":["“pappy”带有明显的口语与地域色彩：在美国南部、阿巴拉契亚地区等更常见，语气通常更朴实、亲切。不同家庭里可能专指父亲，也可能专指祖父。","注意与“papi / papi (Spanish)”区分：西语“papi”也常表示“爸爸/亲爱的”，但文化语境不同；英语里写作与发音也可能不一样。"]}
{"word":"pappyri","summary":{"en":"Papyri means ancient texts or documents written on papyrus; it is the plural of papyrus.","zh":"Papyri 指写在纸草纸（papyrus）上的古代文献/文本；是 papyrus 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of papyrus: ancient documents or texts written on papyrus (a paper-like material made from a plant), or the sheets themselves.","zh":"papyrus 的复数：指写在纸草（由纸草植物制成的纸状材料）上的古代文献/文本，或指纸草纸张本身。"},"examples":[{"en":"Archaeologists studied the papyri to learn about daily life in ancient Egypt.","zh":"考古学家研究这些纸草文献，以了解古埃及的日常生活。"},{"en":"The museum keeps rare papyri in a climate-controlled room.","zh":"博物馆把珍贵的纸草文献保存在恒温恒湿的房间里。"}]}],"synonyms":["papyrus documents","ancient manuscripts","scrolls"],"phonetic":"/pəˈpaɪraɪ/","extraExplanation":["你输入的“pappyri”很可能是拼写错误；正确拼写通常是 **papyri**（读作 /pəˈpaɪraɪ/）。","**papyrus** 来自希腊语词源，后来进入拉丁语和英语；**papyri** 是比较常见的学术/博物馆用法（强调“许多件文献”）。","在现代英语里也有人用更规则的复数 **papyruses**，但谈到古文献时 **papyri** 更常见、更地道。"]}
{"word":"papreg","summary":{"en":"“papreg” is not a standard English word; it’s probably a typo and needs context.","zh":"“papreg”不是标准英语单词；可能是拼写错误，需要语境才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a made-up/brand name; meaning depends on context.","zh":"不是标准英语单词。很可能是拼写错误、造词或品牌名；具体含义取决于语境。"},"examples":[{"en":"I can’t find “papreg” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里查不到“papreg”，你能把看到它的句子发我吗？"},{"en":"Maybe you meant “preg” (slang for pregnant) or “paper” / “papery.”","zh":"你可能想写“preg”（怀孕的俚语）或“paper / papery（纸/像纸一样的）”。"}]}],"phonetic":"/ˈpæp.rɛɡ/","extraExplanation":["“papreg”看起来像拼写错误或把两个词拼在一起（例如 pap + reg）。如果你提供：1）完整句子，2）出现的领域（医学/学校/游戏/品牌/社交媒体等），我可以更准确判断你想表达的词。","常见接近拼写：\n- preg：常见于口语/网络，pregnant（怀孕的）的缩写。\n- pap：可指“Pap smear（子宫颈抹片检查）”中的 Pap，或表示“无营养的文字/空话（pap）”。\n- paper / papery：与“纸、像纸一样”有关。\n- pre-req：有时写作 prereq（先修课/先决条件）。"]}
{"word":"paprica","summary":{"en":"“Paprica” is usually a misspelling of “paprika,” a red pepper-based spice.","zh":"“paprica”通常是“paprika（红椒粉/甜椒粉）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “paprika,” a red spice made from dried peppers.","zh":"“paprika（红椒粉/甜椒粉）”的常见拼写错误；指由干燥辣椒（多为甜椒或红椒）磨成的红色香料。"},"examples":[{"en":"I wrote “paprica” on my shopping list, but I meant paprika.","zh":"我在购物清单上写了“paprica”，但我是想写 paprika（红椒粉）。"},{"en":"The recipe calls for paprika to add color and a mild pepper flavor.","zh":"这个食谱要加 paprika 来增色，并带一点温和的椒香。"}]}],"synonyms":["paprika","red pepper powder"],"phonetic":"/pəˈprikə/","extraExplanation":["正确拼写通常是 paprika，而不是 paprica。发音也按 paprika 来读。","paprika 常见于欧美菜谱：可以偏甜（sweet paprika）、偏烟熏（smoked paprika）、也有偏辣（hot paprika）。不同类型味道差异很大，买的时候可看包装标注。","词源常被认为与中欧（尤其匈牙利）烹饪传统相关；在英语菜单和食谱里非常常见。"]}
{"word":"papricas","summary":{"en":"Paprika is a red pepper powder used as a spice; it can also refer to the peppers used to make it. “Papricas” is usually the plural (more commonly written “paprikas”).","zh":"Paprika 指红椒粉（一种调味香料），也可指用于制作红椒粉的那类红椒。“Papricas”通常是复数（更常写作 paprikas）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red powder made from dried peppers, used to add color and a mild to medium pepper flavor to food","zh":"红椒粉；由干辣椒/甜椒磨成的红色粉末，用来给食物上色并增加温和到中等的椒香味"},"examples":[{"en":"Sprinkle a little paprika on the eggs for color.","zh":"在鸡蛋上撒一点红椒粉增色。"},{"en":"This soup tastes better with smoked paprika.","zh":"这道汤加点烟熏红椒粉会更好喝。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of pepper (often sweet or mild) used to make paprika","zh":"（可用于制作红椒粉的）一种甜椒/红椒（多为甜或不太辣）"},"examples":[{"en":"Hungarian cuisine uses several kinds of paprika peppers.","zh":"匈牙利菜会用到好几种红椒（用于红椒粉的那类椒）。"}]}],"synonyms":["red pepper powder","smoked paprika","sweet paprika"],"phonetic":"/pəˈpriːkə/","extraExplanation":["你输入的“papricas”通常是拼写或复数形式的问题：标准拼写是 paprika；复数可写 paprikas，也有人直接用 paprika 表示“多种/多份红椒粉”（尤其在菜单或食谱里）。","Paprika 在不同国家口味差异很大：常见类型包括 sweet（甜口不辣）、smoked（烟熏香）、hot（辣）。买的时候看标签能更准确。","词源上与中欧（尤其匈牙利）饮食文化关系密切；在英语里提到 Hungarian paprika 往往暗示品质好或风味更浓。"]}
{"word":"paprika","summary":{"en":"Paprika is a red pepper spice powder used to add color and flavor.","zh":"Paprika 指红椒粉/甜椒粉，用来增色并增加风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A red powder made from dried peppers, used as a spice for color and mild to medium heat (depending on the type).","zh":"红椒粉（甜椒粉/红辣椒粉）：由干燥辣椒磨成的红色粉末，用作调味并增加颜色；辣度从不辣到中等不等（取决于品种）。"},"examples":[{"en":"Sprinkle a little paprika on the eggs for extra color and flavor.","zh":"在鸡蛋上撒一点红椒粉，颜色更好看，味道也更香。"},{"en":"This recipe uses smoked paprika, so it tastes slightly smoky.","zh":"这道菜用了烟熏红椒粉，所以会带一点烟熏味。"}]}],"synonyms":["red pepper powder","sweet paprika","smoked paprika"],"phonetic":"/pəˈpriːkə/","extraExplanation":["英语里的 paprika 常指较温和、颜色鲜红的“甜椒粉”，但在不同国家的超市里也可能买到更辣的版本。常见类型有 sweet（甜）、hot（辣）、smoked（烟熏）。","Paprika 也是匈牙利菜中很有代表性的香料之一（例如 goulash 牛肉汤/炖菜经常使用）。购买时看包装标注的 sweet/hot/smoked 会更保险。"]}
{"word":"paprikas","summary":{"en":"“Paprikas” means more than one kind or amount of paprika (red pepper powder), often referring to different styles like sweet or smoked.","zh":"“Paprikas”表示不止一种或不止一份红椒粉（红椒香料），常指不同类型，如甜红椒粉或烟熏红椒粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of paprika: a spice made from dried ground red peppers; also the red pepper powder used to add color and mild heat to food.","zh":"paprika 的复数：由干燥红椒磨成的香料（红椒粉）；常用于给食物增色并带来温和辣味。"},"examples":[{"en":"Different paprikas can taste sweet, smoky, or mildly hot.","zh":"不同种类的红椒粉可能是甜味、烟熏味，或带一点辣。"},{"en":"The recipe calls for two paprikas: sweet paprika and smoked paprika.","zh":"这道菜需要两种红椒粉：甜红椒粉和烟熏红椒粉。"}]}],"synonyms":["red pepper powder","sweet paprika","smoked paprika"],"phonetic":"/pəˈprikə/","extraExplanation":["paprika 在英语里既可以指“红椒粉”（香料），也常泛指“用来做红椒粉的红甜椒/彩椒”这一类椒。烹饪中常见的区分有 sweet paprika（甜红椒粉）、smoked paprika（烟熏红椒粉）和 hot paprika（辣红椒粉）。","这种香料在中欧（尤其是匈牙利）料理中非常常见，例如匈牙利炖牛肉 goulash 经常会用到 paprika 来上色增香。"]}
{"word":"papriks","summary":{"en":"Paprika is a red pepper-based spice (and sometimes a color name).","zh":"Paprika 指红椒粉（也可指一种红橘色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A red powder made from dried peppers, used as a spice to add mild heat, sweetness, and color to food.","zh":"红椒粉／甜椒粉：由干辣椒（或甜椒）磨成的红色粉末，用作香料，增添微辣或甜香与颜色。"},"examples":[{"en":"Sprinkle a little paprika on the eggs for color and flavor.","zh":"在鸡蛋上撒一点红椒粉，增加颜色和风味。"},{"en":"This soup tastes richer with smoked paprika.","zh":"这道汤加了烟熏红椒粉后味道更浓郁。"}]},{"partOfSpeech":"n.","definition":{"en":"A bright red to orange-red color.","zh":"红椒粉色：一种鲜艳的红色到橘红色。"},"examples":[{"en":"She wore a paprika-colored scarf.","zh":"她戴着一条红椒粉色的围巾。"}]}],"synonyms":["red pepper powder","sweet paprika","smoked paprika"],"phonetic":"/pəˈprikə/","extraExplanation":["你输入的“papriks”一般被认为是“paprika”的拼写错误。","paprika 常见有三类风味：sweet（甜/不辣）、hot（辣）、smoked（烟熏）。不同国家和品牌的辣度差别很大。","词源来自匈牙利语与南斯拉夫地区语言中的“pepper（胡椒/辣椒）”相关词，因此在匈牙利料理里特别常见（如 goulash 匈牙利炖牛肉）。"]}
{"word":"paps","summary":{"en":"“Paps” most commonly means “paparazzi” in informal speech. It can also be the plural of “pap” (soft food or empty sentimental talk), and in old usage it can mean breasts.","zh":"“paps”最常见的意思是（非正式）“狗仔队/跟拍摄影记者”。也可作“pap”的复数（糊状软食或空洞煽情的话），旧用法中还可指乳房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Paparazzi; photographers who follow famous people to take candid pictures, often in a pushy way.","zh":"（非正式）狗仔队；跟拍名人、偷拍照片的摄影记者，常带有纠缠、打扰的意味。"},"examples":[{"en":"The actor hid behind an umbrella to avoid the paps.","zh":"那位演员躲在伞后面躲避狗仔队。"},{"en":"Fans waited outside the hotel, and the paps showed up minutes later.","zh":"粉丝在酒店外等着，几分钟后狗仔队也出现了。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “pap”: a soft mushy food (often for babies or people who are ill), or writing/speech that is too sentimental or lacking real value.","zh":"“pap”的复数：指（1）糊状软食（常给婴儿或病人吃）；（2）空洞煽情、缺乏实质内容的文字或言论。"},"examples":[{"en":"The nurse prepared warm pap for the baby.","zh":"护士给婴儿准备了温热的糊状食物。"},{"en":"He was tired of political speeches full of pap.","zh":"他厌倦了那些充满空话套话的政治演讲。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) Plural of “pap”: a woman’s breast or nipple.","zh":"（过时用法）“pap”的复数：女性的乳房或乳头。"},"examples":[{"en":"In old poetry, “paps” may refer to a woman’s breasts.","zh":"在一些旧诗歌里，“paps”可能指女性的乳房。"}]}],"synonyms":["paparazzi","photographers (tabloid)","press (informal, context-dependent)"],"phonetic":"/pæps/","extraExplanation":["“the paps”常见于英式英语的娱乐新闻语境，相当于“the paparazzi”。语气通常带批评或厌烦。","表示“乳房”的paps属于过时表达，现代英语中可能显得粗俗或冒犯；学习时可识别即可，日常不建议使用。"]}
{"word":"papua","summary":{"en":"“Papua” usually refers to the Indonesian region on western New Guinea; sometimes (older/informal) it’s used for Papua New Guinea, but that can be confusing.","zh":"“Papua”通常指印尼在新几内亚岛西半部的巴布亚地区；有时（较旧/非正式）也指巴布亚新几内亚，但容易混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Papua: a region in the western half of the island of New Guinea, part of Indonesia (including the provinces Papua, West Papua, and others). In everyday English, “Papua” often refers broadly to this Indonesian region of New Guinea.","zh":"Papua（巴布亚）：新几内亚岛西半部的地区，属于印度尼西亚（包括巴布亚省、西巴布亚省等）。日常英语里，“Papua”常泛指印尼境内的新几内亚地区。"},"examples":[{"en":"Many people confuse Papua with Papua New Guinea, but they are different places.","zh":"很多人会把巴布亚和巴布亚新几内亚搞混，但它们不是同一个地方。"},{"en":"Papua has rich cultural diversity and many Indigenous languages.","zh":"巴布亚有丰富的文化多样性，也有许多原住民语言。"}]},{"partOfSpeech":"n.","definition":{"en":"(older or informal usage) A short form for “Papua New Guinea,” the independent country on the eastern half of New Guinea. This usage can be unclear, so many writers prefer the full country name.","zh":"（较旧或非正式用法）“Papua New Guinea（巴布亚新几内亚）”的简称，指新几内亚岛东半部的独立国家。这个简称容易造成混淆，因此很多写作者更倾向使用全称。"},"examples":[{"en":"In some older travel writing, “Papua” was used to mean Papua New Guinea.","zh":"在一些较早的游记中，“Papua”曾被用来指巴布亚新几内亚。"}]}],"synonyms":["Papua (Indonesia)","Western New Guinea","Papua New Guinea (when used informally)"],"phonetic":"/ˈpæpjuə/","extraExplanation":["在英语写作中，为避免混淆，通常建议：指国家就写“Papua New Guinea（巴布亚新几内亚）”；指印尼的新几内亚地区可以写“Papua (Indonesia)”或更具体的省名（如“Papua Province”“West Papua”）。","“Papua”一词源流复杂，常被认为与马来语/印尼语中表示“卷曲、蓬松”的词有关，历史上曾被用来指当地居民的发型特征；现代语境下更应谨慎使用，尊重当地族群与身份认同。"]}
{"word":"papuan","summary":{"en":"Papuan refers to a person from Papua/New Guinea or something related to the peoples and cultures of that region.","zh":"Papuan 指巴布亚/新几内亚地区的人，或与该地区人民与文化有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Papua (especially the island of New Guinea) or someone of the indigenous peoples of that region","zh":"巴布亚人；指来自巴布亚地区（尤其是新几内亚岛）的人，或该地区的原住民族群成员"},"examples":[{"en":"Many Papuans speak their local language at home and use Indonesian in public life.","zh":"许多巴布亚人在家里说本地语言，在公共生活中使用印尼语。"},{"en":"The museum displayed Papuan art from the highlands of New Guinea.","zh":"博物馆展出了来自新几内亚高地的巴布亚艺术。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Papua or to the peoples, languages, or cultures of Papua/New Guinea","zh":"巴布亚的；与巴布亚（或新几内亚）的人民、语言或文化有关的"},"examples":[{"en":"Papuan languages are extremely diverse.","zh":"巴布亚的语言非常多样。"},{"en":"They studied Papuan traditions and music.","zh":"他们研究巴布亚的传统与音乐。"}]}],"synonyms":["New Guinean (often for people from Papua New Guinea)"],"phonetic":"/ˈpæpjuən/","extraExplanation":["“Papuan”通常用来指新几内亚岛及周边地区的人群与文化；在现实语境中，尤其可能涉及印度尼西亚的“巴布亚省/西巴布亚省”（Western New Guinea）与巴布亚新几内亚（Papua New Guinea）这两个不同的政治实体。写作或交流时，若需要更准确与尊重，建议具体说明是“Papua New Guinea (PNG)”还是“(Indonesian) Papua / West Papua”。","在人类学与语言学里，“Papuan languages（巴布亚语系/巴布亚诸语言）”常是一个覆盖性很强的称呼，用来指新几内亚及附近许多“非南岛语系（Austronesian）”的语言；它不一定代表单一、统一的语系。"]}
{"word":"papuans","summary":{"en":"Papuans = people from Papua (New Guinea), especially Papua (Indonesia) or Papua New Guinea; sometimes used for the indigenous peoples of the region in cultural/linguistic contexts.","zh":"Papuans 指来自巴布亚（新几内亚岛）的人，尤指印尼巴布亚地区或巴布亚新几内亚的人；在文化/语言语境中也可泛指该地区的原住民族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Papua (the island of New Guinea), especially from the Papua region of Indonesia or from Papua New Guinea","zh":"巴布亚人；来自巴布亚（新几内亚岛）的人，尤其指印度尼西亚巴布亚地区或巴布亚新几内亚的人"},"examples":[{"en":"Many Papuans speak local languages as well as Indonesian or English.","zh":"许多巴布亚人除了本地语言之外，也会说印尼语或英语。"},{"en":"The festival invited Papuans to share traditional music and dance.","zh":"这个节日邀请巴布亚人分享传统音乐与舞蹈。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the indigenous peoples of New Guinea and nearby islands as a group (often discussed in cultural or language contexts)","zh":"（语言学/人类学）新几内亚及附近岛屿的原住民族群（常用于文化或语言讨论语境）"},"examples":[{"en":"Researchers have documented stories told by Papuans in several different languages.","zh":"研究人员记录了巴布亚原住民用多种不同语言讲述的故事。"},{"en":"Some books discuss Papuans alongside other Pacific Island peoples.","zh":"一些书会把巴布亚原住民与其他太平洋岛屿民族一起讨论。"}]}],"synonyms":["Papua New Guineans (more specific)","people from Papua (Indonesia) (more specific)"],"phonetic":"/ˈpæpjuənz/","extraExplanation":["“Papuan(s)”通常指地理与族群身份相关的人群，但新几内亚岛内部族群与语言非常多样，用词时尽量具体（例如“Papua New Guineans / 巴布亚新几内亚人”“people from Papua, Indonesia / 来自印尼巴布亚的人”），以避免把不同社群一概而论。","在正式写作中，“Papuan”有时也可作形容词（如 Papuan culture / 巴布亚文化，Papuan languages / 巴布亚诸语言），但你输入的“papuans”最常见是复数名词。"]}
{"word":"papula","summary":{"en":"Papula: a small, solid, raised skin bump (medical term), common in rashes or acne.","zh":"Papula：医学上指皮肤的小而坚实的隆起（丘疹），常见于皮疹或痤疮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, solid, raised bump on the skin, usually less than 1 centimeter across, often seen in rashes or acne.","zh":"（皮肤科）丘疹：皮肤上小而坚实的隆起，通常直径小于 1 厘米，常见于皮疹或痤疮。"},"examples":[{"en":"The doctor noted several red papules on his arm.","zh":"医生发现他手臂上有几个红色的丘疹。"},{"en":"Acne often starts as comedones and small papules.","zh":"痤疮常常从粉刺和小丘疹开始。"},{"en":"If a papule becomes filled with pus, it may turn into a pustule.","zh":"如果丘疹里充满脓液，就可能变成脓疱。"}]}],"synonyms":["papule","skin bump","lesion"],"phonetic":"/ˈpæpjələ/","extraExplanation":["“Papula”是医学/皮肤科用语，日常英语里更常说“bump”或“pimple”（但“pimple”更口语，含义不如“papule”精确）。","发音和拼写上，“papule”更常见；“papula”有时被当作“papule”的变体或拉丁化形式出现。多数医学英语写作使用“papule”。","皮肤损害分类里，papule（丘疹）强调“实性、隆起、较小”；与之相关的还有 macule（斑）、nodule（结节，通常更大更深）、pustule（脓疱，含脓液）。"]}
{"word":"papulae","summary":{"en":"Papulae are small, solid, raised bumps on the skin (plural of papula).","zh":"Papulae 指皮肤上的小而坚实、隆起的丘疹（papula 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, solid, raised bumps on the skin (plural of papula), often seen in rashes or acne-like conditions.","zh":"皮肤上小而坚实、略微隆起的疹丘/丘疹（papula 的复数），常见于皮疹或类似痤疮的情况。"},"examples":[{"en":"The doctor noted multiple papulae on the patient’s arms and chest.","zh":"医生记录到患者的手臂和胸部有多个丘疹。"},{"en":"In mild dermatitis, papulae may appear along with itching.","zh":"在轻度皮炎中，丘疹可能会与瘙痒同时出现。"}]}],"synonyms":["papules","small raised bumps","skin bumps","raised lesions"],"phonetic":"/ˈpæp.jəˌli/","extraExplanation":["“Papulae”来自拉丁语，是“papula”的复数形式（像“formula → formulae”）。在日常英语里，医生也常直接用更通俗的说法：bumps / small raised spots（小疙瘩/小隆起）。","医学上丘疹（papule/papula）通常指直径较小、表浅、实性的隆起皮损；与“vesicle（小水疱，内含液体）”“pustule（脓疱）”等术语常一起对比使用。"]}
{"word":"papulan","summary":{"en":"“Papulan” is uncommon in English; it usually refers to “papular,” meaning having small raised skin bumps (papules).","zh":"“papulan”在英语中不常见，通常是指“papular（丘疹性的）”，表示皮肤上有小而隆起的疙瘩（丘疹）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon; often a misspelling) relating to or consisting of papules—small, raised bumps on the skin.","zh":"（不常见；常为拼写错误）指“丘疹样的/由丘疹构成的”——丘疹是皮肤上小而隆起的疙瘩。"},"examples":[{"en":"The doctor noted a papular (sometimes misspelled as “papulan”) rash on the patient’s arms.","zh":"医生记录病人手臂上有丘疹性（有时会被误拼成“papulan”）皮疹。"},{"en":"Acne can cause papular bumps that feel slightly raised and tender.","zh":"痤疮可能会造成丘疹样的小疙瘩，摸起来微微隆起并且有点疼。"}]}],"synonyms":["papular","bumpy","raised"],"phonetic":"/ˈpæpjələr/","extraExplanation":["“papulan”在标准英语词典中不常作为正式词条出现，更常见的正确形式是 **papular**（形容词：丘疹性的）以及名词 **papule**（丘疹）。","医学语境里常见搭配：**papular rash**（丘疹性皮疹）、**papules and pustules**（丘疹与脓疱）。如果你是在化验单/皮肤科记录里看到“papulan”，很可能是拼写或转写差异，建议对照原文或询问医生确认。"]}
{"word":"papular","summary":{"en":"Papular means “having small, raised bumps on the skin.”","zh":"papular 指“丘疹性的；皮肤上有小而凸起疙瘩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or covered with small, raised bumps (papules) on the skin.","zh":"（皮肤）丘疹的；有小而凸起疙瘩（丘疹）覆盖的。"},"examples":[{"en":"The doctor described the rash as papular, with many tiny raised bumps.","zh":"医生把这种皮疹描述为丘疹性，有许多细小的凸起疙瘩。"},{"en":"Mosquito bites can sometimes cause a papular reaction in sensitive skin.","zh":"蚊虫叮咬有时会在敏感皮肤上引起丘疹性反应。"}]}],"synonyms":["bumpy","raised","papule-like"],"phonetic":"/ˈpæp.jə.lɚ/","extraExplanation":["“papule（丘疹）”是皮肤科常用词，指小而突起的皮损；“papular”就是“像丘疹的/由丘疹组成的”。常见搭配有 papular rash（丘疹性皮疹）、papular lesions（丘疹性皮损）。","词源上来自拉丁语 papula（小疙瘩）。临床描述里，医生常用这种形容词来概括皮疹外观，但具体病因还需要结合分布、颜色、是否瘙痒、是否发热等信息判断。"]}
{"word":"papulate","summary":{"en":"Papulate describes skin that has papules—small raised bumps.","zh":"Papulate 指皮肤呈丘疹状，有小的隆起疹子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Covered with papules; having small raised bumps on the skin.","zh":"（医学）呈丘疹状的；皮肤上有小而隆起的疹子（丘疹）的。"},"examples":[{"en":"The doctor noted a papulate rash on the patient’s arms.","zh":"医生注意到病人手臂上有丘疹样皮疹。"},{"en":"Papulate lesions can appear in allergic reactions or some infections.","zh":"丘疹样皮损可能出现在过敏反应或某些感染中。"}]}],"synonyms":["papular","bumpy","pimpled"],"phonetic":"/ˈpæpjəˌleɪt/","extraExplanation":["“Papulate”主要用于医学/皮肤科语境，日常英语里不常用。更常见的表达是“papular”（丘疹性的）。","词根来自拉丁语 papula（小疙瘩、丘疹）。医学上“papule（丘疹）”通常指直径较小、隆起、实性的皮损（常见于痤疮、皮炎等），但具体含义需由医生结合病史与检查判断。"]}
{"word":"papulated","summary":{"en":"“Papulated” describes skin that has small raised bumps (papules).","zh":"“papulated”指皮肤出现小的隆起疹（丘疹），呈丘疹状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with, or forming, small raised bumps on the skin (papules); having papules.","zh":"皮肤上长有小的隆起疹（丘疹）；呈丘疹状的。"},"examples":[{"en":"The doctor noted a papulated rash on the child’s arms.","zh":"医生记录到孩子手臂上有丘疹样皮疹。"},{"en":"Papulated lesions can be itchy, so try not to scratch them.","zh":"丘疹样皮损可能会发痒，所以尽量不要抓挠。"}]}],"synonyms":["papular","bumpy (in everyday speech)","raised","pimply (informal, not medical)"],"phonetic":"/ˈpæp.jəˌleɪ.tɪd/","extraExplanation":["“papulated”是皮肤科/病理描述用语，来自“papule（丘疹）”。丘疹通常指直径较小、略高出皮面的实性小疙瘩，常见于湿疹、药疹、虫咬反应等多种情况。日常英语里更常说“bumpy rash（起疙瘩的皮疹）”或“small bumps（小疙瘩）”。"]}
{"word":"papulation","summary":{"en":"Population means the people living in a place, the number of them, or (in biology) a group of the same species in an area.","zh":"Population 指某地的全体居民、人口数量，或（生物学）某地区同种生物的种群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"all the people who live in a particular place (a city, country, etc.)","zh":"（某地的）人口；全体居民"},"examples":[{"en":"Tokyo has a large population.","zh":"东京人口很多。"},{"en":"The local population was worried about the new factory.","zh":"当地居民对新工厂感到担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"the number of people (or animals) in a place","zh":"人口数量；（动物）数量"},"examples":[{"en":"The population of Canada is about 40 million.","zh":"加拿大的人口大约是四千万。"},{"en":"The city’s population grew quickly in the 1990s.","zh":"这座城市在20世纪90年代人口增长很快。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a group of the same kind of animals or plants living in the same area","zh":"（生物）种群；同一地区同种生物的群体"},"examples":[{"en":"The wolf population is slowly recovering.","zh":"狼的种群正在缓慢恢复。"},{"en":"Scientists studied the fish population in the lake.","zh":"科学家研究了湖里的鱼类种群。"}]}],"synonyms":["inhabitants","residents","people","citizens","population size"],"phonetic":"/ˌpɑpjəˈleɪʃən/","extraExplanation":["你输入的“papulation”通常是“population”的拼写错误。正确拼写是 population。","population 多作不可数名词（the population of…），但在生物学语境里也常用作可数（a population / populations）。常见搭配：population growth（人口增长）、population density（人口密度）、local population（当地居民）。"]}
{"word":"papule","summary":{"en":"Papule = a small, solid, raised skin bump.","zh":"Papule 指皮肤上小而坚实的突起（丘疹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, solid, raised bump on the skin (often less than 1 cm wide), usually not filled with fluid.","zh":"（皮肤上的）丘疹：小而坚实、突起的皮肤隆起（通常小于1厘米），一般不含液体。"},"examples":[{"en":"The doctor said the red papules on her arm were caused by an allergic reaction.","zh":"医生说她手臂上的红色丘疹是过敏反应引起的。"},{"en":"Acne often begins with tiny papules that can become more inflamed.","zh":"痤疮常从细小的丘疹开始，之后可能变得更红肿发炎。"}]}],"synonyms":["small bump","skin bump","spot","pimple (informal)"],"phonetic":"/ˈpæp.jul/","extraExplanation":["“papule”是医学/皮肤科用语，日常英语里更常说“small bump”或“pimple”（粉刺/痘痘）。","区分常见皮疹词：papule（实心小突起）vs. pustule（脓疱，里面有脓）vs. vesicle（小水疱，里面有清亮液体）。"]}
{"word":"papules","summary":{"en":"Papules are small, raised, solid skin bumps (plural of papule).","zh":"Papules 指小的、隆起的、实心皮肤疙瘩（丘疹，papule 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, raised, solid bumps on the skin (plural of papule), often seen with acne, dermatitis, or mild allergic reactions.","zh":"皮肤上小的、隆起的、实心的疙瘩（papule 的复数：丘疹），常见于痤疮、皮炎或轻微过敏反应。"},"examples":[{"en":"The doctor noted several red papules on her cheeks, consistent with acne.","zh":"医生发现她脸颊上有几个红色丘疹，符合痤疮的表现。"},{"en":"After hiking, he developed itchy papules on his arms from insect bites.","zh":"徒步后，他手臂上因虫咬出现了发痒的丘疹。"},{"en":"The rash began as tiny papules and later spread across the chest.","zh":"皮疹起初是细小的丘疹，后来扩散到胸部。"}]}],"synonyms":["small bumps","raised spots","skin bumps"],"phonetic":"/ˈpæp.julz/","extraExplanation":["“Papule（丘疹）”是皮肤科常用词，强调“隆起、实心、较小”的皮损；与“vesicle（小水疱，内含液体）”不同。","日常交流中也可用更通俗的说法，如 “small bumps” 或 “small raised spots”，但在医疗场景（病历、医生说明）里更常用 “papules”。"]}
{"word":"papuliferous","summary":{"en":"Papuliferous means “covered with or producing papules (small raised skin bumps).”","zh":"Papuliferous 指“有丘疹的/产生丘疹的（皮肤小隆起疙瘩）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having or producing papules (small, raised bumps on the skin).","zh":"（医学）有丘疹的；产生丘疹的（丘疹指皮肤上小的、隆起的疙瘩）。"},"examples":[{"en":"The doctor described the rash as papuliferous, with many small raised bumps.","zh":"医生把这种皮疹描述为“papuliferous”，也就是有许多小的隆起疙瘩。"},{"en":"A papuliferous eruption can appear on the arms, chest, or face depending on the cause.","zh":"根据病因不同，papuliferous 的皮疹可能出现在手臂、胸部或脸上。"}]}],"synonyms":["papular","papulose","bumpy (informal)"],"phonetic":"/ˌpæp.jəˈlɪf.ɚ.əs/","extraExplanation":["“papuliferous”多见于皮肤科或病理学语境，属于较正式、偏专业的描述词；日常交流里更常说“a rash with papules / small bumps（有小疙瘩的皮疹）”。","词源拆解：papule（丘疹，小疙瘩）+ -ferous（“携带/产生……的”，源自拉丁语 -fer ‘to bear’）。"]}
{"word":"papulo","summary":{"en":"Papulo- is a medical form meaning “papular,” used to describe skin conditions involving small raised bumps (papules).","zh":"papulo- 是医学构词成分，意为“丘疹样的”，用于描述出现小的隆起性皮损（丘疹）的皮肤情况。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medical, combining form) Related to a papule; papular (small, raised bumps on the skin). Often used before another word in dermatology.","zh":"（医学，构词成分）与“丘疹”有关；丘疹样的（皮肤上小而隆起的疙瘩）。常用于皮肤科术语中，放在其他词前面构成复合词。"},"examples":[{"en":"The doctor noted a papulo-vesicular rash on the patient’s arms.","zh":"医生记录到病人手臂上有丘疹-水疱性皮疹。"},{"en":"Papulo-pustular acne involves bumps and pus-filled spots.","zh":"丘疹-脓疱型痤疮表现为小隆起和含脓的皮损。"}]}],"synonyms":["papular"],"phonetic":"ˈpæpjəloʊ","extraExplanation":["“papulo-”来自拉丁语 papula（意为“丘疹、小疙瘩”）。它通常不是单独使用的完整英文单词，而是医学术语里的前缀/构词成分，用来描述皮疹的形态。常见搭配：papulo-vesicular（丘疹-水疱性）、papulo-pustular（丘疹-脓疱性）。"]}
{"word":"papuloerythematous","summary":{"en":"A medical adjective meaning “red and bumpy,” describing a rash with papules and redness.","zh":"医学形容词，指“又红又起小疙瘩”的皮疹（同时有丘疹与红斑）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Describing a skin rash that has both small raised bumps (papules) and redness (erythema).","zh":"（医学）形容皮疹同时具有小的隆起丘疹（papules）和皮肤发红（红斑，erythema）的特征。"},"examples":[{"en":"The doctor noted a papuloerythematous rash on the patient’s arms and trunk.","zh":"医生记录到患者手臂和躯干出现丘疹红斑性皮疹。"},{"en":"Some viral infections can cause a papuloerythematous eruption, especially in children.","zh":"一些病毒感染可能引起丘疹红斑性皮疹，尤其常见于儿童。"}]}],"synonyms":["papular and erythematous","maculopapular (related)","papular erythema (related phrase)"],"phonetic":"/ˌpæp.jə.loʊ.ɛr.ɪˈθɛm.ə.təs/","extraExplanation":["这是一个偏专业的皮肤科用词，常见于病历或检验报告里：papulo- 表示“丘疹（小突起）”，erythematous 表示“红斑性的/发红的”。合在一起强调“又有小疙瘩、又有发红”的皮疹外观。","日常英语中更常用的表达是 “a red, bumpy rash（红而起疙瘩的皮疹）”。如果你在报告里看到这个词，通常需要结合分布部位、是否瘙痒、是否发热、近期用药或感染史来判断原因。"]}
{"word":"papulopustular","summary":{"en":"A medical adjective for skin eruptions with both papules and pustules.","zh":"医学形容词，指皮肤同时出现丘疹与脓疱的皮损/病变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a skin condition that has both papules (small raised bumps) and pustules (pus-filled spots).","zh":"（皮肤病变）同时具有丘疹（小的隆起硬疙瘩）和脓疱（含脓的疱疹/脓包）的。"},"examples":[{"en":"The dermatologist diagnosed her with papulopustular acne.","zh":"皮肤科医生诊断她为丘疹脓疱型痤疮。"},{"en":"Papulopustular lesions can look red, swollen, and sometimes painful.","zh":"丘疹脓疱性皮损可能发红、肿胀，有时还会疼。"},{"en":"This cream is often used for papulopustular rosacea flare-ups.","zh":"这种乳膏常用于丘疹脓疱型酒糟鼻的发作期。"}]}],"synonyms":["papular and pustular","pustular (in part)","inflammatory (in part)"],"phonetic":"/ˌpæp.jə.loʊˈpʌs.tʃə.lɚ/","extraExplanation":["这是医学/皮肤科用语，常见于“papulopustular acne（丘疹脓疱型痤疮）”或“papulopustular rosacea（丘疹脓疱型酒糟鼻）”。“papulo-”指丘疹，“pustular”指脓疱，合在一起强调两类皮损同时存在。","日常英语里很少用，更多出现在病历、药品说明、医学科普文章中。读到它时，可以先抓住两个核心：papule=小硬疙瘩；pustule=带脓的“白头”样疱疹/脓包。"]}
{"word":"papulopustule","summary":{"en":"A papulopustule is a small inflamed skin bump that contains pus, common in acne or rosacea.","zh":"papulopustule 指含脓的炎症性小皮损（丘疹+脓疱），常见于痤疮或玫瑰痤疮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, raised skin lesion that contains pus (a mix of a papule and a pustule), often seen in inflammatory acne or rosacea.","zh":"一种含脓的小型隆起性皮损（兼具丘疹与脓疱特点），常见于炎症性痤疮或酒糟鼻/玫瑰痤疮。"},"examples":[{"en":"The dermatologist noted several papulopustules on his cheeks and prescribed a topical treatment.","zh":"皮肤科医生发现他脸颊有多处丘疹脓疱，并开了外用治疗。"},{"en":"Papulopustules can look like red bumps with a white or yellow center.","zh":"丘疹脓疱看起来可能像红色小疙瘩，中间带白色或黄色脓点。"}]}],"synonyms":["pustule","inflamed pimple","acne lesion"],"phonetic":"/ˌpæp.jə.loʊˈpʌs.tʃuːl/","extraExplanation":["这是医学/皮肤科用语，常用在病历、检验报告或医生说明中；日常英语里人们更常说 pimple（痘痘）、pus-filled bump（有脓的凸起）或 acne lesion（痤疮皮损）。","词源结构：papulo-（丘疹）+ pustule（脓疱）。因此它强调“既隆起又含脓”的炎症性皮损，而不只是单纯的红疹或粉刺。","如果你在阅读护肤或医学资料：papulopustular acne 指“丘疹脓疱型痤疮”，papulopustular rosacea 指“丘疹脓疱型玫瑰痤疮”。"]}
{"word":"papulose","summary":{"en":"Papulose means having or consisting of papules (small raised skin bumps).","zh":"papulose 指“丘疹性的”，即皮肤上出现或由小的隆起丘疹构成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having papules—small, raised bumps on the skin; consisting of papules.","zh":"（医学）丘疹性的；长有丘疹的；由丘疹构成的（丘疹是皮肤上小而隆起的疙瘩）。"},"examples":[{"en":"The doctor described the rash as papulose, with many small raised bumps.","zh":"医生把这种皮疹描述为丘疹性的，有许多小的隆起疙瘩。"},{"en":"A papulose eruption can appear on the arms, chest, or face.","zh":"丘疹性皮疹可能出现在手臂、胸部或面部。"}]}],"synonyms":["papular","papillose (less common; different nuance)"],"phonetic":"/ˈpæpjəˌloʊs/","extraExplanation":["“papulose”常见于皮肤科的病历或论文里，用来形容皮疹的“形态”。它来自“papule（丘疹）”，指直径通常较小、摸起来凸起的皮损，不等同于含液体的“水疱（vesicle）”或含脓的“脓疱（pustule）”。","日常英语里不常用这个词，更常见的说法是“papular rash（丘疹性皮疹）”或直接说“small raised bumps（小的凸起疙瘩）”。"]}
{"word":"papulosquamous","summary":{"en":"A medical adjective for skin conditions with both small raised bumps and flaky scales.","zh":"医学形容词：指皮肤既有丘疹又有鳞屑的表现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing a skin condition that has both papules (small raised bumps) and scales (flaky skin).","zh":"（医学）描述一种皮肤表现：既有丘疹（小的隆起疙瘩），又有鳞屑（脱屑、起皮）。"},"examples":[{"en":"Psoriasis is a common papulosquamous disorder.","zh":"银屑病是一种常见的丘疹鳞屑性疾病。"},{"en":"The doctor noted papulosquamous lesions on the patient’s elbows.","zh":"医生记录到患者肘部有丘疹鳞屑性皮损。"}]}],"synonyms":["papular and scaly","scaly papular"],"phonetic":"/ˌpæp.jə.loʊˈskweɪ.məs/","extraExplanation":["这是一个医学/皮肤科用语，日常英语里很少用。常见搭配有“papulosquamous disorder（丘疹鳞屑性疾病）”“papulosquamous eruption（丘疹鳞屑性皮疹）”“papulosquamous lesions（丘疹鳞屑性皮损）”。","词源可拆分理解：papulo- 来自 papule（丘疹），squamous 来自 squama（鳞片/鳞屑）；合起来就是“丘疹 + 鳞屑”的特征描述。","在学习或就医时，看到这个词通常表示皮疹的“形态学分类”，并不直接等于某一种具体疾病；医生还会结合分布部位、瘙痒程度、病程和化验来判断原因。"]}
{"word":"papulous","summary":{"en":"Papulous means having many small raised skin bumps (papules).","zh":"Papulous 指皮肤上布满丘疹（小的隆起疙瘩）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Covered with, or consisting of, small raised bumps on the skin (papules).","zh":"（医学）长有丘疹的；布满小的隆起疹子的。"},"examples":[{"en":"The doctor noted a papulous rash on the patient’s arms.","zh":"医生记录到病人手臂上有丘疹性皮疹。"},{"en":"Some allergic reactions can cause papulous spots that itch.","zh":"有些过敏反应会引起发痒的丘疹性小疹点。"}]}],"synonyms":["papular","bumpy (informal)","pimpled (informal, depending on context)"],"phonetic":"/ˈpæp.jə.ləs/","extraExplanation":["“papulous”多用于医学或护理记录中，日常口语里更常说“bumpy rash（起小疙瘩的疹子）”或直接用“papules（丘疹）”。","“papule（丘疹）”指皮肤表面小而隆起的实性疙瘩（通常小于约1厘米），常见于痤疮（acne）、湿疹、过敏反应或某些感染。若你在皮肤科语境看到“papular/papulous”，通常都与“丘疹性”有关。"]}
{"word":"papulovesicular","summary":{"en":"Papulovesicular means “having both papules and vesicles,” used mainly to describe certain skin rashes in medicine.","zh":"Papulovesicular 指“同时有丘疹和水疱”，主要用于医学中描述某些皮疹外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Describing a skin rash or lesion that has both papules (small raised bumps) and vesicles (small fluid-filled blisters).","zh":"（医学）形容皮疹或皮损同时具有丘疹（小的隆起硬疙瘩）和疱疹/水疱（小的含液体水泡）。"},"examples":[{"en":"The doctor noted a papulovesicular rash on the patient’s hands.","zh":"医生记录到患者手部出现丘疹-水疱性皮疹。"},{"en":"Chickenpox often begins with papulovesicular lesions that later crust over.","zh":"水痘常以丘疹-水疱性皮损起病，随后结痂。"},{"en":"In the report, the eruption was described as papulovesicular and itchy.","zh":"报告中将皮疹描述为丘疹-水疱性，并伴有瘙痒。"}]}],"synonyms":["papulovesicle-forming","papular and vesicular","vesiculopapular"],"phonetic":"/ˌpæp.jə.loʊ.vəˈsɪk.jə.lɚ/","extraExplanation":["这是临床/皮肤科常用的“形态学描述词”，用来客观描述皮损外观，而不直接等同于某一种病名。医生通常会结合分布部位（如手足、躯干）、伴随症状（痒、痛、发热）和病程来判断原因。","词源结构：papulo-（papule，丘疹）+ vesicular（vesicle，水疱）+ -ar（形容词后缀）。看到这种复合词时，可以用“两个皮损形态同时存在”来快速理解。"]}
{"word":"papyr","summary":{"en":"“Papyr” is usually a misspelling; the correct word is “papyrus,” meaning a wetland plant and the ancient writing material made from it.","zh":"“papyr”通常是拼写错误；正确形式是“papyrus”，指纸莎草这种湿地植物，以及由它制成的古代书写材料/文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"papyrus (often misspelled as “papyr”): a tall wetland plant, especially in Egypt, with thick stems.","zh":"纸莎草（常被拼错为“papyr”）：一种高大的湿地植物，尤指生长在埃及、茎秆粗壮的植物。"},"examples":[{"en":"Papyrus grows well in warm wetlands near rivers.","zh":"纸莎草在河边温暖的湿地里长得很好。"},{"en":"In ancient Egypt, papyrus was a common plant along the Nile.","zh":"在古埃及，尼罗河沿岸常见纸莎草。"}]},{"partOfSpeech":"n.","definition":{"en":"a writing material made from the papyrus plant, used in the ancient world; also, a document written on it.","zh":"（古代用纸莎草制成的）书写材料；也可指写在这种材料上的文献/卷轴。"},"examples":[{"en":"The museum displayed a papyrus with ancient Greek writing.","zh":"博物馆展出了一份写有古希腊文字的纸莎草文献。"},{"en":"Scholars studied damaged papyrus scrolls to learn about daily life long ago.","zh":"学者研究破损的纸莎草卷轴，以了解古人的日常生活。"},{"en":"Many early records were kept on papyrus before paper became common.","zh":"在纸张普及之前，许多早期记录都写在纸莎草上。"}]}],"synonyms":["reed (plant sense)","ancient manuscript (document sense)","scroll (document sense)"],"phonetic":"/pəˈpaɪrəs/","extraExplanation":["“papyrus”与“paper（纸）”在词源上有关：都可追溯到与纸莎草书写材料相关的古代用词。","纸莎草文献常以卷轴形式保存，是研究古埃及、古希腊与罗马历史的重要材料。","你输入的“papyr”在英语里通常不是标准单词，更常见的是“papyrus”。如果你想查的是别的词（如“paper”或“papyr-”作为词根），也可以告诉我语境。"]}
{"word":"papyraceous","summary":{"en":"Papyraceous means “papery”—thin, dry, and delicate in texture.","zh":"papyraceous 指“纸状的”：质地薄、干、脆，像纸一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thin, dry, and papery in texture (like parchment or paper).","zh":"纸状的；薄而干、像纸一样的（质地）。"},"examples":[{"en":"The papyraceous petals felt delicate and almost transparent.","zh":"这些纸状的花瓣摸起来很脆弱，几乎半透明。"},{"en":"Aging leaves turned papyraceous and crumbled in her hands.","zh":"老去的叶子变得像纸一样干薄，在她手里一捏就碎。"}]}],"synonyms":["papery","paper-like","parchment-like","membranous","thin","dry"],"phonetic":"/ˌpæpəˈreɪʃəs/","extraExplanation":["“papyraceous”常见于植物学、医学或文学描写中，用来强调“像纸一样薄、干、易碎”的质感，语气比常用的“papery”更正式、更书面。","词源上与“papyrus（纸莎草；纸）”有关，因此带有“纸/纸莎草”的联想。使用时多描述花瓣、叶片、皮肤、膜等组织。"]}
{"word":"papyral","summary":{"en":"Papyral means “related to papyrus” or “papyrus-like,” often used in academic contexts.","zh":"papyral 指“与纸草有关”或“类似纸草的”，多用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to papyrus (the ancient writing material made from the papyrus plant), or resembling papyrus in look or texture.","zh":"与纸草（古代用纸草植物制成的书写材料）有关的；或外观、质地类似纸草的。"},"examples":[{"en":"The museum displayed papyral fragments covered in faded Greek letters.","zh":"博物馆展出了带有褪色希腊字母的纸草文书碎片。"},{"en":"Researchers used gentle light to read the papyral surface without damaging it.","zh":"研究人员用柔和的光线读取纸草表面内容，以免损坏它。"}]}],"synonyms":["papyrus","papyrus-based","papyrus-like"],"phonetic":"/pəˈpaɪrəl/","extraExplanation":["“papyral”较为少见，多见于学术写作（如考古学、古文字学、古典学）来描述“纸草文书/纸草碎片”。日常英语里更常用的是“papyrus (n.)”作名词，或用“papyrus (adj.) / papyrus manuscript / papyrus fragment”等表达。","词源上与“papyrus（纸草）”同源，指向古埃及与地中海世界常用的书写材料；与“paper（纸）”在历史上也有渊源关系。"]}
{"word":"papyrean","summary":{"en":"Papyrean is a rare adjective meaning “made of or relating to papyrus,” and sometimes “papery, thin, and dry.”","zh":"Papyrean 是个罕见形容词，表示“纸莎草制的/与纸莎草有关的”，有时也指“像纸一样薄而干的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Made of papyrus, or relating to papyrus (an ancient writing material made from a water plant).","zh":"（罕见）由纸莎草（papyrus，古代常用书写材料）制成的；与纸莎草有关的。"},"examples":[{"en":"Archaeologists found papyrean fragments covered with faded ink.","zh":"考古学家发现了一些带有褪色墨迹的纸莎草碎片。"},{"en":"The museum displayed papyrean scrolls from ancient Egypt.","zh":"博物馆展出了来自古埃及的纸莎草卷轴。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Thin, dry, and papery in texture.","zh":"（罕见，文学用法）质地薄而干，像纸一样的。"},"examples":[{"en":"The papyrean leaves crackled in the late-summer heat.","zh":"在夏末的热气中，那些薄如纸的叶子发出沙沙的响声。"},{"en":"Her voice turned papyrean with exhaustion.","zh":"她的声音因疲惫而变得干涩无力。"}]}],"synonyms":["papyraceous","papyrus","papery","parchment-like"],"phonetic":"/ˌpæpɪˈriːən/","extraExplanation":["“papyrean”来自“papyrus”（纸莎草）。在现代英语中非常少见，更常见的是用“papyrus (n.) / papyrus (adj.)”或“papyraceous (adj.)”来表达“纸莎草的/纸质般的”。","它常出现在描写古代文献、卷轴（scroll）、抄本（manuscript）等语境中，带有一点书卷气或历史感。"]}
{"word":"papyri","summary":{"en":"“Papyri” is the plural of “papyrus,” meaning ancient writings or documents on papyrus sheets/scrolls.","zh":"“papyri”是“papyrus（纸草纸/纸草文献）”的复数，指写在纸草纸上的古代文献或卷轴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural of “papyrus”: ancient sheets or scrolls made from the papyrus plant, used for writing, especially in ancient Egypt and the Mediterranean world.","zh":"“papyrus（纸草纸）”的复数：用纸草植物制成的古代书写材料（纸张或卷轴），尤指古埃及及地中海地区的文献。"},"examples":[{"en":"Researchers studied Greek papyri to learn about everyday life in ancient Egypt.","zh":"研究人员研究希腊语纸草文献，以了解古埃及的日常生活。"},{"en":"The museum keeps fragile papyri in low light to protect the ink.","zh":"博物馆把脆弱的纸草文献放在弱光环境中，以保护墨迹。"}]},{"partOfSpeech":"n.","definition":{"en":"Collections of ancient written documents preserved on papyrus (often used in academic or museum contexts).","zh":"（学术或博物馆语境）指保存在纸草纸上的一批/一组古代文书资料。"},"examples":[{"en":"This course introduces students to the Oxyrhynchus papyri.","zh":"这门课会向学生介绍“奥克西林库斯纸草文献”。"}]}],"synonyms":["papyrus documents","ancient manuscripts","scrolls","texts"],"phonetic":"/pəˈpaɪraɪ/","extraExplanation":["“Papyri”在日常英语里比较少见，更多出现在考古、古典学、历史学、宗教学等领域。单数是“papyrus”，但很多学术写作会直接用复数“papyri”来泛指“纸草文献”。","发音上注意：这是英语的拉丁/希腊式复数（类似“cactus → cacti”）。写作时如果你指的是一件文物或一份文献，用“a papyrus (document/scroll)”；指多份则用“papyri”。"]}
{"word":"papyrian","summary":{"en":"Papyrian means related to papyrus or papyrus manuscripts, mainly used in academic or literary contexts.","zh":"papyrian 指与纸草或纸草文献相关的（多用于学术或文学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often literary or scholarly) Relating to papyrus (a writing material made from the papyrus plant) or to texts/manuscripts written on papyrus.","zh":"（常用于文学或学术语境）与纸草（由纸草植物制成的书写材料）有关的；或指写在纸草上的文献/手稿的。"},"examples":[{"en":"Researchers studied papyrian fragments found in an ancient tomb.","zh":"研究人员研究了在一座古墓中发现的纸草碎片。"},{"en":"The museum’s papyrian documents reveal details of everyday life in ancient Egypt.","zh":"博物馆里的纸草文献揭示了古埃及日常生活的细节。"}]}],"synonyms":["papyrus","papyraceous","papyral"],"phonetic":"/pəˈpaɪriən/","extraExplanation":["“papyrian”源自“papyrus（纸草）”。在英语里它比较少见，多出现在考古学、古典学、古文献学等领域，用来形容与纸草材料或纸草文献相关的事物。","纸草（papyrus）是古埃及和地中海地区常用的书写载体之一，后来“papyrus”也影响了“paper（纸）”一词的词源发展。"]}
{"word":"papyrin","summary":{"en":"Papyrin is a rare word, sometimes used to mean “papyrus-like” or “related to papyrus,” and it can also be a surname.","zh":"Papyrin 是个较罕见的词，有时表示“像纸草的/与纸草有关的”，也可能是一个姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Papyrus-like; relating to papyrus or paper made from papyrus.","zh":"（罕见）像纸草的；与纸草（papyrus）或纸草制成的纸有关的。"},"examples":[{"en":"The museum displayed a papyrin fragment beside later parchment texts.","zh":"博物馆把一块纸草质地的（papyrin）残片与后来的羊皮纸文献并排展出。"},{"en":"Scholars sometimes use papyrin to describe writing materials connected with papyrus scrolls.","zh":"学者有时用 papyrin 来描述与纸草卷轴有关的书写材料。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) in some cultures; not a common English vocabulary word.","zh":"某些文化中的姓氏；并非常见英语词汇。"},"examples":[{"en":"Dr. Papyrin published a study on ancient Mediterranean texts.","zh":"Papyrin 博士发表了一项关于古代地中海文本的研究。"}]}],"synonyms":["papyrus-like","papyraceous","papyrine"],"phonetic":"/ˈpæpɪrɪn/","extraExplanation":["“papyrin”在通用英语词典中很少作为标准词条出现；如果你是在阅读历史/考古/古文字学材料时遇到它，它可能是作者临时用来表示“与纸草相关/纸草质地”的形容词用法。","你可能想查的是 **papyrus**（纸草；纸草纸；纸草文献），或拼写相近的 **papyrine / papyraceous**（与纸草或纸张质地相关的）。如果你能提供原句，我可以帮你判断最准确的意思。"]}
{"word":"papyrine","summary":{"en":"Papyrine means ‘made of papyrus’ or ‘paper-like in texture.’ It’s a rare, literary or academic adjective.","zh":"papyrine 指“纸莎草制的”或“质地像纸/纸莎草的”。它较少见，多用于文学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of papyrus, or resembling papyrus or paper in texture (thin, dry, and slightly stiff).","zh":"由纸莎草制成的；或在质地上像纸莎草/纸一样（薄、干、略硬）。"},"examples":[{"en":"The archaeologist carefully unfolded the papyrine sheet to avoid tearing it.","zh":"考古学家小心展开那张纸莎草般的薄片，避免撕裂。"},{"en":"His voice sounded papyrine—dry and fragile after hours of speaking.","zh":"他说了好几个小时后，声音听起来像纸一样干涩、脆弱。"}]}],"synonyms":["papery","paper-like","papyraceous"],"phonetic":"/ˈpæpəˌraɪn/","extraExplanation":["“Papyrine”来自“papyrus（纸莎草）”。Papyrus 是古埃及和地中海地区常见的书写材料，用纸莎草茎压制成片。这个词在现代英语里比较少见，多见于文学描写或考古、古文献语境，用来强调“像纸/纸莎草那样薄而干”的触感或气质。","近义词里更常用的是“papery（像纸的）”或更书面/学术的“papyraceous（纸莎草的；纸样的）”。"]}
{"word":"papyritious","summary":{"en":"A rare adjective meaning “made of papyrus” or “papyrus-like.”","zh":"一个罕用形容词，意思是“纸莎草制的”或“像纸莎草的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made of papyrus, or resembling papyrus in texture or appearance (thin, fibrous, paper-like).","zh":"（罕用）由纸莎草（papyrus）制成的；或在质地/外观上类似纸莎草的（薄、纤维状、像纸）。"},"examples":[{"en":"The museum displayed a papyritious scroll in a climate-controlled case.","zh":"博物馆在恒温恒湿的展柜里展出了一个纸莎草制的卷轴。"},{"en":"Under the microscope, the fragment looked papyritious—fibrous and brittle, like ancient paper.","zh":"在显微镜下，那块碎片呈现出纸莎草般的质地——纤维明显且易碎，像古老的纸张。"}]}],"synonyms":["papyrus","papyrus-like","paper-like","fibrous"],"phonetic":"/ˌpæpəˈrɪʃəs/","extraExplanation":["“papyritious”是非常少见的形容词，常见语境多在考古、古文献、博物馆保存与材料描述中。日常英语里更常用的表达是 “papyrus (adj.)” 或 “papyrus-based / papyrus-like”。","词源上与 “papyrus（纸莎草）” 同根，后缀 “-tious” 表示“具有……性质的/与……相关的”。"]}
{"word":"papyro","summary":{"en":"“Papyro” isn’t a standard English word; it’s usually a misspelling or a proper name. You may mean “papyrus.”","zh":"“papyro”不是标准英语词；多为拼写错误或专有名词。你可能想写“papyrus（纸莎草/纸莎草纸）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; it is most often seen as a misspelling or a name/brand. Many learners mean “papyrus,” a plant and a kind of ancient writing material.","zh":"不是标准英语词典词；更常见于拼写错误或作为名字/品牌。很多学习者想表达的是“papyrus（纸莎草/纸莎草纸）”，一种植物，也指古代的书写材料。"},"examples":[{"en":"I couldn’t find “papyro” in a dictionary—did you mean “papyrus”?","zh":"我在词典里找不到“papyro”——你是不是想写“papyrus”？"},{"en":"Ancient Egyptians wrote on papyrus.","zh":"古埃及人用纸莎草纸写字。"}]}],"phonetic":"/pəˈpaɪroʊ/","extraExplanation":["“papyro”在英语中不属于常见标准词形。如果你是在读历史/考古相关内容，最可能是“papyrus”（纸莎草；纸莎草纸）。","如果“papyro”来自人名、游戏ID、公司名或软件名，它可能是专有名词，含义需要结合具体上下文（句子、领域、链接）才能确定。你可以把包含它的完整句子发来，我可以帮你判断。"]}
{"word":"papyrocracy","summary":{"en":"Papyrocracy means governance or management dominated by paperwork and forms.","zh":"papyrocracy 指被文书与表格流程主导的管理或治理（常含讽刺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of administration or control that relies heavily on paperwork and forms; rule by documents (often used humorously or critically).","zh":"一种过度依赖文件、表格与文书流程的管理或控制体系；“由纸张统治”（常带讽刺或调侃语气）。"},"examples":[{"en":"Applying for the permit turned into pure papyrocracy—three offices, five forms, and no clear answers.","zh":"申请许可证完全变成了“文书统治”——跑了三个部门、填了五张表，还是没有明确答复。"},{"en":"The clinic’s papyrocracy kept patients waiting while staff copied the same information again and again.","zh":"诊所的文书主义让病人久等，工作人员却反复抄写同样的信息。"}]}],"synonyms":["bureaucracy","red tape","paperwork","administrative overload"],"phonetic":"/ˌpæpəˈrɑkrəsi/","extraExplanation":["词源上可拆为 papyro-（来自“papyrus/纸莎草纸”，引申为“纸张、文件”）+ -cracy（“统治、治理”）。因此 papyrocracy 强调“流程被文书牵着走”，与 bureaucracy（官僚体制）意义接近，但语气更形象、更讽刺。","该词较少见，多用于评论行政、学校、医疗或公司流程中过度填表、盖章、重复提交材料等现象。"]}
{"word":"papyrograph","summary":{"en":"A papyrograph is an old-fashioned duplicating device or method used to make multiple copies of text or drawings, often using stencils.","zh":"papyrograph 指一种较早期的誊写复制设备或方法，常借助模板/蜡纸来批量复制文字或图画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or method for making copies of writing or drawings, especially an early stencil-based duplicating machine used before modern photocopiers","zh":"誊写印刷器；早期的誊写复制方法/机器（常指使用蜡纸或模板、在复印机出现前用于批量复制文字或图画）"},"examples":[{"en":"Before photocopiers, some offices used a papyrograph to duplicate notices and forms.","zh":"在复印机普及之前，一些办公室会用 papyrograph 来批量复制通知和表格。"},{"en":"The teacher prepared worksheets with a papyrograph so every student could have a copy.","zh":"老师用 papyrograph 制作讲义，这样每个学生都能拿到一份。"}]}],"synonyms":["mimeograph","stencil duplicator","duplicator"],"phonetic":"/pəˈpaɪrəˌɡræf/","extraExplanation":["这个词比较少见，常见于19世纪末到20世纪早期的办公/印刷语境，和 mimeograph（油印机/誊写机）、stencil duplicator（模板复制机）属于同一类技术背景。","词源上 papyro- 与 papyrus（纸草、纸张）有关，-graph 表示“写/印/记录”，整体含义就是“在纸上记录并复制”的工具或方法。"]}
{"word":"papyrographer","summary":{"en":"A papyrographer is a scholar who works with ancient papyrus documents.","zh":"papyrographer 指研究与解读古代纸草文献的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialist who studies, reads, edits, or writes about ancient texts written on papyrus (especially from Egypt and the Greco-Roman world).","zh":"研究、辨读、整理或撰写有关纸草文献（尤其是埃及及希腊罗马时期）的人；纸草文献研究者。"},"examples":[{"en":"The papyrographer examined the faded ink to reconstruct the original contract.","zh":"这位纸草文献研究者检查了褪色的墨迹，以复原原始契约内容。"},{"en":"Museums sometimes consult a papyrographer to help date and interpret papyrus fragments.","zh":"博物馆有时会请纸草文献研究者协助给纸草残片断代并解读其内容。"}]}],"synonyms":["papyrologist","papyrus scholar","manuscript specialist"],"phonetic":"/ˌpæpɪˈrɑɡrəfər/","extraExplanation":["“papyro-”来自 papyrus（纸草），“-grapher”有“记录者/撰写者/研究者”的意思。该词较少见，现代更常用的是 papyrologist（纸草学家）。","纸草文献研究常涉及古希腊语、拉丁语或古埃及语等语言，也会结合考古与文献学方法来判断年代、作者、用途与社会背景。"]}
{"word":"papyrographic","summary":{"en":"Papyrographic means “related to an old document-duplicating method/device (a papyrograph).”","zh":"papyrographic 指“与早期誊写/油印式文件复制方法或设备（papyrograph）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a papyrograph or papyrography—an old method or device for making duplicate copies of documents (a type of early duplicating/printing process).","zh":"与“蜡纸誊写/油印”相关的；指用早期的誊写装置或方法（papyrograph / papyrography）来复制文件的。"},"examples":[{"en":"The archive includes papyrographic copies of meeting notes made before photocopiers were common.","zh":"档案里有一些用早期誊写方式复制的会议记录，那个年代复印机还不普及。"},{"en":"Researchers found a papyrographic stencil with handwritten corrections.","zh":"研究人员发现了一张用于誊写的蜡纸模板，上面还有手写的修改。"}]}],"synonyms":["mimeographic","duplicating","stenciled"],"phonetic":"ˌpæpɪrəˈɡræfɪk","extraExplanation":["“papyrographic”非常少见，多出现在历史档案、印刷史或文献学语境里。它来自“papyrograph（誊写器/油印设备）”，指一种在复印机与现代打印机普及之前，用蜡纸/模板把文字转印出多份副本的技术。现代英语里更常用的是“mimeograph(油印机/誊写机)”或更泛的“duplicating/duplicated copy（复制/复印件）”。"]}
{"word":"papyrography","summary":{"en":"Papyrography is a rare term referring to writing on papyrus or the scholarly study/description of papyrus documents.","zh":"papyrography 是较少见的词，指纸草书写，或对纸草文书的研究与描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study, description, or analysis of papyrus documents (ancient texts written on papyrus).","zh":"对纸草文书（写在纸草上的古代文献）的研究、描述或分析。"},"examples":[{"en":"Her thesis focuses on papyrography and how scholars date Egyptian papyri.","zh":"她的论文聚焦于纸草文书学，并研究学者如何为埃及纸草文献断代。"},{"en":"The museum catalog includes a short section on papyrography to explain the writing materials.","zh":"博物馆目录里有一小节介绍纸草文书学，用来说明书写材料。"}]},{"partOfSpeech":"n.","definition":{"en":"Writing or drawing on papyrus; papyrus-based writing.","zh":"在纸草上书写或绘制；纸草书写。"},"examples":[{"en":"The exhibit demonstrates ancient papyrography, showing how ink was applied with reed pens.","zh":"展览展示了古代纸草书写，说明人们如何用芦苇笔蘸墨书写。"}]}],"synonyms":["papyrology","study of papyri","papyrus writing"],"phonetic":"ˌpæpəˈrɑɡrəfi","extraExplanation":["该词由 papyro-（papyrus，纸草）+ -graphy（书写/记录/学科）构成，常见于古典学、埃及学与文献学语境，比更常用的 papyrology（纸草学）更少见。","papyrus（纸草）是古埃及与地中海地区常用的书写材料，因此 papyrography 往往与古代手稿、书写工具（如 reed pen 芦苇笔）及文本保存有关。"]}
{"word":"papyrological","summary":{"en":"An adjective meaning “connected with the study of ancient papyrus texts (papyrology).”","zh":"形容词：指“与纸草学/纸草文献研究有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to papyrology (the study of ancient texts written on papyrus and other materials) or to papyrus documents themselves.","zh":"与纸草学（研究写在纸草纸等材料上的古代文献）有关的；与纸草文献本身有关的。"},"examples":[{"en":"The museum opened a papyrological exhibition featuring newly deciphered letters from Roman Egypt.","zh":"博物馆开设了一个纸草学相关的展览，展出来自罗马时期埃及的新破译信件。"},{"en":"She published a papyrological study of a tax receipt written on papyrus.","zh":"她发表了一篇纸草学研究，分析一张写在纸草纸上的税收收据。"}]}],"synonyms":["papyrologic","papyrus-related"],"phonetic":"/ˌpæpəɹəˈlɑdʒɪkəl/","extraExplanation":["“papyrological”来自“papyrology”（纸草学），而“papyrology”由“papyrus（纸草纸）+ -logy（学科/研究）”构成。常见搭配有：papyrological evidence（纸草文献证据）、papyrological analysis（纸草学分析）、papyrological finds/discoveries（纸草文献发现）。","纸草学研究对象不只限于文学作品，也包括日常生活文书（如契约、账本、收据、私人书信），因此在理解古代社会史、经济史与语言变体方面很重要。"]}
{"word":"papyrologist","summary":{"en":"A papyrologist is a scholar who studies ancient writings on papyrus.","zh":"papyrologist 指研究纸草古文献的学者（纸草文献学家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scholar who studies ancient texts written on papyrus, especially from Egypt, by reading, editing, and interpreting them.","zh":"纸草文献学家；研究写在纸草（papyrus）上的古代文献（尤指埃及出土文献）的学者，负责解读、整理与阐释。"},"examples":[{"en":"The papyrologist reconstructed the missing lines from a damaged papyrus fragment.","zh":"这位纸草文献学家从一片破损的纸草残片中复原了缺失的行文。"},{"en":"A papyrologist can help historians understand everyday life in Roman Egypt.","zh":"纸草文献学家能帮助历史学家了解罗马时期埃及的日常生活。"}]}],"synonyms":["papyrology scholar","manuscript scholar (broader)"],"phonetic":"/ˌpæpəˈrɑlədʒɪst/","extraExplanation":["词源上，papyrologist 来自 papyrus（纸草）+ -logist（研究……的人）。纸草是古代常用的书写材料之一，很多重要资料（如书信、收据、契约、文学作品残卷）以纸草形式保存下来。","papyrologist 的工作常包括：辨认古文字（如希腊文、拉丁文、科普特文等）、校读残缺文本、结合历史背景进行注释；这与更广义的“抄本学/古文献学”相关，但重点是“纸草文献”。"]}
{"word":"papyrology","summary":{"en":"Papyrology is the study of ancient writings on papyrus.","zh":"papyrology 指研究纸草纸上古代文献的学科（纸草学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The academic study of ancient texts written on papyrus (especially from Egypt), including reading, dating, translating, and interpreting them.","zh":"纸草学：研究写在纸草纸上的古代文献（尤指埃及出土者）的学科，包括辨读、断代、翻译与解读。"},"examples":[{"en":"She is studying papyrology to work with Greek and Egyptian papyrus documents.","zh":"她在学习纸草学，希望能研究希腊文和埃及的纸草文献。"},{"en":"Papyrology helps historians understand everyday life through letters, receipts, and contracts.","zh":"纸草学通过信件、收据和契约等材料，帮助历史学家了解古人的日常生活。"}]}],"synonyms":["papyrus studies","the study of papyri"],"phonetic":"/ˌpæpəˈrɑlədʒi/","extraExplanation":["“papyrology”源自“papyrus（纸草纸）+ -logy（学科/研究）”。很多纸草文献来自埃及干燥环境保存下来的遗址，内容常是非常“日常”的文本（税单、账本、私人信件），因此对社会史与经济史特别重要。","相关学科：epigraphy（铭文学，研究刻在石头/金属上的文字）、paleography（古文字学，研究古代书写体与手稿）。"]}
{"word":"papyrophobia","summary":{"en":"Papyrophobia means an intense fear of paper.","zh":"papyrophobia 指对纸张的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unusual, specific phobia: an intense fear of paper (such as books, documents, or touching/handling paper).","zh":"一种较少见的特定恐惧症：对“纸”（如书本、文件，或触摸/拿纸）产生强烈恐惧。"},"examples":[{"en":"She avoids newspapers because her papyrophobia makes even the sound of rustling paper feel frightening.","zh":"她会避开报纸，因为她的纸恐惧症让“纸张沙沙响”的声音都变得可怕。"},{"en":"His therapist helped him manage papyrophobia by slowly practicing touching paper in safe, small steps.","zh":"他的治疗师通过在安全环境中循序渐进地练习触碰纸张，帮助他应对纸恐惧症。"}]}],"synonyms":["fear of paper","paper phobia","specific phobia (paper-related)"],"phonetic":"/ˌpæpɪrəˈfoʊbiə/","extraExplanation":["词源拆解：papyro- 来自 papyrus（纸草、纸张），-phobia 表示“恐惧”。合起来就是“对纸的恐惧”。","这不是一个非常常用的医学诊断词，更常见的说法是 “a fear of paper” 或 “a specific phobia related to paper”。如果影响生活，通常会用“特定恐惧症（specific phobia）”的框架来描述和治疗。"]}
{"word":"papyroplastics","summary":{"en":"Papyroplastics are rare/technical terms for paper–plastic composite or paper-like plastic materials.","zh":"papyroplastics 是较少见的术语，通常指纸塑复合材料或具有纸感的塑料材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) Paper–plastic composite materials, or plastics designed to have paper-like properties (for example in packaging).","zh":"（少见/技术用语）纸—塑复合材料，或被设计成具有“像纸一样”特性的塑料材料（常见于包装等场景）。"},"examples":[{"en":"Some food wrappers use papyroplastics to combine the stiffness of paper with the moisture resistance of plastic.","zh":"一些食品包装会使用纸塑复合材料，把纸的挺度和塑料的防潮性结合起来。"},{"en":"The company is testing papyroplastics to reduce the amount of pure plastic in its packaging.","zh":"该公司正在测试纸塑复合材料，以减少包装中纯塑料的用量。"}]}],"synonyms":["paper–plastic composite","paper-plastic laminate","cellulose-based plastic","bioplastic (broader)"],"phonetic":"/ˌpæpɪroʊˈplæstɪks/","extraExplanation":["“papyroplastics”不是非常常见或标准化的英语词汇，更多可能出现在特定行业/写作语境中。一般可从词根理解：papyro-（与papyrus“纸莎草/纸”相关）+ plastics（塑料），所以常被用来指“纸与塑料结合的材料”或“纸感塑料”。","如果你想表达的是海滩上那种被高温融化、焦化后像石头一样的塑料碎块，英语里更常见的词是“pyroplastics”（首音是 /paɪr-/，来自 pyro- ‘火’）。你可以告诉我你的上下文句子，我能帮你确认应该用哪个词。"]}
{"word":"papyrotamia","summary":{"en":"A rare, nonstandard term likely meaning the collecting or management of papyrus documents.","zh":"一个罕见的非标准词，通常可按语境理解为“纸草文书的收藏或管理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare or nonstandard word; likely coined to mean the collecting, storing, or managing of papyrus documents (papyri).","zh":"一个非常罕见、非标准的词；很可能是临时造词，用来表示对纸草文书（papyri）的收藏、保存或管理。"},"examples":[{"en":"In this article, “papyrotamia” seems to mean the careful storage of ancient papyri.","zh":"在这篇文章里，“papyrotamia”似乎指对古代纸草文书的细致保存。"},{"en":"The museum’s papyrotamia includes cataloging and protecting fragile papyrus fragments.","zh":"博物馆的“papyrotamia”包括编目与保护脆弱的纸草残片。"}]}],"synonyms":["papyrology (related field)","archiving (contextual)","curation (contextual)"],"phonetic":"/ˌpæpəroʊˈteɪmiə/","extraExplanation":["“papyrotamia”不属于常见英语词汇，在主流词典中通常查不到；更像是作者根据词根临时拼造（nonce word）。","可能的构词：papyro-（纸草、纸草纸）+ -tamia（可能联想到希腊语里与“保管/管理/库房”相关的成分）。因此可按语境理解为“纸草文书的保管/管理/收藏”。","如果你想表达更标准的意思，可考虑：papyrology（纸草学，研究纸草文献的学科）、papyrus collection（纸草藏品）、archiving papyri（归档/保存纸草文书）。","如果你是从某本书/文章里看到的，发我原句或上下文，我可以帮你更准确判断它在那里的具体含义。"]}
{"word":"papyrotint","summary":{"en":"Papyrotint is a rare, old-fashioned term mainly referring to a tinted photographic print/process on paper.","zh":"Papyrotint 是一个罕见的旧词，主要指在纸上做出带色调的摄影印相/工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) A photographic print or printing process that produces a tinted image on paper; a “paper-tinted” photo (often used for portrait-style images in the late 1800s–early 1900s).","zh":"（罕见/旧用）一种在纸上做出带色调（染色）影像的摄影印相或印相工艺；可理解为“纸基的着色照片/印相”。"},"examples":[{"en":"The studio advertised papyrotint portraits that looked warmer than plain black-and-white prints.","zh":"那家照相馆宣传他们的 papyrotint 肖像照，看起来比普通黑白印相更温暖。"},{"en":"Collectors sometimes label a lightly colored paper print as a papyrotint, though the term is uncommon today.","zh":"收藏者有时会把轻微上色的纸基印相称为 papyrotint，不过这个词现在不常见。"}]},{"partOfSpeech":"n.","definition":{"en":"A tinted paper color or finish used to give a “papery” or antique look (very uncommon in modern usage).","zh":"（极少见）一种带色调的纸色/纸面效果，用来营造“纸感”或复古外观。"},"examples":[{"en":"The designer chose a papyrotint background to imitate an old document.","zh":"设计师选了 papyrotint 的底色来模仿旧文件的质感。"}]}],"synonyms":["papyrotype","tinted photograph","hand-tinted photo","paper print"],"phonetic":"/ˈpæpɪroʊtɪnt/","extraExplanation":["这个词在现代英语里非常少见，更多出现在旧广告、摄影史资料或收藏描述中。","词形可以拆成 papyro-（与“纸”有关，来自希腊语 papyrus）+ tint（色调/着色），所以语感上就是“纸上的染色/色调处理”。","如果你是在某个标签、网页或旧书里看到的，可能也会遇到近似词：papyrotype（纸基照片/纸上印相的一类旧称）或 hand-tinted photo（手工上色照片，现代更常用的说法）。"]}
{"word":"papyrotype","summary":{"en":"A papyrotype is an old-fashioned photograph printed on paper, common in the 1800s.","zh":"papyrotype 指19世纪常见的一种纸基老照片/摄影印相。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 19th‑century photographic print made on paper (often given a smooth, glossy finish and mounted), used for portraits as a cheaper alternative to photo types on metal or glass.","zh":"一种19世纪的纸基摄影照片（常做成光滑、有光泽并装裱），多用于肖像照，作为金属或玻璃照片工艺的较便宜替代品。"},"examples":[{"en":"The museum catalog lists the small portrait as a papyrotype from the 1860s.","zh":"博物馆目录将这张小幅肖像标注为一张19世纪60年代的纸基摄影照片（papyrotype）。"},{"en":"Compared with an ambrotype, a papyrotype was typically lighter and easier to mail.","zh":"与玻璃底片工艺的照片（ambrotype）相比，papyrotype 通常更轻，也更便于邮寄。"}]}],"synonyms":["paper photograph","photographic print","albumen print (related)"],"phonetic":"/ˈpæpɪroʊtaɪp/","extraExplanation":["这是一个较少见的历史摄影术语，主要见于19世纪中后期的照相馆与收藏/档案描述中。","词形里的 -type 常出现在早期摄影工艺名称中（如 daguerreotype、ambrotype、tintype），用来表示“某种成像/照片类型”。","在实际阅读中，你可能会把它当作“特定工艺的老照片”来理解；具体配方与工序在不同地区/资料里可能有细微差异，但核心特征是“纸上成像并常被装裱”。"]}
{"word":"papyrus","summary":{"en":"Papyrus is a Nile plant and the ancient paper-like material (or documents) made from it.","zh":"Papyrus 指尼罗河流域的纸莎草植物，也指由其制成的古代纸张材料或文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant (papyrus) once common along the Nile, used to make an early kind of paper.","zh":"纸莎草（一种植物），过去在尼罗河流域很常见，人们用它来制作早期的“纸”材料。"},"examples":[{"en":"Ancient Egyptians wrote on papyrus.","zh":"古埃及人把文字写在纸莎草纸上。"},{"en":"The museum displayed a papyrus with faded ink.","zh":"博物馆展出了一份墨迹已经褪色的纸莎草纸文献。"}]},{"partOfSpeech":"n.","definition":{"en":"A sheet or document made from papyrus, especially from ancient times.","zh":"纸莎草纸（或纸莎草纸文献）；尤指古代用纸莎草制作的纸张或文书。"},"examples":[{"en":"Researchers translated a medical papyrus.","zh":"研究人员翻译了一份医学纸莎草纸文献。"},{"en":"This papyrus records a trade agreement.","zh":"这份纸莎草纸文献记录了一项贸易协议。"}]}],"synonyms":["papyri (plural)","scroll (related)","manuscript (related)"],"phonetic":"/pəˈpaɪrəs/","extraExplanation":["“Papyrus”不仅指植物，也常指用它做成的书写材料或文献，因此在历史、考古、博物馆语境里很常见。","词源来自希腊语/拉丁语，和“paper（纸）”在历史上有亲缘关系（都与早期书写材料的发展有关）。","相关搭配：papyrus scroll（纸莎草纸卷轴）、ancient papyri（古代纸莎草纸文献，papyri 是复数）。"]}
{"word":"papyruses","summary":{"en":"“Papyruses” means multiple papyrus documents (ancient paper) or multiple papyrus plants.","zh":"“papyruses”指多个纸草文书/纸草纸，或多个纸莎草植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “papyrus”: an ancient writing material made from the papyrus plant, often used in Egypt and the Mediterranean world.","zh":"“papyrus（纸草纸）”的复数：由纸莎草制成的古代书写材料，常见于古埃及与地中海地区。"},"examples":[{"en":"Archaeologists studied papyruses found in a desert tomb.","zh":"考古学家研究了在沙漠墓葬中发现的纸草文书。"},{"en":"The museum keeps the papyruses in a cool, dry room to protect them.","zh":"博物馆把这些纸草文书保存在阴凉干燥的房间里以保护它们。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “papyrus”: the papyrus plant itself (or things made from it, such as sheets or reeds).","zh":"“papyrus（纸莎草/纸莎草制品）”的复数：指纸莎草这种植物本身，或由其制成的物品（如纸张、茎秆等）。"},"examples":[{"en":"Tall papyruses grew along the edge of the river.","zh":"高大的纸莎草丛生长在河岸边。"},{"en":"They wove baskets from dried papyruses.","zh":"他们用晒干的纸莎草编篮子。"}]}],"synonyms":["papyri","papyrus documents","papyrus manuscripts"],"phonetic":"/pəˈpaɪrəsɪz/","extraExplanation":["“papyruses”是规则复数形式，但在学术写作中也常见不规则/拉丁式复数“papyri”（读音常为 /pəˈpaɪraɪ/）。两者一般都表示“纸草文书/纸草纸”，区别主要在文体偏好：papyri 更偏学术与考古语境，papyruses 更直观、一般读者更易理解。","“papyrus”一词与古埃及和希腊罗马世界的书写文化密切相关。很多早期的行政记录、私人书信、宗教文本都以纸草文书形式保存下来，因此在历史研究中非常重要。"]}
