{"word":"pav","summary":{"en":"“Pav” most commonly means an Indian bread roll; it can also be an informal short form of “pavilion,” or a context-specific abbreviation.","zh":"“pav”最常指印度的小软面包卷；也可作“pavilion（场馆亭楼/看台楼）”的非正式缩写，或在特定领域中作为需看语境的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, soft bread roll commonly used in Indian street food (for example, served with curry or stuffed fillings).","zh":"（印度常见的）小软面包卷；常用于街头小吃（如配咖喱或夹馅）。"},"examples":[{"en":"I ordered pav bhaji: spicy mashed vegetables served with buttered pav.","zh":"我点了 pav bhaji：香辣蔬菜泥配上抹黄油的 pav 面包卷。"},{"en":"Two vada pav, please.","zh":"请来两个 vada pav（炸土豆饼夹面包）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, especially in schools/sports) Short for “pavilion,” a building by a sports field or in a park.","zh":"（非正式，尤用于学校/体育）pavilion（场馆看台楼、体育场旁的亭楼）的缩写。"},"examples":[{"en":"Meet me by the pav after practice.","zh":"训练后在 pav（看台楼/场馆亭楼）旁边等我。"},{"en":"The team changed in the pav before the match.","zh":"比赛前球队在 pav（更衣/休息的场馆亭楼）里换衣服。"}]},{"partOfSpeech":"other","definition":{"en":"A written abbreviation used in different fields with specific meanings (the exact meaning depends on context).","zh":"用于不同领域的缩写（具体含义取决于语境）。"},"examples":[{"en":"In the report, ‘PAV’ is defined in the abbreviations list.","zh":"在报告里，“PAV”在缩写表中有定义。"}]}],"synonyms":["bread roll","bun","pavilion (informal: pav)"],"phonetic":"/pʌv/","extraExplanation":["在印度饮食语境中，pav 指一种受葡萄牙面包影响的软面包卷；常见搭配包括 pav bhaji（蔬菜泥配面包）和 vada pav（炸土豆饼夹面包，被称为“孟买汉堡”）。","在英联邦校园/体育口语里把 pavilion 简写成 pav 很常见；美式英语里更常直接说 pavilion 或 clubhouse，因此是否常见取决于地区。"]}
{"word":"pavade","summary":{"en":"Pavade is a very rare/archaic word meaning a parade or a showy public display, and can also mean “to parade/show off.”","zh":"Pavade 是一个非常罕见的古语，可指“游行/公开展示”，也可作动词表示“游行/炫耀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) a parade or public display; a showy procession.","zh":"（非常罕见／古语）游行；公开的展示；（带有排场的）队伍行进。"},"examples":[{"en":"In some older writings, a town might hold a “pavade” to celebrate a victory.","zh":"在一些较早的文字里，小镇可能会举行“pavade”（游行）来庆祝胜利。"},{"en":"The author described the festival as a bright pavade of music and banners.","zh":"作者把节日描写成由音乐与旗帜组成的绚丽游行。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare/archaic) to parade or show off in a public, attention-getting way.","zh":"（非常罕见／古语）游行；招摇地展示；炫耀。"},"examples":[{"en":"He would pavade his new uniform through the streets.","zh":"他会穿着新制服在街上招摇而过。"},{"en":"They pavaded their wealth at the party.","zh":"他们在派对上炫耀自己的财富。"}]}],"synonyms":["parade","procession","pageant","show","display","show off (verb)"],"phonetic":"/pəˈveɪd/","extraExplanation":["“pavade”在现代英语里几乎不使用，很多学习者更常遇到的是拼写相近的“parade”（游行）或动词“to parade”（游行／炫耀）。如果你是在作业、歌词、小说或人名里看到“pavade”，也可能是作者刻意用古风词，或是拼写变体。"]}
{"word":"pavage","summary":{"en":"Pavage means decorative paving or the process of paving, often used in formal or design contexts.","zh":"pavage 指装饰性铺装路面或铺装过程，常用于较正式的设计/建筑语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a paved surface, especially decorative paving made of small stones, bricks, or tiles (often used in architecture or landscape design).","zh":"铺装路面；（尤指）用小石块、砖或瓷砖做成的装饰性铺装（常见于建筑或景观设计）。"},"examples":[{"en":"The courtyard’s pavage was laid in a black-and-white pattern.","zh":"庭院的铺装路面铺成了黑白相间的图案。"},{"en":"They restored the old pavage to match the historic style of the square.","zh":"他们修复了旧的铺装，以符合广场的历史风格。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of paving a road or area.","zh":"铺路；铺装的过程。"},"examples":[{"en":"The pavage of the walkway took two days.","zh":"人行道的铺装用了两天。"},{"en":"Noise restrictions limited heavy machinery during pavage.","zh":"噪音限制使得铺装期间重型机械的使用受到控制。"}]}],"synonyms":["paving","pavement","cobblestones","stonework"],"phonetic":"/pəˈvɑʒ/","extraExplanation":["“pavage”是从法语借来的词，在英语里更常见于建筑、艺术史、景观设计、文物修复等语境；日常口语里通常直接说“paving”或“pavement”。","发音结尾常像“zh”（/ʒ/）的音，类似于英文词“garage”在某些读法中的结尾音。"]}
{"word":"pavan","summary":{"en":"A pavan is a slow, formal Renaissance-era court dance, or the stately music written for that dance.","zh":"pavan 指文艺复兴时期一种缓慢庄重的宫廷舞，或为该舞蹈创作的庄严缓慢的舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slow, formal dance popular in Europe (especially in the 1500s–1600s), usually performed in a dignified, processional style.","zh":"帕凡舞（16—17世纪欧洲流行的一种缓慢、庄重的宫廷舞，常带有仪式性行进的感觉）。"},"examples":[{"en":"The dancers opened the performance with a pavan in elegant costumes.","zh":"舞者们身着华丽服装，以一支帕凡舞作为演出开场。"},{"en":"In the Renaissance court, a pavan was often used to show grace and status.","zh":"在文艺复兴时期的宫廷里，帕凡舞常用来展示优雅与身份地位。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of music written for (or in the style of) a pavan; a slow, stately musical composition.","zh":"帕凡舞曲（为帕凡舞而作或模仿其风格的缓慢、庄严的乐曲）。"},"examples":[{"en":"We listened to a pavan played on the lute.","zh":"我们听了一首用鲁特琴演奏的帕凡舞曲。"},{"en":"The composer wrote a pavan and a galliard as a contrasting pair.","zh":"作曲家写了一首帕凡舞曲和一首加利亚德舞曲，形成对比的一对。"}]}],"synonyms":["pavane","processional (music/dance)","court dance"],"phonetic":"pəˈvæn","extraExplanation":["“pavan”也常见拼写为“pavane”。它属于欧洲文艺复兴与早期巴洛克时期的宫廷音乐与舞蹈传统，整体气质偏庄重、缓慢。","词源常与“pavia（意大利城市帕维亚）”或“pavo（拉丁语：孔雀）”相关的说法联系在一起，但并无完全一致的定论；学习时更重要的是把它记成“庄严缓慢的宫廷舞/舞曲”。"]}
{"word":"pavane","summary":{"en":"Pavane means a slow, stately Renaissance dance, or music written in that dance style.","zh":"pavane 指一种文艺复兴时期缓慢庄重的帕凡舞，也可指帕凡舞风格的乐曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slow, formal dance from the Renaissance, usually performed in pairs in a dignified, processional style.","zh":"（文艺复兴时期的）帕凡舞：一种缓慢、庄重、带有游行队列感的宫廷舞，常成对表演。"},"examples":[{"en":"The dancers began with a pavane, moving slowly and gracefully across the floor.","zh":"舞者以帕凡舞开场，缓慢而优雅地穿过舞池。"},{"en":"In the play, the royal court enters in a pavane to show ceremony and power.","zh":"在剧中，王室宫廷以帕凡舞式的队列入场，以展示礼仪与权威。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of music written in the style or rhythm of a pavane (often slow and stately).","zh":"帕凡舞曲：模仿帕凡舞风格或节奏创作的乐曲（常见特点是缓慢、庄严）。"},"examples":[{"en":"We listened to a pavane for solo piano, calm and solemn in mood.","zh":"我们听了一首钢琴独奏的帕凡舞曲，氛围平静而庄重。"},{"en":"Fauré’s famous “Pavane” is often played at concerts and ceremonies.","zh":"福雷著名的《帕凡舞曲》常在音乐会和典礼上演奏。"}]}],"synonyms":["processional (music/dance)","stately dance","court dance"],"phonetic":"/pəˈvæn/","extraExplanation":["“pavane”常被用来营造“庄重、仪式感、缓慢前行”的画面，因此在文学或舞台提示里，有时不仅指具体舞种，也带有一种“隆重入场/仪式行进”的氛围。","常见搭配：a stately/slow pavane（庄严/缓慢的帕凡舞）；dance a pavane（跳帕凡舞）；a pavane for (instrument)（为某种乐器写的帕凡舞曲）。"]}
{"word":"pavanes","summary":{"en":"Pavanes are either slow, formal Renaissance dances or musical pieces written in that stately style.","zh":"pavanes 指文艺复兴时期缓慢庄重的宫廷舞，或指以这种风格写成的舞曲/乐曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slow, formal dance from the Renaissance period, often performed in a stately procession (plural: pavanes).","zh":"一种源自文艺复兴时期的缓慢、庄重的宫廷舞（复数：pavanes），常以队列式的行进来表演。"},"examples":[{"en":"In the play, the nobles entered the hall in pavanes, moving with slow dignity.","zh":"在戏剧里，贵族们以帕凡舞的步伐进入大厅，动作缓慢而庄重。"},{"en":"They learned simple pavanes for the historical reenactment.","zh":"为了历史重现活动，他们学习了几段简单的帕凡舞。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of music written in the style or rhythm of a pavane (often used for a solemn or ceremonial mood).","zh":"以帕凡舞的风格或节奏写成的乐曲（常用于营造肃穆或仪式感的氛围）。"},"examples":[{"en":"The composer ended the suite with a pavane for a calm, reflective feeling.","zh":"作曲家用一首帕凡舞曲作为组曲的结尾，营造平静、沉思的感觉。"},{"en":"We listened to several pavanes played on lute and recorder.","zh":"我们听了几首用鲁特琴和竖笛演奏的帕凡舞曲。"}]}],"synonyms":["processional dance","court dance","ceremonial dance","stately dance","processional (music)"],"phonetic":"/pəˈvæn/","extraExplanation":["“pavane”常见于欧洲文艺复兴与早期巴洛克的宫廷文化，给人的印象是庄重、缓慢、带仪式感。英文里既可指舞蹈，也可指这种风格的器乐曲。","文学与音乐中较常被提到的作品之一是法国作曲家福雷（Fauré）的《Pavane》，常用来表现优雅、克制的情绪。"]}
{"word":"pavanne","summary":{"en":"Pavanne is a slow, formal Renaissance court dance (and music in that style).","zh":"pavanne 指文艺复兴时期缓慢庄重的宫廷舞（也指这种风格的舞曲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slow, formal Renaissance court dance, usually performed in a stately way by couples or a procession.","zh":"一种文艺复兴时期的宫廷舞蹈，节奏缓慢、庄重正式，常由成对舞者或队列行进式表演。"},"examples":[{"en":"They opened the show with a pavanne, moving in slow, measured steps.","zh":"他们以一段帕凡舞开场，步伐缓慢而有节制。"},{"en":"In the play, the nobles enter like a pavanne—calm, elegant, and proud.","zh":"在戏里，贵族们的入场像帕凡舞一样——沉着、优雅又带着骄傲。"}]},{"partOfSpeech":"n.","definition":{"en":"Music written in the style or rhythm of this dance (often as a slow, dignified piece).","zh":"以这种舞蹈风格或节奏写成的乐曲（通常缓慢、庄严）。"},"examples":[{"en":"The composer added a pavanne to the suite for a more ceremonial mood.","zh":"作曲家在组曲中加入一首帕凡舞曲，以营造更仪式感的氛围。"},{"en":"We listened to a pavanne that sounded graceful and slightly melancholy.","zh":"我们听到一首帕凡舞曲，优雅中带着一点淡淡的忧伤。"}]}],"synonyms":["pavane","pavan"],"phonetic":"/pəˈvæn/","extraExplanation":["“pavanne”常见于法语或较古典的拼写形式；更常见的英语拼写是“pavan / pavane”。","这类舞蹈在16世纪的欧洲宫廷很流行，动作多为缓慢前进、转身、队形变化，强调礼仪与身份气质。","在文学与音乐语境里，“pavane/pavanne”也常被用来暗示“庄重的出场、仪式感、古典与怀旧的氛围”。例如拉威尔的作品《Pavane pour une infante défunte》（《悼念公主的帕凡舞曲》）就借“帕凡”营造出优雅而哀婉的色彩。"]}
{"word":"pavans","summary":{"en":"“Pavans” is the plural of “pavan/pavane,” meaning a slow, formal court dance or music written in that style.","zh":"“pavans” 是 “pavan/pavane” 的复数，指一种缓慢、庄重的宫廷舞，或这种风格的舞曲/乐曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **pavan** (also spelled **pavane**): a slow, formal dance, often performed in a procession (common in Europe in the 1500s–1600s).","zh":"**pavan/pavane** 的复数：一种缓慢、庄重、带有队列行进感的正式舞蹈（常见于16–17世纪欧洲）。"},"examples":[{"en":"The film’s opening scene shows nobles performing **pavans** in a grand hall.","zh":"电影的开场展示贵族在大厅里跳庄重的 **pavans**。"},{"en":"In history class, we learned that **pavans** were danced at royal courts.","zh":"在历史课上，我们了解到 **pavans** 曾在王室宫廷中流行。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of **pavan/pavane**: a piece of music written in the style or rhythm of that slow court dance.","zh":"**pavan/pavane** 的复数：以这种缓慢宫廷舞曲风格/节奏写成的乐曲。"},"examples":[{"en":"The concert program included two Renaissance **pavans** for lute.","zh":"音乐会节目里有两首为鲁特琴写的文艺复兴时期 **pavans**。"},{"en":"She enjoys listening to **pavans** because they sound calm and ceremonial.","zh":"她喜欢听 **pavans**，因为听起来平静而庄严。"}]}],"synonyms":["pavanes","processional dances","court dances"],"phonetic":"/pəˈvænz/","extraExplanation":["“pavan/pavane”常被认为源自意大利语 **padovana**（与帕多瓦 Padua 有关）或与“孔雀（peacock）般的华丽步态”联想相关；这也解释了它“缓慢、端庄、炫耀礼仪”的气质。","文学与音乐文化中常提到这种体裁：例如拉威尔的名作 **Pavane pour une infante défunte**（《悼念公主的帕凡舞曲》）让“pavane”在现代也很有知名度。"]}
{"word":"pave","summary":{"en":"“Pave” means to cover a road or surface with a hard material, or (figuratively) to make it easier for something to happen later.","zh":"“pave”既可指用硬质材料铺设道路/地面，也可引申为“为……铺路、创造条件”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover a surface (like a road or path) with a hard, even material such as asphalt, concrete, or stones","zh":"（用沥青、水泥、石块等）铺设（道路、地面），使其坚硬平整"},"examples":[{"en":"The city plans to pave the road next month.","zh":"市政府计划下个月铺设这条道路。"},{"en":"The driveway is paved with concrete.","zh":"车道是用水泥铺的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something easier or more likely to happen in the future (often used in the phrase “pave the way”)","zh":"为将来的事情创造条件；为……铺路（常用于短语“pave the way”）"},"examples":[{"en":"Her research helped pave the way for new treatments.","zh":"她的研究为新的治疗方法铺平了道路。"},{"en":"These talks may pave the way for a peace agreement.","zh":"这些会谈可能为和平协议铺路。"}]}],"synonyms":["surface","asphalt","cover","prepare","clear the way (for)"],"phonetic":"/peɪv/","extraExplanation":["常见搭配：pave a road/street/path（铺路）；be paved with + 材料（用……铺成）。","隐喻用法里，“pave”强调通过一系列准备或努力，让后续更顺利：pave the way for sth（为……铺平道路）。","词源上与“pavement（人行道/路面）”同源，所以看到 pavement 时可以联想到“铺过的路面”。"]}
{"word":"paved","summary":{"en":"“Paved” describes a surface that has been covered with asphalt/concrete/stone, or it is the past form of “pave,” including the figurative phrase “pave the way.”","zh":"“paved”可指“铺了硬质路面”的状态，也可作动词pave的过去式/过去分词，并常见于比喻说法“pave the way”（为……铺平道路/创造条件）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with a hard surface (such as asphalt, concrete, or stones) to make a road, path, or area smooth and easy to travel on","zh":"（道路/地面）铺了硬质路面（如沥青、水泥或石块），便于行走或行车"},"examples":[{"en":"The street is paved, so it’s safer to ride a bike there.","zh":"这条街铺了路面，所以在那儿骑自行车更安全。"},{"en":"We followed a paved path through the park.","zh":"我们沿着公园里铺好的小路走。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “pave”: to cover a road or area with a hard surface; also used figuratively in “pave the way”","zh":"“pave”的过去式和过去分词：给道路/地面铺设硬质路面；也可用于比喻短语“pave the way”（铺平道路、创造条件）"},"examples":[{"en":"Workers paved the driveway last week.","zh":"工人上周把车道铺好了。"},{"en":"Her research paved the way for new medical treatments.","zh":"她的研究为新的医疗疗法铺平了道路。"},{"en":"Years of practice paved his path to success.","zh":"多年的练习为他的成功之路打下了基础。"}]}],"synonyms":["surfaced","asphalted","concreted","cobblestoned"],"phonetic":"/peɪvd/","extraExplanation":["“paved”既常作形容词（a paved road 铺装道路），也常作为动词pave的过去式/过去分词出现。学习时可用句型区分：be paved（被铺好）强调状态；paved + 宾语（铺了……）强调动作。","常见搭配：paved road/street（柏油路/铺装道路），paved path（铺装小路），paved over（把……用硬质材料覆盖掉）。","比喻用法“pave the way (for/to)”很常见，意思是“为……创造条件/铺平道路”，多用于正式写作或新闻报道。"]}
{"word":"paveed","summary":{"en":"“Paveed” is not standard English; you probably mean “paved,” meaning “covered with a hard surface” or “to cover with a hard surface.”","zh":"“paveed”不是标准英文拼写；你很可能想写“paved”，意思是“铺好路面的”或“铺设（硬质路面）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “paved”) covered with a hard, flat surface (such as asphalt, concrete, or stones), making it easy to walk or drive on.","zh":"（可能是想写：paved）铺了硬质平坦路面的（如沥青、水泥或石块），便于行走或行车。"},"examples":[{"en":"The road is paved, so it’s safer to drive at night.","zh":"这条路铺好了，所以晚上开车更安全。"},{"en":"We took a paved path through the park.","zh":"我们走公园里一条铺装小路。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Likely intended: “paved”) to cover a road, path, or area with a hard surface.","zh":"（可能是想写：paved）铺路；用硬质材料铺（路、人行道、场地等）。"},"examples":[{"en":"The city paved the street last year.","zh":"市政府去年把这条街铺好了。"},{"en":"They paved the driveway with concrete.","zh":"他们用水泥把车道铺了。"}]}],"synonyms":["surfaced","asphalted","concreted"],"phonetic":"/peɪvd/","extraExplanation":["“paveed”不是常见英文拼写。最可能是把“paved”（pave 的过去式/过去分词，也可作形容词）拼错了。","“pave the way (for …)”是常见引申用法，表示“为……铺平道路/创造条件”。例如：New policies paved the way for change.（新政策为变革铺平了道路。）"]}
{"word":"pavement","summary":{"en":"Pavement means a hard, paved surface; in American English it often means the road surface, while in British English it commonly means the sidewalk.","zh":"pavement 指硬质铺面；在美式英语里常指“路面”，在英式英语里通常指“人行道”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard surface (usually stone, concrete, or asphalt) that covers a road or path for people or vehicles to travel on","zh":"（道路或小路的）硬质铺面；路面（通常由石头、混凝土或沥青铺成）"},"examples":[{"en":"The pavement was wet after the rain, so we walked carefully.","zh":"雨后路面很湿，所以我们走得很小心。"},{"en":"Workers are repairing the pavement on Main Street this week.","zh":"工人们这周在维修主街的路面。"}]},{"partOfSpeech":"n.","definition":{"en":"(American English) the sidewalk; the paved path beside a street for people walking","zh":"（美式英语）人行道"},"examples":[{"en":"Please keep your bike off the pavement and ride in the bike lane.","zh":"请不要在人行道上骑车，在自行车道骑。"},{"en":"She waited on the pavement outside the store.","zh":"她在商店外的人行道上等着。"}]}],"synonyms":["road surface","sidewalk","footpath","walkway"],"phonetic":"/ˈpeɪvmənt/","extraExplanation":["英式英语里，pavement 通常指“人行道”；而在美式英语里，pavement 更常指“（车行的）路面”。如果你在英国说“The pavement is being repaired”，多半是在说人行道；在美国更可能是在说路面。"]}
{"word":"pavemental","summary":{"en":"Pavemental is a rare adjective meaning “related to a pavement/floor,” often in historic or church contexts (e.g., floor-set tombstones).","zh":"pavemental 是个罕用形容词，意思是“与铺地/地面有关”，常见于历史或教堂语境（如嵌入地面的墓碑）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a pavement (a paved surface), especially a decorative stone floor in a church or historic building.","zh":"（罕用）与铺地、地面（尤其是教堂或历史建筑中的装饰性石质地坪）有关的。"},"examples":[{"en":"The museum restored the pavemental tiles in the old hall.","zh":"博物馆修复了旧大厅里的铺地瓷砖。"},{"en":"Visitors admired the pavemental patterns near the altar.","zh":"游客欣赏了祭坛附近地坪上的图案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Architecture/History) Used in set phrases like “pavemental tomb” to describe a tombstone or monument set flat into the floor.","zh":"（建筑/历史）常用于固定搭配如“pavemental tomb”，指嵌入地面、平铺在地坪里的墓碑或纪念碑。"},"examples":[{"en":"A worn pavemental tomb lies near the entrance of the church.","zh":"教堂入口附近有一块被磨损的地面嵌入式墓碑。"},{"en":"The guide explained that many pavemental tombs were placed inside churches.","zh":"导游解释说，许多地面嵌入式墓碑被安置在教堂内部。"}]}],"synonyms":["paved","floor","tiled","flagstone (context)","mosaic (context)"],"phonetic":"/peɪvˈmɛn.təl/","extraExplanation":["“pavemental”在现代日常英语中非常少见，更常见的是用“paved”（铺过的）、“pavement”（人行道/路面）、“floor”（地面）或“tiled”（铺瓷砖的）来表达类似意思。","在英国历史与教堂语境中，“pavemental”常出现在古建筑描述、铭文研究或文物修复资料里，比如指教堂地面上的石板、马赛克式图案，或“pavemental tomb”（地面墓碑）。"]}
{"word":"pavements","summary":{"en":"“Pavements” is the plural of “pavement”: in British English it usually means sidewalks; in American/technical use it often means paved road surfaces.","zh":"“Pavements”是“pavement”的复数：英式英语多指“人行道”，美式/技术语境中常指“铺装路面（道路表面）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sidewalks or the paved paths along a street for people to walk on (British English; in American English, usually “sidewalk”).","zh":"（英式英语）人行道；街道旁供行人行走的铺砌路面（美式英语通常说 sidewalk）。"},"examples":[{"en":"Keep to the pavements when you’re walking near traffic.","zh":"在车流旁边走路时要走人行道。"},{"en":"The pavements were slippery after the rain.","zh":"下雨后人行道很滑。"}]},{"partOfSpeech":"n.","definition":{"en":"Hard, paved road surfaces (used especially in American English or technical contexts).","zh":"（尤用于美式英语或技术语境）铺装路面；硬化的道路表面。"},"examples":[{"en":"Heavy trucks can damage pavements over time.","zh":"重型卡车久而久之会损坏铺装路面。"},{"en":"The city is repairing cracked pavements this summer.","zh":"这座城市今年夏天在修补开裂的路面。"}]}],"synonyms":["sidewalks","footpaths","road surfaces","roadways"],"phonetic":"/ˈpeɪv.mənts/","extraExplanation":["“Pavement(s)”在英式英语里最常指“人行道”，而在美式英语里更常指“路面/车行道的铺装层”。因此遇到句子时，可以通过上下文判断：如果谈行人、安全、走路，多半是英式“人行道”；如果谈道路施工、车辆、裂缝，多半是美式“路面”。","相关词：British English—on the pavement（在路边/在人行道上）；American English—on the sidewalk（在（美式）人行道上）。"]}
{"word":"paven","summary":{"en":"“Paven” is an archaic/poetic form meaning “paved,” related to the verb “pave.”","zh":"“paven”是较古或诗歌用法，意思相当于“paved（铺好的）”，与动词“pave（铺路/铺地）”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or poetic) paved; covered with stones, bricks, or another hard surface.","zh":"（古体或诗歌用法）铺好的；用石头、砖等铺成的。"},"examples":[{"en":"The street lay paven with old stones, shining after the rain.","zh":"街道被旧石头铺就，雨后闪着光。"},{"en":"In the poem, the garden path is described as paven and quiet.","zh":"在那首诗里，花园小径被描写为铺得整齐而安静。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle form of “pave” used in older English (meaning “to pave”).","zh":"“pave”的古英语过去分词形式（意思是“铺路/铺地”）。"},"examples":[{"en":"They had paven the courtyard before the guests arrived. (older style)","zh":"客人到来前，他们已把庭院铺好了。（较古的写法）"},{"en":"Modern English usually says: “They had paved the courtyard.”","zh":"现代英语通常说：“They had paved the courtyard.”"}]}],"synonyms":["paved","stone-paved","flagged"],"phonetic":"/ˈpeɪvən/","extraExplanation":["“paven”在现代英语里很少见，多出现在旧文学、诗歌或仿古写作中；日常写作一般用“paved”。","容易和“pavan /pəˈvɑːn/”（一种文艺复兴时期的宫廷舞）拼写混淆：paven（铺好的）≠ pavan（舞蹈）。"]}
{"word":"paver","summary":{"en":"A paver is either someone who lays pavement or a paving stone/brick used for paths and patios.","zh":"paver 指铺路工/铺路公司，或指用于步道、露台等的铺路砖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that lays pavement (such as bricks, concrete, or asphalt) to make roads, sidewalks, or driveways","zh":"铺路工人；铺路公司（用砖、混凝土或沥青铺设道路、人行道或车道）"},"examples":[{"en":"We hired a paver to fix the cracked driveway.","zh":"我们请了铺路工来修补开裂的车道。"},{"en":"The city’s pavers finished the new sidewalk before winter.","zh":"市政的铺路队在冬天前完成了新的人行道。"}]},{"partOfSpeech":"n.","definition":{"en":"a paving stone or brick used to cover the ground (often called a “paver” in home improvement)","zh":"铺路砖；地砖（常用于庭院、步道等的铺装材料）"},"examples":[{"en":"These pavers are designed to handle heavy rain and freezing temperatures.","zh":"这些铺路砖的设计能承受暴雨和低温结冰。"},{"en":"They chose gray pavers for the patio to match the house.","zh":"他们选了灰色铺路砖来铺露台，以搭配房子。"}]}],"synonyms":["paving contractor","bricklayer (for the worker, depending on context)","paving stone","cobblestone (similar in meaning, not always the same)"],"phonetic":"/ˈpeɪvɚ/","extraExplanation":["“paver”有两种常见用法：指“铺路的人/公司”，也指“铺路用的砖块”。在美国家装语境里，第二种（铺路砖）非常常见，比如 patio pavers（露台砖）、walkway pavers（步道砖）。","词根来自“pave”（铺路）。英语里 -er 常表示“做某事的人/物”，所以 paver 可以理解为“铺路者/铺路用的东西”。"]}
{"word":"pavers","summary":{"en":"“Pavers” usually means paving stones/blocks used for outdoor surfaces; it can also mean workers who pave.","zh":"“pavers”通常指用于户外铺装的铺路砖/铺路石；也可指铺路工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Stones, bricks, or concrete blocks used to make a hard surface outdoors, such as a patio, driveway, walkway, or garden path.","zh":"（复数名词）铺路石/铺装砖；用于铺设露台、车道、人行道或花园小径等硬质地面的石块、砖块或混凝土块。"},"examples":[{"en":"We replaced the cracked concrete with pavers to make a cleaner walkway.","zh":"我们把开裂的混凝土换成铺路砖，让人行道更整洁。"},{"en":"The patio is made of gray pavers laid in a simple pattern.","zh":"露台由灰色铺路砖铺成，图案很简洁。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) People whose job is to pave roads or surfaces; workers who lay paving material.","zh":"（复数名词）铺路工；从事铺设道路或地面的工人。"},"examples":[{"en":"The pavers started early to finish the road before the rain.","zh":"铺路工一大早就开工，想在下雨前把路修完。"},{"en":"Skilled pavers can make the surface look smooth and even.","zh":"熟练的铺路工能把地面做得平整美观。"}]}],"synonyms":["paving stones","paving blocks","pavers bricks","cobblestones (sometimes)","paving workers (for the people meaning)"],"phonetic":"/ˈpeɪvərz/","extraExplanation":["“pavers”在日常家装/园艺语境中更常指“铺装砖/铺路石”，尤其在北美常见于patio（露台）、driveway（车道）、walkway（步道）等场景。","单数形式是“paver”。作为“人”的意思（铺路工）也存在，但在对话里通常需要语境支持，避免与“材料”混淆。"]}
{"word":"paves","summary":{"en":"“Paves” means “covers a surface to make it smooth,” or figuratively “makes something possible,” as in “paves the way for.”","zh":"“paves”是“pave”的第三人称单数，表示“铺设路面/地面”，也可作比喻义“为……铺平道路”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “pave”: to cover a road, path, or surface with concrete, asphalt, stones, or bricks to make it firm and smooth","zh":"“pave”的第三人称单数：用沥青、混凝土、石块或砖等铺设（道路/地面），使其坚固平整"},"examples":[{"en":"The city paves the street every few decades to repair damage.","zh":"市政府每隔几十年会重新铺设街道来修复损坏。"},{"en":"He paves the driveway with concrete to stop the mud problem.","zh":"他用混凝土铺设车道，来解决泥泞的问题。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to create the conditions that make something easier or possible (often used in “pave the way for”)","zh":"（比喻）为某事创造条件、铺平道路（常用于“pave the way for”）"},"examples":[{"en":"Her research paves the way for new treatments.","zh":"她的研究为新疗法铺平了道路。"},{"en":"A clear apology paves the way for a better conversation.","zh":"真诚而明确的道歉能为更好的沟通铺路。"}]}],"synonyms":["surface","asphalt","cobble","lay","prepare (the way)"],"phonetic":"/peɪvz/","extraExplanation":["“pave the way for …”是非常常见的固定搭配，意思是“为……铺平道路/创造条件”。它通常用来描述进步、改革、研究成果等带来的积极影响。","拼写提示：动词pave + -s → paves（第三人称单数）；过去式/过去分词是paved。"]}
{"word":"pavestone","summary":{"en":"A pavestone is a stone or block used for paving; it can also mean to pave an area with such stones.","zh":"pavestone 指铺路石/铺路砖；也可作动词，表示用这种石（砖）铺设路面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat stone (or concrete block) used to cover the ground and make a paved surface, like a walkway, patio, or street.","zh":"（用于铺地的）路面石；铺路石（或混凝土铺路砖），常见于人行道、庭院或道路。"},"examples":[{"en":"The garden path is made of gray pavestones.","zh":"花园小路是用灰色铺路石铺成的。"},{"en":"Be careful—wet pavestones can be slippery.","zh":"小心——湿的铺路石可能很滑。"},{"en":"They replaced the broken pavestones in front of the store.","zh":"他们把店门口破损的铺路石换掉了。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover an area with pavestones; to pave with stones or blocks.","zh":"用铺路石（或铺路砖）铺设；铺路。"},"examples":[{"en":"The city plans to pavestone the plaza to reduce dust and mud.","zh":"市政府计划用铺路石铺设广场，以减少灰尘和泥泞。"},{"en":"Workers pavestoned the courtyard in neat patterns.","zh":"工人把院子用铺路石铺成整齐的图案。"}]}],"synonyms":["paving stone","paver","cobblestone (sometimes)","flagstone (sometimes)"],"phonetic":"/ˈpeɪvˌstoʊn/","extraExplanation":["“pavestone”更常见作名词；在美式英语里，人们也常说“paver / paving stone”。","这种石（或砖）常被用来拼出图案（如人字形 herringbone），在城市广场、老街区或庭院里很常见。"]}
{"word":"pavetta","summary":{"en":"Pavetta: a genus of tropical shrubs or small trees, sometimes grown for its white, fragrant flowers.","zh":"Pavetta：热带灌木或小乔木的一个属，有些种类因白色芳香花而栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical shrubs or small trees in the coffee family (Rubiaceae), found mainly in Africa and Asia; some species have fragrant white flowers and are grown as ornamentals.","zh":"帕韦塔属（Pavetta）：茜草科（咖啡科近缘）的一属热带灌木或小乔木，主要分布于非洲和亚洲；部分种类开芳香白花，可作观赏植物。"},"examples":[{"en":"Pavetta plants often have clusters of small white flowers.","zh":"Pavetta 常开成簇的小白花。"},{"en":"In some gardens, Pavetta is grown as an ornamental shrub.","zh":"在一些花园里，人们把 Pavetta 当作观赏灌木栽培。"}]}],"synonyms":["Pavetta (genus)","pavetta shrub"],"phonetic":"/pəˈvɛtə/","extraExplanation":["“Pavetta”是植物学拉丁名（属名），在英文里通常按科学名称使用，日常交流中更常说“a Pavetta shrub/tree”或直接用具体物种名（例如某种 Pavetta）。","该属多分布于热带地区；不同物种在叶形、花序和生境上差异较大。若你有图片或具体物种名，我可以帮你进一步确认是哪一种。"]}
{"word":"pavia","summary":{"en":"Pavia is a city in northern Italy; it can also refer to the historic Battle of Pavia (1525).","zh":"Pavia（帕维亚）是意大利北部的一座城市；也可指历史上的帕维亚战役（1525年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Italy (Lombardy), south of Milan, known for its historic center and the University of Pavia.","zh":"意大利北部伦巴第大区的一座城市（帕维亚），位于米兰以南，以历史城区和帕维亚大学闻名。"},"examples":[{"en":"We took a day trip from Milan to Pavia to see the old streets and churches.","zh":"我们从米兰去帕维亚一日游，参观了古老的街道和教堂。"},{"en":"She is studying medicine at the University of Pavia.","zh":"她在帕维亚大学学习医学。"}]},{"partOfSpeech":"n.","definition":{"en":"In history, the Battle of Pavia (1525), a major battle in which French forces were defeated and King Francis I of France was captured.","zh":"历史上的“帕维亚战役”（1525年）：一场重要战役，法军战败，法国国王弗朗索瓦一世被俘。"},"examples":[{"en":"The Battle of Pavia is often mentioned when studying early modern European wars.","zh":"学习近代早期欧洲战争时，常会提到帕维亚战役。"}]}],"phonetic":"/pɑːˈviːə/","extraExplanation":["“Pavia”是专有名词，英语里通常当作地名使用，首字母大写。","发音提示：重音通常在中间的“vi”音节上（pa-VI-a）。","文化/历史补充：帕维亚大学（University of Pavia）历史悠久，是意大利重要的大学之一；“帕维亚战役”则与16世纪欧洲强权竞争（尤其法兰西与哈布斯堡势力）密切相关。"]}
{"word":"pavid","summary":{"en":"Pavid means timid or easily frightened, and it is a rare, formal word.","zh":"pavid 指“胆小、容易受惊”，属于较罕见、偏正式的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Timid; easily frightened; lacking courage (a rare, formal word).","zh":"胆小的；容易受惊的；缺乏勇气的（较罕见、偏正式用词）。"},"examples":[{"en":"He gave a pavid glance at the dark hallway and stayed near the door.","zh":"他胆怯地瞥了一眼漆黑的走廊，仍待在门边。"},{"en":"A pavid child may hide behind a parent when meeting strangers.","zh":"胆小的孩子遇到陌生人时可能会躲到父母身后。"}]}],"synonyms":["timid","fearful","shy","nervous","skittish"],"phonetic":"/ˈpævɪd/","extraExplanation":["“pavid”在现代英语里非常少见，多见于较老的文学或刻意追求古典/正式风格的写作。日常更常用的替代词有：timid, shy, fearful, nervous, skittish。","词源上与拉丁语“pavidus（害怕的）”有关；因此它常带有“受惊、畏缩”的色彩，比单纯的“shy（害羞）”更偏向“害怕”。"]}
{"word":"pavidity","summary":{"en":"Pavidity means timidity or cowardly fear (a rare, formal word).","zh":"pavidity 指“怯懦、胆小”（很少用、较正式/文学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a feeling or quality of being timid; lack of courage.","zh":"（罕用）怯懦；胆小；缺乏勇气。"},"examples":[{"en":"He regretted his pavidity during the meeting and wished he had spoken up.","zh":"他后悔自己在会议上的怯懦，真希望当时能大胆发言。"},{"en":"Her quiet voice was taken for pavidity, but she was simply being careful with her words.","zh":"她轻声说话被误解为怯懦，但她只是说话更谨慎。"}]}],"synonyms":["timidity","cowardice","fearfulness","pusillanimity"],"phonetic":"/pəˈvɪdəti/","extraExplanation":["“pavidity”是非常少见的书面词，源自拉丁语 *pavidus*（“害怕的、胆怯的”）。日常英语更常用 *timidity*, *cowardice*, *fearfulness*。","语气区别：*timidity* 多指性格/习惯性的害羞胆怯；*cowardice* 常带更强的负面道德评判；*pavidity* 偏文学/古典，用来强调“胆怯的状态或特质”。"]}
{"word":"pavier","summary":{"en":"Pavier means a person who paves roads/paths; rarely, it can mean a paving stone.","zh":"pavier 指铺路工；很少情况下也可指铺路石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to pave roads or paths (a worker who lays pavement or paving stones).","zh":"铺路工；铺设路面的人（铺沥青或铺路石的工人）。"},"examples":[{"en":"The city hired a pavier to repair the old stone sidewalk.","zh":"市政府雇了一名铺路工来修复旧的石板人行道。"},{"en":"In the past, a pavier might spend all day setting stones by hand.","zh":"过去，铺路工可能整天用手一块块地铺石头。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a paving stone; a stone used for paving.","zh":"（罕见）铺路石；用于铺路的石块。"},"examples":[{"en":"The garden path was lined with paviers laid in a neat pattern.","zh":"花园小路用铺路石整齐地铺成了图案。"}]}],"synonyms":["pavior","paver","paving worker","road builder"],"phonetic":"/ˈpeɪviər/","extraExplanation":["“pavier”常被视为“pavior”的另一种拼写（更常见的是pavior）。词根来自表示“铺设、铺路”的pave。","在现代英语里，日常更常用的说法是“paver”（铺路机/铺路工，视语境而定）或“paving worker/contractor”。"]}
{"word":"pavies","summary":{"en":"“Pavies” (plural of “pavise”) means large medieval shields used as portable cover, especially by crossbowmen.","zh":"“pavies”（“pavise”的复数）指中世纪的大型高盾，常作可立地的掩护，尤其供弩手使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, tall shield used in the Middle Ages, especially by crossbowmen, that could be set on the ground to protect the body while reloading; “pavies” is the plural form (more commonly spelled “pavises”).","zh":"（中世纪）一种大型高盾，常被弩手使用，可立在地上作掩护以便装填；“pavies”为复数形式（更常见拼写为“pavises”）。"},"examples":[{"en":"The crossbowmen hid behind their pavies while they reloaded.","zh":"弩手在装填时躲在大盾（pavies）后面。"},{"en":"In the museum, you can see pavies painted with bright coats of arms.","zh":"在博物馆里，你能看到绘有鲜艳纹章的大盾（pavies）。"}]}],"synonyms":["pavises","large shield","shield"],"phonetic":"/pəˈvis/","extraExplanation":["“pavies”通常被认为是“pavise”的复数变体拼写；现代英语里更常见的复数是“pavises”。如果你是在某本历史小说、游戏设定或古文献里看到“pavies”，多半指的就是这种可立地防护的巨盾。","词源上常与法语/意大利语形式有关，有一种说法把它与意大利城市帕维亚（Pavia）联系起来（据说当地以制作此类盾牌闻名），因此在历史语境中带有浓厚的中世纪欧洲军事色彩。"]}
{"word":"pavilion","summary":{"en":"A pavilion is either a small park/garden shelter (often open) or a larger venue/covered area for events and exhibitions.","zh":"pavilion可指公园花园里的亭子（常半开放），也可指用于活动、展览或演出的场馆/展馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, often open building in a park or garden, used for shade, rest, or decoration","zh":"（公园或花园里的）亭子；（常为半开放的）小建筑，用于遮阴、休息或观赏"},"examples":[{"en":"We ate lunch in the pavilion to stay out of the sun.","zh":"我们在亭子里吃午饭，避免太阳直晒。"},{"en":"The wedding photos were taken under a garden pavilion.","zh":"婚礼照片是在花园亭子下拍的。"}]},{"partOfSpeech":"n.","definition":{"en":"a building or covered area used for public events, sports, exhibitions, or performances","zh":"（用于活动的）展馆；运动馆；（可遮蔽的）活动场地"},"examples":[{"en":"The concert will be held at the outdoor pavilion by the lake.","zh":"音乐会将在湖边的露天活动馆举行。"},{"en":"We visited the science pavilion at the expo.","zh":"我们参观了博览会的科学展馆。"}]}],"synonyms":["gazebo","shelter","bandstand","hall","venue","exhibition hall"],"phonetic":"/pəˈvɪljən/","extraExplanation":["“pavilion”常见于公园与公共空间（如 picnic pavilion 野餐棚/亭、band pavilion 乐队演奏亭）。在英美英语中，它既可指精致的园林亭，也可指较大型的活动场馆；具体大小取决于语境。","在文学与园林语境里，pavilion常带有“供人驻足、观景、休憩”的意象；中文里有时可译为“亭/亭子/凉亭”，若是大型活动建筑则更适合译为“馆/展馆/场馆”。"]}
{"word":"pavilioned","summary":{"en":"“Pavilioned” means ‘having pavilions’ or ‘sheltered by a pavilion,’ and it can also be the past participle of ‘pavilion.’","zh":"“pavilioned”意为“有亭子的”或“被亭子遮蔽的”，也可作动词“pavilion”的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(describing a place or garden) having one or more pavilions; furnished with pavilions.","zh":"（形容地方或花园）有亭子/凉亭的；设有亭子的。"},"examples":[{"en":"They walked through a pavilioned garden beside the lake.","zh":"他们走过湖边一座有凉亭的花园。"},{"en":"The palace grounds included pavilioned courtyards for отдыха and tea.","zh":"宫殿庭院里设有带凉亭的院落，用来休息和品茶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often literary) sheltered or covered by a pavilion or pavilion-like structure.","zh":"（常见于文学描写）被亭子或类似亭子的结构遮蔽的；在亭子里/下的。"},"examples":[{"en":"In the heat, they sat in a pavilioned shade.","zh":"在炎热中，他们坐在亭下的阴凉处。"},{"en":"A pavilioned walkway led guests to the entrance.","zh":"一条有棚亭遮蔽的步道把客人引向入口。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “pavilion”: to provide with a pavilion or to shelter in a pavilion/tent.","zh":"动词“pavilion”的过去分词：搭亭/设亭；用亭子（或帐篷）遮蔽/安置。"},"examples":[{"en":"The festival area was pavilioned for visitors during the rain.","zh":"为防雨，节庆区域搭起了亭棚供游客使用。"}]}],"synonyms":["with pavilions","sheltered","covered","canopied"],"phonetic":"/pəˈvɪljənd/","extraExplanation":["“pavilioned”比较少见，多用于描写性文字（尤其是风景、园林、宫苑）。现代日常英语里更常说“a garden with pavilions / a shaded pavilion / a covered walkway”。","词根来自“pavilion（亭、棚、帐篷）”。在建筑与园林语境中，pavilion常指开放式的亭子；在活动语境中也可指临时搭建的展棚/帐篷（如展会的pavilion）。"]}
{"word":"pavilioning","summary":{"en":"“Pavilioning” is an uncommon word meaning building/adding pavilions or covering an area with pavilion-like structures.","zh":"“pavilioning”较少见，指搭建或增设亭子/棚亭，或用亭子状结构为某处提供遮蔽与布置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) the act of providing a pavilion or making something into/like a pavilion; using pavilions for shelter or display.","zh":"（不常见）搭建或设置亭子/棚亭；把某物做成或布置成亭子般的样子；用亭子作遮蔽或展示。"},"examples":[{"en":"The garden renovation included pavilioning the main walkway with light wooden structures.","zh":"花园翻新包括在主步道旁搭建轻木结构的亭子。"},{"en":"During the festival, pavilioning helped create shaded areas for food stalls and visitors.","zh":"节日期间，搭建棚亭帮助为摊位和游客创造了阴凉区域。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle) building or placing a pavilion; covering or shading something with a pavilion-like structure.","zh":"（现在分词）正在搭建/设置亭子；用亭子状结构覆盖或遮蔽某物。"},"examples":[{"en":"They are pavilioning the plaza to give performers a covered stage.","zh":"他们正在给广场搭棚亭，为表演者提供有顶舞台。"},{"en":"A crew was pavilioning the seating area before the afternoon sun arrived.","zh":"在午后阳光照过来之前，施工队正在给座位区搭遮棚。"}]}],"synonyms":["canopying","tenting","sheltering"],"phonetic":"/pəˈvɪljənɪŋ/","extraExplanation":["“pavilioning”在现代英语里比较少见，更多时候会直接用名词“pavilion”（亭子/棚亭）或动词短语如“put up a pavilion / build a pavilion”。在园林、建筑、展会布置等语境中偶尔能见到这种动名词/分词用法。"]}
{"word":"pavilions","summary":{"en":"“Pavilions” is the plural of “pavilion”: small park/garden shelters or separate buildings/sections used for events, exhibitions, or specific functions.","zh":"“Pavilions”是“pavilion”的复数：可指公园花园的凉亭/遮蔽处，也可指展馆、馆舍或建筑的独立分区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small building or open-sided shelter, often in a park or garden, used for shade, rest, or events.","zh":"（公园或花园里的）亭子；凉亭；常用于遮阴、休息或举办活动的小建筑（有时四面敞开）。"},"examples":[{"en":"We ate lunch under the pavilion in the park.","zh":"我们在公园的凉亭下面吃了午饭。"},{"en":"The wedding reception was held in a lakeside pavilion.","zh":"婚礼招待会在湖边的亭子里举行。"}]},{"partOfSpeech":"n.","definition":{"en":"A larger separate building or section of a building, especially at a fair, exhibition, hospital, or sports venue, used for a particular purpose.","zh":"（展会/博览会/医院/体育场等的）馆；展馆；（建筑的）独立分区，用于特定用途。"},"examples":[{"en":"The technology companies were all in the main exhibition pavilion.","zh":"科技公司都在主要展馆里。"},{"en":"She was moved to the new patient pavilion after surgery.","zh":"手术后她被转到新的病房楼（病区）。"}]}],"synonyms":["gazebos","shelters","canopies","halls","exhibition halls","wings"],"phonetic":"/pəˈvɪljənz/","extraExplanation":["“Pavilion”常见于公共空间与大型活动：在北美公园里它常指带屋顶的野餐棚（picnic pavilion）；在博览会语境中则更接近“展馆”。","词源来自法语pavillon，原意与“帐篷/营帐”有关，所以有时也会带一点“临时或独立搭建的场馆”的感觉。"]}
{"word":"pavillon","summary":{"en":"Pavillon (more commonly spelled pavilion in English) means a small shelter-like building or an event tent; in anatomy, it can also mean the outer ear.","zh":"pavillon（英语更常写作 pavilion）指凉亭/小亭子或活动用的大帐篷；在解剖学中也可指耳廓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building or open-sided structure, often in a park or garden, used for shade, events, or shelter","zh":"（公园/花园里的）亭子；凉亭；（常用于活动的）小建筑"},"examples":[{"en":"We had lunch under the pavilion to stay out of the sun.","zh":"我们在凉亭下面吃午饭，避开太阳。"},{"en":"The concert will be held at the park pavilion.","zh":"音乐会将在公园的亭子举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a large tent or temporary structure used for public events (fairs, exhibitions, weddings)","zh":"（展会/婚礼等用的）大帐篷；临时展棚"},"examples":[{"en":"The food stalls were set up inside a pavilion at the festival.","zh":"美食摊位在节庆的一个大帐篷里搭起来了。"},{"en":"They rented a pavilion for the outdoor wedding reception.","zh":"他们为户外婚宴租了一个大帐篷。"}]},{"partOfSpeech":"n.","definition":{"en":"(anatomy) the outer part of the ear; the auricle","zh":"（解剖）耳廓"},"examples":[{"en":"The doctor examined the pavilion of the ear for swelling.","zh":"医生检查了耳廓是否肿胀。"}]}],"synonyms":["pavilion","gazebo","shelter","canopy","tent","marquee"],"phonetic":"/pəˈvɪljən/","extraExplanation":["“pavillon”是法语拼写；英语中更常见的形式是“pavilion”。在英文语境里看到“pavillon”，常见于法国相关的地名、建筑名称，或强调法式风格时的用法。","词源上来自法语，和“临时搭建、用于活动的结构”这一概念有关，所以既可指公园里的亭子，也可指展会的大棚/帐篷。"]}
{"word":"pavin","summary":{"en":"“pavin” is usually an informal spelling of “paving,” meaning making a hard surface like a road or walkway; it can also be a personal name.","zh":"“pavin”通常是“paving”的非正式拼写，表示铺路/铺地；也可能是人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, nonstandard) A spelling of “paving,” meaning the act or process of covering the ground with a hard surface (stone, concrete, asphalt).","zh":"（非正式/非标准拼写）“paving”的拼写变体，指用石块、混凝土或沥青等把地面铺成坚硬路面的过程。"},"examples":[{"en":"They’re pavin the road again this summer.","zh":"他们今年夏天又要铺路了。"},{"en":"The park is closed while crews are pavin new walkways.","zh":"公园在施工队铺设新步道期间关闭。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) Used as a name (e.g., a surname or given name), not a common English vocabulary word.","zh":"（少见）用作人名（如姓氏或名字），不是常见的英语词汇。"},"examples":[{"en":"I met someone named Pavin at the conference.","zh":"我在会议上认识了一个叫 Pavin 的人。"}]}],"synonyms":["paving"],"phonetic":"ˈpeɪvɪn","extraExplanation":["“pavin”在标准英语里不常作为正式单词出现，更多是口语/方言里把“paving”末尾的 -g 省略后的写法（类似 goin’ = going）。如果你在写作或正式场合，建议用标准拼写“paving”。","如果你本来想查的是“pave / paving”，也可以告诉我你的句子语境，我能帮你选最贴切的意思与用法。"]}
{"word":"paving","summary":{"en":"Paving refers to making a road or area hard and smooth, or to the hard surface/material itself.","zh":"Paving 指把道路/地面铺硬铺平的过程，也可指铺面或铺路材料本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of covering a road, path, or area with a hard surface (such as asphalt, concrete, or stones)","zh":"铺路；铺设（用沥青、水泥或石块等把道路/地面铺硬）的过程"},"examples":[{"en":"The city is doing road paving this weekend, so expect traffic delays.","zh":"市政府这周末在铺路，所以可能会堵车。"},{"en":"Proper paving helps prevent mud and improves safety in rainy weather.","zh":"良好的铺设能减少泥泞，并在雨天提高安全性。"}]},{"partOfSpeech":"n.","definition":{"en":"a hard surface material used for roads or walkways; paving stones or paving blocks","zh":"（道路/人行道的）铺面材料；铺路石（块）"},"examples":[{"en":"The old street is made of stone paving.","zh":"这条老街是用石头铺面铺成的。"},{"en":"They replaced the broken paving near the entrance.","zh":"他们更换了入口附近破损的铺面砖。"}]},{"partOfSpeech":"v.","definition":{"en":"covering a surface with a hard layer; making a road or area smooth and solid","zh":"铺设；把地面铺硬、铺平（“pave”的现在分词/动名词用法）"},"examples":[{"en":"They are paving the parking lot today.","zh":"他们今天在铺停车场。"},{"en":"Paving the path will make it easier for wheelchairs.","zh":"把小路铺好会让轮椅更容易通行。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with a hard surface (used before a noun)","zh":"铺过的；有铺装路面的（作定语）"},"examples":[{"en":"There’s a paved road, but the paving work isn’t finished yet.","zh":"有一条铺装路，但铺路工程还没完工。"},{"en":"We followed a paving-stone walkway to the garden.","zh":"我们沿着铺路石小道走到花园。"}]}],"synonyms":["surfacing","roadwork","asphalting","pavement","cobblestones"],"phonetic":"/ˈpeɪvɪŋ/","extraExplanation":["常见搭配/习语：**pave the way (for)** 意为“为……铺平道路/创造条件”。例：New policies paved the way for more affordable housing（新政策为更可负担的住房铺平了道路）。","词形提醒：**paving** 可指“铺路工程/铺面材料”，也可作 **pave** 的现在分词（正在铺）或动名词（铺设这件事）。注意与 **paved**（已经铺好的）区分。"]}
{"word":"pavings","summary":{"en":"“Pavings” usually means the stones or materials used to make a hard walking/driving surface, or multiple paving surfaces/projects.","zh":"“pavings”通常指铺路石/铺装材料，或指多处路面铺装/铺设工程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stones, bricks, or concrete pieces laid on the ground to make a hard surface (such as a sidewalk, road, or courtyard).","zh":"（铺路或铺地用的）石块、砖块或混凝土块；铺路材料（如人行道、道路、庭院的铺面）。"},"examples":[{"en":"The old street was made of uneven pavings that shook the bike.","zh":"那条老街由不平整的铺路石组成，骑车时会颠得厉害。"},{"en":"Workers lifted the pavings to repair the water pipe underneath.","zh":"工人把铺路石掀开，修理下面的水管。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of covering the ground with a hard surface (plural: different paving projects or areas).","zh":"铺设硬质地面的行为或过程（复数可指不同的铺设工程或区域）。"},"examples":[{"en":"Recent pavings have improved access for wheelchairs.","zh":"最近的铺设工程改善了轮椅通行。"},{"en":"The park’s pavings are designed to drain rainwater quickly.","zh":"公园的铺装设计能让雨水迅速排走。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle form of “pave,” meaning covering a road or surface with asphalt, stones, etc. (less common to use as “pavings” unless referring to repeated actions).","zh":"动词“pave”的现在分词形式，表示用沥青、石块等铺路/铺地（“pavings”较少这样用，除非强调多次/多处铺设）。"},"examples":[{"en":"The crew is paving the driveway today.","zh":"施工队今天在给车道铺路。"},{"en":"They spent the morning paving and cleaning the area.","zh":"他们早上一直在铺设并清理那片区域。"}]}],"synonyms":["paving stones","pavers","cobblestones","road surfacing","pavement materials"],"phonetic":"/ˈpeɪvɪŋz/","extraExplanation":["在英式英语里更常见用“paving stones”指“铺路石”。“pavings”作复数名词时，多见于较正式或较旧的写法，意思接近“路面铺石/铺装”。","“pave”还有比喻义：pave the way（为……铺平道路/创造条件），但这通常不写成“pavings”。"]}
{"word":"pavins","summary":{"en":"“Pavins” is a rare plural noun meaning slow, formal Renaissance court dances (related to the pavan).","zh":"“pavins”是较少见的复数名词，指文艺复兴时期缓慢、庄重的宫廷舞（与 pavan 相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pavin”: a slow, formal dance from Renaissance Europe, similar to a pavan, often performed in a dignified, processional style.","zh":"“pavin”的复数：文艺复兴时期欧洲的一种缓慢、庄重的宫廷舞（类似 pavan），常以行进式、仪式感强的方式表演。"},"examples":[{"en":"At the history festival, the dancers performed pavins in heavy costumes.","zh":"在历史节庆上，舞者穿着厚重的服装表演了 pavins。"},{"en":"The music sounded like it was written for pavins and other court dances.","zh":"这段音乐听起来像是为 pavins 等宫廷舞写的。"}]}],"synonyms":["pavans","court dances","processional dances"],"phonetic":"/ˈpævɪn/","extraExplanation":["“pavins”在现代英语里非常少见。很多时候，人们其实想写的是“pavings”（铺路石/铺设路面）或“paving”（铺路/铺设）。如果你告诉我句子上下文，我可以帮你判断到底是哪一个。","你也可能在更常见的拼写“pavan”里见到这种舞名；“pavin”可视为相关或变体拼写，用于指类似的庄重宫廷舞。"]}
{"word":"pavior","summary":{"en":"A pavior is a person who paves roads or lays paving stones/brick.","zh":"pavior 指铺路或铺设路面砖石的人（铺路工）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to lay paving stones or pave roads and sidewalks (a road paver).","zh":"铺路工；铺设人行道或道路（铺砖、铺石或铺沥青）的人。"},"examples":[{"en":"The pavior worked carefully to keep the stone pattern straight.","zh":"铺路工小心施工，确保石块的图案排列整齐。"},{"en":"In the old town, a pavior repaired the uneven cobblestones after the storm.","zh":"在老城区，暴风雨过后铺路工修补了不平整的鹅卵石路面。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, sometimes historical) A worker who sets paving bricks/tiles, especially in formal or older writing.","zh":"（较少见，偏历史/较正式用法）专门铺设路砖或地砖的工人。"},"examples":[{"en":"The records mention a pavior hired to repave the courtyard.","zh":"记录中提到雇了一名铺砖工来重新铺设庭院。"}]}],"synonyms":["paver","road worker","paving worker","paving contractor"],"phonetic":"/ˈpeɪviər/","extraExplanation":["“pavior”也常拼作“paviour”（英式拼法更常见）。","词源上来自“pave（铺路）+ -or（表示执行者）”。在现代日常英语里更常用“paver”（既可指工人，也可指铺路机/铺砖块），而“pavior”带有偏旧或书面色彩。"]}
{"word":"paviors","summary":{"en":"“Paviors” means workers who pave roads or walkways.","zh":"“paviors”指铺路或铺设人行道的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to pave roads, sidewalks, or streets (plural of “pavior”).","zh":"铺路工人；铺设道路/人行道的人（“pavior”的复数）。"},"examples":[{"en":"The city hired paviors to repair the old cobblestone street.","zh":"市政府雇了铺路工人来修复那条老鹅卵石街道。"},{"en":"Skilled paviors laid the bricks in a neat pattern.","zh":"技术娴熟的铺路工人把砖按整齐的图案铺好。"}]}],"synonyms":["pavers","road workers","paving crew"],"phonetic":"/ˈpeɪviər/","extraExplanation":["“pavior”来自动词 “pave”（铺路）。在现代英语里更常见的说法是 “pavers”（铺路工人）或 “paving workers/crew”。","在文学或历史语境中，“pavior(s)”有时用来描写旧时城市街道施工的人群（如铺石板路、铺砖路）。"]}
{"word":"paviotso","summary":{"en":"“paviotso” isn’t a recognized English word; it’s likely a misspelling or a proper noun.","zh":"“paviotso”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语词汇。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “paviotso” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“paviotso”——你能把看到它的句子发我吗？"},{"en":"If you meant a similar word, please check the spelling and try again.","zh":"如果你想查的是相近的词，请确认拼写后再试一次。"}]}],"extraExplanation":["我可能需要更多信息才能准确判断你想查的词：\n1）它出现在哪句话/哪段文字里？\n2）是人名、地名、品牌名，还是普通词？\n3）你想表达的意思是什么（中文也可以）？\n\n另外，你可以先检查是否是打字误差（例如多/少了一个字母）。把上下文贴出来，我可以帮你推测最可能的正确拼写与含义。"]}
{"word":"paviour","summary":{"en":"A paviour is a person who paves roads; less commonly, it can mean a paving stone.","zh":"paviour 指铺路工；较少见时也可指铺路石（铺路砖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to pave roads, streets, or other surfaces (a paver).","zh":"铺路工；铺设路面的人（也作 pavior / paver）。"},"examples":[{"en":"The paviour laid fresh stone blocks along the old street.","zh":"铺路工沿着老街铺上了新的石块。"},{"en":"In the past, a skilled paviour could transform a muddy lane into a solid roadway.","zh":"过去，手艺好的铺路工能把泥泞的小路变成结实的道路。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a paving stone or block used for making a paved surface.","zh":"（较少见）铺路石；路面石块。"},"examples":[{"en":"The courtyard was made of small paviours set in neat rows.","zh":"院子由一排排整齐铺设的小块铺路石组成。"}]}],"synonyms":["paver","pavior","road worker","paving stone (for the stone meaning)"],"phonetic":"/ˈpeɪviər/","extraExplanation":["“paviour”是英式拼写，更常见的形式是“pavior”（美式）或更通用的“paver”。在现代英语里，人们通常用“paver”指铺路工或铺路设备，用“paving stone / paver”指铺路砖（石）。"]}
{"word":"paviours","summary":{"en":"Paviours are either (1) workers who lay paving stones, or (2) paving stones themselves (less common).","zh":"paviours可指（1）铺路工，（2）铺路石（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to lay paving stones or bricks (a road worker who makes pavements/sidewalks or stone surfaces)","zh":"铺路工；铺设路面石块/砖块的人"},"examples":[{"en":"The paviours worked all morning, setting each stone carefully.","zh":"铺路工们忙了一上午，小心地把每块石头铺好。"},{"en":"After the pipes were repaired, paviours restored the street surface.","zh":"管道修好后，铺路工把街道路面重新铺回原样。"}]},{"partOfSpeech":"n.","definition":{"en":"paving stones used to make a path or road surface (less common; often British usage)","zh":"（较少见；常见于英式用法）铺路石；路面石块"},"examples":[{"en":"The garden path is made of old paviours.","zh":"花园小路是用旧的铺路石铺成的。"},{"en":"Some paviours were loose after the heavy rain.","zh":"暴雨过后，有些铺路石松动了。"}]}],"synonyms":["pavers","road workers","paving stones","cobblestones"],"phonetic":"/ˈpeɪviərz/","extraExplanation":["“paviours”是复数形式，单数是“paviour”。在现代英语里，这个词更常见于英式英语或较正式/行业语境；美式英语里更常说“paving stones”（铺路石）和“paver”（铺路工/铺路机，视语境而定）。","词源上与“pave”（铺路）同源，和“pavement”（人行道/路面）也有关。"]}
{"word":"pavire","summary":{"en":"“Pavire” is not standard English; you probably want “pave,” “paver,” or “pavement.”","zh":"“pavire”不是标准英文；你可能想写的是“pave / paver / pavement”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “pave” (to cover a road/path with stones or concrete) or “paver”/“pavement.”","zh":"不是标准英文单词。很可能是把 “pave”（铺路、铺设）或 “paver / pavement”（铺路工人 / 人行道、路面）拼错了。"},"examples":[{"en":"If you mean the verb, use: “They plan to pave the road next week.”","zh":"如果你想表达动词，用：“They plan to pave the road next week.”（他们计划下周把这条路铺好。）"},{"en":"If you mean the noun, use: “Don’t ride your bike on the pavement.”","zh":"如果你想表达名词，用：“Don’t ride your bike on the pavement.”（不要在人行道上骑车。）"}]}],"synonyms":["pave","lay (a road)","surface"],"phonetic":"/pəˈvaɪr/","extraExplanation":["“pavire”有时会出现在拼写错误、OCR识别错误（扫描文本自动识别）或非英语语境中。在法语里有与“铺路”相关的词根（pav-），但英语常用的是 pave / paver / pavement。"]}
{"word":"pavis","summary":{"en":"A pavis is a large medieval shield used as cover, especially by crossbowmen.","zh":"pavis 指中世纪用于掩护的大型盾牌，尤其常见于弩兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, tall shield (often carried on the ground) used in the Middle Ages to protect soldiers—especially crossbowmen—while they reloaded","zh":"（中世纪的）大型高盾牌，常立在地上作掩护，尤其用于保护弩兵在装填时不受攻击"},"examples":[{"en":"The crossbowman crouched behind a pavis while he reloaded.","zh":"弩兵在装填时蹲在一面大盾后面作掩护。"},{"en":"In the museum, you can see a pavis painted with a coat of arms.","zh":"在博物馆里，你能看到一面绘有家族纹章的大盾。"},{"en":"The soldiers set up their pavises like a wall before the battle began.","zh":"士兵们把大盾立起来，像一堵墙一样，战斗开始前就形成防线。"}]}],"synonyms":["pavise","large shield","siege shield"],"phonetic":"/ˈpævɪs/","extraExplanation":["更常见的拼写是 pavise；pavis 属于较少见/较旧的变体拼写。","这类盾牌常见于欧洲中世纪攻城与野战，尺寸很大，便于“立盾”形成临时掩体，特别适合装填较慢的弩手。","词源上与法语（Old French）pavois 有关，英语里多通过军事史写作或奇幻/历史小说出现。"]}
{"word":"pavisade","summary":{"en":"Palisade means a strong fence/wall of stakes used for defense, or the act of surrounding something with such a fence.","zh":"Palisade 指用于防御的木桩栅栏/墙，也指用这种栅栏把某处围住、加以防护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fence or defensive wall made of strong wooden stakes (or sometimes metal), especially used to protect a place.","zh":"（尤指防御用的）木桩栅栏；（有时为金属的）防护墙。"},"examples":[{"en":"The village built a palisade to protect itself from raids.","zh":"村庄修建了木桩栅栏来防御突袭。"},{"en":"They hid behind the palisade as arrows flew overhead.","zh":"箭从头顶飞过时，他们躲在栅栏后面。"}]},{"partOfSpeech":"v.","definition":{"en":"To surround or protect something with a palisade; to fence in strongly.","zh":"用木桩栅栏围住；用栅栏坚固地防护。"},"examples":[{"en":"The settlers palisaded the fort during the winter.","zh":"拓荒者在冬天用木桩栅栏加固围住堡垒。"},{"en":"The garden was palisaded to keep animals out.","zh":"花园用栅栏围起来，防止动物进入。"}]}],"synonyms":["fence","stockade","barrier","rampart"],"phonetic":"/ˌpælɪˈseɪd/","extraExplanation":["你输入的“pavisade”很可能是拼写错误；常见正确拼写是 **palisade**。","**palisade** 常出现在历史与战争语境（如堡垒、要塞、殖民地据点的防御工事），也可在文学/叙事中用来营造“被围住、被保护或被隔绝”的画面感。"]}
{"word":"pavisado","summary":{"en":"Pavisado is a Spanish adjective meaning “warned/alerted,” and in some informal uses, “streetwise/cautious.”","zh":"Pavisado 是西班牙语形容词，常指“已被提醒/警告”，口语里也可指“精明、警惕”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) warned; alerted in advance.","zh":"（西语）被提醒的；事先被警告的。"},"examples":[{"en":"I was pavisado that the meeting time might change.","zh":"我事先被提醒过会议时间可能会变。"},{"en":"They kept everyone pavisado about the storm.","zh":"他们让所有人都提前知晓那场暴风雨。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish, informal in some regions) streetwise; cautious and not easily fooled.","zh":"（西语，部分地区的口语）精明的；小心谨慎、不容易被骗的。"},"examples":[{"en":"She’s very pavisada—she notices problems early.","zh":"她很精明——很早就能发现问题。"},{"en":"Stay pavisado when buying things online.","zh":"网购时要保持警惕。"}]}],"synonyms":["warned","alerted","cautious","on guard"],"phonetic":"/ˌpɑ.viˈsɑ.doʊ/","extraExplanation":["“pavisado”不是英语单词，而是西班牙语用法。它来自动词“avisar”（提醒、通知），“pavisado”常被理解为“已被提醒/已被告知”。","在不同西语地区，“estar/andar pavisado”有时带有“机灵、警惕、别大意”的语气，接近英语里的“be on alert / be careful / be street-smart”。","如果你是在英语对话里看到它，多半是西英混用（Spanglish）或保留原词的表达；正式英文写作中通常会换成“warned/alerted/cautious”。"]}
{"word":"pavise","summary":{"en":"A large medieval shield, often planted on the ground to protect a soldier—especially a crossbowman—while reloading.","zh":"一种中世纪的大型盾牌，常立在地上充当掩护，尤用于保护装填中的弩手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large shield used in the Middle Ages, often set on the ground to protect soldiers (especially crossbowmen or archers) while they reloaded or took cover.","zh":"（中世纪的）大型盾牌，常立在地上，用来保护士兵（尤指弩手或弓箭手）在装填或躲避时免受攻击。"},"examples":[{"en":"The crossbowman crouched behind a pavise while he reloaded.","zh":"弩手在装填弩箭时蹲在大盾（pavise）后面。"},{"en":"The museum displayed a painted pavise from 15th-century Europe.","zh":"博物馆展出了一面15世纪欧洲的彩绘大盾（pavise）。"}]}],"synonyms":["shield","tower shield"],"phonetic":"/pəˈviz/","extraExplanation":["pavise 多与中世纪战争场景相关，常见于城市民兵、攻城战或弩兵队伍。它通常很高、较窄，可立在地上当作“移动掩体”。","词源一般认为与意大利城市帕维亚（Pavia）有关：这种盾在当地制作或使用而得名；历史文献中也常见拼写变体。"]}
{"word":"paviser","summary":{"en":"A paviser is a medieval soldier who used a large protective shield called a pavise, often to shield crossbowmen.","zh":"paviser 指使用大型护盾（pavise）的中世纪士兵，常用于为弩手提供掩护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soldier (especially in medieval times) who carried or used a pavise—a large shield used for protection, often by crossbowmen.","zh":"（尤指中世纪的）持盾兵；使用“pavise（大型护盾）”的士兵，常见于弩手身边用于防护。"},"examples":[{"en":"The crossbowmen advanced while a paviser held a tall shield in front of them.","zh":"弩手推进时，一名持盾兵把一面高大的护盾举在他们前方。"},{"en":"In the painting, a paviser kneels to steady the pavise against incoming arrows.","zh":"在这幅画里，一名持盾兵跪下把大型护盾稳住，以抵挡飞来的箭。"}]}],"synonyms":["pavise-bearer","shield-bearer"],"phonetic":"/ˈpævaɪzɚ/","extraExplanation":["“Paviser”来自“pavise”（大型护盾）。pavise 常见于中世纪欧洲战场与攻城战：盾体很高、能立在地上，为装填较慢的弩手提供掩护。你也可能在历史小说、战争题材游戏或博物馆解说中看到这个词。","相关词：pavise（n. 大型护盾）、crossbowman（n. 弩手）。"]}
{"word":"pavisers","summary":{"en":"“Pavisers” are medieval soldiers who carried large pavise shields to protect archers or crossbowmen.","zh":"“pavisers”指中世纪携带帕维斯大盾、为弓箭手或弩手提供掩护的盾牌手（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Soldiers or attendants who carried a large shield (a pavise) to protect archers or crossbowmen, especially in medieval warfare.","zh":"（复数）持大型盾牌（pavise，帕维斯盾）为弓箭手或弩手提供掩护的人，尤指中世纪战争中的盾牌手/护盾随从。"},"examples":[{"en":"In the battle scene, pavisers advanced first, planting their shields before the crossbowmen.","zh":"在战斗场景中，盾牌手先推进，把大盾立在弩手前方。"},{"en":"The archers waited behind the pavisers’ pavises until the enemy drew near.","zh":"弓箭手躲在盾牌手的大盾后，等敌人靠近。"}]}],"synonyms":["shield-bearers","pavise-bearers","men-at-arms (broader)"],"phonetic":"/ˈpævɪzərz/","extraExplanation":["“pavisers”是较少见、偏历史/文学用语，单数为“paviser”。它来自“pavise”（一种可立在地上、用于遮挡箭矢的高大盾牌），常见于描写中世纪攻城战或弩兵队形的语境。"]}
{"word":"pavises","summary":{"en":"“Pavises” are large medieval shields used as protective cover, especially for crossbowmen; it’s the plural of “pavise.”","zh":"“pavises”指中世纪用于掩护的大型盾牌（尤用于弩手），是“pavise”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pavise: a large shield, often carried or set upright to protect soldiers (especially crossbowmen) during battle or sieges.","zh":"pavise 的复数：一种大型盾牌，常由士兵携带或竖立在地面上，用来在战斗或攻城战中提供掩护（尤其保护弩手）。"},"examples":[{"en":"The crossbowmen hid behind pavises while they reloaded.","zh":"弩手在 pavises 后面装填弩箭。"},{"en":"During the siege, guards lined the walls with pavises for extra cover.","zh":"在攻城战期间，守卫在城墙上排列 pavises 来增加掩护。"}]}],"synonyms":["shields","protective screens","mantlets"],"phonetic":"pəˈviz","extraExplanation":["“pavise”常见于中世纪欧洲军事语境，尤其与弩兵/弓兵有关：盾牌体积大，能像“移动掩体”一样挡住箭矢与投射物；有时会在盾面上绘制城市徽章、宗教图案或军队标志。","词形提醒：单数是 pavise，复数是 pavises。现代英语中较少日常使用，多见于历史书写、博物馆说明、奇幻/历史题材小说与游戏。"]}
{"word":"pavisor","summary":{"en":"Pavisor is a rare word, usually meaning someone who carried a pavise (a large medieval shield).","zh":"Pavisor 是个少见词，通常指携带/使用 pavise（中世纪大型盾牌）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier or attendant who carried or used a large shield called a pavise (often to protect archers or crossbowmen).","zh":"（中世纪）持用或携带“pavise（大型盾牌）”的士兵/随从（常为弓箭手或弩手提供掩护）。"},"examples":[{"en":"The pavisor set the pavise in front of the crossbowman before the next volley.","zh":"持盾者把大盾立在弩手前面，准备迎接下一轮齐射。"},{"en":"In some accounts, a pavisor protected archers while they reloaded.","zh":"在一些记载中，持盾者会在弓箭手装填/上箭时提供掩护。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who lays pavement; a paver.","zh":"（罕见）铺路的人；铺设路面的工人。"},"examples":[{"en":"The old text mentions a pavisor working on the town road.","zh":"那篇旧文提到一位铺路工在修镇上的道路。"}]}],"synonyms":["paviser","shield-bearer","paver (rare sense)"],"phonetic":"/ˈpævɪzər/","extraExplanation":["“pavisor”非常少见，更常见的拼法是“paviser / pavisour”（持用 pavise 的人）。","pavise（也作 pavis）是一种中世纪欧洲常见的大型盾牌，有时会立在地上当作移动掩体，尤其常与弩手搭配。"]}
{"word":"pavisse","summary":{"en":"A pavisse is a large medieval shield, often set on the ground to protect a crossbowman while reloading.","zh":"pavisse 指一种中世纪的大型盾牌，常立在地上，用来保护弩兵装填时的安全。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A large, often rectangular shield used especially by crossbowmen in the Middle Ages; it could be set on the ground to protect the soldier while reloading.","zh":"（历史用语）一种中世纪常见的大型盾牌，常为长方形，尤其供弩兵使用；可立在地上，为士兵装填弩箭时提供掩护。"},"examples":[{"en":"The crossbowman crouched behind a pavisse while he reloaded.","zh":"弩兵在装填弩箭时蹲在一面大盾（pavisse）后面掩护自己。"},{"en":"Museums sometimes display a pavisse painted with a city’s coat of arms.","zh":"博物馆里有时会展出绘有城市纹章的长方大盾（pavisse）。"}]}],"synonyms":["pavis","pavise","large shield","crossbowman’s shield"],"phonetic":"/pəˈvis/","extraExplanation":["“pavisse”是较少见的拼写形式，更常见的是“pavis / pavise”。它与中世纪战争技术有关：弩上弦与装填较慢，因此需要可竖立在地面的“大盾”提供固定掩护。","在欧洲城市民兵与雇佣兵中很常见，有的盾面会绘制纹章或宗教图案，兼具识别与士气作用。"]}
{"word":"pavlov","summary":{"en":"Pavlov is best known as the scientist behind classical conditioning; in everyday English it also points to automatic learned reactions (“Pavlovian”).","zh":"Pavlov最著名的是提出经典条件作用的科学家；日常英语中也可用来指“自动的、被训练出来的反应”（Pavlovian）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ivan) Pavlov: a Russian physiologist (1849–1936) famous for research that led to the idea of classical conditioning (learning by association).","zh":"（伊万）巴甫洛夫：俄国生理学家（1849–1936），因研究提出“经典条件作用/古典制约”（联结学习）而著名。"},"examples":[{"en":"In psychology class, we studied Pavlov and classical conditioning.","zh":"在心理学课上，我们学习了巴甫洛夫和经典条件作用。"},{"en":"Pavlov’s experiments are often mentioned when talking about learned habits.","zh":"谈到习得的习惯时，人们常会提到巴甫洛夫的实验。"}]},{"partOfSpeech":"n.","definition":{"en":"(in everyday language) a reference to automatic, learned reactions—often used when people say something is “Pavlovian.”","zh":"（日常用法）用来指“自动的、后天习得的反应”；常见于说某事很“巴甫洛夫式（Pavlovian）”的时候。"},"examples":[{"en":"The smell of coffee is Pavlovian for me—I feel awake immediately.","zh":"咖啡的味道对我来说很“巴甫洛夫式”——我立刻就清醒了。"},{"en":"He has a Pavlov reaction to notifications and checks his phone right away.","zh":"他对通知有一种“巴甫洛夫反应”，马上就会去看手机。"}]}],"synonyms":["classical conditioning","Pavlovian response","learned association"],"phonetic":"/ˈpæv.lɔf/","extraExplanation":["“巴甫洛夫的狗”是最常见的文化梗：狗原本只会对食物分泌唾液，但在多次把“铃声”和“喂食”配对后，后来只听到铃声也会流口水。这里的铃声叫“条件刺激”，流口水叫“条件反应”。","英语里常说“Pavlovian response/reaction（巴甫洛夫式反应）”，通常带一点调侃，强调某种反应几乎是不假思索、被环境训练出来的。","相关词：Pavlovian（形容词，意为“巴甫洛夫式的”）、classical conditioning（经典条件作用）、conditioned response（条件反应）。"]}
{"word":"pavlovian","summary":{"en":"Pavlovian means “conditioned and automatic,” especially like a reflex formed by past associations (classical conditioning).","zh":"Pavlovian 指“被条件化而自动发生的反应”，尤指类似经典条件反射那样由过去联结形成的反射式反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Ivan Pavlov’s experiments on classical conditioning; describing behavior that happens automatically because it has been conditioned by past associations.","zh":"与巴甫洛夫（Ivan Pavlov）的经典条件反射实验有关；形容由于过去的联结而被“训练”出来、几乎自动发生的反应。"},"examples":[{"en":"When he hears the notification sound, he has a Pavlovian urge to check his phone.","zh":"他一听到通知提示音，就会产生一种“巴甫洛夫式”的冲动去看手机。"},{"en":"Some ads try to create a Pavlovian link between a product and happiness.","zh":"有些广告试图在产品与快乐之间建立一种“巴甫洛夫式”的联结。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) Reflex-like, automatic, or unthinking; triggered immediately by a specific cue.","zh":"（更广义）像反射一样、自动的、几乎不经思考的；由某个特定刺激立刻触发的。"},"examples":[{"en":"Her Pavlovian reaction was to apologize, even when she wasn’t at fault.","zh":"她的“巴甫洛夫式”反应就是先道歉，即使并不是她的错。"},{"en":"He gave a Pavlovian smile when the boss walked in.","zh":"老板一走进来，他就条件反射般地笑了笑。"}]}],"synonyms":["conditioned","reflexive","automatic","knee-jerk"],"phonetic":"/pævˈloʊviən/","extraExplanation":["“Pavlovian”来自俄国生理学家伊万·巴甫洛夫（Ivan Pavlov）。他通过“狗听到铃声就流口水”的实验说明：如果一个中性刺激（铃声）反复与自然刺激（食物）一起出现，就可能形成条件反射。","在心理学里，“Pavlovian conditioning”常与“operant conditioning（操作性条件作用）”对比：前者强调刺激之间的联结导致自动反应；后者强调行为与结果（奖励/惩罚）之间的关系。","日常英语中用Pavlovian往往带一点批评或幽默意味，暗示某人“被训练得”对某种提示做出固定反应。"]}
{"word":"pavo","summary":{"en":"Pavo is mainly used in English as the name of a southern constellation, meaning “peacock,” and it can also refer to the Latin word for “peacock.”","zh":"Pavo 在英语中主要指南天星座“孔雀座”，意为“孔雀”；也可指拉丁语中的“孔雀”一词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a southern constellation whose name means “peacock.”","zh":"（天文）孔雀座：南天星座之一，名称意为“孔雀”。"},"examples":[{"en":"On a clear night in the Southern Hemisphere, you can look for Pavo near the Milky Way.","zh":"在南半球的晴朗夜晚，你可以在银河附近寻找孔雀座（Pavo）。"},{"en":"The star system in Pavo is sometimes mentioned in astronomy guides.","zh":"天文指南中有时会提到孔雀座（Pavo）里的恒星系统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Latin word for “peacock,” sometimes used in names, mottos, or scholarly contexts.","zh":"（拉丁语）“孔雀”：有时出现在名称、格言或学术语境中。"},"examples":[{"en":"In Latin, pavo means “peacock.”","zh":"在拉丁语里，pavo 的意思是“孔雀”。"},{"en":"Some older scientific or artistic works use Latin terms like pavo.","zh":"一些较早的科学或艺术作品会使用像 pavo 这样的拉丁词。"}]}],"synonyms":["the Peacock (constellation name/meaning)","Pavo constellation"],"phonetic":"/ˈpeɪvoʊ/","extraExplanation":["在英语里，Pavo 最常见的用法是星座名（首字母大写）。它属于 16 世纪末由航海时代的天文学家以“异域动物”为主题命名的一组南天星座之一。","如果你在西班牙语语境看到 pavo，它常指“火鸡”，但这不是英语里的常规词义。"]}
{"word":"pavois","summary":{"en":"A pavois is a large medieval-style shield, or (less commonly) a movable protective screen used as cover.","zh":"pavois 指（多为中世纪的）大盾牌；较少用时也指可移动的防护屏障/掩护挡板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large shield (often used in the Middle Ages), sometimes carried by soldiers to protect themselves or others.","zh":"（尤指中世纪使用的）大盾牌；常由士兵携带，用来保护自己或他人。"},"examples":[{"en":"The crossbowmen hid behind a pavois while they reloaded.","zh":"弩兵在重新装填时躲在大盾牌（pavois）后面。"},{"en":"In the museum, a tall pavois stood beside the suit of armor.","zh":"在博物馆里，一面高大的大盾牌（pavois）立在盔甲旁边。"}]},{"partOfSpeech":"n.","definition":{"en":"A movable protective screen or barrier, used as cover (less common).","zh":"（较少用）可移动的防护屏障；用作掩护的挡板。"},"examples":[{"en":"They set up a pavois to shield the workers from flying debris.","zh":"他们搭起一道可移动的防护挡板（pavois），保护工人免受飞散碎片影响。"}]}],"synonyms":["shield","large shield","buckler (not the same: usually small)","portable barrier","protective screen"],"phonetic":"/pəˈvɔɪ/","extraExplanation":["“pavois”是历史/文学语境中更常见的词，现代英语里通常会用“shield”“large shield”“portable barrier”等更普通的表达。","词源上来自中古法语 pavois，和欧洲中世纪战争、防御工事的描述联系紧密；在一些历史小说、骑士故事或博物馆解说中更容易遇到。"]}
{"word":"pavonated","summary":{"en":"Pavonated means showing peacock-like iridescent colors that shift with the light.","zh":"pavonated 指“像孔雀羽毛一样的虹彩变色光泽”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shimmering, iridescent surface that shows changing colors, like a peacock’s feathers.","zh":"呈孔雀羽毛般的虹彩光泽；表面会随角度变化而显现不同颜色。"},"examples":[{"en":"In the sunlight, the metal looked pavonated—blue, green, and purple at once.","zh":"在阳光下，那块金属呈现孔雀般的虹彩光泽，蓝绿紫交织。"},{"en":"She chose a pavonated nail polish that shifted colors when she moved her hands.","zh":"她选了一款带孔雀虹彩的指甲油，手一动颜色就会变化。"},{"en":"The beetle’s pavonated shell caught everyone’s attention.","zh":"那只甲虫带虹彩的外壳吸引了所有人的目光。"}]}],"synonyms":["iridescent","opalescent","pearlescent","shimmering"],"phonetic":"/ˈpævəˌneɪtɪd/","extraExplanation":["“pavonated”是比较少见、偏文学或技术描述的词，常用来描写金属、昆虫外壳、玻璃釉面等出现“虹彩/变彩”的效果。","词源来自拉丁语 pavo（孔雀）。在一些工艺语境中也会用来形容金属表面经过处理后出现类似孔雀色的蓝紫绿渐变（有时也叫 peacock finish）。","更常见的近义表达包括：iridescent（虹彩的）、opalescent（蛋白石般变彩的）、pearlescent（珠光的）。"]}
{"word":"pavonazzetto","summary":{"en":"Pavonazzetto is a decorative marble, typically white with purple veining, used in architecture and interior design.","zh":"Pavonazzetto 指一种常见白底紫纹的装饰性大理石，常用于建筑与室内设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative marble (often white with purple or violet veining) used in architecture and interior design; also called “pavonazetto.”","zh":"一种装饰性大理石（常为白底带紫色/紫红色纹理），常用于建筑与室内装饰；也写作 pavonazetto。"},"examples":[{"en":"The museum’s lobby is faced with pavonazzetto marble, giving it a soft purple glow.","zh":"博物馆大厅外墙使用了 pavonazzetto 大理石，看起来带着柔和的紫色光泽。"},{"en":"Designers often pair pavonazzetto with brass and dark wood for a classic look.","zh":"设计师常把 pavonazzetto 与黄铜、深色木材搭配，营造经典质感。"}]}],"synonyms":["pavonazetto","purple-veined marble","decorative marble"],"phonetic":"ˌpɑːvoʊnɑːˈzɛtoʊ","extraExplanation":["“Pavonazzetto”源自意大利语，和“pavone（孔雀）”同源，常被理解为“带孔雀般紫色纹理的石材”。在艺术史与建筑语境里，这个词多用于指一种名贵的古典装饰石材，常见于罗马/文艺复兴风格的柱子、墙面贴面与地面拼花。","英文材料与设计行业中更常见的拼写是“pavonazetto”（少一个 z），但两者通常指同一类石材；在采购或查资料时可以两种拼写都搜索。"]}
{"word":"pavonazzo","summary":{"en":"Pavonazzo is a white marble with purple veining, used as a luxurious decorative stone; it can also describe something made of or resembling that marble.","zh":"Pavonazzo 指一种白底带紫色纹理的装饰性大理石，也可形容具有这种大理石材质或外观的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative white marble with purple or violet veining, often used for columns, floors, and sculpture (especially in Roman and Italian architecture).","zh":"一种装饰性大理石，底色多为白色，带紫色或紫红色纹理，常用于柱子、地面与雕刻（尤见于古罗马与意大利建筑）。"},"examples":[{"en":"The museum’s staircase is clad in pavonazzo, with dramatic purple veins running through the stone.","zh":"博物馆的楼梯铺贴了pavonazzo大理石，石材中穿过醒目的紫色纹理。"},{"en":"Roman builders prized pavonazzo for its luxurious look in temples and public baths.","zh":"古罗马建筑师很看重pavonazzo的华丽外观，常把它用于神庙和公共浴场。"}]},{"partOfSpeech":"adj.","definition":{"en":"(by extension) made of, or resembling, this purple-veined marble.","zh":"（引申）由这种紫纹大理石制成的；或外观类似这种紫纹大理石的。"},"examples":[{"en":"They chose a pavonazzo finish for the lobby walls to create a classical, high-end feel.","zh":"他们为大堂墙面选择了pavonazzo风格的饰面，以营造古典而高级的氛围。"}]}],"synonyms":["purple-veined marble","pavonazzetto","Docimian marble"],"phonetic":"ˌpævəˈnɑːtsoʊ","extraExplanation":["“Pavonazzo”来自意大利语，和“pavone（孔雀）”有关，暗示石材纹理带有孔雀羽毛般的紫色/彩色感觉。","在艺术史与建筑史语境里，你也可能见到近似词形“pavonazzetto”（意大利语指“小的/较淡的pavonazzo”）或英文资料里的“Docimian marble”，常用来指古罗马时期著名产地的同类紫纹大理石。"]}
{"word":"pavoncella","summary":{"en":"“Pavoncella” is an Italian word meaning “lapwing” (especially the Northern lapwing).","zh":"“pavoncella”是意大利语，意思是“凤头麦鸡/北凤头麦鸡”（英语 lapwing）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a lapwing, especially the Northern lapwing—a medium-sized bird with a wispy crest, often seen in open fields and wetlands.","zh":"（意大利语）凤头麦鸡（常指北凤头麦鸡）——一种中等体型、头顶有细长羽冠的鸟，常见于田野与湿地。"},"examples":[{"en":"In Italian bird guides, the Northern lapwing is called “pavoncella.”","zh":"在意大利语的鸟类图鉴里，北凤头麦鸡叫作“pavoncella”。"},{"en":"We watched a pavoncella lift off from the wet grass, calling loudly as it flew.","zh":"我们看见一只pavoncella从湿草地起飞，边飞边大声鸣叫。"}]}],"synonyms":["lapwing","Northern lapwing"],"phonetic":"/ˌpɑːvoʊnˈtʃɛlə/","extraExplanation":["“pavoncella”是意大利语词，日常最常用来指“凤头麦鸡/北凤头麦鸡”（英语 lapwing）。虽然词形看起来像“pavone（孔雀）”的指小形式，但在现代用法里它主要就是一种鸟名。","在英文语境中它多出现在意大利相关文本（如自然观察、旅行、菜单或地名文化介绍）里；一般英文写作更常直接用“lapwing”。"]}
{"word":"pavone","summary":{"en":"“Pavone” is Italian for “peacock,” and it’s also used as a surname.","zh":"“pavone”在意大利语中是“孔雀”，也常用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a peacock.","zh":"（意大利语）孔雀。"},"examples":[{"en":"In Italian, “pavone” means “peacock.”","zh":"在意大利语里，“pavone”意思是“孔雀”。"},{"en":"The painting shows a bright blue pavone with its tail spread.","zh":"这幅画里有一只亮蓝色的孔雀（pavone）开屏。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname), especially in Italian-speaking contexts.","zh":"（常见于意大利语语境的）姓氏“Pavone”。"},"examples":[{"en":"Dr. Pavone will speak at the conference tomorrow.","zh":"Pavone 医生将于明天在会议上发言。"},{"en":"Her last name is Pavone, and her family is from southern Italy.","zh":"她的姓是 Pavone，家族来自意大利南部。"}]}],"synonyms":["peacock"],"phonetic":"/pɑˈvoʊneɪ/","extraExplanation":["“pavone”来自拉丁语“pāvo”（孔雀）。在意大利语与相关文化里，孔雀常用来象征华丽、炫耀与自信；因此在学习相关词汇时，你可能还会见到英语形容词“pavonine”（像孔雀一样的、孔雀般华丽的）。"]}
{"word":"pavonia","summary":{"en":"Pavonia is a plant genus name (mallow family), often seen in botanical or gardening contexts.","zh":"Pavonia 是一种植物属名（锦葵科），多用于植物学或园艺语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the mallow family (Malvaceae), including several ornamental species with hibiscus-like blooms.","zh":"锦葵科（Malvaceae）的一属开花植物（Pavonia 属），其中一些物种常作观赏植物，花形有点像木槿/扶桑。"},"examples":[{"en":"Pavonia flowers are often grown as ornamentals in warm climates.","zh":"Pavonia 属的花常在温暖地区作为观赏植物栽培。"},{"en":"The gardener labeled the plant as Pavonia, a relative of hibiscus.","zh":"园丁把这株植物标注为 Pavonia 属，算是木槿（hibiscus）的近亲。"}]}],"synonyms":["mallow family plant (general)","hibiscus-like plant (informal)"],"phonetic":"/pəˈvoʊniə/","extraExplanation":["“Pavonia”是拉丁化的植物学属名，常见于植物标签、园艺书和学名中。该属名一般被认为与18世纪西班牙植物学家 José Antonio Pavón（何塞·安东尼奥·帕冯）有关，用来纪念他在植物研究方面的贡献。","日常英语里它不算常用词，多出现在园艺、植物学或自然科普语境；写作时通常首字母大写（Pavonia），表示属名。"]}
{"word":"pavonian","summary":{"en":"Pavonian means “peacock-like,” often implying bright, showy colors; less commonly, it can refer to the constellation Pavo in astronomy.","zh":"pavonian 意为“像孔雀的”，常指色彩华丽、显眼；较少见时也可指天文学中的孔雀座（Pavo）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a peacock or peafowl; peacock-like (often suggesting bright, showy colors).","zh":"与孔雀（孔雀科鸟类）有关的；像孔雀的（常含“色彩华丽、显眼”的意味）。"},"examples":[{"en":"The designer chose a pavonian color palette of deep blues and greens.","zh":"设计师选择了一组孔雀般的配色：深蓝和翠绿。"},{"en":"Her pavonian dress shimmered under the stage lights.","zh":"她那件孔雀般华丽的裙子在舞台灯光下闪闪发光。"},{"en":"The garden sculpture had a pavonian curve like a peacock’s tail.","zh":"花园雕塑的弧线像孔雀尾羽一样优雅张扬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Astronomy, less common) Of or connected with the constellation Pavo (the Peacock), as in star names like “Alpha Pavonis.”","zh":"（天文学，较少见）与孔雀座（Pavo）有关的；用于恒星命名等，如“Alpha Pavonis（孔雀座α星）”。"},"examples":[{"en":"The chart labels the bright star as Alpha Pavonis.","zh":"星图把那颗亮星标注为 Alpha Pavonis（孔雀座α星）。"},{"en":"She studied pavonian stars visible from the Southern Hemisphere.","zh":"她研究了南半球可见的孔雀座相关恒星。"}]}],"synonyms":["pavonine","peacock-like","peafowl-related","showy","iridescent"],"phonetic":"/pəˈvoʊniən/","extraExplanation":["“pavonian”来自拉丁语 pavo（孔雀）。英语里更常见的同义形容词是 **pavonine**（也表示“孔雀般的、华丽的”）。","在文学/描写中，pavonian 常用来强调“炫目、华美、张扬”的视觉效果；若用于天文语境，通常是借用拉丁化属格形式来表示“属于某星座/某星”的关系。"]}
{"word":"pavonine","summary":{"en":"Pavonine means peacock-like, especially showing a blue‑green, iridescent shimmer.","zh":"pavonine 指“孔雀般的”，尤指蓝绿、带虹彩闪光的色泽与质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the colors or shimmering look of a peacock’s feathers; peacock-like, often blue‑green and iridescent.","zh":"具有孔雀羽毛般的色彩或闪耀质感的；孔雀般的（常指蓝绿、虹彩般的光泽）。"},"examples":[{"en":"The fabric had a pavonine sheen that shifted from green to blue in the light.","zh":"那块布料有一种孔雀般的虹彩光泽，在光线下从绿色变到蓝色。"},{"en":"She wore pavonine earrings that caught everyone’s attention.","zh":"她戴着孔雀色的耳环，十分吸睛。"},{"en":"The beetle’s pavonine wings looked metallic and unreal.","zh":"那只甲虫的翅膀呈孔雀般的虹彩，看起来像金属一样不真实。"}]}],"synonyms":["iridescent","peacock-like","opalescent","shimmering"],"phonetic":"/ˈpævəˌnaɪn/","extraExplanation":["“pavonine”多用于文学描写与艺术/设计语境，强调“孔雀羽毛那种变幻的虹彩（iridescence）”，不只是单一的“孔雀蓝”。","词源来自拉丁语“pavo”（孔雀）与形容词后缀“-ine”，意为“孔雀般的”。在现代英语里属于较少见、偏文雅的形容词。"]}
{"word":"pavonize","summary":{"en":"Pavonize means to decorate something in a flashy, peacock-like way, or to show off proudly.","zh":"pavonize 指把事物装饰得华丽张扬（像孔雀一样），也可指得意炫耀、招摇。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate or make something look showy and colorful, like a peacock; to embellish in a flashy way","zh":"把……装饰得像孔雀一样华丽张扬；过度点缀、弄得很炫耀"},"examples":[{"en":"The designer pavonized the jacket with bright feathers and glitter.","zh":"设计师用亮羽毛和闪粉把那件夹克装饰得非常张扬。"},{"en":"He kept pavonizing his resume with exaggerated achievements.","zh":"他不断把简历写得很夸张，刻意炫耀自己的成就。"}]},{"partOfSpeech":"vi.","definition":{"en":"to show off proudly or strut in a vain, peacock-like way","zh":"像孔雀开屏般自我炫耀；得意地招摇"},"examples":[{"en":"After the award, she pavonized around the office for a week.","zh":"获奖之后，她在办公室里得意洋洋地“招摇”了一周。"},{"en":"He tends to pavonize on social media when things go well.","zh":"一切顺利时，他就爱在社交媒体上炫耀。"}]}],"synonyms":["preen","show off","strut","flaunt","bedazzle","ornament"],"phonetic":"/ˈpævəˌnaɪz/","extraExplanation":["“pavonize”较少见，带一点文学或讽刺色彩，常用来批评“过度装饰”或“爱炫耀”。","词源与拉丁语 pavo（孔雀）有关，因此常让人联想到孔雀开屏的华丽与自恋。"]}
{"word":"pavy","summary":{"en":"“Pavy” is usually a name, or a misspelling of “pavé” (paved surface; pavé jewelry setting).","zh":"“Pavy”通常是人名/地名，或是“pavé”的误拼（石板路；珠宝密镶）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon) A proper name (surname or place name). It is not a standard everyday English vocabulary word.","zh":"（不常见）专有名词（姓氏或地名）。它不是常见的英语普通词汇。"},"examples":[{"en":"Ms. Pavy will lead today’s meeting.","zh":"Pavy 女士将主持今天的会议。"},{"en":"I couldn’t find “pavy” in the dictionary—maybe it’s a name.","zh":"我在词典里找不到“pavy”，也许它是个名字。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “pavé,” meaning a surface paved with small stones, or a jewelry style where many small stones are set close together.","zh":"常被当作“pavé”的拼写错误；“pavé”可指用小石块铺成的路面，也可指珠宝中密镶许多小宝石的镶嵌风格。"},"examples":[{"en":"The ring has a pavé band with tiny diamonds.","zh":"这枚戒指的戒圈是密镶（pavé）的小钻石。"},{"en":"We walked along a pavé street in the old town.","zh":"我们走在老城区的石板路（pavé）上。"}]}],"synonyms":["pavé","pave (verb)","cobblestone (for streets)"],"phonetic":"/pɑːˈveɪ/","extraExplanation":["“pavy”本身在英语里不常作为普通词使用；如果你是在珠宝、时尚或旅游文字里看到的，很可能原词是法语借词“pavé”（英语也常用），意思与“石板路/铺路石”或“密镶”有关。","如果你想表达动词“铺路/铺设”，常用的是动词“pave”（例如：They paved the road. 他们把路铺好了）。"]}
