{"word":"pax","summary":{"en":"Pax means “peace,” especially in Latin-style historical phrases like Pax Romana; it can also refer to the Roman goddess of peace.","zh":"pax意为“和平”，常见于如Pax Romana这类拉丁式历史用语；也可指罗马的和平女神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"peace; a time or condition without war or violence (often used in Latin names for historical periods).","zh":"和平；没有战争或暴力的时期/状态（常用于拉丁语式的历史时期名称中）。"},"examples":[{"en":"After years of conflict, the two sides finally signed an agreement and promised pax.","zh":"经过多年的冲突，双方终于签署协议并承诺和平（pax）。"},{"en":"Historians often mention the Pax Romana, a long period of relative peace in the Roman Empire.","zh":"历史学家常提到“罗马和平时期”（Pax Romana），指罗马帝国相对和平的漫长阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"(Pax) the Roman goddess or personification of peace, often shown holding an olive branch.","zh":"（Pax）罗马神话中“和平”的女神/拟人化形象，常被描绘为手持橄榄枝。"},"examples":[{"en":"A statue of Pax stood in the temple as a symbol of peace.","zh":"神庙里矗立着Pax的雕像，象征和平。"}]}],"synonyms":["peace","truce","calm","stability"],"phonetic":"/pæks/","extraExplanation":["“pax”来自拉丁语，字面就是“和平”。在现代英语中它不算日常口语词，更常见于历史、学术或文化表达，尤其是“Pax + 国家/帝国名”的结构，例如：Pax Romana（罗马和平）、Pax Britannica（不列颠和平）。这类说法强调某个强权主导下的相对稳定时期。","在文学或正式写作里，用“pax”会显得较庄重、带古典色彩；日常表达通常用“peace”。"]}
{"word":"paxes","summary":{"en":"“Paxes” is the plural of “pax,” meaning periods/agreements of peace (common in history), and less commonly, historical church objects used as a sign of peace.","zh":"“paxes”是“pax”的复数，常指历史语境中的“和平时期/和平协议”，较少见的意思是历史上的教会礼仪器物（用于表示平安）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pax”: peace (especially when talking about a period of peace or a peace agreement/treaty, often in historical writing).","zh":"“pax”的复数：和平（尤指历史语境中的“和平时期”或“和平协议/条约”）。"},"examples":[{"en":"Historians compare different paxes, such as the Pax Romana and the Pax Britannica.","zh":"历史学家会比较不同的“和平时期”，例如“罗马和平”（Pax Romana）和“英帝国和平”（Pax Britannica）。"},{"en":"The book discusses how several paxes were created—and later broken—by shifting alliances.","zh":"这本书讨论了多个“和平局面”如何因联盟变化而建立，又如何被打破。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “pax”: a small devotional object in some Christian traditions (also called a “paxboard”) that was kissed or touched as a sign of peace during worship (historical).","zh":"“pax”的复数：某些基督教传统中的一种宗教器物（亦称“paxboard/平安板”），在礼拜中用于亲吻或触碰以示平安（历史用法）。"},"examples":[{"en":"In the museum case, several medieval paxes are displayed with silver and enamel decoration.","zh":"在博物馆展柜里，陈列着几件中世纪的paxes，上面有银饰和珐琅装饰。"},{"en":"The guide explained how paxes were used in services as a sign of peace.","zh":"导览员解释了礼拜中如何使用paxes来表达“平安/和好”。"}]}],"synonyms":["peace accords","peace treaties","truces","settlements","accords"],"phonetic":"/ˈpæk.sɪz/","extraExplanation":["“pax”来自拉丁语，意为“和平”。英语里常用“Pax + 地名/国家名”来指某个大国主导下相对稳定的国际秩序或和平时期，例如 Pax Romana（罗马和平）与 Pax Americana（美国治下的和平/美式和平）。","拼写提示：常规英语里复数通常写作 paxes（而不是 *pax* 不变）。如果你看到大写 PAXes，也可能是在指缩写（如活动名或术语）的复数，具体要看上下文。"]}
{"word":"paxilla","summary":{"en":"Paxilla means tiny peg-like structures, mainly used in scientific descriptions.","zh":"paxilla 指细小的“钉状/栓状”结构，主要用于科学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pegs or pin-like projections (especially in scientific descriptions, such as tiny peg-shaped structures on an organism).","zh":"（多用于科学描述）小木钉；小栓；针状/钉状的小突起（如生物体表或结构上的细小“钉状”部分）。"},"examples":[{"en":"Under a microscope, the surface looked rough, covered with tiny paxilla.","zh":"在显微镜下，表面看起来很粗糙，布满了细小的钉状突起（paxilla）。"},{"en":"The species can be identified by the arrangement of its paxilla.","zh":"这种物种可以通过其钉状小结构（paxilla）的排列方式来辨认。"}]}],"synonyms":["pegs","pins","spines (in some contexts)","projections"],"phonetic":"/pækˈsɪlə/","extraExplanation":["这是一个比较罕见的词，通常出现在动物学/植物学等学术文本里，用来描述“像小钉子一样的微小结构”。日常英语中几乎不用。","词源上与拉丁语的“小桩/小钉”概念相关，常被当作复数形式使用（在一些文献中也可见其与单数形式的对应用法）。"]}
{"word":"paxillae","summary":{"en":"Paxillae are small peg-like structures (plural of paxilla), most commonly referring to tiny pillar-like skeletal elements on some echinoderms such as sea stars.","zh":"paxillae 是 paxilla 的复数，指小型钉状/柱状结构；最常见用法是指某些棘皮动物（如部分海星）体表的微小柱状骨片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of paxilla: small peg-like structures, especially tiny pillar-like skeletal elements on the surface of some echinoderms (e.g., certain sea stars), often supporting or protecting soft tissue.","zh":"paxilla 的复数：指小型“钉状/柱状”的结构，尤指某些棘皮动物（如部分海星）体表的微小柱状骨片，常用于支撑或保护软组织。"},"examples":[{"en":"Under the microscope, the sea star’s surface was covered with paxillae.","zh":"在显微镜下，这只海星的体表布满了 paxillae（柱状小骨片）。"},{"en":"Researchers compared the shape of the paxillae across different species.","zh":"研究人员比较了不同物种之间 paxillae 的形态差异。"}]},{"partOfSpeech":"n.","definition":{"en":"In botany (less common): small peg-like or stalk-like parts on certain plants or plant structures.","zh":"（植物学，较少见）指某些植物或植物结构上的小钉状或小柄状部分。"},"examples":[{"en":"The description mentions minute paxillae along the structure.","zh":"描述中提到该结构上有极微小的 paxillae。"}]}],"synonyms":["(scientific) paxillas","peg-like structures","pillar-like ossicles"],"phonetic":"/pækˈsɪliː/","extraExplanation":["“paxillae”是拉丁式复数形式（-ae 结尾，常读作 /iː/），单数是“paxilla”。在生物学文献中常见这种拉丁复数（如 vertebra/vertebrae）。","该词多用于学术写作（动物学/海洋生物学/解剖描述），日常英语中很少出现；阅读论文或物种描述时更常遇到。"]}
{"word":"paxillar","summary":{"en":"A very rare technical adjective meaning “peg-like; relating to a small peg (paxillus).”","zh":"一个非常少见的技术性形容词，意为“小钉状的；与小钉（paxillus）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare, technical) Relating to or shaped like a small peg or pin (a “paxillus”).","zh":"（非常少见，技术用语）与“小钉/小栓”（paxillus）有关的；呈小钉状的。"},"examples":[{"en":"Under the microscope, the surface shows paxillar projections that look like tiny pegs.","zh":"在显微镜下，这个表面可见小钉状（paxillar）的突起。"},{"en":"The author described the insect’s antennae as having paxillar segments.","zh":"作者把这种昆虫的触角描述为带有小钉状（paxillar）的分节。"}]}],"synonyms":["peg-like","pin-like","spike-like"],"phonetic":"/pækˈsɪlər/","extraExplanation":["“paxillar”在现代英语里极少见，很多情况下可能是拼写错误或非常专业的学术用词。常见的相似词包括：maxillary（上颌的）、axillary（腋生的/腋部的）、papillary（乳头状的）。如果你能提供句子上下文，我可以帮你判断更可能是哪一个词以及最合适的解释。"]}
{"word":"paxillary","summary":{"en":"“Paxillary” isn’t standard; it’s likely a misspelling of “axillary” (= relating to the armpit/axilla).","zh":"“paxillary”不是标准用词；多半是把“axillary（腋窝的）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “axillary,” which means related to the armpit (axilla).","zh":"不是标准英语单词；很可能是把 “axillary” 拼错了。“axillary” 指“腋窝的、与腋窝（axilla）有关的”。"},"examples":[{"en":"I can’t find “paxillary” in a dictionary—did you mean “axillary lymph nodes”?","zh":"我在词典里找不到 “paxillary”——你是不是想写 “axillary lymph nodes（腋窝淋巴结）”?"},{"en":"The doctor examined the axillary area (under the arm).","zh":"医生检查了腋窝区域（手臂下面）。"}]}],"synonyms":["armpit (informal, noun)","underarm (informal, noun/adj.)"],"phonetic":"/ˈæk.səˌlɛr.i/","extraExplanation":["“Axillary”常见于医学和解剖学语境，如：axillary lymph nodes（腋窝淋巴结）、axillary artery（腋动脉）、axillary temperature（腋下体温）。","如果你是在植物学语境看到的，也可能与“axil（叶腋）”相关：axillary bud（腋芽）指长在叶腋处的芽。"]}
{"word":"paxillate","summary":{"en":"Paxillate means ‘covered with tiny peg-like projections,’ mainly used in scientific descriptions of surface texture.","zh":"paxillate 指“表面布满细小钉状突起”，多用于生物学等科学语境的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small peg-like or nipple-like projections (paxillae) on a surface; covered with tiny bumps or short pegs.","zh":"（表面）具有小钉状/乳突状小突起（paxillae）的；布满细小突点或短小“钉子”的。"},"examples":[{"en":"Under the microscope, the spore surface looked paxillate, with many tiny peg-like bumps.","zh":"在显微镜下，孢子表面呈 paxillate（具小钉状突起），布满许多微小突点。"},{"en":"The field guide notes a paxillate texture on the underside of the cap in some specimens.","zh":"野外图鉴指出，某些标本的菌盖下表面带有 paxillate 的质地特征。"}]}],"synonyms":["papillate","tuberculate","verrucose"],"phonetic":"/ˈpæk.səˌleɪt/","extraExplanation":["这是一个偏专业的形态学形容词，常见于植物学、真菌学、昆虫学等描述“表面纹理/结构”的语境。","词源来自拉丁语 paxillus（“小木桩、小钉”之意），因此 paxillate 强调“像小钉子一样的突起”。"]}
{"word":"paxilli","summary":{"en":"*Paxilli* means “small pegs” or “peg-like projections,” a rare scientific plural of *paxillus*.","zh":"*paxilli* 指“小钉/小木桩”或“钉状小突起”，是较少见的科学用语，为 *paxillus* 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pegs or pin-like projections (plural of *paxillus*), especially in scientific/anatomical writing.","zh":"小钉；小木桩；（尤用于科学/解剖学语境）钉状的小突起（*paxillus* 的复数）。"},"examples":[{"en":"The ligament attaches near the paxilli on the bone.","zh":"韧带附着在骨头上的钉状小突起附近。"},{"en":"Under the microscope, the surface had several paxilli-like bumps.","zh":"在显微镜下，这个表面有几个类似小钉的突起。"}]}],"synonyms":["pegs","pins","stakes","projections"],"phonetic":"/pækˈsɪlaɪ/","extraExplanation":["“paxilli”来自拉丁语 *paxillus*，原义是“小木桩/小钉子”（常见于“钉住、固定”的场景）。在现代英语里它很少出现在日常对话中，更多见于解剖学、动物学、昆虫学等专业描述，用来指“像钉子一样的小突起/小结构”。","读音上常按英语化的拉丁复数来读：*paxillus*（单数）→ *paxilli*（复数）。在一些文献中也可能改用更通俗的词，如 *pegs*, *spikes*, *projections* 来帮助读者理解。"]}
{"word":"paxilliferous","summary":{"en":"Paxilliferous means “having small peg-like projections,” used mainly in scientific descriptions.","zh":"paxilliferous 指“具有小钉/小栓状突起”的，多用于科学（形态学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, Zoology) Bearing or having small pegs, stalks, or peg-like processes (called “paxilli”).","zh":"（植物学/动物学）具“栓状小突起/小柄”（称为 paxilli）的；带小钉状结构的。"},"examples":[{"en":"Under the microscope, the surface looks paxilliferous, covered with tiny peg-like projections.","zh":"在显微镜下，这个表面呈 paxilliferous 状态，布满细小的钉状突起。"},{"en":"Some technical descriptions of mosses and fungi use “paxilliferous” to describe peg-bearing structures.","zh":"在苔藓和真菌的技术性描述中，有时会用“paxilliferous”来形容带有栓状结构的部位。"}]}],"synonyms":["peg-bearing","spiny (context-dependent)","tuberculate (roughly, in some contexts)"],"phonetic":"/ˌpæk.sɪˈlɪf.ə.rəs/","extraExplanation":["词源：来自拉丁语 paxillus（“小木钉/小栓/小桩”）+ -ferous（“带有……的”）。因此字面意思就是“带小栓（小钉）结构的”。","使用场景：这是非常偏学术的形容词，多见于显微结构、分类学或形态学描述；日常英语几乎不用。阅读科研论文或物种描述时遇到它，通常重点抓住“表面有许多小突起/小柄”的形态信息即可。"]}
{"word":"paxilliform","summary":{"en":"Paxilliform means peg-shaped or resembling a small stake or pin, often used in scientific descriptions.","zh":"paxilliform 指“钉状的、像小木桩/小钉一样的”，常用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a small peg, stake, or pin; peg-like.","zh":"呈小木钉／小桩／钉子形的；钉状的。"},"examples":[{"en":"Under the microscope, the spores showed paxilliform projections.","zh":"在显微镜下，孢子呈现出钉状突起。"},{"en":"The report describes a paxilliform process on the bone surface.","zh":"报告描述骨表面有一个钉状突起。"}]}],"synonyms":["peg-shaped","peg-like","pin-shaped","spike-shaped"],"phonetic":"/ˌpækˈsɪləˌfɔrm/","extraExplanation":["该词多见于生物学、植物学、真菌学或解剖学等学术语境，用来描述“形状像小钉/小桩”的结构。","词源来自拉丁语 *paxillus*（小钉、小桩），加上形容词后缀 *-form*（“……形的”）。理解为“paxillus + form = 像小钉一样的形状”。"]}
{"word":"paxillosa","summary":{"en":"A Latin scientific-name adjective meaning “peg-like/knobbed,” used to describe small protrusions.","zh":"拉丁学名形容词，表示“具小钉状/瘤状突起的”，用来描述表面的小突起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology; Latin in scientific names) Having small peg-like projections, knobs, or short stalks; “paxillate.”","zh":"（植物/动物；学名中的拉丁形容词）具有小钉状突起、瘤状小突起或短小柄的；“具小钉状突起的（paxillate）”。"},"examples":[{"en":"In the species name, *paxillosa* suggests the plant has tiny peg-like outgrowths on a surface.","zh":"在该物种的学名中，*paxillosa* 暗示这种植物的某个表面带有细小的钉状突起。"},{"en":"The botanist described the leaf as slightly *paxillosa* along the veins.","zh":"植物学家描述叶片在叶脉处略呈 *paxillosa*（带细小突起）。"}]}],"synonyms":["paxillate","peg-like","knobbed","tuberculate"],"phonetic":"/ˌpæk.sɪˈloʊ.sə/","extraExplanation":["*paxillosa* 多见于生物分类学的拉丁学名（尤其是种加词）。它来自拉丁语 *paxillus*（小木钉、小栓、钉状物），用来提示形态特征。","拉丁语形容词会随名词的性别变化：*paxillosa* 通常是阴性形式；你也可能看到 *paxillosus*（阳性）或 *paxillosum*（中性），取决于属名的语法性别。"]}
{"word":"paxillose","summary":{"en":"Paxillose is a fungal mycotoxin that can cause tremors, mainly discussed in scientific contexts.","zh":"Paxillose 是一种真菌霉菌毒素，可能引起震颤，主要用于科学研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring fungal toxin (an indole-diterpene mycotoxin) produced by some molds, known for causing tremors or “shaking” symptoms in animals when ingested.","zh":"一种天然存在的真菌毒素（吲哚-二萜类霉菌毒素），由某些霉菌产生；动物摄入后可能引起震颤等“发抖”症状。"},"examples":[{"en":"Researchers measured paxillose levels in contaminated feed to assess the risk to livestock.","zh":"研究人员测定受污染饲料中的 paxillose 含量，以评估对家畜的风险。"},{"en":"Paxillose is often discussed in studies of tremorgenic mycotoxins produced by molds.","zh":"在有关霉菌产生的致震颤性霉菌毒素研究中，paxillose 常被提及。"}]}],"synonyms":["mycotoxin","tremorgen (general term)"],"phonetic":"/pækˈsɪloʊs/","extraExplanation":["paxillose 属于较专业的科学词汇，常见于毒理学、真菌学与食品/饲料安全相关文献；日常英语中几乎不会使用。","词源上与真菌名称有关（例如 Penicillium paxilli 等相关研究语境），属于“以生物名称/拉丁学名为基础”构成的化合物名称。"]}
{"word":"paxillus","summary":{"en":"Paxillus is the scientific name of a genus of mushrooms (roll-rims), including some poisonous species.","zh":"Paxillus 是一类蘑菇（卷边伞类）的属名，其中包含一些有毒物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of brownish mushrooms (fungi), often called roll-rims; some species are poisonous to humans (for example, Paxillus involutus).","zh":"一种褐色蘑菇（真菌）的属，常被称为“卷边伞/卷边菌”；其中一些物种对人有毒（如褐卷边伞 Paxillus involutus）。"},"examples":[{"en":"Paxillus mushrooms are sometimes mistaken for edible varieties, but some can be dangerous.","zh":"Paxillus 属的蘑菇有时会被误认为可食用品种，但其中一些可能很危险。"},{"en":"The forager posted photos asking whether the specimen was Paxillus involutus.","zh":"采菇者发照片询问这个样本是否是褐卷边伞（Paxillus involutus）。"}]}],"synonyms":["roll-rim (common name, informal)"],"phonetic":"/pækˈsɪləs/","extraExplanation":["“Paxillus”是拉丁化的学名（生物分类用语），在日常英语里更常见的说法可能是某个具体物种名（如 *Paxillus involutus*）或通俗名“roll-rim”。","采野生蘑菇时即使外观相似也可能有强毒性差异；“paxillus”这类学名在英文文章中常用于科学讨论或鉴定，不等于“可食用”。"]}
{"word":"paxiuba","summary":{"en":"Paxiuba is an Amazonian palm (or its hard wood) used locally for building and crafts.","zh":"Paxiuba指亚马孙地区的一种棕榈（或其坚硬木材），常用于当地建材与手工制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall Amazonian palm (and its hard wood), especially one used locally for building and crafts; sometimes used as a general name for certain palms in the region.","zh":"（亚马孙雨林的）一种高大的棕榈（及其坚硬木材）；在当地常用于建房与手工制作；有时也泛指该地区某些棕榈。"},"examples":[{"en":"The shelter’s frame was made from paxiuba wood because it is strong and light.","zh":"这个棚屋的骨架用的是paxiuba木材，因为它结实又轻。"},{"en":"In some Amazon communities, paxiuba is valued for poles, floors, and tools.","zh":"在一些亚马孙地区社区，paxiuba常被用来做柱子、地板和工具。"}]}],"synonyms":["Amazon palm","palmwood"],"phonetic":"/ˌpɑːksiˈuːbə/","extraExplanation":["“paxiuba”常见于南美语境，多为葡语/地区用词（常写作 paxiúba），来源与土著语言有关，指亚马孙地区的棕榈或其木材。","在英文资料中它属于相对少见的借词，常出现在民族志、雨林生态、传统材料与建筑工艺的描述里。"]}
{"word":"paxwax","summary":{"en":"“paxwax” is not a common dictionary word; it’s usually a stylized name or informal term that depends on context.","zh":"“paxwax”不是常见词典词；多为风格化名称或依语境而定的非正式说法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard term (often a brand name or username) rather than a widely recognized dictionary word. In some contexts online, it can refer informally to “wax” (a thick concentrate) used with PAX-related vaping devices, or it may simply be a stylized spelling of “PAX wax.”","zh":"一个非标准用词（常见于品牌名或网名），并非通用词典词汇。在部分网络语境中，它可能被非正式地用来指与 PAX 相关的电子雾化设备所用的“wax（蜡状浓缩物）”，也可能只是“PAX wax”的风格化写法。"},"examples":[{"en":"I saw the name “paxwax” in a forum, but it didn’t seem like a standard English word.","zh":"我在论坛里看到“paxwax”这个词，但它看起来不像是标准英语词。"},{"en":"Some people use “PAX wax” to mean a waxy concentrate used for vaping, depending on the device and region.","zh":"有些人用“PAX wax”来指用于雾化的蜡状浓缩物，但具体含义会因设备与地区而不同。"}]}],"synonyms":["PAX wax","wax","concentrate","brand name","username"],"phonetic":"ˈpæksˌwæks","extraExplanation":["“paxwax”很可能是拼写组合：PAX（常见为品牌/产品名）+ wax（蜡；也可指某些“蜡状浓缩物”）。因为它不是固定词条，具体含义需要看出现的场景（例如：产品页面、社群讨论、用户名）。","如果你能贴出一句原文或告诉我它出现在哪里（例如社交媒体、商品名、聊天内容），我可以更准确判断它是品牌、昵称，还是特定圈子里的用法。"]}
{"word":"paxwaxes","summary":{"en":"“paxwaxes” is not a standard dictionary word; it may be an invented form or a typo. Interpreted as “pax waxes,” it can mean “peace grows.”","zh":"“paxwaxes”不是标准词典词汇；可能是自造词或拼写错误。若理解为“pax waxes”，可表示“和平在增长”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo, a username/product name, or an invented term. If you meant the two-word phrase “pax waxes,” it can be read as “peace increases/grows.”","zh":"不是标准英语单词。它很可能是拼写错误、用户名/产品名，或自造词。如果你想表达的是两词短语“pax waxes”，可理解为“和平在增长/增强”。"},"examples":[{"en":"I couldn’t find “paxwaxes” in a dictionary—did you mean “Pax” (peace) or “wax” (to grow)?","zh":"我在词典里找不到“paxwaxes”——你想写的是“Pax”（和平）还是“wax”（增长）吗？"},{"en":"In a poetic reading, “pax waxes” could mean peace is growing after conflict.","zh":"在诗意的理解中，“pax waxes”可以表示冲突之后和平正在增长。"}]}],"synonyms":["peace grows","peace increases","peace is rising"],"phonetic":"/ˈpæks ˈwæksɪz/","extraExplanation":["“pax”是拉丁语，意思是“和平”，常见于宗教或格言（如“Pax Romana”指“罗马治下的和平”时期）。“waxes”是动词wax（增长、增强）的第三人称单数形式，较常见于较正式或文学语境（如“the moon waxes”月亮渐盈）。如果你能提供上下文（句子、出处、你想表达的意思），我可以更准确判断它应对应哪个词或短语。"]}

