{"word":"pazaree","summary":{"en":"“Pazaree” is not a common standard English word; it’s often a rare spelling for “bazaar/market,” or it may simply be a name.","zh":"“pazaree”不是常见的标准英语词；多为“bazaar/集市”的少见拼写，或只是一个名字/网名等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or rare transliteration sometimes used for a “bazaar/market,” or for things related to market trading and bargaining (often reflecting South Asian, Persian, or Turkic-language pronunciation).","zh":"一种不标准或较少见的拼写/音译，有时用来指“集市/市场（bazaar）”，或与市场交易、讨价还价相关的事物（多见于南亚、波斯语或突厥语背景的转写）。"},"examples":[{"en":"We bought spices at the pazaree near the old town.","zh":"我们在老城区附近的那个“pazaree”（集市）买了香料。"},{"en":"Prices were lower if you knew how to bargain in the pazaree.","zh":"如果你会在“pazaree”（集市）里砍价，价格会更低。"}]},{"partOfSpeech":"other","definition":{"en":"A name/label (e.g., a username, brand, or surname) rather than a standard English word.","zh":"作为名字/标签使用（例如用户名、品牌名或姓氏），而不是标准英语词汇。"},"examples":[{"en":"‘Pazaree’ is my online handle.","zh":"“Pazaree”是我的网名。"}]}],"synonyms":["bazaar","market","marketplace"],"phonetic":"/ˌpɑːzəˈriː/","extraExplanation":["“pazaree”并不是常见的标准英语拼写；在英文里更常见的是 **bazaar**（集市）。一些地区语言（如波斯语、土耳其语、乌尔都语等）的词根与“市场”有关，转写到拉丁字母时可能出现不同拼法（如 bazar / bazaar / pazari / pazaree）。","如果你是在文章、歌词或社交媒体中看到“pazaree”，建议结合上下文判断：它是指“集市”，还是某个人名/网名/品牌名。"]}
{"word":"pazazz","summary":{"en":"Pizzazz means an exciting, eye-catching quality that adds energy and appeal.","zh":"Pizzazz 指让事物更吸睛、更有活力和魅力的“精彩劲儿/出彩感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively, exciting quality that makes something more attractive, impressive, or entertaining.","zh":"（使事物更吸引人、更出彩的）活力；精彩劲儿；魅力"},"examples":[{"en":"The singer brought real pizzazz to the performance.","zh":"这位歌手给演出带来了真正的精彩劲儿。"},{"en":"Add a bright scarf to give your outfit some pizzazz.","zh":"加一条亮色围巾，让你的穿搭更出彩。"},{"en":"The presentation was clear, but it needed more pizzazz.","zh":"演示很清楚，但还需要更有感染力一点。"}]}],"synonyms":["sparkle","flair","zip","pep","oomph","panache"],"phonetic":"/pɪˈzæz/","extraExplanation":["常见拼写是 **pizzazz**（你写的 *pazazz* 很多人也会拼错）。","这是比较口语、轻松的词，常用于时尚、表演、广告、演讲等语境，强调“吸睛/有冲击力”。","词源一般认为来自20世纪美国英语，可能与意大利语感叹词 **pizza!**（类似“太棒了！”的语气）或“爵士感/热闹感”的拟声用法有关，但并非严格学术定论。"]}
{"word":"pazazzes","summary":{"en":"“Pazazzes” is usually a misspelling of “pizzazzes,” the plural of “pizzazz,” meaning lively style or flair.","zh":"“pazazzes”通常是“pizzazzes”的误拼；它是“pizzazz”的复数，表示活力、风格或亮点/魅力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of pizzazz) An exciting, lively quality—style, flair, or energy—that makes something more attractive or impressive.","zh":"（pizzazz 的复数）指让事物更吸引人或更出彩的“活力、风格、亮点/魅力”。"},"examples":[{"en":"Her presentation had pizzazzes that kept the audience engaged.","zh":"她的演讲有好几个亮点，让观众一直很投入。"},{"en":"The designer added small pizzazzes—bold colors and shiny details—to the outfit.","zh":"设计师给这套衣服加了一些小“点睛之笔”——大胆的颜色和闪亮的细节。"},{"en":"The show is fine, but it needs more pizzazzes to stand out from the rest.","zh":"这个节目还不错，但要更出众还需要更多亮点。"}]}],"synonyms":["flair","sparkle","zing","style","panache","pep"],"phonetic":"/pɪˈzæz/","extraExplanation":["“Pizzazz”是更常见的写法和用法；“pizzazzes”是它的复数形式，但实际英语里更常用不可数用法（如：add pizzazz）。\n拼写上容易误写成 *pazazz*；标准拼写是 **pizzazz**（两个 z）。这个词多用于口语、媒体、时尚与娱乐语境。"]}
{"word":"pazend","summary":{"en":"Pazend is Middle Persian written in the Avestan alphabet, used mainly in Zoroastrian religious and explanatory texts.","zh":"Pazend 是用阿维斯陀字母书写的中古波斯语形式，主要用于祆教宗教与注释性文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of Middle Persian written in the Avestan alphabet, often used for Zoroastrian religious texts and for writing or glossing (explaining) Pahlavi texts without ambiguous Pahlavi spelling.","zh":"一种用阿维斯陀字母书写的中古波斯语形式，常用于琐罗亚斯德教（祆教）宗教文献，也常用来把巴列维文文本改写或加注释，以避免巴列维文字形含混。"},"examples":[{"en":"Some Zoroastrian commentaries were copied in Pazend to make the reading clearer.","zh":"一些祆教注释文献会用 Pazend 抄写，以让阅读更清楚。"},{"en":"The manuscript contains a Pahlavi passage with a Pazend gloss explaining difficult words.","zh":"这份手稿包含一段巴列维文，并附有 Pazend 的旁注来解释难词。"}]}],"synonyms":["Middle Persian (in Avestan script)","Zoroastrian gloss (contextual)","Pazand (variant spelling)"],"phonetic":"/pəˈzɛnd/","extraExplanation":["“Pazend”常出现在伊朗学、祆教研究与古代手稿学的语境中。它并不是一种全新的语言，而更像是：把中古波斯语内容用更“拼音化”、更明确的阿维斯陀字母来写（或加注）。","历史上巴列维文字（Pahlavi script）带有大量省写与多音/多义的书写习惯，读者容易产生歧义；Pazend 的用途之一就是减少这种歧义，帮助抄写与诵读。","相关术语可对照理解：Avestan（阿维斯陀语，宗教经典语言）、Pahlavi（巴列维文/中古波斯语文献传统）。"]}
