{"word":"PC","summary":{"en":"PC most commonly means a personal computer, or politically correct (careful not to offend).","zh":"PC最常见指个人电脑，或指“政治正确的”（注意避免冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal computer (usually a desktop or laptop used by one person)","zh":"个人电脑（通常指供个人使用的台式机或笔记本电脑）"},"examples":[{"en":"I bought a new PC for gaming and schoolwork.","zh":"我买了一台新的PC，用来玩游戏和做作业。"},{"en":"This software works on both Mac and PC.","zh":"这个软件在Mac和PC上都能运行。"}]},{"partOfSpeech":"adj.","definition":{"en":"politically correct; avoiding language or actions that may offend people, especially marginalized groups","zh":"政治正确的；避免使用可能冒犯他人（尤其是弱势群体）的语言或行为"},"examples":[{"en":"Try to be PC when talking about different cultures.","zh":"谈到不同文化时尽量用政治正确的表达。"},{"en":"Some people say the movie is not PC by today’s standards.","zh":"有些人说按今天的标准，这部电影不够政治正确。"}]}],"synonyms":["personal computer","computer","politically correct"],"phonetic":"/ˌpiːˈsiː/","extraExplanation":["“PC”最常见的两个意思是：科技语境里的 personal computer（个人电脑），以及社会文化语境里的 politically correct（政治正确）。通常根据上下文判断。","读音一般按字母读“P-C”。写作时常见形式有 PC、PCs；表示“政治正确”时也常写作 pc（小写）或 P.C.（带点的缩写）。","“politically correct/PC”在不同语境下可能是中性（表示尊重、避免冒犯），也可能带批评意味（暗示过度谨慎或限制表达）。"]}
{"word":"pc","summary":{"en":"PC most commonly means a personal computer; it can also mean politically correct, and in British English it can mean a police constable.","zh":"PC最常指个人电脑；也可指“政治正确的”；在英式英语中还可指警员（巡警）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal computer (a computer used by one person, especially a desktop or laptop)","zh":"个人电脑（通常指供个人使用的电脑，如台式机或笔记本电脑）"},"examples":[{"en":"I do most of my work on a PC at home.","zh":"我大部分工作都在家里的个人电脑上完成。"},{"en":"This game runs better on a PC than on my old laptop.","zh":"这款游戏在台式个人电脑上运行得比我旧笔记本更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"politically correct (language or behavior intended to avoid offending people, especially in terms of race, gender, disability, etc.)","zh":"政治正确的（指为避免冒犯他人而使用的语言或行为，常涉及种族、性别、残障等议题）"},"examples":[{"en":"He tried to use more PC language in the workplace.","zh":"他在职场里尽量使用更政治正确的措辞。"},{"en":"Some people think the rule is too PC and limits honest discussion.","zh":"有些人觉得这个规定太“政治正确”，限制了坦诚讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly British) a police constable","zh":"（主要英式）警员；巡警"},"examples":[{"en":"A PC arrived within minutes after the call.","zh":"报警后几分钟，一名巡警就到了。"}]}],"synonyms":["personal computer","computer","desktop","laptop","politically correct"],"phonetic":"/ˌpiːˈsiː/","extraExplanation":["“PC”是缩写，最常见的意思是personal computer。口语里也常用“PC”来和“Mac”对比（PC vs. Mac）。","表示politically correct时，多用于讨论用词是否冒犯、是否顾及多元群体；语气可能中性，也可能带一点批评意味，取决于上下文。","英式英语里“PC + 姓氏/编号”可指某位警员（如PC Smith）。"]}
