{"word":"PC","summary":{"en":"PC most commonly means a personal computer, or politically correct (careful not to offend).","zh":"PC最常见指个人电脑，或指“政治正确的”（注意避免冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal computer (usually a desktop or laptop used by one person)","zh":"个人电脑（通常指供个人使用的台式机或笔记本电脑）"},"examples":[{"en":"I bought a new PC for gaming and schoolwork.","zh":"我买了一台新的PC，用来玩游戏和做作业。"},{"en":"This software works on both Mac and PC.","zh":"这个软件在Mac和PC上都能运行。"}]},{"partOfSpeech":"adj.","definition":{"en":"politically correct; avoiding language or actions that may offend people, especially marginalized groups","zh":"政治正确的；避免使用可能冒犯他人（尤其是弱势群体）的语言或行为"},"examples":[{"en":"Try to be PC when talking about different cultures.","zh":"谈到不同文化时尽量用政治正确的表达。"},{"en":"Some people say the movie is not PC by today’s standards.","zh":"有些人说按今天的标准，这部电影不够政治正确。"}]}],"synonyms":["personal computer","computer","politically correct"],"phonetic":"/ˌpiːˈsiː/","extraExplanation":["“PC”最常见的两个意思是：科技语境里的 personal computer（个人电脑），以及社会文化语境里的 politically correct（政治正确）。通常根据上下文判断。","读音一般按字母读“P-C”。写作时常见形式有 PC、PCs；表示“政治正确”时也常写作 pc（小写）或 P.C.（带点的缩写）。","“politically correct/PC”在不同语境下可能是中性（表示尊重、避免冒犯），也可能带批评意味（暗示过度谨慎或限制表达）。"]}
{"word":"pc","summary":{"en":"PC most commonly means a personal computer; it can also mean politically correct, and in British English it can mean a police constable.","zh":"PC最常指个人电脑；也可指“政治正确的”；在英式英语中还可指警员（巡警）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal computer (a computer used by one person, especially a desktop or laptop)","zh":"个人电脑（通常指供个人使用的电脑，如台式机或笔记本电脑）"},"examples":[{"en":"I do most of my work on a PC at home.","zh":"我大部分工作都在家里的个人电脑上完成。"},{"en":"This game runs better on a PC than on my old laptop.","zh":"这款游戏在台式个人电脑上运行得比我旧笔记本更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"politically correct (language or behavior intended to avoid offending people, especially in terms of race, gender, disability, etc.)","zh":"政治正确的（指为避免冒犯他人而使用的语言或行为，常涉及种族、性别、残障等议题）"},"examples":[{"en":"He tried to use more PC language in the workplace.","zh":"他在职场里尽量使用更政治正确的措辞。"},{"en":"Some people think the rule is too PC and limits honest discussion.","zh":"有些人觉得这个规定太“政治正确”，限制了坦诚讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly British) a police constable","zh":"（主要英式）警员；巡警"},"examples":[{"en":"A PC arrived within minutes after the call.","zh":"报警后几分钟，一名巡警就到了。"}]}],"synonyms":["personal computer","computer","desktop","laptop","politically correct"],"phonetic":"/ˌpiːˈsiː/","extraExplanation":["“PC”是缩写，最常见的意思是personal computer。口语里也常用“PC”来和“Mac”对比（PC vs. Mac）。","表示politically correct时，多用于讨论用词是否冒犯、是否顾及多元群体；语气可能中性，也可能带一点批评意味，取决于上下文。","英式英语里“PC + 姓氏/编号”可指某位警员（如PC Smith）。"]}
{"word":"pcf","summary":{"en":"“PCF” most commonly means “pounds per cubic foot” (density), but it can also mean “Percent Closer Filtering” (graphics shadows) or “price-to-cash-flow” (finance).","zh":"“PCF”最常见指“每立方英尺的磅数”（密度），也可能指图形学的“Percent Closer Filtering”（阴影过滤）或金融的“股价/现金流”（P/CF）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “pounds per cubic foot,” a unit used to describe density (especially for materials like foam, soil, insulation, or wood).","zh":"“pounds per cubic foot（每立方英尺的磅数）”的缩写，用来表示密度（常见于泡棉、土壤、保温材料、木材等）。"},"examples":[{"en":"This foam is 2.0 pcf, so it’s denser than the 1.5 pcf option.","zh":"这种泡棉是 2.0 pcf，所以它比 1.5 pcf 的选项更密。"},{"en":"The spec sheet lists insulation density in pcf.","zh":"规格表用 pcf 标注保温材料的密度。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “Percent Closer Filtering,” a computer-graphics method used to soften shadow edges in real-time rendering.","zh":"“Percent Closer Filtering（百分比更近过滤）”的缩写，是计算机图形学里用于让阴影边缘更柔和的一种方法（常见于实时渲染）。"},"examples":[{"en":"Try enabling PCF shadows to make the lighting look less harsh.","zh":"试着开启 PCF 阴影，让光照看起来没那么生硬。"},{"en":"The engine supports PCF for smoother shadow maps.","zh":"该引擎支持 PCF，让阴影贴图更平滑。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “price-to-cash-flow,” a finance ratio that compares a company’s stock price to its operating cash flow (often written as P/CF).","zh":"“price-to-cash-flow（股价/现金流）”的缩写，是金融里用来比较股价与经营现金流的比率（常写作 P/CF）。"},"examples":[{"en":"Analysts noted the stock’s PCF ratio is lower than its peers.","zh":"分析师指出，这只股票的 PCF 比率比同业更低。"},{"en":"PCF can be useful when earnings are volatile but cash flow is steady.","zh":"当利润波动大但现金流稳定时，PCF 可能更有参考价值。"}]}],"synonyms":["lb/ft³","P/CF"],"phonetic":"/ˌpiː siː ˈɛf/","extraExplanation":["“PCF”属于高度依赖语境的缩写：在建材/工程里最常见的是密度单位（lb/ft³），在游戏/渲染里常指阴影算法（Percent Closer Filtering），在金融报道里有时指估值指标（price-to-cash-flow，常写 P/CF）。如果你告诉我它出现的句子或行业（例如建筑、游戏开发、财报），我可以帮你锁定最准确的意思。"]}
{"word":"pci","summary":{"en":"PCI is an abbreviation most commonly meaning a computer hardware connection standard, or (in security) the Payment Card Industry, especially in “PCI DSS.”","zh":"PCI 是缩写：最常见指电脑硬件的连接标准；在安全合规领域也可指支付卡行业，常见于“PCI DSS”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Peripheral Component Interconnect: a standard used to connect hardware components (like sound cards or network cards) to a computer’s motherboard.","zh":"外设组件互连：一种把硬件组件（如声卡、网卡）连接到电脑主板上的标准。"},"examples":[{"en":"This old desktop still has a PCI slot for a legacy network card.","zh":"这台旧台式机还有一个 PCI 插槽，可以用来装老式网卡。"},{"en":"The technician replaced the PCI card to fix the audio problem.","zh":"技术人员更换了 PCI 扩展卡来解决音频问题。"}]},{"partOfSpeech":"other","definition":{"en":"Payment Card Industry (PCI): usually seen in “PCI DSS,” a set of security standards for organizations that handle credit card data.","zh":"支付卡行业（PCI）：常见于“PCI DSS”，指处理信用卡数据的机构需要遵守的一套安全标准。"},"examples":[{"en":"Our company must meet PCI DSS requirements to process credit card payments.","zh":"我们公司要处理信用卡支付，就必须符合 PCI DSS 的要求。"},{"en":"The audit checked whether the website is PCI compliant.","zh":"审计检查了这个网站是否符合 PCI（支付卡）合规要求。"}]}],"synonyms":["Peripheral Component Interconnect","PCI DSS"],"phonetic":"/ˌpi si ˈaɪ/","extraExplanation":["在电脑硬件语境里，PCI 是较早的一种扩展总线标准；后来更常见的是 PCIe（PCI Express），速度更快、结构也不同。看到主板说明书里的 “PCI slot/PCI card” 通常指第一种含义。","在网络安全/合规语境里，PCI 常与 DSS（Data Security Standard，数据安全标准）一起出现；“PCI compliant”=“符合支付卡数据安全要求”。"]}
{"word":"pcm","summary":{"en":"PCM is an abbreviation most commonly meaning pulse-code modulation (digital audio data), and it can also mean phase-change material (heat-storing material).","zh":"PCM 是缩写，最常见指脉冲编码调制（数字音频数据），也可指相变材料（储热材料）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Pulse-code modulation: a way to convert an analog signal (like sound) into digital data by sampling and recording its values.","zh":"脉冲编码调制：一种把模拟信号（如声音）通过采样并记录数值转换成数字数据的方法。"},"examples":[{"en":"CD-quality audio is stored as PCM data.","zh":"CD 音质的音频通常以 PCM 数据形式存储。"},{"en":"This recorder can export WAV files in PCM format.","zh":"这台录音设备可以导出 PCM 格式的 WAV 文件。"}]},{"partOfSpeech":"other","definition":{"en":"Phase-change material: a substance that stores and releases heat by changing between solid and liquid states.","zh":"相变材料：通过固液相变来储存并释放热量的材料。"},"examples":[{"en":"The jacket lining uses PCM to help regulate body temperature.","zh":"这件外套的内衬使用 PCM 来帮助调节体温。"},{"en":"Engineers added PCM panels to reduce indoor temperature swings.","zh":"工程师加入了 PCM 板材来减少室内温度波动。"}]},{"partOfSpeech":"other","definition":{"en":"(In computing) PC motherboard: sometimes used informally to mean a computer’s main circuit board, though this use is less standard and can be confusing.","zh":"（计算机领域）主板：有时被非正式地用来指电脑主电路板，但这种用法不太规范，容易引起误解。"},"examples":[{"en":"Make sure the cables are firmly connected to the PCM before powering on.","zh":"开机前确认线缆已牢固连接到“PCM/主板”。"},{"en":"People may say “PCM” online, but “motherboard” is clearer.","zh":"网上有人会说“PCM”，但说“motherboard/主板”更清楚。"}]}],"synonyms":["pulse-code modulation","digital audio (PCM)","phase-change material"],"phonetic":"/ˌpiː siː ˈɛm/","extraExplanation":["“PCM”最常见于音频与信号处理领域（尤其是 WAV、CD 音质、录音接口说明书里）。如果你是在聊天或产品介绍里看到它，通常指第一条（脉冲编码调制）。","在服装、建筑节能、保温材料等语境里，“PCM”更可能指第二条（相变材料）。","因为“PCM”是缩写，不同领域含义差很多；写作或交流时，第一次出现最好写全称（Pulse-code modulation / Phase-change material）。"]}
{"word":"pct","summary":{"en":"“pct” most commonly means “percent” in tables and notes; it can also mean other things in specialized fields.","zh":"“pct”最常见的意思是“percent（百分比）”的缩写；在某些专业领域也可能有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “percent” (per hundred), often used in charts, spreadsheets, or informal notes.","zh":"“percent（百分比）”的缩写，常见于图表、表格或非正式记录中。"},"examples":[{"en":"The conversion rate increased by 5 pct this month.","zh":"这个月的转化率上升了 5 pct（5%）。"},{"en":"Please enter the discount as a pct, like 10%.","zh":"请把折扣用百分比填写，比如 10%。"}]},{"partOfSpeech":"other","definition":{"en":"In some technical or workplace contexts, an abbreviation with other meanings (e.g., “procalcitonin” in medicine, or certain job titles). The intended meaning depends on the field.","zh":"在一些专业或工作语境中也可能代表其他含义（如医学里的“降钙素原”，或某些岗位名称），具体含义取决于领域。"},"examples":[{"en":"The lab reported an elevated PCT level.","zh":"化验报告显示 PCT（降钙素原）水平升高。"}]}],"synonyms":["percent","%"],"phonetic":"/pi si ti/","extraExplanation":["在数据/商业英语里，pct 常见于标题或列名（如 “Growth (pct)”），用来节省空间；正式写作通常用 percent 或符号 %。","注意：pct（百分比）和 percentage point（百分点）不同。例如从 10% 到 12% 是增加 2 percentage points，也可以说 increase by 2 points，而不是 increase by 2%.（后者通常表示相对增长 2%）。"]}
