{"word":"pd","summary":{"en":"PD is a common abbreviation that can mean police department, Parkinson’s disease, public domain, or professional development—depending on context.","zh":"PD 是常见缩写，可能指警察局、帕金森病、公有领域或职业发展培训，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “police department” (often used in names like “NYPD”).","zh":"“警察局/警察部门”的缩写（常见于名称，如 NYPD）。"},"examples":[{"en":"Call the PD if you see something dangerous.","zh":"如果你看到危险情况，就报警/联系警察局。"},{"en":"The PD released a statement about the incident.","zh":"警察局就这起事件发布了声明。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Parkinson’s disease,” a neurological condition that affects movement.","zh":"“帕金森病”的缩写，一种影响运动功能的神经系统疾病。"},"examples":[{"en":"His doctor diagnosed him with PD.","zh":"医生诊断他患有帕金森病（PD）。"},{"en":"People with PD may have tremors or stiffness.","zh":"帕金森病（PD）患者可能会出现手抖或僵硬。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “public domain,” meaning not protected by copyright (or no longer protected).","zh":"“公有领域”的缩写，指不受版权保护（或版权已到期）的作品。"},"examples":[{"en":"This book is in the public domain (PD), so it can be shared freely.","zh":"这本书属于公有领域（PD），所以可以自由分享。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “professional development,” training to improve work skills.","zh":"“职业发展/专业培训”的缩写，指提升工作技能的培训。"},"examples":[{"en":"Teachers often attend PD workshops during the summer.","zh":"老师们常在暑期参加职业发展（PD）培训。"}]}],"synonyms":["police department","Parkinson’s disease","public domain","professional development"],"phonetic":"/ˌpiːˈdiː/","extraExplanation":["“PD”最常见的读法是把字母念出来 /ˌpiːˈdiː/。它的含义非常依赖语境：在新闻/城市服务里常指 police department；在医疗话题里常指 Parkinson’s disease；在版权/资源分享里常指 public domain；在教育或职场培训里常指 professional development。","如果你告诉我你看到“PD”的句子或领域（医疗/警方/版权/教育职场），我可以帮你确认最准确的意思，并给出更贴近语境的例句。"]}
{"word":"PDA","summary":{"en":"PDA most commonly means “public display of affection,” and it can also mean “personal digital assistant” (an older handheld device).","zh":"PDA最常指“公开亲昵”，也可指“个人数字助理”（一种较早的掌上设备）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) public display of affection; showing physical affection (like kissing or hugging) with a romantic partner in public","zh":"（缩写）公开的亲昵行为；在公共场合对伴侣做出亲吻、拥抱等亲密举动"},"examples":[{"en":"Some people think PDA is uncomfortable to watch on the subway.","zh":"有些人觉得在地铁上看到情侣公开亲昵会很不舒服。"},{"en":"The school asked students to avoid PDA in the hallways.","zh":"学校要求学生在走廊里避免公开亲昵。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) personal digital assistant; a small handheld computer used especially before smartphones became common","zh":"（缩写）个人数字助理；一种早期常见的掌上电脑（智能手机普及前更常用）"},"examples":[{"en":"Before smartphones, he kept his calendar and contacts on a PDA.","zh":"在智能手机出现之前，他用个人数字助理来管理日程和联系人。"},{"en":"My dad still has an old PDA in a drawer.","zh":"我爸爸抽屉里还放着一台旧的个人数字助理。"}]}],"synonyms":["public display of affection","public affection","handheld organizer","personal digital assistant"],"phonetic":"/ˌpiː diː ˈeɪ/","extraExplanation":["“PDA”在日常英语里最常见的意思是“公开亲昵”（public display of affection），尤其在校园、职场或公共交通等场景常被讨论。不同文化对PDA的接受度差异很大：有的地方牵手很普通，但拥吻可能被认为不合适。","“personal digital assistant”这个意思偏历史/科技语境，现在更多被智能手机取代，因此常出现在回忆或复古科技话题中。"]}
{"word":"pda","summary":{"en":"“PDA” most commonly means “public display of affection,” and it can also mean “personal digital assistant” (an older handheld device).","zh":"“PDA”最常见指“公开秀恩爱/公共场合的亲密举动”，也可指“个人数字助理”（早期的掌上设备）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"public display of affection (showing romantic affection in front of other people, such as kissing or hugging in public)","zh":"公开秀恩爱；在公共场合表达亲密举动（如当众亲吻、拥抱）"},"examples":[{"en":"Some people don’t mind PDA, but others find it uncomfortable.","zh":"有些人不介意公开秀恩爱，但也有人会觉得不舒服。"},{"en":"The school has a rule against excessive PDA in the hallways.","zh":"学校规定走廊里不允许过度的公开亲密举动。"}]},{"partOfSpeech":"n.","definition":{"en":"personal digital assistant (a small handheld computer used especially in the 1990s–2000s for calendars, contacts, notes, and email)","zh":"个人数字助理（多指1990–2000年代用于日程、通讯录、备忘录等的掌上电脑）"},"examples":[{"en":"Before smartphones, many businesspeople carried a PDA to manage their schedules.","zh":"在智能手机出现之前，很多商务人士会带着PDA来管理日程。"},{"en":"He synced his contacts from the office computer to his PDA.","zh":"他把办公室电脑里的联系人同步到他的PDA上。"}]}],"synonyms":["public display of affection","public affection","handheld organizer","handheld computer"],"phonetic":"/ˌpi di ˈeɪ/","extraExplanation":["“PDA”在日常对话里更常指“public display of affection（公开亲密举动）”。在科技语境里才常指“personal digital assistant（个人数字助理）”。遇到不确定时，可以根据上下文（约会/社交 vs. 科技/设备）判断。","谈“PDA（公开秀恩爱）”时，不同文化和场合接受度差异很大；正式场合或学校/工作场所往往更强调克制。"]}
{"word":"PDF","summary":{"en":"PDF is short for Portable Document Format, a widely used file format for sharing documents with consistent layout.","zh":"PDF是Portable Document Format的缩写，指一种常用的文件格式，用于分享文档并保持版式一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Portable Document Format: a common file format used to share documents so they look the same on different devices (often read with a PDF viewer).","zh":"PDF（便携式文档格式）：一种常见的文件格式，用来分享文档并在不同设备上保持版式一致（通常用PDF阅读器打开）。"},"examples":[{"en":"Could you send me the contract as a PDF?","zh":"你能把合同以PDF格式发我吗？"},{"en":"This brochure is available to download in PDF format.","zh":"这份宣传册可以以PDF格式下载。"},{"en":"I can’t edit the PDF easily—do you have the Word file?","zh":"这个PDF我不太好编辑——你有Word版本吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A file saved in the Portable Document Format.","zh":"PDF文件；以PDF格式保存的文件。"},"examples":[{"en":"I attached the PDF to the email.","zh":"我把PDF作为附件发到邮件里了。"},{"en":"Open the PDF and check page 3.","zh":"打开PDF看一下第3页。"}]}],"synonyms":["Portable Document Format","PDF file","PDF format"],"phonetic":"/ˌpiːdiːˈɛf/","extraExplanation":["PDF是缩写，来自Portable Document Format。最初由Adobe在1990年代推出，用于“跨平台保持版式不变”。因此在正式场景（简历、合同、学术论文、说明书）里很常见。","口语里常把字母逐个读：P-D-F。也常见说法：PDF file / PDF format（PDF文件/格式）。"]}
{"word":"pdl","summary":{"en":"PDL is an abbreviation; most commonly it means the periodontal ligament (dentistry), but it can also mean programmed death ligand (immunology) or Page Description Language (printing).","zh":"PDL 是缩写；最常见指牙科的“牙周膜”，也可能指免疫学的“程序性死亡配体”或打印领域的“页面描述语言”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in dentistry/medicine for the periodontal ligament: the connective tissue that holds a tooth in its socket and helps absorb chewing forces.","zh":"（牙科/医学）PDL 是“牙周膜（periodontal ligament）”的缩写：连接牙齿与牙槽骨的结缔组织，帮助固定牙齿并缓冲咀嚼力量。"},"examples":[{"en":"The dentist said my PDL looks inflamed on the X-ray.","zh":"牙医说我的 X 光片上牙周膜（PDL）看起来有发炎。"},{"en":"Orthodontic movement happens because the PDL responds to pressure.","zh":"牙齿矫正之所以能移动，是因为牙周膜（PDL）会对压力产生反应。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation in research/clinical notes for programmed death ligand (often written PD‑L1/PD‑L2), a protein involved in immune response and cancer immunotherapy.","zh":"（科研/病历）PDL 可指“程序性死亡配体（programmed death ligand）”（常写作 PD‑L1/PD‑L2），与免疫反应及癌症免疫治疗有关的蛋白。"},"examples":[{"en":"The report mentions high PDL expression (PD-L1) in the tumor.","zh":"报告提到肿瘤的 PDL（PD-L1）表达较高。"},{"en":"Some treatments target the PD-1/PDL pathway.","zh":"有些治疗会针对 PD-1/PDL 这条通路。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some tech contexts for “Page Description Language,” a language printers use to describe how a page should look (e.g., PostScript, PCL).","zh":"（科技）PDL 有时指“页面描述语言（Page Description Language）”，用于告诉打印机页面该如何呈现（如 PostScript、PCL）。"},"examples":[{"en":"This printer supports multiple PDLs like PCL and PostScript.","zh":"这台打印机支持多种 PDL，例如 PCL 和 PostScript。"},{"en":"A driver problem can happen if the PDL setting is wrong.","zh":"如果 PDL 设置不对，可能会出现驱动问题。"}]}],"phonetic":"/ˌpi di ˈɛl/","extraExplanation":["“PDL”是缩写，在不同领域意思差异很大。你可以告诉我你在哪个场景看到它（牙科/肿瘤免疫/打印机或其他），我可以给你最准确的解释与常见搭配用法。"]}
{"word":"pdn","summary":{"en":"PDN is an abbreviation most commonly meaning “power distribution network” in electronics; in older telecom contexts it can mean “public data network.”","zh":"PDN是缩写，最常见指电子领域的“电源分配网络”；在较早的电信语境中也可指“公共数据网络”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “power distribution network,” the system (wires, planes, traces, capacitors, etc.) that delivers stable power to electronic circuits, especially on a PCB.","zh":"“power distribution network（电源分配网络）”的缩写，指在电子电路中（尤其是PCB上）把电能稳定送到各芯片与元件的供电系统（如电源/地平面、走线、电容等）。"},"examples":[{"en":"We need to improve the PDN so the microcontroller doesn’t reset when the radio transmits.","zh":"我们需要优化PDN，不然无线电发射时单片机会因为电源波动而重启。"},{"en":"The engineer checked PDN noise with an oscilloscope and added a decoupling capacitor.","zh":"工程师用示波器检查PDN噪声后，加了一颗去耦电容。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “public data network,” a telecom network used to carry data for the public (an older term in networking/telecom contexts).","zh":"“public data network（公共数据网络）”的缩写，指面向公众提供数据传输服务的电信网络（较偏旧的网络/电信用语）。"},"examples":[{"en":"In older documents, PDN refers to a public data network used for packet-switched services.","zh":"在较早的文档里，PDN常指用于分组交换业务的公共数据网络。"}]}],"synonyms":["power distribution network","public data network"],"phonetic":"/ˌpi di ˈɛn/","extraExplanation":["“PDN”最常见的含义取决于领域：做硬件/PCB的人通常默认是“电源分配网络”；做电信/网络的人在一些旧资料里可能指“公共数据网络”。如果你告诉我你的上下文（例如在电路图、论文、聊天记录、手机网络设置里看到的），我可以帮你确定具体意思。","读字母缩写时通常按字母逐个念：P-D-N。"]}
{"word":"pdq","summary":{"en":"PDQ means “very quickly; right away,” an informal abbreviation often explained as “pretty darn/ damn quick.”","zh":"PDQ 表示“很快地；立刻”，是非正式缩写，常被解释为“pretty darn/ damn quick（非常快）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(informal) Very quickly; right away.","zh":"（非正式）很快地；立刻。"},"examples":[{"en":"Send me the file PDQ—I need it before the meeting.","zh":"把文件赶紧发我（PDQ）——开会前我就要。"},{"en":"The doctor asked us to come in PDQ.","zh":"医生让我们立刻过去。"}]},{"partOfSpeech":"other","definition":{"en":"A humorous abbreviation meaning “pretty darn/ damn quick,” used to emphasize speed.","zh":"一个带幽默感的缩写，意为“非常快（pretty darn/ damn quick）”，用来强调速度。"},"examples":[{"en":"Can you get this fixed PDQ?","zh":"你能不能把这个赶紧修好（PDQ）？"},{"en":"We’ll need a decision PDQ.","zh":"我们得尽快做决定（PDQ）。"}]}],"synonyms":["right away","immediately","ASAP","promptly"],"phonetic":"/ˌpiː diː ˈkjuː/","extraExplanation":["PDQ 常见于口语、邮件或短信中，语气随意，带一点催促或开玩笑的感觉；在正式写作里通常用 “immediately / as soon as possible / promptly”。","字母读法是逐个字母读：P-D-Q。常见解释是 “pretty damn quick”（较粗口）或较委婉的 “pretty darn quick”。使用时注意场合与受众。"]}
{"word":"PDR","summary":{"en":"PDR is an abbreviation most commonly meaning Physicians’ Desk Reference, Preliminary Design Review, or Professional Development Review—depending on the context.","zh":"PDR是缩写，常见含义包括《医师案头参考书》（药品资料）、初步设计评审（工程）、职业发展评估（人事），具体取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Physicians’ Desk Reference: a well-known U.S. reference book/database that lists prescription drug information.","zh":"（缩写）《医师案头参考书》：美国常见的药品参考书/数据库，收录处方药信息。"},"examples":[{"en":"Check the PDR for the standard dosage and side effects.","zh":"查一下PDR，看看标准剂量和副作用。"},{"en":"The clinic used the PDR to confirm drug interactions.","zh":"诊所用PDR来确认药物相互作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Preliminary Design Review: a meeting/milestone in engineering where a project’s early design is evaluated before detailed design begins.","zh":"（缩写）初步设计评审：工程项目中的评审节点，用于在进入详细设计前检查早期方案。"},"examples":[{"en":"We need to finish the drawings before the PDR.","zh":"我们需要在PDR前完成图纸。"},{"en":"During the PDR, the team reviewed the main risks and requirements.","zh":"在PDR上，团队审查了主要风险和需求。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Professional Development Review: a formal conversation or document evaluating an employee’s performance and growth goals.","zh":"（缩写）职业发展评估：对员工表现与成长目标进行正式评估的面谈或文件。"},"examples":[{"en":"My PDR is scheduled for next Friday.","zh":"我的PDR安排在下周五。"},{"en":"In the PDR, we set goals for training and promotion.","zh":"在PDR里，我们制定了培训和晋升目标。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌpiː diː ˈɑːr/","extraExplanation":["“PDR”在不同领域含义差异很大（医疗、工程、HR等）。正式写作中建议第一次出现时写全称：例如“Preliminary Design Review (PDR)”。","在美国医疗语境里，“PDR”传统上指纸质《Physicians’ Desk Reference》，现在也常指其在线数据库；不同机构可能改用其他药典/数据库，因此看到“PDR”时最好结合上下文确认。"]}
