{"word":"PE","summary":{"en":"“P.E.” most commonly means “physical education,” the school class for sports and exercise; it can also mean other things depending on context.","zh":"“P.E.”最常见指“体育课”，也可能在不同语境下代表其他含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Physical education; a school subject and class that focuses on exercise, sports, and learning healthy movement.","zh":"体育课；学校里以运动、体育活动和健康体能为核心的课程。"},"examples":[{"en":"We have P.E. twice a week.","zh":"我们一周上两次体育课。"},{"en":"In P.E., we learned how to warm up safely before running.","zh":"在体育课上，我们学习了跑步前如何安全热身。"},{"en":"She forgot her sneakers, so she couldn’t fully join P.E. today.","zh":"她忘带运动鞋了，所以今天没法完全参加体育课。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation for other terms depending on context (for example, “Professional Engineer” in the U.S.).","zh":"在不同语境下可代表其他含义的缩写（例如在美国可指“注册工程师/专业工程师”Professional Engineer）。"},"examples":[{"en":"He signed the report as a P.E. because he is a licensed engineer.","zh":"他以P.E.的身份在报告上签名，因为他是持证工程师。"}]}],"synonyms":["physical education","gym class"],"phonetic":"/pi i/","extraExplanation":["在学校语境里，P.E.常写作“PE”或“P.E.”，口语里也常直接说“pee-ee”。英式英语也常说“PE”，含义基本相同。","如果你是在考试、医学、工程或社交媒体里看到“PE”，它还可能代表很多别的缩写（如“pulmonary embolism 肺栓塞”“price-to-earnings ratio 市盈率”）。给我一句原文我可以帮你判断具体意思。"]}
{"word":"pe","summary":{"en":"“PE” most commonly means physical education (gym class). It can also mean the P/E ratio in finance or polyethylene in materials.","zh":"“PE”最常见意思是体育课（gym class）。它也可指金融中的市盈率（P/E）或材料中的聚乙烯（PE）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"physical education; a school subject that teaches sports, exercise, and health-related fitness (often called “gym” in the U.S.).","zh":"体育课；学校里教授运动、锻炼与健康体能的课程（在美国也常叫“gym”）。"},"examples":[{"en":"We have PE on Tuesdays and Thursdays.","zh":"我们周二和周四有体育课。"},{"en":"I forgot my PE uniform, so I couldn’t join the class.","zh":"我忘了带体育课服装，所以没法参加上课。"},{"en":"PE helps students stay active and learn teamwork.","zh":"体育课帮助学生保持活跃并学习团队合作。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance) price-to-earnings ratio; a number used to compare a company’s share price with its earnings (usually written “P/E”).","zh":"（金融）市盈率；用来比较公司股价与盈利的指标（常写作“P/E”）。"},"examples":[{"en":"This stock has a high P/E ratio.","zh":"这只股票的市盈率很高。"},{"en":"Investors often compare P/E ratios across companies in the same industry.","zh":"投资者常把同一行业公司的市盈率进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(materials) polyethylene; a common plastic used in bags, bottles, and packaging (often written “PE”).","zh":"（材料）聚乙烯；一种常见塑料，用于塑料袋、瓶子和包装（常写作“PE”）。"},"examples":[{"en":"The label says the package is made of PE.","zh":"标签上写着包装是由PE（聚乙烯）制成的。"},{"en":"PE plastic is widely used because it’s cheap and durable.","zh":"PE塑料因价格低且耐用而被广泛使用。"}]}],"synonyms":["physical education","gym class","gym"],"phonetic":"/ˌpiˈi/","extraExplanation":["“PE”通常是字母缩写，读作 /ˌpiˈi/，在书面语中也常写成“P.E.”（带点）或“PE”（不带点）；两种写法都常见。","在美国校园语境里，学生更常说“gym”或“gym class”来指体育课；在更正式的文件或课程表中常写“PE/Physical Education”。","金融语境中更常写作“P/E ratio”，材料与回收标识语境中常见“PE”（聚乙烯）。"]}

