{"word":"peba","summary":{"en":"“Peba” most commonly refers to a South American armadillo; it can also mean “low-quality” in Brazilian Portuguese slang.","zh":"“Peba”最常指一种南美洲的犰狳；在巴西葡语俚语中也可表示“质量差/不太好”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A South American armadillo (often the six-banded armadillo), known in Brazil by this name.","zh":"（南美洲的）一种犰狳（常指六带犰狳），在巴西常用此名称称呼。"},"examples":[{"en":"The peba is an armadillo found in parts of Brazil and neighboring countries.","zh":"Peba 是一种生活在巴西及周边国家部分地区的犰狳。"},{"en":"In some wildlife guides, the six-banded armadillo is listed as “peba.”","zh":"在一些野生动物指南中，六带犰狳会被标注为“peba”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Brazilian Portuguese slang, sometimes seen in English writing about Brazil) low-quality; not very good.","zh":"（巴西葡语俚语；有时在讨论巴西的英文中可见）质量差的；不太好的。"},"examples":[{"en":"That phone is peba—it breaks easily.","zh":"那部手机很 peba——很容易坏。"},{"en":"He bought a peba version because it was cheaper.","zh":"他因为便宜买了个比较 peba 的版本（质量一般）。"}]}],"synonyms":["(animal) armadillo","(animal) six-banded armadillo","(slang) low-quality","(slang) crummy"],"phonetic":"/ˈpeɪbə/","extraExplanation":["“Peba”主要来自巴西的用法：一方面是动物名称（常指六带犰狳），另一方面在巴西葡语口语里也可作俚语表示“差、烂、低档”。在一般英语语境中不常见，多出现在动物学资料或涉及巴西文化的文章里。"]}
{"word":"peban","summary":{"en":"“peban” isn’t recognized as a common English word; it’s likely a typo or a proper name.","zh":"“peban”不是常见英语词，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、专有名词（人名/地名/品牌），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “peban” in an English dictionary—do you mean “pecan” or “pebble”?","zh":"我在英语词典里找不到“peban”——你是不是想写“pecan（碧根果）”或“pebble（鹅卵石）”？"}]}],"phonetic":"/ˈpiːbæn/","extraExplanation":["如果你能提供一句包含“peban”的原句、它出现的国家/领域（例如游戏、科技、医学、地名），我可以更准确判断它的意思与正确拼写。","常见的近似拼写：pecan（/pɪˈkɑn/ 或 /ˈpiːkæn/，坚果），pebble（小圆石），plebeian（平民的/平民）。"]}
{"word":"pebble","summary":{"en":"A pebble is a small smooth stone; it can also mean to cover a surface with small stones.","zh":"pebble 指小而光滑的卵石；也可作动词，表示用卵石铺或装饰表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, smooth stone, often found on a beach or in a river","zh":"卵石；小圆石（常见于海滩或河边）"},"examples":[{"en":"The beach was covered with colorful pebbles.","zh":"海滩上满是彩色的卵石。"},{"en":"He skipped a pebble across the water.","zh":"他把一颗小石子在水面上打水漂。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover, decorate, or pave a surface with small stones","zh":"用卵石铺（路面）；用小石子装饰（表面）"},"examples":[{"en":"They pebbled the garden path to stop it from getting muddy.","zh":"他们用卵石铺了花园小路，防止变得泥泞。"},{"en":"The courtyard was pebbled for a natural look.","zh":"庭院用卵石铺装，呈现自然的风格。"}]}],"synonyms":["small stone","stone","rock (informal, less precise)","gravel (smaller pieces, often many)"],"phonetic":"/ˈpɛbəl/","extraExplanation":["“Pebble”通常指较小、被水流或海浪磨圆的石头；比“stone”更强调“小、圆润、光滑”。","常见搭配：pebble beach（卵石海滩），pebble stone（卵石/鹅卵石），pebble path（卵石小径），pebble-dashed（外墙用小石子抹面的一种做法，英式用法较多）。"]}
{"word":"pebbled","summary":{"en":"“Pebbled” means covered with small stones or having a pebble-like, bumpy texture (often used for leather).","zh":"“pebbled”指“布满卵石的”，或“呈卵石般颗粒/凹凸纹理的”（常用于皮革等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with many small, smooth stones (pebbles), or made to look/feel like pebbles.","zh":"布满小卵石的；呈卵石状（外观或触感）的。"},"examples":[{"en":"We followed a pebbled path along the lake.","zh":"我们沿着湖边一条铺满卵石的小路走。"},{"en":"Her sandals crunched on the pebbled beach.","zh":"她的凉鞋踩在卵石海滩上发出咯吱声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially of leather, paper, or a surface) having a bumpy, pebble-like texture.","zh":"（尤指皮革、纸张或表面）有颗粒感的；有卵石纹理的。"},"examples":[{"en":"He carried a pebbled leather bag.","zh":"他拎着一个卵石纹皮包。"},{"en":"The notebook has a pebbled cover that doesn’t show scratches easily.","zh":"这本笔记本的封面有颗粒纹理，不容易显划痕。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “pebble”: to cover a surface with pebbles or small stones.","zh":"“pebble”的过去式/过去分词：用卵石（小石子）铺（覆）在表面上。"},"examples":[{"en":"The driveway was pebbled to improve drainage.","zh":"车道铺了卵石以改善排水。"}]}],"synonyms":["stony","gravelly","rocky","textured","bumpy","pebbly"],"phonetic":"/ˈpɛbəld/","extraExplanation":["“pebbled leather（卵石纹皮革）”在服装与箱包领域很常见，指表面压出细小凸起颗粒的皮革纹理，不是说真的嵌了卵石。","在描述自然景观时，pebbled 常让人联想到“细碎、圆润、铺满”的画面感，常用于描写海滩、河岸、小路等。"]}
{"word":"pebblehearted","summary":{"en":"Pebblehearted means hard-hearted and lacking compassion.","zh":"pebblehearted 指铁石心肠、缺乏同情心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having little sympathy or kindness; hard-hearted and emotionally cold.","zh":"铁石心肠的；冷酷无情的；缺乏同情心的。"},"examples":[{"en":"The pebblehearted landlord refused to fix the heating, even in winter.","zh":"那位铁石心肠的房东即使在冬天也拒绝修暖气。"},{"en":"Her voice sounded pebblehearted, but later we learned she was terrified, not cruel.","zh":"她的声音听起来很冷酷，但后来我们才知道她是害怕，并非残忍。"},{"en":"In the story, the pebblehearted king ignores the poor until he faces a moral test.","zh":"在故事里，那位冷酷的国王无视穷人，直到他面临道德考验。"}]}],"synonyms":["cold-hearted","hard-hearted","heartless","callous","unsympathetic"],"phonetic":"ˈpɛbəlˌhɑrdɪd","extraExplanation":["“pebblehearted”（也常写作“pebble-hearted”）是比喻用法：把“心”比作小石子（pebble），强调坚硬、冰冷、没有温度，从而表示缺乏怜悯与柔软情感。","这种词更偏文学/描写风格，语气通常带批评或道德评价；日常口语更常用“cold-hearted / hard-hearted”。"]}
{"word":"pebbles","summary":{"en":"“Pebbles” means small, smooth stones; it can also be a verb meaning to cover a surface with small stones.","zh":"“pebbles”指小而圆润的卵石；也可作动词，表示用小卵石铺地面等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, smooth stones, often found on beaches or in riverbeds.","zh":"小卵石；（常指海滩或河床上的）圆润小石子。"},"examples":[{"en":"The beach was covered with white pebbles.","zh":"海滩上铺满了白色的卵石。"},{"en":"She skipped a pebble across the lake.","zh":"她把一颗小石子打水漂，掠过湖面。"},{"en":"I can hear pebbles crunching under my shoes.","zh":"我能听见脚下卵石被踩得咯吱作响。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover a surface with small stones (often for paths or gardens).","zh":"用小卵石铺（路面、花园小径等）。"},"examples":[{"en":"They pebbled the walkway to keep it from getting muddy.","zh":"他们用卵石铺了人行道，防止变得泥泞。"},{"en":"The courtyard was pebbled in a simple black-and-white pattern.","zh":"庭院用黑白卵石铺成了简单的图案。"}]}],"synonyms":["small stones","shingle (BrE, for a pebble beach)","gravel (similar but usually smaller/rougher)"],"phonetic":"/ˈpɛbəlz/","extraExplanation":["“Pebble”通常指比“stone”更小、且更圆滑的石头；和“gravel（碎石）”相比，pebbles一般更大、更圆，常用于园艺装饰或海滩地貌描写。","文学与意象里，pebbles常被用来表现“细小却真实的事物”、时间的磨圆、或旅途中脚下的触感。常见搭配有：pebble beach（卵石滩）、pebble-strewn（布满卵石的）。"]}
{"word":"pebblestone","summary":{"en":"A pebblestone is a small smooth stone, or a surface made by setting many pebbles together; it can also be a verb meaning to cover a surface with pebbles.","zh":"pebblestone 指小而光滑的卵石，或由许多卵石铺成的表面；也可作动词表示用卵石铺设/装饰表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, smooth, rounded stone (a pebble), or a surface made with many small pebbles set into concrete or mortar.","zh":"（卵）鹅卵石；也可指用许多小卵石嵌入水泥/砂浆做成的卵石地面（卵石铺面）。"},"examples":[{"en":"The garden path was covered with pebblestones that crunched underfoot.","zh":"花园小径铺着卵石，走上去脚下会咯吱作响。"},{"en":"She picked up a pebblestone and skipped it across the lake.","zh":"她捡起一颗小卵石，在湖面上打水漂。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover a surface with small pebbles (often as a decorative finish).","zh":"用小卵石铺（地面等）；做成卵石装饰面。"},"examples":[{"en":"They pebblestoned the walkway to give it a natural look.","zh":"他们用卵石铺了人行道，让它看起来更自然。"}]}],"synonyms":["pebble","stone","river stone","gravel (smaller pieces)","cobblestone (larger paving stone)"],"phonetic":"/ˈpɛbəlˌstoʊn/","extraExplanation":["“pebblestone”不是最常见的标准拼写/用词；更常见的是“pebble”（卵石）或“pebble stone”（两词）。如果你想表达“鹅卵石路/石板路”那种老街路面，英语里更常用的是“cobblestone”（圆石铺路的大石块）以及“cobblestone street”。","区别小提示：pebble 通常更小、更光滑；cobblestone 通常更大，用来铺路时更典型。"]}
{"word":"pebbleware","summary":{"en":"Pebbleware is pottery or tableware with a pebbled, stone-like texture or pattern.","zh":"Pebbleware 指表面具有卵石般纹理或触感的陶器/餐具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"ceramic ware (pottery or tableware) with a pebbled texture or a surface pattern that looks/feels like small pebbles.","zh":"带“卵石/小石子”质感或纹理的陶瓷器（如餐具或器皿），表面看起来或摸起来像细小石子。"},"examples":[{"en":"The mug is pebbleware, so it feels slightly rough but comfortable to hold.","zh":"这个马克杯是卵石纹陶瓷，所以摸起来有点粗糙，但握着很舒服。"},{"en":"They chose pebbleware plates for a rustic, handmade look.","zh":"他们选了卵石纹的盘子，营造一种质朴、手作的感觉。"}]}],"synonyms":["textured pottery","stone-textured ware","pebbled ceramic ware"],"phonetic":"ˈpɛbəlˌwɛr","extraExplanation":["“pebbleware”不是非常常见的日常词，更多出现在陶艺、餐具商品描述或家居风格介绍中，用来强调表面的触感（pebbled/stone-like texture）或装饰效果。","在零售语境里，它有时也会被更宽泛地用来指“表面像小石子般凹凸”的器物（不一定只限于陶瓷），但最典型还是陶器/餐具。"]}
{"word":"pebblier","summary":{"en":"“Pebblier” means “more pebbly”: having more pebbles or a more pebbly (bumpy) texture than something else.","zh":"“pebblier”表示“更像卵石的/石子更多的”：比另一事物有更多小石子，或表面更粗糙、更有颗粒感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “pebbly”: having more pebbles, or covered with more small rounded stones than something else.","zh":"“pebbly”的比较级：比另一事物有更多卵石/小圆石，或表面覆盖更多小石子的。"},"examples":[{"en":"This side of the beach is pebblier than the other side.","zh":"海滩这边比那边石子更多。"},{"en":"After the storm, the path became pebblier and harder to walk on.","zh":"暴风雨过后，小路石子更多了，更难走。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “pebbly”: having a rough, bumpy texture like small pebbles (often describing skin, paint, or a surface).","zh":"“pebbly”的比较级：表面更粗糙、更凹凸不平，像小石子一样（常形容皮肤、油漆或材质表面）。"},"examples":[{"en":"This lotion made my skin feel less smooth and pebblier.","zh":"这款乳液让我的皮肤没那么光滑，反而更粗糙了。"},{"en":"The older wall has a pebblier texture than the newly painted one.","zh":"旧墙面比新刷的墙更粗糙、更有颗粒感。"}]}],"synonyms":["more pebbly","rockier","stonier","more bumpy","more gritty"],"phonetic":"/ˈpɛbliər/","extraExplanation":["“pebblier”是形容词“pebbly（多卵石的；像卵石一样粗糙的）”的比较级，常见拼写规则是以 -y 结尾变比较级时把 y 变成 i，再加 -er：pebbly → pebblier。","它既可以字面描述“石子更多”，也可以比喻或质感描述“更颗粒/更粗糙”（例如 *pebbly skin* 指像橘皮一样的颗粒感皮肤）。"]}
{"word":"pebbliest","summary":{"en":"“Pebbliest” means the most covered with pebbles, or having the strongest pebbly (bumpy, granular) texture.","zh":"“pebbliest”指卵石最多的，或颗粒感/凹凸感最明显的（pebbly的最高级）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the most pebbles, or covered with the most small, rounded stones (superlative of “pebbly”).","zh":"最卵石很多的；卵石最多的；最布满小圆石的（“pebbly”的最高级）。"},"examples":[{"en":"This is the pebbliest part of the beach, so sandals help.","zh":"这段海滩卵石最多，所以穿凉鞋会更舒服。"},{"en":"We chose a smoother trail because the pebbliest path hurt our feet.","zh":"我们选了更平坦的路，因为最卵石多的那条路走起来脚疼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most like pebbles in texture or appearance; very rough or bumpy with small rounded lumps (often used about surfaces).","zh":"最像卵石质感/外观的；表面最粗糙、最凹凸不平、带小圆凸起的（常形容表面）。"},"examples":[{"en":"After the rash, his skin felt pebbliest around the elbows.","zh":"起疹子后，他手肘附近的皮肤摸起来最粗糙、最颗粒感。"},{"en":"The artist preferred the pebbliest paper for this ink drawing.","zh":"这位艺术家画墨水画时更喜欢最有颗粒感的纸。"}]}],"synonyms":["most pebbly","stone-covered","gravelly (similar)","bumpy","granular"],"phonetic":"/ˈpɛbəliəst/","extraExplanation":["“pebbliest”是形容词“pebbly”（多卵石的；有颗粒感的）的最高级：pebbly → pebblier → pebbliest。","常见搭配：pebbliest beach/shore/path（卵石最多的海滩/岸边/小路）；pebbliest texture/surface/skin（最颗粒、最粗糙的质感/表面/皮肤）。","使用提示：描述“路面/海滩”时更偏“卵石很多”；描述“纸张/皮肤/涂层”时更偏“颗粒感、凹凸感”。"]}
{"word":"pebbling","summary":{"en":"Pebbling usually means covering a surface with pebbles; in curling, it means spraying water droplets onto the ice to create texture.","zh":"Pebbling通常指用卵石铺盖表面；在冰壶运动中则指向冰面喷洒水滴形成颗粒纹理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of covering a surface with small stones (pebbles), or the condition of being covered with them","zh":"用小卵石铺盖表面；或（表面）布满卵石的状态"},"examples":[{"en":"The garden path needs new pebbling to stop the mud.","zh":"花园小路需要重新铺卵石，才能防止泥泞。"},{"en":"Pebbling along the shoreline can reduce erosion in some areas.","zh":"在一些地区，沿岸铺卵石可以减少侵蚀。"}]},{"partOfSpeech":"n.","definition":{"en":"in curling, the process of spraying small droplets of water onto the ice to create a textured surface for better control of the stone","zh":"（冰壶运动中）在冰面喷洒细小水滴形成“颗粒冰面”，以便更好控制冰壶滑行"},"examples":[{"en":"Good pebbling makes the ice faster and more consistent.","zh":"好的喷点（颗粒）能让冰面更快、更稳定。"},{"en":"Before the match, the ice technician finished pebbling the sheet.","zh":"比赛前，制冰人员完成了对赛道冰面的喷点处理。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover or decorate a surface with pebbles; to scatter pebbles over something","zh":"用卵石覆盖/装饰；在……上撒卵石"},"examples":[{"en":"They are pebbling the walkway to improve drainage.","zh":"他们正在给人行道铺卵石以改善排水。"},{"en":"Rain had pebbled the pond’s surface with tiny ripples.","zh":"雨点把池塘表面打出密密的涟漪。"}]}],"synonyms":["graveling","stoning","surfacing","texturing"],"phonetic":"/ˈpɛb(ə)lɪŋ/","extraExplanation":["“Pebbling”在日常语境里多指“铺卵石/撒卵石”的动作或结果；在冰壶（curling）里是一个非常专业、常用的术语：通过喷洒水滴让冰面形成小颗粒，石壶与冰的摩擦更可控，比赛用冰也会因此更一致。","发音来自“pebble（卵石）+ -ing”。第二个比喻用法（雨点把水面打得像“卵石点点”）常见于描写性写作。"]}
{"word":"pebbly","summary":{"en":"“Pebbly” describes something with lots of small stones, or a small-bumpy texture like pebbles.","zh":"“Pebbly”指布满小卵石的，或像卵石般有细小凸起、颗粒感的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with or containing many small smooth stones (pebbles), or having a rough, small-bumpy texture like pebbles.","zh":"布满（或含有）许多小卵石的；或表面像卵石一样粗糙、有细小凸起的。"},"examples":[{"en":"We walked along a pebbly beach and watched the waves.","zh":"我们沿着一片布满卵石的海滩散步，看着海浪。"},{"en":"The path is pebbly, so wear sturdy shoes.","zh":"这条小路满是碎卵石，所以要穿结实的鞋。"},{"en":"Her voice sounded pebbly from a sore throat.","zh":"她嗓子疼，说话声音听起来沙哑粗涩。"}]}],"synonyms":["stony","gravelly","rocky","grainy","rough-textured"],"phonetic":"/ˈpɛbəli/","extraExplanation":["“pebbly”来自名词 pebble（卵石）+ 形容词后缀 -y（表示“充满……的 / 有……特征的”），常用来描写海滩、河岸、道路等的地表质感。","在口语中也可形容声音（如感冒、喉咙干痛时）呈现“粗涩、颗粒感”的感觉，属于比喻用法。"]}
{"word":"pebrine","summary":{"en":"Pebrine is a contagious, spot-causing disease of silkworms that can ruin silk production.","zh":"Pebrine 指家蚕的一种传染性蚕病，典型症状是胡椒样黑点，会严重影响养蚕与产丝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contagious disease of silkworms that causes dark, pepper-like spots on the body and often leads to weakness and death; it can severely reduce silk production","zh":"（家蚕的）微粒子病/胡椒病：一种传染性蚕病，蚕体表出现类似胡椒粉的黑点，常导致虚弱甚至死亡，并会严重影响产丝量"},"examples":[{"en":"The silk farm lost many silkworms to pebrine that season.","zh":"那一季蚕场因为微粒子病损失了很多家蚕。"},{"en":"Careful egg inspection helps prevent pebrine from spreading to the next generation.","zh":"仔细检查蚕卵有助于防止微粒子病传播到下一代。"}]}],"synonyms":["silkworm disease","pébrine"],"phonetic":"/ˈpɛbriːn/","extraExplanation":["“Pebrine”来自法语 pébrine，与“poivre（胡椒）”有关，因为患病的蚕体表会出现像胡椒点一样的黑色斑点。","19世纪欧洲养蚕业曾因该病遭受重创；巴斯德（Louis Pasteur）通过改进蚕卵筛检与培育方法，帮助控制传播，这也常被用作科学与农业防疫史上的经典案例。"]}
{"word":"pebrinous","summary":{"en":"“Pebrinous” means related to or infected with pebrine, a silkworm disease marked by pepper-like dark spots.","zh":"“pebrinous”指与蚕的微粒子病有关，或患有该病（常见特征为胡椒点样黑斑）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affected by pebrine, a disease of silkworms (and sometimes other insects) that causes dark, pepper-like spots and weakness.","zh":"与“微粒子病（pebrine）”有关的；患有微粒子病的（常指蚕等昆虫，表现为黑色“胡椒点”样斑点与虚弱）。"},"examples":[{"en":"The lab confirmed that the silkworms were pebrinous, so the entire batch was isolated.","zh":"实验室确认这些蚕患有微粒子病，因此整批都被隔离了。"},{"en":"Pebrinous larvae often grow slowly and show tiny dark specks on their bodies.","zh":"患微粒子病的幼虫常常生长缓慢，身体上会出现细小的黑色斑点。"}]}],"synonyms":["pebrine-infected","pebrine-related","diseased (in silkworm context)"],"phonetic":"ˈpɛbrənəs","extraExplanation":["“pebrinous”来自名词“pebrine”（微粒子病）。pebrine一词源于法语“pébrine”，与“poivre（胡椒）”同源，指这种病会让蚕体表出现像胡椒粉一样的黑点。","该词主要用于昆虫学、养蚕与病理学语境，日常英语中很少见。"]}
