{"word":"pecan","summary":{"en":"A pecan is a North American nut often used in cooking (especially desserts like pecan pie); it can also describe foods made with that nut.","zh":"pecan 指北美常见的山核桃坚果，常用于烹饪（尤其甜点如山核桃派）；也可作形容词表示“山核桃的/山核桃味的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of sweet, buttery-tasting nut from a tree native to North America, often used in desserts and cooking.","zh":"一种原产于北美的坚果，味道香甜带奶油感，常用于甜点和烹饪。"},"examples":[{"en":"She added chopped pecans to the salad for extra crunch.","zh":"她在沙拉里加了切碎的山核桃，让口感更脆。"},{"en":"Pecan pie is a classic dessert in the southern United States.","zh":"山核桃派是美国南部非常经典的甜点。"},{"en":"This ice cream has pecans and caramel swirls.","zh":"这款冰淇淋里有山核桃和焦糖纹路。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or flavored with pecans.","zh":"与山核桃有关的；山核桃味的。"},"examples":[{"en":"I ordered a pecan muffin and a coffee.","zh":"我点了一个山核桃松饼和一杯咖啡。"},{"en":"They sell pecan cookies during the holidays.","zh":"他们在节日期间卖山核桃饼干。"}]}],"synonyms":["(nut)","hickory nut (related, not the same)"],"phonetic":"/pɪˈkɑn/","extraExplanation":["“pecan”常读作两种常见重音：PEE-kan 或 puh-KAHN；不同地区（尤其美国南部与其他地区）偏好不同，但都很常见、都算自然。","山核桃在美国饮食文化中很常见，特别是在南方料理与节庆甜点里（如 pecan pie）。另外它和 walnut（核桃）外形相似，但风味通常更甜、更奶香。"]}
{"word":"pecans","summary":{"en":"Pecans are sweet, buttery nuts often used in baking (especially pecan pie).","zh":"pecans 指山核桃/碧根果，一种甜香油润的坚果，常用于烘焙（尤其是山核桃派）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of nut from the pecan tree, with a smooth brown shell and a sweet, buttery taste; often used in baking and cooking.","zh":"一种“山核桃/碧根果”，来自山核桃树，外壳光滑棕色，口感甜香、带奶油般的油润感；常用于烘焙与烹饪。"},"examples":[{"en":"She added chopped pecans to the banana bread.","zh":"她在香蕉面包里加了切碎的碧根果。"},{"en":"Pecan pie is a classic dessert in the southern United States.","zh":"山核桃派是美国南方很经典的甜点。"},{"en":"I like pecans toasted and sprinkled on salads.","zh":"我喜欢把碧根果烤香后撒在沙拉上。"}]}],"synonyms":["nuts","tree nuts"],"phonetic":"/pəˈkɑn/","extraExplanation":["“pecan”常见两种中文叫法：山核桃（更偏学名/树种概念），碧根果（更常见于零食与烘焙包装）。","在美国饮食文化里，pecans 与“南方家常甜点”联系很紧密，最有代表性的是 pecan pie（山核桃派），常在感恩节、圣诞节等节日出现。","发音提示：词尾的 -s 表示复数；单数是 pecan。不同地区口音会有差异，但学习时用一个标准读法即可。"]}
{"word":"peccability","summary":{"en":"Peccability means the possibility or tendency of doing wrong—human fallibility or capacity for sin.","zh":"Peccability 指“可能会作恶/犯错”的属性，即人类的易犯错或有罪性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or possibility of doing wrong; being capable of sin or moral mistakes (the opposite of perfection).","zh":"会犯错（或犯罪/作恶）的可能性；有罪性、易犯错（与“完美无缺”相对）。"},"examples":[{"en":"The novel explores human peccability rather than portraying anyone as perfectly good.","zh":"这部小说探讨的是人性的易犯错，而不是把任何人写成完美无瑕。"},{"en":"In his sermon, the pastor spoke about our peccability and our need to reflect and improve.","zh":"在布道中，牧师谈到人的易犯罪性，以及我们需要反省并改进。"}]}],"synonyms":["fallibility","imperfection","sinfulness","human weakness"],"phonetic":"/ˈpɛkəbəlɪti/","extraExplanation":["“peccability”是比较少见、偏正式的词，常见于宗教、伦理或文学评论语境，强调“人并非完美、可能会犯道德错误”。日常英语里更常用的表达包括“fallibility（会犯错）”“imperfection（不完美）”或“human weakness（人性的弱点）”。","词根来自拉丁语 peccare（犯错、犯罪）。对应的形容词是 “peccable”（会犯错的），反义词是 “impeccable”（无可挑剔的、完美的）。"]}
{"word":"peccable","summary":{"en":"Peccable means “capable of sinning or making moral mistakes,” and it’s relatively rare in modern English.","zh":"peccable 指“会犯错/会犯罪的、并非完美无瑕的”，在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to commit sins or make moral mistakes; not perfect or faultless.","zh":"会犯错/会犯罪的；并非完美无瑕的。"},"examples":[{"en":"As humans, we are all peccable and sometimes choose the wrong thing.","zh":"作为人类，我们都可能犯错，有时会做出错误的选择。"},{"en":"The novel portrays its hero as brave but peccable, capable of jealousy and pride.","zh":"这部小说把主人公写得勇敢但并非完美，也会嫉妒、骄傲。"}]}],"synonyms":["fallible","imperfect","flawed","sinful"],"phonetic":"/ˈpɛkəbəl/","extraExplanation":["“peccable”在现代英语中比较少见，更多时候人们会用它的反义词“impeccable”（无可挑剔的）。在正式写作或文学语境里，作者偶尔用“peccable”来强调“人都会犯错/有弱点”的观点。","词源来自拉丁语 peccare（犯错、犯罪）。如果你想表达更日常的意思，可以用“imperfect”（不完美的）或“fallible”（会犯错的）。"]}
{"word":"peccadillo","summary":{"en":"A peccadillo is a minor mistake or small wrongdoing that isn’t very serious.","zh":"peccadillo 指不太严重的小过失、小错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, minor mistake or offense; a trivial wrongdoing","zh":"小过失；小罪过；无伤大雅的错误/冒犯"},"examples":[{"en":"Being a few minutes late is a peccadillo, not a serious problem.","zh":"迟到几分钟只是小过失，并不是严重问题。"},{"en":"He admitted his peccadillo of checking his phone during meetings.","zh":"他承认自己在会议中看手机这个小毛病。"},{"en":"The tabloids love to report celebrities’ peccadilloes.","zh":"小报很爱报道名人的小过失/小丑闻。"}]}],"synonyms":["minor offense","small fault","little mistake","trivial wrongdoing","misdemeanor (often more legal/serious)"],"phonetic":"ˌpɛkəˈdɪloʊ","extraExplanation":["词源：来自西班牙语 peccadillo（“小罪过”），其根源与拉丁语 peccare（“犯罪；犯错”）有关。语气通常比 “crime/sin” 轻很多，强调“无伤大雅、可被原谅的小错”。","使用提示：peccadillo 常用于较正式或文学化的语境，带一点“轻描淡写”的意味；如果要更口语，可以用 minor mistake / small fault / little slip。","文学/文化用法：在小说、随笔、评论中常用来对比更严重的道德或法律问题，例如 “a peccadillo compared with …（与……相比只是小事）”。"]}
{"word":"peccadilloes","summary":{"en":"Peccadilloes are small, not-very-serious faults or minor misdeeds.","zh":"Peccadilloes 指无伤大雅的小过失、小毛病或轻微的不当行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, relatively unimportant faults or minor misdeeds (plural of *peccadillo*).","zh":"小过失；小毛病；无伤大雅的小错（*peccadillo* 的复数）。"},"examples":[{"en":"Everyone has a few peccadilloes, like being late once in a while.","zh":"每个人都有一些小毛病，比如偶尔迟到。"},{"en":"The article focuses on the politician’s peccadilloes rather than serious wrongdoing.","zh":"那篇文章关注的是那位政治人物的小过失，而不是严重的不法行为。"}]},{"partOfSpeech":"n.","definition":{"en":"Minor moral or social lapses—things that are mildly improper but not deeply harmful.","zh":"轻微的道德或社交失礼之处；不太得体但并不严重的行为。"},"examples":[{"en":"In that strict community, even small peccadilloes were judged harshly.","zh":"在那个严苛的社群里，即使是小小的失礼也会被严厉评判。"},{"en":"She spoke openly about her youthful peccadilloes with a sense of humor.","zh":"她带着幽默感坦率谈起自己年轻时的小错。"}]}],"synonyms":["minor faults","small flaws","foibles","minor offenses","missteps"],"phonetic":"/ˌpɛkəˈdɪloʊz/","extraExplanation":["“peccadillo”常带一点“轻描淡写、略带宽容或调侃”的语气，暗示问题不大；但在正式场合也可能用来“淡化”某人的过错，听起来像在替人开脱。","词源与“peccant（有过失的）/peccable（会犯错的）”同源，来自拉丁语 *peccare*（犯错、犯罪）。"]}
{"word":"peccadillos","summary":{"en":"“Peccadillos” means small, forgivable faults or minor wrongdoing (plural of peccadillo).","zh":"“Peccadillos”指小过失、小毛病（peccadillo 的复数），通常不严重、较容易被原谅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, relatively unimportant mistakes or bad habits (minor faults that are usually easy to forgive).","zh":"小过失；小毛病（通常不严重、容易被原谅的缺点或错误）。"},"examples":[{"en":"He has a few peccadillos, like being late sometimes, but he’s a good teammate.","zh":"他有一些小毛病，比如偶尔迟到，但他是个好队友。"},{"en":"The report focuses on serious misconduct, not minor peccadillos.","zh":"这份报告关注的是严重不当行为，而不是小过失。"}]}],"synonyms":["minor faults","foibles","small vices","minor indiscretions","bad habits"],"phonetic":"/ˌpɛkəˈdɪloʊz/","extraExplanation":["“Peccadillo”常带有“无伤大雅的小缺点/小坏习惯”的语气，多用于较正式的表达。复数是“peccadillos”。","词源来自西班牙语 peccadillo（小罪过），与拉丁语 peccare（犯错、犯罪）有关；因此它常隐含“道德层面的小过错”，但语气比“sin/罪”轻得多。"]}
{"word":"peccancies","summary":{"en":"Peccancies means minor faults or small sins (plural).","zh":"peccancies 指“小过失、小罪”（复数），用法偏书面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) minor faults or sins; small moral mistakes or wrongdoings.","zh":"（复数）小过失；小罪；（道德上的）小错误、过错。"},"examples":[{"en":"The novel focuses on ordinary human peccancies rather than serious crimes.","zh":"这部小说关注的是普通人的小过失，而不是严重的犯罪。"},{"en":"She admitted her peccancies and apologized to her friends.","zh":"她承认了自己的小过失，并向朋友们道歉。"}]}],"synonyms":["minor faults","small sins","peccadilloes","missteps","shortcomings"],"phonetic":"/ˈpɛkənsiːz/","extraExplanation":["“peccancies”是“peccancy”的复数形式，在现代英语中较为少见，语气偏书面、偏文学或宗教语境。日常口语里更常用“faults”“minor sins”“small mistakes”。","词源上与拉丁语 *peccare*（犯错、犯罪、作恶）有关，同源词包括“peccadillo”（小过失）和“impeccable”（无可挑剔的）。"]}
{"word":"peccancy","summary":{"en":"Peccancy means sinfulness or moral wrongdoing, mainly in formal or religious contexts.","zh":"Peccancy 指“罪性/罪过/道德过失”，主要用于正式或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being sinful; wrongdoing or moral fault (often used in formal or religious writing)","zh":"有罪的状态；罪过；道德上的过失（多用于正式或宗教语境）"},"examples":[{"en":"In the sermon, the preacher spoke about human peccancy and the need for forgiveness.","zh":"在布道中，牧师谈到人类的罪性，以及需要宽恕。"},{"en":"The novel treats the hero’s peccancy with sympathy rather than harsh judgment.","zh":"这部小说以同情而非严厉的评判来描写主人公的过失。"}]}],"synonyms":["sinfulness","sin","wrongdoing","guilt","moral fault","transgression"],"phonetic":"/ˈpɛkənsi/","extraExplanation":["“peccancy”是比较书面、偏古典的词，日常英语里更常用“sinfulness”“sin”“wrongdoing”。","词源来自拉丁语“peccare”（犯罪、犯错），与“peccant”（有罪的）同源。"]}
{"word":"peccant","summary":{"en":"Peccant means “sinful” or “guilty of wrongdoing,” used in formal or literary contexts.","zh":"peccant 意为“有罪的、罪恶的”，多用于正式、文学或宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"sinful; morally wrong; doing something that is considered a sin or serious wrongdoing.","zh":"有罪的；犯（道德或宗教意义上的）过错的；罪恶的。"},"examples":[{"en":"In the novel, the hero tries to escape his peccant past and begin again.","zh":"在小说里，主人公试图摆脱他有罪的过去，重新开始。"},{"en":"The preacher warned the community against peccant behavior.","zh":"牧师告诫社区要远离罪恶的行为。"}]}],"synonyms":["sinful","immoral","wicked","culpable"],"phonetic":"/ˈpɛkənt/","extraExplanation":["“peccant”较为正式、偏文学或宗教语境，日常口语里更常用 sinful, wrong, immoral。","词源来自拉丁语 peccare（“犯错、犯罪、犯过”）。在文学中常用于描写人物的“有罪/堕落”状态，带有道德评判色彩。","搭配提示：peccant + past/ways/behavior/soul（有罪的过去/行径/行为/灵魂）。近义词：sinful, immoral, wicked（语气更强）。反义词：innocent, virtuous。"]}
{"word":"peccantly","summary":{"en":"Peccantly means “sinfully” or, in older usage, “in a harmful/faulty (diseased) way.”","zh":"Peccantly 意为“有罪地/作恶地”；在古义中也可指“以有害、失常（病态）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sinful or morally wrong way.","zh":"以有罪的方式；以道德上错误的方式。"},"examples":[{"en":"He spoke peccantly about others, enjoying gossip that hurt people.","zh":"他以带罪的方式议论他人，沉迷于会伤人的流言蜚语。"},{"en":"The novel portrays a character who lives peccantly and later seeks forgiveness.","zh":"这部小说刻画了一个放纵作恶、后来又寻求宽恕的人物。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) In a way that is faulty, harmful, or diseased—especially of a bodily condition or “humor.”","zh":"（古义）以有害、失常或病态的方式（尤指身体状况或“体液/体质”的失衡）。"},"examples":[{"en":"Older medical writing sometimes describes fluids acting peccantly in the body.","zh":"较早的医学写作有时会说体液在体内“peccantly”地失常运作。"}]}],"synonyms":["sinfully","immorally","wrongly","wickedly","faultily"],"phonetic":"/ˈpɛkəntli/","extraExplanation":["词源来自拉丁语 peccare（“犯错/犯罪/作恶”）。因此 peccant / peccantly 既可指“道德上的过错”，也可在旧式医学或文学语境里指“机能失常、有害”。","现代英语里 peccantly 很少见；更常见的是形容词 peccant（如 “peccant behavior”）或直接用 more common 的词：sinfully（罪恶地）、wrongly（错误地）、immorally（不道德地）。"]}
{"word":"peccantness","summary":{"en":"Peccantness means the state of being sinful or morally wrong, and in older/formal use it can also mean being faulty or harmful.","zh":"Peccantness 指“有罪/罪性”，在较旧或正式用法中也可指“有缺陷或有害的性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being sinful or morally wrong; sinfulness","zh":"有罪；罪恶；道德上的过错"},"examples":[{"en":"In the novel, the preacher speaks about human peccantness and the need for forgiveness.","zh":"在小说中，牧师谈到人类的罪性（peccantness）以及宽恕的必要。"},{"en":"She wrote a diary entry confessing her own peccantness and asking how to change.","zh":"她在日记里承认自己的罪过，并思考该如何改变。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being faulty or harmful; a tendency to cause problems (especially in older or technical writing)","zh":"缺陷；有害性；容易引发问题的倾向（多见于较旧或较正式/技术性文体）"},"examples":[{"en":"The report described the peccantness of the design, noting that it failed under stress.","zh":"报告指出该设计的缺陷（peccantness），并说明它在受压时会失效。"},{"en":"Early medical texts blamed illness on the peccantness of bodily fluids.","zh":"早期医学文献把疾病归因于体液的“有害性/失衡”（peccantness）。"}]}],"synonyms":["sinfulness","wickedness","culpability","faultiness","defectiveness"],"phonetic":"/ˈpɛkəntnəs/","extraExplanation":["“peccantness”来自形容词“peccant”（有罪的；有过错的），而“peccant”源自拉丁语 peccare（犯错/犯罪）。因此它在宗教、文学或较古旧的正式语境中更常见。","在历史医学语境里，“peccant humors（有害的体液）”属于旧时体液学说（humoral theory）的说法，现代医学已不采用这一理论。"]}
{"word":"peccaries","summary":{"en":"Peccaries are pig-like wild mammals that usually live in herds in the Americas.","zh":"Peccaries 指生活在美洲、外形像豬且常成群活動的野生哺乳動物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A peccary; a pig-like wild mammal native to Central and South America (and parts of the southwestern U.S.), usually living in groups.","zh":"西貒（野豬類動物）；一種外形像豬的野生哺乳動物，原產於中南美洲（以及美國西南部部分地區），常成群活動。"},"examples":[{"en":"We saw a small herd of peccaries crossing the trail at dawn.","zh":"清晨時，我們看到一小群西貒穿過小徑。"},{"en":"Peccaries look like pigs, but they are a different kind of animal.","zh":"西貒看起來像豬，但牠們其實是不同類的動物。"}]}],"synonyms":["peccary","javelina (esp. for collared peccary)"],"phonetic":"/ˈpɛkəriz/","extraExplanation":["「peccaries」是複數；單數是「peccary」。在美洲的英語語境裡，常見種類包括 collared peccary（有領西貒，亦稱 javelina）與 white-lipped peccary（白唇西貒）。在美國西南部，人們有時更常用「javelina」來指有領西貒。"]}
{"word":"peccary","summary":{"en":"A peccary is a wild, pig-like mammal from the Americas, often seen in groups; in the U.S. it’s commonly called a javelina.","zh":"peccary 指美洲的野豬類動物，常成群出沒；在美國常稱為 javelina（野豬貒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wild pig-like mammal found in the Americas (especially Central and South America and the southwestern U.S.), often living in groups; also called a javelina (especially in the U.S.).","zh":"西貒（野豬類哺乳動物），分布於美洲（尤其中南美與美國西南部），常成群活動；在美國也常稱為 javelina（野豬貒）。"},"examples":[{"en":"We saw a group of peccaries crossing the trail at dusk.","zh":"黃昏時，我們看到一群西貒穿過小徑。"},{"en":"In Arizona, people often call a peccary a javelina.","zh":"在亞利桑那州，人們常把西貒叫作 javelina。"}]}],"synonyms":["javelina (esp. U.S.)","collared peccary (a common species)"],"phonetic":"/ˈpɛkəri/","extraExplanation":["「peccary」不是「pig（豬）」：外形像豬，但屬於不同的動物類群；在英文科普或旅遊情境中常被提到。","常見搭配：a herd/group of peccaries（成群的西貒）；collared peccary（領西貒，常見物種名）。"]}
{"word":"peccation","summary":{"en":"Peccation means the act of sinning or a sinful act (formal, rare).","zh":"peccation 指“犯罪/作恶/罪行”，多用于正式或宗教、伦理语境，较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of sinning; a sinful act or moral wrongdoing (formal, rare)","zh":"犯罪；作恶；罪行（正式用语，较少见）"},"examples":[{"en":"In some religious writings, even a small peccation is seen as something to confess and change.","zh":"在一些宗教著作中，即使很小的罪行也被认为需要忏悔并改变。"},{"en":"He treated the lie as a minor peccation rather than a serious offense.","zh":"他把那个谎言看作小小的罪行，而不是严重的过错。"}]}],"synonyms":["sin","wrongdoing","transgression","misdeed","offense"],"phonetic":"/pɛˈkeɪʃən/","extraExplanation":["“Peccation”源自拉丁语 peccare（意为“犯罪、做错事”）。现代英语里更常用的词是 “sin” 或 “wrongdoing”，而 “peccation” 多见于宗教、伦理或较为文雅的写作中。","在文学或古典风格的文章里，“peccation”常用于强调“道德层面”的过错，而不只是一般的错误（error/mistake）。"]}
{"word":"peccatiphobia","summary":{"en":"Peccatiphobia means an intense fear of sinning or doing something morally wrong.","zh":"Peccatiphobia 指对“犯罪/作恶/犯道德错误”的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, persistent fear of sinning or doing something morally wrong","zh":"对“犯罪/作恶/犯错（道德层面）”的强烈、持续的恐惧"},"examples":[{"en":"Because of her peccatiphobia, she kept asking for reassurance that she hadn’t done anything wrong.","zh":"因为她有 peccatiphobia（对“犯错/作恶”的恐惧），她不断寻求别人保证她没有做错事。"},{"en":"His peccatiphobia made everyday decisions—like what to say in a text—feel morally risky.","zh":"他的 peccatiphobia 让日常决定（比如短信里该怎么说）都变得像在冒道德风险。"},{"en":"In some cases, peccatiphobia can overlap with religious anxiety and constant guilt.","zh":"在一些情况下，peccatiphobia 可能与宗教焦虑和持续的内疚感重叠。"}]}],"synonyms":["hamartophobia","fear of sin","moral anxiety","scrupulosity (related)"],"phonetic":"/ˌpɛkəˌtɪfəˈboʊbiə/","extraExplanation":["这个词比较少见，多用于较正式或学术化的语境。","词源可拆解理解：拉丁语 peccatum（“罪、过错”）+ -phobia（“恐惧”）。意思直观：对“罪/作恶”的恐惧。","它描述的是“强烈到影响生活”的恐惧；如果只是一般的道德谨慎或想做正确的事，通常不会用 -phobia。"]}
{"word":"peccatophobia","summary":{"en":"Peccatophobia means an intense fear of sin or of committing sin.","zh":"Peccatophobia 指对“罪/犯下罪过”的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of sin or of committing a sin (often connected to religious guilt or moral anxiety).","zh":"对“罪/犯罪（犯下罪过）”的强烈恐惧（常与宗教内疚或道德焦虑有关）。"},"examples":[{"en":"After the sermon, she felt peccatophobia and worried that every small mistake was a sin.","zh":"讲道之后，她出现了对罪的恐惧（peccatophobia），担心每个小错误都是罪。"},{"en":"His peccatophobia made him constantly seek reassurance that he had done nothing wrong.","zh":"他的“怕犯罪”让他不停地寻求确认，确保自己没有做错事。"},{"en":"In therapy, they explored whether her peccatophobia was linked to strict upbringing and guilt.","zh":"在治疗中，他们探讨她的“怕犯罪”是否与严格的成长环境和内疚感有关。"}]}],"synonyms":["hamartophobia","fear of sin","scrupulosity (related)"],"phonetic":"/ˌpɛkətoʊˈfoʊbiə/","extraExplanation":["词源：来自拉丁语 peccatum（“罪、罪过”）+ -phobia（“恐惧症”）。","使用提示：它属于比较少见、偏心理学/宗教学语境的词。日常更常见的表达是 “fear of sin / fear of committing sin”。","相关词：hamartophobia 也常用来指“对犯罪/罪恶的恐惧”，在实际使用中两者含义非常接近。"]}
{"word":"peccavi","summary":{"en":"Peccavi is a Latin quotation meaning “I have sinned,” used to confess fault (often wittily).","zh":"Peccavi 是拉丁语引语，意为“我有罪/我犯错了”，常带机智或讽刺地用于认错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin word meaning “I have sinned,” used in English as a quoted confession or a witty, learned way to admit wrongdoing.","zh":"拉丁语，意为“我犯了罪/我有罪”，在英语中常作为引用语使用，用较“文雅/机智”的方式承认做错事。"},"examples":[{"en":"After breaking the rule, he shrugged and said, “Peccavi.”","zh":"他违反规定后耸耸肩说：“Peccavi（我有罪）。”"},{"en":"The headline used “Peccavi” to suggest a public confession.","zh":"标题用“Peccavi”来暗示一次公开认错。"}]}],"synonyms":["I have sinned","mea culpa","I’m at fault","my mistake"],"phonetic":"/pɛˈkɑːvi/","extraExplanation":["“Peccavi”来自拉丁语动词 peccare（犯罪、犯错）的完成时第一人称：peccavi = “我已经犯错/我有罪”。英语里多作为引语或带学术/讽刺色彩的“认错”。","它最著名的文化典故常被提到：英国将军 Charles Napier 1843 年吞并印度的信德省（Sindh）后，据传用一句“Peccavi”（听起来像 “I have Sindh”=“我有信德/我占了信德”）来做文字双关。这一说法常用于讨论殖民史与政治讽刺，但也有人认为这句电报的真实性存疑。","在现代英语里它不算日常用语，更常见于文章标题、讽刺评论、或刻意“文言化”的自嘲认错。"]}
{"word":"peccavis","summary":{"en":"Peccavis is a Latin-form phrase meaning “you have sinned,” and in English it can also refer (less commonly) to a formal admission of wrongdoing; “peccavi” is the more common spelling in English.","zh":"Peccavis 是拉丁语，意为“你已经犯错/有罪”；在英语中也可引申指较正式的认错/自白（但更常见拼写为 peccavi）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Latin; sometimes used in English writing) “you have sinned.”","zh":"（拉丁语；有时用于英文写作）“你犯了罪/你做了错事。”"},"examples":[{"en":"In the margin of the manuscript, someone wrote “Peccavis” as a stern warning.","zh":"在手稿的页边，有人写下“peccavis”，作为严厉的警告。"},{"en":"The priest’s note ended with a simple “peccavis,” urging the reader to repent.","zh":"神父的便条以一句简单的“peccavis”结尾，催促读者悔改。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension in English) an admission of wrongdoing; a written confession (more commonly spelled “peccavi”).","zh":"（引申为英语用法）承认过错；书面的认罪/自白（更常见拼写为“peccavi”）。"},"examples":[{"en":"After the scandal, his public statement read like a formal peccavi.","zh":"丑闻之后，他的公开声明读起来像一份正式的认错书。"},{"en":"She offered a quiet peccavi and promised to make things right.","zh":"她低声认错，并承诺会弥补。"}]}],"synonyms":["confession","admission (of guilt)","mea culpa","acknowledgment of wrongdoing"],"phonetic":"/pɛˈkɑːvis/","extraExplanation":["“peccavis”是拉丁语动词 peccare（犯错/犯罪）的完成时第二人称单数，字面意思是“你已经犯错了”。在英文里更常见的借用形式是“peccavi”（我犯错了），常用来表示郑重的认错，语气比普通的“sorry”更正式。","文化小典故：19世纪有个著名双关语把“Peccavi”（I have sinned, 我犯错了）拿来影射英军占领印度信德省（Sindh），因读音相近而流传。"]}
{"word":"pech","summary":{"en":"“pech” is a German loanword meaning either “bad luck” (informal) or “pitch/tar,” and it’s uncommon in everyday English.","zh":"“pech”是一个源自德语的借词，可指（非正式的）“倒霉/霉运”或“焦油/沥青”，在日常英语中不算常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German, informal) bad luck; misfortune.","zh":"（源自德语，非正式）倒霉；霉运。"},"examples":[{"en":"I had total pech today—missed the bus and spilled coffee on my shirt.","zh":"我今天真是太倒霉了——错过公交车，还把咖啡洒在衬衫上。"},{"en":"He calls it pech when everything goes wrong at once.","zh":"他把那种事事不顺的情况称作“pech”（倒霉）。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) pitch/tar; a dark, sticky substance used for waterproofing or sealing.","zh":"（源自德语）沥青；焦油；用于防水或密封的黑色黏稠物质。"},"examples":[{"en":"The boots were stained with pech after the hike.","zh":"徒步后靴子被焦油（pech）弄脏了。"},{"en":"Historically, pech was used to seal wooden ships.","zh":"历史上，焦油（pech）常被用来给木船做密封防水。"}]}],"synonyms":["bad luck","misfortune","pitch","tar"],"phonetic":"/pɛk/","extraExplanation":["“Pech”主要是德语词：日常口语里常指“倒霉/运气差”，也可以指“焦油/沥青”。在英语中并不常见，多出现在谈论德语文化、移民语境或特定领域的借用表达中。","发音提示：德语词尾的“ch”在德语里不是英语的/k/音，但英语借用时常被简化读作/k/，因此可听到类似 /pɛk/ 的读法。"]}
{"word":"pechan","summary":{"en":"A pecan is a buttery-tasting nut widely used in American cooking and desserts.","zh":"pecan 指山核桃（美洲山核桃）坚果，味道浓香，常用于美国料理和甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of brown nut with a rich, buttery taste, commonly eaten on its own or used in desserts (especially in the U.S.).","zh":"山核桃（美洲山核桃）坚果；一种棕色、奶油香味浓的坚果，常直接食用或用于甜点（在美国很常见）。"},"examples":[{"en":"She added chopped pecans to the salad for extra crunch.","zh":"她在沙拉里加了切碎的山核桃仁，让口感更脆。"},{"en":"Pecan pie is a classic dessert in the southern United States.","zh":"山核桃派是美国南部的经典甜点。"},{"en":"I bought a bag of roasted pecans at the grocery store.","zh":"我在超市买了一袋烤山核桃。"}]}],"synonyms":["(no exact synonym)"],"phonetic":"/pɪˈkɑn/","extraExplanation":["你输入的“pechan”通常是“pecan”的拼写错误或不标准拼写。英语里常见两种读法：/pɪˈkɑn/（更常见）以及/ˈpiːkæn/（部分地区常用）。","“pecan”在美国文化中很有代表性，尤其在南部地区；常见搭配有：pecan pie（山核桃派）、candied pecans（糖渍/蜜饯山核桃）、pecan tree（山核桃树）。"]}
{"word":"pechans","summary":{"en":"Pecans are edible nuts often used in baking, especially in pecan pie.","zh":"Pecans 指可食用的碧根果/山核桃坚果，常用于烘焙，尤其是山核桃派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of nut from the pecan tree, commonly eaten roasted or used in desserts like pecan pie.","zh":"山核桃（碧根果）的一种坚果，常被烤着吃或用于甜点（如山核桃派）。"},"examples":[{"en":"I bought a bag of pecans to bake a pie.","zh":"我买了一袋碧根果来烤派。"},{"en":"She added chopped pecans to the salad for extra crunch.","zh":"她在沙拉里加了切碎的碧根果，让口感更脆。"}]}],"synonyms":["pecan nuts"],"phonetic":"/pɪˈkɑːnz/","extraExplanation":["你输入的“pechans”通常是拼写错误；正确拼写是“pecans”。在美国英语里，pecans 的读音常见有不同地区差异，但拼写固定为 pecans。","文化小提示：Pecan pie（山核桃派/碧根果派）是美国南部很经典的甜点，感恩节和圣诞节期间尤其常见。"]}
{"word":"pechay","summary":{"en":"Pechay is a leafy green vegetable—bok choy/Chinese cabbage—often used in Filipino cooking.","zh":"Pechay 指小白菜/青江菜（bok choy），在菲律宾料理中很常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A leafy green vegetable (a type of bok choy/Chinese cabbage) commonly used in Filipino and other Asian cooking.","zh":"小白菜／青江菜（一种常见于菲律宾及亚洲料理的叶菜，属于白菜类）"},"examples":[{"en":"Add pechay to the soup in the last minute so it stays crisp.","zh":"把小白菜在最后一分钟放进汤里，这样口感更脆。"},{"en":"We cooked pechay with garlic and a little soy sauce.","zh":"我们用蒜和一点酱油炒了小白菜。"}]}],"synonyms":["bok choy","pak choi","Chinese cabbage"],"phonetic":"ˈpɛtʃaɪ","extraExplanation":["“Pechay”这个词在菲律宾英语（Philippine English）里很常见，通常指的是青江菜/小白菜（bok choy）。在北美英语里，人们更常说“bok choy”或“pak choi”。","烹饪上，pechay很容易熟，适合做清炒、煮汤、火锅或加入面食；通常建议最后再下锅，避免煮得太软。"]}
{"word":"peche","summary":{"en":"Peche is usually the French word pêche (“peach”), seen in English mainly in culinary contexts; much more rarely it can reflect French péché (“sin”).","zh":"peche 通常对应法语 pêche（“桃子”），在英语里多见于美食语境；更少见的情况下也可能对应法语 péché（“罪”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French loanword, used in English mainly in food/wine writing) a peach; peach-flavored or peach-related.","zh":"（法语外来词，英语中多见于美食/葡萄酒语境）桃子；桃子味的；与桃子有关的。"},"examples":[{"en":"The menu listed a tart topped with fresh pêche and cream.","zh":"菜单上写着一款上面铺着新鲜桃子和奶油的挞。"},{"en":"This cocktail has notes of pêche and citrus.","zh":"这款鸡尾酒带有桃子和柑橘的风味。"},{"en":"Pêche Melba is a classic dessert made with peaches, ice cream, and raspberry sauce.","zh":"“蜜桃梅尔巴”是一道经典甜点，用桃子、冰淇淋和覆盆子酱制作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare in English; from French péché) “sin,” especially when a French title/phrase is kept in French.","zh":"（英语中较少见；源自法语 péché）“罪；罪过”，常见于保留法语的书名/短语中。"},"examples":[{"en":"The film title includes the word péché (“sin”) to keep the French tone.","zh":"这部电影片名里用了 péché（“罪”）来保留法语风格。"}]}],"synonyms":["peach (common English equivalent)","pêche (with accent, standard French spelling)"],"phonetic":"/pɛʃ/","extraExplanation":["在法语里，“pêche”（桃子）和“péché”（罪）写法不同：一个是“ê”，一个是“é”。英语里有时会把重音符号省略写成 peche，容易混淆。","如果你本来想查的是英语单词“peach”（桃子），拼写是 peach，发音也不同。你可以告诉我你想要哪一个，我可以给你更贴近的词条与用法。"]}
{"word":"peched","summary":{"en":"“Peched” is not standard English; it is usually a misspelling of “peached,” meaning “told on someone” (or, less commonly in UK/Aus slang, “hit/struck”).","zh":"“peched”不是标准英文，通常是“peached”的误拼，意思多为“告发/打小报告”（较少见的英/澳俚语义为“打/击中”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling. In most contexts, people mean “peached” (past tense/past participle of “peach”), especially in the informal sense “to inform on; tell on someone.”","zh":"非标准拼写。多数情况下人们想写的是“peached”（“peach”的过去式/过去分词），常见口语义为“告发；打小报告”。"},"examples":[{"en":"He peached on his friends to the teacher. (Standard spelling: “peached,” not “peched.”)","zh":"他向老师告发了朋友。（标准拼写是“peached”，不是“peched”。）"},{"en":"Don’t peach on me—I didn’t mean to break it. (Standard spelling: “peach.”)","zh":"别告我的状——我不是故意弄坏的。（标准拼写：peach。）"}]},{"partOfSpeech":"vt.","definition":{"en":"Less commonly, “peached” can mean “to hit or strike (someone),” mainly in British/Australian informal English.","zh":"较少见时，“peached”在英式/澳式非正式英语里可指“打中；猛击（某人）”。"},"examples":[{"en":"He peached him right on the nose. (UK/Aus informal; standard spelling: “peached.”)","zh":"他一拳打在对方鼻子上。（英/澳口语；标准拼写：“peached”。）"}]}],"synonyms":["told on","informed on","reported","snitched (informal)"],"phonetic":"/pitʃt/","extraExplanation":["“peched”本身不算常见英文单词，更多是拼写错误或听写误差。你如果是在聊天记录、字幕或作业里看到“peched”，很可能原意是：\n1) peached（告发/打小报告）；\n2) poached（烹饪法“水波蛋/水煮”，或“偷猎、盗捕”）；\n3) French 的 péché（“罪”），但那是法语不是英语。\n如果你能提供原句，我可以帮你确定最准确的词和意思。"]}
{"word":"pechili","summary":{"en":"“Pechili” is an old Western spelling used in historical texts for Zhili (Chihli) or for the Gulf of Pechili (the Bohai area).","zh":"“Pechili”是历史英文资料中的旧式拼写，常指“直隶（Zhili/Chihli）”或“Pechili湾（渤海/渤海湾）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An older Western spelling for Zhili (Chihli), a former province in northern China around Beijing and Tianjin.","zh":"（历史用法）中国北方“直隶（Zhili/Chihli）”的旧式西方拼写，指曾经以北京、天津为中心的旧省名。"},"examples":[{"en":"In some 19th‑century books, Beijing is described as lying in “Pechili” (Zhili).","zh":"在一些19世纪的书里，北京被描述为位于“Pechili”（直隶）之内。"},{"en":"The name “Pechili” is now mostly seen in historical maps.","zh":"“Pechili”这个名称如今多见于历史地图。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) Short for the Gulf of Pechili, an older name for the Bohai Sea/Bohai Gulf area in northern China.","zh":"（历史用法）“Pechili湾/渤海湾（Bohai）”的旧称，指中国北方渤海（渤海湾）一带水域。"},"examples":[{"en":"The ship was reported near the Gulf of Pechili (Bohai).","zh":"据报道，那艘船出现在“Pechili湾”（渤海）附近。"},{"en":"Older atlases may label the Bohai as the “Gulf of Pechili.”","zh":"较早的地图册可能把渤海标注为“Gulf of Pechili（Pechili湾）”。"}]}],"synonyms":["Zhili","Chihli","Gulf of Pechili","Bohai","Bohai Gulf"],"phonetic":"ˌpɛtʃəˈliː","extraExplanation":["“Pechili”属于旧式转写（常见于19世纪至20世纪早期的英文资料），并非现代汉语拼音。现代写法通常用“Zhili/Chihli（直隶）”或直接用“Bohai（渤海）/Bohai Gulf（渤海湾）”。","在阅读历史英文文献时，可把“Pechili”理解为与北京、天津周边地区（旧“直隶”）或渤海/渤海湾相关的地名用法；现代语境中很少使用。"]}
{"word":"peching","summary":{"en":"Peck means to tap or pick repeatedly (like a bird with its beak), and it can also mean a quick, light kiss.","zh":"peck 指（像鸟用喙那样）反复啄/轻敲；也可指“轻轻一吻”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to strike or pick at something repeatedly with a beak (or in a similar quick, tapping way).","zh":"（鸟）用喙反复啄；也可指类似“快速点按/轻敲”的动作。"},"examples":[{"en":"The chickens were pecking at the grain on the ground.","zh":"鸡在地上啄食谷粒。"},{"en":"He nervously pecked at his food during the meeting.","zh":"开会时他紧张地小口啄着吃东西。"},{"en":"She pecked at the keyboard with two fingers.","zh":"她用两根手指在键盘上“戳戳点点”地打字。"}]},{"partOfSpeech":"v.","definition":{"en":"to kiss someone lightly and quickly.","zh":"轻轻一吻；快速地亲一下。"},"examples":[{"en":"He gave her a quick peck on the cheek.","zh":"他在她脸颊上轻轻亲了一下。"},{"en":"They pecked each other goodbye at the door.","zh":"他们在门口轻吻道别。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick, light kiss.","zh":"轻吻；快速的一吻。"},"examples":[{"en":"Just a peck, not a long kiss.","zh":"就轻轻亲一下，不要长吻。"}]}],"synonyms":["tap","pick at","nibble","kiss (lightly)"],"phonetic":"/pɛk/","extraExplanation":["“peching” 不是常见的英语拼写；最可能是把 “pecking / peck” 拼错了（常见于学习者输入）。如果你想查的是别的词（比如 Peking/北京 的旧译名），告诉我上下文句子，我可以帮你确认。"]}
{"word":"pechs","summary":{"en":"“Pechs” is usually the plural of “Pech,” a German loanword meaning “bad luck,” and less commonly “pitch/tar.”","zh":"“pechs”通常是“Pech”的复数，主要指（德语借词）“倒霉/不走运”，较少指“沥青/焦油”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad luck; misfortune (used mainly as a German loanword, especially in the phrase “have Pech”).","zh":"倒霉；不走运（主要作为德语借词出现，常见于短语“have Pech”=“很倒霉”）。"},"examples":[{"en":"We missed the train—just Pech, I guess.","zh":"我们没赶上火车——我想就是倒霉吧。"},{"en":"He said he had Pech with his visa application.","zh":"他说他的签证申请很不顺（很倒霉）。"}]},{"partOfSpeech":"n.","definition":{"en":"pitch; tar (literal meaning in German, sometimes seen in technical or historical contexts).","zh":"沥青；焦油（德语里的字面意思，偶尔在技术或历史语境中出现）。"},"examples":[{"en":"The old boat seams were sealed with Pech.","zh":"那艘旧船的接缝用沥青（焦油）封住。"}]},{"partOfSpeech":"other","definition":{"en":"plural of “Pech” (either the loanword meaning “bad luck” or the noun meaning “pitch/tar”).","zh":"“Pech”的复数（可指“倒霉”，也可指“沥青/焦油”）。"},"examples":[{"en":"A string of small pechs ruined the whole trip.","zh":"一连串小倒霉把整趟旅行都毁了。"}]}],"synonyms":["bad luck","misfortune","unlucky break"],"phonetic":"/pɛʃ/","extraExplanation":["“Pech”在英文里并不常见，更多出现在与德语相关的语境（例如文学翻译、人物对白、或讨论德国文化时）。德语里常说“Pech haben”（直译“有Pech”），意思就是“倒霉/运气差”。","德语“Pech”原本也指“焦油/沥青”，因此它从“黏糊糊的焦油”引申出“麻烦、倒霉”的口语意思。"]}
{"word":"pecht","summary":{"en":"“Pecht” is most commonly used as a surname in English, not a standard vocabulary word.","zh":"“Pecht”在英语中多见作姓氏使用，并非标准常用词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), not a common everyday English word.","zh":"一个姓氏（家族姓），不是常见的英语词汇。"},"examples":[{"en":"Dr. Pecht will give a talk on art history this evening.","zh":"Pecht 博士今晚会做一场关于艺术史的讲座。"},{"en":"I found an article written by Pecht in the journal.","zh":"我在期刊里找到一篇由 Pecht 撰写的文章。"}]}],"phonetic":"/pɛkt/","extraExplanation":["“Pecht”在英语里通常作为专有名词（姓氏）出现，而不是有固定词义的普通词。","如果你是在阅读或听写中看到“pecht”，它也可能是拼写误差：常见的接近词包括“peach”（桃子）或“perched”（栖息/停在……上）。你可以告诉我上下文句子，我可以帮你判断最可能的词。"]}
{"word":"pechys","summary":{"en":"“Pechys” is likely a misspelling of “peachy,” meaning either peach-colored/pleasant or (informally) ‘fine/great’—sometimes sarcastically.","zh":"“pechys”很可能是“peachy”的误拼，可表示“粉橘色/像桃子般可爱”，也可作口语“很好/棒”，有时带反讽。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “peachy”) Like a peach in color, smell, or softness; pinkish-orange and pleasant-looking.","zh":"（通常拼作“peachy”）像桃子一样的；指颜色、气味或触感带有桃子的特征；常指粉橘色、柔和好看。"},"examples":[{"en":"She wore a peachy lipstick that matched her blush.","zh":"她涂了粉橘色的口红，和腮红很搭。"},{"en":"The room had a warm, peachy glow at sunset.","zh":"日落时房间里有一种温暖的粉橘色光晕。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Doing well; fine; excellent (sometimes used sarcastically).","zh":"（非正式）很好；不错；棒（有时带反讽）。"},"examples":[{"en":"“How are things?” “Peachy, thanks!”","zh":"“最近怎么样？”“挺好的，谢谢！”"},{"en":"He said everything was peachy, but he looked stressed.","zh":"他说一切都很好，但看起来压力很大。"},{"en":"Just peachy—now my phone won’t charge.","zh":"真“好极了”——现在我手机还充不了电。（反讽）"}]}],"synonyms":["rosy","pinkish","pleasant","great","fine","excellent"],"phonetic":"/ˈpiːtʃi/","extraExplanation":["“pechys”不是常见英文拼写，最可能是把“peachy”拼错了。","口语里常见固定说法“just peachy”，意思是“一切都很好”；在抱怨时也常用反语表示“真是太‘好了’（其实很糟）”。"]}
{"word":"pecian","summary":{"en":"A pecan is a sweet nut (or the tree that produces it), common in American cooking—especially in pecan pie.","zh":"Pecan 指山核桃坚果（也可指山核桃树），在美式料理中很常见，尤其是山核桃派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet, buttery nut with a hard shell, often eaten roasted or used in desserts","zh":"山核桃（美洲胡桃）坚果；味道香甜、油润，常烤着吃或用于甜点"},"examples":[{"en":"I bought a bag of roasted pecans.","zh":"我买了一袋烤山核桃仁。"},{"en":"Pecan pie is a popular dessert in the southern United States.","zh":"山核桃派是美国南部很受欢迎的甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"the North American tree that produces pecans","zh":"山核桃树（产山核桃坚果的北美树种）"},"examples":[{"en":"There’s a pecan tree in their backyard.","zh":"他们后院里有一棵山核桃树。"}]}],"synonyms":["nut","hickory nut (related)"],"phonetic":"/pɪˈkɑn/","extraExplanation":["“pecian”不是常见的英文拼写；你很可能想查的是 **pecan**（山核桃）。","**pecan** 这个词来自北美原住民语言（阿尔冈昆语系），大意与“需要用石头敲碎的坚果”有关。","美式英语里它的读音有地区差异：有人读得更像 /pɪˈkɑn/（常见于美国南部），也有人读得更像 /ˈpiːkæn/。两种都能被理解。"]}
{"word":"pecify","summary":{"en":"“Specify” means to state something clearly and exactly, or to name exactly which item you mean.","zh":"“Specify”表示“明确具体地说明”，也可表示“指明具体是哪一个”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to state something clearly and exactly, often by giving details or conditions","zh":"明确、具体地说明（常通过给出细节或条件）"},"examples":[{"en":"Please specify the date and time of the meeting.","zh":"请明确说明会议的日期和时间。"},{"en":"The form asks you to specify your emergency contact.","zh":"这张表格要求你填写并明确说明紧急联系人。"},{"en":"The contract specifies what happens if payment is late.","zh":"合同明确规定了逾期付款会怎样处理。"}]},{"partOfSpeech":"vt.","definition":{"en":"to name a particular item from a group; to point out exactly which one you mean","zh":"从一组中指明某个特定对象；具体指出是哪一个"},"examples":[{"en":"Can you specify which file you want to download?","zh":"你能具体指出你要下载哪个文件吗？"},{"en":"He didn’t specify a brand, just the type of phone.","zh":"他没有指定品牌，只说了手机类型。"}]}],"synonyms":["state","clarify","indicate","define","stipulate"],"phonetic":"/ˈspɛsəˌfaɪ/","extraExplanation":["你输入的“pecify”通常是拼写错误；正确单词是“specify”。常见记法：spec- 有“看/检查、具体说明”的感觉（如 specific, specification）。","“specify”在正式场合（合同、说明书、申请表、需求文档）非常常见，语气比“say/tell”更正式，强调“说清楚细节”。"]}
{"word":"pecite","summary":{"en":"“Recite” means to say something aloud from memory or to formally list details.","zh":"“recite”指背诵/朗诵，或正式地逐条列举说明。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to say something aloud from memory or from a written text (for example, a poem, a prayer, or lines in a play)","zh":"（从记忆或照着文本）朗诵；背诵；诵读（如诗、祷告词、台词等）"},"examples":[{"en":"She can recite the whole poem from memory.","zh":"她能把整首诗背诵出来。"},{"en":"The class recited the pledge together.","zh":"全班一起诵读誓词。"}]},{"partOfSpeech":"v.","definition":{"en":"to list facts, details, or events in order, often in a formal or careful way","zh":"（较正式地）列举；逐条陈述（事实、细节或事件）"},"examples":[{"en":"He recited the reasons for the decision.","zh":"他逐条陈述了作出这个决定的理由。"},{"en":"She recited her work history during the interview.","zh":"面试时她陈述了自己的工作经历。"}]}],"synonyms":["repeat","say","chant","declare","recount","enumerate"],"phonetic":"/rɪˈsaɪt/","extraExplanation":["“pecite”不是常见或标准的英语单词，通常是把 **recite** 拼错了（r 和 p 位置接近时容易打错）。如果你确实看到的是“pecite”，可以把原句发我，我帮你判断它是否是专有名词、拼写错误，或某个领域/地区用语。"]}
{"word":"peck","summary":{"en":"“Peck” most commonly means to make quick, light strikes (like a bird’s beak) or to give a quick, light kiss; it can also mean a dry-measure unit called a peck.","zh":"“peck”最常指（像鸟喙一样）快速轻啄/轻点，或“轻轻一吻”；也可指干量单位“配克”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to strike or bite quickly with a beak (or like a beak); to make small, sharp touches","zh":"（鸟）用喙快速啄；（像鸟啄一样）轻轻而快速地点/戳"},"examples":[{"en":"The bird pecked at the seeds on the ground.","zh":"那只鸟在地上啄食种子。"},{"en":"She pecked me on the cheek before leaving.","zh":"她离开前轻轻亲了我一下脸颊。"},{"en":"He pecked at the keyboard with one finger.","zh":"他用一根手指在键盘上笨拙地敲着。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick, light kiss; a small bite or strike (especially by a bird)","zh":"轻轻一吻；（尤指鸟的）轻啄/小咬/轻击"},"examples":[{"en":"He gave his daughter a peck on the forehead.","zh":"他在女儿额头上轻轻亲了一下。"},{"en":"The chicken gave my shoe a peck.","zh":"那只鸡轻啄了我的鞋子一下。"}]},{"partOfSpeech":"n.","definition":{"en":"a unit of dry volume (U.S. and U.K.), used for foods like apples or potatoes","zh":"配克（干量单位，用于苹果、土豆等；美制/英制均有，但容量略有差别）"},"examples":[{"en":"We bought a peck of apples at the farm stand.","zh":"我们在农场摊位买了一配克苹果。"}]}],"synonyms":["tap","poke","jab","nibble","kiss (lightly)"],"phonetic":"/pɛk/","extraExplanation":["“peck”作动词时常带有“反复、小幅度、轻而快”的感觉：peck at + 名词 很常见，表示“啄/一点点地吃/不停地轻敲”。","表示“轻吻”时更口语、亲昵，但通常比“kiss”更轻、更快：a peck on the cheek/forehead。","“a peck of apples”属于较传统的度量说法，如今在日常生活中不如“pound(s)”常见，但在农场市集、乡村语境或童谣/谚语里仍会出现（如：a peck of pickled peppers）。"]}
{"word":"peckage","summary":{"en":"Peckage is an uncommon noun meaning either an amount measured in pecks or (more rarely) damage caused by pecking, especially by birds.","zh":"Peckage 是一个不常用的名词，可指“按配克（peck）计的数量”，也可（更罕见地）指“啄食造成的损坏/损失”（尤指鸟啄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A quantity measured in pecks (a peck is a dry measure equal to 8 dry quarts, about 9 liters).","zh":"（不常用）以“配克（peck）”为单位计算的数量（peck 为英美常用的干量单位，= 8 夸脱，约 9 升）。"},"examples":[{"en":"The contract listed the apple delivery by peckage rather than by weight.","zh":"合同里苹果的交货量用 peckage（按配克计）来写，而不是按重量。"},{"en":"Farmers used to sell produce by peckage at the local market.","zh":"过去农民在集市上常按 peckage（按配克计的数量）来卖农产品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Damage or loss caused by pecking, especially by birds.","zh":"（罕见）被啄造成的损坏或损失（尤指鸟类啄食导致的）。"},"examples":[{"en":"The cherries showed noticeable peckage from birds.","zh":"这些樱桃有明显的鸟啄损伤（peckage）。"},{"en":"Netting can reduce peckage in fruit orchards.","zh":"在果园里搭网可以减少鸟啄造成的损失（peckage）。"}]}],"synonyms":["quantity in pecks","measure by the peck","pecking damage","bird damage"],"phonetic":"ˈpɛkɪdʒ","extraExplanation":["“peckage”在现代英语中很少见，更常见的说法是：用量词时直接说“in pecks / by the peck（按配克计）”；描述鸟啄损害时更常用“pecking damage”或更具体的“bird damage”。","“peck（配克）”主要用于干货（如苹果、土豆、谷物）的传统计量；在日常生活与正式文件中，现代更常用重量或公制单位。"]}
{"word":"pecked","summary":{"en":"“Pecked” means “struck/picked at quickly,” often with a beak; it can also mean “ate in small bites” or “gave a quick kiss.”","zh":"“pecked”是“peck”的过去式/过去分词：常指（用鸟喙）快速啄/啄击；也可指小口吃，或（非正式）快速轻吻。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “peck”: to strike or pick at something quickly with a beak (or with short, sharp movements).","zh":"“peck”的过去式和过去分词：用鸟喙快速啄、啄击；也可指用短促、尖锐的动作戳/点。"},"examples":[{"en":"The chicken pecked the ground looking for seeds.","zh":"小鸡啄着地面找种子。"},{"en":"A woodpecker pecked holes in the tree.","zh":"啄木鸟在树上啄出洞来。"}]},{"partOfSpeech":"v.","definition":{"en":"To eat something in small bites; to nibble.","zh":"小口小口地吃；一点点地啃/啄食。"},"examples":[{"en":"She pecked at her salad because she wasn’t very hungry.","zh":"她不太饿，只是小口小口地吃沙拉。"},{"en":"He barely pecked at his dinner during the meeting.","zh":"开会时他几乎没怎么吃晚饭。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) To give a quick, light kiss.","zh":"（非正式）轻轻、快速地亲一下。"},"examples":[{"en":"He pecked her on the cheek before leaving.","zh":"他出门前在她脸颊上轻轻亲了一下。"},{"en":"She pecked him goodbye at the door.","zh":"她在门口轻轻亲了他一下道别。"}]}],"synonyms":["jabbed","picked","nibbled","tapped","kissed (lightly)"],"phonetic":"/pɛkt/","extraExplanation":["“peck”常和介词at连用：peck at 除了“啄/小口吃”，还可以表示“挑剔、唠叨式地批评”（多指反复、小幅度地惹人烦）。例如：He felt pecked at by his boss.（他觉得老板老是挑他毛病。）","“peck”还有名词用法（a peck），指“一啄/一下”，也可指一种英美旧制干量单位（约等于8夸脱），但日常口语里相对少见。"]}
{"word":"pecker","summary":{"en":"“Pecker” usually means a bird’s beak, but it can also be a vulgar slang word for a penis—use with caution.","zh":"“pecker”通常指鸟的喙，但也可作粗俗俚语指阴茎——使用需谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bird’s beak; also used for a bird that pecks (especially in names like “woodpecker”).","zh":"鸟的喙；也可指会啄食的鸟（尤其出现在“woodpecker 啄木鸟”等词里）。"},"examples":[{"en":"The bird used its pecker to crack the seed.","zh":"那只鸟用喙啄开了种子。"},{"en":"A woodpecker’s pecker is strong enough to tap into tree bark.","zh":"啄木鸟的喙很结实，能敲进树皮。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, vulgar slang) A penis.","zh":"（非正式、粗俗俚语）阴茎。"},"examples":[{"en":"That word is vulgar—avoid using it in polite conversation.","zh":"那个词很粗俗——在正式或礼貌的场合要避免使用。"},{"en":"In many workplaces, using slang like that can be considered harassment.","zh":"在许多工作场所，使用那种俚语可能会被视为骚扰。"}]}],"synonyms":["beak","bill","woodpecker (in context)","penis (medical/neutral alternative)","dick (slang, vulgar)"],"phonetic":"ˈpɛkər","extraExplanation":["“pecker”这个词在日常英语里有两个落差很大的意思：一个是中性（鸟喙/与啄木鸟相关），另一个是粗俗俚语（指男性生殖器）。因为后者很容易让人尴尬或被认为不礼貌，学习者在不确定语境时最好避免使用，改用更中性的表达（如 beak，或直接说 woodpecker）。"]}
{"word":"peckers","summary":{"en":"“Peckers” most commonly means woodpeckers or birds/animals that peck; it can also be a vulgar slang word for penises.","zh":"“peckers”最常见指啄木鸟或会啄食的鸟/动物；也可能是指阴茎的粗俗俚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Birds that peck, especially woodpeckers; also people/animals that peck.","zh":"（复数）啄食的鸟（尤指啄木鸟）；也可指会啄的动物或人。"},"examples":[{"en":"We heard peckers tapping on the tree early in the morning.","zh":"清晨我们听到啄木鸟在树上敲击的声音。"},{"en":"The chickens are quick peckers when you throw grain on the ground.","zh":"把谷粒撒在地上时，鸡啄得很快。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, plural) Penises; a vulgar term.","zh":"（俚语，复数）阴茎；粗俗用语。"},"examples":[{"en":"That word is vulgar, so avoid using it in polite conversation.","zh":"那个词很粗俗，所以在正式或礼貌场合要避免使用。"}]}],"synonyms":["woodpeckers","birds","chickens (contextual)","(slang) dicks (vulgar)"],"phonetic":"/ˈpɛkɚz/","extraExplanation":["“pecker”在日常最常见的中性意思是“啄木鸟/啄食的鸟”。但在一些地区或语境里，它也常被当作男性生殖器的粗俗说法；如果不确定场合（尤其是学校、工作、正式交流），建议用更明确的词：woodpeckers（啄木鸟）或 birds（鸟）。"]}
{"word":"peckerwood","summary":{"en":"“Peckerwood” can mean a woodpecker, but more commonly it’s a derogatory US slur for a rural/poor white person, and it can also refer to a white prison gang member.","zh":"“Peckerwood”可指啄木鸟，但更常见的是美国对乡村/贫穷白人的侮辱性称呼，也可指白人监狱帮派成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) a woodpecker (the bird). Example: “A peckerwood was tapping on the tree outside.”","zh":"（非正式）啄木鸟（这种鸟）。例： “一只peckerwood在外面的树上啄木。”"},"examples":[{"en":"A peckerwood kept drumming on the tree all morning.","zh":"一只啄木鸟整个早上都在树上敲敲打打。"}]},{"partOfSpeech":"n.","definition":{"en":"(US, derogatory/offensive) a poor or rural white person; used as an insult. Example: “He used a slur like ‘peckerwood’ in an argument.”","zh":"（美国，贬义/冒犯性用语）指贫穷或乡村白人，用作侮辱性称呼。例：“他在争吵时用了‘peckerwood’这样的辱称。”"},"examples":[{"en":"The character uses the word as an insult, showing his prejudice.","zh":"这个角色把这个词当作辱骂，体现了他的偏见。"},{"en":"It’s best to avoid slurs like this in polite conversation.","zh":"在正式或礼貌的交流中，最好避免使用这类辱称。"}]},{"partOfSpeech":"n.","definition":{"en":"(US prison slang) a member of a white prison gang often called the “Peckerwoods.” Example: “The report mentioned conflict between prison groups, including the Peckerwoods.”","zh":"（美国监狱俚语）指被称为“Peckerwoods”的白人监狱帮派成员。例：“报告提到监狱团体冲突，其中包括Peckerwoods。”"},"examples":[{"en":"The documentary discusses prison gangs, including the Peckerwoods.","zh":"这部纪录片讨论了监狱帮派，包括Peckerwoods。"}]}],"synonyms":["woodpecker (bird sense)","(slur context) redneck (often offensive)"],"phonetic":"ˈpɛkərˌwʊd","extraExplanation":["这个词在现实交流中高度敏感：除“啄木鸟”这一较少见的口语义外，更常见的是带侮辱性的种族/阶层辱称，或监狱帮派语境。若你在小说、影视、新闻里看到，通常是在呈现偏见、冲突或特定社会环境，并不适合日常模仿使用。","在文学或影视对白中，作者/编剧可能用它来刻画角色的敌意、阶级对立或种族紧张。阅读时可将其理解为“带强烈贬义的称呼”，翻译时也常用“辱称/蔑称”来提示语气。"]}
{"word":"pecket","summary":{"en":"“Pecket” is usually a misspelling of “pocket,” meaning a small pouch in clothing; it can also mean to put something in your pocket or keep money for yourself.","zh":"“pecket”通常是“pocket”的拼写错误，意思是衣服上的口袋；也可作动词，表示把东西放进口袋或（钱）私吞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) A small pouch or sewn-in bag in clothing used for carrying small items.","zh":"（很可能是拼写错误）衣物上用来放小物品的口袋。"},"examples":[{"en":"I put my keys in my pocket.","zh":"我把钥匙放进了口袋里。"},{"en":"This jacket has two deep pockets.","zh":"这件夹克有两个很深的口袋。"}]},{"partOfSpeech":"v.","definition":{"en":"To put something into a pocket; to keep or take (money) for yourself.","zh":"把某物放进口袋里；（钱）据为己有/私吞。"},"examples":[{"en":"She pocketed the note and walked away.","zh":"她把纸条塞进口袋里就走开了。"},{"en":"He pocketed the cash instead of reporting it.","zh":"他没有上报，而是把现金私吞了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Small, contained, or limited in size (often used before a noun).","zh":"小型的；局部的；有限的（常用于名词前）。"},"examples":[{"en":"They live in a pocket neighborhood near downtown.","zh":"他们住在市中心附近一个小片区。"},{"en":"The report mentions pockets of poverty.","zh":"报告提到了一些贫困的局部地区。"}]}],"synonyms":["pouch","compartment","bag (small)","stash (v.)"],"phonetic":"/ˈpɑkət/","extraExplanation":["“pecket”在英文里不是常见标准拼写，最可能是“pocket”的误拼（键盘上 o 和 e 相邻，容易打错）。如果你原本想查别的词（例如人名/地名/品牌），告诉我上下文句子我可以再确认。","“pocket”常见搭配：in your pocket（在你口袋里/稳操胜券）、pickpocket（扒手）、pocket money（零花钱）、pocket-sized（口袋大小的）。"]}
{"word":"peckful","summary":{"en":"Peaceful means calm/quiet or without violence; it can describe a place, situation, or a person’s feelings.","zh":"Peaceful 指“宁静的/平和的”或“没有暴力冲突的”，可形容环境、局势或人的心情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Calm and quiet; without violence, fighting, or disturbance.","zh":"和平的；安静的；没有暴力、争斗或骚乱的。"},"examples":[{"en":"We enjoyed a peaceful afternoon by the lake.","zh":"我们在湖边度过了一个宁静的下午。"},{"en":"The protesters asked for a peaceful solution.","zh":"抗议者要求一个和平的解决方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Feeling calm and relaxed inside; not worried or upset.","zh":"内心平静的；放松的；不焦虑或不烦躁的。"},"examples":[{"en":"After the talk, she felt peaceful again.","zh":"谈过之后，她又感到内心平静了。"},{"en":"Meditation helps me stay peaceful during stressful days.","zh":"冥想帮助我在压力大的日子里保持平静。"}]}],"synonyms":["calm","quiet","tranquil","serene","nonviolent"],"phonetic":"/ˈpisfəl/","extraExplanation":["“peckful”通常是“peaceful”的拼写错误或听写错误。正确拼写是 peaceful。","peaceful = peace（和平/平静）+ -ful（充满……的），字面意思是“充满和平/平静的”。"]}
{"word":"peckhamite","summary":{"en":"Peckhamite = a person from Peckham, or something relating to Peckham (south London).","zh":"Peckhamite 指佩克汉姆（伦敦南部）的人，或与佩克汉姆有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Peckham (a district in south London, England).","zh":"（英国伦敦南部）佩克汉姆（Peckham）的人；佩克汉姆居民。"},"examples":[{"en":"She’s a Peckhamite who still lives near Rye Lane.","zh":"她是个佩克汉姆人，现在还住在莱伊巷（Rye Lane）附近。"},{"en":"As a Peckhamite, he knows the quickest bus routes into central London.","zh":"作为佩克汉姆人，他很熟悉去伦敦市中心最快的公交线路。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Peckham or its people.","zh":"与佩克汉姆或佩克汉姆居民有关的。"},"examples":[{"en":"The article describes a Peckhamite music scene shaped by many cultures.","zh":"这篇文章描写了一个受多元文化影响的“佩克汉姆式”音乐圈。"},{"en":"They opened a Peckhamite-style café with local art on the walls.","zh":"他们开了一家很“佩克汉姆风格”的咖啡馆，墙上挂着本地艺术作品。"}]}],"synonyms":["Peckham resident","local (to Peckham)","Londoner (broader)"],"phonetic":"/ˈpɛkəmaɪt/","extraExplanation":["“Peckhamite”是地名（Peckham）加上表示“某地人/某地相关”的后缀“-ite”构成的词，类似：Brooklynite（布鲁克林人）、Londonite（伦敦人）。","Peckham在英国文化中常与“多元族群、社区生活、城市更新（gentrification）”等话题一起出现；在新闻或随笔里用“Peckhamite”往往带有一种“本地人视角/地方身份认同”的意味。"]}
{"word":"peckier","summary":{"en":"Peckier means “more pecky,” most often describing wood with more small holes or pits.","zh":"Peckier 意为“更有小孔/凹点的”（多用于木材）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of pecky: having more small holes, pits, or marks (especially said of wood).","zh":"“pecky”的比较级：有更多小孔、凹点或斑痕（尤用于形容木材）。"},"examples":[{"en":"This board is peckier than the others, so it’s better for a rustic look than for fine furniture.","zh":"这块木板比其他的孔洞更多，所以更适合做乡村风效果，不太适合精细家具。"},{"en":"We chose the peckier pieces of pine for the cabin walls because they add texture.","zh":"我们挑了孔洞更多的松木来做小木屋墙面，因为它们更有质感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) More likely to peck; more prone to making small jabbing taps.","zh":"（较少见）更爱啄的；更容易用小而快的动作轻啄、轻戳的。"},"examples":[{"en":"Some birds get peckier during feeding time.","zh":"有些鸟在喂食时间会更爱啄。"},{"en":"The peckier chicks kept tapping at the seeds.","zh":"那些更爱啄的小鸡不停地啄种子。"}]}],"synonyms":["more pitted","more holey","more marked","more porous"],"phonetic":"/ˈpɛkiər/","extraExplanation":["“peckier”比较少见，日常英语里更常遇到的是 **peckish**（有点饿），其比较级通常写作 **peckisher**，不是 *peckier*。","“pecky/peckier”在木工与建筑语境中更常用，指木材表面出现虫孔、鸟啄状小洞或天然凹点（如某些松木、柏木的装饰性纹理）。"]}
{"word":"peckiest","summary":{"en":"“Peckiest” means the most “pecky”: either most full of small holes/marks, or (less commonly) most irritable.","zh":"“Peckiest”表示“最pecky的”：要么最布满小洞/斑点；要么（较少见）最烦躁、最易怒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “pecky”) having the most small pits, holes, or marks (often from damage, insects, or wear).","zh":"（“pecky”的最高级）最布满小坑、小洞或小斑点的（常因损伤、虫害或磨损造成）。"},"examples":[{"en":"Among the boards, this one is the peckiest, so it won’t look smooth after painting.","zh":"在这些木板里，这块最坑坑洼洼的，所以刷完漆也不会显得平滑。"},{"en":"The peckiest apples are still fine for making pie.","zh":"最有小斑点的苹果也还是可以用来做派。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, less common) the most irritable or easily annoyed.","zh":"（非正式、较少见）最烦躁的；最容易恼火的。"},"examples":[{"en":"After a long flight, he was at his peckiest and snapped at small questions.","zh":"长途飞行后他最烦躁，对一些小问题都不耐烦地顶了回去。"},{"en":"I’m peckiest when I haven’t eaten all day.","zh":"我一整天没吃东西的时候最容易烦躁。"}]}],"synonyms":["most pitted","most holey","most marked","most irritable","most cranky"],"phonetic":"ˈpɛkiɪst","extraExplanation":["“peckiest”是形容词“pecky”的最高级，但在日常口语里并不常见。很多学习者或母语者想表达“有点饿”时会用“peckish”（如：I’m a bit peckish.），它的最高级通常会说“the hungriest”，而不是“the peckiest”。","“pecky”在不同语境里意思差异较大：在木材/表面描述中更常指“有虫蛀/小孔”；表示人的性格时则偏口语，意思接近“易怒、爱挑剔”。"]}
{"word":"peckiness","summary":{"en":"Peckiness usually means a touchy, snappy irritability; more rarely, it can mean small holes/flaws in wood.","zh":"Peckiness 通常指“敏感易怒、爱呛人”的脾气；少见时也可指木材上的小孔洞/瑕疵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slightly aggressive, irritable, or touchy manner; tendency to “snap” at people over small things.","zh":"（言行）带点攻击性、易怒或敏感；因小事就“呛人/发脾气”的倾向。"},"examples":[{"en":"His peckiness showed up whenever he was stressed at work.","zh":"他一旦工作压力大，就会变得很爱呛人。"},{"en":"I thought she was being rude, but it was just temporary peckiness from lack of sleep.","zh":"我以为她是在无礼，其实只是因为没睡好而一时脾气有点冲。"},{"en":"Try not to take his peckiness personally; he’s been worried all week.","zh":"别把他的火气当成针对你；他整周都很焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) small flaws or “holes” in wood, like the marks left by insects; the condition of being pecky.","zh":"（少见）木材上的小孔洞/瑕疵（如虫蛀痕）；“有虫眼的/多孔的（pecky）”这种状态。"},"examples":[{"en":"The table’s surface had some peckiness, but it still looked rustic and charming.","zh":"桌面有些小孔洞，但反而显得质朴好看。"},{"en":"Cedar can show natural peckiness, which some people like for its texture.","zh":"雪松有时会出现天然的小孔洞纹理，有些人很喜欢这种质感。"}]}],"synonyms":["irritability","touchiness","peevishness","snappishness","testiness"],"phonetic":"/ˈpɛkinəs/","extraExplanation":["“peckiness”在表示“脾气冲、爱怼人”时并不算特别常见，更常见的近义词有“irritability / touchiness / peevishness”。","它有时会和“peckishness”（饿得有点想吃东西的感觉）混淆：peckish = 有点饿；pecky/peckiness（木材）= 有虫眼/小孔洞。"]}
{"word":"pecking","summary":{"en":"“Pecking” usually means making quick small strikes/bites (like a bird), and it also appears in “pecking order” meaning a social ranking.","zh":"“Pecking”常指像鸟一样快速小幅度地啄/戳；也常见于“pecking order”，表示群体中的等级/排位。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the -ing form of “peck”: to strike or pick at something quickly with the beak (or in a similar small, quick way).","zh":"“peck”的现在分词形式：用喙快速啄/啄击；也可指用类似方式轻快地戳、点。"},"examples":[{"en":"The bird was pecking at the seeds on the ground.","zh":"那只鸟在地上啄食种子。"},{"en":"He kept pecking at his keyboard with two fingers.","zh":"他一直用两根手指在键盘上“点点戳戳”地打字。"}]},{"partOfSpeech":"n.","definition":{"en":"a series of small, quick bites or taps (often used with “at”).","zh":"（常与 at 连用）一连串小而快的啄、咬、轻点。"},"examples":[{"en":"She took a few pecking bites of her sandwich and went back to work.","zh":"她匆匆小口咬了几下三明治，就又去工作了。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in the phrase “pecking order”: a social ranking that shows who has more power or priority.","zh":"用于短语 “pecking order”：等级/排位（表示谁更有权力或更优先）。"},"examples":[{"en":"In the office pecking order, interns usually have the least influence.","zh":"在办公室的等级序列里，实习生通常影响力最小。"},{"en":"The new coach quickly changed the team’s pecking order.","zh":"新教练很快改变了球队内部的排位。"}]}],"synonyms":["nibble","pick at","tap","jab","poke","peck (order: hierarchy)"],"phonetic":"/ˈpɛkɪŋ/","extraExplanation":["“pecking order（等级序列/排位）”源自对鸡群等家禽行为的观察：地位高的会啄地位低的，低位者往往不敢反击，于是形成稳定的“谁压谁”的顺序。后来这个说法被广泛借用来描述职场、学校、团体中的权力与优先级。"]}
{"word":"peckish","summary":{"en":"Peckish means “a little hungry,” often suggesting you want a small snack rather than a full meal.","zh":"Peckish 表示“有点饿”，通常暗示想吃点零食/点心，而不是正餐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A little hungry; wanting a small amount of food.","zh":"有点饿；想吃点东西（但不算很饿）。"},"examples":[{"en":"I’m feeling a bit peckish—shall we grab a snack?","zh":"我有点饿——我们去吃点零食好吗？"},{"en":"She got peckish after the long meeting.","zh":"开了很久的会之后，她有点饿了。"},{"en":"If you’re peckish, there’s fruit in the kitchen.","zh":"如果你有点饿，厨房里有水果。"}]}],"synonyms":["a little hungry","hungry","snackish (informal)"],"phonetic":"/ˈpɛkɪʃ/","extraExplanation":["“peckish”在英式英语里很常用、语气轻松随意，表示“有点饿，想垫垫肚子”。在美式英语也能听懂，但更常说“a little hungry”或“kinda hungry”。","词源与“peck”（啄、啄食）有关，带有“像小鸟啄几口那样只想吃一点”的感觉，因此通常暗示只需要小吃/点心而不是一顿正餐。"]}
{"word":"peckishly","summary":{"en":"“Peckishly” means “in a slightly hungry, snack-wanting way.”","zh":"“peckishly”表示“有点饿、想吃点零食/垫肚子”的状态或方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slightly hungry way; as if you want a small snack rather than a full meal.","zh":"（以）有点饿、想吃点东西（但还不到很饿）的方式。"},"examples":[{"en":"I’m feeling peckishly hungry—let’s grab a quick bite before dinner.","zh":"我有点饿——晚饭前我们先随便吃点东西吧。"},{"en":"She smiled peckishly and asked if there were any cookies left.","zh":"她带着点“想吃点东西”的笑意，问还有没有剩下的饼干。"}]}],"synonyms":["slightly hungrily","a little hungrily","with a small appetite"],"phonetic":"/ˈpɛkɪʃli/","extraExplanation":["“peckishly”来自形容词“peckish”（有点饿）。它常用于口语，语气比“hungrily（饿得慌）”更轻、更随意，暗示“想吃点零食/垫垫肚子”。","词根与“peck（啄；小口吃）”有关，带有“吃一点点”的感觉，因此通常指“轻微饥饿”。"]}
{"word":"peckishness","summary":{"en":"Peckishness means a slight, mild feeling of hunger (often said in a casual or humorous way, especially in British English).","zh":"peckishness 指“微饿、稍微有点饿”的感觉（语气较随意，常见于英式英语，也可带点幽默）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of slight hunger; being a little hungry.","zh":"微饿；有点饿的感觉。"},"examples":[{"en":"I felt a bit of peckishness, so I grabbed a banana.","zh":"我有点微饿，所以拿了根香蕉。"},{"en":"After the walk, a gentle peckishness made the soup smell even better.","zh":"散步后那种轻微的饥饿感让汤闻起来更香了。"}]},{"partOfSpeech":"n.","definition":{"en":"An informal, slightly humorous way to talk about mild hunger (often in British English).","zh":"（较口语、略带幽默，常见于英式英语）用来表示“有点饿”。"},"examples":[{"en":"Is it lunchtime yet? I’m getting peckishness coming on.","zh":"到午饭时间了吗？我开始有点饿了。"},{"en":"He joked about his peckishness while waiting for the train snacks.","zh":"等火车零食时，他开玩笑说自己有点饿。"}]}],"synonyms":["mild hunger","hunger pangs","appetite","a touch of hunger"],"phonetic":"/ˈpɛkɪʃnəs/","extraExplanation":["“peckishness”来自形容词“peckish”（有点饿）加名词后缀“-ness”。“peckish”可能和“peck”（小鸟啄食）有关，带有“只想吃一点点”的感觉，因此语气通常比“hunger”更轻、更随意。","使用上更常见的是“peckish”（形容词）：I’m peckish. 名词“peckishness”相对少见，多出现在较书面或刻意俏皮的表达中。"]}
{"word":"peckle","summary":{"en":"“Peckle” is a dialect word meaning “a small amount,” and it can also mean “to peck/nibble repeatedly.”","zh":"“Peckle”是方言词，常指“少量”，也可作动词表示“反复啄/小口啃”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, especially Scottish/Northern English) a small amount; a little bit.","zh":"（方言，尤指苏格兰/英格兰北部）少量；一点点。"},"examples":[{"en":"Add a peckle of salt to the soup.","zh":"在汤里加一点点盐。"},{"en":"I’ve got a peckle of time before I need to go.","zh":"我在走之前还有一点点时间。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dialect) to peck at something repeatedly; to nibble or pick at in small bites.","zh":"（方言）反复啄（或小口咬/啃）；一点点地啃、挑着吃。"},"examples":[{"en":"The hens peckled at the grain on the ground.","zh":"母鸡在地上啄食谷粒。"},{"en":"He just peckled at his food because he wasn’t hungry.","zh":"他不饿，所以只是挑着吃了几口。"}]}],"synonyms":["a wee bit","a little","a small amount","nibble","peck"],"phonetic":"/ˈpɛkəl/","extraExplanation":["“Peckle”在现代标准英语里不常见，更多见于苏格兰英语或英格兰北部方言。日常写作中通常用“a little (bit) / a small amount”来替代；口语或方言语境里用“peckle”会更有地方色彩。"]}
{"word":"peckled","summary":{"en":"“Peckled” means having many small spots or patches of color.","zh":"“peckled”表示“有许多细小斑点/色斑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with small spots or patches of color; speckled.","zh":"有斑点的；布满小点或小块色斑的。"},"examples":[{"en":"A peckled hen laid a brown egg.","zh":"一只带斑点的母鸡下了一颗棕色的蛋。"},{"en":"The stone was gray and peckled with white dots.","zh":"那块石头是灰色的，上面点缀着白色小斑点。"},{"en":"His shirt was peckled with paint after the renovation.","zh":"装修后他的衬衫上沾满了零星的油漆点。"}]}],"synonyms":["speckled","spotted","freckled","dappled"],"phonetic":"/ˈpɛkəld/","extraExplanation":["“peckled”来自“peck”（啄）这一词根的意象：像被鸟啄过一样留下许多小点，因此常用来形容颜色或污渍呈现“点点散布”的效果。","近义词辨析：speckled最常见、最中性；spotted更口语、也可指“被发现的”；freckled多用于皮肤上的雀斑；dappled常指较大的斑块状（如马或树荫）。"]}
{"word":"peckly","summary":{"en":"Peckly is a rare dialect adjective meaning ‘speckled or pitted with small marks.’","zh":"Peckly 是一个很少见的方言形容词，意思是“带小斑点或小凹点的、略麻子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, dialect) Marked with small spots, pits, or freckles; slightly pockmarked or speckled.","zh":"（罕见／方言）带有小斑点或小凹点的；有雀斑的；略麻子的、略斑驳的。"},"examples":[{"en":"The old stone wall looked peckly after years of wind and rain.","zh":"这堵旧石墙经多年风雨侵蚀后，看起来有些斑驳坑坑点点的。"},{"en":"He had a peckly complexion, with tiny marks on his cheeks.","zh":"他的肤色有点麻子样，脸颊上有细小的痕点。"}]}],"synonyms":["speckled","spotted","freckled","pockmarked"],"phonetic":"/ˈpɛkli/","extraExplanation":["“peckly”在现代标准英语里非常少见，多出现在苏格兰或英格兰北部等地区方言中。常见含义与“有小斑点/小凹点”有关，可用于描述皮肤、石头、表面纹理等。","它可能与“peck（啄）”或表示“点状/小坑”的方言用法有关：好像被许多小点“啄”过一样，因此出现许多细小斑点或坑。","如果你想表达“有点饿”，更常用的词是“peckish（有点饿的）”，而不是“peckly”。"]}
{"word":"pecks","summary":{"en":"“Pecks” can mean small quick taps/kisses (plural nouns), dry-measure units (plural), or the verb form meaning “pecks” = “taps/picks with a beak.”","zh":"“pecks”既可作名词复数（轻啄/轻吻；或传统干量单位“配克”），也可作动词第三人称单数（轻啄、轻戳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “peck”: a quick, light hit with the beak (by a bird), or a quick light kiss","zh":"“peck”的复数：指（鸟）用喙快速轻啄；也可指轻轻一吻"},"examples":[{"en":"The chicken gave the ground a few pecks and found a seed.","zh":"那只鸡在地上啄了几下，找到了一粒种子。"},{"en":"She greeted her child with two quick pecks on the cheek.","zh":"她在孩子脸颊上轻轻亲了两下作为问候。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of “peck”: a unit for measuring dry goods (especially fruit/vegetables)","zh":"“peck”的复数：量词（主要用于干货，如水果、蔬菜）的“配克/斗”（英美传统单位）"},"examples":[{"en":"They bought two pecks of apples at the farm stand.","zh":"他们在农场摊位买了两配克苹果。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “peck”: to strike or pick at something repeatedly with a beak (or like a beak)","zh":"“peck”的第三人称单数：反复轻啄；（比喻）像鸟喙一样挑、戳、啄"},"examples":[{"en":"A sparrow pecks at the crumbs near the bench.","zh":"一只麻雀在长椅旁啄食面包屑。"},{"en":"He pecks at his keyboard with two fingers.","zh":"他用两根手指在键盘上“戳着”打字。"}]}],"synonyms":["taps","nips","picks","pecks (on the cheek: kisses)","dry measures (unit sense)"],"phonetic":"/pɛks/","extraExplanation":["“peck”作单位时属于较传统的用法，日常口语里不如“pound/公斤”常见，但在农贸市场、乡村语境或固定表达里仍会出现。美制中 1 peck = 8 dry quarts（约 8.8 升）；英制历史上略有差异。","文化小知识：儿歌/谚语里常见 “a peck of pickled peppers”（绕口令）以及 “give someone a peck (on the cheek)”（轻轻一吻）。"]}
{"word":"pecksniff","summary":{"en":"“Pecksniff” means a hypocrite who acts morally superior for show.","zh":"“pecksniff”指装作道德高尚、实际上很虚伪的伪善者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hypocritical person who pretends to be morally or religiously good in order to gain respect, advantage, or trust","zh":"伪善的人；装作非常道德或虔诚、以博取尊重或谋取利益的人"},"examples":[{"en":"He sounded kind, but his pecksniff was obvious when he took credit for other people’s work.","zh":"他话说得很温和，但当他把别人的功劳揽到自己身上时，那种伪善就很明显了。"},{"en":"Don’t be a pecksniff—if you disagree, say it honestly.","zh":"别装正人君子——如果你不同意，就坦诚说出来。"}]}],"synonyms":["hypocrite","sanctimonious person","moralizer","pharisee"],"phonetic":"/ˈpɛkˌsnɪf/","extraExplanation":["“Pecksniff”来自查尔斯·狄更斯（Charles Dickens）小说《马丁·楚泽威特》（Martin Chuzzlewit, 1843–44）中的角色 Seth Pecksniff。这个人物以“满口道德、内里自私”著称，因此他的姓后来变成英语里表示“伪善者”的通用词。","在文学与评论中，相关形容词常写作“Pecksniffian”，意思是“伪善的、道学气的”。"]}
{"word":"pecksniffery","summary":{"en":"Pecksniffery means hypocritical, self-righteous moralizing—showing off “good morals” to look superior.","zh":"Pecksniffery 指假道学与道貌岸然的说教：用“装正经/装道德”来显得自己更高尚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"self-righteous, showy morality; hypocritical moralizing (often to impress others)","zh":"假道学；道貌岸然的说教与伪善（常为博取他人好感）"},"examples":[{"en":"People were tired of the pecksniffery in his speeches about “family values.”","zh":"人们厌倦了他在演讲中关于“家庭价值观”的那种假道学式说教。"},{"en":"Her apology sounded like pecksniffery rather than real regret.","zh":"她的道歉听起来更像是道貌岸然的姿态，而不是真心的懊悔。"}]}],"synonyms":["hypocrisy","sanctimony","moralizing","moral posturing","smugness"],"phonetic":"/ˈpɛkˌsnɪfəri/","extraExplanation":["“pecksniffery”来自“Pecksniff”，这是狄更斯小说《马丁·翟述伟特》（Martin Chuzzlewit）里的角色名字，以虚伪、装正经、爱说教著称；因此这个词常带有讽刺意味，用来批评“表演式道德”和“道德优越感”。","这个词偏文学/评论用语，不算日常高频。更常见的近义表达有 hypocrisy（虚伪）, sanctimony（伪善的虔诚/道貌岸然）, moral posturing（道德作秀）。"]}
{"word":"pecksniffian","summary":{"en":"Pecksniffian means hypocritically moralistic—acting self-righteous to impress others while being insincere.","zh":"Pecksniffian 指“伪善的、道貌岸然的”：表面道德感很强、实则不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hypocritically moralistic: pretending to be very religious or virtuous in order to look good, while actually being insincere.","zh":"伪善的道德说教式：表面装得很虔诚或很有道德来博取好感，实际并不真诚。"},"examples":[{"en":"His pecksniffian speeches about “family values” sounded fake to everyone who knew his behavior.","zh":"他那些关于“家庭价值”的伪善说教式演讲，在了解他为人的人听来都很虚伪。"},{"en":"She was tired of pecksniffian coworkers who criticized others but broke the rules themselves.","zh":"她厌倦了那些伪善的同事：一边指责别人，一边自己却违规。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who acts in a pecksniffian way; a self-righteous hypocrite.","zh":"伪善者；道貌岸然的人。"},"examples":[{"en":"Don’t be a pecksniffian—apologize and admit you were wrong.","zh":"别当伪君子了——道歉并承认你错了。"}]}],"synonyms":["hypocritical","sanctimonious","self-righteous","holier-than-thou","smug"],"phonetic":"/ˌpɛkˈsnɪfiən/","extraExplanation":["该词源自狄更斯（Charles Dickens）的小说《马丁·朱述尔维特》（Martin Chuzzlewit）中的人物 Seth Pecksniff。他表面慈善、满口道德，实际自私虚伪；因此“Pecksniff”逐渐变成“伪善者”的代名词，“pecksniffian”就是“像 Pecksniff 那样伪善”的意思。","语体上偏文学/评论用语，带明显贬义；常用于批评“道德高地式”的指责、表面正义但动机不纯的言行。"]}
{"word":"pecksniffianism","summary":{"en":"Pecksniffianism means hypocritical, showy moralizing—pretending to be virtuous while being insincere.","zh":"Pecksniffianism 指“装出很有道德、其实虚伪”的假道学/伪善。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or practice of showing false moral seriousness; hypocritical self-righteousness (often with a “holier-than-thou” tone).","zh":"伪善、假道学：表面上装作很有道德、很正派，实际上虚伪自义（常带“道德优越感”的语气）。"},"examples":[{"en":"His speech about “family values” sounded like pure pecksniffianism.","zh":"他那番关于“家庭价值观”的演讲听起来简直就是十足的伪善假道学。"},{"en":"The article criticizes the company’s pecksniffianism—promising ethics while exploiting workers.","zh":"文章批评这家公司伪善：一边高喊道德，一边剥削工人。"}]}],"synonyms":["hypocrisy","sanctimony","piousness (often negative)","moralizing","pharisaism"],"phonetic":"/ˌpɛkˈsnɪfiəˌnɪzəm/","extraExplanation":["该词源自狄更斯小说《马丁·瞿述伟特》（Martin Chuzzlewit）中的人物 Seth Pecksniff（塞思·佩克斯尼夫）。他以“道貌岸然、满口道德”著称，但言行虚伪，因此衍生出 pecksniffian（形容词/名词）与 pecksniffianism（名词）。","语体色彩：偏文学/批评用语，带明显贬义，常用于评论政治、媒体、公关或社交场合中“装正经、装高尚”的行为。"]}
{"word":"pecksniffism","summary":{"en":"Pecksniffism means self-righteous moral hypocrisy—pretending to be virtuous to impress others.","zh":"pecksniffism 指自以为道德高尚的伪善：用“装正义、讲道德”来博取好感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Self-righteous hypocrisy: showing (or pretending to have) high moral standards in order to look good, while being insincere or doing the opposite.","zh":"伪善的道德说教（假装道德高尚、满口仁义来博取好感或名声，但其实虚伪不真诚，甚至言行不一）。"},"examples":[{"en":"People criticized the company’s pecksniffism when it advertised “green values” but kept polluting the river.","zh":"当这家公司一边打着“环保价值观”的广告一边继续污染河流时，人们批评这就是典型的 pecksniffism（伪善道德）。"},{"en":"Her speech about “family values” felt like pecksniffism, given how she treated her own relatives.","zh":"考虑到她对待亲戚的方式，她那番“家庭价值观”的演讲听起来很像 pecksniffism（伪善说教）。"}]}],"synonyms":["hypocrisy","sanctimoniousness","moralizing","self-righteousness","moral posturing"],"phonetic":"/ˈpɛkˌsnɪˌfɪzəm/","extraExplanation":["这个词来自英国作家狄更斯（Charles Dickens）小说《马丁·翟述伟特》（Martin Chuzzlewit）中的人物 Seth Pecksniff：他表面上道貌岸然、动不动就讲道德，实际上虚伪自私。后来人们用 pecksniffism 来讽刺这种“装正人君子”的行为。","语体上偏正式、带强烈贬义，常用于评论政治人物、公众人物或机构的“道德表演/道德秀”（moral posturing）。"]}
{"word":"pecky","summary":{"en":"“Pecky” usually describes wood or surfaces that have many small holes or pits.","zh":"“Pecky”通常形容木材或表面布满许多小孔或凹点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of wood, bark, or a surface) marked with many small holes, pits, or scars, often caused by insects or natural defects.","zh":"（指木材、树皮或表面）布满许多小孔、凹点或疤痕的，常因昆虫蛀蚀或天然缺陷造成。"},"examples":[{"en":"The table is made from pecky cypress, so it has lots of tiny holes and grooves.","zh":"这张桌子用的是“pecky cypress（虫蛀纹柏木）”，所以表面有很多细小的孔洞和纹沟。"},{"en":"Pecky wood can look rustic and decorative, even though it isn’t perfectly smooth.","zh":"有孔洞的木材看起来很乡村、很有装饰感，尽管它并不光滑。"}]}],"synonyms":["pitted","holey","worm-eaten","scarred","marked"],"phonetic":"/ˈpɛki/","extraExplanation":["“pecky”来自“peck（啄）”，想象鸟啄出来的小洞；在木材领域它常指虫蛀或天然形成的细小孔洞与纹理。","在北美家居与木材市场里常见搭配是“pecky cypress”，这种木材因独特孔洞纹理而被用来营造复古/乡村风。"]}
{"word":"pecopteris","summary":{"en":"Pecopteris is an extinct fossil “fern” genus best known from Carboniferous frond fossils, often found in coal-bearing rocks.","zh":"Pecopteris 是一种已灭绝的化石“蕨类”形属，主要以石炭纪煤系地层中常见的叶片（羽状叶）化石而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus (form genus) of fern-like fossil plants common in the Carboniferous period, often known from distinctive fronds found in coal measures","zh":"（古植物）一种已灭绝的化石蕨类（形属），在石炭纪很常见，常见于煤系地层中，以其特征性的叶状羽片化石为人所知"},"examples":[{"en":"Pecopteris fossils are often found in Carboniferous coal deposits.","zh":"Pecopteris（佩科普特里斯）化石常见于石炭纪的煤层沉积中。"},{"en":"The museum display included a Pecopteris frond impression on shale.","zh":"博物馆展柜里有一块页岩上的 Pecopteris 叶片印痕化石。"},{"en":"In paleobotany class, we compared Pecopteris with other fossil ferns.","zh":"在古植物学课上，我们把 Pecopteris 和其他蕨类化石作了比较。"}]}],"synonyms":["fossil fern (general)","Carboniferous fern (general)"],"phonetic":"/pɪˈkɑːptərɪs/","extraExplanation":["“Pecopteris”在古植物学里常被当作“形属”（form genus）使用：也就是说，它主要根据叶片（羽状叶/叶痕）的外形来命名与归类，而不一定代表单一、明确的整株植物谱系。","词源常解释为来自希腊语：pecten（“梳子”，指像梳齿一样整齐排列的羽片）+ pteris（“蕨”），用来形容其叶片结构。"]}
{"word":"pecopteroid","summary":{"en":"An adjective used in paleobotany meaning “Pecopteris-like” (fern-frond-shaped, regularly pinnate).","zh":"古植物学用形容词，意为“类似 *Pecopteris* 的（蕨叶状、规则羽状的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Paleobotany) Resembling a pecopterid fern frond—especially having a feather-like, regularly pinnate pattern like the fossil genus *Pecopteris*.","zh":"（古植物学）似羊齿类化石属 *Pecopteris* 的叶（羽状叶）形态；常指呈羽毛状、规则羽状分裂的叶片结构。"},"examples":[{"en":"The shale bed contains abundant pecopteroid fronds preserved as dark impressions.","zh":"这层页岩中含有大量保存为深色印痕的拟羊齿状（pecopteroid）叶片。"},{"en":"Researchers described the plant as pecopteroid because its leaflets are arranged in neat, parallel rows.","zh":"研究者将该植物描述为拟羊齿状，因为它的小叶整齐地排列成平行的行列。"}]}],"synonyms":["Pecopteris-like","pecopterid-like","fern-like"],"phonetic":"ˌpiːkəpˈtɔrɔɪd","extraExplanation":["该词由 *Pecopteris*（一种常见的古生代蕨类/蕨状植物化石属名）+ 后缀 *-oid*（“类似……的”）构成，因此多用于形态学描述，强调“外形像”而不一定表示亲缘关系。","在论文或化石图版说明中，*pecopteroid* 常用来概括“羽状、像蕨叶的叶片形态”（frond architecture），便于在无法精确归属到属种时先进行形态分类描述。"]}
{"word":"pecora","summary":{"en":"“Pecora” is an Italian word meaning “sheep” (often a ewe), and it can also describe a person who blindly follows others.","zh":"“pecora”是意大利语，意思是“羊”（常指母羊）；也可比喻盲从、缺乏主见的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a sheep, especially a female sheep (a ewe).","zh":"（意大利语）羊；尤指母羊（ewe）。"},"examples":[{"en":"In Italian, “pecora” means “sheep.”","zh":"在意大利语里，“pecora”意思是“羊”。"},{"en":"The shepherd took the pecora back to the flock.","zh":"牧羊人把那只母羊带回羊群。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, often informal) a person seen as timid or too willing to follow others; “sheeplike.”","zh":"（比喻义，常为非正式用法）指懦弱、盲从的人；“像羊一样跟风的人”。"},"examples":[{"en":"He joked that people who copy every trend are pecore.","zh":"他开玩笑说，那些什么潮流都照抄的人就是“pecore”（盲从者）。"},{"en":"Don’t be a pecora—think for yourself.","zh":"别当“pecora”（盲从者）——要独立思考。"}]}],"synonyms":["sheep","ewe","sheeple (informal)"],"phonetic":"/pəˈkɔrə/","extraExplanation":["“pecora”是意大利语常用词，字面就是“羊/母羊”。在美食语境里也常被用来帮助理解相关词源：例如奶酪名“pecorino”来自“pecora”，意思是“羊奶（制的）”。","比喻义与英语里“sheep / sheeple”的文化联想相近：强调温顺、容易被带着走。该用法在意大利语里偏口语，可能带一点轻蔑或调侃语气，使用时注意场合与语气。"]}
{"word":"pecorino","summary":{"en":"Pecorino is a hard Italian sheep’s-milk cheese, often salty and used for grating or slicing.","zh":"Pecorino 是意大利羊奶硬质奶酪，常偏咸，可刨丝或切片食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard Italian cheese made from sheep’s milk, often salty and used for grating or eating in slices.","zh":"佩科里诺（羊奶酪）：一种意大利硬质奶酪，由羊奶制成，通常偏咸，可刨丝或切片食用。"},"examples":[{"en":"I grated pecorino over the pasta for a sharper, saltier flavor.","zh":"我在意面上刨了些佩科里诺，让味道更浓更咸香。"},{"en":"This salad tastes great with shaved pecorino and a little olive oil.","zh":"这道沙拉加点刨薄的佩科里诺，再淋一点橄榄油就很好吃。"},{"en":"Pecorino is common in Roman dishes like cacio e pepe.","zh":"佩科里诺在罗马菜里很常见，比如经典的黑胡椒奶酪意面（cacio e pepe）。"}]}],"synonyms":["Pecorino Romano","sheep’s-milk cheese"],"phonetic":"/ˌpɛkəˈriːnoʊ/","extraExplanation":["“Pecorino”来自意大利语“pecora”（母羊），所以它强调“羊奶”这一点。常见种类包括 Pecorino Romano（更咸、常用来刨丝）和 Pecorino Toscano（相对温和、可切片）。","在英文菜单上你可能会看到“pecorino cheese”或直接写“pecorino”。如果你不吃羊奶制品，可询问是否能用 Parmesan（帕玛森/帕尔马干酪，通常是牛奶制）替换，但风味会更温和、咸度也可能不同。"]}
{"word":"pecos","summary":{"en":"Pecos is a Southwest U.S. place name, especially the Pecos River and related locations (and historically, Pecos Pueblo).","zh":"Pecos 是美国西南部的地名，尤指佩科斯河及相关地点（历史上也指佩科斯普韦布洛遗址）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used for several places in the U.S. Southwest, especially the Pecos River and the town of Pecos in Texas; it often evokes the landscape and culture of New Mexico and West Texas.","zh":"（专有名词）美国西南部多个地名的名称，尤指佩科斯河（Pecos River）以及得克萨斯州的佩科斯镇（Pecos, Texas）；常让人联想到新墨西哥州与西得州的自然风貌与文化。"},"examples":[{"en":"They went camping near the Pecos River in New Mexico.","zh":"他们去新墨西哥州的佩科斯河附近露营。"},{"en":"Pecos, Texas is known for its rodeo traditions.","zh":"得克萨斯州的佩科斯以牛仔竞技（rodeo）传统闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) Pecos Pueblo (also called Cicuye), a historic Native American pueblo site near Santa Fe, New Mexico, often discussed in the context of Spanish colonial history and the Southwest.","zh":"（历史）佩科斯普韦布洛（Pecos Pueblo，也称 Cicuye），位于新墨西哥州圣菲附近的美洲原住民普韦布洛遗址，常在西班牙殖民史与美国西南史的语境中出现。"},"examples":[{"en":"We visited the Pecos Pueblo ruins on a trip to Santa Fe.","zh":"我们去圣菲旅行时参观了佩科斯普韦布洛遗址。"},{"en":"The museum exhibit explained the history of Pecos Pueblo and its trade networks.","zh":"博物馆展览介绍了佩科斯普韦布洛的历史及其贸易网络。"}]}],"synonyms":["Pecos River","Pecos Pueblo","Pecos, Texas"],"phonetic":"/ˈpeɪkəs/","extraExplanation":["“Pecos”在英语里通常是专名（地名/河名/遗址名），写作首字母大写。作河名时常见搭配：the Pecos River。","词源与美洲原住民语言有关；佩科斯普韦布洛在历史上也以“Cicuye”出现，与西班牙殖民时期的新墨西哥地区历史密切相关。"]}
{"word":"pect","summary":{"en":"“pect” is a Latin root meaning “look/see,” usually appearing inside words (often as -pect- or -spect-).","zh":"“pect” 是表示“看/观察”的拉丁语词根，通常以 -pect- 或 -spect- 的形式出现在单词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin root (not usually a standalone English word) meaning “to look” or “to see,” found in many English words.","zh":"一个拉丁语词根（通常不单独作为英语单词使用），意思是“看/观察”，常见于许多英语单词中。"},"examples":[{"en":"inspect = in- (“into”) + -spect- (“look”) → to look into something carefully.","zh":"inspect = in-（“向内”）+ -spect-（“看”）→ “仔细检查”。"},{"en":"suspect = sub- (“under”) + -spect- (“look”) → to look at someone/something with doubt.","zh":"suspect = sub-（“在下/隐含”）+ -spect-（“看”）→ “怀疑；疑犯/嫌疑人”。"},{"en":"spectator = -spect- (“look”) + -ator (“person”) → a person who watches.","zh":"spectator = -spect-（“看”）+ -ator（“人”）→ “观众”。"}]},{"partOfSpeech":"other","definition":{"en":"A spelling variant you may see inside words as -pect-, closely related to -spect- (same root idea: “look/see”).","zh":"你可能在一些单词内部看到的拼写形式 -pect-，与 -spect- 关系很近（同源、核心意思同为“看/观察”）。"},"examples":[{"en":"expect originally meant “to look out for” → now commonly “to think something will happen.”","zh":"expect 原义接近“盼望/等待（将要看到）”，现代常用义是“期待；认为会发生”。"},{"en":"respect is related to “look back/again” → to treat someone with honor and care.","zh":"respect 与“回头再看/重新看待”有关 → “尊重；敬重”。"},{"en":"perspective relates to “looking through” → a way of seeing or thinking about something.","zh":"perspective 与“透过……去看”有关 → “观点；视角”。"}]}],"synonyms":["-spect- (related root form)","spec- (related root form)"],"phonetic":"/pɛkt/","extraExplanation":["“-pect/-spect-”来自拉丁语 specere（看、观察）。英语里常见两种形态：-spect-（更直观，如 inspect, spectator, spectacle）和 -pect-（常出现在 expect, respect 等词里）。","学习这个词根时，可以把它当作“看”的线索：遇到生词时，先抓住词根 -pect/-spect-，再结合前缀（如 in-, sub-, re-, per-）来猜意思。"]}
{"word":"pectase","summary":{"en":"Pectase is an enzyme used to break down pectin, especially to clarify fruit juice or wine.","zh":"Pectase（果胶酶）是一种分解果胶的酶，常用于澄清果汁或葡萄酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that breaks down pectin (a plant substance that helps make fruit firm and jelly set), often used to clarify fruit juice or wine","zh":"果胶酶；一种分解果胶（让水果更“硬”、也让果酱凝固的植物成分）的酶，常用于澄清果汁或葡萄酒"},"examples":[{"en":"Pectase is added to apple juice to help remove cloudiness.","zh":"在苹果汁中加入果胶酶可以帮助去除浑浊。"},{"en":"The winemaker used pectase to improve clarity and filtration.","zh":"酿酒师使用果胶酶来提高澄清度并改善过滤效果。"}]}],"synonyms":["pectinase","pectolytic enzyme"],"phonetic":"/ˈpɛkˌteɪs/","extraExplanation":["“pectase”在实际英语中不如“pectinase”常见；很多产品标签、说明书会直接写 pectinase（果胶酶的统称）。","果胶存在于水果细胞壁中，会让果汁更黏、更浑；加入果胶酶后，果胶被分解，更容易沉淀或过滤，因此饮品看起来更清澈。","学习时可把它与 -ase 结尾的“酶”类单词放在一起记：如 lactase（乳糖酶）、amylase（淀粉酶）。"]}
{"word":"pectases","summary":{"en":"Pectases are enzymes that break down pectin in plants, commonly used to clarify and extract fruit juices.","zh":"pectases 指分解植物中果胶的酶，常用于果汁澄清和提高出汁率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Enzymes that break down pectin (a jelly-like substance in plant cell walls), often used to help extract and clarify fruit juice or wine.","zh":"分解果胶（植物细胞壁中的胶状物质）的酶，常用于帮助榨汁、澄清果汁或葡萄酒。"},"examples":[{"en":"Pectases are added during juice making to make the liquid clearer.","zh":"在制作果汁时会加入果胶酶，使液体更澄清。"},{"en":"Some producers use pectases to improve the yield of apple juice.","zh":"一些生产商使用果胶酶来提高苹果汁的出汁率。"}]}],"synonyms":["pectinases","pectinase","pectinolytic enzymes"],"phonetic":"ˈpɛkˌteɪsɪz","extraExplanation":["“pectases”是复数形式；单数是“pectase”。在食品与发酵领域，更常见、更通用的说法是“pectinase / pectinases（果胶酶）”，很多时候两者在实际使用中指代同一类分解果胶的酶。"]}
{"word":"pectate","summary":{"en":"Pectate is a chemistry term meaning a salt or ester of pectic acid, related to plant pectin.","zh":"Pectate 是化学术语，指果胶酸的盐或酯，和植物中的果胶相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of pectic acid (a substance related to pectin found in plant cell walls), used especially in chemistry and food science.","zh":"（化学）果胶酸盐；果胶酸酯（果胶酸的盐或酯，和植物细胞壁中的果胶相关，常见于化学与食品科学语境）。"},"examples":[{"en":"Calcium pectate helps strengthen plant cell walls.","zh":"果胶酸钙有助于增强植物细胞壁的强度。"},{"en":"In the lab, pectates can form when pectic acid reacts with metal ions.","zh":"在实验室里，果胶酸与金属离子反应时可能生成果胶酸盐。"}]}],"synonyms":["pectic acid salt","pectic acid ester"],"phonetic":"/ˈpɛk.teɪt/","extraExplanation":["“pectate”比较偏专业，日常英语里不常用；更常见的相关词是“pectin（果胶）”。在食品中，果胶常用于做果酱/果冻的凝胶结构，而“pectate”更多出现在化学、生物或植物学描述里（例如细胞壁的结构成分）。","词根提示：pect- 与 “pectin/pectic” 同源，和植物中的果胶类物质有关。"]}
{"word":"pectates","summary":{"en":"“Spectate” means to watch an event without participating.","zh":"“spectate”指观看某项活动/比赛而不参与。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to watch an event (especially sports) without taking part; to be a spectator","zh":"（尤指体育比赛等）观看而不参与；当观众"},"examples":[{"en":"Thousands of fans spectated from the stands.","zh":"成千上万的球迷在看台上观赛。"},{"en":"We spectated the marathon and cheered for the runners.","zh":"我们观看了马拉松比赛，并为选手加油。"},{"en":"She prefers to spectate rather than compete.","zh":"她更喜欢当观众，而不是参赛。"}]}],"synonyms":["watch","observe","attend","view"],"phonetic":"ˈspɛkˌteɪt","extraExplanation":["“pectates”通常是把“spectates”（spectate 的第三人称单数）少写了开头的 s。正确拼写：spectates。","“spectate”在英语里比较常用于体育语境；更口语、更常见的表达是“watch”（看）或“go to see”（去看）。"]}
{"word":"pecten","summary":{"en":"Pecten means a comb-like structure; in anatomy it often refers to the bird eye’s pecten oculi, and in taxonomy it can name comb-shaped organisms like scallops.","zh":"Pecten 指“梳状结构”；在解剖学中常指鸟类眼内的眼梳（pecten oculi），在分类学中也可用于命名梳状外形的生物（如扇贝属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A comb-like structure in the body; most commonly, a folded “pecten oculi” in a bird’s eye that helps nourish the retina.","zh":"（解剖）梳状结构；最常见指鸟类眼内的“眼梳（pecten oculi）”，为视网膜提供营养支持。"},"examples":[{"en":"Many birds have a pecten that supplies nutrients to the retina.","zh":"许多鸟类都有眼梳（pecten），用来为视网膜提供营养。"},{"en":"The researcher examined the pecten oculi under a microscope.","zh":"研究人员在显微镜下观察了鸟类的眼梳（pecten oculi）。"}]},{"partOfSpeech":"n.","definition":{"en":"A comb or comb-like part; used in scientific naming for things shaped like a comb (for example, related to scallops).","zh":"梳子或梳状部位；也常用于科学命名中，指“像梳子一样”的结构（例如与扇贝等形状相关的名称）。"},"examples":[{"en":"The genus name Pecten is used for scallops.","zh":"Pecten 这个属名常用于指扇贝。"},{"en":"In biology, Latin words like pecten often describe a shape.","zh":"在生物学中，像 pecten 这样的拉丁词常用来描述形状。"}]}],"synonyms":["comb (general meaning)","comb-like ridge","(taxonomy) scallop (common name for Pecten species)"],"phonetic":"/ˈpɛk.tən/","extraExplanation":["“pecten”来自拉丁语，原意是“梳子”。因此它在解剖学和生物分类学里常用来表示“梳状、齿状、像梳子一样的结构”。","常见搭配：pecten oculi（鸟类眼梳）。在贝类分类中，Pecten 也是“扇贝属”的学名。"]}
{"word":"pectens","summary":{"en":"“Pectens” is the plural of “pecten,” meaning either scallops/scallop shells or a comb-like anatomical structure (especially in birds’ eyes).","zh":"“Pectens”是“pecten”的复数，常指扇贝/扇贝壳，或解剖学上的梳状结构（尤其是鸟眼内的梳状体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pecten: a scallop or scallop shell (common in biology and food contexts).","zh":"pecten 的复数：扇贝；（也指）扇贝的贝壳（常见于生物学与饮食语境）。"},"examples":[{"en":"Scientists compared different pectens to study shell shape.","zh":"科学家比较了不同的扇贝（pectens），来研究贝壳形状。"},{"en":"The museum display included fossil pectens from ancient seas.","zh":"博物馆展柜里有来自远古海洋的扇贝化石（pectens）。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of pecten: a comb-like structure in anatomy (especially the pecten oculi in a bird’s eye).","zh":"pecten 的复数：解剖学中的“梳状结构”（尤指鸟类眼内的梳状体 pecten oculi）。"},"examples":[{"en":"Birds have pectens that help nourish the retina.","zh":"鸟类有梳状体（pectens），有助于为视网膜提供营养。"},{"en":"The textbook described the pectens found in avian eyes.","zh":"教材描述了鸟类眼睛中的梳状体（pectens）。"}]}],"synonyms":["scallops","scallop shells"],"phonetic":"/ˈpɛk.tənz/","extraExplanation":["“Pecten”来自拉丁语，意思是“梳子/梳状物”。因此在解剖学里常用来命名“像梳子一样的结构”。","在生物分类学中，Pecten 也是扇贝的一类（属名/相关名称），所以你会在论文、化石记录或海洋生物介绍里看到复数 pectens。"]}
{"word":"pectic","summary":{"en":"Pectic means “related to pectin,” often used in chemistry, plant science, or food science.","zh":"pectic 意为“与果胶有关的”，常用于化学、植物科学或食品科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pectin (a natural substance in fruits that helps form gels), especially in chemistry or food science.","zh":"与果胶有关的；（尤用于化学或食品科学中）指果胶及其性质的。"},"examples":[{"en":"Pectic substances in apples help jam set when you cook it.","zh":"苹果中的果胶类物质有助于果酱在熬煮时凝固。"},{"en":"The lab measured the pectic content of the fruit peel.","zh":"实验室测量了果皮中的果胶含量。"}]},{"partOfSpeech":"adj.","definition":{"en":"In chemistry, describing acids or compounds derived from pectin (such as pectic acid).","zh":"（化学）描述由果胶衍生的酸或化合物的，如“果胶酸”。"},"examples":[{"en":"Pectic acid can form when pectin breaks down under certain conditions.","zh":"在某些条件下果胶分解时可能形成果胶酸。"},{"en":"The paper discusses pectic polymers found in plant cell walls.","zh":"这篇论文讨论了植物细胞壁中的果胶聚合物。"}]}],"synonyms":["pectin-related","pectinaceous","pectinal"],"phonetic":"/ˈpɛktɪk/","extraExplanation":["“pectic”多见于科研、食品加工或配方说明中，日常英语里更常说“pectin (果胶)”或“pectin-related”。","果胶存在于苹果、柑橘、莓果等水果中，是制作果酱/果冻能“凝固成型”的关键成分之一。"]}
{"word":"pectin","summary":{"en":"Pectin is a natural fruit substance used to thicken and set jams and jellies; it is also a soluble fiber.","zh":"Pectin（果胶）是水果中的天然成分，用于让果酱/果冻变稠并凝固，也是一种可溶性膳食纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural substance found in many fruits that helps mixtures thicken and set into a gel, especially in jams and jellies.","zh":"一种存在于许多水果中的天然物质，可使混合物变稠并凝固成果冻状，常用于果酱和果冻。"},"examples":[{"en":"This recipe uses pectin to help the strawberry jam set firmly.","zh":"这个配方用果胶来帮助草莓果酱更好地凝固。"},{"en":"Apples and citrus peels are high in pectin.","zh":"苹果和柑橘类果皮的果胶含量很高。"},{"en":"If your jelly is runny, you may need more pectin or longer cooking time.","zh":"如果你的果冻太稀，可能需要更多果胶或更长的熬煮时间。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of soluble fiber (a complex carbohydrate) that can support digestion and may help manage cholesterol levels.","zh":"一种可溶性膳食纤维（复杂碳水化合物），有助于消化，也可能帮助调节胆固醇水平。"},"examples":[{"en":"Some people take apple pectin as a dietary supplement for extra fiber.","zh":"有些人会服用苹果果胶作为膳食补充剂来增加纤维摄入。"},{"en":"Foods rich in pectin can help you feel full longer.","zh":"富含果胶的食物可能让你更有饱腹感。"}]}],"synonyms":["fruit gelling agent","soluble fiber"],"phonetic":"/ˈpɛktɪn/","extraExplanation":["“果胶”在家常烹饪里最常见的场景是做果酱/果冻：加热时果胶与糖和酸（如柠檬汁）更容易形成凝胶结构，所以配方里常会同时出现“sugar + lemon juice + pectin”。","日常英文里常见搭配有：pectin powder（果胶粉）、liquid pectin（液体果胶）、low-sugar pectin（低糖果胶，适合少糖果酱）。"]}
{"word":"pectinacea","summary":{"en":"Pectinacea is a scientific name for a taxonomic group of scallop-related bivalves; its exact rank and usage vary by classification.","zh":"Pectinacea 是与扇贝相关的双壳类动物的一个分类群名称；其具体等级与用法会因分类体系而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (taxonomic) name used for a group of bivalve mollusks related to scallops (family Pectinidae and close relatives), depending on the classification system","zh":"（分类学用语）指与扇贝相关的一类双壳类软体动物的分类群名称（常与扇贝科 Pectinidae 及其近缘类群有关，具体范围因分类体系而异）"},"examples":[{"en":"In some older classifications, Pectinacea was used for scallops and their close relatives.","zh":"在一些较早的分类体系中，Pectinacea 用来指扇贝及其近缘类群。"},{"en":"Modern sources may place these animals under different ranks, so the name Pectinacea is not always used the same way.","zh":"在现代资料中，这些动物可能被放在不同的分类等级下，因此 Pectinacea 的用法并不总是一致。"}]}],"synonyms":["Pectinidae (scallops)","scallops"],"phonetic":"ˌpɛk.tɪˈneɪ.ʃə","extraExplanation":["Pectinacea 主要出现在动物学/古生物学文献中，属于“拉丁化的分类名”。不同作者可能把它当作“目、超科或其他等级”的名称使用，所以查阅时要看具体论文或数据库采用的体系。","词根 pectin- 来自拉丁语 pecten（“梳子；扇贝壳”），因为扇贝壳常有像梳齿一样的放射肋；-acea 常见于分类名后缀，表示“某某类/某某群”。"]}
{"word":"pectinacean","summary":{"en":"Pectinacean means “related to scallops (Pectinacea)” and can also mean a scallop-like bivalve.","zh":"Pectinacean 指“与扇贝（Pectinacea）有关的”，也可指扇贝类的双壳贝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Relating to scallops or to the bivalve group Pectinacea; scallop-like.","zh":"（动物学）与扇贝或扇贝类群（Pectinacea）有关的；扇贝状的。"},"examples":[{"en":"Scallops are pectinacean bivalves found in many coastal waters.","zh":"扇贝是扇贝类（pectinacean）的双壳贝，分布在许多沿海海域。"},{"en":"The lab compared pectinacean shells to oysters to study differences in growth rings.","zh":"实验室将扇贝类贝壳与牡蛎作比较，以研究生长纹的差异。"}]},{"partOfSpeech":"n.","definition":{"en":"A scallop or a related bivalve mollusk in the group Pectinacea.","zh":"扇贝；或扇贝类群（Pectinacea）中的相关双壳贝。"},"examples":[{"en":"Fossil beds here contain many pectinaceans from the Miocene period.","zh":"这里的化石层含有许多中新世时期的扇贝类化石。"},{"en":"The guide pointed out a small pectinacean attached to the rock.","zh":"导游指着一只附着在岩石上的小型扇贝类动物。"}]}],"synonyms":["scallop-related","Pectinacea (related)"],"phonetic":"/ˌpɛk.tɪˈneɪ.ʃən/","extraExplanation":["“pectinacean”较少见，更多时候你会在学术写作中看到“pectinacean bivalves（扇贝类双壳贝）”或直接用“scallop（扇贝）”。","词源上与拉丁语 pecten（“梳子”）有关；扇贝壳的放射状肋纹看起来像梳齿，因此得名。"]}
{"word":"pectinaceous","summary":{"en":"Pectinaceous means “related to pectin” or “having pectin-like, gelling qualities.”","zh":"pectinaceous 指“与果胶有关的”或“具有果胶凝胶特性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pectin, or having the qualities of pectin (a plant substance that helps fruits gel and is used to thicken jams and jellies).","zh":"与果胶有关的；具有果胶特性的（果胶是植物中的一种物质，能让水果形成凝胶，常用于增稠果酱和果冻）。"},"examples":[{"en":"Apple peels are especially pectinaceous, which is why they help jam set.","zh":"苹果皮特别富含果胶（很“果胶质”），所以能帮助果酱凝固。"},{"en":"The sauce became thick and slightly gel-like because the fruit was pectinaceous.","zh":"因为水果果胶含量高（呈果胶质），酱汁变得浓稠并略带凝胶感。"}]}],"synonyms":["pectic","pectin-rich","gel-forming"],"phonetic":"/ˌpɛk.tɪˈneɪ.ʃəs/","extraExplanation":["“pectinaceous”多见于食品科学、植物学或较正式的写作中，日常英语更常说“high in pectin（果胶含量高）”或“pectin-rich”。","词根来自“pectin（果胶）”，后缀“-aceous”常表示“……性质的/……组成的”，如“vitreous（玻璃质的）”。"]}
{"word":"pectinal","summary":{"en":"Pectinal means “comb-like” or “related to a pecten,” especially in biological/anatomical descriptions; it can also refer specifically to scorpion pectines.","zh":"pectinal 表示“呈梳齿状/与栉（pecten）有关”，常用于生物学或解剖学；也可特指与蝎子的栉器有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pecten (“comb”) or having a comb-like structure (often used in biology/anatomy).","zh":"与“梳/栉”（pecten）有关的；呈梳齿状、栉状的（常用于生物学/解剖学）。"},"examples":[{"en":"Some insects have pectinal antennae, with a comb-like shape.","zh":"有些昆虫有栉状触角，形状像梳子一样。"},{"en":"Under the microscope, the edge of the structure looks pectinal.","zh":"在显微镜下，这个结构的边缘看起来呈栉状。"}]},{"partOfSpeech":"adj.","definition":{"en":"Specifically, relating to the sensory organs on the underside of a scorpion (called pectines).","zh":"（特指）与蝎子腹面的一对感觉器官“栉器”（pectines）有关的。"},"examples":[{"en":"Scorpions use pectinal organs to sense the ground and find mates.","zh":"蝎子用栉器感知地面信息并寻找配偶。"},{"en":"The researcher examined the scorpion’s pectinal structures.","zh":"研究人员检查了这只蝎子的栉器结构。"}]}],"synonyms":["comb-like","pectinate","comblike","pecten-related"],"phonetic":"/ˈpɛktənəl/","extraExplanation":["“pectinal”来自拉丁语 pecten，意思是“梳子”。因此它常用来描述“像梳齿一样排列”的结构。","在动物学里它经常出现在对蝎子“栉器（pectines）”的描述中；在其他生物结构（如某些触角、羽状/栉状边缘）里也会用到。","日常英语里很少用到这个词，多见于学术写作、动物学或解剖学语境。"]}
{"word":"pectinase","summary":{"en":"Pectinase is an enzyme used to break down pectin in plants, often to help extract and clarify fruit juices.","zh":"果胶酶是一种分解植物中果胶的酶，常用于帮助水果出汁并使果汁更澄清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down pectin (a substance in plant cell walls), helping to soften plant tissue and release juice.","zh":"果胶酶：一种分解果胶（植物细胞壁中的物质）的酶，可帮助软化植物组织并促进出汁。"},"examples":[{"en":"Pectinase is used in apple juice production to increase juice yield and improve clarity.","zh":"果胶酶常用于苹果汁生产，以提高出汁率并改善澄清度。"},{"en":"Adding pectinase can reduce cloudiness in fruit beverages.","zh":"加入果胶酶可以减少果味饮料的浑浊。"}]}],"synonyms":["pectolytic enzyme"],"phonetic":"/ˈpɛk.təˌneɪs/","extraExplanation":["词源提示：pectinase = pectin（果胶）+ -ase（常见的“酶”后缀，如 lactase 乳糖酶、amylase 淀粉酶）。看到 -ase，通常可以推断它是某种酶。","常见使用场景：食品工业（果汁、葡萄酒）、纺织与造纸（处理植物纤维）、以及实验室中对植物细胞壁相关成分的研究。不同来源的果胶酶可能含有多种活性（如果胶裂解酶等），但日常语境下通常统称为 pectinase。"]}
{"word":"pectinate","summary":{"en":"Pectinate means “comb-like,” and more rarely it can mean “to comb/arrange like a comb,” especially in scientific descriptions.","zh":"pectinate 主要表示“梳状的（像梳子齿一样排列）”，较少见时也可作动词表示“梳理/使呈梳状排列”，多见于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comb-like; having parts arranged like the teeth of a comb (often used in biology/botany).","zh":"梳状的；像梳子齿一样排列的（常用于生物学/植物学）。"},"examples":[{"en":"Many birds have pectinate claws that help them groom their feathers.","zh":"许多鸟类有梳状的爪子，能帮助它们整理羽毛。"},{"en":"Under the microscope, the antenna looked pectinate, with many fine side branches.","zh":"在显微镜下，这根触角呈梳状，带有许多细小的侧枝。"}]},{"partOfSpeech":"v.","definition":{"en":"To comb or arrange in a comb-like pattern (rare; used mainly in technical writing).","zh":"梳理；使呈梳状排列（较少见，多用于技术性写作）。"},"examples":[{"en":"The researcher described how the fibers were pectinated into parallel rows.","zh":"研究者描述了这些纤维如何被梳理成平行的条列。"}]}],"synonyms":["comb-like","toothed","serrated (context-dependent)","feathered (context-dependent)"],"phonetic":"/ˈpɛk.təˌneɪt/","extraExplanation":["词源：来自拉丁语 pecten，意为“梳子/梳齿”。因此 pectinate 常用来形容“像梳齿一样一排排分布”的结构，尤其在昆虫触角、鸟类爪缘、植物叶缘或叶脉等描述中常见。","学习提示：在自然科学语境里，pectinate 往往比 comb-like 更正式、更专业；如果是日常表达，用 comb-like 更自然。"]}
{"word":"pectinated","summary":{"en":"Pectinated means “comb-like,” with many small teeth along one side.","zh":"pectinated 指“梳齿状的”，一侧有许多细小齿状突起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a comb-like edge or structure, with many small tooth-like projections arranged along one side (common in biology and botany).","zh":"呈梳齿状的；边缘像梳子一样带有一排细小“齿”（常见于生物学与植物学描述）。"},"examples":[{"en":"Under the microscope, the insect’s antennae look pectinated, like tiny combs.","zh":"在显微镜下，这只昆虫的触角呈梳齿状，像微型梳子。"},{"en":"Some leaves have pectinated margins, with many fine, evenly spaced teeth.","zh":"有些叶片的叶缘呈梳齿状，有许多细小且间距均匀的锯齿。"},{"en":"The diagram labels a pectinated claw used for grooming in certain birds.","zh":"图示标注了某些鸟类用于理羽的梳齿状爪。"}]}],"synonyms":["comb-like","toothed","serrated","pectinate"],"phonetic":"/ˈpɛk.təˌneɪ.tɪd/","extraExplanation":["“pectinated”来自拉丁语词根 pecten（意为“梳子”）。它多用于学术/科普语境（昆虫触角、鸟类爪、植物叶缘等），日常英语中较少见。","相关词：pectinate（形容词/动词，意为“梳齿状的；使呈梳齿状”）。与 serrated（锯齿状）相近，但 pectinated 更强调“像梳子一样的一排齿”，常用于解剖结构描述。"]}
{"word":"pectinatella","summary":{"en":"Pectinatella is a genus of freshwater bryozoans that forms large gelatinous colonies.","zh":"Pectinatella 是淡水苔藓虫（苔藓动物）的一个属，会形成大型果冻状群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of freshwater bryozoans (moss animals) that form large, jelly-like colonies, often seen attached to branches, rocks, or docks in lakes and rivers","zh":"（生物）淡水苔藓虫（又称“苔藓动物”）的一个属，常在湖泊或河流中形成大型果冻状群体，附着在树枝、岩石或码头等表面"},"examples":[{"en":"We saw a huge jelly-like mass in the lake—it was likely Pectinatella.","zh":"我们在湖里看到一大团果冻状的东西——很可能是 Pectinatella（淡水苔藓虫属）的群体。"},{"en":"Pectinatella colonies can look alarming, but they are generally harmless to people.","zh":"Pectinatella 的群体看起来可能有点吓人，但对人通常是无害的。"}]}],"synonyms":["freshwater bryozoan","moss animal"],"phonetic":"/ˌpɛk.tɪ.nəˈtɛl.ə/","extraExplanation":["Pectinatella 常见于北美等地的淡水环境，最常被提到的种是 Pectinatella magnifica（“壮丽苔藓虫”）。它们是由许多个体（虫体）组成的群体，不是“水母”也不是“藻类”。","这些果冻状群体通常在温暖季节更容易被发现，出现的位置常与水体富营养化、缓流水域或有附着物的环境有关。","写作时通常把 Pectinatella 当作拉丁学名使用：属名首字母大写、斜体（Pectinatella）；如果写到具体物种则是 *Pectinatella magnifica*。"]}
{"word":"pectinately","summary":{"en":"“Pertinately” means “in a relevant, to-the-point way.”","zh":"“pertinately”表示“贴切地、切题地、相关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a relevant or appropriate way; in a way that fits the topic or situation.","zh":"贴切地；相关地；恰当地（指与话题或情境相符合）"},"examples":[{"en":"She pertinately asked how the plan would affect small businesses.","zh":"她贴切地问了这个计划会如何影响小企业。"},{"en":"His comments were short but pertinately focused on the main problem.","zh":"他的评论不长，但很贴切地聚焦在主要问题上。"}]}],"synonyms":["relevantly","appropriately","to the point","aptly"],"phonetic":"/ˈpɝːtənəntli/","extraExplanation":["“pectinately”通常不是标准英语单词。你可能想写的是 **pertinately**（贴切地、相关地）。","**pertinent** = 相关的/贴切的（形容词）；**pertinently**（副词）在正式写作和学术讨论中更常见，表示“说得切题”。","不要与 **impertinently**（无礼地、冒失地）混淆：它来自 *im-*（否定）+ *pertinent*，意思转为“不得体/不礼貌”。"]}
{"word":"pectination","summary":{"en":"Pectination means combing or grooming; it’s uncommon in everyday English and appears more in formal or biological contexts.","zh":"Pectination 指“梳理/梳整”，日常较少用，更多见于正式文体或生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of combing, grooming, or arranging something with a comb (or in a comb-like way).","zh":"梳理、梳整的动作或过程（用梳子或以类似梳子的方式整理）。"},"examples":[{"en":"After swimming, she did a quick pectination of her hair with a small comb.","zh":"游完泳后，她用小梳子快速梳理了一下头发。"},{"en":"The stylist recommended gentle pectination to avoid breaking the curls.","zh":"造型师建议轻柔梳理，以免弄断卷发。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/zoology: grooming or cleaning by combing motions, especially using comb-like body parts (for example, in birds or insects).","zh":"（生物/动物学）用梳状动作进行清洁或整理的行为，尤其指借助梳状的身体结构（如某些鸟类或昆虫）。"},"examples":[{"en":"Some birds use their beaks for pectination while preening their feathers.","zh":"一些鸟类在整理羽毛时会用喙进行梳理式清洁。"},{"en":"The paper described pectination behaviors that help remove parasites.","zh":"论文描述了梳理式清洁行为如何帮助去除寄生虫。"}]}],"synonyms":["combing","grooming","brushing","preening"],"phonetic":"/ˌpɛk.təˈneɪ.ʃən/","extraExplanation":["词源上与拉丁语 pecten（“梳子、栉”）有关，因此常用来表示“梳理/呈梳状”的概念。这个词在日常英语里比较少见，更常见的表达是 combing / grooming / brushing。","在动物学语境中，它有时与“梳状结构”相关（如某些结构像梳齿一样用于清洁或过滤），阅读学术文本时遇到更常见。"]}
{"word":"pectinatodenticulate","summary":{"en":"A rare scientific adjective meaning “comb-like and finely toothed along the edge.”","zh":"罕见的科学用形容词，指“边缘呈梳状且具细密小齿”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a margin or edge with very fine, comb-like teeth (a mix of “pectinate/comb-like” and “denticulate/fine-toothed”).","zh":"（边缘）具有非常细密、像梳齿一样的微小锯齿；兼具“梳状（pectinate）”与“细齿状（denticulate）”的特征。"},"examples":[{"en":"Under the microscope, the leaf margin appears pectinatodenticulate rather than smooth.","zh":"在显微镜下，叶缘看起来是pectinatodenticulate（梳状细齿），而不是光滑的。"},{"en":"The species can be identified by its pectinatodenticulate scales along the wing edge.","zh":"该物种可通过翅缘上呈pectinatodenticulate（梳状细齿）的鳞片来辨认。"}]}],"synonyms":["pectinate","denticulate","serrulate","finely serrated"],"phonetic":"/pɛkˌtɪnətoʊˌdɛnˈtɪkjələt/","extraExplanation":["这是一个非常少见、偏专业的形态学形容词，多见于植物学、昆虫学或动物解剖描述（例如“叶缘”“鳞片边缘”“骨片/甲片边缘”等）。","词形可拆为 pectinate（梳状、像梳齿）+ denticulate（具细小齿状突起），用来强调“齿很细、排列像梳子一样密”。在一般英语写作中几乎不会用。"]}
{"word":"pectinatofimbricate","summary":{"en":"A technical botanical adjective meaning “comb-toothed and fringed.”","zh":"植物学专业形容词，指“边缘呈栉状（梳齿状）并带流苏状缘毛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, technical) Having an edge or structure that is both pectinate (comb-like, with many narrow projections) and fimbricate (fringed with fine threads or tassel-like segments).","zh":"（植物学，专业词）形态或边缘同时呈“栉状”（像梳齿一样有许多狭长突起）并带“流苏状/缘毛状”（有细丝般穗状裂片或缘毛）。"},"examples":[{"en":"Under the microscope, the petal margin appears pectinatofimbricate, with comb-like teeth and a delicate fringe.","zh":"在显微镜下，花瓣边缘呈栉状流苏状（pectinatofimbricate），既有梳齿状小齿，又带细密缘毛。"},{"en":"The species can be recognized by its pectinatofimbricate scales along the leaf base.","zh":"该物种可通过叶基部呈栉状流苏状的鳞片特征来辨认。"}]}],"synonyms":["pectinate and fimbricate","comb-toothed and fringed","fringed, comb-like"],"phonetic":"/ˌpɛkˌtɪnətoʊˈfɪmbrɪˌkeɪt/","extraExplanation":["这是一个高度专业、在日常英语中几乎不会出现的复合形容词，常见于植物形态学描述（如分类检索表、物种志）。","词形可拆解为 pectinato-（表示“栉状/梳齿状”）+ fimbricate（表示“具流苏状缘毛/缘饰”）。作者用它来强调同一结构同时具备两种“边缘细节”。","阅读植物学描述时，遇到这类复合词通常可以先抓住两段核心意义：先看 pectinate（像梳齿的规则裂片），再看 fimbricate（更细、更毛边或穗状的缘饰），合起来就是“梳齿 + 细缘毛”的组合特征。"]}
{"word":"pectinatopinnate","summary":{"en":"Pectinatopinnate describes a feather-like structure with comb-like, narrow, evenly spaced side segments (often in leaves or fronds).","zh":"pectinatopinnate 指“梳状羽状/梳状羽裂”的形态：沿主轴两侧的裂片或小叶细长、间距规则，整体像梳子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pinnate (feather-like) structure in which the side parts are very narrow and evenly spaced, giving a comb-like look; used especially for describing leaves or fronds.","zh":"（尤用于植物学）具羽状（似羽毛）结构，但侧裂片/小叶又细长且排列整齐，整体呈“梳子状”的；常用于描述叶或蕨类叶状体。"},"examples":[{"en":"Under the hand lens, the frond looks pectinatopinnate, with many slender segments lined up like teeth of a comb.","zh":"用放大镜观察，这片叶状体呈 pectinatopinnate（梳状羽裂），许多细长裂片像梳齿一样排列。"},{"en":"The identification key notes that the species has pectinatopinnate leaves rather than broadly pinnate ones.","zh":"检索表提到该物种的叶为 pectinatopinnate（梳状羽状），而不是宽羽状的类型。"}]}],"synonyms":["comb-like pinnate","pectinate","pinnate (in a comb-like form)"],"phonetic":"/ˌpɛk.tɪˌneɪ.toʊˈpɪ.neɪt/","extraExplanation":["这个词是由 pectinate（梳状的，来自拉丁语 pecten“梳子”）+ pinnate（羽状的，来自拉丁语 pinna“羽毛/翅”）组合而成，多见于植物形态描述与物种鉴定文本。","理解要点：pinnate 强调“沿主轴两侧排列”；pectinate 强调“像梳齿一样细、密、整齐”。因此 pectinatopinnate 通常暗示裂片/小叶更狭长、间距更规则、整体更像梳子。"]}
{"word":"pectineal","summary":{"en":"Pectineal means “related to the pecten/pectineus,” especially the pectineal line (pecten of the pubis) or the pectineus muscle in the groin/upper inner thigh.","zh":"pectineal 指“与梳状嵴/耻骨梳或耻骨肌有关的”，常用于解剖学中表示耻骨梳线（耻骨梳）或腹股沟/大腿上内侧的耻骨肌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pecten (a ridge or comb-like structure) or, most commonly in human anatomy, to the pecten/pubis area of the pelvis (the superior pubic ramus).","zh":"（解剖）与“耻骨梳/梳状嵴（pecten）”有关的；更常见指与骨盆耻骨梳（耻骨上支上的一条嵴）区域有关的。"},"examples":[{"en":"The surgeon identified the pectineal line as an important landmark during the procedure.","zh":"外科医生在手术中把耻骨梳线作为一个重要的解剖标志。"},{"en":"Pain near the pectineal region can sometimes be related to hip or groin strain.","zh":"耻骨梳区域附近的疼痛有时与髋部或腹股沟拉伤有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Referring to the pectineus muscle in the upper inner thigh (involved in hip flexion and adduction).","zh":"指耻骨肌（大腿上内侧的一块肌肉，参与髋关节屈曲与内收）。"},"examples":[{"en":"The therapist suspected tightness in the pectineal (pectineus) muscle after the athlete’s groin injury.","zh":"运动员腹股沟受伤后，治疗师怀疑耻骨肌（耻骨肌相关肌群）出现紧张。"},{"en":"Stretching may help relieve discomfort involving the pectineal muscle group.","zh":"拉伸可能有助于缓解与耻骨肌群相关的不适。"}]}],"synonyms":["pubic (in context)","inguinal (nearby region, not identical)","pectineus-related"],"phonetic":"/pɛkˈtɪniəl/","extraExplanation":["“pectineal”源自拉丁语 pecten，意为“梳子/梳状物”，因为相关的骨性结构（如耻骨梳）形态上像“梳齿”或“嵴”。在医学英语中，它多用于解剖学定位与肌肉命名。"]}
{"word":"pectines","summary":{"en":"Pectin is a natural fruit fiber used especially to thicken and gel jams and jellies; it’s also a type of dietary fiber.","zh":"Pectin（果胶）是一种水果中的天然纤维，常用于让果酱/果冻增稠成胶；它也属于膳食纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural substance found in the cell walls of many fruits and vegetables that helps form a gel; commonly used to thicken jams and jellies.","zh":"一种天然物质，存在于许多水果和蔬菜的细胞壁中，能形成凝胶；常用于增稠果酱和果冻。"},"examples":[{"en":"This strawberry jam sets well because it has enough pectin.","zh":"这款草莓果酱凝固得很好，因为它含有足够的果胶。"},{"en":"Apples and citrus peels are rich sources of pectin.","zh":"苹果和柑橘类果皮是果胶的重要来源。"}]},{"partOfSpeech":"n.","definition":{"en":"A carbohydrate (a type of dietary fiber) that can support digestion and may help with cholesterol management.","zh":"一种碳水化合物（属于膳食纤维），有助于消化，并可能帮助管理胆固醇。"},"examples":[{"en":"Some supplements contain citrus pectin as a source of fiber.","zh":"一些补充剂含有柑橘果胶作为纤维来源。"},{"en":"Eating whole fruits provides fiber, including pectin.","zh":"吃完整水果能摄取纤维，其中包括果胶。"}]}],"synonyms":["gelling agent","thickener","fruit fiber"],"phonetic":"/ˈpɛktɪn/","extraExplanation":["“pectines”常见于其他语言（如法语/西语的拼写）或是把英文复数“pectins”误写成“pectines”。英语里最常用的词形是单数 pectin（果胶），复数是 pectins。","做果酱/果冻时，果胶常与糖和酸（例如柠檬汁）一起作用，更容易形成凝胶结构，因此配方里常会强调糖度与酸度。"]}
{"word":"pectinesterase","summary":{"en":"Pectinesterase is an enzyme that changes/breaks down pectin, affecting plant texture and food gelling.","zh":"Pectinesterase（果胶酯酶）是一种改性/分解果胶的酶，会影响植物组织质地与食品凝胶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down pectin by removing methyl groups (de-esterifying it), changing the texture of plant tissues and affecting gelling in foods like jam.","zh":"一种酶，能通过去除果胶上的甲基（去酯化）来分解/改性果胶，从而改变植物组织的质地，并影响果酱等食品的凝胶形成。"},"examples":[{"en":"Pectinesterase can soften fruit by modifying pectin in the cell walls.","zh":"果胶酯酶会通过改性细胞壁中的果胶，使水果变软。"},{"en":"In jam making, pectinesterase activity can influence how firmly the jam sets.","zh":"在制作果酱时，果胶酯酶的活性会影响果酱凝固的紧实程度。"}]}],"synonyms":["pectin methylesterase","PME"],"phonetic":"/ˈpɛk.tɪnˌɛs.təˌreɪs/","extraExplanation":["果胶（pectin）是植物细胞壁的重要成分，常见于水果；果胶酯酶（pectinesterase）会把“甲氧基化的果胶”变成更容易与钙离子作用或进一步被其他酶分解的形式，因此会影响水果成熟、软化以及加工食品的口感。","在食品与植物生理学语境中，你也可能看到同义写法 pectin methylesterase（PME），指的通常是同一类酶或非常接近的酶活性。"]}
{"word":"pectineus","summary":{"en":"Pectineus is an anatomical term for an inner-thigh muscle that flexes and adducts the hip.","zh":"Pectineus 是解剖学术语，指大腿上内侧的耻骨肌，主要用于屈髋与内收。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat muscle in the upper inner thigh (part of the hip flexors) that helps bend the hip and bring the leg toward the body’s midline (adduction)","zh":"耻骨肌（大腿上内侧、属髋屈肌群的一块扁平肌肉），主要作用是屈髋并使大腿内收（靠近身体中线）"},"examples":[{"en":"The therapist suspected tightness in the pectineus muscle after the patient reported groin pain.","zh":"患者主诉腹股沟疼痛后，治疗师怀疑耻骨肌可能过紧。"},{"en":"In anatomy class, we learned that the pectineus helps with hip flexion and adduction.","zh":"在解剖课上，我们学到耻骨肌有助于屈髋和内收。"}]}],"synonyms":["pectineus muscle","musculus pectineus"],"phonetic":"/pɛkˈtɪniəs/","extraExplanation":["“pectineus”多用于解剖学、运动医学与临床语境，日常英语很少见。","词源来自拉丁语，意为“梳子状/梳状”，与该肌肉的形态联想有关。","位置上常被描述为大腿前内侧、靠近腹股沟；相关不适常见于“腹股沟拉伤（groin strain）”或髋部过度使用情境。"]}
{"word":"pectini","summary":{"en":"Pectin is a fruit-based substance used to thicken and set jams and jellies.","zh":"Pectin（果胶）是水果中的天然成分，用来让果酱、果冻变稠并凝固。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural substance found in many fruits (especially apples and citrus) that helps liquids thicken and form a jelly; it is commonly used to make jam and jelly.","zh":"一种存在于许多水果（尤其是苹果和柑橘类）中的天然物质，能使液体变稠并凝固成果冻状；常用于制作果酱和果冻。"},"examples":[{"en":"This strawberry jam uses pectin to help it set.","zh":"这款草莓果酱用果胶来帮助凝固成型。"},{"en":"Citrus peels are high in pectin.","zh":"柑橘类果皮的果胶含量很高。"},{"en":"If the fruit is not ripe enough, you may need extra pectin.","zh":"如果水果不够成熟，你可能需要额外添加果胶。"}]}],"synonyms":["gelling agent","thickener"],"phonetic":"/ˈpɛktɪn/","extraExplanation":["“pectini”不是常见的英语单词拼写。你可能想查的是 **pectin**（果胶）。在一些语言里（如意大利语）“pectini”可能是对应词的复数形式，但英语里通常只用 **pectin** 这个形式，属于不可数名词。","词源提示：**pectin** 来自希腊语 *pektos*（“凝固的、变稠的”），所以它的核心含义与“让液体凝结/变稠”有关。"]}
{"word":"pectinibranch","summary":{"en":"Pectinibranch describes (or names) gastropods with comb-like gills, especially certain marine snails.","zh":"pectinibranch 指（或指称）具有梳状/栉状鳃的腹足类动物，常见于某些海螺等海洋蜗牛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having comb-like gills; used especially of certain sea snails (gastropod mollusks).","zh":"（动物学）具有“梳状/栉状”鳃的；多用于描述某些海螺等腹足类软体动物。"},"examples":[{"en":"Many marine snails have pectinibranch gills that help them breathe underwater.","zh":"许多海洋蜗牛具有栉状鳃，帮助它们在水下呼吸。"},{"en":"The guide described the specimen as a pectinibranch gastropod.","zh":"讲解员把这件标本描述为具有栉状鳃的腹足类。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A gastropod (or member of a group of gastropods) characterized by comb-like gills.","zh":"（动物学）栉鳃类腹足动物；指具有栉状鳃特征的腹足类（或其成员）。"},"examples":[{"en":"This pectinibranch lives on rocky shores and grazes on algae.","zh":"这种栉鳃类生活在岩石海岸，以藻类为食。"}]}],"synonyms":["comb-gilled (descriptive)","with comb-like gills (descriptive)"],"phonetic":"/ˌpɛkˈtɪnəˌbræŋk/","extraExplanation":["词源提示：pectini- 来自拉丁语 pecten（“梳子”），branch 与鳃有关（可联想 gill）。合起来就是“梳子一样排列的鳃”。","该词多见于较传统或专业的分类与形态描述中；现代生物学写作里更常直接说 “comb-like gills” 或用更细的分类名称（如某些海螺类群）。"]}
{"word":"pectinibranchia","summary":{"en":"Pectinibranchia is an older zoological term for a group of marine snails characterized by comb-like gills.","zh":"Pectinibranchia 是一个较旧的动物学分类名称，指具有梳状鳃的一类海洋螺类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former (now largely outdated) taxonomic group of marine snails, defined by having comb-like gills.","zh":"（旧分类）一类海洋腹足类（海螺、海螺类等）的分类群，特征是具有“梳状鳃”。"},"examples":[{"en":"Older zoology books may place many sea snails in Pectinibranchia.","zh":"较早的动物学书籍可能会把许多海螺类归入 Pectinibranchia。"},{"en":"The term Pectinibranchia is mainly used in historical or comparative taxonomy.","zh":"Pectinibranchia 这个术语主要用于历史性的或比较分类学的语境。"}]}],"synonyms":["comb-gilled gastropods (descriptive)"],"phonetic":"/pɛkˌtɪnəˈbræŋkiə/","extraExplanation":["词源：pectini- 来自拉丁语 pecten（“梳子”），branchia 来自希腊语，意为“鳃”；合起来就是“梳状鳃”。","分类提示：在现代系统发育分类中，这个类群多被重新划分到其他更精确的类群里，所以你更常在旧文献、博物馆旧标签或历史分类讨论中看到它。","拼写与大小写：作为分类名称通常首字母大写（Pectinibranchia）；在正文中作普通名词引用时也可能写成小写。"]}
{"word":"pectinibranchian","summary":{"en":"Pectinibranchian refers to (or names) marine gastropods with comb-like gills, a term mostly found in older zoological classification.","zh":"pectinibranchian 指（或指称）具有栉状鳃的海洋腹足类动物，多见于较旧的动物学分类用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Relating to a group of marine gastropod mollusks (especially sea slugs) that have comb-like gills; also used to describe such animals.","zh":"（动物学）指（尤指海蛞蝓等）一类具有“梳状/栉状”鳃的海洋腹足类软体动物的；也可用来指这类动物。"},"examples":[{"en":"Some older biology texts describe certain sea slugs as pectinibranchian because of their comb-like gills.","zh":"一些较早的生物学教材会把某些海蛞蝓称为 pectinibranchian，因为它们有栉状的鳃。"},{"en":"The specimen was labeled “pectinibranchian gastropod” in the museum collection.","zh":"这件标本在博物馆馆藏中被标注为“pectinibranchian 腹足类”。"}]},{"partOfSpeech":"n.","definition":{"en":"A pectinibranchian animal; an individual member of that group.","zh":"栉鳃类动物；该类群中的一个个体。"},"examples":[{"en":"The researcher compared two pectinibranchians from different coastal habitats.","zh":"研究者比较了来自不同海岸栖息地的两种栉鳃类动物。"}]}],"synonyms":["pectinibranch"],"phonetic":"ˌpɛk.tə.nəˈbræŋ.ki.ən","extraExplanation":["该词多见于较旧或偏分类学的文献中，现代资料里更常直接使用更具体的类群名称（如某些“海蛞蝓/后鳃类”相关分支）来描述。","词源上可拆为 pectini-（来自拉丁语 pecten，意为“梳子/栉”）+ branchia（意为“鳃”），合起来就是“梳状的鳃”。"]}
{"word":"pectinibranchiata","summary":{"en":"Pectinibranchiata is an older zoological term for a group of gastropods (many sea snails) with comb-like gills.","zh":"Pectinibranchiata 是较旧的动物学名称，指一类具有梳状鳃的腹足类（多为海螺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now largely outdated) taxonomic group of gastropod mollusks characterized by comb-like gills (ctenidia), including many marine snails.","zh":"（旧称、现多已不用的）腹足纲软体动物的一类分类群，特点是具有“梳状鳃”（栉鳃/ctenidia），包括许多海螺类。"},"examples":[{"en":"Older zoology books may list many sea snails under Pectinibranchiata.","zh":"较早的动物学书里，许多海螺可能会被归入 Pectinibranchiata。"},{"en":"The term Pectinibranchiata is rarely used in modern classifications of gastropods.","zh":"在现代的腹足类分类中，Pectinibranchiata 这个名称很少使用。"}]}],"synonyms":["Pectinibranchia","pectinibranchs"],"phonetic":"/ˌpɛk.tɪ.nɪˌbræŋ.kiˈeɪ.tə/","extraExplanation":["该词来自拉丁语/新拉丁语构词：pectini- 表示“梳子/梳状”（源自 pecten，意为“梳子、扇贝壳/栉状结构”），branchiata 与“鳃”（gills）有关，整体意思就是“有梳状鳃的一类”。","在现代系统分类中，这类“按鳃形态分组”的旧分类多被更精细的谱系（演化关系）分类取代，因此你更多会在历史文献、旧教材或博物学资料里看到它。"]}
{"word":"pectinibranchiate","summary":{"en":"Pectinibranchiate means “having comb-like gills,” used mainly in zoology for certain marine snails.","zh":"Pectinibranchiate 意为“具有梳状鳃的”，主要用于动物学中描述某些海洋螺类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having comb-like gills; describing certain mollusks (especially some sea snails) whose gills are arranged like the teeth of a comb.","zh":"（尤指某些海螺/腹足类）具有“梳状鳃”的；鳃像梳子的齿一样排列。"},"examples":[{"en":"Some marine gastropods are described as pectinibranchiate because their gills look like a comb.","zh":"有些海洋腹足类被称为 pectinibranchiate，因为它们的鳃看起来像梳子。"},{"en":"In older zoology texts, the term pectinibranchiate often appears in descriptions of sea-snail anatomy.","zh":"在较早的动物学教材中，pectinibranchiate 常用于描述海螺的解剖结构。"}]}],"synonyms":["comb-gilled","pectinate-gilled","having pectinate gills"],"phonetic":"ˌpɛk.tən.əˈbræŋ.ki.eɪt","extraExplanation":["这个词主要见于动物学/贝类学（malacology）的较旧文献中。词源可拆为 pectin-（来自拉丁语 pecten“梳子”）+ branch-（来自希腊语/拉丁语中表示“鳃”的词根 branchia）+ -ate（形容词后缀），字面意思就是“梳状鳃的”。现代分类学里更常用更具体的类群名称，而不是用它做大类群标签。"]}
{"word":"pectinic","summary":{"en":"Pectinic means “related to pectin” (or pectinic acid), usually in scientific or food contexts.","zh":"Pectinic 指“与果胶（或果胶酸）有关的”，多见于科学或食品相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pectin (a natural substance in many fruits) or to pectinic acid; often used in food science and chemistry.","zh":"与果胶（许多水果中的天然物质）或果胶酸有关的；常用于食品科学与化学语境。"},"examples":[{"en":"Apples are rich in pectin, so their juice can form pectinic gels more easily.","zh":"苹果富含果胶，所以它们的果汁更容易形成果胶性的凝胶。"},{"en":"The lab measured pectinic compounds to understand how the jam would set.","zh":"实验室测量了与果胶有关的化合物，以了解果酱如何凝固成型。"}]}],"synonyms":["pectic","pectin-related"],"phonetic":"/pɛkˈtɪnɪk/","extraExplanation":["“Pectinic”在日常英语中很少见，更常见的是“pectin”（果胶）或“pectic/pectinic acid”（果胶酸/果胶相关酸）。在果酱、果冻制作中，人们通常会谈到“pectin”帮助“set”（凝固）。"]}
{"word":"pectinid","summary":{"en":"A pectinid is a scallop (a bivalve mollusk in the family Pectinidae).","zh":"pectinid 指栉江珧科的双壳类软体动物，即“扇贝”一类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bivalve mollusk in the family Pectinidae; a scallop (or a scallop-like shellfish).","zh":"栉江珧科（Pectinidae）的双壳类软体动物；扇贝（或类似扇贝的贝类）。"},"examples":[{"en":"Fossil pectinids are common in marine sediments from many geological periods.","zh":"在许多地质时期形成的海洋沉积物中，扇贝类（pectinids）化石很常见。"},{"en":"The diver photographed a colorful pectinid resting on the sandy seabed.","zh":"潜水员拍到一只色彩鲜艳的扇贝类（pectinid）躺在沙质海底上。"}]}],"synonyms":["scallop","bivalve (general)"],"phonetic":"/ˈpɛk.tə.nɪd/","extraExplanation":["“pectinid”是生物学/古生物学里的专业词，来自拉丁语词根，和“Pectinidae（栉江珧科）”同源；日常英语中更常直接说“scallop（扇贝）”。","部分扇贝类能通过快速合拢贝壳“游泳”，这是它们在科普书或纪录片里常被提到的有趣特征。"]}
{"word":"pectinidae","summary":{"en":"Pectinidae is the biological family that includes scallops.","zh":"Pectinidae 指“扇贝科”，即包含扇贝在内的一类海洋双壳贝类的生物分类科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine bivalve mollusks known as scallops, with fan-shaped shells often having radiating ribs.","zh":"扇贝科：一类海洋双壳类软体动物（扇贝），通常具有扇形贝壳，壳面常见放射状肋纹。"},"examples":[{"en":"Many edible scallops belong to the family Pectinidae.","zh":"许多可食用的扇贝属于扇贝科（Pectinidae）。"},{"en":"The museum display compared shell patterns across different Pectinidae species.","zh":"博物馆展柜比较了不同扇贝科物种的贝壳花纹。"}]}],"synonyms":["scallop family"],"phonetic":"/pɛkˈtɪnəˌdi/","extraExplanation":["“Pectinidae”是生物分类学里的科名（family name），常用于学术写作、海洋生物学、古生物学与贝类研究中；日常英语更常说“scallops（扇贝）”。","词源上与拉丁语“pecten”（意为“梳子/扇形梳状物”）有关，指扇贝壳常见的扇形与放射状纹理。","读写提示：科名在英语中通常首字母大写（Pectinidae），斜体一般用于属名和种名（如 *Pecten maximus*），科名通常不斜体。"]}
{"word":"pectiniferous","summary":{"en":"Pectiniferous describes plants or materials that contain or yield pectin.","zh":"Pectiniferous 指“含有或产生果胶的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or producing pectin (a natural substance in plants that helps fruit gels when making jam).","zh":"含有或产生果胶的（果胶是植物中的天然物质，做果酱时能帮助凝胶/凝固）。"},"examples":[{"en":"Apples are pectiniferous, which is why they help jam set firmly.","zh":"苹果是富含果胶的，所以它们能帮助果酱凝固得更结实。"},{"en":"Lemon peel is pectiniferous and is sometimes used to thicken preserves.","zh":"柠檬皮含果胶，有时会用来让果酱/蜜饯更浓稠。"}]}],"synonyms":["pectin-rich","high in pectin","pectin-containing"],"phonetic":"/pɛkˈtɪnəfərəs/","extraExplanation":["这个词多见于食品科学、植物学或较正式的写作中；日常英语更常说“high in pectin / rich in pectin（果胶含量高）”。","词源结构：pectin（果胶）+ -ferous（“含有/产生……的”，如 resiniferous“含树脂的”、carboniferous“含碳的/石炭纪的”）。"]}
{"word":"pectiniform","summary":{"en":"Pectiniform means “comb-shaped,” especially in scientific descriptions.","zh":"pectiniform 指“梳状的、像梳齿一样排列的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comb-shaped; arranged like the teeth of a comb (often used in biology or anatomy to describe structures with many parallel, closely spaced parts).","zh":"梳状的；像梳子齿一样排列的（常用于生物学或解剖学，描述由许多平行、密集结构组成的形态）。"},"examples":[{"en":"Under the microscope, the surface shows a pectiniform pattern with fine, parallel ridges.","zh":"在显微镜下，这个表面呈现梳状图案，有细密、平行的脊状结构。"},{"en":"The researcher described the insect’s antenna as pectiniform, resembling a tiny comb.","zh":"研究者把这种昆虫的触角描述为梳状的，看起来像一把小梳子。"}]}],"synonyms":["comb-shaped","comb-like","pectinate"],"phonetic":"/pɛkˈtɪnɪˌfɔrm/","extraExplanation":["词源提示：pectiniform 来自拉丁语 pecten（“梳子、栉”）+ -form（“形状”），字面意思就是“梳子形的”。","使用场景：这个词多见于学术/专业语境（生物学、昆虫学、解剖学、植物学等）。日常英语更常用 comb-shaped 或 comb-like。","相关词：你可能也会遇到 pectinate（梳齿状的）、pecten（栉/梳状结构，在解剖学中也可指某些“栉状”器官结构）。"]}
{"word":"pectinirostrate","summary":{"en":"A rare zoological adjective meaning “having a comb-edged beak (rostrum).”","zh":"一个罕见的动物学形容词，意为“具有梳状边缘的喙（吻突）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in zoology) having a beak or rostrum with comb-like, tooth-like ridges along the edge.","zh":"（尤用于动物学）指喙或吻突边缘具有梳状、齿状突起（像梳子一样的“齿”）的。"},"examples":[{"en":"Some waterfowl show pectinirostrate bills that help them filter food from the water.","zh":"一些水禽具有梳状喙，有助于它们从水中过滤食物。"},{"en":"Under the microscope, the bird’s pectinirostrate beak edge looked like a tiny comb.","zh":"在显微镜下，这只鸟梳状喙的边缘看起来像一把微型梳子。"}]}],"synonyms":["comb-billed","comb-edged","pectinate-beaked"],"phonetic":"/ˌpɛk.tɪ.nɪˈrɑː.streɪt/","extraExplanation":["这是一个非常少见、偏学术的形容词，多见于动物学/形态学描述。词源来自拉丁语：pecten（梳子）+ rostrum（喙、吻突），“pectini-”表示梳状，“-rostrate”表示有喙/有吻突。","在自然史写作或鸟类学里，有时也会用更直白的表达，例如 comb-like bill / comb-edged beak；相关词还有 pectinate（梳状的）、rostral/rostrum（喙的/喙、吻突）。"]}
{"word":"pectinite","summary":{"en":"Pectinite is a rare technical word for a pectin-related substance; modern usage usually prefers “pectinate.”","zh":"Pectinite 是个少见的技术词，指果胶相关物质；现代通常更常用 “pectinate”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, technical term (mostly in older scientific writing) referring to a substance related to pectin—often used for a pectin-derived material or a pectin salt (what modern texts more commonly call a “pectinate”).","zh":"一个较罕见、偏旧式的科学术语，指与果胶（pectin）有关的物质——常用来指果胶的衍生物或果胶盐（现代更常用 pectinate 来表达）。"},"examples":[{"en":"Some older papers describe pectinite as a pectin-based compound formed during extraction.","zh":"一些较旧的论文会把 pectinite 描述为在提取过程中形成的果胶类化合物。"},{"en":"In modern terminology, the author would likely use pectinate instead of pectinite.","zh":"按现代术语，作者很可能会用 pectinate 来替代 pectinite。"}]}],"synonyms":["pectinate","pectin derivative","pectin salt"],"phonetic":"/ˈpɛk.tə.naɪt/","extraExplanation":["“pectinite”在当代英语词典与学术写作中并不常见，很多时候是旧文献用词、地区性用法，或是把“pectinate（果胶盐/果胶酸盐）”写成了“pectinite”。","如果你是在实验、配方或论文里看到这个词，建议回看原文的化学定义/结构式，或对照同段落是否也出现了 pectin、pectate、pectinate 等相关词，以确认作者的具体所指。"]}
{"word":"pectinogen","summary":{"en":"Pectinogen is a plant substance that can be converted into pectin, especially as fruit ripens (an older term, close to protopectin).","zh":"Pectinogen（果胶原）指植物组织中可转变为果胶的物质，常见于水果成熟过程（较旧用语，接近原果胶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) A substance in plant tissues that can change into pectin, especially during fruit ripening; an older term often treated as similar to protopectin.","zh":"（生物）植物组织中可转化为果胶的物质，常见于水果成熟过程中；较旧的术语，常被视为与“原果胶（protopectin）”相近。"},"examples":[{"en":"As fruit ripens, pectinogen can be converted into pectin, changing the texture of the flesh.","zh":"随着水果成熟，果胶原可转变为果胶，从而改变果肉的质地。"},{"en":"Some older biology texts use the word pectinogen when describing changes in plant cell walls.","zh":"一些较早的生物学教材在描述植物细胞壁变化时会使用“果胶原”这个词。"}]}],"synonyms":["protopectin (related/near synonym, common in modern texts)"],"phonetic":"/ˌpɛkˈtɪnədʒən/","extraExplanation":["“pectinogen”在现代英语科研写作中不算常用，更常见的是用“pectin（果胶）”“protopectin（原果胶）”来谈果实硬度、成熟软化与细胞壁结构。","果胶与果酱凝胶化有关：水果中果胶含量、酸度和糖分会影响果酱是否容易“凝固”。“果胶原→果胶”的转变也常被用来解释成熟过程中口感由硬变软。"]}
{"word":"pectinoid","summary":{"en":"Pectinoid means “comb-shaped,” and it’s mostly used in scientific descriptions of form.","zh":"pectinoid 指“梳状的、像梳子一样的”，多用于科学语境中的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comb-shaped; having a structure like a comb (with many small, tooth-like projections).","zh":"梳状的；像梳子一样的（带有许多细小齿状突起）。"},"examples":[{"en":"Some insects have pectinoid antennae with many fine branches.","zh":"有些昆虫的触角呈梳状，带有许多细小分支。"},{"en":"Under the microscope, the edge looked pectinoid rather than smooth.","zh":"在显微镜下，边缘看起来是梳状的，而不是光滑的。"}]},{"partOfSpeech":"n.","definition":{"en":"A comb-shaped structure (used in scientific descriptions).","zh":"梳状结构（多用于科学描述）。"},"examples":[{"en":"The diagram labels a pectinoid near the sensory organ.","zh":"图示在感觉器官附近标出了一个梳状结构。"}]}],"synonyms":["comb-like","pectinate","comblike","pectiniform"],"phonetic":"ˈpɛk.tɪ.nɔɪd","extraExplanation":["词源上与拉丁语/希腊语里的 *pecten*（“梳子；扇贝壳”）有关，所以 *pectinoid* 常用来描述“像梳子/扇贝壳纹理那样的形状”。在生物学、昆虫学、解剖学等学科的形态学描写中更常见。"]}
{"word":"pectinose","summary":{"en":"Pectinose means ‘related to or containing pectin,’ usually in scientific contexts.","zh":"pectinose 指“与果胶有关/含果胶的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Chemistry) Relating to, resembling, or containing pectin (a plant substance that helps form gels, often used to thicken jams and jellies).","zh":"（生物/化学）与果胶有关的；类似果胶的；含有果胶的（果胶是一种植物成分，能形成凝胶，常用于增稠果酱/果冻）。"},"examples":[{"en":"Pectinose substances in fruit help jam set when you boil it with sugar.","zh":"水果中的果胶类物质能帮助果酱在与糖一起煮沸时凝固。"},{"en":"Some plant cell walls have pectinose material that contributes to their structure.","zh":"一些植物细胞壁含有果胶类物质，有助于维持结构。"}]}],"synonyms":["pectic","pectinal","pectin-related"],"phonetic":"/ˈpɛk.təˌnoʊs/","extraExplanation":["“pectinose”属于较少见、偏专业的词，多见于较老的植物学/食品化学写作中，用来描述“果胶相关的物质/特性”。日常英语里更常用的是“pectin”（果胶）或“pectic / pectinal”（果胶的）。","果胶主要存在于水果（如苹果、柑橘）和植物细胞壁中；在烹饪里，果胶与糖和酸、加热条件配合，会让液体变稠并形成凝胶（如果酱、果冻的口感）。"]}
{"word":"pectinous","summary":{"en":"Pectinous means ‘related to or containing pectin’ and often describes something that becomes jelly-like, especially in fruit cooking.","zh":"Pectinous 指“与果胶有关或含有果胶的”，常用来形容（尤其在水果烹调中）会变得像果冻/凝胶一样的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing, relating to, or resembling pectin (a natural substance in many fruits that helps them form a gel).","zh":"含有果胶的；与果胶有关的；类似果胶（许多水果中的天然物质，可形成凝胶）。"},"examples":[{"en":"Apples and citrus peels are especially rich in pectinous material.","zh":"苹果和柑橘类果皮尤其富含果胶性物质。"},{"en":"When the mixture becomes pectinous, it starts to thicken like jam.","zh":"当混合物呈现果胶性时，它会像果酱一样开始变稠。"}]},{"partOfSpeech":"adj.","definition":{"en":"Jelly-like; forming a soft gel.","zh":"胶状的；凝胶般的（可形成柔软的胶体）。"},"examples":[{"en":"The cooked fruit developed a slightly pectinous texture.","zh":"煮过的水果出现了略带胶状的口感。"},{"en":"Some sauces become pectinous as they cool.","zh":"有些酱汁冷却后会变得呈胶状。"}]}],"synonyms":["pectic","gelatinous","jellylike","gelling"],"phonetic":"/ˈpɛk.tə.nəs/","extraExplanation":["“Pectinous”常见于食品科学、烹饪与植物学语境。做果酱/果冻时，果胶在糖和酸的帮助下会形成网状结构，让液体“凝住”，因此你会看到诸如“pectinous gel/solution（果胶凝胶/溶液）”这样的搭配。","词形上，-ous 表示“具有……性质的”，所以 pectin + -ous 就是“具有果胶性质的”。"]}
{"word":"pectins","summary":{"en":"Pectins are natural plant substances (common in fruits) used to thicken and gel foods like jam and jelly.","zh":"Pectins（果胶）是水果等植物中的天然物质，用来增稠并让果酱、果冻等凝固。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Natural substances found in plant cell walls (especially in fruits) that help thicken and form a gel, often used to set jams and jellies.","zh":"存在于植物细胞壁（尤其是水果）中的天然物质，能增稠并形成凝胶，常用于让果酱、果冻凝固。"},"examples":[{"en":"Apples and citrus fruits are high in pectins, which is why they help jam set.","zh":"苹果和柑橘类水果富含果胶，所以它们能帮助果酱凝固。"},{"en":"The recipe calls for extra pectins to make a firmer jelly.","zh":"这份食谱需要额外的果胶，让果冻更结实。"},{"en":"Low-pectin fruits may need added pectins when making homemade preserves.","zh":"果胶含量低的水果在做自制果酱时，可能需要添加果胶。"}]}],"synonyms":["gelling agent","thickener"],"phonetic":"/ˈpɛktɪnz/","extraExplanation":["“pectins”是“pectin（果胶）”的复数形式。日常英语里更常见的是不可数用法“pectin”（例如：add pectin），但在讨论不同来源/种类或多种果胶时也会用复数“pectins”。","果胶常从柑橘皮、苹果渣中提取；在烹饪中与糖和酸一起更容易形成凝胶，所以做果酱时常会加入糖和柠檬汁。"]}
{"word":"pectizable","summary":{"en":"“Pectizable” is not a standard English word; it is probably a misspelling (often of “respectable” or “despicable”).","zh":"“pectizable”不是标准英语单词；多半是拼写错误（常见可能是“respectable”或“despicable”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a nonstandard invention.","zh":"不是标准英语单词；很可能是拼写错误或非规范自造词。"},"examples":[{"en":"“Pectizable” doesn’t appear in standard dictionaries—could you share the full sentence so I can help you find the right word?","zh":"“pectizable”在常见词典里查不到——你能给我完整句子吗？我可以帮你找出正确的词。"},{"en":"You may have meant “respectable” (worthy of respect) or “despicable” (very bad).","zh":"你可能想写“respectable”（值得尊敬的）或“despicable”（卑劣的/很糟的）。"}]}],"synonyms":["(possible intended) respectable","(possible intended) despicable","(possible intended) acceptable","(possible intended) perceptible"],"phonetic":"ˈpɛk.tɪˌzaɪ.zə.bəl","extraExplanation":["从拼写结构看，“pectizable”像是把“respectable / despicable”中间的“pect-”误拆出来，再加上“-izable”（表示“可……的”）形成的，但英语里并没有这样一个常用、规范的词。","如果你把包含该词的句子发来（前后各一两句即可），我可以根据语境判断你真正想表达的是“值得尊敬的（respectable）”“可接受的（acceptable）”“可察觉的（perceptible）”还是其他词。"]}
{"word":"pectization","summary":{"en":"Pectization usually means the formation of a gel (sol → gel), especially in colloid chemistry; it can also refer to pectin-related changes in plants.","zh":"Pectization 通常指凝胶化（溶胶→凝胶），多见于胶体化学；也可指植物中与果胶相关的质地变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process of turning a liquid-like colloid (a sol) into a jelly-like state (a gel); gel formation.","zh":"（化学）使胶体溶胶（sol）转变为凝胶（gel）的过程；凝胶化。"},"examples":[{"en":"Adding salts can speed up pectization, causing the mixture to set into a gel.","zh":"加入盐类会加速 pectization，使混合物更快凝成胶状。"},{"en":"The lab report compared pectization times at different temperatures.","zh":"实验报告比较了不同温度下的 pectization（凝胶化）时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The formation or increase of pectic substances (related to pectin) in plant materials, which can change texture.","zh":"（较少见）植物材料中果胶相关物质（pectic substances）的生成或增加，会影响质地。"},"examples":[{"en":"During fruit ripening, changes linked to pectization can affect firmness.","zh":"水果成熟过程中，与 pectization 相关的变化会影响硬度。"}]}],"synonyms":["gelation","gelling","coagulation (context-dependent)"],"phonetic":"/ˌpɛktəˈzeɪʃən/","extraExplanation":["“Pectization”在现代英语里很少见，学术写作中更常看到更具体的词，如“gelation”（凝胶化）。","容易与“peptization”（肽化/胶溶：把沉淀重新分散成溶胶）混淆：peptization 是“变回溶胶、重新分散”，而 pectization 是“形成凝胶、变稠变固”。"]}
{"word":"pectize","summary":{"en":"“Pectize” means to gel or become jelly-like due to pectin, usually in fruit or plant material.","zh":"“pectize”指在果胶作用下发生胶凝，变成果冻状（多用于水果或植物材料）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry/food science) To form or convert into a jelly-like substance by the action of pectin; to gel (especially fruit juice or plant material).","zh":"（化学/食品科学）使在果胶作用下形成凝胶；使胶凝（尤指果汁或植物物质变成果冻状）。"},"examples":[{"en":"Heating the apple mixture helps it pectize and thicken into a gel.","zh":"加热苹果混合物会帮助它发生胶凝，变得更浓稠。"},{"en":"The juice didn’t pectize because it lacked enough natural pectin.","zh":"这果汁没有胶凝起来，因为天然果胶含量不够。"}]}],"synonyms":["gel","set","thicken","jell"],"phonetic":"/ˈpɛkˌtaɪz/","extraExplanation":["“pectize”很少见，多出现在食品加工或旧一点的化学/植物学资料里，常与“pectin（果胶）”相关。日常英语里更常说“gel / set / thicken（凝固/成型/变稠）”。","词源上与拉丁语 *pecten*（梳子）同源的词族有关，果胶早期研究中用来描述植物组织变成“胶状”的过程。"]}
{"word":"pectized","summary":{"en":"“Pectized” means made to gel/thicken by pectin, or treated with pectin (technical usage).","zh":"“pectized”指在果胶作用下凝胶化/变稠定型，或指经过果胶处理（偏技术用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical, food science) Past tense/past participle of “pectize”: made to form a gel or set by the action of pectin (as in jams and jellies).","zh":"（技术用语，食品科学）“pectize”的过去式/过去分词：在果胶（pectin）的作用下使液体凝胶化、凝固（如果酱/果冻变稠定型）。"},"examples":[{"en":"The fruit juice was pectized during heating, so it thickened into a gel.","zh":"果汁在加热过程中发生了果胶凝胶化（pectized），所以变稠成胶状。"},{"en":"If the mixture isn’t pectized, the jam may stay runny.","zh":"如果混合物没有凝胶化（pectized），果酱可能会一直很稀。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “pectize”: treated with pectin to improve texture or stability.","zh":"“pectize”的过去式/过去分词：用果胶处理过，以改善口感、稠度或稳定性。"},"examples":[{"en":"The sauce was pectized to give it a smoother, more stable texture.","zh":"这款酱汁用果胶处理过（pectized），让质地更顺滑、更稳定。"}]}],"synonyms":["gelled (with pectin)","set","thickened","stabilized"],"phonetic":"ˈpɛkˌtaɪzd","extraExplanation":["“pectized”非常少见，多出现在食品加工/实验记录里。更常见的表达是：set / gel / thicken with pectin（用果胶凝固/成胶/变稠）。","和“pectin（果胶）”相关：果胶在酸度（pH）与糖含量合适时更容易让果酱“定型”。如果酸或糖不足，成品就可能“流动、稀薄（runny）”。"]}
{"word":"pectizes","summary":{"en":"“Pectizes” means “turns into a gel/jelly,” usually because of pectin (common in jam-making; technical in chemistry).","zh":"“Pectizes”表示“（因果胶等作用而）成胶/凝固成果冻状”，多见于果酱制作或化学等技术语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(3rd-person singular: pectizes) To turn into a gel or jelly-like state, especially by forming or thickening with pectin (used in food science/chemistry).","zh":"（第三人称单数：pectizes）使（物质）凝胶化/成胶，尤指通过果胶的作用形成或增稠为果冻状（常用于食品科学/化学语境）。"},"examples":[{"en":"When you heat the fruit mixture with sugar, the pectin pectizes and the jam sets.","zh":"当你把水果混合物和糖一起加热时，果胶会使其成胶，果酱就会凝固。"},{"en":"This recipe pectizes quickly because the fruit is naturally high in pectin.","zh":"这个配方很快就能成胶，因为这种水果天然果胶含量高。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause tiny particles in a liquid to clump or set into a gel-like mass (a technical meaning in chemistry/materials).","zh":"使液体中的细小颗粒聚集并形成胶状团块/胶体（化学/材料学中的较技术性用法）。"},"examples":[{"en":"Under certain conditions, the solution pectizes and becomes more viscous.","zh":"在某些条件下，溶液会凝胶化并变得更黏稠。"}]}],"synonyms":["gels","sets","thickens","congeals"],"phonetic":"/ˈpɛk.taɪz/","extraExplanation":["“pectize”不是日常英语常用词，更常见的是食品场景里的表达：jam sets（果酱凝固）、thicken（变稠）、gel（成胶）。在写作或口语中，用这些更容易让一般读者理解。"]}
{"word":"pectizing","summary":{"en":"“Pectizing” means forming pectin or causing something (like fruit mixture) to gel/thicken by pectin.","zh":"“Pectizing”指果胶的形成，或通过果胶作用使混合物（如水果液）凝胶化、变稠并凝固。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) In chemistry or food science, to form or turn into pectin (a natural gelling substance found in fruit), or to thicken/jell by pectin.","zh":"（较少用）在化学或食品科学中，形成果胶（水果中的天然凝胶物质），或通过果胶作用使液体变稠/凝固成胶。"},"examples":[{"en":"Heating the fruit helps pectizing, so the jam sets more firmly.","zh":"加热水果有助于果胶化（pectizing），所以果酱会凝固得更结实。"},{"en":"In some recipes, adding acid supports pectizing and improves the gel texture.","zh":"在一些食谱里，加入酸能促进果胶化（pectizing），让凝胶口感更好。"}]}],"synonyms":["gelling","setting","thickening","jellifying"],"phonetic":"ˈpɛkˌtaɪzɪŋ","extraExplanation":["“pectizing”多见于专业语境（食品加工、果酱/果冻制作、胶体与多糖相关研究），日常英语里更常说“to gel”“to thicken”“to set (like jelly)”“pectin formation”。","更常见的相关词是“pectin”（果胶，名词）与“pectinize/pectinization”（果胶化）。如果你原本想查的是“peptizing/peptization”（使胶体分散、胶溶），那是另一组不同的化学术语。"]}
{"word":"pectocellulose","summary":{"en":"Pectocellulose is a pectin-and-cellulose material found in plant cell walls.","zh":"Pectocellulose 指植物细胞壁中由果胶与纤维素组成的复合物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant cell-wall material made of cellulose mixed with pectin (especially in primary cell walls).","zh":"（植物学）一种植物细胞壁物质，由纤维素与果胶混合组成（尤其常见于初生细胞壁）。"},"examples":[{"en":"Pectocellulose helps give young plant tissues both strength and flexibility.","zh":"pectocellulose 有助于让幼嫩植物组织同时具备强度与柔韧性。"},{"en":"In some textbook diagrams, pectocellulose is shown as cellulose fibers embedded in a pectin-rich matrix.","zh":"在一些教材示意图中，pectocellulose 被画成：纤维素纤维嵌在富含果胶的基质中。"}]}],"synonyms":["pectin–cellulose complex","cell-wall polysaccharide complex"],"phonetic":"ˌpɛktoʊˈsɛljəˌloʊs","extraExplanation":["这个词较偏专业，常见于植物解剖学/植物生理学语境。日常英语中很少用，更常见的相关词是 cell wall（细胞壁）、cellulose（纤维素）、pectin（果胶）。","词形可拆解理解：pecto- 表示“果胶（pectin）相关”，cellulose 表示“纤维素”。因此 pectocellulose 字面意思就是“果胶+纤维素的复合物”。"]}
{"word":"pectolite","summary":{"en":"Pectolite is a fibrous mineral; its rare blue form is called larimar.","zh":"pectolite（针钠钙石）是一种纤维状矿物；其罕见的蓝色品种称为海纹石（larimar）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral (a calcium sodium silicate) that usually forms in fibrous or needle-like crystals, often white to gray-green; a blue variety is known as larimar.","zh":"一种矿物（钙钠硅酸盐），通常呈纤维状或针状晶体，常见为白色到灰绿；其中蓝色品种常被称为“海纹石（larimar）”。"},"examples":[{"en":"Pectolite often grows in thin, fibrous crystals inside volcanic rocks.","zh":"针钠钙石常在火山岩中以细长的纤维状晶体生长。"},{"en":"Larimar is a rare blue variety of pectolite used in jewelry.","zh":"海纹石是一种罕见的蓝色针钠钙石，常用于珠宝。"}]}],"synonyms":["larimar (blue variety)","calcium sodium silicate (technical description)"],"phonetic":"/ˈpɛk.təˌlaɪt/","extraExplanation":["“pectolite”是地质与矿物学用词，日常英语中不常见，多出现在矿物鉴定、宝石市场（尤其提到“larimar/海纹石”时）或火山岩、热液蚀变等语境里。","词源可追溯到希腊语：pecto-（意为“梳理/梳子”，指其纤维状外观）+ -lite（“石/矿物”）。"]}
{"word":"pectora","summary":{"en":"A rare Latin plural meaning “chests,” often used poetically as “hearts/minds,” mainly seen in Latin quotations.","zh":"一个罕见的拉丁语复数，意为“胸膛”，诗意用法可指“人心/心灵”，多见于拉丁语引文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from Latin) “Pectora” is the plural of *pectus*, meaning “chests” or, in poetic writing, “hearts/minds” (people’s inner feelings). It sometimes appears in English texts when quoting Latin or using a Latin-style motto.","zh":"（罕见；源自拉丁语）“pectora”是 *pectus* 的复数，字面意思是“胸膛”；在诗歌或修辞中也可引申为“内心/心灵/情感”。在英语中多用于引用拉丁文或拉丁风格格言。"},"examples":[{"en":"The inscription used the Latin word *pectora* to suggest “hearts,” not just “chests.”","zh":"这段题词用了拉丁词 *pectora* 来表达“人心”，而不只是“胸膛”。"},{"en":"In some older poems, you may see *pectora* in a Latin quotation embedded in English.","zh":"在一些较老的诗歌里，你可能会看到英语中嵌入拉丁语引文，里面出现 *pectora*。"}]}],"synonyms":["(Latin) pectus (singular)","hearts (poetic sense)","minds (poetic sense)"],"phonetic":"/ˈpɛktərə/","extraExplanation":["“pectora”在现代英语里不是常用词；如果你是想查“胸肌/胸部的”，更常见的是 **pectoral**（形容词：胸部的；名词：胸肌/胸鳍等）或复数名词 **pectorals**（胸肌）。你可以告诉我你看到它的句子，我也能帮你判断应当是哪一个词。"]}
{"word":"pectoral","summary":{"en":"Pectoral means “related to the chest,” and it can also refer to the chest muscles or an item worn on the chest.","zh":"Pectoral 表示“与胸部有关”，也可指“胸肌”或“佩戴在胸前的饰物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the chest (especially the front of the chest).","zh":"与胸部有关的；（尤指）胸前的。"},"examples":[{"en":"He felt a sharp pectoral pain when he took a deep breath.","zh":"他深呼吸时感到胸部一阵尖锐的疼痛。"},{"en":"The doctor listened to her pectoral area with a stethoscope.","zh":"医生用听诊器听诊她的胸部区域。"}]},{"partOfSpeech":"n.","definition":{"en":"A pectoral muscle (one of the large chest muscles).","zh":"胸肌（胸部的大块肌肉之一）。"},"examples":[{"en":"Push-ups can strengthen your pectorals.","zh":"俯卧撑可以增强你的胸肌。"},{"en":"His left pectoral was sore after the workout.","zh":"锻炼后他的左侧胸肌很酸痛。"}]},{"partOfSpeech":"n.","definition":{"en":"A decorative or symbolic item worn on the chest (often in religious or ceremonial contexts).","zh":"胸饰；胸前佩戴的装饰品或象征物（常见于宗教或仪式场合）。"},"examples":[{"en":"In some traditions, a priest may wear a pectoral cross.","zh":"在一些传统中，神职人员可能会佩戴胸前十字架。"}]}],"synonyms":["chest (adj.)","thoracic (more medical)","pecs (informal, muscles)"],"phonetic":"/ˈpɛktərəl/","extraExplanation":["“Pectoral”来自拉丁语 pectus（胸部）。在健身语境里常用复数“pectorals”或缩写“pecs”，指胸大肌等胸部肌群。","宗教/艺术语境中的“pectoral”常指佩戴在胸前的饰物，如“pectoral cross（胸前十字架）”；在古埃及文化中也有著名的胸饰（胸牌/项胸饰）用于象征身份与守护。"]}
{"word":"pectorales","summary":{"en":"“Pectorals” usually means the chest muscles; “pectoral” can also mean “related to the chest,” and in religious contexts it can refer to a chest-worn item like a pectoral cross.","zh":"“pectorals”通常指胸肌；“pectoral”也可表示“胸部的”；在宗教语境中还可指佩戴在胸前的饰物，如胸前十字架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chest muscles (especially the large chest muscles used for pushing and lifting); short for “pectoral muscles.”","zh":"胸肌（尤其是用来推、举时发力的大片胸部肌肉）；“pectoral muscles”的简称。"},"examples":[{"en":"Push-ups are great for building your pectorals.","zh":"俯卧撑很适合锻炼胸肌。"},{"en":"He felt soreness in his pectorals after the workout.","zh":"锻炼后他感觉胸肌酸痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the chest (used as an adjective: “pectoral”).","zh":"胸部的；与胸部有关的（作形容词用：pectoral）。"},"examples":[{"en":"The doctor listened to her pectoral area for breathing sounds.","zh":"医生听诊她的胸部区域以检查呼吸音。"},{"en":"Some birds have strong pectoral muscles for flight.","zh":"有些鸟类的胸肌很发达，便于飞行。"}]},{"partOfSpeech":"n.","definition":{"en":"a religious object worn on the chest, especially a “pectoral cross.”","zh":"佩戴在胸前的宗教饰物（尤指“胸前十字架”）。"},"examples":[{"en":"The bishop wore a pectoral cross during the ceremony.","zh":"主教在仪式中佩戴了胸前十字架。"}]}],"synonyms":["chest muscles","pecs","pectoralis (major/minor)"],"phonetic":"/ˈpɛktərəlz/","extraExplanation":["“pectorales”看起来像西班牙语的复数形式（=英语的 “pectorals”）。英语里更常见的拼写是：名词复数“pectorals”（胸肌），或形容词“pectoral”（胸部的）。","词根来自拉丁语 pectus（胸、胸腔），所以医学/解剖语境里也常出现，如 pectoral fin（胸鳍）、pectoral girdle（胸带/肩带）。"]}
{"word":"pectoralgia","summary":{"en":"Pectoralgia is a medical term meaning chest pain.","zh":"pectoralgia 是医学用语，意思是“胸痛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain in the chest (especially in the pectoral/chest region); chest pain.","zh":"胸部疼痛（尤指胸肌/胸前区域的疼痛）；胸痛。"},"examples":[{"en":"The patient reported pectoralgia that worsened when taking deep breaths.","zh":"患者表示有胸部疼痛，深呼吸时会加重。"},{"en":"Because pectoralgia can have serious causes, the doctor ordered an ECG.","zh":"由于胸痛可能有严重原因，医生安排了心电图检查。"}]}],"synonyms":["chest pain","pectoralgia (medical)","pectoral pain","thoracic pain"],"phonetic":"/ˌpɛk.tɚˈæl.dʒə/","extraExplanation":["这是一个较少见、偏医学书面语的词，更常见的临床说法是 chest pain（胸痛）或 pectoral pain（胸前/胸肌疼痛）。","词源：pecto- 来自拉丁语 pectus（胸部），-algia 来自希腊语 algos（疼痛）。很多医学词都有 -algia（如 neuralgia 神经痛、myalgia 肌痛）。","学习提醒：出现“胸痛/胸闷/压榨感”“呼吸困难”“出汗”“恶心”或疼痛放射到左臂/下颌等情况，应及时就医；英语交流中可直接说 “I have chest pain.” 更自然。"]}
{"word":"pectoralis","summary":{"en":"Pectoralis means a chest muscle, especially the pectoralis major.","zh":"pectoralis 指胸部的胸肌，尤其常指胸大肌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of the two large chest muscles (especially the pectoralis major) that help move the shoulder and arm.","zh":"胸大肌/胸肌之一（尤其指胸大肌），位于胸前，帮助肩部与手臂运动。"},"examples":[{"en":"Push-ups mainly work the pectoralis muscles in your chest.","zh":"俯卧撑主要锻炼胸部的胸肌。"},{"en":"He strained his pectoralis while bench-pressing.","zh":"他在卧推时拉伤了胸肌。"}]}],"synonyms":["chest muscle","pec (informal)","pectoralis major","pectoralis minor"],"phonetic":"/ˌpɛk.təˈræl.ɪs/","extraExplanation":["在健身语境里，人们常把 pectoralis 简称为 pec（复数 pecs），例如：“I’m training my pecs today.”（今天练胸。）","解剖学上常见的两块相关肌肉是 pectoralis major（胸大肌）和 pectoralis minor（胸小肌）。日常对话里提到“胸肌”通常主要指胸大肌。"]}
{"word":"pectoralist","summary":{"en":"A (rare) term for someone who favors chest-based breathing or “chest voice,” especially in singing/speaking.","zh":"（较少见）指偏好胸式呼吸或偏用“胸声”的人，常用于歌唱/朗诵语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who emphasizes or advocates using the chest (pectorals) in breathing or voice production, especially in singing or speech (i.e., relying on “chest voice”).","zh":"强调或主张在呼吸或发声中更多使用胸部（胸廓/胸肌）的人，尤指歌唱或说话时偏向使用“胸声”。"},"examples":[{"en":"Some teachers warned that an extreme pectoralist approach can strain the voice.","zh":"有些老师提醒，过度偏向胸声的“胸声派”方法可能会伤嗓子。"},{"en":"As a pectoralist, he tried to keep the tone low and resonant in his chest.","zh":"作为偏向胸声的人，他努力把音色保持得更低、更有胸腔共鸣。"}]}],"synonyms":["chest-voice singer","chest-dominant vocalist","advocate of chest breathing"],"phonetic":"ˈpɛktərəlɪst","extraExplanation":["这个词比较少见，通常出现在较旧的声乐/朗诵讨论里。词根来自拉丁语 pectus（胸部）。在现代教学中更常见的说法是 chest voice（胸声）或 chest-dominant technique（胸声占主导的技巧）。学习发声时一般会强调“胸声/头声（head voice）/混声（mixed voice）”的平衡，而不是单纯做“pectoralist（只偏胸声）”。"]}
{"word":"pectorally","summary":{"en":"“Pectorally” means “in a way related to the chest,” usually in formal or medical writing.","zh":"“pectorally”表示“在胸部方面/以与胸部有关的方式”，多用于正式或医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the chest (especially in medical or anatomical contexts).","zh":"（尤用于医学或解剖语境）以与胸部有关的方式；在胸部方面。"},"examples":[{"en":"The pain was felt pectorally, spreading across the front of his chest.","zh":"疼痛在胸部位置被感到，并扩散到胸前。"},{"en":"The doctor examined him pectorally to check for breathing and heart sounds.","zh":"医生从胸部方面为他做检查，以确认呼吸与心音情况。"}]}],"synonyms":["in the chest","chest-wise","thoracically"],"phonetic":"/ˈpɛk.tə.rə.li/","extraExplanation":["“pectorally”来自拉丁语 *pectus*（胸、胸部）。在现代英语中多见于医学/解剖或较正式的写作里；日常表达更常用 “in the chest / in his chest / chest-related”。","相关词：*pectoral*（adj. 胸部的；n. 胸肌/胸鳍），例如 *pectoralis major*（胸大肌）。"]}
{"word":"pectorals","summary":{"en":"“Pectorals” most commonly means the chest muscles (the pecs).","zh":"“pectorals”最常指胸肌（俗称“胸大肌/胸肌群”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The chest muscles, especially the large paired muscles (pectoralis major) at the front of the chest.","zh":"胸肌；尤其指胸前一对较大的肌肉（胸大肌）。"},"examples":[{"en":"Push-ups are a simple exercise to strengthen your pectorals.","zh":"俯卧撑是强化胸肌的简单训练。"},{"en":"He felt soreness in his pectorals after the workout.","zh":"训练后他感觉胸肌酸痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the chest (used mainly in anatomy/medicine).","zh":"胸部的；与胸相关的（多用于解剖学/医学语境）。"},"examples":[{"en":"The doctor listened to his pectoral area with a stethoscope.","zh":"医生用听诊器听了他的胸部区域。"}]}],"synonyms":["pecs","chest muscles","pectoralis muscles"],"phonetic":"/ˈpɛktərəlz/","extraExplanation":["“Pectorals”在健身语境里通常指胸肌（尤其是胸大肌），而不是泛指“胸部”。常见搭配：build/strengthen pectorals（练胸）、tight/weak pectorals（胸肌紧/弱）。","词源来自拉丁语 pectus（胸）。在解剖学中你也会看到：pectoral fin（鱼的胸鳍）、pectoral girdle（肩带/胸带）。"]}
{"word":"pectoriloque","summary":{"en":"A rare (French-derived) word meaning “ventriloquist; a person who seems to speak from the chest/elsewhere.”","zh":"一个罕见的（源自法语的）词，指“腹语师/移声表演者；似乎从胸腔或别处发声的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from French) A person who seems to speak from the chest or another place in the body rather than from the mouth; an old/learned term for a ventriloquist.","zh":"（罕见；源自法语）指“像是从胸腔或身体其他部位发声的人”；一种较古老/书面化的说法，近似“腹语师/口技表演者”。"},"examples":[{"en":"In the novel, the pectoriloque unsettles the crowd by throwing his voice into the shadows.","zh":"小说里，这位“pectoriloque”用移声把声音投向阴影，让人群不安。"},{"en":"Most modern writers would simply say “ventriloquist” instead of pectoriloque.","zh":"大多数现代作者会直接说“ventriloquist（腹语师）”，而不会用 pectoriloque。"}]}],"synonyms":["ventriloquist","voice-thrower","dummy speaker"],"phonetic":"/pɛkˈtɔrɪˌloʊk/","extraExplanation":["词源上可拆为拉丁语 pectus（胸）+ loqui（说话）。因此它强调“胸腔发声/胸语”的感觉，而现代英语更常用 ventriloquist（字面偏向“腹部说话的人”）。","在英语中 pectoriloque 非常少见，更多会出现在法语语境、文学作品、或讨论“移声/腹语”历史的文字里。"]}
{"word":"pectoriloquial","summary":{"en":"Pectoriloquial describes a deep, chest-resonant way of speaking (a voice that seems to come from the chest).","zh":"pectoriloquial 用来形容说话声音低沉、带胸腔共鸣，仿佛从胸腔发出的发声方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Speaking with a voice that seems to come from the chest; having a deep, chesty quality.","zh":"（罕用）指说话时声音仿佛从胸腔发出；带有低沉、胸腔共鸣的音质。"},"examples":[{"en":"The actor adopted a pectoriloquial tone to sound older and more authoritative.","zh":"这位演员采用了胸腔共鸣、低沉的说话语气，让自己听起来更年长、更有权威感。"},{"en":"Her pectoriloquial voice carried easily across the hall without shouting.","zh":"她低沉的胸腔共鸣嗓音不用喊也能传遍大厅。"}]}],"synonyms":["chesty","deep-voiced","resonant","sonorous"],"phonetic":"/ˌpɛk.tə.ri.loʊˈkwi.əl/","extraExplanation":["这个词非常少见，主要出现在较正式或学术性的语境中，用来描述“胸腔发声/胸声”的感觉。","词源上可拆为拉丁语 pectus（胸）+ loqui（说话），字面意思就是“从胸部说话”。","日常英语里更常用的表达是 chesty voice（胸腔共鸣的嗓音）、deep voice（低沉嗓音）、resonant voice（共鸣感强的嗓音）。"]}
{"word":"pectoriloquism","summary":{"en":"Pectoriloquism is a medical term for unusually clear voice sounds heard through the chest with a stethoscope, often linked to lung consolidation.","zh":"Pectoriloquism 是医学术语，指听诊时胸部对语音的传导异常清晰，常与肺实变（如肺炎）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Abnormally clear transmission of a patient’s spoken voice sounds heard through a stethoscope over the chest, often suggesting lung consolidation (e.g., pneumonia).","zh":"（医学）用听诊器在胸部听到患者说话的声音异常清晰地传导出来，常提示肺实变（如肺炎）。"},"examples":[{"en":"On auscultation, the clinician noted pectoriloquism over the right lower lobe, raising concern for pneumonia.","zh":"听诊时，医生在右下肺叶听到明显的胸语音增强（pectoriloquism），因此怀疑肺炎。"},{"en":"Pectoriloquism, together with dullness to percussion, can point to consolidation in the lung.","zh":"胸语音增强（pectoriloquism）若合并叩诊浊音，可能提示肺部实变。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Speaking in a way that seems to come from the chest; a term sometimes treated as a variant of “pectoriloquy.”","zh":"（罕见）一种听起来像“从胸腔发声”的说话方式；有时被当作 pectoriloquy（胸语音）的变体用法。"},"examples":[{"en":"The text uses “pectoriloquism” as a variant spelling of pectoriloquy in describing voice sounds in the chest.","zh":"该文本在描述胸部语音传导时，用“pectoriloquism”作为 pectoriloquy 的拼写变体。"}]}],"synonyms":["pectoriloquy (variant/closely related)","whispered pectoriloquy (related sign)"],"phonetic":"/pɛkˌtɔrɪˈloʊkwɪzəm/","extraExplanation":["这个词最常见于医学体格检查（胸部听诊）。它描述的是医生把听诊器放在胸壁上时，病人的“说话声”在某些区域听起来异常清楚，常与肺炎等导致“肺实变/致密化”的情况相关。","不要和 ventriloquism（腹语术/口技：让声音听起来像从别处发出）混淆。ventriloquism 属于表演艺术；pectoriloquism/pectoriloquy 属于临床体征。"]}
{"word":"pectoriloquous","summary":{"en":"Pectoriloquous means speaking or sounding as if the voice comes from the chest—deep and resonant.","zh":"pectoriloquous 指“从胸腔发出”的声音或说话方式，通常给人低沉、浑厚、有共鸣的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a voice or speech) coming from the chest; deep and resonant in sound.","zh":"（指声音或说话）从胸腔发出；低沉而浑厚的。"},"examples":[{"en":"His pectoriloquous voice carried across the room without a microphone.","zh":"他那浑厚的胸腔音不用麦克风也能传遍整个房间。"},{"en":"The actor practiced a pectoriloquous tone to sound older and more serious.","zh":"那位演员练习用低沉浑厚的胸腔音，好让自己听起来更年长、更严肃。"}]}],"synonyms":["deep-voiced","resonant","sonorous","chest-voiced"],"phonetic":"/ˌpɛk.təˈrɪl.kwəs/","extraExplanation":["这是一个非常少见、偏文学/学术的词，日常英语里几乎不用。更常见的表达是 deep voice（低沉的嗓音）、resonant voice（有共鸣的嗓音）、chest voice（胸声/胸腔发声）。","词源可拆为 pector-（胸，来自拉丁语 pectus）+ -loquous（说话的，来自 loqui“说”）。因此字面意思就是“从胸部发声/说话”。"]}
{"word":"pectoriloquy","summary":{"en":"Pectoriloquy means deep, chest-based or hearty speech (a rare, often humorous word).","zh":"Pectoriloquy 指“从胸腔发出”的低沉有力或发自胸臆的讲话（较少见、常带幽默色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Speech that seems to come “from the chest” rather than the throat; deep, hearty, or strongly voiced talking (often a humorous or rare word).","zh":"（似乎）从胸腔发出的说话声；低沉、有力、发自胸臆的讲话（多为幽默或较少见用词）。"},"examples":[{"en":"After a long run, his pectoriloquy sounded rough and breathy, like the words were pushed up from his chest.","zh":"长跑之后，他的“胸语”听起来又粗又喘，仿佛话是从胸腔里硬挤上来的。"},{"en":"The actor practiced pectoriloquy to make the character’s voice feel bigger and more commanding.","zh":"那位演员练习“胸语”，让角色的声音更宏大、更有威势。"},{"en":"In a joking tone, she called his dramatic speech a bit of pectoriloquy.","zh":"她半开玩笑地说，他那段戏剧化的演讲有点“胸语”味。"}]}],"synonyms":["chest voice","deep-voiced speech","hearty speech","booming speech"],"phonetic":"/ˌpɛk.təˈrɪl.kwɪ/","extraExplanation":["这是一个非常少见、偏书面/玩笑式的词，来自拉丁语词根：pectus（胸）+ loqui（说话）。它强调“声音从胸腔发出”的感觉，常用来形容低沉有力或夸张的发声方式。日常英语里通常会用 deep voice / chest voice / hearty speech 等更常见的表达。"]}
{"word":"pectoris","summary":{"en":"Pectoris is a medical-Latin form meaning “of the chest,” seen mostly in phrases like angina pectoris.","zh":"Pectoris 是医学拉丁语形式，意思是“胸部的/属于胸部的”，多见于 angina pectoris（心绞痛）等固定短语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Medical Latin) “of the chest” (a genitive form meaning something belongs to or affects the chest), used mainly in set medical phrases.","zh":"（医学拉丁语）“胸的 / 属于胸部的”（属格形式，表示与胸部相关或发生在胸部），主要用于固定医学短语中。"},"examples":[{"en":"Angina pectoris is chest pain caused by reduced blood flow to the heart.","zh":"Angina pectoris（心绞痛）是由于心脏供血减少引起的胸痛。"},{"en":"In older medical terms, pectoris helps specify that the problem is in the chest area.","zh":"在较旧的医学术语中，pectoris 用来说明问题发生在胸部区域。"}]}],"synonyms":["thoracic","of the chest"],"phonetic":"/pɛkˈtɔrɪs/","extraExplanation":["“pectoris”本身不是常见英语单词，更像是“借用的拉丁语形式”，最常见的固定搭配是 angina pectoris（心绞痛，字面是“胸部的绞痛/疼痛”）。","语法小提示：它来自拉丁语 pectus（胸部），pectoris 是属格，常理解为“……的”。类似结构在医学命名中很常见，用来精确指明部位。","现代英语中如果要直接说“胸部的/胸廓的”，更常用 thoracic（胸部的）或 chest (adj.) 来表达。"]}
{"word":"pectosase","summary":{"en":"Pectosase is a rare term for an enzyme that breaks down pectin; usually called pectinase.","zh":"Pectosase 是“分解果胶的酶”的罕用说法，通常称为 pectinase（果胶酶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (rare) name for an enzyme that breaks down pectin (a substance in plant cell walls), often used in fruit-juice making and plant-tissue processing; more commonly called pectinase","zh":"（罕用）一种分解果胶（植物细胞壁中的物质）的酶名，常用于果汁加工或植物组织处理；更常见的名称是 pectinase（果胶酶）"},"examples":[{"en":"Pectosase can help clarify apple juice by breaking down pectin.","zh":"Pectosase 可以通过分解果胶来帮助澄清苹果汁。"},{"en":"The lab tested different enzyme mixes, including pectosase, to soften plant tissue.","zh":"实验室测试了不同的酶混合物（包括 pectosase）来软化植物组织。"}]}],"synonyms":["pectinase","pectase"],"phonetic":"/pɛkˈtoʊseɪs/","extraExplanation":["“pectosase”在现代英语里很少见，很多教材与产品说明更常用“pectinase（果胶酶）”。如果你是在食品加工、酿造或生物实验的语境里看到它，基本可以理解为“分解果胶的酶”。","拼写也容易混淆：有人会把它误写成与发音相近的形式。若你能提供一句原文或出处（论文/产品标签），我可以帮你确认是否就是“pectinase”。"]}
{"word":"pectose","summary":{"en":"Pectose is an early, less soluble form of pectin in plant cell walls, common in unripe fruit, that can convert into pectin as fruit ripens.","zh":"Pectose指植物细胞壁中的果胶前体/不溶性形态，常见于未成熟水果，成熟过程中可转变为果胶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant substance (an early or insoluble form of pectin) found in cell walls, especially in unripe fruit; it can turn into pectin as fruit ripens, helping fruit soften and form gels.","zh":"一种存在于植物细胞壁中的物质（果胶的早期/不溶性形态），常见于未成熟水果；随着果实成熟可转变为果胶，使果肉变软并参与形成凝胶。"},"examples":[{"en":"Unripe apples contain more pectose, which can change into pectin as the fruit ripens.","zh":"未成熟的苹果含有较多的pectose，随着成熟它可以转变为果胶。"},{"en":"In food science, pectose is discussed when explaining why fruit texture changes during ripening.","zh":"在食品科学中，讲到水果成熟时质地变化的原因，常会提到pectose。"}]}],"synonyms":["protopectin","pectic substance (broad)"],"phonetic":"/ˈpɛk.toʊs/","extraExplanation":["“pectose”是较旧或较少见的术语，现代更常用“protopectin（原果胶）”或直接用“pectin（果胶）”来描述相关物质。","词根来自“pect- / pectin”，与“凝固、胶化（forming a gel）”的概念有关，因此常出现在食品加工、果酱/果冻凝胶原理等语境中。"]}
{"word":"pectosic","summary":{"en":"Pectosic means “related to pectose/pectin-like substances in plants,” and it’s rare and technical.","zh":"pectosic 指“与植物中的果胶前体/类果胶物质有关”，属于罕见的专业用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Relating to pectose or pectin-like substances found in plant cell walls; used in chemistry/biology contexts.","zh":"（罕见/专业用语）与果胶前体（pectose）或类似果胶的物质有关的；多用于化学/生物学语境。"},"examples":[{"en":"Some older chemistry texts describe the pectosic materials in unripe fruit as changing during ripening.","zh":"一些较早的化学教材会把未成熟水果中的“pectosic（果胶前体相关）”物质描述为在成熟过程中发生变化。"},{"en":"The report mentions pectosic compounds in plant tissues, though modern papers usually say “pectic” or “pectin-related.”","zh":"报告提到植物组织中的 pectosic 化合物，不过现代论文通常写作“pectic（果胶的）”或“pectin-related（与果胶相关的）”。"}]}],"synonyms":["pectic","pectinous","pectin-related"],"phonetic":"/pɛkˈtoʊsɪk/","extraExplanation":["“pectosic”在现代英语里非常少见，更多见于早期/旧式的化学与植物学写法；现在更常用的是 pectic（果胶的）、pectinous（含果胶的）或直接说 pectin-related。","词根与 pectin（果胶）同源：来自希腊语 pektós，意为“凝结的、凝固的”，因为果胶能使果酱等食物“凝胶化”。"]}
{"word":"pectosinase","summary":{"en":"Pectosinase is an enzyme used to break down pectin in plant materials, often to clarify juices and wines.","zh":"Pectosinase（果胶酶）是一种分解植物材料中果胶的酶，常用于澄清果汁和葡萄酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (usually a type of pectinase) that breaks down pectin, a natural substance in plant cell walls; used to soften plant tissues and to clarify fruit juices and wines","zh":"果胶酶（常指一类果胶分解酶）：一种分解果胶（存在于植物细胞壁中的天然物质）的酶；常用于软化植物组织、澄清果汁和葡萄酒"},"examples":[{"en":"Pectosinase is added during juice making to reduce cloudiness and improve filtration.","zh":"在制汁过程中会加入果胶酶，以减少浑浊并改善过滤效果。"},{"en":"The lab used pectosinase to help break down plant tissue before extracting DNA.","zh":"实验室用果胶酶先分解植物组织，再提取 DNA。"}]}],"synonyms":["pectinase","pectolytic enzyme"],"phonetic":"/pɛkˈtoʊsɪˌneɪs/","extraExplanation":["“pectosinase”在现代英语里不如“pectinase（果胶酶）”常见，很多场合两者几乎可以互换使用。实际应用中它可能指能分解果胶的酶制剂，常用于果汁/葡萄酒澄清（减少胶体浑浊、降低黏度、加快沉降与过滤）。","词源可拆解理解：pecto-（果胶 pectin）+ -inase（表示分解某种物质的酶）。学习时可把它当作“能分解果胶的酶”。"]}
{"word":"pectous","summary":{"en":"Pectous is a rare adjective meaning “of the chest; pectoral.”","zh":"pectous 是个很罕用的形容词，意思是“胸部的；与胸膛有关的”（相当于 pectoral）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to the chest or breast; pectoral.","zh":"（罕用）与胸部、胸膛有关的；胸部的（相当于 pectoral）。"},"examples":[{"en":"The poet described a pectous pain that tightened his chest.","zh":"诗人描写了一种胸口发紧的胸部疼痛。"},{"en":"In older medical writing, you may see pectous used for conditions affecting the chest.","zh":"在较老的医学写作中，你可能会看到 pectous 用来指影响胸部的病症。"}]}],"synonyms":["pectoral","thoracic"],"phonetic":"/ˈpɛktəs/","extraExplanation":["“pectous”在现代英语中几乎不用，很多读者会认为它是拼写错误或非标准用法。更常见、更自然的词是 **pectoral**（胸部的）或名词 **pectus**（胸部/胸膛，常见于 *pectus excavatum*）。","词根来自拉丁语 **pectus**（胸、胸膛）。如果你是在某篇文章/医学资料里看到它，通常可按“与胸部有关”来理解。"]}
{"word":"pectron","summary":{"en":"“pectron” is not a common English word; it’s likely a typo or a proper name.","zh":"“pectron”不是常见英语单词；更可能是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a name (e.g., a brand, product, username).","zh":"不是常见英语词典里的标准单词；更可能是拼写错误，或某个名称（如品牌、产品名、用户名）。"},"examples":[{"en":"I couldn’t find “pectron” in a dictionary—could you share the full sentence?","zh":"我在词典里找不到“pectron”——你能提供完整句子吗？"},{"en":"If you meant “spectrum,” the spelling is different.","zh":"如果你想写的是“spectrum（光谱/范围）”，拼写会不一样。"}]}],"phonetic":"/ˈpɛk.trɑn/","extraExplanation":["“pectron”很可能是你打错了字。常见的接近词包括：\n- spectrum（光谱；范围）：如 a wide spectrum of opinions（广泛的观点范围）\n- electron（电子）：物理/化学常用\n- pectin（果胶）：食品/烘焙常用\n\n把它放进原句里，我可以帮你判断最可能的目标词并解释用法。"]}
{"word":"pectunculate","summary":{"en":"Pedunculate means “having a stalk (peduncle),” used mainly in biology and botany.","zh":"Pedunculate 指“有梗（花梗/果梗/柄）的”，多用于生物和植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Botany) Having a peduncle; growing on or attached by a stalk (for example, a flower or fruit on a stem).","zh":"（生物/植物）具花梗（果梗）的；通过“梗/柄”连接或生长在梗上的（如花或果实长在一段柄上）。"},"examples":[{"en":"The tomato is pedunculate, attached to the plant by a short stalk.","zh":"番茄是有果梗的，通过一段短柄连接在植株上。"},{"en":"Some fungi have pedunculate caps that rise on a slender stem.","zh":"有些真菌的菌盖是有柄的，长在细长的菌柄上。"}]}],"synonyms":["stalked","stemmed"],"phonetic":"/pɪˈdʌŋkjəˌleɪt/","extraExplanation":["“pectunculate”在英语里不常见，通常被认为是拼写错误；你可能想查的是 pedunculate（有梗的）。","词源上，peduncle 表示“花梗/果梗/柄”，来自拉丁语 pedunculus（小脚/小柄），所以 pedunculate 常用于描述“带柄连接”的结构。"]}
{"word":"pectunculus","summary":{"en":"Pectunculus is an older scientific genus name for certain clams, now often classified as Glycymeris.","zh":"Pectunculus 是某些蛤/贝的旧属名，如今多归入 Glycymeris。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A scientific genus name once used for certain bivalve mollusks (clams); in many modern classifications these species are placed in the genus Glycymeris.","zh":"（生物）曾用来指某些双壳类软体动物（蛤/贝）的属名；在许多现代分类中，这些物种多被归入 Glycymeris（甜蛤属/糖蛤属）。"},"examples":[{"en":"Older field guides may list the bittersweet clam under Pectunculus rather than Glycymeris.","zh":"较早的野外图鉴可能把“甜蛤/糖蛤”（bittersweet clam）写作 Pectunculus，而不是 Glycymeris。"},{"en":"The museum label uses the historical name Pectunculus, with the updated name in parentheses.","zh":"博物馆标签使用了历史名称 Pectunculus，并在括号里标出更新后的名称。"}]}],"synonyms":["Glycymeris (modern genus name)"],"phonetic":"/pɛkˈtʌŋkjələs/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语中很少使用，更多见于旧版生物分类、贝类学（conchology）资料或博物馆藏品标签。","词源上与拉丁语 pecten（“扇贝/栉/梳状物”）有关，暗示贝壳有放射状的纹理；-culus 是常见的指小或亲昵的后缀。","分类学会随研究更新而调整，所以你可能在不同资料里看到 Pectunculus 被视为“旧名/异名”，而现行名称常写作 Glycymeris。"]}
{"word":"pectus","summary":{"en":"“Pectus” is a medical/anatomy term meaning the chest or breast.","zh":"“pectus”是医学/解剖学用语，意思是“胸部/胸廓”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, medical) The chest or breast; the front part of the torso that contains the heart and lungs.","zh":"（解剖/医学）胸部；胸廓前部（包含心肺的部位）。"},"examples":[{"en":"In anatomy class, we studied the muscles of the pectus (chest).","zh":"在解剖课上，我们学习了胸部（pectus）的肌肉。"},{"en":"The doctor examined the patient’s pectus to check breathing and heart sounds.","zh":"医生检查了患者的胸部（pectus），以评估呼吸和心音。"}]}],"synonyms":["chest","thorax","breast (less formal in anatomy)"],"phonetic":"ˈpɛk.təs","extraExplanation":["“pectus”源自拉丁语，常见于医学或解剖学语境，在日常英语里更常用“chest”。","你可能会在疾病名称中见到它：\n- pectus excavatum：漏斗胸（胸骨向内凹）\n- pectus carinatum：鸡胸（胸骨向外凸）","在古典/文学语境中，拉丁语“pectus”也可引申为“内心、胸怀、勇气”等，但英语中通常不会直接用“pectus”表达这些意思。"]}
{"word":"peculatation","summary":{"en":"Speculation means guessing or theorizing without enough facts; it can also mean risk-taking investment to profit from price changes.","zh":"speculation 指在证据不足时的推测/猜想；也可指为从价格波动中获利而进行的投机性投资。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of forming ideas or guesses about something without enough facts; a theory based on incomplete information","zh":"在缺乏充分事实时进行的推测；基于不完整信息的看法/理论"},"examples":[{"en":"There’s a lot of speculation about why the company’s CEO resigned.","zh":"大家对这家公司CEO辞职的原因有很多猜测。"},{"en":"Everything you’ve said so far is speculation, not proof.","zh":"你目前说的都只是推测，不是证据。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity of risking money in order to profit from changes in prices (such as stocks, currency, or real estate)","zh":"投机（为从价格波动中获利而承担风险的投资活动，如股票、外汇或房产）"},"examples":[{"en":"The new rules are meant to reduce speculation in the housing market.","zh":"新规定旨在减少房地产市场的投机行为。"},{"en":"He made money through currency speculation.","zh":"他靠外汇投机赚了钱。"}]},{"partOfSpeech":"n.","definition":{"en":"public talk or rumors about possible events, especially in politics or entertainment","zh":"（尤指政治或娱乐领域的）传言；外界的猜测性议论"},"examples":[{"en":"The actor’s silence only fueled speculation online.","zh":"这位演员的沉默反而助长了网上的各种猜测。"}]}],"synonyms":["guesswork","conjecture","theory","rumor","surmise","(financial) trading","(financial) speculation"],"phonetic":"/ˌspɛkjəˈleɪʃən/","extraExplanation":["你输入的“peculatation”很可能是拼写错误；常见目标词是 **speculation**（推测/投机）。拼写要点：开头是 **spec-**，结尾是 **-tion**。","容易混淆的另一个词是 **peculation**（/ˌpɛkjəˈleɪʃən/），意思是“贪污、挪用公款”，含义完全不同；写作时要特别注意别写错。"]}
{"word":"peculatations","summary":{"en":"Peculation means embezzlement—stealing money you were trusted to manage.","zh":"peculation 指“侵吞/挪用公款（受托管理的钱）”，即贪污侵占。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of stealing money that you are responsible for (especially money from an employer or organization); embezzlement","zh":"（尤指从雇主或机构）侵吞、挪用公款；贪污（的一种）"},"examples":[{"en":"The accountant was arrested for peculation of company funds.","zh":"那名会计因挪用公司资金而被捕。"},{"en":"An audit revealed years of peculation in the department.","zh":"审计发现该部门多年来一直存在侵吞公款的行为。"}]}],"synonyms":["embezzlement","misappropriation","fraud"],"phonetic":"/ˌpɛkjəˈleɪʃən/","extraExplanation":["你输入的“peculatations”不是标准拼写。最接近的正确词通常是 **peculation**（侵吞、挪用公款）或其复数 **peculations**。","很多学习者也会把它和 **speculation**（猜测；投机）混淆：\n- *speculation* 侧重“推测/臆测”或“投机买卖”\n- *peculation* 侧重“利用职务之便侵吞钱款”（法律/正式语境常见）"]}
{"word":"peculate","summary":{"en":"“Peculate” means to embezzle or steal money you are trusted to handle, often in an official or legal context.","zh":"“peculate”指侵吞/挪用受托管理的钱，常见于正式或法律语境，尤其涉及公款。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to steal money (especially public money or money you are trusted to manage); to embezzle","zh":"侵吞（尤指公款或受托管理的钱）；挪用公款"},"examples":[{"en":"The accountant was arrested for peculating company funds.","zh":"那名会计因侵吞公司资金被逮捕。"},{"en":"Several officials were accused of peculating from the public budget.","zh":"几名官员被指控从公共预算中侵吞资金。"}]}],"synonyms":["embezzle","misappropriate","steal"],"phonetic":"/ˈpɛkjəˌleɪt/","extraExplanation":["“peculate”较正式、偏法律语境，日常英语里更常用“embezzle（挪用/侵吞）”或“steal（偷）”。","词源来自拉丁语“peculatus”（侵吞公款），与“pecuniary（钱财的）”同源；更早可追溯到“pecu-（牲畜）”，反映古代财富常以牲畜计量。"]}
{"word":"peculated","summary":{"en":"“Peculated” means “embezzled or misused entrusted money or property” (a rare, formal word).","zh":"“peculated”意为“侵吞/挪用受托的钱或财物”（较罕见、较正式的用词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To steal or misuse money or property that you are trusted to manage; to embezzle.","zh":"（罕见）侵吞、挪用受托管理的钱或财物；贪污。"},"examples":[{"en":"The accountant was caught peculating funds from the company.","zh":"那名会计被发现侵吞公司的资金。"},{"en":"The report accused the official of peculating public money.","zh":"报告指控那名官员挪用公款。"}]}],"synonyms":["embezzled","misappropriated","stole","diverted"],"phonetic":"/ˈpɛkjəˌleɪtɪd/","extraExplanation":["“peculated”是动词“peculate”的过去式/过去分词，但这个词在现代英语里非常少见，更多出现在法律或正式文书中，意思接近“embezzle（侵吞/挪用）”。","很多学习者看到“peculated”其实是在找“speculated（推测）”。如果你的意思是“推测/猜测”，通常应写作“speculated”。","词源来自拉丁语“peculatus”，与“pecuniary（与金钱有关的）”同源，核心含义都与“钱财/私产”有关。"]}
{"word":"peculates","summary":{"en":"“Peculates” means “embezzles”: steals money someone is trusted to manage, often public or organizational funds.","zh":"“peculates”表示“挪用/侵吞受托资金（常为公款或机构资金）”，相当于“embezzles”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “peculate”) to steal money that you are trusted to manage, especially public or company funds; to embezzle.","zh":"（“peculate”的第三人称单数）挪用/侵吞自己受托管理的钱款，尤指公款或公司资金；贪污、侵占。"},"examples":[{"en":"The accountant peculates from the charity by creating fake invoices.","zh":"那名会计通过伪造发票从慈善机构挪用资金。"},{"en":"If a public official peculates, they can face criminal charges.","zh":"如果公职人员贪污挪用公款，可能会面临刑事指控。"}]}],"synonyms":["embezzles","misappropriates","pilfers (small amounts)","steals"],"phonetic":"ˈpɛkjəˌleɪts","extraExplanation":["“peculate”是非常正式、偏法律语境的词，日常更常用“embezzle”（挪用/侵吞公款、公司款项）。","词源来自拉丁语“peculatus”（侵吞公款），与“pecunia”（钱财）同源，因此常带有“受托资金被侵占”的含义，而不是一般意义的“偷窃”。"]}
{"word":"peculating","summary":{"en":"“Peculating” means embezzling—stealing money or property you were trusted to manage.","zh":"“peculating”指“侵吞/挪用受托管理的钱或财物”，常见于正式或法律语境。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"stealing money or property that you were trusted to take care of, especially in a job (embezzling).","zh":"侵吞（你受托保管的）钱款或财物，尤指在工作中（即“挪用公款/贪污/侵占”，类似 embezzle）。"},"examples":[{"en":"The accountant was caught peculating from the company’s accounts.","zh":"那名会计被抓到从公司账目中侵吞资金。"},{"en":"He was arrested for peculating public funds.","zh":"他因侵吞公款而被逮捕。"},{"en":"They suspected she was peculating, but they needed proof.","zh":"他们怀疑她在侵吞财物，但还需要证据。"}]}],"synonyms":["embezzling","misappropriating","stealing","defrauding"],"phonetic":"/ˈpɛkjəˌleɪtɪŋ/","extraExplanation":["“peculating”是动词“peculate”的现在分词/进行时形式，语气偏正式、法律或新闻语境更常见；日常口语更常用“embezzling”“stealing money”。","词源来自拉丁语“peculium”（私产、个人财物），与“pecuniary（与金钱有关的）”同源。"]}
{"word":"peculation","summary":{"en":"Peculation means illegally taking money or property you were trusted to manage; embezzlement.","zh":"Peculation 指非法侵吞或挪用自己受托管理的钱财或财物（即侵吞/挪用、贪污）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the illegal act of taking money or property that you are responsible for (especially in a job or public office); embezzlement","zh":"（尤指在工作或公职中）侵吞、挪用本应由自己保管或管理的钱财/财物；贪污；挪用公款"},"examples":[{"en":"The accountant was arrested for peculation of company funds.","zh":"那名会计因侵吞公司资金而被逮捕。"},{"en":"The investigation uncovered years of peculation in the department.","zh":"调查揭露该部门多年存在侵吞行为。"},{"en":"He denied any involvement in peculation, but the records showed missing payments.","zh":"他否认参与侵吞，但账目显示有款项不翼而飞。"}]}],"synonyms":["embezzlement","misappropriation","defalcation","fraud"],"phonetic":"/ˌpɛkjəˈleɪʃən/","extraExplanation":["“Peculation”是较正式、偏法律/新闻报道的词，日常英语里更常见的是“embezzlement”（侵吞、挪用）或“misappropriation”（挪用、侵占）。","词源来自拉丁语“peculatus”（侵吞公款），其词根与“pecuniary”（金钱的）同源，反映了与财物、金钱相关的含义。"]}
{"word":"peculations","summary":{"en":"“Peculations” means acts of embezzlement—stealing or misusing entrusted (often public) money.","zh":"“Peculations”指侵吞、挪用受托资金（常为公款）的行为，即贪污/盗用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) the act of taking money—especially public or entrusted funds—for your own use; embezzlement.","zh":"（常用复数）侵吞、挪用（尤其是公款或受托资金）；贪污、盗用。"},"examples":[{"en":"The audit uncovered peculations by a senior official over several years.","zh":"审计发现一名高级官员多年间侵吞公款。"},{"en":"New controls were introduced to prevent peculations in the department.","zh":"该部门引入了新管控措施以防止挪用资金。"}]}],"synonyms":["embezzlement","misappropriation","fraud","defalcation"],"phonetic":"/ˌpɛkjəˈleɪʃənz/","extraExplanation":["“peculation”较正式、偏法律/新闻用语，日常英语更常说“embezzlement”（挪用公款/侵吞）或“misappropriation”（挪用、侵占）。","词源来自拉丁语 peculatus，原与 peculium（“私人财产、家畜”）有关，后来引申为“侵吞公款/受托财物”。","拼写提醒：很多学习者想表达“猜测”时会误写成“peculations”。表示“推测、臆测”应是“speculations”。"]}
{"word":"peculator","summary":{"en":"A peculator is someone who embezzles money they were trusted to handle.","zh":"peculator 指侵吞/挪用自己受托管理资金的人（正式用语，近义 embezzler）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who steals money that they are trusted to manage (for example, from a government, company, or organization); an embezzler.","zh":"侵吞公款/挪用公款的人；侵占受托资金的人；贪污者（近义：挪用者、侵占者）。"},"examples":[{"en":"The accountant was exposed as a peculator after an internal audit found missing funds.","zh":"内部审计发现资金缺口后，那名会计被揭发是挪用公款的人。"},{"en":"Several officials resigned when the peculator’s scheme came to light.","zh":"当挪用者的手法曝光后，几名官员引咎辞职。"}]}],"synonyms":["embezzler","defalcator","thief","fraudster"],"phonetic":"/ˈpɛkjəˌleɪtɚ/","extraExplanation":["“peculator”较为正式、偏法律或新闻用语，日常口语里更常说“embezzler”。","词源来自拉丁语“peculatus/peculum”，与“个人财产、私产”有关，后来引申为“把公家的钱当成自己的”而侵吞。"]}
{"word":"peculators","summary":{"en":"“Peculators” means people who embezzle money they were trusted to handle, especially public funds.","zh":"“peculators”指侵吞受托资金的人，尤指侵吞公款者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who steals (embezzles) money that they were trusted to manage, especially public or government funds; an embezzler","zh":"侵吞公款者；挪用受托资金者；贪污者（较正式用语）"},"examples":[{"en":"The audit uncovered several peculators in the department who had been moving public money into private accounts.","zh":"审计发现该部门有几名侵吞公款者，把公款转入私人账户。"},{"en":"The judge sentenced the peculator to prison and ordered repayment.","zh":"法官判该贪污者入狱并责令退赔。"},{"en":"New controls were introduced to prevent peculators from exploiting weak oversight.","zh":"为防止侵吞者利用监管漏洞，出台了新的管控措施。"}]}],"synonyms":["embezzlers","defrauders","thieves","swindlers"],"phonetic":"/ˈpɛkjəˌleɪtər/","extraExplanation":["“peculators”是复数形式，单数是“peculator”。在现代英语里这个词偏正式、较少见，日常更常用“embezzler”（挪用公款者/侵吞者）。","词源来自拉丁语“peculatus”（挪用公款、侵吞公有财产），与“pecuniary”（金钱的）同源，核心都和“钱财”有关。"]}
{"word":"peculi","summary":{"en":"Peculi- is a root meaning “one’s own/private property,” behind words like peculiar and pecuniary.","zh":"peculi- 是表示“自己的/私有财产”的词根，见于 peculiar、pecuniary 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root/forming element meaning “one’s own; private property,” seen in words like peculiar and pecuniary","zh":"词根/构词成分，意为“自己的；私有财产”，常见于 peculiar（古怪的/独特的）和 pecuniary（钱财的）等词"},"examples":[{"en":"Her style is peculiar—very much her own.","zh":"她的风格很 peculiar——非常有她自己的特色。"},{"en":"The report focused on pecuniary losses (money-related losses).","zh":"报告重点讨论了 pecuniary losses（与金钱有关的损失）。"}]}],"synonyms":["own","private","personal"],"phonetic":"/pɪˈkjuːli/","extraExplanation":["“peculi-”来自拉丁语 peculium，原意是“个人的财产/私产”（尤其指在家庭或古罗马制度下，个人可支配的一部分财物）。再往前可追溯到 pecus（牲畜），因为在早期社会里“牲畜”常是财富的重要形式。","因此 peculiar 最早的意思更接近“属于某个人的、私有的、独有的”，后来语义逐渐发展为“与众不同的、特别的”，再到现代常见的“古怪的”。"]}
{"word":"peculia","summary":{"en":"Peculia is a historical term (from Roman law) meaning a private fund managed by a dependent, though legally controlled by the household head.","zh":"Peculia 是罗马法背景下的历史用语，指家属（尤指奴隶）可自行管理但法律上仍受家长控制的“私产/私蓄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, Roman law) Private property or a personal fund that legally belonged to the head of a household but was managed/used by a dependent (especially a slave or son).","zh":"（历史用语，罗马法）“私产/私蓄”：法律上归家长所有，但允许被家长支配的家属（尤指奴隶或儿子）自行管理和使用的一笔财产/资金。"},"examples":[{"en":"In Roman society, some slaves could build up peculia and sometimes buy their freedom.","zh":"在罗马社会里，一些奴隶可以积累 peculia，甚至有时用来赎身获得自由。"},{"en":"The contract says any earnings will go into the worker’s peculia, though the master still has legal control.","zh":"合同规定收入会进入这名劳工的 peculia，但主人仍拥有法律控制权。"}]}],"synonyms":["peculium","private fund","personal savings (historical context)"],"phonetic":"/pɪˈkjuːliə/","extraExplanation":["“peculia”来自拉丁语，常被视为 peculium 的复数形式（peculium → peculia）。在英文历史写作中，你可能会看到 peculium（单数）更常用。","它和常见英语词 peculiar（“奇怪的；特有的”）同源：都来自拉丁语里“私人财产/个人的东西”的概念，后来引申为“属于某人的、特有的”，再进一步引申为“与众不同、显得奇怪的”。"]}
{"word":"peculiar","summary":{"en":"Peculiar means either “strange/unusual” or “unique to a particular person or place,” depending on context.","zh":"peculiar 可表示“奇怪/不寻常”，也可表示“某人或某地特有的”，具体看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange or unusual, especially in a way that makes you notice it.","zh":"奇怪的；不寻常的（尤指引人注意的）。"},"examples":[{"en":"There’s a peculiar smell in the kitchen.","zh":"厨房里有一股奇怪的味道。"},{"en":"He had a peculiar way of laughing that everyone remembered.","zh":"他的笑声方式很特别，大家都记得。"}]},{"partOfSpeech":"adj.","definition":{"en":"Belonging only to one person, group, or thing; particular to them.","zh":"特有的；独有的（只属于某人/某群体/某事物的）。"},"examples":[{"en":"This custom is peculiar to that region.","zh":"这个习俗是那个地区特有的。"},{"en":"Each writer has a style peculiar to their own voice.","zh":"每位作家都有一种属于自己声音的独特风格。"}]}],"synonyms":["strange","odd","unusual","weird","distinctive","unique","particular"],"phonetic":"/pɪˈkjuːliɚ/","extraExplanation":["“peculiar”既可以是中性的“特别/独特”，也常带一点“怪怪的/不太正常”的感觉，语气比“unusual”更主观、更容易让人联想到“怪”。在正式写作里，“peculiar to …”很常见，意思是“……所特有的”。","词源来自拉丁语 *peculiaris*，原意与“个人财产/私有物”有关，因此引申出“某人（或某地）独有的”。在文学里，作家常用它来营造一种“细微的不安或异样感”，比如描写“a peculiar silence（古怪的寂静）”。"]}
{"word":"peculiarise","summary":{"en":"Peculiarise means to make something distinctive or unusual; it’s a rare verb (BrE spelling of “peculiarize”).","zh":"peculiarise 表示“使……变得独特或不寻常”，是较罕见的动词（英式拼写，对应 peculiarize）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make something peculiar—unusual, distinctive, or different from what is normal; to give something a special or individual character.","zh":"（罕用）使……变得“独特/古怪/不寻常”；使……具有特殊或个人化的特征。"},"examples":[{"en":"The author’s choice of dialect peculiarised the narrator’s voice.","zh":"作者选择方言让叙述者的声音变得格外独特。"},{"en":"Local customs can peculiarise a festival in ways outsiders don’t expect.","zh":"地方习俗可能会让一个节日呈现出外人意想不到的独特样貌。"}]}],"synonyms":["peculiarize","make distinctive","individualize","differentiate","characterize"],"phonetic":"/pəˈkjuljəˌraɪz/","extraExplanation":["“peculiarise”是英式拼写，对应美式拼写“peculiarize”。这个词在现代英语中非常少见，写作中更常用“make … distinctive/unusual”或“individualize”。","词根“peculiar”原意与“属于个人/私有的”有关，因此这个动词除了“古怪”，也可强调“赋予某物独特特性”。"]}
{"word":"peculiarised","summary":{"en":"“Peculiarised” means “made distinctive or unique,” the past form of peculiarise/peculiarize.","zh":"“peculiarised”意为“使……具有独特/特别的特征”，是peculiarise/peculiarize的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"made something unusual, distinctive, or characteristic of one person, group, place, or thing; gave it a special or unique quality (past tense/past participle of “peculiarise/peculiarize”).","zh":"使某事物变得独特、特别或具有某一人/群体/地区/事物特有的性质；使之带有专属特征（“peculiarise/peculiarize”的过去式/过去分词）。"},"examples":[{"en":"Over time, local traditions peculiarised the festival, so it looked different from the celebrations in other towns.","zh":"随着时间推移，当地传统使这个节日具有了独特性，因此它看起来与其他城镇的庆祝方式不同。"},{"en":"The author peculiarised the hero’s voice by giving him a gentle, old-fashioned way of speaking.","zh":"作者通过让主角使用温和而略显古典的说话方式，使他的声音风格变得很有辨识度。"}]}],"synonyms":["made distinctive","made unique","characterized","individualized","set apart"],"phonetic":"pɪˈkjuːliəraɪzd","extraExplanation":["“peculiarised”在现代英语中比较少见，更常用的表达是“made … unique/distinctive”或“characterized”。","拼写上，“peculiarise”多见于英式英语，“peculiarize”多见于美式英语；两者意思相同。","词源上“peculiar”与“个人的、专属的”有关，所以“peculiarise”常带有“赋予某人/某地特有特征”的含义，而不只是“奇怪”。"]}
{"word":"peculiarising","summary":{"en":"“Peculiarising” means making something distinctive or unusual; it is the -ing form of the rare verb “peculiarise/peculiarize.”","zh":"“peculiarising”表示“使……变得独特或不寻常”，是较少见动词“peculiarise/peculiarize”的 -ing 形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"making something seem unusual, distinctive, or different from what is normal; giving something a special or individual character (present participle/gerund of “peculiarise”).","zh":"使某事物显得不寻常、独特或不同于常态；赋予某事物特殊或个别的特征（“peculiarise”的现在分词/动名词）。"},"examples":[{"en":"The author focuses on the small details peculiarising each character’s voice.","zh":"作者专注于细微之处，使每个角色的声音都更具个人特色。"},{"en":"These customs are peculiarising features of the region’s culture.","zh":"这些习俗是该地区文化中使其显得独特的特征。"}]}],"synonyms":["distinguishing","differentiating","making distinctive","singling out"],"phonetic":"/pɪˈkjuːliəˌraɪzɪŋ/","extraExplanation":["“peculiarising”来自英式拼写“peculiarise”，美式常写作“peculiarize”。在现代日常英语中，这个动词本身较少见；更常用的表达是“make … distinctive / make … unusual / distinguish …”。","词根提示：peculiar 原意与“属于某人/某物特有的”有关，所以“peculiarise/peculiarize”强调“把某种特有性加到……上”，或“让……呈现出与众不同的特征”。"]}
{"word":"peculiarism","summary":{"en":"A rare noun meaning an unusual personal or regional feature, especially a distinctive language habit.","zh":"较少见的名词，指个人或地区的怪癖/特有之处，尤指独特的语言习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A peculiar feature, habit, or way of speaking; something that makes a person or group seem unusual.","zh":"怪癖；特有的怪异之处（指使某人或某群体显得与众不同的特点、习惯或说话方式）。"},"examples":[{"en":"One peculiarism of his writing is the way he mixes very formal words with casual slang.","zh":"他写作的一个怪癖是把很正式的词和随意的俚语混在一起用。"},{"en":"Every region has its own peculiarisms, especially in accent and vocabulary.","zh":"每个地区都有自己的特有之处，尤其体现在口音和词汇上。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics, a word, pronunciation, or grammatical pattern that is characteristic of a particular person, community, or dialect.","zh":"（语言学）某个人、群体或方言特有的用词、发音或语法形式。"},"examples":[{"en":"The researcher recorded local peculiarisms to understand how the dialect is changing.","zh":"研究者记录了当地的语言特征，以了解该方言如何变化。"},{"en":"What sounds like a mistake may actually be a regional peculiarism.","zh":"听起来像错误的说法，可能其实是地区性的语言特征。"}]}],"synonyms":["quirk","oddity","idiosyncrasy","distinctive feature","dialect feature"],"phonetic":"/pɪˈkjuːliəˌrɪzəm/","extraExplanation":["“peculiarism”并不是日常高频词，更常见的表达是“quirk”（怪癖）或“oddity”（怪事/怪处）。在学术语境（尤其方言研究、文体分析）里，它更容易出现，用来指某一地区或某个人特有的语言用法。","构词上：peculiar（特有的/古怪的）+ -ism（表示“性质、特征、体系”）。因此它常带有“某种特有倾向/特征集合”的感觉。"]}
{"word":"peculiarities","summary":{"en":"Peculiarities means unusual or distinctive features, or (especially about people) small odd habits.","zh":"peculiarities 指不寻常或独特的特征；也可指（尤指人）的小怪癖、古怪习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Special or unusual features or characteristics that make someone or something different from others.","zh":"（某人或某物的）特殊之处；独特或不寻常的特征。"},"examples":[{"en":"Every culture has its own peculiarities in food and greetings.","zh":"每种文化在饮食和问候方式上都有自己的独特之处。"},{"en":"The report mentions the peculiarities of the local climate.","zh":"报告提到了当地气候的特殊特点。"}]},{"partOfSpeech":"n.","definition":{"en":"Strange or slightly odd habits or behaviors (often used when talking about people).","zh":"（常指人的）怪癖；有点古怪的习惯或行为。"},"examples":[{"en":"His peculiarities include labeling everything in the kitchen.","zh":"他的怪癖包括给厨房里所有东西贴标签。"},{"en":"We all have our little peculiarities, and that’s okay.","zh":"我们每个人都有一些小怪癖，这很正常。"}]}],"synonyms":["oddities","quirks","distinctive features","idiosyncrasies","characteristics"],"phonetic":"/pəˌkjuːliˈærətiz/","extraExplanation":["“peculiarities”是复数形式，单数是“peculiarity”。日常写作里常用搭配有：the peculiarities of a system/culture/language（某个系统/文化/语言的特殊之处）。","语气上，“peculiarity”可以是中性（特点、特色），也可以略带委婉的负面（古怪、怪癖）。如果想更中性，可以用“quirks”（小特点/小怪癖，口语更轻松）或“distinctive features”（更正式、更中性）。"]}
{"word":"peculiarity","summary":{"en":"Peculiarity means a distinctive or unusual feature, often a small quirk, or the quality of being unique to someone or something.","zh":"Peculiarity 指某人或某事物的独特/不寻常之处（常带“小怪癖”的感觉），也可指“特有性、独有性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A special, unusual, or distinctive feature of a person, thing, or situation.","zh":"（人、事物或情况的）特性；特别之处；古怪之处。"},"examples":[{"en":"One peculiarity of this old house is that every door is a different size.","zh":"这栋老房子有个特别之处：每扇门的尺寸都不一样。"},{"en":"His main peculiarity is that he always drinks tea with lemon, never with milk.","zh":"他最明显的一个习惯/特点是：喝茶一定加柠檬，从不加牛奶。"},{"en":"The report noted a peculiarity in the data that needed further investigation.","zh":"报告指出数据中有一个异常之处，需要进一步调查。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of being particular to one person, group, place, or thing; uniqueness.","zh":"特有性；独有性；（某地、某群体等的）特征。"},"examples":[{"en":"The peculiarity of the local dialect can be hard for outsiders to understand.","zh":"这种地方方言的独特性，对外地人来说可能很难理解。"},{"en":"Researchers are interested in the peculiarity of this species’ behavior.","zh":"研究人员对这种物种行为的独有性很感兴趣。"}]}],"synonyms":["quirk","oddity","unusual feature","distinctive feature","idiosyncrasy","uniqueness"],"phonetic":"pɪˌkjuːliˈærɪti","extraExplanation":["“peculiarity”常带有“有点怪/不寻常”的语感，但不一定是贬义；既可以指可爱的“小怪癖”，也可以指需要注意的“异常点”。","词源上与拉丁语“peculium”（私有财产）有关，因此早期含义偏“属于某人的、特有的”，后来才常用来指“与众不同的特点/怪处”。"]}
{"word":"peculiarization","summary":{"en":"Peculiarization means the process of making something distinctive or treating it as a special, specific case (a rare, academic word).","zh":"peculiarization 指使某事变得独特/特有的过程，或把一般情况当作特例来具体化（较少见的学术用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something peculiar—especially making it distinctive, unusual, or specific to a particular person, place, group, or situation","zh":"使某事物变得“独特/特殊/异于常规”的过程；尤指让它变成某个个人、地点、群体或情境所特有的过程"},"examples":[{"en":"Over time, local food traditions can develop through peculiarization, becoming strongly tied to one region.","zh":"随着时间推移，本地饮食传统可能通过“特殊化”而形成，并与某个地区紧密绑定。"},{"en":"The designer aimed for peculiarization so the brand would stand out in a crowded market.","zh":"设计师希望进行“独特化”，让品牌在拥挤的市场中脱颖而出。"}]},{"partOfSpeech":"n.","definition":{"en":"(academic) the act of treating something as a special case rather than a general one; narrowing a general rule to a particular situation","zh":"（学术用语）把某事当作特例来处理的做法；把一般规则缩小到某个具体情境的“特例化/具体化”"},"examples":[{"en":"The paper discusses the peculiarization of broad social theories when applied to one community.","zh":"这篇论文讨论了当宏观社会理论被用于某个社区时的“特例化/具体化”。"},{"en":"In class, we moved from general principles to the peculiarization of the model for this dataset.","zh":"在课堂上，我们从一般原理过渡到针对这个数据集对模型进行“具体化/特例化”。"}]}],"synonyms":["differentiation","specification","particularization","specialization"],"phonetic":"/pɪˌkjuːljərəˈzeɪʃən/","extraExplanation":["“peculiarization”在日常英语中很少见，更常见的表达是“make something distinctive / make something specific / differentiate”。它多出现在学术或正式写作中。","词根来自“peculiar”（独特的、特有的）+ “-ization”（……化），意思就是“变得/使之变得独特或特定”。注意“peculiar”在口语里也可表示“古怪的”，但“peculiarization”更常指“独特化/特定化”，不一定带贬义。"]}
{"word":"peculiarize","summary":{"en":"Peculiarize means to make something distinctive or unusual, or to set it apart as unique.","zh":"peculiarize 指使某物变得独特或奇特，或把它区分出来使其显得与众不同。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something peculiar (special, distinctive, or unusual); to give it a unique character","zh":"使……变得独特/特殊/怪异；使……具有独一无二的特征"},"examples":[{"en":"Certain customs peculiarize the festival in that region.","zh":"某些习俗使那个地区的节日显得格外独特。"},{"en":"The writer uses local dialect to peculiarize the narrator’s voice.","zh":"作者用地方方言来使叙述者的声音更具独特性。"}]},{"partOfSpeech":"vt.","definition":{"en":"to distinguish or set apart as unique","zh":"将……区分开来；使……与众不同"},"examples":[{"en":"What peculiarizes this species is its ability to survive long droughts.","zh":"使这种物种与众不同的是它能在长期干旱中存活。"},{"en":"A single detail can peculiarize a character in a story.","zh":"一个细节就能让故事里的角色显得与众不同。"}]}],"synonyms":["distinguish","differentiate","characterize","make distinctive","set apart"],"phonetic":"/pɪˈkjuːliəˌraɪz/","extraExplanation":["“peculiarize”由“peculiar（独特的/奇特的）+ -ize（使……化）”构成，属于较少见、偏书面/旧式的动词。现代英语里更常用“make … distinctive/unique”或“distinguish”。在文学评论或较正式的写作中偶尔会见到。"]}
{"word":"peculiarized","summary":{"en":"“Peculiarized” means made distinctive or unusual; it is the past form of “peculiarize.”","zh":"“peculiarized”表示“使变得独特或不同寻常”，是“peculiarize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made unusual or distinctive; given a special or individualized character.","zh":"使变得特殊或与众不同；赋予独特（个别化）的特征。"},"examples":[{"en":"Over time, the local accent became peculiarized by contact with many immigrant languages.","zh":"随着时间推移，当地方言因接触多种移民语言而逐渐变得更具特色。"},{"en":"The artist peculiarized ordinary objects, turning them into symbols of memory.","zh":"这位艺术家把普通物件处理得更具个性，使它们变成记忆的象征。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “peculiarize”: to make something peculiar (unusual), distinctive, or specifically characteristic of a person, place, or group.","zh":"“peculiarize”的过去式/过去分词：使某事物变得奇特、独特，或成为某个人/地点/群体所特有的特征。"},"examples":[{"en":"Writers sometimes peculiarized a character’s speech to show their background.","zh":"作家有时会把角色的说话方式写得更具个人特色，以体现其背景。"},{"en":"The custom was peculiarized in this region through centuries of practice.","zh":"这一习俗经过数百年的沿袭，在这一地区形成了地方特色。"}]}],"synonyms":["individualized","made distinctive","characterized","specialized","differentiated"],"phonetic":"/pɪˈkjuːliəˌraɪzd/","extraExplanation":["“peculiarized”在现代日常英语中很少见，更常用的是“made distinctive / made unusual / individualized / characterized”。在学术写作或较旧的文体里偶尔会出现，用来强调“被赋予某种独特性”而不只是“奇怪”。"]}
{"word":"peculiarizing","summary":{"en":"“Peculiarizing” means making something seem distinctive or treating it as a special/exceptional case.","zh":"“peculiarizing”指使某事物显得独特，或将其当作特殊/例外情况来看待。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Making something seem unusual, distinctive, or specific to a particular person, group, place, or thing; emphasizing what sets it apart.","zh":"使某事物显得独特、不同寻常或为某人/某群体/某地所特有；强调其区别性。"},"examples":[{"en":"The author is peculiarizing the village by focusing on its winter rituals and local sayings.","zh":"作者通过描写冬季仪式和当地俗语，让这个村庄显得更有其独特性。"},{"en":"In the discussion, she kept peculiarizing the problem instead of looking for a general solution.","zh":"在讨论中，她一直把问题讲得很特殊化，而不是寻找普遍性的解决办法。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) Interpreting or treating something as special or exceptional rather than normal or general.","zh":"（较少见）把某事理解或处理为“特殊情况”，而不是普通或一般情况。"},"examples":[{"en":"He is peculiarizing every small mistake as a sign of failure.","zh":"他把每一个小错误都特殊化成失败的征兆。"},{"en":"Don’t keep peculiarizing her behavior; it may have a simple explanation.","zh":"别总把她的行为特殊化；也许有个简单的原因。"}]}],"synonyms":["making distinctive","setting apart","singling out","special-casing","treating as exceptional"],"phonetic":"/pɪˈkjuːljəˌraɪzɪŋ/","extraExplanation":["“peculiarizing”来自动词“peculiarize”，在现代英语里比较少见，更多时候人们会用更常见的表达来替代，例如：make distinctive（使独特）、set apart（使与众不同）、single out（挑出、特别指出）、treat as exceptional（视为例外）、specialize（使专业化/特化，语境不同）。","词形提示：peculiar（adj. 独特的；古怪的）→ peculiarize（v. 使……成为特有/使特殊化）→ peculiarizing（现在分词/动名词）。在学术写作或较“书面”的语境里偶尔会看到。"]}
{"word":"peculiarly","summary":{"en":"Peculiarly means “in a strange/unusual way” or “especially/particularly,” depending on context.","zh":"peculiarly 表示“异常/不寻常地”，也可表示“尤其/特别地”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strange or unusual way; in a way that makes something stand out as different.","zh":"以奇怪或不寻常的方式；以显得与众不同的方式。"},"examples":[{"en":"She was peculiarly quiet during the meeting.","zh":"她在会议上异常安静。"},{"en":"The town is peculiarly charming in winter.","zh":"这个小镇在冬天有一种特别的迷人之处。"}]},{"partOfSpeech":"adv.","definition":{"en":"Especially; particularly (often used to emphasize one thing among others).","zh":"尤其；特别（常用于强调众多事物中的某一点）。"},"examples":[{"en":"He is peculiarly interested in classical music.","zh":"他对古典音乐尤其感兴趣。"},{"en":"This rule applies peculiarly to new employees.","zh":"这条规定特别适用于新员工。"}]}],"synonyms":["strangely","oddly","unusually","especially","particularly","notably"],"phonetic":"/pɪˈkjuːliɚli/","extraExplanation":["“peculiarly”来自形容词“peculiar”。“peculiar”早期含义与拉丁语“peculium”（私产、个人财产）有关，因此在较正式语境里还可能带有“某人/某地特有的、专属的”意味，例如：a custom peculiar to the region（这个地区特有的习俗）。现代口语中更常见的是“奇怪的/不寻常的”。","语气提示：说人“peculiar”有时会显得不太客气（暗示“怪”），用“peculiarly”修饰行为/气氛通常更委婉：peculiarly quiet（异常安静）比 “She is peculiar.”（她很怪）更自然。"]}
{"word":"peculiarness","summary":{"en":"Peculiarness means the quality of being strange or unusual; less commonly, it can mean a specific odd feature.","zh":"peculiarness 指“古怪/不同寻常的性质或感觉”；较少情况下也可指“某个具体的怪点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being unusual, strange, or different from what is normal or expected; oddness.","zh":"古怪；与常态不同的特性；怪异感。"},"examples":[{"en":"People noticed the peculiarness of his accent right away.","zh":"人们立刻注意到他口音的古怪之处。"},{"en":"The story’s charm comes from its gentle peculiarness.","zh":"这个故事的魅力来自它那种温和的怪异感。"},{"en":"She tried to hide the peculiarness of the situation with a joke.","zh":"她试图用一个玩笑掩饰当时局面的怪异。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular unusual feature or detail; a specific odd trait (less common usage).","zh":"（较少用）某个具体的怪点；独特而奇怪的特征。"},"examples":[{"en":"One peculiarness of the plan is that it depends on everyone arriving early.","zh":"这个计划有个怪点：它得靠所有人都早到。"},{"en":"The novel is full of small peculiarnesses that make it memorable.","zh":"这部小说充满许多小小的怪异细节，让人难忘。"}]}],"synonyms":["oddness","strangeness","unusualness","weirdness","peculiarity"],"phonetic":"/pɪˈkjuːliərnəs/","extraExplanation":["“peculiarness”来自形容词“peculiar（奇特的）+ -ness（名词后缀）”，表示“……的性质/状态”。日常英语里更常用的名词是“peculiarity（奇特之处/怪癖）”，而“peculiarness”更偏书面或强调“那种奇特的感觉/性质”。","在语感上，“peculiarity”常指“一个具体的怪点/怪癖”，而“peculiarness”更像“整体的怪异感/奇特性质”。"]}
{"word":"peculiars","summary":{"en":"“Peculiars” usually means strange or unusual people/things, or a group of people with special qualities (often in fiction).","zh":"“peculiars”通常指古怪的人或事物，也可指小说里具有特殊能力/特质的一群人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strange, unusual, or distinctive people or things (plural of “peculiar” used as a noun).","zh":"古怪的人或事物；奇特之处（作名词复数，来自“peculiar”）"},"examples":[{"en":"Every town has its peculiars, and that’s part of its charm.","zh":"每个小镇都有些“怪人怪事”，这也是它的魅力之一。"},{"en":"The report listed a few peculiars in the data that needed further checking.","zh":"报告列出了一些数据中的异常之处，需要进一步核查。"}]},{"partOfSpeech":"n.","definition":{"en":"People with unusual or special qualities (often used as a group name in fiction).","zh":"具有特殊或异于常人能力/特质的人（常见于小说中作为群体称呼）"},"examples":[{"en":"In the story, the peculiars hide their abilities from ordinary people.","zh":"在故事里，这些“异能者”把能力藏起来，不让普通人发现。"},{"en":"She was fascinated by the world of peculiars and their hidden rules.","zh":"她对“异能者”的世界以及他们隐藏的规则很着迷。"}]}],"synonyms":["oddities","quirks","eccentrics","anomalies"],"phonetic":"/pɪˈkjuljɚz/","extraExplanation":["“peculiars”是把形容词peculiar（奇怪的；独特的）名词化后的复数用法，语气有时带一点幽默或轻微的吐槽。","在流行文化中，Peculiars/peculiar people常被用作“异能者/特殊者”的称呼，例如《Miss Peregrine’s Home for Peculiar Children》（《佩小姐的奇幻城堡》）里就出现过类似用法。"]}
{"word":"peculiarsome","summary":{"en":"“Peculiarsome” is a rare, nonstandard way to say “somewhat peculiar/odd.”","zh":"“peculiarsome”是罕见且非标准的说法，大致表示“有点古怪/有点奇怪”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Somewhat peculiar; a bit odd or unusual.","zh":"（非标准/罕见用法）有点古怪的；有些不寻常的。"},"examples":[{"en":"That word choice feels peculiarsome—maybe you mean “somewhat peculiar.”","zh":"那个用词感觉有点“peculiarsome”（怪怪的）——你可能想说“somewhat peculiar（有点奇怪）”。"},{"en":"The story has a peculiarsome charm, like something slightly off but interesting.","zh":"这个故事有种有点古怪的魅力——像哪里不太对劲但又很吸引人。"}]}],"synonyms":["somewhat peculiar","a bit odd","slightly strange","quirky","unusual"],"phonetic":"pɪˈkjuːliərsʌm","extraExplanation":["“peculiarsome”不是常见或标准的英语单词，通常不会出现在正规写作里。它看起来像把“peculiar（奇怪的）”和后缀“-some（带有……倾向/性质的）”拼在一起的自造词或玩笑式用法。","如果你想表达“有点奇怪”，更自然的说法有：“somewhat peculiar / kind of odd / a bit strange / quirky”。在正式语境中建议避免使用“peculiarsome”。"]}
{"word":"peculium","summary":{"en":"A peculium is money or property someone is allowed to manage for personal use, especially in Roman law (slave/child), even though it legally belongs to the master or father.","zh":"peculium 指一笔允许个人管理使用的财产，尤指罗马法中主人给奴隶或父亲给子女管理的“私用财产”，但法律所有权仍归主人或父亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, Roman law) Money or property that a master allowed a slave (or a father allowed a child) to manage personally, though it legally remained under the master’s (or father’s) control.","zh":"（历史用语，罗马法）主人允许奴隶（或父亲允许子女）自行管理的一笔钱或财产；法律上仍归主人（或父亲）所有。"},"examples":[{"en":"In Roman society, a slave might save a peculium to buy freedom.","zh":"在罗马社会，奴隶可能会积攒一份 peculium 来赎身获得自由。"},{"en":"The contract mentioned the servant’s peculium, even though it was not fully his property by law.","zh":"合同里提到仆人的 peculium，尽管依法它并不完全属于他。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, broader) A fund or property set aside for someone who is under another person’s authority, especially when they may use it but do not fully own it.","zh":"（法律，广义）为受他人支配的人预留的一笔资金或财产；通常可使用但不完全拥有。"},"examples":[{"en":"The court treated the account as a peculium managed by the dependent party.","zh":"法院将该账户视为由受支配一方管理的 peculium。"},{"en":"Some legal writers compare a minor’s controlled assets to a kind of peculium.","zh":"一些法学作者把未成年人受控制的资产类比为一种 peculium。"}]}],"synonyms":["allowance","private fund","personal reserve","nest egg (approx.)","pocket money (approx.)"],"phonetic":"/pɪˈkjuːliəm/","extraExplanation":["词源来自拉丁语 *peculium*，与 *pecus*（牲畜、财产）有关；在早期社会里“财富”常与牲畜数量相关，因此这个词带有“私房钱/私产”但“名义不完全归你”的制度色彩。","在罗马法语境中，*peculium* 很关键：它让奴隶/家属能进行一定的经济活动（做生意、积蓄），但最终所有权仍在家主（*paterfamilias*）或主人手里。阅读历史、法学或古典文学研究文章时更常见。"]}
{"word":"pecunia","summary":{"en":"Pecunia is a Latin term meaning “money” or “wealth,” used mostly in legal, historical, or scholarly contexts.","zh":"pecunia 是拉丁语词，意为“金钱/财富”，多用于法律、历史或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money or wealth (a Latin word often used in legal, historical, or scholarly writing).","zh":"金钱；财富（拉丁词，常见于法律、历史或学术语境）。"},"examples":[{"en":"In Roman law, fines were often paid in pecunia rather than goods.","zh":"在罗马法中，罚款常以金钱（pecunia）而非实物缴纳。"},{"en":"The historian notes that political influence frequently followed pecunia.","zh":"历史学家指出，政治影响力往往随财富（pecunia）而来。"}]}],"synonyms":["money","wealth","funds"],"phonetic":"/pɪˈkjuːniə/","extraExplanation":["pecunia 是拉丁语“钱、财产”的意思，在英文中属于较少见、偏书面/学术的用词。更常见的日常表达仍是 money, wealth。","它与常见英语词 pecuniary（adj. “金钱的；与金钱有关的”，如 pecuniary damages“金钱赔偿”）同源。","词源上常被解释为与拉丁语 pecus（“牲畜”）有关：古代社会中牲畜常是重要的财富形式，因此“财富/金钱”的概念与之联系紧密。"]}
{"word":"pecunial","summary":{"en":"Pecuniary means “related to money or financial matters,” often in formal or legal contexts.","zh":"Pecuniary 表示“与金钱/经济有关”，常用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to money, especially in a practical or legal sense (financial).","zh":"与金钱有关的；（尤指）金钱方面的、经济上的（常用于正式或法律语境）。"},"examples":[{"en":"She took the job for pecuniary reasons, not because she loved the work.","zh":"她接受这份工作是出于金钱方面的原因，而不是因为喜欢这份工作。"},{"en":"The court awarded pecuniary damages to cover lost income.","zh":"法院判给金钱赔偿，用于弥补收入损失。"}]}],"synonyms":["financial","monetary","economic","money-related"],"phonetic":"/pɪˈkjuːniˌɛri/","extraExplanation":["你输入的“pecunial”通常被认为是拼写错误；标准词是 **pecuniary**。它来自拉丁语 *pecunia*（钱、财产）。在英语里多见于正式写作（新闻、法律、学术），日常口语更常说 **financial / monetary / money-related**。","常见搭配：**pecuniary interest**（金钱利益）、**pecuniary loss**（经济损失）、**pecuniary damages**（金钱赔偿）。注意它常带有“出于金钱考虑”的语气，并不一定是贬义，但可能暗示动机偏现实或功利。"]}
{"word":"pecuniarily","summary":{"en":"“Pecuniarily” means “financially; relating to money,” and is mainly used in formal contexts.","zh":"“pecuniarily”意为“在经济上；与金钱有关”，主要用于正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In terms of money; financially (often used in formal writing).","zh":"在金钱方面；在经济上（常用于正式语境）。"},"examples":[{"en":"They were not pecuniarily prepared for an emergency.","zh":"他们在经济上没有为紧急情况做好准备。"},{"en":"The decision benefited the company pecuniarily.","zh":"这个决定在经济上让公司受益。"},{"en":"He was motivated pecuniarily rather than by curiosity.","zh":"他更多是受金钱驱动，而不是出于好奇。"}]}],"synonyms":["financially","monetarily","in monetary terms","money-wise"],"phonetic":"/pɪˈkjuːniˌɛrəli/","extraExplanation":["“pecuniarily”是比较正式、书面化的副词，日常口语里更常说“financially / in terms of money”。","词源上来自拉丁语“pecunia”（钱财），与“pecuniary”（金钱的、经济的）同源；在法律、商业或学术写作中更常见。"]}
{"word":"pecuniary","summary":{"en":"Pecuniary means “related to money,” especially in formal, legal, or business contexts.","zh":"pecuniary 指“与金钱有关的”，多用于正式、法律或商业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to money or finances; involving payment or financial value.","zh":"与金钱或财务有关的；涉及付款或经济价值的。"},"examples":[{"en":"The company offered a pecuniary bonus for meeting the sales target.","zh":"公司为达成销售目标提供了金钱奖金。"},{"en":"He faced pecuniary difficulties after losing his job.","zh":"失业后他遇到了经济困难。"},{"en":"The court awarded pecuniary damages to cover medical expenses.","zh":"法院判给财产性赔偿以支付医疗费用。"}]}],"synonyms":["financial","monetary","fiscal"],"phonetic":"/pɪˈkjuːniˌɛri/","extraExplanation":["“pecuniary”是偏正式/法律与商业语境常用词，比起日常的“financial”更书面，常见搭配有：pecuniary loss（金钱损失）、pecuniary damages（财产性/金钱赔偿）、pecuniary interest（金钱利益）。","词源来自拉丁语“pecunia”（钱财），与“pecus”（牲畜）有关：在古代社会里，牲畜常被视作财富，因此这个词带有“财富=可计价的财产”的历史痕迹。"]}
{"word":"pecuniosity","summary":{"en":"Pecuniosity means poverty or having very little money; it’s a formal, literary word.","zh":"pecuniosity 指贫困或手头很紧，是较正式、偏文学的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having little or no money; poverty","zh":"缺钱的状态；贫困；拮据"},"examples":[{"en":"After losing his job, he faced a period of pecuniosity.","zh":"失业后，他经历了一段拮据的时期。"},{"en":"Her pecuniosity didn’t stop her from helping others in small ways.","zh":"她虽然手头拮据，但仍用小方式帮助别人。"},{"en":"The novel describes the pecuniosity of young artists trying to survive in the city.","zh":"那部小说描写了年轻艺术家在城市里艰难求生的贫困处境。"}]}],"synonyms":["poverty","penury","indigence","impecuniousness","financial hardship"],"phonetic":"/pɪˌkjuːniˈɑsɪti/","extraExplanation":["“pecuniosity”较正式、偏书面语，日常口语更常用：poverty（贫困）、being broke（没钱/很穷）、financial hardship（经济困难）。","词源来自拉丁语 pecunia（钱、财富），而 pecunia 与 pecus（牲畜）有关——在古代牲畜常被视为财富单位，所以“钱”的概念与“牲畜”在历史上曾紧密相连。","常见搭配：a period/state of pecuniosity（拮据时期/状态），fall into pecuniosity（陷入贫困）。","文学/写作语境中常用来强调“缺钱”的社会处境或生活压力，比单纯说“poor”更有书面色彩。"]}
{"word":"pecunious","summary":{"en":"Pecunious means wealthy or having plenty of money (formal, sometimes humorous).","zh":"pecunious 指“富有的、有很多钱的”（较正式，有时带幽默或调侃语气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a lot of money; wealthy (often used in a formal or humorous way).","zh":"有钱的；富有的（常用于正式或带点幽默的语气）"},"examples":[{"en":"She comes from a pecunious family, so she never worried about tuition.","zh":"她出身于富裕家庭，所以从不为学费发愁。"},{"en":"The hotel caters to pecunious travelers who want privacy and luxury.","zh":"这家酒店主要服务有钱、追求私密和奢华的旅客。"},{"en":"He sounded pecunious on paper, but most of his wealth was tied up in property.","zh":"他在账面上看起来很有钱，但大部分财富都压在房产上了。"}]}],"synonyms":["wealthy","rich","affluent","well-off","moneyed"],"phonetic":"/pɪˈkjuːniəs/","extraExplanation":["“pecunious”来自拉丁语 pecunia（钱、财产）。在古罗马时期，pecus 指“牲畜”，因为牲畜曾是重要的财富衡量方式，所以“钱”与“牲畜”在词源上有关联。","现代英语里它比较书面、偏文学或带一点调侃色彩：说某人 pecunious 往往比直接说 rich 更“文气”或更有讽刺感（视语境而定）。"]}
