{"word":"Peg","summary":{"en":"“Peg” is a small pin/clip used to fasten things, and as a verb it means to secure something with a peg or to fix a value at a set level.","zh":"“Peg”指用于固定的栓/夹子（如衣夹）；作动词指用栓固定，或把价格/汇率等固定在某一水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pin, usually made of wood or plastic, used to fasten, hang, or hold something in place","zh":"（通常为木质或塑料的）小钉；夹子；栓，用来固定、挂住或卡住物品"},"examples":[{"en":"Hang the wet clothes on the line with pegs.","zh":"用衣夹把湿衣服夹在晾衣绳上。"},{"en":"This shelf is supported by two metal pegs.","zh":"这块搁板由两个金属栓支撑。"}]},{"partOfSpeech":"n.","definition":{"en":"a fixed level or standard used for comparison (often in the phrase “a peg on which to hang something”)","zh":"（比喻）标准；依据；用来“依托/展开”的点"},"examples":[{"en":"The team used last year’s results as a peg for setting this year’s goals.","zh":"球队把去年的成绩作为制定今年目标的参考标准。"},{"en":"She used the news story as a peg to discuss bigger social issues.","zh":"她借那条新闻来讨论更大的社会议题。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fasten, fix, or secure something with a peg; to attach firmly","zh":"用栓固定；钉住；牢牢固定"},"examples":[{"en":"He pegged the tent down before the storm arrived.","zh":"暴风雨来临前，他把帐篷用地钉固定好。"},{"en":"Peg the note to the board so it doesn’t fall.","zh":"把纸条钉在板子上，免得掉下来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to set or keep a value, price, or rate at a fixed level (often “peg … to …”)","zh":"（常与 to 连用）把（价格/价值/汇率等）固定在某一水平"},"examples":[{"en":"The company pegged the starting salary to local market rates.","zh":"公司把起薪定在当地市场水平。"},{"en":"Some countries peg their currency to the U.S. dollar.","zh":"一些国家把本国货币与美元挂钩。"}]}],"synonyms":["pin","clip","fastener","attach","fix","secure","anchor"],"phonetic":"/pɛɡ/","extraExplanation":["“peg”很常见的具体意思是“衣夹/木夹”，在英美生活里晾衣服时会用到（clothespin 也常说）。","常见搭配：peg something down（用钉子把东西钉牢在地上）；peg A to B（把A与B挂钩/固定到同一标准）。","相关习语：a round peg in a square hole（格格不入的人/事）；peg out（英式口语：精疲力竭；也可指死去，语气较口语）。"]}
{"word":"peg","summary":{"en":"A peg is a small pin/clip used to fasten things; as a verb, it means to fasten with a peg or to fix something at a set level (often by linking it).","zh":"peg 指用于固定的“小钉/小栓/夹子”；作动词可指“用栓/夹子固定”，也可指“把价格、汇率等固定在某一水平（与……挂钩）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pin or rod used to fasten something, hold something in place, or hang something up (often made of wood or plastic)","zh":"（通常为木质或塑料的）小钉/栓/夹子，用来固定、支撑或挂住物品"},"examples":[{"en":"She hung the laundry on the line with wooden pegs.","zh":"她用木夹子把衣服夹在晾衣绳上。"},{"en":"Put a peg in the hole to keep the shelf steady.","zh":"在孔里插个栓子，让架子更稳。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fasten, hang, or secure something using a peg; to pin something in place","zh":"用栓/夹子固定；用钉固定；把……钉住/夹住"},"examples":[{"en":"He pegged the note to the board.","zh":"他把便条钉在公告板上。"},{"en":"Peg the tent down so the wind doesn’t blow it away.","zh":"把帐篷钉牢，免得被风吹走。"}]},{"partOfSpeech":"vt.","definition":{"en":"to set or keep something at a fixed level by linking it to something else (especially prices or exchange rates)","zh":"（把价格、汇率等）钉住/固定在某个水平；与……挂钩"},"examples":[{"en":"The currency is pegged to the U.S. dollar.","zh":"该国货币与美元挂钩。"},{"en":"They pegged the fee at $50.","zh":"他们把费用定在50美元。"}]}],"synonyms":["pin","clip","fasten","fix","anchor","attach"],"phonetic":"/pɛɡ/","extraExplanation":["“peg”在日常生活里常见于“clothes peg”（英式更常说；美式也说“clothespin”衣夹）。","常见搭配：be pegged to…（与……挂钩/盯住）；peg down（把……钉牢，多用于帐篷、布等）。","相关短语：peg out（非正式：精疲力尽；也可指“死去”，语气较口语，使用时注意场合）。"]}
{"word":"pega","summary":{"en":"“Pega” is most commonly a software company/platform name in English; lowercase “pega” is also a Spanish/Portuguese word related to “glue” or “to stick/attach (and sometimes hit/catch).”","zh":"“Pega”在英语里最常见是软件公司/平台名称；小写“pega”也可能是西班牙语/葡萄牙语词，和“胶水”或“粘住/贴上（有时也指打/抓住）”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A U.S. software company and platform (Pega Systems) known for CRM and business process automation tools.","zh":"（专有名词）美国软件公司/平台（Pega Systems），以客户关系管理（CRM）和业务流程自动化工具闻名。"},"examples":[{"en":"Our team uses Pega to automate customer service workflows.","zh":"我们团队用 Pega 来自动化客户服务的工作流程。"},{"en":"She works as a Pega developer.","zh":"她是一名 Pega 开发工程师。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Portuguese) Glue; a sticky substance used to attach things.","zh":"（葡萄牙语）胶水；用来把东西粘在一起的黏性物质。"},"examples":[{"en":"In Portuguese, “pega” can refer to glue.","zh":"在葡萄牙语里，pega 可以指“胶水”。"},{"en":"He fixed the model with pega (glue).","zh":"他用 pega（胶水）把模型修好了。"}]},{"partOfSpeech":"v.","definition":{"en":"(In Spanish/Portuguese, verb form) “pega” is a form of the verb meaning “sticks/attaches,” and in some contexts “hits/strikes” or “catches.”","zh":"（西班牙语/葡萄牙语动词形式）pega 是动词的一种形式，常表示“粘住/贴上”，在一些语境里也可表示“打/击”或“抓住/赶上”。"},"examples":[{"en":"Spanish: El papel pega bien con esta pasta.","zh":"西班牙语：这张纸用这种浆糊粘得很牢。"},{"en":"Portuguese: A tinta não pega na parede.","zh":"葡萄牙语：油漆在墙上附着不住。"}]}],"synonyms":["Pega Systems","glue (Portuguese sense)","stick/attach (verb sense)"],"phonetic":"/ˈpɛɡə/","extraExplanation":["在英语语境中，如果你看到大写的“Pega”，通常是指软件公司/产品名，读音更固定。小写“pega”更常见于西班牙语或葡萄牙语文本中；它不是一个常见的英语词。","如果你告诉我你看到“pega”的句子或它来自哪种语言（西语/葡语/软件名/别的），我可以给出更精确的释义。"]}
{"word":"pegador","summary":{"en":"Pegador (Brazilian Portuguese slang) means a “player”—someone who easily picks people up for dates or casual hookups.","zh":"Pegador（巴西葡语俚语）指“情场玩家/花花公子”，很会搭讪、容易约到人，多用于短暂恋爱或暧昧语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Brazilian Portuguese, slang) A person—usually a man—who often flirts and easily “picks up” people for dates or casual hookups; a womanizer / player.","zh":"（巴西葡语俚语）常常搭讪、很会“把到人”用于约会或短暂关系的人；花花公子、情场玩家。"},"examples":[{"en":"People say he’s a pegador because he’s always flirting at parties.","zh":"大家说他是个 pegador，因为他在派对上总在撩人。"},{"en":"She doesn’t want to date a pegador—she wants something serious.","zh":"她不想和 pegador 交往——她想要认真稳定的关系。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who is good at getting what they want or “making things happen,” especially in dating and social situations (informal).","zh":"（非正式）很会“搞定事情/拿下目标”的人，常用于社交或恋爱语境。"},"examples":[{"en":"He’s a pegador—he always manages to get invited to the best events.","zh":"他很 pegador——总能混进最好的活动。"}]}],"synonyms":["player","womanizer","lady-killer","pick-up artist"],"phonetic":"/ˌpɛɡəˈdɔr/","extraExplanation":["“Pegador”来自动词“pegar”（抓住、拿到；口语里也可指“勾搭/接吻/发生关系”），所以在恋爱语境中常带“很会撩、容易约到人”的意思。","语气通常偏口语、带一点调侃或负面评价（类似英文的“player / womanizer”）。在不同圈子里也可能被当作“很有魅力”的夸法，但要看语境。","阴性形式常见为“pegadora”（指女性）。在正式场合或不熟的人面前使用要谨慎，避免冒犯。"]}
{"word":"pegall","summary":{"en":"“pegall” isn’t a recognized English word; it’s probably a typo or a name. Share the sentence and I’ll identify the intended word.","zh":"“pegall”不是常见英语词，更可能是拼写错误或名字。把它所在的句子发我，我可以帮你确认真正想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a username/proper name. Common close possibilities include “peg all” (verb phrase), “pedal,” or “legal.”","zh":"不是标准英语单词。更可能是拼写错误、用户名或专有名称。常见的相近可能包括“peg all”（动词短语）、“pedal（踩踏板）”或“legal（合法的）”。"},"examples":[{"en":"I can’t find “pegall” in a dictionary—did you mean “legal” or “pedal”?","zh":"我在词典里找不到“pegall”——你是不是想写“legal”或“pedal”？"},{"en":"If you meant “peg all,” you might say: “Peg all the photos to the line so they don’t blow away.”","zh":"如果你想表达“peg all”，你可以说：“把所有照片都用夹子夹在绳子上，这样就不会被风吹走。”"}]}],"phonetic":"pɛɡɔl","extraExplanation":["“peg”作动词常见意思是“用夹子/钉子固定；钉住”。如果你能告诉我“pegall”出现的句子或语境（聊天、游戏、作业、品牌名等），我可以更准确判断你想查的词。"]}
{"word":"pegamoid","summary":{"en":"Pegamoid is an (often trademarked) artificial leather-like material, especially for book covers and cheap bindings.","zh":"Pegamoid是一种（常带商标色彩的）仿皮材料，尤其用于书封和廉价装订。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trademarked type of artificial leather (often made from coated paper or fabric) used for book covers, labels, and cheap bindings; also used more generally to mean imitation leather.","zh":"一种商标化的人造皮革（常由涂层纸或布制成），常用于书封、标签和廉价装订；也可泛指仿皮材料。"},"examples":[{"en":"The old handbook had a pegamoid cover that looked like leather but felt like coated paper.","zh":"那本旧手册的封面是pegamoid材质，看起来像皮革，但摸起来更像涂层纸。"},{"en":"Libraries sometimes used pegamoid for durable, low-cost book bindings.","zh":"图书馆有时会用pegamoid做耐用又省钱的书籍装订。"}]}],"synonyms":["faux leather","imitation leather","artificial leather","leatherette"],"phonetic":"/ˈpɛɡəˌmɔɪd/","extraExplanation":["“Pegamoid”最早常见于20世纪初的产品与印刷/装订领域，通常被当作一种人造皮革的商品名或材料名使用。如今在日常英语里较少见，更常用的说法是“imitation/faux leather（仿皮/人造皮革）”或“vinyl leather（乙烯基人造革）”。"]}
{"word":"peganite","summary":{"en":"A rare/nonstandard word meaning “pagan; follower of paganism.”","zh":"一个罕见/非标准拼写，意思是“异教徒；信奉异教的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) A person who follows pagan religions or paganism; essentially the same as “pagan.”","zh":"（罕见/非标准拼写）信奉异教/多神信仰的人；基本同“pagan（异教徒）”。"},"examples":[{"en":"In older texts, you may see “peganite” used where modern English would say “pagan.”","zh":"在较旧的文本里，你可能会看到用“peganite”来表示现代英语中的“pagan（异教徒）”。"},{"en":"The novel contrasts the peganite villagers with the newly converted church community.","zh":"小说把异教徒村民与新近皈依教会的社区作对比。"}]}],"synonyms":["pagan","heathen (sometimes offensive/dated)"],"phonetic":"/ˈpeɡəˌnaɪt/","extraExplanation":["“peganite”并不是现代英语里常见、规范的拼写，更常见的是“pagan”（异教徒）或“paganism”（异教信仰）。如果你是在地质/矿物语境中看到这个词，也可能是拼写误差；建议你提供原句或上下文，我可以帮你确认是否本应是别的术语（例如某种岩石名）。"]}
{"word":"peganum","summary":{"en":"Peganum is a plant genus, especially known for Peganum harmala (Syrian rue).","zh":"Peganum 是一个植物属名，尤其以物种 Peganum harmala（Syrian rue）最为人熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the caltrop family (Zygophyllaceae), best known for the species Peganum harmala (Syrian rue).","zh":"一种开花植物属（蒺藜科，Zygophyllaceae），最著名的物种是Peganum harmala（叙利亚芸香／哈马拉草，常称 Syrian rue）。"},"examples":[{"en":"Researchers studied Peganum harmala for its alkaloids.","zh":"研究人员研究了Peganum harmala（Peganum属植物）中的生物碱。"},{"en":"In some dry regions, Peganum species grow naturally.","zh":"在一些干旱地区，Peganum属的植物会自然生长。"}]}],"synonyms":["Peganum (genus)","Peganum harmala (Syrian rue)"],"phonetic":"ˈpɛɡənəm","extraExplanation":["“Peganum”是拉丁化的植物学属名，日常英语里通常出现在学术文章、植物名录或药用植物讨论中。","该属中最常被提到的是Peganum harmala（Syrian rue）。它在部分文化中与传统草药、染料或熏香有关，但也可能具有毒性与药理活性；不要将其当作一般可安全食用的植物。若涉及使用或摄入，应以专业医疗与当地法规为准。"]}
{"word":"pegasean","summary":{"en":"Pegasean means “related to Pegasus,” and often describes lofty, poetic inspiration or imagination.","zh":"Pegasean 指“与飞马有关”，并常用来形容高远、诗意的灵感或想象力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pegasus (the winged horse in Greek mythology), often suggesting poetry, imagination, or lofty inspiration.","zh":"与“珀伽索斯/飞马”（希腊神话中的有翼马）有关；常引申为诗意、想象力或高远的灵感。"},"examples":[{"en":"The critic praised her Pegasean imagery—bright, airborne, and full of wonder.","zh":"评论家称赞她的“飞马式”意象：明亮、腾空而起、充满奇幻感。"},{"en":"He chased a Pegasean dream of writing the perfect poem.","zh":"他追逐着一种“飞马式”的梦想：写出完美的诗。"}]}],"synonyms":["poetic","inspired","imaginative","mythic","lofty"],"phonetic":"/ˌpɛɡəˈsiːən/","extraExplanation":["Pegasean 来自 Pegasus（珀伽索斯/飞马）。在西方文学传统里，Pegasus 常象征诗歌灵感与创作的“飞翔”。因此 Pegasean 不仅表示“与飞马有关”，也常带有“富于诗意、想象力奔放、格调高远”的联想色彩。","用法上多见于文学评论、散文或较正式的文体中；日常口语里更常用 poetic、inspired、imaginative 等词来表达类似意思。"]}
{"word":"pegasian","summary":{"en":"Pegasian means ‘of Pegasus’ or, in a literary sense, ‘poetically inspired and soaring.’","zh":"Pegasian意为“与飞马珀伽索斯有关的”，也可（文学上）指“富有诗意灵感、文风高远飞扬的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pegasus (the winged horse in Greek mythology) or to something Pegasus-like, especially swift, lofty, or winged.","zh":"与（希腊神话中的）飞马珀伽索斯有关的；像飞马般的，尤指迅捷的、崇高飘逸的或有翼的。"},"examples":[{"en":"The museum displayed a Pegasian statue with wide, outstretched wings.","zh":"博物馆展出了一尊珀伽索斯（飞马）主题的雕像，双翼大张。"},{"en":"The author describes the hero’s Pegasian leap across the ravine.","zh":"作者描写主人公如飞马般纵身一跃，跨过峡谷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Inspired by poetry; having an elevated, imaginative, or soaring style.","zh":"（文学用语）富于诗意灵感的；文风高远、想象飞扬的。"},"examples":[{"en":"Her Pegasian language turns an ordinary evening into something magical.","zh":"她富于飞扬诗意的语言，让一个普通夜晚变得像魔法般迷人。"},{"en":"The speech aimed for a Pegasian tone, though some listeners preferred plain words.","zh":"这场演讲力求一种高远诗意的语气，但有些听众更喜欢朴实的表达。"}]}],"synonyms":["Pegasus-like","winged","soaring","poetic","inspired"],"phonetic":"/pəˈɡeɪʒən/","extraExplanation":["“Pegasian”来自“Pegasus（珀伽索斯）”。在西方文化里，珀伽索斯常象征灵感、诗歌与想象力，因此“Pegasian”在文学语境中可引申为“诗意的、飞扬的”。","写作中它偏书面/文学色彩；日常口语更常用“poetic（诗意的）”“inspired（有灵感的）”“soaring（高昂的/宏伟的）”。"]}
{"word":"pegasid","summary":{"en":"Pegasid means a winged horse like Pegasus; in astronomy (often plural), Pegasids are meteors linked to the constellation Pegasus.","zh":"Pegasid 指类似珀伽索斯的飞马；在天文学中（常用复数）Pegasids 指与飞马座相关的流星/流星雨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winged horse; a creature like Pegasus (often used in fantasy or mythology).","zh":"飞马；类似珀伽索斯（Pegasus）的有翼马（常见于神话或奇幻作品）。"},"examples":[{"en":"In the story, a pegasid carries the hero across the mountains.","zh":"在故事里，一匹飞马驮着英雄飞越群山。"},{"en":"Artists often paint pegasids as symbols of freedom and inspiration.","zh":"艺术家常把飞马画成自由与灵感的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(astronomy, usually plural) meteors associated with the constellation Pegasus; the Pegasids meteor shower.","zh":"（天文学，常用复数）与飞马座相关的流星；“飞马座流星雨”（Pegasids）。"},"examples":[{"en":"We stayed up late to watch the Pegasids meteor shower.","zh":"我们熬夜观看飞马座流星雨。"},{"en":"The Pegasids are best seen in a dark sky away from city lights.","zh":"在远离城市灯光的黑暗天空中更容易看到飞马座流星。"}]}],"synonyms":["winged horse","Pegasus-like horse","Pegasus (myth)","Pegasids (meteor shower)"],"phonetic":"/ˈpɛɡəsɪd/","extraExplanation":["“Pegasid”常见于文学/奇幻语境，也会出现在天文学里（多用复数 Pegasids）。词形来自“Pegasus（珀伽索斯，希腊神话的飞马）+ -id”，-id 常用来表示“属于……的/与……有关的（群体或后代）”。","如果你原本想查的是“Pegasus（珀伽索斯）”或拼写为“Pegasid(s)”，也可以告诉我你的上下文（小说/游戏/天文），我能给更贴切的释义与用法。"]}
{"word":"pegasidae","summary":{"en":"Pegasidae: the fish family known as sea moths, small armored bottom-dwelling marine fishes with wing-like fins.","zh":"Pegasidae：飞海蛾科（海蛾），一类有骨质外甲、栖息海底且胸鳍如翅的小型海水鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small marine fishes (sea moths) with bony armor and wing-like pectoral fins, usually found on sandy or muddy seafloors in warm seas.","zh":"（鱼类）飞海蛾科：一类小型海水鱼（常称“海蛾/飞海蛾”），具有骨质外甲和像翅膀一样的胸鳍，多生活在温暖海域的沙质或泥质海底。"},"examples":[{"en":"Pegasidae are sometimes called sea moths because their fins look like wings.","zh":"Pegasidae 常被称为“海蛾”，因为它们的鳍看起来像翅膀。"},{"en":"Researchers recorded a Pegasidae species moving slowly along the sandy bottom.","zh":"研究人员记录到一种 Pegasidae 鱼在沙底缓慢移动。"}]}],"synonyms":["sea moths (family)"],"phonetic":"/pɪˈɡæsɪdiː/","extraExplanation":["“Pegasidae”是生物分类学名称，指一个“科（family）”。日常英语里更常说 sea moth（海蛾）来指这个科的成员。","词源上与希腊神话中的“Pegasus（珀伽索斯/天马）”有关，暗示其胸鳍展开像“翅膀”。","在科普或学术写作中常见写法：the family Pegasidae；若指单个物种，通常会用具体属名与种加词（如某某属某某种）。"]}
{"word":"pegasoid","summary":{"en":"Pegasoid means “Pegasus-like”: resembling a winged horse, or a Pegasus-like creature in fantasy contexts.","zh":"pegasoid 表示“像飞马（珀伽索斯）的”：可形容飞马般的特质，也可指奇幻作品中的飞马类生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Fantasy or poetic) Resembling Pegasus; like a winged horse—often suggesting something noble, magical, or inspirational.","zh":"（奇幻或诗意用法）像珀伽索斯（飞马）的；像有翅膀的马——常带有高贵、魔法或灵感的意涵。"},"examples":[{"en":"The artist painted a pegasoid steed rising above the clouds.","zh":"画家画了一匹飞马般的骏马，冲上云端。"},{"en":"Her pegasoid dreams of flight kept her writing every night.","zh":"她那些飞马般的飞翔梦想让她每晚坚持写作。"}]},{"partOfSpeech":"n.","definition":{"en":"A Pegasus-like creature; a winged horse (used mostly in fantasy settings).","zh":"像珀伽索斯的生物；有翅膀的马（多见于奇幻作品语境）。"},"examples":[{"en":"In the story, a pegasoid carries the hero to a hidden mountain temple.","zh":"故事里，一只飞马般的生物把英雄载到隐秘的山中寺庙。"}]}],"synonyms":["pegasus-like","winged-horse-like","mythic","fantastical"],"phonetic":"/ˈpɛɡəˌsɔɪd/","extraExplanation":["“Pegasoid”由“Pegasus（珀伽索斯，希腊神话中的飞马）+ -oid（表示‘像……的’）”构成，意思就是“像飞马的”。它不是日常高频词，更常见于诗歌、奇幻文学、游戏或粉丝文化中，用来营造神话般、浪漫或超现实的气氛。","更常见、也更自然的说法通常是“pegasus-like”或直接用“Pegasus / a winged horse”。"]}
{"word":"pegasus","summary":{"en":"Pegasus is the winged horse of Greek mythology and a common symbol of imagination and inspiration; it’s also used as a modern name (and a constellation) linked to flight and ambition.","zh":"Pegasus 指希腊神话中的“有翼天马”，常象征想象力与灵感；也常作为现代名称（以及星座“飞马座”）使用，带有飞翔与雄心的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a famous winged horse born from the blood of Medusa; often used as a symbol of imagination, poetry, or inspiration.","zh":"希腊神话中的著名“有翼天马”，据说由美杜莎的血诞生；常被用来象征想象力、诗意或灵感。"},"examples":[{"en":"In the myth, Pegasus flies into the sky and becomes a symbol of freedom.","zh":"在神话里，天马飞向天空，成为自由的象征。"},{"en":"The poet compared her ideas to Pegasus—fast, bright, and hard to catch.","zh":"诗人把她的灵感比作天马——迅捷、耀眼，又难以捕捉。"},{"en":"The book cover shows Pegasus to suggest magic and imagination.","zh":"书的封面画了天马，用来暗示魔法与想象力。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for many modern things (such as companies, products, missions, or the Pegasus constellation) to suggest speed, flight, or creativity.","zh":"现代常用的名称（如公司、产品、任务或“飞马座”）之一，用来表达速度、飞行或创造力的意象。"},"examples":[{"en":"Pegasus is also the name of a constellation you can see in the autumn sky.","zh":"Pegasus 也是一个星座的名字，你可以在秋季夜空中看到“飞马座”。"},{"en":"Their project was called Pegasus to suggest a bold, high-flying goal.","zh":"他们把项目命名为 Pegasus，暗示目标大胆、志向高远。"}]}],"synonyms":["winged horse","mythical horse","Flying Horse (as a description)","the Winged Steed (literary)"],"phonetic":"/ˈpɛɡəsəs/","extraExplanation":["Pegasus（珀伽索斯/珀伽索斯，中文常译“天马”）出自希腊神话，最常见的故事是它与英雄 Bellerophon（贝勒罗丰）一起作战，并与灵感之泉 Hippocrene（希波克瑞涅泉）有关，因此在西方文学与艺术里常被当作“诗与灵感”的象征。","英语里大写 Pegasus 通常指神话角色或星座；小写 pegasus 有时会在诗歌/文学中泛指“天马”或“有翼的马”（较少见，更多仍用大写专名）。"]}
{"word":"pegboard","summary":{"en":"A pegboard is a hole-punched board used to hang items (especially tools) or to insert pegs for crafts and simple games.","zh":"pegboard 指带孔的板，常用于挂工具等物品，也可用于插钉做手工图案或简单游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A board with many small holes used to hang tools, hooks, or other items in an organized way.","zh":"一种有许多小孔的板，用来插上挂钩或配件，以便把工具等物品整齐地挂起来。"},"examples":[{"en":"He hung his screwdrivers on the pegboard above the workbench.","zh":"他把螺丝刀挂在工作台上方的洞洞板上。"},{"en":"A pegboard helps keep a small garage tidy.","zh":"洞洞板能让小车库更整洁。"}]},{"partOfSpeech":"n.","definition":{"en":"A perforated board used in crafts or games where you insert pegs to make patterns or keep score.","zh":"一种打孔板，用于手工或游戏，把小钉/插针插入孔中来做图案或记分。"},"examples":[{"en":"The kids made shapes by putting colored pegs into the pegboard.","zh":"孩子们把彩色插针插进插钉板里做图形。"}]}],"synonyms":["perforated board","tool board","tool organizer"],"phonetic":"/ˈpɛɡˌbɔrd/","extraExplanation":["在美式英语里，pegboard 最常见的场景是车库或工作间的“工具墙”。通常会搭配 peg（插钉/挂钩）和 hook（挂钩）一起使用，比如 pegboard hooks（洞洞板挂钩）。","有时也会写作 peg board，但更常见的拼写是合在一起的 pegboard。"]}
{"word":"pegboards","summary":{"en":"Pegboards are perforated boards used with pegs/hooks to hang and organize items, often tools or store merchandise.","zh":"Pegboards 指带孔的挂板，配合挂钩/插钉用于悬挂整理物品，常用来收纳工具或展示商品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a board with many small holes, used with pegs/hooks to hang and organize things (especially tools or store items)","zh":"（常见于车库/工坊或商店的）打孔挂板；用挂钩/插钉把物品挂起来整理的板"},"examples":[{"en":"The mechanic hangs wrenches and screwdrivers on a pegboard.","zh":"修理工把扳手和螺丝刀挂在打孔挂板上。"},{"en":"We installed pegboards in the garage to keep everything off the floor.","zh":"我们在车库里装了打孔挂板，好让东西都离开地面、收纳更整齐。"},{"en":"Many small shops use pegboards to display snacks and accessories.","zh":"很多小店用打孔挂板来陈列零食和小配件。"}]}],"synonyms":["perforated board","tool board","display board"],"phonetic":"/ˈpɛɡˌbɔrd/","extraExplanation":["“Pegboard(s)”是“pegboard”的复数形式。美国日常语境里很常见，尤其在车库（garage）、工坊（workshop）和五金店（hardware store）。","常见搭配：pegboard hooks（挂钩）、pegboard organizer（挂板收纳）、hang … on a pegboard（把……挂在挂板上）。"]}
{"word":"pegbox","summary":{"en":"A part of a string instrument (like a violin) that holds the tuning pegs.","zh":"弦乐器上用来安装调音弦轴的部位（弦轴箱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The upper part of a violin, viola, cello, or similar string instrument that holds the tuning pegs; it is usually at the end of the neck, just below the scroll.","zh":"（小提琴、中提琴、大提琴等弦乐器的）弦轴箱；位于琴颈末端、琴头（卷轴）下方，用来安装并固定调音弦轴。"},"examples":[{"en":"The luthier checked the pegbox to make sure the pegs turned smoothly.","zh":"制琴师检查了弦轴箱，确保弦轴转动顺畅。"},{"en":"If the peg slips, a small adjustment in the pegbox can help the instrument stay in tune.","zh":"如果弦轴打滑，在弦轴箱里做一点小调整能帮助乐器保持音准。"}]}],"synonyms":["peg box"],"phonetic":"/ˈpɛɡˌbɑks/","extraExplanation":["弦轴箱（pegbox）常见于使用“木质弦轴（friction pegs）”的弦乐器。弦轴靠摩擦力固定弦的张力，因此会出现“打滑（slip）”或“卡住（stick）”的情况；演奏者有时会用弦轴膏（peg compound/peg dope）来改善手感。","与“弦轴箱”相关的部位：scroll（琴头/卷轴）、nut（上弦枕）、fingerboard（指板）。一些现代小提琴也可能加装 fine tuners（微调器），但它们通常在尾部（tailpiece）而不是弦轴箱。"]}
{"word":"pegboxes","summary":{"en":"“Pegboxes” is the plural of “pegbox,” the part of a violin-family instrument that holds the tuning pegs.","zh":"“pegboxes”是“pegbox”的复数，指小提琴族弦乐器上用来固定调音弦轴的弦轴箱（琴轴箱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of a string instrument (especially violin-family instruments) at the top of the neck that holds the tuning pegs.","zh":"（弦乐器，尤指小提琴族）琴颈顶部用于安装并固定调音弦轴的“弦轴箱/琴轴箱”。"},"examples":[{"en":"The luthier repaired a crack in the violin’s pegbox.","zh":"制琴师修复了小提琴弦轴箱上的裂缝。"},{"en":"If the pegs slip, the problem may be in the pegbox rather than the strings.","zh":"如果弦轴打滑，问题可能在弦轴箱而不在琴弦。"},{"en":"Dust can build up around the pegbox and make tuning harder.","zh":"灰尘可能堆积在弦轴箱附近，让调音更困难。"}]}],"synonyms":["peg box","tuning-peg box","head (informal, instrument context)"],"phonetic":"/ˈpɛɡˌbɑks/","extraExplanation":["“pegbox”由 peg（弦轴/木钉）+ box（盒状结构）构成。你输入的“pegboxes”是复数形式，常用于讨论多把乐器或对比不同乐器的结构。","在小提琴、中提琴、大提琴等乐器上，pegbox 通常位于 scroll（琴头/卷头）下方；吉他等多用 machine heads/tuning machines（机械弦钮），因此一般不叫 pegbox。"]}
{"word":"pegged","summary":{"en":"“Pegged” usually means fixed/attached (or linked to a set level), or informally “identified as.” It is also the past form of “peg.”","zh":"“Pegged”常表示“被固定/与某数值挂钩”，口语里也可表示“被认定为”。它也是动词“peg”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “peg”: to fasten or fix something using a peg (a small pin or hook), or to attach something firmly in place","zh":"“peg”的过去式/过去分词：用木钉/栓子固定；把东西牢牢钉住或固定在某处"},"examples":[{"en":"She pegged the tent to the ground before the wind got stronger.","zh":"风变大之前，她把帐篷用地钉固定在地上。"},{"en":"The notice was pegged on the board with a clip.","zh":"通知用夹子固定在公告板上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) fixed, tied to, or kept at a particular level; firmly attached or set","zh":"（形容词）被固定在某一水平/数值；与某物挂钩；被牢牢系住或设定好的"},"examples":[{"en":"The company’s price was pegged to the dollar.","zh":"这家公司的价格与美元挂钩。"},{"en":"Interest rates are pegged at a low level this year.","zh":"今年利率被维持在较低水平。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, adj.) identified, judged, or labeled in a certain way (often based on limited information)","zh":"（非正式，形容词）被认定/被贴标签为某种人或某种情况（常常依据有限信息）"},"examples":[{"en":"He was pegged as the best candidate after the first interview.","zh":"第一次面试后，他就被认为是最佳人选。"},{"en":"Don’t peg her as shy just because she’s quiet in meetings.","zh":"别因为她开会时安静，就把她认定为害羞。"}]}],"synonyms":["fixed","fastened","attached","tied","linked","set","labeled","identified","tagged"],"phonetic":"/pɛɡd/","extraExplanation":["“pegged”在口语里也可能指一种成人性行为（“peg/pegging”）。在一般英语学习或正式场合不常用到；如果你是在阅读/社交媒体中遇到该用法，需要根据语境判断，避免在不合适的场合使用。"]}
{"word":"pegger","summary":{"en":"“Pegger” usually means someone/something that uses pegs to fasten or fix things; it can also be an explicit sexual slang term.","zh":"“Pegger”通常指用木栓/夹子等固定东西的人或工具；也可指露骨的性俚语用法，需注意语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that pegs something (fastens, marks, or fixes something in place using a peg).","zh":"用钉/夹子/木栓等把东西固定、夹住或标记的人或工具；“钉住/夹住者”。"},"examples":[{"en":"Use a pegger to fasten the fabric so it doesn’t slip.","zh":"用一个夹具（pegger）把布固定住，免得它滑动。"},{"en":"In the workshop, he worked as a pegger, attaching parts with small pegs.","zh":"在车间里，他做“钉装工”（pegger），用小木栓把零件固定起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, sexual) A person who performs “pegging” (a sexual act involving penetration with a strap-on).","zh":"（俚语，性相关）进行“pegging”（用绑带式假阳具进行插入的性行为）的人。"},"examples":[{"en":"That term is slang and can sound explicit in everyday conversation.","zh":"这个词属于俚语，在日常对话里可能显得露骨。"}]}],"synonyms":["fastener","clip","peg (tool)","one who fastens"],"phonetic":"/ˈpɛɡɚ/","extraExplanation":["“Pegger”并不是非常常见的日常词汇；在普通语境里更常用的是动词 peg（固定/标记）或名词 peg（木栓/夹子）。如果你在网络或成人内容里看到 pegger，往往指第二条的性俚语含义，使用时要注意场合与对象。","在某些行业或旧式用法中，pegger 也可能指做“钉装/钉扣/上栓”等工序的人（具体取决于地区与行业）。遇到该词时最好结合上下文判断。"]}
{"word":"pegging","summary":{"en":"“Pegging” most commonly means fixing something with pegs/clips, setting a value at a fixed level (especially currency), or labeling/identifying someone; it also has a sexual slang meaning.","zh":"“pegging”常指用夹子/木栓固定、（尤指汇率等）固定在某水平、或把人归类/贴标签；另外它也有性相关俚语含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fastening or fixing something with a peg; attaching something in place.","zh":"用钉子/木栓固定；把某物钉住或固定在某处。"},"examples":[{"en":"She was pegging the laundry on the line to dry.","zh":"她用衣夹把衣服夹在晾衣绳上晾干。"},{"en":"The notice was pegged to the board.","zh":"通知被钉在公告板上。"}]},{"partOfSpeech":"n.","definition":{"en":"Setting or keeping a value at a fixed level (especially in economics/finance), or maintaining something at a particular level.","zh":"（尤指经济/金融）把（价格、汇率等）固定在某个水平；使保持在特定水平。"},"examples":[{"en":"The central bank discussed pegging the currency to the dollar.","zh":"央行讨论将本国货币与美元挂钩。"},{"en":"They’re pegging annual growth at about 2%.","zh":"他们把年增长率估计/定在约2%。"}]},{"partOfSpeech":"n.","definition":{"en":"Identifying or labeling someone as a particular type (often based on limited information).","zh":"把某人认定/归类为某种类型（常带有主观判断或依据不足）。"},"examples":[{"en":"People pegged him as shy, but he was just quiet at first.","zh":"大家把他认定为害羞，但他只是刚开始比较安静。"},{"en":"It’s unfair to peg someone based on one mistake.","zh":"因为一次失误就给一个人贴标签是不公平的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, sexual) A sexual activity in which a woman penetrates a partner (typically a man) using a strap-on dildo.","zh":"（俚语，性相关）指女性使用绑带式假阳具对伴侣（常为男性）进行插入式性行为。"},"examples":[{"en":"The movie makes a brief joke about pegging (adult slang).","zh":"电影里对“pegging”（成人俚语）开了个简短玩笑。"},{"en":"That term is sexual slang, so be careful where you use it.","zh":"这个词属于性相关俚语，使用场合要注意。"}]}],"synonyms":["fastening","clipping","fixing","pegging to","tying","linking","pegged (at)","estimating","labeling","typecasting"],"phonetic":"/ˈpɛɡɪŋ/","extraExplanation":["“peg”本义是“木栓/钉子”，所以 pegging 常与“固定、钉住、夹住”相关（如夹衣服、把纸钉住）。","金融语境里“peg a currency to …”常译为“将货币与……挂钩/盯住（固定汇率）”；新闻里也常见“peg … at + 数字”，表示“把……估计/定在某个数值”。","“pegging”在口语里也有明确的性俚语含义；在正式写作或不确定听众时，建议避免使用或改用更中性的表达。"]}
{"word":"peggle","summary":{"en":"Peggle is the name of a popular casual puzzle video game series about shooting balls to hit pegs.","zh":"Peggle 是一款知名休闲益智游戏系列的名称，玩法以发射小球击中钉子为核心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casual puzzle video game series (originally by PopCap Games) where you shoot a ball to hit orange pegs and clear the board; often used as a proper name.","zh":"《Peggle》：一款休闲益智类电子游戏系列（最早由 PopCap Games 推出），玩法通常是发射小球击中橙色钉子并清空关卡；常作专有名词使用。"},"examples":[{"en":"I used to play Peggle after school to relax.","zh":"我以前放学后会玩《Peggle》放松一下。"},{"en":"Peggle’s gameplay feels a bit like pachinko mixed with a puzzle game.","zh":"《Peggle》的玩法有点像柏青哥加上解谜游戏的感觉。"}]}],"phonetic":"/ˈpɛɡəl/","extraExplanation":["“Peggle”通常指游戏标题（商标/专有名词），日常英语里一般不把它当作普通词汇来用；写作时常大写为 Peggle。","发音上常被听成“peg + -le”（peg 意为“钉子/栓钉”），与游戏里“pegs（钉子）”的概念相关。"]}
{"word":"peggr","summary":{"en":"“peggr” is likely a misspelling of “pegger,” meaning someone (or something) that uses pegs to fasten or secure items.","zh":"“peggr”很可能是“pegger”的拼写错误，常指用栓钉/夹子等来固定东西的人或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or tool that fastens something with pegs; someone who uses pegs (small pins) to attach or mark things.","zh":"用木钉/栓（peg）固定东西的人或工具；用栓钉来夹住、固定或做标记的人。"},"examples":[{"en":"The tent pegger secured the ropes before the wind got stronger.","zh":"在风变大之前，负责打地钉的人把绳子固定好了。"},{"en":"She works as a laundry pegger, clipping clothes to the line.","zh":"她做的是夹衣夹的工作，把衣服夹到晾衣绳上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, informal) In some contexts, a person who gives very direct criticism or “pins” someone down with harsh comments.","zh":"（俚语，非正式）在某些语境中，指用尖锐评价“钉住”别人、让人下不来台的人（带贬义）。"},"examples":[{"en":"In meetings, he can be a real pegger—he points out every mistake.","zh":"在会议上他有时很“钉人”——每个错误都会被他指出来。"}]}],"synonyms":["fastener","clipper","pin","fixer"],"phonetic":"/ˈpɛɡɚ/","extraExplanation":["“peggr”本身不是常见的标准英文拼写，更可能是你想写：pegger（用栓钉的人/工具）、pegged（peg 的过去式/过去分词），或 peg（名词/动词：栓钉；用栓钉固定；把价格/标准“钉”在某个水平）。如果你告诉我你看到它的句子上下文，我可以帮你精确判断应是哪一个词。","相关常见搭配：tent peg（帐篷地钉）、clothes peg / clothespin（衣夹，美式更常说 clothespin）、to peg something to something（把A“挂钩/绑定”到B，例如把货币与美元挂钩）。"]}
{"word":"peggy","summary":{"en":"Peggy is a common female first name, often used as a nickname for Margaret.","zh":"Peggy 是常见的英文女性名字，常用作 Margaret 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, usually a nickname (diminutive) of Margaret. Examples: “Peggy is my aunt.” / “Her name is Margaret, but everyone calls her Peggy.”","zh":"（女子名）佩吉；常作 Margaret（玛格丽特）的昵称。例：\"Peggy is my aunt.\"（佩吉是我阿姨。）/ \"Her name is Margaret, but everyone calls her Peggy.\"（她叫玛格丽特，但大家都叫她佩吉。）"},"examples":[{"en":"Peggy lives in Chicago now.","zh":"佩吉现在住在芝加哥。"},{"en":"My grandma’s name was Margaret, and her friends called her Peggy.","zh":"我奶奶叫玛格丽特，她的朋友们叫她佩吉。"}]}],"synonyms":["Margaret (related name)"],"phonetic":"/ˈpɛɡi/","extraExplanation":["Peggy 多被认为是 Margaret 的昵称：历史上 Margaret → Meg（常见昵称）→ Peg（押韵替换的昵称）→ Peggy（再加 -y/-ie 的亲昵称呼）。英语里这种“押韵昵称/变体昵称”并不少见。","在流行文化中你可能会见到这个名字，例如歌曲/电影里的 “Peggy Sue”，或影视角色名（如《广告狂人》里的 Peggy Olson、漫威的 Peggy Carter）。"]}
{"word":"peggymast","summary":{"en":"“peggymast” is not a standard English word; it’s likely a name/username or a misspelling.","zh":"“peggymast”不是标准英语单词；更可能是人名/用户名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word. It is most likely a proper name (e.g., “Peggy Mast”) or a username/handle, or it may be a misspelling of another word.","zh":"不是标准英语词典词汇。更可能是专有名词（如人名“Peggy Mast”）或用户名/网名，也可能是其他单词的拼写错误。"},"examples":[{"en":"I saw “peggymast” as a username on the website.","zh":"我在那个网站上看到“peggymast”作为一个用户名。"},{"en":"Did you mean “Peggy Mast” (a person’s name) or a different word?","zh":"你是指“Peggy Mast”（人名）还是别的单词？"}]}],"phonetic":"/ˈpɛɡi mæst/","extraExplanation":["“peggymast”连写在英语里不常见，也不属于常用词构词模式，因此很可能需要上下文来判断：它可能是人名（Peggy + 姓氏 Mast）、社交媒体账号，或某个专业术语/拼写错误。","如果你想查的是相近拼写的词，请告诉我你看到它的句子或领域（航海/地质/游戏等）。常见的“看起来像”的词包括：Peggy（人名）、mast（桅杆）、以及其他以 peg- 开头的单词。"]}
{"word":"pegh","summary":{"en":"“pegh” is not standard English; it likely means “peg,” a small fastener or the verb meaning to fix/attach or to set at a level.","zh":"“pegh” 不是标准英文；很可能是 “peg”，表示小钉/小夹子，或表示固定、挂钩到某一水平。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“pegh” is not a standard English word; it is most likely a misspelling of “peg.”","zh":"“pegh” 不是标准英文单词；很可能是把 “peg” 拼错了。"},"examples":[{"en":"Did you mean “peg”?","zh":"你是想写 “peg” 吗？"},{"en":"I think “pegh” is a typo.","zh":"我觉得 “pegh” 是打字错误。"}]},{"partOfSpeech":"n.","definition":{"en":"peg (noun): a small pin or stick used to fasten something or mark a position.","zh":"peg（名词）：小钉子/小木栓，用来固定东西或标记位置。"},"examples":[{"en":"She hung the photo on the wall with a wooden peg.","zh":"她用一个木夹（木栓）把照片夹在墙上。"},{"en":"Put the clothes on pegs to dry.","zh":"把衣服夹在衣夹上晾干。"}]},{"partOfSpeech":"v.","definition":{"en":"peg (verb): to fix or attach something using a peg; also, to set or keep something at a particular level (often in finance or prices).","zh":"peg（动词）：用栓/夹子固定；也指（常用于价格或金融）把某物“固定在”某一水平。"},"examples":[{"en":"He pegged the tent to the ground.","zh":"他把帐篷用地钉固定在地上。"},{"en":"The company pegged its prices to inflation.","zh":"这家公司把价格与通货膨胀挂钩（按通胀调整）。"}]}],"synonyms":["pin","clip","fasten","attach"],"phonetic":"/pɛɡ/","extraExplanation":["“peg” 在日常生活里很常见：clothes peg（英式常用，衣夹）/ clothespin（美式常用，衣夹）。如果你告诉我你在哪个句子里看到 “pegh”，我也可以帮你判断是不是某个名字、缩写或拼写错误。"]}
{"word":"peglegged","summary":{"en":"Peglegged means having a peg leg (a wooden artificial leg), often used in pirate or sailor stories.","zh":"Peglegged 指“装有木腿（木制假肢）的”，常见于海盗或水手题材的故事描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a peg leg (a simple wooden artificial leg), or walking as if using one.","zh":"装有木腿（简单的木制假肢）的；或走路像用木腿一样。"},"examples":[{"en":"The old sailor was peglegged and walked with a steady tap on the deck.","zh":"那位老水手装着木腿，在甲板上走路会发出稳定的“嗒嗒”声。"},{"en":"In the story, a peglegged pirate guards the treasure map.","zh":"在故事里，一个装木腿的海盗守着藏宝图。"}]}],"synonyms":["peg-legged","one-legged (less specific)"],"phonetic":"/ˈpɛɡˌlɛɡd/","extraExplanation":["“peglegged”常出现在海盗/水手形象中（比如经典小说《金银岛》里的角色），带有明显的文学与流行文化色彩。现实生活中更中性、更尊重的说法通常是“has a prosthetic leg / is an amputee / uses a prosthetic limb（使用义肢）”。","构词上是 peg（木桩、钉子）+ leg（腿）+ -ed（表示“具有……的”）→ “有木腿的”。也可写作“peg-legged”。"]}
{"word":"pegless","summary":{"en":"Pegless means having no pegs, or missing a peg where one is expected.","zh":"pegless 指“没有钉/桩/挂钩（或弦轴）”，也可指“某处缺少一个钉/桩/挂钩”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without pegs (small pins used to fasten, hang, tune, or support something).","zh":"没有钉子/桩/挂钩（用于固定、悬挂、调音或支撑的小插销）。"},"examples":[{"en":"The pegless hanger works well for delicate clothes because it doesn’t pinch the fabric.","zh":"这种无夹钉衣架很适合精致衣物，因为不会夹伤布料。"},{"en":"Some modern instruments use a pegless tuning system to reduce slipping.","zh":"一些现代乐器采用无弦轴（pegless）的调音系统来减少打滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking a peg in a specific place (a peg is missing).","zh":"缺少某个该有的钉/桩/挂钩（少了一根）。"},"examples":[{"en":"The shelf felt unstable because one corner was pegless.","zh":"这个架子有一角少了固定钉，所以感觉不稳。"},{"en":"The pegless hole shows where the support should be installed.","zh":"那个空洞显示支撑钉本该装在什么位置。"}]}],"synonyms":["without pegs","unpegged","peg-free","missing a peg"],"phonetic":"ˈpɛɡləs","extraExplanation":["“peg”在英文里用途很广：可以是帐篷桩（tent peg）、墙上的挂钩/衣钩（peg）、家具的定位木钉（peg）、也可以指弦乐器的弦轴（tuning peg）。因此“pegless”常见于产品描述或技术语境，表示“没有使用钉/弦轴的设计”，或“缺少某个钉”。","写作中常用连字符“peg-less”来强调“没有”，但合写“pegless”也常见，尤其在标题、说明书或产品文案里。"]}
{"word":"peglet","summary":{"en":"Peglet is a rare word meaning a small peg used for fastening or hanging things.","zh":"peglet 是较少见的词，意思是“小木钉/小栓钉”，用于固定或悬挂物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small peg (a short pin or stick used to fasten or hang something); a little peg.","zh":"小木钉；小栓钉（用来固定、挂住或支撑东西的短钉/小棍）。"},"examples":[{"en":"She pushed a peglet into the soft soil to hold the plant upright.","zh":"她把一根小木钉插进松软的土里，让植物立起来。"},{"en":"The craft kit includes string and tiny peglets for hanging ornaments.","zh":"这套手工材料包里有绳子和一些用来挂装饰物的小栓钉。"}]}],"synonyms":["small peg","little peg","pin (context-dependent)"],"phonetic":"/ˈpɛɡlət/","extraExplanation":["“peglet”在现代英语里非常少见，很多词典不一定收录。通常可以理解为“peg（钉/栓）+ -let（小……）”，表示“更小的peg”。","它很容易和“piglet（小猪）”或“pegleg（木腿；海盗常见的假腿形象）”混淆；如果你的语境与动物或木腿有关，可能是拼写写错了。"]}
{"word":"peglike","summary":{"en":"“Peglike” means shaped like or resembling a peg.","zh":"“peglike”表示“像木栓/钉子一样的、呈栓状/钉状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a peg (a short, usually round stick used to fasten or support something); shaped like a peg.","zh":"像钉子/木栓一样的；呈栓状的、钉状的。"},"examples":[{"en":"The plant has peglike roots that help it stay anchored in the soil.","zh":"这种植物有栓状的根，能帮助它稳稳扎在土里。"},{"en":"She wore earrings with a peglike shape.","zh":"她戴着钉状造型的耳环。"}]}],"synonyms":["peg-shaped","spike-like","rodlike"],"phonetic":"/ˈpɛɡˌlaɪk/","extraExplanation":["“peg”常指“木栓、钉子、栓钉”，用来固定或支撑东西；“-like”表示“像……一样”。所以“peglike”多用于描述形状（细长、圆柱、末端较窄等）而不是材质。","在科学与技术语境（如生物学、医学、工程）中常见，用来形容结构外形，例如“peglike projections（栓状突起）”。"]}
{"word":"pegma","summary":{"en":"Pegma is a rare word meaning an ancient stage framework/machine, and sometimes a rhetorical “stacking” of short statements.","zh":"Pegma 是一个少见词，主要指古代舞台的框架/机械装置；有时也指修辞上连续堆叠的短句。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient theater/history) a wooden framework, scaffold, or stage-machine used to display scenery, props, or spectacular effects.","zh":"（古代戏剧/历史）用于展示布景、道具或制造舞台特效的木架、脚手架或舞台机械装置。"},"examples":[{"en":"In some Roman spectacles, a pegma could lift scenery or reveal a sudden surprise onstage.","zh":"在一些罗马式的表演中，pegma 可以升起布景，或在舞台上突然揭示一个惊喜效果。"},{"en":"The museum label described a pegma as part of ancient stage engineering.","zh":"博物馆的说明牌把 pegma 描述为古代舞台工程的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, rhetoric) a set or series of short, pointed statements arranged one after another for effect.","zh":"（罕见，修辞）为了强化效果而连续排列的一组简短、有力的句子或警句。"},"examples":[{"en":"The speech used a pegma of quick contrasts to build momentum.","zh":"这篇演讲用一连串快速对比的句子（pegma）来推进气势。"},{"en":"In the essay, the author piles up a pegma of sharp observations.","zh":"在文章中，作者堆叠了一串犀利的观察（pegma）。"}]}],"synonyms":["scaffold","framework","stage machinery","apparatus","series"],"phonetic":"/ˈpɛɡmə/","extraExplanation":["“pegma”源自希腊语 πήγμα（意为“固定的框架/支架”）。在英语里非常少见，多出现在古典学、戏剧史或修辞学的学术语境中。","复数常见形式是“pegmata”（也有人写“pegmas”）。日常英语中通常会用“scaffold / framework / stage machinery”来替代。"]}
{"word":"pegman","summary":{"en":"Pegman is best known as the Google Maps Street View icon you drag onto the map.","zh":"Pegman 最常指 Google 地图中用来拖拽进入街景的“小黄人”图标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The small yellow person-shaped icon in Google Maps that you drag onto a map to enter Street View.","zh":"Google 地图里那个可以拖到地图上进入街景（Street View）的小黄人形图标。"},"examples":[{"en":"Drag Pegman onto the blue line to open Street View.","zh":"把 Pegman 拖到蓝色线条上，就能打开街景。"},{"en":"If Pegman doesn’t appear, Street View may not be available in that area.","zh":"如果 Pegman 没出现，可能表示那个地区没有街景。"}]},{"partOfSpeech":"n.","definition":{"en":"A simple small figure shaped like a person, often made from a peg; a peg-doll or peg-style game piece (less common).","zh":"用木钉（peg）做成的简单小人形玩偶或棋子（较少见）。"},"examples":[{"en":"The kids painted little pegmen for their craft project.","zh":"孩子们给小木钉人偶上色做手工。"}]}],"synonyms":["Street View icon","Street View figure","Google Maps Pegman"],"phonetic":"/ˈpɛɡmæn/","extraExplanation":["Pegman 是 Google 给 Street View 小人图标取的昵称：peg（木钉/固定用的小钉子）+ man（人），意思是“像钉子一样的小人”。在不同版本的 Google 地图里外观可能会变化，但功能都是用来进入街景。","在日常英文里，Pegman 作为“Google 街景小人”的用法最常见；第二个“木钉小人”的含义更多见于手工/玩具语境。"]}
{"word":"pegmatite","summary":{"en":"Pegmatite is a coarse-grained igneous rock with very large crystals, often containing quartz and feldspar and sometimes valuable minerals.","zh":"Pegmatite（伟晶岩）是一种晶体极粗大的火成岩，常含石英和长石，也可能富集有价值的矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of igneous rock with very large, easily seen crystals, often made mostly of quartz, feldspar, and mica.","zh":"一种火成岩，晶体非常粗大、肉眼易见，常主要由石英、长石和云母组成。"},"examples":[{"en":"Pegmatite often contains huge crystals compared with most other rocks.","zh":"与大多数岩石相比，伟晶岩常含有非常巨大的晶体。"},{"en":"Mineral collectors sometimes look for rare gemstones in pegmatite.","zh":"矿物收藏者有时会在伟晶岩中寻找稀有宝石。"}]}],"synonyms":["coarse-grained igneous rock"],"phonetic":"/ˈpɛɡməˌtaɪt/","extraExplanation":["“Pegmatite（伟晶岩）”常形成于岩浆结晶的最后阶段，此时富含水和挥发分的熔体更容易让晶体长得很大，因此它的典型特征就是“晶体粗大”。","许多重要矿产与伟晶岩有关，例如锂（常见于锂辉石等矿物）、铍、铌钽以及某些宝石级电气石、绿柱石（祖母绿的矿物家族）等，所以在地质与矿业语境中很常见。"]}
{"word":"pegmatitic","summary":{"en":"Pegmatitic means “related to or having the coarse-crystal texture of pegmatite.”","zh":"pegmatitic 指“与伟晶岩有关的，或具有伟晶岩那种极粗大晶体结构的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, made of, or having the texture of pegmatite (a very coarse-grained igneous rock).","zh":"与伟晶岩有关的；由伟晶岩构成的；具有伟晶岩（极粗粒火成岩）结构特征的。"},"examples":[{"en":"The granite contains pegmatitic veins rich in quartz and feldspar.","zh":"这块花岗岩中含有富含石英和长石的伟晶质（pegmatitic）岩脉。"},{"en":"Under the microscope, the rock shows a pegmatitic texture with unusually large crystals.","zh":"在显微镜下，这种岩石呈现伟晶质结构，晶体异常巨大。"}]}],"synonyms":["pegmatite-related","very coarse-grained","pegmatitic-textured"],"phonetic":"/ˌpɛɡməˈtɪtɪk/","extraExplanation":["“pegmatitic”常用于地质学/岩石学描述岩石的成分或“结构（texture）”。伟晶岩（pegmatite）通常在岩浆结晶的晚期形成，因挥发分富集、冷却条件等因素，常长出非常大的晶体（厘米级甚至更大）。","常见搭配：pegmatitic vein（伟晶质岩脉）、pegmatitic texture（伟晶质结构）、pegmatitic granite（伟晶质花岗岩）。"]}
{"word":"pegmatization","summary":{"en":"Pegmatization is the process by which rocks develop pegmatite-like, very coarse crystals.","zh":"pegmatization 指岩石发生伟晶化，形成类似伟晶岩的极粗大晶体结构的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A geological process in which rocks (especially granitic rocks) develop very coarse-grained texture, forming or resembling pegmatite—often linked to late-stage magma cooling and fluid-rich conditions.","zh":"（地质）伟晶化过程：岩石（尤其是花岗质岩石）形成或变得像伟晶岩那样的“极粗粒”结构的过程，常与岩浆晚期冷却及富流体条件有关。"},"examples":[{"en":"The study suggests that pegmatization occurred during the final stages of granite crystallization.","zh":"研究表明，伟晶化发生在花岗岩结晶的最后阶段。"},{"en":"Mineral veins in the area show signs of pegmatization, with unusually large feldspar and quartz crystals.","zh":"该地区的矿脉显示出伟晶化迹象，长石和石英晶体异常巨大。"}]}],"synonyms":["pegmatitization","pegmatite formation","coarse-graining (geology)"],"phonetic":"/ˌpɛɡmətaɪˈzeɪʃən/","extraExplanation":["“pegmatization”在英文地质文献中相对少见，更常见的对应术语是“pegmatitization”。两者通常都指与伟晶岩（pegmatite）有关的形成或改造过程。","伟晶化常被用来解释“晶体为何能长得很大”：在岩浆演化晚期，残余熔体可能富含水、硼、氟等挥发分，使离子迁移更快、结晶更容易长大，从而形成粗大的石英、长石、云母等晶体。"]}
{"word":"pegmatize","summary":{"en":"To form pegmatite or transform rock into pegmatite (a very coarse-grained igneous rock).","zh":"形成伟晶岩或使岩石发生伟晶岩化（变成晶粒很粗的火成岩）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Geology) To form pegmatite, or to change rock into pegmatite (a very coarse-grained igneous rock).","zh":"（地质）形成伟晶岩，或使岩石伟晶岩化（变成晶粒非常粗大的火成岩）。"},"examples":[{"en":"In some granitic bodies, late-stage fluids can pegmatize the surrounding rock.","zh":"在一些花岗质岩体中，晚期流体可能会使周围岩石发生伟晶岩化。"},{"en":"The authors suggest that hydrothermal activity helped pegmatize parts of the intrusion.","zh":"作者认为，热液活动帮助该侵入体的部分区域发生了伟晶岩化。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Geology) To develop or occur as pegmatite; to become pegmatitic.","zh":"（地质）以伟晶岩形式发育/出现；变得具有伟晶岩特征。"},"examples":[{"en":"The melt segregated and gradually pegmatized along fractures.","zh":"熔体发生分离，并沿裂隙逐渐伟晶岩化。"}]}],"synonyms":["pegmatitize","convert to pegmatite","become pegmatitic"],"phonetic":"ˈpɛɡməˌtaɪz","extraExplanation":["“pegmatize”多见于地质学论文或野外记录中，属于专业用词；日常英语几乎不用。","它与“pegmatite（伟晶岩）”相关。伟晶岩通常形成于岩浆演化晚期，富含挥发分（如水、硼、氟等），有利于晶体长得很大，也常与锂、铍、铌、钽等稀有元素矿化有关。"]}
{"word":"pegmatoid","summary":{"en":"Pegmatoid means “pegmatite-like,” usually describing rocks with very coarse crystals.","zh":"pegmatoid 意为“似伟晶岩的”，常用来形容晶体很粗大的岩石结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling pegmatite (a very coarse-grained igneous rock), especially in texture or mineral grain size.","zh":"似伟晶岩的（尤其指质地或矿物晶粒大小与伟晶岩相似的）。"},"examples":[{"en":"The granite shows a pegmatoid texture near the intrusion, with unusually large crystals.","zh":"这处花岗岩在侵入体附近呈现似伟晶岩的结构，晶体异常粗大。"},{"en":"In thin section, the sample looks pegmatoid because the mineral grains are very coarse.","zh":"在薄片下，这个样品看起来似伟晶岩状，因为矿物颗粒非常粗大。"}]}],"synonyms":["pegmatitic","pegmatite-like"],"phonetic":"/ˈpɛɡməˌtɔɪd/","extraExplanation":["“pegmatoid”主要用于地质学/岩石学写作，描述“像伟晶岩那样粗晶”的外观或结构，但并不一定表示它就是真正的伟晶岩（pegmatite）。","词源上可理解为 pegmatite（伟晶岩） + -oid（“……状/类似……”的后缀），常见于学术描述中。"]}
{"word":"pegmatophyre","summary":{"en":"Pegmatophyre is an igneous rock with very large crystals in a finer-grained groundmass, often linked to late-stage granite magma.","zh":"pegmatophyre（伟晶斑岩）是一种火成岩，特征是粗大晶体嵌在较细的基质中，常与花岗质岩浆晚期作用有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of igneous rock with very large crystals (pegmatitic texture) in a finer-grained base; it is often related to granite and forms from late-stage magma.","zh":"一种火成岩，具有“伟晶质”特征：含有非常大的晶体，但基质较细；常与花岗岩有关，多在岩浆晚期阶段形成。"},"examples":[{"en":"The field team identified a pegmatophyre dike cutting through the granite.","zh":"野外小组辨认出一条穿切花岗岩的伟晶斑岩岩脉。"},{"en":"Rare minerals can sometimes occur in pegmatophyre because of its late-stage magmatic origin.","zh":"由于其岩浆晚期成因，伟晶斑岩中有时会出现稀有矿物。"}]}],"synonyms":["pegmatite (related)","porphyry (related)"],"phonetic":"/ˌpɛɡˈmætəˌfaɪɚ/","extraExplanation":["“pegmatophyre”在地质学里常用来描述一种“斑状/脉状”的岩石：一部分晶体长得特别粗大（类似伟晶岩的晶体），但整体又不像纯伟晶岩那样几乎全是粗晶，而是混有较细的基质。","词源可拆为 pegmat-（与“伟晶/pegmatite”相关）+ -phyre（与“porphyry/斑岩”同源，常指含较大晶体的火成岩）。因此它的名字本身就暗示了“伟晶 + 斑状”的混合特征。"]}
{"word":"pegmen","summary":{"en":"Pegmen is the plural of pegman, most commonly referring to the Google Maps Street View “little person” icon; it can also mean small human-shaped game markers.","zh":"Pegmen 是 pegman 的复数，最常指 Google 地图街景的“黄色小人”图标；也可指桌游等中的小人棋子/标记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of pegman) a small human-shaped figure, especially the yellow icon you drag in Google Maps to enter Street View.","zh":"（pegman 的复数）“小人”形状的图标或小人偶；尤指在 Google 地图里拖拽进入街景（Street View）的黄色小人图标。"},"examples":[{"en":"Drag the Pegman onto a street to open Street View.","zh":"把 Pegman 拖到街道上就能打开街景。"},{"en":"The Pegmen show where Street View coverage is available.","zh":"这些 Pegmen（或相关标记）会显示哪里有街景覆盖。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) small wooden or plastic human figures used as markers or game pieces; peg-shaped people.","zh":"（较少见）用作标记或棋子的木制/塑料小人（像“钉子/木栓”一样的形状）。"},"examples":[{"en":"The board game came with a set of colorful pegmen.","zh":"这款桌游附带了一套彩色小人棋子。"},{"en":"She moved one pegman forward on the track.","zh":"她把其中一个小人棋子在轨道上往前挪了一格。"}]}],"synonyms":["Street View icon","game piece","marker","figurine"],"phonetic":"/ˈpɛɡˌmæn/","extraExplanation":["在日常英文里，“Pegman”最常见的语境是 Google Maps 的专有称呼：你在地图右下角看到的黄色小人，拖到道路上进入 Street View。严格说它是品牌/界面元素名，因此有时会大写（Pegman），复数写作 Pegmen。"]}
{"word":"pegology","summary":{"en":"“Pegology” is a rare, playful word meaning “the study of pegs,” usually used as a joke rather than a real discipline.","zh":"“Pegology”是一个少见的玩笑式造词，意思接近“钉/木栓（peg）的研究”，通常并非真正的正式学科名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard coined word meaning “the study of pegs” (peg + -ology), sometimes used humorously or playfully rather than as an established academic term.","zh":"一个很少见、非标准的造词，字面意思是“钉/木栓（peg）的研究”（peg + -ology），多为幽默或玩笑式用法，并非正式学科名称。"},"examples":[{"en":"He jokingly called his obsession with tent stakes “pegology.”","zh":"他开玩笑说自己对帐篷地钉的痴迷叫“pegology”。"},{"en":"This isn’t a real course—“pegology” is just our nickname for learning how to use the pegboard tools.","zh":"这不是正式课程——“pegology”只是我们给学习如何使用洞洞板工具起的外号。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, context-dependent) A playful label for discussing “pegs” in a specific field, such as a currency peg in economics, but this usage is not standard.","zh":"（非正式、依语境）在特定领域里用来戏称“peg（挂钩/固定）”相关话题（例如经济学里的汇率盯住/联系汇率），但这种用法并不规范常见。"},"examples":[{"en":"In our finance chat, we jokingly refer to debates about currency pegs as “pegology.”","zh":"在我们的财经群里，我们会把关于汇率盯住制度的争论戏称为“pegology”。"}]}],"synonyms":["coinage","nonce word","playful term"],"phonetic":"/pɛˈɡɑlədʒi/","extraExplanation":["“-ology”常表示“……学/……的研究”（如 biology 生物学、geology 地质学）。把普通名词加上“-ology”常用于开玩笑，表示“我对某件事研究得很认真/很痴迷”。","“Pegology”并不常见于主流词典；在正式写作中，建议用更具体的表达：例如 economics of currency pegs（联系汇率/汇率盯住制度的经济学分析）、pegboard tool organization（洞洞板工具收纳）等。"]}
{"word":"pegomancy","summary":{"en":"Pegomancy means fortune-telling by watching springs or well water.","zh":"pegomancy 指通过观察泉水或井水来进行占卜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Divination (fortune-telling) by observing springs, fountains, or wells—especially the way water appears, flows, or behaves.","zh":"以观察泉水、喷泉或井水的状态（如水流、水面变化等）来进行占卜、预测吉凶的做法。"},"examples":[{"en":"In the novel, the village seer practiced pegomancy at the old spring before giving advice.","zh":"小说里，村里的先知会先在老泉边进行泉占，然后再给出建议。"},{"en":"Historically, pegomancy was one of many water-based divination traditions.","zh":"从历史角度看，泉占是众多“以水为媒介”的占卜传统之一。"}]}],"synonyms":["hydromancy","divination"],"phonetic":"/ˈpɛɡoʊˌmænsi/","extraExplanation":["词源来自希腊语 *pēgē*（泉、涌泉）+ *-mancy*（占卜）。因此它比 *hydromancy*（水占，占水术，范围更广）更具体，强调“泉眼/涌泉”这一水源。","这类词里的后缀 *-mancy* 常见于描述不同占卜方式（如 *necromancy* 亡灵占卜、*chiromancy* 手相）。在现代英语中多用于文学、历史或奇幻题材语境，并不常见于日常对话。"]}
{"word":"pegoxyl","summary":{"en":"“Pegoxyl” is not a common English word; it likely refers to a PEG-related, oxygen-linked feature in a technical name or product label.","zh":"“pegoxyl”不是常见英语词，较可能是技术命名中的一部分，指与PEG及氧连接结构有关，或是产品/代号名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare, technical-looking term that is not a standard dictionary English word; it most often appears as part of scientific/medical naming to suggest something related to PEG (polyethylene glycol) and an “oxy/oxyl” (oxygen-linked) group.","zh":"一个非常少见、偏技术性的词，不属于常见英语词典词汇；多见于科研/医药命名中，用来暗示与 PEG（聚乙二醇）以及“oxy/oxyl”（与氧相关或通过氧连接）有关的结构。"},"examples":[{"en":"I couldn’t find “pegoxyl” in standard English dictionaries; it may be a lab or product name.","zh":"我在常见英语词典里查不到“pegoxyl”；它可能是实验室用语或产品名称。"},{"en":"In chemistry writing, parts like “PEG-” often indicate polyethylene glycol attached to a molecule.","zh":"在化学写作中，像“PEG-”这样的成分通常表示分子上连接了聚乙二醇。"}]}],"synonyms":["PEG","PEGylated (related term)"],"phonetic":"/pɛɡˈɑk.sɪl/","extraExplanation":["如果你是在药品说明书、论文或产品标签上看到 pegoxyl，它很可能是“专有名词/商品名/内部代号”，而不是通用英语词汇。","PEG（polyethylene glycol，聚乙二醇）常用于“PEGylation（聚乙二醇化）”，也就是把 PEG 接到药物或材料上，以改善溶解度、稳定性或在体内停留时间。","“oxy- / -oxyl”在化学语境里常与“氧”或“通过氧原子连接的基团”相关；但 pegoxyl 的具体含义仍取决于你看到它的完整上下文（例如完整化学名或产品说明）。"]}
{"word":"pegroots","summary":{"en":"Peg roots are peg-shaped roots, often in wetland plants, that help with air intake in muddy, low-oxygen soil.","zh":"peg roots 指钉状的根，常见于湿地植物，主要帮助在缺氧泥土中获取空气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Peg roots: short, peg-like roots that stick up or out from the ground (or mud), often helping a plant get air in waterlogged soil and sometimes adding support.","zh":"钉状根／柱状根：一种短小、像木钉一样伸出地面（或泥面）的根，常见于湿地植物，主要帮助在缺氧的淤泥中“呼吸”，有时也能起到一定支撑作用。"},"examples":[{"en":"Some mangrove species grow peg roots to survive in muddy, low-oxygen wetlands.","zh":"一些红树林植物会长出钉状根，以便在缺氧的泥滩环境中生存。"},{"en":"After the tide went out, the peg roots were visible all over the mudflat.","zh":"退潮后，泥滩上到处都能看到伸出来的钉状根。"}]}],"synonyms":["pneumatophores","aerial roots"],"phonetic":"ˈpɛɡ ruːts","extraExplanation":["“Peg roots”在英语里不是最常用的术语；在红树林语境中，人们更常说“pneumatophores（呼吸根）”，其中一种形态就可能呈现“peg-like（钉状）”。","注意不要和花生的“peg（子房柄）”混淆：花生开花后会长出一条叫“peg”的结构钻入土中结荚，但那不是“root（根）”。"]}
{"word":"pegs","summary":{"en":"“Pegs” is the plural of “peg”: small pins or clips used to fasten things, and it can also mean to fix something at a set level (like prices or currency).","zh":"“pegs”是“peg”的复数：指用来固定东西的小钉子/夹子；也可作动词，表示把某事物固定在某个水平（如价格或汇率）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pins (usually wooden or metal) used to fasten, hang, or mark something","zh":"（通常为木制或金属的）小钉子/栓子，用来固定、悬挂或标记某物"},"examples":[{"en":"He hammered two pegs into the wall to hang his coat.","zh":"他在墙上敲了两颗挂钉来挂外套。"},{"en":"The tent pegs kept the tent from blowing away.","zh":"帐篷地钉防止帐篷被风吹走。"}]},{"partOfSpeech":"n.","definition":{"en":"clothespins used to clip clothes to a line while drying","zh":"（晾衣用的）衣夹；夹子"},"examples":[{"en":"She used pegs to clip the socks to the clothesline.","zh":"她用衣夹把袜子夹在晾衣绳上。"},{"en":"Don’t forget to bring extra pegs on a windy day.","zh":"刮风天别忘了多带些衣夹。"}]},{"partOfSpeech":"v.","definition":{"en":"to fasten or attach something using a peg","zh":"用钉子/栓子固定；用夹子夹住"},"examples":[{"en":"Peg the notes to the board so they don’t fall.","zh":"把便签钉在板子上，免得掉下来。"},{"en":"He pegged the blanket to the line to dry.","zh":"他把毯子夹在晾衣绳上晾干。"}]},{"partOfSpeech":"v.","definition":{"en":"to fix or set something at a particular level or value","zh":"把（价格/水平/汇率等）固定在某个数值"},"examples":[{"en":"The store pegged the discount at 20% for the whole week.","zh":"这家店把折扣固定为20%，持续一整周。"},{"en":"Some countries peg their currency to the U.S. dollar.","zh":"一些国家把本国货币与美元挂钩。"}]}],"synonyms":["pins","clips","fasteners","clothespins","stakes","fix","set","attach"],"phonetic":"/pɛɡ/","extraExplanation":["“pegs”常见于两种语境：\n1）日常生活：clothes pegs（衣夹）、tent pegs（帐篷地钉）。\n2）经济/新闻：peg A to B（把A与B挂钩/固定），例如把货币与美元挂钩（currency peg）。"]}
{"word":"pegtops","summary":{"en":"“Pegtops” most commonly means spinning-top toys (plural), and it can also refer to a tapered trouser style (“pegtop pants/trousers”).","zh":"“Pegtops”最常见指“陀螺玩具”的复数；也可指一种“上宽下窄”的裤型（pegtop pants/trousers）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pegtop”: a small spinning toy shaped like a top, often spun with a string or by hand.","zh":"“pegtop”的复数：一种小型陀螺玩具，通常用手或用绳子带动旋转。"},"examples":[{"en":"The kids played with pegtops in the yard after school.","zh":"放学后，孩子们在院子里玩陀螺（pegtops）。"},{"en":"He collected old wooden pegtops from flea markets.","zh":"他在跳蚤市场收集老式木制陀螺。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “pegtop” in clothing: trousers or pants that are loose at the hips and thighs but narrow at the ankles (often said as “pegtop pants/trousers”).","zh":"服装用法中“pegtop”的复数：指“上宽下窄”的裤型（常说 pegtop pants/trousers），臀部和大腿较宽，脚踝处收窄。"},"examples":[{"en":"The designer brought back pegtops with a modern, tapered fit.","zh":"设计师用现代的收脚剪裁，让“上宽下窄”的 pegtops 再度流行。"},{"en":"In old photos, you can see men wearing pegtops with suspenders.","zh":"在老照片里，你能看到男士穿着 pegtops，配吊带。"}]}],"synonyms":["spinning tops","tops","tapered pants","carrot pants"],"phonetic":"/ˈpɛɡˌtɑp/","extraExplanation":["“pegtop”这个词来自形状类比：传统陀螺上部较圆、底部逐渐变细，像“钉子/木栓（peg）+陀螺（top）”的组合；裤型的“pegtop”也是用同样的“上宽下窄”轮廓来命名。","在英美语境里，“pegtop trousers”常让人联想到20世纪早期（如1920s-1930s）较经典的男装廓形；现代英语里更常用的近义说法是 “tapered pants/trousers”（锥形裤）或 “carrot pants”（胡萝卜裤）。"]}
{"word":"peguan","summary":{"en":"Peguan usually means “of/from Pegu (Bago), Myanmar,” and can also refer to the people or (older usage) the Mon language.","zh":"Peguan通常指“与缅甸勃固（Pegu/今Bago）有关的”，也可指勃固人；旧式用法中还可能指孟语（Mon）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pegu (now Bago), a historic region/city in Myanmar (Burma).","zh":"与勃固（Pegu，今缅甸的Bago）这一历史地区/城市有关的；勃固的。"},"examples":[{"en":"The museum has a small collection of Peguan artifacts from Myanmar.","zh":"这家博物馆收藏了一小批来自缅甸的勃固（Peguan）文物。"},{"en":"Some chronicles mention Peguan rulers and their trade networks.","zh":"一些编年史提到勃固的统治者及其贸易网络。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Pegu/Bago, Myanmar.","zh":"来自勃固（Pegu/今Bago）的居民；勃固人。"},"examples":[{"en":"Local tradition says the Peguan community settled near the river centuries ago.","zh":"当地传统说，勃固人社区在几个世纪前就沿河定居了。"}]},{"partOfSpeech":"n.","definition":{"en":"The language associated with the Peguan/Mon people (often referring to Mon).","zh":"勃固人/孟族所使用的语言（常指孟语 Mon）。"},"examples":[{"en":"The inscription is described as Peguan in older reports, but modern scholars usually call it Mon.","zh":"较早的报告把这段铭文称为“Peguan”，但现代学者通常称其为“Mon（孟语）”。"}]}],"synonyms":["Pegu (historical name)","Bago (modern name)","Mon (people/language, in many contexts)"],"phonetic":"/pəˈɡwɑn/","extraExplanation":["“Peguan”是一个比较偏历史/人类学语境的词，常见于旧式英文资料里，用来指与缅甸勃固（Pegu，今Bago）有关的人、文化或语言。现代写作中更常直接写“Bago”或“Mon”。","如果你是想找更常用的拼写/词：可能是“Pegu”“Bago”“Mon”或“Peguans（复数）”。也可能是拼写误差（如“penguin”企鹅）。"]}
{"word":"pegwood","summary":{"en":"A pointed wooden stick used for nail care, especially to push back cuticles and clean under nails.","zh":"美甲用的尖头木棒，主要用于推回甲周皮和清理指甲缝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, pointed wooden stick (often made from orange wood) used in manicures to clean under nails, push back cuticles, or apply small amounts of product.","zh":"（美甲用的）木质尖棒（常用橙木制成），用于清理指甲缝、推回甲周皮（角质层），或少量涂抹产品。"},"examples":[{"en":"Use a pegwood to gently push back your cuticles after soaking your nails.","zh":"指甲浸泡后，用橙木棒（pegwood）轻轻把甲周皮往后推。"},{"en":"The technician cleaned under my nails with a pegwood before applying polish.","zh":"上指甲油前，美甲师用橙木棒（pegwood）清理了我的指甲缝。"}]}],"synonyms":["orange stick","cuticle stick","manicure stick"],"phonetic":"/ˈpɛɡˌwʊd/","extraExplanation":["pegwood 常见于美甲/甲艺语境，很多人也会直接说“orange stick（橙木棒）”。它通常是一次性或可短期使用的工具；使用时要轻柔，避免用力过度造成指缘受伤或感染。","词形上可理解为 peg（小钉/栓）+ wood（木头），指“像小钉一样的木棒”。在美容用品目录或美甲教学里更常见，日常口语里不算高频。"]}
