{"word":"peh","summary":{"en":"“peh” is a mostly informal exclamation (and sometimes a spitting sound) used to show disgust or contempt.","zh":"“peh”多用于非正式语境，作感叹词（有时也作吐口水的拟声词），表示厌恶或轻蔑。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation showing disgust, contempt, or dismissal (similar to “pah!” or “ugh!”).","zh":"（感叹词）表示厌恶、轻蔑或不屑（类似“pah!”、“ugh!”）。"},"examples":[{"en":"Peh! That food has gone bad—don’t eat it.","zh":"呸！那食物坏了——别吃。"},{"en":"“He said it wasn’t his fault.” “Peh, what an excuse.”","zh":"“他说不是他的错。”“呸，什么烂借口。”"}]},{"partOfSpeech":"other","definition":{"en":"A sound word for spitting, or for making a spitting noise to show disgust.","zh":"（拟声词）表示“吐口水/发出呸的一声”的声音，也可用来表达厌恶。"},"examples":[{"en":"Peh—he spat the dust out of his mouth.","zh":"呸——他把嘴里的灰尘吐了出来。"},{"en":"The character goes “peh” to show rejection.","zh":"这个角色用“peh”来表示拒绝/嫌弃。"}]}],"synonyms":["pah","ugh","ew","ptooey","pshaw"],"phonetic":"/pɛ/","extraExplanation":["“peh”并不是非常标准、普遍的英语拼写；更常见的写法有“pah!”、“ptooey!”或直接写“spit”。","在新加坡、马来西亚等地的口语英语（如 Singlish）里，受闽南语/潮州话等方言影响，有时会用类似“peh/peh!”的语气词来表达嫌弃或不屑；在正式写作中一般不建议使用。"]}
{"word":"pehlevi","summary":{"en":"Pehlevi (more often spelled Pahlavi) refers to Middle Persian and its script, or to the modern Iranian Pahlavi dynasty depending on context.","zh":"Pehlevi（更常写作 Pahlavi）可指中波斯语及其文字，也可指伊朗近现代的巴列维王朝，需结合语境理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical form of the Persian language (Middle Persian), used in Iran mainly during the Sasanian Empire, and the literature written in it","zh":"巴列维语／中波斯语：波斯语的历史阶段之一（中波斯语），主要在萨珊王朝时期使用，也指用这种语言写成的文献"},"examples":[{"en":"Some Zoroastrian religious texts were preserved in Pahlavi.","zh":"一些琐罗亚斯德教的宗教文本以巴列维语保存下来。"},{"en":"The museum displayed manuscripts written in Pahlavi.","zh":"博物馆展出了用巴列维语写成的手稿。"}]},{"partOfSpeech":"n.","definition":{"en":"the writing system (script) used for Middle Persian, especially in inscriptions and manuscripts","zh":"巴列维文字：用于书写中波斯语的文字系统，常见于碑铭与手稿"},"examples":[{"en":"The inscription is written in the Pahlavi script.","zh":"这段碑文是用巴列维文字写的。"},{"en":"Learning Pahlavi takes time because many letters can look similar.","zh":"学习巴列维文字需要时间，因为很多字母看起来很相似。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pahlavi (Middle Persian language or its script)","zh":"与巴列维语／巴列维文字相关的；中波斯语的"},"examples":[{"en":"They studied Pahlavi literature in a history of Iran course.","zh":"他们在伊朗史课程中学习巴列维文学。"},{"en":"A Pahlavi text can help scholars understand early Persian culture.","zh":"巴列维文本能帮助学者理解早期波斯文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Iran’s Pahlavi dynasty (1925–1979)","zh":"与伊朗巴列维王朝（1925–1979）有关的"},"examples":[{"en":"The book discusses Pahlavi-era reforms in Iran.","zh":"这本书讨论了伊朗巴列维时期的改革。"},{"en":"Many political debates refer to the Pahlavi period.","zh":"许多政治讨论会提到巴列维时期。"}]}],"synonyms":["Pahlavi","Middle Persian"],"phonetic":"/ˈpɑːləvi/","extraExplanation":["“Pehlevi”更常见的英语拼写是“Pahlavi”。在学术语境里，它通常指“中波斯语/巴列维语”及其文字；在近现代历史语境里，则常指伊朗的“巴列维王朝”。要看上下文判断。","巴列维文字属于源自阿拉米字母的书写传统；一些写法会用到“表意用字/借词写法”（把某些词用别的语言的书写习惯来表示），这也是学习时常觉得不直观的原因。"]}
{"word":"peho","summary":{"en":"“Peho” is not a standard English word; it’s usually a name/handle or a misspelling.","zh":"“Peho”不是标准英语词，通常是人名/网名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a personal name, username, or a misspelling of another word.","zh":"不是标准英语词；最常见于人名、用户名，或作为其他单词的拼写错误。"},"examples":[{"en":"My classmate’s online name is Peho.","zh":"我同学的网名是 Peho。"},{"en":"I can’t find “peho” in an English dictionary—did you mean “Peko” or “pH”?","zh":"我在英文词典里找不到“peho”——你是不是想写“Peko”或“pH”？"}]}],"synonyms":["(none—usually a name/handle)"],"phonetic":"/ˈpiːhoʊ/","extraExplanation":["“peho”在常用英语里没有固定词义，因此最需要的是语境：你是在聊天里看到的、在游戏/社交媒体上看到的用户名，还是想拼某个英文单词？","如果你想查的是发音相近的词，常见可能包括：\n- “Peko/Pecco”（多为名字或昵称）\n- “pH”（酸碱度的符号，读作“pee aitch”）\n- “pekoe”（一种红茶分级/茶叶嫩度相关的词，常见于“orange pekoe”）\n把原句发我，我可以帮你准确判断。"]}
{"word":"pehs","summary":{"en":"“Peh” (and “pehs”) is an uncommon exclamation showing contempt or dismissal; “pehs” can also mean repeated uses of that sound.","zh":"“peh”（以及“pehs”）是一种不太常见的感叹词，用来表示轻蔑或不屑；“pehs”也可指这种声音的多次出现。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show contempt, dismissal, or mild disgust (similar to “pah!” or “pshaw!”).","zh":"表示轻蔑、不屑或（轻微）厌恶的感叹词（类似“pah!”“pshaw!”）。"},"examples":[{"en":"“Peh!” he said, waving away the idea.","zh":"“Peh！”他说着，挥手把这个想法打发了。"},{"en":"She answered with a quick “peh” and turned away.","zh":"她迅速回了一声“peh”，然后转身走开。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form used to refer to repeated instances of the exclamation “peh.”","zh":"“peh”的复数形式，用来指多次发出这种不屑的感叹。"},"examples":[{"en":"The crowd’s little pehs made it clear they disliked the speaker.","zh":"人群里几声小小的“pehs”表明他们不喜欢这位演讲者。"}]}],"synonyms":["pah","pshaw","bah"],"phonetic":"/pɛ/","extraExplanation":["“peh”在现代英语里不算常见，更多见于对话描写、戏仿语气、漫画/小说中用来表现人物的不屑或否定态度。日常口语里更常用“yeah, right,” “whatever,” “pah!”等表达类似语气。","如果你看到的是全大写“PEHS/PEH”，也可能是某个领域的缩写；需要结合上下文才能确定具体含义。"]}
{"word":"pehuenche","summary":{"en":"Pehuenche: a Mapuche Indigenous group from the Andes of Chile and Argentina, traditionally linked to pehuén pine forests.","zh":"Pehuenche：智利与阿根廷安第斯山区的马普切原住民群体，传统上与pehuén（智利南洋杉）森林相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mapuche Indigenous group from the Andes of south-central Chile and western Argentina, traditionally associated with the pehuén (monkey-puzzle) pine forests.","zh":"佩文切人：马普切族（Mapuche）中的一个原住民群体，主要分布在智利中南部与阿根廷西部的安第斯山区，传统上与“pehuén”（智利南洋杉/猴谜树）森林密切相关。"},"examples":[{"en":"The Pehuenche have long lived in the Andes near the high mountain passes.","zh":"佩文切人长期生活在安第斯山脉靠近高山隘口的地区。"},{"en":"Some histories describe Pehuenche communities trading pine nuts and livestock across the border.","zh":"一些史料记载，佩文切社群曾跨越边境进行松子和牲畜贸易。"}]}],"synonyms":["Pehuenches","Mapuche (related group)"],"phonetic":"/peɪˈwɛn.tʃeɪ/","extraExplanation":["“Pehuenche”来自西班牙语写法，常被用作族群名称；在英语文章里也会出现复数形式“Pehuenches”。","词根与“pehuén”（智利南洋杉，Araucaria araucana）相关，这种树的种子（常被称为pine nuts/ piñones）在当地传统饮食与经济中很重要。","使用该词时，最好将其作为具体族群名称，并尊重其与更广义的“Mapuche（马普切人）”之间的关系：佩文切通常被视为马普切文化圈内的一个山地群体。"]}

