{"word":"pejerrey","summary":{"en":"Pejerrey is a South American silverside fish, often eaten or used as bait.","zh":"Pejerrey指南美常见的一种银汉鱼类，常被食用或用作鱼饵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silverside fish (especially in South America), commonly eaten or used as bait; in English often translated as “silverside” or “Argentine silverside.”","zh":"（尤指南美的）银汉鱼/银鱼类的一种，常被食用或用作鱼饵；英文里常译作“silverside（银汉鱼）”或“Argentine silverside（阿根廷银汉鱼）”。"},"examples":[{"en":"We ate fried pejerrey at a seaside restaurant in Peru.","zh":"我们在秘鲁的海边餐馆吃了炸pejerrey（银汉鱼）。"},{"en":"Some anglers use pejerrey as live bait for larger fish.","zh":"有些钓鱼人会用pejerrey当活饵来钓更大的鱼。"}]}],"synonyms":["silverside","Argentine silverside","(general) small edible fish"],"phonetic":"/pe.heˈreɪ/","extraExplanation":["“Pejerrey”是西班牙语词，在阿根廷、秘鲁、玻利维亚等地很常见，既指某些银汉鱼科（silverside）鱼类，也常指当地常吃的那种鱼。","词源上常被解释为“pez（鱼）+ rey（国王）”，字面意思类似“鱼中之王”，带一点民间称呼的味道。","在英文语境中，如果对方不熟悉西语借词，可以说 silverside / Argentine silverside 来帮助理解；在菜单上也常直接保留西语 pejerrey。"]}
{"word":"pejorate","summary":{"en":"Pejorate means to become worse (or, more formally, to make something worse).","zh":"Pejorate 指“变得更糟/恶化”，也可作及物动词表示“使恶化”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Formal) To become worse; to deteriorate in quality, condition, or value over time.","zh":"（正式用语）变得更糟；恶化（质量、状况或价值随时间下降）。"},"examples":[{"en":"Without treatment, the infection may pejorate quickly.","zh":"如果不治疗，感染可能会迅速恶化。"},{"en":"Her symptoms pejorated after she stopped taking the medicine.","zh":"她停药后症状变得更严重了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Formal) To make something worse; to worsen.","zh":"（正式用语）使某事变得更糟；使恶化。"},"examples":[{"en":"Delays in repairs can pejorate the damage to the building.","zh":"维修拖延可能会使建筑的损坏进一步恶化。"},{"en":"Harsh criticism may pejorate an already tense situation.","zh":"尖刻的批评可能会让本已紧张的局势更糟。"}]}],"synonyms":["worsen","deteriorate","degenerate","decline","degrade","aggravate"],"phonetic":"/ˈpɛdʒəˌreɪt/","extraExplanation":["“pejorate”在现代英语中相对少见、偏学术/正式写作，日常更常用 worsen / deteriorate。","它和“pejorative（贬义的）”同源，都来自拉丁语 peior（更坏的）。因此 pejorate 的核心含义是“朝更坏的方向发展/使变坏”。","常见搭配语境：medical/clinical（病情恶化）、legal/administrative（情况恶化）、technical reports（指标恶化）。"]}
{"word":"pejoration","summary":{"en":"Pejoration is the linguistic process where a word’s meaning becomes more negative over time.","zh":"Pejoration 指“词义贬化”，即词语的意义随着时间变得更负面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process in which a word’s meaning becomes more negative, insulting, or less respectful over time.","zh":"词义贬化：一个词的意义随着时间推移变得更负面、更带侮辱性或更不尊重的过程。"},"examples":[{"en":"In linguistics, pejoration explains how some neutral words gradually take on negative meanings.","zh":"在语言学中，词义贬化解释了一些原本中性的词如何逐渐带上负面含义。"},{"en":"The word “silly” is often cited as an example of pejoration because it shifted from “happy” to “foolish.”","zh":"“silly”常被用作词义贬化的例子，因为它从“快乐的”转变为“愚蠢的”。"}]}],"synonyms":["semantic deterioration","semantic degeneration"],"phonetic":"/ˌpɛdʒəˈreɪʃən/","extraExplanation":["“pejoration”是语言变化（semantic change）中的一个常见方向，和“amelioration（词义褒化：意义变得更好/更正面）”相对。","词义贬化常和社会态度、偏见或权力关系有关：当某个群体、职业或身份在社会中被轻视时，与之相关的词更容易发生贬化。","一些常被提到的英语例子（不同教材选择不同）：“villain”曾指“农场工人/乡下人”后来变成“恶棍”；“spinster”从“纺纱女工/未婚女性”逐渐带上贬义（使用时需注意可能的性别刻板印象）。"]}
{"word":"pejorationist","summary":{"en":"A pejorationist is (usually in linguistics) someone who studies or emphasizes how meanings become more negative over time; rarely, it can mean a person who habitually uses belittling language.","zh":"pejorationist 通常指（语言学中）研究或强调词义随时间变得更负面的“语义贬损”现象的人；少数情况下也可指爱用贬低措辞的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) A person who studies, discusses, or argues that a word’s meaning has become more negative over time (a process called pejoration).","zh":"（语言学）研究、讨论或主张某个词的意义随着时间变得更负面（语义贬损/贬义化，pejoration）的人。"},"examples":[{"en":"In historical linguistics, a pejorationist might trace how a neutral word slowly became insulting.","zh":"在历史语言学中，pejorationist 可能会追踪一个中性词如何逐渐变成侮辱性用语。"},{"en":"The pejorationist argued that the term shifted from describing a job to expressing contempt.","zh":"这位 pejorationist 认为这个词从描述一种工作转变为表达轻蔑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Someone who tends to describe people or things in a negative, belittling way; a habitual user of pejorative language.","zh":"（较少见）习惯用贬低、负面词语评价人或事的人；常用贬义措辞的人。"},"examples":[{"en":"Some readers felt the reviewer was a pejorationist, dismissing every new idea as foolish.","zh":"一些读者觉得这位评论者很像 pejorationist，把每个新想法都贬为愚蠢。"},{"en":"Try not to sound like a pejorationist; focus on specific feedback instead of insults.","zh":"尽量别听起来像 pejorationist；与其辱骂，不如给出具体反馈。"}]}],"synonyms":["semantic-change researcher","historical linguist","user of pejorative language","disparager"],"phonetic":"/pɪˌdʒɔːrəˈneɪʃənɪst/","extraExplanation":["这个词比较罕见，更多出现在语言学或学术讨论里；日常英语中通常会说 linguist、researcher，或直接说 the process of pejoration。","不要和 pejorative（adj. 贬义的/轻蔑的）混淆：pejorative 形容词常用；pejorationist 是“人”。","pejoration 指“词义变坏/变贬”，来源与拉丁语中“更坏”的词根有关。"]}
{"word":"pejorative","summary":{"en":"Pejorative describes language that is insulting or disapproving; it can also mean an insulting word itself.","zh":"pejorative 指“带贬义、轻视或侮辱”的（多指语言）；也可作名词表示“贬义词/侮辱性用语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressing disapproval or showing that you think something or someone is bad, unimportant, or not worthy of respect (often used about words or labels).","zh":"（常指用词或称呼）带贬义的；表达不赞同、轻视或不尊重的。"},"examples":[{"en":"Some people consider the term “geek” pejorative, while others use it proudly.","zh":"有些人认为“geek”这个词带贬义，但也有人自豪地使用它。"},{"en":"He used a pejorative nickname for his rival.","zh":"他用一个带贬义的绰号称呼对手。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or expression that has a negative or insulting meaning.","zh":"贬义词；带侮辱或负面含义的表达。"},"examples":[{"en":"“Trashy” is often used as a pejorative for certain kinds of fashion.","zh":"“trashy”常被当作贬义词来形容某些穿衣风格。"},{"en":"Try to avoid pejoratives in professional writing.","zh":"在职业写作中尽量避免使用贬义表达。"}]}],"synonyms":["derogatory","disparaging","contemptuous","insulting","negative","slur"],"phonetic":"/pɪˈdʒɔrətɪv/","extraExplanation":["“pejorative”常出现在语言与文化讨论中：同一个词在不同群体、时代或语境里可能从中性变成贬义（或被“重新夺回”而转为中性/褒义），关键看说话者意图与听者感受。","词源来自拉丁语 *peior*（更坏的）。因此它常和“评价变差、语义贬降”联系在一起。"]}
{"word":"pejoratively","summary":{"en":"“Pejoratively” means “in a negative, disapproving, or belittling way.”","zh":"“pejoratively”表示“以贬义、否定或贬低的方式（说/用）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that expresses disapproval or a negative judgment; using a word or description as an insult or to belittle.","zh":"以贬义的方式；带有轻蔑、否定或贬低意味地使用某个词或说法。"},"examples":[{"en":"Some people use the word “nerd” pejoratively, but others use it proudly.","zh":"有些人会用“nerd”这个词带贬义地说人，但也有人会自豪地使用它。"},{"en":"The journalist said the label was being applied pejoratively to immigrant communities.","zh":"那位记者说，这个标签被用来贬义地贴在移民社群身上。"},{"en":"He referred to her work pejoratively as “just a hobby.”","zh":"他贬低地把她的工作称为“只是个爱好”。"}]}],"synonyms":["disparagingly","derogatorily","contemptuously","scornfully"],"phonetic":"/pɪˈdʒɔɹətɪvli/","extraExplanation":["“pejoratively”来自形容词“pejorative”（贬义的），常见搭配是：use a term pejoratively（以贬义使用某个词）、be used pejoratively（被当作贬义使用）。","在讨论语言与文化时，这个词很常见：同一个词在不同群体、时代或语境里可能从中性变成贬义（或被“重新认领”变成自称、带自豪感）。写作中用它可以更客观地说明“这个词是被用来贬低人”，而不是直接骂人。"]}
{"word":"pejoratives","summary":{"en":"“Pejoratives” are insulting or disapproving words/expressions; “pejorative” can also describe a negative, derogatory tone or meaning.","zh":"“pejoratives”指带贬义、轻视或侮辱性的词语；“pejorative”也可作形容词，表示语气或含义带贬低色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(n.) A word or expression that shows disapproval or makes someone/something seem less important or less respectable; a derogatory term.","zh":"（名词）带有贬义、表示轻视或不尊重的词语；贬称。"},"examples":[{"en":"Calling someone a “loser” is a pejorative that can be hurtful.","zh":"称某人为“loser（失败者）”是一种贬称，可能会伤人。"},{"en":"Some pejoratives are tied to race, gender, or disability and should be avoided.","zh":"有些贬称与种族、性别或残障有关，应当避免使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Expressing disapproval; having a negative or insulting meaning or tone.","zh":"（形容词）表示贬低或不赞同的；带侮辱意味的。"},"examples":[{"en":"The term “cheap” can be pejorative when it suggests low quality.","zh":"当“cheap（便宜的）”暗示质量差时，它可能带贬义。"},{"en":"He used a pejorative tone when talking about their ideas.","zh":"他谈到他们的想法时语气很贬低。"}]}],"synonyms":["slur","insult","derogatory term","disparagement","put-down"],"phonetic":"/pɪˈdʒɔrətɪvz/","extraExplanation":["“Pejorative(s)”常用于语言与社会文化讨论，强调“词语的负面态度/伤害性”。有些词本身中性，但在特定语境或语气中会变成贬义（例如用来嘲讽或贬低某群体）。","词源来自拉丁语“peior（更差的）”，因此核心含义与“使之更糟/更低”相关。"]}
{"word":"pejorism","summary":{"en":"A pejorism is a disrespectful or negative word/expression used to insult or show contempt.","zh":"Pejorism 指带有贬义、轻蔑或侮辱意味的词语/表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or expression used to show dislike, disrespect, or contempt (a pejorative term)","zh":"带有贬义、轻蔑或不尊重意味的词语；贬称（贬义表达）"},"examples":[{"en":"Calling someone a “loser” is a pejorism that can hurt people.","zh":"把别人叫作“loser（失败者）”是一种贬称，可能会伤害他人。"},{"en":"The article avoids pejorisms when discussing different cultures.","zh":"这篇文章在讨论不同文化时避免使用贬称。"},{"en":"Some pejorisms become common in slang, but they can still be offensive.","zh":"有些贬称在俚语中变得常见，但仍可能冒犯他人。"}]}],"synonyms":["pejorative term","slur","insult","derogatory term","put-down"],"phonetic":"/pɪˈdʒɔrɪzəm/","extraExplanation":["“pejorism”较常见于语言学或较正式的写作中；日常英语里更常说“pejorative term/word”（贬义词/贬称）。","词源来自拉丁语“peior/pejor”（更差的）。相关概念是“pejoration”（词义贬降）：一个词随着时间推移变得更负面，例如某些原本中性的称呼后来带上贬义。","使用提示：当你想表达“这个词带贬义、可能冒犯人”时，用“pejorative”更自然，如“That word is pejorative.”"]}
{"word":"pejorist","summary":{"en":"A pejorist is someone who habitually uses insulting or belittling language.","zh":"pejorist 指习惯使用贬义、侮辱或轻蔑措辞的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who uses pejorative (disparaging or belittling) language; someone who tends to describe things in a negative, insulting way.","zh":"使用贬义、轻蔑或侮辱性语言的人；习惯用负面、贬低的方式描述事物的人。"},"examples":[{"en":"In debates, he often sounded like a pejorist, choosing insults instead of evidence.","zh":"在辩论中，他常常像个爱用贬义的人，用侮辱代替证据。"},{"en":"Try not to be a pejorist when giving feedback—focus on specific actions, not labels.","zh":"给反馈时尽量别用贬低式说法——关注具体行为，不要贴标签。"}]}],"synonyms":["disparager","detractor","critic","faultfinder"],"phonetic":"/ˈpɛdʒərɪst/","extraExplanation":["“pejorist”较少见，更常见的表达是“someone who uses pejoratives / a disparaging person / a detractor”。","词根来自“pejorative（贬义的）”，与拉丁语“peior（更坏的）”有关；在语言学习中可把它理解为“喜欢用难听词的人”。","使用建议：在正式写作里，与其用“pejorist”，不如直接说“uses pejorative language”，会更自然、更清楚。"]}
{"word":"pejority","summary":{"en":"Pejority is a rare noun meaning “pejorative or insulting quality/tone.”","zh":"pejority 是一个罕见名词，表示“贬义性、轻蔑或侮辱性的语气/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The quality of being negative, contemptuous, or insulting; pejorative meaning or tone.","zh":"（罕见）贬义性；带有轻蔑或侮辱意味的性质或语气。"},"examples":[{"en":"Calling the neighborhood “a slum” carries a strong pejority and can offend residents.","zh":"把那个社区称为“贫民窟”带有很强的贬义性，可能会冒犯当地居民。"},{"en":"The writer tried to remove pejority from the article by choosing more neutral words.","zh":"作者试图通过选择更中性的词语来去除文章中的贬义色彩。"}]}],"synonyms":["pejorativeness","pejorativity","derogatory tone","disparagement"],"phonetic":"/pɪˈdʒɔrəti/","extraExplanation":["“pejority”在现代英语里非常少见，很多情况下是把更常用的词写错了。更常见的表达有：\n- pejorative（adj./n.）“贬义的/贬义词”\n- pejorativity（n.）“贬义性”（语言学里更常用）\n如果你是在写作或考试中使用，通常建议改用 pejorative 或 pejorativity。"]}

