{"word":"pel","summary":{"en":"“Pel” is a rare/old verb meaning “to pelt or strike repeatedly,” and “PEL” is also a context-dependent abbreviation.","zh":"“pel”是少见的古义动词，意为“投掷/猛砸或反复击打”；“PEL”也常作缩写，含义需看语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(archaic) to strike or beat repeatedly; to pelt.","zh":"（古义）反复击打；（同 pelt）投掷、猛扔（尤指用小物体砸）。"},"examples":[{"en":"The boys pelled stones at the old gate.","zh":"男孩们朝旧大门扔石头。"},{"en":"Rain pelled against the window all night.","zh":"雨点整夜敲打着窗户。"}]},{"partOfSpeech":"other","definition":{"en":"(often written PEL) an abbreviation used in different fields (meaning depends on context).","zh":"（常写作 PEL）多领域缩写（具体含义取决于语境）。"},"examples":[{"en":"The report lists PEL values for each test.","zh":"报告列出了每项测试的 PEL 数值。"},{"en":"Ask your teacher what PEL stands for in this class.","zh":"问问老师在这门课里 PEL 代表什么。"}]}],"synonyms":["pelt","throw","hurl","strike","beat"],"phonetic":"/pɛl/","extraExplanation":["“pel”作为动词在现代英语中非常少见，通常会用更常见的“pelt”（投掷/猛砸）或“beat/strike”（击打）来表达。你在文学作品或较旧的文本里更可能遇到“pel”。","“PEL”常见于专业语境的缩写，但不同领域含义差别很大；例如在职业安全领域可指“Permissible Exposure Limit（允许暴露限值）”。如果你告诉我你看到“pel”的句子/领域，我可以给出最准确的释义。"]}
{"word":"pelade","summary":{"en":"Pelade is an uncommon term meaning patchy hair loss (alopecia areata), and more rarely a bare patch of land.","zh":"Pelade 是较少见的词，主要指斑片状脱发（斑秃），更少见时也可指一块光秃的土地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, uncommon in everyday English) Patchy hair loss; alopecia areata.","zh":"（医学用语，日常英语少见）斑片状脱发；斑秃（alopecia areata）。"},"examples":[{"en":"The dermatologist diagnosed her with pelade (alopecia areata).","zh":"皮肤科医生诊断她为斑秃（pelade / alopecia areata）。"},{"en":"Stress can sometimes trigger episodes of pelade in susceptible people.","zh":"压力有时会在易感人群中诱发斑秃发作。"}]},{"partOfSpeech":"n.","definition":{"en":"A bare, treeless patch of land (rare; often in French or in specialized writing).","zh":"（罕见，多见于法语或专业写作）一块光秃、少树木的土地。"},"examples":[{"en":"After the fire, the hillside looked like a pelade amid the surrounding forest.","zh":"火灾之后，山坡在周围森林中显得像一块光秃地。"}]}],"synonyms":["alopecia areata","alopecia","baldness","hair loss"],"phonetic":"/pəˈlɑd/","extraExplanation":["“pelade”主要来自法语，字面含义与“变秃、秃斑”相关。在英语里它不算常用词：医学场景通常直接用更常见的“alopecia areata（斑秃）”或“baldness（秃发）”。","发音在英语语境里可能因借词而有差异；学习与使用时，建议同时掌握更常见的同义表达（alopecia / baldness）。"]}
{"word":"peladic","summary":{"en":"“Peladic” is not standard; it most likely means “pelagic” (related to the open ocean).","zh":"“peladic”不是标准用词；最可能是“pelagic”（与远洋/公海有关）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; it is likely a misspelling of “pelagic.”","zh":"在大多数英语词典中不算标准词；很可能是“pelagic”的拼写错误。"},"examples":[{"en":"I couldn’t find “peladic” in a dictionary—did you mean “pelagic” fish?","zh":"我在词典里找不到“peladic”——你是不是想说“pelagic（远洋的）”鱼？"},{"en":"Scientists study pelagic ecosystems in the open ocean.","zh":"科学家研究公海中的远洋生态系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “pelagic”) living in, found in, or relating to the open sea (not near the coast or seabed).","zh":"（如果你想写的是“pelagic”）指生活在/存在于公海、远离海岸与海底的；与远洋有关的。"},"examples":[{"en":"Tuna are pelagic fish that travel long distances.","zh":"金枪鱼是远洋鱼类，会进行长距离迁徙。"},{"en":"Pelagic birds spend much of their lives over the ocean.","zh":"远洋海鸟一生中有很长时间在海上活动。"},{"en":"They recorded pelagic plankton far offshore.","zh":"他们在远海记录到了远洋浮游生物。"}]}],"synonyms":["pelagic (likely intended)"],"phonetic":"/pəˈlædɪk/","extraExplanation":["“peladic”更常见的情况是把“pelagic”拼错了：a 常被误写成 a/ e 的组合，或者把 g 看成 d。","如果你能提供一句原文（看到“peladic”的句子/段落），我也可以帮你判断它到底想表达哪个词（例如 pelagic / Palladian / paladin 等）。"]}
{"word":"pelado","summary":{"en":"Pelado is a Spanish word meaning “peeled/bald,” and in some Latin American regions it can also mean “kid/guy” (and sometimes “broke/poor,” depending on place and tone).","zh":"Pelado 是西语词，原义常为“去皮的/秃的”；在部分拉美地区口语中也可指“男孩/家伙”，有时还会指“很穷/没钱的人”（取决于地区与语气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish loanword) peeled; bald; without hair or covering.","zh":"（西语借词）去皮的；秃的；没有毛发或覆盖物的。"},"examples":[{"en":"In Spanish, pelado can mean “peeled,” like a peeled orange.","zh":"在西班牙语里，pelado 可以表示“去皮的”，例如“去皮的橙子”。"},{"en":"He joked that he looked pelado after shaving his head.","zh":"他开玩笑说剃光头后看起来很“pelado（秃的）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin American Spanish, informal) a boy/young man; a guy (meaning varies by region).","zh":"（拉美西语，非正式）男孩/年轻男子；家伙（不同地区含义略有差异）。"},"examples":[{"en":"Some people might say, “Ese pelado…” meaning “That kid/that guy…”","zh":"有些人会说“Ese pelado…”，意思类似“那个小子/那家伙……”。"},{"en":"In casual speech, pelado can refer to a young person, not necessarily “bald.”","zh":"在口语里，pelado 可以指年轻人，不一定是“秃头”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Certain regions, slang) someone broke/poor; a person with little money (can sound judgmental).","zh":"（部分地区俚语）没钱的人、穷困的人（可能带有评判或不礼貌的语气）。"},"examples":[{"en":"Depending on the country, calling someone pelado can imply they’re broke.","zh":"在某些国家/地区，叫别人 pelado 可能暗示对方很穷。"},{"en":"It’s safer to avoid this meaning unless you’re sure of the local usage.","zh":"除非很确定当地用法，否则更安全的做法是避免用这一层意思。"}]}],"synonyms":["bald","peeled","kid","guy","broke"],"phonetic":"/pəˈlɑːdoʊ/","extraExplanation":["“Pelado”是西班牙语词，不同国家用法差异很大：在一些地方更常见的是“年轻人/小子”，在另一些地方可能带点贬义（如“穷”“没出息”等语感）。与不熟的人使用时要注意语境与语气。","英语里偶尔会直接借用它（多出现在与拉美文化相关的语境、对话、影视字幕或双语交流中），但在正式英语写作中通常会改用英文表达（例如 bald / peeled / kid / broke）。"]}
{"word":"peladore","summary":{"en":"“Peladore” is not a recognized English word; it’s likely a misspelling or a non-English/proper-name form.","zh":"“peladore”不是常见或标准的英语词；更可能是拼写错误、外来语形式或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a word from another language (often confused with similar-looking words).","zh":"不是标准英语单词；很可能是拼写错误，或来自其他语言（常与外形相近的词混淆）。"},"examples":[{"en":"I couldn’t find “peladore” in an English dictionary—did you mean “palladium” or “peelers”?","zh":"我在英文词典里找不到“peladore”——你是不是想写“palladium（钯）”或“peelers（削皮器/剥皮者）”？"},{"en":"If you tell me the sentence where you saw “peladore,” I can help identify the intended word.","zh":"如果你把看到“peladore”的句子发我，我可以帮你判断它原本想表达哪个词。"}]}],"phonetic":"/ˌpɛləˈdɔr/","extraExplanation":["“peladore”看起来更像西班牙语/意大利语风格的拼写，而不是英语。西班牙语里有 **pelador**（常指“削皮器/剥皮的人”），意大利语里也可能出现相似构词，但“peladore”本身并不常见。","如果这是人名、用户名、品牌名或小说中的专有名词，也可能不收录在一般英语词典里。把它出现的上下文（前后句、主题领域，比如烹饪/化学/游戏/文学）发来，我可以更准确地给出对应词、发音和用法。"]}
{"word":"pelage","summary":{"en":"Pelage means an animal’s fur or hair covering, especially in scientific descriptions.","zh":"Pelage 指动物（尤指哺乳动物）的毛皮/体毛，常用于较正式或科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fur, hair, or wool that covers the skin of an animal (especially a mammal)","zh":"（尤指哺乳动物的）毛皮；体毛"},"examples":[{"en":"In winter, the rabbit grows a thicker pelage to stay warm.","zh":"冬天兔子会长出更厚的体毛来保暖。"},{"en":"Scientists studied the bear’s pelage to understand how it adapts to cold climates.","zh":"科学家研究熊的毛皮，以了解它如何适应寒冷气候。"}]}],"synonyms":["fur","coat","hair","pelt"],"phonetic":"/ˈpiːlɪdʒ/","extraExplanation":["“pelage”是动物学/生物学里较正式的词，日常英语更常说“fur”（毛皮）或“coat”（动物的毛、被毛）。","词源来自法语 pelage，与 peau（皮肤）有关，因此常用于描述动物外层覆盖物的整体状态与特征（如厚度、颜色、季节性变化）。"]}
{"word":"pelages","summary":{"en":"“Pelages” is the plural of “pelage,” meaning the fur or hair covering of mammals.","zh":"“Pelages”是“pelage”的复数，指哺乳动物身体表面的皮毛/被毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fur, hair, or wool covering the body of a mammal (plural form: pelages)","zh":"（哺乳动物的）皮毛；被毛（复数：pelages）"},"examples":[{"en":"In winter, many mammals grow thicker pelages to stay warm.","zh":"到了冬天，许多哺乳动物会长出更厚的皮毛来保暖。"},{"en":"Researchers compared the pelages of Arctic and desert foxes.","zh":"研究人员比较了北极狐和沙狐的皮毛。"}]}],"synonyms":["fur","coat","pelt"],"phonetic":"ˈpɛlɪdʒ","extraExplanation":["“pelage”常用于动物学、生态学与博物馆展品说明中，比日常的“fur（毛皮）”更偏学术、专业。","词源来自法语 pelage，与“peel/peau（皮）”等表示“皮”的词有历史关联。"]}
{"word":"pelagial","summary":{"en":"Pelagial means “of the open sea,” especially referring to life and environments in the ocean water away from coasts.","zh":"pelagial 指“远海/外海的”，常用于描述远离海岸的海洋水体以及其中的生物与生态环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the open sea (the ocean away from the coast), especially animals or plants that live there.","zh":"与远海/外海有关的；（尤指）生活在远离海岸的开放海域中的（动植物）。"},"examples":[{"en":"Tuna and many sharks are pelagial species that spend most of their lives in open water.","zh":"金枪鱼和许多鲨鱼是远海（pelagial）物种，生命的大部分时间都在开放海域度过。"},{"en":"Scientists studied pelagial ecosystems to understand how nutrients move through the ocean.","zh":"科学家研究远海生态系统，以了解营养物质如何在海洋中流动。"}]},{"partOfSpeech":"adj.","definition":{"en":"In marine science, referring specifically to the pelagic zone (the water column of the open ocean), as opposed to the sea floor.","zh":"（海洋科学）特指远洋带/水层（pelagic zone），与海底（底栖带）相对。"},"examples":[{"en":"Light levels change quickly as you move from the surface to deeper pelagial waters.","zh":"从海面进入更深的远洋水层时，光照强度会迅速变化。"}]}],"synonyms":["pelagic","open-ocean","oceanic"],"phonetic":"/pəˈleɪdʒiəl/","extraExplanation":["词源：来自希腊语 pelagos（大海、外海）。在生物与海洋学语境中，pelagial 常用来强调“远离海岸的水体/开放海域”，与沿岸（coastal/neritic）或海底（benthic）相对。","用法提示：日常英语里更常见的是 pelagic（同义且更常用）。pelagial 多见于学术写作，如海洋生态学与渔业研究。"]}
{"word":"pelagian","summary":{"en":"Pelagian means “related to Pelagius/Pelagianism,” a doctrine emphasizing human free will and rejecting inherited original sin; it can also mean a follower of that doctrine.","zh":"pelagian 指“与伯拉纠/伯拉纠主义有关的”，强调人的自由意志并否认继承原罪；也可指伯拉纠主义者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pelagius (a 4th–5th century Christian teacher) or to Pelagianism, a view that emphasizes human free will and denies that people inherit “original sin.”","zh":"与伯拉纠（4—5世纪的基督教思想家）或“伯拉纠主义”有关的；强调人的自由意志、否认人类继承“原罪”的观点。"},"examples":[{"en":"Some writers call this optimistic view of human nature “Pelagian.”","zh":"一些作者把这种对人性的乐观看法称为“伯拉纠主义的”。"},{"en":"In theology class, we compared Augustinian and Pelagian ideas about sin and grace.","zh":"在神学课上，我们比较了奥古斯丁与伯拉纠关于罪与恩典的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows Pelagianism or strongly stresses human moral ability without divine grace.","zh":"伯拉纠主义者；主张人主要凭自身道德能力（而非神恩）行善的人。"},"examples":[{"en":"His opponents accused him of being a Pelagian.","zh":"反对者指责他是伯拉纠主义者。"},{"en":"Few today openly call themselves Pelagians, but the label still appears in debates.","zh":"如今很少有人公开自称伯拉纠主义者，但这个标签仍常出现在争论中。"}]}],"synonyms":["Pelagianist","(adj.) of Pelagius","(adj.) free-will (context-dependent)"],"phonetic":"/pəˈleɪdʒiən/","extraExplanation":["“Pelagian”常见于宗教史与神学讨论，尤其与圣奥古斯丁（Augustine）关于“原罪、恩典与救赎”的论战相关。传统教会多将伯拉纠主义视为异端，因为它被认为低估了罪对人的影响、也弱化了神恩的重要性。","在现代英语里，“Pelagian”有时会被延伸为一种评价：形容某观点过于相信人靠自身努力就能变好；但在正式写作中最好说明你指的是严格的神学含义还是更宽泛的比喻用法。"]}
{"word":"pelagianism","summary":{"en":"Pelagianism is a belief that humans can choose good and attain moral/salvific success mainly through free will, not primarily through divine grace; it’s also used broadly for “self-perfection by effort alone.”","zh":"伯拉纠主义强调人凭自由意志与个人努力就能行善并获得道德/救赎上的成功，而非主要依赖神恩；也可泛指“只靠努力就能自我完善”的观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian theological belief that humans are born morally neutral and can choose to do good and achieve salvation mainly through free will and personal effort, without needing God’s grace as an essential first step.","zh":"伯拉纠主义：一种基督教神学观点，认为人出生时在道德上是中性的，可以凭自由意志和个人努力选择行善并获得拯救，而不把上帝的恩典视为必不可少的先决条件。"},"examples":[{"en":"In church history, Pelagianism is often contrasted with Augustine’s teaching about original sin and grace.","zh":"在教会历史中，伯拉纠主义常常与奥古斯丁关于原罪与恩典的教导形成对比。"},{"en":"The professor explained why Pelagianism was judged heretical by many early Christian leaders.","zh":"教授解释了为什么伯拉纠主义被许多早期基督教领袖判为异端。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the idea that people can perfect themselves morally through willpower and discipline, without needing outside help (often used critically).","zh":"（引申义，常带批评）认为人可以仅靠意志力与自律实现道德完善，不需要外在帮助的观点。"},"examples":[{"en":"Some critics call that self-help message a kind of modern Pelagianism.","zh":"一些批评者把那种“全靠自我努力”的自助信息称为一种现代版的伯拉纠主义。"},{"en":"The novel questions the Pelagianism of believing we can fix everything by trying harder.","zh":"这部小说质疑那种“只要更努力就能解决一切”的伯拉纠式信念。"}]}],"synonyms":["theological voluntarism","moralism","self-salvation (informal)"],"phonetic":"/pəˈleɪdʒəˌnɪzəm/","extraExplanation":["“Pelagianism”源自英国修士Pelagius（伯拉纠，约4—5世纪）。他强调人的自由意志与道德责任，反对把人的罪与软弱过度归因于“原罪”。","在西方基督教传统中，它常与“Augustinianism（奥古斯丁主义）”对立：后者更强调原罪以及神恩在救赎中的必要性。","日常英语里偶尔会把“过度强调自我奋斗、忽视结构性条件或外在支持”的观点称为“Pelagianism”，但这种用法更像修辞批评，不一定严格等同于历史上的神学立场。"]}
{"word":"pelagianize","summary":{"en":"“Pelagianize” means to make an idea or teaching emphasize human effort and free will rather than divine grace.","zh":"“pelagianize”指把某种观点或教导“伯拉纠化”，即过度强调人的努力与自由意志、相对弱化神恩/恩典。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make (someone or something) Pelagian; to interpret or teach in a way that emphasizes human free will and moral effort over divine grace.","zh":"使（某人或某事）带有伯拉纠主义色彩；以强调人的自由意志与道德努力、弱化神恩（上帝恩典）的方式来解释或教导。"},"examples":[{"en":"Some critics argue that the sermon pelagianizes Christian faith by treating salvation as a reward for good behavior.","zh":"一些批评者认为，这篇讲道把基督信仰“伯拉纠化”，将救恩当作好行为的回报。"},{"en":"The author warns against pelagianizing prayer into a self-improvement routine.","zh":"作者提醒不要把祷告伯拉纠化成一种自我提升的日常训练。"}]}],"synonyms":["make Pelagian","interpret as Pelagian","stress human effort over grace","moralize (in a religious context)"],"phonetic":"/pəˈleɪdʒəˌnaɪz/","extraExplanation":["“Pelagianize”源自“Pelagian（伯拉纠主义的）”。伯拉纠（Pelagius，约4—5世纪）与奥古斯丁（Augustine）就“人是否主要靠自身努力得救、以及神恩的重要性”发生著名争论。英语中说某观点“pelagianizes”，通常带批评意味，暗示它过度强调人的功劳（moral effort / merit），而忽视“grace（恩典）”。","该词多见于神学、宗教史、或文学批评语境，日常口语中很少使用。写作时常搭配：pelagianize faith/doctrine/prayer/Christianity（使信仰/教义/祷告/基督教思想伯拉纠化）。"]}
{"word":"pelagianizer","summary":{"en":"A Pelagianizer is someone seen as promoting Pelagianism, stressing human choice and effort rather than divine grace.","zh":"Pelagianizer 指被认为在宣扬伯拉纠主义、强调人的自由选择与努力而非神恩的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who promotes, defends, or tries to make others adopt Pelagianism (the belief that humans can choose good without needing special divine grace).","zh":"鼓吹、捍卫或试图让他人接受“伯拉纠主义”（认为人类不必依靠特殊的神恩也能自主选择行善）的人。"},"examples":[{"en":"Some critics accused the author of being a Pelagianizer because he emphasized human effort over grace.","zh":"一些批评者指责这位作者是“伯拉纠主义鼓吹者”，因为他强调人的努力胜过神恩。"},{"en":"In the debate, he was labeled a Pelagianizer even though his views were more moderate.","zh":"在辩论中，他被贴上“伯拉纠主义者/鼓吹者”的标签，尽管他的观点更温和。"}]}],"synonyms":["Pelagian","advocate of Pelagianism","proponent of Pelagianism"],"phonetic":"/pəˈleɪdʒənˌaɪzər/","extraExplanation":["这个词非常少见，多出现在神学争论或历史宗教写作中，通常带有批评或指控意味（类似“把某人说成伯拉纠主义倾向”）。","“Pelagianism（伯拉纠主义）”源自5世纪神学家Pelagius（伯拉纠）。传统基督教（尤其奥古斯丁传统）强调“原罪”和“恩典”的必要性，因此常反对伯拉纠主义。","词形上，-ize/-izer 表示“使……成为/把……变成……的人”，所以 Pelagianizer 可理解为“使观点更像伯拉纠主义的人”或“推动伯拉纠主义的人”。"]}
{"word":"pelagic","summary":{"en":"Pelagic means “of the open ocean, far from land.”","zh":"pelagic 指“外海的、远洋的（远离陆地）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the open sea, especially the water far from land and the organisms that live there.","zh":"（尤指）远离陆地的外海的；与外海水域及其生物有关的。"},"examples":[{"en":"Pelagic fish like tuna live in the open ocean rather than near the coast.","zh":"像金枪鱼这样的远洋鱼类生活在外海，而不是近海沿岸。"},{"en":"Researchers studied pelagic ecosystems to understand how ocean life changes with temperature.","zh":"研究人员研究远洋生态系统，以了解海洋生物如何随温度变化。"}]}],"synonyms":["open-ocean","oceanic","offshore"],"phonetic":"/pəˈlædʒɪk/","extraExplanation":["“pelagic”来自希腊语 pélagos（意为“海、外海”）。在海洋学里常与“benthic（底栖的）”对比：pelagic 指水体中/开放海域的生物与环境，benthic 指海底附近的。","常见搭配：pelagic zone（远洋带/大洋水层）、pelagic fish（远洋鱼）、pelagic bird（远洋海鸟）、pelagic larva（浮游幼体）。"]}
{"word":"pelagothuria","summary":{"en":"Pelagothuria is a scientific genus name for pelagic (open-ocean) sea cucumbers.","zh":"Pelagothuria 是一个科学属名，指生活在外海水体中的海参类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of deep-sea, open-ocean (pelagic) sea cucumbers (holothurians), known for drifting or swimming rather than living on the seafloor","zh":"一种生活在深海外海（水体中、非海底）的海参（海参纲动物）属，以漂浮或游泳而不是栖息在海底而闻名"},"examples":[{"en":"Pelagothuria is unusual because it lives in the water column instead of crawling on the seafloor.","zh":"Pelagothuria 很特别，因为它生活在水体中，而不是在海底爬行。"},{"en":"Scientists sometimes film Pelagothuria swimming with its web-like body in the deep ocean.","zh":"科学家有时会拍到 Pelagothuria 在深海中用像“网状”身体游动的画面。"}]}],"synonyms":["(no common everyday synonym; related: sea cucumber, holothurian)"],"phonetic":"/ˌpɛləɡoʊˈθʊriə/","extraExplanation":["这是一个生物分类学名称（属名），在日常英语中不常见，更多出现在海洋生物学、深海生态、纪录片或科研文章里。","词源上可拆解为 pelago-（与“海洋/外海”有关）+ -thuria（与海参类常见属名 Holothuria 的命名传统相关），整体强调“外海生活的海参”。","常被提到的代表物种是 Pelagothuria natatrix（常被科普称为“会游泳的海参/泳海参”）。"]}
{"word":"pelagra","summary":{"en":"Pellagra is an illness caused by too little niacin (vitamin B3), leading to skin, digestive, and nervous-system problems.","zh":"糙皮病是因烟酸（维生素B3）缺乏引起的疾病，会导致皮肤、消化和神经系统问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disease caused by a lack of niacin (vitamin B3), often linked to poor diet; it can affect the skin, digestion, and the nervous system","zh":"糙皮病（烟酸/维生素B3缺乏引起的疾病），常与饮食营养不足有关；可影响皮肤、消化系统和神经系统"},"examples":[{"en":"Without enough niacin in the diet, pellagra can develop over time.","zh":"饮食中烟酸不足，久而久之可能会得糙皮病。"},{"en":"The doctor suspected pellagra when the patient had a rash and digestive problems.","zh":"当病人出现皮疹和消化问题时，医生怀疑是糙皮病。"}]}],"synonyms":["niacin deficiency disease","vitamin B3 deficiency"],"phonetic":"/pəˈlæɡrə/","extraExplanation":["你输入的“pelagra”常见为拼写变体/误拼，标准拼写通常是 **pellagra**。","糙皮病常被概括为“3D”：**dermatitis（皮炎）**、**diarrhea（腹泻）**、**dementia（痴呆/精神神经症状）**；严重时可危及生命。","历史上它与以玉米为主的单一饮食有关：如果玉米未经过传统的碱处理（如美洲原住民的“石灰水/碱水处理”，nixtamalization），其中的烟酸更不易被人体利用。"]}
{"word":"pelamyd","summary":{"en":"Pelamyd is a rare spelling for a tuna-like fish (bonito), usually written as “pelamid” or simply “bonito” today.","zh":"Pelamyd 是指一类类似金枪鱼的鱼（鲣鱼/bonito）的罕见拼写；现代更常写作 pelamid 或直接用 bonito。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish of the tuna/bonito family; a rare variant spelling of “pelamid.”","zh":"金枪鱼/鲣鱼一类的鱼；“pelamid”的罕见变体拼写。"},"examples":[{"en":"Some older texts use “pelamyd” for a kind of bonito.","zh":"一些较早的文本会用“pelamyd”指一种鲣鱼（bonito）。"},{"en":"In modern English, you’re more likely to see “bonito” than “pelamyd.”","zh":"在现代英语里，你更可能看到“bonito（鲣鱼）”，而不是“pelamyd”。"}]}],"synonyms":["bonito","pelamid","tuna (general)"],"phonetic":"/ˈpɛləˌmɪd/","extraExplanation":["“pelamyd”在现代英语中非常少见，更多出现在旧书、航海/博物学资料或拼写变体中。学习与使用时，通常用更常见的词“bonito（鲣鱼）”或更广义的“tuna（金枪鱼）”。","词源可追溯到古希腊语 pelamys（指某类海鱼）。不同语言与时代的转写会造成拼写差异（如 pelamid / pelamyd）。"]}
{"word":"pelanos","summary":{"en":"“pelanos” isn’t a recognized standard English word; it’s probably a typo or a proper name.","zh":"“pelanos”不是标准英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a proper name (e.g., a surname, brand, or place).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如姓氏、品牌或地名）。"},"examples":[{"en":"I can’t find “pelanos” in major English dictionaries—could it be a name or a typo?","zh":"我在主要英语词典里找不到“pelanos”——它会不会是名字或拼写错误？"},{"en":"If you meant “pianos,” the sentence would be: “They sell pianos online.”","zh":"如果你想写的是“pianos（钢琴）”，句子可以是：“他们在网上卖钢琴。”"}]}],"extraExplanation":["“pelanos”看起来不像常见英语词汇。我更需要上下文来判断你的意思：\n1）它出现在哪句话里？\n2）你是从哪里看到的（书、游戏、社交媒体、地名、人名）？\n3）你想表达的中文意思是什么？\n\n常见的可能近似词（仅供排查）：\n- pianos（钢琴的复数）\n- Pelanos（可能是姓氏/品牌名，需具体来源）\n- Peloponnese（伯罗奔尼撒，地名；拼写差距较大但有时会被误记）"]}
{"word":"pelargi","summary":{"en":"pelargi: a rare old plural meaning “storks.”","zh":"pelargi：罕见的古旧复数形式，意为“鹳（鹳鸟）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) “Pelargi” is an old plural form meaning “storks,” from Greek/Latin roots.","zh":"（罕见／历史用语）“pelargi”是一个较古老的复数形式，意思是“鹳／鹳鸟（storks）”，源自希腊语/拉丁语词根。"},"examples":[{"en":"In some older classical references, pelargi are mentioned as birds associated with migration.","zh":"在一些较早的古典文献中，pelargi 被提到是与迁徙相关的鸟类。"},{"en":"The author uses “pelargi” to evoke an ancient, mythic tone rather than everyday English.","zh":"作者使用“pelargi”来营造古老、带神话色彩的语气，而不是日常英语。"}]}],"synonyms":["storks"],"phonetic":"/pəˈlɑrˌdʒaɪ/","extraExplanation":["“pelargi”较可能出现在古典学、神话学或旧译本/旧词表中。它与希腊语 πελαργός（pelargós，意为“鹳”）有关，英语常用词仍是 stork（单数）/storks（复数）。","拼写提醒：很多学习者会把它和 Pelasgi/Pelasgians（“佩拉斯吉人”，古希腊传说中的民族）混淆；两者拼写相近但含义完全不同。","如果你其实想查的是《魔戒》里的地名“Pelargir”（佩拉基尔，刚铎的港口城市），告诉我我可以按专有名词再整理一条词条。"]}
{"word":"pelargic","summary":{"en":"Pelagic describes the open ocean or organisms living in the water column (not on the bottom).","zh":"Pelagic 指“远洋的/大洋水域的”，也指生活在水层中的生物（非底栖）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the open ocean (the water away from the coast and the sea floor).","zh":"与远海/大洋（远离海岸与海底的水域）有关的；远洋的。"},"examples":[{"en":"Tuna are pelagic fish that roam the open ocean.","zh":"金枪鱼是远洋鱼类，会在大洋中游弋。"},{"en":"Researchers tracked pelagic currents using drifting buoys.","zh":"研究人员用漂流浮标追踪远洋洋流。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology) Living or occurring in the water column of lakes or oceans, not on the bottom.","zh":"（生物）生活在湖泊或海洋的水层中，而不是在底部的；浮游水层的。"},"examples":[{"en":"Jellyfish are part of the pelagic community.","zh":"水母属于浮游水层生物群落的一部分。"},{"en":"The survey compared pelagic species with bottom-dwelling species.","zh":"这项调查对比了浮游水层物种与底栖物种。"}]}],"synonyms":["open-ocean","oceanic","offshore","marine"],"phonetic":"/pəˈlædʒɪk/","extraExplanation":["你输入的 **pelargic** 常见为拼写误差；标准拼写通常是 **pelagic**。","词源来自希腊语 *pelagos*（大海）。在海洋学里常与 **benthic**（底栖的）形成对比：*pelagic* 指“水体中/远海”，*benthic* 指“海底/底层”。"]}
{"word":"pelargikon","summary":{"en":"Pelargikon is a rare term used mainly in classical studies, most often referring to an ancient fortification on the Athenian Acropolis.","zh":"Pelargikon 是一个较罕见的术语，主要见于古典学领域，最常指雅典卫城上的一段古代防御工事/城墙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A fortification or wall on the Acropolis of Athens, traditionally associated with the “Pelasgian Wall.”","zh":"（古希腊）雅典卫城上的一段防御工事或城墙，传统上常与“佩拉斯吉亚城墙（Pelasgian Wall）”联系在一起。"},"examples":[{"en":"Some ancient authors mention the Pelargikon when describing the defenses of the Athenian Acropolis.","zh":"一些古代作者在描述雅典卫城的防御体系时会提到 Pelargikon。"},{"en":"Archaeologists still debate how much of the Pelargikon can be identified in surviving stonework.","zh":"考古学家仍在讨论现存石砌遗迹中有多少可以被认定为 Pelargikon 的一部分。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare) A Greek term meaning “stork-like,” from a root connected with “stork,” sometimes seen in scholarly writing as a label or epithet.","zh":"（罕见）一个希腊词，字面意为“像鹳一样的”，词根与“鹳（stork）”相关；在学术写作中偶尔作为标签或称号出现。"},"examples":[{"en":"In older scholarship, pelargikon may appear as a Greek-form adjective meaning “stork-like.”","zh":"在较早的学术著作中，pelargikon 可能以希腊语形态出现，作为“像鹳一样的”这一形容意义。"}]}],"synonyms":["Pelasgian Wall"],"phonetic":"ˌpɛləˈrɑːɡɪkɑːn","extraExplanation":["“Pelargikon”一词常见于古典学/考古学语境，更多是作为专名（某段城墙或防御区的名称）而不是现代英语常用词。","词源上与希腊语中表示“鹳”的词（pelargos）有关；因此在字面联想上带有“鹳/鹳之地/鹳之墙”的色彩。不同古代来源对其具体位置、范围与构造的说法可能不一致。"]}
{"word":"pelargomorph","summary":{"en":"Pelargomorph is a rare word meaning “stork-like” or “a stork-like bird,” often found in older scientific writing.","zh":"pelargomorph 很少见，表示“像鹳的/与鹳类有关的”，或指“鹳形鸟”，多见于较旧的科学文献。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Resembling a stork or related to the group of stork-like birds.","zh":"（形容词）像鹳的；与鹳类或“鹳形类/鹳形目”鸟有关的。"},"examples":[{"en":"The fossil was described as having a pelargomorph beak shape, long and straight like a stork’s.","zh":"这块化石被描述为具有鹳形的喙形——又长又直，像鹳的喙。"},{"en":"In older sources, some long-legged wading birds were grouped as pelargomorph.","zh":"在较早的资料里，一些长腿涉禽曾被归为“鹳形类（pelargomorph）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A stork-like bird, especially in older scientific or descriptive writing.","zh":"（名词）鹳形鸟；（尤指旧式科学/描写用语中）类似鹳的鸟。"},"examples":[{"en":"The author compared the heron to a pelargomorph, noting its tall stance and slow steps.","zh":"作者把苍鹭比作一种“鹳形鸟”，强调它高挑的姿态和缓慢的步伐。"},{"en":"Some 19th‑century texts use “pelargomorphs” for a broad set of wading birds.","zh":"一些19世纪的文本用“pelargomorphs（鹳形鸟）”来泛指一大类涉禽。"}]}],"synonyms":["stork-like","ciconiiform (older/technical)","wading-bird-like"],"phonetic":"/pəˈlɑrɡəˌmɔrf/","extraExplanation":["这个词非常少见，多出现在较旧的动物分类或描述性写作中。现代鸟类分类里，“鹳形目（Ciconiiformes）”的范围与历史上曾被归入的涉禽并不完全一致，因此当你在旧文献看到 pelargomorph，常常更像是“鹳状/鹳一样”的描述或旧式分类标签。","词源上可拆为 pelargo-（来自希腊语 pelargos“鹳”）+ -morph（“形态/形状”）。"]}
{"word":"pelargomorphae","summary":{"en":"Pelargomorphae is an uncommon, mostly older taxonomic term for a group of large waterbirds (often including pelican- and stork-like birds), with membership depending on the classification system.","zh":"Pelargomorphae 是一个较少见、偏旧的分类学术语，指一类大型水鸟（常含鹈鹕/鹳类相关鸟群），具体成员随分类体系不同而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A scientific name for a group (historically treated as an order or higher-level group) of large waterbirds, especially those related to pelicans and storks; the exact membership varies by classification system and the term is now uncommon in modern sources.","zh":"（动物学／分类学）一个鸟类类群的学名（历史上曾被当作“目”或更高层级使用），多指与鹈鹕、鹳等大型水鸟相关的类群；其包含成员因不同分类体系而异，现代文献中较少使用。"},"examples":[{"en":"In older zoology texts, Pelargomorphae was sometimes used to group pelicans, storks, and related waterbirds.","zh":"在较早的动物学教材中，Pelargomorphae 有时用来把鹈鹕、鹳以及相关水鸟归为一组。"},{"en":"The paper notes that terms like Pelargomorphae have largely been replaced by newer phylogenetic classifications.","zh":"该论文指出，像 Pelargomorphae 这样的术语在很大程度上已被较新的系统发育分类所取代。"}]}],"synonyms":["(related modern terms) Pelecaniformes","(related modern terms) Ciconiiformes"],"phonetic":"/pəˌlɑrɡoʊˈmɔrfiˌi/","extraExplanation":["该词来自希腊语词根：pelargos（鹳）+ morphē（形态/形状），字面意思接近“鹳形类”。","在现代鸟类分类中，更常见的是使用具体“目/科”的名称（如 Pelecaniformes 鹈形目、Ciconiiformes 鹳形目等；不同体系划分也会变化）。因此你在新出版的鸟类学资料里不一定能频繁看到 Pelargomorphae。","阅读旧文献时，遇到该词可先把它理解为“与鹳/鹈鹕等大型水鸟相关的一类（旧分类概念）”，再结合作者所用的分类体系确认其具体范围。"]}
{"word":"pelargomorphic","summary":{"en":"Pelargomorphic means “stork-like” in shape or form (a rare scientific adjective).","zh":"pelargomorphic 指“鹳形的、像鹳的”（罕见的科学用形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, biology) Resembling a stork; stork-shaped or stork-like in form.","zh":"（罕见，生物学）似鹳的；外形像鹳（鹳形）的。"},"examples":[{"en":"In early descriptions of some birds, a long-legged, pelargomorphic silhouette was often noted.","zh":"在一些早期的鸟类描写中，常会提到一种长腿、鹳形（pelargomorphic）的轮廓。"},{"en":"The sculpture gives the creature a pelargomorphic neck and stance, evoking a stork.","zh":"这件雕塑让生物呈现出鹳形的脖颈与站姿，让人联想到鹳。"}]}],"synonyms":["stork-like","stork-shaped","storkish","pelargine"],"phonetic":"/pəˌlɑrɡoʊˈmɔrfɪk/","extraExplanation":["词源提示：pelargomorphic 来自希腊语词根 pelargo-（“鹳”）+ -morphic（“形态的/……形的”）。在现代英语中非常少见，多出现在较旧的动物学、形态学描述里。","使用建议：日常写作几乎不用；更常见的表达是 stork-like（像鹳的）或 stork-shaped（鹳形的）。"]}
{"word":"pelargonate","summary":{"en":"Pelargonate means a salt or ester made from pelargonic (nonanoic) acid.","zh":"Pelargonate 指由壬酸（pelargonic/nonanoic acid）形成的盐或酯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of pelargonic acid (nonanoic acid).","zh":"壬酸（又称“天竺葵酸”，pelargonic acid）的盐或酯。"},"examples":[{"en":"This fragrance ingredient is a pelargonate ester used to create a fruity, waxy note.","zh":"这种香精成分是一种壬酸酯（pelargonate ester），用于营造果香、蜡质的气味特征。"},{"en":"In the lab, the chemist prepared a pelargonate by reacting pelargonic acid with an alcohol.","zh":"在实验室里，化学家通过让壬酸与醇反应制得一种壬酸盐/壬酸酯（pelargonate）。"}]}],"synonyms":["nonanoate"],"phonetic":"/pəˈlɑrɡəˌneɪt/","extraExplanation":["“pelargonate”主要出现在化学语境中，日常英语很少用。它和“nonanoate（壬酸根/壬酸盐或壬酸酯）”基本同义，因为pelargonic acid 就是 nonanoic acid。","词根 pelargon- 来自 pelargonium（天竺葵属植物）。历史上这种酸与天竺葵气味/来源相关而得名，但在系统命名里更常用“nonanoic acid / nonanoate”。"]}
{"word":"pelargonic","summary":{"en":"Pelargonic means “related to pelargonic acid (nonanoic acid).”","zh":"pelargonic 意为“与壬酸（佩拉戈尼酸，nonanoic acid）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pelargonic acid (also called nonanoic acid), a fatty acid sometimes found in plants and used in chemistry and industry.","zh":"与壬酸（也叫“佩拉戈尼酸”、nonanoic acid）有关的；一种可在部分植物中发现、并用于化学与工业的脂肪酸相关的。"},"examples":[{"en":"Pelargonic acid has a strong, unpleasant odor, so pelargonic compounds are handled carefully in labs.","zh":"壬酸气味强烈且不太好闻，所以实验室里会小心处理与壬酸有关的化合物。"},{"en":"The label says the herbicide contains pelargonic acid as an active ingredient.","zh":"标签上写这种除草剂的有效成分含有壬酸。"}]}],"synonyms":["nonanoic (when referring to the acid as nonanoic acid)","related to pelargonic acid"],"phonetic":"/ˌpɛl.ɚˈɡɑː.nɪk/","extraExplanation":["“Pelargonic”主要出现在化学/生物学语境里，日常英语很少单独使用；更常见的说法是 **pelargonic acid** 或直接用系统名 **nonanoic acid（壬酸）**。","词源与天竺葵属植物 **Pelargonium** 有关：早期研究中，人们从相关植物或其精油研究中接触到这种酸与命名方式，因此形成了该形容词。","在实际用法中，它常与“acid（酸）”“compound（化合物）”“derivative（衍生物）”“herbicide（除草剂）”等搭配出现。"]}
{"word":"pelargonidin","summary":{"en":"Pelargonidin is a red-to-orange plant pigment (an anthocyanidin) that colors many flowers and fruits.","zh":"Pelargonidin（天竺葵素）是一种红到橙红的植物色素（花青素苷元），使许多花和水果呈现颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring red-to-orange plant pigment (an anthocyanidin) found in many flowers and fruits, which helps give them their color.","zh":"（一种天然存在的植物色素）天竺葵素；属于花青素苷元（anthocyanidin）的一种，常呈红色到橙红色，能让许多花和水果呈现鲜艳颜色。"},"examples":[{"en":"Pelargonidin contributes to the bright red color of some flowers and berries.","zh":"天竺葵素会让一些花朵和浆果呈现鲜红色。"},{"en":"Scientists measured pelargonidin levels to compare pigment differences between two strawberry varieties.","zh":"科学家测量天竺葵素含量，用来比较两种草莓品种在色素上的差异。"}]}],"synonyms":["anthocyanidin","plant pigment"],"phonetic":"/pəˌlɑrɡəˈnaɪdɪn/","extraExplanation":["“pelargonidin”这个词来自植物属名 Pelargonium（天竺葵属），因为这类色素与天竺葵等植物的红色花色研究有关。","在食品与营养学语境中，它常与“anthocyanins（花青素）”一起出现：anthocyanins 是含糖的形式，而 pelargonidin 指去糖后的“苷元”形式（anthocyanidin）。"]}
{"word":"pelargonin","summary":{"en":"Pelargonin is a natural red anthocyanin pigment in plants.","zh":"Pelargonin 是植物中的一种天然红色花青素色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural red plant pigment (an anthocyanin) found in some flowers and fruits, responsible for red to pink colors.","zh":"一种天然的红色植物色素（花青素的一种），存在于某些花和果实中，使其呈现红到粉红的颜色。"},"examples":[{"en":"Pelargonin helps give some geranium petals their bright red color.","zh":"Pelargonin 有助于使一些天竺葵花瓣呈现鲜艳的红色。"},{"en":"Scientists studied pelargonin to understand how flower color changes with acidity.","zh":"科学家研究 pelargonin，以了解花的颜色如何随酸碱度变化。"}]}],"synonyms":["anthocyanin","plant pigment"],"phonetic":"/pəˈlɑr.dʒə.nɪn/","extraExplanation":["“Pelargonin”属于花青素（anthocyanins）这一大类植物色素。花青素常会随着环境酸碱度（pH）不同而呈现不同颜色，因此常用于研究花色形成、天然色素与食品着色等。","词源与天竺葵属（Pelargonium）相关：这种色素最初与某些天竺葵/老鹳草类植物的红色花朵联系密切。","在专业文献中，你也可能看到相关名词如“pelargonidin”（一种花青素的母核/苷元）或其“glycoside（糖苷）”形式；不同资料对命名的细分可能略有差异。"]}
{"word":"pelargonium","summary":{"en":"Pelargonium is a flowering plant often grown in pots and commonly (though not strictly) called a geranium.","zh":"Pelargonium 指一种常见的观赏开花盆栽植物，日常英语中常（但并不严格）被称为 geranium（天竺葵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant commonly called a geranium (especially the kinds grown in pots), with colorful flowers and often scented leaves.","zh":"天竺葵属植物（常见盆栽“天竺葵/洋绣球”，花色鲜艳，叶子常带香味）。"},"examples":[{"en":"She put a red pelargonium on the windowsill for more color.","zh":"她在窗台上放了一盆红色天竺葵，让房间更有色彩。"},{"en":"Some pelargoniums have lemon-scented leaves.","zh":"有些天竺葵的叶子带有柠檬香味。"}]}],"synonyms":["geranium (common name)"],"phonetic":"/ˌpɛl.ərˈɡoʊ.ni.əm/","extraExplanation":["在日常英语里，很多人把盆栽的 pelargonium 直接叫作 “geranium（天竺葵）”。严格来说，Geranium 是另一属（通常指耐寒的“老鹳草属”），而常见的观赏盆栽更准确叫 Pelargonium。园艺、植物学语境中更常用 pelargonium 来区分。","词源来自希腊语 pelargos（“鹳”），指其果实形状像鹳嘴。"]}
{"word":"pelasgi","summary":{"en":"Pelasgi refers to an ancient, pre-Greek people mentioned in classical sources as early inhabitants of parts of Greece and the Aegean.","zh":"Pelasgi 指古典文献中提到的、据说早于希腊人的古代居民（佩拉斯吉人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient people (often described as pre-Greek or pre-Hellenic) who were believed by some classical writers to have lived in the Aegean region and parts of Greece before the Greeks; plural form referring to these people.","zh":"古代民族名（常被描述为希腊人之前、前希腊时期的居民）；指据一些古典作家所说，曾在爱琴海地区与希腊部分地区居住、早于希腊人的“佩拉斯吉人”（复数）。"},"examples":[{"en":"Some ancient Greek authors wrote about the Pelasgi as the earliest inhabitants of certain regions.","zh":"一些古希腊作者记载说，佩拉斯吉人是某些地区最早的居民。"},{"en":"In discussions of early Aegean history, the Pelasgi are sometimes mentioned as a mysterious pre-Hellenic group.","zh":"在讨论早期爱琴海历史时，佩拉斯吉人有时会被提到，作为一个带有神秘色彩的前希腊族群。"}]}],"synonyms":["Pelasgians","pre-Hellenic inhabitants"],"phonetic":"/pəˈlæsdʒaɪ/","extraExplanation":["“Pelasgi / 佩拉斯吉人”在古代文献中有时被当作一个比较宽泛的称呼，用来指称“在希腊人之前的居民”。现代历史与考古研究中，这个名称的具体所指并不总是清楚，可能因作者、地区与时代而异。","常见相关词：Pelasgian（形容词/名词：佩拉斯吉的；佩拉斯吉人）。在英文写作中更常见的形式是复数 Pelasgians。"]}
{"word":"pelasgian","summary":{"en":"Pelasgian means “of the Pelasgians,” an ancient, pre-Greek people mentioned in Greek sources; it can also mean a Pelasgian person.","zh":"Pelasgian 指“与佩拉斯吉人有关的”，即古希腊文献中提到的前希腊居民；也可指“佩拉斯吉人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pelasgians, a name used by ancient Greek writers for the pre-Greek (pre-Hellenic) peoples of the Aegean region and parts of Greece.","zh":"与“佩拉斯吉人（Pelasgians）”有关的；古希腊作者用来指爱琴海地区及希腊部分地区的前希腊（前赫勒尼）居民或民族的。"},"examples":[{"en":"Some historians use “Pelasgian” as a broad label for peoples who lived in Greece before Greek-speaking cultures became dominant.","zh":"一些历史学家把“Pelasgian（佩拉斯吉的）”当作一个宽泛标签，用来指希腊在希腊语文化占主导之前居住在那里的人群。"},{"en":"The essay discusses Pelasgian influences in myth and place names.","zh":"这篇文章讨论了神话与地名中的佩拉斯吉影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Pelasgians, as described in ancient Greek sources.","zh":"（古希腊文献所称的）佩拉斯吉人；前希腊居民之一。"},"examples":[{"en":"In the legend, the Pelasgians were among the earliest inhabitants of the land.","zh":"在传说中，佩拉斯吉人是这片土地最早的居民之一。"},{"en":"Ancient writers sometimes called various groups “Pelasgians,” so the term can be imprecise.","zh":"古代作者有时把不同群体都称作“佩拉斯吉人”，因此这个词可能并不精确。"}]}],"synonyms":["pre-Hellenic","Aegean (in historical context)","proto-Greek (related but not identical)"],"phonetic":"/pəˈlæʒən/","extraExplanation":["“Pelasgian”主要出现在古典学、古代史与神话研究语境中。它并不等同于一个已被完全确认的单一民族，而更像古希腊作者（如希罗多德等）用来指称“在希腊人之前的居民”的传统称呼，因此在现代学术写作里常带有“笼统/不确定”的意味。"]}
{"word":"pelasgic","summary":{"en":"“Pelasgic” means “of or relating to the Pelasgians,” an ancient, pre-Greek people mentioned by Greek writers.","zh":"“Pelasgic”意为“与佩拉斯吉人有关的”，指古希腊作者所称的前希腊时期古老居民/民族。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pelasgians, a name used by ancient Greek writers for pre-Hellenic (very early) peoples of the Aegean region, especially Greece.","zh":"与“佩拉斯吉人（Pelasgians）”有关的；古希腊作家用来指称爱琴海地区（尤指希腊）早于希腊人（前希腊时期）的古老民族/居民。"},"examples":[{"en":"Some historians use “Pelasgic” to talk about very early settlement layers in Greece.","zh":"一些历史学者用“Pelasgic”来讨论希腊早期定居层的遗迹。"},{"en":"The book mentions Pelasgic tribes, but it also warns that the term is not very precise.","zh":"书中提到“Pelasgic部落”，但也提醒这个术语并不十分精确。"}]}],"synonyms":["Pelasgian","pre-Hellenic (in context)"],"phonetic":"/pəˈlæz.dʒɪk/","extraExplanation":["“Pelasgic”多见于历史、考古、古典学写作。需要注意：在古希腊文献中，“Pelasgians/佩拉斯吉人”常是一个较宽泛、带有传说色彩的称呼，用来指“在希腊人之前就在那里的人”。因此它并不总是指某一个确定、可清晰界定的民族。","词源来自“Pelasgian（佩拉斯吉人）”，再加形容词后缀“-ic”。在英文里常和“pre-Hellenic（前希腊的）”“Aegean（爱琴海的）”“ancient（古代的）”等词搭配。"]}
{"word":"pelasgikon","summary":{"en":"Pelasgikon is a classical term for an ancient area/fortification near the Acropolis in Athens, linked in tradition to the “Pelasgians.”","zh":"Pelasgikon 指雅典卫城附近与早期防御工事相关的一处古代区域/围区，传统上与“佩拉斯吉人”联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A place in Athens—near the Acropolis—associated with early fortifications and an area sometimes called the “Pelasgian” wall or enclosure; mentioned by ancient writers as the Pelasgikon.","zh":"（古希腊）雅典的一处地点（靠近卫城），与早期防御工事有关；古代文献中常把它与“佩拉斯吉亚城墙/围区”联系起来，称为 Pelasgikon。"},"examples":[{"en":"Some historians connect the Pelasgikon with early defensive works around the Acropolis.","zh":"一些历史学者把 Pelasgikon 与卫城周边的早期防御工事联系起来。"},{"en":"In readings on classical Athens, you may see Pelasgikon used as a name for an ancient enclosure near the citadel.","zh":"在关于古典雅典的阅读中，你可能会看到 Pelasgikon 用来指卫城附近的一片古代围区。"}]}],"synonyms":["Pelasgian enclosure","Pelasgian wall","Pelasgian fort"],"phonetic":"/pəˈlæzɪkɑn/","extraExplanation":["“Pelasgikon”源自对“Pelasgoi（佩拉斯吉人）”的称呼。佩拉斯吉人常被古希腊作者描述为希腊人到来之前的早期居民或“先民”，因此这个地名带有“非常古老/先希腊”的色彩。","该词更多见于古典学与考古学语境（如对雅典卫城周边地形、城墙与禁令的讨论），日常英语中几乎不会使用。不同作者对它具体指代的范围或建筑也可能略有差异。"]}
{"word":"pelasgoi","summary":{"en":"Pelasgoi is the Greek plural for “Pelasgians,” an ancient name for pre-Hellenic peoples of the Aegean/Greece used in classical sources.","zh":"Pelasgoi 是“佩拉斯吉人”（Pelasgians）的希腊语复数，古典文献中用来指称希腊之前的史前居民/族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient term (Greek plural) referring to the Pelasgians, a name used by Greek writers for pre-Hellenic peoples living in parts of the Aegean and Greece.","zh":"（希腊语复数）指“佩拉斯吉人/珀拉斯吉人”（Pelasgians），古希腊作者用来称呼希腊人到来之前，居住在爱琴海及希腊部分地区的史前族群。"},"examples":[{"en":"Some ancient sources describe the Pelasgoi as earlier inhabitants of the Aegean islands.","zh":"一些古代文献把佩拉斯吉人（Pelasgoi）描述为爱琴海诸岛更早的居民。"},{"en":"In discussions of Greek prehistory, you may see Pelasgoi used alongside the English term Pelasgians.","zh":"在讨论希腊史前史时，你可能会看到 Pelasgoi 与英文 Pelasgians 并列使用。"}]}],"synonyms":["Pelasgians"],"phonetic":"/pəˈlæzɡɔɪ/","extraExplanation":["Pelasgoi 是希腊语的复数形式；单数常见为 Pelasgos（佩拉斯戈斯）。在英语学术写作里更常见 Pelasgians（佩拉斯吉人），而 Pelasgoi 往往出现在引用希腊文、古典学或历史语言学语境中。","“佩拉斯吉人”并不是一个清晰、单一、可考证的民族名称。古代作者对其来源与分布说法不一，现代学界通常把它看作希腊人对“更早居民/外来者”的泛称之一，而非严格的人种或国家称呼。"]}
{"word":"Pele","summary":{"en":"Pelé usually refers to the legendary Brazilian soccer player; Pele can also mean the Hawaiian volcano and fire goddess.","zh":"Pelé通常指传奇巴西足球运动员贝利；Pele也可指夏威夷神话中的火山与火之女神。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Pelé: a famous Brazilian soccer (football) player (1940–2022), widely considered one of the greatest of all time.","zh":"贝利：著名巴西足球运动员（1940–2022），常被认为是史上最伟大的球员之一。"},"examples":[{"en":"Pelé helped Brazil win three World Cups.","zh":"贝利帮助巴西队赢得了三次世界杯冠军。"},{"en":"Many people call Pelé “the King of Football.”","zh":"很多人称贝利为“足球之王”。"}]},{"partOfSpeech":"other","definition":{"en":"Pele: in Hawaiian religion and mythology, the goddess of volcanoes and fire (often written as Pele or Pelehonuamea).","zh":"佩蕾（或译“贝蕾/佩雷”）：夏威夷宗教与神话中的火山与火之女神（常写作Pele）。"},"examples":[{"en":"In Hawaiian stories, Pele lives in the volcano Kīlauea.","zh":"在夏威夷传说中，佩蕾居住在基拉韦厄火山。"},{"en":"Some locals speak about Pele with deep respect when discussing volcanic eruptions.","zh":"一些当地人在谈论火山喷发时，会非常敬重地提到佩蕾。"}]}],"synonyms":["Edson Arantes do Nascimento (Pelé’s full name)","the King of Football"],"phonetic":"/pəˈleɪ/","extraExplanation":["“Pelé”是葡萄牙语拼写，常指巴西球星贝利；英文里也常用不带重音符号的“Pele”。发音通常接近“puh-LAY”。","夏威夷的Pele属于神话/信仰人物。在与夏威夷文化相关的语境中，提到Pele时一般会保持尊重的表达方式。"]}
{"word":"pele","summary":{"en":"“pele” can mean Hawaiian volcanic material, or “Pelé,” the famous Brazilian soccer player (spelling and context matter).","zh":"“pele”可能指夏威夷的火山熔岩/火山岩屑，也可能指著名巴西球王“Pelé”（拼写与语境很关键）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of volcanic lava or porous volcanic rock found especially in Hawaiʻi (often spelled with macrons as “pēlē”).","zh":"一种火山熔岩或多孔的火山岩，尤其见于夏威夷（常写作带长音符号的“pēlē”）。"},"examples":[{"en":"The trail was covered with sharp pele, so we walked carefully.","zh":"小径上铺满了尖锐的 pele，所以我们走得很小心。"},{"en":"Scientists studied pele fragments to learn about the eruption.","zh":"科学家研究 pele 的碎片来了解这次喷发。"}]},{"partOfSpeech":"n.","definition":{"en":"Pelé: the nickname of Edson Arantes do Nascimento (1940–2022), a legendary Brazilian soccer player.","zh":"Pelé：埃德松·阿兰特斯·杜·纳西门托（1940–2022）的昵称，巴西传奇足球运动员。"},"examples":[{"en":"Pelé is often called one of the greatest soccer players of all time.","zh":"Pelé 常被称为史上最伟大的足球运动员之一。"},{"en":"Many kids started playing soccer because they watched Pelé.","zh":"很多孩子因为看了 Pelé 的比赛而开始踢足球。"}]}],"synonyms":["volcanic lava","volcanic rock","basaltic lava (context-dependent)"],"phonetic":"/pəˈleɪ/","extraExplanation":["“Pele / Pelé / Pēlē”在英语里可能指不同事物：无重音的“pele”有时被用来指夏威夷火山相关的岩屑/熔岩；带重音符号的“Pelé”通常特指巴西球王；而夏威夷神话中的火山女神常写作“Pele”。在正式写作里，最好根据语境加上重音或长音符号以避免混淆。","发音方面：英语里提到足球明星“Pelé”常读作 /pəˈleɪ/（重音在第二音节）；若你是在说夏威夷相关的“Pele”，有些人也会用接近“peh-LEH/peh-LAY”的读法，但最稳妥的是参考你所读到的来源或当地用法。"]}
{"word":"pelean","summary":{"en":"“Pelean” is a literary adjective meaning “of Peleus,” often used to describe Achilles in classical contexts.","zh":"“Pelean”是较文学化的形容词，意为“与珀琉斯有关的”，常在古典语境中用来指代或修饰阿喀琉斯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Peleus (the father of Achilles in Greek mythology), or to his family/lineage.","zh":"与珀琉斯（希腊神话中阿喀琉斯之父）有关的；或指其家族/血统的。"},"examples":[{"en":"Some poets call Achilles the Pelean hero, reminding readers of his father Peleus.","zh":"一些诗人称阿喀琉斯为“珀琉斯之子/珀琉斯家的英雄”，以提醒读者他的父亲是珀琉斯。"},{"en":"In older translations, you may see “Pelean” used as an epithet for Achilles.","zh":"在较早的译本里，你可能会看到“Pelean”作为阿喀琉斯的称号/修饰语。"}]}],"synonyms":["Peleian","of Peleus","Peleus’ (as in “Peleus’ son”)"],"phonetic":"/ˈpiːliən/","extraExplanation":["“Pelean”源自专名Peleus（珀琉斯）+ 形容词后缀 -an，常见于较古典或文学化的英语，用来制造史诗感（epithet，称号式修饰）。","在《伊利亚特》传统中，阿喀琉斯更常见的称号是“Peleus’ son”（珀琉斯之子）或“son of Peleus”。“Pelean”属于更少见、更书面/诗歌化的变体。"]}
{"word":"pelecan","summary":{"en":"“pelecan” is usually a misspelling of “pelican,” a large water bird with a throat pouch.","zh":"“pelecan”通常是“pelican”的拼写错误，指一种喉部有囊袋的大型水鸟（鹈鹕）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A large water bird with a long bill and a throat pouch used for catching fish; correct spelling: “pelican.”","zh":"（常见拼写错误）一种大型水鸟，嘴很长，喉部有可伸缩的囊袋，用来捕鱼；正确拼写是 “pelican”。"},"examples":[{"en":"I saw a pelican (not “pelecan”) diving for fish near the pier.","zh":"我看到一只鹈鹕（不是“pelecan”）在码头附近俯冲捕鱼。"},{"en":"Pelicans often gather where fishing boats return.","zh":"渔船返航的地方常常会聚集很多鹈鹕。"}]}],"synonyms":["pelican"],"phonetic":"/ˈpɛlɪkən/","extraExplanation":["“pelecan”多半是把“pelican”拼错了。英文里有时也会看到更古老或罕见的拼法，但在现代标准英语中应使用“pelican”。","Pelican 在西方文化与宗教艺术中偶尔象征“自我牺牲/养育”，但日常语境里基本就是指这种水鸟。"]}
{"word":"pelecani","summary":{"en":"“pelecani” is Romanian for “pelicans” (plural).","zh":"“pelecani”是罗马尼亚语，意思是“鹈鹕（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Romanian) plural of “pelican”; pelicans.","zh":"（罗马尼亚语）“pelican（鹈鹕）”的复数：鹈鹕（们）。"},"examples":[{"en":"In Romanian, “pelecani” means “pelicans.”","zh":"在罗马尼亚语中，“pelecani”的意思是“鹈鹕（们）”。"},{"en":"We saw pelecani near the Danube Delta.","zh":"我们在多瑙河三角洲附近看到了鹈鹕。"}]}],"synonyms":["pelicans"],"phonetic":"/ˌpɛlɛˈkɑni/","extraExplanation":["“pelecani”不是英语单词，而是罗马尼亚语名词复数形式：单数是“pelican”（一只鹈鹕），复数是“pelecani”（多只鹈鹕）。在英文文章里偶尔会作为外来词出现，通常与罗马尼亚地名/文化语境相关。"]}
{"word":"pelecanidae","summary":{"en":"Pelecanidae is the scientific name for the pelican family of birds.","zh":"Pelecanidae 是“鹈鹕科”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of large water birds known as pelicans, with long bills and a stretchy throat pouch used to catch fish","zh":"鹈鹕科（生物分类中的一个鸟类“科”），指鹈鹕这一类大型水鸟，嘴长，喉部有可伸缩的喉囊，用来捕鱼"},"examples":[{"en":"Pelicans belong to the family Pelecanidae.","zh":"鹈鹕属于鹈鹕科（Pelecanidae）。"},{"en":"Scientists study Pelecanidae to understand how pelicans adapted to catching fish.","zh":"科学家研究鹈鹕科，以了解鹈鹕如何适应捕鱼。"}]}],"synonyms":["pelican family","pelicans"],"phonetic":"ˌpɛlɪˈkænɪdi","extraExplanation":["“Pelecanidae”是拉丁化的科学名称，常见于生物学、动物学和观鸟资料中；日常英语里更常说“pelicans”或“the pelican family”。","在生物分类中，“family（科）”位于“order（目）”和“genus（属）”之间，所以Pelecanidae指的是包含多个鹈鹕物种的一个分类层级。"]}
{"word":"pelecaniformes","summary":{"en":"Pelecaniformes is a scientific name for an order of water birds, traditionally including pelicans and related seabirds.","zh":"Pelecaniformes 是水鸟的一类“目”级科学分类名称，传统上包括鹈鹕及其相关鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of large water birds that traditionally includes pelicans and several related seabirds (classification may vary in modern taxonomy).","zh":"鹈形目：一类大型水鸟的“目”级分类单位，传统上包括鹈鹕以及若干相关的海鸟（现代分类有时会调整其范围）。"},"examples":[{"en":"Pelicans belong to the order Pelecaniformes.","zh":"鹈鹕属于鹈形目（Pelecaniformes）。"},{"en":"Some textbooks group herons differently, so the members of Pelecaniformes can vary by source.","zh":"有些教材对鹭类的归属划分不同，所以不同资料中鹈形目的成员可能不一样。"}]}],"synonyms":["the pelican order","pelicans and allies"],"phonetic":"/ˌpɛlɪˈkænɪˌfɔrmiːz/","extraExplanation":["“Pelecaniformes”是拉丁化的学术名称，常见于生物学、鸟类学论文与科普书中；日常英语里人们更常直接说“pelicans（鹈鹕）”或具体鸟名，而不是用到这个“目”的名称。","分类学会随着研究（尤其是DNA证据）而调整：过去常把若干“像鹈鹕的鸟”放在同一目中；现代系统学在不同版本里可能扩大或重新划分其范围，因此阅读时要注意所依据的分类体系。"]}
{"word":"pelecanoides","summary":{"en":"Pelecanoides is the genus name for diving petrels—small Southern Ocean seabirds that dive underwater to feed.","zh":"Pelecanoides 指“潜水海燕属”，是南大洋一带擅长潜水觅食的小型海鸟的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small seabirds called diving petrels, found mainly in the Southern Ocean; they are strong underwater “flyers” that hunt by diving.","zh":"（鸟类）潜水海燕属：主要分布在南大洋一带的一类小型海鸟，擅长潜入水下“飞行”捕食。"},"examples":[{"en":"Scientists recorded Pelecanoides diving to catch small fish and krill.","zh":"科学家记录到潜水海燕属（Pelecanoides）的鸟会潜水捕食小鱼和磷虾。"},{"en":"Pelecanoides species breed on remote southern islands.","zh":"潜水海燕属（Pelecanoides）的物种常在偏远的南方岛屿上繁殖。"}]}],"synonyms":["diving petrels","diving petrel (common name)"],"phonetic":"/ˌpɛlɪkəˈnɔɪdiːz/","extraExplanation":["“Pelecanoides”是拉丁化的生物学属名，写作大写，常见于科普、鸟类图鉴和学术文章中；日常英语更常说“diving petrel（潜水海燕）”。","词源上与“pelican（鹈鹕）”有关（因外形或喙部特征的联想而得名），但它们并不是鹈鹕。"]}
{"word":"pelecanoidinae","summary":{"en":"*Pelecanoidinae* is a scientific (taxonomic) name for the diving petrels in some bird classifications.","zh":"*Pelecanoidinae* 是某些鸟类分类体系中对“潜水海燕”这一类群使用的科学（分类学）名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily name used in some classifications for the diving petrels (small seabirds that “fly” underwater to catch food), especially those in the genus *Pelecanoides*.","zh":"（分类学）在某些分类体系中使用的“潜水海燕亚科”名称，指一类会在水下“飞行”捕食的小型海鸟，尤指*Pelecanoides*（潜水海燕属）相关成员。"},"examples":[{"en":"In some bird checklists, *Pelecanoidinae* groups the diving petrels within a broader petrel family.","zh":"在一些鸟类名录中，*Pelecanoidinae* 会把潜水海燕归在更大的海燕类群之下。"},{"en":"Researchers may compare *Pelecanoidinae* with other petrel groups to study seabird evolution.","zh":"研究人员可能会把 *Pelecanoidinae* 与其他海燕类群对比，用来研究海鸟的演化。"}]}],"synonyms":["diving petrels","*Pelecanoides* (genus name)"],"phonetic":"/ˌpɛlɪˌkænoʊˈɪdiːniː/","extraExplanation":["这是拉丁化的科学分类名称，日常英语中很少使用；更常见的普通名称是“diving petrels（潜水海燕）”。","不同学者/资料库对海燕类群的划分可能不一致：潜水海燕有时被当作独立科（Pelecanoididae），也可能在某些体系里作为更大科之下的亚科（Pelecanoidinae）。","词形上常见后缀 -inae 表示“亚科”，多用于动物学分类（如某某亚科）。"]}
{"word":"pelecanus","summary":{"en":"Pelecanus is the scientific (Latin) genus name for pelicans.","zh":"Pelecanus 是“鹈鹕”的属名（拉丁学名），指鹈鹕属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large water birds commonly called pelicans, known for their long bills and expandable throat pouches (family Pelecanidae).","zh":"鹈鹕属（Pelecanus）：一类大型水鸟的属名，通称“鹈鹕”，以长喙和可伸展的喉囊著称（属鹈鹕科）。"},"examples":[{"en":"The American white pelican belongs to the genus Pelecanus.","zh":"美洲白鹈鹕属于鹈鹕属（Pelecanus）。"},{"en":"In older field guides, some species were listed under Pelecanus with Latin names.","zh":"在较早的野外图鉴里，一些物种会用拉丁学名列在鹈鹕属（Pelecanus）之下。"}]}],"synonyms":["pelican (genus)","pelican"],"phonetic":"/pəˈlɛkənəs/","extraExplanation":["“Pelecanus”是拉丁化的科学名称（属名），在生物分类学中要首字母大写、通常用斜体书写：*Pelecanus*。日常英语里更常用普通名“pelican（鹈鹕）”，而不是直接说“Pelecanus”。"]}
{"word":"pelecoid","summary":{"en":"“Pelecoid” means axe-shaped, especially in biological descriptions (often of leaves).","zh":"“pelecoid”指“斧形的”，多用于生物学/植物学形态描述（常指叶片）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Axe-shaped; having a broad, blade-like part and a narrower base (often used to describe the shape of a leaf or other body part in biology).","zh":"斧形的；形状像斧头（常用于描述植物叶片或生物体某部分：上部较宽像斧刃、基部较窄）。"},"examples":[{"en":"The plant has pelecoid leaves that flare outward near the tip.","zh":"这种植物的叶子呈斧形，靠近叶尖处向外展开。"},{"en":"In the field guide, the species is identified by its pelecoid leaf base.","zh":"在野外图鉴中，这个物种因其斧形的叶基而容易辨认。"}]}],"synonyms":["axe-shaped","hatchet-shaped","securiform","axiform"],"phonetic":"/ˈpɛlɪˌkɔɪd/","extraExplanation":["词源来自希腊语 pelekys（“斧头”）+ -oid（“……形的”）。因此 pelecoid 字面意思就是“像斧头的”。","这是偏学术/专业的形态学用语，在植物学描述里更常见；日常英语中更常用 axe-shaped 或 hatchet-shaped 来表达同样意思。"]}
{"word":"pelecypod","summary":{"en":"A pelecypod is an older term for a bivalve mollusk (clam, mussel, oyster, scallop).","zh":"pelecypod 是“双壳类软体动物”的旧称（如蛤、贻贝、牡蛎、扇贝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bivalve mollusk (such as a clam, mussel, oyster, or scallop) with two hinged shells; an older scientific term for bivalves.","zh":"双壳类软体动物（如蛤、贻贝、牡蛎、扇贝等）；“pelecypod”是较旧的科学用语，指双壳纲动物。"},"examples":[{"en":"Clams and oysters are pelecypods with two shells joined by a hinge.","zh":"蛤和牡蛎都是双壳类（pelecypods），有两片由铰合连接的壳。"},{"en":"The museum label used the word “pelecypod,” but most modern textbooks say “bivalve.”","zh":"博物馆标签用了“pelecypod”，但大多数现代教材会说“bivalve（双壳类）”。"}]}],"synonyms":["bivalve","bivalve mollusk","lamellibranch (older)"],"phonetic":"/pəˈlɛsəˌpɑd/","extraExplanation":["“Pelecypod”主要出现在较早的生物学/古生物学资料中；现在更常用、更通用的说法是“bivalve（双壳类）”。","词源提示：来自希腊语词根，意思大致是“斧形的脚”，因为一些双壳类的“足”用于掘沙时形状像小斧头。"]}
{"word":"pelecypoda","summary":{"en":"Pelecypoda is an older scientific term for bivalve mollusks (Bivalvia), like clams and oysters.","zh":"Pelecypoda 是“双壳类软体动物”（Bivalvia，如蛤蜊、牡蛎等）的旧科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of mollusks with two hinged shells (bivalves), such as clams, oysters, mussels, and scallops; an older scientific name for Bivalvia.","zh":"（旧的科学分类名）瓣鳃纲/双壳纲动物：有两片可铰合外壳的软体动物，如蛤蜊、牡蛎、贻贝、扇贝等。"},"examples":[{"en":"In older biology textbooks, Pelecypoda is used for what we now usually call Bivalvia.","zh":"在较旧的生物学教材中，Pelecypoda 常用来指现在通常称为 Bivalvia（双壳纲）的类群。"},{"en":"Fossil pelecypods can help scientists date sedimentary rocks.","zh":"双壳纲（Pelecypoda）的化石可以帮助科学家为沉积岩定年。"}]}],"synonyms":["Bivalvia","bivalves","Lamellibranchia","lamellibranchs"],"phonetic":"ˌpɛləˈsɪpədə","extraExplanation":["Pelecypoda 来自希腊语词根：pelekys（“斧头”）+ pous/pod-（“脚”），指某些双壳类具有“斧状足”用于掘沙。","现代分类学中更常用 Bivalvia 作为正式类名；Pelecypoda 多见于旧文献或作为同义旧称出现。"]}
{"word":"pelecypodous","summary":{"en":"A scientific adjective meaning “bivalved; related to clams and similar mollusks.”","zh":"科学用形容词，意为“具两片贝壳的；与蛤蜊等双壳类软体动物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pair of shell valves (like a clam); relating to bivalve mollusks.","zh":"（像蛤蜊一样）具有两片贝壳的；与双壳类软体动物有关的。"},"examples":[{"en":"Clams, mussels, and oysters are pelecypodous animals.","zh":"蛤蜊、贻贝和牡蛎都是具两片贝壳的动物（双壳类）。"},{"en":"The fossil layer contained many pelecypodous shells from an ancient shoreline.","zh":"这层化石中含有许多来自古代海岸线的双壳类贝壳。"}]}],"synonyms":["bivalve","bivalved","lamellibranch (older)"],"phonetic":"/ˌpɛləˈsɪpədə́s/","extraExplanation":["“Pelecypodous”较偏学术/古典用法，在现代生物学里更常用的词是“bivalve”（双壳类）。","词根来自希腊语：peleky-（斧头）+ pod-（脚），最初指某些双壳类的“斧形足”（用于挖掘）。"]}
{"word":"pelegrin","summary":{"en":"“Pelegrin” is a rare/archaic word meaning “pilgrim” or “wandering/foreign,” often linked to the modern spelling “peregrine.”","zh":"“Pelegrin”是一个少见/古旧词，可指“朝圣者”，也可形容“漂泊的/异乡的”，常与现代拼写“peregrine”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/rare) a pilgrim; a person who travels, especially for religious reasons.","zh":"（古旧/少见）朝圣者；（尤指为宗教原因而）旅行的人。"},"examples":[{"en":"In old texts, “pelegrin” may refer to a pilgrim on a long journey.","zh":"在一些古文献中，“pelegrin”可能指踏上漫长旅程的朝圣者。"},{"en":"The story follows a pelegrin seeking healing at a distant shrine.","zh":"故事讲述一位“pelegrin”前往远方圣地寻求疗愈。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic/rare) foreign; wandering; traveling from place to place.","zh":"（古旧/少见）异乡的；漂泊的；四处旅行的。"},"examples":[{"en":"He lived a pelegrin life, never staying in one town for long.","zh":"他过着漂泊（pelegrin）的生活，从不在一个城镇久留。"},{"en":"A pelegrin soul, she felt most at home on the road.","zh":"作为一颗漂泊的心，她觉得在路上才最自在。"}]}],"synonyms":["pilgrim","wanderer","traveler","foreign","peregrine"],"phonetic":"ˈpɛləɡrɪn","extraExplanation":["“pelegrin”在现代英语里非常少见，多见于古旧拼写或文学化用法。它通常与拉丁语“peregrinus”（外乡人、旅行者）同源，因此更常见、标准的现代拼写是“peregrine”。","如果你本来想找的是“peregrine falcon”（游隼），常用拼写是“peregrine”，而不是“pelegrin”。"]}
{"word":"pelelith","summary":{"en":"“Pelelith” isn’t a common dictionary word; it’s likely a coined/proper name, possibly meaning a “Pele stone” (Pele + -lith “stone”).","zh":"“pelelith”不是常见词典词；很可能是人造/专有名词，可能表示“佩蕾之石/火山之石”（Pele + -lith“石”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a coined/proper name, so its meaning depends on the context where you saw it.","zh":"不是标准英语单词。它可能是拼写错误或人造/专有名称，因此含义取决于你看到它的语境。"},"examples":[{"en":"I can’t find “pelelith” in major English dictionaries—can you share the sentence you saw it in?","zh":"我在主要英语词典里找不到“pelelith”——你能把它所在的句子发我吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible coined form) A name built from “Pele” (the Hawaiian volcano goddess) + “-lith” (stone), suggesting “Pele stone” or a volcanic stone connected to Pele in a story, brand name, or fantasy setting.","zh":"（可能是人造词）由“Pele”（夏威夷火山女神）+ “-lith”（“石”的词根）构成，可能表示“佩蕾之石/火山之石”，常见于故事设定、品牌名或奇幻作品语境。"},"examples":[{"en":"In the novel, the hero carried a “pelelith,” a stone said to hold the volcano’s fire.","zh":"在小说里，英雄带着一块“pelelith”，据说那石头封存着火山之火。"},{"en":"The artist named the black glass pendant “Pelelith” to evoke volcanic imagery.","zh":"艺术家把黑色玻璃吊坠命名为“Pelelith”，用来唤起火山意象。"}]}],"synonyms":["coined word","proper name","neologism"],"phonetic":"/ˈpeɪliˌlɪθ/","extraExplanation":["“-lith”来源于希腊语 lithos（石头），常见于 geology/biology 相关构词里（如 monolith“独石”、lithography“石版印刷”）。如果“pelelith”出现在矿物、地质或游戏/小说设定中，很可能是借用这个词根来营造“石/岩”的感觉。","如果你其实想查的是相近拼写：perlite（珍珠岩）、paleolith（旧石器时代的；更常见为 Paleolithic），请告诉我你想查哪一个或把原句贴出来，我可以给出准确释义和用法。"]}
{"word":"peleliu","summary":{"en":"Peleliu is an island in Palau, also known for the 1944 World War II Battle of Peleliu.","zh":"Peleliu 指帕劳的贝里琉岛，也常指1944年的二战“贝里琉战役”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small island in Palau (Micronesia) in the western Pacific Ocean, known for its World War II history.","zh":"贝里琉岛：位于西太平洋密克罗尼西亚的帕劳群岛中的一座小岛，以二战历史而闻名。"},"examples":[{"en":"Peleliu is part of the nation of Palau in the western Pacific.","zh":"贝里琉岛是西太平洋帕劳共和国的一部分。"},{"en":"Many visitors go to Peleliu to learn about its history and see the old sites.","zh":"许多游客去贝里琉岛了解历史并参观旧址。"}]},{"partOfSpeech":"n.","definition":{"en":"The Battle of Peleliu (1944), a major World War II battle fought on the island between U.S. and Japanese forces.","zh":"贝里琉战役（1944年）：二战期间在该岛爆发的一场重要战役，交战双方主要为美军与日军。"},"examples":[{"en":"The Battle of Peleliu is often studied in World War II history classes.","zh":"贝里琉战役常在二战历史课程中被研究。"},{"en":"Books and documentaries describe the fighting on Peleliu in 1944.","zh":"许多书籍与纪录片讲述了1944年在贝里琉岛上的战斗。"}]}],"synonyms":["the island of Peleliu","Battle of Peleliu"],"phonetic":"/ˌpɛləˈliːuː/","extraExplanation":["“Peleliu”常被音译为“贝里琉”。它属于帕劳（Palau），在二战太平洋战场中具有标志性意义。","学习用法小提示：谈到地理时可说“the island of Peleliu（贝里琉岛）”；谈到历史事件时常用“the Battle of Peleliu（贝里琉战役）”。"]}
{"word":"pelen","summary":{"en":"“pelen” isn’t a standard English word; it’s usually a misspelling of “pollen” (the powder from flowers/trees that can cause allergies).","zh":"“pelen” 不是标准英语单词；通常是把 “pollen（花粉，常引发过敏）” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most commonly a misspelling of “pollen.”","zh":"不是标准英语单词。最常见的情况是把 “pollen（花粉）” 拼错成了 “pelen”。"},"examples":[{"en":"I think you meant “pollen,” not “pelen.”","zh":"我觉得你想写的是 “pollen（花粉）”，不是 “pelen”。"},{"en":"High pollen levels can make my allergies worse.","zh":"花粉浓度高会让我的过敏更严重。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “pollen”) the fine yellowish powder produced by flowers and trees; it can cause allergies and is used by plants for reproduction.","zh":"（如果你想写的是 “pollen”）花或树产生的细小粉末（花粉）；植物用它繁殖，也常引发过敏。"},"examples":[{"en":"Bees carry pollen from one flower to another.","zh":"蜜蜂把花粉从一朵花带到另一朵花。"},{"en":"There’s pollen all over my car in the spring.","zh":"春天我的车上到处都是花粉。"},{"en":"He takes medicine during pollen season.","zh":"他在花粉季会吃药。"}]}],"synonyms":["(for pollen) flower dust","(for pollen) plant pollen"],"phonetic":"/ˈpɑlən/","extraExplanation":["“pollen”的常见拼写：p-o-l-l-e-n。它的发音是 /ˈpɑlən/，中间是轻读的 “-len”。如果你想表达别的意思（比如人名、地名或其他语言的词），告诉我上下文句子，我可以再帮你确认。"]}
{"word":"peleng","summary":{"en":"Peleng means a (Russian-derived) “bearing,” the measured direction to a target.","zh":"Peleng 指（源自俄语的）“方位/方位角”，即指向目标的测量方向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword, mainly from Russian) A bearing: the direction to an object measured as an angle from a reference direction (often true north, magnetic north, or the direction your vehicle is facing).","zh":"（外来词，主要源自俄语）方位角／方位：从参考方向（通常是真北、磁北或载具航向）测得指向目标的角度。"},"examples":[{"en":"The radar operator reported the target’s peleng as 120 degrees.","zh":"雷达操作员报告目标的方位角为120度。"},{"en":"We took a peleng to the lighthouse to confirm our course.","zh":"我们测了灯塔的方位来确认航向。"}]}],"synonyms":["bearing","azimuth","direction"],"phonetic":"/pəˈlɛŋ/","extraExplanation":["“peleng”常见于俄语/前苏联体系的航海、航空、雷达与军事语境，对应英语更常用的词是 bearing 或 azimuth。","在英语日常交流中几乎不用“peleng”；如果你是在技术资料、旧式设备说明书或俄语背景的文本里看到它，多半就是“方位（角）”的意思。"]}
{"word":"pelerin","summary":{"en":"Pelerin usually means a pilgrim (French loanword), and it can also refer to a short cape (often spelled pelerine).","zh":"pelerin 通常指“朝圣者”（法语借词），也可指“短披风”（更常写作 pelerine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a pilgrim; a person who travels to a holy place for religious reasons.","zh":"（源自法语）朝圣者；为宗教原因前往圣地的人。"},"examples":[{"en":"In medieval stories, a pelerin often traveled long distances to visit a shrine.","zh":"在中世纪故事里，pelerin 常常长途跋涉去拜访圣坛。"},{"en":"She dressed like a pelerin, carrying a small bag and walking staff.","zh":"她打扮得像一位朝圣者，背着小包，拄着手杖。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled pelerine) a short cape or cape-like collar worn over the shoulders.","zh":"（也写作 pelerine）短披风；披在肩上的斗篷式领肩。"},"examples":[{"en":"The costume included a black pelerin over a white dress.","zh":"那套服装包括一件黑色短披风，搭配白色连衣裙。"},{"en":"In old-fashioned portraits, you may see a lace pelerin around the neck and shoulders.","zh":"在一些老式肖像中，你可能会看到蕾丝 pelerin 围在颈部和肩部。"}]}],"synonyms":["pilgrim","traveler","wayfarer","pelerine","cape"],"phonetic":"ˌpɛləˈrɪn","extraExplanation":["“pelerin”来自法语“pèlerin”（朝圣者）。英语里更常见的拼写是“pelerine”（指短披风）以及“pilgrim”（指朝圣者/朝圣之旅的人）。你输入的“pelerin”在英语文本中较少见，多见于借用法语的语境或历史/文学描写。"]}
{"word":"pelerine","summary":{"en":"A pelerine is a short cape worn over the shoulders.","zh":"pelerine 指披在肩上的短斗篷/短披肩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape or small shoulder covering, often worn by women or as part of a uniform or formal outfit","zh":"（常指女装或制服/礼服的一部分）披在肩上的短斗篷、披肩"},"examples":[{"en":"She wore a black pelerine over her dress to keep warm.","zh":"她在连衣裙外披了一件黑色短斗篷保暖。"},{"en":"The choir’s uniform included a white pelerine that covered the shoulders.","zh":"合唱团的制服包括一件覆盖肩部的白色短披肩。"},{"en":"In the museum, you can see a Victorian pelerine made of lace.","zh":"在博物馆里，你可以看到一件维多利亚时期的蕾丝短披肩。"}]}],"synonyms":["cape","short cape","shoulder cape","capelet"],"phonetic":"/ˌpɛləˈrin/","extraExplanation":["“pelerine”源自法语，和“Pèlerine（朝圣者的斗篷）”有关，因此带有“披在肩上的小斗篷/披肩”的历史意象。","在英美语境中它较偏文学、历史服饰或时尚语境；日常口语更常说 cape（斗篷）或 shoulder cape（肩斗篷）。"]}
{"word":"pelerines","summary":{"en":"“Pelerines” means short capes or cape-like collars worn over the shoulders; it’s the plural of “pelerine.”","zh":"“pelerines”指披在肩上的短斗篷或披肩领，是“pelerine”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short cape or cape-like collar worn over the shoulders (often as part of women’s clothing, sometimes used for warmth or style).","zh":"披肩式短斗篷；披肩领（常见于女性服饰，用于保暖或装饰）。"},"examples":[{"en":"In the old photo, the women are wearing pelerines over their dresses.","zh":"在那张老照片里，女士们在连衣裙外披着披肩式短斗篷。"},{"en":"The costume designer added a lace pelerine to give the outfit a Victorian feel.","zh":"服装设计师加了一件蕾丝披肩领，让造型更有维多利亚时代的感觉。"}]}],"synonyms":["capelets","short capes","shoulder capes"],"phonetic":"/ˌpɛləˈrinz/","extraExplanation":["“pelerines”是“pelerine”的复数形式。这个词在现代日常英语里不算常见，更常出现在历史服饰、戏服、文学描写或时装语境中。","词源与法语有关，常被认为与“朝圣者（pilgrim）披风/斗篷”的意象相关，因此带有一点“旅行披风、披肩”的历史气息。"]}
{"word":"peles","summary":{"en":"“Peleș” most commonly refers to Peleș Castle, a well-known royal castle in Romania; “Peles” may also be a surname.","zh":"“Peleș”最常指罗马尼亚的佩莱什城堡；“Peles”也可能是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Peleș (usually in “Peleș Castle”) is a famous royal castle in Romania, located near the town of Sinaia.","zh":"Peleș（常见于“Peleș Castle / 佩莱什城堡”）是罗马尼亚著名的皇家城堡，位于锡纳亚（Sinaia）附近。"},"examples":[{"en":"Peleș Castle is one of the most visited landmarks in Romania.","zh":"佩莱什城堡是罗马尼亚游客最多的地标之一。"},{"en":"They took a day trip from Bucharest to see Peleș.","zh":"他们从布加勒斯特一日游去看佩莱什城堡。"}]},{"partOfSpeech":"n.","definition":{"en":"Peles can also be a family name (surname), depending on the person or context.","zh":"Peles 也可以是姓氏（取决于具体人物或语境）。"},"examples":[{"en":"In the article, Dr. Peles explained the new findings.","zh":"在那篇文章中，Peles 医生解释了新的发现。"}]}],"synonyms":["Peleș Castle","Sinaia"],"phonetic":"/pəˈlɛʃ/","extraExplanation":["“Peleș”里的“ș”是罗马尼亚语字母，发音类似英语“sh”的音，所以常见英文写法会保留重音符号（Peleș）或写成近似拼写（Peles）。","如果你本来想查的是夏威夷火山女神“Pele”（佩蕾），那是另一个词：Pele（不是 Peleș）。你也可以告诉我你看到“peles”的句子，我能帮你判断是哪一个意思。"]}
{"word":"peletre","summary":{"en":"“Peletre” isn’t a recognized English word; it’s likely a misspelling—please share the context.","zh":"“peletre”不是标准英文单词；很可能是拼写错误——请提供语境以便判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of a similar-looking word (for example, “pellet,” “pelter,” or the French surname “Pelletier”).","zh":"不是标准英文单词。很可能是某个相近拼写词的拼写错误（例如 pellet、pelter，或法语姓氏 Pelletier）。"},"examples":[{"en":"I couldn’t find “peletre” in an English dictionary—did you mean “pellet”?","zh":"我在英文词典里找不到“peletre”——你是不是想写“pellet”？"},{"en":"If you tell me the sentence you saw it in, I can help identify the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你判断原本想表达的词。"}]}],"phonetic":"ˈpɛlɪt","extraExplanation":["你可以把它出现的语境（整句/段落）、你想表达的中文意思、以及它是从哪里看到的（作业、歌词、游戏、名字等）发我。我就能更准确地推断它可能是哪个词。\n\n常见可能：\n- pellet /ˈpɛlɪt/：小颗粒；（尤指）饲料颗粒、弹丸\n- pelter：投掷者；（口语/地区用法较少见，也可能指“雨雪猛打”那种感觉）\n- Pelletier：常见法语姓氏（英语里也会见到）"]}
{"word":"peleus","summary":{"en":"Peleus is a figure in Greek mythology, famous as Achilles’ father and Thetis’ husband.","zh":"珀琉斯是希腊神话人物，以阿喀琉斯之父、忒提斯之夫的身份最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the king of Phthia (in Thessaly) and the mortal father of Achilles; husband of the sea-nymph Thetis.","zh":"（希腊神话）珀琉斯：佛提亚（位于色萨利）的国王，凡人出身的阿喀琉斯之父；海洋女神忒提斯的丈夫。"},"examples":[{"en":"Peleus is best known as the father of Achilles in the Trojan War legends.","zh":"珀琉斯最广为人知的身份是特洛伊战争传说中阿喀琉斯的父亲。"},{"en":"The wedding of Peleus and Thetis appears in many later Greek stories and artworks.","zh":"珀琉斯与忒提斯的婚礼在许多后来的希腊故事与艺术作品中都出现过。"}]},{"partOfSpeech":"n.","definition":{"en":"A hero who is sometimes listed among the Argonauts (the crew that sailed with Jason).","zh":"（希腊神话）有时被列为阿尔戈英雄（随伊阿宋航行寻找金羊毛的船员）之一的英雄人物。"},"examples":[{"en":"In some versions of the myth, Peleus joins Jason’s voyage with the Argonauts.","zh":"在某些神话版本中，珀琉斯参加了伊阿宋与阿尔戈英雄的远航。"}]}],"synonyms":["(related) Achilles","(related) Thetis","(related) Argonauts","(related) Phthia"],"phonetic":"ˈpiːliəs","extraExplanation":["“Peleus（珀琉斯）”是专名，常见于《伊利亚特》相关神话背景中；很多英语读者会通过“Achilles（阿喀琉斯）之父”来记住他。","他的婚礼常与“不和女神厄里斯丢下金苹果”这一情节相连（引发“最美者”之争，进而成为特洛伊战争的远因之一），因此在西方文学与艺术里很有名。"]}
{"word":"pelew","summary":{"en":"“Pelew” is an older English name for Palau, often in “the Pelew Islands.”","zh":"“Pelew”是“Palau（帛琉）”的旧称，常见于“the Pelew Islands（帛琉群岛）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical/older English name for Palau (an island country in the western Pacific), also seen in the phrase “the Pelew Islands.”","zh":"帛琉（Palau）的旧称/旧式英语写法，也常见于短语“the Pelew Islands（帛琉群岛）”。"},"examples":[{"en":"Palau was once called the Pelew Islands in older travel writing.","zh":"在较早的游记里，Palau（帛琉）曾被称为 the Pelew Islands（帛琉群岛）。"},{"en":"You may see “Pelew” on old maps of the western Pacific.","zh":"你可能会在西太平洋的旧地图上看到“Pelew”这个写法。"}]}],"synonyms":["Palau","Belau","the Pelew Islands"],"phonetic":"/pəˈluː/","extraExplanation":["“Pelew”多出现在18–19世纪的英文资料、航海记录与旧地图中。现代英语通常使用“Palau”（当地也常写作“Belau”）来指帛琉。","如果你原本想查的是动词短语“peel away（剥落/离开）”或别的拼写，请告诉我上下文（句子/主题），我可以帮你确认。"]}
{"word":"pelf","summary":{"en":"Pelf means money or riches, usually with a negative sense: ill-gotten or morally degrading wealth.","zh":"Pelf 指钱财或财富，通常带贬义，强调不义之财或令人道德堕落的财富。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money or riches, especially when viewed as ill-gotten, petty, or morally corrupting (often used in a negative, literary tone).","zh":"钱财；财富（尤指不义之财、微不足道却令人堕落的财物；常带贬义、偏文学用法）"},"examples":[{"en":"He cared more for honor than for pelf.","zh":"他更看重荣誉，而不是不义之财。"},{"en":"The novel portrays a politician who trades integrity for pelf.","zh":"小说刻画了一位为钱财出卖操守的政客。"},{"en":"She refused to chase pelf at the cost of her values.","zh":"她拒绝为了钱财而牺牲自己的价值观。"}]}],"synonyms":["ill-gotten gains","loot","filthy lucre","booty","spoils"],"phonetic":"/pɛlf/","extraExplanation":["“pelf”是较古老、偏文学的词，在现代日常英语里不常用；作者常用它来表达对“钱财诱惑”或“贪财”的道德批评。","常见搭配有“filthy pelf”（肮脏的不义之财）、“worldly pelf”（世俗钱财）。如果你想更中性地说“财富/金钱”，更常用“money / wealth / riches”。"]}
{"word":"pelfs","summary":{"en":"Pelf (plural: pelfs) means money or wealth, often with the idea that it is dishonest or shameful.","zh":"pelf（复数 pelfs）指钱财/财富，常含“来路不正、可耻之财”的意味，偏文学或较古老用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money or wealth, especially when thought of as gained in a dishonest or shameful way (often used in an old-fashioned/literary style).","zh":"钱财；财富（尤指被认为以不正当或可耻方式获得的钱，常见于较古老或文学语体）。"},"examples":[{"en":"He cared more about power and pelf than about helping people.","zh":"他更在乎权力和不义之财，而不是帮助别人。"},{"en":"The writer criticized those who chased pelf at any cost.","zh":"作者批评那些不惜一切追逐不义之财的人。"}]}],"synonyms":["ill-gotten gains","dirty money","loot","booty","filthy lucre"],"phonetic":"/pɛlf/","extraExplanation":["你输入的“pelfs”通常可理解为名词 pelf 的复数形式（pelfs），但 pelf 这个词本身较少见，偏文学/古风用法。","pelf 往往带有道德评判色彩，强调“钱财/财富”背后可能有贪婪、腐败或不光彩的意味；现代英语里更常用 dirty money、ill-gotten gains、loot 等表达类似含义。"]}
{"word":"pelham","summary":{"en":"Pelham is most commonly a surname or a place name (several towns in North America), and it can also refer to the novel Pelham (1828).","zh":"Pelham 最常见为英文姓氏或地名（北美多地名），也可指 1828 年小说《Pelham》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin.","zh":"佩勒姆（英语姓氏）"},"examples":[{"en":"My professor’s last name is Pelham.","zh":"我教授的姓是 Pelham。"},{"en":"Pelham wrote a short article for the local newspaper.","zh":"Pelham 给当地报纸写了一篇短文。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns/areas, especially in the U.S. and Canada (e.g., Pelham in New York, Alabama, and Ontario).","zh":"佩勒姆（地名；美国和加拿大多地使用，如纽约州、阿拉巴马州、安大略省等）"},"examples":[{"en":"They moved to Pelham, New York, for work.","zh":"他们为了工作搬到了纽约州的 Pelham。"},{"en":"The train stops at Pelham before going downtown.","zh":"火车在到市中心前会在 Pelham 停靠。"}]},{"partOfSpeech":"n.","definition":{"en":"the title/name of a well-known 19th-century novel, Pelham (1828), by Edward Bulwer-Lytton.","zh":"《Pelham》（小说名；1828 年爱德华·布尔沃—利顿所著）"},"examples":[{"en":"In class, we discussed Bulwer-Lytton’s Pelham.","zh":"课堂上我们讨论了布尔沃—利顿的《Pelham》。"}]}],"phonetic":"/ˈpɛləm/","extraExplanation":["“Pelham”常见于英语世界的人名与地名。作为地名时，最好在口语或写作中加上州/省或国家来避免混淆（如 Pelham, NY / Pelham, Ontario）。","读音上常见的美式读法是重音在第一音节：PEL-ham（第二音节弱读成 /əm/）。"]}
{"word":"pelias","summary":{"en":"Pelias is a king in Greek mythology, known for sending Jason after the Golden Fleece.","zh":"Pelias（珀利阿斯）是希腊神话中的国王，以派杰森去寻金羊毛而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the king of Iolcus who seized the throne from Aeson and later sent Jason to retrieve the Golden Fleece; he is ultimately killed through Medea’s trick.","zh":"（希腊神话）伊俄尔科斯（Iolcus）的国王，篡夺了埃宋（Aeson）的王位，后来派遣杰森（Jason）去寻找金羊毛；最终因美狄亚（Medea）的计策而身亡。"},"examples":[{"en":"Pelias promised to give up the throne if Jason brought back the Golden Fleece.","zh":"珀利阿斯答应如果杰森带回金羊毛，就交出王位。"},{"en":"In many versions of the myth, Medea’s deception leads to Pelias’s death.","zh":"在许多神话版本中，美狄亚的欺骗导致珀利阿斯丧命。"},{"en":"Pelias is often portrayed as a fearful ruler trying to avoid a prophecy.","zh":"珀利阿斯常被描写成一个因害怕预言而处处设防的统治者。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/ˈpiːliəs/","extraExplanation":["“Pelias”是专有名词，常见于古希腊神话与文学改写作品中；读到时通常不翻译其含义，而是音译为“珀利阿斯/珀利亚斯”。","他与“金羊毛（Golden Fleece）”“阿尔戈英雄（Argonauts）”“杰森（Jason）”这组故事紧密相关：珀利阿斯为了摆脱威胁，把危险任务转嫁给杰森。","发音提示：英语里常读作三音节“PEE-lee-uhs”，重音在第一个音节。"]}
{"word":"pelican","summary":{"en":"A pelican is a large water bird with a long bill and a throat pouch used for catching fish.","zh":"pelican 指“鹈鹕”，一种嘴长、喉部有囊袋、常捕鱼的大型水鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large water bird with a long bill and a throat pouch, often seen near oceans, lakes, and rivers; it catches fish and sometimes works in groups","zh":"鹈鹕；一种大型水鸟，嘴很长，喉部有可伸缩的囊袋，常见于海边、湖泊和河流附近，以捕鱼为主，有时会群体合作"},"examples":[{"en":"We saw a pelican gliding over the ocean near the pier.","zh":"我们在码头附近看到一只鹈鹕掠过海面滑翔。"},{"en":"The pelican scooped up a fish and held it in its throat pouch.","zh":"那只鹈鹕舀起一条鱼，把它暂时放在喉囊里。"},{"en":"In some places, pelicans fish together in a line to herd fish into shallow water.","zh":"在一些地方，鹈鹕会排成一列合作捕鱼，把鱼群赶到浅水区。"}]}],"synonyms":["water bird","seabird"],"phonetic":"/ˈpɛlɪkən/","extraExplanation":["“pelican”常用于自然纪录片、海岸文化描写中。在艺术与宗教象征里，鹈鹕有时被用来象征“自我牺牲/养育”（源于中世纪的传说与图像传统），但现代英语里日常用法主要还是指这种鸟。"]}
{"word":"pelicanry","summary":{"en":"Pelicanry means either a group of pelicans or a place where pelicans live or are kept.","zh":"Pelicanry 指“鹈鹕群”，也可指“鹈鹕栖息/繁殖地或饲养区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of pelicans; pelicans considered collectively.","zh":"鹈鹕群；（统称）鹈鹕。"},"examples":[{"en":"A pelicanry circled above the bay before settling on the sandbar.","zh":"一群鹈鹕在海湾上空盘旋，随后落在沙洲上。"},{"en":"The wetland is home to a large pelicanry during migration season.","zh":"迁徙季节，这片湿地栖息着大量鹈鹕群。"}]},{"partOfSpeech":"n.","definition":{"en":"A place where pelicans live or are kept, such as a breeding colony or an enclosure in a zoo.","zh":"鹈鹕栖息地／繁殖地；（动物园等的）鹈鹕饲养区。"},"examples":[{"en":"Researchers monitored the pelicanry to track nesting success.","zh":"研究人员监测鹈鹕繁殖地，以追踪筑巢成功率。"},{"en":"At the zoo, visitors stopped by the pelicanry to watch feeding time.","zh":"在动物园里，游客会在鹈鹕饲养区停留观看喂食。"}]}],"synonyms":["pelican colony","colony","rookery","breeding colony","enclosure"],"phonetic":"/ˈpɛlɪkənri/","extraExplanation":["“pelicanry”由“pelican（鹈鹕）+ -ry”构成；后缀“-ry”常用来表示“群体”或“场所”（如 rookery 指“海鸟或海豹的繁殖地/群栖地”）。因此它既可指“鹈鹕群”，也可指“鹈鹕的栖息/繁殖地”。","这是较少见、带一点“自然观察/文学描写”色彩的词；日常口语中更常说 “a group of pelicans” 或 “pelican colony”。"]}
{"word":"pelicans","summary":{"en":"“Pelicans” usually means the birds (plural of pelican), and it can also refer to the NBA team New Orleans Pelicans.","zh":"“Pelicans”通常指“鹈鹕”（pelican 的复数），也可指 NBA 的新奥尔良鹈鹕队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large water birds with a long bill and a throat pouch for catching and holding fish (plural of “pelican”)","zh":"鹈鹕（大型水鸟，嘴很长，喉部有囊用来捕鱼并暂时存放；“pelican”的复数）"},"examples":[{"en":"Pelicans often glide low over the ocean and then dive to catch fish.","zh":"鹈鹕常常贴着海面低飞，然后俯冲捕鱼。"},{"en":"We watched a line of pelicans flying in a V-shape along the coast.","zh":"我们看到一排鹈鹕沿着海岸以“V”字队形飞行。"},{"en":"Please don’t feed pelicans human food—it can harm them.","zh":"请不要给鹈鹕喂人类的食物——这可能会伤害它们。"}]},{"partOfSpeech":"n.","definition":{"en":"the New Orleans Pelicans, a professional basketball team in the NBA","zh":"（专有名词）新奥尔良鹈鹕队（NBA职业篮球队）"},"examples":[{"en":"The Pelicans play their home games in New Orleans.","zh":"鹈鹕队在新奥尔良进行主场比赛。"},{"en":"She bought Pelicans tickets for the weekend.","zh":"她买了周末鹈鹕队的比赛门票。"}]}],"synonyms":["water birds","seabirds"],"phonetic":"/ˈpɛlɪkənz/","extraExplanation":["“pelican”在英语里既可以指真实的鸟，也常出现在地名、校徽、队名等象征用法中，通常带有“沿海、与水有关”的联想。","读法小提示：复数 -s 发 /z/ 音，所以 “pelicans” 结尾听起来像 “-kənz”。"]}
{"word":"pelick","summary":{"en":"“Pelick” is not a common dictionary word; it’s usually a surname or a misspelling.","zh":"“pelick”不是常见词典词汇，通常是姓氏或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in modern English; most often seen as a family name (surname) or a misspelling of another word.","zh":"在现代英语中很少见或不属于标准词汇；最常见的用法是作为姓氏，或是其他单词的拼写错误。"},"examples":[{"en":"Ms. Pelick will lead the meeting today.","zh":"Pelick 女士今天将主持会议。"},{"en":"I couldn’t find “pelick” in the dictionary—maybe it’s a name or a typo.","zh":"我在词典里找不到“pelick”——可能是名字或拼写错误。"}]}],"phonetic":"/ˈpɛlɪk/","extraExplanation":["“pelick”不太像常见英文单词，更可能是：①人名/姓氏；②把其他词拼错了。你可以检查你想表达的是不是这些更常见的词：pelican（鹈鹕）、pellet（小球/颗粒）、pellicle（薄膜/薄皮）、public（公共的，常见拼写错误之一）。","如果你把原句（上下文）发我，我可以根据语境判断最可能的正确拼写与含义。"]}
{"word":"pelicometer","summary":{"en":"“Pelicometer” is not a recognized English word; it is probably a misspelling or mishearing of a real “-meter” term.","zh":"“pelicometer”不是规范英语词，更可能是某个以“-meter/仪表”结尾词的误拼或听错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a misheard term (often intended to mean a kind of measuring device ending in “-meter”).","zh":"不是标准英语词。很可能是拼写错误或听错的词（通常本意是以“-meter/仪表”结尾的某种测量工具）。"},"examples":[{"en":"I couldn’t find “pelicometer” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“pelicometer”——你能把它出现的句子发我看看吗？"},{"en":"It may be a misspelling of a real instrument name ending in “-meter.”","zh":"它可能是某个真实仪器名称（以“-meter/仪表”结尾）的误拼。"}]}],"phonetic":"/ˌpɛlɪˈkɑmɪtɚ/","extraExplanation":["从构词看，-meter 通常表示“测量仪/计量器”，比如 thermometer（温度计）、barometer（气压计）、speedometer（速度表）。但 “pelico-” 不是常见英语前缀，所以更像是拼写或听写错误。","如果你是从口头听到的，可能接近的词包括：pelvimeter（骨盆测量器，医学/产科用）、psychrometer（干湿计，用于测湿度）、perimeter（周长/周边；也可指测周长的工具）。具体要看上下文。","把它所在的句子、领域（医学/工程/摄影/实验室等）或一张照片发来，我可以帮你定位它最可能对应的正确词。"]}
{"word":"pelides","summary":{"en":"Pelides is a poetic name for Achilles, meaning “son of Peleus.”","zh":"Pelides 是阿喀琉斯的诗性别称，意为“珀琉斯之子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literary) An epithet meaning “son of Peleus,” used to refer to Achilles in Greek epic poetry (especially Homer’s *Iliad*).","zh":"（文学用语）“珀琉斯之子”的称号，用来指代阿喀琉斯，常见于希腊史诗（尤指荷马《伊利亚特》）。"},"examples":[{"en":"In Homer, “Pelides” is another name for Achilles, highlighting his father Peleus.","zh":"在荷马作品中，“Pelides”是阿喀琉斯的别称，强调他是珀琉斯之子。"},{"en":"The poet invokes Pelides to stress Achilles’ heroic lineage.","zh":"诗人用“Pelides”来强调阿喀琉斯的英雄血统。"}]}],"synonyms":["Achilles","son of Peleus","Peleian"],"phonetic":"/pəˈliːdiːz/","extraExplanation":["“Pelides”常见的更标准拼写是 **Peleides**（也可见 **Peleïdes**），来自希腊语词形，意思就是“珀琉斯（Peleus）的儿子”。这种用父名来称呼英雄的方式叫“父名式称号”（patronymic epithet），在古希腊史诗里很常见。","它多出现在较文学化、古典化的英语译本或诗歌模仿中；日常英语里一般直接说 **Achilles**。如果你在阅读《伊利亚特》英译本，看到“Pelides”通常就是在说阿喀琉斯。"]}
{"word":"pelidnota","summary":{"en":"Pelidnota: a genus of shiny scarab beetles, mainly in the Americas.","zh":"Pelidnota：主要分布在美洲的一类有金属光泽的金龟子科甲虫属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shiny scarab beetles (family Scarabaeidae), found mainly in the Americas; some species are called “golden scarabs” and may feed on leaves or fruit.","zh":"一种金龟子科（Scarabaeidae）的甲虫属，外形常有金属光泽，主要分布于美洲；其中一些种常被称为“金色圣甲虫”，可能取食叶片或果实。"},"examples":[{"en":"Researchers recorded several Pelidnota beetles visiting ripe fruit in the orchard.","zh":"研究人员记录到果园里有几只 Pelidnota 属的甲虫在取食成熟的水果。"},{"en":"This field guide notes that Pelidnota species can be brightly colored and reflective.","zh":"这本野外图鉴提到，Pelidnota 属的一些物种颜色鲜艳、表面有反光。"}]}],"synonyms":["scarab beetle (general)","golden scarab (common name for some species)"],"phonetic":"/ˌpɛlɪdˈnoʊtə/","extraExplanation":["Pelidnota 是生物分类学中的“属名”（genus name），通常在学术写作中首字母大写并用斜体：*Pelidnota*；具体物种会写成“属名 + 种加词”，例如 *Pelidnota* sp.（表示未确定的某个物种）。","在日常英语里它不算常见词，更多出现在昆虫学、自然观察、博物馆标本标签或科研论文中。"]}
{"word":"pelikai","summary":{"en":"“Pelikai” is not standard English; it likely refers to “pelicans” (e.g., in Lithuanian) or is a misspelling of “pelican(s).”","zh":"“pelikai”不是标准英语；它可能指“鹈鹕（复数）”（如立陶宛语用法），或是“pelican(s)”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a foreign-language form (for example, Lithuanian “pelikai,” meaning “pelicans”).","zh":"不是标准英语单词。它很可能是拼写错误或外语形式（例如立陶宛语“pelikai”，意思是“鹈鹕（复数）”）。"},"examples":[{"en":"“Pelikai” is not common in English; you may mean “pelican” or “pelicans.”","zh":"“pelikai”在英语里不常见；你可能想写的是“pelican（鹈鹕）”或“pelicans（鹈鹕们）”。"},{"en":"In Lithuanian, “pelikai” can mean “pelicans.”","zh":"在立陶宛语中，“pelikai”可以表示“鹈鹕（复数）”。"}]}],"synonyms":["pelicans","pelican"],"phonetic":"/pɛˈliːkaɪ/","extraExplanation":["如果你是在学英语：正确的英语单词通常是 pelican（单数）/ pelicans（复数）。","如果你告诉我你看到“pelikai”的语境（哪篇文章/哪种语言/一句完整的话），我也可以帮你确认它的准确含义与用法。"]}
{"word":"pelike","summary":{"en":"A pelike is an ancient Greek two-handled jar used for storing liquids, often seen in museums and archaeology.","zh":"pelike 指一种古希腊双耳陶罐，用于盛放液体，常见于博物馆与考古语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ancient Greek pottery jar (similar to an amphora) with a rounded belly and two handles, often used to store liquids like wine or oil","zh":"一种古希腊陶罐（类似双耳瓶），腹部较圆、两侧有把手，常用于盛放酒或油等液体"},"examples":[{"en":"The museum displayed a red-figure pelike decorated with scenes from Greek mythology.","zh":"博物馆展出了一只红绘式的 pelike，上面装饰着希腊神话场景。"},{"en":"Archaeologists found a pelike in a tomb, suggesting it once held oil for rituals.","zh":"考古学家在墓葬中发现了一只 pelike，暗示它曾盛放用于仪式的油。"}]}],"synonyms":["amphora","jar","vase"],"phonetic":"/ˈpɛlɪˌkeɪ/","extraExplanation":["“pelike”源自希腊语 *pēlikē*。在艺术史和考古语境中更常见，日常英语里不常用。","pelike 常与“amphora（双耳瓶）”对比：两者都有双耳，但 pelike 的腹部更圆、形体更“鼓”。","在古希腊陶器分类中，常会看到“black-figure（黑绘）”与“red-figure（红绘）”等术语来描述 pelike 上的绘画风格。"]}
{"word":"peliom","summary":{"en":"Pelion is a mountain in Greece, and it appears in the literary idiom “pile Ossa on Pelion,” meaning to heap one difficulty on top of another.","zh":"Pelion 是希腊的一座山；它也出现在习语“pile Ossa on Pelion”中，表示在困难上不断叠加困难、层层加码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pelion (often written “Mount Pelion”): a mountain in Thessaly, Greece, known from Greek mythology and ancient literature.","zh":"Pelion（常写作“Mount Pelion”）：希腊色萨利地区的一座山，在希腊神话与古代文学中很有名。"},"examples":[{"en":"In Greek mythology, the centaur Chiron was said to live on Mount Pelion.","zh":"在希腊神话中，半人马喀戎（Chiron）据说住在佩利翁山（Mount Pelion）。"},{"en":"The essay references Pelion to evoke the world of ancient Greece.","zh":"这篇文章提到 Pelion，是为了唤起古希腊的意象。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the idiom “pile Ossa on Pelion”: to add more and more to something (often an already difficult situation), creating an overwhelming whole.","zh":"在习语“pile Ossa on Pelion”中：指不断叠加、层层加码（常指在本就棘手的事情上继续增加），使之变得难以承受。"},"examples":[{"en":"By adding new rules every week, the manager piled Ossa on Pelion for the team.","zh":"经理每周都加新规定，等于让团队雪上加霜、层层加码。"},{"en":"Don’t pile Ossa on Pelion—fix the main problem first.","zh":"别一味加码——先把主要问题解决掉。"}]}],"phonetic":"/ˈpiːliən/","extraExplanation":["你输入的“peliom”很可能是拼写错误；英语里更常见的是“Pelion”（结尾是 -n），指希腊的佩利翁山。","“pile Ossa on Pelion”出自希腊神话中巨人试图把奥萨山（Ossa）堆到佩利翁山（Pelion）上、再去攻上奥林匹斯山的故事，所以这个表达带有“堆叠到夸张程度”的意味；属于较文学化/典故型用法，日常口语里不算高频。"]}
{"word":"pelioma","summary":{"en":"A rare condition with many blood-filled cavities in an organ, especially the liver (related to “peliosis”).","zh":"一种罕见病变：器官（尤其肝脏）内出现多发充血、血液充满的小腔隙（与 peliosis 相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical condition in which many small, blood-filled cavities form inside an organ (most often the liver); also called *peliosis* (especially *peliosis hepatis*).","zh":"（医学）佩利奥玛：一种罕见疾病，某些器官（最常见为肝脏）内出现许多充满血液的小腔隙；常与 *peliosis*（尤指 *peliosis hepatis* 肝紫癜样病变）相关或互用。"},"examples":[{"en":"The CT scan suggested pelioma of the liver, so the doctor ordered further tests.","zh":"CT 扫描提示可能存在肝脏的 pelioma，因此医生安排了进一步检查。"},{"en":"In the case report, pelioma was associated with long-term medication use.","zh":"在该病例报告中，pelioma 与长期用药有关。"}]}],"synonyms":["peliosis","peliosis hepatis"],"phonetic":"/ˌpɛliˈoʊmə/","extraExplanation":["这是非常专业、偏医学的词，日常英语里几乎不会出现；你更常看到的是 *peliosis* 或 *peliosis hepatis*（指肝脏内出现多发、充血的腔隙）。","词源来自希腊语 *pelios*，有“青紫、暗紫”的含义，和病变中“血液淤积/充血”的外观有关。","学习时可把它理解为“器官里出现许多血液囊腔/血窦样空腔”的描述性名词；若你是在论文或影像报告里遇到它，通常需要结合具体器官（如 liver）来理解。"]}
{"word":"peliosis","summary":{"en":"Peliosis is a rare condition where blood-filled spaces form inside an organ, especially the liver.","zh":"Peliosis指器官内形成充满血液的小空腔的罕见病变，尤其常见于肝脏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical condition in which many small, blood-filled cyst-like spaces form in an organ (most often the liver).","zh":"一种罕见的医学状况，指器官内形成许多充满血液的小囊样空腔（最常见于肝脏）。"},"examples":[{"en":"Peliosis is most commonly discussed in connection with the liver, where it is called peliosis hepatis.","zh":"Peliosis最常见于肝脏，被称为“肝脏血窦扩张/血窦样空腔形成”（peliosis hepatis）。"},{"en":"The scan raised concern for peliosis, so the doctor ordered more tests to look for a cause.","zh":"影像检查提示可能是peliosis，因此医生安排了进一步检查以寻找病因。"}]}],"synonyms":["peliosis hepatis (specific type)","blood-filled cystic spaces (descriptive)"],"phonetic":"/ˌpɛliˈoʊsɪs/","extraExplanation":["“Peliosis”主要用于医学语境，来自希腊语词根，含义与“呈紫/带血色的改变”相关，常用来描述组织内出现血液充盈的空腔。","临床上常见搭配是“peliosis hepatis（肝脏peliosis）”。它有时与某些药物（如合成代谢类固醇、口服避孕药等）、慢性感染或免疫相关情况有关，但具体诊断与处理应由医生根据病史与检查综合判断。"]}
{"word":"pelisse","summary":{"en":"A pelisse is a historical women’s cloak or coat, often fur-lined, popular in the 18th–19th centuries.","zh":"pelisse 指一种历史上的女士披风或外套，常带毛皮内衬，流行于18—19世纪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman’s outer garment (a cloak or coat), often fur-lined, worn especially in the 18th–19th centuries.","zh":"（尤指18—19世纪）女士穿的外衣（披风或外套），常带毛皮内衬。"},"examples":[{"en":"In the period drama, she steps out in a velvet pelisse trimmed with fur.","zh":"在那部年代剧里，她穿着一件天鹅绒的 pelisse，边缘还镶着毛皮出门。"},{"en":"The museum displayed a pelisse beside other Regency-era clothing.","zh":"博物馆把一件 pelisse 与其他摄政时期的服饰一起陈列。"}]}],"synonyms":["cloak","cape","mantle","coat"],"phonetic":"/pəˈlis/","extraExplanation":["pelisse 来自法语，历史上常见于欧洲上流社会的时尚语境。你可能在“Regency（摄政时期）”“Napoleonic（拿破仑时期）”相关的小说、影视或服饰展览中遇到这个词。","在简·奥斯汀风格的时代背景作品里，pelisse 往往不只是保暖衣物，也暗示人物的阶层、审美与场合（外出、拜访、旅行等）。"]}
{"word":"pelisses","summary":{"en":"Pelisses are women’s long coats/cloaks from late 18th–19th century fashion (plural of pelisse).","zh":"pelisses 是 pelisse 的复数，指18世纪末至19世纪流行的女性长外套/披风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pelisse: a woman’s long coat or cloak (often fur-trimmed), especially fashionable in Europe in the late 1700s–1800s.","zh":"pelisse 的复数：一种女性长外套或披风（常带毛皮镶边），尤指18世纪末至19世纪在欧洲流行的款式。"},"examples":[{"en":"In the museum portrait, the woman wears one of the velvet pelisses popular in the early 1800s.","zh":"在那幅博物馆肖像中，这位女士穿着一件19世纪初流行的天鹅绒 pelisse（长外套）。"},{"en":"The novel describes travelers wrapping themselves in warm pelisses during winter journeys.","zh":"小说描写旅人们在冬季旅途中裹着保暖的 pelisse（长外套）。"}]}],"synonyms":["cloaks","capes","coats","mantles"],"phonetic":"/pəˈlis/","extraExplanation":["“pelisse”源自法语，原意与“毛皮”有关；在历史语境中常见于英国与欧洲的时尚描写、文学作品与博物馆服装说明。","在简·奥斯汀等“摄政时期（Regency）”相关的叙述里，类似外套常用来表现人物的阶层、季节与场合（外出、旅行、社交）。现代英语中更常在历史/复古时尚语境里看到这个词。"]}
{"word":"pelite","summary":{"en":"Pelite is a geology term for very fine-grained muddy sediment or the rock made from it; it can also be used as an adjective meaning “muddy/fine-grained.”","zh":"Pelite 是地质学用语，指由黏土和粉砂等极细颗粒组成的泥质沉积物或其形成的岩石；也可作形容词表示“泥质的/细粒的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very fine-grained sedimentary rock or sediment made mostly of clay- and silt-sized particles (mud).","zh":"（地质）泥质岩；以黏土和粉砂粒级为主、颗粒非常细的沉积物或沉积岩（本质上就是“泥”形成的岩/沉积物）。"},"examples":[{"en":"The lower layers contain pelite with thin sandy bands.","zh":"下部地层以泥质岩为主，夹有薄层砂质条带。"},{"en":"Fossils are rare in pelite because the sediment is so fine and compacted.","zh":"在泥质岩中化石较少见，因为沉积物非常细且压实。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or made of pelite; muddy and very fine-grained (used in geology).","zh":"（地质）泥质的；由泥质岩构成的；极细粒的（多用于地层/岩性描述）。"},"examples":[{"en":"They mapped a pelite unit between two sandstone beds.","zh":"他们在两层砂岩之间测绘到一个泥质岩地层单元。"},{"en":"Pelite-rich sequences often indicate low-energy water conditions.","zh":"富含泥质岩的地层序列常暗示低能量的水动力环境。"}]}],"synonyms":["mudstone","claystone","siltstone (sometimes, depending on grain size)","argillaceous rock"],"phonetic":"ˈpiːlaɪt","extraExplanation":["“pelite”来自希腊语词根 *pelos*（意为“泥”），因此它常被当作“泥质/细粒沉积物”的统称。在地质报告里，pelite 往往用于更学术或分类性的表达，日常更常说 mudstone（泥岩）或 claystone（黏土岩）。"]}
{"word":"pelites","summary":{"en":"Pelites are fine-grained, mud-rich rocks (sedimentary or metamorphosed from mud) commonly discussed in geology.","zh":"Pelites 指地质学中的“细粒、富泥质”的岩石（可为沉积岩，或由泥质沉积物变质而成的岩石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fine-grained sedimentary rocks made mostly of clay- and silt-sized particles (for example, mudstone or shale).","zh":"（地质）细粒沉积岩，主要由黏土和粉砂级颗粒组成（如泥岩、页岩）。"},"examples":[{"en":"The outcrop contains pelites interbedded with sandstone layers.","zh":"这处露头里有细粒岩（pelites）与砂岩层互层出现。"},{"en":"Many fossils are best preserved in pelites because the grains are so fine.","zh":"由于颗粒非常细，化石常常在细粒岩（pelites）中保存得更好。"}]},{"partOfSpeech":"n.","definition":{"en":"In metamorphic geology, rocks derived from clay-rich sediments (often called pelitic rocks) that can produce minerals like garnet or mica when metamorphosed.","zh":"（变质地质）由富黏土沉积物变质形成的岩石（常称“泥质岩/泥质变质岩”），变质后可能产生石榴子石、云母等矿物。"},"examples":[{"en":"The pelites show increasing mica content toward the higher-grade zone.","zh":"这些泥质岩（pelites）在更高变质级别的带内云母含量更高。"},{"en":"Geologists sampled pelites to study pressure–temperature conditions during metamorphism.","zh":"地质学家采集泥质岩（pelites）来研究变质作用的温压条件。"}]}],"synonyms":["mudstone","shale","pelitic rocks"],"phonetic":"/ˈpɛˌlaɪts/","extraExplanation":["“pelite”源自希腊语词根 *pelos*（意为“泥”）。在地质文章里它常作为集合性术语，泛指“泥质、细粒”的岩石类型；具体到分类时，常会进一步用 mudstone（泥岩）、shale（页岩）、siltstone（粉砂岩）等更精确的名称。","“pelites”是复数形式；单数是 “pelite”。在学术写作里也常见形容词 “pelitic”（泥质的），如 pelitic schist（泥质片岩）。"]}
{"word":"pelitic","summary":{"en":"Pelitic means clay-rich or made of very fine mud-sized sediment, mainly used in geology.","zh":"Pelitic 指“泥质/黏土质的”，主要用于地质学，描述富含黏土或极细粒沉积物的物质或岩石。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Made of or rich in clay; describing very fine-grained sediment (mud-sized particles) and rocks formed from it.","zh":"（地质）含黏土的；富含黏土的；用于描述由极细粒沉积物（泥质颗粒）组成的沉积物或由其形成的岩石。"},"examples":[{"en":"Pelitic sediments are typically deposited in calm water, such as lakes or deep marine settings.","zh":"泥质（pelitic）沉积物通常沉积在较平静的水环境中，例如湖泊或深海环境。"},{"en":"The outcrop shows a pelitic layer overlain by coarser sandstone.","zh":"这处露头显示一层泥质（pelitic）地层，其上覆盖着更粗的砂岩。"},{"en":"In metamorphic rocks, pelitic protoliths often produce mica-rich schist.","zh":"在变质岩中，泥质（pelitic）的原岩常常会形成富含云母的片岩。"}]}],"synonyms":["clayey","mud-rich","argillaceous"],"phonetic":"/pəˈlɪtɪk/","extraExplanation":["“pelitic”来自希腊语词根，和“泥/黏土”有关，因此在地质学里常用来概括“泥质、黏土质”的成分或岩性。","它多见于学术或野外记录中，用来与较粗颗粒的术语（如 sandy 砂质、gravelly 砾质）形成对比。"]}
{"word":"pell","summary":{"en":"Pell is an old word for a wooden stake/post, and it can also mean a training post for medieval weapon practice.","zh":"Pell 是较古旧的词，指木桩/木柱；也可指中世纪武器训练用的练习桩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wooden stake or post, often used to mark a boundary or to form a fence (old-fashioned).","zh":"木桩；木柱（常用于标示边界或做篱笆，较古旧用法）。"},"examples":[{"en":"In old records, the land was described as ending at a line of pells.","zh":"在旧档案中，这块土地被描述为止于一排木桩所标示的边界。"},{"en":"They repaired the fence by replacing a broken pell.","zh":"他们更换了一根断掉的木桩来修理篱笆。"}]},{"partOfSpeech":"n.","definition":{"en":"a practice post used for training with weapons (especially in medieval contexts).","zh":"（尤指中世纪）武器训练用的练习桩。"},"examples":[{"en":"A knight practiced sword strikes on a pell to build strength and accuracy.","zh":"骑士在练习桩上练剑，以增强力量与准确度。"},{"en":"The museum displayed a reconstructed pell used for medieval training.","zh":"博物馆展示了复原的中世纪训练用练习桩。"}]}],"synonyms":["stake","post","fence post","training post"],"phonetic":"/pɛl/","extraExplanation":["“pell”在现代英语中很少单独使用，多见于历史/文学语境或中古武术训练的描述。日常英语里更常用的是“stake / post / fence post / training dummy”等。","注意别和常见词“spell”（拼写；咒语）混淆；两者发音不同，且“pell”属于较古旧词。"]}
{"word":"pellaea","summary":{"en":"Pellaea is a scientific genus name for cliffbrake ferns.","zh":"Pellaea 是“铁角蕨属”的学名，指一类常见的岩生铁角蕨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of ferns (family Pteridaceae), commonly called cliffbrakes; many species grow on rocky, dry places.","zh":"铁角蕨属（凤尾蕨科）的一属蕨类植物，英文常称“cliffbrakes（岩生铁角蕨）”；许多种类常生长在岩石、较干燥的环境中。"},"examples":[{"en":"Pellaea species often grow in rock crevices where there is little soil.","zh":"铁角蕨属的植物常常生长在土壤很少的岩石缝里。"},{"en":"The botanist identified the fern as a Pellaea by its small, tough leaflets.","zh":"植物学家根据它细小而坚韧的小叶片把这株蕨类鉴定为铁角蕨属（Pellaea）。"}]}],"synonyms":["cliffbrake (fern)"],"phonetic":"/pəˈliːə/","extraExplanation":["“Pellaea”是植物学中的拉丁化属名，多用于学术写作与植物名录中；日常英语里更常用的称呼是“cliffbrake (fern)”或直接说“a cliffbrake fern”。","词源一般认为与希腊语有关，常被解释为与“暗色/灰暗（dark-colored）”相关，用来描述某些种类叶片或鳞片较深的颜色；不同资料对词源细节可能略有出入。"]}
{"word":"pellage","summary":{"en":"Pellage is a rare noun meaning a historical payment or tax in animal pelts, and sometimes the fur/hair covering of an animal.","zh":"pellage 是个罕见名词，主要指历史上用兽皮缴纳的租税/费用；有时也指动物的皮毛覆盖层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, rare) A payment, rent, or tax made with animal skins or furs (pelts), or a charge connected to pelts.","zh":"（历史用语，罕见）用动物皮毛（皮张）缴纳的租金/税款，或与皮张相关的费用。"},"examples":[{"en":"In some medieval records, tenants paid their dues in grain, labor, or pellage.","zh":"在一些中世纪记录中，佃户可以用谷物、劳役或“皮张税/皮张租”（pellage）来缴纳应付款。"},{"en":"The account lists wool, hides, and pellage collected that year.","zh":"账目中列出了当年收取的羊毛、兽皮以及“皮张相关的税费”（pellage）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The coat of hair or fur on an animal; fur covering.","zh":"（罕见）动物身上的毛皮；皮毛覆盖层。"},"examples":[{"en":"Winter pellage is often thicker to help animals stay warm.","zh":"冬季的皮毛（pellage）通常更厚，以帮助动物保暖。"}]}],"synonyms":["pelt tax","payment in kind","fur (for the animal-coat sense)"],"phonetic":"/ˈpɛlɪdʒ/","extraExplanation":["这个词非常少见，多出现在历史文献或专门写作中。它和更常见的词根“pell-”（皮）有关，同源词包括 pelt（皮张/兽皮）、pellicle（薄膜/薄皮层）等。","如果你想表达“动物的毛皮”，现代英语更常用 fur（毛皮）或 coat（被毛）；若表达“以物抵税/缴租”，通常会写 pay in kind（以实物支付）。"]}
{"word":"pellagra","summary":{"en":"Pellagra is an illness caused by niacin (vitamin B3) deficiency, often involving sun-sensitive dermatitis, diarrhea, and mental changes.","zh":"糙皮病是由烟酸（维生素B3）缺乏引起的疾病，常见症状包括对日晒敏感的皮炎/皮疹、腹泻和精神/认知改变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease caused mainly by a lack of niacin (vitamin B3) or the amino acid tryptophan, often marked by rough inflamed skin (especially after sun exposure), diarrhea, and mental changes.","zh":"糙皮病（常因缺乏烟酸/维生素B3或色氨酸引起），常见表现包括日晒后皮肤粗糙发炎、腹泻以及精神/神经方面的变化。"},"examples":[{"en":"Pellagra can develop when a person’s diet lacks enough niacin.","zh":"当饮食中烟酸摄入不足时，可能会发生糙皮病。"},{"en":"Doctors suspected pellagra after noticing a sun-exposed rash along with diarrhea.","zh":"医生在看到日晒部位皮疹并伴随腹泻后，怀疑是糙皮病。"},{"en":"With proper nutrition and treatment, pellagra is usually preventable and treatable.","zh":"通过合理营养与治疗，糙皮病通常可以预防并治疗。"}]}],"synonyms":["niacin-deficiency disease","vitamin B3 deficiency (condition)"],"phonetic":"/pəˈlæɡrə/","extraExplanation":["糙皮病在历史上曾在以玉米为主食、但饮食结构单一的人群中更常见，因为未经“碱化处理”（如传统玉米用石灰水处理的做法）时，玉米中的烟酸不易被人体吸收。后来人们认识到其与烟酸缺乏有关，推广营养改善后，发病率大幅下降。","常用记忆点是“三D”（英文常见概括）：Dermatitis（皮炎/皮疹）、Diarrhea（腹泻）、Dementia（精神/认知改变）；若不治疗，严重时可危及生命。"]}
{"word":"pellagragenic","summary":{"en":"“Pellagragenic” means “able to cause pellagra,” usually describing diets or conditions that lead to niacin deficiency.","zh":"“pellagragenic”指“会引起糙皮病的”，常用来描述导致烟酸（维生素B3）缺乏的饮食或条件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing pellagra (a disease linked to niacin/vitamin B3 deficiency).","zh":"致糙皮病的；会引起糙皮病的（糙皮病常与烟酸/维生素B3缺乏有关）。"},"examples":[{"en":"A pellagragenic diet lacks enough niacin or tryptophan.","zh":"致糙皮病的饮食通常缺乏足够的烟酸或色氨酸。"},{"en":"Researchers studied pellagragenic food patterns in poor rural communities.","zh":"研究人员调查了贫困农村社区中可能致糙皮病的饮食模式。"}]}],"synonyms":["pellagra-causing","niacin-deficiency–inducing"],"phonetic":"/ˌpɛləɡrəˈdʒɛnɪk/","extraExplanation":["“Pellagragenic”常见于医学与营养学文章，尤其用来描述“以玉米为主、蛋白质与烟酸不足”的饮食结构。传统上如果玉米未经过碱化处理（如石灰水/碱水处理的制粉方式），其中的烟酸更难被人体吸收，因此在某些历史与地区背景下更容易出现糙皮病。","糙皮病经典症状常被概括为“3D”：皮炎（dermatitis）、腹泻（diarrhea）、痴呆/精神神经症状（dementia）；严重时可致命。该词强调的是“诱因/致病因素”，而不是疾病本身。"]}
{"word":"pellagras","summary":{"en":"“Pellagras” means multiple cases of pellagra, a niacin-deficiency disease.","zh":"“pellagras”指多例糙皮病（由烟酸/维生素B3缺乏引起的疾病）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pellagra: a serious disease caused by long-term lack of niacin (vitamin B3) or the amino acid tryptophan, often linked historically to diets relying heavily on untreated corn (maize). Typical signs are skin rash (especially after sun exposure), diarrhea, and mental changes.","zh":"pellagra（糙皮病）的复数：一种因长期缺乏烟酸（维生素B3）或色氨酸而导致的严重疾病。历史上常与长期以未处理的玉米为主食有关。典型表现包括皮疹（常在日晒后加重）、腹泻以及精神/神经方面的异常。"},"examples":[{"en":"In early public-health records, doctors described outbreaks of pellagras in poor farming communities.","zh":"在早期公共卫生记录中，医生描述了贫困农耕社区中糙皮病（pellagras）的暴发。"},{"en":"Programs that improved diets and added niacin greatly reduced cases of pellagras.","zh":"改善饮食并补充烟酸的项目大幅降低了糙皮病（pellagras）的病例数。"}]}],"synonyms":["pellagra cases","niacin-deficiency cases"],"phonetic":"/pəˈlæɡrəz/","extraExplanation":["“pellagra”一词源自意大利语，意为“粗糙的皮肤”，对应其常见症状之一（皮炎/皮疹）。","历史上，在一些地区由于主食高度依赖玉米且未经过碱处理（如用石灰水处理的做法），烟酸难以被人体吸收，更容易出现糙皮病。现代营养强化与饮食多样化后已较少见，但在营养不良风险较高的人群中仍可能发生。"]}
{"word":"pellagric","summary":{"en":"“Pellagric” means “related to pellagra,” especially in medical descriptions.","zh":"“pellagric”意为“与糙皮病有关的”，多用于医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pellagra (a disease caused mainly by a lack of niacin/vitamin B3).","zh":"与糙皮病有关的；糙皮病的（主要因缺乏烟酸/维生素B3引起的疾病）。"},"examples":[{"en":"The doctor noted pellagric skin changes on the patient’s hands after long sun exposure.","zh":"医生在患者长时间日晒后，注意到其手部出现与糙皮病相关的皮肤改变。"},{"en":"The clinic investigated pellagric symptoms in communities with limited dietary variety.","zh":"诊所调查了饮食种类有限的社区中出现的糙皮病相关症状。"}]}],"synonyms":["pellagra-related","of pellagra","pellagrous (less common)"],"phonetic":"/ˌpɛləˈɡrɪk/","extraExplanation":["“pellagric”来自“pellagra（糙皮病）”。糙皮病常用“四个D”来帮助记忆典型表现：dermatitis（皮炎/皮肤炎，常见于日晒部位）、diarrhea（腹泻）、dementia（精神/神经症状）、death（严重时可致命）。现代医学中多通过补充烟酸（维生素B3）并改善饮食来治疗与预防。","历史上，糙皮病曾在以玉米为主食、且缺少适当处理方式（如碱化处理）或蛋白质来源不足的地区更常见；如今在营养不良或吸收障碍等情况下仍可能出现相关病例。"]}
{"word":"pellagrin","summary":{"en":"Pellagrin means a person with pellagra, or something related to pellagra.","zh":"pellagrin 指“糙皮病患者”，也可作形容词表示“与糙皮病有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has pellagra (a disease caused mainly by severe niacin/vitamin B3 deficiency).","zh":"糙皮病患者（糙皮病主要由严重的烟酸/维生素B3缺乏引起）。"},"examples":[{"en":"The clinic treated several pellagrins who had been living on a very limited diet.","zh":"诊所治疗了几位因长期饮食非常单一而患糙皮病的患者。"},{"en":"In early reports, pellagrins often showed skin problems after strong sun exposure.","zh":"在早期报告中，糙皮病患者常在强烈日晒后出现皮肤问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of pellagra.","zh":"与糙皮病有关的；糙皮病的。"},"examples":[{"en":"Doctors looked for pellagrin symptoms such as dermatitis and diarrhea.","zh":"医生留意糙皮病相关症状，如皮炎和腹泻。"},{"en":"The article discussed pellagrin outbreaks linked to poor nutrition.","zh":"这篇文章讨论了与营养不良相关的糙皮病暴发。"}]}],"synonyms":["pellagrous","pellagra-related","pellagra patient"],"phonetic":"/ˈpɛləɡrɪn/","extraExplanation":["“pellagrin”比较少见，更常见的形容词是“pellagrous”，名词上也常直接说“a patient with pellagra / a pellagra patient（糙皮病患者）”。","“pellagra”一词源自意大利语，和“粗糙的皮肤”有关；历史上在以玉米为主、但缺乏足够烟酸来源或处理方式不当的地区更常见。"]}
{"word":"pellagroid","summary":{"en":"Pellagroid means “pellagra-like,” usually describing symptoms (especially a rash) that resemble pellagra.","zh":"pellagroid 意为“类糙皮病的/糙皮病样的”，常用于描述（尤其是皮疹等）看起来像糙皮病的症状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or related to pellagra (a disease caused by lack of niacin/vitamin B3, often showing dermatitis, diarrhea, and dementia).","zh":"类糙皮病的；与糙皮病有关的（糙皮病常因缺乏烟酸/维生素B3引起，常见症状为皮炎、腹泻与精神/认知问题）。"},"examples":[{"en":"The doctor noted a pellagroid rash on the patient’s sun-exposed skin.","zh":"医生注意到病人在日晒部位出现了类糙皮病样的皮疹。"},{"en":"In severe malnutrition, pellagroid skin changes can appear along with other deficiencies.","zh":"在严重营养不良时，可能会出现类糙皮病样的皮肤改变，并伴随其他缺乏症。"}]}],"synonyms":["pellagra-like","pellagra-associated","pellagrous (related term)"],"phonetic":"/ˈpɛləˌɡrɔɪd/","extraExplanation":["“pellagroid”多用于医学语境，描述“看起来像糙皮病”的症状或皮疹，但不一定表示已经确诊糙皮病。医生可能用它来表达“外观相似、需要进一步检查/鉴别诊断”。","词源上由“pellagra（糙皮病）+ -oid（……样的）”构成；-oid 是英语里常见的后缀，意思是“像……的、类似……的”（如：humanoid“类人的”）。"]}
{"word":"pellagrose","summary":{"en":"Pellagrose means “related to or affected by pellagra (niacin/B3 deficiency disease).”","zh":"pellagrose 意为“与糙皮病（烟酸/维生素B3缺乏所致疾病）有关的；患糙皮病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, affected by, or characteristic of pellagra (a disease usually caused by severe niacin/vitamin B3 deficiency).","zh":"与糙皮病（通常由严重缺乏烟酸/维生素B3引起的疾病）有关的；患有糙皮病的；具有糙皮病特征的。"},"examples":[{"en":"The doctor noted a pellagrose rash on the patient’s sun-exposed skin.","zh":"医生注意到病人暴露在阳光下的皮肤出现了糙皮病样皮疹。"},{"en":"In older reports, pellagrose symptoms were linked to poor diets based mainly on corn.","zh":"在较早的报告中，糙皮病样症状常与主要以玉米为主的贫乏饮食有关。"}]}],"synonyms":["pellagrous"],"phonetic":"/ˌpɛləˈɡroʊs/","extraExplanation":["“pellagrose”是较少见的形容词形式，更常见的说法是“pellagrous”。两者意思相同：都表示“与糙皮病有关/患糙皮病的”。","词源与意大利语有关：pellagra可追溯到意大利语pelle（皮肤）+ agra（粗糙），指该病典型的皮肤粗糙、日晒部位皮疹等表现。","糙皮病经典描述常提到“3D”：dermatitis（皮炎/皮疹）、diarrhea（腹泻）、dementia（神经精神症状），严重时可致死。现代营养与食物强化让它在许多地区更少见，但在营养不良或特殊吸收问题时仍可能出现。"]}
{"word":"pellagrous","summary":{"en":"Pellagrous means “related to or suffering from pellagra,” a niacin (vitamin B3) deficiency disease.","zh":"pellagrous 指“与糙皮病有关的/患有糙皮病的”；糙皮病源于烟酸（维生素B3）严重缺乏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affected by pellagra (a disease caused by severe niacin/Vitamin B3 deficiency).","zh":"与糙皮病（由于严重缺乏烟酸/维生素B3导致的疾病）有关的；患有糙皮病的。"},"examples":[{"en":"The doctor recognized the patient’s pellagrous skin changes and ordered nutritional tests.","zh":"医生识别出患者糙皮病样的皮肤改变，并安排了营养相关检查。"},{"en":"In the clinic, pellagrous symptoms were linked to long-term poor diet.","zh":"在诊所里，糙皮病样症状与长期饮食不良有关。"}]}],"synonyms":["pellagra-related","niacin-deficiency-related"],"phonetic":"pəˈlæɡrəs","extraExplanation":["“pellagrous”来自疾病名“pellagra”。糙皮病常被概括为“3D”：dermatitis（皮炎）、diarrhea（腹泻）、dementia（痴呆）；若不治疗可进一步恶化。","历史上在一些以玉米为主食、但缺乏足够蛋白质与烟酸来源的地区更常见；后来随着营养学发展与食品强化（例如补充烟酸），发病率显著下降。","这个词偏医学/学术用语，日常英语中更常直接说“pellagra”或描述具体症状（如“niacin deficiency”）。"]}
{"word":"pellar","summary":{"en":"“Pellar” isn’t standard English; it’s usually a misspelling of “pillar” (a supporting column or a key supporter).","zh":"“pellar”不是标准英语；通常是“pillar”的拼写错误（支撑的柱子或关键支柱）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “pillar.” A “pillar” is a tall vertical structure that supports a building, or a person/thing that gives strong support to something important.","zh":"（非标准拼写）很可能是“pillar”的拼写错误。“pillar”指支撑建筑的柱子，也可指对某个重要事物提供强大支持的人或事物。"},"examples":[{"en":"This looks like a misspelling—did you mean “pillar”?","zh":"这看起来像拼写错误——你是想写“pillar”吗？"},{"en":"The bridge rests on several pillars.","zh":"这座桥由几根柱子支撑。"},{"en":"She is a pillar of the community.","zh":"她是社区的中流砥柱。"}]}],"synonyms":["pillar","column","support","mainstay"],"phonetic":"/ˈpɪlər/","extraExplanation":["“pellar”在现代英语里不是常见标准词。学习和写作中更常见的是“pillar”。如果你想表达“柱子/支柱/中流砥柱”，用“pillar”最自然。","“pillar”也常出现在固定搭配中：the four pillars（四大支柱/四大支柱原则），pillar of society（社会名流/社会支柱，语气有时带讽刺）。"]}
{"word":"pellard","summary":{"en":"“Pellard” is mainly used as a surname (a proper name) in English, not a common vocabulary word.","zh":"“Pellard”主要作为英文中的姓氏/专有名词使用，并非常见词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); not a common everyday English word.","zh":"（姓氏）Pellard：人名/姓；不是常见的英文词汇。"},"examples":[{"en":"Dr. Pellard published a paper on language documentation.","zh":"Pellard 博士发表了一篇关于语言记录的论文。"},{"en":"I met someone named Pellard at the conference.","zh":"我在会议上认识了一个姓 Pellard 的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a person or family named Pellard (used like an adjective in some contexts).","zh":"与名为/姓为 Pellard 的人或家族有关的（在某些语境中作形容词用）。"},"examples":[{"en":"The Pellard family archives were donated to the library.","zh":"Pellard 家族档案被捐赠给了图书馆。"},{"en":"They discussed Pellard genealogy in the local history group.","zh":"他们在地方历史小组里讨论了 Pellard 家族谱系。"}]}],"phonetic":"/ˈpɛlɑrd/","extraExplanation":["“Pellard”更常见于法语背景的人名/姓氏，在英语里通常作为专有名词出现，因此一般不当作普通词汇来查释义。","如果你是在某篇文章、小说或字幕里看到它，最可靠的理解方式是：把它当作人名（姓）或地名的一部分，结合上下文判断指代对象。"]}
{"word":"pellas","summary":{"en":"“Pellas” is uncommon in English; it can mean the plural of “pella” (small lumps), or appear in Spanish slang “hacer pellas” meaning “skip class / play hooky.”","zh":"“pellas”在英语中不常见：可作“pella”的复数（小团块），也常见于西班牙语俚语“hacer pellas”，意思是“逃课/翘课”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Plural of “pella”: a small lump or ball-shaped mass (for example, a clod, pellet, or compact piece of something).","zh":"（罕见）“pella”的复数：一小团/一小球状的块状物（如土块、小团块、压成团的东西）。"},"examples":[{"en":"The mixture formed little pellas when it wasn’t stirred enough.","zh":"搅拌不够时，混合物会结成一小团一小团的块。"},{"en":"Mud pellas stuck to the soles of his shoes.","zh":"泥巴小团块黏在他的鞋底上。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Spanish slang, mainly Spain) Used in the phrase “hacer pellas”: to skip class; to play hooky.","zh":"（西班牙俚语，主要在西班牙）常见于短语“hacer pellas”：逃课；翘课。"},"examples":[{"en":"They decided to hacer pellas and go to the beach.","zh":"他们决定翘课去海边。"},{"en":"In English, you can say “skip class” or “play hooky.”","zh":"英语里可以说“skip class”（逃课）或“play hooky”（翘课）。"}]}],"synonyms":["lumps","clumps","pellets","skip class","play hooky","cut class"],"phonetic":"/ˈpɛlɑs/","extraExplanation":["“pellas”本身在英语里不是常见词；如果你是在英语语境中看到它，可能是专有名词（姓氏/地名/品牌）或从西班牙语借用的表达（尤其是“hacer pellas”）。","如果你能提供一句原文（你在哪里看到“pellas”），我可以更准确判断它在该语境中的意思和最自然的英文对应说法。"]}
{"word":"pellate","summary":{"en":"Pellate means to make something into pellets (or to become pellet-like), mainly in technical/industrial contexts.","zh":"pellate 指把材料制成颗粒（或变成颗粒状），多用于技术/工业语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to form (a material) into small, rounded pellets; to compress into pellets","zh":"把（材料）制成小颗粒；压制成颗粒"},"examples":[{"en":"The factory pellates animal feed so it is easier to store and ship.","zh":"工厂把动物饲料制成颗粒，这样更方便储存和运输。"},{"en":"Some machines pellate plastic waste for recycling.","zh":"一些机器会把塑料废料压制成颗粒以便回收。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become formed into pellets","zh":"变成颗粒状；颗粒化"},"examples":[{"en":"When heated and mixed, the powder can pellate and flow more smoothly.","zh":"加热并混合后，粉末可能会颗粒化，流动更顺畅。"}]}],"synonyms":["pelletize","granulate","compress into pellets"],"phonetic":"/pəˈleɪt/","extraExplanation":["“pellate”在日常英语中很少见，更常见的是名词/动词“pellet”（颗粒；制成颗粒）或形容词“pelleted”（颗粒状的），尤其在饲料、塑料回收、制药等工业语境里。","学习时可把它理解为更技术化/更书面一点的“to pellet”（制成颗粒）。"]}
{"word":"pellation","summary":{"en":"“Pellation” is a rare/archaic word meaning a name or title (like “appellation”), or the act of calling someone by a name.","zh":"“Pellation”是罕见/古旧用法，意为“称谓、名称”（类似 appellation），也可指“用某个名字称呼某人”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A name or title used to identify someone or something; an appellation.","zh":"（罕见/古旧）用于指称某人或某物的名字或称号；称谓。"},"examples":[{"en":"In old documents, a person’s pellation could include a family name and an honorific.","zh":"在旧文献中，一个人的 pellation 可能包括姓氏和敬称。"},{"en":"The town changed its pellation after the revolution.","zh":"那座城镇在革命后更改了称谓（名称）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of calling, addressing, or referring to someone by a particular name.","zh":"（罕见）用某个名字称呼或指称某人的行为。"},"examples":[{"en":"His pellation of the teacher as “sir” showed respect.","zh":"他称老师为“先生”体现了尊重。"}]}],"synonyms":["appellation","name","title","designation","term"],"phonetic":"/pəˈleɪʃən/","extraExplanation":["“pellation”在现代英语中非常少见，多数情况下人们真正想写的是更常用的 **appellation**（称谓、名称）。如果你是在阅读旧书、法律/历史文本时见到“pellation”，通常可按“称谓/名称”来理解。"]}
{"word":"pellekar","summary":{"en":"“pellekar” isn’t a recognized English word; it’s likely a name or a misspelling.","zh":"“pellekar”不是常见英语词；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “pellekar” is most likely a proper name (surname/username) or a misspelling of another word.","zh":"不是标准英语单词。“pellekar”更可能是专有名词（姓氏/用户名等）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “pellekar” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“pellekar”——它会不会是名字或者拼写错误？"},{"en":"If you meant a different word, please share the sentence where you saw “pellekar.”","zh":"如果你想查的是另一个词，请把你看到“pellekar”的句子发给我。"}]}],"phonetic":"ˈpɛləkɑr","extraExplanation":["从拼写来看，它可能是某个姓氏/用户名（如社交平台ID）、地名，或是非英语词（例如斯堪的纳维亚语等）的转写。","也可能是拼写误差：你可以检查是否想输入类似的形式（例如以 pell- 开头的单词），或把上下文句子发来，我可以据语境帮你判断最可能的目标词。"]}
{"word":"peller","summary":{"en":"“Peller” is most often an informal, uncommon short form of “propeller,” and it can also be a surname.","zh":"“Peller”多见于对“propeller（螺旋桨）”的非正式缩略用法，也可作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, rare) A shortened form of “propeller” (the rotating blades that push an aircraft or boat forward).","zh":"（非正式、较少见）“propeller（螺旋桨）”的缩略说法，指飞机或船上旋转推动前进的桨叶。"},"examples":[{"en":"The pilot checked the peller before takeoff.","zh":"飞行员在起飞前检查了螺旋桨（peller）。"},{"en":"That old fishing boat still runs on a single peller.","zh":"那艘旧渔船仍然靠一个螺旋桨推进。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name (surname).","zh":"（专有名词）姓氏：Peller。"},"examples":[{"en":"Dr. Peller will see you now.","zh":"Peller 医生现在可以见你。"}]}],"synonyms":["propeller","prop"],"phonetic":"/ˈpɛlər/","extraExplanation":["“peller”本身不是常见的标准英文单词；在真实语境里更常见的是“propeller”，口语里也常说“prop（螺旋桨/推进器）”。如果你是在技术、航海或航空文本中看到“peller”，很可能是非正式缩写、方言用法或个别人的写法。正式写作建议用“propeller”。"]}
{"word":"pellere","summary":{"en":"Pellere is a Latin verb meaning “to drive/push,” and it is the root behind many English words like expel, repel, and compel.","zh":"Pellere 是拉丁语动词，意为“驱赶/推动”，是 expel、repel、compel 等许多英语词的词源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, infinitive) to drive, push, or force (someone or something) away or forward; to propel.","zh":"（拉丁语，不定式）驱赶、推动；迫使（某人/某物）离开或向前；推进。"},"examples":[{"en":"In Latin, pellere can mean “to drive someone out,” which is the root idea behind English expel.","zh":"在拉丁语中，pellere 可表示“把某人赶出去”，这也是英语 expel 的核心含义来源。"},{"en":"Many English words with -pel- (like repel and compel) come from the Latin verb pellere.","zh":"许多带有 -pel- 的英语词（如 repel、compel）都源自拉丁语动词 pellere。"}]}],"synonyms":["drive","push","propel","force out","expel"],"phonetic":"/pɛˈlɛr.eɪ/","extraExplanation":["pellere 是拉丁语第三变位动词（不定式）。它在英语里不作为常用词出现，但常作为词源被提到，用来解释 -pel-/-puls- 词根的意义（“推、驱、赶”）。","常见派生关系：pellere（推/驱）→ pulsum（其过去分词相关形式，常见于词根 -puls-）。因此英语里会出现 propel（向前推）、impel（驱使）、repel（击退）、expel（驱逐）、compel（强迫）、propulsion（推进力）等。","学习提示：看到 -pel- 往往联想到“推/驱使”；看到 -puls- 往往联想到“被推的结果/推动”（如 impulse 冲动、repulsive 令人反感的=“把人推开/排斥人的”）。"]}
{"word":"pellet","summary":{"en":"A pellet is a small hard piece (like a little ball), often used for animal food, fuel, or materials.","zh":"Pellet 指坚硬的小颗粒（像小丸子），常用于饲料、燃料或材料等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, hard, round piece of something (often used as food for animals, fuel, or medicine)","zh":"（常指饲料、燃料或药物的）小颗粒；丸状小块"},"examples":[{"en":"The rabbits eat food pellets every morning.","zh":"兔子每天早上吃颗粒饲料。"},{"en":"We heat the house with wood pellets in the winter.","zh":"我们冬天用木质颗粒燃料给房子供暖。"}]},{"partOfSpeech":"v.","definition":{"en":"to form something into small pellets or feed with pellets","zh":"制成小颗粒；用颗粒（饲料）喂"},"examples":[{"en":"The factory pellets recycled plastic for reuse.","zh":"工厂把回收塑料制成颗粒以便再利用。"},{"en":"The fish are pellet-fed on this farm.","zh":"这个养殖场的鱼是用颗粒饲料喂养的。"}]}],"synonyms":["grain","bead","granule","tablet","capsule"],"phonetic":"/ˈpɛlɪt/","extraExplanation":["“pellet”常见于三类语境：①饲料（animal feed pellets），②燃料（wood pellets / pellet stove），③药物或工业材料（medicine pellets / plastic pellets）。听到它时，可以先判断是哪一种“用途型的小颗粒”。","在日常英语里，fuel pellet（燃料颗粒）与“pellet stove（颗粒炉）”经常一起出现；这在北美一些寒冷地区较常见。"]}
{"word":"pelletal","summary":{"en":"Pelletal means “pellet-like” or “made of pellets,” used mostly in technical descriptions.","zh":"pelletal 指“像颗粒一样的/由颗粒构成的”，多用于技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, shaped like, or made up of small round pieces (pellets).","zh":"与“颗粒（pellet）”有关的；呈颗粒状的；由小颗粒构成的。"},"examples":[{"en":"The fertilizer has a pelletal form, so it spreads evenly in the field.","zh":"这种肥料是颗粒状的，所以在田里撒得更均匀。"},{"en":"Scientists described a pelletal texture in the sample under the microscope.","zh":"科学家在显微镜下描述了样品呈颗粒状结构。"}]}],"synonyms":["pellet-like","granular","pelleted","pelletized"],"phonetic":"/pəˈlɛtəl/","extraExplanation":["“pelletal”来自“pellet（小丸；颗粒）+ -al（……的）”。在日常英语中更常见的说法是“pellet-like（像颗粒一样的）”或“pelleted / pelletized（制成颗粒的）”。","它多见于技术或学术语境（如材料、地质、冶金、生物样品描述等），用来强调“颗粒状/由颗粒组成”的形态特征。"]}
{"word":"pelleted","summary":{"en":"Pelleted means “made into pellets,” or “turned into pellet form.”","zh":"pelleted表示“被制成颗粒的”，也可指“被颗粒化/压制成颗粒”的动作（过去式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Made into small, round or cylindrical pieces called pellets (often for feed, fuel, or fertilizer).","zh":"（形容词）被制成小颗粒（颗粒状/圆柱小粒）的；常指饲料、燃料或肥料等的颗粒化形式。"},"examples":[{"en":"Pelleted feed is easier to store and measure than loose grain.","zh":"颗粒饲料比散装谷物更容易储存和计量。"},{"en":"We use pelleted fertilizer for a slow, steady release of nutrients.","zh":"我们使用颗粒肥料，让养分缓慢、稳定释放。"}]},{"partOfSpeech":"v.","definition":{"en":"(v., past) Formed or pressed something into pellets; turned into pellet form.","zh":"（动词过去式）把……制成颗粒；压制成颗粒状。"},"examples":[{"en":"The factory pelleted the material to improve shipping efficiency.","zh":"工厂把材料制成颗粒，以提高运输效率。"},{"en":"The dust was pelleted into uniform pieces for easier handling.","zh":"粉尘被压制成大小一致的颗粒，便于操作。"}]}],"synonyms":["granulated","compressed","formed","processed"],"phonetic":"/ˈpɛlətɪd/","extraExplanation":["“Pelleted”常见于农业与工业语境：如pelleted feed（颗粒饲料）、wood pellets（木屑颗粒燃料）、pelleted fertilizer（颗粒肥）。把粉末或松散材料压成颗粒，通常是为了便于运输、减少粉尘、提高储存稳定性或控制释放速度。"]}
{"word":"pelletierine","summary":{"en":"Pelletierine is an alkaloid from pomegranate bark, historically used to expel tapeworms.","zh":"Pelletierine 是一种来自石榴树皮的生物碱，历史上曾用于驱除绦虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alkaloid found especially in pomegranate (Punica granatum) bark, formerly used as a medicine to expel tapeworms (an anthelmintic).","zh":"一种生物碱，主要存在于石榴（Punica granatum）的树皮中，过去曾用作驱除绦虫的药物（驱虫剂）。"},"examples":[{"en":"In older medical texts, pelletierine is mentioned as a treatment for tapeworm infection.","zh":"在较早的医学文献中，pelletierine 常被提到用于治疗绦虫感染。"},{"en":"Researchers isolated pelletierine from pomegranate bark to study its effects on parasites.","zh":"研究人员从石榴树皮中分离出 pelletierine，以研究它对寄生虫的作用。"}]}],"synonyms":["pomegranate alkaloid","anthelmintic (historical use)"],"phonetic":"/pəˌliːtiːəˈriːn/","extraExplanation":["Pelletierine 是从石榴树皮中提取/鉴定的一类生物碱名称，现代临床上已较少使用；阅读历史医学或药物化学资料时更常见。","词名来自人名（Pelletier），属于“以科学家/研究者命名的化学物质”这一常见命名方式。","在现代语境中提到该词，往往是在讨论天然产物、药物史或寄生虫学；实际用药与安全性应以当代医学指南为准。"]}
{"word":"pelleting","summary":{"en":"Pelleting means making material into small pellets; it can also describe pellets (or hail) striking something.","zh":"Pelleting 指把材料加工成小颗粒（制粒）；也可指小颗粒（或冰雹）击打某物的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming a material into small, compact balls or cylinders called pellets (often in manufacturing, animal feed, or biomass fuel).","zh":"将材料压制或加工成小而紧实的颗粒（颗粒状或小圆柱状）的过程（常见于制造业、饲料或生物质燃料）。"},"examples":[{"en":"Pelleting improves the handling and storage of animal feed.","zh":"制粒（pelleting）能改善动物饲料的搬运和储存。"},{"en":"The factory uses pelleting to turn recycled plastic into uniform pellets.","zh":"工厂用制粒把回收塑料做成大小一致的塑料颗粒。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “pellet”: to form something into pellets, or (less commonly) to hit something with small pellets.","zh":"“pellet”的现在分词：把某物制成颗粒；（较少见）用小颗粒击打某物。"},"examples":[{"en":"They are pelleting the wood waste to make fuel pellets.","zh":"他们正在把木材废料制成颗粒，用来做燃料颗粒。"},{"en":"Hail was pelleting the roof all night.","zh":"冰雹整夜噼里啪啦地砸在屋顶上。"}]}],"synonyms":["pelletizing","granulating","forming into pellets","compacting"],"phonetic":"/ˈpɛlətɪŋ/","extraExplanation":["“Pelleting”在工程与农业语境里非常常见，尤其指“制粒/制丸”的工艺：把粉末或碎料在压力、热量和/或黏结剂作用下压成更规则、更密实的颗粒，便于运输、计量、燃烧或饲喂。","日常英语里更常用动词“to pellet”（或更常见的搭配如“make pellets / pelletize”）。在工业文件中，“pelleting”（名词）经常用来指整个流程。"]}
{"word":"pelletization","summary":{"en":"Pelletization is the process of turning material (often powder or small particles) into small, uniform pellets.","zh":"Pelletization 指把粉末或细小颗粒材料加工成大小较一致的小颗粒（颗粒状 pellet）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of forming a material into small pellets (often by compressing, rolling, or binding fine particles).","zh":"将材料制成小颗粒（颗粒状“pellet”）的过程，常通过压制、滚动或加入黏结剂把粉末/细粒团聚成颗粒。"},"examples":[{"en":"Pelletization improves the handling and transport of fine powders.","zh":"造粒可以改善粉末的搬运和运输。"},{"en":"The factory uses pelletization to turn biomass into uniform fuel pellets.","zh":"工厂通过造粒把生物质制成规格统一的燃料颗粒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Industrial/engineering) A specific manufacturing step used in fields such as metallurgy, fertilizer production, plastics, pharmaceuticals, and animal feed to make size-consistent pellets for better flow, dosing, or performance.","zh":"（工业/工程）在冶金、化肥、塑料、制药、饲料等领域中的一道工序，用于制造粒径一致的颗粒，以改善流动性、计量精度或使用性能。"},"examples":[{"en":"In ironmaking, pelletization helps convert iron ore fines into usable pellets.","zh":"在炼铁中，造粒把铁矿粉变成可用的球团。"},{"en":"Pelletization can reduce dust and make storage safer.","zh":"造粒能减少粉尘，使储存更安全。"}]}],"synonyms":["granulation","pelleting","agglomeration"],"phonetic":"/ˌpɛl.ə.taɪˈzeɪ.ʃən/","extraExplanation":["“Pelletization”多见于技术/工业语境，比日常英语更正式。常与iron ore pelletization（铁矿球团造粒）、biomass pelletization（生物质造粒）、fertilizer pelletization（化肥造粒）等搭配使用。","常见近义表达：granulation（造粒/制粒，范围更广）、pelleting（制成颗粒的动作/工艺，偏口语或工艺名）。在制药里granulation更常见；在燃料、饲料、矿业里pelletization/pelleting更常见。"]}
{"word":"pelletize","summary":{"en":"Pelletize means to make something into small pellets, usually for easier handling, storage, or processing.","zh":"Pelletize 指把材料加工成小颗粒，通常为了更便于处理、储存或进一步加工。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to form a material into small, round pellets (often by pressing, rolling, or using a machine)","zh":"将材料制成小而圆的颗粒（常通过压制、滚制或机器加工）"},"examples":[{"en":"The factory pelletizes animal feed so it’s easier to store and ship.","zh":"工厂把动物饲料制成颗粒，这样更容易储存和运输。"},{"en":"Some companies pelletize recycled plastic before melting it into new products.","zh":"有些公司会先把回收塑料制成颗粒，再熔融做成新产品。"}]}],"synonyms":["granulate","compress into pellets","form into pellets"],"phonetic":"/ˈpɛləˌtaɪz/","extraExplanation":["“pelletize”多用于工业与制造领域（饲料、木屑燃料、塑料、矿石等）。颗粒化的好处通常是：更均匀、流动性更好、计量更方便、减少粉尘、运输和储存更省空间。","拼写上，美式英语常见“pelletize”，英式英语也常见“pelletise”。词根来自“pellet”（小丸、小颗粒）+ “-ize”（使……化/使成为）。"]}
{"word":"pelletized","summary":{"en":"Pelletized means made into small compact pellets, or the process of turning a material into pellets.","zh":"Pelletized 指“被制成小而紧实的颗粒的”，也可指“把材料制成颗粒”的过程/结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material) formed into small, compact pellets, often to make it easier to handle, store, or use.","zh":"（材料）被制成小而紧实的颗粒（粒状物）的，通常为了便于搬运、储存或使用。"},"examples":[{"en":"The farm uses pelletized fertilizer to reduce dust and make spreading easier.","zh":"农场使用颗粒化肥来减少粉尘，并让撒施更方便。"},{"en":"Pelletized animal feed is easier to measure and less messy than loose grain.","zh":"颗粒饲料更容易计量，也比散装谷物更干净不易洒落。"}]},{"partOfSpeech":"v.","definition":{"en":"to form (a substance) into pellets; to compress or process into small rounded pieces.","zh":"将（物质）制成颗粒；压制或加工成小的圆粒状。"},"examples":[{"en":"They pelletized the biomass so it could be burned more efficiently in the boiler.","zh":"他们将生物质制成颗粒，以便在锅炉中更高效地燃烧。"},{"en":"The company pelletized recycled plastic for easier shipping and remolding.","zh":"公司把回收塑料制成颗粒，便于运输和再塑形。"}]}],"synonyms":["pelleted","granulated","compressed into pellets"],"phonetic":"/ˈpɛləˌtaɪzd/","extraExplanation":["“pelletize”常见于农业、饲料、能源（木屑颗粒/生物质颗粒）和材料加工等领域；“pelletized”既可作形容词（颗粒化的），也可作动词过去式/过去分词（已被制成颗粒）。","近义表达可用：granulated（更强调“粒状/颗粒化”，常用于糖、化肥等）、compressed into pellets（强调“压制成颗粒”）。"]}
{"word":"pelletizer","summary":{"en":"A pelletizer is a machine that turns loose material into small pellets.","zh":"pelletizer 指把松散材料制成小颗粒的制粒机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine that compresses or shapes loose material into small pellets (often for animal feed, fertilizer, plastics, or biomass fuel)","zh":"制粒机；将松散材料压缩或成形为小颗粒（常用于饲料、肥料、塑料或生物质燃料）的机器"},"examples":[{"en":"The factory installed a new pelletizer to make animal feed pellets more efficiently.","zh":"工厂安装了一台新的制粒机，以更高效地生产饲料颗粒。"},{"en":"After drying, the sawdust goes into the pelletizer to become fuel pellets.","zh":"锯末干燥后进入制粒机，制成燃料颗粒。"}]}],"synonyms":["pellet mill","granulator"],"phonetic":"/ˈpɛləˌtaɪzɚ/","extraExplanation":["“pelletizer”来自“pellet（小颗粒）+ -ize（使成为）+ -er（做……的机器/人）”。在工业语境中常见于“feed pelletizer（饲料制粒机）”“plastic pelletizer（塑料制粒机）”“biomass/wood pelletizer（生物质/木屑制粒机）”。","相关词：pellet（颗粒）、pelletizing（制粒，名词/动名词）、pelletize（制粒，动词）。在生产流程中常与“grinder（粉碎机）”“dryer（干燥机）”“extruder（挤出机）”等设备一起出现。"]}
{"word":"pelletizes","summary":{"en":"“Pelletizes” means “makes something into small pellets.”","zh":"“pelletizes” 意为“把某物制成小颗粒/丸粒（颗粒化）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a machine, process, or person) to form a material into small, round pellets; to make into pellets.","zh":"（机器、工艺或人）把材料制成小而圆的颗粒（丸粒）；使成颗粒状。"},"examples":[{"en":"The factory pelletizes animal feed so it’s easier to store and ship.","zh":"工厂把动物饲料制成颗粒，方便储存和运输。"},{"en":"This machine pelletizes plastic waste for recycling.","zh":"这台机器把塑料废料制成颗粒用于回收。"},{"en":"The company pelletizes sawdust into fuel pellets.","zh":"公司把锯末制成燃料颗粒。"}]}],"synonyms":["granulates","pellet forms","compresses into pellets","agglomerates"],"phonetic":"/ˈpɛləˌtaɪzɪz/","extraExplanation":["“pelletizes” 是动词 “pelletize” 的第三人称单数现在时：He/She/It pelletizes…；常见于工业、农业（饲料）、回收（塑料颗粒）和能源（木屑燃料颗粒）等语境。","拼写上常见两种形式：pelletize（美式更常用）与 pelletise（英式更常见），意思相同。"]}
{"word":"pelletizing","summary":{"en":"Pelletizing means forming materials into small pellets, usually to make them easier to handle, store, or use.","zh":"Pelletizing 指把材料加工成小颗粒（丸粒/颗粒），通常为了更易搬运、储存或使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a material into small, round pieces (pellets), often for easier handling, storage, or use in machines","zh":"将材料制成小而圆的颗粒（颗粒/丸粒）的过程，常用于便于搬运、储存或机器使用"},"examples":[{"en":"Pelletizing helps turn loose powder into uniform pellets that are easier to ship.","zh":"制粒（造粒）可以把松散粉末变成大小一致的颗粒，更方便运输。"},{"en":"The factory added a pelletizing line to reduce dust and waste.","zh":"工厂新增了一条制粒生产线，以减少粉尘和浪费。"}]},{"partOfSpeech":"v.","definition":{"en":"making something into pellets; forming small, round pieces from a material (present participle of “pelletize”)","zh":"把某物制成颗粒；将材料加工成小而圆的颗粒（“pelletize”的现在分词）"},"examples":[{"en":"They are pelletizing animal feed to improve storage and feeding efficiency.","zh":"他们正在把动物饲料制成颗粒，以提高储存和喂养效率。"},{"en":"The company is pelletizing recycled plastic for reuse in manufacturing.","zh":"公司正在将回收塑料制成颗粒，以便再次用于生产。"}]}],"synonyms":["pellet formation","granulation","agglomeration","compaction"],"phonetic":"/ˈpɛl.əˌtaɪ.zɪŋ/","extraExplanation":["“Pelletizing”常见于工业与农业语境，如铁矿粉制粒（iron ore pelletizing）、饲料制粒（feed pelletizing）、木屑制粒做燃料（wood pelletizing）。其核心目的通常是：让粒径更均匀、减少粉尘、提升流动性，便于自动化输送与计量。","常见搭配：pelletizing plant（制粒厂）、pelletizing line（制粒生产线）、pelletizing process（制粒工艺）、pelletizing machine（制粒机）。"]}
{"word":"pelletlike","summary":{"en":"“Pelletlike” means having the shape or size of a small round pellet.","zh":"“pelletlike”表示外形或大小像小圆粒/小丸一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a small, rounded piece (a pellet) in shape or size.","zh":"像小圆粒（颗粒）一样的；呈小丸状的。"},"examples":[{"en":"The animal left pelletlike droppings on the trail.","zh":"那只动物在小路上留下了像小圆粒一样的粪便。"},{"en":"Pelletlike beads of hail hit the window.","zh":"像小颗粒一样的冰雹敲打着窗户。"}]}],"synonyms":["pellet-shaped","granular","beadlike","pea-sized"],"phonetic":"/ˈpɛlɪtˌlaɪk/","extraExplanation":["“Pelletlike”由“pellet（小丸；小颗粒）+ -like（像……一样的）”构成，常用于描述外形或大小，尤其在医学/生物学（如粪便形状）、气象（如冰雹颗粒）、材料与食品（如小颗粒状物）等语境里很常见。"]}
{"word":"pellets","summary":{"en":"Pellets are small, hard pieces—commonly used for animal feed, fuel, plastic material, or sometimes medicine or small ammunition.","zh":"Pellets 指小而硬的颗粒/小丸，常见于饲料、燃料、塑料原料，也可指药丸或小弹丸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, hard, round pieces of material (often used as animal food, fuel, fertilizer, or plastic raw material).","zh":"（常为圆形的）小颗粒、硬丸；常用于饲料、燃料、肥料或塑料原料。"},"examples":[{"en":"The farmer bought pellets to feed the chickens.","zh":"农民买了颗粒饲料来喂鸡。"},{"en":"Wood pellets are used as a cleaner-burning fuel in some stoves.","zh":"木质颗粒在一些炉子里用作更清洁的燃料。"},{"en":"These plastic pellets will be melted and made into bottles.","zh":"这些塑料颗粒会被熔化并制成瓶子。"}]},{"partOfSpeech":"n.","definition":{"en":"Small balls of medicine, especially in older or formal usage.","zh":"（较旧或较正式用法）小药丸、药丸状剂。"},"examples":[{"en":"The doctor used to prescribe pellets for stomach pain in the past.","zh":"过去医生常开药丸来治胃痛。"},{"en":"She kept a few herbal pellets in a small tin.","zh":"她在小铁盒里放了几粒草药丸。"}]},{"partOfSpeech":"n.","definition":{"en":"Small round balls fired from some guns (such as air rifles or some shotgun loads).","zh":"（某些枪械如气枪或霰弹枪装填的）小圆弹丸。"},"examples":[{"en":"The target was hit by several pellets.","zh":"靶子被好几颗弹丸击中。"},{"en":"He used an air rifle that shoots metal pellets.","zh":"他用的是发射金属弹丸的气枪。"}]}],"synonyms":["granules","beads","pieces","capsules (medicine context)","shot (ammunition context)"],"phonetic":"/ˈpɛlɪts/","extraExplanation":["“Pellet”通常指“压制成型的小颗粒/小丸”，所以在不同领域会对应不同材料：饲料颗粒（feed pellets）、木质燃料颗粒（wood pellets）、塑料颗粒（plastic pellets）等。","在英美日常语境中，最常见的是“饲料颗粒”和“木质燃料颗粒”。涉及武器时也常见，但语境会更敏感，通常出现在新闻、狩猎或安全警示中。"]}
{"word":"pellety","summary":{"en":"“Pellety” means pellet-like or granular—made of or resembling small pellets.","zh":"“pellety”表示“像小颗粒/丸粒一样的、颗粒状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form or texture of small pellets; made of or containing many small, hard pieces.","zh":"呈小颗粒（丸粒）状的；由许多小而硬的颗粒组成的。"},"examples":[{"en":"The snow was pellety, stinging our faces in the wind.","zh":"雪是颗粒状的，在风里打在脸上很刺痛。"},{"en":"Add the fertilizer when it’s dry and pellety so it spreads evenly.","zh":"在肥料干燥、呈颗粒状时再撒，这样更均匀。"}]}],"synonyms":["granular","pellet-like","grainy"],"phonetic":"/ˈpɛləti/","extraExplanation":["“pellety”比较少见，更常见的写法是“pellet-like”（像颗粒/丸粒一样的）或直接用“granular”（颗粒状的）。","它来自名词“pellet”（小丸、颗粒）。在天气描写里，pellety 常用于形容像小冰粒/霰一样的雪或雨，强调“颗粒感”和“打在身上刺痛”的感觉。"]}
{"word":"pellian","summary":{"en":"“Pellian” is a rare mathematical word meaning “related to Pell or Pell’s equation.”","zh":"“Pellian”是较少见的数学用语，表示“与佩尔（或佩尔方程）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to John Pell (a 17th‑century English mathematician) or to Pell’s equation in number theory.","zh":"与17世纪英国数学家约翰·佩尔（John Pell）有关的；或与数论中的“佩尔方程（Pell’s equation）”有关的。"},"examples":[{"en":"A Pellian equation is a classic problem in elementary number theory.","zh":"佩尔方程是初等数论中的经典问题。"},{"en":"They used a Pellian method to generate integer solutions.","zh":"他们用一种与佩尔方程相关的方法来生成整数解。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math) A Pellian equation; a problem of the Pell’s‑equation type.","zh":"（数学）佩尔型方程；指佩尔方程这一类的问题。"},"examples":[{"en":"The paper focuses on solving Pellians efficiently.","zh":"这篇论文重点讨论如何高效求解佩尔型方程。"}]}],"synonyms":["Pell-related","of Pell’s equation"],"phonetic":"ˈpɛliən","extraExplanation":["“Pellian”在日常英语里非常少见，主要出现在数学（尤其是数论）语境。最常见的搭配是“Pellian equation”。","佩尔方程通常写作 x² − Dy² = 1（其中 D 是非平方整数），研究的是整数解（x, y）。虽然名称来自Pell，但历史上也常提到与费马（Fermat）、布拉姆古普塔（Brahmagupta）等人的工作有关。"]}
{"word":"pellicle","summary":{"en":"A pellicle is a very thin film or skin, especially one that forms on a liquid surface; it can also mean a thin biological membrane.","zh":"pellicle 指“很薄的一层膜/薄皮”，常见于液体表面形成的薄膜；也可指生物学上的薄膜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very thin skin or film that forms on the surface of a liquid or soft substance.","zh":"（液体或柔软物质表面形成的）薄膜、薄皮。"},"examples":[{"en":"A pellicle formed on the soup after it cooled.","zh":"汤冷却后表面结了一层薄膜。"},{"en":"Remove the pellicle from the milk before drinking it.","zh":"喝牛奶前把上面的奶皮去掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A thin membrane or outer covering in biology (for example, a thin layer on cells or tissues).","zh":"（生物学）薄膜；薄的外层覆盖物（如细胞或组织上的薄层）。"},"examples":[{"en":"Some bacteria develop a pellicle on the surface of the culture.","zh":"一些细菌会在培养液表面形成一层薄膜。"},{"en":"The specimen was covered by a delicate pellicle.","zh":"标本表面覆盖着一层很薄的膜。"}]},{"partOfSpeech":"n.","definition":{"en":"A thin transparent sheet or coating used in photography or imaging (less common).","zh":"（较少用）摄影/成像中使用的透明薄片或薄涂层。"},"examples":[{"en":"The old process used a protective pellicle over the image.","zh":"旧工艺会在图像上覆盖一层保护薄膜。"}]}],"synonyms":["film","skin","membrane","layer","coating"],"phonetic":"ˈpɛlɪkəl","extraExplanation":["词源：来自拉丁语 *pellicula*，意为“小皮、小薄皮”，与 *pelt*（兽皮）同源，所以它常用来形容“像皮一样薄的一层”。","日常语境里，它经常指食物表面“结皮/结膜”（如汤、牛奶、果酱等冷却后表面的那层）。在科学语境（微生物培养等）中也很常见。"]}
{"word":"pellicles","summary":{"en":"Pellicles are very thin films or skin-like layers; in technical contexts, they can also mean thin transparent membranes used in imaging or printing.","zh":"pellicles 指非常薄的薄膜/薄层；在技术语境中也可指用于成像或印刷的薄透明膜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very thin layer or film on a surface (often a natural skin-like film).","zh":"（覆盖在表面的）薄膜；薄层（常指自然形成、像皮肤一样的薄膜）"},"examples":[{"en":"A thin pellicle formed on the soup after it cooled.","zh":"汤冷却后表面形成了一层薄薄的膜。"},{"en":"The lab noted a pellicle on the liquid, suggesting microbial growth.","zh":"实验室注意到液体表面有一层薄膜，可能提示微生物生长。"}]},{"partOfSpeech":"n.","definition":{"en":"(Technical) A thin transparent membrane used in imaging/printing equipment (for example, as a protective or optical film).","zh":"（技术）用于成像/印刷设备中的薄透明膜（例如用作保护膜或光学薄膜）"},"examples":[{"en":"The technician replaced the damaged pellicle on the imaging system.","zh":"技术员更换了成像系统上损坏的薄膜。"},{"en":"Dust on the pellicle can affect image quality.","zh":"薄膜上的灰尘会影响成像质量。"}]}],"synonyms":["thin film","membrane","skin","coating","surface layer"],"phonetic":"/ˈpɛlɪkəlz/","extraExplanation":["“pellicle”来自拉丁语词根，和“skin（皮肤）/film（薄膜）”的概念很接近，因此在生物学里常指液体表面形成的“菌膜/薄膜”，在光学与工业领域也可指非常薄的透明膜或保护膜。","日常英语中不太常用，更多出现在实验室、食品发酵（如表面菌膜）或成像/印刷等技术语境。"]}
{"word":"pellicula","summary":{"en":"Pellicula means a very thin film or skin-like layer; it can also mean “movie/film” in Spanish/Latin contexts but is rare in modern English.","zh":"Pellicula 指“极薄的膜/薄皮”；在西语/拉丁语语境中也可指“电影/胶片”，但现代英语中较少这样用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very thin layer or skin-like film on a surface (often used in biology or chemistry).","zh":"（常用于生物或化学）表面上的一层极薄的膜／薄皮。"},"examples":[{"en":"A pellicula formed on the surface of the liquid after it cooled.","zh":"液体冷却后，表面形成了一层薄膜。"},{"en":"In some microorganisms, the pellicula helps support and protect the cell.","zh":"在一些微生物中，薄膜结构有助于支撑并保护细胞。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts (especially from Latin- or Spanish-influenced usage), “pellicula” can refer to a film (a movie) or photographic film, but this is not common in modern English.","zh":"在某些受拉丁语或西班牙语影响的语境中，“pellicula”也可指“电影”或“胶片”，但在现代英语里不常用。"},"examples":[{"en":"The Spanish word “película” means “movie,” but in English we usually say “film” or “movie.”","zh":"西班牙语“película”意为“电影”，但英语通常说“film”或“movie”。"},{"en":"Older scientific writing may use pellicula to mean a thin film-like layer.","zh":"较早的科学写作可能用 pellicula 指一层像胶片一样的薄层。"}]}],"synonyms":["pellicle","film","membrane","coating","skin"],"phonetic":"/pəˈlɪk.jə.lə/","extraExplanation":["“pellicula”来自拉丁语，原意与“皮/薄皮”相关，因此在英语的学术语境里多强调“很薄的一层膜”。","容易与英语更常见的词“pellicle”（同源词，意为薄膜）混淆；在现代英语里，描述“薄膜/薄层”通常用 pellicle、film、membrane 等词。"]}
{"word":"pellicular","summary":{"en":"Pellicular means “related to a very thin film (pellicle) on a surface,” often used in scientific contexts.","zh":"Pellicular 指“与表面的一层极薄薄膜（pellicle）有关”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a very thin film or skin-like layer (a “pellicle”) on a surface.","zh":"与“薄膜/薄皮层（pellicle）”有关的；指表面上一层很薄的膜状物。"},"examples":[{"en":"A pellicular layer formed on top of the liquid after it cooled.","zh":"液体冷却后，表面形成了一层薄薄的膜。"},{"en":"Scientists examined the pellicular coating under a microscope.","zh":"科学家在显微镜下观察了这层薄膜涂层。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology) Describing structures connected to the pellicle in some organisms, such as certain protozoa.","zh":"（生物）形容与某些生物（如部分原生动物）的表膜/表层结构有关的。"},"examples":[{"en":"Some protozoa have pellicular structures that help them keep their shape.","zh":"一些原生动物具有表膜相关结构，帮助它们保持形状。"}]}],"synonyms":["film-like","membranous","skinlike"],"phonetic":"/pəˈlɪkjələr/","extraExplanation":["“pellicular”来自“pellicle”（薄膜、薄皮层）。在科学写作里更常见；日常英语里通常直接说“thin film”“a thin layer”。","在摄影/材料等语境中，pellicle可指非常薄的膜（例如某些光学或实验材料中的薄膜层），因此pellicular常用于描述这种“膜状的、像皮一样薄的一层”。"]}
{"word":"pellicularia","summary":{"en":"Pellicularia is an older, mostly obsolete genus name for certain plant-pathogenic fungi, often connected to Rhizoctonia in modern usage.","zh":"Pellicularia 是一个较旧且多已废用的真菌属名，现代使用中常与丝核菌属（Rhizoctonia）相关或被其取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former (now mostly obsolete) scientific genus name used for certain plant-pathogenic fungi, especially ones now commonly classified in or associated with Rhizoctonia.","zh":"一个较旧、现在多已不再使用的真菌属名，曾用于一些植物病原真菌（许多现多归类于或与丝核菌属 Rhizoctonia 相关）。"},"examples":[{"en":"Older plant-disease texts may mention Pellicularia when describing Rhizoctonia-like fungi.","zh":"较早的植物病害资料中，描述类似丝核菌的真菌时，可能会提到 Pellicularia。"},{"en":"In modern classification, Pellicularia is usually replaced by updated genus names.","zh":"在现代分类中，Pellicularia 通常会被更新的属名所取代。"}]}],"synonyms":["Rhizoctonia (modern-related classification, not exact synonym)","obsolete genus name (descriptor)"],"phonetic":"/pəˌlɪk.jəˈlɛr.i.ə/","extraExplanation":["Pellicularia 常见于旧版真菌学或植物病理学文献中，属于“历史用名/旧属名”的情况。现在的学术与检疫资料更倾向使用更新后的分类（例如与 Rhizoctonia 相关的名称）。如果你是在论文、报告或鉴定记录中遇到它，最好对照该文献的年代与所指物种，查对应的现行学名（current accepted name）。"]}
{"word":"pelliculate","summary":{"en":"Pelliculate means to form or be covered by a thin film (a pellicle).","zh":"Pelliculate 指形成或被一层薄膜（薄皮）覆盖。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a liquid or surface) to form a thin skin or film; to become covered with a thin layer.","zh":"（液体或表面）形成一层薄膜/薄皮；被一层薄层覆盖。"},"examples":[{"en":"After the soup cooled, the surface began to pelliculate.","zh":"汤冷却后，表面开始结一层薄膜。"},{"en":"Certain paints pelliculate quickly in dry air.","zh":"某些油漆在干燥空气中会很快形成薄膜。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with a thin skin or film; having a thin, skin-like layer.","zh":"覆有薄膜的；有薄皮/薄层的。"},"examples":[{"en":"A pelliculate layer formed on the solution overnight.","zh":"溶液表面一夜之间形成了一层薄膜。"},{"en":"The fruit had a pelliculate coating from natural wax.","zh":"水果表面有一层由天然蜡形成的薄膜。"}]}],"synonyms":["form a film","develop a skin","coat","cover","film over"],"phonetic":"/pəˈlɪkjəˌleɪt/","extraExplanation":["这是一个较少见、偏科学或技术语境的词，来自拉丁语词根 pellis（“皮”）与 pellicula（“小薄皮/薄膜”）。日常英语中更常用的替代说法有：form a film / form a skin / develop a film（形成薄膜/结皮）。"]}
{"word":"pellicule","summary":{"en":"Pellicule means a very thin film or skin-like layer, and it can also mean photographic or movie film (especially in French-influenced usage).","zh":"Pellicule 指覆盖表面的薄膜/薄层，也可指胶片/电影胶卷（尤其在偏法语的用法中）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very thin film or skin-like layer covering a surface","zh":"（覆盖在表面上的）薄膜；薄皮；薄层"},"examples":[{"en":"A pellicule of oil formed on top of the soup after it cooled.","zh":"汤冷却后，表面形成了一层薄薄的油膜。"},{"en":"The paint developed a pellicule that made the surface look slightly cloudy.","zh":"油漆表面形成了一层薄膜，让表面看起来有点发雾。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in French-influenced contexts) photographic or motion-picture film; a film strip","zh":"（尤用于受法语影响的语境）胶片；电影胶卷"},"examples":[{"en":"The director asked to check the pellicule before final editing.","zh":"导演要求在最终剪辑前检查胶片。"},{"en":"Old pellicules must be stored carefully to prevent damage.","zh":"老胶片必须小心保存，以防受损。"}]}],"synonyms":["film","thin layer","skin","coating","membrane"],"phonetic":"ˈpɛlɪˌkjuːl","extraExplanation":["“pellicule”是从法语借入英语的词，来自拉丁语词根，含义与“皮/薄皮”有关，所以在英语里常指“像皮一样薄的一层”。","在电影与摄影领域，法语里“pellicule”常用来指“胶片/胶卷”；英语中也能见到这种用法，但更常见的对应词是“film”。","日常英语里更常用“film / layer / skin”来表达“薄膜/薄层”；“pellicule”带有更书面、更专业或更偏法语的语感。"]}
{"word":"pellile","summary":{"en":"“pellile” is not a standard English word; it’s likely a misspelling, often of “pellicle.”","zh":"“pellile”不是标准英语词，通常是拼写错误，常见可能是“pellicle”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “pellicle” (a thin film or skin) or “pelle”/“pellet” depending on context.","zh":"不是标准英语单词。更可能是拼写错误，常见的可能目标是 “pellicle”（薄膜/薄皮），也可能因语境而指 “pellet”等词。"},"examples":[{"en":"I can’t find “pellile” in a dictionary—did you mean “pellicle”?","zh":"我在词典里找不到“pellile”——你是不是想写“pellicle”？"},{"en":"A pellicle formed on the surface of the paint as it dried.","zh":"油漆在干燥时表面形成了一层薄膜。"}]}],"synonyms":["pellicle (likely intended)","film","thin layer","membrane"],"phonetic":"/ˈpɛlɪkəl/","extraExplanation":["“pellicle”较常见于科学/技术语境（如显微镜、摄影、化学、生物学），意思是“很薄的一层膜”。如果你告诉我你看到“pellile”的句子或领域（比如医学、化学、电影、游戏等），我可以更准确判断你想查的词。"]}
{"word":"pellitories","summary":{"en":"“Pellitories” is the plural of “pellitory,” referring to certain plants, especially pellitory-of-the-wall or a traditional medicinal herb sometimes called toothache plant.","zh":"“Pellitories”是“pellitory”的复数，指某些植物，常见指墙草/墙荨麻，或传统草药用的“牙痛草/止痛菊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Plants called “pellitory,” especially pellitory-of-the-wall (a wild plant that often grows on walls and can cause allergies).","zh":"（复数）名为“pellitory”的植物，尤指“墙草/墙荨麻”（常沿墙生长的野草，也可能引发过敏）。"},"examples":[{"en":"Pellitories often grow in cracks in old stone walls.","zh":"墙草常常长在老石墙的缝隙里。"},{"en":"Some people get hay-fever symptoms when pellitories release pollen.","zh":"有些人在墙草散播花粉时会出现花粉热症状。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Pellitory (toothache plant), a medicinal herb traditionally used to relieve toothache and stimulate saliva.","zh":"（复数）“牙痛草/止痛菊”（传统药草，据说可缓解牙痛并促进唾液分泌）。"},"examples":[{"en":"In some traditional remedies, dried pellitories were used for tooth pain.","zh":"在一些传统疗法中，人们会用干燥的牙痛草来缓解牙痛。"},{"en":"The herbalist mentioned pellitories, but advised checking safety before using them.","zh":"草药师提到牙痛草，但也建议使用前先确认安全性。"}]}],"synonyms":["pellitory","pellitory-of-the-wall","Parietaria","toothache plant"],"phonetic":"/ˈpɛlɪˌtɔri/","extraExplanation":["“pellitories”是名词复数，单数是“pellitory”。在不同地区与语境里，它可能指不同植物：常见的是“pellitory-of-the-wall（墙草/墙荨麻，Parietaria属）”，在欧洲较常见，也常被提到与花粉过敏有关；另一个较传统草药用法指“pellitory（Anacyclus pyrethrum）”，英语里也有人称其与牙痛相关。阅读时可根据上下文（墙边野草/过敏 vs. 草药/牙痛）判断具体所指。"]}
{"word":"pellitory","summary":{"en":"Pellitory is an old name for certain plants—most often a weed that grows on walls, and sometimes a medicinal plant used for toothache.","zh":"Pellitory 是一些植物的旧称：最常指长在墙缝的野草（墙草），有时也指用于缓解牙痛的药用植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of two old-fashioned plant names, especially for a wall-growing weed (pellitory-of-the-wall).","zh":"一种较旧的植物名称，尤指常长在墙缝、石缝处的野草——“墙草/墙生荨麻”（pellitory-of-the-wall）。"},"examples":[{"en":"Pellitory often grows out of cracks in old stone walls.","zh":"墙草常从老石墙的缝隙里长出来。"},{"en":"In some towns, pellitory is considered a common roadside weed.","zh":"在一些城镇里，墙草被视为常见的路边杂草。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicinal plant (also called Spanish chamomile) whose root was traditionally used to numb the mouth and ease toothache.","zh":"一种药用植物（也称“西班牙洋甘菊”），其根传统上用于麻痹口腔、缓解牙痛。"},"examples":[{"en":"Historically, pellitory root was chewed to relieve toothache.","zh":"历史上，人们会嚼“药用墙草/牙痛草”的根来缓解牙痛。"},{"en":"Herbal books mention pellitory as a warming, numbing remedy.","zh":"一些草药书提到它具有温热、麻木的药用效果。"}]}],"synonyms":["pellitory-of-the-wall","Parietaria (genus)","Spanish chamomile (for the medicinal sense)"],"phonetic":"ˈpɛlɪˌtɔri","extraExplanation":["“Pellitory”在英语里不是一个单一、明确的植物学名称，而是传统俗名：最常见指“pellitory-of-the-wall”（学名常见为 Parietaria judaica 等），也可能指另一种药用植物（如 Anacyclus pyrethrum），因此在阅读旧药典或园艺书时要结合上下文判断。","词义上常与“墙/墙缝里长的植物”这一生活观察有关；现代更常用更具体的名称（如 pellitory-of-the-wall 或直接用学名）来避免歧义。"]}
{"word":"pellmell","summary":{"en":"Pell-mell means doing something in a rushed, chaotic, disorderly way, or describing such a situation.","zh":"pell-mell 表示“慌乱地、杂乱无章地/一窝蜂地”，也可形容“仓促混乱的”场面。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hurried, confused, and disordered way; all mixed together without control.","zh":"慌乱地、杂乱无章地；一窝蜂地（不受控制地混在一起）。"},"examples":[{"en":"When the fire alarm rang, everyone ran pell-mell toward the exits.","zh":"火警响起时，大家一窝蜂地冲向出口。"},{"en":"The kids raced pell-mell into the living room after school.","zh":"放学后孩子们乱哄哄地冲进客厅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in a wild, rushed, and disorderly way.","zh":"（事物）仓促而混乱的；乱糟糟的。"},"examples":[{"en":"It was a pell-mell rush to finish the project before the deadline.","zh":"为了赶在截止日期前完成项目，大家忙得一团乱。"},{"en":"The team made a pell-mell retreat when the plan failed.","zh":"计划失败后，队伍仓皇撤退。"}]}],"synonyms":["headlong","hurriedly","frantically","in a rush","chaotically"],"phonetic":"ˌpɛlˈmɛl","extraExplanation":["“pell-mell”常见拼写带连字符（pell-mell），也可写作不带连字符（pellmell）。语气偏文学或叙述性写作里更常见，日常口语中也能用，但会显得更“书面/戏剧化”。","词源上与“pelt”（猛冲、疾奔）有关，强调“冲得很急、很乱”的画面感。常用于描写人群、动物、士兵等“乱哄哄地冲/逃/挤”的场景。","文学语境里常用来制造紧张或混乱的氛围：例如描写“人群乱作一团、纷纷涌出/冲入”的场面。"]}
{"word":"pellmells","summary":{"en":"Pell-mell means “in a chaotic, rushed way” or “jumbled and confused.”","zh":"pell-mell 表示“慌乱地、杂乱无章地”，也可形容“混乱的、乱糟糟的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a rushed, disorganized, mixed-together way; without order","zh":"杂乱无章地；慌乱地；一股脑儿地"},"examples":[{"en":"People ran pell-mell toward the exit when the alarm sounded.","zh":"警报响起时，人们慌乱地朝出口跑去。"},{"en":"Books and papers were piled pell-mell on the desk.","zh":"书和文件杂乱无章地堆在桌上。"}]},{"partOfSpeech":"adj.","definition":{"en":"rushed and confused; jumbled together","zh":"慌乱的；杂乱的；混杂在一起的"},"examples":[{"en":"It turned into a pell-mell scramble to finish before the deadline.","zh":"为了赶在截止前完成，事情变成了一场慌乱的争抢。"},{"en":"They made a pell-mell retreat down the hill.","zh":"他们慌乱地往山下撤退。"}]}],"synonyms":["headlong","hurriedly","chaotically","in a jumble","in a rush"],"phonetic":"/ˌpɛlˈmɛl/","extraExplanation":["“pell-mell”常写作带连字符的形式（pell-mell）。你写的“pellmells”多半是把它当作复数或随手连写；实际使用中更常见的是作副词/形容词，不太会加复数词尾。","词源来自法语“pêle-mêle”，意思是“混在一起、乱成一团”。在文学描写里，它常用来渲染场面失控、人物慌张或环境凌乱的画面感。"]}
{"word":"pellock","summary":{"en":"“Pellock” is uncommon in standard English; it is usually a misspelling of “pollock” (a fish) or a surname.","zh":"“pellock”在标准英语中不常见；通常是把“pollock”（一种鱼）拼错了，或作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A variant spelling of “pollock,” usually referring to a type of cod-like fish, or (less commonly) the surname “Pollock.”","zh":"（罕见/非标准）“pollock”的变体拼写，通常指一种类似鳕鱼的鱼（明太鱼/狭鳕等），或（较少见）指姓氏“Pollock”。"},"examples":[{"en":"I think “pellock” here is a misspelling of “pollock,” the fish.","zh":"我觉得这里的“pellock”是把“pollock”（一种鱼）拼错了。"},{"en":"The menu probably meant pollock, not “pellock.”","zh":"菜单上很可能想写的是pollock，而不是“pellock”。"}]},{"partOfSpeech":"other","definition":{"en":"A surname (family name), pronounced like “PELL-ock.”","zh":"一个姓氏（家族姓），读音类似“PELL-ock”。"},"examples":[{"en":"Ms. Pellock will join the meeting at 3 p.m.","zh":"Pellock女士会在下午三点参加会议。"}]}],"synonyms":["pollock (likely intended)"],"phonetic":"/ˈpɛlək/","extraExplanation":["“pellock”不是常见的标准英语单词；在多数语境中更可能是把“pollock”拼错了。","“pollock”最常见的意思是鱼名（餐厅菜单、超市冷冻鱼排里很常见）；作为专有名词时，也可能指姓氏Pollock（例如画家Jackson Pollock）。","如果你能提供原句/出处（书名、截图或上下文），我可以帮你判断它到底是拼写错误、专有名词，还是方言/品牌名。"]}
{"word":"pellotin","summary":{"en":"Peloton means the main pack of cyclists riding together in a race; less commonly, it can mean a small military unit.","zh":"Peloton 指自行车比赛中一起骑行的主集团；较少见地也可指军队小分队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large group of cyclists riding together in a race (the main pack).","zh":"（自行车比赛中的）主集团；大部队骑手（一起骑行的主要队伍）。"},"examples":[{"en":"She stayed in the peloton to save energy by drafting.","zh":"她留在主集团里跟骑以节省体力（利用前车挡风）。"},{"en":"The breakaway was caught by the peloton near the finish.","zh":"快到终点时，突围小组被主集团追回了。"}]},{"partOfSpeech":"n.","definition":{"en":"A small military unit (historical/less common in modern everyday English).","zh":"（军队）小分队；小单位（较书面/较少见用法）。"},"examples":[{"en":"A peloton of soldiers guarded the gate.","zh":"一支小分队守卫着大门。"}]}],"synonyms":["pack","main group","bunch"],"phonetic":"/ˈpɛləˌtɑn/","extraExplanation":["你输入的“pellotin”在英语里并不常见；更常见、最可能想写的是 **peloton**（自行车比赛的“主集团”）。","词源来自法语 *peloton*，原义有“（线团/小球状的一团）”，后来引申为“聚在一起的一群人/队伍”。","在自行车文化里，*peloton* 常和 **breakaway（突围）**、**drafting（跟骑/借风）** 一起出现；在新闻和赛事解说中非常常见。"]}
{"word":"pellotine","summary":{"en":"Pellotine is a rare word for an alkaloid from peyote, historically studied for sedative/sleep-inducing effects.","zh":"Pellotine 是个较少见的词，指来源于佩奥特的生物碱，历史上因镇静/催眠作用而被研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring alkaloid found especially in the peyote cactus, studied/used in the past for its calming or sleep-inducing (sedative/hypnotic) effects.","zh":"一种天然生物碱，主要存在于佩奥特（仙人掌）中，过去曾因其镇静或催眠作用而被研究或使用。"},"examples":[{"en":"Early researchers isolated pellotine from peyote and tested its sedative effects.","zh":"早期研究人员从佩奥特中分离出佩洛汀（pellotine），并测试其镇静作用。"},{"en":"Pellotine is an alkaloid, but it is not as well-known as mescaline.","zh":"Pellotine 也是一种生物碱，但不像麦司卡林（mescaline）那样出名。"}]}],"synonyms":["alkaloid","sedative (contextual)"],"phonetic":"/ˈpɛlətoʊtin/","extraExplanation":["“Pellotine”多见于药理学、植物化学或历史文献中，日常英语里非常少用。","它与“peyote（佩奥特）”的文化与宗教背景有关：佩奥特在北美一些原住民传统中具有重要意义。谈论相关物质时，英语语境里通常会强调尊重原住民文化，并注意法律与健康风险。","拼写提示：结尾 -ine 在英语里常读作 /iːn/（如 caffeine），所以常见读法类似“PELL-uh-toe-teen”。"]}
{"word":"pellucent","summary":{"en":"Pellucent means translucent—letting light pass through, often used in literary description.","zh":"Pellucent 指“半透明、透光”，常见于文学或较正式的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Allowing light to pass through; translucent (partly transparent but not clear).","zh":"半透明的；透光的（能让光穿过，但不清晰可见）。"},"examples":[{"en":"The morning sun shone through the pellucent curtains.","zh":"清晨的阳光透过半透明的窗帘照进来。"},{"en":"A pellucent layer of ice covered the pond.","zh":"池塘上覆盖着一层透光的薄冰。"},{"en":"Her skin looked almost pellucent under the pale light.","zh":"在苍白的光线下，她的皮肤看起来几乎是半透明的。"}]}],"synonyms":["translucent","diaphanous","sheer"],"phonetic":"/pəˈluːsənt/","extraExplanation":["“pellucent”比较文学化、偏书面，日常更常用“translucent”（半透明）或“transparent”（透明）。它常用来描写光线、薄纱、冰、皮肤等，带有一种细腻、柔和、甚至略神秘的画面感。","词源上来自拉丁语前缀“per-”（穿过）+“luc-”（光），字面意思就是“光能穿过”。记忆时可以联想到“lucid”（清晰的、明亮的）也来自同一词根“luc-”。"]}
{"word":"pellucid","summary":{"en":"Pellucid means extremely clear—either literally transparent (water, glass) or figuratively easy to understand (writing, explanations).","zh":"Pellucid 指“极其清澈/透明”，也可引申为“表达清晰易懂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of liquid, air, or glass) extremely clear; transparent.","zh":"（指液体、空气或玻璃等）极其清澈的；透明的。"},"examples":[{"en":"The lake was pellucid, and we could see fish near the bottom.","zh":"湖水清澈见底，我们能看到靠近湖底的鱼。"},{"en":"Light passed through the pellucid glass without distortion.","zh":"光线穿过透明的玻璃，没有发生变形。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of writing, speech, or thought) very clear and easy to understand.","zh":"（指文章、讲话或思路）非常清晰易懂的。"},"examples":[{"en":"Her explanation of the rules was pellucid.","zh":"她对规则的解释非常清楚易懂。"},{"en":"The book is known for its pellucid style.","zh":"这本书以清晰明了的文风著称。"}]}],"synonyms":["clear","transparent","crystal-clear","limpid","lucid"],"phonetic":"/pəˈluːsɪd/","extraExplanation":["“pellucid”偏正式、书面语，日常更常用“clear / transparent / easy to understand”。","词源来自拉丁语“per-（完全）+ lucidus（明亮、清澈）”，所以既可形容“看得见的清澈”，也可引申为“表达上的清晰”。","常见搭配：pellucid water/stream/air（清澈的水/溪流/空气）；pellucid prose/style/explanation（清晰的散文/文风/解释）。"]}
{"word":"pellucida","summary":{"en":"Pellucida means very clear or translucent, allowing light (and often vision) to pass through.","zh":"pellucida 指“清澈透亮、半透明”，强调光能穿透、看起来明亮清晰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a substance, surface, or liquid) clear enough to see through; translucent and shining with clarity.","zh":"（指物质、表面或液体）清澈的、半透明的；透亮的。"},"examples":[{"en":"The jellyfish drifted in pellucida water near the shore.","zh":"水母在近岸清澈透亮的海水中漂浮。"},{"en":"She held the leaf up to the light to admire its pellucida veins.","zh":"她把叶子举到光下，欣赏它半透明的叶脉。"},{"en":"Through the pellucida glass, you could see the candle flickering.","zh":"透过清澈的玻璃，你能看到蜡烛的火光摇曳。"}]}],"synonyms":["pellucid","translucent","clear","crystal-clear","limpid"],"phonetic":"/pəˈluːsɪdə/","extraExplanation":["“pellucida”源自拉丁语词根：per-（穿过）+ lucere（发光）。因此它常带有“光能穿透、看起来明亮清澈”的感觉，比普通的“clear/transparent”更偏文学或描写性。","在英语中更常见的形式是“pellucid”（同义、用法更普遍）。你输入的“pellucida”更像是“pellucid”的变体/较少见拼写，或在特定文体中使用。"]}
{"word":"pellucidity","summary":{"en":"Pellucidity means exceptional clarity—especially clear writing or thinking; less commonly, physical transparency.","zh":"pellucidity 指极高的清晰度（常指表达或思路清楚）；较少见的意思是“透明、清澈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Extreme clarity and ease of understanding, especially in writing, speech, or thought.","zh":"（尤指写作、讲话或思路的）极其清晰、明白易懂。"},"examples":[{"en":"Her essay is praised for its pellucidity—every idea is easy to follow.","zh":"她的文章因其清晰明了而受到称赞——每个观点都很容易理解。"},{"en":"The teacher explained the grammar with pellucidity.","zh":"老师把语法讲得非常清楚易懂。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being transparent or crystal-clear (now less common).","zh":"透明、清澈见底的性质（现较少用）。"},"examples":[{"en":"In the morning light, the lake’s pellucidity revealed every stone below.","zh":"在晨光里，湖水清澈见底，水下每一块石头都看得见。"}]}],"synonyms":["clarity","lucidity","clearness","transparency"],"phonetic":"/pəˈluːsədi/","extraExplanation":["词源提示：pellucidity 来自拉丁语 pellucidus（“透光的、清澈的”），由 per-（“穿过”）+ luc-（“光”）组成，所以它既可以形容“文字/表达的清楚”，也可以形容“水或玻璃的透亮”。","用法建议：在学术或正式写作里，pellucidity 常用来夸赞“表达清晰”。日常口语更常用 clarity、clearness、easy to understand。"]}
{"word":"pellucidly","summary":{"en":"Pellucidly means “very clearly,” especially in writing/speech, or “transparently” in a visual sense.","zh":"pellucidly 表示“非常清楚明白地”（尤用于表达/写作），也可指“清澈透明地”（视觉意义）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very clear and easy-to-understand way; plainly.","zh":"非常清楚明白地；清晰易懂地；直截了当地。"},"examples":[{"en":"She explained the rules pellucidly, so everyone understood.","zh":"她把规则讲得非常清楚，所以大家都明白了。"},{"en":"The article lays out the argument pellucidly, with no confusing jargon.","zh":"这篇文章把论点讲得很清晰，没有让人困惑的行话。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is visually or physically transparent; crystal-clear.","zh":"（视觉/物理上）清澈透明地；晶莹剔透地。"},"examples":[{"en":"Sunlight shone pellucidly through the shallow water.","zh":"阳光透过浅水清澈地照射下来。"},{"en":"The glass was cleaned until it gleamed pellucidly.","zh":"玻璃被擦得晶亮通透。"}]}],"synonyms":["clearly","plainly","lucidly","transparently"],"phonetic":"/pəˈluːsɪdli/","extraExplanation":["“pellucidly”来自形容词“pellucid”（清澈的；明晰的），常见于较正式、文学或学术语境，用来强调一种“清澈见底”的明白感。写作中它比“clearly”更有文采，但日常口语更常用“clearly / plainly”。"]}
{"word":"pellucidness","summary":{"en":"Pellucidness means exceptional clarity—either clear meaning in language/ideas or transparent clearness in things like water or glass.","zh":"Pellucidness 指“极其清晰”的特质，可形容语言/思想的明白透彻，也可形容水或玻璃等的清澈透明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being very clear and easy to understand (often used about writing, ideas, or explanations).","zh":"（多指文章、思想、解释等）清晰易懂、明白透彻的特质。"},"examples":[{"en":"The pellucidness of her explanation helped everyone understand the new rule immediately.","zh":"她解释得非常清楚，大家立刻就明白了新规定。"},{"en":"Good teachers aim for pellucidness, not complicated language.","zh":"好老师追求的是清晰易懂，而不是复杂的措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being transparently clear (often used about water, glass, or light).","zh":"（多指水、玻璃、光线等）清澈透明、晶莹透亮的特质。"},"examples":[{"en":"They admired the pellucidness of the mountain lake.","zh":"他们赞叹那座山中湖泊的清澈透明。"},{"en":"The pellucidness of the glass made the room feel brighter.","zh":"玻璃的通透让房间显得更明亮。"}]}],"synonyms":["clarity","lucidity","transparency","clearness"],"phonetic":"/pəˈluːsɪdnəs/","extraExplanation":["“pellucidness”来自形容词“pellucid”（清澈的；清晰的），常见于较正式或文学性的英语写作。日常口语里更常用“clarity”（清晰）或“transparency”（透明/透明度）。","它既可形容“语言/思路的清晰”，也可形容“物体的透明清澈”，写作中属于有点“文雅、书面”的用词。"]}
{"word":"pelmanism","summary":{"en":"Pelmanism is a card-matching memory game where you flip cards and find pairs.","zh":"Pelmanism 指一种翻牌找相同配对的记忆游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A card-matching memory game where you turn over cards to find pairs (also called “Concentration” or “Memory”).","zh":"一种翻牌配对的记忆游戏：把牌翻开寻找相同的一对（也常叫“Concentration/专注力游戏”或“Memory/记忆游戏”）。"},"examples":[{"en":"We played pelmanism in class to practice new vocabulary.","zh":"我们在课堂上玩配对记忆游戏来练习新单词。"},{"en":"In pelmanism, you try to remember where each picture is and match it with the same one.","zh":"在配对记忆游戏里，你要记住每张图片的位置，并找到同一张来配对。"}]}],"synonyms":["Concentration","Memory (game)","matching game"],"phonetic":"/ˈpɛlməˌnɪzəm/","extraExplanation":["“Pelmanism”这个词来自英国的“Pelman Institute（佩尔曼学院）”，与早期的记忆训练/速记课程有关。后来这种翻牌配对的玩法常被用作训练记忆力的游戏，因此得名。","在美式英语里，这个游戏更常被叫作“Concentration”或直接叫“Memory (game)”，所以在美国日常交流中说“pelmanism”可能会显得比较英式或较少见。"]}
{"word":"pelmanist","summary":{"en":"A pelmanist is someone who plays Pelmanism, a card-flipping memory matching game.","zh":"pelmanist 指玩 Pelmanism（翻牌记忆配对游戏）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who plays Pelmanism (a memory game where you turn over cards to find matching pairs).","zh":"玩“佩尔曼记忆配对游戏”（翻牌找相同配对的记忆游戏）的人。"},"examples":[{"en":"My little brother is a natural pelmanist—he remembers where every card is after one glance.","zh":"我弟弟天生就是个 pelmanist——他看一眼就能记住每张牌的位置。"},{"en":"In class, the teacher turned vocabulary review into a pelmanist-style matching game.","zh":"课堂上，老师把词汇复习做成了类似 pelmanist 的配对翻牌游戏。"}]}],"synonyms":["memory-game player","matching-game player","Concentration player"],"phonetic":"/ˈpɛlmənɪst/","extraExplanation":["“Pelmanism”源自英国心理学家/训练法推广者 William Joseph Ennever Pelman（19世纪末—20世纪初）所推广的记忆训练方法，后来他的名字被用来指一种“翻牌配对”的记忆游戏。","“pelmanist”在现代英语中相对少见，更常见的说法是“someone who plays a memory matching game / concentration”。"]}
{"word":"pelmanize","summary":{"en":"Pelmanize means to memorize or train memory through systematic drills, often with a sense of rote learning.","zh":"Pelmanize 指用系统训练法来记忆，常带有“偏机械背诵/死记硬背”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to train your memory using a system of drills; to memorize in a mechanical, method-based way","zh":"用一套训练法来锻炼记忆；用较机械、按方法的方式去背诵/记住"},"examples":[{"en":"He tried to pelmanize the vocabulary list by repeating it every night.","zh":"他试着用一套固定的重复方法来“Pelmanize”那份词汇表，每晚都背一遍。"},{"en":"The teacher warned that pelmanizing facts without understanding can be tiring and ineffective.","zh":"老师提醒说，只“机械背事实”而不理解，既累又不一定有效。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something (or someone) depend heavily on memory drills or rote learning","zh":"使（某事/某人）过度依赖记忆训练或死记硬背"},"examples":[{"en":"The course was criticized for pelmanizing history into dates and names only.","zh":"这门课被批评把历史“训练成只剩日期和人名的背诵”。"}]}],"synonyms":["memorize","learn by rote","drill","cram","commit to memory"],"phonetic":"/ˈpɛlməˌnaɪz/","extraExplanation":["“pelmanize”来自20世纪初流行的“Pelman Method（佩尔曼记忆法）”，是一种强调通过系统练习来增强记忆的训练课程。如今这个词较少见，常带一点评论意味：强调“背得很熟”，但可能暗示理解不够深入。","相关词：pelmanism（也指一种记忆配对游戏/翻牌记忆游戏），与“记忆训练/记忆术”的文化背景有关。"]}
{"word":"pelmata","summary":{"en":"“pelmata” is a rare borrowing/transliteration meaning “the soles of the feet.”","zh":"“pelmata”多为希腊语借词/音译，意思是“脚掌、脚底（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The soles of the feet; foot soles (plural). Often seen as a transliteration of Modern Greek «πέλματα» (pélmata).","zh":"（罕见）脚掌、脚底（复数）。常见于对现代希腊语「πέλματα」（pélmata）的音译。"},"examples":[{"en":"After the hike, the pelmata of my feet were sore and blistered.","zh":"徒步之后，我的脚掌（脚底）又酸又起了水泡。"},{"en":"The dancer protected her pelmata with padded shoes during rehearsal.","zh":"舞者在排练时用带衬垫的鞋保护脚底。"}]}],"synonyms":["soles (of the feet)","foot soles","foot bottoms"],"phonetic":"/ˈpɛl.mɑː.tə/","extraExplanation":["“pelmata”不是常见的标准英语词汇；如果你是在英语文章里看到它，往往是作者借用/音译希腊语「πέλματα」（脚底，复数）。在普通英语里更常用的表达是“the soles of (your) feet”或“foot soles”。","如果你想查的是别的词，常见的相近拼写有：pelmet（窗帘幔头/帘头板）、Palmyra（巴尔米拉）、palpate（触诊）。你可以告诉我它出现的句子，我能更准确判断。"]}
{"word":"pelmatic","summary":{"en":"“pelmatic” isn’t standard English; it’s likely a misspelling (often of “problematic” or “pneumatic”).","zh":"“pelmatic”不是标准英语；很可能是拼写错误（常见是把 “problematic” 或 “pneumatic” 拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or mishearing of another word (commonly “problematic” or “pneumatic”).","zh":"不是标准英语单词；通常是拼写/听写错误（常见想写的是 “problematic” 或 “pneumatic”）。"},"examples":[{"en":"I think you meant “problematic,” not “pelmatic.”","zh":"我觉得你想写的是 “problematic”，不是 “pelmatic”。"},{"en":"If you’re talking about air pressure tools, the word is “pneumatic.”","zh":"如果你在说气压工具，那个词是 “pneumatic”。"}]}],"phonetic":"/pɛlˈmætɪk/","extraExplanation":["“pelmatic”在常见词典里一般查不到，写作和学术语境中也不常用。更像是把某个常见词拼错了。","两个最常见的可能目标词：\n1) problematic（有问题的、棘手的），常用于讨论“某做法/说法/情况有问题”。\n2) pneumatic（气动的、充气的），常用于“pneumatic drill（风钻）/pneumatic tires（充气轮胎）”。","如果你能提供句子原文或你想表达的意思（例如“有问题的”还是“气动的”），我可以帮你确认最可能的正确拼写并给出更贴近语境的用法。"]}
{"word":"pelmatogram","summary":{"en":"A rare technical word meaning a footprint or sole impression/record.","zh":"较少见的专业词，指“足印/脚掌印痕或记录”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A footprint or an impression/record of the sole of a foot (human or animal), especially one studied in biology, paleontology, or forensic contexts.","zh":"足印；脚掌（脚底）的印痕或记录（人或动物），常用于生物学、古生物学或法医学等语境。"},"examples":[{"en":"The researcher photographed the pelmatogram to compare it with other tracks in the sand.","zh":"研究人员拍摄了这个足印（pelmatogram），用来与沙地里的其他足迹进行比较。"},{"en":"In forensic work, a clear pelmatogram can help estimate a person’s foot size and gait.","zh":"在法医学中，清晰的足印（pelmatogram）有助于推测一个人的脚码和步态。"},{"en":"The museum display included pelmatograms showing how ancient animals walked.","zh":"博物馆展览中有足印（pelmatogram），展示古代动物如何行走。"}]}],"synonyms":["footprint","track","footprint impression","shoeprint","paw print"],"phonetic":"/ˌpɛl.məˈtoʊ.ɡræm/","extraExplanation":["这个词比较少见，多见于较专业的学术写作（如足迹学/遗迹化石研究、动物行为研究或法庭科学）。日常英语更常说 footprint / track / (shoe) print。","词源上常被分析为 pelma-（希腊语，意为“脚底/脚掌”）+ -gram（“记录、图样”），字面意思就是“脚底的记录/印痕”。"]}
{"word":"pelmatozoa","summary":{"en":"Spermatozoa are sperm cells (male reproductive cells), the plural of spermatozoon.","zh":"spermatozoa 指精子（男性生殖细胞），是 spermatozoon 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of spermatozoon; the male reproductive cells (sperm cells) that can fertilize an egg","zh":"spermatozoon（精子）的复数；男性生殖细胞（精子），可与卵子结合完成受精"},"examples":[{"en":"Under a microscope, you can see spermatozoa moving with their tails.","zh":"在显微镜下，你可以看到精子用尾巴游动。"},{"en":"The lab tested the number and movement of spermatozoa in the sample.","zh":"实验室检测了样本中精子的数量和运动情况。"}]}],"synonyms":["sperm (common, less formal/less technical)"],"phonetic":"/ˌspɝːməˈzoʊə/","extraExplanation":["“pelmatozoa”不是常见或标准的英语词形，很可能是把 **spermatozoa** 拼错了。标准单数是 **spermatozoon**（一个精子），复数是 **spermatozoa**（多个精子）。","词源来自希腊语：*sperma*（种子）+ *zoon*（动物/生物）。在医学与生物学语境中很常见，在日常口语里更常说 **sperm**。"]}
{"word":"pelmatozoan","summary":{"en":"A pelmatozoan is a (usually fossil) stalked echinoderm, especially a crinoid like a sea lily; the term also reflects an older classification.","zh":"pelmatozoan 指（多见于化石记录中的）有柄棘皮动物，尤指海百合等海百合类；该词也带有旧分类体系的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stalked echinoderm (especially a crinoid such as a sea lily); more broadly, a member of the former group Pelmatozoa.","zh":"有柄的棘皮动物（尤指海百合等海百合纲动物）；更广义地指旧分类“有柄亚门（Pelmatozoa）”的成员。"},"examples":[{"en":"Fossil pelmatozoans are common in some Paleozoic limestone beds.","zh":"在某些古生代石灰岩地层中，有柄棘皮动物的化石很常见。"},{"en":"The researcher compared pelmatozoan body plans with modern crinoids to infer how early echinoderms fed.","zh":"研究者将有柄棘皮动物的体型结构与现代海百合作比较，以推断早期棘皮动物如何取食。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to pelmatozoans or to a stalked, attached lifestyle among echinoderms.","zh":"与有柄棘皮动物有关的；（棘皮动物中）与有柄、固着生活方式相关的。"},"examples":[{"en":"This layer preserves pelmatozoan remains alongside trilobites.","zh":"这一地层同时保存了有柄棘皮动物遗骸和三叶虫化石。"}]}],"synonyms":["crinoid","sea lily","stalked echinoderm"],"phonetic":"ˌpɛl.məˈtoʊ.zoʊ.ən","extraExplanation":["“Pelmatozoa”是较旧的分类概念，常用来涵盖以“有柄、固着”为典型特征的一些棘皮动物类群；现代分类里更常直接使用“crinoid（海百合类）”等更具体的名称。","词源上可拆为 pelmato-（与“柄/固着”相关）+ -zoan（动物），因此整体含义可理解为“有柄的动物（类群）”。"]}
{"word":"pelmatozoic","summary":{"en":"Pelmatozoic describes stalked, attached echinoderms (especially crinoids/sea lilies) or things related to them.","zh":"pelmatozoic 指“有柄、固着的棘皮动物（尤其海百合）及其相关事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Paleontology, zoology) Relating to pelmatozoans—stalked echinoderms such as sea lilies (crinoids)—especially in their attached, stalked life stage.","zh":"（古生物/动物学）与“有柄类棘皮动物”有关的，尤其指像海百合（海百合纲/海百合类 crinoids）那样带柄、固着生活阶段的。"},"examples":[{"en":"Many fossils in this limestone bed are pelmatozoic, including crinoid stems.","zh":"这层石灰岩里有许多有柄类化石，包括海百合的柄节。"},{"en":"The museum display contrasts pelmatozoic crinoids with free-swimming forms.","zh":"博物馆展览把有柄生活的海百合与自由游动的类型作对比。"}]}],"synonyms":["crinoid-related","p elmatozoan (related form)"],"phonetic":"ˌpɛlmətoʊˈzoʊɪk","extraExplanation":["这个词比较少见，主要出现在古生物学/无脊椎动物学语境里。它来自希腊语词根：pelma（“脚底/基座”之意，引申为“附着”）+ zoo-（“动物”）+ -ic（形容词后缀）。","学习时可以把它理解成“stalked/attached echinoderm-related（与带柄、固着的棘皮动物相关）”。在英文文章中更常见的相关词是 crinoid（海百合）以及 pelmatozoan（有柄类棘皮动物）。"]}
{"word":"pelmet","summary":{"en":"A pelmet is a decorative piece above a window that hides the curtain rod/rail and the top of the curtains.","zh":"pelmet 指窗户上方的装饰性窗帘挡板/窗幔，用来遮住窗帘杆或轨道及窗帘顶部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative board or strip of fabric placed above a window to cover the curtain rail/rod and the top of the curtains.","zh":"（窗户上方的）窗帘挡板/窗幔：装在窗户顶部，用来遮住窗帘杆/轨道和窗帘上缘的装饰板或布条。"},"examples":[{"en":"The pelmet hides the curtain rod and makes the window look more finished.","zh":"窗帘挡板把窗帘杆遮住了，让窗户看起来更完整、更有装饰感。"},{"en":"They chose a wooden pelmet painted white to match the walls.","zh":"他们选了一个刷成白色的木质窗帘挡板来搭配墙面。"}]}],"synonyms":["valance"],"phonetic":"/ˈpɛlmɪt/","extraExplanation":["pelmet 在英式英语里更常见；在美式英语中更常用的说法是 valance（窗幔）。不过 pelmet 往往更强调“硬质/有支撑的挡板”，而 valance 通常指“布质的短窗帘/装饰帘”。","常见搭配：a wooden pelmet（木质挡板）、a fabric pelmet（布质挡板）、to fit/install a pelmet（安装挡板）、pelmet board（挡板板材）。"]}
{"word":"pelmets","summary":{"en":"“Pelmets” are decorative window-top coverings that hide curtain rails/rods, common in British English.","zh":"“Pelmets”指窗户上方的帘头装饰，用来遮住窗帘轨道/窗帘杆，英式英语中较常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative board or fabric frame above a window that hides the curtain rail/rod and curtain hooks; a type of window top covering (often called a “valance” in American English).","zh":"（窗户上方的）帘头板/帘头布，用来遮住窗帘轨道（或窗帘杆）与挂钩的装饰性挡板；一种窗饰（美式英语常称为 valance）。"},"examples":[{"en":"The living room curtains have pelmets to hide the curtain rods.","zh":"客厅的窗帘有帘头来遮住窗帘杆。"},{"en":"They replaced the old pelmets with a simple wooden design.","zh":"他们把旧帘头换成了简洁的木质款式。"}]}],"synonyms":["valances","window valances","curtain valances","cornices","window cornices"],"phonetic":"/ˈpɛlmɪts/","extraExplanation":["“pelmets”是“pelmet”的复数形式，在英式英语中更常见；在美式英语里，最接近的常用说法是“valance”。","词源上与法语有关，最初指一种罩在床或窗上方、用于装饰和遮挡的织物/结构。"]}
{"word":"pelo","summary":{"en":"“Pelo” is a Spanish noun meaning “hair/fur,” and informally it can mean “a little bit” (as in “un pelo”).","zh":"“pelo”是西语名词，意思是“头发/毛”；口语中也可表示“一点点”（如 un pelo）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) hair; also fur (on an animal).","zh":"（西语）头发；（动物的）毛、皮毛。"},"examples":[{"en":"Tiene el pelo negro y rizado.","zh":"他/她有一头黑色卷发。"},{"en":"El perro suelta mucho pelo en primavera.","zh":"那只狗在春天掉很多毛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, informal) a tiny amount; a little bit (often in “un pelo”).","zh":"（西语，口语）一点点；稍微（常见于 un pelo）。"},"examples":[{"en":"Estoy un pelo cansado.","zh":"我有点累。"},{"en":"Baja un pelo el volumen, por favor.","zh":"请把音量稍微调小一点。"}]}],"synonyms":["cabello","vello","pelaje"],"phonetic":"/ˈpeɪloʊ/","extraExplanation":["“Pelo”在西语里常和“cabello”对比：cabello更偏“头发”（更中性/正式），pelo既可指头发也常指动物毛。","常见表达：\n- “un pelo”＝“一点点/稍微”（语气很口语）。\n- “a pelo”（西班牙更常见）可表示“直接地、不加修饰地”，也可指“赤裸/不穿戴保护”。具体含义要看语境。","在某些较旧或固定用法里，“pelo”也可能是“por el”的缩合（相当于“经过/沿着……”），但现代日常交流中不算常见，更多会用“por el”。"]}
{"word":"pelobates","summary":{"en":"Pelobates is a scientific genus name for European spadefoot toads.","zh":"Pelobates 是“欧洲锄足蟾属”的学名（属名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of spadefoot toads found mainly in Europe and parts of western Asia, known for burrowing and living much of their lives underground","zh":"（蟾蜍科/锄足蟾类中的）欧洲锄足蟾属：主要分布于欧洲及西亚部分地区的一类锄足蟾，擅长掘土，常年多在地下生活"},"examples":[{"en":"Scientists surveyed wetlands to map where Pelobates still breeds each spring.","zh":"科学家调查湿地，以绘制欧洲锄足蟾属每年春季仍在何处繁殖。"},{"en":"Because Pelobates species burrow, they are hard to spot outside the rainy season.","zh":"由于欧洲锄足蟾属的物种会掘洞潜居，非雨季很难见到它们。"}]}],"synonyms":["spadefoot toad (genus)"],"phonetic":"/ˌpiːləˈbeɪtiːz/","extraExplanation":["“Pelobates”是生物分类学里的拉丁化属名，常见于学术文章、物种名（双名法）和自然纪录片解说中。","词源来自希腊语：pelos（泥、泥沼）+ bates（行走者），大意是“在泥里行走的动物”，贴合它们在潮湿土壤中活动、并用后足的“锄状突起”快速掘洞的习性。","常见相关词：spadefoot toad（锄足蟾/锄足蛙，泛称）；在欧美也可能与 North American spadefoots（北美锄足蟾，其他属）区分开来。"]}
{"word":"pelobatid","summary":{"en":"Pelobatid means “related to (or a member of) the spadefoot-toad family Pelobatidae.”","zh":"pelobatid 指“与铲足蟾科（Pelobatidae）有关的”，或“铲足蟾科的一员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to the family Pelobatidae (a group of burrowing frogs/toads often called spadefoot toads).","zh":"（形容词）与铲足蟾科（Pelobatidae，一类善于掘土的蛙/蟾，常称“铲足蟾/铲足蛙”）有关的。"},"examples":[{"en":"Pelobatid species often spend much of the year underground in dry habitats.","zh":"铲足蟾科的物种常在干旱环境中一年大部分时间待在地下。"},{"en":"The museum has a display on pelobatid adaptations for digging.","zh":"博物馆有一个展区介绍铲足蟾科动物适应掘土的特征。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) An animal that belongs to the family Pelobatidae; a pelobatid (spadefoot) toad/frog.","zh":"（名词）铲足蟾科动物；一种铲足蟾/铲足蛙。"},"examples":[{"en":"After heavy rain, a pelobatid may emerge to feed and breed.","zh":"暴雨过后，铲足蟾科动物可能会出来觅食并繁殖。"},{"en":"The researcher photographed a pelobatid near a temporary pond.","zh":"研究人员在一处临时水塘旁拍到了一只铲足蟾科动物。"}]}],"synonyms":["spadefoot toad","spadefoot frog","pelobatid toad"],"phonetic":"/ˌpɛləˈbeɪtɪd/","extraExplanation":["“pelobatid”来自科名 Pelobatidae（铲足蟾科）。这类动物后足常有类似“铲子”的硬质结构，便于快速掘土躲避干旱与高温。","日常英语里更常见的说法是 spadefoot toad / spadefoot frog（铲足蟾/铲足蛙）；“pelobatid”更偏学术、生物分类学用词。"]}
{"word":"pelobatidae","summary":{"en":"Pelobatidae is the scientific family name for spadefoot toads—burrowing amphibians mainly found in Europe and nearby regions.","zh":"Pelobatidae 指“铲足蛙科”，是一类会掘洞的两栖动物（常称铲足蟾/铲足蛙），主要分布在欧洲及其邻近地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of burrowing frogs commonly called spadefoot toads, found mainly in Europe and parts of Asia and North Africa (scientific name: Pelobatidae).","zh":"一种会掘洞生活的蛙类科，常被称为“铲足蟾/铲足蛙”（Pelobatidae，铲足蛙科），主要分布在欧洲以及亚洲和北非的部分地区。"},"examples":[{"en":"Pelobatidae species spend much of the year underground to avoid dry conditions.","zh":"铲足蛙科的物种一年中有很长时间会待在地下，以躲避干旱环境。"},{"en":"In field guides, Pelobatidae are often described as “spadefoot toads” because of the hard, spade-like structure on their hind feet.","zh":"在野外图鉴里，铲足蛙科常被称为“铲足蟾/铲足蛙”，因为它们后足有坚硬、像小铲子的结构。"}]}],"synonyms":["spadefoot toads (common name)"],"phonetic":"/ˌpiːloʊˈbætɪdiː/","extraExplanation":["“Pelobatidae”是动物分类学中的“科名”（family name），写作时通常首字母大写并用斜体的是属名/种名（如 Pelobates fuscus），而“Pelobatidae”一般不需要斜体。","英文常见名“spadefoot toads”在不同地区有时也会指另一个近缘类群（如北美的 Scaphiopodidae）。阅读资料时可以留意其地理分布或拉丁学名来确认指的是哪一科。"]}
{"word":"pelobatoid","summary":{"en":"Pelobatoid means “spadefoot-toad-related or spadefoot-like,” used mostly in scientific contexts.","zh":"Pelobatoid 指“与铲足蟾有关或类似铲足蟾的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling spadefoot toads (family Pelobatidae) or similar burrowing frogs/toads.","zh":"与铲足蟾（铲足蟾科 Pelobatidae）有关的；或形态/习性上类似铲足蟾等掘洞型蛙蟾类的。"},"examples":[{"en":"Scientists described the fossil as having pelobatoid features, suggesting a burrowing lifestyle.","zh":"科学家描述这块化石具有铲足蟾类（pelobatoid）的特征，暗示它可能过着掘洞的生活。"},{"en":"In the field guide, the tadpoles are compared with pelobatoid species to aid identification.","zh":"在野外图鉴中，这些蝌蚪会与铲足蟾类（pelobatoid）物种作比较，以帮助鉴定。"}]},{"partOfSpeech":"n.","definition":{"en":"A frog or toad that belongs to, or is considered similar to, the spadefoot-toad group.","zh":"（较少用）指铲足蟾类群中的蛙/蟾，或被认为与铲足蟾类群相近的蛙/蟾个体。"},"examples":[{"en":"The collection includes several pelobatoids from arid regions.","zh":"这份馆藏包括几种来自干旱地区的铲足蟾类（pelobatoids）。"}]}],"synonyms":["spadefoot-like","Pelobatidae-related"],"phonetic":"/ˌpɛləˈbeɪtɔɪd/","extraExplanation":["这是一个比较“学术/专业”的词，常见于动物学、两栖类研究、古生物学论文或标本描述中；日常英语里更常用的是 spadefoot toad（铲足蟾）。","词形中的 -oid 表示“……状/类似……”，因此 pelobatoid 大致可理解为“像 Pelobates（铲足蟾属）那样的”。"]}
{"word":"pelodytes","summary":{"en":"Pelodytes is the scientific genus name for European parsley frogs.","zh":"Pelodytes 是欧洲“欧芹蛙”（parsley frogs）的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small European frogs known as parsley frogs (family Pelodytidae).","zh":"（生物学）欧洲一种小型蛙类的属名：欧芹蛙属（Pelodytes，隶属欧芹蛙科 Pelodytidae）。"},"examples":[{"en":"Scientists recorded Pelodytes calling from temporary ponds after spring rains.","zh":"科学家记录到春雨过后，欧芹蛙属（Pelodytes）的蛙在临时水塘里鸣叫。"},{"en":"In some field guides, Pelodytes is listed under the common name “parsley frogs.”","zh":"在一些野外图鉴中，Pelodytes 会以“欧芹蛙（parsley frogs）”这个俗名出现。"}]}],"synonyms":["parsley frog (common name)"],"phonetic":"/ˌpɛləˈdaɪtiːz/","extraExplanation":["“Pelodytes”是拉丁化的学名（属名），日常英语里不常见，多出现在动物学、生态学或野外调查报告中。","常见对应的英文俗名是“parsley frog（欧芹蛙）”，名字来自它们皮肤上常见的绿色斑点，外观有点像欧芹碎。","学名词源可追溯到希腊语词根：pēlos（泥）+ dytes（潜水者/入水者），可理解为“爱在泥里活动的（蛙）”。"]}
{"word":"pelodytid","summary":{"en":"“pelodytid” doesn’t appear to be a standard English word; it’s likely a misspelling or a name/technical term.","zh":"“pelodytid”看起来不是标准英语单词；更可能是拼写错误或专有名词/技术术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a specialized term/name. Please check the spelling or share the sentence where you saw it.","zh":"这不是标准英语单词，可能是拼写错误，或是某个专业术语/名称。请核对拼写，或把它出现的句子发来。"},"examples":[{"en":"I couldn’t find “pelodytid” in a dictionary—could it be spelled differently?","zh":"我在词典里找不到“pelodytid”，会不会是拼写不一样？"},{"en":"Can you share the full sentence with “pelodytid” so I can guess the intended word?","zh":"你能把包含“pelodytid”的整句发给我吗？我可以帮你推测想表达的词。"}]}],"phonetic":"/ˌpɛləˈdiːtɪd/","extraExplanation":["从拼写结构看，“pelodytid”不太像常见英语词形（例如常见后缀 -tion、-ment、-ity 等）。更可能是：①键盘误打/漏字；②某个专有名词（人名、用户名、游戏/软件名）；③某个学科里的缩写或拉丁/希腊词根拼写变体。","你可以先做两步：1）确认大小写与是否有连字符（如 Pelo-dy-tid）；2）提供来源（网页/书/论文）和上下文，我能据语境给出最可能的正确词以及对应释义。"]}
{"word":"pelodytidae","summary":{"en":"Pelodytidae is a scientific term for the frog family that includes the parsley frogs (Pelodytes).","zh":"Pelodytidae 是一个学名，指包含“欧芹蛙”（Pelodytes 属）的青蛙科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small European frogs known as parsley frogs (genus Pelodytes).","zh":"一种欧洲小型青蛙的科名，称为“欧芹蛙科/香芹蛙科”（属：Pelodytes）。"},"examples":[{"en":"Pelodytidae includes the parsley frogs found in parts of southwestern Europe.","zh":"欧芹蛙科包括分布在欧洲西南部部分地区的欧芹蛙。"},{"en":"In a field guide, Pelodytidae may be listed separately from true frogs (Ranidae).","zh":"在野外图鉴中，欧芹蛙科可能会与“真蛙科”（Ranidae）分开列出。"}]}],"synonyms":["parsley frog family"],"phonetic":"/pəˌloʊdɪˈtaɪdi/","extraExplanation":["这是一个生物分类学术语（两栖类：无尾目的一科）。日常英语里不常用，更常见的说法是“parsley frog（欧芹蛙）”。","词源上常见于动物科名：以属名 Pelodytes 加上 -idae（表示“……科”）构成。读到拉丁学名时，通常把它当作单数名词使用（例如：“Pelodytidae is …”在学术写作中也能见到）。"]}
{"word":"pelodytoid","summary":{"en":"“pelodytoid” doesn’t appear to be a standard English word; it’s likely a misspelling or a niche term.","zh":"“pelodytoid”不像是标准英语词，更可能是拼写错误或小众专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling or a very specialized technical term. Please share the sentence or field (e.g., geology, biology) so I can identify the intended word.","zh":"这不是常见词典中的标准英语词；可能是拼写错误或非常专业的术语。请提供句子或所属领域（如地质、生物等），我才能更准确判断你想表达的词。"},"examples":[{"en":"I couldn’t find “pelodytoid” in a dictionary—could it be spelled differently?","zh":"我在词典里找不到“pelodytoid”——会不会是拼写不一样？"},{"en":"Can you show me the sentence where you saw “pelodytoid”?","zh":"你能给我看看你在哪个句子里看到“pelodytoid”吗？"}]}],"phonetic":"ˌpɛləˈdaɪtɔɪd","extraExplanation":["从构词上看，末尾的“-oid”常表示“……状 / 类似……的”（如 asteroid=小行星，“星状的”）。你输入的词可能原本是某个以“-oid”结尾的专业词，但中间部分拼错了。","如果你想表达与“泥/黏土”相关的词，可能在找：peloid（治疗用泥）、peloidal（泥状的）。如果你想表达“旋律”的词，可能是：melody（旋律）。","把你看到它的原句（或截图）发我，我可以根据上下文推断最可能的正确拼写与含义。"]}
{"word":"peloid","summary":{"en":"A therapeutic mineral-rich mud or clay used in spa/medical treatments.","zh":"用于水疗或理疗的富含矿物质的疗养泥/黏土。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural mud or clay (often mixed with mineral or thermal water) used for therapeutic treatments, such as mud baths or body wraps.","zh":"（疗养用的）泥疗泥/矿泥：一种天然泥或黏土（常与矿泉水或温泉水混合），用于治疗或保健，如泥浴、泥敷。"},"examples":[{"en":"The spa offers a peloid wrap to soothe sore muscles.","zh":"这家水疗中心提供矿泥裹敷，用来缓解肌肉酸痛。"},{"en":"Doctors sometimes recommend peloid therapy for certain joint problems.","zh":"医生有时会建议用泥疗来辅助改善某些关节问题。"}]}],"synonyms":["therapeutic mud","medicinal mud","healing clay"],"phonetic":"/ˈpiːlɔɪd/","extraExplanation":["“peloid”常见于医学与温泉疗法相关语境（balneology 温泉疗法/矿泉疗法）。词源来自希腊语 pelos，意为“泥”。在不同地区，peloid 可能指泥炭泥（peat）、黏土或含矿物质的湖泥等，通常强调其用于理疗/康复而非普通泥土。"]}
{"word":"pelomedusa","summary":{"en":"Pelomedusa is a scientific genus name for African freshwater side‑necked turtles, often called African helmeted turtles.","zh":"Pelomedusa 是非洲淡水侧颈龟的一个科学属名，常称“非洲盔甲龟/非洲侧颈龟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of freshwater side‑necked turtles (family Pelomedusidae) native to Africa, commonly known as African helmeted turtles","zh":"非洲淡水侧颈龟的一属（骨甲龟科），常被称为“非洲盔甲龟/非洲侧颈龟”"},"examples":[{"en":"Pelomedusa turtles pull their heads sideways into the shell instead of straight back.","zh":"Pelomedusa 属的龟把头向侧面缩进壳里，而不是像一些龟那样直接向后缩。"},{"en":"Some people keep Pelomedusa as a pet, but it needs clean water and proper UVB lighting.","zh":"有人饲养 Pelomedusa 作宠物，但它需要干净的水质和合适的 UVB 灯光。"}]}],"synonyms":["African helmeted turtle(s)","helmeted turtle(s)"],"phonetic":"/ˌpɛloʊməˈdjuːsə/","extraExplanation":["“Pelomedusa”是科学属名（拉丁化形式），日常英语里更常见的说法是“African helmeted turtle(s)”或在宠物圈里简称“helmeted turtle”。","词源上常被解释为来自希腊语的“pēlos（泥）”与“Medusa（美杜莎）”，用来暗示这种龟常栖息在泥水环境、外形也较有“盔甲感”。","分类学会随研究更新：你可能会在旧资料里看到把多种不同分布的个体都归到同一个物种名下，新的文献有时会进一步区分。"]}
{"word":"pelomedusid","summary":{"en":"Pelomedusid refers to a member of, or something related to, the turtle family Pelomedusidae (African side‑necked turtles).","zh":"Pelomedusid 指侧颈龟科（Pelomedusidae，非洲侧颈龟类）的成员，或与该科相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A turtle belonging to the family Pelomedusidae (African side‑necked turtles).","zh":"（名词）侧颈龟科（Pelomedusidae）的一种龟；通常指非洲侧颈龟类群的成员。"},"examples":[{"en":"Pelomedusids are side‑necked turtles found mainly in Africa.","zh":"Pelomedusid（侧颈龟科成员）主要分布在非洲。"},{"en":"The museum exhibit compares pelomedusids with other freshwater turtles.","zh":"博物馆展览把侧颈龟科成员与其他淡水龟作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to or characteristic of the family Pelomedusidae.","zh":"（形容词）与侧颈龟科（Pelomedusidae）有关的；具有该科特征的。"},"examples":[{"en":"Researchers described several pelomedusid species from fossil shells.","zh":"研究人员根据化石龟壳描述了几种侧颈龟科物种。"},{"en":"This paper focuses on pelomedusid anatomy and habitat.","zh":"这篇论文聚焦侧颈龟科的解剖特征与栖息地。"}]}],"synonyms":["Pelomedusidae (member)","African side-necked turtle (general)"],"phonetic":"ˌpɛloʊməˈduːsɪd","extraExplanation":["“pelomedusid”多见于动物学/古生物学写作中，是由科名 Pelomedusidae 派生出来的形容词/名词，用来泛指“侧颈龟科的（动物）”。","侧颈龟（side‑necked turtles）在收头时会把头向一侧弯进壳内，而不是像常见的“隐颈龟”那样向后缩回。","你输入的“pelomedusid”属于较专业词汇；在一般科普语境中也可能直接说 “African side‑necked turtle(s)”（非洲侧颈龟）。"]}
{"word":"pelomedusidae","summary":{"en":"Pelomedusidae: a family of African freshwater side-necked turtles.","zh":"Pelomedusidae：非洲淡水侧颈龟科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of African freshwater turtles known as African side-necked turtles (they bend the neck sideways rather than pulling it straight back into the shell).","zh":"一种主要分布于非洲的淡水龟科，常称“非洲侧颈龟”（缩颈时把脖子向侧面弯曲，而不是直直缩回龟壳里）。"},"examples":[{"en":"Pelomedusidae are African side-necked turtles that often live in rivers, ponds, and wetlands.","zh":"Pelomedusidae（非洲侧颈龟科）常生活在河流、池塘与湿地中。"},{"en":"In a reptile guide, Pelomedusidae may be listed under the side-necked turtles (Pleurodira).","zh":"在爬行动物图鉴里，Pelomedusidae 可能会被归在侧颈龟类（Pleurodira）之下。"}]}],"synonyms":["African side-necked turtles","pelomedusid turtles"],"phonetic":"/ˌpɛloʊmɪˈduːsɪdi/","extraExplanation":["词源提示：Pelomedusidae 是生物分类学名称，来自属名 Pelomedusa（常见的代表是“非洲头盔龟/非洲泥龟”等）加上动物“科”的拉丁化后缀 -idae（表示“……科”）。","学习用法：这类词多用于科普、动物学或宠物爬虫语境，写作时通常首字母大写（Pelomedusidae），复数形式与单数相同（作“一个科”时也常用单数）。"]}
{"word":"pelomedusoid","summary":{"en":"pelomedusoid = Pelomedusa/Pelomedusidae-like; related to African side‑necked turtles.","zh":"pelomedusoid = 类似或相关于 Pelomedusa／侧颈龟科（非洲侧颈龟类）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology, herpetology) Resembling or related to Pelomedusa or the Pelomedusidae family (African side‑necked turtles).","zh":"（动物学／爬虫学）类似于或与 Pelomedusa（非洲侧颈龟属）或侧颈龟科 Pelomedusidae 有关的。"},"examples":[{"en":"The fossil shell was described as pelomedusoid because it matched side‑necked turtle features.","zh":"这块化石龟甲被描述为 pelomedusoid，因为它符合侧颈龟的一些特征。"},{"en":"Some skull traits suggest a pelomedusoid affinity rather than a cryptodire turtle lineage.","zh":"一些头骨特征显示它可能更接近 pelomedusoid（侧颈龟类群），而不是隐颈龟的谱系。"}]}],"synonyms":["pelomedusid-like","side-necked turtle–like","pleurodiran-like"],"phonetic":"/ˌpiːloʊmɪˈduːsɔɪd/","extraExplanation":["这个词比较少见，主要出现在学术写作（如古生物学、系统分类、形态学描述）里。词尾 -oid 表示“……状／类似……”，因此 pelomedusoid 的核心意思就是“像 Pelomedusa 或像侧颈龟科那样的”。","Pelomedusa 常被称为“非洲侧颈龟”（African side-necked turtle）。侧颈龟（Pleurodira）与常见的隐颈龟（Cryptodira）不同，缩头时会把脖子向侧边弯折，而不是直直缩回壳里。"]}
{"word":"pelomyxa","summary":{"en":"Pelomyxa is a genus of very large amoebas found in low-oxygen freshwater mud.","zh":"Pelomyxa 是一种生活在低氧淡水淤泥中的大型变形虫属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of very large amoebas that live in oxygen-poor freshwater mud or sediment (often discussed in biology for their unusual cell structure and symbiotic microbes).","zh":"（生物）Pelomyxa：一种生活在淡水淤泥或沉积物等低氧环境中的大型变形虫属（常因其独特的细胞结构与共生微生物而被研究）。"},"examples":[{"en":"In the biology lab, we observed Pelomyxa moving slowly through the sediment.","zh":"在生物实验室里，我们观察到 Pelomyxa 在沉积物中缓慢移动。"},{"en":"Pelomyxa is often mentioned in lessons about protists and life in low-oxygen habitats.","zh":"在讲解原生生物和低氧栖息地生命的课程中，经常会提到 Pelomyxa。"}]}],"synonyms":["(no common everyday synonyms; related: amoeba, protist, Amoebozoa)"],"phonetic":"ˌpɛloʊˈmɪksə","extraExplanation":["词源小提示：名称常被解释为与“泥/黏土”（pelo-）有关，暗示它常见于泥状环境；在教材或科普中，它有时被用作“超大型变形虫”的例子。","在更深入的生物学语境中，Pelomyxa 之所以出名，还因为它的细胞内可能有与其共生的微生物；这也是研究“低氧环境如何维持生命活动”的一个切入点。"]}
{"word":"pelon","summary":{"en":"“pelon” is an informal Spanish-origin word meaning a bald person, often used as a nickname (especially in Mexican Spanish).","zh":"“pelon”源自西班牙语的非正式说法，意思是“光头的人”，常被当作外号（尤其在墨西哥西语中）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish, informal) A bald person; someone with very short or shaved hair.","zh":"（源自西班牙语，非正式）光头的人；头发剃得很短/几乎没有头发的人。"},"examples":[{"en":"He shaved his head, and his friends started calling him “pelon.”","zh":"他把头剃光了，朋友们就开始叫他“pelon”（光头）。"},{"en":"In some Mexican communities, “pelon” is used as a casual nickname.","zh":"在一些墨西哥社区里，“pelon”常被当作随意的外号来用。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname or name used for someone (often referring to their bald look), and sometimes used as a surname.","zh":"（常因“光头”特征而来的）绰号/名字；有时也用作姓氏。"},"examples":[{"en":"People knew him as Pelon, but his real name was Miguel.","zh":"大家都叫他Pelon，但他本名是Miguel。"}]}],"synonyms":["baldy","bald person","shaved-head (informal)"],"phonetic":"/pəˈloʊn/","extraExplanation":["“pelón”（常写作带重音的 pelón）在墨西哥西班牙语里很常见，字面意思接近“光头/剃得很短的人”。在英语对话中出现时，通常是借用西语社群的称呼。","语气通常偏随意、玩笑或昵称，但是否冒犯取决于语境与关系亲疏；不熟的人之间最好避免直接用外貌取绰号。","如果你看到的是“Pelón/Pelon”作为专有名词（外号、艺名、网名），一般不翻译，按名字理解即可。"]}
{"word":"pelopaeus","summary":{"en":"Pelopaeus is a scientific name for a genus of mud-dauber wasps.","zh":"Pelopaeus 是泥壶蜂属的学名，指一类会用泥筑巢的独居蜂。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a genus of mud-dauber wasps (family Sphecidae) that build nests from mud and often stock them with paralyzed spiders for their larvae to eat.","zh":"泥壶蜂属（蛛蜂科 Sphecidae 的一个属）：一种会用泥筑巢的独居蜂类，常把被麻痹的蜘蛛等猎物放进巢里，作为幼虫的食物。"},"examples":[{"en":"Pelopaeus wasps collect mud to build small pot-like nests on walls or under eaves.","zh":"泥壶蜂属的蜂会采集泥土，在墙面或屋檐下筑起小壶状的巢。"},{"en":"Researchers identified the specimen as Pelopaeus based on its body shape and nesting behavior.","zh":"研究人员根据体型与筑巢行为，将该标本鉴定为泥壶蜂属（Pelopaeus）。"}]}],"synonyms":["mud dauber (wasp)","Sphecid wasp"],"phonetic":"/ˌpɛləˈpiːəs/","extraExplanation":["“Pelopaeus”通常首字母大写，因为它是生物分类学中的“属名”（genus）。你输入的“pelopaeus”小写也常见于随手输入或非正式文本中。","词源上常被认为与希腊语中表示“泥”的词根有关（和它们用泥筑巢的习性相关）。","在日常英语里，人们更常说“mud dauber (wasp)”来泛指这类用泥筑巢的蜂；Pelopaeus是其中的一个更具体的分类名称。"]}
{"word":"pelopea","summary":{"en":"“pelopea” is not a recognized common English word; it’s likely a misspelling (possibly of “Penelope”) or a proper name.","zh":"“pelopea”不是常见英语词，可能是拼写错误（如“Penelope”）或某个专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a proper name (for example, you may have meant “Penelope”). If you share a sentence or where you saw it, I can confirm the intended word and meaning.","zh":"不是标准英语单词。更可能是拼写错误或专有名词（例如你可能想写“Penelope”）。如果你提供原句或出处，我可以帮你确认想表达的词和含义。"},"examples":[{"en":"I couldn’t find “pelopea” in a standard English dictionary—do you mean “Penelope”?","zh":"我在常见英语词典里找不到“pelopea”——你是想写“Penelope”吗？"},{"en":"Can you paste the sentence that contains “pelopea” so I can interpret it correctly?","zh":"你能把包含“pelopea”的句子贴出来吗？这样我能更准确地理解它。"}]}],"extraExplanation":["“pelopea”很可能是拼写误差。最常见的相近词是专有名词“Penelope”（珀涅罗珀/佩内洛普），源自希腊神话《奥德赛》：她以忠诚与耐心著称，现代英语里常用作女性名字。","也可能是某些学名/品牌名/用户名（例如拉丁学名或产品名），这类词不一定收录在普通英语词典里；提供你看到它的网页、图片或上下文会更好判断。"]}
{"word":"pelopid","summary":{"en":"Pelopid means a descendant of Pelops, or something related to Pelops and his mythic family line.","zh":"Pelopid 指珀洛普斯的后裔，或与珀洛普斯及其神话家族血统相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a descendant of Pelops (especially the royal family line in Greek myth, including Atreus and Agamemnon).","zh":"（希腊神话中）珀洛普斯（Pelops）的后裔；尤指其王族血统（如阿特柔斯、阿伽门农等）。"},"examples":[{"en":"In some retellings, Agamemnon is described as a Pelopid prince.","zh":"在一些改写版本中，阿伽门农被称为“珀洛普斯王族（Pelopid）的王子”。"},{"en":"The tragedy focuses on the curse that follows the Pelopids.","zh":"这部悲剧聚焦于缠绕珀洛普斯家族后裔（Pelopids）的诅咒。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pelops or to the mythic family descended from him.","zh":"与珀洛普斯有关的；与其神话后裔家族有关的。"},"examples":[{"en":"Pelopid legends often involve family conflict and revenge.","zh":"与珀洛普斯家族有关的传说常常涉及家族冲突与复仇。"},{"en":"The play uses Pelopid history as a background for its moral questions.","zh":"该剧以珀洛普斯家族的往事为背景来提出道德问题。"}]}],"synonyms":["Pelopian","Atreid (related term in myth)"],"phonetic":"/ˈpɛləpɪd/","extraExplanation":["“Pelopid”来自人名 Pelops（珀洛普斯）+ 表示“……的后代/相关”的后缀 -id（常见于神话或家族称谓，如 Atreid ‘阿特柔斯之子/后裔’）。","在古希腊悲剧传统里，“Pelopids”常用来指“阿特柔斯家族（House of Atreus）”这一支系，相关作品常见于《阿伽门农》《俄瑞斯忒亚》等故事圈。"]}
{"word":"pelopidae","summary":{"en":"Pelopidae is a biological family name for solitary mud-nesting wasps, often called mud-daubers.","zh":"Pelopidae 指泥壶蜂科：一类独居、用泥筑巢的胡蜂，常被称为泥壶蜂/泥蜂（mud-daubers）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of solitary wasps (often called mud-daubers) that build nests from mud and commonly stock them with spiders or other insects for their larvae","zh":"泥壶蜂科（常被称为“泥蜂/泥壶蜂、泥壶蜂类”）：一类独居蜂，常用泥巴筑巢，并把蜘蛛或其他昆虫储存在巢里供幼虫取食"},"examples":[{"en":"Some Pelopidae wasps build small mud cells under eaves or bridges.","zh":"有些泥壶蜂科的蜂会在屋檐下或桥底筑起小小的泥巢室。"},{"en":"A Pelopidae female may paralyze spiders and place them in the nest as food for her young.","zh":"泥壶蜂科的雌蜂可能会麻痹蜘蛛，并把它们放进巢里作为幼虫的食物。"}]}],"synonyms":["mud-dauber wasps","mud wasps"],"phonetic":"/pəˈlɑːpɪdiː/","extraExplanation":["“Pelopidae”是昆虫分类学中的“科名”，在科普或学术语境里常见；日常英语更常用更直观的称呼如“mud-dauber (wasp)”（泥壶蜂/泥蜂）。","这类蜂通常对人不主动攻击，更多是在附近寻找泥土、捕猎蜘蛛并筑巢；因此在住宅周围看到泥巢并不一定意味着高危险性。"]}
{"word":"Peloponnese","summary":{"en":"The Peloponnese is a major peninsula in southern Greece, famous in ancient history.","zh":"伯罗奔尼撒半岛是希腊南部的重要半岛，在古代历史中非常著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large peninsula in southern Greece, connected to the mainland by the Isthmus of Corinth; known for important ancient sites like Sparta, Olympia, and Mycenae.","zh":"希腊南部的大半岛（伯罗奔尼撒半岛），通过科林斯地峡与希腊本土相连；以斯巴达、奥林匹亚、迈锡尼等古代遗址闻名。"},"examples":[{"en":"We traveled across the Peloponnese to visit Olympia and Mycenae.","zh":"我们穿越伯罗奔尼撒半岛，参观了奥林匹亚和迈锡尼。"},{"en":"Ancient Sparta was located in the Peloponnese.","zh":"古代斯巴达位于伯罗奔尼撒半岛。"},{"en":"The Peloponnese played a major role in many events of classical Greek history.","zh":"伯罗奔尼撒半岛在古典希腊历史的许多事件中扮演了重要角色。"}]}],"synonyms":["Morea (historical)"],"phonetic":"/ˌpɛləˈpɑːniːz/","extraExplanation":["词源提示：Peloponnese 来自希腊语“Pelopónnēsos”，常被解释为“佩洛普斯（Pelops）的岛/半岛”。虽然它是“半岛”，但在古代和近代的一些语境中仍会用类似“岛”的传统称呼。","文化与历史背景：英语里常见搭配是 the Peloponnese（加定冠词）。它与“伯罗奔尼撒战争”（Peloponnesian War，雅典与斯巴达为主的战争）密切相关，在历史、文学与政治讨论中经常出现。","别名：在中世纪和奥斯曼时期的文献中，这一地区有时被称为 Morea（摩里亚），阅读历史材料时可能会遇到。"]}
{"word":"peloponnesian","summary":{"en":"Peloponnesian means “from or related to the Peloponnese (southern Greece),” and can also refer to a person from there.","zh":"Peloponnesian 指“伯罗奔尼撒（希腊南部）相关的”，也可指“伯罗奔尼撒人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Peloponnese, the large peninsula in southern Greece.","zh":"与伯罗奔尼撒（希腊南部的大半岛）有关的；伯罗奔尼撒的。"},"examples":[{"en":"We visited several Peloponnesian towns, including Nafplio and Sparta.","zh":"我们参观了几个伯罗奔尼撒的城镇，包括纳夫普利奥和斯巴达。"},{"en":"Peloponnesian archaeology includes Mycenaean palaces and ancient theaters.","zh":"伯罗奔尼撒的考古学包含迈锡尼宫殿与古代剧场。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Peloponnese.","zh":"伯罗奔尼撒人；来自伯罗奔尼撒的人。"},"examples":[{"en":"Some Peloponnesians moved to Athens for work in the 20th century.","zh":"一些伯罗奔尼撒人于20世纪为工作迁往雅典。"}]}],"synonyms":["Peloponnesian (regional adjective; no close common synonym)"],"phonetic":"/ˌpɛləpəˈniʒən/","extraExplanation":["“Peloponnesian”在英语里常因“Peloponnesian War（伯罗奔尼撒战争）”而为人熟知：公元前431—404年，雅典（以提洛同盟为核心）与斯巴达（以伯罗奔尼撒同盟为核心）之间的长期战争。","词源上来自“Peloponnese（伯罗奔尼撒）”，可理解为“佩洛普斯（Pelops）的岛/半岛”。现代地理上它通过科林斯地峡与希腊大陆相连；修建科林斯运河后看起来更像一座“岛”。"]}
{"word":"pelops","summary":{"en":"Pelops is a character from Greek mythology, a hero-king whose name is also linked to the Peloponnese region of Greece.","zh":"Pelops 是希腊神话中的人物（英雄/国王），他的名字也与希腊的伯罗奔尼撒地区有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A figure in Greek mythology: the son of Tantalus and a famous hero-king, whose story is connected to chariot racing, royal power, and the family line that later includes Atreus and Agamemnon.","zh":"希腊神话人物：坦塔罗斯（Tantalus）之子、著名的英雄/国王；他的故事与战车竞赛、王权以及后来包含阿特柔斯（Atreus）与阿伽门农（Agamemnon）的家族谱系有关。"},"examples":[{"en":"In Greek myth, Pelops won a kingdom through a dangerous chariot race.","zh":"在希腊神话中，Pelops 通过一场危险的战车赛赢得了王国。"},{"en":"The tragedies about the House of Atreus trace their family curse back to Pelops.","zh":"关于“阿特柔斯家族”的悲剧常把家族诅咒的源头追溯到 Pelops。"}]},{"partOfSpeech":"n.","definition":{"en":"The name-source (eponym) of the Peloponnese, the large peninsula in southern Greece.","zh":"伯罗奔尼撒（Peloponnese，希腊南部大半岛）的“同名来源人物/命名来源”。"},"examples":[{"en":"The Peloponnese is traditionally linked to Pelops in ancient Greek legend.","zh":"在古希腊传说中，伯罗奔尼撒通常与 Pelops 联系在一起。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"ˈpiːlɑːps","extraExplanation":["Pelops 的神话最常见的情节包括：他与奥诺马俄斯（Oenomaus）国王的战车竞赛，以及与马车夫米耳提洛斯（Myrtilus）相关的背叛与“诅咒”母题；这些元素在后来的希腊悲剧传统中很重要。","在古典文学中，Pelops 常见于品达（Pindar）的颂歌与围绕“阿特柔斯家族”的叙事背景中；现代读者通常会在介绍希腊悲剧（如《阿伽门农》相关故事线）时遇到这个名字。"]}
{"word":"peloria","summary":{"en":"Peloria is a rare floral abnormality where a usually two-sided (bilateral) flower becomes radially symmetrical.","zh":"Peloria 指一种罕见的花部畸变：原本两侧对称的花变为放射对称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A botanical condition in which a flower that is usually bilaterally symmetrical becomes radially symmetrical (often with extra or repeated petals/spurs).","zh":"（植物学）一种畸变现象：原本应为左右对称（两侧对称）的花，变成放射对称（辐射对称），常伴随花瓣或距等结构增多或重复。"},"examples":[{"en":"The researcher documented peloria in snapdragons, where the flower became more evenly shaped around the center.","zh":"研究人员记录了金鱼草的“整齐花”现象：花朵围绕中心变得更均匀对称。"},{"en":"Peloria can appear as a rare mutation, sometimes triggered by genetic changes or developmental disruption.","zh":"整齐花可能作为一种罕见突变出现，有时与基因变化或发育过程受干扰有关。"}]}],"synonyms":["pelorism"],"phonetic":"/pəˈlɔriə/","extraExplanation":["词源与背景：peloria 来自希腊语 pelōrios，意为“巨大、怪异”。在植物学里用来指“本来不该这么对称，却变得异常规则/放射对称”的花形变化。","相关术语：pelorism（整齐化/整齐花现象）是更常见的学术用词；peloria 常被当作该现象或其结果的名称。"]}
{"word":"pelorian","summary":{"en":"Pelorian describes a usually abnormal flower form that becomes radially symmetrical instead of its normal bilateral symmetry.","zh":"Pelorian 指花形出现异常，从原本的两侧对称变为辐射对称（规则对称）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describing a flower that has become radially symmetrical (regular) even though the species normally has bilateral (two-sided) symmetry; related to the abnormal form called “peloria.”","zh":"（植物学）指花本应是两侧对称（左右对称），却异常地变成辐射对称（规则对称）的；与“peloria（佩洛里亚畸形/正花化）”相关。"},"examples":[{"en":"In some orchids, a rare pelorian flower can appear with a more regular, star-like shape.","zh":"在一些兰花中，偶尔会出现罕见的 pelorian（正花化）花，形状更规则，像星形。"},{"en":"The breeder noticed a pelorian bloom and saved it for further study.","zh":"育种者注意到一朵 pelorian 的花，于是将它保留下来做进一步研究。"}]}],"synonyms":["peloric","actinomorphic (in effect/appearance)"],"phonetic":"/pəˈlɔriən/","extraExplanation":["“pelorian”来自名词“peloria”，指一种发育上的变异：原本应呈左右对称的花（常见于唇形科、兰科等）变成更“规则”的辐射对称。园艺圈有时会把这种现象称为“正花化/返祖式的规则化”，但它并不一定更“好”，只是形态变异。","学习提示：更常见的对应形容词是“peloric”。“pelorian”较少见，多出现在专业或特定语境里。"]}
{"word":"pelorias","summary":{"en":"Pelorias are peloria flowers—abnormally regular, radially symmetric flowers that usually occur when a normally irregular flower becomes regular.","zh":"Pelorias 指 peloria 的复数：花的整齐化畸变，常见于原本不规则（两侧对称）的花变为规则（放射对称）的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abnormally regular (radially symmetric) flowers, especially when a normally irregular flower becomes regular due to a developmental change; the plural of peloria.","zh":"花的“整齐化”畸变（尤其指原本不规则、两侧对称的花变成规则、放射对称的花）；为 peloria 的复数。"},"examples":[{"en":"In this snapdragon population, a few plants produced pelorias with five similar petals instead of the usual irregular shape.","zh":"在这群金鱼草中，有些植株长出了 pelorias（整齐化畸变花），花瓣变成五片相似，而不是常见的不规则形态。"},{"en":"The researcher recorded pelorias as evidence of a mutation affecting flower symmetry.","zh":"研究者记录了这些 pelorias，用来作为影响花对称性的突变证据。"}]}],"synonyms":["peloria (singular)","radialization (in flower symmetry context)"],"phonetic":"/pəˈlɔriəz/","extraExplanation":["peloria 是植物学术语，常用来讨论“花的对称性”：许多花正常是两侧对称（zygomorphic），而出现 peloria 时会变成放射对称（actinomorphic），看起来更“规整”。","该词源自希腊语，原意与“怪物/异常”相关，用来强调这种形态改变在自然形态中比较少见。现代语境多为中性科学描述。","在遗传学与发育生物学里，peloria 常被当作研究花器官发育与基因调控（例如决定花对称性的基因网络）的线索。"]}
{"word":"peloriate","summary":{"en":"A rare botanical verb meaning to make a normally irregular flower become unusually radially symmetrical (peloric).","zh":"一个少见的植物学动词，指使原本不规则/两侧对称的花异常地变成辐射对称（peloric）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Botany) To become peloric (radially symmetrical) or to cause a flower to become peloric—showing an unusual, regular symmetry in a plant group that normally has an irregular flower shape.","zh":"（植物学）使花变成“辐射对称的（peloric）”，或（花）变成辐射对称：指原本多为两侧对称/不规则的花，出现异常的规则对称形态。"},"examples":[{"en":"In some orchids, a mutation can peloriate the flower, making the petals look more evenly arranged.","zh":"在一些兰花中，突变可能使花发生 peloriate（辐射对称化），让花瓣看起来更均匀地排列。"},{"en":"Gardeners noticed that a few blooms had peloriated after unusual growing conditions.","zh":"园丁注意到在异常的生长条件后，有几朵花出现了 peloriated（辐射对称化）的现象。"}]}],"synonyms":["become peloric","develop peloria","pelorize (rare)"],"phonetic":"/pəˈlɔːriˌeɪt/","extraExplanation":["这是一个非常少见、偏专业的植物学词，来自名词 peloria（“花的辐射对称化畸变/返祖现象”）。常见讨论场景包括兰科、唇形科等本来多为两侧对称（zygomorphic）的花，偶尔出现近似“规则花”（actinomorphic）的形态。","在一般英语写作里更常见的是形容词 peloric（辐射对称的）或名词 peloria；动词 peloriate 多出现在学术论文、植物形态学描述或园艺/育种记录中。"]}
{"word":"peloric","summary":{"en":"Peloric describes an unusually regular, radially symmetrical form, especially in organisms that are normally irregular (commonly used in botany).","zh":"Peloric 指异常规则、呈放射对称的形态，尤用于描述原本不规则的生物（常见于植物学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having an unusually regular, radially symmetrical form, especially when the species is normally irregular in shape (e.g., a flower that becomes more evenly symmetrical than usual).","zh":"（植物学/动物学）呈现异常规则的放射对称形态；尤指原本形态不规则的物种出现“变得更规则、更对称”的形态（如本应不对称的花变得更对称）。"},"examples":[{"en":"The botanist described a peloric flower that showed near-perfect radial symmetry.","zh":"植物学家描述了一朵“变得更规则”的（peloric）花，呈现近乎完美的放射对称。"},{"en":"Peloric forms are rare but useful for studying how symmetry develops in plants.","zh":"peloric 形态虽然罕见，但有助于研究植物对称性如何形成。"}]}],"synonyms":["radially symmetrical","regular","actinomorphic"],"phonetic":"/pəˈlɔrɪk/","extraExplanation":["“peloric”来自名词“peloria/ pelorism”，在植物学里常见于讨论“花的对称性异常”。例如某些唇形花（原本左右对称）偶尔会出现更接近放射对称的变异，这种现象就会用 peloric 来形容。","学习提示：它是比较学术/专业的词，日常英语很少用；在科普文章或论文中更常见。与之相关的常见概念是“对称性（symmetry）”和“放射对称（radial symmetry）”。"]}
{"word":"pelorism","summary":{"en":"Pelorism is a botanical abnormality in which a usually bilateral flower becomes radially symmetrical.","zh":"Pelorism 指植物（尤指花）的畸变：原本左右对称的花变为放射对称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal change in a plant (especially a flower) where it becomes radially symmetrical, often producing a “regular,” more rounded form instead of its usual left-right (bilateral) symmetry","zh":"（尤指花的）畸变：原本左右对称的花变成放射对称，外形更“规则”、更圆整的现象"},"examples":[{"en":"In some snapdragons, pelorism makes the flower look unusually round and symmetrical.","zh":"在一些金鱼草中，畸变（pelorism）会让花看起来异常圆整、呈放射对称。"},{"en":"The researcher documented pelorism after the plant was exposed to unusual growing conditions.","zh":"研究人员记录到，这株植物在异常生长条件下出现了畸变（pelorism）。"}]}],"synonyms":["floral abnormality","radialization"],"phonetic":"/ˈpiːləˌrɪzəm/","extraExplanation":["Pelorism 主要是植物学/发育生物学用语，常用来描述“本来不规则的两侧对称花”变成“规则的放射对称花”。经典例子常出现在金鱼草（snapdragon）等花上。","在英语里它属于较专业、较少见的词，日常语境中更常用的是 “abnormal flower form（异常花形）”“radial symmetry（放射对称）” 这类表达。"]}
{"word":"pelorization","summary":{"en":"Pelorization is a botanical term for a flower developing an unusually radially symmetrical (peloric) form.","zh":"Pelorization 指花在植物学中出现正形化：花形异常变为辐射对称（正形花）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) the process in which a flower develops an unusually regular, radially symmetrical form (a “peloric” flower), often instead of its typical bilateral symmetry.","zh":"（植物学）花朵出现“正形化/辐射对称化”的过程：花变得异常规则、呈辐射对称（正形花/辐射对称花），常见于本来应为左右对称的花型。"},"examples":[{"en":"In some snapdragons, a mutation can cause pelorization, producing flowers that look more radially symmetrical than usual.","zh":"在一些金鱼草中，突变可能导致正形化，使花朵看起来比平常更接近辐射对称。"},{"en":"Researchers tracked pelorization to understand how genes control flower shape during development.","zh":"研究人员追踪正形化现象，以理解基因如何在发育过程中控制花的形态。"}]}],"synonyms":["formation of peloric flowers","radialization (in flower symmetry, informal)","developmental symmetry change (broad)"],"phonetic":"/ˌpɛl.ə.rəˈzeɪ.ʃən/","extraExplanation":["“pelorization”来自“peloric（正形的/辐射对称的）”。“peloric”一词与“peloria”有关，历史上常用来描述本应左右对称（如唇形花）却变成近似辐射对称的“异常花型”。","在进化与发育生物学（evo-devo）里，正形化常被用作研究“花的对称性如何被基因调控”的经典现象；某些调控对称性的基因表达改变时，就可能出现这种形态变化。","这是相对专业的植物学术语，日常英语中很少使用；更常见的说法是“peloric flower（正形花/辐射对称异常花）”或直接说“a flower becomes radially symmetric（花变成辐射对称）”。"]}
{"word":"pelorize","summary":{"en":"“Pelorize” isn’t standard; it’s usually a misspelling of “polarize.”","zh":"“pelorize”不是标准词；通常是把“polarize（两极化/偏振）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Usually a misspelling of “polarize.”","zh":"（非标准英语词）通常是把 “polarize” 拼错了。"},"examples":[{"en":"I couldn’t find “pelorize” in a dictionary—did you mean “polarize”?","zh":"我在词典里找不到 “pelorize”——你是不是想写 “polarize”？"}]},{"partOfSpeech":"vt.","definition":{"en":"If you mean “polarize”: to cause people or opinions to separate into two strongly opposing groups; or (in science) to make light/electrical waves vibrate mainly in one direction.","zh":"如果你想写的是 “polarize”：使人群/观点分裂成两大强烈对立的阵营；或（科学）使光/电磁波主要沿一个方向振动（偏振）。"},"examples":[{"en":"The debate polarized the community.","zh":"这场辩论让社区两极分化。"},{"en":"Social media can polarize public opinion.","zh":"社交媒体可能会让公众舆论两极化。"},{"en":"These sunglasses polarize light and reduce glare.","zh":"这种太阳镜能让光偏振，从而减少眩光。"}]}],"synonyms":["polarize","divide","split","make (people) take sides"],"phonetic":"ˈpoʊləˌraɪz","extraExplanation":["“polarize”在日常英语里最常见的语境是社会议题（politics / culture / debates）导致“立场两极化”。在科学语境里则常见于光学（polarized light）、摄影（polarizing filter）和材料/电学。","如果你能提供一句包含“pelorize”的原句或截图，我也可以帮你判断它是否是专有名词、拼写变体，或是某个领域的术语。"]}
{"word":"pelorized","summary":{"en":"“Pelorized” describes (or is the past form of) a flower that has changed into an unusual radially symmetrical (peloric) form.","zh":"“pelorized”指（或表示已发生）花形异常变化：原本左右对称的花变成不寻常的辐射对称（peloric）形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having become peloric—an unusual flower form in which a normally two-sided (bilateral) flower develops radial (all-around) symmetry.","zh":"（植物学）变成“辐射对称花”（peloric）的；指原本左右对称的花出现异常变形，变为四周均匀对称。"},"examples":[{"en":"The orchid produced a pelorized bloom with petals arranged more evenly around the center.","zh":"这株兰花开出了一朵 pelorized（辐射对称化的）花，花瓣更均匀地围绕着中心排列。"},{"en":"Researchers documented several pelorized flowers in the population after a sudden temperature shift.","zh":"研究人员记录到在气温骤变后，这个种群中出现了几朵 pelorized 的花。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of pelorize: to make or become peloric (radially symmetrical) in flower form.","zh":"pelorize 的过去式/过去分词：使（花）出现 peloric（辐射对称）形态；或（花）变为辐射对称形态。"},"examples":[{"en":"The mutation pelorized some of the plant’s flowers.","zh":"这个突变使这株植物的一些花发生了 pelorized（辐射对称化）。"},{"en":"In this cultivar, flowers may be pelorized under stress.","zh":"在这种栽培品种中，花在压力条件下可能会 pelorized（变成辐射对称）。"}]}],"synonyms":["peloric","radially symmetrical (in form)","peloria (related term)"],"phonetic":"/ˈpɛləˌraɪzd/","extraExplanation":["“pelorized / pelorize”主要出现在植物学与园艺语境，尤其常见于兰花、金鱼草等关于“花形异常/返祖/突变”的描述。","“peloric / peloria（辐射对称化现象）”指本来应是左右对称（zygomorphic）的花，变得像许多原始或不同类群的花那样呈放射对称（actinomorphic）。","词源上与希腊语词根有关，带有“异常、怪异”的含义；因此它通常暗示一种不常见的形态变化，而不一定是“更好看”或“更健康”。"]}
{"word":"pelorizing","summary":{"en":"Polarizing means causing strong division into opposing sides; it can also refer to the process of polarizing light.","zh":"Polarizing 指“造成强烈对立与分裂（两极化）”；也可指“使光偏振”的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing people to split into two strongly opposing groups or opinions; creating sharp disagreement.","zh":"使人们分裂成两大对立阵营的；引发尖锐分歧的。"},"examples":[{"en":"The new policy is polarizing—some people love it, while others strongly oppose it.","zh":"这项新政策很具争议、很“分裂”——有人很喜欢，也有人强烈反对。"},{"en":"Social media can be polarizing because it often shows extreme opinions.","zh":"社交媒体可能很容易造成两极分化，因为它常常推送极端观点。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of polarize: to make opinions, groups, or positions move further apart; (also) to arrange light waves to vibrate in one direction.","zh":"polarize 的现在分词：使观点/群体更加对立、差距更大；（也可指）使光发生偏振。"},"examples":[{"en":"The debate is polarizing the community.","zh":"这场辩论正在使社区的意见更加对立。"},{"en":"These sunglasses work by polarizing light to reduce glare.","zh":"这种太阳镜通过使光偏振来减少眩光。"}]}],"synonyms":["divisive","controversial","splitting","contentious"],"phonetic":"ˈpoʊləˌraɪzɪŋ","extraExplanation":["你输入的 “pelorizing” 很可能是拼写错误；英语里更常见、标准的拼写是 “polarizing”。","“polarizing” 在新闻与日常讨论中常用来形容“议题/人物很有争议，导致两极化”。在科学语境中则常与“polarized light（偏振光）”“polarizing filter（偏振滤镜）”连用。"]}
{"word":"pelorus","summary":{"en":"A pelorus is a shipboard instrument used to take visual bearings and determine direction.","zh":"pelorus 指船上用于目视测定目标方位的测向仪／测方位罗盘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a navigational instrument (a kind of bearing compass) used on a ship to take bearings of objects, usually by sighting them and reading their direction relative to the ship’s heading.","zh":"（航海）测向仪／测方位罗盘：船上用来测量目标方位的导航仪器，通常通过瞄准目标并读取其相对船首方向的角度来确定方位。"},"examples":[{"en":"The officer used the pelorus to take a bearing on the lighthouse.","zh":"大副用测向仪测定灯塔的方位。"},{"en":"With the ship’s compass and pelorus, they confirmed their course along the coast.","zh":"他们用船用罗盘和测向仪确认沿岸航向。"},{"en":"The pelorus was mounted near the bridge for quick visual bearings.","zh":"测向仪安装在驾驶台附近，便于快速目视测方位。"}]}],"synonyms":["bearing compass","azimuth circle","pelorus compass"],"phonetic":"/pəˈlɔrəs/","extraExplanation":["“Pelorus”一词据说源自古代航海传说中的领航员 Pelorus（常与汉尼拔或其时代的航行故事相关），后来用来指一种用于“测方位（bearing）”的船用仪器。现代航海中它常与磁罗盘、陀螺罗盘等配合使用，用来快速取得目标的方位角。"]}
{"word":"peloruses","summary":{"en":"“Peloruses” means multiple peloruses—shipboard instruments used to take compass bearings for navigation.","zh":"“peloruses”是“pelorus”的复数，指多台航海方位仪，用于测量罗盘方位角以进行导航。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pelorus: a navigational instrument (often a sighting device on a ship) used to take compass bearings of objects and help determine direction.","zh":"pelorus 的复数：一种航海导航仪器（常见于船上，用于瞄准取向），用来测量目标的罗盘方位角，帮助确定方向。"},"examples":[{"en":"The crew checked the peloruses to confirm the lighthouse’s bearing.","zh":"船员查看了几台 pelorus（方位仪），以确认灯塔的方位角。"},{"en":"On the bridge, peloruses are used alongside radar and GPS for safe navigation.","zh":"在驾驶台上，pelorus（方位仪）会与雷达和 GPS 一起用于安全航行。"}]}],"synonyms":["bearing instrument","sighting compass","bearing compass"],"phonetic":"/ˈpɛlɚəs/","extraExplanation":["“pelorus”常见于航海语境，指用于测方位（bearing）的器具。它不是日常英语高频词，多见于海事、航海训练、船舶操作手册等文本。","词源上常被解释为来自古代传说人物 Pelorus（与航海、指引有关的名字），因此带有“指路/定位”的文化联想。"]}
{"word":"pelota","summary":{"en":"“Pelota” most commonly means “ball” in Spanish, and it can also refer to the traditional Basque sport Basque pelota.","zh":"“pelota”在西班牙语里最常见是“球”，在一些语境中也指巴斯克传统运动“巴斯克佩洛塔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a ball; any round object used in games.","zh":"（西班牙语）球；用于游戏的球状物。"},"examples":[{"en":"The kids are playing with a pelota in the yard.","zh":"孩子们在院子里玩球。"},{"en":"Can you throw me the pelota?","zh":"你能把球扔给我吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Pelota: a traditional Basque ball sport (often played against a wall), also called Basque pelota.","zh":"佩洛塔：一种巴斯克传统球类运动（常对墙击球），也叫“巴斯克佩洛塔”。"},"examples":[{"en":"We watched a pelota match while traveling in northern Spain.","zh":"我们在西班牙北部旅行时看了一场佩洛塔比赛。"},{"en":"Basque pelota is fast and can be played with the hand, a paddle, or a curved basket.","zh":"巴斯克佩洛塔节奏很快，可以用手、球拍或弯曲的篮形工具击球。"}]}],"synonyms":["ball","Basque pelota"],"phonetic":"/pəˈloʊtə/","extraExplanation":["“pelota”在日常西班牙语里最常见的意思就是“球”。如果你在英文语境里看到它，很多时候是指“Basque pelota（巴斯克佩洛塔）”这项运动或相关比赛。","与英语的“ball”相比，“pelota”本身不带特定球类（如篮球、足球）的信息，具体指哪种球通常要看上下文。"]}
{"word":"pelotas","summary":{"en":"“Pelotas” most commonly refers to a city in southern Brazil; in Spanish it can also mean “balls” (plural of pelota) and, informally in some regions, “nonsense.”","zh":"“Pelotas”最常见指巴西南部城市名；在西班牙语中也可指“球”（pelota 的复数），并且在部分地区口语里可表示“胡说/扯淡”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in southern Brazil (in the state of Rio Grande do Sul).","zh":"巴西南部的一座城市（南里奥格兰德州）。"},"examples":[{"en":"Pelotas is known for its traditional sweets and local culture.","zh":"Pelotas 以传统甜点和当地文化闻名。"},{"en":"She studied in Pelotas before moving to Porto Alegre.","zh":"她先在 Pelotas 读书，后来搬到阿雷格里港。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) Plural of “pelota”: balls; small round objects used in games.","zh":"（西班牙语）“pelota”的复数：球；用于游戏的圆形物体。"},"examples":[{"en":"Los niños juegan con pelotas en el parque.","zh":"孩子们在公园里玩球。"},{"en":"Necesitamos dos pelotas para el entrenamiento.","zh":"我们训练需要两个球。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, informal in some regions) Nonsense; silly talk (used in expressions like “¡Qué pelotas!”).","zh":"（西语，部分地区口语）胡说八道；无聊的话（如“¡Qué pelotas!”表示“什么鬼话/真扯”）。"},"examples":[{"en":"¡Qué pelotas! Eso no tiene sentido.","zh":"真扯！那根本没道理。"},{"en":"No digas pelotas; dime la verdad.","zh":"别胡说；告诉我真相。"}]}],"synonyms":["(city) —","(Spanish: balls) balls","(Spanish: nonsense) nonsense","silly talk"],"phonetic":"/pəˈloʊtəs/","extraExplanation":["“Pelotas”在英语语境里常见为巴西城市名，因此读音常被英语化。若你是在学西班牙语，则它更常见是“pelota（球）”的复数。","西班牙语口语里“pelotas”在不同国家/地区可能有不同俚语含义；具体语气与是否粗鲁取决于当地用法与场合。"]}
{"word":"pelotherapy","summary":{"en":"Pelotherapy is mud-based therapy, often in spas, used for health or relaxation.","zh":"Pelotherapy 指以药用泥（矿泥/火山泥等）为基础的泥疗，常见于水疗与疗养场所，用于保健或放松。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A therapy that uses medicinal mud (or clay), usually applied to the body or used in mud baths, to help with pain, inflammation, skin conditions, or relaxation—often offered at spas or health resorts.","zh":"泥疗／泥浴疗法：使用具有疗效的泥（或黏土），通常敷在身体上或进行泥浴，以帮助缓解疼痛、炎症、皮肤问题或促进放松，常见于温泉与疗养院。"},"examples":[{"en":"The spa offers pelotherapy with warm mineral mud to relieve joint stiffness.","zh":"这家水疗中心提供温热矿泥泥疗，用来缓解关节僵硬。"},{"en":"Some people try pelotherapy as a natural treatment for chronic back pain.","zh":"有些人会尝试泥疗作为慢性背痛的自然疗法。"}]}],"synonyms":["mud therapy","mud bath therapy","peloid therapy"],"phonetic":"/ˌpɛloʊˈθɛrəpi/","extraExplanation":["词源：来自希腊语 pelós（“泥、淤泥”）+ -therapy（“疗法”）。","常见场景：欧洲与地中海地区的温泉小镇、疗养院（例如矿物泥/火山泥）。通常会把泥加热后敷在关节或全身，再配合温泉浴与按摩。","注意：泥疗并非适合所有人；若有皮肤破损、感染、心血管问题或孕期等情况，最好先咨询医生或专业人士。"]}
{"word":"peloton","summary":{"en":"Peloton most commonly means the main pack of riders in a cycling race; it can also refer to the Peloton fitness brand.","zh":"Peloton 常指自行车比赛中的主车群；也可指 Peloton 健身品牌/产品与订阅服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of cyclists (or other racers) traveling closely together in a race, mainly to reduce wind resistance (drafting).","zh":"（自行车等竞速比赛中的）主车群；紧密骑行/奔跑在一起的主要队伍（常为减少风阻而跟骑）。"},"examples":[{"en":"The peloton sped through the town, with a few riders trying to break away.","zh":"主车群高速穿过小镇，几名车手试图突围。"},{"en":"Staying in the peloton helps riders save energy for the final sprint.","zh":"留在主车群里能帮助车手省力，为最后冲刺蓄力。"},{"en":"She moved up inside the peloton to avoid getting boxed in near the back.","zh":"她在主车群中向前移动，避免在后方被“卡位”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often capitalized) A U.S. fitness company known for connected exercise bikes, treadmills, and subscription workout classes; also used to mean its products or membership.","zh":"（常大写）Peloton：美国一家以联网动感单车、跑步机及订阅制课程闻名的健身公司；也可指其产品或会员服务。"},"examples":[{"en":"He rides his Peloton three times a week and follows the live classes.","zh":"他每周骑三次 Peloton，并跟着直播课程练。"},{"en":"She canceled her Peloton subscription when she started running outdoors more.","zh":"她开始更多去户外跑步后，取消了 Peloton 的订阅。"}]}],"synonyms":["main pack","pack","group (in a race)","field (in racing)"],"phonetic":"/ˈpɛləˌtɑn/","extraExplanation":["“Peloton”来自法语，原意与“一群、一团”有关；在公路自行车赛中，它特指“主车群”。在这个语境里常搭配：stay in the peloton（留在主车群）、the peloton catches up（主车群追上来）、breakaway from the peloton（从主车群突围）。","注意大小写：小写 peloton 通常指比赛中的主车群；大写 Peloton 多指品牌/公司。"]}
{"word":"pelt","summary":{"en":"Pelt means an animal’s fur-covered skin, or to hit/attack by throwing things; it can also describe heavy rain or hail striking something.","zh":"pelt可指动物皮毛（兽皮）；作动词可指不断投掷东西攻击，也可形容雨或冰雹猛烈砸落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skin and fur of an animal (often after it has been removed), used especially for making clothing","zh":"（动物的）皮毛；兽皮（常指被剥下后用于制作衣物）"},"examples":[{"en":"The coat was made from rabbit pelts.","zh":"这件外套是用兔皮做的。"},{"en":"Trappers sold pelts at the market.","zh":"猎人把兽皮拿到市场上卖。"}]},{"partOfSpeech":"vt.","definition":{"en":"to throw something (often many small things) at someone or something repeatedly","zh":"反复向……投掷（常指许多小物体）"},"examples":[{"en":"The crowd pelted the bus with stones.","zh":"人群用石头朝公交车砸去。"},{"en":"Reporters pelted her with questions.","zh":"记者们连珠炮似地向她提问。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of rain, hail, etc.) to fall hard and fast, hitting with force","zh":"（雨、冰雹等）猛烈地落下；砸落"},"examples":[{"en":"Rain pelted the windows all night.","zh":"雨整夜猛烈地敲打着窗户。"},{"en":"Hail began to pelt down on the road.","zh":"冰雹开始噼里啪啦地砸在路上。"}]}],"synonyms":["hide","fur","skin","bombard","pummel"],"phonetic":"/pɛlt/","extraExplanation":["“pelt”作名词时常出现在与皮草相关的语境（如trapper 猎捕者、fur trade 皮草贸易）。在现代英语里，这个话题也常与动物保护和伦理消费相关。","“pelt”作动词有两种常见“引申”用法：①真实地“投掷砸向”；②比喻“用问题/批评猛攻”（pelt someone with questions/criticism）。"]}
{"word":"pelta","summary":{"en":"A pelta is a small, light ancient shield, often shown as crescent-shaped in Greek art.","zh":"pelta 指一种古代的小型轻盾，常在希腊艺术中呈新月形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, light shield, often crescent-shaped, used in ancient Greece and neighboring regions (commonly shown with Thracian warriors and Amazons in art).","zh":"（古代希腊及周边地区使用的）小型轻盾，常呈新月形（在色雷斯战士与亚马逊形象的艺术作品中很常见）。"},"examples":[{"en":"In the vase painting, the Amazon carries a pelta instead of a heavy round shield.","zh":"在那幅陶瓶画里，亚马逊战士拿的是pelta，而不是沉重的圆盾。"},{"en":"The museum label describes a bronze pelta from the 4th century BCE.","zh":"博物馆的说明牌介绍了一面公元前4世纪的青铜pelta。"}]}],"synonyms":["shield (general)","buckler (similar idea)"],"phonetic":"ˈpɛltə","extraExplanation":["“pelta”来自希腊语 pelte，常指一种轻便的小盾；在古典艺术中，它与“亚马逊（Amazons）”形象联系很强，因此在英文艺术史、考古与博物馆说明文字中较常见。","在装饰与图案领域也会看到“pelta”指“盾形/新月形”的装饰母题（motif），例如建筑或工艺品上的盾形纹样。"]}
{"word":"peltae","summary":{"en":"Peltae means “small light shields,” the plural of pelta, often mentioned in ancient Greek/Roman contexts.","zh":"peltae 指“轻小盾”的复数（pelta 的复数），多见于古希腊/古罗马相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, light shields (plural of pelta), especially the crescent-shaped shields used in ancient Greece and by Thracians or Amazons in art and literature","zh":"（pelta 的复数）小型轻盾，尤指古希腊、色雷斯人或艺术/文学中亚马逊战士常用的新月形轻盾"},"examples":[{"en":"In Greek vase paintings, Amazons are often shown carrying peltae.","zh":"在希腊陶瓶画中，亚马逊女战士常被画成手持 peltae（轻盾）。"},{"en":"The museum label described the weapons as spears and peltae.","zh":"博物馆说明牌把这些武器描述为长矛和 peltae（轻盾）。"}]}],"synonyms":["peltas","light shields","bucklers"],"phonetic":"ˈpɛltiː","extraExplanation":["peltae 是源自拉丁语/希腊语的复数形式（-ae 结尾常见于拉丁语阴性名词复数）。在英文里也有人直接用更普通的复数说法 “peltas”，但在历史、考古或古典学写作中更常见 peltae。","pelta（单数）通常指一种轻便的小盾，常被描述为新月形或半圆形；在古典艺术中，它和“亚马逊（Amazons）”形象联系很紧密，因此在阅读神话、史诗或博物馆展签时比较容易遇到。"]}
{"word":"peltandra","summary":{"en":"Peltandra is a genus of wetland aquatic plants (arrow arum) in the arum family.","zh":"Peltandra 是天南星科的一种湿地水生植物属，俗称 arrow arum（箭叶天南星/箭叶芋）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aquatic flowering plants in the arum family (Araceae), commonly called arrow arum, found in wetlands and shallow water (especially in eastern North America).","zh":"一种天南星科（Araceae）的水生开花植物属，常称“箭叶天南星/箭叶芋”（arrow arum），多生于湿地与浅水区（尤见于北美东部）。"},"examples":[{"en":"Peltandra often grows in marshes, with leaves that rise above the water.","zh":"Peltandra 常生长在沼泽里，叶片挺出水面。"},{"en":"In some wetlands, Peltandra provides shelter for small fish and insects.","zh":"在一些湿地中，Peltandra 会为小鱼和昆虫提供栖身之处。"}]}],"synonyms":["arrow arum","Peltandra virginica (a species name)"],"phonetic":"/pɛlˈtændrə/","extraExplanation":["“Peltandra”是植物学里的拉丁化属名，日常英语中并不常见；更常用的俗名是“arrow arum（箭叶天南星/箭叶芋）”。","该属在北美较常被提到的物种是 Peltandra virginica。它属于天南星科，花序为典型的“肉穗花序（spadix）+佛焰苞（spathe）”，外形与海芋、马蹄莲等同科植物有相似之处。","词源上常被解释为来自希腊语成分，含有“盾形/圆盾（pelt-）”与“雄蕊/雄性（-andra）”之意，指植物结构特征（属名多用于描述形态）。"]}
{"word":"peltast","summary":{"en":"A peltast is an ancient Greek light infantry soldier who fought mainly by skirmishing with javelins and carrying a small shield.","zh":"peltast 指古希腊的轻装步兵，常持小盾并以投掷标枪进行散兵骚扰战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light-armed soldier in ancient Greece (and later Hellenistic armies) who typically carried a small shield (a pelta) and threw javelins; used for fast, flexible skirmishing.","zh":"古希腊（及后来的希腊化军队）中的轻装步兵，通常携带小盾（pelta）并投掷标枪，主要负责快速机动的散兵战与骚扰。"},"examples":[{"en":"The general sent peltasts ahead to harass the enemy line with javelins.","zh":"将军派遣轻盾标枪兵在前方用标枪骚扰敌军阵线。"},{"en":"In many battles, peltasts were used to screen heavier infantry and protect their flanks.","zh":"在许多战役中，轻盾标枪兵常被用来掩护重装步兵并保护侧翼。"},{"en":"The historian describes peltasts moving quickly over rough ground where hoplites struggled.","zh":"史家描写轻盾标枪兵能在崎岖地形上快速行动，而重装步兵（方阵兵）则较为吃力。"}]}],"synonyms":["skirmisher","light infantry","javelineer"],"phonetic":"/ˈpɛl.tæst/","extraExplanation":["词源来自希腊语 peltē（一种小盾，常被描述为新月形或椭圆形）+ -ast（表示从事者/人员）。因此 peltast 字面上就是“持小盾的人”。","在英语历史叙述中，peltast 常与 hoplite（重装步兵/方阵兵）对比：前者更轻、更快，擅长投射与机动；后者更重、更擅长正面密集冲突。","你可能会在古典史写作里见到这个词，例如关于伯罗奔尼撒战争或色诺芬（Xenophon）相关叙述中，用来指代这种“散兵/轻步兵”角色。"]}
{"word":"peltasts","summary":{"en":"Peltasts were ancient Greek light infantry who used a small shield and javelins for fast skirmishing.","zh":"peltasts 指古希腊的轻装步兵（标枪散兵），持小盾并以机动骚扰作战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a lightly armed infantry soldier who carried a small shield (a pelte) and usually fought with javelins; often used for fast, flexible skirmishing.","zh":"古希腊的轻装步兵，通常携带一种小盾（pelta）并投掷标枪作战；常用于快速机动的散兵战（骚扰、牵制）。"},"examples":[{"en":"The general sent peltasts ahead to harass the enemy line with javelins.","zh":"将军派轻装标枪兵先行，用标枪骚扰敌军阵线。"},{"en":"Unlike heavy hoplites, peltasts relied on speed and distance rather than armor.","zh":"与重装的重步兵不同，轻装标枪兵更依靠速度与距离，而不是盔甲。"}]}],"synonyms":["skirmishers","light infantry","javelinmen"],"phonetic":"/ˈpɛl.tæsts/","extraExplanation":["“Peltasts”是复数形式；单数是“peltast”。词源来自希腊语“peltē”（一种轻便小盾）。在历史与文学叙述中，peltasts常被用来对比重装步兵（hoplites），强调“机动、投射、游击/散兵”风格的作战特点。"]}
{"word":"peltate","summary":{"en":"Peltate means “shield-like,” especially a leaf whose stalk attaches underneath near the center rather than at the edge.","zh":"peltate 意为“盾状的”，常指叶柄从叶片背面近中央处连接，而不是从叶缘连接。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describes a leaf (or similar structure) whose stalk attaches to the blade on the underside, away from the edge, often near the center—like an umbrella handle attaching to the canopy.","zh":"（植物学）盾状的；指叶片（或类似结构）的叶柄连接在叶片背面、离边缘一段距离处，常接近中央，像雨伞柄连在伞面中间。"},"examples":[{"en":"Nasturtium has peltate leaves, with the petiole attached near the center.","zh":"旱金莲的叶子是盾状叶，叶柄连接在叶片近中央的位置。"},{"en":"The peltate leaf shape helps water run off like an umbrella.","zh":"盾状叶的形状能像雨伞一样让水顺势流走。"}]}],"synonyms":["shield-shaped (approx.)","scutiform (technical)"],"phonetic":"/ˈpɛlˌteɪt/","extraExplanation":["“peltate”来自拉丁语 peltatus，源于 pelta（小盾牌）。因此它常用来描述“像盾牌一样”的结构，尤其在植物学里最常见。","注意区分：peltate（叶柄连在叶片背面、非边缘处） vs. palmate（掌状分裂，像手掌一样分成几裂）——两者很容易混淆。"]}
{"word":"peltated","summary":{"en":"Peltated describes a (usually plant) structure, especially a leaf, that connects near the center like a shield.","zh":"Peltated 指（多用于植物）结构，尤指叶片，叶柄连接在叶片近中央，形似盾牌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a leaf blade attached to the stalk near the center of the blade (not at the edge), often like a small shield.","zh":"（植物学）盾状叶的；叶柄连接在叶片中央或接近中央（而不是叶缘），形状常像小盾牌。"},"examples":[{"en":"Lotus leaves are peltated, with the stalk joining near the center of the leaf.","zh":"荷叶是盾状叶，叶柄连接在叶片接近中央的位置。"},{"en":"The field guide notes peltated leaves as an easy clue for identifying this species.","zh":"野外图鉴把“盾状叶”写作识别该物种的一个简单线索。"}]}],"synonyms":["peltate","shield-shaped (in sense)","umbilicate (in botany, related)"],"phonetic":"/ˈpɛlˌteɪtɪd/","extraExplanation":["“peltated”在现代英语里不如“peltate”常见，多见于植物学描述或较老/较正式的写法；含义基本相同。","词源来自拉丁语 pelta（小盾牌），所以可以用“像盾牌一样的叶子”来帮助记忆。"]}
{"word":"peltately","summary":{"en":"“Peltately” means “in a peltate way,” describing leaves attached by a stalk near the center of the underside.","zh":"“peltately”表示“以盾状方式”，指叶柄从叶片背面近中心处连接叶片。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a peltate manner: with a leaf (or similar structure) attached by its stalk near the center of the underside rather than at the edge.","zh":"以盾状（叶）方式：叶柄不是从叶缘而是从叶片背面近中心处连接叶片。"},"examples":[{"en":"The leaf is attached peltately, so the petiole joins the blade near its middle.","zh":"这片叶子是盾状着生的，所以叶柄连接在叶片近中央的位置。"},{"en":"In some aquatic plants, the round leaves sit peltately on long stalks.","zh":"在一些水生植物中，圆形叶片以盾状方式长在长叶柄上。"}]}],"synonyms":["peltate-ly (rare)","in a peltate manner"],"phonetic":"/ˈpɛl.tət.li/","extraExplanation":["“peltately”多见于植物学/生物学写作，来自形容词“peltate（盾状的）”。“peltate”源于拉丁语 pelt(a)（小盾牌），因为这类叶片看起来像一面盾牌，叶柄像盾牌背后的握把连接在中间附近。","常见对比：非盾状叶通常是叶柄连在叶片的边缘或基部（如多数普通树叶）；盾状叶则是“从背面中间插进去”。"]}
{"word":"peltatifid","summary":{"en":"A botanical term for a peltate leaf that is deeply cleft into lobes.","zh":"植物学术语：指盾状叶且叶片深裂成裂片的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describing a leaf that is peltate (the stalk attaches near the center of the blade) and also deeply split or cleft into lobes.","zh":"（植物学）形容叶片既为盾状叶（叶柄连接在叶片近中央），又深裂成裂片或裂叶的形态。"},"examples":[{"en":"The specimen has peltatifid leaves with deep, finger-like lobes.","zh":"该标本的叶片为盾状深裂，裂片深且呈指状。"},{"en":"In the field guide, the plant is identified by its peltatifid leaf shape.","zh":"在野外图鉴中，这种植物可通过其盾状深裂的叶形来辨认。"}]}],"synonyms":["peltate and deeply lobed","peltately cleft"],"phonetic":"/ˌpɛl.təˈtɪf.ɪd/","extraExplanation":["词源拆解有助记忆：peltate 表示“盾状的”（叶柄连接在叶片近中央，像小伞/盾牌），-fid 来自拉丁语，表示“裂开、分裂”（如 bifid=二裂）。peltatifid 就是“盾状 + 深裂”。","与相近词区分：lobed（浅裂/有裂片）通常裂得不深；-fid 往往表示裂得更深、更明显，但未必完全裂到叶柄处。"]}
{"word":"peltation","summary":{"en":"Peltation means the peltate (shield-like) attachment pattern in plants, where a stalk attaches near the center underside of a leaf.","zh":"peltation 指植物的“盾状”特征：叶柄从叶片背面靠近中心处连接，而不是从边缘连接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The condition or feature of being peltate—shaped like a shield, with the stalk (petiole) attached to the underside near the center rather than at the edge.","zh":"（植物学）盾状（peltate）的特征或状态：叶柄/柄部不是连在叶片边缘，而是连在叶片背面靠近中心的位置。"},"examples":[{"en":"The plant’s leaves show clear peltation, with the petiole attached near the middle of the blade.","zh":"这种植物的叶子具有明显的盾状特征，叶柄连接在叶片中部附近。"},{"en":"Researchers compared peltation in different aquatic plants to understand how leaf shape affects floating.","zh":"研究人员比较了不同水生植物的盾状特征，以了解叶形如何影响漂浮。"}]}],"synonyms":["peltate attachment","peltate condition","peltate morphology"],"phonetic":"/pɛlˈteɪʃən/","extraExplanation":["“peltation”较少见，多用于植物形态学写作；更常见的相关词是形容词“peltate（盾状的）”。它来自拉丁语“pelta（小盾牌）”，所以这个形状常被比喻为“盾牌”。在学习时可以把它理解为“叶柄从叶片背面中央‘撑起’叶子”。"]}
{"word":"peltatodigitate","summary":{"en":"A botanical adjective for leaves that are both peltate (petiole attaches near the center) and digitate (finger-like lobes/leaflets).","zh":"植物学形容词：指叶既呈盾状（叶柄近中央着生），又呈掌状/指状分裂（裂片或小叶呈手指状放射）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaves that combine features of peltate and digitate forms: the leaf stalk attaches near the center (peltate), and the blade is divided into finger-like lobes or leaflets (digitate).","zh":"（植物学）具“盾状（peltate）+掌状分裂（digitate）”特征的：叶柄连接在叶片近中央处，同时叶片呈手指状裂片或小叶放射状分开。"},"examples":[{"en":"The plant has peltatodigitate leaves, with the petiole attaching near the center and the blade split into several lobes.","zh":"这种植物的叶为peltatodigitate：叶柄几乎从叶片中央连接，叶片又分成数个裂片。"},{"en":"In the field guide, the species is described as having peltatodigitate foliage, which helps distinguish it from similar vines.","zh":"在野外图鉴中，该物种被描述为具有peltatodigitate的叶形，这有助于与相似藤本区分。"}]}],"synonyms":["peltate-digitate","peltate and digitate (descriptive phrase)"],"phonetic":"/ˌpɛl.tə.toʊˈdɪdʒ.ə.teɪt/","extraExplanation":["这是一个较少见的植物形态学形容词，通常出现在分类学描述、标本记录或植物志中。","词源上可拆为 peltate（盾状叶：叶柄连接在叶片近中央，像“盾牌”）+ digitate（掌状/指状：裂片或小叶像手指一样从一点向外放射）。","使用时多修饰 leaf/leaves 或 foliage，例如：peltatodigitate leaves。"]}
{"word":"pelted","summary":{"en":"Pelted means “hit or attacked repeatedly,” either by thrown objects or by heavy rain/hail; it’s the past form of pelt.","zh":"pelted 意为“被连续地砸/打”，可以指被人用东西投掷，也可以指雨、冰雹等猛烈拍打；是 pelt 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of pelt) to throw many small objects at someone or something repeatedly.","zh":"（pelt 的过去式/过去分词）用许多小东西连续地扔向某人或某物。"},"examples":[{"en":"The fans pelted the referee with paper cups.","zh":"球迷们用纸杯不断朝裁判扔去。"},{"en":"He was pelted with snowballs by his friends.","zh":"他的朋友们用雪球不停地砸他。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of pelt) to hit repeatedly and forcefully, especially of rain, hail, or wind-driven sand.","zh":"（pelt 的过去式/过去分词）（尤指雨、冰雹或风沙）猛烈而持续地击打。"},"examples":[{"en":"Rain pelted the windows all night.","zh":"雨整夜猛烈地拍打着窗户。"},{"en":"Hail pelted the roof, making a loud drumming sound.","zh":"冰雹砸在屋顶上，发出很大的咚咚声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) having a pelt (a thick animal skin with fur).","zh":"（较少见）有毛皮的；带皮毛的（指动物）。"},"examples":[{"en":"The hunter tracked a pelted animal through the woods. (rare)","zh":"猎人跟踪一只带皮毛的动物穿过树林。（罕见）"}]}],"synonyms":["bombarded","pummeled","battered","showered (with)","pelting (as adj., weather)"],"phonetic":"ˈpɛltɪd","extraExplanation":["“pelt”本义与“兽皮/毛皮（a pelt）”有关，但在现代更常用作动词，表示“连续投掷/猛击”。常见结构是“be pelted with + 名词”，如“be pelted with questions/insults/snowballs”。","描述天气时（rain/hail/sand pelted…）带有“又急又重、连续不断”的感觉，比普通的“hit”更有画面感。"]}
{"word":"pelter","summary":{"en":"Pelter usually means someone or something that pelts (throws objects repeatedly); less commonly, it can mean a fur hunter/trader.","zh":"Pelter 通常指反复投掷东西的人或物；较少见时也可指皮毛猎人或毛皮商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that pelts (throws things, often repeatedly).","zh":"投掷者；（反复）扔东西的人或物。"},"examples":[{"en":"A pelter in the crowd threw stones at the windows.","zh":"人群中有个投掷者朝窗户扔石头。"},{"en":"The machine acted like a pelter, firing small pellets into the target.","zh":"这台机器像个投掷器一样，把小弹丸射向靶子。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who hunts or trades animal pelts (fur skins).","zh":"（较少用）皮毛猎人；毛皮商。"},"examples":[{"en":"In older texts, a pelter might travel to sell furs in town.","zh":"在较早的文本里，pelter 可能指带着毛皮进城出售的人。"},{"en":"The museum exhibit described the life of a frontier pelter.","zh":"博物馆展览介绍了一位边境皮毛猎人的生活。"}]}],"synonyms":["thrower","stone-thrower","hurler","pelt trader","fur trader"],"phonetic":"/ˈpɛltɚ/","extraExplanation":["“pelter”来自动词“to pelt”（投掷；用……猛打）。在现代英语里更常见的是动词或短语，如“pelt someone with questions”（连珠炮似地提问）和“pelting rain/snow”（雨/雪下得很猛）；名词“pelter”本身相对少见，多出现在描写性语境或旧式用法中。"]}
{"word":"peltered","summary":{"en":"“Peltered” is a rare/older past tense form meaning “hit/bombarded repeatedly,” often treated as a variant of the more common “pelted.”","zh":"“peltered”是少见/较旧的形式，表示“反复击打、猛烈投掷（轰击）”，常被当作更常见的“pelted”的变体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) Past tense of **pelter**: to hit or throw things at someone/something repeatedly; to bombard.","zh":"（少见/古体）**pelter** 的过去式：反复击打或向……投掷东西；猛烈“砸/轰”。"},"examples":[{"en":"The protesters **peltered** the car with stones.","zh":"抗议者用石头不停地砸那辆车。"},{"en":"Hail **peltered** the roof all night.","zh":"冰雹整夜不停地砸在屋顶上。"}]},{"partOfSpeech":"other","definition":{"en":"Often seen as a spelling/usage variant of **pelted** (the much more common form).","zh":"常被视为 **pelted**（更常见的形式）的拼写/用法变体。"},"examples":[{"en":"In modern writing, you’ll usually see “**pelted** by rain,” not “peltered.”","zh":"在现代写作中，通常写“**pelted** by rain（被雨点猛打）”，而不是“peltered”。"}]}],"synonyms":["pelted","bombarded","battered","pummeled"],"phonetic":"ˈpɛltərd","extraExplanation":["“peltered”在现代英语里非常少见，多数情况下读者会以为你想写的是“pelted”（pelt 的过去式/过去分词）。如果你是在读较老的文本，偶尔会看到“pelter”作为动词（表示连续投掷、猛打），其过去式就会写成“peltered”。","常见搭配（更现代、更自然）：be pelted with/by rain/stones/questions（被雨点/石头/问题“砸”过来）。"]}
{"word":"pelterer","summary":{"en":"A pelterer is a (usually historical) dealer in animal pelts or furs.","zh":"pelterer 指（多为历史语境中）经营动物毛皮/兽皮的商人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who buys, sells, or trades animal pelts (skins with fur), especially as a profession (often historical/old-fashioned).","zh":"（尤指历史上/较旧用法）买卖或经营动物毛皮（带毛的皮）的商人。"},"examples":[{"en":"In the old market, a pelterer might trade fox and beaver pelts for tools and cloth.","zh":"在旧时集市上，毛皮商可能用狐狸皮和海狸皮换取工具和布料。"},{"en":"The novel mentions a pelterer who supplied fur for winter coats.","zh":"小说里提到一位毛皮商，为冬季外套提供毛皮。"}]}],"synonyms":["fur trader","furrier","pelt dealer"],"phonetic":"ˈpɛltərər","extraExplanation":["“pelterer”来源于“pelt”（兽皮、毛皮）。这个词在现代英语里比较少见，更常见的说法是“fur trader”（毛皮商）或“furrier”（毛皮工/皮草商）。","在欧洲和北美的历史语境中，毛皮贸易曾是重要产业，常与探险、殖民贸易路线以及冬季衣物需求相关；阅读历史小说或史料时更容易遇到这个词。"]}
{"word":"pelters","summary":{"en":"“Pelters” usually means people/things that throw objects; in some British/Irish informal use, it can refer to very heavy rain (as in “a pelter”).","zh":"“pelters”通常指投掷东西的人（或物）；在部分英式/爱尔兰口语中也可指很大的雨（如短语“a pelter”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that throw small objects at someone or something (plural of “pelter”).","zh":"向某人或某物投掷小物体的人（或物）（“pelter”的复数）。"},"examples":[{"en":"The pelters hid behind the fence and threw stones at the windows.","zh":"那些投掷者躲在栅栏后面，朝窗户扔石头。"},{"en":"Police tried to identify the pelters after the crowd started throwing bottles.","zh":"人群开始扔瓶子后，警方试图确认那些投掷者的身份。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, chiefly British/Irish) Heavy rain or a lot of something—used in expressions like “a pelter.” “Pelters” can appear as a plural idea of repeated heavy downpours.","zh":"（非正式，主要英式/爱尔兰用法）大雨；大量——常见于短语“a pelter”。“pelters”有时可表示一阵阵的暴雨（复数概念）。"},"examples":[{"en":"We got caught in pelters of rain on the way home.","zh":"回家的路上我们遇上了几阵大雨。"},{"en":"It was raining a pelter, so the game was canceled.","zh":"雨下得特别大，所以比赛取消了。"}]}],"synonyms":["stone-throwers","throwers","attackers (context-dependent)","downpour (rain sense)","heavy rain"],"phonetic":"/ˈpɛltɚ/","extraExplanation":["“pelter”来自动词“to pelt”（用小东西反复投掷）。在新闻或正式语境里更常见的是动词/名词搭配：“pelted (someone/something) with stones”或“stone-throwers”。","英爱口语里的“a pelter”多指“很大的雨”（类似“a downpour”）。这种用法在美式英语中不常见，美式更常说“pouring,” “downpour,” “heavy rain.”"]}
{"word":"pelti","summary":{"en":"“Pelti” is not a standard English vocabulary word; it’s usually a typo or a proper name.","zh":"“pelti”不是标准英语词汇；通常是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or as a proper name (e.g., a surname or brand). If you meant a different word, common possibilities are “pelt,” “petty,” or “pelting.”","zh":"不是标准英语单词。它更常见于拼写错误，或作为专有名词（如姓氏、品牌名）。如果你想查的是别的词，常见可能是 pelt、petty 或 pelting。"},"examples":[{"en":"I couldn’t find “pelti” in an English dictionary—did you mean “pelt” or “petty”?","zh":"我在英语词典里找不到“pelti”——你是不是想写“pelt”或“petty”？"},{"en":"“Pelti” might be a name; the meaning depends on the person or company using it.","zh":"“Pelti”可能是名字；具体含义要看使用它的个人或公司。"}]}],"synonyms":["(no direct English synonym—please confirm the intended word)"],"phonetic":"ˈpɛlti","extraExplanation":["“pelti”更像是其他语言或专名的拼写。在芬兰语里，pelti 可指“金属板/铁皮”（如 peltikatto = 铁皮屋顶），但这不是英语常用词。若你告诉我句子语境或你想表达的意思，我可以帮你确认最接近的英文词。"]}
{"word":"peltiferous","summary":{"en":"Peltiferous describes animals that have or produce a pelt (fur).","zh":"peltiferous 指“有毛皮的/产毛皮的”动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having a pelt; fur-bearing.","zh":"（动物）有毛皮的；产毛皮的。"},"examples":[{"en":"The peltiferous mammals of the region include foxes and minks.","zh":"这个地区的产毛皮哺乳动物包括狐狸和水貂。"},{"en":"In winter, many peltiferous animals grow thicker fur.","zh":"到了冬天，许多有毛皮的动物会长出更厚的毛。"}]}],"synonyms":["fur-bearing","furry","pelted"],"phonetic":"/ˌpɛl.tɪˈfɪr.əs/","extraExplanation":["词源：来自拉丁语 peltis（兽皮、皮革）+ -ferous（“带有……的/产生……的”，如 aquiferous “含水的”）。","这是较少见、偏书面/学术的词，日常英语里更常用 fur-bearing（有毛皮的）或 having a pelt（有皮毛的）。"]}
{"word":"peltifolious","summary":{"en":"Peltifolious means “having peltate leaves,” where the leaf stalk attaches near the center of the blade rather than at the edge.","zh":"peltifolious 指“盾状叶的”：叶柄连接在叶片内部（常接近中央），而不是连在叶缘。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having peltate leaves—leaves whose stalk (petiole) attaches to the blade away from the edge, often near the center, like an umbrella handle.","zh":"（植物学）盾状叶的；指叶柄（叶子的小“柄”）连接在叶片内部、离叶缘一定距离（常接近中央），像雨伞柄连在伞面上。"},"examples":[{"en":"Lotus plants are peltifolious, with the petiole attached near the middle of the leaf.","zh":"荷花是盾状叶植物，叶柄连接在叶片的中部附近。"},{"en":"The botanist noted the plant’s peltifolious leaves as a key identification feature.","zh":"植物学家把这种植物的盾状叶记录为重要的鉴别特征。"}]}],"synonyms":["peltate","shield-shaped (leaf)"],"phonetic":"/ˌpɛl.tɪˈfoʊ.li.əs/","extraExplanation":["这个词在现代英语里很少见，更常用的是 **peltate (leaf/leaves)**（盾状的/盾状叶的）来表达同一概念。","词源上来自拉丁语：**pelta**（小盾牌）+ **-folious**（与叶有关，来自 *folium* “叶”）。因此它形象地表示“像盾牌一样连柄的叶”。","常见例子包括：荷叶/莲叶（lotus）、旱金莲（nasturtium）等；它们的叶柄从叶片内部伸出，看起来像“伞柄”。"]}
{"word":"peltiform","summary":{"en":"Peltiform means “shield-shaped,” a term often used in scientific descriptions.","zh":"peltiform 指“盾形的”，常见于科学描述中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shield-shaped; shaped like a small shield (especially used in biology, botany, and anatomy to describe a form or structure).","zh":"盾形的；像小盾牌一样的（尤用于生物学、植物学或解剖学中描述形状或结构）。"},"examples":[{"en":"The leaf is described as peltiform, with a broad, shield-like outline.","zh":"这种叶子被描述为盾形的，外轮廓宽大，像盾牌一样。"},{"en":"In the field guide, the peltiform scale is an important clue for identification.","zh":"在野外指南里，盾形鳞片是辨认物种的重要线索。"}]}],"synonyms":["shield-shaped","scutiform","peltate (related)"],"phonetic":"/ˈpɛl.tɪ.fɔrm/","extraExplanation":["词源上常与拉丁语 peltis（小盾牌）相关，因此在学术语境中常用来表达“像盾一样的形状”。在植物学里它有时会和 peltate（盾状着生的，指叶柄连接在叶片近中心而非边缘）一起出现，但 peltiform 更强调“外形像盾”，不一定强调连接方式。"]}
{"word":"peltigera","summary":{"en":"Peltigera is a genus of foliose lichens (often called dog lichens).","zh":"Peltigera 指盾叶衣属，一类常见的叶状地衣（部分俗称狗地衣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of leafy (foliose) lichens, often called “dog lichens,” commonly found on soil, moss, or tree bases in cool, damp places.","zh":"（生物）盾叶衣属：一种叶状地衣的属名，常见于凉爽潮湿环境的土壤、苔藓或树根处；其中一些种也常被称为“狗地衣”。"},"examples":[{"en":"Scientists recorded several Peltigera species as indicators of a healthy, moist forest floor.","zh":"科学家记录到多种盾叶衣属地衣，作为潮湿、健康林地地表的指示物种。"},{"en":"You might see Peltigera growing in soft mats on mossy ground after rain.","zh":"雨后你可能会看到盾叶衣属地衣在长满苔藓的地面上成片生长。"},{"en":"The field guide noted Peltigera’s broad, lobed edges and pale underside.","zh":"野外指南提到盾叶衣属地衣的特征是叶片宽大、边缘分裂，背面颜色较浅。"}]}],"synonyms":["dog lichen (common name for some species)","Peltigera spp. (scientific shorthand)"],"phonetic":"/ˌpɛlˈtɪdʒərə/","extraExplanation":["“Peltigera”是拉丁化的学名，常被解释为来自希腊语“peltē（小盾牌）”，指其叶状、像盾牌一样的裂片外形。","盾叶衣属地衣通常是“真菌 + 藻类/蓝藻”的共生体；其中与蓝藻共生的种类可能具有固氮能力，因此在生态系统氮循环中可能扮演一定角色。","在自然观察与生态研究中，地衣（包括盾叶衣属）常被用作环境变化的线索之一；不过不同地区、不同物种的敏感度差异很大，需结合具体研究判断。"]}
{"word":"peltigeraceae","summary":{"en":"Peltigeraceae is a scientific name for a family of lichens, including Peltigera.","zh":"Peltigeraceae 是地衣的一科的科学名称，包含盾地衣属（Peltigera）等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of lichens (fungi living in partnership with algae or cyanobacteria), including many “leaf-like” lichens such as the genus Peltigera.","zh":"地衣科名：地衣的一科（真菌与藻类或蓝藻共生的生物），常见为“叶状”地衣，例如盾地衣属（Peltigera）等。"},"examples":[{"en":"Peltigeraceae lichens are often found on soil, moss, or decaying wood in cool, moist habitats.","zh":"地衣科（Peltigeraceae）的地衣常见于凉爽潮湿环境中的土壤、苔藓或腐木上。"},{"en":"In field guides, Peltigera is commonly listed under the family Peltigeraceae.","zh":"在野外图鉴中，盾地衣属（Peltigera）通常归在地衣科（Peltigeraceae）之下。"}]}],"synonyms":["lichen family (general term)","family Peltigeraceae (scientific form)"],"phonetic":"/ˌpɛl.tɪ.dʒəˈreɪ.si.i/","extraExplanation":["“Peltigeraceae”是生物分类学（taxonomy）中的科名，常见于科学论文、野外鉴定手册与生态研究中；日常英语对话里很少用到。","词形来源于属名“Peltigera”（盾地衣属）+ 科名后缀“-aceae”（表示“……科”）。发音上可把它分段理解为：pel-ti-jer-AY-see-ee（接近读法）。"]}
{"word":"peltigerine","summary":{"en":"Peltigerine means “related to the lichen genus Peltigera.”","zh":"peltigerine 指“与肺衣属（Peltigera）地衣有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the lichen genus Peltigera (a group of leafy lichens often associated with cyanobacteria).","zh":"与肺衣属（Peltigera）地衣有关的；指肺衣属这一类常呈叶状、常与蓝藻共生的地衣。"},"examples":[{"en":"Researchers sampled peltigerine lichens to study nitrogen fixation in forest soils.","zh":"研究人员采集了肺衣属相关的地衣样本，用来研究森林土壤中的固氮作用。"},{"en":"The field guide notes that some peltigerine species have broad, lobed thalli.","zh":"野外图鉴指出，一些肺衣属的相关物种具有宽大、分裂成裂片的叶状体。"}]}],"synonyms":["Peltigera-related","of Peltigera"],"phonetic":"/ˌpɛlˈtɪdʒəˌriːn/","extraExplanation":["“peltigerine”属于专业科学用语，来自地衣属名 Peltigera（肺衣属）+ 形容词后缀 -ine，意思是“……属的/与……有关的”。日常英语里几乎不用，多见于分类学、生态学与真菌学文献。","如果你是想查更常见的词，可能拼写接近但不同；你可以告诉我它出现的句子或上下文，我也能帮你确认是否有拼写错误或应改查的词（例如属名 Peltigera 本身）。"]}
{"word":"peltigerous","summary":{"en":"Peltigerous means “having or bearing a pelt; covered with fur or a thick hide,” and is a rare, scientific-style adjective.","zh":"peltigerous 指“有（兽）皮毛的；覆有毛皮或厚皮的”，属于较罕见、偏科学文体的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, scientific) Having or bearing a pelt; covered with fur or a thick hide like an animal’s skin.","zh":"（罕见/科学用语）有皮毛的；覆有毛皮或厚皮的。"},"examples":[{"en":"The report described the mammal as peltigerous, with dense winter fur.","zh":"报告把这种哺乳动物描述为“有皮毛的”，冬季毛发非常浓密。"},{"en":"In cold climates, many peltigerous animals grow thicker coats to survive.","zh":"在寒冷地区，许多有皮毛的动物会长出更厚的皮毛以生存。"}]}],"synonyms":["furry","furred","fur-bearing","fur-covered","pelted"],"phonetic":"ˌpɛlˈtɪdʒərəs","extraExplanation":["这个词非常少见，多出现在动物学、博物学或较“古典”的描写里。它由 pelt（兽皮/毛皮）+ -gerous（“携带/具有”的后缀，来自拉丁语 gerere“携带”）构成，字面意思就是“带着皮毛的”。日常英语里通常会用 furry（多毛的）、fur-covered（被毛皮覆盖的）、having a pelt（有兽皮/毛皮的）来表达。"]}
{"word":"peltinervate","summary":{"en":"A rare botanical adjective meaning “with veins radiating from near the center of a (peltate) leaf.”","zh":"一个罕见的植物学形容词，指“（盾状叶）叶脉从叶片近中心处向外放射”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Having leaf veins that radiate from a point near the center of the blade (as in a peltate leaf), rather than from the base.","zh":"（植物学，罕见）指叶脉从叶片接近中心的位置向四周放射状分布（常见于盾状叶 peltate leaf），而不是从叶基部发出。"},"examples":[{"en":"The lotus has a peltate, peltinervate leaf: its veins spread out from near the middle.","zh":"莲叶属于盾状叶，也可说是 peltinervate：叶脉从接近叶片中央处向外放射。"},{"en":"In the field guide, the species is described as having broad, peltinervate blades.","zh":"在野外图鉴里，这个物种被描述为具有宽大的 peltinervate（中央放射脉）叶片。"}]}],"synonyms":["peltinerved","peltate-veined","radiately veined (near the center)"],"phonetic":"/ˌpɛltiˈnɝːveɪt/","extraExplanation":["这是一个非常偏植物形态学（botanical morphology）的用词，在日常英语里几乎见不到，多出现在专业描述或分类学文字中。","词形可拆解理解：pelt- 来自拉丁语 *pelta*（小盾牌），暗示“盾状/像盾牌一样从中心连接”；nerv- 来自拉丁语 *nervus*（脉、筋），在植物学里指“叶脉”；-ate 常见于形容词结尾。","你可能更常遇到的近似写法是 **peltinerved** 或直接用更通俗的表达：**peltate with radiating veins**（盾状叶、叶脉放射）。"]}
{"word":"peltinerved","summary":{"en":"“peltinerved” is not a recognized English word; it’s probably a misspelling.","zh":"“peltinerved”不是规范英语词，很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a mistaken combination of words (for example, something like “pelting” + “nerved,” or “thin-nerved”).","zh":"不是标准英语单词。很可能是拼写错误，或把多个词错误地拼在一起（例如把“pelting”和“nerved”混合，或想写类似“thin-nerved”的表达）。"},"examples":[{"en":"I couldn’t find “peltinerved” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“peltinerved”——你能把看到它的原句发出来吗？"},{"en":"If you meant “pelting,” it describes heavy rain or objects hitting repeatedly.","zh":"如果你想写的是“pelting”，它表示大雨倾盆或东西不断击打。"}]}],"phonetic":"/ˌpɛltɪˈnɝvd/","extraExplanation":["“peltinerved”看起来像把两个部分黏在一起的拼写：常见的可能目标包括：\n1) pelting（adj./v.）=（雨/冰雹）猛烈地打；\n2) thin-nerved / ill-nerved（较少见）= 紧张、胆小、神经脆弱（多见于较旧或文学语境）；\n3) “pelted and unnerved”（被猛烈冲击并感到不安）这类搭配在写作中更自然。\n如果你把原句贴出来，我可以根据上下文判断你真正想表达的词。"]}
{"word":"pelting","summary":{"en":"“Pelting” describes heavy, fast-falling weather or repeated forceful hitting/throwing (and can be used literally or figuratively).","zh":"“pelting”常形容雨雪等猛烈快速地下落，也可指反复用力投掷/击打（可用于字面或比喻，如连番提问）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of rain, snow, hail, etc.) falling very hard and fast.","zh":"（雨、雪、冰雹等）猛烈而快速地下落。"},"examples":[{"en":"The rain was pelting against the windows all night.","zh":"雨整夜猛烈地敲打着窗户。"},{"en":"We ran inside when hail started pelting down.","zh":"冰雹开始猛砸下来时，我们赶紧跑进屋里。"}]},{"partOfSpeech":"n.","definition":{"en":"Throwing small objects repeatedly and forcefully at someone or something; the act of hitting with many thrown things.","zh":"不断用小物体用力投掷（以砸向某人或某物）；连番投掷击打的行为。"},"examples":[{"en":"The crowd began pelting the wall with stones.","zh":"人群开始用石头不停地砸墙。"},{"en":"He faced a pelting of questions from reporters.","zh":"他面对记者连珠炮般的提问。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “pelt”: to hit repeatedly with thrown objects, or (of weather) to strike hard.","zh":"“pelt”的现在分词：用投掷物反复击打；（天气）猛烈地打在……上。"},"examples":[{"en":"Kids were pelting the target with snowballs.","zh":"孩子们正用雪球不停地砸靶子。"},{"en":"Rain was pelting my jacket as I walked home.","zh":"我走回家时，雨点猛烈地打在我的夹克上。"}]}],"synonyms":["pounding","lashing","beating","bombarding","pummeling"],"phonetic":"/ˈpɛltɪŋ/","extraExplanation":["“pelt”原意与“动物皮毛（pelt）”是两个不同来源的词：动词pelt（投掷、猛击）来自古法语，名词pelt（皮毛）则来自日耳曼语系。","常见搭配：pelt + 人/物 + with + 名词（pelted him with rocks）；pelt against（雨点pelt against the window）；pelt down（雨/雪猛烈落下）。","比喻用法中，“a pelting of questions/criticism”表示“密集的提问/批评”，强调“像雨点一样又快又多”。"]}
{"word":"peltingly","summary":{"en":"Peltingly means “with repeated, forceful impacts,” most often describing heavy rain or hail.","zh":"Peltingly 指“以连续而猛烈的冲击方式”，多用来形容大雨或冰雹的砸落。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that hits or strikes repeatedly and forcefully, especially of rain, snow, or thrown objects.","zh":"（尤指雨、雪或被扔出的东西）以不断、猛烈击打的方式；噼里啪啦地。"},"examples":[{"en":"Rain fell peltingly against the windows all night.","zh":"雨整夜噼里啪啦地打在窗户上。"},{"en":"Hail came down peltingly, stinging our faces as we ran for cover.","zh":"冰雹猛烈砸下，跑去躲避时把我们的脸打得生疼。"}]}],"synonyms":["heavily","violently","forcefully","relentlessly"],"phonetic":"/ˈpɛltɪŋli/","extraExplanation":["“peltingly”来自形容词“pelting”（猛烈击打的、像被投掷物砸到一样的）。英语里更常见的搭配是“pelting rain / pelting hail（瓢泼大雨/猛烈冰雹）”，副词“peltingly”比较少见，多用于文学或描写性写作来加强画面感。"]}
{"word":"peltish","summary":{"en":"Peltish means pelt-like—furred, hairy, or scruffy-looking (rare).","zh":"peltish 表示“像兽皮/毛皮一样的”——毛茸茸的、长毛的，或外表粗糙邋遢（较罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Covered with fur or hair; having a pelt-like appearance.","zh":"（罕见）长着毛皮的；像兽皮（皮毛）一样的；毛茸茸的。"},"examples":[{"en":"In the coldest months, the animal’s peltish coat helped it survive.","zh":"在最寒冷的月份，这种动物毛茸茸的皮毛帮助它活了下来。"},{"en":"The story describes a peltish creature emerging from the forest.","zh":"故事描写了一只毛茸茸的生物从森林里走出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, informal/literary) Rough, shabby, or scruffy in look, as if wearing a worn pelt.","zh":"（罕见，非正式/文学）外表粗糙、邋遢的；看起来像披着破旧皮毛一样。"},"examples":[{"en":"He arrived in a peltish jacket that looked like it had seen many winters.","zh":"他穿着一件看起来熬过许多个冬天的破旧外套来到这里。"},{"en":"The illustration shows a peltish cloak draped over the traveler’s shoulders.","zh":"插图里，旅人肩上披着一件毛皮般粗糙的斗篷。"}]}],"synonyms":["furry","furred","hairy","shaggy","scruffy"],"phonetic":"/ˈpɛl.tɪʃ/","extraExplanation":["“peltish”由“pelt（兽皮；毛皮）+ -ish”构成，意思是“有点像……的”。在现代英语中非常少见，更常用的表达是“furred / furry / hairy / shaggy”。","因为词汇很少见，它更可能出现在文学描写、奇幻作品或方言风格的写作中，用来营造“原始、野性、毛皮感”的画面。"]}
{"word":"peltless","summary":{"en":"Peltless means “without a pelt”—lacking fur/animal skin covering.","zh":"peltless 表示“没有皮毛（兽皮）的”，用于描写缺少毛皮覆盖的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no pelt (animal skin with fur); lacking fur or a hide.","zh":"没有皮毛的；没有兽皮（带毛的皮）的；缺少皮或毛皮覆盖的。"},"examples":[{"en":"The rescued animal looked weak and almost peltless after the illness.","zh":"那只被救助的动物生病后看起来很虚弱，几乎没有皮毛。"},{"en":"In the story, the peltless wolf was shunned by the pack.","zh":"在故事里，那只没有皮毛的狼被狼群排斥。"}]}],"synonyms":["hairless","furless","bare-skinned"],"phonetic":"/ˈpɛltləs/","extraExplanation":["“Pelt”常指“（带毛的）兽皮”，也可泛指动物的皮或毛皮外套。“-less”是常见后缀，表示“没有……的”（如 homeless, powerless）。因此 peltless 直译就是“没有兽皮/皮毛的”。这个词比较少见，多出现在描写性文本或创作性写作中。"]}
{"word":"peltmonger","summary":{"en":"A peltmonger is a fur or animal-skin dealer, often used with a disapproving tone.","zh":"peltmonger 指“毛皮贩子/兽皮商”，常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who buys and sells animal skins or furs (pelts), often with a slightly negative tone (suggesting profiteering from animals).","zh":"毛皮贩子；买卖动物皮毛的人（常带一点贬义，暗示靠动物皮毛牟利）。"},"examples":[{"en":"The old novel described him as a peltmonger who grew rich from the fur trade.","zh":"那本老小说把他写成一个靠毛皮贸易发家的毛皮贩子。"},{"en":"Protesters called the company a modern peltmonger for selling real fur coats.","zh":"抗议者称那家公司是“现代毛皮贩子”，因为他们出售真皮草大衣。"}]}],"synonyms":["fur trader","fur dealer","pelt dealer","skin merchant"],"phonetic":"/ˈpɛltˌmʌŋɡɚ/","extraExplanation":["这个词由 pelt（兽皮、毛皮）+ monger（贩子、兜售者）构成。monger 常出现在带批评意味的词里（如 warmonger“战争贩子”），所以 peltmonger 在语气上往往不如 neutral 的 fur trader（毛皮商）中性。","在现代英语中它不算常用，更常见于历史语境（早期毛皮贸易）或批评/讽刺性表达中。"]}
{"word":"peltogaster","summary":{"en":"Peltogaster is a scientific genus name for parasitic barnacles that infect hermit crabs.","zh":"Peltogaster 是一种寄生在寄居蟹上的寄生藤壶（根头类）的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic barnacles (rhizocephalans) that live on hermit crabs, forming an external sac-like body and drawing nutrients from the host.","zh":"一种寄生藤壶（根头类）的属，寄生在寄居蟹身上，形成囊状的外部结构，并从宿主体内吸收营养。"},"examples":[{"en":"Researchers found Peltogaster attached to the abdomen of a hermit crab.","zh":"研究人员发现一种 Peltogaster 附着在寄居蟹的腹部。"},{"en":"Peltogaster can alter a crab’s reproduction by acting as a parasite that controls the host’s body.","zh":"Peltogaster 作为寄生者，可能会影响寄居蟹的繁殖，甚至在一定程度上“操控”宿主的身体机能。"}]}],"synonyms":["rhizocephalan barnacle","parasitic barnacle"],"phonetic":"/ˌpɛltoʊˈɡæstɚ/","extraExplanation":["这是生物分类学中的拉丁化属名，常见于动物学/海洋生物学论文与图鉴中，一般不用于日常英语对话。","词源来自希腊语：pelte（小盾牌）+ gaster（胃、腹部），用来形容其外部囊状结构的外形。","Peltogaster 属于根头类（Rhizocephala），与常见“藤壶”同属甲壳类，但生活史高度特化，能在宿主体内形成类似“根系”的组织来吸收营养。"]}
{"word":"peltries","summary":{"en":"Peltries means animal furs/skins, especially as trade goods (the fur trade).","zh":"Peltries 指兽皮/毛皮，尤指作为贸易商品的毛皮（毛皮贸易）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animal furs or skins (pelts), especially when collected as goods for trading or selling; the fur trade.","zh":"毛皮；兽皮（尤指作为贸易或商品的毛皮）。"},"examples":[{"en":"The company made its early profits from peltries shipped from the north.","zh":"这家公司早期的利润来自从北方运来的毛皮。"},{"en":"In the 1700s, peltries were often exchanged for tools and cloth.","zh":"在18世纪，毛皮常被用来交换工具和布料。"},{"en":"They recorded the number of peltries in the ledger before winter ended.","zh":"冬季结束前，他们把毛皮数量记录在账本里。"}]}],"synonyms":["furs","pelts","hides","skins","fur goods"],"phonetic":"/ˈpɛltri/","extraExplanation":["“peltries”是“peltry”的复数，但在英语里常常以复数形式出现，表示“毛皮（总称）/毛皮货物”。","这个词带有较强的历史语境，常见于描述北美毛皮贸易（fur trade）、殖民时期商业、探险与商队交易等题材的文章或文学作品中。"]}
{"word":"peltry","summary":{"en":"Peltry means animal skins or furs collected for use or trade, especially in historical contexts like the fur trade.","zh":"Peltry 指（尤用于历史语境的）成批毛皮/皮张，常用于制作或贸易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Animal skins (especially with the fur still on) collected and sold, often used for making clothing or traded as goods.","zh":"（尤指带毛的）兽皮、皮张；常指被收集起来用于制作衣物或作为商品交易的毛皮。"},"examples":[{"en":"In the early fur trade, peltry was shipped downriver to major trading posts.","zh":"在早期的毛皮贸易中，peltry 会沿河运往主要的贸易站。"},{"en":"The museum displays coats made from peltry that was once considered a sign of wealth.","zh":"博物馆展出用 peltry 制成的外套，这类毛皮曾被视为财富的象征。"}]}],"synonyms":["fur","pelt","hides","skins"],"phonetic":"/ˈpɛltri/","extraExplanation":["“peltry”是较偏历史/文学的词，常见于北美毛皮贸易（fur trade）语境，尤其与16–19世纪欧洲殖民者、商站（trading posts）以及与原住民之间的贸易有关。现代日常英语里更常说“fur(s)”“pelt(s)”或“animal skins”。","词源上与“pelt（兽皮）”同源，语感更偏“成批的毛皮/皮张（作为商品）”，而不是单独一张皮。"]}
{"word":"pelts","summary":{"en":"“Pelts” can mean animal skins with fur (plural noun) or the verb “pelts,” meaning to throw repeatedly or to fall hard (rain/hail).","zh":"“Pelts”既可指“带毛的兽皮”（复数名词），也可作动词，表示“不断投掷”或“（雨/冰雹）猛烈落下”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animal skins with the fur still on them, often used for making clothing or rugs (plural of “pelt”).","zh":"带毛的兽皮（“pelt”的复数），常用于制作衣物或地毯。"},"examples":[{"en":"The store sells pelts and handmade leather goods.","zh":"这家店出售兽皮和手工皮革制品。"},{"en":"Trappers once traded pelts for supplies.","zh":"过去捕兽者常用兽皮换取生活用品。"}]},{"partOfSpeech":"v.","definition":{"en":"throws things at someone or something repeatedly (third-person singular of “pelt”).","zh":"反复向某人或某物投掷（“pelt”的第三人称单数）。"},"examples":[{"en":"The crowd pelts the bus with snowballs.","zh":"人群用雪球不断朝大巴扔去。"},{"en":"The children pelt each other with soft pillows during play.","zh":"孩子们玩闹时用软枕头互相扔。"}]},{"partOfSpeech":"v.","definition":{"en":"(of rain, hail, etc.) falls hard and fast; beats against something.","zh":"（雨、冰雹等）急骤猛烈地落下；噼里啪啦地打在某物上。"},"examples":[{"en":"Hail pelts the roof during the storm.","zh":"暴风雨中冰雹噼里啪啦地砸在屋顶上。"},{"en":"Rain pelts the windows all night.","zh":"雨水整晚猛烈地敲打着窗户。"}]}],"synonyms":["furs","hides","skins","pummels","bombards"],"phonetic":"/pɛlts/","extraExplanation":["“pelt”作名词指“带毛的兽皮”，在历史上与毛皮贸易有关；现代语境中谈到动物毛皮可能涉及环保与动物福利议题，表达时可用更中性或具体的说法（如“fur”“animal hide”），并注意场合。"]}
{"word":"pelu","summary":{"en":"“Pelu” is usually a name; in some Nigerian (Yoruba-English) contexts it can mean “with.”","zh":"“Pelu”多为人名；在部分尼日利亚（约鲁巴语夹英语）语境中也可表示“和/与”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often seen as a personal name (a given name or nickname) in some cultures.","zh":"不是标准英语单词；最常见的用法是作为人名（名字或昵称），在一些文化中会出现。"},"examples":[{"en":"Pelu is my classmate from Lagos.","zh":"Pelu 是我来自拉各斯的同学。"},{"en":"I met someone named Pelu at the conference.","zh":"我在会议上认识了一个叫 Pelu 的人。"}]},{"partOfSpeech":"prep.","definition":{"en":"In Nigerian contexts, you may see “pelu” in Yoruba-English code-switching meaning “with” (from Yoruba “pẹ̀lú”).","zh":"在尼日利亚语境中，你可能会在约鲁巴语与英语混用时看到 “pelu”，表示“和/与/带着”（源自约鲁巴语 “pẹ̀lú”）。"},"examples":[{"en":"I went to the market pelu my sister. (code-switching)","zh":"我和我妹妹一起去市场。（混用表达）"},{"en":"Come pelu me. (informal, code-switching)","zh":"跟我一起来。（非正式混用）"}]}],"synonyms":["with (in Yoruba-English code-switching)"],"phonetic":"/ˈpeɪluː/","extraExplanation":["“pelu”本身在标准英语词典里通常查不到；如果你是在聊天、歌词、社交媒体上看到它，很可能是人名，或是尼日利亚语境中夹杂的约鲁巴语词。","如果你能提供一句原文（你在哪看到的、前后文是什么），我可以更准确判断它到底是人名、拼写错误，还是某种缩写/方言用法。"]}
{"word":"peludo","summary":{"en":"Peludo is a Spanish word meaning “hairy/furry,” and in some Latin American slang it can also mean “difficult/complicated.” In Argentina/Uruguay, it can name a type of armadillo.","zh":"Peludo 是西班牙语，常用义为“多毛的/毛茸茸的”；在部分拉美口语中也可表示“很难/很棘手”。在阿根廷/乌拉圭还可指一种犰狳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) hairy; covered with a lot of hair or fur.","zh":"（西班牙语）多毛的；毛茸茸的（指长很多毛/毛发）。"},"examples":[{"en":"El perro es muy peludo.","zh":"这只狗很毛茸茸。"},{"en":"Tengo un suéter peludo y muy caliente.","zh":"我有一件毛茸茸、很保暖的毛衣。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Latin America, informal) difficult; complicated; hard to deal with.","zh":"（拉美口语）困难的；复杂的；棘手的。"},"examples":[{"en":"El examen estuvo peludo.","zh":"那次考试很难。"},{"en":"La situación se puso peluda.","zh":"情况变得很棘手。"}]},{"partOfSpeech":"n.","definition":{"en":"(Argentina/Uruguay) a hairy armadillo (a kind of armadillo).","zh":"（阿根廷/乌拉圭）毛犰狳（某种犰狳）。"},"examples":[{"en":"En el campo vieron un peludo cerca del camino.","zh":"在乡下他们在路边看到一只毛犰狳。"}]}],"synonyms":["hairy","furry","shaggy","difficult","complicated"],"phonetic":"/peɪˈluːdoʊ/","extraExplanation":["“Peludo”来自西班牙语词根“pelo”（毛发、头发），字面意思就是“有很多毛的”。","“很难/很棘手”的口语用法在不同国家常见度不同：在一些地区更常说“está difícil/está complicado”。听到“está peludo”时，通常是在较口语、较随意的场合。","作动物名（毛犰狳）主要是南美南部的地域用法；如果不在该语境中，多数情况下理解为“毛茸茸的”即可。"]}
{"word":"pelure","summary":{"en":"Pelure means a thin peel or skin (especially onion skin), and sometimes very thin “onion-skin” paper.","zh":"Pelure 指很薄的外皮/薄皮（尤指洋葱皮），有时也指很薄的“洋葱皮纸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thin outer skin or peel, especially the papery skin of an onion (a French loanword, used mainly in cooking or descriptive writing).","zh":"（外来词，源自法语）薄薄的外皮/皮层，尤指洋葱那种纸一样的外皮（多用于烹饪或描写性文字）。"},"examples":[{"en":"Remove the pelure from the onion before slicing it.","zh":"切片前先把洋葱的薄皮（pelure）剥掉。"},{"en":"The chef used only the white part, discarding the pelure.","zh":"厨师只用白色部分，把薄皮（pelure）丢掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"very thin, onion-skin–like paper; onion-skin paper (rare).","zh":"（罕见）很薄、像洋葱皮一样的纸；“洋葱皮纸”。"},"examples":[{"en":"The notes were typed on pelure to keep the pages light.","zh":"这些笔记用很薄的洋葱皮纸（pelure）打出来，方便携带。"}]}],"synonyms":["peel","skin","husk","outer layer","onion skin","onion-skin paper"],"phonetic":"/pəˈlʊr/","extraExplanation":["“Pelure”来自法语，字面就是“皮、剥下来的薄皮”。在英语里它比较少见，常出现在偏法式的烹饪语境或较讲究的描写中。","你也可能看到固定说法“pelure d’oignon”（法语：洋葱皮），在英语里常用来形容一种淡淡的、偏金褐/粉金的“洋葱皮色（onion-skin color）”。"]}
{"word":"pelusios","summary":{"en":"Pelusios is a genus of African freshwater turtles known as African hinged terrapins.","zh":"Pelusios 指非洲淡水龟的一个属，俗称非洲铰链泽龟/泥龟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African freshwater turtles (family Pelomedusidae), commonly called African hinged terrapins, known for a hinged plastron (lower shell) that can partly close for protection.","zh":"（生物）一种非洲淡水龟属名（侧颈龟科 Pelomedusidae），常称“非洲铰链泥龟/铰链泽龟”，其腹甲（下壳）具有“铰链”结构，可部分合拢以保护身体。"},"examples":[{"en":"Pelusios turtles are often found in slow-moving rivers, ponds, and marshes in Africa.","zh":"Pelusios 属的龟常见于非洲水流缓慢的河流、池塘和沼泽中。"},{"en":"Some Pelusios species can close part of their shell to protect their head and limbs.","zh":"Pelusios 属的一些物种可以合拢部分腹甲来保护头部和四肢。"}]}],"synonyms":["African hinged terrapin (common name)","hinged terrapin (common name)"],"phonetic":"/pəˈluːziəs/","extraExplanation":["“Pelusios”是拉丁化的属名，写作大写（Pelusios）。日常英文里更常用的俗名是“hinged terrapin（铰链泽龟/泥龟）”或“African hinged turtle”。","它们属于“侧颈龟”（把脖子向侧边弯入壳内），这点与常见的“隐颈龟”（把头向后缩进壳内）不同。"]}
{"word":"pelveoperitonitis","summary":{"en":"Pelveoperitonitis means inflammation of the pelvic peritoneum, usually due to infection.","zh":"pelveoperitonitis 指盆腔腹膜的炎症，通常与感染有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the peritoneum (the lining of the abdominal cavity) in the pelvic area, often related to pelvic infection.","zh":"盆腔腹膜炎：发生在盆腔区域的腹膜（腹腔内壁衬膜）炎症，常与盆腔感染有关。"},"examples":[{"en":"The doctor suspected pelveoperitonitis after finding signs of a severe pelvic infection.","zh":"医生在发现严重盆腔感染的迹象后，怀疑是盆腔腹膜炎。"},{"en":"Early treatment of pelveoperitonitis can help prevent serious complications.","zh":"尽早治疗盆腔腹膜炎有助于预防严重并发症。"}]}],"synonyms":["pelvic peritonitis","peritonitis (pelvic)"],"phonetic":"/ˌpɛlvi.oʊˌpɛrɪtəˈnaɪtɪs/","extraExplanation":["这是一个较少见、偏医学文献用语的词，临床上更常见的相关表述可能是“pelvic peritonitis（盆腔腹膜炎）”或更具体的病因描述（如由盆腔炎性疾病 PID 引起）。","构词上可拆为：pelveo-（骨盆/盆腔）+ periton-（腹膜）+ -itis（炎症）。看到 -itis 往往可以判断是“某部位的炎症”（如 tonsillitis 扁桃体炎）。"]}
{"word":"pelves","summary":{"en":"“Pelves” is the plural form of “pelvis,” used mainly in medical/anatomy contexts.","zh":"“Pelves”是“pelvis（骨盆）”的复数形式，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pelvis: the bony structures in the lower part of the body that connect the spine to the legs and protect organs such as the bladder and reproductive organs.","zh":"pelvis（骨盆）的复数：位于身体下部、连接脊柱与双腿的骨性结构，也保护膀胱与生殖系统等器官。"},"examples":[{"en":"The X-ray showed that both pelves were aligned normally.","zh":"X 光显示两侧的骨盆都对位正常。"},{"en":"In anatomy class, we compared male and female pelves.","zh":"在解剖课上，我们比较了男性和女性的骨盆。"}]}],"synonyms":["pelvises (less formal/common)"],"phonetic":"/ˈpɛlvɪs/","extraExplanation":["“pelves”是拉丁来源的复数形式（pelvis → pelves），多见于医学、解剖学与影像学写作中。日常英语里，人们更常用“pelvis/pelvises”（虽然不如“pelves”正式）。"]}
{"word":"pelvetia","summary":{"en":"Pelvetia is a genus of brown seaweed found on rocky seashores, especially high in the intertidal zone.","zh":"Pelvetia 指一种生长在岩石海岸（尤其潮间带上部）的褐藻属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of brown seaweeds (rockweeds) that grow on rocky seashores, especially in the upper intertidal zone; a well-known species is channelled wrack (Pelvetia canaliculata).","zh":"一种褐藻属（常见于“岩藻/海岩藻”类群），生长在岩石海岸，尤其常见于潮间带上部；较著名的物种是“沟形岩藻/沟槽海藻”（Pelvetia canaliculata）。"},"examples":[{"en":"Pelvetia often forms a dark band high on the rocks where the tide reaches.","zh":"Pelvetia 常在岩石较高处形成一条深色带，那是潮水能到达的地方。"},{"en":"In a shoreline survey, we recorded Pelvetia above the mussel beds.","zh":"在海岸调查中，我们记录到 Pelvetia 分布在贻贝带的上方。"}]}],"synonyms":["rockweed","wrack"],"phonetic":"/pɛlˈviːʃiə/","extraExplanation":["Pelvetia 是学名（属名），日常英语里更常用更泛的说法是 rockweed（岩藻/海岸褐藻）或 wrack（海藻堆、海带状褐藻）。在写作中，学名通常用斜体并首字母大写：*Pelvetia*。","它们适应潮间带上部较干燥、暴露时间长的环境；一些种类具有沟槽或能保水的结构，帮助减少失水。"]}
{"word":"pelvi","summary":{"en":"pelvi- is a combining form meaning “pelvis,” used mainly in medical terms.","zh":"pelvi- 是表示“骨盆”的构词成分，主要用于医学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form used in medical/scientific words meaning “pelvis” (the bony area at the base of the spine).","zh":"（构词成分）用于医学/科学词汇，表示“骨盆”（脊柱底部的骨性结构区域）。"},"examples":[{"en":"pelvic pain","zh":"骨盆疼痛 / 盆腔疼痛"},{"en":"pelvimetry (measuring the pelvis, especially in obstetrics)","zh":"骨盆测量（尤指产科中测量骨盆）"},{"en":"pelvicalyceal system (part of the kidney’s urine-collecting area)","zh":"肾盂肾盏系统（肾脏收集尿液的结构之一）"}]}],"synonyms":["pelv-","pelvis (as a full word)"],"phonetic":"ˈpɛlvi","extraExplanation":["“pelvi-”通常不单独当作一个完整单词使用，更常见的是出现在复合医学术语里（如 pelvic, pelvimetry）。","词源来自拉丁语 pelvis，原意与“盆/容器”有关，后来用于指人体的“骨盆”结构。学习时可以把它理解为“与骨盆有关的”。"]}
{"word":"pelvic","summary":{"en":"Pelvic means “related to the pelvis,” often used in medical contexts.","zh":"pelvic 指“与骨盆有关的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pelvis (the bony area at the base of the spine that supports the hips and protects organs in the lower abdomen).","zh":"与骨盆有关的（骨盆是脊柱底部的骨性结构，支撑髋部并保护下腹部器官）。"},"examples":[{"en":"The doctor ordered a pelvic exam to check for any problems.","zh":"医生安排了骨盆检查来确认是否有问题。"},{"en":"She had pelvic pain after the fall.","zh":"她摔倒后出现了骨盆疼痛。"},{"en":"Pelvic muscles help support the bladder.","zh":"骨盆肌肉有助于支撑膀胱。"}]}],"synonyms":["of the pelvis","pelvis-related"],"phonetic":"/ˈpɛlvɪk/","extraExplanation":["“Pelvic”常用于医学语境（如 pelvic exam 骨盆检查、pelvic floor 骨盆底、pelvic fracture 骨盆骨折）。日常对话中更常说 lower stomach/hip area（下腹/髋部附近），但在看病或阅读报告时会频繁看到“pelvic”。","常见搭配：pelvic floor（骨盆底）、pelvic inflammatory disease/PID（盆腔炎）、pelvic ultrasound（盆腔超声）、pelvic region（骨盆区域）。"]}
{"word":"pelvics","summary":{"en":"“Pelvics” usually refers to things related to the pelvis, often meaning pelvic(-floor) exercises in fitness/medical contexts.","zh":"“Pelvics”通常指与骨盆有关的事物，在健身/医疗语境中常用来指骨盆（盆底）相关训练。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things related to the pelvis, especially the pelvic muscles or the pelvic area (often used in fitness or medical contexts, e.g., “pelvics” meaning pelvic-floor exercises).","zh":"与骨盆有关的事物，尤其指骨盆部位或骨盆肌群（常见于健身或医疗语境中，如“pelvics”可指骨盆/盆底肌训练）。"},"examples":[{"en":"My physical therapist added pelvics to my daily routine to help with core stability.","zh":"我的物理治疗师把“pelvics”（骨盆/盆底相关训练）加入了我的日常练习，用来增强核心稳定性。"},{"en":"After the injury, the doctor checked my pelvics to make sure the pelvic area was okay.","zh":"受伤后，医生检查了我的骨盆相关部位，确保骨盆区域没有问题。"}]}],"synonyms":["pelvic exercises","pelvic-floor exercises","pelvic area"],"phonetic":"/ˈpɛlvɪks/","extraExplanation":["“pelvics”不是最标准、最常见的词典词条；更常见的表达是“pelvic (adj.)”或“pelvic floor (盆底)”。在健身房或康复训练里，有些人会用“pelvics”口语化地指“pelvic exercises / pelvic-floor exercises（骨盆/盆底肌练习）”。","如果你是在课程表、训练计划或医疗记录里看到“pelvics”，通常要结合上下文判断：是指“骨盆区域检查”，还是指“骨盆/盆底相关练习”。"]}
{"word":"pelviform","summary":{"en":"Pelviform means “pelvis-shaped,” used mostly in scientific descriptions.","zh":"pelviform 指“骨盆状的”，多用于科学性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a pelvis; broad and basin-like (used mainly in anatomy and biology).","zh":"骨盆状的；像骨盆一样宽而呈盆形的（主要用于解剖学与生物学）。"},"examples":[{"en":"Some fossils show a pelviform structure that suggests a strong attachment for muscles.","zh":"一些化石显示出骨盆状结构，暗示肌肉附着很强。"},{"en":"The report described a pelviform cavity in the specimen.","zh":"报告描述该标本具有一个骨盆状的腔体。"}]}],"synonyms":["pelvis-shaped","basin-shaped"],"phonetic":"/ˈpɛlvəˌfɔrm/","extraExplanation":["“pelviform”由 pelvis（骨盆）+ -form（……形状的）构成，属于较正式的学术用词，常见于解剖学、古生物学或比较生物学的描述中。","在日常英语中，人们更常说 “pelvis-shaped” 来表达同样意思。"]}
{"word":"pelvigraph","summary":{"en":"A rare term for a pelvic imaging record, often meaning a pelvic X-ray image (radiograph).","zh":"较少见词，指骨盆影像记录，常理解为骨盆X光片（放射影像）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical imaging record (or device) related to photographing/recording the pelvis; often used as a less common form referring to a pelvic radiograph (X-ray image) or pelvic imaging.","zh":"与骨盆拍摄/记录有关的医学影像记录（或设备）；较少见用法，常指骨盆X光片（骨盆放射影像）或骨盆影像检查。"},"examples":[{"en":"The doctor reviewed the pelvigraph to check for a pelvic fracture.","zh":"医生查看骨盆影像（pelvigraph）以检查是否有骨盆骨折。"},{"en":"A pelvigraph can help identify changes in the bones of the pelvis.","zh":"骨盆影像（pelvigraph）有助于发现骨盆骨骼的变化。"}]}],"synonyms":["pelvic radiograph","pelvic X-ray","radiograph"],"phonetic":"/ˈpɛlvɪˌɡræf/","extraExplanation":["“pelvigraph”在现代英语里非常少见，更常见的标准说法是“pelvic radiograph”（骨盆X光片）或直接说“pelvic X-ray”。在学术/医学语境中，相关词还可能见到“pelvigraphy”（骨盆影像检查/记录的过程）一类的构词。","词根提示：pelvi-（骨盆）+ -graph（记录/影像/图像）。遇到该词时，通常可根据上下文把它理解为“骨盆影像（多指X光）”。"]}
{"word":"pelvigraphy","summary":{"en":"Pelvigraphy is an X-ray imaging examination of the pelvis, often done with contrast dye.","zh":"Pelvigraphy 指对骨盆/盆腔进行的X光影像检查，常配合造影剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An X-ray imaging test of the pelvis, usually using a contrast dye to make organs or structures show up more clearly.","zh":"骨盆造影／盆腔造影：一种对骨盆（盆腔）进行的X光影像检查，通常会使用造影剂来让器官或结构更清楚。"},"examples":[{"en":"The doctor recommended pelvigraphy to check for an abnormal mass in the pelvic area.","zh":"医生建议做骨盆造影，以检查盆腔区域是否有异常肿块。"},{"en":"Before pelvigraphy, the patient was asked about allergies to contrast dye.","zh":"做骨盆造影之前，医护人员会询问病人是否对造影剂过敏。"}]}],"synonyms":["pelvic radiography","pelvic imaging","contrast pelvic X-ray"],"phonetic":"/ˌpɛl.vɪˈɡræf.i/","extraExplanation":["「pelvi-」来自拉丁语，表示“骨盆”；「-graphy」表示“记录/成像”。合起来就是“对骨盆进行影像记录”。","在现代临床中，这个词不算常见，很多情况下会用更具体的检查名称（如 CT、MRI，或某一器官的造影检查）来替代。具体做哪种检查要看要观察的部位与目的。"]}
{"word":"pelvimeter","summary":{"en":"A pelvimeter is a tool for measuring pelvic dimensions, especially in obstetrics.","zh":"pelvimeter 是用於測量骨盆尺寸的工具，常見於產科情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the dimensions of a pregnant person’s pelvis (especially the pelvic inlet), traditionally to help assess childbirth considerations.","zh":"（骨盆測量器）用來測量孕婦骨盆尺寸（特別是骨盆入口）的儀器，傳統上用於評估分娩相關情況。"},"examples":[{"en":"The doctor used a pelvimeter to estimate pelvic size during the prenatal visit.","zh":"醫師在產檢時用骨盆測量器估算骨盆大小。"},{"en":"In older obstetrics textbooks, the pelvimeter is shown as a common tool for external pelvic measurements.","zh":"在較早期的產科教科書中，骨盆測量器常被用於外部骨盆測量。"}]}],"synonyms":["pelvic caliper","calipers"],"phonetic":"/ˈpɛl.vəˌmiː.tɚ/","extraExplanation":["「pelvimeter」由 pelvis（骨盆）+ -meter（測量儀器）組成。","臨床上，單靠外測骨盆的價值有限；現代產科更常依孕期超音波、病史、胎位與產程進展等綜合判斷，而非僅靠骨盆外部測量。"]}
{"word":"pelvimetric","summary":{"en":"Pelvimetric means “about measuring the pelvis,” often used in obstetrics.","zh":"pelvimetric 指“与骨盆测量有关的”，常见于产科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement of the pelvis, especially in obstetrics to judge whether the pelvis is large enough for childbirth.","zh":"与骨盆测量有关的，尤指产科中用于评估骨盆大小是否适合阴道分娩的。"},"examples":[{"en":"The doctor ordered a pelvimetric assessment because of concerns about a narrow pelvis.","zh":"医生安排了骨盆测量评估，因为担心骨盆偏窄。"},{"en":"Pelvimetric measurements may help plan the safest delivery method.","zh":"骨盆测量数据可能有助于制定最安全的分娩方式。"}]}],"synonyms":["pelvic measurement-related","pelvimetry-related"],"phonetic":"/ˌpɛlviˈmɛtrɪk/","extraExplanation":["“pelvimetric”来自 pelvis（骨盆）+ -metric（测量的）。临床上你可能会看到相关名词：pelvimetry（骨盆测量）。","在现代产科中，是否进行影像学骨盆测量会因国家/医院指南而异；很多情况下更依赖超声、临床评估以及分娩过程中的进展来判断。"]}
{"word":"pelvimetry","summary":{"en":"Pelvimetry means measuring the pelvis, mainly in obstetrics to help judge potential difficulty in childbirth.","zh":"Pelvimetry 指骨盆测量，主要用于产科评估分娩是否可能困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of the size and shape of the pelvis, especially to assess whether childbirth may be difficult","zh":"（尤指为评估分娩难易）对骨盆大小与形状进行测量"},"examples":[{"en":"The doctor ordered pelvimetry to evaluate the pelvis before delivery.","zh":"医生安排了骨盆测量，以在分娩前评估骨盆情况。"},{"en":"In modern care, pelvimetry is used selectively and only when medically necessary.","zh":"在现代医疗中，骨盆测量会选择性使用，并且仅在有医学需要时进行。"}]}],"synonyms":["pelvic measurement","pelvic assessment"],"phonetic":"/pɛlˈvɪmətri/","extraExplanation":["pelvimetry 常见于产科（obstetrics）。传统上可用 X 光做“放射学骨盆测量”（X-ray pelvimetry），但因为辐射与预测准确性有限，如今更多依赖超声、临床评估，以及分娩过程中的观察，只有在特定情况（如骨盆畸形、既往骨盆外伤、胎位异常等）才可能考虑。","词源：pelvi- 来自 pelvis（骨盆），-metry 表示“测量”（如 geometry 几何学、thermometry 测温法）。"]}
{"word":"pelviolithotomy","summary":{"en":"Pelviolithotomy is surgery to remove a kidney stone from the renal pelvis.","zh":"Pelviolithotomy 指通过手术从肾盂取出肾结石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove a kidney stone from the renal pelvis (the funnel-like part of the kidney where urine collects).","zh":"（医学）肾盂切开取石术：通过手术从肾盂（肾脏内汇集尿液的漏斗状部位）取出结石。"},"examples":[{"en":"The urologist recommended a pelviolithotomy because the stone was lodged in the renal pelvis.","zh":"泌尿科医生建议做肾盂切开取石术，因为结石卡在肾盂里。"},{"en":"After the pelviolithotomy, the patient was monitored for bleeding and infection.","zh":"肾盂切开取石术后，医生监测患者是否出现出血和感染。"}]}],"synonyms":["pyelolithotomy","renal pelvis stone removal surgery"],"phonetic":"/ˌpɛl.vi.oʊ.lɪˈθɑt̬.ə.mi/","extraExplanation":["这个词由三部分构成：pelvio-（肾盂/骨盆相关，这里指肾盂）、lith-（结石）、-tomy（切开术）。字面意思就是“切开肾盂取出结石”。","在现代临床中，这类开放手术较少见；许多肾结石更常用体外冲击波碎石（ESWL）、输尿管镜/肾镜取石或经皮肾镜碎石（PCNL）等微创方式处理。但在结石很大、位置特殊或合并解剖问题时仍可能考虑。"]}
{"word":"pelvioperitonitis","summary":{"en":"A medical term for inflammation of the pelvic peritoneum, usually from infection.","zh":"医学用语：盆腔腹膜发生炎症，通常与感染有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the pelvic peritoneum (the lining of the lower abdominal/pelvic cavity), often due to infection spreading from the reproductive organs.","zh":"盆腔腹膜炎：骨盆腔内腹膜（覆盖下腹与盆腔的膜）发生的炎症，常因感染从生殖器官扩散而引起。"},"examples":[{"en":"The doctor suspected pelvioperitonitis because the patient had severe lower abdominal pain and fever.","zh":"医生怀疑是盆腔腹膜炎，因为病人出现严重下腹痛和发烧。"},{"en":"Untreated pelvic infections can sometimes progress to pelvioperitonitis.","zh":"未治疗的盆腔感染有时可能会发展成盆腔腹膜炎。"}]}],"synonyms":["pelvic peritonitis","peritonitis (broader term)"],"phonetic":"/ˌpɛlvi.oʊˌpɛrɪtəˈnaɪtɪs/","extraExplanation":["词源拆解：pelvio-（骨盆/盆腔）+ periton-（腹膜）+ -itis（炎症），合起来就是“盆腔腹膜的炎症”。","属于较少在日常英语中使用的医学术语；临床沟通中更常见的相关表达包括 peritonitis（腹膜炎）和 pelvic inflammatory disease, PID（盆腔炎/盆腔炎性疾病）。"]}
{"word":"pelvioplasty","summary":{"en":"Pelvioplasty is surgery to repair or reshape the renal pelvis to improve urine drainage.","zh":"pelvioplasty 指肾盂成形术：通过手术修复或重塑肾盂以改善尿液引流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to repair or reshape the renal pelvis (the funnel-like part of the kidney that drains urine into the ureter), often to improve urine flow.","zh":"肾盂成形术：一种外科手术，用于修复或重塑肾盂（肾脏中将尿液汇入输尿管的漏斗状结构），常用于改善尿液引流。"},"examples":[{"en":"The urologist recommended pelvioplasty to relieve the obstruction and protect kidney function.","zh":"泌尿科医生建议进行肾盂成形术，以解除梗阻并保护肾功能。"},{"en":"After pelvioplasty, the patient was monitored for pain and signs of infection.","zh":"肾盂成形术后，医生会观察患者的疼痛情况和感染迹象。"}]}],"synonyms":["renal pelvioplasty","pyeloplasty"],"phonetic":"/ˌpɛlviˈæpləsti/","extraExplanation":["这是较为专业的医学术语，常见于泌尿外科语境。临床上它常与“肾盂输尿管连接部梗阻（UPJ obstruction）”等问题相关，目的是恢复尿液从肾盂到输尿管的通畅。","词形结构：pelvi-（与“骨盆/肾盂”相关的词根）+ -plasty（“成形、修补”的后缀）。在医学英语里，-plasty 常表示“修复/重建手术”（如 rhinoplasty 鼻成形术）。"]}
{"word":"pelvioradiography","summary":{"en":"Pelvioradiography means an X-ray examination of the pelvis.","zh":"pelvioradiography 指“骨盆X光检查/骨盆放射摄影”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"X-ray imaging of the pelvis (the hip and pelvic bones), usually to check bones, joints, or certain pelvic conditions.","zh":"骨盆放射摄影；对骨盆（髋部与骨盆骨骼）进行X光成像，常用于检查骨骼、关节或某些骨盆相关状况。"},"examples":[{"en":"The doctor ordered pelvioradiography to look for a pelvic fracture after the fall.","zh":"医生安排做骨盆放射摄影，以检查摔倒后是否有骨盆骨折。"},{"en":"Pelvioradiography can help assess hip alignment and pelvic bone structure.","zh":"骨盆放射摄影有助于评估髋关节对位情况与骨盆骨结构。"}]}],"synonyms":["pelvic radiography","pelvic X-ray","pelvis X-ray"],"phonetic":"/ˌpɛlvi.oʊˌreɪdiˈɑɡrəfi/","extraExplanation":["这是一个较少见、偏专业的医学用词：pelvio-（骨盆）+ radiography（放射摄影）。临床上更常见的说法是“pelvic X-ray / pelvis X-ray（骨盆X光）”。","与CT或MRI相比，X光对骨骼结构显示较好，但对软组织（如肌肉、韧带、器官）的显示不如CT/MRI；具体检查方式会依病情选择。"]}
{"word":"pelvioscopy","summary":{"en":"Pelvioscopy is a medical procedure that uses an endoscope to look at organs in the pelvis, often called pelvic laparoscopy.","zh":"Pelvioscopy 指用内镜观察盆腔器官的医学检查，常被称为“盆腔腹腔镜检查”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical examination of the pelvic organs using a thin instrument with a camera (an endoscope), usually inserted through a small cut in the abdomen; also called pelvic laparoscopy","zh":"盆腔镜检查：用带摄像头的细管状器械（内镜）通过腹部小切口进入体内，观察盆腔器官的医学检查；也常称“盆腔腹腔镜检查”"},"examples":[{"en":"The doctor recommended pelvioscopy to look for possible endometriosis.","zh":"医生建议做盆腔镜检查，以查找是否可能有子宫内膜异位症。"},{"en":"Pelvioscopy can help diagnose causes of chronic pelvic pain.","zh":"盆腔镜检查可以帮助诊断慢性盆腔疼痛的原因。"},{"en":"After pelvioscopy, she was told to rest and watch for signs of infection.","zh":"盆腔镜检查后，她被告知要休息，并留意是否有感染迹象。"}]}],"synonyms":["pelvic laparoscopy","laparoscopy","peritoneoscopy"],"phonetic":"/ˌpɛlviˈɑskəpi/","extraExplanation":["“pelvioscopy”在现代英语医学语境中相对少见，临床和科普材料更常用“laparoscopy / pelvic laparoscopy（腹腔镜/盆腔腹腔镜）”。","词源可拆解为：pelvi-（骨盆）+ -oscopy（观察、镜检），与“endoscopy（内镜检查）”“colonoscopy（结肠镜）”结构类似。"]}
{"word":"pelviotomy","summary":{"en":"Pelviotomy is a surgical incision into the pelvis, historically used to help with difficult childbirth but now uncommon.","zh":"Pelviotomy 指对骨盆进行外科切开，历史上用于处理难产、扩大产道，但现已不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which an incision is made into the pelvis (especially a procedure to enlarge the pelvic opening during difficult childbirth; now rare).","zh":"骨盆切开术；在骨盆上进行切开的一种外科手术（尤指为解决难产而扩大骨盆通道的手术；现较少见）。"},"examples":[{"en":"In modern obstetrics, pelviotomy is rarely performed because safer alternatives are available.","zh":"在现代产科中，由于有更安全的替代方法，骨盆切开术很少实施。"},{"en":"The textbook mentioned pelviotomy as a historical option for obstructed labor.","zh":"教材把骨盆切开术作为处理梗阻性分娩的一种历史性选择提到。"}]}],"synonyms":["pelvotomy","pelvic osteotomy (related term)"],"phonetic":"/ˌpɛlviˈɑːtəmi/","extraExplanation":["该词由 pelv-（骨盆）+ -otomy（“切开术”，表示外科切开）构成。","在历史上，它与难产处理有关，但现代临床更常见的选择通常是剖宫产等方式；具体适应证与术式需由专业医师判断。"]}
{"word":"pelviperitonitis","summary":{"en":"Pelviperitonitis is inflammation of the pelvic peritoneum, usually due to infection.","zh":"pelviperitonitis 指盆腔腹膜的炎症，通常与感染有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the peritoneum (the lining of the abdominal cavity) in the pelvic area, often caused by infection (for example, pelvic inflammatory disease) or spread from nearby organs.","zh":"盆腔腹膜炎：发生在盆腔部位的腹膜（腹腔内壁的薄膜）炎症，常由感染引起（如盆腔炎症性疾病），也可能由邻近器官炎症扩散所致。"},"examples":[{"en":"The doctor suspected pelviperitonitis because she had severe lower abdominal pain and fever.","zh":"医生因她出现严重下腹痛和发热而怀疑是盆腔腹膜炎。"},{"en":"Prompt treatment of the underlying infection can help prevent complications from pelviperitonitis.","zh":"及时治疗原发感染有助于预防盆腔腹膜炎的并发症。"}]}],"synonyms":["pelvic peritonitis","peritonitis (pelvic)"],"phonetic":"/ˌpɛlviˌpɛrɪtəˈnaɪtɪs/","extraExplanation":["这是一个医学术语，由三部分构成：pelvi-（盆腔）+ peritone-（腹膜）+ -itis（炎症）。在日常英语中非常少见，更多出现在医学病历、论文或影像学/妇科相关语境中。","常见相关病因包括盆腔感染（如PID）、阑尾炎或肠道/生殖系统感染向盆腔腹膜扩散等；具体诊断与治疗应由专业医生判断。"]}
{"word":"pelvirectal","summary":{"en":"“Pelvirectal” is an anatomical adjective meaning “involving the pelvis and the rectum.”","zh":"“pelvirectal” 是解剖学形容词，意思是“与骨盆和直肠相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the pelvis and the rectum (used mainly in anatomical or medical contexts).","zh":"（多用于解剖学/医学语境）与骨盆和直肠都有关的。"},"examples":[{"en":"The surgeon inspected the pelvirectal region for signs of infection.","zh":"外科医生检查了骨盆-直肠相关区域是否有感染迹象。"},{"en":"Pain in the pelvirectal area can have multiple causes and needs evaluation.","zh":"骨盆-直肠区域的疼痛可能有多种原因，需要进一步评估。"}]}],"synonyms":["pelvic-rectal","pelvic and rectal (related)"],"phonetic":"/ˌpɛlviˈrɛktəl/","extraExplanation":["该词较少单独使用，常见于复合术语或解剖结构名称中，例如 *pelvirectal fossa*（骨盆直肠窝/坐骨直肠窝相关区域，具体译法会随教材与语境而不同）。","词源构成：*pelvi-*（与骨盆 pelvis 有关）+ *rectal*（与直肠 rectum 有关）。用于精确描述“横跨/同时涉及骨盆与直肠”的部位或结构。"]}
{"word":"pelvis","summary":{"en":"Pelvis means the bone structure at the base of the spine that connects to the legs and supports lower-body organs.","zh":"Pelvis 指位于脊柱底部、连接下肢并支撑下腹部器官的骨性结构，即“骨盆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The bony structure at the base of the spine that connects the spine to the legs and supports the organs in the lower abdomen.","zh":"骨盆；位于脊柱底部的骨性结构，连接脊柱与双腿，并支撑下腹部的器官。"},"examples":[{"en":"The pelvis helps support your body weight when you stand and walk.","zh":"骨盆在你站立和行走时帮助支撑体重。"},{"en":"The doctor ordered an X-ray of his pelvis after the fall.","zh":"摔倒后，医生安排他做骨盆的X光检查。"},{"en":"She felt pain in her pelvis after running for a long time.","zh":"长时间跑步后，她感到骨盆部位疼痛。"}]}],"synonyms":["pelvic girdle","hip girdle"],"phonetic":"/ˈpɛlvɪs/","extraExplanation":["“pelvis”在医学和解剖学语境中非常常见，也常与“hip（髋部）”一起出现：hip更偏外侧/关节位置，而pelvis更强调整体的骨盆结构。","常见搭配：pelvic bone（骨盆骨）、pelvic pain（盆腔/骨盆疼痛）、pelvic fracture（骨盆骨折）、pelvic floor（盆底）。","词源上来自拉丁语，原义与“盆/器皿”有关，因为骨盆的形状像一个盆，用来承托内部器官。"]}
{"word":"pelvisacral","summary":{"en":"Pelvisacral means “related to the pelvis and the sacrum,” mainly used in medical/anatomy contexts.","zh":"pelvisacral 指“与骨盆和骶骨相关的”，多用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the pelvis and the sacrum (the triangular bone at the base of the spine).","zh":"与骨盆和骶骨（脊柱底部的三角形骨）都有关的；骨盆—骶骨的。"},"examples":[{"en":"The doctor examined the pelvisacral area to check for pain and swelling.","zh":"医生检查了骨盆—骶骨区域，以确认是否有疼痛和肿胀。"},{"en":"An MRI may be used to evaluate pelvisacral soft-tissue injuries.","zh":"可能会使用核磁共振来评估骨盆—骶骨部位的软组织损伤。"}]}],"synonyms":["pelvic and sacral","pelvosacral"],"phonetic":"/ˌpɛlvɪˈseɪkrəl/","extraExplanation":["这个词较少见，常见于医学/解剖学语境；更常看到的相关术语包括“sacroiliac（骶髂的）”“pelvic（骨盆的）”“sacral（骶骨的）”。","构词上可理解为 pelvis（骨盆）+ sacral（骶骨的），用于强调两者相关的区域、结构或检查/损伤。"]}
{"word":"pelvises","summary":{"en":"“Pelvises” means more than one pelvis (the hip/basin-shaped bone structure).","zh":"“Pelvises”表示多个骨盆（髋部的盆状骨性结构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “pelvis”: the bony structures at the base of the spine that support the trunk and connect the spine to the legs (hips).","zh":"“pelvis（骨盆）”的复数：位于脊柱底部的骨性结构，支撑躯干并连接脊柱与双腿（髋部）。"},"examples":[{"en":"The X-ray showed fractures in both pelvises.","zh":"X 光片显示两侧骨盆都有骨折。"},{"en":"In anatomy class, we compared male and female pelvises.","zh":"在解剖课上，我们比较了男性和女性的骨盆。"}]}],"synonyms":["pelves (less common, more medical)"],"phonetic":"ˈpɛlvɪsiz","extraExplanation":["“pelvis”的复数常见两种拼法：pelvises（更规则、更常见于通用写作）和 pelves（更偏医学/专业语境）。两者意思相同。","在日常英语里，人们更常直接说“pelvis”或“hip area（髋部区域）”；“pelvises”多见于医学、运动损伤、解剖学等语境。"]}
{"word":"pelvisternal","summary":{"en":"Pelvisternal is a rare technical adjective meaning ‘related to the pelvis and the sternum.’","zh":"pelvisternal 是一个罕见的专业形容词，表示“与骨盆和胸骨有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Relating to both the pelvis and the sternum (breastbone).","zh":"（罕见/医学术语）与骨盆和胸骨（胸前的扁骨）两者有关的。"},"examples":[{"en":"The report mentions a pelvisternal alignment issue after the accident.","zh":"报告提到事故后出现了“骨盆—胸骨”对齐的问题。"},{"en":"Some older anatomy texts describe a pelvisternal axis to explain posture.","zh":"一些较旧的解剖学教材用“骨盆—胸骨轴”来解释姿势。"}]}],"synonyms":["pelvic-sternal","pelvic and sternal","related to the pelvis and sternum"],"phonetic":"/ˌpɛl.vɪˈstɝ.nəl/","extraExplanation":["“pelvisternal”不是日常英语词汇，主要可能出现在较旧或非常专业的解剖学/姿势评估语境中。现代写作里更常见的表达是把两个部位分开写，如“pelvic and sternal …”，或用连字符写成“pelvic-sternal …”。","构词法：pelvis（骨盆）+ sternal（胸骨的）。如果你是在论文、病历或教材里看到它，也有可能是作者自造的复合形容词，表示“从骨盆到胸骨/同时涉及骨盆与胸骨”的意思。"]}
{"word":"pelvisternum","summary":{"en":"“Pelvisternum” is not a standard word; it likely combines “pelvis” and “sternum.”","zh":"“pelvisternum”不是标准词，可能是把“骨盆（pelvis）”和“胸骨（sternum）”拼在一起的自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a made-up blend (portmanteau) of “pelvis” and “sternum,” two different bones/areas of the body.","zh":"不是标准英语单词。它看起来像把“pelvis（骨盆）”和“sternum（胸骨）”拼在一起的人为混合词（合成/拼缀词）。"},"examples":[{"en":"I couldn’t find “pelvisternum” in a medical dictionary; did you mean “pelvis” or “sternum”?","zh":"我在医学词典里找不到“pelvisternum”；你是想说“pelvis（骨盆）”还是“sternum（胸骨）”？"},{"en":"The injury was to the pelvis, not the sternum.","zh":"受伤的是骨盆部位，不是胸骨。"}]}],"phonetic":"/ˌpɛlvɪˈstɝnəm/","extraExplanation":["“pelvis（骨盆）”位于身体下部，连接脊柱与下肢；“sternum（胸骨）”位于胸部前方，是肋骨连接的重要部位。两者位置与功能差异很大，所以在正式医学英语中一般不会合成一个词来表示。","如果你是在某本书、游戏、科幻作品或解剖学插图里看到“pelvisternum”，它可能是作者自创术语（用于特定世界观或幽默效果）。在学术/医疗写作中建议改用标准词汇。"]}
{"word":"pelvospondylitis","summary":{"en":"Pelvospondylitis is inflammation affecting the pelvis (often the sacroiliac joints) and the spine, sometimes used to describe ankylosing spondylitis.","zh":"Pelvospondylitis 指累及骨盆（常为骶髂关节）与脊柱的炎症，有时用于描述强直性脊柱炎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition involving inflammation of the pelvis (especially the sacroiliac joints) and the spine; often used in older or specialized writing to refer to ankylosing spondylitis or a similar pattern of inflammation.","zh":"（医学）指骨盆（尤指骶髂关节）与脊柱的炎症；在较旧或专业文献中常用于指强直性脊柱炎或类似的炎症模式。"},"examples":[{"en":"The report described chronic pelvospondylitis with pain and stiffness in the lower back and hips.","zh":"报告描述了慢性骨盆脊柱炎，伴随下背部与髋部疼痛和僵硬。"},{"en":"In older medical texts, pelvospondylitis was sometimes discussed as part of ankylosing spondylitis.","zh":"在较旧的医学文献中，“骨盆脊柱炎”有时被作为强直性脊柱炎的一部分来讨论。"}]}],"synonyms":["ankylosing spondylitis (context-dependent)","sacroiliitis (when mainly the sacroiliac joints are involved)"],"phonetic":"/ˌpɛlvoʊˌspɑn(d)ɪˈlaɪtɪs/","extraExplanation":["词源拆解有助记忆：pelvo-（骨盆）+ spondyl-（椎骨/脊柱）+ -itis（炎症）=“骨盆与脊柱的炎症”。","该词在现代临床交流中相对少见，更常见的说法是 ankylosing spondylitis（强直性脊柱炎）或 sacroiliitis（骶髂关节炎），具体用词取决于炎症部位与诊断。"]}
{"word":"pelycogram","summary":{"en":"“pelycogram” is not a standard English word; it’s probably a misspelling. Provide the sentence or correct spelling for an accurate definition.","zh":"“pelycogram”不是标准英语单词，可能是拼写错误。请提供原句或正确拼写以便准确释义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a very rare/technical term. Please confirm the spelling or share the sentence where you saw it.","zh":"这不是常见的英语单词。很可能是拼写错误或极少见/专业术语。请确认拼写，或提供你看到它的句子。"},"examples":[{"en":"I can’t find “pelycogram” in major English dictionaries—could you check the spelling?","zh":"我在主流英语词典里查不到“pelycogram”——你能检查一下拼写吗？"},{"en":"If you paste the full sentence, I can guess what word it was meant to be.","zh":"如果你把完整句子贴出来，我可以帮你推测它本来想表达的单词。"}]}],"extraExplanation":["“pelycogram”看起来像是把其他词拼错了。常见的相近词形包括：\n- pictogram（象形图/图形符号）\n- hologram（全息图）\n- cardiogram / electrocardiogram（心电图）\n这些词里的“-gram”通常表示“记录/图/写下的东西”。","如果你告诉我它出现的领域（医学、图像处理、生物学等）或发一张截图/原句，我可以更准确判断它可能对应哪个词。"]}
{"word":"pelycography","summary":{"en":"“pelycography” is not a standard word; it most likely refers to **pyelography**, an imaging test of the kidney’s renal pelvis and urinary tract.","zh":"“pelycography”不是标准词；它很可能指 **pyelography（肾盂造影）**，用于检查肾盂与泌尿道的影像检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) **pyelography**: a medical imaging test (X-ray/CT) used to examine the **renal pelvis** (the central part of the kidney) and the urinary tract, often using a contrast dye.","zh":"（很可能是拼写错误）**pyelography（肾盂造影）**：一种医学影像检查（X 光/CT），用于观察**肾盂**（肾脏中央集尿的部位）及泌尿道，常需要注入造影剂。"},"examples":[{"en":"The doctor ordered an intravenous pyelography exam to check for a blockage.","zh":"医生安排了静脉肾盂造影检查，以确认是否有梗阻。"},{"en":"Pyelography can help show stones or narrowing in the urinary tract.","zh":"肾盂造影有助于显示结石或泌尿道狭窄。"}]}],"synonyms":["intravenous pyelogram (IVP)","pyelogram","urography"],"phonetic":"/ˌpaɪəˈlɑɡrəfi/","extraExplanation":["“pelycography”在常见英语词典与医学术语中并不常见，最接近且常用的术语通常是 **pyelography（肾盂造影）**。","词根提示：**pyelo-** 表示“肾盂（renal pelvis）”，**-graphy** 表示“成像/记录”。如果你想表达的是“骨盆造影”，更可能是 **pelvicography**（用于骨盆相关检查的术语，使用场景较少且更专科）。","如果你能提供原句或你看到它的上下文（报告/论文/对话），我可以帮你确认到底指哪一种检查。"]}
{"word":"pelycology","summary":{"en":"“Pelycology” is likely a misspelling of “phycology,” the study of algae.","zh":"“pelycology”很可能是“phycology（藻类学）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) Likely a misspelling of “phycology,” the scientific study of algae (including seaweeds).","zh":"（不是标准英语词）很可能是“phycology”的拼写错误，指研究藻类（包括海藻/海带等大型藻类）的学科。"},"examples":[{"en":"She is taking a phycology course to learn about freshwater algae.","zh":"她在上一门藻类学课程，学习淡水藻类。"},{"en":"Phycology helps scientists understand algal blooms in lakes and oceans.","zh":"藻类学帮助科学家理解湖泊和海洋中的藻华现象。"}]}],"synonyms":["algal science","study of algae"],"phonetic":"/faɪˈkɑlədʒi/","extraExplanation":["“pelycology”在常见词典与学术用语中几乎找不到对应词条，最接近且常见的是“phycology”（藻类学）。拼写上容易混淆的是：phycology（藻类学） vs. mycology（真菌学，研究蘑菇/霉菌等）。如果你告诉我你看到这个词的句子或来源（论文/课本/截图），我也可以帮你更准确地判断原词。"]}
{"word":"pelycometer","summary":{"en":"A rare term likely referring to a pelvimeter—an instrument for measuring pelvic dimensions.","zh":"一个罕见词，通常指“pelvimeter（骨盆测量器）”，用于测量骨盆尺寸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A measuring instrument used in obstetrics to measure the dimensions of the pelvis; likely a misspelling or variant form of “pelvimeter.”","zh":"（罕见/医学术语）一种在产科中用于测量骨盆尺寸的测量器械；很可能是“pelvimeter（骨盆测量器）”的拼写错误或异体写法。"},"examples":[{"en":"The clinician used a pelvimeter (sometimes misspelled as “pelycometer”) to estimate pelvic width.","zh":"临床医生用骨盆测量器（有时会被误拼为“pelycometer”）来估算骨盆宽度。"},{"en":"In older medical notes, you may see unusual spellings of tools like the pelvimeter.","zh":"在较早的病历记录里，你可能会看到像骨盆测量器这类器械出现不常见的拼写。"}]}],"synonyms":["pelvimeter"],"phonetic":"/ˌpɛlˈvɪmɪtər/","extraExplanation":["“pelycometer”不是现代英语里常见、标准的拼写。更常见的术语是“pelvimeter”（骨盆测量器）。如果你是在论文、病历或古旧文献中看到它，建议核对原文是否为印刷/转录错误，或是否指同一类器械。","词源提示：pelvi- 来自拉丁语 pelvis（骨盆），-meter 来自希腊语 metron（测量）。因此 pelvimeter 直译就是“骨盆测量器”。"]}
{"word":"pelycometry","summary":{"en":"“Pelycometry” is not a standard English word; it most likely refers to pelvimetry, the measurement of the pelvis.","zh":"“pelycometry”不是标准英语词汇；多半指pelvimetry（骨盆测量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) the medical measurement of the pelvis, usually to assess pelvic size/shape in relation to childbirth.","zh":"（可能为拼写错误）骨盆测量：医学上测量骨盆的大小或形状，常用于评估分娩相关的骨盆条件。"},"examples":[{"en":"The doctor ordered pelvimetry to evaluate whether the pelvis was large enough for vaginal delivery.","zh":"医生安排做骨盆测量，以评估骨盆是否足够大、能否经阴道分娩。"},{"en":"Imaging-based pelvimetry may be done with X-ray, CT, or MRI depending on the case.","zh":"根据具体情况，影像学骨盆测量可能通过X光、CT或MRI进行。"}]}],"synonyms":["pelvimetry","pelvic measurement"],"phonetic":"/ˌpɛlviˈkɑmətri/","extraExplanation":["“pelycometry”在常见英语词典与医学用语中并不常见，实际更常用的词是 **pelvimetry**（骨盆测量）。","词源上通常可理解为 *pelvi-*（pelvis，骨盆）+ *-metry*（测量）。如果你是在报告、论文或检查单上看到该词，建议核对原文拼写或上下文。"]}
{"word":"pelycosaur","summary":{"en":"A pelycosaur is an early prehistoric synapsid (not a dinosaur), like Dimetrodon, from the late Paleozoic.","zh":"pelycosaur 指古生代晚期的早期合弓类史前动物（不是恐龙），例如异齿龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric, lizard-like synapsid (an early relative on the line leading to mammals) that lived mainly in the late Paleozoic Era, such as Dimetrodon","zh":"一种史前的“似蜥蜴”合弓类动物（属于通往哺乳动物演化谱系的早期近亲），主要生活在古生代晚期，例如异齿龙（Dimetrodon）"},"examples":[{"en":"Dimetrodon is a famous pelycosaur often mistaken for a dinosaur.","zh":"异齿龙是很著名的盘龙类动物，但常被误认为恐龙。"},{"en":"In the museum exhibit, the pelycosaur fossils were displayed next to early amphibians.","zh":"在博物馆展厅里，盘龙类化石与早期两栖动物的化石一起展出。"}]}],"synonyms":["synapsid (general term)","Dimetrodon (example, not a true synonym)"],"phonetic":"/ˌpɛlɪkəˈsɔr/","extraExplanation":["“Pelycosaur”是较早期的分类用语，日常科普里常用来指“盘龙类”一类早期合弓类动物；更严格的现代分类中，人们有时会改用更精确的类群名称（例如某些属于“帆蜥类/剑龙类”的合弓类）。","学习点：很多盘龙类并不是恐龙，它们生活在恐龙出现之前（主要在二叠纪），而且与哺乳动物的亲缘关系比与爬行动物更近，这也是为什么英文介绍里常强调它们是 synapsids（合弓类）。"]}
{"word":"pelycosauria","summary":{"en":"Pelycosauria: an extinct group of early synapsids (“pelycosaurs”) from the late Carboniferous–early Permian, related to the mammal line.","zh":"Pelycosauria（盘龙目）：石炭纪晚期至二叠纪早期的已灭绝早期合弓类（盘龙类），与哺乳动物谱系相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group (clade) of early synapsid reptiles—often called “pelycosaurs”—that lived mainly in the late Carboniferous to early Permian periods and are related to the ancestors of mammals.","zh":"（古生物）盘龙目：已灭绝的一类早期合弓类动物（常被统称为“盘龙类/盘龙”），主要生活在石炭纪晚期到二叠纪早期，与哺乳动物祖先的谱系有关。"},"examples":[{"en":"Dimetrodon is one of the best-known animals often placed within Pelycosauria.","zh":"异齿龙（Dimetrodon）是最著名、常被归入盘龙目（Pelycosauria）的动物之一。"},{"en":"In many books, Pelycosauria is discussed as an early stage in synapsid evolution.","zh":"在许多书里，盘龙目（Pelycosauria）常被作为合弓类进化早期阶段来介绍。"}]}],"synonyms":["pelycosaurs","pelycosaur"],"phonetic":"/ˌpɛlɪkoʊˈsɔriə/","extraExplanation":["“Pelycosauria”是学术性较强的分类名称，日常科普中更常见的是非正式用语“pelycosaurs（盘龙类）”。","词源上常被解释为来自希腊语成分，含“盆/碗状（pelēx/pelyx）+蜥蜴（sauros）”的意思；属于历史命名传统的一部分。","注意：盘龙目/盘龙类并不是“恐龙”。它们属于更接近哺乳动物祖先的合弓类谱系；而恐龙属于主龙类（archosaurs）。"]}
{"word":"pelycosaurian","summary":{"en":"Pelycosaurian means “related to or resembling pelycosaurs,” and can also mean a pelycosaur animal itself.","zh":"pelycosaurian 指“与盘龙类有关/类似盘龙类的”，也可作名词指“盘龙类动物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pelycosaurs (early, mostly Permian-era synapsids such as Dimetrodon), or resembling them.","zh":"与“盘龙类/盘龙目动物”（如异齿龙 Dimetrodon 等早期、主要生活在二叠纪的合弓类）有关的；或外形/特征类似盘龙类的。"},"examples":[{"en":"Dimetrodon is often described as a pelycosaurian synapsid, not a dinosaur.","zh":"异齿龙常被描述为盘龙类的合弓动物，而不是恐龙。"},{"en":"The museum’s Permian exhibit includes several pelycosaurian fossils and reconstructions.","zh":"博物馆的二叠纪展区包含多件盘龙类化石与复原模型。"}]},{"partOfSpeech":"n.","definition":{"en":"A pelycosaurian animal; a member of the pelycosaur group.","zh":"盘龙类动物；盘龙类的一员。"},"examples":[{"en":"Some pelycosaurians were top predators in their ecosystems.","zh":"一些盘龙类在其生态系统中是顶级掠食者。"},{"en":"The paper compares early pelycosaurians with later therapsids.","zh":"这篇论文比较了早期盘龙类与后来的兽孔类。"}]}],"synonyms":["pelycosaur-related","pelycosaur (adj./n., in context)","synapsid (broader term)"],"phonetic":"ˌpɛlɪkoʊˈsɔriən","extraExplanation":["“pelycosaurian”多见于古生物学/科普写作中，用来强调这些动物属于“合弓类（synapsids）”谱系：更接近哺乳动物的远古亲戚，而不是恐龙（恐龙属于主龙类/爬行动物一支）。","词形上：pelycosaur + -ian（表示“……的/……的人或物”）。在学术语境里也常见“pelycosaur”“pelycosaur-grade”等说法，用于指称一类较早、较原始的合弓动物。"]}

