{"word":"pembina","summary":{"en":"Pembina is most commonly a North American place name (a town in North Dakota and several rivers). It can also be a Malay/Indonesian word meaning a mentor or developer, seen in program titles.","zh":"Pembina 最常见是北美地名（北达科他州小镇及数条同名河流）。它也可能来自马来语/印尼语，意为“导师/培育者/建设者”，常用于项目或职称名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in northeastern North Dakota, U.S., on the border with Canada.","zh":"（美国）北达科他州东北部、靠近加拿大全境边界的一座小镇：彭比纳（Pembina）。"},"examples":[{"en":"We crossed into the U.S. at the Pembina border station.","zh":"我们在彭比纳口岸入境美国。"},{"en":"Pembina is one of the oldest European settlements in North Dakota.","zh":"彭比纳是北达科他州最早的欧洲人定居点之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A river in central Canada and the northern U.S., known as the Pembina River (there is one in Manitoba and another in Alberta).","zh":"彭比纳河（Pembina River）：加拿大与美国北部的河流名称（如马尼托巴省、阿尔伯塔省均有同名河流）。"},"examples":[{"en":"They went fishing along the Pembina River.","zh":"他们去彭比纳河边钓鱼了。"},{"en":"Spring melt can raise water levels on the Pembina River.","zh":"春季融雪会让彭比纳河水位上涨。"}]},{"partOfSpeech":"n.","definition":{"en":"In Malay/Indonesian, a ‘builder/developer’ or ‘mentor/coach’—often used in names of training programs (not a standard English word).","zh":"（马来语/印尼语）“建设者/培育者”或“导师/教练”，常见于培训项目名称中（不算标准英语词）。"},"examples":[{"en":"The program calls its volunteers pembina (mentors).","zh":"这个项目把志愿者称为 pembina（导师）。"},{"en":"She works as a pembina for new teachers.","zh":"她担任新教师的 pembina（带教/导师）。"}]}],"synonyms":["(place name) —","mentor (Malay/Indonesian sense)","coach (Malay/Indonesian sense)","trainer (Malay/Indonesian sense)"],"phonetic":"/pɛmˈbaɪnə/","extraExplanation":["作为北美地名时，Pembina 常读作 “pem-BY-nuh”。该地名源自奥吉布瓦语（Ojibwe）词根，常被解释为与“高丛蔓越莓/荚蒾（highbush cranberry）”有关，这也反映了当地早期的自然环境与原住民语言影响。"]}
{"word":"pembinas","summary":{"en":"Pembinas is an Indonesian/Malay term meaning “destroyer/exterminator,” not commonly used in standard English.","zh":"Pembinas 是印尼语/马来语词，意为“毁灭者/消灭者”，在标准英语中并不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) An Indonesian/Malay-derived term meaning a destroyer or exterminator; someone or something that causes destruction.","zh":"（非标准英语词）源自印尼语/马来语，指“毁灭者/消灭者”；造成毁坏或消灭的人或事物。"},"examples":[{"en":"In some Indonesian texts, pembinas can describe an invader seen as a destroyer of a community.","zh":"在一些印尼语文本中，pembinas 可用来形容被视为“毁灭者”的入侵者。"},{"en":"The word pembinas is sometimes used in religious or political writing to mean an agent of ruin.","zh":"pembinas 有时用于宗教或政治写作中，表示“带来毁灭的势力/人”。"}]}],"synonyms":["destroyer","exterminator","devastator"],"phonetic":"/pɛmˈbiːnɑːs/","extraExplanation":["“pembinas”更常见于印尼语/马来语语境；在英语里通常不会单独使用，除非是在讨论原文、翻译、文化/历史材料时保留外来词。","构词上它与印尼语/马来语中表示“毁灭/消灭”的词根相关；英语中更常用的对应词是 destroyer, exterminator, devastator（语气与场景不同）。"]}
{"word":"pembroke","summary":{"en":"Pembroke is most commonly a Welsh place name, but it can also refer to a surname, the Pembroke Welsh Corgi, or institutions like Pembroke College.","zh":"Pembroke 最常见是威尔士地名；也可指姓氏/名字、彭布罗克威尔士柯基犬，或彭布罗克学院等机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Wales, UK, and a common place name (including Pembroke and Pembroke Dock) associated with Pembrokeshire.","zh":"英国威尔士的一个城镇名称，也是常见地名（如彭布罗克、彭布罗克港），与彭布罗克郡有关。"},"examples":[{"en":"They visited Pembroke while traveling through Wales.","zh":"他们在威尔士旅行时参观了彭布罗克。"},{"en":"Pembroke Dock is a nearby town with a historic harbor.","zh":"彭布罗克港是附近一座拥有历史港口的城镇。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname and given name used in English-speaking cultures.","zh":"英语文化中使用的姓氏或名字。"},"examples":[{"en":"Ms. Pembroke will lead today’s meeting.","zh":"彭布罗克女士将主持今天的会议。"},{"en":"The author signed the book as J. Pembroke.","zh":"作者以 J. Pembroke 的名字在书上签名。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “Pembroke Welsh Corgi,” a breed of small herding dog known for short legs and a fox-like face.","zh":"“彭布罗克威尔士柯基犬”的简称，一种小型牧牛犬，以短腿和狐狸般的脸部特征闻名。"},"examples":[{"en":"Her Pembroke is friendly and very smart.","zh":"她的彭布罗克柯基很友好也很聪明。"},{"en":"Pembrokes are often compared with Cardigan Welsh corgis.","zh":"彭布罗克柯基常被拿来和卡迪根威尔士柯基比较。"}]},{"partOfSpeech":"n.","definition":{"en":"The name of several institutions, especially “Pembroke College” (notably at the University of Oxford and the University of Cambridge).","zh":"一些机构的名称，尤其是“彭布罗克学院”（以牛津大学与剑桥大学的彭布罗克学院最为著名）。"},"examples":[{"en":"She studied history at Pembroke College, Oxford.","zh":"她在牛津大学彭布罗克学院学习历史。"},{"en":"Pembroke College, Cambridge, is one of the university’s oldest colleges.","zh":"剑桥大学彭布罗克学院是该校最古老的学院之一。"}]}],"synonyms":["Pembroke Welsh Corgi (in dog context)","Pembroke College (as a full institution name)"],"phonetic":"ˈpɛmˌbroʊk","extraExplanation":["“Pembroke”源自威尔士地区的地名传统，常被理解为与“岬角/海角（promontory）”相关的地理含义，因此在英国地名中带有浓厚的地域色彩。","在犬种语境里，说“a Pembroke”通常指彭布罗克威尔士柯基犬；另一种常见近亲是 Cardigan Welsh Corgi（卡迪根威尔士柯基），两者在体型与耳朵、尾巴等特征上常被比较。","在学术语境中，“Pembroke College”最常指牛津或剑桥的学院；写作时通常要加上学校或城市（Oxford/Cambridge）以避免混淆。"]}
{"word":"pemetrexed","summary":{"en":"Pemetrexed is a chemotherapy drug used for certain cancers, especially some lung cancers and mesothelioma.","zh":"培美曲塞是一种化疗药物，用于某些癌症的治疗，尤其是部分肺癌和间皮瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemotherapy medicine used to treat certain cancers, especially some types of lung cancer and mesothelioma; it works by blocking how cells make and use folate, which slows cancer cell growth","zh":"培美曲塞：一种化疗药物，用于治疗某些癌症，尤其是部分类型的肺癌和间皮瘤；其作用方式是阻断细胞对叶酸相关物质的合成与利用，从而减缓癌细胞生长"},"examples":[{"en":"The doctor recommended pemetrexed combined with another drug for advanced lung cancer.","zh":"医生建议在晚期肺癌治疗中将培美曲塞与另一种药物联合使用。"},{"en":"Patients may receive folic acid and vitamin B12 to reduce side effects when taking pemetrexed.","zh":"使用培美曲塞时，患者可能会同时补充叶酸和维生素B12以减少副作用。"}]}],"synonyms":["Alimta (brand name)","antifolate chemotherapy drug"],"phonetic":"/ˌpɛmɪˈtrɛksɛd/","extraExplanation":["“pemetrexed”是药物通用名（generic name），常见商品名之一是Alimta。它属于抗叶酸类（antifolate）化疗药，临床上常用于“非小细胞肺癌（non-small cell lung cancer, NSCLC）”和“恶性胸膜间皮瘤（malignant pleural mesothelioma）”。","用法语境：在医学英语里常出现在治疗方案描述中，如“pemetrexed + cisplatin（培美曲塞+顺铂）”或“pemetrexed maintenance therapy（培美曲塞维持治疗）”。","学习提示：药名通常重音和发音不完全按拼写直觉来；在就医沟通中，更重要的是能听懂医生提到的药名、联合用药（combined with）、以及常见搭配词：dose（剂量）、infusion（输注/静滴）、side effects（副作用）、maintenance（维持治疗）。"]}
{"word":"pemican","summary":{"en":"Pemmican is a traditional North American survival food made from dried meat mixed with fat (sometimes berries), valued for long storage and high calories.","zh":"Pemmican是一种北美传统的“生存口粮”，由风干肉与油脂（有时加浆果）混合制成，特点是耐储存、热量高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-energy food made from dried lean meat (often bison or beef) that is pounded and mixed with melted fat; sometimes dried berries are added. It keeps well for a long time and was used for travel and survival.","zh":"一种高热量耐储存的食物：把风干的瘦肉（常见为野牛或牛肉）捣碎后与融化的油脂混合；有时会加入干浆果。常用于长途旅行、野外生存。"},"examples":[{"en":"The expedition packed pemmican because it was light, calorie-dense, and didn’t spoil quickly.","zh":"探险队带了pemmican，因为它重量轻、热量高，而且不容易变质。"},{"en":"Historically, pemmican helped traders and travelers survive long winters on the plains.","zh":"在历史上，pemmican帮助商人和旅行者在大平原的漫长冬季中维持生计。"}]}],"synonyms":["dried-meat ration","trail food","survival ration","jerky-and-fat mix"],"phonetic":"/ˈpɛmɪkən/","extraExplanation":["“pemmican”一词源自克里语（Cree）等原住民语言，后来进入英语；在北美历史中与原住民饮食传统以及皮毛贸易时代（fur trade）的长途运输密切相关。","常见拼写是“pemmican”（双m）；你输入的“pemican”也会被用作变体拼写，但较少见。"]}
{"word":"pemicans","summary":{"en":"Pemmican (plural: pemmicans) is a traditional, long-lasting, high-energy food made from dried meat mixed with fat, sometimes with berries.","zh":"Pemmican（复数：pemmicans）是一种传统的高能量耐储存食品，由干肉与脂肪混合制成，有时加入干浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional food made from dried meat (often bison or deer) mixed with fat, sometimes with dried berries; it is high-energy and keeps well for a long time.","zh":"一种传统食品，由干肉（常见为野牛或鹿肉）与脂肪混合制成，有时会加入干浆果；能量高、易保存。"},"examples":[{"en":"The explorers carried pemmican because it could last for months.","zh":"探险者携带肉干脂（pemmican），因为它能保存好几个月。"},{"en":"Indigenous communities made pemmican for travel and winter storage.","zh":"一些原住民社群制作肉干脂，用于旅行和冬季储存。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of “pemmican” (some people also use “pemmican” as both singular and plural).","zh":"“pemmican”的复数形式（也有人用“pemmican”同时表示单数和复数）。"},"examples":[{"en":"Different pemmicans were made with different meats and berries.","zh":"不同种类的肉干脂会用不同的肉和浆果来制作。"}]}],"synonyms":["dried-meat ration","trail food","jerky-and-fat mixture"],"phonetic":"/ˈpɛmɪkən/","extraExplanation":["“pemicans”更常见的拼写是“pemmicans”，单数为“pemmican”。","词源来自克里语（Cree）相关词，后来在北美毛皮贸易与探险语境中进入英语。它常与加拿大历史、草原地区的野牛、以及长途跋涉的补给文化联系在一起。"]}
{"word":"pemmican","summary":{"en":"Pemmican is a calorie-dense, long-lasting food made from dried meat mixed with fat (sometimes with berries).","zh":"Pemmican是把干肉与脂肪（有时加干浆果）混合制成的高热量、耐储存食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional food made from dried meat (often buffalo/bison), mixed with fat and sometimes dried berries; it is very high in calories and keeps well for a long time.","zh":"一种传统耐储存食物：把干肉（常为野牛/水牛肉）与脂肪混合，有时再加干浆果；热量高、保存期长。"},"examples":[{"en":"Explorers carried pemmican because it stayed edible for months.","zh":"探险家会携带pemmican，因为它能保存好几个月。"},{"en":"The recipe uses dried meat, melted fat, and dried berries to make pemmican.","zh":"这个做法用干肉、融化的脂肪和干浆果来制作pemmican。"}]}],"synonyms":["dried meat ration","trail food","survival food"],"phonetic":"/ˈpɛmɪkən/","extraExplanation":["pemmican与北美原住民（尤其是平原地区的民族）以及梅蒂人（Métis）的历史紧密相关，是一种适合长途旅行与狩猎的“高能量口粮”。","这个词来自克里语（Cree）中与“脂肪/油脂”有关的词根，经法语等语言转写进入英语。","在加拿大毛皮贸易时期，pemmican是重要的交易品和补给品；现代也常被拿来类比为“能量棒”的早期形式。"]}
{"word":"pemmicanization","summary":{"en":"Pemmicanization means making pemmican (a preserved meat-and-fat food) or, figuratively, condensing something into a compact essential form.","zh":"Pemmicanization 指制作 pemmican（干肉+脂肪的保存食品）的过程；也可比喻把内容浓缩成紧凑、只保留必需部分的形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making pemmican (a traditional dried meat-and-fat food) or turning food into a pemmican-like preserved form","zh":"制作肉干脂肪饼（pemmican，一种传统的干肉+脂肪保存食品）的过程；把食物加工成类似 pemmican 的耐储存形态"},"examples":[{"en":"Pemmicanization was used to preserve meat for long journeys without refrigeration.","zh":"在没有冷藏条件的长途旅行中，人们会用“pemmicanization”来保存肉类。"},{"en":"The researchers studied pemmicanization methods to understand historical survival diets.","zh":"研究人员研究了 pemmicanization 的方法，以了解历史上的生存饮食。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the act of condensing something into a dense, compact, “survival” version by removing what is nonessential","zh":"（比喻）把事物“浓缩压实”的行为：去掉非必要内容，做成紧凑、耐用的“生存版”"},"examples":[{"en":"The editor’s pemmicanization of the manuscript cut it down to the most essential scenes.","zh":"编辑对稿件进行了“pemmicanization”，把它删减到只剩最关键的情节。"},{"en":"In crisis planning, pemmicanization means keeping only what you truly need.","zh":"在危机规划中，“pemmicanization”指只保留真正必需的东西。"}]}],"synonyms":["pemmican-making","preservation","dehydration","concentration","condensation","abridgment"],"phonetic":"/ˌpɛmɪkənəˈzeɪʃən/","extraExplanation":["这个词来自 pemmican（北美原住民与梅蒂斯文化中常见的高能量储粮：干肉粉+动物脂肪，有时加浆果）+ -ization（“……化/……的过程”）。","真实语境里它非常少见，更常见的表达是 make pemmican / pemmican-making，或用更通用的 preserve / dehydration（脱水）/ drying（风干）/ rendering fat（熬脂）来描述步骤。","比喻用法通常强调“高度压缩、去掉水分/冗余、便于携带或在艰难环境中维持”的感觉，因此常出现在写作精简、应急物资、极简主义等语境。"]}
{"word":"pemmicanize","summary":{"en":"Pemmicanize means to make food into pemmican for preservation, or figuratively to condense something into a dense, concentrated form.","zh":"Pemmicanize 指把食物制成/用类似方法保存成“肉干饼”（pemmican）；也可比喻把内容浓缩成高密度的形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make or preserve food by preparing it as pemmican (dried meat mixed with fat, sometimes with berries).","zh":"把食物制成（或用类似方法保存成）肉干脂肪混合的“肉干饼/肉糜”（pemmican）。"},"examples":[{"en":"Early travelers sometimes pemmicanized dried bison to carry enough calories on long journeys.","zh":"早期的旅行者有时会把风干的野牛肉“制成肉干饼”，以便在长途跋涉中携带足够的热量。"},{"en":"We pemmicanized the lean meat by drying it first and then mixing it with rendered fat.","zh":"我们先把瘦肉风干，再与熬出的动物油脂混合，把它“做成肉干饼”。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, informal) to compress something into a dense, concentrated form, as if turning it into pemmican.","zh":"（比喻，非正式）把某物压缩、浓缩成高密度的形式，像把它做成“肉干饼”一样。"},"examples":[{"en":"The editor pemmicanized the 20-page report into a one-page brief.","zh":"编辑把20页的报告“浓缩”成了一页简报。"},{"en":"He pemmicanized his life story into a few sharp sentences.","zh":"他把自己的人生故事“压缩”成几句犀利的话。"}]}],"synonyms":["make pemmican","preserve","dry","cure","condense","compress","concentrate"],"phonetic":"/ˈpɛmɪkənˌaɪz/","extraExplanation":["“pemmican”一词常与北美原住民（尤其是草原地区）及早期皮毛贸易时期的长途旅行补给有关：它高热量、耐储存，适合在寒冷或路途遥远、难以获得新鲜食物的环境中使用。","“pemmicanize”非常少见，多见于历史/探险语境或带幽默的比喻用法；日常英语里更常说“preserve (meat)”, “dry and fatten”, 或比喻用“compress/condense”。"]}
{"word":"pemmicans","summary":{"en":"Pemmicans are plural of pemmican: a high-energy preserved food made from dried meat, fat, and sometimes berries.","zh":"Pemmicans是pemmican的复数：由风干肉、油脂（有时加浆果）制成的高能量耐储存口粮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional preserved food made from dried meat (often bison), fat, and sometimes berries; used as a high-energy ration. “Pemmicans” is the plural of “pemmican.”","zh":"一种传统的耐储存食物，由风干肉（常见为野牛肉）、动物油脂，有时加浆果制成；属于高能量口粮。“pemmicans”是“pemmican”的复数。"},"examples":[{"en":"Explorers carried pemmicans because they were lightweight and packed with calories.","zh":"探险者会携带pemmicans，因为它们重量轻、热量高。"},{"en":"The museum exhibit explains how pemmicans helped travelers survive long winters.","zh":"博物馆展览解释了pemmicans如何帮助旅行者熬过漫长的冬天。"}]}],"synonyms":["dried-meat ration","trail food","survival ration","jerky (not the same, but related)"],"phonetic":"/ˈpɛmɪkən/","extraExplanation":["“pemmican”源自克里语（Cree）相关词形，后来进入加拿大法语与英语语境。它常与北美原住民的食物保存智慧、毛皮贸易时期的长途运输与越冬补给联系在一起。","在现代英语中，“pemmican”更多出现在历史、野外生存、露营或探险题材中；日常饮食语境相对少见。"]}
{"word":"pemoline","summary":{"en":"Pemoline is an older prescription stimulant once used for ADHD, now rarely used due to serious liver-risk concerns.","zh":"培莫林是一种较早的处方兴奋剂，曾用于ADHD治疗，但因严重肝损伤风险而如今很少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prescription stimulant drug that was used mainly to treat ADHD (and sometimes narcolepsy), but is now rarely used because of risk of severe liver damage.","zh":"一种处方兴奋剂药物，曾主要用于治疗注意力缺陷多动障碍（ADHD）（有时也用于嗜睡症），但因可能导致严重肝损伤而如今很少使用。"},"examples":[{"en":"Pemoline was once prescribed for ADHD, but doctors now avoid it because of liver toxicity concerns.","zh":"培莫林曾用于治疗ADHD，但由于肝毒性风险，医生现在通常会避免使用。"},{"en":"The medication guide warns that pemoline can cause serious liver problems.","zh":"药品说明书警示：培莫林可能引发严重的肝脏问题。"}]}],"synonyms":["Cylert (brand name)","stimulant (general category)"],"phonetic":"/ˈpɛməliːn/","extraExplanation":["培莫林（pemoline）曾以商品名 Cylert 销售，在一些国家/地区因为罕见但可能致命的肝衰竭风险而被撤市或严格限制；因此在现代英语语境中多出现在医学史、药物安全（pharmacovigilance）或旧病例讨论里。","它属于中枢神经兴奋剂（stimulant）类药物；学习时可把它当作“药名专有名词”，在阅读医学文章时重点理解其用途（ADHD）与主要安全性争议（肝毒性）。"]}
{"word":"pemolines","summary":{"en":"“Pemolines” means more than one pemoline, a stimulant drug now rarely used due to safety concerns.","zh":"“Pemolines”指“培莫啉”的复数；培莫啉是一种兴奋剂类药物，因安全性问题现已很少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of pemoline (a stimulant drug that was once used to treat ADHD and narcolepsy).","zh":"pemoline 的复数：培莫啉（曾用于治疗注意力缺陷多动障碍ADHD和发作性嗜睡的中枢神经兴奋剂）。"},"examples":[{"en":"Some older medical articles discuss pemolines as possible treatments for ADHD.","zh":"一些较早的医学文章把 pemolines 作为治疗 ADHD 的可能药物来讨论。"},{"en":"Because of safety concerns, pemolines are rarely mentioned in modern prescribing guidelines.","zh":"由于安全性问题，现代用药指南中很少再提到 pemolines。"}]}],"synonyms":["pemoline","stimulants (general)"],"phonetic":"/ˈpɛməliːnz/","extraExplanation":["“pemolines”在日常英语里非常少见，更多出现在医学史、药学或旧文献中。常见单数形式是“pemoline”。","培莫啉曾以商品名 Cylert 出现，但后来因与严重肝毒性风险相关而在许多国家被停用或严格限制；因此在现代语境中提到它，往往是在讨论“已不常用/已撤市的药物”。","如果你原本想查的是拼写相近的词（例如人名、品牌、或其他药物名），可以告诉我你看到它的句子或领域（医学/文学/网络用语），我可以帮你确认正确拼写与含义。"]}
{"word":"pemphigoid","summary":{"en":"Pemphigoid is an autoimmune blistering skin disease (often in older adults).","zh":"Pemphigoid 指一类自身免疫性起水疱的皮肤病（常见于老年人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of autoimmune skin diseases that cause large, tense blisters, usually in older adults","zh":"（类）天疱疮：一组自身免疫性皮肤病，通常在老年人中出现，可引起较大、紧绷的水疱"},"examples":[{"en":"The dermatologist suspected bullous pemphigoid because of the tense blisters on her arms.","zh":"皮肤科医生因她手臂上紧绷的水疱而怀疑是大疱性类天疱疮。"},{"en":"Pemphigoid is often treated with medicines that calm the immune system.","zh":"类天疱疮常用抑制或调节免疫反应的药物治疗。"}]}],"synonyms":["bullous pemphigoid (common type)","autoimmune blistering disease (broader term)"],"phonetic":"/ˈpɛm.fɪˌɡɔɪd/","extraExplanation":["“Pemphigoid”是医学术语，常见搭配是“bullous pemphigoid（大疱性类天疱疮）”。它的水疱通常较“紧”，不容易破；而“pemphigus（天疱疮）”的水疱往往更脆、易破，这也是两者在临床上常被拿来对比的点。","该词多用于医疗场景（病历、皮肤科就诊、药物说明等）。如果在真实生活中出现不明原因水疱、瘙痒或皮肤疼痛，应尽快就医，由专业医生诊断与治疗。"]}
{"word":"pemphigous","summary":{"en":"Pemphigous means “related to or like pemphigus,” a rare blistering skin disease.","zh":"pemphigous 意为“与天疱疮有关的/类似天疱疮的”，用于描述起水疱的皮肤（或黏膜）疾病特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to or resembling pemphigus, a group of rare blistering skin diseases.","zh":"（医学）与天疱疮有关的；类似天疱疮（pemphigus）那样起水疱的。"},"examples":[{"en":"The dermatologist considered a pemphigous disorder because of the widespread blisters.","zh":"由于水疱广泛，皮肤科医生考虑这可能是天疱疮样（pemphigous）的疾病。"},{"en":"Pemphigous lesions can be painful and may affect the mouth as well as the skin.","zh":"天疱疮样皮损可能很疼，并且可能累及口腔和皮肤。"}]}],"synonyms":["pemphigus-related","blistering (medical context)"],"phonetic":"/ˈpɛm.fɪ.ɡəs/","extraExplanation":["“pemphigous”是较少见的医学形容词，更常见的名词是“pemphigus（天疱疮）”。日常英语中很少使用，通常出现在医学论文、病历或皮肤科相关语境。","天疱疮（pemphigus）一般指一组自身免疫性大疱性皮肤病，特点是皮肤或黏膜出现水疱、糜烂；具体诊断与治疗应由专业医生评估。"]}
{"word":"pemphigus","summary":{"en":"Pemphigus is a rare autoimmune disease that causes skin or mouth blisters.","zh":"Pemphigus（天疱疮）是一种罕见的自身免疫性疾病，会导致皮肤或口腔等黏膜出现水疱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare autoimmune disease that causes blisters on the skin and/or mucous membranes (such as the mouth), often because the immune system attacks the connections between skin cells.","zh":"一种罕见的自身免疫性疾病，会在皮肤和/或黏膜（如口腔）出现水疱；通常是因为免疫系统攻击皮肤细胞之间的连接所致。"},"examples":[{"en":"The doctor suspected pemphigus because the patient had painful mouth blisters that didn’t heal.","zh":"医生怀疑是天疱疮，因为病人口腔里有疼痛的水疱，久不愈合。"},{"en":"Pemphigus is not contagious, but it can seriously affect daily life if untreated.","zh":"天疱疮不具传染性，但如果不治疗，可能会严重影响日常生活。"},{"en":"With proper treatment, many people with pemphigus can control flare-ups.","zh":"在适当治疗下，许多天疱疮患者可以控制病情反复（发作）。"}]}],"synonyms":["autoimmune blistering disease","pemphigus vulgaris (a common type)"],"phonetic":"/ˈpɛm.fɪ.ɡəs/","extraExplanation":["“Pemphigus”是医学用词，中文常译为“天疱疮”。它属于自身免疫疾病的一类：身体的免疫系统“误伤”自身组织。","日常英语里不常用，多见于医院、皮肤科、医学文章或病历中。与普通的“blister（水疱）”不同，它强调一种特定疾病，而不是一般的起泡。","常见相关表达：pemphigus vulgaris（寻常型天疱疮，较常见且可累及口腔黏膜）、autoimmune blistering disease（自身免疫性大疱性疾病）。"]}
{"word":"pemphix","summary":{"en":"Pemphix is a rare term meaning a skin blister/bubble, and it can also be a scientific genus name (Pemphix) for some fossil crustaceans.","zh":"pemphix 是一个少见词，可指皮肤上的水疱/泡；也可作为学名 Pemphix，指某些化石甲壳动物的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/medical, often historical) A blister or bubble on the skin; a small swelling filled with fluid.","zh":"（少见/医学用语，多见于旧文献）水疱；皮肤上充满液体的小泡。"},"examples":[{"en":"The old medical text described a painful pemphix forming on the patient’s arm.","zh":"那本旧医学文献描述病人手臂上长出了疼痛的水疱（pemphix）。"},{"en":"Heat can cause a pemphix to appear after a burn.","zh":"烫伤后，热力可能会导致出现水疱（pemphix）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Paleontology/zoology) Pemphix: a genus name used for certain fossil crustaceans in scientific classification.","zh":"（古生物/动物学）Pemphix：科学分类中某些化石甲壳动物的属名。"},"examples":[{"en":"The museum label identified the specimen as Pemphix, a fossil crustacean genus.","zh":"博物馆标签把该标本标注为 Pemphix，一种化石甲壳动物属。"}]}],"synonyms":["blister","bulla","vesicle"],"phonetic":"/ˈpɛm.fɪks/","extraExplanation":["pemphix 源自希腊语 *pemphix*（意为“泡、疱、气泡”），在现代英语里更常见的是相关医学词汇 **pemphigus**（天疱疮，一类会起大疱的自身免疫性皮肤病）以及 **bulla**（大疱）。因此你在当代日常英语中几乎不会遇到 pemphix，更多是出现在旧医学文献或专门的学术语境。"]}
{"word":"pemphixes","summary":{"en":"“Pemphixes” is the rare medical plural of “pemphix,” meaning blisters/vesicles on the skin.","zh":"“pemphixes”是罕见医学用语“pemphix”的复数，指皮肤上的水疱/小水疱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A blister or bubble on the skin; a vesicle. “Pemphixes” is the plural form.","zh":"（医学，罕用）皮肤上的水疱或起泡；小水疱。“pemphixes”为其复数形式。"},"examples":[{"en":"The clinician noted several small pemphixes on the patient’s forearm.","zh":"临床医生记录到患者前臂上有几个小水疱。"},{"en":"Autoimmune conditions can cause widespread blistering, though modern texts more often use “bullae” or “blisters” rather than “pemphixes.”","zh":"自身免疫性疾病可能导致广泛起疱，不过现代文献更常用“bullae（大疱）”或“blisters（水疱）”，而不是“pemphixes”。"}]}],"synonyms":["blisters","vesicles","bullae"],"phonetic":"ˈpɛmfɪks","extraExplanation":["“pemphix”来自希腊语词根 pemph-，与“起泡、疱疹/水疱”相关，同源词包括“pemphigus（天疱疮）”。","在当代英语医学写作里，这个词非常少见；更常见的表达是“blister（一般水疱）”“vesicle（小水疱）”“bulla/bullae（大疱）”。如果你是在论文或病例里见到它，通常可按“水疱/疱”来理解。"]}

