{"word":"peo","summary":{"en":"“peo” is usually an informal short form of “people,” or the acronym “P-E-O” used in organization names.","zh":"“peo”通常是“people”的非正式缩写；也可能是读作“P-E-O”的机构名称缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal texting) Short for “people.”","zh":"（非正式短信/网络用语）“people”的缩写，意思是“人们；大家”。"},"examples":[{"en":"Some peo think this movie is boring, but I liked it.","zh":"有些人觉得这部电影很无聊，但我喜欢。"},{"en":"Let’s ask a few peo in the group chat.","zh":"我们在群聊里问问几个人吧。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation read as letters “P-E-O,” used in names of organizations; common meanings include “Professional Employer Organization” (a company that handles HR/payroll for other businesses) and “Program Executive Office” (a government/military management office).","zh":"读作字母“P-E-O”的缩写，常见于机构名称；常见含义包括“Professional Employer Organization（专业雇主组织/人力外包公司）”和“Program Executive Office（项目执行办公室，常见于政府/军方）”。"},"examples":[{"en":"Our company works with a PEO for payroll and benefits.","zh":"我们公司与一家PEO合作处理工资和福利。"},{"en":"She works at the PEO that manages the new aircraft program.","zh":"她在负责新飞机项目管理的PEO工作。"}]}],"synonyms":["people (for the texting meaning)"],"phonetic":"ˈpiːoʊ","extraExplanation":["“peo”作为“people”的缩写更常见于聊天、评论区或打字图省事的场景；在正式写作（邮件、作业、报告）里通常应写全“people”，避免显得不专业或让读者困惑。","如果你在文件里看到大写“PEO”，通常是某个机构/部门的名称缩写；具体含义要结合上下文或该机构全称来判断。"]}
{"word":"peon","summary":{"en":"A peon is a low-ranking worker who does routine tasks; historically (especially in South Asia) it can mean a messenger/attendant. It can also be an insult meaning an unimportant person.","zh":"peon 指做杂活的底层员工；历史上（尤指南亚）也可指传令跑腿的差役。该词有时带贬义，指“小人物/被使唤的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-ranking worker who does routine or unskilled tasks; a person with little power in an organization","zh":"（组织中）地位低、做杂活/基础工作的工人；小职员"},"examples":[{"en":"He started as a peon in the mailroom and worked his way up.","zh":"他从收发室的小杂工做起，一步步升上去。"},{"en":"The manager treated the staff like peons instead of colleagues.","zh":"经理把员工当成小喽啰一样对待，而不是同事。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in South Asia, historical) a messenger or attendant who carries orders or does errands for an office or official","zh":"（尤指南亚、历史用法）差役；传令员；跑腿办事员"},"examples":[{"en":"In the old court system, a peon delivered documents between offices.","zh":"在旧时的法院体系里，差役负责在各办公室之间递送文件。"},{"en":"The clerk called a peon to bring tea and file the papers.","zh":"职员叫来一名差役端茶并整理归档文件。"}]},{"partOfSpeech":"n.","definition":{"en":"an insulting way to refer to someone seen as unimportant or easily controlled","zh":"（贬义）小人物；被人随意使唤的人"},"examples":[{"en":"Don’t call people peons—it’s disrespectful.","zh":"别把人叫做“小人物/小喽啰”，这很不尊重。"}]}],"synonyms":["underling","lackey","minion","gofer","messenger"],"phonetic":"/ˈpiːɑn/","extraExplanation":["“peon”在英语里常带有“地位低、被使唤”的语气，因此在日常交流中容易显得轻蔑；描述工作岗位时可用更中性的词，如 “assistant / clerk / staff member”。","这个词在南亚语境里较常见，源自西班牙语 *peón*（工人、步兵），在殖民时期的行政体系中也用来指“跑腿传令的人”。"]}
{"word":"peonage","summary":{"en":"Peonage is a debt-based system that traps people into forced labor until a debt is paid.","zh":"Peonage 指以债务为名将人困住、迫使其劳动偿债的制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system in which a person is forced to work to pay off a debt, often under unfair or abusive conditions","zh":"债役制；为偿还债务而被迫劳动的制度（常带有不公平或虐待性质）"},"examples":[{"en":"After the war, some workers were trapped in peonage through unfair contracts and constant new “fees.”","zh":"战后，一些工人因不公平的合同和不断新增的“费用”而陷入债役制。"},{"en":"The investigation found cases that resembled peonage: people could not leave until they repaid an impossible debt.","zh":"调查发现了一些类似债役制的情况：人们必须还清几乎不可能偿还的债务才能离开。"}]}],"synonyms":["debt bondage","forced labor","bonded labor"],"phonetic":"/ˈpiːənɪdʒ/","extraExplanation":["“Peonage”常用于美国历史语境，尤其指内战后在南方对非裔美国人和贫困劳动者的剥削性劳工安排：表面是“自愿签约”，实质却因债务、暴力威胁或法律操控而无法自由离开。","词源：来自西班牙语 peón（劳工、步兵），强调“低地位的劳动者”被债务束缚的状态。与“slavery（奴隶制）”不同，peonage 通常以“债务”为名义，但在现实中可能同样剥夺人身自由。","相关词/近义表达（语境接近但不完全等同）：debt bondage（债务束缚/债役）、forced labor（强迫劳动）、indentured servitude（契约劳役，历史上多为有期限的契约）"]}
{"word":"peonages","summary":{"en":"“Peonages” means multiple instances or forms of peonage—debt-based forced labor.","zh":"“Peonages”指多个“债役制度”的情况或形式，即以欠债为由的强迫劳动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"systems or conditions in which people are forced to work to pay off a debt (debt slavery); plural of “peonage.”","zh":"（复数）债役制度；人们因欠债而被强迫劳动以偿还债务的制度或状态（“peonage”的复数）。"},"examples":[{"en":"The report described peonages in which workers could never fully repay what they owed.","zh":"报告描述了一些债役制度，在其中工人永远无法还清所欠的债。"},{"en":"Laws were passed to prevent peonages and other forms of forced labor.","zh":"一些法律被通过，用来防止债役制度和其他形式的强迫劳动。"}]}],"synonyms":["debt bondage","debt slavery","involuntary servitude","forced labor"],"phonetic":"/ˈpiːənɪdʒ/","extraExplanation":["“Peonage”源自西班牙语 peón（劳工、雇工）。在历史语境中，它常指一种以“欠债”为名、实为限制人身自由的强迫劳动制度，常见于一些地区的种植园或矿区等。","在美国历史与法律语境里，peonage 常与 19–20 世纪对强迫劳动的禁令一起出现（与奴隶制不同，但同样剥夺自由）。阅读历史材料时可留意它通常带有强烈的负面与批判意味。"]}
{"word":"peones","summary":{"en":"“Peones” usually means “peons”: low-status laborers or expendable underlings (often in historical/political contexts).","zh":"“peones”通常相当于英语“peons”：指地位低的劳工，或被差遣的小喽啰（常见于历史/政治语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-paid laborer or worker with little power or social status (often used in historical or political contexts).","zh":"（常用于历史/政治语境）地位低、薪水低、缺乏权力的劳工；苦力。"},"examples":[{"en":"During the colonial period, many peons worked on large estates for very little pay.","zh":"在殖民时期，许多苦力在大庄园里工作，报酬很少。"},{"en":"He complained that the company treated its staff like peons, not professionals.","zh":"他抱怨公司把员工当成“底层打工人”，而不是专业人士。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is used as a minor, expendable helper; an underling.","zh":"（贬义）小喽啰；被差遣的下属；可有可无的帮手。"},"examples":[{"en":"The villain sent his peons to do the dirty work.","zh":"反派派小喽啰去干脏活。"},{"en":"She refused to be treated as a peon in someone else’s project.","zh":"她拒绝在别人的项目里被当成可随意差遣的“工具人”。"}]}],"synonyms":["laborer","worker","underling","minion","pawn"],"phonetic":"/ˈpiːɑːn/","extraExplanation":["“peon”源自西班牙语 peón（步兵/步行者/劳工），在英语里常出现在拉丁美洲或殖民历史相关叙述中，带有明显的阶层与权力不对等含义。","你输入的“peones”是西班牙语复数形式；英语里更常见的复数是“peons”。在英文文章中看到“peones”通常是为了保留西语语感或讨论特定历史/地域背景。"]}
{"word":"peonies","summary":{"en":"Peonies are large, decorative flowers; this is the plural of “peony.”","zh":"Peonies 指芍药/牡丹这类花朵大、观赏性强的花；为 peony 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of large, showy garden flower (genus *Paeonia*), often with many petals and a rich fragrance; the plural form of “peony.”","zh":"芍药/牡丹（*Paeonia* 属）的花，一种花朵大、观赏性强、常带香味的园艺花卉；“peony”的复数。"},"examples":[{"en":"She put a vase of peonies on the dining table.","zh":"她在餐桌上摆了一瓶芍药（牡丹）花。"},{"en":"Peonies bloom in late spring and early summer.","zh":"芍药（牡丹）通常在春末夏初开花。"},{"en":"These peonies have soft pink petals and a sweet scent.","zh":"这些芍药（牡丹）花瓣是柔粉色的，还有淡淡的甜香。"}]}],"synonyms":["peony flowers","tree peonies","garden peonies"],"phonetic":"/ˈpiː.ə.niz/","extraExplanation":["“peony”在英语里通常泛指芍药属的观赏花。中文里“牡丹”和“芍药”是两种不同植物，但日常翻译中有时会互译或并称；在园艺语境里，英文peony常见的是芍药（herbaceous peony），也有“tree peony”（牡丹，木本）。","文化联想：在西方，peonies常与浪漫、婚礼花束、春夏季花园联系在一起；在中文文化中，牡丹常象征富贵。阅读或看花卉图片时，留意是否写有“tree peony/ herbaceous peony”来更准确对应中文名称。"]}
{"word":"peonism","summary":{"en":"Peonism means peonage—a coercive labor system often tied to debt; less commonly, it means servile, menial subordination.","zh":"Peonism 指“债役制/强迫劳动式的雇工制度”，常与债务捆绑；较少见时也指卑屈的仆役式从属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system or condition in which people are forced to work like peons—often through debt or legal pressure; peonage (a form of coercive labor).","zh":"（制度/状态）使人沦为“债役/农奴式劳工”的体系或处境；常指以债务或法律压力强迫劳动的“债役制”（peonage）。"},"examples":[{"en":"The report condemned peonism in rural areas, where workers could not leave until their debts were repaid.","zh":"报告谴责农村地区的债役制现象，工人必须还清债务才能离开。"},{"en":"After the war, officials claimed peonism had ended, but many laborers still faced debt traps.","zh":"战后官员声称债役制已结束，但许多劳工仍陷入“债务陷阱”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An attitude or practice of treating others as inferior servants; servility or menial subordination.","zh":"（较少见）把他人当作低等仆役对待的态度或做法；卑屈、卑下的从属关系。"},"examples":[{"en":"He rejected the peonism of always saying yes to powerful people.","zh":"他拒绝那种对权势者一味附和的卑屈做派。"}]}],"synonyms":["peonage","debt bondage","forced labor","indenture (partial)","servility (less common)"],"phonetic":"/ˈpiːəˌnɪzəm/","extraExplanation":["“peonism”来自“peon”（在西班牙语语境里原指雇工、脚夫），在历史与法律语境中常与“peonage（债役制）”相关：劳动者因债务、罚金或不公平合同被迫劳动，形式上可能是“雇佣”，实质上难以自由离开。","在美国历史（尤其是内战后南方）与拉丁美洲历史中，相关制度常被讨论为一种接近强迫劳动/准奴役的劳动关系。现代文本里多用于批判性、社会历史或人权语境。"]}
{"word":"peonisms","summary":{"en":"Peonism means peonage or a system/practice of keeping workers in dependent labor (often through debt).","zh":"Peonism指“债役/苦工式雇工”制度或做法（常通过债务让劳工难以脱身）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system or condition in which people are kept as peons (low-paid laborers) or in peonage (debt bondage); the practice of forcing or keeping people in such dependent labor.","zh":"“苦工/农奴式雇工”制度；使人沦为peon（被压迫的低薪劳工）或陷入“债役/债务束缚”的状态或做法。"},"examples":[{"en":"The report described peonism on plantations, where workers could not leave until their debts were paid.","zh":"报告描述了种植园里的peonism：工人必须还清债务才能离开。"},{"en":"Reforms were introduced to end peonism and protect workers’ freedom of movement.","zh":"政府推行改革以终结peonism，并保护工人的行动自由。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a peon-like attitude or behavior—being overly submissive, servile, or “treated like a nobody.”","zh":"（较少见）“苦工式/奴仆式”的态度或行为；过度卑微、顺从，或被当作无足轻重的人来对待。"},"examples":[{"en":"He rejected the peonism expected of junior staff and spoke up respectfully.","zh":"他拒绝新人被要求表现出的那种peonism，而是礼貌但坚定地表达意见。"},{"en":"The novel criticizes a workplace culture that rewards peonism instead of competence.","zh":"这部小说批判了一种奖赏卑躬屈膝而非能力的职场文化。"}]}],"synonyms":["peonage","debt bondage","indentured labor","servitude"],"phonetic":"/ˈpiːənɪzəm/","extraExplanation":["“Peonism”来自“peon”（苦工、雇农），常与“peonage（债役/债务奴役）”相关，历史上多见于拉丁美洲及美国西南部等地的劳工制度讨论。","你输入的“peonisms”是复数形式，表示多种“peonism现象/做法/例子”。"]}
{"word":"peonize","summary":{"en":"Peonize means to reduce someone to powerless, exploited labor, often through debt or coercion.","zh":"Peonize 指使人沦为被剥削、缺乏自主权的苦役式劳动状态，常与债务或强迫有关。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to force someone into a peon-like condition; to reduce someone to low-paid, powerless labor (often through debt or coercion)","zh":"使某人沦为类似“农奴/苦役劳工”的境地；把人降格为低薪、无权的劳工（常涉及债务或强迫）"},"examples":[{"en":"Some critics argue that unfair labor contracts can peonize migrant workers.","zh":"一些批评者认为，不公平的劳动合同可能会让外来务工者被“苦役化”。"},{"en":"The report warned that predatory loans can peonize families for years.","zh":"报告警告说，掠夺性贷款可能让家庭多年陷入类似“债役”的状态。"}]}],"synonyms":["enslave","subjugate","exploit","oppress","degrade"],"phonetic":"/ˈpiːəˌnaɪz/","extraExplanation":["“peonize”来自名词“peon（苦役劳工/农奴）”，与“peonage（债役制/苦役制）”相关。peonage 常指历史上（尤其在美洲部分地区）通过债务、法律漏洞或暴力胁迫，使劳动者无法自由离开工作、长期被束缚的制度。现代语境里它多用于批判性的写作，强调“被结构性压迫而失去选择”的意味。"]}
{"word":"peons","summary":{"en":"Peons are low-status, low-paid workers; historically, the word can refer to people forced to labor under debt or unfair systems.","zh":"peons 指地位低、低薪的基层劳动者；在历史语境中也可指因债务或不公制度而被迫劳动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-paid worker who does unskilled or routine work; often used to suggest low status or little power","zh":"（常带贬义）做粗活或重复性工作的低薪工人；也常用来暗示地位低、权力小"},"examples":[{"en":"The manager treated the staff like peons who should just follow orders.","zh":"经理把员工当成只需要听命行事的小喽啰/苦力。"},{"en":"He started as a peon in the office, doing filing and errands.","zh":"他从办公室里的基层杂工做起，负责归档和跑腿。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) in some places, a laborer bound by debt or forced to work under very unfair conditions","zh":"（历史用法）在某些地区指因债务等原因被束缚、在非常不公平条件下劳动的人"},"examples":[{"en":"The book describes how peons were kept working to pay off debts that never ended.","zh":"这本书描述了苦役工如何被迫劳动来偿还永远还不完的债。"}]}],"synonyms":["laborer","worker","underling","minion","drudge"],"phonetic":"/ˈpiːɑn/","extraExplanation":["“peon”的语气往往带有轻视或批评，强调“被当成工具人/小人物”。在正式写作中，如果只想表达“基层员工”，可以改用更中性的词，如 “junior staff / entry-level worker”。","该词在不同地区有特定历史背景：例如在拉丁美洲语境中常与“债役劳动（debt peonage）”相关；在南亚英语里也可能指办公室或单位里的“勤杂人员/办事员”。使用时注意语境与文化敏感性。"]}
{"word":"peony","summary":{"en":"A peony is a large, colorful flower (or the plant) known for its many petals and often a sweet fragrance.","zh":"Peony 指花朵大、花瓣多、色彩鲜艳、常带香气的牡丹（也可指这种植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, showy flower with many petals, often pink, red, white, or yellow; the plant that produces it","zh":"牡丹（或芍药属观赏花卉）；花朵大、花瓣多，常见粉、红、白、黄等颜色，也可指这种植物本身"},"examples":[{"en":"She planted peonies along the fence for spring color.","zh":"她沿着篱笆种了牡丹，让春天更有色彩。"},{"en":"A single peony can fill a room with a soft, sweet scent.","zh":"一朵牡丹就能让房间充满淡淡的甜香。"},{"en":"The painting shows a vase of peonies in full bloom.","zh":"这幅画描绘了一瓶盛开的牡丹。"}]}],"synonyms":["flower","blossom"],"phonetic":"/ˈpiːəni/","extraExplanation":["在英语里，peony 通常指观赏花“牡丹/芍药”这一类（学名为 Paeonia），日常不太区分中文里“牡丹”和“芍药”的细分；如果需要精确区分，常见说法是 tree peony（牡丹，木本）与 herbaceous peony（芍药，草本）。","文化意象上，peony 在中文语境常与“富贵、繁盛”相关；在英文语境中更常见的是“浪漫、华丽、春夏花园的代表花卉”等联想。"]}
{"word":"people","summary":{"en":"People means more than one person, or the public/citizens, and it can also mean a nation or cultural group.","zh":"people 指“人们/人类”，也可指“人民/民众”，还可指“某一民族或文化群体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"more than one person; human beings in general","zh":"人们；多人；（泛指）人类"},"examples":[{"en":"There were a lot of people at the concert.","zh":"音乐会上有很多人。"},{"en":"People need clean water and safe food.","zh":"人类需要干净的水和安全的食物。"}]},{"partOfSpeech":"n.","definition":{"en":"the citizens or ordinary members of a country or society","zh":"人民；（国家/社会的）普通民众"},"examples":[{"en":"The government should listen to the people.","zh":"政府应该倾听人民的声音。"},{"en":"A leader must serve the people.","zh":"领导者必须为人民服务。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular group connected by culture, nation, or shared history (often used with an adjective)","zh":"某一族群/民族/群体（常与形容词连用）"},"examples":[{"en":"the Italian people","zh":"意大利人民/意大利人（作为群体）"},{"en":"They are a proud people with a long history.","zh":"他们是一个有悠久历史、很自豪的民族。"}]}],"synonyms":["persons","humans","the public","citizens","nation"],"phonetic":"/ˈpiːpəl/","extraExplanation":["“people”在英语里通常是复数概念（people are...），但在表示“民族/族群”时，有时也可用复数“peoples”强调“多个不同民族/族群”（如：the peoples of the world 世界各民族）。","口语里“my people”有时指“我的家人/同乡/同类人”，也可能指“我所属的群体”，语气可亲近也可能带身份认同色彩，使用时注意语境。"]}
{"word":"People's","summary":{"en":"“People's” means “belonging to people/the public,” and it’s also used in official names to mean “for/by the people.”","zh":"“people’s”表示“人们/公众的”，也常用于机构或国家名称中表示“人民的/为人民的”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"The possessive form of “people,” meaning “belonging to people” (often a specific group or the public).","zh":"“people（人们）”的所有格形式，表示“属于人们/公众的（常指某一群体或大众）”。"},"examples":[{"en":"We should listen to people's opinions before making a decision.","zh":"在做决定之前，我们应该听取人们的意见。"},{"en":"The museum shows people's daily life a hundred years ago.","zh":"这座博物馆展示了一百年前人们的日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used like an adjective in names/titles to mean “for the people” or “controlled by the people,” especially in politics (e.g., “People's Republic,” “People's Bank”).","zh":"（多用于名称/头衔中）作形容词用，表示“为人民的/由人民掌控的”，常见于政治语境（如“People's Republic”“People's Bank”）。"},"examples":[{"en":"He studied the history of the People's Republic of China.","zh":"他研究了中华人民共和国的历史。"},{"en":"The news mentioned an announcement from the People's Bank.","zh":"新闻提到人民银行发布的一则公告。"}]}],"synonyms":["public","citizens’","the public’s"],"phonetic":"/ˈpipəlz/","extraExplanation":["拼写提示：people 是复数名词，变所有格时通常加 ’s：people’s needs（人们的需求）。它不是复数标记，不要写成 peoples（除非你指“不同民族/族群”，如 the peoples of Asia “亚洲各民族”。）","发音提示：people’s 通常读作 /ˈpipəlz/，结尾是 /-lz/ 的音，和 “peoples” 在发音上常常一样，但含义不同。"]}
{"word":"peopled","summary":{"en":"“Peopled” means “inhabited by people,” and it’s also the past form of the verb “people,” meaning “to populate.”","zh":"“peopled”表示“有人居住的”，也可作动词“people”的过去式/过去分词，意为“使某地有人居住、使人口迁入”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Inhabited by people; having a population.","zh":"（形容词）有人居住的；有人口的。"},"examples":[{"en":"The valley is densely peopled, with towns every few miles.","zh":"这个山谷人口稠密，几英里就有一个小镇。"},{"en":"It was once a wild area, but now it is peopled and developed.","zh":"那里曾经很荒凉，但现在有人居住并且被开发了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt., past tense/past participle of “people”) To populate a place; to fill it with people.","zh":"（及物动词，“people”的过去式/过去分词）使某地有人居住；使充满人。"},"examples":[{"en":"Immigrants peopled the frontier over many decades.","zh":"移民在几十年间让边疆地区逐渐有人定居。"},{"en":"The novel peopled the city with unforgettable characters.","zh":"这部小说用令人难忘的人物“充满”了整座城市（让城市仿佛活了起来）。"}]}],"synonyms":["inhabited","populated","settled"],"phonetic":"/ˈpiːpəld/","extraExplanation":["“peopled”作形容词时，多见于较正式或文学性的表达，常与“densely/sparsely peopled”（人口稠密/稀少）搭配。","动词“to people”除了“使某地有人居住”，在文学写作里也常指“在故事/想象中布置人物”（如把一座城市写得“到处都是人物”）。"]}
{"word":"peopledom","summary":{"en":"Peopledom means “the people as a whole,” often in a literary or old-fashioned style.","zh":"peopledom 指“人民整体/民众”，常见于文学或较旧式文风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The people of a country or community as a whole; the populace (often used in a literary or slightly old-fashioned style).","zh":"（文学或较旧式用法）一国或一群体的人民整体；民众。"},"examples":[{"en":"In hard times, peopledom looked to the city council for relief.","zh":"在艰难时期，民众指望市议会提供救济。"},{"en":"The poet wrote about peopledom rising to demand justice.","zh":"诗人写到人民奋起要求正义。"}]}],"synonyms":["the people","the public","the populace","citizenry","the masses"],"phonetic":"/ˈpipəldəm/","extraExplanation":["“peopledom”由“people + -dom”构成，-dom 表示“领域、整体状态或群体”（如 kingdom 王国、freedom 自由）。因此 peopledom 字面含义接近“人民这一整体/人民之域”。","这个词在现代日常英语中很少用，更常见的表达是 the people, the public, the populace 或 citizenry。使用 peopledom 会带一点修辞感，常见于演讲、诗歌或仿古文风。"]}
{"word":"peoplehood","summary":{"en":"Peoplehood means the shared identity of a group as “a people,” often discussed in cultural, political, or legal contexts.","zh":"peoplehood 指一个群体作为“一个民族/共同体”的共同身份与归属感，常用于文化、政治或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or identity of being a people: a shared sense of belonging based on common culture, history, language, values, or destiny.","zh":"“人民性 / 民族共同体认同”：作为一个“民族/群体”的身份与归属感，常建立在共同的文化、历史、语言、价值或共同命运之上。"},"examples":[{"en":"The festival strengthened the community’s peoplehood by celebrating their language and traditions.","zh":"这个节日通过庆祝他们的语言和传统，强化了这个群体的人民性/共同体认同。"},{"en":"Debates about peoplehood often focus on who belongs and what shared story unites them.","zh":"关于人民性/共同体认同的讨论常聚焦于“谁算成员”以及“什么共同叙事把大家团结起来”。"}]},{"partOfSpeech":"n.","definition":{"en":"A political or legal idea used to justify collective rights (for example, self-determination) for an ethnic, national, or Indigenous group.","zh":"一种政治/法律概念：用来主张某个民族、国家或原住民族群的集体权利（如自决权）。"},"examples":[{"en":"In international law, arguments about peoplehood can affect claims to self-determination.","zh":"在国际法中，关于人民性/民族共同体地位的论证会影响对自决权的主张。"},{"en":"Some scholars discuss Indigenous peoplehood in relation to land, kinship, and governance.","zh":"一些学者把原住民的“人民性”与土地、亲属关系和治理方式联系起来讨论。"}]}],"synonyms":["nationhood","group identity","collective identity","people’s identity","sense of belonging"],"phonetic":"/ˈpipəlˌhʊd/","extraExplanation":["“peoplehood”由 people（人民/群体）+ -hood（表示“状态/身份/时期”的后缀，如 childhood）构成，强调“成为一个共同体”的状态，而不只是“很多人”。","该词常见于学术写作、政治理论、民族研究与原住民研究中；日常口语更常用 identity, nationhood, community, belonging 等。使用时要注意语境与敏感性，避免把复杂多元的群体经验简化成单一标签。"]}
{"word":"peopleize","summary":{"en":"“Peopleize” is a rare, informal verb meaning either (1) make something more people-centered/human, or (2) populate/staff a place.","zh":"“peopleize”是罕见的非正式动词，可指（1）让事物更以人为中心、更有人情味；或（2）使某地有人/增加人员（相当于populate、staff）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, informal) To make something more focused on people—their needs, feelings, or everyday experience; to make something feel more human and less mechanical.","zh":"（罕见，非正式）让某事物更以人为中心，更多考虑人的需求与感受；让事物更“有人味”，不那么机械。"},"examples":[{"en":"The new app update tries to peopleize the experience with friendly prompts and clearer language.","zh":"这次应用更新试图通过更友好的提示和更清晰的语言，让使用体验更“以人为中心”。"},{"en":"Some critics say the policy needs to be peopleized, not just optimized for numbers.","zh":"一些批评者认为，这项政策需要更“以人为中心”，而不只是为数据指标做优化。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To add people to a place; to populate or staff something.","zh":"（罕见）给某地增加人；使有人居住/工作；为某处配备人员。"},"examples":[{"en":"They tried to peopleize the downtown area by opening schools, parks, and affordable housing.","zh":"他们通过开办学校、公园和保障性住房，试图让市中心“住进更多人、热闹起来”。"},{"en":"The company peopleized the new office quickly by moving teams from other cities.","zh":"公司通过把其他城市的团队调过来，很快就把新办公室“配齐了人”。"}]}],"synonyms":["humanize","personalize","make (it) user-friendly","populate","staff"],"phonetic":"/ˈpipəˌlaɪz/","extraExplanation":["“peopleize”不是常见标准词，更像是把 people + -ize（表示“使……化/使成为……”）拼出来的自造词或行业用语。写正式英语时，通常用更自然的词替代：\n- 表达“更有人情味/更人性化”：humanize, personalize, make it more user-friendly\n- 表达“让某地有人/增加人口”：populate, staff, bring people in","在商业、产品与公共政策语境里，有时会用这种词来强调“不要只看流程和数据，要回到人的体验与需求”。如果你要写作或演讲，用更常见的替代词会更稳妥。"]}
{"word":"peopleless","summary":{"en":"Peopleless means ‘without people; empty or uninhabited.’ It’s uncommon and often used for mood or description.","zh":"peopleless 意为“无人（的）/空无一人（的）/无人居住（的）”，较不常见，多用于描写氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without people; empty of people; uninhabited.","zh":"无人（的）；没有人（的）；无人居住（的）。"},"examples":[{"en":"The streets were peopleless after midnight.","zh":"午夜过后，街道上空无一人。"},{"en":"They hiked through a peopleless valley for hours.","zh":"他们在一个人迹罕至的山谷里徒步走了好几个小时。"},{"en":"In winter, the beach can feel almost peopleless.","zh":"冬天时，海滩会显得几乎无人。"}]}],"synonyms":["deserted","empty","uninhabited","vacant","abandoned"],"phonetic":"/ˈpipəlləs/","extraExplanation":["“peopleless”在现代英语中不算常见，更多见于文学描写或为了强调“空旷、寂静”的氛围。日常表达里更常用：deserted（荒凉/被遗弃的）、empty（空的）、uninhabited（无人居住的）、depopulated（人口减少/无人化的）。","构词上是“people + -less”（表示“没有……的”），类似：homeless（无家可归的）、childless（无子女的）、jobless（失业的）。"]}
{"word":"peoplement","summary":{"en":"“Peoplement” is a rare/old word meaning the settling (peopling) of a place, or sometimes the population of a region.","zh":"“peoplement”是罕见/较旧的词，常指“使某地有人居住的过程（定居、移民开发）”，有时也指“人口/居民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) The act or process of peopling a place; settling an area with people.","zh":"（罕见/过时）使某地有人居住的行为或过程；在某地定居、移民开发。"},"examples":[{"en":"Early policies encouraged the peoplement of the frontier.","zh":"早期政策鼓励边境地区的移民开发与定居。"},{"en":"The report describes the peoplement of the island over several centuries.","zh":"这份报告描述了该岛屿在数个世纪中的人口迁入与定居过程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A population; the people living in a region.","zh":"（罕见）人口；某地区的居民群体。"},"examples":[{"en":"The valley’s peoplement remained small because travel was difficult.","zh":"由于交通不便，这个山谷的人口一直不多。"}]}],"synonyms":["population","settlement","peopling","colonization","inhabitation"],"phonetic":"/ˈpipəlmənt/","extraExplanation":["“peoplement”不是现代英语常用词，更常见的说法是“population”（人口）或“settlement/colonization”（定居/殖民）。","构词上可以理解为 people + -ment（表示“行为/结果”的名词后缀），类似“development”。在阅读旧文献或历史写作时偶尔会出现。"]}
{"word":"peopler","summary":{"en":"“Peopler” is usually a misspelling of “people.” As a rare/archaic noun, it can mean someone who populates or settles a place.","zh":"“peopler”通常是把“people”拼错了。作为罕见/古旧名词，它可指“让某地有人居住/在某地定居的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “people.” In standard English, “peopler” is not commonly used.","zh":"（非标准）很可能是“people”的拼写错误。在标准英语中，“peopler”几乎不使用。"},"examples":[{"en":"I think you meant “people,” not “peopler.”","zh":"我觉得你想写的是“people”，不是“peopler”。"},{"en":"Many people live in this city.","zh":"很多人住在这座城市。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A person who populates or settles a place; someone who “peoples” an area.","zh":"（罕见/古旧）使某地有人居住的人；把人迁入某地进行定居的人。"},"examples":[{"en":"Early peoplers of the region settled near rivers.","zh":"这个地区早期的定居者多在河边落脚。"},{"en":"Stories about the peoplers of the island are part of local history.","zh":"关于这座岛屿早期定居者的故事是当地历史的一部分。"}]}],"synonyms":["(for the rare sense) settler","inhabitant","colonist","populator"],"phonetic":"/ˈpip(ə)lɚ/","extraExplanation":["“people”既可以作名词（人们；人民），也可以作动词（to people：使……有人居住/在……定居）。如果你想表达“让某地有人居住”，更自然的说法通常是用动词“people”或名词“settlers / inhabitants / population”，而不是“peopler”。"]}
{"word":"peoplers","summary":{"en":"“Peoplers” is a rare plural noun meaning people who settle or populate a place.","zh":"“peoplers”是较少见的复数名词，指使某地有人居住的人，即定居者/拓荒者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or group) that peoples a place; someone who settles or populates an area. (Rare; usually seen in historical or literary writing.)","zh":"使某地有人居住的人；开拓者、移民；使某地“有人口”的人。（较少见，多用于历史或文学语境）"},"examples":[{"en":"Early peoplers of the island arrived by boat and built small fishing villages.","zh":"这座岛屿最早的居民乘船而来，建立了小渔村。"},{"en":"The novel describes the peoplers of the frontier as both brave and vulnerable.","zh":"小说把边疆的拓荒者写得既勇敢又脆弱。"}]}],"synonyms":["settlers","inhabitants","colonists","pioneers","populators"],"phonetic":"/ˈpiːp(ə)lərz/","extraExplanation":["“peoplers”通常是名词“peopler”的复数，来源于动词 people（使……有人居住/定居于）。在现代英语里这个词很少用，更常见的表达是 settlers（定居者/移民）、inhabitants（居民）、populators（使人口增加的人/群体）。","如果你想表达“不同民族/人民”，更常用的是 peoples（如 the peoples of Africa）。如果你只是想写“人们”，则用 people。"]}
{"word":"peoples","summary":{"en":"“Peoples” usually means multiple distinct ethnic/national groups, not just a large number of individuals.","zh":"“Peoples”通常指多个不同的民族/国家/族群，而不只是“很多人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural of “people” meaning different nations, ethnic groups, or cultural groups (often used in formal, historical, or political writing).","zh":"“people”的复数形式，指不同的民族、国家或文化群体（常见于正式、历史或政治语境）。"},"examples":[{"en":"The museum shows the traditions of Indigenous peoples across the region.","zh":"这座博物馆展示了该地区各个原住民民族的传统。"},{"en":"The treaty affected several peoples living along the border.","zh":"这项条约影响了生活在边境沿线的多个民族。"},{"en":"Many peoples have told stories about the same stars in different ways.","zh":"许多民族用不同方式讲述关于同一片星空的故事。"}]}],"synonyms":["nations","ethnic groups","tribes","communities","populations"],"phonetic":"/ˈpipəlz/","extraExplanation":["在日常英语里，说“一群人/很多人”通常用 people（例如：Many people like coffee.）。peoples 更强调“不同的民族/族群/国家”，相当于“各族人民/诸民族”。","peoples 也常出现在固定搭配里：the peoples of the world（世界各民族/各国人民）、Indigenous peoples（原住民民族/原住民族群）、the peoples of Europe（欧洲各民族）。","学习提示：如果你只是想表达人数很多，不要把 people 变成 peoples；只有在强调“多个不同群体”时才用 peoples。"]}
{"word":"peoplet","summary":{"en":"“peoplet” is not standard English; you likely mean “people” (noun: humans; verb: populate).","zh":"“peoplet”不是标准英文，通常是想写“people”（名词：人们；动词：使定居/使充满人）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) “peoplet” is not a standard English word. You probably mean “people.”","zh":"（可能是拼写错误）“peoplet”不是标准英文单词。你可能想写的是“people”。"},"examples":[{"en":"I think you meant “people,” not “peoplet.”","zh":"我觉得你想写的是“people”，不是“peoplet”。"},{"en":"Many people enjoy listening to music.","zh":"很多人喜欢听音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"people: persons in general; human beings.","zh":"people：人们；人类。"},"examples":[{"en":"People are waiting outside the store.","zh":"人们正在商店外面等。"},{"en":"She likes meeting new people.","zh":"她喜欢认识新朋友。"}]},{"partOfSpeech":"vt.","definition":{"en":"people: to fill a place with people; to populate.","zh":"people：使某地有人居住；使充满人（使定居/移居）。"},"examples":[{"en":"The island was once peopled by fishermen.","zh":"这个岛曾经有渔民居住。"},{"en":"New towns were peopled by settlers from the north.","zh":"新城镇由来自北方的移民定居。"}]}],"synonyms":["people (correct spelling)","persons","humans","population"],"phonetic":"/ˈpipəl/","extraExplanation":["“people” 的复数形式本身就是 people（不是 *peoples*）。但在强调“不同民族/不同群体”时，可以用 “peoples”，例如 “the peoples of the world”（世界各民族/各国人民）。","在日常口语中更常说 “people” 而不是更正式的 “persons”。例如：*three people* 比 *three persons* 更自然（法律/公告语境除外）。"]}
{"word":"peopling","summary":{"en":"“Peopling” usually means the process of populating a place, especially in historical or academic contexts.","zh":"“peopling”通常指某地被人类迁入并定居的过程，常用于历史或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or act of populating a place; the settling of people in a region","zh":"（某地的）人口形成过程；移民定居、使某地有人居住"},"examples":[{"en":"The peopling of the island happened over several centuries.","zh":"这个岛屿的人口形成经历了几个世纪。"},{"en":"Historians debate the peopling of the Americas and the routes early migrants took.","zh":"历史学家争论美洲的人口形成以及早期移民所走的路线。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “people”: putting people in a place; populating","zh":"“people”的现在分词：使某地有人居住；在某地安置/聚集人群"},"examples":[{"en":"The government is peopling the new towns by offering housing support.","zh":"政府通过提供住房补贴来为新城引入居民。"},{"en":"Stories often describe pioneers peopling the frontier.","zh":"故事里常描写拓荒者让边境地区逐渐有人居住。"}]}],"synonyms":["population","settlement","migration","colonization","populating"],"phonetic":"/ˈpipəlɪŋ/","extraExplanation":["“peopling”常见于学术与历史语境，尤其是固定搭配 the peopling of + 地名（如 the peopling of the Americas），强调“人类如何迁徙并在某地定居”的过程，而不只是“那里有很多人”。","动词 people（使某地有人居住）在日常口语中不如 populate 常见；在现代语境里可能带有“由政策/规划推动迁入”的色彩。"]}
{"word":"peoplish","summary":{"en":"Peoplish means “human-like” or “typical of ordinary people,” used informally and often humorously.","zh":"Peoplish 指“像人一样/很普通人风格的”，多为非正式、幽默的网络用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, humorous) Like people; typical of how ordinary people behave, speak, or think.","zh":"（非正式、幽默）像人一样的；很“普通人/人类”的（指行为、说话或想法很接地气、很有人味）。"},"examples":[{"en":"Don’t worry if your writing isn’t perfect—make it more peoplish and clear.","zh":"别担心你的写作不完美——让它更“peoplish”（更像人写的、更清楚）就好。"},{"en":"The robot sounded too formal, so we tried to make its replies more peoplish.","zh":"机器人说话太正式了，所以我们想让它的回复更“peoplish”（更像人说话）。"}]}],"synonyms":["human-like","more natural","conversational","down-to-earth"],"phonetic":"/ˈpiːpəlɪʃ/","extraExplanation":["“peoplish”不是标准词典里的常用词，更像是网络自造词/玩笑用法，常见于讨论“像不像真人”的表达（比如写作、客服、AI 回复是否自然）。","结构上类似“childish / bookish / sheepish”等后缀“-ish”（“有点……的、……风格的”），所以peoplish≈“有点像人的/很人类风格的”。在正式写作里建议用 more human / more natural / more conversational 等更标准的说法。"]}
{"word":"peorian","summary":{"en":"Peorian means “from or related to Peoria, Illinois,” and it can also mean a person from Peoria.","zh":"Peorian 指“来自或与美国伊利诺伊州皮奥里亚有关的”，也可指“皮奥里亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Peoria, a city in Illinois, USA, or to its people or culture.","zh":"与美国伊利诺伊州的皮奥里亚市（Peoria）有关的；皮奥里亚人的；皮奥里亚文化的。"},"examples":[{"en":"She grew up with a strong Peorian accent and local slang.","zh":"她带着明显的皮奥里亚口音和当地俚语长大。"},{"en":"The museum’s exhibit highlights Peorian history along the Illinois River.","zh":"博物馆的展览重点介绍了伊利诺伊河沿岸的皮奥里亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Peoria, Illinois.","zh":"来自皮奥里亚（伊利诺伊州）的人。"},"examples":[{"en":"As a Peorian, he feels proud of the city’s community spirit.","zh":"作为一名皮奥里亚人，他为这座城市的社区凝聚力感到自豪。"}]}],"synonyms":["of Peoria","Peoria-related"],"phonetic":"/piˈɔriən/","extraExplanation":["“Peorian”在美国文化里有时会让人联想到一句常见说法：\"Will it play in Peoria?\"（在皮奥里亚会受欢迎吗？）。这句话常用来测试一部电影、广告、政治观点等是否能被“主流美国大众”接受，因为Peoria曾被视为具有代表性的中等城市之一。注意：这是一种文化刻板印象式的用法，现代语境中不一定准确。"]}
{"word":"peotomy","summary":{"en":"“Peotomy” isn’t a standard word; it’s most likely a misspelling of “poetry” (poems; the art of writing poems).","zh":"“peotomy”不是标准英文词；很可能是“poetry（诗歌/写诗的艺术）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “peotomy” is not a common English word. It is most likely a misspelling of “poetry.”","zh":"（非标准）“peotomy”不是常见英文词，很可能是把“poetry（诗歌）”拼错了。"},"examples":[{"en":"I couldn’t find “peotomy” in a dictionary—did you mean “poetry”?","zh":"我在词典里找不到“peotomy”——你是不是想写“poetry”？"},{"en":"She enjoys reading poetry before bed.","zh":"她喜欢睡前读诗。"}]},{"partOfSpeech":"n.","definition":{"en":"poetry (noun): writing that uses rhythm, vivid language, and imagery to express feelings or ideas; poems as a type of literature.","zh":"poetry（名词）：用节奏、富有画面感的语言与意象来表达情感或思想的文学形式；诗歌这一类作品。"},"examples":[{"en":"Poetry can express emotions in a very direct way.","zh":"诗歌能以很直接的方式表达情感。"},{"en":"In school, we studied poetry by Robert Frost.","zh":"在学校里，我们学习了罗伯特·弗罗斯特的诗歌。"},{"en":"This song’s lyrics feel like poetry.","zh":"这首歌的歌词很有诗意。"}]}],"synonyms":["verse","poems","poetic writing"],"phonetic":"/ˈpoʊətri/","extraExplanation":["“peotomy”很可能是把“poetry”打错了：常见原因是把字母顺序写乱，或把“poe-”误写成“peo-”。","如果你想表达“诗人”，用 poet；“诗意的/富有诗情的”，用 poetic；“像诗一样地”，用 poetically。","如果你原本想找的是某个专业术语或人名（例如品牌、用户名、标题），也可能不是英语词；你可以告诉我上下文句子，我可以更准确判断。"]}

