{"word":"pep","summary":{"en":"Pep means energy and enthusiasm, especially in informal speech.","zh":"pep 指精力和热情，常用于非正式表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Energy, enthusiasm, and lively spirit (often used informally).","zh":"精力；活力；热情（非正式用语）。"},"examples":[{"en":"After a short walk, I felt more pep and could focus again.","zh":"短走一会儿后，我更有精神了，也能重新专注。"},{"en":"The coach gave a pep talk to get the team excited.","zh":"教练做了赛前动员讲话，让队员们兴奋起来。"}]}],"synonyms":["energy","enthusiasm","spirit","zip","vigor"],"phonetic":"/pɛp/","extraExplanation":["“pep”是非正式词，常用来表示“精神头/干劲”。它和“pepper（胡椒）”有关：胡椒让食物更“有劲儿”，引申为人更“有活力”。","常见搭配：a burst of pep（突然来劲/精神一振）、pep talk（鼓劲儿的讲话/动员讲话）、pep rally（学校为比赛加油的集会）。"]}
{"word":"peperek","summary":{"en":"“peperek” is not a standard English word; it’s likely a misspelling (often of “pepper” or “paperwork,” depending on context).","zh":"“peperek”不是标准英语单词，更可能是拼写错误（常见候选是“pepper”或“paperwork”，取决于语境）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or non-English word (often confused with “pepper” or, in some contexts, “paperwork”).","zh":"不是标准英语单词。更可能是拼写错误或非英语词（常被误写成“pepper（胡椒）”，有时也可能想表达“paperwork（文件手续）”）。"},"examples":[{"en":"I couldn’t find “peperek” in an English dictionary—did you mean “pepper”?","zh":"我在英文词典里找不到“peperek”——你是不是想写“pepper”？"},{"en":"If you meant “paperwork,” you could say: “I have a lot of paperwork to finish.”","zh":"如果你想表达“paperwork（文件手续）”，可以说：“I have a lot of paperwork to finish.（我有很多文件要处理。）”"}]}],"phonetic":"/ˈpɛpərɛk/","extraExplanation":["“peperek”看起来像拼写输入错误。你可以告诉我它出现的句子/语境（例如聊天、作业、游戏ID、名字、某种语言的词），我就能更准确判断你想表达的词。","如果你想查的是英语单词：\n- pepper /ˈpɛpər/（胡椒；给……加胡椒；使充满）\n- paperwork /ˈpeɪpərˌwɝk/（文书工作；手续文件）\n把你原句发来，我可以帮你选最自然的词并改写句子。"]}
{"word":"peperine","summary":{"en":"Piperine is the natural compound in black pepper that creates much of its spicy bite.","zh":"胡椒碱是黑胡椒中的天然成分之一，带来主要的辛辣刺激感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A natural alkaloid found in black pepper (and some other peppers) that gives pepper much of its sharp, spicy “bite.”","zh":"（化学）胡椒碱：存在于黑胡椒（及部分其他胡椒属植物）中的天然生物碱，是胡椒辛辣“刺激感”的主要来源之一。"},"examples":[{"en":"Black pepper’s pungent taste mainly comes from piperine.","zh":"黑胡椒的辛辣刺激感主要来自胡椒碱。"},{"en":"Some supplements add piperine to help the body absorb certain nutrients.","zh":"有些营养补充剂会加入胡椒碱，以帮助身体吸收某些营养成分。"}]}],"synonyms":["black pepper alkaloid","pepper extract (in supplements)"],"phonetic":"/ˈpaɪpəˌriːn/","extraExplanation":["你输入的“peperine”通常是“piperine”的拼写误差；标准拼写是 p-i-p-e-r-i-n-e。","胡椒碱在保健品语境里常见于“black pepper extract（黑胡椒提取物）”，常被提到与“提高生物利用度（bioavailability）”有关；如果你正在服药或有特殊健康状况，相关搭配可能需要谨慎并咨询专业人士。"]}
{"word":"peperino","summary":{"en":"Peperino is a pepper-speckled gray volcanic building stone, especially associated with Rome.","zh":"Peperino 指一种带“胡椒点”斑纹的灰色火山石材，尤与罗马地区的建筑有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gray, speckled volcanic stone (a kind of tuff) used as a building material, especially in and around Rome, Italy.","zh":"一种灰色、带斑点的火山岩（火山凝灰岩的一种），常用作建筑石材，尤指意大利罗马及其周边地区。"},"examples":[{"en":"Many old buildings near Rome were built with peperino because it is easy to cut.","zh":"罗马附近的许多古建筑使用了 peperino，因为它容易切割加工。"},{"en":"The wall was faced with peperino, giving it a gray, pepper-speckled look.","zh":"这面墙用 peperino 贴面，因此呈现出灰色、像胡椒点一样的斑点质感。"}]}],"synonyms":["volcanic tuff","tuff","tufa (related, not identical)"],"phonetic":"/ˌpɛpəˈriːnoʊ/","extraExplanation":["词源来自意大利语 peperino，和 pepe（“胡椒”）有关，指这种石头表面常见深色小斑点，看起来像撒了胡椒粉一样。","在英语里它多出现在建筑、考古、艺术史或地质相关的语境中，属于比较专门的词。"]}
{"word":"peperomia","summary":{"en":"Peperomia is a group of easy-care tropical houseplants known for thick, decorative leaves.","zh":"Peperomia 指一类好养的热带室内观叶植物，以厚实、好看的叶片著称（常译为“豆瓣绿”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genus of small tropical plants often grown as houseplants, valued for their thick leaves and easy care; a single plant in this group is also called a peperomia.","zh":"豆瓣绿属（热带小型植物的一属），常作为室内观叶植物栽培，以叶片厚实、好养著称；该属中的单株植物也可称为一株“豆瓣绿/peperomia”。"},"examples":[{"en":"I keep a peperomia on my desk because it doesn’t need much water.","zh":"我在桌上养了一盆豆瓣绿，因为它不怎么需要浇水。"},{"en":"Her peperomia has round, glossy leaves and grows slowly.","zh":"她的豆瓣绿叶子圆圆的、很有光泽，而且长得很慢。"}]}],"synonyms":["houseplant","ornamental plant"],"phonetic":"/ˌpɛpəˈroʊmiə/","extraExplanation":["“Peperomia”常见于园艺语境，很多品种被当作室内观叶植物；中文里常见统称为“豆瓣绿”，但不同品种也可能有各自的俗名。","词源来自希腊语：peperi（胡椒）+ homoios（相似的），因为它与胡椒科（Piper）植物在形态上有相似之处。"]}
{"word":"peperoni","summary":{"en":"Pepperoni is a popular spicy smoked sausage, especially as a pizza topping (often misspelled as “peperoni”).","zh":"Pepperoni 指常见的辣味烟熏香肠，尤其常作披萨配料（“peperoni”多为误拼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled **pepperoni**) A spicy, smoked sausage (usually made from pork and beef) often used as a pizza topping or in sandwiches.","zh":"（常拼作 **pepperoni**）一种带辣味、烟熏风味的香肠（通常由猪肉和牛肉制成），常用于披萨配料或三明治。"},"examples":[{"en":"I’ll have a pepperoni pizza, please.","zh":"请给我一份意大利辣香肠披萨。"},{"en":"She ordered a sandwich with pepperoni and cheese.","zh":"她点了一个加意大利辣香肠和奶酪的三明治。"},{"en":"If you don’t like spicy food, pepperoni might be too hot.","zh":"如果你不喜欢辣的食物，意大利辣香肠可能会太辣。"}]}],"synonyms":["spicy sausage","salami (similar, not identical)"],"phonetic":"ˌpɛpəˈroʊni","extraExplanation":["“peperoni”常见为拼写错误或变体；在英语中标准拼法通常是 **pepperoni**。","词源有趣：意大利语 **peperoni**（一个 p）原意是“甜椒/彩椒”（复数），而美式英语里的 **pepperoni** 指的是“辣味香肠”。所以在意大利点餐时，两者意思不同，容易产生误会。"]}
{"word":"peperonis","summary":{"en":"Pepperoni is a spicy cured sausage often used as a pizza topping; “pepperonis” is the plural.","zh":"Pepperoni 指常用于披萨配料的辣味腌制香肠；“pepperonis”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pepperoni: a spicy cured sausage (usually made from pork and beef), commonly sliced and used as a pizza topping in the U.S.","zh":"意大利辣香肠（pepperoni）：一种带辣味的腌制香肠（通常由猪肉和牛肉制成），在美国常切片作为披萨配料。"},"examples":[{"en":"I’ll have a pepperoni pizza, please.","zh":"我想要一份意大利辣香肠披萨。"},{"en":"She picked off the pepperoni slices because they were too spicy.","zh":"她把辣香肠片挑掉了，因为太辣。"},{"en":"This sandwich has pepperoni, cheese, and olives.","zh":"这个三明治里有辣香肠、奶酪和橄榄。"}]}],"synonyms":["salami (similar, but not the same)","spicy sausage"],"phonetic":"/ˌpɛpəˈroʊni/","extraExplanation":["“peperonis”通常是拼写错误；标准拼写是“pepperonis”（pepperoni 的复数），也常把 pepperoni 当作不可数名词用：e.g., “Do you want pepperoni on your pizza?”（你披萨要加辣香肠吗？）","美国披萨店里的“pepperoni”是一种美式改良的“意式风味香肠”，名字来自意大利语“peperoni”（意大利语里更接近“甜椒/彩椒”的意思），所以它在英语和意大利语中的含义并不完全一样。"]}
{"word":"pepful","summary":{"en":"Pepful means full of pep—energetic, lively, and enthusiastic (informal, uncommon).","zh":"pepful 指“充满干劲/精力”的，意思接近 energetic、lively（非正式且较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy, enthusiasm, or lively spirit; energetic and cheerful (informal, uncommon).","zh":"精力充沛的；热情洋溢的；有活力的（非正式、较少见）。"},"examples":[{"en":"After a good night’s sleep, she felt pepful and ready to start the day.","zh":"睡了个好觉后，她觉得精力充沛，准备开始新的一天。"},{"en":"The pepful music made everyone want to dance.","zh":"这段充满活力的音乐让大家都想跳舞。"}]}],"synonyms":["peppy","energetic","lively","spirited","upbeat"],"phonetic":"/ˈpɛp.fəl/","extraExplanation":["“pepful”由“pep（精力/干劲）+ -ful（充满……的）”构成，但在现代英语里不太常用。更自然、更常见的表达是“peppy”“energetic”“lively”。在写作或正式场合，建议用这些更常见的词。"]}
{"word":"pephredo","summary":{"en":"“pephredo” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“pephredo” 不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“pephredo” is not a standard English word. It may be a misspelling or a name/username.","zh":"“pephredo” 不是标准英语单词，可能是拼写错误，或是人名/用户名等专有名词。"},"examples":[{"en":"I can’t find “pephredo” in an English dictionary—did you mean “peppered” or “Alfredo”?","zh":"我在英语词典里找不到 “pephredo”——你是不是想写 “peppered” 或 “Alfredo”？"},{"en":"Could you share the sentence where you saw “pephredo”?","zh":"你能把你看到 “pephredo” 的句子发我吗？"}]}],"phonetic":"/ˌpɛfˈrɛdoʊ/","extraExplanation":["从拼写看，“pephredo” 可能是把某个常见词打错了。比较接近的有：\n- **peppered**（撒胡椒；充满/夹杂），如 *peppered with questions*（不断被问题“轰炸”）。\n- **Alfredo**（阿尔弗雷多白酱/奶油意面酱），常见于菜单。\n如果你告诉我它出现的上下文（句子、网页、游戏、用户名等），我可以更准确判断你想查的词。"]}
{"word":"pepinella","summary":{"en":"Pepinella is a rare word, most often a feminine name, and sometimes a nonstandard/historical spelling connected to the herb genus Pimpinella.","zh":"Pepinella 很少见，最常作为女性名字；有时也会作为与香草植物茴芹属（Pimpinella）相关的非标准或旧式拼写出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (rare), used in some European contexts and sometimes seen as a variant spelling of similar names.","zh":"（罕见）女性名字，在一些欧洲语境中使用；有时被当作相近名字的变体拼写。"},"examples":[{"en":"Pepinella is a rare name, so people may ask how to spell it.","zh":"Pepinella 是个比较少见的名字，所以别人可能会问怎么拼。"},{"en":"Her name, Pepinella, appears in old family records.","zh":"她的名字 Pepinella 出现在旧的家族记录里。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare spelling/label sometimes used for the herb genus Pimpinella (for example, anise and related plants), especially in non-standard or historical contexts.","zh":"（罕见拼写/称呼）有时用来指香草植物“茴芹属”（Pimpinella，如茴香籽/八角茴香的近亲等），多见于不规范或较旧的用法中。"},"examples":[{"en":"Some older labels may list the plant as “pepinella,” but modern texts usually use Pimpinella.","zh":"有些旧标签可能写“pepinella”，但现代资料通常用 Pimpinella。"},{"en":"The recipe calls for an anise-like herb; check whether “pepinella” refers to Pimpinella.","zh":"食谱要用一种类似茴香的香草；可以确认一下“pepinella”是否指 Pimpinella。"}]}],"synonyms":["Pimpinella","anise"],"phonetic":"/ˌpɛpɪˈnɛlə/","extraExplanation":["“Pepinella”在现代英语里非常少见，常见情况是：①作为人名出现；②作为“Pimpinella（茴芹属）”的误拼或旧式拼写。若你是在某本书、食谱、商标或人名里看到它，告诉我出处或上下文，我可以帮你更准确地判断含义与读法。"]}
{"word":"pepino","summary":{"en":"Pepino can mean “cucumber” in Spanish use, or a mild, sweet fruit called pepino melon.","zh":"pepino 在西语里常指“黄瓜”；在英语里也可指一种清甜的水果——pepino melon（香瓜茄/人参果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cucumber (especially in Spanish-speaking contexts); also used as a nickname for cucumber in some English menus or markets.","zh":"（多见于西语语境）黄瓜；在一些英文菜单或市场中也会用作“黄瓜”的称呼。"},"examples":[{"en":"In many Latin American countries, pepino usually means “cucumber.”","zh":"在许多拉丁美洲国家里，pepino 通常就是“黄瓜”的意思。"},{"en":"The salad comes with tomato, onion, and pepino.","zh":"这份沙拉配有番茄、洋葱和 pepino（黄瓜）。"}]},{"partOfSpeech":"n.","definition":{"en":"A sweet, mild fruit also called pepino melon (or melon pear), native to South America.","zh":"一种味道清甜温和的水果，常叫“pepino melon”（香瓜茄/人参果、甜瓜茄），原产南美。"},"examples":[{"en":"Pepino melon tastes lightly sweet, somewhere between cucumber and melon.","zh":"pepino melon 的甜味很淡，口感有点介于黄瓜和甜瓜之间。"},{"en":"She sliced a pepino and ate it chilled.","zh":"她把 pepino 切片冷藏后吃。"}]}],"synonyms":["cucumber","pepino melon","melon pear"],"phonetic":"/pəˈpiːnoʊ/","extraExplanation":["“Pepino”是西班牙语外来词。不同国家/地区用法不完全一样：在很多地方它就是“黄瓜”，而在英语里更常见的是指一种水果——pepino melon（学名 Solanum muricatum）。","在英文超市或食谱里，如果看到“pepino”但不确定是黄瓜还是 pepino melon，可以看上下文：出现在沙拉/腌菜里多半是黄瓜；出现在水果拼盘/甜品里更可能是 pepino melon。"]}
{"word":"pepinos","summary":{"en":"“Pepinos” is Spanish for “cucumbers” (plural).","zh":"“pepinos”是西班牙语“黄瓜”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Spanish plural noun meaning “cucumbers.” You may see it on menus, in recipes, or in Spanish-speaking contexts.","zh":"西班牙语名词复数，意思是“黄瓜”。常见于菜单、食谱或西语语境中。"},"examples":[{"en":"Add sliced pepinos to the salad for extra crunch.","zh":"在沙拉里加入切片的 pepinos（黄瓜）会更爽脆。"},{"en":"The taco stand offers onions, cilantro, and pepinos as toppings.","zh":"这家墨西哥小吃摊提供洋葱、香菜和 pepinos（黄瓜）当配料。"}]}],"synonyms":["cucumbers"],"phonetic":"/peɪˈpiːnoʊz/","extraExplanation":["“Pepino”是西班牙语单数“黄瓜”，“pepinos”是复数“黄瓜们/几根黄瓜”。在英语里遇到它，多半是保留了西语原词（尤其在菜单或拉美食谱中）。","不同地区“pepino”有时也可指某些瓜类（例如部分地区会用来指一种甜瓜/香瓜类），但在多数日常语境里最常见就是“黄瓜”。"]}
{"word":"pepla","summary":{"en":"Pepla is the plural form referring to ancient Greek-style garments (and sometimes modern peplum-style clothing).","zh":"Pepla 是复数形式，指古希腊风格的长袍（有时也指现代 peplum/荷叶边款式服装）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of peplum; long, loose ancient Greek garments (often women’s robes), or modern garments with a short ruffled overskirt inspired by that style","zh":"peplum 的复数；指古希腊（多为女性）的宽松长袍/外衣；也可指受其启发、带短荷叶边裙摆的现代“peplum（荷叶边）”款式服装（复数）"},"examples":[{"en":"In the museum, you can see statues wearing pepla.","zh":"在博物馆里，你可以看到雕像穿着古希腊长袍（pepla）。"},{"en":"The costume designer chose pepla for the chorus to create a classical Greek look.","zh":"服装设计师为合唱队选用了古希腊长袍（pepla），营造古典希腊的感觉。"},{"en":"Her wardrobe includes several pepla-style tops with a flared ruffle at the waist.","zh":"她的衣橱里有好几件 pepla 风格的上衣，腰部带外翻的荷叶边。"}]}],"synonyms":["peplums (in fashion contexts)","Greek robes","draped garments"],"phonetic":"/ˈpɛplə/","extraExplanation":["“pepla”来自古希腊服饰术语，常被当作“peplum/peplos”的复数使用。现代时尚里的“peplum top（荷叶边上衣）”也借用了这种古典轮廓（腰部加一圈短裙摆/荷叶边）。","在文学或艺术史语境中，它常出现在对古希腊雕塑、戏剧服装或壁画人物衣着的描写里。"]}
{"word":"pepless","summary":{"en":"Pepless means lacking pep—feeling tired, low-energy, or not lively.","zh":"Pepless 指“缺乏劲头/活力”，形容人或氛围没精神、没朝气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking energy, enthusiasm, or liveliness; not “peppy.”","zh":"缺乏精力、热情或活力的；没精神的。"},"examples":[{"en":"I felt pepless after staying up too late.","zh":"熬夜太晚后，我感觉没什么精神。"},{"en":"The team looked pepless in the second half of the game.","zh":"球队在比赛下半场看起来有点没劲。"},{"en":"Her voice sounded pepless on Monday morning.","zh":"周一早上她的声音听起来没什么活力。"}]}],"synonyms":["tired","low-energy","listless","lethargic","unenergetic"],"phonetic":"/ˈpɛpləs/","extraExplanation":["“pepless”较少见，更常见的写法是带连字符的“pep-less”，意思是“没有活力/劲头”。日常英语里也很常用“low-energy”“tired”“not very peppy”等表达。","“pep”本身是口语词，指“精力、朝气、干劲”。因此“pepless/pep-less”整体偏口语、轻松语气，适合描述人的状态或气氛，不太适合正式写作。"]}
{"word":"peplos","summary":{"en":"A peplos is a sleeveless ancient Greek women’s garment made from folded cloth and fastened at the shoulders.","zh":"peplos 指古希腊女性穿的一种无袖长袍，由整块布折叠并在肩部固定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, sleeveless outer garment worn by women in ancient Greece, usually made from a large rectangle of cloth folded and fastened at the shoulders.","zh":"（古希腊女性穿的）佩普洛斯长袍：一种无袖的外衣，通常用一大块布折叠后在肩部别针固定。"},"examples":[{"en":"In the museum, the statue is dressed in a peplos pinned at the shoulders.","zh":"在博物馆里，那尊雕像穿着一件在肩部用别针固定的佩普洛斯长袍。"},{"en":"Artists often showed Athena wearing a peplos in classical Greek sculpture.","zh":"古典希腊雕塑中，艺术家常把雅典娜刻画为身穿佩普洛斯长袍。"}]}],"synonyms":["ancient Greek robe","Greek dress","draped garment"],"phonetic":"/ˈpɛp.loʊs/","extraExplanation":["peplos 常见于艺术史与考古语境，尤其用来描述古希腊雕像或陶瓶画中的服饰。它通常由一整块布形成，上端可向外折出一层（像“翻边”），再用别针（fibula）在肩部固定，并用腰带束起。","不要和 chiton（希顿）混淆：chiton 往往更像内衣或更贴身、可缝合/更有袖形；peplos 通常更厚重、结构更简洁，作为外衣更常见。"]}
{"word":"peplosed","summary":{"en":"“Peplosed” means dressed in a peplos—an ancient Greek-style draped robe.","zh":"“peplosed”指穿着佩普洛斯（古希腊式披裹长袍）或呈现古典垂坠长袍装束。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a peplos (a loose outer garment worn by women in ancient Greece), or dressed in a flowing, draped robe in a classical style.","zh":"穿着“佩普洛斯”（古希腊女性常穿的一种宽松外袍）; 或以古典风格披裹、垂坠的长袍装束。"},"examples":[{"en":"In the museum mural, the goddess is shown peplosed, with fabric falling in soft folds.","zh":"在博物馆的壁画里，这位女神被描绘为身着佩普洛斯，布料以柔和的褶裥垂下。"},{"en":"The statue’s peplosed figure suggests an idealized ancient Greek style.","zh":"这尊雕像的“佩普洛斯装”形象暗示了理想化的古希腊风格。"}]}],"synonyms":["draped","robed","classically dressed","clad"],"phonetic":"/ˈpɛp.loʊzd/","extraExplanation":["“peplosed”较少用于日常英语，多见于艺术史、考古、古典文学/古典学写作，用来描述雕像、壁画或人物以古希腊女性服饰（peplos）呈现的外观。","peplos 通常是一块长方形布料，通过折叠、别针（如肩部的别针）固定并形成垂坠的褶裥；因此 peplosed 常带有“古典、庄重、披裹式”的视觉联想。"]}
{"word":"peploses","summary":{"en":"“Peploses” is the plural of “peplos,” an ancient Greek women’s garment fastened at the shoulders.","zh":"“Peploses”是“peplos”的复数，指古希腊女性穿的、在肩部固定的外衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of peplos: loose outer garments worn by women in ancient Greece, typically a long piece of cloth fastened at the shoulders.","zh":"peplos 的复数：古希腊女性穿的宽松外衣，通常是一整块长布，在肩部用别针或扣针固定。"},"examples":[{"en":"In the museum display, several statues are shown wearing peploses.","zh":"在博物馆的展柜里，好几尊雕像都穿着 peploses（古希腊外衣）。"},{"en":"The textbook compares chitons and peploses in ancient Greek dress.","zh":"教材对比了古希腊服饰中的 chiton（基通）和 peploses（佩普洛斯外衣）。"}]}],"synonyms":["ancient Greek garments","Greek drapery (contextual)"],"phonetic":"/ˈpɛp.loʊ.sɪz/","extraExplanation":["“Peplos”常见于艺术史、考古与古典学语境，读到“peploses”多半是在描述古希腊雕塑、陶瓶画或服饰复原图。","它通常指一种以长方形布料披裹并在肩部固定的衣着；与“chiton”相比，peplos 常被理解为更厚重、结构更简洁的外衣类型。"]}
{"word":"peplum","summary":{"en":"Peplum most commonly means a short flared ruffle at the waist on clothing; it can also refer to an ancient Greek garment or a sword-and-sandal film genre.","zh":"Peplum最常指服装腰部外扩的短裙摆/荷叶边；也可指古希腊外衣，或“剑与凉鞋”类历史冒险电影类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short flared ruffle or overskirt attached at the waist of a jacket, top, or dress, making the hips look more shaped.","zh":"（服装）腰部连接的一圈短裙摆/荷叶边（常见于上衣、外套或连衣裙），使腰臀线条更突出。"},"examples":[{"en":"She wore a peplum top with slim jeans to balance the silhouette.","zh":"她穿了一件腰部有裙摆的peplum上衣，搭配紧身牛仔裤来平衡整体轮廓。"},{"en":"The blazer’s peplum adds a classic, feminine touch.","zh":"这件西装外套的peplum裙摆增添了经典又女性化的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Greek clothing, a woman’s outer garment (a kind of tunic) worn over another dress.","zh":"（古希腊服饰）女性穿在外层的一种衣袍/罩衫（类似束带的长袍）。"},"examples":[{"en":"In the painting, the goddess is shown in a peplum with a belt at the waist.","zh":"在这幅画里，女神穿着一件束腰带的古希腊peplum外衣。"}]},{"partOfSpeech":"n.","definition":{"en":"A “sword-and-sandal” historical adventure film, especially Italian films popular in the 1950s–60s.","zh":"（电影）“剑与凉鞋”类历史冒险片（尤指20世纪50—60年代流行的意大利同类影片）。"},"examples":[{"en":"He loves classic peplum films about Hercules and ancient Rome.","zh":"他很喜欢以赫拉克勒斯和古罗马为题材的经典peplum电影。"}]}],"synonyms":["waist ruffle","overskirt","flounce","sword-and-sandal (films)"],"phonetic":"ˈpɛpləm","extraExplanation":["“Peplum”源自希腊语，原指古希腊女子服装的一种外衣；现代时尚里借用这个词来指腰部外扩的小裙摆设计，因为它让衣服看起来像“古典衣袍”的轮廓。","电影意义上的“peplum”常与法语用法有关，通常指“古代题材的大制作冒险片”（如古罗马、古希腊神话英雄等），英语里也常说 sword-and-sandal films。"]}
{"word":"peplumed","summary":{"en":"“Peplumed” describes clothing that has a peplum (a short flared ruffle/overskirt) or someone dressed in a peplum-style garment.","zh":"“Peplumed”指服装带有peplum（腰部外翻的小裙摆/荷叶边）设计，或指穿着peplum式古典服装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a peplum (a short flared ruffle or overskirt) at the waist; designed with a peplum detail.","zh":"（服装）带有腰部荷叶边/小裙摆（peplum）设计的；有“伞摆腰饰”的。"},"examples":[{"en":"She wore a peplumed blazer that flared neatly over the hips.","zh":"她穿了一件带伞摆腰饰的西装外套，下摆在臀部上方自然外扩。"},{"en":"A peplumed top can make the waist look more defined.","zh":"带peplum小裙摆的上衣能让腰线看起来更明显。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dressed in a peplum, especially referring to an ancient Greek or Roman-style garment.","zh":"（尤指古希腊/古罗马风格）穿着peplum式衣服的；着古典披裹式短裙的。"},"examples":[{"en":"In the painting, the figure is peplumed and crowned with laurel.","zh":"在画中，那个人物穿着古典peplum式服装，头戴月桂冠。"}]}],"synonyms":["peplum-trimmed","peplum-waisted","ruffled-waist","flounced"],"phonetic":"/ˈpɛp.ləmd/","extraExplanation":["“Peplum”一词来自希腊语“peplos”（πέπλος），原指古希腊女性穿的披裹式衣裙。现代时尚里，peplum通常指腰部加的一圈短小外翻裙摆（像荷叶边/小伞摆），常用于上衣、外套或连衣裙来强调腰线、修饰胯部线条。"]}
{"word":"peplums","summary":{"en":"Peplums are waist ruffles or short flounces on clothing; historically, the word can also refer to an ancient Greek garment.","zh":"peplums 指服装腰部的荷叶边/短裙摆；在历史语境中也可指古希腊女性外衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short flounce or ruffle attached at the waist of a jacket, top, or dress, making the hips look more shaped or flared.","zh":"（上衣/外套/连衣裙腰部的）荷叶边、腰裙摆（用于强调腰线并使臀部更有轮廓）。"},"examples":[{"en":"She wore a peplum top with slim jeans to balance the silhouette.","zh":"她穿了一件带腰部荷叶边的上衣配紧身牛仔裤，让整体轮廓更平衡。"},{"en":"The dress has a peplum that gives it a more formal look.","zh":"这条裙子腰部有一圈荷叶边，让它看起来更正式。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) A woman’s outer garment worn in ancient Greece, often a tunic-like piece draped over the body.","zh":"（历史）古希腊女性的外衣（常为类似束腰短袍、披裹式的衣物）。"},"examples":[{"en":"The museum display includes statues showing women in a peplum.","zh":"博物馆展区里有雕像展示女性穿着古希腊外衣的样子。"},{"en":"The costume designer used a peplum-inspired shape for the film’s Greek scenes.","zh":"服装设计师为电影的希腊场景采用了受古希腊外衣启发的造型。"}]}],"synonyms":["flounce","ruffle","overskirt","waist ruffle"],"phonetic":"/ˈpɛpləmz/","extraExplanation":["“peplums”是“peplum”的复数。现代时尚里它通常指腰部向外散开的短裙摆/荷叶边设计（peplum top, peplum jacket）。这个设计在20世纪中期（如1940s–1950s）和近年都曾流行，用来强调“细腰+曲线”的视觉效果。"]}
{"word":"peplus","summary":{"en":"Peplus is a rare noun meaning an ancient Greek draped garment; it can also refer to the plant petty spurge in some botanical contexts.","zh":"peplus 是较少见的名词，指古希腊的披挂式衣袍；在部分植物学语境中也可指泽漆大戟（petty spurge）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek outer garment or cloak, especially a loose, draped robe worn by women (similar to a peplos).","zh":"（古希腊的）外衣、披衣，尤指女性穿的宽松披挂式长袍（类似 peplos）。"},"examples":[{"en":"In the museum, the statue is shown wearing a simple peplus pinned at the shoulders.","zh":"在博物馆里，那尊雕像被展示为穿着一件在肩部别针固定的简朴 peplus（披衣）。"},{"en":"The costume designer chose a white peplus to suggest a classical Greek style.","zh":"服装设计师选用一件白色 peplus 来营造古典希腊风格。"}]},{"partOfSpeech":"n.","definition":{"en":"In botany, a name used in some contexts for the plant petty spurge (Euphorbia peplus).","zh":"（植物学用法）在某些语境中指“泽漆大戟/小大戟”（petty spurge，学名 Euphorbia peplus）。"},"examples":[{"en":"Petty spurge (Euphorbia peplus) is sometimes referred to as peplus in older sources.","zh":"在较旧的资料中，petty spurge（Euphorbia peplus）有时也被称为 peplus。"}]}],"synonyms":["peplos","cloak","robe"],"phonetic":"/ˈpɛpləs/","extraExplanation":["“peplus”与“peplos”同源，来自古希腊语，常出现在讨论古希腊服饰、雕塑与戏剧服装的语境中；现代英语里较少见，多见于历史/艺术写作。","如果你本来想查的是别的拼写（例如 people / plus / P+ 等），告诉我上下文或句子，我可以帮你确认正确词形与意思。"]}
{"word":"pepluses","summary":{"en":"“Pepluses” is the plural of “peplus,” meaning either an ancient Greek women’s garment or (less commonly) the plant Euphorbia peplus (petty spurge).","zh":"“pepluses”是“peplus”的复数，可指古希腊女性的外衣/长裙，也可（较少见）指植物泽漆大戟（Euphorbia peplus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of peplus: a long outer garment worn by women in ancient Greece, often a sleeveless dress fastened at the shoulders (a kind of peplos).","zh":"peplus 的复数：古希腊女性穿的长外衣/长裙，常为无袖、在肩部用别针固定（类似 peplos）。"},"examples":[{"en":"In the museum, several statues show women wearing pepluses fastened with pins at the shoulders.","zh":"在博物馆里，几尊雕像展示了女性穿着 pepluses，并在肩部用别针固定。"},{"en":"The costume designer used pepluses to give the play an ancient Greek feel.","zh":"服装设计师用 pepluses 来营造戏剧的古希腊氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of peplus: the plant Euphorbia peplus (petty spurge), a small weed with milky sap.","zh":"peplus 的复数：指植物“泽漆大戟”（Euphorbia peplus，petty spurge），一种带乳白色汁液的小型杂草。"},"examples":[{"en":"The gardener pulled up pepluses growing between the paving stones.","zh":"园丁把石板缝里长出来的 pepluses（泽漆大戟）拔掉了。"}]}],"synonyms":["peploi","peplos (for the garment sense)","ancient Greek robe","petty spurge (for the plant sense)"],"phonetic":"/ˈpɛpləsɪz/","extraExplanation":["“peplus / peplos”常见于艺术史与古典学语境：你会在古希腊雕塑、陶瓶画的说明文字里读到它。现代英语里更常见的是 peplos；peplus 属于较偏学术/文学的变体。","植物义的 peplus（Euphorbia peplus）在园艺或植物学资料中较常见；其乳白色汁液可能刺激皮肤，处理时通常建议戴手套。"]}
{"word":"pepo","summary":{"en":"“Pepo” is usually a name or nickname; as “pepo,” it can also be a nonstandard online spelling of “people.”","zh":"“Pepo” 通常是人名或昵称；写作 “pepo” 时也可能是网络上把 “people” 误拼/戏谑拼写的非标准形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A given name or nickname (often used in Spanish- or Italian-speaking contexts).","zh":"（专有名词）人名/昵称（常见于西班牙语或意大利语语境）。"},"examples":[{"en":"Pepo is my cousin’s nickname.","zh":"Pepo 是我表弟的昵称。"},{"en":"I met a designer named Pepo at the event.","zh":"我在活动上认识了一位叫 Pepo 的设计师。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, nonstandard) A playful or mistaken spelling used online for “people.”","zh":"（非标准/网络用法）有时被当作 “people（人们）” 的戏谑拼写或误拼。"},"examples":[{"en":"Some pepo on the internet spell “people” as “pepo.”","zh":"网上有些人会把 “people” 拼成 “pepo”。"},{"en":"There were a lot of pepo at the concert (nonstandard).","zh":"演唱会现场有很多 pepo（非标准写法）。"}]}],"synonyms":["people (standard spelling, for the nonstandard sense)"],"phonetic":"/ˈpɛpoʊ/","extraExplanation":["“pepo” 不是常见的标准英语单词；在正式写作里通常应写 “people”。","如果你是在某个特定作品、游戏、社群里看到 “Pepo”，它也可能是角色名、用户名或品牌名；这种情况下含义要看具体上下文。"]}
{"word":"peponid","summary":{"en":"Peponid (rare) refers to a pepo-type cucurbit fruit (like pumpkin, cucumber, melon) or something relating to that fruit type.","zh":"Peponid（较少见）指葫芦果类型的葫芦科果实（如南瓜、黄瓜、甜瓜），或指与这种果实类型有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, rare) A pepo-type fruit—i.e., a fleshy fruit with a thick/hard rind, typical of the gourd family (cucurbits) such as pumpkins, cucumbers, melons, and squash.","zh":"（植物学，较少见）葫芦果类型的果实；外皮厚或较硬、内部多汁多籽，常见于葫芦科植物，如南瓜、黄瓜、甜瓜和各种瓜类。"},"examples":[{"en":"In botany class, the teacher described the pumpkin as a peponid fruit with a hard rind.","zh":"在植物学课上，老师把南瓜描述为一种外皮坚硬的 peponid（葫芦果）果实。"},{"en":"Cucumbers and melons are often grouped as pepos; some texts also call them peponids.","zh":"黄瓜和甜瓜常被归为 pepo（葫芦果）；有些资料也称它们为 peponids。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Relating to or having the characteristics of a pepo-type fruit.","zh":"（植物学，较少见）与葫芦果有关的；具有葫芦果特征的。"},"examples":[{"en":"The plant produces peponid fruits that store water well in dry weather.","zh":"这种植物结出的 peponid（葫芦果型）果实在干燥天气里很能储水。"}]}],"synonyms":["pepo (more common, botany)"],"phonetic":"/ˈpɛpəˌnɪd/","extraExplanation":["“peponid”在现代英语里非常少见；学习与使用时更常遇到的术语是“pepo”（葫芦果，指一种果实类型）。如果你是在论文或教材里看到“peponid”，通常是在更偏学术或较旧的分类/描述语境中出现。","词源上与希腊语/拉丁语中表示“瓜、甜瓜”的词根有关（如 pepo/pepōn）。因此它多用于描述葫芦科（Cucurbitaceae）果实的结构特征，而不是日常食物名称。"]}
{"word":"peponida","summary":{"en":"“Peponida” is typically a biological taxonomic name (scientific Latin), not a common English vocabulary word; its meaning depends on context.","zh":"“Peponida”通常是生物分类学中的拉丁化学名，并非常见英语词；具体含义需结合出处与语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific (Latin) name used as a taxonomic label in biology (for a particular genus or group), not a common everyday English word; its exact reference depends on the field and the classification system being used.","zh":"生物学中用作分类学标签的拉丁化学名（指某个属或类群），不是常见的日常英语词；具体指哪一类生物取决于使用的学科与分类体系。"},"examples":[{"en":"The specimen was tentatively recorded as Peponida sp. until DNA testing confirmed its identity.","zh":"该标本在 DNA 检测确认身份前，暂时被记录为 Peponida 属的未定种（Peponida sp.）。"},{"en":"Older sources may use Peponida differently from modern databases, so check the current taxonomy.","zh":"较旧的资料可能与现代数据库对 Peponida 的用法不同，因此要核对最新的分类信息。"}]}],"phonetic":"/ˌpɛpəˈniːdə/","extraExplanation":["“Peponida”在常见英语词典里通常查不到，多半出现在论文、物种名录等语境中，属于“拉丁学名/分类名”而非日常词汇。","这种词往往源自希腊语/拉丁语词根；例如希腊语 pepōn（πέπων）有“甜瓜/瓜类”之意，因此有些相关分类名会带 pep- 词根。但“Peponida”具体指什么，需要看你看到它的上下文（哪篇文章、哪张名录、属于昆虫/植物/真菌等）。","如果你是想查一个普通英文单词，可能是拼写误差。你可以把原句或来源贴出来，我可以帮你判断是否应为 peponid、pepónida（西班牙语）或其他相近词。"]}
{"word":"peponidas","summary":{"en":"“Peponidas” is most likely a rare proper name from a classical (often Ancient Greek) context, not a standard English word.","zh":"“Peponidas”很可能是古典语境（常见于古希腊）中的罕见人名音译，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a transliteration from Ancient Greek) that may refer to a historical person mentioned in classical sources. It is not a common English vocabulary word.","zh":"一个较罕见的专有名词（多为古希腊语音译），可能指古典文献中出现的某位历史人物；它不是常见的英语词汇。"},"examples":[{"en":"I couldn’t find “Peponidas” in a modern English dictionary; it seems to be a personal name from a classical text.","zh":"我在现代英语词典里找不到“Peponidas”，它看起来像是古典文献中的人名。"},{"en":"If this is from Greek history, check the original spelling—sometimes “Peponidas” is a variant transliteration.","zh":"如果这是出自希腊史，请核对原拼写——“Peponidas”有时只是不同的音译写法。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˌpɛpəˈnaɪdəs/","extraExplanation":["“Peponidas”很可能是从希腊字母转写（transliteration）到拉丁字母/英语的形式。古典人名在不同版本、不同学者体系下，拼写常会出现差异。","也可能是拼写误差或误读：在古希腊史/古典文学中，常见的人名里有些与它形近（例如 Pelopidas 等）。如果你能提供出处（书名、段落、截图），我可以更准确判断它指的是谁以及标准译名。"]}
{"word":"peponium","summary":{"en":"Peponium is a botanical term for a pepo: a hard-rinded berry typical of gourds like pumpkins, melons, cucumbers, and squash.","zh":"Peponium 是植物学术语，指 pepo（瓠果/瓜果）：葫芦科常见的一类外皮较硬的浆果状果实，如南瓜、甜瓜、黄瓜和南瓜类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of berry (a fleshy fruit) with a hard rind, typical of the gourd family (cucurbits), such as pumpkins, melons, cucumbers, and squash.","zh":"一种“浆果类果实”（肉质果），外层有较硬的果皮（果壳），常见于葫芦科植物，例如南瓜、甜瓜、黄瓜和各种瓜类。"},"examples":[{"en":"In botany, a pumpkin is classified as a pepo, or peponium.","zh":"在植物学中，南瓜被归类为一种 pepo（也称 peponium，瓠果/瓜果）。"},{"en":"Cucumbers and melons develop as peponium-type fruits with a tough outer rind.","zh":"黄瓜和甜瓜属于 peponium 类型的果实，外层有较坚韧的果皮。"}]}],"synonyms":["pepo"],"phonetic":"/pɪˈpoʊniəm/","extraExplanation":["“peponium”多见于植物学/形态学语境；更常用的同义术语是“pepo”（中文常译为“瓠果”或“瓜果”）。","它与普通“berry（浆果）”的关键差别在于：外层果皮通常更厚、更硬（形成类似“皮/壳”的感觉），而果肉内部常有许多种子。","日常英语里几乎不会用到 peponium；在阅读植物百科、植物分类或学术材料时更可能遇见。"]}
{"word":"peponiums","summary":{"en":"Peponiums are gourd-family fruits with a hard rind, like cucumbers, pumpkins, and melons.","zh":"Peponiums 指葫芦科一类外皮坚硬的肉质果实，如黄瓜、南瓜、甜瓜等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of peponium: a type of fleshy fruit (a kind of berry) with a hard rind, typical of the gourd family (cucumbers, pumpkins, melons).","zh":"peponium 的复数：一种肉质果实（浆果的一类），外皮坚硬，常见于葫芦科植物（如黄瓜、南瓜、甜瓜）。"},"examples":[{"en":"In botany class, we learned that cucumbers and pumpkins are peponiums.","zh":"在植物学课上，我们学到黄瓜和南瓜属于 peponiums（瓠果）。"},{"en":"The lab compared the rinds of different peponiums, including squash and melon.","zh":"实验室比较了不同 peponiums（如南瓜和甜瓜）的果皮。"}]}],"synonyms":["pepos","gourd fruits"],"phonetic":"/pɪˈpoʊniəmz/","extraExplanation":["“peponium”是植物学术语，在日常英语里更常用的说法是“pepo”（瓠果）或直接说具体水果/蔬菜（pumpkin, cucumber, melon 等）。","典型特征：外层为较硬的“rind（果皮/硬皮）”，内部为多汁或较软的果肉，种子通常很多，属于葫芦科果实的经典类型。"]}
{"word":"pepos","summary":{"en":"“pepos” means the plural of “pepo,” a botanical fruit type typical of gourds (pumpkins, cucumbers, melons, squash).","zh":"“pepos”是“pepo”的复数，指葫芦科常见的一类植物学果实类型（如南瓜、黄瓜、甜瓜、各种瓜类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pepo: a type of fleshy fruit with a thick rind, typical of the gourd family (like pumpkins, cucumbers, melons, and squash).","zh":"pepo 的复数：一种果皮较厚、果肉多汁的果实类型，常见于葫芦科（如南瓜、黄瓜、甜瓜、西葫芦等）。"},"examples":[{"en":"Pumpkins and many squashes are pepos in botanical terms.","zh":"从植物学角度说，南瓜和许多瓜类都属于 pepos。"},{"en":"Cucumbers produce pepos rather than the kind of berry we usually imagine.","zh":"黄瓜结的是 pepos，而不是我们日常想象的那种“浆果”。"}]}],"synonyms":["gourd fruits","cucurbit fruits"],"phonetic":"/ˈpiːpoʊ/","extraExplanation":["“pepo / pepos”是植物学里的分类术语，日常英语里不常用；在普通对话中，人们一般直接说“pumpkin / cucumber / melon”等具体水果或蔬菜。","读到这个词时，常出现在科普文章、植物百科或生物学教材中，用来说明果实结构（厚外皮、内部多籽、果肉多汁等）。"]}
{"word":"pepped","summary":{"en":"“Pepped” usually means “made more energetic or enthusiastic,” often in the phrase “pepped up.”","zh":"“pepped”通常表示“让……更有精神/更振奋”，常见搭配是“pepped up”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “pep”: to make someone or something more energetic, lively, or enthusiastic (often used with “up”).","zh":"“pep”的过去式/过去分词：使（某人/某物）更有精神、更有活力、更振奋（常与“up”连用）。"},"examples":[{"en":"A short walk pepped me up before the meeting.","zh":"开会前我散步了一小会儿，精神一下子就提起来了。"},{"en":"She pepped up the room with bright curtains and plants.","zh":"她用亮色窗帘和绿植让房间更有生气。"},{"en":"The coach pepped the team up at halftime.","zh":"教练在中场休息时给球队鼓劲，让大家振作起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) full of energy; made more lively (usually “pepped up”).","zh":"（非正式）精力充沛的；被“提神/打气”后更有活力的（通常说“pepped up”）。"},"examples":[{"en":"After a quick coffee, I felt pepped up and ready to work.","zh":"喝了杯咖啡后，我感觉精神多了，可以开始工作了。"},{"en":"The music kept everyone pepped up during the long drive.","zh":"一路上音乐让大家在长途驾驶中保持精神。"}]}],"synonyms":["energized","cheered up","livened up","revved up","boosted"],"phonetic":"/pɛpt/","extraExplanation":["“pep”是美式英语里的非正式词，常见于20世纪早期的口语，表示“活力、劲头”。所以“pep someone up”就是“给某人打气/让某人振作”。","拼写提示：pep + -ed → pepped（双写p），因为单音节词以“辅音-元音-辅音”结尾时，加-ed常双写末尾辅音。"]}
{"word":"pepper","summary":{"en":"Pepper most often means a common seasoning (black/white pepper) or a pepper vegetable (like a bell pepper). As a verb, it means to scatter many small things or to bombard with repeated hits/questions.","zh":"pepper 最常指常见调味料（黑/白胡椒）或椒类蔬菜（如甜椒/彩椒）。作动词时表示“使布满、点缀”或“连番击打/追问”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spicy powder made from dried peppers, used to season food.","zh":"胡椒粉或辣椒粉等调味粉（由干燥的椒类制成），用来给食物增味。"},"examples":[{"en":"Add a little salt and pepper to the soup.","zh":"在汤里加一点盐和胡椒。"},{"en":"She sprinkled black pepper on her eggs.","zh":"她在鸡蛋上撒了黑胡椒。"}]},{"partOfSpeech":"n.","definition":{"en":"A vegetable (such as a bell pepper) with a hollow shape and seeds inside; it can be sweet or spicy.","zh":"甜椒/彩椒等蔬菜（内部中空、有籽）；可以是甜的也可以是辣的。"},"examples":[{"en":"He chopped a red pepper for the salad.","zh":"他切了一颗红甜椒做沙拉。"},{"en":"Green peppers taste slightly bitter to some people.","zh":"对有些人来说，青椒吃起来略带苦味。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or add many small spots or bits over something; to scatter repeatedly.","zh":"使布满（许多小点/小块）；不断地散布、点缀。"},"examples":[{"en":"The sky was peppered with stars.","zh":"天空布满了星星。"},{"en":"Her speech was peppered with jokes.","zh":"她的演讲穿插了许多笑话。"}]},{"partOfSpeech":"vt.","definition":{"en":"To hit or attack with many small, quick impacts; also, to bombard someone with many questions.","zh":"用密集的小击打攻击；也指用很多问题“连珠炮式”地追问。"},"examples":[{"en":"The reporters peppered him with questions.","zh":"记者们对他连番追问。"},{"en":"Hailstones peppered the roof all night.","zh":"冰雹整晚敲打着屋顶。"}]}],"synonyms":["seasoning","spice","bell pepper","capsicum","sprinkle","scatter","bombard"],"phonetic":"/ˈpɛpɚ/","extraExplanation":["英语里“salt and pepper”是非常固定、常见的搭配，常指最基础的调味料组合；也可形容头发“salt-and-pepper”（黑白相间、花白）。","名词“pepper”在食物里有两条常见线索：一条是“黑胡椒/白胡椒”等胡椒粉（peppercorn 研磨而成）；另一条是“bell pepper/ chili pepper”等椒类蔬菜或辣椒。日常会用具体搭配来避免混淆，比如 black pepper（黑胡椒）和 bell pepper（甜椒/彩椒）。"]}
{"word":"pepperbox","summary":{"en":"Pepperbox most commonly means an old multi-barrel revolver; less commonly, it can mean a pepper shaker.","zh":"pepperbox 常指旧式多管转轮手枪；较少情况下也可指胡椒罐（撒胡椒粉的容器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of old-fashioned revolver with several short barrels arranged in a cluster, so it could fire multiple shots without reloading each time.","zh":"（旧式）多管转轮手枪；枪管像一束“管状集合”，可连续射击多发。"},"examples":[{"en":"In the museum, we saw a 19th-century pepperbox pistol with six barrels.","zh":"在博物馆里，我们看到了一把19世纪的“pepperbox”多管手枪，有六根枪管。"},{"en":"The detective in the novel carried a pepperbox, which already felt outdated by then.","zh":"小说里的侦探带着一把多管手枪，但在当时它已经显得过时了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A container used to sprinkle ground pepper; a pepper shaker.","zh":"（较少用）胡椒罐；撒胡椒粉的瓶/罐。"},"examples":[{"en":"She reached for the pepperbox and added a little pepper to the soup.","zh":"她拿起胡椒罐，往汤里加了一点胡椒。"},{"en":"The old recipe book says, “Season well from the pepperbox.”","zh":"那本老食谱写道：“从胡椒罐里好好调味。”"}]}],"synonyms":["pepper shaker","pepper pot","pepper mill","multi-barrel pistol"],"phonetic":"/ˈpɛpərbɑks/","extraExplanation":["“pepperbox”这个名字来自外形联想：多根短枪管聚在一起，看起来像装胡椒粉的瓶口（或像一组小孔的撒料器）。","这种多管手枪在19世纪早期较常见，属于从单发手枪向现代转轮手枪过渡的设计；后来被更可靠、结构更简洁的转轮手枪逐渐取代。","在现代英语里，指“胡椒罐”的用法更偏旧式或文学语境；日常更常说 pepper shaker / pepper mill。"]}
{"word":"peppercorn","summary":{"en":"A peppercorn is a whole pepper seed used as a spice; figuratively, it can mean a tiny token payment (as in “peppercorn rent”).","zh":"peppercorn 指胡椒粒；引申也可指象征性的极少付款（如“peppercorn rent 象征性租金”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A whole dried black pepper seed used as a spice (often ground to add flavor).","zh":"（黑）胡椒粒；用作香料的整颗干燥胡椒籽（常被研磨来调味）。"},"examples":[{"en":"Add a few peppercorns to the soup for extra flavor.","zh":"在汤里加几粒胡椒，味道会更香。"},{"en":"The recipe calls for crushed peppercorns, not pepper powder.","zh":"这道菜要用碎胡椒粒，而不是胡椒粉。"}]},{"partOfSpeech":"n.","definition":{"en":"A very small or symbolic payment, especially in the phrase “peppercorn rent,” meaning a token amount paid to make an agreement legally valid.","zh":"象征性的极少付款（尤用于短语“peppercorn rent 象征性租金”），指为使合同/协议在法律上成立而支付的名义金额。"},"examples":[{"en":"The building was leased to the charity for a peppercorn rent of one dollar a year.","zh":"这栋楼以象征性租金租给了慈善机构，每年一美元。"},{"en":"They charged a peppercorn fee to keep the agreement formal.","zh":"他们收取象征性费用，以保持协议的正式性。"}]}],"synonyms":["pepper seed","whole pepper","token payment","nominal fee"],"phonetic":"/ˈpɛpərˌkɔrn/","extraExplanation":["“Peppercorn rent（象征性租金）”常见于英美法律与房地产语境：当一方几乎免费提供使用权时，仍可能收取极小金额（名义对价）来体现“有交换”，让合同更稳妥。","pepper 过去曾是昂贵的贸易商品，所以“peppercorn（胡椒粒）”在历史上可以象征“价值很小但确实存在的一点点东西”。"]}
{"word":"peppercornish","summary":{"en":"“Peppercornish” is a rare informal adjective meaning “peppercorn-like” or “extremely small/nominal.”","zh":"“peppercornish”是较少见的非正式形容词，表示“像胡椒粒的”或“极小/象征性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Resembling a peppercorn; peppercorn-like in size, shape, or appearance.","zh":"（非正式、较少见）像胡椒粒的；在大小、形状或外观上类似胡椒粒的。"},"examples":[{"en":"The seeds are peppercornish—tiny, round, and dark.","zh":"这些种子很“胡椒粒状”——小小的、圆圆的、颜色偏深。"},{"en":"She added a peppercornish sprinkle of spice.","zh":"她加了一点点胡椒粒般少量的香料。"}]},{"partOfSpeech":"adj.","definition":{"en":"(By extension) Extremely small or minimal, especially in legal or formal contexts (influenced by “peppercorn rent”).","zh":"（引申）极小的、象征性的（尤受法律/正式表达“peppercorn rent 象征性租金”的影响）。"},"examples":[{"en":"They paid a peppercornish fee just to make the agreement official.","zh":"他们付了一个象征性的极小费用，只是为了让协议在形式上成立。"},{"en":"The museum transferred the rights for a peppercornish amount.","zh":"博物馆以象征性的金额转让了这些权利。"}]}],"synonyms":["peppercorn-like","tiny","minuscule","speck-sized","nominal"],"phonetic":"ˈpɛpɚˌkɔɹnɪʃ","extraExplanation":["“peppercornish”并不是常见标准词；更常见的是名词“peppercorn”（胡椒粒），以及固定说法“peppercorn rent”（象征性租金：法律上用极小金额来满足“有对价/有交换”的形式要求）。","如果你原本想查的是“peppercorn”，我也可以给出更标准、更常用的词条与搭配（如 black peppercorn / peppercorn rent / a peppercorn of something）。"]}
{"word":"peppercorns","summary":{"en":"Peppercorns are the dried berries used as whole or ground pepper for seasoning.","zh":"peppercorns 指用作调味的胡椒粒（胡椒的干燥果实，可整粒或研磨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The dried berries (peppercorns) of the pepper plant used whole or ground as a spicy seasoning.","zh":"胡椒粒；胡椒（胡椒藤的干燥果实，可整粒或研磨作辛辣调味料）。"},"examples":[{"en":"Add a few peppercorns to the soup for extra flavor.","zh":"在汤里加几粒胡椒来增加风味。"},{"en":"The recipe calls for freshly ground black peppercorns.","zh":"这道菜谱要求用现磨的黑胡椒粒。"},{"en":"Pickled vegetables are often made with peppercorns and garlic.","zh":"腌菜常会加入胡椒粒和大蒜。"}]}],"synonyms":["pepper (spice)","whole pepper","pepper berries"],"phonetic":"/ˈpɛpɚkɔrnz/","extraExplanation":["“Peppercorn”原意是“胡椒的一粒”，复数为“peppercorns”。常见有black/white/green/pink peppercorns（黑/白/绿/粉红胡椒粒），其中粉红胡椒粒在植物学上不是真正的胡椒，但在烹饪中常被当作一种“peppercorn”来使用。","烹饪里说“whole peppercorns”通常指整粒下锅（例如炖汤、卤水），而“freshly ground pepper”指现磨，香气更明显。","在英美文化里，“peppercorn”还出现在法律用语“peppercorn rent”（象征性租金），表示金额极低、主要为满足合同形式上的对价要求；这与食用胡椒粒的意思不同。"]}
{"word":"peppercorny","summary":{"en":"Peppercorny = a humorous way to say something is corny/cheesy, often a pun with a “peppery” vibe.","zh":"peppercorny＝幽默说法，指很老套/很尬（常是谐音梗），带点“胡椒般辛辣”的玩笑感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, humorous) A playful misspelling of “peppercorn” used to describe something that feels corny or cheesy—often a punny joke that’s a bit “spicy.”","zh":"（非正式／幽默）“peppercorn（胡椒粒）”的玩笑式拼写，用来形容某事很老套、很尬（cheesy/corny），常指带点“辛辣”谐音梗的冷笑话。"},"examples":[{"en":"That peppercorny pun made everyone groan, but I still laughed.","zh":"那个peppercorny的谐音梗让大家都“哎哟”一声，但我还是笑了。"},{"en":"His captions are kind of peppercorny—cute, but a little cheesy.","zh":"他的配文有点peppercorny——可爱是可爱，但也有点尬。"}]}],"synonyms":["corny","cheesy","punny","groan-worthy","cringey"],"phonetic":"/ˈpɛpɚˌkɔɹni/","extraExplanation":["“peppercorny”不是常见标准词，更像网络或聊天里的临时造词（playful coinage）。它把“peppercorn（胡椒粒）”和“corny（老套、尴尬的）”的词形/读感揉在一起，制造一种“又尬又带点辛辣梗”的效果。","如果你想更自然地表达同样意思，通常直接用：corny / cheesy / punny / groan-worthy（冷到让人呻吟的梗）。"]}
{"word":"peppered","summary":{"en":"“Peppered” most often means “sprinkled with pepper” or, figuratively, “filled throughout with many small things,” as in “peppered with jokes/errors.” It can also be the past form of “pepper,” meaning to hit or question repeatedly.","zh":"“peppered”常指“撒了胡椒的”；也常用作比喻，表示“到处夹杂/充满许多小东西”，如“peppered with jokes/errors（穿插笑话/错误很多）”。它也可作动词pepper的过去式/过去分词，表示“反复密集地攻击或连番提问”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered or sprinkled with small pieces of pepper; seasoned with pepper.","zh":"撒了胡椒的；用胡椒调味的。"},"examples":[{"en":"The salad was lightly peppered and tasted fresh.","zh":"这道沙拉轻轻撒了点胡椒，吃起来很清爽。"},{"en":"I like my eggs peppered but not too salty.","zh":"我喜欢鸡蛋撒点胡椒，但不要太咸。"}]},{"partOfSpeech":"adj.","definition":{"en":"Scattered with many small marks or items (like spots, holes, or brief events) throughout.","zh":"遍布的；点缀着许多小点/小事的（如斑点、洞、或零星事件）。"},"examples":[{"en":"The report was peppered with spelling mistakes.","zh":"这份报告里到处都是拼写错误。"},{"en":"Her speech was peppered with jokes to keep everyone engaged.","zh":"她的演讲穿插了很多笑话，让大家保持专注。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “pepper”: to hit or attack repeatedly with many small shots, blows, or questions.","zh":"“pepper”的过去式/过去分词：用密集的小击打/射击/提问反复攻击（如连珠炮式提问）。"},"examples":[{"en":"After the game, the coach was peppered with questions by reporters.","zh":"比赛结束后，教练被记者连珠炮似地提问。"},{"en":"The wall was peppered with tiny holes.","zh":"墙上布满了细小的孔洞。"}]}],"synonyms":["sprinkled","seasoned","scattered","speckled","studded (with)","filled (with)","riddled (with)"],"phonetic":"/ˈpɛpərd/","extraExplanation":["“peppered with …”是非常常见的搭配，意思是“在……中穿插/夹杂很多……”。常用来形容演讲、文章或对话里不断出现某种元素：peppered with jokes / errors / facts / references。","在新闻语境里，“pepper”也可以指“用子弹密集扫射”，但日常学习中更常见的是比喻用法：be peppered with questions（被连续提问）。"]}
{"word":"pepperer","summary":{"en":"Pepperer means a person who adds pepper to food, or (historically) a merchant who sells pepper and spices.","zh":"pepperer 指给食物加胡椒的人；也可指（历史上）经营胡椒与香料的商人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who adds pepper (the spice) to food; someone who seasons food with pepper.","zh":"给食物加胡椒的人；用胡椒给食物调味的人。"},"examples":[{"en":"My dad is the pepperer in our family—he adds pepper to almost everything.","zh":"我爸是我们家最爱加胡椒的人——几乎什么都要撒点胡椒。"},{"en":"Please don’t be the pepperer for my soup; I like it mild.","zh":"我的汤请别帮我加胡椒；我喜欢清淡一点。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who sells pepper or deals in pepper and spices (historical or formal).","zh":"卖胡椒的人；经营胡椒与香料的商人（多为历史或较正式用法）。"},"examples":[{"en":"In old port cities, a pepperer could become wealthy through the spice trade.","zh":"在旧时的港口城市里，经营香料的胡椒商可能靠香料贸易致富。"},{"en":"The story mentions a pepperer who traveled with other merchants.","zh":"故事里提到一位和其他商人同行的胡椒商。"}]}],"synonyms":["pepper lover","seasoner","spice merchant","spice dealer"],"phonetic":"/ˈpɛpərər/","extraExplanation":["“pepperer”并不算现代常用词；日常英语更常说“someone who adds pepper”或开玩笑说“pepper lover”。","历史上欧洲的香料贸易很重要，“pepperer”可指做胡椒/香料生意的人；在一些旧文献里也能见到类似用法。"]}
{"word":"pepperers","summary":{"en":"Pepperers are people who add pepper, or people who “pepper” others with many questions/attacks; historically, it can mean medieval spice merchants.","zh":"pepperers 可指给食物加胡椒调味的人，也可指用问题/攻击连番“猛攻”的人；历史上还可指中世纪的胡椒（香料）商人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who season food by adding pepper (the spice).","zh":"给食物加胡椒（香料）调味的人。"},"examples":[{"en":"The pepperers at the table kept adding black pepper to the soup.","zh":"桌边那些加胡椒的人不停往汤里撒黑胡椒。"},{"en":"In our family, my dad is the main pepperer—he puts pepper on everything.","zh":"我们家我爸最爱加胡椒——几乎什么都要撒点胡椒。"}]},{"partOfSpeech":"n.","definition":{"en":"People who repeatedly hit, attack, or shower someone/something with many small actions (such as questions, criticism, or bullets).","zh":"（比喻或字面）用许多小动作反复“猛攻”的人，比如连珠炮似地提问、批评，或用子弹扫射。"},"examples":[{"en":"Reporters became pepperers, firing question after question at the actor.","zh":"记者们像“连珠炮手”一样，一连串问题轰向那位演员。"},{"en":"The area was targeted by pepperers who sprayed the walls with paintballs.","zh":"那片区域被“连射者”用彩弹把墙面打得满是斑点。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, members of the Pepperers: a group/guild of spice merchants (especially dealing in pepper) in medieval England.","zh":"（历史）“Pepperers（胡椒商）”的成员：中世纪英格兰经营香料（尤其胡椒）的商人/行会成员。"},"examples":[{"en":"In a history lesson, we read about pepperers who helped build early trade networks.","zh":"历史课上我们读到胡椒商如何推动早期贸易网络的发展。"},{"en":"The city records mention pepperers alongside other merchant groups.","zh":"城市档案中提到胡椒商与其他商人团体并列出现。"}]}],"synonyms":["seasoners","spice users","questioners","attackers","spice merchants"],"phonetic":"ˈpɛpərərz","extraExplanation":["“Pepperers”在中世纪语境里常指做香料生意的商人群体。胡椒当时非常昂贵，是远距离贸易的重要商品之一，因此“pepperers”也常与城市行会、贸易路线和财富积累联系在一起。"]}
{"word":"peppergrass","summary":{"en":"Peppergrass is a peppery-tasting wild cress plant (Lepidium), often seen as a weed and sometimes eaten in small amounts.","zh":"Peppergrass 指一种带辛辣味的野生“独行菜/水芹”类植物（Lepidium 属），常见为杂草，也有人少量食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wild plant with a peppery taste, often considered a weed; it is a kind of cress (genus Lepidium).","zh":"一种带胡椒辛辣味的小型野生植物，常被当作杂草；属于“水芹/独行菜属”(Lepidium) 的一类香草（常称“胡椒草/胡椒水芹/胡椒芥菜”一类）。"},"examples":[{"en":"Peppergrass grows quickly in gardens and can be hard to remove once it spreads.","zh":"胡椒草在花园里长得很快，一旦扩散就很难清除。"},{"en":"Some people add young peppergrass leaves to salads for a spicy, mustard-like bite.","zh":"有些人会把嫩的胡椒草叶子加进沙拉里，带来类似芥末的辛辣口感。"}]}],"synonyms":["pepperweed","cress","Virginia pepperweed (regional)"],"phonetic":"/ˈpɛpərˌɡræs/","extraExplanation":["“Peppergrass”在日常英语里多指Lepidium属的植物，常见的包括“Virginia pepperweed / peppergrass (Lepidium virginicum)”。不同地区可能把近似的野生芥菜类植物也俗称为peppergrass，所以在园艺或野外识别时，最好结合拉丁学名或图片确认。","它的英文名来自味道：叶子或种子带辛辣、胡椒/芥末般的风味（peppery）。在一些地方会被当作可食用的野菜，但也常被视为庭院杂草。"]}
{"word":"pepperidge","summary":{"en":"Pepperidge is mainly known as part of the American food brand name “Pepperidge Farm.”","zh":"Pepperidge 主要作为美国食品品牌名“Pepperidge Farm”的一部分出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brand name most commonly seen in “Pepperidge Farm,” an American company known for breads, cookies, crackers, and snacks.","zh":"品牌名，最常见于“Pepperidge Farm（胡椒岭农场）”，一家美国食品公司，以面包、饼干、苏打饼/薄脆饼和零食等闻名。"},"examples":[{"en":"I bought Pepperidge Farm cookies for the trip.","zh":"我买了 Pepperidge Farm 的饼干带去旅行。"},{"en":"Their house always has Pepperidge Farm Goldfish crackers for the kids.","zh":"他们家总会备着 Pepperidge Farm 的金鱼形小饼干给孩子吃。"}]}],"phonetic":"/ˈpɛpərɪdʒ/","extraExplanation":["“Pepperidge”本身通常不会单独使用；日常英语里多是完整品牌名“Pepperidge Farm”。在口语与网络文化中还有一句常见梗：\"Pepperidge Farm remembers.\" 用来半开玩笑地表示“我可还记得呢/别以为没人记得”，常带一点讽刺或吐槽的语气。"]}
{"word":"pepperily","summary":{"en":"Pepperily means speaking or acting in an irritable, sharp, slightly angry way.","zh":"pepperily 指说话或做事带点火气、尖锐、不耐烦的样子。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slightly angry, sharp, or impatient way; with a “peppery” (spicy/irritable) tone.","zh":"带点恼火、尖刻或不耐烦地；语气“带辣味/火气”地。"},"examples":[{"en":"“What do you want?” she asked pepperily.","zh":"“你想干什么？”她带着火气问。"},{"en":"He replied pepperily, clearly annoyed by the delay.","zh":"他带着不耐烦的语气回答，显然对延误很恼火。"}]}],"synonyms":["irritably","sharply","snappishly","testily"],"phonetic":"/ˈpɛpɚəli/","extraExplanation":["“pepperily”来自形容词“peppery”（像胡椒一样辛辣的；也可指脾气火爆、说话冲）。英语里常用食物的“辣/呛”来比喻人的语气或性格。","文体上它更常见于小说或叙述性写作，用来快速刻画人物说话的情绪；日常口语里更常说“angrily / irritably / sharply”。","相关表达：“peppery remark”（尖刻的话）、“peppery tone”（冲的语气）、“to snap”（厉声回嘴）、“to retort”（反唇相讥）。"]}
{"word":"pepperiness","summary":{"en":"Pepperiness means a pepper-like spicy sharpness in taste/smell, or a lively sharp edge in style or attitude.","zh":"Pepperiness 指胡椒般的辛辣刺激（味道/气味），也可指言谈或风格上的犀利与活力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spicy, pepper-like taste or smell (a slight burning or sharpness).","zh":"（食物或气味的）胡椒般的辛辣感、刺激感。"},"examples":[{"en":"The soup has a pleasant pepperiness that warms your throat.","zh":"这汤有一种舒服的胡椒辛辣感，会让喉咙暖起来。"},{"en":"I like the pepperiness of arugula in a salad.","zh":"我喜欢沙拉里芝麻菜带来的那种胡椒般的辛味。"}]},{"partOfSpeech":"n.","definition":{"en":"A sharp, lively quality in style, speech, or attitude; a bit of bold energy.","zh":"（风格、言谈或态度的）犀利感、活力感；带点“辣劲”的气质。"},"examples":[{"en":"Her comments had a pepperiness that kept the meeting moving.","zh":"她的发言有点犀利和带劲，让会议推进得更快。"},{"en":"The novel’s dialogue adds pepperiness to an otherwise quiet story.","zh":"小说的对白为原本平静的故事增添了“辣味”和活力。"}]}],"synonyms":["spiciness","pungency","bite","zing","sharpness"],"phonetic":"/ˈpɛpɚinəs/","extraExplanation":["“pepperiness”来自“peppery（像胡椒一样辛辣的）+ -ness（名词后缀，表示性质/状态）”。常用于美食写作（描述口感/香气），也可比喻人的语言或风格“有点冲、有劲、够直接”。","在食品描述里，它不一定等于“很辣（hot）”，更常指“辛香、微刺、带胡椒的锐利感”。比如黑胡椒、芝麻菜、萝卜、部分橄榄油或某些红酒都可能被形容有pepperiness。"]}
{"word":"peppering","summary":{"en":"“Peppering” usually means adding pepper to food, or (figuratively) hitting/covering something with many small impacts, or asking many rapid questions.","zh":"“Peppering”常指给食物撒胡椒；也可引申为让某物布满许多小的击打/痕迹，或对某人连珠炮式提问。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add pepper (the spice) to food; to season with pepper","zh":"给食物加胡椒；用胡椒调味"},"examples":[{"en":"She’s peppering the soup with black pepper.","zh":"她正在往汤里撒黑胡椒。"},{"en":"Try peppering the eggs lightly; you can always add more later.","zh":"鸡蛋先少撒一点胡椒；不够的话之后再加。"}]},{"partOfSpeech":"v.","definition":{"en":"to hit or cover someone/something with many small shots, blows, or marks","zh":"用许多小的射击/打击/痕迹击中或覆盖；使布满（小点、小洞）"},"examples":[{"en":"The wall was peppered with bullet holes.","zh":"墙上布满了弹孔。"},{"en":"Hail peppered the car roof all night.","zh":"冰雹整夜噼里啪啦地砸在车顶上。"}]},{"partOfSpeech":"v.","definition":{"en":"to ask someone many quick questions (often in an intense way)","zh":"连珠炮似地提问（常带有咄咄逼人的感觉）"},"examples":[{"en":"Reporters kept peppering the actor with questions.","zh":"记者不停地向那位演员抛出问题。"},{"en":"He peppered me with questions about my new job.","zh":"他连珠炮似地问我新工作的各种问题。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of adding pepper, or the process of hitting/covering something with many small things; also the present participle form of “pepper”","zh":"撒胡椒的动作；或“使布满/连番攻击”的过程；也是动词 pepper 的现在分词形式"},"examples":[{"en":"A light peppering is enough for this dish.","zh":"这道菜轻轻撒一点胡椒就够了。"}]}],"synonyms":["season (with pepper)","sprinkle","pelt","riddle (with holes)","bombard (with questions)"],"phonetic":"/ˈpɛpərɪŋ/","extraExplanation":["“pepper (v.)”从“pepper（胡椒）”这个名词引申而来：胡椒粒小而多，所以动词含义常带有“许多小东西密集落下/打中”的画面感。由此也自然发展出“pepper someone with questions（连珠炮式提问）”这种比喻用法。","常见搭配：pepper something with something（用……点缀/散布……），如“pepper the conversation with jokes（在谈话中穿插笑话）”。这个用法语气通常较中性或偏积极。"]}
{"word":"pepperish","summary":{"en":"Pepperish means slightly peppery—having a mild pepper-like spicy or pungent taste or smell.","zh":"pepperish 指“有点胡椒味的”，带轻微的辛辣或刺激感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like pepper in taste or smell; mildly peppery, spicy, or pungent.","zh":"带一点胡椒味的；微辣、微刺鼻的。"},"examples":[{"en":"The salad had a pepperish bite from the arugula.","zh":"这道沙拉因为芝麻菜而带着一点胡椒般的微辣感。"},{"en":"I like a pepperish sauce, but not one that’s too hot.","zh":"我喜欢带点胡椒味的酱汁，但不想要太辣的。"},{"en":"The soup tasted pepperish, even though I didn’t add much pepper.","zh":"这汤尝起来有点胡椒味，尽管我没放多少胡椒。"}]}],"synonyms":["peppery","spicy","pungent","piquant","zesty"],"phonetic":"/ˈpɛpərɪʃ/","extraExplanation":["“pepperish”比较少见，更常用的是“peppery”。后缀“-ish”常表示“有点……的、略微……的”（如：greenish=有点偏绿的，childish=有点孩子气的）。因此 pepperish 往往强调“轻微、带一点点胡椒感”，语气比 peppery 更“淡一点”。"]}
{"word":"pepperishly","summary":{"en":"Pepperishly means “in a peppery way,” either irritable/sharp in tone or spicy/sharp in taste.","zh":"pepperishly 表示“带胡椒般的感觉”，可指语气尖刻爱发火，也可指味道辛辣。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an irritable, sharp, or snappish way; as if “peppery” in mood.","zh":"（语气/态度）带火气地；尖刻地；爱发脾气地。"},"examples":[{"en":"She answered pepperishly when asked the same question again.","zh":"被同一个问题又问了一遍时，她带着火气回答了。"},{"en":"The coach spoke pepperishly, but he wasn’t trying to be cruel.","zh":"教练说话有点冲，但他并不是想刻薄。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a pepper-like, spicy way (about taste or smell); with a peppery bite.","zh":"（味道/气味）像胡椒一样辛辣地；带胡椒味地。"},"examples":[{"en":"The salad tasted pepperishly sharp because of the arugula.","zh":"因为有芝麻菜，这道沙拉吃起来带点胡椒般的辛辣。"},{"en":"The soup finished pepperishly on the tongue.","zh":"这汤入口后舌尖有胡椒般的辛辣收尾。"}]}],"synonyms":["snappily","irritably","sharply","testily","spicily"],"phonetic":"/ˈpɛpərɪʃli/","extraExplanation":["“pepperishly”来自形容词“peppery（像胡椒一样辛辣的；脾气火爆的）”，加上“-ish（带点……的感觉）”和副词后缀“-ly（……地）”。所以它既可形容“味道的辛辣”，也常用来形容“说话做事很冲、很尖锐”的语气。","这个词不算高频，写作中偶尔用来营造生动的语气或人物性格；日常口语更常说“snappily / irritably / sharply”。"]}
{"word":"peppermint","summary":{"en":"Peppermint is a type of mint used for its cool flavor and smell, and it can also mean peppermint-flavored candy.","zh":"peppermint 指胡椒薄荷（用于清凉香味与调味），也可指薄荷味糖果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong-smelling herb (mint) with a cool, slightly sweet taste, often used to flavor foods, tea, and medicine.","zh":"薄荷的一种（胡椒薄荷），气味浓烈，味道清凉微甜，常用于给食物、茶和药品调味。"},"examples":[{"en":"I like peppermint tea after dinner because it feels soothing.","zh":"我喜欢晚饭后喝胡椒薄荷茶，因为感觉很舒服。"},{"en":"The toothpaste has a peppermint flavor.","zh":"这款牙膏是胡椒薄荷味的。"},{"en":"Peppermint oil is sometimes used to help with nausea.","zh":"胡椒薄荷精油有时用来缓解恶心。"}]},{"partOfSpeech":"n.","definition":{"en":"A candy (often red-and-white) flavored with peppermint, such as a peppermint stick or peppermint candy.","zh":"薄荷味糖果（常见红白相间），如薄荷拐杖糖或薄荷糖。"},"examples":[{"en":"She offered me a peppermint after the meal.","zh":"饭后她递给我一颗薄荷糖。"},{"en":"We hung peppermint sticks on the tree during the holidays.","zh":"节日期间我们把薄荷拐杖糖挂在树上。"}]}],"synonyms":["mint","peppermint candy","mint candy","peppermint stick"],"phonetic":"/ˈpɛpɚˌmɪnt/","extraExplanation":["“pepper-”在这里不是“胡椒”的味道，而是强调这种薄荷比一般薄荷更“辛凉、刺激”的感觉；中文常译为“胡椒薄荷”或直接说“薄荷（味）”。","在英语文化里，peppermint 常和清新口气、牙膏/口香糖、以及冬季节日糖果（peppermint candy cane）联系在一起。"]}
{"word":"peppermints","summary":{"en":"Peppermints are mint-flavored candies; less commonly, it can refer to the peppermint plant or its flavor/oil in plural.","zh":"peppermints 通常指薄荷糖；较少见时也可指薄荷植物或薄荷味／精油的复数用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, hard or chewy candies flavored with peppermint (mint).","zh":"薄荷糖；薄荷味的小硬糖或软糖。"},"examples":[{"en":"She keeps peppermints in her bag for fresh breath.","zh":"她包里常放薄荷糖，用来清新口气。"},{"en":"The restaurant offered peppermints with the check.","zh":"餐厅在结账单旁附送了薄荷糖。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the peppermint plant or its flavor/oil, referring to multiple kinds or pieces.","zh":"（较少见）薄荷植物或薄荷的味道／精油（复数用法，指多种或多份）。"},"examples":[{"en":"Different peppermints can vary in strength and sweetness.","zh":"不同种类的薄荷味道浓淡和甜度可能不一样。"},{"en":"Some teas blend peppermints with chamomile.","zh":"有些茶会把薄荷和洋甘菊混合在一起。"}]}],"synonyms":["mint candies","mints","peppermint candies"],"phonetic":"/ˈpɛpərˌmɪnt/","extraExplanation":["“Peppermints”是“peppermint”的复数。日常英语里更常指“薄荷糖”（尤其是小圆硬糖或拐杖糖的薄荷味那类）。","在一些北美餐厅，结账时给客人放几颗薄荷糖是一种常见的小礼貌，意思是“谢谢光临、清新口气”。","“peppermint”也可以指薄荷这种植物或薄荷精油；如果你想表达“薄荷味”，也常见说法是“peppermint-flavored”。"]}
{"word":"pepperminty","summary":{"en":"Pepperminty means having a cool, fresh peppermint smell or taste.","zh":"Pepperminty 指“带胡椒薄荷味/香气的”，常形容清凉、清新的薄荷风味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the smell or taste of peppermint (cool, fresh, minty, slightly sweet).","zh":"有薄荷（胡椒薄荷）味/香气的；带清凉、清新、微甜薄荷口感的。"},"examples":[{"en":"This tea has a pepperminty flavor that feels cooling after each sip.","zh":"这款茶有一种薄荷味，每一口之后都让人感觉清凉。"},{"en":"I like pepperminty toothpaste because it makes my mouth feel fresh.","zh":"我喜欢薄荷味的牙膏，因为它会让口腔感觉清新。"},{"en":"The room smelled pepperminty after they burned a mint-scented candle.","zh":"他们点了薄荷香薰蜡烛后，房间里闻起来都是薄荷味。"}]}],"synonyms":["minty","peppermint-flavored","peppermint-scented","cooling","fresh"],"phonetic":"/ˈpɛpərˌmɪnti/","extraExplanation":["“pepperminty”是由“peppermint（胡椒薄荷/薄荷糖常见口味）+ -y”构成的形容词，表示“有……味道/气味的”。在口语和商品描述里很常见（牙膏、口香糖、茶、香薰、护唇膏等）。","有时也会用更常见的“minty（薄荷味的）”。“pepperminty”更具体，强调是“peppermint”这种带一点甜感、清凉感更强的薄荷风味。"]}
{"word":"pepperoni","summary":{"en":"Pepperoni is a spicy cured sausage, best known as a common pizza topping in the U.S.","zh":"Pepperoni 指一种带辣味的腌制香肠，在美国最常见的用法是披萨配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of spicy, cured sausage (usually made from pork and/or beef), commonly sliced and used as a topping on pizza.","zh":"一种带辣味的腌制香肠（通常由猪肉和/或牛肉制成），常切片作为披萨配料。"},"examples":[{"en":"I’ll have a pepperoni pizza, please.","zh":"我想要一份意大利辣香肠披萨。"},{"en":"She picked off the pepperoni because she doesn’t eat meat.","zh":"她把意大利辣香肠挑掉了，因为她不吃肉。"},{"en":"The pepperoni is a bit too spicy for me.","zh":"这意大利辣香肠对我来说有点太辣。"}]}],"synonyms":["spicy sausage","cured sausage","salami (similar)"],"phonetic":"/ˌpɛpəˈroʊni/","extraExplanation":["在美国英语里，pepperoni 是非常典型的“披萨配料”词汇；虽然名字像意大利语，但这种做法主要是在美国意大利移民文化中流行起来的，和意大利本土的 salame piccante（辣味萨拉米）相近但不完全相同。","点餐时常见搭配：pepperoni pizza（意大利辣香肠披萨）、extra pepperoni（加量辣香肠）、half pepperoni（半边加辣香肠）、pepperoni and mushrooms（辣香肠蘑菇）。"]}
{"word":"pepperproof","summary":{"en":"Pepperproof means protected from pepper spray or, informally, not much affected by pepper seasoning.","zh":"pepperproof 指能抵御胡椒喷雾；也可（非正式/幽默）指不太受胡椒调味影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to or protected from pepper spray (or similar pepper-based irritants).","zh":"（对）胡椒喷雾（或类似胡椒刺激物）有防护作用的；能抵御胡椒喷雾的。"},"examples":[{"en":"The goggles are marketed as pepperproof for crowd-control situations.","zh":"这款护目镜被宣传为“防胡椒喷雾”，适用于人群管控场景。"},{"en":"The mask isn’t fully pepperproof, but it can reduce irritation.","zh":"这口罩并非完全防胡椒喷雾，但能减轻刺激。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not easily affected by pepper as a seasoning (used humorously or informally).","zh":"（幽默/非正式）不太会被胡椒这种调味影响的；“胡椒也奈何不了”的。"},"examples":[{"en":"My grandpa’s soup is so strong it’s basically pepperproof.","zh":"我爷爷的汤味道太重了，简直是“胡椒也压不住”。"},{"en":"This recipe is pepperproof—add a little more if you like it spicy.","zh":"这个食谱不怕胡椒味——喜欢辣一点的话可以多加些。"}]}],"synonyms":["pepper-proof","spray-resistant","irritant-resistant","waterproof (pattern: -proof)"],"phonetic":"/ˈpɛpɚˌpruːf/","extraExplanation":["“pepperproof”不是非常常见的标准词，更常见的写法是带连字符的“pepper-proof”。它属于英语里常见的构词方式：名词 + -proof（表示“防……的 / 不受……影响的”），比如 waterproof（防水）、bulletproof（防弹）、leakproof（防漏）。","在现实语境中，如果谈到安保、防护装备，“pepperproof”通常指“防胡椒喷雾”；在饮食语境中则多为夸张或玩笑说法，表示“胡椒味影响不大”。"]}
{"word":"pepperroot","summary":{"en":"Pepperroot is a common name for certain wild plants whose roots taste peppery, especially some North American toothworts.","zh":"Pepperroot 是某些根部带胡椒般辛辣味的野生植物的俗称，尤指北美的一些齿根草（toothwort）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for certain wild plants with peppery-tasting roots, especially some toothworts (Cardamine/Dentaria species) in North America","zh":"某些根部带胡椒辛辣味的野生植物的俗称，尤指北美的“齿根草/齿根菜”（Cardamine/Dentaria 属的一些种）"},"examples":[{"en":"In early spring, pepperroot can be identified by its small white flowers and pungent root.","zh":"早春时，pepperroot 常可凭借小白花和带辛辣味的根来辨认。"},{"en":"Some foragers describe pepperroot’s flavor as a mild, horseradish-like bite.","zh":"一些采集者形容 pepperroot 的味道有点像温和的辣根，带一点冲劲。"}]}],"synonyms":["toothwort (common name for some species)","pepper root (variant spelling)"],"phonetic":"/ˈpɛpɚˌruːt/","extraExplanation":["“pepperroot”是俗名，不是严格的单一物种名称；在不同地区可能指不同植物（常见指齿根草/Toothwort）。阅读野外指南或种子目录时，最好同时查看学名（如 Cardamine diphylla 等）以避免混淆。","在自然写作或徒步语境里，这个词更常用于描述野生植物的气味/味道特征（“peppery”），而不是指厨房里的胡椒。"]}
{"word":"peppers","summary":{"en":"“Peppers” can mean either the spice (pepper) or vegetables like bell peppers/chili peppers; it can also be a verb meaning “to sprinkle” or “to bombard with many small things.”","zh":"“peppers”既可指香料“胡椒”，也可指蔬菜“甜椒/辣椒”；还可作动词，表示“撒/点缀”或“连珠炮式地大量投向（问题等）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) The dried spice made from ground peppercorns (black, white, etc.), used to add a hot, sharp taste to food.","zh":"（复数）胡椒粉/胡椒（由胡椒粒研磨而成的香料，如黑胡椒、白胡椒等），用于给食物增加辛辣、刺激的味道。"},"examples":[{"en":"Please pass the salt and peppers.","zh":"请把盐和胡椒递给我。"},{"en":"Different peppers can change the flavor of the soup a lot.","zh":"不同种类的胡椒会让汤的味道变化很大。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Vegetables such as bell peppers or chili peppers, often eaten raw, cooked, or used in sauces.","zh":"（复数）辣椒/甜椒等蔬菜（如彩椒、青椒、红椒或辣椒），可生吃、炒煮或做酱料。"},"examples":[{"en":"She sliced red and green peppers for the salad.","zh":"她把红椒和青椒切片做沙拉。"},{"en":"These peppers are very spicy, so add them slowly.","zh":"这些辣椒很辣，所以要一点点加。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular) To scatter or sprinkle something over a surface; or to hit/cover repeatedly with many small things (often in news: questions, bullets, etc.).","zh":"（第三人称单数）撒/点缀；或（常见于新闻/书面语）用许多小东西反复击中、密集覆盖（如问题、子弹等）。"},"examples":[{"en":"He peppers the eggs with black pepper.","zh":"他在鸡蛋上撒了黑胡椒。"},{"en":"Reporters pepper him with questions after the speech.","zh":"演讲结束后，记者们连珠炮似地向他提问。"}]}],"synonyms":["chili peppers","bell peppers","capsicums","pepper (spice)","seasoning"],"phonetic":"/ˈpɛpɚz/","extraExplanation":["在日常英语里，peppers 很容易有两种常见指代：\n1）pepper(s) 作“胡椒（香料）”，通常来自胡椒粒（peppercorns），常见搭配是 salt and pepper。\n2）pepper(s) 作“辣椒/甜椒（蔬菜）”，包括 bell peppers（甜椒/彩椒）和 chili peppers（辣椒）。\n区分方法：在餐桌上说 pass the pepper 多半指胡椒；在买菜或做菜语境里说 peppers 通常指蔬菜。"]}
{"word":"peppershrike","summary":{"en":"Peppershrike is a (usually hyphenated) English name for a Central/South American songbird in the genus Cyclarhis, known for loud calls.","zh":"Peppershrike（常写作 pepper-shrike）是中南美洲一种 Cyclarhis 属鸣禽的英文名，以响亮的叫声著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small songbird found in Central and South America, known for its loud, sharp calls; also called a pepper-shrike (genus Cyclarhis).","zh":"一种分布于中美洲和南美洲的小型鸣禽，以响亮、尖锐的叫声著称；也写作 pepper-shrike（椒伯劳，常指 Cyclarhis 属）。"},"examples":[{"en":"We heard a peppershrike calling loudly from the edge of the forest.","zh":"我们在森林边缘听到一只椒伯劳大声鸣叫。"},{"en":"The guide pointed out a peppershrike by its heavy bill and repeated, whistling notes.","zh":"向导凭它粗壮的嘴和反复的口哨声指出那是一只椒伯劳。"}]}],"synonyms":["pepper-shrike","pepper shrike"],"phonetic":"/ˈpɛpɚˌʃraɪk/","extraExplanation":["“peppershrike”更常见的写法是“pepper-shrike”或“pepper shrike”。它名字里有“shrike（伯劳）”，但在分类上并不一定属于真正的伯劳科；在鸟类英文名里，这类命名有时是基于外形或习性相似而来。","“pepper（胡椒）”可能与其鸣声的“辛辣/刺耳”感觉或民间命名传统有关，并不是说它吃胡椒。不同地区也可能用这个英文名指同一属的近缘种。"]}
{"word":"peppertree","summary":{"en":"Peppertree is a common name for an ornamental tree with a peppery smell and small berries, sometimes used as “pink peppercorns.”","zh":"peppertree 常指一种带辛辣香气、结小浆果的观赏树；其果实有时被当作“粉红胡椒粒”使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (often the Peruvian/California pepper tree) with peppery-smelling leaves and small berries, grown as an ornamental plant; its dried berries are sometimes used as “pink peppercorns.”","zh":"胡椒树（常指秘鲁胡椒树/加州胡椒树）：一种叶子有辛辣香气、结小浆果的树，常作观赏树；其干燥果实有时会被当作“粉红胡椒粒”使用。"},"examples":[{"en":"A peppertree shaded the patio with its drooping branches.","zh":"一棵胡椒树用下垂的枝条给露台遮出了阴凉。"},{"en":"Some cooks sprinkle dried peppertree berries as a garnish, but they aren’t the same as black pepper.","zh":"有些厨师会撒一点干胡椒树果作点缀，但它和黑胡椒不是同一种东西。"}]},{"partOfSpeech":"n.","definition":{"en":"(general use) any tree commonly called a “pepper tree,” including several different species in different regions.","zh":"（泛指）各地俗称“胡椒树”的不同树种之一（不同地区所指物种可能不同）。"},"examples":[{"en":"In this region, “peppertree” usually refers to the species planted along streets.","zh":"在这个地区，“胡椒树”通常指的是路边常种的那种树。"},{"en":"Ask a local nursery which peppertree varieties grow well in your climate.","zh":"可以问问本地苗圃：哪些胡椒树品种适合你那里的气候。"}]}],"synonyms":["pepper tree","Peruvian pepper tree","California pepper tree"],"phonetic":"/ˈpɛpɚˌtri/","extraExplanation":["“Peppertree”在英语里不是单一物种名，而是常见俗名。北美语境里常见指Schinus molle（Peruvian/California pepper tree）。其果实常被称作“pink peppercorns”，但严格来说并非黑胡椒（black pepper，来自胡椒藤Piper nigrum）。","在一些地区（如澳大利亚）“pepper tree”也可能指其他树种；阅读或旅行时若要精确，最好查当地具体指哪一种。"]}
{"word":"pepperweed","summary":{"en":"Pepperweed is a peppery-tasting plant often found growing wild; some types are edible, but many are treated as weeds.","zh":"Pepperweed 指一种带胡椒般辛辣味、常野生生长的植物；有些可食用，但很多被当作杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant (often in the mustard family) with small white flowers and peppery-tasting leaves or seeds; some kinds are eaten as a spicy green or are considered weeds.","zh":"一种（多属十字花科的）植物，开小白花，叶或种子带胡椒般辛辣味；有些可食用作辛辣绿叶菜，也常被视为杂草。"},"examples":[{"en":"We found pepperweed growing along the edge of the field.","zh":"我们在田边发现了胡椒草在生长。"},{"en":"The salad had a mild, peppery bite from pepperweed leaves.","zh":"这份沙拉因为加了胡椒草的叶子而带一点温和的辛辣味。"},{"en":"In some areas, pepperweed spreads quickly and is treated as an invasive weed.","zh":"在一些地区，胡椒草蔓延很快，被当作入侵性杂草处理。"}]}],"synonyms":["pepperwort","Lepidium (genus name)"],"phonetic":"/ˈpɛpɚˌwid/","extraExplanation":["“pepperweed”不是指黑胡椒那种香料，而是指某些带辛辣味的野生植物的统称；不同地区可能指不同物种，常见的有Lepidium（碎米荠属）的一些植物。","有些pepperweed嫩叶可少量食用（味道像芥末/胡椒），但野外采食需要确认物种与环境安全（避免误认与污染区域）。"]}
{"word":"pepperwood","summary":{"en":"Pepperwood is a common name for certain spicy-scented trees/shrubs, and it can also mean their timber.","zh":"Pepperwood是带辛辣气味的某些树/灌木的俗名，也可指其木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree or shrub commonly called “pepperwood,” especially one with spicy-smelling leaves or bark (the exact species depends on the region).","zh":"“pepperwood（胡椒木/椒木）”的俗名，指带有辛辣气味叶片或树皮的树或灌木（具体是哪一种植物因地区而异）。"},"examples":[{"en":"In Northern California, people sometimes call the California bay laurel “pepperwood.”","zh":"在加州北部，人们有时把加州月桂（California bay laurel）叫作“pepperwood”。"},{"en":"The trail passed through a stand of pepperwood that smelled sharp and spicy after the rain.","zh":"小径穿过一片pepperwood，雨后空气里有种清冽辛辣的香味。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood (timber) from a pepperwood tree, used in local woodworking or building.","zh":"pepperwood树的木材，可用于当地的木工或建造。"},"examples":[{"en":"The cabinet was made from pepperwood and finished with oil.","zh":"这个柜子是用pepperwood木材做的，并用油做了表面处理。"}]}],"synonyms":["pepper tree (regional)","California bay laurel (regional)","Tasmanian pepper (regional)"],"phonetic":"/ˈpɛpərˌwʊd/","extraExplanation":["“Pepperwood”是常见名而不是严格的学名：在美国西海岸常指加州月桂（Umbellularia californica），其叶子气味很浓；在澳大利亚也可能指塔斯马尼亚胡椒（Tasmannia lanceolata）。阅读或查资料时最好结合地理背景判断具体植物。","有些地区会把它的叶子当作香料使用，但因为不同“pepperwood”可能是不同物种，食用前需要确认来源与安全性。"]}
{"word":"pepperwort","summary":{"en":"Pepperwort is a peppery-tasting mustard-family plant, sometimes eaten or used as a seasoning.","zh":"Pepperwort 指一种带辛辣胡椒味的十字花科植物，有时可食用或作调味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant in the mustard family (often in the genus Lepidium) with a peppery taste; some kinds are eaten as salad greens or used as a seasoning.","zh":"一种十字花科植物（常见于独行菜属 Lepidium），带有胡椒般的辛辣味；有些品种可作沙拉菜或调味用。"},"examples":[{"en":"Some people add pepperwort to salads for a spicy, fresh bite.","zh":"有些人会把 pepperwort 加进沙拉里，增加辛辣清爽的口感。"},{"en":"In spring, pepperwort can grow quickly in fields and along roadsides.","zh":"春天里，pepperwort 常在田野和路边迅速生长。"}]}],"synonyms":["peppergrass","pepperweed","Lepidium"],"phonetic":"/ˈpɛpɚˌwɝt/","extraExplanation":["“Pepperwort”是一个合成词：pepper（胡椒/辛辣）+ wort（古英语里常指“植物、草本”）。因此它字面意思就是“带胡椒味的草本植物”。","在不同地区，pepperwort可能指不同的独行菜属植物；有的被当作野生可食植物或香草，有的则被视为杂草。阅读园艺或自然观察类文章时，常需要结合上下文或拉丁学名确认具体是哪一种。"]}
{"word":"peppery","summary":{"en":"“Peppery” describes a pepper-like spicy taste/smell, or a sharp, snappish tone.","zh":"“peppery”既可形容胡椒般的辛辣味/气味，也可形容语气尖刻、带火气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a strong, spicy taste or smell like black pepper; slightly hot or biting.","zh":"有胡椒般的辛辣味或气味；带点辣、刺激的。"},"examples":[{"en":"This salad dressing is peppery, so use a little at first.","zh":"这款沙拉酱很有胡椒的辛辣味，先少放一点。"},{"en":"The arugula adds a peppery bite to the sandwich.","zh":"芝麻菜给三明治增添了胡椒般的辛辣刺激感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person’s tone or manner) Quick, sharp, or slightly angry; snappish.","zh":"（指语气或态度）急躁的、尖刻的；带点火气的。"},"examples":[{"en":"She gave a peppery reply when he kept interrupting her.","zh":"他不停打断她时，她回话带着点火气。"},{"en":"His peppery tone softened after he realized it was a misunderstanding.","zh":"他意识到是误会后，尖刻的语气缓和了。"}]}],"synonyms":["spicy","pungent","piquant","sharp","snappish"],"phonetic":"/ˈpɛpəri/","extraExplanation":["“peppery”常用来形容食物的风味（像黑胡椒那种辛辣、刺激的“bite”），也可比喻人的语气“带刺”“火气大”。在食物语境里，经常和 arugula（芝麻菜）、radish（萝卜）、ginger（姜）等一起出现，因为这些食材也常被描述为 peppery。"]}
{"word":"peppier","summary":{"en":"“Peppier” means more lively and energetic (comparative of “peppy”).","zh":"“peppier”表示“更有精神、更有活力”（是“peppy”的比较级）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More energetic, lively, and enthusiastic than before or than someone/something else.","zh":"（比以前或比别的）更有精神的、更活跃的、更热情的。"},"examples":[{"en":"After a short walk, I felt peppier and more focused.","zh":"短暂散步后，我感觉更精神了，也更专注。"},{"en":"This song is peppier than the last one.","zh":"这首歌比上一首更欢快、更有活力。"},{"en":"Try a peppier tone in your email—it sounds friendlier.","zh":"邮件里可以用更有活力的语气——听起来更友好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Having more peppery flavor; spicier.","zh":"（较少见）更有胡椒味的；更辛辣的。"},"examples":[{"en":"This sauce is peppier if you add black pepper.","zh":"加点黑胡椒后，这个酱会更辛辣、更有胡椒味。"}]}],"synonyms":["more energetic","livelier","more upbeat","more spirited","more lively"],"phonetic":"/ˈpɛpiər/","extraExplanation":["“peppier”是形容词“peppy”的比较级，常用于口语和轻松的写作中，表示精力更充沛、气氛更带劲。其核心名词“pep”有“活力、劲头”的意思。","比较级常见搭配：feel/get peppier（变得更有精神）、a peppier mood/tone/song（更有活力的心情/语气/歌曲）。"]}
{"word":"peppiest","summary":{"en":"“Peppiest” means the most lively and energetic.","zh":"“peppiest”表示“最有活力、最有精神”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The most energetic, lively, and enthusiastic (superlative form of “peppy”).","zh":"最有精神的；最活泼的；最热情的（“peppy”的最高级）。"},"examples":[{"en":"Of all the kids in the class, Maya is the peppiest in the morning.","zh":"在班里所有孩子中，Maya 早上最有精神。"},{"en":"We need the peppiest song to open the show.","zh":"我们需要一首最欢快有活力的歌来开场。"},{"en":"After a short break, he came back even peppiest and ready to work.","zh":"短暂休息后，他回来时更有精神了，准备继续工作。"}]}],"synonyms":["most energetic","most lively","most upbeat","most spirited","most perky"],"phonetic":"/ˈpɛpiɪst/","extraExplanation":["“peppiest”是形容词“peppy”的最高级形式：peppy（有精神的）→ peppier（更有精神的）→ peppiest（最有精神的）。常用来形容人、音乐、气氛、风格等“充满活力”。","“pep”原意有“精力、活力”的意思，历史上与“pepper（胡椒）”这种“刺激、提神”的联想有关，所以语感上带有“有劲儿、带劲”的感觉。"]}
{"word":"peppily","summary":{"en":"“Peppily” means doing something in a cheerful, energetic, upbeat way.","zh":"“peppily”表示做某事时很有精神、很欢快、很有活力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a lively, cheerful, and energetic way.","zh":"活泼地；精神十足地；愉快地。"},"examples":[{"en":"She walked peppily into the room and greeted everyone.","zh":"她精神十足地走进房间，跟大家打招呼。"},{"en":"The band played peppily, making the audience clap along.","zh":"乐队演奏得很欢快，观众也跟着拍手。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a brisk, upbeat style (often describing speech, music, writing, or movement).","zh":"以轻快、振奋的风格（常形容说话、音乐、写作或动作）。"},"examples":[{"en":"He answered peppily, even though he was tired.","zh":"尽管他很累，还是用轻快的语气回答。"},{"en":"The commercial is narrated peppily to sound positive and friendly.","zh":"广告用轻快的旁白来营造积极亲切的感觉。"}]}],"synonyms":["cheerfully","energetically","lively","briskly","buoyantly"],"phonetic":"/ˈpɛpəli/","extraExplanation":["“peppily”来自形容词“peppy”（有活力的），而“pep”原指“精力、劲头”。在日常英语里，它常用来描述一种“让人感觉有朝气、带动气氛”的方式。","语气上，“peppily”通常是褒义；但在某些语境里也可能带一点“过度热情、像刻意打鸡血”的感觉，取决于说话者的态度和上下文。"]}
{"word":"peppin","summary":{"en":"“Peppin” is usually a surname or a name; it’s not a common English word. It may sometimes be a misspelling/variant of “Pippin,” depending on context.","zh":"“Peppin”通常是姓氏/名字，并非常用英语词汇；在某些语境下也可能是 “Pippin” 的误拼或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common everyday English vocabulary word; you may see it in people’s names or place names.","zh":"（姓氏）Peppin 常见于人名或地名中，不是日常英语词汇。"},"examples":[{"en":"Dr. Peppin will see you now.","zh":"Peppin 医生现在要见你。"},{"en":"I found the email from Ms. Peppin.","zh":"我找到了 Peppin 女士发来的邮件。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling or variant of “Pippin” (a name), depending on context.","zh":"（常见误拼/变体）在不同语境中，可能是 “Pippin”（人名）的误拼或变体。"},"examples":[{"en":"Did you mean Pippin (the character from The Lord of the Rings)?","zh":"你想说的是《指环王》里的角色 Pippin 吗？"},{"en":"I’m not sure if “Peppin” here is a typo for “Pippin.”","zh":"我不确定这里的 “Peppin” 是否是把 “Pippin” 打错了。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈpɛpɪn/","extraExplanation":["“Peppin”本身不是高频英语单词，因此理解时最重要的是看上下文：\n1）如果出现在称呼（Mr./Ms./Dr.）或名单里，通常就是姓氏。\n2）如果你是在小说、电影或游戏里看到的，也可能是作者的取名，或是把 “Pippin” 误写成 “Peppin”。\n\n如果你把出现 “peppin” 的完整句子发我，我可以帮你判断到底是姓名、拼写错误，还是特定作品中的专有名词。"]}
{"word":"peppiness","summary":{"en":"Peppiness means lively, energetic cheerfulness.","zh":"Peppiness 指“充满活力、精神饱满的快活劲儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being lively, energetic, and cheerful.","zh":"活力；朝气；精神饱满（指人或气氛很有精神、很欢快）。"},"examples":[{"en":"Her peppiness in the morning makes the whole team feel more positive.","zh":"她早上的那股朝气让整个团队都更积极。"},{"en":"The song’s peppiness is perfect for a workout playlist.","zh":"这首歌节奏欢快、很有活力，很适合健身歌单。"}]}],"synonyms":["energy","enthusiasm","liveliness","vitality","spark"],"phonetic":"/ˈpɛpinəs/","extraExplanation":["“Peppiness”来自口语词“pep”（劲头、活力）。常用来形容人的精神状态、说话语气、音乐/活动的氛围，语感偏轻松、积极。","相关形容词是“peppy”（精力充沛的、活泼的）。在正式写作中也可用“energy / enthusiasm / liveliness”等更中性或更正式的词来替换。"]}
{"word":"pepping","summary":{"en":"“Pepping” means energizing or encouraging someone, or making something more lively (often used with “up”).","zh":"“pepping”表示给人打气、让人更有精神，或让某事更热闹（常与“up”连用）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “pep”) giving someone energy, confidence, or encouragement; making something more lively.","zh":"（“pep”的现在分词）给某人打气、鼓劲；让事情更有活力、更振奋。"},"examples":[{"en":"She’s pepping the team up before the game.","zh":"比赛前她正在给队伍打气。"},{"en":"Music helps me when I’m pepping myself up for a big presentation.","zh":"在为重要演讲做心理准备、给自己鼓劲时，音乐很有帮助。"},{"en":"The coach walked around, pepping players with short, positive comments.","zh":"教练来回走动，用简短积极的话语给球员打气。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) adding interest or excitement to something; making it less dull.","zh":"（非正式）给某事增添趣味或刺激；让它不那么无聊。"},"examples":[{"en":"They’re pepping up the party with games and dancing.","zh":"他们用游戏和舞蹈让派对更热闹。"},{"en":"Try pepping up the soup with a little lemon and pepper.","zh":"试试加一点柠檬和胡椒，让汤更有味道。"}]}],"synonyms":["energizing","encouraging","cheering up","boosting","livening up"],"phonetic":"/ˈpɛpɪŋ/","extraExplanation":["“pepping”多见于口语或非正式写作，常和“up”连用：pep up（使振作/使更有精神）。\n常见搭配：pep talk（鼓舞士气的讲话）、pep rally（赛前/活动前的加油集会）。"]}
{"word":"peppy","summary":{"en":"Peppy means energetic, cheerful, and full of enthusiasm.","zh":"peppy 指精力充沛、活泼欢快、充满热情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy, enthusiasm, and cheerful spirit.","zh":"精力充沛的；兴致勃勃的；活泼欢快的。"},"examples":[{"en":"She’s always so peppy in the morning, even before coffee.","zh":"她早上总是很有精神，甚至不喝咖啡也一样。"},{"en":"The band played a peppy song that made everyone want to dance.","zh":"乐队演奏了一首节奏欢快的歌，让大家都想跳舞。"}]}],"synonyms":["energetic","lively","cheerful","upbeat","perky"],"phonetic":"/ˈpɛpi/","extraExplanation":["“peppy”常用来形容人的精神状态或气氛（例如音乐、活动）很“有劲儿、很带感”。语气通常偏正面，但如果放在抱怨语境里，也可能带一点反讽（比如别人太亢奋、你很累时）。","词源上与“pep”（精力、劲头）有关；“pep”在口语里也可表示“干劲”，如：need some pep（需要点精神/动力）。"]}
{"word":"peps","summary":{"en":"“Peps” usually means “energy/enthusiasm” (the plural of pep), sometimes “bits of encouragement” in informal speech.","zh":"“peps”通常指“精力/活力、热情”（pep的复数），口语中也可指“一些鼓励、打气的话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “pep”: energy, liveliness, or enthusiastic spirit.","zh":"“pep”的复数：精力、活力；热情、干劲。"},"examples":[{"en":"After a short walk, I got my peps back.","zh":"短暂散步后，我又恢复了精力。"},{"en":"The music gave the crowd extra peps.","zh":"音乐让人群更有劲儿、更兴奋。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) bursts of encouragement or motivation (often used with “a few/some”).","zh":"（非正式）几句打气的话、一些鼓励（常与“a few/some”等搭配）。"},"examples":[{"en":"She gave the team a few peps before the game.","zh":"比赛前她给队伍打了几次气。"},{"en":"I just need some peps to finish this project.","zh":"我就需要一点鼓励/动力把这个项目做完。"}]}],"synonyms":["energy","enthusiasm","spirit","vigor","motivation"],"phonetic":"/pɛps/","extraExplanation":["“peps”本质上是“pep”的复数，但在现代英语里更常直接说“pep”（不可数用法更常见）：例如 “I need some pep.” 也可以说 “I need a pep talk.”","注意别和拼写相近的“peeps”混淆：peeps=（口语）人们、朋友们（people）。而“peps”通常不表示“人”。","有时你会看到大写缩写“PEPs”（不同领域含义不同），那是专有缩写，读法和含义要看具体语境。"]}
{"word":"pepsin","summary":{"en":"Pepsin is a stomach enzyme that digests proteins.","zh":"Pepsin（胃蛋白酶）是一种在胃中帮助分解蛋白质的消化酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme in the stomach that breaks down proteins during digestion.","zh":"胃里的消化酶，主要负责把蛋白质分解成更小的片段，帮助消化。"},"examples":[{"en":"Pepsin helps your body digest protein from foods like meat, eggs, and beans.","zh":"胃蛋白酶（pepsin）帮助身体消化来自肉类、鸡蛋和豆类等食物中的蛋白质。"},{"en":"When the stomach is very acidic, pepsin becomes active and starts breaking proteins down.","zh":"当胃里酸度很高时，胃蛋白酶会被激活并开始分解蛋白质。"}]}],"synonyms":["digestive enzyme","protease"],"phonetic":"/ˈpɛpsɪn/","extraExplanation":["“Pepsin”常译为“胃蛋白酶”。它在胃酸（盐酸）提供的强酸环境中活性更强；离开胃部、进入更不酸的环境后活性会下降。","在医学与健康语境中常与“acid reflux（胃酸反流）/ heartburn（烧心）”一起出现，因为反流时胃酸与酶可能刺激食管。"]}
{"word":"pepsinate","summary":{"en":"Pepsinate means to break down or treat something—especially protein—using the enzyme pepsin, typically in a biological or lab context.","zh":"Pepsinate 指用胃蛋白酶对物质（尤其蛋白质）进行处理或分解，多用于生物/医学或实验语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat, digest, or break down (food or protein) with pepsin (a stomach enzyme).","zh":"用胃蛋白酶（pepsin）处理、消化或分解（食物/蛋白质）。"},"examples":[{"en":"In the stomach, proteins are partially pepsinated before moving into the small intestine.","zh":"在胃里，蛋白质会先被胃蛋白酶部分分解，然后再进入小肠。"},{"en":"The lab protocol uses pepsin to pepsinate the tissue sample.","zh":"这份实验流程用胃蛋白酶来处理（分解）组织样本。"}]},{"partOfSpeech":"vt.","definition":{"en":"(chemistry) to convert a substance into a pepsinate (a compound/salt formed with pepsin).","zh":"（化学）使某物形成“胃蛋白酶化物/胃蛋白酶盐”（pepsinate）。"},"examples":[{"en":"Some formulations aim to pepsinate the compound to improve how it behaves in digestion tests.","zh":"有些配方会尝试让该化合物形成胃蛋白酶化物，以改善其在消化测试中的表现。"}]}],"synonyms":["digest (with pepsin)","break down (protein)","proteolyze (technical)"],"phonetic":"ˈpɛpsəˌneɪt","extraExplanation":["“Pepsinate”较少用于日常英语，更多见于生物学、医学或实验室语境。日常表达常用“digest (with pepsin)”或“break down proteins”。","相关词：pepsin（胃蛋白酶），peptic（与胃/消化有关的），proteolysis（蛋白质分解）。"]}
{"word":"pepsinated","summary":{"en":"Pepsinated means treated with pepsin to partially digest proteins and make something easier to digest.","zh":"Pepsinated 指用胃蛋白酶处理，使蛋白质部分分解、更容易消化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with pepsin (a digestive enzyme) so that proteins are partly broken down; predigested.","zh":"用胃蛋白酶（消化酶）处理，使蛋白质部分分解；预消化的。"},"examples":[{"en":"The patient was given pepsinated milk because it was easier to digest.","zh":"病人被给予胃蛋白酶处理过的牛奶，因为更容易消化。"},{"en":"Some medical foods use pepsinated proteins to reduce digestive workload.","zh":"一些医学食品会使用经胃蛋白酶处理的蛋白质来减轻消化负担。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “pepsinate”: to treat food or a solution with pepsin to aid digestion.","zh":"“pepsinate”的过去式/过去分词：用胃蛋白酶处理食物或溶液，以帮助消化。"},"examples":[{"en":"In the lab, the sample was pepsinated before further testing.","zh":"在实验室里，样品先用胃蛋白酶处理，再进行后续检测。"},{"en":"The formula was pepsinated to make the protein easier to absorb.","zh":"该配方经过胃蛋白酶处理，使蛋白质更易吸收。"}]}],"synonyms":["predigested","enzyme-treated","partly hydrolyzed"],"phonetic":"/ˈpɛpsəˌneɪtɪd/","extraExplanation":["“pepsinated”多见于医学、营养学和实验室语境（例如“pepsinated milk/pepsinated protein”）。日常英语里不常用，更常见的表达是“predigested (protein)”或“enzyme-treated”。","词根来自“pepsin（胃蛋白酶）”，与消化相关；在一些较早的医学/护理文本中，“pepsinated milk”曾被用来指更易消化的牛奶制品。"]}
{"word":"pepsinating","summary":{"en":"“Pepsinating” means digesting or treating something with pepsin to break down proteins, usually in scientific or medical contexts.","zh":"“pepsinating”指用胃蛋白酶分解蛋白质或用其处理样本，多用于医学/科研语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “pepsinate”) digesting protein using pepsin, or treating food/tissue with pepsin to help digestion.","zh":"（“pepsinate”的现在分词）用胃蛋白酶（pepsin）分解蛋白质；或用胃蛋白酶处理食物/组织以帮助消化。"},"examples":[{"en":"In the lab, the technician is pepsinating the sample to break down proteins.","zh":"在实验室里，技术员正在用胃蛋白酶处理样本，以分解蛋白质。"},{"en":"Some digestion studies describe enzymes pepsinating proteins under acidic conditions.","zh":"一些消化研究会描述在酸性条件下酶如何分解（“pepsinate”）蛋白质。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) forming or creating pepsin-like digestive action.","zh":"（较少见）形成或产生类似胃蛋白酶的消化作用。"},"examples":[{"en":"The paper discusses pepsinating activity in the stomach during early digestion.","zh":"这篇论文讨论了胃在消化早期的胃蛋白酶样消化活性。"}]}],"synonyms":["digesting (proteins)","enzymatically digesting","treating with pepsin","proteolyzing (technical)"],"phonetic":"/ˈpɛp.səˌneɪ.tɪŋ/","extraExplanation":["“pepsinating”常见于医学、生物化学和实验室语境，日常英语里几乎不用。更常见的相关表达有：pepsin（胃蛋白酶）、peptic digestion（胃蛋白酶消化）、to digest proteins（消化蛋白质）。","词源上与希腊语“pepsis（消化）”有关；因此它的核心含义一直围绕“消化/分解蛋白质”。"]}
{"word":"pepsine","summary":{"en":"Pepsin is a stomach enzyme that digests proteins; it can also refer to a digestive-aid ingredient.","zh":"Pepsin（胃蛋白酶）是胃里分解蛋白质的消化酶；也可指用于助消化产品的成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme in the stomach that helps digest proteins (it breaks proteins into smaller parts).","zh":"胃中的一种消化酶，帮助分解蛋白质（把蛋白质分解成更小的部分）。"},"examples":[{"en":"Pepsin works best in the acidic environment of the stomach.","zh":"胃蛋白酶在胃的酸性环境中效果最好。"},{"en":"Doctors sometimes mention pepsin when explaining how your body digests protein.","zh":"医生在解释身体如何消化蛋白质时，有时会提到胃蛋白酶。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance sold as a digestive aid, containing pepsin or intended to support digestion.","zh":"作为助消化产品出售的成分或制剂（含有胃蛋白酶或用于帮助消化）。"},"examples":[{"en":"This supplement contains pepsin and hydrochloric acid.","zh":"这种补充剂含有胃蛋白酶和盐酸。"},{"en":"Ask a pharmacist before using pepsin products regularly.","zh":"经常使用胃蛋白酶类产品前，最好先咨询药师。"}]}],"synonyms":["protease","digestive enzyme"],"phonetic":"/ˈpɛpsɪn/","extraExplanation":["“pepsine”常见于法语拼写；英语里更常用的拼写是“pepsin”。","词源与希腊语“pepsis（消化）”有关，所以它和“digest（消化）”的概念紧密相关。"]}
{"word":"pepsines","summary":{"en":"Pepsins = stomach enzymes that digest proteins.","zh":"Pepsins = 胃里的消化酶，用来分解蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pepsins are digestive enzymes in the stomach that break down proteins into smaller parts.","zh":"胃蛋白酶（pepsins）是胃里的消化酶，负责把蛋白质分解成更小的片段。"},"examples":[{"en":"Pepsins help your stomach digest protein from foods like meat, beans, and eggs.","zh":"胃蛋白酶帮助你的胃消化来自肉类、豆类和鸡蛋等食物中的蛋白质。"},{"en":"Without enough stomach acid, pepsins may not work well.","zh":"如果胃酸不足，胃蛋白酶可能无法很好地发挥作用。"}]}],"synonyms":["digestive enzyme","protease"],"phonetic":"/ˈpɛpsɪn/","extraExplanation":["“pepsines”常见于把“pepsins”（pepsin 的复数）拼错，或受法语拼写影响（法语里常见以 -es 结尾）。英语里更标准的写法是 pepsin（单数）/ pepsins（复数）。","词源提示：pepsin 来自希腊语与“消化”有关的词根，因此它在生物/医学语境中多指“与消化相关的酶”。"]}
{"word":"pepsinhydrochloric","summary":{"en":"A medical adjective describing the combined action of pepsin and hydrochloric acid in the stomach.","zh":"医学用形容词，描述胃内“胃蛋白酶+盐酸”的共同作用（帮助消化蛋白质）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to pepsin and hydrochloric acid (HCl), especially the mixture in the stomach that helps digest proteins.","zh":"与胃蛋白酶（pepsin）和盐酸（HCl）有关的，尤指胃内两者共同作用、帮助分解蛋白质的消化体系。"},"examples":[{"en":"Protein digestion in the stomach depends on a pepsin-hydrochloric environment.","zh":"胃里的蛋白质消化依赖于“胃蛋白酶-盐酸”的环境。"},{"en":"The doctor explained that low stomach acid can weaken pepsin-hydrochloric action.","zh":"医生解释说，胃酸偏低会削弱“胃蛋白酶-盐酸”的作用。"}]}],"synonyms":["gastric (acid) and pepsin","peptic and hydrochloric","pepsin-HCl (context-specific)"],"phonetic":"/ˌpɛpsɪn ˌhaɪdrəˈklɔrɪk/","extraExplanation":["“pepsin-hydrochloric”多见于较旧的医学/生理学写法，用来描述胃液中“胃蛋白酶 + 盐酸”的联合消化作用；现代教材更常写作“pepsin and hydrochloric acid”或直接说“gastric acid and pepsin”。","这个词通常需要连字符（pepsin-hydrochloric）来表示复合修饰；不带连字符、也不分开写的“pepsinhydrochloric”在日常英语中很少见，可能来自扫描/排版或专业笔记的合并写法。"]}
{"word":"pepsiniferous","summary":{"en":"Pepsiniferous means producing or containing pepsin, a stomach enzyme that digests protein.","zh":"pepsiniferous 指“产生或含有胃蛋白酶的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or containing pepsin (a digestive enzyme in the stomach).","zh":"产生或含有胃蛋白酶（胃里的消化酶）的。"},"examples":[{"en":"Gastric glands include pepsiniferous cells that help break down proteins.","zh":"胃腺中包含产生胃蛋白酶的细胞，帮助分解蛋白质。"},{"en":"The report described pepsiniferous secretions in the stomach lining.","zh":"报告描述了胃黏膜中的含胃蛋白酶的分泌物。"}]}],"synonyms":["pepsin-producing","pepsin-secreting","peptic"],"phonetic":"/ˌpɛp.səˈnɪf.ɚ.əs/","extraExplanation":["这是较少见、偏医学/生理学的词，常见于解剖学或病理学描述中。日常英语更常说“pepsin-producing (产生胃蛋白酶的)”或直接用“pepsin”。","词形可拆解为 pepsin（胃蛋白酶）+ -ferous（“携带/产生……的”，如 *odoriferous* “有气味的”）。"]}
{"word":"pepsinogen","summary":{"en":"Pepsinogen is the inactive precursor made in the stomach that is converted into pepsin to digest proteins.","zh":"胃蛋白酶原是胃里产生的无活性前体，会转变为胃蛋白酶来分解蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an inactive form (zymogen) of the enzyme pepsin, made in the stomach and changed into pepsin to help digest proteins","zh":"胃里产生的“胃蛋白酶原”（无活性酶原），会被转化为胃蛋白酶，用来帮助分解蛋白质"},"examples":[{"en":"Pepsinogen is secreted by the stomach and becomes active in acidic conditions.","zh":"胃蛋白酶原由胃分泌，并在酸性环境中被激活。"},{"en":"Doctors may measure pepsinogen levels as part of a test for certain stomach problems.","zh":"医生可能会检测胃蛋白酶原水平，作为某些胃部问题的检查之一。"}]}],"synonyms":["propepsin","zymogen (general term)"],"phonetic":"/pɛpˈsaɪnədʒən/","extraExplanation":["“Pepsinogen”由“pepsin（胃蛋白酶）+ -ogen（生成……的前体/原）”组成，表示“将来会变成胃蛋白酶的物质”。","在生理过程中，它在胃酸（盐酸）作用下被切割并转变为有活性的“pepsin（胃蛋白酶）”。这种“先以无活性形式分泌、再被激活”的设计，有助于保护胃自身组织不被过早消化。","临床上常见的有“Pepsinogen I/II（PGI/PGII）”检测，可能用于评估胃黏膜状态或作为胃部疾病筛查的参考指标之一（具体解读需由医生结合其他检查判断）。"]}
{"word":"pepsinogenic","summary":{"en":"Pepsinogenic describes something that produces or is involved in forming pepsin (or pepsinogen) in the stomach.","zh":"Pepsinogenic 指与在胃中产生或形成胃蛋白酶（或胃蛋白酶原）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to producing or forming pepsin (a digestive enzyme) or pepsinogen (the inactive form that becomes pepsin).","zh":"与产生或形成胃蛋白酶（pepsin，消化酶）或胃蛋白酶原（pepsinogen，转化为胃蛋白酶的非活性前体）有关的。"},"examples":[{"en":"The stomach’s pepsinogenic cells help start protein digestion.","zh":"胃里的胃蛋白酶生成细胞有助于开始蛋白质的消化。"},{"en":"Doctors noted changes in pepsinogenic activity in the gastric mucosa.","zh":"医生注意到胃黏膜中的胃蛋白酶生成活动发生了变化。"}]}],"synonyms":["pepsin-producing","pepsin-forming","zymogenic (context-dependent)"],"phonetic":"/ˌpɛpsɪnəˈdʒɛnɪk/","extraExplanation":["这个词多见于生理学或病理学语境，常与“pepsinogen（胃蛋白酶原）”“gastric glands（胃腺）”“chief cells/zymogenic cells（主细胞/酶原细胞）”一起出现。","构词上可拆为：pepsin（胃蛋白酶）+ -o-（连接元音）+ -genic（“产生……的/促成……的”）。因此 pepsinogenic = “产生胃蛋白酶（或其前体）的”。"]}
{"word":"pepsinogenous","summary":{"en":"Pepsinogenous means “producing pepsin/pepsinogen,” usually describing stomach cells or glands.","zh":"Pepsinogenous 指“产生或分泌胃蛋白酶/胃蛋白酶原的”，常用于描述胃部细胞或腺体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of cells or glands) producing or secreting pepsin or pepsinogen, especially in the stomach.","zh":"（指细胞或腺体）产生或分泌胃蛋白酶（pepsin）或胃蛋白酶原（pepsinogen）的，尤指胃内相关组织。"},"examples":[{"en":"Chief cells in the stomach are pepsinogenous cells that release pepsinogen.","zh":"胃内的主细胞是胃蛋白酶原分泌细胞，会释放胃蛋白酶原。"},{"en":"The report describes pepsinogenous glands in the gastric mucosa.","zh":"报告描述了胃黏膜中的分泌胃蛋白酶原的腺体。"}]}],"synonyms":["pepsin-producing","pepsinogen-secreting"],"phonetic":"/pɛpˌsɪnədʒənəs/","extraExplanation":["该词多见于解剖学、生理学与病理学语境，日常英语很少使用。更常见、也更基础的相关词是 pepsin（胃蛋白酶）与 pepsinogen（胃蛋白酶原）。","构词上可拆为 pepsin（胃蛋白酶）+ -gen-（产生）+ -ous（……的），整体意思就是“能产生胃蛋白酶/胃蛋白酶原的”。"]}
{"word":"pepsins","summary":{"en":"Pepsins are stomach enzymes that digest proteins.","zh":"Pepsins 指胃中分解蛋白质的消化酶（胃蛋白酶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Digestive enzymes in the stomach that help break down proteins (plural of pepsin).","zh":"胃中的消化酶，帮助分解蛋白质（pepsin 的复数）。"},"examples":[{"en":"Pepsins help the stomach digest proteins from meat, beans, and eggs.","zh":"胃蛋白酶有助于胃消化来自肉类、豆类和鸡蛋的蛋白质。"},{"en":"In acidic conditions, pepsins become active and start breaking proteins into smaller pieces.","zh":"在酸性环境下，胃蛋白酶会被激活，开始把蛋白质分解成更小的片段。"}]}],"synonyms":["digestive enzymes","proteases"],"phonetic":"/ˈpɛpsɪnz/","extraExplanation":["“Pepsins”通常出现在生物/医学语境中，指一类蛋白酶（而不只是单一的一种）。在人体里，它们主要在胃内由“胃蛋白酶原（pepsinogen）”在胃酸作用下被激活。","日常英语里更常见的是单数“pepsin”或更泛化的说法“digestive enzymes（消化酶）”。"]}
{"word":"pepsis","summary":{"en":"Pepsis means digestion (especially in the stomach); it’s a formal/medical term.","zh":"Pepsis 指“消化（尤指胃内消化）”，属于较正式的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"digestion, especially the breaking down of food in the stomach by digestive juices (such as pepsin).","zh":"消化（尤指食物在胃中被消化液如胃蛋白酶分解的过程）。"},"examples":[{"en":"Pepsis begins when food mixes with acid and enzymes in the stomach.","zh":"当食物在胃里与胃酸和酶混合时，消化（pepsis）就开始了。"},{"en":"In older medical writing, pepsis was used to describe normal stomach digestion.","zh":"在较早的医学文献中，pepsis 常用来描述正常的胃部消化。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the process of “ripening” or maturation in the body, as used in some older medical contexts.","zh":"（较少见）“成熟/酿成”的过程（旧式医学语境中有时用来指体内某种发展到成熟阶段的过程）。"},"examples":[{"en":"Some historical texts contrasted pepsis (maturation) with crisis (a turning point in illness).","zh":"一些历史文本会把 pepsis（成熟过程）与 crisis（病情转折点）作对比。"}]}],"synonyms":["digestion","gastric digestion"],"phonetic":"/ˈpɛpsɪs/","extraExplanation":["词源来自希腊语 pepsis（消化），与 pepsin（胃蛋白酶）、peptic（与消化有关的，如 peptic ulcer“消化性溃疡”）是同一词根。现代英语里 pepsis 主要见于医学/生理学语境，日常表达更常用 digestion。"]}
{"word":"peptic","summary":{"en":"Peptic means “related to digestion,” especially the stomach; in medicine it often appears in “peptic ulcer.”","zh":"Peptic 指“与消化（尤其是胃的消化）有关的”；医学上常见于 peptic ulcer（消化性溃疡）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to digestion, especially involving the stomach’s digestive juices (such as acid and pepsin).","zh":"消化的；与胃的消化作用有关的，尤指与胃酸、胃蛋白酶等消化液相关。"},"examples":[{"en":"A peptic enzyme helps break down proteins in the stomach.","zh":"消化酶（peptic enzyme）帮助在胃里分解蛋白质。"},{"en":"The doctor said my symptoms might be related to peptic irritation from too much acid.","zh":"医生说我的症状可能与胃酸过多引起的胃部消化性刺激有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used in medicine to describe ulcers in the stomach or the upper small intestine (the duodenum).","zh":"（医学）用于描述胃或十二指肠的溃疡，即“消化性溃疡”。"},"examples":[{"en":"He was treated for a peptic ulcer with acid-reducing medicine.","zh":"他因消化性溃疡接受了抑酸药治疗。"},{"en":"Spicy food doesn’t always cause peptic ulcers, but it can make symptoms feel worse.","zh":"辛辣食物不一定会导致消化性溃疡，但可能让症状更明显。"}]}],"synonyms":["digestive","gastric"],"phonetic":"/ˈpɛptɪk/","extraExplanation":["“peptic”来自希腊语词根，意思与“消化”有关；常见搭配是“peptic ulcer（消化性溃疡）”“peptic enzymes（消化酶）”。","日常英语里更常说“digestive（消化的）”，而“peptic”更偏医学或生理学语境。"]}
{"word":"peptical","summary":{"en":"“Peptical” is likely a misspelling. The correct word is “skeptical,” meaning doubtful and not easily convinced.","zh":"“peptical”很可能是拼写错误；正确词是“skeptical”，意思是“怀疑的、不轻信的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not easily convinced; having doubts and wanting proof before believing something.","zh":"怀疑的；不轻易相信的；倾向于先要证据再接受某事。"},"examples":[{"en":"I’m skeptical about the new diet because there isn’t much scientific evidence.","zh":"我对这种新饮食法持怀疑态度，因为科学证据不多。"},{"en":"She gave him a skeptical look and asked for more details.","zh":"她用怀疑的眼神看着他，并要求更多细节。"},{"en":"Many people are skeptical that the plan will work in such a short time.","zh":"很多人怀疑这个计划能在这么短的时间内奏效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Questioning whether something is true or valuable; critical rather than accepting ideas quickly.","zh":"持批判态度的；对某事的真实性或价值提出质疑的。"},"examples":[{"en":"He’s skeptical of online rumors and checks reliable sources first.","zh":"他对网络谣言持质疑态度，会先查可靠来源。"},{"en":"The professor encouraged a skeptical approach to studying history.","zh":"教授鼓励用批判（怀疑）的方法来学习历史。"}]}],"synonyms":["doubtful","questioning","unconvinced","cynical","critical"],"phonetic":"/ˈskɛptɪkəl/","extraExplanation":["你输入的“peptical”不是常见英文单词，通常是把 **skeptical** 拼错了。","英式拼法常见为 **sceptical**，美式更常用 **skeptical**；两者意思相同，发音也一样。"]}
{"word":"pepticity","summary":{"en":"Pepticity is a rare term meaning the degree of digestive (peptic) action, especially related to the stomach or pepsin.","zh":"Pepticity 指“胃消化性/消化作用的程度”，是较少见的术语，常与胃或胃蛋白酶相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) The quality or degree of being peptic—having digestive action, especially relating to the stomach or to pepsin.","zh":"（罕见、偏专业）胃消化性；消化作用的性质或程度，尤指与胃或胃蛋白酶（pepsin）相关的消化能力。"},"examples":[{"en":"Researchers compared the pepticity of different enzymes under acidic conditions.","zh":"研究人员在酸性条件下比较了不同酶的胃消化性。"},{"en":"The report discussed low pepticity as a possible factor in poor protein digestion.","zh":"报告讨论了胃消化性偏低可能是蛋白质消化不良的因素之一。"}]}],"synonyms":["digestive power","digestive activity","peptic activity"],"phonetic":"/pɛpˈtɪsɪti/","extraExplanation":["“pepticity”在现代英语中非常少见，更多时候会用更常见、更直接的表达：如“digestive power / digestive activity（消化能力/消化活性）”、“peptic activity（胃蛋白酶活性）”。","词根提示：peptic 来自希腊语词根，和“消化”相关；临床或科研语境里常见的是 peptic（胃的/消化的）、pepsin（胃蛋白酶）、peptic ulcer（消化性溃疡/胃溃疡）。"]}
{"word":"peptics","summary":{"en":"“Peptics” most often refers (less commonly today) to people with peptic ulcers/indigestion; it can also mean digestive remedies. The base word “peptic” means related to digestion or the stomach.","zh":"“peptics”多指（如今较少用）消化性溃疡/消化不良患者；也可指助消化或抗酸类药物。“peptic”本义为“与消化/胃有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun, less common) People who have peptic ulcers or chronic indigestion (somewhat dated/informal).","zh":"（复数名词，不太常见）患有消化性溃疡或长期消化不良的人（偏旧式/口语）。"},"examples":[{"en":"The doctor warned that peptics should avoid frequent painkillers like ibuprofen.","zh":"医生警告说，溃疡患者应避免频繁服用布洛芬这类止痛药。"},{"en":"Spicy food can be difficult for peptics to tolerate.","zh":"辛辣食物可能让溃疡患者更难承受。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun, rare) Medicines or products meant to aid digestion (for example, antacids or digestive remedies).","zh":"（复数名词，较少见）用于帮助消化的药物或产品（例如抗酸药或助消化制剂）。"},"examples":[{"en":"He kept peptics in his bag in case heartburn returned.","zh":"他包里备着助消化/抗酸药，以防胃灼热又犯。"},{"en":"Some people overuse peptics instead of changing their diet.","zh":"有些人不调整饮食，却过度依赖助消化/抗酸类药物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(As an adjective in the base form “peptic”) Related to digestion, the stomach, or pepsin (a digestive enzyme).","zh":"（以形容词原形“peptic”出现）与消化、胃或胃蛋白酶（pepsin，一种消化酶）有关的。"},"examples":[{"en":"She was diagnosed with a peptic ulcer.","zh":"她被诊断为消化性溃疡。"},{"en":"Peptic activity increases when the stomach produces more acid and enzymes.","zh":"当胃分泌更多胃酸和酶时，消化（胃蛋白酶）活性会增强。"}]}],"synonyms":["ulcer patients","people with peptic ulcers","digestive remedies","antacids"],"phonetic":"ˈpɛptɪks","extraExplanation":["“peptic”来自希腊语词根，和“消化”有关（同源词如 pepsin 胃蛋白酶）。日常英语里更常见的是形容词搭配：peptic ulcer（消化性溃疡）、peptic digestion（胃内消化）。","“peptics”作为“溃疡患者/胃病患者”的复数说法比较少见，现代医学语境通常直接说 people with peptic ulcers / ulcer patients。"]}
{"word":"peptid","summary":{"en":"Peptide = a short chain of amino acids; commonly discussed in biology/medicine and in skincare or supplement products.","zh":"Peptide（肽）= 由少量氨基酸组成的短链；常见于生物/医学语境，也常见于护肤品与补剂产品介绍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short chain of amino acids (the building blocks of proteins); peptides occur naturally in the body and are also used in medicine, skincare, and supplements","zh":"（生物化学）肽：由少量氨基酸连接成的短链，是蛋白质的基本组成单位之一；也常用于药物、护肤品与保健品等语境"},"examples":[{"en":"Insulin is a peptide hormone that helps control blood sugar.","zh":"胰岛素是一种肽类激素，能帮助调节血糖。"},{"en":"Some skincare products claim peptides can support firmer-looking skin.","zh":"一些护肤品宣称肽可以让皮肤看起来更紧致。"},{"en":"Researchers studied how a small peptide binds to the receptor.","zh":"研究人员研究了一种小肽如何与受体结合。"}]},{"partOfSpeech":"n.","definition":{"en":"(in everyday product language) a peptide-based ingredient or formula, especially in skincare or supplements","zh":"（日常产品用语）肽类成分/配方（尤指护肤或补剂中的肽）"},"examples":[{"en":"This serum contains peptides and hyaluronic acid.","zh":"这款精华含有肽和透明质酸。"},{"en":"He switched to a peptide supplement after training.","zh":"训练后他改用一种肽类补剂。"}]}],"synonyms":["polypeptide (longer chain)","amino acid chain (general)","protein fragment"],"phonetic":"/ˈpɛpˌtaɪd/","extraExplanation":["你输入的“peptid”更常见的标准拼写是 **peptide**（末尾通常加 -e）。在科学写作中，复数是 **peptides**。","词源提示：peptide 与希腊语中“消化/分解”相关的词根有关，后来用于命名由氨基酸“连接（肽键）”形成的短链结构。"]}
{"word":"peptidase","summary":{"en":"A peptidase is an enzyme that cuts peptide bonds to break peptides (and protein fragments) into smaller pieces or amino acids.","zh":"peptidase（肽酶）是一种切断肽键、把肽（或蛋白质片段）分解成更小片段或氨基酸的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks peptides (short chains of amino acids) into smaller peptides or individual amino acids by cutting peptide bonds.","zh":"一种能切断肽键、把肽（氨基酸短链）分解成更小的肽或单个氨基酸的酶。"},"examples":[{"en":"In digestion, peptidases help break down proteins into amino acids your body can absorb.","zh":"在消化过程中，肽酶帮助把蛋白质分解成身体可以吸收的氨基酸。"},{"en":"The lab measured peptidase activity to see how quickly the peptide was being broken apart.","zh":"实验室测量了肽酶活性，以了解该肽被分解的速度。"}]}],"synonyms":["peptide hydrolase","protease"],"phonetic":"/ˈpɛp.tɪ.deɪs/","extraExplanation":["词源小提示：peptide（肽）+ -ase（常见于酶名的后缀）。因此 peptidase 直观上就是“分解肽的酶”。","相关概念：peptidase 常与 protease（蛋白酶）一起出现。protease 更广泛，能分解蛋白质；peptidase 更强调对“肽”进行切割。很多教材里两者有时会有重叠使用。","常见分类（了解即可）：按切割位置可分为 endopeptidase（从链中间切）与 exopeptidase（从末端切）。"]}
{"word":"peptide","summary":{"en":"A peptide is a short chain of amino acids; it can also describe something related to peptides.","zh":"peptide 指“氨基酸短链（肽）”，也可作形容词表示“与肽有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short chain of amino acids linked together; peptides are smaller than proteins and are common in biology and medicine.","zh":"由氨基酸连接而成的短链；肽比蛋白质更小，常见于生物学与医学中。"},"examples":[{"en":"This supplement contains collagen peptides.","zh":"这款补充剂含有胶原蛋白肽。"},{"en":"Some hormones, like insulin, are peptide-based.","zh":"有些激素（如胰岛素）是肽类物质。"},{"en":"Scientists studied the peptide to see how it affects cells.","zh":"科学家研究这种肽，看看它如何影响细胞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or made from peptides (used mainly in scientific writing).","zh":"与肽有关的；由肽构成的（多用于科学语境）。"},"examples":[{"en":"They tested a peptide drug for safety.","zh":"他们测试一种肽类药物的安全性。"},{"en":"The report describes peptide activity in the body.","zh":"报告描述了肽在体内的活性。"}]}],"synonyms":["amino-acid chain","polypeptide (longer chain)"],"phonetic":"/ˈpɛp.taɪd/","extraExplanation":["“peptide”常见于营养品、护肤品与医学文献中：如“collagen peptides（胶原蛋白肽）”“peptide drug（肽类药物）”。在护肤语境里，“peptides”常被宣传为帮助修护或抗老的成分，但实际效果会受配方、浓度与皮肤状况影响。"]}
{"word":"peptides","summary":{"en":"Peptides are short chains of amino acids, smaller than proteins, important in biological signaling and widely discussed in medicine and skincare.","zh":"肽是由氨基酸组成的短链，比蛋白质更小，在生物信号传递中很重要，也常出现在医学与护肤领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Short chains of amino acids linked together; smaller than proteins and often used in biology, medicine, and skincare.","zh":"由氨基酸连接形成的短链；比蛋白质更小，常用于生物学、医学与护肤领域。"},"examples":[{"en":"Peptides help the body send signals, like telling cells to grow or repair.","zh":"肽可以帮助身体传递信号，比如告诉细胞生长或修复。"},{"en":"Some skincare products use peptides to support the look of firmer skin.","zh":"一些护肤品会添加肽，来帮助皮肤看起来更紧致。"},{"en":"Scientists study peptides to develop new drugs and treatments.","zh":"科学家研究肽，用来开发新药和治疗方法。"}]}],"synonyms":["amino-acid chain","polypeptide"],"phonetic":"/ˈpɛpˌtaɪdz/","extraExplanation":["“peptide”来自希腊语词根，和“消化/分解”相关：肽常被看作是蛋白质分解后的较小片段。","在健康/护肤广告里常见的“peptides”通常指不同类型的信号肽、铜肽等；它们作用与证据强弱会因成分与浓度而不同。","发音要点：重音在第一音节 PEP-（/ˈpɛp-/），结尾 -tides 发 /taɪdz/。"]}
{"word":"peptidic","summary":{"en":"“Peptidic” means related to peptides or made of peptides, often used in scientific contexts.","zh":"“peptidic”指“与肽有关的/由肽构成的”，常用于科学与医药语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, made of, or containing peptides (short chains of amino acids), especially in biology and chemistry.","zh":"与肽有关的；由肽构成的；含有肽的（肽是由氨基酸组成的短链），常用于生物与化学语境。"},"examples":[{"en":"Researchers tested a peptidic drug designed to block a viral enzyme.","zh":"研究人员测试了一种肽类药物，用来阻断病毒酶。"},{"en":"The peptidic sequence binds strongly to the target receptor.","zh":"这段肽序列会与目标受体强烈结合。"},{"en":"Some skincare products claim peptidic ingredients can support skin repair.","zh":"一些护肤品宣称肽类成分可以帮助皮肤修复。"}]}],"synonyms":["peptide-based","peptide-related","peptidyl"],"phonetic":"/pɛpˈtɪdɪk/","extraExplanation":["“peptidic”多见于科研论文与药物研发语境，用来描述“像肽一样的结构/性质”或“以肽为基础的”。日常英语里更常说“peptide-based（以肽为基础的）”或直接用“peptide（肽）”。","相关词：peptide（肽，名词），peptidase（肽酶），peptidic bond/peptide bond（肽键）。"]}
{"word":"peptidically","summary":{"en":"Peptidically means “in a peptide-related way,” often used in scientific writing.","zh":"peptidically 表示“以与肽/肽键相关的方式”，多用于科研语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to peptides (short chains of amino acids) or peptide bonds.","zh":"以与肽（由氨基酸组成的短链）或肽键相关的方式；从“肽”的角度来说。"},"examples":[{"en":"This hormone is peptidically structured, so it is broken down quickly in the body.","zh":"这种激素在结构上属于肽类，因此在体内会较快被分解。"},{"en":"The two molecules are linked peptidically, forming a stable chain.","zh":"这两个分子以肽键方式连接，形成稳定的链。"}]}],"synonyms":["in a peptide-based way","via peptide bonds","as a peptide"],"phonetic":"/pɛpˈtɪdɪkli/","extraExplanation":["“peptidically”是比较少见、偏科研写作的副词，多出现在生物化学/药学/分子生物学语境中。日常英语更常用表达是“in a peptide-based way / via peptide bonds / as a peptide”。","构词法：peptide（肽）+ -ic（……的）→ peptidic（肽的）+ -ally（副词）→ peptidically（以……的方式）。有时你也会看到“peptidic/peptidyl”在文献中更常用。"]}
{"word":"peptidoglycan","summary":{"en":"Peptidoglycan is the tough, net-like substance that forms bacterial cell walls.","zh":"肽聚糖是构成细菌细胞壁的坚韧网状物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, mesh-like material that makes up most of the bacterial cell wall, helping the cell keep its shape and avoid bursting.","zh":"一种坚固的网状材料，构成细菌细胞壁的主要部分，帮助细菌保持形状并防止因渗透压而胀裂。"},"examples":[{"en":"Penicillin kills many bacteria by stopping the formation of peptidoglycan in the cell wall.","zh":"青霉素通过阻止细胞壁中肽聚糖的形成来杀死许多细菌。"},{"en":"Gram-positive bacteria usually have a thick layer of peptidoglycan.","zh":"革兰氏阳性菌通常具有较厚的肽聚糖层。"},{"en":"Without peptidoglycan, many bacteria cannot survive in low-salt environments.","zh":"没有肽聚糖，许多细菌在低盐环境中难以存活。"}]}],"synonyms":["murein"],"phonetic":"/ˌpɛp.tə.doʊˈɡlaɪ.kən/","extraExplanation":["肽聚糖（peptidoglycan）也常被称为“murein（黏肽）”。它由“糖链（NAG 与 NAM交替）+ 短肽交联”组成，像网格一样包在细菌外面，提供机械强度。","它是区分革兰氏阳性菌/阴性菌的重要结构基础：阳性菌肽聚糖层厚；阴性菌肽聚糖较薄，并位于外膜与内膜之间的周质空间。","很多抗生素的靶点与它有关：β-内酰胺类（如青霉素）阻断交联；溶菌酶（如泪液中的酶）可切断糖链。人类细胞没有肽聚糖，因此这些药物通常对细菌更有选择性。"]}
{"word":"peptidolytic","summary":{"en":"Peptidolytic means “able to enzymatically break down peptides.”","zh":"peptidolytic 指“能够通过酶促作用分解肽（peptides）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to break down peptides (short chains of amino acids) by enzymatic digestion; peptide-breaking.","zh":"（通过酶促消化）能够分解肽（由氨基酸组成的短链）的；肽水解的。"},"examples":[{"en":"Peptidolytic enzymes help break dietary proteins into smaller peptides and amino acids.","zh":"肽水解酶有助于把食物中的蛋白质分解成更小的肽和氨基酸。"},{"en":"The researchers measured peptidolytic activity to see how quickly the sample could digest peptides.","zh":"研究人员测量肽水解活性，以判断样品分解肽的速度。"}]}],"synonyms":["peptide-hydrolyzing","peptide-degrading","proteolytic (broader)"],"phonetic":"/ˌpɛp.tɪ.doʊˈlɪtɪk/","extraExplanation":["这个词多见于生物化学、微生物学与医学论文，用来描述“分解肽”的能力或作用（如 peptidolytic enzymes 肽水解酶；peptidolytic activity 肽水解活性）。","词形上可拆为 peptido-（肽）+ -lytic（溶解/分解的），和 proteolytic（蛋白水解的）相关，但 peptidolytic 更强调“肽（peptide）”这一层级，而不一定指整条蛋白质。"]}
{"word":"peptids","summary":{"en":"A peptide is a short chain of amino acids, smaller than a protein.","zh":"peptide 指由氨基酸组成的短链（肽），通常比蛋白质更小。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short chain of amino acids (smaller than a protein) that is linked together by peptide bonds; peptides are common in the body and in foods and can affect functions like signaling, muscle repair, or skin structure","zh":"肽；由氨基酸组成的短链（比蛋白质小），通过“肽键”连接；存在于人体与食物中，可参与信号传递、肌肉修复或皮肤结构等功能"},"examples":[{"en":"Peptides are the building blocks that can combine to form proteins.","zh":"肽是可以组合形成蛋白质的基本组成单位之一。"},{"en":"After exercise, your body uses amino acids and peptides to help repair muscle tissue.","zh":"运动后，身体会利用氨基酸和肽来帮助修复肌肉组织。"},{"en":"Some skincare products claim that peptides help support firmer-looking skin.","zh":"一些护肤品宣称肽有助于让皮肤看起来更紧致。"}]}],"synonyms":["amino-acid chain","polypeptide (often longer)"],"phonetic":"/ˈpɛpˌtaɪd/","extraExplanation":["你输入的“peptids”很可能是“peptides（peptide 的复数）”的拼写误差；单数是 peptide，复数是 peptides。","科普区分：一般来说，蛋白质（protein）更长更复杂；肽（peptide）更短。很多教材会把“几十个氨基酸以内”的链称为肽（不同领域界限略有差异）。","常见搭配：peptide bond（肽键）、collagen peptides（胶原蛋白肽）、signal peptides（信号肽）。护肤语境里“peptides”常作为宣传点，但具体效果取决于配方、浓度、稳定性与皮肤吸收等因素。"]}
{"word":"peptizable","summary":{"en":"“Peptizable” means capable of being peptized—able to be turned into a stable colloidal dispersion.","zh":"“peptizable”指“可被胶溶的”，即能被处理成稳定的胶体分散体系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be peptized (changed from a coagulated or precipitated state into a stable colloidal dispersion).","zh":"可被胶溶的；可被“胶溶”（从凝聚/沉淀状态转变为稳定胶体分散体系）的。"},"examples":[{"en":"The precipitate is peptizable in the presence of a small amount of electrolyte.","zh":"在少量电解质存在时，该沉淀是可被胶溶的。"},{"en":"They added a stabilizer to make the solid more peptizable and easier to disperse.","zh":"他们加入稳定剂使固体更易胶溶、也更容易分散。"}]}],"synonyms":["peptisable","dispersible (in context)"],"phonetic":"/ˈpɛp.təˌzaɪ.zə.bəl/","extraExplanation":["“peptizable”主要见于胶体化学/材料科学语境，来自动词 peptize（胶溶）。胶溶指把已凝聚或沉淀的颗粒重新分散成稳定的胶体溶液（sol），常通过加入少量电解质、分散剂或改变pH来实现。","英式拼写常见为 peptisable。日常英语中非常少用，多出现在论文、实验记录或技术说明里。"]}
{"word":"peptization","summary":{"en":"Peptization is the chemical process of converting a precipitate into a stable colloid by adding a peptizing agent (often an electrolyte).","zh":"Peptization（胶溶）指加入胶溶剂（常为电解质）把沉淀转变为稳定胶体分散体系的化学过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process of turning a precipitate (solid particles that have formed and settled out of a solution) into a stable colloidal dispersion by adding a small amount of an electrolyte or another “peptizing” agent.","zh":"（化学）胶溶；指通过加入少量电解质或其他“胶溶剂/胶溶化剂”，使沉淀（从溶液中析出的固体颗粒）分散成稳定的胶体分散体系的过程。"},"examples":[{"en":"A little electrolyte can cause peptization and help disperse the precipitate into a colloid.","zh":"少量电解质可能引起胶溶，使沉淀分散成胶体。"},{"en":"In this experiment, the gel was prepared by peptization of freshly formed metal hydroxide.","zh":"在这个实验中，该凝胶是通过对新生成的金属氢氧化物进行胶溶制备的。"}]}],"synonyms":["peptisation (BrE spelling)","colloid formation","dispersion (in context)"],"phonetic":"/ˌpɛp.təˈzeɪ.ʃən/","extraExplanation":["“Peptization”常见于无机化学与胶体化学。核心是：原本会聚集、沉降的固体微粒，在合适的离子/分散剂作用下获得表面电荷或溶剂化层，从而彼此排斥并保持分散。","常见搭配：peptization of a precipitate（对沉淀进行胶溶）；peptizing agent（胶溶剂/胶溶化剂）；colloidal dispersion（胶体分散体系）。"]}
{"word":"peptize","summary":{"en":"Peptize means to make a precipitate or clumped material disperse into a stable colloid, usually by adding a peptizing agent.","zh":"peptize 指通过加入胶溶剂等方式，使沉淀或结块物质重新分散成稳定的胶体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To convert a precipitate or coagulated substance into a stable colloidal dispersion, usually by adding a small amount of electrolyte or another agent (a peptizing agent).","zh":"（化学）使沉淀物或凝聚物重新分散成稳定的胶体分散体系，通常通过加入少量电解质或其他“胶溶剂/胶溶化剂”来实现。"},"examples":[{"en":"Adding a little electrolyte can peptize the freshly formed precipitate into a colloidal sol.","zh":"加入少量电解质可以把刚生成的沉淀胶溶成胶体溶液。"},{"en":"The technician peptized the gel so it would disperse evenly in the mixture.","zh":"技术员对凝胶进行胶溶处理，使其能在混合物中均匀分散。"}]},{"partOfSpeech":"vt.","definition":{"en":"To break a clumped or gelled material into fine particles so it disperses more easily (often used in technical or industrial contexts).","zh":"（技术/工业用语）使结块或胶化的物质分解成更细的颗粒，从而更容易分散。"},"examples":[{"en":"Proper mixing helps peptize the powder and prevent lumps.","zh":"适当搅拌有助于使粉末胶溶/细化分散，防止结块。"}]}],"synonyms":["disperse","deflocculate","deagglomerate","redisperse"],"phonetic":"/ˈpɛp.taɪz/","extraExplanation":["“peptize”源自“peptization（胶溶作用）”。在胶体化学里，它常与“coagulate（凝聚/絮凝）”相对：凝聚是让胶体聚集沉淀，胶溶则是让沉淀重新分散成胶体。","常见搭配：peptize a precipitate（使沉淀胶溶）；peptizing agent（胶溶剂/胶溶化剂）。在不同体系中，酸、碱或某些盐类都可能充当胶溶剂。"]}
{"word":"peptized","summary":{"en":"“Peptized” means made into a stable colloid (particles kept dispersed), especially in chemistry.","zh":"“Peptized”指（化学中）使颗粒胶溶并稳定分散成胶体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) turned into or kept as a stable colloid by adding a small amount of a substance (a peptizing agent) that helps particles stay dispersed.","zh":"（化学）通过加入少量物质（促胶剂/胶溶剂）使颗粒分散并稳定存在于胶体中；使其发生胶溶。"},"examples":[{"en":"The solid precipitate was peptized by adding a little electrolyte, forming a stable colloidal solution.","zh":"通过加入少量电解质，使固体沉淀发生胶溶，形成稳定的胶体溶液。"},{"en":"Under certain conditions, the particles became peptized and did not settle at the bottom.","zh":"在某些条件下，颗粒被胶溶后不会沉到底部。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “peptize” (to make or keep particles dispersed in a colloid).","zh":"“peptize”的过去式/过去分词：使颗粒在胶体中分散或保持分散（使胶溶）。"},"examples":[{"en":"The technician peptized the gel by introducing a small amount of surfactant.","zh":"技术员通过加入少量表面活性剂使凝胶发生胶溶。"}]}],"synonyms":["dispersed (in a colloid)","colloidally dispersed","deflocculated"],"phonetic":"/ˈpɛp.taɪzd/","extraExplanation":["“peptized”多见于实验室/材料科学语境，日常英语很少用。它与“coagulated（凝聚）/flocculated（絮凝）”常形成对比：peptized 强调“重新分散、稳定为胶体”，而 coagulated/flocculated 强调“聚集成团、沉降”。","相关词：peptize（动词原形），peptization（名词：胶溶过程），peptizing agent（促胶剂/胶溶剂），colloid（胶体），precipitate（沉淀）。"]}
{"word":"peptizer","summary":{"en":"A peptizer is an additive that helps particles disperse into a stable colloid (and, in rubber processing, can also mean an additive that softens rubber to aid mixing).","zh":"peptizer 指肽化剂/分散剂：帮助颗粒形成稳定胶体分散；在橡胶加工中也可指塑解剂，用于软化橡胶便于混炼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a surfactant or chemical additive) that helps a solid or coagulated material break up and form a stable colloidal dispersion; a dispersing agent used to “peptize” particles.","zh":"肽化剂；使固体或凝聚物分散成稳定胶体分散体系的物质（常为表面活性剂或化学添加剂），用于“肽化/胶溶”颗粒。"},"examples":[{"en":"In the lab, a small amount of peptizer was added to keep the pigment evenly dispersed.","zh":"在实验室里加入少量肽化剂，使颜料保持均匀分散。"},{"en":"Without a peptizer, the particles clumped together and settled at the bottom.","zh":"没有肽化剂时，颗粒会结团并沉到底部。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in rubber processing) an additive that helps soften rubber by breaking down long molecular chains, making mixing and processing easier.","zh":"（尤指橡胶加工）塑解剂；通过促使分子链降解来软化橡胶、便于混炼与加工的添加剂。"},"examples":[{"en":"The factory used a peptizer to reduce mixing time during rubber compounding.","zh":"工厂在橡胶配方混炼时使用塑解剂来缩短混炼时间。"},{"en":"Choosing the right peptizer can improve processing without harming the final strength too much.","zh":"选择合适的塑解剂可以改善加工性，同时尽量不降低成品强度。"}]}],"synonyms":["dispersant","dispersing agent","deflocculant","plasticizer (context-dependent)"],"phonetic":"/ˈpɛpˌtaɪzər/","extraExplanation":["“peptize/peptization（肽化/胶溶）”常见于胶体化学：原本聚集或沉淀的微粒在电荷、溶剂或表面活性剂等作用下重新分散，形成较稳定的胶体体系。对应的作用物就是 peptizer。","在工业语境里（如橡胶），peptizer 往往更接近“塑解剂/软化加工助剂”的概念；具体含义要看材料与工艺说明。"]}
{"word":"peptizers","summary":{"en":"Peptizers are agents that help solids or precipitates disperse into stable colloids.","zh":"Peptizers 指促使固体/沉淀分散并形成稳定胶体的促胶化（促分散）物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (or agent) that causes peptization—helping a precipitate or solid disperse into very fine particles to form a stable colloid.","zh":"促胶化剂；促分散剂：能引起“胶溶/胶化（peptization）”的物质，使沉淀或固体分散成极细颗粒并形成稳定胶体。"},"examples":[{"en":"In the lab, small amounts of electrolyte can act as peptizers to disperse a freshly formed precipitate.","zh":"在实验室里，少量电解质可以作为促胶化剂，使新生成的沉淀分散开来。"},{"en":"Certain surfactants are used as peptizers to keep pigment particles evenly suspended in a liquid.","zh":"某些表面活性剂可作促分散剂，使颜料颗粒在液体中均匀悬浮。"}]}],"synonyms":["dispersants","deflocculants","stabilizers (in some contexts)"],"phonetic":"/ˈpɛp.taɪ.zɚz/","extraExplanation":["“Peptizers”是“peptizer”的复数。它常见于胶体化学、材料、涂料与制药等语境，关注点是让颗粒不再结块（flocculate/agglomerate），而是稳定地分散在介质中。","常见的peptizer类型包括：某些电解质（改变颗粒表面电荷、提高排斥力）、表面活性剂/分散剂（在颗粒表面形成保护层），具体选择取决于颗粒材料与溶液条件（如pH、离子强度）。"]}
{"word":"peptizes","summary":{"en":"“Peptizes” means “causes a precipitate or solid to disperse into a stable colloid,” mainly in chemistry.","zh":"“peptizes”主要用于化学，指“使沉淀/固体分散形成稳定胶体（发生胶溶）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) to make a precipitate break into very small particles and form a stable colloid (a process called peptization).","zh":"（化学）使沉淀分散成极细小的粒子并形成稳定的胶体（称为“胶溶/胶化”过程）。"},"examples":[{"en":"A small amount of electrolyte peptizes the precipitate and turns it into a colloidal sol.","zh":"少量电解质会使沉淀胶溶，并把它变成胶体溶液。"},{"en":"In the experiment, the added ions peptize the solid so the mixture looks cloudy but uniform.","zh":"在实验中，加入的离子使固体胶溶，因此混合物看起来浑浊但很均匀。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to become dispersed into a colloid; to undergo peptization.","zh":"（较少见）自身分散成胶体；发生胶溶。"},"examples":[{"en":"Under the right conditions, the gel peptizes and flows more easily.","zh":"在合适条件下，这种凝胶会发生胶溶，流动性更强。"}]}],"synonyms":["disperses (into a colloid)","colloidizes","deflocculates"],"phonetic":"ˈpɛpˌtaɪz","extraExplanation":["“peptizes”是动词“peptize”的第三人称单数（he/she/it peptizes）。常见于分析化学与胶体化学语境。","“peptization（胶溶）”通常指：通过加入少量电解质、改变pH、或引入特定离子，使原本聚集/沉淀的颗粒重新分散，形成稳定的胶体溶胶（sol）。"]}
{"word":"peptizing","summary":{"en":"Peptizing means making solid particles disperse into a stable colloid (most common in chemistry); less commonly, it can mean breaking proteins down into peptones.","zh":"Peptizing 通常指（化学中）通过加入胶溶剂使固体颗粒重新分散成稳定胶体；较少见时也可指把蛋白质分解成胨等产物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) converting a precipitate or solid particles into a stable colloidal dispersion, usually by adding a small amount of an electrolyte or surfactant (a “peptizing agent”).","zh":"（化学）使沉淀或固体微粒转变为稳定的胶体分散体系，通常通过加入少量电解质或表面活性剂（称为“胶溶剂/胶溶剂”）来实现。"},"examples":[{"en":"The technician is peptizing the hydroxide precipitate to form a uniform sol.","zh":"技术员正在对氢氧化物沉淀进行胶溶处理，使其形成均匀的溶胶。"},{"en":"By peptizing the particles, the mixture stays dispersed instead of settling.","zh":"通过胶溶这些颗粒，混合物能保持分散而不易沉降。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) breaking proteins down into peptones or peptide-like products during digestion or processing.","zh":"（较少见）在消化或加工过程中把蛋白质分解为胨（peptones）或类似肽的产物。"},"examples":[{"en":"In older texts, enzymes are described as peptizing protein material.","zh":"在较早的文献中，酶被描述为“peptizing（胨化）”蛋白质物质。"}]}],"synonyms":["dispersing (in colloids)","deflocculating","colloidizing"],"phonetic":"ˈpɛpˌtaɪzɪŋ","extraExplanation":["“peptizing”来自动词 peptize（也写作 peptise）。它在现代英语里主要是胶体化学术语，常见于实验室记录、材料科学与制药工艺中。","胶溶（peptization）的核心是：通过改变颗粒表面电荷或吸附层，使原本会聚集/沉降的颗粒重新分散，形成较稳定的溶胶（sol）。","相关常见搭配：peptizing agent（胶溶剂/胶溶剂）、to peptize a precipitate（使沉淀胶溶）、colloidal sol（胶体溶胶）、dispersion（分散体系）。"]}
{"word":"peptogaster","summary":{"en":"Peptogaster is a rare zoology/anatomy term meaning the part of a stomach mainly responsible for chemical digestion.","zh":"Peptogaster 是较少见的动物学／解剖学术语，指胃中主要进行化学消化的部位（消化胃／腺胃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, anatomy) The digestive (glandular) part of the stomach where chemical digestion happens; a “digestive stomach.”","zh":"（动物学／解剖）胃中负责化学消化的“消化部／腺胃”，即进行消化液分泌与消化作用的胃部区域。"},"examples":[{"en":"In some animals, the stomach can be described as having a grinding part and a peptogaster for digestion.","zh":"在某些动物中，胃可被描述为包含研磨部，以及负责消化的 peptogaster（消化胃）。"},{"en":"The term peptogaster is mostly used in older zoology texts.","zh":"peptogaster 这个术语多见于较早期的动物学文献。"}]}],"synonyms":["digestive stomach","glandular stomach"],"phonetic":"ˌpɛptoʊˈɡæstɚ","extraExplanation":["该词由 pepto-（与“消化”有关）+ -gaster（“胃”）构成，属于较少见的学术用语；现代教材更常用更具体的结构名称（如“腺胃/前胃/砂囊”等，取决于动物类群与语境）。","不同动物的胃分区方式不完全一致，因此阅读文献时要结合作者所描述的物种与对照的另一部分结构（如“研磨胃/咀嚼胃”等）来理解。"]}
{"word":"peptogen","summary":{"en":"Peptogen is an uncommon, older term for a digestive preparation thought to promote pepsin/peptone formation and help digestion.","zh":"Peptogen 是较少见的旧式词，指被认为能促进胃蛋白酶/蛋白胨形成、从而帮助消化的消化制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a digestive preparation) believed to help the stomach produce pepsin or form peptones, so it may aid digestion","zh":"（多指消化制剂）被认为能促进胃中胃蛋白酶生成或蛋白质分解成蛋白胨，从而帮助消化的物质"},"examples":[{"en":"The label describes Peptogen as a digestive aid taken after meals.","zh":"标签将 Peptogen 描述为饭后服用的助消化产品。"},{"en":"In older medical writing, peptogens were discussed as remedies for weak digestion.","zh":"在较早的医学文献中，peptogen 常被当作“消化不良”的辅助疗法来讨论。"}]}],"synonyms":["digestive aid","digestive enzyme preparation","pepsin preparation"],"phonetic":"/ˈpɛptədʒən/","extraExplanation":["这是一个较少见、偏旧式的词，常出现在早期药学/营养品宣传或旧医学文献中；现代更常见的说法会直接写“digestive enzyme（消化酶）”“pepsin preparation（胃蛋白酶制剂）”或“digestive aid（助消化剂）”。","词形来源可理解为 pepto-（与消化、肽/蛋白分解相关）+ -gen（“产生……的东西”），字面含义接近“促使产生（消化产物/消化酶）的物质”。"]}
{"word":"peptogenic","summary":{"en":"“Peptogenic” means producing or promoting the formation of peptides.","zh":"“Peptogenic”指产生或促进肽形成的（促肽生成的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or promoting the formation of peptides (short chains of amino acids), especially in biochemical or medical contexts.","zh":"（尤用于生化或医学语境）产生或促进肽（由氨基酸组成的短链）形成的；促肽生成的。"},"examples":[{"en":"Some hormones have peptogenic effects in certain tissues.","zh":"一些激素在某些组织中具有促肽生成的作用。"},{"en":"The paper describes a peptogenic reaction pathway in the laboratory.","zh":"这篇论文描述了实验室中的一种促肽生成反应途径。"}]}],"synonyms":["peptide-forming","peptidogenic","peptide-producing"],"phonetic":"/ˌpɛp.təˈdʒɛn.ɪk/","extraExplanation":["这是一个较少见、偏专业的词，多见于生物化学、药理学或生理学写作中。词根可理解为 pepto-（与“肽”有关）+ -genic（“产生……的/促成……的”）。实际阅读中也常见更直白的表达，如 “peptide-forming” 或 “promotes peptide formation”。"]}
{"word":"peptogenous","summary":{"en":"Peptogenous means producing peptone or promoting protein digestion, mainly used in medical/physiology contexts.","zh":"Peptogenous 指“生成蛋白胨或促进蛋白质消化的”，多用于医学/生理学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"producing peptone (a digestion product of proteins) or helping form peptone during digestion; digestive.","zh":"（医学/生理学）能生成蛋白胨（蛋白质消化产物）的；促进蛋白胨形成的；有助消化的。"},"examples":[{"en":"In older physiology texts, gastric juice was described as having a peptogenous effect on proteins.","zh":"在较早的生理学教材中，胃液常被描述为对蛋白质具有“生成蛋白胨”的作用。"},{"en":"The paper examined whether certain enzymes have peptogenous activity under acidic conditions.","zh":"该论文研究了某些酶在酸性条件下是否具有促蛋白胨生成的活性。"}]}],"synonyms":["digestive","peptone-forming","proteolytic (related, not identical)"],"phonetic":"/pɛpˈtɑːdʒənəs/","extraExplanation":["这是一个较少见、偏旧式/学术的术语，常见于早期生理学与消化研究语境。词根来自“peptone（蛋白胨）”+ “-genous（产生……的）”。现代写作中更常用的表达可能是“proteolytic（蛋白水解的）”或“promoting protein digestion（促进蛋白质消化）”，具体取决于你想强调“分解蛋白质”还是“形成蛋白胨”这一步。"]}
{"word":"peptogeny","summary":{"en":"Peptogeny means the production of peptones during the digestion of proteins.","zh":"Peptogeny 指蛋白质消化过程中蛋白胨的生成过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation or production of peptones (partly digested proteins), especially during digestion.","zh":"（尤指在消化过程中）蛋白胨的形成或生成；即蛋白质被部分消化后生成蛋白胨的过程。"},"examples":[{"en":"In older physiology texts, peptogeny was discussed as a key step in protein digestion.","zh":"在较早的生理学教材中，peptogeny（蛋白胨生成）被视为蛋白质消化的关键步骤。"},{"en":"The experiment aimed to measure peptogeny by tracking how much peptone appeared over time.","zh":"该实验试图通过追踪蛋白胨随时间出现的量来测量peptogeny（蛋白胨生成）。"}]}],"synonyms":["peptone formation","proteolysis (broader)"],"phonetic":"/pɛpˈtɑdʒəni/","extraExplanation":["这是一个较少见、偏历史或专业文献用词（生理学/消化学）。现代写作中更常用更宽泛的术语，如“protein digestion（蛋白质消化）”“proteolysis（蛋白水解）”，或直接说“peptone formation（蛋白胨形成）”。","词源上可拆为 pepto-（与“消化”相关，源自希腊语）+ -geny（“生成/产生”）。理解词根有助于记忆：字面就是“（蛋白胨的）生成”。"]}
{"word":"peptohydrochloric","summary":{"en":"A rare medical adjective meaning “related to pepsin plus hydrochloric acid,” like the digestive mixture in stomach acid.","zh":"一个较少见的医学形容词，意为“与胃蛋白酶和盐酸的混合物相关”，类似胃液中的消化性酸酶环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to a mixture of pepsin (a digestive enzyme) and hydrochloric acid, like the natural acid-and-enzyme environment found in the stomach (gastric juice).","zh":"（医学）指与“胃蛋白酶（pepsin）+ 盐酸（hydrochloric acid）”的混合物有关的；类似胃液中酸与酶共同作用的环境。"},"examples":[{"en":"In older medical writing, doctors sometimes described a lack of peptohydrochloric secretion in certain stomach disorders.","zh":"在较早的医学文献中，医生有时会把某些胃部疾病描述为“胃蛋白酶-盐酸（peptohydrochloric）分泌不足”。"},{"en":"Peptohydrochloric activity helps break down proteins during digestion.","zh":"胃蛋白酶-盐酸（peptohydrochloric）的作用有助于在消化过程中分解蛋白质。"}]}],"synonyms":["gastric","peptic","of gastric juice"],"phonetic":"ˌpɛptoʊˌhaɪdrəˈklɔrɪk","extraExplanation":["这个词非常少见，多见于较旧的医学/生理学语境中，用来强调“胃蛋白酶 + 盐酸”共同产生的消化作用。现代写法更常用 gastric juice（胃液）、pepsin and hydrochloric acid（胃蛋白酶和盐酸）、peptic/hydrochloric 等表达。","构词提示：pepto- 来自 pepsin/peptic（与消化蛋白的酶相关），hydrochloric 指“盐酸的”。因此它基本等于“与胃蛋白酶和盐酸相关的”。"]}
{"word":"peptolysis","summary":{"en":"Peptolysis means the breakdown of peptides into smaller pieces or amino acids, usually by enzymes.","zh":"Peptolysis 指肽在酶等作用下被分解成更小片段或氨基酸的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The chemical or enzymatic breakdown of peptides (small protein chains) into smaller peptides or amino acids.","zh":"（肽的）水解；肽链在化学或酶的作用下被分解成更小的肽或氨基酸的过程。"},"examples":[{"en":"Peptolysis in the stomach helps turn dietary proteins into smaller building blocks the body can absorb.","zh":"胃里的肽水解作用能把食物蛋白分解成更小的组成单位，方便身体吸收。"},{"en":"Researchers measured peptolysis to understand how quickly an enzyme breaks down peptides.","zh":"研究人员测量肽水解过程，以了解某种酶分解肽的速度。"}]}],"synonyms":["peptide hydrolysis","peptide breakdown","proteolysis (related broader term)"],"phonetic":"/pɛpˈtɑləsɪs/","extraExplanation":["词源上，pepto- 与“消化/肽”相关，-lysis 表示“分解、裂解”（常见于 biology/chemistry 词汇，如 hydrolysis 水解、hemolysis 溶血）。因此 peptolysis 字面意思就是“肽的分解”。","这是偏专业的生物化学/生理学术语，日常英语中更常用的相关词是 proteolysis（蛋白质水解/蛋白质分解）或 peptide breakdown（肽的分解）。"]}
{"word":"peptolytic","summary":{"en":"Peptolytic means able to break down peptides, typically by enzymatic action.","zh":"peptolytic 指“能分解肽的”，通常与酶促分解有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to break down peptides (small protein fragments) into smaller molecules, usually by enzymes.","zh":"能分解肽（蛋白质的小片段）成更小分子的；通常指通过酶进行的“肽分解”的。"},"examples":[{"en":"Some bacteria produce peptolytic enzymes that help them digest proteins in their environment.","zh":"一些细菌会产生肽分解酶，帮助它们消化环境中的蛋白质。"},{"en":"The lab tested the peptolytic activity of the sample to see how quickly it could break down peptides.","zh":"实验室检测了样品的肽分解活性，以了解它分解肽的速度。"}]}],"synonyms":["proteolytic","peptide-degrading","peptidase-related"],"phonetic":"/ˌpɛp.toʊˈlɪt.ɪk/","extraExplanation":["构词提示：pepto- 表示“肽/消化”，-lytic 来自 “lysis（裂解、分解）”。合起来就是“能分解肽的”。","使用场景：该词多见于生物化学、微生物学、食品科学等专业语境；日常英语里更常用的是 proteolytic（蛋白水解的）或 protein-digesting（分解蛋白质的）。"]}
{"word":"peptonaemia","summary":{"en":"Peptonaemia is a medical term for peptones (protein fragments) present in the blood, mainly seen in older medical writing.","zh":"Peptonaemia（蛋白胨血症）指血液中出现蛋白胨，多见于较旧的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The presence of peptones (small protein fragments) in the blood; sometimes used historically in discussions of severe infection or tissue breakdown.","zh":"（医学）血液中出现“蛋白胨”（蛋白质分解产生的小片段）；在旧一些的医学文献中，有时与严重感染或组织分解的讨论相关。"},"examples":[{"en":"Older medical texts sometimes mention peptonaemia in patients with severe infections.","zh":"较早的医学文献有时会在严重感染患者中提到 peptonaemia（蛋白胨血症）。"},{"en":"The report suggested peptonaemia, meaning protein breakdown products were detected in the bloodstream.","zh":"报告提示可能存在 peptonaemia，意思是血液中检测到蛋白质分解产物。"}]}],"synonyms":["peptonemia","peptoneemia (rare)"],"phonetic":"/ˌpɛp.təˈniː.mi.ə/","extraExplanation":["“peptonaemia”是英式拼写；美式写法常见为“peptonemia”。","该词在现代临床中并不常用；如今更常用更具体的检测/诊断术语来描述血中蛋白分解产物、感染相关的全身反应等。","词源可拆为：peptone（蛋白胨）+ -aemia（血液中的……；如 anaemia=贫血）。"]}
{"word":"peptonate","summary":{"en":"Peptonate means to break proteins down into peptones, or to treat something with peptone, mainly in scientific contexts.","zh":"Peptonate 指将蛋白质胨化成胨，或用胨处理/加入胨，主要用于科学与医学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to convert a protein into peptones (smaller, more digestible protein fragments), usually by digestion with enzymes such as pepsin","zh":"使蛋白质转化为胨（较小、较易消化的蛋白质片段），通常通过胃蛋白酶等酶的消化作用实现"},"examples":[{"en":"In the stomach, enzymes help peptonate proteins so the body can absorb them more easily.","zh":"在胃里，酶会帮助把蛋白质胨化，使身体更容易吸收。"},{"en":"The lab protocol peptonates the sample before further analysis.","zh":"实验流程会先把样品胨化，然后再进行后续分析。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add or treat with peptone (especially in preparing nutrient media for microorganisms)","zh":"加入胨或用胨处理（尤指在配制微生物培养基时）"},"examples":[{"en":"They peptonated the broth to support bacterial growth.","zh":"他们在肉汤中加入胨，以支持细菌生长。"}]}],"synonyms":["digest (enzymatically)","hydrolyze (proteins)","pepsinize"],"phonetic":"/ˈpɛp.təˌneɪt/","extraExplanation":["“peptonate”多见于生物化学、医学与微生物学语境，日常英语里很少用。","词根来自“peptone（胨）”，而“胨”是蛋白质被酶部分分解后的产物，常用于培养基（如 peptone water）提供氮源与营养。"]}
{"word":"peptone","summary":{"en":"Peptone is partially digested protein material, commonly used as a nutrient in microbiology culture media and related lab work.","zh":"Peptone（蛋白胨）是部分消化/分解的蛋白质产物，常作为微生物培养基等实验用途的营养来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mixture of small protein pieces made by partially breaking down proteins; used especially in biology and medicine (for example, in culture media) as a nutrient source.","zh":"蛋白胨：由蛋白质经部分分解形成的蛋白小片段混合物；常用于生物学与医学中（如培养基）作为营养来源。"},"examples":[{"en":"The lab prepared a peptone solution to feed the bacteria in the culture.","zh":"实验室配制了蛋白胨溶液，用来为培养中的细菌提供营养。"},{"en":"Many microbiology media contain peptone as a source of nitrogen and amino acids.","zh":"许多微生物培养基含有蛋白胨，作为氮源和氨基酸来源。"}]},{"partOfSpeech":"n.","definition":{"en":"A product of digestion formed when enzymes break proteins into smaller, more soluble parts.","zh":"（消化产生的）蛋白胨：酶将蛋白质分解成更小、更易溶解部分时形成的产物。"},"examples":[{"en":"During digestion, proteins can be broken down into peptides and peptones.","zh":"在消化过程中，蛋白质可被分解成肽和蛋白胨。"}]}],"synonyms":["protein hydrolysate","peptide mixture"],"phonetic":"/ˈpɛpˌtoʊn/","extraExplanation":["“peptone”常见于科学与医疗语境（实验室、培养基配方、消化生理等），日常英语里不太会用到。","词源与“peptide（肽）/ pepsin（胃蛋白酶）”同根，来自希腊语，核心含义与“消化、分解蛋白质”有关。"]}
{"word":"peptonelike","summary":{"en":"Peptonelike means “similar to peptone,” often used in scientific writing to describe protein-digestion-like, soluble materials.","zh":"peptonelike 意为“类似蛋白胨的”，常用于科研语境，描述具有蛋白消化产物特征、易溶的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or having the characteristics of peptone (a product of protein digestion), such as being soluble and protein-rich.","zh":"类似蛋白胨的；具有蛋白胨特征的（蛋白胨是蛋白质消化后的产物），例如易溶、富含蛋白分解产物等。"},"examples":[{"en":"The broth contained a peptonelike substance that supported bacterial growth.","zh":"这种肉汤含有类似蛋白胨的物质，能支持细菌生长。"},{"en":"Under the microscope, the sample showed a peptonelike material rather than intact protein.","zh":"在显微镜下，样本显示出类似蛋白胨的物质，而不是完整蛋白。"}]}],"synonyms":["peptone-like","proteinaceous","protein-rich","digestive (context-dependent)"],"phonetic":"/ˈpɛp.toʊnˌlaɪk/","extraExplanation":["“peptonelike”多见于生物学、医学、食品/发酵等学术语境，属于描述性形容词：peptone（蛋白胨）+ -like（像……一样）。","peptone（蛋白胨）通常指蛋白质被酶或酸部分水解后产生的混合物，常用于微生物培养基中作为氮源；因此“peptonelike”常暗示“可被微生物利用、呈蛋白消化产物特征”。"]}
{"word":"peptonemia","summary":{"en":"Peptonemia means peptones (protein breakdown products) in the bloodstream.","zh":"peptonemia 指血液中出现蛋白胨/胨等蛋白分解产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical term meaning the presence of peptones (protein breakdown products) in the blood.","zh":"医学术语：指血液中出现“蛋白胨/胨”（蛋白质分解后的产物）。"},"examples":[{"en":"The lab report mentioned peptonemia, suggesting abnormal protein breakdown in the body.","zh":"化验报告提到 peptonemia，提示体内可能存在异常的蛋白质分解。"},{"en":"Peptonemia was discussed in older medical texts more often than in modern clinical practice.","zh":"在较早的医学文献中更常讨论 peptonemia，而现代临床中较少使用这个说法。"}]}],"synonyms":["peptonaemia","peptone in the blood"],"phonetic":"/ˌpɛp.təˈniː.mi.ə/","extraExplanation":["“peptone（蛋白胨/胨）”是蛋白质在消化或组织分解过程中形成的一类较小的蛋白片段。","peptonemia 多见于较旧的医学书写中；现代医学更常用更具体的检测与表述（例如具体的蛋白/肽类指标），因此这个词在当代临床语境里相对少见。"]}
{"word":"peptones","summary":{"en":"Peptones are partially digested protein products, often used as nutrients—especially in microbiology culture media.","zh":"Peptones（蛋白胨）是蛋白质部分消化后的产物，常用作营养来源，尤其用于微生物培养基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"protein fragments produced when proteins are partially digested (for example, by enzymes like pepsin); used in biology and medicine as nutrients.","zh":"蛋白胨：蛋白质在部分消化（如被胃蛋白酶等酶分解）后形成的蛋白质片段；在生物与医学中常作为营养成分使用。"},"examples":[{"en":"During digestion, proteins can be broken down into smaller products such as peptones.","zh":"在消化过程中，蛋白质会被分解成更小的产物，例如蛋白胨。"},{"en":"The lab medium contained peptones to provide nitrogen for bacterial growth.","zh":"这种实验培养基含有蛋白胨，用来为细菌生长提供氮源。"}]},{"partOfSpeech":"n.","definition":{"en":"a general ingredient in microbiology culture media (often from meat or casein) that supplies amino acids and peptides.","zh":"（培养基成分）一种常见的微生物培养基原料（常来源于肉类或酪蛋白的水解产物），为微生物提供氨基酸与多肽。"},"examples":[{"en":"Many standard agar plates include peptones as a nutrient source.","zh":"许多标准琼脂平板都含有蛋白胨作为营养来源。"}]}],"synonyms":["protein hydrolysates","peptides","digested protein (general)"],"phonetic":"/ˈpɛpˌtoʊnz/","extraExplanation":["“Peptones”是“peptone”的复数形式，常见于生物/医学/食品科学语境。日常英语里不常用，更多出现在教材、论文和实验记录中。","在培养基里，peptone通常不是单一化学物质，而是一类由蛋白质水解得到的混合物，因此不同厂家/来源的peptone成分可能略有差异。"]}
{"word":"peptonic","summary":{"en":"“Peptonic” means related to peptone or the digestion process that produces it (a rare medical/scientific adjective).","zh":"peptonic 指“与胨或形成胨的消化过程有关的”（较少见的医学/科研形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to peptone (a protein broken down into smaller, soluble parts during digestion) or to the process of forming peptone; peptone-like.","zh":"与胨（蛋白质在消化过程中分解形成的可溶性小分子）有关的；与形成胨的过程有关的；类似胨的。"},"examples":[{"en":"Doctors once described certain stomach conditions as involving “peptonic digestion.”","zh":"过去医生曾把某些胃部状况描述为涉及“胨性消化（peptonic digestion）”。"},{"en":"The report used the term peptonic to talk about protein breakdown in the stomach.","zh":"这份报告用 peptonic 来谈论蛋白质在胃里的分解过程。"}]}],"synonyms":["peptone-related","peptic (often used in related contexts)"],"phonetic":"/pɛpˈtɑnɪk/","extraExplanation":["“Peptonic”是比较少见、偏医学/生理学写作的词，常见搭配有 peptonic digestion（胨性消化）、peptonic products（胨性产物）。日常英语里更常用的相关词是 peptic（与胃液/胃蛋白酶有关的）或 protein digestion（蛋白质消化）。","词根提示：pept- 来自希腊语，和“消化”有关（同源词如 dyspepsia ‘消化不良’）。"]}
{"word":"peptonisation","summary":{"en":"Peptonisation is the enzyme-driven digestion process that turns proteins into smaller, soluble products (especially peptones).","zh":"Peptonisation 指在酶作用下把蛋白质消化分解成更小、更易溶的产物（尤其是胨）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of breaking down proteins into smaller, more soluble substances (especially peptones) during digestion or by enzymes.","zh":"（蛋白）胨化作用：在消化过程中或在酶的作用下，把蛋白质分解成更小、较易溶的物质（尤其是“胨”）的过程。"},"examples":[{"en":"In the stomach, peptonisation begins when enzymes start breaking proteins into smaller pieces.","zh":"在胃里，当酶开始把蛋白质分解成更小的片段时，胨化作用就开始了。"},{"en":"Researchers measured peptonisation to understand how quickly the sample protein was digested.","zh":"研究人员测量胨化作用，以了解样本蛋白被消化的速度。"}]}],"synonyms":["peptonization","protein digestion","proteolysis (broader)"],"phonetic":"/ˌpɛp.tə.nəˈzeɪ.ʃən/","extraExplanation":["“peptonisation”常见于生理学/生物化学语境，和胃蛋白酶（pepsin）、蛋白水解（proteolysis）等概念相关。它强调把蛋白质变成更易溶、可进一步吸收利用的产物（传统术语中常提到“peptone/胨”）。","拼写上英式英语常用 peptonisation，美式英语更常见 peptonization；两者意思相同。"]}
{"word":"peptonise","summary":{"en":"Peptonise means to break down protein into peptones—essentially to partially digest protein (British spelling of peptonize).","zh":"peptonise 指把蛋白质分解成蛋白胨，即对蛋白质进行“部分消化/蛋白胨化”（英式拼写，等同 peptonize）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Biochemistry/food science) To break down proteins into peptones (smaller, more soluble protein fragments), usually by enzymes or acids; to partially digest protein.","zh":"（生物化学/食品科学）把蛋白质分解成蛋白胨（更小、更易溶的蛋白质片段），通常通过酶或酸；使蛋白质发生部分消化。"},"examples":[{"en":"The lab used enzymes to peptonise the milk proteins before testing them.","zh":"实验室先用酶把牛奶蛋白肽化（生成蛋白胨）后再进行检测。"},{"en":"Some medical nutrition products contain pre-digested protein that has been peptonised.","zh":"一些医学营养产品含有已被部分消化、经过蛋白胨化处理的蛋白质。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Less common) To digest or become digested into peptones.","zh":"（较少见）消化（或被消化）成蛋白胨。"},"examples":[{"en":"In the stomach, proteins begin to peptonise under the action of digestive enzymes.","zh":"在胃里，蛋白质在消化酶的作用下开始转化为蛋白胨。"}]}],"synonyms":["peptonize","predigest","proteolyze","hydrolyze (proteins)"],"phonetic":"/ˈpɛp.təˌnaɪz/","extraExplanation":["“peptonise”是英式拼写，美式更常写作“peptonize”。多见于医学、营养学、发酵与实验室语境，日常英语里较少使用。","词源上来自“peptone（蛋白胨）+ -ise/-ize（使……化）”，意思直观：使蛋白变成蛋白胨（更易消化/吸收的形式）。"]}
{"word":"peptonised","summary":{"en":"Peptonised means “pre-digested”: proteins in food have been broken down into peptones to make it easier to digest.","zh":"peptonised 指“预消化的”：食物中的蛋白质被分解成蛋白胨/胨，从而更容易消化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially of food or medicine) treated with digestive enzymes so that proteins are broken down into peptones, making it easier to digest; “pre-digested.”","zh":"（尤指食物或药品）经消化酶处理，使蛋白质分解为蛋白胨/胨，更易消化；相当于“预消化的”。"},"examples":[{"en":"The doctor recommended a peptonised milk drink for his weak digestion.","zh":"医生建议他饮用预消化的牛奶饮品，以减轻消化负担。"},{"en":"In the hospital, she was given peptonised foods during recovery.","zh":"在医院里，她在康复期间吃的是预消化食物。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “peptonise”: to treat (food) so it becomes peptonised.","zh":"“peptonise”的过去式/过去分词：用酶处理（食物）使其成为预消化状态。"},"examples":[{"en":"The kitchen peptonised the broth to make it gentler for patients.","zh":"厨房将汤进行预消化处理，使其更适合病人食用。"}]}],"synonyms":["predigested","enzyme-treated","partly digested","hydrolyzed (in some food/medical contexts)"],"phonetic":"/ˈpɛp.təˌnaɪzd/","extraExplanation":["“peptonised”常见于英式拼写；美式更常写作“peptonized”。","“peptone（蛋白胨/胨）”是蛋白质被部分分解后的产物，因此这类食物或配方常用于病后恢复、消化功能较弱的人群等语境。"]}
{"word":"peptoniser","summary":{"en":"Peptoniser means an agent (or sometimes a device) that breaks proteins into smaller peptides/peptones for easier digestion or processing.","zh":"Peptoniser 指使蛋白质分解为更小肽/蛋白胨、便于消化或加工的制剂（有时也指相关装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often an enzyme preparation) that breaks proteins into smaller peptides/peptones, making them easier to digest or process.","zh":"（常指酶制剂等）把蛋白质分解成更小的肽/蛋白胨，从而更易消化或便于加工的物质。"},"examples":[{"en":"The formula includes a peptoniser to help break down milk proteins.","zh":"这种配方加入了肽化剂，帮助分解乳蛋白。"},{"en":"In the lab, they added a peptoniser to speed up protein digestion in the sample.","zh":"在实验室里，他们加入肽化剂来加快样品中的蛋白分解。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine or device that carries out peptonisation (protein breakdown), especially in industrial or laboratory settings.","zh":"（尤指工业或实验环境中）用于进行“肽化/蛋白分解”的机器或装置。"},"examples":[{"en":"The peptoniser was cleaned and sterilized before the next batch.","zh":"下一批生产前，这台肽化装置被清洗并消毒了。"}]}],"synonyms":["peptonizer","protease preparation","digestive enzyme","protein hydrolyzer"],"phonetic":"/ˈpɛp.təˌnaɪ.zɚ/","extraExplanation":["“peptoniser”多见于英式拼写；美式更常写作“peptonizer”。它来源于动词“peptonise/peptonize”（使蛋白质转化为蛋白胨/小肽）。","该词主要出现在营养学、消化相关产品、食品加工与实验室语境中，日常英语里不常用。阅读说明书或科研/工业文本时更容易遇到。"]}
{"word":"peptonising","summary":{"en":"Peptonising means breaking proteins down into peptones, often for digestion or laboratory/media preparation.","zh":"Peptonising 指把蛋白质分解成蛋白胨，常用于消化过程或实验室/培养基制备。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Present participle) converting proteins into peptones (smaller, more soluble protein fragments), usually by digestion with enzymes or acid; making something more easily digestible.","zh":"（现在分词）将蛋白质分解并转化为蛋白胨（更小、更易溶的蛋白片段），通常通过酶或酸的消化作用；使某物更容易被消化吸收。"},"examples":[{"en":"The enzyme is peptonising the protein in the solution.","zh":"这种酶正在把溶液中的蛋白质分解成蛋白胨。"},{"en":"In the lab, they are peptonising the sample to prepare a nutrient medium.","zh":"在实验室里，他们正在对样品进行蛋白胨化处理，以制备营养培养基。"}]}],"synonyms":["peptonizing","digesting (proteins)","hydrolyzing (proteins)","breaking down"],"phonetic":"/ˈpɛp.təˌnaɪ.zɪŋ/","extraExplanation":["“peptonising”是英式拼写；美式更常见写法是“peptonizing”。两者意思相同。","“peptone（蛋白胨）”常见于生物/微生物培养基（如胰蛋白胨 tryptone、蛋白胨水 peptone water），指经过水解、便于微生物利用的蛋白质消化产物。","在医学与营养语境中，相关表达有“peptonised milk（蛋白胨化牛奶）”，指经过处理、更易消化的牛奶（多见于历史或特定医疗饮食文献）。"]}
{"word":"peptonization","summary":{"en":"Peptonization is the process of turning proteins into peptones, especially during stomach digestion.","zh":"Peptonization 指蛋白质（尤其在胃内）被分解并转化为胨的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of converting proteins into peptones (small, soluble protein fragments), especially during digestion in the stomach.","zh":"（尤指胃内消化时）把蛋白质分解并转化为胨（可溶性的小分子蛋白片段）的过程。"},"examples":[{"en":"In the stomach, peptonization helps break down dietary protein into smaller, soluble forms.","zh":"在胃里，peptonization 有助于把食物中的蛋白质分解成更小、可溶的形式。"},{"en":"Some older physiology texts describe peptonization as a key step in protein digestion.","zh":"一些较早的生理学教材把 peptonization 描述为蛋白质消化的关键步骤之一。"}]}],"synonyms":["proteolysis","protein digestion","peptonisation"],"phonetic":"/ˌpɛp.tə.nəˈzeɪ.ʃən/","extraExplanation":["该词多见于较旧的生理学/医学写作中；现代教材更常用更广义的术语如 proteolysis（蛋白水解）或 protein digestion（蛋白质消化）。","词根提示：peptone（胨）来自希腊语 peptos，意为“煮熟/消化的”；-ization 表示“……化/过程”。","语境上常与胃酸、胃蛋白酶（pepsin）等一起出现，用来解释蛋白质在胃内被分解为更易吸收的形式。"]}
{"word":"peptonize","summary":{"en":"Peptonize means to break proteins down into peptones, usually by digestive enzymes, making them easier to digest and absorb.","zh":"Peptonize 指把蛋白质分解成蛋白胨（常由消化酶作用），从而更易消化与吸收。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change proteins into peptones (smaller, soluble protein fragments), especially by the action of digestive enzymes (such as pepsin).","zh":"（使）蛋白质转变为蛋白胨（更小、可溶的蛋白质分解产物），尤指在消化酶（如胃蛋白酶）的作用下。"},"examples":[{"en":"In the stomach, enzymes help peptonize dietary proteins so the body can absorb them more easily.","zh":"在胃里，酶会帮助把食物中的蛋白质蛋白胨化，使身体更容易吸收。"},{"en":"Some baby formulas are treated to peptonize the proteins for easier digestion.","zh":"有些婴儿配方奶会对蛋白质进行蛋白胨化处理，以便更容易消化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to digest or break down (food) into a form that can be absorbed; to make easier to digest.","zh":"（使食物）被消化、分解为可吸收的形式；使更易消化。"},"examples":[{"en":"A warm broth can be gentle on the stomach and may be easier to peptonize than heavy foods.","zh":"温热的汤对胃比较温和，可能比油腻食物更容易被消化分解。"}]}],"synonyms":["predigest","hydrolyze (proteins)","break down","digest"],"phonetic":"/ˈpɛp.təˌnaɪz/","extraExplanation":["“peptonize”多见于医学、营养学、食品加工等语境，日常口语中较少使用。","词根来自“peptone（蛋白胨）”。蛋白胨通常指蛋白质在消化过程中被酶部分分解后形成的可溶性产物。","英式拼写常见为“peptonise”。"]}
{"word":"peptonized","summary":{"en":"Peptonized means partially digested by enzymes (especially of food/milk), making it easier to digest; it’s also the past form of “peptonize.”","zh":"Peptonized 指（食物/牛奶）经酶处理而“部分消化/胨化”，更易消化；也可作动词 peptonize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of food or milk) treated with enzymes (like pepsin) so the protein is partly broken down, making it easier to digest.","zh":"（指食物或牛奶）经过酶（如胃蛋白酶）处理，使蛋白质部分分解，更容易消化。"},"examples":[{"en":"The doctor recommended peptonized milk for the patient after surgery.","zh":"医生建议术后病人饮用胨化（易消化处理过的）牛奶。"},{"en":"Peptonized foods are sometimes used when someone has trouble digesting protein.","zh":"当有人难以消化蛋白质时，有时会使用胨化食物。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “peptonize”: to break protein down into smaller, easier-to-absorb substances (peptones).","zh":"“peptonize”的过去式/过去分词：把蛋白质分解成更小、更易吸收的物质（胨）。"},"examples":[{"en":"In the lab, the sample was peptonized before further testing.","zh":"在实验室里，样本在进一步检测前被进行胨化处理。"}]}],"synonyms":["predigested","enzyme-treated","partially digested"],"phonetic":"/ˈpɛp.tə.naɪzd/","extraExplanation":["“peptonized”常见于较旧或较专业的医学/营养语境（如术后、肠胃功能较弱时的饮食）。现代日常英语里更常看到的说法可能是“easy-to-digest / predigested”。","词根提示：peptonize 来自 peptone（胨，一类蛋白质分解产物）；与消化相关的词还包括 pepsin（胃蛋白酶）。"]}
{"word":"peptonizer","summary":{"en":"A peptonizer is an enzyme preparation or device used to break proteins into more easily digestible peptones/peptides.","zh":"peptonizer 指用于把蛋白质分解成更易消化的胨/肽的酶制剂或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often an enzyme preparation) or a device used to break proteins down into smaller, more digestible compounds (peptones/peptides).","zh":"（常指酶制剂）或装置，用来把蛋白质分解成更小、更易消化的成分（如胨/肽）。"},"examples":[{"en":"Some early infant formulas were treated with a peptonizer to make the protein easier to digest.","zh":"一些早期婴儿配方奶会用“peptonizer（蛋白消化剂）”处理，让蛋白质更易消化。"},{"en":"The hospital used a peptonizer enzyme to predigest milk for patients with sensitive stomachs.","zh":"医院使用一种 peptonizer 酶来预消化牛奶，供胃部敏感的病人食用。"}]}],"synonyms":["protease","digestive enzyme","protein-hydrolyzing enzyme"],"phonetic":"/ˈpɛp.təˌnaɪ.zɚ/","extraExplanation":["词源提示：peptonizer 来自 peptonize（使形成“胨/肽”，即把蛋白质部分水解）+ -er（表示“做某事的人/物”）。在现代英语里它比较少见，更多出现在历史医学/营养资料或工业/实验语境中。","使用场景：在旧式育婴或临床营养中，peptonizer 常指帮助“预消化”牛奶或食物蛋白的酶制剂；在某些资料里也可指用于该过程的器具。"]}
{"word":"peptonizing","summary":{"en":"Peptonizing means breaking proteins down into smaller, easier-to-digest forms, often in digestion or medical/nutrition contexts.","zh":"Peptonizing 指把蛋白质分解成更小、更易消化吸收的形式，常用于消化、医学或营养语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"breaking down proteins into smaller, more easily digested substances (peptones or peptide-like fragments), often by enzymes or acids","zh":"（使）蛋白质分解成更易消化的小分子（如蛋胨或类似肽的碎片），常由酶或酸促成"},"examples":[{"en":"The stomach is peptonizing the food with acid and digestive enzymes.","zh":"胃正在用胃酸和消化酶把食物中的蛋白质分解得更容易消化。"},{"en":"The formula is designed for people who have trouble peptonizing protein.","zh":"这种配方是为难以消化蛋白质的人设计的。"}]},{"partOfSpeech":"v.","definition":{"en":"treating a substance so it becomes easier to absorb or use, especially in medicine or nutrition (extended meaning)","zh":"（引申）通过处理使某物更易被吸收或利用，尤用于医学或营养语境"},"examples":[{"en":"The clinician suggested peptonizing the feeding solution to reduce digestive stress.","zh":"临床医生建议对喂养液进行蛋白预消化处理，以减轻消化负担。"},{"en":"In older texts, peptonizing milk was sometimes recommended for very weak patients.","zh":"在较早的文献中，有时会建议对牛奶进行“蛋白预消化”处理，供体弱患者使用。"}]}],"synonyms":["digesting (protein)","breaking down (protein)","hydrolyzing (protein)","pre-digesting"],"phonetic":"/ˈpɛp.tə.naɪ.zɪŋ/","extraExplanation":["“peptonizing”来自动词 peptonize（使成蛋胨/使蛋白预消化）。多见于医学、营养学、消化生理学的说明文字中，日常英语里较少用。","在现代更常见的表达是“protein digestion / breaking down protein / pre-digested protein（预消化蛋白）”，而不是直接说 peptonize。"]}
{"word":"peptonoid","summary":{"en":"Peptonoid means peptone-like; it can refer to a peptone-like substance or be used as an adjective in older scientific writing.","zh":"peptonoid 指“胨样的/类似胨的”，既可指类胨物质，也可作形容词；多见于较早期的科学文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance resembling a peptone (a mixture of small proteins/peptides formed when proteins are partly digested).","zh":"类胨物质；类似“胨”（蛋白质部分消化后形成的小分子蛋白/肽混合物）的物质。"},"examples":[{"en":"Early nutrition research sometimes mentioned peptonoid materials formed during digestion.","zh":"早期营养学研究有时会提到消化过程中形成的类胨物质。"},{"en":"The report described the extract as containing peptonoid compounds rather than intact proteins.","zh":"报告称该提取物含有类胨化合物，而不是完整蛋白质。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling or relating to peptone; peptone-like.","zh":"胨样的；与胨有关的；类似胨的。"},"examples":[{"en":"The lab note used the phrase “peptonoid solution” to describe a protein-rich digest.","zh":"实验记录用“胨样溶液”来描述一种富含蛋白消化产物的溶液。"}]}],"synonyms":["peptone-like","peptonic (rare)","protein hydrolysate (modern, broader)"],"phonetic":"/ˈpɛp.təˌnɔɪd/","extraExplanation":["这个词在现代英语中非常少见，多见于19世纪末到20世纪早期的生理学、营养学或医学文献里，用来笼统描述“像胨一样的消化产物”。在今天更常用的表达通常是 peptone、peptides、protein hydrolysate（蛋白水解物）等，更具体也更标准。","词形上由 peptone（胨）+ -oid（“……样的/类似……的”后缀）构成，因此既可作名词（类胨物质），也可作形容词（胨样的）。"]}
{"word":"peptonuria","summary":{"en":"Peptonuria means peptones (partly digested proteins) are found in the urine.","zh":"peptonuria 指尿中检出蛋白胨（部分消化的蛋白质分解产物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The presence of peptones (partly digested proteins) in the urine.","zh":"尿中出现蛋白胨（部分消化后的蛋白质分解产物）的现象。"},"examples":[{"en":"The lab reported peptonuria, so the doctor ordered more tests to find the cause.","zh":"化验报告提示有蛋白胨尿，医生因此安排了更多检查来寻找原因。"},{"en":"Peptonuria is a medical finding and is not usually something a person can notice without testing.","zh":"蛋白胨尿是一种医学检验发现，通常个人不会在没有检测的情况下察觉。"}]}],"synonyms":["peptone in urine (descriptive)","abnormal urinary protein (broader)"],"phonetic":"/ˌpɛp.təˈnjʊr.i.ə/","extraExplanation":["词源上可拆成：peptone（蛋白胨）+ -uria（尿中出现某物的情况）。在医学英语里，-uria 常见于 hematuria（血尿）、proteinuria（蛋白尿）等。","这是相对少见且偏专业的术语，多出现在检验结果或医学文献中；日常交流更常说“abnormal protein in urine（尿蛋白异常）”之类更广义的表达。","具体意义和处理取决于检验方法与临床背景；若在真实报告中看到该词，应由医生结合症状与其他指标解释。"]}
{"word":"peptotoxin","summary":{"en":"A peptotoxin is a peptide/protein-based toxin, often produced by bacteria.","zh":"peptotoxin 指由肽/蛋白构成的毒素，常见于细菌产生的毒性物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxin (poison) made of peptides or proteins, especially one produced by bacteria that can harm body tissues or trigger strong immune reactions.","zh":"由肽或蛋白质构成的毒素（毒性物质），尤指细菌产生、可损伤组织或引发强烈免疫反应的毒素。"},"examples":[{"en":"Some bacteria release peptotoxins that damage cells and cause inflammation.","zh":"某些细菌会释放肽毒素，损伤细胞并引发炎症。"},{"en":"The lab tested whether the symptoms were linked to a peptotoxin in the sample.","zh":"实验室检测这些症状是否与样本中的肽毒素有关。"}]}],"synonyms":["peptide toxin","protein toxin","bacterial toxin"],"phonetic":"/ˌpɛptoʊˈtɑksɪn/","extraExplanation":["“peptotoxin”由 pepto-（与“肽/消化产物”相关）+ toxin（毒素）构成，在现代英语里较少见，更常见的相关词是“peptide toxin / protein toxin（肽/蛋白毒素）”。","在医学与微生物学语境中，这类词通常指由微生物产生、对人体具有毒性作用的蛋白或肽类分子；具体机制因毒素种类而异（如破坏细胞膜、干扰信号通路等）。"]}
{"word":"peptotoxine","summary":{"en":"Peptotoxine is a rare, old term for a supposed toxin from protein breakdown or bacterial activity, often discussed in early medical writing.","zh":"Peptotoxine 是一个罕见的旧术语，用于指蛋白质分解或细菌活动产生的“疑似毒素”，多见于早期医学写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A toxin thought to be produced during protein breakdown (putrefaction) or in certain bacterial processes; historically used for supposed poisonous substances related to peptides/peptones.","zh":"（罕见）一种被认为在蛋白质腐败分解或某些细菌过程中产生的毒素；历史上用于指与肽/胨相关的“毒性物质”。"},"examples":[{"en":"Early medical texts sometimes mentioned peptotoxine as a possible cause of symptoms after spoiled food.","zh":"早期医学文献有时会提到 peptotoxine，认为它可能导致食用变质食物后的症状。"},{"en":"Today, the term peptotoxine is uncommon, and writers usually name the specific bacterial toxin instead.","zh":"如今 peptotoxine 这个词不常用，写作者通常会直接说出具体的细菌毒素名称。"}]}],"synonyms":["peptotoxin","bacterial toxin (broader)","putrefaction toxin (historical, broader)"],"phonetic":"ˌpɛp.təˈtɑk.siːn","extraExplanation":["这个词非常少见，多见于19世纪末到20世纪初的医学/卫生学语境，当时人们对“食物腐败导致中毒”的化学机制还不够清楚，可能会用较笼统的名称来指代疑似有毒的分解产物。","在现代英文中，更常见、更准确的表达是直接说具体毒素或致病机制，例如 bacterial toxin（细菌毒素）、endotoxin（内毒素）、exotoxin（外毒素）等。","拼写上更常见的形式是 peptotoxin；peptotoxine 可能受法语拼写影响或属于旧式写法。"]}
{"word":"pepysian","summary":{"en":"Pepysian means “connected with Samuel Pepys or his diary,” and by extension “diary-like in Pepys’s vivid, candid style.”","zh":"Pepysian 指“与塞缪尔·佩皮斯或其日记有关的”，也可引申为“具有佩皮斯日记那种生动坦率、日常细节丰富的风格”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Samuel Pepys (1633–1703), especially his famous diary, his life, or his era in Restoration England.","zh":"与塞缪尔·佩皮斯（Samuel Pepys，1633–1703）有关的，尤指他的著名日记、他的生活，或英国王政复辟时期的时代风貌。"},"examples":[{"en":"The museum has a Pepysian collection of manuscripts and letters.","zh":"这家博物馆收藏了一批与佩皮斯有关的手稿和书信。"},{"en":"Her novel uses a Pepysian voice—observant, chatty, and full of daily detail.","zh":"她的小说采用一种“佩皮斯式”的口吻——细致观察、絮语闲谈，并充满日常细节。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling the style of Pepys’s diary: frank, vivid, and focused on everyday events and personal impressions.","zh":"具有《佩皮斯日记》风格的：坦率生动，关注日常事件与个人感受。"},"examples":[{"en":"His Pepysian notes capture the city’s moods, gossip, and small dramas.","zh":"他那些“佩皮斯式”的笔记记录了城市的情绪、八卦和小小的戏剧性事件。"}]}],"synonyms":["diary-like","Restoration-era","Pepysian in tone (descriptive phrase)"],"phonetic":"/pəˈpɪziən/","extraExplanation":["“Pepysian”来自英国海军行政官塞缪尔·佩皮斯（Samuel Pepys）。他1660–1669年的日记以生动、坦诚、充满生活细节而闻名，是研究伦敦历史的重要一手材料（如1665年大瘟疫、1666年伦敦大火等）。","在文学/写作评价里，说某种记录“Pepysian”，通常不是指“正式”或“宏大叙事”，而是指像日记一样贴近日常、带有个人视角、甚至略带八卦与自我剖白的笔法。"]}
