{"word":"pes","summary":{"en":"Pes is a formal anatomy term meaning “foot,” and it can also be an abbreviation (PES) in medical contexts.","zh":"Pes 是较正式的解剖学用语，意思是“足/脚”；在医学语境中也可能作为缩写（PES）使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) a foot, especially the foot of an animal; the part below the ankle (including the toes).","zh":"（解剖）足；（尤指）动物的脚/足；踝关节以下到脚趾的部分。"},"examples":[{"en":"In anatomy class, we learned that the pes includes the toes and the sole.","zh":"在解剖课上，我们学到 pes 包括脚趾和脚底。"},{"en":"The veterinarian examined the dog’s pes for swelling.","zh":"兽医检查了这只狗的足部（pes）是否肿胀。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medicine, abbreviation) PES: post-exertional malaise (worsening of symptoms after physical or mental effort).","zh":"（医学缩写）PES：运动后不适/劳累后不适（指体力或脑力活动后症状加重）。"},"examples":[{"en":"Some patients report PES after even light activity.","zh":"一些患者表示，即使轻微活动后也会出现 PES（劳累后不适）。"},{"en":"The doctor asked whether my fatigue could be related to PES.","zh":"医生询问我的疲劳是否可能与 PES（劳累后不适）有关。"}]}],"synonyms":["foot (common word)","hindfoot (in some contexts)"],"phonetic":"/pɛs/","extraExplanation":["“pes”这个词常见于解剖学与医学文献，来源于拉丁语“pes”，意思就是“脚/足”。在普通日常英语中，人们通常直接说“foot/feet”，而不是“pes”。","注意大小写：小写“pes”多指解剖学术语；大写“PES”更常见为缩写，具体含义要看上下文（不同领域可能代表不同术语）。"]}
{"word":"pesa","summary":{"en":"“Pesa” means “money/cash,” borrowed from Swahili and often used in East African contexts.","zh":"“pesa”意为“钱/现金”，源自斯瓦希里语，多用于东非相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Swahili) money; cash.","zh":"（源自斯瓦希里语）钱；现金。"},"examples":[{"en":"I don’t have enough pesa to buy a new phone.","zh":"我没有足够的钱买新手机。"},{"en":"Bring some pesa for the bus fare.","zh":"带点钱付公交车费。"},{"en":"He’s saving pesa to pay school fees.","zh":"他在攒钱交学费。"}]}],"synonyms":["money","cash","funds"],"phonetic":"/ˈpeɪsə/","extraExplanation":["“Pesa”主要见于东非（如肯尼亚、坦桑尼亚）使用的斯瓦希里语中，日常口语里常直接表示“钱”。在英语语境里，它多出现在与东非文化相关的对话、旅行场景或媒体报道中。","你可能还会见到“M-Pesa”：这是肯尼亚非常普及的移动支付/手机钱包服务名称，其中的“pesa”就是“钱”的意思。","注意：在标准英语里更常用的是 money / cash；“pesa”属于借词，用不用取决于语境和听众是否熟悉东非用法。"]}
{"word":"pesach","summary":{"en":"Pesach is the Hebrew name for Passover, a Jewish spring festival commemorating the Exodus from Egypt.","zh":"Pesach 是逾越节（Passover）的希伯来语名称，指犹太人在春季纪念出埃及、获得自由的重要节日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Passover; a major Jewish festival that remembers the Israelites’ escape from slavery in ancient Egypt, celebrated in early spring.","zh":"逾越节；犹太教的重要节日，纪念以色列人出埃及、摆脱奴役，通常在早春庆祝。"},"examples":[{"en":"Many Jewish families gather for a Pesach seder on the first night of Passover.","zh":"许多犹太家庭会在逾越节的第一晚聚在一起举行逾越节家宴（seder）。"},{"en":"During Pesach, some people avoid eating bread and other leavened foods.","zh":"在逾越节期间，有些人会避免吃面包和其他含酵食物。"}]}],"synonyms":["Passover","the Festival of Unleavened Bread (related)","Pesach seder (related phrase)"],"phonetic":"/ˈpɛsɑx/","extraExplanation":["“Pesach”是希伯来语“פֶּסַח”的音译，英语里常用“Passover”更普遍；在宗教与文化语境中也会直接说“Pesach”。","逾越节的核心仪式之一是“seder（家宴/礼仪餐）”，常会诵读《Haggadah》（讲述出埃及故事的文本），并食用象征性食物，如无酵饼（matzah）。","与饮食相关的常见说法：Passover food / kosher for Passover（逾越节可食用/符合逾越节饮食规定）。不同家庭与犹太传统分支在具体饮食习惯上可能不同。","在文学与文化作品中，Passover/Pesach常被用来象征“获得自由、摆脱压迫、重新开始”等主题。"]}
{"word":"pesade","summary":{"en":"Pesade is a classical horsemanship move: a trained horse lifts its forehand and holds a controlled rear.","zh":"Pesade 指古典马术中的一个动作：马抬起前躯并受控地后立定姿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Classical horsemanship) A controlled, balanced rear in which a trained horse lifts its front legs off the ground and holds its body at an angle (often around 45°), used as a school movement in dressage.","zh":"（古典马术）一种受控、平衡的后立动作：训练有素的马抬起前躯、前腿离地，并以一定角度（常约45°）保持姿态，是高阶盛装舞步/古典驯马中的“学校动作”。"},"examples":[{"en":"In classical dressage, the rider may teach the horse a pesade before attempting more demanding airs above the ground.","zh":"在古典盛装舞步中，骑手可能会先教马做 pesade（后立定姿），再尝试更高难度的“空中动作”。"},{"en":"The stallion performed a brief pesade, lifting his forehand smoothly without losing balance.","zh":"那匹公马做了一个短暂的 pesade，前躯平稳抬起而不失去平衡。"}]}],"synonyms":["(No close everyday synonym; related: levade, rear (general))"],"phonetic":"/pəˈsɑːd/","extraExplanation":["“Pesade”来自法语马术术语，常见于古典驯马（如维也纳西班牙骑术学校等）的语境里，属于“airs above the ground（离地动作/空中动作）”体系相关动作之一。","它不是日常英语高频词，多出现在马术、历史骑兵训练或古典表演艺术的文本中。"]}
{"word":"pesades","summary":{"en":"“Pesades” isn’t English; it’s a Spanish/Catalan form meaning “heavy” or “annoying/tiresome” (often feminine plural).","zh":"“pesades”不是英语；更像西班牙语/加泰语形式，意思是“重的”或“烦人的/令人厌烦的”（常为阴性复数）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. In Spanish/Catalan, it is an adjective form meaning “heavy” (literal weight) or “annoying/boring/tiresome,” usually feminine plural.","zh":"这不是标准英语单词。在西班牙语/加泰罗尼亚语中，它是形容词形式，意思是“重的”（字面重量）或“烦人的/无聊的/令人厌烦的”，通常为阴性复数。"},"examples":[{"en":"Spanish: Las maletas son pesadas. (The suitcases are heavy.)","zh":"西语：Las maletas son pesadas。（行李箱很重。）"},{"en":"Spanish: No seas pesada. (Don’t be annoying.)","zh":"西语：No seas pesada.（别这么烦人/别这么啰嗦。）"}]},{"partOfSpeech":"n.","definition":{"en":"In Spanish, it can also refer to “annoying remarks/jokes” (informal usage related to the adjective).","zh":"在西班牙语里，它也可指“令人厌烦的话/玩笑”（口语用法，来自形容词含义）。"},"examples":[{"en":"Spanish: Basta de pesadas. (Enough with the annoying jokes/comments.)","zh":"西语：Basta de pesadas.（别再开这种烦人的玩笑/别再说这种讨厌的话了。）"}]}],"synonyms":["heavy","annoying","tiresome","boring"],"phonetic":"/peˈsaðes/","extraExplanation":["你输入的“pesades”更像是西班牙语/加泰罗尼亚语的词形，而不是英语。西班牙语里更常见的拼写是“pesadas”（阴性复数），对应的阳性复数是“pesados”。","如果你本来想查英语单词，可能是拼写接近的：\"passages\"（段落/通道）、\"pessimistic\"（悲观的）等。你可以告诉我你想表达的句子或语言（英文/西语/加泰语），我可以帮你对照正确词。"]}
{"word":"pesage","summary":{"en":"Pesage means an official weighing, especially in contexts like horse racing.","zh":"Pesage 指正式的称重/过磅，尤其常见于赛马等场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of weighing (especially the official weighing of people, animals, or goods), often used in contexts like horse racing or shipping","zh":"称重；过磅（尤指在赛马、运输等场合的官方称重）"},"examples":[{"en":"The horses must go through the pesage before the race begins.","zh":"赛马开始前，马匹必须先进行过磅（称重）。"},{"en":"After pesage, the officials recorded each competitor’s weight.","zh":"称重结束后，工作人员记录了每位参赛者的体重。"}]}],"synonyms":["weighing","weigh-in","measurement (of weight)"],"phonetic":"/pəˈzɑʒ/","extraExplanation":["“pesage”来自法语，字面意思就是“称重/过磅”。在英语里它比较少见，多出现在较正式或带法式传统的场景（例如赛马场的官方流程）。","在赛马语境中，pesage 常指比赛前后对骑师（jockey）或马匹的称重，以确保符合比赛规定的负重要求。"]}
{"word":"pesah","summary":{"en":"Pesah (Pesach) is the Jewish holiday of Passover, commemorating the Exodus from Egypt.","zh":"Pesah（亦作 Pesach）指犹太教的逾越节，纪念出埃及的历史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) Passover: a major Jewish holiday that remembers the Israelites’ escape from slavery in ancient Egypt, traditionally celebrated with a special meal called a Seder.","zh":"（犹太教）逾越节：犹太人的重要节日，纪念以色列人从古埃及的奴役中出走（出埃及记）；传统上会以“家宴/仪式餐”（Seder）来庆祝。"},"examples":[{"en":"Pesah is a time for Jewish families to gather and tell the story of freedom.","zh":"逾越节期间，许多犹太家庭会团聚并讲述关于自由的故事。"},{"en":"During Pesah, many people avoid eating leavened bread.","zh":"在逾越节期间，很多人会避免食用发酵面包。"},{"en":"She was invited to a Pesah Seder and learned about the holiday traditions.","zh":"她受邀参加逾越节的家宴（Seder），并了解了相关传统。"}]}],"synonyms":["Passover","Pesach"],"phonetic":"/ˈpeɪsɑː/","extraExplanation":["“Pesah”也常拼作“Pesach”，英语里更常见的对应词是“Passover（逾越节）”。","逾越节的核心仪式之一是“Seder（家宴/仪式餐）”，会上诵读《哈加达》（Haggadah），讲述出埃及的故事，并吃象征性的食物（如无酵饼 matzah）。","在英语文化语境中，提到Pesah/Passover通常带有宗教与历史纪念的意味；写作或交流时用“Passover”更普遍，用“Pesah/Pesach”更贴近希伯来语或犹太文化语境。"]}
{"word":"pesante","summary":{"en":"Pesante means “heavy/weighty,” especially as a musical direction to play with strong, grounded accents.","zh":"Pesante 表示“沉重／厚重”，尤其常作音乐术语，指演奏要有分量与扎实重音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Music) A direction meaning “heavy” or “weighty”: play with strong, solid accents and a grounded feel (often a bit slower and more forceful).","zh":"（音乐术语）指“沉重的／厚重的”：演奏时要有扎实的重音与分量感，听起来更稳、更有力（常带一点更慢、更用力的感觉）。"},"examples":[{"en":"The composer writes pesante to make the opening theme sound powerful and grounded.","zh":"作曲家标注 pesante，是为了让开头主题听起来更有力量、更沉稳。"},{"en":"Play those chords pesante—use a firm touch and clear accents.","zh":"这些和弦要用 pesante 来弹——触键要扎实，重音要清楚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From Italian/French) heavy; clumsy or ponderous in style (used mainly in artistic or descriptive writing).","zh":"（源自意大利语／法语）沉重的；（风格上）笨重的、拖沓的（多用于艺术评论或描写语境）。"},"examples":[{"en":"Some critics found the film’s pacing pesante in the middle section.","zh":"一些评论家认为这部电影中段节奏显得 pesante（拖沓笨重）。"}]}],"synonyms":["heavy","weighty","ponderous","labored","solid"],"phonetic":"/pəˈzɑn.teɪ/","extraExplanation":["“Pesante”最常见于古典音乐谱面（意大利语表情术语传统），常见搭配包括：pesante e marcato（厚重且强调）、sempre pesante（始终保持厚重感）。理解时可以把它想成“更重的触键/弓压 + 更清晰的重音 + 更踏实的节奏重心”。"]}
{"word":"pescod","summary":{"en":"“Pescod” means a pea pod (an archaic spelling of “peascod”).","zh":"“pescod”指“豌豆荚”，是“peascod”的古老拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pea pod; the long green case that holds peas (an old-fashioned spelling of “peascod”).","zh":"豌豆荚；装着豌豆的长条荚（“peascod”的旧式拼写）。"},"examples":[{"en":"In the garden, she picked fresh pescods and shelled the peas for dinner.","zh":"在菜园里，她摘了新鲜的豌豆荚，把豌豆剥出来做晚餐。"},{"en":"The recipe calls for young peas still in the pescod.","zh":"这个食谱需要还在豌豆荚里的嫩豌豆。"}]}],"synonyms":["pea pod","peascod"],"phonetic":"/ˈpiːskɑːd/","extraExplanation":["“pescod/peascod”属于较古老的英语用法，现代日常英语更常说“pea pod”。在文学或历史文本里看到“pescod”时，通常就是指豌豆荚。","它也出现在英国文艺复兴时期的英语中；例如莎士比亚作品里有“peascod”一词（拼写可能因版本而异），用来指豌豆荚。"]}
{"word":"peseta","summary":{"en":"Peseta = Spain’s former currency, replaced by the euro.","zh":"Peseta（比塞塔）= 西班牙曾使用的旧货币单位，后被欧元取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former unit of money used in Spain (and also in Andorra); it was replaced by the euro in 2002.","zh":"比塞塔：西班牙（以及安道尔）曾使用的货币单位，2002年起被欧元取代。"},"examples":[{"en":"Before Spain adopted the euro, people paid in pesetas.","zh":"在西班牙改用欧元之前，人们用比塞塔付款。"},{"en":"My grandfather still talks about buying bread for a few pesetas.","zh":"我爷爷还会说起以前用几比塞塔买面包的事。"}]}],"synonyms":["Spanish currency (former)","former Spanish unit of money"],"phonetic":"/pəˈseɪtə/","extraExplanation":["“Peseta”是历史文化语境中常见的词，尤其出现在旧新闻、文学回忆、电影对白、旅行故事或价格对比里。","读西班牙相关作品时，看到“peseta(s)”通常是在营造“欧元之前的年代感”（类似英文里提到“pennies”或“shillings”带来的时代氛围）。","复数通常写作“pesetas”。在谈旧币值时，有时会看到“ptas.”作为缩写（例如价格标签或旧账本）。"]}
{"word":"pesetas","summary":{"en":"“Pesetas” is the plural of “peseta,” Spain’s former currency unit before the euro.","zh":"“Pesetas”是“peseta”的复数形式，指西班牙在使用欧元之前的旧货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The former basic unit of money used in Spain before the euro; it was also used in Andorra.","zh":"比塞塔：西班牙在使用欧元之前的旧货币单位；安道尔也曾使用。"},"examples":[{"en":"Before 2002, many people in Spain paid in pesetas.","zh":"2002年以前，西班牙很多人用比塞塔付款。"},{"en":"My grandfather still talks about prices in pesetas.","zh":"我爷爷现在还会用比塞塔来谈东西的价格。"}]}],"synonyms":["Spanish pesetas","former Spanish currency"],"phonetic":"/pəˈseɪtə/","extraExplanation":["“Peseta”是西班牙语词，来源与“小片/小重量（银）”有关，早期与铸币大小和金属价值相关。","西班牙在2002年改用欧元（€）后，比塞塔停止流通；常见于历史、回忆、旧小说/电影台词和旅游纪念品语境。","换算关系：1欧元=166.386比塞塔（固定汇率）。"]}
{"word":"pesewa","summary":{"en":"Pesewa is the Ghanaian “cent,” equal to one-hundredth of a cedi.","zh":"Pesewa（佩塞瓦）是加纳的“分”，等于1/100塞地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a monetary unit in Ghana worth one hundredth (1/100) of a cedi; similar to a “cent” in the U.S.","zh":"加纳的货币单位，等于1/100塞地（cedi）；类似于美国的“分”（cent）。"},"examples":[{"en":"This bread costs 3 cedis and 50 pesewas.","zh":"这条面包要3塞地50佩塞瓦。"},{"en":"I don’t have any coins—only a few pesewas left in my wallet.","zh":"我没有硬币——钱包里只剩下几枚佩塞瓦。"}]}],"synonyms":["cent (rough equivalent, not the same currency)"],"phonetic":"/pəˈsiːwə/","extraExplanation":["“pesewa”是加纳货币体系中的辅币单位：1 cedi = 100 pesewas。日常表达价格时，常用“cedis and pesewas”的结构（例如：2 cedis 30 pesewas）。","词源上常被认为与西非地区历史上使用的“cowrie shells（贝壳货币）”及相关本地语言称呼有关；在英语里它作为加纳货币名词使用。"]}
{"word":"pesewas","summary":{"en":"“Pesewas” means Ghanaian cents: the plural of pesewa, the smallest unit of the cedi.","zh":"“Pesewas”指加纳货币的“分”：pesewa 的复数，是塞地（cedi）的最小单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of pesewa: the smallest unit of Ghana’s currency (100 pesewas = 1 cedi).","zh":"pesewa 的复数：加纳货币的最小单位（100 pesewas = 1 cedi）。"},"examples":[{"en":"This bottle of water costs 50 pesewas.","zh":"这瓶水要 50 pesewas（50 比塞瓦）。"},{"en":"I only have a few pesewas left in my pocket.","zh":"我口袋里只剩下几枚 pesewas 了。"},{"en":"The price went up by ten pesewas.","zh":"价格涨了 10 pesewas。"}]}],"synonyms":["Ghanaian cents","cents (informal comparison)"],"phonetic":"/pəˈseɪwəz/","extraExplanation":["“pesewa”来自加纳的货币体系：1 cedi（塞地）= 100 pesewas。日常交流中，有时人们也会直接说“cedis and pesewas”（塞地和比塞瓦）来表达金额的整数与小数部分。","英语里复数形式通常加 -s：pesewa → pesewas；当数字后面作单位时，也常见用复数：“50 pesewas”。"]}
{"word":"peshito","summary":{"en":"Peshito is the Syriac (Aramaic) Bible, a traditional and widely used version in Syriac Christianity.","zh":"Peshito 指叙利亚语（亚兰语）《圣经》通行本，是叙利亚基督教传统中重要且常用的译本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the standard Syriac (Aramaic) version of the Bible, widely used in Syriac Christian traditions; also spelled “Peshitta.”","zh":"《佩希塔》（叙利亚语/亚兰语《圣经》通行本），叙利亚基督教传统中广泛使用的《圣经》译本；也常拼作 Peshitta。"},"examples":[{"en":"Scholars compare the Peshito with the Greek manuscripts to study early Bible translations.","zh":"学者会把《佩希塔》和希腊文手稿对照，用来研究早期《圣经》译本。"},{"en":"In some Syriac churches, readings may be taken from the Peshito.","zh":"在一些叙利亚传统教会中，经文诵读可能取自《佩希塔》。"}]}],"synonyms":["Peshitta","Syriac Bible"],"phonetic":"/pəˈʃiːtoʊ/","extraExplanation":["“Peshito / Peshitta”来自叙利亚语，常被解释为“简单的、通行的（版本）”。它不是现代英语常用词，更多出现在宗教学、古代语言学、圣经研究等语境中。","英语资料里更常见的拼写是 Peshitta；Peshito 也会出现，属于拼写变体。","在学术写作中通常需要把它斜体或首字母大写，并在第一次出现时说明其为“Syriac Bible / Syriac version of the Bible”。"]}
{"word":"peshkar","summary":{"en":"A peshkar is a South Asian term (often historical) for a clerk or administrative assistant, especially in court or revenue offices.","zh":"peshkar 指（多见于南亚历史语境的）书记员或行政助理，常与法院或税务/财政机构相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In South Asia (especially in historical contexts), a clerk, assistant, or administrative aide who helps manage paperwork, accounts, or official duties.","zh":"（南亚，尤指历史语境）书记员、助理、行政文书；协助处理文书、账目或公务的人。"},"examples":[{"en":"The peshkar prepared the documents before the judge arrived.","zh":"法官到来之前，书记员（peshkar）先把文件准备好了。"},{"en":"He worked as a peshkar in the district office, keeping records and accounts.","zh":"他在地区办公室当文书（peshkar），负责登记记录和账目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical British India) A revenue or court official’s clerk/agent, often involved in collecting or managing taxes and administrative fees.","zh":"（英属印度时期）税务或法院官员的书记/代理人，常参与征收或管理税款及行政费用。"},"examples":[{"en":"In colonial records, the peshkar is listed as an intermediary in the revenue process.","zh":"在殖民时期的档案中，peshkar 被记为税收流程中的中间人。"}]}],"synonyms":["clerk","assistant","scribe","court clerk","administrative aide"],"phonetic":"/ˈpɛʃkɑr/","extraExplanation":["“peshkar”一词常见于印度、巴基斯坦等地的历史材料与殖民时期英文文献中，带有明显的时代与地域色彩。现代日常英语里不常用，更多会用 clerk / assistant / court clerk 等更通用的说法。","词源上多认为来自波斯语体系（经由乌尔都语/印地语等进入英语），在旧式官署与法院体系里指负责文书、账目、呈报与跑腿协调的关键岗位。"]}
{"word":"peshkash","summary":{"en":"Peshkash means a formally presented gift/tribute to a ruler or powerful person, and by extension can mean a bribe given to gain favor.","zh":"peshkash 指正式献给君主或权贵的礼物／贡礼；引申也可指为求关照而送的贿赂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gift or tribute formally presented to a ruler or powerful person, especially in historical Persian, Mughal, and South Asian contexts.","zh":"（尤指历史上波斯、莫卧儿及南亚语境中的）进献给君主或权贵的礼物／贡礼。"},"examples":[{"en":"The ambassador brought a peshkash to the court as a sign of respect.","zh":"使节带着 peshkash 进宫，以示敬意。"},{"en":"Local chiefs were expected to send peshkash each year.","zh":"地方首领通常被要求每年进献 peshkash。"}]},{"partOfSpeech":"n.","definition":{"en":"A “gift” given to someone in authority to gain favor; a bribe (often used in colonial-era writing about administration).","zh":"给掌权者以求关照的“礼物”；贿赂（常见于殖民时期关于行政的写作中）。"},"examples":[{"en":"He offered a peshkash to speed up the paperwork.","zh":"他送上 peshkash 想让手续办得快一点。"},{"en":"The report criticized officials who demanded peshkash from villagers.","zh":"报告批评了向村民索要 peshkash 的官员。"}]}],"synonyms":["tribute","offering","gift","bribe","kickback"],"phonetic":"/pɛʃˈkɑʃ/","extraExplanation":["peshkash 源自波斯语（常写作 pīshkash/پیشکش），字面有“呈上、奉上”的意思。在历史语境里，它既可能是正式的贡礼或礼物，也可能演变为带有“打点、行贿”意味的用法，具体含义常要看上下文与权力关系。","这个词常出现在关于莫卧儿帝国、印度土邦、或殖民行政的英文史料/游记里。现代日常英语中不常用，更偏历史、文化或学术写作。"]}
{"word":"peshwa","summary":{"en":"A Peshwa was the powerful chief minister (prime minister) of the Maratha Empire in Indian history.","zh":"佩什瓦是印度历史上马拉塔帝国权势很大的首席大臣（类似首相/宰相）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Indian history) the chief minister (prime minister) of the Maratha Empire, especially influential from the 1700s until British control.","zh":"（印度历史）马拉塔帝国的首席大臣/宰相（类似首相），尤指18世纪至英国势力控制前后影响力很大的职位。"},"examples":[{"en":"The Peshwa governed from Pune and helped expand Maratha power across India.","zh":"佩什瓦以浦那为中心执政，推动马拉塔势力在印度各地扩张。"},{"en":"In the late 18th century, the Peshwa often held more practical power than the Maratha king.","zh":"在18世纪后期，佩什瓦往往比马拉塔国王掌握更实际的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds (or is described as holding) the office/title of Peshwa.","zh":"担任“佩什瓦”这一官职/头衔的人。"},"examples":[{"en":"Bajirao I is remembered as one of the most successful Peshwas.","zh":"巴吉拉奥一世被认为是最成功的佩什瓦之一。"},{"en":"The last Peshwa was defeated by the British in 1818.","zh":"最后一位佩什瓦在1818年被英国击败。"}]}],"synonyms":["chief minister","prime minister","vizier (rough equivalent)"],"phonetic":"ˈpeɪʃwə","extraExplanation":["“Peshwa”源自波斯语词根，含义与“领袖/前导者”相关，后来在马拉塔政权中成为最高行政官职。","在历史叙述里常见“Peshwa of Pune（浦那的佩什瓦）”这种说法，因为浦那是佩什瓦的政治中心。","文学与历史写作中，它通常作为专有名词出现，首字母大写（the Peshwa），用来指某一时期的政治权力核心。"]}
{"word":"peshwaship","summary":{"en":"Peshwaship means the office, tenure, or rule of a peshwa in the Maratha Empire.","zh":"Peshwaship 指马拉塔帝国中佩什瓦的职位、任期或其统治时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or period of rule of a peshwa (the chief minister who became the de facto leader in the Maratha Empire in India).","zh":"（印度马拉塔帝国中）佩什瓦（Peshwa，原为宰相、后常为实际统治者）的职位、任期或其统治时期。"},"examples":[{"en":"The decline of the Mughal Empire created space for the expansion of the peshwaship.","zh":"莫卧儿帝国的衰落为佩什瓦政权的扩张提供了空间。"},{"en":"Under the peshwaship, Pune became an important political center.","zh":"在佩什瓦统治时期，浦那成为重要的政治中心。"},{"en":"Historians debate how the peshwaship changed from a ministerial role to real executive power.","zh":"历史学家讨论佩什瓦职位如何从“辅佐大臣”转变为真正的行政权力中心。"}]}],"synonyms":["the office of the peshwa","peshwa rule","peshwa administration","premiership (context-dependent)"],"phonetic":"ˈpeɪʃwəʃɪp","extraExplanation":["“peshwaship”由“Peshwa（佩什瓦）+ -ship（表示‘身份/职位/状态/任期’）”构成，类似于“leadership（领导地位）”“kingship（王权）”。","Peshwa一词源自波斯语，原意接近“前行者/领路者”，在马拉塔国家体制中最初是首席大臣，后来在18世纪常成为事实上的最高掌权者，因此“peshwaship”常带有“佩什瓦政权/佩什瓦时期”的历史语境。"]}
{"word":"peskier","summary":{"en":"“Peskier” means “more annoying or troublesome.”","zh":"“Peskier”表示“更烦人/更麻烦”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “pesky”: more annoying or troublesome (often in a small but persistent way).","zh":"“pesky”的比较级：更烦人的、更麻烦的（通常指小事但很纠缠、很难摆脱）。"},"examples":[{"en":"These mosquitoes are even peskier at dusk.","zh":"黄昏时这些蚊子更烦人。"},{"en":"The second math problem was peskier than the first one.","zh":"第二道数学题比第一道更棘手。"},{"en":"His peskier questions made the interview run long.","zh":"他更刁钻的问题让采访拖得很久。"}]}],"synonyms":["more annoying","more troublesome","more irritating","more bothersome"],"phonetic":"/ˈpɛskiər/","extraExplanation":["“peskier”是形容词“pesky”的比较级，常见搭配是“even/so/much peskier”和“peskier than…”。","“pesky”语气通常偏口语、带一点无奈或抱怨，但不一定很严重；比起“serious”或“dangerous”，它更像“烦、缠人、难搞”。","最高级是“peskiest”：The peskiest part is the paperwork.（最麻烦的部分是文书。）"]}
{"word":"peskiest","summary":{"en":"“Peskiest” means “the most annoying or troublesome,” often about small but persistent problems.","zh":"“Peskiest”表示“最烦人/最麻烦的”，多指小事但很缠人、反复出现的麻烦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “pesky”) the most annoying, bothersome, or troublesome—especially in a small but persistent way.","zh":"（“pesky”的最高级）最烦人的、最讨厌的、最麻烦的（通常指小事却很持续、很缠人）。"},"examples":[{"en":"Mosquitoes are the peskiest part of camping in the summer.","zh":"蚊子是夏天露营时最烦人的一件事。"},{"en":"This is the peskiest problem in the whole project because it keeps coming back.","zh":"这是整个项目里最棘手/最烦人的问题，因为它总是反复出现。"},{"en":"Of all the chores, cleaning sticky spills is the peskiest.","zh":"在所有家务里，清理黏乎乎的洒漏物最麻烦。"}]}],"synonyms":["most annoying","most bothersome","most troublesome","most irritating"],"phonetic":"/ˈpɛs.ki.əst/","extraExplanation":["“peskiest”是形容词“pesky”的最高级，常见结构是：pesky → peskier → peskiest。语气偏口语、轻微抱怨，通常不算很粗鲁。","“pesky”常用来形容小问题、昆虫、反复出现的麻烦事；比“serious/critical”更轻一些，但强调“烦、缠人”。"]}
{"word":"peskily","summary":{"en":"“Peskily” means “in an annoying, pesky way,” often describing small but persistent trouble.","zh":"“Peskily”表示“以烦人、纠缠不休的方式”，常形容小却持续的麻烦。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an annoying or troublesome way, often in a persistent small way.","zh":"以讨厌或麻烦的方式（常指那种不断纠缠、让人烦的小麻烦）。"},"examples":[{"en":"The flies buzzed peskily around our food.","zh":"苍蝇在我们的食物周围烦人地嗡嗡乱飞。"},{"en":"A peskily persistent error kept showing up in the report.","zh":"报告里一个烦人的、反复出现的错误总是冒出来。"},{"en":"The child tugged peskily at her sleeve while she was on the phone.","zh":"她打电话时，孩子一直烦人地扯她的袖子。"}]}],"synonyms":["annoyingly","irritatingly","bothersomely","troublesomely","persistently"],"phonetic":"/ˈpɛskəli/","extraExplanation":["“peskily”来自形容词“pesky”（口语、非正式，表示“烦人的、讨厌的”）。在日常英语里，人们更常说“annoyingly / persistently / in a pesky way”，所以“peskily”本身相对少见，但在写作中用来强调“小但磨人的烦恼”很贴切。"]}
{"word":"peskiness","summary":{"en":"Peskiness means persistent, small-scale annoyance.","zh":"Peskiness 指持续的、小而烦人的恼人感/烦人行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being annoying in a persistent way; constant small irritation.","zh":"惹人烦的特质；（持续的）烦人、纠缠不休的感觉。"},"examples":[{"en":"The peskiness of the notifications made it hard to focus.","zh":"通知不断弹出，这种烦人的劲儿让人很难专心。"},{"en":"He apologized for the peskiness of his repeated questions.","zh":"他为自己一再提问的烦人行为道了歉。"}]}],"synonyms":["annoyance","irritation","bother","nuisance"],"phonetic":"/ˈpɛskinəs/","extraExplanation":["“peskiness”来自形容词“pesky”（烦人的、讨厌的），常用来形容“小但持续”的打扰，比起“anger（愤怒）”更像“被烦到”的感觉。","语气通常偏口语、略带轻微抱怨，有时也可带一点幽默：不是很严重的冒犯，但确实让人受不了。","常见搭配：the peskiness of…（……的烦人之处）；minor peskiness（小小的烦恼）；deal with the peskiness（应付这种烦人事）。"]}
{"word":"pesky","summary":{"en":"“Pesky” means persistently annoying or troublesome, usually about small but irritating things.","zh":"“pesky”表示“反复让人心烦的、讨厌的”，多用于不大但很烦的小问题或事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Annoying in a persistent, troublesome way (often about small problems, people, or insects).","zh":"讨厌的；烦人的（多指小麻烦、人或昆虫，因反复出现而让人心烦）。"},"examples":[{"en":"These pesky mosquitoes keep biting me.","zh":"这些讨厌的蚊子一直咬我。"},{"en":"I have a pesky little problem with my laptop—it keeps freezing.","zh":"我的笔记本电脑有个烦人的小问题——它总是死机。"}]}],"synonyms":["annoying","bothersome","irritating","troublesome","nagging"],"phonetic":"/ˈpɛski/","extraExplanation":["“pesky”语气通常偏口语、带一点无奈或抱怨，但比“hateful/terrible”更轻，常用于“让人烦但不算严重”的情况。","常见搭配：pesky mosquito/insect（讨厌的蚊虫）；pesky problem/issue（烦人的问题）；those pesky + 复数名词（那些烦人的……）。","词源上与“pester”（纠缠、打扰）有关，所以核心感觉是“反复来烦你”。在儿童读物、轻松叙述或幽默语境里很常见。"]}
{"word":"peso","summary":{"en":"Peso is the currency unit used in several countries (especially Mexico and the Philippines).","zh":"Peso（比索）是多个国家（尤其墨西哥、菲律宾等）使用的货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic currency unit of several countries, especially Mexico and the Philippines","zh":"比索：多个国家（尤指墨西哥、菲律宾等）的基本货币单位"},"examples":[{"en":"How many pesos is this in U.S. dollars?","zh":"这是多少比索，换成美元是多少？"},{"en":"I paid 200 pesos for lunch in Mexico City.","zh":"在墨西哥城我花了200比索吃午饭。"}]},{"partOfSpeech":"n.","definition":{"en":"a coin (or sometimes a banknote) worth one peso, depending on the country","zh":"一比索的硬币（有时也指一比索面额的纸币，视国家而定）"},"examples":[{"en":"Do you have a peso coin for the vending machine?","zh":"你有一枚一比索硬币投自动售货机吗？"}]}],"synonyms":["Mexican peso","Philippine peso","currency","money"],"phonetic":"/ˈpeɪsoʊ/","extraExplanation":["“peso”源自西班牙语，原意与“重量”有关（同源于表示“重”的词根）。","英语里通常直接用“peso(s)”指代当地货币：如“Mexican pesos / Philippine pesos”。复数一般加 -s：one peso, two pesos。","书写时常见货币符号依国家不同而异：例如墨西哥常用“$”或“MX$”，菲律宾常用“₱”。语境通常会说明是哪国比索。"]}
{"word":"pesos","summary":{"en":"“Pesos” means the plural of “peso,” a currency unit used in several countries (e.g., Mexico).","zh":"“pesos”是“peso（比索）”的复数，指多国使用的货币单位（如墨西哥比索）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The basic unit of money used in several Spanish-speaking countries (and the Philippines), such as Mexico, Argentina, Chile, and Colombia; plural of “peso.”","zh":"“比索”的复数：多个西班牙语国家（以及菲律宾）使用的货币单位，如墨西哥、阿根廷、智利、哥伦比亚等。"},"examples":[{"en":"These tacos cost 50 pesos.","zh":"这些墨西哥卷饼要50比索。"},{"en":"I exchanged dollars for pesos at the airport.","zh":"我在机场把美元换成了比索。"},{"en":"The price went up from 200 to 250 pesos.","zh":"价格从200比索涨到250比索。"}]}],"synonyms":["peso(s)","Mexican peso(s)","Argentine peso(s)","Philippine peso(s)"],"phonetic":"/ˈpeɪsoʊz/","extraExplanation":["“peso”原意与“重量”有关，来自西班牙语，历史上常指一枚固定重量的银币，因此很多地区后来把本国货币称为peso。","不同国家的“peso”价值不一样；旅行或网购时最好确认是哪个国家的比索（例如Mexican pesos / Argentine pesos）。"]}
{"word":"pess","summary":{"en":"“pess” is an informal short form for “pessimistic/pessimist,” or it can be the acronym “PESS” with context-specific meanings.","zh":"“pess”多为“pessimistic/pessimist（悲观的/悲观者）”的非正式简称；也可能是缩略词“PESS”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) A shortened form of “pessimist” or “pessimistic,” used in casual speech, texting, or notes.","zh":"（非正式）“pessimist（悲观的人）”或“pessimistic（悲观的）”的缩写/简称，常见于口语、短信或笔记。"},"examples":[{"en":"Don’t be such a pess—let’s see what happens first.","zh":"别这么悲观——先看看会发生什么吧。"},{"en":"I’m feeling a bit pess about the results.","zh":"我对结果有点悲观。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym “PESS” can stand for different things in different fields, so its meaning depends on context (for example, an organization name, a technical system, or a school program).","zh":"“PESS”也可能是首字母缩略词，在不同领域含义不同（例如机构名称、技术系统或学校项目等），需要看具体语境。"},"examples":[{"en":"What does PESS stand for in this document?","zh":"这份文件里的 PESS 是什么的缩写？"},{"en":"Our lab uses the PESS system for scheduling.","zh":"我们实验室用 PESS 系统来排班。"}]}],"synonyms":["pessimistic (full form)","pessimist (full form)","negative (informal, similar meaning)"],"phonetic":"/pɛs/","extraExplanation":["“pess”不是标准书面英语里的常用词，更常见于比较随意的场合（聊天、社交媒体、个人笔记）。正式写作里建议用“pessimistic / pessimist”。","如果你其实想查的是“pest（害虫；讨厌的人）”或“pessimism（悲观主义）”，告诉我你的句子，我可以一起对比讲解。"]}
{"word":"pessaries","summary":{"en":"“Pessaries” is the plural of “pessary”: usually a vaginal support device for prolapse/incontinence; in British/older use, it can also mean a medicated vaginal suppository.","zh":"“pessaries”是“pessary”的复数：通常指用于脱垂/尿失禁的阴道支撑器（子宫托）；在英式或较旧用法中也可指含药的阴道栓剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical device placed in the vagina to support pelvic organs (such as the uterus or bladder), often used for pelvic organ prolapse or stress urinary incontinence","zh":"（阴道）子宫托：放入阴道内用于支撑盆腔器官（如子宫、膀胱）的医疗器械，常用于盆腔器官脱垂或压力性尿失禁"},"examples":[{"en":"Her doctor recommended a pessary to help manage pelvic organ prolapse.","zh":"医生建议她使用子宫托来帮助处理盆腔器官脱垂。"},{"en":"The nurse taught her how to remove and clean the pessary safely.","zh":"护士教她如何安全取出并清洁子宫托。"}]},{"partOfSpeech":"n.","definition":{"en":"a small medicated solid that is inserted into the vagina (or sometimes the rectum) and dissolves to release medicine; a suppository (British/older use)","zh":"（英式/较旧用法）阴道（或有时直肠）栓剂：一种含药固体，置入体内后溶解释放药物；类似“suppository（栓剂）”"},"examples":[{"en":"The pharmacist explained how to use the vaginal pessary at night.","zh":"药剂师说明了如何在夜间使用阴道栓剂。"},{"en":"In some British instructions, a yeast infection treatment may be called a “pessary.”","zh":"在一些英式说明书中，治疗念珠菌感染的药可能会被称为“pessary（栓剂）”。"}]}],"synonyms":["vaginal pessary","support pessary","suppository (for the medicated meaning)"],"phonetic":"/ˈpɛsəriz/","extraExplanation":["“pessaries”是复数形式；单数是“pessary”。","在美式英语的医学语境里，“pessary”更常指“子宫托/阴道支撑器”；而“栓剂”更常用“suppository”。因此阅读说明书时注意英式与美式用词差异。","这是与私密部位相关的医疗词汇，正式场合可用更中性的表达，如“a vaginal support device（阴道支撑器）”或直接说“a pessary prescribed by my doctor（医生开的子宫托）”。"]}
{"word":"pessary","summary":{"en":"A pessary is a medical device inserted into the vagina to support pelvic organs; historically it can also mean a vaginal medicated insert.","zh":"pessary 指放入阴道内用于支撑盆腔器官的医疗器械（子宫托/阴道托）；历史上也可指阴道用药栓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical device placed in the vagina to support pelvic organs (such as the uterus or bladder), often used to help pelvic organ prolapse or stress urinary incontinence.","zh":"（医学）子宫托／阴道托：放入阴道内用来支撑盆腔器官（如子宫、膀胱）的器械，常用于盆腔器官脱垂或压力性尿失禁。"},"examples":[{"en":"The doctor recommended a pessary to help manage her pelvic organ prolapse without surgery.","zh":"医生建议使用子宫托来帮助控制盆腔器官脱垂，以避免手术。"},{"en":"She was taught how to remove, clean, and reinsert the pessary safely.","zh":"她学习了如何安全地取出、清洁并重新放入子宫托。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, historical) A vaginal insert used to deliver medication, especially for gynecological treatment.","zh":"（较少见／历史用法）阴道栓剂或阴道用药栓：放入阴道以递送药物的制剂，多见于旧式或较传统的说法。"},"examples":[{"en":"In older medical texts, a medicated pessary might be prescribed for local treatment.","zh":"在较早的医学文献中，可能会开具“含药的pessary”用于局部治疗。"}]}],"synonyms":["vaginal pessary","ring pessary","support pessary","vaginal insert (historical/medicated sense)"],"phonetic":"/ˈpɛsəri/","extraExplanation":["“pessary”常见于妇科与泌尿妇科语境，属于较正式、医学化的词；日常交流中也可能听到更具体的说法，如“ring pessary（环形子宫托）”。","使用子宫托通常需要医生评估尺寸与类型，并定期复查；与此相关的表达可学：pelvic organ prolapse（盆腔器官脱垂）、stress urinary incontinence（压力性尿失禁）、fit a pessary（为…配托/试戴）。"]}
{"word":"pessi","summary":{"en":"“Pessi” is informal slang meaning “pessimistic” or “pessimist.” Use “pessimistic/pessimist” in formal English.","zh":"“pessi”是非正式网络缩写，表示“悲观的/悲观者”。正式场合建议用“pessimistic / pessimist”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, internet slang) Short for “pessimistic” or “pessimist”; describing someone who expects bad outcomes, or a person who tends to expect the worst.","zh":"（非正式/网络用语）“pessimistic（悲观的）”或“pessimist（悲观者）”的缩写；形容一个人总觉得事情会往坏的方向发展，或指这样的一个人。"},"examples":[{"en":"Don’t be so pessi—there’s still a chance we can fix it.","zh":"别这么悲观——我们还是有机会把它修好的。"},{"en":"He’s usually pessi about exams, but he actually studies hard.","zh":"他通常对考试很悲观，但其实学习很努力。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, internet slang) A pessimistic person; someone who expects negative results.","zh":"（非正式/网络用语）悲观的人；总预期会有负面结果的人。"},"examples":[{"en":"Stop being a pessi and help us think of solutions.","zh":"别当悲观派了，帮我们一起想解决办法吧。"},{"en":"I’m not a pessi—I just like to plan for worst-case scenarios.","zh":"我不是悲观者——我只是喜欢为最坏情况做准备。"}]}],"synonyms":["pessimistic","negative","downbeat","gloomy","pessimist"],"phonetic":"/ˈpɛsi/","extraExplanation":["“pessi”并不是标准英语词典里的常用词，更像是聊天里的口语缩写（clipping）。正式写作或考试中建议用“pessimistic / pessimist”。","常见搭配：be pessimistic about…（对……悲观）；a pessimist vs. an optimist（悲观者 vs. 乐观者）。","注意语气：当你说“Don’t be pessi”时，可能带一点调侃或轻微批评；对不熟的人使用要更谨慎。"]}
{"word":"pessim","summary":{"en":"“Pessim” is an informal, uncommon shortening of “pessimist” or “pessimism.” Use the full words in standard English.","zh":"“pessim”是“pessimist / pessimism”的非正式、较少见简写；标准英语里建议用完整词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal, uncommon) A shortened form of “pessimist” or “pessimism,” used mainly in casual notes, chats, or wordplay; not standard in formal writing.","zh":"（非正式、较少见）“pessimist（悲观主义者）”或“pessimism（悲观主义）”的缩写/简写，多见于随手记录、聊天或文字游戏；正式写作中不常用。"},"examples":[{"en":"Don’t mind my pessim—I’m just tired today.","zh":"别介意我这么“悲观”（pessim），我今天只是太累了。"},{"en":"In his notes, he wrote “optim vs. pessim” to compare attitudes.","zh":"他在笔记里写了“乐观（optim）vs. 悲观（pessim）”来对比不同态度。"}]}],"synonyms":["pessimist","pessimism","pessimistic","cynic (sometimes, but not the same)"],"phonetic":"/ˈpɛsɪm/","extraExplanation":["“pessim”本身不是常见词条，更像是把 pessimist / pessimism 截短后的临时用法（类似把 optimistic 写成 optim）。在学习和写作中，建议使用标准形式：\n- pessimist（n. 悲观主义者）\n- pessimism（n. 悲观主义；悲观情绪）\n- pessimistic（adj. 悲观的）","在文学或正式语境里几乎不会用 “pessim”；若在填字游戏、社交媒体或个人笔记中看到，多半就是为了省字数或图方便。"]}
{"word":"pessimal","summary":{"en":"Pessimal means “the worst possible,” often used formally as the opposite of “optimal.”","zh":"pessimal 意为“最坏的/尽可能糟糕的”，常作正式用语，与 optimal（最优）相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) The worst possible; as bad as it can be.","zh":"（正式）最坏的；尽可能糟糕的。"},"examples":[{"en":"Choosing that route at rush hour is a pessimal decision.","zh":"在高峰期选那条路线是个最坏的决定。"},{"en":"The experiment ran under pessimal conditions, so the results were unreliable.","zh":"实验在最糟糕的条件下进行，所以结果不可靠。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/Economics, formal) Describes a value or solution that is the opposite of optimal—one that minimizes rather than maximizes what you want (or maximizes what you want to avoid).","zh":"（数学/经济学，正式）指与 optimal（最优）相反的取值或解——不是让目标变得更好，而是把效果弄到最差（或把你想避免的东西推到最大）。"},"examples":[{"en":"In this model, the pessimal strategy leads to the lowest payoff.","zh":"在这个模型里，最差策略会带来最低收益。"},{"en":"They tested both the optimal and pessimal cases to show the range of outcomes.","zh":"他们测试了最优和最差两种情况，以展示结果范围。"}]}],"synonyms":["worst","least favorable","most unfavorable","as bad as possible"],"phonetic":"/ˈpɛsɪməl/","extraExplanation":["pessimal 来自拉丁语 pessimus（“最坏的”），与 optimal（最优的）常成对出现。日常英语里更常用 worst / the worst possible；pessimal 多见于学术、技术或较正式的写作。","常见搭配：pessimal outcome（最坏结果）、pessimal conditions（最差条件）、pessimal choice/decision（最坏选择/决定）。"]}
{"word":"pessimism","summary":{"en":"Pessimism means a habit or belief of expecting negative outcomes; it can also describe a broader worldview that life won’t improve much.","zh":"pessimism 指“悲观”：习惯性预期坏结果；也可指更广义的“悲观主义”世界观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to expect bad results or focus on the negative side of situations; the belief that things will probably go wrong.","zh":"悲观（倾向）；对事情抱持负面预期、认为结果多半会变坏的看法。"},"examples":[{"en":"Her pessimism made her assume the interview would go badly, even though she was well prepared.","zh":"她的悲观让她以为面试会很糟，尽管她准备得很充分。"},{"en":"A little caution is helpful, but constant pessimism can drain your motivation.","zh":"适度的谨慎有帮助，但持续的悲观会消磨你的动力。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy or general worldview, the belief that life is full of suffering and that improvement is unlikely.","zh":"（哲学/世界观）悲观主义：认为人生以痛苦为主，且改善可能性不大的一种观点。"},"examples":[{"en":"Some novels explore pessimism about human nature and society.","zh":"一些小说会探讨对人性与社会的悲观主义。"},{"en":"His pessimism wasn’t just about one problem—it shaped his whole view of the future.","zh":"他的悲观不只针对某一个问题，而是影响了他对未来的整体看法。"}]}],"synonyms":["negativity","cynicism","gloom","defeatism"],"phonetic":"/ˈpɛsəˌmɪzəm/","extraExplanation":["“pessimism”常与“optimism（乐观）”成对出现。日常英语里它通常指一种习惯性的心态（总往坏处想），不一定是严肃的哲学立场。","词源提示：来自拉丁语 pessimus（“最坏的”）。因此它的核心感觉是“预期最坏结果”。","常见搭配：deep/growing pessimism（深深的/日益加重的悲观），economic pessimism（对经济前景的悲观），pessimism about + 名词（对……的悲观）。","语气与文化：英语里说 someone is pessimistic 往往带一点批评或担心（暗示对方太消极）。若想更中性，可说 cautious（谨慎）或 realistic（务实/现实）。"]}
{"word":"pessimisms","summary":{"en":"“Pessimisms” means multiple pessimistic attitudes or statements, or (in academic contexts) different forms of pessimistic thought.","zh":"“pessimisms”指多种悲观的态度/说法；在学术语境中也可指不同类型的悲观思想或悲观主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural form of “pessimism”: multiple pessimistic attitudes, beliefs, or statements (ways of expecting bad outcomes).","zh":"“pessimism”的复数：多种悲观态度、看法或说法（倾向于预期坏结果的方式）。"},"examples":[{"en":"Her essays explore different pessimisms about politics and human nature.","zh":"她的文章探讨了关于政治与人性的不同悲观观点。"},{"en":"We should question our pessimisms and look at the evidence calmly.","zh":"我们应该质疑自己的悲观想法，并冷静地看证据。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy or criticism, different theories or traditions that emphasize suffering, limitation, or a generally negative view of life.","zh":"在哲学或评论语境中：强调痛苦、局限或对人生总体持负面看法的不同理论/传统。"},"examples":[{"en":"The course compares Romantic optimism with modern pessimisms.","zh":"这门课比较了浪漫主义的乐观与现代的多种悲观主义。"}]}],"synonyms":["negative outlooks","gloomy views","cynicisms (close but not identical)","defeatist attitudes"],"phonetic":"/ˈpɛsəˌmɪzəmz/","extraExplanation":["“pessimisms”是可数复数用法，常见于学术写作，表示“多种类型的悲观（观点/论调）”，而不是单一的性格特质。","词源上与拉丁语“pessimus”（最坏的）有关；因此它常带有“把情况往最坏处想”的色彩。"]}
{"word":"pessimist","summary":{"en":"A pessimist is someone who tends to expect negative outcomes.","zh":"pessimist 指倾向于预期负面结果、看问题更悲观的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who usually expects bad things to happen or focuses on the negative side of a situation.","zh":"悲观主义者；总是预期坏事发生、或更关注事情负面的人。"},"examples":[{"en":"He’s not a pessimist—he just likes to prepare for the worst.","zh":"他不一定是悲观主义者——他只是喜欢为最坏的情况做准备。"},{"en":"A pessimist might see a problem where others see an opportunity.","zh":"悲观的人可能在别人看到机会时，却先看到问题。"}]}],"synonyms":["negative person","doom-and-gloom type","cynic (close, but not the same)"],"phonetic":"/ˈpɛsəmɪst/","extraExplanation":["“pessimist”常与“optimist（乐观主义者）”成对出现：前者倾向强调风险与困难，后者倾向强调希望与可能性。日常交流中，说别人是“pessimist”有时带批评意味；更委婉的说法可以用“cautious（谨慎的）”或“realistic（现实的）”。","词源上来自拉丁语“pessimus（最坏的）”，因此它的核心含义就是“往最坏处想/认为结果可能很糟”。","文学或写作里，“pessimist”常用来刻画人物性格：例如一句常见对照写法是“The optimist sees the glass half full; the pessimist sees it half empty.”（乐观者看见杯子半满；悲观者看见杯子半空。）"]}
{"word":"pessimistic","summary":{"en":"“Pessimistic” describes someone who expects negative outcomes or believes things will go badly.","zh":"“pessimistic”表示“悲观的”，指总预期负面结果、觉得事情会变糟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"expecting bad things to happen; focusing more on the negative than the positive","zh":"悲观的；倾向于预期坏结果、更多关注负面而非正面"},"examples":[{"en":"He’s pessimistic about the economy and thinks prices will keep rising.","zh":"他对经济很悲观，认为物价还会继续上涨。"},{"en":"Don’t be pessimistic—there’s still time to fix the problem.","zh":"别那么悲观——我们还有时间解决这个问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person or attitude) tending to believe that efforts will fail or that the worst outcome is likely","zh":"（指人或态度）认为努力多半会失败、最糟结果更可能发生的"},"examples":[{"en":"Her pessimistic attitude made teamwork harder.","zh":"她悲观的态度让团队合作更困难。"},{"en":"A pessimistic view can protect you from disappointment, but it can also stop you from trying.","zh":"悲观的看法可能让你少失望，但也可能让你不敢去尝试。"}]}],"synonyms":["negative","downbeat","gloomy"],"phonetic":"/ˌpɛsəˈmɪstɪk/","extraExplanation":["词形相关：pessimist（悲观主义者/悲观的人），pessimism（悲观主义/悲观看法），pessimistically（悲观地）。","常见搭配：be pessimistic about…（对……悲观）；a pessimistic outlook/view（悲观的前景/观点）。反义词常用 optimistic（乐观的）。","词源小提示：来自拉丁语 pessimus（“最坏的”），所以 pessimistic 带有“往最坏处想”的意味。"]}
{"word":"pessimistically","summary":{"en":"“Pessimistically” means doing or thinking in a way that expects negative outcomes and shows little hope.","zh":"“pessimistically”表示以悲观方式做事或思考，倾向于预期负面结果、缺乏希望。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that expects bad results or focuses on the worst possible outcome.","zh":"以悲观的方式；倾向于预期坏结果或把情况往最坏处想。"},"examples":[{"en":"She spoke pessimistically about the economy, expecting more job losses.","zh":"她悲观地谈论经济，认为会有更多人失业。"},{"en":"Don’t plan pessimistically—look at the facts and different possibilities.","zh":"别悲观地做计划——看看事实和不同的可能性。"}]},{"partOfSpeech":"adv.","definition":{"en":"With a negative attitude, showing little hope or confidence about people or the future.","zh":"以消极、缺乏希望或信心的态度（看待人或未来）。"},"examples":[{"en":"He laughed pessimistically and said the project would never work.","zh":"他悲观地笑了笑，说这个项目根本不可能成功。"},{"en":"She tends to think pessimistically when she’s under stress.","zh":"她压力大时容易悲观地思考。"}]}],"synonyms":["negatively","bleakly","gloomily","doomfully"],"phonetic":"/ˌpɛsəˈmɪstɪkli/","extraExplanation":["“pessimistically”来自形容词“pessimistic（悲观的）”，再加上副词后缀“-ly”，表示“以……的方式”。","常见搭配：think/speak/view something pessimistically（悲观地想/说/看待）；pessimistically about（对……感到悲观）。","语用提示：它多用来描述说话者的态度或判断倾向；如果想更中性，可以用“cautiously（谨慎地）”“realistically（务实地）”。"]}
{"word":"pessimists","summary":{"en":"“Pessimists” are people who usually expect negative outcomes or focus on potential problems.","zh":"“pessimists”指悲观主义者：通常预期负面结果、强调潜在问题的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who tend to expect bad outcomes or focus on what might go wrong (plural of “pessimist”).","zh":"悲观主义者；总是倾向于预期坏结果、关注可能出错之处的人（“pessimist”的复数）。"},"examples":[{"en":"The pessimists in the group worried the plan would fail.","zh":"团队里的悲观主义者担心这个计划会失败。"},{"en":"Pessimists often notice risks that others ignore.","zh":"悲观主义者常常能注意到别人忽略的风险。"},{"en":"In uncertain times, pessimists may feel anxious more easily.","zh":"在不确定的时期，悲观主义者可能更容易感到焦虑。"}]}],"synonyms":["doom-and-gloomers","skeptics","cynics"],"phonetic":"/ˈpɛsəmɪsts/","extraExplanation":["“pessimist”来自“pessimism（悲观）”。日常表达里常与“optimist（乐观主义者）”对比：optimist更强调机会与希望，pessimist更强调风险与困难。两者在团队中都可能有价值——前者推动行动，后者帮助预防问题。","常见搭配：a pessimist by nature（天生悲观的人），the pessimists and the optimists（悲观派和乐观派），economic pessimists（对经济前景悲观的人/群体）。"]}
{"word":"pessimize","summary":{"en":"Pessimize means to make something worse or less efficient, especially used in tech to mean “the opposite of optimize.”","zh":"Pessimize 指使某事变差、效率降低；在技术语境中常表示“优化的反面”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something worse or less effective, often by choosing a poor method or by introducing changes that reduce quality or results","zh":"使（某事）变差；让（效果/效率）降低（常指方法不当或改动带来负面结果）"},"examples":[{"en":"The new policy was meant to help, but it actually pessimized customer service.","zh":"这项新政策本来是想帮忙，但实际上让客服变得更差。"},{"en":"If you remove the training program, you may pessimize the team’s performance.","zh":"如果你取消培训计划，可能会让团队表现变差。"}]},{"partOfSpeech":"vt.","definition":{"en":"(especially in computing) to reduce performance or efficiency, such as by slowing software or making an algorithm run less well","zh":"（尤指计算机领域）降低性能/效率；使程序变慢或让算法表现更差"},"examples":[{"en":"Turning off caching can pessimize the app and increase load times.","zh":"关闭缓存可能会让应用性能变差，并增加加载时间。"},{"en":"A small change in code unexpectedly pessimized the whole system.","zh":"代码的一个小改动却意外地让整个系统性能变差。"}]}],"synonyms":["make worse","worsen","degrade","impair","reduce efficiency","hurt performance"],"phonetic":"/ˈpɛsəˌmaɪz/","extraExplanation":["“pessimize”常被看作“optimize（优化）”的反义词，多见于技术写作、工程讨论或幽默语境：本想“优化”，结果反而“越改越差”。在正式一般英语中不如“make worse / degrade / impair”常见。"]}
{"word":"pessimum","summary":{"en":"Pessimum means the worst possible condition or the least favorable point, especially in biology as the opposite of optimum.","zh":"pessimum 指最不利、最差的状态或点，尤用于生物学/生态学中，与 optimum（最适点）相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worst possible condition or level for something; the point at which performance or survival is at its poorest (often used in biology/ecology as the opposite of optimum).","zh":"最不利（最差）的状态或水平；（常用于生物学/生态学）指生存或表现最差的点，与 optimum（最适点）相对。"},"examples":[{"en":"For this plant, extreme salt levels are a pessimum—growth nearly stops.","zh":"对这种植物来说，极高盐度是一个“最不利点”，生长几乎停止。"},{"en":"The organism can tolerate cold, but below a certain temperature it reaches its pessimum.","zh":"这种生物能耐寒，但低于某个温度就会达到“最差点”。"}]}],"synonyms":["worst-case condition","least favorable condition","nadir","rock bottom"],"phonetic":"/ˈpɛsɪməm/","extraExplanation":["“pessimum”源自拉丁语，意思是“最坏的”。在生态学或生理学里常与“optimum（最适点）”成对出现，用来描述环境因素（如温度、盐度、pH）从适宜到不适宜的两端：最适点附近表现最好，而接近“pessimum”时表现最差甚至无法生存。","该词在日常英语中不常用，更常见的替代表达有“the worst-case condition / the worst level / the least favorable condition”。"]}
{"word":"pessimus","summary":{"en":"Pessimus is a Latin word meaning “the worst,” used in English mainly in scholarly, humorous, or taxonomic contexts.","zh":"pessimus 是拉丁语，意为“最差/最坏”，在英语中多见于学术、幽默评论或生物分类命名语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in scholarly or humorous contexts) the worst; the very least good.","zh":"（拉丁语词；在英语中多用于学术或幽默语境）最坏的；最差的。"},"examples":[{"en":"In his notes, he called the second draft pessimus and started over.","zh":"在笔记里，他把第二稿写成了“pessimus（最差的）”，然后重新开始。"},{"en":"The teacher joked, “This is not optimus—it’s pessimus,” to remind us to revise.","zh":"老师开玩笑说：“这不是 optimus（最好的），而是 pessimus（最差的）。”用来提醒我们修改。"}]},{"partOfSpeech":"other","definition":{"en":"(Taxonomy) used as a Latin species name or epithet meaning “worst,” often describing an undesirable trait by comparison within a group.","zh":"（分类学）用作拉丁学名中的种加词，意为“最差的/最坏的”，常用于在同类比较中强调某种不理想特征。"},"examples":[{"en":"The paper discussed a beetle once labeled with the epithet pessimus in older classifications.","zh":"论文讨论了一种甲虫，在较旧的分类中曾被冠以种加词 pessimus。"}]}],"synonyms":["worst","poorest","lowest","most terrible","most inferior"],"phonetic":"/ˈpɛsɪməs/","extraExplanation":["“pessimus”是拉丁语里“bad（坏）”的最高级，相当于英语的“worst”。与它常成对出现的拉丁词是“optimus（最好的）”。","在现代英语中它并不常用于日常对话，更多见于学术写作、戏谑式的评语，或生物分类学的拉丁命名中（作为种加词）。"]}
{"word":"pessomancy","summary":{"en":"Pessomancy is a rare word for fortune-telling by interpreting pebbles or small stones.","zh":"Pessomancy 指一种罕见说法的“投石/用小石子占卜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare term for divination (fortune-telling) done by interpreting pebbles, small stones, or similar objects after casting or arranging them.","zh":"（罕用词）一种占卜方式：通过投掷、摆放并解读小石子/鹅卵石等物体来进行预言。"},"examples":[{"en":"In the novel, the old seer practiced pessomancy by tossing pebbles onto a cloth and reading the pattern.","zh":"在小说里，那位老预言者用“pessomancy（投石占卜）”把小石子撒在布上，并解读形成的图案。"},{"en":"Some museum notes mention pessomancy as one of many traditional forms of fortune-telling.","zh":"一些博物馆的说明把 pessomancy 作为多种传统占卜方式之一提到。"}]}],"synonyms":["psephomancy","cleromancy","divination"],"phonetic":"/ˈpɛsəˌmænsi/","extraExplanation":["这个词非常罕见，更多时候你会看到更常用的拼写/术语 **psephomancy**（同义：用“石子/筹子”占卜）。在一般英语语境里，人们更熟悉的是 **cleromancy**（抽签/掷物占卜，范围更广）。","注意不要和 **pessimism**（悲观）混淆；两者词形相近，但含义无关。","词源上与表示“石子/卵石”的希腊词根有关，后缀 **-mancy** 表示“占卜、预言”。"]}
{"word":"pessoner","summary":{"en":"“Pensioner” means someone who receives a pension, often a retired person.","zh":"“pensioner”指领取养老金的人，常指退休人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who receives a pension (regular money after retirement or from the government/company).","zh":"领取养老金的人（退休后或由政府/公司定期发放的钱）。"},"examples":[{"en":"My grandfather is a pensioner now, so he doesn’t work full-time.","zh":"我爷爷现在是领养老金的人，所以他不再全职工作。"},{"en":"The city offers discounts to pensioners on public transport.","zh":"这个城市为领取养老金的人提供公共交通折扣。"}]}],"synonyms":["retiree","pension recipient"],"phonetic":"/ˈpɛnʃənɚ/","extraExplanation":["“pessoner”常见是拼写错误，最可能想写的是 **pensioner**。正确拼写：p-e-n-s-i-o-n-e-r。","英式英语里 **pensioner** 很常用于日常新闻与政策语境；美式英语也能用，但有时会更常说 **retiree**（退休人士）。"]}
{"word":"pessular","summary":{"en":"“Pessular” means “related to a pessary,” used mainly in medical contexts.","zh":"“pessular”意为“与子宫托/阴道托有关的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pessary (a medical device inserted into the vagina, often to support pelvic organs or for contraception in older usage).","zh":"与子宫托/阴道托有关的（子宫托是一种置入阴道内的医疗器具，常用于支撑盆腔器官；较早用法中也可用于避孕）。"},"examples":[{"en":"The doctor discussed pessular treatment options for pelvic organ prolapse.","zh":"医生讨论了用于盆腔器官脱垂的子宫托（阴道托）治疗方案。"},{"en":"She received instructions on pessular care and follow-up visits.","zh":"她收到了关于子宫托护理及复诊的指导。"}]}],"synonyms":["pessary-related","pessarial (less common)"],"phonetic":"/ˈpɛsjələr/","extraExplanation":["“pessular”来源于“pessary”（子宫托/阴道托）加形容词后缀“-ar”。它属于较专业的医学用语，日常英语中更常见的说法是“pessary-related”或直接说“pessary”。","现代医学语境里，pessary多用于盆腔器官脱垂或压力性尿失禁的保守治疗；不同类型需要医生评估并指导清洁与复诊。"]}
{"word":"pessulus","summary":{"en":"A rare word meaning a small bolt or latch used to fasten a door or similar opening.","zh":"一个罕见词，指用于固定门等开口处的小门闩/插销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bolt, bar, or fastening piece used to secure a door, gate, or similar opening; a latch or lock-bar (rare, literary/technical).","zh":"（罕见、偏文学/技术用语）小门闩；插销；用于固定门、门闸等的栓条/锁闩。"},"examples":[{"en":"He slid back the pessulus and pushed the old door open.","zh":"他拉开门闩（pessulus），推开了那扇旧门。"},{"en":"The chest was secured with a simple pessulus of iron.","zh":"那个箱子用一根简单的铁插销锁住了。"}]}],"synonyms":["bolt","latch","bar","fastener"],"phonetic":"/ˈpɛs.jə.ləs/","extraExplanation":["pessulus 是源自拉丁语的词，原意与“门闩/插销”有关。它在现代英语中非常少见，多出现在古典研究、文学仿古写作，或描述古代器物与建筑细节的语境里。","更常用、自然的替代词有 bolt（门闩/插销）、latch（门闩/搭扣）、bar（门栓/横闩）或 lock（锁）。在写作中用 pessulus 往往是为了营造古风或学术气息。"]}
{"word":"pest","summary":{"en":"A pest is usually a harmful insect/animal, or (informally) an annoying person; as a verb, it means to annoy repeatedly.","zh":"pest通常指“害虫/害兽”，也可口语指“烦人的人”；作动词表示“不断打扰、纠缠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small animal or insect that is harmful or annoying, especially one that damages crops, food, or property.","zh":"（尤指）害虫；害兽；（会破坏农作物、食物或财物的）有害小动物或昆虫"},"examples":[{"en":"Mosquitoes are a common pest in summer.","zh":"蚊子是夏天常见的害虫。"},{"en":"Farmers use nets to protect fruit from pests.","zh":"农民用网子保护水果免受害虫侵害。"},{"en":"We called an exterminator to deal with the pest problem.","zh":"我们叫了灭虫人员来处理虫害问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that annoys you repeatedly; a nuisance.","zh":"讨厌的人（或事物）；烦人的家伙；麻烦精"},"examples":[{"en":"My little brother is being a pest—he keeps asking the same question.","zh":"我弟弟真烦——他一直问同一个问题。"},{"en":"Stop being a pest and let me work.","zh":"别烦我了，让我工作。"}]},{"partOfSpeech":"v.","definition":{"en":"To annoy someone repeatedly; to pester.","zh":"不断打扰；纠缠；使烦恼"},"examples":[{"en":"They kept pestering her for an answer.","zh":"他们一直缠着她要一个答复。"},{"en":"Please don’t pest me while I’m on a call.","zh":"我在打电话时请不要一直打扰我。"}]}],"synonyms":["nuisance","annoyance","bug","vermin","pester"],"phonetic":"/pɛst/","extraExplanation":["“Pest”在农业与日常生活中都很常见：在正式语境里多指“害虫/害兽”，在口语里也常用来形容“很烦、老来打扰的人”。","动词用法相对少见，更常见的是动词“pester”。不过“pest someone”在口语中仍可听到，意思接近“pester someone”。"]}
{"word":"pestalozzian","summary":{"en":"Pestalozzian means related to Pestalozzi or his child-centered, hands-on educational philosophy.","zh":"pestalozzian 指与裴斯泰洛齐或其以儿童为中心、重实践与关爱的教育理念有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Swiss educator Johann Heinrich Pestalozzi (1746–1827) or to his child-centered approach to education, which emphasizes learning through activity, affection, and the development of the “whole child.”","zh":"与瑞士教育家约翰·亨利希·裴斯泰洛齐（1746–1827）或其以儿童为中心的教育思想有关的；强调通过活动与关爱来学习，并注重“全人发展”。"},"examples":[{"en":"The school adopted a Pestalozzian approach, encouraging students to learn by doing rather than memorizing.","zh":"这所学校采用裴斯泰洛齐式的教育方法，鼓励学生在实践中学习，而不是死记硬背。"},{"en":"Her Pestalozzian classroom focused on kindness, hands-on materials, and steady routines.","zh":"她的裴斯泰洛齐式课堂强调友善、动手教具和稳定的日常流程。"}]}],"synonyms":["Pestalozzi-inspired","child-centered (in education)","hands-on (learning)"],"phonetic":"/ˌpɛs.təˈlɑt.si.ən/","extraExplanation":["“Pestalozzian”来自教育家Pestalozzi的姓氏。英语里把人名变成形容词时，常加“-ian / -an”（如 Darwinian 达尔文的，Freudian 弗洛伊德的），表示“与某人/其思想有关”。","裴斯泰洛齐的理念常与“以儿童为中心”“情感与道德教育”“通过直观与实践学习（learning by doing）”联系在一起，对后来的现代教育、师范教育和一些幼儿教育理念有影响。"]}
{"word":"pestalozzianism","summary":{"en":"Pestalozzianism is Pestalozzi-inspired, child-centered education focused on learning by doing and developing head, heart, and hands.","zh":"裴斯泰洛齐主义是一种受裴斯泰洛齐影响的儿童中心教育观，强调做中学，并促进头脑、心灵与双手的全面发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An educational philosophy based on the ideas of Johann Heinrich Pestalozzi, emphasizing child-centered learning through love, hands-on activity, and the balanced development of “head, heart, and hands.”","zh":"裴斯泰洛齐主义：源自瑞士教育家裴斯泰洛齐（Pestalozzi）的教育理念，强调以儿童为中心、以关爱为基础、通过动手实践学习，并追求“头脑、心灵与双手”的均衡发展。"},"examples":[{"en":"The teacher’s Pestalozzianism showed in her lessons, which used real objects, drawing, and gentle guidance.","zh":"这位老师的裴斯泰洛齐主义体现在课堂上：她使用实物、绘画，并以温和的方式引导学生。"},{"en":"Some modern early-childhood programs echo Pestalozzianism by valuing play, care, and learning by doing.","zh":"一些现代幼儿教育项目通过重视游戏、关怀与做中学，体现了裴斯泰洛齐主义的精神。"}]}],"synonyms":["Pestalozzian education","child-centered education","progressive education (broadly)"],"phonetic":"/ˌpɛstəlˈɑtsiənˌɪzəm/","extraExplanation":["“Pestalozzianism”来自教育家 Johann Heinrich Pestalozzi（1746–1827）的姓氏。该思潮常与“直观教学（object lessons）”“从具体到抽象”“尊重儿童发展阶段”等关键词相关。","在英语语境中，这个词多用于教育史、教育哲学或学术写作中；日常口语里更常说“Pestalozzi’s ideas/approach”或“child-centered education”。"]}
{"word":"peste","summary":{"en":"“Peste” is a literary/archaic word meaning “the plague,” and it can also mean a serious nuisance or curse in a figurative sense.","zh":"“peste”多为文学/古体用语，意为“瘟疫（鼠疫）”，也可引申指“祸害、令人厌烦的麻烦”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) the plague; a deadly epidemic disease.","zh":"（古体或文学用语）鼠疫；瘟疫；致命的流行病。"},"examples":[{"en":"In old chronicles, the peste is described as wiping out whole towns.","zh":"在古代编年史里，peste 被描写成让整座城镇覆灭。"},{"en":"The novel uses “peste” to evoke fear and medieval catastrophe.","zh":"这部小说用“peste”来唤起恐惧与中世纪式的灾难感。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) something or someone that is a curse, a menace, or a persistent nuisance.","zh":"（引申）祸害；麻烦精；令人厌烦又难摆脱的人或事。"},"examples":[{"en":"Corruption was called the peste of the city in the speech.","zh":"演讲中把腐败称作这座城市的祸害。"},{"en":"Mosquitoes are a real peste in the summer.","zh":"夏天的蚊子真是个大麻烦。"}]}],"synonyms":["plague","pestilence","epidemic","scourge","menace","nuisance"],"phonetic":"/pɛst/","extraExplanation":["“peste”在现代英语里不算常用词，更多出现在历史写作、翻译腔或文学语境中，用来指“瘟疫/鼠疫”。日常英语通常用 plague 或 pestilence。","词源上与拉丁语 pestis（瘟疫）同源；法语 la peste、意大利语 peste、西班牙语 peste 都常见，因此你可能会在欧洲文学或历史材料中看到这个拼法。"]}
{"word":"pester","summary":{"en":"Pester means to repeatedly bother or annoy someone; it can also mean an annoying person or thing.","zh":"pester 指反复烦扰、纠缠；也可指令人讨厌的人或事物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to keep bothering someone repeatedly, especially in an annoying way, often by asking for something again and again","zh":"（尤指反复要求某事而）纠缠；不断烦扰"},"examples":[{"en":"The kids kept pestering their dad for ice cream.","zh":"孩子们一直缠着爸爸要冰淇淋。"},{"en":"Please stop pestering me—I’m trying to study.","zh":"别再烦我了——我在学习。"},{"en":"Reporters pestered the actor with personal questions.","zh":"记者用私人问题不断纠缠那位演员。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is annoying and causes trouble","zh":"讨厌的人（或事物）；麻烦精"},"examples":[{"en":"He can be a real pester when he doesn’t get his way.","zh":"他要是不如意就会变成一个很烦人的家伙。"},{"en":"Mosquitoes are a summer pester.","zh":"蚊子是夏天让人头疼的东西。"}]}],"synonyms":["bother","harass","nag","bug","annoy"],"phonetic":"/ˈpɛstɚ/","extraExplanation":["“pester”常带有“反复、持续”的感觉，比“annoy”更强调一而再、再而三地打扰或纠缠（尤其是反复提要求、问问题）。","常见搭配：pester someone for something（缠着某人要某物）；pester someone with questions（用问题纠缠某人）；stop pestering me（别烦我了）。"]}
{"word":"pestered","summary":{"en":"“Pestered” means repeatedly bothered or annoyed someone by asking or interfering again and again.","zh":"“pestered”表示反复打扰、纠缠某人，常指一再追问或烦扰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to repeatedly bother or annoy someone, often by asking again and again","zh":"反复打扰或纠缠某人（常指一再追问、烦扰）"},"examples":[{"en":"The kids pestered their mom for snacks all afternoon.","zh":"孩子们整个下午都缠着妈妈要零食。"},{"en":"He was pestered by reporters outside the courthouse.","zh":"他在法院外被记者们不停纠缠。"},{"en":"Stop pestering your sister and give her some space.","zh":"别再烦你妹妹了，给她点空间。"}]}],"synonyms":["bothered","harassed","nagged","hassled"],"phonetic":"/ˈpɛstɚd/","extraExplanation":["“pestered”是动词“pester”的过去式/过去分词，常见搭配：pester someone for something（缠着某人要某物）、pester someone to do something（纠缠某人去做某事）。","语气通常带负面评价：不是普通的“问”，而是“问个不停、让人烦”。在礼貌场合可用更温和的表达，如 “keep asking” 或 “press for” 视语境而定。"]}
{"word":"pesterer","summary":{"en":"A pesterer is someone who repeatedly bothers or annoys others.","zh":"pesterer 指反复打扰、纠缠他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps bothering, annoying, or repeatedly asking someone for something.","zh":"总是打扰、烦扰别人或反复纠缠索要的人。"},"examples":[{"en":"Ignore the pesterer and finish your work.","zh":"别理那个烦扰的人，把工作做完。"},{"en":"The pesterer kept asking for extra snacks even after being told no.","zh":"即使被拒绝了，那个人还是一直纠缠着要更多零食。"}]}],"synonyms":["annoyance","nuisance","bother","nag","pest"],"phonetic":"/ˈpɛstərər/","extraExplanation":["“pesterer”由动词“pester（烦扰、纠缠）”加上表示“做某事的人”的后缀“-er”构成，语气通常偏负面，常用于抱怨某人一直打扰或不断追问。"]}
{"word":"pesterers","summary":{"en":"“Pesterers” means people who repeatedly annoy or bother others.","zh":"“pesterers”指反复打扰、纠缠他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who keep bothering or annoying others, especially by repeatedly asking for something or not leaving them alone.","zh":"不断打扰或烦扰别人的人，尤指反复提出要求、缠着不放的人。"},"examples":[{"en":"The telemarketers were relentless pesterers, calling every evening.","zh":"那些电话推销员简直是纠缠不休的打扰者，每天晚上都打来。"},{"en":"He tried to study, but the pesterers in the hallway kept shouting and laughing.","zh":"他想学习，但走廊里的那些捣乱的人一直喊叫大笑。"}]}],"synonyms":["annoyers","botherers","nags","harassers","pains"],"phonetic":"/ˈpɛstərərz/","extraExplanation":["“pesterers”是名词复数，单数是“pesterer”。它来自动词“pester”（不停纠缠、烦扰）+ 表示“做某事的人”的后缀“-er”。带有明显负面语气，常用于抱怨或批评。"]}
{"word":"pestering","summary":{"en":"Pestering means repeatedly bothering someone in an annoying way, often by asking again and again.","zh":"Pestering 指反复、令人厌烦地打扰或纠缠某人，常带“一直要求/不停问”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to keep bothering someone repeatedly, especially in an annoying way, often by asking for something again and again","zh":"（尤指反复提出要求地）一再打扰、纠缠、烦扰某人"},"examples":[{"en":"The kids kept pestering their mom for snacks.","zh":"孩子们一直缠着妈妈要零食。"},{"en":"Stop pestering me—I’m trying to work.","zh":"别再烦我了——我在工作。"},{"en":"He pestered the teacher with questions after class.","zh":"他下课后不停地向老师提问，把老师问得有点烦。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective form) repeatedly annoying or bothering","zh":"（形容词用法）令人烦扰的、纠缠不休的"},"examples":[{"en":"She tried to ignore his pestering calls.","zh":"她试着无视他纠缠不休的来电。"},{"en":"The pestering noise made it hard to sleep.","zh":"那持续烦人的噪音让人难以入睡。"}]}],"synonyms":["bothering","bugging","harassing","nagging"],"phonetic":"/ˈpɛstərɪŋ/","extraExplanation":["“pestering”常见于口语，语气比“ask”更负面，强调“反复、烦人、让人受不了”的感觉。更委婉时可用“keep asking”或“keep bothering”。","词根“pest”原意是“害虫”，引申为“讨厌的人/事”；“pester”就是“像害虫一样烦人地纠缠”。"]}
{"word":"pesteringly","summary":{"en":"“Pesteringly” means “in an annoying, persistent way,” especially by repeatedly bothering someone.","zh":"“pesteringly”表示“纠缠地、烦人地”，强调反复打扰、催促或缠着不放。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that repeatedly annoys someone by asking, urging, or bothering them again and again.","zh":"以反复打扰、纠缠、催促的方式；令人烦恼地（不断问、不断烦）。"},"examples":[{"en":"He pesteringly asked for a new phone every day.","zh":"他每天都纠缠着要一部新手机。"},{"en":"The children followed her around, pesteringly demanding candy.","zh":"孩子们跟着她到处跑，纠缠着要糖。"},{"en":"She kept pesteringly reminding me about the deadline.","zh":"她一直烦人地提醒我截止日期。"}]}],"synonyms":["annoyingly","persistently","importunately","naggingly"],"phonetic":"/ˈpɛstərɪŋli/","extraExplanation":["“pesteringly”来自动词“pester”（纠缠、烦扰），加上副词后缀“-ingly”，表示“以……的方式”。常用于描述说话或行为方式让人感到被不断打扰。日常口语里也常用“annoyingly”或“persistently”来替换，但“pesteringly”更强调“缠着不放”的烦人感觉。"]}
{"word":"pesterment","summary":{"en":"“Pesterment” is a rare, nonstandard noun meaning persistent bothering; “pestering” or “harassment” is more common.","zh":"“pesterment”是罕见且不太标准的名词，表示持续的打扰/纠缠；更常用的是“pestering”或“harassment”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) the act of repeatedly bothering or annoying someone; persistent nuisance.","zh":"（罕见/非标准用法）反复打扰或惹恼他人的行为；纠缠不休。"},"examples":[{"en":"I can’t get any work done because of constant pesterment.","zh":"因为不断的纠缠打扰，我根本没法工作。"},{"en":"His pesterment finally made her lose patience.","zh":"他的纠缠最终让她失去了耐心。"}]}],"synonyms":["pestering","harassment","nagging","bothering","nuisance"],"phonetic":"/ˈpɛstərmənt/","extraExplanation":["“pesterment”在现代英语中很少见，很多时候被视为拼写错误或临时造词。更自然、常见的表达是：pestering（纠缠/不断烦扰）、harassment（骚扰）、nagging（唠叨式纠缠，常指反复催促或抱怨）。","词根来自动词 pester（不断打扰、纠缠）。英语里更常用的名词形式通常不是 *pesterment*，而是 pestering 或 harassment，写作时建议优先选用更常见的词。"]}
{"word":"pesterous","summary":{"en":"“Pesterous” means annoying or troublesome, often in a repeatedly irritating way.","zh":"“pesterous”表示“恼人、麻烦”，常带“反复烦扰”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Annoying or troublesome; causing repeated irritation or inconvenience.","zh":"恼人的；麻烦的；让人反复心烦或不便的。"},"examples":[{"en":"The pesterous mosquitoes kept everyone awake all night.","zh":"恼人的蚊子让大家整晚都睡不着。"},{"en":"He found the constant notifications pesterous and turned off his phone.","zh":"他觉得不断弹出的通知很烦人，于是把手机关了。"}]}],"synonyms":["annoying","bothersome","troublesome","irksome","vexing"],"phonetic":"/ˈpɛstərəs/","extraExplanation":["“pesterous”较少见，带一点书面/古风色彩；日常英语更常用“annoying”“bothersome”“troublesome”。","它来自动词“pester”（纠缠、烦扰），所以常暗示“反复地”让人厌烦，而不只是一次性的讨厌。"]}
{"word":"pesters","summary":{"en":"“Pesters” means repeatedly annoying or bothering someone (third-person singular of “pester”).","zh":"“pesters”表示反复打扰/纠缠（是“pester”的第三人称单数形式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “pester”) to keep bothering someone repeatedly, especially with questions, requests, or small annoyances.","zh":"（“pester”的第三人称单数）反复打扰/纠缠某人，尤其是不断提问、请求或用小事惹人烦。"},"examples":[{"en":"He pesters his sister with questions when he’s bored.","zh":"他无聊时就不停问问题来烦他姐姐。"},{"en":"The dog pesters me for food every time I walk into the kitchen.","zh":"我每次走进厨房，那只狗就缠着我要吃的。"},{"en":"She pesters the teacher to check her homework right away.","zh":"她一直缠着老师马上帮她检查作业。"}]},{"partOfSpeech":"v.","definition":{"en":"to keep causing minor trouble or discomfort to someone or something (less common).","zh":"（较少用）持续给某人或某事带来小麻烦/困扰。"},"examples":[{"en":"A dry cough pesters him at night.","zh":"夜里干咳一直困扰着他。"}]}],"synonyms":["bothers","annoys","harasses","badgers","bugs"],"phonetic":"ˈpɛstərz","extraExplanation":["“pester”通常带有负面语气：不是一次性礼貌地询问，而是“反复、纠缠式地烦人”。在日常表达中，比“ask”更强烈，也比“bother”更具体，常见搭配有：pester someone for money/answers/attention（为钱/答案/关注而纠缠某人）。"]}
{"word":"pestersome","summary":{"en":"Pestersome means repeatedly annoying or bothering.","zh":"pestersome 指“反复打扰、令人烦恼的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Annoying or troublesome because it keeps bothering you repeatedly.","zh":"烦人的；纠缠不休的（因反复打扰而让人觉得恼火）。"},"examples":[{"en":"The mosquitoes were pestsome all night, so I couldn’t sleep.","zh":"蚊子整晚都很烦人，所以我睡不着。"},{"en":"He found the constant notifications pestsome and turned off his phone.","zh":"他觉得不断的通知很烦人，就把手机关了。"}]}],"synonyms":["annoying","bothersome","pesky","irksome","troublesome"],"phonetic":"/ˈpɛstərsəm/","extraExplanation":["“pestersome”由动词“pester”（纠缠、烦扰）加上形容词后缀“-some”构成，表示“会带来……的、充满……的”。它在现代英语中不算常用，更常见的表达是“annoying / bothersome / pesky”。在阅读中见到它，多半是较书面或带一点旧式/文学色彩的用法。"]}
{"word":"pestful","summary":{"en":"“Pestful” means annoying like a pest, or (less commonly) full of pests.","zh":"“Pestful”指像“烦人的家伙”一样惹人烦；较少见的意思是“虫害多的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Annoying or troublesome; acting like a pest (often used to describe a person, child, or behavior).","zh":"讨厌的；惹人烦的；像“烦人的家伙”一样不断打扰的（常形容人、孩子或行为）。"},"examples":[{"en":"Stop being so pestful and let me finish my homework.","zh":"别这么烦人，让我把作业写完。"},{"en":"The pestful buzzing of mosquitoes kept us awake all night.","zh":"蚊子烦人的嗡嗡声让我们整晚睡不着。"}]},{"partOfSpeech":"adj.","definition":{"en":"Full of pests (insects or animals that cause harm), especially in a place or environment.","zh":"虫害多的；有许多害虫（或有害动物）的（尤指某个地方或环境）。"},"examples":[{"en":"The farmer complained that the field was pestful after the heavy rains.","zh":"农夫抱怨说大雨过后田里虫害很多。"}]}],"synonyms":["annoying","bothersome","pestering","troublesome","infested"],"phonetic":"/ˈpɛstfəl/","extraExplanation":["“pestful”在现代英语里不算常见，更常用的表达是：\n- 形容人/行为很烦：annoying, bothersome, pestering\n- 形容虫害多：infested (with insects), full of pests\n也可以把它理解为“pest（害虫/烦人精）+ -ful（充满……的）”。"]}
{"word":"pesthole","summary":{"en":"A strongly negative word for a filthy, unpleasant, or unhealthy place.","zh":"指肮脏、令人不适或不卫生的地方的强烈贬义说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very dirty, unpleasant, or unhealthy place (often used as an insult).","zh":"肮脏、令人厌恶或不卫生的地方（常作侮辱性说法）。"},"examples":[{"en":"He complained that the apartment was a pesthole and refused to move in.","zh":"他抱怨那套公寓简直是个“臭窝”，拒绝搬进去。"},{"en":"The restaurant got shut down after inspectors found it was a pesthole.","zh":"检查人员发现那家餐馆卫生极差后，它被勒令停业。"}]}],"synonyms":["dump","filthy place","hellhole","pigsty","slum"],"phonetic":"/ˈpɛstˌhoʊl/","extraExplanation":["“pesthole”不是常见的标准书面词，更常见于口语/媒体批评中，带有强烈贬义，类似“shithole / dump”（但粗俗程度通常比“shithole”低一些，仍然不礼貌）。","构词上可理解为 pest（害虫、瘟疫）+ hole（洞、窝），强调“像害虫滋生的洞穴一样脏乱”。在正式场合建议用更中性的说法，如 “filthy place / unsanitary place / run-down place”。"]}
{"word":"pestholes","summary":{"en":"“Pestholes” means very dirty or unpleasant places (an insulting word), the plural of “pesthole.”","zh":"“pestholes”指非常肮脏、令人不快的地方（带侮辱色彩），是“pesthole”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very dirty, unpleasant, or unhealthy place (used as an insult); plural of “pesthole.”","zh":"（侮辱性用法）又脏又令人厌恶、可能不卫生的地方；“pesthole”的复数。"},"examples":[{"en":"He called the old apartment building a pesthole because of the bugs and the smell.","zh":"因为虫子和气味，他把那栋老公寓楼骂成“脏乱臭的鬼地方”。"},{"en":"After the storm, some streets looked like pestholes until the trash was cleared.","zh":"暴风雨过后，有些街道在垃圾清理前看起来像脏乱不堪的地方。"}]}],"synonyms":["dump","filthy place","shithole (very rude)","pigsty (informal)","mess"],"phonetic":"/ˈpɛstˌhoʊl/","extraExplanation":["“pesthole”由 pest（害虫/讨厌的东西）+ hole（洞、破地方）构成，语气很强，常用于抱怨或贬低某个地方。使用时要注意场合与礼貌，避免对他人居住环境进行人身攻击。"]}
{"word":"pesthouse","summary":{"en":"A historical quarantine hospital for infectious diseases, especially the plague.","zh":"指历史上的疫病隔离院/隔离医院，尤指收治瘟疫（鼠疫）患者的场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A hospital or building used to isolate and care for people with infectious diseases, especially the plague; a quarantine house.","zh":"（历史用语）疫病隔离院；（尤指）收治瘟疫/鼠疫患者的隔离医院。"},"examples":[{"en":"In the 1600s, many cities built pesthouses outside the walls to keep outbreaks from spreading.","zh":"在17世纪，许多城市在城墙外建“疫病隔离院”，以防疫情扩散。"},{"en":"The ship’s sick passengers were sent to a pesthouse for quarantine.","zh":"船上生病的乘客被送到隔离院进行检疫。"}]}],"synonyms":["quarantine hospital","isolation hospital","plague house","lazaretto"],"phonetic":"ˈpɛstˌhaʊs","extraExplanation":["“pesthouse”里的 pest 在这里是旧义，指“瘟疫/致命传染病”（尤其联想到黑死病），不是现代最常见的“害虫”。","这个词带有明显的历史色彩，现代英语里更常用 quarantine hospital / isolation ward（隔离病房）等表达；在文学或历史叙述中仍会出现。","相关历史词：lazaretto（检疫所/隔离站，常见于港口或海关检疫语境），与 pesthouse 含义相近但语域更偏“海港检疫”。"]}
{"word":"pesticidal","summary":{"en":"“Pesticidal” means pest-killing or pest-controlling.","zh":"“pesticidal”意为“杀灭/控制害虫的；与农药（防治害虫）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or having the ability to kill or control pests (such as insects, weeds, fungi, or rodents).","zh":"与杀灭或控制害虫（如昆虫、杂草、真菌或啮齿动物）有关的；具有杀虫（杀害虫）作用的。"},"examples":[{"en":"The label lists the product’s pesticidal activity and safe-handling instructions.","zh":"标签上列出了该产品的杀虫（防治害虫）作用以及安全使用说明。"},{"en":"Some plants produce pesticidal chemicals that help protect them from insects.","zh":"有些植物会产生具有杀虫作用的化学物质，帮助它们抵御昆虫。"},{"en":"Researchers tested the pesticidal effect of the extract on crop pests.","zh":"研究人员测试了该提取物对农作物害虫的杀虫效果。"}]}],"synonyms":["pest-killing","pesticide-related","insecticidal","herbicidal","fungicidal"],"phonetic":"/ˌpɛstəˈsaɪdəl/","extraExplanation":["“pesticidal”常见于科学论文、农业与法规文本中，比日常对话更正式。日常表达更常说“pesticide (n.)/pesticides”或“pest-killing (adj.)”。","构词上由“pesticide（杀虫剂/农药）+ -al（形容词后缀）”构成，表示“与……有关的/具有……性质的”。","含义通常覆盖多类防治对象与手段：对昆虫常用 insecticidal（杀虫的），对杂草用 herbicidal（除草的），对真菌用 fungicidal（杀菌的）；它们都可被视为更具体的“pesticidal”。"]}
{"word":"pesticide","summary":{"en":"A pesticide is a substance used to kill or control pests, especially in agriculture.","zh":"pesticide 指用来杀死或控制害虫等“有害生物”的药剂，常用于农业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or biological substance used to kill or control pests (such as insects, weeds, fungi, or rodents), especially in farming or gardening","zh":"农药；杀虫剂（泛指用来杀死或控制害虫、杂草、真菌、鼠类等的化学或生物制剂，常用于农业或园艺）"},"examples":[{"en":"Farmers may use pesticides to protect crops from insects and disease.","zh":"农民可能会使用农药来保护作物免受虫害和病害。"},{"en":"Wash fruits and vegetables well to reduce pesticide residue.","zh":"把水果和蔬菜洗干净可以减少农药残留。"}]}],"synonyms":["pest control chemical","insecticide (type)","herbicide (type)"],"phonetic":"/ˈpɛstəˌsaɪd/","extraExplanation":["“pesticide”是总称，不只指“杀虫剂”。它包括：insecticide（杀虫剂）、herbicide（除草剂）、fungicide（杀菌剂）和 rodenticide（杀鼠剂）等。","常见搭配：pesticide use（农药使用）、pesticide residue（农药残留）、pesticide-free（无农药的/不使用农药的）。在食品安全与环保话题中很常见。"]}
{"word":"pesticides","summary":{"en":"Pesticides are substances used to kill or control pests, especially in agriculture.","zh":"Pesticides 指用于杀死或控制害虫的物质，尤其常用于农业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chemicals or other substances used to kill or control pests (such as insects, weeds, fungi, or rodents), especially in farming and gardening.","zh":"（尤指农业与园艺中）用于杀死或控制害虫的化学品或其他物质（如昆虫、杂草、真菌或啮齿动物）。"},"examples":[{"en":"Many farmers use pesticides to protect crops from insects and plant diseases.","zh":"许多农民使用农药来保护作物免受昆虫和植物病害的侵害。"},{"en":"Washing fruits and vegetables can help reduce pesticide residue on the surface.","zh":"清洗水果和蔬菜有助于减少表面的农药残留。"},{"en":"Some communities worry about pesticides affecting bees and other pollinators.","zh":"一些社区担心农药会影响蜜蜂等传粉昆虫。"}]}],"synonyms":["pest control chemicals","insecticides","herbicides"],"phonetic":"/ˈpɛstəˌsaɪdz/","extraExplanation":["“Pesticide”是总称，常见子类包括：insecticide（杀虫剂）、herbicide（除草剂）、fungicide（杀菌剂）、rodenticide（杀鼠剂）。","在日常讨论中常会提到“pesticide residue（农药残留）”“organic produce（有机农产品）”和“integrated pest management/IPM（综合虫害管理）”，IPM强调尽量减少用药、结合生物与物理方法控制虫害。"]}
{"word":"pestiduct","summary":{"en":"“Pesticide” means a substance used to kill or control pests (insects, weeds, fungi, etc.).","zh":"“Pesticide”指用于杀死或控制害虫、杂草、真菌等有害生物的物质（农药/杀虫剂等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical (or sometimes a biological agent) used to kill or control pests such as insects, weeds, or fungi.","zh":"（杀虫剂/农药等）用来杀死或控制害虫、杂草或真菌等有害生物的化学品（有时也包括生物制剂）。"},"examples":[{"en":"Farmers may use pesticides to protect crops from insects.","zh":"农民可能会使用农药来保护作物免受昆虫侵害。"},{"en":"Wash fruits and vegetables to reduce pesticide residue.","zh":"清洗水果和蔬菜可以减少农药残留。"}]}],"synonyms":["insecticide","herbicide","fungicide","pest control chemical"],"phonetic":"/ˈpɛstəˌsaɪd/","extraExplanation":["你输入的“pestiduct”很可能是拼写错误，更常见的词是 **pesticide**。","词源上可以拆开理解：**pest**（害虫/有害生物）+ **-cide**（“杀死”，也见于 *homicide* / *suicide*）。","日常语境中，*pesticide* 是总称；更具体的还有 *insecticide*（杀虫剂）、*herbicide*（除草剂）、*fungicide*（杀菌剂）。"]}
{"word":"pestiferous","summary":{"en":"Pestiferous means harmful or trouble-causing; in older/formal usage, it can mean disease-carrying.","zh":"pestiferous 指“有害的、惹麻烦的”；在较古旧/正式语境中也可指“带疫病的、传染性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmful, troublesome, or destructive—often describing something that spreads problems like a “pest.”","zh":"有害的；讨厌的；会带来麻烦或破坏的（常指像害虫一样散播问题）。"},"examples":[{"en":"The rumor became pestiferous, causing conflict across the whole team.","zh":"这个谣言变得很有害，导致整个团队发生冲突。"},{"en":"Some invasive plants are pestiferous because they damage local ecosystems.","zh":"一些外来入侵植物很有害，因为它们会破坏当地生态系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Carrying disease; infected or likely to spread infection (old-fashioned or formal).","zh":"带有疫病的；传染性的（较正式或较古旧的用法）。"},"examples":[{"en":"In older texts, a “pestiferous air” could mean air believed to spread disease.","zh":"在较早期的文本中，“pestiferous air”可能指被认为会传播疾病的空气。"},{"en":"The author described the swamp as pestiferous and dangerous to travelers.","zh":"作者把沼泽描写成带疫病的，对旅人很危险。"}]}],"synonyms":["noxious","pernicious","harmful","troublesome","baneful"],"phonetic":"/pɛˈstɪfərəs/","extraExplanation":["词源上与拉丁语 pestis（瘟疫、灾祸）有关，因此这个词既可以强调“像害虫一样造成麻烦”，也可以更字面地指“与疫病相关”。现代英语里多用于比喻（pestiferous influence/rumor），而“带疫病的”更常见于文学或历史语境。","近义词提示：noxious（有毒有害的）、pernicious（危害大且隐蔽的）、troublesome（惹麻烦的）。其中 pestiferous 带有“祸害、像瘟疫/害虫般扩散”的语气。"]}
{"word":"pestiferously","summary":{"en":"“Pestiferously” means “in a very harmful or trouble-spreading way.”","zh":"“pestiferously”表示“以非常有害、会传播麻烦/祸害的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very harmful, destructive, or troublesome way; like something that spreads trouble or “poisons” a situation.","zh":"以非常有害、破坏性强或惹人烦的方式；像会“传播祸害/毒害环境”那样。"},"examples":[{"en":"The rumor spread pestiferously through the office, damaging trust between coworkers.","zh":"谣言在办公室里以“祸害般”的速度扩散，破坏了同事之间的信任。"},{"en":"A small conflict can grow pestiferously if no one addresses it early.","zh":"一个小冲突如果没人及早处理，可能会以极具破坏性的方式迅速扩大。"}]}],"synonyms":["harmfully","destructively","toxically","noxiously","malignantly"],"phonetic":"/pɛˈstɪfɚəsli/","extraExplanation":["“pestiferously”来自形容词“pestiferous”（有害的、会带来灾祸的），其词根与拉丁语“pestis”（瘟疫、灾祸）有关，所以它常带有“像瘟疫一样扩散、造成破坏”的强烈语气。","这个词比较书面、文学或讽刺风格中更常见；日常口语里更常用“harmfully / destructively / obnoxiously / in a toxic way”等替换。"]}
{"word":"pestiferousness","summary":{"en":"Pestiferousness means the quality of being highly harmful—especially spreading disease or acting like a plague.","zh":"pestiferousness 指“祸害性/致病性”，强调像瘟疫一样带来严重危害或扩散。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being pestiferous; causing disease, infection, or serious harm (literally or figuratively).","zh":"有害（致病、传染或带来严重危害）的性质或状态；也可指比喻意义上的“祸害性”。"},"examples":[{"en":"In the past, people feared the pestiferousness of crowded, unsanitary cities.","zh":"过去，人们害怕拥挤且不卫生的城市所带来的致病危害。"},{"en":"The novel describes the pestiferousness of corruption spreading through the government.","zh":"小说描写了腐败像瘟疫一样在政府中蔓延的祸害性。"}]}],"synonyms":["harmfulness","toxicity","deadliness","virulence","perniciousness"],"phonetic":"/ˌpɛstəˈfɪrəsnəs/","extraExplanation":["这个词很少见，写作上更常用更简单的替代词，如: harmfulness（有害性）、toxicity（毒性）、deadliness（致命性）、virulence（毒力/毒性强）。","词源上与拉丁语 pestis（瘟疫）有关；pestiferous = “带来瘟疫/灾害的”，-ness 把形容词变成名词，表示“……的性质/状态”。","文学或修辞中常用于把“思想、风气、腐败、谣言”等比作瘟疫式扩散，强调其具有传染性和破坏性。"]}
{"word":"pestifugous","summary":{"en":"Pestifugous means disease-repelling or plague-warding; an old-fashioned way to say “antiseptic/disinfecting.”","zh":"pestifugous 意为“避疫的、驱疫的”，较古旧，相当于“抗菌/消毒/预防疾病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to prevent, drive away, or ward off disease (especially plague); antiseptic or disease-repelling.","zh":"能预防、驱除或抵御疾病（尤指瘟疫）的；防疫的；抗菌/避疫的。"},"examples":[{"en":"In older medical writing, vinegar was sometimes described as pestifugous.","zh":"在较早的医学写作中，醋有时被描述为“pestifugous”（避疫的）。"},{"en":"The herbalist claimed the smoke of certain plants had a pestifugous effect.","zh":"那位草药师声称某些植物的烟有“pestifugous”（驱疫）的效果。"}]}],"synonyms":["antiseptic","disinfecting","germicidal","disease-preventing"],"phonetic":"/pɛˈstɪf.jə.ɡəs/","extraExplanation":["这是一个非常罕见、偏古旧的词，多见于早期医学/博物学文字。现代英语里更常用 antiseptic（抗菌的）、disinfectant（消毒的，作名词/形容词）、germicidal（杀菌的）、disease-preventing（预防疾病的）等表达。","词源可拆为 pest-（瘟疫、疫病）+ -fugous（驱走、逃离；与 fugitive / refuge 同源，来自拉丁语 fugare / fugere “逃跑、驱逐”）。字面意思接近“把瘟疫赶走的”。"]}
{"word":"pestify","summary":{"en":"Pestify is a rare verb meaning “to make (someone/something) a pest” or “to pester; bother repeatedly.”","zh":"pestify 是个很少见的动词，表示“使变得像讨厌的人/害虫一样”或“反复纠缠、打扰（≈pester）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make someone or something into a pest; to cause trouble or annoyance like a pest.","zh":"（罕用）使某人/某物变得像“害虫/讨厌的人”一样；使人感到麻烦或讨厌。"},"examples":[{"en":"The author portrays gossip as a force that can pestify even a friendly neighborhood.","zh":"作者把流言描写成一种力量，甚至能让原本友善的社区变得令人厌烦、麻烦不断。"},{"en":"Don’t pestify the chat with repeated questions—read the pinned message first.","zh":"别在聊天里反复问同样的问题把大家烦到——先看置顶消息。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To pester; to bother repeatedly.","zh":"（罕用）纠缠不休；反复打扰（相当于 pester）。"},"examples":[{"en":"He kept pestifying his sister for the last cookie.","zh":"他为了最后一块饼干一直缠着妹妹不放。"}]}],"synonyms":["pester","annoy","bother","harass","plague"],"phonetic":"/ˈpɛstəˌfaɪ/","extraExplanation":["“pestify”在现代英语里非常少见，很多时候人们会直接用更常见、更自然的词：pester（纠缠、烦扰）、annoy（惹恼）、bother（打扰）。在正式写作或考试中，建议优先使用这些常用词。","构词上它看起来像 pest（害虫/讨厌的人）+ -ify（使变成……）。因此语感上更偏“使……变得像讨厌的人/害虫一样”，但在真实语料中出现频率很低。"]}
{"word":"pestilence","summary":{"en":"Pestilence means a deadly, spreading epidemic disease, and it can also mean a harmful influence that spreads through society.","zh":"Pestilence 指致命且传播迅速的流行性传染病，也可比喻会扩散并危害社会的破坏性事物或风气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deadly, fast-spreading infectious disease that affects many people (an epidemic or pandemic), often associated with historical plagues","zh":"致命且迅速传播的传染病（流行病/大流行），常与历史上的“瘟疫/鼠疫”联系在一起"},"examples":[{"en":"In the Middle Ages, pestilence could wipe out entire towns.","zh":"在中世纪，瘟疫可能会使整座城镇的人口大量死亡。"},{"en":"The novel describes fear and loneliness during a time of pestilence.","zh":"这部小说描写了瘟疫时期的恐惧与孤独。"}]},{"partOfSpeech":"n.","definition":{"en":"something seen as a destructive influence that spreads and harms society (used figuratively)","zh":"（比喻）被认为会扩散并危害社会的破坏性事物/风气"},"examples":[{"en":"Some leaders warned that corruption was a pestilence in public life.","zh":"一些领导人警告说，腐败是公共生活中的“瘟疫”。"},{"en":"The article calls online harassment a modern pestilence.","zh":"文章称网络骚扰是现代社会的一种“瘟疫”。"}]}],"synonyms":["plague","epidemic","pest","scourge"],"phonetic":"/ˈpɛstəˌləns/","extraExplanation":["“Pestilence”带有强烈的文学与宗教色彩，常出现在圣经或历史叙述中（如“四骑士”中的“瘟疫/疫病”意象），语气比普通的“disease/illness”更庄严、更可怕。","常见搭配：a time of pestilence（瘟疫横行的时期）、flee the pestilence（逃离瘟疫）、pestilence and famine（瘟疫与饥荒，常见于历史/文学并列）。","与“plague”区别：plague更常用、既可指具体疾病也常作动词（to plague sb. 使困扰）；pestilence更正式、更偏“灾祸式”的大规模疫病，也常用于比喻。"]}
{"word":"pestilences","summary":{"en":"Pestilences are deadly epidemics (or, figuratively, harmful forces) that spread widely.","zh":"pestilences 指致命且广泛传播的疫病；也可比喻会蔓延的严重祸害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of pestilence) a deadly infectious disease that spreads quickly among many people; an epidemic plague.","zh":"（pestilence 的复数）指快速传播、致命的传染病；瘟疫、疫病。"},"examples":[{"en":"In the Middle Ages, pestilences wiped out whole villages.","zh":"在中世纪，瘟疫曾使整座村庄的人几乎灭绝。"},{"en":"The doctor studied how pestilences spread through crowded cities.","zh":"这位医生研究瘟疫如何在拥挤的城市中传播。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) things or forces that cause serious harm or trouble, spreading through a group or society like a disease.","zh":"（比喻）像疾病一样蔓延、带来严重危害或麻烦的事物/势力。"},"examples":[{"en":"The speaker warned that hatred and violence can become pestilences in a community.","zh":"演讲者警告说，仇恨与暴力可能成为社区中的“瘟疫”。"},{"en":"Misinformation can spread online like one of the modern pestilences.","zh":"错误信息会在网络上像现代的“瘟疫”一样扩散。"}]}],"synonyms":["plagues","epidemics","scourges","blights"],"phonetic":"/ˈpɛstələns/","extraExplanation":["“pestilence”常带有较强的文学/宗教色彩，语气比普通的“disease / epidemic”更庄严或更可怕；在《圣经》等文本中常与“famine（饥荒）”“war（战争）”并列出现。","词源来自拉丁语“pestis”（瘟疫、灾祸），因此在比喻用法中也常指“像瘟疫一样的祸害”。"]}
{"word":"pestilenceweed","summary":{"en":"Pestilenceweed is an old/rare name for butterbur-like plants once thought to protect against plague; it can also be used figuratively for something harmful that spreads.","zh":"Pestilenceweed 是一个较古旧/少见的植物俗名，多指蜂斗菜（款冬属）类植物，曾被认为可防瘟疫；也可作比喻指扩散危害的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also written pestilence weed) A large-leaved plant in the butterbur group (genus Petasites), historically believed to help protect people from plague (“pestilence”).","zh":"（也写作 pestilence weed）一种叶子很大的植物，常指蜂斗菜/款冬属植物（Petasites），历史上人们曾认为它能帮助抵御瘟疫（pestilence）。"},"examples":[{"en":"In old herbals, pestilenceweed was recommended during outbreaks of disease.","zh":"在早期的草药书中，pestilenceweed 常被推荐用于疾病暴发时期。"},{"en":"The stream bank was thick with pestilence weed and other wild plants.","zh":"溪岸上长满了 pestilence weed 和其他野生植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, figurative) Something seen as spreading harm or corruption, like a disease.","zh":"（罕见，比喻）被认为像疾病一样扩散危害或腐化的事物。"},"examples":[{"en":"Some writers described misinformation as a pestilenceweed in public life.","zh":"有些作者把错误信息称为公共生活中的“pestilenceweed”（像瘟疫一样蔓延的毒草）。"}]}],"synonyms":["butterbur","pestilencewort"],"phonetic":"/ˈpɛstələnsˌwid/","extraExplanation":["这个词由 pestilence（瘟疫）+ weed（杂草/草本植物）构成，带有明显的历史色彩。早期英语里人们常用植物俗名来表达“功效想象”，并不一定有现代医学证据。","在现代更常见的名称是 butterbur（蜂斗菜/款冬属的一些植物）或 pestilencewort；pestilenceweed 属于较少见、偏古旧或地方性的叫法。"]}
{"word":"pestilencewort","summary":{"en":"Pestilencewort is an old name for butterbur, a plant once thought to help against plague.","zh":"Pestilencewort 是 butterbur（蜂斗菜/款冬属植物）的旧称，曾被认为可对抗瘟疫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (butterbur, especially Petasites hybridus) that was traditionally believed to help protect against or treat plague and other contagious diseases.","zh":"一种植物（款冬属植物，常指欧洲款冬/大叶蜂斗菜 butterbur，尤指 Petasites hybridus），传统上被认为可预防或治疗瘟疫等传染病。"},"examples":[{"en":"In medieval herbals, pestilencewort was recommended during outbreaks of plague.","zh":"在中世纪的草药书中，瘟疫流行时常推荐使用 pestilencewort。"},{"en":"The damp riverbank was covered with pestilencewort and other broad-leaved plants.","zh":"潮湿的河岸长满了 pestilencewort 等阔叶植物。"}]}],"synonyms":["butterbur","Petasites (hybridus)"],"phonetic":"/ˈpɛstɪlənsˌwɝt/","extraExplanation":["“pestilencewort”由 pestilence（瘟疫）+ wort（古英语词根，意为“植物/草药”）组成。许多旧式植物名都含 wort（如 St. John’s wort），表示“用于药用的草”。","它反映的是历史上的民间医学观念：人们曾相信某些草药能抵御瘟疫；但这些传统用途不等于现代医学证据。作为植物名，它在现代英语里较少见，更常见的叫法是 butterbur（蜂斗菜/款冬属植物）。"]}
{"word":"pestilent","summary":{"en":"Pestilent means disease-spreading or deadly; it can also mean morally corrupting or harmful (figuratively).","zh":"pestilent 指“传播疾病的、致命有害的”；也可比喻“腐蚀人心、败坏风气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spreading disease or likely to cause disease; deadly and harmful (often used about sickness, air, or conditions).","zh":"传播疾病的；可能致病的；致命且有害的（常形容疾病、空气或环境状况）。"},"examples":[{"en":"In medieval times, people feared pestilent diseases like the plague.","zh":"在中世纪，人们害怕像鼠疫这样的致命传染病。"},{"en":"The crowded, dirty streets were described as pestilent in old travel writing.","zh":"在一些旧游记里，拥挤肮脏的街道被形容为“pestilent”（致病的）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Morally harmful or destructive; corrupting (used figuratively).","zh":"（比喻）道德上有害的；败坏风气的；腐蚀性的。"},"examples":[{"en":"He warned that hateful rumors can have a pestilent effect on a community.","zh":"他警告说，充满仇恨的谣言会对社区产生“pestilent”（腐蚀性的）影响。"},{"en":"The novel portrays greed as a pestilent force that ruins relationships.","zh":"这部小说把贪婪描写成一种会毁掉关系的“pestilent”（祸害性的）力量。"}]}],"synonyms":["infectious","diseased","noxious","virulent","corrupting","pernicious"],"phonetic":"/ˈpɛs.tə.lənt/","extraExplanation":["词源提示：pestilent 来自拉丁语 pestis（瘟疫）。因此它常带有“瘟疫/疫病”的强烈联想，语气比 sick 或 unhealthy 更严厉、更文学化。","用法对比：pestilential 和 pestilent 都可表示“致病的/有毒害的”，pestilential 更正式、书面感更强；pestilent 也常用作比喻，形容思想、言论或风气“像瘟疫一样扩散”。","常见搭配：pestilent disease/fever/air; pestilent influence/ideas/rumors。"]}
{"word":"pestilential","summary":{"en":"“Pestilential” means connected with disease/spreading infection, or (figuratively) extremely harmful or corrupting.","zh":"“pestilential”指与瘟疫/传染病有关或可能传播疾病；也可作比喻，指极其有害、像瘟疫般毒害人心或社会。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a serious infectious disease (a pestilence), or likely to spread disease.","zh":"与瘟疫/传染病有关的；（环境等）可能传播疾病的。"},"examples":[{"en":"In the novel, the city’s pestilential air makes everyone afraid to go outside.","zh":"在小说里，这座城市带有瘟疫气息的空气让每个人都害怕出门。"},{"en":"They blamed the pestilential swamp for the fever outbreaks.","zh":"他们把发烧疫情的爆发归咎于那片可能传播疾病的沼泽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very harmful, destructive, or morally corrupting (often used as strong criticism).","zh":"极其有害的、带来破坏的；（常作强烈批评）败坏风气的。"},"examples":[{"en":"The writer called the rumor a pestilential influence on the community.","zh":"作家称那则谣言对社区是一种“毒害般”的影响。"},{"en":"He warned that hatred can be pestilential to public life.","zh":"他警告说，仇恨会像瘟疫一样毒害公共生活。"}]}],"synonyms":["disease-ridden","infectious","plague-ridden","noxious","pernicious"],"phonetic":"/ˌpɛstɪˈlɛnʃəl/","extraExplanation":["“pestilential”来自“pestilence（瘟疫）”。在文学或新闻评论中，它常带有强烈的情绪色彩：不仅指真实的疾病传播，也常用来比喻“像瘟疫一样扩散、造成破坏”的事物（如谣言、仇恨、腐败风气）。","常见搭配：pestilential air/heat/conditions（致病的空气/酷热/环境）；pestilential influence（毒害般的影响）。语气偏正式、偏书面。"]}
{"word":"pestilentially","summary":{"en":"“Pestilentially” means “in a plague-like, highly harmful way,” used literally for disease spread or figuratively for toxic influence.","zh":"“pestilentially”表示“像瘟疫一样、极其有害地”，既可字面指疫病传播，也可比喻有毒影响扩散。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is like a pestilence (a deadly disease) or that causes disease to spread.","zh":"以类似瘟疫（致命传染病）的方式；带有传播疾病、引发疫病的特征。"},"examples":[{"en":"In the novel, the plague moves pestilentially through the crowded city.","zh":"在小说里，瘟疫在拥挤的城市中以瘟疫般的方式蔓延。"},{"en":"The writer describes the stench as rising pestilentially from the marsh.","zh":"作者描写那股恶臭像瘟疫一样从沼泽里升腾而出。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an extremely harmful, toxic, or morally corrupt way (often used for strong criticism in formal writing).","zh":"以极其有害、毒化或道德败坏的方式（多用于正式文体中的强烈批评）。"},"examples":[{"en":"He argued that the rumor spread pestilentially, poisoning trust in the community.","zh":"他认为谣言像瘟疫一样扩散，毒化了社区的信任。"},{"en":"The critic wrote that hatred can grow pestilentially if left unchallenged.","zh":"评论家写道，仇恨若不加制止，可能会像瘟疫般滋长。"}]}],"synonyms":["plague-like","virulently","toxically","harmfully","perniciously"],"phonetic":"/ˌpɛstəˈlɛnʃəli/","extraExplanation":["这个词来自形容词 pestilential（“瘟疫般的；有毒害的”），再加副词后缀 -ly 变成副词。它比较少见，常见于文学描写、历史叙述或正式评论中，用来制造“扩散、腐蚀、毒害”的强烈画面感。","使用时通常带有强烈的贬义和夸张色彩：既可以字面指疾病像瘟疫一样传播，也可以比喻坏思想、谣言、仇恨等“像传染病一样”扩散。日常口语里更常说 rapidly / dangerously / like a plague 等。"]}
{"word":"pestilentialness","summary":{"en":"Pestilentialness means the quality of being pestilential—extremely unhealthy, disease-causing, or seriously harmful (often in a strongly negative, sometimes metaphorical sense).","zh":"Pestilentialness 指“瘟疫般的特性”：极度不卫生、可能致病或极其有害（常带强烈贬义，也可作比喻用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being pestilential; extreme unhealthiness, harmfulness, or a strong sense of causing disease or moral harm","zh":"瘟疫般的特性；（环境、气味、影响等）极度不健康、有害，或给人“会带来疾病/道德败坏”的强烈感觉"},"examples":[{"en":"The novel describes the pestilentialness of the crowded slums, where sickness spreads quickly.","zh":"小说描写了拥挤贫民窟的“瘟疫般可怕”，疾病在那里迅速蔓延。"},{"en":"People complained about the pestilentialness of the stagnant canal in summer.","zh":"人们抱怨夏天那条死水运河的恶臭与不卫生，简直“瘟疫般有害”。"},{"en":"He spoke about the pestilentialness of corruption, saying it poisons public trust.","zh":"他谈到腐败的“祸害性”，说它会毒害公众的信任。"}]}],"synonyms":["unhealthiness","toxicity","noxiousness","virulence","harmfulness"],"phonetic":"/pɛˌstɪˈlɛnʃəl.nəs/","extraExplanation":["这是一个相当少见、偏文学/正式的名词，由形容词 pestilential（像瘟疫一样的；有害的）加后缀 -ness 构成，表示“……的性质/状态”。日常写作里更常用 pestilence（瘟疫；祸害）、pestilential air/conditions（有害的空气/环境）、或 simply “the unhealthiness/harmfulness”。","pestilential 除了字面“与瘟疫有关、会致病”，也常带比喻义：形容某种影响“像瘟疫一样扩散、腐蚀人心”（如 corruption, hatred, propaganda）。使用时语气很强，带明显的谴责色彩。"]}
{"word":"pestilently","summary":{"en":"“Pestilently” means “in an extremely unpleasant or harmful (sometimes disease-like) way,” and it’s mostly literary or rare in everyday speech.","zh":"“pestilently”指“以极其令人厌恶或有害（甚至带瘟疫般致命感）的方式”，多见于文学表达，日常口语较少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is extremely unpleasant, harmful, or deadly—often suggesting disease, decay, or moral corruption (literary/rare).","zh":"以极其令人厌恶、有害或致命的方式——常带有疾病、腐败或道德堕落的暗示（文学用语/较少见）。"},"examples":[{"en":"A pestilently sweet smell hung in the air, like rotting fruit.","zh":"空气中弥漫着一种令人作呕的甜腻气味，像腐烂的水果。"},{"en":"The room was pestilently hot and damp, and everyone wanted to leave.","zh":"房间又闷又潮，热得令人难受，大家都想离开。"},{"en":"In the novel, the city is described as pestilently corrupt.","zh":"在小说里，这座城市被描写得腐败不堪、乌烟瘴气。"}]}],"synonyms":["disgustingly","horribly","unbearably","noxiously","dangerously"],"phonetic":"/ˈpɛs.tə.lənt.li/","extraExplanation":["“pestilently”来自形容词“pestilent”（致命的/有瘟疫的/有害的），根源与“pestilence”（瘟疫、疫病）相关；因此它常见于文学描写，用来加强“像瘟疫一样令人不适或危险”的氛围。","现代英语中更常用的替代说法有：“disgustingly / horribly / unbearably / dangerously”。当你想要更“文学感”、更阴暗的语气时，才会选用“pestilently”。"]}
{"word":"pestis","summary":{"en":"Pestis is Latin for a deadly epidemic disease, especially the plague.","zh":"Pestis 是拉丁语，指致命的流行病，尤指鼠疫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deadly infectious disease, especially the plague caused by the bacterium Yersinia pestis (historically linked to major pandemics).","zh":"一种致命的传染病，尤指由鼠疫杆菌（Yersinia pestis）引起的鼠疫（历史上与多次大流行有关）。"},"examples":[{"en":"In medieval Europe, pestis (the plague) killed millions of people.","zh":"在中世纪的欧洲，pestis（鼠疫）夺走了数百万人的生命。"},{"en":"Historians still debate how quickly pestis spread along trade routes.","zh":"历史学家仍在争论pestis（鼠疫）沿贸易路线传播的速度有多快。"}]}],"synonyms":["plague","pestilence"],"phonetic":"/ˈpɛstɪs/","extraExplanation":["“pestis”是拉丁语，常见于历史、医学或古典文献语境，通常指“瘟疫/疫病”，最典型是“鼠疫（plague）”。英语中更常用的对应词是“plague”。","词源上与英语“pest”（害虫；瘟疫般的东西）同源，核心含义都与“严重危害、带来灾难的东西”有关。"]}
{"word":"pestle","summary":{"en":"A pestle is a tool used (often with a mortar) to crush and grind; it can also mean to grind using that tool.","zh":"pestle 指研杵（常与研钵一起用）用于捣碎研磨；也可作动词表示“用研杵研磨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy tool with a rounded end, used to crush and grind ingredients (often in a mortar)","zh":"（研钵中用的）杵；研杵（用来捣碎、研磨食材或药材的重工具）"},"examples":[{"en":"She used a pestle to grind garlic and salt into a paste.","zh":"她用研杵把大蒜和盐研磨成糊状。"},{"en":"In the lab, we crushed the dried leaves with a mortar and pestle.","zh":"在实验室里，我们用研钵和研杵把干叶子捣碎。"}]},{"partOfSpeech":"v.","definition":{"en":"to crush or grind something using a pestle (usually with a mortar)","zh":"用研杵（通常配合研钵）捣碎；研磨"},"examples":[{"en":"Pestle the spices until they become a fine powder.","zh":"把香料捣到变成细粉为止。"},{"en":"He pestled the herbs with a little oil to release their aroma.","zh":"他加了一点油把香草捣碎，以释放香气。"}]}],"synonyms":["(n.) grinder","(n.) pounder","(v.) grind","(v.) crush","(v.) pound"],"phonetic":"/ˈpɛsəl/","extraExplanation":["“mortar and pestle”是固定搭配：mortar 指“研钵”，pestle 指“研杵”。在烹饪里常用于做蒜泥、香料粉、青酱（pesto）等；在药房或实验室里也常见。","词源上 pestle 来自拉丁语 *pistillum*（意为“捣棒/捣槌”）。","容易和 “pesticide（杀虫剂）/ pest（害虫）” 混淆：它们拼写相近但意思完全不同。"]}
{"word":"pestled","summary":{"en":"“Pestled” means “crushed/ground with a pestle,” often in a mortar.","zh":"“pestled”指“用杵（常在研钵中）捣碎或研磨过的/把……捣碎研磨”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pestle”: to crush, grind, or pound something with a pestle (usually in a mortar).","zh":"“pestle”的过去式/过去分词：用杵（通常在研钵里）把东西捣碎、研磨或捶打。"},"examples":[{"en":"She pestled the garlic and salt into a paste.","zh":"她把大蒜和盐用杵捣成了糊。"},{"en":"The spices were pestled until they released a strong aroma.","zh":"香料被捣磨到散发出浓烈的香气。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describes food or material that has been crushed/ground with a pestle.","zh":"（较少用）形容“被用杵捣碎/研磨过的”食物或材料。"},"examples":[{"en":"Add the pestled herbs to the soup at the end.","zh":"最后把捣碎的香草加入汤里。"},{"en":"He preferred pestled pepper over pre-ground pepper.","zh":"他更喜欢现捣的胡椒，而不是预先磨好的胡椒粉。"}]}],"synonyms":["pounded","crushed","ground","mashed","pulverized"],"phonetic":"/ˈpɛsəld/","extraExplanation":["“pestle”常与“mortar（研钵）”搭配出现：mortar and pestle（研钵和杵）。在食谱里也常用更口语的说法：grind / crush / pound（磨碎/捣碎/捶碎）。","拼写上要注意：动词“pestle”加 -ed 变成 “pestled”，中间的 e 不消失；读音通常是 /-səld/，类似在中间多出一个轻微的“ə”音。"]}
{"word":"pestles","summary":{"en":"“Pestles” means more than one pestle, the tool used to grind things in a mortar.","zh":"“pestles”是“pestle”的复数，指多根研杵，用于在研钵中研磨或捣碎材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “pestle”: heavy tools used to crush or grind ingredients in a mortar (e.g., spices, herbs, medicine).","zh":"“pestle”的复数：用于在研钵（mortar）里捣碎或研磨材料的重棒（如香料、草药、药材）。"},"examples":[{"en":"In the kitchen drawer, we keep two mortars and three pestles for different spices.","zh":"在厨房抽屉里，我们放了两个研钵和三根研杵，用来研磨不同的香料。"},{"en":"Stone pestles are common in traditional cooking and herbal medicine.","zh":"石制研杵在传统烹饪和草药疗法中很常见。"}]}],"synonyms":["grinders","pounders","mashing tools"],"phonetic":"ˈpɛsəlz","extraExplanation":["“mortar and pestle（研钵与研杵）”是固定搭配：mortar 是碗状的研钵，pestle 是用来捣压研磨的棒。","“pestle”在英语里也可作动词（to pestle），但更常见的是用名词说“use a mortar and pestle”。"]}
{"word":"pestling","summary":{"en":"Pestling means grinding or crushing something with a pestle, usually in a mortar.","zh":"Pestling 指用研杵（通常在研钵里）把食材或香料捣碎、研磨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of grinding or crushing something with a pestle (usually in a mortar).","zh":"用杵（通常在研钵里）把东西捣碎、研磨的动作或过程。"},"examples":[{"en":"The pestling released the garlic’s strong aroma.","zh":"捣蒜的过程释放出了浓烈的蒜香。"},{"en":"After a few minutes of pestling, the spices became a fine powder.","zh":"研磨几分钟后，香料变成了细粉。"}]},{"partOfSpeech":"v.","definition":{"en":"grinding or crushing with a pestle; the action of using a pestle.","zh":"用杵研磨、捣碎；使用杵的动作。"},"examples":[{"en":"She was pestling peppercorns for the soup.","zh":"她正在把胡椒粒捣碎来做汤。"},{"en":"He kept pestling until the herbs turned into a paste.","zh":"他一直捣到香草变成糊状。"}]}],"synonyms":["grinding","crushing","pounding","mashing"],"phonetic":"/ˈpɛstlɪŋ/","extraExplanation":["“pestling”来自“pestle（杵/研杵）”。常见搭配是“mortar and pestle（研钵和研杵）”，在做香料粉、蒜泥、青酱（pesto）等时很常见。","在现代英语里，“pestling”不算高频词；口语中更常说“grinding/crushing with a pestle”或直接用动词“to grind/crush”。在食谱或较文学化的描写里更可能看到它。"]}
{"word":"pesto","summary":{"en":"Pesto is a thick Italian basil-based sauce often used with pasta or as a spread.","zh":"Pesto 指一种以罗勒为主的意大利浓酱，常用来拌意面或作抹酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick Italian sauce (usually green) made mainly from basil, garlic, pine nuts, olive oil, and cheese, often eaten with pasta or spread on bread.","zh":"一种浓稠的意大利酱（通常是绿色），主要由罗勒、蒜、松子、橄榄油和奶酪制成，常用于拌意面或涂抹面包。"},"examples":[{"en":"I made pasta with pesto for dinner.","zh":"我晚餐做了青酱意面。"},{"en":"Try a pesto sandwich with tomatoes and mozzarella.","zh":"试试加番茄和马苏里拉奶酪的青酱三明治。"}]}],"synonyms":["basil sauce","Italian herb sauce"],"phonetic":"/ˈpɛstoʊ/","extraExplanation":["“Pesto”来自意大利语“pestare”（捣碎、捣烂），传统做法是用研钵和杵把罗勒等材料捣成酱。","最经典的是热那亚青酱（pesto alla genovese）。也有红色版本（常用晒干番茄）或用其他坚果替代松子；对坚果或乳制品过敏的人也会做无坚果/无奶酪的改良版。"]}
{"word":"pestological","summary":{"en":"An uncommon adjective meaning “related to the study of pests or pest control.”","zh":"一个不太常见的形容词，意思是“与害虫研究或害虫防治有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the study of pests (especially harmful insects or organisms) or to methods of pest control.","zh":"与“害虫研究”（尤其指有害昆虫或生物）或害虫防治方法有关的。"},"examples":[{"en":"The team took a pestological approach, identifying the insect before choosing a control method.","zh":"团队采取了害虫研究的思路，先鉴定昆虫种类，再选择防治方法。"},{"en":"Her report included pestological data like breeding cycles and habitat conditions.","zh":"她的报告包含了害虫学相关数据，例如繁殖周期和栖息环境条件。"}]}],"synonyms":["pest-control","pest-management","entomological (insect-related)"],"phonetic":"/ˌpɛstəˈlɑːdʒɪkəl/","extraExplanation":["“pestological”并不是非常常见或标准化的英语词，更多像是由“pest（害虫）+ -ology（……学）+ -ical（……的）”临时构成的形容词。日常与学术写作里更常见的表达是“entomological（昆虫学的）”“pest-control（害虫防治的）”或“related to pest management（与害虫管理相关的）”。","如果你在论文或正式报告中使用，建议先确认该词是否出现在你所在领域的权威资料中；否则用更常见的替代表达会更自然、读者也更容易理解。"]}
{"word":"pestologist","summary":{"en":"A rare, informal word meaning someone who studies or deals with pests (often loosely: an entomologist or pest control professional).","zh":"一个罕见、非正式的词，指研究或处理害虫/有害生物的人（常泛指昆虫学家或害虫防治人员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (rare, informal) person who studies pests or works professionally with pest control; often used loosely for an entomologist or pest management specialist.","zh":"（罕见、非正式）研究“害虫/有害生物”或从事害虫防治的人；常被宽泛地用来指昆虫学家或害虫管理专业人员。"},"examples":[{"en":"The article jokingly called her a “pestologist,” but her actual title was entomologist.","zh":"那篇文章开玩笑称她是“pestologist”，但她的正式头衔其实是昆虫学家。"},{"en":"If you have termites, you should call a licensed pest control professional—not a “pestologist” from the internet.","zh":"如果你家有白蚁，应该联系有执照的害虫防治人员，而不是网上的“pestologist”。"}]}],"synonyms":["entomologist","pest control professional","pest management specialist","IPM specialist"],"phonetic":"/pɛˈstɑlədʒɪst/","extraExplanation":["“pestologist”不是常见或标准的专业称呼，多见于玩笑、媒体标题或口语自造词。更常用且更准确的说法包括：entomologist（昆虫学家，偏研究）、pest control technician/professional（害虫防治技师/人员，偏实务）、integrated pest management (IPM) specialist（综合虫害管理专家）。","构词法上它来自 pest（害虫/有害生物）+ -ologist（……学者/研究者，如 biologist）。虽然形式上像正式职业名词，但在英语里并不普遍。"]}
{"word":"pestology","summary":{"en":"Pestology means the study of pests and methods for managing or controlling them.","zh":"Pestology 指研究害虫/有害生物及其防治与管理方法的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of pests (organisms that harm crops, property, or human health) and how to manage or control them.","zh":"害虫（或有害生物）学；研究会危害农作物、财产或人类健康的生物，以及如何防治与管理它们的学科。"},"examples":[{"en":"She took a short course in pestology to learn safer ways to control insects on farms.","zh":"她上了一门害虫学短期课程，学习更安全的农场昆虫防治方法。"},{"en":"Modern pestology often combines biology with environmental protection.","zh":"现代害虫学常把生物学与环境保护结合起来。"}]}],"synonyms":["pest management","pest control","applied entomology"],"phonetic":"/pɛˈstɑlədʒi/","extraExplanation":["“pestology”在日常英语里很少见，更常用的相关词是“entomology（昆虫学）”“pest management（害虫管理）”“pest control（害虫防治）”。在农业或公共卫生语境中，你也会看到“integrated pest management (IPM)（综合害虫管理）”。","构词上：pest（害虫/有害生物）+ -ology（……学）。很多“……学”都用 -ology，比如 biology（生物学）、ecology（生态学）。","写作时如果想更自然：学术场景可用“pest management research（害虫管理研究）”；想表达职业领域可用“pest control industry（害虫防治行业）”。"]}
{"word":"pestos","summary":{"en":"“Pestos” is the plural of “pesto,” an Italian basil-based sauce used to flavor foods like pasta.","zh":"“pestos”是“pesto”的复数形式；pesto 指常用于意面等食物的意大利罗勒青酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, usually green Italian sauce made by crushing (traditionally) fresh basil, garlic, pine nuts, Parmesan (or similar cheese), and olive oil; often used on pasta, sandwiches, or vegetables","zh":"青酱；一种意大利浓酱，通常为绿色，由罗勒、蒜、松子、帕玛森奶酪（或类似奶酪）和橄榄油捣碎/搅碎而成，常用于意面、三明治或蔬菜"},"examples":[{"en":"I ordered pasta with pesto and grilled chicken.","zh":"我点了青酱意面配烤鸡。"},{"en":"This sandwich tastes great with a little pesto instead of mayonnaise.","zh":"这个三明治用一点青酱代替蛋黄酱特别好吃。"},{"en":"She stirred pesto into the soup for extra flavor.","zh":"她把青酱拌进汤里增加风味。"}]}],"synonyms":["basil sauce","Italian sauce","herb sauce"],"phonetic":"/ˈpɛstoʊ/","extraExplanation":["“pestos”通常是英语里把“pesto”当作可数名词时用的复数形式（例如：many different pestos）。在意大利语中，“pesto”的复数常见为“pesti”。","在菜单或食谱里，你也会看到不同口味的变体，如：basil pesto（罗勒青酱）、sun-dried tomato pesto（风干番茄酱）、arugula pesto（芝麻菜酱）等。"]}
{"word":"pestproof","summary":{"en":"Pestproof means protected against pests; it can also mean to make something pest-proof.","zh":"pestproof 表示“防虫害的”；也可作动词，表示“使……防虫害”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Protected so that pests (such as insects or small animals) cannot get in or cause damage.","zh":"防虫害的；防鼠虫等害虫侵入或造成破坏的。"},"examples":[{"en":"Store rice in a pest-proof container with a tight lid.","zh":"把米装在带紧密盖子的防虫容器里保存。"},{"en":"They installed pest-proof screens on the windows.","zh":"他们在窗户上装了防虫纱窗。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something protected so pests cannot get in or cause damage.","zh":"使防虫害；使不被害虫侵入或破坏。"},"examples":[{"en":"We pestproofed the pantry by sealing gaps and using airtight bins.","zh":"我们通过封住缝隙并使用密封收纳箱来把食品储藏间做成防虫的。"}]}],"synonyms":["pest-resistant","insect-proof","rodent-proof","vermin-proof"],"phonetic":"/ˈpɛstˌpruːf/","extraExplanation":["拼写上常见三种：pest-proof（最常见、较正式）、pestproof（较少见）、pest proof（更口语/临时写法）。意思基本相同。","pest 指“害虫/害兽”（如蟑螂、蚂蚁、老鼠等），proof 在这里表示“防……的/能抵御……的”（类似 waterproof 防水、fireproof 防火）。"]}
{"word":"Pests","summary":{"en":"“Pests” is the plural of “pest”: harmful animals/insects, or someone/something that is very annoying.","zh":"“pests”是“pest”的复数：指害虫/有害动物，也可比喻非常烦人的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Harmful insects or animals that damage crops, food, buildings, or spread disease.","zh":"（尤指）危害农作物、食物、房屋或传播疾病的害虫/有害动物。"},"examples":[{"en":"Farmers spray the fields to protect crops from pests.","zh":"农民喷洒药剂来保护庄稼免受害虫侵害。"},{"en":"Cockroaches and rats are common household pests.","zh":"蟑螂和老鼠是常见的家居害虫/有害动物。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that annoys you repeatedly; a nuisance.","zh":"（反复）惹人烦的人/事；讨厌鬼；麻烦精。"},"examples":[{"en":"Stop tapping the desk—you’re being a pest.","zh":"别一直敲桌子——你太烦人了。"},{"en":"Those spam calls are a real pest.","zh":"那些骚扰推销电话真烦人。"}]}],"synonyms":["vermin","insects","nuisance","annoyance"],"phonetic":"/pɛst/","extraExplanation":["“pests”是“pest”的复数。日常生活中常见搭配有：pest control（虫害/鼠害防治）、pesticide（杀虫剂/农药）、pest-free（无虫害的）。","比喻义（“烦人精”）语气偏口语，有点不客气，但通常不算很粗鲁；对陌生人使用要注意礼貌。"]}
{"word":"pests","summary":{"en":"“Pests” is the plural of “pest”: usually harmful insects/animals, or (informally) people who repeatedly annoy others.","zh":"“pests”是“pest”的复数：通常指害虫/有害小动物；口语中也可指反复惹人烦的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Insects or small animals that cause damage or annoyance, especially to crops, food, homes, or people.","zh":"害虫；有害小动物（会破坏庄稼、食物、房屋，或让人烦恼）。"},"examples":[{"en":"Mosquitoes are common pests in summer.","zh":"蚊子是夏天常见的害虫。"},{"en":"Farmers try to protect crops from pests.","zh":"农民努力保护庄稼免受害虫侵害。"},{"en":"We called pest control because ants became a pest in the kitchen.","zh":"蚂蚁在厨房成了“害物”，所以我们叫了除虫服务。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (often a child) who annoys or bothers others repeatedly.","zh":"讨厌鬼；烦人的人（常指小孩反复打扰别人）。"},"examples":[{"en":"Stop being a pest and let me work.","zh":"别再烦我了，让我工作。"},{"en":"His little brother can be a real pest sometimes.","zh":"他弟弟有时候真的很烦人。"}]}],"synonyms":["insects","bugs","vermin","nuisances","annoyances"],"phonetic":"/pests/","extraExplanation":["“pest”既可指“害虫/害兽”，也可口语化地指“烦人的人”。用于人时语气通常偏轻微抱怨，有时带玩笑；但在正式场合或对陌生人说可能显得不礼貌。","常见搭配：pest control（灭虫/除害服务）、garden pests（园艺害虫）、household pests（家居害虫）、a pest problem（虫害问题）。","相关近义表达（语气不同）：insect/bug（虫子，中性）、vermin（害兽/害虫，偏强烈厌恶）、nuisance（麻烦的人/事，更正式）、annoying kid（烦人的孩子，更直接）。"]}
