{"word":"pew","summary":{"en":"A pew is a long bench seat in a church.","zh":"pew 指教堂里用于礼拜的长条座椅（长椅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long bench seat in a church (and sometimes other places of worship)","zh":"（教堂等礼拜场所的）长条座椅，长椅"},"examples":[{"en":"We sat in the back pew during the service.","zh":"礼拜时我们坐在后排长椅上。"},{"en":"The old wooden pews creaked when people stood up.","zh":"人们起身时，老旧的木质长椅吱呀作响。"}]},{"partOfSpeech":"n.","definition":{"en":"a compartment or enclosed seat in some older buildings or churches (less common)","zh":"（较少见）旧式建筑或教堂中的隔间式座位，包厢式座位"},"examples":[{"en":"In some historic churches, wealthy families had private pews.","zh":"在一些历史悠久的教堂里，富裕家庭曾拥有私人隔间式座位。"}]}],"synonyms":["church bench","bench (in a church)"],"phonetic":"/pju/","extraExplanation":["“pew”最常见于基督教文化语境，尤其是教堂内部。它常与“aisle（过道）”“choir（唱诗班）”“pulpit（讲坛）”等词一起出现。","词源来自古法语，原意与“高起的平台/座位”有关；在英语中逐渐专指教堂里的固定长椅。","相关表达：front pew（前排座位，常带“显眼/虔诚”含义）、back pew（后排座位）、pew mate（同排座位的人，较口语/不常见）。"]}
{"word":"pewage","summary":{"en":"Pewage is an old term for a fee paid to rent a church pew, and sometimes refers to the pew seating capacity as a whole.","zh":"Pewage 是较旧的用语，指租用教堂长椅座位的费用；有时也可指教堂长椅座位的总称/容量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fee paid for the right to use or rent a seat (a pew) in a church; pew rent","zh":"（旧时）为在教堂里使用/租用长椅座位（pew）而支付的费用；座位租金"},"examples":[{"en":"In some churches, families once paid pewage to reserve the same seats each Sunday.","zh":"在一些教堂里，过去有些家庭会支付 pewage 来保留每周日固定的座位。"},{"en":"The parish records list pewage payments along with other donations.","zh":"教区记录把 pewage 的缴款和其他捐款一起列出。"}]},{"partOfSpeech":"n.","definition":{"en":"the seating space in pews (considered as a whole), especially in a church","zh":"（总称）教堂长椅座位；座位容量"},"examples":[{"en":"The chapel’s pewage was limited, so latecomers had to stand.","zh":"小礼拜堂的长椅座位有限，所以迟到的人只好站着。"}]}],"synonyms":["pew rent","seat rent"],"phonetic":"/ˈpjuːɪdʒ/","extraExplanation":["“Pewage/pew rent”在英语世界里多与历史上的教会筹款方式有关：一些教堂会把特定座位“租”给家庭，以固定收入维持运作。后来许多教会改为自由就座与自愿奉献，因此这个词现在较少见，多出现在历史材料、账本或文学描写中。"]}
{"word":"pewdom","summary":{"en":"“Pewdom” is a rare, humorous term meaning the world/community of church pews—often referring to the congregation (people in the pews) or the pew seating area as a whole.","zh":"“Pewdom” 是罕见的幽默说法，指“教堂长椅的世界/圈子”，常用来指会众（坐在长椅上的人）或会众席这一整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, humorous) The world or community associated with church pews—i.e., regular churchgoers or the “pew side” of church life.","zh":"（罕见、幽默用法）与教堂长椅（pew）相关的“圈子/世界”，指常坐在长椅上的会众、教会生活中“坐在台下的那一群人”。"},"examples":[{"en":"He joked that he was a celebrity in pewdom because he never missed Sunday service.","zh":"他开玩笑说自己在“pewdom”（会众圈）里算是名人，因为他从不缺席周日礼拜。"},{"en":"The debate wasn’t just among leaders; it spread quickly through pewdom.","zh":"这场争论不只发生在领袖之间，也很快传到了会众当中。"}]},{"partOfSpeech":"n.","definition":{"en":"The physical “realm of the pews” inside a church; the seating area as a collective idea.","zh":"（引申）教堂里长椅座位区的整体概念；“长椅的区域/世界”。"},"examples":[{"en":"From the pulpit you can feel the mood of pewdom change during a sermon.","zh":"从讲坛上你能感到“pewdom”（座位区/会众席）的气氛在讲道中发生变化。"},{"en":"Music that reaches pewdom clearly helps the whole service.","zh":"能清楚传到会众席（pewdom）的音乐会让整个礼拜更顺畅。"}]}],"synonyms":["the congregation","churchgoers","the pews","the laity"],"phonetic":"/ˈpjuːdəm/","extraExplanation":["“pewdom”不是常见标准词，更像是把 pew（教堂长椅）+ 后缀 -dom 组合出来的幽默/临时造词。-dom 常表示“领域、状态、群体”（如 kingdom 王国、freedom 自由、officialdom 官僚体系）。","在写作里用它通常带一点轻松或讽刺意味：强调“坐在台下的普通会众”这一视角，与 clergy（神职人员）或 leadership（领导层）形成对比。"]}
{"word":"pewee","summary":{"en":"Peewee/pewee means something very small, the youngest division in kids’ sports, or a small North American bird called a pewee.","zh":"Peewee/pewee 可指“很小的人/事物”、儿童体育的最小年龄组，也可指北美一种小型鸟类（林鹟等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small person or thing; someone (often a child) who is smaller than others","zh":"非常小的人或事物；（常指）个子比同龄人更小的孩子"},"examples":[{"en":"He was a peewee when he started the team, but he grew a lot later.","zh":"他刚加入球队时还是个小个子，后来长高了很多。"},{"en":"That puppy is a real peewee—so tiny it fits in one hand.","zh":"那只小狗真的很迷你——小到一只手就能托住。"}]},{"partOfSpeech":"n.","definition":{"en":"a level or age group in children’s sports, for the youngest players (e.g., peewee hockey)","zh":"（儿童体育）最年幼组别/级别（如：少年冰球入门组）"},"examples":[{"en":"She plays in the peewee division this season.","zh":"这一季她参加的是最小年龄组。"},{"en":"My brother started with peewee baseball.","zh":"我弟弟是从少棒入门组开始打球的。"}]},{"partOfSpeech":"n.","definition":{"en":"a small North American songbird (a type of flycatcher), as in “wood pewee” or “eastern wood-pewee”","zh":"（北美）小型鸣禽——一种鹟科捕蝇鸟（如 wood pewee：林鹟）"},"examples":[{"en":"We heard a pewee calling from the forest edge.","zh":"我们听到森林边缘有只林鹟在叫。"}]}],"synonyms":["small fry","tiny kid","little one","runt"],"phonetic":"ˈpiːwiː","extraExplanation":["“peewee”更常见的拼写是 **peewee**；你输入的 **pewee** 常见于鸟类名称（如 *wood pewee*），也可见作“peewee”的变体拼写。","“peewee（小个子）”在口语里通常语气轻松、带点可爱或调侃；形容成年人时要注意语境，避免让对方觉得被贬低。","体育里的“peewee”是一种传统分组叫法，具体年龄范围会因运动项目与地区而不同。"]}
{"word":"pewees","summary":{"en":"“Pewees” most commonly means small North American flycatcher birds (plural of pewee). It can also be a less common spelling of “peewees,” meaning very small kids or things.","zh":"“Pewees”最常见指北美小型捕蝇鸟（pewee 的复数）。它也可能是“peewees”的较少见拼写，表示很小的孩子或很小的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pewee: a small North American songbird (a type of flycatcher), known for its clear “pee-wee” call.","zh":"pewee 的复数：一种北美的小型鸣禽（捕蝇鸟类的一种），因其清晰的“pee-wee”叫声而得名。"},"examples":[{"en":"Pewees often sit quietly on a branch and suddenly fly out to catch insects.","zh":"Pewees 常常安静地停在树枝上，然后突然飞出去捕捉昆虫。"},{"en":"We heard pewees calling near the forest edge at dawn.","zh":"黎明时分，我们在林缘听到 pewees 的叫声。"}]},{"partOfSpeech":"n.","definition":{"en":"Sometimes used as a spelling of peewees (plural of peewee): very small people/children, or things that are unusually small.","zh":"有时也被当作 peewees（peewee 的复数）的拼写：指很小的人/孩子，或特别小的事物。"},"examples":[{"en":"The team was made up of peewees, but they played with confidence.","zh":"这支队伍由小孩子组成，但他们踢得很有自信。"},{"en":"These are pewee portions—can we order more food?","zh":"这些分量也太小了吧——我们能再点一些吗？"}]}],"synonyms":["flycatchers (for the bird sense)","peewees (common spelling for the 'small' sense)","small children","tiny things"],"phonetic":"/ˈpiːˌwiː/","extraExplanation":["“Pewee”这个鸟名属于拟声词（onomatopoeia），来自它的叫声“pee-wee”。在自然观察或鸟类图鉴里更常见拼写是 pewee。","如果你想表达“很小的（人/东西）”，现代英语里更常用拼写是 “peewee”（如：a peewee league 指少儿联赛）。"]}
{"word":"pewfellow","summary":{"en":"A “pewfellow” is someone who sits with you (or near you) in the same church pew.","zh":"“pewfellow”指在教堂里与你同坐（或坐在你旁边）同一排长椅的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who regularly sits in the same church pew as you; a fellow member of the congregation you sit near","zh":"（教堂里）常和你坐在同一排长椅（pew）上的人；与你坐得很近的同堂礼拜者"},"examples":[{"en":"After a few Sundays, I started chatting with my pewfellow before the service.","zh":"连续几个星期天之后，我开始在礼拜开始前和我的同排礼拜者聊天。"},{"en":"She brought extra hymnbooks to share with her pewfellow.","zh":"她多带了几本赞美诗集和同排的人一起用。"},{"en":"Even if you don’t know your pewfellow’s name, a quiet greeting is common.","zh":"即使你不知道同排礼拜者的名字，轻声问候也很常见。"}]}],"synonyms":["churchmate","fellow worshipper","fellow congregant","seatmate (at church)"],"phonetic":"/ˈpjuˌfɛloʊ/","extraExplanation":["这个词由 pew（教堂里的长椅）+ fellow（同伴）组成，语感偏传统、书面或宗教语境；在现代口语里更常说 “the person sitting next to me at church / a churchgoer next to me”。","pew 是许多基督教教堂里固定的长木椅；因此 pewfellow 往往暗含“在同一座教堂、固定位置、熟面孔”的感觉。"]}
{"word":"pewful","summary":{"en":"A rare adjective meaning “full of pews,” especially describing a church.","zh":"一个罕见的形容词，意为“（教堂）满是长椅/长椅坐满了人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, somewhat old-fashioned) Full of pews (fixed benches), especially in a church.","zh":"（罕见、略旧式）满是长椅座位（pews）的；（尤指）教堂里装满固定长椅的。"},"examples":[{"en":"The little village church was dark, quiet, and pewful on Sunday mornings.","zh":"这个小村庄的教堂在周日早晨昏暗而安静，长椅坐满了人。"},{"en":"They walked into a pewful sanctuary and searched for an empty seat.","zh":"他们走进一间长椅几乎坐满的礼拜堂，寻找空位。"}]}],"synonyms":["full of pews","pew-packed","packed","crowded"],"phonetic":"/ˈpjuːfəl/","extraExplanation":["“pew”指教堂里一排排固定的长椅（有时带小门或隔板），因此“pewful”字面意思就是“满是长椅/坐满长椅的”。这个词在现代英语中非常少见，更常用的表达是“full of pews”“packed (with people)”“the pews were full”。","在英语文学或描写宗教场景的叙述里，作者可能用“pewful”来营造一种古朴、教堂氛围浓厚的感觉；但日常写作中用它可能显得刻意或不自然。"]}
{"word":"pewholder","summary":{"en":"A pewholder is someone who owns or rents a specific church pew.","zh":"pewholder 指拥有或租用教堂里某个固定长椅座位的人（座位持有人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or family who owns, rents, or is assigned a particular pew (bench seat) in a church","zh":"（教堂里）拥有、租用或被分配某个长椅座位（pew）的人／家庭（座位持有人）"},"examples":[{"en":"The old records list each pewholder and the amount paid for the year.","zh":"旧档案记录了每位座位持有人以及当年的缴费金额。"},{"en":"Some pewholders donated extra money to help repair the church roof.","zh":"一些座位持有人额外捐款，帮助修缮教堂屋顶。"}]}],"synonyms":["pew renter","seat holder"],"phonetic":"/ˈpjuːˌhoʊldɚ/","extraExplanation":["“Pewholder”多见于历史或教会档案语境。过去一些教堂会实行“pew rent”（座位租金）制度：家庭付费租用固定的座位，往往与社会地位、经济能力有关；后来许多教会改为自由入座或鼓励自愿奉献，因此这个词在现代日常口语中不算常见。"]}
{"word":"pewing","summary":{"en":"“Pewing” usually means emitting something in a strong stream (smoke, steam, liquid), and informally it can mean making “pew” (laser/toy gun) sounds.","zh":"“pewing”通常指（烟、蒸汽、液体等）喷出、涌出；在非正式语境中也可指发出“pew/biu”这类拟声的射击声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"sending out something (like smoke, steam, liquid, or light) in a strong, continuous stream","zh":"（烟、蒸汽、液体、光等）喷出、涌出；成股地冒出"},"examples":[{"en":"The volcano was pewing ash into the sky.","zh":"火山正把火山灰喷向天空。"},{"en":"The broken pipe kept pewing water across the floor.","zh":"破裂的水管不断把水喷得到处都是。"},{"en":"The chimney was pewing smoke all afternoon.","zh":"烟囱整个下午都在冒烟。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, onomatopoeic) making repeated “pew” sounds like toy guns or lasers","zh":"（非正式，拟声）发出“pew（biu）”的声音（常指玩具枪/激光的声音）"},"examples":[{"en":"The kids ran around pewing and pretending to be space heroes.","zh":"孩子们跑来跑去“biu biu”地叫着，假装自己是太空英雄。"},{"en":"He was pewing at imaginary targets with a finger gun.","zh":"他用手指比作枪，对着想象的目标“biu biu”地射。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) putting pews (fixed benches) into a church or other building","zh":"（罕见）给教堂等建筑装设长椅（pews）"},"examples":[{"en":"The old chapel was being renovated and re-pewing was discussed.","zh":"那座老教堂正在翻修，人们讨论要不要重新安装长椅。"}]}],"synonyms":["spewing","spouting","gushing","belching","emitting"],"phonetic":"/pjuːɪŋ/","extraExplanation":["“pewing”是动词“pew”的现在分词/动名词形式。比较常见的正式用法是指“喷出/涌出”（尤其用于烟、蒸汽、火山灰等）。","网络或口语里，“pew/pew-pew”常作为拟声词，模仿激光枪、玩具枪的声音；写作时多用于轻松、幽默的语境。"]}
{"word":"pewit","summary":{"en":"A chiefly British word for a lapwing (northern lapwing) or its “pee-wit” call.","zh":"主要为英式用语，指凤头麦鸡（北凤头麦鸡）或其“pee-wit”叫声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly British) A lapwing (a bird), especially the northern lapwing, named after its “pee-wit” call.","zh":"（主要英式）凤头麦鸡（鸟类），尤指北凤头麦鸡；名称来自其“pee-wit”的叫声。"},"examples":[{"en":"We saw a pewit rising from the meadow and heard its sharp call.","zh":"我们看见一只凤头麦鸡从草地飞起，还听到它尖锐的叫声。"},{"en":"In old countryside stories, the pewit often appears near marshy fields.","zh":"在一些古老的乡村故事里，凤头麦鸡常出现在潮湿的田地附近。"}]},{"partOfSpeech":"n.","definition":{"en":"The “pee-wit” call of a lapwing; the sound it makes.","zh":"凤头麦鸡的“pee-wit”叫声；其发出的声音。"},"examples":[{"en":"A distant pewit echoed across the wetland.","zh":"远处传来凤头麦鸡的叫声，在湿地上回荡。"}]}],"synonyms":["peewit","lapwing"],"phonetic":"/ˈpiːwɪt/","extraExplanation":["“pewit”是“peewit”的拼写变体，更常见于英国方言或较老的文学/乡村写作中。在美式英语里更常用“lapwing”。","这类词属于拟声词（onomatopoeia）：用听起来像动物叫声的声音来命名动物。"]}
{"word":"pewits","summary":{"en":"“Pewits” means lapwings (northern lapwings), mainly in older British usage.","zh":"“pewits”指凤头麦鸡（北凤头麦鸡／北凤头鸻），多见于较旧的英式用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pewit: a bird (the northern lapwing), known for its calling sound and fluttering flight; common in older British English.","zh":"pewit 的复数：一种鸟（北凤头麦鸡／北凤头鸻，常译作“凤头麦鸡”或“凤头鸻”），因叫声与飞行姿态而得名；多见于较旧的英式英语。"},"examples":[{"en":"Pewits wheeled over the wet fields at dusk.","zh":"黄昏时，pewits 在潮湿的田野上空盘旋。"},{"en":"In older poems, “pewits” often refers to lapwings seen on open farmland.","zh":"在较早的诗歌里，“pewits”常指在开阔农田里见到的凤头麦鸡。"}]}],"synonyms":["lapwings","peewits","green plovers"],"phonetic":"/ˈpiːwɪt/","extraExplanation":["“pewit”是一种拟声词（onomatopoeia），模仿这种鸟的叫声（类似“pee-wit”）。因此在文学里看到 pewit/peewit 时，多半是在营造乡野、湿地或农田的自然氛围。","在英国文学中它偶尔会被用来象征“喧闹、爱炫耀或佯装受伤以引开捕食者”（凤头麦鸡有著名的“佯伤引敌”行为），但具体含义仍取决于语境。"]}
{"word":"pewless","summary":{"en":"“Pewless” means “without church pews (fixed benches),” often describing a more open, flexible worship space.","zh":"“pewless”意为“没有教堂长椅（固定长凳）的”，常用于描述更开阔、灵活的礼拜空间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no pews (fixed benches), especially in a church or chapel.","zh":"（尤指教堂、礼拜堂）没有长椅（pew，固定座椅）的。"},"examples":[{"en":"The chapel is pewless, so people can arrange chairs for different events.","zh":"这座礼拜堂没有长椅，所以大家可以为不同活动摆放椅子。"},{"en":"A pewless church often feels more open and flexible for modern services.","zh":"没有长椅的教堂常常给人更开阔、更灵活的感觉，适合现代礼拜。"}]}],"synonyms":["without pews","benchless (in a church context)","unpewed"],"phonetic":"/ˈpjuːləs/","extraExplanation":["“pew”指传统教堂里成排固定的长椅；“pewless”多见于建筑、宗教或历史语境，强调空间不被固定座位限制。现代一些教堂改为可移动椅子，也会被描述为pewless。"]}
{"word":"pewmate","summary":{"en":"“Pewmate” means someone who sits with you (or near you) in the same church pew.","zh":"“pewmate”指在教堂里和你坐同一排长椅（或附近）的礼拜同伴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who sits in the same pew as you in a church (or someone you regularly sit near during services).","zh":"（非正式）在教堂里和你坐同一排长椅（pew）的人；（引申）你在礼拜中经常坐在附近的同伴。"},"examples":[{"en":"I always save a seat for my pewmate before the service starts.","zh":"礼拜开始前，我总会给我的“同排座位伙伴”留个位置。"},{"en":"Her pewmate whispered the hymn number to her.","zh":"坐在她旁边的同排座位伙伴小声告诉她圣诗编号。"},{"en":"After church, I introduced myself to my pewmate for the first time.","zh":"礼拜结束后，我第一次向坐在我旁边的那位同排座位伙伴自我介绍。"}]}],"synonyms":["seatmate","neighbor (in church)","churchmate"],"phonetic":"/ˈpjuːmeɪt/","extraExplanation":["“pewmate”是由“pew（教堂长椅）+ mate（伙伴）”组成的合成词，语气轻松，常见于教会语境或社群交流中，但不算特别正式。","不同教派/地区对座位称呼不一：有的教堂是长椅（pews），有的是独立座椅（chairs）。即便没有长椅，也有人借用“pewmate”来指“礼拜时坐你旁边的人”。"]}
{"word":"pews","summary":{"en":"“Pews” means the long benches/seats in a church.","zh":"“pews”指教堂里的长排座位（长凳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long, fixed benches in a church (plural of “pew”), where people sit during services.","zh":"（教堂里的）长排长凳；教堂座位（“pew”的复数），礼拜时人们坐的地方。"},"examples":[{"en":"We sat in the front pews during the wedding.","zh":"婚礼时我们坐在前排的教堂长凳上。"},{"en":"The old wooden pews were polished and quiet.","zh":"老旧的木质教堂长凳被擦得发亮，周围很安静。"},{"en":"Tourists were not allowed to eat in the pews.","zh":"游客不被允许在教堂座位上吃东西。"}]}],"synonyms":["church benches","church seats","benches"],"phonetic":"/pjuː/","extraExplanation":["“pew”最常见于基督教教堂语境，指固定在地面的长凳；在一些现代教堂里也可能改用可移动的椅子。","在英语里，坐在“front pews / back pews”有时也会带出一种文化含义：前排常给更投入或更显眼的人，后排则更低调（具体因教会而异）。"]}
{"word":"pewter","summary":{"en":"Pewter is a gray tin-based metal used for household items, and it also describes a dull gray color.","zh":"Pewter指一种以锡为主的灰色合金（白镴），也可指类似白镴的暗灰色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gray metal alloy (traditionally mostly tin) used to make objects like cups, plates, and decorative items.","zh":"（白镴）一种灰色的金属合金（传统上以锡为主），常用于制作杯子、盘子和装饰品等。"},"examples":[{"en":"They served soup in old pewter bowls.","zh":"他们用旧的白镴碗盛汤。"},{"en":"The museum displayed pewter mugs from the 1700s.","zh":"博物馆展出了18世纪的白镴啤酒杯。"}]},{"partOfSpeech":"adj.","definition":{"en":"A dull gray color similar to the metal pewter.","zh":"类似白镴金属的暗灰色（颜色）。"},"examples":[{"en":"He chose a pewter paint color for the living room.","zh":"他为客厅选了白镴灰的油漆颜色。"},{"en":"She wore a pewter-gray coat in winter.","zh":"冬天她穿了一件白镴灰的大衣。"}]}],"synonyms":["(metal) tin alloy","(color) gray","(color) slate-gray"],"phonetic":"/ˈpjuːtɚ/","extraExplanation":["“pewter”传统上主要由锡（tin）制成，常混合少量铜、锑等金属来增加硬度。早期的pewter有时含铅（lead），现代食品级制品一般不含铅。","在文学或历史语境中，pewter常用来营造“古旧、朴素、带有年代感”的氛围，比如描写酒馆里的pewter mugs（白镴啤酒杯）。"]}
{"word":"pewterer","summary":{"en":"A pewterer is someone who makes or sells pewter items.","zh":"pewterer 指制作或售卖白镴器的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes, works with, or sells pewter goods (metal objects made mainly from tin, such as cups, plates, and small containers).","zh":"白镴匠；白镴器制造者／经营者（制作、加工或售卖以锡为主的合金器物，如杯、盘和小容器的人）。"},"examples":[{"en":"In the old town, a pewterer still makes handmade cups and plates.","zh":"在那座老城里，仍有白镴匠在手工制作杯子和盘子。"},{"en":"The museum label says the tankard was produced by a London pewterer in the 1700s.","zh":"博物馆的说明牌写道，这只啤酒杯是18世纪伦敦的一位白镴匠制作的。"}]}],"synonyms":["pewter smith","metalworker","craftsman"],"phonetic":"/ˈpjuːtərər/","extraExplanation":["“pewterer”常见于历史语境，尤其是中世纪到近代早期的欧洲城市。那时白镴器是日常餐具的重要材料之一，比银器便宜、比木器更耐用。","在英国等地，pewterers 曾组成行会（guild），对原料成分、器物品质与学徒制度有严格规范，因此在历史文献或小说中出现时，常带有“传统手工业/行会城市生活”的氛围。"]}
{"word":"pewterers","summary":{"en":"Pewterers are people who make or sell pewter goods, especially in historical contexts.","zh":"pewterers 指制作或经营白镴器的人（多用于历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes, works with, or sells pewter (a soft metal alloy often used for dishes, cups, and decorative objects), especially as a traditional craft or trade.","zh":"白镴匠；白镴器制造者/经营者（从事白镴这种金属合金器物的制作、加工或销售，尤指传统手工业行当）。"},"examples":[{"en":"In medieval cities, pewterers supplied everyday plates and cups for ordinary households.","zh":"在中世纪的城市里，白镴匠为普通家庭提供日常用的盘子和杯子。"},{"en":"The museum displays tankards stamped with the marks of London pewterers.","zh":"博物馆展出了印有伦敦白镴匠标记的啤酒杯。"}]}],"synonyms":["pewterer (singular)","metalworker","craftsperson","artisan"],"phonetic":"/ˈpjuːtərərz/","extraExplanation":["“pewterers”是复数形式，单数是“pewterer”。这个词常见于历史语境（如欧洲中世纪与近代城市行会制度）。在英国尤其有名的是伦敦的 Worshipful Company of Pewterers（白镴匠同业公会/行会），用于管理行业、培训学徒、制定工艺标准等。","白镴（pewter）传统上常用于餐具与容器；现代白镴通常不含铅，更适合装饰品与纪念品。阅读历史小说或博物馆说明文字时常会遇到该词。"]}
{"word":"pewters","summary":{"en":"“Pewters” usually means multiple pewter items—objects made from a tin-based metal alloy or things with a dull silver-gray “pewter” look.","zh":"“pewters”通常指多件白镴制品——用以锡为主的合金做成的物品，或具有暗淡银灰色“白镴感”的外观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, silver-gray metal alloy (usually tin mixed with other metals) used to make tableware, decorative objects, and small items","zh":"白镴；一种柔软的银灰色合金（金属混合物，通常以锡为主并混入其他金属），常用于制作餐具、装饰品和小物件"},"examples":[{"en":"The museum displayed pewters from the 1700s, including plates and drinking mugs.","zh":"博物馆展出了18世纪的白镴制品，包括盘子和啤酒杯。"},{"en":"She bought a set of pewter candlesticks at the antique market.","zh":"她在古董市场买了一套白镴烛台。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of pewter; having a dull silver-gray color like pewter","zh":"白镴制的；（颜色）像白镴一样暗淡的银灰色"},"examples":[{"en":"He wore a ring with a pewter finish.","zh":"他戴着一枚带白镴质感表面的戒指。"},{"en":"The walls were painted a pewter gray.","zh":"墙被刷成了白镴灰。"}]}],"synonyms":["pewterware","tin alloy","metalware"],"phonetic":"/ˈpjuːtɚ/","extraExplanation":["“pewters”通常是名词复数，表示“多件白镴制品”（例如一批白镴盘、杯、烛台等）。在古董或博物馆语境里，人们常说 “colonial pewters / antique pewters”。","历史上白镴常用于餐具，因为外观像银但更便宜；现代白镴多为“无铅白镴（lead-free pewter）”，更安全，也常用于纪念品和装饰品。"]}
{"word":"pewterwort","summary":{"en":"Pewterwort is a rare old word meaning a plant with silvery-gray leaves; the exact species isn’t fixed.","zh":"Pewterwort 是罕见的旧词，指叶色银灰的植物俗名，但具体物种并不固定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, old-fashioned) A folk name for a plant; it usually refers to a gray‑ or silvery‑leaved herb (the exact species can vary by region and time period).","zh":"（罕见、较古旧）一种植物的俗名；通常指叶色呈灰银、带“锡器般”光泽的草本植物（具体指哪一种会因地区与时代而不同）。"},"examples":[{"en":"In some old herbals, “pewterwort” is listed among plants with silvery leaves.","zh":"在一些古老的《本草书》中，“pewterwort”被列在叶色银灰的植物之中。"},{"en":"The word pewterwort is uncommon in modern English, so a dictionary or botanical note may be needed for the exact plant.","zh":"pewterwort 在现代英语里很少见，因此往往需要查词典或植物学注释才能确定具体指哪种植物。"}]}],"synonyms":["(none fixed; sometimes compared with other “-wort” plant names)"],"phonetic":"/ˈpjuːtərˌwɝːt/","extraExplanation":["“wort”是古英语系词素，意思是“植物/草药”（常见于旧植物名，如 St. John’s wort）。因此 pewter + wort 字面可理解为“像锡器颜色的草”。","这类民间植物名在不同地区可能指向不同物种；阅读古籍或文学文本时，最好结合作者年代、产地，以及旁边的形容词（如 silver, gray, herb）来判断。"]}
{"word":"pewtery","summary":{"en":"Pewtery means “made of pewter” or “having a dull gray, metallic pewter-like color.”","zh":"pewtery 指“白镴制的”，也常指“带暗灰金属感的白镴色”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of pewter, or resembling pewter in color (a dull gray, slightly metallic look).","zh":"由白镴（锡合金）制成的；或颜色像白镴的（暗灰色、略带金属光泽）。"},"examples":[{"en":"She wore a pewtery gray coat on the rainy day.","zh":"下雨那天，她穿了一件带白镴灰色调的外套。"},{"en":"The sky turned pewtery before the storm.","zh":"暴风雨来临前，天空变成了暗灰的“白镴色”。"}]}],"synonyms":["pewter-colored","gray","slate-gray","metallic gray"],"phonetic":"/ˈpjuːtəri/","extraExplanation":["“pewtery”来自名词“pewter（白镴）”。Pewter 是一种以锡为主的金属合金，历史上常用来做餐具、酒壶、烛台等。描述颜色时，“pewtery”常指一种低饱和、偏冷的暗灰金属色，文学里常用来写阴天、海面或暴风雨前的天空。"]}
{"word":"pewy","summary":{"en":"“Pewy” means dull gray or dingy-looking, like an old church pew (or pewter).","zh":"“pewy”指像旧教堂长椅（或白镴）那样暗淡的灰色、略显陈旧的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pew (a long wooden bench in a church), or having the dull, gray, slightly dingy look often associated with old pews or pewter.","zh":"像教堂长椅（pew）的；或呈现出类似旧长椅/白镴那种暗淡、灰灰的、略显陈旧的颜色与质感。"},"examples":[{"en":"The hallway walls were painted a pewy gray that made the space feel colder.","zh":"走廊的墙刷成了暗淡的灰色，让空间显得更冷清。"},{"en":"In the old church, the pewy wooden benches smelled of polish and age.","zh":"在那座老教堂里，灰暗陈旧的木长椅带着蜡油和岁月的味道。"}]}],"synonyms":["grayish","dull","dingy","drab","ashen"],"phonetic":"/ˈpjuːi/","extraExplanation":["“pewy”比较少见，多用于描写“颜色/氛围”的感觉：暗灰、低饱和、带点旧旧的。它来自“pew”（教堂里的长椅）。很多人也会联想到“pewter”（白镴/锡合金）那种灰灰的金属色，所以常见搭配有 pewy gray、pewy light 等。"]}
