{"word":"peyerian","summary":{"en":"An adjective meaning “related to Peyer’s patches in the small intestine.”","zh":"形容词：指“与小肠中的派尔集合淋巴结有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Peyer’s patches (small areas of immune tissue in the small intestine).","zh":"与派尔集合淋巴结（小肠中的免疫组织小团块）有关的。"},"examples":[{"en":"The report described Peyerian lymphoid tissue in the ileum.","zh":"报告描述了回肠中的派尔相关淋巴组织。"},{"en":"Peyerian patches help monitor bacteria in the gut.","zh":"派尔集合淋巴结有助于监测肠道中的细菌。"}]}],"synonyms":["Peyer’s (as in “Peyer’s patches”)","ileal lymphoid (context-dependent)"],"phonetic":"/paɪˈɪriən/","extraExplanation":["“Peyerian”来自解剖学名词“Peyer’s patches（派尔集合淋巴结）”，以17世纪瑞士解剖学家 Johann Conrad Peyer 命名。","在医学英语里更常见的搭配是 “Peyer’s patches” 本身；“Peyerian”多见于较正式或学术性的写法，例如 “Peyerian lymphoid tissue（派尔相关淋巴组织）”。"]}
{"word":"peyote","summary":{"en":"Peyote is a small cactus (or a drug from it) known for its hallucinogenic effects and its ceremonial use in some Indigenous traditions.","zh":"佩奥特是一种小型仙人掌（或由其制成的致幻物质），以致幻作用及在部分原住民传统中的仪式性使用而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small cactus (Lophophora williamsii) that contains mescaline and has been used in some Indigenous ceremonies and as a hallucinogenic drug.","zh":"一种含有麦司卡林（mescaline）的矮小仙人掌（佩奥特/洛福福拉），在一些美洲原住民宗教仪式中使用，也可能被当作致幻类毒品使用。"},"examples":[{"en":"Peyote has a long history in certain Indigenous religious ceremonies.","zh":"佩奥特在某些美洲原住民的宗教仪式中有悠久历史。"},{"en":"Possessing peyote is illegal in many places, except under specific religious exemptions.","zh":"在许多地区，持有佩奥特是违法的，但某些宗教用途可能有特殊豁免。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug made from peyote that causes hallucinations.","zh":"由佩奥特制成、会引起幻觉的致幻药物。"},"examples":[{"en":"The film shows a character who takes peyote and experiences vivid visions.","zh":"电影里有个角色服用佩奥特后出现了强烈的幻象。"},{"en":"He spoke about peyote as a powerful substance that should not be used casually.","zh":"他谈到佩奥特是一种很强的物质，不应随意使用。"}]}],"synonyms":["mescaline (active chemical)","hallucinogen","cactus"],"phonetic":"/peɪˈoʊti/","extraExplanation":["“Peyote”常与北美原住民（尤其是纳瓦霍、科曼奇等地区传统，以及美洲原住民教会 Native American Church 的部分仪式）相关。谈论时建议尊重其宗教与文化语境，避免将其简单等同于“娱乐性毒品”。","在英语媒体与文学里，peyote 有时被用作“通往异象/意识改变”的意象，但现实中它也涉及法律、健康与文化挪用等议题。"]}
{"word":"peyotes","summary":{"en":"“Peyotes” is the plural of “peyote,” meaning the peyote cactus or (by extension) dried peyote used for its psychoactive effects.","zh":"“Peyotes”是“peyote”的复数，指佩奥特仙人掌，或引申指用于致幻效果的干燥佩奥特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of peyote) A small cactus from the deserts of Mexico and the southwestern U.S., known for containing mescaline (a psychoactive substance).","zh":"（peyote 的复数）一种生长在墨西哥及美国西南部沙漠地区的小型仙人掌，含有麦司卡林（mescaline，致幻成分）。"},"examples":[{"en":"Peyotes grow slowly and are native to arid regions.","zh":"佩奥特仙人掌生长缓慢，原产于干旱地区。"},{"en":"Some books describe peyotes as part of desert ecology.","zh":"一些书把佩奥特仙人掌描述为沙漠生态的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Dried peyote buttons used as a psychoactive drug; often discussed in the context of Indigenous ceremonial traditions and controlled-substance laws.","zh":"（复数）晒干后的“佩奥特圆片”（peyote buttons），可作为致幻药物；常在原住民仪式传统与管制药物法律的语境中被讨论。"},"examples":[{"en":"The article mentioned peyotes in a discussion of religious freedom and drug laws.","zh":"那篇文章在讨论宗教自由与毒品法律时提到了佩奥特。"},{"en":"He read about peyotes in a history class, not as a recommendation to use them.","zh":"他是在历史课上了解佩奥特的，并不是在被建议使用它。"}]}],"synonyms":["peyote cactus","peyote buttons"],"phonetic":"/peɪˈjoʊti/","extraExplanation":["“Peyote”在英语里既可指这种仙人掌本身，也可指其被干燥后的“圆片（buttons）”用于致幻用途；复数就是“peyotes”。","佩奥特与部分北美原住民的宗教/仪式传统有关，英语材料中谈到它时往往带有文化与法律背景（不同地区对其使用有不同限制或豁免）。在写作中，若强调文化语境，宜避免把它简单等同于“毒品”。","常见搭配：peyote cactus（佩奥特仙人掌）, peyote buttons（佩奥特圆片）, peyote ceremony（佩奥特仪式）。"]}
{"word":"peyotism","summary":{"en":"Peyotism is a religion or religious practice centered on peyote ceremonies, especially in some Indigenous North American traditions.","zh":"Peyotism 指以佩奥特仪式为核心的宗教或宗教实践，尤其与北美部分原住民传统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious practice or belief system that involves the ceremonial use of peyote (a cactus containing mescaline), especially in some Indigenous North American traditions","zh":"一种宗教实践或信仰体系，以仪式性使用佩奥特仙人掌（含麦司卡林成分）为核心，尤其见于北美部分原住民传统"},"examples":[{"en":"Researchers have written about peyotism in relation to the Native American Church.","zh":"研究者曾讨论“佩奥特教”（peyotism）与美国原住民教会之间的关系。"},{"en":"In some communities, peyotism is understood as a form of healing and prayer rather than recreational drug use.","zh":"在一些社群中，peyotism 更被理解为疗愈与祈祷的一种方式，而不是娱乐性用药。"}]}],"synonyms":["peyote religion","peyote ceremonialism","Native American Church practice"],"phonetic":"/ˈpeɪoʊˌtɪzəm/","extraExplanation":["“Peyotism”常见于学术或历史写作中，用来指与“peyote（佩奥特仙人掌）”相关的宗教仪式传统；日常交流里更常直接说“the Native American Church”或“peyote ceremonies”。","涉及原住民宗教与圣植物时，英语写作通常会避免把它简单归类为“drug use（吸毒）”，而会使用更尊重的表达，如“ceremonial use（仪式性使用）”“sacramental use（圣礼性使用）”。"]}
{"word":"peyotl","summary":{"en":"Peyotl (more commonly spelled peyote) is a small cactus used traditionally in some Indigenous ceremonies and known for its hallucinogenic effects.","zh":"Peyotl（更常见拼写为 peyote）是一种小型仙人掌，传统上在部分原住民仪式中使用，也因致幻作用而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, spineless cactus (peyote) whose dried tops contain mescaline, used traditionally in some Indigenous North American ceremonies and also known for its hallucinogenic effects.","zh":"一种小型无刺仙人掌（佩奥特/佩奥特仙人掌，peyote），其干燥顶部含有麦司卡林（mescaline），在北美部分原住民传统仪式中使用，也因其致幻作用而闻名。"},"examples":[{"en":"In some Native American religious ceremonies, peyotl is treated as a sacred medicine rather than a recreational drug.","zh":"在一些美洲原住民的宗教仪式中，peyotl 被视为神圣的“药”，而不是娱乐性毒品。"},{"en":"The documentary explained how peyotl has cultural and spiritual importance in certain communities.","zh":"这部纪录片解释了 peyotl 在某些社群中的文化与精神重要性。"}]}],"synonyms":["peyote","mescal button","peyote cactus"],"phonetic":"/peɪˈoʊti/","extraExplanation":["“peyotl”是从纳瓦特尔语（Nahuatl）借入的拼写形式；英语中更常见的拼写是“peyote”。","在许多语境里，peyotl/peyote 与北美原住民宗教传统有关；谈论时要注意尊重其文化与宗教意义。","法律规定因国家/地区而异：有些地方对其宗教用途有特定豁免，但对一般持有或使用仍可能限制严格。"]}
{"word":"peyotls","summary":{"en":"“Peyotls” is the plural of “peyotl/peyote,” a small cactus used in some Indigenous ceremonies and known for its hallucinogenic effects.","zh":"“Peyotls”是“peyotl/peyote”的复数，指一种小型仙人掌，在部分原住民仪式中使用，也因致幻作用而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of peyotl: small, spineless cactus (peyote) containing mescaline; traditionally used in some Indigenous ceremonies and also known as a hallucinogenic drug.","zh":"peyotl 的复数：一种无刺小型仙人掌（即 peyote / 佩奥特仙人掌），含有麦司卡林；在部分原住民传统仪式中被使用，也因其致幻作用而被视为一种药物/毒品。"},"examples":[{"en":"Some researchers study peyotls to understand how mescaline affects perception.","zh":"一些研究人员研究 peyotls，以了解麦司卡林如何影响知觉。"},{"en":"In respectful discussions, it’s important to mention that peyotls are connected to specific Indigenous religious traditions.","zh":"在尊重的讨论中，重要的是说明 peyotls 与特定原住民的宗教传统有关。"}]}],"synonyms":["peyotes","peyote buttons","mescal buttons"],"phonetic":"/peɪˈoʊtəlz/","extraExplanation":["“Peyotl / peyote”在北美部分原住民文化中具有宗教与治疗意义（例如与某些仪式相关）。在学习或写作时，建议使用尊重、准确的表述，避免将其简单等同为“毒品”。","“Peyotls”是复数形式；更常见的单数拼写是“peyote”，而“peyotl”多见于较学术或历史语境（来自纳瓦特尔语 náhuatl 的词源）。","不同国家/地区对 peyote/mescaline 的法律规定差异很大；若涉及旅行、携带或研究，应先查当地法律与伦理规范。"]}
{"word":"peyotyl","summary":{"en":"Peyote (also spelled peyotl) is a small cactus; it can also mean the hallucinogenic drug made from it.","zh":"Peyote（也写作 peyotl）指一种小型仙人掌；也可指由它制成的致幻物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, spineless cactus from northern Mexico and the U.S. Southwest, traditionally used in some Indigenous ceremonies.","zh":"一种无刺小型仙人掌，原产于墨西哥北部和美国西南部；在一些原住民传统仪式中有使用。"},"examples":[{"en":"Peyote grows slowly in dry desert regions.","zh":"佩奥特仙人掌在干旱的沙漠地区生长得很慢。"},{"en":"Some communities treat peyote as a sacred plant.","zh":"一些群体把佩奥特视为神圣的植物。"}]},{"partOfSpeech":"n.","definition":{"en":"A hallucinogenic drug made from this cactus, containing mescaline.","zh":"由该仙人掌制成的致幻物质（含麦司卡林/美沙卡林）。"},"examples":[{"en":"Peyote can cause strong changes in perception.","zh":"佩奥特可能会引起强烈的感知变化。"},{"en":"The report warned about the health risks of using peyote as a drug.","zh":"报告警告了把佩奥特当作药物使用的健康风险。"}]}],"synonyms":["peyotl","mescal button"],"phonetic":"/peɪˈoʊti/","extraExplanation":["你输入的“peyotyl”更常见的拼写是 **peyote**（也可写作 **peyotl**，来源于纳瓦特尔语 *peyōtl*）。英语里最常用的是 peyote。","文化语境上，peyote 在部分北美原住民宗教传统中具有神圣意义；谈到它时，用词应避免把所有使用都简单等同于“毒品”。","法律与社会语境因国家/地区而异；在写作或讨论中，如果涉及现实使用，最好说明是宗教/传统用途还是非医疗用途。"]}
{"word":"peyotyls","summary":{"en":"“peyotyls” is likely a misspelling of “peyotls,” the plural of “peyotl” (more commonly “peyote”).","zh":"“peyotyls”很可能是“peyotls”的误拼；它是“peyotl”（更常见写作“peyote”）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) peyotl; a less common spelling of peyote: a small cactus from Mexico and the U.S. Southwest that contains mescaline and has been used in some Indigenous religious ceremonies.","zh":"（复数）peyotl 的一种不常见拼写；通常写作 peyote：一种产于墨西哥和美国西南部的小型仙人掌，含有麦司卡林（mescaline），在部分原住民宗教仪式中有使用传统。"},"examples":[{"en":"Some books spell it as “peyotl,” but “peyote” is more common in modern English.","zh":"有些书会拼作“peyotl”，但现代英语里更常见的是“peyote”。"},{"en":"Laws about peyote can be different depending on the country or state.","zh":"关于佩奥特（peyote）的法律会因国家或州而不同。"}]}],"synonyms":["peyote","peyotl"],"phonetic":"/peɪˈoʊti/","extraExplanation":["“peyotl/peyote”一词来自纳瓦特尔语（Nahuatl）peyōtl。英语里最常见的形式是 peyote；你输入的 peyotyls 很可能是把复数拼写成了 -yls。","这是涉及致幻物质与原住民宗教传统的词汇，使用时要注意文化尊重与语境（历史、宗教、人类学），避免把它当作娱乐性“毒品”话题来随意调侃。"]}
{"word":"peyton","summary":{"en":"Peyton is most commonly used as an English given name, and it can also be a surname or a place name.","zh":"Peyton 最常见是英文名，也可作英文姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name (first name), used for people of any gender but more common for boys in the U.S.","zh":"（人名）佩顿：常见的英文名字（名），在美国更常见于男孩，也可用于其他性别。"},"examples":[{"en":"Peyton is starting a new job next week.","zh":"佩顿下周要开始一份新工作。"},{"en":"My friend Peyton loves basketball.","zh":"我的朋友佩顿很喜欢篮球。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname/last name).","zh":"（姓氏）佩顿：用作英文姓（姓/姓氏）。"},"examples":[{"en":"Dr. Peyton will see you now.","zh":"佩顿医生现在可以为您看诊了。"},{"en":"Her last name is Peyton.","zh":"她的姓是佩顿。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in the U.S. (for example, some towns/areas are named Peyton).","zh":"（地名）佩顿：美国一些地区/小镇的名称。"},"examples":[{"en":"They drove through Peyton on their way to the mountains.","zh":"他们去山里路上开车经过了佩顿。"}]}],"synonyms":["Payton (common spelling variant)"],"phonetic":"/ˈpeɪtən/","extraExplanation":["“Peyton”多被认为源自古英语地名含义，常被解释为“某人的聚落/城镇（-ton 表示 town/settlement）”。在现代英语里主要作为人名或姓氏使用。","在美国文化中，“Peyton”也让不少人联想到著名橄榄球四分卫 Peyton Manning（佩顿·曼宁），因此这个名字在体育语境里辨识度较高。"]}
{"word":"peytral","summary":{"en":"A (rare) harness strap that goes across a horse’s chest.","zh":"（较少见）指横过马胸前的马具皮带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strap or band of a horse’s harness that goes across the chest (the breast), helping support or pull a load.","zh":"（马具的）胸带；横过马胸前的皮带，用来支撑或牵引载具。"},"examples":[{"en":"The driver checked the peytral to make sure it wasn’t rubbing the horse’s chest.","zh":"车夫检查了胸带，确保它不会磨到马的胸口。"},{"en":"In the old painting, you can see the peytral decorated with small metal studs.","zh":"在那幅旧画里，你能看到胸带上装饰着小金属铆钉。"}]}],"synonyms":["breastplate","breast strap","breastband"],"phonetic":"/ˈpeɪtrəl/","extraExplanation":["“peytral”是比较少见、偏历史/马具领域的词，现代英语中更常用的说法是“breastplate”或“breast strap”。","词源与法语有关，来自表示“胸部”的词（类似法语“poitrail”），所以它指的就是横在马胸前的那条带子。"]}
{"word":"peytrals","summary":{"en":"“peytrals” isn’t a standard English word; it most likely means “portrayals” (representations/descriptions).","zh":"“peytrals”不是标准英语词；最可能是想写“portrayals”（描写/呈现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “portrayals”) plural of “portrayal”: descriptions or representations of someone or something in words, art, film, etc. Example: “The movie’s portrayals of family life feel realistic.”","zh":"（可能想写：portrayals）portrayal 的复数：对某人/某事的描写或呈现（通过文字、绘画、电影等）。例：The movie’s portrayals of family life feel realistic（这部电影对家庭生活的呈现很真实）。"},"examples":[{"en":"Her portrayals of historical figures are detailed and respectful.","zh":"她对历史人物的呈现细致且尊重。"},{"en":"News portrayals can influence how people see a community.","zh":"新闻中的呈现方式会影响人们如何看待一个群体。"}]}],"synonyms":["representations","depictions","descriptions","renderings"],"phonetic":"/pɔrˈtreɪəlz/","extraExplanation":["“peytrals”不是标准英语单词，常见情况下是拼写错误。你可能想输入的是：\n1) portrayals（描写/呈现的复数，最常见）\n2) portraits（肖像/画像的复数）\n如果你告诉我它出现的句子或语境（例如在文章/游戏/聊天里看到的），我可以更准确判断你要找的词。"]}
{"word":"peytrel","summary":{"en":"Petrel = a seabird often seen over the ocean, sometimes linked with stormy weather.","zh":"Petrel（海燕）= 常见于海上的一种海鸟，有时传统上与风暴天气联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seabird that spends most of its life over the ocean, often seen gliding low above waves; many kinds are associated with windy or stormy weather","zh":"一种海鸟，大多时间在海上活动，常贴近海浪滑翔；许多种类常与大风或暴风雨天气联系在一起"},"examples":[{"en":"We spotted a petrel skimming the waves just before the rain started.","zh":"雨开始下之前，我们看到一只海燕贴着海浪掠过。"},{"en":"Petrels can travel long distances across open ocean.","zh":"海燕能在辽阔的海面上长距离飞行。"}]}],"synonyms":["seabird","storm petrel","shearwater"],"phonetic":"/ˈpɛtrəl/","extraExplanation":["你输入的“peytrel”很可能是拼写错误；更常见的英文单词是 **petrel**（海燕）。","“petrel”常出现在航海、海洋生态与自然写作中；其中 **storm petrel**（海燕的一类）在一些文化与文学里会被视为“风暴将至”的象征，但这更多是传统印象，不是科学预报。"]}
{"word":"peytrels","summary":{"en":"Petrel = an ocean seabird; metaphorically (stormy petrel), someone/something that brings trouble or upheaval.","zh":"petrel = 海燕（外海海鸟）；比喻用法（stormy petrel）指带来麻烦或动荡的人/事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seabird that lives mostly over the open ocean, with long wings and a gliding flight; petrels often follow ships and feed on fish and other sea life.","zh":"一种主要生活在外海的海鸟，翅膀较长，常以滑翔飞行为主；海燕常会跟随船只，捕食鱼类等海洋生物。"},"examples":[{"en":"We saw petrels gliding low over the waves.","zh":"我们看到海燕贴着海浪低空滑翔。"},{"en":"Petrels often appear around fishing boats at sea.","zh":"在海上，海燕常会出现在渔船附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in the phrase “stormy petrel”) A person or thing that seems to bring trouble, conflict, or strong change.","zh":"（常用于短语“stormy petrel”）指似乎会带来麻烦、冲突或强烈变化的人或事物。"},"examples":[{"en":"In the novel, he is the stormy petrel who upsets the quiet town.","zh":"在小说里，他是那个“风暴海燕”，搅乱了宁静的小镇。"},{"en":"Some saw her as a stormy petrel in the workplace, always pushing for change.","zh":"有人把她看作职场里的“风暴海燕”，总是在推动改变。"}]}],"synonyms":["seabird","ocean bird","stormy petrel (figurative)"],"phonetic":"/ˈpɛtrəl/","extraExplanation":["你输入的“peytrels”很可能是“petrels”（petrel 的复数：海燕）的拼写误差。","词源上，petrel 常被解释为与“Peter（彼得）”有关：传说这种海鸟贴着海面“行走”，让人联想到《圣经》中彼得在水面行走的故事；因此也常与风暴、海上航行的意象联系在一起。","“stormy petrel”既是“暴风海燕”（一种海燕），也常作比喻：指带来动荡或预示麻烦的角色（文学和新闻评论里较常见）。"]}
