{"word":"pf","summary":{"en":"“pf” is usually an abbreviation: in citations it can mean “page(s) following,” in electronics it can mean pF (picofarad), and informally it may refer to a profile picture (more often “pfp”).","zh":"“pf”通常是缩写：引文中可表示“及后页”，电子学中可表示 pF（皮法），在口语/网络中有时指头像（更常见写作 pfp）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) page(s) following; used in citations to mean the next page(s) after the one named.","zh":"（缩写）及后页；用于参考文献/引文中，表示所标页码之后的下一页或接下来的几页。"},"examples":[{"en":"See Smith 2020, p. 45f. for the first discussion of the idea.","zh":"关于这一观点的首次讨论，见 Smith 2020，第45页及后页（p. 45f.）。"},{"en":"The details are on pp. 120ff.","zh":"细节在第120页及其后若干页（pp. 120ff.）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., electronics) picofarad (pF), a unit of capacitance equal to 10⁻¹² farad.","zh":"（缩写，电子学）皮法（pF），电容单位，等于10⁻¹²法拉。"},"examples":[{"en":"This capacitor is rated at 22 pF.","zh":"这个电容的标称值是22皮法（22 pF）。"},{"en":"Try a smaller value, like 10 pF, to reduce noise.","zh":"试试更小的数值，比如10 pF，以减少噪声。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) profile picture (often written “pfp” more commonly than “pf”).","zh":"（缩写，非正式）头像/个人资料图片（更常写作 pfp）。"},"examples":[{"en":"Nice pf—did you draw it yourself?","zh":"你的头像不错——是你自己画的吗？"},{"en":"I changed my pf for the new season.","zh":"我为了新赛季换了头像。"}]}],"synonyms":["f./ff. (in citations)","pF (picofarad)","pfp (profile picture)"],"phonetic":"/piː ɛf/","extraExplanation":["学术引用里常见的是 f. / ff.：p. 45f. 表示“第45页及其后一页（通常是46页）”；pp. 45ff. 表示“第45页及其后多页”。有的写作习惯会把它们放在页码后面，而不是单独写“pf”。","电子学单位更标准的写法是大写 F：pF（picofarad）。在技术文档中大小写很重要。","社交媒体里“头像”更常用 pfp（profile picture）。如果只写 pf，语境不清时可能需要补充说明。"]}
{"word":"pfaffian","summary":{"en":"A Pfaffian is a mathematical quantity for skew-symmetric matrices; its square equals the determinant.","zh":"Pfaffian 是反对称矩阵上的一种数学量，其平方等于该矩阵的行列式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In mathematics, a special function of a skew-symmetric (antisymmetric) matrix whose square equals the matrix’s determinant.","zh":"（数学）Pfaffian（普法菲安/普法夫行列式）：一种作用在反对称（斜对称）矩阵上的特殊量，它的平方等于该矩阵的行列式。"},"examples":[{"en":"For an even-dimensional skew-symmetric matrix A, det(A) equals Pf(A) squared.","zh":"对于偶数阶的反对称矩阵 A，有 det(A)=Pf(A)^2。"},{"en":"Computing the Pfaffian can be faster than computing the determinant for certain antisymmetric matrices.","zh":"对某些反对称矩阵而言，计算 Pfaffian 可能比计算行列式更高效。"},{"en":"In physics and combinatorics, Pfaffians appear when counting perfect matchings and in fermionic systems.","zh":"在物理与组合数学中，Pfaffian 常用于计数完美匹配，也出现在费米子系统的表达式里。"}]}],"synonyms":["Pfaffian (function)"],"phonetic":"/ˈpfæfiən/","extraExplanation":["“Pfaffian”来自德国数学家 Johann Friedrich Pfaff（约翰·弗里德里希·普法夫）的姓氏。它主要在“反对称矩阵/斜对称矩阵（A^T = -A）且维度为偶数”时使用，因为这时才与行列式有经典关系：det(A)=Pf(A)^2。","学习时可把它理解为“反对称矩阵的行列式的平方根（带符号）”，但要注意：它不是对所有矩阵都定义，也不是随便取行列式平方根那么简单；它有专门的代数定义与计算方法。"]}
{"word":"PFAS","summary":{"en":"PFAS are long-lasting industrial chemicals used in stain-, water-, and heat-resistant products, sometimes raising environmental and health concerns.","zh":"PFAS 是一类常用于防污、防水、耐热产品的人造化学物质，因难以分解而引发环境与健康方面的关注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of human-made chemicals called per- and polyfluoroalkyl substances, used to make products resistant to water, oil, stains, or heat; they can persist in the environment for a long time","zh":"一类人造化学物质，称为“全氟和多氟烷基物质”（PFAS），常用于让产品防水、防油、防污或耐热；它们在环境中可长期存在、不易分解"},"examples":[{"en":"Some nonstick pans were made using PFAS-related chemicals.","zh":"一些不粘锅曾使用与 PFAS 相关的化学物质制造。"},{"en":"The city tested its drinking water for PFAS contamination.","zh":"该市检测饮用水是否受到 PFAS 污染。"},{"en":"Many consumers look for “PFAS-free” labels when buying waterproof clothing.","zh":"许多消费者在购买防水衣物时会寻找“无 PFAS”的标签。"}]}],"synonyms":["per- and polyfluoroalkyl substances","forever chemicals"],"phonetic":"/ˈpiːfæs/","extraExplanation":["PFAS 常被媒体称为“forever chemicals（永久化学品）”，因为其中一些物质在自然环境里分解非常慢，可能在水体、土壤与生物体内累积。","“PFAS”是一个总称，不是单一化学品；常见成员包括 PFOA、PFOS 等。不同国家/地区对其限用或限值标准不完全相同，讨论时通常要看具体是哪一种 PFAS。"]}
{"word":"pfc","summary":{"en":"PFC is an acronym most commonly meaning “prefrontal cortex,” but it can also mean “power factor correction” or “perfluorinated compound,” depending on context.","zh":"PFC 是一个缩写，最常见指“前额叶皮层”，也可能指“功率因数校正”或“全氟化合物”，具体取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Prefrontal cortex: the front part of the brain involved in planning, decision-making, attention, and self-control.","zh":"（缩写）前额叶皮层：大脑前部区域，负责计划、决策、注意力与自我控制等功能。"},"examples":[{"en":"Sleep loss can make your PFC less effective, so you may act more impulsively.","zh":"睡眠不足会让你的 PFC 功能变弱，所以你可能更冲动。"},{"en":"Therapies that train focus can support PFC-related skills like self-control.","zh":"训练专注力的疗法有助于提升与 PFC 相关的能力，例如自我控制。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Power factor correction: a method used in electrical systems to improve efficiency and reduce wasted power.","zh":"（缩写）功率因数校正：电力系统中用来提高效率、减少无功损耗的一种方法。"},"examples":[{"en":"The factory installed PFC equipment to lower electricity costs.","zh":"工厂安装了 PFC 设备来降低用电成本。"},{"en":"PFC helps some devices draw power more efficiently from the grid.","zh":"PFC 帮助一些设备更高效地从电网取电。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Perfluorocarbon / perfluorinated compound: a type of fluorine-containing chemical; some PFCs are environmental pollutants.","zh":"（缩写）全氟化碳／全氟化合物：一类含氟化学物质；部分 PFC 会造成环境污染。"},"examples":[{"en":"Some PFC chemicals stay in the environment for a long time.","zh":"某些 PFC 化学物质会在环境中长期残留。"},{"en":"Scientists are studying how to reduce PFC pollution in water.","zh":"科学家正在研究如何减少水中的 PFC 污染。"}]}],"synonyms":["prefrontal cortex","power factor correction","perfluorocarbon","perfluorinated compound"],"phonetic":"ˌpiː ɛf ˈsiː","extraExplanation":["“PFC”是缩写，含义高度依赖语境：心理学/神经科学里最常指“前额叶皮层”；电气工程里常指“功率因数校正”；化学与环保新闻中常指“全氟（化合物）”。如果你把原句或领域告诉我，我可以帮你确定最准确的意思与用法。"]}
{"word":"pfd","summary":{"en":"PFD is an abbreviation most commonly meaning a Personal Flotation Device (life jacket), and it can also mean a Process Flow Diagram (engineering) or a Primary Flight Display (aviation).","zh":"PFD是缩写，最常见指个人漂浮装置（救生衣）；也可指工艺流程图（工程）或主飞行显示器（航空）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Personal Flotation Device; a life jacket or buoyant gear that helps keep a person afloat in water.","zh":"个人漂浮装置；救生衣或其他能帮助人在水中漂浮的浮力装备。"},"examples":[{"en":"Wear a PFD when you kayak, even if you’re a strong swimmer.","zh":"划皮划艇时要穿PFD，即使你很会游泳也一样。"},{"en":"The guide checked that every child had a properly fitted PFD.","zh":"向导检查每个孩子是否穿好了合身的PFD。"}]},{"partOfSpeech":"n.","definition":{"en":"Process Flow Diagram; a chart that shows the steps and equipment in an industrial or chemical process.","zh":"工艺流程图；用图表展示工业或化工流程中的步骤与设备。"},"examples":[{"en":"The engineer updated the PFD to include the new heat exchanger.","zh":"工程师更新了PFD，把新的换热器加进去。"},{"en":"Please attach the PFD and the material balance to the report.","zh":"请在报告中附上PFD和物料衡算。"}]},{"partOfSpeech":"n.","definition":{"en":"Primary Flight Display; the main cockpit screen showing key flight information such as attitude, speed, altitude, and heading.","zh":"主飞行显示器；驾驶舱里显示姿态、空速、高度、航向等关键信息的主屏幕。"},"examples":[{"en":"The pilot scanned the PFD during the approach.","zh":"飞行员在进近时扫视主飞行显示器（PFD）。"},{"en":"A failure of the PFD requires switching to standby instruments.","zh":"PFD故障时需要改用备用仪表。"}]}],"synonyms":["life jacket","life vest","flotation device","process flow diagram","primary flight display"],"phonetic":"ˌpiː ɛf ˈdiː","extraExplanation":["“PFD”是缩写，通常按字母读作“P-F-D”。最常见的含义在户外/水上安全语境里是“救生衣/漂浮装置”。在工程领域（尤其化工）里，PFD常指“工艺流程图”，而在航空领域则指“主飞行显示器”。理解时要看上下文：例如出现kayak/boating多半是救生衣；出现pump/valve/heat exchanger多半是流程图；出现cockpit/approach/altitude多半是航电显示器。"]}
{"word":"pfeffernuss","summary":{"en":"A German spiced holiday cookie, often with a peppery, warm-spice flavor.","zh":"一种德国香料节日饼干，常带胡椒与暖香料风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually round German spiced cookie (often associated with Christmas), typically flavored with pepper and warm spices like cinnamon, cloves, and nutmeg.","zh":"一种德国小型香料饼干（常与圣诞节相关），通常带有胡椒以及肉桂、丁香、肉豆蔻等暖香料的风味。"},"examples":[{"en":"We baked pfeffernüsse for the holiday cookie exchange.","zh":"我们为节日饼干交换活动烤了胡椒坚果饼（pfeffernüsse）。"},{"en":"The pfeffernuss has a peppery bite under its sweet glaze.","zh":"这块胡椒坚果饼在甜糖霜下带着一点胡椒的辛香。"}]}],"synonyms":["German spice cookie","spiced cookie","holiday cookie"],"phonetic":"/ˈpfɛfɚˌnʊs/","extraExplanation":["“Pfeffernuss”来自德语：Pfeffer（胡椒）+ Nuss（坚果）。名字里有“Nuss”，但配方不一定真的含坚果；有时会加杏仁或榛子，也常见不加坚果的版本。","英语里常见复数形式是德语复数“pfeffernüsse”（带变音符 ü），也有人写成“pfeffernuesse”或直接写“pfeffernuss cookies”。","这种饼干在德裔社区与圣诞节烘焙传统联系很深；在北美也常见于节日期间的曲奇拼盘或“cookie exchange”。"]}
{"word":"pfeifferella","summary":{"en":"“Pfeifferella” is a rare, mainly historical scientific name (an obsolete bacterial genus name).","zh":"“Pfeifferella”是一个很少见、主要出现在历史科学文献中的名称（已废弃的细菌属名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Pfeifferella: an old/obsolete scientific (Latin) genus name once used for certain bacteria, especially the organism now commonly called Burkholderia pseudomallei (the cause of melioidosis).","zh":"Pfeifferella：一个较旧/已废弃的拉丁化科学属名，曾用于某些细菌，尤其指如今通常称为 Burkholderia pseudomallei（类鼻疽的致病菌）。"},"examples":[{"en":"Older medical texts may mention Pfeifferella when discussing melioidosis.","zh":"较旧的医学文献在讨论类鼻疽时可能会提到 Pfeifferella。"},{"en":"In modern classification, Pfeifferella is generally replaced by Burkholderia in research papers.","zh":"在现代分类中，研究论文里通常用 Burkholderia 取代 Pfeifferella。"}]}],"synonyms":["(modern term) Burkholderia pseudomallei","(modern genus) Burkholderia"],"phonetic":"/ˌfaɪfərˈɛlə/","extraExplanation":["这个词几乎不作为日常英语词汇使用，多见于历史性或分类学语境（旧教材、旧论文、旧病原学命名）。","这类以人名加 -ella 构成的属名常用于纪念某位研究者；Pfeiffer- 通常与德语姓氏 Pfeiffer（“吹笛者/风笛手”一类的含义）相关。若你是在家族姓氏、网名或特定作品标题中看到它，则可能并非指细菌学名称。"]}
{"word":"pfennig","summary":{"en":"Pfennig is a former German “penny,” worth 1/100 of a Deutsche Mark before the euro.","zh":"Pfennig是德国旧时的“小钱单位/硬币”，在欧元之前等于1德国马克的1/100。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former German coin and monetary unit; it was 1/100 of a Deutsche Mark (like a “penny” in the old German currency system).","zh":"德国旧时的“芬尼/芬尼希”（Pfennig）硬币与货币单位；相当于1德国马克的1/100（类似旧德国货币体系里的“一分钱”）。"},"examples":[{"en":"Before Germany switched to the euro, small prices were often given in pfennigs.","zh":"在德国改用欧元之前，一些小额价格常用Pfennig来表示。"},{"en":"He kept a few old pfennig coins as souvenirs from his trip to Germany.","zh":"他留了几枚旧Pfennig硬币，当作去德国旅行的纪念品。"}]}],"synonyms":["penny (rough equivalent)","cent (rough equivalent)","small coin"],"phonetic":"/ˈfɛnɪɡ/","extraExplanation":["“Pfennig”在日常英语里多作为文化/历史词出现，常见于旅游、钱币收藏（numismatics）或讲述德国统一、欧元启用前的生活背景。","复数通常写作“pfennigs”，但在讨论德语原词时也可能见到德语复数形式“Pfennige”。","相关背景：2002年德国正式以欧元流通后，Pfennig逐渐退出日常使用，但在老一辈记忆、老电影/小说、旧账本或报价中仍可能出现。"]}
{"word":"pfennige","summary":{"en":"Pfennige are old German small coins (plural of Pfennig), used before the euro.","zh":"pfennige 指德国旧时小额硬币/货币单位（Pfennig 的复数），主要用于欧元启用前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) former small coins/units of money used in Germany, especially the 1/100 part of a Deutsche Mark (before the euro).","zh":"（复数）德国旧时使用的小额硬币/货币单位，尤指过去“德国马克”的百分之一（欧元启用前）。"},"examples":[{"en":"Before Germany adopted the euro, everyday prices were often written in marks and pfennige.","zh":"在德国启用欧元之前，日常价格常用“马克 + 芬尼格（pfennige）”来标注。"},{"en":"He emptied his pockets and found only a few pfennige.","zh":"他把口袋翻空，只找到几枚芬尼格（pfennige）。"}]}],"synonyms":["pfennigs","pennies (approximate meaning)"],"phonetic":"/ˈfɛnɪɡə/","extraExplanation":["“Pfennige”是德语名词“Pfennig”的复数形式。在英语语境中多出现在历史、二战题材、旧报刊或文学作品里，用来营造特定时代与地域氛围。","德语里“pf”是一个合辅音，英语借词中通常读作/f/开头，所以常听起来像“fen-…”。在英语里也有人写作复数“pfennigs”。"]}
{"word":"pfennigs","summary":{"en":"Pfennigs are former small German coins (plural of pfennig), used with the Deutsche Mark before the euro.","zh":"pfennigs 指德国旧时的小额硬币（pfennig 的复数），在欧元前与德国马克一起使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pfennig: a former small German coin, like a penny; 100 pfennigs equaled 1 Deutsche Mark (before the euro).","zh":"pfennig 的复数：德国曾经使用的小额硬币，类似“一便士”；在欧元启用前，100 pfennigs = 1 德国马克。"},"examples":[{"en":"The candy cost only a few pfennigs in the 1950s.","zh":"在20世纪50年代，这种糖果只要几枚 pfennigs。"},{"en":"He found some old pfennigs in a drawer and kept them as souvenirs.","zh":"他在抽屉里发现了一些旧的 pfennigs，并把它们当作纪念品留着。"},{"en":"Before the euro, people paid in marks and pfennigs.","zh":"在欧元之前，人们用马克和 pfennigs 付款。"}]}],"synonyms":["pfennig","pennies (rough equivalent)"],"phonetic":"/ˈfɛnɪɡz/","extraExplanation":["Pfennig（单数）源自古高地德语，与英语 penny 同源（都来自日耳曼语系的旧词根），所以含义和使用场景也很像“零钱/小硬币”。","Pfennig 常见于历史、老物件收藏、二战后德国生活回忆等语境；现代德国日常生活中不再使用，但你可能在老电影、小说或博物馆说明牌上看到 pfennigs。"]}
{"word":"pfft","summary":{"en":"“pfft” is an informal written sound showing a dismissive or amused burst of air.","zh":"“pfft”是非正式的书面拟声词，用来表达不屑/不信/觉得好笑等语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written sound used to show a quick burst of air (like blowing) to express amusement, disbelief, impatience, or that something is unimportant.","zh":"（书面拟声）表示“噗/哼”的一声短促气流，用来表达好笑、不屑、不相信、不耐烦，或觉得某事不重要。"},"examples":[{"en":"Pfft—like that’s ever going to happen.","zh":"噗——那怎么可能会发生。"},{"en":"“You’re worried about that?” “Pfft, it’s nothing.”","zh":"“你在担心那个？”“哼，没什么啦。”},{"}]}],"synonyms":["psh","ha","hmph","tch"],"phonetic":"/p͡fːt/","extraExplanation":["“pfft”多见于聊天、社交媒体、漫画或小说对白里，是一种把语气写出来的拟声词；正式写作中通常不用。","语气强弱取决于语境和标点：例如“pfft.”更冷淡，“pffft!!!”更夸张/更好笑。也常写作“pff,” “pf,” 或“ptt”。"]}
{"word":"pfg","summary":{"en":"“PFG” is a context-dependent abbreviation; common U.S. uses include Principal Financial Group and Performance Food Group.","zh":"“PFG” 是依语境而定的缩写；在美国常见用法包括 Principal Financial Group（信安金融集团）与 Performance Food Group（食品分销公司）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation with multiple possible meanings; its exact meaning depends on context (industry, country, or the document).","zh":"一个有多种可能含义的缩写；具体意思取决于语境（行业、国家或文件内容）。"},"examples":[{"en":"What does PFG stand for in this report?","zh":"在这份报告里，PFG 代表什么？"},{"en":"Without context, “PFG” is hard to interpret.","zh":"没有上下文，“PFG” 很难准确理解。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in the U.S.) Principal Financial Group, a financial services company; “PFG” is often used as its name or stock-related reference.","zh":"（在美国较常见）Principal Financial Group（信安金融集团），一家金融服务公司；“PFG” 常被用作其简称或与股票信息相关的指代。"},"examples":[{"en":"PFG reported its quarterly earnings today.","zh":"PFG 今天公布了季度财报。"},{"en":"She works at PFG in retirement planning.","zh":"她在 PFG 从事退休规划相关工作。"}]},{"partOfSpeech":"other","definition":{"en":"(In business/food distribution) Performance Food Group, a U.S. foodservice distribution company; sometimes shortened to “PFG.”","zh":"（在商业/食品配送领域）Performance Food Group，美国一家餐饮与食品分销公司；有时简称为 “PFG”。"},"examples":[{"en":"The restaurant’s supplies are delivered through PFG.","zh":"这家餐厅的物资通过 PFG 配送。"},{"en":"PFG is expanding its distribution network.","zh":"PFG 正在扩大其配送网络。"}]}],"synonyms":["acronym","abbreviation","initialism"],"phonetic":"/ˌpiː ɛf ˈdʒiː/","extraExplanation":["“PFG” 这种全大写的三字母形式很常见，通常是机构名、公司名、项目名或技术术语的首字母缩写。","想准确释义，最有用的是你看到它的句子或领域（例如：金融、餐饮供应链、游戏、工程等）。你可以把原句发来，我可以按语境给出最贴切的解释。"]}
{"word":"Pfizer","summary":{"en":"Pfizer is an American pharmaceutical company; it can also describe products made by that company.","zh":"Pfizer（辉瑞）是一家美国制药公司；也可作定语表示“辉瑞出品/与辉瑞相关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A large American pharmaceutical company that develops and sells medicines and vaccines.","zh":"辉瑞：一家美国大型制药公司，研发并销售药品与疫苗。"},"examples":[{"en":"Pfizer makes medicines for many different health conditions.","zh":"辉瑞生产用于多种健康问题的药物。"},{"en":"Pfizer and BioNTech developed a widely used COVID-19 vaccine.","zh":"辉瑞与BioNTech共同研发了一款广泛使用的新冠疫苗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective to describe something made by or related to the Pfizer company.","zh":"（作定语）辉瑞的；与辉瑞公司有关的。"},"examples":[{"en":"She received the Pfizer vaccine.","zh":"她接种了辉瑞疫苗。"},{"en":"The clinic had Pfizer doses available that week.","zh":"那周诊所有辉瑞的疫苗剂量可用。"}]}],"synonyms":["Pfizer Inc."],"phonetic":"/ˈfaɪzɚ/","extraExplanation":["读音提示：\"Pf\"在英语里通常不分别发/p/和/f/两声，常简化为以/f/开头的感觉，所以很多人会把Pfizer读得像\"Fizer\"。","背景补充：Pfizer源自公司创始人的姓氏（德裔移民家族名）。在新闻中它常与BioNTech并列出现，因为双方合作开发mRNA新冠疫苗（商品名Comirnaty）。","用法注意：作为品牌/公司名通常不加冠词（说“Pfizer announced…”），但指“辉瑞这家公司”时在口语里也有人说“the Pfizer company”。"]}
{"word":"pflag","summary":{"en":"pflag usually refers to the Go package “pflag,” used to parse POSIX/GNU-style command-line options (flags).","zh":"pflag 通常指 Go 语言的第三方库“pflag”，用来解析 POSIX/GNU 风格的命令行参数（flags）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Computing, Go) A popular third‑party Go package that provides a POSIX-/GNU-style command-line flag parser, often used as a drop-in replacement for Go’s standard flag package.","zh":"（计算机，Go 语言）一个常用的第三方 Go 包，用于解析符合 POSIX/GNU 风格的命令行参数（flag），常被当作 Go 标准库 flag 包的替代品。"},"examples":[{"en":"This CLI uses pflag so it can accept both -v and --verbose.","zh":"这个命令行工具使用 pflag，所以既能接受 -v 也能接受 --verbose。"},{"en":"Import pflag and define a string flag for the config file path.","zh":"导入 pflag，然后为配置文件路径定义一个字符串参数。"}]},{"partOfSpeech":"n.","definition":{"en":"(General computing) A “program flag” (option) passed to a command, especially when written in code or documentation as a shorthand.","zh":"（通用计算）“程序参数/选项”（flag）的简称，常见于代码或文档中的简写写法。"},"examples":[{"en":"Add a pflag to enable debug logging.","zh":"加一个参数来开启调试日志。"},{"en":"The pflag --help prints usage information.","zh":"参数 --help 会打印用法信息。"}]}],"synonyms":["flag","command-line option","CLI option","argument (general)","Go flag package (standard library)"],"phonetic":"/ˈpiːˌflæɡ/","extraExplanation":["pflag 最常指 GitHub 上 spf13/pflag 这个库，常与 spf13/cobra（构建命令行应用的框架）一起使用。","它支持更接近 GNU 工具的用法，比如长选项（--name）、短选项（-n）、以及更丰富的参数格式；因此在写跨平台 CLI 时很常见。"]}
{"word":"PFOS","summary":{"en":"PFOS is a persistent man‑made chemical (a type of PFAS) often discussed in environmental and water‑pollution contexts.","zh":"PFOS 是一种难分解的人造化学物质（PFAS 的一种），常见于环境与水污染相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man‑made industrial chemical (perfluorooctanesulfonic acid / perfluorooctane sulfonate) that is very persistent in the environment and has been used in products like stain‑resistant coatings and some firefighting foams.","zh":"一种人造工业化学物质（全氟辛烷磺酸/全氟辛烷磺酸盐），在环境中非常难分解，曾用于防污涂层、部分消防泡沫等产品。"},"examples":[{"en":"PFOS is a type of “forever chemical” because it breaks down very slowly.","zh":"PFOS 被称为“永久化学物质”，因为它分解得非常慢。"},{"en":"Some countries restrict PFOS due to concerns about water contamination.","zh":"一些国家因担心水污染而限制 PFOS 的使用。"},{"en":"The report found PFOS in groundwater near an old industrial site.","zh":"报告在一处旧工业场地附近的地下水中发现了 PFOS。"}]}],"synonyms":["perfluorooctanesulfonic acid","perfluorooctane sulfonate","PFAS chemical"],"phonetic":"/ˌpiː ˌɛf ˌoʊ ˈɛs/","extraExplanation":["PFOS 常被归入 PFAS（全氟/多氟烷基物质）家族的一员；PFAS 是一大类化学物质，PFOS 是其中较知名、监管较多的一种。","在新闻与科普语境里，PFOS 往往与“饮用水污染、环境持久性、生物累积、潜在健康风险（如免疫、肝脏、胆固醇等指标）”一起出现；不同国家/地区的标准与结论可能不同，阅读时可留意来源与法规背景。","发音上通常按字母读：P-F-O-S（“pee-eff-oh-ess”）。"]}
{"word":"Pfuhl","summary":{"en":"“Pfuhl” is a German word meaning a muddy/stagnant pool or, figuratively, a “mire” of corruption; it can also be a surname.","zh":"“Pfuhl”是德语词，指泥泞/死水的水坑，也可比喻“腐败的泥潭”；亦可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German, archaic/literary) a muddy pool or puddle; a small stagnant pond; by extension, a mire or swamp.","zh":"（德语，较古/文学用语）泥泞的水洼；小片死水塘；引申为泥沼、沼泽。"},"examples":[{"en":"After the rain, the path turned into a pfuhl of mud and water.","zh":"雨后，小路变成了一滩泥水的水洼。"},{"en":"In older German texts, “Pfuhl” can describe a foul, stagnant pool.","zh":"在较早的德语文本中，“Pfuhl”可用来描写肮脏、停滞的水坑。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a state or place seen as morally dirty or corrupt (e.g., “a mire of vice”).","zh":"（比喻）被视为道德肮脏或腐败的状态/环境（如“罪恶的泥潭”）。"},"examples":[{"en":"He wanted to escape the pfuhl of corruption around him.","zh":"他想逃离身边腐败的泥潭。"},{"en":"The novel portrays the city as a pfuhl of crime and despair.","zh":"小说把这座城市描写成犯罪与绝望的泥潭。"}]},{"partOfSpeech":"n.","definition":{"en":"a German surname and place-name element (seen in some family names and local names).","zh":"德语姓氏/地名构成要素（可见于某些姓氏与地名中）。"},"examples":[{"en":"“Pfuhl” may appear as a surname in German-speaking regions.","zh":"“Pfuhl”可能作为姓氏出现在德语地区。"}]}],"synonyms":["Pfütze","Tümpel","Sumpf","mire","morass","swamp"],"phonetic":"/pfuːl/","extraExplanation":["“Pfuhl”在现代日常德语里不算高频，更常见的近义词有：Pfütze（小水洼）、Tümpel（小池塘/水坑）、Sumpf（沼泽）。","发音上，词首的“pf-”是德语常见辅音组合，英语里较少见；可把它理解为很快地连读出“p”再接“f”。","文学或宗教语境中，它常被用来强化“污秽、停滞、令人厌恶”的画面，因此比普通的“水洼”更带负面色彩。"]}
{"word":"pfui","summary":{"en":"“Pfui” is an old-fashioned or literary exclamation of disgust or contempt.","zh":"“pfui”是较文学化/带时代感的感叹词，用来表达厌恶或轻蔑。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation showing disgust, contempt, or strong disapproval (similar to “phew!” / “ugh!” / “yuck!”).","zh":"（感叹词）表示厌恶、轻蔑或强烈不赞同（类似“呸！/咦！/恶心！”）。"},"examples":[{"en":"Pfui! That smell is awful.","zh":"呸！这味道太难闻了。"},{"en":"Pfui—what a nasty trick.","zh":"呸——这招太卑鄙了。"},{"en":"He muttered “pfui” under his breath and turned away.","zh":"他低声嘟囔了一句“pfui”，然后转身走开。"}]}],"synonyms":["ugh","yuck","ew","phew","bah"],"phonetic":"/pfuːi/","extraExplanation":["“pfui”多见于文学作品、戏剧或带有欧陆（尤其德语/意第绪语）风格的英语语境中，用来营造人物口吻或时代感；在日常现代口语里更常用“ugh / yuck / ew / phew”。","拼写有时会写作“pfui!”并带感叹号；开头的“pf-”在英语里不常见，因此读起来常被当作带点夸张效果的拟声感叹。"]}
{"word":"pfund","summary":{"en":"Pfund is a German word meaning “pound,” sometimes seen in English when quoting German texts or names.","zh":"Pfund 是德语里的“磅（pound）”，英语中多见于引用德语文本或作为名称出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From German) a “pound,” a unit of weight; also used historically for a pound of currency in some German-speaking areas.","zh":"（源自德语）“磅”，重量单位；在部分德语地区的历史语境中也可指“磅”作为货币单位。"},"examples":[{"en":"In older texts, you may see Pfund used where modern English would say pound.","zh":"在较早的文本里，你可能会看到用 Pfund 来表达现代英语里的 pound（磅）。"},{"en":"The recipe calls for a Pfund of flour—about a pound.","zh":"食谱里写要一 Pfund 面粉——大约一磅。"}]},{"partOfSpeech":"other","definition":{"en":"A German word or name used in English contexts (e.g., a surname, brand, or place name).","zh":"在英语语境中出现的德语词/名称（例如姓氏、品牌名或地名）。"},"examples":[{"en":"Pfund is also a family name in German-speaking countries.","zh":"Pfund 也可以是德语地区的姓氏。"}]}],"synonyms":["pound"],"phonetic":"/pfʊnd/","extraExplanation":["Pfund 在德语里首字母组合 pf 很常见，发音通常是 /pf/ 连读。英语使用者在口语里有时会把它简化成接近 /f/ 的发音，但在提到德语词源时读成 /pf/ 更贴近原语。","如果你是在英语文章中看到 pfund（小写），它往往是在引用德语原词；更常见的英语写法通常还是 pound。"]}
{"word":"pfunde","summary":{"en":"*Pfunde* is a German word meaning “pounds” (plural of *Pfund*), and it can also mean someone’s strengths or advantages in a figurative sense.","zh":"*Pfunde* 是德语，表示“磅”（*Pfund* 的复数）；也可引申指一个人的“优势/长处”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) plural of *Pfund*: pounds (a unit of weight or, in some contexts, money).","zh":"（德语）*Pfund* 的复数：磅（重量单位；在某些语境中也可指货币金额）。"},"examples":[{"en":"The package weighs two *Pfunde*.","zh":"这个包裹重两磅（德语：zwei Pfunde）。"},{"en":"Butter: 1 *Pfund* / 2 *Pfunde*.","zh":"黄油：1 磅 / 2 磅（德语用法）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, German) strengths or advantages—what you can “bring to the table.”","zh":"（引申义，德语）优势、长处——你能“拿得出手/带来贡献”的东西。"},"examples":[{"en":"She knows how to use her *Pfunde* in negotiations.","zh":"她懂得在谈判中发挥自己的优势（字面：用好自己的“磅”）。"},{"en":"Everyone should use their *Pfunde* wisely.","zh":"每个人都应该明智地发挥自己的长处。"}]}],"synonyms":["pounds","strengths","assets","advantages"],"phonetic":"/ˈfʊndə/","extraExplanation":["“Pfunde”是德语名词“Pfund”的复数。字母组合“pf”在德语里常一起发音（接近 [pf]），但英语使用者常把它简化成 /f/。","在德语里常见说法“seine Pfunde einsetzen”（字面：把自己的‘磅’用上）表示“发挥优势、拿出本事”。英语里更自然的对应说法是“play to one’s strengths”或“use one’s assets.”"]}
{"word":"PFW","summary":{"en":"PFW most commonly means Paris Fashion Week; it can also be internet slang meaning “(people/person) face when.”","zh":"PFW最常见指巴黎时装周；也可能是网络俚语，表示“（某人/人们）在……时的表情”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Paris Fashion Week (a major fashion event in Paris where designers show new collections).","zh":"巴黎时装周（在巴黎举行的重要时尚活动，设计师发布新系列）。"},"examples":[{"en":"She’s flying to Paris for PFW to cover runway shows.","zh":"她飞去巴黎参加PFW，报道走秀发布。"},{"en":"Brands often debut their most ambitious looks during PFW.","zh":"品牌常在PFW期间发布最具野心的造型。"}]},{"partOfSpeech":"other","definition":{"en":"(Internet slang, less common) “person/people face when,” used to introduce a reaction image or meme.","zh":"（网络俚语，较少见）“某人/人们在……时的表情”，用来引出反应图或梗图。"},"examples":[{"en":"PFW you realize the exam is today.","zh":"PFW你意识到考试就在今天。"},{"en":"They posted ‘PFW’ and then a surprised reaction picture.","zh":"他们发了“PFW”，然后配了一张惊讶的反应图。"}]}],"synonyms":["Paris Fashion Week"],"phonetic":"/ˌpiːˌɛfˈdʌbəl.juː/","extraExplanation":["PFW是缩写，具体含义很依赖语境：在时尚内容里通常指Paris Fashion Week；在一些论坛/梗图语境中可能指“(people/person) face when”。如果你告诉我它出现在哪句话或哪个平台，我可以帮你更准确判断。","时尚圈常见的类似缩写还有：NYFW（纽约时装周）、LFW（伦敦时装周）、MFW（米兰时装周）。"]}
{"word":"pfx","summary":{"en":"“pfx” is an abbreviation; most commonly it means “prefix,” and in tech it often refers to a .pfx certificate file.","zh":"“pfx”是缩写；最常见指“前缀（prefix）”，在科技领域也常指证书文件“.pfx”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “prefix” (a part added to the beginning of a word).","zh":"“prefix（前缀）”的缩写，指加在词根前面的构词部分。"},"examples":[{"en":"In this lesson, we’ll practice common pfx like un-, re-, and pre-.","zh":"这节课我们练习常见的前缀（pfx），比如 un-、re- 和 pre-。"},{"en":"Add the pfx “dis-” to make a negative meaning.","zh":"加上前缀（pfx）“dis-”来表达否定意思。"}]},{"partOfSpeech":"n.","definition":{"en":"a file type (.pfx) that stores a digital certificate and its private key (used for security/HTTPS).","zh":".pfx 文件类型：用于存储数字证书及其私钥（常用于安全/HTTPS）。"},"examples":[{"en":"Upload your .pfx file to install the SSL certificate on the server.","zh":"上传你的 .pfx 文件，在服务器上安装 SSL 证书。"},{"en":"Keep the PFX password safe because it protects the private key.","zh":"妥善保管 PFX 密码，因为它保护私钥。"}]},{"partOfSpeech":"other","definition":{"en":"short for “effects” in music/audio production (often written as FX; sometimes seen as PFX in notes or labels).","zh":"在音乐/音频制作中指“效果/特效”（更常写作 FX；有时在标注里也会见到 PFX）。"},"examples":[{"en":"Turn down the pfx on the vocal so it sounds more natural.","zh":"把人声的特效（pfx）调小一点，让听起来更自然。"},{"en":"The intro uses heavy pfx like reverb and delay.","zh":"前奏用了很多特效（pfx），比如混响和延迟。"}]}],"synonyms":["prefix (when meaning #1)","FX (audio effects, when meaning #3)","PKCS#12 / .p12 (related to meaning #2)"],"phonetic":"/ˌpiː ɛf ˈɛks/","extraExplanation":["“PFX”本质上是缩写，具体含义要看领域：语言学/课堂笔记里常指 prefix；IT/网络安全里最常见的是证书文件扩展名 .pfx（也常与 .p12 相关）；音频领域更普遍写作 “FX”，但在工作笔记或标签中也可能看到 “pfx”。","读法通常是逐字母读：P-F-X。"]}

