{"word":"pg","summary":{"en":"PG most commonly means the \"Parental Guidance\" rating; it can also mean \"page\" (pg) or the unit \"picogram\" (pg).","zh":"PG最常见指影视分级“建议家长指导”；也可指“页”（pg）或单位“皮克克”（pg）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a film/TV rating meaning \"Parental Guidance\"—some material may not be suitable for young children, so parents are advised to watch or decide with them","zh":"（电影/电视）分级：PG（Parental Guidance，建议家长指导）——内容可能不适合年幼儿童，建议家长陪同或协助决定是否观看"},"examples":[{"en":"The movie is rated PG, so it should be okay for most kids with a parent.","zh":"这部电影是PG级，大多数孩子在家长陪同下观看应该没问题。"},{"en":"Check the rating first—PG can still include mild violence or language.","zh":"先看分级——PG仍可能包含轻微暴力或用语。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for \"page\" in writing and references","zh":"（书写/引用中）“page”的缩写：页"},"examples":[{"en":"See pg 12 for the chart.","zh":"图表见第12页（pg 12）。"},{"en":"The answer is on pg. 45 of the textbook.","zh":"答案在课本第45页（pg. 45）。"}]},{"partOfSpeech":"other","definition":{"en":"a unit abbreviation for \"picogram\" (pg), equal to one trillionth of a gram (10⁻¹² g)","zh":"（单位）皮克克（picogram，pg）：等于一万亿分之一克（10⁻¹² 克）"},"examples":[{"en":"The lab measured the chemical in pg per milliliter.","zh":"实验室用“每毫升多少皮克克（pg）”来测量该化学物质。"}]}],"synonyms":["Parental Guidance","page (abbr.)","picogram (abbr.)"],"phonetic":"/ˌpiːˈdʒiː/","extraExplanation":["在北美的影视分级里，PG通常比G更“需要家长留意”，但又比PG-13更温和；不同国家/地区的分级标准可能不完全一致。","“pg”表示页码时，英式写法和美式写法都常见；有时也会写作“p.”（单页）和“pp.”（多页）。"]}
{"word":"pgntt","summary":{"en":"“pgntt” isn’t a recognized English word; it likely needs context or correction.","zh":"“pgntt”不是常见英语词，通常需要上下文或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a typo, abbreviation, username, or code. Please share the context or the intended word.","zh":"不是标准英语单词；可能是拼写错误、缩写、用户名或代码。请提供上下文或你想查的正确单词。"},"examples":[{"en":"I couldn’t find “pgntt” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“pgntt”——你是不是想输入另一个词？"},{"en":"If you tell me where you saw “pgntt” (a message, a game, a label), I can help interpret it.","zh":"如果你告诉我“pgntt”出现在哪里（短信、游戏、标签等），我可以帮你判断它的意思。"}]}],"phonetic":"/pi dʒi ɛn ti ti/","extraExplanation":["“pgntt”看起来像随机字母或缩写，也可能是把某个单词打错了。常见的可能性之一是把“pregnant（怀孕的）”之类的词漏掉了元音字母，但仅凭这串字母无法确定。","你可以补充：1) 你在哪看到的；2) 句子原文；3) 想表达的中文意思。这样我就能给出更准确的释义和例句。"]}
{"word":"pgnttrp","summary":{"en":"“pgnttrp” isn’t a recognized English word; please provide context so I can identify what it might mean.","zh":"“pgnttrp”不是可识别的英文单词；请提供上下文，我才能判断它可能是什么意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unknown/unclear term: “pgnttrp” is not a standard English word or common abbreviation.","zh":"未知/不清楚的词：“pgnttrp”不是标准英文单词，也不是常见缩写。"},"examples":[{"en":"I couldn’t find “pgnttrp” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“pgnttrp”——你能把它出现的句子发给我吗？"},{"en":"If it’s a typo, the closest matches might change depending on context.","zh":"如果这是拼写错误，最接近的词会因上下文而不同。"}]}],"extraExplanation":["“pgnttrp”看起来像随机字母或打字漏了元音（例如把元音删掉的速记），也可能是某个领域/游戏/社群的内部缩写。为了准确解释，请你提供：\n1）它出现的完整句子或截图；\n2）你想表达/猜测的意思；\n3）它来自哪里（聊天、作业、游戏、软件界面等）。\n有了这些信息，我可以帮你推断它可能对应的英文单词或短语，并给出正确用法。"]}

