{"word":"ph","summary":{"en":"pH usually means the acidity/alkalinity level of a solution; “ph” can also be a spelling pattern pronounced /f/.","zh":"pH通常指溶液的酸碱度；“ph”也可指一种拼写形式，常读作/f/。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a number that shows how acidic or basic (alkaline) a liquid or solution is, usually on a scale from 0 to 14","zh":"pH值；表示液体或溶液酸性或碱性（碱度）的数值，通常范围为0到14"},"examples":[{"en":"Pure water has a pH of about 7.","zh":"纯水的pH值大约是7。"},{"en":"Lemon juice has a low pH, so it tastes sour.","zh":"柠檬汁的pH值很低，所以尝起来很酸。"},{"en":"The shampoo is pH-balanced for sensitive skin.","zh":"这款洗发水做了pH平衡，适合敏感肌。"}]},{"partOfSpeech":"other","definition":{"en":"(in spelling) the letters “ph” used together to represent the /f/ sound in many English words","zh":"（拼写中）字母组合“ph”，在许多英语单词里表示/f/音"},"examples":[{"en":"In “phone,” the “ph” is pronounced /f/.","zh":"在“phone”里，“ph”的发音是/f/。"},{"en":"Many words with “ph” come from Greek, like “photo” and “philosophy.”","zh":"很多带“ph”的词来自希腊语，比如“photo”和“philosophy”。"}]}],"synonyms":["acidity level","alkalinity level"],"phonetic":"/piˈeɪtʃ/","extraExplanation":["在化学里，pH常被解释为溶液中氢离子浓度的“酸碱度指标”：pH < 7 通常表示酸性，pH = 7 中性，pH > 7 碱性。日常生活中常见于泳池水质、土壤检测、护肤品/洗发水“pH平衡”等场景。","拼写里的“ph”常与希腊语来源有关：古希腊语里有一个类似“送气的p”音（φ），进入拉丁语和英语后多演变为/f/，所以“ph”在英语里常读作/f/。"]}
{"word":"phainein","summary":{"en":"*Phainein* is an Ancient Greek root meaning “to show; to appear,” helpful for understanding English words like *phenomenon* and *phantom*.","zh":"*phainein* 是古希腊语词根，意为“展示；显现；出现”，可用于理解 *phenomenon*（现象）和 *phantom*（幻影）等英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Ancient Greek, used in word roots) “to show; to bring to light; to appear.” Often seen in English through related roots like *phan-* or *phen-* (e.g., *phenomenon*, *phantom*).","zh":"（源自古希腊语，常作词根）“展示；使显现；出现”。在英语中常通过相关词根 *phan-* 或 *phen-* 出现（如 *phenomenon* 现象，*phantom* 幻影）。"},"examples":[{"en":"The root *phainein* is linked to the idea of “appearing,” which helps explain the meaning of *phenomenon*.","zh":"词根 *phainein* 和“出现/显现”的概念有关，这也能帮助理解 *phenomenon*（现象）的含义。"},{"en":"Words like *phantom* and *fantasy* are historically related to the sense of something “shown” to the mind.","zh":"像 *phantom*（幻影）和 *fantasy*（幻想）这类词，在历史上与“在心中显现/呈现”的含义相关。"}]}],"synonyms":["appear","show","reveal","seem"],"phonetic":"/ˈfaɪ.ni.ɪn/","extraExplanation":["*phainein*（φαίνειν）是古希腊语动词“不定式”形式，常被用来说明英语词源，而不是现代英语里会单独使用的单词。","在英语中，它常通过两条相关词根出现：*phen-*（偏“显现出来的事物/现象”，如 *phenomenon*）与 *phan-*（偏“显现出的形象/幻影/想象”，如 *phantom*、*phantasm*）。","如果你是在找英语单词 *feign*（假装）或 *phasing*（分阶段/相位变化），它们拼写相近但词源与含义不同。你可以告诉我你看到 *phainein* 的上下文，我可以帮你精确对应。"]}
{"word":"phalanx","summary":{"en":"Phalanx means an ancient Greek-style battle formation, or by extension any tightly packed group; in anatomy, it also means a finger or toe bone.","zh":"Phalanx 指古希腊方阵；也可泛指紧密成群的一群人/物；在解剖学中还指指骨或趾骨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tight group of soldiers standing close together in lines, especially in ancient Greece (often with shields and long spears).","zh":"（尤指古希腊的）方阵；士兵紧密排列成行的战斗队形（常持盾与长矛）。"},"examples":[{"en":"The Greek phalanx moved forward as one unit, shields locked together.","zh":"希腊方阵像一个整体一样推进，盾牌彼此扣在一起。"},{"en":"In history class, we learned how the phalanx changed battlefield tactics.","zh":"历史课上我们学到，方阵如何改变了战场战术。"}]},{"partOfSpeech":"n.","definition":{"en":"A closely packed group of people or things moving or acting together.","zh":"（人或事物）密集的群体；成群结队一起行动的一群。"},"examples":[{"en":"A phalanx of reporters waited outside the courthouse.","zh":"一群记者密密麻麻地等在法院外。"},{"en":"She walked through a phalanx of fans to reach the stage door.","zh":"她穿过一群粉丝，走到舞台侧门。"}]},{"partOfSpeech":"n.","definition":{"en":"Any of the small bones in the fingers or toes.","zh":"指骨或趾骨（手指或脚趾的骨头之一）。"},"examples":[{"en":"The X-ray showed a fracture in one of the phalanges of his finger.","zh":"X光显示他手指的一根指骨骨折了。"}]}],"synonyms":["formation","rank","array","cohort","crowd","mob","phalange (anatomy)"],"phonetic":"/ˈfeɪ.læŋks/","extraExplanation":["“Phalanx”源自古希腊语，常与马其顿方阵（Macedonian phalanx）一起出现：士兵用更长的长矛（sarissa）形成极其密集的队列。这也让它在现代英语里引申为“紧密成阵的一群人/物”。","文学与历史写作中，“phalanx”常用来营造“整齐、压迫感强、不可阻挡”的画面感，比普通的“group/crowd”更强调队形与组织性。"]}
{"word":"phan","summary":{"en":"“phan” is a nonstandard spelling of “fan,” especially used by Phish fans; it can also be the Vietnamese name “Phan.”","zh":"“phan”常是“fan（粉丝）”的非标准俏皮拼写（尤其在 Phish 粉丝圈）；也可指越南姓名“Phan”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A fan; a devoted admirer or supporter—often used as a playful spelling in some fan communities (especially fans of the band Phish).","zh":"（非正式）粉丝；狂热支持者——在某些粉丝圈里会用一种俏皮拼写来表示（尤其常见于乐队 Phish 的粉丝）。"},"examples":[{"en":"He’s a longtime Phish phan and travels to many shows.","zh":"他是资深的 Phish 粉丝，还会去追很多场演出。"},{"en":"Only true phans know all the inside jokes.","zh":"只有真正的“phan”才懂所有圈内梗。"}]},{"partOfSpeech":"other","definition":{"en":"A Vietnamese family name (surname) or given name, written as “Phan.”","zh":"越南姓氏或名字，写作“Phan”。"},"examples":[{"en":"Ms. Phan will lead today’s meeting.","zh":"Phan 女士将主持今天的会议。"},{"en":"Phan is a common Vietnamese surname.","zh":"Phan 是一个常见的越南姓。"}]}],"synonyms":["fan","supporter","admirer"],"phonetic":"/fæn/","extraExplanation":["“phan”最常见的英语用法来自乐队 Phish 的粉丝文化：用 ph- 来替代 f-，带有圈内身份与俏皮感。它不是标准拼写；在正式写作中一般用 “fan”。","作为越南姓名时，“Phan”属于专名（proper noun）。不同家庭/地区读音可能略有差异；在英语环境中通常按接近 “fan” 的方式读。"]}
{"word":"phanai","summary":{"en":"“Phanai” is most commonly used as a person’s name (often Thai), not a standard English vocabulary word.","zh":"“Phanai”最常见是人名（常见为泰国名），不是标准的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (proper noun), often a Thai given name written in Latin letters as “Phanai.”","zh":"人名（专有名词），常见为泰国人的名（用拉丁字母拼写为“Phanai”）。"},"examples":[{"en":"Phanai is my colleague from Bangkok.","zh":"Phanai 是我来自曼谷的同事。"},{"en":"I met Phanai at the conference.","zh":"我在会议上认识了 Phanai。"}]}],"phonetic":"/pəˈnaɪ/","extraExplanation":["“Phanai”在英语里通常不作为普通词汇使用，更常见的是音译的人名。不同语言的拼写（如泰语转写成英语）可能对应不同的原词与发音。","如果你想查的其实是某个英语单词（例如拼写相近的单词），请提供一句包含它的句子或说明你想表达的意思，我可以帮你定位正确拼写与含义。"]}
{"word":"phant","summary":{"en":"“Phant” is a rare, playful shortening of “elephant,” and it can also be a surname.","zh":"“phant”多为“elephant（大象）”的罕见俏皮缩写；也可能是一个姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare, informal) A shortened form of “elephant,” used playfully or in wordplay rather than in standard English.","zh":"（罕见，非正式）“elephant（大象）”的缩略/俏皮说法，多用于文字游戏或玩笑语境，不属于标准用法。"},"examples":[{"en":"In a silly rhyme, the kid wrote “phant” instead of “elephant.”","zh":"在一首滑稽押韵的小诗里，孩子用“phant”代替了“elephant”。"},{"en":"That spelling isn’t standard—most people just say “elephant.”","zh":"这种拼法不规范——大多数人直接说“elephant”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) found in some English-language contexts.","zh":"一个姓氏（在一些英语语境中可见）。"},"examples":[{"en":"Dr. Phant will speak at the conference tomorrow.","zh":"Phant 博士将于明天在会议上发言。"}]}],"synonyms":["elephant"],"phonetic":"/fænt/","extraExplanation":["“phant”在日常英语里几乎不当作独立单词使用；更常见的是它作为“elephant”的一部分（比如单词结尾的拼写片段）。如果你是在阅读谜语、押韵童谣、填字游戏或网络玩笑时看到它，通常就是为了简写或押韵。"]}
{"word":"phantasia","summary":{"en":"Phantasia means imagination or a vivid mental image, and it can also refer to a free-form musical piece.","zh":"phantasia 指想象力或生动的心象/幻想，也可指自由体的幻想曲式乐曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often philosophical or literary) The power of imagination; the mind’s ability to form images or ideas that are not present to the senses.","zh":"（常见于哲学或文学语境）想象力；心灵在没有感官直接输入时形成图像或观念的能力。"},"examples":[{"en":"In Aristotle’s writings, phantasia helps explain how the mind forms images from experience.","zh":"在亚里士多德的著作中，phantasia 用来解释心灵如何从经验中形成意象。"},{"en":"The novel explores a child’s phantasia as a way to survive loneliness.","zh":"这部小说把孩子的想象力写成一种对抗孤独的方式。"}]},{"partOfSpeech":"n.","definition":{"en":"A vivid mental image or fantasy; something imagined.","zh":"生动的想象画面；幻想出来的事物。"},"examples":[{"en":"The castle in the clouds was a pure phantasia—beautiful, but unreal.","zh":"云中的城堡只是一个纯粹的幻想：美丽，却不真实。"},{"en":"His fears were driven by phantasia rather than facts.","zh":"他的恐惧更多来自幻想而不是事实。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) A free-form composition, similar to a fantasia.","zh":"（音乐）幻想曲式的自由体乐曲；类似 fantasia 的作品。"},"examples":[{"en":"She performed a short phantasia that moved between themes without strict structure.","zh":"她演奏了一首短小的 phantasia，在不同主题间自由转换，没有严格结构。"}]}],"synonyms":["imagination","fantasy","mental image","vision","fantasia"],"phonetic":"/fænˈteɪʒə/","extraExplanation":["phantasia 源自希腊语 φαντασία（phantasía），与“显现/呈现（appearance）”有关，因此它不仅是“幻想”，也带有“心中呈现出的影像”的意思。","在古希腊哲学中（尤其是亚里士多德），phantasia 常被讨论为介于“感知（perception）”与“思考/理性（reasoning）”之间的一种心理能力：感官经验会在心中留下“表象/意象”，供记忆与思考使用。","现代英语里更常用 imagination / fantasy；phantasia 多见于文学批评、哲学讨论或较文艺的写作中，语气更“书面、古典”。"]}
{"word":"phantasm","summary":{"en":"Phantasm means a ghostlike apparition or an unreal illusion in the mind, often used in literary or dramatic contexts.","zh":"Phantasm 指幽灵般的幻影或心理上的不真实幻想，常用于文学或较戏剧化的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ghost or a spirit-like image; something that seems real but is not (an apparition).","zh":"幽灵；幻影；看似真实但其实不存在的影像（显现）。"},"examples":[{"en":"In the old mansion, she thought she saw a phantasm in the hallway.","zh":"在那座老宅里，她以为自己在走廊里看见了一个幽灵。"},{"en":"The figure vanished like a phantasm, leaving him unsure of what he’d seen.","zh":"那个人影像幻影一样消失了，让他不确定自己到底看见了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"An idea, fear, or hope that is unrealistic or imagined; an illusion.","zh":"不切实际的想法、恐惧或希望；幻想；错觉。"},"examples":[{"en":"His worry that everyone hated him was just a phantasm of anxiety.","zh":"他担心所有人都讨厌他，只是焦虑造成的幻想。"},{"en":"Fame can be a phantasm that disappears once real life sets in.","zh":"名声可能是一种幻象，一旦现实生活到来就会消散。"}]}],"synonyms":["apparition","phantom","specter","illusion","delusion"],"phonetic":"/ˈfæn.tæz.əm/","extraExplanation":["“phantasm”语气偏文学/正式，比日常的“ghost / illusion”更有“朦胧、诡异、像梦一样”的感觉，常见于哥特小说、恐怖故事或诗歌。","词源来自希腊语 *phantasma*（“显现出来的东西”），也与 *phantom*（幽灵/幻影）同源。","文学中常用来表达“看得见却抓不住”的存在感：既可以是真正的鬼魂，也可以是心理投射（恐惧、内疚、欲望）形成的‘幻影’。"]}
{"word":"phantasma","summary":{"en":"Phantasma is a literary word for a ghostly apparition or an imagined illusion.","zh":"Phantasma 是较文学化的词，指幽灵般的幻影，或想象中的幻象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ghostly appearance or apparition; something that seems like a ghost.","zh":"幽灵般的显现；幻影；鬼魂般的东西。"},"examples":[{"en":"In the fog, the old lighthouse looked like a phantasma on the horizon.","zh":"在雾中，那座老灯塔在地平线上看起来像个幻影。"},{"en":"He spoke of grief as a phantasma that followed him from room to room.","zh":"他说悲伤像一个幻影，跟着他从一个房间走到另一个房间。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/academic) A mental image or illusion—something that exists mainly in the imagination rather than in reality.","zh":"（文学/学术）心象；幻觉；主要存在于想象中而非现实的东西。"},"examples":[{"en":"Her perfect childhood was partly a phantasma, reshaped by memory.","zh":"她完美的童年在某种程度上是记忆重塑出来的幻象。"},{"en":"The rumor turned out to be a phantasma with no evidence behind it.","zh":"那条传闻最终被证明只是没有任何证据的虚幻之物。"}]}],"synonyms":["phantom","phantasm","apparition","specter","illusion"],"phonetic":"/fænˈtæzmə/","extraExplanation":["“phantasma”较少见，常见于文学描写或学术语境。它来自希腊语（与“phantom / phantasm”同源），带有“显现出来的影像、幻影”的感觉。日常英语里更常用的词是“ghost”“apparition”“illusion”或“phantom”。"]}
{"word":"phantasy","summary":{"en":"“Phantasy” is a less common, old-fashioned spelling of “fantasy,” meaning an imagined, unreal story or idea.","zh":"“phantasy”是“fantasy”的较少见、偏古老/文学性的拼写，指想象出来的、不真实的故事或想法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned or literary spelling of “fantasy”: an imagined story, idea, or world, often magical or unreal.","zh":"“fantasy”的一种较古老或文学性的拼写：指想象出来的故事、念头或世界，常带有魔法色彩或不真实。"},"examples":[{"en":"The novel is a dark phantasy set in a world of dragons and lost kingdoms.","zh":"这部小说是一部黑暗的“幻梦/奇幻”作品，背景是一个有龙与失落王国的世界。"},{"en":"He knew it was only a phantasy, but it still comforted him.","zh":"他知道那只是幻想，但它仍然给了他安慰。"}]},{"partOfSpeech":"n.","definition":{"en":"A private imagined scene or wish, especially one that is not realistic.","zh":"（更偏个人层面的）不切实际的想象画面或愿望。"},"examples":[{"en":"Her phantasy of instant success faded after months of hard work.","zh":"经历了几个月的辛苦后，她对“一夜成功”的幻想逐渐消退了。"}]}],"synonyms":["fantasy","imagination","daydream"],"phonetic":"/ˈfæn.tə.si/","extraExplanation":["“phantasy”在现代英语中较少见，更多是历史拼写或文学用法；日常写作通常用“fantasy”。","拼写里保留“ph-”与希腊语词根有关（与“phantom/幻影”同源），所以在一些作品中用“phantasy”会带来更古典、神秘或哥特式的气氛。"]}
{"word":"phantazesthai","summary":{"en":"*Phantazesthai* is a rare, scholarly transliteration meaning “to appear (as an image or impression) in the mind; to imagine,” and sometimes “to seem.”","zh":"*Phantazesthai* 是罕见的学术用语（古希腊语音译），大意为“在心中以影像/印象出现；想象/幻想”，有时也指“似乎、显得”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare; used as a transliterated Ancient Greek term) to appear to the mind; to present itself as an image or impression; to imagine or fantasize.","zh":"（罕见；作为古希腊语音译术语使用）在心中呈现为影像/印象；显现于意识；想象、幻想。"},"examples":[{"en":"In some philosophy texts, *phantazesthai* describes how an image appears in consciousness.","zh":"在一些哲学文本中，*phantazesthai* 用来描述影像如何在意识中出现。"},{"en":"He uses the verb *phantazesthai* to link perception with imagination.","zh":"他用动词 *phantazesthai* 来连接感知与想象。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) to seem or appear (to someone), especially in a subjective or interpretive way.","zh":"（罕见）在主观感受或解释中“似乎”“看起来”（对某人而言）。"},"examples":[{"en":"It may *phantazesthai* as unfair, even if the rule is consistent.","zh":"即使规则一致，它也可能在感受上 *phantazesthai* 为“不公平”。"}]}],"synonyms":["imagine","envision","picture (in one’s mind)","appear","seem"],"phonetic":"/ˌfæn.təˈzɛs.θaɪ/","extraExplanation":["*phantazesthai* 是古希腊语动词（常见写法为 φαίνεσθαι/φαντάζεσθαι 一类相关形式的音译），在英文里通常不当作日常词汇使用，而是出现在古典学、哲学或心理学史的讨论中，用来保留原语的概念色彩。","它与英语 *fantasy / phantom / fancy* 同源（都和“影像、显现、想象”的词根有关），因此看到这个词时，可以把核心意义抓成“在心里/眼前浮现”。","在阅读英文学术书时，作者使用这种音译词往往是为了精确区分：感知到的“出现/显现”、心像的“呈现”、以及一般意义的“想象”。"]}
{"word":"phantom","summary":{"en":"A phantom is a ghost or something that seems real but is actually imagined or unreal.","zh":"phantom 指“幽灵/鬼魂”，也可指“看似真实但其实是想象或虚幻的事物”；形容词则表示“幽灵般的、虚幻的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ghost or spirit; something that seems to appear but is not physically real.","zh":"幽灵；鬼魂；看似出现但并非真实存在的东西。"},"examples":[{"en":"People say a phantom walks through the old house at night.","zh":"人们说夜里有幽灵在那座老房子里走动。"},{"en":"In the fog, the ship looked like a phantom on the water.","zh":"在雾中，那艘船在水面上看起来像个幽灵。"}]},{"partOfSpeech":"n.","definition":{"en":"Something imagined or illusory, especially a fear, hope, or idea that is not real.","zh":"（尤指）想象出来的事物；虚幻的恐惧、希望或想法。"},"examples":[{"en":"His fear of failure was a phantom that kept him from trying.","zh":"他对失败的恐惧是一种虚幻的东西，让他不敢尝试。"},{"en":"They chased the phantom of perfect happiness.","zh":"他们追逐着“完美幸福”的幻影。"}]},{"partOfSpeech":"adj.","definition":{"en":"Ghostlike; pale, unreal, or seeming to exist only in appearance.","zh":"幽灵般的；苍白而不真实的；似有若无的。"},"examples":[{"en":"A phantom figure appeared at the end of the hallway.","zh":"走廊尽头出现了一个幽灵般的身影。"},{"en":"She gave a phantom smile, weak and fleeting.","zh":"她露出一丝虚弱而转瞬即逝的“幽灵式微笑”。"}]}],"synonyms":["ghost","apparition","specter","illusion","mirage"],"phonetic":"/ˈfæntəm/","extraExplanation":["“phantom”常用于文学与影视的氛围描写，强调“看得见却抓不住”的感觉；也常比喻不切实际的目标或无根据的恐惧。","相关延伸：医学里有“phantom limb（幻肢）”，指截肢后仍感觉到肢体存在或疼痛的现象（phantom pain 幻肢痛）。","词源来自希腊语“phantasma”，与“appear（出现）/fantasy（幻想）”同源，带有“显现出来的影像、幻象”的意味。"]}
{"word":"pharaoh","summary":{"en":"A pharaoh is a king of ancient Egypt.","zh":"pharaoh 指古埃及的国王（法老）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ruler (king) of ancient Egypt; the title used for Egyptian kings.","zh":"（古埃及的）法老；古埃及国王的称号。"},"examples":[{"en":"Tutankhamun is one of the most famous pharaohs in Egyptian history.","zh":"图坦卡蒙是埃及历史上最著名的法老之一。"},{"en":"The pharaoh ordered the building of a great temple.","zh":"法老下令建造一座宏伟的神庙。"},{"en":"In many stories, the pharaoh is shown as powerful and divine.","zh":"在许多故事里，法老被描绘得强大且带有神性。"}]}],"synonyms":["Egyptian king","ruler"],"phonetic":"/ˈferoʊ/","extraExplanation":["“Pharaoh”来自古埃及语，原意与“王宫/大屋”（类似“宫廷”）有关，后来转为指国王本人。","在英文里，pharaoh既可泛指“古埃及的法老”，也常用来特指《圣经·出埃及记》（Exodus）中的那位法老（中文常译作“法老王”），在西方文化作品中出现频率很高。","复数通常是 pharaohs。"]}
{"word":"pharaohs","summary":{"en":"“Pharaohs” means the kings/rulers of ancient Egypt.","zh":"“Pharaohs”指古埃及的国王/统治者（法老）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ruler in ancient Egypt; the king of Egypt (often seen as a powerful political and religious leader).","zh":"（古埃及的）法老；古埃及国王（常被视为兼具政治与宗教权威的统治者）。"},"examples":[{"en":"The pharaohs built massive temples and monuments along the Nile.","zh":"法老们在尼罗河沿岸修建了巨大的神庙和纪念建筑。"},{"en":"Many people visit Egypt to learn about the pharaohs and the pyramids.","zh":"许多人去埃及参观，了解法老和金字塔。"},{"en":"Tutankhamun is one of the most famous pharaohs in history.","zh":"图坦卡蒙是历史上最著名的法老之一。"}]}],"synonyms":["kings","rulers","monarchs"],"phonetic":"/ˈferoʊz/","extraExplanation":["“Pharaoh”原本来自古埃及语中表示“王宫/大屋”的词（相当于用“白宫”来指代美国政府那样的转喻），后来才用来指称国王本人。","在英语里，pharaoh 的复数常见两种：pharaohs（更常用、规则复数）和 pharaohs/Pharaohs（专有名词语境首字母可大写）；也会见到较少见的复数形式 pharaos。"]}
{"word":"pharisaic","summary":{"en":"Pharisaic means hypocritically self-righteous—acting morally superior while criticizing others.","zh":"pharisaic 指“伪善地自以为正义”，表面道德高尚、实则爱指责别人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hypocritically self-righteous; pretending to be morally good while judging others (often with a strict, moralizing attitude).","zh":"（常含贬义）伪善的、自以为正义的；表面道德高尚、实则爱批评指责他人（带有严苛的道德说教口吻）。"},"examples":[{"en":"He gave a pharisaic speech about honesty, but he had been lying for months.","zh":"他发表了一通伪善的“诚实”演讲，可他已经撒谎好几个月了。"},{"en":"People were tired of her pharisaic judgments about how everyone should live.","zh":"大家厌倦了她那种伪善的评判，总爱指点别人该怎么生活。"}]}],"synonyms":["hypocritical","self-righteous","sanctimonious","holier-than-thou","moralizing"],"phonetic":"/ˌfærəˈseɪɪk/","extraExplanation":["“pharisaic”来自《圣经》语境中的“Pharisees（法利赛人）”。在新约故事里，法利赛人常被描写为重视外在遵守律法、却忽视内在真诚与怜悯，因此该词在现代英语里多用来批评“道德表演/道德优越感”和“伪善”。注意：现实历史中的法利赛人是古代犹太教的重要群体，并非人人都如刻板印象那样；现代使用时通常是修辞性的贬义标签。"]}
{"word":"pharmaceutical","summary":{"en":"Pharmaceutical usually means “related to medicines or the drug industry,” and less commonly it can mean a medicine/drug.","zh":"pharmaceutical 通常指“与药物或制药行业相关的”，较少情况下也可作名词表示“药品/药物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to medicines or the business of making and selling medicines (drugs).","zh":"与药物有关的；制药的；医药行业的。"},"examples":[{"en":"The company invests heavily in pharmaceutical research to develop new medicines.","zh":"这家公司在制药研究上投入巨大，以开发新药。"},{"en":"She works in the pharmaceutical industry.","zh":"她在医药行业工作。"},{"en":"Pharmaceutical regulations are strict to keep patients safe.","zh":"制药监管很严格，以保障患者安全。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or drug (less common; often used in plural: pharmaceuticals).","zh":"药品；药物（较少用；常用复数 pharmaceuticals 指“药品/药物”这一类）。"},"examples":[{"en":"The clinic keeps essential pharmaceuticals in stock.","zh":"诊所备有基本药品。"},{"en":"Some pharmaceuticals can cause side effects.","zh":"一些药物可能会引起副作用。"}]}],"synonyms":["medicinal","drug-related","pharma (informal)"],"phonetic":"/ˌfɑr.məˈsu.tɪ.kəl/","extraExplanation":["常见搭配：pharmaceutical company（制药公司）、pharmaceutical research（制药/药物研究）、pharmaceutical industry（医药行业）、pharmaceutical product（药品/医药产品）。","与 medicine 的区别：medicine 更偏“药/治疗用的药物”（日常用词）；pharmaceutical 更偏“与药物研发、生产、销售相关”的正式用词（新闻、商业、学术语境常见）。","词源提示：来自希腊语 pharmakon（药物/毒药），因此在历史上也带有“既能治病也可能有害”的含义背景。"]}
{"word":"pharmaceutist","summary":{"en":"Pharmaceutist is an uncommon word meaning “pharmacist,” a professional who prepares and dispenses medicines.","zh":"pharmaceutist 指“药剂师”，即负责配制和发放药品的专业人员；该词较少见，更常用 pharmacist。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person trained and licensed to prepare and dispense medicines; a pharmacist (this word is less common in modern English).","zh":"受过训练并取得执照、负责配制和发放药品的人；药剂师（该词在现代英语中较少用）。"},"examples":[{"en":"Ask the pharmaceutist if this medicine should be taken with food.","zh":"问问药剂师这种药是否需要随餐服用。"},{"en":"The pharmaceutist checked for possible drug interactions before filling the prescription.","zh":"药剂师在配药前检查了可能的药物相互作用。"}]}],"synonyms":["pharmacist","chemist (BrE)","druggist (US, old-fashioned)"],"phonetic":"/ˌfɑrməˈsuːtɪst/","extraExplanation":["“pharmaceutist”在当代英语里比较少见，更常用的词是“pharmacist”。在英式英语中你也可能看到“chemist”表示“药剂师/药房”。","词源上与“pharmaceutical（制药的）/pharmacy（药房，药学）”同根：pharmaceut-（与药物相关）+ -ist（表示从事某职业的人）。"]}
{"word":"pharmacist","summary":{"en":"A pharmacist is a healthcare professional who dispenses medicines and gives safe-use advice.","zh":"pharmacist 指负责配药、发药并提供安全用药建议的专业药剂师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trained professional who prepares and gives out medicines, explains how to use them safely, and checks for drug problems (often working in a pharmacy)","zh":"药剂师；药师：受过专业训练的人，负责配药、发药，解释安全用药方法，并检查药物相互作用等问题（常在药房工作）"},"examples":[{"en":"Ask the pharmacist if this medicine can make you sleepy.","zh":"问问药剂师这种药会不会让你犯困。"},{"en":"The pharmacist checked that the new pill was safe with her other medications.","zh":"药剂师确认了这颗新药与她正在用的其他药一起服用是安全的。"},{"en":"You can get advice about minor health problems from a pharmacist.","zh":"你可以向药剂师咨询一些轻微健康问题。"}]}],"synonyms":["drugstore pharmacist","chemist (BrE)","pharmacological professional"],"phonetic":"/ˈfɑrməsɪst/","extraExplanation":["在美国等地，pharmacist 通常指“持证药剂师”，可以提供用药咨询、核对处方、发现潜在的药物相互作用；而 pharmacy technician（药房技师/药剂助理）多做配药和流程性工作，但一般不能独立提供专业用药判断。","词根方面：pharm- 来自希腊语，和“药物/用药”有关；-ist 表示“从事某职业的人”。"]}
{"word":"pharmacological","summary":{"en":"“Pharmacological” means relating to drugs/medicines and their effects on the body.","zh":"“pharmacological”指“与药物及其对人体的作用有关的（药理的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to drugs/medicines and how they work in the body (their effects, uses, and side effects).","zh":"与药物/药品以及它们在人体内如何起作用（疗效、用途、副作用等）有关的。"},"examples":[{"en":"The report discusses the pharmacological effects of the new painkiller.","zh":"这份报告讨论了这种新止痛药的药理作用。"},{"en":"They are studying the pharmacological mechanisms behind the treatment.","zh":"他们正在研究这种治疗背后的药理机制。"}]}],"synonyms":["medicinal","drug-related","therapeutic"],"phonetic":"/ˌfɑɹ.mə.kəˈlɑː.dʒɪ.kəl/","extraExplanation":["词源上来自“pharmaco-（药物）+ -logical（……学/……方面的）”。在学术写作中很常见，常搭配：pharmacological effects（药理作用）、pharmacological study/research（药理研究）、pharmacological mechanism（药理机制）。","常与类似词区分：pharmaceutical（制药的/药品的，偏“产业/产品”），pharmacology（药理学，学科名），pharmacist（药剂师）。"]}
{"word":"pharmacology","summary":{"en":"Pharmacology is the scientific study of drugs and their effects on the body.","zh":"Pharmacology 指“药理学”，即研究药物及其对人体影响的科学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science of drugs: how they work in the body, how the body processes them, and how they are used to prevent or treat disease","zh":"药理学：研究药物如何在人体内起作用、人体如何代谢药物，以及药物如何用于预防或治疗疾病的科学"},"examples":[{"en":"She is studying pharmacology to understand how medicines affect the brain.","zh":"她正在学习药理学，以了解药物如何影响大脑。"},{"en":"Pharmacology helps doctors choose the right dose and avoid harmful interactions.","zh":"药理学帮助医生选择合适的剂量，并避免有害的药物相互作用。"}]}],"synonyms":["drug science","the study of drugs"],"phonetic":"/ˌfɑr.məˈkɑl.ə.dʒi/","extraExplanation":["词源：pharmaco-（药物）+ -logy（学科、研究）。在英文语境中，pharmacology 通常偏“药物作用机制与体内过程”的科学研究；而 pharmacy 更常指“药学/药房/配药与用药服务”（职业与实践层面）。","常见相关分支：药效学（pharmacodynamics，药物“对身体做什么”）与药代动力学（pharmacokinetics，身体“对药物做什么”，如吸收、分布、代谢、排泄）。","常见搭配：clinical pharmacology（临床药理学）、drug interaction(s)（药物相互作用）、side effect(s)（副作用）、dose/dosage（剂量）。"]}
{"word":"pharmacy","summary":{"en":"Pharmacy means a place where medicines are dispensed and sold, or the field of preparing and providing medicines.","zh":"Pharmacy 指“药房/药店”，也指“药学（配药与用药的专业）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A store (or a part of a store/hospital) where medicines are prepared and sold, and where you can get prescriptions filled.","zh":"药房；药店（或医院里的配药部门），提供配药与销售药品等服务。"},"examples":[{"en":"I need to pick up my prescription at the pharmacy.","zh":"我需要去药房取处方药。"},{"en":"The pharmacy is on the first floor next to the clinic.","zh":"药房在一楼，诊所旁边。"}]},{"partOfSpeech":"n.","definition":{"en":"The study and practice of preparing and giving medicines (the profession of a pharmacist).","zh":"药学；制药与配药的学科与职业（药剂师的专业）。"},"examples":[{"en":"She studied pharmacy at university and became a pharmacist.","zh":"她在大学学药学，后来成为药剂师。"},{"en":"Pharmacy is both science and patient care.","zh":"药学既是科学，也与患者照护有关。"}]}],"synonyms":["drugstore","chemist (BrE)","dispensary"],"phonetic":"/ˈfɑrməsi/","extraExplanation":["在美式英语里，pharmacy 常指“药房/药店”这个地点；而 drugstore 更常指“兼卖日用品的药妆店”（有时也可取药）。在医院场景中也会说 hospital pharmacy（医院药房）。","常见搭配：fill a prescription（配/抓处方药）、pick up/drop off a prescription（取药/递交处方）、over-the-counter (OTC) medicine（非处方药）、pharmacist（药剂师）。","词源：来自希腊语 pharmakon，既可指“药”也可指“毒”，提醒我们药物需按剂量与医嘱使用。"]}
{"word":"phas","summary":{"en":"“Phase” means a stage/period in a process, or (as a verb) to introduce/remove something gradually.","zh":"“Phase”表示过程中的阶段/时期；作动词可表示逐步实施或逐步取消。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “phase”) A stage or period in a process of change or development.","zh":"（可能你想查的是：phase）指变化或发展过程中的一个阶段、时期。"},"examples":[{"en":"The project is in its final phase.","zh":"这个项目正处于最后阶段。"},{"en":"Children go through different phases as they grow.","zh":"孩子在成长过程中会经历不同的阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"(phase) A distinct part of a planned activity, especially one in a sequence.","zh":"（phase）指计划活动中的一个明确部分，常按顺序推进。"},"examples":[{"en":"Phase one includes research and interviews.","zh":"第一阶段包括调研和访谈。"},{"en":"We will start the next phase next month.","zh":"我们下个月将开始下一阶段。"}]},{"partOfSpeech":"vt.","definition":{"en":"(phase) To introduce or carry out something gradually, step by step (often used with “in/out”).","zh":"（phase）使某事逐步开始/逐步停止（常与 in/out 连用）。"},"examples":[{"en":"The company will phase in the new rules over six months.","zh":"公司将在六个月内逐步实施新规。"},{"en":"They are phasing out single-use plastic bags.","zh":"他们正在逐步淘汰一次性塑料袋。"}]},{"partOfSpeech":"phrase","definition":{"en":"(phase) To be out of phase: not happening at the same time; not synchronized (common in science/engineering and general use).","zh":"（phase）out of phase 指不同步、不同相（在科学/工程及日常表达中常见）。"},"examples":[{"en":"The two signals are out of phase.","zh":"这两个信号不同相。"},{"en":"Our schedules are out of phase, so it’s hard to meet.","zh":"我们的日程不同步，所以很难见面。"}]}],"synonyms":["stage","period","step","stage (v.)","gradually introduce","gradually remove"],"phonetic":"/feɪz/","extraExplanation":["“phas”本身在日常英语里不是常见单词，更常见的是拼写为“phase”。如果你指的是缩写（如某个专业领域里的 PHAS），告诉我具体上下文/句子，我可以按你的意思解释。"]}
{"word":"phase","summary":{"en":"Phase usually means a stage of development; it can also mean the moon’s shape in its cycle, or (as a verb) to bring in or remove something gradually.","zh":"Phase 常指发展过程中的“阶段”；也可指“月相”；作动词时表示“逐步引入/逐步淘汰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stage or period in a process of change or development.","zh":"（发展或变化过程中的）阶段、时期。"},"examples":[{"en":"She’s going through a difficult phase in her life right now.","zh":"她现在正经历人生中一个艰难的阶段。"},{"en":"The project is in its final phase.","zh":"这个项目正处于最后阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"One of the distinct forms something can take, especially the appearance of the moon during its cycle (e.g., new moon, full moon).","zh":"（事物的）形态之一；尤指（月亮的）月相（如新月、满月）。"},"examples":[{"en":"We could see the moon in a thin crescent phase.","zh":"我们看见月亮处于细细的弯月月相。"}]},{"partOfSpeech":"vt.","definition":{"en":"To introduce or do something gradually in steps.","zh":"（按步骤）逐步引入；分阶段进行。"},"examples":[{"en":"The company will phase in the new system over six months.","zh":"公司将在六个月内逐步启用新系统。"},{"en":"They plan to phase out single-use plastics.","zh":"他们计划逐步淘汰一次性塑料制品。"}]}],"synonyms":["stage","period","step","cycle"],"phonetic":"/feɪz/","extraExplanation":["常见拼写提醒：你输入的是“phase”（阶段/月相），不要和“phrase”（短语）混淆。phase=阶段；phrase=词组/措辞。","固定搭配很常用：phase in（逐步引入）、phase out（逐步淘汰）。这两个在商业、政策、环保话题里非常高频。"]}
{"word":"phased","summary":{"en":"“Phased” usually means something happens gradually in stages; it can also be the past form of “phase,” often seen in “phase in/out.”","zh":"“phased”常指“分阶段进行、逐步推行”；也可作动词“phase”的过去式/过去分词，常见于“phase in/out（逐步引入/逐步淘汰）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done gradually in stages (not all at once); introduced or changed step by step","zh":"分阶段进行的；逐步推行/逐步改变的（不是一次性完成）"},"examples":[{"en":"The company announced a phased reopening of its offices.","zh":"公司宣布将分阶段重新开放办公室。"},{"en":"We used a phased approach to replace the old software.","zh":"我们采用分阶段的方法来替换旧软件。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “phase”: to introduce, carry out, or change something gradually in stages","zh":"“phase”的过去式/过去分词：使……分阶段实施；逐步引入或改变"},"examples":[{"en":"They phased in the new rules over six months.","zh":"他们在六个月内逐步实施新规定。"},{"en":"The school phased out the old grading system.","zh":"学校逐步取消了旧的评分制度。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “phase”: to adjust timing so things work together smoothly (technical use)","zh":"“phase”的过去式/过去分词：（技术用法）调整相位/时序，使之同步协作"},"examples":[{"en":"The engineer phased the signals to reduce delays.","zh":"工程师调整了信号的时序以减少延误。"}]}],"synonyms":["gradual","step-by-step","staged","incremental","in phases"],"phonetic":"/feɪzd/","extraExplanation":["“phased”在新闻、商业和政策语境里非常常见，通常搭配：phased rollout（分阶段推出）、phased implementation（分阶段实施）、phased reopening（分阶段开放）。","高频固定搭配：phase in（逐步引入/启用）与 phase out（逐步淘汰/取消）。例如：phased-in changes（逐步引入的变更）、phased-out program（逐步取消的项目）。"]}
{"word":"phases","summary":{"en":"“Phases” most often means the stages of a process or the Moon’s changing forms; it can also be the verb form meaning to introduce or remove something gradually.","zh":"“phases”常指“阶段”（或“月相”），也可作动词形式，表示“分阶段推行/逐步淘汰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of phase: a stage or step in a process, plan, or development.","zh":"phase 的复数：过程、计划或发展中的一个阶段/时期。"},"examples":[{"en":"The project has three phases: design, testing, and launch.","zh":"这个项目有三个阶段：设计、测试和上线。"},{"en":"She is in the final phase of her training.","zh":"她正处在训练的最后阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of phase: one of the changing forms of the Moon as seen from Earth (e.g., new moon, full moon).","zh":"phase 的复数：月亮从地球上看到的不同形态（如新月、满月）。"},"examples":[{"en":"The Moon’s phases repeat about every month.","zh":"月相大约每个月循环一次。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of phase: to arrange something in stages; to do something step by step.","zh":"phase 的第三人称单数：把某事分阶段进行；循序渐进地推进。"},"examples":[{"en":"The company phases in the new policy over six months.","zh":"公司用六个月分阶段推行新政策。"},{"en":"He phases out the old system gradually.","zh":"他逐步淘汰旧系统。"}]}],"synonyms":["stages","steps","periods","parts","cycles"],"phonetic":"/ˈfeɪzɪz/","extraExplanation":["常见易混词：phase /feɪz/（阶段、分阶段进行）不要和 faze /feɪz/（使慌乱、使受影响）混淆。例：It doesn’t faze me.（这不会影响我/我不慌。）","常见搭配：phase in（逐步引入/推行）、phase out（逐步淘汰）。"]}
{"word":"phasing","summary":{"en":"Phasing most commonly means introducing or doing something gradually in stages; in science/audio, it also means the phase relationship between waves or signals.","zh":"Phasing最常指“分阶段推进/逐步实施”；在科学与音频领域也可指“（波或信号的）相位关系”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of arranging something in stages or parts over time; gradual introduction","zh":"分阶段进行；按步骤推进；逐步引入"},"examples":[{"en":"The phasing of the new policy will take place over six months.","zh":"新政策将分六个月分阶段实施。"},{"en":"Careful phasing helped the team launch features without breaking the app.","zh":"谨慎的分阶段推进帮助团队在不影响应用的情况下上线功能。"}]},{"partOfSpeech":"n.","definition":{"en":"the way waves (such as sound or light) line up in time; the relationship of their phases","zh":"（物理）相位关系；（声波/光波等）波的相位对齐或错位情况"},"examples":[{"en":"Incorrect speaker placement can cause phasing and make vocals sound thin.","zh":"音箱摆放不当会造成相位问题，让人声听起来很单薄。"},{"en":"Engineers checked the phasing between the two signals.","zh":"工程师检查了两路信号之间的相位关系。"}]}],"synonyms":["staging","gradual rollout","step-by-step implementation","phase relationship"],"phonetic":"/ˈfeɪzɪŋ/","extraExplanation":["“phasing”常见于商业/项目语境，通常和in phases（分阶段）、phased rollout（分批上线/推广）、phase in（逐步引入）、phase out（逐步淘汰）一起使用。","在音频领域，phasing指相位对齐不佳导致的音色变化（例如变薄、空洞、像“刷刷”的声音）。这与日常的“分阶段推进”是不同领域的用法。"]}
{"word":"phasis","summary":{"en":"“Phasis” is a rare noun meaning “emphasis,” and it is usually encountered as part of the word “emphasis.”","zh":"“phasis”是一个很少单独使用的名词，意思接近“强调”，通常作为“emphasis”的一部分出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) An emphasis; special stress or importance given to something (often seen as part of the word “emphasis”).","zh":"（罕用）强调；对某事给予特别的重视（常见于单词“emphasis”的一部分）。"},"examples":[{"en":"In modern English, people usually say “emphasis,” not “phasis.”","zh":"在现代英语里，人们通常说“emphasis”，而不是“phasis”。"},{"en":"The speaker put extra phasis on safety rules.","zh":"演讲者对安全规则给予了额外的强调。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, old-fashioned) A statement or utterance; the act of speaking.","zh":"（很罕见，较旧用法）陈述；话语；说话这一行为。"},"examples":[{"en":"In older texts, “phasis” can refer to a formal statement.","zh":"在较旧的文本中，“phasis”有时指正式的陈述。"}]}],"synonyms":["emphasis","stress","importance"],"phonetic":"/ˈfeɪsɪs/","extraExplanation":["“phasis”来自希腊语词根，和“emphasis（强调）”有关；在现代英语里几乎不会单独使用。学习时建议优先掌握更常用的“emphasis”。","相关词：emphasis（强调）；emphasize（vt. 强调）；emphatic（adj. 强烈的；强调的）。"]}
{"word":"PhD","summary":{"en":"PhD = Doctor of Philosophy, a doctoral degree earned through advanced research; it can also mean a person who holds this degree.","zh":"PhD 指“哲学博士”，通过高阶研究获得的博士学位；也可指“博士学位持有者”（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctor of Philosophy: the highest common academic degree, earned after advanced research and writing a dissertation in a university field (not only philosophy).","zh":"哲学博士（PhD）：常见的最高学位之一，通常通过深入研究并完成博士论文获得（不只限于哲学专业）。"},"examples":[{"en":"She earned a PhD in chemistry at Stanford.","zh":"她在斯坦福大学获得了化学博士学位。"},{"en":"After his PhD, he became a university professor.","zh":"他获得博士学位后，成了大学教授。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has a PhD (informal).","zh":"拥有博士学位的人（非正式用法）。"},"examples":[{"en":"Our team has two PhDs and three engineers.","zh":"我们团队有两位博士和三位工程师。"},{"en":"He’s a PhD, so he’s used to reading research papers.","zh":"他是博士，所以很习惯读研究论文。"}]}],"synonyms":["doctorate","doctoral degree","Doctor of Philosophy"],"phonetic":"/ˌpiː eɪtʃ ˈdiː/","extraExplanation":["PhD 是缩写，完整形式是 Doctor of Philosophy。虽然字面含“哲学”，但实际可用于几乎所有学科（如 PhD in Physics / Education / Economics）。","书写上常见两种：PhD（更常见，尤其在美国）和 Ph.D.（带点）。复数通常写 PhDs 或 Ph.D.s。","正式场合常写在姓名后：Alex Chen, PhD；称呼上不一定用“Dr.”，是否使用取决于文化、场合与个人偏好。"]}
{"word":"phe","summary":{"en":"“phe” most commonly means phenylalanine (an amino acid), especially in medical/diet contexts; it can also mean Public Health England (PHE).","zh":"“phe”最常指苯丙氨酸（常见于医学/饮食语境）；也可指英格兰公共卫生署（PHE）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, usually in medicine/diet) Abbreviation for phenylalanine, an amino acid found in many proteins.","zh":"（非正式，多用于医学/饮食）“phenylalanine（苯丙氨酸）”的缩写；一种存在于许多蛋白质中的氨基酸。"},"examples":[{"en":"People with PKU must limit phe in their diet.","zh":"患有PKU（苯丙酮尿症）的人必须限制饮食中的phe（苯丙氨酸）。"},{"en":"This label shows the phe content per serving.","zh":"这个标签显示每份食物的phe（苯丙氨酸）含量。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for Public Health England (a former UK public health agency), often written as PHE.","zh":"“Public Health England（英格兰公共卫生署）”的缩写，常写作PHE（现已重组/更名）。"},"examples":[{"en":"The report was published by PHE.","zh":"这份报告由PHE发布。"},{"en":"PHE guidance was updated during the outbreak.","zh":"疫情期间，PHE的指导建议曾更新。"}]}],"synonyms":["phenylalanine","PHE"],"phonetic":"/fiː/","extraExplanation":["“phe”最常见于医疗与营养领域，尤其是与PKU（phenylketonuria，苯丙酮尿症）相关的饮食管理：患者需要控制苯丙氨酸摄入，因此包装食品或营养计划里常用“phe”标注含量。","在日常英语对话中单独说“phe”并不常见；更常见是写在说明书、化验单、营养标签或医学资料里。","注意大小写：表示机构名称时常写作大写“PHE”；表示苯丙氨酸时多见小写“phe”。"]}
{"word":"pheasant","summary":{"en":"A pheasant is a long-tailed game bird, often seen in the countryside and sometimes hunted or eaten.","zh":"pheasant 指一种长尾的猎鸟（雉鸡），常见于乡野，也可能被狩猎或食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medium-to-large bird with a long tail, often kept or hunted for sport and food.","zh":"一种中大型长尾鸟，常被饲养或用于狩猎，也可食用。"},"examples":[{"en":"We saw a pheasant run across the road and disappear into the tall grass.","zh":"我们看到一只雉鸡跑过马路，钻进了高草里。"},{"en":"Pheasant is sometimes served as a special dish in autumn.","zh":"雉鸡有时会在秋天作为一道特别的菜肴端上桌。"}]},{"partOfSpeech":"n.","definition":{"en":"A game bird (especially the ring-necked pheasant) raised for hunting in some countries.","zh":"（尤指环颈雉）在一些国家被饲养用于狩猎的猎鸟。"},"examples":[{"en":"The farm raises pheasants for the local hunting season.","zh":"这家农场饲养雉鸡，供当地狩猎季使用。"},{"en":"Ring-necked pheasants are common in parts of the U.S.","zh":"环颈雉在美国的一些地区很常见。"}]}],"synonyms":["game bird","fowl"],"phonetic":"/ˈfɛzənt/","extraExplanation":["“pheasant”在英美文化里常和“乡野/猎场（countryside / game bird）”的意象联系在一起：英国文学与影视中常出现“phea​sant shoot（猎雉）”，象征传统乡绅阶层的狩猎活动。","词源上来自古希腊语，意为“来自Phasis河（今格鲁吉亚一带）附近的鸟”，后经拉丁语、法语进入英语。"]}
{"word":"phein","summary":{"en":"“phein” isn’t a standard English word; it’s likely a misspelling.","zh":"“phein”不是标准英语单词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “phein” is most likely a misspelling of another word (commonly: “pain,” “feign,” or “phen-” in chemistry).","zh":"不是标准英语单词。“phein”很可能是其他单词的拼写错误（常见可能：pain「疼痛」、feign「假装」、或化学中的词根 phen-）。"},"examples":[{"en":"I couldn’t find “phein” in an English dictionary—did you mean “pain” or “feign”?","zh":"我在英语词典里找不到“phein”——你是想写“pain”还是“feign”呢？"}]}],"phonetic":"/peɪn/","extraExplanation":["“phein”本身不常见于英语词典或语料。你可以告诉我：你在哪里看到它（句子/截图/上下文），以及你想表达的意思（比如“疼”“假装”“化学术语”等），我就能帮你锁定正确单词并讲解用法。","常见可能目标：\n1) pain /peɪn/：名词“疼痛；痛苦”。\n2) feign /feɪn/：动词“假装；佯装”（拼写相近）。\n3) phen-：化学前缀/词根，常出现在 phenol（苯酚）、phenyl（苯基）等词中。"]}
{"word":"phenomena","summary":{"en":"Phenomena is the plural of phenomenon: observable events/facts, or (less commonly) remarkable people/things.","zh":"phenomena 是 phenomenon 的复数：指可观察的现象/事实；较少见时也指非凡的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Observable events or facts, especially things that can be noticed or studied (often used in science or careful description).","zh":"现象；可观察到的事件或事实（常用于科学或较严谨的描述）。"},"examples":[{"en":"Lightning is a natural phenomenon.","zh":"闪电是一种自然现象。"},{"en":"Scientists study climate phenomena like El Niño.","zh":"科学家研究厄尔尼诺等气候现象。"}]},{"partOfSpeech":"n.","definition":{"en":"An unusual, remarkable, or impressive person or thing.","zh":"非凡的人（或事物）；奇才；奇观。"},"examples":[{"en":"She is a phenomenon on the tennis court.","zh":"她在网球场上是个奇才。"},{"en":"The young singer became a global phenomenon.","zh":"这位年轻歌手成了全球现象级人物。"}]}],"synonyms":["events","occurrences","effects","marvels","wonders"],"phonetic":"/fəˈnɑːməˌnɑː/","extraExplanation":["“phenomena”是“phenomenon”的复数形式。单数：a phenomenon；复数：phenomena（注意拼写里的-o-变成-a）。","在日常英语里，人们有时会把“phenomena”误当作单数用（如 *this phenomena*），但标准用法应是 *this phenomenon*（单数）/ *these phenomena*（复数）。","词源来自希腊语，含义与“显现、出现”有关，所以常用于描述“能被看见或被观察到的事物”。"]}
{"word":"phenomenal","summary":{"en":"Phenomenal usually means “amazingly good or impressive,” and less commonly means “relating to observable phenomena.”","zh":"Phenomenal 通常表示“惊人的、非常棒的”，较少见的意思是“与可观察的现象有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely good or impressive; amazing.","zh":"极好的；惊人的；了不起的。"},"examples":[{"en":"She did a phenomenal job on the presentation.","zh":"她的演讲做得非常出色。"},{"en":"The team made a phenomenal comeback in the second half.","zh":"球队在下半场完成了惊人的逆转。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to phenomena (events or facts that can be observed), especially in science.","zh":"与“现象”有关的（可观察到的事件或事实），尤用于科学语境。"},"examples":[{"en":"Scientists study phenomenal changes in the atmosphere.","zh":"科学家研究大气中的现象变化。"},{"en":"His report focused on phenomenal data rather than personal opinions.","zh":"他的报告侧重于现象层面的数据，而不是个人观点。"}]}],"synonyms":["amazing","extraordinary","incredible","remarkable","spectacular","outstanding"],"phonetic":"/fəˈnɑmə nəl/","extraExplanation":["词源上来自 Greek/Latin 的“phenomenon（现象）”。在现代日常英语里，phenomenal 更常用作口语/书面夸赞，意思接近“特别棒、震撼”，不一定和“科学现象”有关。","搭配提示：phenomenal success/achievement/performance（巨大的成功/成就/表现）；也常与程度副词连用：absolutely/truly phenomenal（真的非常惊人）。"]}
{"word":"phenomenon","summary":{"en":"Phenomenon means an observable event/fact, or something/someone unusually famous and attention-getting.","zh":"phenomenon 指“可观察、可研究的现象”，也可指“引发广泛关注的现象级人物/事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An observable event or fact—something that happens or exists and can be noticed or studied, especially in science or everyday life.","zh":"现象：可被观察到的事件或事实——发生或存在、能被注意到或研究的事情，尤用于科学或日常生活。"},"examples":[{"en":"Rainbows are a natural phenomenon caused by light and water droplets.","zh":"彩虹是一种自然现象，由光线和水滴形成。"},{"en":"Scientists studied the phenomenon of ice melting faster in warmer oceans.","zh":"科学家研究了在较温暖的海洋中冰融化更快的现象。"}]},{"partOfSpeech":"n.","definition":{"en":"A remarkable person, thing, or success that attracts wide attention (often used in popular culture, sports, music, etc.).","zh":"风云人物/爆红事物：引起广泛关注的非凡人物、事物或成功（常用于流行文化、体育、音乐等语境）。"},"examples":[{"en":"The young athlete became a phenomenon after winning three titles in one year.","zh":"这位年轻运动员在一年内拿下三项冠军后，成了现象级人物。"},{"en":"The movie was a global phenomenon, inspiring fans everywhere.","zh":"这部电影成为全球现象，影响并激励了各地的影迷。"}]}],"synonyms":["event","occurrence","happening","fact","marvel","sensation"],"phonetic":"/fəˈnɑːməˌnɑːn/","extraExplanation":["词源：来自希腊语 phainomenon，意为“显现出来的事物”，与“appear（出现）”这一概念相关，所以它强调“可被观察到/被看见的”。","用法提示：phenomenon 是单数；复数是 phenomena（/fəˈnɑːməˌnɑː/）。例如：This phenomenon is common. / These phenomena are common.","常见搭配：natural phenomenon（自然现象），social phenomenon（社会现象），a rare phenomenon（罕见现象），explain a phenomenon（解释某种现象）。"]}
{"word":"pheral","summary":{"en":"“Pheral” is not standard; it’s usually a misspelling of “feral” (wild/undomesticated, especially animals that returned to the wild).","zh":"“pheral”不是标准拼写；通常是把“feral”（野生的/未驯化的，尤指回归野外的动物）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“pheral” is not a standard English word. It is most often a misspelling of “feral” (wild, not domesticated). Sometimes people also mean “peripheral” (on the edge, not central).","zh":"“pheral”不是标准英语单词。它最常见是把“feral”（野生的、未驯化的）拼错了；有时也可能是想写“peripheral”（边缘的、非核心的）。"},"examples":[{"en":"I think you mean “feral”: A feral cat lives outdoors and avoids people.","zh":"你可能想写“feral”：野猫（feral cat）住在户外，通常会躲着人。"},{"en":"If you mean “peripheral,” you could say: This issue is peripheral to our main goal.","zh":"如果你想表达“peripheral”，可以说：这个问题与我们的主要目标关系不大（属于边缘问题）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wild; living in a natural state, especially describing an animal that was once domesticated but now lives in the wild.","zh":"野生的；（尤指动物）曾被驯养但后来回到野外生活的。"},"examples":[{"en":"Feral dogs can form packs and search for food together.","zh":"野狗（feral dogs）可能会结成群体一起觅食。"},{"en":"The city runs programs to help manage feral cat populations humanely.","zh":"城市会开展项目，以更人道的方式管理野猫数量。"}]}],"synonyms":["wild","untamed","undomesticated"],"phonetic":"/ˈfɛrəl/","extraExplanation":["“feral”常见搭配有：feral cat（野猫）、feral dog（野狗）、feral population（野化种群）。它强调“曾经被人类驯化/饲养过，后来回到野外”的含义；而“wild”更泛指野生、自然状态。","“feral”来自拉丁语 ferus（野的、凶猛的），所以也常带一点“难以控制、带攻击性”的语感，但在科学/动物管理语境中多为中性描述。","如果你原本想写“peripheral”，它更常用于抽象话题：peripheral details（枝节细节）、peripheral vision（余光/周边视野）。"]}
{"word":"pherein","summary":{"en":"“pherein” is an Ancient Greek form meaning “to carry/bear,” mostly used in etymology and word origins.","zh":"“pherein”是古希腊语形式，意为“携带/承载”，多用于词源说明。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Ancient Greek) “to carry; to bear.” It is mainly seen in word origins (etymology), not used as a normal English word in everyday writing.","zh":"（源自古希腊语）“携带；承载”。主要出现在英语词源说明中，一般不作为日常英语词汇使用。"},"examples":[{"en":"The word “metaphor” comes from Greek meta- (“across”) + pherein (“to carry”), meaning “to carry across.”","zh":"“metaphor（隐喻）”源自希腊语 meta-（“跨越”）+ pherein（“携带/承载”），意思是“把意义带到另一处”。"},{"en":"In etymology notes, you may see pherein explained as “to bear” or “to bring.”","zh":"在词源注释里，你可能会看到 pherein 被解释为 “to bear（承载）” 或 “to bring（带来）”。"}]}],"synonyms":["carry","bear","bring"],"phonetic":"/ˈfɛreɪn/","extraExplanation":["“pherein”对应希腊语词根 *pher-*（“带、送、搬运”），它常出现在英语构词里：如 **metaphor**（meta + pherein，“把意义搬过去”→隐喻）、**semaphore**（sēma “信号” + pherein，“携带信号”→旗语/信号系统）、**pheromone**（“携带兴奋/刺激的物质”→信息素）。","如果你原本想查的是 **herein / therein / wherein**（常见于法律或正式文本，意为“在此/在其中/在何处”），告诉我具体拼写，我可以给你对应的词条。"]}
{"word":"pheria","summary":{"en":"“Pheria” is not a common English word; it’s usually a proper name or a misspelling of another word.","zh":"“Pheria”不是常见英文词；通常是专有名词（名字等）或其他单词的拼写误差。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard, commonly recognized English vocabulary word; most often seen as a proper name (a given name, brand name, or fictional/place name).","zh":"不是标准、常见的英文词汇；更常见于专有名词（人名、品牌名、虚构名或地名）。"},"examples":[{"en":"Pheria is the name of a character in the story.","zh":"Pheria 是故事里一个角色的名字。"},{"en":"She goes by Pheria online.","zh":"她在网上用 Pheria 作为昵称。"}]}],"phonetic":"/ˈfɪriə/","extraExplanation":["“pheria”在常用英语词典里通常查不到固定词义。它看起来像一个名字，也可能是拼写误差。","如果你想查的是情绪/心理相关词，很可能是：euphoria（极度愉快、欣快感）或 dysphoria（烦躁不适、心境不佳）。","如果你能提供看到它的句子或上下文（例如游戏、小说、医学术语），我可以更准确判断它的含义与用法。"]}
{"word":"pheromone","summary":{"en":"A pheromone is a chemical signal that affects other members of the same species, often for attraction or communication.","zh":"pheromone 指同种个体之间用于交流、吸引等作用的化学信号（信息素）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical signal released by an animal (and sometimes discussed in humans) that can influence the behavior or biology of others of the same species, especially related to attraction, warning, or marking trails","zh":"（信息）素；费洛蒙：动物（有时也用于讨论人类）释放的一种化学信号，会影响同种个体的行为或生理反应，常与吸引、警告或留下路线标记有关"},"examples":[{"en":"Ants use pheromones to mark trails to food.","zh":"蚂蚁用信息素标记通往食物的路线。"},{"en":"Some insects release pheromones to attract mates over long distances.","zh":"一些昆虫会释放信息素，在较远距离吸引配偶。"},{"en":"The cologne is marketed as having “pheromones,” but strong scientific evidence in humans is limited.","zh":"这款古龙水被宣传含有“信息素”，但在人类身上的强科学证据有限。"}]}],"synonyms":["chemical signal","scent signal"],"phonetic":"/ˈfɛrəˌmoʊn/","extraExplanation":["词源：来自希腊语 elements，常解释为“携带/传递（pherein）+刺激/引发（horman）”，因此可理解为“传递刺激的物质”。","学习提示：pheromone 多用于生物学语境；日常生活里常出现在香水/吸引力的营销话术中，但与昆虫等动物的研究相比，人类“信息素”效应更有争议。","常见搭配：release/emit pheromones（释放信息素）、pheromone trail（信息素路径）、sex pheromone（性信息素）。"]}
{"word":"Phil","summary":{"en":"Phil is most commonly a male name (short for Philip). It can also refer to the prefix phil- meaning “love,” as in philosophy and philanthropy.","zh":"Phil 最常见是男性名字（Philip 的简称）。它也可指词根/前缀 phil-，表示“爱/热爱”，如 philosophy、philanthropy。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, usually a short form of Philip (also used as a nickname for other names).","zh":"男性名字，通常是 Philip（菲利普）的简称（也可作其他名字的昵称）。"},"examples":[{"en":"Phil is my coworker in the marketing team.","zh":"Phil 是我们市场团队的同事。"},{"en":"I’m meeting Phil for lunch tomorrow.","zh":"我明天要和 Phil 一起吃午饭。"}]},{"partOfSpeech":"other","definition":{"en":"a combining form/prefix meaning “love” or “loving,” seen in words like philosophy (“love of wisdom”) and philanthropy (“love of humankind”).","zh":"构词前缀，表示“爱/热爱”，常见于 philosophy（爱智慧）和 philanthropy（博爱/慈善）等词。"},"examples":[{"en":"In philosophy, phil- means “love,” and -sophy relates to “wisdom.”","zh":"在 philosophy 这个词里，phil- 表示“爱”，-sophy 与“智慧”有关。"},{"en":"Philanthropy comes from phil- (“love”) + anthropos (“human”).","zh":"philanthropy 来自 phil-（爱）+ anthropos（人类）。"}]}],"synonyms":["Philip (full form)","phil- (as a prefix, not a synonym)"],"phonetic":"/fɪl/","extraExplanation":["“Phil”作为人名多源自希腊语 Philippos，意为“爱马的人”（phil-“爱”+ hippos“马”）。英语里常见正式写法是 Philip，口语中常缩写为 Phil。","注意区分：大写的 Phil 通常是人名；而小写的 phil- 多作为词根/前缀出现在较正式或学术类词汇中。"]}
{"word":"phil","summary":{"en":"“Phil” is usually a male name (short for Philip). “phil-” is a Greek-based prefix meaning “love” or “fondness for.”","zh":"“Phil”通常是男性名字（Philip 的昵称）。“phil-”是源自希腊语的前缀，表示“爱……/喜爱……”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common male given name, usually short for “Philip.”","zh":"常见的男性名字，通常是 “Philip（菲利普）” 的昵称。"},"examples":[{"en":"Phil is meeting us for lunch at noon.","zh":"Phil 中午要和我们一起吃午饭。"},{"en":"My uncle Phil lives in Chicago.","zh":"我叔叔 Phil 住在芝加哥。"}]},{"partOfSpeech":"other","definition":{"en":"a prefix (phil-) meaning “loving” or “having a fondness for,” from Greek.","zh":"前缀（phil-），表示“爱……/喜爱……”，源自希腊语。"},"examples":[{"en":"A bibliophile is someone who loves books.","zh":"bibliophile 指“爱书的人”。"},{"en":"The word “philosophy” comes from Greek roots meaning “love of wisdom.”","zh":"“philosophy（哲学）”来自希腊语词根，意思是“热爱智慧”。"}]}],"synonyms":["Philip","philo-","-phile"],"phonetic":"/fɪl/","extraExplanation":["“phil-”常见于较正式或学术词汇中：如 philosophy（philo- 爱 + -sophy 智慧）、philanthropy（philo- 爱 + anthro- 人类，指“慈善/博爱”）。","注意区分：phil-（前缀“爱”）与 -phile（后缀“爱好者”）很相关，例如 Francophile（亲法/喜欢法国文化的人）、audiophile（音响发烧友）。"]}
{"word":"Philadelphia","summary":{"en":"Philadelphia is a major U.S. city in Pennsylvania, famous for its role in American history; it’s often called “Philly.”","zh":"Philadelphia（费城）是美国宾夕法尼亚州的重要城市，因美国建国历史而闻名；常被简称为“Philly”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The largest city in the U.S. state of Pennsylvania; an important historical city where the Declaration of Independence and the U.S. Constitution were debated and adopted.","zh":"美国宾夕法尼亚州最大城市；美国重要历史城市，《独立宣言》和《美国宪法》曾在此讨论并通过。"},"examples":[{"en":"Philadelphia is known for Independence Hall and the Liberty Bell.","zh":"费城以独立宫和自由钟而闻名。"},{"en":"She moved to Philadelphia for a new job in healthcare.","zh":"她为了医疗行业的新工作搬到了费城。"}]},{"partOfSpeech":"n.","definition":{"en":"A common nickname for Philadelphia: “Philly.”","zh":"费城的常见昵称：Philly（常译作“费城/费城城”口语称呼）。"},"examples":[{"en":"I’m visiting Philly this weekend.","zh":"这个周末我去费城玩。"},{"en":"Philly has great museums and food.","zh":"费城有很棒的博物馆和美食。"}]}],"synonyms":["Philly"],"phonetic":"/ˌfɪləˈdɛlfiə/","extraExplanation":["“Philadelphia”源自希腊语：philo-（爱）+ adelphos（兄弟），字面意思是“兄弟之爱”。因此它常被称为“Brotherly Love（兄弟之爱之城）”。","在美国文化语境中，Philadelphia常与“美国建国史（Independence Hall）”、职业篮球队76ers、以及食物“Philly cheesesteak（费城奶酪牛排三明治）”联系在一起。"]}
{"word":"philadelphia","summary":{"en":"Philadelphia is a major U.S. city in Pennsylvania, famous for American founding history; it can also describe things related to the city.","zh":"Philadelphia（费城）是美国宾夕法尼亚州的重要城市，以美国建国历史闻名；也可用来形容与费城有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in the U.S. state of Pennsylvania, known for its important role in early American history (especially the American Revolution and the founding of the United States).","zh":"美国宾夕法尼亚州的一座大城市，以其在美国早期历史中的重要地位而闻名（尤其与美国独立战争及建国有关）。"},"examples":[{"en":"Philadelphia is where the Declaration of Independence was signed.","zh":"《独立宣言》是在费城签署的。"},{"en":"She moved to Philadelphia for a new job.","zh":"她为了新工作搬到了费城。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective to mean “from or related to Philadelphia.”","zh":"作形容词用，表示“来自费城的；与费城有关的”。"},"examples":[{"en":"He loves Philadelphia sports teams.","zh":"他很喜欢费城的运动队。"},{"en":"We tried a Philadelphia-style sandwich.","zh":"我们尝了费城风格的三明治。"}]}],"synonyms":["Philly (informal)"],"phonetic":"/ˌfɪləˈdɛlfiə/","extraExplanation":["“Philadelphia”这个名字来自希腊语：philo-（爱）+ adelphos（兄弟），原意是“兄弟之爱/手足之情”。因此费城的别称是“The City of Brotherly Love”（友爱之城/兄弟之爱之城）。","在美国文化里，“Philadelphia”常让人联想到：独立厅（Independence Hall）、自由钟（Liberty Bell），以及食物“Philly cheesesteak”（费城芝士牛排三明治，口语也常简称为“a Philly”）。"]}
{"word":"philanthropic","summary":{"en":"Philanthropic means giving or acting to help others, especially through organized charity or efforts to improve human well-being.","zh":"Philanthropic 指通过有组织的慈善捐助或行动帮助他人、改善人类福祉的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Helping others through giving money, time, or support, especially in an organized way (such as donating to charities).","zh":"（尤指有组织地）通过捐钱、投入时间或提供支持来帮助他人的；慈善的。"},"examples":[{"en":"The company is known for its philanthropic projects, including building schools.","zh":"这家公司以慈善项目闻名，包括修建学校。"},{"en":"She took a philanthropic approach to her success and funded free clinics.","zh":"她以慈善的方式回馈成功，资助了免费诊所。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a general desire to improve people’s lives and reduce suffering.","zh":"表现出普遍关心人类福祉、希望减轻痛苦的；博爱的。"},"examples":[{"en":"His philanthropic spirit made him volunteer every weekend.","zh":"他富有博爱精神，所以每个周末都去做志愿者。"},{"en":"The novel praises a philanthropic hero who cares for the poor.","zh":"这部小说赞扬了一位关心穷人的博爱英雄。"}]}],"synonyms":["charitable","benevolent","humanitarian","generous","altruistic"],"phonetic":"/ˌfɪlənˈθrɑːpɪk/","extraExplanation":["“philanthropic”来自希腊语词根：phil-（爱）+ anthrōpos（人），字面意思是“爱人类的”。常用于描述个人或机构的慈善捐助与公益行动。","近义词区分：charitable更常指“慈善捐助/施舍”；philanthropic更强调更大规模、更有计划、可能更长期的公益投入（如设立基金会、推动教育与公共健康项目）。"]}
{"word":"philanthropist","summary":{"en":"A philanthropist is a person who supports the public good by donating money, time, or resources to help others.","zh":"philanthropist 指通过捐钱、捐物或投入时间资源来帮助他人、促进社会公益的人（慈善家/博爱主义者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who gives money, time, or resources to help others, especially by supporting charities or causes that improve society.","zh":"慈善家；博爱主义者：指捐出金钱、时间或资源来帮助他人，尤其支持能改善社会的慈善组织或公益事业的人。"},"examples":[{"en":"The philanthropist donated millions to build a new children’s hospital.","zh":"这位慈善家捐出数百万美元来建一所新的儿童医院。"},{"en":"She is known as a philanthropist because she funds scholarships for students from low-income families.","zh":"她因资助低收入家庭学生的奖学金而被称为慈善家。"},{"en":"Many philanthropists support education, healthcare, and disaster relief.","zh":"许多慈善家支持教育、医疗和赈灾项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Broader) Someone who cares about the well-being of people and works to improve human life; a humanitarian.","zh":"（更广义）关心大众福祉并努力改善人类生活的人；人道主义者。"},"examples":[{"en":"He was a philanthropist in spirit, always looking for ways to make his community safer and kinder.","zh":"他精神上是一位博爱者，总在寻找让社区更安全、更友善的方法。"},{"en":"Her work as a philanthropist focused on clean water and public health.","zh":"她作为公益人士的工作重点是清洁饮用水与公共卫生。"}]}],"synonyms":["benefactor","donor","patron","humanitarian"],"phonetic":"/fɪˈlænθrəpɪst/","extraExplanation":["词源：来自希腊语 *philo-*（爱）+ *anthrōpos*（人），字面意思是“爱人的人”。","用法辨析：*philanthropist* 常强调“捐助/资助”（资金、资源）；*humanitarian* 更强调在危机或弱势群体中提供直接援助与关怀。两者有重叠，但侧重点不同。","文化提示：英语新闻里常见“tech philanthropist（科技界慈善家）”“major philanthropist（重要捐助人）”。也会用 *philanthropy* 表示“慈善事业/公益捐助”。"]}
{"word":"philanthropy","summary":{"en":"Philanthropy means helping society through organized giving—donating money, time, or resources for the public good.","zh":"Philanthropy 指通过有组织的捐助（钱、时间或资源）来帮助他人、改善社会的公益/慈善行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of giving money, time, or effort to help other people and improve society (often through charities, education, health, or the arts).","zh":"慈善事业；公益事业：通过捐钱、捐时间或投入资源来帮助他人、改善社会（常见于慈善机构、教育、医疗、艺术等领域）。"},"examples":[{"en":"Her philanthropy supports local schools and libraries.","zh":"她的公益捐助支持了当地的学校和图书馆。"},{"en":"The company is known for philanthropy, especially in public health.","zh":"这家公司以公益慈善闻名，尤其关注公共健康。"},{"en":"Philanthropy can be more than donations—volunteering also matters.","zh":"公益不止是捐款——做志愿者同样重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A single charitable gift or organized effort to help others.","zh":"（较少用）一次慈善捐赠；一项有组织的公益行动。"},"examples":[{"en":"Their latest philanthropy funds scholarships for first-generation students.","zh":"他们最新的一项公益项目为第一代大学生提供奖学金。"}]}],"synonyms":["charity","benevolence","humanitarianism","giving","altruism"],"phonetic":"/ˌfɪlənˈθrɑːpi/","extraExplanation":["“philanthropy”来自希腊语词根：phil-（爱）+ anthropos（人），字面意思是“爱人类”。因此它常带有“有计划、面向公共利益”的意味，语感上比“charity（慈善）”更强调长期、系统性的社会改善。","在英语语境中，philanthropy常与大型捐赠基金会、奖学金、研究资助等搭配；常见搭配有：philanthropy work（公益工作）, corporate philanthropy（企业公益）, philanthropic foundation（慈善/公益基金会）, philanthropic giving（公益捐赠）。"]}
{"word":"philatelist","summary":{"en":"A philatelist is someone who collects and studies postage stamps.","zh":"philatelist 指“集邮并研究邮票的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who collects and studies postage stamps (and sometimes related items like envelopes or postmarks).","zh":"集邮者；研究邮票的人（有时也包括信封、邮戳等相关邮品）。"},"examples":[{"en":"My grandfather is a philatelist who has collected stamps for over fifty years.","zh":"我爷爷是个集邮者，集邮已经超过五十年了。"},{"en":"The philatelist examined the stamp’s postmark to confirm its age.","zh":"这位集邮者检查邮戳来确认邮票的年代。"}]}],"synonyms":["stamp collector"],"phonetic":"/fɪˈlæt̬əlɪst/","extraExplanation":["“philatelist”来自法语 philatélie（集邮），由希腊语词根组合而成：phil- 表示“喜欢、热爱”，ateleia 与“免税/免付邮资”有关（早期邮票表示邮资已付）。因此 philately（集邮）字面上与“喜爱已付邮资（的邮品）”有关。","在英语语境里，philatelist 往往不只是“收集邮票”，也常暗示会研究邮票的版本、印刷差异、品相、邮戳与历史背景。常见搭配：a keen/avid philatelist（狂热的集邮者）；philatelic society（集邮协会）；philatelic exhibition/show（邮展）。"]}
{"word":"philately","summary":{"en":"Philately is the hobby and study of collecting postage stamps and related postal items.","zh":"Philately 指集邮——对邮票及相关邮政用品的收藏与研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hobby or study of collecting and learning about postage stamps (and related postal items such as envelopes with stamps and postmarks)","zh":"集邮；邮票（及相关邮政用品）的收藏与研究"},"examples":[{"en":"My grandfather got me into philately by giving me a small stamp album.","zh":"我爷爷送了我一本小邮票册，从此我开始接触集邮。"},{"en":"She joined a local philately club to learn how to identify rare stamps.","zh":"她加入了本地集邮俱乐部，学习如何辨认稀有邮票。"},{"en":"Philately can teach you history because stamps often show important people and events.","zh":"集邮能帮助你了解历史，因为邮票常常呈现重要人物和事件。"}]}],"synonyms":["stamp collecting"],"phonetic":"/fɪˈlætəli/","extraExplanation":["“philately”来自希腊语词根：phil-（爱、喜好）+ ateleia（免税/免邮费）。早期邮票与“已付邮资、免再付费”有关，因此形成了这个词。","常见搭配：a philately club（集邮俱乐部）、a philately exhibition（集邮展）、philately magazine（集邮杂志）。","相关词：philatelist（集邮者）。注意：philately 强调“收集与研究”；而 stamp collecting 更口语、更泛指“收集邮票”。"]}
{"word":"philippic","summary":{"en":"A philippic is a fierce public attack in a speech or writing.","zh":"philippic 指在演讲或文章中对某人或某事进行猛烈公开抨击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong public speech or piece of writing that attacks or criticizes someone or something, often in an angry or moral tone.","zh":"（公开的）严厉抨击性的演讲或文章，常带有愤怒或道德谴责的语气。"},"examples":[{"en":"The senator delivered a philippic against government corruption.","zh":"那位参议员发表了一篇猛烈抨击政府腐败的演说。"},{"en":"Her article became a philippic aimed at the company’s unsafe practices.","zh":"她的文章变成了一篇针对公司不安全做法的严厉檄文。"},{"en":"Instead of a calm debate, the meeting turned into a series of philippics.","zh":"会议没有进行冷静辩论，反而变成了一连串激烈的抨击。"}]}],"synonyms":["tirade","diatribe","invective","rant","denunciation"],"phonetic":"/fɪˈlɪpɪk/","extraExplanation":["词源与文化背景：philippic 源自古希腊演说家德摩斯梯尼（Demosthenes）针对马其顿国王腓力二世（Philip II）所发表的一系列谴责演说（Philippics）。后来罗马政治家西塞罗（Cicero）也写过《Philippics》抨击安东尼（Mark Antony）。因此，这个词常带有“政治性、公开性、火力很猛的抨击”这种历史语感。","用法提示：它比 criticism/complaint 更强烈，也更偏“公开演说或公开文字”。在日常口语里不算常见，常见于新闻、评论、学术写作或较正式的语境。"]}
{"word":"Philippine","summary":{"en":"“Philippine” means “related to the Philippines,” and less commonly it can mean “a person from the Philippines.”","zh":"“Philippine” 表示“菲律宾的、与菲律宾有关的”；较少情况下也可作名词表示“菲律宾人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"of or relating to the Philippines, or its people, culture, or languages","zh":"菲律宾的；与菲律宾（国家、人民、文化或语言）有关的"},"examples":[{"en":"Philippine food often includes dishes like adobo and sinigang.","zh":"菲律宾美食常见如阿多波（adobo）和酸汤（sinigang）等菜肴。"},{"en":"The company expanded into the Philippine market last year.","zh":"这家公司去年进入了菲律宾市场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Philippines","zh":"菲律宾人"},"examples":[{"en":"She is a Philippine working in the United States.","zh":"她是一位在美国工作的菲律宾人。"}]}],"synonyms":["Filipino (common for people/culture)","of the Philippines"],"phonetic":"/ˈfɪləˌpaɪn/","extraExplanation":["日常英语里更常用的形容词是 “Filipino” 来指“菲律宾的/菲律宾人（文化）”，例如 “Filipino food / a Filipino student”。“Philippine” 常见于较正式或固定搭配中，尤其是机构与地名名词短语：the Philippine government（菲律宾政府）、the Philippine Islands（菲律宾群岛，较历史/正式说法）。","拼写与大写：作为专有形容词/名词一般要大写（Philippine）。","发音提示：词中重音通常在第二音节附近（phi-LIP-...），注意结尾 -pine 读作 /paɪn/，像 “pine（松树）” 的音。"]}
{"word":"Philippinely","summary":{"en":"“Philippinely” is a rare adverb meaning “in a Philippine/Filipino way.” In everyday English, people usually say “in a Filipino way” or use “Philippine/Filipino” as adjectives instead.","zh":"“Philippinely”是较少见的副词，意思是“以菲律宾/菲律宾人风格地”。日常英语里更常说“in a Filipino way”，或用“Philippine/Filipino”作形容词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a Philippine way; in a manner characteristic of the Philippines or Filipinos (rare).","zh":"以菲律宾的方式；带有菲律宾特色地（较少见/较少使用）。"},"examples":[{"en":"The festival was organized Philippinely, with strong community spirit and shared food.","zh":"这个节庆以很有菲律宾特色的方式组织，强调社区精神和分享食物。"},{"en":"He greeted his elders Philippinely, showing respect through polite language.","zh":"他用很有菲律宾特色的方式向长辈问候，通过礼貌用语表达尊重。"}]},{"partOfSpeech":"adv.","definition":{"en":"From the Philippines; in relation to the Philippines (very rare, often replaced by “Philippine” or “Filipino”).","zh":"来自菲律宾的；与菲律宾有关的（非常少见，通常用“Philippine”或“Filipino”替代）。"},"examples":[{"en":"The article discusses Philippinely rooted traditions in coastal villages.","zh":"这篇文章讨论了沿海村落中根植于菲律宾的传统。"}]}],"synonyms":["in a Filipino way","in a Philippine manner","typically Filipino","in the Philippines (context-dependent)"],"phonetic":"/ˌfɪləˈpiːnli/","extraExplanation":["“Philippinely”不是常用词，更多属于“临时造词/修辞性用法”。在日常英语里，人们通常说：\n- adjective：Philippine (e.g., Philippine culture 菲律宾文化)\n- adjective/noun：Filipino (e.g., Filipino food 菲律宾菜；a Filipino 一个菲律宾人)\n如果你想表达“以菲律宾方式”，也常用更自然的说法：“in a Filipino way / in a typically Filipino manner”。"]}
{"word":"Philippines","summary":{"en":"The Philippines is a Southeast Asian island country in the western Pacific.","zh":"菲律宾是位于西太平洋的东南亚群岛国家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country made up of many islands in Southeast Asia, in the western Pacific Ocean; its capital is Manila.","zh":"菲律宾：东南亚的群岛国家，位于西太平洋；首都是马尼拉。"},"examples":[{"en":"My friend moved to the Philippines for work.","zh":"我朋友为了工作搬去了菲律宾。"},{"en":"The Philippines is known for its beautiful beaches and many islands.","zh":"菲律宾以美丽的海滩和众多岛屿闻名。"}]}],"synonyms":["the Philippines","Republic of the Philippines"],"phonetic":"/ˈfɪləˌpiːnz/","extraExplanation":["“Philippines”一般与定冠词连用：the Philippines（因为它是由很多岛屿组成的群岛国家）。例如：I’m traveling to the Philippines. / She lives in the Philippines.","语言与文化小知识：菲律宾的官方语言是Filipino（以塔加洛语Tagalog为基础）和English（英语）。日常生活中也常见多种地方语言。"]}
{"word":"Philips","summary":{"en":"Philips is most commonly the name of the Dutch company; it can also be a surname.","zh":"Philips 最常指荷兰公司“飞利浦”；也可以是英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch multinational company best known for electronics, lighting, and health‑technology products (often written as Philips or Koninklijke Philips).","zh":"飞利浦：一家荷兰跨国公司，以电子产品、照明与健康科技产品闻名（常写作 Philips 或 Koninklijke Philips）。"},"examples":[{"en":"Our hospital uses Philips machines for medical imaging.","zh":"我们医院使用飞利浦的设备做医学影像检查。"},{"en":"Philips used to be famous for TVs and light bulbs, and now focuses more on health technology.","zh":"飞利浦过去以电视和灯泡出名，如今更专注于健康科技。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"菲利普斯：一个英文姓氏（家族姓）。"},"examples":[{"en":"Ms. Philips will lead today’s meeting.","zh":"菲利普斯女士将主持今天的会议。"},{"en":"Philips is a common surname in English-speaking countries.","zh":"Philips 是英语国家里比较常见的姓氏。"}]}],"synonyms":["Koninklijke Philips","Philips Electronics"],"phonetic":"/ˈfɪlɪps/","extraExplanation":["“Philips（飞利浦）”这家公司起源于荷兰，早期以灯泡和收音机等产品闻名。中文里常译为“飞利浦”。作为姓氏时，也可能拼作 Phillips（多一个 s），两者在日常使用中容易混淆。"]}
{"word":"philistine","summary":{"en":"A philistine is someone seen as uncultured or uninterested in art and ideas; it can also describe a narrow, materialistic attitude.","zh":"philistine 指被认为缺乏文化鉴赏力、对艺术思想不感兴趣的人；也可形容狭隘功利、庸俗的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not interested in art, literature, or ideas, and who may dislike or fail to understand them","zh":"（常带贬义）不关心艺术、文学或思想的人；庸俗的人；对文化缺乏鉴赏力的人"},"examples":[{"en":"He called the critics philistines because they dismissed the novel as “too strange.”","zh":"他称那些评论家是“庸俗之人”，因为他们把这部小说斥为“太怪了”。"},{"en":"She isn’t a philistine—she just hasn’t had much chance to visit museums.","zh":"她并不是不懂文化的人——只是一直没什么机会去博物馆。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing a lack of interest in or understanding of art and culture; narrowly materialistic","zh":"（态度/品味）缺乏文化兴趣或鉴赏力的；狭隘功利的"},"examples":[{"en":"They criticized the philistine attitude that only money matters.","zh":"他们批评那种只看重金钱的狭隘功利态度。"},{"en":"It’s a bit philistine to say music is useless just because it doesn’t make money.","zh":"仅因为音乐不赚钱就说它没用，这种说法有点庸俗狭隘。"}]}],"synonyms":["uncultured","unrefined","boorish","materialistic","crass"],"phonetic":"/ˈfɪlɪˌstaɪn/","extraExplanation":["“philistine”常用于文化评论或日常吐槽，语气通常偏负面，带有“自以为有品味的人在批评别人没品味”的味道；使用时要注意场合，容易显得刻薄。","词源上与《圣经》中的“非利士人（Philistines）”有关：后来在欧洲大学文化里被借用来指“反文化、反学术”的人，逐渐演变为今天“缺乏艺术/文化鉴赏力的人”。","相关表达：philistine taste（庸俗的品味），cultural philistine（文化上的门外汉/庸俗之人）。近义词有“uncultured”“boorish”（更粗鲁）、“materialistic”（更强调功利）。"]}
{"word":"Philo","summary":{"en":"Philo is a male name; as philo-/phil-, it means “loving” or “fond of” in many English words.","zh":"Philo 可作男性名字；作为 philo-/phil- 词根/前缀时，表示“爱……的、喜好……的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (often short for longer names, but also used on its own).","zh":"男性名字（有时是较长名字的简称，也可单独作为名字使用）。"},"examples":[{"en":"Philo introduced himself and said he was from Ohio.","zh":"菲洛做了自我介绍，说他来自俄亥俄州。"},{"en":"Philo’s idea changed the way the team worked.","zh":"菲洛的想法改变了团队的工作方式。"}]},{"partOfSpeech":"other","definition":{"en":"(philo- / phil-) A word part meaning “loving,” “fond of,” or “attracted to,” used to form words.","zh":"（词根/前缀 philo- / phil-）表示“爱……的、喜好……的、被……吸引的”，用于构成新词。"},"examples":[{"en":"A “bibliophile” is someone who loves books.","zh":"“bibliophile” 指“爱书的人”。"},{"en":"“Francophile” describes someone who is fond of French culture.","zh":"“Francophile” 用来形容“喜爱法国文化的人”。"},{"en":"In biology, “hydrophilic” means attracted to water.","zh":"在生物学中，“hydrophilic” 意为“亲水的、易与水结合的”。"}]}],"synonyms":["phil- (variant form)"],"phonetic":"/ˈfaɪloʊ/","extraExplanation":["“Philo-”来自希腊语 *phílos*（朋友的、亲爱的）/ *phileîn*（爱、喜欢）。它常出现在与兴趣、偏好、性格或化学性质相关的词中，如 *philosophy*（爱智慧）、*philanthropy*（爱人类、慈善）。","作为人名的 Philo 在英语世界里也因历史人物而常见：例如发明家 Philo Farnsworth（早期电视技术的重要人物）。另外，古代也有“亚历山大的斐洛（Philo of Alexandria）”，是一位融合希腊哲学与犹太思想的哲学家。"]}
{"word":"philo","summary":{"en":"Philo- is a Greek-based prefix meaning “loving” or “fond of.” Informally, “a philo” can mean an enthusiast of something; it’s also used as a given name.","zh":"philo- 是源自希腊语的前缀，表示“爱……的/喜好……的”。口语中 a philo 可指某种事物的爱好者；它也可作人名使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(as a prefix, philo-) having a love for; attracted to; favoring.","zh":"（作前缀 philo-）表示“爱……的；喜好……的；倾向于……的”。"},"examples":[{"en":"A “philosopher” is literally a lover of wisdom.","zh":"“philosopher（哲学家）”从字面上就是“爱智慧的人”。"},{"en":"Someone who is “bibliophilic” loves books.","zh":"“bibliophilic（爱书的）”指喜欢书的人。"},{"en":"The museum’s program is very “philhellenic,” celebrating Greek culture.","zh":"博物馆的项目很“philhellenic（亲希腊文化的）”，在赞美希腊文化。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who loves or enjoys something (often used informally, based on the philo- prefix).","zh":"（非正式用法）指“爱好者；热爱某物的人”，源自前缀 philo-。"},"examples":[{"en":"He’s a real philo when it comes to languages—always studying a new one.","zh":"他在语言方面真是个“philo（爱好者）”——总在学新语言。"},{"en":"As a coffee philo, she tries beans from different countries.","zh":"作为咖啡爱好者，她会尝试不同国家的咖啡豆。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name (from Greek names such as Philo).","zh":"（人名）菲洛（源自希腊语名字，如 Philo）。"},"examples":[{"en":"Philo of Alexandria wrote about philosophy and religion.","zh":"亚历山大的菲洛（Philo of Alexandria）写过哲学与宗教方面的作品。"}]}],"synonyms":["philo- (combining form)","lover","enthusiast","fan"],"phonetic":"/ˈfaɪloʊ/","extraExplanation":["“philo-”来自希腊语词根 *philein*（爱、喜欢）。英语里常见于学术或正式构词：*philosophy*（爱智慧）、*philology*（语言文字学，原意偏向“爱言辞/爱学问”）、*philanthropy*（博爱/慈善）。","注意与“phobia”（恐惧、厌恶）相对：*xenophilia*（喜爱外国/外来事物） vs. *xenophobia*（排外、恐外）。"]}
{"word":"philology","summary":{"en":"Philology is the historical study of languages through old texts and their cultural context.","zh":"Philology（语文学）是通过古代文本来研究语言历史演变及其文化背景的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of language in historical texts, focusing on how words, grammar, and meanings change over time and what texts can tell us about a culture.","zh":"（语文学）通过历史文本研究语言的学科，关注词汇、语法与意义如何随时间演变，以及文本如何反映文化。"},"examples":[{"en":"She studied philology to learn how English changed from Old English to modern English.","zh":"她学习语文学，以了解英语如何从古英语演变到现代英语。"},{"en":"Philology often involves reading old manuscripts and comparing different versions of a text.","zh":"语文学常常需要阅读古手稿，并比较同一文本的不同版本。"}]}],"synonyms":["historical linguistics","textual scholarship","linguistics (broader)","etymology (related)"],"phonetic":"fəˈlɑlədʒi","extraExplanation":["“philology”来自希腊语：philo-（爱、喜好）+ logos（词、言语、学问），字面意思接近“爱语言/文字的学问”。","在现代大学里，“philology”有时听起来较传统，常与“historical linguistics（历史语言学）”“textual criticism（文本校勘/文献校勘）”“classics（古典学）”等领域重叠；而“linguistics（语言学）”更偏向用现代方法研究语言结构与规律。","常见搭配：comparative philology（比较语文学）、classical philology（古典语文学）、Germanic/Romance philology（日耳曼/罗曼语文学）。"]}
{"word":"Philos","summary":{"en":"“Philos” is commonly an informal campus short form of “philosophy,” and it can also refer to the Greek word meaning “friends” in scholarly contexts.","zh":"“Philos”常见用法是校园里对“philosophy（哲学）”的非正式简称；在学术语境中也可指希腊语中意为“朋友们”的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly in universities) Philosophy as a subject, course, or department.","zh":"（非正式，多用于大学语境）哲学（作为学科、课程或系科）。"},"examples":[{"en":"She’s taking philos next semester.","zh":"她下学期要修哲学课。"},{"en":"The philos department is hosting a talk on ethics.","zh":"哲学系要举办一场关于伦理学的讲座。"}]},{"partOfSpeech":"other","definition":{"en":"(from Greek, used in scholarly contexts) “Friends” or “beloved ones”; plural of Greek philos (“friend”).","zh":"（源自希腊语，学术语境）“朋友们/所爱之人”；为希腊语 philos（朋友）的复数。"},"examples":[{"en":"In the Greek text, the word philosophically related to philos means “friend.”","zh":"在希腊文本中，与 philos 同源的词表示“朋友”。"},{"en":"Some translators explain philos as “dear friends” in context.","zh":"一些译者会在语境中把 philos 解释为“亲爱的朋友们”。"}]}],"synonyms":["philosophy (informal: philos)","phil.- (abbrev., less common)"],"phonetic":"/ˈfaɪlɑːs/","extraExplanation":["“philos”常让人联想到希腊语词根 phil-/philo-（表示“爱、喜爱”），它出现在很多英语词里：philosophy（爱智慧）、philanthropy（博爱/慈善）、bibliophile（爱书的人）。不过在日常英语里单独写 philos，更常见的是校园里的口语缩写，指“哲学课/哲学系”。"]}
{"word":"philos","summary":{"en":"“Philos” is an informal or campus-style abbreviation referring to philosophy people (students/philosophers) or to philosophy courses/department labels (e.g., PHILOS 101).","zh":"“philos”多为校园语境中的非正式缩写：可指学哲学的人，也可指哲学课程/哲学系的课程编号标识（如 PHILOS 101）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) People who study or work in philosophy; philosophy students or philosophers.","zh":"（非正式）学哲学的人；哲学专业学生或哲学家。"},"examples":[{"en":"Most of the philos I know love arguing about what “truth” really means.","zh":"我认识的大多数哲学系同学都喜欢争论“真理”到底是什么意思。"},{"en":"The café gets busy when the philos finish their seminar.","zh":"哲学课下课后，那家咖啡馆就会变得很忙。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in course catalogs) A short label for philosophy classes or the philosophy department, often written as “PHILOS” plus a number.","zh":"（尤指课程目录中）哲学课程或哲学系的缩写标识，常写作“PHILOS + 课程号”。"},"examples":[{"en":"I’m taking PHILOS 101 next semester.","zh":"我下学期要修 PHILOS 101。"},{"en":"Check the PHILOS section for logic courses.","zh":"想找逻辑课可以看 PHILOS 那一栏。"}]}],"synonyms":["philosophy students","philosophers","PHIL (course code)","philosophy (dept./courses)"],"phonetic":"/ˈfaɪloʊz/","extraExplanation":["“philos”本身不是非常标准的通用英语词，更常见于校园口语（指“哲学系的人”）或课程编号/目录里（如 PHILOS 101）。不同学校也可能用 PHIL、PHILOS、PHILO 等缩写。","它和希腊语词根 *philo-*（表示“爱、喜爱”，如 *philosophy* = “爱智慧”）有关；但在现代英语里，“philos”多被当作缩写来理解，而不是独立的词根形式。"]}
{"word":"philosopher","summary":{"en":"A philosopher is either a person who studies philosophy or someone who thinks deeply and stays calm and reasonable.","zh":"philosopher 指“哲学家”，也可指“善于深思、处事冷静理性的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies philosophy (big questions about knowledge, truth, ethics, and reality), especially as an academic subject.","zh":"哲学家；研究哲学（关于知识、真理、伦理与现实等重大问题）的人，尤指学术领域的人。"},"examples":[{"en":"Socrates is one of the most famous philosophers in Western history.","zh":"苏格拉底是西方历史上最著名的哲学家之一。"},{"en":"She is a philosopher who writes about ethics and justice.","zh":"她是一位研究伦理与正义的哲学家。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who thinks deeply and calmly about life, often staying reasonable in difficult situations.","zh":"有哲思的人；处事冷静理性、善于深入思考人生的人。"},"examples":[{"en":"Even after the failure, he stayed calm—like a philosopher.","zh":"即使失败了，他也很冷静——像个有哲思的人。"},{"en":"Try to take a philosopher’s view: learn from the problem instead of blaming yourself.","zh":"试着用“哲学家”的视角看：从问题中学习，而不是责备自己。"}]}],"synonyms":["thinker","philosophy scholar","sage","intellectual"],"phonetic":"/fəˈlɑsəfər/","extraExplanation":["词源：philosopher 来自希腊语 philosophos，意思是“爱智慧的人”（philo- = 爱；-sophia = 智慧）。因此它不仅指专业学者，也常用来形容“看事情很通透、很淡定”的人。","文化用法提示：英语里说 someone is a philosopher 往往不是在说他有正式头衔，而是称赞他遇事冷静、能从长远角度思考。"]}
{"word":"philosophers","summary":{"en":"“Philosophers” are people who study philosophy (or, more generally, calm and wise thinkers). It is the plural of “philosopher.”","zh":"“philosophers”是“philosopher”的复数，指研究哲学的人；也可泛指处事冷静、理性智慧的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies philosophy—big questions about reality, knowledge, values, and how we should live.","zh":"哲学家：研究哲学的人——探讨关于现实、知识、价值以及“我们该如何生活”等重大问题。"},"examples":[{"en":"Many philosophers have debated what makes a life meaningful.","zh":"许多哲学家一直在争论什么让人生变得有意义。"},{"en":"Socrates is one of the most famous philosophers in Western history.","zh":"苏格拉底是西方历史上最著名的哲学家之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who stays calm and thinks in a wise, reasonable way, especially during trouble (more general, everyday use).","zh":"（泛指）处变不惊、冷静理性的人；遇到麻烦时也能以较智慧、合理的方式思考的人。"},"examples":[{"en":"Even after the bad news, she remained a philosopher and focused on what she could control.","zh":"即使听到坏消息，她仍然很冷静，把注意力放在自己能掌控的事情上。"}]}],"synonyms":["thinkers","philosophy scholars","intellectuals","wise people"],"phonetic":"/fəˈlɑsəfərz/","extraExplanation":["“philosophers”是名词复数，单数是“philosopher”。发音重音在第2个音节：phi-LOS-o-pher。","词源来自希腊语 philosophos，意思是“爱智慧的人”（philo- 爱；-sophia 智慧）。","日常语境里，把某人称为“a philosopher”常带有“很淡定、看得开”的含义；但在学术语境里则指“哲学研究者/思想家”。"]}
{"word":"Philosophiae","summary":{"en":"*Philosophiae* is Latin for “of philosophy / philosophy’s,” most often seen in classical titles (e.g., Newton’s *Principia*).","zh":"*Philosophiae* 是拉丁语，表示“哲学的 / 属于哲学的”，最常见于经典著作标题（如牛顿《原理》）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) Genitive singular of *philosophia*, meaning “of philosophy” or “philosophy’s,” often seen in Latin book titles.","zh":"（拉丁语）*philosophia* 的单数属格，意思是“哲学的 / 属于哲学的”，常见于拉丁文书名或标题中。"},"examples":[{"en":"Newton’s famous book title begins with *Philosophiae*: *Philosophiae Naturalis Principia Mathematica*.","zh":"牛顿的名著书名以 *Philosophiae* 开头：*Philosophiae Naturalis Principia Mathematica*（《自然哲学的数学原理》）。"},{"en":"In Latin titles, *Philosophiae* can be understood as “philosophy’s,” showing a relationship like possession.","zh":"在拉丁文标题里，*Philosophiae* 常可理解为“哲学的 / 哲学之……”，用来表示所属或关联。"}]}],"synonyms":["of philosophy","philosophy’s"],"phonetic":"/fɪˌlɑːsəˈfiː.aɪ/","extraExplanation":["这是拉丁语的格变化：*philosophia*（哲学）→ *philosophiae*（“哲学的 / 属于哲学的”）。在英文语境里它多作为引用拉丁文出现，而不是现代英语单词。","在英语世界里最常见的固定搭配是牛顿书名 *Philosophiae Naturalis Principia Mathematica*，其中 *Naturalis* 是“自然的”，整体可理解为“自然哲学的数学原理”。","拉丁语在不同学术传统中读音会有差异（古典拉丁/教会拉丁/英语化读法），因此你可能会听到不止一种读法。"]}
{"word":"philosophic","summary":{"en":"Philosophic means “related to philosophy” or “calm and thoughtful, especially about difficulties.”","zh":"philosophic 意为“哲学的”，也可指“面对困难时冷静通达、理性思考的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to philosophy; showing deep, calm thinking about life, knowledge, or what is right and wrong.","zh":"哲学的；富于思考的（关于人生、知识或道德等问题），也可指一种冷静、通达的态度。"},"examples":[{"en":"She took a philosophic view of the setback and tried to learn from it.","zh":"她以一种通达冷静的态度看待这次挫折，并努力从中吸取教训。"},{"en":"The book offers a philosophic discussion of what it means to live a good life.","zh":"这本书从哲学角度讨论了“过一种好生活”意味着什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"Calm and reasonable when dealing with difficulties or disappointment.","zh":"（面对困难或失望时）冷静理性、看得开。"},"examples":[{"en":"Try to stay philosophic when plans change at the last minute.","zh":"临时计划有变时，尽量保持冷静理性。"},{"en":"He was surprisingly philosophic about the criticism.","zh":"他对批评的态度出奇地通达冷静。"}]}],"synonyms":["philosophical","reflective","thoughtful","stoic","calm"],"phonetic":"/ˌfɪləˈsɑːfɪk/","extraExplanation":["“philosophic”常见于较正式的书面语，意思接近“philosophical”。在日常对话里，人们更常说“philosophical”，但“philosophic”在学术或文学语境中也很自然。","注意区分：philosophic/philosophical（哲学的、通达的）≠ philosopher（哲学家）。"]}
{"word":"philosophical","summary":{"en":"“Philosophical” means either related to philosophy or calmly accepting difficulties.","zh":"“philosophical”既可指“与哲学有关”，也可指“达观、处变不惊”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to philosophy (the study of fundamental questions about life, knowledge, reality, right and wrong, etc.).","zh":"与哲学有关的；哲学性的（研究人生、知识、现实、善恶等根本问题的学科）。"},"examples":[{"en":"She took a philosophical approach to ethics and human behavior.","zh":"她用哲学性的方式来研究伦理与人类行为。"},{"en":"The book is more philosophical than practical.","zh":"这本书更偏哲学探讨，而不是实用指南。"}]},{"partOfSpeech":"adj.","definition":{"en":"Calm and accepting about difficulties or bad events; not easily upset.","zh":"（面对困难或不幸）达观的；冷静接受的；不易烦恼的。"},"examples":[{"en":"He stayed philosophical after losing the match and congratulated his opponent.","zh":"他输掉比赛后依然很达观，并祝贺了对手。"},{"en":"Try to be philosophical about the delay—these things happen.","zh":"尽量对这次延误看开点——这种事难免发生。"}]}],"synonyms":["reflective","theoretical","contemplative","stoic","calm"],"phonetic":"/ˌfɪləˈsɑfɪkəl/","extraExplanation":["“philosophical”在英语里常有两层常见用法：一是“与哲学学科相关”，二是日常口语中“看得开、处变不惊”。第二种含义有时带一点劝慰的语气，比如让对方别太纠结。","词根来源：philo-（爱）+ sophy（智慧），与“philosophy（哲学）”同源，因此也常见于学术语境，如 philosophical argument（哲学论证）、philosophical question（哲学问题）。"]}
{"word":"philosophically","summary":{"en":"Philosophically means either “from a philosophy perspective” or “in a calm, accepting way.”","zh":"philosophically 可指“从哲学角度”，也可指“以冷静、豁达、能接受的态度”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to philosophy (the study of ideas such as truth, knowledge, reality, and ethics) or to philosophical thinking.","zh":"以哲学的方式；从哲学角度（涉及真理、知识、现实、伦理等思想的研究或思考方式）。"},"examples":[{"en":"Philosophically, the question is about what it means to be free.","zh":"从哲学角度看，这个问题关乎“自由”到底意味着什么。"},{"en":"They approached the topic philosophically rather than emotionally.","zh":"他们以更哲学的方式而不是情绪化的方式来讨论这个话题。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a calm, wise, and accepting way, especially toward difficult events; with philosophical acceptance.","zh":"（尤指面对困难）以冷静、通达、能接受的态度；以“看开了”的方式。"},"examples":[{"en":"She took the bad news philosophically and focused on what she could control.","zh":"她很淡定地接受了坏消息，把注意力放在自己能掌控的事情上。"},{"en":"Try to respond philosophically when things don’t go your way.","zh":"当事情不如意时，尽量以更豁达的态度来回应。"}]}],"synonyms":["from a philosophical perspective","in philosophical terms","theoretically","stoically","calmly","with acceptance"],"phonetic":"/ˌfɪləˈsɑfɪkli/","extraExplanation":["“philosophically”常见两种用法：一是“从哲学角度”，强调讨论更抽象、更原则性的层面；二是“很看得开/很淡定”，强调面对挫折时的冷静与接受。语境不同，语气也会不同。","近义表达（按语境）：从哲学角度可用 “in philosophical terms / from a philosophical perspective”；表示“看开了”可用 “stoically / with acceptance / calmly”。其中“stoically”更强调忍耐与克制，语气更硬一些。"]}
{"word":"philosophies","summary":{"en":"“Philosophies” is the plural of “philosophy”: it can mean the academic subject of philosophy, or different belief systems and guiding principles.","zh":"“philosophies”是“philosophy”的复数：既可指“哲学”这门学科，也可指不同的信念体系与处世/工作理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of fundamental questions about reality, knowledge, values, reason, and existence (often as an academic subject)","zh":"哲学；研究现实、知识、价值、理性与存在等根本问题的学科"},"examples":[{"en":"She is majoring in philosophy at university.","zh":"她在大学主修哲学。"},{"en":"Ancient Greek philosophy still influences modern thought.","zh":"古希腊哲学仍然影响着现代思想。"}]},{"partOfSpeech":"n.","definition":{"en":"a set of beliefs, principles, or guiding ideas about how to live, work, or make decisions","zh":"（个人/团体的）人生观；处世原则；理念；指导思想"},"examples":[{"en":"His philosophy is to treat everyone with respect.","zh":"他的人生理念是尊重每一个人。"},{"en":"The company’s philosophy focuses on customer trust.","zh":"这家公司的理念强调顾客信任。"},{"en":"Different teaching philosophies can lead to different classroom styles.","zh":"不同的教学理念会带来不同的课堂风格。"}]}],"synonyms":["belief systems","principles","worldviews","schools of thought","ideologies"],"phonetic":"/fəˈlɑsəfi/","extraExplanation":["“philosophies”是“philosophy”的复数：\n- 指不同的“哲学流派/哲学体系”时：Eastern and Western philosophies（东西方哲学）。\n- 指不同人的“理念/处世原则”时：Their philosophies of parenting differ（他们的育儿理念不同）。"]}
{"word":"philosophy","summary":{"en":"Philosophy means (1) the academic study of fundamental questions about reality, knowledge, and ethics, and (2) a guiding set of beliefs or principles for living or working.","zh":"philosophy 可指（1）研究现实、知识与伦理等根本问题的“哲学”学科；也可指（2）指导生活或工作的“理念/原则”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of big questions about life, knowledge, truth, right and wrong, and reality; also the academic subject that explores these ideas","zh":"哲学；研究人生、知识、真理、善恶与现实等重大问题的学问；也指高校中的“哲学”学科"},"examples":[{"en":"She studies philosophy at university and enjoys discussing what makes an action morally right.","zh":"她在大学读哲学，喜欢讨论什么样的行为在道德上是正确的。"},{"en":"Ancient Greek philosophy influenced Western ideas about reason and democracy.","zh":"古希腊哲学影响了西方关于理性与民主的思想。"}]},{"partOfSpeech":"n.","definition":{"en":"a person’s or group’s guiding beliefs and principles about how to live, work, or make decisions","zh":"（个人或团体的）人生观；处世原则；做事理念"},"examples":[{"en":"Our company’s philosophy is to treat customers with honesty and respect.","zh":"我们公司的理念是以诚实与尊重对待顾客。"},{"en":"His philosophy is to focus on what he can control and let go of the rest.","zh":"他的处世原则是专注于自己能控制的事，其余的就放下。"}]}],"synonyms":["thought","belief system","worldview","principles","ideology"],"phonetic":"/fəˈlɑːsəfi/","extraExplanation":["词源上，philosophy 来自希腊语 philosophia，意为“热爱智慧”（philo- = love，-sophia = wisdom）。因此它不仅是“学术学科”，也常被用来指一个人做事背后的“理念/原则”。","常见搭配：moral philosophy（道德哲学）、political philosophy（政治哲学）、philosophy of science（科学哲学）、a philosophy of life（人生哲学）。"]}
{"word":"phlegmatic","summary":{"en":"Phlegmatic describes someone who stays calm and shows little emotion, sometimes suggesting a steady but low-energy temperament.","zh":"Phlegmatic 指一个人沉着冷静、不易激动；有时也暗示性格稳定但略显“慢热”或不够有激情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Calm and not easily upset; showing little emotion, even in stressful situations.","zh":"冷静沉着的；不容易激动的；（在压力下）情绪起伏不大的。"},"examples":[{"en":"She stayed phlegmatic during the crisis and focused on solutions.","zh":"危机中她依然沉着冷静，把注意力放在解决办法上。"},{"en":"His phlegmatic response made the argument end quickly.","zh":"他冷静克制的回应让争吵很快就结束了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a slow, steady temperament; not very energetic or excitable.","zh":"性情迟缓稳重的；不太有激情或不易兴奋的。"},"examples":[{"en":"He’s a phlegmatic person who prefers quiet routines.","zh":"他是个性情稳重的人，更喜欢安静规律的生活。"},{"en":"The coach wanted more intensity from the team’s phlegmatic captain.","zh":"教练希望球队那位沉稳得有些“慢热”的队长更有激情。"}]}],"synonyms":["calm","even-tempered","unflappable","composed","cool-headed","stoic"],"phonetic":"/flɛɡˈmætɪk/","extraExplanation":["“phlegmatic”源自古希腊/古罗马的“四体液说”（humors）：认为人体的“痰”（phlegm）与性格有关，痰多的人被认为更冷静、迟缓。现代英语里它主要就是“沉着冷静/不易激动”的意思，医学上的“痰”含义不再相关。","语气提示：它通常是中性到略带评价色彩的词——可以夸人稳重，也可能暗示“太冷淡、缺乏热情”。可按语境选择更中性的词如 “calm / even-tempered / unflappable”。"]}
{"word":"phlet","summary":{"en":"“phlet” isn’t a word by itself; you likely mean “pamphlet.”","zh":"“phlet”不是独立单词；你可能想表达的是“pamphlet（小册子/宣传册）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standalone English word; usually seen as the ending part of the word “pamphlet” (a small booklet or leaflet).","zh":"不是一个独立的英文单词；通常是单词“pamphlet”（小册子/宣传册）的词尾部分。"},"examples":[{"en":"I think you meant “pamphlet,” not “phlet.”","zh":"你可能想写的是“pamphlet”，而不是“phlet”。"},{"en":"She picked up a pamphlet about the museum’s history.","zh":"她拿起了一本介绍博物馆历史的小册子。"}]}],"synonyms":["booklet","leaflet","brochure"],"phonetic":"ˈpæmflət","extraExplanation":["“phlet”本身在英语里不作为独立词使用；它更像是你在输入“pamphlet”时漏掉了前面的部分。常见拼写是 p-a-m-p-h-l-e-t，中间的 “ph” 发 /f/ 音，因此容易拼错。"]}
{"word":"phobia","summary":{"en":"A phobia is an intense, persistent fear of something specific; it can also mean strong dislike or hostility in words like “xenophobia.”","zh":"phobia 指对特定事物的强烈、持续的恐惧；在如 xenophobia 等词中也可指强烈厌恶或敌意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, lasting fear of a specific object, situation, or activity, often irrational and hard to control","zh":"对某个特定事物、情境或活动的强烈且持续的恐惧，往往不太理性且难以控制"},"examples":[{"en":"She has a phobia of flying, so she travels by train whenever possible.","zh":"她有恐飞症，所以只要可能就坐火车出行。"},{"en":"His phobia of dogs started after he was bitten as a child.","zh":"他对狗的恐惧症始于童年时被狗咬过之后。"},{"en":"For some people, a phobia can cause panic symptoms like sweating or a racing heart.","zh":"对一些人来说，恐惧症会引发出汗、心跳加速等惊恐症状。"}]},{"partOfSpeech":"n.","definition":{"en":"strong dislike or hatred of a particular group or thing (often used in compounds, and may carry social or political sensitivity)","zh":"对某个群体或事物的强烈厌恶或憎恨（常用于复合词中，可能涉及社会/政治敏感性）"},"examples":[{"en":"The campaign spoke out against xenophobia.","zh":"该活动公开反对排外仇外。"},{"en":"Using “-phobia” to label people can be serious; it’s better to discuss specific behaviors and harm.","zh":"用“-phobia”给人贴标签可能很严肃；更好的方式是讨论具体行为及其造成的伤害。"}]}],"synonyms":["fear","irrational fear","dread","aversion"],"phonetic":"/ˈfoʊbiə/","extraExplanation":["词源：来自希腊语 phobos，意为“恐惧”。因此很多“某种恐惧”会用“X + -phobia”构词，如 arachnophobia（恐蛛）、claustrophobia（幽闭恐惧）、acrophobia（恐高）。","用法提示：在心理健康语境中，phobia 通常指可影响生活的强烈恐惧；而在 xenophobia、homophobia 等词中，更多指偏见或敌意。后者在交流中常带价值判断，使用时注意语境与尊重。"]}
{"word":"phobias","summary":{"en":"“Phobias” means strong, irrational fears (plural) that often cause avoidance.","zh":"“phobias”是“phobia”的复数，指强烈且不理性的恐惧，常导致回避。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense, persistent, and irrational fear of a specific object, situation, or activity that often leads to avoidance.","zh":"对某个特定事物、情境或活动产生强烈、持续且不理性的恐惧，常常会导致回避。"},"examples":[{"en":"She has a phobia of flying, so she takes trains instead.","zh":"她有飞行恐惧症，所以改坐火车。"},{"en":"His phobia makes him avoid elevators even in tall buildings.","zh":"他的恐惧症让他即使在高楼里也会回避坐电梯。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural form) Multiple specific irrational fears; different types of phobia conditions.","zh":"（复数）多种不同的特定恐惧；不同类型的恐惧症。"},"examples":[{"en":"Common phobias include fear of heights and fear of spiders.","zh":"常见的恐惧症包括恐高和怕蜘蛛。"},{"en":"The book explains how phobias can develop after a stressful experience.","zh":"这本书解释了恐惧症如何在压力性经历后形成。"}]}],"synonyms":["irrational fears","fear disorders","anxieties"],"phonetic":"/ˈfoʊbiəz/","extraExplanation":["“phobia”来自希腊语“phobos”（恐惧）。英语里很多“某某恐惧症”用“-phobia”构词：例如 arachnophobia（恐蛛症）、claustrophobia（幽闭恐惧症）。","日常口语中人们有时会把“不喜欢/讨厌”夸张地说成“phobia”（如“I have a phobia about meetings.”），但在心理健康语境里它更接近临床意义：强烈恐惧、难以控制，并影响生活。"]}
{"word":"Phoenician","summary":{"en":"Phoenician means a person from ancient Phoenicia, or something related to Phoenicia and its culture/language.","zh":"Phoenician 指“腓尼基人”，或“腓尼基的（与其文化/语言等有关）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Phoenicia, an ancient region on the eastern coast of the Mediterranean (roughly modern Lebanon and parts of Syria and Israel)","zh":"腓尼基人；来自腓尼基（地中海东岸的古代地区，约相当于今黎巴嫩及叙利亚、以色列部分地区）的人"},"examples":[{"en":"The Phoenicians were famous sailors and traders across the Mediterranean.","zh":"腓尼基人以在地中海航海和经商闻名。"},{"en":"Many historians link the spread of the alphabet to Phoenician influence.","zh":"许多历史学家认为字母文字的传播与腓尼基人的影响有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Phoenicia or its people, language, or culture","zh":"腓尼基的；与腓尼基（其人民、语言或文化）有关的"},"examples":[{"en":"Archaeologists found Phoenician inscriptions on the stone.","zh":"考古学家在石头上发现了腓尼基文字的铭文。"},{"en":"Phoenician cities such as Tyre and Sidon were major ports in the ancient world.","zh":"泰尔和西顿等腓尼基城市是古代世界的重要港口。"}]}],"synonyms":["Carthaginian (related, not identical)","Semitic (broader language-family term)"],"phonetic":"/fəˈnɪʃən/","extraExplanation":["“Phoenician”常见于历史、考古与语言学语境。腓尼基人以海上贸易、殖民活动（如迦太基 Carthage）以及对字母系统的发展与传播的影响而被广泛提及。","读到“Phoenician alphabet（腓尼基字母）”时，通常指一种早期的辅音字母系统，常被认为对后来的希腊字母、拉丁字母等产生了重要影响。"]}
{"word":"phoenix","summary":{"en":"A phoenix is a mythical bird that rises from its ashes; it also means a comeback after disaster, and it’s the name of a major U.S. city (Phoenix, Arizona).","zh":"phoenix 指神话中从灰烬重生的鸟；也可比喻灾难后重新崛起；同时也是美国城市名（亚利桑那州首府菲尼克斯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mythology) A legendary bird that is reborn from its own ashes, often seen as a symbol of rebirth and renewal.","zh":"（神话）凤凰：一种传说中的鸟，会在火中焚毁后从自己的灰烬中重生，常象征重生与新生。"},"examples":[{"en":"In the story, the phoenix burns and rises again from the ashes.","zh":"在故事里，凤凰焚毁后又从灰烬中再次升起。"},{"en":"After a painful failure, she felt like a phoenix starting a new life.","zh":"经历一次痛苦的失败后，她觉得自己像凤凰一样开始新的人生。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or thing that becomes strong again after great difficulty or destruction.","zh":"（比喻）涅槃重生的人/团体/事物：在巨大困难或毁灭后重新变得强大。"},"examples":[{"en":"The company returned like a phoenix after bankruptcy.","zh":"那家公司破产后又像凤凰一样重新崛起。"},{"en":"The neighborhood became a phoenix after the storm, rebuilt and lively.","zh":"暴风雨过后，这个社区重建起来，重现生机，仿佛凤凰重生。"}]},{"partOfSpeech":"n.","definition":{"en":"Phoenix: the capital city of Arizona in the United States.","zh":"菲尼克斯：美国亚利桑那州的首府。"},"examples":[{"en":"They moved to Phoenix for the warm weather.","zh":"他们为了温暖的天气搬到了菲尼克斯。"},{"en":"Phoenix is known for its hot summers.","zh":"菲尼克斯以炎热的夏季而闻名。"}]}],"synonyms":["rebirth (figurative)","comeback (figurative)","resurgence (figurative)"],"phonetic":"/ˈfiːnɪks/","extraExplanation":["“phoenix”常用作象征意象，表达“从失败中站起来”“浴火重生”。在英语里常见搭配有：rise like a phoenix（像凤凰一样崛起）。","注意文化差异：英语里的 phoenix 主要来自希腊神话；中文“凤凰”在传统文化中也很重要，但不完全等同（例如常与祥瑞、皇后等象征相关）。","文学与流行文化中常出现凤凰意象（如诗歌、奇幻作品），用来强调希望、重生与不屈。"]}
{"word":"phon","summary":{"en":"Phon is a loudness unit that reflects how loud a sound seems to human hearing.","zh":"Phon 是表示“人耳感知响度”的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit used to measure loudness level, based on how loud a sound is perceived by the human ear (equal to the decibel level of a 1,000 Hz tone that sounds equally loud).","zh":"响度单位（phon）：用于衡量人耳“感知到的响度”，定义为与一个听起来同样响的 1000 Hz 纯音的分贝值相同。"},"examples":[{"en":"The loudness of this noise is about 60 phons.","zh":"这段噪声的响度大约是 60 phon。"},{"en":"Two sounds can have the same decibels but different loudness in phons.","zh":"两个声音的分贝值可能相同，但以 phon 表示的响度却不同。"}]}],"synonyms":["(related) loudness level","(related) perceived loudness"],"phonetic":"/fɑn/","extraExplanation":["在声学里，dB（分贝）更偏向“物理强度”的量化，而 phon 更强调“人耳听起来有多响”（主观响度）。因此不同频率的声音，即使 dB 一样，听感也可能不一样，phon 就是用来把这种听感差异纳入比较。","phon 这个词也常出现在一些派生术语中，例如 equal-loudness contour（等响曲线），用来表示在不同频率下，为了“听起来一样响”所需要的声压级。"]}
{"word":"phone","summary":{"en":"“Phone” usually means a telephone (often a mobile phone) or the act of calling someone.","zh":"phone 通常指“电话/手机”，也可作动词表示“打电话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device you use to talk to people over long distances (especially a mobile phone/smartphone today)","zh":"电话；（尤指如今的）手机/智能手机，用于远距离通话"},"examples":[{"en":"I left my phone at home, so I couldn’t call you.","zh":"我把手机落在家里了，所以没法给你打电话。"},{"en":"My phone battery is low—can I borrow a charger?","zh":"我手机快没电了——我能借个充电器吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a telephone in a specific place, or a line/number you can call","zh":"（某处的）电话；电话线/电话号码"},"examples":[{"en":"There’s a phone in the lobby.","zh":"大堂里有一部电话。"},{"en":"Call me at this phone number when you arrive.","zh":"你到了以后打这个电话号码联系我。"}]},{"partOfSpeech":"v.","definition":{"en":"to call someone using a telephone","zh":"打电话；致电"},"examples":[{"en":"I’ll phone you tonight.","zh":"我今晚给你打电话。"},{"en":"Please phone the clinic to make an appointment.","zh":"请打电话给诊所预约。"}]}],"synonyms":["telephone","cell phone","mobile phone","smartphone","call","ring (BrE)"],"phonetic":"/foʊn/","extraExplanation":["“phone”是“telephone”的口语缩写；在英式英语中，动词也常说“phone”，美式英语里也很常见，但“call”更通用。","现代语境里“phone”常默认指“mobile phone/ cell phone（手机）”。若想更明确，可说“my cell phone / my mobile / my smartphone”。","发音提示：开头的 /f/ 像中文“夫”的气流音；中间 /oʊ/ 类似“欧”的拖长；结尾 /n/ 舌尖抵上齿龈。"]}
{"word":"phonebook","summary":{"en":"A phonebook is a directory of phone numbers (and often names/addresses), now mostly replaced by online search and contacts.","zh":"phonebook 指电话簿/电话黄页，用来查询电话号码（常含姓名、地址），现在多被手机通讯录和网络搜索取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printed or digital directory listing people’s or businesses’ names, addresses, and telephone numbers.","zh":"电话簿；电话黄页（纸质或电子的通讯录，列出个人或商家的姓名、地址和电话号码）。"},"examples":[{"en":"I found the plumber’s number in the phonebook.","zh":"我在电话簿里找到了水管工的电话。"},{"en":"Before smartphones, many families kept a phonebook by the landline.","zh":"在智能手机普及之前，很多家庭会在座机旁放一本电话簿。"}]},{"partOfSpeech":"n.","definition":{"en":"A large collection of names, numbers, or contacts (used figuratively).","zh":"（比喻）一大堆姓名或联系方式；厚厚的一本名单。"},"examples":[{"en":"He has a phonebook of contacts in this industry.","zh":"他在这个行业里有一大堆人脉联系方式。"},{"en":"The appendix is a phonebook of references.","zh":"这份附录里参考资料多得像电话簿一样。"}]}],"synonyms":["telephone directory","directory","contacts list"],"phonetic":"/ˈfoʊnˌbʊk/","extraExplanation":["在美国文化里，传统电话簿常分为两部分：White Pages（白页，主要列个人住址与电话）和Yellow Pages（黄页，按行业分类的商家广告与联系方式）。如今很多地区已逐渐停印，转为线上目录。"]}
{"word":"phoned","summary":{"en":"“Phoned” means “called by telephone” (the past tense/participle of “phone”).","zh":"“phoned”表示“（过去）打电话”，是“phone”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “phone”: to call someone using a telephone or mobile phone.","zh":"“phone”的过去式和过去分词：用电话或手机给某人打电话。"},"examples":[{"en":"I phoned my mom after work.","zh":"下班后我给妈妈打了电话。"},{"en":"She phoned to say she would be late.","zh":"她打电话来说她会迟到。"},{"en":"Have you phoned the doctor yet?","zh":"你已经给医生打过电话了吗？"}]}],"synonyms":["called","rang (BrE)","telephoned"],"phonetic":"/foʊnd/","extraExplanation":["在英式英语里，人们很常用动词 phone（phoned / phoning）表示“打电话”，而美式英语中也常用 call / called，更口语、更普遍。","phone 既可作不及物（phone to say… “打电话来说……”），也可作及物（phone someone “给某人打电话”）。"]}
{"word":"phoneme","summary":{"en":"A phoneme is the smallest sound unit in a language that can distinguish meaning.","zh":"音位是语言中能够区分词义的最小语音单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A basic sound unit in a language that can change meaning when it is replaced by another sound (for example, /p/ vs /b/ in “pat” vs “bat”).","zh":"（语言学）音位：一种语言中能区别词义的基本语音单位（例如“pat”和“bat”里的 /p/ 与 /b/）。"},"examples":[{"en":"In English, /t/ and /d/ are different phonemes because they can change meaning, as in “two” and “do.”","zh":"在英语中，/t/ 和 /d/ 是不同的音位，因为它们能改变词义，比如 “two” 和 “do”。"},{"en":"Learners often struggle with new phonemes that don’t exist in their first language.","zh":"学习者常常会为母语中不存在的新音位而感到困难。"},{"en":"A common way to test phonemes is to look for minimal pairs like “ship” and “sheep.”","zh":"检验音位的常见方法是找“最小对立体”，比如 “ship” 和 “sheep”。"}]}],"synonyms":["distinctive sound unit","speech sound unit"],"phonetic":"/ˈfoʊniːm/","extraExplanation":["“音位（phoneme）”强调的是“区别意义的功能”，不是具体发音的每个细节。具体说出来的真实语音常被称为“音（phone）”，而同一音位在不同环境下的变体叫“音位变体（allophone）”。例如英语 /t/ 在 “top” 里常带送气，[tʰ]；在 “stop” 里送气较弱，[t]，很多分析里仍算同一音位 /t/。","“最小对立体（minimal pair）”是判断两个音是否属于不同音位的经典方法：如果只换一个音，词义就变了（如 ship/sheep），通常说明它们是不同音位。"]}
{"word":"phones","summary":{"en":"“Phones” most commonly means multiple phones; it can also mean “calls” (as in “he phones”).","zh":"“phones”最常见意思是“多部电话/手机”；也可表示“打电话”（如 he phones）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “phone”: telephones or mobile phones; devices used for calling, texting, or using apps.","zh":"“phone”的复数：电话/手机；用于打电话、发短信或使用应用的设备。"},"examples":[{"en":"All the students put their phones away before the test.","zh":"考试前所有学生都把手机收起来了。"},{"en":"We use our phones to check maps when we travel.","zh":"旅行时我们用手机查看地图。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of the verb “phone”: to call someone by telephone.","zh":"动词“phone”的第三人称单数：给某人打电话。"},"examples":[{"en":"He phones his parents every Sunday.","zh":"他每个星期天都给父母打电话。"},{"en":"She phones the doctor if she feels worse.","zh":"如果她感觉更糟，就会给医生打电话。"}]}],"synonyms":["telephones","cell phones","mobiles","smartphones","call","ring"],"phonetic":"/foʊnz/","extraExplanation":["“phones”既可以表示名词复数（很多部手机/电话），也可以表示动词第三人称单数（he/she/it phones）。判断方法：看它前面是不是数量词或复数主语（many phones），以及它后面有没有宾语（phones his mom）。","在美式英语里，“phone”既可指传统电话也常指智能手机；更明确时可说“cell phone / mobile phone / smartphone”。"]}
{"word":"phonetic","summary":{"en":"Please tell me which word or phrase you want the phonetic (IPA) for.","zh":"请告诉我你想查询哪个单词或短语的音标（IPA）。"},"extraExplanation":["你想查哪个单词或短语的音标（phonetic/IPA）？请把词发给我（例如：“schedule” 或 “take off”）。我会给你一个美式 IPA，并附上中英释义和例句。"]}
{"word":"phonetician","summary":{"en":"A phonetician is someone who studies and describes speech sounds (phonetics).","zh":"phonetician 指研究并描述人类语音的语音学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies speech sounds (phonetics), including how they are produced and how they are written using phonetic symbols.","zh":"语音学家；研究语音（语音如何发出、如何用音标记录）的人。"},"examples":[{"en":"A phonetician can describe exactly how the /t/ sound is made in English.","zh":"语音学家可以准确描述英语中 /t/ 这个音是如何发出来的。"},{"en":"The phonetician used the International Phonetic Alphabet (IPA) to transcribe the recording.","zh":"语音学家用国际音标（IPA）把录音转写出来。"}]}],"synonyms":["phonetist","speech scientist"],"phonetic":"/fəˈnɛtɪʃən/","extraExplanation":["“phonetician”来自“phonetics（语音学）”。语音学关注的是“声音本身”，而不是“意义”。","不要和“phonologist（音系学家）”混淆：phonology（音系学）更关注某种语言里“哪些音是有区别意义的”，以及这些音如何在系统中运作。"]}
{"word":"phonetics","summary":{"en":"Phonetics is the study of speech sounds and how we produce and perceive them.","zh":"Phonetics 指“语音学”，研究语音及其发音与感知方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of speech sounds (how they are produced, heard, and written in sound symbols)","zh":"语音学：研究语音（声音如何发出、被听见，以及如何用音标记录）的学科"},"examples":[{"en":"In phonetics class, we learned how to pronounce /θ/ in “think.”","zh":"在语音学课上，我们学习了如何发 /θ/（如 think 里的 th）。"},{"en":"Phonetics helps learners hear the difference between similar sounds.","zh":"语音学能帮助学习者听出相近发音之间的差别。"}]}],"synonyms":["phonetic science","speech-sound study"],"phonetic":"/fəˈnɛtɪks/","extraExplanation":["phonetics（语音学）常与 phonology（音系学）一起出现：语音学更关注“实际发音与声音细节”，音系学更关注“某种语言里哪些声音区别会改变词义”。","学习发音时常用 IPA（International Phonetic Alphabet，国际音标）来精确记录读音；例如美式英语里 cat 常标为 /kæt/。"]}
{"word":"phonic","summary":{"en":"Phonic means “related to speech sounds or sound,” and it can also mean “related to phonics (teaching reading through letter-sound links).”","zh":"Phonic表示“与语音/声音有关”，也可表示“与自然拼读法有关（用字母与读音对应来教阅读）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to speech sounds (phonetics) or to sound in general.","zh":"（与）语音/语音学有关的；或泛指与声音有关的。"},"examples":[{"en":"The teacher gave us a phonics lesson using phonetic symbols.","zh":"老师用音标给我们上了一节语音课。"},{"en":"In a phonetic transcription, each symbol represents a sound.","zh":"在语音转写中，每个符号代表一个音。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to phonics: a method of teaching reading by linking letters with their sounds.","zh":"（与）自然拼读法有关的：通过字母与读音对应来教阅读的方法。"},"examples":[{"en":"This book uses a phonics-based approach for beginners.","zh":"这本书用自然拼读法来帮助初学者学习。"},{"en":"Phonic practice can help children sound out new words.","zh":"自然拼读练习能帮助孩子拼读新单词。"}]}],"synonyms":["phonetic","sound-related","phonics-based"],"phonetic":"/ˈfɑnɪk/","extraExplanation":["“phonic”常见于语言学习与语音学语境；日常更常用的相关词有“phonetic（语音的/音标的）”和“phonics（自然拼读法）”。","词根“phon-”来自希腊语，意思是“声音”。常见派生词：telephone（电话）、microphone（麦克风）、symphony（交响乐）。"]}
{"word":"phonics","summary":{"en":"Phonics is a way to learn reading and spelling by connecting letters with sounds.","zh":"Phonics 指通过建立字母与发音的对应关系来学习阅读和拼写的自然拼读法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of teaching reading and spelling by showing the relationship between letters and the sounds they represent.","zh":"自然拼读法；一种通过学习字母（或字母组合）与其对应发音关系来教授阅读与拼写的方法。"},"examples":[{"en":"My teacher uses phonics to help us sound out new words.","zh":"老师用自然拼读法帮助我们把生词读出来。"},{"en":"Phonics lessons often start with simple letter sounds like /m/ and /s/.","zh":"自然拼读课常从 /m/、/s/ 这类简单的字母发音开始。"}]}],"synonyms":["phonics instruction","decoding (in reading)"],"phonetic":"/ˈfɑnɪks/","extraExplanation":["“Phonics”通常在英美小学阅读教学中非常常见，强调“拼读”（decode）：看到字母或字母组合→读出声音→合起来形成单词。例如：c-a-t → cat。","它常与“phonetics（语音学/音标）”被混淆：phonics更偏向阅读教学方法；phonetics是研究语音的学科，也常指用IPA音标标注发音。","相关常见搭配：phonics instruction（自然拼读教学）、phonics rules（拼读规则）、sound out（拼读/把词读出来）。"]}
{"word":"phoning","summary":{"en":"“Phoning” means making a phone call or the action of calling someone by phone.","zh":"“phoning”表示“打电话”，可指打电话这件事，也可指“正在打电话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of calling someone using a telephone (or a phone app); making a phone call","zh":"打电话；电话联络（用电话或手机应用联系他人）"},"examples":[{"en":"Phoning is not allowed during the exam.","zh":"考试期间不允许打电话。"},{"en":"He spent the afternoon phoning customers to confirm appointments.","zh":"他整个下午都在给客户打电话确认预约。"}]},{"partOfSpeech":"v.","definition":{"en":"calling someone by phone (present participle of “phone”)","zh":"正在打电话（“phone”的现在分词）"},"examples":[{"en":"I’m phoning to ask about your opening hours.","zh":"我打电话是想问一下你们的营业时间。"},{"en":"She’s phoning her mom right now.","zh":"她现在正在给妈妈打电话。"},{"en":"Stop phoning me after midnight.","zh":"别在半夜之后给我打电话了。"}]}],"synonyms":["calling","ringing","telephoning"],"phonetic":"/ˈfoʊnɪŋ/","extraExplanation":["“phone”在美式英语里非常常用，可以作名词（a phone）也可作动词（to phone）。口语中也常说“call（打电话）”，更通用：用电话、语音通话、甚至某些网络通话都可以说“call”。","常见搭配：phone/call someone；phone/call (someone) back（回电）；phone in（打电话报告/请假）；on the phone（在打电话/通话中）。"]}
{"word":"phonograph","summary":{"en":"A phonograph is an early sound-recording and playback machine, or a (historical/formal) term for a record player.","zh":"phonograph 指早期的录音与回放设备（留声机），也可作较偏历史/正式的“唱机”之称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that records sound and plays it back, especially an early record player that uses a needle on a disc or cylinder","zh":"留声机；（尤指早期的）录放音装置，常用唱针在唱片或蜡筒上读取声音"},"examples":[{"en":"My grandfather still has a phonograph that plays old jazz records.","zh":"我爷爷家里还留着一台留声机，可以播放老爵士唱片。"},{"en":"The museum displayed a phonograph from the early 1900s.","zh":"博物馆展出了一台20世纪初的留声机。"}]}],"synonyms":["record player","turntable","gramophone (BrE)"],"phonetic":"/ˈfoʊnəˌɡræf/","extraExplanation":["“phonograph”由希腊语词根组成：phono-（声音）+ -graph（书写/记录）。它常与爱迪生（Thomas Edison）联系在一起：他在1877年前后改进并推广了早期的录音与回放技术。","在现代英语里，“phonograph”较偏历史或正式语境；日常更常说“record player / turntable（唱机）”。在美式英语中，“phonograph record”也可指“黑胶唱片”，但如今多用“vinyl record”。"]}
{"word":"phonological","summary":{"en":"“Phonological” means “about the sound system of a language (phonology).”","zh":"“phonological”表示“与一门语言的音系/语音系统有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to phonology—the sound system of a language (how speech sounds are organized and used to create meaning).","zh":"与音系学有关的；指一种语言的“语音系统”（语音如何被组织并用来区分意义）。"},"examples":[{"en":"English has phonological rules about which sounds can appear together, like /str/ in “street.”","zh":"英语有音系规则，规定哪些音可以组合出现，例如“street”里的 /str/。"},{"en":"The teacher explained a phonological difference between British and American English pronunciation.","zh":"老师解释了英式英语和美式英语发音上的一种音系差异。"},{"en":"Children may make phonological errors when they are learning to speak.","zh":"儿童在学习说话时可能会出现音系错误。"}]}],"synonyms":["phonologic","phonemic","sound-system (related)"],"phonetic":"/ˌfoʊnəˈlɑdʒɪkəl/","extraExplanation":["“phonological（音系的）”常与“phonetic（语音的/语音学的）”对比：phonetic 更偏向声音的实际发音细节（如舌位、气流、音长），phonological 更偏向语言系统层面的“功能与规律”（哪些差异会造成词义不同、哪些变化是规则性的）。","常见搭配：phonological rules（音系规则）、phonological process（音系过程，常见于儿童语言发展与言语治疗）、phonological awareness（音系意识，如押韵、分辨音素 /p/ vs /b/）。","一个典型概念是 minimal pairs（最小对立体）：只差一个音但意义不同，如 “ship” vs “sheep”，这体现的是音系层面的对立。"]}
{"word":"phonology","summary":{"en":"Phonology is the study of sound patterns and sound rules in a language.","zh":"Phonology 指研究语言中语音模式与语音规则的学科（音系学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of how sounds work in a language, including patterns (like stress and rhythm) and rules for how sounds change in different contexts.","zh":"音系学；研究一种语言中的语音如何运作，包括音的规律（如重音、节奏）以及语音在不同环境中变化的规则。"},"examples":[{"en":"In phonology, English /p/ is aspirated in “pin” but not in “spin.”","zh":"在音系学里，英语的 /p/ 在“pin”中会送气，但在“spin”中通常不送气。"},{"en":"She is writing a paper on the phonology of Mandarin tones.","zh":"她正在写一篇关于普通话声调音系的论文。"}]}],"synonyms":["phonemics","sound system (of a language)","phonological study"],"phonetic":"/fəˈnɑlədʒi/","extraExplanation":["“phonology”常与“phonetics（语音学）”一起出现：语音学更关注声音的物理特征与发音方式（你怎么发、声波是什么样），音系学更关注语言系统中的“规则与对比”（哪些声音在这门语言里能区分意思、哪些变化是规律性的）。","音系学里常见概念包括“phoneme（音位）”“allophone（音位变体）”“stress（重音）”“syllable（音节）”。比如英语 /t/ 在不同位置可读成不同音，但仍被当作同一个音位 /t/。"]}
{"word":"phony","summary":{"en":"Phony means “fake” or “not genuine,” and it can also refer to a fake person or thing.","zh":"Phony 表示“假的、不真诚的”，也可指“冒牌的人或物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not real; fake or pretending to be something it is not","zh":"假的；冒充的；伪装的"},"examples":[{"en":"That website looks phony—don’t enter your credit card number.","zh":"那个网站看起来很假——别输入你的信用卡号码。"},{"en":"He gave a phony excuse for being late.","zh":"他给了一个虚假的迟到借口。"},{"en":"She sounded friendly, but her smile felt phony.","zh":"她听起来很友好，但她的笑容让人觉得很假。"}]},{"partOfSpeech":"n.","definition":{"en":"a fake person or thing; someone who pretends to be sincere or skilled","zh":"冒牌货；骗子；（装真诚或装内行的）虚伪的人"},"examples":[{"en":"Be careful—he’s a phony who lies to get money.","zh":"小心点——他是个骗子，会靠撒谎骗钱。"},{"en":"The painting turned out to be a phony.","zh":"那幅画最后被证明是赝品。"}]}],"synonyms":["fake","false","fraudulent","bogus","sham","counterfeit","insincere","pretend"],"phonetic":"/ˈfoʊni/","extraExplanation":["“phony”在美式英语中很常见；英式英语也常写作“phoney”。","词源上常被认为与19世纪美国俚语“fawney”（指一种用来行骗的假戒指）有关，所以它带有“骗局/冒牌”的语感。","在文化语境里，“phony”常用来批评一个人“不真诚、装出来”，比如文学作品中对“虚伪的社会面具”的批判（如《麦田里的守望者》中就频繁出现相关表达）。"]}
{"word":"phoros","summary":{"en":"Phoros is an ancient Greek word meaning a tribute/tax paid by one city-state to another, especially payments to Athens in the Delian League.","zh":"Phoros 是古希腊语，指城邦向另一城邦缴纳的贡赋或税，尤指提洛同盟成员向雅典缴纳的贡赋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) a tribute or tax paid by one city-state to another, especially the money contributed by member states to Athens in the Delian League.","zh":"（古希腊）进贡金；贡赋；一种城邦向另一城邦缴纳的税或贡金，尤指提洛同盟成员城邦向雅典缴纳的贡赋。"},"examples":[{"en":"Many Delian League members paid phoros to Athens each year.","zh":"许多提洛同盟成员城邦每年向雅典缴纳phoros（贡赋）。"},{"en":"Historians study the phoros lists to understand Athenian imperial finances.","zh":"历史学家研究“phoros名册”来了解雅典帝国的财政状况。"}]}],"synonyms":["tribute","tax","levy","assessment"],"phonetic":"/ˈfɔrɑs/","extraExplanation":["“phoros”（φόρος）是古希腊语词，核心含义是“被带来/被缴纳的东西”，常指向强势城邦缴纳的贡赋或税。","在历史语境里，它最常与提洛同盟（Delian League）相关：同盟早期是共同抗波斯的联盟，但后来雅典逐渐把成员的“phoros”变成了带有强制性的财政控制。","你可能会在修昔底德（Thucydides）的相关叙述、以及学术著作中看到“phoros lists（贡赋名册）”这一说法，用来指记录各城邦缴纳金额的石刻/档案资料。"]}
{"word":"phorus","summary":{"en":"Phosphorus is a chemical element (P) essential for life and widely used in fertilizers and industry.","zh":"磷（P）是一种生命必需的化学元素，常用于化肥和工业领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol P) that is essential for life and is used in fertilizers, matches, and some industrial products","zh":"磷（化学元素，符号 P）：生命所必需的元素之一，也常用于化肥、火柴及一些工业产品"},"examples":[{"en":"Phosphorus is important for strong bones and teeth.","zh":"磷对强健的骨骼和牙齿很重要。"},{"en":"Farmers add phosphorus to the soil to help crops grow.","zh":"农民会给土壤补充磷来帮助作物生长。"},{"en":"The label says this fertilizer contains nitrogen, phosphorus, and potassium.","zh":"标签上写这种化肥含有氮、磷和钾。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance that glows in the dark or can cause a faint light because of a chemical reaction (older or specialized use)","zh":"（较旧或较专业的用法）指会发光的物质，或因化学反应产生微弱光的物质"},"examples":[{"en":"Early scientists studied phosphorus because it could glow under certain conditions.","zh":"早期科学家研究磷，是因为它在某些条件下会发光。"}]}],"synonyms":["P (symbol)","phosphate (related form)"],"phonetic":"/ˈfɑːsfərəs/","extraExplanation":["你输入的 **phorus** 通常是 **phosphorus** 的拼写错误（中间要有 **-phos-**）。","词源提示：**phosphorus** 源自希腊语，意思接近“带来光的人/光之载体”，因此和“发光”这一特性有关。"]}
{"word":"Phos","summary":{"en":"“Phos” is most often an informal abbreviation for phosphorus/phosphate; more rarely, it relates to a Greek root meaning “light.”","zh":"“Phos”最常见是 phosphorus/phosphate（磷/磷酸盐）的非正式缩写；更少见时与表示“光”的希腊语词根有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “phosphorus” or “phosphate,” especially in science/medical contexts (e.g., lab results).","zh":"（非正式）“phosphorus（磷）”或“phosphate（磷酸盐）”的简称，常见于科研或医疗语境（如化验单）。"},"examples":[{"en":"The doctor said my phos level was a little low.","zh":"医生说我的 phos（磷/磷酸盐）指标有点低。"},{"en":"Check calcium and phos together in the blood test.","zh":"验血时把钙和 phos（磷/磷酸盐）一起看。"}]},{"partOfSpeech":"other","definition":{"en":"A Greek root meaning “light,” seen in some scientific words (less common in everyday English on its own).","zh":"表示“光”的希腊语词根，在一些科学词汇中可见（单独使用在日常英语中较少）。"},"examples":[{"en":"In older scientific writing, you may see phos used to refer to “light.”","zh":"在较早的科学写作里，你可能会看到 phos 用来指“光”。"},{"en":"Words related to light often come from Greek roots like phos.","zh":"与“光”有关的词常来自像 phos 这样的希腊语词根。"}]}],"synonyms":["phosphorus","phosphate"],"phonetic":"/fɑs/","extraExplanation":["在英文里你更常见的是 photo-（如 photograph, photosynthesis）表示“光”。phos 也来自希腊语“光”，但单独写成 phos 多见于专业/缩写语境，尤其是医学化验里指“磷/磷酸盐”。","如果你是在医院化验单或营养/肾脏相关讨论中看到 phos，通常就是 phosphate（磷酸盐）；在化学课本里则可能指 phosphorus（磷）。具体含义要看上下文。"]}
{"word":"phos","summary":{"en":"“phos” is an informal abbreviation, most often meaning phosphorus, and sometimes phosphate(s) in water testing.","zh":"“phos”是非正式缩写，最常指 phosphorus（磷），有时在水质检测中指 phosphate(s)（磷酸盐）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, especially in science) Short for “phosphorus,” a chemical element (symbol P).","zh":"（非正式，尤用于科学语境）“phosphorus（磷）”的缩写，化学元素，符号为 P。"},"examples":[{"en":"The sample was high in phos, so the lab recommended further testing.","zh":"样品里的 phos 含量偏高，所以实验室建议做进一步检测。"},{"en":"Add phos carefully—too much can affect the reaction.","zh":"添加 phos 要小心——太多会影响反应。"}]},{"partOfSpeech":"other","definition":{"en":"(water/pool maintenance) Short for “phosphate(s),” nutrients in water that can encourage algae growth.","zh":"（水质/泳池维护）“phosphate(s)（磷酸盐）”的简写，水中的营养盐，可能促进藻类生长。"},"examples":[{"en":"We need to lower the phos level to help prevent algae.","zh":"我们需要降低 phos（磷酸盐）水平来帮助预防长藻。"},{"en":"The test kit shows elevated phos in the pond.","zh":"测试盒显示池塘里的 phos（磷酸盐）偏高。"}]}],"synonyms":["phosphorus (full form)","phosphate(s) (full form)"],"phonetic":"/fɑs/","extraExplanation":["“phos”本身不是常见的标准英语单词，更常见于笔记、实验记录、论坛或工作对话中的缩写。正式写作里通常写全称 phosphorus（磷）或 phosphate(s)（磷酸盐）。","你也可能在词根里看到 phos-/photo-，来自希腊语表示“光”（如 phosphorescent“磷光的”、photograph“照片”），但这与缩写“phos”不是同一个用法。"]}
{"word":"phosphate","summary":{"en":"Phosphate usually means a compound containing the phosphate group (PO₄³⁻), important in biology and widely used in fertilizers; it can also mean treating something with phosphate.","zh":"Phosphate通常指含磷酸根（PO₄³⁻）的化合物/盐，既是生物体重要成分也常用于化肥；也可作动词表示用磷酸盐处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or salt that contains the phosphate group (PO₄³⁻); common in fertilizers, detergents, and living cells (DNA, ATP, bones).","zh":"含有磷酸根（PO₄³⁻）的化合物或盐；常见于化肥、清洁剂以及生物体内（如DNA、ATP、骨骼）。"},"examples":[{"en":"Farmers add phosphate to the soil to help crops grow.","zh":"农民会往土壤里添加磷酸盐来帮助作物生长。"},{"en":"Too much phosphate in lakes can cause algae blooms.","zh":"湖泊中磷酸盐过多会引发藻华。"},{"en":"Phosphate is essential for building strong bones and teeth.","zh":"磷酸盐对形成强健的骨骼和牙齿很重要。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat or combine (something) with phosphate, often for industrial or chemical purposes.","zh":"用磷酸盐处理或使（某物）与磷酸盐结合，常用于工业或化学用途。"},"examples":[{"en":"The metal parts are phosphate-coated to reduce rust.","zh":"这些金属零件经过磷酸盐涂层处理以减少生锈。"},{"en":"Some manufacturers phosphate the surface before painting.","zh":"有些厂家在上漆前会对表面进行磷酸盐处理。"}]}],"synonyms":["phosphate salt","orthophosphate"],"phonetic":"/ˈfɑsˌfeɪt/","extraExplanation":["“phosphate”常和“phosphorus（磷元素）”“phosphoric acid（磷酸）”一起出现：phosphorus是元素；phosphoric acid是酸（H₃PO₄）；phosphate通常指磷酸根或含磷酸根的盐/化合物。","环境语境里，phosphate常与“eutrophication（富营养化）”相关：生活污水、农业径流带入的磷会促进藻类快速繁殖，影响水质与生态。"]}
{"word":"phosphorous","summary":{"en":"Phosphorous usually means “related to or containing phosphorus,” and is less commonly used to mean “glowing faintly.”","zh":"phosphorous 通常指“与磷有关/含磷的”，较少用来表示“微微发光的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phosphorus (a chemical element), or containing phosphorus.","zh":"与磷（化学元素）有关的；含磷的。"},"examples":[{"en":"Farmers sometimes use phosphorous compounds in fertilizers to help plants grow.","zh":"农民有时会在肥料中使用含磷化合物来帮助植物生长。"},{"en":"The lab tested the soil for phosphorous levels.","zh":"实验室检测了土壤中的磷含量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Giving off a faint glow; phosphorescent.","zh":"（较少用）发出微光的；磷光的。"},"examples":[{"en":"In older writing, some authors described the sea at night as phosphorous.","zh":"在较早的文字中，有些作者会把夜晚的海面描述为“发出微光的”。"}]}],"synonyms":["phosphoric","phosphorus-related","phosphorescent (for the ‘glowing’ sense)"],"phonetic":"/ˈfɑsfərəs/","extraExplanation":["注意拼写：英语里更常见的是 **phosphorus**（名词，“磷”这种元素；也用于“磷含量”），而 **phosphorous** 通常是形容词，表示“与磷有关/含磷的”。在日常和科普语境中，人们经常把它们混用，但写正式英文（尤其是理工、医学、环境领域）时最好区分。"]}
{"word":"Phosphorus","summary":{"en":"Phosphorus is the element P, essential for living things and widely used in fertilizers; some forms can glow or burn easily.","zh":"Phosphorus 指元素“磷”（P），对生命必需并常用于化肥；某些形态还会发光或易燃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol P) that is essential for life and commonly found in bones, DNA, and fertilizers","zh":"磷（一种化学元素，符号 P），对生命必不可少，常见于骨骼、DNA 和化肥中"},"examples":[{"en":"Phosphorus is important for strong bones and teeth.","zh":"磷对强健的骨骼和牙齿很重要。"},{"en":"Farmers add phosphorus to soil to help plants grow.","zh":"农民会给土壤补充磷来帮助植物生长。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance that can glow or burn easily, especially in forms like white phosphorus","zh":"一种会发光或容易燃烧的物质（尤指白磷等形态）"},"examples":[{"en":"White phosphorus can catch fire when exposed to air.","zh":"白磷接触空气时可能会自燃。"},{"en":"Some safety matches use phosphorus compounds in the striking surface.","zh":"一些安全火柴在擦火面中使用含磷化合物。"}]}],"synonyms":["P","the element phosphorus"],"phonetic":"/ˈfɑsfərəs/","extraExplanation":["“phosphorus”来自希腊语，意思大致是“带来光的人/物”，因为某些含磷物质在氧化时会发出微光（这种现象叫“磷光/发光”）。","磷在自然界多以“磷酸盐”的形式存在；日常营养学里常说的“phosphorus（磷）”通常指食物中的磷元素或磷酸盐，而不是会燃烧的白磷。"]}
{"word":"phosphorus","summary":{"en":"Phosphorus is the element P, important in biology and commonly used in fertilizers; the word is often associated with “light” because some forms glow.","zh":"Phosphorus 指元素“磷”（P），对生命很重要，常见于化肥等；因某些形态会发光，词也常与“光”联系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol P) that is essential for life and is used in fertilizers, matches, and some industrial products; it can glow in the dark in certain forms","zh":"磷（元素符号P）：一种对生命必需的化学元素，常用于化肥、火柴及部分工业制品；某些形态下可在黑暗中发光"},"examples":[{"en":"Plants need phosphorus to grow, so farmers often add it to soil as fertilizer.","zh":"植物生长需要磷，所以农民常把它以肥料形式加入土壤。"},{"en":"The label says the fertilizer contains nitrogen, phosphorus, and potassium.","zh":"标签上写着这种肥料含有氮、磷和钾。"},{"en":"In chemistry class, we learned that some forms of phosphorus can glow faintly in the dark.","zh":"在化学课上，我们学到某些形态的磷会在黑暗中微微发光。"}]}],"synonyms":["P (chemical symbol)","element phosphorus"],"phonetic":"/ˈfɑːsfərəs/","extraExplanation":["英语里 phosphorus 的词源与希腊语有关，含义接近“带来光的东西”（phōs=光，phoros=携带）。这也解释了它常被拿来和“发光”联系在一起。","日常语境中要注意区分：phosphorus 是元素“磷”；phosphate 是“磷酸盐/磷酸根”（常见于肥料、食品配料表、环保话题如水体富营养化）。"]}
{"word":"PhosphorusP","summary":{"en":"Phosphorus (P) is a chemical element essential for life and widely used in fertilizers and industry; in nutrition it refers to dietary phosphorus (often as phosphate).","zh":"磷（P）是一种生命必需的化学元素，广泛用于化肥和工业；在营养学中也指膳食中的磷（多以磷酸盐形式存在）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol P) that is essential for life and is used in matches, fertilizers, and many industrial products","zh":"磷（化学元素，符号P）；生命必需元素之一，常用于火柴、化肥和多种工业产品"},"examples":[{"en":"Phosphorus is an essential mineral for healthy bones and teeth.","zh":"磷是维持骨骼和牙齿健康的必需矿物质。"},{"en":"Farmers often add phosphorus to soil through fertilizer to help plants grow.","zh":"农民常通过施肥给土壤补充磷，帮助植物生长。"},{"en":"The chemical symbol for phosphorus is P.","zh":"磷的化学符号是P。"}]},{"partOfSpeech":"n.","definition":{"en":"(in nutrition) a nutrient in foods, usually in the form of phosphate, important for energy use in the body","zh":"（营养学）食物中的一种营养素（常以磷酸盐形式存在），对人体能量利用很重要"},"examples":[{"en":"Milk, fish, and beans are good sources of phosphorus.","zh":"牛奶、鱼类和豆类都是磷的良好来源。"},{"en":"Some processed foods contain added phosphorus.","zh":"一些加工食品中含有添加的磷。"}]}],"synonyms":["P (symbol)","the element phosphorus","phosphorus (dietary mineral)"],"phonetic":"ˈfɑsfərəs","extraExplanation":["“Phosphorus”来自希腊语，意思接近“带来光的人/发光者”，因为早期发现的白磷会在空气中缓慢发光。","日常英语里更常说“phosphorus”（磷）而不是“phosphorus P”。“P”通常只在化学公式、元素周期表或配料/化肥标识中出现（如 N-P-K）。","注意：白磷有毒且易燃；生活中更多接触到的是“phosphate（磷酸盐）”，常见于食品、清洁剂和肥料中。"]}
{"word":"phot","summary":{"en":"“Phot” is an informal short form of “photo/photograph,” and “phot-” is a word part meaning “light.”","zh":"“phot”常作“photo/photograph”的非正式缩写；“phot-”是表示“光”的构词成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) a shortened form of “photo” or “photograph,” sometimes used in notes, captions, or older publishing contexts.","zh":"（非正式）“photo / photograph”的缩写形式，有时用于笔记、图片说明或较早的出版语境中。"},"examples":[{"en":"Send me a phot of the receipt, please.","zh":"请把收据的照片（phot）发我一张。"},{"en":"The editor asked for a clearer phot for the article.","zh":"编辑要求为这篇文章换一张更清晰的照片（phot）。"}]},{"partOfSpeech":"other","definition":{"en":"(In words) a combining form meaning “light,” as in photography, photon, and photometer.","zh":"（构词成分）表示“光”，如 photography（摄影）、photon（光子）、photometer（光度计）。"},"examples":[{"en":"“Phot-” appears in many science words related to light.","zh":"“phot-”常出现在许多与“光”相关的科学词汇中。"},{"en":"Photography literally means “writing with light.”","zh":"photography 字面意思是“用光书写/记录”。"}]}],"synonyms":["photo","photograph","pic (informal)"],"phonetic":"/foʊt/","extraExplanation":["“phot-”来自希腊语 phōs / phōt-，意为“光”。因此很多以 phot- 开头的词都与光、成像或测光有关。","单独写“phot”在现代英语里不算标准拼写；更常见的是 photo / photograph。若用于正式写作，建议使用 photo 或 photograph。"]}
{"word":"photo","summary":{"en":"“Photo” most commonly means a picture taken with a camera, and it can also be used as a verb meaning “to photograph.”","zh":"“photo”最常指“照片”，也可作动词表示“拍照/拍摄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A picture made with a camera; a photograph.","zh":"用相机拍摄形成的图片；照片。"},"examples":[{"en":"Can you take a photo of us?","zh":"你能给我们拍张照片吗？"},{"en":"She keeps a photo of her family on her desk.","zh":"她在桌上放着一张家人的照片。"}]},{"partOfSpeech":"v.","definition":{"en":"To take a photograph of someone or something.","zh":"给某人或某物拍照；拍摄。"},"examples":[{"en":"Reporters photoed the actor outside the hotel.","zh":"记者在酒店外拍到了那位演员。"}]}],"synonyms":["photograph","picture","snapshot","image"],"phonetic":"/ˈfoʊtoʊ/","extraExplanation":["“photo”是“photograph”的常用口语缩写，更日常、更简洁；正式写作里常用“photograph”。","在网络语境中，photo既可以指实体照片，也常指手机里的数字图片（例如：a photo on my phone）。","“photo-”作为词根常与“光”有关（如 photography 摄影、photosynthesis 光合作用）。"]}
{"word":"photobiology","summary":{"en":"Photobiology is the branch of biology that studies the effects of light on living things.","zh":"光生物学是研究光对生物体影响的生物学分支。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The scientific study of how light affects living organisms, including processes like photosynthesis, vision, circadian rhythms, and skin responses to sunlight.","zh":"光生物学：研究光如何影响生物体的科学，包括光合作用、视觉、生物钟节律以及皮肤对阳光的反应等过程。"},"examples":[{"en":"Photobiology helps explain how plants convert sunlight into energy through photosynthesis.","zh":"光生物学有助于解释植物如何通过光合作用把阳光转化为能量。"},{"en":"Researchers in photobiology study how blue light from screens can affect sleep cycles.","zh":"光生物学研究人员会研究屏幕发出的蓝光如何影响睡眠周期。"}]}],"synonyms":["light biology","biology of light (in organisms)"],"phonetic":"/ˌfoʊtoʊbaɪˈɑːlədʒi/","extraExplanation":["词源提示：photo- 表示“光”（来自希腊语 phōs/phōt-），biology 表示“生物学”。合起来就是“研究光与生命的关系”。","常见相关领域：植物学（光合作用）、医学/皮肤科（紫外线与皮肤）、神经科学与眼科学（视觉）、时间生物学（昼夜节律）。","相关词汇：photobiological（形容词：光生物学的）；phototherapy（光疗）；photosensitivity（光敏性）。"]}
{"word":"photobomb","summary":{"en":"“Photobomb” means to unexpectedly appear in someone else’s photo (often humorously), or the person/thing that does this.","zh":"“Photobomb”指未经邀请突然闯入别人照片（常为搞笑抢镜），也可指抢镜的人或画面。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to suddenly appear in someone else’s photo (often in a funny or attention-seeking way) without being invited, usually in the background","zh":"（常指在背景中）未经邀请突然闯入别人拍照画面，往往是搞笑或抢镜的方式"},"examples":[{"en":"My brother photobombed our family picture by making a silly face behind us.","zh":"我弟弟在我们身后做鬼脸，抢镜闯入了我们的全家福。"},{"en":"Someone photobombed the tourist’s selfie right at the last second.","zh":"就在最后一秒，有人闯入游客的自拍抢镜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or moment that appears in someone else’s photo unexpectedly, especially in a funny or distracting way","zh":"（照片中的）抢镜者；闯入镜头的瞬间（尤指搞笑或干扰注意力的）"},"examples":[{"en":"The best part of the photo is the photobomb in the background.","zh":"这张照片最好笑的部分是背景里的抢镜。"},{"en":"That dog is a perfect photobomb.","zh":"那只狗简直是完美抢镜。"}]}],"synonyms":["crash the photo","pop into the shot","steal the spotlight"],"phonetic":"/ˈfoʊtoʊbɑːm/","extraExplanation":["“Photobomb”由 photo（照片）+ bomb（像“爆炸”一样突然闯入、制造冲击）组合而来，语气通常偏幽默、口语化，常见于社交媒体语境。","在日常表达里也常说“photobombing”（动名词）或“photobombed”（过去式）。例如：We got photobombed.（我们被抢镜了。）"]}
{"word":"photochemical","summary":{"en":"Photochemical describes chemical changes or processes that are triggered or driven by light.","zh":"photochemical 指“由光引发或驱动的化学变化/过程”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to chemical reactions or processes that are caused by light, especially sunlight or ultraviolet (UV) light.","zh":"与光化学有关的；由光（尤指阳光或紫外线）引发的化学反应或过程的。"},"examples":[{"en":"Photochemical reactions in the atmosphere can create smog on sunny days.","zh":"大气中的光化学反应会在晴天形成烟雾（光化学烟雾）。"},{"en":"Plants use photochemical processes to start converting light into chemical energy.","zh":"植物利用光化学过程把光能开始转化为化学能。"}]},{"partOfSpeech":"adj.","definition":{"en":"Produced by or involving the use of light to drive a chemical change.","zh":"由光促成/产生的；利用光来推动化学变化的。"},"examples":[{"en":"The lab used a photochemical method to make the compound.","zh":"实验室用一种光化学方法制备该化合物。"},{"en":"Photochemical decomposition can break a substance down when it absorbs UV light.","zh":"当物质吸收紫外线时，光化学分解可能会将其分解。"}]}],"synonyms":["light-induced","photoinduced","light-driven"],"phonetic":"/ˌfoʊtoʊˈkɛmɪkəl/","extraExplanation":["词源小提示：photo- 表示“光”，chemical 表示“化学的”。合起来就是“与光引发的化学变化有关”。","常见搭配：photochemical smog（光化学烟雾）、photochemical reaction（光化学反应）、photochemical process（光化学过程）。","与近义表达的区别：photochemical 强调“光触发或驱动化学反应”；而 photovoltaic（光伏的）专指把光直接转成电。"]}
{"word":"photocopier","summary":{"en":"A photocopier is a machine used to make paper copies of documents; more rarely, it can mean a business/person that provides photocopying services.","zh":"photocopier 指“复印机”；较少见时也可指“提供复印服务的人或机构”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine that makes paper copies of documents and images, usually by using light and toner (a copy machine).","zh":"复印机（用光和碳粉等把文件、图片复制到纸上的机器；也叫“复印机/复印设备”）。"},"examples":[{"en":"The teacher used the photocopier to make 30 copies of the worksheet.","zh":"老师用复印机把练习题复印了30份。"},{"en":"Our office photocopier is out of toner, so we can’t print or copy anything.","zh":"我们办公室的复印机没碳粉了，所以没法打印或复印。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or company that makes photocopies as a service (less common).","zh":"提供复印服务的人或公司（较少见，用法更偏正式/行业）。"},"examples":[{"en":"The law firm sent the files to an outside photocopier for copying and binding.","zh":"律师事务所把文件交给外部的复印服务商去复印并装订。"}]}],"synonyms":["copy machine","copier"],"phonetic":"/ˈfoʊtəˌkɑːpiər/","extraExplanation":["在日常英语里，photocopier 和 copy machine 基本同义；美式口语更常说 copy machine。动词通常用 photocopy（复印）或 make copies（复印几份）。","常见相关词：toner（碳粉）、paper jam（卡纸）、collate（逐份配齐）、duplex / double-sided（双面）、single-sided（单面）。"]}
{"word":"photocopies","summary":{"en":"“Photocopies” most commonly means paper copies made by a photocopier; it can also be the verb form meaning “makes photocopies.”","zh":"“photocopies”通常指用复印机做出的纸质复印件；也可作动词形式，表示“复印”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Copies of a document or picture made using a photocopier (a machine that makes copies on paper).","zh":"用复印机把文件或图片复制到纸上的复印件。"},"examples":[{"en":"Could you make three photocopies of this form?","zh":"你能把这张表格复印三份吗？"},{"en":"The teacher handed out photocopies of the reading.","zh":"老师发了阅读材料的复印件。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a paper copy of a document or picture using a photocopier.","zh":"用复印机复印（文件或图片）。"},"examples":[{"en":"I’ll photocopy your ID and give it back right away.","zh":"我会复印一下你的身份证，然后马上还给你。"},{"en":"Please photocopy these pages for the meeting.","zh":"请把这些页面复印出来给会议用。"}]}],"synonyms":["copies","duplicates","xeroxes"],"phonetic":"/ˈfoʊtoʊˌkɑpiz/","extraExplanation":["“photocopies” 既可以是名词复数（很多张复印件），也可以是动词第三人称单数（He/She photocopies…）。","在口语中，人们也常说 “copies” 或 “printouts”。但 “photocopy” 更强调“用复印机直接复印”，而不是从电脑打印出来。"]}
{"word":"photocopy","summary":{"en":"“Photocopy” means to make a copy with a photocopier, or the copy itself.","zh":"“photocopy”指用复印机复印，也可指复印件本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a copy of a document or picture using a photocopier","zh":"用复印机复印（文件或图片）"},"examples":[{"en":"Could you photocopy these forms for me?","zh":"你能帮我把这些表格复印一下吗？"},{"en":"She photocopied her passport before the trip.","zh":"她旅行前把护照复印了一份。"}]},{"partOfSpeech":"n.","definition":{"en":"a copy made using a photocopier","zh":"复印件"},"examples":[{"en":"Please bring a photocopy of your ID.","zh":"请带一份身份证复印件。"},{"en":"He handed me a photocopy of the contract.","zh":"他递给我一份合同复印件。"}]}],"synonyms":["copy","duplicate","reproduce","xerox"],"phonetic":"/ˈfoʊtoʊˌkɑpi/","extraExplanation":["“photocopy”由 photo-（与“光/照片”相关）+ copy（复制）组成，字面意思是“用光来复制”，指传统复印机通过光学成像把纸上的内容复制到另一张纸上。","日常使用中，美式英语里“copy”也常直接表示“复印”：Make a copy of this.（把这个复印一下。）在更正式或更明确的语境里才常说“photocopy”。"]}
{"word":"photodissociation","summary":{"en":"A scientific term for a molecule breaking apart after it absorbs light.","zh":"指分子吸收光后发生断裂分解的科学术语（光致解离/光解）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/Physics) The breaking of a chemical bond in a molecule caused by absorbing light (a photon), producing smaller fragments such as atoms, radicals, or ions.","zh":"（化学/物理）分子吸收光（光子）后导致化学键断裂的过程，生成更小的碎片，如原子、自由基或离子。"},"examples":[{"en":"Photodissociation of ozone helps explain how ozone levels change in the upper atmosphere.","zh":"臭氧的光解作用有助于解释高层大气中臭氧浓度如何变化。"},{"en":"In the lab, researchers used UV light to trigger photodissociation of the compound.","zh":"在实验室里，研究人员用紫外光触发该化合物的光解反应。"}]}],"synonyms":["photolysis","photo-induced dissociation","photodecomposition"],"phonetic":"/ˌfoʊtoʊdɪˌsoʊsiˈeɪʃən/","extraExplanation":["词源拆解：photo-（光）+ dissociation（解离/分离）。所以它直观意思就是“由光引起的解离”。","常见语境：大气化学（如臭氧O₃在紫外线下分解）、天体物理与星际介质（分子在强辐射场中被“光解”）、以及光化学反应机理研究。","与相近词区分：photodissociation 强调“吸收光导致键断裂”；photolysis（光解）更口语/更广，可指光引发的分解反应；dissociation 单独使用时不一定由光引起。"]}
{"word":"Photoelectric","summary":{"en":"Photoelectric describes electricity or electron release caused by light (and things that use this effect).","zh":"Photoelectric 指由光引起的电现象（或利用这种现象的装置），如光电效应、光电传感器等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physics) relating to electricity produced by light, or to the release of electrons when light hits a material.","zh":"（物理）与“光生电”有关的；指光产生电流，或光照射材料时引发电子逸出（光电效应）的。"},"examples":[{"en":"Photoelectric sensors can detect when an object blocks a beam of light.","zh":"光电传感器可以在物体遮挡光束时进行检测。"},{"en":"The photoelectric effect helped scientists understand the particle nature of light.","zh":"光电效应帮助科学家理解了光的粒子性。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or system that uses the photoelectric effect (often in the phrase “photoelectric cell”).","zh":"利用光电效应的装置或系统（常见于短语“photoelectric cell”，光电管/光电池）。"},"examples":[{"en":"The door uses a photoelectric to open automatically when someone approaches.","zh":"这扇门使用光电装置，在有人靠近时自动打开。"}]}],"synonyms":["light-activated","photovoltaic (related but not identical)","optical sensor (contextual)"],"phonetic":"/ˌfoʊtoʊɪˈlɛktrɪk/","extraExplanation":["“photo-”表示“光”，“-electric”表示“电的”。因此 photoelectric 字面意思是“光引起的电”。在科学史上，“光电效应”与爱因斯坦的研究密切相关，是现代物理的重要概念之一。","常见搭配：photoelectric effect（光电效应）、photoelectric sensor（光电传感器）、photoelectric cell（光电管/光电池）。"]}
{"word":"photoelectric","summary":{"en":"Photoelectric means “caused by light producing electricity,” and it also names devices that use this effect (often in the phrases photoelectric sensor/cell).","zh":"photoelectric 指“由光产生电的、光电的”，也可指利用这种效应的装置（常见搭配如光电传感器/光电管）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the production of electricity or electric current when light shines on a material (the photoelectric effect).","zh":"与“光照到材料上会产生电或电流”有关的；光电的（光电效应）。"},"examples":[{"en":"Photoelectric sensors can detect when a person walks through a doorway.","zh":"光电传感器可以检测到有人走过门口。"},{"en":"Einstein explained the photoelectric effect using the idea of light as particles.","zh":"爱因斯坦用“光像粒子”的观点解释了光电效应。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or system that uses the photoelectric effect (for example, a photoelectric cell or photoelectric sensor).","zh":"利用光电效应的装置或系统（如光电管、光电传感器）。"},"examples":[{"en":"The automatic lights are controlled by a photoelectric that senses daylight.","zh":"自动照明由一个感应日光的光电装置控制。"}]}],"synonyms":["photovoltaic","light-sensitive","optoelectronic"],"phonetic":"/ˌfoʊtoʊɪˈlɛktrɪk/","extraExplanation":["“photo-”表示“光”，来自希腊语 *phōs/phōt-*（光）；“electric”来自与琥珀摩擦起电有关的词源。合起来强调“光引起的电现象”。","在科学与工程语境里更常见的搭配是：photoelectric effect（光电效应）、photoelectric cell（光电池/光电管）、photoelectric sensor（光电传感器）、photoelectric conversion（光电转换）。日常对话中通常不会单独说 *a photoelectric*，更常用 *a photoelectric sensor/cell*。"]}
{"word":"photoelectrically","summary":{"en":"“Photoelectrically” means “by using the photoelectric effect or a photoelectric device (light-to-electric detection).”","zh":"“photoelectrically”意为“以光电方式（利用光电效应或光电器件把光转换为电信号）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses the photoelectric effect (light causing electrons to move), especially to produce an electric signal or to measure light.","zh":"以光电方式；利用光电效应（光使电子运动）来产生电信号或测量光。"},"examples":[{"en":"The sensor detects motion photoelectrically by measuring changes in light.","zh":"这个传感器以光电方式测量光的变化来检测运动。"},{"en":"The intensity of the beam was recorded photoelectrically.","zh":"光束的强度以光电方式被记录下来。"}]},{"partOfSpeech":"adv.","definition":{"en":"Using a photoelectric device (such as a photodiode or photocell) rather than by mechanical or visual methods.","zh":"通过光电器件（如光电二极管或光电管）实现，而非用机械方式或肉眼观察。"},"examples":[{"en":"The door opens photoelectrically when someone approaches.","zh":"当有人靠近时，门会以光电方式自动打开。"},{"en":"The experiment timed the events photoelectrically for greater accuracy.","zh":"该实验用光电方式计时事件以提高精度。"}]}],"synonyms":["by photoelectric means","with a photoelectric sensor","optically (in some contexts)"],"phonetic":"/ˌfoʊtoʊɪˈlɛktrɪkli/","extraExplanation":["“photoelectrically”来自“photo-（光）+ electric（电）+ -ally（副词后缀）”。它常见于科学论文、工程说明书、实验报告中，比日常口语更正式。","相关词：photoelectric（adj. 光电的）；photoelectric effect（光电效应，爱因斯坦因解释该现象而获诺贝尔奖）；photocell/photodiode（光电管/光电二极管）。在文学作品中较少出现，更多出现在科普与学术写作里。"]}
{"word":"photoelectricity","summary":{"en":"Photoelectricity means electricity or electron flow produced when light hits a material.","zh":"photoelectricity 指“光照引起的电现象/电荷（电子）释放或电流产生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The production or release of electric charge (usually electrons) when light shines on a material; this is the general phenomenon behind devices like solar cells and light sensors.","zh":"当光照射到材料上时产生或释放电荷（通常是电子）的现象；这是太阳能电池和光传感器等设备的基础。"},"examples":[{"en":"Photoelectricity is the basic principle behind photovoltaic solar panels.","zh":"光电效应（光电现象）是光伏太阳能电池板的基本原理。"},{"en":"Scientists study photoelectricity to understand how light can cause electrons to move.","zh":"科学家研究光电现象，以理解光如何使电子运动。"}]}],"synonyms":["photoelectric effect","photovoltaic effect"],"phonetic":"/ˌfoʊtoʊɪˌlɛkˈtrɪsɪti/","extraExplanation":["“photoelectricity”常与“photoelectric effect（光电效应）”一起出现：严格来说，photoelectric effect更常指“光照导致电子从材料表面逸出”的经典实验现象（与爱因斯坦的解释相关）；而photoelectricity更偏向“光引发电现象”的总称，也可涵盖光伏效应（在材料内部产生电压/电流）。","词根提示：photo- 表示“光”，electricity 表示“电”。因此它字面意思就是“由光引起的电”。","常见相关词：photovoltaic（光伏的）、photoelectric sensor（光电传感器）、work function（逸出功，常在光电效应语境中出现）。"]}
{"word":"photoelectrode","summary":{"en":"A photoelectrode is a light-activated electrode used to convert light into electrical or chemical energy.","zh":"photoelectrode 指“受光激发的电极”，用于把光能转化为电能或驱动化学反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An electrode that absorbs light and turns it into an electrical effect (such as generating current or changing voltage), often used in devices like solar cells or photoelectrochemical cells.","zh":"光电极：一种能吸收光并将其转化为电效应（如产生电流或引起电压变化）的电极，常用于太阳能电池或光电化学电池等装置。"},"examples":[{"en":"In a dye-sensitized solar cell, the photoelectrode collects electrons after the dye absorbs sunlight.","zh":"在染料敏化太阳能电池中，染料吸收阳光后，光电极负责收集电子。"},{"en":"Researchers improved the photoelectrode to make hydrogen production more efficient under visible light.","zh":"研究人员改进了光电极，使其在可见光下的制氢效率更高。"}]}],"synonyms":["photocathode","photoanode","light-activated electrode"],"phonetic":"/ˌfoʊtoʊɪˈlɛktroʊd/","extraExplanation":["构词理解：photo- 表示“光”，electrode 表示“电极”，合起来就是“与光有关的电极”。","常见搭配：photoelectrode material（光电极材料），photoelectrode surface（光电极表面），photoelectrode reaction（光电极反应）。","语境提示：该词多见于材料科学、化学、能源与太阳能研究论文中；日常英语里更常说 solar cell electrode（太阳能电池电极）或 photocathode / photoanode（光阴极/光阳极，按极性区分）。"]}
{"word":"photogenic","summary":{"en":"Photogenic means looking good in photos, or being a place/scene that photographs well.","zh":"Photogenic 指“上镜/出片”：人在照片里好看，或景物很容易拍出好看的照片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Looking attractive in photographs; having features that are captured well by a camera.","zh":"（上镜）在照片里很好看；适合被镜头呈现得很美。"},"examples":[{"en":"She’s very photogenic—every picture of her looks natural and bright.","zh":"她很上镜——每张照片都看起来自然又有精神。"},{"en":"That café is photogenic, so people love taking photos there.","zh":"那家咖啡馆很“出片”，所以大家都爱在那里拍照。"}]},{"partOfSpeech":"adj.","definition":{"en":"Likely to produce good-looking or striking photographs (used for places, objects, scenes, etc.).","zh":"（景物/物品等）很“好拍”，容易拍出好看的、吸引人的照片。"},"examples":[{"en":"The mountains are especially photogenic at sunrise.","zh":"群山在日出时特别好拍，照片效果很好。"},{"en":"Choose a photogenic spot with good light for your profile picture.","zh":"拍头像时选一个光线好的、很出片的位置。"}]}],"synonyms":["camera-friendly","good-looking in photos","picturesque"],"phonetic":"/ˌfoʊtəˈdʒɛnɪk/","extraExplanation":["“photogenic”由 photo（照片）+ -genic（产生/引起……的）构成，字面意思是“能产生好照片的”。日常口语里常和“good lighting（好光线）”“angles（角度）”一起出现：Someone can be photogenic even if they don’t think they look good in the mirror.","近义表达：“camera-friendly（镜头友好）”“picturesque（如画般的，常形容风景）”。注意区别：photogenic 更强调“拍出来好看”，picturesque 更强调“本身像画一样美”。"]}
{"word":"photograph","summary":{"en":"Photograph means a camera-made picture, or the act of taking such a picture.","zh":"photograph 既可指“照片”，也可指“拍照/拍摄”的动作（较正式，口语常用 photo）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a picture made using a camera","zh":"照片；相片（用相机拍摄的图像）"},"examples":[{"en":"I took a photograph of the sunset.","zh":"我拍了一张日落的照片。"},{"en":"This old photograph shows my grandparents when they were young.","zh":"这张老照片里是我祖父母年轻时的样子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take a picture of someone or something with a camera","zh":"给……拍照；拍摄（用相机把人或物拍下来）"},"examples":[{"en":"Tourists photographed the famous bridge.","zh":"游客们拍摄了那座著名的桥。"},{"en":"Please don’t photograph people without asking.","zh":"请不要不经同意就拍别人。"}]}],"synonyms":["photo","picture","snapshot"],"phonetic":"/ˈfoʊtəˌɡræf/","extraExplanation":["词性小提示：名词重音通常在第一个音节（PHO-to-graph），动词重音常在第二个音节（pho-TO-graph）。这是英语里常见的“名词/动词重音变化”现象（如 record / reCORD）。","文化语境：在一些场合（学校、医院、宗教场所、涉及儿童或私人空间），拍照可能有隐私或礼仪限制。英语里常用的礼貌问法是：“May I take a photograph?” 或 “Is it okay if I take a photo?”","用法区分：日常口语更常说 photo；photograph 更正式或更强调“摄影作品/照片本身”。"]}
{"word":"photographed","summary":{"en":"“Photographed” means “took a photo” or “was captured in a photo,” and it can also mean “looked a certain way in photos” (e.g., “photographed well”).","zh":"“photographed”表示“拍了照/被拍到”，也可表示“上镜效果如何”（如“photographed well”意为“很上镜”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “photograph”; to take a picture of someone or something with a camera.","zh":"“photograph”的过去式和过去分词；用相机给某人或某物拍照。"},"examples":[{"en":"She photographed the sunset from the beach.","zh":"她在海滩上拍下了日落。"},{"en":"The reporter photographed the event for the newspaper.","zh":"记者为报纸拍摄了这场活动。"},{"en":"He was photographed leaving the building.","zh":"他被拍到离开那栋楼。"}]},{"partOfSpeech":"v.","definition":{"en":"To look good (or bad) in a photograph; often used with “well.”","zh":"（在照片里）显得好看或不好看；常与“well”（上镜）搭配。"},"examples":[{"en":"That dress photographed well in natural light.","zh":"那条裙子在自然光下很上镜。"},{"en":"Bright red can photograph strongly, so keep the makeup simple.","zh":"亮红色在镜头里会很显眼，所以妆容可以清淡些。"}]}],"synonyms":["shot","snapped","captured","pictured"],"phonetic":"/ˈfoʊtəˌɡræft/","extraExplanation":["“be photographed + doing”常用来表示“被拍到正在做某事”，语气偏新闻/社媒语境（例如：He was photographed entering the hotel.）。","“photograph well”指“上镜”，强调照片效果而不是现实中是否好看；也可说“not photograph well”（不太上镜）。"]}
{"word":"photographer","summary":{"en":"A photographer is someone who takes photos, often professionally.","zh":"photographer 指拍照的人，常指以摄影为职业的“摄影师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes photographs, especially as a job or serious hobby.","zh":"摄影师；拍照的人（尤指以此为职业或认真爱好的人）。"},"examples":[{"en":"She is a wedding photographer who travels on weekends.","zh":"她是一名婚礼摄影师，周末会外出拍摄。"},{"en":"The photographer waited for the perfect light at sunset.","zh":"摄影师等到日落时分最完美的光线。"},{"en":"A good photographer notices small details other people miss.","zh":"好的摄影师能注意到别人忽略的小细节。"}]}],"synonyms":["cameraperson","photojournalist (for news)","portrait photographer (specific type)"],"phonetic":"/fəˈtɑːɡrəfər/","extraExplanation":["词根上看，photo- 来自希腊语，意思是“光”，-grapher 与“写/记录”有关，所以 photographer 字面含义接近“用光记录的人”。","常见搭配：professional photographer（职业摄影师）、portrait photographer（人像摄影师）、press photographer（新闻摄影师）、wildlife photographer（野生动物摄影师）。"]}
{"word":"photographers","summary":{"en":"Photographers are people who take photographs, often professionally.","zh":"photographers 指“摄影师/拍照的人”，通常指专业摄影师（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who take photographs, especially as a job or serious hobby.","zh":"摄影师；拍照的人，尤指以此为职业或认真爱好的人。"},"examples":[{"en":"Wedding photographers often work long hours on weekends.","zh":"婚礼摄影师周末常常要工作很长时间。"},{"en":"The museum hired photographers to document the artwork.","zh":"博物馆雇了摄影师来记录这些艺术品。"}]}],"synonyms":["camera operators","photojournalists","portrait photographers"],"phonetic":"/fəˈtɑːɡrəfərz/","extraExplanation":["“photographers”是“photographer”的复数形式。词根photo-来自希腊语，意为“光”，graph-意为“书写/记录”，合起来就是“用光来记录”。日常也常见更口语的说法：a photographer（摄影师） vs. someone who takes photos（拍照的人）。"]}
{"word":"photographic","summary":{"en":"Photographic means “connected with photography” or “so accurate/realistic it resembles a photo.”","zh":"photographic 表示“与摄影有关/由相机拍摄的”，也可比喻“像照片一样逼真、准确”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to photography or to taking/producing photos; made using a camera.","zh":"与摄影有关的；用相机拍摄或制作的；照片形式的。"},"examples":[{"en":"The book includes a photographic record of the city before the war.","zh":"这本书包含了这座城市战前的摄影记录。"},{"en":"We need photographic evidence for the report.","zh":"这份报告需要照片证据。"},{"en":"The museum has a photographic exhibition of wildlife.","zh":"博物馆有一个野生动物摄影展。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely accurate and realistic, like a photograph.","zh":"（描写/画面）极其逼真、准确的，仿佛照片一样。"},"examples":[{"en":"Her memory for details is almost photographic.","zh":"她对细节的记忆几乎像“照相式”一样准确。"},{"en":"The painting has a photographic quality.","zh":"这幅画具有照片般的质感与逼真度。"}]}],"synonyms":["photographic (photo-related)","photorealistic","lifelike","realistic","true-to-life"],"phonetic":"/ˌfoʊtəˈɡræfɪk/","extraExplanation":["“photographic”常与名词搭配使用：photographic evidence（照片证据）、photographic record（影像记录）、photographic exhibition（摄影展）、photographic technique（摄影技巧）。","比喻用法中，“photographic memory（照相式记忆）”是固定搭配，表示能非常清晰、准确地记住视觉信息；日常英语里也常用来夸张地形容记性很好。"]}
{"word":"photographically","summary":{"en":"Photographically means “in a way that uses or relates to photographs/photography.”","zh":"photographically 意为“以摄影/照片的方式；与摄影相关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to photography or to making/using photographs.","zh":"以摄影的方式；与摄影或照片相关地。"},"examples":[{"en":"The museum documented the exhibition photographically.","zh":"博物馆用摄影的方式记录了这次展览。"},{"en":"The scientist recorded the experiment photographically for accuracy.","zh":"科学家为确保准确性，用摄影方式记录了实验。"}]},{"partOfSpeech":"adv.","definition":{"en":"By using photographs rather than words or drawings.","zh":"通过照片（而非文字或绘画）来。"},"examples":[{"en":"She told the story photographically, with a series of images.","zh":"她用一组图片“以照片的方式”讲述了这个故事。"},{"en":"The property was presented photographically in the online listing.","zh":"这套房产在网上房源中以照片形式展示。"}]}],"synonyms":["by photograph","in photos","with photographs","visually"],"phonetic":"/ˌfoʊtəˈɡræfɪkli/","extraExplanation":["词形结构：photograph（照片/摄影）+ -ic（……的）→ photographic（摄影的）+ -ally（以……方式）→ photographically（以摄影方式）。","常见搭配：document/record something photographically（用摄影记录）、present something photographically（用照片展示）、capture something photographically（用相机捕捉）。","语体提示：它比 with photos / in photos 更正式，常见于学术写作、新闻报道、博物馆/档案语境。"]}
{"word":"photographs","summary":{"en":"“Photographs” can mean multiple photos (noun plural) or the action “takes photos” (verb).","zh":"“Photographs”既可以指“多张照片”（名词复数），也可以表示“（他/她）拍照”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pictures made with a camera (printed or digital).","zh":"用相机拍摄的照片（纸质或电子的）。"},"examples":[{"en":"She keeps old family photographs in an album.","zh":"她把旧的家庭照片放在相册里。"},{"en":"The police examined the photographs for clues.","zh":"警方检查照片以寻找线索。"},{"en":"Send me the photographs you took at the party.","zh":"把你在聚会上拍的照片发给我。"}]},{"partOfSpeech":"v.","definition":{"en":"To take a photo of someone or something.","zh":"给某人或某物拍照。"},"examples":[{"en":"Tourists photographed the famous bridge at sunset.","zh":"游客在日落时拍下那座著名的桥。"},{"en":"He photographed wildlife in the mountains.","zh":"他在山里拍摄野生动物。"}]}],"synonyms":["photos","pictures","images","snapshots"],"phonetic":"/ˈfoʊtəˌɡræfs/","extraExplanation":["“Photograph”既可作名词（照片），也可作动词（拍照）。“Photographs”常见两种用法：\n1) 名词复数：many photographs（许多照片）；\n2) 动词第三人称单数：He photographs weddings.（他拍摄婚礼）。\n日常口语里，很多人也会说“photos”来代替“photographs”，更简短、更常用。"]}
{"word":"photography","summary":{"en":"Photography means the art or practice of taking pictures with a camera, and it can also mean photographic works as a whole.","zh":"Photography 指“摄影”这门艺术/技能或工作，也可指“摄影作品（照片）”的总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the art, practice, or job of taking and making pictures with a camera (using light to form an image)","zh":"摄影：用相机（利用光线成像）拍摄与制作照片的艺术、技能或工作"},"examples":[{"en":"She studied photography in college and now works as a wedding photographer.","zh":"她在大学学习摄影，现在做婚礼摄影师。"},{"en":"Photography helps us capture everyday moments we might otherwise forget.","zh":"摄影帮助我们记录那些否则可能会被遗忘的日常瞬间。"},{"en":"Street photography often focuses on real life in public places.","zh":"街头摄影常常聚焦公共场所的真实生活。"}]},{"partOfSpeech":"n.","definition":{"en":"a single photo or a set of photos; photographic images (often in an artistic or professional sense)","zh":"（总称）照片/摄影作品：一张或一组照片，常指具有艺术性或专业性的影像"},"examples":[{"en":"The gallery showed black-and-white photography from the 1950s.","zh":"画廊展出了20世纪50年代的黑白摄影作品。"},{"en":"His photography is known for quiet, simple compositions.","zh":"他的摄影作品以安静、简洁的构图著称。"}]}],"synonyms":["photographing","photo-taking","camera work"],"phonetic":"/fəˈtɑɡrəfi/","extraExplanation":["词源小提示：photography 来自希腊语 photo-（光）+ -graphy（书写/记录），字面意思是“用光来记录”。","常见搭配：digital photography（数码摄影）、film photography（胶片摄影）、portrait photography（人像摄影）、landscape photography（风景摄影）、photography studio（摄影棚）。","文化/文学中的用法：在英语里，photography 不仅指技术，也常被当作一种“观察与表达世界”的方式；写作中常与 memory（记忆）、truth（真实）、time（时间）等主题相连。"]}
{"word":"photojournalism","summary":{"en":"Photojournalism is journalism that uses photographs to report news and tell true stories about real events.","zh":"Photojournalism 指用照片报道新闻、讲述真实事件的新闻工作（新闻摄影/摄影新闻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of telling news stories through photographs, usually for newspapers, magazines, or online media.","zh":"用照片来讲述新闻故事的工作或做法，常见于报纸、杂志或网络媒体。"},"examples":[{"en":"Photojournalism can show the human side of a major event in a single image.","zh":"新闻摄影可以用一张照片展现重大事件中人的一面。"},{"en":"She studied photojournalism because she wanted to document real life, not staged scenes.","zh":"她学习新闻摄影，因为她想记录真实生活，而不是摆拍的场景。"},{"en":"Good photojournalism requires accuracy and respect for the people in the photo.","zh":"好的新闻摄影需要准确性，也要尊重照片中的人物。"}]}],"synonyms":["press photography","journalistic photography","documentary photography"],"phonetic":"/ˌfoʊtoʊˈdʒɝnəˌlɪzəm/","extraExplanation":["“photojournalism”由 photo（照片）+ journalism（新闻业）构成，核心是“以影像报道新闻”。它通常强调纪实与真实性：摄影记者一般不能随意摆拍、过度修图或改变现场信息。","在英语语境中常与 ethics（伦理/职业规范）、documentary（纪录）、breaking news（突发新闻）、war correspondent（战地记者）等话题一起出现。历史上有不少经典作品来自战争、社会运动与灾难现场，使“photojournalism”也带有公共记录与社会见证的意义。"]}
{"word":"photon","summary":{"en":"A photon is the basic particle-like unit (packet) of light energy.","zh":"photon 指“光子”，是光能的基本单位（可理解为光的能量包/粒子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny “packet” (particle) of light or other electromagnetic radiation; the basic unit of light energy.","zh":"光子：光或其他电磁辐射的最小“能量包”（粒子）；光能的基本单位。"},"examples":[{"en":"A laser produces a large number of photons moving in the same direction.","zh":"激光会产生大量朝同一方向传播的光子。"},{"en":"Solar panels work by converting the energy of photons into electricity.","zh":"太阳能板通过把光子的能量转换成电能来工作。"},{"en":"In physics class, we learned that a photon has no rest mass.","zh":"在物理课上，我们学到光子没有静止质量。"}]}],"synonyms":["light particle (informal)","quantum of light"],"phonetic":"/ˈfoʊtɑn/","extraExplanation":["词源提示：photon 来自希腊语词根 *phōs/phōt-*，意思是“光”。因此你会在很多与“光”相关的词里看到 photo-，如 photograph（照片）、photosynthesis（光合作用）。","文化/语境：在日常英语里，photon 多用于科学、科普、科技新闻（如量子计算、光通信、激光）。在普通对话中，人们更常说 light（光）。","文学/写作：photon 在文学中常被用作“科技感”的意象，例如写科幻时用来描绘“光束、星光、能量”等画面。"]}
{"word":"photonic","summary":{"en":"Photonic means “related to photons (light) or to technology that uses light.”","zh":"photonic 指“与光子/光有关的”，也常指“利用光进行传输与处理信息的光子技术”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to photons (particles of light) or to technologies that use light—especially lasers and optical devices—to transmit, process, or detect information.","zh":"与光子（光的粒子）有关的；或指利用光（尤其是激光和光学器件）来传输、处理或探测信息的技术。"},"examples":[{"en":"Photonic chips can move data using light instead of electricity.","zh":"光子芯片可以用光而不是电来传输数据。"},{"en":"The lab builds photonic sensors for medical imaging.","zh":"这个实验室制造用于医学成像的光子传感器。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or involving light in a general scientific sense (often used in physics or engineering writing).","zh":"（更广义的科学用法）与光有关的；涉及光的。"},"examples":[{"en":"They studied photonic energy in the material.","zh":"他们研究了材料中的光能（光子能量）。"},{"en":"A photonic signal is less affected by electromagnetic interference than an electrical one.","zh":"光信号比电信号更不容易受到电磁干扰。"}]}],"synonyms":["optical","light-based","photon-related"],"phonetic":"/foʊˈtɑːnɪk/","extraExplanation":["词源：phot- 来自希腊语“光”（phōs/phōt-），-ic 表示“……的”。因此 photonic 字面意思就是“与光/光子有关的”。","在科技语境里，photonic 常与 electronics（电子的）形成对比：电子学用电子在电路中移动，光子学用光在波导/光纤等结构中传播。常见搭配：photonic chip（光子芯片）、photonic crystal（光子晶体）、silicon photonics（硅光子学）。"]}
{"word":"Photos","summary":{"en":"“Photos” usually means photographs (pictures taken by a camera), and it can also refer to the Photos app/section on a device.","zh":"“Photos”通常指“照片/摄影作品”，也可指设备中的“照片（Photos）”应用或照片栏目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pictures made with a camera; photographs (plural of “photo”).","zh":"用相机拍出来的图片；照片（“photo”的复数）。"},"examples":[{"en":"I uploaded my vacation photos to the cloud.","zh":"我把度假照片上传到了云端。"},{"en":"Can you send me the photos from yesterday’s party?","zh":"你能把昨天聚会的照片发给我吗？"},{"en":"She keeps old family photos in a small album.","zh":"她把旧的家庭照片放在一本小相册里。"}]},{"partOfSpeech":"n.","definition":{"en":"A common label for the pictures section in a phone or app (e.g., “Photos” app).","zh":"手机或应用里“图片/照片”功能区的常见名称（如“Photos”照片应用）。"},"examples":[{"en":"Open Photos and choose the picture you want to share.","zh":"打开“照片（Photos）”，选你想分享的那张。"},{"en":"My Photos app is taking up too much storage.","zh":"我的“照片（Photos）”应用占了太多存储空间。"}]}],"synonyms":["photographs","pictures","images","shots"],"phonetic":"/ˈfoʊtoʊz/"}
{"word":"photos","summary":{"en":"“Photos” means pictures taken with a camera; it is the plural form of “photo.”","zh":"“photos”指用相机拍摄的照片，是“photo”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pictures made with a camera; images of people, places, or things (plural of “photo,” short for “photograph”).","zh":"用相机拍摄的图片；人物、地点或事物的影像（“photo”的复数，photo 是 photograph 的简称）。"},"examples":[{"en":"I took some photos of the sunset.","zh":"我拍了一些日落的照片。"},{"en":"Can you send me the photos from the trip?","zh":"你能把旅行的照片发给我吗？"},{"en":"She keeps old family photos in an album.","zh":"她把旧的家庭照片保存在相册里。"}]}],"synonyms":["pictures","images","photographs","pics"],"phonetic":"/ˈfoʊtoʊz/","extraExplanation":["“photo”是“photograph”的常用缩写，更口语、更日常；在手机与社交媒体语境里，“photos”常指手机相册/云端相册中的图片。","在正式写作中也可用“photographs”显得更正式；但日常交流里用“photos”最自然。"]}
{"word":"Photoshop","summary":{"en":"Photoshop is Adobe’s image-editing software; it can also mean to digitally edit a picture (often heavily).","zh":"Photoshop 是 Adobe 的修图软件；也可作动词，指对图片进行数码修图（有时暗示改得较多）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Adobe Photoshop, a popular computer program used to edit photos and make digital images.","zh":"Adobe Photoshop，一款非常流行的电脑软件，用来编辑照片与制作数字图像。"},"examples":[{"en":"I edit my photos in Photoshop before posting them online.","zh":"我在把照片发到网上之前，会先用 Photoshop 修图。"},{"en":"Photoshop is widely used by photographers and designers.","zh":"Photoshop 被摄影师和设计师广泛使用。"}]},{"partOfSpeech":"v.","definition":{"en":"To edit an image using Photoshop or similar software, often to improve appearance or change what is shown.","zh":"用 Photoshop（或类似软件）编辑图片；常指美化外观或改变画面内容。"},"examples":[{"en":"The magazine photos were clearly photoshopped.","zh":"杂志上的照片明显是 P 过的。"},{"en":"Please don’t Photoshop the image too much—I want it to look natural.","zh":"请别把图片 P 得太过头——我希望它看起来更自然。"}]}],"synonyms":["image-editing software","photo editor","edit","retouch","digitally alter"],"phonetic":"/ˈfoʊtoʊʃɑp/","extraExplanation":["“Photoshop”原本是 Adobe 的商标名（软件名称），但在日常英语里经常被动词化，写作 photoshopped / photoshopping，用来泛指“修图/改图”。正式写作中，有时会用更中性的说法，如 edited, retouched, digitally altered。","语气提醒：说某张图是 “photoshopped” 有时带有质疑或批评（暗示不真实、过度美化），具体语境要注意。"]}
{"word":"photosphere","summary":{"en":"The photosphere is the visible light-emitting layer that looks like a star’s surface.","zh":"光球层是恒星看起来像“表面”的可见发光层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The visible “surface” layer of a star (especially the Sun) that gives off most of the light we see.","zh":"恒星（尤其是太阳）的可见“表面”层，发出我们看到的大部分光。"},"examples":[{"en":"Sunspots appear on the Sun’s photosphere.","zh":"太阳黑子出现在太阳的光球层上。"},{"en":"When we look at the Sun, we are seeing light from its photosphere.","zh":"当我们观察太阳时，我们看到的是来自它光球层的光。"}]}],"synonyms":["visible surface (of a star)"],"phonetic":"/ˈfoʊtoʊsfɪr/","extraExplanation":["“photosphere”来自希腊语：photo-（光）+ -sphere（球体/层）。它并不是固体表面，而是一层气体/等离子体，只是因为从这里向外看会变得不透明，所以看起来像“表面”。","在太阳结构中，光球（photosphere）之上是色球（chromosphere）和日冕（corona）；之下更深处是对流层（convection zone）。这些词常见于科普和天文学语境。"]}
{"word":"photostatic","summary":{"en":"Photostatic means “related to photocopying” or “made as a photocopy,” often in formal or older usage.","zh":"photostatic 指“与复印有关”或“复印制成的”，多见于正式或较旧的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to making photocopies (especially by an older method called the Photostat process), or produced as a photocopy","zh":"与复印有关（尤指较早的 Photostat 复印法），或指“以复印方式制成的”"},"examples":[{"en":"Please attach a photostatic copy of your passport.","zh":"请附上你护照的复印件。"},{"en":"The lawyer kept a photostatic record of the contract.","zh":"律师保存了该合同的复印记录。"}]}],"synonyms":["photocopied","photographic (formal)","xerographic (technical)","duplicate (general)"],"phonetic":"/ˌfoʊtoʊˈstætɪk/","extraExplanation":["“photostatic”源自早期的“Photostat（福多斯塔特）”复印技术与商标。在数码扫描和现代复印机普及之前，法律、政府和档案工作中常用“photostatic copy”来指“复印件/影印件”。如今它偏正式、略显旧式，日常更常说“photocopy”或“copy”。"]}
{"word":"Photosynthesis","summary":{"en":"Photosynthesis is how plants (and some other organisms) use sunlight to make sugar from water and carbon dioxide, usually releasing oxygen.","zh":"光合作用是植物（及一些其他生物）利用阳光把水和二氧化碳合成糖，并通常释放氧气的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process by which plants, algae, and some bacteria use sunlight to turn water and carbon dioxide into sugar (chemical energy), usually releasing oxygen","zh":"（光）合作用：植物、藻类以及一些细菌利用阳光，把水和二氧化碳转化为糖（化学能），并通常释放氧气的过程"},"examples":[{"en":"Photosynthesis helps plants make their own food using sunlight.","zh":"光合作用帮助植物利用阳光制造自己的“食物”。"},{"en":"Without photosynthesis, there would be much less oxygen in Earth’s atmosphere.","zh":"没有光合作用，地球大气中的氧气会少得多。"},{"en":"In class, we learned that carbon dioxide is used during photosynthesis.","zh":"在课堂上，我们学到二氧化碳会在光合作用中被利用。"}]}],"synonyms":["carbon fixation (related, not exact)","light-driven sugar production (explanatory)"],"phonetic":"/ˌfoʊtoʊˈsɪnθəsɪs/","extraExplanation":["“photo-”表示“光”，“-synthesis”表示“合成/组合”，合起来就是“用光来合成（制造）”。","常见的简化反应式：6CO₂ + 6H₂O + 光能 → C₆H₁₂O₆（葡萄糖）+ 6O₂。学习时记住三要素：需要光、二氧化碳和水；产物是糖和氧气。","在英语里也常用作比喻，表示“把不同元素组合成新东西”（更偏学术或写作语境），但最常见的还是生物学含义。"]}
{"word":"photosynthesis","summary":{"en":"Photosynthesis is the process organisms use to make sugars from sunlight, water, and carbon dioxide, usually releasing oxygen.","zh":"Photosynthesis（光合作用）是生物利用阳光把水和二氧化碳合成糖，并通常释放氧气的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process by which green plants, algae, and some bacteria use sunlight to make food (sugars) from water and carbon dioxide, usually releasing oxygen.","zh":"光合作用：绿色植物、藻类和部分细菌利用阳光，把水和二氧化碳制造成“食物”（糖），并通常释放氧气的过程。"},"examples":[{"en":"Plants use photosynthesis to make sugar from sunlight, water, and carbon dioxide.","zh":"植物通过光合作用利用阳光、水和二氧化碳制造糖。"},{"en":"Without photosynthesis, there would be much less oxygen in Earth’s atmosphere.","zh":"没有光合作用，地球大气中的氧气会少得多。"},{"en":"In science class, we learned that photosynthesis happens mainly in the leaves.","zh":"在科学课上我们学到，光合作用主要发生在叶子里。"}]}],"synonyms":["light-driven sugar production","carbon fixation (broader, not exact)"],"phonetic":"/ˌfoʊtoʊˈsɪnθəsɪs/","extraExplanation":["“photo-”表示“光”，“-synthesis”表示“合成/组合”，所以 photosynthesis 字面意思是“用光来合成”。","常见的基础反应式（便于记忆）：6CO₂ + 6H₂O + 光能 → C₆H₁₂O₆（葡萄糖） + 6O₂。实际过程更复杂，但这个式子适合入门理解。","与之相对的概念是 cellular respiration（细胞呼吸）：细胞把葡萄糖和氧气转化为能量，并产生二氧化碳和水。两者在生态系统中形成循环。"]}
{"word":"phototropic","summary":{"en":"Phototropic describes growth or movement in response to light, especially plants bending toward light.","zh":"phototropic 指生物对光产生的生长或运动反应，尤指植物向光弯曲生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an organism’s growth or movement in response to light (often seen in plants bending toward light).","zh":"与生物对光的生长或运动反应有关的（常见于植物朝向光源弯曲生长）。"},"examples":[{"en":"Sunflowers are phototropic—they turn and grow toward the sunlight.","zh":"向日葵具有向光性——它们会朝着阳光转动并生长。"},{"en":"The phototropic response helps a plant get more light for photosynthesis.","zh":"向光反应能帮助植物获得更多光照来进行光合作用。"}]}],"synonyms":["light-responsive","phototropic (in context: showing phototropism)"],"phonetic":"/ˌfoʊtəˈtroʊpɪk/","extraExplanation":["“phototropic”来自 photo-（光）+ -tropic（转向、趋向）。在生物学里常见搭配是“phototropic response（向光反应）”或“phototropic growth（向光生长）”。","常见对比词：positive phototropism（正向向光性，朝向光源）与 negative phototropism（负向向光性，远离光源）。例如多数茎倾向正向向光性，而有些根可能表现为负向向光性。","相关词也常一起出现：phototaxis（趋光性，更多指能主动移动的生物如某些微生物的“移动”），phototropism（向光性，这个名词形式）。"]}
{"word":"photovoltaic","summary":{"en":"Photovoltaic means converting light (especially sunlight) directly into electricity, as solar cells do.","zh":"photovoltaic 指把光（尤其是太阳光）直接转化为电能的，即“光伏”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to producing electric current directly from light, especially sunlight (as in solar cells).","zh":"与光生伏特效应有关的；指直接把光（尤其是太阳光）转化为电流的（如太阳能电池）。"},"examples":[{"en":"Photovoltaic panels on the roof provide electricity for the house.","zh":"屋顶上的光伏板为房子提供电力。"},{"en":"The school installed a photovoltaic system to reduce energy costs.","zh":"学校安装了光伏系统来降低能源成本。"},{"en":"Photovoltaic power is clean during operation because it doesn’t burn fuel.","zh":"光伏发电在运行过程中很清洁，因为它不燃烧燃料。"}]}],"synonyms":["solar (common, broader)","photoelectric (related)"],"phonetic":"/ˌfoʊtoʊvɑlˈteɪɪk/","extraExplanation":["“photovoltaic”由 photo-（光）+ voltaic（电的，与电压/伏特有关）组成，常见搭配有 photovoltaic panel（光伏板/太阳能板）、photovoltaic cell（光伏电池/太阳能电池）、photovoltaic system（光伏系统）。","它通常用于能源与工程语境；日常口语里人们也常说 solar（太阳能的）来更简单地表达。"]}
{"word":"phrase","summary":{"en":"“Phrase” most often means a group of words used together as a unit, or a common expression; as a verb, it means to express something with chosen wording.","zh":"“phrase” 常指“短语/词组”或“常用表达”；作动词时表示“措辞、用某种方式表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of words that functions as a unit in a sentence, but usually does not form a complete sentence by itself.","zh":"（语法）短语：在句子中作为一个整体发挥作用的一组词，但通常本身不构成完整句子。"},"examples":[{"en":"“In the morning” is a phrase that tells when something happens.","zh":"“in the morning” 是一个表示时间的短语。"},{"en":"A sentence can contain many phrases.","zh":"一个句子可以包含很多短语。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular expression or set of words, especially one that is commonly used.","zh":"（常用表达）固定说法/措辞：某个特定的表达方式，尤其是常见的说法。"},"examples":[{"en":"“How are you?” is a common phrase in English.","zh":"“How are you?” 是英语里很常见的表达。"},{"en":"Try not to repeat the same phrase too often in your writing.","zh":"写作时尽量不要太频繁重复同一个措辞。"}]},{"partOfSpeech":"v.","definition":{"en":"To express something in a particular way; to choose specific words.","zh":"（动词）措辞/表达：用某种方式说；选择特定用词来表达。"},"examples":[{"en":"She phrased her request politely.","zh":"她把请求说得很客气。"},{"en":"How should I phrase this email to my teacher?","zh":"我该怎么措辞写给老师的这封邮件？"}]}],"synonyms":["expression","wording","group of words","term"],"phonetic":"/freɪz/","extraExplanation":["在英语学习里，phrase 常见于语法分类：例如 noun phrase（名词短语）、verb phrase（动词短语）、prepositional phrase（介词短语）。它们不是“完整句子”，但能在句子里充当某种成分（主语、宾语、状语等）。","日常说“a phrase”也常指“固定表达/常用说法”，这时含义更接近 expression。比如：“Nice to meet you” 也可以被称作一个 phrase。"]}
{"word":"phrases","summary":{"en":"A phrase is a group of words used together (often not a full sentence), or a familiar expression; as a verb, it means to choose words to express something.","zh":"phrase 指在句中一起使用的一组词（常不是完整句子），也可指常用固定说法；作动词表示“用措辞表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short group of words that work together as a unit in a sentence (often not a complete sentence)","zh":"（语法）短语；在句子中作为一个整体使用的一组词（通常不是完整句子）"},"examples":[{"en":"In the sentence “She walked to school,” “to school” is a phrase.","zh":"在句子“She walked to school”中，“to school”是一个短语。"},{"en":"Try to learn common phrases like “How are you?” and “Excuse me.”","zh":"试着学习常用短语，比如“How are you?”和“Excuse me.”"}]},{"partOfSpeech":"n.","definition":{"en":"a short, well-known expression or set of words, often used again and again","zh":"（常用）固定说法；常用语；（反复使用的）措辞"},"examples":[{"en":"“Once upon a time” is a common storytelling phrase.","zh":"“Once upon a time”是讲故事时常用的固定说法。"},{"en":"That phrase sounds rude in English, so be careful.","zh":"那个说法在英语里听起来不礼貌，要小心使用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to express something using particular words or wording","zh":"用某种措辞表达；表述"},"examples":[{"en":"She phrased her request politely.","zh":"她把请求说得很礼貌。"},{"en":"Let me phrase it another way so it’s clearer.","zh":"让我换一种说法，这样更清楚。"}]}],"synonyms":["expression","wording","term"],"phonetic":"/freɪz/","extraExplanation":["“phrase”和“sentence”的区别：sentence（句子）通常有完整主谓结构并表达完整意思；phrase（短语）通常不完整，但在句中可以充当名词/形容词/副词等成分，如“in the morning”“a piece of cake”。","学习英语时常说的“useful phrases”多指日常固定搭配或套语（如问候、道歉、请求），并不一定是语法意义上的“短语”。"]}
{"word":"phrasing","summary":{"en":"Phrasing means the way something is expressed in words; it can also mean musical expression of a melody.","zh":"phrasing指“措辞/表达方式”，也可指音乐中的“乐句处理/旋律表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the way words are chosen and arranged to express an idea (how something is worded)","zh":"措辞；用词方式；表达方式（某句话/某段话是怎么说的）"},"examples":[{"en":"I like the phrasing of your email—it sounds polite and clear.","zh":"我喜欢你邮件的措辞——既礼貌又清楚。"},{"en":"The phrasing of the question was confusing.","zh":"这个问题的措辞让人困惑。"},{"en":"Try a different phrasing to make your meaning more direct.","zh":"试着换一种说法，让意思更直接。"}]},{"partOfSpeech":"n.","definition":{"en":"the way a musician shapes a melody with timing, pauses, and emphasis (musical expression)","zh":"（音乐）乐句处理；乐句的表达方式（通过节奏、停顿、重音等塑造旋律）"},"examples":[{"en":"Her phrasing makes the melody sound like it’s singing.","zh":"她的乐句处理让旋律听起来像在歌唱。"},{"en":"Good jazz phrasing often plays with the beat.","zh":"好的爵士乐句处理常常会“玩”节拍。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of expressing something in a particular way (the process of choosing words)","zh":"措辞的过程；用某种方式表达（选择词语并组织表达的行为）"},"examples":[{"en":"We spent a long time phrasing the announcement carefully.","zh":"我们花了很长时间仔细斟酌公告的措辞。"},{"en":"She paused, phrasing her response so it wouldn’t sound harsh.","zh":"她停顿了一下，斟酌着回应的措辞，避免听起来太刺耳。"}]}],"synonyms":["wording","expression","formulation","choice of words","turn of phrase","musical expression"],"phonetic":"/ˈfreɪzɪŋ/","extraExplanation":["“phrasing”常用于写作/口语反馈：change the phrasing（换个说法）、awkward phrasing（别扭的措辞）、careful phrasing（谨慎措辞）。","和“wording”很接近：wording更偏“具体用的字句本身”，phrasing更强调“表达方式/语气/结构”，在音乐语境里也更常用。"]}
{"word":"phrasis","summary":{"en":"Phrasis means a particular way of wording or expressing something, especially in formal or rhetorical contexts.","zh":"Phrasis 指特定的措辞/表达方式，常用于正式或修辞学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rhetoric, formal) A way of expressing something in words; the particular phrasing or style of wording (diction).","zh":"（修辞/正式用语）用词方式；表达措辞；措辞风格（用语/措辞）。"},"examples":[{"en":"The poet’s phrasis is simple but powerful, which makes the message easy to feel.","zh":"这位诗人的措辞简洁却有力量，让人很容易感受到信息。"},{"en":"In academic writing, you may need to adjust your phrasis to sound more precise and neutral.","zh":"在学术写作中，你可能需要调整措辞，让表达更准确、更中性。"},{"en":"Different cultures can prefer different phrasis when making requests, from direct to very polite.","zh":"不同文化在提出请求时偏好的措辞不同，有的直接，有的非常委婉。"}]}],"synonyms":["phrasing","wording","diction","expression","turn of phrase"],"phonetic":"/ˈfreɪsɪs/","extraExplanation":["“phrasis”源自希腊语 *phrasis*（表达、说法），在英文里多见于修辞学、文学评论或语言风格讨论中，日常口语很少用。更常见的替代词是 *phrasing*、*wording*、*diction*。","在古典修辞语境里，*phrasis*常强调“怎么说”（表达方式、语气、措辞选择）对效果的影响，例如同一内容用更委婉或更直接的说法会带来不同的语气与人际距离。"]}
{"word":"phrazein","summary":{"en":"phrazein is an Ancient Greek root meaning “to tell/express,” mostly used in etymology.","zh":"phrazein 是表示“讲述/表达”的古希腊语词根，主要用于词源说明。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Ancient Greek) “to tell, express, make known; speak or say.” In English, it is mainly seen in etymology discussions (it is not a common modern English word).","zh":"（源自古希腊语）“讲述、表达、使人知道；说、陈述”。在英语里主要出现在词源讲解中（现代英语中并不常用作词）。"},"examples":[{"en":"The word “phrase” comes from Greek phrazein, meaning “to tell” or “to express.”","zh":"“phrase（短语）”一词来自希腊语 phrazein，意思是“讲述”或“表达”。"},{"en":"In etymology notes, you may see phrazein listed as the root related to speaking or explaining.","zh":"在词源注释里，你可能会看到 phrazein 被列为与“说话、解释”相关的词根。"}]}],"synonyms":["tell","say","express","explain"],"phonetic":"/ˈfreɪziːn/","extraExplanation":["phrazein 是古希腊语动词（φράζειν）的拉丁字母转写，常见于英语词源学资料中；日常英语写作或口语里几乎不会直接使用。","它与英语 phrase（短语）、emphatic / emphasis（强调）等词的历史联系，体现了“表达、说明、让人明白”的核心含义。","如果你的目标是现代英语表达，通常你想找的是 phrase（短语）或 to phrase（用某种措辞表达）。"]}
{"word":"phrenetic","summary":{"en":"“Phrenetic” means extremely frantic or wildly energetic; it’s a less common variant of “frenetic.”","zh":"“phrenetic”意为“极度慌乱/疯狂有活力的”；它是较少见的“frenetic”的变体拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wildly excited, frantic, or done with uncontrolled energy.","zh":"极度兴奋的；疯狂的；慌乱的（带有失控的能量）"},"examples":[{"en":"The newsroom was phrenetic on election night.","zh":"选举之夜，新闻编辑部一片忙乱、紧张。"},{"en":"She made a phrenetic attempt to finish the report before the deadline.","zh":"她在截止时间前疯狂赶工，想把报告写完。"},{"en":"The crowd’s phrenetic cheering shook the stadium.","zh":"人群疯狂的欢呼声震动了体育场。"}]}],"synonyms":["frenetic","frantic","hectic","feverish","wild"],"phonetic":"/frəˈnɛtɪk/","extraExplanation":["“phrenetic”较少见，更常见的表达是“frenetic”（同义，拼写更常用）。你可能会在较正式或文学性较强的语境中见到“phrenetic”，含义与“frenetic”基本一致。","词源上与希腊语“phren-（心智/精神）”相关，因此带有“精神亢奋、近乎失控”的色彩；现代英语里主要用于形容节奏、活动或情绪非常狂乱。"]}
{"word":"phreneticus","summary":{"en":"Phreneticus is a rare Latin-based term meaning “delirious/frenzied,” and sometimes “a delirious person,” mostly found in older medical or historical writing.","zh":"Phreneticus 是源自拉丁语的罕见词，意为“神志错乱/狂乱的”，有时也指“神志错乱的人”，多见于旧医学或历史文献。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; Latin/medical-historical) Delirious or frenzied; relating to acute mental confusion or mania.","zh":"（罕见；拉丁语/医学史用语）神志错乱的；狂乱的；与急性精神混乱或躁狂相关的。"},"examples":[{"en":"In some old medical texts, a patient with high fever might be described as phreneticus.","zh":"在一些旧的医学文献里，高烧的病人可能会被描述为 phreneticus（神志错乱）。"},{"en":"The historian notes that “phreneticus” was once used to label people thought to be violently delirious.","zh":"历史学者指出，“phreneticus”曾被用来指被认为严重谵妄、举止激烈的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; Latin) A delirious person; someone in a frenzy.","zh":"（罕见；拉丁语）神志错乱者；狂乱的人。"},"examples":[{"en":"The record calls him a phreneticus, unable to recognize his family.","zh":"记录称他为 phreneticus，已经认不出家人。"}]}],"synonyms":["delirious","frantic","frenzied","raving"],"phonetic":"/frəˈnɛtɪkəs/","extraExplanation":["这个词主要见于拉丁文或早期英语医学/神学/法庭记录中，不是现代日常英语用词。现代英语更常用 delirious（谵妄的）、frantic（发狂似的）、frenzied（狂乱的）。","词源上与希腊语词根 phrēn-（意为“心智/精神”）相关，也常与 phrenitis（古代对“脑部炎症/谵妄”的说法）联系在一起。","在古文献里，它有时带有强烈的历史偏见：把精神症状简单归为“疯狂”。阅读此类文本时可注意其时代背景与用词局限。"]}
{"word":"phrun","summary":{"en":"“Phrun” isn’t a standard English word; it’s likely a typo (often for “prune”).","zh":"“phrun”不是标准英语单词；更可能是拼写错误（常见为“prune”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or an invented spelling (often typed when someone means “prune” or another similar-looking word).","zh":"不是标准英语单词；通常是拼写错误或临时造词（常见情况是想写“prune”等相似拼写的词）。"},"examples":[{"en":"I can’t find “phrun” in the dictionary—did you mean “prune”?","zh":"我在词典里找不到“phrun”——你是不是想写“prune”？"},{"en":"If you meant “prune,” it can mean to cut off unwanted branches.","zh":"如果你想写的是“prune”，它可以表示修剪掉不需要的枝条。"}]}],"synonyms":["(if you meant “prune”) trim","cut back","clip","remove","delete"],"phonetic":"/frʌn/","extraExplanation":["“phrun”在常见英语词典中一般查不到，因此更可能是：\n1）把“prune”（修剪；删减；梅干）打错了；\n2）把“frond / frown / run”等词的拼写混在一起；\n3）网络昵称、游戏ID、或特定圈子里的自造词。\n如果你告诉我你看到它的句子（上下文），我可以更准确判断你想表达的词。"]}
{"word":"Physic","summary":{"en":"Physic is an old-fashioned word meaning medicine, and it can also mean to treat someone with medicine.","zh":"Physic 是较旧的词，表示“药/药物”，也可作动词表示“用药治疗（有时指用泻药通便）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicine, especially in older or literary use; sometimes specifically a laxative or purgative.","zh":"（多为旧式或文学用法）药物；有时特指泻药/通便药。"},"examples":[{"en":"In old stories, a doctor might give a patient a bitter physic.","zh":"在旧故事里，医生可能会给病人一剂苦药（physic）。"},{"en":"Some historical remedies were sold as physic for almost every illness.","zh":"一些历史上的偏方被当作“包治百病的药”（physic）来卖。"}]},{"partOfSpeech":"vt.","definition":{"en":"To treat someone with medicine; in older use, to purge with a laxative.","zh":"（旧式用法）用药治疗；（尤指）用泻药通便/清肠。"},"examples":[{"en":"The healer tried to physic the sick traveler back to health.","zh":"治疗者试着用药把生病的旅人治好。"},{"en":"In the past, patients were sometimes physicked before a long journey.","zh":"过去，人们有时会在长途旅行前被“用泻药清肠”。"}]}],"synonyms":["medicine","remedy","drug","treatment","purgative"],"phonetic":"/ˈfɪzɪk/","extraExplanation":["“physic”在现代英语里比较少见，更多出现在历史文本、文学作品或固定表达中。日常英语里通常用“medicine”“drug”“treatment”。","注意不要和“physics（物理学）”混淆：physics 是学科名词；physic 是“药/用药治疗”的旧式词。"]}
{"word":"physic","summary":{"en":"Physic (old-fashioned) means a medicine—often a purgative—and can also mean to treat or purge with medicine.","zh":"physic（较旧式）指药物（常指泻药），也可作动词表示用药治疗或通便。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine, especially a strong one that purges (causes the body to empty the bowels); an old-fashioned word for a remedy","zh":"药物；（尤指）泻药、通便药；（旧式用法）疗药、药方"},"examples":[{"en":"In old stories, a doctor might give the patient a bitter physic.","zh":"在一些旧故事里，医生可能会给病人开一剂苦的药（physic）。"},{"en":"The herb was used as a physic to cleanse the body.","zh":"这种草药曾被当作泻药来“清理”身体。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat with medicine; especially to purge with a strong medicine (old-fashioned)","zh":"用药治疗；（尤指旧式用法）用泻药通便"},"examples":[{"en":"They physicked the horse before the long journey.","zh":"长途行程前，他们给马用药（甚至用泻药）处理。"},{"en":"In the past, people believed they should be physicked in spring to stay healthy.","zh":"过去人们认为春天该“通一通”（用泻药）才能保持健康。"}]}],"synonyms":["medicine","remedy","purgative","laxative","drug"],"phonetic":"/ˈfɪzɪk/","extraExplanation":["“physic”是一个较古旧的词，常见于文学作品、历史文本或带有复古风格的写作中。现代英语里更常用的是“medicine / drug / remedy”；如果指“物理学”，应拼作“physics”。","词源上，“physic”与“physical / physician”同源，和“自然、身体、医学”有关；因此它既能指“药”，也能引申为“用药治疗（或通便）”。","常见搭配（偏旧）：a bitter physic（苦药）、to take a physic（服药/服泻药）。在现代语境中这样说可能显得戏仿或古风。"]}
{"word":"Physica","summary":{"en":"Physica is a Latin form meaning “Physics,” often used as a classical title (especially for Aristotle’s work) or in formal names.","zh":"Physica 是“物理学/自然学”的拉丁文形式，常作古典书名（尤指亚里士多德著作）或用于正式名称中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin title meaning “Physics”; often used to refer to Aristotle’s work on nature and motion (commonly translated as “Physics”).","zh":"拉丁文书名，意为“物理学/自然学”；常用来指亚里士多德关于自然与运动的著作（英语常译为《Physics/物理学》）。"},"examples":[{"en":"In some older catalogs, Aristotle’s Physics appears under the Latin title Physica.","zh":"在一些较旧的目录里，亚里士多德的《Physics》会以拉丁书名 Physica 收录。"},{"en":"The course reading list includes Physica (Aristotle) alongside modern physics texts.","zh":"课程阅读书目把 Physica（亚里士多德）和现代物理教材一起列出。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) “physics” as a subject, used mainly in Latin or in names of institutions and publications.","zh":"（在英语中较少见）作为“物理学”学科之意，多见于拉丁文语境或机构/出版物名称中。"},"examples":[{"en":"The journal title uses Latin: Physica A.","zh":"这本期刊的标题用了拉丁语：Physica A。"},{"en":"The department name includes Physica in a Latin motto.","zh":"系名在拉丁文格言中包含了 Physica。"}]}],"synonyms":["physics","Aristotle’s Physics"],"phonetic":"/ˈfɪzɪkə/","extraExplanation":["“Physica”源自希腊语词根 *physis*（自然），在古典与中世纪学术传统中常用拉丁语把“研究自然的学问”称为 *physica*。因此你会在古书目录、学术期刊分区（如 Physica A/B/C/D）或校训中见到它。","如果你想表达现代学科“物理学”，日常英语最自然的写法是 **physics**；“Physica”更像是书名/拉丁文形式，带有古典或学术命名的感觉。"]}
{"word":"physica","summary":{"en":"“Physica” is an uncommon English form, mainly used in Latin/older titles, meaning “physics” or referring to classical works about nature (e.g., Aristotle’s *Physica*).","zh":"“Physica”在现代英语中较少见，主要用于拉丁语/旧书名语境，意思接近“物理学（physics）”，或指研究自然的经典著作（如亚里士多德《Physica》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not common in modern English) “Physica” can refer to “physics,” especially in Latin or in titles of older works.","zh":"（现代英语中不常用）“Physica”可指“物理学（physics）”，常见于拉丁语或古老著作的标题中。"},"examples":[{"en":"The museum displayed a rare Latin edition labeled “Physica.”","zh":"博物馆展出了一本罕见的拉丁文版本，标题写着“Physica”。"},{"en":"In some older texts, “physica” is used where we would now say “physics.”","zh":"在一些较早的文本中，会用“physica”来表达我们现在说的“physics（物理学）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A title used for important historical works about nature and the principles of the natural world (for example, Aristotle’s *Physica* / *Physics*).","zh":"用于指代研究自然与自然界原理的重要历史著作的书名（例如亚里士多德的《Physica / Physics》）。"},"examples":[{"en":"Aristotle’s *Physica* influenced later European thinking about nature and motion.","zh":"亚里士多德的《Physica》影响了后来欧洲关于自然与运动的思想。"},{"en":"The class compared Aristotle’s *Physica* with modern physics.","zh":"课堂把亚里士多德的《Physica》与现代物理学作了比较。"}]}],"synonyms":["physics","natural philosophy"],"phonetic":"ˈfɪzɪkə","extraExplanation":["在日常英语里你几乎不会用“physica”来表示“物理学”；最常用的是“physics”。“Physica”更多出现在拉丁文语境、书名、学术史讨论或古籍版本信息中。","如果你是想查“physics（物理学）”，也可以告诉我，我可以给出更常见、更适合学习者的用法、搭配和例句。"]}
{"word":"physical","summary":{"en":"“Physical” most often means related to the body or material things; it can also mean involving bodily contact, and as a noun it means a medical checkup.","zh":"“physical”最常指与身体或有形事物有关；也可指涉及肢体接触的；作名词时常指“体检”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the body, health, or bodily activity (not the mind).","zh":"与身体、健康或身体活动有关的（非心理层面）。"},"examples":[{"en":"Regular physical exercise can improve your sleep.","zh":"规律的身体锻炼可以改善睡眠。"},{"en":"The doctor performed a physical examination.","zh":"医生进行了体格检查。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to things you can touch or see; material, not abstract.","zh":"与可触摸、可看见的事物有关的；物质的，非抽象的。"},"examples":[{"en":"There was no physical evidence to support the story.","zh":"没有任何物证来支持这个说法。"},{"en":"Money is a physical object, but wealth can be abstract.","zh":"钱是有形的物品，但财富也可以是抽象概念。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving force or contact; not just verbal (often describing conflict).","zh":"涉及力量或身体接触的；不仅仅是口头上的（常形容冲突）。"},"examples":[{"en":"The argument became physical, so they separated the two men.","zh":"争吵升级为肢体冲突，于是他们把两人拉开。"}]},{"partOfSpeech":"n.","definition":{"en":"A medical checkup (short for “physical examination”).","zh":"体检（“physical examination”的简称）。"},"examples":[{"en":"I’m getting a physical before starting my new job.","zh":"我在开始新工作前要做一次体检。"},{"en":"Your insurance may cover an annual physical.","zh":"你的保险可能涵盖每年的体检。"}]}],"synonyms":["bodily","corporeal","material","tangible","medical (in: physical exam)"],"phonetic":"/ˈfɪzɪkəl/","extraExplanation":["在美式英语里，a physical 很常用来指“体检”，尤其是入职前、入学前或年度体检。英式英语中也能这么用，但有时会更常说 medical 或 medical examination。","与 physical 相对的常见搭配是 mental（心理的）和 emotional（情绪的），例如 physical health（身体健康） vs. mental health（心理健康）。","在文学或正式写作中，physical 也常用来强调“真实可感、具体的”对比“抽象的”，如 physical reality（现实的物质层面）。"]}
{"word":"physically","summary":{"en":"Physically means “in a bodily way” or “in real, physical reality (not just in theory).”","zh":"physically 表示“在身体方面”，也可表示“在现实/物质层面上（不是仅停留在理论或想法）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the body (not the mind or emotions).","zh":"在身体方面；与身体（而非心理或情感）有关地。"},"examples":[{"en":"I’m fine mentally, but I’m physically exhausted.","zh":"我心理上没事，但身体上很疲惫。"},{"en":"The job is physically demanding.","zh":"这份工作对体力要求很高。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves real material things or actions (in the real world), not just ideas or words.","zh":"在现实/物质层面上；以实际事物或行动的方式（而不仅是想法或言语）。"},"examples":[{"en":"The files are stored digitally, but the keys are kept physically in a safe.","zh":"文件以数字形式存储，但钥匙实物被放在保险箱里。"},{"en":"They were physically present at the meeting.","zh":"他们当时确实亲自到场参加了会议。"}]}],"synonyms":["bodily","corporeally","in person","materially"],"phonetic":"/ˈfɪzɪkli/","extraExplanation":["“physically”常与“mentally / emotionally”对比使用：physically（身体上）vs. mentally（心理上）vs. emotionally（情感上）。","也常用来强调“亲自、实际到场/以实物形式存在”，比如 physically present（亲自到场）、physically in a safe（以实物形式放在保险箱里）。"]}
{"word":"Physician","summary":{"en":"A physician is a medical doctor who diagnoses and treats illness; the word can also be used figuratively as “a healer.”","zh":"physician 指医生/医师，负责诊断与治疗疾病；也可作比喻义，表示“疗愈者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical doctor; a person trained and licensed to diagnose illnesses and treat patients.","zh":"医生；受过专业训练并取得执照，用于诊断疾病并治疗病人的人（尤指内科医生或泛指医师）。"},"examples":[{"en":"She went to the physician because her cough wouldn’t go away.","zh":"她去看医生，因为咳嗽一直不好。"},{"en":"Your physician can explain the risks and benefits of this medicine.","zh":"你的医生可以解释这种药的风险和益处。"},{"en":"He is a primary care physician at a community clinic.","zh":"他是社区诊所的初级保健医生。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, literary) A person who heals or remedies problems; a “healer.”","zh":"（较少见，文学用法）能医治或补救问题的人；“疗愈者/救治者”。"},"examples":[{"en":"Time is often called a physician for grief.","zh":"人们常说时间是治愈悲伤的良药。"},{"en":"In the poem, music becomes a physician for the heart.","zh":"在诗中，音乐成了心灵的医师。"}]}],"synonyms":["doctor","medical doctor","MD","clinician","primary care doctor"],"phonetic":"/fɪˈzɪʃən/","extraExplanation":["“physician”来自拉丁语 *physica*（自然/医学）相关词源，传统上更偏“内科医生”的概念；而“surgeon”通常指外科医生。现代英语里，“physician”常用作正式或书面语的“医师/医生”，尤其在美式英语的医疗体系中常见（如 *primary care physician* 初级保健医生）。","常见搭配：*see a physician*（去看医生）、*family physician*（家庭医生）、*attending physician*（主治医师）、*physician’s order(s)*（医嘱）。","注意与“physicist”（物理学家）不要混淆：拼写相近但意义完全不同。"]}
{"word":"physician","summary":{"en":"A physician is a medically trained and licensed doctor who diagnoses and treats illness (often a formal term, especially for non-surgeons).","zh":"physician 指受过医学训练并取得执照的医生（较正式用法，常指非外科医生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical doctor; a person trained and licensed to diagnose illnesses and treat patients.","zh":"内科医生；医生（受过医学训练并取得执照，能诊断疾病并治疗病人）。"},"examples":[{"en":"She is a physician at the local hospital.","zh":"她是当地医院的一名医生。"},{"en":"You should see a physician if the fever lasts more than three days.","zh":"如果发烧持续超过三天，你应该去看医生。"},{"en":"The physician reviewed his blood test results and explained the next steps.","zh":"医生查看了他的血液检查结果，并解释了下一步该怎么做。"}]}],"synonyms":["doctor","medical doctor (M.D.)","primary care physician (PCP)","internist"],"phonetic":"/fɪˈzɪʃən/","extraExplanation":["在美式英语里，physician 通常指“医学博士/执业医师”，尤其偏“内科医生”或“非外科医生”。外科医生常用 surgeon。","doctor 是更常用、更口语的说法；physician 更正式，常见于医院系统、保险文件、表格（如 primary care physician，初级保健医生/家庭医生）。","词源来自希腊语 *physis*（自然）与 *iatros*（治疗者）的传统观念，早期强调“以自然之理解释疾病并治疗”。"]}
{"word":"physicians","summary":{"en":"“Physicians” is the plural form of “physician,” meaning doctors/medical doctors.","zh":"“physicians”是“physician”的复数形式，意思是“医生/医师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctors; medical professionals who are trained and licensed to diagnose illnesses and provide treatment.","zh":"医生；受过训练并取得执照、负责诊断疾病并进行治疗的医疗专业人员。"},"examples":[{"en":"The clinic has three physicians and two nurses.","zh":"这家诊所有三位医生和两位护士。"},{"en":"Physicians often work with pharmacists to choose the right medicine.","zh":"医生常与药剂师合作，选择合适的药物。"}]}],"synonyms":["doctors","medical doctors","MDs","clinicians"],"phonetic":"/fɪˈzɪʃənz/","extraExplanation":["“Physician”在美式英语里通常指“内科医生/执业医师”（MD或DO），更偏“开诊断和治疗方案的人”。“Surgeon”专指外科医生；“doctor”更口语、更泛，也可指博士（PhD）。","词源上，“physician”来自与“物理/自然（physics）”同源的词根，早期与“研究自然与医学的人”有关。现代用法已固定为“医生”。"]}
{"word":"Physicist","summary":{"en":"A physicist is a scientist who studies physics.","zh":"physicist 指研究物理学的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientist who studies physics (matter, energy, motion, forces, space, and time)","zh":"物理学家：研究物理学（物质、能量、运动、力、空间与时间等）的科学家"},"examples":[{"en":"Marie Curie was a physicist and chemist who studied radioactivity.","zh":"玛丽·居里既是物理学家也是化学家，她研究放射性。"},{"en":"The physicist explained how gravity affects the motion of planets.","zh":"那位物理学家解释了重力如何影响行星的运动。"},{"en":"He wants to become a physicist and work at a research lab.","zh":"他想成为一名物理学家，并在研究实验室工作。"}]}],"synonyms":["physics researcher","scientist"],"phonetic":"/ˈfɪzɪsɪst/","extraExplanation":["词形：physics（物理学）+ -ist（表示“从事某领域的人”），类似的还有 biologist（生物学家）、chemist（化学家）。","常见搭配：theoretical physicist（理论物理学家）、experimental physicist（实验物理学家）、particle physicist（粒子物理学家）。","文化提示：在英文语境里，physicist 不一定是“物理老师”，更多指做研究或在大学/研究机构从事物理工作的科学家。"]}
{"word":"physicist","summary":{"en":"A physicist is a scientist who studies physics and the laws of nature.","zh":"physicist 指研究物理学与自然规律的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies physics (matter, energy, motion, forces, space, and time).","zh":"研究物理学（物质、能量、运动、力、时空等）的科学家。"},"examples":[{"en":"Marie Curie was a physicist and chemist who helped shape modern science.","zh":"玛丽·居里既是物理学家也是化学家，对现代科学产生了深远影响。"},{"en":"The physicist explained how gravity affects planets and stars.","zh":"这位物理学家解释了引力如何影响行星和恒星。"},{"en":"He wants to become a physicist and work in a research lab.","zh":"他想成为一名物理学家，在研究实验室工作。"}]}],"synonyms":["physics researcher","scientist"],"phonetic":"/ˈfɪzɪsɪst/","extraExplanation":["词源：physicist 来自 physics（物理学）。physics 源于希腊语 *physis*，意为“自然”。因此 physicist 字面上可理解为“研究自然规律的人”。","常见搭配：theoretical physicist（理论物理学家）、experimental physicist（实验物理学家）、particle physicist（粒子物理学家）、astrophysicist（天体物理学家）。","文化/文学提示：在科普与文学作品中，physicist 常被用来代表“用数学与实验理解世界的人”，例如爱因斯坦（Albert Einstein）常被提及为最著名的 physicist 之一。"]}
{"word":"physicists","summary":{"en":"“Physicists” means people who study physics (plural of “physicist”).","zh":"“physicists” 指“物理学家们”，是 physicist 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Scientists who study physics—how matter, energy, forces, space, and time work.","zh":"研究物理学的科学家——探究物质、能量、力、空间与时间如何运作。"},"examples":[{"en":"Physicists study how light behaves and how energy moves through space.","zh":"物理学家研究光的行为，以及能量如何在空间中传播。"},{"en":"Many physicists work in universities, national labs, or technology companies.","zh":"许多物理学家在大学、国家实验室或科技公司工作。"},{"en":"Physicists helped develop technologies like GPS, lasers, and MRI.","zh":"物理学家推动了如 GPS、激光和核磁共振成像（MRI）等技术的发展。"}]}],"synonyms":["physics researchers","physics scientists"],"phonetic":"/ˈfɪzɪsɪsts/","extraExplanation":["“Physicists” 是 “physicist（物理学家）” 的复数形式。词根来自希腊语 *physis*（自然），所以 physics 本意与“自然规律”有关。","英语里常见搭配有：theoretical physicists（理论物理学家）、experimental physicists（实验物理学家）、particle physicists（粒子物理学家）、astrophysicists（天体物理学家）。","文化与文学中常提到的著名物理学家包括 Albert Einstein（爱因斯坦）和 Stephen Hawking（霍金）；在科普写作里，“physicists” 常被用来指探索宇宙基本规律的一群人。"]}
{"word":"Physics","summary":{"en":"Physics is the science of matter, energy, forces, motion, space, and time; informally it can also mean realistic movement behavior in games or simulations.","zh":"Physics 指研究物质、能量、力与运动等规律的物理学；口语中也可指游戏/模拟里的“物理效果（物理引擎）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The science that studies matter, energy, motion, forces, space, and time, and how they interact.","zh":"物理学：研究物质、能量、运动、力、空间与时间及其相互作用的科学。"},"examples":[{"en":"I’m taking physics this semester, and we’re learning about Newton’s laws.","zh":"我这学期在上物理课，我们正在学习牛顿定律。"},{"en":"Physics helps explain why objects fall and how electricity works.","zh":"物理学帮助解释物体为什么会下落，以及电是如何工作的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) The physical properties or behavior of something, especially in computer games or simulations (how things move, collide, or react).","zh":"（非正式）物理效果/物理特性：尤其指电子游戏或模拟中物体的运动、碰撞与反应方式。"},"examples":[{"en":"The game’s physics feel realistic when you drive or crash.","zh":"这个游戏的物理效果很真实，开车或撞车时都能感觉出来。"},{"en":"They improved the physics so the ball bounces more naturally.","zh":"他们改进了物理引擎，让球的弹跳更自然。"}]}],"synonyms":["physical science","mechanics (as a subfield)","physics engine (game context)"],"phonetic":"/ˈfɪzɪks/","extraExplanation":["“Physics”来自希腊语 *physis*（自然），所以它本来的意思与“自然/自然界的规律”有关。","在学校语境里，physics 常指一门课程：*study physics / take physics*（学物理/上物理课）。在科技语境里，physics 常指“物理引擎/物理模拟”。"]}
{"word":"physics","summary":{"en":"Physics is the science of matter, energy, and the laws that govern the physical world; it can also mean the physical principles of a specific system (the physics of something).","zh":"Physics 指研究物质与能量及其规律的科学（物理学）；也可指某一具体系统/现象背后的物理原理（……的物理机制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural science that studies matter, energy, motion, forces, space, and time, and how they interact","zh":"物理学：研究物质、能量、运动、力、空间与时间及其相互作用的自然科学"},"examples":[{"en":"Physics helps explain why objects fall and how planets move.","zh":"物理学帮助解释物体为什么会下落，以及行星如何运动。"},{"en":"She’s majoring in physics at university.","zh":"她在大学主修物理学。"},{"en":"In high school, we studied basic physics like speed, force, and energy.","zh":"在高中，我们学习了速度、力和能量等基础物理。"}]},{"partOfSpeech":"n.","definition":{"en":"the physical properties and laws of a particular system or situation (often used as “the physics of …”)","zh":"（某个系统或情境的）物理规律/物理特性（常用作“……的物理学/物理机制”）"},"examples":[{"en":"Engineers must understand the physics of bridges to keep them safe.","zh":"工程师必须理解桥梁的物理机制，才能确保安全。"},{"en":"The physics of sound explains how music travels through air.","zh":"声音的物理规律解释了音乐如何在空气中传播。"}]}],"synonyms":["physical science","the laws of nature","mechanics (in some contexts)"],"phonetic":"/ˈfɪzɪks/","extraExplanation":["“physics”源自希腊语 *physis*（自然），早期含义接近“自然哲学”。现代物理通常分为经典物理（如牛顿力学、热学、电磁学）与现代物理（如相对论、量子力学）。","常见搭配：do/study physics（学物理）、physics class（物理课）、physics lab（物理实验室）、a physics problem（物理题）。","容易混淆：physics（物理学） vs. physical（身体的/物理的） vs. physician（医生，发音相近但意思完全不同）。"]}
{"word":"physik","summary":{"en":"Physik is the German word for physics.","zh":"Physik 是德语中“物理学”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) the word for “physics,” the science of matter, energy, motion, and forces; often seen in German course names or book titles.","zh":"（德语）“物理学”的意思；研究物质、能量、运动与力的科学；常见于德语课程名称或书名中。"},"examples":[{"en":"I’m taking Physik this semester in Germany.","zh":"我这学期在德国上物理课（Physik）。"},{"en":"The textbook title includes “Physik” because it’s written in German.","zh":"这本教材标题里有“Physik”，因为它是德语写的。"}]}],"synonyms":["physics"],"phonetic":"ˈfɪzɪks","extraExplanation":["“Physik”在德语里对应英语“physics”。在英语语境中，人们通常写作“physics”，而不是“physik”，除非是在引用德语课程名、系名或书名。","词源上英语“physics”和德语“Physik”都来自希腊语 *physis*（自然），所以在很多欧洲语言里拼写相似。"]}
{"word":"Physika","summary":{"en":"Physika usually refers to “physics,” either as a school subject (in some languages) or as a book title meaning “Physics,” especially Aristotle’s *Physics*.","zh":"Physika 通常指“物理（physics）”，可表示某些语言中的学科名称，也可作书名，尤其指亚里士多德的《Physics》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in some languages) the school subject or field of study known in English as “physics.”","zh":"（在一些语言中）指英语里的“physics（物理学）”，即研究物质、能量与自然规律的学科。"},"examples":[{"en":"In our timetable, “Physika” is on Monday and Wednesday.","zh":"在我们的课表上，“Physika（物理课）”在周一和周三。"},{"en":"She chose Physika because she likes understanding how things work.","zh":"她选择学 Physika（物理），因为她喜欢弄懂事物如何运作。"}]},{"partOfSpeech":"n.","definition":{"en":"A title used for works meaning “Physics,” especially Aristotle’s work commonly translated as *Physics* (Greek: *Physiká*), about nature and change.","zh":"可作书名，意为“物理学/自然学”，尤其指亚里士多德的著作《Physics》（希腊语 *Physiká*），讨论自然与变化。"},"examples":[{"en":"In philosophy class, we read parts of Aristotle’s Physika.","zh":"在哲学课上，我们读了亚里士多德《Physika（物理学/自然学）》的一些章节。"},{"en":"The term comes from an older tradition where “physics” meant the study of nature.","zh":"这个词来自更早的传统，那时“physics”指对自然的研究。"}]}],"synonyms":["physics","natural philosophy","Aristotle’s Physics"],"phonetic":"/ˈfɪzɪkə/","extraExplanation":["“Physika/Physiká”源自希腊语词根 *physis*（自然）。在古典语境里，它更接近“自然学/自然哲学”，不完全等同于现代以实验与数学为核心的“物理学”。","“Physika”也常见于一些欧洲语言的课表或学科名称中（相当于英语的 *physics*）。具体含义通常要看你看到它的语言与语境（课表、书名、课程介绍等）。"]}
{"word":"physio","summary":{"en":"“Physio” is an informal word for a physiotherapist or for physiotherapy treatment (especially in UK/Aus/NZ).","zh":"“physio”是“physiotherapist/physiotherapy”的口语说法，指理疗师或理疗（尤常见于英/澳/新）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A physiotherapist; a healthcare professional who helps you recover movement and reduce pain through exercises and physical treatment.","zh":"（非正式）物理治疗师／理疗师；通过运动训练与物理手段帮助恢复活动能力、减轻疼痛的医疗人员。"},"examples":[{"en":"After my knee surgery, I saw a physio twice a week.","zh":"膝盖手术后，我每周看两次理疗师。"},{"en":"The physio showed me exercises to strengthen my ankle.","zh":"理疗师教我做一些动作来增强脚踝力量。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mainly UK/Australia/New Zealand) Physiotherapy as a service or treatment.","zh":"（非正式，主要用于英/澳/新）物理治疗（作为一项服务或治疗）。"},"examples":[{"en":"My doctor referred me to physio for my back pain.","zh":"医生把我转诊去做理疗来缓解背痛。"},{"en":"I have physio on Thursday morning.","zh":"我周四早上要去做理疗。"}]}],"synonyms":["physiotherapist","physical therapist","PT (US)","physiotherapy","physical therapy"],"phonetic":"/ˈfɪzioʊ/","extraExplanation":["“physio”是“physiotherapist/physiotherapy”的口语缩略，日常对话里很常见，尤其在英国、澳大利亚、新西兰。美国更常说“physical therapist (PT)”和“physical therapy”。","在医疗语境里，“physio”通常是中性、友好的口语表达；写正式文件（如病历、报告）时更常用全称。"]}
{"word":"physiological","summary":{"en":"Physiological means “related to the body’s functions” or “related to physiology.”","zh":"Physiological 意为“与身体机能/生理过程有关的”，也可指“与生理学相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to how the body works (its normal functions and processes).","zh":"与身体如何运作（正常机能与生理过程）有关的。"},"examples":[{"en":"Stress can cause physiological changes like a faster heartbeat.","zh":"压力会引发生理变化，比如心跳加快。"},{"en":"The doctor explained the physiological reasons for his fatigue.","zh":"医生解释了他疲劳背后的生理原因。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving physiology as a field of study (the science of body functions).","zh":"涉及生理学这一学科（研究身体机能的科学）的。"},"examples":[{"en":"The course covers physiological responses to exercise.","zh":"这门课讲运动引发的生理反应。"},{"en":"Researchers measured physiological data such as blood pressure and oxygen levels.","zh":"研究人员测量了血压、血氧等生理数据。"}]}],"synonyms":["bodily","physical","biological"],"phonetic":"/ˌfɪziəˈlɑdʒɪkəl/","extraExplanation":["“physiological”常与“psychological（心理的）”对比使用：physiological更偏向身体层面的反应（如出汗、心跳），psychological更偏向情绪与思维层面（如焦虑、信念）。","常见搭配：physiological response（生理反应）、physiological change（生理变化）、physiological needs（生理需求）、physiological arousal（生理唤起/兴奋）。"]}
{"word":"physiologically","summary":{"en":"Physiologically means “in a way related to the body’s physical functions.”","zh":"physiologically 表示“从生理角度/在身体机能层面”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to how the body (and its organs) works; in terms of bodily functions.","zh":"从生理角度；就身体（及器官）如何运作而言；在生理机能方面。"},"examples":[{"en":"The temperature change affects us physiologically, not just psychologically.","zh":"温度变化对我们的影响是生理上的，不只是心理上的。"},{"en":"He is physiologically unable to process lactose, so he avoids dairy.","zh":"他在生理上无法分解乳糖，所以会避免乳制品。"},{"en":"Athletes can be physiologically adapted to high altitudes after training.","zh":"运动员经过训练后，在生理上可以适应高海拔环境。"}]}],"synonyms":["biologically","bodily","in physical terms","in terms of bodily function"],"phonetic":"/ˌfɪziəˈlɑdʒɪkli/","extraExplanation":["“physiologically”常与“psychologically（心理上）”对比：前者强调身体机能与反应（如心率、激素、代谢），后者强调情绪、认知与主观感受。","词形来源：physiology（生理学）+ -al（形容词后缀）→ physiological（生理的）+ -ly（副词后缀）→ physiologically（生理地/从生理角度）。","常见搭配：physiologically impossible（生理上不可能）、physiologically based（以生理为基础的）、physiologically response/reaction（生理反应）。"]}
{"word":"physiologist","summary":{"en":"A physiologist is a scientist who studies how the body (or other living organisms) functions.","zh":"physiologist 指研究人体或其他生物体功能运作机制的“生理学家”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies physiology—how living bodies work (for example, how organs, cells, and systems function).","zh":"生理学家：研究生理学的科学家，关注生物体如何运作（如器官、细胞和各系统的功能）。"},"examples":[{"en":"The physiologist explained how the heart pumps blood through the body.","zh":"这位生理学家解释了心脏如何把血液泵送到全身。"},{"en":"She is a physiologist who studies how people adapt to high altitude.","zh":"她是一位研究人如何适应高海拔环境的生理学家。"}]}],"synonyms":["physiology researcher","biologist (in physiology)"],"phonetic":"/ˌfɪziˈɑlədʒɪst/","extraExplanation":["词源提示：physiologist 来自 physiology（生理学）+ -ist（……学家/从事者）。在学术与医疗语境中常见，但 physiologist 通常指研究“身体功能机制”的研究者，不等同于临床医生（doctor）。","相关区分：anatomist（解剖学家）更偏“结构”；physiologist（生理学家）更偏“功能”。"]}
{"word":"physiology","summary":{"en":"Physiology is the study of how the body and its parts function.","zh":"Physiology 指研究人体及其各部分如何运作与发挥功能的学科（生理学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the branch of biology that studies how living things (especially the human body) work, including how organs and systems function","zh":"生理学；研究生物（尤指人体）如何运作的学科，包括器官与系统的功能机制"},"examples":[{"en":"In physiology class, we learned how the heart pumps blood through the body.","zh":"在生理学课上，我们学习了心脏如何把血液泵送到全身。"},{"en":"Exercise physiology focuses on how the body responds to physical activity.","zh":"运动生理学关注身体如何对体力活动作出反应。"},{"en":"Understanding physiology helps doctors explain symptoms and choose treatments.","zh":"理解生理学能帮助医生解释症状并选择治疗方法。"}]}],"synonyms":["biological function (related)","body function (related)","life processes (related)"],"phonetic":"/ˌfɪziˈɑlədʒi/","extraExplanation":["词源提示：physiology 来自希腊语 physis（“自然”）+ -logy（“学科/研究”），字面意思是“对自然（生命）运作方式的研究”。","易混词区分：physiology（生理学，关注“功能/运作方式”） vs. anatomy（解剖学，关注“结构/形态”）。常见搭配：human physiology（人体生理学）、cell physiology（细胞生理学）、exercise physiology（运动生理学）。"]}
{"word":"physique","summary":{"en":"Physique means a person’s body build or overall physical shape, often used when talking about fitness or appearance.","zh":"Physique 指人的体格或整体身材体型，常用于谈论健身或外形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the shape, build, and general appearance of a person’s body, especially in terms of fitness or attractiveness","zh":"体格；身材；体型（尤指健身程度或外形吸引力）"},"examples":[{"en":"She has a strong, athletic physique from swimming.","zh":"她因为游泳练就了强壮、运动型的身材。"},{"en":"He’s working on his physique by lifting weights and eating well.","zh":"他通过举重和健康饮食来改善体型。"},{"en":"The role requires an actor with a muscular physique.","zh":"这个角色需要身材健壮（肌肉发达）的演员。"}]}],"synonyms":["build","body","figure","frame","body type"],"phonetic":"/fəˈzik/","extraExplanation":["“physique”常用于较正式的语境，强调整体体型与身体线条（尤其与健身、运动表现相关）。日常口语里也常用“body”或“figure”，但“physique”更偏向“体格/健身成果”的感觉。","常见搭配：athletic/lean/muscular/strong physique（运动型/精瘦/肌肉型/强壮的体格）；improve/develop/build one’s physique（改善/塑造身材）。"]}
{"word":"physis","summary":{"en":"Physis means “nature” or an inner principle of natural growth (in philosophy), and it can also mean the growth plate in bones (in medicine).","zh":"Physis 在哲学中指“自然/本性/内在的生成原则”；在医学中也指骨骼的生长板（骨骺板）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) “Nature” as the inner character or essential way something is by itself; the natural order of things.","zh":"（哲学）“自然/本性”：事物自身所具有的内在性质与生成方式；自然界的秩序。"},"examples":[{"en":"For Aristotle, physis is the inner principle that makes a living thing grow and change.","zh":"对亚里士多德来说，physis 是使生物生长并变化的内在原则。"},{"en":"The debate compared what comes from physis (nature) with what comes from human rules.","zh":"这场讨论把源于 physis（自然）的东西与源于人类规则的东西进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy/Medicine) The growth plate (epiphyseal plate) in a child’s long bone, where bone lengthening happens.","zh":"（解剖/医学）骨骺板/生长板：儿童长骨中负责骨骼长长的软骨区。"},"examples":[{"en":"A fracture near the physis can affect future bone growth.","zh":"靠近生长板（physis）的骨折可能影响将来的骨骼生长。"},{"en":"Doctors monitor the physis on X-rays to check whether a bone is still growing.","zh":"医生会通过 X 光观察生长板（physis），判断骨骼是否仍在生长。"}]}],"synonyms":["nature","natural order","essential nature","growth plate","epiphyseal plate"],"phonetic":"/ˈfaɪsɪs/","extraExplanation":["physis 源自古希腊语 φύσις（phýsis），与“生长、生成”有关，所以在哲学语境里常强调“事物从自身出发的生成与本性”，不只是“自然界”这个地点概念。","在古希腊思想中常与 nomos（νόμος，法律/习俗/人为规定）相对，用来讨论“天性 vs. 人为规范”的问题。","医学里把骨骺板称为 physis，是因为它与“生长”直接相关；临床上常见表达如 physeal injury（生长板损伤）。"]}
