{"word":"PHD","summary":{"en":"PhD: a doctoral degree earned through advanced study and original research.","zh":"PhD：通过高阶学习与原创研究获得的博士学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doctoral degree (the highest standard university degree), usually earned after advanced study and original research in a specific field.","zh":"博士学位（大学体系中常见的最高学位），通常通过高阶学习与原创研究在某一领域获得。"},"examples":[{"en":"She earned a PhD in biology and now runs a research lab.","zh":"她获得了生物学博士学位，现在负责一个研究实验室。"},{"en":"It can take four to six years to complete a PhD, depending on the program.","zh":"完成博士学位可能需要四到六年，取决于项目安排。"},{"en":"He’s applying for jobs that require a PhD or equivalent research experience.","zh":"他在申请那些要求博士学位或同等研究经验的工作。"}]}],"synonyms":["doctorate","doctoral degree","DPhil"],"phonetic":"/ˌpi eɪtʃ ˈdi/","extraExplanation":["“PhD”是“Doctor of Philosophy”的缩写，但它并不只指“哲学”专业；在英语国家里，很多学科（如物理、教育、计算机等）的博士学位都叫PhD。","写法上常见“PhD / Ph.D.”两种；复数通常写“PhDs / Ph.D.s”。口语里常说“get a PhD”（读作字母音：P-H-D）。","在部分国家/学校也会看到同类学位写作“DPhil”（如牛津等）。含义基本相同，只是命名传统不同。"]}
{"word":"PhD","summary":{"en":"PhD = Doctor of Philosophy, a doctoral degree earned through advanced research; it can also mean a person who holds this degree.","zh":"PhD 指“哲学博士”，通过高阶研究获得的博士学位；也可指“博士学位持有者”（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctor of Philosophy: the highest common academic degree, earned after advanced research and writing a dissertation in a university field (not only philosophy).","zh":"哲学博士（PhD）：常见的最高学位之一，通常通过深入研究并完成博士论文获得（不只限于哲学专业）。"},"examples":[{"en":"She earned a PhD in chemistry at Stanford.","zh":"她在斯坦福大学获得了化学博士学位。"},{"en":"After his PhD, he became a university professor.","zh":"他获得博士学位后，成了大学教授。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has a PhD (informal).","zh":"拥有博士学位的人（非正式用法）。"},"examples":[{"en":"Our team has two PhDs and three engineers.","zh":"我们团队有两位博士和三位工程师。"},{"en":"He’s a PhD, so he’s used to reading research papers.","zh":"他是博士，所以很习惯读研究论文。"}]}],"synonyms":["doctorate","doctoral degree","Doctor of Philosophy"],"phonetic":"/ˌpiː eɪtʃ ˈdiː/","extraExplanation":["PhD 是缩写，完整形式是 Doctor of Philosophy。虽然字面含“哲学”，但实际可用于几乎所有学科（如 PhD in Physics / Education / Economics）。","书写上常见两种：PhD（更常见，尤其在美国）和 Ph.D.（带点）。复数通常写 PhDs 或 Ph.D.s。","正式场合常写在姓名后：Alex Chen, PhD；称呼上不一定用“Dr.”，是否使用取决于文化、场合与个人偏好。"]}
{"word":"phd","summary":{"en":"A PhD is a doctoral degree earned through advanced study and original research; it can also refer to someone who holds that degree.","zh":"PhD 指通过高阶学习与原创研究获得的博士学位，也可指拥有该学位的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctor of Philosophy: a high-level academic degree usually earned after a master’s degree, based on advanced coursework and original research (a dissertation).","zh":"哲学博士：一种高级学位，通常在硕士之后攻读，通过高阶课程与原创研究（博士论文）获得。"},"examples":[{"en":"She earned a PhD in biology and now leads a research lab.","zh":"她获得了生物学博士学位，现在领导一个研究实验室。"},{"en":"I’m applying to PhD programs in computer science.","zh":"我正在申请计算机科学的博士项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has a PhD degree.","zh":"拥有博士学位的人。"},"examples":[{"en":"Ask a PhD if you need help interpreting the research data.","zh":"如果你需要帮助解读研究数据，可以请教一位博士。"},{"en":"In our team, two people are PhDs and the others are engineers.","zh":"我们团队里有两位是博士，其余是工程师。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a PhD degree or doctoral study (often used before a noun).","zh":"与博士学位或博士学习相关的（常用于名词前作定语）。"},"examples":[{"en":"He’s a PhD student in economics.","zh":"他是经济学博士生。"},{"en":"The university offers PhD-level research training.","zh":"这所大学提供博士层级的研究训练。"}]}],"synonyms":["doctorate","doctoral degree","doctoral"],"phonetic":"ˌpiː eɪtʃ ˈdiː","extraExplanation":["PhD 是 “Doctor of Philosophy” 的缩写，但并不只限于“哲学”专业；许多学科（如生物、物理、计算机、教育等）的博士学位都称为 PhD。","在美式英语中常写作 “a PhD” 或 “a Ph.D.”（带点或不带点都常见）；读作字母 “P-H-D”。","常见搭配：earn/get a PhD（获得博士学位）、pursue a PhD（攻读博士）、PhD program（博士项目）、PhD candidate（博士候选人，通常指通过资格考试后进入论文阶段的人）。"]}

