{"word":"phr","summary":{"en":"“phr” usually means the dictionary label “phrase,” and in technical contexts it can mean “parts per hundred rubber.”","zh":"“phr”通常是词典标注，表示“短语”；在技术语境中也可指“每百份橡胶的份数”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a dictionary label meaning “phrase”; used to mark an expression made of multiple words.","zh":"（缩写）词典中的标注，表示“短语/词组”；用于标出由多个词构成的固定表达。"},"examples":[{"en":"In some dictionaries, “phr.” shows that the entry is a phrase rather than a single word.","zh":"在一些词典里，“phr.”表示该词条是短语，而不是单个词。"},{"en":"Look for “phr.” before the meaning to find common expressions.","zh":"在释义前找“phr.”，可以快速定位常见表达。"}]},{"partOfSpeech":"other","definition":{"en":"(technical) “parts per hundred rubber,” a unit used in rubber and polymer formulas (amount per 100 parts of rubber by weight).","zh":"（技术）“每百份橡胶的份数”，用于橡胶/聚合物配方的单位（按重量以100份橡胶为基准的添加量）。"},"examples":[{"en":"The recipe calls for 5 phr of sulfur.","zh":"该配方需要加入5 phr的硫。"},{"en":"Carbon black is often added at 30–60 phr to improve strength.","zh":"炭黑常以30–60 phr加入，以增强强度。"}]}],"synonyms":["phrase (label)","parts per hundred rubber (technical)"],"phonetic":"/ˌpiː eɪtʃ ˈɑr/","extraExplanation":["“phr.”最常见于词典或学习材料中，作为元信息（label），帮助你判断该条目是否属于固定搭配/习语等“短语”类内容。","在材料工程里，“phr”是配方行业的常用写法，尤其见于橡胶工业（如轮胎配方）。阅读技术文档时要结合上下文判断是哪一种意思。"]}
{"word":"phractamphibia","summary":{"en":"“Phractamphibia” doesn’t appear to be a standard word; it’s likely a misspelling or a made-up term that resembles “Amphibia” (amphibians).","zh":"“phractamphibia”似乎不是标准词汇；更像拼写错误或自造词，外形接近“Amphibia（两栖纲/两栖动物）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word or a widely recognized scientific term. It may be a misspelling, a coined/fictional name, or a specialized label used in a niche context.","zh":"不是标准英语词汇，也不是广泛认可的科学术语。可能是拼写错误、杜撰/虚构名称，或某个小众语境下的专用标签。"},"examples":[{"en":"I couldn’t find “phractamphibia” in major dictionaries—could you share where you saw it?","zh":"我在主要词典里找不到“phractamphibia”——你能说说你在哪里看到的吗？"},{"en":"If you meant “Amphibia,” that’s the animal class that includes frogs and salamanders.","zh":"如果你想表达的是“Amphibia（两栖纲）”，那是包括青蛙和蝾螈在内的一类动物。"}]}],"synonyms":["(none—nonstandard term)"],"phonetic":"/ˌfræk.tæmˈfɪ.bi.ə/","extraExplanation":["从构词上猜，“phract-”可能来自希腊语词根 *phraktos*（意为“被围住的/被保护的”，也常引申为“有装甲的”），而 “amphibia” 指“两栖动物/两栖纲”。所以它看起来像是“装甲两栖类/某种两栖类群”的自造名称，但这只是基于词根的推测，并不等同于正式术语。","如果你告诉我它出现的上下文（例如一段句子、一本书/游戏/论文、或截图），我可以帮你判断：是拼写错误（比如想写 *Amphibia*）、拉丁学名式的拟造分类名，还是某个作品里的专有名词。"]}
{"word":"phragma","summary":{"en":"A rare scientific term meaning a partition or septum-like internal dividing wall.","zh":"一个较少见的科学术语，指隔板/隔膜等“内部的分隔结构”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A partition or internal wall, especially a biological dividing structure (such as a septum) that separates spaces or chambers.","zh":"隔板；隔墙（尤指生物学中的分隔结构，如隔膜/隔板，用来分开空间或腔室）。"},"examples":[{"en":"In some insects, a phragma helps separate internal body spaces and supports muscles.","zh":"在一些昆虫中，phragma 有助于分隔体内空间并支撑肌肉。"},{"en":"The researcher described a thin phragma dividing the chamber into two parts.","zh":"研究者描述了一层薄薄的 phragma，把腔室分成两部分。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a barrier or fence-like structure (a rare, specialized use).","zh":"（更一般、较少见的用法）屏障；栅栏般的阻隔结构。"},"examples":[{"en":"The term comes from an older sense of a barrier rather than a modern everyday word.","zh":"这个词源自“屏障”的较古老含义，而不是现代日常常用词。"}]}],"synonyms":["partition","septum","divider","barrier"],"phonetic":"/ˈfræɡmə/","extraExplanation":["Phragma 是非常专业、偏学术的词，常见于昆虫学、解剖学或形态学文章里；在日常英语中几乎不会用到。","词源来自希腊语短语根，核心意思与“围住、隔开、设障”有关；因此在生物语境里常对应“隔板/隔膜（septum）”“分隔结构（partition）”。","如果你在论文里使用，通常需要结合具体学科给出更精确的译法：如昆虫解剖可译作“背内突/内隔（依具体结构而定）”，植物或一般解剖则常译作“隔板/隔膜”。"]}
{"word":"phragmidium","summary":{"en":"Phragmidium is a genus of rust fungi that commonly infects roses and related plants, causing rust disease symptoms.","zh":"Phragmidium 是一种锈菌属，常感染玫瑰等相关植物并引起锈病症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of rust fungi that infects plants (especially roses and brambles), often causing yellow-orange rust spots on leaves and stems","zh":"一种锈菌属（锈病真菌），会感染植物（尤其是蔷薇科如玫瑰、覆盆子等），常在叶片或茎上造成黄橙色的锈斑"},"examples":[{"en":"The botanist identified the rust on the rose leaves as Phragmidium.","zh":"植物学家把玫瑰叶片上的锈病鉴定为 Phragmidium（锈菌属）。"},{"en":"Some Phragmidium species can weaken plants by reducing photosynthesis.","zh":"某些 Phragmidium 物种会降低光合作用，从而削弱植物长势。"}]}],"synonyms":["rust fungus (general term)","rust (plant disease, general term)"],"phonetic":"/fræɡˈmɪdiəm/","extraExplanation":["这是一个生物学“属名”（genus name），常见于植物病理学、真菌学或园艺资料里；在普通日常英语中很少使用。","词源上来自希腊语词根，常被解释为与“隔膜/分隔”（phragma）有关，呼应这类真菌孢子结构的“分隔”特征。","写作时通常首字母大写并用斜体表示属名：Phragmidium；具体物种名会写成“Phragmidium + species epithet”，如 Phragmidium mucronatum。"]}
{"word":"phragmites","summary":{"en":"Phragmites are tall wetland reeds; the word is often used when discussing dense stands and, in some regions, invasive reed growth.","zh":"Phragmites 指湿地中高大的芦苇；该词常用于描述成片密集生长的芦苇，部分地区也常指入侵性芦苇扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall reed (a type of grass) that grows in wetlands, often forming dense stands","zh":"芦苇属植物（高大的湿地禾草），常成片密集生长"},"examples":[{"en":"Phragmites grows in marshes and along riverbanks.","zh":"芦苇属植物生长在沼泽和河岸边。"},{"en":"Dense phragmites can block sunlight and crowd out other plants.","zh":"茂密的芦苇会挡住阳光并挤占其他植物的生长空间。"}]},{"partOfSpeech":"n.","definition":{"en":"(often used with “invasive”) a non-native phragmites population that spreads quickly and can harm local ecosystems","zh":"（常与“invasive”连用）外来入侵的芦苇种群，扩散很快，可能破坏本地生态"},"examples":[{"en":"The park is removing invasive phragmites to protect native habitat.","zh":"公园正在清除入侵芦苇，以保护本地栖息地。"},{"en":"In some areas, phragmites management includes cutting and careful herbicide use.","zh":"在一些地区，对芦苇的治理包括割除以及谨慎使用除草剂。"}]}],"synonyms":["common reed","reed"],"phonetic":"/fræɡˈmaɪ.tiz/","extraExplanation":["“Phragmites”是学名（属名），常见完整名称是 Phragmites australis（普通芦苇）。日常英语里，人们有时直接说 “phragmites” 来指一大片芦苇，尤其在生态治理、湿地保护语境中。","在北美讨论“invasive phragmites”时，通常指一种扩张很强的外来型（与本地型不同），它会形成高而密的“芦苇墙”，影响鸟类、鱼类和其他湿地植物的多样性。","发音上，许多人会把它读成 “frag-” 开头（类似 fragile 的开头音），这是常见读法；属于比较专业的自然/生态词汇。"]}
{"word":"phragmocone","summary":{"en":"A phragmocone is the chambered part of a cephalopod shell (like ammonites or nautilus) used for buoyancy control.","zh":"phragmocone 指头足类壳体中分成腔室、用于调节浮力的“房锥”部分（如菊石、鹦鹉螺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The chambered (compartmented) internal shell of many extinct cephalopods (such as ammonites) and of the living nautilus; it is divided into gas- and liquid-filled chambers that help with buoyancy.","zh":"（许多已灭绝头足类如菊石，以及现生鹦鹉螺的）内壳“房锥”（分隔成多个腔室的部分）；腔室内含气体与液体，用于调节浮力。"},"examples":[{"en":"In a nautilus, the phragmocone is divided into many chambers that help it control buoyancy.","zh":"在鹦鹉螺中，房锥被分成许多腔室，帮助它控制浮力。"},{"en":"Fossil ammonites often preserve the shape of the phragmocone, showing their spiral chambered shell.","zh":"菊石化石常常保留房锥的形态，能看到它们螺旋状的分室壳结构。"}]}],"synonyms":["chambered shell (part)","camerae (shell chambers)"],"phonetic":"/ˈfræɡməˌkoʊn/","extraExplanation":["“phragmocone”常见于古生物学与动物学资料中，属于较专业的名词。它指的是“分隔成腔室的壳体部分”，这些腔室通过与“虹管/连通管（siphuncle）”相连来调节气液比例，从而影响浮力。","词源上可拆解理解：phragmo- 来自希腊语，和“隔板/分隔（partition）”有关；-cone 表示“锥体/圆锥状结构”。理解词源有助于记忆其“有隔板的锥状壳体”这一核心概念。"]}
{"word":"phragmoconic","summary":{"en":"An academic adjective meaning “related to the chambered (buoyancy) part of a cephalopod shell.”","zh":"学术用形容词，指“与头足类贝壳的隔室（浮力）部分有关的/呈隔室壳形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having, relating to, or shaped like a phragmocone (the chambered, gas-filled part of a cephalopod shell, such as in ammonites or nautiluses).","zh":"具有、与（头足类贝壳的）隔室壳/房室部分（phragmocone，充气的分隔腔体部分）有关的；呈隔室壳形的。"},"examples":[{"en":"The fossil preserves the phragmoconic chambers clearly, with thin walls between each compartment.","zh":"这块化石清楚地保存了隔室壳的腔室结构，每个隔间之间都有薄薄的隔壁。"},{"en":"Researchers compared phragmoconic buoyancy features to understand how the animal could float and dive.","zh":"研究人员比较了隔室壳的浮力特征，以了解这种动物如何上浮和下潜。"}]}],"synonyms":["phragmocone-related","chambered","septate"],"phonetic":"/ˌfræɡməˈkɑnɪk/","extraExplanation":["“Phragmoconic”主要用于古生物学、动物学（尤其是头足类）语境，描述菊石、鹦鹉螺等壳体中由许多隔室组成的那一段结构（phragmocone）。这些隔室通过虹吸管（siphuncle）调节气体与液体比例，从而影响浮力。","词形来源：phragmo-（与“隔、栅栏、隔断”相关的希腊语词根）+ -conic（圆锥形的）。很多相关形容词在学术写作中会以 -ic 结尾。"]}
{"word":"phragmocyttares","summary":{"en":"Probably intended: phagocyte—an immune cell that engulfs and destroys harmful particles.","zh":"可能想查的是：phagocyte（吞噬细胞）——能吞噬并清除有害颗粒的免疫细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling. The closest common English term is phagocyte: a type of immune cell that engulfs and breaks down bacteria, dead cells, and other harmful particles.","zh":"很可能是拼写错误。最接近、常见的英语词是 phagocyte：一种免疫细胞，能“吞噬”并分解细菌、死亡细胞和其他有害颗粒。"},"examples":[{"en":"Macrophages are phagocytes that help clean up infected tissue.","zh":"巨噬细胞是一类吞噬细胞，能帮助清理受感染的组织。"},{"en":"Phagocytes protect the body by engulfing bacteria.","zh":"吞噬细胞通过吞噬细菌来保护身体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related meaning (adjective use in science): phagocytic—able to engulf particles (describing cells or processes).","zh":"相关含义（科学中的形容词用法）：phagocytic（吞噬性的）——能够吞噬颗粒（描述细胞或过程）。"},"examples":[{"en":"Neutrophils have strong phagocytic activity.","zh":"中性粒细胞具有很强的吞噬活性。"}]}],"synonyms":["macrophage","neutrophil","white blood cell"],"phonetic":"/ˈfæɡəˌsaɪt/","extraExplanation":["你输入的“phragmocyttares”不是常见英语词形，可能是把 **phagocytaires（法语，意为“吞噬细胞的/吞噬细胞相关的”）** 或 **phagocytes** 拼错了。","词源提示：**phago-** 来自希腊语，意思是“吃、吞”；**-cyte** 表示“细胞”。因此 phagocyte 字面意思接近“会吞吃的细胞”。如果你能提供原句/领域（医学、免疫学、法语资料等），我可以更精确地判断你想查的词。"]}
{"word":"phragmocyttarous","summary":{"en":"“Phragmocyttarous” is not a standard English word; it is probably a misspelling of a biology term meaning “phagocytic / related to phagocytosis.”","zh":"“phragmocyttarous” 不是标准英语词；很可能是生物学术语的拼写错误，想表达“吞噬性的 / 与吞噬作用相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard/rare term; likely a misspelling. It does not appear in major English dictionaries. It may be intended to mean “relating to phagocytosis / phagocytic (cells that engulf particles),” similar to **phagocytic** or **phagocytary**.","zh":"非标准/极罕见用词；在主流英语词典中通常查不到，可能是拼写错误。很可能想表达“与吞噬作用有关 / 具吞噬功能的（细胞能吞入颗粒）”，接近 **phagocytic** 或 **phagocytary** 的意思。"},"examples":[{"en":"This word is not standard; in biology, you probably want “phagocytic cells.”","zh":"这个词不是标准用法；在生物学语境里你大概想说“phagocytic cells（吞噬细胞）”。"},{"en":"Macrophages are phagocytic—they engulf bacteria and dead cells.","zh":"巨噬细胞是 phagocytic 的——它们会吞噬细菌和死亡细胞。"}]}],"synonyms":["phagocytic","phagocytary","phagocyte-related"],"phonetic":"/ˌfræɡmoʊˌsaɪˈtɛrəs/","extraExplanation":["这个拼写里出现的 **phragmo-** 并不常见；更常见的前缀是 **phago-**（源自希腊语，意为“吃/吞”），构成 **phagocytosis / phagocytic** 等术语。","如果你能提供来源句子（例如论文、教材或截图），我可以根据上下文判断它到底想表达哪个专业词：常见候选包括 **phagocytic**（具吞噬作用的）、**phagocytary**（与吞噬细胞相关的，较少见）、或 **phagocytosis**（名词：吞噬作用）。"]}
{"word":"phragmoid","summary":{"en":"Phragmoid (rare) means ‘partitioned or divided by cross-walls into compartments.’","zh":"phragmoid（罕见）指“有隔板/横隔、被分隔成多个小室的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having partitions or cross-walls; divided into compartments; septate.","zh":"（罕见）有隔板的；被隔开成多个小室的；具横隔的。"},"examples":[{"en":"Under the microscope, the filament looks phragmoid, with clear cross-walls between cells.","zh":"在显微镜下，这条丝状体呈现出“phragmoid”的特征，细胞之间有清晰的横隔。"},{"en":"Some older botanical texts describe certain algae as phragmoid when their cells are strongly compartmentalized.","zh":"一些较早的植物学文献会用 phragmoid 来形容某些藻类的细胞分隔很明显。"}]}],"synonyms":["septate","partitioned","compartmentalized","segmented"],"phonetic":"/ˈfræɡ.mɔɪd/","extraExplanation":["这是一个非常少见、偏学术（尤其是生物学/植物学描述）用词。","词源上可追溯到希腊语词根 *phrag-*（与“围栏、隔断”相关）+ *-oid*（“……样的/类似……的”），整体含义就是“像隔断/隔板一样的”。","在现代英语中更常见的替代说法有 **septate**（有隔膜的）、**partitioned**（被分隔的）、**compartmentalized**（分隔成小室的）。"]}
{"word":"phragmoplast","summary":{"en":"A plant-cell structure that guides formation of the cell plate and new cell wall during cytokinesis.","zh":"植物细胞胞质分裂时引导细胞板与新细胞壁形成的结构（成膜体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure made of microtubules, actin filaments, and membranes that forms during plant cell division and guides the building of the new cell wall (cell plate) between two daughter cells.","zh":"（植物细胞分裂时形成的）成膜体：由微管、肌动蛋白丝和膜结构组成，在胞质分裂过程中引导细胞板形成，从而在两个子细胞之间建立新的细胞壁。"},"examples":[{"en":"In many plant cells, the phragmoplast appears after mitosis and helps assemble the cell plate.","zh":"在许多植物细胞中，成膜体在有丝分裂之后出现，并帮助组装细胞板。"},{"en":"Researchers used fluorescence microscopy to track microtubules in the phragmoplast.","zh":"研究人员使用荧光显微镜追踪成膜体中的微管。"}]}],"synonyms":["cell-plate apparatus (contextual)"],"phonetic":"/ˈfræɡməˌplæst/","extraExplanation":["“phragmoplast”主要用于细胞生物学与植物学语境，和动物细胞常见的“cleavage furrow（分裂沟）”不同：植物细胞因为有细胞壁，通常通过“cell plate（细胞板）”由内向外生成新的隔墙。","词源可拆解理解：phragmo-（与“隔断/屏障”相关）+ -plast（形成/构建的结构），有助于记忆其功能是“构建隔墙”。","常见相关词：cell plate（细胞板）、cytokinesis（胞质分裂）、microtubule（微管）、actin filament（肌动蛋白丝）。"]}
{"word":"phragmosis","summary":{"en":"Phragmosis is a scientific term for closing or blocking an opening by forming a partition or plug.","zh":"Phragmosis 是一个科学术语，指通过形成隔膜或栓塞来关闭或堵塞某个开口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the closing or blocking of an opening (such as a pore, tube, or cavity) by the formation of a partition or plug.","zh":"（生物学用语）通过形成隔膜、隔板或“塞子”来关闭或堵塞某个开口（如孔、管道或腔）。"},"examples":[{"en":"In some plants, phragmosis can reduce water loss by sealing microscopic openings.","zh":"在一些植物中，phragmosis 可能通过封闭微小开口来减少水分流失。"},{"en":"The researcher described phragmosis as a structural way to block the passage when conditions are unfavorable.","zh":"研究者将 phragmosis 描述为一种在环境不利时阻断通道的结构性方式。"}]}],"synonyms":["occlusion","blockage","closure","obstruction"],"phonetic":"/fræɡˈmoʊsɪs/","extraExplanation":["这是一个很少见的专业词，多见于植物学/显微结构描述中，用来指“开口被隔膜或栓塞封住”的现象。","词源上来自希腊语词根 *phrag-*（意为“围住、堵住、隔开”），与 *diaphragm*（隔膜）和 *phragm-*（隔板/隔断）同源。","在学术写作里，它通常用于解释某种组织如何形成“屏障”，以保护、隔离或调节流体/气体通过；日常英语几乎不用。"]}
{"word":"phrampel","summary":{"en":"“phrampel” isn’t recognized as a standard English word; it’s probably a misspelling or a proper name.","zh":"“phrampel”不是标准英语词汇；更可能是拼写错误或专有名词（如人名/网名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username.","zh":"不是标准英语单词；很可能是拼写错误，或是人名/网名。"},"examples":[{"en":"I couldn’t find “phrampel” in a dictionary—did you mean “trample” or “scramble”?","zh":"我在词典里找不到“phrampel”——你是不是想写“trample（践踏）”或“scramble（争抢/打乱）”？﻿"},{"en":"If “phrampel” is a brand or a person’s name, it may not have a dictionary definition.","zh":"如果“phrampel”是品牌名或人名，它可能没有词典释义。"}]}],"phonetic":"ˈfræmpəl","extraExplanation":["“phr-”这个开头在英语里不常见，最典型的是源自希腊语的组合，如 photo-, phrase- 等；但“phrampel”整体不像常见构词。","如果你能提供：1）这词出现的句子/上下文，2）你想表达的中文意思，或 3）是否来自游戏/社交媒体/某个作品，我可以更准确判断你要查的词。","可能的近似目标词（按拼写相近）：trample（践踏）、scramble（争抢/攀爬/打乱）、ramble（漫谈/漫步）、frantic（疯狂慌乱的，词形不近但意义可能被误记）。"]}
{"word":"phrarisaical","summary":{"en":"Pharisaical means hypocritically moral or religious—strict about rules and judging others, often more for appearances than sincerity.","zh":"pharisaical 指“伪善/假道学、道德优越感强”，强调规矩与外表而缺乏真诚，并常用来指责爱评判他人的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hypocritically religious or moral; focusing on strict rules and appearances instead of genuine goodness.","zh":"（贬义）伪善的、假道学的；过度强调规矩与表面道德，而缺乏真诚的善意。"},"examples":[{"en":"He sounded pharisaical when he scolded others for small mistakes but ignored his own.","zh":"他责骂别人一点小错却对自己的问题视而不见，听起来很“假道学”。"},{"en":"Her pharisaical comments about “proper behavior” made everyone uncomfortable.","zh":"她对“得体行为”的假道学式评论让大家都很不自在."}]},{"partOfSpeech":"adj.","definition":{"en":"Overly self-righteous; acting as if you are morally better than other people.","zh":"自以为是的、道德优越感强的；摆出比别人更“正”的姿态。"},"examples":[{"en":"Try not to be pharisaical about other people’s choices.","zh":"别用道德优越感去评判别人的选择。"},{"en":"The essay criticizes a pharisaical attitude toward the poor.","zh":"这篇文章批评了对穷人抱有道德优越感的态度。"}]}],"synonyms":["hypocritical","sanctimonious","self-righteous","holier-than-thou","judgmental"],"phonetic":"/ˌfɛrɪˈseɪɪkəl/","extraExplanation":["“pharisaical”来自“Pharisee（法利赛人）”。法利赛人是古代犹太教中的一个群体，在《新约》中常被描写为过度强调律法细节、在公众面前表现虔诚却缺乏内心真诚，因此英语里这个词逐渐带上“伪善、假道学”的贬义。需要注意：这是英语文化语境中的固定用法，并不等同于对现代犹太教或犹太人的评价。"]}
{"word":"phrasable","summary":{"en":"“Phrasable” means “able to be expressed in words or phrased clearly.”","zh":"“phrasable”表示“能用语言表达/能用清楚措辞表述”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be expressed in words; able to be put into a particular form of wording.","zh":"可以用语言表达的；可以用某种措辞表述的。"},"examples":[{"en":"Her feelings weren’t easily phrasable, so she stayed quiet.","zh":"她的感受不太容易用语言表达，所以她保持沉默。"},{"en":"Try to make your goal clear and phrasable in one sentence.","zh":"尽量把你的目标说清楚，并能用一句话表述出来。"},{"en":"Some experiences are real but not fully phrasable.","zh":"有些经历是真实的，但很难完全用语言说尽。"}]}],"synonyms":["expressible","articulable","put into words","sayable"],"phonetic":"/ˈfreɪzəbəl/","extraExplanation":["“phrasable”由“phrase（措辞/短语）+ -able（能够……的）”构成，意思接近“expressible / put into words”。在日常英语里更常见的说法是“can be phrased”或“expressible”；“phrasable”相对少见，更偏书面或说明性的用法。"]}
{"word":"phrasal","summary":{"en":"Phrasal means “related to phrases,” especially in grammar (e.g., phrasal verbs).","zh":"phrasal 表示“与短语有关的”，尤用于语法语境（如动词短语 phrasal verb）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a phrase (a group of words that acts as a unit in grammar or meaning).","zh":"与“短语”（在语法或意义上作为整体的一组词）有关的。"},"examples":[{"en":"In this lesson, we focus on phrasal patterns like “a cup of tea” and “in front of.”","zh":"这节课我们重点学习短语结构，比如“a cup of tea”和“in front of”。"},{"en":"The textbook has a section on phrasal structure in English sentences.","zh":"这本教材有一章讲英语句子的短语结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used especially in the term “phrasal verb,” meaning a verb + particle (like up, out, off) whose meaning is often different from the base verb.","zh":"常用于术语“phrasal verb（动词短语）”，指“动词 + 小品词/介词副词（如 up, out, off）”，其整体意思常与原动词不同。"},"examples":[{"en":"“Look up” is a phrasal verb that can mean “search for information.”","zh":"“look up”是一个动词短语，可以表示“查找信息”。"},{"en":"Many learners find phrasal verbs challenging because the meaning isn’t always literal.","zh":"很多学习者觉得动词短语很难，因为意思不一定是字面意思。"}]}],"synonyms":["phrase-based","idiomatic (in some contexts)","multiword (in some contexts)"],"phonetic":"/ˈfreɪzəl/","extraExplanation":["“phrasal”在日常口语中不算常用，更多出现在语言学、语法讲解或教材里（如：phrasal verb, phrasal structure）。","在英语课堂里，“phrasal verb（动词短语）”非常常见：例如 turn on（打开）、give up（放弃）、pick up（捡起/接某人/学会）。同一个动词加不同小品词，意思可能变化很大。"]}
{"word":"phrasal verb","summary":{"en":"A verb + particle combination whose meaning often differs from the base verb (e.g., “look up,” “give in”).","zh":"由动词加小品词构成、整体意义常不同于原动词的结构（如 look up, give in）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A verb combined with a particle (an adverb or preposition), creating a meaning that is often different from the verb alone (e.g., “look up,” “give in,” “take off”).","zh":"由“动词 + 小品词（副词或介词）”构成的动词短语，整体意思常常不同于动词本身（如 look up, give in, take off）。"},"examples":[{"en":"In English, many common daily actions are expressed with phrasal verbs like “wake up” and “sit down.”","zh":"在英语中，很多日常动作常用短语动词表达，比如 wake up（醒来）和 sit down（坐下）。"},{"en":"“Turn off” means to stop a machine from working, not just to “turn.”","zh":"turn off 表示“关掉（电器等）”，不只是“转动（turn）”。"},{"en":"Some phrasal verbs are separable: you can say “turn the light off” or “turn off the light.”","zh":"有些短语动词可分开：可以说 turn the light off，也可以说 turn off the light。"}]}],"synonyms":["multi-word verb","verb phrase (in some contexts)"],"phonetic":"/ˈfreɪzəl vɝb/","extraExplanation":["“短语动词（phrasal verb）”在口语和非正式写作中特别常见，往往比同义的拉丁来源动词更自然：比如 put off（推迟）比 postpone 更口语。","常见分类：\n1) 可分离（separable）：turn off the TV / turn the TV off（代词必须放中间：turn it off）。\n2) 不可分离（inseparable）：look after sb（不能说 look sb after）。\n3) 及物/不及物：give up smoking（及物） vs get up（不及物）。","学习建议：把短语动词当作“一个词”来记忆，并用短句反复练习；同时注意搭配的名词/代词位置规则。"]}
{"word":"phrasally","summary":{"en":"“Phrasally” means “in a phrasal (phrase-based) way,” often used when describing how to read, speak, or analyze language.","zh":"“phrasally”表示“以短语/意群为单位地（按短语方式）”，常用于描述朗读、表达或语言分析方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a phrasal way; using or relating to phrases (groups of words).","zh":"以短语的方式；与短语（词组）有关地。"},"examples":[{"en":"The teacher explained the sentence phrasally, focusing on each phrase rather than each word.","zh":"老师用“按短语”的方式讲解句子，侧重每个词组而不是每个单词。"},{"en":"To sound more natural, try to read phrasally instead of stopping after every word.","zh":"为了听起来更自然，尽量按短语来朗读，不要每个词都停顿。"}]}],"synonyms":["in phrases","phrase by phrase","in a phrasal way"],"phonetic":"/ˈfreɪzəli/","extraExplanation":["“phrasally”在日常英语里很少见，更常用的是“in phrases / phrase by phrase / in a phrasal way”。在语言学习与朗读训练中，“read/speak phrasally（按意群/短语来读/说）”这个用法比较实用。","相关词：phrasal（adj. 短语的；短语动词的），phrase（n./v. 短语；措辞）。"]}
{"word":"phrase","summary":{"en":"“Phrase” most often means a group of words used together as a unit, or a common expression; as a verb, it means to express something with chosen wording.","zh":"“phrase” 常指“短语/词组”或“常用表达”；作动词时表示“措辞、用某种方式表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of words that functions as a unit in a sentence, but usually does not form a complete sentence by itself.","zh":"（语法）短语：在句子中作为一个整体发挥作用的一组词，但通常本身不构成完整句子。"},"examples":[{"en":"“In the morning” is a phrase that tells when something happens.","zh":"“in the morning” 是一个表示时间的短语。"},{"en":"A sentence can contain many phrases.","zh":"一个句子可以包含很多短语。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular expression or set of words, especially one that is commonly used.","zh":"（常用表达）固定说法/措辞：某个特定的表达方式，尤其是常见的说法。"},"examples":[{"en":"“How are you?” is a common phrase in English.","zh":"“How are you?” 是英语里很常见的表达。"},{"en":"Try not to repeat the same phrase too often in your writing.","zh":"写作时尽量不要太频繁重复同一个措辞。"}]},{"partOfSpeech":"v.","definition":{"en":"To express something in a particular way; to choose specific words.","zh":"（动词）措辞/表达：用某种方式说；选择特定用词来表达。"},"examples":[{"en":"She phrased her request politely.","zh":"她把请求说得很客气。"},{"en":"How should I phrase this email to my teacher?","zh":"我该怎么措辞写给老师的这封邮件？"}]}],"synonyms":["expression","wording","group of words","term"],"phonetic":"/freɪz/","extraExplanation":["在英语学习里，phrase 常见于语法分类：例如 noun phrase（名词短语）、verb phrase（动词短语）、prepositional phrase（介词短语）。它们不是“完整句子”，但能在句子里充当某种成分（主语、宾语、状语等）。","日常说“a phrase”也常指“固定表达/常用说法”，这时含义更接近 expression。比如：“Nice to meet you” 也可以被称作一个 phrase。"]}
{"word":"phraseable","summary":{"en":"“Phraseable” means able to be put into words or expressed as a phrase.","zh":"“Phraseable”指“能用语言表达出来/能用一句话说清”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be expressed clearly in words; easy to put into a phrase or sentence.","zh":"（想法、感受等）能够用语言表达出来的；容易用一句话说清的。"},"examples":[{"en":"The feeling was hard to describe, but eventually it became phraseable.","zh":"那种感觉很难形容，但最终还是能用语言表达出来了。"},{"en":"Try to make your goal phraseable in one sentence.","zh":"试着把你的目标用一句话说清楚。"},{"en":"Some experiences are not fully phraseable, even with careful writing.","zh":"有些经历即使再认真写，也无法完全用语言说出来。"}]}],"synonyms":["expressible","articulable","verbalizable","put into words"],"phonetic":"/ˈfreɪzəbəl/","extraExplanation":["“phraseable”不是特别常见，但在写作、心理表达、学术讨论中偶尔会用到，强调“能否被措辞出来”。常见搭配有：phraseable idea（可表述的想法）、phraseable in words（一言以蔽之/用语言说得出）。","它常和“inexpressible / unphraseable（难以言表的）”形成对比，用来讨论情绪、体验或复杂概念是否能被语言准确表达。"]}
{"word":"phrasebook","summary":{"en":"A phrasebook is a list of useful phrases—especially for travel or for a specific situation.","zh":"phrasebook 指收录常用表达的手册，常用于旅行或特定场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small book (or app section) that lists useful words and common expressions in another language, usually with translations and pronunciation help, for travelers.","zh":"（旅行常用的）会话手册；常用语手册（通常提供翻译和发音提示）。"},"examples":[{"en":"I bought a Japanese phrasebook before my trip to Tokyo.","zh":"去东京旅行前，我买了一本日语会话手册。"},{"en":"This phrasebook includes audio so you can practice pronunciation.","zh":"这本会话手册带音频，你可以练习发音。"},{"en":"When I got lost, the phrasebook helped me ask for directions.","zh":"我迷路时，会话手册帮我问路。"}]},{"partOfSpeech":"n.","definition":{"en":"A collection of ready-to-use phrases for a specific situation or style, such as business, customer service, or writing.","zh":"（特定场景/风格的）常用语合集；固定表达集（如商务、客服或写作用语）。"},"examples":[{"en":"Our customer-service phrasebook helps new staff respond politely.","zh":"我们的客服常用语合集能帮助新员工礼貌回复。"},{"en":"Writers sometimes build a personal phrasebook of useful expressions.","zh":"写作者有时会建立自己的常用表达库。"}]}],"synonyms":["conversation guide","travel phrasebook","language guide","phrase list"],"phonetic":"/ˈfreɪzˌbʊk/","extraExplanation":["“Phrasebook”常见于旅行语境，典型内容包括问路、点餐、住宿、紧急情况等。现代也常指App里的“常用语/对话”栏目。","词源上由“phrase（短语）+ book（书）”构成，字面意思就是“装短语的书”。"]}
{"word":"phrased","summary":{"en":"“Phrased” means ‘worded’—expressed in particular words, or described as being written/said in a certain way.","zh":"“phrased”意思是“措辞/表述”：用特定词语表达，或指某句话是以某种方式写/说出来的。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to express or write something using particular words; to word something in a certain way","zh":"用某种措辞表达；以某种方式措辞（说/写）"},"examples":[{"en":"Could you phrase that more politely?","zh":"你能把那句话说得更礼貌一点吗？"},{"en":"The email was carefully phrased to avoid blame.","zh":"这封邮件措辞谨慎，以避免指责。"}]},{"partOfSpeech":"adj.","definition":{"en":"expressed or written in a particular way (past participle/adjective use)","zh":"（句子/说法）以某种方式表述的；措辞……的（过去分词作形容词用）"},"examples":[{"en":"It’s badly phrased and easy to misunderstand.","zh":"这句话措辞不好，容易被误解。"},{"en":"The question is clearly phrased.","zh":"这个问题表述得很清楚。"}]}],"synonyms":["worded","expressed","put (it)","stated","articulated"],"phonetic":"/freɪzd/","extraExplanation":["“phrased”来自动词“phrase”（给……措辞）。在日常英语里，常见搭配有：phrase a question（把问题怎么表述）、phrase it differently（换个说法）、well/poorly phrased（措辞好/差）、carefully phrased（措辞谨慎）。","当你看到“as phrased”通常表示“按目前这种表述/按原话来说”，比如：The statement, as phrased, could be misleading（这句话按现在的表述可能会误导人）。"]}
{"word":"phraseless","summary":{"en":"“Phraseless” means lacking words or set phrases—hard to put into language (rare).","zh":"phraseless 指“缺少言语/措辞、难以用语言表达的”（较罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Not expressed in words or set phrases; lacking phrases or conventional wording.","zh":"（罕见）不用言语或固定措辞来表达的；缺少（套）话/惯用语的。"},"examples":[{"en":"His grief was so deep it felt almost phraseless.","zh":"他的悲伤太深了，几乎到了无法用言语表达的地步。"},{"en":"She gave a phraseless nod instead of an explanation.","zh":"她没有解释，只是无言地点了点头。"},{"en":"The poem aims for a phraseless simplicity—few words, strong feeling.","zh":"这首诗追求一种近乎“无措辞”的简洁——字少而情感强。"}]}],"synonyms":["wordless","inexpressible","unspeakable","unutterable"],"phonetic":"/ˈfreɪz.ləs/","extraExplanation":["这个词由 phrase（短语/措辞）+ -less（没有……的）构成，含义直观，但在现代英语中非常少见。日常表达里更常用的说法是 wordless（无言的）、inexpressible（难以言表的）、at a loss for words（说不出话来）。","在文学语境中，phraseless 往往带有“情感或体验超出语言框架”的意味，比单纯的 silent（沉默的）更强调“语言不够用”。"]}
{"word":"phrasem","summary":{"en":"“Phrasem” is not standard spelling; you may mean “phraseme” (a fixed multi-word expression) or “phrase” (a group of words used together).","zh":"“phrasem”不是标准拼写；你可能想写“phraseme”（固定语/短语单位）或“phrase”（短语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a fixed or semi-fixed multi-word expression that functions as a single unit in meaning or usage (e.g., idioms, collocations).","zh":"（可能是你想写的词）“固定语/短语单位”：由多个词组成、在意义或用法上像一个整体来使用的固定或半固定表达（如习语、搭配）。"},"examples":[{"en":"“Kick the bucket” is a phraseme meaning “to die.”","zh":"“kick the bucket”是一个phraseme，意思是“去世”。"},{"en":"“Make a decision” is a common phraseme (a typical word partnership).","zh":"“make a decision”是常见的phraseme（典型词语搭配）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal/typo) If you meant “phrase,” it means a group of words that work together as a unit in a sentence.","zh":"（非正式/可能是拼写错误）如果你想写的是“phrase”，它指句子中作为一个单位共同起作用的一组词。"},"examples":[{"en":"In the phrase “the tall building,” “tall” describes “building.”","zh":"在短语“the tall building”中，“tall”修饰“building”。"},{"en":"Try learning useful phrases for travel, like “Could you help me?”","zh":"可以学习一些旅行常用短语，比如“Could you help me?”（你能帮我吗？）。"}]}],"synonyms":["fixed expression","set phrase","formulaic expression","idiom","collocation"],"phonetic":"/ˈfreɪziːm/","extraExplanation":["“phraseme”常见于语言学/词汇学研究中，强调“多词但像一个词一样使用”的单位，范围比idiom（习语）更广：既包含完全不可直译的习语，也包含较可预测但固定的搭配（collocation），以及固定句型/套语（formulaic expressions）。","如果你是想查“phrasal verb”（短语动词，如“look up / give up”），告诉我具体词组，我可以按用法和例句详细解释。"]}
{"word":"phrasemake","summary":{"en":"“Phrase-make” is a rare, nonstandard verb meaning “to coin/create a phrase,” often better expressed with “coin a phrase,” “come up with a phrase,” or “phrase/word.”","zh":"“Phrase-make”是少见且不太标准的动词，表示“造一个说法/创造短语”，更自然的说法是“coin a phrase / come up with a phrase”或直接用“phrase/word（措辞）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/rare) To create or coin a phrase; to come up with a particular wording.","zh":"（非标准/少见）造一个说法；创造或想出一个短语/措辞。"},"examples":[{"en":"He tried to phrase-make a catchy slogan for the campaign.","zh":"他试图为竞选活动造一个朗朗上口的口号。"},{"en":"Writers sometimes phrase-make to express new ideas in fresh ways.","zh":"作家有时会“造说法”，用新鲜的表达方式来呈现新想法。"}]},{"partOfSpeech":"vt.","definition":{"en":"(More common meaning expressed with other verbs) To word something in a particular way; to express an idea with specific phrasing.","zh":"（更常用的意思通常用其他动词表达）以某种方式措辞；用特定说法表达一个意思。"},"examples":[{"en":"Could you phrase that more politely?","zh":"你能把那句话说得更礼貌一点吗？"},{"en":"The email was phrased carefully to avoid misunderstanding.","zh":"这封邮件的措辞很谨慎，以避免误解。"}]}],"synonyms":["coin a phrase","come up with a phrase","create a slogan","word","phrase"],"phonetic":"/ˈfreɪzmeɪk/","extraExplanation":["“phrasemake/phrase-make”不是常见或标准词汇，母语者更常说：coin a phrase（造词/造句式表达）、come up with a phrase（想出一个说法）、create a slogan（创作口号）、or simply phrase / word（措辞/表达）。如果你在写作或考试中使用，建议改用这些更自然的表达。"]}
{"word":"phrasemaker","summary":{"en":"A phrasemaker is a person or tool that creates phrases, especially catchy or useful expressions.","zh":"phrasemaker 指创造短语/表达的人或工具，尤其是生成好用或朗朗上口的措辞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or tool (often a software feature) that creates ready-made phrases, especially for writing, speaking, marketing, or language learning.","zh":"短语生成者；（常指软件功能的）短语生成工具，用来制作现成的表达，常用于写作、口语、营销或语言学习。"},"examples":[{"en":"The app includes a phrasemaker that helps beginners write polite emails.","zh":"这个应用内置短语生成器，帮助初学者写出礼貌的邮件。"},{"en":"As a copywriter, she uses a phrasemaker to draft slogans faster.","zh":"作为文案，她用短语生成工具更快起草广告语。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is good at inventing memorable expressions or catchy wording.","zh":"善于创造令人印象深刻的说法或“金句”的人。"},"examples":[{"en":"He’s a natural phrasemaker—his lines are easy to remember.","zh":"他很会造句，他说的话很容易被记住。"},{"en":"The novelist was praised as a brilliant phrasemaker.","zh":"这位小说家被称赞为出色的表达创造者。"}]}],"synonyms":["phrase-maker","phrase generator","wordsmith","turner of phrase","copywriting tool"],"phonetic":"/ˈfreɪzˌmeɪkɚ/","extraExplanation":["“phrasemaker”不是特别常见的标准词，更常见的写法是带连字符的“phrase-maker”，或用更具体的词如“phrase generator（短语生成器）”“copywriting tool（文案工具）”“wordsmith（遣词高手）”。","在正式写作中，如果指软件功能，建议用“phrase generator”；如果指人，语气更自然的近义词包括“wordsmith”“turner of phrase（善于措辞的人）”。"]}
{"word":"phrasemaking","summary":{"en":"Phrasemaking means creating or polishing phrases—often for effect; it can also mean musical phrasing.","zh":"Phrasemaking 指造句／措辞（常为追求表达效果）；也可指音乐中的乐句处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or skill of making or choosing phrases (especially to sound impressive or persuasive); sometimes used negatively to mean empty or showy wording.","zh":"造句／措辞的行为或技巧（尤其指为了听起来有说服力或很“漂亮”的表达）；有时带贬义，指华而不实的辞藻。"},"examples":[{"en":"The campaign speech was full of phrase-making but short on real plans.","zh":"这篇竞选演说辞藻很多，但缺少真正的计划。"},{"en":"Good phrase-making can make a simple idea feel clear and memorable.","zh":"好的措辞能让简单的观点更清晰、更好记。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) the shaping of musical phrases—how a performer groups notes and uses timing, emphasis, and breathing to create a clear musical line.","zh":"（音乐）乐句处理：演奏者如何把音符分组，并用速度、重音与呼吸等方式塑造清晰的乐句线条。"},"examples":[{"en":"Her phrase-making in the slow movement was calm and expressive.","zh":"她在慢乐章的乐句处理沉稳而富有表现力。"},{"en":"The teacher asked the student to listen for phrase-making, not just correct notes.","zh":"老师要求学生不仅要弹对音，还要听出乐句的处理。"}]}],"synonyms":["phrasing","wording","rhetoric","verbal styling","(music) phrasing"],"phonetic":"/ˈfreɪzˌmeɪkɪŋ/","extraExplanation":["“phrasemaking / phrase-making”在现代英语里不算高频词，更常见的表达是“wording”“phrasing”“rhetoric”。写作中也常写成带连字符的“phrase-making”。","在批评语境里，它常暗示“讲得漂亮但内容空”（类似中文的“堆砌辞藻”“空话套话”）。","音乐语境中的“phrase-making”更接近“phrasing（乐句法）”，强调音乐线条与呼吸感。"]}
{"word":"phraseman","summary":{"en":"“Phraseman” (rare) means a person who tends to use catchy phrases or slogans.","zh":"“phraseman”（少见）指爱用口头禅/金句/口号的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A person known for using catchy phrases or clever wording; a “catchphrase guy.”","zh":"（非正式，少见）以口头禅、金句或巧妙措辞出名的人；“爱说金句的人”。"},"examples":[{"en":"In meetings he turns into a real phraseman, dropping slogans instead of details.","zh":"开会时他就成了“金句男”，只会抛口号不讲细节。"},{"en":"She’s not a phraseman—she explains things plainly.","zh":"她不是那种爱抛金句的人——她会把事情讲清楚。"}]}],"synonyms":["catchphrase guy","slogan-spinner","wordsmith","smooth talker"],"phonetic":"/ˈfreɪz.mæn/","extraExplanation":["“phraseman”不是常见标准词，更像是把 phrase（短语/措辞）+ man（某种人）临时拼出来的口语化用法。写作或正式场合更常用：catchphrase guy、slogan-spinner（偏批评）、wordsmith（偏褒义）、smooth talker（偏贬义）。","如果你本来想查的是“phrase”（短语）或“phrasal verb”（短语动词），告诉我你的语境/句子，我可以给更准确的词条与用法。"]}
{"word":"phrasemonger","summary":{"en":"A (usually critical) word for someone who sells or relies on catchy but empty phrases.","zh":"（多为贬义）指依赖或兜售“好听但空洞”的口号与措辞的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who sells or promotes catchy phrases or empty, fashionable expressions, often without real substance.","zh":"（常带贬义）兜售或鼓吹时髦口号、空洞说法的人，强调“好听但没内容”。"},"examples":[{"en":"Some critics called the politician a phrasemonger who avoided giving clear plans.","zh":"一些评论家称那位政客是“口号贩子”，总是回避提出明确方案。"},{"en":"The ad sounded clever, but it felt like it was written by a phrasemonger.","zh":"那则广告听起来很机灵，但感觉像是“金句堆砌”，缺乏实质内容。"}]}],"synonyms":["rhetorician (often critical in context)","cliché peddler","purveyor of platitudes","windbag (informal)"],"phonetic":"/ˈfreɪzˌmʌŋɡər/","extraExplanation":["这个词由 phrase（短语、措辞）+ -monger（贩卖者）构成。-monger 常见于贬义词中，表示“兜售/散布某物的人”，如 fishmonger（鱼贩）、scaremonger（散布恐慌的人）、warmonger（战争贩子）。因此 phrasemonger 通常带批评意味，暗示对方只会用漂亮话包装观点。","使用场景多见于评论、社论或文学式写作中，语气比 “someone who uses clichés” 更尖刻，更强调“推销话术/制造话语而不提供内容”。","近义表达可对比：spin doctor（公关“话术专家”，偏政治媒体语境）、speechmaker（中性：演讲者/演说家）、cliché-ridden（形容用陈词滥调很多）。"]}
{"word":"phrasemongering","summary":{"en":"Phrasemongering means using showy, empty phrases instead of clear, meaningful language.","zh":"phrasemongering 指用华丽但空泛的措辞堆砌表达，缺少清晰、有信息量的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of using lots of impressive-sounding phrases (often empty or vague) instead of clear, meaningful language; wordy rhetoric.","zh":"用一堆听起来华丽但内容空泛或含糊的措辞来代替清晰表达；堆砌辞藻的修辞作风。"},"examples":[{"en":"The article was full of phrasemongering, but it didn’t explain the problem clearly.","zh":"这篇文章堆满了辞藻，但并没有把问题讲清楚。"},{"en":"Her manager asked for fewer buzzwords and less phrasemongering in the report.","zh":"她的经理要求报告里少用流行术语，别再堆砌空话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using or characterized by empty, showy phrasing rather than plain meaning.","zh":"（语言风格）喜欢用空洞、炫耀性的措辞，而不重视朴实的意义。"},"examples":[{"en":"His speech sounded phrasemongering and insincere to many listeners.","zh":"他的演讲在很多听众看来辞藻堆砌、缺乏真诚。"}]}],"synonyms":["empty rhetoric","verbiage","grandiloquence","bombast","purple prose","buzzword-speak"],"phonetic":"/ˈfreɪzˌmʌŋɡərɪŋ/","extraExplanation":["“-monger”表示“贩卖……的人/兜售……的人”（如 fishmonger 卖鱼的；scaremonger 散播恐慌的人）。因此 phrasemongering 带有讽刺意味：像“兜售口号/漂亮话”一样把词句当商品推销，而不是提供真实内容。","这个词常用于批评政治演说、广告文案或官僚写作中“听起来很高级但没信息量”的表达，接近中文的“官话套话”“空话连篇”“辞藻堆砌”。"]}
{"word":"phrasemongery","summary":{"en":"“Phrasemongery” means using lots of stock phrases or slogans, often in an empty or insincere way.","zh":"“phrasemongery”指爱用大量套话/口号，常给人空洞、不真诚的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or practice of using too many stock phrases, catchy slogans, or fancy-sounding expressions, often in a way that feels empty or insincere.","zh":"（常带贬义）爱堆砌套话、口号或华丽辞藻的习惯；空洞的辞藻堆砌。"},"examples":[{"en":"The speech was full of phrasemongery but had very few clear plans.","zh":"这篇演讲满是套话和口号，却几乎没有明确的计划。"},{"en":"Her writing improved when she cut the phrasemongery and used simpler, more direct words.","zh":"她把那些空洞的辞藻删掉、改用更朴素直接的词后，文章反而更好了。"}]}],"synonyms":["empty rhetoric","buzzwords","clichés","verbiage","windbaggery"],"phonetic":"/ˈfreɪzˌmʌŋɡəri/","extraExplanation":["“phrasemongery”由 phrase（短语、套话）+ -mongery 组成；-mongery 有“兜售、贩卖；爱好某种做法”的含义，常带负面评价（类似于“为了效果而堆砌/兜售”）。","这是个比较少见、偏书面或评论风格的词，常用于批评政治演讲、广告文案或空泛的公关措辞。更常见的表达包括 “empty rhetoric（空洞修辞）”、“buzzwords（流行语/行话）”、“clichés（陈词滥调）”。"]}
{"word":"phraseogram","summary":{"en":"A shorthand symbol or written form that stands for an entire phrase.","zh":"表示整个短语的速记符号/简写写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in shorthand) a special written form that represents a whole phrase as one unit, often written without lifting the pen.","zh":"（速记中）短语符号；用一个连写/简写的形式把整个短语当作一个单位来表示，常常一笔写成。"},"examples":[{"en":"In Pitman shorthand, “I have” is often written as a phraseogram.","zh":"在皮特曼速记里，“I have”常常用一个短语符号（phraseogram）来连写表示。"},{"en":"Learning common phraseograms can make your note‑taking much faster.","zh":"掌握常见的短语符号能让你的记笔记速度快很多。"}]}],"synonyms":["shorthand phrase sign","phrase sign","shorthand outline"],"phonetic":"/ˈfreɪzəˌɡræm/","extraExplanation":["“phraseogram”主要出现在速记体系（如 Pitman Shorthand）里：把常用词组（例如“in the”，“I will”，“you are”）合并成一个固定写法，以提高速度、减少笔画。","它属于比较专业、偏小众的词；在一般英语写作中不常用，更常见的相关词是“shorthand outline（速记符形）”或“phrase”（短语）。"]}
{"word":"phraseograph","summary":{"en":"A rare term for phrase-based shorthand, or someone who uses it.","zh":"一个罕见词：指“以短语为单位的速记法”，或使用这种速记法的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A system of shorthand writing that uses whole phrases as single signs; also the practice of writing in that system.","zh":"（罕见）一种以“整句/固定短语”为单位、用单一符号表示的速记体系；也指使用这种体系进行书写的做法。"},"examples":[{"en":"Some 19th‑century manuals described phraseograph methods to speed up courtroom notes.","zh":"一些19世纪的手册介绍了phraseograph式的速记方法，用来加快法庭记录。"},{"en":"The student practiced phraseograph so common expressions could be written in one stroke.","zh":"这名学生练习phraseograph，使常用表达能一笔写出。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person who writes or records using phrase-based shorthand.","zh":"（罕见）使用“短语速记”的记录员/速记员。"},"examples":[{"en":"In the old newspaper office, a phraseograph sat near the editor taking rapid dictation.","zh":"在旧时报社里，一位phraseograph坐在编辑旁边快速听写记录。"}]}],"synonyms":["phraseography","shorthand","stenography"],"phonetic":"/ˈfreɪzəˌɡræf/","extraExplanation":["这个词在现代英语里非常少见，更多会看到 *phraseography*（短语速记法）或直接说 *shorthand*（速记）。如果你是在某本老式速记教材、历史文献或专门术语表里遇到 *phraseograph*，通常与“把常用短语合并成单个符号/笔画”有关。"]}
{"word":"phraseographic","summary":{"en":"“Phraseographic” means “related to describing or compiling phrases (especially idioms) in a dictionary-like way.”","zh":"“phraseographic”意为“与短语（尤其习语、固定搭配）的记录、编纂或词典式描写有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phraseography: the collecting, recording, or dictionary-style describing of phrases (especially idioms and set expressions).","zh":"与“短语学/短语记录（phraseography）”有关的；指对短语（尤其是习语、固定搭配）的收集、记录或词典式描写。"},"examples":[{"en":"The book takes a phraseographic approach to common idioms in everyday English.","zh":"这本书用短语学（phraseographic）的方式来处理日常英语里的常见习语。"},{"en":"Phraseographic notes in the dictionary explain how each expression is actually used in context.","zh":"词典里的短语学注释会说明每个表达在语境中真实的用法。"}]}],"synonyms":["phraseological","lexicographic","idiomatic (context-dependent)"],"phonetic":"ˌfreɪziəˈɡræfɪk","extraExplanation":["“phraseographic”来自 phrase（短语）+ -graph-（写、记录）+ -ic（形容词后缀）。它在日常英语里很少见，更常见于语言学、词典学、语料库研究等领域。","相关术语：phraseography（短语学/短语记录与编纂），phraseological（短语学的；更常用，尤其指固定搭配与习语的研究）。"]}
{"word":"phraseography","summary":{"en":"Phraseography is a shorthand method that writes whole phrases with single signs to increase speed.","zh":"Phraseography 指速记中用单一符号/缩写表示整个短语或常见搭配，以提高记录速度的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use or system of writing in shorthand by representing whole phrases with single signs or abbreviations","zh":"（速记中的）短语速记法；用一个符号或缩写表示整句话或短语的写法/体系"},"examples":[{"en":"In some shorthand systems, phraseography lets a writer record common phrases with one stroke.","zh":"在一些速记体系中，短语速记法可以用一笔记录常见短语。"},{"en":"The course covered basic outlines first, then introduced phraseography for speed.","zh":"这门课先讲基本字形，然后再引入短语速记法来提高速度。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice or study of building and using phrase-based shorthand forms (phraseographs)","zh":"（作为技能或学科的）短语速记的实践或研究"},"examples":[{"en":"Her phraseography improved after she memorized the most frequent courtroom phrases.","zh":"她记住了法庭中最常见的短语后，短语速记能力明显提升。"}]}],"synonyms":["shorthand phrasing","phrase writing","phrase-based shorthand"],"phonetic":"/ˌfreɪziˈɑɡrəfi/","extraExplanation":["“phraseography”较少用于日常口语，更多出现在速记（shorthand）教材、历史资料或专业讨论中。","词源上可拆为 phrase（短语）+ -graphy（书写/记录法）。在传统速记体系（如 Pitman、Gregg 等）里，常见搭配（例如“in the end”“as soon as possible”）可能被设计成一个连写符号，以提升记录速度，但也需要避免歧义。"]}
{"word":"phraseologic","summary":{"en":"Phraseologic means “related to phraseology” or “characterized by fixed expressions,” and it is less common than phraseological.","zh":"phraseologic 指“与短语学/措辞习惯有关”或“带有固定套语特征”，但比 phraseological 更少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phraseology (the way words are commonly combined into phrases, idioms, and set expressions).","zh":"与短语学/措辞习惯有关的（研究或描述人们常用的词组、习语和固定搭配）。"},"examples":[{"en":"The paper offers a phraseologic analysis of political speeches.","zh":"这篇论文对政治演讲做了短语学（措辞习惯）分析。"},{"en":"Some errors are not grammatical but phraseologic—for example, using an unnatural collocation.","zh":"有些错误不是语法问题，而是短语搭配问题，比如用了不自然的固定搭配。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language or writing) Made up of or characterized by fixed, formulaic expressions.","zh":"（指语言或写作）以固定套语、程式化表达为特征的。"},"examples":[{"en":"His letters felt a bit phraseologic, full of ready-made greetings.","zh":"他的信有点像套话堆出来的，满是现成的问候语。"},{"en":"Tourist guidebooks can sound phraseologic, repeating the same descriptions.","zh":"旅游指南有时听起来很套路，反复使用同一套描述。"}]}],"synonyms":["phraseological","formulaic","idiomatic","set","conventional"],"phonetic":"/ˌfreɪziəˈlɑːdʒɪk/","extraExplanation":["“phraseologic”在现代英语中相对少见，更常见的是“phraseological”。在语言学语境（如搭配 collocation、习语 idiom、固定表达 set phrase）里使用会更自然。","词源上与“phraseology（措辞方式/固定用语的总体）”同源，因此它通常不表示“语法对错”，而更强调“说得地不地道、搭配自不自然”。"]}
{"word":"phraseological","summary":{"en":"Phraseological means “related to fixed expressions or common word combinations,” especially in linguistics.","zh":"phraseological 指“与固定表达或常见词语搭配有关的”，尤其常用于语言学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fixed expressions (set phrases, idioms, collocations) and how they are used in a language.","zh":"与固定表达有关的；关于惯用语、固定搭配等（及其用法）的。"},"examples":[{"en":"In this class, we focus on phraseological patterns like “take a look” and “make a decision.”","zh":"这门课我们重点学习短语搭配模式，比如“take a look”和“make a decision”。"},{"en":"Her writing sounds natural because she uses phraseological expressions that native speakers use every day.","zh":"她的写作很地道，因为她使用了母语者日常常用的固定表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"In linguistics, describing a study or approach that analyzes multi‑word units (idioms, proverbs, common word combinations) as meaningful units.","zh":"（语言学）短语学的；指把多词单位（习语、谚语、常见搭配等）当作有意义的整体来分析的。"},"examples":[{"en":"The paper offers a phraseological analysis of newspaper headlines.","zh":"这篇论文对新闻标题进行了短语学分析。"},{"en":"A phraseological dictionary helps learners choose natural word combinations.","zh":"短语学词典能帮助学习者选择更自然的词语搭配。"}]}],"synonyms":["idiomatic","formulaic","collocational"],"phonetic":"/ˌfreɪziəˈlɑːdʒɪkəl/","extraExplanation":["“phraseological”常见于语言学与词典学语境，日常对话里更常说“idiomatic”（地道的/惯用的）或“set phrases / collocations”（固定短语/搭配）。","词形提示：phrase（短语）+ -ology（……学）→ phraseology（短语学/习语用法体系）→ phraseological（短语学的/与固定表达相关的）。"]}
{"word":"phraseologically","summary":{"en":"“Phraseologically” means “in terms of idioms and natural word combinations (collocations).”","zh":"“phraseologically”表示“从习语和自然搭配（固定用法）的角度来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to fixed phrases, idioms, or typical word combinations (collocations) in a language.","zh":"以与固定短语、习语或常见搭配（词语组合）相关的方式；从“词组/习语用法”的角度。"},"examples":[{"en":"The translator handled the idiom phraseologically, choosing a natural expression rather than a word-for-word version.","zh":"译者从习语用法的角度处理这个表达，选择了更自然的说法，而不是逐字翻译。"},{"en":"Phraseologically, “strong tea” sounds natural in English, but “powerful tea” does not.","zh":"从搭配角度看，英语里说“strong tea”很自然，但说“powerful tea”就不自然。"}]}],"synonyms":["idiomatically","in terms of collocation","as a set phrase"],"phonetic":"/ˌfreɪziəˈlɑdʒɪkli/","extraExplanation":["“phraseologically”来自“phraseology（短语学/习语与搭配）”。在语言学习与翻译中，它常用来强调：某个表达是否符合母语者的常用搭配，而不只是语法正确。","常见学术/语言学语境：phraseological unit（固定搭配/惯用语块）、phraseological variation（搭配变体）、phraseological pattern（搭配模式）。日常口语中较少使用，更常见于写作、研究或翻译讨论。"]}
{"word":"phraseologies","summary":{"en":"“Phraseologies” means characteristic ways of wording or specialized sets of fixed expressions, often tied to a field or style.","zh":"“phraseologies”指特定的措辞方式或某一领域的固定表达/专门用语体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"ways of using phrases and wording; characteristic styles of expression (often in a particular field, group, or person’s writing/speech)","zh":"措辞方式；（常指某一领域、群体或个人的）表达风格/用语特点"},"examples":[{"en":"Legal phraseologies often sound formal and repetitive to ordinary readers.","zh":"法律文书的措辞方式常常让普通读者觉得正式而重复。"},{"en":"Her phraseologies are simple but powerful, which makes the message easy to remember.","zh":"她的表达方式简单却有力，因此信息很容易被记住。"}]},{"partOfSpeech":"n.","definition":{"en":"specialized sets of phrases and fixed expressions used in a subject area or tradition","zh":"（某一学科/传统中）特定的惯用语体系；专门用语"},"examples":[{"en":"Medical phraseologies help doctors communicate clearly and quickly.","zh":"医学专门用语有助于医生清晰、快速地交流。"},{"en":"When translating, you need to know the phraseologies of both languages, not just individual words.","zh":"翻译时你需要了解两种语言的惯用表达体系，而不只是单个词的意思。"}]}],"synonyms":["wording","phrasing","style of expression","idiom","set expressions","formulaic language","turns of phrase"],"phonetic":"/ˌfreɪziˈɑːlədʒiz/","extraExplanation":["“phraseologies”是“phraseology”的复数。学术写作里它常用来讨论某个领域的典型表达（比如法律、医学、宗教文本的固定搭配与套语）。","在语料库语言学/话语分析中，人们会研究不同群体的phraseology（如新闻报道、社交媒体、学术论文）来比较语体差异。"]}
{"word":"phraseologist","summary":{"en":"A phraseologist is an expert who studies or compiles phrases—especially idioms and common word combinations.","zh":"phraseologist 指研究或编纂短语（尤其习语与常见搭配）的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies phrases and fixed expressions (especially idioms and collocations) in a language; an expert in phraseology.","zh":"短语学研究者；研究语言中固定搭配、习语等“短语现象”的专家。"},"examples":[{"en":"The phraseologist explained why we say “strong tea” but not “powerful tea.”","zh":"这位短语学研究者解释了为什么我们说“strong tea（浓茶）”，而不说“powerful tea”。"},{"en":"As a phraseologist, she focuses on how idioms change over time.","zh":"作为短语学研究者，她关注习语如何随时间演变。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who compiles or writes a phrasebook or a dictionary of phrases/idioms.","zh":"短语词典/短语手册的编撰者；收集整理短语与习语的人。"},"examples":[{"en":"A well-known phraseologist published a new dictionary of modern idioms.","zh":"一位知名的短语词典编撰者出版了新的现代习语词典。"},{"en":"The phraseologist gathered everyday expressions from newspapers and films.","zh":"这位编撰者从报纸和电影中收集日常表达。"}]}],"synonyms":["phraseology researcher","idiom specialist","lexicographer (related)","linguist (general)"],"phonetic":"/ˌfreɪziˈɑlədʒɪst/","extraExplanation":["“phraseologist”来自“phraseology（短语学）”。phraseology关注语言里“固定搭配”如何形成与使用，比如 collocation（固定搭配：make a decision）、idiom（习语：break the ice）、set phrase（固定表达：as a matter of fact）。","学习上可以把“phraseologist”理解为“研究/整理‘地道说法’的人”。他们常用语料库（corpus）观察哪些词常一起出现、哪些表达更自然。"]}
{"word":"phraseology","summary":{"en":"Phraseology means the typical or studied use of phrases (collocations/idioms) and can also mean a particular style of wording, often in formal fields.","zh":"phraseology 指语言中的常见短语用法（搭配/习语/固定表达）的研究或运用；也可指某领域或文本的特定措辞风格（常较正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study or use of words and phrases in a language, especially typical collocations, idioms, and set expressions.","zh":"（语言学）措辞学；短语用法研究：研究或使用语言中的词语与短语，尤其是常见搭配、习语和固定表达。"},"examples":[{"en":"Good phraseology makes your writing sound natural and professional.","zh":"恰当的措辞会让你的写作更自然、更专业。"},{"en":"In English phraseology, we say “make a decision,” not “do a decision.”","zh":"在英语的常见搭配里，我们说“make a decision”，不说“do a decision”。"}]},{"partOfSpeech":"n.","definition":{"en":"The particular style of wording used in a text, speech, or field (often in formal or technical contexts).","zh":"（某文本/演讲/领域的）用语风格；措辞方式（常见于正式或专业语境）。"},"examples":[{"en":"Legal phraseology can be difficult for non-experts to understand.","zh":"法律用语对非专业人士来说可能很难理解。"},{"en":"The report’s phraseology was careful to avoid making promises.","zh":"报告的措辞很谨慎，避免作出承诺。"}]}],"synonyms":["wording","diction","expression","terminology","idiom usage"],"phonetic":"/ˌfreɪziˈɑlədʒi/","extraExplanation":["“phraseology”来自“phrase（短语）+ -logy（……学/研究）”。在语言学习中，它常强调“地道的搭配与固定说法”（collocations & set phrases），比如“strong coffee”而不是“powerful coffee”。","在专业语境里（如法律、外交、医疗），人们常说“the phraseology of …”来指一套惯用、较固定的表达方式，措辞不同可能带来不同的含义或法律后果。"]}
{"word":"phraser","summary":{"en":"“Phraser” usually means someone who is good at wording or shaping phrases; less commonly, it can mean a rephrasing tool.","zh":"“phraser”通常指擅长措辞、组织表达的人；较少情况下也可指改写/换说法的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who chooses or shapes the wording of something (how an idea is “phrased”), especially in writing or translation","zh":"（尤指写作或翻译中）措辞者；负责把意思用合适的话表达出来的人"},"examples":[{"en":"A good phraser can make a complicated idea sound simple and natural.","zh":"好的措辞者能把复杂的想法表达得简单又自然。"},{"en":"In the translation team, she was the main phraser for the final English version.","zh":"在翻译团队里，她主要负责最终英文版本的措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or program used to rewrite or rephrase text (less common; often said as “paraphraser” or “rephraser”)","zh":"改写/换说法的工具或程序（较少见；更常说 paraphraser 或 rephraser）"},"examples":[{"en":"He tried an online phraser to make the email sound more polite.","zh":"他用了一个在线改写工具，让邮件听起来更礼貌。"}]}],"synonyms":["wordsmith","stylist","writer","paraphraser","rephraser"],"phonetic":"/ˈfreɪzɚ/","extraExplanation":["“phraser”不是很常见的标准词汇。日常英语里更常见的表达是：\n- a good writer / a good stylist（擅长文风与表达的人）\n- someone who’s good at wording things（很会措辞的人）\n如果你想表达“改写工具”，更自然的是 paraphraser（释义/改写器）或 rephraser（换说法工具）。"]}
{"word":"phrases","summary":{"en":"A phrase is a group of words used together (often not a full sentence), or a familiar expression; as a verb, it means to choose words to express something.","zh":"phrase 指在句中一起使用的一组词（常不是完整句子），也可指常用固定说法；作动词表示“用措辞表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short group of words that work together as a unit in a sentence (often not a complete sentence)","zh":"（语法）短语；在句子中作为一个整体使用的一组词（通常不是完整句子）"},"examples":[{"en":"In the sentence “She walked to school,” “to school” is a phrase.","zh":"在句子“She walked to school”中，“to school”是一个短语。"},{"en":"Try to learn common phrases like “How are you?” and “Excuse me.”","zh":"试着学习常用短语，比如“How are you?”和“Excuse me.”"}]},{"partOfSpeech":"n.","definition":{"en":"a short, well-known expression or set of words, often used again and again","zh":"（常用）固定说法；常用语；（反复使用的）措辞"},"examples":[{"en":"“Once upon a time” is a common storytelling phrase.","zh":"“Once upon a time”是讲故事时常用的固定说法。"},{"en":"That phrase sounds rude in English, so be careful.","zh":"那个说法在英语里听起来不礼貌，要小心使用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to express something using particular words or wording","zh":"用某种措辞表达；表述"},"examples":[{"en":"She phrased her request politely.","zh":"她把请求说得很礼貌。"},{"en":"Let me phrase it another way so it’s clearer.","zh":"让我换一种说法，这样更清楚。"}]}],"synonyms":["expression","wording","term"],"phonetic":"/freɪz/","extraExplanation":["“phrase”和“sentence”的区别：sentence（句子）通常有完整主谓结构并表达完整意思；phrase（短语）通常不完整，但在句中可以充当名词/形容词/副词等成分，如“in the morning”“a piece of cake”。","学习英语时常说的“useful phrases”多指日常固定搭配或套语（如问候、道歉、请求），并不一定是语法意义上的“短语”。"]}
{"word":"phrasey","summary":{"en":"“Phrasey” describes speech or writing that uses too many set phrases or wordy expressions, often sounding unnatural or unclear.","zh":"“Phrasey”形容说话或写作套话多、辞藻堆砌、冗长，常给人不自然或不够清楚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many set phrases or flowery expressions, often sounding unnatural or insincere.","zh":"（语言）套话很多的；辞藻堆砌的；（听起来）不自然或不真诚的。"},"examples":[{"en":"His apology sounded phrasey, like something copied from a script.","zh":"他的道歉听起来很“套话”，像是从稿子里抄来的。"},{"en":"Try to make the email clearer and less phrasey.","zh":"尽量把这封邮件写得更清楚，少一些套话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Full of many phrases; wordy in a way that reduces clarity.","zh":"（表达）冗长的；短语很多而不够清晰的。"},"examples":[{"en":"The introduction is phrasey and could be shortened.","zh":"这段引言很冗长，可以精简。"},{"en":"New writers sometimes get phrasey when they want to sound formal.","zh":"新手写作者想显得正式时，有时会写得很“堆词”。"}]}],"synonyms":["wordy","verbose","pompous","hackneyed","cliché-ridden","formulaic"],"phonetic":"/ˈfreɪzi/","extraExplanation":["“phrasey”在写作点评里很常见，通常带有批评意味：不是说用短语不对，而是指表达过度依赖套话（例如“in today’s society…”, “at the end of the day…”）或为了显得高级而堆砌辞藻，结果让文字不够真诚或不够清楚。","改写思路：用更具体的动词与名词、减少空泛的开头和结尾、删掉不提供信息的修饰语，常能让句子更自然。"]}
{"word":"phrasify","summary":{"en":"“Phrasify” means to express something by turning it into a phrase or by choosing specific wording.","zh":"“phrasify”指把内容写成/说成一个短语，或用特定措辞来表达、改写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put into a phrase; to express or restate something in a particular wording","zh":"把……写成/说成一个短语；用某种措辞来表达或改写"},"examples":[{"en":"Can you phrasify this idea in simpler English?","zh":"你能把这个想法用更简单的英语表述出来吗？"},{"en":"The editor phrasified the headline to make it shorter and clearer.","zh":"编辑把标题重新措辞，使它更短更清晰。"}]}],"synonyms":["phrase","rephrase","word","express","formulate"],"phonetic":"/ˈfreɪzɪfaɪ/","extraExplanation":["“phrasify”比较少见，多用于非正式语境或写作讨论中。更常见的说法是“phrase it / rephrase it / put it into words”。","后缀“-ify”常表示“使变成……；使具有……性质”，例如：simplify（使简化）、clarify（使清楚）、identify（识别/确认）。因此 phrasify 字面意思就是“使成为一个短语/措辞化”。"]}
{"word":"phrasiness","summary":{"en":"Phasiness means a style that relies too much on set phrases or stock wording, often sounding wordy or formulaic.","zh":"phrasiness 指表达过度依赖固定短语或套话，常显得啰嗦、模板化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of using too many set phrases (fixed expressions) instead of simple, direct wording; a style that feels wordy or full of stock phrases.","zh":"（写作或表达中）过多使用固定短语/套话的倾向；让人感觉啰嗦、充满“模板化表达”的风格。"},"examples":[{"en":"The editor criticized the essay’s phrasiness and asked for clearer, shorter sentences.","zh":"编辑批评这篇文章太“短语化”、套话多，要求用更清楚、更短的句子。"},{"en":"In business emails, phrasiness can make your message sound less sincere.","zh":"在商务邮件里，套话太多会让你的信息显得不够真诚。"}]}],"synonyms":["wordiness","verbosity","formulaic language","cliché-ridden style","boilerplate"],"phonetic":"/ˈfreɪ.zi.nəs/","extraExplanation":["“phrasiness”在日常口语中不算常见，更常见于写作批评、编辑意见或语言学讨论，常带有轻微负面评价（比如“太多套话”“不够直接”）。","它来自“phrase（短语）+ -iness（……的特性）”。常见搭配：avoid/reduce phrasiness（避免/减少套话）、criticize phrasiness（批评套话多）。","相关表达：wordiness（啰嗦）、cliché-ridden（陈词滥调很多的）、full of boilerplate（充满模板化措辞的）。"]}
{"word":"phrasing","summary":{"en":"Phrasing means the way something is expressed in words; it can also mean musical expression of a melody.","zh":"phrasing指“措辞/表达方式”，也可指音乐中的“乐句处理/旋律表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the way words are chosen and arranged to express an idea (how something is worded)","zh":"措辞；用词方式；表达方式（某句话/某段话是怎么说的）"},"examples":[{"en":"I like the phrasing of your email—it sounds polite and clear.","zh":"我喜欢你邮件的措辞——既礼貌又清楚。"},{"en":"The phrasing of the question was confusing.","zh":"这个问题的措辞让人困惑。"},{"en":"Try a different phrasing to make your meaning more direct.","zh":"试着换一种说法，让意思更直接。"}]},{"partOfSpeech":"n.","definition":{"en":"the way a musician shapes a melody with timing, pauses, and emphasis (musical expression)","zh":"（音乐）乐句处理；乐句的表达方式（通过节奏、停顿、重音等塑造旋律）"},"examples":[{"en":"Her phrasing makes the melody sound like it’s singing.","zh":"她的乐句处理让旋律听起来像在歌唱。"},{"en":"Good jazz phrasing often plays with the beat.","zh":"好的爵士乐句处理常常会“玩”节拍。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of expressing something in a particular way (the process of choosing words)","zh":"措辞的过程；用某种方式表达（选择词语并组织表达的行为）"},"examples":[{"en":"We spent a long time phrasing the announcement carefully.","zh":"我们花了很长时间仔细斟酌公告的措辞。"},{"en":"She paused, phrasing her response so it wouldn’t sound harsh.","zh":"她停顿了一下，斟酌着回应的措辞，避免听起来太刺耳。"}]}],"synonyms":["wording","expression","formulation","choice of words","turn of phrase","musical expression"],"phonetic":"/ˈfreɪzɪŋ/","extraExplanation":["“phrasing”常用于写作/口语反馈：change the phrasing（换个说法）、awkward phrasing（别扭的措辞）、careful phrasing（谨慎措辞）。","和“wording”很接近：wording更偏“具体用的字句本身”，phrasing更强调“表达方式/语气/结构”，在音乐语境里也更常用。"]}
{"word":"phrasings","summary":{"en":"“Phrasings” means different word choices or ways to say something (and in music, different ways to shape a musical line).","zh":"“phrasings”指表达同一意思的不同措辞/说法（在音乐中也可指不同的乐句处理方式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"different ways of expressing an idea in words; choices of wording","zh":"（同一意思的）不同措辞、不同表达方式；用词选择"},"examples":[{"en":"Try a few different phrasings and choose the one that sounds most natural.","zh":"试试几种不同的措辞，选一个听起来最自然的。"},{"en":"Her email was polite, but some phrasings could be misunderstood.","zh":"她的邮件很礼貌，但有些表达可能会被误解。"},{"en":"The contract uses specific phrasings to avoid legal confusion.","zh":"合同使用特定措辞来避免法律上的歧义。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) different ways of shaping a musical phrase, such as where to breathe or emphasize notes","zh":"（音乐）不同的乐句处理方式（如换气点、重音与强调的安排）"},"examples":[{"en":"The two singers used noticeably different phrasings in the chorus.","zh":"两位歌手在副歌的乐句处理上明显不同。"},{"en":"Listen to how the pianist’s phrasings create a calmer mood.","zh":"听听这位钢琴家的乐句处理如何营造更平静的氛围。"}]}],"synonyms":["wordings","ways of saying","expressions","formulations","turns of phrase"],"phonetic":"/ˈfreɪzɪŋz/","extraExplanation":["“phrasings”是可数名词复数，单数是“a phrasing”。日常写作与口语里也常用更直接的说法：“wording”。","在沟通中讨论“phrasings”通常是在强调语气、礼貌程度、是否清晰或是否可能引发误解；在法律、学术与公关文本中尤其常见。"]}
{"word":"phrasis","summary":{"en":"Phrasis means a particular way of wording or expressing something, especially in formal or rhetorical contexts.","zh":"Phrasis 指特定的措辞/表达方式，常用于正式或修辞学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rhetoric, formal) A way of expressing something in words; the particular phrasing or style of wording (diction).","zh":"（修辞/正式用语）用词方式；表达措辞；措辞风格（用语/措辞）。"},"examples":[{"en":"The poet’s phrasis is simple but powerful, which makes the message easy to feel.","zh":"这位诗人的措辞简洁却有力量，让人很容易感受到信息。"},{"en":"In academic writing, you may need to adjust your phrasis to sound more precise and neutral.","zh":"在学术写作中，你可能需要调整措辞，让表达更准确、更中性。"},{"en":"Different cultures can prefer different phrasis when making requests, from direct to very polite.","zh":"不同文化在提出请求时偏好的措辞不同，有的直接，有的非常委婉。"}]}],"synonyms":["phrasing","wording","diction","expression","turn of phrase"],"phonetic":"/ˈfreɪsɪs/","extraExplanation":["“phrasis”源自希腊语 *phrasis*（表达、说法），在英文里多见于修辞学、文学评论或语言风格讨论中，日常口语很少用。更常见的替代词是 *phrasing*、*wording*、*diction*。","在古典修辞语境里，*phrasis*常强调“怎么说”（表达方式、语气、措辞选择）对效果的影响，例如同一内容用更委婉或更直接的说法会带来不同的语气与人际距离。"]}
{"word":"phrasy","summary":{"en":"Phrasy means “full of set phrases/clichés and lacking specific meaning”; it’s also a rare term meaning “related to phrases.”","zh":"phrasy 指“充满套话/陈词滥调、听起来空泛”；也可（较少见）指“与短语有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many set phrases or clichés; full of empty-sounding expressions rather than clear, specific meaning.","zh":"（用词）充满套话/陈词滥调的；辞藻堆砌但不够具体有力的。"},"examples":[{"en":"His speech sounded phrasy, full of slogans but short on details.","zh":"他的演讲听起来很“套话化”，口号很多，但细节很少。"},{"en":"Try to avoid phrasy writing by using concrete examples.","zh":"尽量用具体例子来避免写作变得充满套话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to phrases or written in a phrase-like way (rare; often used in linguistic contexts).","zh":"与短语有关的；呈“短语式”的（较少见，多用于语言学语境）。"},"examples":[{"en":"Some learners rely on phrasy chunks instead of building sentences from grammar rules.","zh":"有些学习者更依赖“短语块”，而不是用语法规则去组句。"}]}],"synonyms":["phrasey","cliché-ridden","formulaic","trite","platitudinous"],"phonetic":"/ˈfreɪzi/","extraExplanation":["“phrasy”在现代英语里并不常见；更常见、也更标准的拼写是“phrasey”。两者意思基本相同，指语言“爱用套话、听起来空泛”。如果你是在写作或考试中使用，建议用“phrasey”。","辨别“phrasy/phrasey”是否合适的一个方法：如果一句话删掉那些华丽但不具体的词，核心信息几乎没变，那它可能就很“phrasy”。","相关表达：cliché-ridden（陈词滥调的）、full of platitudes（充满空话的）、overly wordy（过于啰嗦的）。"]}
{"word":"phrator","summary":{"en":"A rare historical word meaning a member of a phratry (an ancient Greek clan/brotherhood).","zh":"一个罕见的历史词，指古希腊“族团/兄弟会”(phratry) 的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) A member of a phratry (phratria)—a brotherhood or clan-like social group in ancient Greek society, especially in Athens.","zh":"（罕见，历史用语）“族团/兄弟会”(phratry/phratia) 的成员——古希腊（尤指雅典）一种类似宗族或兄弟会的社会组织中的一员。"},"examples":[{"en":"In ancient Athens, a citizen’s family was often registered through his phratry, and a phrator would share rituals with fellow members.","zh":"在古雅典，公民的家族常通过族团登记；族团成员（phrator）会与同族团的人共同参加仪式。"},{"en":"The historian notes that each phrator had obligations to the group’s religious ceremonies.","zh":"历史学家指出，每位族团成员（phrator）都要履行参与该团体宗教仪式的义务。"}]}],"synonyms":["phratry member","member of a brotherhood"],"phonetic":"/ˈfreɪtər/","extraExplanation":["“phrator”非常少见，多出现在古希腊社会结构或古典学研究的英文资料中；日常英语里几乎不会用到。","它与希腊语词根有关，常与“phratry / phratria（族团/兄弟会）”一起出现。若你是在现代语境（如账单、费用）里看到类似拼写，你可能真正想查的是“prorator / prorate（按比例分摊的人/按比例分摊）”。"]}
{"word":"phratral","summary":{"en":"Fraternal means brotherly or related to a fraternity-type organization.","zh":"fraternal 指“兄弟般的；与兄弟会/互助社团有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to brothers or to a close, friendly relationship like that of brothers.","zh":"与兄弟有关的；像兄弟一样亲密友好的（情谊）。"},"examples":[{"en":"They greeted each other with fraternal warmth after years apart.","zh":"多年不见后，他们以兄弟般的热情彼此问候。"},{"en":"The team tries to build a fraternal spirit, supporting one another on and off the field.","zh":"这支队伍努力建立兄弟般的团队精神，场上场下都互相支持。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with a fraternity or a social group/organization formed for mutual support (often in schools or community groups).","zh":"与“兄弟会”或互助性质的社团/组织有关的（常见于学校或社区）。"},"examples":[{"en":"He joined a fraternal organization that does charity work.","zh":"他加入了一个从事慈善工作的兄弟会组织。"},{"en":"The college has several fraternal groups with different traditions.","zh":"那所大学有几个有不同传统的兄弟会团体。"}]}],"synonyms":["brotherly","friendly","camaraderielike","fraternity-related"],"phonetic":"/frəˈtɝnəl/","extraExplanation":["你输入的“phratral”很可能是拼写误差；常见目标词是 **fraternal**。","词源来自拉丁语 *frater*（兄弟），因此它既可指“兄弟般的情谊”，也常用于“兄弟会/互助社团”等语境。","易混词：**paternal**（父亲的/父系的）与 **fraternal**（兄弟的）常成对出现，如 *fraternal twins*（异卵双胞胎）。"]}
{"word":"phratria","summary":{"en":"A phratria is an ancient Greek clan-like brotherhood within a tribe, linked by social and religious membership.","zh":"phratria 指古希腊部族内部的“胞族/兄弟会”式群体，以社会与宗教成员关系维系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a brotherhood or clan-like group (a subdivision of a tribe) whose members shared social and religious ties.","zh":"（古希腊的）胞族／宗族式兄弟会；部族的下属分支，成员以社会与宗教关系相连。"},"examples":[{"en":"In Athens, a citizen was often registered through his phratria before full civic recognition.","zh":"在雅典，一个人常常要先在其胞族（phratria）登记，才更容易获得完整的公民身份认可。"},{"en":"Religious festivals and family rites could be organized at the level of the phratria.","zh":"宗教节庆和家族仪式有时会以胞族（phratria）为单位来组织。"}]}],"synonyms":["phratry"],"phonetic":"/ˈfreɪtriə/","extraExplanation":["“phratria”来自古希腊语，常译作“胞族”。它不是现代意义上的“家庭”，也不同于正式国家机构，更像介于家族与城邦之间的社会网络，用来确认血缘/归属、参与仪式、建立互助关系。","相关词：phratry（更常见的英语写法/对应词），成员称为 phrater（同胞族成员）。"]}
{"word":"phratriac","summary":{"en":"“Phratriac” means “connected with a phratry,” an ancient Greek clan-like brotherhood within a tribe.","zh":"“phratriac”指“与 phratry（古希腊部族内部的宗族式兄弟团体）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a phratry (an ancient Greek brotherhood or clan-like group within a tribe).","zh":"（罕见）与“phratry”（古希腊的“兄弟会/宗族式”团体，部族内部的分支组织）有关的。"},"examples":[{"en":"The inscription lists phratriac duties connected to local religious festivals.","zh":"铭文列出了与当地宗教节庆相关的 phratriac（氏族/兄弟会）职责。"},{"en":"Some scholars compare phratriac membership to extended-family networks in other ancient societies.","zh":"一些学者把 phratriac 成员资格与其他古代社会的大家族网络作比较。"}]}],"synonyms":["phratral","clan-related","tribal"],"phonetic":"/freɪˈtriˌæk/","extraExplanation":["“phratriac”来自“phratry”，而“phratry”源于希腊语 phratría（意为“兄弟团体”），与 Greek phrátēr（兄弟）同源。它不是现代日常英语词汇，更多见于古典学、历史学、人类学的学术写作。","古雅典社会结构常被概括为：oikos（家/家族）→ genos（氏族）→ phratry（兄弟会/宗族团体）→ phyle（部族）。phratry 常与身份认定、婚姻与血统、以及宗教祭仪相关。"]}
{"word":"phratrial","summary":{"en":"“Phratrial” is a rare adjective meaning “related to a phratry,” a social grouping within some tribal/clan systems.","zh":"“phratrial”是罕见形容词，表示“与phratry（胞族/部族分支）有关”，常见于人类学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a phratry—an anthropological term for a social division within a tribe or clan system, often made up of several clans.","zh":"（罕见）与“胞族/部族分支（phratry）”有关的——人类学用语，指部落或氏族体系中的一种社会分支，常由多个氏族组成。"},"examples":[{"en":"In some Indigenous societies, marriage rules can be organized at the phratrial level.","zh":"在一些原住民社会中，婚姻规则可能会以胞族（phratry）这一层级来组织。"},{"en":"The researcher compared clan identities with phratrial affiliations.","zh":"研究者比较了氏族身份与胞族归属。"}]}],"synonyms":["phratric (rare)","tribal (general)","clan-based (general)"],"phonetic":"ˈfreɪtriəl","extraExplanation":["“phratrial”非常少见，多见于人类学/民族志写作中；更常见的名词是“phratry”（胞族、部族分支）。","词源可追溯到希腊语 *phratria*，原指“兄弟会/同胞团体”。不同文化中的phratry制度差异很大，使用时通常需要结合具体民族与研究语境。","如果你本来想查的是“phrasal（短语的）”或“prenuptial（婚前的）”之类的词，请告诉我正确拼写，我可以按你的目标词重新解释与举例。"]}
{"word":"phratric","summary":{"en":"“Phratric” means “related to a phratry,” an anthropological social group.","zh":"“phratric”意为“与族团/胞族（phratry）有关的”，多用于人类学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a phratry (a social group or clan-like division, especially in anthropology).","zh":"与“族团/胞族（phratry）”有关的；族团的（人类学用语）。"},"examples":[{"en":"The anthropologist compared phratric rules of marriage across neighboring tribes.","zh":"这位人类学家比较了相邻部落之间族团（phratric）的婚姻规则。"},{"en":"In some societies, phratric membership can shape ceremonies and obligations.","zh":"在一些社会中，族团（phratric）成员身份会影响仪式与义务。"}]}],"synonyms":["phratrial","tribal (context-dependent)"],"phonetic":"/ˈfreɪtrɪk/","extraExplanation":["“phratric”来自名词“phratry”，常见于人类学/民族志写作中，指一种介于“氏族（clan）”与“部落（tribe）”之间的社会分组。词根与希腊语 *phratria*（兄弟会/胞族）有关。","日常英语中很少用到；一般学术写作会更常见“phratry”或“phratrial”。如果你是在论文或阅读材料里看到它，通常是在讨论亲属制度、婚配规则、仪式组织等主题。"]}
{"word":"phratries","summary":{"en":"Phratries are large social groups within a tribe, usually made up of several related clans (anthropology).","zh":"phratries 指部落内部由多个氏族组成的较大社会群体（人类学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of phratry) groups within a tribe or society that are made up of related clans or families, often sharing social or ceremonial duties (an anthropology term).","zh":"（phratry 的复数）“胞族/兄弟族”：部落或社会内部由若干氏族或家族组成的群体，常在社会组织、婚姻规则或仪式职责上具有共同功能（人类学术语）。"},"examples":[{"en":"In the study, the tribe was divided into two phratries, and each phratry contained several clans.","zh":"在这项研究中，该部落被分为两个胞族（phratries），每个胞族包含若干氏族。"},{"en":"Marriage rules were organized around phratries, limiting who could marry whom.","zh":"婚姻规则围绕胞族（phratries）来制定，从而限制哪些人可以通婚。"}]}],"synonyms":["brotherhoods","clan groups","tribal divisions"],"phonetic":"/ˈfreɪtriz/","extraExplanation":["词源：phratry 来自希腊语 *phrātría*，与 *phrátēr*（“兄弟”）相关，强调“兄弟式的同盟/共同体”。","使用场景：该词多见于人类学、民族志（ethnography）与社会结构研究中，日常英语里很少用；如果只是想表达“团体/社群”，更常用 *group, clan, tribe, community* 等。","相关词辨析：*clan* 通常指同一祖先或家系的“氏族”；*phratry* 往往是由多个 clan 组成的更大单位。不同文化的定义可能略有差异。"]}
{"word":"phratry","summary":{"en":"A phratry is an anthropological term for a group of multiple clans within a tribe.","zh":"phratry（胞族/氏族联盟）是人类学术语，指部落中由多个氏族组成的群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In anthropology, a social group made up of two or more clans within a tribe, often linked by a shared name, origin story, or ritual responsibilities.","zh":"（人类学）“胞族/氏族联盟”：部落中由两个或多个氏族组成的社会群体，常因共同名称、起源传说或仪式职责而联系在一起。"},"examples":[{"en":"In the study, marriage rules were organized by clan and phratry.","zh":"在这项研究中，婚姻规则按氏族与胞族来组织。"},{"en":"Each phratry had duties in certain ceremonies.","zh":"每个胞族在某些仪式中都有特定职责。"}]}],"synonyms":["clan grouping","clan alliance","moiety (related concept)"],"phonetic":"/ˈfreɪtri/","extraExplanation":["“Phratry”是较偏学术的人类学用语，常见于对北美原住民等社会结构的描述：一般可理解为“氏族之上、部落之下”的中层群体单位。","词源来自希腊语 phrātrā（意为“兄弟团体/同族人”），因此有“同宗、结盟”的含义。","易混淆：clan（氏族）通常是更小、更具体的血缘/象征血缘群体；phratry（胞族/氏族联盟）由多个clan组成。"]}
{"word":"phrazein","summary":{"en":"phrazein is an Ancient Greek root meaning “to tell/express,” mostly used in etymology.","zh":"phrazein 是表示“讲述/表达”的古希腊语词根，主要用于词源说明。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Ancient Greek) “to tell, express, make known; speak or say.” In English, it is mainly seen in etymology discussions (it is not a common modern English word).","zh":"（源自古希腊语）“讲述、表达、使人知道；说、陈述”。在英语里主要出现在词源讲解中（现代英语中并不常用作词）。"},"examples":[{"en":"The word “phrase” comes from Greek phrazein, meaning “to tell” or “to express.”","zh":"“phrase（短语）”一词来自希腊语 phrazein，意思是“讲述”或“表达”。"},{"en":"In etymology notes, you may see phrazein listed as the root related to speaking or explaining.","zh":"在词源注释里，你可能会看到 phrazein 被列为与“说话、解释”相关的词根。"}]}],"synonyms":["tell","say","express","explain"],"phonetic":"/ˈfreɪziːn/","extraExplanation":["phrazein 是古希腊语动词（φράζειν）的拉丁字母转写，常见于英语词源学资料中；日常英语写作或口语里几乎不会直接使用。","它与英语 phrase（短语）、emphatic / emphasis（强调）等词的历史联系，体现了“表达、说明、让人明白”的核心含义。","如果你的目标是现代英语表达，通常你想找的是 phrase（短语）或 to phrase（用某种措辞表达）。"]}
{"word":"phreatic","summary":{"en":"Phreatic means “related to groundwater,” and in volcanology it describes steam-driven eruptions caused by heated groundwater.","zh":"phreatic 表示“与地下水有关的”；在火山学中指由受热地下水产生蒸汽所驱动的“水汽喷发”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to groundwater, especially water found below the Earth’s surface in the saturated zone (the phreatic zone).","zh":"与地下水有关的；尤指与地表下饱和带（潜水带、phreatic zone）中的水有关的。"},"examples":[{"en":"Phreatic water can rise after heavy rain and flood basements.","zh":"大雨后潜水（phreatic water）可能上升并淹没地下室。"},{"en":"The well draws from a phreatic aquifer rather than a deep confined one.","zh":"这口井取水于潜水含水层，而不是更深的承压含水层。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a volcanic eruption) driven mainly by steam from heated groundwater, rather than by new magma reaching the surface.","zh":"（火山喷发）以受热地下水产生的水蒸气为主要动力的（非主要由新岩浆直接上升到地表驱动）。"},"examples":[{"en":"The volcano produced a phreatic explosion that sent ash and steam into the air.","zh":"这座火山发生了水汽爆发（phreatic explosion），把火山灰和蒸汽喷向空中。"},{"en":"Phreatic eruptions can occur with little warning because they involve groundwater pressure.","zh":"由于涉及地下水压力，水汽喷发可能预警时间很短。"}]}],"synonyms":["groundwater-related","water-table (related)","steam-driven (volcanic)"],"phonetic":"/friˈætɪk/","extraExplanation":["“phreatic”来自希腊语 *phrear/phreatos*，意为“井”。因此它常见于地质、水文与火山学语境。","常搭配：phreatic zone（潜水带/饱和带）、phreatic surface / water table（潜水面/地下水位）、phreatic aquifer（潜水含水层）、phreatic eruption（火山水汽喷发）。"]}
{"word":"phreatophyte","summary":{"en":"A deep-rooted plant that taps groundwater to live in dry environments.","zh":"能以深根汲取地下水、在干旱环境中生存的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant with very deep roots that can reach groundwater (the water table), allowing it to survive in dry areas.","zh":"一种根系很深、能到达地下水（潜水面）的植物，因此能在干旱地区生存。"},"examples":[{"en":"Cottonwoods are phreatophytes that often grow along rivers in arid regions.","zh":"三角叶杨（cottonwood）常见于干旱地区的河岸，是典型的深根汲水植物（phreatophyte）。"},{"en":"Because it is a phreatophyte, this shrub can stay green even during long droughts.","zh":"因为这种灌木是深根汲水植物，所以即使长期干旱也能保持常绿。"}]}],"synonyms":["deep-rooted groundwater-dependent plant","groundwater-dependent plant","GDE (in ecology, broader term)"],"phonetic":"/ˈfriːətoʊˌfaɪt/","extraExplanation":["词源提示：phreato- 来自希腊语，和“井、地下水”有关；-phyte 表示“植物”。合起来就是“依赖地下水的植物”。","常见语境：生态学、水文学与环境管理中常用这个词，讨论“植被耗水”“地下水位下降”“河岸带（riparian zone）生态”等问题。","学习延伸：phreatophyte 强调“能用地下水”，不一定表示“水生植物”；它们通常生活在地表较干、但地下水位相对可达的地方。"]}
{"word":"phreatophytic","summary":{"en":"Describes plants that use deep roots to draw water from the groundwater table.","zh":"形容植物通过深根从地下水位/潜水层获取水分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant) able to tap groundwater with very deep roots, especially in dry regions.","zh":"（植物）具深根、能吸取地下水（潜水层）的，常见于干旱地区。"},"examples":[{"en":"Mesquite is a phreatophytic plant that can survive long droughts by reaching groundwater.","zh":"豆科灌木（mesquite）是一种具深根取地下水的植物，能靠触及地下水来熬过长期干旱。"},{"en":"Phreatophytic vegetation often grows along rivers in deserts where the water table is shallow.","zh":"在沙漠中地下水位较浅的河岸地带，常能看到依赖地下水的深根植被。"}]}],"synonyms":["groundwater-dependent","deep-rooted (in this sense)","water-table"],"phonetic":"/ˌfriːtəˈfɪtɪk/","extraExplanation":["该词多用于生态学、水文学与荒漠植物研究。与“xerophytic（耐旱型，主要靠减少蒸腾/储水）”不同，phreatophytic 强调“通过根系直接利用地下水（phreatic zone，潜水层）”。","词源：phreato- 来自希腊语“井/水井”，-phytic 与“植物/生长”相关。理解为“靠井水（地下水）生长的”。"]}
{"word":"phren","summary":{"en":"-phren- is a Greek-derived root meaning “mind” (and in some terms, “diaphragm”), used mainly in scientific/medical vocabulary.","zh":"-phren- 是源自希腊语的词根，主要表示“心智/精神”（在部分术语中也指“膈肌”），多用于科学与医学词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root (from Greek) meaning “mind,” “thinking,” or sometimes “diaphragm”; seen in some English scientific/medical terms","zh":"词根（源自希腊语），表示“心智/思想/思考”，在某些词里也可指“膈肌”；常见于英语的科学或医学术语中"},"examples":[{"en":"In the word “schizophrenia,” -phren- relates to the mind.","zh":"在“schizophrenia（精神分裂症）”这个词里，-phren- 与“心智/精神”有关。"},{"en":"“Phrenology” is an old theory that tried to read personality from the shape of the skull.","zh":"“phrenology（颅相学）”是一种过时的理论，试图通过头骨形状来判断性格。"},{"en":"The “phrenic nerve” controls movement of the diaphragm for breathing.","zh":"“phrenic nerve（膈神经）”控制膈肌运动，帮助呼吸。"}]}],"synonyms":["psycho-","ment-"],"phonetic":"/frɛn/","extraExplanation":["-phren- 来自古希腊语 *phrēn*，古人认为“心智/情绪/意志”与胸腔（尤其膈肌一带）有关，所以这个词根在不同词里会出现“精神/心智”或“膈肌”的含义。","常见相关词：**schizophrenia**（精神分裂症）、**phrenology**（颅相学，已不被现代科学认可）、**phrenic**（膈的；膈神经的）。与它意思接近的常见词根有 **psycho-**（心理）、**ment-**（心智）。"]}
{"word":"phrenesia","summary":{"en":"A rare, old-fashioned word meaning a frenzy or delirious agitation.","zh":"一个罕见、较古旧的词，表示“狂乱/谵妄般的激动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A state of extreme mental agitation or delirious excitement; a frenzy.","zh":"（罕见/古旧）极度精神激动或近似谵妄的兴奋状态；狂乱。"},"examples":[{"en":"In the old story, the crowd fell into phrenesia after the shocking news.","zh":"在那个旧故事里，人群听到震惊的消息后陷入了狂乱。"},{"en":"He wrote of war not as glory, but as phrenesia that swallowed reason.","zh":"他写战争不是荣耀，而是一种吞噬理性的狂乱。"}]}],"synonyms":["frenzy","delirium","madness","mania","hysteria"],"phonetic":"/frəˈniːʒə/","extraExplanation":["“phrenesia”在现代英语里非常少见，更常用的词是“frenzy”（狂乱）或“delirium”（谵妄）。如果你是在古书、诗歌或较旧的文本里看到它，通常表达的是一种失控、近乎精神错乱的兴奋或激动。","词根“phren-”在一些英语词里和“心智/精神”有关（如“schizophrenia”里的“-phren-”源自希腊语，历史上与“mind”相关）。因此“phrenesia”带有“精神层面的狂乱/激越”这种语感。","拼写上它容易与“frenesia / frenesia”（某些语言或旧式拼法）混淆；在现代写作中建议改用更常见的同义词，除非你刻意追求古典或文学风格。"]}
{"word":"phrenesiac","summary":{"en":"Phrenesiac is a rare, old-fashioned word meaning a delirious person or something/someone wildly agitated (frantic).","zh":"Phrenesiac 是一个罕见的旧用词，可指“谵妄/狂乱的人”，也可作形容词表示“狂乱的、极度激动的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, old-fashioned) A person who is delirious or violently excited, as if from a fever or mental disturbance.","zh":"（罕见、旧用）狂乱者；谵妄或极度激动的人，仿佛因发热或精神紊乱而失常。"},"examples":[{"en":"In the old tale, the phrenesiac raved through the night and frightened the household.","zh":"在那则旧故事里，那名狂乱者整夜胡言乱语，把全家都吓坏了。"},{"en":"The doctor tried to calm the phrenesiac before giving any medicine.","zh":"医生在用药前先试着安抚那位谵妄的病人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, old-fashioned) Experiencing delirium or wild agitation; frantic.","zh":"（罕见、旧用）谵妄的；狂乱的；极度激动、慌乱的。"},"examples":[{"en":"He gave a phrenesiac shout and ran into the storm.","zh":"他发出一声狂乱的喊叫，冲进暴风雨中。"},{"en":"The novel describes phrenesiac scenes of panic in the streets.","zh":"小说描写了街头一幕幕狂乱的恐慌场景。"}]}],"synonyms":["frenzied","frantic","delirious","mad","raving"],"phonetic":"/ˌfrɛnəˈziːæk/","extraExplanation":["这个词在现代英语里非常少见，多见于19世纪及更早的文学或医学语境。","词源与希腊语有关：phren-（与“心智/精神”相关的词根）+ -itis（炎症），早期医学里曾用 *phrenitis* 指伴随发热的“脑部/精神性炎症”导致的谵妄；因此 *phrenesiac* 带有“像发热谵妄般狂乱”的古典色彩。","现代写作中更常用的替代表达有：*delirious, frenzied, frantic, hysterical*；医学语境则常用 *delirium*。"]}
{"word":"phrenesis","summary":{"en":"Phrenesis is a rare, old word meaning feverish delirium (historically medical) or, in literature, a state of frenzy.","zh":"Phrenesis 是个少见的古旧词，可指（历史医学语境中的）高热引起的谵妄，也可在文学中指狂热、疯狂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned/medical) Delirium caused by a high fever or inflammation of the brain; a state of confused, feverish thinking.","zh":"（古旧/医学用语）因高烧或脑部炎症引起的谵妄；一种发热性、混乱的神志状态。"},"examples":[{"en":"In the old medical text, phrenesis was described as delirium with a burning fever.","zh":"在那本古老的医学著作中，phrenesis 被描述为伴随高热的谵妄。"},{"en":"The doctor feared the infection could lead to phrenesis if the fever rose further.","zh":"医生担心如果继续高烧，感染可能会导致 phrenesis（谵妄）。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) A wild, irrational excitement; frenzy.","zh":"（文学用法）狂乱的兴奋；疯狂、癫狂。"},"examples":[{"en":"The crowd worked itself into phrenesis as the music grew louder.","zh":"随着音乐越来越响，人群逐渐陷入 phrenesis 般的狂热。"},{"en":"He wrote in a kind of phrenesis, barely stopping to breathe.","zh":"他以一种近乎 phrenesis 的状态写作，几乎不停下来喘口气。"}]}],"synonyms":["delirium","frenzy","madness","mania"],"phonetic":"/fɹəˈniːsɪs/","extraExplanation":["词源来自希腊语 *phrēn*（心智、理智）相关词根。早期医学里它常被当作“脑热/脑部炎症导致的谵妄”来讨论，现代英语中非常少见，多出现在历史医学、古典文学或刻意文风的写作里。","不要与 *frenzy*（疯狂、狂热）混淆：两者意义接近，但 *phrenesis* 更偏古旧、文学或历史医学语境。"]}
{"word":"phrenetic","summary":{"en":"“Phrenetic” means extremely frantic or wildly energetic; it’s a less common variant of “frenetic.”","zh":"“phrenetic”意为“极度慌乱/疯狂有活力的”；它是较少见的“frenetic”的变体拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wildly excited, frantic, or done with uncontrolled energy.","zh":"极度兴奋的；疯狂的；慌乱的（带有失控的能量）"},"examples":[{"en":"The newsroom was phrenetic on election night.","zh":"选举之夜，新闻编辑部一片忙乱、紧张。"},{"en":"She made a phrenetic attempt to finish the report before the deadline.","zh":"她在截止时间前疯狂赶工，想把报告写完。"},{"en":"The crowd’s phrenetic cheering shook the stadium.","zh":"人群疯狂的欢呼声震动了体育场。"}]}],"synonyms":["frenetic","frantic","hectic","feverish","wild"],"phonetic":"/frəˈnɛtɪk/","extraExplanation":["“phrenetic”较少见，更常见的表达是“frenetic”（同义，拼写更常用）。你可能会在较正式或文学性较强的语境中见到“phrenetic”，含义与“frenetic”基本一致。","词源上与希腊语“phren-（心智/精神）”相关，因此带有“精神亢奋、近乎失控”的色彩；现代英语里主要用于形容节奏、活动或情绪非常狂乱。"]}
{"word":"phrenetical","summary":{"en":"Phrenetical means “frenzied or wildly excited,” and it’s an older form of phrenetic.","zh":"phrenetical 意为“狂乱的/极度激动的”，是较古旧的 phrenetic 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Frenzied, wildly excited, or delirious (an older/less common form of “phrenetic”).","zh":"狂乱的；极度激动的；近乎谵妄的（较古旧/少见的形式，相当于 phrenetic）。"},"examples":[{"en":"The crowd grew phrenetical when the singer stepped onstage.","zh":"歌手一登台，人群就变得近乎狂热。"},{"en":"In the novel, his phrenetical laughter shows how fear has unbalanced him.","zh":"小说里，他那种狂乱的笑声表现出恐惧已让他失去平衡。"}]}],"synonyms":["phrenetic","frenzied","frantic","wild","hysterical"],"phonetic":"/fɹəˈnɛtɪkəl/","extraExplanation":["“Phrenetical” 是较古旧的拼写/用法，现代英语更常用 “phrenetic”。在阅读旧文学、宗教文本或早期散文时更可能遇到。","词源与古希腊语有关：phren- 与“心智/精神”相关，早期也与“谵妄、精神错乱”之意相连，因此这个词常带有“失控、近乎疯狂”的语感。","语体提示：日常表达中更自然的替换词包括 “frantic”（慌乱的），“frenzied”（狂乱的），“hysterical”（歇斯底里的，视语境而定）。"]}
{"word":"phrenetically","summary":{"en":"“Phrenetically” means doing something wildly fast and excited or panicked, often in an uncontrolled way.","zh":"“phrenetically”指做事疯狂迅速、极度兴奋或慌乱，常带有失控感。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a wildly fast, panicked, or very excited way, often with little control.","zh":"以疯狂地、慌乱地或极度兴奋地方式（常带有缺乏控制之感）。"},"examples":[{"en":"She typed phrenetically to finish the report before the deadline.","zh":"她疯狂地敲键盘，想在截止时间前完成报告。"},{"en":"Fans waved signs phrenetically as the band came on stage.","zh":"乐队一上台，粉丝们就激动地疯狂挥舞标语牌。"},{"en":"He searched phrenetically for his passport at the airport.","zh":"他在机场慌乱地四处找护照。"}]}],"synonyms":["frantically","feverishly","wildly","desperately"],"phonetic":"/frəˈnɛtɪkli/","extraExplanation":["“phrenetically”来自形容词“phrenetic”（意为“狂热的、癫狂的”）。它比“quickly/fast”更强调情绪强烈（惊慌、兴奋、压力）导致的“失控式”快速动作。","常见搭配：work/type/write phrenetically（拼命工作/疯狂打字/急写）、search/look around phrenetically（慌乱地寻找/张望）、wave/cheer phrenetically（狂热地挥舞/欢呼）。","语体提示：用于描写场面或人物状态时很生动，但在正式写作中频繁使用可能显得夸张，可用“frantically”或“feverishly”替换以调整语气。"]}
{"word":"phreneticness","summary":{"en":"“Phreneticness” is a rare noun meaning a frantic, high-energy, out-of-control busyness; most writers use “freneticness” or “frenzy.”","zh":"“phreneticness”是个很少见的名词，表示狂乱、急促、近乎失控的忙乱状态；更常用“freneticness”或“frenzy”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being very fast, agitated, and energetic in a way that feels out of control; frantic activity (rare spelling/formation; usually written as “freneticness” or more commonly “frenzy”).","zh":"（罕见拼写/构词）指“狂乱、慌乱而高速”的状态或性质；形容活动急促、躁动、近乎失控（更常见写法为 freneticness，或更常用词 frenzy）。"},"examples":[{"en":"By the end of the day, the office had a kind of phreneticness that made it hard to think clearly.","zh":"到了一天快结束时，办公室里有种近乎狂乱的忙乱感，让人很难清晰思考。"},{"en":"The phreneticness of the crowd rose when the doors finally opened.","zh":"大门终于打开时，人群的躁动与兴奋明显升级了。"}]}],"synonyms":["frenzy","franticness","hecticness","hysteria","turmoil"],"phonetic":"/frəˈnɛtɪknəs/","extraExplanation":["“phreneticness”非常少见，读者更可能看到的是“freneticness”（由形容词 frenetic ‘狂乱的、急促的’ + -ness 构成）或直接用名词“frenzy”（狂热、疯狂的忙乱）。","“phrenetic-”这个拼写有时被当作“frenetic”的变体，但也可能让人联想到希腊语词根 *phren-*（与“mind/精神”相关，如 phrenology ‘颅相学’）。在现代英语里，表达“忙乱、急促”时通常选 frenetic，而不是 phrenetic。","写作建议：正式或通用语境中优先用“frenetic pace / frenetic activity / frenzy”。如果用“phreneticness”，最好确保读者能理解或在上下文中加以说明。"]}
{"word":"phreneticus","summary":{"en":"Phreneticus is a rare Latin-based term meaning “delirious/frenzied,” and sometimes “a delirious person,” mostly found in older medical or historical writing.","zh":"Phreneticus 是源自拉丁语的罕见词，意为“神志错乱/狂乱的”，有时也指“神志错乱的人”，多见于旧医学或历史文献。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; Latin/medical-historical) Delirious or frenzied; relating to acute mental confusion or mania.","zh":"（罕见；拉丁语/医学史用语）神志错乱的；狂乱的；与急性精神混乱或躁狂相关的。"},"examples":[{"en":"In some old medical texts, a patient with high fever might be described as phreneticus.","zh":"在一些旧的医学文献里，高烧的病人可能会被描述为 phreneticus（神志错乱）。"},{"en":"The historian notes that “phreneticus” was once used to label people thought to be violently delirious.","zh":"历史学者指出，“phreneticus”曾被用来指被认为严重谵妄、举止激烈的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; Latin) A delirious person; someone in a frenzy.","zh":"（罕见；拉丁语）神志错乱者；狂乱的人。"},"examples":[{"en":"The record calls him a phreneticus, unable to recognize his family.","zh":"记录称他为 phreneticus，已经认不出家人。"}]}],"synonyms":["delirious","frantic","frenzied","raving"],"phonetic":"/frəˈnɛtɪkəs/","extraExplanation":["这个词主要见于拉丁文或早期英语医学/神学/法庭记录中，不是现代日常英语用词。现代英语更常用 delirious（谵妄的）、frantic（发狂似的）、frenzied（狂乱的）。","词源上与希腊语词根 phrēn-（意为“心智/精神”）相关，也常与 phrenitis（古代对“脑部炎症/谵妄”的说法）联系在一起。","在古文献里，它有时带有强烈的历史偏见：把精神症状简单归为“疯狂”。阅读此类文本时可注意其时代背景与用词局限。"]}
{"word":"phrenia","summary":{"en":"Phrenia is a rare medical word-part meaning “mind” or “mental disorder,” mainly seen in terms like schizophrenia.","zh":"Phrenia 是较罕见的医学构词成分，表示“心智/精神”或“精神障碍”，多见于 schizophrenia 等术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare; used mainly in medical terms) a suffix/combining form meaning “mind” or “mental condition/disorder,” seen in words like schizophrenia and hebephrenia.","zh":"（罕见；主要见于医学术语）作后缀/构词成分，表示“心智、精神”或“精神状态/精神障碍”，常见于 schizophrenia（精神分裂症）、hebephrenia（青春型精神分裂症）等词中。"},"examples":[{"en":"In “schizophrenia,” the element “-phrenia” refers to the mind.","zh":"在“schizophrenia（精神分裂症）”一词中，“-phrenia”这个部分指“心智/精神”。"},{"en":"Older psychiatric terms like “hebephrenia” also contain “-phrenia.”","zh":"较早的精神病学术语如“hebephrenia（青春型精神分裂症）”也包含“-phrenia”。"}]}],"synonyms":["-phrenic (related form)","phren- (related root)"],"phonetic":"/ˈfriːniə/","extraExplanation":["“-phrenia”来自古希腊语 phrēn（φρήν），原义与“心智、思想”相关，也曾指“膈肌/胸腹之间的部位”；古人常把情感与思维活动与身体某些部位联系起来，因此这个词根在英语中既能引申为“精神/心智”，也偶尔与解剖学含义有关。","现代英语里单独写作“phrenia”并不常见，多数情况下你会在复合医学词中遇到它；日常表达“精神疾病”通常用 mental illness / mental disorder 等更通用的说法。"]}
{"word":"phrenic","summary":{"en":"Phrenic means “related to the diaphragm or the phrenic nerve” in medical English.","zh":"phrenic 在医学英语中表示“与膈肌或膈神经有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the diaphragm (the main breathing muscle) or the phrenic nerve, which controls the diaphragm.","zh":"与膈肌（主要的呼吸肌）或膈神经有关的；膈神经负责控制膈肌运动。"},"examples":[{"en":"The doctor checked for phrenic nerve damage after the surgery.","zh":"手术后，医生检查是否有膈神经损伤。"},{"en":"Phrenic nerve stimulation can help some patients breathe more effectively.","zh":"膈神经刺激可以帮助一些患者更有效地呼吸。"}]}],"synonyms":["diaphragmatic (often used for the diaphragm itself)"],"phonetic":"/ˈfrɛnɪk/","extraExplanation":["“phrenic”来自希腊语词根 phrēn，历史上可指“心智/精神”或“横膈膜”。在现代医学英语里，这个词几乎总是指“膈肌/膈神经”，而不是“精神上的”。","常见搭配：phrenic nerve（膈神经）、phrenic palsy/paralysis（膈神经麻痹/膈肌瘫痪）、phrenic stimulation（膈神经刺激）、phrenic artery/vein（与膈相关的动脉/静脉，较少见）。"]}
{"word":"phrenicectomy","summary":{"en":"Phrenicectomy is the surgical removal of the phrenic nerve, often causing paralysis of the diaphragm on one side.","zh":"Phrenicectomy 指切除膈神经的手术，常导致一侧膈肌麻痹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation in which the phrenic nerve (the nerve that controls the diaphragm) is removed or resected, usually to paralyze the diaphragm on one side.","zh":"膈神经切除术：一种外科手术，将膈神经（控制膈肌的神经）切除或部分切除，通常用于使一侧膈肌麻痹。"},"examples":[{"en":"Historically, phrenicectomy was used to intentionally paralyze one side of the diaphragm.","zh":"在历史上，膈神经切除术曾被用来有意让一侧膈肌瘫痪。"},{"en":"Because it can reduce breathing capacity, phrenicectomy is rarely performed today.","zh":"由于可能降低呼吸能力，膈神经切除术如今很少实施。"}]}],"synonyms":["phrenic nerve resection","phrenicotomy (related: cutting the phrenic nerve)"],"phonetic":"/frəˈnɛk.tə.mi/","extraExplanation":["这个词由 phrenic（“膈的、与膈神经有关的”，源自希腊语 phrēn，古义与“心智/精神”有关，但在现代医学中主要指“膈”）+ -ectomy（“切除术”）构成。","在抗生素出现之前，医生曾用膈神经切除/破坏来让膈肌上抬、减少肺部活动，作为治疗肺结核等疾病的“塌陷疗法”（collapse therapy）之一；现代临床已基本被更安全有效的方法取代。"]}
{"word":"phrenicocolic","summary":{"en":"A medical adjective meaning “related to the diaphragm and the colon,” most often used in the term phrenicocolic ligament.","zh":"医学形容词，指“与膈肌和结肠有关的”，最常见于短语 phrenicocolic ligament（膈结肠韧带）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phrenic) and the colon (colic), especially in reference to an anatomical structure connecting them.","zh":"（解剖）与膈肌（phrenic）和结肠（colic）都有关的；尤指连接两者的解剖结构。"},"examples":[{"en":"The surgeon identified the phrenicocolic ligament near the splenic flexure of the colon.","zh":"外科医生在结肠脾曲附近辨认出了膈结肠韧带（phrenicocolic ligament）。"},{"en":"In anatomy class, we learned how the phrenicocolic ligament supports the spleen indirectly.","zh":"在解剖课上，我们学习了膈结肠韧带如何间接支撑脾脏。"}]}],"synonyms":["diaphragmatic-colic (rare)","related to the phrenicocolic ligament"],"phonetic":"/ˌfrɛnɪkoʊˈkɑlɪk/","extraExplanation":["这是一个医学/解剖学术语，常见搭配是 **phrenicocolic ligament**（膈结肠韧带），也被称为“sustentaculum lienis（脾托）”，因为它位于结肠脾曲附近，可在体位变化时对脾脏起到一定支托作用。","词源上由三部分构成：**phrenico-**（与膈肌有关）+ **-colic**（与结肠有关）。日常英语中几乎不用，主要出现在解剖学教材、影像学报告和手术记录中。"]}
{"word":"phrenicocostal","summary":{"en":"An anatomical adjective meaning “related to the diaphragm and the ribs.”","zh":"一个解剖学形容词，表示“与膈肌和肋骨（肋部）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm and the ribs (the costal region).","zh":"（解剖）与膈肌和肋骨（肋部）两者都有关的。"},"examples":[{"en":"Pain near the lower ribs can sometimes involve phrenicocostal muscles and connective tissue.","zh":"下肋附近的疼痛有时可能与膈肋相关的肌肉和结缔组织有关。"},{"en":"The report described phrenicocostal attachments of the diaphragm to the rib cage.","zh":"报告描述了膈肌与胸廓肋骨的膈肋相关附着点。"}]}],"synonyms":["diaphragmatic-costal","costodiaphragmatic"],"phonetic":"/ˌfrɛnɪkoʊˈkɑstəl/","extraExplanation":["词源拆解：phrenico- 来自 phrenic（与膈肌/膈神经有关），costal 来自 costa（肋骨）。合在一起通常用于医学或解剖语境，表示“同时涉及膈肌与肋骨的”。","该词较少出现在日常英语，多见于解剖学描述（如肌肉、筋膜、附着点、间隙/窦等结构的命名或描述）。"]}
{"word":"phrenicogastric","summary":{"en":"A rare anatomical adjective meaning “related to the diaphragm and the stomach.”","zh":"一个少见的解剖学形容词，表示“与膈肌和胃有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both the diaphragm (phrenic) and the stomach (gastric); used mainly in anatomy to describe structures connecting or involving these two areas.","zh":"（解剖学）与膈肌（phrenic）和胃（gastric）都有关的；多用于描述连接或涉及这两处的结构。"},"examples":[{"en":"The surgeon noted a small phrenicogastric attachment near the upper stomach.","zh":"外科医生注意到上胃附近有一处小的膈肌-胃连接结构。"},{"en":"In some textbooks, the phrenicogastric ligament is described as part of the peritoneal folds.","zh":"在一些教材中，膈肌-胃韧带被描述为腹膜褶的一部分。"}]}],"synonyms":["phrenogastric"],"phonetic":"/ˌfrɛnɪkoʊˈɡæstrɪk/","extraExplanation":["这是一个非常少见、偏专业的医学/解剖学用词，通常出现在“phrenicogastric ligament（膈肌-胃韧带）”等搭配中。","词源上可拆分理解：phrenico- 来自 phrenic（与膈神经/膈肌有关），-gastric 来自 gastric（与胃有关）。因此看到类似的复合词时，可以用“X + Y → 与X和Y都相关”来推断大意。","实际阅读中也可能遇到拼写变体 phrenogastric（更常见一些），含义相近。"]}
{"word":"phrenicoglottic","summary":{"en":"A rare medical adjective meaning “involving both the diaphragm and the glottis.”","zh":"一个罕见的医学形容词，表示“同时涉及膈肌与声门（声带开口）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phrenic) and the glottis (the opening between the vocal cords).","zh":"（形容词）与膈肌（phrenic）以及声门/声门裂（glottic，声带之间的开口）都有关的。"},"examples":[{"en":"Researchers discussed a possible phrenicoglottic reflex that links breathing muscle activity with vocal-cord control.","zh":"研究人员讨论了一种可能的“膈肌—声门反射”，把呼吸肌活动与声带控制联系起来。"},{"en":"The paper used the term phrenicoglottic to describe coordination between diaphragm movement and glottic closure.","zh":"论文用 phrenicoglottic 来描述膈肌运动与声门关闭之间的协调。"}]}],"synonyms":["diaphragmo-glottic (rare)"],"phonetic":"/ˌfrɛnɪkoʊˈɡlɑtɪk/","extraExplanation":["这是一个非常少见的医学/解剖学术语，多见于学术论文而非日常英语。","构词：phrenico- 来自 phrenic（与膈神经/膈肌有关），glottic 来自 glottis（声门）。合在一起强调“呼吸（膈肌）与发声/气道保护（声门）之间的联动”。","常见相关词：phrenic nerve（膈神经）、glottis（声门）、glottic closure（声门关闭）、diaphragmatic breathing（膈式呼吸）。"]}
{"word":"phrenicohepatic","summary":{"en":"An anatomical adjective meaning “related to the diaphragm and the liver.”","zh":"一个解剖学形容词，意为“与膈肌和肝脏相关的（膈—肝之间的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phrenic) and the liver (hepatic); used mainly in anatomy to describe a ligament, fold, or connection between the diaphragm and the liver.","zh":"（解剖）与膈（phrenic）和肝（hepatic）都有关的；多用于描述膈与肝之间的韧带、腹膜皱襞或连接结构。"},"examples":[{"en":"The phrenicohepatic ligament helps connect the liver to the diaphragm.","zh":"膈肝韧带帮助把肝脏与膈肌连接起来。"},{"en":"The surgeon noted a thin phrenicohepatic fold during the procedure.","zh":"手术中，外科医生观察到一条薄的膈肝皱襞。"}]}],"synonyms":["phrenic-hepatic","diaphragmatic-hepatic"],"phonetic":"/ˌfrɛnɪkoʊhɪˈpætɪk/","extraExplanation":["这是一个医学/解剖学复合词：phrenico- 来自 phrenic（与膈/膈神经相关），hepatic 来自希腊语 hēpar（肝）。意思通常就是“膈—肝之间的”。","在临床或影像学语境里，你更常见到的是具体结构名词（如 phrenicohepatic ligament），而不是单独把 phrenicohepatic 当普通形容词使用。"]}
{"word":"phrenicolienal","summary":{"en":"A rare medical adjective meaning “related to the diaphragm and the spleen.”","zh":"一个少见的医学形容词，意思是“与膈肌和脾脏有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phrenic) and the spleen (lienal); used mainly in anatomy/medicine to describe structures (such as ligaments, vessels, or regions) connected with the diaphragm and the spleen.","zh":"（医学/解剖）与膈肌（phrenic）和脾脏（lienal）两者有关的；常用于描述连接或涉及膈肌与脾脏的结构（如韧带、血管或解剖区域）。"},"examples":[{"en":"The surgeon examined the phrenicolienal ligament during the procedure.","zh":"手术过程中，外科医生检查了膈脾韧带（phrenicolienal ligament）。"},{"en":"Pain in the left upper abdomen can sometimes involve phrenicolienal structures.","zh":"左上腹疼痛有时可能牵涉到膈肌与脾脏相关的结构。"}]}],"synonyms":["phrenicosplenic","diaphragmosplenic"],"phonetic":"ˌfrɛnɪkoʊˈliːnəl","extraExplanation":["这个词非常少见，多见于较旧或较专业的医学/解剖文献。它由两部分构成：phrenico-（与膈肌有关）+ lienal（与脾脏有关；lien 是“脾”的旧用词根）。现代文献中更常见的近义表达有 phrenicosplenic（膈脾的）或直接用 “diaphragmatic and splenic”（膈肌与脾脏的）来说明。"]}
{"word":"phrenicopericardiac","summary":{"en":"Phrenicopericardiac describes something involving both the phrenic nerve/diaphragm and the pericardium.","zh":"phrenicopericardiac 用来形容同时与膈神经/膈肌和心包有关的结构或区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the phrenic nerve (or diaphragm) and the pericardium (the sac around the heart).","zh":"与膈神经（或膈肌）以及心包（包绕心脏的膜囊）有关的；膈神经-心包的。"},"examples":[{"en":"The surgeon carefully avoided injury to the phrenicopericardiac region.","zh":"外科医生小心避免损伤膈神经-心包相关区域。"},{"en":"Inflammation near the phrenicopericardiac area can cause pain that feels worse when breathing deeply.","zh":"膈神经-心包附近的炎症可能引起疼痛，深呼吸时会更明显。"}]}],"synonyms":["phrenic-pericardial","phrenic and pericardial (descriptive)"],"phonetic":"/ˌfrɛnɪkoʊˌpɛrɪˈkɑrdiˌæk/","extraExplanation":["这是一个非常专业的解剖/医学形容词，常见于手术记录、解剖描述或影像学报告中；日常英语里几乎不会用到。","词形由 phrenico-（与膈/膈神经有关）+ pericardiac（与心包有关）组合而成，用来说明“同时涉及膈神经/膈肌与心包”的结构或区域。"]}
{"word":"phrenicosplenic","summary":{"en":"A medical adjective meaning ‘involving the diaphragm and the spleen.’","zh":"医学形容词：指“与膈和脾脏共同相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phrenic) and the spleen.","zh":"（医学）与膈（膈神经/膈肌）和脾脏两者都有关的。"},"examples":[{"en":"The scan suggested a phrenicosplenic adhesion after the patient’s surgery.","zh":"影像检查提示患者术后可能存在膈-脾粘连。"},{"en":"The report described a phrenicosplenic ligament variant near the upper left abdomen.","zh":"报告描述了左上腹附近一种膈-脾韧带的变异。"}]}],"synonyms":["splenophrenic (esp. referring to the splenophrenic ligament)"],"phonetic":"/ˌfrɛnɪkoʊˈspliːnɪk/","extraExplanation":["这是一个较少见的医学复合词：phrenico- 来自 phrenic（与膈、膈神经或膈肌有关），-splenic 来自 spleen（脾脏）。多见于解剖学或影像/手术记录，用来描述“膈与脾之间”的韧带、粘连或相关区域。","在实际医学英语里，更常见的表达有 “diaphragmatic and splenic” 或具体说 “splenophrenic (ligament)”（脾-膈韧带）等。"]}
{"word":"phrenicotomy","summary":{"en":"A rare medical term meaning surgery to cut the phrenic nerve, often to paralyze the diaphragm on one side.","zh":"较少见的医学术语，指切断膈神经的手术，常使一侧膈肌麻痹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that cuts (severs) the phrenic nerve, usually to paralyze one side of the diaphragm","zh":"膈神经切断术：通过手术切断膈神经，通常使一侧膈肌麻痹（瘫痪）的手术"},"examples":[{"en":"Historically, phrenicotomy was sometimes used to reduce movement of one lung.","zh":"在历史上，膈神经切断术有时用于减少一侧肺部的运动。"},{"en":"The surgeon discussed phrenicotomy only as a last-resort, high-risk option.","zh":"外科医生只把膈神经切断术作为最后手段、风险较高的选择来讨论。"}]}],"synonyms":["phrenic neurectomy","phrenicotomy (rare variant spellings)"],"phonetic":"/ˌfrɛnɪˈkɑːtəmi/","extraExplanation":["词源：phrenic（膈神经的）+ -otomy（切开/切断的手术），字面意思就是“对膈神经进行切开/切断的手术”。","历史背景：在抗生素普及之前，部分胸外科/结核治疗中曾尝试通过使膈肌麻痹来减少肺部活动（类似“塌陷疗法”思路），但现代临床已较少使用，更多由更安全、可逆或更精准的治疗方式取代。","相关术语：phrenic nerve（膈神经）；neurectomy（神经切除术）；phrenic nerve crush（膈神经压碎术，历史上也曾用于达到类似目的）。"]}
{"word":"phrenics","summary":{"en":"“Phrenics” means the phrenic nerves—nerves that control the diaphragm for breathing.","zh":"“phrenics”指膈神经：控制膈肌、与呼吸相关的神经。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The phrenic nerves (the pair of nerves that control the diaphragm and help you breathe).","zh":"（解剖）膈神经（控制膈肌、协助呼吸的一对神经）。"},"examples":[{"en":"Damage to the phrenics can make breathing difficult.","zh":"膈神经受损会让呼吸变得困难。"},{"en":"The surgeon carefully avoided the phrenics during the operation.","zh":"手术中外科医生小心避开膈神经。"}]}],"synonyms":["phrenic nerves","the phrenic nerves"],"phonetic":"/ˈfrɛnɪks/","extraExplanation":["“phrenics”是“phrenic”的复数名词用法，属于医学/解剖学语境；日常英语里更常说“the phrenic nerve(s)”。","词根来自希腊语 *phrēn / phren-*，历史上与“膈肌、心智/精神”相关；因此你也会看到“phrenology（颅相学）”等同源词，但那与“膈神经”不是同一概念。"]}
{"word":"phrenitic","summary":{"en":"Phrenitic means ‘having or relating to severe delirium/brain inflammation,’ a rare, old-fashioned term.","zh":"phrenitic 指“与严重谵妄/脑部炎症有关的；患此症的”，属于罕见且偏旧式的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or suffering from acute delirium or a severe inflammation affecting the brain (historically called “phrenitis”).","zh":"与急性谵妄或（旧时所称的）脑部严重炎症“phrenitis（脑炎/狂热性谵妄）”有关的；患此症的。"},"examples":[{"en":"In older medical writing, a patient with a high fever and confusion might be described as phrenitic.","zh":"在较早的医学文献中，高烧并出现意识混乱的病人可能会被描述为 phrenitic。"},{"en":"The novel portrays him as phrenitic, speaking in fragments and unable to recognize his family.","zh":"小说把他写成 phrenitic 的状态：断断续续地说话，甚至认不出家人。"}]}],"synonyms":["delirious","frantic","feverish","mad (literary/old use)"],"phonetic":"/frəˈnɪtɪk/","extraExplanation":["词源提示：phrenitic 来自 phrenitis（旧医学用语），源于希腊语 *phrēn*（古义可指“心智/思考”，也被用来指身体内部器官）。因此它常见于古典或文学化的英语中，而现代医学通常会用更具体的诊断词（如 encephalitis、delirium 等）来替代。","语域提示：这是非常罕见且带年代感的词，多用于引用旧文献、文学描写或历史语境；日常英语中几乎不用。"]}
{"word":"phrenitis","summary":{"en":"Phrenitis is an old term for feverish delirium once believed to be brain inflammation; rarely, it can mean a frenzy.","zh":"Phrenitis 是旧时指伴随高热的谵妄（曾被认为是脑部炎症）的词；少见时也可比喻“狂热/发狂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical medicine) A severe mental disturbance with fever, especially delirium once thought to come from inflammation of the brain; “brain fever.”","zh":"（历史医学用语）一种伴随发热的严重精神紊乱，尤指谵妄；旧称“脑热/脑炎性狂乱”。"},"examples":[{"en":"In older medical texts, phrenitis described a high fever with confusion and hallucinations.","zh":"在较早的医学文献中，phrenitis 用来描述高烧伴随意识混乱和幻觉的情况。"},{"en":"The novel’s doctor uses the word phrenitis to suggest the patient is delirious rather than simply anxious.","zh":"小说里的医生用 phrenitis 一词，强调病人是谵妄，而不只是焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A state of frantic or irrational excitement; a frenzy.","zh":"（比喻义，少见）疯狂、失控的兴奋状态；狂热。"},"examples":[{"en":"The crowd worked itself into a kind of phrenitis over the rumor.","zh":"人群因那则传闻陷入一种近乎失控的狂热。"}]}],"synonyms":["delirium","brain fever","frenzy","mania"],"phonetic":"/frɪˈnaɪtɪs/","extraExplanation":["该词在现代英语中非常少见，多见于古典文学、医学史或拉丁/希腊传统的写作。现代医学不会用 phrenitis 作为正式诊断，常用更具体的词，如 delirium（谵妄）、encephalitis（脑炎）或 meningitis（脑膜炎）。","词源来自希腊语 *phrēn/phren-*（与“心智、思想”相关）+ *-itis*（“炎症”）。因此字面含义接近“心智/大脑的炎症”。"]}
{"word":"phreno","summary":{"en":"phreno- is a prefix used in some terms meaning either “mind” or “diaphragm,” depending on the word.","zh":"phreno- 是一个构词前缀，在不同词中可表示“心智/精神”或“膈（膈肌）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “mind” or “mental processes,” used in some older or specialized terms","zh":"（构词成分）表示“心智、精神活动”，常见于较旧或较专业的词汇中"},"examples":[{"en":"The word “phrenology” uses phreno- to refer to the mind.","zh":"“phrenology（颅相学）”里的 phreno- 指“心智/精神”。"},{"en":"In older writings, phreno- sometimes appears in terms about psychology.","zh":"在较旧的文献里，phreno- 有时会出现在与心理学相关的术语中。"}]},{"partOfSpeech":"other","definition":{"en":"a combining form meaning “diaphragm,” especially in medical terms related to the phrenic nerve","zh":"（构词成分）表示“膈（膈肌）”，尤用于与膈神经（phrenic nerve）相关的医学术语"},"examples":[{"en":"“Phrenic nerve” is related to breathing and the diaphragm.","zh":"“phrenic nerve（膈神经）”与呼吸和膈肌有关。"},{"en":"Doctors may use phreno- in technical terms involving the diaphragm.","zh":"医生可能会在涉及膈肌的专业术语中使用 phreno-。"}]}],"synonyms":["phren-","-phrenia","phrenic"],"phonetic":"/ˈfriːnoʊ/","extraExplanation":["phreno- 来自希腊语词根 *phrēn*（复数 *phrenes*）。在古希腊文化里，*phrēn* 既可指“心智/思想”，也可指人体内部器官（常被理解为与情感和生命活动相关的部位），因此在英语里出现了“心智”和“膈肌”两条含义分支。","常见相关词：**phrenology**（颅相学，历史上流行但已被认为不科学）、**schizophrenia**（精神分裂症；词源上含 phren-，但现代医学解释不等同于“人格分裂”）、**phrenic**（膈的/与膈神经有关的）。","学习提示：看到 phren-/phreno- 时，可以先结合上下文判断是“心理/精神”方向（如 psychology 相关词），还是“解剖/呼吸”方向（如 nerve、diaphragm 等医学词）。"]}
{"word":"phrenocardia","summary":{"en":"A rare medical term referring broadly to heart-related conditions connected with the diaphragm/phrenic nerve.","zh":"一个罕见的医学词，泛指与膈肌/膈神经相关的心脏问题或心脏位置变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A condition involving the heart and the diaphragm (especially the heart’s position or symptoms related to the diaphragm/phrenic nerve).","zh":"（医学）与心脏和膈肌相关的情况（尤指心脏位置的改变，或与膈肌/膈神经有关的心脏症状）。"},"examples":[{"en":"In older medical texts, phrenocardia was used to discuss the relationship between the diaphragm and the heart’s position.","zh":"在较早的医学文献中，phrenocardia 用来讨论膈肌与心脏位置之间的关系。"},{"en":"The report mentioned phrenocardia when describing chest discomfort linked to diaphragmatic irritation.","zh":"该报告在描述与膈肌刺激相关的胸部不适时提到了 phrenocardia。"}]}],"synonyms":["(rare) cardiophrenic condition","(contextual) diaphragmatic-related cardiac symptoms"],"phonetic":"/ˌfrɛnəˈkɑrdiə/","extraExplanation":["这是一个非常少见、偏旧的医学词汇，现代临床中通常不会作为标准诊断名使用，更常见的是用更具体的表达（如“膈肌升高导致心脏移位”“膈神经刺激相关症状”等）。","词根提示：phreno- 多与“膈肌/膈神经”有关，cardia 与“心脏”有关；理解词根有助于在阅读医学英语时快速抓住大意。"]}
{"word":"phrenocardiac","summary":{"en":"A rare medical adjective meaning “related to both the mind and the heart.”","zh":"一个罕见的医学形容词，意思是“与心理（精神）和心脏两者相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the mind (mental processes) and the heart (cardiac function); involving connections between psychological states and heart activity.","zh":"与心理（精神活动）和心脏（心脏功能）两者相关的；指心理状态与心脏活动之间的联系。"},"examples":[{"en":"The doctor discussed phrenocardiac effects of long-term stress, such as increased heart rate.","zh":"医生讨论了长期压力的心-脑（心理-心脏）影响，比如心率升高。"},{"en":"In some patients, phrenocardiac symptoms appear during panic attacks, including chest tightness and palpitations.","zh":"有些患者在惊恐发作时会出现心-脑相关症状，包括胸闷和心悸。"}]}],"synonyms":["psychocardiac","psychosomatic","mind-heart"],"phonetic":"/ˌfrɛnoʊˈkɑrdiæk/","extraExplanation":["这是一个非常少见、偏医学/学术的构词：phreno- 源自希腊语词根，常指“心智/精神”（历史上也曾与“大脑”或“思想”相关）；cardiac 指“心脏的”。合在一起强调“心理状态与心脏反应之间的关系”，在现代英语中更常用的相关领域说法是 psychocardiac（心理-心脏的）或 psychosomatic（身心相关的）。"]}
{"word":"phrenocolic","summary":{"en":"An anatomical adjective meaning “related to the diaphragm and the colon,” often seen in terms like the phrenocolic (phrenicocolic) ligament.","zh":"解剖学形容词，意为“与膈和结肠有关”，常见于“膈结肠韧带/襞”等术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the diaphragm (phreno-) and the colon (colic); most often used in anatomy to describe a structure connecting or associated with both, such as the phrenocolic (phrenicocolic) ligament.","zh":"（解剖学）与膈（phreno-）和结肠（colic）有关的；最常用于描述同时与膈和结肠相关或连接的结构，如“膈结肠韧带/膈结肠襞（phrenocolic / phrenicocolic ligament）”。"},"examples":[{"en":"The surgeon identified the phrenocolic ligament near the left colic flexure.","zh":"外科医生在左结肠曲附近辨认出了膈结肠韧带。"},{"en":"Pain in the upper abdomen can sometimes be discussed in relation to nearby phrenocolic anatomy.","zh":"上腹部疼痛有时会在讨论时联系到邻近的膈结肠相关解剖结构。"}]}],"synonyms":["phrenicocolic","phrenocolic ligament (term)"],"phonetic":"/ˌfriːnoʊˈkɑːlɪk/","extraExplanation":["这个词主要出现在医学/解剖学语境中，日常英语几乎不用。","词根拆解：phreno- 来自希腊语 *phrēn*，在现代医学里通常指“膈”；-colic 与“结肠（colon）”相关。","临床与解剖文献里更常见的拼写是 **phrenicocolic**（尤其指左侧的膈结肠韧带/襞），两者在很多资料中会被视为近义或互通。"]}
{"word":"phrenocostal","summary":{"en":"A medical/anatomical adjective meaning “related to the diaphragm and the ribs.”","zh":"一个医学/解剖学形容词，意思是“与膈肌和肋骨有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the diaphragm (phreno-) and the ribs (costal); used mainly in anatomy/medicine to describe structures, spaces, or attachments between/connecting the diaphragm and the rib cage.","zh":"（解剖/医学）与膈肌（phreno-）和肋骨（costal）有关的；常用于描述膈肌与肋廓之间或连接处的结构、间隙或附着点。"},"examples":[{"en":"The doctor noted tenderness near the phrenocostal region of the chest wall.","zh":"医生记录到胸壁膈肋相关区域附近有压痛。"},{"en":"Some fibers of the diaphragm attach along a phrenocostal margin.","zh":"膈肌的部分肌纤维沿膈肋缘附着。"}]}],"synonyms":["diaphragmatic-costal","costodiaphragmatic","phrenic and costal (descriptive)"],"phonetic":"/ˌfriːnoʊˈkɑstəl/","extraExplanation":["该词多见于专业解剖学/临床语境，日常英语几乎不用。","构词：phreno- 源自希腊语，指“膈肌”；costal 源自拉丁语 costa，指“肋骨/肋的”。合起来强调“膈肌—肋骨”这一解剖关联。","临床或影像报告中可能用类似表达来定位疼痛、压痛或病变位置；有时也会用更常见的说法如 “costal margin（肋缘）”“diaphragmatic（膈的）” 等替代。"]}
{"word":"phrenodynia","summary":{"en":"Phrenodynia means mental pain or psychological distress (a rare medical term).","zh":"phrenodynia 指“精神痛苦/心理折磨”（较少见的医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) mental pain or distress; psychological anguish.","zh":"（医学用语，较少见）精神痛苦；心理上的苦恼、折磨。"},"examples":[{"en":"After the loss, he fell into deep phrenodynia and could not sleep.","zh":"失去亲人后，他陷入深深的精神痛苦，难以入睡。"},{"en":"The doctor noted phrenodynia linked to prolonged stress rather than a physical injury.","zh":"医生记录到，这种精神痛苦与长期压力有关，而不是身体受伤造成的。"}]}],"synonyms":["mental anguish","psychological distress","emotional pain","torment"],"phonetic":"/ˌfriːnoʊˈdɪniə/","extraExplanation":["词源上可拆解为希腊语根：phreno-（与“心智/精神”有关，古代也与“脑”相关）+ -dynia（疼痛）。因此它直译接近“心灵之痛”。","这是较老式、偏书面或医学史语境的词。现代英语里更常用 anxiety（焦虑）、distress（苦恼）、mental anguish（精神折磨）、depression（抑郁）等表达。使用 phrenodynia 会显得非常正式、罕见。"]}
{"word":"phrenogastric","summary":{"en":"A medical adjective meaning “related to the diaphragm and the stomach.”","zh":"医学形容词，意为“与膈和胃有关的（膈-胃相关）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Relating to the diaphragm (phreno-) and the stomach (gastric); especially describing a connection, nerve supply, or ligament between them.","zh":"（解剖/医学）与膈（phreno-）和胃（gastric）有关的；尤指两者之间的连接、神经支配或韧带等。"},"examples":[{"en":"In some anatomy texts, the term phrenogastric ligament refers to tissue connecting the diaphragm to the stomach.","zh":"在一些解剖学教材中，phrenogastric ligament 指连接膈与胃的组织/韧带。"},{"en":"The report mentioned phrenogastric involvement near the upper stomach.","zh":"报告提到上胃附近存在“膈-胃相关”的受累情况。"}]}],"synonyms":["diaphragmogastric","diaphragmatic and gastric (related to)"],"phonetic":"/ˌfrɛnəˈɡæstrɪk/","extraExplanation":["词源拆解：phreno- 来自希腊语 phrēn，常用于指“膈/横膈膜”（早期也与“心智”概念有关，但在现代医学词汇里多指膈）；-gastric 表示“胃的”。合起来就是“膈与胃相关的”。","这是比较少见的专业词，多出现在解剖学或临床描述中；日常英语几乎不用。更常见的相关词是 diaphragmatic（膈的）和 gastric（胃的）。"]}
{"word":"phrenoglottic","summary":{"en":"Phrenoglottic means involving both the diaphragm and the glottis, especially their coordination in voice production.","zh":"phrenoglottic 指与膈肌和声门都相关，尤其指发声时二者的协调配合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both the diaphragm (breathing muscle) and the glottis (the opening between the vocal folds), especially in describing how breath support and vocal-fold control work together in speech or singing.","zh":"与膈肌（呼吸肌）和声门（声带之间的开口）都有关的，尤用于描述说话或歌唱时“呼吸支撑”和“声带/声门控制”的协同作用。"},"examples":[{"en":"The coach focused on phrenoglottic coordination to reduce strain during high notes.","zh":"教练强调膈肌—声门的协调，以减少高音时的用力和紧张。"},{"en":"In voice therapy, phrenoglottic control can help improve a weak or breathy voice.","zh":"在嗓音治疗中，膈肌—声门控制有助于改善无力或漏气的嗓音。"}]}],"synonyms":["diaphragmatic-glottal","breath–glottal (coordination)"],"phonetic":"/ˌfrɛnəˈɡlɑtɪk/","extraExplanation":["这个词非常少见，多出现在嗓音学、语音学、歌唱训练或医学语境中。","词素拆解：phreno- 表示“膈/膈肌”，glottic 表示“声门的”。合起来强调“呼吸驱动（气流/气压）”与“声门闭合与开启（发声阀门）”的配合。","学习时可联想更常见的表达：breath support（呼吸支撑）、glottal control（声门控制）、diaphragmatic breathing（腹式/膈肌呼吸）。"]}
{"word":"phrenogrady","summary":{"en":"“Phrenogrady” is not a recognized English word; it’s probably a misspelling or a made-up term.","zh":"“phrenogrady”不是公认的英语词，可能是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a coined term. Meaning can’t be confirmed without context.","zh":"不是标准英语词；很可能是拼写错误或自造词。没有上下文无法确认含义。"},"examples":[{"en":"I couldn’t find “phrenogrady” in major dictionaries—could you share the sentence where you saw it?","zh":"我在主要词典里查不到“phrenogrady”，你能把看到它的句子发我吗？"},{"en":"If you meant “phrenology,” that word relates to an old theory about reading personality from skull shape.","zh":"如果你想写的是“phrenology（颅相学）”，它指一种曾流行的旧理论：通过头骨形状推断性格。"}]}],"phonetic":"/ˌfrɛnəˈɡreɪdi/","extraExplanation":["这个词看起来像由希腊词根拼出来的：phren- 常与“心智/精神”相关（如 phrenology），-grady/-grade 让人联想到“程度/进展”（如 retrograde）。但“phrenogrady”本身并非常见或规范拼写，所以我不建议直接按词根猜义。","最可能的情况是你想输入的是某个相近词（例如 phrenology, retrograde, or upgrade/downgrade 等），或这是某本书/游戏/科幻作品里的设定词。给我你看到它的来源或完整句子，我可以更准确地解释。"]}
{"word":"phrenograih","summary":{"en":"A historical instrument used in phrenology to measure and record skull shape.","zh":"颅相学中用于测量并记录头骨形状的旧式仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device once used in phrenology (a now-discredited practice) to measure and record the shape of the skull, believed (incorrectly) to indicate personality or mental abilities.","zh":"“颅相学”（一种已被否定的学说）中曾使用的测量与记录头骨形状的仪器；当时误以为头骨形状能反映性格或智力。"},"examples":[{"en":"In the 1800s, some practitioners used a phrenograph to map bumps on a person’s head.","zh":"在19世纪，一些从业者会用 phrenograph 来绘制人头部“凸起”的分布图。"},{"en":"The museum display includes a phrenograph as an example of early pseudoscientific tools.","zh":"博物馆展柜里有一台 phrenograph，用来展示早期的“伪科学”工具。"}]}],"synonyms":["phrenology caliper","cranial measuring device"],"phonetic":"/ˈfrɛnəˌɡræf/","extraExplanation":["你输入的 **phrenograih** 很可能是 **phrenograph** 的拼写错误。","**phrenology（颅相学）** 在19世纪一度流行，但如今被认为缺乏科学依据，并与历史上的偏见与歧视叙事有关；现代心理学与神经科学不采用这类方法。","词根提示：**phreno-** 与“mind/brain（心智/大脑）”相关（源自希腊语），**-graph** 与“writing/recording（记录）”相关。"]}
{"word":"phrenogram","summary":{"en":"A phrenogram is a phrenology chart that maps supposed mental traits onto parts of the skull.","zh":"phrenogram 指颅相学使用的图表，把所谓的心理特质对应到头骨不同区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A diagram or chart used in phrenology showing the supposed “organs” (mental traits) mapped onto areas of the skull.","zh":"（颅相学中）把各种“心理特质/能力”对应到头骨不同区域的示意图或图表。"},"examples":[{"en":"The museum displayed a 19th-century phrenogram labeling areas for “benevolence” and “combativeness.”","zh":"博物馆展出了一张19世纪的颅相学 phrenogram，上面标注了“仁慈”“好斗”等区域。"},{"en":"In the novel, the charlatan points to a phrenogram to convince clients their skull shape reveals their character.","zh":"小说里，江湖骗子指着一张 phrenogram 说服顾客：头骨形状能揭示性格。"}]}],"synonyms":["phrenological chart","phrenology diagram","skull map"],"phonetic":"/ˈfrɛnəˌɡræm/","extraExplanation":["“Phrenogram”来自 phreno-（与“心智/大脑”相关的前缀）+ -gram（“图/记录”）。它与19世纪流行的“颅相学（phrenology）”有关：当时有人声称可以通过头骨凸起来判断人的性格与能力。现代科学认为颅相学缺乏证据支撑，属于伪科学；因此 phrenogram 多出现在历史、博物馆、文学或批判性讨论中。"]}
{"word":"phrenograph","summary":{"en":"A historical instrument used in phrenology to measure and record skull shape.","zh":"一种与颅相学相关、用于测量并记录头骨形状的历史仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device once used in phrenology to measure and record the shape and bumps of a person’s skull.","zh":"（颅相学中曾使用的）颅骨测量记录器，用来测量并记录头骨形状与凸起。"},"examples":[{"en":"In the museum’s phrenology exhibit, a phrenograph is displayed next to old charts of “personality types.”","zh":"在博物馆的颅相学展区里，一台 phrenograph 与旧式“性格类型”图表一起展出。"},{"en":"The researcher demonstrated how a phrenograph would mark skull measurements on paper.","zh":"研究人员演示了 phrenograph 如何把头骨测量数据标记在纸上。"}]}],"synonyms":["phrenology instrument","craniometer","measuring device"],"phonetic":"/ˈfrɛnəˌɡræf/","extraExplanation":["“phrenograph”由 phreno-（与心智/大脑有关）+ -graph（记录/书写的工具）构成，字面意思接近“记录心智的仪器”，但它实际记录的是头骨外形。","它与 19 世纪流行的“phrenology（颅相学）”相关。颅相学如今被认为是伪科学：用头骨形状推断人格或能力没有可靠科学依据。","现代语境中该词多出现在历史研究、博物馆展品说明或讨论伪科学史的文章里，日常英语中非常少见。"]}
{"word":"phrenography","summary":{"en":"Phrenography is an old, unscientific practice of mapping skull shape to judge personality or abilities.","zh":"Phrenography 指一种过时且不科学的做法：通过绘制/描述头骨形状来判断性格或能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of describing or mapping the shape of the skull (especially the “bumps”) as a way to judge a person’s character or mental abilities; an old, unscientific practice closely linked to phrenology","zh":"通过描述或绘制头骨（尤其是“凸起”）来判断人的性格或能力的做法；一种过时且不科学的观念，与颅相学（phrenology）密切相关"},"examples":[{"en":"In the 1800s, some people believed phrenography could reveal a person’s personality from the shape of the head.","zh":"在19世纪，有些人相信颅形描记法可以通过头部形状揭示一个人的性格。"},{"en":"The museum displayed old phrenography charts labeling parts of the skull with traits like “kindness” and “ambition.”","zh":"博物馆展示了旧式的颅形描记图，把头骨不同区域标上“善良”“野心”等特质。"}]}],"synonyms":["phrenology (related)","craniology (historical/related)"],"phonetic":"/frəˈnɑːɡrəfi/","extraExplanation":["“phrenography”源于希腊语词根：phren-（与心智、思想有关）+ -graphy（书写、描绘）。它常与“phrenology（颅相学）”一起出现：phrenology 更强调用头骨形状来“解释/推断”，而 phrenography 更偏向“记录/绘制”头骨区域与性格能力的对应图。","这类做法在19世纪曾流行于欧美，但后来被科学界否定；今天多在历史、博物馆、或批判性讨论“伪科学”时出现。使用时注意语气：它通常带有“过时、不可靠”的含义。"]}
{"word":"phrenohepatic","summary":{"en":"A medical adjective meaning “related to the diaphragm and the liver.”","zh":"医学形容词：指“与膈肌和肝脏有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the diaphragm (phren-) and the liver (hepatic); used especially in anatomy to describe structures or spaces between/connecting the diaphragm and liver.","zh":"（解剖/医学）与膈肌（phren-）和肝脏（hepatic）有关的；尤指位于两者之间或连接两者的结构或间隙。"},"examples":[{"en":"The surgeon noted inflammation in the phrenohepatic region.","zh":"外科医生注意到膈肝区有炎症。"},{"en":"Fluid was seen in the phrenohepatic space on the ultrasound.","zh":"超声检查显示膈肝间隙有积液。"},{"en":"A small phrenohepatic ligament can be present in some people.","zh":"有些人可能存在较小的膈肝韧带。"}]}],"synonyms":["diaphragmatic-hepatic","phrenic-hepatic"],"phonetic":"ˌfrɛnoʊhɪˈpætɪk","extraExplanation":["词源拆解：phren- 源自希腊语，现代医学中常指“膈肌”；hepatic 来自希腊语 hēpar（肝脏）。合起来 phrenohepatic 就是“膈肌-肝脏相关的”。","常见搭配（多见于影像学与解剖学语境）：phrenohepatic space（膈肝间隙）、phrenohepatic ligament（膈肝韧带）。在日常英语中几乎不用，主要用于专业医学写作与报告。"]}
{"word":"phrenol","summary":{"en":"“Phrenol” is not a common standard English word; it’s likely a misspelling of “phenol” or related to “phreno-” words like “phrenology.”","zh":"“phrenol”不是常见标准英语词，可能是“phenol（苯酚）”的误拼，或与“phreno-”词（如“phrenology 颅相学”）相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It may be a misspelling or a rare/obsolete term; common look-alikes are “phenol” (a chemical) and “phreno-” words like “phrenology” (an old theory about reading personality from skull shape).","zh":"不是现代英语里的常用标准词。可能是拼写错误或罕见/过时用语；常见的相近词包括“phenol”（苯酚，一种化学物质）以及带“phreno-”的词如“phrenology”（颅相学，一种过时理论）。"},"examples":[{"en":"I couldn’t find “phrenol” in most dictionaries—did you mean “phenol”?","zh":"多数词典里查不到“phrenol”——你是不是想写“phenol（苯酚）”？"},{"en":"If you share the sentence where you saw “phrenol,” I can identify the intended word.","zh":"如果你把看到“phrenol”的句子发出来，我可以帮你判断原本想表达的词。"}]}],"phonetic":"/ˈfrɛnɔl/","extraExplanation":["“phren-”这个词根来自希腊语，历史上可指“心智/大脑”。因此很多相关词（如 phrenology）带有“与心智/大脑有关”的色彩，但“phrenol”本身并不常见，可能是误拼或特定领域/品牌名。","如果你原本想查的是“phenol（苯酚）”，它的读音和拼写更接近化学语境；如果是“phrenology（颅相学）”，则更偏历史/文化语境。给我上下文我可以更准确判断。"]}
{"word":"phrenologer","summary":{"en":"A phrenologer is someone who practices phrenology, a now-discredited method of judging people by skull shape.","zh":"phrenologer 指颅相学者，即从事颅相学（现已被否定、属伪科学）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practices or studies phrenology (the discredited belief that a person’s character or intelligence can be read from the shape of their skull).","zh":"颅相学（已被否定的观点：认为可以从头骨形状判断性格或智力）的研究者或从业者。"},"examples":[{"en":"In the 1800s, some phrenologers claimed they could predict criminal behavior by examining a skull.","zh":"在19世纪，一些颅相学者声称他们能通过观察头骨来预测犯罪倾向。"},{"en":"The novel portrays a phrenologer as a confident “expert,” even though the science was flawed.","zh":"小说把一位颅相学者写成自信的“专家”，尽管这门学说本身有缺陷。"}]}],"synonyms":["phrenologist","skull reader (informal)"],"phonetic":"/frəˈnɑlədʒər/","extraExplanation":["“phrenologer”较少见，更常用的词是“phrenologist”。两者意思相同。","颅相学在19世纪欧美一度流行，被用来为阶级、种族与性别偏见提供“科学”外衣；现代科学认为它属于伪科学。","在文学和影视中，phrenology常用来象征“把人简单贴标签”的危险，或表现某个时代对“科学权威”的盲目信任。"]}
{"word":"phrenologic","summary":{"en":"Phrenologic means “related to phrenology,” an outdated and discredited practice of judging people by skull shape.","zh":"phrenologic 指“与颅相学有关的”，颅相学是一种已过时且被否定的、用头骨形状评判人的做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phrenology (the discredited belief that a person’s character and abilities can be determined by the shape of the skull).","zh":"与颅相学有关的（颅相学是一种已被否定的观点，认为可以通过头骨形状判断人的性格与能力）。"},"examples":[{"en":"In the 1800s, some museums displayed phrenologic charts next to skull models.","zh":"在19世纪，一些博物馆会把颅相学图表和头骨模型一起陈列。"},{"en":"The novel includes a phrenologic scene to show how “scientific” prejudice influenced society.","zh":"这部小说加入了颅相学的情节，用来表现所谓“科学的”偏见如何影响社会。"}]}],"synonyms":["phrenological","pseudoscientific (in context)"],"phonetic":"/ˌfrɛnəˈlɑːdʒɪk/","extraExplanation":["“Phrenologic”源自 phrenology（颅相学）。颅相学在19世纪曾被一些人当作科学，用来给人贴标签、为阶级与种族偏见找“证据”。现代神经科学与心理学已否定这种方法：头骨外形不能可靠地反映人格或智力。","阅读历史或文学作品时看到 phrenologic/phrenological，通常带有批判或讽刺意味，指向一种过时且有害的“伪科学”。"]}
{"word":"phrenological","summary":{"en":"Phrenological means related to phrenology (a discredited skull-reading theory), or, figuratively, judging people’s inner traits from superficial physical features.","zh":"phrenological 指与颅相学（已被否定的“看头骨论性格”理论）有关；也可引申为根据外表特征武断推断人的内在特质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phrenology—the (now discredited) idea that a person’s character and mental abilities can be read from the shape of their skull.","zh":"与“颅相学”有关的——一种如今已被否定的观点，认为人的性格与能力可以从头骨形状判断。"},"examples":[{"en":"The museum displayed phrenological charts that claimed to link skull bumps to personality traits.","zh":"博物馆展出了颅相学图表，声称头骨的凸起与人格特质有关。"},{"en":"In the novel, a phrenological lecture is used to show how “scientific” ideas can be misleading.","zh":"在小说中，一场颅相学讲座被用来表现所谓“科学”观念也可能具有误导性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Based on superficial physical features as if they reveal someone’s inner qualities.","zh":"（引申）像颅相学那样根据外表的表面特征来推断人的内在品质。"},"examples":[{"en":"The critic called the casting decision phrenological because it relied on facial stereotypes.","zh":"评论家称选角决定带有“颅相学式”的偏见，因为它依赖对面相的刻板印象。"},{"en":"Be careful not to make phrenological assumptions from someone’s appearance.","zh":"要小心，不要根据外表做出“颅相学式”的推断。"}]}],"synonyms":["phrenologic","pseudoscientific","superficial","physiognomic"],"phonetic":"/ˌfrɛnəˈlɑdʒɪkəl/","extraExplanation":["“phrenological”来自 phrenology（颅相学），19世纪在欧美一度流行，被当作“科学”来研究头骨形状与性格/智力的关系。现代科学认为它缺乏证据，属于伪科学。","在历史上，颅相学曾被用来为种族主义与阶级偏见辩护；因此在现代语境中，这个词常带有批评意味，暗示“以貌取人、用伪科学包装偏见”。"]}
{"word":"phrenologically","summary":{"en":"“Phrenologically” means “in terms of phrenology,” an outdated theory linking skull shape to personality.","zh":"“phrenologically”表示“从颅相学角度/以颅相学方式”，指一种已被否定的把头骨形状与性格相联系的理论。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to phrenology (the old belief that a person’s character can be read from the shape of their skull).","zh":"以颅相学（认为可从头骨形状判断性格与能力的旧观念）的方式；从颅相学角度。"},"examples":[{"en":"The author describes the character phrenologically, linking personality to the shape of the head.","zh":"作者以颅相学的方式描写人物，把性格与头部形状联系起来。"},{"en":"The museum label explains why such claims were made phrenologically rather than scientifically.","zh":"博物馆说明牌解释了这些说法为何是从颅相学角度提出的，而不是科学结论。"}]}],"synonyms":["in phrenological terms","from a phrenological perspective"],"phonetic":"/ˌfrɛˌnɑːləˈdʒɪkli/","extraExplanation":["“Phrenology（颅相学）”在19世纪（欧美）曾很流行，后来被证明缺乏科学依据，通常被归为伪科学。现代写作里用“phrenologically”多带有批判、讽刺或历史说明的语气。","相关词源：phren- 来自希腊语，早期与“心智/思想”相关；-logy 表示“学科/研究”。"]}
{"word":"phrenologies","summary":{"en":"“Phrenologies” means the theories/practices of phrenology (plural), an old and discredited idea of reading character from skull shape.","zh":"“phrenologies”是“phrenology（颅相学）”的复数，指通过头骨形状判断性格/能力的过时且被否定的理论或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of phrenology: the (often outdated) theories or practices that claim a person’s character or abilities can be read from the shape of the skull; sometimes used to mean different versions of that idea.","zh":"phrenology 的复数：指一种（已过时的）理论或做法，声称可以通过头骨形状判断人的性格或能力；也可指这种观念的不同流派/版本。"},"examples":[{"en":"In the 1800s, various phrenologies were promoted as ‘scientific’ ways to explain personality.","zh":"在19世纪，出现了多种“颅相学”学说，被宣传为解释人格的“科学”方法。"},{"en":"Museums sometimes display phrenologies as examples of how science can go wrong.","zh":"博物馆有时会展示颅相学相关内容，用来说明科学如何可能走偏。"}]}],"synonyms":["cranioscopy","pseudoscience (in context)","skull-reading (informal)"],"phonetic":"/frəˈnɑlədʒiz/","extraExplanation":["“颅相学/颅相术”（phrenology）在19世纪欧美曾很流行，但今天被认为是伪科学。它常被用来为偏见（尤其是种族主义与阶级歧视）提供“科学”借口，因此在现代语境里多带批判或反讽意味。","词源提示：phren- 来自希腊语，和“mind（心智）”相关；-logy 表示“学说/研究”。虽然看起来像“研究”，但并不代表它是真正可靠的科学。"]}
{"word":"phrenologist","summary":{"en":"A phrenologist is someone who practices phrenology, a disproven belief that skull shape reveals personality or intelligence.","zh":"phrenologist 指“颅相学家”，从事已被否定的颅相学，认为头骨形状能反映性格或智力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practices phrenology—the (now discredited) belief that someone’s personality or intelligence can be judged by the shape of their skull.","zh":"颅相学家；研究（或从事）颅相学的人——一种已被否定的观点，认为可以通过头骨形状判断人的性格或智力。"},"examples":[{"en":"In the 1800s, some phrenologists claimed they could read character from bumps on the head.","zh":"在19世纪，一些颅相学家声称他们能通过头上的凸起来“读出”人的性格。"},{"en":"Modern science rejects the methods used by phrenologists as unreliable and biased.","zh":"现代科学否定颅相学家的方法，认为它不可靠且带有偏见。"}]}],"synonyms":["phrenology practitioner","pseudoscientist (context-dependent)"],"phonetic":"/frəˈnɑːlədʒɪst/","extraExplanation":["“颅相学”(phrenology)在19世纪欧美曾一度流行，被一些人当作“科学”来用作教育、职业建议，甚至与种族主义和社会偏见相互强化。后来随着神经科学与心理学的发展，其核心主张被证明缺乏证据，因此如今常被当作“伪科学”的典型例子。","词源上，phreno- 与“心智/大脑”相关，-logist 表示“研究者/从业者”。现代语境里使用 phrenologist 往往带有批判或讽刺意味，用来指相信过时、缺乏证据理论的人。"]}
{"word":"phrenologists","summary":{"en":"Phrenologists are people who believed they could read personality and ability from skull shape, an idea now considered pseudoscience.","zh":"Phrenologists 指相信能从头骨形状判断人格与能力的颅相学家；这一学说如今被视为伪科学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who practice (or believe in) phrenology—the idea that a person’s character and abilities can be judged by the shape of their skull.","zh":"颅相学家；从事（或相信）颅相学的人——认为可以通过头骨形状判断人的性格与能力。"},"examples":[{"en":"In the 1800s, some phrenologists claimed they could predict a child’s talents by feeling bumps on the head.","zh":"在19世纪，一些颅相学家声称他们可以通过摸头上的“凸起”来预测孩子的天赋。"},{"en":"Today, phrenologists are usually mentioned as an example of outdated pseudoscience.","zh":"如今，“颅相学家”通常被用来举过时伪科学的例子。"}]}],"synonyms":["phrenology practitioners","pseudoscientists (context-dependent)"],"phonetic":"/frəˈnɑlədʒɪsts/","extraExplanation":["“Phrenologists”是“phrenologist（颅相学家）”的复数。颅相学在19世纪欧美一度流行，但后来被科学界否定，被视为伪科学。","颅相学曾被用来为种族主义、阶级偏见和性别刻板印象提供“科学”外衣，因此在现代语境中带有强烈的批判意味。","词源提示：phreno- 与“mind（心智）”相关，-logy 表示“学说/研究”。虽然形式像科学术语，但不代表其结论可靠。","文学与文化中常见用法：在描写维多利亚时代或讽刺“自以为科学”的人物时，作家会提到phrenologists，用来体现当时的观念与偏见。"]}
{"word":"phrenologize","summary":{"en":"“Phrenologize” means to judge someone by the shape of their skull, as in the (now discredited) practice of phrenology.","zh":"“phrenologize”指用颅相学那种方式，通过头骨形状来评判一个人（如今被视为伪科学）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to study or judge a person’s character or abilities by examining the shape of their skull (the practice of phrenology)","zh":"通过观察头骨形状来研究或判断一个人的性格或能力（颅相学的做法）"},"examples":[{"en":"In the 1800s, some people claimed they could phrenologize strangers and tell who was “honest” or “lazy.”","zh":"在19世纪，有些人声称能对陌生人进行颅相学式的判断，说出谁“诚实”或“懒惰”。"},{"en":"The novel mocks a doctor who tries to phrenologize every patient before listening to their story.","zh":"小说讽刺一位医生：他在倾听病人的经历之前，总要先用颅相学给每个人“看头骨下结论”。"}]}],"synonyms":["practice phrenology","profile (informal, context-dependent)","judge (by appearance)"],"phonetic":"/frəˈnɑlədʒaɪz/","extraExplanation":["“phrenologize”来自“phrenology（颅相学）”。颅相学在19世纪欧美一度流行，宣称头骨隆起与大脑“器官”对应，从而能推断性格与智力。如今被认为是伪科学。","在历史语境中，颅相学也曾被用来为种族歧视与阶级偏见提供“科学”外衣；因此在现代写作里，这个词常带有讽刺、批判或警惕的语气。","用法提示：这个动词非常少见，多出现在历史讨论、文学讽刺或批判伪科学的语境中；日常英语更常说“practice phrenology（从事颅相学）”或“judge by skull shape（按头骨形状评判）”。"]}
{"word":"phrenology","summary":{"en":"Phrenology is the outdated belief that skull shape reveals personality or intelligence.","zh":"Phrenology（颅相学）是已被否定的观点，认为头骨形状能揭示性格或智力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (now discredited) theory that a person’s character, intelligence, or personality can be judged by the shape of their skull.","zh":"（现已被否定的）一种理论，认为可以通过头骨的形状来判断人的性格、智力或人格。"},"examples":[{"en":"In the 1800s, some people used phrenology to claim they could read personality from bumps on the head.","zh":"在19世纪，一些人用颅相学声称可以从头部的凸起读出人的性格。"},{"en":"Today, phrenology is considered pseudoscience and has no medical basis.","zh":"如今，颅相学被认为是伪科学，没有医学依据。"}]}],"synonyms":["pseudoscience","skull-reading (informal)"],"phonetic":"/frəˈnɑlədʒi/","extraExplanation":["颅相学在19世纪一度流行，常与“测量”“分类人群”等做法相连；它曾被用来为种族主义、阶级偏见等不公正观点“提供证据”。了解这个词时，也常会在历史、文学或社会批评中看到它被当作“把复杂的人简化为外貌特征”的例子。","词源来自希腊语：phren-（心智、思维）+ -logy（学说、研究）。尽管看起来像“科学术语”，但它不属于现代科学或医学。"]}
{"word":"phrenomagnetism","summary":{"en":"Phrenomagnetism is an old pseudoscientific belief that magnetism/mesmerism could influence mental traits through the brain areas described by phrenology.","zh":"phrenomagnetism 指一种旧时的伪科学：认为磁力/催眠磁力能通过颅相学所说的脑区来影响人的心理特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 19th‑century pseudoscientific idea claiming that “magnetic” or mesmeric forces could act on the brain (as mapped by phrenology) to influence a person’s thoughts, feelings, or behavior","zh":"一种19世纪的伪科学观念，声称“磁力/催眠磁力”（梅斯梅主义）可以作用于由颅相学划分的脑部区域，从而影响人的思想、情感或行为"},"examples":[{"en":"The lecturer promoted phrenomagnetism, insisting that a magnet could “stimulate” specific mental faculties.","zh":"那位讲者宣扬“颅相磁力学”，坚持说磁铁能“刺激”某些特定的心理机能。"},{"en":"Modern historians mention phrenomagnetism as an example of how popular science and spiritual fashion sometimes mixed in the Victorian era.","zh":"现代历史学者会把“颅相磁力学”当作维多利亚时代大众科学与灵性潮流相互混杂的例子。"}]}],"synonyms":["mesmeric phrenology","phreno-magnetism","animal magnetism (related)","mesmerism (related)"],"phonetic":"/ˌfɹiːnoʊˈmæɡnəˌtɪzəm/","extraExplanation":["“phrenomagnetism”由 phreno-（来自 phrenology，颅相学）+ magnetism（磁力/“动物磁力”，与梅斯梅主义 mesmerism 相关）组合而成。它通常出现在19世纪的通俗讲座、报刊与小册子中，被用来解释催眠、暗示或“读心”等现象。","在当代语境中，这个词多用于历史讨论或批评性描述，强调其缺乏科学依据。"]}
{"word":"phrenomesmerism","summary":{"en":"A rare historical term for a pseudo-scientific blend of phrenology and mesmerism.","zh":"一个罕见的历史用语，指颅相学与催眠术（mesmerism）的伪科学混合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (historical, usually critical) term for a 19th‑century pseudo-scientific mix of phrenology (reading personality from skull shape) and mesmerism (hypnotic “animal magnetism”), claiming mental traits could be influenced or revealed through manipulating the head or inducing trance.","zh":"（历史用语，常带批判）指19世纪把颅相学（通过头骨形状判断性格）与催眠术/“动物磁力说”（mesmerism）混合起来的伪科学做法，声称可以通过操控头部或使人入迷/恍惚来揭示或改变心理特质。"},"examples":[{"en":"The pamphlet mocked phrenomesmerism as a fashionable craze rather than real medicine.","zh":"那本小册子讥讽“phrenomesmerism”只是时髦风潮，并非真正的医学。"},{"en":"In the novel, a traveling showman advertises phrenomesmerism to impress curious townspeople.","zh":"在小说里，一个走江湖的表演者打着“phrenomesmerism”的旗号来吸引好奇的镇民。"}]}],"synonyms":["phrenology","mesmerism","animal magnetism","hypnotism (historical context)"],"phonetic":"/ˌfriːnoʊˈmɛzməˌrɪzəm/","extraExplanation":["这个词由 phreno-（与“心智/颅相学”相关）+ mesmerism（梅斯梅尔的“动物磁力”学说，后常指早期催眠术）拼合而成，多见于19世纪的报刊、讽刺文章或批判性讨论中。","它通常用于强调“把两种不可靠的理论拼在一起”的荒诞感，因此语气往往带有嘲讽或否定。现代英语里很少使用，更多是历史研究、文学作品或复古写作中的词。"]}
{"word":"phrenopathia","summary":{"en":"A rare medical term meaning a disorder or disease of the mind.","zh":"一个罕见的医学术语，指心智/精神方面的疾病或障碍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A disease or disorder of the mind; mental illness.","zh":"（医学用语，罕见）精神/心智的疾病或障碍；精神疾病。"},"examples":[{"en":"In older medical writing, some authors used “phrenopathia” to describe mental disorders in general.","zh":"在较早的医学文献中，有些作者用“phrenopathia”来泛指各种精神障碍。"},{"en":"The term phrenopathia is now uncommon; modern texts usually say “mental disorder” or “psychiatric illness.”","zh":"“phrenopathia”如今不常用；现代文本通常说“mental disorder（精神障碍）”或“psychiatric illness（精神疾病）”。"}]}],"synonyms":["mental illness","mental disorder","psychiatric illness","psychiatric disorder"],"phonetic":"/ˌfrɛnəˈpæθiə/","extraExplanation":["词源：来自希腊语词根 *phren-*（心智、精神）+ *-pathia*（疾病、病态）。因此字面含义接近“心智的病态/疾病”。","使用提示：这是较为古老、学术味很重且较罕见的术语。写作或交流中更常见、更自然的表达是 *mental illness*, *mental disorder*, *psychiatric disorder/illness*。"]}
{"word":"phrenopathic","summary":{"en":"Phrenopathic means “relating to mental illness,” but it’s rare and mostly found in older medical contexts.","zh":"phrenopathic 指“与精神疾病相关”，但用法很少，主要见于较旧的医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mental illness or disorders of the mind; psychiatric (rare/archaic).","zh":"与精神疾病或心理障碍有关的；精神病学的（较罕见/偏旧用法）。"},"examples":[{"en":"The article used phrenopathic language to describe conditions we now call mood disorders.","zh":"那篇文章用了“phrenopathic”这类措辞来描述我们如今称为情绪障碍的状况。"},{"en":"In older medical writing, some patients were labeled phrenopathic based on behavior alone.","zh":"在较早的医学写作中，有些病人仅凭行为表现就被贴上“phrenopathic”的标签。"}]}],"synonyms":["psychiatric","psychopathological","mentally ill (context-dependent)","of unsound mind (archaic)"],"phonetic":"ˌfrɛnəˈpæθɪk","extraExplanation":["这个词很少出现在现代英语里，更常见的是 psychiatric（精神病学的）、mentally ill（精神疾病的）、psychological（心理的）等。","词源上可拆为：phreno-（与“mind/精神”相关，源自希腊语）+ -pathic（与“disease/疾病、病态”相关）。因此字面意思接近“精神方面的病态”。","由于现代语境更强调尊重与准确性，描述个人时不建议使用这种带有旧式医学色彩的标签；更合适的说法是 “a person with a mental health condition”（有心理健康问题的人）等以人为本的表达。"]}
{"word":"phrenopathy","summary":{"en":"Phrenopathy is a rare, old term meaning “mental illness.”","zh":"phrenopathy 是一个罕见的旧词，意思是“精神疾病”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mental illness or disorder (an uncommon, old-fashioned term).","zh":"精神疾病；精神障碍（罕见、较旧的用法）"},"examples":[{"en":"In some 19th-century medical writing, “phrenopathy” was used as a general label for mental disorders.","zh":"在一些19世纪的医学著作中，“phrenopathy”被用作精神障碍的统称。"},{"en":"Today, doctors would usually say “mental illness” instead of “phrenopathy.”","zh":"如今，医生通常会说“mental illness（精神疾病）”，而不是“phrenopathy”。"}]}],"synonyms":["mental illness","psychiatric disorder","mental disorder","insanity (old-fashioned)"],"phonetic":"/fɹəˈnɑpəθi/","extraExplanation":["这个词由希腊语词根 phren-（与“心智/精神”相关）和 -pathy（“疾病/病症”）构成，字面意思接近“精神的病”。","在现代英语里它几乎不用于临床或日常表达，更常见的对应说法是 mental illness / psychiatric disorder。"]}
{"word":"phrenopericardiac","summary":{"en":"A medical adjective meaning “connected with the diaphragm and the pericardium.”","zh":"医学形容词，意为“与膈肌和心包相关/相连的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the diaphragm (phren-) and the pericardium (the sac around the heart), especially describing ligaments, membranes, or structures connecting them.","zh":"与膈肌（phren-）和心包（包绕心脏的囊）都有关的；尤用于描述连接二者的韧带、膜或结构。"},"examples":[{"en":"The surgeon carefully avoided the phrenopericardiac ligament during the procedure.","zh":"手术过程中，外科医生小心避开膈心包韧带。"},{"en":"Inflammation near the phrenopericardiac region can cause chest discomfort that changes with breathing.","zh":"膈心包区域附近的炎症可能引起随呼吸变化的胸部不适。"}]}],"synonyms":["phrenopericardial"],"phonetic":"/ˌfriːnoʊˌpɛrɪˈkɑrdiæk/","extraExplanation":["这个词主要出现在解剖学/医学语境里，日常英语几乎不用。","构词提示：phreno- 源自希腊语，常指“膈肌”（有时在古文献里也与“心智”有关，但在现代医学里多指膈肌）；pericardiac 指“心包的”。合起来就是“与膈肌和心包相关的”。","相关词：phrenic（膈神经/膈的）、pericardial（心包的）、phrenopericardial（与本词非常接近，常见于“phrenopericardial ligament/ membrane”）。"]}
{"word":"phrenoplegia","summary":{"en":"Phrenoplegia is a rare word meaning “paralysis of the mind,” i.e., mental numbness or inability to think clearly.","zh":"phrenoplegia 是个罕见词，意为“精神麻痹/心智瘫痪”，指思维迟钝或无法清晰思考。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, medicine/literary) a “paralysis of the mind,” meaning a state of mental numbness, confusion, or inability to think clearly or act rationally.","zh":"（罕见，用于医学/文学）“精神麻痹；心智瘫痪”，指一种心理迟钝、困惑，或无法清晰思考、理性行动的状态。"},"examples":[{"en":"After the shock of the accident, she felt a kind of phrenoplegia and couldn’t make simple decisions.","zh":"事故的打击之后，她感到一种精神麻痹，连简单的决定都做不了。"},{"en":"The writer uses “phrenoplegia” to describe a society frozen by fear and misinformation.","zh":"作者用“phrenoplegia”来形容一个被恐惧与错误信息冻住的社会。"}]}],"synonyms":["mental paralysis","stupor","confusion","brain fog"],"phonetic":"/ˌfriːnoʊˈpliːdʒə/","extraExplanation":["这个词非常少见，多见于较旧的医学英语或修辞性写作中，而非日常口语。","词源可拆解为希腊语 phren-（心智、精神；也可指“心”/“思想”）+ -plegia（瘫痪、中风样麻痹）。理解词根有助于记忆其核心意思：把“思考/精神活动”比喻为“瘫痪”。","现代英语里表达类似含义更常用：mental paralysis、brain fog、stupor、confusion 等；写作时若用 phrenoplegia，语气会显得更书面、古典或夸张。"]}
{"word":"phrenoplegy","summary":{"en":"Phrenoplegy is a rare term meaning mental paralysis or extreme mental dullness/stupor.","zh":"Phrenoplegy 是一个罕见词，指“精神瘫痪”或极度思维迟钝、麻木的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A paralysis or severe dulling of the mind; mental stupor.","zh":"（罕见/古语）精神瘫痪；思维极度迟钝、麻木（类似昏沉、呆滞的状态）。"},"examples":[{"en":"After days without sleep, he fell into a kind of phrenoplegy and could barely think clearly.","zh":"连续几天没睡后，他陷入一种近乎“精神瘫痪”的状态，几乎无法清晰思考。"},{"en":"The old writer used phrenoplegy to describe a mind numbed by fear and shock.","zh":"那位老作家用 phrenoplegy 来形容被恐惧与震惊麻木的头脑。"}]}],"synonyms":["stupor","mental numbness","torpor","daze"],"phonetic":"/ˌfrɛnəˈplidʒi/","extraExplanation":["这是一个非常少见的词，更多见的拼法是 **phrenoplegia**（-plegy 有时被当作 -plegia 的变体）。","词根来源：**phreno-**（与“心智/精神”相关，古典语境中也可指“心/思想”）+ **-plegia**（“瘫痪”）。字面意思就是“心智的瘫痪”。","现代英语里表达类似意思更常用：**mental numbness**（精神麻木）、**stupor**（昏迷/恍惚）、**brain fog**（脑雾，较口语）。"]}
{"word":"phrenosin","summary":{"en":"Phrenosin is a rare/older term for a brain myelin lipid (a cerebroside, especially galactosylceramide).","zh":"Phrenosin 是较少见/偏旧的术语，指一种存在于脑髓鞘中的脂类（脑苷脂，尤其是半乳糖神经酰胺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lipid (specifically a cerebroside/galactosylceramide) found in nervous tissue, especially in the myelin sheath of the brain and spinal cord","zh":"（生化）一种脂类（具体为脑苷脂/半乳糖神经酰胺），存在于神经组织中，尤其常见于脑和脊髓髓鞘（myelin sheath）"},"examples":[{"en":"Researchers analyzed phrenosin levels to study changes in myelin.","zh":"研究人员分析了 phrenosin 的含量，以研究髓鞘的变化。"},{"en":"Phrenosin is discussed in older biochemistry texts when describing cerebrosides.","zh":"在一些较早的生物化学教材中，描述脑苷脂时会提到 phrenosin。"}]}],"synonyms":["galactosylceramide","cerebroside","galactocerebroside"],"phonetic":"/ˈfrɛnəsɪn/","extraExplanation":["“Phrenosin”属于较少见、偏旧的术语，在现代文献中更常用更具体的名称如“galactosylceramide（半乳糖神经酰胺）”或更宽泛的“cerebroside（脑苷脂）”。","词源上“phreno-”与“mind/brain（心智/大脑）”相关（也见于 schizophrenia、phrenology 等词的构词成分），反映其与脑组织的关联。"]}
{"word":"phrenosinic","summary":{"en":"A rare adjective used mainly in older biochemistry to mean “related to phrenosin or its derivatives.”","zh":"一个较少见的形容词，多用于较早的生物化学文献，表示“与 phrenosin 或其衍生物有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phrenosin (a type of brain lipid) or to compounds derived from it, especially in older biochemical writing (e.g., “phrenosinic acid”).","zh":"与“phrenosin（脑脂的一种）”或其衍生化合物有关的；多见于较早的生物化学文献（如“phrenosinic acid / phrenosinic acid”）。"},"examples":[{"en":"The paper mentioned phrenosinic acid as a component found in brain tissue.","zh":"论文提到 phrenosinic acid（phrenosinic 酸）是脑组织中发现的一种成分。"},{"en":"In older biochemistry texts, “phrenosinic” is used to describe substances related to phrenosin.","zh":"在较早的生物化学教材中，phrenosinic 用来描述与 phrenosin 相关的物质。"}]}],"synonyms":["phrenosin-related","cerebroside-related (context-dependent)"],"phonetic":"/ˌfrɛnəˈsɪnɪk/","extraExplanation":["这个词非常少见，主要出现在历史性的（较早的）脂类/神经化学资料中。现代文献更常用更具体的脂类名称（例如 cerebroside、galactocerebroside 等）来表达相关概念。","词根提示：phren- 在一些古典/学术用语里与“心智、脑”有关（如 phrenology 颅相学），而 phrenosin 是早期对某类脑部脂质的命名。"]}
{"word":"phrenospasm","summary":{"en":"Phrenospasm is a medical term for an involuntary spasm of the diaphragm, sometimes linked with hiccups.","zh":"Phrenospasm 是医学用语，指膈肌不由自主的痉挛，有时与打嗝相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden, involuntary spasm (cramp-like contraction) of the diaphragm, sometimes causing hiccups or a feeling of tightness in the chest or upper abdomen","zh":"膈肌的突然、不由自主的痉挛（类似抽筋的收缩），有时会引起打嗝或胸部/上腹部紧绷感"},"examples":[{"en":"The doctor suspected phrenospasm when the patient described repeated diaphragm “jerks” and hiccup-like episodes.","zh":"病人描述膈肌反复“抽动”、类似打嗝的发作时，医生怀疑是膈肌痉挛（phrenospasm）。"},{"en":"Deep, slow breathing can sometimes reduce phrenospasm triggered by anxiety.","zh":"由焦虑诱发的膈肌痉挛有时可以通过缓慢深呼吸来缓解。"}]}],"synonyms":["diaphragmatic spasm","spasm of the diaphragm","singultus (hiccup)"],"phonetic":"/ˈfrɛnəˌspæzəm/","extraExplanation":["这是较少见、偏医学用语的词。词根 phreno- 来自希腊语 *phrēn*，在现代医学里常与“膈/膈肌（diaphragm）”相关（也见于 *phrenic nerve*＝膈神经）；-spasm 表示“痉挛”。","注意：在古典语境里 *phrēn* 也可指“心智/精神”，所以某些相关词（如 *phrenology* 颅相学）并不指膈肌。这里的 phrenospasm 指的是“膈肌痉挛”。"]}
{"word":"phrenosplenic","summary":{"en":"A medical/anatomical adjective meaning “related to the diaphragm and the spleen.”","zh":"医学/解剖学形容词：指“与膈和脾相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the diaphragm (or adjacent membrane) and the spleen; used in anatomy to describe structures (such as ligaments or folds) connecting or associated with both.","zh":"（解剖）与膈（或其相关膜）和脾有关的；常用于描述连接或同时与两者相关的结构（如韧带、皱襞等）。"},"examples":[{"en":"In some anatomy texts, the phrenosplenic ligament is described as supporting the spleen near the diaphragm.","zh":"在一些解剖学教材中，膈脾韧带（phrenosplenic ligament）被描述为在膈附近支撑脾脏。"},{"en":"The report mentioned phrenosplenic adhesions after abdominal inflammation.","zh":"报告提到腹部炎症后出现了膈脾粘连（phrenosplenic adhesions）。"}]}],"synonyms":["phrenicosplenic","diaphragmosplenic"],"phonetic":"/ˌfriːnoʊˈspliːnɪk/","extraExplanation":["该词多见于医学/解剖学与兽医学语境，属于较少在日常英语中出现的专业词。","词源可拆解为 phreno-（与“膈”有关，源自希腊语 *phrēn*，在古希腊也可指“心智/精神”，但在现代医学构词中常指“膈”）+ splenic（与“脾”有关）。"]}
{"word":"phrenotropic","summary":{"en":"Phrenotropic means “affecting the mind or mental processes,” but it’s rare and often replaced by psychotropic/psychoactive.","zh":"phrenotropic 意为“影响心智或精神活动的”，但很少见，常被 psychotropic/psychoactive 等更常用词替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affecting the mind or mental processes; influencing psychological states (a rare, technical word).","zh":"与心理或精神活动有关的；影响心理状态的（较少见的技术性用语）。"},"examples":[{"en":"Some older articles used “phrenotropic” to describe drugs that influence mood and thinking.","zh":"一些较早的文章用“phrenotropic”来描述会影响情绪与思维的药物。"},{"en":"The author argued that modern media can have phrenotropic effects on attention.","zh":"作者认为现代媒体可能对注意力产生“phrenotropic”（影响心理的）作用。"}]}],"synonyms":["psychotropic","psychoactive","mind-altering","psychological"],"phonetic":"ˌfrɛnəˈtrɑpɪk","extraExplanation":["这个词很少在现代英语中使用，通常会被更常见的 psychotropic（精神药理的/影响精神状态的）或 psychoactive（致精神活性的）替代。","词根提示：phreno- 常与“心智/精神/大脑”相关（如 phrenology“颅相学”，已被视为伪科学）；-tropic 表示“趋向/作用于/影响……的”（如 phototropic“向光性的”）。","如果你在学术或历史文本里遇到它，多半是在讨论“对心智产生作用的因素”，比如药物、刺激或环境影响。"]}
{"word":"phrenoward","summary":{"en":"“Phrenoward” is not recognized as a standard English word; it’s likely a misspelling or a name. Provide context to identify the intended word.","zh":"“phrenoward”不是标准英语词汇，可能是拼写错误或专有名词。请提供上下文以确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a rare proper name, or a coined term.","zh":"不是标准英语单词。可能是拼写错误、罕见的人名/地名，或自造词。"},"examples":[{"en":"I couldn’t find “phrenoward” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主流英语词典里找不到“phrenoward”——你能把它出现的句子发我吗？"},{"en":"If you meant “phrenology,” it refers to an old belief about reading personality from skull shape.","zh":"如果你想写的是“phrenology”，它指一种旧时观念：通过头骨形状判断性格。"}]}],"extraExplanation":["“phreno-”是一个常见词根，来自希腊语，和“mind（心智）/diaphragm（膈肌）”相关，常见于如 phrenology（颅相学，已被视为伪科学）、phrenic（膈神经的/与膈肌有关的）等词。","“ward”在英语里常见含义有“病房/病区”“被监护人”“守卫/防护（较少作为后缀出现）”。如果你看到的是复合词，可能是把某个词误读/误拼了。","更可能的目标词：phrenology / phrenic / phrenetic（意为“狂热的、激动的”，但更常见是 frenetic）/ forward。请提供出处或上下文，我可以帮你精准确认。"]}
{"word":"phrensied","summary":{"en":"“Frenzied” means wildly excited or out of control; it’s often used for crowds, activity, or a frantic search.","zh":"“Frenzied”表示狂热或失控的兴奋/忙乱，常形容人群、活动或慌乱的寻找。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common spelling: frenzied) Wildly excited, out of control, or very busy in a nervous way.","zh":"（常见拼写：frenzied）狂乱的；极度激动的；忙乱到失控的。"},"examples":[{"en":"The crowd became frenzied when the band came on stage.","zh":"乐队一上台，人群就变得狂热起来。"},{"en":"She made a frenzied search for her passport before the flight.","zh":"临登机前，她慌乱地到处找护照。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “frenzy”: to make someone extremely excited or panicked (less common in everyday use).","zh":"“frenzy”的过去式/过去分词：使某人极度兴奋或恐慌（口语中较少见）。"},"examples":[{"en":"Rumors frenzied the fans and caused long lines outside the store.","zh":"谣言让粉丝们变得躁动不安，商店外排起了长队。"}]}],"synonyms":["frantic","wild","hysterical","feverish","chaotic"],"phonetic":"/ˈfrɛnziːd/","extraExplanation":["你输入的“phrensied”通常是拼写错误。正确拼写是 **frenzied**，来自名词 **frenzy**（疯狂、狂热、慌乱）。常见搭配：**a frenzied crowd / frenzied activity / frenzied search**。"]}
{"word":"phrensies","summary":{"en":"“Frenzies” is the plural of “frenzy”: sudden uncontrolled excitement, panic, or a widespread craze.","zh":"“Frenzies”是“frenzy”的复数：指一时失控的狂热/慌乱，或群体性的热潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of uncontrolled excitement, panic, or wild activity","zh":"（一时的）狂热；疯狂；慌乱的激动"},"examples":[{"en":"Fans went into a frenzy when the singer appeared on stage.","zh":"歌手一上台，粉丝们就陷入一阵狂热。"},{"en":"The market was in a buying frenzy after the news broke.","zh":"消息传出后，市场出现了一阵抢购狂潮。"}]},{"partOfSpeech":"n.","definition":{"en":"a period when many people do the same thing eagerly and quickly (often in news or marketing)","zh":"（常见于新闻/营销语境的）热潮；风潮"},"examples":[{"en":"There was a social media frenzy around the new movie trailer.","zh":"这部新电影预告片在社交媒体上引发了一阵热潮。"},{"en":"Holiday shopping frenzies can make stores very crowded.","zh":"节日购物热潮会让商店非常拥挤。"}]}],"synonyms":["craze","mania","hysteria","panic","uproar"],"phonetic":"/ˈfrɛn.zi/","extraExplanation":["你输入的 **phrensies** 很可能是拼写错误；正确拼写通常是 **frenzies**（来自单数 **frenzy**）。英语里发音 /fr/ 的词有时会被误写成 *phr-*，但标准拼写是 *fr-*.","常见搭配：**in a frenzy**（处于疯狂/慌乱中），**a feeding frenzy**（“疯狂抢食/疯狂围抢”，也常比喻媒体或市场的盲目追逐）。"]}
{"word":"phrensy","summary":{"en":"Frenzy means a period of uncontrolled excitement or panic, and it can also mean to make someone feel that way.","zh":"Frenzy 指一段失控的兴奋或恐慌；也可作动词表示“使某人陷入这种状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of wild excitement, panic, or uncontrolled activity.","zh":"（狂热的）极度兴奋、恐慌或失控的状态。"},"examples":[{"en":"Fans went into a frenzy when the singer appeared on stage.","zh":"歌手一登台，粉丝们就陷入了狂热。"},{"en":"The news triggered a buying frenzy at supermarkets.","zh":"这条消息引发了超市的抢购潮。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make someone extremely excited or agitated; to drive into a frenzy.","zh":"使某人极度兴奋或激动；使陷入狂乱。"},"examples":[{"en":"The rumors frenzied the crowd.","zh":"谣言让人群变得骚动不安。"},{"en":"Try not to let social media comments frenzy you.","zh":"尽量别让社交媒体的评论把你搅得心烦意乱。"}]}],"synonyms":["mania","hysteria","uproar","panic","tumult"],"phonetic":"/ˈfrɛnzi/","extraExplanation":["你输入的“phrensy”常见是拼写错误；正确拼写通常是 **frenzy**。","词义侧重“失控的激动/忙乱”，常与 **buying/media/feeding frenzy** 等搭配使用。文学与新闻写作里也常用来渲染人群或市场的非理性情绪。"]}
{"word":"phrensying","summary":{"en":"“phrensying” is usually a misspelling or archaic variant of “frenzying,” meaning “causing wild excitement or panic.”","zh":"“phrensying”通常是“frenzying”的误拼或古旧变体，意思是“使人极度亢奋或慌乱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “frenzying”) causing a feeling of wild excitement, panic, or uncontrolled activity; making someone feel frenzied.","zh":"（多半想写的是：frenzying）使人陷入狂乱/极度激动/慌乱的；令人失控般忙乱的。"},"examples":[{"en":"The constant alerts were frenzying the whole office.","zh":"不断的提醒通知把整个办公室都搞得一团慌乱。"},{"en":"The fast drumbeat had a frenzying effect on the crowd.","zh":"快速的鼓点让人群变得异常亢奋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/old spelling) “phrensying” is an uncommon, archaic-looking variant related to “phrensy,” an old form of “frenzy.” In modern English, people usually write “frenzying.”","zh":"（罕见/古旧拼法）“phrensying”很少见，带有古英语/古拼写风格，和“phrensy”（frenzy 的旧拼法）相关。现代英语一般写作“frenzying”。"},"examples":[{"en":"In older texts, you may see phrensy/phrensying where we would now write frenzy/frenzying.","zh":"在较早期的文本里，你可能会看到 phrensy/phrensying，而现代英语会写成 frenzy/frenzying。"}]}],"synonyms":["frantic","frenzied","wild","hectic","chaotic"],"phonetic":"/ˈfrɛnziɪŋ/","extraExplanation":["“phrensy”来自更早的拼写传统，和希腊语词根有关（与“mind/brain”的概念相关），历史上曾与“phren-”这一类拼写相连。随着拼写标准化，“frenzy”成为主流拼法，因此“phrensying”在现代写作中会显得不标准或像拼写错误。"]}
{"word":"phronemophobia","summary":{"en":"Phronemophobia means an irrational fear of thinking or being required to think.","zh":"Phronemophobia 指对思考或被要求思考的非理性恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, irrational fear of thinking or of having to think deeply","zh":"对“思考”或“必须深入思考”的强烈、非理性的恐惧"},"examples":[{"en":"Because of his phronemophobia, he panicked when the teacher asked an open-ended question.","zh":"因为他有“思考恐惧症”，老师一提开放式问题他就紧张得慌。"},{"en":"Her phronemophobia made problem-solving tasks feel threatening rather than interesting.","zh":"她的“思考恐惧症”让解题任务变得像威胁，而不是有趣的挑战。"}]}],"synonyms":["fear of thinking","thinking anxiety","cognitive anxiety","-phobia (suffix)"],"phonetic":"/ˌfroʊnəˌmoʊˈfoʊbiə/","extraExplanation":["这个词很少见，更多出现在网络词汇表或非正式语境中，并不是常见的临床诊断用语。更常用的表达可能是“fear of thinking / fear of critical thinking（害怕思考/害怕批判性思维）”，或在特定情境下说“anxiety about problem-solving（对解题的焦虑）”。","词源可拆为希腊语根：phronēma（思维、心智、想法）+ -phobia（恐惧）。了解词根有助于记忆：-phobia 表示“恐惧症/恐惧”。"]}
{"word":"phronesis","summary":{"en":"Phronesis means practical, ethical wisdom—good judgment about what to do in real situations.","zh":"phronesis 指“实践的、合乎伦理的智慧”：在真实情境中做出正确行动判断的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Practical wisdom: the ability to make good, ethical judgments in real-life situations, balancing values, goals, and circumstances (not just knowing rules).","zh":"实践智慧：在真实情境中做出良好且合乎伦理的判断与选择，能在价值、目标与现实条件之间取得平衡（不只是知道规则）。"},"examples":[{"en":"In Aristotle’s ethics, phronesis helps a person choose the right action at the right time for the right reason.","zh":"在亚里士多德的伦理学中，phronesis 帮助人在人生情境里“在恰当的时机、以恰当的理由做恰当的事”。"},{"en":"A good manager needs phronesis, not only technical knowledge, to handle conflicts fairly.","zh":"优秀的管理者需要 phronesis，不仅要有专业知识，还要能公正地处理冲突。"},{"en":"Her phronesis showed in how she listened carefully and then made a calm, workable decision.","zh":"她的 phronesis 体现在：先认真倾听，再做出冷静而可行的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"In virtue ethics, the key intellectual virtue that guides moral virtues (like courage and generosity) so they are expressed appropriately.","zh":"在德性伦理学中，一种关键的理智德性：它引导勇敢、慷慨等道德德性，使其在不同情境下表现得恰到好处。"},"examples":[{"en":"Without phronesis, bravery can turn into recklessness.","zh":"没有 phronesis，勇敢可能会变成鲁莽。"},{"en":"Phronesis connects moral ideals with everyday choices.","zh":"phronesis 把道德理想与日常选择连接起来。"}]}],"synonyms":["practical wisdom","prudence","good judgment","discernment","common sense"],"phonetic":"/frəˈniːsɪs/","extraExplanation":["这是希腊语词（φρόνησις），常见于亚里士多德《尼各马可伦理学》。它常被译为“practical wisdom（实践智慧）”或“prudence（审慎/明智）”，但和“聪明/智商”不同，更强调在具体情境中看清要点、权衡利害，并以善为目标做决定。","常与 Aristotle 的三种“知识/智慧”区分：episteme（科学式知识，偏理论与普遍规律）、techne（技艺/技术，偏制作与方法）、phronesis（实践智慧，偏行动与伦理判断）。","在现代写作里，它多出现在哲学、伦理学、教育学、领导力与专业实践（如医学、法律、社工）讨论中，用来强调“做对的事”的判断力，而不只是“把事做对”的技能。"]}
{"word":"phronima","summary":{"en":"Phronima means a person’s mindset or inner attitude; in Eastern Orthodox usage, it can mean the Church’s proper spiritual orientation.","zh":"phronima 指“心态/内在态度”；在东正教语境中也可指“教会应有的属灵取向/心意”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Greek) a mindset or inner attitude; the way someone habitually thinks and feels about things.","zh":"（源自希腊语）心态、内在态度；一个人习惯性的思考与感受方式。"},"examples":[{"en":"Her phronima was calm and hopeful even during the crisis.","zh":"即使在危机中，她的心态仍然平静而充满希望。"},{"en":"Changing your phronima can change how you respond to stress.","zh":"改变你的心态，可能会改变你应对压力的方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(Christian, especially Eastern Orthodox) the spiritual mindset or orientation considered proper to the Church and its tradition.","zh":"（基督宗教用语，尤指东正教）被认为符合教会及其传统的属灵心态／取向。"},"examples":[{"en":"He studied the Fathers to better understand the Church’s phronima.","zh":"他研读教父著作，以更好理解教会的属灵心态。"},{"en":"In this tradition, phronima is shaped by worship, prayer, and community life.","zh":"在这一传统中，属灵心态会被礼拜、祈祷与团体生活所塑造。"}]}],"synonyms":["mindset","attitude","disposition","outlook","orientation"],"phonetic":"/ˈfroʊnɪmə/","extraExplanation":["“phronima”来自希腊语 φρόνημα，和“phronesis（实践智慧）”同源但不完全相同：phronesis更偏“明智的判断力”，phronima更偏“整体的心志/取向/内在态度”。","在英语里它多见于神学、哲学或学术写作，日常口语更常用 mindset / attitude / outlook 来表达。","在东正教语境中常见搭配如 “the mind of the Church（教会的心意/心态）”，用来强调一种由传统、礼仪与灵修经验塑造的共同精神取向。"]}
{"word":"phronimidae","summary":{"en":"Phronimidae: a family of pelagic (open-ocean) amphipod crustaceans, including barrel-dwelling Phronima species.","zh":"Phronimidae：远洋端足类甲壳动物的一科，包括以“桶居”行为闻名的 Phronima 等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small marine crustaceans (amphipods) that live in the open ocean; some species (such as those in the genus Phronima) are known for living inside barrel-shaped gelatinous animals (like salps).","zh":"一种生活在远洋海域的小型甲壳动物（端足目）的科名；其中一些种（如短腕水母虾属 Phronima）以钻入并栖居在桶状的胶质生物（如海樽/樽海鞘）体内而闻名。"},"examples":[{"en":"Phronimidae are pelagic amphipods often found in midwater ocean habitats.","zh":"短腕水母虾科（Phronimidae）是远洋生活的端足类，常见于海洋中层水域。"},{"en":"Some Phronimidae carve out a ‘barrel’ from a salp and use it as a shelter.","zh":"有些短腕水母虾科动物会把海樽掏成“桶”，并把它当作庇护所。"}]}],"synonyms":["Phronimid amphipods (common descriptive phrase)"],"phonetic":"/ˌfroʊˈnɪmɪdiː/","extraExplanation":["“Phronimidae”是生物分类学用语（科名），常见于海洋生物学与分类学文献，不属于日常英语词汇。","词源上来自属名“Phronima”（短腕水母虾属）+ 科级后缀“-idae”（表示“……科”）。","相关背景：Phronima 的“桶居”行为在科普作品中很出名，有时被称作“barrel amphipod（桶居端足类）”，但这更像描述性俗称而非严格分类名。"]}
{"word":"phrontisterion","summary":{"en":"A rare, humorous word for a place devoted to deep thinking or study (a “thinkery”).","zh":"一个罕见且带幽默/典故色彩的词，指用于学习或深度思考的地方（类似“思想工厂/学究窝”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, rare) A place where people study or think deeply, especially an academic or philosophical “think tank.”","zh":"（幽默、少见）指人们学习或深入思考的地方，尤指带点讽刺意味的“思想工厂／学究窝”。"},"examples":[{"en":"He jokingly called the graduate lounge his little phrontisterion.","zh":"他开玩笑地把研究生休息室叫作他的小“phrontisterion”（学究窝）。"},{"en":"The satire portrays the university as a modern phrontisterion full of strange theories.","zh":"这部讽刺作品把大学描绘成一个充满怪异理论的现代“phrontisterion”。"}]}],"synonyms":["think tank","study","academy","intellectual center","thinkery"],"phonetic":"/ˌfrɑn.tɪˈstɪr.i.ən/","extraExplanation":["这个词来自古希腊喜剧作家阿里斯托芬（Aristophanes）的《云》（The Clouds）。剧中“phrontisterion”是苏格拉底办的“思考所／学堂”，被用来讽刺当时的诡辩与空谈。现代英语里它非常罕见，通常带有戏谑、书卷气或文学典故的味道。"]}
{"word":"phrontisterium","summary":{"en":"A rare word meaning a place for study or deep thinking, often used humorously.","zh":"一个罕见词，指学习或深度思考的场所，常带幽默或讽刺意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often humorous) A place for study, serious thinking, or intellectual discussion; a “thinkery.”","zh":"（罕见，常带幽默）学习、沉思或进行学术讨论的地方；“思考所/学究窝”。"},"examples":[{"en":"He joked that his cluttered home office was a little phrontisterium.","zh":"他开玩笑说自己杂乱的家庭办公室就是个小小的“phrontisterium”。"},{"en":"The café became a late-night phrontisterium for students debating politics and philosophy.","zh":"那家咖啡馆成了学生们深夜辩论政治与哲学的“思考据点”。"}]}],"synonyms":["thinkery","think tank","study","reading room","ivory tower"],"phonetic":"ˌfrɑn.tɪˈstɪr.i.əm","extraExplanation":["词源来自古希腊语 *phrontistērion*，意为“思考/研究的地方”。它最著名的文化出处是古希腊喜剧作家阿里斯托芬（Aristophanes）的《云》（*The Clouds*）里苏格拉底的“Thinkery（思辨学堂）”，常被用来带一点讽刺或戏谑地指“过度钻研、学究气”的场所。","在现代英语中非常少见，多用于文学、讽刺或玩笑语境；日常更常说 **study**, **library**, **think tank**, **ivory tower**（带贬义/讽刺色彩时）等。"]}
{"word":"phrontistery","summary":{"en":"Phrontistery means a place for study or deep thinking, often used in a humorous or literary way.","zh":"Phrontistery 指“学习/深思之所”，多用于幽默或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place for study or deep thinking; a school or “thinkery” (often used humorously or in literary contexts).","zh":"学习或深入思考的地方；书院/学塾/“思考坊”（常带幽默或文学色彩）。"},"examples":[{"en":"He called the quiet library his personal phrontistery.","zh":"他把那间安静的图书馆称作自己的“phrontistery”（思考之所）。"},{"en":"In the play, the student enters a phrontistery to learn clever arguments.","zh":"在戏剧里，学生走进一所 phrontistery 学习巧辩之术。"}]}],"synonyms":["thinkery","study","academy","school","seminary"],"phonetic":"/frɑnˈtɪstəri/","extraExplanation":["这个词最有名的出处是古希腊喜剧作家阿里斯托芬（Aristophanes）的《云》（The Clouds）。剧中把苏格拉底的“学园/学派”戏称为 phrontistērion（“思考之所”“想法工坊”），带有讽刺“只会空谈、钻牛角尖”的味道。英语里的 phrontistery 就从这个词演变而来，因此它在现代英语里很少见，使用时往往带一点戏谑或书卷气。"]}
{"word":"phrun","summary":{"en":"“Phrun” isn’t a standard English word; it’s likely a typo (often for “prune”).","zh":"“phrun”不是标准英语单词；更可能是拼写错误（常见为“prune”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or an invented spelling (often typed when someone means “prune” or another similar-looking word).","zh":"不是标准英语单词；通常是拼写错误或临时造词（常见情况是想写“prune”等相似拼写的词）。"},"examples":[{"en":"I can’t find “phrun” in the dictionary—did you mean “prune”?","zh":"我在词典里找不到“phrun”——你是不是想写“prune”？"},{"en":"If you meant “prune,” it can mean to cut off unwanted branches.","zh":"如果你想写的是“prune”，它可以表示修剪掉不需要的枝条。"}]}],"synonyms":["(if you meant “prune”) trim","cut back","clip","remove","delete"],"phonetic":"/frʌn/","extraExplanation":["“phrun”在常见英语词典中一般查不到，因此更可能是：\n1）把“prune”（修剪；删减；梅干）打错了；\n2）把“frond / frown / run”等词的拼写混在一起；\n3）网络昵称、游戏ID、或特定圈子里的自造词。\n如果你告诉我你看到它的句子（上下文），我可以更准确判断你想表达的词。"]}
{"word":"phryganea","summary":{"en":"Phryganea is a scientific genus name for certain caddisflies, especially known for case-building larvae.","zh":"Phryganea 指石蛾属的学名，常见特征是幼虫会筑壳并背着外壳生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of caddisflies (aquatic insects) whose larvae build protective cases from plant pieces or other materials; also used more loosely to refer to caddisflies of this group","zh":"石蛾属（Phryganea）：一种毛翅目水生昆虫的属名；其幼虫常用植物碎片等材料做“虫壳”以保护自己（有时也被较宽泛地用来指这一类石蛾）"},"examples":[{"en":"Phryganea larvae live in freshwater and often carry a little case they build themselves.","zh":"石蛾属（Phryganea）的幼虫生活在淡水中，常背着自己做的小虫壳。"},{"en":"In a field guide, Phryganea is listed under caddisflies (order Trichoptera).","zh":"在野外图鉴里，Phryganea 通常归在石蛾（毛翅目）之下。"}]}],"synonyms":["caddisfly","Trichoptera (order name)"],"phonetic":"/fraɪˈɡeɪniə/","extraExplanation":["这是拉丁化的生物学属名，写作首字母大写（Phryganea），斜体常用于正式学术排版；日常英语更常用的通俗词是 caddisfly（石蛾）。","石蛾幼虫“背壳/筑壳”的习性在自然观察与生态学中很常见：它们会用细枝、叶片、砂粒等材料黏合成外壳，用来伪装与防御。"]}
{"word":"phryganeid","summary":{"en":"A phryganeid is a caddisfly in the family Phryganeidae; it can also mean “related to that family.”","zh":"phryganeid 指石蛾科（Phryganeidae）的石蛾，也可作形容词表示“与石蛾科有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a caddisfly belonging to the family Phryganeidae (often large, with aquatic larvae that live in cases they build).","zh":"（昆虫）石蛾目中“石蛾科（Phryganeidae）”的成员；常见体型较大，幼虫生活在水中，会用植物碎片等材料筑“虫巢/虫壳”。"},"examples":[{"en":"The stream survey recorded several phryganeids near the reed beds.","zh":"溪流调查在芦苇丛附近记录到几只石蛾科（phryganeid）昆虫。"},{"en":"Phryganeid larvae build portable cases from bits of leaves and stems.","zh":"石蛾科幼虫会用叶片和茎的碎片搭建可移动的“虫壳”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the family Phryganeidae.","zh":"与石蛾科（Phryganeidae）有关的；具有石蛾科特征的。"},"examples":[{"en":"The guide compares phryganeid species found in northern lakes.","zh":"这本指南比较了北方湖泊中发现的石蛾科物种。"}]}],"synonyms":["caddisfly (Phryganeidae)","large caddisfly"],"phonetic":"/ˈfrɪɡəˌniːɪd/","extraExplanation":["“phryganeid”来自分类学命名：Phryganeidae（石蛾科）。在生态学与水质监测里，石蛾幼虫常被用作“水环境健康”的指示生物之一（不同类群耐污能力不同）。","读音上常见两种末尾处理：-id（表示“某类/某科成员”）在生物学词里有时读作 /-ɪd/，也有人读得更接近 /-aɪd/；两者在实际交流中都可能听到。"]}
{"word":"phryganeidae","summary":{"en":"Phryganeidae is the insect family known as the giant caddisflies (order Trichoptera).","zh":"Phryganeidae 指毛翅目中的巨型石蛾科（巨型毛翅虫科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of insects (order Trichoptera) commonly called “giant caddisflies,” whose aquatic larvae often live in lakes or slow water and build protective cases from plant material.","zh":"（昆虫纲）毛翅目中的一科，常称“巨大型石蛾/巨型毛翅虫”（巨型石蛾科）；其水生幼虫多栖于湖泊或缓流水域，常用植物碎片等材料筑成保护性的“虫巢/虫管”。"},"examples":[{"en":"Phryganeidae larvae are often found in still or slow-moving freshwater.","zh":"巨型石蛾科（Phryganeidae）的幼虫常见于静水或缓流的淡水环境中。"},{"en":"In field guides, Phryganeidae may be listed as “giant caddisflies.”","zh":"在野外识别手册中，Phryganeidae 可能会被标注为“giant caddisflies（巨型毛翅虫）”。"}]}],"synonyms":["giant caddisflies","caddisfly family (Phryganeidae)"],"phonetic":"/ˌfrɪɡəˈniːɪdiː/","extraExplanation":["这是一个生物分类学名称，通常以拉丁化形式出现，首字母大写（Phryganeidae）。在英文科普或野外记录中，你也会看到更常用的俗名：caddisflies（石蛾/毛翅虫），其中这一科常被称为 giant caddisflies。","读法上常按英语习惯重音落在 “-NEE-” 附近：fry-GAN-ee-ih-dee。"]}
{"word":"phryganeoid","summary":{"en":"A rare scientific adjective meaning “caddisfly-like,” especially like the genus *Phryganea*.","zh":"一个少见的科学形容词，意为“石蛾样的/与*Phryganea*属石蛾相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or belonging to caddisflies of the group or genus *Phryganea* (a kind of aquatic insect).","zh":"与石蛾（毛翅目）中*Phryganea*属或其相关类群有关的；形态上类似该类石蛾的。"},"examples":[{"en":"The larva was described as phryganeoid because it built a protective case from small plant fragments.","zh":"这种幼虫被描述为“phryganeoid”，因为它会用细小植物碎片建造保护性的虫鞘。"},{"en":"Under the microscope, the wing venation looked phryganeoid rather than moth-like.","zh":"在显微镜下，它的翅脉看起来更像“phryganeoid（石蛾型）”，而不是蛾类的特征。"}]}],"synonyms":["caddisfly-like","trichopteran","phryganean"],"phonetic":"/ˌfrɪɡəˈniːɔɪd/","extraExplanation":["这是昆虫学/分类学里的罕见术语，常见于学术论文或鉴定描述中，日常英语几乎不用。","词源上来自 *Phryganea*（一类石蛾的属名）+ -oid（“……样的/类似的”）。石蛾幼虫常生活在水中，并会用沙粒、枝叶等材料做“虫巢/虫鞘”（case）。"]}
{"word":"phrygia","summary":{"en":"Phrygia is the name of an ancient region (and later a Roman province) in central Anatolia, in modern-day Turkey.","zh":"Phrygia 指古代土耳其中部安纳托利亚的一块地区（后来也指罗马时期的行省）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient region in central Anatolia (modern-day Turkey), known in Greek and Roman history.","zh":"弗里吉亚（Phrygia）：古代安纳托利亚（今土耳其中部）的一块地区，常见于希腊与罗马历史记载中。"},"examples":[{"en":"Phrygia was an important crossroads between Greek and Anatolian cultures.","zh":"弗里吉亚是希腊文化与安纳托利亚文化之间的重要交汇地。"},{"en":"Many myths place King Midas in Phrygia.","zh":"许多神话把迈达斯王的故事背景放在弗里吉亚。"}]},{"partOfSpeech":"n.","definition":{"en":"A Roman province created from or including parts of the earlier region of Phrygia.","zh":"（罗马时期）弗里吉亚行省：由原弗里吉亚地区的一部分或其周边区域设立的罗马行省。"},"examples":[{"en":"Under the Roman Empire, Phrygia was reorganized into provincial territories.","zh":"在罗马帝国时期，弗里吉亚被重新划分为行省辖区。"}]}],"synonyms":["ancient Anatolia","Anatolian region"],"phonetic":"/ˈfrɪdʒiə/","extraExplanation":["“Phrygia（弗里吉亚）”常与神话人物“King Midas（迈达斯王）”联系在一起：他因“点金术”的传说而著名。","英语里还常见形容词 Phrygian（弗里吉亚的）。例如：Phrygian cap（弗里吉亚帽，一种尖顶软帽，后来在欧洲象征自由）；Phrygian mode（弗里吉亚调式，音乐术语）。"]}
{"word":"phrygian","summary":{"en":"Phrygian means “related to ancient Phrygia/Phrygians,” and it also names a musical mode with a dark, tense sound (minor with a lowered 2nd).","zh":"Phrygian 指“与古代弗里吉亚/弗里吉亚人有关”，也可指一种调式：听感偏阴暗紧张，类似小调但第二音降低。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Phrygia (an ancient region in Anatolia, modern-day Turkey) or the Phrygians (the people who lived there).","zh":"与弗里吉亚（安纳托利亚的古代地区，今土耳其境内）或弗里吉亚人（当地古代民族）有关的。"},"examples":[{"en":"The museum has a small collection of Phrygian pottery.","zh":"这家博物馆收藏了一小批弗里吉亚陶器。"},{"en":"Her paper discusses Phrygian culture in the early Iron Age.","zh":"她的论文讨论了早期铁器时代的弗里吉亚文化。"}]},{"partOfSpeech":"n.","definition":{"en":"A musical mode (scale type) used in Western music, characterized by a minor sound with a lowered second note (often described as “minor with a flat 2”).","zh":"一种西方音乐中的调式（音阶类型），听感接近小调，但第二音降低（常被描述为“带降二级的小调”）。"},"examples":[{"en":"The riff is in the Phrygian mode, so it sounds darker and more tense.","zh":"这段即兴重复句用的是弗里吉亚调式，所以听起来更阴暗、更紧张。"},{"en":"Some flamenco melodies commonly use Phrygian colors.","zh":"一些弗拉门戈旋律常带有弗里吉亚调式的色彩。"}]}],"synonyms":["Phrygian mode","modal (in music)","Anatolian (regional, broader)"],"phonetic":"/ˈfrɪdʒiən/","extraExplanation":["“Phrygian”源自古地名 Phrygia（弗里吉亚）。在英语里常大写表示历史/地理意义（Phrygian people, Phrygian art），在音乐语境中也常见大写（Phrygian mode）。","音乐上，弗里吉亚调式可用“自然小调把第2级降半音”来记忆（例如以 E 为主音：E–F–G–A–B–C–D–E）。因此它在金属、爵士、电影配乐和弗拉门戈中常被用来营造紧张、异域或神秘感。"]}
{"word":"phrygianize","summary":{"en":"“Phrygianize” means to give music a Phrygian-mode sound or flavor.","zh":"“phrygianize”指让音乐带有弗里吉亚调式的音响或风格。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something sound or feel Phrygian; to give music a Phrygian character (especially by using the Phrygian mode or its typical notes).","zh":"使某物呈现弗里吉亚（Phrygian）风格；使音乐带有弗里吉亚调式特征（尤指使用弗里吉亚调式或其典型音级）。"},"examples":[{"en":"The composer phrygianized the melody by emphasizing the half-step between the first and second notes of the scale.","zh":"作曲家通过强调音阶中第一与第二音之间的半音关系，让旋律带上了弗里吉亚色彩。"},{"en":"In the bridge, the guitarist phrygianized the riff to create a darker, more exotic mood.","zh":"在过门段落里，吉他手把乐句“弗里吉亚化”，营造出更阴暗、更异域的氛围。"}]}],"synonyms":["make Phrygian","add a Phrygian flavor","use the Phrygian mode","modalize (context-dependent)"],"phonetic":"/ˈfrɪdʒiənaɪz/","extraExplanation":["“phrygianize”来自“Phrygian（弗里吉亚的）+ -ize（使……化）”。它并不是日常英语常用词，更多见于音乐理论、作曲分析或评论文字中。","弗里吉亚调式（Phrygian mode）常给人“紧张、神秘、异域”的听感，尤其是它的特征音程：主音到二级音是半音（例如E Phrygian：E–F）。在西班牙/弗拉门戈语境中，人们也会谈到带强烈弗里吉亚色彩的和声与旋律。","更常见的表达方式包括：“use the Phrygian mode / make it Phrygian / add a Phrygian flavor”。"]}
{"word":"phrygium","summary":{"en":"Phrygium is a Latin/learned form meaning “Phrygian,” i.e., related to ancient Phrygia (central Turkey), often used in scholarly or scientific naming.","zh":"Phrygium 是拉丁语/学术形式，意为“弗里吉亚的”，指与古代弗里吉亚（今土耳其中部）有关，常见于学术写作或科学命名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin/learned form) “Phrygian”; relating to Phrygia, an ancient region in what is now central Turkey. Often seen in historical writing or as a scientific (Latin) word in species names.","zh":"（拉丁语/学术用语）“弗里吉亚的”；与弗里吉亚（今土耳其中部一带的古代地区）有关。常见于历史文献或作为动植物学名中的拉丁词。"},"examples":[{"en":"In a Latin inscription, “phrygium” describes something associated with Phrygia.","zh":"在拉丁铭文中，“phrygium”用来形容与弗里吉亚有关的事物。"},{"en":"In biology, a species epithet like “phrygium” can mean “from Phrygia” or “Phrygian.”","zh":"在生物学中，像“phrygium”这样的种加词常表示“来自弗里吉亚的”或“弗里吉亚的”。"}]}],"synonyms":["Phrygian","of Phrygia","Phrygian (Latinized)"],"phonetic":"/ˈfrɪdʒiəm/","extraExplanation":["“Phrygium”更像是拉丁语形式，而英语里更常见的是 **Phrygian**（adj./n. 弗里吉亚的；弗里吉亚人）。","弗里吉亚在古希腊、古罗马文献中经常出现；相关文化符号包括“弗里吉亚帽”（Phrygian cap，常被视为自由的象征）以及音乐上的“弗里吉亚调式”（Phrygian mode）。"]}
{"word":"phryma","summary":{"en":"Phryma is a botanical genus name, best known for the plant called lopseed (Phryma leptostachya).","zh":"Phryma 是植物学中的属名，最常见的代表是俗称 lopseed 的植物（Phryma leptostachya）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants; especially the plant commonly called lopseed (Phryma leptostachya).","zh":"（植物）一种开花植物属名；尤指常见的“倒钩草/裂果草”（lopseed，学名 Phryma leptostachya）。"},"examples":[{"en":"Phryma leptostachya is often called lopseed in North America.","zh":"Phryma leptostachya 在北美常被称为 lopseed（倒钩草/裂果草）。"},{"en":"In older field guides, Phryma may appear under a different family classification.","zh":"在较早的野外植物图鉴里，Phryma 可能会出现在不同的科分类之下。"}]}],"synonyms":["lopseed"],"phonetic":"/ˈfraɪmə/","extraExplanation":["“Phryma”主要用于植物学语境，是拉丁化的属名；日常英语里更常用通俗名 lopseed。","读音常按英语习惯重读第一音节（FRY-muh）。不同地区或学术圈可能有轻微差异，但不影响识别。"]}
{"word":"phrymaceae","summary":{"en":"Phrymaceae is the botanical family that includes monkeyflowers and related plants.","zh":"Phrymaceae 指植物分类中的玄参科，包含猴面花等相关植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes monkeyflowers and related flowering plants (a group used in botanical classification).","zh":"玄参科（Phrymaceae）：植物分类中的一个科，包含猴面花等相关的开花植物。"},"examples":[{"en":"Monkeyflowers are often placed in the family Phrymaceae.","zh":"猴面花常被归入玄参科（Phrymaceae）。"},{"en":"In our botany class, we learned how Phrymaceae is classified among flowering plants.","zh":"在植物学课上，我们学习了玄参科（Phrymaceae）在被子植物中的分类。"}]}],"synonyms":["monkeyflower family"],"phonetic":"/fraɪˈmeɪsiˌi/","extraExplanation":["Phrymaceae 是拉丁化的科名，常见于植物学、园艺与生态学写作中；日常英语里更常说 “monkeyflower family（猴面花科/猴面花类群）”。","分类学上，这个科的范围在近几十年因 DNA 系统学研究而有所调整：一些过去放在玄参科（Scrophulariaceae）或其他科的属，被重新归入 Phrymaceae。不同教材或地区的处理可能略有差异。","读法上常听到类似 “fry-MAY-see-ee” 的四拍读音；因为是学名，口语里存在小差别是正常的。"]}
{"word":"phrymaceous","summary":{"en":"phrymaceous = relating to the plant family Phrymaceae or the genus *Phryma*.","zh":"phrymaceous＝与黄芩花科（Phrymaceae）或通泉草属（*Phryma*）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare/technical) Relating to the genus *Phryma* or to the plant family Phrymaceae (plants such as monkeyflowers).","zh":"（植物学，较少用/专业）与 *Phryma*（一属植物）或与苦苣苔目中的黄芩花科/通泉草科（Phrymaceae，如“猴面花/猴花”一类植物）有关的。"},"examples":[{"en":"Some older floras group these species under a phrymaceous lineage.","zh":"一些较早的植物志会把这些物种归为与黄芩花科（phrymaceous）相关的谱系。"},{"en":"The paper compares phrymaceous traits with those of closely related families.","zh":"这篇论文比较了黄芩花科（phrymaceous）的特征与近缘科的特征。"}]}],"synonyms":["Phrymaceae-related","phryma-related","(taxonomic) phrymacean"],"phonetic":"/fraɪˈmeɪʃəs/","extraExplanation":["这是一个非常少见的形容词，主要出现在植物分类学或植物志写作中。更常见、也更标准的说法是 **Phrymaceae**（科名）或 **phrymaceous** 作为“Phrymaceae 的”。","词源上来自拉丁化的植物学命名：**Phryma**（属名）+ 形容词后缀 **-aceous**（表示“……的/……性质的”，常见于植物学形容词，如 *rosaceous*“蔷薇科的”）。","如果你是在论文或鉴定资料里看到它，有时也可能是排版或拼写差异；但在现代资料中更常用 **phrymaceous** 来指“黄芩花科相关”。"]}
{"word":"phrynid","summary":{"en":"A phrynid is a tailless whip spider (an arachnid), especially one in the family Phrynidae.","zh":"phrynid 指无尾鞭蝎/鞭蛛（蛛形纲动物），尤指鞭蛛科（Phrynidae）的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tailless whip spider (an arachnid) or a member of the family Phrynidae, known for very long front legs used like feelers.","zh":"无尾鞭蝎（鞭蛛的一类、蛛形纲动物）；也指鞭蛛科（Phrynidae）的成员，以极长的前足像“触角”一样探路而闻名。"},"examples":[{"en":"The phrynid moved slowly across the bark, using its long front legs to sense the way.","zh":"这只无尾鞭蝎缓慢爬过树皮，用它细长的前足探测前方。"},{"en":"In the terrarium, a phrynid prefers dark hiding places and gentle humidity.","zh":"在饲养箱里，无尾鞭蝎更喜欢阴暗的躲藏处和适度的湿度。"}]}],"synonyms":["whip spider","tailless whip scorpion","amblypygid"],"phonetic":"ˈfrɪnɪd","extraExplanation":["“phrynid”来自分类学用法，指鞭蛛目中的一类（常见中文也叫“无尾鞭蝎/鞭蛛”）。它们看起来像蝎子，但没有毒刺尾巴；也不像蜘蛛那样织网，主要在夜间活动，用极长的第一对足当作“触须”探索环境。","在科普或饲养语境中，英语里更常见的通俗说法是“whip spider”或“tailless whip scorpion”；“phrynid”偏学术或专业写法。"]}
{"word":"phrynidae","summary":{"en":"Phrynidae is a zoological term for the family of tailless whip scorpions (whip spiders) in the order Amblypygi.","zh":"Phrynidae 指无尾鞭蝎科：无尾鞭蝎目（Amblypygi）中一类被称为“无尾鞭蝎/鞭蛛”的蛛形动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of arachnids (order Amblypygi), commonly called tailless whip scorpions or whip spiders; they have flattened bodies, very long front legs used like feelers, and large spiny pedipalps for catching prey.","zh":"（动物）无尾鞭蝎（又称“鞭蛛/无尾鞭蝎”）的一科，隶属无尾鞭蝎目（Amblypygi）；身体扁平，第一对足极长常作“触须”使用，并有带刺的螯肢（触肢）用于捕食。"},"examples":[{"en":"Scientists recorded a new Phrynidae species in a limestone cave.","zh":"科学家在石灰岩洞穴中记录到一种新的无尾鞭蝎科（Phrynidae）物种。"},{"en":"Many Phrynidae are nocturnal and hide under rocks during the day.","zh":"许多无尾鞭蝎科动物夜行性强，白天躲在石块下。"},{"en":"In field guides, Phrynidae is listed under the order Amblypygi.","zh":"在野外辨识手册里，无尾鞭蝎科（Phrynidae）被列在无尾鞭蝎目（Amblypygi）之下。"}]}],"synonyms":["tailless whip scorpion family","whip spider family"],"phonetic":"/ˈfrɪnɪdi/","extraExplanation":["这是生物分类学用语：以“-idae”结尾通常表示“科”（family）。Phrynidae 属于蛛形纲（Arachnida）中的无尾鞭蝎目（Amblypygi），外形像“蜘蛛+螳螂”，但不是真正的蜘蛛，也没有蝎子的毒针。","词源上来自属名 Phrynus（常见的一个属名），再加上表示“科”的后缀 -idae。日常英语里更常用的通俗说法是 tailless whip scorpion 或 whip spider。"]}
{"word":"phrynin","summary":{"en":"“phrynin” isn’t a recognized English word; it’s probably a misspelling or a proper noun.","zh":"“phrynin”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, a rare proper name, or a specialized term (unclear without context).","zh":"不是标准英语单词；可能是拼写错误、罕见专有名词或某个专业领域用语（缺少上下文无法确定）。"},"examples":[{"en":"I couldn’t find “phrynin” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“phrynin”——你能把它出现的句子发我吗？"},{"en":"If you meant “Phryne,” it refers to a famous woman from ancient Greece.","zh":"如果你想写的是“Phryne”，它指的是古希腊一位著名女性。"}]}],"phonetic":"/ˈfrɪnɪn/","extraExplanation":["“phrynin”很可能是拼写误差。常见的相近拼写包括：\n- Phryne（弗里涅）：古希腊历史/传说中的著名女性名字。\n- Phrygian（弗里吉亚的）：与古代弗里吉亚地区/音乐调式相关的形容词。\n- 也可能是人名、用户名、作品名或某个学科里的术语。\n如果你把原句或来源（书名/网页/截图）发来，我可以帮你准确判断它指什么。"]}
{"word":"phrynoid","summary":{"en":"Phrynoid means “toad-like” (rare, technical).","zh":"phrynoid 表示“像蟾蜍的”（罕见的技术性用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a toad; toad-like in shape, skin texture, or general appearance (a rare, technical word).","zh":"像蟾蜍的；蟾蜍般的（罕见的技术性用语，常用于动物学或形态描述）。"},"examples":[{"en":"The biologist noted the phrynoid texture of the animal’s skin.","zh":"生物学家注意到这只动物皮肤具有蟾蜍般的质地。"},{"en":"In the illustration, the creature has a squat, phrynoid body and warty back.","zh":"在插图中，这个生物有矮胖的蟾蜍样躯体和疣状的背部。"}]}],"synonyms":["toadlike","bufonine","warty-looking"],"phonetic":"/ˈfɹaɪ.nɔɪd/","extraExplanation":["“phrynoid”源自希腊语词根 phrynē（意为“蟾蜍”）。在现代英语中非常少见，多见于生物学、解剖学或古旧的自然史写作，用来做形态学描述。","不要与“Phrynocephalus / Phrynosoma”等以 phryno- 开头的动物学属名混淆；这些属名也与“蟾蜍样/蟾蜍”这一词根有关，但属于专有名词。"]}
{"word":"phrynosoma","summary":{"en":"Phrynosoma is the scientific genus name for horned lizards.","zh":"Phrynosoma 是角蜥属的学名（角蜥/角蜥蜴的一属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small desert lizards (horned lizards) known for a flat, round body and sharp head spines.","zh":"角蜥属（沙漠小型蜥蜴的一属），以扁圆的身体和头部尖刺而闻名。"},"examples":[{"en":"The biologist studied Phrynosoma species in the Sonoran Desert.","zh":"这位生物学家在索诺兰沙漠研究角蜥属的物种。"},{"en":"A Phrynosoma can stay very still to avoid being seen by predators.","zh":"角蜥属的蜥蜴会一动不动地待着，以避免被捕食者发现。"}]}],"synonyms":["horned lizard","horny toad","horned toad"],"phonetic":"/ˌfrɪnoʊˈsoʊmə/","extraExplanation":["“Phrynosoma”来自希腊语词根：phrynos-（蟾蜍）+ -soma（身体），意思接近“像蟾蜍一样的身体”，因为这种蜥蜴体型扁圆、外形常被人联想到蟾蜍。","日常英语里更常用的说法是“horned lizard”；在美国西南部口语里也常叫“horny toad / horned toad”，但它们并不是蟾蜍，而是蜥蜴。"]}

