{"word":"pht","summary":{"en":"“PHT” is usually an abbreviation; a common meaning is “phototherapy,” but the exact meaning depends on context.","zh":"“PHT”通常是缩写；常见含义之一是“phototherapy（光疗）”，但具体意思取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism. “PHT” is not a common everyday English word by itself; its meaning depends on the context (field, document, or message).","zh":"一个缩写/首字母缩略词。“PHT”本身不是常见的日常英语单词；具体意思取决于语境（领域、文件或对话）。"},"examples":[{"en":"The report uses several abbreviations, like PHT, that are explained in the glossary.","zh":"这份报告用了很多缩写，比如 PHT，它们在术语表里有解释。"},{"en":"In this form, PHT stands for a department name, not a regular word.","zh":"在这张表里，PHT 代表一个部门名称，不是普通单词。"}]},{"partOfSpeech":"other","definition":{"en":"(Common medical/clinical use) Short for “phototherapy,” a treatment that uses light (often for newborn jaundice or certain skin conditions).","zh":"（医学/临床常见用法）“phototherapy（光疗）”的缩写，用光照进行治疗（常用于新生儿黄疸或某些皮肤病）。"},"examples":[{"en":"The baby was placed under PHT for jaundice.","zh":"宝宝因为黄疸接受了光疗（PHT）。"},{"en":"The doctor recommended PHT to help manage the skin condition.","zh":"医生建议用光疗（PHT）来帮助控制这种皮肤问题。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/piː eɪtʃ tiː/","extraExplanation":["你可能想输入的是别的词：\n- “pH”（酸碱度）读作 /piː eɪtʃ/，常见于化学与护肤品成分表。\n- “phat”（俚语，意为“很酷/很棒/很有吸引力”）多见于口语与音乐文化。\n- “path”（小路/路线）是常见单词。\n如果你告诉我你在哪里看到“PHT”（医学报告、聊天、课程、产品说明等），我可以给出最准确的解释与用法。"]}
{"word":"phtalic","summary":{"en":"“Phtalic” is usually a misspelling of **phthalic**, meaning “related to phthalic acid/phthalates.”","zh":"“phtalic” 通常是 **phthalic** 的误拼，意思是“与邻苯二甲酸/邻苯二甲酸酯相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled **phthalic**) relating to **phthalic acid** or the **phthalate** chemical family, used in making plastics, dyes, and other industrial products.","zh":"（通常拼作 **phthalic**）与**邻苯二甲酸**或**邻苯二甲酸酯（塑化剂）**这一类化学物质有关，常用于制造塑料、染料等工业产品。"},"examples":[{"en":"The label says the product is **phthalic**-acid–free.","zh":"标签上写着该产品不含**邻苯二甲酸**。"},{"en":"Some regulations limit certain **phthalic** compounds in toys.","zh":"一些法规会限制玩具中的某些**邻苯二甲酸类**化合物。"}]}],"synonyms":["phthalate (related term)","phthalic-acid (attributive form)"],"phonetic":"/ˈθælɪk/","extraExplanation":["你输入的 **phtalic** 在英语里多半是 **phthalic** 的拼写错误。这个词常见于化学/材料相关语境：**phthalic acid（邻苯二甲酸）**、**phthalates（邻苯二甲酸酯，常被称为“塑化剂”）**。","发音提示：虽然拼写里有 **phth-**，但 **ph** 发 /f/，而 **th** 常发 /θ/（像 thin 的开头），所以听起来更像 “THAL-ik”。"]}
{"word":"phthalacene","summary":{"en":"“Phthalacene” is an uncommon chemistry word; it may refer to a niche aromatic compound or be a misspelling of a more common chemical term.","zh":"“phthalacene”在英语中很少见，多见于小众化学语境；它可能指某种芳香化合物，也可能是更常见化学术语的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, specialized chemistry term: a polycyclic aromatic hydrocarbon name sometimes used in older or niche contexts. In most modern English, this word is uncommon and may be a misspelling of a more common chemical name.","zh":"一个较罕见、偏专业的化学用词：有时在较旧或小众文献中用来指某类多环芳香烃。不过在现代英语里几乎不常用，也可能是更常见化学名词的拼写误差。"},"examples":[{"en":"I couldn’t find “phthalacene” in most general dictionaries; it appears mainly in specialized chemical contexts.","zh":"在多数通用词典里找不到“phthalacene”，它主要出现在专业化学语境中。"},{"en":"If you meant “phthalocyanine,” the spelling is different and it refers to a well-known dye/pigment family.","zh":"如果你想写的是“phthalocyanine（酞菁）”，拼写不同，而且它指的是一类很常见的染料/颜料。"}]}],"synonyms":["(possible related terms) polycyclic aromatic hydrocarbon","(often confused with) phthalocyanine","(related prefix) phthalic"],"phonetic":"/ˌθæl.əˈsiːn/","extraExplanation":["“phthal-”这一前缀常与“phthalic（邻苯二甲酸的）/phthalate（邻苯二甲酸酯）/phthalocyanine（酞菁）”等有机化学词有关，其中“ph”不发 /f/，而更接近 /θ/（类似 thin 的起始音）。","如果你能提供该词出现的句子、论文标题或化学结构式/图片，我可以更准确地判断它指的具体化合物，或确认你是否想表达“phthalocyanine / phthallocene / phthalacene”等相近拼写的术语。"]}
{"word":"phthalan","summary":{"en":"Phthalan is a chemical compound used mainly as an intermediate in organic synthesis (2,3-dihydroisobenzofuran).","zh":"Phthalan 是一种主要用于有机合成中间体的化合物（2,3-二氢异苯并呋喃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless organic compound (a fused benzene–oxygen ring system), used mainly as a building block in organic chemistry; also called 2,3-dihydroisobenzofuran.","zh":"一种无色有机化合物（苯环与含氧五元环稠合的结构），主要用作有机合成中的中间体；也称为“2,3-二氢异苯并呋喃”。"},"examples":[{"en":"Phthalan is often used as a starting material to make substituted aromatic compounds in synthesis.","zh":"在合成中，phthalan 常被用作起始原料来制备取代芳香族化合物。"},{"en":"The paper reports the oxidation of phthalan to form oxygenated ring products.","zh":"论文报道了 phthalan 的氧化反应，生成含氧环状产物。"}]}],"synonyms":["2,3-dihydroisobenzofuran","dihydroisobenzofuran"],"phonetic":"/ˈθælæn/","extraExplanation":["“phthalan”是化学名词，常见于研究论文与有机合成语境中，日常英语里很少使用。","词根与“phthal-”（与邻苯二甲酸/苯环相关的命名传统）有关；开头的“phth-”在英语中通常读作 /θ/，类似 phthalate。"]}
{"word":"phthalanilic","summary":{"en":"A technical chemistry adjective meaning “related to phthalanilic acid (N-phenylphthalamic acid).”","zh":"一个化学专业形容词，表示“与 phthalanilic acid（N-phenylphthalamic acid，邻苯二甲酰苯胺酸/邻苯二甲酰苯胺）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to *phthalanilic acid* (also called N-phenylphthalamic acid), a compound formed from phthalic anhydride and aniline in organic chemistry.","zh":"与“邻苯二甲酰苯胺酸/邻苯二甲酰苯胺”（phthalanilic acid，又称 N-phenylphthalamic acid）有关的；一种在有机化学中由邻苯二甲酸酐与苯胺反应生成的化合物的。"},"examples":[{"en":"The report describes the preparation of a phthalanilic intermediate from phthalic anhydride and aniline.","zh":"报告描述了由邻苯二甲酸酐与苯胺制备一种 phthalanilic（邻苯二甲酰苯胺酸相关的）中间体。"},{"en":"Phthalanilic derivatives may appear in older literature on dyes and aromatic amide chemistry.","zh":"在关于染料与芳香族酰胺化学的较早文献中，可能会出现 phthalanilic 的衍生物。"}]}],"synonyms":["N-phenylphthalamic (technical)"],"phonetic":"/ˌθælənˈɪlɪk/","extraExplanation":["这是非常偏专业的化学词，日常英语几乎不会用到，多见于旧式有机化学/化学品合成文献或实验记录中。","词根提示：phthal- 常与“邻苯二甲酸（phthalic acid）/邻苯二甲酸酐（phthalic anhydride）”有关；-anilic 与 aniline（苯胺）相关，暗示该类化合物与“苯胺衍生的酰胺/酸”有关。"]}
{"word":"phthalate","summary":{"en":"Phthalate is a chemical (often in plastics) used to make materials softer and more flexible.","zh":"phthalate 指一种常用于塑料中的化学物质，用来让材料更柔软、更有弹性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of chemicals used to make plastics (especially PVC) softer and more flexible; also found in some cosmetics and fragrances.","zh":"一类用于让塑料（尤其是PVC）更柔软、更有弹性的化学物质；也可见于一些化妆品和香精香料中。"},"examples":[{"en":"Some toys are labeled “phthalate-free” for safety reasons.","zh":"一些玩具会标注“无邻苯二甲酸酯”，出于安全考虑。"},{"en":"Phthalates can be present in vinyl flooring and plastic shower curtains.","zh":"邻苯二甲酸酯可能存在于塑胶地板和塑料浴帘中。"},{"en":"She chose a fragrance-free lotion to avoid possible phthalates.","zh":"她选择了无香型乳液，以避免可能含有邻苯二甲酸酯。"}]}],"synonyms":["plasticizer"],"phonetic":"/ˈθæleɪt/","extraExplanation":["“Phthalate”常译为“邻苯二甲酸酯”（复数phthalates）。在健康与环保语境中很常见，尤其出现在产品标签、新闻报道与科研文章里。","它的发音和拼写对学习者比较难：开头的“phth-”在英语里不常见，实际读音更接近“THA-late”（/ˈθæleɪt/）。","相关标签/表达：phthalate-free（不含邻苯二甲酸酯）、plasticizer（增塑剂）、endocrine disruptor（内分泌干扰物，常见于讨论潜在健康影响时）。"]}
{"word":"phthalazin","summary":{"en":"Phthalazin is a nitrogen-containing ring compound used mainly in chemistry and pharmaceutical research (often spelled phthalazine).","zh":"Phthalazin 指一种含氮杂环化合物，主要用于化学与药物研究（常见拼写为 phthalazine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a nitrogen-containing heterocycle) used as a basic structure in some pharmaceuticals and research chemicals; also spelled “phthalazine.”","zh":"一种含氮杂环化合物，常作为某些药物与研究化学品的基础骨架；也常拼作“phthalazine（邻苯并二嗪）”。"},"examples":[{"en":"Phthalazin derivatives are studied for possible medicinal effects.","zh":"人们会研究 phthalazin 的衍生物，以探索其潜在的药用作用。"},{"en":"In the lab, they synthesized a new compound based on the phthalazin ring.","zh":"在实验室里，他们合成了一个以 phthalazin 环为基础的新化合物。"}]}],"synonyms":["phthalazine"],"phonetic":"/ˈθæləˌzin/","extraExplanation":["“phthalazin”更常见的标准拼写是“phthalazine”。在化学语境中，它指一种由苯环与含两个氮原子的环融合而成的杂环骨架。","读写时容易被“phth-”开头的拼写迷惑：很多科学词源来自希腊/拉丁转写，字母组合多但发音会更简化。"]}
{"word":"phthalazine","summary":{"en":"Phthalazine is a nitrogen-containing ring compound used as a core structure in organic and medicinal chemistry.","zh":"Phthalazine 是一种含氮环状化合物，常作为有机与药物化学中的基础骨架（母核）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound used as a basic structure (a “core”) in organic chemistry, especially when making or studying medicines and other bioactive molecules; it is a ring system with two nitrogen atoms.","zh":"一种有机化学化合物，常作为“母核/骨架”用于合成或研究药物及其他活性分子；它是一种含两个氮原子的环状结构。"},"examples":[{"en":"In medicinal chemistry, researchers may build new drug candidates on a phthalazine core.","zh":"在药物化学中，研究人员可能以邻二氮杂萘（phthalazine）母核为基础来构建新的候选药物。"},{"en":"The paper describes a series of phthalazine derivatives and tests their biological activity.","zh":"这篇论文描述了一系列 phthalazine 衍生物，并测试了它们的生物活性。"}]}],"synonyms":["phthalazine ring","phthalazine core","phthalazine scaffold"],"phonetic":"/ˈθæl.ə.ziːn/","extraExplanation":["词源与构词提示：phthalazine 属于“含氮杂环”（heterocycle）家族。名称里常见的 -azine 表示含氮的环系（在化学命名中很常见）。","读音提示：开头的 ph- 在英文中通常发 /f/ 音（类似 phone, photo）。","学习场景：它主要出现在学术论文、药物化学/有机合成教材或专利中，日常生活里几乎不会用到。"]}
{"word":"phthalein","summary":{"en":"A chemical dye family (phthaleins), including indicators like phenolphthalein.","zh":"一类化学染料/指示剂化合物（酞类），如酚酞等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of chemical compounds (dyes) made by reacting phthalic anhydride with phenols; some are used as color indicators (especially in acid–base tests).","zh":"（化学）酞类化合物/酞酚类染料：由邻苯二甲酸酐与酚类反应制得的一类化合物；其中一些可作颜色指示剂（尤其用于酸碱指示）。"},"examples":[{"en":"Phenolphthalein is a phthalein commonly used as an acid–base indicator.","zh":"酚酞是一种常见的酞类化合物，常用作酸碱指示剂。"},{"en":"In the lab, we studied how different phthaleins change color at different pH levels.","zh":"在实验室里，我们学习了不同酞类指示剂在不同 pH 值下的变色规律。"}]}],"synonyms":["phthalein dye","phenolphthalein (a specific phthalein)"],"phonetic":"/ˈθeɪliːn/","extraExplanation":["“phthalein”多见于化学/实验语境，日常英语中很少单独使用；更常见的是具体名称，如“phenolphthalein（酚酞）”。","词源上与“phthal-（邻苯二甲酸/酞）”有关；发音与拼写看起来复杂，是因为保留了化学命名传统（字母组合 phth-）。"]}
{"word":"phthaleine","summary":{"en":"A synthetic dye compound used especially in making pH indicators (e.g., phenolphthalein).","zh":"一种合成染料化合物，尤用于制备 pH（酸碱）指示剂（如酚酞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of synthetic dye (a chemical compound) made from phthalic anhydride, often used to create acid–base indicators such as phenolphthalein.","zh":"一类由邻苯二甲酸酐等原料合成的染料（化合物），“酞因/酞烯”类物质；常用于制备酸碱指示剂（如酚酞）。"},"examples":[{"en":"Phenolphthalein is a phthaleine commonly used as an acid–base indicator in labs.","zh":"酚酞是一种常见的酞因（phthaleine），在实验室里常用作酸碱指示剂。"},{"en":"Some phthaleine dyes change color when the pH changes.","zh":"一些酞因类染料会随着 pH 的变化而变色。"}]}],"synonyms":["phthalein","phthalein dye","indicator dye"],"phonetic":"/ˈθeɪliːn/","extraExplanation":["“phthaleine”也常见拼作“phthalein”。它主要出现在化学/实验室语境中，日常英语里很少单独使用，更常见的是含它的具体化合物名，如 phenolphthalein（酚酞）。","词源上与 phthal-（来自“phthalic”，与“邻苯二甲酸”相关）有关；开头的“phth-”在英语中通常读作 /θ/（如 phthalate /ˈθæleɪt/）。"]}
{"word":"phthaleinometer","summary":{"en":"A rare, older term for an instrument that measures phthalein dye intensity/concentration in solutions (often in dye-based medical tests).","zh":"一个较少见、偏旧的术语，指用于测量溶液中酞类染料颜色强度/浓度的仪器（常见于早期染料法医学检测）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a laboratory instrument used to measure the amount or color intensity of a phthalein dye (especially phenolsulfonphthalein) in a solution, often for medical or chemical testing.","zh":"一种实验室仪器，用来测量溶液中“酞类染料”（phthalein，尤指酚磺酞）含量或颜色强度，常用于医学或化学检测。"},"examples":[{"en":"The lab used a phthaleinometer to estimate the concentration of phenolsulfonphthalein in the sample.","zh":"实验室用酞类染料测定仪来估算样品中酚磺酞的浓度。"},{"en":"Before modern spectrophotometers, a phthaleinometer helped clinicians read color changes in dye-based tests.","zh":"在现代分光光度计出现之前，临床医生常用酞类染料测定仪读取基于染料的检测所产生的颜色变化。"}]}],"synonyms":["phthalein meter","(PSP) colorimeter","colorimeter","spectrophotometer (modern equivalent)"],"phonetic":"/ˌθæliːˈnɑːmɪtər/","extraExplanation":["“phthaleinometer”是非常少见、偏历史的技术词。phthalein（酞类染料）曾用于一些比色法检测，尤其与肾功能评估相关的PSP（phenolsulfonphthalein，酚磺酞）排泄试验。后来更常用更精确的仪器（如spectrophotometer 分光光度计），因此这个词在现代英语里多见于旧文献或历史背景的医学/化学资料。","词形拆解：phthalein（酞类染料）+ -meter（测量仪）。拼写开头的“phth-”源自希腊语词根，在英语里常出现不发音或难发的字母组合。"]}
{"word":"phthalic","summary":{"en":"“Phthalic” is an adjective used in chemistry meaning “related to phthalic acid or its derivatives.”","zh":"“phthalic”是化学中常用的形容词，表示“与邻苯二甲酸及其衍生物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to phthalic acid or to chemicals derived from it (used especially in industrial and organic chemistry).","zh":"（尤用于工业与有机化学）与“邻苯二甲酸（phthalic acid）”有关的；由其衍生的。"},"examples":[{"en":"Phthalic acid is used to make certain resins and plasticizers.","zh":"邻苯二甲酸可用于制造某些树脂和增塑剂。"},{"en":"The lab report mentioned phthalic anhydride as a key starting material.","zh":"实验报告提到“邻苯二甲酸酐”是关键的起始原料。"}]}],"synonyms":["related to phthalic acid","phthalate-related"],"phonetic":"/ˈθælɪk/","extraExplanation":["“phthalic”常见于化学名词搭配：phthalic acid（邻苯二甲酸）、phthalic anhydride（邻苯二甲酸酐）、phthalic ester / phthalate（邻苯二甲酸酯/邻苯二甲酸盐，常与塑化剂相关）。","拼写开头的“phth-”不发 /p/ 音，学习时可把它当作以 /θ/ 开头来记（类似 thesis 的 /θ/）。","在日常新闻中常见的是 phthalate（邻苯二甲酸酯）而不是 phthalic；两者有关联：phthalates 通常是由 phthalic acid 衍生出来的一类化合物。"]}
{"word":"phthalid","summary":{"en":"Phthalid is a chemistry term (often spelled phthalide) meaning a lactone compound related to phthalic acid, used in organic synthesis.","zh":"Phthalid 是化学术语（常拼作 phthalide），指与邻苯二甲酸相关的内酯化合物，常用于有机合成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a lactone) related to phthalic acid; often written as **phthalide** and used as a building block in making dyes, medicines, and other organic chemicals.","zh":"一种与邻苯二甲酸相关的化学化合物（内酯类）；常写作 **phthalide（邻苯内酯）**，常用于合成染料、药物及其他有机化学品的中间体。"},"examples":[{"en":"Phthalid (phthalide) is used as an intermediate in some dye and fragrance syntheses.","zh":"Phthalid（phthalide）可作为某些染料与香料合成中的中间体。"},{"en":"In the lab report, the product was identified as phthalid by its melting point and spectra.","zh":"在实验报告中，通过熔点与光谱数据确定产物为 phthalid。"}]}],"synonyms":["phthalide"],"phonetic":"/ˈθæl.aɪd/","extraExplanation":["“phthalid”在现代英语里更常见的拼写是 **phthalide**。两者在很多语境下指同一种结构的化合物（邻苯内酯）。","读写时常见难点是 **phth-** 这个词首字母组合；在英语里 p 通常不发音，发音以 /θ/（类似 th）起头。","这是化学/材料领域术语，日常英语中很少出现；更多会出现在科研论文、化学品目录与实验记录中。"]}
{"word":"phthalide","summary":{"en":"A chemistry term for an aromatic lactone related to phthalic acid, used in synthesis and found in some natural products.","zh":"化学术语：与邻苯二甲酸相关的芳香族内酯，用于合成，也见于部分天然产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A type of aromatic lactone (a cyclic ester) related to phthalic acid; specifically, the compound also known as isobenzofuran-1(3H)-one, used as a building block in organic synthesis and found in some natural products and fragrances.","zh":"（化学）一种与邻苯二甲酸相关的芳香族内酯（环状酯）；特指也称为“异苯并呋喃-1(3H)-酮”的化合物，常用作有机合成的基础原料，也可见于某些天然产物与香料成分中。"},"examples":[{"en":"Phthalide is a useful intermediate for making more complex aromatic compounds.","zh":"邻苯内酯是合成更复杂芳香族化合物的常用中间体。"},{"en":"Some celery-related natural compounds have a phthalide structure.","zh":"一些与芹菜相关的天然成分具有邻苯内酯结构。"}]}],"synonyms":["isobenzofuran-1(3H)-one","phthalide (compound class)"],"phonetic":"/ˈθælaɪd/","extraExplanation":["“phth-”在英语里常读作/θ/（像thin的开头），所以phthalide读作/ˈθælaɪd/，开头的p不发音。","该词主要用于化学语境；日常英语中很少出现。若你在论文或说明书里看到它，通常是在讲“结构骨架”“内酯环”或“合成中间体”。"]}
{"word":"phthalimide","summary":{"en":"Phthalimide is an organic compound used mainly as an intermediate in chemical synthesis, especially for making primary amines (Gabriel synthesis).","zh":"邻苯二甲酰亚胺是一种有机化合物，主要作为合成中的中间体使用，尤其常用于制备伯胺（Gabriel 合成）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a white crystalline organic compound (an imide of phthalic acid) used mainly as a chemical intermediate, especially to help make amines in organic synthesis (e.g., the Gabriel synthesis).","zh":"邻苯二甲酰亚胺：一种白色结晶状有机化合物（邻苯二甲酸的“亚胺/酰亚胺”衍生物），主要用作化学中间体，尤其在有机合成中用于制备胺类（如 Gabriel 合成）。"},"examples":[{"en":"Phthalimide is commonly used in the Gabriel synthesis to prepare primary amines.","zh":"邻苯二甲酰亚胺常用于 Gabriel 合成来制备伯胺。"},{"en":"In the lab, we converted phthalimide into potassium phthalimide before the next reaction step.","zh":"在实验室里，我们先把邻苯二甲酰亚胺转化为邻苯二甲酰亚胺钾盐，再进行下一步反应。"}]}],"synonyms":["phthalic imide"],"phonetic":"/ˈθælɪˌmaɪd/","extraExplanation":["这个词主要出现在有机化学语境中。它之所以重要，是因为其氮原子在形成盐（如 potassium phthalimide）后可作为“氮源/亲核体”，经过烷基化与后续水解（或其他脱保护步骤）来得到伯胺，这就是经典的 Gabriel 合成思路。","拼写里常见的组合“phth-”源自“phthal-（邻苯二甲酸相关）”，开头的“phth”在英语里不太好发音，学习时可把它整体记成一个化学词根。"]}
{"word":"phthalin","summary":{"en":"Phthalin is a chemistry term for a (usually colorless) reduced form related to phthalein dyes.","zh":"Phthalin 是化学术语，指与酞灵类染料相关、通常无色的还原态形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound related to phthalein dyes; especially the reduced, colorless form of a phthalein (used in dye and indicator chemistry).","zh":"一种与“酞灵（phthalein）”染料相关的化学化合物；尤指酞灵的还原态、无色形式（常见于染料与指示剂化学中）。"},"examples":[{"en":"In the lab, the dye can shift between a colored form and a colorless phthalin form depending on oxidation conditions.","zh":"在实验室里，这种染料会根据氧化条件在有色形态与无色的 phthalin（酞灵还原态）形态之间转变。"},{"en":"Some historical dye processes mention phthalin as an intermediate compound.","zh":"一些早期的染料工艺会提到 phthalin 作为一种中间体。"}]}],"synonyms":["(none common in general English)"],"phonetic":"/ˈθælɪn/","extraExplanation":["这是一个较少见、偏化学领域的词，常出现在讨论“phthalein（酞灵）类染料/酸碱指示剂”的资料里；phthalin 通常指这些化合物的“还原后、颜色消失”的形态。","拼写上以 phth- 开头（类似 phthalic / phthalein），在英语里这种组合不常见；发音时一般不读出 p，重点在 th 音。"]}
{"word":"phthalins","summary":{"en":"“Phthalins” is a rare chemistry term meaning plural chemical compounds related to phthalic acid, used in dye/indicator chemistry.","zh":"“Phthalins”是较少见的化学用语，指与邻苯二甲酸相关的一类化合物（复数），常用于染料/指示剂等化学领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Chemical compounds related to phthalic acid, used mainly as intermediates in making dyes, indicators, or resins (rare outside chemistry).","zh":"（复数）与邻苯二甲酸相关的一类化学化合物，主要用作制造染料、指示剂或树脂的中间体（多见于化学语境，日常很少用）。"},"examples":[{"en":"In the lab notes, the student compared several phthalins made from different phenols.","zh":"在实验记录里，学生比较了由不同酚制得的几种 phthalins（邻苯二甲酸相关衍生物）。"},{"en":"Some older dye recipes mention phthalins as starting materials for color compounds.","zh":"一些较早的染料配方会把 phthalins 作为合成颜色化合物的起始原料。"}]}],"synonyms":["phthaleins (related term)","phthalic-acid derivatives"],"phonetic":"/ˈθælɪnz/","extraExplanation":["“phthalins”不是常见日常词，通常出现在有机化学/染料化学文献中；更常见、你更可能见到的相关词是 **phthalein / phthaleins**（例如 *phenolphthalein* 酚酞，用作酸碱指示剂）。","拼写里的 **phth-** 属于英语中少见的组合，常见于源自希腊/科学术语的词（如 *phthalic*）。在英语读音里 **ph** 在这里不读 /f/，而更接近以 /θ/ 起音。"]}
{"word":"phthalocyanine","summary":{"en":"Phthalocyanine is a blue-green pigment molecule widely used in paints, inks, and plastics.","zh":"Phthalocyanine（酞菁）是一类蓝绿色颜料分子，常用于涂料、油墨和塑料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, stable blue-green chemical pigment molecule (often containing a metal like copper) widely used in paints, inks, plastics, and dyes","zh":"一种大型且稳定的蓝绿色颜料分子（常含铜等金属），广泛用于涂料、油墨、塑料与染料"},"examples":[{"en":"Phthalocyanine blue is a common pigment in printing inks and acrylic paints.","zh":"酞菁蓝是印刷油墨和丙烯颜料中常见的一种色料。"},{"en":"Many plastics use phthalocyanine pigments because they resist heat and sunlight.","zh":"许多塑料会使用酞菁类颜料，因为它们耐热、耐日晒。"}]}],"synonyms":["phthalo pigment","phthalocyanine pigment","phthalocyanine blue (as a common type)"],"phonetic":"/ˌθæloʊˈsaɪəˌniːn/","extraExplanation":["读音提示：开头的“phth-”在英语里很少见，实际发音常简化为类似“THAL-”的起始感觉；学习时可以先抓住重音在“THAL”。","词源/构词：phthalo- 来自“邻苯二甲酸（phthalic acid）”相关的化学命名传统；-cyanine 与“蓝色（cyan）”同源，常用于表示与蓝/青色相关的染料或色素命名。","文化与使用场景：在美术与设计领域你更常看到的是具体颜料名，如“Phthalo Blue（酞菁蓝）”“Phthalo Green（酞菁绿）”。它们以颜色饱和度高、着色力强、耐光性好而出名。"]}
{"word":"phthalyl","summary":{"en":"Phthalyl is a chemistry term meaning “related to phthalic acid” or “the phthalyl group used as a substituent.”","zh":"Phthalyl 是化学用语，表示“与邻苯二甲酸有关”，或指“邻苯二甲酰基（可作为取代基的基团）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) relating to, or derived from, phthalic acid (especially the acyl group used in organic chemistry).","zh":"（化学）与邻苯二甲酸有关的；由邻苯二甲酸衍生的（尤指有机化学中使用的“酰基/取代基”）。"},"examples":[{"en":"The reagent introduces a phthalyl group into the molecule.","zh":"这种试剂会把一个 phthalyl（邻苯二甲酰基）引入到分子中。"},{"en":"Phthalyl derivatives are common intermediates in synthesis.","zh":"phthalyl 衍生物在合成中是常见的中间体。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) the phthalyl group; a phthalic-acid–derived acyl group used as a substituent in molecules.","zh":"（化学）phthalyl 基团；由邻苯二甲酸衍生、可作为取代基的酰基/基团。"},"examples":[{"en":"The structure contains a phthalyl attached to the nitrogen.","zh":"该结构中有一个 phthalyl 基团连接在氮原子上。"}]}],"synonyms":["phthalic","phthalate (related family term)"],"phonetic":"/ˈθælɪl/","extraExplanation":["“phthal-”来自“phthalic（邻苯二甲酸的）”。在很多化学名词里，字母组合“phth”开头的发音中，/p/ 往往不发音或弱化，所以常听起来更像以“thal-”开头。","在有机合成语境中，phthalyl 常指与邻苯二甲酸相关的“二羰基”骨架（与 phthalic anhydride、phthalimide 等结构家族有关），常用于描述某个官能团或保护基片段。"]}
{"word":"phthalylsulfathiazole","summary":{"en":"Phthalylsulfathiazole is an older sulfonamide antibiotic used mainly for intestinal infections.","zh":"Phthalylsulfathiazole 是一种较旧的磺胺类抗生素，主要用于肠道感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sulfonamide (sulfa) antibiotic formerly used to treat intestinal infections, especially because it stays mostly in the gut rather than being absorbed into the blood.","zh":"一种磺胺类（“磺胺药”）抗生素，过去常用于治疗肠道感染；其特点是主要停留在肠道内、较少被吸收入血。"},"examples":[{"en":"Phthalylsulfathiazole was once prescribed for bacterial diarrhea, but it is rarely used today.","zh":"Phthalylsulfathiazole 过去曾用于治疗细菌性腹泻，但如今已很少使用。"},{"en":"Because it is poorly absorbed, phthalylsulfathiazole mainly acts in the intestines.","zh":"由于吸收率低，phthalylsulfathiazole 主要在肠道内发挥作用。"}]}],"synonyms":["sulfathalidine"],"phonetic":"/ˌθæl.aɪlˌsʌl.fəˈθaɪ.əˌzoʊl/","extraExplanation":["该词属于药学/医学专业用语，日常英语中几乎不会出现；现代临床更常用更新、更安全或更有针对性的抗菌药物。","也可见作商品名/别名 sulfathalidine（常译“磺胺噻唑酞酰”一类的名称），不同国家的使用与监管情况可能不同。"]}
{"word":"phthanite","summary":{"en":"“phthanite” is not a recognized standard English word; it’s likely a misspelling of a similar term.","zh":"“phthanite”不是公认的标准英语词汇；更可能是某个相近词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It does not appear in major English dictionaries; it is likely a misspelling of another term (for example, “phthalate,” a chemical, or a similar-looking scientific/mineral name).","zh":"不是标准英语词汇。在主要英语词典中通常找不到；很可能是其他词的拼写错误（例如化学名词“phthalate / 邻苯二甲酸酯”等，或某个相近的科学/矿物名称）。"},"examples":[{"en":"I couldn’t find “phthanite” in a dictionary—did you mean “phthalate”?","zh":"我在词典里找不到“phthanite”——你是不是想写“phthalate”？"},{"en":"Please check the spelling of “phthanite” in your source or textbook.","zh":"请核对你资料或教材里“phthanite”的拼写。"}]}],"extraExplanation":["这个词形看起来像含有少见字母组合“phth-”（如 phthalate, phthisis 等），但“phthanite”本身不常见，可能是：\n1）把 phthalate（邻苯二甲酸酯）拼错了；\n2）从其他语言/专业领域（矿物、化学、药品名）转写时出现了拼写误差；\n3）专有名词（品牌、用户名、地名）。\n如果你能提供出现它的句子、学科领域（化学/地质/小说等）或截图，我可以更准确地判断你想查的词。"]}
{"word":"phthartolatrae","summary":{"en":"An archaic theological term meaning people who worship perishable created things (idols) instead of God.","zh":"古用神学词，指崇拜可朽坏的受造物（偶像）而非上帝的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(theology, archaic) People who worship corruptible or created things (such as idols) rather than God; “worshipers of what is perishable.”","zh":"（神学／古用）崇拜会朽坏、会消逝之受造物（如偶像）而非上帝的人；意为“崇拜可朽之物的人”。"},"examples":[{"en":"Some early Christian writers accused idolaters of being phthartolatrae—people devoted to perishable images.","zh":"一些早期基督教作者指责拜偶像者是 phthartolatrae——把心献给会朽坏的形像之人。"},{"en":"In that sermon, he warns against becoming phthartolatrae by treating money as an ultimate good.","zh":"在那篇讲道中，他警告人不要把金钱当作终极价值，从而沦为 phthartolatrae。"}]}],"synonyms":["idolaters","image-worshipers","pagan worshipers"],"phonetic":"ˌθɑrtoʊˈleɪtri","extraExplanation":["这是一个非常罕见、带学术/宗教色彩的词，常见于早期基督教论战或神学写作中。词形来自希腊语构词：phthartos（可朽坏、会消逝的）+ latreia/latreuein（敬拜、事奉）。","拼写中的“phth-”在英语里常读作 /θ/（p 不发音），类似 phthalate、phthalo- 等少见词根。","在现代英语里更常用的对应表达是 idolaters（拜偶像者）、image-worshipers（崇拜偶像/图像者），或更宽泛的 worship of created things（崇拜受造物）。"]}
{"word":"phthinoid","summary":{"en":"“Phthinoid” is a rare, old-fashioned adjective meaning “tuberculosis-like” or “consumptive-looking.”","zh":"phthinoid 是罕见的旧式形容词，意为“类似肺结核的；呈痨相的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or related to phthisis (tuberculosis), especially in appearance or symptoms; consumptive-looking.","zh":"（外观或症状）类似肺结核（痨病）的；与结核病相关的；呈“痨相”的。"},"examples":[{"en":"The old medical text described a “phthinoid” cough that persisted for months.","zh":"那本旧医学文献描述了一种持续数月的“类结核（phthinoid）”咳嗽。"},{"en":"He appeared thin and pale, with a phthinoid look that worried the doctor.","zh":"他看起来消瘦、苍白，带有一种“痨相”，让医生很担心。"}]}],"synonyms":["tuberculous","consumptive-looking","tuberculosis-like"],"phonetic":"/ˈθaɪnɔɪd/","extraExplanation":["“phthinoid”是非常少见的旧式医学用词，来自“phthisis”（旧称：肺结核/痨病）+ “-oid”（表示“像……一样、类似……”）。现代医学英语更常用“tuberculous / tuberculosis-related”来表达相近意思。","开头的“phth-”源自希腊语词根，英语中常读作/θ/（类似think里的th），而不是/p/或/f/。"]}
{"word":"phthiocol","summary":{"en":"Phthiocol is a naphthoquinone compound associated with the tuberculosis bacterium and is mainly mentioned in scientific research.","zh":"Phthiocol 是一种与结核病致病菌相关的萘醌类化合物，主要出现在科学研究语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-orange chemical compound (a type of naphthoquinone) found in the bacterium that causes tuberculosis, used mainly in scientific/medical research contexts.","zh":"一种黄橙色的化学化合物（属于萘醌类），存在于结核病致病菌中，主要用于科研/医学研究语境。"},"examples":[{"en":"Researchers detected phthiocol in cultures of Mycobacterium tuberculosis.","zh":"研究人员在结核分枝杆菌的培养物中检测到了 phthiocol。"},{"en":"Phthiocol is studied because it may help scientists understand how the TB bacterium survives in the body.","zh":"研究 phthiocol 是因为它可能帮助科学家理解结核杆菌如何在人体内存活。"}]}],"synonyms":["2-methyl-3-hydroxy-1,4-naphthoquinone"],"phonetic":"/ˈθaɪ.oʊ.kɑl/","extraExplanation":["词源提示：phthiocol 可拆解为 phthio-（与 phthisis“肺痨/结核”有关的构词成分）+ -ol（常见于化学命名，表示含羟基的化合物）。","在文献中它也常以化学名出现，如“2-methyl-3-hydroxy-1,4-naphthoquinone（2-甲基-3-羟基-1,4-萘醌）”。","使用场景偏专业：这个词多见于生物化学、微生物学、药学论文或教材中，日常英语几乎不会用到。"]}
{"word":"phthiriasis","summary":{"en":"Phthiriasis means an infestation with lice, especially pubic or body lice.","zh":"phthiriasis 指人体被虱子寄生感染的情况，尤指阴虱或体虱感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an infestation of the body with lice (parasitic insects), especially pubic lice or body lice","zh":"虱病；（人体）被虱子寄生、感染的情况，尤指阴虱或体虱感染"},"examples":[{"en":"The doctor diagnosed phthiriasis and prescribed a medicated lotion.","zh":"医生诊断为虱病，并开了药用洗剂。"},{"en":"Phthiriasis pubis is usually caused by pubic lice and can spread through close contact.","zh":"阴虱病通常由阴虱引起，可通过密切接触传播。"},{"en":"Good hygiene and washing clothes in hot water can help prevent some forms of phthiriasis.","zh":"保持良好卫生、用热水清洗衣物有助于预防某些类型的虱病。"}]}],"synonyms":["pediculosis","lice infestation"],"phonetic":"/θaɪˈraɪə.sɪs/","extraExplanation":["该词较少用于日常英语，更常见于医学语境；临床上也会具体说 phthiriasis pubis（阴虱病）或 pediculosis（虱病/虱子感染，较常用的术语）。","词源来自希腊语 phtheir（虱子）。拼写中 “phth-” 的组合在英语里很少见，读音通常以 /θ/（类似 thin 的开头音）起始。","因为常见类型与亲密接触有关，有时会被当作“性传播”相关问题而带有羞耻感；但虱子也可能通过衣物、床品等间接传播，关键是及时治疗与清洁环境。"]}
{"word":"phthirius","summary":{"en":"Phthirius is the scientific genus name for lice that includes the human pubic louse (Phthirius pubis).","zh":"Phthirius 是虱子的一个科学属名，其中包含会寄生于人类的阴虱（Phthirius pubis）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic lice, best known for the species that causes pubic lice in humans (Phthirius pubis).","zh":"一种寄生虱的属名，其中最常见、与人类相关的是阴虱（Phthirius pubis），可寄生在人类体毛处。"},"examples":[{"en":"Phthirius pubis is the species responsible for pubic lice infestations in humans.","zh":"Phthirius pubis（阴虱）是导致人类阴虱感染的主要物种。"},{"en":"The clinician identified the louse as belonging to the genus Phthirius.","zh":"临床医生鉴定该虱子属于 Phthirius（阴虱属）。"}]}],"synonyms":["pubic louse","pubic lice","Phthirius pubis"],"phonetic":"/θaɪˈθɪriəs/","extraExplanation":["“Phthirius”是拉丁化的科学命名，源自希腊语词根，意为“虱子”。在日常英语里，人们更常说“pubic lice”（阴虱）或“crabs”（俗称，较口语、带俚语色彩），而“Phthirius”多见于医学或生物学写作。","与这个属相关的内容常涉及私密健康话题；在医学语境下属于中性、客观的术语。"]}
{"word":"phthirophagous","summary":{"en":"Phthirophagous means “louse-eating,” used mainly in zoology.","zh":"phthirophagous 指“以虱子为食的”，主要用于动物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) feeding on lice.","zh":"（动物）以虱子为食的。"},"examples":[{"en":"Oxpeckers are sometimes described as phthirophagous because they pick lice off large mammals.","zh":"牛椋鸟有时被称为 phthirophagous，因为它们会从大型哺乳动物身上啄食虱子。"},{"en":"The paper noted a phthirophagous diet in several bird species that groom other animals.","zh":"论文指出，一些会为其他动物清理体表的鸟类具有以虱子为食（phthirophagous）的饮食习性。"}]}],"synonyms":["louse-eating","lice-eating"],"phonetic":"/ˌθaɪrəˈfæɡəs/","extraExplanation":["这是一个非常少见的生物学/动物学用词，多见于学术写作。构词来自希腊语：phthir-（“虱子”）+ -phagous（“吃……的”）。","在更常见、易懂的表达里，英语通常会说 louse-eating（吃虱子的）或 lice-eating。"]}
{"word":"phthises","summary":{"en":"“Phthises” is the plural of “phthisis,” an old term for tuberculosis or a wasting disease.","zh":"“Phthises”是“phthisis”的复数，是表示结核病（旧称）或消耗性疾病的旧用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of phthisis: tuberculosis (an old medical term), especially pulmonary tuberculosis; also used more broadly for a wasting, consumptive disease.","zh":"phthisis 的复数：结核病（较旧的医学用语），尤指肺结核；也可泛指使人逐渐消瘦衰弱的“痨病/消耗性疾病”。"},"examples":[{"en":"In 19th‑century medical writing, phthises often referred to different forms of tuberculosis.","zh":"在19世纪的医学著作中，phthises 常用来指不同类型的结核病。"},{"en":"The novel mentions deaths from “phthisis,” reflecting how common such illnesses were at the time.","zh":"小说提到有人死于“phthisis”，反映了当时这类疾病的普遍。"}]}],"synonyms":["tuberculosis","TB","consumption (old-fashioned)"],"phonetic":"/ˈθaɪsiːz/","extraExplanation":["“phthisis/ phthises”属于较古旧、带历史感的医学词汇，现代英语更常用 “tuberculosis (TB)” 或 “consumption（旧称）”。","词源来自希腊语，原意与“消耗、衰弱”有关，因此在旧文献里也可能泛指让人逐渐消瘦的慢性病。","发音提示：开头的“phth-”在英语里不读 /fθ/，通常直接读成 /θ/，所以读起来像“THY-sis / THY-seez”。"]}
{"word":"phthisic","summary":{"en":"Phthisic is an archaic word for tuberculosis (“consumption”) or something relating to it.","zh":"Phthisic 是“肺结核/痨病（旧称 consumption）”的古用词，也可作形容词表示“与结核有关/患痨病的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) tuberculosis; a wasting disease, especially of the lungs (historically called “consumption”).","zh":"（古用）肺结核；一种使人逐渐消瘦的疾病，尤指肺部（旧称“痨病/肺痨”，英语里常叫“consumption”）。"},"examples":[{"en":"In older medical writing, phthisic often referred to pulmonary tuberculosis.","zh":"在较早的医学文献中，phthisic 常指肺结核（尤其是肺部结核）。"},{"en":"Many 19th‑century novels describe a character dying of “consumption” (phthisic).","zh":"许多19世纪小说会写到人物死于“consumption”（即 phthisic）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) relating to or affected by tuberculosis; consumptive.","zh":"（古用）与结核病有关的；患肺结核的；痨病的。"},"examples":[{"en":"The doctor noted phthisic symptoms such as persistent cough and weight loss.","zh":"医生记录了痨病样症状，如长期咳嗽和体重下降。"},{"en":"She played the role of a phthisic poet in a period drama.","zh":"她在年代剧中饰演一位患痨病的诗人。"}]}],"synonyms":["tuberculosis","TB","consumption (old-fashioned)","phthisis (medical/old)","consumptive"],"phonetic":"/ˈθɪzɪk/","extraExplanation":["这个词现在非常少见，多出现在旧式医学文本或文学作品里；现代英语更常用 tuberculosis（结核病）或 TB。","词源来自希腊语 *phthisis*，意为“消耗、衰弱”，因此在文学中常和“逐渐消瘦、苍白、长期咳嗽”的形象联系在一起。","发音上以不常见的字母组合 *phth-* 开头，常见读音为 /ˈθɪzɪk/（开头的 *p* 不发音）。"]}
{"word":"phthisical","summary":{"en":"“Phthisical” is an old-fashioned adjective meaning “related to or suffering from tuberculosis (phthisis/consumption).”","zh":"“phthisical”是较古老的形容词，表示“与结核病（phthisis/consumption）有关的；患结核病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/medical) Relating to tuberculosis (formerly called “phthisis” or “consumption”), or having the wasting symptoms of it.","zh":"（古义/医学）与结核病有关的；患有结核病（旧称“痨病/肺痨”，英文常称 phthisis 或 consumption）的；呈现其消瘦衰弱症状的。"},"examples":[{"en":"In old medical texts, a “phthisical patient” usually meant someone with tuberculosis.","zh":"在旧医学文献中，phthisical patient 通常指结核病患者。"},{"en":"The novel describes a pale, phthisical young man who coughs through the winter.","zh":"小说描写了一位苍白、患痨病的年轻人，整个冬天都在咳嗽。"}]}],"synonyms":["tubercular","consumptive","tuberculous"],"phonetic":"/ˈθɪzɪkəl/","extraExplanation":["“phthisical”来自希腊语词根，意为“逐渐消耗、衰败”。在19世纪英语文学与医学写作中常见，因为当时结核病很普遍，常被称为“consumption（消耗病）”。现代英语更常用 tuberculosis / TB 或 tubercular。","发音要点：词首的 phth- 中，p 不发音；重音通常在第一个音节：THIZ-i-kəl。"]}
{"word":"phthisicky","summary":{"en":"“Phthisicky” is an old-fashioned adjective meaning “tubercular/consumptive-looking,” or more generally “sickly and wasting away.”","zh":"“phthisicky”是较古老的形容词，指“带有肺痨/结核病病容的（消瘦、苍白、虚弱）”，也可泛指“病恹恹、日渐消瘦的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Looking ill with tuberculosis (consumption); thin, pale, and weak in a way associated with TB.","zh":"（古义/旧用）呈现结核病（肺痨、痨病）患者那种病容：消瘦、苍白、虚弱。"},"examples":[{"en":"In old novels, a “phthisicky” hero is often described as pale and fragile.","zh":"在一些旧小说里，“phthisicky”的人物常被写得苍白、脆弱。"},{"en":"She worried that his constant cough made him look phthisicky.","zh":"她担心他总是咳嗽，让他看起来像“phthisicky”（像得了肺痨）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Having symptoms like a long-lasting cough and wasting away; sickly and worn down.","zh":"（口语/少见）像长期咳嗽、日渐消瘦那样的病态；病恹恹、耗弱的。"},"examples":[{"en":"After weeks of poor sleep, he felt phthisicky and exhausted.","zh":"连续几周睡不好后，他觉得自己病恹恹的、精疲力竭。"}]}],"synonyms":["consumptive","tubercular","sickly","frail","gaunt"],"phonetic":"/ˈθɪzɪki/","extraExplanation":["“phthisicky”来自“phthisic / phthisis”，与结核病（过去常叫 consumption）有关。现在医学与日常英语里更常用“tuberculosis (TB)”或“consumptive”。","这个词非常旧，现代写作里使用可能显得刻意“维多利亚风”或文学化。若你只是想表达“体弱多病/咳嗽很久”，更自然的说法有“sickly”“frail”“gaunt”“chronic cough”。","发音提示：拼写里有“phth-”，但发音以“th-”开头（像“THIZ-”）。"]}
{"word":"phthisics","summary":{"en":"“Phthisics” is an old term for tuberculosis (consumption).","zh":"“phthisics”是结核病（痨病/肺痨）的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) Tuberculosis (TB), especially pulmonary TB; historically called “consumption.”","zh":"（旧式用法）肺结核等结核病；历史上常称为“痨病/肺痨”（consumption）。"},"examples":[{"en":"In 19th-century novels, characters often grew weak and pale from phthisics.","zh":"在19世纪的小说里，人物常因“phthisics（肺痨）”而日渐消瘦、面色苍白。"},{"en":"The doctor suspected phthisics and advised rest in a dry climate.","zh":"医生怀疑是肺痨，建议到干燥气候地区休养。"}]}],"synonyms":["tuberculosis","TB","consumption","phthisis"],"phonetic":"/ˈθaɪsɪks/","extraExplanation":["“phthisics”多见于较早期的医学或文学语境，是对“phthisis（结核病/肺痨）”的旧称（也可见到形容词/名词形式 phthisic）。现代英语医学与日常语境更常用 tuberculosis 或 TB。","词源来自希腊语，意为“消耗、衰耗”，对应当时人们对结核病长期消瘦、咳嗽等表现的观察；因此文学中常用来营造“慢性消耗、悲剧性体弱”的形象。"]}
{"word":"phthisiogenesis","summary":{"en":"Phthisiogenesis means the origin or development of tuberculosis (phthisis).","zh":"Phthisiogenesis 指结核病（肺痨）的发生或发展过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the origin or development of phthisis (tuberculosis); the process by which tuberculosis arises or progresses","zh":"肺痨（结核病）的发生或发展过程；结核病形成/进展的机制"},"examples":[{"en":"The paper discussed phthisiogenesis in crowded urban housing.","zh":"这篇论文讨论了拥挤的城市住房环境中结核病的发生机制。"},{"en":"Modern research explains phthisiogenesis through infection, immune response, and social factors.","zh":"现代研究从感染、免疫反应与社会因素解释结核病的发生发展过程。"}]}],"synonyms":["tuberculosis pathogenesis","TB pathogenesis","pathogenesis of tuberculosis"],"phonetic":"/ˌθɪsioʊˈdʒɛnəsɪs/","extraExplanation":["该词非常罕见，多见于较早期或偏学术的医学写作中。词根来自希腊语：phthisis（“消耗症/肺痨”，历史上常指结核病）+ -genesis（“起源、生成”）。","在现代医学英语里，更常用的表达是 pathogenesis of tuberculosis（结核病的发病机制）或 TB pathogenesis。"]}
{"word":"phthisiogenetic","summary":{"en":"A rare medical adjective meaning “causing or producing tuberculosis (phthisis).”","zh":"一个罕见的医学形容词，意为“引起或产生结核（phthisis/肺痨）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical, rare) Causing or producing phthisis (tuberculosis); related to the origin or development of tuberculosis.","zh":"（医学，罕用）引起或产生肺痨/结核（phthisis，常指肺结核）；与结核的发生或形成有关的。"},"examples":[{"en":"Some early medical writers described dusty, poorly ventilated workplaces as phthisiogenetic.","zh":"一些早期医学作者把多尘、通风不良的工作环境称为“可致肺痨/结核的（phthisiogenetic）”。"},{"en":"The term is now largely replaced by clearer phrases like “tuberculosis-causing factors.”","zh":"这个词现在多被更清晰的说法取代，例如“导致结核的因素”。"}]}],"synonyms":["tuberculosis-causing","TB-causing","tuberculogenic","consumptive (historical/less precise)"],"phonetic":"/ˌθaɪsi.oʊ.dʒəˈnɛtɪk/","extraExplanation":["这个词非常少见，主要见于较早的医学文献或学术写作中。词根来自希腊语：phthisis（肺痨/消耗病，现代多指结核）+ -genic / -genetic（“产生……的”）。","在现代英语里，phthisis 这个老词通常被 tuberculosis（结核）取代，因此 phthisiogenetic 也多用更直接的表达，如 tuberculosis-causing、TB-related risk factors。"]}
{"word":"phthisiogenic","summary":{"en":"Phthisiogenic means “causing tuberculosis (TB)” and is a rare, mostly medical adjective.","zh":"phthisiogenic 意为“致肺结核的/引起结核病的”，是一个较少见、偏医学语境的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing tuberculosis (TB) or producing a tuberculosis-like disease; tubercle-forming","zh":"致肺结核的；引起结核病（TB）的；产生结核样病变的"},"examples":[{"en":"Before modern medicine, crowded living conditions were often described as phthisiogenic.","zh":"在现代医学之前，拥挤的居住环境常被形容为“致肺结核的（phthisiogenic）”。"},{"en":"The researcher studied phthisiogenic factors in poorly ventilated workplaces.","zh":"研究者调查了通风不良工作场所中的致肺结核因素。"}]}],"synonyms":["tuberculosis-causing","TB-causing","pathogenic (broader)","disease-causing (broader)"],"phonetic":"/ˌθɪt.si.oʊˈdʒɛn.ɪk/","extraExplanation":["这个词非常少见，多用于旧式或专业医学语境。它来自希腊语词根：phthisis（古代/旧式英语中指“肺结核”或“消耗性疾病”，中文常译作“痨病/肺痨”）+ -genic（“引起……的/产生……的”）。","现代英语中更常见的说法是 tuberculosis-causing（致结核的）或 TB-causing。注意：TB 的传播主要与空气传播的结核分枝杆菌有关；描述“phthisiogenic conditions”时通常强调容易促成传播的环境（如拥挤、通风差），并不等于这些环境本身“制造细菌”。"]}
{"word":"phthisiologist","summary":{"en":"A phthisiologist is a doctor who specializes in tuberculosis (TB).","zh":"phthisiologist 指结核病（TB）专科医生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a doctor who specializes in diagnosing and treating tuberculosis (TB) and sometimes other lung diseases","zh":"痨病学家；结核病专科医生（主要诊治肺结核，有时也涉及其他肺部疾病）"},"examples":[{"en":"After the persistent cough didn’t improve, she was referred to a phthisiologist.","zh":"持续咳嗽一直不好转后，她被转诊去看结核病专科医生。"},{"en":"The phthisiologist reviewed the chest X-ray and ordered a TB test.","zh":"结核病专科医生查看了胸部X光片，并安排了结核检测。"}]}],"synonyms":["TB specialist","tuberculosis specialist","pulmonologist (broader)"],"phonetic":"/ˌθɪz.iˈɑl.ə.dʒɪst/","extraExplanation":["“phthisiologist”在现代英语中比较少见，更常见的说法是“TB specialist（结核病专科医生）”“pulmonologist（呼吸科/肺科医生）”或“infectious disease specialist（感染科医生）”，具体取决于医院分科。","词根来自希腊语“phthisis”，历史上指“肺痨/消耗病”（常指结核病）。这个词的拼写和发音不直观：开头的“phth-”在现代发音中不读/pʰtʰ/之类的音。"]}
{"word":"phthisiology","summary":{"en":"Phthisiology is the medical specialty dealing with tuberculosis (TB).","zh":"phthisiology 指研究与治疗结核病（尤其肺结核）的医学专科/学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the medical study and treatment of tuberculosis (TB) and similar lung infections","zh":"痨病学；结核病学（研究与治疗肺结核等相关肺部感染的医学分支）"},"examples":[{"en":"She chose phthisiology because tuberculosis is still common in some regions.","zh":"她选择痨病学/结核病学作为方向，因为在一些地区结核病仍然很常见。"},{"en":"The hospital’s phthisiology department focuses on diagnosing and treating TB.","zh":"医院的痨病学/结核病学科主要负责结核病的诊断与治疗。"}]}],"synonyms":["tuberculosis medicine","TB medicine"],"phonetic":"/ˌθɪz.iˈɑː.lə.dʒi/","extraExplanation":["“phthisiology”较为少见、偏学术或旧式用法；现代英语里更常说“tuberculosis medicine / TB medicine”或直接用“pulmonology（肺病学）”中的结核病相关方向。","词源来自希腊语：phthisis（“消耗性疾病”，历史上常指肺结核）+ -logy（“学科/研究”）。因此它与历史上把结核称为“consumption（肺痨/痨病）”有关。"]}
{"word":"phthisiophobia","summary":{"en":"Phthisiophobia is an uncommon term for an extreme fear of tuberculosis (TB).","zh":"Phthisiophobia 是一个较少见的词，指对结核病（TB）的极度恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, persistent fear of tuberculosis (TB) or of being infected with TB","zh":"对结核病（TB）或感染结核病的强烈、持续性恐惧"},"examples":[{"en":"After hearing old stories about “consumption,” he developed phthisiophobia and avoided crowded buses.","zh":"听了关于“肺痨/痨病（consumption）”的旧故事后，他产生了结核恐惧症，开始避开拥挤的公交车。"},{"en":"Her phthisiophobia eased once she learned how TB spreads and how it can be treated.","zh":"了解结核病的传播方式和治疗方法后，她的结核恐惧症减轻了。"}]}],"synonyms":["tuberculophobia","fear of tuberculosis"],"phonetic":"/ˌtɪˌsaɪəˈfoʊbiə/","extraExplanation":["“phthisio-”来自旧医学词 phthisis（常指肺结核，历史上也叫 consumption），在现代日常英语中较少用；因此 phthisiophobia 也是较少见、偏医学/心理学语境的词。","结核病在19世纪到20世纪初曾造成大量死亡，文学与历史记录里常出现对“consumption/肺痨”的恐惧与污名，这种社会背景也让相关恐惧更容易被放大。","更常见、更直观的近义词是 tuberculophobia（对结核病的恐惧）。"]}
{"word":"phthisiotherapeutic","summary":{"en":"A rare adjective meaning “connected with treating tuberculosis (phthisis/consumption).”","zh":"一个很少见的形容词，表示“与结核病（旧称肺痨/痨病）的治疗有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the treatment of tuberculosis (historically called “phthisis” or “consumption”).","zh":"与结核病（旧称“痨病/肺痨”，phthisis/consumption）的治疗有关的。"},"examples":[{"en":"The article discussed phthisiotherapeutic methods used before modern antibiotics.","zh":"这篇文章讨论了在现代抗生素出现之前使用的结核病治疗方法。"},{"en":"Sanatorium care was once considered an important phthisiotherapeutic approach.","zh":"疗养院护理曾被认为是一种重要的结核病治疗方式。"}]}],"synonyms":["tuberculosis-related","anti-tuberculosis","therapeutic (for TB)"],"phonetic":"/ˌθaɪsioʊˌθɛrəˈpjuːtɪk/","extraExplanation":["该词非常罕见，主要出现在较早的医学文献中。它由 phthisis（源自希腊语，意为“消耗、衰败”，旧时指肺结核/痨病）+ therapeutic（治疗的）构成。现代英语更常用 tuberculosis treatment / anti-tuberculosis therapy 等表达。"]}
{"word":"phthisiotherapy","summary":{"en":"Phthisiotherapy is an older term meaning the treatment of tuberculosis (TB).","zh":"Phthisiotherapy 是较旧的术语，指肺结核（TB）的治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the treatment of tuberculosis (TB), especially by medical and physical therapeutic methods (an older, less common term).","zh":"肺结核（TB）的治疗；尤指通过医疗与物理疗法等手段进行的治疗（较旧、较少用的术语）。"},"examples":[{"en":"Before antibiotics, phthisiotherapy often relied on rest, fresh air, and nutrition.","zh":"在抗生素出现之前，phthisiotherapy（肺结核治疗）常常依赖休息、呼吸新鲜空气和营养支持。"},{"en":"The clinic advertised phthisiotherapy for patients with pulmonary tuberculosis.","zh":"这家诊所宣传为肺结核患者提供phthisiotherapy（肺结核治疗）。"}]}],"synonyms":["tuberculosis treatment","TB therapy","anti-tuberculosis therapy"],"phonetic":"/ˌθɪzioʊˈθɛrəpi/","extraExplanation":["这是一个历史色彩很强的医学词，现代英语里更常说 tuberculosis treatment（肺结核治疗）或 TB therapy。","词根来自希腊语 phthisis，意为“消耗、衰弱”，过去用来指肺结核（中文旧称“肺痨/痨病”）。","在20世纪中期抗生素（如链霉素）普及前，结核病治疗常包括“疗养院疗法”（sanatorium regimen）：卧床休息、日光与新鲜空气、营养补充，有时还包括外科手段。"]}
{"word":"phthisipneumonia","summary":{"en":"A dated medical term for tuberculous pneumonia (pneumonia related to tuberculosis).","zh":"一个较旧的医学术语，指结核相关的肺炎（结核性肺炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, dated) Tuberculous pneumonia; a form of pneumonia associated with pulmonary tuberculosis (formerly called “phthisis” or “consumption”).","zh":"（医学，较旧用法）肺结核性肺炎；与肺结核（旧称“痨病/肺痨”，英文旧称 phthisis 或 consumption）相关的一种肺炎。"},"examples":[{"en":"In older medical texts, phthisipneumonia was used to describe pneumonia occurring in patients with tuberculosis.","zh":"在较早的医学文献中，phthisipneumonia 用来描述结核病患者出现的肺炎。"},{"en":"The term phthisipneumonia is rarely used today; doctors usually say “tuberculous pneumonia.”","zh":"如今 phthisipneumonia 很少使用；医生通常说“tuberculous pneumonia（结核性肺炎）”。"}]}],"synonyms":["tuberculous pneumonia","tuberculosis-associated pneumonia"],"phonetic":"/ˌθaɪsɪpnuˈmoʊniə/","extraExplanation":["这个词由 phthisis（旧称“肺痨/肺结核”，源自希腊语，意为“消耗、消瘦”）+ pneumonia（肺炎）构成，因此带有明显的历史色彩。","现代临床与教材中更常见的表达是 tuberculous pneumonia 或 tuberculosis-associated pneumonia；在阅读19世纪到20世纪早期英文医学资料时更可能遇到 phthisipneumonia。"]}
{"word":"phthisipneumony","summary":{"en":"An old medical term for pulmonary tuberculosis, especially with pneumonia.","zh":"旧式医学词：指肺结核，尤指伴随肺炎的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, old-fashioned) Tuberculosis of the lungs, especially when it is accompanied by pneumonia (a lung infection).","zh":"（医学，旧式用语）肺结核；尤指伴随肺炎（肺部感染）的肺结核（结核性肺炎）。"},"examples":[{"en":"In older medical writing, doctors sometimes used the word “phthisipneumony” for severe lung tuberculosis with pneumonia.","zh":"在较早期的医学著作中，医生有时用“phthisipneumony”指伴随肺炎的重症肺结核。"},{"en":"The record described a patient who died of phthisipneumony after months of coughing and weight loss.","zh":"记录描述一名患者在数月咳嗽与消瘦后死于“phthisipneumony”。"}]}],"synonyms":["pulmonary tuberculosis","tuberculosis (TB)","tuberculous pneumonia","consumption (archaic)"],"phonetic":"/ˌθaɪsɪpˈnuːməni/","extraExplanation":["这是一个非常少见、偏19世纪/早期医学文献的词，现代临床与科普中更常用 **pulmonary tuberculosis (TB)**（肺结核）或 **tuberculous pneumonia**（结核性肺炎）。","构词来源：**phthisis**（旧称“consumption”，指“消耗性疾病/结核”）+ **pneumony/pneumonia**（肺炎）。拼写也可见 **phthisi-pneumony**。","发音提示：词首 **phth-** 中的 **p** 通常不发音；整体读起来像把“phthisis”和“pneumonia”连在一起。"]}
{"word":"phthisis","summary":{"en":"Phthisis is an old medical word for tuberculosis (especially TB of the lungs), historically called “consumption.”","zh":"Phthisis 是结核病（尤指肺结核）的旧式医学称呼，过去常叫“consumption（消耗病/肺痨）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, medical) Tuberculosis, especially pulmonary tuberculosis; historically called “consumption.”","zh":"（旧式医学用语）肺结核（尤指肺部结核）；过去常称“肺痨/痨病/消耗病（consumption）”。"},"examples":[{"en":"In many 19th-century novels, a character may die of phthisis, meaning tuberculosis.","zh":"在许多19世纪小说里，人物可能“死于phthisis”，指的就是结核病。"},{"en":"Before antibiotics, phthisis was often a long, wasting illness.","zh":"在抗生素出现之前，phthisis常常是一种长期消耗身体的疾病。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, broad use) A gradual wasting or decline of the body; a wasting disease.","zh":"（罕见/广义）身体逐渐消瘦、衰弱；消耗性疾病。"},"examples":[{"en":"Older medical writing sometimes used phthisis for wasting illnesses in general.","zh":"较早的医学文献有时用phthisis泛指各种消耗性疾病。"}]}],"synonyms":["tuberculosis","TB","consumption"],"phonetic":"/ˈtaɪsɪs/","extraExplanation":["发音里“phth-”基本不发音，这是很多学习者觉得奇怪的点；现代英语中它常读作“THIGH-sis”。","词源来自希腊语，原意与“消耗、衰败”相关；在现代医学语境中通常直接说 tuberculosis (TB)。","文学/文化提示：在19世纪欧美文学中，“consumption/ phthisis”常带有“慢慢消瘦、苍白”的形象化描写，但这是对疾病的浪漫化表达，现实中的结核病具有传染性且需要规范治疗。"]}
{"word":"phthongal","summary":{"en":"“Phthongal” means “diphthongal”: having the quality of a diphthong, a gliding vowel sound within one syllable.","zh":"“phthongal”意为“双元音性质的”：指一个音节内元音音质发生滑动变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a diphthong (a vowel sound that glides from one vowel quality to another in the same syllable).","zh":"（语音学）与双元音有关的；指同一音节中元音从一种音质滑向另一种音质的发音。"},"examples":[{"en":"In English, the vowel in “time” /aɪ/ is often described as phthongal.","zh":"在英语中，“time”里的元音 /aɪ/ 常被描述为双元音性质的（phthongal）。"},{"en":"Some accents have more phthongal vowels than others.","zh":"有些口音的元音更常呈现双元音性质（phthongal）。"}]}],"synonyms":["diphthongal","gliding (vowel)","vowel-gliding"],"phonetic":"/ˈfθɔŋɡəl/","extraExplanation":["“phthongal”较少见，更常见的拼写是“diphthongal”。两者意思基本相同，都用于语音学/语言学语境。","词源上与希腊语“phthongos”（声音、音）有关；开头的“phth”在英语里通常不发 /p/，因此读音以 /f/ 起头。"]}
{"word":"phthongometer","summary":{"en":"A rare term for an instrument used in phonetics to measure or analyze speech sounds.","zh":"一个较罕见的词，指语音学中用于测量或分析语音的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure or analyze speech sounds (especially the strength or quality of the voice) in phonetics.","zh":"（语音学中）用于测量或分析语音（尤其是声音强度或音质）的仪器。"},"examples":[{"en":"Early phonetics researchers sometimes used a phthongometer to compare the loudness of different vowels.","zh":"早期的语音学研究者有时会用 phthongometer 来比较不同元音的响度。"},{"en":"The lab’s old notes mention a phthongometer, but modern software now does the same job.","zh":"实验室的旧笔记提到过 phthongometer，但如今的软件也能完成同样的工作。"}]}],"synonyms":["speech meter","voice meter","phonetic measuring device"],"phonetic":"/ˌθɑŋˈɡɑmɪtɚ/","extraExplanation":["这是一个非常少见、偏历史的术语，主要出现在早期语音学/实验语音研究的文献中。现代语音分析通常用录音设备加软件（如声谱分析）来替代。","词根拆分：phthong- 来自希腊语，表示“声音/发声”（与英语 thong 同音起首为 /θ/）；-meter 表示“测量仪器”。"]}
{"word":"phthor","summary":{"en":"“Phthor” is a rare Greek-derived root meaning “decay/destruction,” not a common everyday English word.","zh":"“phthor”是一个很少见的希腊语词根形式，意为“衰败/毁坏”，并非常用英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/obsolete root (from Greek phthor-, “destruction, decay, corruption”) sometimes seen in scholarly or technical words (more commonly as phthor- or phthor(a), as in phthora). It is not a common standalone English word in everyday use.","zh":"一个很少单独使用的词根/古旧形式，来自希腊语 phthor-，意为“毁坏、腐败、衰败”。在英语里多见于学术或技术词汇中（更常以 phthor- 或 phthora 的形式出现），日常英语中几乎不把它当作独立单词使用。"},"examples":[{"en":"In some academic contexts, the Greek root phthor- refers to decay or corruption.","zh":"在某些学术语境中，希腊词根 phthor- 指“衰败/腐败”。"},{"en":"The term “phthora” is sometimes used in discussions of sound change or moral decline.","zh":"“phthora” 有时用于讨论语音演变或道德沦落等话题。"}]}],"synonyms":["phthora","phthor- (combining form)"],"phonetic":"/fθɔr/","extraExplanation":["“phthor”很可能是拼写变体或转写（transliteration）导致的形式。在英语里更常见的是：\n- phthora（希腊语 φθορά）：常被译作“腐败/衰败/毁坏”。\n- phthisis（旧称“肺痨/肺结核”）：与“逐渐消耗、衰败”的概念相关，但现代医学英语已较少这样说。\n\n另外也有人把俄语“фтор”（意为“氟/氟元素”）转写成 ftor；如果你想查的是化学里的“氟”，英语常用词是 fluorine。"]}
{"word":"phthoric","summary":{"en":"“Phthoric” is extremely rare/nonstandard; it may mean “destructive/decaying,” but it is more often a misspelling of “phosphoric” or “phthalic.”","zh":"“phthoric”极其罕见/不标准；可能表示“与毁坏、衰败有关”，但更常见是把“phosphoric（磷酸的）”或“phthalic（邻苯二甲酸的）”拼错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / nonstandard) Relating to decay, deterioration, or destruction; “corrupting.”","zh":"（非常罕见／非标准用法）与腐败、衰败、毁坏有关的；“使变坏的”。"},"examples":[{"en":"Some old scientific or philosophical texts mention “phthoric” processes to mean destructive change.","zh":"一些较旧的科学或哲学文本会用“phthoric”来指“破坏性的变化”。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of common chemistry words like “phosphoric” or “phthalic.”","zh":"常见于把化学词汇拼错，例如把“phosphoric（磷酸的）”或“phthalic（邻苯二甲酸的）”拼成“phthoric”。"},"examples":[{"en":"Did you mean phosphoric acid? (H₃PO₄)","zh":"你想写的是 phosphoric acid（磷酸）吗？（H₃PO₄）"}]}],"synonyms":["destructive","corrupting","decaying"],"phonetic":"/ˈθɔrɪk/","extraExplanation":["“phthoric”在现代英语里几乎不用，不算常见标准词。它可能来自希腊语词根 *phthor-*（意为“毁坏、腐败、衰败”），同源的概念可见于一些学术/古典语境。","如果你是在化学/实验语境看到的，最常见是：\n- **phosphoric** /fɑˈsfɔrɪk/：与“磷酸、磷”有关（如 phosphoric acid）。\n- **phthalic** /ˈθælɪk/：与“邻苯二甲酸”有关（如 phthalic acid）。\n你可以把原句或截图发来，我可以帮你判断到底是哪一个。"]}

