{"word":"phu","summary":{"en":"“phu” is usually a nonstandard way to write the interjection “phew” (relief or exhaustion), but “PHU” can also be an abbreviation depending on context.","zh":"“phu”多为感叹词“phew”的非标准拼写（表示松口气或疲惫）；而全大写“PHU”也可能是语境相关的缩写。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(nonstandard, informal) A spelling of “phew,” used to show relief, tiredness, or that something was close or intense.","zh":"（非标准、口语）“phew”的一种拼写，用来表示松了一口气、很累，或觉得事情很惊险/很紧张。"},"examples":[{"en":"Phu—thank goodness you’re okay.","zh":"Phu——谢天谢地你没事。"},{"en":"Phu, that exam was harder than I expected.","zh":"Phu，那场考试比我想的难。"}]},{"partOfSpeech":"other","definition":{"en":"A written form that may also appear as “PHU” in abbreviations, depending on context (for example, a Public Health Unit).","zh":"也可能以“PHU”形式作为缩写出现，具体含义取决于语境（例如“公共卫生单位/公共卫生部门”）。"},"examples":[{"en":"Call your local PHU for vaccination guidance.","zh":"打电话给你当地的PHU咨询疫苗接种指导。"}]}],"synonyms":["phew","whew"],"phonetic":"/fjuː/","extraExplanation":["“phu”在英文里不是标准拼写；大多数情况下，人们想写的是感叹词“phew”（表示松口气/惊险）。如果你看到全大写“PHU”，通常是缩写：常见读法是把字母念出来 /piː eɪtʃ juː/，具体代表什么要看所在国家、行业或文件背景（例如公共卫生相关机构）。"]}
{"word":"phubber","summary":{"en":"A “phubber” is someone who ignores people nearby by focusing on their phone.","zh":"“phubber”指因专注手机而忽视身边人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who ignores someone in front of them by looking at or using their phone (someone who “phubs” others)","zh":"低头玩手机而冷落身边人的人；“手机怠慢他人”的人（phub 的施事者）"},"examples":[{"en":"He’s a habitual phubber—he checks his phone even during dinner.","zh":"他是个习惯性“低头族”，连吃饭都要看手机。"},{"en":"Don’t be a phubber when your friend is talking to you.","zh":"朋友跟你说话时别当“手机怠慢他人”的人。"},{"en":"The campaign asked phubbers to put their phones away during meetings.","zh":"这项活动呼吁在开会时爱“低头冷落别人”的人把手机收起来。"}]}],"synonyms":["phone-ignorer","phone snubber","inconsiderate phone user","phubber (informal label)"],"phonetic":"/ˈfʌbər/","extraExplanation":["“phubber”来自动词“phub”，常被解释为 phone（手机）+ snub（冷落、怠慢）的混成词（portmanteau）。它多用于日常口语、媒体或社交话题中，语气通常带批评或提醒。","在社交礼仪语境里，“phubber”强调的不只是看手机，而是因为看手机而让对方感觉被忽视。常见相关词：phub（动词）、phubbing（名词，行为本身）。"]}
{"word":"phugoid","summary":{"en":"A phugoid is a slow, long‑period up‑and‑down flight oscillation that trades speed for altitude and back again.","zh":"phugoid 指飞机在速度与高度之间相互转换所造成的缓慢、长周期的上下振荡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In aviation, a long‑period oscillation where an aircraft alternately climbs and slows down, then descends and speeds up, often with little change in angle of attack.","zh":"（航空）纵向长周期振荡：飞机会交替“爬升并减速”与“下降并加速”，通常迎角变化不大。"},"examples":[{"en":"The pilot noticed a gentle phugoid after releasing the controls.","zh":"飞行员在松开操纵后注意到出现了轻微的纵向长周期振荡。"},{"en":"In training, we learned how to damp a phugoid by making small, smooth pitch corrections.","zh":"训练中我们学习了如何用小而平顺的俯仰修正来抑制纵向长周期振荡。"}]}],"synonyms":["long-period oscillation","phugoid oscillation"],"phonetic":"/ˈfjuːɡɔɪd/","extraExplanation":["“phugoid”常见于飞行力学/航空工程课本与事故分析报告中，属于飞机的纵向（pitch）动态特性之一。","词源来自希腊语，含“逃逸/飞走”之意，用来形容飞机在高度与速度之间来回“交换”的那种缓慢摆动。","与“short‑period oscillation（短周期振荡）”相对：phugoid 频率更低、周期更长，常表现为高度与空速缓慢起伏。"]}
{"word":"Phuket","summary":{"en":"Phuket is a well-known island and province in southern Thailand, popular for beaches and tourism.","zh":"Phuket 指泰国南部著名的普吉岛及同名府，以海滩与旅游业闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An island and province in southern Thailand, famous for beaches, tourism, and Andaman Sea culture; also used as the name of its main city.","zh":"普吉岛（泰国南部的岛屿与同名府，以海滩、旅游业和安达曼海文化著称；也可指其主要城市）。"},"examples":[{"en":"We’re flying to Phuket for a beach holiday.","zh":"我们要飞去普吉岛度海边假期。"},{"en":"Phuket is known for its resorts and island-hopping tours.","zh":"普吉岛以度假村和跳岛游闻名。"}]}],"synonyms":["Phuket Island"],"phonetic":"/ˈpuːkɛt/","extraExplanation":["“Phuket”是专有名词（地名）。英语里常见搭配有：Phuket Island（普吉岛）、Phuket Province（普吉府）、in Phuket（在普吉）、to Phuket（去普吉）。","常见发音接近“POO-ket”。在旅行语境中，有时会用来泛指以普吉为中心的周边海岛与旅游区域（如攀牙湾、皮皮岛等）。"]}
{"word":"phulkari","summary":{"en":"Phulkari is a traditional Punjabi floral embroidery style used on textiles like dupattas and shawls.","zh":"Phulkari 指旁遮普地区传统的花卉刺绣风格，常用于纱巾和披肩等织物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional style of embroidered floral work from Punjab (in India and Pakistan), often done on shawls, dupattas, and other textiles","zh":"（旁遮普地区的）普尔卡里刺绣／花卉刺绣；常见于披肩、纱巾（dupatta）等织物上的传统刺绣风格"},"examples":[{"en":"She wore a phulkari dupatta over a simple outfit.","zh":"她在朴素的衣服外搭了一条普尔卡里刺绣纱巾。"},{"en":"The museum displayed a 19th-century phulkari with bright geometric flowers.","zh":"博物馆展出了一件19世纪的普尔卡里作品，上面有鲜艳的几何花朵图案。"},{"en":"Many artisans keep the phulkari tradition alive through handmade embroidery.","zh":"许多手工艺人通过手工刺绣让普尔卡里传统延续至今。"}]}],"synonyms":["Punjabi embroidery","embroidered textile","folk embroidery"],"phonetic":"/fʊlˈkɑːri/","extraExplanation":["“Phulkari”一词来自旁遮普语：phul（花）+ kari（工艺/工作），字面意思就是“做花（的工艺）”。","它常与婚礼、节庆和赠礼文化相关：许多家庭会把带有特殊图案的普尔卡里织物当作重要场合的服饰或纪念品。","英语里常直接用外来词phulkari，也会说“phulkari embroidery（普尔卡里刺绣）”。常见搭配：phulkari dupatta / phulkari shawl。"]}
{"word":"phulwa","summary":{"en":"Phulwa is a South Asian (Hindi/Urdu) romanized word meaning “little flower,” often used as a nickname or name.","zh":"Phulwa 是印地语/乌尔都语常见的拉丁拼写形式，意思是“小花”，常用作昵称或人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian; Hindi/Urdu romanization) “little flower,” a colloquial/diminutive form of phool (“flower”); also used as a nickname or given name.","zh":"（南亚用语；印地语/乌尔都语的拉丁拼写）“小花”，是 phool（花）的口语/昵称式缩小形式；也可用作昵称或人名。"},"examples":[{"en":"Her family calls her Phulwa because she was born during the spring festival.","zh":"家里人叫她 Phulwa，因为她是在春天的节日里出生的。"},{"en":"In the story, Phulwa brings flowers to the temple every morning.","zh":"在故事里，Phulwa 每天早晨都会带花去寺庙。"},{"en":"The word “phulwa” is sometimes used affectionately to describe a child like a flower.","zh":"“phulwa” 有时会被用来亲昵地形容孩子像花一样可爱。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, regional) a small flower or blossom.","zh":"（较少见，地区性用法）小花；花朵。"},"examples":[{"en":"She picked tiny phulwa from the roadside grass.","zh":"她从路边草丛里摘了几朵小花。"},{"en":"The phulwa on this plant appear after the first rain.","zh":"这种植物的小花会在第一场雨后开放。"}]}],"synonyms":["little flower","blossom (contextual)","phool (source word)"],"phonetic":"/ˈfuːlwɑː/","extraExplanation":["“Phulwa/Phoolwa/Phūlwā” 常见于印地语/乌尔都语的拉丁转写；不同拼写多与发音习惯有关。","在一些影视、民间故事或歌谣里，“Phulwa” 常作为女性名字出现，带有“像花一样美好/可爱”的意象。","如果你是在特定句子或歌曲/对白里看到 “phulwa”，发音和含义可能会随地区方言略有变化；你可以把原句发来，我可以帮你更精准判断。"]}
{"word":"phulwara","summary":{"en":"Phulwara means “a flower garden,” and it’s also used as a name to suggest a beautiful, welcoming place.","zh":"Phulwara 意为“花园/花圃”，也常用作名称来传达美丽与宜人的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) a flower garden; a place filled with flowers.","zh":"（南亚英语；源自印地语/乌尔都语）花园；花丛繁盛之地。"},"examples":[{"en":"In spring, the courtyard turns into a phulwara of roses and marigolds.","zh":"春天时，院子变成了玫瑰和万寿菊的花园。"},{"en":"They described Kashmir as a phulwara, full of color and fragrance.","zh":"他们把克什米尔形容为一座花园，色彩与芬芳满溢。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for places, homes, or businesses (e.g., “Phulwara”) to suggest beauty, flowers, and a welcoming atmosphere.","zh":"常用作地名、房名或商号名（如“Phulwara”），用来表达“花香、美丽、宜人”的意象。"},"examples":[{"en":"The guesthouse is called Phulwara because it has a small flower courtyard.","zh":"这家旅馆叫“Phulwara”，因为里面有个小花庭院。"}]}],"synonyms":["flower garden","flowerbed","garden of flowers"],"phonetic":"/fʊlˈwɑːrə/","extraExplanation":["“Phulwara”常被视为南亚语言词汇在英语中的借用写法，通常对应“phūlwāṛā/phalwāṛā”等转写形式，核心意思与“phool/phūl（花）”有关。不同地区与转写系统会导致拼写略有差异。","在南亚诗歌与歌词中，“花园/花圃”的意象常用来象征青春、爱情、繁盛与希望，因此“phulwara”也常带有较为抒情的色彩。"]}
{"word":"phut","summary":{"en":"“Phut” is a rare, informal sound word used in writing to show a quick, soft puff or sudden movement.","zh":"“phut”是较少见的非正式拟声词，多用于文字中表示轻微的“噗”声或突然一闪的动作。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal, onomatopoeia) A written sound effect for a small, sudden, soft “puff” or quick movement—like something darting away or air escaping briefly.","zh":"（非正式，拟声词）用文字模仿一种轻微、突然的“噗”的声音或快速一闪的动作，例如东西迅速溜走、空气短促泄出等。"},"examples":[{"en":"The bug was there—and then, phut, it disappeared under the table.","zh":"虫子还在那儿——然后“phut”一下，就钻到桌子底下不见了。"},{"en":"The tire lost a little air: phut… phut…","zh":"轮胎漏了一点气：“phut……phut……”"}]}],"synonyms":["pfft","poof","whoosh"],"phonetic":"/fʌt/","extraExplanation":["“phut”不是常见的标准英语单词，更像漫画、小说里用来写声音/动作的拟声词（类似中文的“噗”“嗖”）。在正式写作中通常不用；口语里也不常单独说出来，多见于文字表现。","拼写上用“ph-”常给人一种轻擦或轻喷的感觉，但具体读音不固定，作者可能按语境自由发挥。"]}
{"word":"phuts","summary":{"en":"“phuts” is a rare form of “phut,” meaning to make a small soft puffing/pop sound; it can also name that sound.","zh":"“phuts”是罕见词“phut”的变化形式，表示发出轻微的“噗/啪”声；也可指这种声音本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To make a soft, dull, short sound (like a small puff of air or a weak pop).","zh":"（罕见）发出轻而闷、短促的声音（像一小股气的“噗”声或很弱的“啪”声）。"},"examples":[{"en":"The damp firework phutted instead of exploding.","zh":"那枚受潮的烟花只发出一声轻轻的“噗”，并没有炸开。"},{"en":"The old engine phuts and coughs before it starts.","zh":"那台旧发动机启动前会“噗噗”地响，还会咳嗽似的抖几下。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A soft, dull, short sound.","zh":"（罕见）轻而闷、短促的声音。"},"examples":[{"en":"There was a little phut from the leaky tire.","zh":"漏气的轮胎发出了一声轻轻的“噗”。"}]},{"partOfSpeech":"int.","definition":{"en":"An imitative sound used in writing to show a soft puff/pop (similar to “pfft”).","zh":"（拟声）书写中用来表示轻微的喷气/噗声（类似“pfft”）。"},"examples":[{"en":"“Phut,” the comic wrote as the balloon slowly deflated.","zh":"漫画里写道：“Phut”，表示气球慢慢瘪下去的声音。"}]}],"synonyms":["puff","pfft","sputter"],"phonetic":"/fʌt/","extraExplanation":["“phuts”通常是动词第三人称单数（he/she/it phuts）或名词复数（two phuts），但这个词在现代英语里非常少见，多见于拟声、文学描写或漫画音效。","很多情况下，用户输入的“phuts”可能是把常用词“puts”（put 的第三人称单数）误拼了；如果你本来想表达“放/把……放下/把……投入（例如 put money in）”，正确拼写通常是 puts。"]}

