{"word":"poa","summary":{"en":"POA most commonly means “power of attorney,” a document authorizing someone to act for you; it can also mean the grass genus Poa (bluegrass).","zh":"POA最常见是“power of attorney（授权委托书/委任代理权）”的缩写；也可指早熟禾属（Poa，蓝草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “power of attorney”: a legal document that lets someone act for another person in financial, medical, or legal matters.","zh":"“power of attorney（授权委托书/委任代理权）”的缩写：一种法律文件，允许他人在财务、医疗或法律事务中代表你行动。"},"examples":[{"en":"My mom signed a POA so I can manage her bank account while she’s abroad.","zh":"我妈妈签了POA，这样她在国外时我可以帮她管理银行账户。"},{"en":"The hospital asked if he had a medical POA for his father.","zh":"医院询问他是否持有他父亲的医疗POA。"},{"en":"Please email the POA before we finalize the contract.","zh":"请在我们最终确定合同前把POA发邮件过来。"}]},{"partOfSpeech":"n.","definition":{"en":"A genus of grasses (bluegrass), common in lawns and pastures.","zh":"早熟禾属（Poa，亦称蓝草/早熟禾），常见于草坪和牧场的一类禾草。"},"examples":[{"en":"Kentucky bluegrass is a type of Poa used for lawns.","zh":"肯塔基蓝草是早熟禾属（Poa）的一种，常用于草坪。"},{"en":"The field survey recorded several Poa species near the river.","zh":"野外调查记录到河边有几种早熟禾属（Poa）植物。"}]}],"synonyms":["power of attorney","authorization","letter of attorney","proxy (in some contexts)"],"phonetic":"/ˌpiː oʊ ˈeɪ/","extraExplanation":["在日常英语里，POA最常见指“power of attorney”。常见类型包括：general POA（一般授权）、limited/special POA（特定事项授权）、durable POA（即使本人失能仍有效的授权）、medical/healthcare POA（医疗授权）。不同州/国家对格式、见证人或公证（notary）的要求可能不同。"]}
{"word":"poaceae","summary":{"en":"Poaceae is the botanical family of grasses, including many key food crops like wheat, rice, and corn.","zh":"Poaceae 指“禾本科”，即草类植物的科，包含小麦、水稻、玉米等重要作物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes grasses such as wheat, rice, corn (maize), barley, oats, bamboo, and many lawn grasses","zh":"禾本科；草本植物的一科，包括小麦、水稻、玉米、高粱/大麦、燕麦、竹子以及许多草坪草等"},"examples":[{"en":"Wheat and rice are major food crops in the Poaceae family.","zh":"小麦和水稻都是禾本科的重要粮食作物。"},{"en":"Bamboo belongs to Poaceae, even though it looks different from common grasses.","zh":"竹子属于禾本科，尽管它看起来和常见的草不太一样。"}]}],"synonyms":["grass family"],"phonetic":"/poʊˈeɪsiˌiː/","extraExplanation":["“Poaceae”是拉丁化的植物学科名（国际通用），常见英文别名是“grass family”。日常交流中，人们更常说“grasses”或“the grass family”，在学术写作或植物鉴定中才更常用“Poaceae”。","禾本科在人类文明中非常关键：世界上大量主食与饲料作物（如稻、麦、玉米）都属于这一科，因此在农业、生态与经济领域经常被提到。"]}
{"word":"poaceous","summary":{"en":"Poaceous means “of or related to grasses (the family Poaceae).”","zh":"poaceous 指“禾本科的；与禾本科（草类）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to grasses (plants in the grass family, Poaceae).","zh":"（形容词）与禾本科（Poaceae）植物有关的；禾本科的。"},"examples":[{"en":"Poaceous plants like wheat and rice are important food crops.","zh":"像小麦和水稻这样的禾本科植物是重要的粮食作物。"},{"en":"The prairie is dominated by poaceous species.","zh":"这片大草原以禾本科物种为主。"}]}],"synonyms":["grass","grass-family (as an adjective phrase)","gramineous"],"phonetic":"/poʊˈeɪʃəs/","extraExplanation":["“Poaceae”是禾本科的拉丁学名；“poaceous”来自该学名，常见于植物学、生态学、农业等较正式的语境。日常英语里更常说“grass”或“grass-family (plants)”。","学习提示：当你看到“-aceous”结尾（如“herbaceous”草本的，“carbonaceous”含碳的），通常表示“……的/与……有关的”。"]}
{"word":"poach","summary":{"en":"Poach means to cook gently in liquid, or to take something unfairly—like hunting illegally, stealing ideas, or hiring someone away from another company.","zh":"Poach既可指用液体小火浸煮（如水煮蛋），也可指不正当地“夺取”——如非法偷猎、盗用想法或从别家公司挖人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cook food gently in hot water or another liquid, without boiling hard (often eggs or fish)","zh":"（用热水或其他液体）小火慢煮、浸煮（常指水煮蛋或鱼）"},"examples":[{"en":"She poached two eggs for breakfast.","zh":"她早餐水煮了两个鸡蛋。"},{"en":"Poach the salmon in lightly salted water for about 10 minutes.","zh":"把三文鱼放在淡盐水里小火浸煮大约10分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"to illegally hunt, catch, or take wildlife (or fish), especially on private land","zh":"非法偷猎；（尤指在私人土地上）非法捕猎/捕鱼"},"examples":[{"en":"They were arrested for poaching deer in the national park.","zh":"他们因在国家公园偷猎鹿而被逮捕。"},{"en":"The river is protected, so fishing there is considered poaching.","zh":"这条河受保护，所以在那儿捕鱼算偷捕。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take someone’s ideas, work, or content and use it as your own (often unfairly)","zh":"（不公平地）盗用、剽窃（他人的想法、作品或内容）"},"examples":[{"en":"He was accused of poaching her research ideas.","zh":"他被指控剽窃她的研究想法。"},{"en":"Some websites poach articles from smaller blogs.","zh":"有些网站会盗用小博客的文章。"}]},{"partOfSpeech":"vt.","definition":{"en":"to attract and hire an employee away from another company","zh":"（从别的公司）挖人；挖走员工"},"examples":[{"en":"The tech firm tried to poach engineers from its rivals.","zh":"那家科技公司试图从竞争对手那里挖工程师。"},{"en":"They offered her a higher salary to poach her from a competitor.","zh":"他们开出更高薪水把她从竞争对手那里挖过来。"}]}],"synonyms":["cook (gently)","simmer","steal","plagiarize","pirate","headhunt","recruit","snatch"],"phonetic":"/poʊtʃ/","extraExplanation":["“poach”有两个常见来源线索：一是与“装在口袋里带走/偷拿”的旧义相关，因此发展出“偷猎、盗用”的含义；二是烹饪义来自法语影响（把食物放在液体中慢煮）。所以它在现代英语里形成了“温和烹调”和“非法/不正当夺取”这两大语义群。","常见搭配：poached egg(s)（水煮蛋）；poach wildlife/elephants/deer（偷猎野生动物/大象/鹿）；poach an employee/talent（挖人）；poach an idea/content（盗用想法/内容）。"]}
{"word":"poachable","summary":{"en":"Poachable means “suitable for poaching (gentle simmering)” or “easy to recruit away (poach) from another employer.”","zh":"poachable 指“适合用汆煮/水煮方式烹调的”，也可指“（人才）容易被挖走的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be cooked by poaching (gently simmering in water or another liquid).","zh":"适合用“水煮/汆煮（poach）”方式烹调的（在热但不沸腾的液体中轻煮）。"},"examples":[{"en":"Eggs are very poachable if the water is hot but not boiling.","zh":"如果水温够热但不沸腾，鸡蛋就很适合用水煮（poach）。"},{"en":"This fish is poachable and stays tender in broth.","zh":"这种鱼适合用汤汁轻煮，口感会保持嫩滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Easy to recruit away from another employer (often of skilled workers).","zh":"（员工）容易被其他公司挖走的。"},"examples":[{"en":"In a competitive market, experienced engineers are highly poachable.","zh":"在竞争激烈的市场里，有经验的工程师非常容易被挖走。"},{"en":"They raised salaries to make staff less poachable.","zh":"他们提高薪资，让员工不那么容易被挖走。"}]}],"synonyms":["suitable for poaching","easy to poach","recruitable","headhuntable"],"phonetic":"/ˈpoʊtʃəbəl/","extraExplanation":["“poach（汆煮/水煮）”指把食物放在接近沸点但不翻滚的液体中轻煮；常见搭配有 poached egg（水波蛋）、poached fish（汆鱼）。","职场语境里，poach 也有“挖角/挖人”之意，所以 poachable 常用来形容“容易被挖走的员工/人才”。语气偏商业写作或媒体报道。"]}
{"word":"poachard","summary":{"en":"A pochard is a kind of diving duck.","zh":"pochard 指一种潜鸭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of diving duck (especially the common pochard) found in Europe and parts of Asia; sometimes seen in parks and wetlands","zh":"（一种）潜鸭；（尤指）红头潜鸭（常见于欧洲及亚洲部分地区，也可见于公园与湿地）"},"examples":[{"en":"We spotted a pochard diving for food near the reeds.","zh":"我们看到一只红头潜鸭在芦苇附近潜水觅食。"},{"en":"In winter, pochards gather on quiet lakes and reservoirs.","zh":"冬天，红头潜鸭会聚集在安静的湖泊和水库里。"}]}],"synonyms":["diving duck","duck"],"phonetic":"ˈpoʊtʃɑrd","extraExplanation":["你输入的 **poachard** 很可能是拼写误差，标准拼写常见为 **pochard**（一种鸭）。","不要和 **poacher** 混淆：**poacher** 指“偷猎者/盗猎者”，与鸟类名称 **pochard** 意义完全不同。"]}
{"word":"poachards","summary":{"en":"Pochards are diving ducks; rarely, “pochard” can also mean a drunkard in older usage.","zh":"pochards 指“潜水鸭（潜鸭类）”；少见情况下，pochard 在旧用法里也可指“醉汉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) A type of medium-sized diving duck found in Europe and parts of Asia (especially the common pochard).","zh":"（常用复数）一种中等体型的潜水鸭，分布于欧洲及亚洲部分地区（尤指红头潜鸭／普通潜鸭）。"},"examples":[{"en":"We saw several pochards diving for food near the reeds.","zh":"我们看到几只潜鸭在芦苇附近潜水觅食。"},{"en":"In winter, pochards gather on larger lakes and reservoirs.","zh":"冬季时，潜鸭常聚集在较大的湖泊和水库。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, from French) A heavy drinker; a drunk person.","zh":"（罕见，源自法语）酗酒者；醉汉。"},"examples":[{"en":"In some older writing, “pochard” can mean a drunkard.","zh":"在一些较旧的文字中，pochard 可指“醉汉”。"}]}],"synonyms":["diving duck","(rare) drunkard"],"phonetic":"/ˈpoʊtʃɑrd/","extraExplanation":["你输入的 **poachards** 更常见的标准拼写是 **pochards**（复数），单数是 **pochard**。它和 **poachers**（偷猎者）或 **poached**（水煮/偷猎的）无关，只是拼写很像。","作为鸟类词汇时，pochard 常出现在观鸟、自然写作里；“酗酒者”的意思来自法语借词，英语中较少用，阅读时见到多半是文学或旧文本。"]}
{"word":"poached","summary":{"en":"Poached most commonly means gently cooked in hot liquid (like poached eggs). It can also mean illegally taken (poached animals/fish) or unfairly taken from others (poached staff/ideas).","zh":"poached 最常指“用热水轻煮的”（如水煮蛋/水波蛋）。也可指“非法猎捕/捕捞得到的”，或“从他人处不正当地挖走/夺取的”（如挖角、抄点子）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an egg or other food) cooked gently in hot liquid (usually water) without the shell or without frying.","zh":"（鸡蛋或其他食物）用热水等液体轻煮（通常不带壳、也不油煎）的；水煮的。"},"examples":[{"en":"I ordered poached eggs with toast.","zh":"我点了水煮蛋配吐司。"},{"en":"Poached salmon is light and healthy.","zh":"水煮三文鱼清淡又健康。"}]},{"partOfSpeech":"adj.","definition":{"en":"Taken or killed illegally (especially animals or fish).","zh":"（尤指动物或鱼）被非法捕猎（或捕捞）的。"},"examples":[{"en":"The restaurant was fined for serving poached fish.","zh":"那家餐厅因供应非法捕捞的鱼被罚款。"},{"en":"Rangers are trying to stop poached wildlife products.","zh":"护林员正努力制止非法猎捕的野生动物制品。"}]},{"partOfSpeech":"adj.","definition":{"en":"Taken from another person, group, or organization (such as workers, customers, ideas, or content), often unfairly.","zh":"（人才、客户、想法、内容等）从他人或其他机构“挖走/夺走”的；（常含不公平之意）抄袭或攫取的。"},"examples":[{"en":"The company accused a rival of poaching its best engineers.","zh":"这家公司指责竞争对手挖走了他们最优秀的工程师。"},{"en":"He was criticized for using poached ideas in his presentation.","zh":"他因在演讲中使用抄来的点子而受到批评。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “poach” (to cook gently in liquid; to hunt or fish illegally; to take unfairly).","zh":"“poach”的过去式/过去分词（可指水煮；非法捕猎/捕捞；不正当地挖人或夺取）。"},"examples":[{"en":"She poached two eggs for breakfast.","zh":"她早餐水煮了两个鸡蛋。"},{"en":"They were arrested after they poached deer in the park.","zh":"他们在公园非法猎鹿后被逮捕。"}]}],"synonyms":["cooked (in water)","simmered","illegal","stolen","pirated","recruited","headhunted"],"phonetic":"/poʊtʃt/","extraExplanation":["“poach”原义与“用热水慢煮”有关，后来也用于“侵入他人领地去偷猎/偷捕鱼”，再引申到商业语境里的“挖角（poach talent）”与“攫取/抄袭（poach ideas）”。","常见搭配：poached eggs（溏心水煮蛋/水波蛋），poached salmon（清煮三文鱼），poached ivory/wildlife（非法猎获的象牙/野生动物制品），poach employees（挖员工/挖角）。"]}
{"word":"poacher","summary":{"en":"A poacher is someone who illegally hunts or catches wild animals or fish; to poach means to do this illegally.","zh":"poacher 指“偷猎者/非法捕猎者”；poach 作动词指“非法捕猎/捕鱼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who illegally hunts, catches, or kills wild animals (or fishes)","zh":"偷猎者；非法捕猎（或捕鱼）的人"},"examples":[{"en":"The park rangers arrested a poacher for hunting deer out of season.","zh":"护林员逮捕了一名偷猎者，因为他在禁猎期猎杀鹿。"},{"en":"Poachers often target elephants for their ivory.","zh":"偷猎者常以大象为目标，猎取象牙。"}]},{"partOfSpeech":"v.","definition":{"en":"to illegally hunt, catch, or take wild animals or fish, especially on private land or during a protected season","zh":"（尤指在私人土地或禁猎期）非法捕猎；非法捕鱼"},"examples":[{"en":"It’s illegal to poach in this reserve.","zh":"在这个保护区偷猎是违法的。"},{"en":"They were caught poaching salmon in the river.","zh":"他们因在河里非法捕捞鲑鱼而被抓。"}]}],"synonyms":["illegal hunter","trespasser (in hunting context)","poach (verb)"],"phonetic":"/ˈpoʊtʃɚ/","extraExplanation":["“Poach”原意也有“水煮（如水波蛋）”的意思，但“poacher/poach”在野生动物语境里通常指“非法捕猎”。学习时可通过语境区分：谈动物保护与法律时多为“偷猎”；谈烹饪时才是“水煮”。","在文化与新闻语境中，“poaching”常与野生动物保护、濒危物种、反盗猎巡护（anti-poaching patrols）等话题一起出现。"]}
{"word":"poachers","summary":{"en":"“Poachers” are people who illegally hunt/catch wildlife; it can also mean people who unfairly take customers or workers from rivals.","zh":"“Poachers”指偷猎者/非法捕捞者；也可指在商业等场景中不正当地“挖走”顾客或员工的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who illegally hunt, catch, or collect wildlife (or take natural resources) on land where it is not allowed.","zh":"（在禁止或无权区域）非法捕猎、捕捞或采集野生动植物/自然资源的人。"},"examples":[{"en":"Park rangers arrested two poachers who were trapping birds.","zh":"护林员逮捕了两名正在设陷阱抓鸟的偷猎者。"},{"en":"Poachers often target endangered animals for money.","zh":"偷猎者常为钱而猎杀濒危动物。"},{"en":"The community set up night patrols to stop poachers.","zh":"社区组织夜间巡逻来阻止偷猎者。"}]},{"partOfSpeech":"n.","definition":{"en":"In business or everyday life, people who try to take customers, workers, or members from a rival organization (often seen as unfair).","zh":"（商业/日常）从竞争对手那里“挖走”顾客、员工或成员的人（常带有不正当之意）。"},"examples":[{"en":"The club accused a rival team of being poachers and stealing their best players.","zh":"该俱乐部指责对手球队“挖人”，抢走了他们最优秀的球员。"},{"en":"Some companies call aggressive recruiters poachers.","zh":"有些公司把过于激进的猎头称为“挖角者”。"}]}],"synonyms":["illegal hunters","illegal trappers","trespass hunters","raiders","recruitment raiders"],"phonetic":"/ˈpoʊtʃərz/","extraExplanation":["“poacher”最常用于野生动物保护语境，强调违法与对生态的伤害；新闻里常见“anti-poaching”（反偷猎）和“poaching ring”（偷猎团伙）。","注意不要和烹饪里的“poach（水煮/慢煮）”混淆：同形不同义。"]}
{"word":"poaches","summary":{"en":"“Poaches” is the third-person singular of “poach”: to gently cook in liquid (often eggs), to hunt illegally, or to take something unfairly (like employees or content).","zh":"“poaches”是“poach”的第三人称单数：可指（1）用热水轻煮（常指水波蛋）；（2）非法偷猎/违规捕鱼；（3）不正当地挖角或盗用内容。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cook (especially an egg) gently in hot water (or another liquid) without the shell","zh":"（尤指鸡蛋）用热水（或其他液体）不带壳地轻煮、白灼"},"examples":[{"en":"She poaches two eggs for breakfast.","zh":"她早餐会水煮两颗蛋。"},{"en":"Poach the eggs for about three minutes until the whites set.","zh":"把蛋水煮大约三分钟，直到蛋白凝固。"}]},{"partOfSpeech":"v.","definition":{"en":"to hunt, fish, or take wildlife illegally (without permission or out of season)","zh":"（非法）偷猎；（违规）捕鱼"},"examples":[{"en":"He poaches deer on protected land.","zh":"他在受保护的土地上偷猎鹿。"},{"en":"The park ranger says someone poaches here at night.","zh":"护林员说有人夜里在这里偷猎。"}]},{"partOfSpeech":"v.","definition":{"en":"to take or use something that belongs to someone else, especially by tempting away their employees, clients, or ideas","zh":"（不正当地）挖走（员工/客户）；盗用（点子/资源）"},"examples":[{"en":"That company poaches experienced engineers from its competitors.","zh":"那家公司从竞争对手那里挖走有经验的工程师。"},{"en":"He claims the website poaches his content without credit.","zh":"他声称那个网站未经署名就盗用了他的内容。"}]}],"synonyms":["cooks (gently)","simmers","illegally hunts","trespass-hunts","pilfers","appropriates","recruits away"],"phonetic":"/poʊtʃɪz/","extraExplanation":["“poach”常见有三个核心意思：水煮（烹饪）、偷猎（违法捕猎/捕鱼）、挖角/盗用（商业或创作领域）。语境通常能帮助你快速判断。","烹饪里的“poached egg”指不加油、用热水轻煮的“水波蛋/溏心水煮蛋（不带壳）”。"]}
{"word":"poachier","summary":{"en":"“Poachier” means “more poachy,” usually describing a softer, runnier poached egg.","zh":"“poachier”意为“更半熟、更流心的”（通常形容水波蛋）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of poachy) More softly cooked in the style of a poached egg (tender whites, runny yolk).","zh":"（poachy 的比较级）更像“水波蛋”那样更嫩、更半熟（蛋白刚凝固、蛋黄更流心）。"},"examples":[{"en":"Cook it 30 seconds less if you want the yolk poachier.","zh":"如果你想让蛋黄更流心一点，就少煮 30 秒。"},{"en":"These eggs are poachier than yesterday’s—perfect on toast.","zh":"这些蛋比昨天的更半熟，配吐司刚刚好。"}]}],"synonyms":["more runny","softer","less set"],"phonetic":"/ˈpoʊ.tʃi.ɚ/","extraExplanation":["“poachier”在日常英语里比较少见，多数人会直接说“more runny / less set / softer”。","如果你想表达“更像偷猎者/更爱偷猎”，英语不会用 *poachier*，而会说“more likely to poach”或“more of a poacher”。","相关词：poach (v.) 水煮（蛋）；偷猎。poached (adj.) 水波的/水煮的；poachy (adj.)（蛋）半熟流心的。"]}
{"word":"poachiest","summary":{"en":"“Poachiest” means “most poachy,” most often describing an egg that’s very soft with a runny yolk.","zh":"“Poachiest”是“poachy”的最高级，最常用来形容鸡蛋非常像水波蛋：外熟内嫩、蛋黄流心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of poachy) Most like a poached egg—soft, gently cooked, and often with a runny center (used especially about eggs).","zh":"（poachy 的最高级）最像水波蛋的——外熟内嫩、质地柔软，中心常带流心（尤用于形容鸡蛋）。"},"examples":[{"en":"Of all the eggs on the plate, this one is the poachiest—soft white, runny yolk.","zh":"盘子里这些蛋当中，这个最“水波蛋感”——蛋白软、蛋黄流心。"},{"en":"She wanted the poachiest egg possible for her toast.","zh":"她想要搭配吐司的蛋越“水波”越好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Most suggestive of poaching (illegal hunting or taking) in style or behavior.","zh":"（非正式，少见）最带有“偷猎/非法捕捞或盗取”意味的（指风格或行为）。"},"examples":[{"en":"The article described the group’s poachiest tactics for taking resources from local waters.","zh":"那篇文章形容该团体在攫取当地水域资源时手段最像“偷捕”。"}]}],"synonyms":["most runny","softest","most softly cooked","most poached (for eggs)"],"phonetic":"/ˈpoʊtʃiɪst/","extraExplanation":["“poachiest”通常来自形容词“poachy”（像水波蛋的；也可引申为与偷猎相关的），加上最高级词尾“-est”。常见口语里更自然的说法是“the most poached/most runny/softest”来描述蛋的口感。","烹饪语境中，“poached egg（水波蛋）”在英语菜单里很常见（如 Eggs Benedict）。因此“poachy/poachiest”多见于美食写作或随口评价，用来强调那种外熟内流心的质感。"]}
{"word":"poachiness","summary":{"en":"Poachiness means either the soft texture of something poached (especially eggs) or, less commonly, a puffy/tired look around the eyes.","zh":"Poachiness 指“水波”烹调后的柔软质地（尤指水波蛋）；较少见时也可指眼周浮肿、疲惫的样子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being poached—especially the soft, gently cooked texture of a poached egg.","zh":"（尤指水波蛋）“水波”烹调后的状态或质地；柔软、温和熟成的口感。"},"examples":[{"en":"The poachiness of the egg was perfect—set whites with a runny yolk.","zh":"这颗蛋的水波质地刚刚好——蛋白凝固、蛋黄仍然流心。"},{"en":"Lower the heat if you want more tenderness and poachiness.","zh":"如果想要更嫩、更有水波感，就把火调小一些。"}]},{"partOfSpeech":"n.","definition":{"en":"A puffy, tired-looking quality—especially around the eyes (a less common use).","zh":"（较少见）浮肿、疲惫的样子；尤指眼周看起来肿肿的、没精神。"},"examples":[{"en":"After the long flight, there was some poachiness around her eyes.","zh":"长途飞行后，她的眼周有点浮肿。"},{"en":"Cold compresses can reduce morning poachiness.","zh":"冷敷可以减轻早晨的浮肿感。"}]}],"synonyms":["poached texture","tenderness","softness","puffiness","swelling"],"phonetic":"/ˈpoʊtʃinəs/","extraExplanation":["“poachiness”不是非常常见的标准词，更常见的是用形容词“poached/poachy”或直接描述口感（如“silky,” “tender”）与外观（如“puffy eyes”）。在烹饪语境里，它通常指水波蛋那种“柔软但成形”的状态；在外貌语境里，则多见于较口语/非正式的写法。"]}
{"word":"poaching","summary":{"en":"Poaching most commonly means illegal hunting or fishing; it can also mean gently cooking food in hot water, or “stealing” employees/customers from a competitor.","zh":"poaching最常指偷猎/非法捕猎捕鱼；也可指用温水水煮烹饪；还可指从竞争对手处挖人或抢客户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the illegal hunting, fishing, or taking of wild animals, birds, or fish (often in protected areas or without permission)","zh":"（通常指在禁猎区或未获许可的）偷猎；非法捕猎/捕鱼"},"examples":[{"en":"The park increased patrols to stop poaching of elephants.","zh":"公园加强巡逻以阻止对大象的偷猎。"},{"en":"Poaching threatens endangered species and local ecosystems.","zh":"偷猎会威胁濒危物种和当地生态系统。"}]},{"partOfSpeech":"n.","definition":{"en":"a gentle cooking method: cooking food (especially eggs or fish) in hot water that is below boiling","zh":"（烹饪）水煮（尤指用接近沸腾但不沸腾的热水煮蛋或鱼）"},"examples":[{"en":"She made poaching liquid with water, vinegar, and salt for the eggs.","zh":"她用水、醋和盐调了水煮蛋用的汤汁。"},{"en":"Poaching salmon keeps it tender and moist.","zh":"水煮三文鱼能让肉质更嫩、更湿润。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of trying to take customers, employees, or business from a competitor","zh":"（商业/职场）挖人；抢客户；挖角"},"examples":[{"en":"The company was accused of poaching engineers from a rival firm.","zh":"这家公司被指控从竞争对手那里挖走工程师。"},{"en":"Non-compete clauses are sometimes used to prevent poaching.","zh":"有时会用竞业限制条款来防止挖角。"}]},{"partOfSpeech":"v.","definition":{"en":"to hunt, fish, or take wild animals illegally","zh":"偷猎；非法捕猎/捕鱼"},"examples":[{"en":"They were caught poaching deer on private land.","zh":"他们因在私人土地上偷猎鹿而被抓。"}]},{"partOfSpeech":"v.","definition":{"en":"to cook (food) gently in hot water below boiling","zh":"用文火水煮（食物，如鸡蛋、鱼）"},"examples":[{"en":"Poach the eggs for about three minutes.","zh":"把鸡蛋水煮大约三分钟。"}]},{"partOfSpeech":"vt.","definition":{"en":"to persuade someone to leave one organization for another, especially a competitor","zh":"（从别处，尤指竞争对手处）挖走（人才/客户）"},"examples":[{"en":"The startup tried to poach her from a big tech company.","zh":"那家初创公司试图把她从一家大型科技公司挖走。"}]}],"synonyms":["illegal hunting","illegal fishing","pirating (business)","talent raiding","poaching (cooking: simmering)"],"phonetic":"/ˈpoʊtʃɪŋ/","extraExplanation":["“Poaching”一词最常见于环保与野生动物保护语境，常与“endangered species（濒危物种）”“wildlife trafficking（野生动物非法贸易）”一起出现。它不仅是违法行为，也常被视为破坏生态与生物多样性的严重问题。","烹饪义的“poach”强调“温和加热”，水不应剧烈沸腾；常见搭配有“poached egg（水煮蛋）”“poached salmon（水煮三文鱼）”。","职场/商业义带有“从竞争对手那里抢资源”的语感，语气多为负面或批评；常见搭配有“poach talent（挖人才）”“poach customers（抢客户）”。"]}
{"word":"poachy","summary":{"en":"“Poachy” means slightly undercooked and soft/runny, especially used for poached eggs.","zh":"“poachy”指（多用于水波蛋）略微没熟透、口感偏软/偏流心的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an egg, especially a poached egg) slightly undercooked, with a soft or runny white and/or yolk.","zh":"（多指水波蛋等鸡蛋）略微没熟透的；蛋白和/或蛋黄偏软、偏流心的。"},"examples":[{"en":"My poached egg came out a little poachy, so I cooked it for 30 more seconds.","zh":"我的水波蛋有点没熟透，所以我又煮了30秒。"},{"en":"If the whites look poachy, let the egg sit in hot water for a moment longer.","zh":"如果蛋白看起来还偏生，就让鸡蛋在热水里再待一会儿。"}]}],"synonyms":["runny","soft","undercooked","soft-set"],"phonetic":"/ˈpoʊtʃi/","extraExplanation":["“poachy”主要是口语/非正式用法，常见于讨论鸡蛋熟度（尤其是poached egg 水波蛋）。它通常带有“偏生、偏软”的感觉，有时是不理想的结果，但在喜欢流心口感的人看来也可能是刚刚好。","相关烹饪表达：runny（流心的）、set（凝固的/定型的）、soft-set（半凝固的）、overcooked（煮老了）。"]}
{"word":"poales","summary":{"en":"“Poales” is not standard English; it’s usually a misspelling of “poles.”","zh":"“poales”不是标准英语；通常是“poles”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “poles” (plural of “pole”).","zh":"不是标准英文单词；最常见是把“poles”（“pole”的复数）拼错了。"},"examples":[{"en":"I couldn’t find “poales” in the dictionary—did you mean “poles”?","zh":"我在词典里找不到“poales”——你是不是想写“poles”？"},{"en":"The tent needs two poles to stand up.","zh":"这顶帐篷需要两根杆子才能立起来。"}]}],"phonetic":"/poʊlz/","extraExplanation":["“poales”本身不是常见英语词。你可以告诉我你看到它的句子或想表达的意思，我可以帮你判断是否是：\n1) poles（杆子/电线杆/两极/投票等的复数）；\n2) Póales/Poales（人名或地名的拼写）；\n3) 其他单词的拼写错误。"]}
{"word":"poalike","summary":{"en":"Polelike (pole-like) means long, thin, and straight like a pole.","zh":"Polelike（pole-like）指“像杆一样细长、笔直”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written “polelike” or “pole-like”) Shaped like a pole: long, straight, and thin.","zh":"（常写作 polelike 或 pole-like）杆状的；像杆一样细长、笔直的。"},"examples":[{"en":"The insect has long, polelike legs.","zh":"这种昆虫有细长的杆状腿。"},{"en":"A pole-like column stood in the center of the room.","zh":"房间中央立着一根杆状立柱。"}]}],"synonyms":["rodlike","sticklike","spindly","elongated"],"phonetic":"/ˈpoʊlˌlaɪk/","extraExplanation":["“poalike”更像是拼写错误；常见正确写法是 **polelike** 或 **pole-like**（表示“像杆一样”）。","英语里 **-like** 是常见后缀，意思是“像……一样”（例如 childlike 像孩子一样，snake-like 像蛇一样）。拼写上有时连写、有时加连字符，取决于写作风格。"]}

