{"word":"Pocahontas","summary":{"en":"Pocahontas was a Powhatan woman in early colonial Virginia and is also a well-known figure in popular culture, often portrayed in romanticized stories.","zh":"宝嘉康蒂是弗吉尼亚早期殖民时期的鲍威坦族女性；她也在流行文化中非常知名，常被浪漫化地讲述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American woman (c. 1596–1617) associated with the Powhatan people in early colonial Virginia; she is known for her connection to English settlers, especially John Smith, and for later marrying John Rolfe.","zh":"宝嘉康蒂（约1596–1617）：北美原住民女性，常与弗吉尼亚早期殖民历史联系在一起；因与英国殖民者（尤其是约翰·史密斯）的故事以及后来与约翰·罗尔夫结婚而知名。"},"examples":[{"en":"Pocahontas is often mentioned in lessons about the early history of Jamestown.","zh":"在讲述詹姆斯敦早期历史的课程中，常会提到宝嘉康蒂。"},{"en":"Many popular stories about Pocahontas mix fact with legend.","zh":"许多关于宝嘉康蒂的流行故事把史实与传说混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"In popular culture (especially film), a romanticized symbol of Native American–European contact; also used as a character name in books, movies, and art.","zh":"在流行文化（尤其是电影）中，被浪漫化为“原住民与欧洲人相遇”的象征；也常作为文学、电影与艺术作品中的角色名。"},"examples":[{"en":"Disney’s Pocahontas introduced the name to many children around the world.","zh":"迪士尼《风中奇缘》（Pocahontas）让世界各地许多孩子认识了这个名字。"},{"en":"Some viewers criticize how the movie portrays Pocahontas and her community.","zh":"一些观众批评电影对宝嘉康蒂及其族群的呈现方式。"}]}],"synonyms":["Matoaka","Rebecca Rolfe","Powhatan"],"phonetic":"/ˌpoʊkəˈhɑːntəs/","extraExplanation":["“Pocahontas”更像是昵称，而非她唯一的本名；史料中她也被记为Matoaka、Amonute，受洗后的名字是Rebecca（Rebecca Rolfe）。","关于她“拯救约翰·史密斯”的情节在史学界争议很大：有学者认为可能被后人夸张，或与当时部族仪式的误解有关。","在学习与讨论此词时，常需要文化敏感度：影视作品为了戏剧性会改编年龄、关系与历史背景，可能弱化原住民真实的历史处境与多样文化。"]}
{"word":"pocan","summary":{"en":"A pecan is an edible nut commonly used in American cooking and desserts.","zh":"pecan 指可食用的山核桃（碧根果）坚果，常用于美式烹饪和甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of nut from the pecan tree, often used in desserts and cooking (for example, pecan pie).","zh":"山核桃（碧根果）坚果；常用于甜点或烹饪（如山核桃派）。"},"examples":[{"en":"She baked a pecan pie for Thanksgiving.","zh":"她为感恩节烤了一个山核桃派。"},{"en":"Add chopped pecans to the salad for extra crunch.","zh":"在沙拉里加一些切碎的山核桃，口感更脆。"}]}],"synonyms":["nut","tree nut"],"phonetic":"/pɪˈkɑn/","extraExplanation":["你输入的“pocan”很可能是拼写错误；常见正确拼写是“pecan”。在美国，“pecan”的读音有地区差异（比如 /pɪˈkɑn/ 或 /ˈpiːkæn/），都常见且不算错。","Pecan 是美国南部很有代表性的食材，尤其常出现在节日甜点（如 Thanksgiving 的 pecan pie）里。"]}
{"word":"pochade","summary":{"en":"A pochade is a quick small painting/sketch (often done outdoors), and it can also mean the portable box used to make such studies.","zh":"pochade 指快速完成的小幅写生/习作（常在户外），也可指用于这类写生的便携写生画箱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quickly made small sketch or painting (often in oils) done on the spot to capture light, color, and mood rather than fine detail.","zh":"（常指油画）在现场快速完成的小幅速写/写生，用来抓住光线、色彩与氛围，而非精细细节。"},"examples":[{"en":"She painted a pochade of the harbor at sunset to record the changing light.","zh":"她画了一幅港口日落的 pochade（小幅写生），用来记录光线的变化。"},{"en":"The artist kept several pochades from his trip and later turned them into larger studio paintings.","zh":"这位画家保存了旅行中画的几幅 pochades，后来把它们发展成更大的工作室作品。"}]},{"partOfSpeech":"n.","definition":{"en":"A small portable painting box or kit used for making quick outdoor oil sketches.","zh":"便携式写生画箱/画具套装，用于户外快速油画写生。"},"examples":[{"en":"He set up his pochade on a rock and mixed colors in the open air.","zh":"他把 pochade（便携写生箱）放在岩石上，在户外调色作画。"},{"en":"A sturdy pochade box is useful for plein-air painting sessions.","zh":"结实的 pochade box 很适合户外写生（plein-air）时使用。"}]}],"synonyms":["sketch","study","oil sketch","plein-air study","pochade box"],"phonetic":"/poʊˈʃɑd/","extraExplanation":["“pochade”来自法语，和“poche（口袋）”有联系，含有“轻便、快速”的感觉。英语里在艺术语境中较常见，尤其在“plein-air（户外写生）”圈子里。","在英语中常见搭配：a pochade of + 场景（a pochade of the mountains）；pochade box（便携写生箱）。","相关词：sketch（草图/速写）、study（习作/练习作）、oil sketch（油画速写）、plein-air painting（户外写生）。"]}
{"word":"pochades","summary":{"en":"Pochades are quick outdoor sketch-paintings, or (in French-style cooking) poached-egg dishes.","zh":"pochades 可指户外快速写生的小画（复数），也可指法式语境中的水波蛋/荷包蛋类菜品（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Art) A small, quickly made painting or color sketch, often done outdoors to capture a scene’s light and mood.","zh":"（艺术）一种小幅的、快速完成的写生画/色彩速写，常在户外创作，用来捕捉光线与氛围。"},"examples":[{"en":"She painted a pochade by the river to capture the evening light.","zh":"她在河边画了一幅小幅写生，捕捉傍晚的光线。"},{"en":"His travel notebook is filled with pochades of streets and cafés.","zh":"他的旅行本里满是街景和咖啡馆的快速写生画。"}]},{"partOfSpeech":"n.","definition":{"en":"(Cooking, from French) A poached egg dish; an egg gently cooked out of its shell in hot liquid (often served as part of a prepared dish).","zh":"（烹饪，源自法语）水波蛋/煮荷包蛋类的菜品；把鸡蛋打散到热液体中温柔加热至凝固（常作为一道菜的一部分呈现）。"},"examples":[{"en":"For brunch, the menu offers salmon with pochade and hollandaise.","zh":"早午餐菜单上有三文鱼配水波蛋和荷兰酱。"},{"en":"He practiced making a clean, round pochade for eggs Benedict.","zh":"他练习做出漂亮圆润的水波蛋来做班尼迪克蛋。"}]}],"synonyms":["sketch","study","plein-air sketch","quick painting","poached egg"],"phonetic":"/poʊˈʃɑd/","extraExplanation":["“pochade”源自法语，英语中多用于艺术语境（指户外快速写生的小画），在烹饪语境里则与法式“pocher（汆/水波煮）”相关。你输入的“pochades”是复数形式，指多幅写生画或多份水波蛋/相关菜品。"]}
{"word":"pochaise","summary":{"en":"“Pochaise” isn’t a standard English word; it’s likely a misspelling (often of “chaise” or “poise”).","zh":"“pochaise”不是标准英语词；多半是拼写错误（常见可能是“chaise”或“poise”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a mistaken spelling of another word (often “chaise” or “poise”).","zh":"不是标准英语单词；通常是拼写错误或把其他词拼错（常见可能是“chaise”或“poise”）。"},"examples":[{"en":"I can’t find “pochaise” in a dictionary—did you mean “chaise” (a long chair) or “poise” (calm self-control)?","zh":"我在词典里找不到“pochaise”——你想写的是“chaise”（躺椅）还是“poise”（沉着/自制）？"},{"en":"Please check the spelling of “pochaise” in your sentence.","zh":"请检查你句子里“pochaise”的拼写。"}]}],"phonetic":"/poʊˈʃeɪz/","extraExplanation":["“pochaise”在常见英语语料和主流词典中基本不收录，因此更像是拼写误差。你可能想表达：\n1) chaise /ʃeɪz/：常见于“chaise lounge”（躺椅、贵妃椅）。\n2) poise /pɔɪz/：表示“沉着、泰然自若”；也可指“平衡”。\n如果你能提供原句或你想表达的中文意思，我可以帮你精准判断应是哪一个词。"]}
{"word":"pochard","summary":{"en":"Pochard can mean a drunkard (less common, literary) or a type of diving duck.","zh":"pochard 可指“酒鬼/醉汉”（较少见、偏文学用法）或“一种潜水鸭（红头潜鸭等）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is often drunk; a drunkard","zh":"酒鬼；醉汉（经常喝醉的人）"},"examples":[{"en":"He was known around the neighborhood as a pochard who drank every night.","zh":"他在邻里间以酒鬼闻名，几乎每晚都喝酒。"},{"en":"The novel portrays him not as a villain, but as a lonely pochard.","zh":"小说把他写成不是坏人，而是一个孤独的醉汉。"}]},{"partOfSpeech":"n.","definition":{"en":"(also pochard) a type of diving duck, especially the common pochard","zh":"（亦作 pochard）一种潜水鸭，尤指红头潜鸭（common pochard）"},"examples":[{"en":"We spotted a pochard diving for food near the reeds.","zh":"我们看到一只潜水鸭在芦苇旁潜水觅食。"},{"en":"In winter, pochards gather on large lakes.","zh":"冬天时，红头潜鸭常聚集在大湖上。"}]}],"synonyms":["drunkard","alcoholic","drunk","common pochard","diving duck"],"phonetic":"/ˈpoʊtʃɑrd/","extraExplanation":["“pochard”表示“酒鬼/醉汉”在现代英语里较少见，常见同义词有“drunk”“drunkard”“alcoholic”（注意 alcoholic 更偏向“酒精依赖者/酗酒者”的医学或社会语境）。在写作中用 pochard 往往带有较强的文学或古旧色彩。","同形异义：同一个拼写的 pochard 也可指一种鸭。阅读时可通过上下文判断：若出现 lake、bird、duck、diving 等词，通常是“鸭”；若出现 drink、bar、drunk 等词，通常是“酒鬼”。"]}
{"word":"pochards","summary":{"en":"“Pochards” means diving ducks of the pochard type (plural).","zh":"“pochards”指“pochard”这种潜水鸭的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) A type of diving duck (a “pochard”), especially one of several Eurasian or North American species.","zh":"（复数）一种潜水鸭（pochard），尤指欧亚或北美的若干物种。"},"examples":[{"en":"In winter, the lake fills with pochards and other diving ducks.","zh":"冬天时，湖里会出现成群的pochard潜水鸭和其他潜水鸭。"},{"en":"Birdwatchers counted more than fifty pochards near the reeds.","zh":"观鸟者在芦苇附近数到了五十多只pochard。"}]}],"synonyms":["diving ducks","Aythya ducks"],"phonetic":"/ˈpoʊtʃɑrdz/","extraExplanation":["“pochard”在日常英语中不算常见，更常出现在观鸟、自然纪录片、生态研究等语境。","在英式语境里，常指“Common Pochard（红头潜鸭，Aythya ferina）”；在北美语境中，也可能泛指同属的潜鸭类（如canvasback、redhead等近缘种），具体要看上下文。"]}
{"word":"pochay","summary":{"en":"“Pochay” is a nonstandard spelling usually referring to a Korean “pocha,” a street tent bar selling snacks and drinks.","zh":"“pochay”多为非标准拼写，通常指韩式“pocha（포차）”——卖小吃和酒的路边帐篷小酒馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Korean loanword, informal) A Korean street tent bar or casual late-night snack-and-drinks stall; short for “pojangmacha.”","zh":"（韩语外来词，非正式）韩国的路边帐篷小酒馆/大排档式小摊，常卖下酒菜和烧酒；是“pojangmacha（포장마차）”的简称。"},"examples":[{"en":"Let’s go to a pocha after work for soju and tteokbokki.","zh":"下班后我们去pocha喝烧酒、吃炒年糕吧。"},{"en":"We ended the night at a pocha, eating spicy fish cake soup.","zh":"我们在pocha结束了夜晚，吃着辣鱼糕汤。"}]}],"synonyms":["pocha","pojangmacha","Korean street tent bar"],"phonetic":"/ˈpoʊ.tʃɑː/","extraExplanation":["“pochay”并不是常见的英语标准拼写，更常见的写法是 **pocha**，也会写成 **pojjangmacha/pojangmacha**（포장마차）。如果你是在聊天或字幕里看到“pochay”，很可能是按发音随意拼出来的。","使用场景：在英语里多出现在谈韩国文化/旅行/美食的语境中，属于文化借词，通常不用于正式写作。","相关词：**soju**（烧酒）、**anju**（下酒菜）、**street food**（街头小吃）、**night market**（夜市，概念接近但不完全等同）。"]}
{"word":"poche","summary":{"en":"“poche” most often refers to French-style “poché/poached” in cooking, or to “poché” meaning a shaded solid ‘pocket’ area in architectural plans.","zh":"“poche”最常见指烹饪中的“水煮/轻煮（poché/poached）”，或建筑平面图中阴影表示的实体“填充区/厚墙口袋空间”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Cooking) Poached; cooked gently in hot liquid (a less common spelling of “poché”).","zh":"（烹饪）水煮的、轻煮的（较少见的拼写，相当于“poché/poached”）。"},"examples":[{"en":"Serve the salmon poche with a light lemon sauce.","zh":"把水煮三文鱼配上清淡的柠檬酱汁。"},{"en":"A poche egg (poached egg) is soft and delicate.","zh":"水煮蛋口感柔软细嫩。"}]},{"partOfSpeech":"n.","definition":{"en":"(Architecture/Design) A “pocket” or solid-filled area in a plan drawing, often shown by shading; a thickened part of a wall that contains stairs, storage, or services.","zh":"（建筑/设计）平面图中用阴影表示的“实体/填实”区域；墙体加厚、用来容纳楼梯、储藏或管线等的部分。"},"examples":[{"en":"The stairs are placed inside the poche to keep the main rooms open.","zh":"楼梯被安置在“实体区”里，以保持主要房间的开敞。"},{"en":"In the plan, the dark shading shows the wall’s poche.","zh":"在平面图里，深色阴影表示墙体的实体部分。"}]},{"partOfSpeech":"v.","definition":{"en":"(Cooking, uncommon) To poach (cook gently in hot liquid).","zh":"（烹饪，少见）水煮；用热液小火轻煮。"},"examples":[{"en":"You can poche the fruit in spiced syrup.","zh":"你可以把水果放在加香料的糖浆里轻煮。"}]}],"synonyms":["poached","poché","poach","solid zone (architecture)","pocket (architecture)"],"phonetic":"/poʊˈʃeɪ/","extraExplanation":["“poché/poche”来自法语，原意与“口袋/凹槽”有关；在烹饪语境中指“在液体里轻柔煮熟”，在建筑语境中则发展为“图纸上以阴影表示的实体厚墙/填充区”。","英语里更常见的拼写是烹饪用“poached / poch\u0000e9”，建筑用名词“poch\u0000e9”。如果你在菜单或建筑书里看到“poche”，通常就是这两类用法之一。"]}
{"word":"pochette","summary":{"en":"Pochette is a French-derived noun meaning either a small clutch handbag or, less commonly, a pocket-sized violin.","zh":"pochette 源自法语，作名词可指小手拿包；较少见时也指袖珍小提琴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small clutch purse or envelope-style handbag (often used for evenings or formal events)","zh":"（常用于晚宴或正式场合的）小手拿包、信封包"},"examples":[{"en":"She carried a black pochette with a gold clasp to the wedding.","zh":"她去参加婚礼时拿了一个带金色搭扣的黑色手拿包。"},{"en":"Keep your phone and keys in your pochette so your hands are free.","zh":"把手机和钥匙放进你的小手拿包里，这样手就空出来了。"}]},{"partOfSpeech":"n.","definition":{"en":"a very small violin (a “pocket fiddle”), historically used by dance teachers to play while moving","zh":"（历史上舞蹈老师使用的）口袋小提琴、袖珍小提琴"},"examples":[{"en":"In the museum, they displayed a pochette used by 18th-century dance masters.","zh":"在博物馆里，他们展出了一把18世纪舞蹈老师用过的袖珍小提琴。"},{"en":"The performer demonstrated how a pochette could fit under the arm like a normal violin.","zh":"表演者展示了袖珍小提琴如何像普通小提琴一样夹在臂下演奏。"}]}],"synonyms":["clutch","small purse","handbag","pocket violin"],"phonetic":"/poʊˈʃɛt/","extraExplanation":["“pochette”来自法语，原意与“口袋/小袋子”有关，所以在英语里常指“很小、便于携带的东西”。在时尚语境中更常见的是“手拿包”；在音乐史语境中则指舞蹈老师携带的袖珍小提琴。","使用提醒：英语里它比较偏“借词/时尚或专业用语”，日常口语更常说“clutch”或“small purse”。"]}
{"word":"pochettino","summary":{"en":"Pochettino: the surname commonly referring to Mauricio Pochettino, an Argentine soccer manager and former player.","zh":"Pochettino：通常指阿根廷足球教练、前球员毛里西奥·波切蒂诺的姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Mauricio Pochettino (full name: Mauricio Roberto Pochettino), an Argentine professional soccer (football) manager and former player, known for coaching top European clubs.","zh":"波切蒂诺（全名 Mauricio Roberto Pochettino），阿根廷职业足球教练、前职业球员，以执教欧洲顶级俱乐部而知名。"},"examples":[{"en":"Pochettino is known for developing young players and building high-energy teams.","zh":"波切蒂诺以培养年轻球员、打造高强度球队而闻名。"},{"en":"Many fans discuss whether Pochettino’s tactics fit the club’s style.","zh":"很多球迷在讨论波切蒂诺的战术是否适合俱乐部风格。"}]}],"synonyms":["Mauricio Pochettino"],"phonetic":"/ˌpoʊtʃəˈtiːnoʊ/","extraExplanation":["“Pochettino”是人名（姓氏），在体育新闻中常直接用来指这位教练本人；更正式时会写作“(Mauricio) Pochettino”。","英语转写读音可能因地区而略有差异；你也可能在英媒看到更偏英式的读法。","常见搭配：Pochettino’s tactics（波切蒂诺的战术）、Pochettino era（波切蒂诺时代）、Pochettino appointed as head coach（波切蒂诺被任命为主教练）。"]}
{"word":"pochismo","summary":{"en":"Pochismo is a Spanish term often used in Chicano/Mexican contexts to describe English-influenced Spanish or a perceived “overly Americanized” cultural orientation.","zh":"Pochismo 常用于奇卡诺/墨西哥语境，指受英语影响的西班牙语（或西英混用），也可指被认为“过度美国化”的文化取向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chicano/Mexican Spanish) The use of English-influenced Spanish (or mixed Spanish and English), often viewed as “nonstandard” or overly Americanized.","zh":"（奇卡诺/墨西哥西语语境）指受英语影响的西班牙语用法（或西英混用），常被认为“不够规范”或“太美国化”。"},"examples":[{"en":"Some people criticize pochismo, but others see it as a natural bilingual style.","zh":"有些人批评 pochismo，但也有人认为这是一种自然的双语表达方式。"},{"en":"Her Spanish has some pochismo—English word order shows up in her sentences.","zh":"她的西班牙语带点 pochismo——句子里会出现英语式语序。"}]},{"partOfSpeech":"n.","definition":{"en":"A preference for U.S./American culture, behavior, or identity over Mexican culture, sometimes used as a critical label.","zh":"指更偏向美国文化/行为/身份而非墨西哥文化的倾向，有时带批评意味。"},"examples":[{"en":"He was teased for ‘pochismo’ because he didn’t know many Mexican traditions.","zh":"他因为不太了解墨西哥传统而被取笑有“pochismo”。"},{"en":"The word can be sensitive, so it’s better to ask people how they describe their identity.","zh":"这个词可能比较敏感，所以更好的做法是问对方如何描述自己的身份。"}]}],"synonyms":["Spanglish","code-switching","English-influenced Spanish","Americanization (context-dependent)"],"phonetic":"/poʊˈtʃizmoʊ/","extraExplanation":["“Pochismo”来自西语词根“pocho/pocha”，在美墨边境与奇卡诺社群中常用来描述“英语化/美国化”的语言或文化表现。语气可能带贬义（指不‘正宗’），但也有人将其视为双语与移民经验的自然结果。","在课堂或写作中使用时，最好交代语境（语言现象 vs. 文化评价），并避免用它给个人贴标签。更中性的说法可用：“code-switching（语码转换）”、“Spanglish（西英混合语）”、“English-influenced Spanish（受英语影响的西语）”。"]}
{"word":"pochoir","summary":{"en":"Pochoir is a stencil-based art/printing method (and sometimes the stencil itself) used to apply vivid color through cut-out templates.","zh":"Pochoir 指一种通过切割模板来上色的艺术/印刷方法（有时也指模板本身），以获得鲜明、平涂的色块效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stencil or stencil-based technique, especially a French art/printing method where color is applied through carefully cut stencils to create rich, flat areas of color.","zh":"（尤指法式的）模板；漏印法/模板着色法：通过切割好的模板上色，以形成饱满、平涂的色块效果。"},"examples":[{"en":"The illustrator finished the fashion plate using the pochoir technique to get bright, clean colors.","zh":"这位插画家用漏印法完成了这张时装画，以获得鲜艳、干净的色彩。"},{"en":"Collectors prize early 20th‑century pochoir prints for their vivid, hand-applied color.","zh":"收藏家很看重20世纪初的漏印版画，因为它们的色彩鲜明，而且多为手工上色。"}]}],"synonyms":["stencil","stenciling","stencil printing"],"phonetic":"/pɔʊˈʃwɑr/","extraExplanation":["“Pochoir”来自法语，字面意思与“模板/镂空板”有关。英语里多用于艺术与印刷语境，常与20世纪初法国时尚插画、装饰艺术（Art Deco）出版物联系在一起。","与一般“stencil（模板）”相比，pochoir 常强调一种较精细的手工上色流程：为不同颜色分别制作模板，逐层涂刷或印染，因此成品色块边缘清晰、颜色饱和。"]}
{"word":"pochote","summary":{"en":"A tropical Central American tree (often a type of *Ceiba*) known for a spiny trunk.","zh":"一种中美洲常见的热带树（常指木棉属 *Ceiba* 的一种），以树干多刺而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree native to Mexico and Central America (often a type of silk-cotton tree, especially *Ceiba aesculifolia*), known for its spiny trunk and use in local crafts and traditional medicine","zh":"一种原产于墨西哥和中美洲的热带树木（常指一种木棉科/木棉属的树，尤指 *Ceiba aesculifolia*），以树干多刺著称，并在当地工艺与传统疗法中有用途"},"examples":[{"en":"We saw a pochote tree with a spiny trunk on our hike in Oaxaca.","zh":"我们在瓦哈卡徒步时看见一棵树干长满刺的 pochote（波乔特）树。"},{"en":"In some regions, people use pochote wood to make small carvings.","zh":"在一些地区，人们会用 pochote 的木材制作小型雕刻品。"}]}],"synonyms":["Ceiba (type)","silk-cotton tree (type)","pochote tree"],"phonetic":"/poʊˈtʃoʊteɪ/","extraExplanation":["“pochote”是西班牙语地区常用的地方名词，在英语中也多以外来词形式出现，主要用于旅行、植物学、民俗文化等语境。","不同国家或地区对“pochote”所指的树种可能略有差异，但最常见的指称之一是木棉属（*Ceiba*）的某些物种，因此有时会被解释为“silk-cotton tree（木棉/吉贝）的一种”。","读音在英语里常近似“poh-CHOH-tay”，但也会因说话者的西语背景而变化。"]}
{"word":"pocill","summary":{"en":"“pocill” is not a standard English word; it’s likely a misspelling or a proper noun. Share a sentence or the intended meaning and I’ll identify the correct word.","zh":"“pocill” 不是标准英语单词；更可能是拼写错误或专有名词。给我一个例句或你想表达的意思，我可以帮你找到正确单词。"},"extraExplanation":["“pocill” 不是常见的英语单词，通常在词典里查不到。很可能是拼写错误或专有名词（人名/品牌/地名）。","你可能想写的是以下之一（请告诉我你想表达的意思或给我一个句子，我可以帮你确定）：\n- pencil /ˈpɛn.səl/（铅笔）\n- possible /ˈpɑsəbəl/（可能的）\n- council /ˈkaʊn.səl/（委员会）\n- consul /ˈkɑn.səl/（领事）\n- Pocill（如果是品牌或用户名，可能需要上下文确认）"]}
{"word":"pocilliform","summary":{"en":"Pocilliform means “cup-shaped,” mainly used in scientific descriptions.","zh":"pocilliform 意为“杯状的”，主要用于科学性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cup-shaped; resembling a small cup or goblet (often used in biology, botany, and anatomy).","zh":"杯状的；像小杯子/小酒杯一样的（常用于生物学、植物学和解剖学）。"},"examples":[{"en":"Under the microscope, the spores appeared pocilliform.","zh":"在显微镜下，这些孢子呈杯状。"},{"en":"Some corals form pocilliform structures that help channel water flow.","zh":"有些珊瑚会形成杯状结构，有助于引导水流。"}]}],"synonyms":["cup-shaped","goblet-shaped","caliciform"],"phonetic":"/pɑˈsɪlɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *pocillum*（“小杯子”）+ *-form*（“……形状的”）。因此 *pocilliform* 直译就是“杯形的”。","使用场景：这是偏学术/技术性的形容词，常见于论文、物种描述或实验报告中。日常英语里更常用 *cup-shaped*。"]}
{"word":"pock","summary":{"en":"“Pock” means a small pit/mark on skin (often from disease) or, as a verb, to make a surface covered with small pits.","zh":"“pock”指皮肤上的小凹坑/疤痕（常由疾病造成），也可作动词表示使表面布满小坑/斑点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pit or hole in the skin (often from disease like acne or chickenpox).","zh":"（皮肤上的）小凹坑/小疤痕（常由痘痘、水痘等造成）。"},"examples":[{"en":"He still has a few pocks on his cheeks from severe acne.","zh":"他脸颊上还留着一些严重痘痘造成的小凹坑。"},{"en":"Old photos show pock marks that people got after smallpox.","zh":"老照片里能看到人们感染天花后留下的凹坑疤痕。"}]},{"partOfSpeech":"n.","definition":{"en":"A disease that causes spots or pustules on the skin (now mainly seen in set phrases like “smallpox” or “chickenpox”).","zh":"起疱疹/斑点的疾病（现在多见于固定搭配，如 smallpox 天花、chickenpox 水痘）。"},"examples":[{"en":"Before vaccines, smallpox was one of the deadliest poxes.","zh":"在疫苗出现之前，天花是最致命的“痘病”之一。"},{"en":"Chickenpox is common in childhood, though vaccines have reduced it.","zh":"水痘过去在儿童中很常见，不过疫苗已大大减少了它。"}]},{"partOfSpeech":"vt.","definition":{"en":"To mark something with small pits or spots; to damage a surface by making many small holes.","zh":"使……布满小坑/斑点；使表面出现许多小凹点（造成损伤）。"},"examples":[{"en":"Hail pocked the car’s hood with tiny dents.","zh":"冰雹把车头盖砸出了密密麻麻的小凹点。"},{"en":"Rust can pock the metal if you don’t protect it.","zh":"如果不做防护，铁锈会让金属表面出现麻点般的坑蚀。"}]}],"synonyms":["pit","mark","scar","pockmark","dimple (sometimes)","dent (for surfaces)"],"phonetic":"/pɑk/","extraExplanation":["“pock”这个词常让人联想到传染病的疤痕，尤其是历史上的“smallpox（天花）”。英语里更常用复数“pockmarks（麻子/凹坑疤痕）”来指皮肤上的坑洞疤痕。","和“pox”有关的词在现代英语里多出现在固定搭配或较正式/历史语境中；日常描述痘疤更常说 “acne scars（痘疤）” 或 “pitted scars（凹陷疤痕）”。"]}
{"word":"pocked","summary":{"en":"Pocked means covered with many small pits or marks; it can also be the past form of “pock.”","zh":"pocked 指“布满小坑或斑点的”；也可作动词 pock 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Covered with many small holes, pits, or marks (often from disease, acne, or damage).","zh":"（形容词）布满小洞、小坑或斑点的（常指因疾病、痘痕、腐蚀或损伤造成）。"},"examples":[{"en":"The moon’s surface is pocked with craters.","zh":"月球表面布满了陨石坑。"},{"en":"His cheeks were pocked from years of acne.","zh":"他的脸颊因多年痤疮留下了凹凸的痘痕。"},{"en":"The old metal was pocked by rust.","zh":"旧金属被铁锈腐蚀得坑坑洼洼。"}]},{"partOfSpeech":"v.","definition":{"en":"(V.) Past tense/past participle of pock: to damage or mark something with small pits or spots.","zh":"（动词）pock 的过去式/过去分词：使……出现小坑或斑点；使……受损并留下凹点。"},"examples":[{"en":"Hail pocked the car’s paint in minutes.","zh":"冰雹几分钟内就把车漆砸得满是小坑。"},{"en":"The walls were pocked by shrapnel.","zh":"墙壁被弹片打得满是坑洞。"}]}],"synonyms":["pitted","scarred","cratered","dimpled","marked"],"phonetic":"/pɑkt/","extraExplanation":["“pock”原指天花（smallpox）留下的“痘疤/麻子”，所以“pocked”常带有“表面被破坏、凹凸不平”的画面感。现代也常用于自然表面（如月球、道路）或金属被腐蚀后的“麻点/坑蚀”（pitting）。"]}
{"word":"pocket","summary":{"en":"“Pocket” most commonly means the small pouch in clothing for carrying items; it can also mean a small separate area, or the verb “to put/keep (often money) in your pocket,” and the adjective “pocket-sized.”","zh":"“Pocket”最常见意思是衣服上的口袋；也可指零星的小范围区域；作动词可表示把东西揣进口袋或（尤指钱）据为己有；作形容词可表示“袖珍的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small sewn pouch in clothing (or a bag) used to carry small things.","zh":"（衣服或包上的）口袋，小袋，用来装随身小物。"},"examples":[{"en":"I put my keys in my pocket.","zh":"我把钥匙放进了口袋。"},{"en":"This jacket has three pockets.","zh":"这件夹克有三个口袋。"}]},{"partOfSpeech":"n.","definition":{"en":"A small amount or space; a small area that is separate from what surrounds it.","zh":"小范围；一小块与周围不同/相对独立的区域。"},"examples":[{"en":"There are pockets of cold air moving in tonight.","zh":"今晚有零星的冷空气移入。"},{"en":"The city has pockets of quiet neighborhoods.","zh":"这座城市里有一些安静社区的“片区”。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put something into your pocket; to take and keep (often money), sometimes in a dishonest way.","zh":"把……装进口袋；（常指钱）据为己有/中饱私囊（有时含不诚实之意）。"},"examples":[{"en":"He pocketed the change and walked away.","zh":"他把零钱揣进口袋就走了。"},{"en":"The company was accused of pocketing public funds.","zh":"这家公司被指控侵吞公款。"}]},{"partOfSpeech":"adj.","definition":{"en":"Small and easy to carry; designed to fit in a pocket.","zh":"袖珍的；便于携带、可以放进口袋的。"},"examples":[{"en":"She carries a pocket dictionary when traveling.","zh":"她旅行时随身带一本袖珍词典。"},{"en":"This pocket-sized notebook is perfect for quick notes.","zh":"这本袖珍笔记本很适合随手记。"}]}],"synonyms":["pouch","compartment","stash","small","portable"],"phonetic":"/ˈpɑkət/","extraExplanation":["“Pocket”常出现在固定搭配中：out of pocket 可指“自掏腰包/自费”，也可指“暂时联系不上/不在状态”；in someone’s pocket 可指“被某人控制或收买”（语气偏负面），也可字面表示“在某人的口袋里”。","文学与文化里，pocket 常用来象征“私人物品、秘密或个人资源”。例如在小说中写 someone reached into his pocket 往往暗示他要拿出钱、钥匙、信件或关键线索。"]}
{"word":"pocketable","summary":{"en":"“Pocketable” describes something small enough to fit in your pocket and easy to carry.","zh":"“Pocketable”形容物品小巧到能放进口袋里，便于随身携带。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Small and convenient enough to fit in a pocket and be carried easily.","zh":"小巧到可以放进口袋里、便于随身携带的。"},"examples":[{"en":"This pocketable flashlight is perfect for emergencies.","zh":"这款可放进口袋的小手电很适合应急使用。"},{"en":"I prefer a pocketable notebook for quick notes on the train.","zh":"我更喜欢带一本可放进口袋的小笔记本，方便在地铁上随手记录。"}]}],"synonyms":["portable","compact","handy","travel-size"],"phonetic":"/ˈpɑːkɪtəbəl/","extraExplanation":["“pocketable”是由“pocket（口袋）+ -able（能够……的）”构成的形容词，常见于产品描述与评测（如电子产品、工具、随身物品），强调“便携、易携带”。","在消费电子领域里，它常与“portable（便携的）”对比：portable强调“容易搬运/携带”，pocketable更具体，强调“大小真的能放进口袋”。"]}
{"word":"pocketableness","summary":{"en":"Pocketableness means how easy something is to carry in a pocket (its pocketability).","zh":"pocketableness 指某物是否便于放入口袋携带（便携性/口袋适配度）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being small, light, and convenient enough to fit in a pocket; pocketability.","zh":"可放入口袋的特性；便携性（尤指大小、重量适合放进口袋）。"},"examples":[{"en":"The pocketableness of this recorder makes it easy to carry every day.","zh":"这台录音器的可放入口袋特性让它每天携带都很方便。"},{"en":"They praised the phone’s pocketableness compared with older models.","zh":"和旧机型相比，他们称赞这款手机更便于放进口袋。"}]}],"synonyms":["pocketability","portability","pocket-friendliness","handiness"],"phonetic":"/ˈpɑkɪtəbəlnəs/","extraExplanation":["“pocketableness”不是最常见的标准词，更多见于口语、评测或写作中的临时造词，用来强调某物“是否真正适合放口袋”。更常用的表达是“pocketability / pocket-friendly / pocket-sized”。","构词上：pocket（口袋）+ -able（可…的）→ pocketable（可放进口袋的）+ -ness（名词后缀，表示性质）→ pocketableness（这种性质）。"]}
{"word":"pocketbook","summary":{"en":"Pocketbook usually means a woman’s handbag in American English, and it can also mean a small book or handbook that fits in your pocket.","zh":"pocketbook 通常指（美式英语）女用手提包；也可指可放入口袋的袖珍小册子或手册。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small book or guide that can fit in your pocket; a handbook.","zh":"可以放入口袋的小册子；袖珍指南/手册。"},"examples":[{"en":"I bought a pocketbook on local birds before my trip.","zh":"旅行前我买了一本关于当地鸟类的袖珍指南。"},{"en":"The museum sells a pocketbook with short explanations of the paintings.","zh":"博物馆出售一本带有简短画作说明的袖珍手册。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in American English) a woman’s handbag; a purse.","zh":"（尤指美式英语）女用手提包；钱包/手袋。"},"examples":[{"en":"She put her keys back in her pocketbook.","zh":"她把钥匙放回手提包里。"},{"en":"My grandma always called a handbag a “pocketbook.”","zh":"我奶奶总把手提包叫作“pocketbook”。"}]}],"synonyms":["handbag","purse","small book","handbook","guidebook"],"phonetic":"/ˈpɑːkɪtˌbʊk/","extraExplanation":["在美式英语里，pocketbook 常指“女用手提包”，听起来稍微偏传统或年长一代的用法；更中性的常用词是 handbag（手提包）或 purse（在美式里也常指女包；在英式里 purse 更常指小钱包）。","词源上可理解为“装在口袋里的小书（pocket + book）”，因此也会引申为“袖珍手册/小册子”。具体意思通常靠上下文判断。"]}
{"word":"pocketbooks","summary":{"en":"Pocketbooks can mean small portable books/booklets, or (in U.S. English) women’s handbags/purses.","zh":"Pocketbooks 可指便携的小册子/小开本书，也可指（美式）女士手提包/钱包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small books or booklets designed to be portable; also a small paperback book.","zh":"可随身携带的小册子/小书；也可指小开本的平装书。"},"examples":[{"en":"The guide came in several pocketbooks you could carry on the trip.","zh":"这本指南分成几本便携的小册子，旅行时可以随身带。"},{"en":"She bought pocketbooks of classic stories for the train ride.","zh":"她买了几本小开本的经典故事书，在火车上看。"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S.) Women’s handbags; purses.","zh":"（美式）女用手提包；钱包（常指女士用的包）。"},"examples":[{"en":"Her pocketbooks were lined up neatly in the closet.","zh":"她的手提包整齐地摆在衣橱里。"},{"en":"In American English, some people say “pocketbook” instead of “purse.”","zh":"在美式英语里，有些人用 pocketbook 来代替 purse。"}]}],"synonyms":["purse","handbag","booklet","paperback"],"phonetic":"/ˈpɑkɪtˌbʊks/","extraExplanation":["“pocketbook”在美式英语里更偏传统/地区性用法，现代口语中更常听到“purse”（女包）或“handbag”。在英式英语里，“pocketbook”更常见的是“袖珍本书/小册子”的意思。"]}
{"word":"pocketcase","summary":{"en":"A small case you carry in your pocket for holding small personal items; sometimes used for a protective pocket case (e.g., for a phone).","zh":"可放入口袋随身携带的小盒子，用来装小物件；有时也指口袋用保护套（如手机套）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small case designed to be carried in a pocket, used to hold small items (such as cigarettes, cards, tools, or personal accessories).","zh":"口袋盒；随身小盒（放在口袋里携带，用来装香烟、卡片、小工具或个人小物件）。"},"examples":[{"en":"He pulled a pocketcase from his jacket and offered her a business card.","zh":"他从外套里掏出一个口袋盒，递给她一张名片。"},{"en":"She keeps a tiny sewing kit in a pocketcase when she travels.","zh":"她旅行时会在口袋盒里放一个迷你针线包。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A protective case for something that goes in a pocket, especially a mobile phone or similar device.","zh":"（较少见）口袋用保护套（尤指手机等随身设备的保护套）。"},"examples":[{"en":"This pocketcase keeps the phone from getting scratched by keys.","zh":"这个口袋保护套能防止手机被钥匙刮花。"}]}],"synonyms":["pocket case","case","card case","cigarette case","carry case"],"phonetic":"/ˈpɑkətˌkeɪs/","extraExplanation":["“pocketcase”更常见的写法是两个词：pocket case。历史上常指绅士随身携带的小盒子，可装烟草、名片、小刀或针线等，属于一种旧式随身用品用语。现代英语里更常用更具体的词，如 card case（名片盒）、cigarette case（烟盒）、phone case（手机壳）。"]}
{"word":"pocketed","summary":{"en":"“Pocketed” usually means “put into a pocket,” and it can also mean “kept for yourself (sometimes dishonestly)” or “accepted without protest.”","zh":"“Pocketed”通常指“放进口袋里”，也可指“据为己有（常含私吞之意）”或“忍下不反击”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of **pocket**: to put something into your pocket, especially quickly or casually.","zh":"**pocket** 的过去式/过去分词：把某物放进口袋里（常指迅速、随手地放）。"},"examples":[{"en":"He pocketed the key and walked away.","zh":"他把钥匙塞进口袋里就走开了。"},{"en":"She quietly pocketed her phone before the meeting started.","zh":"会议开始前，她悄悄把手机放进口袋里。"}]},{"partOfSpeech":"vt.","definition":{"en":"To take and keep something for yourself (often dishonestly); to steal or embezzle.","zh":"把（钱或物）据为己有（常含不诚实之意）；侵吞、挪用、偷走。"},"examples":[{"en":"The cashier pocketed the extra cash instead of putting it in the register.","zh":"收银员没有把多出来的现金放进收银机，而是私吞了。"},{"en":"He was accused of pocketing donations meant for the charity.","zh":"他被指控侵吞原本要捐给慈善机构的款项。"}]},{"partOfSpeech":"vt.","definition":{"en":"To accept something (especially an insult, loss, or criticism) without fighting back; to swallow/put up with it.","zh":"忍下（侮辱、失败或批评等）而不反击；把委屈咽下去。"},"examples":[{"en":"He pocketed the insult and kept working.","zh":"他忍下那句侮辱，继续工作。"},{"en":"The team pocketed the loss and focused on the next game.","zh":"球队接受了失利，把注意力放到下一场比赛上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Adjective use: kept in a pocket; small/portable (often in compounds like “pocket-sized”).","zh":"作形容词：放在口袋里的；小巧便携的（常见于合成词如 pocket-sized）。"},"examples":[{"en":"He pulled out a pocketed notebook from his jacket.","zh":"他从夹克里掏出一本放在口袋里的小笔记本。"}]}],"synonyms":["stashed","tucked away","appropriated","embezzled","swallowed"],"phonetic":"/ˈpɑkətɪd/","extraExplanation":["“pocketed”最常见是动词 pocket 的过去式/过去分词。语境不同含义差别很大：\n1) 中性：把东西放进口袋；\n2) 负面：把钱“装进自己口袋”→私吞/挪用；\n3) 比喻：把怒气或侮辱“收起来”→忍下不反击。\n阅读时可重点看宾语：key/phone（中性），cash/donations（可能不诚实），insult/loss（比喻忍受）。"]}
{"word":"pocketer","summary":{"en":"A “pocketer” is a person who puts something in a pocket—most often used to mean someone who secretly steals small items.","zh":"“pocketer”指把东西装进口袋的人；最常用来指偷偷顺走小物品的扒手/小偷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who puts something into a pocket, especially someone who secretly takes money or small items (a thief)","zh":"把东西放进口袋的人；尤指偷偷把钱或小物品“顺走”的人（小偷）"},"examples":[{"en":"The store’s security guard caught a pocketer slipping a phone into his coat pocket.","zh":"商店的保安抓到一个人把手机偷偷塞进外套口袋。"},{"en":"She felt her bag open and realized a pocketer was nearby.","zh":"她感觉包被打开了，意识到附近可能有扒手。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) someone who keeps money or benefits for themselves instead of sharing or reporting it","zh":"（少见）把钱或好处据为己有的人；私吞者"},"examples":[{"en":"The audit revealed a pocketer who had been keeping small fees for years.","zh":"审计发现有人多年来一直把小额费用私吞。"}]}],"synonyms":["pickpocket","thief","stealer","embezzler (context-dependent)"],"phonetic":"/ˈpɑkɪtər/","extraExplanation":["“pocketer”由 pocket（口袋）+ -er（做某事的人）构成，但在现代英语里并不常用。表示“扒手/小偷”时，更常见、更自然的词是 pickpocket。","在新闻或法律语境中，如果想表达“私吞/中饱私囊”，更常见的说法是 embezzler（侵吞公款者）或 someone who pocketed the money（把钱装进自己口袋的人）。"]}
{"word":"pocketers","summary":{"en":"“Pocketers” means people who pocket things—sometimes implying stealing or taking money for themselves. It’s uncommon; “pickpockets” is the usual word for thieves who steal from pockets.","zh":"“pocketers”指把东西装进口袋的人，也常含“私自拿走/私吞”的意思；该词不常见，表示“扒手”更常用“pickpockets”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who pocket things—either by putting something into a pocket, or (informal) by secretly taking/stealing something for themselves.","zh":"把东西装进口袋的人；也可指（非正式）把东西私自占为己有、顺手拿走的人（带有“偷拿/私吞”的含义）。"},"examples":[{"en":"After the game, a few pocketers quietly slipped the loose change into their jackets.","zh":"比赛结束后，有几个人悄悄把散落的零钱塞进了外套口袋。"},{"en":"The store hired extra security to watch for pocketers near the entrance.","zh":"商店雇了更多保安在入口附近留意那些可能偷拿东西的人。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of pocketer (rare): someone who routinely pockets money or benefits for personal gain.","zh":"pocketer 的复数（较少见）：经常把钱或好处“装进自己口袋里”（中饱私囊）的人。"},"examples":[{"en":"The report accused the officials of being pocketers of public funds.","zh":"报告指责这些官员中饱私囊、侵吞公款。"}]}],"synonyms":["pickpockets","thieves","shoplifters","embezzlers","people who pocket money"],"phonetic":"/ˈpɑkɪtərz/","extraExplanation":["“pocketers”在真实英语中不算常见。日常更常见的是：\n- “pickpockets”（扒手），特指从别人身上偷东西的人；\n- “people who pocket money / pocket the cash”（把钱装进自己口袋里/私吞），更像动词用法。\n如果你想表达“扒手”，通常用“pickpockets”更自然。"]}
{"word":"pocketful","summary":{"en":"“Pocketful” means a pocket’s worth—often a small amount of money or small items.","zh":"“Pocketful”指“一口袋的量”，常指少量的钱或小物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A full pocket’s worth (a small amount) of something, especially money or small items.","zh":"满满一口袋（的量）；一口袋的（东西），常指少量的钱或小物品。"},"examples":[{"en":"He arrived with only a pocketful of change.","zh":"他到的时候身上只有一口袋零钱。"},{"en":"She picked a pocketful of wildflowers.","zh":"她摘了一口袋野花。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In compounds like “pocketful of…”) Having a pocket filled with something; carrying a pocket’s worth.","zh":"（常用于“pocketful of…”结构）口袋里装着……的；带着一口袋的……。"},"examples":[{"en":"He walked in, pocketful of receipts, looking tired.","zh":"他走进来，口袋里塞满收据，看起来很疲惫。"},{"en":"Kids ran home pocketful of candy after the parade.","zh":"游行结束后，孩子们口袋里装满糖果跑回家。"}]}],"synonyms":["handful","pocket-load","small amount","a bit"],"phonetic":"/ˈpɑkətˌfʊl/","extraExplanation":["“pocketful”由 pocket（口袋）+ -ful（“充满……的”“……的量”）组成，表示“一个口袋能装下的量”。常见搭配是“a pocketful of + 名词”。","语感上它经常暗示“数量不大但拿在身边很方便”的感觉，尤其说钱时带点口语、生活化。"]}
{"word":"pocketfuls","summary":{"en":"Pocketfuls means “amounts that fill a pocket,” often used literally for small items or figuratively for lots of money.","zh":"Pocketfuls 指“装满口袋的量（复数）”，可字面指很多小物件，也可比喻指很多钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural of pocketful: an amount that fills a pocket; a pocketful of something.","zh":"pocketful 的复数：一口袋（能装满口袋的量）；一口袋的某物。"},"examples":[{"en":"He came home with pocketfuls of coins.","zh":"他回家时口袋里装满了一把把硬币。"},{"en":"The kids ran around with pocketfuls of candy after the parade.","zh":"游行结束后，孩子们兜里装着一把把糖果到处跑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A large amount of something, especially money.","zh":"（比喻）很多（尤指很多钱）。"},"examples":[{"en":"That company has pocketfuls of cash to spend on advertising.","zh":"那家公司有大把现金可以砸在广告上。"},{"en":"They aren’t rich, but they’re not exactly walking around with pocketfuls of money either.","zh":"他们不算有钱，但也绝不是兜里总揣着大把钞票。"}]}],"synonyms":["loads (of)","plenty (of)","lots (of)","heaps (of)","handfuls (of)"],"phonetic":"/ˈpɑkətˌfʊlz/","extraExplanation":["“pocketful”由 pocket（口袋）+ -ful（表示“装满……的量”）构成，类似的还有 “handful（一把）”“cupful（一杯）”“spoonful（一勺）”。复数通常写作 pocketfuls（更常见），而较少见的形式是 pocketsful（更强调“多个口袋都装满”）。","常见搭配：pocketfuls of coins/candy/keys（口袋里一把把硬币/糖果/钥匙）。在文学和歌词里也常用来营造“口袋鼓鼓、东西很多/钱很多”的画面。"]}
{"word":"pocketing","summary":{"en":"“Pocketing” most often means putting something into your pocket; it can also mean keeping money for yourself (sometimes dishonestly). In textiles, it can refer to fabric used for pockets.","zh":"“pocketing”最常指把东西塞进口袋；也可指把钱据为己有（有时含“私吞”之意）。在纺织/服装领域，还可指口袋布等用料。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to put something into a pocket, usually quickly or casually","zh":"把某物放进口袋里（通常很快或随手）"},"examples":[{"en":"He was pocketing his keys as he walked out the door.","zh":"他走出门时把钥匙顺手放进口袋。"},{"en":"She kept pocketing small notes during the lecture.","zh":"上课时她不停把小纸条塞进口袋。"}]},{"partOfSpeech":"v.","definition":{"en":"to take or keep money for yourself, sometimes in a dishonest or unfair way","zh":"把钱据为己有（有时指不诚实/不公正地私吞）"},"examples":[{"en":"The manager was accused of pocketing the donations.","zh":"那位经理被指控私吞捐款。"},{"en":"Some middlemen were pocketing most of the profits.","zh":"一些中间商把大部分利润都自己拿走了。"}]},{"partOfSpeech":"other","definition":{"en":"a small pouch-like part or indentation in clothing, a bag, or something else (used mainly as an adjective or noun modifier: “pocketing fabric,” “seat pocketing”)","zh":"（多作名词修饰语）用于做口袋的材料/内衬等，如“口袋布”“座椅口袋内衬”"},"examples":[{"en":"This jacket uses strong pocketing for durability.","zh":"这件夹克用了结实的口袋布，更耐用。"}]}],"synonyms":["tuck away","stash","slip into a pocket","keep","take (illicitly)","embezzle (in some contexts)"],"phonetic":"/ˈpɑkətɪŋ/","extraExplanation":["“pocketing”常见于进行时或动名词用法：be pocketing（正在把……放进口袋/正在私吞），或作名词短语的一部分：pocketing money（把钱据为己有）。第二个含义带有道德判断色彩，语境中常与accused of（被指控）、embezzling（挪用）等词一起出现。","在服装/箱包行业里，pocketing常指“口袋布/袋布（口袋内衬用料）”，属于专业用法，和日常的“把东西放进口袋”不同。"]}
{"word":"pocketknife","summary":{"en":"A pocketknife is a small folding knife designed to be carried in a pocket.","zh":"pocketknife 指一种可折叠、便于随身携带的口袋小刀/折叠小刀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small folding knife that fits in your pocket, usually with one or more blades.","zh":"一种小型可折叠的刀，便于放入口袋里，通常有一片或多片刀刃。"},"examples":[{"en":"He carried a pocketknife to open packages and cut rope.","zh":"他随身带着一把折叠小刀，用来拆包裹和割绳子。"},{"en":"I keep a pocketknife in my backpack for camping.","zh":"我在背包里放一把折叠小刀，露营时用。"}]}],"synonyms":["folding knife","penknife","Swiss Army knife"],"phonetic":"/ˈpɑkɪtˌnaɪf/","extraExplanation":["在美式英语里，pocketknife 常指“折叠小刀/便携小刀”，有时也会特指多功能的“瑞士军刀”（Swiss Army knife），但两者不完全等同。","使用与携带刀具在不同国家、州/省、市有不同法律规定；旅行（尤其坐飞机）时更要注意相关限制。"]}
{"word":"pocketknives","summary":{"en":"Pocketknives are small folding knives you can carry in a pocket (plural form).","zh":"Pocketknives 指可放入口袋的折叠小刀（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A folding knife with one or more blades that fits into a pocket; plural of “pocketknife.”","zh":"可折叠并可放入口袋的小刀；“pocketknife”的复数。"},"examples":[{"en":"He carries a small pocketknife for opening packages.","zh":"他带着一把小折叠刀用来拆包裹。"},{"en":"Pocketknives are useful on camping trips, but you should use them safely.","zh":"折叠小刀在露营时很有用，但要安全使用。"}]}],"synonyms":["folding knives","penknives"],"phonetic":"/ˈpɑkətˌnaɪvz/","extraExplanation":["“Pocketknife”常见于美式英语，指能折叠收纳的随身小刀；有的也叫“folding knife”（折叠刀）。在不同地区对携带刀具的法律规定差异很大，学习或出行时要注意当地规定。","复数形式是 pocketknives（-knife 变复数常把 -f/-fe 变成 -ves：knife → knives）。"]}
{"word":"pocketless","summary":{"en":"“Pocketless” means having no pockets, usually used to describe clothing.","zh":"“Pocketless”指没有口袋的，通常用来形容衣物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without pockets (especially describing clothing).","zh":"（尤指衣物）没有口袋的。"},"examples":[{"en":"I love the dress, but it’s pocketless.","zh":"我很喜欢这条裙子，但它没有口袋。"},{"en":"His pocketless coat made it hard to carry keys and a phone.","zh":"他那件没有口袋的大衣让带钥匙和手机很不方便。"}]}],"synonyms":["without pockets","unpocketed"],"phonetic":"/ˈpɑkɪtləs/","extraExplanation":["“Pocketless”是由“pocket（口袋）+ -less（没有……的）”构成的形容词。常见于服装讨论（尤其是裙子、连衣裙、女装）里，带有“设计不方便/缺少实用性”的语气。","在文化语境中，人们常吐槽某些服装“pocketless”，反映了对“衣服应兼具美观与实用”的期待；也常引出关于服装设计与性别差异（如女装口袋偏小或没有口袋）的讨论。"]}
{"word":"pocketlike","summary":{"en":"“Pocketlike” means shaped like or functioning like a pocket.","zh":"“pocketlike”表示“像口袋的”或“具有口袋功能的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pocket in shape or function (for example, a small pouch-like space, opening, or compartment).","zh":"像口袋的；具有口袋形状或功能的（例如小袋状的空间、开口或隔层）。"},"examples":[{"en":"The jacket has a pocketlike pouch inside for storing keys.","zh":"这件夹克里面有一个口袋状的小袋子，用来放钥匙。"},{"en":"A pocketlike cavity formed in the rock after years of erosion.","zh":"经过多年侵蚀，岩石里形成了一个口袋状的空洞。"}]}],"synonyms":["pouch-like","pocket-shaped","baglike","saclike","compartmented"],"phonetic":"/ˈpɑkətlaɪk/","extraExplanation":["“pocketlike”是由“pocket（口袋）+ -like（像……一样）”组成的复合形容词，常用于描写外形或结构“像口袋”，强调“可装东西/凹进去/有隔层”的感觉。","这个词在日常口语中不算特别常见；写作时也可用更常见的表达替换，如“pouch-like”“pocket-shaped”“having a pocket”。","在医学或生物学语境里，也可能用来描述“袋状结构/囊状凹陷”（例如组织中的小囊、腔隙），语气偏客观描述。"]}
{"word":"pockets","summary":{"en":"“Pockets” usually means the small bags in clothing for carrying things; it can also mean small isolated areas, and as a verb it can mean to put away (sometimes secretly).","zh":"“pockets”通常指衣服上的口袋；也可指“局部小区域”；作动词时可表示把东西塞进口袋里（有时暗含私藏/私吞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bag sewn into clothing (or attached) used for carrying small things like keys, coins, or a phone.","zh":"（衣物上缝制或附着的）口袋，用来装钥匙、硬币、手机等小物品。"},"examples":[{"en":"I put my keys in my pocket.","zh":"我把钥匙放进了口袋。"},{"en":"This jacket has deep pockets.","zh":"这件夹克的口袋很深。"}]},{"partOfSpeech":"n.","definition":{"en":"A small enclosed or partly hidden space or area (often used in phrases like “a pocket of air/resistance”).","zh":"（常指局部）小块封闭或半隐蔽的空间/区域（常见于“a pocket of air/resistance”等表达）。"},"examples":[{"en":"The plane hit a pocket of turbulence.","zh":"飞机遇到了一段（局部的）气流颠簸。"},{"en":"There are pockets of poverty in the city.","zh":"这座城市里存在一些贫困的“局部地区”。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put something into a pocket; to keep something for yourself (often implying secrecy or dishonesty).","zh":"把某物放进口袋；（常含贬义）把钱或好处据为己有、私吞。"},"examples":[{"en":"He pocketed the receipt and said nothing.","zh":"他把收据塞进口袋里，什么也没说。"},{"en":"The cashier was accused of pocketing cash.","zh":"那名收银员被指控私吞现金。"}]}],"synonyms":["pouches","compartments","stash","tuck away"],"phonetic":"/ˈpɑkɪts/","extraExplanation":["“pocket(s)”既可以是可数名词（a pocket / pockets），也常出现在固定搭配里：a pocket of + 名词，表示“局部的一小片/一小团”（如 a pocket of turbulence/poverty）。","文学与文化中，pocket 常带有“随身、私密、掌控”的联想：如 “in my pocket” 不仅是“在口袋里”，也可引申为“掌控之中/稳操胜券”。"]}
{"word":"pocketsful","summary":{"en":"Pocketful means “as much as fits in a pocket,” and informally it can mean “a small amount of money.”","zh":"Pocketful 指“装满一口袋的量”，口语中也可指“少量的钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quantity that fills one pocket (often used as a casual measure, especially for small items).","zh":"一口袋的量；装满一个口袋的东西（常作随意的数量说法，多用于小物品）。"},"examples":[{"en":"He pulled a pocketful of coins from his jacket.","zh":"他从夹克里掏出一口袋硬币。"},{"en":"She brought a pocketful of candy for the kids.","zh":"她带来一口袋糖果给孩子们。"}]},{"partOfSpeech":"n.","definition":{"en":"A small amount of money (informal).","zh":"（非正式）一点钱；零花钱。"},"examples":[{"en":"I don’t have a pocketful right now, but I can pay you tomorrow.","zh":"我现在没什么钱，但我明天可以付你。"}]}],"synonyms":["handful","small amount","a bit (of money)"],"phonetic":"/ˈpɑkɪtˌfʊl/","extraExplanation":["你写的“pocketsful”通常被视为不标准/常见误拼。标准形式是“pocketful”（单数）。","复数一般写作“pocketfuls”（更常见）：two pocketfuls of sand（两口袋沙子）。有时也能见到“pocketsful”，但现代英语里较少用。","“a pocketful of + 名词”很常见：a pocketful of keys/coins/candy。"]}
{"word":"pockety","summary":{"en":"“Pockety” means “having lots of pockets,” usually describing clothing or bags (informal).","zh":"“Pockety”指“口袋很多的”，常形容衣服或包（偏口语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of clothing or a bag) having many pockets; designed with extra pockets for carrying small items.","zh":"（衣服或包）口袋很多的；带有许多口袋、便于装小物件的。"},"examples":[{"en":"I love this jacket—it’s really pockety, so I don’t need a bag.","zh":"我很喜欢这件夹克——口袋特别多，所以我不需要背包。"},{"en":"Cargo pants can be a bit pockety, but they’re practical for travel.","zh":"工装裤可能有点“口袋太多”，但旅行时很实用。"},{"en":"The backpack looks pockety, with compartments for keys, chargers, and snacks.","zh":"这个背包看起来口袋/隔层很多，可以放钥匙、充电器和零食。"}]}],"synonyms":["multi-pocketed","many-pocketed","with lots of pockets","pocket-laden"],"phonetic":"/ˈpɑkəti/","extraExplanation":["“pockety”比较口语、非正式，多见于日常对话、时尚/购物评价里，用来形容“口袋多、分隔多”。正式写作里更常用：“with lots of pockets / multi-pocketed / many-pocketed”。"]}
{"word":"pockhouse","summary":{"en":"An old word for a hospital/ward for people with pox diseases (especially smallpox).","zh":"一个古老用法，指收治痘类传染病（尤指天花）的医院或病房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A hospital or ward where people with infectious “pox” diseases (especially smallpox, and sometimes syphilis) were kept and treated.","zh":"（古语）痘病院；收治“痘类”传染病（尤指天花，有时也指梅毒等）的医院或隔离病房。"},"examples":[{"en":"In older records, the sick were sent to the pockhouse to prevent the disease from spreading.","zh":"在较早的记录里，病人会被送去痘病院，以防疾病扩散。"},{"en":"The town built a small pockhouse during the outbreak.","zh":"那座城镇在疫情期间建了一所小型痘病院。"}]}],"synonyms":["poxhouse","isolation ward","infectious disease hospital"],"phonetic":"/ˈpɑkˌhaʊs/","extraExplanation":["“pock”原指皮肤上的痘疤/脓疱，“pox”是痘类疾病的统称；因此 pockhouse（也常写作 poxhouse）在历史语境里多指隔离与收治天花等患者的地方。","这类词带有强烈的历史与社会污名色彩；现代英语中通常不用，若要表达类似概念，更常用 isolation ward（隔离病房）或 infectious disease hospital（传染病医院）。"]}
{"word":"pockier","summary":{"en":"“Pockier” means “more pockmarked” or “having more small pits/holes.”","zh":"“pockier” 表示「更麻點/更凹坑更多」的，比 pocky 更嚴重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of pocky: having more small holes, pits, or scars (more pockmarked).","zh":"pocky 的比較級：有更多小洞、凹坑或疤痕的（更「麻點/痘疤狀」的）。"},"examples":[{"en":"After the hailstorm, the car’s hood looked pockier than before.","zh":"冰雹過後，車子的引擎蓋看起來比之前更凹凹凸凸。"},{"en":"The old wall is pockier near the bottom where water damage is worse.","zh":"那面老牆在底部更坑坑疤疤，因為那裡的水損比較嚴重。"},{"en":"In close-up shots, the actor’s skin looked pockier under harsh lighting.","zh":"在特寫鏡頭下，強光讓那位演員的皮膚看起來更顯痘疤/凹洞。"}]}],"synonyms":["more pockmarked","more pitted","more scarred","more cratered"],"phonetic":"/ˈpɑkiər/","extraExplanation":["「pock」原指天花（smallpox）造成的痘疤凹洞（pockmark），後來引申為任何表面被小洞、小坑「打出來」的樣子，如金屬被冰雹打凹、牆面被侵蝕、皮膚有痘疤等。"]}
{"word":"pockiest","summary":{"en":"“Pockiest” means “the most pocky”—having the most pits, holes, or pockmarks on a surface.","zh":"“pockiest”表示“最坑洼/小洞最多的”，即表面坑点（麻子、凹痕）最多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of pocky) having the most small holes, pits, or marks on a surface; most pitted.","zh":"（pocky 的最高级）表面小坑/小洞/斑点最多的；最凹凸不平的。"},"examples":[{"en":"Of all the old roads in town, this one is the pockiest after winter.","zh":"镇上所有旧路里，这条路过完冬天坑洼最多。"},{"en":"The pockiest wall was covered with tiny dents and chipped paint.","zh":"那面最坑坑洼洼的墙上布满小凹痕和脱落的油漆。"},{"en":"After the storm, the field looked pockiest near the goalposts.","zh":"暴风雨后，球门柱附近的场地看起来最坑洼。"}]}],"synonyms":["most pitted","most pockmarked","most dimpled","most cratered"],"phonetic":"/ˈpɑkiəst/","extraExplanation":["“pocky”来自名词/动词“pock”（小洞、小坑；使出现小坑），常见于“pockmarked”（布满麻子/坑洞的）。日常英语里更常说“the most pitted / the most pockmarked”，而“pockiest”较少见，通常出现在比较口语或描写性文字中。"]}
{"word":"pockily","summary":{"en":"“Pockily” means “in a pitted or scarred way,” especially with pockmarks.","zh":"“pockily”表示“坑洼/麻点/疤痕状地”，常指带有麻子或凹坑的外观。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is covered with pocks (small pits, scars, or marks), especially from disease like smallpox; pitted or scarred in appearance.","zh":"以布满麻点/凹坑/疤痕的方式；（尤指因天花等疾病）呈麻子、坑洼或疤痕状地。"},"examples":[{"en":"His cheeks were pockily scarred from childhood illness.","zh":"他脸颊上因童年疾病留下的疤痕呈麻点状。"},{"en":"The old stone wall was pockily marked by years of wind and sand.","zh":"那面老石墙被多年的风沙打磨得坑坑洼洼。"}]}],"synonyms":["pittedly","scarredly","pockmarkedly"],"phonetic":"/ˈpɑkəli/","extraExplanation":["“pockily”比较少见，更常见的是形容词“pocky / pock-marked”或名词短语“pockmarks”。","构词：pock（麻点/凹坑）+ -ily（副词后缀）。常用来描写皮肤、石头表面、月球表面等“坑洼不平”的外观。"]}
{"word":"pockiness","summary":{"en":"Pockiness means having many small pits or marks—an uneven, pockmarked texture.","zh":"Pockiness 指表面有许多小凹坑或痕迹的状态，即“坑坑洼洼/麻点”的质感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of having many small pits, holes, or marks (being pockmarked); a rough, uneven surface texture","zh":"麻点、凹坑很多的状态；表面坑坑洼洼、不平整的质感"},"examples":[{"en":"The dermatologist noted the pockiness on his cheeks after years of acne.","zh":"皮肤科医生注意到他脸颊上多年痘痘留下的凹坑（麻点）。"},{"en":"You can feel the pockiness of the old stone under your fingers.","zh":"你用手指能摸到那块旧石头表面坑坑洼洼的质感。"},{"en":"The road’s pockiness made cycling uncomfortable.","zh":"路面坑坑洼洼，骑车很不舒服。"}]}],"synonyms":["pitting","pockmarking","roughness","unevenness"],"phonetic":"/ˈpɑːkinəs/","extraExplanation":["“pockiness”来自“pock”（痘疤/凹坑）+ “-iness”（表示性质/状态的名词后缀）。常见搭配有：skin pockiness（皮肤凹坑感）、surface pockiness（表面麻点/气孔）、pockiness from acne（因痘痘造成的凹坑）。","在正式写作中也可用更常见的同义表达：pockmarking / pockmarked texture / pitting（凹坑、点蚀）。在材料与工程语境里，“pitting”更常用；在皮肤语境里，“pockmarks”或“acne scarring”更自然。"]}
{"word":"pocking","summary":{"en":"“Pocking” means forming or causing small pits/marks (pockmarks) on a surface.","zh":"“pocking”指（使）表面形成许多小坑点或麻点状痕迹。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Making small holes, dents, or marks on a surface; the act of becoming covered with pockmarks.","zh":"在表面形成小孔、小凹痕或斑点；（使）表面布满麻点/凹坑的过程。"},"examples":[{"en":"After the storm, the car’s paint was pocking from hail damage.","zh":"暴风雨过后，车漆被冰雹砸得开始出现一片片小凹坑。"},{"en":"The metal surface was pocking where it had started to rust.","zh":"金属表面在开始生锈的地方出现了许多小坑点。"}]},{"partOfSpeech":"vt.","definition":{"en":"Creating or leaving pockmarks (small round scars or pits) on something.","zh":"在某物上造成麻点状的疤痕或小坑（留下凹痕）。"},"examples":[{"en":"Acne can leave scars, pocking the skin if it isn’t treated carefully.","zh":"痘痘可能会留下疤痕，如果处理不当会让皮肤出现麻点凹陷。"},{"en":"Shrapnel pocking the wall showed how close the blast was.","zh":"墙上被弹片打出的密密麻麻小坑显示爆炸离得很近。"}]}],"synonyms":["pitting","marking","denting","scarifying"],"phonetic":"/ˈpɑkɪŋ/","extraExplanation":["“pocking”来自动词“pock”（长出痘疱；使布满凹坑/麻点）。常见相关词：pockmark（麻点；凹坑；痘疤）。","注意拼写：很多学习者会把“pocking”和“poking”（戳、捅）混淆；两者意思完全不同。"]}
{"word":"pockmanky","summary":{"en":"“Pockmanky” is a Scots informal adjective meaning very dirty or scruffy.","zh":"“pockmanky”是苏格兰方言里的非正式形容词，意思是非常脏、邋遢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, informal) Dirty, grimy, or unpleasantly unclean; scruffy-looking.","zh":"（苏格兰方言，非正式）肮脏的、脏兮兮的、不洁的；看起来邋遢的。"},"examples":[{"en":"His shoes were pockmanky after walking through the muddy field.","zh":"他走过泥泞的田地后，鞋子变得脏兮兮的。"},{"en":"Don’t sit on that pockmanky chair—wipe it first.","zh":"别坐那把脏椅子——先擦一擦。"}]}],"synonyms":["manky","filthy","grimy","dirty","scruffy"],"phonetic":"/ˈpɑkˌmæŋki/","extraExplanation":["“pockmanky”多见于苏格兰英语（Scots）口语里，带一点嫌弃或抱怨的语气，类似于更常见的“manky（又脏又恶心的）”。","词形上常被理解为由“pock（小坑/痘疤/斑点）”+“manky（邋遢、脏）”组合而来，用来加强“脏、破、看着不舒服”的感觉。","这种方言词在正式写作中不常用，但在对话、小说人物台词、地方口音描写里会出现，用来营造地域色彩。"]}
{"word":"pockmanteau","summary":{"en":"A portmanteau is usually a blended word made from two words (like brunch = breakfast + lunch).","zh":"Portmanteau 通常指“混成词”，由两个词融合而成（如 brunch = breakfast + lunch）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word made by blending two words, combining both their sounds and meanings","zh":"混成词；由两个词融合（声音与意义）而成的新词"},"examples":[{"en":"“Brunch” is a portmanteau of “breakfast” and “lunch.”","zh":"brunch 是 breakfast 和 lunch 融合形成的混成词。"},{"en":"“Smog” is a portmanteau combining “smoke” and “fog.”","zh":"smog 是 smoke 和 fog 融合形成的混成词。"},{"en":"The writer coined a portmanteau to describe the new trend.","zh":"这位作者造了一个混成词来描述这种新潮流。"}]},{"partOfSpeech":"adj.","definition":{"en":"combining or blending two things into one (used as an adjective)","zh":"（形容词）融合两者于一体的；混合式的"},"examples":[{"en":"The story uses a portmanteau style, mixing memoir and fiction.","zh":"这个故事采用融合式风格，把回忆录与小说混合在一起。"},{"en":"It’s a portmanteau identity shaped by two cultures.","zh":"这是一种由两种文化共同塑造的融合型身份认同。"}]},{"partOfSpeech":"n.","definition":{"en":"a suitcase or traveling bag with two compartments (older usage)","zh":"（旧用法）有两个隔层的旅行箱/行李袋"},"examples":[{"en":"In older novels, a traveler might carry a portmanteau on the train.","zh":"在较老的小说里，旅客可能会在火车上带着一个双层旅行箱。"}]}],"synonyms":["blend word","blended word","coinage","neologism"],"phonetic":"/pɔrtˈmænˌtoʊ/","extraExplanation":["你输入的“pockmanteau”常见于把 **portmanteau** 拼错了。正确拼写是 **portmanteau**。","“Portmanteau（混成词）”这个语言学用法因路易斯·卡罗尔（Lewis Carroll，《爱丽丝镜中奇遇记》作者）而广为人知：他用它来形容把两个词“像两件东西塞进同一个行李箱”一样合在一起。","现代英语里它最常见的意思就是“混成词”；表示“行李箱”的本义现在较少见。"]}
{"word":"pockmantie","summary":{"en":"“Pockmantie” is not a recognized English word; it’s probably a misspelling (often of “pockmarked” or “pocket money”).","zh":"“pockmantie”不是公认的英语单词；很可能是拼写错误（常见对应为“pockmarked”或“pocket money”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/handle. Common possibilities include “pockmarked” (covered with small dents or scars) or “pocket money” (spending money).","zh":"不是标准英语单词，可能是拼写错误或人名/网名。常见可能是“pockmarked”（布满小坑/疤痕的）或“pocket money”（零花钱）。"},"examples":[{"en":"I can’t find “pockmantie” in a dictionary—did you mean “pockmarked”?","zh":"我在词典里找不到“pockmantie”——你是不是想写“pockmarked”？"},{"en":"If you meant “pocket money,” it refers to a small amount of spending money.","zh":"如果你想写“pocket money”，意思是“一点零花钱/可自由支配的钱”。"}]}],"synonyms":["pockmarked","scarred","dented","pocket money","allowance"],"phonetic":"/ˌpɑkˈmæn.ti/","extraExplanation":["我猜这可能是拼写把两个词/音节混在一起了：\n- pockmarked /ˈpɑkˌmɑrkt/：常见于描述“皮肤因痘疤、天花疤或坑洞而凹凸不平”。\n- pocket money /ˈpɑkɪt ˌmʌni/：英美都常用，指父母给孩子的零花钱或少量随身花费。\n如果你告诉我它出现的句子或语境（比如聊天、小说、游戏ID），我可以更准确判断你要找的词。"]}
{"word":"pockmark","summary":{"en":"Pockmark refers to small pits or scars on a surface, and as a verb it means to make a surface covered with such pits.","zh":"pockmark指表面的小坑/疤痕（常见于痘坑或月球坑），作动词表示使表面布满这种小坑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A small pit or scar on a surface, especially on skin (often from acne or chickenpox) or on the ground (like the moon’s surface).","zh":"（表面上的）小坑、小凹痕或疤痕；尤指皮肤上因痘痘/水痘留下的痘坑，或地表（如月球表面）的坑洼。"},"examples":[{"en":"His cheeks were pockmarked from severe acne when he was a teenager.","zh":"他青少年时痤疮很严重，脸颊上留下了明显的痘坑。"},{"en":"The moon’s surface looks pockmarked with craters.","zh":"月球表面布满陨石坑，看起来坑坑洼洼的。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover something with many small pits, holes, or scars.","zh":"使（某物）布满小坑、小洞或疤痕；使坑坑洼洼。"},"examples":[{"en":"Hail pockmarked the hood of the car.","zh":"冰雹把车的引擎盖砸得满是小凹坑。"},{"en":"The old wall was pockmarked by years of weather and dust.","zh":"这面老墙因多年风化和尘土而变得坑坑洼洼。"}]}],"synonyms":["pit","dent","scar","pitted","dimpled"],"phonetic":"/ˈpɑkˌmɑrk/","extraExplanation":["“pock”原指天花（smallpox）等疾病留下的脓疱或疤痕，所以pockmark最常见的联想是“痘坑/疤痕”。在描述皮肤时它比“scarred”更强调“一个个小坑点状分布”的外观。","在写作里，pockmarked常用于生动的视觉描写：月球表面、战后墙面、被冰雹砸过的金属、或被弹片打出的痕迹等。"]}
{"word":"pockmarked","summary":{"en":"Pockmarked means covered with many small pits or marks, like scars; it can also mean to make something look that way.","zh":"pockmarked 指“布满小坑洞/凹痕的（像痘坑）”，也可作动词表示“使……变得坑坑洼洼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with many small holes, dents, or pits (often like the scars left by smallpox or acne).","zh":"布满小坑洞或凹痕的；麻子般凹凸不平的（常指像天花或痘疤留下的坑）。"},"examples":[{"en":"The moon’s surface looks pockmarked with craters.","zh":"月球表面布满坑坑洼洼的环形山。"},{"en":"After years of wear, the old metal table was pockmarked and rough.","zh":"多年磨损后，那张旧金属桌子变得坑坑洼洼、表面粗糙。"},{"en":"He felt self-conscious about his pockmarked skin.","zh":"他对自己有痘疤的皮肤感到不自在。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something covered with small holes or marks; to damage by leaving many pits.","zh":"使某物布满小坑洞或斑点；把……打得坑坑洼洼。"},"examples":[{"en":"Hail pockmarked the car’s hood.","zh":"冰雹把车头盖砸得坑坑洼洼。"},{"en":"The wall was pockmarked by shrapnel.","zh":"墙面被弹片打得满是凹坑。"}]}],"synonyms":["pitted","scarred","cratered","marred","dented"],"phonetic":"/ˈpɑkˌmɑrkt/","extraExplanation":["“pock”原指天花（smallpox）留下的痘坑/疤痕；因此 pockmarked 带有“像痘坑一样密集凹陷”的画面感。","这个词既可描述皮肤（acne scars），也常用于自然或物体表面（如月球、道路、金属、墙面），语气通常偏负面，强调受损或不平整。"]}
{"word":"pockmarking","summary":{"en":"Pockmarking describes something being covered with small pits or spots, or the act of making those marks.","zh":"pockmarking 指“布满小坑/斑点的状态”，也可指“使表面出现这种坑点痕迹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with small pits or marks (like the holes left by acne, chickenpox, or small impacts).","zh":"布满小坑或小斑点的；有麻子/痘疤/坑洞状痕迹的。"},"examples":[{"en":"The old stone wall was pockmarked with small holes from years of weather and damage.","zh":"那面老石墙布满了小洞，是多年风化和损坏留下的。"},{"en":"He felt self-conscious about the pockmarked skin on his cheeks.","zh":"他对自己脸颊上坑坑洼洼的皮肤感到不自在。"}]},{"partOfSpeech":"v.","definition":{"en":"To mark or cover with small pits or spots.","zh":"使布满小坑/小斑点；在……上留下坑洞状痕迹。"},"examples":[{"en":"Hail pockmarked the car’s hood in minutes.","zh":"冰雹几分钟内就在汽车引擎盖上砸出密密麻麻的小坑。"},{"en":"The metal surface was pockmarked by rust.","zh":"金属表面被锈蚀弄得坑坑洼洼。"}]}],"synonyms":["pitted","scarred","cratered","dimpled","spotted"],"phonetic":"/ˈpɑkˌmɑr.kɪŋ/","extraExplanation":["“pockmark”原本指天花（smallpox）等疾病痊愈后留下的“麻子/疤痕”。因此它常用来描述表面不平、到处是小坑的质感。","常见搭配：pockmarked face/skin（麻子脸/痘坑皮肤），pockmarked road/moon surface（坑坑洼洼的路/月球表面）。在写作中也可用作比喻，表示“被问题/事件弄得满目疮痍”。"]}
{"word":"pockmarks","summary":{"en":"Pockmarks are many small pits or scars on a surface; to pockmark means to cover something with such pits.","zh":"pockmarks 指表面上许多小凹坑或疤痕；pockmark 作动词表示使某物布满这些小坑/麻点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small round pits or scars on a surface (especially on skin), often left by acne or disease like smallpox; by extension, similar dents on things like metal, roads, or the moon’s surface.","zh":"（表面上的）小凹坑、小疤痕；尤指皮肤上因痘痘或天花等留下的痘疤；也可引申指金属、路面或月球表面的坑洼。"},"examples":[{"en":"He has a few pockmarks on his cheeks from teenage acne.","zh":"他脸颊上有一些青春期痘痘留下的痘疤。"},{"en":"The old road is full of pockmarks after the harsh winter.","zh":"经历严冬后，这条旧路面布满了坑坑洼洼。"},{"en":"From far away, the moon looks smooth, but up close it is covered with pockmarks.","zh":"远看月亮很光滑，但近看表面布满了坑坑洼洼。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover or mark something with many small pits or scars.","zh":"使（某物）布满小凹坑或疤痕；在……上留下密密麻麻的小坑/麻点。"},"examples":[{"en":"Hail pockmarked the car’s paint.","zh":"冰雹把车漆砸得满是小坑。"},{"en":"The wall was pockmarked with bullet holes.","zh":"墙上布满了弹孔。"}]}],"synonyms":["pits","scars","craters","blemishes","dents"],"phonetic":"/ˈpɑkˌmɑrk/","extraExplanation":["“pockmark”来自“pock（痘疱）+ mark（痕迹）”，最初多与天花（smallpox）留下的疤痕相关；现代常用来形容任何表面“密布小坑”的外观。","常见搭配：pockmarked face（麻子脸/痘疤脸）、pockmarked with holes（布满洞）。注意它描述的是“许多小坑”，不是“单个大洞”。"]}
{"word":"pocks","summary":{"en":"“Pocks” usually means small skin marks/scars (plural of pock), and it can also mean “marks/covers with small pits or spots.”","zh":"“pocks”通常指（pock 的复数）皮肤上的小疤点/痘印；也可作动词，表示“使布满小坑或斑点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Small round marks or scars on the skin, especially caused by a disease like chickenpox or smallpox.","zh":"（复数）皮肤上的小圆点/疤痕，尤指由水痘、天花等疾病造成的痘印、麻子。"},"examples":[{"en":"After the chickenpox, she still had a few pocks on her face.","zh":"得过水痘后，她脸上还留着几个痘印。"},{"en":"Old photos show his cheeks covered in pocks.","zh":"老照片里可以看到他脸颊上布满麻子。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular verb) To mark or cover something with small pits, spots, or scars.","zh":"（动词第三人称单数）使……布满小坑/斑点/疤痕；在……上留下小凹点。"},"examples":[{"en":"Acne sometimes pocks the skin if it isn’t treated well.","zh":"如果处理不当，痤疮有时会让皮肤留下凹疤。"},{"en":"Hail pocks the car’s roof in a heavy storm.","zh":"大暴雨夹冰雹时，车顶会被砸出许多小凹点。"}]}],"synonyms":["pockmarks","spots","scars","pits","blemishes"],"phonetic":"/pɑks/","extraExplanation":["“pock”常见于复合词“smallpox（天花）”“chickenpox（水痘）”。现代口语里谈“痘印/痘坑”更常用“acne scars”“pockmarks”。"]}
{"word":"pockweed","summary":{"en":"Pokeweed is a North American plant with purple berries; it is poisonous, though its berry juice has been used as a dye or ink.","zh":"Pokeweed（商陆）是一种北美植物，结紫色浆果且有毒；其浆果汁有时被用作染料或“墨水”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall North American plant (Phytolacca americana) with large leaves and hanging clusters of dark purple berries; the plant is poisonous, especially the roots and mature parts.","zh":"一种北美高大植物（美洲商陆/美洲商陆属植物，Phytolacca americana），叶大，结成串的深紫色浆果；全株有毒，尤其是根部和成熟部位。"},"examples":[{"en":"Pokeweed grows quickly along fences and disturbed ground.","zh":"商陆常常在篱笆旁和被翻动过的地面上快速生长。"},{"en":"The berries look tempting, but pokeweed is poisonous to people and pets.","zh":"浆果看起来很诱人，但商陆对人和宠物都有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"The purple juice from pokeweed berries, sometimes used as a natural dye or ink.","zh":"商陆浆果挤出的紫色汁液，有时被用作天然染料或“墨水”。"},"examples":[{"en":"People once used pokeweed berries to dye fabric a reddish-purple color.","zh":"过去有人用商陆浆果给布料染成偏红的紫色。"},{"en":"As a child, he wrote his name with pokeweed “ink.”","zh":"他小时候用商陆“墨水”写过自己的名字。"}]}],"synonyms":["pokeweed","American pokeweed","Phytolacca americana"],"phonetic":"/ˈpoʊkˌwid/","extraExplanation":["“pockweed”常被当作“pokeweed”的误拼或地方拼法。标准拼写一般是 pokeweed。","商陆在一些地区有“poke sallet/sallet（商陆嫩叶菜）”的民间吃法，但需要非常专业的处理与多次焯煮去毒；在家自行尝试并不安全。","在美国民俗与文学中，商陆常出现在乡村景象描写里：紫黑色浆果、会“染色”的汁液、以及“好看但有毒”的象征意味。"]}
{"word":"pockwood","summary":{"en":"Pockwood is a rare spelling of pokeweed, a North American plant with purple berries that can be poisonous.","zh":"Pockwood 多为 pokeweed 的罕见拼写，指一种北美植物，结紫色浆果，可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (pokeweed) with dark purple berries, often found in North America; the berries and other parts can be poisonous if eaten.","zh":"一种植物（pokeweed / 美洲商陆），结深紫色浆果，常见于北美；浆果和植株其他部分误食可能有毒。"},"examples":[{"en":"Some people mistake pockwood berries for edible fruit, but they can be toxic.","zh":"有些人会把 pockwood 的浆果误认成可食用水果，但它可能有毒。"},{"en":"Pockwood often grows along fences and roadsides in late summer.","zh":"夏末时，pockwood 常沿着篱笆和路边生长。"}]}],"synonyms":["pokeweed","Phytolacca","Phytolacca americana"],"phonetic":"ˈpoʊkˌwid","extraExplanation":["“pockwood”多被视为“pokeweed”的罕见拼写/误拼，指同一种植物（学名常见为 Phytolacca americana）。","在美国文化中，pokeweed 有时会出现在乡村叙事或民间说法里；虽然有“poke sallet（商陆嫩叶菜）”等传统吃法，但需要专业处理去毒，不建议自行采食。"]}
{"word":"pocky","summary":{"en":"Pocky is a Japanese brand of biscuit sticks coated with chocolate or other flavors.","zh":"Pocky（百奇）是日本的饼干棒零食，外层裹有巧克力或其他口味涂层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular Japanese snack brand: thin biscuit sticks coated with chocolate or other flavored cream (often eaten straight from the box).","zh":"一种很受欢迎的日本零食品牌：细长的饼干棒外面裹着巧克力或其他口味的涂层（常直接从盒子里拿来吃）。"},"examples":[{"en":"I bought a box of Pocky in the chocolate flavor.","zh":"我买了一盒巧克力口味的百奇（Pocky）。"},{"en":"Do you want to share some Pocky while we watch a movie?","zh":"我们看电影的时候要不要一起吃点百奇？"},{"en":"Many Asian grocery stores sell Pocky near the candy aisle.","zh":"很多亚洲超市在糖果区附近都有卖百奇。"}]}],"synonyms":["biscuit sticks","chocolate-coated biscuit sticks","cookie sticks"],"phonetic":"ˈpɑki","extraExplanation":["“Pocky”是日本江崎格力高（Glico）的零食品牌名，在英语中常当作普通名词来指这种“饼干棒+涂层”的零食。","名字据说来自日语的拟声词，形容咬断饼干棒时的“咔嚓/啪嗒”声音。","在日本等地常见不同限定口味（如草莓、抹茶、杏仁等），也常被当作分享型零食或小礼物。"]}
{"word":"poco","summary":{"en":"“Poco” means “a little,” especially in Italian musical directions (e.g., poco forte, poco a poco).","zh":"“poco”表示“一点、稍微”，尤其常见于意大利语音乐术语（如 poco forte、poco a poco）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Music) a little; used in Italian musical directions to indicate a small amount of change in volume, speed, or expression.","zh":"（音乐术语）一点；用于意大利语的演奏指示中，表示音量、速度或表情只作小幅度变化。"},"examples":[{"en":"Play it poco forte, not too loud.","zh":"用稍强（poco forte）来演奏，不要太响。"},{"en":"The score says poco ritardando near the end.","zh":"乐谱在结尾附近写着“poco ritardando”（稍稍放慢）。"},{"en":"She increased the tempo poco a poco.","zh":"她让速度一点一点地加快。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From Italian/Spanish) little; not much (often seen in set phrases such as “poco a poco”).","zh":"（源自意大利语/西班牙语）少的；不多的（常见于固定表达，如“poco a poco”）。"},"examples":[{"en":"I speak Spanish, but only un poco.","zh":"我会说西班牙语，但只会一点点。"},{"en":"He made poco progress at first.","zh":"他起初进展不大。"}]}],"synonyms":["a little","slightly","a bit","gradually (for “poco a poco”)"],"phonetic":"/ˈpoʊkoʊ/","extraExplanation":["“poco”常见于古典音乐谱面，因为传统上大量音乐术语来自意大利语。例如：\n- poco a poco：一点一点地、逐渐地\n- poco più：稍微更多一点\n- poco meno：稍微少一点\n- poco mosso：稍微不那么快/稍微慢一点\n在英语里单独说“poco”多出现在音乐语境；日常口语中若要表达“一点点”，更常用 a little / a bit。"]}
{"word":"pococurante","summary":{"en":"Pococurante means carefree and indifferent—someone who doesn’t seem to care much or worry.","zh":"pococurante 指无忧无虑但又有些冷淡、满不在乎的人/态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"carefree and indifferent; not easily worried or bothered, often because you don’t care much about results","zh":"无忧无虑且漠不关心的；不太在意结果、很难被烦扰的（常带“满不在乎”之意）"},"examples":[{"en":"He sounded pococurante about the exam, as if passing didn’t matter to him.","zh":"他对考试一副pococurante的样子，好像及格与否都无所谓。"},{"en":"Her pococurante attitude annoyed her teammates, who were working hard.","zh":"她那种满不在乎的态度惹恼了队友，因为大家都在努力。"}]}],"synonyms":["indifferent","carefree","nonchalant","unconcerned","apathetic"],"phonetic":"/ˌpoʊkoʊkjʊˈrɑːnti/","extraExplanation":["这是一个意大利语借词（poco curante，字面意为“少关心/不怎么在意”），在英语里非常少见，通常用于带点讽刺或文学气息的语境。","在伏尔泰《老实人》（Candide）中有“Pococurante”这一人物形象：一位富有却对艺术与成就都挑剔、冷淡的人，常用来讽刺“见多识广却无感”的冷漠与厌倦。","使用上属于较高级/书面/文学化词汇；日常英语更常用 indifferent, carefree, nonchalant 等。"]}
{"word":"pococuranteism","summary":{"en":"Pococuranteism means a calm, casual indifference—being not much concerned about things others care about.","zh":"pococuranteism 指一种平静、漫不经心的冷淡与不在乎——对他人在意的事不太关心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A calm, almost casual attitude of not caring much; indifference, especially toward things other people think are important.","zh":"（罕见）一种平静、近乎漫不经心的“不太在乎”的态度；冷淡、漠然，尤指对他人认为重要的事不太关心。"},"examples":[{"en":"She faced the criticism with a kind of pococuranteism, refusing to argue or explain.","zh":"她以一种近乎漠然的态度面对批评，既不争辩也不解释。"},{"en":"His pococuranteism about fame surprised his friends, who expected him to chase recognition.","zh":"他对名声的淡然让朋友们很惊讶，因为他们以为他会追求认可。"}]}],"synonyms":["indifference","nonchalance","apathy","unconcern","detachment"],"phonetic":"/ˌpoʊkoʊˈkjʊrəntiˌzəm/","extraExplanation":["这个词来自意大利语短语 poco curante，字面意思是“少关心的/不太在乎的”。英语里通常用来强调一种“很淡定、甚至有点超然”的冷淡态度。","它常与“cynicism（愤世嫉俗）”区分：pococuranteism 更像“无所谓/不动声色”，不一定带有讽刺或怨气。","该词在文学/文化讨论中偶尔出现，常被用来描述对名望、评价、潮流等的疏离。日常英语更常用 indifference, nonchalance, apathy。"]}
{"word":"pococurantic","summary":{"en":"“Pococurante” means indifferent or unconcerned (a rare, literary word).","zh":"“pococurante”指冷漠、不在乎（罕见的文学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Indifferent; not caring much about something; unconcerned.","zh":"（罕见/文学用语）冷漠的；不太在乎的；漠不关心的。"},"examples":[{"en":"He gave a pococurante shrug and changed the subject.","zh":"他冷漠地耸了耸肩，转而谈起别的话题。"},{"en":"Her pococurante attitude toward criticism surprised her teammates.","zh":"她对批评的漠不关心让队友们很惊讶。"}]}],"synonyms":["indifferent","unconcerned","apathetic","nonchalant","blasé"],"phonetic":"/ˌpoʊ.koʊˈkʊr.ənt/","extraExplanation":["这个词来自意大利语短语“poco curante”，直译是“少在意/不怎么关心”。在英语里属于比较书面、带点讽刺或文学色彩的词。","在文学语境中它常用来形容一种“装作无所谓”或“对重要之事也不动心”的态度。读到它时，可以把它理解为比“indifferent”更带风格、更“文气”的说法。","有时会和伏尔泰《老实人》(Candide) 里“Pococurante”相关联：作品中这个名字暗示人物对艺术与生活都兴趣缺缺的“厌倦式冷淡”。"]}
{"word":"pococurantish","summary":{"en":"Pococurantish means calmly indifferent or unconcerned, sometimes with a slightly smug tone.","zh":"pococurantish 指一种淡然冷漠、无所谓的态度，有时还带点自得或讽刺意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Indifferent in a calm, somewhat smug way; not interested or worried about things that many people care about.","zh":"（态度）淡然冷漠、无所谓的；对许多人在意的事不感兴趣也不担心，甚至带点自得。"},"examples":[{"en":"He sounded pococurantish about the exam results, as if they didn’t matter at all.","zh":"他说起考试成绩时一副pococurantish的样子，仿佛完全不重要。"},{"en":"Her pococurantish attitude toward office gossip made her seem distant.","zh":"她对办公室八卦一副pococurantish的态度，让人觉得有点疏离。"}]}],"synonyms":["indifferent","nonchalant","apathetic","unconcerned"],"phonetic":"ˌpoʊkəˈkʊrəntɪʃ","extraExplanation":["这个词非常少见，常用于较正式或文学化的语境，带有“刻意表现得不在乎”的感觉；语气可能略带讽刺。","词源一般追溯到法语短语/用法（类似 *peu* + *connaître* 的构词思路），大意与“了解得不多/不太在意”相关；英语中常被用来形容一种“无所谓的冷淡”。","相关名词形式：*pococurante*（更少见，指“无所谓的人”）；常见近义表达可用 *indifferent*, *nonchalant*, *apathetic*（其中 *nonchalant* 更接近“淡定不在乎”，*apathetic* 更偏“冷漠无感/缺乏情绪与兴趣”。）"]}
{"word":"pococurantism","summary":{"en":"Pococurantism means a relaxed, untroubled indifference to things other people treat as important.","zh":"Pococurantism 指对他人很在意的事抱持一种从容、淡然的漠不关心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A calm, casual attitude of not caring much about what most people think is important; a relaxed indifference, often toward art, culture, or public opinion.","zh":"对大多数人认为重要的事（常指艺术、文化或舆论）抱着淡然、不太在意的态度；一种悠然的漠不关心。"},"examples":[{"en":"His pococurantism made him seem unbothered by the latest trends in music and film.","zh":"他的“pococurantism”（淡然不在意）让他看起来对最新的音乐和电影潮流毫不在乎。"},{"en":"She answered the criticism with pococurantism, as if it simply didn’t matter.","zh":"她以一种淡然的漠不关心回应批评，仿佛那根本不重要。"},{"en":"In the novel, the narrator’s pococurantism hides a quiet fear of getting emotionally involved.","zh":"在小说里，叙述者的淡然不在意掩盖了他对投入情感关系的隐隐恐惧。"}]}],"synonyms":["indifference","nonchalance","apathy","unconcern"],"phonetic":"/ˌpɑːkoʊˈkjʊrənˌtɪzəm/","extraExplanation":["这个词比较罕见，常用于较正式或文学性的语境，带一点“看淡一切”的气质，但不一定是积极评价：在别人看来可能是从容，也可能像冷漠、玩世不恭。","词源来自法语 pococurant（“不太在意的”），更早与意大利语 poco curante（“少关心”）相关。","使用场景上，经常搭配对“流行趋势、名声、批评、文化热点”等不太上心的态度；若想更日常地表达，可用 indifference / nonchalance / couldn’t care less。"]}
{"word":"pococurantist","summary":{"en":"Pococurantist describes a person—or an attitude—that seems calmly indifferent and not very concerned about things.","zh":"pococurantist 指一个人（或一种态度）淡然、若无其事，对许多事情不太在意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who seems calm and not very interested or worried about things, even matters that other people care about.","zh":"（对许多事）淡然、不怎么在意的人；对周遭事务漠不关心的人。"},"examples":[{"en":"He’s a pococurantist—he didn’t even react to the big changes at work.","zh":"他很淡然——对公司里的巨大变化都没什么反应。"},{"en":"Her friends get excited about trends, but she stays a quiet pococurantist.","zh":"朋友们对潮流很兴奋，但她一直很淡然、不太在意。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a calm, indifferent attitude; seeming not to care much.","zh":"淡然的；不怎么在意的；漠不关心的。"},"examples":[{"en":"His pococurantist attitude made the argument end quickly.","zh":"他那种淡然的态度让争论很快结束了。"},{"en":"She gave a pococurantist shrug and changed the subject.","zh":"她淡淡地耸了耸肩，就换了话题。"}]}],"synonyms":["indifferent","unconcerned","nonchalant","apathetic","blasé"],"phonetic":"/ˌpoʊ.kəˈræn.tɪst/","extraExplanation":["这个词比较罕见、带一点书面/幽默色彩，常用来形容“对许多事情都无所谓”的气质或性格。日常英语里更常用 indifferent（冷淡的）、unconcerned（不担心的）、nonchalant（若无其事的）。","词源上来自法语/拉丁语系：po(u)co（少、一点）+ curant（关心、照料），字面感觉像“少去操心的人/态度”。注意它通常不是褒义：可能暗示冷漠、缺乏热情，具体要看语境。"]}
{"word":"pocosen","summary":{"en":"A pocosin is a swampy, peat-rich wetland forest found mainly in the southeastern United States.","zh":"pocosin 指美国东南部常见的一种富含泥炭的沼泽湿地林地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in the southeastern U.S.) a type of wet, swampy woodland (a peatland) found on slightly raised, poorly drained ground.","zh":"（主要在美国东南部）一种湿润的沼泽林地（泥炭地），常见于地势略高但排水不良的区域。"},"examples":[{"en":"The trail crosses a pocosin filled with shrubs and pine trees.","zh":"这条步道穿过一片pocosin，里面长满灌木和松树。"},{"en":"After heavy rain, the pocosin holds water for a long time.","zh":"大雨过后，这种pocosin会长时间蓄水。"},{"en":"Wildlife refuges protect pocosins because they store carbon and support rare species.","zh":"野生动物保护区会保护pocosin，因为它们能储碳并支持一些稀有物种。"}]}],"synonyms":["wetland","swamp","bog","peatland"],"phonetic":"/ˈpoʊkəˌsɪn/","extraExplanation":["“pocosin”这个词来自北美原住民（阿尔冈昆语族）相关词源，常被解释为“高地上的沼泽/湿地”。它在生态学与地理写作中更常见，日常口语里不算常用。","不要把“pocosin”和地名混淆：美国弗吉尼亚州有城市名为“Poquoson”（拼写不同）。"]}
{"word":"pocosin","summary":{"en":"A pocosin is a peat-rich, shrub-filled wetland found mainly in the southeastern U.S.","zh":"pocosin指美国东南部常见的一种富含泥炭、灌木繁密的湿地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of wetland in the southeastern United States, usually a broad, flat area with acidic, peat-rich soil and dense shrubs (often between higher, drier land and salt marshes).","zh":"（美国东南部特有的）一种湿地类型，通常地势平坦开阔，土壤酸性且富含泥炭，灌木丛茂密（常位于较高的干地与盐沼之间）。"},"examples":[{"en":"The hikers crossed a pocosin filled with thick shrubs and spongy peat.","zh":"徒步者穿过一片pocosin，里面灌木很密，泥炭地踩上去软软的。"},{"en":"Wildlife biologists study how fires and floods shape pocosin habitats.","zh":"野生动物生物学家研究火灾和洪水如何塑造pocosin栖息地。"},{"en":"Pocosins can store large amounts of carbon in their peat soils.","zh":"pocosin的泥炭土可以储存大量碳。"}]}],"synonyms":["wetland","bog","swamp"],"phonetic":"/ˈpoʊkəˌsɪn/","extraExplanation":["“pocosin”主要用于美国地理与生态语境，尤其在北卡罗来纳等地常见（如 Pocosin Lakes）。","词源多被认为来自阿尔冈昆语系（Algonquian）原住民语言，常被解释为“高地上的沼泽/湿地”（swamp on a hill），因为这种湿地看起来像在较高、较干的地形上形成。","在自然写作与生态学文章中，pocosin常与“泥炭（peat）”“灌木沼泽（shrub bog）”“火生态（fire ecology）”等概念一起出现。"]}
{"word":"pocosins","summary":{"en":"“Pocosins” are peat-rich, acidic wetlands (swampy areas) found mainly in the southeastern United States, especially North Carolina.","zh":"“Pocosins”指泥炭丰富、偏酸的湿地/沼泽地，主要分布在美国东南部，尤以北卡罗来纳州最常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of pocosin) A type of wetland found mainly in the southeastern U.S., especially in North Carolina: a swampy, peat-rich area with acidic soil and dense shrubs.","zh":"（pocosin 的复数）美国东南部（尤以北卡罗来纳州）常见的一种湿地：泥炭丰富、土壤偏酸、灌木浓密的沼泽/湿地。"},"examples":[{"en":"Many rare plants and animals live in the pocosins of coastal North Carolina.","zh":"许多珍稀动植物生活在北卡沿海的 pocosins 湿地里。"},{"en":"After heavy rain, the pocosins hold water like a natural sponge.","zh":"暴雨过后，pocosins 会像天然海绵一样蓄水。"}]}],"synonyms":["wetlands","swamps","bogs","marshes"],"phonetic":"/ˈpoʊkəˌsɪnz/","extraExplanation":["“pocosin”是一个带有地域色彩的生态学词，常见于美国卡罗来纳沿海平原的地理与环境写作中。","词源通常被认为来自阿尔冈昆语系原住民语言，意思接近“在山（或高地）上的沼泽”。","与一般“swamp（沼泽）”相比，pocosin 往往泥炭层更厚、酸性更强、树木不一定高大，常见常绿灌木和松类；因此在野火、排水与湿地保护讨论中也经常出现。"]}
{"word":"pocoson","summary":{"en":"“Pocoson” (often spelled “pocosin”) means a swampy wetland area, common in the southeastern U.S., and is often seen in place names.","zh":"“pocoson”（更常拼作“pocosin”）指一种沼泽湿地，多见于美国东南部，并常用于地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low, wet, swampy area (a kind of bog or marsh), especially in the coastal plain of the southeastern United States; often used in place names","zh":"（尤指美国东南部沿海平原的）低洼潮湿的沼泽地；常见于地名中"},"examples":[{"en":"The trail passes through a pocoson filled with reeds and shallow water.","zh":"这条小径穿过一片长满芦苇、积着浅水的pocoson沼泽地。"},{"en":"Many local place names include the word “pocoson.”","zh":"许多当地地名里都含有“pocoson”这个词。"}]}],"synonyms":["pocosin","swamp","bog","marsh","wetland"],"phonetic":"/ˈpoʊkəˌsɪn/","extraExplanation":["“pocoson”更常见的拼写是“pocosin”，在美国卡罗来纳等地的地名与自然地理描述里很常用（如 Pocosin Lakes）。","词源通常认为来自美洲原住民（阿尔冈昆语系）相关词，指一种低洼湿地/沼泽环境。","注意不要和弗吉尼亚州的城市名“Poquoson”（拼写不同）混淆。"]}
{"word":"pocul","summary":{"en":"“pocul” is not a standard English word; it’s likely a misspelling (possibly “pocket”) or a Latin-based term (possibly “poculum”).","zh":"“pocul”不是标准英语单词；多半是拼写错误（可能是“pocket”）或拉丁语相关词（可能是“poculum”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/term from another language.","zh":"不是标准英语单词。更可能是拼写错误，或来自其他语言的人名/术语。"},"examples":[{"en":"I couldn’t find “pocul” in an English dictionary—did you mean “pocket” or “poculum”?","zh":"我在英语词典里找不到“pocul”——你是不是想写“pocket”或“poculum”？"},{"en":"Please share the full sentence, so I can help identify what “pocul” should be.","zh":"请把完整句子发出来，这样我能帮你判断“pocul”应该是什么词。"}]}],"phonetic":"/ˈpoʊkʌl/","extraExplanation":["“pocul”本身在现代英语里不常见（基本查不到标准词条）。常见可能性：\n1) 你想写的是 pocket（口袋）。\n2) 你可能遇到的是拉丁语 poculum（杯、酒杯），有时会出现在宗教/文学/学术语境中（如“圣杯/酒杯”的拉丁表达）。\n如果你把它出现的句子、来源（书/游戏/课程/聊天）或你想表达的意思发我，我可以更准确地帮你纠正并给出用法。"]}
{"word":"poculary","summary":{"en":"Vocabulary means the words someone knows/uses, or the set of words in a language or subject; it can also mean a word list for study.","zh":"Vocabulary 指某人掌握/使用的词汇，或某种语言/领域的词汇集合；也可指学习用的词汇表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"All the words a person knows or uses, or all the words used in a particular language or subject area.","zh":"（某人掌握或使用的）词汇量；（某种语言或某领域的）词汇。"},"examples":[{"en":"Reading every day can help you build your vocabulary.","zh":"每天阅读可以帮助你扩大词汇量。"},{"en":"Scientific vocabulary can be difficult at first.","zh":"科学类词汇一开始可能会比较难。"}]},{"partOfSpeech":"n.","definition":{"en":"A list of words (often with meanings) used for learning a language or a topic.","zh":"（用于学习语言或某主题的）词汇表（常带释义）。"},"examples":[{"en":"The teacher gave us a vocabulary list for the quiz.","zh":"老师给了我们一份测验用的词汇表。"}]}],"synonyms":["lexicon","word stock","word list","terminology"],"phonetic":"/voʊˈkæbjəˌlɛri/","extraExplanation":["“poculary”不是标准英文单词，最可能是把“vocabulary”拼错了。","vocabulary 常见搭配：build/expand/improve your vocabulary（扩大/提升词汇量）；technical vocabulary（专业词汇）；basic vocabulary（基础词汇）。","词源提示：vocabulary 来自拉丁语 vocabulum（“词、名称”），与 vocal（嗓音的）、voice（声音）有同源关系。"]}
{"word":"poculation","summary":{"en":"“Poculation” is not standard English; it is usually a misspelling of “population.”","zh":"“poculation”不是标准英语，通常是把“population”拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “population,” and sometimes confused with “copulation.”","zh":"非标准拼写；最常见是把“population（人口/群体）”拼错，也有人会与“copulation（交配/性交）”混淆。"},"examples":[{"en":"In academic writing, use “population,” not “poculation.”","zh":"在学术写作中应使用“population”，而不是“poculation”。"},{"en":"Did you mean “population growth” (number of people increasing)?","zh":"你是想说“population growth（人口增长）”吗？"},{"en":"Be careful: “copulation” is a different word with a sexual meaning.","zh":"注意：“copulation”是另一个词，含有性相关的含义。"}]}],"phonetic":"/ˌpɑːpjəˈleɪʃən/","extraExplanation":["“poculation”在标准英语词典中通常不作为正式单词出现，多半是拼写错误。","如果你想表达“人口/总数/某地区的人群”，正确词一般是 population（如：the population of China）。","如果你在生物学语境里看到类似拼写，需要确认是否其实是 copulation（交配/性交），这是含义与语域都更敏感的词，使用时要特别谨慎。"]}
{"word":"poculent","summary":{"en":"Poculent means “related to drinking; drinkable,” and in older usage can mean “intoxicating.”","zh":"poculent 指“与饮用有关的、可饮用的”，在较旧用法中也可指“使人醉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to drinking; potable or drinkable; sometimes also “intoxicating.”","zh":"（罕见）与饮用有关的；可饮用的；有时也指“使人醉酒的”。"},"examples":[{"en":"The traveler searched for a poculent spring in the dry valley.","zh":"旅行者在干旱的山谷里寻找一处可饮用的泉水。"},{"en":"Old medical texts sometimes used “poculent” to describe an intoxicating mixture.","zh":"一些旧医学文献有时用“poculent”来形容会使人醉酒的混合饮剂。"}]}],"synonyms":["potable","drinkable","intoxicating","inebriating"],"phonetic":"/ˈpɑkjələnt/","extraExplanation":["这个词非常少见，多见于古旧或学术性英语。词源来自拉丁语 *poculum*（“杯、酒杯”），因此和“喝、饮品”相关。现代英语里更常用的说法是 **drinkable / potable**（可饮用的）或 **intoxicating**（使人醉的）。"]}
{"word":"poculiform","summary":{"en":"Poculiform means “cup-shaped,” often used in scientific descriptions of form.","zh":"poculiform 意为“杯状的”，常用于科学语境中描述形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cup-shaped; shaped like a small bowl or goblet.","zh":"杯状的；像小碗或酒杯那样的形状。"},"examples":[{"en":"Some fungi have a poculiform body that looks like a tiny cup.","zh":"有些真菌的子实体呈杯状，看起来像一个小杯子。"},{"en":"The flower’s poculiform petals hold rainwater after a storm.","zh":"暴雨过后，这朵花杯状的花瓣会盛住雨水。"}]}],"synonyms":["cup-shaped","goblet-shaped","caliciform"],"phonetic":"/ˌpɑːkjəˈlɪfɔːrm/","extraExplanation":["“poculiform”较少见，多用于生物学、植物学、真菌学或形态学描述。","词源：来自拉丁语 *poculum*（杯子、酒杯）+ *-form*（形状），字面意思就是“杯子的形状”。","常见近义表达：*cup-shaped* 更口语、更常用；学术写作中也可能见到 *caliciform*（萼状/杯状，偏植物学语境）。"]}
{"word":"pocus","summary":{"en":"“Pocus” is usually seen in “hocus-pocus,” meaning a pretend magic spell or, more broadly, trickery/nonsense.","zh":"“pocus”多见于“hocus-pocus”，可指假装施法的咒语，也可泛指故弄玄虚的把戏或胡话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A magic word used in pretend spells, often said as part of “hocus-pocus.”","zh":"（常见于“hocus-pocus”中）用于假装施法的“魔法咒语/口头禅”。"},"examples":[{"en":"The kids waved their wands and shouted, “Hocus-pocus!”","zh":"孩子们挥舞魔杖，大喊：“Hocus-pocus！”"},{"en":"He said “hocus-pocus” like a stage magician.","zh":"他像舞台魔术师一样说着“hocus-pocus”。"}]},{"partOfSpeech":"n.","definition":{"en":"Trickery or nonsense talk used to confuse or impress people.","zh":"糊弄人的花招；故弄玄虚的话。"},"examples":[{"en":"Ignore the marketing pocus and read the facts.","zh":"别理那些营销的故弄玄虚，去看事实。"},{"en":"She called his explanation “pocus” and asked for proof.","zh":"她说他的解释是“糊弄”，并要求拿出证据。"}]}],"synonyms":["hocus-pocus","magic words","trickery","nonsense"],"phonetic":"/ˈpoʊkəs/","extraExplanation":["“pocus”单独使用并不常见，更自然的形式是固定搭配“hocus-pocus”，表示“变魔术时的咒语”或“故弄玄虚/骗人把戏”。","关于来源：常见说法认为“hocus-pocus”可能与早期魔术表演用语有关；也有人把它与拉丁语宗教用语的误听联系起来，但具体起源并不完全确定。"]}

