{"word":"pod","summary":{"en":"A pod is usually a seed case (like a pea pod), and it can also mean a small group or a small container/unit (like a coffee pod or escape pod).","zh":"pod 通常指“豆荚/荚”；也可指“一小群体”，或“胶囊/舱等小型容器或单元”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually long or oval case that holds seeds (such as peas or beans).","zh":"（豌豆、豆类等的）荚；豆荚（装种子的外壳）"},"examples":[{"en":"The peas are still in the pod.","zh":"豌豆还在豆荚里。"},{"en":"She opened the bean pod and counted the seeds.","zh":"她掰开豆荚，数了数里面的豆子。"}]},{"partOfSpeech":"n.","definition":{"en":"A small group of people, animals, or things that stay or work together.","zh":"（一起活动或协作的）小群体；小组"},"examples":[{"en":"A pod of dolphins followed the boat.","zh":"一群海豚跟着船游。"},{"en":"Students worked in pods for the project.","zh":"学生们以小组形式完成这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A detachable container or unit (for example, a coffee pod, a spacecraft pod, or a sleeping pod).","zh":"（可拆卸的）容器/单元（如咖啡胶囊、太空舱、睡眠舱等）"},"examples":[{"en":"I bought coffee pods for the machine.","zh":"我买了咖啡胶囊配咖啡机用。"},{"en":"The astronaut climbed into the escape pod.","zh":"宇航员爬进了逃生舱。"}]},{"partOfSpeech":"vi.","definition":{"en":"To produce or form pods (of plants).","zh":"（植物）结荚；长出豆荚"},"examples":[{"en":"These peas pod well in warm weather.","zh":"这些豌豆在暖和的天气里结荚很好。"}]}],"synonyms":["seedpod","capsule","container","group","cluster"],"phonetic":"/pɑd/","extraExplanation":["“pod”最常见的核心意思是“豆荚/荚”，因此延伸出“把东西包在一个小容器里”的感觉，才会用在 coffee pod（咖啡胶囊）、escape pod（逃生舱）等搭配中。","常见习语：two peas in a pod（像一个模子刻出来的；非常相像/形影不离）。例：They’re like two peas in a pod.（他们俩特别像。）","现代用法里也常见 podcast（播客）。有时人们把一起录播客的一小群人戏称为 a pod。"]}
{"word":"poda","summary":{"en":"“Poda” is usually a Tamil informal exclamation meaning “go away,” but it can also be a Spanish/Portuguese noun meaning “pruning.”","zh":"“Poda”常见为泰米尔语的非正式感叹词，意思是“走开”；也可能是西/葡语名词，表示“修剪”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Tamil; informal) “Go away,” “Get lost,” or “Leave me alone.”","zh":"（泰米尔语；非正式）“走开”“滚开”“别烦我”。"},"examples":[{"en":"He was annoyed and said, “Poda!”","zh":"他很烦，说了句“Poda！（走开！）”。"},{"en":"In some Tamil movies, characters shout “Poda!” during arguments.","zh":"在一些泰米尔电影里，人物吵架时会喊“Poda！”"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish/Portuguese) pruning; the act of cutting plants/trees to shape them or help them grow.","zh":"（西班牙语/葡萄牙语）修剪；为塑形或促进生长而修剪植物/树木。"},"examples":[{"en":"La poda de los árboles is important in winter.","zh":"树木的修剪在冬天很重要。"},{"en":"After poda, the garden looked neater.","zh":"修剪后，花园看起来更整洁了。"}]}],"synonyms":["go away","get lost","leave me alone","pruning"],"phonetic":"/ˈpoʊdə/","extraExplanation":["“Poda”最常在网络/影视语境中作为泰米尔语口语出现，语气从不耐烦到带攻击性都有；对不熟悉文化背景的人来说可能显得很粗鲁，建议谨慎使用。","如果你是在英语对话里看到“poda”，它通常不是标准英语词，而是外来语/网络用语；需要结合说话人的地区（如印度泰米尔语圈）来判断意思。"]}
{"word":"podagra","summary":{"en":"Podagra means gout in the big toe/foot, causing sudden severe pain and swelling.","zh":"podagra 指累及大脚趾/足部的痛风发作，常突然剧痛并伴红肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gout that affects the big toe (or sometimes the foot), causing sudden, severe pain, redness, and swelling.","zh":"（常指累及大脚趾或足部的）痛风发作，特点是突然剧痛、红肿与发炎。"},"examples":[{"en":"He woke up with podagra, and even the bedsheet touching his big toe hurt.","zh":"他一觉醒来大脚趾痛风（podagra）发作，连被单碰到都疼。"},{"en":"The doctor suspected podagra because the pain started suddenly in the base of the big toe.","zh":"医生怀疑是大脚趾痛风（podagra），因为疼痛突然发生在大脚趾根部。"}]}],"synonyms":["gout (in the big toe)","gouty arthritis (of the big toe)","acute gout"],"phonetic":"/pɑˈdæɡrə/","extraExplanation":["词源：来自希腊语 *pous/podos*（脚）+ *agra*（“抓住、捕捉”之意），字面感觉像“脚被抓住”，形容痛风发作时那种突然而剧烈的疼痛。","使用场景：这是偏医学/书面用词；日常更常说 *gout (in the big toe)*（大脚趾痛风）。在较旧的医学文献或文学中也较常见，用来强调“典型的痛风位置”。"]}
{"word":"podagral","summary":{"en":"Podagral means “gout-related,” especially gout in the foot or big toe.","zh":"podagral 指“与痛风有关的”，尤指足部或大脚趾的痛风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to gout, especially gout affecting the foot (classically the big toe)","zh":"与痛风有关的；尤指发生在足部（典型为大脚趾）的痛风"},"examples":[{"en":"He had podagral pain in his big toe and could barely walk.","zh":"他的大脚趾出现典型的痛风性疼痛，几乎走不了路。"},{"en":"The doctor suspected a podagral attack based on the sudden swelling and redness in the foot.","zh":"医生根据足部突然肿胀、发红，怀疑是一次足部痛风发作。"}]}],"synonyms":["gouty","podagric"],"phonetic":"/pəˈdæɡrəl/","extraExplanation":["“podagral”来自希腊语词根：pous/pod-（脚）+ agra（捕捉、袭击），对应名词“podagra”（足部痛风，尤指大脚趾）。在现代英语中多用于医学或较正式的语境。"]}
{"word":"podagras","summary":{"en":"Podagra is a medical term for gout in the big toe/foot, often with sudden severe pain and swelling.","zh":"Podagra 是“足痛风”的医学用语，指大脚趾/足部的痛风，常突发剧痛与肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Gout that affects the big toe (or the foot), often causing sudden, severe pain and swelling; also used for a painful attack of gout in that area.","zh":"（医学）足痛风：主要发生在大脚趾（或足部）的痛风，常表现为突发的剧烈疼痛与肿胀；也可指一次足部痛风发作。"},"examples":[{"en":"He woke up with podagra, and even the bedsheet touching his toe hurt.","zh":"他因足痛风发作而醒来，连被单碰到脚趾都疼。"},{"en":"The doctor suspected gout, specifically podagra, because the pain was centered in the big toe.","zh":"医生怀疑是痛风，尤其是足痛风，因为疼痛集中在大脚趾。"},{"en":"In older medical writing, podagra was a common term for painful gout in the foot.","zh":"在较早的医学写作中，“podagra”常用来指足部痛风引起的疼痛。"}]}],"synonyms":["gout","gout attack","gout flare","gout in the big toe"],"phonetic":"/poʊˈdæɡrə/","extraExplanation":["“podagra”是较偏医学/书面语的词，日常英语更常说“gout in the big toe（大脚趾痛风）”或直接说“gout（痛风）”。","词源来自希腊语：pous/podos（脚）+ agra（捕捉/突袭），字面有“脚被突然抓住”的感觉，形容痛风发作来得急、痛得厉害。","你输入的“podagras”通常是复数形式，表示多次发作或多个病例；单数是“podagra”。"]}
{"word":"podagric","summary":{"en":"“Podagric” means relating to gout, especially gout in the foot or big toe.","zh":"“podagric”指与痛风有关，尤指足部/大脚趾的痛风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to gout, especially gout that affects the foot (classically the big toe).","zh":"与痛风有关的；尤指发生在足部（典型为大脚趾）的痛风。"},"examples":[{"en":"The doctor suspected a podagric attack because his big toe was red, hot, and extremely painful.","zh":"医生怀疑是足部痛风发作，因为他的大脚趾又红又热，而且疼得厉害。"},{"en":"Podagric pain can make even a light bedsheet feel unbearable.","zh":"足部痛风的疼痛可能会让一条轻薄的被单都变得难以忍受。"}]}],"synonyms":["gouty","podagral","arthritic (broader)"],"phonetic":"/pəˈdæɡrɪk/","extraExplanation":["“podagric”较偏医学/文学用语，日常更常说“gouty”（痛风的/像痛风的）或直接说“gout in the big toe”（大脚趾的痛风）。","词源来自希腊语“podagra”，意为“脚的陷阱/夹子”，形象地描写痛风像把脚“夹住”一样疼。在旧文学和医学记载中常见“podagra”（足部痛风）这一说法。"]}
{"word":"podagrical","summary":{"en":"Podagrical means “related to gout,” especially gout affecting the foot or big toe.","zh":"podagrical 表示“与痛风有关的”，尤其指发生在足部或大脚趾的痛风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to gout (especially gout in the foot, traditionally the big toe).","zh":"与痛风有关的（尤指足部/大脚趾的痛风）。"},"examples":[{"en":"The doctor noted podagrical pain in his right big toe.","zh":"医生记录他右脚大脚趾有典型的痛风性疼痛。"},{"en":"Podagrical attacks can make walking difficult.","zh":"痛风性发作会让走路变得困难。"}]}],"synonyms":["gouty","podagric"],"phonetic":"/ˌpɑˈdæɡrɪkəl/","extraExplanation":["“Podagrical”较少见，来自“podagra（足痛风/大脚趾痛风）”。podagra 源自希腊语：pous/pod-（脚）+ agra（抓住、捕捉），形象地表示“痛风像被夹住一样抓住脚”。在现代医学英语里更常用的形容词是“gouty（痛风的）”，而“podagrical”带有更文学或较旧的书面色彩。"]}
{"word":"podagrous","summary":{"en":"Podagrous means ‘related to gout’ or ‘affected by gout,’ especially in the foot/big toe; it can also be a literary way to describe stiff, painful movement.","zh":"podagrous 指“与痛风有关/患痛风的”，尤指脚或大脚趾；也可作文学描写，指行动僵硬疼痛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to gout; affected by gout, especially in the feet (often the big toe).","zh":"与痛风有关的；患痛风的（尤指脚部/大脚趾）。"},"examples":[{"en":"He had a podagrous attack in his right big toe.","zh":"他的右脚大脚趾痛风发作。"},{"en":"The doctor noted podagrous swelling and redness around the joint.","zh":"医生记录到关节周围有痛风性的肿胀和发红。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/old-fashioned) Like someone who has gout—moving stiffly or painfully.","zh":"（文学/较旧用法）像痛风患者一样的；行动僵硬或疼痛的。"},"examples":[{"en":"The old man rose with a podagrous limp.","zh":"老人起身时一瘸一拐，像痛风发作般疼痛僵硬。"},{"en":"In the novel, the judge is described as podagrous and irritable.","zh":"小说里法官被描写成患痛风、脾气暴躁。"}]}],"synonyms":["gouty","arthritic (less exact)","rheumatic (less exact)"],"phonetic":"/pəˈdæɡrəs/","extraExplanation":["“podagrous”来自希腊语“podagra”（痛风，字面是“抓住脚”的意思），所以它常和脚/大脚趾联系在一起。","这是偏医学或文学描写的词；日常英语里更常说“gouty”（痛风的）或直接说“has gout”（患痛风）。"]}
{"word":"podagry","summary":{"en":"Podagry means gout, especially gout in the foot (often the big toe).","zh":"Podagry 指痛风，尤指足部（常见于大脚趾）的痛风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"gout, especially when it affects the foot (often the big toe).","zh":"痛风，尤指发生在足部（常见于大脚趾）的痛风。"},"examples":[{"en":"The doctor suspected podagry because the pain and swelling started in his big toe.","zh":"医生怀疑是足部痛风，因为疼痛和肿胀从他的大脚趾开始。"},{"en":"In older texts, podagry is sometimes used as a formal or old-fashioned word for gout.","zh":"在较早的文本中，podagry 有时被用作“痛风”的一种正式或古老说法。"}]}],"synonyms":["gout","podagra"],"phonetic":"/ˈpɑdəɡri/","extraExplanation":["该词较为少见、偏文学或医学旧用法；现代英语里更常直接说 gout（痛风）。","词源来自希腊语 podagra，意为“抓住脚的东西”（pod- 脚 + agra 抓住/陷阱），形象描述痛风发作时脚像被“夹住”一样疼。"]}
{"word":"podal","summary":{"en":"“Podal” means “related to the foot,” mainly used in medical/anatomical contexts.","zh":"“podal”意为“与脚/足有关的”，多用于医学或解剖语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the foot (especially in anatomy or medicine).","zh":"（尤指解剖或医学中）与脚/足有关的。"},"examples":[{"en":"The doctor noted podal swelling after the injury.","zh":"医生记录到受伤后足部出现肿胀。"},{"en":"Podal muscles help support the arch of the foot.","zh":"足部肌肉帮助支撑足弓。"}]}],"synonyms":["pedal","podiatric","of the foot"],"phonetic":"/ˈpoʊdəl/","extraExplanation":["“podal”比较少见，更常见的相关词有：pedal（与脚有关/脚踏的）、podiatry（足病学）、podology（足部学）。","词根 pod- 来自希腊语 pous/pod-（“脚”），因此在一些医学或生物学术语里会看到（如 arthropod 节肢动物：arthro- 关节 + -pod 脚）。"]}
{"word":"podalgia","summary":{"en":"“Podalgia” is a medical word meaning pain in the foot (foot pain).","zh":"“Podalgia” 是医学词，意思是脚部疼痛（足痛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in the foot; foot pain (medical term).","zh":"足痛；脚痛（医学用语）。"},"examples":[{"en":"The doctor noted podalgia after the long hike.","zh":"长途徒步后，医生记录了他的足痛（podalgia）。"},{"en":"She stopped running because of podalgia in her right foot.","zh":"由于右脚足痛，她停止了跑步。"},{"en":"Common causes of podalgia include plantar fasciitis and ill-fitting shoes.","zh":"足痛的常见原因包括足底筋膜炎和不合脚的鞋子。"}]}],"synonyms":["foot pain","pain in the foot"],"phonetic":"/poʊˈdæl.dʒə/","extraExplanation":["词源上，pod- 来自希腊语，意思是“脚”；-algia 也来自希腊语，表示“疼痛”。因此 podalgia 字面意思就是“脚的疼痛”。在日常英语里更常说 foot pain，而 podalgia 更偏医学/书面表达。"]}
{"word":"podalic","summary":{"en":"Podalic means “related to the foot,” mainly used in technical/medical English.","zh":"podalic 指“与脚/足部有关的”，多见于医学或技术英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the foot; foot-shaped or positioned at the foot (used mainly in technical or medical contexts).","zh":"与脚（足部）有关的；脚形的；位于足部的（多用于医学或技术语境）。"},"examples":[{"en":"The doctor noted podalic pain after the long hike.","zh":"医生记录了长途徒步后出现的足部（脚部）疼痛。"},{"en":"In anatomy class, we discussed podalic structures such as the toes and arch.","zh":"在解剖课上，我们讨论了足部结构，例如脚趾和足弓。"}]}],"synonyms":["pedal","podal","of the foot"],"phonetic":"/poʊˈdælɪk/","extraExplanation":["“podalic”比较少见，更常见的对应词是“pedal”（与脚有关的）或“podal”（足部的）。在医学里更常用“pedal pulse（足背动脉搏动）”“plantar（足底的）”“dorsal（背侧的）”等更具体的词。","词源提示：来自希腊语词根 pod-（脚、足），同源词包括“podiatry（足病学）”“podium（讲台，原意与“脚/足”有关）”。"]}
{"word":"podaliriidae","summary":{"en":"Podaliriidae is an older taxonomic family name for certain swallowtail butterflies, largely replaced by Papilionidae in modern usage.","zh":"Podaliriidae 是旧式分类中用于某些凤蝶的“科”名，现代用法多被 Papilionidae（凤蝶科）取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (taxonomic) family name used in some older classifications for swallowtail butterflies; it is generally treated today as part of (or replaced by) the family Papilionidae.","zh":"（分类学）一个在较早分类体系中使用的名称，指一类凤蝶；现代多将其视为并入或被“Papilionidae（凤蝶科）”取代。"},"examples":[{"en":"In older entomology books, Podaliriidae may appear as a family grouping for certain swallowtail butterflies.","zh":"在一些较早的昆虫学书籍里，Podaliriidae 可能作为某些凤蝶的“科”名出现。"},{"en":"Most modern sources place these butterflies under Papilionidae rather than using Podaliriidae.","zh":"多数现代资料会把这些蝴蝶归入 Papilionidae（凤蝶科），而不再使用 Podaliriidae。"}]}],"synonyms":["Papilionidae (modern family name)","swallowtail butterflies (common-language group)"],"phonetic":"/ˌpoʊdəˈlɪriɪˌdiː/","extraExplanation":["这是一个拉丁化的分类名称，词尾 -idae 常用于动物“科”的命名（如 Felidae 猫科）。","名称与希腊神话人物 Podalirius（波达利里俄斯，医神阿斯克勒庇俄斯之子）有关；昆虫分类中常用神话人物或古典人物为类群命名。","不同年代或学派的分类体系会调整“科/亚科/族”等层级，因此你可能在旧文献中见到 Podaliriidae，而在新文献中对应到 Papilionidae 或其下的某个亚群。"]}
{"word":"podalirius","summary":{"en":"Podalirius is a mythological Greek healer (son of Asclepius) and also a scientific name used for the scarce swallowtail butterfly.","zh":"Podalirius 指希腊神话中的医师（医神之子），也用作欧洲“条纹凤蝶/稀有凤蝶”的学名来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A famous physician in Homer’s Iliad, son of Asclepius, who served as a healer for the Greek army at Troy.","zh":"（希腊神话）《伊利亚特》中著名的医师之一，医神阿斯克勒庇俄斯之子，在特洛伊战争中为希腊军队行医。"},"examples":[{"en":"In the Iliad, Podalirius and his brother Machaon treat wounded soldiers on the battlefield.","zh":"在《伊利亚特》中，波达利里俄斯与兄弟马卡翁在战场上为伤兵治疗。"},{"en":"The name Podalirius is often mentioned when discussing early “hero-physicians” in Greek legend.","zh":"谈到希腊传说中的早期“英雄医师”时，常会提到波达利里俄斯这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in science for the scarce swallowtail butterfly (Iphiclides podalirius), a European species named after the mythological figure.","zh":"（生物学）用于“条纹凤蝶/稀有凤蝶”（Iphiclides podalirius）这一欧洲蝴蝶物种的名称，取名源自同名神话人物。"},"examples":[{"en":"Iphiclides podalirius is commonly called the scarce swallowtail in English.","zh":"Iphiclides podalirius 在英文中常被称为“scare swallowtail（条纹凤蝶/稀有凤蝶）”。"},{"en":"The species name podalirius reflects how classical mythology influenced scientific naming.","zh":"物种名 podalirius 体现了古典神话对科学命名的影响。"}]}],"synonyms":["Podaleirius"],"phonetic":"/ˌpoʊdəˈlɪriəs/","extraExplanation":["“Podalirius”是拉丁化的拼写，来源于古希腊语形式；英文里也偶见不同转写（如 Podaleirius）。","在《伊利亚特》的传统中，他与兄弟 Machaon 常被并提：两人都是“医神之子”，象征医术与战争的交织。","许多动植物学名借用希腊罗马神话人物名，用来赋予物种一种“古典文化”的联想（如英雄、神祇、特征象征等）。"]}
{"word":"podanger","summary":{"en":"“Podanger” isn’t a standard word; it’s most likely “pose a danger” = create a risk or threat.","zh":"“podanger”不是标准单词；多半是“pose a danger”，表示“构成危险/造成威胁”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not standard English) “podanger” is likely a misspelling of the phrase “pose a danger,” meaning to create a risk or threat.","zh":"（非标准英语）“podanger”很可能是短语“pose a danger”的拼写错误，意思是“造成危险/构成威胁”。"},"examples":[{"en":"Loose wires can pose a danger to children.","zh":"松动的电线可能会对孩子构成危险。"},{"en":"Driving while tired poses a danger to everyone on the road.","zh":"疲劳驾驶会对路上的每个人造成危险。"}]}],"synonyms":["pose a risk","be dangerous","threaten","endanger (someone)"],"phonetic":"/poʊz ə ˈdeɪndʒɚ/","extraExplanation":["“pose a danger”里 pose 的意思是“造成/带来（风险、问题）”，不是“摆姿势”。常见搭配：pose a risk / pose a threat / pose a problem。","如果你想表达“把某人置于危险中”，更常用：endanger someone / put someone in danger。"]}
{"word":"podarge","summary":{"en":"Podarge is a harpy in Greek mythology, sometimes said to be the mother of Achilles’ horses.","zh":"Podarge 是希腊神话中的一位鹰身女妖，有时被说成是阿基里斯战马的母亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A harpy named Podarge, often described as a swift, storm-like creature; in some stories she is the mother of Achilles’ horses by the West Wind (Zephyrus).","zh":"（希腊神话）名为“波达耳革（Podarge）”的鹰身女妖（哈耳庇厄），常被描写为迅疾如暴风的怪物；某些传说中她与西风神泽费罗斯（Zephyrus）结合，生下阿基里斯的战马。"},"examples":[{"en":"In Greek myth, Podarge is a harpy linked with the birth of Achilles’ immortal horses.","zh":"在希腊神话中，Podarge 与阿基里斯的不死战马的来历有关。"},{"en":"Some writers use Podarge as a symbol of sudden, destructive winds.","zh":"一些作家会用 Podarge 来象征突然而具破坏性的狂风。"}]}],"synonyms":["harpy (as a general category)"],"phonetic":"/poʊˈdɑrɡi/","extraExplanation":["“Podarge”常见于古典文学与神话注释中，不是现代英语的常用词，更像专有名词（人名/怪物名）。","在《伊利亚特》相关的传说体系里，她常被说成与西风泽费罗斯生下名马（如 Xanthus 与 Balius），因此她的名字有时会在讨论阿基里斯、特洛伊战争或“神话血统”时出现。","在阅读古典作品、诗歌或奇幻题材时，遇到 Podarge 往往是在营造“阴森、风暴、掠夺”的意象；可联想同类词 harpy（鹰身女妖）、Zephyrus（西风）。"]}
{"word":"podargidae","summary":{"en":"Podargidae is the scientific family name for frogmouths—nocturnal, camouflage-using birds of Australasia and nearby regions.","zh":"Podargidae 是“蛙口夜鹰”的科学科名，指主要分布在澳大拉西亚及周边地区、善于伪装的夜行性鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of nocturnal birds known as frogmouths, found mainly in Australia, New Guinea, and Southeast Asia","zh":"夜行性鸟类的一个科，称为“蛙口夜鹰（frogmouths）”，主要分布在澳大利亚、新几内亚及东南亚"},"examples":[{"en":"The tawny frogmouth is a well-known member of the family Podargidae.","zh":"灰蛙口夜鹰（tawny frogmouth）是蛙口夜鹰科（Podargidae）里很有名的一种。"},{"en":"Podargidae birds often sit very still and rely on camouflage to avoid predators.","zh":"蛙口夜鹰科的鸟常常一动不动，依靠伪装来躲避天敌。"}]}],"synonyms":["frogmouths","frogmouth family"],"phonetic":"/poʊˈdɑrdʒɪdi/","extraExplanation":["“Podargidae”是鸟类分类学中的“科名”（family name），日常英语里更常直接说“frogmouth(s) / 蛙口夜鹰”。","词源上与希腊语构词有关：pod-（脚）+ -argus（常见于古希腊词根/专名中），用于学名体系；作为拉丁化的科名，通常首字母大写（Podargidae）。","学习提示：不要把frogmouths和nightjars（夜鹰科）混为一谈；它们外形相似、都夜行，但属于不同的鸟类科。"]}
{"word":"podarginae","summary":{"en":"Podarginae is the scientific name for a subfamily of frogmouth birds.","zh":"Podarginae 是蛙口夜鹰类鸟的一个“亚科”的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological subfamily of frogmouths (nocturnal birds) within the family Podargidae, found mainly in Australia and nearby regions.","zh":"（生物分类）蛙口夜鹰科（Podargidae）中的一个亚科，成员为蛙口夜鹰类的夜行鸟，主要分布在澳大利亚及周边地区。"},"examples":[{"en":"The genus Podargus is commonly placed in the subfamily Podarginae.","zh":"Podargus（蛙口夜鹰属）通常被归入Podarginae（蛙口夜鹰亚科）。"},{"en":"Researchers compared the calls of Podarginae species across different Australian habitats.","zh":"研究人员比较了不同澳大利亚栖息地中Podarginae物种的鸣叫。"}]}],"synonyms":["frogmouth subfamily","subfamily Podarginae"],"phonetic":"/poʊˈdɑrdʒɪniː/","extraExplanation":["这是一个较少在日常英语中出现的“学术/科普用词”，主要用于鸟类学与生物分类学文章中。","词尾“-inae”常见于动物分类学中的“亚科”名称（subfamily），比如Felinae（猫亚科）。因此看到类似拼写时，往往可以判断它是分类阶元名称。","蛙口夜鹰（frogmouth）因嘴部宽大、张口形似“蛙口”而得名；它们多在夜间活动，白天常伪装成树枝停栖。"]}
{"word":"podargine","summary":{"en":"Podargine means “gout-related,” especially gout affecting the foot; it is also a rare noun for a person with gout.","zh":"podargine 指“与痛风有关的（尤指足部痛风）”；也可作罕见名词指“痛风患者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affected by gout (especially gout in the foot).","zh":"与痛风有关的；（尤指）足部痛风的；患痛风的。"},"examples":[{"en":"The doctor noted podargine pain in his big toe after the rich holiday meals.","zh":"医生注意到在节日大吃大喝后，他的大脚趾出现了典型的痛风性疼痛。"},{"en":"In older texts, podargine sufferers are often described as limping or avoiding long walks.","zh":"在较早的文本中，痛风患者常被描写为跛行或避免长距离行走。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who has gout.","zh":"（罕见）痛风患者。"},"examples":[{"en":"The pamphlet warned that a podargine should limit alcohol and organ meats.","zh":"小册子警告痛风患者应限制酒精和动物内脏的摄入。"}]}],"synonyms":["gouty","podagrine"],"phonetic":"/pəˈdɑr.dʒaɪn/","extraExplanation":["“podargine”较少见，更多时候会看到近义词/近形词“podagrine”（同样指痛风性的）。它们都源自“podagra”（足部痛风），词根来自希腊语，字面含义与“脚/足”和“抓住/夹住（疼痛发作）”相关。","在文学或历史描写里，这类词常用来塑造“富贵病”的意象：因饮食丰盛、饮酒而引发的痛风，常见于对上层阶层生活方式的讽刺或写实。"]}
{"word":"podargue","summary":{"en":"Podargue is a rare, old term for gout in the foot (especially the big toe).","zh":"podargue 是一个罕见的旧词，指足部（尤指大脚趾）的痛风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) Gout, especially when it affects the big toe or foot.","zh":"（罕见/旧式用法）痛风，尤指发生在大脚趾或足部的痛风发作。"},"examples":[{"en":"He was laid up with podargue and could barely walk.","zh":"他因痛风（podargue）而卧床，几乎走不了路。"},{"en":"In older medical writing, podargue often referred to gout in the foot.","zh":"在较早的医学写作中，podargue 常用来指足部的痛风。"}]}],"synonyms":["gout","podagra"],"phonetic":"/pəˈdɑrɡ/","extraExplanation":["podargue 是非常少见的词形，多见于旧文或旧译。现代英语里更常用的词是 gout（痛风），或更专门的 podagra（大脚趾痛风）。","词源上与希腊语有关：pod- 表“脚”，-agra 表“捕捉/疼痛发作”，形象地指“脚被痛抓住”。","如果你是在医学语境里遇到它，写作或口语中通常建议用 gout；若要强调“大脚趾痛风”，用 podagra 更标准。"]}
{"word":"podargus","summary":{"en":"Podargus is the scientific genus name for several frogmouth birds, especially in Australia.","zh":"Podargus 是蛙口夜鹰属的学名，指一类主要分布在澳大利亚的蛙口夜鹰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of frogmouth birds (family Podargidae), found mainly in Australia and nearby regions; these nocturnal birds are known for their wide, frog-like mouths and excellent camouflage.","zh":"蛙口夜鹰属（蛙口夜鹰科）的一个鸟类属，主要分布于澳大利亚及周边地区；为夜行性鸟类，以“像青蛙一样宽的嘴”和极强的伪装能力而著名。"},"examples":[{"en":"The tawny frogmouth belongs to the genus Podargus.","zh":"茶色蛙口夜鹰属于蛙口夜鹰属（Podargus）。"},{"en":"At night, a Podargus frogmouth may sit motionless on a branch to blend in with the bark.","zh":"夜里，蛙口夜鹰属（Podargus）的蛙口夜鹰常一动不动地停在树枝上，与树皮融为一体。"}]}],"synonyms":["frogmouth (general name)"],"phonetic":"/poʊˈdɑrɡəs/","extraExplanation":["“Podargus”是生物分类学中的拉丁化属名，常用于学术或科普语境，不是日常英语中常见词。","词源来自希腊语“podargos”（意为“脚快的、迅捷的”），在古典语境里也曾用作神话中骏马的名字；用于鸟类属名更多是命名传统，并非指蛙口夜鹰真的以速度见长。","相关常见词：frogmouth（蛙口夜鹰，常指这一类鸟的统称）；tawny frogmouth（茶色蛙口夜鹰，澳大利亚常见种）。"]}
{"word":"podarthral","summary":{"en":"A rare medical adjective meaning “related to pain in the joints of the foot.”","zh":"一个较罕见的医学形容词，意思是“与足部关节疼痛有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to pain in the joints of the foot; connected with foot joint pain.","zh":"（医学）与足部关节疼痛有关的；与脚部关节痛相关的。"},"examples":[{"en":"The clinician considered a podarthral condition after the patient reported pain in the toe joints.","zh":"患者描述脚趾关节疼痛后，临床医生考虑这可能是与足部关节痛相关的情况。"},{"en":"Podarthral symptoms can make walking or standing for long periods difficult.","zh":"与足部关节痛相关的症状会让长时间走路或站立变得困难。"}]}],"synonyms":["podarthralgic","foot-joint pain (descriptive)"],"phonetic":"/ˌpoʊdɑrˈθræl/","extraExplanation":["“podarthral”在现代英语中非常少见，多见于医学写作或词根构词中。更常见的标准医学词是 **podarthralgia**（足/足部关节痛：*pod-* 足 + *arthr-* 关节 + *-algia* 疼痛）。如果你是在报告或检查单里看到这个词，建议核对是否原文其实是 **podarthralgia**。"]}
{"word":"podarthritis","summary":{"en":"Podarthritis means arthritis (joint inflammation) in the foot.","zh":"podarthritis 指“足部关节炎”，即足部关节的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of one or more joints in the foot; arthritis affecting the foot.","zh":"足部关节炎；发生在足部一个或多个关节的炎症。"},"examples":[{"en":"He was diagnosed with podarthritis after months of pain in his toes and midfoot.","zh":"他脚趾和足中部疼了几个月后，被诊断为足部关节炎。"},{"en":"Proper shoes and physical therapy helped reduce swelling from podarthritis.","zh":"合适的鞋子和物理治疗帮助减轻了足部关节炎引起的肿胀。"}]}],"synonyms":["foot arthritis","arthritis of the foot"],"phonetic":"/ˌpɑdɑrˈθraɪtɪs/","extraExplanation":["这是比较少见、偏医学书面用词，日常英语里更常说 foot arthritis（足部关节炎）。","词源构词：pod- 表示“足/脚”（来自希腊语 pous/pod-），arthritis 表示“关节炎”。","有些情况下足部的急性疼痛与肿胀可能由 gout（痛风）引起；但 podarthritis 本身是泛称，未必特指痛风。"]}
{"word":"podarthrum","summary":{"en":"A rare technical word meaning a joint of the foot (often the ankle).","zh":"一个很罕见的技术用词，指足部的关节（常指踝关节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/technical) A joint of the foot; especially the ankle area (a Latinized/Greek-based anatomical term).","zh":"（罕见/技术用语）足部的关节；尤指踝部附近的关节（源自希腊语词根的拉丁化解剖学用词）。"},"examples":[{"en":"The injury affected the podarthrum, making it painful to bear weight.","zh":"这次受伤影响到踝部关节，导致负重时疼痛。"},{"en":"Older anatomical notes sometimes use podarthrum for the foot joint.","zh":"一些较早的解剖学笔记里会用 podarthrum 来指足部关节。"}]}],"synonyms":["ankle joint","foot joint"],"phonetic":"/poʊˈdɑrθrəm/","extraExplanation":["这个词在现代英语里非常少见，通常不会在日常医学或解剖学教材中出现。你更常见到的说法是 ankle joint（踝关节）或 joint of the foot（足部关节）。","词形上可拆解为 pod-（与“脚/足”相关）+ arthr-（与“关节”相关），和 arthritis（关节炎）、arthroscopy（关节镜）是同一词根系统。","如果你是在某篇特定文章/课本里看到 podarthrum，可能是旧式术语、排版/拼写变体，或专门领域的用法；把原句发我可以帮你更准确判断。"]}
{"word":"podatus","summary":{"en":"Podatus is an early chant notation sign meaning two notes on one syllable, moving upward.","zh":"Podatus是一种早期圣咏记谱符号，表示同一音节唱两个音并向上行进。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of Gregorian-chant neume (early musical notation) showing two notes sung on one syllable, moving upward from a lower note to a higher note.","zh":"（格里高利圣咏的）一种纽姆符号（早期乐谱记号），表示同一音节上唱两个音，并从低音上行到高音。"},"examples":[{"en":"In the manuscript, the word “Do-” is marked with a podatus, so the melody rises on that syllable.","zh":"在手稿里，“Do-”这个音节上标了podatus，因此旋律在该音节上行。"},{"en":"The singer treats the podatus as two connected notes rather than two separate syllables.","zh":"歌者把podatus当作两个连贯的音来唱，而不是两个不同的音节。"}]}],"synonyms":["pes","neume"],"phonetic":"/poʊˈdeɪtəs/","extraExplanation":["podatus常见于中世纪的格里高利圣咏记谱系统，属于“纽姆（neume）”的一种：纽姆是五线谱普及前的记谱方式，更多提示旋律走向与唱法。","在一些传统术语中，podatus也常被称为pes（拉丁语“脚”），与表示下行的clivis相对：podatus提示“上行两音”。","不同抄本传统（如圣加仑 St. Gall 记谱）中，podatus的写法可能略有差异，但核心意义仍是“同一音节上的两音上行”。"]}
{"word":"podaxonia","summary":{"en":"Podaxonia is a rare scientific (genus) name for certain desert mushrooms, often treated today under Podaxon.","zh":"Podaxonia 是一个较少见的真菌属名，用于指某些沙漠蘑菇；现代资料中常将其并入/写作 Podaxon。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific name used for a group (genus) of desert-dwelling mushrooms; in many modern sources this group is treated under the genus name Podaxon.","zh":"（生物分类）一种生长在干旱/沙漠地区的蘑菇类群（属名）；在不少较新的资料中，这一类群常归入“Podaxon（足轴菌属）”之下。"},"examples":[{"en":"Podaxonia was reported from sandy soils in arid regions.","zh":"文献记录 Podaxonia 生长于干旱地区的沙质土壤中。"},{"en":"Some older field guides use Podaxonia, while newer ones list the genus as Podaxon.","zh":"一些较早的野外图鉴用 Podaxonia，而较新的资料则把该属写作 Podaxon。"}]}],"synonyms":["Podaxon","(stalked puffball—common-name description)"],"phonetic":"ˌpoʊdækˈzoʊniə","extraExplanation":["这是一个比较少见的学术用词，通常作为拉丁化的属名使用，所以常见写法会首字母大写（Podaxonia）。","在生物分类中，属名有时会因研究更新而发生调整或出现不同的同物异名；因此你可能会在旧文献与新资料里看到不同的拼写或归并（如 Podaxonia / Podaxon）。"]}
{"word":"podaxonial","summary":{"en":"“Podaxonial” is not a standard English word; it’s likely a misspelling. Share the context to identify the intended term (often adaxial/abaxial in biology).","zh":"“podaxonial”不是标准英语词；很可能是拼写错误。提供语境可帮助确认你真正想用的术语（生物学中常见为 adaxial/abaxial）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or nonstandard/rare technical form. People who write “podaxonial” often mean a different biology/anatomy term (for example, “adaxial/abaxial” in botany, or another similar-sounding adjective).","zh":"不是标准英语单词；很可能是拼写错误或极少见的非标准技术用语。写“podaxonial”的人通常想表达其他生物/解剖学术语（例如植物学里的“adaxial/abaxial”等相近词）。"},"examples":[{"en":"I couldn’t find “podaxonial” in a dictionary—could you share the sentence or the field (botany, anatomy, zoology)?","zh":"我在词典里找不到“podaxonial”，你能提供句子或所属领域吗（植物学、解剖学、动物学）？"},{"en":"If you meant the leaf’s upper surface, the term is usually “adaxial,” not “podaxonial.”","zh":"如果你指的是叶片的上表面，通常用“adaxial”，而不是“podaxonial”。"}]}],"phonetic":"/ˌpoʊdækˈsoʊniəl/","extraExplanation":["“podaxonial”在通用英语与常见专业词典中都不常见，因此更像是拼写误差或把几个词混写在一起。要准确判断，你可以把它出现的原句（或图片）贴出来，并说明学科领域。","如果你在植物学语境里想表达“朝向茎轴的一侧/上表面”，常见对立词是 adaxial（向轴面、上表面）与 abaxial（背轴面、下表面）。如果是在动物解剖或节肢动物形态学里，也可能对应其他“轴向/附肢”相关术语，需要原文确认。"]}
{"word":"podcast","summary":{"en":"A podcast is an episodic digital audio show you can stream or download; it can also mean to produce and publish such a show.","zh":"Podcast 指可下载/在线播放的分集数字音频节目；也可作动词，表示制作并发布播客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a digital audio (sometimes video) program released in episodes that you can stream or download, often to listen to on a phone or computer","zh":"播客；以“分集”形式发布的数字音频（有时也包括视频）节目，可在线播放或下载，常用手机或电脑收听"},"examples":[{"en":"I listen to a podcast on the subway every morning.","zh":"我每天早上在地铁上听播客。"},{"en":"This podcast releases a new episode every Friday.","zh":"这个播客每周五更新一集。"},{"en":"She hosts a podcast about learning English.","zh":"她主持一个关于学英语的播客。"}]},{"partOfSpeech":"v.","definition":{"en":"to make and publish a podcast (episodes) on the internet","zh":"制作并在网上发布播客（节目/分集）"},"examples":[{"en":"He started to podcast during the pandemic.","zh":"他在疫情期间开始做播客。"},{"en":"They podcast their interviews with local artists.","zh":"他们把对本地艺术家的采访做成播客发布。"}]}],"synonyms":["audio show","internet radio (informal)","webcast (related)"],"phonetic":"/ˈpɑdˌkæst/","extraExplanation":["“podcast”一词来自“iPod”（苹果早期的音乐播放器）+ “broadcast”（广播）的组合。现在即使不用 iPod，人们也普遍用 podcast 指各类网络音频节目。","常见搭配：podcast episode（播客单集）、podcast host（主播/主持人）、podcast guest（嘉宾）、true-crime podcast（真实犯罪类播客）、news podcast（新闻播客）。","文化语境：英语里常说“subscribe to a podcast”（订阅播客）和“binge-listen”（一次听很多集），类似追剧。"]}
{"word":"podcasts","summary":{"en":"“Podcasts” is the plural of “podcast,” meaning online audio shows released in episodes; it can also be a verb meaning to publish such episodes.","zh":"“Podcasts”是“podcast”的复数，指按集发布的网络音频节目；也可作动词，表示以播客形式发布内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A series of audio (sometimes video) episodes that you can listen to or watch online, usually on a phone or computer; each episode is part of a show.","zh":"播客；一系列可在网上收听（有时也有视频）的节目，通常按集数更新。"},"examples":[{"en":"I listen to a podcast on my way to work.","zh":"我上班路上会听播客。"},{"en":"This podcast releases new episodes every Friday.","zh":"这个播客每周五更新新一集。"},{"en":"She hosts a podcast about learning English.","zh":"她主持一个关于学英语的播客。"}]},{"partOfSpeech":"v.","definition":{"en":"To publish or distribute audio/video episodes as a podcast on the internet.","zh":"以播客形式在网上发布或传播音频/视频节目。"},"examples":[{"en":"They podcast their interviews with local artists.","zh":"他们把对本地艺术家的采访做成播客发布。"},{"en":"He started podcasting during the pandemic.","zh":"他在疫情期间开始做播客。"}]}],"synonyms":["audio shows","internet radio","episodes"],"phonetic":"/ˈpɑdˌkæsts/","extraExplanation":["“Podcast”一词来自 iPod + broadcast（广播）的组合，但现在不一定和 iPod 有关。","在日常英语里，更常用作名词：a podcast（一个节目/一档播客），an episode（一期/一集），to subscribe/follow（订阅/关注）。"]}
{"word":"podded","summary":{"en":"“Podded” usually means “formed/produced pods” (plants) or “was put into pods/small units or groups.” It can also be an adjective meaning “having pods.”","zh":"“podded”通常表示植物“结荚/长出豆荚”，也可表示“被放入舱/囊状单元或被分组为小单元”。还可作形容词表示“带荚的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pod”: to put something into a pod or container-like unit (or to divide into small, separate groups/units).","zh":"“pod”的过去式/过去分词：把某物放进“舱/囊/容器状单元”里，或把事物分成若干小组/小单元。"},"examples":[{"en":"The team podded the new hires into three training groups.","zh":"团队把新入职员工分成三个培训小组。"},{"en":"The pieces were podded into separate boxes for shipping.","zh":"这些零件被分别装进盒子里以便运输。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pod” (gardening): to produce or form pods.","zh":"“pod”的过去式/过去分词（园艺/植物）：长出豆荚；结荚。"},"examples":[{"en":"After a warm week, the beans finally podded.","zh":"暖和了一周后，豆子终于开始结荚了。"},{"en":"The plants had podded before the first frost.","zh":"第一次霜冻前，这些植物已经结荚了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Adjective: having pods; covered with or shaped like pods.","zh":"形容词：有豆荚的；带荚的；豆荚状的。"},"examples":[{"en":"We picked the podded peas and cooked them for dinner.","zh":"我们摘了带荚的豌豆，做了晚饭。"},{"en":"The podded branches bent under the weight.","zh":"结满荚果的枝条被重量压弯了。"}]}],"synonyms":["grouped","separated","clustered","formed pods","in pods"],"phonetic":"/ˈpɑdɪd/","extraExplanation":["“podded”最常见在园艺/生物语境里，指植物“结荚”。在一些较新的工作/科技语境中，人们也会把“pod”当作“独立小单元/小组”（比如项目小组、Kubernetes 的 Pod 等），所以“podded”可理解为“被分到不同小单元里”。","在口语里，偶尔也有人用“podded”表示“做成播客/录成播客形式”，但不算标准常用表达；更常见说法是“recorded a podcast / made a podcast episode”。"]}
{"word":"podder","summary":{"en":"Podder most often informally means a podcaster; it can also mean a pea/bean shelling tool, and it is used as a surname.","zh":"Podder 最常见的非正式用法是指播客创作者/主持人；也可指剥豌豆/豆子的工具或机器，并且可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who makes, hosts, or regularly creates a podcast; a podcaster.","zh":"（非正式）做播客的人；播客主持人/创作者。"},"examples":[{"en":"She became a full-time podder after her show gained a big audience.","zh":"她的节目吸引了大量听众后，就成了一名全职播客创作者。"},{"en":"As a podder, he records interviews every weekend.","zh":"作为播客创作者，他每个周末都会录制采访。"}]},{"partOfSpeech":"n.","definition":{"en":"(agriculture) A tool or machine used to remove peas or beans from their pods; a pea/bean sheller.","zh":"（农业）剥豆荚的工具或机器；剥豌豆/剥豆机。"},"examples":[{"en":"The farm used a podder to shell peas quickly.","zh":"农场用剥豆机快速剥豌豆。"},{"en":"With a simple hand podder, they prepared beans for cooking.","zh":"他们用简易手动剥豆器把豆子处理好用来做饭。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"一个姓氏（Podder）。"},"examples":[{"en":"Dr. Podder will speak at the conference tomorrow.","zh":"Podder 博士将于明天在会议上发言。"}]}],"synonyms":["podcaster","podcast host","sheller","pea sheller"],"phonetic":"/ˈpɑdər/","extraExplanation":["“podder”不是最常见的标准词，更常见的是“podcaster”（播客主持人/创作者）。在口语或网络语境里，人们有时会用“podder”来图个简短。","农业义与“pod（豆荚）”相关：podder 指把豆子从豆荚里“剥出来”的工具/机器；不同地区也可能更常用“sheller”。"]}
{"word":"poddia","summary":{"en":"“poddia” is not standard English; it’s likely a misspelling (often of “podium”) or a non-English/proper name.","zh":"“poddia”不是标准英语词；多半是拼写错误（常见为“podium”）或非英语/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of a similar-looking word (for example, “podium” or “podia”).","zh":"不是标准英语单词。它很可能是某个拼写相近词的拼写错误（例如“podium”或“podia”）。"},"examples":[{"en":"I couldn’t find “poddia” in an English dictionary—did you mean “podium”?","zh":"我在英语词典里找不到“poddia”——你是不是想写“podium（领奖台/讲台）”？ "},{"en":"If you tell me the sentence you saw it in, I can identify the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你判断原本想表达的词。"}]}],"phonetic":"/ˈpɑdiə/","extraExplanation":["“poddia”在英语中没有稳定、被普遍承认的用法。最常见情况是把“podium”（讲台/领奖台）拼错了：podium /ˈpoʊdiəm/。","也可能是其他语言的词（例如葡语/西语里类似“podia”的形式），或是人名、品牌名、用户名。把上下文（整句、话题、来源）发我，我能更准确判断。"]}
{"word":"poddidge","summary":{"en":"“poddidge” is not standard; it’s usually a misspelling of “porridge” (a thick boiled-grain breakfast).","zh":"“poddidge”不是标准拼写；通常是“porridge（煮成浓稠的谷物粥/燕麦粥）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended word: “porridge” — a soft, thick food made by boiling grains (especially oats) in water or milk.","zh":"（常见拼写错误）想表达的词通常是“porridge（燕麦粥/麦片粥）”——把谷物（尤其是燕麦）用水或牛奶煮成的浓稠软食。"},"examples":[{"en":"I usually have porridge for breakfast in winter.","zh":"冬天我通常早餐吃燕麦粥。"},{"en":"She made porridge with milk and a little honey.","zh":"她用牛奶煮了粥，还加了一点蜂蜜。"},{"en":"This porridge is too thick—add some water.","zh":"这粥太稠了——加点水吧。"}]}],"synonyms":["porridge","oatmeal","gruel"],"phonetic":"/ˈpɔrɪdʒ/","extraExplanation":["“poddidge”不是标准英文拼写，最常见的情况是把“porridge”拼错了。正确拼法是 p-o-r-r-i-d-g-e。","“porridge”在英式/美式英语里都常见；在英国常特指燕麦粥（oatmeal porridge），在美国更常直接说“oatmeal”。"]}
{"word":"poddies","summary":{"en":"“Poddies” most commonly means bottle-fed orphan calves (Aus/NZ slang). Less commonly, it can mean small pods like coffee or detergent pods.","zh":"“Poddies”最常指（澳新口语）奶瓶喂养的孤儿小牛；较少见时也可指咖啡胶囊、洗衣凝珠等“小胶囊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, New Zealand, informal) Orphaned calves that are fed with a bottle and raised by people; plural of “poddy (calf).”","zh":"（澳大利亚/新西兰，口语）“奶瓶喂大的孤儿小牛”；是 poddy（孤儿小牛）的复数。"},"examples":[{"en":"The kids helped feed the poddies before school.","zh":"孩子们上学前帮忙给那些奶瓶小牛喂奶。"},{"en":"He grew up on a farm, raising poddies every spring.","zh":"他在农场长大，每年春天都会养奶瓶小牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, less common) Small “pods” (for example, coffee or detergent pods); plural used casually as “poddies.”","zh":"（口语，较少见）各种“小胶囊/小包”（如咖啡胶囊、洗衣凝珠）；把 pods 随口说成 “poddies”。"},"examples":[{"en":"We’re out of coffee poddies—can you buy more pods?","zh":"咖啡胶囊没了——你能再买点吗？"},{"en":"Keep the detergent poddies away from children.","zh":"把洗衣凝珠放在儿童接触不到的地方。"}]}],"synonyms":["poddy calves","orphan calves","bottle-fed calves","pods"],"phonetic":"/ˈpɑdiz/","extraExplanation":["“poddies”最常见于澳大利亚和新西兰的农场语境，完整说法常是 “poddy calves”。其中 poddy 指需要人手喂养（多用奶瓶）的孤儿小牛。","如果你是在网络/聊天里看到 “poddies”，也可能只是把 “pods” 可爱化的随口说法；具体含义通常要看上下文（咖啡、洗衣、养殖等）。"]}
{"word":"poddige","summary":{"en":"“Poddige” isn’t a standard English word; you probably mean “porridge,” a thick boiled grain cereal like oatmeal.","zh":"“poddige”不是标准英语词；你很可能想写“porridge”，指煮成浓稠状的谷物粥（如燕麦粥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “porridge”) a soft, thick food made by boiling oats or another grain in water or milk; oatmeal is a common kind.","zh":"（可能想写：porridge）粥/麦片粥：把燕麦或其他谷物用水或牛奶煮成的浓稠软食；常见的是燕麦粥。"},"examples":[{"en":"I usually eat porridge for breakfast in winter.","zh":"冬天我早餐通常吃麦片粥。"},{"en":"She made porridge with milk and honey.","zh":"她用牛奶和蜂蜜煮了粥。"},{"en":"In many cultures, rice porridge is a comfort food when you’re sick.","zh":"在很多文化里，生病时喝米粥是一种很常见的“安慰食物”。"}]}],"synonyms":["oatmeal","gruel","congee"],"phonetic":"/ˈpɔrɪdʒ/","extraExplanation":["“poddige”不是常见的英语单词，更像是拼写错误。最接近的常用词通常是 porridge（粥/麦片粥）。另一个相近词是 pottage（浓汤/稠汤，较古老或文学用法）。","porridge 在英式与美式英语里都常用；在美国也常直接说 oatmeal（燕麦粥），尤其指用燕麦做的那一种。"]}
{"word":"podding","summary":{"en":"“Podding” usually means forming/handling pods (like peas), and informally can mean making podcasts or socializing in a small fixed group (“a pod”).","zh":"“Podding”常指植物结荚或处理豆荚；在非正式用法中也可指制作播客，或以固定小圈子（pod）方式社交/生活。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “pod”) forming or putting things into pods (small seed cases or capsule-like groups).","zh":"（“pod”的现在分词）结荚；形成豆荚/荚果；把事物装入或分成“荚/舱”状的小组或容器。"},"examples":[{"en":"The peas are podding well this year.","zh":"今年豌豆结荚情况很好。"},{"en":"Workers are podding the beans before packing them.","zh":"工人们先把豆子剥荚再包装。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) making or recording podcasts; doing podcast work.","zh":"（非正式）做播客；录制/制作播客。"},"examples":[{"en":"She spends weekends podding about books and movies.","zh":"她周末会做关于书籍和电影的播客。"},{"en":"I’ve been podding with a friend since last summer.","zh":"从去年夏天起我就和朋友一起做播客。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) living, working, or socializing in a small, consistent group (“a pod”).","zh":"（非正式）以固定小圈子（“pod”）的方式一起生活、工作或社交。"},"examples":[{"en":"They started podding with two other families for childcare.","zh":"他们开始和另外两户家庭组“固定小圈子”来互相照看孩子。"},{"en":"During the outbreak, many people were podding to limit contact.","zh":"疫情期间，很多人通过“分小圈子活动”来减少接触面。"}]}],"synonyms":["shelling (beans/peas)","podcasting","recording a podcast","grouping","cohorting"],"phonetic":"/ˈpɑdɪŋ/","extraExplanation":["“podding”本质上是动词“pod”的 -ing 形式。传统含义多见于农业/植物（如豌豆、蚕豆“结荚”或“剥荚”）。","近年在英语里，“pod”因“podcast（播客）”和疫情时期的“pod（固定社交小圈子）”而更常见，因此“podding”也会被用来表示“做播客”或“以小圈子方式活动”。语境不同含义差别很大，注意搭配（podding peas vs. podding with friends）。"]}
{"word":"poddish","summary":{"en":"“Poddish” means pod-like in shape or appearance.","zh":"“Poddish”表示“像豆荚的、呈豆荚状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pod; having the shape or look of a pod (often used in botany or descriptive writing).","zh":"像豆荚的；呈豆荚状的（常见于植物学或描写性文字）。"},"examples":[{"en":"The seed case becomes poddish as it dries in late summer.","zh":"到了夏末变干时，种荚会变得呈豆荚状。"},{"en":"Under the microscope, the fruit looked small and poddish.","zh":"在显微镜下，这个果实看起来很小、像豆荚。"}]}],"synonyms":["podlike","pod-shaped","poddy"],"phonetic":"/ˈpɑdɪʃ/","extraExplanation":["“poddish”由“pod（豆荚）+ -ish（有点……的/带……特征的）”构成，表示“带有豆荚特征、略呈豆荚样”。这种“-ish”常用来表达“有点像、略带……的感觉”，如 greenish（微绿的）、childish（孩子气的）。"]}
{"word":"poddle","summary":{"en":"“Poddle” means to walk slowly and casually, especially in British informal English.","zh":"“poddle”指慢慢走、悠闲散步，主要见于英式非正式用法。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to walk in a slow, relaxed way; to stroll (informal, chiefly British)","zh":"慢慢地走；悠闲地散步（非正式，多见于英式英语）"},"examples":[{"en":"We poddled along the river after dinner.","zh":"晚饭后我们沿着河边慢慢散步。"},{"en":"He poddled into town to buy some groceries.","zh":"他慢慢走进镇上买些杂货。"}]},{"partOfSpeech":"n.","definition":{"en":"a slow, easy walk; a stroll (informal, chiefly British)","zh":"慢悠悠的散步（非正式，多见于英式英语）"},"examples":[{"en":"Let’s go for a quick poddle before it gets dark.","zh":"天黑前我们去随便散散步吧。"}]}],"synonyms":["stroll","amble","potter","wander","saunter"],"phonetic":"/ˈpɑdəl/","extraExplanation":["“poddle”在现代英语里比较少见，更常见的搭配是“poddle along”（慢慢走）。在美式英语中，人们更常用“stroll / walk / amble / wander”。","它容易和“paddle”（划桨/涉水）或“poodle”（贵宾犬）混淆；如果你的意思是“划船/用桨”，通常应写“paddle”。"]}
{"word":"poddock","summary":{"en":"“Poddock” is usually a misspelling of “paddock,” meaning a small fenced field for horses; it can also be a verb meaning to put animals in such an enclosure.","zh":"“poddock”通常是“paddock”的误拼，指（尤指供马用的）小围场；也可作动词，表示把动物赶入/关在围场里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of) a small fenced field or enclosure, especially for horses.","zh":"（多半是拼写错误，常见正确拼法为 paddock）小围场；（尤指）马的放牧/活动围栏场地。"},"examples":[{"en":"The horses were turned out into the paddock after breakfast.","zh":"早餐后，马被放到小围场里活动。"},{"en":"We walked past a paddock surrounded by a wooden fence.","zh":"我们走过一片被木栅栏围起来的小围场。"}]},{"partOfSpeech":"v.","definition":{"en":"To keep or put (horses or livestock) in a paddock.","zh":"把（马或家畜）关在/放到小围场里。"},"examples":[{"en":"They paddocked the horses for the night.","zh":"他们把马赶进小围场过夜。"}]}],"synonyms":["enclosure","pen","corral","field"],"phonetic":"/ˈpædək/","extraExplanation":["“poddock”在现代英语里不是常见标准词，日常最常见的对应是“paddock”。如果你是在地名、人名或小说里看到“Poddock”，它也可能是专有名词（姓氏/地名/虚构名），此时不按普通词义翻译。","“paddock”常见于英式与澳新英语的农业、赛马语境：赛马场附近常有不同用途的 paddock（检阅圈、放马区等），具体含义会随场景变化。"]}
{"word":"poddy","summary":{"en":"“Poddy” usually means an orphan, bottle-fed calf in Australian/New Zealand English; less commonly it’s a variant spelling of “potty.”","zh":"“poddy”通常指澳新英语中的“奶瓶喂养的孤小牛”；较少见时是“potty（小便盆/儿童马桶）”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand) A young calf (sometimes a lamb or goat) that has lost its mother and is raised by people, usually bottle-fed.","zh":"（澳大利亚/新西兰）失去母畜、由人类喂养长大的小牛（有时也指小羊/小山羊），通常用奶瓶喂养。"},"examples":[{"en":"They’re up early to feed the poddy calf before school.","zh":"他们一大早起来在上学前喂那只奶瓶牛。"},{"en":"The farmer rescued a poddy and raised it by hand.","zh":"农场主救了一只孤小牛，用人工把它养大。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A childish or informal spelling/variant of “potty,” meaning a small toilet or a child’s toilet.","zh":"（较少见）“potty”的儿语/非正式拼写变体，指小便盆或儿童用的小马桶。"},"examples":[{"en":"The toddler needs to use the potty (sometimes spelled “poddy”).","zh":"小宝宝要用小马桶（有时也会写作“poddy”）。"}]}],"synonyms":["poddy calf","orphan calf","bottle-fed calf","hand-reared calf","potty"],"phonetic":"/ˈpɑdi/","extraExplanation":["“poddy”最常见于澳新农场语境，尤其是“poddy calf”。这类小牛通常因为母牛死亡或拒哺而需要人工喂养；在乡村生活或儿童故事里常被描写得很亲近人。","在美式英语里更常用“orphan calf / bottle-fed calf”。如果你是在农场相关内容里看到“poddy”，通常就是指这种奶瓶喂养的小牛。"]}
{"word":"podelcoma","summary":{"en":"“podelcoma” doesn’t appear to be a standard English word; please provide context so I can identify or correct it.","zh":"“podelcoma”不像是标准英文单词；请提供上下文，我才能帮你确认或纠正。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a specialized term not found in common dictionaries.","zh":"这不是常见的英文单词。可能是拼写错误、人名/地名，或某个非常专业的术语（常规词典里找不到）。"},"examples":[{"en":"I searched for “podelcoma,” but I couldn’t find it in an English dictionary.","zh":"我查了“podelcoma”，但在英文词典里找不到。"},{"en":"Could you share the full sentence where you saw “podelcoma”?","zh":"你能把出现“podelcoma”的完整句子发我吗？"}]}],"extraExplanation":["为了更准确地帮你：\n1）请告诉我你在哪里看到“podelcoma”（文章/作业/游戏/医学报告等）。\n2）把包含它的整句话贴出来。\n3）确认是否有大小写、连字符或空格（例如 podel coma / Pod Elcoma / podel-coma）。\n\n常见情况是拼写接近以下词之一（我需要句子才能判断）：\n- “pneumonia / pericoma / pseudocoma”等医学相关词\n- 某个品牌名、用户名、地名或人名"]}
{"word":"podeon","summary":{"en":"“Podeon” isn’t standard English; it’s usually a misspelling of “podium” or “odeon.”","zh":"“podeon”不是标准英语，通常是把“podium”或“odeon”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “podium” (a raised platform) or “odeon” (a theater/concert hall, often in names).","zh":"不是标准英语单词；最常见是把 “podium”（讲台/领奖台等的台子）或 “odeon”（剧院/音乐厅，常见于名称）拼错。"},"examples":[{"en":"I think you meant “podium,” not “podeon.”","zh":"我觉得你想写的是 “podium”，不是 “podeon”。"},{"en":"The venue name includes “Odeon,” but it’s easy to mistype it as “podeon.”","zh":"场馆名字里有 “Odeon”，但很容易误打成 “podeon”。"}]}],"synonyms":["podium","odeon"],"phonetic":"/poʊˈdiːɑn/","extraExplanation":["“podium”在美式英语里很常见：演讲者站在podium上；体育比赛领奖也可能站在podium上（有时也说medal podium）。\n“Odeon”较少见，多用于剧院/影院/音乐厅的名字（例如历史上也有“Odeon Theatre”之类）。\n如果你告诉我你看到“podeon”的句子或语境，我可以更准确判断你想表达的是哪个词，并给出对应的正式释义与例句。"]}
{"word":"podesta","summary":{"en":"Podesta most commonly refers to a historical Italian chief magistrate, and it is also used as a surname (e.g., John Podesta).","zh":"Podesta 常指意大利历史上的城邦首席执政官，也可作为姓氏使用（如 John Podesta）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(history) In medieval and Renaissance Italy, a chief magistrate or governor appointed to run a city-state, often brought in from another town to reduce local bias.","zh":"（历史）中世纪与文艺复兴时期意大利城邦的最高行政长官/首席执政官，常由外地人受聘担任，以减少本地派系偏私。"},"examples":[{"en":"In many Italian city-states, the podesta was hired from outside the city to keep politics fair.","zh":"在许多意大利城邦中，podesta 常从外地聘请，以维持政治相对公正。"},{"en":"The novel describes a podesta who tried to stop corruption but angered powerful families.","zh":"小说描写了一位试图遏制腐败的 podesta，却得罪了有势力的家族。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), especially in the U.S.; for example, John Podesta is a well-known American political adviser.","zh":"一个姓氏（家族姓），在美国较常见；例如 John Podesta 是知名的美国政治顾问。"},"examples":[{"en":"Podesta is his last name, not a job title.","zh":"Podesta 是他的姓，不是职位名称。"},{"en":"She read an article mentioning John Podesta in a U.S. politics class.","zh":"她在美国政治课上读到一篇提到 John Podesta 的文章。"}]}],"synonyms":["magistrate","governor","mayor"],"phonetic":"/poʊˈdɛstə/","extraExplanation":["词源来自意大利语 podestà（重音在词尾）。英语里常写作 podesta，指历史官职时多出现在历史/文学语境；作为姓氏时则按英语习惯读音。"]}
{"word":"podestas","summary":{"en":"“Podestas” means the chief magistrates/governors of medieval Italian city-states (plural).","zh":"“podestas”指中世纪意大利城邦的首席执政官/最高行政长官（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, chiefly Italy) a chief magistrate or governor appointed to lead a city-state; plural of podestà/podesta.","zh":"（历史用语，多指意大利）城市国家的最高行政长官或首席执政官；podestà/podesta 的复数。"},"examples":[{"en":"In medieval Italy, podestas were often hired from other cities to govern fairly.","zh":"在中世纪意大利，podesta 们常从外城被聘来执政，以求更公正。"},{"en":"The chronicle describes how the podestas enforced new laws in the town.","zh":"编年史记载了这些 podesta 如何在城镇里执行新法。"}]}],"synonyms":["magistrates","governors","chief officials"],"phonetic":"/poʊˈdɛstə/","extraExplanation":["“podestà”（英语中也常写作 podesta）源自意大利语，来自拉丁语 *potestas*（权力、权威）。在中世纪和文艺复兴时期的意大利城邦（如佛罗伦萨、博洛尼亚等），podestà 常是外聘的官员，用来减少地方家族势力的偏袒与冲突。","英语里该词多出现在历史、艺术史、文学研究的语境中；复数常写作 *podestas*（英语化拼写），也可能见到意大利式复数 *podestàs*（较少见）。"]}
{"word":"podesterate","summary":{"en":"A rare historical word meaning the office/term or jurisdiction of a podestà in medieval Italy.","zh":"一个罕见的历史词，指中世纪意大利城邦“执政官（podestà）”的职位/任期或其管辖区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The office, term of office, or jurisdiction of a podestà (a chief magistrate in medieval Italian city-states).","zh":"（历史用语）意大利中世纪城邦中“执政官/最高行政司法官（podestà）”的职位、任期，或其管辖范围。"},"examples":[{"en":"During the podesterate, the city tried to curb factional violence by appointing an outsider as podestà.","zh":"在执政官任期内，城邦试图通过任命一位外来者为执政官来遏制派系暴力。"},{"en":"Records from the podesterate describe new rules for trade and public order.","zh":"执政官管辖时期的档案记载了新的贸易与治安规定。"}]}],"synonyms":["magistracy","office","tenure","jurisdiction"],"phonetic":"/ˈpoʊdɛstərət/","extraExplanation":["“podesterate”来自意大利语 podestà（城邦的最高行政/司法官）及其相关拉丁语词源，常见于讨论中世纪意大利城邦政治制度的历史写作中。","在现代英语里非常罕见；如果你是在日常语境中看到它，可能是拼写误差。常被混淆的更常用词包括：moderate（温和的/适度的）、proliferate（激增）、orchestrate（策划/编排）。"]}
{"word":"podetia","summary":{"en":"Podetia are the upright, stalk-like parts of certain lichens.","zh":"Podetia 指某些地衣向上长出的柄状结构（podetium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Lichenology) Upright, stalk-like structures of certain lichens (especially Cladonia) that rise from the base and often bear fruiting bodies or powdery reproductive material.","zh":"（地衣学）某些地衣（尤指杯状地衣属 Cladonia）从基部向上长出的“柄状体/柄”，常在顶端或表面产生子实体或粉状繁殖结构。"},"examples":[{"en":"In many Cladonia lichens, the podetia form small cups at the tips.","zh":"在许多杯状地衣属地衣中，podetia 的顶端会形成小杯状结构。"},{"en":"The researcher measured the height of the podetia to compare growth across sites.","zh":"研究人员测量了 podetia 的高度，以比较不同地点的生长情况。"}]}],"synonyms":["podetiums","lichen stalks"],"phonetic":"/poʊˈdiːʃiə/","extraExplanation":["“podetia”是“podetium”的复数形式，属于生物分类与形态学的专业词，日常英语中很少见。","词源来自拉丁语（与“脚/柄”相关的词根），用来强调它像“支架/柄”一样把繁殖结构托举起来。","学习时可把它理解为“地衣的柄状部分”，在野外观察杯状地衣（如常见的“杯状地衣/鹿角地衣”一类）时会经常遇到这个结构名称。"]}
{"word":"podetiiform","summary":{"en":"A scientific adjective meaning “shaped like a podetium,” used mainly to describe lichen structures.","zh":"一个科学用形容词，意为“呈地衣柄状体（podetium）形状的”，主要用于描述地衣结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a podetium (a small, stalk-like structure), especially in lichens.","zh":"呈“podetium（地衣的柄状体/柄状结构）”形状的；尤用于描述地衣的形态。"},"examples":[{"en":"The lichen produces podetiiform stalks that lift the fruiting bodies above the ground.","zh":"这种地衣会长出柄状体形的“茎”，把子实体抬离地面。"},{"en":"Under the microscope, the surface looked podetiiform and slightly hollow.","zh":"在显微镜下，表面看起来呈柄状体形，且略微中空。"}]}],"synonyms":["podetium-shaped","stalk-like (in lichen descriptions)"],"phonetic":"/poʊˈdiːtiɪˌfɔrm/","extraExplanation":["“podetiiform”主要出现在生物学/地衣学（lichenology）文献中，属于较专业的形态学描述词：podetium 指某些地衣（如杯状地衣 *Cladonia* 属）形成的直立“柄状体”，常用于承托孢子器或其他繁殖结构。","词源上，-form 表示“……形状的”。因此 podetiiform 可理解为“像 podetium 那样的形状”。在日常英语中几乎不会用到，多见于论文、野外鉴定手册和标本描述。"]}
{"word":"podetium","summary":{"en":"A podium is a raised platform used for public speaking or for award ceremonies.","zh":"Podium 指用于公开演讲的讲台或颁奖时的领奖台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a raised platform that a person stands on, especially to speak in public or to receive an award","zh":"讲台；领奖台；（供人站立的）高台"},"examples":[{"en":"The speaker walked up to the podium and began her speech.","zh":"演讲者走上讲台，开始发言。"},{"en":"She stood on the podium to accept the gold medal.","zh":"她站上领奖台领取金牌。"}]}],"synonyms":["platform","lectern","stand","dais"],"phonetic":"/ˈpoʊdiəm/","extraExplanation":["你写的 **podetium** 通常是拼写错误，正确拼写是 **podium**。","常见搭配：**take the podium**（走上讲台发言）、**step up to the podium**（走到讲台前）、**podium finish**（前三名完赛，常用于赛车/跑步等）。","文化小提示：体育比赛中的“podium”常特指前三名的领奖台（1st/2nd/3rd）。"]}
{"word":"podex","summary":{"en":"A rare word meaning the buttocks or anus, usually crude or humorous.","zh":"一个罕见词，指臀部或肛门，语气多粗俗或带玩笑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/learned) The buttocks or anus; a person’s rear end (often used in humorous, crude, or insulting contexts).","zh":"（罕见/书面）臀部或肛门；人的屁股（常带戏谑、粗俗或侮辱语气）。"},"examples":[{"en":"The insult was crude, basically calling him a “podex.”","zh":"那句辱骂很粗俗，基本是在叫他“屁股/肛门”。"},{"en":"In an old satirical text, “podex” is used as a learned-sounding word for the rear end.","zh":"在一篇较早的讽刺作品里，“podex”被用作听起来很“文雅”的“屁股”。"}]}],"synonyms":["rear end","butt","behind","anus (more medical/neutral)","ass (informal/vulgar)"],"phonetic":"/ˈpoʊdɛks/","extraExplanation":["“podex”源自拉丁语，意思与“臀部/肛门”相关；在现代英语中非常少见，多见于讽刺、戏谑或装“学术”的粗口表达。","语体提醒：该词指涉身体私密部位，语感偏粗俗/冒犯，不建议在正式场合使用。"]}
{"word":"podge","summary":{"en":"“podge” is an informal word for a protruding belly, and it can also mean “to bulge out.”","zh":"“podge”是非正式说法，指凸出来的肚子（肚腩），也可作动词表示“鼓出来、凸出”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A round, protruding belly; a paunch.","zh":"（非正式）圆鼓鼓凸出来的肚子；大肚腩。"},"examples":[{"en":"After a big meal, his podge stuck out over his belt.","zh":"大吃一顿后，他的肚腩都鼓到腰带外面了。"},{"en":"He joked about needing to lose his podge before summer.","zh":"他开玩笑说夏天前得把肚腩减下去。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal) To stick out or bulge, especially of a belly.","zh":"（非正式）（尤指肚子）鼓出来；凸出。"},"examples":[{"en":"My stomach started to podge out after the holidays.","zh":"假期后我的肚子开始凸出来了。"},{"en":"The shirt is tight and it makes my midsection podge.","zh":"这件衬衫太紧，把我的腰腹勒得更凸出了。"}]}],"synonyms":["belly","paunch","potbelly","gut","bulge"],"phonetic":"/pɑdʒ/","extraExplanation":["“podge”多见于英式/澳式口语，带点自嘲或调侃意味；在美式英语里更常用的说法是“belly / paunch / potbelly”。","它和形容词“podgy”（矮胖的、圆滚滚的）有关联，语感相近，都偏口语、轻松，不适合正式写作。"]}
{"word":"podger","summary":{"en":"A (mainly British) tool used to poke/pry and align holes in metalwork or scaffolding.","zh":"主要为英式用法：用于戳/撬并对齐金属或脚手架孔位的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, thick metal tool (often pointed or tapered) used to poke, pry, or line up holes in metalwork or scaffolding; a type of aligning bar/drift.","zh":"（英式）一种短粗的金属工具（常带尖端或锥形），用于戳、撬或对齐金属/脚手架上的孔；类似“对孔棒/冲杆”。"},"examples":[{"en":"The rigger used a podger to line up the bolt holes before tightening the nuts.","zh":"吊装工先用 podger 把螺栓孔对齐，再把螺母拧紧。"},{"en":"Keep the podger in your tool belt—it’s handy for quick adjustments.","zh":"把 podger 放在工具腰带里——用来快速调整很方便。"}]}],"synonyms":["drift (pin)","aligning bar","tapered punch","pry bar"],"phonetic":"/ˈpɑːdʒɚ/","extraExplanation":["“podger”多见于英式英语，尤其在钢结构、脚手架、建筑安装等语境中；在美式英语里更常用更通用的说法是“drift (pin)”或“aligning bar”。","词源上常与英式口语“podge/podgy”（矮胖、短粗）相关，形象地描述工具“短粗结实”的外形。"]}
{"word":"podgier","summary":{"en":"“Podgier” means “more podgy”: a bit fatter or chubbier (informal).","zh":"“podgier”意为“更圆胖一些”（podgy 的比较级，偏口语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of podgy: slightly fat or chubby; having a short, thick body shape (often informal).","zh":"“podgy”的比较级：更胖一些、圆滚滚的；身材短而粗（多为非正式用语）。"},"examples":[{"en":"After a few months of eating fast food every day, he looked podgier than before.","zh":"连续几个月天天吃快餐后，他看起来比以前更胖了些。"},{"en":"The suit still fits, but the waist feels podgier.","zh":"西装还能穿，但腰围感觉更圆了、更紧了。"}]}],"synonyms":["chubbier","fatter","rounder","plumper"],"phonetic":"ˈpɑdʒiər","extraExplanation":["“podgy / podgier”在口语里常用来形容外形“圆胖、敦实”。对人使用时可能带点不礼貌或取笑的感觉；更中性/礼貌的说法可以用“chubbier（更圆润）”“heavier（更重）”“a bit overweight（有点超重）”。","拼写提示：它来自形容词“podgy”，比较级通常写作“podgier”。"]}
{"word":"podgiest","summary":{"en":"“Podgiest” means “the most chubby or round,” the superlative form of “podgy.”","zh":"“podgiest”意为“最胖/最圆滚滚的”，是“podgy”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) The most fat or chubby; having the roundest body shape in a group.","zh":"（非正式）最胖的；最圆滚滚的（在一组人/物中最明显）。"},"examples":[{"en":"Of the three puppies, the brown one is the podgiest.","zh":"三只小狗里，棕色那只最胖。"},{"en":"After the holidays, he felt like the podgiest person in the office.","zh":"假期过后，他觉得自己像办公室里最胖的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the plumpest, most rounded shape (often used about a belly, cheeks, fingers, or small objects).","zh":"（常形容肚子、脸颊、手指或小物件）最圆润、最肉嘟嘟的。"},"examples":[{"en":"The baby has the podgiest cheeks.","zh":"宝宝的脸颊最肉嘟嘟的。"},{"en":"That plush toy is the podgiest one on the shelf.","zh":"那只毛绒玩具是架子上最圆滚滚的一只。"}]}],"synonyms":["chubbiest","plumpest","roundest","fattest (often rude)"],"phonetic":"/ˈpɑːdʒiɪst/","extraExplanation":["“podgiest”是形容词“podgy”的最高级（podgy → podgier → podgiest）。常见于英式英语和非正式口语/描写文体。","语气通常偏可爱、调侃或轻微不礼貌；形容人时要注意场合。更中性/礼貌的说法可用“plumpest”“chubbiest”，正式场合可用“heaviest”或直接描述体型。"]}
{"word":"podgily","summary":{"en":"“Podgily” means “in a short and plump way.”","zh":"“podgily”表示“矮胖地、圆滚滚地（地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a short, plump (slightly fat) way; like someone who is “podgy.”","zh":"以矮胖、圆滚滚的方式；带有“微胖、胖嘟嘟”的感觉。"},"examples":[{"en":"He waddled podgily across the room.","zh":"他矮胖地摇摇摆摆走过房间。"},{"en":"The puppy ran podgily after the ball.","zh":"小狗胖嘟嘟地追着球跑。"}]}],"synonyms":["plumply","chubbily","pudgily","stoutly"],"phonetic":"ˈpɑdʒəli","extraExplanation":["“podgily”比较少见，更常见的是形容词“podgy”（矮胖的、圆滚滚的）以及名词/形容词“pudgy”（胖嘟嘟的，尤其形容小孩或小动物）。在写作中用“podgily”通常带一点幽默或轻微调侃的语气；描述他人时注意礼貌与语境。"]}
{"word":"podginess","summary":{"en":"“Podginess” means being slightly fat and round (podgy), usually in an informal way.","zh":"“podginess”指略显矮胖、圆滚的状态，通常是较口语的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being podgy; a slightly fat, short, and round appearance (often describing a person’s body).","zh":"矮胖、圆滚滚的状态；指看起来有点胖、短而圆的体态（常形容人的身材）。"},"examples":[{"en":"As a kid, he had a bit of podginess, but he grew taller in high school.","zh":"他小时候有点矮胖，但上了高中后长高了。"},{"en":"The jacket hides some of his podginess around the waist.","zh":"这件夹克能遮住他腰部的一点“圆润”。"}]},{"partOfSpeech":"n.","definition":{"en":"A slightly rounded or bulky look of something (less commonly used for objects).","zh":"（较少用）某物略显圆鼓或臃肿的外观。"},"examples":[{"en":"The pillow’s podginess makes it comfortable to lean on.","zh":"这个枕头鼓鼓的，靠着很舒服。"}]}],"synonyms":["plumpness","chubbiness","roundness","stoutness"],"phonetic":"/ˈpɑdʒinəs/","extraExplanation":["“podginess”来自形容词“podgy”（矮胖的、圆滚的），语气偏口语、带一点调侃感。用于形容人时可能让人不舒服；更中性/礼貌的说法可用“a bit overweight（有点超重）”“rounder（更圆润）”或直接描述衣服尺寸、健康目标等。"]}
{"word":"podgy","summary":{"en":"Podgy means slightly fat and rounded, or short and thick in shape.","zh":"podgy 指微胖圆润，或形状短粗圆鼓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly fat or chubby in a soft, rounded way (often used informally).","zh":"（非正式）微胖的、圆滚滚的；带点肉肉的（多形容柔软、圆润的胖）。"},"examples":[{"en":"He has a podgy face and rosy cheeks.","zh":"他脸圆圆的，有点肉肉的，脸颊红润。"},{"en":"The podgy puppy wobbled as it walked.","zh":"那只圆滚滚的小狗走起路来一摇一摆的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of an object) short, thick, and rounded in shape.","zh":"（形容物体）短粗的、胖嘟嘟的、圆鼓鼓的。"},"examples":[{"en":"The toy has podgy little arms and legs.","zh":"这个玩具有短粗的小胳膊和小腿。"},{"en":"She drew podgy letters with a thick marker.","zh":"她用粗马克笔写出了圆鼓鼓的字母。"}]}],"synonyms":["chubby","plump","tubby","chunky"],"phonetic":"/ˈpɑdʒi/","extraExplanation":["“podgy”在英式英语里更常见，语气多为轻松随意；用来形容人时可能带一点不礼貌或取笑的感觉，建议在不熟的人面前谨慎使用。","和“chubby”相比，“podgy”更强调“圆、短、鼓”的外形；和“plump”相比，“podgy”通常更口语、更可爱或更调侃。"]}
{"word":"podia","summary":{"en":"“podia” is not an English word; it’s commonly Portuguese (or Spanish *podía*) meaning “could / was able to.”","zh":"“podia” 不是英文词，常见于葡萄牙语（或西班牙语 *podía*），意思是“可以/能/当时有能力”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A Portuguese verb form meaning “could / was able to,” from the verb *poder* (to be able to). It can also match Spanish *podía* (with an accent), meaning “could / was able to.”","zh":"（非标准英文）葡萄牙语动词形式，来自 *poder*（能够），意思是“可以/能/当时有能力”。在西班牙语中对应 *podía*（有重音），也表示“可以/能”。"},"examples":[{"en":"Portuguese: *Eu podia ir ontem, mas eu estava doente.* (I could go yesterday, but I was sick.)","zh":"葡萄牙语：*Eu podia ir ontem, mas eu estava doente.*（我昨天本来可以去，但我生病了。）"},{"en":"Spanish: *Yo podía ayudarte, pero no tenía tiempo.* (I could help you, but I didn’t have time.)","zh":"西班牙语：*Yo podía ayudarte, pero no tenía tiempo.*（我本来能帮你，但我没有时间。）"}]}],"synonyms":["could","was able to"],"phonetic":"/poʊˈdiːə/","extraExplanation":["在葡萄牙语里，*podia* 通常是未完成过去时（imperfect），常用来表达“当时本来可以/通常能够/有可能”，语气往往比直接说过去时更委婉，或强调“当时的情况/习惯”。","如果你原本想查的是英文 **podium**（讲台/领奖台），请告诉我，我可以按英文词条解释它的发音、用法和例句。"]}
{"word":"podial","summary":{"en":"Podial means “related to a podium” or, in biology, “related to feet/tube feet (podia).”","zh":"podial 可指“讲台/领奖台相关的”，也可在生物学中指“足或管足（podia）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a podium (a raised platform), especially in formal or official settings.","zh":"与讲台/领奖台（高起的平台）有关的；讲台的；台上的。"},"examples":[{"en":"The hall had a simple podial design, with one microphone centered on the platform.","zh":"这个大厅的讲台设计很简洁，平台中央只有一支麦克风。"},{"en":"Podial lighting made the speaker easy to see from the back rows.","zh":"讲台灯光让后排也能清楚看到演讲者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a foot or foot-like structure; in biology, often relating to the “podia” (tube feet) of animals such as sea stars.","zh":"与足或足状结构有关的；（生物学）常指海星等动物的“管足”（podia）。"},"examples":[{"en":"Sea stars use podial movement to cling to rocks and creep along the ocean floor.","zh":"海星用管足的运动附着在岩石上，并沿海底缓慢爬行。"},{"en":"The study described podial structures that help the animal sense its surroundings.","zh":"这项研究描述了帮助动物感知周围环境的管足结构。"}]}],"synonyms":["podium-related","platform","podal (biol.)","pedal (general ‘foot’ sense)"],"phonetic":"/ˈpoʊdiəl/","extraExplanation":["“podial”比较少见，多出现在学术/技术语境。日常英语里更常用“podium (n.) / podium-related (adj.)”。","不要把“podial”与常见的“pedal（脚踏的）/ podal（足的）”混淆；表达“足的”时，很多领域更常用“podal”。"]}
{"word":"podiatric","summary":{"en":"Podiatric means “related to medical care of the feet (and often ankles).”","zh":"podiatric 指“与足部（常也包括踝部）医疗护理相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to podiatry, the branch of medicine that deals with the feet (and often the ankles).","zh":"足病学的；与足部（常也包括踝部）医疗相关的。"},"examples":[{"en":"She scheduled a podiatric exam because the pain in her heel wouldn’t go away.","zh":"她预约了足病学检查，因为脚跟疼一直不好。"},{"en":"Podiatric care can help people with diabetes protect their feet.","zh":"足病学护理可以帮助糖尿病患者保护足部健康。"}]}],"synonyms":["podiatry-related","foot-care (informal)","foot-related"],"phonetic":"/ˌpoʊdiˈætrɪk/","extraExplanation":["“podiatric”来自“pod-”（脚）+ “-iatric”（医疗/治疗），常见于医疗场景或正式说明中。日常口语里更常说“foot doctor”（足科医生）或“foot care”（足部护理）。","相关词：podiatry（足病学），podiatrist（足科医生）。在美国，podiatrist（DPM）是专门治疗足部/踝部问题的医疗人员。"]}
{"word":"podiatries","summary":{"en":"“Podiatries” is the plural of “podiatry,” meaning the foot-and-ankle medical specialty; it can also mean podiatry clinics/departments.","zh":"“podiatries”是“podiatry”的复数，指足病学（足踝专科）；也可指多家足病诊所/科室。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the medical specialty that deals with the feet and ankles (diagnosing and treating foot-related problems)","zh":"足病学；足踝相关疾病的医学专科（诊断与治疗足部相关问题）"},"examples":[{"en":"She decided to study podiatry because she wanted to help people walk without pain.","zh":"她决定学习足病学，因为她想帮助人们无痛行走。"},{"en":"In the hospital, podiatry works closely with diabetes care to prevent foot ulcers.","zh":"在医院里，足病学常与糖尿病护理密切合作，以预防足部溃疡。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: podiatries) podiatry clinics or departments","zh":"（复数：podiatries）足病科门诊/诊所；足病学科室"},"examples":[{"en":"Several podiatries in the area offer custom orthotics.","zh":"该地区有几家足病诊所提供定制矫形鞋垫。"},{"en":"The new medical center will include podiatries and physical therapy services.","zh":"新的医疗中心将设有足病科和物理治疗服务。"}]}],"synonyms":["podiatry (field)","foot care (general)","podiatry clinics (when meaning clinics)"],"phonetic":"/pəˈdaɪətriz/","extraExplanation":["“Podiatries”通常是“podiatry”的复数。最常见的用法是谈学科时用不可数名词“podiatry”；当指不同的诊所/科室时，才更常用复数“podiatries”。","相关词：podiatrist（足病医生/足踝专科医生），orthotics（矫形器/矫形鞋垫），ingrown toenail（嵌甲），plantar fasciitis（足底筋膜炎）。"]}
{"word":"podiatrist","summary":{"en":"A podiatrist is a foot-and-ankle specialist doctor.","zh":"podiatrist 指专看脚与踝部问题的足病医生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical specialist who treats problems of the feet and lower legs (especially the ankles).","zh":"足病医生；专门诊治足部与小腿（尤其踝部）问题的医疗专业人士。"},"examples":[{"en":"I made an appointment with a podiatrist for my heel pain.","zh":"我因为脚跟痛预约了足病医生。"},{"en":"The podiatrist recommended special inserts for my shoes.","zh":"足病医生建议我用鞋垫（矫形鞋垫）。"},{"en":"If you have recurring ingrown toenails, a podiatrist can help.","zh":"如果你经常长嵌甲（甲沟炎相关），足病医生可以帮忙。"}]}],"synonyms":["foot doctor","foot specialist"],"phonetic":"/pəˈdaɪətrɪst/","extraExplanation":["词源小提示：pod- 来自希腊语，意思是“脚”（如 podiatry 足病学）；-iatrist 表示“治疗者/医生”（如 psychiatrist 精神科医生）。","在美国，podiatrist 通常指 DPM（Doctor of Podiatric Medicine），常见工作包括处理足跟痛（足底筋膜炎）、拇外翻、嵌甲、糖尿病足护理，以及开矫形鞋垫等。不同国家对执业范围可能有所差异。"]}
{"word":"podiatrists","summary":{"en":"Podiatrists are foot-and-ankle medical specialists.","zh":"podiatrists 指“足踝专科的医疗医生”（足病医生/足科医生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"medical specialists who diagnose and treat problems of the feet and ankles (including nail, skin, bone, and walking issues)","zh":"足病医生／足科医生：专门诊断和治疗足部与踝部问题的医疗专业人员（包括指甲、皮肤、骨骼与步态等）"},"examples":[{"en":"I saw a podiatrist for my heel pain.","zh":"我因为脚跟痛去看了足病医生。"},{"en":"Podiatrists often treat ingrown toenails and plantar fasciitis.","zh":"足病医生常处理嵌甲和足底筋膜炎。"},{"en":"The podiatrist recommended better shoes and custom insoles.","zh":"足病医生建议我换更合适的鞋，并配定制鞋垫。"}]}],"synonyms":["foot doctor","foot-and-ankle specialist","chiropodist (BrE, older)"],"phonetic":"/pəˈdaɪətrɪsts/","extraExplanation":["在美国等国家，podiatrist 通常指受过专门训练、专注于足与踝的医疗人员；在不同地区，其执业范围与称呼可能不同。","词形：podiatrist（单数）→ podiatrists（复数）。词源：pod-（脚）+ iatr-（医治/医生）来自希腊语词根。"]}
{"word":"podiatry","summary":{"en":"Podiatry is the medical specialty focused on the feet and ankles.","zh":"Podiatry 指专门研究与治疗足部和踝部问题的医学科别。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The branch of medicine that deals with the feet and ankles (including diagnosing and treating problems, injuries, and deformities).","zh":"足病学；足踝医学：研究与治疗足部和踝部疾病、损伤与畸形的医学分支。"},"examples":[{"en":"She went to a podiatry clinic because her heel pain wouldn’t go away.","zh":"她去看足病诊所，因为脚跟痛一直不好。"},{"en":"Podiatry can help people with diabetes prevent serious foot complications.","zh":"足病学可以帮助糖尿病患者预防严重的足部并发症。"},{"en":"He’s studying podiatry and hopes to work with athletes.","zh":"他在学习足病学，希望将来为运动员服务。"}]}],"synonyms":["foot care (general)","podiatric medicine"],"phonetic":"/poʊˈdaɪ.ə.tri/","extraExplanation":["“podiatry”来自希腊语词根：pod-（脚）+ iatry（医疗/治疗）。在美国，“podiatrist”是足病医生（DPM），常见工作包括处理拇外翻（bunion）、足底筋膜炎（plantar fasciitis）、嵌甲（ingrown toenail）等。日常表达中也常说“foot doctor”（脚科医生）。"]}
{"word":"podical","summary":{"en":"Podical is a rare adjective meaning “related to the foot.”","zh":"podical 是一个罕见形容词，意思是“与脚/足有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to the foot; podal/pedic.","zh":"（罕见）与“脚/足”有关的；相当于 podal/pedic（足部的）。"},"examples":[{"en":"In older medical writing, you may see podical used to describe foot pain or foot bones.","zh":"在较早的医学写作中，你可能会看到 podical 用来描述足部疼痛或足骨。"},{"en":"The report mentioned podical injuries after a long march.","zh":"报告提到长途行军后的足部损伤。"}]}],"synonyms":["podal","pedic","podiatric","pedal"],"phonetic":"/ˈpɑːdɪkəl/","extraExplanation":["“podical”在现代英语里非常少见，多数情况下读者更常遇到的是 podiatric（足病学的）、pedal（脚的/踏板的）、podal（足的）、pedic（足的）。","词根 pod-/ped- 来自希腊语/拉丁语，意思是“脚/足”（如 podiatry 足病学；octopus 章鱼=“八足”）。如果你是在某篇文章里看到 podical，有可能是作者用的旧式词、专业术语，或是把更常见的 podal/pedic 写成了 podical。"]}
{"word":"podiceps","summary":{"en":"Podiceps is the scientific genus name for several grebes—diving water birds.","zh":"Podiceps 是多种䴙䴘（擅长潜水的水鸟）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of water bird (a grebe) in the genus Podiceps, known for diving and swimming well and for building floating nests on lakes and wetlands.","zh":"一种水鸟（䴙䴘/“鸊鷉”一类），属名为 Podiceps（䴙䴘属）；擅长潜水游泳，常在湖泊与湿地筑漂浮巢。"},"examples":[{"en":"We spotted a Podiceps grebe diving repeatedly near the reeds.","zh":"我们在芦苇旁看到一只䴙䴘属的鸟不停地潜水。"},{"en":"Many Podiceps species prefer quiet freshwater lakes during the breeding season.","zh":"许多䴙䴘属物种在繁殖季更偏好安静的淡水湖泊。"}]}],"synonyms":["grebe (common name)"],"phonetic":"/pɑˈdɪsəps/","extraExplanation":["“Podiceps”是拉丁化的动物分类学属名，常见于鸟类学与生物学写作中；日常英语里更常说“grebe（䴙䴘）”。","词源常被解释为拉丁语：pod-/pes（脚）+ -ceps（头），大意是“脚靠近头”，用来形容䴙䴘的腿位置靠后，走路笨拙但游泳很强。","用法提示：作为属名通常首字母大写（Podiceps），指整个属；当作普通名不太常见，口语里建议用“grebe”。"]}
{"word":"podices","summary":{"en":"“Podices” is the plural of “podex,” a very vulgar word for the anus.","zh":"“podices”是“podex”的复数，是指“肛门”的非常粗俗说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of podex: a very vulgar/obscene word meaning “anus.”","zh":"podex 的复数：非常粗俗/猥亵的说法，意思是“肛门”。"},"examples":[{"en":"The editor removed the word because it was obscene.","zh":"编辑把这个词删掉了，因为它很猥亵。"},{"en":"In formal writing, use “anus” instead of vulgar slang.","zh":"在正式写作中，用“anus（肛门）”而不要用粗俗俚语。"}]}],"synonyms":["anus (neutral/formal)"],"phonetic":"/ˈpoʊdɛks/","extraExplanation":["“podex / podices”源自拉丁语（podex），属于非常低俗的词汇。在现代英语里极少用于正式语境，更多见于刻意粗口、黑色幽默或少数古典/拉丁化的文本中。","如果你是在医学、解剖或正式场合表达“肛门”，更中性、常见的词是“anus”。在口语里常见但较粗俗的替代说法还有“butt/ass”等（语气与冒犯程度因语境而异）。"]}
{"word":"podicipedidae","summary":{"en":"Podicipedidae is the scientific family name for grebes (diving water birds).","zh":"Podicipedidae 是䴙䴘（鸊鷉）这类善潜水水鸟的“科”的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of water birds called grebes, known for diving and swimming underwater; they live on lakes and other freshwater (sometimes coastal) habitats.","zh":"䴙䴘科（鸊鷉科）：一类水鸟（䴙䴘/鸊鷉）的生物分类“科”，以善于潜水和在水下游泳著称，常见于湖泊等淡水环境（有时也见于海岸水域）。"},"examples":[{"en":"Grebes belong to the family Podicipedidae.","zh":"䴙䴘属于䴙䴘科（Podicipedidae）。"},{"en":"Researchers compared nesting behavior across several Podicipedidae species.","zh":"研究人员比较了几种䴙䴘科物种的筑巢行为。"}]}],"synonyms":["grebes (members of the family)"],"phonetic":"/ˌpɑːdəˈsɪpɪdiː/","extraExplanation":["这是一个较“学术/专业”的拉丁化学名，常见于鸟类学、生态学论文或野外调查报告中；日常英语里更常说 grebe（䴙䴘/鸊鷉）。","词源来自拉丁语：podi-（脚）+ -ciped-（有……脚的），大意与“脚的位置/结构”有关，呼应䴙䴘脚位靠后、擅长游泳但在陆地上行走笨拙的特征。"]}
{"word":"podilegous","summary":{"en":"“Podilegous” is not a standard English word; it is likely a misspelling of “prodigious” (very large or extraordinary).","zh":"“podilegous”不是标准英语词汇；很可能是“prodigious”的拼写错误，意为“巨大的/惊人的/非凡的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “prodigious”) very large in size, amount, or degree; extraordinary.","zh":"（很可能想写：prodigious）巨大的；数量惊人的；非凡的。"},"examples":[{"en":"She made a prodigious effort to finish the project on time.","zh":"她付出了巨大的努力，按时完成了项目。"},{"en":"The library has a prodigious collection of books.","zh":"这家图书馆有数量惊人的藏书。"},{"en":"He showed prodigious talent at a young age.","zh":"他年纪很小就展现出非凡的天赋。"}]}],"synonyms":["enormous","huge","immense","vast","remarkable","extraordinary"],"phonetic":"/prəˈdɪdʒəs/","extraExplanation":["“podilegous”在常见英语词典中通常找不到，可能是拼写错误。最接近且常用的词是“prodigious”（意为“巨大的/惊人的/非凡的”）。","如果你是从某篇文章、小说或截图里看到“podilegous”，欢迎把原句发来，我可以根据上下文判断它是否是罕见用法、专有名词，或作者的创意拼写。"]}
{"word":"podite","summary":{"en":"A podite is one jointed segment of an arthropod limb.","zh":"podite 指节肢动物附肢（腿等）的一个肢节/节段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A segment (jointed part) of an arthropod’s limb, such as one section of an insect leg or a crustacean appendage.","zh":"（节肢动物的）肢节；附肢的一段（如昆虫腿或甲壳类附肢的某一节）。"},"examples":[{"en":"In an insect leg, each podite forms a joint with the next segment.","zh":"在昆虫的腿上，每个肢节都会与下一个节段形成关节。"},{"en":"The microscope image shows the boundaries between podites on the specimen’s appendage.","zh":"显微镜图像显示了标本附肢上各肢节之间的分界。"}]}],"synonyms":["limb segment","appendage segment","leg segment"],"phonetic":"/ˈpoʊdaɪt/","extraExplanation":["这是一个生物学/动物学术语，日常英语里很少用，常见于节肢动物解剖与分类学描述中。","词根来自希腊语/拉丁语的“脚”相关成分（pod-），你也会在 podiatry（足病学）、podiatrist（足病医生）、pseudopod（伪足）等词里看到它。"]}
{"word":"podites","summary":{"en":"“Podites” means the limb segments of jointed animals (the plural of podite).","zh":"“podites”指节肢动物等关节附肢的各个肢节（podite 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) The plural of podite: one of the segments (parts) of a jointed limb, especially in arthropods (e.g., insects, spiders, crustaceans).","zh":"（动物学）podite 的复数：指节肢动物（如昆虫、蜘蛛、甲壳类）分节附肢中的一个“肢节/肢段”。"},"examples":[{"en":"In a crab’s walking leg, each podite connects by a joint and can move separately.","zh":"在螃蟹的步足中，每个 podite（肢节）都通过关节连接，并且可以分别活动。"},{"en":"The researcher labeled the podites to compare limb structure across different species.","zh":"研究人员标注各个 podites（肢节），以比较不同物种的附肢结构。"}]}],"synonyms":["leg segments","limb segments","podomeres"],"phonetic":"/ˈpoʊ.daɪts/","extraExplanation":["“podite”来自希腊语词根 *pod-*（脚、足），常见于生物学术语（如 *podiatry* 足病学、*arthropod* 节肢动物）。","这个词属于专业术语，日常英语里很少见；在科普或学术写作中更常用更通俗的说法，如 *leg segment(s)*（腿的分节/段）。"]}
{"word":"poditic","summary":{"en":"A rare adjective meaning “related to the foot/feet; having feet.”","zh":"一个罕见形容词，意为“与脚/足有关的；有足的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to the foot/feet; having feet. (Example: “a poditic structure” = a structure connected with feet/leg-like parts.)","zh":"（罕见）与脚/足有关的；有足的。（例：“poditic structure” 指与“足/足状部分”相关的结构。）"},"examples":[{"en":"In older scientific writing, “poditic” could describe something connected to feet or foot-like parts.","zh":"在较早的科学写作中，poditic 有时用来描述与“足”或“足状部分”有关的事物。"},{"en":"This term is uncommon today; writers usually choose clearer words like “foot-related.”","zh":"这个词如今很少见；写作时通常会用更清楚的表达，如 foot-related（与脚有关的）。"}]}],"synonyms":["foot-related","pedal (relating to the foot)","podiatric (medical, foot-related)"],"phonetic":"/pəˈdɪtɪk/","extraExplanation":["poditic 不是现代英语里常用词，多见于较旧或较专业的文本。词根 pod- 来自希腊语，表示“脚/足”（同源词：podiatry 足病学；arthropod 节肢动物）。","如果你想表达“绝对确定、无可置疑的”，你可能想写的是 apodictic（/ˌæpəˈdɪktɪk/），这与 poditic（“脚/足相关”）意义完全不同。"]}
{"word":"poditti","summary":{"en":"“poditti” isn’t recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“poditti”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, a brand, or a word from another language.","zh":"不是标准英语词。可能是拼写错误、人名/品牌名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “poditti” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“poditti”——你能把它出现的句子发我吗？"},{"en":"Did you mean “podcast,” “podium,” or “pundit”?","zh":"你是不是想写“podcast（播客）”、“podium（讲台/领奖台）”或“pundit（专家评论员）”？"}]}],"phonetic":"/pəˈdɪti/","extraExplanation":["“poditti”在常见英语词典中没有收录，因此更可能是：\n1）拼写误差（例如键盘输入、OCR识别）；\n2）专有名词（人名、地名、品牌、用户名）；\n3）其他语言的词。\n\n你可以把：A) 它出现的完整句子；B) 你想表达的中文意思；C) 看到它的来源（书/视频/网页）发来，我就能更准确地判断它可能是哪一个词，并给出正确释义与用法。"]}
{"word":"podium","summary":{"en":"A raised platform used for speaking or conducting, or the stand used for award winners in ceremonies.","zh":"指用于演讲/指挥的高台（讲台），也指颁奖时获奖者站的领奖台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small raised platform used by a speaker, conductor, or performer (often with a stand for notes).","zh":"（演讲者、指挥或表演者使用的）讲台；指挥台；小型高台（常带放讲稿的架子）。"},"examples":[{"en":"The professor stepped onto the podium and began the lecture.","zh":"教授走上讲台，开始上课。"},{"en":"The conductor stood on the podium to lead the orchestra.","zh":"指挥站在指挥台上带领乐团。"}]},{"partOfSpeech":"n.","definition":{"en":"A platform where winners stand during an awards ceremony (especially in sports).","zh":"（颁奖典礼上，尤指体育比赛的）领奖台。"},"examples":[{"en":"She finished first and stood on the top of the podium.","zh":"她获得第一名，站上领奖台的最高处。"},{"en":"The team hoped for a podium finish this season.","zh":"这支队伍希望本赛季能拿到登上领奖台的名次。"}]}],"synonyms":["platform","rostrum","lectern (often for the stand)","dais"],"phonetic":"/ˈpoʊdiəm/","extraExplanation":["“Podium”在美式英语里常指“讲台/演讲台”。在一些英式语境中，人们有时会把“lectern（讲稿台）”用于“放讲稿的架子”，把“podium”用于“站立的小高台”；但日常交流中两者常被混用。"]}
{"word":"podiums","summary":{"en":"“Podiums” is the plural of “podium”: a raised platform for speaking or the winners’ stands in sports awards.","zh":"“Podiums”是“podium”的复数：可指演讲用的讲台/平台，也可指体育颁奖的领奖台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A raised platform that someone stands on, especially a small stage for speaking (often with a lectern).","zh":"（尤指演讲用的）讲台；（稍高的）平台"},"examples":[{"en":"The professor stepped onto the podium and began the lecture.","zh":"教授走上讲台，开始上课。"},{"en":"Please wait at the podium until your name is called.","zh":"请在讲台旁等候，直到叫到你的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"The raised platforms used in sports ceremonies for winners (1st, 2nd, 3rd places).","zh":"（颁奖典礼的）领奖台（第一、第二、第三名站的台子）"},"examples":[{"en":"She finished third and made it onto the podium.","zh":"她获得第三名，登上了领奖台。"},{"en":"The three medalists stood on the podium for the national anthems.","zh":"三位奖牌获得者站在领奖台上聆听国歌。"}]}],"synonyms":["platform","stage","dais","lectern (often confused; not exactly the same)","winners’ stand"],"phonetic":"/ˈpoʊdiəmz/","extraExplanation":["“Podium”单数是 podium，复数常见两种：podiums（更常见、更口语/通用）和 podia（较正式、偏学术/拉丁复数）。","英式英语里有时会把“podium”用作“讲台+讲台桌（lectern）”的组合概念；但在美式英语中，讲台（podium）是你站的“台”，lectern 是你放稿子/麦克风的“讲桌”。日常交流中两者也常被混用。","在体育语境里，“make the podium”表示“拿到前三、站上领奖台”，常见于赛车、自行车、田径等报道。"]}
{"word":"podler","summary":{"en":"A polder is land reclaimed from water and kept dry by dikes and pumping.","zh":"polder 指从海或湖中填垦出来、靠堤坝与排水维持干燥的圩田。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A low-lying piece of land reclaimed from the sea or a lake and protected by dikes, common in the Netherlands.","zh":"（尤指荷兰的）围海（或围湖）造田地，圩田；被堤坝保护的低洼填垦地。"},"examples":[{"en":"Much of the Netherlands is made up of polders protected by dikes.","zh":"荷兰的很大一部分由堤坝保护的圩田组成。"},{"en":"Engineers pumped water out to create a new polder for farming.","zh":"工程师抽走积水，造出一片新的圩田用于耕作。"}]}],"synonyms":["reclaimed land","drained land"],"phonetic":"/ˈpoʊldɚ/","extraExplanation":["“podler”不是常见英语单词，最接近、最常见的拼写是 **polder**（圩田）。如果你想表达的是别的词（例如人名、品牌、游戏术语等），可以告诉我你看到它的句子/上下文，我可以帮你精准判断。","**polder** 这个词来自荷兰语，和荷兰的治水与填海历史密切相关；英语里常在地理、工程、环境话题中出现。"]}
{"word":"podley","summary":{"en":"“Podley” is usually a surname (a proper name), not a common English word.","zh":"“Podley”通常是姓氏（专有名词），不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A family name (surname). Not a common English vocabulary word; it is usually used as a name.","zh":"（专有名词）姓氏。它通常作为人名使用，不是常见的英语词汇。"},"examples":[{"en":"Ms. Podley will join the meeting at 3 p.m.","zh":"波德利女士将于下午三点参加会议。"},{"en":"I found the article by Podley in the library database.","zh":"我在图书馆数据库里找到了波德利写的那篇文章。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal/rare) Sometimes seen as a misspelling or typo in place of another word (for example, “oddly” or a name).","zh":"（非正式/罕见）有时作为拼写错误出现，可能本来想写别的词（例如 oddly“奇怪地”，或某个名字）。"},"examples":[{"en":"Did you mean “oddly”? “Podley” isn’t a standard word here.","zh":"你是想写“oddly”吗？这里的“podley”不是标准词。"},{"en":"The document says “podley,” but it may be a typo.","zh":"文件里写的是“podley”，但可能是笔误。"}]}],"phonetic":"ˈpɑdli","extraExplanation":["“Podley”在常见英语词典里通常不会作为普通词条出现，更常见的是姓氏（如人名/作者名/邮箱名）。","如果你是在句子里看到它，我可以帮你判断它是不是拼写错误。你可以把原句发来，或告诉我你想表达的中文意思。","可能被误写/误读的词包括：oddly（奇怪地）、pod（豆荚；吊舱）、Pudley/Podly（较少见的名字拼法）。"]}
{"word":"podlike","summary":{"en":"Podlike means shaped like a seed pod, usually long and narrow.","zh":"podlike指“荚状的”，外形像种荚（常见为细长形）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a pod (a long, usually narrow case that holds seeds, like a pea pod).","zh":"荚状的；像豆荚/种荚那样的（通常细长，用来包裹种子的外壳）。"},"examples":[{"en":"The plant produces podlike fruits that split open when they are dry.","zh":"这种植物会结出荚状果实，干燥后会裂开。"},{"en":"Researchers described the creature as having a podlike body.","zh":"研究人员形容这种生物有荚状的身体。"}]}],"synonyms":["pod-shaped","pod-form","capsule-shaped","elongated"],"phonetic":"/ˈpɑdˌlaɪk/","extraExplanation":["“podlike”是由名词pod（荚；豆荚）+ like（像……的）构成的形容词，常用于生物学、植物学、医学或科普写作，描述外形特征。","写法上也常见“pod-like”（加连字符），意思相同；较少用于日常口语，多见于描写性或技术性文本。"]}
{"word":"podo","summary":{"en":"Podo- is a combining form meaning “foot,” mainly used in medical/scientific terms.","zh":"podo- 是表示“脚/足”的构词成分，主要用于医学/科学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “foot,” used in medical and scientific words","zh":"词根/构词成分，表示“脚、足”，常用于医学和科学词汇中"},"examples":[{"en":"A podiatrist is a doctor who treats problems of the feet.","zh":"podiatrist（足病医生）是治疗脚部问题的医生。"},{"en":"The word podiatry comes from podo- (foot) + -iatry (medical treatment).","zh":"podiatry（足病学）来自 podo-（脚）+ -iatry（医疗/治疗）。"},{"en":"Some animals are described by their feet, like arthropods (joint-footed animals).","zh":"有些动物会用“脚”的特征来命名，比如 arthropods（节肢动物，意为“关节脚的动物”）。"}]}],"synonyms":["ped-","pod-"],"phonetic":"/ˈpoʊdoʊ/","extraExplanation":["podo- 来自希腊语 pous/podos（“脚”）。在英语里它通常不单独当作一个词使用，而是作为词根出现在较正式的术语中（如 podiatry, podiatrist, podology）。","注意不要和拉丁词根 ped-/pod-（也常表示“脚”，如 pedal, pedestrian）混淆：两者都与“脚”有关，但来源不同。"]}
{"word":"podobranch","summary":{"en":"A podobranch is a crustacean gill attached to the base of a leg.","zh":"podobranch 指甲壳动物腿（胸足）基部的鳃，常译为“足鳃/腿鳃”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/Zoology) A gill in some crustaceans that is attached to the base of a leg (thoracic appendage).","zh":"（生物/动物学）某些甲壳动物的一种鳃，生在（附着于）胸足等“腿”的基部，因此也可理解为“足鳃/腿鳃”。"},"examples":[{"en":"Some crabs have several types of gills, including podobranchs attached near the legs.","zh":"有些螃蟹有好几种鳃，包括附着在腿附近的足鳃（podobranch）。"},{"en":"Under the microscope, the podobranch looks like a feathery structure beside the limb base.","zh":"在显微镜下，足鳃看起来像是在肢体基部旁的一种羽毛状结构。"}]}],"synonyms":["leg gill","foot gill"],"phonetic":"/ˈpoʊdəˌbræŋk/","extraExplanation":["词源提示：pod- 来自希腊语，意思是“足/脚”（如 podiatry 足病学）；-branch 在动物学构词中常见，来自希腊语，和“鳃”有关（如 gill-breathers 的分类术语里）。合起来 podobranch 就是“足（上）的鳃”。","相关对比（便于记忆）：在甲壳动物里，鳃的位置常用名称区分——podobranch（足鳃，附在足基部）、arthrobranch（关节鳃，附在足与身体连接处附近）、pleurobranch（侧鳃，附在身体侧壁）。不同类群拥有的组合不一样。"]}
{"word":"podobranchia","summary":{"en":"Podobranchia are crustacean gills attached to the base of the legs.","zh":"Podobranchia 指甲壳类动物附着在步足基部的鳃（足鳃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In crustaceans) a type of gill attached to the base of a walking leg (thoracic appendage).","zh":"（甲壳类动物）一种附着在步足（胸肢）基部的鳃。"},"examples":[{"en":"Some decapod crustaceans have podobranchia at the bases of their walking legs.","zh":"一些十足目甲壳类在步足基部具有足鳃（podobranchia）。"},{"en":"The diagram labels the podobranchia near the leg joints.","zh":"图示在腿部关节附近标出了足鳃。"}]}],"synonyms":["podobranchs","leg gills"],"phonetic":"/ˌpoʊdoʊˈbræŋkiə/","extraExplanation":["词源上可拆为 podo-（“脚、足”）+ branchia（“鳃”），因此直译接近“足鳃”。","这是动物学/比较解剖学术语，常用于描述十足目（如虾、蟹、龙虾）等甲壳类的鳃的类型与位置；与 arthrobranchia（关节鳃）等术语一起出现。"]}
{"word":"podobranchial","summary":{"en":"Podobranchial means “related to gills attached to the base of a leg/appendage,” mainly in crustaceans.","zh":"podobranchial 指“与附着在步足/附肢基部的足鳃有关的”，主要用于甲壳类的解剖描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a podobranch (a type of gill attached to the base of a leg/appendage), especially in crustaceans such as crabs and lobsters.","zh":"与“足鳃/足生鳃（podobranch）”有关的；尤指甲壳类（如螃蟹、龙虾）在步足基部附着的一类鳃。"},"examples":[{"en":"Some crustaceans have podobranchial gills near the bases of their walking legs.","zh":"一些甲壳类在步足的基部附近有足鳃型（podobranchial）的鳃。"},{"en":"The diagram labels the podobranchial structures beside the thoracic appendages.","zh":"图示在胸部附肢旁标出了足鳃相关（podobranchial）的结构。"}]}],"synonyms":["podobranch"],"phonetic":"/ˌpoʊdoʊˈbræŋkiəl/","extraExplanation":["词源上可拆为 podo-（“足/脚”，来自希腊语 pous/pod-）+ branchial（“鳃的”）。因此 podobranchial 字面意思就是“足上的鳃/与足鳃相关的”。","它多见于动物学、比较解剖学与无脊椎动物学教材或论文中；日常英语里很少使用。","相关术语：podobranch（足鳃，名词）；与之对比的还有 pleurobranch（侧鳃）与 arthrobranch（关节鳃），都是描述鳃附着位置的分类方式。"]}
{"word":"podobranchiate","summary":{"en":"Podobranchiate describes animals (especially crustaceans) with gills attached to the bases of their legs.","zh":"podobranchiate 指（尤指甲壳类）鳃附着在足（步足）基部的“足鳃型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having gills (branchiae) attached to the bases of the legs (podites); describing certain crustaceans whose gills arise from the limbs.","zh":"（动物学）具“足鳃”的；鳃（鳃状器官）附着在足（步足）基部的；用于描述某些甲壳类其鳃从肢体基部生出。"},"examples":[{"en":"In this genus, the gills are podobranchiate rather than pleurobranchiate.","zh":"在这个属中，鳃是足鳃型（podobranchiate），而不是侧鳃型（pleurobranchiate）。"},{"en":"The dissection showed podobranchiate gills near the bases of the walking legs.","zh":"解剖显示在步足基部附近有足鳃型的鳃。"}]}],"synonyms":["podo-branchiate (variant spelling)","leg-gilled (informal)"],"phonetic":"/ˌpoʊdoʊˈbræŋkiˌeɪt/","extraExplanation":["这是一个较少见的分类学/解剖学术语，常出现在甲壳类（如某些虾、蟹）的形态描述中，用来区分鳃附着的位置。","词源可拆解为：podo-（足）+ branchia（鳃）+ -ate（……的）。相关对比术语常见：pleurobranchiate（侧鳃型，鳃附在身体侧面）、arthrobranchiate（关节鳃型，鳃附在肢体关节附近）。"]}
{"word":"podocarp","summary":{"en":"A podocarp is an evergreen conifer tree, mostly native to the Southern Hemisphere.","zh":"podocarp 指主要原产于南半球的一类常绿针叶树（罗汉松类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of evergreen conifer tree in the family Podocarpaceae, found mainly in the Southern Hemisphere (some are grown as ornamental trees).","zh":"罗汉松属（或罗汉松科）的一类常绿针叶树，主要分布在南半球（部分也作为观赏树栽培）。"},"examples":[{"en":"Podocarps grow naturally in places like New Zealand and parts of South America.","zh":"罗汉松类植物自然生长在新西兰以及南美洲的部分地区。"},{"en":"The garden has a podocarp planted as an evergreen screen for privacy.","zh":"花园里种了一棵罗汉松类植物，作为常绿屏障来保护隐私。"}]}],"synonyms":["Podocarpus (genus name, often used in gardening)","conifer (broader term)"],"phonetic":"/ˈpoʊdəˌkɑrp/","extraExplanation":["“podocarp”来自植物学拉丁词源：pod(o)- 表示“脚”，-carp 表示“果实/果”。这一命名与其种子常带有类似“肉质托”（像小果托）的结构有关。","日常英语里更常见的是家族/科名或具体属名（如 Podocarpus），有时园艺语境会把某些罗汉松类植物统称为 podocarp。拼写上注意不是 *podocarb*。"]}
{"word":"podocarpaceae","summary":{"en":"Podocarpaceae: the podocarp family, a group of conifer trees and shrubs.","zh":"Podocarpaceae：罗汉松科，一类针叶树与灌木的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mostly Southern Hemisphere conifer trees and shrubs (the podocarp family), including podocarps and related genera.","zh":"罗汉松科（主要分布于南半球的一类针叶树与灌木的科，包括罗汉松属及其近缘属）。"},"examples":[{"en":"Podocarpaceae are common in parts of New Zealand’s native forests.","zh":"在新西兰部分原生森林中，罗汉松科植物很常见。"},{"en":"The garden label lists the tree as a member of Podocarpaceae.","zh":"花园的标签把这棵树标注为罗汉松科植物。"}]}],"synonyms":["podocarp family"],"phonetic":"/ˌpoʊ.doʊ.kɑrˈpeɪ.si.iː/","extraExplanation":["这是植物分类学中的“科名”（family name），常见于学术文章、植物园标签与自然科普文本中；科名在英文里通常首字母大写（Podocarpaceae），泛指时也可能小写。","词形来源：Podocarpus（罗汉松属名）+ -aceae（植物科名常用后缀），读写时可把它理解为“某某属相关的一大类植物（一个科）”。","该科多为常绿木本，很多种类分布在澳大利亚、新西兰、南美、非洲南部与东南亚山地等地区；部分种类因栖息地减少而具有保护意义。"]}
{"word":"podocarpineae","summary":{"en":"Podocarpineae is a botanical taxonomic name for a group within the podocarp family (Podocarpaceae), used mainly in some older or specialized classification systems.","zh":"Podocarpineae 是植物分类名称，指罗汉松科中的一个类群，多见于较早或较专门的分类体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A taxonomic group of conifers in the podocarp family (Podocarpaceae), used in some classification systems (often treated as a subfamily or tribe) that includes Podocarpus and related genera.","zh":"罗汉松科（Podocarpaceae）中的一个分类群（在不同分类系统中常作“亚科”或“族”使用），通常包括罗汉松属（Podocarpus）及其近缘属。"},"examples":[{"en":"Some older botanical texts place Podocarpus within the group Podocarpineae.","zh":"一些较早的植物学文献会把罗汉松属（Podocarpus）归入 Podocarpineae 这一类群。"},{"en":"The term Podocarpineae appears in historical classifications of the Podocarpaceae.","zh":"Podocarpineae 这个术语常见于罗汉松科的历史分类体系中。"}]}],"synonyms":["Podocarpaceae (context-dependent)","Podocarpus (related genus, not a true synonym)"],"phonetic":"/ˌpoʊdoʊkɑrˈpɪniˌi/","extraExplanation":["这是一个植物分类学术语，结尾 -ineae 常用于表示植物的“族”（tribe）或相关层级的类群名称；但在不同年代与不同学者的系统里，它的等级可能不完全一致。","现代资料更常直接使用“Podocarpaceae（罗汉松科）”以及具体属名（如 Podocarpus），而 Podocarpineae 往往出现在传统/历史分类或特定专著中。"]}
{"word":"podocarpous","summary":{"en":"Podocarpous means “related to Podocarpus or podocarps,” used mainly in botanical contexts.","zh":"podocarpous 指“与罗汉松属或罗汉松类有关的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the genus Podocarpus (a group of conifer trees) or to plants in the podocarp family.","zh":"与罗汉松属（Podocarpus，一类针叶树）或与罗汉松科植物有关的。"},"examples":[{"en":"The garden features several podocarpous evergreens that tolerate shade well.","zh":"这座花园里种了几株罗汉松科相关的常绿植物，它们很耐阴。"},{"en":"Researchers compared podocarpous forests with pine-dominated forests.","zh":"研究人员比较了罗汉松类森林与松树占优势的森林。"}]}],"synonyms":["podocarp-related","Podocarpus-related"],"phonetic":"/ˌpoʊdəˈkɑːrpəs/","extraExplanation":["这是一个相当专业的植物学形容词，常见于植物分类、生态学或园艺写作中。日常英语几乎不用；更常见的说法是直接用名词 Podocarpus 或 podocarp（如：a podocarp tree / podocarp species）。","词源结构：Podocarpus（罗汉松属名）+ -ous（“……的/具有……性质的”），意思就是“罗汉松属（或罗汉松类）的”。"]}
{"word":"podocarpus","summary":{"en":"Podocarpus is a genus of evergreen conifers (trees or shrubs), often used ornamentally.","zh":"Podocarpus 指罗汉松属的常绿针叶植物（树或灌木），常用于园艺观赏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of evergreen conifer tree or shrub in the genus Podocarpus, common in the Southern Hemisphere and often grown as an ornamental plant","zh":"罗汉松属植物；一种常绿针叶树或灌木（多见于南半球，也常作观赏植物栽培）"},"examples":[{"en":"Podocarpus is often used as a hedge in warm climates.","zh":"在温暖地区，罗汉松属植物常被用来做绿篱。"},{"en":"The garden features a podocarpus with dense, glossy leaves.","zh":"花园里有一株罗汉松属植物，叶子浓密而有光泽。"}]}],"synonyms":["Podocarpus (genus)","podocarp (informal)"],"phonetic":"/ˌpoʊdəˈkɑrpəs/","extraExplanation":["“Podocarpus”是拉丁化的植物学属名，常见英文口语里也会直接把属名当作园艺用的通称（例如指代常见的“Japanese yew / Buddhist pine”一类的园艺品种）。不同地区对同一类植物的俗名不完全一致，购买或辨识时可结合学名（属名+种加词，如Podocarpus macrophyllus）更准确。"]}
{"word":"podocephalous","summary":{"en":"A rare zoological adjective meaning “having feet/limbs attached to the head,” often used of cephalopods.","zh":"一个罕见的动物学形容词，意为“足/肢体连接在头部的”，常用于描述头足类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Having the feet (or limbs) attached to the head; describing animals whose main limbs seem to arise from the head area (as in cephalopods).","zh":"（动物学）“足生于头部的”；形容动物的足或肢体看起来连接在头部附近（如头足类）。"},"examples":[{"en":"Squid and octopuses are sometimes described as podocephalous because their arms attach near the head.","zh":"鱿鱼和章鱼有时会被描述为podocephalous（足生于头部的），因为它们的腕足连接在头部附近。"},{"en":"The researcher used podocephalous as an old-fashioned adjective in a taxonomy note.","zh":"研究者在分类学注释中用podocephalous这个较旧的形容词。"}]}],"synonyms":["cephalopodous","cephalopodan"],"phonetic":"/ˌpoʊdoʊˈsɛfələs/","extraExplanation":["这个词非常少见，主要出现在较老的动物学/分类学写作里。","词源可拆成希腊语词根：podo-（脚/足）+ cephal-（头）+ -ous（……的），字面意思就是“脚在头上的”。现代写作中更常直接说 cephalopod（头足类）或用更常见的描述方式。"]}
{"word":"podocyte","summary":{"en":"A podocyte is a specialized kidney cell in the glomerulus that helps filter blood.","zh":"podocyte 指肾小球内参与血液过滤的特化肾脏细胞（足细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized cell in the kidney that wraps around tiny blood vessels (glomerular capillaries) and helps filter blood to form urine","zh":"足细胞；肾脏中一种特化细胞，包裹肾小球毛细血管，参与血液过滤并形成尿液"},"examples":[{"en":"Damage to podocytes can cause protein to leak into the urine.","zh":"足细胞受损会导致蛋白质漏到尿液中。"},{"en":"In the glomerulus, podocytes form part of the filtration barrier.","zh":"在肾小球中，足细胞构成过滤屏障的一部分。"},{"en":"Researchers study podocyte injury in diseases like diabetic kidney disease.","zh":"研究人员会在糖尿病肾病等疾病中研究足细胞损伤。"}]}],"synonyms":["glomerular epithelial cell","visceral epithelial cell"],"phonetic":"/ˈpɑːdəˌsaɪt/","extraExplanation":["词源：pod- 表示“足/脚”（来自希腊语 pous/pod-），-cyte 表示“细胞”。因为这种细胞有许多“足突（foot processes）”，像脚一样伸出并彼此交错。","医学语境：足细胞与“肾小球滤过屏障”密切相关；当足突融合（foot process effacement）或足细胞数量减少时，常见表现之一是蛋白尿（proteinuria）。"]}
{"word":"pododerm","summary":{"en":"Pododerm means the skin or outer covering of a foot, mainly used in scientific writing.","zh":"Pododerm 指足部的皮肤或外层覆盖组织，主要用于科学文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skin or outer tissue covering of a foot (used mainly in zoology/anatomy contexts).","zh":"（多用于动物学/解剖学）足部的皮肤；覆盖足的外层组织。"},"examples":[{"en":"In mollusks, the pododerm helps protect the muscular foot from abrasion.","zh":"在软体动物中，pododerm（足部外皮）有助于保护肌肉质的足免受磨损。"},{"en":"The specimen showed irritation of the pododerm after repeated contact with rough surfaces.","zh":"该标本在反复接触粗糙表面后，足部外皮出现了刺激反应。"}]}],"synonyms":["foot skin","pedal integument","foot covering"],"phonetic":"/ˈpoʊdəˌdɝm/","extraExplanation":["这是一个较少见的学术词，常见于动物学或比较解剖的描述中。词根来自希腊语：podo-（“足”）+ derm（“皮肤”），因此字面意思就是“足的皮肤/外皮”。在不同动物类群的文献里，它可能泛指足部外层组织（不一定严格等同于人类意义上的“真皮”）。"]}
{"word":"pododynia","summary":{"en":"Pododynia is a medical word meaning pain in the foot.","zh":"Pododynia 是表示“足部疼痛/足痛”的医学词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain in the foot (a medical term for foot pain)","zh":"足痛；足部疼痛（医学用语，指脚/足部的疼痛）"},"examples":[{"en":"She visited a podiatrist because of chronic pododynia.","zh":"她因为长期足痛去看了足病医生。"},{"en":"Pododynia can be caused by overuse, injury, or inflammation.","zh":"足痛可能由过度使用、受伤或炎症引起。"}]}],"synonyms":["foot pain","pain in the foot","podalgia"],"phonetic":"/ˌpoʊdoʊˈdɪniə/","extraExplanation":["词源拆解：podo- 表示“足/脚”（来自希腊语），-dynia 表示“疼痛”。合起来就是“足部疼痛”。","使用场景：pododynia 多见于医学或临床记录中；日常英语里更常说 foot pain。","相关专业词：podiatrist（足病医生），podiatry（足病学）。"]}
{"word":"podogyn","summary":{"en":"“Podogyn” is not a standard English word; it likely refers to a misspelling or a rare technical term (e.g., podogynous/podogyne in botany).","zh":"“podogyn”不是标准英语词；多半是拼写错误或罕见专业词（如植物学的podogynous/podogyne）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a very rare/technical form. You may have meant “podogyne” or “podogynous” (botany), or a different “podo-” word such as “podophilia.”","zh":"不是标准英语词；很可能是拼写错误或非常罕见/专业的形式。你可能想写的是（植物学）“podogyne / podogynous”，或其他以“podo-”开头的词，如“podophilia（恋足癖）”。"},"examples":[{"en":"I can’t find “podogyn” in standard English dictionaries—could you share the sentence where you saw it?","zh":"在常见英语词典里找不到“podogyn”——你能把看到它的句子发我吗？"},{"en":"If you meant the botany term, you might be looking for “podogynous.”","zh":"如果你指的是植物学术语，你可能要找的是“podogynous”。"}]}],"synonyms":["podogynous","podogyne","podophilia"],"phonetic":"/ˈpɑdoʊdʒɪn/","extraExplanation":["“podo-”常见来源于希腊语，意思是“脚/足”；“gyn- / -gyn”常见表示“女性/雌性”。把两者拼在一起看起来像“与女性的脚有关”的构词，但“podogyn”本身并不是常用标准词。","如果你告诉我它出现的领域（例如植物学、医学、网络用语）或给出上下文句子，我可以更准确判断你想查的词，并给出正确拼写与释义。"]}
{"word":"podogyne","summary":{"en":"A botanical term for a stalk that elevates the ovary/pistil (a gynophore).","zh":"植物学名词：托起子房/雌蕊的柄状结构（雌蕊柄/子房柄，即 gynophore）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A stalk-like structure that supports the ovary or pistil above the base of the flower; a gynophore (i.e., a “stalked ovary”).","zh":"（植物学）托起子房或雌蕊、使其高于花基部的柄状结构；即雌蕊柄/子房柄（gynophore），也可指“有柄子房”的状态。"},"examples":[{"en":"In some flowers, the ovary is raised on a podogyne (gynophore).","zh":"在一些花中，子房会被举起并着生在雌蕊柄（podogyne / gynophore）上。"},{"en":"The species was described as having a long podogyne, making the ovary clearly stalked.","zh":"该物种被描述为具有较长的雌蕊柄，因此子房明显呈“有柄”状态。"}]}],"synonyms":["gynophore","ovary stalk","pistil stalk"],"phonetic":"/poʊˈdɑːdʒaɪn/","extraExplanation":["词源上可拆为 podo-（“脚/足”）+ -gyne（“雌性/雌蕊”），字面有“给雌蕊装了‘脚’”的感觉，用来形容子房被“抬高、带柄”。","这是偏专业的形态学术语，多见于植物分类学/花部结构描述；日常英语里更常用 gynophore。"]}
{"word":"podogynium","summary":{"en":"A rare botanical term for a stalk that supports and elevates the ovary in a flower.","zh":"罕見的植物學術語：指托起並抬高花中子房的柄狀構造。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A small stalk or column that supports the ovary (gynoecium) above the base of the flower; a type of gynophore.","zh":"（植物學）托起子房（雌蕊群）使其高出花基部的小柄／小柱；屬於一種“雌蕊柄（gynophore）”。"},"examples":[{"en":"In some flowers, a podogynium lifts the ovary above the other floral parts.","zh":"在某些花中，podogynium 會把子房托起，使其高於其他花部。"},{"en":"The diagram labels the podogynium beneath the ovary.","zh":"圖中在子房下方標出了 podogynium（子房托柄）。"}]}],"synonyms":["gynophore"],"phonetic":"/ˌpoʊdoʊˈdʒɪniəm/","extraExplanation":["這個詞較少見，主要出現在植物形態學或分類學的專業描述中。日常英語幾乎不會用到。","詞源可拆成 podo-（足、柄的概念）+ -gynium（與雌蕊／子房相關），用來形容“像腳一樣托著子房的構造”。在許多教材或論文中，更常見的近義術語是 gynophore（雌蕊柄）。","如果你是在文獻裡看到 podogynium，也可能遇到複數 podogynia。不同作者對相關構造（如 androgynophore、gynophore 等）的界定有時略有差異，閱讀時可對照圖示或作者定義。"]}
{"word":"podolian","summary":{"en":"“Podolian” means “from Podolia/Podillia,” a historical region in present-day Ukraine, and it can describe the region or the people from there.","zh":"“Podolian”指“波多利亚/波迪利亚地区的”，既可作形容词描述该地区相关事物，也可作名词指当地人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Podolia (also spelled Podillia), a historical region in what is now southwestern/central-western Ukraine.","zh":"（与）波多利亚（亦作 Podillia/Podolia）有关的；指今乌克兰西南部/中西部一带的历史地区。"},"examples":[{"en":"Podolian folk songs are known for their distinctive melodies.","zh":"波多利亚地区的民歌以独特的旋律闻名。"},{"en":"She studies Podolian embroidery patterns in traditional clothing.","zh":"她研究传统服饰中的波多利亚刺绣图案。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Podolia; someone of Podolian origin.","zh":"波多利亚人；来自波多利亚地区的人（或具有该地区血缘/文化背景的人）。"},"examples":[{"en":"His grandparents were Podolians who moved to a larger city decades ago.","zh":"他的祖父母是波多利亚人，几十年前搬去了大城市。"},{"en":"The museum highlights the lives of Podolians in the 19th century.","zh":"这座博物馆展示了19世纪波多利亚人的生活。"}]}],"synonyms":["Podolian (demonym)","Podillian (variant)","from Podolia","from Podillia"],"phonetic":"/pəˈdoʊliən/","extraExplanation":["“Podolian / Podolia / Podillia”多见于历史、民族志、地理与文学语境，指东欧的一个传统区域名称；现代行政区划中并不总与其完全对应。","拼写上可见 Podolian（形容词/名词）、Podolia（地名）、Podillia（乌克兰语转写更常见）。在学术或新闻文本中，选用哪一种常取决于作者的语言背景与转写体系。"]}
{"word":"podolite","summary":{"en":"A rare word meaning a foot-measuring instrument used for shoe fitting or podiatry.","zh":"一个较罕见的词，指用于配鞋或足科的脚部测量仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure the size and shape of a person’s foot (for example, for making or fitting shoes); a foot‑measuring instrument used in podiatry or shoemaking","zh":"足部测量仪；用于测量脚的尺寸与形状的器具（常用于制鞋或足科评估）"},"examples":[{"en":"The shoemaker used a podolite to record the customer’s foot length and width.","zh":"鞋匠用足部测量仪记录顾客脚的长度和宽度。"},{"en":"A podolite can help ensure a better fit for custom-made shoes.","zh":"足部测量仪能帮助定制鞋获得更合脚的尺寸。"}]}],"synonyms":["foot-measuring device","shoe sizer","Brannock device","podiatry measuring tool"],"phonetic":"/ˈpɑːdəˌlaɪt/","extraExplanation":["这个词非常少见，在现代英语里更常用的是 foot-measuring device、Brannock device（常见的脚码量尺）、或在医学语境中用 podiatry measurement tools（足科测量工具）。","词形可拆为 podo-（表示“脚”，源自希腊语 pous/podos）+ -lite（此处多作为构词后缀出现）。在日常交流中一般不建议使用 podolite，除非在特定行业资料或旧文献里遇到。"]}
{"word":"podology","summary":{"en":"Podology means the study and care of the human foot.","zh":"podology 指“足病学/足部研究与护理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of the human foot, especially its health, structure, and diseases; also the field of foot care.","zh":"足病学：研究人类足部（脚）的结构、健康与疾病的学科；也指足部护理与治疗领域。"},"examples":[{"en":"She chose podology because she wanted to help people with foot pain and mobility problems.","zh":"她选择学习足病学，因为她想帮助有脚痛和行动问题的人。"},{"en":"Podology often covers common issues like ingrown toenails and plantar fasciitis.","zh":"足病学常涉及一些常见问题，比如嵌甲和足底筋膜炎。"}]}],"synonyms":["podiatry","chiropody"],"phonetic":"/pɑˈdɑlədʒi/","extraExplanation":["在英语国家里，更常见的专业名称是 podiatry（足病医学），对应的医生叫 podiatrist。podology 在一些国家/地区也会用来指足部护理或相关学科，但在美国日常语境中不如 podiatry 常用。"]}
{"word":"podomancy","summary":{"en":"Podomancy is fortune-telling by interpreting feet, footprints, or gait.","zh":"Podomancy 指通过解读脚、脚印或步态来进行占卜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Divination (fortune-telling) by examining a person’s feet, footprints, or the way they walk.","zh":"足占术；通过观察人的脚、脚印或走路方式来进行占卜（算命）。"},"examples":[{"en":"In the novel, the traveling mystic claimed she could practice podomancy just by studying a stranger’s footprints in the dust.","zh":"小说里，那位流浪的神秘主义者声称只要观察尘土里的脚印就能进行足占术。"},{"en":"The museum display listed podomancy among other old forms of divination.","zh":"博物馆展览把足占术列为古老占卜方式之一。"}]}],"synonyms":["divination","fortune-telling","soothsaying","mancy (suffix use)"],"phonetic":"/ˈpoʊdoʊˌmænsi/","extraExplanation":["词源：来自希腊语词根 podo-（脚）+ -mancy（占卜）。英语里以 -mancy 结尾的词通常表示“用某种方式占卜”，例如 chiromancy（手相/掌纹占卜）。","语域提示：podomancy 属于非常冷门、偏历史/文学语境的词。日常英语里更常见的说法是 “divination/fortune-telling by reading feet/footprints.”"]}
{"word":"podomere","summary":{"en":"A podomere is one of the jointed segments that make up an arthropod limb.","zh":"podomere 指节肢动物附肢（如腿、触角）由关节连接的一个分节（肢节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A segment (jointed part) of an arthropod’s limb (such as an insect’s leg or a crustacean’s antenna).","zh":"（节肢动物附肢的）肢节；附肢的一个分节（如昆虫的腿、甲壳类的触角上的一节）。"},"examples":[{"en":"An insect leg is made up of several podomeres connected by joints.","zh":"昆虫的腿由多个肢节组成，并通过关节相连。"},{"en":"Researchers compared the shape of each podomere to identify the species.","zh":"研究人员比较每个肢节的形态来鉴定物种。"}]}],"synonyms":["limb segment","appendage segment","podite"],"phonetic":"/ˌpoʊdəˈmɪr/","extraExplanation":["词源：来自希腊语 podo-（“脚”）+ -mere/-meros（“部分、分节”），因此字面意思是“脚的一部分”。常见于昆虫学、动物形态学等较专业的生物学语境。","相关概念：podomere 强调“附肢的分节本身”；而 segment 是更一般的“分节”。在昆虫腿的具体肢节名称中，常会看到 coxa（基节）、femur（股节）、tibia（胫节）、tarsus（跗节）等都可被视为不同的 podomeres。"]}
{"word":"podomeres","summary":{"en":"Podomeres are the individual segments that make up an arthropod’s limb.","zh":"podomeres 指构成节肢动物附肢（如足、螯）的各个分节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the segment-like parts of an arthropod limb (such as an insect leg or a crustacean claw).","zh":"（节肢动物的）附肢分节；例如昆虫的腿或甲壳类的螯上的一个节段。"},"examples":[{"en":"In insects, the leg is divided into several podomeres such as the femur and tibia.","zh":"在昆虫中，足通常分成若干个附肢分节，例如股节（femur）和胫节（tibia）。"},{"en":"The scientist compared the podomeres of different crustaceans to study their evolution.","zh":"科学家比较了不同甲壳类动物的附肢分节，以研究它们的演化。"}]}],"synonyms":["limb segments","appendage segments"],"phonetic":"/ˈpoʊdoʊˌmɪr/","extraExplanation":["“podomere”是生物学/动物学术语，多用于描述节肢动物（如昆虫、蛛形纲、甲壳纲）附肢的结构分段。词源可拆为：podo-（脚、足）+ -mere（部分、片段）。","常见相关词：podomere（总称分节）、podomeres（复数）；具体分节名称在昆虫学里常见如 coxa（基节）、trochanter（转节）、femur（股节）、tibia（胫节）、tarsus（跗节）。"]}
{"word":"podometer","summary":{"en":"A pedometer is a device or app that counts your steps.","zh":"计步器/计步应用，用来记录步数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or app that counts the number of steps you take, often estimating distance and calories.","zh":"计步器；计步应用：用来记录你走了多少步，常常还会估算距离和消耗的卡路里。"},"examples":[{"en":"I use a podometer to track my steps during the day.","zh":"我用计步器来记录我一天走了多少步。"},{"en":"Her phone’s podometer says she walked over 8,000 steps.","zh":"她手机的计步功能显示她走了八千多步。"}]}],"synonyms":["step counter","fitness tracker"],"phonetic":"/pəˈdɑːmɪtɚ/","extraExplanation":["词源小提示：pedometer 来自拉丁语 ped-（脚）+ -meter（测量）。注意拼写：常见正确拼写是 pedometer（e），而 podometer（o）多被视为拼写错误；除非你指的是某个品牌名或特定产品。"]}
{"word":"podometry","summary":{"en":"Podometry means measuring distance walked by counting steps.","zh":"Podometry 指通过计算步数来测量步行距离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The measurement of distance walked, usually by counting steps (often with a pedometer or fitness tracker).","zh":"计步测距；通过计算步数来测量行走距离（常用计步器或运动手环）。"},"examples":[{"en":"Fitness apps use podometry to estimate how far you walked today.","zh":"健身应用会用计步测距来估算你今天走了多远。"},{"en":"The study compared podometry data from older adults across two weeks.","zh":"这项研究比较了老年人在两周内的计步测距数据。"}]}],"synonyms":["pedometer measurement","step counting","step count"],"phonetic":"/pɑˈdɑmətri/","extraExplanation":["“pod-”来自拉丁语，意为“脚”；“-metry”表示“测量”。因此 podometry 字面意思是“脚部/步行的测量”。","在日常英语里，这个词相对偏学术或技术语境；更常见的说法是 step count（步数）、pedometer reading（计步器读数）或 walking distance（步行距离）。"]}
{"word":"podophrya","summary":{"en":"Podophrya is a scientific name for a genus of stalked, predatory suctorian ciliates.","zh":"Podophrya 是一个科学属名，指一类带柄附着、捕食性的吸管虫类纤毛虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of suctorian ciliates (single-celled protozoans) that usually attach to surfaces by a stalk and feed by sucking prey through tentacle-like tubes.","zh":"足吸管虫属：一种吸管虫类纤毛虫（单细胞原生生物）的属，通常用柄附着在基质上，并通过触手状的吸管吸食猎物。"},"examples":[{"en":"Under the microscope, Podophrya looks like a tiny sphere on a stalk with fine feeding tentacles.","zh":"在显微镜下，Podophrya 看起来像一个带柄的小球，周围有细细的摄食触手。"},{"en":"Researchers recorded Podophrya capturing small ciliates in a freshwater sample.","zh":"研究人员记录到 Podophrya 在淡水样本中捕捉小型纤毛虫。"}]}],"synonyms":["suctorian ciliate (general term)"],"phonetic":"/ˌpoʊdoʊˈfraɪ.ə/","extraExplanation":["这是一个生物分类学名称（属名），常见于显微生物学/原生生物学文献中；在日常英语里几乎不会用到。","发音与拼写通常按拉丁化学名处理；首字母大写（Podophrya），表示属名。","词源一般被认为含有希腊语词根 pod-/podo-（“脚、足”）等成分，用来暗示其“附着/有柄”的形态特征。"]}
{"word":"podophryidae","summary":{"en":"Podophryidae is a scientific term for a family of suctorian ciliates (single-celled protozoa).","zh":"Podophryidae 是科学名词，指吸管虫类纤毛虫中的一个“科”（足吸虫科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of suctorian ciliates (single-celled protozoa) that capture prey with tentacle-like structures; found mostly in aquatic environments.","zh":"足吸虫科（Podophryidae）：一类吸管虫（纤毛虫的一支）的科，属于单细胞原生生物，多生活在水域中，用触手状结构捕捉猎物。"},"examples":[{"en":"Under the microscope, the researcher identified a suctorian ciliate in the family Podophryidae.","zh":"在显微镜下，研究人员鉴定出一种属于足吸虫科（Podophryidae）的吸管虫。"},{"en":"Podophryidae are often studied to understand how single-celled organisms feed and attach to surfaces.","zh":"足吸虫科常被用来研究单细胞生物如何摄食以及如何附着在表面上。"}]}],"synonyms":["suctorian ciliates (general term)","Suctoria (broader group)"],"phonetic":"/ˌpoʊdoʊˈfraɪɪdiː/","extraExplanation":["这是一个生物分类学名词：以“科（-idae）”结尾通常表示动物/原生生物分类中的“科”。日常英语中很少出现，常见于动物学、原生生物学或显微观察记录。","词源上，-idae 表示“……科”；Podophry- 源自希腊语构词，常与“足/附着”“眉/隆起”等形态特征相关，用来描述这类生物的外形或结构特征。"]}
{"word":"podophthalma","summary":{"en":"Podophthalma is an old zoological term for crustaceans with stalked eyes.","zh":"Podophthalma 是旧时对“具有柄眼的甲壳动物”的分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, historical) A former major group (division) of crustaceans characterized by having stalked eyes (eyes on movable eyestalks), such as many crabs, shrimp, and lobsters.","zh":"（动物学·旧分类）一种旧时对甲壳动物的大类（“分目/类群”）称呼，特点是有“柄眼”（眼睛长在可活动的眼柄上），如许多螃蟹、虾和龙虾等。"},"examples":[{"en":"In older zoology books, many decapods were placed under Podophthalma because their eyes sit on stalks.","zh":"在较早的动物学书籍中，许多十足目动物因具有柄眼而被归入 Podophthalma。"},{"en":"Modern classification no longer treats Podophthalma as a standard rank, but the term still appears in historical texts.","zh":"现代分类学不再把 Podophthalma 作为标准分类等级，但这个词仍会出现在历史文献中。"}]}],"synonyms":["stalk-eyed crustaceans","podophthalmous crustaceans"],"phonetic":"/ˌpɑːdoʊfˈθælmə/","extraExplanation":["词源：来自希腊语 pod-（脚）+ ophthalmos（眼）。这里的“脚”更像是在形容“长在柄（像小肢体）上的眼睛”，即“柄眼”的概念。","分类背景：Podophthalma 是较老的甲壳动物分类术语，常与“Edrioophthalma（无柄眼/眼不在柄上）”对比。现代系统分类多改用更精细、可证实的系统关系（如十足目 Decapoda 等），因此 Podophthalma 多用于历史语境或说明性讨论。"]}
{"word":"podophthalmata","summary":{"en":"Podophthalmata is a historical zoological term for crustaceans with stalked eyes, now largely obsolete.","zh":"Podophthalmata 是旧时指“具柄眼”甲壳动物的动物学术语，如今多已不用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, historical) A former group of crustaceans with stalked (pedunculated) eyes, such as crabs, lobsters, and shrimp; now considered an outdated classification.","zh":"（动物学，历史用语）旧时对“具柄眼”的甲壳动物的一类统称，如螃蟹、龙虾、虾等；现多被视为过时的分类。"},"examples":[{"en":"Older zoology books sometimes place crabs and lobsters under Podophthalmata.","zh":"较早的动物学书有时把螃蟹和龙虾归入 Podophthalmata。"},{"en":"Podophthalmata is rarely used in modern taxonomy because classifications have changed.","zh":"由于分类体系更新，Podophthalmata 在现代分类学中很少使用。"}]}],"synonyms":["stalk-eyed crustaceans","pedunculate-eyed crustaceans","(modern context) decapod crustaceans"],"phonetic":"/ˌpoʊdɑfˈθælmətə/","extraExplanation":["这个词来自希腊语词根：podo-（脚）+ ophthalmos（眼睛），字面意思接近“长在柄/突起上的眼”。它强调的是“复眼长在可活动的眼柄上”这一外形特征。","在19世纪及更早的分类体系里，人们常用显著外形特征来分大类，因此出现了 Podophthalmata 这类名称。后来随着解剖学与系统发育（亲缘关系）研究发展，很多“按外形凑在一起”的旧类群被拆分或改用更严格的分类单元，因此该词多见于历史文献或旧教材。","阅读旧文献时，可把 Podophthalmata 大致理解为“多数十足目等具柄眼的甲壳类”，但在现代语境中更常直接说 decapod crustaceans（十足目甲壳类）等。"]}
{"word":"podophthalmate","summary":{"en":"Podophthalmate means “having stalked eyes,” especially used for certain crustaceans in older zoological classification.","zh":"podophthalmate 指“具柄眼的”，多用于旧式动物学分类中描述某些甲壳类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology, of a crustacean) Having eyes on stalks (eye-stalks), rather than eyes that are fixed directly to the head.","zh":"（动物学，指甲壳类）具“柄眼”的；眼睛长在可活动的眼柄上，而不是直接固定在头部。"},"examples":[{"en":"Many crabs are podophthalmate, with eyes that sit on long, movable stalks.","zh":"许多螃蟹是具柄眼的，眼睛长在又长又可活动的眼柄上。"},{"en":"In older classifications, podophthalmate crustaceans were contrasted with groups whose eyes are not stalked.","zh":"在较早的分类体系中，具柄眼的甲壳类常与“非柄眼”的类群相对比。"}]},{"partOfSpeech":"n.","definition":{"en":"A crustacean (especially in older taxonomy) characterized by having stalked eyes.","zh":"（尤用于旧分类）具柄眼特征的甲壳动物。"},"examples":[{"en":"The term podophthalmate is now mostly found in historical zoological writing.","zh":"“podophthalmate”这个词现在多见于历史性的动物学著作中。"}]}],"synonyms":["stalk-eyed","eyestalked"],"phonetic":"/ˌpoʊdɑfˈθælmeɪt/","extraExplanation":["词源：来自希腊语词根 pod-/podo-（“足、脚”）与 ophthalm-（“眼”）。这里的“podo-”并非指“眼长在脚上”，而是强调“眼有柄、像伸出的附肢一样”。","使用提示：这是偏学术、且带有“旧式分类”色彩的词。现代生物学更常直接说 stalk-eyed（具柄眼的）或用更具体的类群名称（如某些十足目甲壳类）。"]}
{"word":"podophthalmatous","summary":{"en":"Podophthalmatous describes animals (especially crustaceans) that have stalked eyes.","zh":"podophthalmatous 指（尤指甲壳类）具有柄眼、眼睛长在眼柄上的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having eyes on stalks (especially of some crustaceans, such as crabs and shrimps).","zh":"（动物学）具“柄眼”的；眼睛长在可活动的眼柄上（尤指一些甲壳类动物，如螃蟹、虾等）。"},"examples":[{"en":"Many crabs are podophthalmatous, with eyes set on movable stalks.","zh":"许多螃蟹是具柄眼的，眼睛长在可活动的眼柄上。"},{"en":"The textbook described the shrimp as podophthalmatous, which helps it scan for danger.","zh":"教材把这种虾描述为具柄眼的，这有助于它观察周围的危险。"}]}],"synonyms":["stalk-eyed","eyestalked"],"phonetic":"/ˌpɑːdoʊfˈθælmətəs/","extraExplanation":["这是一个偏“学术/分类学”用词，日常英语很少用。更常见的表达是：stalk-eyed（柄眼的）。","词源可拆解理解：podo-（足/柄）+ ophthalmo-（眼）+ -ous（……的）。这里的“podo-”在该词中可理解为“像足一样的柄/支撑”，指眼柄。"]}
{"word":"podophthalmia","summary":{"en":"Podophthalmia means having eyes on stalks, and it also appears as an older crustacean classification term.","zh":"podophthalmia 指“柄眼”这种特征（眼长在眼柄上），也可指旧时以柄眼为特征的甲壳动物类群名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, rare) The condition of having eyes on stalks (stalk-eyed).","zh":"（动物学，罕见）“柄眼”的状态；眼睛长在可伸出的眼柄上。"},"examples":[{"en":"Many crabs and lobsters show podophthalmia, with eyes held on movable stalks.","zh":"许多螃蟹和龙虾都有 podophthalmia（柄眼特征），眼睛长在可活动的眼柄上。"},{"en":"The researcher noted podophthalmia as an adaptation for seeing above sand or water.","zh":"研究者指出，podophthalmia 是一种适应方式，便于把视线伸到沙面或水面之上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Older classification) A former group of crustaceans characterized by stalked eyes.","zh":"（旧分类法）旧时用于指一类以“柄眼”为特征的甲壳动物类群。"},"examples":[{"en":"In older textbooks, some decapod crustaceans were placed under “Podophthalmia.”","zh":"在较旧的教材里，一些十足目甲壳动物曾被归入“Podophthalmia”。"}]}],"synonyms":["stalk-eyed condition","stalk-eyedness"],"phonetic":"/ˌpoʊ.doʊfˈθæl.mi.ə/","extraExplanation":["词源可拆为：podo-（“足/柄”，这里指“像柄一样的结构”）+ ophthalm-（“眼”）+ -ia（名词后缀，表示“状态/情况”）。因此字面意思接近“柄状的眼”。","现代生物分类中，“Podophthalmia”多被视为历史术语；现在更常用更具体的分类名称（如十足目 Decapoda 等）或直接说 stalk-eyed（柄眼的）。"]}
{"word":"podophthalmian","summary":{"en":"Podophthalmian describes (or, in older usage, refers to) crustaceans that have eyes on movable stalks, like crabs and lobsters.","zh":"Podophthalmian 用来描述（或在较旧用法中指代）眼睛长在可活动眼柄上的甲壳类动物，如螃蟹和龙虾。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of some crustaceans, such as crabs and lobsters) having eyes on movable stalks.","zh":"（指某些甲壳类动物，如螃蟹、龙虾）眼睛长在可活动的眼柄上。"},"examples":[{"en":"Crabs are podophthalmian animals, with eyes set on stalks that can swivel.","zh":"螃蟹属于 podophthalmian（眼柄目）动物，眼睛长在能转动的眼柄上。"},{"en":"The researcher compared podophthalmian species to those with fixed eyes to study vision.","zh":"研究人员比较了 podophthalmian 物种与眼睛固定的物种，以研究视觉差异。"}]},{"partOfSpeech":"n.","definition":{"en":"A crustacean with stalked eyes (an older zoological classification term).","zh":"眼睛具眼柄的甲壳类动物（较旧的动物学分类用语）。"},"examples":[{"en":"In older texts, many crabs and lobsters were grouped as podophthalmians.","zh":"在较早的文献中，许多螃蟹和龙虾被归为 podophthalmians（眼柄类）。"}]}],"synonyms":["stalk-eyed","stalk-eyed crustacean"],"phonetic":"/ˌpoʊdoʊfˈθælmiən/","extraExplanation":["词源上可拆为：podo-（脚）+ ophthalm-（眼）+ -ian（……的/……类的），整体表达“（眼）长在像脚一样的柄上”，也就是“眼柄”。","这是偏古典/学术的术语，在现代生物学写作中更常用更具体的分类或描述（例如直接说“stalked eyes（有眼柄的眼睛）”）。"]}
{"word":"podophthalmic","summary":{"en":"Podophthalmic describes animals (especially crustaceans) that have stalked eyes.","zh":"podophthalmic 指（尤指甲壳类）具有柄眼、眼睛长在眼柄上的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having eyes on stalks (projecting from the head), as in some crustaceans.","zh":"（尤指某些甲壳类）具“柄眼”的；眼睛长在可伸出的眼柄上的。"},"examples":[{"en":"Crabs are podophthalmic animals, with eyes mounted on movable stalks.","zh":"螃蟹是具柄眼的动物，它们的眼睛长在可活动的眼柄上。"},{"en":"The paper compares podophthalmic crustaceans with species that have sessile (non-stalked) eyes.","zh":"这篇论文把具柄眼的甲壳类与眼睛不在眼柄上的（固着眼）物种作比较。"}]}],"synonyms":["podophthalmous","stalk-eyed"],"phonetic":"/ˌpoʊdoʊfˈθælmɪk/","extraExplanation":["这是一个较少见的生物学/动物学术语，常见于描述甲壳类（如蟹、虾）形态结构的学术写作中。","词源可拆解理解：podo- 来自希腊语，表示“足/柄（stalk）”；-ophthalm- 表示“眼”（如 ophthalmology 眼科）；-ic 表示“……的”。整体意思就是“有柄的眼睛”。","近义相关形式：podophthalmous（更常见的形容词形式）；反义概念常用 sessile-eyed（固着眼的、无眼柄的）。"]}
{"word":"podophthalmite","summary":{"en":"A rare zoological word meaning a stalk‑eyed crustacean (often in older classifications).","zh":"一个较少见的动物学词，指“柄眼的甲壳动物”，多用于旧式分类语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, uncommon) A stalk‑eyed crustacean; an animal formerly classified in the group Podophthalmia (e.g., many crabs, lobsters, and shrimps).","zh":"（动物学，不常用）柄眼类甲壳动物；旧分类中称为“柄眼亚纲/柄眼类（Podophthalmia）”的一员（如许多螃蟹、龙虾、虾等）。"},"examples":[{"en":"Some older zoology books use “podophthalmite” for decapod crustaceans with eyes on stalks.","zh":"一些较早的动物学书籍会用“podophthalmite”来指眼睛长在柄上的十足目甲壳动物。"},{"en":"The crab is a classic example of a podophthalmite in historical classifications.","zh":"在旧式分类里，螃蟹常被视为典型的 podophthalmite（柄眼类）。"}]}],"synonyms":["stalk-eyed crustacean","decapod (in many contexts)"],"phonetic":"/ˌpɑdoʊfˈθælmaɪt/","extraExplanation":["该词来自希腊语词根：podo-（脚）+ ophthalm-（眼）。这里的“脚/柄”指的是眼柄（stalk），不是“脚上长眼”。","“Podophthalmia/Podophthalmata”属于较旧的分类用语：现代生物分类更常用更细的类群（如十足目 Decapoda 等），因此 podophthalmite 多见于旧文献或历史讨论。"]}
{"word":"podophthalmitic","summary":{"en":"A rare scientific adjective meaning “having or relating to stalked eyes,” especially in crustaceans.","zh":"一个少见的科学形容词，指“眼睛长在眼柄上或与此相关”，尤用于甲壳类等动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to animals (especially certain crustaceans) that have eyes on stalks; belonging to the group Podophthalmitic/Podophthalmia.","zh":"（尤指某些甲壳类）与“柄眼类”有关的；指眼睛长在眼柄上的动物（或其类群）的。"},"examples":[{"en":"Many crabs and lobsters are described as podophthalmitic because their eyes sit on movable stalks.","zh":"许多螃蟹和龙虾被描述为 podophthalmitic，因为它们的眼睛长在可活动的眼柄上。"},{"en":"The specimen’s podophthalmitic features help distinguish it from groups with sessile (non-stalked) eyes.","zh":"该标本的 podophthalmitic 特征有助于把它与“无柄眼”（眼不在眼柄上）的类群区分开。"}]}],"synonyms":["podophthalmic","stalk-eyed","eyestalked"],"phonetic":"/ˌpɑˌdoʊfθælˈmɪtɪk/","extraExplanation":["这是一个很少在日常英语中出现的科学用词，多见于动物学/分类学文献。","词源可拆为 podo-（来自希腊语，意为“足/柄”）+ ophthalm-（“眼”）+ -itic（形容词后缀），整体表达“有眼柄的/与柄眼有关的”。","现代资料中更常见的拼写是 podophthalmic；podophthalmitic 属于较旧或更专业的变体。"]}
{"word":"podophthalmous","summary":{"en":"Podophthalmous describes animals whose eyes are borne on stalks (eyestalks).","zh":"podophthalmous 指“柄眼的”：眼睛长在眼柄上的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having eyes on stalks (eyestalks), as in many crabs and some snails.","zh":"（动物学）具“柄眼”的；眼睛长在可伸出的眼柄上（常见于许多螃蟹及部分蜗牛等）。"},"examples":[{"en":"Many crabs are podophthalmous, with eyes that extend on movable stalks.","zh":"许多螃蟹是柄眼的，眼睛长在可活动的眼柄上。"},{"en":"The podophthalmous shrimp could raise its eyestalks to scan for danger.","zh":"这只柄眼虾可以抬起眼柄来观察是否有危险。"}]}],"synonyms":["stalk-eyed","having eyes on stalks"],"phonetic":"/ˌpoʊdoʊfˈθælməs/","extraExplanation":["词源可拆解理解：podo-（足、柄）+ ophthalm-（眼）+ -ous（形容词后缀），整体强调“眼睛像长在柄/支架上”。","这是较少见的专业词，多用于动物学描述；日常英语更常说：eyes on stalks / stalk-eyed。"]}
{"word":"podophyllaceae","summary":{"en":"Podophyllaceae is a plant family that includes mayapple and related plants, noted for medically important compounds.","zh":"Podophyllaceae 指一个植物科，包括鬼臼（mayapple）等相关植物，以含有重要药用成分而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of flowering plants that includes mayapple (Podophyllum) and related genera, known for resinous compounds used in medicine","zh":"小檗叶科（也称“鬼臼科/鬼臼属相关植物科”）：一类被子植物的科，包括鬼臼（mayapple，Podophyllum）等属，含有可用于药物的树脂性化合物"},"examples":[{"en":"Podophyllaceae includes the mayapple, a woodland plant found in parts of North America.","zh":"小檗叶科包括鬼臼（mayapple），这是一种在北美部分地区的林地植物。"},{"en":"Researchers study plants in Podophyllaceae because some contain compounds used to make anti-cancer medicines.","zh":"研究人员研究小檗叶科植物，因为其中一些含有可用于制备抗癌药物的化合物。"}]}],"synonyms":["the mayapple family","podophyllum family (informal)"],"phonetic":"/ˌpɑːdoʊˌfɪlˈeɪsiˌiː/","extraExplanation":["这是一个植物分类学名词，常见于植物学、药学与自然史写作中。词尾 -aceae 表示“某某科”（植物科名的标准后缀）。","与该科相关的化合物常见于“鬼臼毒素（podophyllotoxin）”的研究与应用；但植物本身可能有毒，日常语境中一般不用于食用或民间自行用药。"]}
{"word":"podophyllic","summary":{"en":"Podophyllic describes a rare, often informal idea of being foot-loving or having a strong interest in feet.","zh":"Podophyllic 是个较罕见的形容词，用来表示“恋足/偏好足部、对脚很感兴趣”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having a strong interest in, attraction to, or preference for feet.","zh":"（罕见）对脚（足部）有强烈兴趣、吸引或偏好（常用于描述“恋足”倾向）。"},"examples":[{"en":"In the novel, the villain is portrayed as oddly podophyllic, collecting shoes as trophies.","zh":"在小说里，反派被塑造成有点“恋足”，把鞋子当作战利品收藏。"},{"en":"Some online communities use the word podophyllic to describe foot-focused content.","zh":"一些网络社群会用 podophyllic 来形容以脚部为主题的内容。"}]}],"synonyms":["podophilic","foot-loving","foot-focused"],"phonetic":"/ˌpoʊdəˈfɪlɪk/","extraExplanation":["这个词非常少见，更常见的表达是 foot-loving（口语、较轻松）或与医学/心理语境相关的 foot fetish（更直接但可能更敏感）。在正式写作中，如需避免性暗示，可以用 “an interest in feet / a focus on feet”（对足部的兴趣/关注）来更中性地表述。","词源上可拆解为：podo-（来自希腊语，表示“足/脚”）+ -philic（表示“喜爱/偏好”）。拼写上也有人写作 podophilic。"]}
{"word":"podophyllin","summary":{"en":"Podophyllin is a medicinal resin from the mayapple plant, mainly used topically to treat warts, but it can be toxic if misused.","zh":"Podophyllin（鬼臼脂）是从鬼臼/北美鬼臼提取的药用树脂，主要外用治疗疣等病变，但误用可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a resin extracted from the plant mayapple (podophyllum), used in medicine—especially on the skin to treat genital warts and some other growths (it can be toxic if misused).","zh":"鬼臼脂：从鬼臼（如北美鬼臼，mayapple）中提取的树脂，用于医疗；常作外用药治疗尖锐湿疣等皮肤赘生物（使用不当可能有毒）。"},"examples":[{"en":"The doctor prescribed a podophyllin treatment for the warts.","zh":"医生开了鬼臼脂来治疗疣。"},{"en":"Podophyllin should only be used exactly as directed because it can be harmful.","zh":"鬼臼脂必须严格按医嘱使用，因为可能有害。"}]}],"synonyms":["podophyllum resin","podophyllin resin"],"phonetic":"/ˌpɑːdəˈfɪlɪn/","extraExplanation":["词源提示：podophyllin 来自植物学名称 Podophyllum（“鬼臼属”），指从该植物中获得的药用树脂。","使用背景：在现代临床中，更常见的是其成分或衍生物（如 podophyllotoxin）在医生指导下使用；podophyllin 本身因潜在毒性与刺激性，使用上更谨慎。","文化/阅读提示：在较旧的英文医学或草药文献里，podophyllin 也可能被提到作为“强力泻剂/通便药”，但这种用途如今已较少见。"]}
{"word":"podophyllotoxin","summary":{"en":"Podophyllotoxin is a toxic plant-derived compound used mainly in controlled topical medicines (e.g., for genital warts) and as a precursor for some cancer drugs.","zh":"鬼臼毒素是一种来源于植物的有毒化合物，主要用于受控的外用药（如治疗生殖器疣），并可作为某些抗癌药物的原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic natural chemical found in the mayapple plant (and some related plants), used in medicine—especially in small, controlled amounts—to treat certain skin growths such as genital warts; it is also a starting material for some anti-cancer drugs.","zh":"一种有毒的天然化学物质，主要存在于北美鬼臼（mayapple）等植物中；在医学上以小剂量、严格控制的方式使用，常用于治疗某些皮肤赘生物（如生殖器疣）；也可作为某些抗癌药物的原料。"},"examples":[{"en":"The doctor prescribed a topical treatment containing podophyllotoxin for the warts.","zh":"医生开了含有鬼臼毒素的外用药来治疗疣。"},{"en":"Podophyllotoxin is effective, but it must be used carefully because it can irritate healthy skin.","zh":"鬼臼毒素有效，但必须小心使用，因为它可能刺激健康皮肤。"},{"en":"In pharmaceutical research, podophyllotoxin has been used to develop related anti-cancer medicines.","zh":"在药物研究中，鬼臼毒素曾被用于开发相关的抗癌药物。"}]}],"synonyms":["podofilox (U.S. name in some products)","podophyllotoxine"],"phonetic":"/ˌpɑːdəˌfɪləˈtɑːksɪn/","extraExplanation":["“podophyllotoxin”属于医学/药学词汇，日常英语里不常见，多出现在处方说明、医学论文或药品成分表中。","它是“有毒性”的活性成分：常见用法是外用（topical），并且需要严格按医嘱使用，避免大面积涂抹、误入口或用于破损皮肤。","相关词：mayapple（北美鬼臼，一种植物）；podophyllin（鬼臼树脂，含多种成分，临床使用与安全性要求不同）；etoposide（依托泊苷，一种抗癌药，与该成分有化学来源关系）。"]}
{"word":"podophyllous","summary":{"en":"A rare adjective meaning “related to Podophyllum (mayapple) or derived from it,” often in botany or medicine.","zh":"一个较少见的形容词，指“与鬼臼属（美洲鬼臼）有关或由其提取而来”，多见于植物学或医药语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/medicine) Related to the plant genus *Podophyllum* (mayapple) or made from it, especially referring to substances such as podophyllin/podophyllotoxin used in medicine.","zh":"（植物/医药）与*Podophyllum*（鬼臼/美洲鬼臼，mayapple）这种植物有关的；或由其制成的，尤指含有鬼臼毒素（podophyllotoxin）等用于药物的成分。"},"examples":[{"en":"Researchers tested a podophyllous extract for its antiviral and anticancer properties.","zh":"研究人员测试了一种鬼臼属植物提取物的抗病毒和抗癌特性。"},{"en":"Podophyllous compounds such as podophyllotoxin have been used in some wart treatments.","zh":"像鬼臼毒素这类源自鬼臼属植物的化合物，曾用于某些疣的治疗。"}]}],"synonyms":["Podophyllum-related","mayapple-derived","containing podophyllotoxin"],"phonetic":"/ˌpɑːdoʊˈfɪləs/","extraExplanation":["这个词非常少见，常见于学术写作（植物学、药学）。更常见的表达是“podophyllum (mayapple)-derived（源自鬼臼属/美洲鬼臼的）”或直接说“containing podophyllotoxin（含鬼臼毒素的）”。","词源可拆为 *podo-*（脚）+ *-phyllous*（叶的）。鬼臼/美洲鬼臼的叶片形态醒目，名称与其“叶”的特征有关。"]}
{"word":"podophyllum","summary":{"en":"Podophyllum is a woodland plant (mayapple) and also the medicinal resin/extract taken from it.","zh":"Podophyllum 指鬼臼属植物（如五月苹果），也可指其药用树脂/提取物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woodland plant (genus *Podophyllum*), especially the American mayapple, known for its umbrella-like leaves and a medicinally important resin","zh":"鬼臼属植物（*Podophyllum*），尤指北美“五月苹果/美洲鬼臼”，叶片像小伞一样展开，并含有具有药用价值的树脂成分"},"examples":[{"en":"Podophyllum grows in shady forests and spreads slowly through underground stems.","zh":"鬼臼多生长在阴湿的林地里，并通过地下茎缓慢扩散。"},{"en":"The mayapple (*Podophyllum peltatum*) is a well-known species of podophyllum in North America.","zh":"五月苹果（*Podophyllum peltatum*）是北美很有名的一种鬼臼。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried resin/extract from *Podophyllum* plants (often called podophyllin), used in medicine as a source of compounds such as podophyllotoxin","zh":"从鬼臼植物中提取并干燥的树脂/提取物（常称 podophyllin，鬼臼毒素树脂），在医学上用于获取如鬼臼毒素等化合物"},"examples":[{"en":"In older medical texts, podophyllum is mentioned as a plant-based drug ingredient.","zh":"在较早的医学文献中，podophyllum 常被提到是一种植物来源的药物成分。"},{"en":"Modern treatments often use purified compounds derived from podophyllum rather than crude extracts.","zh":"现代治疗更常使用从鬼臼中提纯得到的成分，而不是粗提取物。"}]}],"synonyms":["mayapple","American mandrake"],"phonetic":"/ˌpɑːdəˈfɪləm/","extraExplanation":["词源：podophyllum 来自希腊语 podos（“脚”）+ phyllon（“叶”），指某些种的叶裂形状像“脚掌”。","学习提示：日常英语中更常见的名称是 mayapple（五月苹果）或 American mandrake（美洲曼德拉草，注意与欧洲 mandrake 不是同一种）。","安全提醒：鬼臼及其提取物具有毒性；相关药用只应在专业医疗指导下使用。"]}
{"word":"podos","summary":{"en":"“Podos” is mainly a Greek root meaning “foot,” seen in compounds (not a common standalone English word).","zh":"“podos”主要是表示“脚/足”的希腊语词根，用于构词（不是常见的独立英语单词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Greek root meaning “foot,” mostly seen inside English scientific words (not commonly used as a standalone English word).","zh":"表示“脚/足”的希腊语词根，多出现在英语的科学复合词中（本身很少作为独立英语单词使用）。"},"examples":[{"en":"In “octopus,” the idea is “eight-footed,” from Greek roots.","zh":"在“octopus（章鱼）”里，词源含义接近“八足的”，来自希腊语词根。"},{"en":"Words like “tripod” (three-legged stand) use the same foot/leg idea.","zh":"像“tripod（三脚架）”这样的词也用到同样的“脚/足/腿”的概念。"},{"en":"In biology, “pseudopod” means a “false foot,” a temporary limb-like projection.","zh":"在生物学中，“pseudopod（伪足）”指“假的脚”，是细胞暂时伸出的肢状突起。"}]},{"partOfSpeech":"other","definition":{"en":"Informal/incorrect variant: sometimes typed when someone means “pods” (small container-like units), especially in tech contexts.","zh":"非正式/不规范写法：有时是把“pods（小舱/小容器式单元）”误打成“podos”，尤其在科技语境中。"},"examples":[{"en":"In Kubernetes, the correct term is “pods,” not “podos.”","zh":"在 Kubernetes 里，正确术语是“pods”，不是“podos”。"}]}],"synonyms":["-pod","-pode","-pede"],"phonetic":"ˈpoʊdoʊs","extraExplanation":["“podos”来自希腊语属格（类似“of foot/feet”），常见于词源分析，而不是现代英语里独立使用的词。","相关常见词根/后缀：-pod（foot，如 tripod）、-pode（如 cephalopod 头足类）、-pede（如 centipede 蜈蚣，“百足”）。"]}
{"word":"podoscaph","summary":{"en":"Podoscaph is a very rare/old word meaning a shoe or foot-covering (literally “foot + boat-shaped”).","zh":"Podoscaph 是非常罕见/旧用的词，意为鞋或脚部覆盖物（字面为“脚 + 舟形”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/obsolete) A shoe or foot-covering; something shaped like a small “boat” for the foot.","zh":"（罕见/旧用）鞋子或脚部覆盖物；形状像“小船”的脚部器具/鞋。"},"examples":[{"en":"In older texts, *podoscaph* may refer to a simple shoe or foot covering.","zh":"在一些较旧的文本中，*podoscaph* 可能用来指一种简单的鞋或脚部覆盖物。"},{"en":"The museum label described the wooden footwear as a kind of podoscaph.","zh":"博物馆的说明牌把这种木制鞋类描述为一种 podoscaph。"}]}],"synonyms":["shoe","footwear","sandal","clog"],"phonetic":"/ˈpoʊdoʊskæf/","extraExplanation":["这个词非常罕见，现代英语里几乎不用；更常见的是前缀 podo-（脚）与词根 -scaph/-scaph-（小船、舟形）在医学/解剖学词汇中出现（如 *scaphoid* “舟骨/舟状骨”）。","如果你是在某篇文章、古籍、或扫描文本里看到 *podoscaph*，它也可能是拼写变体或误读（例如更常见的 *podoscope* 等）。如果你能提供原句，我可以更准确判断意思。"]}
{"word":"podoscapher","summary":{"en":"A very rare word meaning “a person who travels on foot; a pedestrian.”","zh":"一个极少见的词，意思是“徒步行走的人；行人/步行者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare/obsolete) A person who travels on foot; a walker; a pedestrian.\nExamples:\n• en: After losing his horse, he became a podoscapher for the rest of the journey. / zh: 失去马匹后，他在余下的旅程中只能步行。\n• en: The old travelogue praises the podoscapher who endures heat and rain. / zh: 那本旧游记称赞能忍受酷热与风雨的徒步旅行者。","zh":"（极少见/旧用）徒步行走的人；步行者；行人。\n例句：\n• 英：失去马匹后，他在余下的旅程中只能步行。/ 中：失去马匹后，他在余下的旅程中只能步行。\n• 英：那本旧游记称赞能忍受酷热与风雨的徒步旅行者。/ 中：那本旧游记称赞能忍受酷热与风雨的徒步旅行者。"},"examples":[{"en":"After losing his horse, he became a podoscapher for the rest of the journey.","zh":"失去马匹后，他在余下的旅程中只能步行。"},{"en":"The old travelogue praises the podoscapher who endures heat and rain.","zh":"那本旧游记称赞能忍受酷热与风雨的徒步旅行者。"}]}],"synonyms":["pedestrian","walker","foot traveler","hiker"],"phonetic":"/ˌpoʊdəˈskæfər/","extraExplanation":["这个词在现代英语里几乎不用，很多词典也不收录，常见写作与表达会用 pedestrian（行人/步行者）、walker（步行者）、hiker（徒步者）或 on foot（步行地）。","词形看起来像由希腊语词根 podo-（脚）+ -scaph-（“舟/船”的词根，见 scaphoid 等）拼合的“学术式造词”，可能出现在旧书、戏仿或特定作者的创作中；具体含义应以原文语境为准。"]}
{"word":"podoscopy","summary":{"en":"A medical exam of the soles of the feet, often using imprints, to assess foot structure and pressure.","zh":"对足底进行的医学检查（常用足底印迹），用于评估足部结构与受力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The examination of the soles of the feet (often by taking an imprint) to study foot shape, pressure points, or gait, especially for diagnosing foot problems or fitting orthotics.","zh":"足底检查／足底印迹检查：检查脚底（常通过取足底印迹）以了解足弓、受力点或步态，常用于诊断足部问题或制作矫形鞋垫。"},"examples":[{"en":"The podiatrist used podoscopy to see where my feet put the most pressure when I stand.","zh":"足病医生用足底印迹检查来观察我站立时脚底哪里承受压力最大。"},{"en":"Podoscopy can help decide what kind of arch support an orthotic should have.","zh":"足底检查可以帮助决定矫形鞋垫需要怎样的足弓支撑。"}]}],"synonyms":["plantar examination","footprint analysis","plantar imprint test"],"phonetic":"/ˌpoʊdəˈskɑpi/","extraExplanation":["词源上由希腊语前缀 podo-（脚）+ -scopy（观察、检查）构成，字面意思就是“观察脚（脚底）”。","常见于足病学（podiatry）、物理治疗、运动医学等语境；在日常英语中比较专业，普通对话里更常说 “foot exam” 或 “foot imprint/pressure test”。"]}
{"word":"podosomata","summary":{"en":"“Podosomata” is the plural form of “podosoma,” meaning the leg-bearing front body region in some mites/ticks.","zh":"podosomata 是 podosoma 的复数，指某些螨虫/蜱虫等节肢动物身体前部的“长脚体段/足体部”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The leg-bearing front region of the body in some small arthropods (especially mites and ticks); plural of podosoma.","zh":"（尤指螨虫与蜱虫的）身体前部、长脚的体段；podosoma 的复数。"},"examples":[{"en":"In some mites, the body can be described as a podosoma followed by an opisthosoma.","zh":"在某些螨类中，身体可描述为由 podosoma（足体部）与其后的 opisthosoma（后体部）组成。"},{"en":"Under the microscope, the podosomata are where the legs attach and move.","zh":"在显微镜下，podosomata 是腿部附着并活动的位置。"}]}],"synonyms":["leg-bearing body region","podosoma (singular)","prosoma (related term, context-dependent)"],"phonetic":"/ˌpoʊdoʊˈsoʊmətə/","extraExplanation":["该词多见于动物学/节肢动物形态学文献，属于较专业的术语，一般在讨论螨、蜱等微小节肢动物的身体分段时使用。","词源可拆为希腊语词根：podo-（“脚”）+ soma（“身体”）；-ata 是某些希腊/拉丁来源中性名词复数结尾，因此 podosomata 表示“多个足体部”。","有时会与更常见的分区术语混淆：在部分节肢动物（如蛛形纲）中，类似概念也可能用 prosoma（前体）来描述，但具体用词取决于研究对象与作者的分段体系。"]}
{"word":"podosomatous","summary":{"en":"A rare zoological adjective meaning “related to the podosoma (the leg-bearing front body region in some arthropods).”","zh":"一个较少见的动物学形容词，意为“与足躯（某些节肢动物前部、长足的躯体部分）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Relating to the podosoma—the front body region of some arthropods (such as mites and ticks) that bears the legs.","zh":"（动物学）与“足躯（podosoma）”有关的；指某些节肢动物（如螨、蜱）前部躯体、并长有足的那一段。"},"examples":[{"en":"In many mites, the podosomatous region carries the walking legs.","zh":"在许多螨类中，足躯（podosomatous）区域承载步行用的足。"},{"en":"The paper describes podosomatous plates and their role in protecting the body.","zh":"该论文描述了足躯相关的骨板（podosomatous plates）及其在保护身体方面的作用。"}]}],"synonyms":["podosomal","podosomatic"],"phonetic":"/ˌpoʊdoʊsoʊˈmeɪtəs/","extraExplanation":["“podosomatous”比较少见，主要出现在动物学/节肢动物形态学的学术语境中。词根可拆为：podo-（脚、足）+ somat-（身体）+ -ous（……的），整体含义就是“与长足的身体部分有关的”。","相关更常见的近形词是“podosomal”（与podosoma有关的），在现代论文里可能更常用。"]}
{"word":"podosperm","summary":{"en":"A rare botanical term meaning a seed with a distinct stalk-like base (“foot”).","zh":"一个少见的植物学术语，指带有明显柄状基部（像“脚”一样）的种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) a seed that is borne on a stalk or “foot” (a distinct little stem-like base).","zh":"（植物学）“具柄种子；有脚的种子”：指带有明显小柄/基部（像“脚”一样）的种子。"},"examples":[{"en":"In some botanical descriptions, a podosperm is contrasted with a seed that sits directly on the fruit wall.","zh":"在一些植物学描述中，podosperm 常用来对比“直接贴附在果壁上”的无柄种子。"},{"en":"The specimen was recorded as having podospermous seeds with a short basal stalk.","zh":"该标本被记录为具“podospermous（具柄的）”种子，基部有短小的柄。"}]}],"synonyms":["stalked seed","podospermous seed"],"phonetic":"/ˌpoʊdoʊˈspɝːm/","extraExplanation":["这个词非常少见，主要出现在较旧或较专业的植物形态学文献中。","词源可拆为希腊语 podo-（脚、足）+ sperm（种子），直观表达“带脚/带柄的种子”。","更常见的相关表达是 podospermous（形容词：具柄种子的）或用更通俗的说法 stalked seed（有柄的种子）。"]}
{"word":"podosphaera","summary":{"en":"Podosphaera is a genus of fungi known for causing powdery mildew on plants.","zh":"Podosphaera（白粉菌属）是一类会引起植物白粉病的真菌属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of fungi that causes powdery mildew on many plants (often seen as a white, powdery coating on leaves).","zh":"白粉菌属（真菌的一属），可引起多种植物的白粉病（叶片表面常见白色粉状霉层）。"},"examples":[{"en":"The cucumbers in the greenhouse were infected by Podosphaera, causing powdery mildew on the leaves.","zh":"温室里的黄瓜感染了白粉菌属真菌，叶片出现白粉病。"},{"en":"Farmers monitor Podosphaera outbreaks to protect crops like squash and melon.","zh":"农民会监测白粉菌属引起的暴发，以保护南瓜和甜瓜等作物。"}]}],"synonyms":["powdery mildew fungus","Erysiphales (order)"],"phonetic":"/ˌpoʊdoʊˈsfɪərə/","extraExplanation":["“Podosphaera”是拉丁化的生物分类名称（属名），写作首字母大写、常用斜体：*Podosphaera*。在农业与园艺语境里，它常与“powdery mildew（白粉病）”一起出现。","常见相关物种包括 *Podosphaera xanthii*（常见于葫芦科作物，如黄瓜、南瓜）与 *Podosphaera leucotricha*（常见于苹果白粉病）。不同地区与作物上优势种可能不同。","学习时可把它理解为“导致白粉病的一类真菌的属名”，比记忆单个物种名更实用。"]}
{"word":"podostemaceae","summary":{"en":"Podostemaceae: a family of tropical aquatic flowering plants that live attached to rocks in fast-flowing rivers.","zh":"Podostemaceae：一种主要生长在热带急流河道、附着岩石的水生开花植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of unusual aquatic flowering plants (riverweeds) that grow attached to rocks in fast-moving rivers and waterfalls, mainly in tropical regions","zh":"（植物）川苔草科／川苔草科植物：一类特殊的水生开花植物，常附着在急流河道或瀑布岩石上生长，主要分布于热带地区"},"examples":[{"en":"Podostemaceae are often found clinging to rocks in rapids where few other plants can survive.","zh":"川苔草科植物常附着在急流中的岩石上，在几乎没有其他植物能存活的环境里生长。"},{"en":"The researcher surveyed Podostemaceae communities in a tropical river during the dry season.","zh":"研究人员在旱季调查了热带河流中的川苔草科植物群落。"}]}],"synonyms":["riverweeds (common name)"],"phonetic":"/ˌpoʊdoʊstɛˈmeɪsi.i/","extraExplanation":["“Podostemaceae”是拉丁化的植物科名，常见英文俗名是“riverweeds（河草）”。这类植物对水流、光照与水位变化非常敏感，因此在生态与保育研究中很重要。","词源可拆解为希腊语成分：podo-（脚、足）+ stem-（茎），与其贴附在岩石表面的生长形态有关；但在实际形态上，它们往往与一般“茎叶分明”的植物很不一样。"]}
{"word":"podostemaceous","summary":{"en":"An adjective meaning “related to the riverweed family Podostemaceae.”","zh":"形容词：指“与川苔草科（Podostemaceae，河生附石水生开花植物）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Podostemaceae (riverweeds), aquatic flowering plants that often grow attached to rocks in fast-moving rivers and waterfalls, especially in tropical regions.","zh":"与川苔草科（Podostemaceae，常称“河生草/急流附石植物”）有关的；指一类常附着在急流河床岩石上生长的水生开花植物，多见于热带地区。"},"examples":[{"en":"Researchers recorded several podostemaceous species growing on rocks just below the falls.","zh":"研究人员记录到瀑布下方岩石上生长着多种川苔草科植物。"},{"en":"The survey focused on podostemaceous plants because they are sensitive to changes in river flow.","zh":"这次调查重点关注川苔草科植物，因为它们对河流水量变化非常敏感。"}]}],"synonyms":["Podostemaceae-related","riverweed (family) (contextual)"],"phonetic":"/ˌpoʊdoʊˌstɛˈmeɪʃəs/","extraExplanation":["“podostemaceous”来自植物科名 Podostemaceae（由希腊语词根组成：podo- ‘足/基部’ + stem- ‘茎’，可理解为“像足一样附着在基底的茎状结构”），常用于植物分类学与生态学文献。","这类植物常被称为“riverweeds（河生草）”，但它们不是真正的藻类或苔藓，而是被子植物（开花植物）。因为对清洁、含氧且流速大的水体依赖强，所以也常被用作河流健康状况的指示类群。"]}
{"word":"podostemad","summary":{"en":"“Podostemad” is not common English; it most likely refers (rarely, in botany) to a riverweed-family plant (Podostemaceae) or is a misspelling.","zh":"“podostemad”不是常见英语；多半是拼写问题，或（罕见、植物学中）指川苔草科（Podostemaceae）的植物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; it is likely a misspelling or a very specialized scientific term. If you meant a different word, please share the sentence or the correct spelling.","zh":"不是常见的现代英语单词；可能是拼写错误，或是非常专门的科学术语。如果你想查的是别的词，请提供例句或确认拼写。"},"examples":[{"en":"I couldn’t find “podostemad” in a general dictionary—could you show me where you saw it?","zh":"我在常见词典里找不到“podostemad”——你能告诉我你在哪儿看到的吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, botany) A plant belonging to the riverweed family (Podostemaceae), found attached to rocks in fast-flowing rivers.","zh":"（罕见，植物学）指“川苔草科/河草科”（Podostemaceae，常称 riverweeds）的一种植物，常附着在急流河道的岩石上生长。"},"examples":[{"en":"Some tropical rivers have many podostemads clinging to stones below waterfalls.","zh":"一些热带河流在瀑布下的石头上会长满许多川苔草科植物。"},{"en":"The researcher surveyed podostemads as indicators of clean, fast-flowing water.","zh":"研究者调查川苔草科植物，把它们当作清洁急流水域的指示物种。"}]}],"synonyms":["riverweed","podostemaceae plant"],"phonetic":"/ˌpoʊdoʊˈstiːmæd/","extraExplanation":["这个词在日常英语里几乎不用；更可能出现在旧式或小众的植物学写作中，用来泛指“Podostemaceae（川苔草科）的一员”。","如果你是在学术文本里看到的，建议同时核对更常见的写法：Podostemaceae（科名）或 riverweed(s)（俗名）。","构词上常见的词根提示：podo- 表“脚”，stem- 表“茎/柄”（用于科学词汇时常借自希腊语/拉丁语传统）。"]}
{"word":"podostemon","summary":{"en":"Podostemon is a scientific name for a genus of river plants that cling to rocks in fast-flowing water.","zh":"Podostemon 是一种学名，指一类生长在急流中、附着岩石的河川水生植物属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small aquatic flowering plants (family Podostemaceae) that grow attached to rocks in fast-moving rivers and streams; often called “riverweeds.”","zh":"水生开花植物的一个属（川苔草科 Podostemaceae），常附着在急流河川的岩石上生长；常被称为“河川草/河藻（riverweeds）”。"},"examples":[{"en":"Scientists surveyed Podostemon growing on rocks below the waterfall.","zh":"科学家调查了瀑布下方岩石上生长的 Podostemon。"},{"en":"When the river level dropped, patches of Podostemon were exposed along the rapids.","zh":"当河水水位下降时，急流处一片片 Podostemon 露了出来。"},{"en":"Some fish and insects use Podostemon as shelter in swift currents.","zh":"一些鱼类和昆虫会在湍急水流中利用 Podostemon 作为庇护。"}]}],"synonyms":["riverweed (general/common name)"],"phonetic":"/ˌpoʊ.doʊˈstiː.mən/","extraExplanation":["这是一个较少见的学术词，多用于植物学、生态学与环境调查报告中。因为它常生长在清澈、含氧高、流速快的河段，有时也会被用作河流生态与水质状况的参考（但不同地区与物种情况会有差异）。","词源上通常被解释为来自希腊语词根：podos-（“脚/足”）+ -stemon（“雄蕊/丝状结构”），用来描述这类植物贴附基质、形态细小的特征。"]}
{"word":"podostemonaceae","summary":{"en":"Podostemonaceae: the riverweed family—aquatic flowering plants that grow attached to rocks in fast rivers.","zh":"Podostemonaceae：川藻科（河藻科）——附着在急流岩石上生长的水生开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of unusual aquatic flowering plants (often called riverweeds) that attach to rocks in fast-flowing rivers and waterfalls, mainly in tropical and subtropical regions","zh":"（植物）川藻科：一类特殊的水生被子植物（常称“河藻/川藻、riverweeds”），多附着在急流、瀑布的岩石上生长，主要分布于热带和亚热带地区"},"examples":[{"en":"Podostemonaceae are often found clinging to rocks in rapids.","zh":"川藻科植物常见于急流处，紧贴岩石生长。"},{"en":"Researchers study Podostemonaceae to understand how flowering plants adapt to extreme river habitats.","zh":"研究者会研究川藻科，以了解开花植物如何适应极端的河流环境。"}]}],"synonyms":["riverweed family","riverweeds"],"phonetic":"/ˌpɑːdoʊstəˌmɛˈneɪsi.iː/","extraExplanation":["“Podostemonaceae”是拉丁化的植物科名，常用于学术写作与植物志中；日常英语里更常用通俗称呼“riverweed(s)”或“riverweed family”。","川藻科的形态很“反常规”：它们在急流中常呈扁平、苔状或藻状外观，容易让人误以为是藻类，但它们确实是开花植物。","由于依赖清洁且水流强的河段，很多川藻科物种对水电开发与水质变化非常敏感，保护学与生态研究中也会提到它们。"]}
{"word":"podostemonaceous","summary":{"en":"An adjective meaning “of or related to the riverweed family (Podostemaceae).”","zh":"形容词：指“川苔草科（Podostemaceae，河川草/riverweeds）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Podostemaceae (often called riverweeds), which includes unusual aquatic flowering plants that grow attached to rocks in fast-flowing rivers and waterfalls.","zh":"与川苔草科（Podostemaceae，常称“河川草/河川藻类状开花植物”）有关的；该科植物多为附着在急流河床岩石上的奇特水生开花植物。"},"examples":[{"en":"The survey recorded several podostemonaceous species growing on submerged rocks near the rapids.","zh":"调查记录到在急流附近被水淹没的岩石上生长着几种川苔草科植物。"},{"en":"Podostemonaceous plants are often indicators of clean, well-oxygenated running water.","zh":"川苔草科植物常被视为水质洁净、含氧充足的流水环境指示物种。"}]}],"synonyms":["Podostemaceae-related","riverweed (family)"],"phonetic":"/ˌpoʊdoʊˌstɛməˈneɪʃəs/","extraExplanation":["词源结构：Podostemaceae（川苔草科的学名）+ -ous（表示“……的/与……有关的”）→ podostemonaceous = “川苔草科的”。","使用场景：这个词主要出现在植物学、生态学与分类学论文或物种名录中，日常英语里很少用到。","背景小知识：川苔草科植物外形常呈“藻类/苔藓状”，但它们属于被子植物（会开花结籽），常适应急流环境并紧贴岩石生长。"]}
{"word":"podostomata","summary":{"en":"Podostomata is an outdated zoological taxon name once used for horseshoe crabs and certain extinct relatives.","zh":"Podostomata 是一个较旧的动物分类群名称，曾用于指鲎及其一些已灭绝的近缘类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A former grouping of chelicerate arthropods—especially horseshoe crabs and their extinct relatives (such as eurypterids)—treated as a taxonomic unit in some older classifications.","zh":"（动物学/分类学）一种旧式的分类群名称，主要用来把鲎（马蹄蟹）及其已灭绝的近缘类群（如海蝎/广义海蝎类）归为一组；在现代分类中较少使用或已被替代。"},"examples":[{"en":"Older zoology texts sometimes place horseshoe crabs in the Podostomata.","zh":"一些较早的动物学教材会把鲎归入 Podostomata。"},{"en":"In modern sources, Podostomata is usually replaced by more current group names.","zh":"在现代资料中，Podostomata 通常会被更新的类群名称所取代。"}]}],"synonyms":["(historical) Merostomata (overlapping usage)","Xiphosura (related, not identical)"],"phonetic":"/ˌpoʊdoʊˈstɑːmətə/","extraExplanation":["这是一个相对“历史性”的术语：在19—20世纪早期的一些分类体系中，学者会用 Podostomata 把鲎（Xiphosura）与某些已灭绝的相关类群（常见提法包括海蝎 Eurypterida）放在同一大组里。后来随着形态学与系统发育研究更新，这个名称在主流分类中逐渐不常用。","词形提示：-stomata 源自希腊语“嘴/口”（stoma）的复数形式，因此 Podostomata 形式上是复数名词；在英文中常被当作一个类群名称整体使用。"]}
{"word":"podostomatous","summary":{"en":"Podostomatous describes an animal whose mouth is positioned near the bases of its legs.","zh":"Podostomatous 指动物的口位于足（腿）基部附近。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having the mouth located close to the bases of the legs (feet), rather than clearly at the front of the head.","zh":"（动物学）口位于足（腿）基部附近的；口部靠近步足基部而非明显位于头部前端的。"},"examples":[{"en":"Some crustaceans are described as podostomatous because their mouth opening lies among the limb bases.","zh":"有些甲壳动物被描述为 podostomatous，因为它们的口开口位于附肢（足）基部之间。"},{"en":"In an anatomy lab, we compared a podostomatous body plan with species whose mouths face forward.","zh":"在解剖课上，我们把 podostomatous 的体型结构与口部朝前的物种作了比较。"}]}],"synonyms":["podostome","pedostomatous"],"phonetic":"/ˌpoʊdoʊˈstɑːmətəs/","extraExplanation":["这是一个非常罕见、偏学术的形容词，主要出现在动物分类学或形态学描述中，用来说明“口的位置”这一结构特征。","词源可拆解为：podo-（足）+ stoma（口）+ -ous（……的）。理解词根有助于你在阅读生物学资料时快速猜词义。"]}
{"word":"podotheca","summary":{"en":"Podotheca is a botanical genus name for certain Australian daisies (family Asteraceae).","zh":"Podotheca 是一个植物学属名，指澳大利亚菊科（Asteraceae）中的袋菊属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the daisy family (Asteraceae), native to Australia","zh":"（植物）袋菊属：菊科（Asteraceae）的一属开花植物，原产澳大利亚"},"examples":[{"en":"Podotheca is a small genus in the daisy family found in Australia.","zh":"Podotheca（袋菊属）是菊科中一个分布于澳大利亚的小属。"},{"en":"The field guide listed Podotheca among the native daisies of Western Australia.","zh":"这本野外手册把 Podotheca 列在西澳的本地菊科植物中。"}]}],"synonyms":["(no common everyday synonyms; related: genus name, Asteraceae)"],"phonetic":"/ˌpoʊdəˈθiːkə/","extraExplanation":["这是一个较少见的拉丁学名（属名），更多出现在植物分类学、植物志或野外识别手册中，而不是日常英语。","词源上可拆为希腊语词根：podo-（“脚/足”）+ -theca（“盒、囊、鞘”）。许多植物学名称用这类词根来描述形态特征，但具体指向的结构需参考该属的形态描述或原始命名文献。"]}
{"word":"podothecal","summary":{"en":"Podothecal means “related to a leg/foot sheath (podotheca),” used mainly in technical zoology/entomology contexts.","zh":"podothecal 指“与足/腿部的鞘状覆盖结构（podotheca）有关的”，主要见于动物学/昆虫学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the podotheca (a sheath or outer covering of an arthropod’s leg or “foot” structures), especially in technical zoology/entomology writing.","zh":"（多用于动物学/昆虫学等技术语境）与“podotheca（足/腿部结构的鞘状或外部覆盖层）”有关的；足鞘的。"},"examples":[{"en":"The paper describes podothecal structures on the mite’s legs under scanning electron microscopy.","zh":"论文用扫描电镜描述了螨类腿部的足鞘相关结构。"},{"en":"Podothecal features can help distinguish closely related species.","zh":"足鞘相关特征可用于区分亲缘关系很近的物种。"}]}],"synonyms":["podotheca-related","leg-sheath (descriptive)"],"phonetic":"/ˌpoʊdəˈθiːkəl/","extraExplanation":["词源提示：podo- 来自希腊语，表示“脚/足”；-theca 表示“鞘、盒、囊”。因此 podothecal 字面意思接近“足部的鞘（的）”。","使用场景：该词非常罕见，通常只在节肢动物（如昆虫、螨、甲壳类）解剖学或分类学文献中出现；一般英语交流中几乎不用。","写作注意：如果读者不是专业背景，常用更直观的表达替代，如 “leg sheath/covering（腿部的鞘/覆盖层）”。"]}
{"word":"podous","summary":{"en":"Podous means “having feet,” and is mainly used in rare or technical writing.","zh":"podous 意为“有脚的”，主要见于少见或专业写作中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having feet; footed.","zh":"（罕见，偏专业）有脚的；具足的。"},"examples":[{"en":"In some zoology texts, insects are described as podous animals.","zh":"在一些动物学文本中，昆虫被描述为“podous（有脚的）”动物。"},{"en":"The author contrasted podous creatures with animals that move without legs.","zh":"作者把有脚（podous）的生物与无腿移动的动物作了对比。"}]}],"synonyms":["footed","legged","pedal"],"phonetic":"/ˈpoʊdəs/","extraExplanation":["“podous”是非常少见的形容词，多见于旧式或专业（尤其动物学/生物学）语境。日常英语里通常用更常见的表达，如“having feet/legged/footed”。","词源来自希腊语：pous/pod- 表示“脚”。你也会在词根里见到它：podiatry（足病学）、podium（讲台，原意与“脚/足”相关）。"]}
{"word":"podozamites","summary":{"en":"Podozamites is a fossil plant genus known for long, strap-like leaves, common in Mesozoic deposits.","zh":"Podozamites 是一种以带状长叶为特征的化石植物属，常见于中生代地层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct seed plants (known mainly from fossils) with long, strap-shaped leaves, common in the Mesozoic era and often discussed in paleobotany and geology.","zh":"波多扎米特斯属（Podozamites）：一种已灭绝的种子植物属（主要依据化石认识），叶片细长呈带状，在中生代较常见，常见于古植物学与地质学研究中。"},"examples":[{"en":"Fossil leaves of Podozamites are often found in Mesozoic sedimentary rocks.","zh":"Podozamites 的叶化石常见于中生代的沉积岩中。"},{"en":"The paleobotanist compared Podozamites leaves with those of modern conifers to infer ancient climates.","zh":"古植物学家将 Podozamites 的叶片与现代针叶树作比较，以推测古气候。"}]}],"synonyms":["fossil plant genus","extinct seed plant"],"phonetic":"/ˌpoʊdoʊˈzeɪmaɪˌtiːz/","extraExplanation":["词源提示：Podozamites 来自希腊语元素，常被解释为 podo-（“脚/足”）+ Zamia（苏铁类植物名，用来类比叶形）+ -ites（常用于化石或矿物名称的后缀）。因此它常出现在化石分类与地层年代讨论中。","学习建议：它是专有名词（属名），写作时通常首字母大写；复数形式在学术语境中常与单数同形，或按拉丁化习惯使用（具体取决于文献风格）。"]}
{"word":"pods","summary":{"en":"Pods are usually seed cases (pea/bean pods), and by extension can mean a small group or a small capsule/container.","zh":"pods 通常指（豌豆/豆类等的）豆荚；引申也可指一小群（如海豚群）或一次用量的小胶囊/小包装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seed case of some plants (like peas or beans) that holds the seeds.","zh":"（植物的）荚；豆荚（如豌豆、豆类装种子的外壳）"},"examples":[{"en":"She grew peas, and the pods were ready to pick.","zh":"她种了豌豆，豆荚已经可以采摘了。"},{"en":"Open the pod and remove the beans.","zh":"把豆荚剥开，把豆子取出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A small group of people or animals that stays together; a cluster.","zh":"（人或动物的）一小群；群体；簇"},"examples":[{"en":"A pod of dolphins followed the boat.","zh":"一群海豚跟着船游。"},{"en":"They worked in a small pod to finish the project.","zh":"他们以一个小组（小团队）的形式完成了这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A small container or capsule holding something, often used for a single use (such as coffee or detergent).","zh":"（一次用量的）小胶囊；小包装（如咖啡胶囊、洗衣凝珠）"},"examples":[{"en":"I used a coffee pod for my espresso machine.","zh":"我用了一颗咖啡胶囊来做浓缩咖啡。"},{"en":"Keep detergent pods away from children.","zh":"把洗衣凝珠放在儿童够不到的地方。"}]},{"partOfSpeech":"v.","definition":{"en":"To divide into or form small groups; to package into pods (less common).","zh":"（较少用）分成小组；装入胶囊/小包"},"examples":[{"en":"The class podded into groups for discussion.","zh":"课堂分成小组进行讨论。"}]}],"synonyms":["seedpod","capsule","container","cluster","group"],"phonetic":"/pɑd/","extraExplanation":["“pod”在现代生活里很常见的延伸用法来自“胶囊/小单元”的概念：比如咖啡机的coffee pod、洗衣用detergent pod。也因此出现了很多比喻用法，如work pod（小团队/小单元工作组）。"]}
{"word":"podsnap","summary":{"en":"Podsnap is a Dickens character name, and by extension a term for smug, narrow-minded respectability that ignores unpleasant realities.","zh":"Podsnap原是狄更斯小说人物名，引申指自满狭隘、以“体面/道德确定感”回避不愉快现实的态度或人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually capitalized) A fictional character, Mr. Podsnap, in Charles Dickens’s novel *Our Mutual Friend* (1864–1865), known for smug respectability and narrow-minded, self-satisfied opinions.","zh":"（通常大写）狄更斯小说《我们共同的朋友》（1864–1865）中的虚构人物“波德斯纳普先生”（Mr. Podsnap），以自鸣得意的体面感、狭隘而自以为是的观点著称。"},"examples":[{"en":"In Dickens’s *Our Mutual Friend*, Mr. Podsnap represents a certain kind of proud, comfortable middle-class respectability.","zh":"在狄更斯的《我们共同的朋友》中，波德斯纳普先生象征一种自满而安逸的中产阶级“体面”。"},{"en":"Some critics use Podsnap as a shorthand for people who dismiss uncomfortable facts.","zh":"一些评论者用“Podsnap”来简指那些排斥令人不适的事实的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/critical, often lowercase) An attitude or person marked by smug complacency, moral certainty, and refusal to engage with unpleasant realities; narrow-minded respectability.","zh":"（文学/评论用语，常小写）指一种“波德斯纳普式”的态度或人：自满、自以为道德正确、拒绝面对不愉快现实的狭隘体面。"},"examples":[{"en":"The article criticizes the Podsnap of pretending that social problems don’t exist.","zh":"这篇文章批评那种“波德斯纳普式”的做法：假装社会问题不存在。"},{"en":"Her Podsnap certainty left no room for doubt or discussion.","zh":"她那种“波德斯纳普式”的笃定不容置疑，也不留讨论空间。"}]}],"synonyms":["smugness","complacency","self-satisfaction","narrow-mindedness","prudish respectability"],"phonetic":"/ˈpɑdˌsnæp/","extraExplanation":["“Podsnap”源自狄更斯笔下人物Mr. Podsnap。他的典型特征是：把“体面/正派”当作挡箭牌，遇到不舒服的话题就简单否认或一笔带过。因此在英语评论写作里，它常被用作一种文化批评的标签，指“自满的保守体面、道德优越感、拒绝看见现实”。","在维多利亚时代语境中，这个词常与“中产阶级的自我满足”和“回避社会阴暗面”联系在一起。如今也会被借用来形容任何时代的类似心态。"]}
{"word":"podsnappery","summary":{"en":"“Podsnappery” is a rare, playful, nonstandard noun for snappy but trivial talk or showy wit (sometimes about podcasts/pods).","zh":"“podsnappery”是罕见的玩笑式非标准名词，指机灵但琐碎的俏皮话/卖弄式言谈（有时指播客/pod相关的嘴炮闲聊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard, playful (often invented) word: talk, writing, or behavior that is “snappy” or showy, especially in a trivial or teasing way, sometimes used jokingly about podcast/pod-related chatter.","zh":"一个非标准、带玩笑性质的造词：指“机灵/犀利但有点浮夸或无关紧要”的言谈、文字或行为；有时也戏称与播客（podcast）/pod 相关的闲聊。"},"examples":[{"en":"Most of the comments were just podsnappery—quick jokes without much substance.","zh":"大多数评论都只是 podsnappery——一些没什么实质内容的快嘴玩笑。"},{"en":"We came for the news, not the podsnappery around the hosts’ drama.","zh":"我们是来看新闻的，不是来看主持人八卦周边的那些 podsnappery。"}]}],"synonyms":["snark","banter","wisecracks","flippancy","trivial chatter"],"phonetic":"/ˌpɑdˈsnæpəri/","extraExplanation":["这个词不常见，也很可能不在主流词典里，属于临时造词（nonce word）。通常可以从构词来猜：pod（舱/豆荚/“播客”简称）+ snap（快、俏皮、利落）+ -ery（表示“某种行为/风格/东西的集合”，如 trickery、snobbery）。","如果你是在某个特定作品、社区或文章里看到它，它的含义可能会更偏向该语境：例如更强调“播客圈的嘴炮/调侃”，或更泛指“卖弄机灵的俏皮话”。"]}
{"word":"podsol","summary":{"en":"Podsol is a leached, acidic soil typical of cool, wet conifer-forest regions.","zh":"podsol 指凉湿针叶林地区常见的、被强烈淋溶而酸性的灰化土（层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light-gray, acidic soil layer found under coniferous forests in cool, wet climates, formed when minerals and nutrients are leached (washed) downward.","zh":"灰白色、酸性的淋溶土层，常见于凉湿气候下的针叶林地区；由于矿物质与养分被雨水向下淋洗而形成。"},"examples":[{"en":"Podsol often forms beneath pine forests where heavy rainfall leaches nutrients from the topsoil.","zh":"在松林下常会形成灰化土，因为大量降雨会把表土中的养分淋洗走。"},{"en":"The farmers avoided the podsol areas because the soil was too acidic for many crops.","zh":"农民避开灰化土区域，因为土壤太酸，不适合许多作物。"}]}],"synonyms":["podzol","podzolic soil"],"phonetic":"/ˈpɑdˌsɔl/","extraExplanation":["“podsol”来自俄语词源，意思接近“像灰一样（ashy）”。它常与“podzol / podzolic”一起出现；在英式或土壤学写法中更常见“podzol”。","这种土壤的典型特征是上层呈浅灰色（被淋溶得很“干净”），而铁、铝等物质与有机质在更深处聚积，形成较深色的层。"]}
{"word":"podsolic","summary":{"en":"“Podsolic” means “related to podzol (acidic, leached forest soil).”","zh":"“podsolic”意为“与灰化土/漂灰土有关的（酸性、强淋溶的森林土壤）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to podzol or podzolic soil (a typically acidic, strongly leached soil often found under conifer forests in cool, moist climates).","zh":"与灰化土/漂灰土（podzol）有关的；指一种通常呈酸性、被强烈淋溶的土壤，多见于凉爽湿润气候下的针叶林地区。"},"examples":[{"en":"Podsolic soils are often acidic and low in nutrients near the surface.","zh":"灰化土通常呈酸性，表层养分较低。"},{"en":"The researchers mapped podsolic horizons in the forested watershed.","zh":"研究人员在该森林流域绘制了灰化土层（灰化层）的分布图。"}]}],"synonyms":["podzolic","podzolized","leached (soil)"],"phonetic":"/pɑdˈzɑlɪk/","extraExplanation":["“podsolic / podzolic”常见于土壤学与地理学写作，描述“灰化作用（podzolization）”形成的土壤特征：上层被雨水淋溶变浅色（常称E层），铁、铝和有机质向下迁移并在下层富集（B层）。","词形提示：podzol（灰化土）→ podzolic/podsolic（形容词）。两种拼写都可见，但在现代学术英语里“podzolic”更常用。"]}
{"word":"podsolization","summary":{"en":"Podsolization is the soil process where acidic water leaches materials from upper layers and accumulates them deeper, often producing a pale topsoil.","zh":"podsolization 指酸性水分淋洗表层并在下层富集物质的成土过程，常导致表土发白。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soil-forming process in which acidic water leaches minerals (especially iron, aluminum, and organic compounds) from the upper soil layers and deposits them deeper down, often creating a pale, ash-like top layer.","zh":"一种成土作用：酸性水分将矿物质（尤其是铁、铝及有机物）从表层土壤中淋洗出去，并在更深处沉积，常形成颜色较浅、似灰烬的表层。"},"examples":[{"en":"Podsolization is common in cool, wet climates under conifer forests.","zh":"灰化作用（podsolization）常见于寒冷潮湿、针叶林覆盖的地区。"},{"en":"In heavily podsolized soils, the top layer can look unusually pale.","zh":"在灰化作用强烈的土壤中，表层常显得异常发白。"}]}],"synonyms":["podzolization","podzolisation","podzolization process"],"phonetic":"/ˌpɑːd.səl.aɪˈzeɪ.ʃən/","extraExplanation":["“podsolization”也常拼作“podzolization”（更常见）。相关的土壤类型叫“podzol / spodosol”，中文常译为“灰化土/灰壤土”（不同教材译法略有差异）。","典型剖面常用土层符号表示为：浅色淋溶层（E层）之下出现富集层（B层，如Bs/Bh），这是灰化作用的常见“指纹”。","这种过程与强酸性、针叶林凋落物分解慢、以及降水大于蒸发导致的淋洗条件有关；因此在加拿大、北欧、俄罗斯等地较常见。"]}
{"word":"podsolize","summary":{"en":"Podsolize means for soil to develop into podsol, usually by strong leaching in cool, wet conditions.","zh":"Podsolize 指土壤在寒冷潮湿等条件下因强烈淋溶而发生灰化作用，逐渐形成灰化土。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to form podsol (a type of acidic, leached soil), or to cause soil to become podsol through leaching and chemical changes","zh":"形成灰化土（淋溶强、酸性较高的一类土壤），或使土壤发生灰化作用而变成灰化土"},"examples":[{"en":"In cool, wet climates, sandy soils may podsolize over time.","zh":"在寒冷潮湿的气候中，沙质土壤可能会随着时间发生灰化作用。"},{"en":"Acidic leaf litter can help podsolize the upper layers of soil in conifer forests.","zh":"针叶林中酸性的落叶层会促进土壤表层发生灰化作用。"}]}],"synonyms":["podsolise","leach (in soil context)","acidify (partly related)"],"phonetic":"/ˈpɑd.səˌlaɪz/","extraExplanation":["“podsolize”多用于土壤学/地理学语境，对应的过程叫“podsolization（灰化作用）”。典型特征是：表层土被雨水长期淋溶，铁、铝和有机质向下迁移，在下层形成富集层，而上层变得更浅色、更贫瘠、酸性更强。","词源上与“podsol（灰化土）”相关，podsol一词来自俄语，意为“灰烬之下”，指这类土壤常有一层灰白色、像灰烬一样的漂白层。"]}
{"word":"podsolized","summary":{"en":"Podsolized describes soil that has been leached by podzolization, often forming a pale upper layer and a darker accumulation layer below.","zh":"Podsolized 指经历灰化作用的土壤：上层被淋失变浅色，下层出现富集的较深色土层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of soil) changed by podzolization: minerals and nutrients have been leached from the upper layers, often leaving a pale, ash-like horizon and a darker layer below.","zh":"（土壤）发生灰化作用的；上层矿物质与养分被淋失，常形成灰白色的表层（灰化层），下方出现较深色的富集层。"},"examples":[{"en":"The forest floor sits on podsolized soil that is low in available nutrients.","zh":"森林地表覆盖在灰化土上，这种土壤可利用养分较低。"},{"en":"Podsolized horizons are common under coniferous forests in cool, wet climates.","zh":"在寒冷湿润气候下的针叶林中，灰化土层很常见。"},{"en":"Researchers compared podsolized and non-podsolized sites to measure carbon storage.","zh":"研究人员比较了灰化与未灰化的地点，以测量碳储量。"}]}],"synonyms":["podzolized","leached","podzolic"],"phonetic":"/ˈpɑd.səˌlaɪzd/","extraExplanation":["“podsolized”常见拼写变体是“podzolized”（更贴近词源中的“podzol/灰化土”）。两者意思相同，在不同国家/期刊中用法略有偏好。","灰化作用（podzolization）多发生在冷凉、湿润环境，常与针叶林或酸性凋落物有关：有机酸促进铁、铝及有机质向下迁移，造成上层“漂白”、下层“富集”。","在农业上，灰化土通常酸性较强、肥力偏低，常需要改良（如施石灰调酸、补充养分）才能提高作物表现。"]}
{"word":"podsolizing","summary":{"en":"“Podsolizing” means soil is developing into a podzol through strong leaching, common in cool, wet, acidic conditions.","zh":"“podsolizing”指土壤正在经历强烈淋溶并逐渐形成灰化土（podzol）的过程，常见于寒冷潮湿且偏酸的环境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Soil science) Undergoing the process of forming a podzol—soil development in which nutrients and dark organic material are leached (washed downward) from the upper layer, leaving a pale, ash-colored layer and concentrating iron/aluminum and organic matter deeper down.","zh":"（土壤学）正在发生“灰化/漂灰化（podzolization）”过程——上层土壤中的养分与深色有机物被淋溶（向下冲刷迁移），形成浅灰色的漂白层，并在更深处富集铁/铝及有机物。"},"examples":[{"en":"In cool, wet climates, sandy soils are often podsolizing under conifer forests.","zh":"在寒冷潮湿的气候里，针叶林下的砂质土壤常常正在发生灰化作用。"},{"en":"The soil profile shows a light, bleached layer, a sign that the site may be podsolizing.","zh":"土壤剖面出现浅色漂白层，说明该地可能正在灰化。"}]}],"synonyms":["podzolizing","undergoing podzolization","leaching (in soil context)"],"phonetic":"/pɑːdˈzɑːl.aɪ.zɪŋ/","extraExplanation":["“podsolizing”来自动词“podzolize”（使土壤发生灰化/漂灰化），与名词“podzol”（灰化土）同源。该术语常见于土壤学、林学与环境科学文献，日常英语中很少使用。","podzol一词源自俄语“podzól”（意为“像灰一样的”），对应灰化土典型的浅灰色表层（常称E层）。灰化作用多与酸性环境、针叶林凋落物、砂质母质、以及较强降水/淋溶有关。"]}
{"word":"podsols","summary":{"en":"Podsols are acidic, heavily leached soils typical of cool, wet forest regions.","zh":"Podsols 指酸性强、淋溶明显、常见于寒冷潮湿森林地带的灰化土。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soils (plural of podsol) that are typically acidic and strongly leached, often found under conifer forests in cool, wet climates, with a pale gray upper layer and a darker layer where minerals and organic matter accumulate.","zh":"（podsol 的复数）灰化土：通常呈酸性、淋溶作用很强的土壤，多见于寒冷潮湿地区的针叶林下层；表层常呈浅灰色，下层常有矿物与有机质聚积形成较深色土层。"},"examples":[{"en":"Podsols are common in northern forest regions with high rainfall.","zh":"在降雨量高的北方森林地区，灰化土很常见。"},{"en":"The farmer avoided planting crops in podsols because the soil was too acidic.","zh":"农民避免在灰化土上种作物，因为土壤酸性太强。"}]}],"synonyms":["podzols","spodosols (related term)"],"phonetic":"/ˈpɑdˌsɔlz/","extraExplanation":["“podsol”也常写作“podzol”。词源来自俄语：pod-（在……下面）+ zol(a)（灰），指表层被淋洗后呈“灰白色”的外观。","在土壤学中，podsols 往往对应美国土壤分类中的 Spodosols（意译常见为“淋溶土/灰化土”一类），但不同分类体系并非完全一一对应。"]}
{"word":"podtia","summary":{"en":"“podtia” is not a standard English word; it’s likely a misspelling or from another language.","zh":"“podtia”不是标准英语词；可能是拼写错误或外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is likely a misspelling or a word from another language.","zh":"这不是主流英语词典中的标准英语单词；更可能是拼写错误或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “podtia” in an English dictionary—did you mean “podium” or “podiatry”?","zh":"我在英语词典里找不到“podtia”——你是不是想写“podium（领奖台）”或“podiatry（足病学）”？"},{"en":"Can you share the full sentence where you saw “podtia”?","zh":"你能把看到“podtia”的完整句子发我吗？"}]}],"phonetic":"N/A","extraExplanation":["“podtia”看起来像是拼写误差。常见相近词：\n- podium /ˈpoʊdiəm/（领奖台、讲台）\n- podiatry /pəˈdaɪətri/（足病学，和脚部医疗有关）\n- podiatrist（足病医生）\n\n如果你提供出处（句子、截图、领域/国家），我可以更准确判断它原本应是什么词，或是否是某种专有名词/人名/地名。"]}
{"word":"podunk","summary":{"en":"“Podunk” means a small, unimportant (often rural) place, and can also describe something as small-town and unimpressive.","zh":"podunk 指“偏僻不起眼的小地方”，也可形容事物“很乡下/不够体面、没见过世面”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, unimportant, or boring town, especially in a rural area (often used humorously or a bit disrespectfully).","zh":"（常带幽默或轻微贬义）偏僻又不起眼的小镇/乡下地方。"},"examples":[{"en":"He grew up in a little podunk town where everyone knew everyone.","zh":"他在一个不起眼的小镇长大，那里人人都互相认识。"},{"en":"I’m tired of this podunk place—I want to move to a big city.","zh":"我受够了这个小地方——我想搬去大城市。"}]},{"partOfSpeech":"adj.","definition":{"en":"Small-town, unsophisticated, or provincial; not impressive.","zh":"小地方的；土气的；不够时髦/不够有水准的。"},"examples":[{"en":"They treated our ideas like some podunk project that didn’t matter.","zh":"他们把我们的想法当成不重要的“土气小项目”。"},{"en":"It’s a podunk little office, but the work is meaningful.","zh":"办公室很小、很普通，但工作很有意义。"}]}],"synonyms":["backwater","hick town","one-horse town","middle of nowhere","small-town"],"phonetic":"/poʊˈdʌŋk/","extraExplanation":["这个词在美国英语里比较口语化，语气常带吐槽或轻视，所以在正式场合、写作或对当地人当面使用时要谨慎。","词源常被认为与美国原住民语言地名有关（如 Podunk 河、部族名等），后来演变为“偏僻小地方”的泛称；也因此它带有文化与历史背景，使用时尽量避免把它当作对某个具体地区或族群的刻板印象。","常见搭配：a podunk town/place；podunk little + 名词（如 office、company、school），强调“又小又不起眼”。"]}
{"word":"podura","summary":{"en":"Podura is a less common (often historical) term for a springtail, a tiny jumping soil arthropod.","zh":"podura 多为较少见（常带历史色彩）的用法，指跳虫——一种能弹跳的微小土壤节肢动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a springtail (a tiny soil-dwelling arthropod that can jump), especially one formerly placed in the genus *Podura*; also used historically as a name for springtails in general","zh":"跳虫（生活在土壤等潮湿环境中的微小节肢动物，能弹跳）；尤指旧时归入 *Podura* 属的种类，也可作跳虫的旧称"},"examples":[{"en":"Under the microscope, the podura moved quickly across the damp leaf litter.","zh":"在显微镜下，这只跳虫（podura）在潮湿的落叶层上快速爬行。"},{"en":"Older biology books may use “podura” for what we now usually call a springtail.","zh":"较旧的生物学书籍里，可能会用“podura”来指我们现在通常说的“跳虫”。"}]}],"synonyms":["springtail","collembolan"],"phonetic":"/pəˈdʊrə/","extraExplanation":["“Podura”源自新拉丁语的生物分类命名，常见于较早的昆虫学/节肢动物学文献。现代分类中，“springtail/collembolan（跳虫/弹尾目动物）”更常用；“Podura”更多作为属名或历史用语出现。","跳虫并不是真正的昆虫（通常归入六足亚门中的弹尾目 Collembola），它们常见于土壤、腐殖质、潮湿的树皮或落叶中，是生态系统分解链的重要一环。"]}
{"word":"poduran","summary":{"en":"“poduran” isn’t a common English word; it’s likely a name or a misspelling.","zh":"“poduran”不是常见英语词；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name (a person/place/product) or a misspelling of another word.","zh":"不是标准英语单词。可能是专有名词（人名/地名/品牌等），或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “poduran” in a standard English dictionary—could you share the sentence where you saw it?","zh":"我在常见英语词典里找不到“poduran”，你能提供你看到它的句子吗？"},{"en":"Poduran might be a brand or a username rather than an English vocabulary word.","zh":"Poduran 可能是品牌名或用户名，而不是英语词汇。"}]}],"phonetic":"/poʊˈdʊræn/","extraExplanation":["“poduran”在主流英语词典中不常见，因此更可能是：\n1）专有名词（如人名、地名、公司/产品名、网名）；\n2）拼写误差。常见的相近拼写可能有：podium（讲台/领奖台）、panduran/Podoran（少见的姓氏拼写变体）等。\n如果你把它出现的上下文（整句或截图）发我，我可以更准确判断它的意思与词性。"]}
{"word":"podurid","summary":{"en":"Podurid means “related to the springtail family Poduridae” or “springtail-like.”","zh":"podurid 指“与长角跳虫科（Poduridae）有关的”或“像跳虫的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Relating to Poduridae (a family of tiny soil-dwelling springtails), or resembling a springtail (collembolan).","zh":"（动物学）与长角跳虫科（Poduridae，一类生活在土壤中的微小跳虫）有关的；或形似跳虫（弹尾目昆虫）的。"},"examples":[{"en":"Under the microscope, several podurid insects were visible in the damp leaf litter.","zh":"在显微镜下，可以在潮湿的落叶层里看到几只跳虫科（podurid）的昆虫。"},{"en":"The researcher recorded podurid activity as an indicator of healthy soil.","zh":"研究人员记录跳虫科（podurid）的活动，把它作为土壤健康的指标之一。"}]}],"synonyms":["springtail-related","collembolan","Poduridae-related"],"phonetic":"/pəˈdʊrɪd/","extraExplanation":["“podurid”是非常少见的专业词，常见于动物学、土壤生态学或昆虫学文章。一般日常英语更常用 springtail（跳虫）或 Collembola（弹尾目）。","词源上来自 Podura（早期用于指某些跳虫的属名）+ -id（表示“……类的/与……有关的”）。"]}
{"word":"poduridae","summary":{"en":"Poduridae is the scientific name of a family of springtails—tiny jumping arthropods found in soil and leaf litter.","zh":"Poduridae 是跳虫（弹尾目）中的一个“科”的学名，指一类生活在土壤与落叶层、能弹跳的微小节肢动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of very small, soil- and leaf-litter–dwelling arthropods called springtails (order Collembola), known for jumping by snapping a tail-like structure (the furcula).","zh":"弹尾目（Collembola，俗称“跳虫/弹尾虫”）中的一科小型节肢动物，多生活在土壤与落叶层中，可借由尾部的弹器（furcula）弹跳。"},"examples":[{"en":"Poduridae are often found in damp soil and under rotting leaves.","zh":"Poduridae（跳虫科）常见于潮湿土壤和腐烂落叶下。"},{"en":"Some Poduridae species help break down decaying plant material.","zh":"部分 Poduridae 物种能帮助分解腐烂的植物残体。"}]}],"synonyms":["springtail family","family Poduridae"],"phonetic":"/ˌpɑːdjʊˈrɪdiː/","extraExplanation":["这是一个生物分类学名词：词尾 -idae 表示“科”（family）。在英文科名中很常见，如 Felidae（猫科）、Hominidae（人科）。","Poduridae 这一科名来自属名 Podura；Podura 源自希腊语词根，常被解释为“foot（脚）+ tail（尾）”，与跳虫腹部可弹射的结构有关。不同分类系统中，该科的范围与归属可能会有调整，因此在不同资料里你可能看到略有差异的分类位置。"]}
{"word":"podware","summary":{"en":"Podware is an informal word for software related to podcasts (and sometimes portable media players).","zh":"Podware 是一个非正式词，指与播客相关的软件（有时也指便携式播放器相关软件）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) Software used to create, publish, manage, or listen to podcasts (for example, recording/editing tools or podcast apps).","zh":"（非正式）用于制作、发布、管理或收听播客的软件（如录音/剪辑工具或播客收听应用）。"},"examples":[{"en":"She uses podware to record and edit her weekly podcast.","zh":"她用播客软件录制并剪辑每周的播客。"},{"en":"Good podware can automatically download new episodes and organize your subscriptions.","zh":"好用的播客软件可以自动下载新节目并整理你的订阅。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Software designed for or bundled with a portable media player (especially iPod-era usage).","zh":"（较少见）为便携式媒体播放器设计或随其附带的软件（尤其常见于 iPod 流行时期的说法）。"},"examples":[{"en":"In the early 2000s, some companies marketed their iPod tools as podware.","zh":"在 2000 年代初期，有些公司把他们的 iPod 工具软件称为 podware。"}]}],"synonyms":["podcast app","podcast software","podcasting software","podcatcher"],"phonetic":"/ˈpɑdˌwɛr/","extraExplanation":["“podware”是“pod（播客/随身播放器）+ software”的混成词，语感偏口语和技术圈用法，并不是最标准的通用词。更常见的说法是“podcast app / podcast software / podcasting software”。"]}
{"word":"podzol","summary":{"en":"Podzol is an acidic, heavily leached soil common under conifer forests in cool, wet climates, often with a pale top layer.","zh":"Podzol（灰化土）是寒冷湿润地区针叶林下常见的一种酸性、强淋溶土壤，常见浅灰色表层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of soil that is acidic and strongly leached (washed), usually found under conifer forests in cool, wet regions; it often has a pale, ash-colored upper layer","zh":"灰化土；一种酸性强、淋溶（被雨水冲刷）明显的土壤，多见于寒冷湿润地区的针叶林下；常有浅灰、像灰烬一样的表层"},"examples":[{"en":"Podzol soils are common in northern forests where rainfall washes minerals downward.","zh":"在降雨会把矿物质向下冲刷的北方森林里，灰化土很常见。"},{"en":"The researcher collected samples from a podzol profile to study how nutrients move through the soil.","zh":"研究人员从一处灰化土剖面采集样本，用来研究养分如何在土壤中迁移。"}]}],"synonyms":["spodosol"],"phonetic":"/ˈpɑdˌzɔl/","extraExplanation":["“Podzol”来自俄语相关词根，含义接近“灰烬/灰色”，与这种土壤表层常呈浅灰色有关。","灰化土通常形成于酸性凋落物（如松针）和较多降水的环境：上层容易被淋洗变浅色，下层则更容易累积铁、铝以及有机质，形成颜色更深的层次。"]}
{"word":"podzolic","summary":{"en":"“Podzolic” describes soil that is like podzol—acidic, leached, and often found in cool, moist forest regions.","zh":"“podzolic”指与灰化土有关或具有灰化土特征的土壤：偏酸、淋溶强，常见于冷凉湿润的森林地区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or having the characteristics of podzol (a light-colored, acidic soil formed in cool, moist climates, often under coniferous forests).","zh":"（土壤）灰化土的；具有灰化土特征的（常见于寒冷湿润地区、针叶林下，土壤偏酸、淋溶明显）。"},"examples":[{"en":"Podzolic soils are often acidic and low in nutrients.","zh":"灰化土通常偏酸，养分含量较低。"},{"en":"The researchers mapped podzolic areas in the northern forest region.","zh":"研究人员绘制了北方森林地区的灰化土分布图。"}]}],"synonyms":["podzolized","podzolic soil-related","acid-leached (context-dependent)"],"phonetic":"/pɑdˈzɑlɪk/","extraExplanation":["“podzolic”来自“podzol / podsol”（灰化土），词源与俄语有关，原意与“灰/灰白色”相关，呼应这种土壤上层常呈浅灰色的外观。","在地理与环境科学语境中，它常与“leaching（淋溶）”“acidic（酸性）”“coniferous forest（针叶林）”“cool, moist climate（冷凉湿润气候）”一起出现，用来描述土壤形成过程与生态条件。"]}
{"word":"podzolization","summary":{"en":"Podzolization is a soil process where acids and water leach materials from upper layers, producing an acidic, pale-layered soil (podzol).","zh":"灰化作用是指酸与水将物质从上层土壤淋洗下移，形成酸性、带灰白层的灰化土（podzol）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the soil-forming process in which acids and water leach (wash out) minerals like iron, aluminum, and organic matter from upper soil layers, creating a pale, ash-like layer and often an acidic, nutrient-poor soil (podzol).","zh":"灰化作用；一种土壤形成过程：酸性物质与水把铁、铝及有机质等从上层土壤淋洗（带走），形成浅色、灰白状的淋溶层，并常导致酸性、贫瘠的灰化土（podzol）。"},"examples":[{"en":"Podzolization often happens in cool, wet climates under conifer forests.","zh":"灰化作用常发生在寒冷湿润的气候中，尤其是在针叶林下。"},{"en":"Because of podzolization, the topsoil can become acidic and less fertile for crops.","zh":"由于灰化作用，表土可能变得更酸、对农作物更不肥沃。"},{"en":"The soil profile showed a light-colored layer, a common sign of podzolization.","zh":"该土壤剖面出现浅色土层，这是灰化作用的常见迹象。"}]}],"synonyms":["podzolisation","podzol formation","soil leaching (related)"],"phonetic":"/ˌpɑd.zəl.əˈzeɪ.ʃən/","extraExplanation":["“podzolization”来自“podzol”（灰化土），词源与俄语相关，意为“像灰一样的土”，指剖面中常见的灰白色淋溶层（常写作 E 层）。","在地理与生态学中，它常与“针叶林/寒带森林（taiga）”“冷湿气候”“酸性凋落物（如松针）”等一起出现；与之相对的概念可联想到“淋溶（leaching）”和“土壤酸化（acidification）”。"]}
{"word":"podzolize","summary":{"en":"To cause soil to become podzol (or for soil to become podzolic) through leaching under acidic, often cold and wet conditions.","zh":"指在酸性、常见于寒冷湿润环境下因淋溶而使土壤形成灰化土（或土壤发生灰化作用、呈灰化土特征）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Soil science) To turn into podzol through strong leaching, typically under acidic conditions and coniferous or heath vegetation.","zh":"（土壤学）使（土壤）发生灰化作用，形成灰化土（podzol）；通常在酸性环境、针叶林或石南植被下因强烈淋溶而发生。"},"examples":[{"en":"Cold, wet climates can podzolize sandy soils over long periods of time.","zh":"寒冷潮湿的气候会在很长时间内使沙质土壤发生灰化作用。"},{"en":"Acidic leaf litter helps podzolize the upper soil layers.","zh":"酸性的落叶凋落物会促进表层土壤的灰化作用。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of soil) To undergo podzolization; to become podzolic.","zh":"（指土壤）发生灰化作用；变成灰化土特征的土壤。"},"examples":[{"en":"In this region, soils podzolize more quickly where drainage is strong.","zh":"在这个地区，排水性强的地方土壤更容易较快发生灰化作用。"}]}],"synonyms":["podsolize","podzolization (related noun)"],"phonetic":"/pɑdˈzɑːl.aɪz/","extraExplanation":["“podzolize”常见于地理学、土壤学与生态学写作，比日常英语更专业。它描述一种成土过程：有机酸与大量降水/融雪将铁、铝和腐殖质向下淋溶，常形成浅灰色的漂白层（E层）以及下部富集层（B层）。","拼写上也常见变体“podsolize”（英式/另一种转写）；两者含义相同。"]}
{"word":"podzolized","summary":{"en":"Podzolized describes soil that has been leached and reshaped by podzolization, often becoming pale in the upper layer.","zh":"Podzolized 指土壤经历灰化作用后被淋洗重塑，常使表层变浅发灰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of soil) changed by podzolization: minerals and nutrients have been leached from the upper layer and moved downward, often leaving a pale, ash-like top layer.","zh":"（指土壤）发生“灰化作用（podzolization）”而形成的：上层矿物质与养分被淋洗并向下迁移，常使表土呈灰白、似灰烬的颜色。"},"examples":[{"en":"Podzolized soils are common under conifer forests in cool, wet climates.","zh":"在寒冷、湿润气候下的针叶林中，灰化土（podzolized soils）很常见。"},{"en":"The podzolized horizon looked unusually pale compared with the darker layer below.","zh":"灰化层的颜色比下面较深的土层明显更浅。"}]}],"synonyms":["podzolic","leached","acid-leached"],"phonetic":"pɑdˈzɑlˌaɪzd","extraExplanation":["“Podzolized”来自“podzol”（灰化土）+ -ize（使……化）+ -ed（完成/具有……特征）。灰化作用多发生在酸性、降水多的环境：有机酸把铁、铝及部分有机质从表层带走，向下沉积，常形成典型的土层分化（上层偏灰白、下层偏深色或富集层）。这是地理、生态与土壤学里常见的描述词。"]}
{"word":"podzolizing","summary":{"en":"“Podzolizing” means the process of forming (or causing) podzol soil through strong leaching, usually in cool, wet, acidic environments.","zh":"“podzolizing”指土壤发生（或被促成发生）灰化作用，通过强烈淋溶形成灰化土，多见于寒冷、湿润、酸性的环境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to form or cause to form podzol (a pale, leached soil), typically through strong leaching in cool, wet, acidic conditions","zh":"（使）发生灰化作用；（使）形成灰化土（常见于寒冷湿润、酸性环境中因强烈淋溶而形成的浅色土壤）"},"examples":[{"en":"In conifer forests with heavy rainfall, the soil may be podzolizing quickly.","zh":"在降雨多的针叶林里，土壤可能会很快发生灰化作用。"},{"en":"Acidic litter and intense leaching are key factors podzolizing the upper soil layers.","zh":"酸性的枯落物和强烈的淋溶是促使表层土壤发生灰化作用的关键因素。"}]}],"synonyms":["podzolization (process)","leaching (related process)","soil acidification (related)"],"phonetic":"/pɑdˈzɑl.aɪzɪŋ/","extraExplanation":["“podzolizing”是动词“podzolize”的现在分词/动名词形式，常用于土壤学、生态学与环境科学写作中。","灰化作用（podzolization）通常会让表层土壤被“淋洗”得更浅色，而铁、铝和有机质更容易在下层聚积；因此这种土壤往往酸性较强、养分相对贫瘠，常见于寒冷或温带湿润地区的针叶林/石南植被下。","词源上，podzol 来自俄语，原意与“灰烬/灰色”有关，用来描述这种土壤典型的灰白色淋溶层（常写作 E 层）。"]}
{"word":"podzols","summary":{"en":"Podzols are acidic, strongly leached soils common in cool, wet forest regions (plural of podzol).","zh":"Podzols 指灰化土（podzol 的复数）：多见于寒冷湿润森林区、酸性且淋溶强的土壤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of soil (plural of podzol) that is typically acidic and strongly leached, with a pale, ash-like upper layer and a darker layer below where organic matter and minerals accumulate; common in cool, wet regions under conifer forests.","zh":"灰化土（podzol 的复数）：一种常呈酸性、淋溶作用强的土壤，上层常有浅灰似“灰烬”的漂白层，下层常为有机质与矿物质（如铁、铝）富集的较深色层；多见于寒冷湿润地区的针叶林下。"},"examples":[{"en":"Podzols are common in boreal forests, where heavy rainfall washes nutrients downward.","zh":"在北方针叶林中常见灰化土，因为降雨较多会把养分向下淋洗。"},{"en":"Because podzols are acidic, farmers often add lime to improve crop growth.","zh":"由于灰化土偏酸，农民常施用石灰来改良土壤、促进作物生长。"},{"en":"The field survey mapped podzols along the cooler, wetter slopes.","zh":"野外调查在较冷、较湿的山坡上绘制出了灰化土的分布。"}]}],"synonyms":["podzol soils","spodosols (U.S. soil classification)"],"phonetic":"/ˈpɑdˌzɔlz/","extraExplanation":["“podzol”来自俄语词源，意为“在灰烬之下”，指其典型剖面：表层常出现被淋溶漂白的浅灰层（看起来像灰），下层则富集有机质与铁、铝等形成较深色的层位。","在环境与地理学语境中，你可能会看到相关词：podzolization（灰化作用/灰化过程），以及与其对比的土壤类型如 chernozem（黑钙土/黑土）。"]}

