{"word":"Poe","summary":{"en":"“Poe” most commonly refers to Edgar Allan Poe, a major American writer known for gothic horror and mystery.","zh":"“Poe”最常指美国重要作家埃德加·爱伦·坡，以哥特式恐怖与推理文学闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Edgar Allan Poe (1809–1849), an American writer famous for gothic horror, mystery stories, and poems such as “The Raven.”","zh":"埃德加·爱伦·坡（1809–1849），美国作家，以哥特式恐怖、侦探/推理故事和诗歌（如《乌鸦》）闻名。"},"examples":[{"en":"We read Poe’s short story “The Tell-Tale Heart” in class.","zh":"我们在课上读了坡的短篇小说《泄密的心》。"},{"en":"Her essay explains how Poe helped shape modern detective fiction.","zh":"她的文章解释了坡如何影响并塑造了现代侦探小说。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; someone whose family name is Poe.","zh":"姓氏；姓“Poe”的人。"},"examples":[{"en":"Dr. Poe will see you now.","zh":"坡医生现在要见你。"}]}],"synonyms":["Edgar Allan Poe","Poe-esque (related adjective)"],"phonetic":"/poʊ/","extraExplanation":["“Poe”通常读作 /poʊ/（类似“po”拉长的音）。","谈文学时，形容词常用“Poe-esque / Poe-like”（坡式的、带有阴郁诡异气氛的）。","坡常被认为对恐怖文学与侦探小说（如“密室”“线索推理”的传统）有重要影响；提到他时常会联想到《乌鸦》《厄舍府的倒塌》《莫格街凶杀案》等作品。"]}
{"word":"poe","summary":{"en":"“Poe” usually refers to the writer Edgar Allan Poe; “POE/PoE” commonly means Power over Ethernet in tech.","zh":"“Poe”通常指作家埃德加·爱伦·坡；“POE/PoE”在科技语境中常指以太网供电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Edgar Allan Poe (1809–1849), an American writer famous for dark short stories and poems, especially horror and mystery.","zh":"埃德加·爱伦·坡（1809–1849），美国作家，以阴郁的短篇小说和诗歌闻名，尤其擅长恐怖与推理题材。"},"examples":[{"en":"We read Poe’s short story “The Tell-Tale Heart” in class.","zh":"我们在课上读了坡的短篇小说《告密心》。"},{"en":"Poe is often called a master of Gothic fiction.","zh":"坡常被称为哥特式小说大师。"}]},{"partOfSpeech":"n.","definition":{"en":"POE (also written PoE): an abbreviation meaning “Power over Ethernet,” a technology that sends electrical power through an Ethernet network cable.","zh":"POE（也常写作 PoE）：是“以太网供电”的缩写，一种通过以太网网线同时传输数据和电力的技术。"},"examples":[{"en":"This security camera works with PoE, so it doesn’t need a separate power adapter.","zh":"这款监控摄像头支持 PoE，所以不需要单独的电源适配器。"},{"en":"Check whether the switch supports POE before buying the devices.","zh":"购买设备前先确认交换机是否支持 POE。"}]}],"synonyms":["Edgar Allan Poe","Power over Ethernet","PoE"],"phonetic":"/poʊ/","extraExplanation":["“Poe”作为人名时，通常特指美国作家埃德加·爱伦·坡。他的作品对后来的侦探小说与恐怖文学影响很大；例如他塑造的推理模式常被认为启发了后来的侦探故事传统。","写作“POE/PoE”时，多是科技领域缩写，读音常说“P-O-E”逐字母读，也有人直接读作 /poʊ/；在网络设备、监控摄像头、无线AP等场景很常见。"]}
{"word":"poebird","summary":{"en":"“Poebird” usually means “Poe’s bird,” especially the raven from Edgar Allan Poe’s poem “The Raven,” used as a dark/gothic literary reference.","zh":"“poebird”通常指“坡的鸟”，尤指爱伦·坡《乌鸦》中的乌鸦，用作带阴郁/哥特气质的文学典故。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird associated with Edgar Allan Poe, especially the raven in his poem “The Raven” (often used as a literary reference).","zh":"与美国作家埃德加·爱伦·坡相关的鸟，尤指他诗《乌鸦》（The Raven）里的那只乌鸦（常作文学典故使用）。"},"examples":[{"en":"In her essay, she calls the mysterious visitor a “Poe bird,” hinting at a dark, gothic mood.","zh":"在她的文章里，她把那位神秘来访者称为“Poe bird”，暗示阴郁的哥特式氛围。"},{"en":"He joked that the black bird on his balcony was a Poe bird, ready to say “Nevermore.”","zh":"他开玩笑说阳台上的黑鸟是“Poe bird”，随时要说“Nevermore（永不再）”。"}]}],"synonyms":["Poe’s raven","the raven (in Poe)","gothic symbol"],"phonetic":"/poʊ bɝd/","extraExplanation":["“poebird”不是常见的标准词汇，更像是把“Poe（坡）+ bird（鸟）”合在一起的创意用法/网名写法。文学语境里通常指《乌鸦》中的乌鸦，用来传达阴郁、神秘、哥特风的感觉。","《The Raven》中最著名的关键词是“Nevermore（永不再）”，所以提到“Poe bird”常会顺带联想到这句反复出现的台词。"]}
{"word":"poechore","summary":{"en":"“poechore” is not a recognized English word; it is likely a misspelling and needs context to identify the intended word.","zh":"“poechore”不是标准英语词，可能是拼写错误；需要上下文才能确定你想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or typo (often of words like “chore” or “poet/poetry,” depending on context).","zh":"不是标准英语单词；很可能是拼写错误或打字错误（常见可能是“chore”或“poet/poetry”，需看上下文）。"},"examples":[{"en":"I can’t find “poechore” in an English dictionary—did you mean “chore” (a task at home)?","zh":"我在英语词典里找不到“poechore”——你是不是想说“chore”（家务/日常任务）？"},{"en":"If you meant “poet,” you could say: “She is a poet who writes about nature.”","zh":"如果你想说“poet（诗人）”，可以说：“She is a poet who writes about nature.（她是一位写自然主题的诗人。）”"}]}],"phonetic":"/ˈpoʊ.kɔr/","extraExplanation":["“poechore”在常见英语词典中没有对应词条，通常说明是拼写/输入错误。","你可以把原句（前后各给我3–5个词）发来，我就能判断你想表达的是哪一个词（例如 chore / poet / poetry 等），并给出准确释义与发音。"]}
{"word":"poechores","summary":{"en":"“poechores” is not a recognized English word; it’s likely a misspelling. Provide the sentence or context to identify the intended word.","zh":"“poechores”不是公认的英文单词；很可能是拼写错误。请提供句子或上下文以判断你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a typed form of another word.","zh":"不是标准英文单词；很可能是拼写错误或误输入了其他单词。"},"examples":[{"en":"I couldn’t find “poechores” in a dictionary—did you mean “poachers” or “pochoir”?","zh":"我在词典里找不到“poechores”——你是不是想写“poachers（偷猎者）”或“pochoir（模板喷绘法）”？"}]}],"phonetic":"N/A","extraExplanation":["“poechores”最像是拼写或自动纠错造成的变体。你可以回想一下：你是在什么语境里看到/想输入它的？（例如：小说里的人物、艺术术语、还是日常对话？）","可能的目标词（按常见度猜测）：\n1) poachers /ˈpoʊtʃərz/：偷猎者（复数），也可指“非法捕捞/盗猎的人”。\n2) pochoir /ˈpoʊʃwɑːr/：法语借词，美术/印刷中的“模板喷绘法”。\n3) chores /tʃɔrz/：家务活（复数）。如果你原本想表达“诗人的家务/日常”（poet + chores），那更像是自造词或创意写法。","把你看到它的整句（前后各5–10个词）发来，我可以帮你准确判断并给出正确释义与用法。"]}
{"word":"poechoric","summary":{"en":"“poechoric” is not a standard English word; it’s likely a misspelling (often of “poetic”) or a rare specialized term.","zh":"“poechoric”不是标准英语词；很可能是拼写错误（常见为“poetic”），或极少见的专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a very rare technical term that is not widely recorded in major dictionaries.","zh":"不是标准英语单词。很可能是拼写错误，或极少见、未被主流词典收录的专业术语。"},"examples":[{"en":"I couldn’t find “poechoric” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“poechoric”，你能把看到它的句子发我吗？"},{"en":"If you meant “poetic,” the meaning changes a lot, so spelling matters here.","zh":"如果你想写的是“poetic（诗意的）”，那意思会差很多，所以这里拼写很关键。"}]}],"phonetic":"/poʊˈɛkɔrɪk/","extraExplanation":["“poechoric”看起来像拼写误差。最常见的可能是：\n1) **poetic**（诗意的、富有想象力的）\n2) **choric**（合唱的；与合唱队有关的，较少见）\n3) **Poe-** 开头的词（如与作家 Edgar Allan Poe 相关的形容词通常写作 *Poe-esque* 或 *Poe-like*，而不是 *poechoric*）\n\n如果你把原句/上下文贴出来（最好包含前后各一两句），我可以更准确判断你想表达的词，并给出正确释义与用法。"]}
{"word":"poecile","summary":{"en":"Poecile is the scientific genus name for chickadees and related tits.","zh":"Poecile 是“山雀属”的拉丁学名，包含多种山雀/灰山雀（chickadees 和部分 tits）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small songbirds in the tit family (Paridae), including chickadees and some tits (e.g., the Black-capped Chickadee).","zh":"（鸟类学）山雀科（Paridae）中的一个鸟属，包含多种“山雀/小山雀”和“灰山雀/美洲山雀”（如黑顶山雀）。"},"examples":[{"en":"The Black-capped Chickadee is classified in the genus Poecile.","zh":"黑顶山雀在分类学上归入山雀属（Poecile）。"},{"en":"Researchers compared Poecile species to understand how they survive cold winters.","zh":"研究人员比较了山雀属（Poecile）的不同物种，以了解它们如何熬过寒冷的冬季。"}]}],"synonyms":["(no common true synonym; related: chickadee, tit)"],"phonetic":"/ˈpiːsɪli/","extraExplanation":["Poecile 是生物分类学中的“属名”，在英文科普或学术文章里常以斜体出现（Poecile）。日常英语里更常说 chickadee（北美常见的“山雀”类）或 tit（英式英语里常用）。","词源来自古希腊语 poikilos，意为“斑驳的、颜色多样的”，与这些小鸟羽色的变化有关。"]}
{"word":"poeciliidae","summary":{"en":"Poeciliidae is the scientific family name for common livebearing freshwater fish such as guppies and mollies.","zh":"Poeciliidae 指花鳉科（胎生鳉科），是孔雀鱼、摩利鱼等常见胎生淡水鱼的科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small freshwater fish (livebearers) that give birth to live young; it includes guppies, mollies, platies, and swordtails.","zh":"花鳉科（胎生鳉科）：一类小型淡水鱼的科，常为卵胎生/胎生，会直接产下幼鱼；包括孔雀鱼、摩利鱼、月光鱼、剑尾鱼等。"},"examples":[{"en":"Guppies belong to the family Poeciliidae and are popular in home aquariums.","zh":"孔雀鱼属于花鳉科（Poeciliidae），在家庭水族箱里很常见。"},{"en":"Many Poeciliidae are used in mosquito-control programs because they eat mosquito larvae.","zh":"花鳉科的许多鱼类会被用于防治蚊虫，因为它们会吃蚊子幼虫。"}]}],"synonyms":["livebearers","guppy family"],"phonetic":"/ˌpiːsɪˈlɪiːdiː/","extraExplanation":["“Poeciliidae”是拉丁化的生物分类名称（科名），在英文中常见于科学写作与水族领域；日常口语里更常说“livebearers”（胎生观赏鱼/胎生鱼）或直接说guppies、mollies等具体鱼名。","词源提示：Poecili- 来自希腊语 poikilos，含“多彩、斑驳”的意思，呼应这一类鱼常见的鲜艳体色（例如孔雀鱼）。","发音小提示：英语中常读作“pee-SEE-lee-id-ee”（不同地区可能略有差异），但在学术交流中清楚拼读通常更重要。"]}
{"word":"poecilite","summary":{"en":"A poecilite is a large crystal in an igneous rock that contains many smaller enclosed crystals.","zh":"poecilite 指火成岩中包裹许多较小晶体的大晶体（与包晶结构相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) A large crystal in an igneous rock that encloses many smaller crystals (inclusions), forming a poecilitic texture.","zh":"（地质）在火成岩中包裹许多较小晶体（包裹体）的大晶体；形成“包晶结构/斑杂包晶结构（poecilitic texture）”的那颗大晶体。"},"examples":[{"en":"In this basalt thin section, the poecilite encloses tiny plagioclase crystals.","zh":"在这张玄武岩薄片中，poecilite 包裹着许多细小的斜长石晶体。"},{"en":"The presence of a poecilite can tell geologists that the large crystal grew later and surrounded earlier grains.","zh":"出现 poecilite 往往提示地质学家：那颗大晶体形成较晚，并包围了更早形成的矿物颗粒。"}]}],"synonyms":["oikocryst","host crystal"],"phonetic":"/ˈpiːsəˌlaɪt/","extraExplanation":["词源上与希腊语 *poikilos*（“斑驳的、多样的”）有关，因此 *poecilite/poecilitic* 常用来描述“内部含有许多不同小晶体、看起来斑杂”的岩石显微结构。","在岩石学里更常见的说法是 *poecilitic texture*（包晶结构）以及 *oikocryst*（主晶，指那颗包裹别的晶体的大晶体）和 *chadacryst*（被包裹的小晶体）。不同教材可能更偏好其中某个术语。"]}
{"word":"poecilitic","summary":{"en":"A medical adjective meaning “showing irregular, varied cell shapes,” especially in red blood cells.","zh":"医学形容词，指（尤其红细胞）形态不规则、呈多种形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having cells—especially red blood cells—of varied or irregular shapes; related to poikilocytosis.","zh":"（医学）指细胞（尤其红细胞）形态多样或不规则；与“异形红细胞增多症（poikilocytosis）”相关。"},"examples":[{"en":"The blood smear was described as poecilitic, suggesting significant red-cell shape variation.","zh":"血涂片被描述为 poecilitic，提示红细胞形态差异明显。"},{"en":"A poecilitic picture on microscopy can appear in certain anemias.","zh":"在显微镜下出现 poecilitic 的表现，可能见于某些贫血。"}]}],"synonyms":["poikilotic","poikilocytotic","pleomorphic"],"phonetic":"/ˌpɔɪkɪˈlɪtɪk/","extraExplanation":["该词较少见，更常见的拼写是 **poikilitic / poikilotic**，都来自希腊语词根 **poikilos**（“多样的、斑驳的”）。在检验报告中，通常会看到名词 **poikilocytosis**（异形红细胞增多）或形容词 **poikilocytotic/poikilotic**。","常用于血液学语境，和“红细胞大小不等（anisocytosis）”是不同概念：前者强调**形状**多样，后者强调**大小**差异。"]}
{"word":"poecilo","summary":{"en":"poecilo- is a scientific combining form meaning “variegated/mottled; having varied colors or patterns.”","zh":"poecilo- 是科学构词成分，表示“斑驳杂色的；颜色或花纹多样的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form used in scientific words meaning “varied in color or pattern; mottled; variegated.”","zh":"（构词成分）用于科学词汇中，表示“颜色或花纹多样的；斑驳的；杂色的”。"},"examples":[{"en":"In biology, poecilo- often appears in names for animals with mottled markings.","zh":"在生物学中，poecilo- 常出现在带有斑驳花纹的动物名称里。"},{"en":"The field guide listed several poecilo- species whose patterns help them camouflage.","zh":"野外图鉴列出几种带 poecilo- 的物种，它们的花纹有助于伪装。"}]}],"synonyms":["variegated","mottled","multicolored"],"phonetic":"/pəˈsɪloʊ/","extraExplanation":["poecilo- 来自希腊语词根（与 “poikilo-” 同源），含义是“多样、杂色、斑驳”。英语里有时会看到两种拼写：poecilo- 与 poikilo-，常见于生物分类学与形态学术语中。","如果你是在查某个完整单词（例如以 poecilo- 开头的学名或术语），把完整拼写发我，我可以按那个词的具体用法与例句再解释。"]}
{"word":"poecilocyttares","summary":{"en":"A medical term for an abnormally shaped red blood cell (often seen on a blood smear).","zh":"医学术语：指形态异常的红细胞（常在血涂片中观察到）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) An abnormally shaped red blood cell; often discussed in the plural (“poikilocytes”) when describing blood smears.","zh":"（医学）形态异常的红细胞；常用复数（poikilocytes）来描述血涂片中出现的异常红细胞。"},"examples":[{"en":"The lab report noted poikilocytes on the peripheral blood smear.","zh":"检验报告指出外周血涂片中可见形态异常的红细胞（poikilocytes）。"},{"en":"Severe anemia can be associated with many poikilocytes.","zh":"严重贫血可能伴随大量形态异常的红细胞。"}]}],"synonyms":["abnormally shaped red blood cell","RBC with abnormal morphology","poikilocyte"],"phonetic":"/ˈpɔɪkɪloʊˌsaɪt/","extraExplanation":["你输入的 **poecilocyttares** 很可能是拼写错误或非常罕见的变体。医学上更常见、规范的词是 **poikilocytes**（单数 **poikilocyte**）。","词根来源：**poikilo-** 来自希腊语，意思是“多样的、变化的”；**-cyte** 表示“细胞”。因此 poikilocyte 直观含义就是“形态多变的细胞（红细胞）”。","相关概念：**poikilocytosis** 指“红细胞形态多样/畸形增多”的现象（检验描述），而 poikilocyte 指“单个异常形态红细胞”。"]}
{"word":"poecilocyttarous","summary":{"en":"A medical adjective meaning “showing many abnormally shaped red blood cells.”","zh":"医学形容词：指“出现大量形态异常的红细胞（异形红细胞增多）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having many abnormally shaped red blood cells; showing poikilocytosis.","zh":"（医学）红细胞形态多样且异常；呈现“异形红细胞增多”（poikilocytosis）的。"},"examples":[{"en":"The blood smear was described as poecilocyttarous, with many irregularly shaped red blood cells.","zh":"血涂片被描述为 poecilocyttarous，可见大量形态不规则的红细胞。"},{"en":"A poecilocyttarous picture can suggest anemia and needs further testing.","zh":"出现 poecilocyttarous 的血象可能提示贫血，需要进一步检查。"}]}],"synonyms":["poikilocytarous","poikilocytic","showing poikilocytosis"],"phonetic":"/ˌpɔɪkɪloʊsaɪˈtɛrəs/","extraExplanation":["这个词在临床与检验报告中更常见的拼写是 **poikilocytarous / poikilocytic**，用户给出的 **poecilocyttarous** 可能属于少见变体或拼写差异。核心概念是 **poikilocytosis（异形红细胞增多）**。","词源上 **poikilo-** 来自希腊语，意为“多样的、各式各样的”；**-cyte** 指“细胞”；因此整体含义就是“细胞形态多样”。","它通常用于描述外周血涂片的形态学所见，常与缺铁性贫血、地中海贫血、溶血性贫血等情况相关，但具体诊断需要结合其他指标（如Hb、MCV、铁蛋白等）。"]}
{"word":"poecilogonous","summary":{"en":"Poecilogonous means “irregularly many-angled; not evenly shaped.”","zh":"poecilogonous 指“多角且不规则的；形状不均匀的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many different or irregular angles; not evenly shaped (often used to describe an irregular polygon or outline).","zh":"（形状）多角且角度不规则的；不均匀多边形的（常用于描述不规则的多边形或轮廓）。"},"examples":[{"en":"The old city wall forms a poecilogonous outline when seen from above.","zh":"从上方看，这座古城墙呈现出不规则多角的轮廓。"},{"en":"The rock’s poecilogonous surface makes it hard to measure with a simple ruler.","zh":"这块岩石表面多角不规则，用普通直尺很难测量。"}]}],"synonyms":["irregular","uneven","many-angled","jagged","polygonal"],"phonetic":"/ˌpiːsɪˈlɑːɡənəs/","extraExplanation":["这个词很罕见，主要出现在一些词汇表或偏学术的描述中。词源可拆成希腊语成分：poikilo-（“多样的、斑驳的”）+ -gonous（与“角”相关，类似 -gonia “角”）。整体意思就是“角度多样/不规则的”。日常英语更常用 irregular, uneven, jagged, polygonal 等词来表达相近意思。"]}
{"word":"poecilogony","summary":{"en":"Poecilogony is a biological term for a species producing offspring (often larvae) with more than one developmental mode.","zh":"Poecilogony 指生物学中的“多型生殖/多型发育”：同一物种产生具有不同发育方式的后代（常指幼体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In biology) the production, within a single species, of offspring (especially larvae) that develop in different ways—for example, some larvae feed in the plankton while others do not.","zh":"（生物学）同一物种内产生不同发育方式的后代（尤其是幼体）；例如，有些幼体在浮游生物中取食，有些则不取食。"},"examples":[{"en":"Some marine snails show poecilogony, producing both feeding and non-feeding larvae.","zh":"一些海洋蜗牛具有“多型生殖”，会产生既有取食型也有不取食型的幼体。"},{"en":"Researchers studied poecilogony to understand how environment and genes influence early development.","zh":"研究人员通过研究“多型生殖”来了解环境与基因如何影响早期发育。"}]}],"synonyms":["mixed developmental modes","developmental polymorphism"],"phonetic":"/ˌpiː.səˈlaɪ.ɡə.ni/","extraExplanation":["这个词主要用于动物学/海洋生物学文献，常见于多毛类（环节动物）、腹足类（蜗牛等）等海洋无脊椎动物的研究中。","词源可拆为希腊语：poikilos（多样的、斑驳的）+ gonos（后代、出生）。因此字面意思接近“多样的后代产生”。","它强调的是“同一物种内出现两种或多种幼体发育策略”，与单纯的“不同个体发育差异”相比，更突出“策略并存”的现象。"]}
{"word":"poecilomere","summary":{"en":"A rare botany term for a plant/flower with an irregular number of floral parts.","zh":"一个较罕见的植物学术语，指花部结构数目不规则的植株或花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A plant or flower that shows an unusual or irregular number of parts (such as petals, sepals, or stamens) compared with what is typical for that species.","zh":"（植物学）花部结构的数目（如花瓣、萼片、雄蕊等）出现异常或不规则、不同于该物种常见模式的植株或花。"},"examples":[{"en":"The researcher recorded a poecilomere with six petals in a species that usually has five.","zh":"研究人员记录到一朵该物种通常为五瓣、却长出六瓣的异常花（poecilomere）。"},{"en":"In the greenhouse, several poecilomeres appeared after the plants experienced temperature stress.","zh":"在温室里，这些植物经历温度胁迫后出现了几株结构数目异常的个体（poecilomeres）。"}]}],"synonyms":["abnormal floral form","floral anomaly"],"phonetic":"/pəˈsɪləˌmɪr/","extraExplanation":["“poecilomere”较为罕见，多见于植物形态学/分类学的专业语境；更常见的相关词是 **poecilomery**（花器官数目变化/不定性）以及形容词 **poecilomerous**（表现出这种不定性的）。","词源上来自希腊语成分：*poikilos*（多样的、变化的）+ 与“部分/肢体”相关的词根（常见于 *-mer-/-mere* 这类构词），整体强调“组成部分数量或形式的变化”。"]}
{"word":"poecilonym","summary":{"en":"Poecilonym means “synonym”—a word with the same or very similar meaning as another (often from a different root in technical usage).","zh":"Poecilonym 指“同义词”，即与另一个词意义相同或非常相近的词（在专业语境中常暗含词源不同）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synonym; a word or phrase that has the same or very similar meaning as another word, often (in technical use) one that comes from a different origin or root.","zh":"同义词；与另一个词意义相同或非常相近的词/短语（在较专业的用法中，常指词源不同、来自不同词根的同义词）。"},"examples":[{"en":"“Begin” and “start” are poecilonyms in everyday English.","zh":"“begin”和“start”在日常英语里是一组同义词（poecilonyms）。"},{"en":"In academic writing, writers choose among poecilonyms to avoid repeating the same word too often.","zh":"在学术写作中，作者会在同义词（poecilonyms）之间选择，以避免频繁重复同一个词。"}]}],"synonyms":["synonym","near-synonym","equivalent"],"phonetic":"pəˈsɪləˌnɪm","extraExplanation":["这个词非常少见，多见于语言学/修辞学的讨论，日常英语里通常直接说“synonym”。","词源拆解：poecilo- 来自希腊语 *poikilos*（“多样的、变化的”），-nym 来自 *onyma/onoma*（“名字/词”），字面有“不同形式的词名”之意。","如果你想强调“不同词源但意义相近”的同义词，可以用更常见的表达：*synonyms from different roots*（不同词根的同义词），例如 *ask*（日耳曼来源）与 *inquire*（拉丁/法语来源）。"]}
{"word":"poecilonymic","summary":{"en":"Poecilonymic means “involving many different names for the same thing.”","zh":"poecilonymic 指“同一事物存在许多不同名称/称呼”的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or characterized by the use of different names (poecilonyms) for the same person, place, thing, or concept; synonym-rich or name-varied","zh":"与同一事物使用不同名称（异名、同义名）有关的；具有多种称呼/名称变体特征的"},"examples":[{"en":"Scientific writing can become confusing when it is too poecilonymic, using many different names for the same species.","zh":"科学写作如果过于“异名繁多”，对同一种物种使用很多不同名称，就会让人困惑。"},{"en":"The database cleans up poecilonymic labels by choosing one standard term and listing the others as synonyms.","zh":"这个数据库通过选定一个标准术语，并把其他称呼列为同义词，来整理“多名并存”的标签。"}]}],"synonyms":["synonymic","polyonymous","name-varied"],"phonetic":"/ˌpiːsɪləˈnɪmɪk/","extraExplanation":["“poecilonymic”非常少见，多用于语言学、术语学、信息检索/数据库规范化等语境，用来描述“同一对象有很多不同叫法”的现象。","词根来自希腊语：poikilos（多样的、变化的）+ onym（名字）。相关词：poecilonym（异名/同物异名）、onomastics（专名学/命名研究）。"]}
{"word":"poecilonymy","summary":{"en":"Poecilonymy means using different near-synonyms to create variety in wording.","zh":"Poecilonymy 指用不同的近义词来让措辞更有变化、避免重复。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of different words with similar meanings (synonyms), especially to create variety in expression","zh":"（尤其指为了表达多样性而）使用意义相近的不同词语（同义词）的现象"},"examples":[{"en":"Good writing often uses some poecilonymy to avoid repeating the same word again and again.","zh":"好的写作常会运用一定的 poecilonymy（同义词替换）来避免一再重复同一个词。"},{"en":"In her speech, the politician relied on poecilonymy—“help,” “support,” and “assist”—to emphasize the message.","zh":"在演讲中，这位政治人物用 poecilonymy（如“help”“support”“assist”）来强化信息。"},{"en":"Too much poecilonymy can confuse readers if the synonyms don’t match the tone exactly.","zh":"如果同义词在语气上不够贴合，过度的 poecilonymy 反而会让读者困惑。"}]}],"synonyms":["synonymy","lexical variation","verbal variety","paraphrase","rewording"],"phonetic":"/ˌpiːsɪˈlɑːnɪmi/","extraExplanation":["这是一个比较冷僻的语言学/修辞学术语，来自希腊语词根：poikilos（“多样的、变化的”）+ onym（“名字/词”）。日常英语里更常见的相关说法是“synonymy（同义关系）”“lexical variety（词汇变化）”或“avoid repetition（避免重复）”。","它强调的是“用词的多样性”这一写作效果：适度替换能让文章更自然，但在正式写作中也要注意同义词并非完全等价（含义范围、语气、搭配不同），不宜为了变化而变化。"]}
{"word":"poecilopod","summary":{"en":"A rare zoological adjective meaning “having variegated or differently colored feet.”","zh":"一个罕见的动物学形容词，意为“脚部呈杂色或颜色不一”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having feet (or foot-like appendages) that are differently colored or variegated.","zh":"（动物学）指脚（或足状附肢）呈杂色、斑驳、颜色不一的。"},"examples":[{"en":"Some field guides describe certain shorebirds as poecilopod because their legs show contrasting bands of color.","zh":"一些野外图鉴会用 poecilopod 来形容某些涉禽，因为它们的腿部有明显对比的色带。"},{"en":"The specimen was noted as poecilopod, with pale toes and darker joints.","zh":"记录中写道该标本为 poecilopod：脚趾较浅、关节处更深。"}]}],"synonyms":["variegated-footed","multicolored-footed"],"phonetic":"/ˈpiːsɪləˌpɑːd/","extraExplanation":["这是一个很少见的科学用词，主要出现在动物学/分类学描述中，而不是日常英语。","词源可拆为：poecilo-（来自希腊语，意为“多彩的、斑驳的”）+ -pod（“足、脚”，如 tripod 三脚架）。","相关词：poecilogyny（植物学：雌蕊形态多样）、poikilotherm（变温动物）；含 -pod 的常见词：octopod（八足类）、arthropod（节肢动物）。"]}
{"word":"poecilopoda","summary":{"en":"Poecilopoda is a scientific genus name used in biological classification.","zh":"Poecilopoda 是生物分类中使用的一个科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name (taxonomic term) used for certain animals (the exact group depends on the field/source). It is typically written with a capital letter (Poecilopoda).","zh":"一个科学上的“属名”（生物分类学术语），用于指代某些动物类群（具体属于哪一类会因学科/资料来源而异）。通常首字母大写写作 Poecilopoda。"},"examples":[{"en":"The specimen was labeled Poecilopoda in the museum collection.","zh":"这件标本在博物馆馆藏中被标注为 Poecilopoda。"},{"en":"Researchers compared Poecilopoda with closely related genera.","zh":"研究人员将 Poecilopoda 与近缘属进行了比较。"}]}],"synonyms":["genus name","taxonomic genus"],"phonetic":"/ˌpiːsɪˈlɑːpədə/","extraExplanation":["这是拉丁化的学名，常见于生物学论文、物种名录和博物馆标签中；在正式写法里，属名首字母大写并用斜体（Poecilopoda）。","词源上常可分解为希腊语词根：poikilo-（“斑驳的、多样的”）+ -poda（“足、脚”），整体带有“（足部）花纹多样/斑驳”的命名意象。"]}
{"word":"poecilopodous","summary":{"en":"Poecilopodous means “having variegated or mottled feet,” and is a rare scientific adjective.","zh":"poecilopodous 意为“足部呈杂色/斑驳的”，是很罕见的科学用形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, scientific) Having feet that are variegated or differently colored (for example, mottled, speckled, or with contrasting patches).","zh":"（罕见，科学用语）指脚/足部呈杂色或多种颜色相间的（如斑驳、点状、或有明显对比色块）。"},"examples":[{"en":"In some shorebirds, juveniles may look more poecilopodous than adults because their legs show mottled shading.","zh":"在一些涉禽中，幼鸟的腿部可能比成鸟更显杂色，因此看起来更“poecilopodous（足部杂色）”。"},{"en":"The field notes describe the specimen as poecilopodous, with pale toes and darker joints.","zh":"野外记录把该标本描述为足部杂色：脚趾偏浅、关节处更深。"}]}],"synonyms":["variegated-footed","mottled-footed","speckle-footed"],"phonetic":"/pəˌsɪləˈpɑːdəs/","extraExplanation":["这是一个非常罕见的形容词，多见于动物学/鸟类学等描述性文字，日常英语几乎不用。","词源可拆为：poecilo-（“杂色的、斑驳的”，源自希腊语 poikilos）+ -podous（“足的、脚的”，与 pod/podium 同源）。理解词根后，你也更容易猜到类似学术词的意思。","更常见、更易懂的表达通常是：mottled feet（斑驳的脚/足部）、variegated feet（杂色的脚/足部）、speckled feet（带斑点的脚/足部）。"]}
{"word":"poem","summary":{"en":"A poem is a short piece of artistic writing in lines, often using rhythm and imagery to express feelings or ideas.","zh":"poem 指“诗”，是一种按行写作的艺术性文字，常用节奏与意象来表达情感或思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of writing arranged in lines (often with rhythm, imagery, and strong emotion) that expresses ideas in an artistic way.","zh":"诗；一种按行排列的文学作品（常有节奏、意象和情感），用艺术化的语言表达思想。"},"examples":[{"en":"She wrote a poem about spring and new beginnings.","zh":"她写了一首关于春天和新开始的诗。"},{"en":"We studied a poem by Robert Frost in class.","zh":"我们在课堂上学习了罗伯特·弗罗斯特的一首诗。"},{"en":"This poem uses simple words but powerful images.","zh":"这首诗用词简单，但意象很有力量。"}]}],"synonyms":["verse","lyric","ode (type of poem)"],"phonetic":"/ˈpoʊəm/","extraExplanation":["“Poem”通常指单篇作品；“poetry”更偏向“诗歌”这一艺术形式或诗作的总称（不可数）。“a poem / poems”可数，“poetry”一般不说“a poetry”。","常见相关术语：rhyme（押韵）、rhythm（节奏）、line（诗行）、stanza（诗节）、metaphor（隐喻）、imagery（意象）。","文学中常见用法：像Emily Dickinson、Robert Frost、Langston Hughes等英语诗人作品都常被称为“poems”。"]}
{"word":"poema","summary":{"en":"“Poema” means “poem” in Spanish/Italian; English usually says “poem,” but “poema” appears in discussions of Spanish/Italian literature or titles.","zh":"“Poema”在西班牙语/意大利语中意为“诗”。英语通常用“poem”，但在谈论西语/意语文学或作品标题时会用到“poema”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish/Italian) a poem; a piece of writing in verse, often with rhythm and imagery.","zh":"（西班牙语/意大利语）诗；用韵律与意象写成的诗歌作品。"},"examples":[{"en":"Her favorite poema is by Pablo Neruda.","zh":"她最喜欢的一首诗（poema）是巴勃罗·聂鲁达写的。"},{"en":"In class, we compared an English poem with a Spanish poema.","zh":"课堂上我们把一首英文诗和一首西班牙语诗（poema）作了对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a long, often narrative poem (similar to an epic poem).","zh":"（较少见）长篇叙事诗（类似史诗）。"},"examples":[{"en":"The author described the work as a poema about a hero’s journey.","zh":"作者把这部作品称为一首关于英雄之旅的长诗（poema）。"}]}],"synonyms":["poem","verse","lyric","epic"],"phonetic":"/poʊˈeɪmə/","extraExplanation":["“Poema”来自拉丁语 *poēma*（作品、诗歌），西班牙语和意大利语一直保留这个形式。英语里更常用的是 **poem**，但在讨论西语/意语文学、引用原文标题或强调原语言氛围时，也会看到 *poema*。","文学中常见的相关标题用法：如聂鲁达有作品集 **Veinte poemas de amor**（《二十首情诗》）。"]}
{"word":"poematic","summary":{"en":"“Poematic” is a rare/nonstandard adjective meaning “poetic,” and it’s usually better to write “poetic.”","zh":"“poematic”是少见且非标准的形容词，意思接近“poetic（诗意的）”，一般建议直接用“poetic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) relating to poetry; poetic. Often seen as a misspelling or variant of “poetic” or “poematical.”","zh":"（非标准/少见）与诗歌有关的；诗意的。常见于“poetic”或“poematical”的拼写错误或变体。"},"examples":[{"en":"The word “poematic” is uncommon; most writers use “poetic.”","zh":"“poematic”这个词不常见；大多数人会用“poetic”。"},{"en":"She described the sunset in a poetic way.","zh":"她用很有诗意的方式描写了日落。"}]}],"synonyms":["poetic","lyrical","poetical"],"phonetic":"/poʊˈɛmætɪk/","extraExplanation":["“poematic”在现代英语里非常少见，通常会被认为是拼写错误。正式写作、考试或简历里建议用“poetic”。","常用搭配：poetic language（诗意的语言）、poetic justice（因果报应/诗意的公正）、poetic license（诗人/作家为表达而允许的艺术性“自由”）。","相关词：poem（诗）、poet（诗人）、poetry（诗歌）、poetic（诗意的）、poematical（较少用，偏正式/旧式）。"]}
{"word":"poemet","summary":{"en":"Poemet means a very short poem (a “little poem”), and it’s a rare, literary-sounding word.","zh":"poemet 指“短诗/小诗”，是一个较少见、带文学气息的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very short poem; a little poem (rare, often literary or playful).","zh":"短诗；小诗（较少见，常见于文学或带玩味的用法）。"},"examples":[{"en":"She tucked a poemet into the letter—just four lines of thanks.","zh":"她在信里夹了一首短诗——只有四行，用来表达感谢。"},{"en":"The book is filled with poemets that capture ordinary moments.","zh":"这本书收录了许多短诗，捕捉日常瞬间。"}]}],"synonyms":["short poem","little poem","mini-poem","verselet"],"phonetic":"/ˈpoʊəmɪt/","extraExplanation":["“poemet”在现代英语中不常用，更多时候人们会直接说“short poem”或“little poem”。","词尾“-et”在英语里有“小/缩小”的感觉（多源自法语影响），类似的还有“leaflet（小册子）”“kitchenette（小厨房）”。因此“poemet”字面上就是“poem + 小”。","在文学语境里，用“poemet”有时带一点轻巧、精致或俏皮的语感。"]}
{"word":"poemlet","summary":{"en":"“Poemlet” means a very short poem, sometimes with a playful or slightly dismissive tone.","zh":"“poemlet”指很短的小诗，有时带玩笑或略带轻视的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very short poem; a small or slight poem (often used playfully or a bit dismissively).","zh":"短小的诗；小诗（常带玩笑或略带轻视的语气）。"},"examples":[{"en":"She posted a poemlet on her blog—just four lines about winter light.","zh":"她在博客上发了一首小诗——只有四行，写冬日的光。"},{"en":"He called it a poemlet, but the image stayed with me all day.","zh":"他称那只是首“小诗”，但那个意象让我一整天都忘不掉。"}]}],"synonyms":["short poem","little poem","verselet","brief verse","ditty (often more song-like)"],"phonetic":"/ˈpoʊəmlət/","extraExplanation":["“poemlet”由“poem（诗）+ -let（表示‘小、短’的后缀）”构成，类似于booklet（小册子）、leaflet（传单）。因此它既可中性地表示“短诗”，也可能带一点“分量不够、不过如此”的评价。"]}
{"word":"poems","summary":{"en":"“Poems” usually means more than one poem; it can also refer to poetry in a collection. As a verb, “to poem” exists but is rare—“write poems” is much more common.","zh":"“poems”通常指“多首诗（poem 的复数）”，也可泛指诗歌作品的集合。作动词“to poem”虽存在但很少用，更常说“write poems（写诗）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of writing arranged in lines (sometimes with rhyme and rhythm) that uses vivid language to express feelings, ideas, or stories.","zh":"诗；诗歌：以分行形式写成（有时押韵、有节奏），用生动的语言表达情感、思想或故事的文学作品。"},"examples":[{"en":"She wrote a poem about her hometown.","zh":"她写了一首关于家乡的诗。"},{"en":"This poem uses simple words but strong images.","zh":"这首诗用词简单，但意象很强。"},{"en":"We read a short poem in class today.","zh":"今天我们在课上读了一首短诗。"}]},{"partOfSpeech":"n.","definition":{"en":"A collection or group of poems (often in a book).","zh":"诗集：由多首诗组成的集合（常见于一本书中）。"},"examples":[{"en":"He published a poem about city life as part of a larger collection.","zh":"他发表了一首关于城市生活的诗，收录在更大的诗集中。"},{"en":"This poem/poems section introduces modern writers.","zh":"这本书的诗歌部分介绍了现代作家。"}]},{"partOfSpeech":"v.","definition":{"en":"To write poetry or express something in a poetic style.","zh":"写诗；用诗意的方式表达。"},"examples":[{"en":"She poems about nature and quiet mornings.","zh":"她写诗，主题多是自然和安静的清晨。"},{"en":"He sometimes poems in his journal to relax.","zh":"他有时在日记里写诗来放松。"}]}],"synonyms":["verses","poetry","rhymes","stanzas"],"phonetic":"/ˈpoʊəmz/","extraExplanation":["“poems”通常是名词“poem”的复数，表示“多首诗”。如果你想表达“写诗”，更常见、更自然的动词是“write poems”或“write poetry”。","名词用法里：poem（单首） vs. poetry（诗歌这一艺术形式/整体概念）。例如：I like poetry.（我喜欢诗歌。） / I like this poem.（我喜欢这首诗。）","小提醒：动词“to poem”存在但很少用，偏文学或玩味的表达；日常英语建议用“write poems/compose poetry”。"]}
{"word":"poen","summary":{"en":"“poen” is not a standard English word; it is most likely a misspelling of “poem,” meaning a piece of poetic writing.","zh":"“poen”不是标准英语单词；最可能是“poem（诗）”的拼写错误，指一首诗/诗歌作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a piece of writing in lines and verses that uses rhythm, imagery, and carefully chosen words to express feelings or ideas.","zh":"（可能是你想输入的）“poem”指诗：一种用分行/韵律/意象等方式表达情感或思想的文字作品。"},"examples":[{"en":"She wrote a short poem about winter.","zh":"她写了一首关于冬天的短诗。"},{"en":"We read a poem by Robert Frost in class.","zh":"我们在课堂上读了一首罗伯特·弗罗斯特的诗。"},{"en":"This poem uses strong images to show loneliness.","zh":"这首诗用强烈的意象来表现孤独。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a poetic composition in general; poetry as a form of literature.","zh":"（较不常见）泛指诗歌作品；作为文学体裁的“诗”。"},"examples":[{"en":"He prefers poem to prose.","zh":"他更喜欢诗而不是散文。"},{"en":"Poem can be challenging, but it’s rewarding.","zh":"诗可能有难度，但读懂后很有收获。"}]}],"synonyms":["verse","poetry","ode","lyric"],"phonetic":"/ˈpoʊəm/","extraExplanation":["“poen”在英语里不是常见单词，学习者最常见的情况是把“poem（诗）”拼错了（poem 里有字母 m）。如果你其实想查的是别的词（例如 peon、pollen、poet），告诉我你想表达的中文意思或给我一个例句，我可以帮你准确定位。","小提示：poem 的发音通常是两个音节 /ˈpoʊ.əm/，中间有一个很轻的“ə”音，所以听起来像“POH-um”。"]}
{"word":"poena","summary":{"en":"Poena is a Latin legal term meaning “penalty” or “punishment,” most often encountered in the phrase sub poena (as in subpoena).","zh":"poena 是拉丁语法律用语，意思是“处罚/惩罚”，最常见于 sub poena（如 subpoena 的词源）中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, Latin) a penalty or punishment; often seen in legal phrases like “sub poena.”","zh":"（法律/拉丁语）罚金、处罚；常见于法律短语中，如“sub poena”（在处罚之下）。"},"examples":[{"en":"The order was issued sub poena, meaning failure to comply could bring a penalty.","zh":"该命令以 sub poena 形式发布，意思是不遵守可能会受到处罚。"},{"en":"In medieval legal writing, poena referred to the punishment set by a court.","zh":"在中世纪的法律文献中，poena 指法院规定的惩罚。"}]}],"synonyms":["penalty","punishment","sanction","fine"],"phonetic":"/ˈpiːnə/","extraExplanation":["“poena”本身在现代英语里很少单独使用，更常作为拉丁语成分出现在法律术语中。最常见的关联词是“subpoena”，源自拉丁语“sub poena”，字面意思是“在处罚之下”，强调“若不遵从将受到惩罚”。","学习时可以把它理解为“penalty/ punishment（处罚）”这一核心含义，并借此记忆与法院传票相关的词汇。"]}
{"word":"poenalis","summary":{"en":"Poenalis is a Latin/legal adjective meaning “related to punishment; penal.”","zh":"Poenalis 是拉丁语/法律用形容词，意思是“与惩罚有关的；刑罚的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal/Latin) relating to punishment; penal; punitive.","zh":"（法律/拉丁语）与惩罚有关的；刑罚的；惩罚性的。"},"examples":[{"en":"In some older legal texts, poenalis is used to describe rules connected with punishment.","zh":"在一些较早的法律文献中，poenalis 用来描述与惩罚有关的规则。"},{"en":"The judge discussed the difference between civil remedies and poenalis measures.","zh":"法官讨论了民事救济与刑罚性措施之间的区别。"}]}],"synonyms":["penal","punitive","punitory"],"phonetic":"/piˈneɪlɪs/","extraExplanation":["poenalis 是拉丁语词形，来自 poena（“惩罚、刑罚”）。英语里的 penal（“刑罚的”）与 penalty（“处罚、罚款”）都与这个词根同源。","在现代英语写作中，poenalis 很少单独使用，更多出现在引文、法律拉丁语、或讨论古典/中世纪法学文本的语境里。日常英语通常用 penal / punitive 来表达。"]}
{"word":"poenitentiae","summary":{"en":"*Poenitentiae* is a Latin form meaning “of penitence/repentance,” used mainly in religious or scholarly texts.","zh":"*Poenitentiae* 是拉丁语形式，意为“悔罪/忏悔的；属于悔罪/忏悔的”，多见于宗教或学术文本。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “of penitence/repentance”; a form of the noun *poenitentia* meaning penitence, repentance, or penance (often used in religious or scholarly contexts).","zh":"（拉丁语）“悔罪/忏悔的；属于悔罪/忏悔的”；名词 *poenitentia*（悔罪、忏悔、补赎/苦修）的一个变格形式，常见于宗教或学术语境。"},"examples":[{"en":"The phrase *acta poenitentiae* can be translated as “acts of penance.”","zh":"短语 *acta poenitentiae* 可译为“补赎/忏悔的行为”。"},{"en":"In medieval manuscripts, writers sometimes used *poenitentiae* in headings about confession and repentance.","zh":"在中世纪手稿中，作者有时会在关于告解与悔改的标题里使用 *poenitentiae*。"}]}],"synonyms":["repentance","penitence","penance"],"phonetic":"/ˌpɛnɪˈtɛnʃi.aɪ/","extraExplanation":["*poenitentiae* 不是英语单词，而是拉丁语变格形式：通常表示属格单数（“……的悔罪/忏悔”）或主格复数（“悔罪/忏悔（复数）”），具体要看句子结构。","拉丁语 *poenitentia* 常与基督教语境相关：既可指内心的“悔改/痛悔”（repentance/penitence），也可指外在的“补赎/苦修”（penance）。英译时常需根据上下文在这几种词之间取舍。"]}
{"word":"poenology","summary":{"en":"Poenology is the science and study of wine and winemaking.","zh":"poenology 指“葡萄酒学/酿酒学”，即研究葡萄酒与酿造过程的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and science of wine and winemaking (including grape growing, fermentation, aging, tasting, and quality control)","zh":"葡萄酒学；酿酒学（研究葡萄酒与酿造过程的学科，包括葡萄栽培、发酵、陈酿、品鉴与品质控制等）"},"examples":[{"en":"She studied poenology in France and now works as a winemaker.","zh":"她在法国学习葡萄酒学，现在是一名酿酒师。"},{"en":"The university offers a poenology program focused on fermentation and sensory tasting.","zh":"这所大学开设葡萄酒学课程，重点是发酵与感官品鉴。"}]}],"synonyms":["oenology","wine science","viticulture and enology"],"phonetic":"/ˌiːnˈɑːlədʒi/","extraExplanation":["“poenology”也常写作“oenology”，两者意思完全一样；差别主要来自拼写习惯：美式英语里两种都能见到，但“oenology”更常见。","词源来自希腊语 oinos（葡萄酒）。在一些葡萄酒产区（如加州、法国、澳大利亚），“poenology/oenology”常用于大学专业、研究机构或职业培训的正式场合。","相关职业词：oenologist/poenologist（葡萄酒学家、酿酒师/酿酒技术专家，具体含义因地区与行业而略有不同）。"]}
{"word":"poephaga","summary":{"en":"*Poephaga* is a former genus name used for some Central Asian/Himalayan snowfinches, often reclassified under *Montifringilla*.","zh":"*Poephaga*是一些中亚/喜马拉雅雪雀的旧属名，许多现代分类常将其并入*Montifringilla*。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a former scientific genus name for certain high‑altitude snowfinches (small sparrow-like birds) found in Central Asia and the Himalayas; now often treated under the genus *Montifringilla* in many classifications","zh":"（旧）雪雀属：指一类生活在中亚与喜马拉雅高海拔地区、外形类似麻雀的小型鸟类；在许多现代分类中常并入*Montifringilla*（雪雀属/山雪雀属）"},"examples":[{"en":"The Tibetan Snowfinch was once placed in the genus *Poephaga*.","zh":"藏雪雀曾被归入*Poephaga*这个属。"},{"en":"Older field guides may list snowfinches under *Poephaga* rather than *Montifringilla*.","zh":"较早的野外图鉴可能会把雪雀写作*Poephaga*，而不是*Montifringilla*。"}]}],"synonyms":["Montifringilla (in many modern classifications)"],"phonetic":"/poʊˈɛfəɡə/","extraExplanation":["这是一个拉丁化的学名（属名），多用于鸟类学/生物分类学语境；一般日常英语里很少用。","不同资料对属的划分可能不同：有的系统把相关物种拆分/合并到其他属，因此你会在旧文献中看到*Poephaga*，在新文献中看到*Montifringilla*等。","如果你是在论文、鸟类名录或观鸟资料里遇到它，通常应把它理解为“某些雪雀的属名（旧称）”，并结合具体物种名（如 Tibetan Snowfinch 等）确认指代。"]}
{"word":"poephagous","summary":{"en":"Poephagous means “feeding on feces,” but it’s a rare term; coprophagous is more common.","zh":"poephagous 指“食粪的”，但很少用；更常见的词是 coprophagous。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) feeding on feces; eating dung (used of some animals or insects).","zh":"（罕见）以粪便为食的；食粪的（多用于动物或昆虫）。"},"examples":[{"en":"Some insects are poephagous and can survive by feeding on animal droppings.","zh":"有些昆虫是食粪性的，能靠取食动物粪便生存。"},{"en":"The scientist described the beetle’s poephagous behavior in a field report.","zh":"科学家在野外报告中描述了这种甲虫的食粪行为。"}]}],"synonyms":["coprophagous","scatophagous","dung-eating"],"phonetic":"/ˌpoʊiˈfæɡəs/","extraExplanation":["这是一个非常少见的词，多出现在生物学/动物行为学语境里；更常见、更标准的说法是 coprophagous 或 scatophagous（都表示“食粪的”）。","词尾 -phagous 来自希腊语，表示“吃、吞食”（同源词如 polyphagous“杂食的”、phagocyte“吞噬细胞”）。"]}
{"word":"poephagus","summary":{"en":"Poephagus is an older scientific genus name for the yak, now usually included in Bos.","zh":"Poephagus 是牦牛的旧属名，如今通常并入牛属（Bos）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for the yak; now usually treated as part of the genus Bos (cattle).","zh":"（旧）牦牛的一个属名；如今多被并入牛属（Bos，家牛/牛类）。"},"examples":[{"en":"In older zoology books, the yak may be listed as Poephagus grunniens.","zh":"在较早的动物学书籍里，牦牛可能被写作 Poephagus grunniens。"},{"en":"Modern classifications usually place Poephagus within the genus Bos.","zh":"现代分类学通常把 Poephagus 并入牛属（Bos）。"}]}],"synonyms":["yak","Bos (in modern classification)"],"phonetic":"/ˈpoʊ.ə.fə.ɡəs/","extraExplanation":["这是一个分类学上的“旧属名”（taxonomic synonym）。在一些历史文献或旧版词典/百科中仍能见到 Poephagus，用来指牦牛，但当代更常用的学名是 Bos grunniens。","词尾 -phagus 源自希腊语，常见于生物学词汇中，表示“吃……的/以……为食的”；不过在这个属名里主要作为传统拉丁化命名的一部分，日常英语里很少使用。"]}
{"word":"poesie","summary":{"en":"“Poesie” is an old/literary word meaning “poetry.”","zh":"“poesie”是较古老/文学性的用词，意思是“诗歌（poetry）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poetry; poems as a form of literature (an old or literary spelling, similar to “poesy”).","zh":"诗歌；诗作（较古老或文学性的拼写形式，类似于 poesy）。"},"examples":[{"en":"In old books, you may see “poesie” used where we would now write “poetry.”","zh":"在旧书里，你可能会看到用 poesie 来表示我们现在写的 poetry（诗歌）。"},{"en":"She loved music and poesie, and kept a notebook of favorite lines.","zh":"她喜欢音乐和诗歌，并把喜欢的诗句抄在笔记本里。"}]}],"synonyms":["poetry","poesy","verse"],"phonetic":"/ˈpoʊəzi/","extraExplanation":["“poesie”多见于较早期或偏文学的英语文本中；现代英语更常用 poetry。拼写也常与“poesy”互换（两者都表示“诗/诗艺”的文学用词）。","词源与希腊语 poiēsis（“创作、制作”）有关，强调诗歌是一种“创造/创作”的艺术。","如果你是在现代语境（作文、邮件、日常对话）中表达“诗歌”，通常用 poetry；“poesie/poesy”会给人一种古典、诗意或仿古的风格。"]}
{"word":"poesies","summary":{"en":"“Poesies” means poems or poetry, but it’s a literary/old-fashioned word; most modern English uses “poems” or “poetry.”","zh":"“poesies”指诗作或诗歌，但属于较文学/古旧的用法；现代英语更常说“poems”或“poetry”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poems; pieces of poetry (a literary or old-fashioned plural form, often used to sound poetic).","zh":"诗歌作品；诗作（较文艺或较古旧的复数形式，常用来营造诗意语气）。"},"examples":[{"en":"She filled her notebook with short poesies about the sea.","zh":"她的笔记本里写满了关于大海的短诗。"},{"en":"In the old anthology, you can find love poesies and heroic tales.","zh":"在那本旧诗选里，你能找到爱情诗和英雄故事。"}]},{"partOfSpeech":"n.","definition":{"en":"Poetry in general; poetic writing (rare today—most people say “poetry”).","zh":"诗歌（泛指）；诗体写作（现代较少用，通常说“poetry”）。"},"examples":[{"en":"He studied classical poesies alongside drama and history.","zh":"他学习古典诗歌，也学习戏剧和历史。"}]}],"synonyms":["poems","poetry","verse","poetic works"],"phonetic":"/ˈpoʊəziz/","extraExplanation":["“poesies”通常来自“poesy”的复数形式。“poesy”在现代英语里偏文学/古风，日常最常用的是“poems”（具体诗作）或“poetry”（诗歌这一体裁/总体）。","在文学语境中，使用“poesy/poesies”常带有一种更浪漫、更古典的风格色彩，类似刻意选择更“书面”“诗意”的词。"]}
{"word":"poesiless","summary":{"en":"“Poesiless” is a very rare adjective meaning “not poetic; lacking poetic beauty.”","zh":"“poesiless”是非常少见的形容词，意思是“缺乏诗意的；不具诗性美感的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) lacking poetry or poetic quality; not poetic.","zh":"（非常少见）缺乏诗意的；不具诗歌（或诗性）气质的。"},"examples":[{"en":"The report was clear but poesiless, with no imagery or emotion.","zh":"这份报告很清晰，但缺乏诗意，没有意象或情感。"},{"en":"He preferred simple, poesiless language to flowery writing.","zh":"他更喜欢朴素、缺乏诗意的语言，而不是辞藻华丽的写法。"}]}],"synonyms":["unpoetic","prosaic","plain","matter-of-fact","unromantic"],"phonetic":"ˈpoʊəzɪləs","extraExplanation":["“poesiless”并不是现代英语里的常用词，更常见的表达是“unpoetic / prosaic / lacking poetry（缺乏诗意）”。","它可能由古旧词“poesy（诗歌；诗艺）”加后缀“-less（没有……的）”构成；有时也会看到拼作“poesyless”。写作中若想自然地表达，建议用更常见的词替换。"]}
{"word":"poesis","summary":{"en":"Poesis means “creative making,” especially artistic or poetic creation; in philosophy it can mean productive activity that brings something into being.","zh":"Poesis 指“创造性的制作/生成”，尤指艺术或诗性的创造；在哲学中也可指把某物生产出来的活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of creating or making something, especially artistic creation (poetic making).","zh":"创造、制作的行为；尤指艺术性的创造（“诗性创造”）。"},"examples":[{"en":"For the writer, poesis is not just technique but the joy of making meaning.","zh":"对作家来说，poesis 不只是技巧，更是创造意义的喜悦。"},{"en":"The course explores poesis in poetry, film, and visual art.","zh":"这门课探讨诗歌、电影与视觉艺术中的 poesis（创造/生成）。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy, especially Aristotle) productive activity that brings something into being; “making” as opposed to “doing.”","zh":"（哲学，尤指亚里士多德）使某物产生/成形的“生产性活动”；与单纯的“行动/实践”相对。"},"examples":[{"en":"Aristotle links poesis to production: building a house is poesis because it results in a house.","zh":"亚里士多德把 poesis 与“生产”联系起来：盖房子属于 poesis，因为它产出一座房子。"},{"en":"In this view, poesis is judged by the work it creates, not only by the intention behind it.","zh":"在这种观点中，poesis 以其创造出的成果来衡量，而不只看背后的意图。"}]}],"synonyms":["creation","making","artistic creation","production","craft"],"phonetic":"/poʊˈiːsɪs/","extraExplanation":["“Poesis”来自希腊语 ποίησις（poiēsis），字面意思是“制作、生成”。英语里更常见的相关词是 poetry（诗歌）和 poet（诗人），它们都与“创造/制作”有关。","在古典哲学里常与 praxis（实践/行动）对比：poesis 强调“做出一个作品/结果”，praxis 更强调“在行动本身中完成的事”（如政治参与、伦理行动）。","在文学与人文研究中，poesis 有时被用来强调语言或艺术如何“把世界带出来”（让事物显现），因此常出现在批评理论、现象学或海德格尔相关讨论中。"]}
{"word":"poesy","summary":{"en":"“Poesy” is a literary, slightly old-fashioned word meaning poetry or poetic beauty.","zh":"“poesy”是较文学化、略显古典的词，表示“诗歌”或“诗意/诗情之美”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poetry; poems in general (a literary or old-fashioned word).","zh":"诗歌；诗作（较文学化或带点古风的用词）。"},"examples":[{"en":"She prefers romantic poesy to modern free verse.","zh":"比起现代自由诗，她更喜欢浪漫主义诗歌。"},{"en":"The novel is full of quiet poesy and gentle humor.","zh":"这本小说充满含蓄的诗意与温和的幽默。"}]},{"partOfSpeech":"n.","definition":{"en":"A poetic quality or mood; poetic beauty in language or a scene.","zh":"诗意；富有诗意的氛围或美感。"},"examples":[{"en":"There is a simple poesy in the way he describes everyday life.","zh":"他描写日常生活的方式里有一种朴素的诗意。"},{"en":"The mountain village has a calm, timeless poesy at dawn.","zh":"山村黎明时分有一种宁静、永恒的诗意。"}]}],"synonyms":["poetry","verse","rhyme","poetics","poetic beauty"],"phonetic":"/ˈpoʊ.ə.zi/","extraExplanation":["“poesy”在现代英语里不如“poetry”常用，常见于文学评论、较古典/抒情的语境，带一点“雅”“古”“诗情”的味道。","词源来自古法语/拉丁语，与“poetry”同源；在一些旧文本中也可拼作“poesie”。","搭配提示：常见说法有“lyric poesy（抒情诗）”“romantic poesy（浪漫诗风）”“a touch of poesy（一丝诗意）”。"]}
{"word":"poet","summary":{"en":"A poet is someone who writes poetry, often using creative and expressive language.","zh":"poet 指“诗人”，即创作诗歌、用富有表现力的语言表达情感与思想的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes poems; someone who uses language in a creative, expressive way.","zh":"诗人；写诗的人；善于用语言进行富有创意与表达的人。"},"examples":[{"en":"Emily Dickinson is a famous American poet.","zh":"艾米莉·狄金森是一位著名的美国诗人。"},{"en":"He wants to be a poet and publish his first book of poems.","zh":"他想成为诗人，并出版自己的第一本诗集。"},{"en":"People called her a poet because her songs sounded like poetry.","zh":"人们称她为诗人，因为她的歌曲听起来像诗。"}]}],"synonyms":["poetess (less common; can sound old-fashioned)","writer","bard (literary/old-fashioned)","versifier (formal; focuses on writing verse)"],"phonetic":"/ˈpoʊ.ɪt/","extraExplanation":["“poet”来自希腊语词根，和“make / create（创造）”有关，暗示诗人不仅是在写字，更是在“创作”一种语言的艺术。","常见搭配：poet laureate（桂冠诗人/官方授予的诗人称号）；romantic poet（浪漫主义诗人）；modern poet（现代诗人）。","文学文化中，“poet”有时也被更广义地用来形容“用独特眼光表达世界的人”，不一定只写传统诗歌。"]}
{"word":"poeta","summary":{"en":"“Poeta” means “poet” in Spanish/Italian/Portuguese and appears in English mainly in foreign-language contexts.","zh":"“poeta”在西班牙语/意大利语/葡萄牙语中意为“诗人”，在英语中多用于外语语境（引文、标题、姓名等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Spanish/Italian/Portuguese) a poet; a person who writes poems. In English, it’s usually seen in foreign-language quotes, titles, or names.","zh":"（源自西班牙语/意大利语/葡萄牙语）诗人；写诗的人。在英语中多见于外语引文、书名/标题或姓名中。"},"examples":[{"en":"In the Spanish poem, the word “poeta” simply means “poet.”","zh":"在这首西班牙语诗里，“poeta”这个词就是“诗人”的意思。"},{"en":"She studied Latin American literature and read interviews with each poeta.","zh":"她学习拉丁美洲文学，并阅读了对每位诗人的采访。"},{"en":"The mural honors a local poeta who wrote about migration and home.","zh":"这幅壁画致敬了一位书写迁徙与故乡的本地诗人。"}]}],"synonyms":["poet","bard","verse writer"],"phonetic":"/poʊˈɛtə/","extraExplanation":["“poeta”在英语里不是常用词；如果你在英文文章中直接用它，通常是为了保留原文风味（比如引用西语/意语作品），有时会用斜体表示外来词。更自然的英文一般直接用“poet”。","在西班牙语中常见搭配是“poeta”＝男性诗人，“poetisa”常指女性诗人（但现代用法里也有人用“poeta”泛指，不特别分性别，取决于地区与语境）。"]}
{"word":"poetaster","summary":{"en":"A (usually insulting) word for a bad or inferior poet.","zh":"（通常带贬义）指写诗水平很差的诗人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes poetry that is considered poor in quality; a bad or unskilled poet (often used as an insult).","zh":"拙劣的诗人；蹩脚诗人（常带侮辱意味）。"},"examples":[{"en":"The critic dismissed him as a poetaster who copied other writers’ styles.","zh":"评论家把他贬为一个只会模仿他人风格的蹩脚诗人。"},{"en":"She didn’t want to be seen as a poetaster, so she revised her poems carefully.","zh":"她不想被当成拙劣的诗人，所以认真修改自己的诗。"}]}],"synonyms":["bad poet","inferior poet","hack poet","rhymester (often negative)"],"phonetic":"/ˈpoʊətæstɚ/","extraExplanation":["“poetaster”由“poet（诗人）+ -aster”构成；“-aster”在英语里常带轻蔑意味，表示“低劣的……/冒牌的……”。因此这个词语气偏刻薄，正式场合或评价他人作品时需谨慎使用。","历史上文学论战中常用“poetaster”攻击对手，类似于说对方“只会装诗人、写得很差”。在现代写作中，更中性的表达可以用 “an amateur poet（业余诗人）” 或 “a weak poet（水平不高的诗人）”。"]}
{"word":"poetastering","summary":{"en":"Poetastering means writing or producing poor, pretentious poetry (or doing so as a verb).","zh":"poetastering 指写拙劣、矫揉造作的诗（也可作动词：写蹩脚诗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of writing or producing poor-quality, pretentious poetry; amateurish versifying","zh":"写（或创作）拙劣、矫揉造作的诗；拙劣作诗（的行为）"},"examples":[{"en":"His friends joked that his late-night poetastering should stay in his notebook.","zh":"朋友们开玩笑说，他深夜那种拙劣作诗还是留在笔记本里比较好。"},{"en":"The review criticized the novel’s poetastering passages, calling them distracting and awkward.","zh":"评论批评小说里那些拙劣作诗的段落，认为它们分散注意力又很尴尬。"}]},{"partOfSpeech":"v.","definition":{"en":"to write bad or overly showy poetry; to behave like a \"poetaster\" (a minor or contemptible poet)","zh":"写拙劣或卖弄的诗；像“蹩脚诗人/拙劣诗人”（poetaster）那样写诗"},"examples":[{"en":"He sometimes poetasters online, posting rhymes that try too hard to sound profound.","zh":"他有时会在网上写些卖弄的打油诗，押韵押得很用力，还努力显得深刻。"},{"en":"She stopped poetastering once she began reading more poets and revising carefully.","zh":"当她开始多读诗人作品并认真修改后，就不再那样拙劣作诗了。"}]}],"synonyms":["bad poetry writing","amateur versifying","doggerel (often)","hack verse (informal)"],"phonetic":"/ˌpoʊəˈtæstərɪŋ/","extraExplanation":["“poetastering”来自“poetaster”（蹩脚诗人/拙劣诗人）。后缀“-aster”在英语里常带有轻蔑或贬义（类似“二流的、冒牌的”），因此整个词通常用于讽刺或批评某人的诗写得不成熟、过度矫饰。","这是一个相对少见、带强烈评价色彩的词；日常更常用的表达有“write bad poetry / write cheesy poems / amateur poetry”。使用时注意语气，避免对他人造成冒犯。"]}
{"word":"poetasterism","summary":{"en":"Poetasterism means low-quality, pretentious poetry writing (like a “poetaster”).","zh":"poetasterism 指拙劣、矫揉造作的诗歌写作风格（“蹩脚诗人式”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or habit of writing poetry that is considered weak, pretentious, or of low quality; poetaster-like writing.","zh":"（被认为）拙劣、矫揉造作或低水平诗歌写作的做法/习气；“拙劣诗人式”的写作。"},"examples":[{"en":"The critic dismissed the collection as mere poetasterism, full of tired rhymes and empty drama.","zh":"评论家把这本诗集斥为不过是“拙劣诗风”，充满陈旧押韵和空洞的戏剧腔。"},{"en":"He worried that forcing himself to sound profound would lead to poetasterism rather than honest poetry.","zh":"他担心强行把自己写得“很深刻”，反而会变成矫揉造作的拙劣诗风，而不是真诚的诗。"}]}],"synonyms":["bad verse","doggerel (close)","pretentious verse","poetastery (rare)"],"phonetic":"ˈpoʊətæstərɪzəm","extraExplanation":["“poetasterism”由“poetaster”（贬义：蹩脚诗人/拙劣诗人）+ “-ism”（表示某种风格、做法或倾向）构成。它通常用于文学批评语境，带有嘲讽色彩，强调作品的自命不凡、堆砌辞藻但缺乏真情或技艺。"]}
{"word":"poetasters","summary":{"en":"“Poetasters” means people considered to be bad or amateur poets, often said as an insult.","zh":"“poetasters”指被认为诗写得很差或不够格的诗人，常带侮辱或嘲讽意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes poetry of poor quality; a bad or amateur poet (usually used as an insult)","zh":"拙劣的诗人；蹩脚诗人（通常带贬义、用于讽刺）"},"examples":[{"en":"The critic dismissed the author as a mere poetaster.","zh":"评论家把那位作者贬为不过是个蹩脚诗人。"},{"en":"She didn’t want to be seen as a poetaster, so she kept revising her poems.","zh":"她不想被看作拙劣的诗人，所以不断修改自己的诗。"}]}],"synonyms":["bad poet","hack poet","minor poet","dilettante (in poetry)"],"phonetic":"ˈpoʊɪˌtæstɚ","extraExplanation":["“poetaster”来自拉丁语词根 poet-（诗人）加带贬义/轻蔑色彩的后缀 -aster，暗示“冒牌的、拙劣的”。因此它常用于文学评论或争论中，语气比较刻薄。","在英语里，-aster 也出现在如 “gangster”（并非贬义后缀来源不同）等词，但在 “poetaster” 里更明显表达轻视；使用时要注意语境与礼貌。"]}
{"word":"poetastery","summary":{"en":"“Poetastery” (more commonly spelled “poetastry”) means inferior or bad poetry, usually said in criticism.","zh":"“poetastery”（更常见拼写为“poetastry”）指拙劣、低水平的诗，通常用于批评。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad or inferior poetry; poetry that is thought to be weak, clumsy, or overly sentimental (often used critically).","zh":"拙劣的诗；被认为软弱、笨拙或过度矫情的诗（常用于批评）。"},"examples":[{"en":"Some critics dismissed the poems as mere poetastery, more clever than moving.","zh":"一些评论家把这些诗贬为“拙劣的诗”，觉得只是在耍聪明，却不感人。"},{"en":"He worried his first drafts were poetastery and kept revising for clarity.","zh":"他担心自己的初稿只是拙劣的诗，于是不断修改，让表达更清晰。"}]}],"synonyms":["poetastry","doggerel","bad verse","inferior poetry"],"phonetic":"/ˈpoʊ.əˌstɹi/","extraExplanation":["这个词更常见的拼写是 **poetastry**；你写的 **poetastery** 很可能是变体或误拼。","词义带明显贬义，常见于文学评论/书评里，用来指“像诗但不够好”的作品。使用时注意语气与场合，避免对他人创作显得不尊重。","词源上与“poet（诗人）”相关，后缀 *-astry* 常用于表示“较低级/拙劣的……”，因此整体含义是“低水平的诗作”。"]}
{"word":"poetastress","summary":{"en":"A rare, derogatory word for a woman considered a bad poet.","zh":"一个罕见的贬义词，指被认为写诗很差的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Derogatory, rare) A woman who writes poetry poorly; a female poetaster.","zh":"（贬义，罕见）拙劣的女诗人；写得很差的女性“蹩脚诗人”（poetaster 的阴性形式）。"},"examples":[{"en":"Some critics dismissed her early work by calling her a poetastress, but later readers disagreed.","zh":"一些评论家把她早期作品贬称为 poetastress，但后来的读者并不认同。"},{"en":"He used the word poetastress to mock her style, which made the debate feel personal.","zh":"他用 poetastress 嘲弄她的文风，让讨论变得很针对个人。"}]}],"synonyms":["poetaster","bad poet","hack poet"],"phonetic":"/ˈpoʊətæstrəs/","extraExplanation":["这个词很少见，语气通常带有刻薄或轻蔑。更常见的对应贬义词是 poetaster（指“蹩脚诗人”，不分性别）。","词尾 -ess/-stress 过去常用来标记女性身份（如 actress、waitress），但现代英语更倾向用性别中性的 poet、actor、server 等；因此在当代语境里，poetastress 往往显得过时或带性别偏见。","poetaster 在英语文学批评里出现过较多，常用来讽刺“自命不凡却水平不高的写诗者”。如果你在阅读中遇到 poetastress，多半是在讽刺或模仿旧式写法。"]}
{"word":"poetastric","summary":{"en":"Poetastric describes writing that tries to be poetic but comes off as amateurish or pretentious.","zh":"poetastric 形容文字刻意追求诗意却显得蹩脚、做作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing the style of a bad or amateur poet; weakly poetic in a way that feels forced or pretentious","zh":"（文风）蹩脚诗人的；矫揉造作、用力过猛却欠佳的诗意表达"},"examples":[{"en":"The speech was full of poetastric lines that sounded dramatic but meant very little.","zh":"这篇演讲充满了蹩脚的“诗意”句子，听起来很煽情却没什么内容。"},{"en":"Her diary has a few poetastric passages—pretty images, but awkward rhythm and unclear meaning.","zh":"她的日记里有几段很“诗匠气”的文字——意象好看，但节奏别扭、意思不清。"}]}],"synonyms":["poetasterish","pretentiously poetic","overwrought","purple","flowery"],"phonetic":"/ˌpoʊəˈtæstrɪk/","extraExplanation":["“poetastric”来自“poetaster”（蹩脚诗人、二流诗人）。“-astric / -aster”在英语里常带有贬义，暗示“自称/冒充某种身份但水平不够”。","它通常用于批评写作风格而不是身份：强调“刻意追求诗意但效果尴尬”，常见于评论文章、书评、影评等。"]}
{"word":"poetastrical","summary":{"en":"Poetastrical means ‘pretentiously poetic but bad or awkward,’ usually as a criticism.","zh":"poetastrical 指“装得很诗意但写得拙劣/生硬”的（多用于批评）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written in the style of a poetaster; showily poetic but of poor quality (awkward, forced, or pretentious).","zh":"（文字）带有“拙劣诗人（poetaster）”风格的；矫揉造作却质量不高的（假装很诗意但很尴尬/生硬）。"},"examples":[{"en":"The speech was full of poetastrical lines that sounded dramatic but meant very little.","zh":"这篇演讲充满了诗人腔的拙劣句子，听起来很煽情，却几乎没什么内容。"},{"en":"Her poetastrical metaphors made the story feel forced rather than moving.","zh":"她那些矫饰而拙劣的比喻让故事显得很生硬，而不是感人。"}]}],"synonyms":["pretentiously poetic","overwrought","purple","flowery","affected"],"phonetic":"/ˌpoʊɪˈtæstrɪkəl/","extraExplanation":["“poetastrical”来自“poetaster”（拙劣诗人、蹩脚诗人）+ -ical。它通常带有批评甚至嘲讽语气，用来形容文字刻意追求“诗意”，但表达空洞或不自然。","近义比较：poetic（诗意的，中性/褒义） vs. poetastrical（装腔作势的诗意，贬义）；flowery（辞藻华丽的，常略贬）也可能接近，但“poetastrical”更强调“写得很差却想装高雅”。"]}
{"word":"poetastry","summary":{"en":"Poetastry means poor, fake-sounding, or overly sentimental poetry.","zh":"poetastry 指拙劣、矫饰或过分煽情的“伪诗意”诗作/文字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad or trivial poetry; writing that tries to sound poetic but is not truly good or original.","zh":"拙劣的诗；矫揉造作、空洞无味的“假诗意”文字。"},"examples":[{"en":"The critic dismissed the book as sentimental poetastery.","zh":"评论家把这本书斥为伤感而拙劣的“诗意文字”。"},{"en":"The speech was full of poetastery instead of clear ideas.","zh":"这篇演讲充满矫饰的“诗意辞藻”，却缺乏清晰观点。"}]}],"synonyms":["bad poetry","doggerel","verse-making (disapproving)","poetic drivel"],"phonetic":"/ˈpoʊ.əˌstɹi/","extraExplanation":["“poetastry”带强烈贬义，常见于文学评论或较正式的批评语境，用来指“硬凹诗意”“华丽但空”的文字。","词形上可理解为 poet（诗人）+ -astry（带有“低劣、次等”含义的后缀），因此语气比“bad poetry”更尖刻。使用时注意场合与礼貌。"]}
{"word":"poetcraft","summary":{"en":"Poetcraft means the craft and skill of writing poetry.","zh":"Poetcraft 指写诗的技艺与匠心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skill, techniques, and artistry involved in writing poetry; poetic craftsmanship","zh":"诗歌创作的技艺与手法；诗艺（诗的“匠心/功力”）"},"examples":[{"en":"Her poetcraft is strongest in her vivid images and tight rhythms.","zh":"她的诗艺最强之处在于生动的意象和紧凑的节奏。"},{"en":"The workshop focuses on poetcraft: sound, line breaks, and metaphor.","zh":"这个工作坊聚焦诗歌技艺：声音、分行和隐喻。"},{"en":"Even in simple language, good poetcraft can make a poem memorable.","zh":"即使语言朴素，好的诗艺也能让一首诗令人难忘。"}]}],"synonyms":["poetic craft","poetic technique","poetic craftsmanship","versification","poetics"],"phonetic":"/ˈpoʊətˌkræft/","extraExplanation":["“poetcraft”由 poet + craft 组成，craft 在这里是“技艺/匠艺”的意思，强调写诗的“手上功夫”，如节奏、押韵、意象、分行、修辞与结构等。","该词在日常口语中不算常见，更常见的表达有 poetic craft、poetic technique、poetic craftsmanship。"]}
{"word":"poetdom","summary":{"en":"Poetdom means poets collectively—the world or community of poets.","zh":"poetdom 指“诗人整体/诗人界”，即诗坛这个群体或圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"All poets as a group; the world or community of poets.","zh":"诗人整体；诗人界；诗坛（作为一个群体或圈子）。"},"examples":[{"en":"In the nineteenth century, poetdom debated what poetry should be: moral teaching or pure art.","zh":"在19世纪，诗人界曾争论诗歌应该是什么：道德教化还是纯粹艺术。"},{"en":"Her first book was praised across poetdom, even by writers who rarely agree.","zh":"她的第一本书在诗坛广受称赞，甚至连那些很少意见一致的诗人也认可。"}]}],"synonyms":["the poetry world","poets collectively","the community of poets","literary circles"],"phonetic":"ˈpoʊətˌdəm","extraExplanation":["“poetdom”由“poet（诗人）+ -dom”构成，-dom 常表示“某一群体/领域/状态”（如 kingdom 王国、freedom 自由、Christendom 基督教世界）。因此 poetdom 指“诗人这个群体或圈子”，语气偏文学化、略带老派/书面色彩。","在现代英语中更常见的表达是 “the poetry world / the community of poets / poets collectively”。“poetdom”多出现在评论、随笔或带一点幽默/讽刺意味的文字里，用来概括“诗坛/诗人圈子”的风气与话题。"]}
{"word":"poetesque","summary":{"en":"Poetesque means ‘poetic’—having a poetry-like style or mood (rare word).","zh":"poetesque 意为“诗意的、像诗的”（较少见的词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having the style, mood, or charm of poetry; poetic or poet-like.","zh":"（少见）具有诗歌的风格、情调或魅力的；诗意的；像诗人的。"},"examples":[{"en":"The film’s slow pacing and soft light create a poetesque atmosphere.","zh":"这部电影缓慢的节奏和柔和的光线营造出一种诗意的氛围。"},{"en":"She wrote in a poetesque voice, full of images and gentle rhythm.","zh":"她用一种带有诗意的语调写作，充满意象与轻柔的韵律。"}]}],"synonyms":["poetic","lyrical","evocative","romantic"],"phonetic":"/ˌpoʊəˈtɛsk/","extraExplanation":["“poetesque”是一个比较少见的形容词，常见表达通常用“poetic”。它由“poet-（诗人）”加上后缀“-esque（……风格的，……式的）”构成，语气上更偏“带某种风格/气质”，有时显得更文艺或更刻意。写作中使用时要注意读者是否熟悉该词。"]}
{"word":"poetess","summary":{"en":"“Poetess” means a woman who writes poems, but it can sound old-fashioned or less respectful; many people prefer “poet.”","zh":"“poetess”指女诗人，但可能显得过时或不够尊重；很多人更推荐用不分性别的“poet（诗人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who writes poems; a female poet (now often considered old-fashioned, and sometimes seen as less respectful than “poet”)","zh":"女诗人；写诗的女性（如今常被认为有些过时，有时还带有轻视或不够尊重的意味；更常用 poet）"},"examples":[{"en":"Emily Dickinson is now usually called a poet, not a poetess.","zh":"艾米莉·狄金森如今通常被称为 poet（诗人），而不是 poetess。"},{"en":"Some writers avoid the word “poetess” because it can sound patronizing.","zh":"一些写作者会避免使用“poetess”，因为它听起来可能带有居高临下的感觉。"}]}],"synonyms":["poet","female poet"],"phonetic":"/ˌpoʊəˈtɛs/","extraExplanation":["“poetess”在英语中曾经常用来强调“女性诗人”，类似于“actress（女演员）”。但现代英语里，很多人更倾向用不分性别的“poet”，以避免把性别当作标签，或暗示“女诗人”是“诗人”的次级类别。","在文学与评论语境中，“poetess”有时会让人联想到19世纪所谓的“poetess tradition（女诗人传统）”，常与更私人、抒情、家庭/情感主题相关联。这是历史语境下的分类，并不代表女性诗歌只能如此。"]}
{"word":"poetesses","summary":{"en":"“Poetesses” means women poets (the plural of “poetess”), though modern English often prefers the gender-neutral “poets.”","zh":"“poetesses”指女诗人（poetess 的复数），但现代英语更常用性别中性的“poets/poet”来表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who write poetry (plural of “poetess”).","zh":"女诗人（“poetess”的复数），指写诗的女性。"},"examples":[{"en":"In the 19th century, many poetesses published in magazines under pen names.","zh":"在19世纪，许多女诗人用笔名在杂志上发表作品。"},{"en":"The anthology includes poems by both poets and poetesses from around the world.","zh":"这本选集收录了来自世界各地的男诗人和女诗人的作品。"}]}],"synonyms":["women poets","female poets","poets (gender-neutral)"],"phonetic":"/ˈpoʊətəsɪz/","extraExplanation":["“poetess”在现代英语里常被认为带有过时或刻意区分性别的色彩，有时甚至让人觉得在贬低女性写作者。因此当代写作与学术语境中，更常用中性词“poet”（诗人）来指任何性别的人。","在文学史语境里，你仍会看到“poetess/poetesses”，尤其是在讨论18—20世纪早期的出版分类、书评话语或当时的性别观念时。","相关表达：women poets（女性诗人，较中性）、female poet（女性诗人）、poetry by women（女性写作的诗歌）。"]}
{"word":"poethood","summary":{"en":"Poethood means the state of being a poet—your identity, role, or life as a poet.","zh":"Poethood 指“诗人身份/诗人之道”，即作为诗人的状态、角色或生涯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of being a poet; the identity, life, or role of a poet.","zh":"诗人身份；作为诗人的状态或角色（诗人生涯、诗人之道）。"},"examples":[{"en":"She wrote about motherhood and poethood as two kinds of devotion.","zh":"她写到母亲身份与诗人身份是两种不同的奉献。"},{"en":"His poethood was shaped by city life and everyday speech.","zh":"他的诗人气质受到城市生活与日常语言的影响。"}]}],"synonyms":["poetry life","life as a poet","poetic identity","poetship"],"phonetic":"/ˈpoʊətˌhʊd/","extraExplanation":["“poethood”由 poet（诗人）+ -hood（表示“身份/状态/时期”的后缀，如 childhood 童年、neighborhood 街区）构成，强调“成为/作为诗人”的身份感与经历。","这个词不算最常见，学术写作、文学评论或带一点修辞色彩的文章里更常见；日常表达里更常用 “being a poet” 或 “life as a poet”。"]}
{"word":"poetic","summary":{"en":"Poetic means related to poetry or having a beautiful, imaginative, emotion-filled style like poetry.","zh":"poetic 表示“与诗歌有关的”或“像诗一样优美、富有想象力与情感的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to poetry, or written in the style of poetry (often using vivid language, rhythm, and imagery).","zh":"与诗歌有关的；具有诗歌风格的（常用生动语言、节奏与意象）。"},"examples":[{"en":"She wrote a poetic description of the ocean at night.","zh":"她用富有诗意的文字描写了夜晚的海洋。"},{"en":"The movie’s ending felt quiet and poetic.","zh":"这部电影的结尾安静而富有诗意。"}]},{"partOfSpeech":"adj.","definition":{"en":"Beautiful, imaginative, or emotionally moving in a way that feels like poetry (not necessarily an actual poem).","zh":"（不一定真的是诗）像诗一样优美、有想象力或能打动人心的。"},"examples":[{"en":"There’s something poetic about watching the first snow fall.","zh":"看着第一场雪飘落，有一种说不出的诗意。"},{"en":"His speech was simple but poetic.","zh":"他的演讲朴素却很有诗意。"}]}],"synonyms":["lyrical","expressive","imaginative","evocative"],"phonetic":"/poʊˈɛtɪk/","extraExplanation":["“poetic”既可以指“属于诗歌的/诗体的”（poetry-related），也常用来形容“很美、很有画面感、很有情绪张力”的表达或场景（poetry-like）。日常英语里，人们说“poetic”很多时候是在夸一种“意象丰富、含蓄动人”的美感，而不一定真的在谈诗。","常见搭配：poetic language（诗意的语言）、poetic image/imagery（诗意的意象/意境）、poetic justice（诗意的正义：坏人遭报应、好人得回报，带一点“命运的巧合与公平”的感觉）。"]}
{"word":"poetical","summary":{"en":"Poetical means “related to poetry” or (often critically) “overly poetic/fancy in style.”","zh":"poetical 指“与诗歌有关/富有诗意”，也常带批评意味，指“过分诗化、华丽却不够清晰”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Sometimes critical) using language that is overly fancy, old-fashioned, or unrealistically “poetic,” especially when simple wording would be clearer.","zh":"（有时带批评）用词过于华丽、古风或不够真实地“诗意”，本来用简单表达会更清楚。"},"examples":[{"en":"The article sounded poetical and vague, so the main idea was hard to follow.","zh":"这篇文章写得很“诗意”但很含糊，所以主旨不太好理解。"},{"en":"Try to avoid poetical phrases in a business email.","zh":"商务邮件里尽量避免过于诗化的措辞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to poetry; poetic.","zh":"与诗歌有关的；诗的；富有诗意的（同 poetic）。"},"examples":[{"en":"He enjoyed poetical works from the Romantic period.","zh":"他喜欢浪漫主义时期的诗歌作品。"},{"en":"The song has a poetical feeling, like a short poem.","zh":"这首歌有一种诗意的感觉，像一首短诗。"}]}],"synonyms":["poetic","verse-like","lyrical","flowery (critical)","ornate (critical)"],"phonetic":"/poʊˈɛtɪkəl/","extraExplanation":["“poetical”和“poetic”意思很接近，但日常英语更常用“poetic”。“poetical”更偏书面或旧式表达，有时也会用来暗示“太矫饰、太做作”。","在文学评论里，“poetical”常用于讨论“诗歌体裁/诗歌语言”（poetical language），而在日常评价里更常说“poetic”（poetic imagery / poetic style）。"]}
{"word":"poeticality","summary":{"en":"Poeticality means the quality of being poetic—having a poetic style, mood, or beauty.","zh":"Poeticality 指“诗意/诗性”，即具有诗的风格、氛围或美感的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being poetic; a poetic style, mood, or imaginative beauty in language or art","zh":"诗意；诗性；（语言或艺术中的）诗的风格、氛围或富于想象的美感"},"examples":[{"en":"The film’s quiet scenes have a strong sense of poeticality.","zh":"这部电影安静的片段有很强的诗意。"},{"en":"She praised the poeticality of his writing, especially the images and rhythm.","zh":"她称赞他的文字很有诗性，尤其是意象和节奏。"},{"en":"Even in a simple speech, he tried to add a bit of poeticality.","zh":"即使在一段简单的演讲中，他也试图加入一点诗意。"}]}],"synonyms":["poetic quality","poeticity","poeticness","lyricism"],"phonetic":"ˌpoʊəˈtɪkəlɪti","extraExplanation":["“poeticality”在现代英语中相对少见，学术或评论写作里偶尔出现；更常见的表达是“poetic quality（诗意/诗的特质）”“poeticness”或“poeticity”。","构词上来自“poetical（诗的/富有诗意的）+ -ity（表示性质/状态）”，因此常用于讨论作品的风格与审美气质，而不一定只指“诗歌”本身。"]}
{"word":"poetically","summary":{"en":"“Poetically” means “in a poetic, imaginative way,” and it can also mean “in a metaphorical sense, not literally.”","zh":"“poetically”表示“以诗意、富有想象力的方式”，也可表示“从比喻意义上说，并非字面意思”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a poetic or artistic way; using language that is imaginative, expressive, or beautiful rather than plain and literal.","zh":"以诗意的方式；用富有想象力、表现力或美感的语言来表达，而不是平铺直叙或完全字面。"},"examples":[{"en":"She described the night poetically, as a velvet sky sprinkled with silver.","zh":"她用诗意的方式描写夜晚，说那是铺着天鹅绒、点缀着银光的天空。"},{"en":"The author writes poetically about grief, turning pain into images readers can feel.","zh":"作者以诗意的笔触写悲伤，把痛苦化成读者能感受到的意象。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a loosely or metaphorically true sense (often used to soften a statement): not literally, but in spirit or effect.","zh":"（较宽泛地、比喻性地）从精神或效果上说算是“真实”的：不是字面意义上的，而是带有象征或感受上的意义。"},"examples":[{"en":"Poetically speaking, the old bridge is the town’s memory.","zh":"从诗意的角度说，那座老桥就是这座小镇的记忆。"},{"en":"He was, poetically, a lighthouse for his friends during hard times.","zh":"比喻地说，在艰难时期他像灯塔一样照亮朋友们。"}]}],"synonyms":["lyrically","artistically","imaginatively","figuratively","metaphorically"],"phonetic":"/poʊˈɛtɪkli/","extraExplanation":["“poetically”来自“poetic（诗的/富有诗意的）+ -ally（副词后缀）”。它既可以描述写作风格（语言更有画面感、节奏感、隐喻多），也常用于“poetically speaking（从诗意/比喻意义上说）”来提示读者：接下来不是严格的事实陈述，而是形象化的表达。","文学中常见的“poetically”会搭配描写性动词，如 write, describe, express, render，强调把抽象情感（爱、孤独、悲伤）转化为可见的意象（光、海、冬天、火）。"]}
{"word":"poeticalness","summary":{"en":"“Poeticalness” means the quality of being poetical—having a poetic style or feeling.","zh":"“poeticalness”指“诗意/诗性”，即具有诗歌般的风格或情感氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being poetical (having the style, imagination, or emotional beauty associated with poetry).","zh":"诗意；诗的气质（具有诗歌般的风格、想象力或情感之美的特质）。"},"examples":[{"en":"Her short story had a quiet poeticalness that made ordinary scenes feel magical.","zh":"她的短篇小说带着一种安静的诗意，让平凡的场景也显得很奇妙。"},{"en":"The film’s poeticalness comes from its simple language and vivid images.","zh":"这部电影的诗意来自它朴素的语言和生动的画面。"}]}],"synonyms":["poetic quality","poeticness","lyricism","poetry (figurative)","poetic feel"],"phonetic":"/poʊˈɛtɪkəl.nəs/","extraExplanation":["“poeticalness”是由“poetical + -ness”构成的名词，但在现代英语里非常少见，常被认为不够地道。更常用的表达是“poetic quality / poeticness / lyricism”，或直接说“poetry”来指“诗意、诗性”。","“poetical”与“poetic”意思相近；“poetical”更偏传统、书面或略显古典的语感，因此“poeticalness”整体也带一点刻意或古风的感觉。"]}
{"word":"poeticise","summary":{"en":"Poeticise means to make something poetic or to express it in a poetic/idealized way.","zh":"poeticise 指“使……更具诗意”或“用诗意/理想化的方式表达”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something more poetic (more like poetry), or to describe/express it in a poetic style.","zh":"使某事更具诗意；用诗意的方式描述或表达。"},"examples":[{"en":"The filmmaker poeticised the ordinary routines of city life.","zh":"这位电影导演把城市日常生活的琐事处理得很有诗意。"},{"en":"In her memoir, she sometimes poeticises pain to make it easier to face.","zh":"在回忆录里，她有时会把痛苦写得很诗意，以便更容易面对。"}]},{"partOfSpeech":"vi.","definition":{"en":"To speak or write in a poetic, romantic, or overly idealized way.","zh":"以诗意、浪漫或过度理想化的方式说话或写作。"},"examples":[{"en":"He tends to poeticise when he talks about his hometown.","zh":"他一谈到家乡就容易变得很诗意、很浪漫。"},{"en":"Try not to poeticise the past—remember the problems, too.","zh":"别把过去诗化得太美，也要记得当时的问题。"}]}],"synonyms":["poeticize","romanticize","idealize","embellish","lyricize"],"phonetic":"/poʊˈɛtɪˌsaɪz/","extraExplanation":["“poeticise”是英式拼写；美式更常见“poeticize”。两者意思相同，只是拼写习惯不同。","这个词在学术写作、评论或批评中较常见，有时带一点“把事情说得太浪漫/太理想化”的含义，语气可中性也可略带批评。"]}
{"word":"poeticised","summary":{"en":"“Poeticised” means made more poetic or romantic in expression; it is also the past form of “poeticise.”","zh":"“poeticised”指把表达变得更有诗意/更浪漫（有时带美化之意）；也是“poeticise”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made more poetic in style or feeling; expressed in a romantic or imaginative way rather than a plain, factual one","zh":"使之更具诗意（或浪漫/想象色彩）；用更抒情而非直白事实的方式来表达"},"examples":[{"en":"In the translation, the simple original was poeticised to sound more lyrical.","zh":"在译文中，原本朴素的文字被诗意化处理，使其更抒情。"},{"en":"The film offers a poeticised view of rural life, leaving out many hardships.","zh":"这部电影对乡村生活做了诗意化呈现，略去了许多艰辛。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “poeticise”: to turn something into poetry or to describe it in a more poetic way","zh":"“poeticise”的过去式/过去分词：把某物写成诗，或用更诗化的方式描述"},"examples":[{"en":"She poeticised her diary entries and later published them as poems.","zh":"她把日记条目诗化，后来以诗歌形式出版。"},{"en":"The critic argued that history was poeticised to create a national myth.","zh":"评论家认为，为了塑造民族神话，历史被诗意化了。"}]}],"synonyms":["romanticized","idealized","embellished","lyricized"],"phonetic":"/poʊˈɛtɪsaɪzd/","extraExplanation":["“poeticised”是英式拼写；美式更常写作“poeticized”。两者意思相同。","这个词常带有“美化/浪漫化（可能忽略现实细节）”的含义，尤其在评论电影、历史叙述、传记或新闻写作时。","与“poetic”不同：poetic（诗意的）描述一种自然呈现的风格；poeticised更强调“经过人为加工、刻意写得更诗意”。"]}
{"word":"poeticising","summary":{"en":"Poeticising means speaking or writing in a poetic style, or making something seem more romantic/ideal than it really is.","zh":"poeticising 指用诗意方式说写，或把事物描述得更浪漫、更理想化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Using poetic language or style; describing something in a more lyrical, imaginative way.","zh":"用诗意的语言或风格表达；把事物描述得更抒情、更富想象力。"},"examples":[{"en":"She was poeticising about the sunset, calling it “a river of fire.”","zh":"她在用诗意的语言描写日落，把它称为“火焰的河流”。"},{"en":"The speech kept poeticising instead of giving clear facts.","zh":"那场演讲一直在抒情化表达，而不是提供清晰的事实。"}]},{"partOfSpeech":"vt.","definition":{"en":"Making something seem more beautiful, romantic, or ideal than it really is (similar to “romanticizing”).","zh":"把某事说得更美好、更浪漫或更理想化（类似“美化/浪漫化”）。"},"examples":[{"en":"He was poeticising the past and forgetting the problems they faced.","zh":"他在把过去诗意化，忘了他们当时遇到的困难。"},{"en":"Try not to poeticise hardship; it was difficult for many people.","zh":"别把苦难诗意化；那对很多人来说都很艰难。"}]}],"synonyms":["poeticizing","romanticizing","idealizing","lyricizing","embellishing"],"phonetic":"/poʊˈɛtɪsaɪzɪŋ/","extraExplanation":["“poeticising”是英式拼写（poeticising），美式更常写作“poeticizing”。两者意思相同。","这个词在日常口语里不算高频，更常见的替代说法有“use poetic language / get lyrical / romanticize / idealize”。在评论演讲、写作或回忆时，常带一点“说得太抒情、不够务实”的语气。"]}
{"word":"poeticism","summary":{"en":"Poeticism means poetic wording or a poetic style, sometimes praised for beauty and sometimes criticized as overly ornate.","zh":"Poeticism 指诗意的措辞或诗化的风格；既可褒义（优美有诗意），也可贬义（过于华丽做作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poetic expression, wording, or style; language that sounds like poetry (sometimes used critically for being too ornate or artificial)","zh":"诗意的表达、措辞或风格；带有诗歌味道的语言（有时带批评意味，指过于华丽或做作）"},"examples":[{"en":"The novel is full of poeticisms that make ordinary scenes feel magical.","zh":"这部小说充满诗意的表达，让平常的场景显得很梦幻。"},{"en":"Some readers dislike the author’s poeticisms and prefer plainer language.","zh":"有些读者不喜欢作者那些诗化的措辞，更偏好朴素直接的语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality or tendency of being poetic; a poetic “flavor” in speech or writing","zh":"诗意的特质或倾向；言语或写作中带有“诗的味道”"},"examples":[{"en":"Her speeches have a quiet poeticism that stays with the audience.","zh":"她的演讲有一种含蓄的诗意，令听众回味。"}]}],"synonyms":["poetic expression","poetic diction","lyricism","ornate language"],"phonetic":"/poʊˈɛtɪˌsɪzəm/","extraExplanation":["“Poeticism”常见于文学评论或写作讨论中，指某种“诗化的表达方式”。语气可以是中性的（赞美有诗意），也可能是负面的（批评过度矫饰、堆砌华丽辞藻）。","在实际使用里，“poeticism(s)”可以指具体的诗化措辞（可数，用复数更常见），也可以指整体的诗意风格（不可数，更抽象）。","相关词：poetic（诗意的）、poetry（诗歌）、poetic diction（诗歌用语/诗体措辞）、purple prose（过度华丽的散文，偏贬义）。"]}
{"word":"poeticize","summary":{"en":"Poeticize means to make something more poetic or to express it in a poetic style.","zh":"poeticize 指把某事“诗化”（使其更有诗意/更美化），或用诗的风格来表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make something sound or feel poetic (more beautiful, imaginative, or emotional) by using poetic language.","zh":"用诗意的语言来表达；把事物写得/说得更有诗意、更优美、更富想象或情感。"},"examples":[{"en":"The author poeticized everyday life, turning simple chores into vivid scenes.","zh":"作者把日常生活写得很诗意，把简单的家务变成了生动的画面。"},{"en":"Don’t poeticize the past too much—it wasn’t perfect.","zh":"别把过去过度诗化——它并不完美。"}]},{"partOfSpeech":"v.","definition":{"en":"To write or express something in the form or style of poetry.","zh":"以诗的形式写作或表达；用诗歌体裁呈现。"},"examples":[{"en":"She tried to poeticize her travel journal, adding rhythm and images.","zh":"她试着把旅行日记诗化，加上节奏和意象。"},{"en":"The speech poeticized the city’s history into a short, lyrical story.","zh":"这场演讲把城市历史诗化成了一段短而抒情的故事。"}]}],"synonyms":["romanticize","idealize","embellish","versify","lyricize"],"phonetic":"/poʊˈɛtɪˌsaɪz/","extraExplanation":["“poeticize”比较少见，常见的近义表达有：make it poetic / romanticize / idealize / embellish。带批评意味时，常用来提醒别人别把现实说得过于美化（例如“poeticize the past”）。","词形上来自“poetic + -ize”，表示“使……具有某种性质”。在写作课或评论里偶尔会用到。"]}
{"word":"poeticized","summary":{"en":"“Poeticized” means made more poetic in style; it is also the past form of “poeticize.”","zh":"“poeticized”表示“被诗化的/更具诗意的”，也可作 poeticize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of language, a description, or a story) made more poetic in style—more lyrical, emotional, or decorative—often by changing word choice, rhythm, or imagery.","zh":"（指语言、描述或故事）被“诗化”的；通过改变用词、节奏或意象，使其更抒情、更有画面感或更有情感色彩。"},"examples":[{"en":"The translation is accurate, but some lines feel poeticized compared with the plain original.","zh":"这份译文很准确，但有些句子相比朴素的原文显得更“诗化”。"},{"en":"He poeticized the events of his childhood, turning ordinary memories into vivid scenes.","zh":"他把童年的经历诗化了，把普通的回忆写成了生动的场景。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of poeticize: to make something sound or look more poetic.","zh":"poeticize 的过去式/过去分词：使……诗化；让……更具诗意。"},"examples":[{"en":"The editor poeticized the opening paragraph to match the novel’s romantic tone.","zh":"编辑把开头一段诗化处理，以配合小说的浪漫基调。"},{"en":"The speech was poeticized for the ceremony, with extra metaphors added.","zh":"为了典礼，这篇演讲被诗化处理，加入了更多隐喻。"}]}],"synonyms":["made poetic","poetically phrased","embellished","lyrical","ornate"],"phonetic":"/ˈpoʊətəˌsaɪzd/","extraExplanation":["“poeticized”在现代英语里相对少见，更常见的表达包括：made poetic、poetically phrased、romanticized（更强调理想化/美化，未必有“诗的语言”那一层）。","语气提示：poeticized 有时是中性（更优美），有时带轻微批评（为了好听而过度装饰、偏离事实），要看上下文。"]}
{"word":"poeticizing","summary":{"en":"Poeticizing means using or adding poetic language—sometimes in a way that romanticizes reality.","zh":"poeticizing 指用（或加入）诗意的语言来表达，有时带有“把现实浪漫化/美化”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Describing something in a poetic way, often by using imaginative, emotional, or decorative language (sometimes making it sound more beautiful than it really is).","zh":"用诗意的方式描述某事，常通过想象、情感或华丽的语言来表达（有时会把事物写得比现实更美）。"},"examples":[{"en":"The article is informative, but it keeps poeticizing the city’s problems instead of explaining them clearly.","zh":"这篇文章信息量很足，但它一直在把城市的问题写得很诗意，而不是把问题讲清楚。"},{"en":"She tried to be honest without poeticizing the past.","zh":"她努力诚实地讲述过去，而不把过去美化得太诗意。"}]},{"partOfSpeech":"v.","definition":{"en":"Writing or speaking in a poetic style; turning ordinary words or ideas into something that sounds like poetry.","zh":"以诗歌的风格写作或表达；把普通的词句或想法写得像诗一样。"},"examples":[{"en":"He was poeticizing about the ocean, comparing it to a restless heart.","zh":"他用诗意的语言写大海，把它比作一颗不安的心。"},{"en":"The narrator keeps poeticizing, so the story feels more like a lyric than a report.","zh":"叙述者不断采用诗意表达，所以这个故事更像抒情作品而不是纪实报道。"}]}],"synonyms":["romanticizing","idealizing","embellishing","lyricizing","beautifying"],"phonetic":"/poʊˈɛtɪˌsaɪzɪŋ/","extraExplanation":["“poeticizing”来自动词“poeticize”（= make something poetic）。这个词在日常口语里不算常见，更多见于评论写作风格（比如批评某人把现实写得太浪漫/太美化）。","在语气上，它既可以是中性（只是说明风格很诗意），也常带一点批评意味：强调“过度抒情、避开具体事实”。"]}
{"word":"poeticness","summary":{"en":"Poeticness means the quality of being poetic—having poetic beauty, style, or imagination.","zh":"Poeticness 指“诗意/富于诗性的品质”，强调语言或艺术作品中的诗化美感与想象力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being poetic; poetic style, beauty, or imagination in language or art","zh":"诗意；诗的风格与美感；富于想象力的表达（语言或艺术作品中的诗意品质）"},"examples":[{"en":"Her writing has a quiet poeticness that makes simple moments feel meaningful.","zh":"她的文字有一种安静的诗意，让平凡瞬间也显得很有意义。"},{"en":"The film’s poeticness comes from its slow pace and vivid images.","zh":"这部电影的诗意来自它缓慢的节奏和生动的画面。"},{"en":"Even in everyday speech, he adds poeticness by using fresh metaphors.","zh":"即使在日常说话中，他也会用新颖的比喻增添诗意。"}]}],"synonyms":["poetic quality","poetry (in a figurative sense)","lyricism","poetry-like beauty","poetic style"],"phonetic":"/poʊˈɛtɪknəs/","extraExplanation":["“poeticness”在现代英语里不算最常用的词，很多时候更自然的说法是“poetic quality”（诗意/诗的品质）、“poetry”（诗意/诗歌气质）或“poetic style”（诗化风格）。","构词上是形容词“poetic”加名词后缀“-ness”，表示“……的状态/性质”。因此它强调的是一种“程度”或“特质”，常用于评价文字、电影、摄影、音乐等带来的诗意感受。"]}
{"word":"poetico","summary":{"en":"“Poetico” is a rare loanword in English meaning “poetic,” often used for artistic tone or as a name/title; in normal English, “poetic” is more common.","zh":"“poetico”在英语中较少见，多作借词表示“诗意的”，常用于文艺语境或作为名称/标题；日常英语更常用“poetic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Borrowed from Italian/Spanish, not common in everyday English) “Poetic; having the style, mood, or beauty of poetry.”","zh":"（源自意大利语/西班牙语的借词，在日常英语中不常见）“诗意的；具有诗歌般风格、氛围或美感的。”"},"examples":[{"en":"The album’s liner notes describe the lyrics as *poetico*—dreamy and symbolic.","zh":"专辑内页说明把歌词形容为 *poetico*——梦幻而富有象征意味。"},{"en":"In English, you’ll usually say “poetic” instead of *poetico*.","zh":"在英语里通常用 “poetic” 来表达，而不是 *poetico*。"}]},{"partOfSpeech":"other","definition":{"en":"Used in titles or names (e.g., art projects, brands, events) to suggest an artistic or literary feel.","zh":"用于标题或名称（如艺术项目、品牌、活动等），用来营造“文艺、文学化”的感觉。"},"examples":[{"en":"They launched a small magazine called *Poetico* to feature new writers.","zh":"他们创办了一本叫 *Poetico* 的小杂志来刊登新作者作品。"}]}],"synonyms":["poetic","poetical","lyrical","evocative"],"phonetic":"/poʊˈɛtɪkoʊ/","extraExplanation":["在英文写作里，*poetico* 多见于带“异国语感”的文艺语境（如唱片文案、展览标题、品牌命名），不算标准常用词。想要自然表达时，通常用 **poetic**（诗意的）或 **poetical**（更偏正式/文学）。","词源上与希腊语 *poiētēs*（诗人）同源，相关常见词还有 **poetry**（诗歌）、**poet**（诗人）、**poetics**（诗学/诗歌理论）。"]}
{"word":"poetics","summary":{"en":"Poetics means the study/theory of poetry, or the poetic style and principles that create poetic effects.","zh":"Poetics 指诗学（诗歌理论与研究），也可指营造诗意效果的风格与原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or theory of poetry—how poems are made and how they work (for example, form, rhythm, imagery, voice, and meaning)","zh":"诗学；诗歌理论——研究诗歌如何被创作以及如何产生效果（如体裁、节奏、意象、声音与意义）"},"examples":[{"en":"She took a course in poetics to understand how poets use rhythm and imagery.","zh":"她上了一门诗学课，来理解诗人如何运用节奏和意象。"},{"en":"His research focuses on modernist poetics.","zh":"他的研究聚焦于现代主义诗学。"}]},{"partOfSpeech":"n.","definition":{"en":"the poetic principles or style typical of a writer, genre, or period; the way something achieves a “poetic” effect","zh":"（某作家/体裁/时代的）诗性风格与原则；营造“诗意效果”的方式"},"examples":[{"en":"The novel’s poetics comes from its musical sentences and vivid images.","zh":"这部小说的诗性来自其富有音乐感的句子和鲜明的意象。"},{"en":"They discussed the poetics of hip-hop, including rhyme, rhythm, and storytelling.","zh":"他们讨论了嘻哈的诗性，包括押韵、节奏与叙事。"}]}],"synonyms":["poetry theory","literary theory (poetry)","prosody","poetic style","aesthetics (in context)"],"phonetic":"/poʊˈɛtɪks/","extraExplanation":["“Poetics”常用于学术语境，既可以指对诗歌的系统研究，也可以更广义地指任何文本或艺术形式的“诗性机制”（比如电影的剪辑节奏、歌词的押韵方式）。","西方文学研究中常提到亚里士多德的《Poetics》（《诗学》），它讨论悲剧、情节结构（如“情节统一”）等，对后世文论影响很大。"]}
{"word":"poeticule","summary":{"en":"Poeticule is a rare noun meaning a minor/mediocre poet (often disparaging), and more rarely a short, slight poem.","zh":"poeticule 是个罕见名词，常指不入流/水平一般的“小诗人”（多带贬义），更少见时也可指短小的“小诗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a minor or mediocre poet (often used humorously or critically); a “little poet.”","zh":"小诗人；拙劣/不入流的诗人（常带调侃或批评意味）。"},"examples":[{"en":"The critic dismissed him as a poeticule who copied older styles.","zh":"评论家把他贬为一个只会模仿旧风格的小诗人。"},{"en":"She didn’t want to be seen as a poeticule, so she revised the poem again and again.","zh":"她不想被看作不入流的诗人，于是一遍又一遍地修改那首诗。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a short, slight poem; a small piece of verse.","zh":"（罕见）小诗；短小的诗作。"},"examples":[{"en":"He scribbled a poeticule on the back of the receipt while waiting.","zh":"他等候时在收据背面随手写了一首小诗。"}]}],"synonyms":["poetaster","minor poet","hack poet","versifier (sometimes)"],"phonetic":"poʊˈɛtɪkjuːl","extraExplanation":["这个词非常少见，语气通常不太正式，多用于讽刺或自嘲：强调“诗人/诗作很小、分量不够”。","词源来自拉丁语 *poeticula*（“小诗”，*-ula* 是表示“变小”的后缀），因此在英语里也带有“轻视/缩小其重要性”的感觉。写作时要注意场合，避免在正式介绍诗人时使用。"]}
{"word":"poetiised","summary":{"en":"“Poetized/poetised” means “made something more poetic or romantically described.”","zh":"“Poetized/poetised”意思是“把……诗化，用更诗意或更浪漫的方式来描写”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to describe or express something in a poetic (more beautiful, imaginative, or romantic) way; to make something sound like poetry","zh":"用诗意的方式描写或表达；把事物写得更优美、更富想象或更浪漫（“诗化”）"},"examples":[{"en":"The film poetized ordinary city life, turning small moments into something magical.","zh":"这部电影把普通的城市生活诗化了，把小瞬间拍得像魔法一样。"},{"en":"She poetized his childhood in her memoir, focusing on wonder rather than hardship.","zh":"她在回忆录里把他的童年写得很诗意，更强调美好而不是艰难。"}]},{"partOfSpeech":"vi.","definition":{"en":"to write poetry; to speak or think like a poet (less common)","zh":"写诗；以诗人的方式说话或思考（较少见）"},"examples":[{"en":"He liked to poetize about nature when he was alone.","zh":"他独处时喜欢用诗意的语言谈论自然。"}]}],"synonyms":["romanticize","idealize","embellish","lyricize"],"phonetic":"/ˈpoʊəˌtaɪz/","extraExplanation":["你输入的 **poetiised** 很可能是拼写错误，通常写作 **poetised**（英式过去式/过去分词）或 **poetized**（美式）。词根来自 *poet*（诗人）+ 动词后缀 *-ize/-ise*，表示“使……具有某种性质”。","这个词常带一点评价色彩：有时是褒义（写得很美），有时也可能暗示“把现实写得过于浪漫化/理想化”。"]}
{"word":"poetiising","summary":{"en":"“Poetising/poetizing” means making something more poetic in style, sometimes to the point of romanticizing it.","zh":"“poetising/poetizing”指把表达变得更“诗化”，有时也指对事物进行过度浪漫化/美化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of making something sound or feel like poetry, often by using imaginative, emotional, or decorative language (present participle/gerund of “poetise/poetize”)","zh":"（poetise/poetize 的现在分词/动名词）把事物“诗化”，用更富想象、情感或修饰性的语言来表达"},"examples":[{"en":"In her memoir, she is poetising ordinary moments to make them feel magical.","zh":"在她的回忆录里，她把日常瞬间诗化，让它们显得很有魔力。"},{"en":"Some critics say the film is poetising war instead of showing its real costs.","zh":"一些评论家认为这部电影在诗化战争，而不是呈现它真实的代价。"}]}],"synonyms":["romanticizing","idealizing","lyricizing","embellishing"],"phonetic":"/ˈpoʊətaɪzɪŋ/","extraExplanation":["“poetiising”更常见是拼写错误；标准拼写通常是英式 poetising，美式 poetizing。","这个词在日常口语里不算常见，更常见于文学评论、影评、学术写作，用来指出“把现实写得过于浪漫/抒情（甚至美化）”。常带有批评语气。","相关表达：romanticizing（浪漫化/美化）、idealizing（理想化）、lyricizing（抒情化）。"]}
{"word":"poetise","summary":{"en":"Poetise means to make something sound or feel poetic, or to turn something into a poem.","zh":"Poetise 指使表达更具诗意，或把内容写成诗。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make something more poetic; to describe or express something in the style of poetry.","zh":"使（事物）更具诗意；用诗歌的风格来描写或表达。"},"examples":[{"en":"She tried to poetise her everyday worries into something beautiful.","zh":"她试着把日常的忧虑诗化成美好的东西。"},{"en":"The writer poetised the city’s noise and turned it into music on the page.","zh":"作家将城市的喧嚣诗化，把它写成了纸上的音乐。"}]},{"partOfSpeech":"vt.","definition":{"en":"To write or turn something into a poem (a less common sense).","zh":"把某事写成诗；将某事改写成诗（较少见）。"},"examples":[{"en":"He poetised the legend into a short ballad.","zh":"他把那个传说诗化成一首短叙事歌谣。"}]}],"synonyms":["poetize","romanticize","versify","lyricize"],"phonetic":"/ˈpoʊəˌtaɪz/","extraExplanation":["“poetise”是英式拼写，更常见的美式拼写是“poetize”。两者意思相同，只是拼写习惯不同。","这个词在日常口语里不算常用，常出现在文学评论、写作讨论或较正式的语境中，带有“把普通事物写得更浪漫/更有意境”的感觉。"]}
{"word":"poetised","summary":{"en":"“Poetised” means “made poetic” or “described in an idealized, poetic way.”","zh":"“poetised”表示“使之富有诗意”，或“用理想化/诗意的方式来描写”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of poetise) To describe, write, or present something in a poetic, romantic, or idealized way.","zh":"（poetise 的过去式/过去分词）用诗意、浪漫或理想化的方式来描写、写作或呈现某事。"},"examples":[{"en":"The memoir poetised his childhood, turning ordinary moments into lyrical scenes.","zh":"这本回忆录把他的童年写得很诗意，把普通时刻变成抒情的场景。"},{"en":"The film poetised the city’s streets, making them feel magical.","zh":"这部电影把城市街道拍得很诗意，让它们显得很有魔力。"},{"en":"Some critics say the novel poetised war and ignored its suffering.","zh":"一些评论家说这部小说把战争浪漫化（诗意化）了，忽视了其中的苦难。"}]}],"synonyms":["poetized","romanticized","idealized","lyricized","embellished"],"phonetic":"/ˈpoʊətaɪzd/","extraExplanation":["“poetised”是英式拼写；美式更常写作“poetized”。两者意思相同。","这个词常带有“美化/浪漫化”的隐含评价：可以是中性（让文字更有诗意），也可能是批评（把现实写得过于美好、失真）。","相关词：poetise/poetize（动词），poetic（形容词：诗意的），romanticize（更常用、偏“浪漫化/理想化”的动词）。"]}
{"word":"poetiser","summary":{"en":"Poetiser means a person who writes poetry or speaks/writes in a poetic way, sometimes too romantically.","zh":"poetiser 指写诗的人或习惯用诗意方式表达的人；有时也指把现实过度浪漫化的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes poetry or who tends to express ideas in a poetic, imaginative way","zh":"写诗的人；（也可指）喜欢用诗意、富于想象的方式表达的人"},"examples":[{"en":"He’s a poetiser at heart, even in his emails.","zh":"他骨子里就是个“诗化表达的人”，连发邮件都很有诗意。"},{"en":"Some critics called the novelist a poetiser because of her lyrical style.","zh":"一些评论家称这位小说家为“诗化者”，因为她的文风很抒情。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who makes something sound more poetic than it really is, sometimes in an unrealistic or overly romantic way","zh":"把事物说得过于诗意的人；（有时带贬义）过度浪漫化、脱离现实的人"},"examples":[{"en":"Don’t be a poetiser—tell us what actually happened.","zh":"别太“诗化”了——说说到底发生了什么。"},{"en":"He’s a poetiser of history, turning messy events into neat moral stories.","zh":"他常把历史“诗化”，把复杂混乱的事件讲成整齐的道德故事。"}]}],"synonyms":["poet","verse-writer","rhymer","romanticizer","idealizer"],"phonetic":"/ˈpoʊəˌtaɪzər/","extraExplanation":["“poetiser”较少见，更常见的形式是英式拼写“poetiser”，美式拼写多为“poetizer”。它来自动词“poetise/poetize”（把……写得像诗一样、使……带诗意）。","在文学评论里，“poetiser”有时带轻微贬义，暗示作者把现实写得过度抒情或不够准确。"]}
{"word":"poetisers","summary":{"en":"“Poetisers” means people who poetize—write or speak in a poetic (sometimes overly poetic) style.","zh":"“poetisers”指“诗化表达的人”：写诗或用很诗意（有时偏矫饰）的方式表达的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes poems or speaks/writes in a highly poetic (often overly poetic) way; someone who “poetizes.”","zh":"写诗的人；或用非常诗意（有时偏矫饰、过度诗意）的方式说话/写作的人；“诗化表达者”。"},"examples":[{"en":"Some critics dismissed him as a poetiser rather than a serious poet.","zh":"一些评论家认为他只是个爱卖弄诗意的人，而不是严肃的诗人。"},{"en":"In her letters, she was a gentle poetiser, turning everyday moments into images.","zh":"在她的书信里，她温柔地把日常时刻写得很有画面感，像个诗化表达者。"}]}],"synonyms":["poet","poetizer","versifier","rhymer","poetaster"],"phonetic":"/ˈpoʊəˌtaɪzər/","extraExplanation":["“poetiser”更常见于英式拼写；美式拼写通常是“poetizer”。词根来自“poetize”（使语言诗化、用诗意表达）。在评论语境中，它有时带一点贬义，暗示“华丽但不够深刻/不够扎实”。"]}
{"word":"poetises","summary":{"en":"“Poetises” means “writes poetry” or “describes something in a poetic way,” and it can also mean “idealizes/romanticizes” something.","zh":"“poetises”指“写诗”或“用诗意方式表达”，也可指“把某事理想化/浪漫化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “poetise”) to write poetry, or to express something in a poetic way.","zh":"（“poetise”的第三人称单数）写诗；或用诗意的方式表达（某事）。"},"examples":[{"en":"She poetises everyday moments, turning a simple walk into a small story.","zh":"她把日常时刻写得很有诗意，把一次普通的散步变成了一个小故事。"},{"en":"He poetises about the sea in his journal.","zh":"他在日记里用诗意的文字描写大海。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) to make someone or something seem more romantic, noble, or ideal than it really is.","zh":"（较少见）把某人或某事写得/说得过于浪漫、高尚或理想化。"},"examples":[{"en":"The film poetises the past and ignores its hardships.","zh":"这部电影把过去理想化了，忽略了其中的艰难。"},{"en":"Some biographies poetise their subjects instead of showing their flaws.","zh":"有些传记把人物写得过于完美，而不呈现他们的缺点。"}]}],"synonyms":["poetizes","writes poetry","describes poetically","romanticizes","idealizes"],"phonetic":"/ˈpoʊəˌtaɪzɪz/","extraExplanation":["“poetises”是英式拼写（BrE）；美式更常见写法是“poetizes”。两者意思相同。","这个词在日常口语里不算高频，更常见的替代表达有“write poetry / describe poetically / romanticize”。","含义2容易与“romanticize（浪漫化）”重叠：当强调把现实说得更美、更理想时，用“romanticize”更常见；当强调语言风格变得像诗一样，则“poetise/poetize”更贴切。"]}
{"word":"poetising","summary":{"en":"“Poetising” means creating poetry or expressing something in a poetic, imaginative way.","zh":"“poetising”指创作诗歌，或用诗意、富想象力的方式表达事物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"writing or speaking in a poetic way; creating poetry or turning ideas into poetic language (present participle/gerund of \"poetise/poetize\")","zh":"用诗意的方式写作或表达；创作诗歌，或把想法变成诗性的语言（“poetise/poetize”的现在分词/动名词）"},"examples":[{"en":"She spent the evening poetising about the sea and the sky.","zh":"她用一整个晚上以诗意描写大海和天空。"},{"en":"He’s always poetising—everything sounds like a poem when he talks.","zh":"他总爱诗意化表达——他说话时什么都像在念诗。"},{"en":"The book is more about poetising everyday life than telling a strict story.","zh":"这本书与其说在讲一个严谨的故事，不如说是在把日常生活诗意化。"}]}],"synonyms":["poetizing","writing poetry","speaking poetically","versifying","romanticizing"],"phonetic":"/ˈpoʊəˌtaɪzɪŋ/","extraExplanation":["“poetising”是英式拼写；美式更常写作“poetizing”。两者意思相同，但在现代英语里都不算高频，更常见的表达有“write poetry / speak poetically / romanticize”。","“poetise/poetize”有时带一点评价意味：可以是赞美（把语言说得很美），也可能是轻微批评（把事情说得过于浪漫、不够实际）。"]}
{"word":"poetito","summary":{"en":"“Poetito” means “little poet” (Spanish diminutive), often used playfully or teasingly.","zh":"“poetito”意为“小诗人”（西班牙语指小词），常用于亲昵或调侃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Spanish diminutive meaning “little poet.” In English contexts, it may be used playfully or slightly dismissively to refer to someone who writes poetry or acts overly poetic.","zh":"西班牙语的指小词，意思是“小诗人”。在英语语境中偶尔借用，可能带有亲昵、玩笑，或略带贬义地指“自以为很诗意的人/写诗的人”。"},"examples":[{"en":"He calls himself a poetito, but he’s just starting to write.","zh":"他自称“poetito”，不过他才刚开始写作。"},{"en":"Don’t be a poetito—just tell me what you really mean.","zh":"别当“poetito”了——直接说你真正想表达的意思。"}]}],"synonyms":["little poet","aspiring poet","wannabe poet","poet (informal use)"],"phonetic":"/poʊˈɛtitoʊ/","extraExplanation":["“-ito”是西班牙语里很常见的指小/昵称后缀（diminutive），常表达“小、可爱、亲昵”，有时也会带一点轻微的贬义或调侃。poetito = poeta（诗人）+ -ito。","在标准英语词典里“poetito”不算常见英语词，更多是西语借用或双语语境里的玩笑说法。正式英语通常用“poet”“aspiring poet（有志成为诗人的人）”“wannabe poet（想当诗人/略带嘲讽）”。"]}
{"word":"poetization","summary":{"en":"Poetization means making something more poetic or turning it into a poetic form.","zh":"Poetization 指把表达变得更有诗意，或把内容诗化成更像诗的形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something poetic in style or expression; turning ideas, language, or events into poetry or a more lyrical form","zh":"诗化；诗意化：把某事物的表达变得更有诗意、抒情，或将内容改写成诗（或更像诗的语言）的过程"},"examples":[{"en":"The poetization of everyday speech can make a simple story feel memorable.","zh":"把日常语言诗化，会让一个简单的故事更令人难忘。"},{"en":"In her novel, the poetization of the city turns streets and buildings into symbols.","zh":"在她的小说里，对城市的诗意化让街道和建筑变成了象征。"}]}],"synonyms":["poeticization","poeticizing","versification (when turning into verse)","lyricization (less common)"],"phonetic":"/ˌpoʊətəˈzeɪʃən/","extraExplanation":["“poetization”在现代英语中相对少见，更常见的表达是“poeticization”或动词“to poeticize”（使……诗化）。在学术写作（文学批评、艺术评论）里会更常遇到，用来强调一种“把现实提升为诗意表达”的创作/改写策略。","词根提示：poet（诗人/诗）+ -ize（使……）+ -ation（行为/过程）。因此它通常指“过程/做法”，而不仅仅是“诗意的感觉”。"]}
{"word":"poetize","summary":{"en":"Poetize means to express something in a poetic style, or to romanticize/idealize it.","zh":"poetize 指用诗意的方式表达，也可指把事物浪漫化、理想化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to express something in a poetic way; to make language sound like poetry (often by adding imagery, rhythm, or emotion)","zh":"用诗意的方式表达；把语言写得像诗一样（常通过意象、节奏或情感）"},"examples":[{"en":"In her diary, she tends to poetize ordinary moments like drinking tea.","zh":"在日记里，她常把喝茶这种平凡时刻写得很有诗意。"},{"en":"The author poetized the city, describing its streets as “rivers of light.”","zh":"作者把这座城市写得诗意盎然，把街道描写成“光的河流”。"}]},{"partOfSpeech":"v.","definition":{"en":"to describe something in an idealized or romantic way, sometimes ignoring reality","zh":"把某事描写得过于理想化或浪漫化（有时会忽略现实）"},"examples":[{"en":"It’s easy to poetize the past and forget how difficult it actually was.","zh":"人很容易把过去浪漫化，而忘了当时其实有多艰难。"},{"en":"He poetized life on the road, but the long hours were exhausting.","zh":"他把在路上的生活说得很浪漫，但长时间奔波其实很累。"}]}],"synonyms":["write poetically","romanticize","idealize","lyricize"],"phonetic":"/ˈpoʊəˌtaɪz/","extraExplanation":["“poetize”比较偏书面、文学语气，在日常口语里更常用：write poetically（写得很诗意）、romanticize（浪漫化）、idealize（理想化）。","词源上来自“poet（诗人）+ -ize（使……化）”，意思就是“使之成为诗/变得像诗”。常用于评论写作风格：poetize nature / poetize the city / poetize experience。"]}
{"word":"poetized","summary":{"en":"“Poetized” means made something poetic or turned it into poetry; it can also mean idealized something in an overly romantic way.","zh":"“Poetized”指把某事写得富有诗意或写成诗；也可指用过度浪漫、理想化的方式美化现实。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “poetize”) to make something sound poetic, or to turn ideas/events into poetry.","zh":"（poetize 的过去式/过去分词）把某事写得富有诗意；把思想或事件写成诗。"},"examples":[{"en":"The novelist poetized the city’s noise into a kind of music.","zh":"这位小说家把城市的喧嚣诗化成了一种音乐。"},{"en":"In her journal, she poetized her grief to make it easier to face.","zh":"在日记里，她把悲伤诗化，让自己更容易面对。"}]},{"partOfSpeech":"vt.","definition":{"en":"to describe something in an idealized, overly romantic, or unrealistically beautiful way.","zh":"用过于浪漫、理想化的方式描写（有时带点不切实际或夸张的意味）。"},"examples":[{"en":"He poetized the past and forgot how difficult life really was.","zh":"他把过去诗化了，忘了生活其实有多艰难。"},{"en":"The speech poetized war, ignoring its human cost.","zh":"那篇演讲把战争诗化了，忽视了它的人道代价。"}]}],"synonyms":["made poetic","turned into poetry","versified","romanticized","idealized"],"phonetic":"/ˈpoʊəˌtaɪzd/","extraExplanation":["“poetized”来自动词“poetize”，在现代英语里相对少见，更常见的表达是“made it poetic / romanticized / idealized / turned into poetry”。","美式拼写是 poetize；英式常见 poetise。这个词既可褒义（把语言写得更有诗意），也可含贬义（把现实过度美化）。"]}
{"word":"poetizer","summary":{"en":"“Poetizer” is a rare/informal noun meaning someone—or sometimes a tool—that turns ordinary language into poetry or a poetic style.","zh":"“Poetizer”是较少见/非正式名词，指把普通语言写成诗或变得更有诗意的人；有时也指实现这种改写的工具/应用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who poetizes—someone who turns ideas, stories, or ordinary language into poetry (a rare or informal word).","zh":"写诗的人；把想法、故事或普通语言“诗化”的人（较少见/非正式用法）。"},"examples":[{"en":"He’s a natural poetizer, always turning small moments into verse.","zh":"他天生会诗化，总能把生活小片段写成诗。"},{"en":"The poetizer described the city in a way that felt musical and vivid.","zh":"这位诗化者描写城市的方式很有音乐感，也很生动。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or app that “poetizes” text—rewriting plain sentences in a more poetic style (modern, informal usage).","zh":"把文字“诗化”的工具/应用：将普通句子改写成更有诗意的风格（现代、非正式用法）。"},"examples":[{"en":"I used a poetizer to turn my diary entry into a short poem.","zh":"我用一个“诗化工具”把日记改写成了一首短诗。"},{"en":"The poetizer made the message sound more romantic, but it also changed the meaning a little.","zh":"这个诗化工具让信息更浪漫，但也稍微改变了原意。"}]}],"synonyms":["poet","poetaster (often negative)","verse writer","poetizing tool","poetry generator"],"phonetic":"/ˈpoʊəˌtaɪzər/","extraExplanation":["“poetizer”通常来自动词“poetize”（把……写成诗/用诗意表达）+ 表示人的后缀“-er”。在传统词典里不算常用词，更常见的是“poet”（诗人）或“poetize”（动词）。","如果你是在某个产品、网站或社群里看到“Poetizer”作为名称，它也可能是专有名词（品牌/账号/项目名），意思往往就是“让文字变得更诗意的人或工具”。"]}
{"word":"poetizers","summary":{"en":"“Poetizers” means people who poetize—turning things into poetry or making language sound poetic (sometimes overly so).","zh":"“poetizers”指“诗化者”：把事物写成诗或用诗意语言表达的人（有时暗含“过度诗化”的意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who poetize; people who turn ordinary ideas or events into poetry or poetic language","zh":"把普通事物写成诗/用诗意语言表达的人；诗化者"},"examples":[{"en":"In the workshop, the poetizers tried to describe a city street as if it were a dream.","zh":"在工作坊里，这些诗化者试着把城市街道写得像梦一样。"},{"en":"Some critics say the film’s dialogue was written by poetizers, not realistic speakers.","zh":"一些评论家说，这部电影的对白像是诗化者写的，而不是现实中人会说的话。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, often humorous or critical) writers who make something sound overly poetic or romantic","zh":"（罕见，常带调侃或批评）把东西写得过于诗意/过度浪漫的人"},"examples":[{"en":"He joked that only poetizers could make a tax report sound beautiful.","zh":"他开玩笑说，只有过度诗化的人才会把税务报告写得好听。"},{"en":"The editor warned the poetizers to keep the language clear for everyday readers.","zh":"编辑提醒那些写得太诗化的人，要为普通读者保持语言清晰。"}]}],"synonyms":["poets","poetizers (plural)","people who poetize","versifiers","romanticizers"],"phonetic":"/ˈpoʊəˌtaɪzərz/","extraExplanation":["“poetizers”是复数形式，单数是“poetizer”。它来自动词“poetize”（把……写成诗/诗化），后缀“-er/-izer”表示“做这件事的人”。","这个词在日常英语里不常见；更常见的说法是“poets”（诗人）或“people who poetize”（把……诗化的人）。当它出现时，语气有时带一点幽默或轻微的批评。"]}
{"word":"poetizes","summary":{"en":"“Poetizes” means (1) writes poetry or (2) describes something in a poetic, often idealized way.","zh":"“poetizes”表示（1）写诗；或（2）以诗意方式描写事物，常带浪漫化/理想化色彩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to write poetry; to compose poems","zh":"写诗；创作诗歌"},"examples":[{"en":"She poetizes about the seasons and the sea.","zh":"她以四季与大海为题写诗。"},{"en":"He poetizes in his spare time, but he works as a teacher.","zh":"他业余写诗，但他的工作是老师。"}]},{"partOfSpeech":"v.","definition":{"en":"to describe something in a poetic way, often by romanticizing or idealizing it","zh":"用诗意的方式描写（常带有浪漫化或理想化的意味）"},"examples":[{"en":"The ad poetizes everyday life to make the product feel magical.","zh":"这则广告把日常生活写得很诗意，让产品显得很“梦幻”。"},{"en":"She poetizes his past, forgetting the difficult parts.","zh":"她把他的过去写得很浪漫，忽略了艰难的部分。"},{"en":"Critics said the film poetizes war instead of showing its reality.","zh":"评论家说这部电影把战争拍得过于诗意，而不是呈现其真实面貌。"}]}],"synonyms":["write poetry","compose","versify","romanticize","idealize","poeticize"],"phonetic":"/ˈpoʊətaɪz/","extraExplanation":["“poetizes”是动词“poetize”的第三人称单数现在时（he/she/it poetizes）。","英式拼写常见为“poetise”，美式更常用“poetize”。两者意思相同。"]}
{"word":"poetizing","summary":{"en":"“Poetizing” means using poetic language or making something sound like poetry, sometimes overly romanticizing it.","zh":"“Poetizing”指用诗意语言表达或把事物诗化；有时也含“过度浪漫化/矫情”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"writing, speaking, or thinking in a poetic style; making something sound more like poetry (present participle of “poetize”).","zh":"用诗意的方式写作、说话或思考；把事物写得/说得更像诗（“poetize”的现在分词）。"},"examples":[{"en":"She spent the evening poetizing about the sea and the moon.","zh":"她整个晚上都在用诗意的语言描写大海和月亮。"},{"en":"The ad is poetizing everyday life to make the product feel magical.","zh":"这则广告在把日常生活“诗化”，让产品显得很有魔力。"},{"en":"Stop poetizing and tell me what actually happened.","zh":"别再诗意化了，直接告诉我到底发生了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of using poetic language, sometimes in an over-romantic or unrealistic way.","zh":"使用诗化语言的行为或习惯；有时指过度浪漫化、脱离现实的表达。"},"examples":[{"en":"His poetizing can be beautiful, but it sometimes hides the real problem.","zh":"他的诗化表达很美，但有时会掩盖真正的问题。"},{"en":"There was a lot of poetizing in the speech, but few concrete plans.","zh":"演讲里有很多诗意化的辞藻，但几乎没有具体计划。"}]}],"synonyms":["writing poetically","romanticizing","idealizing","versifying","poeticizing"],"phonetic":"/ˈpoʊəˌtaɪzɪŋ/","extraExplanation":["“poetize/poetizing”在现代英语里不算高频，常见于评论写作风格（比如文学评论、演讲点评、广告分析）。","它既可以是褒义（“富有诗意、动人”），也可能带一点贬义（“矫情、过度美化现实”），要看语境与语气。"]}
{"word":"poetless","summary":{"en":"Poetless means “without a poet” or “lacking poets/poetic voices,” and it’s a rare, literary-sounding adjective.","zh":"poetless 指“没有诗人”或“缺乏诗人/诗意声音”，是较少见、偏文学语感的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no poet; lacking poets or poetic voices.","zh":"没有诗人（的）；缺乏诗人或诗意声音的。"},"examples":[{"en":"After the war, the city felt poetless, as if no one could put grief into words.","zh":"战后，这座城市显得“没有诗人”，仿佛没人能把悲伤写成文字。"},{"en":"He described the new cultural scene as poetless and overly commercial.","zh":"他形容新的文化氛围“缺乏诗人气质”，过于商业化。"}]}],"synonyms":["without poets","lacking poets","unpoetic","prosaic"],"phonetic":"ˈpoʊətləs","extraExplanation":["“poetless”是一个相对少见的形容词，由“poet + -less（没有……的）”构成，常用于较有文学感的写作中，用来强调某个时代、地方或环境“缺少诗人/缺少诗意表达”。日常口语里更常说“without poets”或“lacking poetry/poetic voices”。"]}
{"word":"poetlike","summary":{"en":"Poetlike means “poetic” or “like a poet in style or feeling.”","zh":"poetlike 意为“富有诗意的；像诗人那样的（风格/气质）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities that remind you of a poet or poetry (imaginative, lyrical, expressive, or beautifully worded).","zh":"像诗人/诗歌的；富有诗意的（富于想象、抒情、表达优美等）。"},"examples":[{"en":"Her poetlike description made the city feel magical.","zh":"她富有诗意的描写让这座城市显得很神奇。"},{"en":"He spoke in a poetlike way, using images and gentle rhythm.","zh":"他说话很有诗意，用了意象和柔和的节奏。"},{"en":"The novel has a poetlike style, even in ordinary scenes.","zh":"这部小说的文风很有诗意，即使在平常的场景里也是如此。"}]}],"synonyms":["poetic","lyrical","imaginative","expressive","rhapsodic"],"phonetic":"/ˈpoʊətˌlaɪk/","extraExplanation":["“poetlike”由“poet + -like”构成，意思是“像……一样”。更常见的拼写是带连字符的“poet-like”，尤其在正式写作中；不带连字符的形式也能见到。","近义表达中，“poetic”最常用，语气更自然；“poetlike/poet-like”更强调“像诗人那样的风格或气质”。"]}
{"word":"poetling","summary":{"en":"A “poetling” is a young, beginner, or minor poet, sometimes said with affection and sometimes with mild contempt.","zh":"“poetling”指年轻/新手/不太重要的诗人，可带亲昵，也可能略带轻视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young, beginner, or minor poet (often used affectionately or slightly dismissively).","zh":"小诗人；新手诗人；（有时带亲昵或略带轻视的）小有名气/不太重要的诗人。"},"examples":[{"en":"The magazine encourages poetlings to submit their first poems.","zh":"这本杂志鼓励新手诗人投稿他们的第一批诗作。"},{"en":"He called himself a poetling, still learning how to shape images into lines.","zh":"他称自己只是个小诗人，还在学习如何把意象雕成诗行。"},{"en":"The critic dismissed them as poetlings chasing fame instead of craft.","zh":"评论家把他们贬为追名逐利而不重技艺的小诗人。"}]}],"synonyms":["young poet","aspiring poet","beginner poet","minor poet","poetaster"],"phonetic":"/ˈpoʊətlɪŋ/","extraExplanation":["“poetling”由“poet（诗人）+ -ling”构成，-ling 常表示“幼小/初学者/小型”，也可能带一点轻视或戏谑的语气（如 duckling 小鸭、underling 小喽啰）。因此这个词的态度取决于语境：可以是鼓励性的自称，也可以是批评性的称呼。","该词在现代日常英语中不常见，更可能出现在文学评论、带幽默感的写作或较正式/复古的语境里。"]}
{"word":"poetly","summary":{"en":"“Poetly” is an uncommon/archaic word meaning “poetic,” and it is often a misspelling of “poetry” or “poetic.”","zh":"“poetly”是少见/古体用法，意思接近“poetic（诗意的）”，也常被当作“poetry/poetic”的拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon/archaic) poetic; having the style or qualities of a poet.","zh":"（少见/古体）诗意的；具有诗人风格或诗歌特质的。"},"examples":[{"en":"The novel has a poetly tone, full of vivid images and rhythm.","zh":"这部小说带有诗意的语调，充满生动的意象和节奏感。"},{"en":"He wrote in a simple but poetly way.","zh":"他用朴素却富有诗意的方式写作。"}]},{"partOfSpeech":"other","definition":{"en":"(Often a misspelling) People usually mean “poetry” (the art of poems) or “poetical/poetic” (poem-like).","zh":"（常见拼写错误）人们通常想写的是“poetry”（诗歌/诗艺）或“poetic/poetical”（诗一般的）。"},"examples":[{"en":"I love poetry, especially short modern poems.","zh":"我喜欢诗歌，尤其是现代短诗。"},{"en":"The sunset looked poetic in the soft light.","zh":"在柔和的光线下，日落看起来很有诗意。"}]}],"synonyms":["poetic","poetical","lyrical"],"phonetic":"/ˈpoʊətli/","extraExplanation":["“poetly”在现代英语里非常少用，容易被当作拼写错误。更自然、常用的表达是：\n- poetry（名词）：诗歌/诗艺\n- poetic / poetical（形容词）：诗意的、富有诗歌气质的\n- poetically（副词）：诗意地","phonetic_note: “poetly”更像“poetic”的少见变体，写作或考试中建议避免使用，改用poetic/poetry更稳妥。"]}
{"word":"poetomachia","summary":{"en":"Poetomachia means a “battle” or feud among poets, often expressed through satire or critical writing.","zh":"Poetomachia 指诗人（或作家）之间的“论战/恩怨”，常通过讽刺或批评性的写作表现出来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quarrel, rivalry, or “battle” among poets (or, more broadly, writers), often carried out through poems, satire, or public criticism","zh":"诗人之间的争斗、竞争或“论战”（也可泛指作家之间的文坛争执），常通过诗作、讽刺或公开批评来进行"},"examples":[{"en":"The magazine chronicled a long poetomachia between two rival groups of poets.","zh":"那本杂志记录了两派诗人之间持续已久的诗坛论战。"},{"en":"Their poetomachia spilled onto social media, with each side posting sharp verses.","zh":"他们的诗人论战蔓延到社交媒体上，双方都发布尖刻的诗句。"},{"en":"Some critics view satire as a traditional weapon in poetomachia.","zh":"一些评论家认为，讽刺是诗人论战中的传统武器。"}]}],"synonyms":["poetic feud","literary quarrel","rivalry","flyting"],"phonetic":"/ˌpoʊətoʊˈmeɪkiə/","extraExplanation":["词源来自希腊语：poetēs（诗人）+ machia（战斗、争斗），字面意思就是“诗人之战”。","这是一个较少见、偏学术/文学评论用语的词；日常英语里更常用 poetic feud（诗坛恩怨）、literary quarrel（文坛争执）等说法。","在文学史里，诗人/作家之间以诗、讽刺文、檄文互相攻击的传统，在一些文化中也被称为“以文相骂”的论战形式；英语里相近概念还有 flyting（以诗互骂的传统，尤见于苏格兰与北欧文化语境）。"]}
{"word":"poetress","summary":{"en":"“Poetress” (more commonly “poetess”) means a woman poet, but it is often considered dated; today “poet” is usually preferred.","zh":"“poetress”（更常见写法为“poetess”）指女诗人，但常被认为过时；如今通常直接用“poet（诗人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who writes poetry (a feminine form of “poet,” now often considered old-fashioned or unnecessary).","zh":"女诗人（“poet”的阴性形式；如今常被认为过时或不必要）。"},"examples":[{"en":"She was called a poetess in old reviews, but today most critics simply say “poet.”","zh":"旧时的评论称她为“poetess（女诗人）”，但如今大多数评论家会直接说“poet（诗人）”。"},{"en":"Many writers prefer the word “poet” because it avoids separating women from other poets.","zh":"许多写作者更喜欢用“poet（诗人）”，因为它避免把女性与其他诗人区分开来。"}]}],"synonyms":["poet","woman poet","female poet"],"phonetic":"/ˈpoʊətrəs/","extraExplanation":["“poetess”在19世纪及更早时期较常见，用来强调写诗者是女性；但在现代英语里，很多人觉得它带有性别标记，可能暗示“女性诗人是特殊类别”，因此在正式写作或当代语境中通常用“poet”。","如果你在阅读经典文学评论、旧报刊、或历史语境中看到“poetess”，多半只是时代用语；在当代自我介绍时，用“poet”更自然、更普遍。"]}
{"word":"poetries","summary":{"en":"“Poetries” is the less common plural of “poetry,” meaning poems or collections/bodies of poetic writing.","zh":"“poetries”是“poetry”较少见的复数形式，常指诗作或诗歌作品（合集/不同种类的诗歌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “poetry”; poems or bodies/collections of poetic writing (used mainly in literary, academic, or stylistic contexts).","zh":"“poetry”的复数；指“诗作、诗歌作品（合集）”（多见于文学、学术或强调“不同种类/不同作者诗歌”时的用法）。"},"examples":[{"en":"The library has a section for modern poetries from around the world.","zh":"图书馆有一个专区收藏世界各地的现代诗作。"},{"en":"Her early poetries are more personal than her later work.","zh":"她早期的诗作比后期作品更私人、更抒情。"}]}],"synonyms":["poems","poetic works","collections of poetry","verse"],"phonetic":"ˈpoʊətriz","extraExplanation":["“poetry”在日常英语里通常是不可数名词（I like poetry. 我喜欢诗歌），所以一般不说“two poetries”。“poetries”多用于强调“不同类型/不同群体的诗歌”或“若干诗作/诗集”，语感更偏书面、文学或学术。日常表达里更常用：poems（诗，复数）/ collections of poetry（诗集）/ works of poetry（诗作）。"]}
{"word":"poetry","summary":{"en":"Poetry is writing that uses rhythm, sound, and imagery to express meaning and emotion; it can also mean a poetic beauty in something.","zh":"Poetry 指用节奏、音韵与意象来表达意义与情感的诗歌，也可指事物中“诗意的美感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Literature written in lines and patterns of sound and rhythm, often using vivid language and imagery to express feelings or ideas.","zh":"诗歌：以分行、节奏与音韵等形式写成的文学作品，常用形象化语言与意象来表达情感或思想。"},"examples":[{"en":"She fell in love with poetry in high school because it said so much in so few words.","zh":"她在高中爱上诗歌，因为它能用很少的词表达很多意思。"},{"en":"This poem uses nature imagery to describe loneliness.","zh":"这首诗用自然意象来描写孤独。"}]},{"partOfSpeech":"n.","definition":{"en":"A beautiful or expressive quality in language, art, or life (not only in poems).","zh":"诗意（不只指诗本身）：语言、艺术或生活中优美而富于表现力的气质。"},"examples":[{"en":"There is poetry in the way he describes ordinary things.","zh":"他描述平凡事物的方式很有诗意。"},{"en":"The film has a quiet poetry that stays with you.","zh":"这部电影有一种安静的诗意，会让人回味。"}]}],"synonyms":["verse","poems","poetic writing","lyricism"],"phonetic":"/ˈpoʊətri/","extraExplanation":["“Poetry”在英语里通常是不可数名词（I like poetry），但也可以用复数“poetries”来强调“不同类型/传统的诗歌”（如 world poetries），这种用法更偏学术或文学评论。","常见搭配：write poetry（写诗）、read poetry（读诗）、poetry reading（诗歌朗诵会）、spoken-word poetry（口语表演诗）、poetry slam（诗歌擂台/比赛）。","文学文化提示：英语文学中常把莎士比亚（Shakespeare）的十四行诗（sonnets）和华兹华斯（Wordsworth）等浪漫主义诗人的作品当作经典例子；学习时可从短诗或押韵明显的诗入门，更容易感受节奏与意象。"]}
{"word":"poetryless","summary":{"en":"“Poetryless” means lacking poetry or poetic feeling—plain, unromantic, or unlyrical.","zh":"“poetryless”指缺乏诗意或诗歌般的情感与美感，显得平淡、不浪漫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without poetry or poetic quality; lacking imagination, beauty, or lyric feeling (often describing writing, speech, or life).","zh":"没有诗意的；缺乏诗歌般的想象力、美感或抒情气质的（常形容文字、语言或生活）。"},"examples":[{"en":"His report was clear but poetryless, so it didn’t move the audience.","zh":"他的报告很清晰，但缺乏诗意，所以没能打动听众。"},{"en":"After the renovation, the café felt clean but poetryless.","zh":"翻新后，这家咖啡馆很干净，但少了诗意。"},{"en":"She wanted a simple style, not a poetryless tone.","zh":"她想要一种朴素的风格，而不是毫无诗意的语气。"}]}],"synonyms":["unpoetic","prosaic","matter-of-fact","uninspired"],"phonetic":"/ˈpoʊətriˌlɛs/","extraExplanation":["“poetryless”不是特别常见的固定词，更像是由 poetry + -less（“没有……的”）临时组合出来的形容词，用来强调“缺少诗意/浪漫/抒情的感觉”。在正式写作中，更常用的替代词包括：unpoetic（不诗意的）、prosaic（平淡无奇的/散文式的）、matter-of-fact（就事论事的）、uninspired（缺乏灵感的）。"]}
{"word":"poets","summary":{"en":"“Poets” means more than one poet—people who write poetry.","zh":"“poets”指多个诗人，即写诗（诗歌）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of poet: people who write poems (poetry), often using imaginative language, rhythm, and vivid images.","zh":"poet 的复数：诗人；写诗（诗歌）的人，常用富有想象力的语言、节奏和生动意象来表达情感与思想。"},"examples":[{"en":"Many poets write about love, nature, or everyday life.","zh":"许多诗人会写爱情、自然或日常生活。"},{"en":"We studied modern poets in English class.","zh":"我们在英语课上学习了现代诗人。"},{"en":"The festival invited poets from around the world.","zh":"这个节日邀请了来自世界各地的诗人。"}]}],"synonyms":["poetry writers","bards","verse writers","rhyme-makers"],"phonetic":"ˈpoʊɪts","extraExplanation":["“poets”是可数名词复数形式；单数是“poet”。如果你要说“某个诗人的作品”，常用“a poet’s work/poems”。","在英语里，poet不一定只写“押韵诗”，也可以写自由诗（free verse）。常见搭配：poet laureate（桂冠诗人）、spoken-word poets（口语诗/朗诵诗诗人）。"]}
{"word":"poetship","summary":{"en":"Poetship means the status or official position of being a poet, often a poet laureate.","zh":"Poetship 指作为诗人的身份或正式职位，常指桂冠诗人之类的官方诗人职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, title, or status of being a poet (especially an officially recognized poet, such as a poet laureate)","zh":"诗人的身份、地位或职位（尤指被官方认可的诗人，如桂冠诗人）"},"examples":[{"en":"She accepted the poetship with humility and promised to write for the whole nation.","zh":"她谦逊地接受了桂冠诗人的职位，并承诺为整个国家写作。"},{"en":"His poetship brought him public attention, but he still preferred a quiet life.","zh":"他的诗人身份让他受到公众关注，但他仍然更喜欢安静的生活。"}]}],"synonyms":["poetry laureateship","poet laureateship","poethood","poetic office"],"phonetic":"/ˈpoʊətʃɪp/","extraExplanation":["“poetship”由“poet（诗人）+ -ship”构成。后缀“-ship”常表示“身份/地位/职务/状态”，如 friendship（友谊）、leadership（领导力/领导地位）、membership（会员资格）。因此 poetship 常带有“身份或正式职位”的语感，而不仅仅是“写诗这件事”。","在现代英语中，“poetship”不算高频词，更常见的表达是“the role/position of poet laureate（桂冠诗人的职位）”或直接说“being a poet（当诗人）”。"]}
{"word":"poetwise","summary":{"en":"Poetwise means “in a poet-like, poetic way.” It’s rare and often used playfully.","zh":"poetwise 表示“以诗人的方式/带有诗意地”。这个词很少见，常带点文艺或玩笑式用法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a poet-like way; with the style, sensitivity, or imagination of a poet.","zh":"以诗人的方式；带有诗意地（指风格、感受力或想象力像诗人一样）。"},"examples":[{"en":"She described the city poetwise, turning ordinary streets into vivid images.","zh":"她用诗意的方式描写这座城市，把普通街道写得画面感十足。"},{"en":"He spoke poetwise about loss, choosing simple words that still felt deep.","zh":"他谈到失去时带着诗意，选用朴素的词却依然很有深度。"}]}],"synonyms":["poetically","in a poetic way","like a poet"],"phonetic":"/ˈpoʊətˌwaɪz/","extraExplanation":["“poetwise”非常少见，更多是带点幽默/文艺感的临时造词（creative coinage），在正式写作中不常用。","后缀“-wise”常表示“以……方式/就……而言”（如 clockwise 顺时针地，moneywise 就钱而言）。把它接在“poet”后面，就形成“像诗人那样地/诗意地”。","更常见、自然的替代表达包括：“poetically”（诗意地）、“like a poet”（像诗人一样）、“in a poetic way”（以诗意的方式）。"]}

