{"word":"pogamoggan","summary":{"en":"“Pogamoggan” is mainly used as a place name (often a river/lake) in northeastern North America.","zh":"“Pogamoggan”主要用作地名（常指河流/湖泊等），多见于北美东北部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name (place name), used in parts of northeastern North America for geographic features such as a river, lake, or local area","zh":"专有名词（地名）：在北美东北部部分地区使用，常指河流、湖泊或某一片地区等地理名称"},"examples":[{"en":"We went canoeing near the Pogamoggan River.","zh":"我们在波加莫根河附近划独木舟。"},{"en":"The trail map shows Pogamoggan Lake to the north.","zh":"步道地图显示北边有波加莫根湖。"}]}],"phonetic":"ˌpoʊɡəˈmɑɡən","extraExplanation":["“Pogamoggan”多见于加拿大/美国东北部的地名拼写之一（也可能出现相近的变体拼写）。这类地名往往来源于当地原住民语言的音译，因此在不同地图、年代或社区中拼写与读法可能略有差异。","如果你能告诉我它出现的具体语境（例如哪本书、哪张地图、哪个地区），我可以更准确地说明它指的是哪条河/哪个湖，以及更可靠的读音与背景。"]}
{"word":"pogey","summary":{"en":"“Pogey” is informal slang, most often meaning unemployment benefits/the unemployment office; it can also mean (older) a poorhouse, or (military) candy/snacks (“pogey bait”).","zh":"“pogey”是俚语，最常指失业救济金或失业救济机构；也可指（旧用法）救济院；在军队口语中还可指糖果零食（常见于“pogey bait”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly US/Canada) Unemployment benefits or the unemployment office; money given by the government when you don’t have a job.","zh":"（非正式，多见于美加）失业救济金；失业救济机构/办公室；指失业时政府发放的补助。"},"examples":[{"en":"After he was laid off, he went down to the pogey to file a claim.","zh":"他被裁员后，去失业救济办公室申请补助。"},{"en":"They lived on pogey for a few months while she looked for work.","zh":"她找工作期间，他们靠失业救济金过了几个月。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, informal) A poorhouse or a place for people with no money to live.","zh":"（过时，非正式）救济院；贫民收容所。"},"examples":[{"en":"In old stories, some feared ending up in the pogey if times got hard.","zh":"在一些老故事里，有人担心日子不好就会被送进救济院。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially in the military) Candy or snacks; often used in the phrase “pogey bait.”","zh":"（非正式，尤指军队用语）糖果、零食；常见于短语“pogey bait（零食/糖果）”。"},"examples":[{"en":"He stuffed his pack with pogey bait for the long march.","zh":"他在背包里塞满了零食，好撑过长途行军。"},{"en":"Do you have any pogey—gum or candy?","zh":"你有零食吗——口香糖或糖果之类的？"}]}],"synonyms":["unemployment benefits","unemployment office","the dole","welfare (context-dependent)","relief (old use)","snacks (for “pogey bait”)","candy (for “pogey bait”)"],"phonetic":"/ˈpoʊɡi/","extraExplanation":["“pogey”属于强烈口语/俚语色彩的词，不同地区含义可能不同：在美加语境里常指“失业救济/失业救济办公室”；在军队口语里更常见固定搭配“pogey bait”（零食、糖果）。","拼写上常与“pokey”混淆；“pokey”更常指“监狱”。如果你是在影视台词里看到的，可以提供句子，我可以帮你判断具体是哪一种用法。"]}
{"word":"pogeys","summary":{"en":"“Pogeys” is the plural of “pogey,” meaning either unemployment benefits (slang) or, in “pogey bait,” small snacks/candy.","zh":"“pogeys”是“pogey”的复数：可指（俚语）失业救济金/福利金；也可在“pogey bait”中指糖果或小零食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) Unemployment benefits or welfare money.","zh":"（俚语）失业救济金；福利金。"},"examples":[{"en":"After he got laid off, he had to live on pogeys for a few months.","zh":"他被裁员后，只能靠失业救济金过了几个月。"},{"en":"Some people wrongly assume anyone on pogeys is lazy.","zh":"有些人错误地以为领救济金的人都很懒。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, often in the phrase “pogey bait”) Candy or small snacks, especially ones carried by soldiers or sailors.","zh":"（俚语，常见于短语“pogey bait”）糖果或小零食，尤指士兵或水手随身带的零嘴。"},"examples":[{"en":"He packed some pogey bait—gum and chocolate—for the long trip.","zh":"他为长途旅行带了些“pogey bait”——口香糖和巧克力。"},{"en":"The crew shared pogeys during the night watch.","zh":"值夜班时，船员们一起分零食吃。"}]}],"synonyms":["unemployment benefits","welfare","relief","snacks","candy"],"phonetic":"/ˈpoʊɡi/","extraExplanation":["“pogeys”通常是名词复数，单数常写作“pogey”。在加拿大英语里，“pogey”指失业救济（也可拼作“pogey/pogey money”），语气偏口语，有时带一点轻微的贬义或刻板印象，用在正式场合要谨慎。","“pogey bait”在美军/海军口语中较常见，指能提神、解馋的小糖果零食；“bait”在这里不是“诱饵”的字面意思，而是口语里“拿来吃的东西”的感觉。"]}
{"word":"pogge","summary":{"en":"“Pogge” is mainly a surname, often referring to philosopher Thomas Pogge.","zh":"“Pogge”主要是一个姓氏，常指哲学家托马斯·波格。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), especially known from Thomas Pogge, a German-born philosopher and ethicist who writes about global justice and poverty.","zh":"一个姓氏（家族名）。较知名的是托马斯·波格（Thomas Pogge），德国出生的哲学家与伦理学者，研究全球正义与贫困问题。"},"examples":[{"en":"Thomas Pogge argues that wealthy countries have responsibilities in addressing global poverty.","zh":"托马斯·波格认为，富裕国家在应对全球贫困方面负有责任。"},{"en":"I’m reading an article by Pogge for my ethics class.","zh":"我正在读一篇波格写的文章，作为伦理学课的阅读材料。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈpɑːɡi/","extraExplanation":["“Pogge”通常作为专有名词使用（人名/姓氏），不是常见英语词汇，因此一般不用于日常口语表达。","如果你是在某个语境里看到“pogge”，也可能是拼写误差（例如想写“Pogge”人名，或误拼其他词）。可以把原句发来，我可以帮你判断意思。"]}
{"word":"poggies","summary":{"en":"‘Poggies’ most often means menhaden fish used as bait; in Canada it can also mean welfare/unemployment benefits.","zh":"“poggies”最常指用作鱼饵的鲱鲭鱼（menhaden）；在加拿大也可指社会/失业救济金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Small oily sea fish, especially menhaden, often used as bait or for making fish oil.","zh":"（复数）一种小型多脂的海鱼，尤指鲱鲭鱼（menhaden），常用作鱼饵或用来制鱼油。"},"examples":[{"en":"The captain bought a bucket of poggies to use as bait.","zh":"船长买了一桶poggies当鱼饵。"},{"en":"In some East Coast towns, people call menhaden ‘poggies.’","zh":"在美国东海岸一些地方，人们会把menhaden叫作“poggies”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Canada, informal) Welfare or unemployment benefits; welfare checks (variant spelling of ‘pogey’).","zh":"（加拿大，非正式）社会救济/失业救济金；救济支票（‘pogey’的变体拼写）。"},"examples":[{"en":"He was living on poggies for a few months after the layoff.","zh":"被裁员后，他靠救济金（poggies）过了几个月。"}]}],"synonyms":["menhaden","bunker","baitfish","welfare benefits (Canada)","unemployment benefits (Canada)"],"phonetic":"ˈpoʊɡiz","extraExplanation":["“poggies”更常见于口语与地区用法：在美国东海岸渔业语境里多指menhaden（也常叫bunker）。拼写上也会见到“pogies”。","加拿大的“pogey/pogies”属于俚语，指救济金/失业金；正式场合建议用“welfare benefits / unemployment benefits”。","相关表达：pogie bait（俚语）可指“零食/随身口粮”（海军或户外语境），也可能字面指“用作鱼饵的poggies”，需要看上下文。"]}
{"word":"poggy","summary":{"en":"“Poggy” is informal slang meaning “awesome/exciting,” or (regionally) a small oily fish like a menhaden.","zh":"“poggy”多作网络俚语表示“很棒/很燃/很兴奋”，也可（地区用法）指一种小型多油鱼类（menhaden，常拼作 pogie/pogy）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, internet slang) Excited, impressive, or “hype”; used as a cute/funny form of pog (“awesome!”).","zh":"（非正式，网络俚语）很兴奋、很厉害、很“燃”；常作为 pog（“太强了！”）的可爱/搞笑说法。"},"examples":[{"en":"That comeback was so poggy!","zh":"那个翻盘太 poggy 了！（太燃/太强了！）"},{"en":"The new update looks poggy, not gonna lie.","zh":"说实话，这次更新看起来挺 poggy 的。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional, especially in fishing contexts) A small oily fish; another name for a menhaden (often spelled pogie/pogy).","zh":"（地区用法，常见于钓鱼语境）一种小型多油的鱼；menhaden（美洲鲱/油鲱）的别称（更常拼作 pogie/pogy）。"},"examples":[{"en":"We used poggies as bait for striped bass.","zh":"我们用 poggy（油鲱）当饵钓条纹鲈。"},{"en":"The water was full of poggies near the dock.","zh":"码头附近水里全是 poggy（油鲱）鱼群。"}]}],"synonyms":["pog","hype (slang)","awesome (informal)","pogie/pogy (fish)"],"phonetic":"/ˈpɑɡi/","extraExplanation":["“poggy”在网络语境里通常来自“pog”（源于直播平台的表情/用法，表达兴奋、惊喜、觉得很强）。很多时候带有玩梗、卖萌的语气。","作为鱼名时，“poggy”多见于口语或地区说法，更常见的拼写是“pogie / pogy”。如果你是在游戏/聊天里看到，通常是第一个意思；在钓鱼/海边语境里更可能是第二个意思。"]}
{"word":"pogies","summary":{"en":"“Pogies” most commonly means insulated hand covers for handlebars or paddles; in some Canadian informal use, it can also refer to unemployment benefits.","zh":"“pogies”最常指用于车把或桨的保暖护手罩；在加拿大等地的非正式用法中也可指失业救济金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hand coverings (often insulated) that keep your hands warm while still letting you grip something, especially on a bicycle handlebar, paddle, or oar; also called “bar mitts.”","zh":"（常带保温层的）护手套/护手罩，尤其用于自行车把手、划桨或船桨上，保暖同时不妨碍握持；也常叫“bar mitts（把套手套）”。"},"examples":[{"en":"It was below freezing, so I put pogies on my handlebars for the ride to work.","zh":"气温低于零度，所以我在车把上装了pogies，骑车去上班更暖和。"},{"en":"Kayakers often use pogies because they can still feel the paddle while staying warm.","zh":"皮划艇玩家常用pogies，因为手还能感受到桨，同时又能保暖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Regional, informal—especially Canada) “Pogey”: unemployment benefits/welfare; “pogies” can be used jokingly to refer to those payments.","zh":"（地区用法，非正式——尤指加拿大）“pogey”指失业救济/福利金；“pogies”有时被戏称为这类补助。"},"examples":[{"en":"He was out of work for a while and living on pogies.","zh":"他失业了一阵子，靠救济金过日子。"}]}],"synonyms":["bar mitts","handlebar mitts","hand warmers","unemployment benefits (regional sense)"],"phonetic":"/ˈpoʊɡiz/","extraExplanation":["在户外运动语境里，pogies最常见的就是装在把手或桨上的“护手罩”，不是戴在手指上的传统手套；因此特别适合需要频繁握持、但又想保暖的人（通勤骑行、冬季骑行、皮划艇等）。","“pogey/ pogies”表示救济金的用法带明显地域色彩（加拿大英语更常见），在其他地区可能听起来陌生；正式场合建议用 unemployment benefits / welfare。"]}
{"word":"pogo","summary":{"en":"“Pogo” most often refers to a pogo stick (a bouncing toy) or the action of jumping up and down; it can also be the name of a classic American comic character.","zh":"“pogo”最常指“跳跳杆/弹簧跳跳杆”及其上下弹跳的动作；也可指美国经典连环漫画《Pogo》中的角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toy (pogo stick) that you stand on and bounce up and down using a spring","zh":"（pogo stick）弹簧跳跳杆；站在上面借助弹簧上下弹跳的玩具"},"examples":[{"en":"He learned to balance on a pogo stick in the driveway.","zh":"他在车道上学会了在跳跳杆上保持平衡。"},{"en":"Kids were bouncing on pogo sticks in the park.","zh":"孩子们在公园里玩跳跳杆，蹦来蹦去。"}]},{"partOfSpeech":"v.","definition":{"en":"to jump up and down repeatedly, especially in an energetic way (often in music crowds)","zh":"（反复）上下跳动；（尤指在音乐现场人群中）兴奋地原地蹦跳"},"examples":[{"en":"The crowd started to pogo when the band played their fastest song.","zh":"乐队演奏最快的那首歌时，人群开始原地蹦跳。"},{"en":"He was pogoing in time with the beat.","zh":"他跟着节拍上下蹦跳。"}]},{"partOfSpeech":"n.","definition":{"en":"(Pogo) a well-known comic-strip character: a friendly opossum from the classic American strip “Pogo”","zh":"（Pogo）美国经典连环漫画《Pogo》中的角色名：一只性格友好的负鼠"},"examples":[{"en":"My grandfather kept old copies of the “Pogo” comic strip.","zh":"我爷爷保存着一些旧的《Pogo》连环漫画。"}]}],"synonyms":["pogo stick","bounce","jump","hop","pogoing"],"phonetic":"/ˈpoʊɡoʊ/","extraExplanation":["“pogo”最常见指“pogo stick（跳跳杆）”。动词用法多见于音乐文化语境，尤其是朋克（punk）现场的“pogo dancing / pogoing”，指人群中直上直下的跳跃动作（不强调舞步）。","“Pogo”连环漫画由美国漫画家 Walt Kelly 创作（1940s–1970s），以讽刺与社会评论著称；常被引用的名句是“We have met the enemy and he is us.”（我们遇到了敌人，而敌人就是我们）。"]}
{"word":"pogonatum","summary":{"en":"Pogonatum is a scientific genus name for certain haircap mosses.","zh":"Pogonatum 是某些金发藓科苔藓（常称“金发藓/发藓类”）的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mosses (family Polytrichaceae), often called haircap mosses; small plants that form tufts on soil or rocks in moist habitats.","zh":"（植物）金发藓属/须藓属的一类苔藓植物（属名：Pogonatum，隶属金发藓科），常成簇生长于潮湿环境的土壤或岩石上。"},"examples":[{"en":"We found Pogonatum growing in dense clumps along the shaded trail.","zh":"我们在背阴的小路旁发现了成片簇生的金发藓属苔藓。"},{"en":"Under a hand lens, Pogonatum shows tiny leaf-like structures typical of many mosses.","zh":"用放大镜观察时，金发藓属苔藓能看到许多苔藓常见的细小“叶状”结构。"}]}],"synonyms":["haircap moss (genus Pogonatum)"],"phonetic":"/ˌpoʊɡoʊˈneɪtəm/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语里较少单独使用；在自然观察或生态/植物学语境中更常见。","词源可追溯到希腊语：pogon- 表示“胡须/须”，-atum 为拉丁化后缀；属名常用来暗示植物某些“须状/毛状”的形态特征。"]}
{"word":"pogonia","summary":{"en":"Pogonia is a genus of orchids, often mentioned in botany (e.g., the wild orchid rose pogonia).","zh":"Pogonia 指一种兰科植物属（须唇兰属/波戈尼亚属），常见于植物学语境（如玫瑰须唇兰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of orchids (family Orchidaceae), including species such as the rose pogonia found in parts of North America and Asia","zh":"（植物）一种兰科植物属（Pogonia，普遍译作“须唇兰属/波戈尼亚属”），其中包括分布于北美和亚洲的一些物种，如“玫瑰须唇兰/rose pogonia”"},"examples":[{"en":"Rose pogonia is a wild orchid that can grow in boggy or wet areas.","zh":"玫瑰须唇兰是一种野生兰花，常见于沼泽或潮湿地带。"},{"en":"The botanist recorded Pogonia in the survey of local orchid species.","zh":"植物学家在当地兰科植物调查中记录了须唇兰属（Pogonia）。"}]}],"synonyms":["orchid (general)","genus Pogonia"],"phonetic":"/pəˈɡoʊniə/","extraExplanation":["词源提示：Pogonia 来自希腊语 pogōn（意为“胡须、须”），用来形容某些兰花花部（尤其唇瓣）上像“须”一样的毛状结构。","使用提醒：在英文里 Pogonia 常作为植物学属名出现，写作首字母大写（Pogonia）；在一般语境中也有人用小写 pogonia 指“该属的兰花”。"]}
{"word":"pogonias","summary":{"en":"Pogonias is a scientific genus name for certain drumfish, especially the black drum.","zh":"Pogonias 是部分鼓鱼（石首鱼科）的属名，尤指黑鼓鱼所属的鼓鱼属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of drumfish (family Sciaenidae), especially known for the species called the black drum (Pogonias cromis).","zh":"（鱼类）石首鱼科的一个属名（鼓鱼属），其中最常见、最知名的物种是黑鼓鱼（Pogonias cromis）。"},"examples":[{"en":"Scientists recorded Pogonias cromis in coastal waters during the survey.","zh":"科学家在调查中记录到黑鼓鱼（Pogonias cromis）出现在近海水域。"},{"en":"The genus Pogonias is part of the drumfish family, Sciaenidae.","zh":"鼓鱼属（Pogonias）属于石首鱼科（Sciaenidae）。"}]}],"synonyms":["black drum (common name for Pogonias cromis)","drumfish (family-level common term)"],"phonetic":"/poʊˈɡoʊniəs/","extraExplanation":["Pogonias 是拉丁化的学名，常用于生物分类与科研写作中；日常英语里更常说 black drum（黑鼓鱼）或 drumfish（鼓鱼）。","词源来自希腊语 pogōn（“胡须”），暗示这类鱼下巴处可能有触须（barbels）一类的结构。"]}
{"word":"pogoniasis","summary":{"en":"Pogoniasis is a rare term meaning excessive or abnormal beard growth, especially in a woman.","zh":"pogoniasis 指胡须部位异常或过度生长的罕见说法，常用于描述女性长出明显胡须。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare condition of abnormal or excessive growth of beard hair, especially in a woman (a type of facial hirsutism).","zh":"一种罕见状况，指胡须部位毛发异常或过度生长，尤其常用来指女性长出明显胡须（属于面部多毛/多毛症的一种）。"},"examples":[{"en":"The doctor evaluated her for pogoniasis and other signs of hormonal imbalance.","zh":"医生评估她是否有胡须部位多毛（pogoniasis），以及其他激素失衡的迹象。"},{"en":"In older medical texts, pogoniasis was sometimes used to describe prominent beard growth in women.","zh":"在较早的医学文献中，pogoniasis 有时用来描述女性明显的胡须生长。"}]}],"synonyms":["hirsutism","hypertrichosis","facial hirsutism"],"phonetic":"/ˌpɑɡəˈnaɪəsɪs/","extraExplanation":["词源提示：pogoniasis 来自希腊语词根 pogon（意为“胡须”）加上表示“病症/状态”的后缀 -iasis（如 psoriasis 银屑病）。","使用场景：该词在现代日常英语中非常少见；医学语境更常用 hirsutism（多毛症，尤指女性因雄激素相关导致的毛发增多）或 hypertrichosis（全身/局部多毛，未必与激素有关）。"]}
{"word":"pogoniate","summary":{"en":"Pogoniate means “bearded,” and it’s a rare, formal adjective.","zh":"pogoniate 表示“有胡子的”，是一个较罕见、偏正式的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a beard; bearded (a rare, formal word).","zh":"有胡子的；长胡须的（较罕见、偏正式用词）。"},"examples":[{"en":"In the old portrait, the pogoniate sailor looks stern and weathered.","zh":"在那幅老肖像里，那位长胡子的水手看起来严肃而饱经风霜。"},{"en":"The novel describes a pogoniate hermit living alone in the mountains.","zh":"小说描写了一位长胡子的隐士独自住在山中。"}]}],"synonyms":["bearded","whiskered","hirsute"],"phonetic":"/poʊˈɡoʊniˌeɪt/","extraExplanation":["词源提示：pogoniate 来自希腊语词根 pogon（“胡子”）。在现代英语里非常少见，日常更常用 bearded / with a beard。","使用场景：多出现在较正式、文学化描写中，用来营造“古典”“旧式画像/人物描写”的感觉。"]}
{"word":"pogonion","summary":{"en":"Pogonion is the anatomical landmark for the most forward point of the chin, commonly used in cephalometric measurements.","zh":"pogonion 指“颏前点”，即下巴正中线上最前方的定位点，常用于头影测量等颅颌面测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/orthodontics) The most forward (most anterior) point on the chin in the midline of the face, used as a standard landmark in skull and facial measurements (cephalometrics).","zh":"（解剖/正畸）颏前点：下巴正中线上最向前（最前方）的点，是颅颌面测量（头影测量）中的标准定位点。"},"examples":[{"en":"In a lateral cephalometric X-ray, the orthodontist marked the pogonion to analyze the chin position.","zh":"在侧位头影测量X光片上，正畸医生标记颏前点来分析下巴的位置。"},{"en":"The report notes that the pogonion is slightly retrusive compared with the facial profile line.","zh":"报告指出颏前点相对面部轮廓线略显后缩。"}]}],"synonyms":["chin point","anterior chin point","cephalometric chin point"],"phonetic":"/pəˈɡoʊniən/","extraExplanation":["词源提示：pogonion 来自希腊语词根 pogon-（意为“胡须/下巴”相关），因此常见于与下巴解剖和面部测量有关的专业语境。","使用场景：这个词多见于牙科正畸、颅颌面外科、人体测量学论文或检查报告中，日常英语通常会用 chin point（下巴最前点/颏点）来解释。"]}
{"word":"pogonip","summary":{"en":"Pogonip means thick freezing fog, especially in the Sierra Nevada region.","zh":"pogonip 指（尤见于内华达山脉一带的）浓重冻雾/冰雾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, icy fog (freezing fog) that forms in very cold weather, especially in the Sierra Nevada and nearby valleys; it can coat trees and surfaces with frost.","zh":"（尤指美国内华达山脉一带的）“冰雾/冻雾”：在严寒天气形成的浓雾，常会在树木和物体表面结霜结冰。"},"examples":[{"en":"In the morning, pogonip covered the pines with a white crust of ice.","zh":"清晨，冰雾让松树披上一层白色的冰壳。"},{"en":"Drivers slowed down because the pogonip made the road hard to see.","zh":"司机们减速行驶，因为冰雾让道路能见度很低。"}]}],"synonyms":["freezing fog","ice fog","frost fog"],"phonetic":"/ˈpɑɡəˌnɪp/","extraExplanation":["“pogonip”主要是美国西部（尤其是加州/内华达山脉地区）的地方用词，带有明显的地域色彩；在日常英语里更常见的说法是“freezing fog（冻雾）”。","这个词常被用来营造寒冷、静默、带点神秘感的氛围，在描写山地冬季景象的地方文学或回忆性文字中比较常见。"]}
{"word":"pogonips","summary":{"en":"Pogonip means a freezing, ice-crystal fog, especially in cold western U.S. valleys.","zh":"pogonip 指冰晶形成的冻雾（冰雾），多见于美国西部寒冷山谷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dense, freezing fog made of tiny ice crystals, common in very cold valleys (especially in the western U.S.)","zh":"（尤指美国西部寒冷山谷中的）冰雾；由微小冰晶组成的浓重冻雾"},"examples":[{"en":"The valley filled with pogonip, and the trees became coated with white frost.","zh":"山谷里弥漫着冰雾，树木被一层白霜覆盖。"},{"en":"Driving in pogonip can be dangerous because visibility drops suddenly.","zh":"在冰雾中开车很危险，因为能见度会突然下降。"},{"en":"Winter inversions often trap pogonip near the ground for days.","zh":"冬季的逆温层常把冰雾困在近地面，持续好几天。"}]}],"synonyms":["ice fog","freezing fog","frost fog","rime"],"phonetic":"/ˈpɑɡəˌnɪp/","extraExplanation":["“pogonip”多见于美国西部英语（如内华达、犹他等地），常用来指冬季在山谷里形成的“冰晶雾”。它不只是普通的雾：由于气温极低，水汽直接形成悬浮的冰晶，容易造成路面结冰、能见度骤降。","词源被认为来自北美原住民语言（常被提到与肖松尼语有关），因此带有明显的地域文化色彩。文学或地方叙事中用它来营造刺骨、封闭、静寂的冬季氛围。"]}
{"word":"pogoniris","summary":{"en":"Pogoniris is a botanical term for bearded irises—irises with a fuzzy “beard” on the petals.","zh":"Pogoniris 是植物学用语，指有髯鸢尾——花瓣上带“胡须状绒毛”的鸢尾类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bearded iris (an iris flower with a fuzzy “beard” on the falls/petals), often used as a botanical name for bearded-iris groups","zh":"（植物）有髯鸢尾／胡须鸢尾：花瓣（下垂花被片）上带有一撮绒毛状“胡须”的鸢尾类群，常见于植物学命名或分类中"},"examples":[{"en":"Bearded irises are sometimes labeled as Pogoniris in older garden catalogs.","zh":"在一些较早的园艺目录里，有髯鸢尾有时会被标注为 Pogoniris。"},{"en":"This variety belongs to the bearded-iris group (Pogoniris).","zh":"这个品种属于有髯鸢尾类群（Pogoniris）。"}]}],"synonyms":["bearded iris","bearded irises"],"phonetic":"/ˌpɑːɡoʊˈnaɪrɪs/","extraExplanation":["词源提示：pogon- 来自希腊语，意为“胡须”；iris 指“鸢尾”。合起来强调这类鸢尾花瓣上有“胡须状绒毛”的特征。","使用场景：Pogoniris 多见于植物学分类、旧式园艺书或标签中；日常英语里更常说 bearded iris（有髯鸢尾）。"]}
{"word":"pogonite","summary":{"en":"Pogonite is a rare word meaning a bearded person.","zh":"pogonite 是个罕见词，意思是“留胡子的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A bearded person; someone who wears a beard.","zh":"（罕见）留胡子的人；有胡子的人。"},"examples":[{"en":"In the old satire, the author mocks the pogonites of the court for caring more about fashion than wisdom.","zh":"在那篇旧讽刺作品里，作者嘲笑宫廷里的“留胡子的人”更在意时尚而不是智慧。"},{"en":"The village barber was famous for shaping the beards of local pogonites.","zh":"村里的理发师因替当地留胡子的人修整胡子而出名。"}]}],"synonyms":["bearded person","bearded man","beard-wearer"],"phonetic":"/ˈpɑɡəˌnaɪt/","extraExplanation":["这个词很少见，主要出现在较旧或带有幽默/讽刺语气的英语文本中。","词根来自希腊语 pogōn（意为“胡子”），所以你会在一些相关词里看到 pogo-/pogon-：例如 pogonophobia（怕胡子，较少见）、pogonotrophy（蓄胡子）。现代英语更常用 bearded man/person、beard-wearer。"]}
{"word":"pogonological","summary":{"en":"An adjective meaning “beard-related,” especially connected to the study of beards.","zh":"形容词，表示“与胡须相关的”，尤指与“胡须研究”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to beards, or to the study of beards (pogonology).","zh":"与胡须有关的；（尤指）与胡须研究（pogonology）有关的。"},"examples":[{"en":"He wrote a pogonological article about how beard styles changed over the last century.","zh":"他写了一篇有关胡须学的文章，讨论过去一个世纪胡须风格如何变化。"},{"en":"The museum display included pogonological notes on famous historical beards.","zh":"博物馆展览还附上了关于著名历史胡须的“胡须学”注释。"}]}],"synonyms":["beard-related","hirsute (more general: hairy)","pogonological (rare, self-synonym)"],"phonetic":"/ˌpɑːɡəˈnɑːlədʒɪkəl/","extraExplanation":["这个词非常罕见，常见于幽默、学术噱头或小众写作中。更常见的说法是用普通表达：beard-related（与胡须相关的）、about beards（关于胡须的）。","词源上来自希腊语 pogon（胡须）+ -logy（学科/研究）→ pogonology（胡须学）→ pogonological（与胡须学相关的）。"]}
{"word":"pogonologist","summary":{"en":"A pogonologist is someone who studies beards.","zh":"pogonologist 指“研究胡须的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies beards (their growth, styles, history, or cultural meaning).","zh":"研究胡须的人（研究胡须的生长、造型、历史或文化意义）。"},"examples":[{"en":"The museum invited a pogonologist to speak about beards in different eras.","zh":"博物馆邀请了一位胡须研究者来讲不同年代的胡须文化。"},{"en":"As a pogonologist, she collects old photos to track how beard styles changed over time.","zh":"作为一名胡须研究者，她收集老照片来追踪胡须造型如何随时间变化。"}]}],"synonyms":["beard researcher","facial-hair historian","beard expert"],"phonetic":"/ˌpɑːɡəˈnɑːlədʒɪst/","extraExplanation":["这个词比较少见，常带一点幽默或“学术化”的语气，用来指“研究胡子的人”。","词源：pogon- 来自希腊语 pōgōn（胡须）+ -logist（研究某领域的人），结构类似 biology（生物学）→ biologist（生物学家）。","实际生活中更常用的说法可能是 “beard researcher / facial hair historian / barber specializing in beards”，而 pogonologist 更像是风趣或小众的用词。"]}
{"word":"pogonology","summary":{"en":"Pogonology means the study of beards, often used humorously or in niche academic/cultural contexts.","zh":"pogonology 指「研究鬍鬚的學問」，多見於小眾或帶幽默語氣的使用情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of beards and beardedness","zh":"鬍鬚學；研究鬍鬚與留鬍文化的學問"},"examples":[{"en":"He joked that his hobby was pogonology—studying different beard styles.","zh":"他開玩笑說自己的嗜好是鬍鬚學——研究各種鬍鬚造型。"},{"en":"The museum talk touched on pogonology and what beards meant in different eras.","zh":"博物館的講座談到鬍鬚學，以及鬍鬚在不同年代代表的意義。"}]}],"synonyms":["beard study","facial-hair studies"],"phonetic":"/ˌpɑːɡəˈnɑːlədʒi/","extraExplanation":["這個詞比較少見，常帶幽默或「學術腔」的效果，用來指對鬍鬚的歷史、文化、造型與社會意涵的研究。","詞源來自希臘語 pogon（鬍鬚）+ -logy（學科／研究）。"]}
{"word":"pogonophobia","summary":{"en":"Pogonophobia means an intense fear of beards or bearded people.","zh":"pogonophobia 指对胡子或留胡子的人产生强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong fear of beards or of people with beards","zh":"对胡子或留胡子的人产生强烈恐惧"},"examples":[{"en":"He avoids barbershops with big-bearded barbers because of his pogonophobia.","zh":"因为有胡子恐惧症，他会避开那些留着大胡子的理发师工作的理发店。"},{"en":"Her pogonophobia makes it hard to feel relaxed around men with beards.","zh":"她的胡子恐惧症让她很难在留胡子的男性身边放松下来。"}]}],"synonyms":["fear of beards"],"phonetic":"/ˌpɑːɡəˈnoʊfiə/","extraExplanation":["词源：来自希腊语 pogon-（“胡子”）+ -phobia（“恐惧症”）。在日常英语中不算常见，更常见的说法是“fear of beards”。","用法提示：在心理健康语境里，“-phobia”有时指临床层面的强烈恐惧，但在口语中也可能被用来夸张表达“不喜欢/不适”。如果是严肃语境，最好避免随意给人贴标签。"]}
{"word":"pogonophoran","summary":{"en":"A deep-sea tube-dwelling “beard worm,” historically called a pogonophoran, that feeds via symbiotic bacteria.","zh":"一种深海管栖的“须状管虫/须腕动物”（旧称 pogonophoran），主要靠共生细菌获取营养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tube-dwelling marine worm-like animal (a beard worm) that lives on the ocean floor, often in deep water; it lacks a mouth and gut and gets nutrients from symbiotic bacteria.","zh":"（旧称）须腕动物：一种住在海底管状栖管里的海洋蠕虫状动物（常见于深海）；没有口和消化道，主要依靠与其共生的细菌获得营养。"},"examples":[{"en":"Scientists studied pogonophorans living near hydrothermal vents.","zh":"科学家研究了生活在热液喷口附近的须腕动物。"},{"en":"Because pogonophorans have no digestive system, they rely on bacteria for food.","zh":"由于须腕动物没有消化系统，它们依靠细菌提供“食物”。"}]}],"synonyms":["beard worm","tube worm"],"phonetic":"/ˌpoʊɡəˈnɑːfərən/","extraExplanation":["“pogonophoran”来自希腊语词根：pogon-（胡须）+ -phoran（携带的/带着的），指这些动物有明显的“须状”触手冠，用来与共生细菌交换物质。","在现代分类学中，“Pogonophora（须腕动物门）”多被并入环节动物门（Annelida）中的多毛纲（Polychaeta），常见相关类群名为“管虫”（如 Riftia）。因此在新文献中更常看到 tube worm / beard worm 等说法。"]}
{"word":"pogonotomy","summary":{"en":"Pogonotomy means shaving or cutting a beard, but it’s a rare, humorous-sounding word.","zh":"pogonotomy 指“刮胡子/剃（修剪）胡须”，但属于少见、略带玩笑感的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of shaving a beard; beard-cutting","zh":"刮胡子；剃（或修剪）胡须的行为或做法"},"examples":[{"en":"After a month of camping, he finally got a proper pogonotomy at a barbershop.","zh":"露营一个月后，他终于在理发店好好刮了一次胡子。"},{"en":"The writer joked about his “daily pogonotomy” as part of his morning routine.","zh":"作者开玩笑说他把“每天刮胡子”当作晨间流程的一部分。"}]}],"synonyms":["shaving","beard trimming","barbering"],"phonetic":"/ˌpɑːɡəˈnɑːtəmi/","extraExplanation":["这个词很少见，带点幽默/书面色彩，日常更常用 shave (one’s beard)、shave、trim one’s beard。","词源来自希腊语词根：pogon-（胡须）+ -tomy（切割/切除），和 anatomy、lobotomy 里的 -tomy 同源。"]}
{"word":"pogonotrophy","summary":{"en":"Pogonotrophy means growing or cultivating a beard.","zh":"pogonotrophy 指“蓄须/促进胡须生长”，是非常少见的书面词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the growing, cultivating, or encouraging of a beard (facial hair).","zh":"（胡须的）生长、培育；蓄须（促进胡子生长或让其长起来）。"},"examples":[{"en":"His pogonotrophy began during the winter, when shaving felt like too much trouble.","zh":"他的蓄须是从冬天开始的，那时他觉得刮胡子太麻烦。"},{"en":"The actor’s pogonotrophy was part of preparing for the role of an old sailor.","zh":"这位演员蓄须是为饰演老水手做准备的一部分。"}]}],"synonyms":["beard-growing","beard growth","beard cultivation"],"phonetic":"/ˌpɑːɡəˈnɑːθrəfi/","extraExplanation":["这是一个非常罕见、带点“书面/学术气”的词，日常英语里通常直接说：grow a beard（留胡子）、let your beard grow（让胡子长起来）、beard growth（胡须生长）。","词源：pogon- 来自希腊语，意为“胡须”；-trophy 来自 trophē，意为“营养、滋养/生长”。因此字面意思接近“胡须的滋养/生长”。","在文学或幽默语境中，用它可以显得夸张、刻意“高大上”，带一点玩笑式的学究气。"]}
{"word":"pogrom","summary":{"en":"A pogrom is an organized violent attack on an ethnic or religious group, often with official tolerance.","zh":"pogrom 指对某一族群或宗教群体的有组织暴力迫害，常伴随官方默许。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A violent, organized attack on a particular ethnic or religious group, especially one that is officially tolerated or supported.","zh":"（针对特定族群或宗教群体的）暴动式迫害；有组织的暴力袭击，常带有默许或纵容的官方背景。"},"examples":[{"en":"The community fled after a pogrom destroyed homes and shops.","zh":"在一次pogrom摧毁了房屋和商店后，社区成员纷纷逃离。"},{"en":"Historians study how rumors and political pressure can lead to a pogrom.","zh":"历史学家研究谣言与政治压力如何导致pogrom的发生。"}]}],"synonyms":["massacre","mob violence","persecution","ethnic violence"],"phonetic":"/pəˈɡrɑm/","extraExplanation":["这个词常与东欧历史相关，尤其指19—20世纪针对犹太人的有组织暴力事件（如沙皇俄国时期及其后）。如今也可用于描述针对其他少数群体的类似暴力迫害，但语体较严肃，带有强烈的历史与道德指向。","词源来自俄语“погром”，本义是“摧毁、劫掠”。在英语中使用时通常暗示：暴力并非偶发冲突，而是成规模、有煽动或组织，并且当局可能纵容。"]}
{"word":"pogromed","summary":{"en":"“Pogromed” means a group was violently and systematically attacked and persecuted (past tense of “pogrom”).","zh":"“pogromed”表示某个群体遭到有组织的暴力攻击与迫害（“pogrom”的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “pogrom”: to attack and persecute a group (especially an ethnic or religious community) in an organized, violent way, often with destruction of homes or businesses.","zh":"“pogrom”的过去式/过去分词：指对某个群体（尤指某个族群或宗教群体）进行有组织的暴力迫害，常伴随抢掠与破坏房屋或商铺。"},"examples":[{"en":"Jewish neighborhoods were pogromed, and many families fled the city.","zh":"犹太人社区遭到暴力迫害，许多家庭逃离了这座城市。"},{"en":"The minority community was pogromed after rumors spread online.","zh":"网络谣言扩散后，这个少数群体遭到有组织的暴力攻击。"}]}],"synonyms":["persecuted","attacked","targeted","massacred","terrorized"],"phonetic":"/pəˈɡrɑmd/","extraExplanation":["“pogrom”一词常与历史上的反犹暴力事件相关，源自俄语语境，带有强烈的历史与情感重量。使用时应谨慎：它通常指“群体性、针对特定身份的、有组织的暴力迫害”，不太适合用来形容一般的打架或普通骚乱。","在写作中，若用“pogromed”，最好给出明确背景（谁对谁、为何被针对、是否带有官方纵容或群体动员），以避免误用或弱化其历史含义。"]}
{"word":"pogroming","summary":{"en":"“Pogroming” means carrying out an organized, violent attack on a targeted group (often Jews).","zh":"“pogroming”指对某一被针对的群体实施有组织的集体暴力袭击（常见对象为犹太人）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “pogrom”) carrying out or taking part in an organized, violent attack on a particular group, especially a Jewish community.","zh":"（“pogrom”的现在分词）对某一群体（尤指犹太人社群）实施或参与有组织的暴力袭击（常伴随抢劫、破坏）。"},"examples":[{"en":"Historians described mobs pogroming Jewish neighborhoods and destroying homes and shops.","zh":"历史学家描述暴民对犹太人社区进行pogrom式袭击，毁坏房屋和商店。"},{"en":"The novel depicts a town pogroming a minority group after false rumors spread.","zh":"这部小说描写谣言扩散后，小镇对少数族群发动pogrom式暴力。"}]}],"synonyms":["persecuting","attacking","targeting","raiding"],"phonetic":"/pəˈɡroʊmɪŋ/","extraExplanation":["“pogrom”一词来自俄语，常用来指19—20世纪东欧和俄国境内针对犹太人的集体暴力事件（往往伴随掠夺与纵火）。由于其强烈的历史与情感重量，英语里通常在严肃的历史、新闻或学术语境中使用，不太适合轻描淡写地形容一般的争吵或网络攻击。","形式上，“pogroming”是“pogrom”的动词现在分词/动名词；更常见的表达仍是“a pogrom occurred / to carry out a pogrom”，动词用法相对少见，使用时要注意语境是否正式、准确。"]}
{"word":"pogromist","summary":{"en":"A pogromist is someone who participates in or supports mob violence against a targeted ethnic or religious group.","zh":"“pogromist”指参与或支持针对特定族裔/宗教群体的集体暴力袭击的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes part in, supports, or organizes a pogrom (a violent attack, often by a mob, against an ethnic or religious group).","zh":"参加、支持或组织“迫害性暴动”（pogrom）的人；通常指对某个族群或宗教群体进行集体暴力攻击的人。"},"examples":[{"en":"The newspaper condemned the pogromists for inciting violence against their neighbors.","zh":"这家报纸谴责那些煽动对邻居施暴的迫害性暴动参与者。"},{"en":"Historians describe how pogromists targeted Jewish communities in several cities.","zh":"历史学家描述了迫害性暴动者如何在多个城市针对犹太社区下手。"}]}],"synonyms":["perpetrator","rioter","mob attacker","instigator","agitator"],"phonetic":"/ˈpɑːɡrə-mɪst/","extraExplanation":["“pogrom”一词常与19—20世纪东欧、俄帝国境内针对犹太人的暴力袭击联系在一起，因此“pogromist”也带有强烈的历史与道德谴责色彩。现代语境中有时会更广泛指向针对任何少数族群的有组织暴力，但使用时仍非常敏感、语气很重。","词形提示：pogrom + -ist（表示“从事/支持某种活动的人”），类似于“activist（活动家）”“terrorist（恐怖分子）”。"]}
{"word":"pogromize","summary":{"en":"A rare verb meaning to carry out or incite a pogrom—violent persecution of a minority group, especially Jews.","zh":"一个很少见的动词，指发动或煽动pogrom式暴力：对少数群体（尤指犹太人）进行暴力迫害。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to carry out or encourage a pogrom; to attack or persecute a minority group violently (especially Jewish communities)","zh":"发动或煽动“大屠杀式暴动”（pogrom）；对少数群体进行暴力攻击或迫害（尤指针对犹太社群）"},"examples":[{"en":"The writer accused the regime of trying to pogromize ethnic minorities to distract the public.","zh":"作家指责该政权试图对少数民族发动“pogrom式”的暴力迫害，以转移公众视线。"},{"en":"Historians warn against language that normalizes attempts to pogromize vulnerable communities.","zh":"历史学者警惕那种会让针对弱势社群的“pogrom式迫害”被正常化的言论。"}]}],"synonyms":["persecute","terrorize","victimize","attack","incite violence against"],"phonetic":"/ˈpɑːɡrəˌmaɪz/","extraExplanation":["“pogromize”是由“pogrom（大屠杀式的反少数族群暴动）+ -ize”构成的派生动词，但在现代英语中非常少见，更多时候会用“carry out a pogrom / incite a pogrom / persecute violently”等更常见、更清晰的表达。","“pogrom”一词常与19—20世纪东欧、俄国境内针对犹太人的有组织暴力事件相关，带有强烈历史与情感负载；在写作或讨论时应谨慎使用，避免轻率类比或弱化其严重性。"]}
{"word":"pogroms","summary":{"en":"“Pogroms” are organized mob attacks against a minority group, often involving violence, looting, and destruction.","zh":"“Pogroms”指针对少数群体的有组织暴力袭击，常伴随杀戮、洗劫与破坏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A violent, organized attack by a mob against a particular ethnic, religious, or other minority group, often involving killing, looting, and destruction of homes or businesses.","zh":"（通常由暴民或在默许下发生的）对某一族群/宗教等少数群体的有组织暴力袭击，常伴随杀戮、抢劫与破坏房屋或商铺。"},"examples":[{"en":"The museum exhibit explains how pogroms forced many Jewish families to flee their towns.","zh":"博物馆展览讲述了大屠杀式袭击（pogroms）如何迫使许多犹太家庭逃离家乡。"},{"en":"Historians study the pogroms to understand how hate can spread through a community.","zh":"历史学家研究这些pogroms，以理解仇恨如何在社区中扩散。"},{"en":"After the rumors spread, a pogrom broke out and shops were looted.","zh":"谣言传开后，发生了pogrom，商店遭到洗劫。"}]}],"synonyms":["massacre","mob violence","anti-minority attacks","persecution","ethnic violence"],"phonetic":"/ˈpoʊɡrɑm/","extraExplanation":["“pogrom”源自俄语，原意接近“破坏、摧毁”。它在英语里常与19—20世纪东欧和俄国针对犹太人的暴力事件紧密相关，但也可泛指针对任何少数群体的群体性迫害与暴力。","语感与用法：它是一个强烈、带历史重量的词，常用于严肃语境（历史、新闻、人权讨论）。在写作中使用时，通常暗示“有组织/被纵容的暴力”而不只是一般的骚乱（riot）或冲突（clash）。","相关词辨析：genocide（种族灭绝）强调系统性消灭一个群体；pogrom通常指一次或一系列暴力袭击事件，未必达到“灭绝”的规模，但依然极端严重。"]}
{"word":"pogy","summary":{"en":"“Pogy” usually means a menhaden fish; in US military slang it can mean snacks (“pogie bait”).","zh":"“pogy”通常指美洲鲱（menhaden）这种鱼；在美国军队俚语中也可指零食（pogie bait）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US, mainly Southern & Atlantic coastal) A menhaden fish (also spelled “pogie/pogy”): a small, oily fish often used for bait, fish oil, or fertilizer.","zh":"（美国，主要在南方及大西洋沿岸）鲱鲹/美洲鲱（menhaden，也常拼作 pogie/pogy）：一种小型多油鱼，常用作鱼饵、鱼油或肥料原料。"},"examples":[{"en":"The captain netted a school of pogies to use as bait for striped bass.","zh":"船长捕到一群 pogy，用来当条纹鲈的鱼饵。"},{"en":"Factories once processed pogies for oil and fertilizer along the coast.","zh":"过去沿海曾有工厂加工 pogy 来提炼鱼油并制肥。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, US military slang) “Pogie bait”: snacks or small treats, especially candy (often contrasted with regular meals).","zh":"（非正式，美国军队俚语）“pogie bait”：零食/小甜点，尤其指糖果（常与正餐相对）。"},"examples":[{"en":"He stuffed his pack with pogie bait for the long march.","zh":"他在背包里塞满零食，好应付长途行军。"},{"en":"The store sold cigarettes, soda, and plenty of pogie bait.","zh":"小卖部卖香烟、汽水，还有很多零食。"}]}],"synonyms":["pogie","menhaden","bunker (regional)","baitfish (general)","snacks (for “pogie bait”)","candy (for “pogie bait”)"],"phonetic":"/ˈpoʊɡi/","extraExplanation":["“pogy”更常见的拼写是“pogie”。在美国沿海渔业语境里多指 menhaden 这种鱼；在美军口语里常出现在固定搭配“pogie bait”（零食）中。两种含义语境差别很大：海边/钓鱼语境更可能是“鱼”，军营/行军/补给语境更可能是“零食”。"]}

