{"word":"poi","summary":{"en":"“Poi” can mean a Hawaiian taro paste, or (as POI) “person of interest” or “point of interest.”","zh":"“poi”可指夏威夷芋头糊状食物；大写“POI”常作缩写，指“警方关注对象”或“兴趣点/景点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Hawaiian food made by pounding cooked taro root into a smooth paste; it can be eaten plain or fermented (more sour) over time.","zh":"波伊（poi）：夏威夷传统食物，把煮熟的芋头（taro）捣成细滑的糊状；可直接食用，也可发酵后变得更酸。"},"examples":[{"en":"At the luau, we tried poi with grilled fish.","zh":"在夏威夷宴会（luau）上，我们把波伊（poi）配烤鱼一起吃。"},{"en":"Some people like poi when it’s mildly sour.","zh":"有些人喜欢略带酸味的波伊（poi）。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “person of interest,” someone the police want to talk to in an investigation (not necessarily a suspect).","zh":"（缩写）POI：Person of Interest，警方在调查中希望了解情况或接触的人（不一定是嫌疑人）。"},"examples":[{"en":"The police said he is a POI, not a suspect.","zh":"警方表示他是“关注对象”（POI），不是嫌疑人。"},{"en":"Reporters asked whether the missing person’s roommate was a POI.","zh":"记者问失踪者的室友是否是警方的关注对象（POI）。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “point of interest,” a place worth visiting or noticing, especially on maps and travel apps.","zh":"（缩写）POI：Point of Interest，兴趣点/景点/值得关注的地点（常见于地图与旅游软件）。"},"examples":[{"en":"The app shows nearby POIs like museums and cafés.","zh":"这个应用会显示附近的兴趣点（POI），比如博物馆和咖啡馆。"},{"en":"Mark the hotel as a POI on the map.","zh":"在地图上把酒店标记为兴趣点（POI）。"}]}],"synonyms":["taro paste","person of interest (POI)","point of interest (POI)"],"phonetic":"/pɔɪ/","extraExplanation":["“poi”（食物）与夏威夷原住民文化密切相关，常出现在传统聚会或宴会（luau）中；口感从较稠到较稀都可能，发酵后酸味更明显。","写成大写“POI”时通常表示缩写；在新闻语境里“person of interest”容易被误解为“嫌疑人”，但它的含义更宽泛。","在地图/旅游领域，“point of interest”常译为“兴趣点”，可指景点、餐馆、加油站等任何对用户有用的地点。"]}
{"word":"poiana","summary":{"en":"Poiana is a Romanian word meaning a grassy forest clearing (a glade), and it also appears in place names and surnames.","zh":"Poiana 源自罗马尼亚语，意思是“林间草地空地/林间草甸（glade）”，也常用作地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Romanian) a grassy clearing or meadow, especially one inside or at the edge of a forest; a glade.","zh":"（源自罗马尼亚语）林中或林缘的草地空地；林间草甸；林间空地（glade）。"},"examples":[{"en":"We stopped for lunch in a poiana, surrounded by pine trees.","zh":"我们在一片林间空地（poiana）里停下来吃午饭，四周都是松树。"},{"en":"In the story, the shepherd leads the sheep to a quiet poiana at dusk.","zh":"在故事里，牧羊人黄昏时把羊群带到一处安静的林间草甸（poiana）。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name or surname derived from the Romanian word for “forest clearing/meadow.”","zh":"源自“林间空地/草甸”之意的地名或姓氏（如 Poiana 作为城镇/村庄名）。"},"examples":[{"en":"They booked a hotel near Poiana Brașov for a ski trip.","zh":"他们为了滑雪旅行订了靠近波亚纳布拉索夫（Poiana Brașov）的一家酒店。"}]}],"synonyms":["glade","clearing","meadow","woodland clearing"],"phonetic":"/poʊˈjɑːnə/","extraExplanation":["“poiana”在罗马尼亚语里很常见，常出现在地名中（例如 Poiana Brașov）。在英语语境里，它多用于谈论罗马尼亚的地理、旅行或文学翻译时，作为外来词保留。"]}
{"word":"poictesme","summary":{"en":"“Poictesme” is an old literary spelling for Poitou, a historical region in western France.","zh":"“Poictesme”是Poitou（普瓦图）的古体文学拼写，指法国西部的一个历史地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic/literary) Poitou, a historical region in western France (around Poitiers).","zh":"（古体/文学用语）普瓦图（Poitou），法国西部的一个历史地区（以普瓦捷 Poitiers 一带为中心）。"},"examples":[{"en":"In some medieval texts, “Poictesme” refers to the region we now call Poitou.","zh":"在一些中世纪文本里，“Poictesme”指的就是今天所说的普瓦图（Poitou）地区。"},{"en":"The knight was said to come from Poictesme, in western France.","zh":"文中说那位骑士来自法国西部的普瓦图（Poictesme）。"}]}],"synonyms":["Poitou","(region around) Poitiers"],"phonetic":"/pwɑːˈtɛzm/","extraExplanation":["“Poictesme”是中世纪英语/古法语里对Poitou的一种拼写方式（拼写不统一很常见）。现代英语通常写作“Poitou”（法语发音近似“pwah-TWEE”），而“Poictesme”多见于古典文学或历史文献的引文中。","它常用于营造“中古/骑士传奇”语感，和当时的贵族领地、封建背景（如阿基坦、普瓦捷等地名体系）一起出现。"]}
{"word":"poiein","summary":{"en":"Poiein is an Ancient Greek verb meaning “to make/do/create,” and it’s an important root behind the idea of poetry as creation.","zh":"Poiein 是古希腊语动词，意为“做/制造/创造”，也是“诗歌=创造”这一观念的重要词源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Ancient Greek) “to make; to do; to create; to produce.” Often used in discussions of Greek philosophy and the origins of the word “poetry.”","zh":"（源自古希腊语）“做；制造；创造；产生”。常用于讨论希腊哲学与“poetry（诗歌）”一词的词源。"},"examples":[{"en":"In Aristotle, poiein can mean “to make” something, not only to write poems.","zh":"在亚里士多德那里，poiein 可以表示“制造/生成”某物，不仅仅是写诗。"},{"en":"The root poiein is related to poetry—both involve creating something that didn’t exist before.","zh":"词根 poiein 与 poetry（诗歌）有关——两者都强调“创造出原本不存在的东西”。"}]}],"synonyms":["make","do","create","produce"],"phonetic":"/pɔɪˈiːn/","extraExplanation":["poiein（ποιεῖν）是古希腊动词，广义上指“做/制造/创造”。它的名词形式 poiesis（ποίησις）常译为“创作、生成、诗性创造”，在文学理论中常用来讨论“艺术如何把事物带到存在中”。","英语里的 poet（诗人）、poem（诗）、poetry（诗歌）都与这一希腊词根有关：早期“诗”更强调“创作/制造”的行为，而不只是押韵的文字。","在英语学术写作中，poiein 通常保留为外来词（italicize 斜体更常见），用于强调其希腊原义，而不是用普通英语 make/do 来替代。"]}
{"word":"poiesis","summary":{"en":"Poiesis means the act of creating or “bringing forth,” especially in art, poetry, and philosophy.","zh":"Poiesis 指“创造/生成（带出、使之显现）”的过程，常用于艺术、诗学与哲学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, literature, art) the act or process of making/creating; artistic or poetic creation, especially the bringing of something into being.","zh":"（哲学/文学/艺术）“生成/创制”的过程；尤指诗性或艺术性的创造，把某物“带到存在中来”。"},"examples":[{"en":"In Aristotle, poiesis is a kind of “making” that produces something outside the act itself, like a poem or a tool.","zh":"在亚里士多德那里，poiesis 是一种“制作/创制”，其结果在行动之外呈现出来，比如一首诗或一件工具。"},{"en":"The artist described her work as poiesis—turning memory into a new form.","zh":"这位艺术家把自己的创作称为 poiesis——把记忆转化为一种新的形式。"},{"en":"Some critics say good poetry is not just expression but poiesis: it makes a new world in language.","zh":"一些评论家认为好诗不只是表达，更是一种 poiesis：它用语言“创造”出一个新世界。"}]}],"synonyms":["creation","making","production","artistic creation","creative process","bringing-forth"],"phonetic":"/pɔɪˈiːsɪs/","extraExplanation":["词源：来自古希腊语 poiesis（ποίησις），意为“制作、创造”，与 poet（诗人）同源（poietes：制造者/创作者）。","在古希腊思想里，poiesis 常与 praxis（实践/行动）对比：praxis 的目的在行动本身（如政治、伦理行动），poiesis 的目的在产生一个作品/成品（如诗歌、工艺品）。","20世纪哲学中（如海德格尔）常把 poiesis 解释为“显现/涌现”：让某物从隐藏走向呈现（bringing-forth），因此在艺术讨论里它不仅是“做出来”，也带有“让意义出现”的感觉。","英语学术写作中常用斜体 poiesis 或直接用该词，语域偏学术；日常英语更常说 creation / making / artistic creation。"]}
{"word":"poietic","summary":{"en":"Poietic means “creative; bringing something into being,” especially in academic discussions of art, language, and philosophy.","zh":"Poietic 指“具有创造/生成性的；使某物得以产生”，常用于艺术、语言与哲学等学术讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to making, creating, or bringing something into being; creative or productive (often used in philosophy, art theory, and literary studies).","zh":"与“创造、生成、制造”有关的；具有创造性或生产性的（常用于哲学、艺术理论与文学研究中）。"},"examples":[{"en":"The course explores poietic imagination in modern poetry.","zh":"这门课程探讨现代诗歌中的“生成性/创造性”想象。"},{"en":"She treats writing as a poietic act, not just a way to report facts.","zh":"她把写作视为一种“创造性的行动”，而不只是陈述事实的方式。"},{"en":"In design, a poietic approach emphasizes making and experimentation.","zh":"在设计中，poietic 的方法强调动手创作与实验。"}]},{"partOfSpeech":"adj.","definition":{"en":"In some academic contexts, describing art or language as something that actively shapes reality rather than merely representing it.","zh":"在某些学术语境中，指艺术或语言能积极“塑造现实”，而不仅仅是“再现现实”。"},"examples":[{"en":"The critic argues that theater can be poietic, creating new social meanings.","zh":"评论家认为戏剧可以是 poietic 的，能够创造新的社会意义。"},{"en":"Her poems feel poietic—they don’t just describe the world; they remake it.","zh":"她的诗有种 poietic 的感觉——不只是描写世界，而是在重塑世界。"}]}],"synonyms":["creative","generative","productive","world-making","inventive"],"phonetic":"/pɔɪˈɛtɪk/","extraExplanation":["poietic 来自希腊语词根 poi-（与 poiein“做、创造”有关），常与名词 poiesis（诗艺/生成/创造）一起出现。","它在英文里偏“学术用语”，常见于哲学、美学、文学批评与艺术研究中；日常英语更常用 creative / generative / productive。","相关对比：mimetic（模仿式、再现式）常被拿来与 poietic（生成式、创造式）对照：前者强调“模仿现实”，后者强调“创造/生成现实”。"]}
{"word":"poignado","summary":{"en":"“Poignado” is not standard English; it likely refers to “poignant” (deeply moving) or, less commonly, “poignard/poniard” (a dagger).","zh":"“poignado”不是标准英语；多半是想写“poignant”（动人、令人感伤）或较少见的“poignard/poniard”（匕首）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or misreading of another word (commonly “poignant” or “poignard/poniard”).","zh":"不是标准英语单词。很可能是拼写错误或误读（常见可能是“poignant”或“poignard/poniard”）。"},"examples":[{"en":"I couldn’t find “poignado” in a dictionary—did you mean “poignant”?","zh":"我在词典里找不到“poignado”——你是不是想写“poignant”？"},{"en":"If you can share the sentence you saw it in, I can help identify the intended word.","zh":"如果你把它出现的句子发我，我可以帮你判断原本想表达的词。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “poignant”) strongly emotional in a way that is deeply moving, often with a sense of sadness or longing.","zh":"（可能想写：poignant）令人深受触动的、动人的（常带一丝伤感或惆怅）。"},"examples":[{"en":"The film’s ending is poignant and unforgettable.","zh":"这部电影的结尾很动人，令人难忘。"},{"en":"She wrote a poignant letter about missing home.","zh":"她写了一封很动人的信，谈到想家。"},{"en":"There was something poignant in his quiet smile.","zh":"他安静的微笑里有一种让人心酸的动人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less likely intended: “poignard/poniard”) a small dagger.","zh":"（较不可能的意思：poignard/poniard）匕首，小短剑。"},"examples":[{"en":"In the novel, the assassin carried a concealed poniard.","zh":"在小说里，刺客带着一把藏起来的匕首。"},{"en":"The museum displayed a medieval poignard.","zh":"博物馆展出了一把中世纪匕首。"}]}],"synonyms":["moving","touching","heartfelt","tearful","dagger"],"phonetic":"ˈpɔɪnjənt","extraExplanation":["“poignado”在英语里没有固定、通用的词条。最常见的混淆来源是：\n1) poignant（动人的、令人感伤的）：来自法语词根，和“刺痛/触动（poign-）”的意象相关，所以常指“情感上被刺痛般触动”。\n2) poignard/poniard（匕首）：也是法语来源，文学作品里较常见，但日常英语更常用 dagger。\n如果你把原句贴出来，我可以根据上下文判断你要的是哪一个。"]}
{"word":"poignance","summary":{"en":"Poignance is a deep, moving sadness—often bittersweet and beautiful.","zh":"Poignance 指深切动人的酸楚，常带有苦甜交织的美感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deep, touching feeling of sadness or emotional power, often mixed with beauty, nostalgia, or tenderness.","zh":"一种深切动人的情感（多为悲伤或酸楚），常与美感、怀旧或温柔交织在一起。"},"examples":[{"en":"There was poignance in his voice when he spoke about his childhood.","zh":"他谈到童年时，声音里带着一种酸楚的动人情绪。"},{"en":"The film’s ending is full of poignance—sad, but also beautiful.","zh":"电影的结尾充满了动人心酸——悲伤，却也很美。"},{"en":"Looking at old photos can bring a quiet poignance.","zh":"看旧照片常会带来一种安静的酸楚。"}]}],"synonyms":["pathos","bittersweetness","tenderness","melancholy","emotional depth"],"phonetic":"/ˈpɔɪn.jəns/","extraExplanation":["词源提示：poignance 来自法语影响，和形容词 poignant（“尖锐刺痛的；辛酸动人的”）同源，原意带有“刺、痛”的感觉，因此常用来形容“情感像被轻轻刺到一样”的触动。","搭配建议：常见结构有 the poignance of + 名词（the poignance of farewell 离别的酸楚）、with poignance（带着酸楚/动人情绪）、a sense/touch of poignance（一丝酸楚）。","语体与语感：比起 plain “sadness”（单纯的悲伤），poignance 更强调“悲伤中带美、带温柔、带回味”的复杂情绪，常用于文学评论、电影/音乐评价、回忆与告别场景。"]}
{"word":"poignancies","summary":{"en":"“Poignancies” means the touching, often bittersweet qualities or moments that strongly affect your feelings.","zh":"“Poignancies”指那些强烈触动人心、常带苦甜交织情绪的动人之处（为“poignancy”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the qualities or moments that create a strong, often sad or deeply touching emotional feeling","zh":"引人深受触动的特质或时刻；（常带伤感的）动人之处"},"examples":[{"en":"The film is full of quiet poignancies, like the father fixing his daughter’s bike before she leaves home.","zh":"这部电影充满了细腻的动人之处，比如父亲在女儿离家前帮她修自行车。"},{"en":"In her letters, the poignancies come from what she doesn’t say as much as what she does.","zh":"在她的信里，动人之处既来自她写下的内容，也来自她没说出口的部分。"}]},{"partOfSpeech":"n.","definition":{"en":"sharpness in a feeling, comment, or memory, especially a painful or bitter quality","zh":"（情感、言论或回忆的）尖锐感；（尤指）令人刺痛的苦涩"},"examples":[{"en":"His jokes had little poignancies that made people uncomfortable.","zh":"他的玩笑里带着一些尖锐的刺痛感，让人不太舒服。"},{"en":"Years later, the memory still carried the same poignancy.","zh":"多年以后，那段回忆仍带着同样的刺痛与苦涩。"}]}],"synonyms":["pathos","bittersweetness","emotional impact","pungency","sharpness"],"phonetic":"/ˈpɔɪnənsi/","extraExplanation":["“poignancies” 是名词复数，单数是 “poignancy”。常用于文学/影评写作，强调“许多细小但很打动人的瞬间”（quiet poignancies）。","词源上与法语/拉丁语中“刺、刺痛”的意思有关，所以既可指温柔的感动，也常含“隐隐的痛”。"]}
{"word":"poignancy","summary":{"en":"Poignancy means a deeply touching, often bittersweet emotional quality, or the power to be especially meaningful and impactful.","zh":"Poignancy 指一种深深打动人、常带苦乐参半的感伤，也可指格外有力、意味深长、令人印象深刻的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, often bittersweet feeling of sadness or emotion that deeply touches you.","zh":"一种强烈、常带苦乐参半的悲伤或感动情绪，令人深受触动。"},"examples":[{"en":"There was a quiet poignancy in her farewell letter.","zh":"她的告别信里有一种安静而深切的感伤。"},{"en":"The film’s ending is full of poignancy because it mixes joy with loss.","zh":"这部电影的结局充满动人之处，因为它把喜悦与失去交织在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being especially effective, sharp, or meaningful in a way that makes a strong impact.","zh":"一种格外有力、尖锐或意味深长的特质，能产生强烈冲击。"},"examples":[{"en":"His speech gained poignancy when he spoke about his own experience.","zh":"当他谈到自己的经历时，他的演讲更具感染力与分量。"},{"en":"The poem’s poignancy comes from its simple, honest language.","zh":"这首诗的动人力量来自它朴素而真诚的语言。"}]}],"synonyms":["bittersweetness","pathos","emotional impact","pungency"],"phonetic":"/ˈpɔɪn.jən.si/","extraExplanation":["词源上与“poignant（尖锐的、辛辣的、令人心酸的）”相关，来自法语词根，原意和“刺痛、刺穿”有关，所以它常用来形容情感像“刺到心里一样”强烈。","常见搭配：the poignancy of + 名词（the poignancy of loss/nostalgia）；add poignancy to（为……增添感伤/意味）；a moment of poignancy（一阵/一刻的动人感伤）。","语感对比：poignancy 更偏“被触动的苦甜感/心酸的美”；sadness 只是“悲伤”；nostalgia 是“怀旧”；pathos 更偏文学/艺术中的“引人怜悯的悲情效果”。"]}
{"word":"poignant","summary":{"en":"Poignant means deeply moving—often with a touch of sadness—or sharply meaningful and striking.","zh":"Poignant 指“深深打动人、常带一点忧伤的”，也可指“意味深长、一针见血的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Deeply moving and often slightly sad, in a way that strongly affects your emotions.","zh":"（情感上）深深打动人的；常带一点忧伤、令人心酸的。"},"examples":[{"en":"The film’s ending was poignant and stayed with me for days.","zh":"这部电影的结局很感人，也有点心酸，让我好几天都忘不了。"},{"en":"He gave a poignant speech about losing his mother.","zh":"他发表了一段关于失去母亲的演讲，令人动容。"},{"en":"There was something poignant in the way she smiled through tears.","zh":"她含着泪微笑的样子，有一种说不出的心酸与动人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a remark, memory, or detail) sharply effective or meaningful; striking in a way that highlights what matters.","zh":"（指话语、回忆、细节）一针见血的；意味深长、直击要害的。"},"examples":[{"en":"One poignant detail in the story is the child’s empty chair at dinner.","zh":"故事里一个意味深长的细节是：晚餐桌上孩子那张空椅子。"},{"en":"Her poignant comment changed how everyone saw the situation.","zh":"她那句一针见血的话改变了大家看待这件事的方式。"}]}],"synonyms":["moving","touching","heartbreaking","sad","bittersweet","evocative","trenchant","piercing","telling"],"phonetic":"/ˈpɔɪn.jənt/","extraExplanation":["“poignant”常用来形容一种“感人且带点痛”的情绪冲击：不只是“感动”，还常带失去、怀念、遗憾等味道。","词源上与“刺痛/尖锐”（point）有关，所以它也可以形容“话很犀利、很到位”，像“戳中要害”。","常见搭配：poignant moment（令人心酸的时刻）, poignant reminder（令人感慨/触动的提醒）, poignant memory（令人动容的回忆）, poignant scene（动人的一幕）。"]}
{"word":"poignantly","summary":{"en":"Poignantly means “in a deeply moving way” or “in a sharply effective, telling way.”","zh":"poignantly 表示“令人动容地/心酸地”，也可表示“尖锐有力地、一针见血地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a deeply moving or emotionally touching way, often with a feeling of sadness.","zh":"以深深打动人心的方式（常带有悲伤或惆怅的情绪）。"},"examples":[{"en":"She spoke poignantly about missing her family during the holidays.","zh":"她动情地谈到假期里对家人的思念。"},{"en":"The film ends poignantly, reminding us how quickly life can change.","zh":"电影以令人动容的方式结尾，提醒我们人生变化之快。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a sharp and effective way that strongly highlights an important truth or problem.","zh":"以尖锐而有力的方式（强烈凸显某个重要真相或问题）。"},"examples":[{"en":"The photo poignantly shows the gap between wealth and poverty.","zh":"这张照片有力地凸显了贫富差距。"},{"en":"His joke poignantly pointed out the unfairness of the rule.","zh":"他的玩笑一针见血地指出了这条规定的不公平。"}]}],"synonyms":["movingly","touchingly","sadly","powerfully","tellingly","pointedly"],"phonetic":"/ˈpɔɪn.jənt.li/","extraExplanation":["poignantly 来自形容词 poignant（“令人心酸/辛辣有力的”），其词根与 “刺痛、尖锐” 的感觉有关，所以它既可以表示“情感上刺痛人心”，也可以表示“观点上尖锐到位”。","常见搭配：poignantly aware（痛切地意识到）、poignantly beautiful（美得令人心酸）、poignantly clear（清楚得一针见血）。"]}
{"word":"poignard","summary":{"en":"Poignard means a dagger, or the act of stabbing with one; it’s a literary, old-fashioned word often used in historical or dramatic writing.","zh":"Poignard 指“匕首/短剑”，也可作动词表示“用匕首刺”。它较文学化、偏旧式，常见于历史或戏剧化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dagger; a small, sharp knife used especially as a weapon.","zh":"匕首；短剑（尤指用作武器的小而锋利的刀）。"},"examples":[{"en":"In the novel, the assassin hid a poignard under his cloak.","zh":"在小说里，刺客把匕首藏在斗篷下面。"},{"en":"The museum displayed a jeweled poignard from the Renaissance.","zh":"博物馆展出了一把文艺复兴时期镶宝石的匕首。"}]},{"partOfSpeech":"v.","definition":{"en":"To stab or attack with a dagger.","zh":"用匕首刺；用短刀攻击。"},"examples":[{"en":"He was accused of trying to poignard his rival in the alley.","zh":"他被指控试图在小巷里用匕首刺伤对手。"},{"en":"The hero is nearly poignarded in the dark.","zh":"英雄在黑暗中差点被匕首刺中。"}]}],"synonyms":["dagger","knife","stiletto","stab","knife"],"phonetic":"/ˈpɔɪn.jɑrd/","extraExplanation":["“poignard”是较文学化、带历史感的词，日常英语里更常用“dagger”。","词源来自法语“poignard”，与“poign-”有关（指“拳/手”），暗示这种武器适合近距离用手持刺。","在文学作品中，它常用来营造阴谋、暗杀、宫廷斗争等氛围；有时也会被引申为“背后捅刀”的象征。"]}
{"word":"poignet","summary":{"en":"Poignet is French for “wrist,” and in fashion it can also mean the wrist area/measurement of a sleeve.","zh":"Poignet 是法语“手腕”的意思；在时尚/制衣语境中也可指袖子手腕处或手腕围度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) the wrist (the joint connecting the hand to the arm).","zh":"（法语）手腕；腕关节（连接手与前臂的关节）。"},"examples":[{"en":"She wore a bracelet on her poignet.","zh":"她在手腕上戴了一只手镯。"},{"en":"In the tailoring notes, the sleeve should fit snugly at the poignet.","zh":"在裁缝备注中，袖口应在手腕处贴合。"}]},{"partOfSpeech":"n.","definition":{"en":"In clothing and fashion (from French), the wrist area of a sleeve or the wrist measurement.","zh":"在服装/时尚语境中（源自法语），指袖子到手腕的部位或手腕围度。"},"examples":[{"en":"Measure around the poignet to choose the correct cuff size.","zh":"量一下手腕围度来选择合适的袖口尺寸。"},{"en":"The pattern includes extra room at the poignet for movement.","zh":"这个版型在手腕处留有余量，方便活动。"}]}],"synonyms":["wrist","cuff (fashion context)"],"phonetic":"/pwɑˈnjeɪ/","extraExplanation":["“Poignet”是法语词，常见于时尚、制衣、芭蕾或历史服装描述中；在日常英语里更常用的对应词是“wrist”（手腕）或“cuff”（袖口）。","法语发音接近“pwa-nyay”，其中“gn”发类似英语中“ny”的音。"]}
{"word":"poikile","summary":{"en":"Poikile is a rare word from Greek meaning “variegated” or “painted,” often linked to the Stoa Poikile (“Painted Porch”) in ancient Athens.","zh":"poikile 源自希腊语，较罕用，意为“斑斓多样/彩绘的”，常与古雅典的 Stoa Poikile（彩绘柱廊）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Varied in color or pattern; variegated; mottled.","zh":"（罕用）色彩或图案多样的；斑驳的；杂色的。"},"examples":[{"en":"The manuscript described a poikile surface, shifting between dark and light tones.","zh":"手稿中描写那表面呈现 poikile 的效果，深浅色调不断变化。"},{"en":"Ancient writers often used “poikile” to suggest something richly varied rather than plain.","zh":"古代作者常用“poikile”来表达“丰富多变”，而不是“单调”。"}]},{"partOfSpeech":"n.","definition":{"en":"A Greek term meaning “painted” or “decorated,” best known from the name Stoa Poikile (“Painted Porch”) in ancient Athens.","zh":"一个希腊词，意为“彩绘的/装饰的”，最常见于古雅典的 Stoa Poikile（“彩绘柱廊/彩绘门廊”）之名。"},"examples":[{"en":"Zeno taught in the Stoa Poikile, which is why the philosophy is called Stoicism.","zh":"芝诺在 Stoa Poikile 讲学，因此这门哲学被称为“斯多葛主义（Stoicism）”。"},{"en":"The guide pointed to where the Stoa Poikile once stood near the Agora.","zh":"导游指着雅典集市（Agora）附近 Stoa Poikile 曾经所在的位置。"}]}],"synonyms":["variegated","mottled","multicolored","ornate"],"phonetic":"/ˈpɔɪkɪli/","extraExplanation":["“poikile”来自古希腊语 ποικίλη（poikílē），核心感觉是“多样、斑斓、变化丰富”。在英语里它非常少见，多出现在古典学、艺术史、哲学史语境中。","相关文化点：Stoa Poikile（彩绘柱廊）因墙上有著名历史画而得名；早期斯多葛学派在此讲学，所以“Stoicism（斯多葛主义）”的名称与这座“柱廊”有关。","如果你是在现代英语语境里看到“poikile/poikilo-”，它有时也作为词根出现，表示“多样的/斑斓的”（如 scientific 词汇中偶见）。"]}
{"word":"poikilie","summary":{"en":"“Poikilie” is a rare noun meaning “variegation” or “variation,” from a Greek root meaning “varied/many-colored.”","zh":"“Poikilie”是个较罕见的名词，表示“斑驳/多样性/变化”，源自表示“多彩、变化多”的希腊语词根。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) variation or variegation; having many different forms or irregular patterns (often used in scientific or literary contexts, from the Greek root meaning “many-colored/varied”).","zh":"（罕见用法）变化、多样性、杂色/斑驳；指呈现多种形态或不规则的差异（常见于科学或文学语境，源自希腊语词根，意为“多彩的/多样的”）。"},"examples":[{"en":"The biologist noted poikilie in the species’ shell patterns from one coastline to another.","zh":"生物学家注意到这种物种的贝壳花纹在不同海岸之间呈现出多样性。"},{"en":"In the painting, poikilie appears as a mix of bright and dark tones that never repeats exactly.","zh":"在这幅画里，“poikilie”体现为明暗色调的混合，而且从不完全重复。"}]}],"synonyms":["variegation","variation","diversity","irregularity"],"phonetic":"/ˌpɔɪkɪˈliː/","extraExplanation":["“poikilie”并不是现代英语里很常见、很标准的日常词；你更常见到的是同一词根的词：poikilotherm（变温动物）、poikilocytic/poikilocytosis（红细胞形态多样/异形）。它们都来自希腊语 poikilos（多彩的、变化多的）。","如果你是在读论文或专业书看到这个词，也有可能是专门术语、专名，或拼写变体。你可以把出现它的原句贴出来，我可以帮你根据上下文确认最准确的意思。"]}
{"word":"poikilitic","summary":{"en":"Poikilitic describes a rock texture where small mineral crystals are enclosed inside larger crystals of another mineral.","zh":"Poikilitic 指一种岩石结构：小晶体被包裹在另一种矿物的大晶体之中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology/Petrology) Describing an igneous texture in which small crystals of one mineral are enclosed within larger crystals of another mineral (the larger host is often called oikocryst).","zh":"（地质/岩石学）指一种火成岩结构：一种矿物的小晶体被包裹在另一种矿物的大晶体中（较大的“宿主”晶体常称为 oikocryst）。"},"examples":[{"en":"Under the microscope, the gabbro shows a poikilitic texture with tiny plagioclase grains enclosed in pyroxene.","zh":"在显微镜下，这块辉长岩呈现出包晶结构：辉石的大晶体中包裹着许多细小的斜长石晶粒。"},{"en":"The report notes poikilitic hornblende surrounding smaller feldspar crystals.","zh":"报告指出角闪石呈包晶状，包围着较小的长石晶体。"}]}],"synonyms":["poikilitic texture","inclusion-rich (context-dependent)","enclosing texture (descriptive)"],"phonetic":"/ˌpɔɪ.kəˈlɪt.ɪk/","extraExplanation":["词源来自希腊语 poikilos（“多样的、斑驳的”），用来形容显微尺度下“夹杂/包裹”的晶体分布外观。","poikilitic 常与 oikocryst（宿主大晶体）和 chadacryst（被包裹的小晶体）一起出现；学习这些搭配能更容易读懂岩相学（petrography）描述。","注意拼写：poikilitic（常见美式拼写）；英式文献中也常见 poikilitic/poikilitic texture 的固定搭配。"]}
{"word":"poikilo","summary":{"en":"Poikilo- is a scientific prefix meaning “varied/irregular/changing,” common in biology and medicine.","zh":"poikilo- 是科学常用前缀，表示“多变/不规则/会变化”，常见于生物与医学术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form (prefix) meaning “varied,” “irregular,” or “changing,” used especially in scientific and medical terms.","zh":"构词前缀，表示“多变的、杂色的、不规则的、会变化的”，常用于科学与医学术语。"},"examples":[{"en":"Poikilotherms have body temperatures that change with the environment.","zh":"变温动物的体温会随环境变化而改变。"},{"en":"The doctor mentioned poikilocytosis, meaning unusually varied red blood cell shapes.","zh":"医生提到“异形红细胞增多症”，意思是红细胞形状异常多样。"},{"en":"In biology texts, poikilo- often signals that something is not uniform.","zh":"在生物学教材中，poikilo- 常提示某种特征“不一致/不均一”。"}]}],"synonyms":["variegated (meaning-related)","variable (meaning-related)","irregular (meaning-related)"],"phonetic":"ˈpɔɪkɪloʊ","extraExplanation":["“poikilo-”来自希腊语词根 *poikilos*，含“斑驳的、变化多端的”之意。它多见于专业词汇中（如 *poikilotherm* 变温动物、*poikilocytosis* 红细胞形态多样）。日常英语里几乎不单独作为一个词使用。","你输入的“poikilo”更像是词根/前缀的简写或截断形式；完整术语通常会接在后面组成一个长词。"]}
{"word":"poikiloblast","summary":{"en":"A medical term for an abnormally shaped red blood cell.","zh":"医学术语：指形状异常的红细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormally shaped red blood cell, seen in certain blood disorders (especially severe anemia).","zh":"畸形红细胞；形状异常的红细胞（常见于某些血液疾病，尤其是严重贫血）。"},"examples":[{"en":"The blood smear showed poikiloblasts and other abnormal red blood cells.","zh":"血涂片显示有畸形红细胞以及其他异常红细胞。"},{"en":"Poikiloblasts may appear when the bone marrow is under stress from severe anemia.","zh":"当骨髓因严重贫血而处于压力状态时，可能会出现畸形红细胞。"}]}],"synonyms":["poikilocyte","abnormally shaped red blood cell","irregular erythrocyte"],"phonetic":"ˈpɔɪkɪloʊˌblæst","extraExplanation":["词源提示：poikilo- 来自希腊语，意为“多样的、变化的”；-blast 常指“未成熟的细胞”。不过在实际检验语境里，poikiloblast 常被用来描述“形状异常的红细胞”，学习时可把它与更常见的 poikilocyte（畸形红细胞）联系记忆。","使用场景：多见于血液学/检验报告（如外周血涂片、血象描述）。在日常英语中很少出现，主要用于医学专业交流。"]}
{"word":"poikiloblastic","summary":{"en":"A geology term for metamorphic rocks where large crystals contain many small mineral inclusions.","zh":"地质学术语：指变质岩中大晶体内部含有大量小矿物包裹体的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Describing a metamorphic texture in which large crystals (porphyroblasts) contain many small inclusions of other minerals.","zh":"（地质/变质岩）指一种变质结构：较大的晶体（变斑晶）内部含有许多其他矿物的小包裹体（内含物）。"},"examples":[{"en":"Under the microscope, the garnet shows a poikiloblastic texture with many quartz inclusions.","zh":"在显微镜下，这颗石榴子石呈现包裹变晶（poikiloblastic）结构，内部有许多石英包裹体。"},{"en":"The rock is described as poikiloblastic because its porphyroblasts trap fine-grained minerals.","zh":"这块岩石被描述为包裹变晶结构（poikiloblastic），因为它的变斑晶包裹了细粒矿物。"}]}],"synonyms":["inclusion-rich (contextual)","poikiloblastic texture (phrase)"],"phonetic":"/ˌpɔɪkɪləˈblæs.tɪk/","extraExplanation":["词源：来自希腊语 poikilos（“斑驳的、多样的”）+ -blast（在地质学中常指“新生成的晶体/变晶”，见 porphyroblast 变斑晶）。","学习提示：poikiloblastic 常用于岩石薄片显微镜描述，强调“变斑晶里充满许多内含物”；不要与 porphyritic（火成岩中“斑状结构”）混淆，后者主要谈的是“较大晶体嵌在细基质中”，不一定强调大量包裹体。"]}
{"word":"poikilocyte","summary":{"en":"A poikilocyte is an abnormally shaped red blood cell, often noted in medical tests as a clue to certain blood conditions.","zh":"poikilocyte 指异形红细胞，即形状异常的红细胞，常在化验中作为提示某些血液问题的线索。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormally shaped red blood cell (RBC), seen under a microscope; it can be a sign of certain blood disorders.","zh":"异形红细胞（形状异常的红血球）；在显微镜下可见，可能提示某些血液疾病。"},"examples":[{"en":"The blood smear showed many poikilocytes, suggesting an underlying anemia.","zh":"血涂片显示许多异形红细胞，提示可能存在贫血等潜在问题。"},{"en":"Poikilocytes can appear in several conditions, so doctors interpret them along with other lab findings.","zh":"异形红细胞可见于多种情况，因此医生会结合其他化验结果一起判断。"}]}],"synonyms":["abnormally shaped red blood cell","abnormal erythrocyte"],"phonetic":"/ˈpɔɪkɪləˌsaɪt/","extraExplanation":["“Poikilocyte”多用于医学语境，来自希腊语词根：poikilo-（多样的、不规则的）+ -cyte（细胞）。","相关概念：\n- poikilocytosis（异形红细胞增多）：指血液中异形红细胞数量增多的现象。\n- 与之相对的概念是“正常形态的红细胞”，通常呈双凹圆盘状。","常见的“异形红细胞”类型在临床描述中可能包括：镰刀形细胞（sickle cells）、泪滴形细胞（teardrop cells）、棘形细胞/棘红细胞（acanthocytes）、靶形细胞（target cells）等；具体意义取决于类型和整体检验结果。"]}
{"word":"poikilocythemia","summary":{"en":"Poikilocythemia is a lab/medical term describing red blood cells that vary greatly in both size and shape.","zh":"Poikilocythemia 指红细胞大小与形状都明显不均一的检验/医学术语描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal condition in which red blood cells vary widely in both size and shape (often seen on a blood smear).","zh":"红细胞大小与形状都明显不均一的异常状态（常在血涂片检查中发现）。"},"examples":[{"en":"The blood smear showed poikilocythemia, suggesting an underlying anemia.","zh":"血涂片显示有红细胞大小形态异常，提示可能存在某种贫血。"},{"en":"Poikilocythemia can appear in severe iron deficiency or other disorders that affect red blood cell production.","zh":"在严重缺铁或其他影响红细胞生成的疾病中，可能出现红细胞大小形态异常。"}]}],"synonyms":["red blood cell anisopoikilocytosis","anisopoikilocytosis"],"phonetic":"/ˌpɔɪ.kɪ.loʊ.saɪˈθiː.mi.ə/","extraExplanation":["该词常用于血液学检验报告或医生讨论中，表示“红细胞既有形态多样（poikilo-）又有大小不一（-cythemia 与血细胞相关）”。它本身不是一个具体疾病名称，更像是一个“检查所见/体征”，需要结合病因（如缺铁性贫血、巨幼细胞性贫血、地中海贫血、骨髓疾病等）进一步评估。","在口语或一般科普中更常见的相关词是：poikilocytosis（红细胞形态多样）和 anisocytosis（红细胞大小不一）；poikilocythemia 相对更偏专业、较少单独使用。"]}
{"word":"poikilocytosis","summary":{"en":"Poikilocytosis means having many abnormally shaped red blood cells.","zh":"Poikilocytosis 指红细胞形态异常增多（出现大量形状不正常的红细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which many red blood cells are abnormally shaped (varied shapes), often seen on a blood smear and linked to certain diseases.","zh":"（医学）红细胞形态异常增多：指血液中出现大量形状不正常、形态多样的红细胞，常在血涂片检查中发现，并可能与某些疾病有关。"},"examples":[{"en":"The lab report noted poikilocytosis on the peripheral blood smear.","zh":"化验报告在外周血涂片中提示存在红细胞形态异常增多（poikilocytosis）。"},{"en":"Poikilocytosis can appear in some types of anemia.","zh":"在某些类型的贫血中可能会出现红细胞形态异常增多。"}]}],"synonyms":["abnormal red blood cell morphology","poikilocytosis (blood smear finding)"],"phonetic":"/ˌpɔɪ.kɪ.loʊ.saɪˈtoʊ.sɪs/","extraExplanation":["词源提示：poikilo- 表示“多样的、杂色的”，-cyte 表示“细胞”，-osis 常表示“状态/病理改变”。因此该词字面意思是“细胞形态多样的状态”。","临床语境：这通常是“检查所见（finding）”而非单独的疾病诊断。医生会结合血红蛋白、红细胞指数、病史与其他检查结果来判断原因。","常见相关情况（举例）：缺铁性贫血、巨幼细胞性贫血（如叶酸/维生素B12缺乏）、地中海贫血、某些肝病或骨髓疾病等。具体解释需由医生结合个体情况判断。"]}
{"word":"poikilotherm","summary":{"en":"A poikilotherm is an animal whose body temperature varies with the environment (often called cold-blooded).","zh":"poikilotherm 指体温随环境变化的变温动物（常称“冷血动物”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal whose body temperature changes with the temperature of its surroundings; a “cold-blooded” animal (common in fish, amphibians, and reptiles)","zh":"变温动物；体温会随环境温度变化的动物（俗称“冷血动物”，常见于鱼类、两栖类和爬行动物）"},"examples":[{"en":"Many reptiles are poikilotherms, so they bask in the sun to warm up.","zh":"许多爬行动物是变温动物，所以它们会晒太阳来让身体变暖。"},{"en":"Because a frog is a poikilotherm, cold weather can slow its movement.","zh":"因为青蛙是变温动物，寒冷天气会让它动作变慢。"}]}],"synonyms":["cold-blooded animal","ectotherm"],"phonetic":"ˈpɔɪkɪləˌθɝm","extraExplanation":["词源提示：poikilo- 来自希腊语，意思是“多样的、变化的”；-therm 和“温度、热”有关。合起来就是“温度会变化的（动物）”。","用法与语境：科学写作里常用 poikilotherm，但日常英语更常说 cold-blooded animal（不过“cold-blooded”也有“冷酷无情”的比喻义，谈动物时要注意语境）。","相关术语：ectotherm（外温动物）也常见，强调主要依靠外界热源；poikilotherm 强调体温本身“波动变化”。两者常常重叠，但概念焦点不同。"]}
{"word":"poikilothermal","summary":{"en":"Poikilothermal describes animals whose body temperature varies with the environment (cold-blooded).","zh":"poikilothermal 指体温会随环境变化的动物（变温的/俗称冷血的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having a body temperature that changes with the surrounding environment; “cold-blooded.”","zh":"（动物）体温会随环境温度变化的；变温的（常说“冷血动物”）。"},"examples":[{"en":"Many reptiles are poikilothermal, so they bask in the sun to warm up.","zh":"许多爬行动物是变温动物，所以它们会晒太阳来升温。"},{"en":"Because it is poikilothermal, its activity level drops in cold weather.","zh":"因为它是变温动物，天气冷时它的活动水平会下降。"}]}],"synonyms":["cold-blooded","ectothermic"],"phonetic":"/ˌpɔɪ.kɪ.loʊˈθɝː.məl/","extraExplanation":["词源：来自希腊语 *poikilos*（“多变的、各式各样的”）+ *thermē*（“热、温度”）。字面意思是“温度多变的”。","学习提示：日常英语更常用 **cold-blooded**；在生物学/科普写作中才更常见 **poikilothermal**（以及同义但更常见的科学词 **ectothermic**）。其中 *ectothermic* 强调“热量主要来自外界”，*poikilothermal* 更强调“体温会随外界波动”。","使用语境：多用于动物生理学、生态学教材与论文。写作中常与 reptiles（爬行动物）、amphibians（两栖类）、fish（鱼类）等一起出现。"]}
{"word":"poikilothermic","summary":{"en":"Poikilothermic describes animals whose body temperature varies with the environment.","zh":"poikilothermic 指体温随环境变化的“变温动物/变温的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having a body temperature that changes with the temperature of the surrounding environment; not maintaining a constant internal temperature.","zh":"（指动物）变温的；体温会随周围环境温度变化，而不是保持恒定内温。"},"examples":[{"en":"Most reptiles are poikilothermic, so they bask in the sun to warm up.","zh":"大多数爬行动物是变温动物，所以它们会晒太阳来取暖。"},{"en":"Because the fish is poikilothermic, cold water slows its movement and metabolism.","zh":"因为鱼是变温动物，冷水会让它的活动和新陈代谢变慢。"}]}],"synonyms":["ectothermic","cold-blooded","variable-temperature"],"phonetic":"/ˌpɔɪ.kə.loʊˈθɝː.mɪk/","extraExplanation":["在日常英语里，这个词比较学术/生物学用语。更常见的说法是 ectothermic（外温的）或 cold-blooded（冷血的；口语但不严格）。不过要注意：cold-blooded 在比喻义里也可指“冷酷无情”，而 poikilothermic 只用于生物学语境。","词源：来自希腊语 poikilos（多变的）+ thermē（热）。","相关对立概念是 homeothermic（恒温的），常用于描述鸟类和哺乳动物。"]}
{"word":"poikilothermism","summary":{"en":"Poikilothermism is the trait of having a body temperature that varies with the environment.","zh":"Poikilothermism 指“变温性”，即体温会随环境温度变化的特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or trait of having a body temperature that changes with the temperature of the surrounding environment (common in many fish, amphibians, and reptiles)","zh":"变温性；体温会随外界环境温度而变化的特性（常见于许多鱼类、两栖类和爬行动物）"},"examples":[{"en":"Poikilothermism helps many reptiles conserve energy because they do not need to keep a constant body temperature.","zh":"变温性帮助许多爬行动物节省能量，因为它们不需要维持恒定体温。"},{"en":"In cold weather, an animal with poikilothermism may become less active as its body temperature drops.","zh":"在寒冷天气里，具有变温性的动物体温下降，可能会变得不那么活跃。"}]}],"synonyms":["poikilothermy","ectothermy (related)","cold-bloodedness (informal/approx.)"],"phonetic":"/ˌpɔɪ.kə.loʊˈθɝː.mɪ.zəm/","extraExplanation":["“poikilothermism”常见于生理学/动物学语境，较正式、偏学术。日常英语里更常用的相关词是“cold-blooded”（冷血的，口语但不精确）或“ectothermic”（外温动物的，更科学）。","它与“homeothermy”（恒温性，如人类与鸟类）相对；但要注意，“变温（poikilotherm）”与“外温（ectotherm）”概念接近但不完全相同：外温强调热量主要来自外界来源，变温强调体温本身不恒定。"]}
{"word":"poikilothermy","summary":{"en":"Poikilothermy is the state of having a body temperature that varies with the environment (cold-bloodedness).","zh":"Poikilothermy 指体温随环境温度变化的状态（变温性/冷血性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of an animal) the condition of having a body temperature that changes with the surrounding environment; “cold-bloodedness.”","zh":"（动物）体温会随外界环境温度变化的状态；“变温性/冷血性”。"},"examples":[{"en":"Lizards show poikilothermy, so they bask in the sun to warm up.","zh":"蜥蜴具有变温性，所以会晒太阳来升温。"},{"en":"Because of poikilothermy, many reptiles become less active in cold weather.","zh":"由于变温性，许多爬行动物在寒冷天气里会更不活跃。"}]}],"synonyms":["cold-bloodedness","ectothermy"],"phonetic":"/ˌpɔɪ.kəˈloʊ.θɚ.mi/","extraExplanation":["“poikilothermy”常见于生物学语境，来自希腊语：poikilos（多变的）+ thermē（热）。意思是体温“多变”。","学习提示：日常英语里更常用的说法是“cold-blooded”，但在科学写作中“poikilothermy”更精确。它大致对应“变温动物”，常见例子包括多数鱼类、两栖类和爬行动物。"]}
{"word":"poil","summary":{"en":"Poil means an animal’s hair or fur, especially when talked about as a material or surface texture.","zh":"poil指动物的毛或皮毛，尤指作为材料或表面质感来描述时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animal hair or fur (especially when considered as a material, such as the fur on a coat or in textiles)","zh":"（动物的）毛、皮毛（尤指作为材料或用于纺织、皮草等时）"},"examples":[{"en":"The fabric has a soft poil that feels warm against the skin.","zh":"这种布料有柔软的毛感，贴在皮肤上很暖和。"},{"en":"The cat’s poil became thicker in winter.","zh":"这只猫到了冬天皮毛变得更厚了。"}]}],"synonyms":["fur","hair","coat","pelt","nap","pile"],"phonetic":"/pwɑl/","extraExplanation":["“poil”是从法语借入英语的词，法语里常指“毛发、皮毛”。在英语中它比较少见，多出现在纺织、皮草、服装描述等较正式或专业的语境里。","在面料描述中，poil常带有“表面有细毛/绒毛的质感”的意味，接近你在商品说明里看到的“nap（绒毛/起绒表面）”“pile（绒面/绒毛）”这一类概念。"]}
{"word":"poilu","summary":{"en":"Poilu means a French World War I infantryman, a common, respectful nickname for the front-line soldier.","zh":"Poilu 指一战时期的法国步兵士兵，是对前线普通士兵的常见尊称/昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French infantry soldier in World War I; often used as a respectful, affectionate nickname for the ordinary French “front-line” soldier","zh":"（一战时期的）法国步兵士兵；常作对普通法国前线士兵的尊称或昵称"},"examples":[{"en":"The museum exhibit described the daily life of the poilu in the trenches.","zh":"博物馆展览介绍了一战战壕里法国士兵（poilu）的日常生活。"},{"en":"Letters from a poilu often mix humor with exhaustion and hope.","zh":"法国士兵（poilu）的家书里常常夹杂幽默、疲惫与希望。"}]}],"synonyms":["French WWI soldier","Tommy (British equivalent)","doughboy (U.S. equivalent)"],"phonetic":"/pwɑˈlu/","extraExplanation":["“Poilu”在法语里字面意思接近“多毛的/长胡子的”，指一战前线士兵常留胡子、显得粗犷朴实的形象；带有亲切与敬意。","英语里多作为历史语境用词（常见于一战史、文学与纪念活动），通常不用来泛指现代法国军人。"]}
{"word":"poilus","summary":{"en":"“Poilus” refers to French WWI infantry soldiers, especially the ordinary front-line men.","zh":"“poilus”指一战时期的法国步兵，尤指前线的普通士兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French infantry soldier, especially one who fought in World War I.","zh":"（尤指）第一次世界大战中的法国步兵；法国一战士兵。"},"examples":[{"en":"My great-grandfather was one of the poilus who fought at Verdun.","zh":"我曾祖父是参加过凡尔登战役的法国一战士兵之一。"},{"en":"The museum exhibit shows uniforms worn by the poilus on the Western Front.","zh":"博物馆展览展示了西线战场上一战法国士兵穿过的军装。"}]}],"synonyms":["French WWI soldiers","French infantrymen (WWI)"],"phonetic":"/pwɑˈlu/","extraExplanation":["“poilu”在法语里本义是“多毛的、长胡子的”，在一战语境中带有亲切、朴实、坚韧的意味，用来称呼前线的普通法国士兵；英文里常直接借用法语复数形式“poilus”（也可见“poilus soldiers”之类的说法）。","语体提示：这是带明显历史语境的词，多用于战争史、文学与纪念叙事中；泛指现代法国士兵通常不用这个词。"]}
{"word":"poimenic","summary":{"en":"Poimenic means “pastoral” or “shepherding,” especially the spiritual care and guidance a pastor provides.","zh":"poimenic 指“牧养的/牧者关怀的”，尤指牧师对信徒群体的灵性照顾与引导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pastoral (shepherd-like) care in Christian ministry, especially the guidance and spiritual care a pastor gives to a community.","zh":"与基督教牧养（如牧人照顾羊群般的关怀）有关的；尤指牧师对群体的引导与灵性关怀。"},"examples":[{"en":"The course focuses on poimenic counseling for people in grief.","zh":"这门课程侧重于为哀伤者提供的牧养辅导。"},{"en":"Her research explores poimenic leadership in small churches.","zh":"她的研究探讨小型教会中的牧养式领导。"}]}],"synonyms":["pastoral","shepherding","ministerial"],"phonetic":"/pɔɪˈmɛnɪk/","extraExplanation":["“poimenic”比较少见，更常见的词是“pastoral”（牧养的）。它来自希腊语词根 poimēn（意为“牧人/牧羊人”），在基督教语境中常用“牧人照料羊群”来比喻照顾信徒的需要（如安慰、劝勉、引导）。","使用场景多见于神学、教牧学（pastoral theology）与教牧辅导（pastoral counseling）的学术写作中；日常英语里通常直接说 “pastoral care / pastoral counseling”。"]}
{"word":"poimenics","summary":{"en":"Poimenics means the study and practice of pastoral care and counseling in Christian ministry.","zh":"Poimenics 指基督教语境中的牧会关怀与辅导（的研究与实践）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and practice of pastoral care and counseling, especially within Christian ministry","zh":"（尤指基督教事工中的）牧会关怀与辅导的研究与实践"},"examples":[{"en":"She is taking a course in poimenics to learn how to support people in grief.","zh":"她在学习一门“poimenics（牧会关怀学）”课程，了解如何陪伴哀伤中的人。"},{"en":"In many seminaries, poimenics covers topics like listening skills, crisis care, and ethical boundaries.","zh":"在许多神学院里，poimenics 会涵盖倾听技巧、危机关怀和伦理界限等主题。"}]}],"synonyms":["pastoral care","pastoral counseling","practical theology (related)"],"phonetic":"/pɔɪˈmɛnɪks/","extraExplanation":["词源来自希腊语 *poimēn*（意为“牧人、牧羊人”）。因此它常带有“像牧人照顾羊群一样照顾会众/个体”的隐喻色彩。","该词在日常英语中不常见，更多出现在神学院课程名称、宗教教育或教会培训语境中；有时也会与 *pastoral theology*（牧灵神学）或 *pastoral counseling*（牧会辅导）并用或部分重叠。"]}
{"word":"poinado","summary":{"en":"“Poinado” is not recognized as a standard English word; it likely needs context or a corrected spelling.","zh":"“poinado”不是标准英语词，通常需要上下文或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling, a username/name, or a word from another language.","zh":"不是标准英语词；很可能是拼写错误、用户名/姓名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “poinado” in an English dictionary—do you mean another word?","zh":"我在英语词典里找不到“poinado”——你是不是想写另一个词？"},{"en":"If you share the sentence where you saw “poinado,” I can help identify what it was meant to be.","zh":"如果你把看到“poinado”的句子发出来，我可以帮你判断它原本想表达的词。"}]}],"phonetic":"/pɔɪˈnɑːdoʊ/","extraExplanation":["“poinado”在常见英语词典中没有收录。它可能是：\n1）把某个英语单词拼错了（例如以“poin-”开头的词）；\n2）人名、地名、品牌名或网名；\n3）西班牙语/葡萄牙语等语言中的词形。\n把你看到它的上下文（整句或前后各一两句）贴出来，我可以更准确地帮你对照可能的正确拼写与意思。"]}
{"word":"poinard","summary":{"en":"A poinard is a dagger; as a verb, it means to stab with a dagger.","zh":"poinard 指“匕首”；作动词则指“用匕首刺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dagger, especially a slender stabbing knife (often used historically in Europe).","zh":"匕首；（尤指）细长的刺杀用短刀（常见于欧洲历史语境）。"},"examples":[{"en":"The assassin drew a poinard from his sleeve.","zh":"刺客从袖子里抽出一把匕首。"},{"en":"In the novel, the hero is threatened with a jeweled poinard.","zh":"在小说里，英雄被一把镶宝石的匕首威胁。"}]},{"partOfSpeech":"vt.","definition":{"en":"To stab or pierce someone with a dagger.","zh":"用匕首刺；刺穿。"},"examples":[{"en":"He was accused of trying to poinard a rival.","zh":"他被指控企图用匕首刺伤对手。"},{"en":"The story says the guard was poinarded in the dark alley.","zh":"故事说那名守卫在黑巷里被人用匕首刺了。"}]}],"synonyms":["dagger","stiletto","dirk","knife (general)","poignard"],"phonetic":"/ˈpɔɪ.nɑrd/","extraExplanation":["“poinard”是较文学化、带历史色彩的词，在现代日常英语里更常用“dagger”或“knife”。它常出现在侦探小说、历史小说、或描写阴谋与暗杀的语境中，因此语气往往更戏剧化。","词源来自法语“poignard”（匕首）。英语里也常见法语拼写“poignard”。"]}
{"word":"poinciana","summary":{"en":"A poinciana is a tropical ornamental tree famous for its bright red-orange flowers (royal poinciana).","zh":"poinciana 指以红橙色花著名的热带观赏树——凤凰木（皇家凤凰木）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical ornamental tree with large fern-like leaves and showy red-orange flowers; also called the royal poinciana (Delonix regia).","zh":"凤凰木；一种热带观赏树，叶似蕨类，开鲜艳的红橙色大花（又称“皇家凤凰木”，学名 Delonix regia）。"},"examples":[{"en":"Royal poincianas line the streets in some coastal cities.","zh":"在一些海滨城市，街道两旁常种着凤凰木。"},{"en":"The poinciana blooms in early summer, turning the whole canopy bright red.","zh":"凤凰木在初夏开花，整片树冠都会变得鲜红。"}]}],"synonyms":["royal poinciana","flamboyant","Delonix regia"],"phonetic":"/pɔɪn.siˈæn.ə/","extraExplanation":["“poinciana”常指“royal poinciana（凤凰木）”，在英语里也可能被用来泛指几种相近的观赏树名，但最常见、最典型的就是 Delonix regia。","词源上与17世纪法国殖民官员 de Poincy（德·庞西）有关：早期植物命名中曾用“Poinciana”作属名，后来分类调整，但英文俗名沿用至今。","在美国语境中，尤其在佛罗里达、夏威夷等温暖地区，“poinciana”常带有热带风景、盛夏与鲜艳花季的联想。"]}
{"word":"poincianas","summary":{"en":"“Poincianas” means more than one poinciana (royal poinciana), a tropical tree famous for its bright red-orange flowers.","zh":"“poincianas”是 poinciana 的复数，指多棵凤凰木（皇家凤凰木），以鲜艳的红橙色花朵著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of poinciana: a tropical flowering tree (especially the royal poinciana) with large, bright red-orange blossoms.","zh":"poinciana 的复数：一种热带开花树（尤指凤凰木/皇家凤凰木），以大片鲜艳的红橙色花朵著称。"},"examples":[{"en":"The streets were lined with poincianas in full bloom, turning the neighborhood red and gold.","zh":"街道两旁种满了盛开的 poincianas，把社区染成红色和金色。"},{"en":"In early summer, the poincianas drop petals that cover the sidewalks like confetti.","zh":"初夏时，poincianas 的花瓣落下来，像彩纸一样铺满人行道。"}]}],"synonyms":["royal poincianas","royal poinciana trees","flamboyant trees","Delonix regia","flame trees"],"phonetic":"/ˌpɔɪnsiˈænə/","extraExplanation":["“poinciana”常指“royal poinciana”（学名 Delonix regia），在中文里多叫“凤凰木”。在加勒比、佛罗里达、夏威夷、东南亚等热带/亚热带地区很常见，常被种作行道树或庭园观赏树。","注意有时也会被泛称为“flame tree”（火焰树），但“flame tree”在不同地区可能指别的树种；需要更精确时可说“royal poinciana / Delonix regia”。"]}
{"word":"poind","summary":{"en":"Poind is a rare Scottish legal word meaning to seize (impound) someone’s property to pay a debt, or the act of doing so.","zh":"Poind 是少见的苏格兰法律用语，指为偿债而扣押/查封财物，或指这种扣押行为本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Scotland, law; old-fashioned) To seize or take someone’s property to pay a debt; to impound.","zh":"（苏格兰法律；旧式）扣押/查封某人的财物以偿还债务；将财物扣留（类似“查封”“扣押”）。"},"examples":[{"en":"The sheriff may poind a debtor’s goods if the debt is not paid.","zh":"如果债务未偿还，治安官可能会查封债务人的财物。"},{"en":"They threatened to poind his livestock for unpaid rent.","zh":"他们威胁要因未付房租而扣押他的牲畜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, law; old-fashioned) The act of seizing property for payment of a debt.","zh":"（苏格兰法律；旧式）为偿债而进行的扣押/查封（行为或程序）。"},"examples":[{"en":"The court ordered poind of the equipment to settle the claim.","zh":"法院下令查封这些设备以清偿索赔。"}]}],"synonyms":["seize","impound","confiscate","distrain"],"phonetic":"/pɔɪnd/","extraExplanation":["“poind”是一个比较少见的词，主要见于苏格兰英语与法律语境（也常写作 *poinding*）。在日常英语里更常用的是 *seize*（扣押）或 *impound*（扣押/暂扣）。","很多学习者把“poind”当作“point”的拼写错误。如果你本来想查的是 *point*（要点/指向/指出），告诉我我可以给你更常用的释义与例句。"]}
{"word":"poindable","summary":{"en":"“Poindable” isn’t standard English; it’s likely a misspelling of “pointable,” meaning able to be pointed at or selected with a pointer.","zh":"“poindable”不是标准英语；多半是“pointable”的拼写错误，意思是“可被指向/可用指针选中”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “pointable.”","zh":"不是标准英语单词；很可能是把“pointable”拼错了。"},"examples":[{"en":"I couldn’t find “poindable” in the dictionary—did you mean “pointable”?","zh":"我在词典里找不到“poindable”——你是想写“pointable”吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(pointable) Able to be pointed at, pointed to, or selected with a pointer (e.g., a mouse, stylus, or laser pointer).","zh":"（pointable）可被指向/指到的；（在计算机等场景中）可用指针（鼠标、触控笔、激光笔等）指向或选中的。"},"examples":[{"en":"Make the buttons large and pointable on mobile screens.","zh":"让按钮在手机屏幕上更大、更容易用手指点到。"},{"en":"The sign should be clearly pointable from across the room.","zh":"这个标志应该在房间另一头也能让人清楚地指给别人看。"}]}],"synonyms":["clickable","selectable","targetable"],"phonetic":"/ˈpɔɪn.tə.bəl/","extraExplanation":["“pointable”常见于科技/界面设计语境（如“pointable device”指可用来指向的设备：鼠标、触控板等）。日常对话里也可以用更简单的说法，比如“easy to point to / easy to click”。","如果你原本想表达“很有感染力/令人感伤”的意思，可能想写的是“poignant”（/ˈpɔɪn.jənt/）。如果你告诉我上下文句子，我可以帮你准确判断。"]}
{"word":"poinded","summary":{"en":"“Poinded” is a Scottish legal/historical word meaning property was seized to pay a debt.","zh":"“poinded”是苏格兰法律/历史用语，指为偿债而依法扣押财物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense and past participle of “poind” (Scottish English): to legally take someone’s goods to pay a debt; to seize property under authority (similar to “distrain”).","zh":"“poind”的过去式/过去分词（苏格兰英语）：依法扣押他人财物以偿还债务；在法律授权下没收/查封财产（类似 distrain）。"},"examples":[{"en":"In older Scottish records, a debtor’s cattle could be poinded for unpaid rent.","zh":"在较早的苏格兰档案中，欠租者的牛可能会被依法扣押（poinded）来抵租。"},{"en":"The court ordered that certain goods be poinded to satisfy the debt.","zh":"法院命令扣押（poinded）部分物品以清偿债务。"}]}],"synonyms":["seized","distrained","confiscated"],"phonetic":"/ˈpɔɪndɪd/","extraExplanation":["“poind / poinded”主要见于苏格兰法律或历史语境，在现代日常英语里很少用。更常见的通用英语对应词是 “seized (property)” 或 “distrained”。","如果你本来想写的是常见词 “pointed”（例如 pointed finger / pointed remark），告诉我你的句子，我可以帮你确认并给出对应释义。"]}
{"word":"poinder","summary":{"en":"“Poinder” is usually a misspelling of “pointer”: something/someone that points or indicates; also the computer pointer or a hunting dog breed.","zh":"“poinder”通常是“pointer”的拼写错误：指示物/指示者；也可指电脑指针或一种指示犬。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Intended word: “pointer” — a person or thing that points, shows, or indicates something.","zh":"（常见拼写错误）多半想写的是“pointer”——指向、指示某物的人或事物。"},"examples":[{"en":"I think you meant “pointer,” not “poinder.”","zh":"我觉得你想写的是“pointer”，不是“poinder”。"},{"en":"The teacher used a laser pointer to show the map.","zh":"老师用激光笔在地图上指示。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or object that points or directs attention to something (e.g., a finger, a sign, a laser device).","zh":"指示物或指示者：用来指向或引导注意力的东西/人（如手指、标志、激光笔等）。"},"examples":[{"en":"She raised her finger as a pointer to the line in the book.","zh":"她抬起手指指着书里的那一行。"},{"en":"This arrow is a helpful pointer to the exit.","zh":"这个箭头是一个指向出口的好提示。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, the on-screen arrow or marker you move with a mouse or touchpad.","zh":"（计算机）指针：屏幕上可用鼠标/触控板移动的箭头或标记。"},"examples":[{"en":"Move the pointer over the button and click.","zh":"把指针移到按钮上然后点击。"},{"en":"My pointer disappeared, so I restarted the laptop.","zh":"我的鼠标指针不见了，所以我重启了电脑。"}]},{"partOfSpeech":"n.","definition":{"en":"A hunting dog breed trained to “point” (freeze and indicate) where game birds are.","zh":"（犬种）指示犬：训练用来“定点示意”猎物（常为猎鸟）所在位置的狗。"},"examples":[{"en":"The pointer stood still and signaled where the birds were.","zh":"那只指示犬站得笔直不动，示意鸟的位置。"}]}],"synonyms":["indicator","sign","cue","cursor","marker"],"phonetic":"/ˈpɔɪntər/","extraExplanation":["“poinder”在标准英语里不是常见单词，最常见情况是把“pointer”拼错了。","如果你原本想表达“pounder”（重击者/捣碎工具）或“poignant”（辛酸的/动人的），也可能是拼写接近造成的混淆；你可以告诉我你想用它的句子，我帮你确认。"]}
{"word":"poinding","summary":{"en":"“Poinding” is not a standard spelling; it most often means “pounding” (heavy repeated hitting/strong heartbeat), or possibly “pointing” (directing/aiming).","zh":"“poinding”不是标准拼写；最常见是想写“pounding”（猛烈敲打/心跳砰砰），也可能是“pointing”（指向/指认）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “pounding”) A strong, repeated hitting or striking; a heavy blow or series of blows.","zh":"（很可能是想写：pounding）猛烈、反复的敲打/撞击；重击或一连串重击。"},"examples":[{"en":"I heard a pounding on the door late at night.","zh":"我深夜听到有人在门上猛敲。"},{"en":"The waves gave the boat a constant pounding.","zh":"海浪不断拍打着小船。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “pounding”) Hitting or beating repeatedly and strongly; also used for a fast, strong heartbeat.","zh":"（很可能是想写：pounding）猛烈地反复击打；也可指心跳强烈、急促。"},"examples":[{"en":"She was pounding on the table to get everyone’s attention.","zh":"她用力拍桌子来引起大家注意。"},{"en":"My heart was pounding after the run.","zh":"跑完后我心跳得很厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “pointing”) Directing attention or aiming toward something with a finger or object.","zh":"（另一种可能：pointing）用手指/物体指向某处；把注意力引向某事。"},"examples":[{"en":"He was pointing at the map to show the route.","zh":"他指着地图来说明路线。"},{"en":"The sign is pointing to the exit.","zh":"标志指向出口。"}]}],"synonyms":["pounding: beating","pounding: thumping","pointing: indicating","pointing: directing"],"phonetic":"/ˈpaʊndɪŋ/","extraExplanation":["“poinding”不是常见的标准英文拼写，最常见的可能是拼错了：\n1) “pounding”（有重击/猛敲、心跳砰砰等意思）\n2) “pointing”（指向、指认）\n如果你能提供一句原句，我可以帮你确认到底想表达哪一个。"]}
{"word":"poinds","summary":{"en":"“Pound” most commonly means a unit of weight, and it can also mean the UK currency (￡). As a verb, it means to hit hard repeatedly or (of a heart) to beat strongly.","zh":"“pound”最常指“磅（重量单位）”，也可指“英镑（￡）”。作动词时表示“猛烈敲打”，或（心脏）“剧烈跳动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of weight equal to 16 ounces (about 0.45 kilograms), often written as “lb”","zh":"磅（重量单位），等于16盎司（约0.45千克），常写作“lb”"},"examples":[{"en":"The package weighs two pounds.","zh":"这个包裹重两磅。"},{"en":"I lost five pounds last month.","zh":"我上个月瘦了五磅。"}]},{"partOfSpeech":"n.","definition":{"en":"the main unit of money in the United Kingdom (￡)","zh":"英镑（英国的主要货币单位，￡）"},"examples":[{"en":"It costs twenty pounds.","zh":"它要二十英镑。"},{"en":"I exchanged dollars for pounds at the airport.","zh":"我在机场把美元换成了英镑。"}]},{"partOfSpeech":"v.","definition":{"en":"to hit something repeatedly and strongly","zh":"猛烈地反复敲打；重击"},"examples":[{"en":"Someone was pounding on the door.","zh":"有人在砰砰地敲门。"},{"en":"Waves pounded the rocks along the shore.","zh":"海浪猛烈拍打着岸边的岩石。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a heart) to beat very hard","zh":"（心脏）剧烈跳动"},"examples":[{"en":"My heart was pounding before the exam.","zh":"考试前我心跳得很厉害。"}]}],"synonyms":["lb (abbr.)","strike","bang","thump"],"phonetic":"/paʊnd/","extraExplanation":["你输入的“poinds”不是常见英文单词，最可能是拼写错误。常见的两种目标词是：\n1）pounds（pound的复数）：表示“磅（重量）”或“英镑（货币）”。\n2）points（point的复数）：表示“点；要点；分数”等。\n如果你告诉我你想表达“体重/英镑”，还是“要点/分数”，我可以给你对应的词条。"]}
{"word":"poinephobia","summary":{"en":"Poinephobia means a strong fear of punishment or being punished.","zh":"Poinephobia 指对惩罚或被惩罚的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, persistent fear of punishment (or being punished), sometimes used as a term for a specific phobia.","zh":"对惩罚（或被惩罚）的强烈、持续的恐惧；有时用来指一种特定恐惧症。"},"examples":[{"en":"He avoided taking any risks at work because of poinephobia—he was terrified of being punished for mistakes.","zh":"他在工作中尽量不冒险，因为有“惩罚恐惧症”（poinephobia）——他非常害怕因犯错而受罚。"},{"en":"Some people describe strict childhood discipline as one factor that can contribute to poinephobia later in life.","zh":"有些人认为，童年时期过于严厉的管教可能会在之后导致对惩罚的恐惧（poinephobia）。"}]}],"synonyms":["fear of punishment","fear of being punished","specific phobia (punishment-related)"],"phonetic":"/ˌpɔɪnəˈfoʊbiə/","extraExplanation":["词源：poine- 来自希腊语，含“惩罚、处罚”之意；-phobia 表示“恐惧”。","该词较少见，日常英语里更常用的说法是 “fear of punishment” 或 “fear of being punished”。在正式心理健康语境中，是否作为诊断名称要以专业评估为准。"]}
{"word":"poinsettia","summary":{"en":"A popular Christmas decoration plant known for its bright red leaf-like bracts.","zh":"一种常见的圣诞节装饰植物，以鲜红色的叶状苞片著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant with bright red (or sometimes white/pink) leaf-like bracts, commonly sold and used as a decoration during the Christmas season.","zh":"一品红（或称圣诞红）：一种叶片状苞片呈鲜红色（也有白色/粉色等）的植物，常在圣诞节期间作为装饰出售和摆放。"},"examples":[{"en":"We put a poinsettia on the table for Christmas.","zh":"我们在圣诞节把一盆一品红放在桌上装饰。"},{"en":"The florist had poinsettias in red, white, and pink.","zh":"花店里有红色、白色和粉色的一品红。"}]}],"synonyms":["Christmas flower","Christmas plant"],"phonetic":"/ˌpɔɪnˈsɛtiə/","extraExplanation":["“poinsettia”得名于Joel Roberts Poinsett（庞塞特），他是19世纪的美国外交官与植物爱好者，据说将这种植物从墨西哥带到美国并推广开来，因此英文用他的姓来命名。","很多人以为红色部分是花瓣，其实主要是“苞片”（bracts，变色的叶状结构）；真正的花很小，位于中间的黄色小花序处。","在北美文化中，一品红与圣诞节强关联，常见于家庭、商店、教堂的节日布置。"]}
{"word":"poinsettias","summary":{"en":"Poinsettias are popular Christmas plants with bright red (or other colored) bracts.","zh":"Poinsettias 指常见的圣诞装饰植物“一品红/圣诞红”，以鲜艳的苞片著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant with red, pink, or white bracts (leaf-like parts) that is commonly used as a Christmas decoration","zh":"一品红（圣诞红）：一种观赏植物，常见红/粉/白色“苞片”（像花瓣但其实是叶状结构），常用于圣诞节装饰"},"examples":[{"en":"We bought poinsettias to decorate the living room for Christmas.","zh":"我们买了一品红来装饰客厅，迎接圣诞节。"},{"en":"The poinsettias on the office table make the space feel festive.","zh":"办公桌上的一品红让整个空间更有节日气氛。"}]}],"synonyms":["Christmas flower","poinsettia (singular)"],"phonetic":"/ˌpɔɪnˈsɛtiəz/","extraExplanation":["“Poinsettia”来自美国外交官 Joel Roberts Poinsett（庞塞特）的姓氏，他在19世纪将这种植物从墨西哥带到美国推广，因此英文用他的名字命名。","很多人以为红色部分是花瓣，其实主要是“苞片”（bracts）；真正的花很小，在中间的黄绿色部位。","在北美文化中，一品红与圣诞季强关联，常见于家庭、商店、教堂的冬季摆设。"]}
{"word":"point","summary":{"en":"Point can mean a dot or exact place, an important idea, a purpose, a score, or a sharp tip; as a verb it means to aim/indicate.","zh":"point 可指“点/位置、要点/观点、意义/目的、得分、尖端”；作动词表示“指向/指给…看、表明/显示”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dot or mark; a precise spot or position","zh":"点；小圆点；（精确的）地点/位置"},"examples":[{"en":"There’s a black point on the paper.","zh":"纸上有一个黑点。"},{"en":"Meet me at that point on the map.","zh":"在地图上的那个位置见。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific idea, detail, or piece of information; the main idea of what someone says","zh":"要点；观点；重点；细节"},"examples":[{"en":"You have a good point.","zh":"你说得有道理。"},{"en":"The main point is to stay calm.","zh":"重点是保持冷静。"}]},{"partOfSpeech":"n.","definition":{"en":"the purpose or value of doing something","zh":"意义；目的；价值"},"examples":[{"en":"What’s the point of arguing?","zh":"争吵有什么意义？"},{"en":"There’s no point in waiting any longer.","zh":"再等下去也没有意义。"}]},{"partOfSpeech":"n.","definition":{"en":"a unit used to count score in games, tests, or sports","zh":"（比赛/考试的）分；得分"},"examples":[{"en":"Our team scored three points.","zh":"我们队得了三分。"},{"en":"This question is worth five points.","zh":"这道题值五分。"}]},{"partOfSpeech":"n.","definition":{"en":"the sharp end of something (like a knife, needle, or pencil)","zh":"尖端；尖头"},"examples":[{"en":"Be careful—the point of the knife is very sharp.","zh":"小心，刀尖很锋利。"},{"en":"Use the point of the pencil to write clearly.","zh":"用铅笔尖写清楚。"}]},{"partOfSpeech":"v.","definition":{"en":"to aim your finger or an object toward someone or something to show direction or draw attention","zh":"指向；指（给…看）"},"examples":[{"en":"She pointed at the door.","zh":"她指向门。"},{"en":"He pointed to the line in the book.","zh":"他指着书里的那一行。"}]},{"partOfSpeech":"v.","definition":{"en":"to show or suggest something clearly; to indicate","zh":"表明；显示；暗示"},"examples":[{"en":"The evidence points to a mistake.","zh":"证据表明出了差错。"},{"en":"All signs point to rain tomorrow.","zh":"种种迹象表明明天会下雨。"}]},{"partOfSpeech":"v.","definition":{"en":"to add punctuation marks, especially to put a period after a sentence (less common in everyday speech)","zh":"加标点；（尤指）加句号（较少用于日常口语）"},"examples":[{"en":"Please point your sentences correctly.","zh":"请正确给句子加标点。"}]},{"partOfSpeech":"phrase","definition":{"en":"used to politely get someone’s attention or to introduce a comment","zh":"（用于引起注意或引出话题）我想说的是…；顺便说一下…"},"examples":[{"en":"Point of fact, the meeting starts at nine, not ten.","zh":"事实是，会议九点开始，不是十点。"},{"en":"Point taken—I’ll be more careful next time.","zh":"我明白了——下次我会更小心。"}]}],"synonyms":["dot","spot","idea","purpose","score","tip","indicate","aim"],"phonetic":"/pɔɪnt/","extraExplanation":["“Point”在口语里非常常见：\n- “You have a good point.” 表示“你说得有道理”。\n- “What’s the point?” 常带一点不耐烦或困惑，意思是“有什么意义/重点是什么？”\n- “There’s no point in doing…” 是固定结构，表示“做……没有意义”。\n\n动词“point”常与介词搭配：\n- point at（用手指/物体指着某人某物，动作更直接）\n- point to（指向某处或用来“说明/表明”某事，语气更中性）"]}
{"word":"point of view","summary":{"en":"Point of view means either someone’s opinion/stance, the narrative perspective in a story, or a physical viewpoint.","zh":"point of view 可指某人的观点/立场、故事的叙述视角，或实际的观景视点。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A person’s opinion, attitude, or way of thinking about something.","zh":"（对某事的）观点；立场；看法"},"examples":[{"en":"I understand your point of view, but I disagree with your conclusion.","zh":"我理解你的观点，但我不同意你的结论。"},{"en":"From my point of view, the plan is too risky.","zh":"从我的角度来看，这个计划太冒险了。"}]},{"partOfSpeech":"phrase","definition":{"en":"The perspective from which a story is told (for example, first-person “I,” third-person “he/she/they,” etc.).","zh":"（文学/叙事中的）叙述视角；人称视角（如第一人称“我”、第三人称“他/她/他们”等）"},"examples":[{"en":"The novel is written from a first-person point of view.","zh":"这部小说采用第一人称视角写成。"},{"en":"Changing the point of view can change how readers feel about a character.","zh":"改变叙述视角会改变读者对角色的感受。"}]},{"partOfSpeech":"phrase","definition":{"en":"A particular position or place from which you can see something; a viewing spot.","zh":"（观景/观察的）视点；观景点"},"examples":[{"en":"We walked to a point of view above the city to take photos.","zh":"我们走到城市上方的观景点拍照。"}]}],"synonyms":["view","perspective","standpoint","POV"],"phonetic":"/ˌpɔɪnt əv ˈvju/","extraExplanation":["在日常讨论里，point of view 常可简写为 POV（口语/网络用语很常见）。","写作里常见的几种 POV：第一人称（I）、第二人称（you，较少见）、第三人称有限（贴近某个角色的内心）、第三人称全知（叙述者知道所有角色的想法）。","固定搭配：from a… point of view（从……角度）；in my point of view 常被认为不够地道，更自然的是 in my view 或 from my point of view。"]}
{"word":"pointable","summary":{"en":"Pointable means “able to be pointed to” (physically or on a screen) or “clearly attributable/traceable to” something.","zh":"Pointable 指“可被指向的”（实物或屏幕上）或“可归因于/可追溯到”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be pointed at, pointed to, or clearly indicated (often describing a physical object, a label on a screen, or a specific item you can single out).","zh":"可被指向的；可被明确指出的（常指实物、屏幕上的标记或能被单独指认的事物）。"},"examples":[{"en":"Each icon is pointable on the touchscreen, so you can tap the one you need.","zh":"触摸屏上的每个图标都是可指向的，所以你可以点你需要的那个。"},{"en":"The map makes every landmark pointable, even for first-time visitors.","zh":"这张地图让每个地标都很容易被指出来，即使是第一次来的游客也能看懂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clearly attributable or assignable (often in the pattern “pointable to”).","zh":"可归因于；可归结到（常用结构为“pointable to”）。"},"examples":[{"en":"The delay is pointable to a last-minute change in the schedule.","zh":"这次延误可以归因于行程的临时变更。"},{"en":"Most of the confusion is pointable to unclear instructions.","zh":"大部分混乱都可归结为说明不清。"}]}],"synonyms":["indicated","identifiable","clickable","tappable","traceable","attributable"],"phonetic":"/ˈpɔɪn.tə.bəl/","extraExplanation":["“pointable”不是非常常见的日常词，更常见的表达有：\n- 物体/界面层面：“something you can point to / clickable / tappable”\n- 归因层面：“attributable to / traceable to / due to”\n在技术语境（触屏、界面、可点击元素）里，“pointable”更自然一些。"]}
{"word":"pointage","summary":{"en":"Pointage usually means clocking in/out or the timekeeping record; it can also mean a tally/checking record.","zh":"pointage 通常指上下班打卡/工时记录；也可指清点核对形成的盘点记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or system of recording workers’ time (clocking in and out), especially by punching a time clock","zh":"（尤指用打卡钟）记录员工上下班时间的行为或制度；打卡记录"},"examples":[{"en":"All employees must complete pointage before entering the workshop.","zh":"所有员工进入车间前都必须完成打卡登记。"},{"en":"The company switched from paper timesheets to electronic pointage.","zh":"公司把纸质工时表改成了电子打卡系统。"}]},{"partOfSpeech":"n.","definition":{"en":"a list or record made by checking and counting items or people (a tally)","zh":"（通过核对、清点形成的）清单；盘点记录"},"examples":[{"en":"After the inventory pointage, we found two missing boxes.","zh":"盘点后，我们发现少了两箱货。"},{"en":"Security does a quick pointage of visitors at the end of the day.","zh":"安保会在一天结束时快速清点访客人数。"}]}],"synonyms":["timekeeping","clocking in and out","punching the clock","tally","check"],"phonetic":"/pɔɪnˈtɑːʒ/","extraExplanation":["“pointage”是从法语借来的词，在英语里比较少见，常见于受法语影响较大的语境（如部分地区的职场、人事、行政文件）。日常英语里更常说：clocking in/out, time clock, timekeeping, punch-in/punch-out。"]}
{"word":"pointal","summary":{"en":"“Pointal” is not standard English; it’s likely a misspelling (often of “pivotal,” “pointed,” or “portal”).","zh":"“pointal” 不是标准英语词；多半是拼写错误（常见可能是 “pivotal / pointed / portal”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; it is most likely a misspelling of another word (for example, “pivotal,” “pointed,” or “portal”).","zh":"不是现代英语中的标准单词；很可能是其他单词的拼写错误（例如 “pivotal / 关键的”，“pointed / 尖的、直言的” 或 “portal / 入口、门户”）。"},"examples":[{"en":"I couldn’t find “pointal” in a dictionary—did you mean “pivotal”?","zh":"我在词典里找不到 “pointal”——你是不是想写 “pivotal（关键的）”？"},{"en":"If you meant “pointed,” you could say: The pencil has a pointed tip.","zh":"如果你想表达 “pointed（尖的）”，可以说：The pencil has a pointed tip.（铅笔有个尖尖的笔尖。）"}]}],"synonyms":["pivotal","pointed","portal"],"phonetic":"/ˈpɔɪntəl/","extraExplanation":["“pointal” 在常见英语词典里通常查不到，因此更像是拼写错误或非常罕见的旧词/专业词。","你可以告诉我它出现的句子或你想表达的中文意思（比如“关键的/尖的/要点的/入口”），我就能帮你确定最合适的正确单词和用法。"]}
{"word":"pointblank","summary":{"en":"Point-blank means “at extremely close range” or “very direct and blunt.”","zh":"Point-blank 表示“在极近距离（射击等）”或“非常直白、干脆”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(At) extremely close range, with no distance in between; direct and immediate.","zh":"（在）极近距离、几乎没有间隔；直接、立即。"},"examples":[{"en":"The officer was shot at point-blank range.","zh":"那名警官在极近距离被枪击。"},{"en":"Stand back—this tool shouldn’t be used point-blank.","zh":"往后站——这个工具不应该在贴得很近的距离使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very direct and plain-spoken; blunt, without trying to be polite.","zh":"非常直白的；不拐弯抹角的；坦率到有点生硬。"},"examples":[{"en":"She gave me a point-blank answer: “No.”","zh":"她给了我一个很直白的回答：“不。”"},{"en":"He asked a point-blank question about my salary.","zh":"他直截了当地问了我的薪水。"}]}],"synonyms":["at close range","direct","blunt","frank","straightforward"],"phonetic":"/ˈpɔɪnt ˌblæŋk/","extraExplanation":["“point-blank”最早来自射击用语：指枪口“point”（瞄准点）到“blank”（靶心/白色靶面）之间几乎没有距离，所以表示“近距离射击”。后来引申为说话做事“直接、干脆”。写作时常见两种：作形容词多写作 point-blank；作副词也常见 point-blank 或 point blank。"]}
{"word":"Pointcast","summary":{"en":"PointCast is best known as a 1990s internet company and as a symbol of early “push” content delivery—news and information sent automatically to users.","zh":"PointCast 最常指 1990 年代的一家互联网公司，也常被用来代表早期“推送式”内容分发——把新闻与信息自动发送给用户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A former internet company (PointCast Network) known in the 1990s for delivering news and information automatically to users’ screens.","zh":"（专有名词）一家早期互联网公司（PointCast Network），以在 1990 年代把新闻与信息自动推送到用户屏幕而出名。"},"examples":[{"en":"In the late 1990s, PointCast became famous for its “push” news service.","zh":"在 1990 年代末，PointCast 因其“推送式”新闻服务而出名。"},{"en":"Some people remember PointCast as an early version of notifications and personalized feeds.","zh":"有些人把 PointCast 视为通知与个性化信息流的早期版本。"}]},{"partOfSpeech":"n.","definition":{"en":"A system or style of automatically delivering selected online content to a user (often called “push technology”), associated with PointCast.","zh":"一种把选定的在线内容自动送到用户端的系统或风格（常称“推送技术”），与 PointCast 这一名称相关。"},"examples":[{"en":"The company tried a PointCast-like approach to send daily headlines to employees.","zh":"这家公司尝试用类似 PointCast 的方式把每日要闻推送给员工。"},{"en":"Before social media feeds, PointCast was one attempt to personalize what you saw online.","zh":"在社交媒体信息流出现之前，PointCast 曾是个性化线上内容的一种尝试。"}]}],"synonyms":["push technology","push service","webcasting","news feed","notifications"],"phonetic":"/ˈpɔɪntˌkæst/","extraExplanation":["PointCast 常被拿来作为“推送技术（push technology）”的代表案例：用户不必主动打开网页刷新，内容会自动更新到桌面或屏保上。在当时这很新，但也因为占用带宽、分散注意力等问题而引发争议。","在现代语境中，人们更多用 notifications（通知）、feed（信息流）、push alerts（推送提醒）来表达类似概念；“Pointcast”本身通常只在讨论互联网历史或 90 年代科技时出现。"]}
{"word":"pointe","summary":{"en":"Pointe is a ballet term for dancing on the tips of the toes, and it can also mean a pointe shoe.","zh":"pointe 是芭蕾用语，指脚尖（足尖）技巧/状态，也可指足尖鞋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ballet) The tip of the toes; a technique in which a dancer supports their body on the tips of the toes, usually while wearing pointe shoes.","zh":"（芭蕾）脚尖；一种舞蹈技巧：舞者通常穿着足尖鞋，用脚趾尖支撑身体重量。"},"examples":[{"en":"She practiced pointe for years before performing major roles.","zh":"她练了很多年足尖技巧，才开始出演重要角色。"},{"en":"The teacher reminded the students to strengthen their ankles for pointe work.","zh":"老师提醒学生要加强脚踝力量，以应对足尖训练。"}]},{"partOfSpeech":"n.","definition":{"en":"A pointe shoe; a stiff ballet shoe designed for dancing en pointe.","zh":"足尖鞋；一种加硬的芭蕾舞鞋，用于脚尖站立与表演。"},"examples":[{"en":"Her new pointe shoes needed to be broken in before rehearsal.","zh":"她的新足尖鞋需要先磨合，才能排练。"},{"en":"The dancer tied the ribbons of her pointe shoes carefully.","zh":"舞者仔细系好足尖鞋的缎带。"}]}],"synonyms":["en pointe","pointe work","pointe shoe"],"phonetic":"/pwɑnt/","extraExplanation":["“pointe”来自法语，字面意思与“point（点、尖端）”有关。芭蕾中常见表达是“en pointe”（在足尖上），指用脚趾尖站立/行走的动作与状态。","足尖训练对脚踝、足弓与小腿力量要求很高，通常需要在专业老师指导下循序渐进，避免受伤。"]}
{"word":"pointed","summary":{"en":"“Pointed” most often means (1) sharp at the end, or (2) direct and sometimes sharply critical; it can also be the past form of “point.”","zh":"“pointed”常见含义是（1）尖的；（2）直指要害、带尖锐批评的；也可作动词 point 的过去式/过去分词（指向）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a sharp tip; ending in a point.","zh":"尖的；尖头的；末端成尖点的。"},"examples":[{"en":"Be careful—the knife has a pointed blade.","zh":"小心——这把刀的刀刃很尖。"},{"en":"The dog has pointed ears.","zh":"这只狗的耳朵是尖的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Direct and clear, sometimes in a critical or accusing way.","zh":"直指要害的；一针见血的（有时带批评或指责意味）。"},"examples":[{"en":"She asked a pointed question about where the money went.","zh":"她就钱去哪了问了一个直指问题要害的问题。"},{"en":"His pointed remark made everyone uncomfortable.","zh":"他那句带刺的评论让大家都很不自在。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “point”) Directed something or indicated a direction with a finger, hand, or object.","zh":"（point 的过去式/过去分词）指向；指示（方向/位置）。"},"examples":[{"en":"She pointed to the exit.","zh":"她指向出口。"},{"en":"He pointed the flashlight at the ceiling.","zh":"他把手电筒照向天花板。"}]}],"synonyms":["sharp","pointy","direct","cutting","barbed"],"phonetic":"/ˈpɔɪn.tɪd/","extraExplanation":["“pointed question/remark”在英语里很常见，通常表示“不是随便问/随口说”，而是带着明确目的、可能在质疑或挑战对方立场，因此语气上可能显得“尖锐”。","在文学或正式写作中，“pointed”常用来强调言语的“锋利感”（像尖头一样），形成形象的比喻效果。"]}
{"word":"pointedly","summary":{"en":"“Pointedly” means in a deliberate, direct, and often emphatic or critical way.","zh":"“pointedly”表示以刻意、直接、常带强调或批评意味的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a direct, clearly intentional, and sometimes critical or emphatic way.","zh":"直截了当地；明确地（常带强调或批评意味）。"},"examples":[{"en":"She pointedly avoided answering the question.","zh":"她刻意回避回答这个问题。"},{"en":"He pointedly reminded them of the deadline.","zh":"他明确而强调地提醒他们截止日期。"}]}],"synonyms":["deliberately","emphatically","bluntly","pointedly (in a critical sense)","meaningfully"],"phonetic":"/ˈpɔɪn.tɪd.li/","extraExplanation":["“Pointedly”来自形容词“pointed”（尖锐的、明确的）。在写作或对话里，它常暗示说话者“有意为之”——不是随口一说，而是带着目的（例如暗示不满、强调重点、表达立场）。","常见搭配：pointedly avoid（刻意回避）、pointedly refuse（断然/明确拒绝）、pointedly remark/comment（尖锐地评论）、pointedly silent（刻意沉默）。","语气提示：与 “directly” 相比，“pointedly”更容易让人感觉到“针对性”和“锋芒”。在正式场合使用时要注意礼貌和分寸。"]}
{"word":"pointedness","summary":{"en":"Pointedness means the quality of being sharp (literally) or sharp/direct in tone or argument.","zh":"Pointedness 指“尖”的性质（字面），也指言辞/论点的尖锐、直白或切中要害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having a sharp point or tip; sharpness (literal).","zh":"（字面）尖端的特性；尖锐度。"},"examples":[{"en":"Be careful—the pointedness of that needle can easily prick your finger.","zh":"小心——那根针很尖，容易扎到手指。"},{"en":"The knife’s pointedness makes it useful for piercing packaging.","zh":"这把刀的尖锐度让它适合刺开包装。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being direct, biting, or strongly expressed in speech or writing; sharpness of tone or meaning.","zh":"（言语/文字）尖刻、犀利、直截了当的程度；言辞的锋芒。"},"examples":[{"en":"There was pointedness in her reply, as if she had been waiting to say it.","zh":"她的回复带着锋芒，像是早就憋着要说。"},{"en":"He tried to soften the pointedness of his criticism so it wouldn’t sound rude.","zh":"他试着缓和批评的尖锐程度，免得听起来无礼。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being relevant and clear in making a point; effectiveness or force of an argument.","zh":"（表达/论证）切中要害、明确有力的程度；说服力。"},"examples":[{"en":"Her story gained pointedness when she included specific dates and details.","zh":"她加入具体日期和细节后，故事更切中要害。"},{"en":"The pointedness of his argument came from simple, concrete examples.","zh":"他论点的力度来自简单而具体的例子。"}]}],"synonyms":["sharpness","keenness","acuity","directness","bitingness"],"phonetic":"/ˈpɔɪn.tɪd.nəs/","extraExplanation":["“pointedness”来自形容词“pointed”（尖的；尖刻的；直指要害的）+ 名词后缀“-ness”（表示“……的性质/状态”）。因此它既可指“物理上的尖”，也可指“语言/观点上的锋利、直白”。","在写作或正式评论里，“pointedness”常用于描述语气或批评的“尖锐度”，有时带一点负面含义（例如“太刻薄”）；但也可能是中性/正面的，表示“切中要害、很有力”。"]}
{"word":"pointel","summary":{"en":"Pointel is a glassblowing rod used to hold hot glass while it’s shaped; it’s a variant of “pontil/punty.”","zh":"Pointel 指玻璃吹制时用来支撑和塑形热玻璃的金属杆，是 “pontil/punty” 的一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal rod used in glassblowing to hold and shape a piece of hot glass while it is being worked (also spelled “pontil” or “punty”).","zh":"（玻璃吹制用的）挑杆/顶杆：在加工热玻璃时，用来支撑、固定并继续塑形的金属杆（也常拼作 pontil 或 punty）。"},"examples":[{"en":"The glassblower attached the bowl to a pointel so she could shape the rim.","zh":"玻璃匠把碗形玻璃接到 pointel 上，这样就能继续修整杯口。"},{"en":"After the piece cooled, a small mark showed where the pointel had been attached.","zh":"作品冷却后，会留下一个小痕迹，显示 pointel 曾经粘接的位置。"}]}],"synonyms":["pontil","punty"],"phonetic":"/ˈpɑn.təl/","extraExplanation":["在玻璃工艺里，pointel（更常见写法是 pontil / punty）通常用于把作品从吹管（blowpipe）“换手”到另一根杆上，方便处理开口、修边等步骤。冷却后常会留下“pontil mark”（pontil 印/底痕），在手工玻璃器上很常见。"]}
{"word":"pointer","summary":{"en":"A pointer is something that indicates or directs (like a finger or laser pointer), or a helpful tip; in computing, it’s a memory address that refers to data.","zh":"pointer 指“指示物”（如手指、激光笔），也可指“提示/建议”；在计算机中指“指针”，即指向数据的内存地址。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thing that points to something: a person’s finger, a tool, a sign, or anything used to indicate a direction or object.","zh":"用来指向某物的东西：手指、工具、指示标志，或任何用于指示方向/目标的物件。"},"examples":[{"en":"She raised her finger as a pointer to the chart.","zh":"她抬起手指指向图表。"},{"en":"Use the laser pointer during your presentation.","zh":"演讲时用激光笔。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of practical advice; a helpful tip.","zh":"建议；诀窍；提示。"},"examples":[{"en":"Here’s a pointer: save your work often.","zh":"给你一个小提示：经常保存你的工作。"},{"en":"The coach gave me a few pointers on my swing.","zh":"教练就我的挥杆给了我一些建议。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A value that stores the memory address of another value, so a program can access it indirectly.","zh":"（计算机）指针：存储另一个值的内存地址的值，用于间接访问数据。"},"examples":[{"en":"This function returns a pointer to a string.","zh":"这个函数返回一个指向字符串的指针。"},{"en":"Be careful—an invalid pointer can cause a crash.","zh":"要小心——无效指针可能导致程序崩溃。"}]},{"partOfSpeech":"n.","definition":{"en":"A dog trained to point toward game (like birds) by freezing and aiming its body.","zh":"（猎犬）指示犬：发现猎物（如鸟类）时会定住身体并指向猎物的狗。"},"examples":[{"en":"The pointer held still when it found the birds.","zh":"指示犬发现鸟时立刻定住不动。"}]}],"synonyms":["indicator","cue","tip","hint","advice","laser pointer","reference"],"phonetic":"/ˈpɔɪntɚ/","extraExplanation":["“Pointer”来自动词“point”（指向）。日常里最常见的是“激光笔/指示棒”和“建议、提示（a pointer）”。","在计算机语境中，pointer 是C/C++等语言的核心概念；中文常译为“指针”。初学时可以把它理解为“地址卡片”：卡片本身不是数据，但写着数据放在哪里。","固定搭配：point of no return（无可挽回的地步）与 pointer 无关；但“point”家族词很多，如 point out（指出）、point to（指向/表明）。"]}
{"word":"pointers","summary":{"en":"“Pointers” most often means practical tips or advice; it can also mean clues/indications, computer pointers (memory addresses), or the dog breed “pointers.”","zh":"“pointers”最常指实用建议/要点；也可指线索/迹象、计算机中的指针（内存地址），或犬种“指示犬”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Helpful tips or pieces of advice (often practical and short).","zh":"实用的小建议；要点（常为简短、可操作的建议）。"},"examples":[{"en":"Here are a few pointers for your interview: arrive early and prepare a few questions.","zh":"这里有一些面试小建议：早点到，并准备几个问题。"},{"en":"She gave me pointers on how to write a clearer email.","zh":"她给了我一些如何把邮件写得更清楚的建议。"}]},{"partOfSpeech":"n.","definition":{"en":"Things that point to something: signs, clues, or indications.","zh":"指示物；线索；迹象（指向某事的提示）。"},"examples":[{"en":"The report offers pointers to where the money went.","zh":"这份报告提供了资金去向的线索。"},{"en":"Dark clouds can be pointers that rain is coming.","zh":"乌云可能是要下雨的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, variables that store the memory address of another value (commonly called “pointers”).","zh":"【计算机】指针（存储另一个值的内存地址的变量）。"},"examples":[{"en":"In C, pointers let you work directly with memory addresses.","zh":"在 C 语言里，指针让你可以直接操作内存地址。"},{"en":"Be careful—using pointers incorrectly can cause crashes.","zh":"要小心——错误使用指针可能导致程序崩溃。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of hunting dog (the plural of “pointer”).","zh":"【犬种】指示犬（pointer 的复数，一种猎犬）。"},"examples":[{"en":"Pointers are known for freezing and pointing when they find game.","zh":"指示犬以发现猎物时定住并“指向”而闻名。"}]}],"synonyms":["tips","advice","suggestions","hints","clues","indications"],"phonetic":"/ˈpɔɪntɚz/","extraExplanation":["“pointer / pointers”在口语里最常见的意思是“建议、要点”。在职场或学习场景里，常见搭配有：give someone pointers（给某人建议）、a few pointers（几点建议）。","计算机里的 pointer（指针）是一个很专门的用法，常出现在 C/C++ 等语言学习中；如果上下文谈到 memory、address、NULL 等词，通常指的就是这个意思。"]}
{"word":"pointes","summary":{"en":"“Pointes” is the plural of “pointe,” most often referring to ballet dancing on the tips of the toes or to pointe shoes.","zh":"“pointes”是“pointe”的复数，常指芭蕾的足尖动作/姿态或足尖鞋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “pointe”) In ballet, the tips of the toes/feet when a dancer is balanced on the very ends of the toes (often while wearing pointe shoes).","zh":"（“pointe”的复数）芭蕾中指舞者用脚尖最前端支撑身体的姿态/位置（通常穿足尖鞋完成）。"},"examples":[{"en":"She practiced rising to pointes at the barre every day.","zh":"她每天在把杆旁练习立到足尖。"},{"en":"The choreography includes long sequences on pointes.","zh":"这段编舞包含许多长时间的足尖动作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of “pointe”) Pointe shoes: special ballet shoes that allow a dancer to dance on the tips of the toes.","zh":"（“pointe”的复数）足尖鞋：让舞者能用脚尖起舞的芭蕾专用鞋。"},"examples":[{"en":"She bought new pointes before the performance.","zh":"演出前她买了新的足尖鞋。"},{"en":"These pointes need to be broken in carefully.","zh":"这双足尖鞋需要小心磨合。"}]}],"synonyms":["pointe shoes","toe shoes","on pointe (phrase)","pointe work"],"phonetic":"/pwɑnts/","extraExplanation":["“pointe”来自法语，字面意思是“尖端/尖点”。在芭蕾语境里常见搭配有：on pointe（用足尖站立/跳舞）、en pointe（法语写法，同义）、pointe work（足尖训练/足尖技巧）。","发音上，“pointe”在英语里通常保留法语风格的 /pw-/ 起始音；“pointes”是其复数。注意不要和普通英语的“points”（点、分数、要点）混淆。"]}
{"word":"pointful","summary":{"en":"“Pointful” means having a clear point—meaningful or purposeful (not a very common word).","zh":"“pointful”指“有明确要点、很有意义或有目的的”（这个词不太常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a clear point; meaningful, purposeful, or worth paying attention to.","zh":"有明确要点的；有意义的；有目的或值得注意的。"},"examples":[{"en":"Her comment was short but pointful, so everyone listened.","zh":"她的评论很短，但很有要点，所以大家都在听。"},{"en":"Let’s keep the discussion pointful and avoid repeating the same ideas.","zh":"我们把讨论保持在有要点的范围内，避免重复同样的想法。"},{"en":"The essay is pointful when it stays focused on one main argument.","zh":"当文章始终聚焦在一个中心论点上时，就很有要点。"}]}],"synonyms":["meaningful","purposeful","to the point","relevant","significant"],"phonetic":"/ˈpɔɪntfəl/","extraExplanation":["“pointful”在现代英语里不算常见，更常用的表达有：meaningful（有意义的）, purposeful（有目的的）, to the point / pointed（切中要害的）, relevant（相关的）。在写作或正式场合，优先用这些更自然。"]}
{"word":"pointfully","summary":{"en":"“Pointfully” means speaking or writing in a clear, emphatic way that makes your point strongly.","zh":"“pointfully”指说话或写作时清楚且有强调地表达观点，把重点讲得很有力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that strongly and clearly makes a point; with emphasis.","zh":"明确而有力地表达观点；带着强调。"},"examples":[{"en":"She explained, pointfully, why the plan would fail.","zh":"她明确而有力地解释了为什么这个计划会失败。"},{"en":"He spoke pointfully about the need for fairness.","zh":"他有力地谈到了公平的必要性。"}]}],"synonyms":["clearly","emphatically","forcefully","pointedly"],"phonetic":"/ˈpɔɪntfəli/","extraExplanation":["“Pointfully”不算特别常见，更常用的替代说法有：clearly（清楚地）, pointedly（尖锐地/直截了当地）, forcefully（强有力地）, emphatically（强调地）。其中 pointedly 往往带一点批评或讽刺的语气；pointfully 通常更偏“把道理讲清、把重点说出来”的感觉。"]}
{"word":"pointfulness","summary":{"en":"Pointfulness means the quality of being clearly meaningful and relevant; less commonly, it can mean sharpness or a pointed tone.","zh":"Pointfulness 指“切中要点、清晰有意义”的特质；较少见时也可指“尖锐/带锋芒（包括语气尖刻）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being meaningful, relevant, and clearly expressed (often in writing or speaking).","zh":"（常指写作或说话）有意义、有针对性、表达清晰有力的特质。"},"examples":[{"en":"The essay’s pointfulness comes from its clear thesis and specific evidence.","zh":"这篇文章之所以有“pointfulness”，是因为论点清晰、证据具体。"},{"en":"Try to improve the pointfulness of your comments by linking them to the main topic.","zh":"想让你的发言更有“pointfulness”，就把观点与主题核心联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being pointed or sharp (less common), either literally or in tone.","zh":"（较少见）尖锐、带“锋芒”的特质；可指字面上的尖或语气上的尖刻。"},"examples":[{"en":"He disliked the pointfulness of her criticism, even when it was accurate.","zh":"即使她的批评是准确的，他也不喜欢那种尖刻的“pointfulness”。"},{"en":"The tool’s pointfulness made it useful for fine detail work.","zh":"这工具的尖锐性（pointfulness）让它适合做精细活。"}]}],"synonyms":["clarity","relevance","meaningfulness","pithiness","to-the-pointness"],"phonetic":"/ˈpɔɪntfʊlnəs/","extraExplanation":["“pointfulness”在现代英语中不算常见，更常用的表达是“clarity”（清晰）、“relevance”（相关性）、“meaningfulness”（意义）、“being to the point”（切中要点）。在学术写作或讨论场景里，用这些替代词通常更自然。","构词上：point（要点/尖端）+ -ful（充满……的）+ -ness（名词后缀，表示性质）。因此它既可以指“有要点、切题”，也可以引申为“尖锐”。"]}
{"word":"pointier","summary":{"en":"“Pointier” means “more pointy/sharper” (comparative of pointy).","zh":"“pointier”表示“更尖、更尖锐”，是“pointy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “pointy”: having a sharper point or more pointed shape than something else.","zh":"“pointy”的比较级：比另一物更尖、更尖锐、尖端更明显。"},"examples":[{"en":"These scissors are pointier than the ones in the kitchen, so be careful.","zh":"这把剪刀比厨房那把更尖，所以要小心。"},{"en":"The mountain peaks look pointier in winter when there’s less haze.","zh":"冬天雾霾少时，山峰看起来更尖。"},{"en":"Could you draw the ears pointier, like a fox?","zh":"你能把耳朵画得更尖一点吗？像狐狸那样。"}]}],"synonyms":["sharper","more pointed","spikier"],"phonetic":"/ˈpɔɪntiər/","extraExplanation":["“pointier”是形容词“pointy（尖的）”的比较级，表示“两者相比更尖”。常见结构：pointier than…。","拼写变化：pointy → pointier（把结尾的 -y 变成 -ier）。"]}
{"word":"pointiest","summary":{"en":"“Pointiest” means the most pointy—either literally the sharpest, or figuratively the most cutting or direct.","zh":"“Pointiest”表示“最尖的”，既可指实物最尖，也可比喻言语/态度最尖锐、最直白。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “pointy”: having the sharpest or most distinct point or tip.","zh":"“pointy”的最高级：最尖的；尖端最明显的。"},"examples":[{"en":"This pencil is the pointiest one in the box.","zh":"这支铅笔是盒子里最尖的一支。"},{"en":"Be careful—the pointiest corners can scratch the table.","zh":"小心——最尖的角可能会刮到桌面。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most direct, sharp, or critical in tone (figurative).","zh":"（比喻）最尖锐的；最直白、最犀利的（语气/评论）。"},"examples":[{"en":"Her pointiest comment made everyone go quiet.","zh":"她最犀利的一句评论让大家都安静了。"},{"en":"Try to soften the pointiest parts of your feedback.","zh":"尽量把反馈中最尖锐的部分说得委婉一点。"}]}],"synonyms":["sharpest","most pointed","spikiest","most cutting","most biting"],"phonetic":"/ˈpɔɪntiəst/","extraExplanation":["“pointiest”是形容词“pointy（尖的）”的最高级：pointy → pointier → pointiest。常用来描述物体的尖端（pencil, hat, ears, corners等），也可引申形容语言或态度“尖锐”。","拼写上：以辅音字母+y结尾的形容词通常变级时把y变成i，再加-er/-est（如: funny → funnier → funniest）。"]}
{"word":"pointillage","summary":{"en":"Pointillage is a dot-based painting technique, closely related to pointillism.","zh":"Pointillage 指一种以密集小色点构图的绘画技法，与点彩主义（pointillism）密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a painting technique that builds an image using many small dots or dabs of color placed close together (a French art term; closely related to pointillism)","zh":"点彩法；用许多细小色点/色斑密集排列来形成画面（法语艺术术语，与 pointillism“点彩主义”密切相关）"},"examples":[{"en":"Seurat used pointillage to make colors seem to mix in the viewer’s eye.","zh":"修拉用点彩法，让颜色在观者的眼中“视觉混合”。"},{"en":"From a distance, the pointillage looks smooth, but up close you can see hundreds of dots.","zh":"远看点彩法的画面很平滑，近看却能看到成百上千个小色点。"}]}],"synonyms":["pointillism","stippling","dot painting"],"phonetic":"ˌpwɑːn.tiˈjɑːʒ","extraExplanation":["“pointillage”来自法语“point（点）+ -age（做法/过程）”，字面意思是“点点的处理/点的技法”。英语里更常见的对应词是“pointillism（点彩主义）”或“stippling（点描法）”。","在艺术史语境中，它常让人联想到19世纪的新印象派（Neo-Impressionism），代表人物包括 Georges Seurat（乔治·修拉）和 Paul Signac（保罗·西涅克）。","拼写与用法提示：英语语料中“pointillage”相对少见，多用于讨论法语原术语或强调技法本身；谈到整个艺术流派时更常用“pointillism”。"]}
{"word":"pointille","summary":{"en":"Pointille/pointillé means “dotted or dashed,” especially for lines in drawings or maps; in music, it can mean “in a dotted rhythm.”","zh":"pointille/pointillé 表示“点状或短划组成的（虚线）”，多用于绘图/地图；在音乐中也可指“附点节奏的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a line, pattern, or drawing) made of dots or short dashes; dotted or dashed.","zh":"（线条、图案或绘画）由点或短划组成的；点线的；虚线的。"},"examples":[{"en":"Draw a pointillé outline first, then trace it with a solid line.","zh":"先画一条点线轮廓，再用实线描一遍。"},{"en":"The map marks the border with a pointillé line.","zh":"地图用虚线标出边界。"}]},{"partOfSpeech":"n.","definition":{"en":"A pointillé line or pattern (a dotted/dashed line used in drawings, maps, or design).","zh":"点线（图样）；虚线（绘图、地图或设计中用的点状/短划线）。"},"examples":[{"en":"Use a pointillé to show the proposed route.","zh":"用虚线表示拟议路线。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music) played in a dotted rhythm (with “dotting,” making one note longer and the next shorter).","zh":"（音乐）以附点节奏演奏的（通过“附点”让前一个音更长、后一个音更短）。"},"examples":[{"en":"The opening should be played pointillé to sound crisp and lively.","zh":"开头应以附点节奏演奏，听起来要清脆有活力。"}]}],"synonyms":["dotted","dashed","broken (line)","stippling (related, art)"],"phonetic":"ˌpwæn.tɪˈleɪ","extraExplanation":["“pointillé”是法语借词，来自“point”（点）。在英语里多见于美术/制图语境表示“点线/虚线”，在音乐语境表示“附点（dotted rhythm）”。","拼写上有时会保留重音符号写作 pointillé，也常见不带重音的 pointille。日常英语里更常用的说法是 dotted line / dashed line（虚线）。"]}
{"word":"Pointillism","summary":{"en":"Pointillism is an art technique and style that creates images using many tiny dots of color that blend visually from a distance.","zh":"Pointillism（点彩画法/点彩主义）是一种用大量细小色点作画、让颜色在远观时产生视觉混合的绘画技法与艺术风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A painting technique that uses many small, distinct dots of pure color placed close together so that the colors visually blend when seen from a distance.","zh":"（绘画）点彩画法：用大量细小、分开的纯色点并置，远看时在视觉上混合成色彩与形体的技法。"},"examples":[{"en":"In pointillism, the blue sky may be made from tiny dots of blue, purple, and white.","zh":"在点彩画法里，蓝天可能由蓝、紫、白等细小色点组成。"},{"en":"From up close the painting looks like dots, but from far away the scene becomes clear.","zh":"近看画面像一堆点，但远看景物就清晰了。"}]},{"partOfSpeech":"n.","definition":{"en":"Paintings or a style of art made using the pointillist technique.","zh":"点彩派作品；点彩风格（用点彩画法创作的绘画作品或艺术风格）。"},"examples":[{"en":"The museum has several famous pointillisms from the late 1800s.","zh":"这家博物馆收藏了几幅19世纪末著名的点彩派作品。"},{"en":"She’s studying pointillism in art history class.","zh":"她在艺术史课上学习点彩主义/点彩派。"}]}],"synonyms":["Neo-Impressionism (related movement)","divisionism (related technique)"],"phonetic":"/ˈpɔɪn.tə.lɪ.zəm/","extraExplanation":["“Pointillism”源自法语 point（点）。它常与新印象派（Neo-Impressionism）联系在一起，代表人物包括乔治·修拉（Georges Seurat）和保罗·西涅克（Paul Signac）。","理解点彩画法的小窍门：它依赖“视觉混色”（optical mixing）——不是在调色板上把颜料混在一起，而是让观者在一定距离上用眼睛“混合”色点。"]}
{"word":"pointillism","summary":{"en":"Pointillism is a painting technique and art style that forms images using many tiny dots of color.","zh":"Pointillism 指点彩画法/点描派：用大量细小色点来构成画面的绘画技法与风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A painting technique that uses many tiny dots of pure color placed close together so they visually blend into shapes and lighter or darker areas when viewed from a distance.","zh":"点彩画法（点描派）：一种绘画技法，用许多细小的纯色点紧密排列；从远处看时，这些色点在视觉上融合成形状与明暗。"},"examples":[{"en":"Seurat’s paintings are famous examples of pointillism.","zh":"修拉（Seurat）的作品是点彩画法的著名代表。"},{"en":"Up close, the image looks like dots, but from far away, pointillism creates smooth light and color.","zh":"近看时画面像一堆色点，但远看时点彩画法会形成平滑的光影与色彩。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or method of making something by building it from many small, separate elements.","zh":"（引申）点状拼接式的方法：用许多细小、分散的元素逐步构成整体的风格或做法。"},"examples":[{"en":"The writer’s description has a kind of pointillism: small details add up to a vivid scene.","zh":"这位作家的描写有点“点彩式”的味道：零碎细节累积起来，画面感很强。"}]}],"synonyms":["divisionism (related)","dot painting"],"phonetic":"/ˈpɔɪn.təˌlɪz.əm/","extraExplanation":["“Pointillism”来自法语“point”（点）。它常与“新印象派（Neo-Impressionism）”联系在一起，强调用色点的“光学混合”（在观者眼中融合），而不是在调色板上先把颜料混合。","在艺术史上，乔治·修拉（Georges Seurat）和保罗·西涅克（Paul Signac）是最常被提到的点彩画代表人物。"]}
{"word":"pointillist","summary":{"en":"Pointillist means a painter (or style) that uses many tiny dots of color, or something related to that dot-based technique.","zh":"Pointillist 指点彩派画家/点彩风格，或指与用许多色点作画的点彩技法有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A painter, or a style of painter, who creates images using many small dots of pure color that visually blend when seen from a distance.","zh":"点彩派画家；点彩画风格：用许多纯色小点构成画面，远看时颜色在视觉上融合。"},"examples":[{"en":"Georges Seurat is one of the most famous pointillists in art history.","zh":"乔治·修拉是艺术史上最著名的点彩派画家之一。"},{"en":"From up close, the painting looks like dots, but from far away it becomes a clear scene—classic pointillist technique.","zh":"近看这幅画像是一堆点，远看却变成清晰的景象——典型的点彩技法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using or relating to the dot-based painting method known as Pointillism.","zh":"点彩的；与点彩法（点彩主义）有关的。"},"examples":[{"en":"The museum has a pointillist landscape filled with tiny spots of color.","zh":"博物馆里有一幅点彩风景画，布满了细小的色点。"},{"en":"She experimented with a pointillist approach to shading.","zh":"她尝试用点彩式的方法来做明暗处理。"}]}],"synonyms":["Neo-Impressionist (often related)","dot-based","stippling (related technique)"],"phonetic":"/ˈpɔɪn.t̬əl.ɪst/","extraExplanation":["“Pointillist”来自法语 point（“点”），常与19世纪末法国的新印象派（Neo-Impressionism）联系在一起。点彩法强调色彩理论：把不同纯色点并置，让观者的眼睛在远处“自行混色”，产生更明亮的效果。","艺术语境里常见相关词：Pointillism（点彩主义/点彩法），Neo-Impressionism（新印象派）。除绘画外，“pointillist”偶尔也会借喻写作或叙事风格：用许多细小片段拼出整体画面。"]}
{"word":"pointilliste","summary":{"en":"Pointilliste means a Pointillism artist or something made in a Pointillist dotted style.","zh":"pointilliste 指点彩派画家，或指点彩派（用许多小色点构图）的风格/作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A painter (or artwork) using Pointillism: building an image with many tiny dots of color.","zh":"点彩派画家；（或）采用点彩技法的作品：用许多细小的彩色点来构成画面。"},"examples":[{"en":"Georges Seurat is a famous pointilliste.","zh":"乔治·修拉是著名的点彩派画家。"},{"en":"The pointilliste technique makes the colors seem to shimmer from a distance.","zh":"点彩派技法让颜色从远处看起来像在闪烁。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or using Pointillism; made in a dotted style.","zh":"点彩派的；采用点彩技法的；由点点构成的风格。"},"examples":[{"en":"She studied pointilliste paintings at the museum.","zh":"她在博物馆里研究点彩派绘画。"},{"en":"The artist created a pointilliste background with tiny dots of blue and green.","zh":"艺术家用细小的蓝绿点点做出了点彩风格的背景。"}]}],"synonyms":["Pointillist","Neo-Impressionist (context)"],"phonetic":"/ˌpwæn.təˈlist/","extraExplanation":["“pointilliste”是法语借词，来自“point”（点）。英语里也常见对应名词“Pointillism（点彩派）”。\n点彩派常与19世纪后期的新印象派相关，代表人物包括Seurat（修拉）和Signac（西涅克）。这种技法强调色彩在观者眼中“光学混合”（近看是点，远看成色块）。"]}
{"word":"pointillistic","summary":{"en":"Pointillistic means “made of many small dots,” literally in art and figuratively in detail-based storytelling.","zh":"pointillistic 指“由许多小点构成”，既可字面用于点彩画风，也可引申为用零散细节拼出整体的叙事风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of many small dots or tiny touches of color, like the painting technique called Pointillism.","zh":"由许多小点或细小的色彩笔触构成的；类似“点彩画法（Pointillism）”的风格。"},"examples":[{"en":"The artist created a pointillistic sky using hundreds of tiny blue and white dots.","zh":"这位艺术家用数百个蓝白小点创作出点彩式的天空。"},{"en":"From far away, the pointillistic painting looked smooth, but up close it was all dots.","zh":"从远处看，这幅点彩画看起来很平滑，但近看全是小点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing writing, film, or storytelling that builds a picture through many small, separated details rather than one continuous explanation.","zh":"（用于写作/电影/叙事）指通过许多零散的小细节拼出整体画面，而不是用连贯的长篇解释来呈现。"},"examples":[{"en":"Her memoir is pointillistic, made of brief scenes that slowly reveal her childhood.","zh":"她的回忆录是点彩式的，由一段段短场景组成，逐渐呈现她的童年。"},{"en":"The director uses a pointillistic style, letting small moments hint at the larger story.","zh":"导演采用点彩式风格，让小片段暗示更大的故事。"}]}],"synonyms":["pointillist","dotlike","stippling","mosaic-like","fragmentary","impressionistic"],"phonetic":"/ˌpɔɪn.t̬əˈlɪs.tɪk/","extraExplanation":["“pointillistic”来自法语绘画流派 Pointillism（点彩画法），常与乔治·修拉（Georges Seurat）等新印象派画家相关。这个词在艺术评论里最常见，但现代也常借用来形容“由碎片化细节拼成整体”的叙事或观察方式。","学习提示：可以把它理解成“像马赛克/像像素”——近看是点，远看成形。语气通常偏文学或评论风格。"]}
{"word":"pointillists","summary":{"en":"“Pointillists” are artists who create images using many small dots of color (the pointillism technique).","zh":"“Pointillists”指点彩派画家/使用点彩技法创作的人（用许多小色点构成画面）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Artists (or people) who use pointillism—making pictures with many small dots of color.","zh":"点彩派画家；使用点彩技法创作的人（用许多小色点组成画面）。"},"examples":[{"en":"The museum’s new exhibit features French pointillists from the late 1800s.","zh":"博物馆的新展览展出了19世纪末的法国点彩派画家作品。"},{"en":"Up close, the painting looks like dots, but from far away it becomes a clear scene—just as pointillists intended.","zh":"近看这幅画是一个个小点，但远看就变成清晰的景象——这正是点彩派画家想要的效果。"}]}],"synonyms":["pointillism painters","Neo-Impressionists","dot painters"],"phonetic":"/ˈpɔɪn.tɪl.ɪsts/","extraExplanation":["“Pointillist/pointillists”来自法语 point（“点”）。点彩派（Pointillism）是后印象派的一种技法与流派，常与乔治·修拉（Georges Seurat）和保罗·西涅克（Paul Signac）联系在一起。其核心思路是把纯色以小点并置，让观者在一定距离上“视觉混色”。","在英语里，pointillist 有时也会被引申来形容“特别注重细枝末节、把信息一点点拼起来的人”，但在艺术语境中最常见的是指点彩派画家。"]}
{"word":"pointing","summary":{"en":"“Pointing” means directing a finger/hand/object to show something or draw attention, and it can describe something that is aimed toward a direction.","zh":"“pointing”表示用手指/手势/物体指向以示意或引起注意，也可形容“指向某个方向的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of directing a finger, hand, or object toward someone or something to show where it is or to draw attention","zh":"指向；用手指/手势指着（某人或某物），以指出位置或引起注意"},"examples":[{"en":"She was pointing at the map to show us the route.","zh":"她指着地图给我们看路线。"},{"en":"No pointing, please—it’s rude to point at people.","zh":"请不要指人——用手指指人不礼貌。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a finger, hand, or object) aimed or directed toward someone or something","zh":"（手指、手或物体）指向的；朝着……的"},"examples":[{"en":"He stood there with his finger pointing at the door.","zh":"他站在那里，手指指向门口。"},{"en":"The sign has an arrow pointing to the exit.","zh":"标牌上有个箭头指向出口。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “point”: to direct a finger or object toward something; to indicate or show","zh":"“point”的现在分词：指向；指示；表明"},"examples":[{"en":"She is pointing to the part you should read.","zh":"她正指着你应该读的那一部分。"},{"en":"The evidence is pointing to a different suspect.","zh":"证据指向了另一个嫌疑人。"}]}],"synonyms":["indicating","gesturing","directing","showing","aiming"],"phonetic":"/ˈpɔɪntɪŋ/","extraExplanation":["在一些文化里，用食指直接指人可能被视为不礼貌或带有指责意味。更礼貌的替代方式包括用整只手掌示意方向、用下巴轻示意，或用语言说明“在那边/那位”。"]}
{"word":"pointingly","summary":{"en":"“Pointingly” means speaking or acting in a direct, pointed way, often to emphasize or criticize.","zh":"“Pointingly”指以直指要害的方式说或做，常用于强调或带点批评意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a direct, clear, and often slightly critical or emphatic way (so that the message cannot be missed).","zh":"以直截了当、明确（常带一点批评或强调）的方式，让人无法忽视。"},"examples":[{"en":"She pointingly reminded him that he still hadn’t apologized.","zh":"她直截了当地提醒他，他还没有道歉。"},{"en":"He looked pointingly at the empty chair, hinting that someone was missing.","zh":"他意味深长地盯着那把空椅子，暗示有人缺席。"},{"en":"The article pointingly questions why the plan failed.","zh":"这篇文章直言不讳地质疑为何该计划会失败。"}]}],"synonyms":["directly","pointedly","bluntly","explicitly","meaningfully"],"phonetic":"/ˈpɔɪn.tɪŋ.li/","extraExplanation":["“pointingly”来自形容词“pointed”（尖锐的、直指要害的）+ 副词后缀“-ly”。它常用来描述语气、提醒、提问或目光：不一定大声，但很“有指向性”，让对方明白你在说什么、指谁、指哪件事。"]}
{"word":"pointless","summary":{"en":"“Pointless” usually means “without purpose or value”; it can also mean “blunt, without a sharp point.”","zh":"“pointless”通常指“没有目的或价值、无意义的”；也可指“钝的、没有尖端的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no purpose, value, or effect; not worth doing or caring about.","zh":"无意义的；没有目的或价值的；不值得做或在意的。"},"examples":[{"en":"Arguing with him is pointless—he never changes his mind.","zh":"和他争论毫无意义——他从不改变主意。"},{"en":"It feels pointless to worry about things we can’t control.","zh":"为我们无法控制的事情担心，感觉没有意义。"},{"en":"She quit the job because the work seemed pointless.","zh":"她辞掉了那份工作，因为那些工作看起来毫无价值。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of an object or shape) Without a sharp tip; blunt or rounded.","zh":"（物体/形状）没有尖端的；钝的；圆头的。"},"examples":[{"en":"Use a pointless needle for thick fabric so it won’t snag the threads.","zh":"厚布料要用钝头针，这样不容易勾到纱线。"},{"en":"The knife had become pointless over time.","zh":"那把刀久了变钝了。"}]}],"synonyms":["meaningless","useless","futile","worthless","senseless","aimless","unnecessary"],"phonetic":"/ˈpɔɪntləs/","extraExplanation":["“pointless”在日常口语里最常见的意思是“没有意义/白费劲”。语气通常偏负面，但也可以只是理性判断：例如“It’s pointless to…”=“……也没用/没必要”。","第二个意思“钝的、无尖端的”多用于特定语境（如针、刀、工具），在一般对话里不如第一个意思常见。"]}
{"word":"pointlessly","summary":{"en":"“Pointlessly” means doing something with no useful purpose or result—unnecessarily or in vain.","zh":"“Pointlessly”表示做某事没有用处或结果——不必要地、徒劳地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no useful purpose or result; unnecessarily.","zh":"徒劳地；无意义地；不必要地。"},"examples":[{"en":"We argued pointlessly for an hour and still didn’t solve the problem.","zh":"我们无意义地争论了一个小时，还是没有解决问题。"},{"en":"He kept refreshing the page pointlessly, hoping the message would appear.","zh":"他徒劳地不断刷新页面，希望消息会出现。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that emphasizes something is useless, hopeless, or without meaning.","zh":"（强调）毫无意义地；无望地；白费力气地。"},"examples":[{"en":"She stared pointlessly at the empty street, waiting for someone who wasn’t coming.","zh":"她毫无意义地盯着空荡荡的街道，等着一个不会来的人。"},{"en":"The machine whirred pointlessly after the power failure.","zh":"停电后，那台机器仍徒劳地嗡嗡转着。"}]}],"synonyms":["needlessly","in vain","futilely","senselessly","unnecessarily"],"phonetic":"/ˈpɔɪntləsli/","extraExplanation":["“pointlessly”来自形容词“pointless”（没有意义的、没有重点的）+ 副词后缀“-ly”。常用来评价行为/讨论/努力“没有结果或不值得”，语气可能带一点批评或无奈。","近义表达：“in vain”（徒劳地，更偏结果无果）、“needlessly”（不必要地，更偏不该做）。语气细微差别：pointlessly 强调“没有意义/没有目的”。"]}
{"word":"pointlessness","summary":{"en":"“Pointlessness” means the feeling or quality that something has no purpose or meaning.","zh":"“pointlessness”指某事缺乏目的或意义的状态/感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having no clear purpose, value, or useful result; meaninglessness.","zh":"无意义；无用；缺乏明确目的或价值的状态。"},"examples":[{"en":"After hours of arguing, she felt the pointlessness of the debate.","zh":"争论了好几个小时后，她觉得这场辩论毫无意义。"},{"en":"He struggled with a sense of pointlessness in his job.","zh":"他在工作中一直与“没有意义”的感觉作斗争。"}]}],"synonyms":["meaninglessness","futility","emptiness","purposelessness"],"phonetic":"/ˈpɔɪntləsnəs/","extraExplanation":["“pointlessness”来自“pointless”（无意义的）+ 名词后缀“-ness”（表示“……的状态/性质”），常用于描述一种主观感受：觉得某事“做了也没用/没有目的”。","语气上，“pointlessness”通常比“uselessness”（无用）更偏向“缺乏意义或目标”，而不一定是功能上“不能用”。例如：你可能觉得一个任务“pointless”，但它并非完全“useless”。"]}
{"word":"pointlet","summary":{"en":"Pointlet means a very small point or tiny pointed detail, sometimes used in lace/needlework descriptions.","zh":"Pointlet 指“很小的点/尖端”，也可指花边或针线图案中的细小尖饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small point, dot, or tiny pointed projection (often used in technical or descriptive writing)","zh":"小尖点；小点；微小的尖状突起（常见于较技术或描写性的语境）"},"examples":[{"en":"Under the microscope, the surface is covered with pointlets.","zh":"在显微镜下，这个表面布满了小尖点。"},{"en":"The leaf edge has pointlets that make it feel slightly rough.","zh":"叶缘有细小的尖突，所以摸起来有点粗糙。"}]},{"partOfSpeech":"n.","definition":{"en":"a tiny decorative point in needlework or lace (a small pointed detail in a pattern)","zh":"（针线活/花边中的）小尖饰；小尖角（图案里的细小尖状装饰）"},"examples":[{"en":"The lace trim is finished with neat pointlets along the border.","zh":"花边饰带的边缘用整齐的小尖饰收边。"},{"en":"She chose a pattern with delicate pointlets for a softer look.","zh":"她选了带有精致小尖饰的图案，让整体更柔和。"}]}],"synonyms":["tiny point","small point","dot","speck","prickle"],"phonetic":"ˈpɔɪntlət","extraExplanation":["“pointlet”来自“point（点/尖端）+ -let（表示‘小’的后缀）”，意思就是“更小的点/尖端”。在现代英语中不算常用，更常见的是用“tiny point / small point / dot / speck”等词来表达。","在纺织与花边语境里，它可指边缘一连串的小尖角装饰，类似你在一些蕾丝或装饰边上看到的“锯齿状小尖”。"]}
{"word":"pointleted","summary":{"en":"“pointleted” isn’t standard; you probably mean “bulleted” (with bullet points) or “pointed” (sharp or direct).","zh":"“pointleted”不是标准词；你多半想写 “bulleted”（项目符号）或 “pointed”（尖的/直指的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard) Likely a misspelling of “pointed” or “bulleted.” In most writing, use “bulleted” for lists with bullet points (•), or “pointed” for something sharp or indicating a point.","zh":"（非标准用法）很可能是 “pointed” 或 “bulleted” 的拼写错误。写作中，表示带项目符号（•）的列表通常用 “bulleted”，表示“尖的/指出的”通常用 “pointed”。"},"examples":[{"en":"Please change the list to a bulleted format.","zh":"请把这个列表改成项目符号格式。"},{"en":"She made a pointed comment about the mistake.","zh":"她针对那个错误说了一句尖锐的评论。"}]}],"synonyms":["bulleted","pointed"],"phonetic":"/ˈpɔɪntɪd/","extraExplanation":["“pointleted”在英语中几乎不作为正规单词使用。若你想表达“用项目符号列出”，最自然的是：bulleted list / bullet points / in bullet points。若你想表达“有尖端的”或“尖锐地指出”，用：pointed。","常见搭配：\n- a bulleted list（项目符号列表）\n- bullet points（要点；项目符号）\n- a pointed question/comment（尖锐的问题/评论）"]}
{"word":"pointmaker","summary":{"en":"Pointmaker means someone who scores points in sports, or (less commonly) someone who makes strong points in debate or writing.","zh":"Pointmaker 指体育中的得分手/制造得分的人；也可（较少见）指善于提出有力观点的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who scores points or creates scoring opportunities, especially in sports (often used in basketball).","zh":"（尤指体育运动中，常用于篮球）得分手；能制造得分机会的人。"},"examples":[{"en":"The team needs a reliable pointmaker in the fourth quarter.","zh":"球队在第四节需要一位稳定的得分手。"},{"en":"She’s not just a defender—she’s also a pointmaker who can finish fast breaks.","zh":"她不只是防守者——还是一名能在快攻中完成得分的球员。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes persuasive points in discussion, debate, or writing; someone good at building arguments (less common).","zh":"（较少见）善于提出有力观点的人；善于构建论证的人。"},"examples":[{"en":"In meetings, he’s a careful pointmaker who supports every claim with data.","zh":"在会议上，他很善于提出有根据的观点，每个论断都有数据支撑。"},{"en":"The author is a strong pointmaker, but the tone can feel too sharp.","zh":"作者很会“讲道理”，但语气可能显得过于尖锐。"}]}],"synonyms":["scorer","playmaker","shot-maker","argument-maker","good debater"],"phonetic":"/ˈpɔɪntˌmeɪkər/","extraExplanation":["“pointmaker”是由 point（分数/观点）+ maker（制造者）组成的复合名词，语义会随语境在“得分”与“提出观点”之间切换。","在体育语境中更自然的常见说法包括：scorer（得分手）、go-to scorer（关键得分手）、playmaker（组织核心/策动进攻者）。在讨论/写作语境中，更常用：good debater、strong argument-maker、makes good points。"]}
{"word":"pointmaking","summary":{"en":"Pointmaking means scoring points in sports, or (often critically) trying to gain advantage by emphasizing points in debate or politics.","zh":"Pointmaking 可指体育比赛中的得分/得分能力，也可指（常带批评）在辩论或政治中为占上风而刻意“抛观点、做文章”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of scoring points in a game or competition; producing points for your team","zh":"（比赛中）得分；为球队/选手制造得分"},"examples":[{"en":"Her quick pointmaking in the first quarter put the team ahead.","zh":"她在第一节的快速得分让球队取得领先。"},{"en":"The coach praised his pointmaking ability near the basket.","zh":"教练称赞他在篮下的得分能力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of trying to win praise or advantage by emphasizing a point (often in politics, debate, or conversation)","zh":"（常见于政治、辩论或谈话中）为了占上风或博好感而“抛观点/刷存在感”；借题发挥"},"examples":[{"en":"In the debate, his pointmaking sometimes mattered more than answering the question.","zh":"在辩论中，他有时更在意“做文章”而不是回答问题。"},{"en":"She was tired of pointmaking and wanted a real solution.","zh":"她厌倦了互相“打口水仗”，想要真正的解决方案。"}]}],"synonyms":["scoring","point production","point-scoring","making a point","one-upmanship"],"phonetic":"/ˈpɔɪntˌmeɪkɪŋ/","extraExplanation":["“pointmaking”多见于体育报道（尤其篮球等）表示“得分能力/得分表现”；在政治与媒体语境中常带一点批评意味，指“为了显得自己对、为了政治利益而刻意强调某点”。","更常见的表达包括：sports 里用 “scoring” / “point production”；讨论里用 “making a point”（中性）或 “political point-scoring”（偏贬义）。"]}
{"word":"pointman","summary":{"en":"A pointman is the person at the front—originally a lead soldier in a patrol, and more generally the key person who leads or coordinates an effort.","zh":"pointman 指“走在最前面的那个人”：原指巡逻队的尖兵，也可引申为工作中牵头、负责协调与对接的关键负责人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Military) The soldier who goes first in a patrol or movement, watching for danger and guiding others; the lead scout.","zh":"（军事）在巡逻或行进时走在最前面、负责警戒并为队伍引路的士兵；尖兵。"},"examples":[{"en":"The pointman moved quietly through the trees to check for traps.","zh":"尖兵悄悄穿过树林，检查是否有陷阱。"},{"en":"In a patrol, the pointman signals if the path is unsafe.","zh":"在巡逻中，尖兵会发信号提醒道路是否安全。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The main person who leads an effort, takes the front position, or serves as the key contact for a task or project.","zh":"（引申）带头推动某项工作的人；负责牵头或对接的关键负责人。"},"examples":[{"en":"She’s the pointman for the new marketing campaign.","zh":"她是新营销活动的牵头负责人。"},{"en":"Who’s the pointman we should contact about the schedule change?","zh":"关于日程变更，我们应该联系哪位主要负责人？"}]}],"synonyms":["lead scout","scout","front man","team lead","point person","key contact","lead"],"phonetic":"/ˈpɔɪntmæn/","extraExplanation":["“pointman”源自军事用语，尤其常见于越战相关叙述：走在队伍最前面的士兵风险最高，需要高度警觉。后来这个词被广泛借用到职场语境，表示“冲在前面、扛责任、做关键对接的人”。","搭配提示：常见说法有 “the pointman for/on (a project)” 或 “be the pointman”。语气偏口语/新闻报道，也常用于公司内部沟通。"]}
{"word":"pointmen","summary":{"en":"“Pointmen” is the plural of “pointman”: either the lead scout/soldier who goes first, or the main person leading a task or representing a group.","zh":"“pointmen”是“pointman”的复数：可指走在最前面侦察的尖兵，也可指在工作或谈判中牵头负责的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soldier or scout who goes first to look for danger and guide the group (especially in the military)","zh":"（尤指军队中的）尖兵，前锋；负责在队伍最前方侦察危险并引导前进的人"},"examples":[{"en":"The pointman moved quietly ahead to check for traps.","zh":"尖兵悄悄走在前面检查是否有陷阱。"},{"en":"In dense jungle, the pointman sets the pace for the patrol.","zh":"在茂密的丛林里，尖兵决定巡逻队的行进节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"the leading person in a team or project who takes responsibility, coordinates others, or speaks for the group","zh":"（团队/项目的）带头人，负责人；协调他人或代表团队发言的人"},"examples":[{"en":"She became the pointman for the company’s new safety program.","zh":"她成了公司新安全项目的负责人。"},{"en":"The senator was the pointman in negotiations with community leaders.","zh":"那位参议员是与社区领袖谈判的牵头人。"}]}],"synonyms":["lead scout","front man","advance scout","team lead","point person","key contact"],"phonetic":"/ˈpɔɪnt.mæn/","extraExplanation":["“pointman”原本是军事用语：行军或巡逻时走在最前面的人最容易先遇到危险，因此需要经验、警觉和判断力。后来这个词被广泛借用到职场和政治语境，表示“冲在前面、负责推进关键任务的人”。","你输入的“pointmen”是复数形式；单数是“pointman”。在较中性的表达里，也会看到“point person”（复数：point people / point persons）。"]}
{"word":"pointment","summary":{"en":"“Pointment” is not a standard English word; it is usually a misspelling of “appointment,” meaning a scheduled meeting/booking, or (more formal) an official selection for a position.","zh":"“pointment”不是标准英语词，通常是“appointment”的拼写错误；“appointment”常指预约/约定见面，也可指（较正式）任命或职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An arrangement to meet someone at a specific time (often with a doctor, dentist, or in business).","zh":"（常指看医生、商业等）约定在某个时间见面；预约。"},"examples":[{"en":"I have a dentist appointment at 3 p.m.","zh":"我下午三点有个牙医预约。"},{"en":"Let’s make an appointment to talk next week.","zh":"我们约个时间下周谈一谈。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of choosing someone for a job or position; the official act of appointing.","zh":"任命；委任（指正式选定某人担任职务）。"},"examples":[{"en":"Her appointment as manager surprised everyone.","zh":"她被任命为经理让大家都很惊讶。"}]},{"partOfSpeech":"n.","definition":{"en":"A job or position that someone has been given (more formal).","zh":"（较正式）任职；职位。"},"examples":[{"en":"He holds an appointment at the university.","zh":"他在大学任职。"}]}],"synonyms":["booking","reservation","meeting","engagement","schedule (as a noun)","designation (formal)","nomination (formal)"],"phonetic":"/əˈpɔɪntmənt/","extraExplanation":["“pointment”不是标准英语单词，通常是把“appointment”拼错了。正确拼法是 a + p + point + ment（可以用“a + point”来记忆：‘约定一个时间点’）。","“appointment”在日常生活里最常见的搭配有：make an appointment（预约）、have an appointment（有预约）、cancel/reschedule an appointment（取消/改期）。"]}
{"word":"pointrel","summary":{"en":"“pointrel” is not recognized as a standard English word; it is likely a misspelling or a proper name.","zh":"“pointrel”不是标准英语词汇；更可能是拼写错误或专有名词（人名/品牌名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/brand. In most dictionaries and corpora, “pointrel” does not appear as an established vocabulary item.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/品牌名。在大多数词典与语料中，“pointrel”并不是固定词汇。"},"examples":[{"en":"I searched for “pointrel,” but I couldn’t find it in an English dictionary.","zh":"我搜索了“pointrel”，但在英语词典里找不到。"},{"en":"Did you mean “pointer” or “pointless”?","zh":"你是不是想写“pointer”（指针/指示器）或“pointless”（没有意义的）？"}]}],"synonyms":["(no standard synonyms—word not established)"],"phonetic":"/ˈpɔɪntˌrɛl/","extraExplanation":["从拼写上看，它可能是以下词的误拼：\n- pointer /ˈpɔɪntɚ/（指针；指示器；也可指“指示犬”）\n- pointillism（点彩画法）相关词\n- pointless（无意义的）\n如果你能提供上下文句子（你在哪里看到、前后出现了哪些词），我可以更准确判断它想表达的词和意思。"]}
{"word":"points","summary":{"en":"“Points” usually means key ideas/details or scores; it can also mean sharp tips, measurement units, or “shows/indicates” (as a verb).","zh":"“points” 常指要点/观点或得分；也可指尖端、数值差异的单位，或作动词表示“指向/表明”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of point) Ideas, facts, or details in a discussion or writing.","zh":"（point 的复数）在讨论或写作中提出的要点、观点或细节。"},"examples":[{"en":"You made some good points in the meeting.","zh":"你在会议上提出了一些很好的观点。"},{"en":"Let me summarize the main points.","zh":"让我总结一下主要要点。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of point) A score unit in games, sports, or tests.","zh":"（point 的复数）比赛、运动或考试中的得分单位。"},"examples":[{"en":"Our team won by three points.","zh":"我们队以三分优势获胜。"},{"en":"You get two points for each correct answer.","zh":"每答对一题得两分。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of point) Sharp ends or tips on something.","zh":"（point 的复数）尖端；尖头。"},"examples":[{"en":"Be careful—the points of the scissors are sharp.","zh":"小心——剪刀尖很锋利。"},{"en":"The cactus has sharp points.","zh":"仙人掌有尖刺。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of point) A unit used to measure small differences (especially in numbers, prices, or percentages).","zh":"（point 的复数）用于表示很小差异的单位（常指数值、价格或百分比的点）。"},"examples":[{"en":"Interest rates rose by two points.","zh":"利率上升了两个百分点。"},{"en":"The price dropped a few points today.","zh":"今天价格小幅下降了几点。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “point”: to show, indicate, or aim in a particular direction.","zh":"point 的第三人称单数：指向；表明；暗示。"},"examples":[{"en":"The sign points to the exit.","zh":"标志指向出口。"},{"en":"All the evidence points to one conclusion.","zh":"所有证据都指向一个结论。"}]}],"synonyms":["ideas","arguments","details","scores","tips","indicates"],"phonetic":"/pɔɪnts/","extraExplanation":["在口语或会议场景里，people often say “good point!” 表示“说得对/这个观点很好”。复数 “points” 常用于“列要点”：例如 “three points” 指“三个要点”。","在数字语境里要注意：\"two points\" 有时指“两个百分点”（percent points），不一定等同于“增长了2%”。需要结合上下文判断。"]}
{"word":"pointsman","summary":{"en":"A pointsman is a railroad worker who switches tracks; figuratively, it can mean someone who steers events or decisions.","zh":"pointsman 指扳道工／道岔工；也可作比喻，指引导或掌控事态走向的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person stationed to switch railway tracks (points/switches) so trains go onto the correct line; a railroad switch operator.","zh":"铁路道岔工／扳道工：负责扳动道岔（转辙器）以引导列车驶入正确轨道的人。"},"examples":[{"en":"The pointsman changed the switch so the freight train could enter the siding.","zh":"扳道工扳动道岔，让货运列车驶入会让线。"},{"en":"In the old story, the pointsman watched the foggy tracks all night.","zh":"在那个老故事里，扳道工整夜守着雾气弥漫的铁轨。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, often literary) Someone who controls the direction of events, decisions, or information—like guiding something onto a different “track.”","zh":"（比喻，常见于文学或正式语境）掌控走向的人：像“扳道岔”一样引导事件、决策或信息朝某个方向发展的人。"},"examples":[{"en":"Behind the scenes, she acted as a pointsman, steering the negotiations away from conflict.","zh":"在幕后，她像“扳道工”一样把谈判引向避免冲突的方向。"},{"en":"The editor became the pointsman for the project, deciding what went in and what stayed out.","zh":"编辑成了项目的“扳道工”，决定哪些内容保留、哪些删去。"}]}],"synonyms":["switchman","railroad switch operator","signalman (related, BrE)","controller (figurative)"],"phonetic":"/ˈpɔɪnts.mən/","extraExplanation":["“Pointsman”主要是英式英语用法：英式英语里铁轨“道岔”叫 points，美国英语更常说 switch，因此相近职业在美式语境里常见表达是 switchman 或 railroad switch operator。","文学语境中它容易让人联想到查尔斯·狄更斯的短篇《The Signal-Man》（《信号员》）：虽然标题用的是 signal-man，但同属铁路岗位意象，常被用来营造“守望、预警、命运转向”的氛围。"]}
{"word":"pointsmen","summary":{"en":"Pointsmen is the plural of pointsman: railway switch operators, or (figuratively) key front-line leaders/coordinators.","zh":"pointsmen 是 pointsman 的复数：指铁路扳道工/道岔工；也可比喻指前线的关键带头人或协调者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pointsman: a railway worker who operates the track switches (points) to guide trains onto the correct line.","zh":"pointsman 的复数：铁路“扳道工/道岔工”，负责操作道岔（转辙器）以引导列车进入正确线路。"},"examples":[{"en":"The pointsmen changed the switch before the train arrived.","zh":"列车到达前，扳道工把道岔扳好了。"},{"en":"After the storm, pointsmen inspected the tracks and switches for damage.","zh":"暴风雨后，扳道工检查了线路和道岔是否受损。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of pointsman: (figurative) the key people who lead or guide an operation; the main contacts or “front-line” coordinators.","zh":"pointsman 的复数：（比喻）行动中的关键带头人/主力协调者；负责开路、牵头或对接的人。"},"examples":[{"en":"In the negotiations, the pointsmen kept communication clear between both sides.","zh":"在谈判中，这些关键协调者让双方沟通保持清晰。"},{"en":"The project’s pointsmen handled urgent issues and reported back to the team.","zh":"项目的主力负责人处理紧急问题并向团队汇报。"}]}],"synonyms":["switchmen","railway switch operators","coordinators","point men","key contacts"],"phonetic":"ˈpɔɪnts.mən","extraExplanation":["“pointsman”原本多用于英式英语铁路语境：points 指“道岔/转辙器”，pointsman 就是操作它的人。美式英语里更常见的对应说法是 switchman。","比喻义与“point man”相近：指在行动最前线、负责开路或对外联络的关键人物。注意 pointsman/pointsmen 更偏英式或较正式/较少见的用法。"]}
{"word":"pointswoman","summary":{"en":"A (now less common) word meaning a female officer who directs traffic at an intersection.","zh":"（较少用）指在路口指挥交通的女警官/女交通警察。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female police officer who directs traffic or helps control a road intersection (now less common; often replaced by “police officer” or “traffic officer”).","zh":"（较少用）女交通警察；指挥交通的女警官（现代更常用 police officer / traffic officer）。"},"examples":[{"en":"A pointswoman stood at the intersection and waved cars through one lane at a time.","zh":"一位女交通警察站在十字路口，挥手让车辆一条车道一条车道地通过。"},{"en":"The old novel mentions a pointswoman in a white helmet directing buses.","zh":"那本老小说里提到一位戴白色头盔的女交通警察在指挥公交车。"}]}],"synonyms":["traffic officer","police officer","policewoman (BrE, dated)"],"phonetic":"/ˈpɔɪntsˌwʊmən/","extraExplanation":["“pointswoman”来自“point”（铁路/道路的“道岔/转向点、路口指挥点”等含义）+“-s-”连接音+“woman”。在英式英语里，过去常见“policeman / policewoman”。如今很多场合更倾向用性别中性的说法，如“police officer”“traffic officer”，以更尊重与包容的表达。","在交通语境中，“point”也可指“point duty”（在路口站岗指挥交通），所以“pointswoman/pointsman”指的就是执行这类路口指挥任务的人。"]}
{"word":"pointure","summary":{"en":"Pointure is a French loanword meaning “shoe size,” and sometimes (less commonly in English) “a person of great stature/importance.”","zh":"Pointure是法语借词，主要指“鞋码”；在英语中较少见的引申义是“有分量/有地位的人（或其地位）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French, used especially in fashion/retail) shoe size; the numbered size of a shoe.","zh":"（法语借词，常见于时尚/零售语境）鞋码；鞋子的尺寸编号。"},"examples":[{"en":"What’s your pointure? I’ll check if we have that size in stock.","zh":"你的pointure（鞋码）是多少？我看看我们有没有这个尺码的现货。"},{"en":"These boots run small—go up one pointure.","zh":"这款靴子偏小——鞋码加大一号。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, informal, mainly French-influenced contexts) the stature/importance of a person, especially a well-known figure.","zh":"（引申义，较口语且多见于法语影响的语境）某人的分量/地位，尤指知名人物。"},"examples":[{"en":"She’s a pointure in the design world.","zh":"她在设计界很有分量。"},{"en":"They invited a few real pointures to speak at the conference.","zh":"他们邀请了几位真正有分量的人物在会议上发言。"}]}],"synonyms":["shoe size","size (shoe size)","big name","leading figure"],"phonetic":"/pwɑːnˈtʊr/","extraExplanation":["“pointure”是法语词，在英语里不算常用，更多出现在与法国有关的零售、时尚、品牌或双语环境中。英语更常说“shoe size”。","在法语里，“pointure”最常见就是“鞋码”；把它用来形容人的“分量/地位”也很常见，但这种引申义在英语里相对少见，多见于带法语色彩的表达。"]}
{"word":"pointways","summary":{"en":"“Pointways” is rare/nonstandard; it usually means you intended “pointwise,” or you meant the phrase “point ways.”","zh":"“pointways”很少见且不标准；通常是想写“pointwise（逐点地）”，或本来想表达短语“point ways”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word; most often a misspelling of “pointwise” (used in math/tech) or a mistaken merging of the phrase “point ways.”","zh":"一个很少见或不标准的词；多数情况下是把“pointwise”（数学/技术用语）拼错了，或把短语“point ways”误连写在一起。"},"examples":[{"en":"I couldn’t find “pointways” in a standard dictionary—did you mean “pointwise”?","zh":"我在常见词典里找不到“pointways”——你是不是想写“pointwise”？"},{"en":"If you mean “point ways,” you might be talking about directions or methods.","zh":"如果你指的是“point ways”，那可能是在说方向或方法。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Possible intended meaning: “pointwise”) For each individual point or element (not as a whole). Common in mathematics, programming, and data analysis.","zh":"（可能本意为“pointwise”）逐点地；对每一个点/元素分别处理（而不是整体处理）。常用于数学、编程和数据分析。"},"examples":[{"en":"The two functions are equal pointwise for all x in this range.","zh":"在这个范围内，对所有 x 来说，这两个函数逐点相等。"},{"en":"We compared the two arrays pointwise.","zh":"我们对这两个数组逐元素比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(If read as “point ways”) Ways/methods of pointing something out; or routes/directions indicated by pointing. This is uncommon and usually written as two words.","zh":"（如果理解为“point ways”）指出某事的方式；或用手指指示的路线/方向。这个用法不常见，通常写成两个词。"},"examples":[{"en":"There are several ways to point out the mistake without sounding rude.","zh":"有好几种指出错误的方法，同时又不会显得无礼。"},{"en":"He pointed the way to the exit.","zh":"他指给我去出口的路。"}]}],"synonyms":["pointwise","elementwise","in detail","step by step","ways","methods"],"phonetic":"/ˈpɔɪntˌweɪz/","extraExplanation":["“pointways”不是常见标准词条，很多拼写检查也会标成错误。你如果能提供原句/上下文，我可以更准确判断你想表达的是“pointwise（逐点地）”、还是“point ways（指路/方法）”、或其他词（例如“pathways”“point of view”等）。"]}
{"word":"pointwise","summary":{"en":"Pointwise means “for each point/element separately,” often used in math and computing.","zh":"Pointwise 指“逐点地/按元素分别地”，常用于数学与计算机语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Mathematics, computing) Considering each individual point or element separately, rather than as a whole.","zh":"（数学/计算机）逐点地、按每个点（或元素）分别地考虑，而不是整体地考虑。"},"examples":[{"en":"The function is defined pointwise: for each x, compute f(x) separately.","zh":"这个函数是按点定义的：对每个 x 分别计算 f(x)。"},{"en":"They compared the two signals pointwise to find where they differ.","zh":"他们逐点比较两段信号，找出不同之处。"}]},{"partOfSpeech":"adj.","definition":{"en":"Applied or true at each point/element individually (not necessarily in a global or overall sense).","zh":"（性质/操作）对每个点（或元素）分别成立/分别应用的（不一定整体成立）。"},"examples":[{"en":"Pointwise convergence is weaker than uniform convergence.","zh":"逐点收敛比一致收敛更弱。"},{"en":"The inequality holds pointwise for every time step.","zh":"这个不等式对每个时间步都逐点成立。"}]}],"synonyms":["elementwise","point-by-point","locally (in some contexts)"],"phonetic":"/ˈpɔɪntˌwaɪz/","extraExplanation":["“pointwise”常见于数学分析、信号处理、机器学习与编程文档，强调“对每个位置/元素分别做同样的操作”。例如逐点相加（pointwise addition）就是数组对应元素相加。","与之相对的词常是“global/overall（整体的）”“uniform（统一/一致的）”“aggregate（聚合的）”。在收敛概念里，逐点收敛只要求“每个点最终各自收敛”，不要求“以同样速度一起收敛”。"]}
{"word":"pointy","summary":{"en":"Pointy means having a sharp point, and informally it can also mean sharply critical or hurtful in tone.","zh":"pointy 常指“尖的、带尖端的”，口语中也可指“言辞尖刻、语气犀利”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a sharp tip or narrow end; shaped like a point.","zh":"尖的；有尖端的；末端很细的。"},"examples":[{"en":"Be careful—the scissors are pointy.","zh":"小心点——这把剪刀很尖。"},{"en":"The cat has pointy ears.","zh":"那只猫有尖尖的耳朵。"},{"en":"He drew a star with pointy edges.","zh":"他画了一颗边角尖尖的星星。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Sharply critical, direct, or likely to hurt someone’s feelings.","zh":"（非正式）尖刻的；犀利的；可能伤人感情的。"},"examples":[{"en":"She made a pointy comment about his mistakes.","zh":"她对他的错误做了句很尖刻的评论。"},{"en":"Try to give feedback without sounding pointy.","zh":"尽量给反馈时别显得太尖锐。"}]}],"synonyms":["pointed","sharp","spiky"],"phonetic":"/ˈpɔɪn.ti/","extraExplanation":["“pointy”常用于口语，比“pointed”更随意、更生活化：pointy shoes（尖头鞋）、pointy hat（尖帽子）。在表达“尖刻的”意思时也偏口语；更正式的说法常用“pointed/ cutting/ sharp”。","词源上来自“point（尖点）+ -y（……的）”。在文学或描写性文本里，常用来营造视觉细节（如“pointy teeth/ shadows”带来更强的画面感）。"]}
{"word":"poire","summary":{"en":"“Poire” means “pear” in French and is used in English mostly in food/drink names.","zh":"“poire”是法语“梨”，在英语中主要用于菜名或酒饮名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a pear; used in English mainly in culinary names (e.g., desserts or drinks).","zh":"（源自法语）梨；在英语里多见于菜名、甜点或酒类名称中。"},"examples":[{"en":"The menu offered poire tart with vanilla ice cream.","zh":"菜单上有梨塔（poire tart），配香草冰淇淋。"},{"en":"Poire Williams is a pear-flavored brandy.","zh":"Poire Williams 是一种梨味白兰地。"}]}],"synonyms":["pear"],"phonetic":"/pwɑr/","extraExplanation":["“poire”是法语“梨”的意思。在英语日常表达里通常直接说“pear”，而“poire”多出现在法式料理、甜点、酒类或产品命名中，用来营造法式风格。","在法语口语里，“poire”有时也可作俚语指“傻瓜/好欺负的人”，但这层含义一般不直接借进英语使用；英语里更常用“idiot / fool / sucker”等表达。"]}
{"word":"pois","summary":{"en":"“POIs” means multiple points of interest—places marked as worth visiting or important, especially on maps and apps.","zh":"“POIs”是POI的复数，指多个“兴趣点/关注地点”，常用于地图与应用中表示值得去或重要的地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of POI (point of interest): a place that people may want to visit or see, especially shown in maps or travel apps.","zh":"POI（point of interest，兴趣点/景点/关注地点）的复数：指人们可能想去或想了解的地点，常见于地图或旅行应用中。"},"examples":[{"en":"This map shows nearby POIs like cafés, museums, and parks.","zh":"这张地图显示了附近的POIs，比如咖啡馆、博物馆和公园。"},{"en":"The app lets you save POIs to plan your trip.","zh":"这个应用可以让你保存POIs来规划行程。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/tech) locations or facilities important for a task (e.g., delivery stops, service sites).","zh":"（商业/技术）对某项任务重要的地点或设施（如配送站点、服务点）。"},"examples":[{"en":"The driver’s route includes ten POIs for deliveries.","zh":"司机的路线包含十个配送POIs。"},{"en":"We tagged POIs where the equipment needs inspection.","zh":"我们标记了需要检查设备的POIs。"}]}],"synonyms":["points of interest","attractions","landmarks","sites"],"phonetic":"/ˌpiː oʊ ˈaɪ/","extraExplanation":["“POI/POIs”常见于地图、导航、旅游与定位服务（LBS）领域，通常指被系统标注的“值得关注的地点”，如地标、商店、餐厅、医院、公交站等。","注意不要与“poise /pɔɪz/”（镇定；使平衡）混淆：两者拼写相近，但读音与含义完全不同。"]}
{"word":"poisable","summary":{"en":"“Poisable” is a rare adjective meaning “able to be balanced or positioned steadily.”","zh":"“Poisable”是个罕见形容词，意思是“可被平衡/可稳稳定位的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) able to be balanced or held steadily in a particular position; capable of being poised.","zh":"（罕见）可被平衡、可被稳稳地保持在某个位置；能够被“使保持平稳/使保持姿态”的。"},"examples":[{"en":"The sculpture’s arms are designed to be poisable at different angles.","zh":"这座雕塑的手臂被设计成可以在不同角度上保持平衡（可调整并稳稳定住）。"},{"en":"Use a lighter tripod so the camera is more easily poisable on uneven ground.","zh":"用更轻的三脚架，这样相机在不平的地面上更容易调整并稳稳摆放。"}]}],"synonyms":["balanceable","positionable","adjustable","steady","posable"],"phonetic":"/ˈpɔɪzəbəl/","extraExplanation":["“poisable”非常少见，许多情况下人们会直接用更常见的表达来替代，比如：be able to be balanced / adjustable / positionable（可调整位置的）/ poseable（可摆姿势的，多用于玩偶、模型）。","它来自动词poise（使平衡、使保持稳定；也可指“沉着地保持姿态”）+ -able（表示“能够……的”）。在产品说明、机械/模型描述里更可能出现。","如果你想表达“玩偶/模型的关节可以摆出姿势”，更地道的词通常是“poseable / posable”（常见拼写是posable）。"]}
{"word":"poise","summary":{"en":"Poise means calm, confident self-control or graceful balance; as a verb it means to hold steady or be ready to act.","zh":"poise 指沉着自信或优雅得体；作动词可指稳稳地托住/保持平衡，或“蓄势待发、准备行动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Calm confidence and self-control, especially in a difficult or public situation.","zh":"（尤指在困难或公众场合的）沉着、自信与自控。"},"examples":[{"en":"She answered the tough questions with poise.","zh":"她沉着地回答了那些棘手的问题。"},{"en":"Even under pressure, he kept his poise.","zh":"即使在压力之下，他也保持沉着。"}]},{"partOfSpeech":"n.","definition":{"en":"A graceful, balanced way of standing, moving, or behaving; elegance.","zh":"（姿态或举止的）优雅与平衡。"},"examples":[{"en":"The dancer moved across the stage with poise.","zh":"舞者以优雅的姿态穿过舞台。"},{"en":"Her poise made her seem older than her age.","zh":"她的举止沉稳优雅，让她看起来比实际年龄更成熟。"}]},{"partOfSpeech":"v.","definition":{"en":"To hold or carry something steady in a ready position; to balance or be about to do something.","zh":"使稳定地保持在某个准备姿势；（也可指）蓄势待发、将要做某事。"},"examples":[{"en":"He poised the glass carefully on the edge of the table.","zh":"他小心地把杯子稳稳地放在桌边。"},{"en":"The hawk poised above the field before diving.","zh":"鹰在田野上方盘旋停悬，随后俯冲而下。"},{"en":"She was poised to speak, but stopped.","zh":"她正要开口，却停住了。"}]}],"synonyms":["composure","self-possession","equanimity","grace","balance","steadiness","calmness"],"phonetic":"/pɔɪz/","extraExplanation":["“poise”既可形容心理状态（沉着、自信），也可形容外在气质（优雅、得体）。日常写作里很常见的搭配是：keep/maintain one’s poise（保持沉着）；be poised to do sth（蓄势待发/准备做某事）。","词源上与“weight/衡量、平衡”的概念有关，所以动词含义里常带“保持平衡、稳稳托住”的画面感。"]}
{"word":"poised","summary":{"en":"Poised means calm and confident, or ready to act, or balanced in position.","zh":"poised 可指沉着自信、蓄势待发，也可指处于平衡稳定的位置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Calm, confident, and able to act or speak in a controlled way, especially under pressure.","zh":"沉着自信的；（尤指在压力下）镇定自若的。"},"examples":[{"en":"She stayed poised during the interview, even when the questions got difficult.","zh":"即使问题变难，她在面试中仍然保持沉着。"},{"en":"The speaker was poised and clear, which made the audience trust him.","zh":"演讲者沉着清晰，这让观众更信任他。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a ready position; prepared to do something immediately.","zh":"蓄势待发的；准备好立刻行动的。"},"examples":[{"en":"The cat was poised to pounce on the toy.","zh":"那只猫蓄势待发，准备扑向玩具。"},{"en":"Investors are poised to react to the news.","zh":"投资者已经准备好对消息作出反应。"}]},{"partOfSpeech":"adj.","definition":{"en":"Balanced or held in a particular position, often delicately.","zh":"（常指微妙地）保持平衡的；稳稳地处在某个位置上。"},"examples":[{"en":"A glass was poised on the edge of the table.","zh":"一个杯子稳稳地放在桌边。"},{"en":"The bird was poised on a branch, perfectly still.","zh":"那只鸟停在树枝上，一动不动。"}]}],"synonyms":["composed","self-assured","ready","prepared","balanced"],"phonetic":"/pɔɪzd/","extraExplanation":["“poised”常见于正式或描写性的语境：既可以形容人的气质（沉着、优雅、自信），也可以形容“准备做某事”的状态（be poised to do sth）。","常见搭配：poised for success（蓄势成功）、poised to win（准备赢）、poised and graceful（沉着且优雅）。","词源上与“pose/position（摆姿势、放置位置）”有关，所以也带有“姿态端正、位置稳定”的感觉。"]}
{"word":"poiser","summary":{"en":"“Poiser” is rare in modern English; it may mean a balancer, but it’s often a misspelling of “poise” or “poser.”","zh":"“Poiser”在现代英语中很少见；可勉强理解为“平衡器/使平衡者”，但常见情况是把“poise”或“poser”拼错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, nonstandard word meaning a person or thing that sets something in position or keeps it balanced.","zh":"一个罕见、非标准用法的词，可指“把某物放稳/使平衡的人或物”。"},"examples":[{"en":"In older technical writing, a device could be described as a poiser that keeps the mechanism balanced.","zh":"在一些较旧的技术写作中，某个装置可能被称为 poiser，用来让机构保持平衡。"},{"en":"Most modern writers would avoid “poiser” and use “balancer” instead.","zh":"多数现代写作者会避免用“poiser”，而改用“balancer（平衡器）”。"}]}],"synonyms":["balancer","counterweight","stabilizer"],"phonetic":"/ˈpɔɪzər/","extraExplanation":["“poiser”在现代英语里非常少见，很多时候是把“poise”（镇定；使平衡）误写成“poiser”，或把“poser”（摆姿势的人；难题）拼错成“poiser”。如果你告诉我句子语境，我可以帮你判断你真正想用的是哪一个词。","更常用的相关词：poise（n. 镇定；v. 使平衡/使准备好）、composure（镇定）、balance（平衡）、balancer（平衡器）。"]}
{"word":"poisers","summary":{"en":"“Poisers” is not a standard spelling; it is usually a misspelling of “posers,” meaning people who pretend to be something (or a difficult question/problem).","zh":"“poisers”不是标准拼写，通常是把“posers”拼错了，意思是“装的人”，也可指“难题/棘手的问题”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) “poisers” is usually meant to be “posers,” the plural of “poser.” A poser is someone who pretends to be something (often to impress others), or someone/something that poses a question or problem.","zh":"（常见拼写错误）“poisers”通常是想写成“posers”（poser 的复数）。poser 指假装成某种身份（常为博取他人好感）的人；也可指提出问题/造成难题的人或事。"},"examples":[{"en":"Some people called them posers because they only followed the trend.","zh":"有些人叫他们“装的人”（posers），因为他们只是跟风。"},{"en":"The report is a real poser—we still don’t know why costs went up.","zh":"这份报告真是个难题（a real poser）——我们仍然不知道成本为何上升。"}]}],"synonyms":["phonies","pretenders","fakes","a tough question","a puzzle"],"phonetic":"ˈpoʊzərz","extraExplanation":["“poisers”容易和“poise（从容、平衡）”混淆：poise 是名词/动词，表示“沉着、泰然自若”或“使保持平衡”；pose/poser 则与“摆姿势、冒充”相关。想表达“装的人”，用 poser/posers。","如果你本来想查的是“poise”或“poisoners（投毒者）”，告诉我你看到它的原句，我可以按语境解释。"]}
{"word":"poises","summary":{"en":"“Poises” is usually the plural of “poise” (calm confidence or balance) or the 3rd-person singular verb form meaning “to balance/hold steadily.” It can also mean the plural of the viscosity unit “poise” in technical contexts.","zh":"“poises”通常是“poise”的复数（沉着自信或平衡），也可作动词第三人称单数，表示“使平衡/稳稳地拿着或放置”。在技术语境中，它还可表示黏度单位“泊（poise）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) calm, confident self-control; steady balance.","zh":"（复数）沉着自信的自控力；（身体或状态的）平衡、稳重。"},"examples":[{"en":"Even under pressure, she kept her poises and spoke clearly.","zh":"即使在压力下，她仍保持镇定，讲话很清晰。"},{"en":"The dancer’s poises made every movement look effortless.","zh":"舞者的沉着与平衡让每个动作看起来毫不费力。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “poise”) to hold or place (someone or something) in a steady, ready position; to balance.","zh":"（动词“poise”的第三人称单数）使（某人或某物）保持在稳定、准备好的姿势；使平衡。"},"examples":[{"en":"He poises the camera on the tripod before filming.","zh":"他把相机稳稳地架在三脚架上再开始拍摄。"},{"en":"She poises her foot on the step, ready to climb.","zh":"她把脚稳稳地踩在台阶上，准备往上爬。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, technical) units of dynamic viscosity (plural of “poise”) used in physics/chemistry.","zh":"（复数，技术用语）动力黏度单位“泊”（poise）的复数，用于物理/化学。"},"examples":[{"en":"The report lists the fluid’s viscosity in poises.","zh":"报告用泊（poise）的复数形式 poises 来列出该流体的黏度。"}]}],"synonyms":["composure","self-possession","equilibrium","balance","steadiness"],"phonetic":"/pɔɪzɪz/","extraExplanation":["“poise”常见意思是“沉着/泰然自若”或“（身体）平衡”。在日常英语里，更常用不可数的单数形式：She has poise. 说“poises”表示“多种沉着表现/多次体现的沉着”时较少见，但在文学描写或强调不同“姿态/稳定状态”时可能出现。","作为动词，“poise”常用于描写“稳稳地举着/放在边缘上/准备就绪”的画面感：poise a glass on the edge, poise a foot, poise a weapon（较文学/新闻风格）。","技术含义“poise（泊）”来自科学计量单位体系（cgs制），在工程或科研语境会见到；生活场景里更常见用 SI 单位（如 Pa·s）。"]}
{"word":"poiseuille","summary":{"en":"Poiseuille is a viscosity unit equal to 1 Pa·s, and it is also the name of the scientist whose work led to Poiseuille’s law.","zh":"poiseuille 指一种黏度单位（=1 Pa·s），也指提出相关流体流动研究的科学家泊肃叶，并由此有“泊肃叶定律”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(physics) A unit of dynamic viscosity equal to one pascal-second (1 Pa·s), used especially in fluid mechanics.","zh":"（物理）“泊肃叶”，一种动力黏度单位，等于 1 帕斯卡·秒（1 Pa·s），常见于流体力学语境。"},"examples":[{"en":"At room temperature, water has a viscosity of about 0.001 poiseuille (Pa·s).","zh":"在室温下，水的黏度大约是 0.001 泊肃叶（Pa·s）。"},{"en":"The report lists viscosity in poiseuille rather than in poise.","zh":"这份报告用泊肃叶而不是用泊（poise）来表示黏度。"}]},{"partOfSpeech":"n.","definition":{"en":"Jean Léonard Marie Poiseuille (1797–1869), a French physician and physiologist known for work on blood flow and fluid flow in tubes.","zh":"泊肃叶（Jean Léonard Marie Poiseuille，1797–1869），法国医生与生理学家，以研究血流及管内流体流动而著名。"},"examples":[{"en":"Poiseuille’s work helped explain how pressure relates to flow in narrow tubes.","zh":"泊肃叶的研究帮助解释了压力如何影响细管中的流量。"}]}],"synonyms":["pascal-second","Pa·s"],"phonetic":"/pwɑːˈzwiː/","extraExplanation":["“poiseuille”作为单位名来自泊肃叶（Poiseuille）在流体力学中的经典研究，尤其是“泊肃叶定律”（Poiseuille’s law），描述在圆管内的层流条件下，体积流量与压差、管半径、黏度和管长之间的关系。","在工程与科学写作中，更常见的写法与单位表达是“Pa·s（pascal-second）”。“poiseuille”常见于较传统或特定领域的文献。"]}
{"word":"poising","summary":{"en":"“Poising” means balancing/holding steady, or positioning yourself (or something) in readiness to act; it can also be the -ing form of “poise.”","zh":"“poising”指保持平衡/稳定，或摆好姿势蓄势待发；也可作动词“poise”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of holding something steady, balanced, or in a controlled position","zh":"（使某物）保持稳定、平衡或受控姿态的动作"},"examples":[{"en":"She practiced the poising of the tray so the cups wouldn’t spill.","zh":"她练习托盘的平衡控制，避免杯子里的东西洒出来。"},{"en":"The dancer’s poising on one foot looked effortless.","zh":"舞者单脚的平衡姿态看起来毫不费力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of positioning yourself or something so you are ready to act (often used for a jump, strike, or quick movement)","zh":"（人或物）为行动做准备而摆出姿势、蓄势待发的动作（常用于跳跃、出击或迅速移动）"},"examples":[{"en":"After a moment of poising, the cat leapt onto the table.","zh":"猫蓄势片刻后跳上了桌子。"},{"en":"You could see the runner’s poising at the starting line.","zh":"你能看到跑者在起跑线上的蓄势待发。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “poise”: to hold steady, balance, or prepare for action","zh":"动词“poise”的现在分词：使稳定/保持平衡/摆好姿势准备行动"},"examples":[{"en":"He was poising the ladder against the wall before climbing.","zh":"他把梯子稳稳地靠在墙上，准备攀爬。"},{"en":"The bird is poising on the branch, ready to fly.","zh":"那只鸟停在树枝上保持平衡，随时准备飞走。"}]}],"synonyms":["balancing","steadying","positioning","readying","bracing"],"phonetic":"/ˈpɔɪzɪŋ/","extraExplanation":["“poising”来自动词“poise”。在现代英语里更常见的是形容词/短语用法：be poised（从容、镇定；或“蓄势待发”）以及 be poised to do something（即将/准备做某事）。例如：The company is poised to expand.（公司准备扩张/即将扩张。）","写作中，“poising”常用来描写一种“短暂停顿+控制感”的动作画面，带有紧张或优雅的氛围（如猫、舞者、运动员在行动前的瞬间）。"]}
{"word":"poison","summary":{"en":"“Poison” most commonly means a harmful substance, and it can also mean to kill/harm with such a substance or (figuratively) to corrupt something.","zh":"“poison”最常指“毒物/毒药”，也可作动词表示“投毒/使中毒”，并可比喻“毒害、败坏（关系、氛围等）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that can cause illness or death if it is eaten, drunk, breathed in, or absorbed","zh":"毒药；毒物（被吃下、喝下、吸入或被皮肤吸收后会致病或致死的物质）"},"examples":[{"en":"Keep all medicine and poison out of children’s reach.","zh":"把所有药品和毒物放在儿童够不到的地方。"},{"en":"The label warned that the liquid was a deadly poison.","zh":"标签警告这种液体是致命毒物。"}]},{"partOfSpeech":"vt.","definition":{"en":"to harm or kill someone by giving them poison; to make a person or animal ill with a harmful substance","zh":"下毒（毒害）；使（人或动物）中毒、生病"},"examples":[{"en":"Someone tried to poison the neighbor’s dog.","zh":"有人试图毒死邻居的狗。"},{"en":"The food was poisoned by bacteria.","zh":"食物被细菌污染而“带毒”，导致中毒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to damage or corrupt something (such as relationships, ideas, or feelings), making it unpleasant or unhealthy","zh":"（比喻）毒害；败坏；使变质（如关系、想法或情绪被破坏、变得不健康）"},"examples":[{"en":"Jealousy can poison a friendship.","zh":"嫉妒会毒害友谊。"},{"en":"Harsh rumors poisoned the office atmosphere.","zh":"恶意谣言让办公室氛围变得很糟。"}]},{"partOfSpeech":"adj.","definition":{"en":"poisonous; containing or producing poison","zh":"有毒的；含毒或产生毒素的"},"examples":[{"en":"Some mushrooms are poison and should never be eaten.","zh":"有些蘑菇有毒，绝对不能吃。"}]}],"synonyms":["toxin","venom","contaminate","infect","corrupt"],"phonetic":"/ˈpɔɪzən/","extraExplanation":["“Poison”既可指真正的“毒物”（n.），也常用作比喻（vt.）表示“让关系/情绪/环境变坏”，语气比“harm”更强，带有“腐蚀、败坏”的感觉。","常见搭配：poison ivy（毒葛，接触会引起皮疹）、poison pill（商战中“毒丸计划”；也可泛指让人难以接受的条款）、poisoning（中毒；投毒事件）。"]}
{"word":"poisonable","summary":{"en":"“Poisonable” means able to be poisoned or harmed by poison.","zh":"“poisonable”指“可被下毒的；容易因毒物而受害/中毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be poisoned; capable of being harmed or killed by poison","zh":"可被下毒的；可能因毒物而受害或致死的"},"examples":[{"en":"The bait is poisonable, so keep it away from pets and children.","zh":"这种诱饵可能被下毒，所以要远离宠物和儿童。"},{"en":"Some insects are less poisonable because they can break down certain chemicals.","zh":"有些昆虫不太容易被毒死，因为它们能分解某些化学物质。"}]}],"synonyms":["susceptible to poison","vulnerable to poisoning","poison-sensitive"],"phonetic":"/ˈpɔɪzənəbəl/","extraExplanation":["“poisonable”在日常英语中不算常见，更常用的表达是“can be poisoned / susceptible to poison（容易中毒的）”。","词缀提示：-able 表示“能够……的/可被……的”，类似：breakable（易碎的）、washable（可水洗的）。","语境上常见于科学、医学、农业或安全讨论，用来描述生物或材料对毒物的“可中毒性/易受毒害性”。"]}
{"word":"poisonberry","summary":{"en":"A general word for a poisonous (unsafe-to-eat) berry.","zh":"泛指有毒、不可食用的浆果（毒莓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a berry that is poisonous or harmful to eat; often used as a general (non-scientific) name for any toxic wild berry","zh":"毒莓；有毒的浆果（常作泛称，并非正式的植物学名称）"},"examples":[{"en":"Don’t eat wild fruit unless you’re sure it isn’t a poisonberry.","zh":"除非你确定不是毒莓，否则不要吃野外的果子。"},{"en":"The guide warned us that several bright red berries in the area could be poisonberries.","zh":"向导提醒我们，这一带有几种鲜红的浆果可能是毒莓。"}]}],"synonyms":["poisonous berry","toxic berry","poison berry"],"phonetic":"/ˈpɔɪzənˌbɛri/","extraExplanation":["“poisonberry”在日常英语里并不算常见，更常见的说法是“poisonous berries / toxic berries”。它常出现在告示、口语提醒或奇幻作品里，用来泛指“有毒的野果”，而不是指某一种特定植物。","在现实中，很多有毒浆果外观漂亮但不可食用；英语里常见的安全提醒是“when in doubt, don’t eat it”（不确定就别吃）。"]}
{"word":"poisonbush","summary":{"en":"A general term for a poisonous shrub (the exact plant can vary by region).","zh":"毒灌木的统称（具体指哪种植物因地区而异）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous shrub; a common name for several different plants whose leaves, sap, or berries can harm people or animals if touched or eaten.","zh":"毒灌木；对人或动物有害（接触或误食会中毒）的灌木的俗称，可指多种不同植物。"},"examples":[{"en":"Hikers were warned to avoid the poisonbush along the trail.","zh":"有人提醒徒步者避开小径旁的毒灌木。"},{"en":"The dog got sick after chewing on a poisonbush.","zh":"那只狗啃了毒灌木后生病了。"}]}],"synonyms":["poison bush","poisonous shrub","toxic shrub"],"phonetic":"/ˈpɔɪzənˌbʊʃ/","extraExplanation":["“poisonbush/poison bush”不是一个严格的单一植物学名称，而是口语里的“统称”。在不同地区它可能指不同的有毒灌木（例如某些地区会用来泛指会引起皮肤刺激或对牲畜有毒的灌木）。阅读野外告示、地图或科普文章时，最好结合当地语境或学名来确认具体是哪一种植物。"]}
{"word":"poisoned","summary":{"en":"“Poisoned” usually means contaminated with poison, and it can also mean emotionally or socially “ruined” by something harmful (like jealousy or rumors).","zh":"“poisoned”通常指“被下毒的/有毒的”，也可比喻为因嫉妒、谣言等而使关系或氛围“被毒化、变坏”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made harmful or deadly by poison; contaminated with a toxic substance.","zh":"被下毒的；含毒的；被有毒物质污染的。"},"examples":[{"en":"The police said the victim may have drunk poisoned tea.","zh":"警方表示受害者可能喝了被下毒的茶。"},{"en":"Don’t touch the poisoned bait—it’s dangerous to pets and wildlife.","zh":"别碰有毒的诱饵——对宠物和野生动物都很危险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Emotionally or socially damaged by anger, mistrust, or bad experiences (often used with “relationship,” “atmosphere,” or “mind”).","zh":"（关系、氛围、心态等）被仇恨、不信任或糟糕经历“毒化”的；变坏的。"},"examples":[{"en":"Their friendship was poisoned by jealousy.","zh":"他们的友谊被嫉妒毒化了。"},{"en":"Online rumors poisoned the atmosphere at work.","zh":"网络谣言让工作氛围变得很糟。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “poison”: to harm or kill with poison; or to ruin something (like a relationship) in a negative way.","zh":"“poison”的过去式/过去分词：用毒害（人或物）；或使（关系等）变坏、被“毒化”。"},"examples":[{"en":"The food was poisoned, and several people got sick.","zh":"食物被下了毒，好几个人生病了。"},{"en":"His lies poisoned the team’s trust.","zh":"他的谎言破坏了团队的信任。"}]}],"synonyms":["toxic","contaminated","tainted","venomous","polluted","ruined"],"phonetic":"/ˈpɔɪzənd/","extraExplanation":["“poisoned”既可以指字面上的“下毒/有毒”，也常用于比喻，表示某种情绪或事件让关系、氛围、观点“变质”。学习时可以看搭配：poisoned food/water（字面）；poisoned relationship/atmosphere/mind（比喻）。","常见近义表达（比喻）：toxic（有毒的/有害的）、tainted（被污染的/被玷污的）、soured（关系变坏的）、ruined（被毁的）。语气强弱上：poisoned/toxic通常更强、更负面。"]}
{"word":"poisoner","summary":{"en":"A poisoner is someone who harms or kills by using poison, or someone who poisons animals/pests or contaminates a place with poison.","zh":"poisoner 指“下毒者”，即用毒药伤害或杀害他人的人；也可指投毒毒杀动物/害兽或污染环境的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who kills, harms, or tries to harm someone by giving them poison (often secretly).","zh":"下毒者；用毒药杀害或伤害他人（通常是秘密进行）的人。"},"examples":[{"en":"The police arrested a suspected poisoner after the lab found toxins in the victim’s drink.","zh":"在化验发现受害者饮料中有毒素后，警方逮捕了一名疑似下毒者。"},{"en":"In many mystery novels, the poisoner appears to be a trusted friend.","zh":"在许多推理小说中，下毒者往往看起来像是值得信赖的朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who puts poison into food, water, or the environment to kill or control animals or pests.","zh":"投放毒药以毒杀或控制动物、害兽的人；投毒者。"},"examples":[{"en":"Farmers reported a poisoner who left bait that killed neighborhood dogs.","zh":"农民举报有人投放毒饵，导致邻居的狗死亡。"},{"en":"Officials warned that a poisoner may have contaminated the stream to kill fish.","zh":"官员警告说，可能有人向小溪投毒以毒死鱼类。"}]}],"synonyms":["poisoner","toxicant user","poisoner (criminal)","poisoner (suspect)"],"phonetic":"/ˈpɔɪzənər/","extraExplanation":["词源与构词：poisoner = poison（毒药/下毒）+ -er（表示“做某事的人”）。因此它通常指“下毒的人”，带有强烈的犯罪或恶意色彩。","使用语境：在新闻、法律或犯罪题材中常见；也常出现在侦探/悬疑文学里（例如阿加莎·克里斯蒂作品中常见“poisoning”情节）。"]}
{"word":"poisoners","summary":{"en":"“Poisoners” means people who intentionally poison others; it can also figuratively mean people who spread harmful influence.","zh":"“poisoners”指投毒害人的人；也可比喻散播有害影响、破坏信任的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who deliberately put poison into someone’s food, drink, or body to harm or kill them.","zh":"下毒者；投毒者（故意在食物、饮料或人体中投放毒物以伤害或杀害他人的人）。"},"examples":[{"en":"The police arrested two suspected poisoners after several guests became sick.","zh":"几名宾客生病后，警方逮捕了两名疑似投毒者。"},{"en":"In the story, the poisoners slipped poison into the king’s wine.","zh":"在故事里，投毒者把毒药悄悄放进国王的酒里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) People who spread harmful ideas, rumors, or negativity that can damage relationships or a community.","zh":"（比喻）散播有害观念、谣言或负面情绪的人（会破坏关系或群体氛围）。"},"examples":[{"en":"Gossip can turn ordinary people into poisoners of trust.","zh":"八卦流言会让普通人变成“信任的投毒者”。"},{"en":"The coach warned that a few poisoners in the locker room could ruin the team spirit.","zh":"教练警告说，更衣室里少数“投毒者”可能毁掉团队士气。"}]}],"synonyms":["poisoner","toxin spreaders","murderers (if fatal)","gossipmongers (figurative)","troublemakers (figurative)"],"phonetic":"/ˈpɔɪzənərz/","extraExplanation":["“poisoners”是“poisoner”的复数形式，词根来自“poison（毒药）”。在法律或新闻语境中常与“suspected（疑似）/ convicted（定罪）/ serial（连环）”等词搭配，如“suspected poisoner(s)”。","在文学与历史叙事中，“投毒”常被用来营造阴谋与背叛的氛围（如宫廷、继承权、权力斗争），因此“poisoner”也常带有强烈的道德谴责色彩。"]}
{"word":"poisonful","summary":{"en":"“Poisonful” means “poisonous; full of poison,” but it’s rare in modern English.","zh":"“poisonful”意为“有毒的；充满毒的”，但在现代英语中很少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of poison; poisonous; likely to cause harm or death if eaten, drunk, or absorbed.","zh":"充满毒的；有毒的；可能在食用、饮用或吸收后造成伤害或死亡的。"},"examples":[{"en":"Some wild berries look sweet but can be poisonful, so don’t eat anything you can’t identify.","zh":"有些野莓看起来很甜，但可能是有毒的，所以不要吃任何你无法辨认的东西。"},{"en":"He described the drink as poisonful and refused to take a sip.","zh":"他形容那杯饮料“有毒”，拒绝喝一口。"}]}],"synonyms":["poisonous","toxic","venomous (for bites/stings)","noxious"],"phonetic":"/ˈpɔɪzənfəl/","extraExplanation":["“poisonful”在现代英语中很少使用，听起来偏古旧或不自然。日常更常见、更地道的说法是“poisonous”（有毒的）或“toxic”（有毒的，常用于化学/环境语境）。","词形上它由“poison + -ful”构成，类似“harmful（有害的）”。但因为“poisonous/toxic”更常用，所以“poisonful”通常只在少见的写作或旧文本里出现。"]}
{"word":"poisonfully","summary":{"en":"Poisonfully means “in a poisonous way” or, more often figuratively, “maliciously or hurtfully.” It is rare in modern usage.","zh":"poisonfully 意为“有毒地”或更常见的比喻义“恶毒地、伤人地”。该词在现代英语中较少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a poisonous or toxic way; so as to harm (literally or figuratively).","zh":"以有毒的方式；带来伤害（字面或比喻）。"},"examples":[{"en":"Some mushrooms look harmless but can affect the body poisonfully.","zh":"有些蘑菇看起来无害，但会以有毒的方式影响人体。"},{"en":"The rumor spread poisonfully through the community, damaging trust.","zh":"谣言在社区里有害地扩散，破坏了信任。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a malicious, spiteful, or hurtfully negative manner (describing speech, attitudes, or actions).","zh":"以恶意、刻薄或伤人地方式（形容言语、态度或行为）。"},"examples":[{"en":"He spoke poisonfully about his coworker behind her back.","zh":"他在背后恶毒地议论同事。"},{"en":"The comments were poisonfully sarcastic and made the room tense.","zh":"那些评论带着伤人的讽刺，让气氛变得紧张。"}]}],"synonyms":["poisonously","toxically","venomously","maliciously","spitefully","bitterly"],"phonetic":"/ˈpɔɪzənfəli/","extraExplanation":["“poisonfully”在现代英语里非常少见；更常用、更自然的说法通常是“poisonously”（字面“有毒地”）或“venomously / maliciously / spitefully”（比喻“恶毒地”）。","构词上它是 poison + -ful + -ly（像“helpfully”那样），但在实际使用中，poison + -ous（poisonous → poisonously）这一组更固定、更常见。"]}
{"word":"poisoning","summary":{"en":"Poisoning is illness or harm caused by poison, or the act/case of giving poison.","zh":"Poisoning 指由毒物造成的伤害或疾病，也可指投毒行为/中毒事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making someone or something ill or dead by giving them a poison; also, a case of illness caused by poison (especially from food or chemicals)","zh":"投毒；中毒（使人或动物因毒物而生病或死亡的行为；也指由毒物引起的一次中毒事件，尤其常见于食物或化学品）"},"examples":[{"en":"Three people were hospitalized with food poisoning after the picnic.","zh":"野餐后有三个人因食物中毒住院。"},{"en":"The police investigated the suspected poisoning of the family’s dog.","zh":"警方调查了这家人狗疑似被投毒的案件。"},{"en":"Carbon monoxide poisoning can happen if a heater is used in a closed room.","zh":"在密闭房间里使用取暖器可能导致一氧化碳中毒。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of causing harmful or toxic effects in the body, or the state of being affected by poison","zh":"中毒过程；中毒状态（毒物对身体产生有害影响的过程或状态）"},"examples":[{"en":"Early treatment can prevent severe poisoning.","zh":"及早治疗可以防止严重中毒。"},{"en":"Symptoms of poisoning may include nausea, dizziness, or confusion.","zh":"中毒症状可能包括恶心、头晕或意识混乱。"}]}],"synonyms":["intoxication","toxicity","food poisoning","poisoning incident"],"phonetic":"/ˈpɔɪzənɪŋ/","extraExplanation":["“Food poisoning”最常见，通常指因细菌、病毒或受污染的食物引起的急性肠胃不适；如果是“poisoning case/incident”常用于新闻语境，强调“投毒/中毒事件”。","搭配很固定：suspected poisoning（疑似投毒/中毒）、accidental poisoning（意外中毒）、carbon monoxide poisoning（一氧化碳中毒）。注意区别：poison（毒药/使中毒）vs. toxin（毒素，常指生物产生）vs. contamination（污染）。"]}
{"word":"poisonings","summary":{"en":"“Poisonings” means multiple cases/incidents of poisoning, or the act of poisoning in general.","zh":"“poisonings”指多起中毒病例/事件，或泛指投毒（使人/动物中毒）的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cases or incidents in which someone is made ill or dies after swallowing, breathing in, or absorbing a poison (a harmful substance).","zh":"中毒事件；指人因吞下、吸入或接触/吸收毒物而生病甚至死亡的情况。"},"examples":[{"en":"There were several food poisonings after the picnic.","zh":"野餐后发生了几起食物中毒事件。"},{"en":"The hospital treated three poisonings caused by carbon monoxide.","zh":"医院救治了三起一氧化碳导致的中毒病例。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of making someone ill or causing death with poison.","zh":"下毒；使（人）中毒的行为或过程。"},"examples":[{"en":"The investigation focused on possible poisonings of local wildlife.","zh":"调查重点是当地野生动物可能遭到投毒。"},{"en":"The report warned that careless storage can lead to accidental poisonings in children.","zh":"报告警告说，存放不当会导致儿童意外中毒。"}]}],"synonyms":["poisoning cases","intoxications","toxicity incidents"],"phonetic":"/ˈpɔɪzənɪŋz/","extraExplanation":["“poisonings”是复数名词，来自单数“poisoning”。在新闻与公共卫生语境中很常见，如“food poisoning（食物中毒）”“carbon monoxide poisoning（一氧化碳中毒）”。","易混点：日常英语里“food poisoning”通常指一种疾病/状况；而“poisonings”更强调“多起事件/病例”。如果想表达“我食物中毒了”，更常说“I have food poisoning.”而不是用复数。"]}
{"word":"poisonless","summary":{"en":"“Poisonless” means “without poison; nonpoisonous,” but it’s uncommon in modern English.","zh":"“poisonless”意为“无毒的/不含毒物的”，但在现代英语中不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Free from poison; not containing poison; harmless to eat, touch, or use (rare; usually expressed as “nonpoisonous” or “poison-free”).","zh":"无毒的；不含毒物的；对食用、接触或使用而言是安全的（较少见的说法，常用 nonpoisonous / poison-free）。"},"examples":[{"en":"The label claims the cleaner is poisonless, but you should still keep it away from children.","zh":"标签称这款清洁剂“无毒”，但你仍应把它放在儿童接触不到的地方。"},{"en":"They looked for poisonless alternatives to pesticides in the garden.","zh":"他们在花园里寻找不含毒性的替代方案来代替农药。"}]}],"synonyms":["nonpoisonous","poison-free","nontoxic"],"phonetic":"/ˈpɔɪzənləs/","extraExplanation":["“poisonless”在现代英语里很少用，更自然的表达通常是“nonpoisonous”（不含毒/无毒的）或“poison-free”（无毒/不含毒物的，常见于商品标签）。","需要注意：商品宣传里的“poison-free/无毒”并不一定等于“完全无害”。很多清洁剂或化学品即使不被归类为“poison”，也可能刺激皮肤、眼睛或呼吸道。"]}
{"word":"poisonlessness","summary":{"en":"“Poisonlessness” means the quality of being nonpoisonous—having no poison or toxicity.","zh":"“Poisonlessness”指“无毒性/无害性”，强调没有毒或毒性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being nonpoisonous; lack of poison or toxicity (harmlessness)","zh":"无毒性；无毒的状态或性质（无害性）"},"examples":[{"en":"The lab report confirmed the poisonlessness of the new cleaning solution.","zh":"实验室报告证实了这种新清洁剂的无毒性。"},{"en":"Parents often look for products labeled for their poisonlessness around children and pets.","zh":"父母常常会寻找标注“无毒”的产品，以确保对孩子和宠物更安全。"}]}],"synonyms":["nontoxicity","non-toxicity","harmlessness","nonpoisonousness"],"phonetic":"/ˈpɔɪzənləsnəs/","extraExplanation":["“poisonlessness”是由 poison（毒）+ -less（无……的）+ -ness（……的性质/状态）构成，字面意思是“没有毒的性质”。在日常英语里更常见的说法是 non-toxicity / nontoxicity（无毒性）或 harmlessness（无害性）。","在正式语境（如化学、材料安全说明）中，通常也会用 nonpoisonous（无毒的）来表达同样意思；“poisonlessness”本身较少见，更多是为了强调“完全不含毒性/毒物”的概念。"]}
{"word":"poisonmaker","summary":{"en":"A poisonmaker is someone who makes or prepares poison.","zh":"poisonmaker 指“制作或配制毒药的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes or prepares poison, especially deliberately (for harming people or animals).","zh":"毒药制作者；配制毒药的人（尤指出于伤害人或动物的目的）。"},"examples":[{"en":"In the story, the poisonmaker sells deadly mixtures to criminals.","zh":"在故事里，那个毒药制作者把致命的混合毒剂卖给罪犯。"},{"en":"The detective traced the rare ingredients back to a skilled poisonmaker.","zh":"侦探把那些罕见成分追查到了一个手艺高超的毒药制作者身上。"}]}],"synonyms":["poisoner","toxicologist (not the same)","maker of poison"],"phonetic":"/ˈpɔɪzənˌmeɪkər/","extraExplanation":["“poisonmaker”是由 poison（毒药）+ maker（制作者）组成的合成词，在日常英语中不算常见。更常见的说法有 poisoner（下毒者，强调使用毒药的人）或 someone who makes poison（制作毒药的人）。","在奇幻、历史或侦探题材中，“poisonmaker”常用来塑造一种职业/角色类型（擅长配制毒剂的人），语气可能带有故事化、戏剧化色彩。"]}
{"word":"poisonous","summary":{"en":"Poisonous means ‘containing poison’ (dangerous to the body) and can also mean ‘deeply harmful’ in a social or emotional sense.","zh":"poisonous 表示“有毒的、对身体有害的”，也可引申为“（言行/关系等）有害的、带毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or producing poison; able to cause illness or death if eaten, touched, or taken into the body.","zh":"含有或产生毒素的；如果被吃下、接触或进入体内，可能导致生病甚至死亡的。"},"examples":[{"en":"Some mushrooms are poisonous, so don’t eat wild ones unless an expert checks them.","zh":"有些蘑菇有毒，所以除非请专家确认，否则不要吃野生蘑菇。"},{"en":"The label warns that the liquid is poisonous if swallowed.","zh":"标签警告说，这种液体如果吞下会有毒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Harmful in a moral or social way; creating hatred, fear, or conflict (often about words, gossip, or attitudes).","zh":"（道德或社会层面）有害的；会制造仇恨、恐惧或冲突的（常形容言语、流言或态度）。"},"examples":[{"en":"Poisonous rumors spread quickly and can damage someone’s reputation.","zh":"有毒的流言传播很快，会伤害一个人的名誉。"},{"en":"Their relationship became poisonous after months of constant arguing.","zh":"在几个月不停争吵后，他们的关系变得“有毒”。"}]}],"synonyms":["toxic","poison","harmful","deadly","noxious"],"phonetic":"/ˈpɔɪzənəs/","extraExplanation":["易混词：poisonous 通常指“有毒（有毒素本身）”，常用于蘑菇、蛇、化学品等；venomous 指“有毒液并通过咬/刺注入（带毒液的）”，如 venomous snake（毒蛇）、venomous spider（毒蜘蛛）。日常说“poisonous snake”也能被理解，但更精确是 venomous snake。","文学/修辞中，poisonous 常被用来比喻“像毒一样慢慢侵蚀”的事物，如 poisonous words（恶毒的话）、poisonous atmosphere（压抑/有害的氛围），强调伤害性和扩散性。"]}
{"word":"poisonously","summary":{"en":"“Poisonously” means either literally “in a poisonous/toxic way” or figuratively “in a bitter, harmful way,” especially about speech or attitude.","zh":"“poisonously”既可指“以有毒/含毒的方式”（字面），也可比喻指“恶毒地、刻薄地、伤害性很强地”（常用于言语或态度）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a poisonous way; containing or producing poison, or able to cause illness or death.","zh":"以有毒的方式；含有/产生毒素，或足以致病甚至致命。"},"examples":[{"en":"Some mushrooms are poisonously toxic even in small amounts.","zh":"有些蘑菇即使少量也毒性极强。"},{"en":"Poisonously contaminated water can make people seriously ill.","zh":"被毒性污染的水会让人严重生病。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a very hostile, bitter, or harmful way (about words, attitudes, or relationships).","zh":"（形容言语、态度或关系）恶毒地；刻薄地；带有强烈伤害性地。"},"examples":[{"en":"He spoke poisonously about his coworker.","zh":"他恶毒地谈论他的同事。"},{"en":"The conversation turned poisonously sarcastic.","zh":"谈话变得充满恶意的讽刺。"}]}],"synonyms":["toxically","venomously","maliciously","bitterly","spitefully"],"phonetic":"/ˈpɔɪzənəsli/","extraExplanation":["“poisonously”来自形容词“poisonous（有毒的）”，加副词后缀“-ly”。第一义偏字面（真正有毒），第二义常见于比喻（“像毒一样伤人”），多用来形容说话语气、评论或氛围。","搭配提示：poisonously + toxic/contaminated（字面），poisonously + sarcastic/critical/hostile（比喻）。注意它通常比“badly/negatively”更强烈，带“伤害性很大”的感觉。"]}
{"word":"poisonousness","summary":{"en":"Poisonousness means the quality of being poisonous, and it can also mean strong harmfulness in a figurative sense.","zh":"Poisonousness 指“有毒性/有毒的程度”，也可比喻指“强烈的伤害性、破坏性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being poisonous; how harmful something is if it is eaten, touched, or breathed in.","zh":"有毒性；有毒的状态或程度（指吃下、接触或吸入后对人体/动物的伤害性）。"},"examples":[{"en":"Scientists tested the poisonousness of the plant before allowing it to be used in medicine.","zh":"科学家在允许这种植物用于药物之前，先检测了它的毒性。"},{"en":"The label warns about the poisonousness of the chemical and how to store it safely.","zh":"标签警告这种化学品的毒性以及如何安全存放。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The quality of being very harmful or damaging, especially in speech, ideas, or relationships.","zh":"（比喻）伤害性很强、破坏性很大（尤指言论、观念或人际关系）。"},"examples":[{"en":"The poisonousness of online rumors can destroy trust in a community.","zh":"网络谣言的“毒性”会摧毁社区中的信任。"},{"en":"They tried to reduce the poisonousness of the debate by speaking more respectfully.","zh":"他们试图用更尊重的方式发言，以降低辩论的“毒性”。"}]}],"synonyms":["toxicity","virulence","harmfulness","noxiousness"],"phonetic":"/ˈpɔɪzənəsnəs/","extraExplanation":["“poisonousness”来自形容词 poisonous（有毒的）+ 名词后缀 -ness（……的性质/状态）。在日常英语中，这个词偏正式、学术或报告用语；口语里更常说 toxicity（毒性）或 poisonous nature（有毒的特性）。","辨析：poisonous 通常指“本身有毒”（如 poisonous mushroom 有毒蘑菇）；venomous 指“通过咬/刺注入毒液”（如 venomous snake 毒蛇）。因此更常见的搭配是 “the toxicity of…” 或 “the poisonousness of a substance/plant”。"]}
{"word":"poisonproof","summary":{"en":"Poisonproof means resistant to poison or designed to prevent poisoning.","zh":"poisonproof 指“抗毒的”或“具防投毒设计的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to poison; not harmed by poison (or unlikely to be poisoned).","zh":"防毒的；抗毒的；不易被毒害的。"},"examples":[{"en":"The snake is largely poisonproof, so its own venom won’t harm it.","zh":"这种蛇在很大程度上具有抗毒性，所以它自己的毒液通常不会伤到它。"},{"en":"No glove is truly poisonproof, so always follow safety instructions.","zh":"没有任何手套能做到完全“防毒”，所以一定要遵守安全操作说明。"}]},{"partOfSpeech":"adj.","definition":{"en":"Protected against poisoning by design (e.g., a container, package, or process meant to prevent poison from getting in).","zh":"防止被投毒的；具防投毒保护设计的（如容器、包装或流程）。"},"examples":[{"en":"They sealed the medicine in a poisonproof container.","zh":"他们把药品密封在一个防投毒的容器里。"},{"en":"The lab adopted poisonproof procedures for handling chemicals.","zh":"实验室采用了防投毒的操作流程来处理化学品。"}]}],"synonyms":["poison-resistant","immune (to poison)","protected","tamper-proof (related, for anti-poisoning design)"],"phonetic":"/ˈpɔɪzənˌpruːf/","extraExplanation":["“poisonproof”由 poison（毒）+ -proof（防……的/耐……的）构成，类似的还有 waterproof（防水的）、fireproof（防火的）。在现实语境中常用于强调“高度抵抗/防护”，但并不一定意味着“绝对不受影响”。"]}
{"word":"poisons","summary":{"en":"“Poisons” usually means toxic substances; it can also be the verb form meaning “to poison,” literally or figuratively.","zh":"“Poisons”通常指“毒物/毒药”；也可作动词形式，表示“下毒”或（比喻）“毒害、败坏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Toxic substances that can cause illness or death if swallowed, breathed in, or absorbed.","zh":"毒物；毒药（会使人生病甚至致死的物质，可经吞咽、吸入或皮肤吸收进入体内）"},"examples":[{"en":"Keep poisons away from children and pets.","zh":"把毒物放在儿童和宠物够不到的地方。"},{"en":"The label warns that these poisons are dangerous even in small amounts.","zh":"标签警告说，这些毒物即使少量也很危险。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “poison”: to put a harmful substance into something, especially food or drink, to harm someone or something.","zh":"“poison”的第三人称单数：下毒；在食物或饮料中投放有害物质以伤害某人/某物"},"examples":[{"en":"Someone poisons the bait to kill the animals.","zh":"有人在诱饵里下毒来杀死动物。"},{"en":"He poisons the water supply, and people get sick.","zh":"他把供水系统下了毒，人们因此生病。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) To ruin or negatively influence a situation, relationship, or someone’s thoughts.","zh":"（比喻）毒害；败坏；使（局面/关系/想法）变糟或变得偏激"},"examples":[{"en":"Lies can poison trust in a relationship.","zh":"谎言会毒害一段关系中的信任。"},{"en":"Online rumors poison public opinion.","zh":"网络谣言会毒害舆论。"}]}],"synonyms":["toxins","venoms","toxic substances","contaminants","poison","contaminate","taint","corrupt"],"phonetic":"/ˈpɔɪzənz/","extraExplanation":["“poison”既可指真实的“毒药”，也常用作比喻，表示“让事情变坏/让人思想受影响”。常见表达：\n- poison the well：先散布偏见或负面信息，使后续讨论难以公正进行\n- a poisonous atmosphere/relationship：有毒的氛围/关系（充满敌意、伤害）"]}
{"word":"poisonweed","summary":{"en":"“Poisonweed” means a poisonous wild plant/weed (informal), often one that can cause irritation or harm.","zh":"“Poisonweed”指有毒的野草/杂草（较口语/非正式），常指会刺激皮肤或造成伤害的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A poisonous wild plant, especially one that can irritate skin or harm people/animals if touched or eaten.","zh":"（非正式）有毒的野草/野生植物，尤指接触会刺激皮肤或误食会伤害人或动物的植物。"},"examples":[{"en":"The hikers learned to avoid poisonweed along the trail because it can cause a rash.","zh":"徒步者学会避开小路旁的“poisonweed”，因为它可能引起皮疹。"},{"en":"Keep the dog away from the poisonweed in the backyard.","zh":"别让狗靠近后院里的有毒杂草。"}]}],"synonyms":["poisonous weed","toxic plant","noxious weed","poison plant"],"phonetic":"/ˈpɔɪzənˌwid/","extraExplanation":["“poisonweed”并不是非常标准或常见的词，更常见的写法是分开写“poison weed”，或直接说具体植物名（如“poison ivy”（毒葛）、“poison oak”（毒橡）等）。在不同地区，“poisonweed”可能泛指任何会引发过敏/中毒的杂草。","如果你想表达“会让人皮肤发痒起疹子的那种植物”，英语里最常用的通常是“poison ivy”。"]}
{"word":"poisonwood","summary":{"en":"Poisonwood usually means a poisonous/irritating tree (a general name), and it can also refer to the novel The Poisonwood Bible.","zh":"poisonwood通常指“有毒/致敏的树”（一种泛称），也可指小说《毒木圣经》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree or shrub whose wood, sap, or leaves are poisonous or irritating to humans (used as a general name for several plants).","zh":"毒木；指木材、汁液或叶子对人有毒或会引起刺激的树或灌木（可泛指多种植物）。"},"examples":[{"en":"Be careful not to touch the poisonwood—its sap can cause a painful rash.","zh":"小心别碰到毒木——它的汁液可能会引起疼痛的皮疹。"},{"en":"The guide warned us to avoid poisonwood along the trail.","zh":"向导提醒我们沿路要避开毒木。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary title) a reference to The Poisonwood Bible, a novel by Barbara Kingsolver (1998).","zh":"（文学作品名）指芭芭拉·金索尔弗（Barbara Kingsolver）1998年的小说《毒木圣经》。"},"examples":[{"en":"I read The Poisonwood Bible for a book club discussion.","zh":"我为了读书会的讨论读了《毒木圣经》。"},{"en":"In The Poisonwood Bible, the title hints at how language and culture can “sting” when misunderstood.","zh":"在《毒木圣经》中，书名暗示当语言与文化被误解时，会像“毒”一样伤人。"}]}],"synonyms":["poison tree","toxic tree","irritant plant"],"phonetic":"/ˈpɔɪzənˌwʊd/","extraExplanation":["“poisonwood”不是一个指单一物种的严格学名，更像是俗称；在不同地区可能指不同的“有毒/致敏的树”。如果你是在某个国家公园、海岛或热带地区看到这个词，最好结合当地告示或植物名来确认具体是哪一种。","《毒木圣经》的书名带有象征意义：既可指自然界会引发皮疹的毒性植物，也可引申为文化误读、权力关系与语言伤害等主题。"]}
{"word":"poissarde","summary":{"en":"Poissarde is a rare, literary word meaning a fish-selling woman (fishwife) or, by extension, a loud/coarse style associated with that stereotype.","zh":"poissarde 是较少见的文学用词，指“卖鱼妇（鱼贩女性）”，也可引申为带“吵闹、粗俗、市井口吻”的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fishwife; a woman who sells fish (often stereotyped as loud or coarse in older literature)","zh":"卖鱼妇；（旧时文学中常带刻板印象）吵闹或粗俗的妇人"},"examples":[{"en":"In the old novel, a poissarde shouts prices across the market.","zh":"在那部老小说里，一个卖鱼妇在市场里高声叫卖。"},{"en":"He described her insults as “poissarde language,” meaning rough street talk.","zh":"他把她的辱骂称为“卖鱼妇式的语言”，意思是粗鲁的市井话。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary) resembling a fishwife—loud, rough, or streetwise in tone","zh":"（文学用法）像卖鱼妇般的；吵闹的、粗俗的、带市井口吻的"},"examples":[{"en":"The playwright gives the character a poissarde wit that fills the scene with noise.","zh":"剧作家让这个角色带着“卖鱼妇式”的机智与喧闹，使场面格外热闹。"},{"en":"Her poissarde humor shocked the polite dinner guests.","zh":"她那种市井粗口式的幽默让席间的体面客人很震惊。"}]}],"synonyms":["fishwife","fishmonger (female)","market woman","coarse","raucous"],"phonetic":"/pwɑˈzɑrd/","extraExplanation":["这个词来自法语 poissarde，源于 poisson（鱼）。在18—19世纪的欧洲文学与戏剧中常见，用来指巴黎鱼市女性商贩，也常被用作带偏见的社会刻板印象（“吵、粗、爱骂人”）。现代英语里较少日常使用，多见于文学、历史或风格描写。","在阅读古典作品时，如果看到 poissarde language / tone，一般不是“和鱼有关的语言”，而是指“粗俗、泼辣、街头叫骂式”的说话风格。"]}
{"word":"poisson","summary":{"en":"“Poisson” is French for “fish,” and in English it also refers to the Poisson distribution/process in math.","zh":"“poisson”在法语中是“鱼”，在英语里也常指数学中的“泊松分布/泊松过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fish (common on signs for restaurants or markets), from French.","zh":"鱼（常见于餐馆或鱼市招牌上的法语词）。"},"examples":[{"en":"The menu says “poisson du jour,” which means fish of the day.","zh":"菜单上写着“poisson du jour”，意思是“今日鲜鱼/当日推荐鱼”。"},{"en":"In some cities you might see “poissonnerie,” a shop that sells fish.","zh":"在一些城市你可能会看到“poissonnerie”，指“鱼店/海鲜鱼铺”。"}]},{"partOfSpeech":"adj.","definition":{"en":"In mathematics, describing probability models for counts of events in a fixed time or space (Poisson).","zh":"在数学中，用来描述在固定时间或空间内“事件发生次数”的概率模型（泊松）。"},"examples":[{"en":"A Poisson distribution can model the number of emails you receive in an hour.","zh":"泊松分布可以用来建模你一小时内收到的邮件数量。"},{"en":"They used a Poisson process to estimate how often buses arrive.","zh":"他们用泊松过程来估计公交车到站的频率。"}]}],"synonyms":["fish","Poisson distribution","Poisson process"],"phonetic":"/ˈpwɑːsɑːn/","extraExplanation":["英语里“Poisson”常见于两个场景：一是法语借词（尤其在菜单上），二是数学/统计学里的“泊松”（源自法国数学家 Siméon Denis Poisson 的姓氏）。日常英语里说“鱼”通常直接用 fish，而不是 poisson。"]}
{"word":"poister","summary":{"en":"“Poister” is not standard English; it’s usually a misspelling (often “poster” or “poised”).","zh":"“poister”不是标准英语词，通常是拼写错误（常见为“poster”或“poised”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Poister” is most often a misspelling or typo of another word (commonly “poster” or “poised”).","zh":"不是标准英语单词。“poister”多半是拼写错误，常见可能想写的是“poster（海报）”或“poised（镇定的/准备好的）”。"},"examples":[{"en":"I couldn’t find “poister” in a dictionary—did you mean “poster”?","zh":"我在词典里找不到“poister”——你是不是想写“poster（海报）”？ "},{"en":"If you meant “poised,” you could write: “She stayed poised during the interview.”","zh":"如果你想表达“poised”，可以写：“She stayed poised during the interview.”（她在面试中保持镇定。）"}]}],"synonyms":["poster","poised","boisterous"],"phonetic":"/ˈpɔɪstər/","extraExplanation":["如果你能告诉我：你是在哪个句子/语境里看到“poister”的，或你想表达的中文意思，我可以帮你精准判断你要的词。常见可能性：\n1) poster /ˈpoʊstər/（海报；发帖者）\n2) poised /pɔɪzd/（镇定的；蓄势待发的）\n3) boisterous /ˈbɔɪstərəs/（喧闹的；爱起哄的）——有时也会被误拼。"]}
{"word":"poisure","summary":{"en":"“Poisure” is not a standard English word; it’s usually a misspelling of “poise” (calm confidence/elegant manner) or “composure.”","zh":"“poisure”不是标准英文单词；通常是把“poise”（沉着自信/优雅仪态）或“composure”（镇定）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “poise” (calm confidence) or “composure.”","zh":"非标准拼写；通常是把“poise”（沉着、自信的仪态）或“composure”（镇定）拼错了。"},"examples":[{"en":"I think you mean “poise,” not “poisure.”","zh":"我想你要写的是“poise”，不是“poisure”。"},{"en":"She answered the tough question with poise.","zh":"她沉着冷静地回答了那个棘手的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you mean “poise”) calm, self-controlled confidence, especially in a difficult situation; also an elegant way of carrying yourself.","zh":"（如果你想写“poise”）沉着、自控的自信（尤指在困难情境下）；也指优雅的仪态。"},"examples":[{"en":"He handled the criticism with poise.","zh":"他以沉着的态度面对批评。"},{"en":"The dancer moved with poise and grace.","zh":"那位舞者动作优雅、仪态从容。"},{"en":"Try to keep your poise during the interview.","zh":"面试时尽量保持镇定从容。"}]},{"partOfSpeech":"v.","definition":{"en":"(If you mean “poise”) to balance or hold something in a steady position; to be ready to act.","zh":"（如果你想写“poise”）使……保持平衡/稳住；蓄势待发、准备行动。"},"examples":[{"en":"She poised the glass on the edge of the table.","zh":"她把玻璃杯稳稳地放在桌边。"},{"en":"The cat was poised to jump.","zh":"那只猫蓄势待发，准备跳。"}]}],"synonyms":["composure","self-possession","calmness","assurance","balance"],"phonetic":"/pɔɪz/","extraExplanation":["“poise”常出现在写人物气质的语境里，带有“在压力下依然镇定体面”的含义。搭配很常见：with poise（沉着地）、keep/maintain your poise（保持镇定）、poised to do sth（准备做某事）。","如果你原本想表达“镇定/冷静”，也可以用composure（更偏情绪控制）、calmness（更日常）。"]}
{"word":"Poitiers","summary":{"en":"Poitiers is a historic city in western France; in history, it can also mean the Battle of Poitiers (especially 1356, sometimes 732).","zh":"Poitiers（普瓦捷）是法国西部的历史名城；在历史语境中也可指“普瓦捷战役”（多指1356年，有时指732年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in western France (in the Nouvelle-Aquitaine region), known for its historic churches and medieval center; it is also famous in history for major battles fought nearby.","zh":"法国西部的一座城市（新阿基坦大区），以历史悠久的教堂和中世纪古城闻名；在历史上也因附近发生过重要战役而广为人知。"},"examples":[{"en":"Poitiers is a university city with a long history.","zh":"普瓦捷是一座历史悠久的大学城。"},{"en":"Many travelers visit Poitiers for its Romanesque architecture.","zh":"许多游客因其罗曼式建筑而造访普瓦捷。"},{"en":"The area around Poitiers is known for two famous battles in European history.","zh":"普瓦捷周边因欧洲历史上两场著名战役而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) used to refer to the Battle of Poitiers—most commonly the 1356 battle in the Hundred Years’ War (England vs. France); sometimes it can also refer to the 732 battle (Franks vs. Umayyads) often called the Battle of Tours/Poitiers.","zh":"（历史）“普瓦捷战役”的简称——最常指1356年英法百年战争中的那场战役；有时也指公元732年法兰克人与倭马亚军队的战役（常称“图尔/普瓦捷战役”）。"},"examples":[{"en":"In 1356, the English won a major victory at Poitiers.","zh":"1356年，英格兰在普瓦捷取得一场重大胜利。"},{"en":"Some textbooks mention ‘Tours/Poitiers (732)’ when discussing early medieval Europe.","zh":"一些教材在讨论中世纪早期欧洲时会提到“图尔/普瓦捷（732年）”。"}]}],"synonyms":["a city in western France","the Battle of Poitiers"],"phonetic":"/pwɑːˈtjeɪ/","extraExplanation":["“Poitiers”的英语读法和法语原音差别较大：英语里常读作 /pwɑːˈtjeɪ/（也会听到其他变体），法语中更接近“普瓦-蒂耶”的连读音。","1356年的“普瓦捷战役”发生在百年战争期间，英军在黑太子（Edward the Black Prince）指挥下获胜并俘虏法王约翰二世（John II of France）。","732年的战役在不同语言/史书中命名不一：有的叫“图尔战役（Battle of Tours）”，有的叫“图尔/普瓦捷战役（Battle of Tours/Poitiers）”，因此阅读史料时要注意指的是哪一场。"]}
{"word":"poitrail","summary":{"en":"A poitrail is a breast strap/collar on a horse’s harness, across the chest.","zh":"poitrail 指马具中横在马胸前的胸带/胸挽具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strap or padded piece of a horse’s harness that goes across the chest (breast collar), helping hold the harness in place or helping the horse pull a vehicle","zh":"马具中横在马胸前的一条带子或垫片（胸带/胸挽具），用来固定马具或帮助马拉车"},"examples":[{"en":"The driver checked the poitrail to make sure it wasn’t rubbing the horse’s chest.","zh":"车夫检查了胸带，确保它没有磨到马的胸口。"},{"en":"A well-fitted poitrail helps keep the harness steady when the horse pulls a cart.","zh":"合身的胸带能在马拉车时让马具更稳。"}]}],"synonyms":["breast collar","breaststrap","breastplate (sometimes)"],"phonetic":"/ˈpɔɪtreɪl/","extraExplanation":["“poitrail”是较少见、偏传统马术/马车用语的词，来源于法语“poitrail”（与“poitrine”胸部同源）。现代英语里更常用“breast collar”来表达同一部件。","在不同马具系统中，胸前这条部件的设计可能不同：有的主要用于固定和稳定，有的也与牵引受力有关；具体名称会因地区与马具类型而变化。"]}
{"word":"poitrel","summary":{"en":"Poitrel is a (usually historical) term for a horse’s chest strap or breastplate that helps secure the saddle or harness.","zh":"Poitrel 指马胸前的胸带或胸甲（多用于历史语境），用于固定鞍具或马具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strap or piece of harness (or armor) that goes across a horse’s chest to hold the saddle or other gear in place; a horse’s breastplate","zh":"（马具或马铠的一部分）系在马胸前的胸带/胸甲，用来固定鞍具或其他装备"},"examples":[{"en":"The poitrel kept the saddle from sliding back on the steep climb.","zh":"在陡坡上行进时，胸带防止鞍具向后滑动。"},{"en":"In medieval illustrations, the knight’s horse sometimes wears a metal poitrel.","zh":"在中世纪插图中，骑士的坐骑有时会佩戴金属胸甲。"}]}],"synonyms":["breastplate","breast collar","breast strap","chest strap"],"phonetic":"/ˈpɔɪtrəl/","extraExplanation":["“poitrel”是较少见的词，多见于历史/文学语境（如骑士、马铠、传统马具）。更常见、现代的说法是“breastplate”（胸甲）或“breast collar / breast strap”（胸带）。","词源来自法语“poitrail”（胸部），与表示“胸口/胸腔”的词有关。"]}
{"word":"poitrels","summary":{"en":"Poitrels are chest pieces on a horse’s harness or armor, especially in medieval contexts.","zh":"Poitrels 指马胸前的挽具或护甲部件，常见于中世纪语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the front part of a horse’s harness or armor that covers or protects the chest (plural of poitrel)","zh":"马胸前的挽具或护甲部件（保护马胸部；poitrel 的复数）"},"examples":[{"en":"The knight’s horse wore poitrels to protect its chest in battle.","zh":"骑士的战马穿戴了胸甲（poitrels），以在战斗中保护胸部。"},{"en":"In the museum display, the poitrels are shown beside the saddle and bridle.","zh":"在博物馆展柜里，马胸甲（poitrels）与马鞍和马笼头一起陈列。"}]},{"partOfSpeech":"n.","definition":{"en":"(heraldry) a pair of horse chest-pieces shown as a charge or design element","zh":"（纹章学）作为纹章图案元素出现的一对马胸甲图形"},"examples":[{"en":"The family crest includes poitrels as a symbol of cavalry tradition.","zh":"这个家族的纹章包含马胸甲（poitrels），象征骑兵传统。"}]}],"synonyms":["horse breastplate","chest strap","breast collar"],"phonetic":"/ˈpɔɪtrəlz/","extraExplanation":["“poitrels”是一个较罕见、偏中古/骑士文学语境的词，常见于描写中世纪骑士、马具与战马护甲的文本中。","词源与法语有关：法语 *poitrail* 意为“胸部”，引申为覆盖马胸口的护具/挽具部件。阅读奇幻或历史小说时遇到它，通常可以理解为“战马胸前的护甲/胸带”。"]}
{"word":"poitrinaire","summary":{"en":"Poitrinaire is a rare, literary adjective meaning “chest-related” or “weak/diseased in the chest,” often in old descriptions of tuberculosis.","zh":"Poitrinaire 是一个罕见的文学性形容词，意思是“与胸部有关”或“胸部虚弱/患胸疾”，旧文中常与肺结核（痨病）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) Relating to the chest; having a weak or diseased chest (especially from tuberculosis, old-fashioned).","zh":"（罕见/文学用语）与胸部有关的；胸部虚弱或患胸部疾病的（尤指旧时对肺结核/痨病的说法）。"},"examples":[{"en":"In the novel, the doctor describes him as poitrinaire and warns him to avoid cold air.","zh":"在小说里，医生说他“poitrinaire”（胸弱/患胸疾），并警告他避免冷空气。"},{"en":"Her poitrinaire cough kept her from speaking for long.","zh":"她那种胸疾般的咳嗽让她无法久讲。"}]}],"synonyms":["chest-related","frail-chested","consumptive (old-fashioned)"],"phonetic":"/ˌpwɑːtrɪˈnɛr/","extraExplanation":["这个词来自法语 *poitrine*（胸膛）+ 形容词后缀，英语中非常少见，多见于19世纪或带法式风格的文学/描写性文字。现代英语更常用 **chest-related**（与胸部有关的）、**frail-chested**（胸弱的）、或直接说 **tubercular / having tuberculosis**（患肺结核的，语境需谨慎且避免污名化）。","注意拼写：你写的 **poitrinaire** 有时会被当作法语借词使用；在英文词典里并不常见，阅读时可把它理解为“胸部/肺部相关、胸弱”的文学性表达。"]}
{"word":"poivrade","summary":{"en":"Poivrade is a French-style peppery brown sauce, often served with game or roasted meats; it can also describe dishes flavored with that sauce.","zh":"Poivrade 指法式胡椒味浓的棕色酱汁，常配野味或烤肉；也可形容加入该酱汁风味的菜肴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in French cooking) a peppery brown sauce, usually made with stock, wine or vinegar, and aromatics; often served with game or roasted meats.","zh":"（法式烹饪）胡椒味浓的棕色酱汁，通常用高汤、葡萄酒或醋加香料熬制；常配野味或烤肉。"},"examples":[{"en":"The chef served venison with poivrade to highlight its rich flavor.","zh":"主厨用胡椒酱汁（poivrade）搭配鹿肉，以突出其浓郁风味。"},{"en":"If you like pepper, try a poivrade sauce instead of gravy.","zh":"如果你喜欢胡椒味，可以用 poivrade 酱汁代替肉汁。"}]},{"partOfSpeech":"adj.","definition":{"en":"Flavored or served with poivrade sauce; peppery in a French-style way.","zh":"带有 poivrade 酱汁风味的；以法式胡椒酱汁调味/佐食的。"},"examples":[{"en":"We ordered the poivrade rabbit dish from the French menu.","zh":"我们从法式菜单点了那道配胡椒酱汁的兔肉。"}]}],"synonyms":["pepper sauce","sauce poivrade","French pepper sauce"],"phonetic":"/ˌpwɑˈvrɑːd/","extraExplanation":["“Poivrade”来自法语，词根与“poivre（胡椒）”相关，核心特点是明显的胡椒辛香与偏深色的肉汁风格。","在法餐语境里，它常与野味（如鹿、野猪）或较浓郁的肉类搭配，用酸度（酒/醋）和香料来平衡肉味。"]}

