{"word":"pokable","summary":{"en":"“Pokable” (more commonly “pokeable”) means “able to be poked,” and it’s informal/uncommon.","zh":"“Pokable”（更常见写法为“pokeable”）意思是“可以被戳的”，属非正式且不太常见的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be poked (with a finger or something pointed); pokeable. (Uncommon, informal.)","zh":"可以被戳的；适合戳一下的。（不常见，非正式）"},"examples":[{"en":"The bubble wrap is very pokable—I can’t stop pressing the bubbles.","zh":"这层气泡膜太“戳得动”了——我忍不住一直按爆气泡。"},{"en":"Be gentle; the bruise is pokable but it will hurt.","zh":"轻一点；那块淤青虽然能碰/戳到，但会疼。"},{"en":"This screen isn’t pokable, so use the buttons instead.","zh":"这个屏幕不能用手戳着操作，所以请改用按键。"}]}],"synonyms":["pokeable","touchable","pressable"],"phonetic":"/ˈpoʊkəbəl/","extraExplanation":["“pokable”不是非常标准或常见的词，更常见的写法是“pokeable”。它由动词“poke（戳、捅、轻推）”加后缀“-able（能够……的）”构成，意思就是“能够被戳/适合戳”。","在网络语境里，“poke”还可能指社交平台上的“poke/戳一下”（例如早期 Facebook 的“Poke”功能）。因此“pokable”有时也会带一点玩笑或口语色彩。"]}
{"word":"pokan","summary":{"en":"“Pokan” is a Japanese pop-culture loanword meaning a blank, stunned expression.","zh":"“pokan”是来自日语的流行文化用语，表示一脸懵、愣住的表情。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Loanword from Japanese, mainly seen in anime/manga fandom) A blank, dazed, or stunned look—like your mind “goes empty” from surprise or confusion.","zh":"（日语外来词，多见于动漫/漫画语境）指“愣住、发呆、脑袋空白”的表情或状态，常因惊讶或困惑而出现。"},"examples":[{"en":"When he heard the twist, he just went “pokan” for a second.","zh":"听到反转剧情时，他一下子就“愣住了”。"},{"en":"Her face turned pokan after the teacher called her name unexpectedly.","zh":"老师突然点名后，她的表情立刻变得一脸懵。"}]}],"synonyms":["stunned","blank-faced","speechless","dumbfounded","dazed"],"phonetic":"/poʊˈkɑn/","extraExplanation":["“pokan（ポカン）”在日语里常用来描写“张着嘴发呆、惊到说不出话”的样子。英语里并不是常规词汇，更多出现在字幕组翻译、二创、同人或口语玩梗中。正式写作里更建议用：stunned, blank-faced, speechless, dumbfounded 等。"]}
{"word":"pokanoket","summary":{"en":"Pokanoket refers to a Wampanoag Native American group (and sometimes their homeland) in the Mount Hope area of present-day Rhode Island and southeastern Massachusetts.","zh":"Pokanoket 指万帕诺亚格人的一个原住民部族（有时也指其传统领地），主要在今罗得岛与马萨诸塞州东南部的芒特霍普地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people (a band of the Wampanoag) historically based around Mount Hope, in what is now Rhode Island and southeastern Massachusetts; also used for their homeland/territory","zh":"波卡诺基特人（万帕诺亚格人的一个部族），历史上居住在今罗得岛与马萨诸塞州东南部的芒特霍普一带；也可指其传统领地"},"examples":[{"en":"The Pokanoket were part of the larger Wampanoag Confederacy.","zh":"波卡诺基特人是更大范围的万帕诺亚格联盟的一部分。"},{"en":"Some local histories describe Mount Hope as a central place in Pokanoket life.","zh":"一些地方史记载称，芒特霍普在波卡诺基特人的生活中是重要中心。"}]}],"synonyms":["Wampanoag (broader group)"],"phonetic":"/ˌpoʊkəˈnɑːkɪt/","extraExplanation":["“Pokanoket”常见于美国新英格兰地区的历史与地名语境，尤其与万帕诺亚格人及其领袖梅塔科姆（Metacom，英语史料中常称“King Philip”）相关；提到17世纪的“菲利普国王战争（King Philip’s War）”时也会出现该名称。","拼写提示：你输入的“pokanoket”通常应大写为“Pokanoket”。如果你本来想查的是别的词（例如“pocket”），告诉我句子语境我可以帮你确认。"]}
{"word":"poke","summary":{"en":"“Poke” most commonly means to touch or push quickly with a finger or pointed object; it can also mean to make/stick through a hole, tease someone, or the noun for a quick jab.","zh":"“poke”最常指用手指或尖物快速戳/捅一下；也可指戳出洞/伸出，或（口语）取笑；名词表示“戳一下”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to push or touch someone or something quickly with your finger or a pointed object, often to get attention or test something","zh":"用手指或尖物快速戳/捅某人或某物，常用于引起注意或试探"},"examples":[{"en":"He poked me in the shoulder to get my attention.","zh":"他戳了戳我的肩膀来引起我的注意。"},{"en":"She poked the cake with a toothpick to see if it was done.","zh":"她用牙签戳蛋糕，看看熟了没有。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a small hole in something or to stick out through something","zh":"戳出小洞；（从某物中）伸出/露出"},"examples":[{"en":"A branch poked through the fence.","zh":"一根树枝从栅栏里伸了出来。"},{"en":"Be careful not to poke a hole in the balloon.","zh":"小心别把气球戳破。"}]},{"partOfSpeech":"v.","definition":{"en":"to make fun of someone or criticize them in a teasing way (often used with \"at\")","zh":"取笑；挖苦（常与 at 连用）"},"examples":[{"en":"Stop poking at him—he’s trying his best.","zh":"别再取笑他了——他已经尽力了。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick push or jab with a finger or a pointed object","zh":"戳一下；捅一下"},"examples":[{"en":"Give it a poke and see if it moves.","zh":"戳一下看看它会不会动。"}]}],"synonyms":["prod","jab","nudge","prick","tease"],"phonetic":"/poʊk/","extraExplanation":["“poke”在口语里很常见，语气通常比“stab（刺）”“jab（猛戳）”更轻、更随意，多用于“轻轻戳一下”或“试探一下”。如果动作很用力或带攻击性，英语更可能用“stab/jab”。","常见搭配：poke someone (in the arm/shoulder)；poke a hole in something；poke through/out；poke at someone（带点挑逗或取笑意味）；poke around（到处翻找/闲逛打探）。","文化/语境提示：在一些场合（比如和不熟的人、正式环境）用手指去“poke”别人可能显得不礼貌；更自然的做法是轻拍（tap）或直接叫对方。"]}
{"word":"pokeberries","summary":{"en":"Pokeberries are the dark purple berries of pokeweed; they can stain things purple but are poisonous to eat.","zh":"Pokeberries 指商陆的深紫色浆果；会把东西染紫，但不可食用、有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the dark purple berries of the pokeweed plant, especially when talked about as a group; they are often used to describe a deep purple color but are poisonous if eaten","zh":"商陆（pokeweed）结的深紫色浆果（常作复数）；常被用来形容深紫色，但误食有毒"},"examples":[{"en":"The child’s fingers were stained purple from pokeberries.","zh":"孩子的手指被商陆浆果染成了紫色。"},{"en":"In late summer, pokeberries hang in clusters along the roadside.","zh":"夏末时，路边一串串的商陆浆果挂在枝头。"},{"en":"The novel describes a “pokeberry” purple sunset over the fields.","zh":"小说描写田野上方“商陆紫”的落日余晖。"}]}],"synonyms":["pokeweed berries","berries of pokeweed"],"phonetic":"/ˈpoʊkˌbɛriz/","extraExplanation":["“Pokeberries”来自植物“pokeweed”（美洲商陆，Phytolacca americana）。在美国乡村与文学作品里，它常作为季节与乡野景象的意象，也常被用来指一种浓重的紫色染痕。","需要注意：商陆的果实、根等部位含有毒性成分，不建议食用；民间偶有用其汁液作天然染料，但接触或误食都应谨慎。"]}
{"word":"pokeberry","summary":{"en":"Pokeberry is the dark purple, poisonous berry of the pokeweed plant.","zh":"Pokeberry 指美洲商陆的深紫色有毒浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A poisonous dark-purple berry from the pokeweed plant (Phytolacca americana), sometimes used to make natural dye or (with careful preparation) in traditional cooking.","zh":"美洲商陆（pokeweed）的深紫色有毒浆果；有时用于天然染料，或在传统料理中（需非常谨慎处理）使用。"},"examples":[{"en":"The birds ate the pokeberries and spread the seeds across the field.","zh":"鸟儿吃了商陆莓，并把种子传播到田野各处。"},{"en":"Her grandmother warned her never to taste pokeberries because they can make you very sick.","zh":"她奶奶警告她绝对不要尝商陆莓，因为可能会让人严重不适。"},{"en":"Artists once used pokeberry juice to tint fabric and paper a reddish purple.","zh":"过去有艺术家用商陆莓汁把布料和纸张染成红紫色。"}]}],"synonyms":["pokeweed berry","pokeweed (context-dependent)"],"phonetic":"/ˈpoʊkˌbɛri/","extraExplanation":["“pokeberry”通常指美洲商陆（pokeweed）的果实，常见于美国东部和南部。整株植物（尤其是根和未成熟果实）含有毒性成分；民间偶尔会把嫩叶反复焯水后做成“poke sallet”，但浆果并不建议食用。","在美国南方文化语境里，pokeweed/pokeberry常出现在乡村记忆、民谣与自然描写中：一方面是“野生、顽强”的象征，另一方面也提醒人们分辨可食与有毒植物。"]}
{"word":"poked","summary":{"en":"“Poked” is the past form of “poke,” meaning to jab/touch quickly, to stick out/appear partly, or to tease (as in “poke fun at”).","zh":"“poked”是“poke”的过去式/过去分词：可表示戳/捅、（部分）探出/露出，或（poke fun at）调侃取笑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense and past participle of “poke”: to push or touch someone or something quickly with a finger or a pointed object.","zh":"“poke”的过去式/过去分词：用手指或尖物快速戳、捅（某人或某物）。"},"examples":[{"en":"She poked me in the arm to get my attention.","zh":"她戳了戳我的胳膊来引起我的注意。"},{"en":"He poked a hole in the paper with a pencil.","zh":"他用铅笔在纸上戳了一个洞。"},{"en":"The dog poked its nose through the fence.","zh":"那只狗把鼻子从篱笆缝里探出来。"}]},{"partOfSpeech":"vi.","definition":{"en":"To move into or appear from somewhere slowly or partly (often used with “out,” “through,” etc.).","zh":"（常与 out/through 等连用）慢慢伸出、探出；露出一部分。"},"examples":[{"en":"A few gray hairs poked out from under his cap.","zh":"他的帽子下面露出了几根白头发。"},{"en":"The sun poked through the clouds for a moment.","zh":"太阳从云层里短暂地露了一下。"}]},{"partOfSpeech":"vt.","definition":{"en":"To tease or criticize in a light, joking way (often in “poke fun at”).","zh":"（常见于 poke fun at）以开玩笑的方式取笑、调侃。"},"examples":[{"en":"They poked fun at his old-fashioned phone.","zh":"他们调侃他那部老式手机。"}]}],"synonyms":["prodded","jabbed","nudged","pricked","teased (for “poke fun at”)"],"phonetic":"/poʊkt/","extraExplanation":["“poked”本身通常不是独立词条，而是动词“poke”的过去式/过去分词。你会在一般过去时（He poked…）或完成时/被动语态（has been poked）里看到它。","常见搭配：poke someone (in/on) + 身体部位（戳某人的某处）；poke a hole (in something)（戳个洞）；poke around（到处翻找/摸索）；poke out/through（探出/露出）。","网络语境里“poke”有时指社交平台上的“戳一戳/提醒一下”，但具体含义依平台而定。"]}
{"word":"pokeful","summary":{"en":"“Pokeful” is an informal, nonstandard adjective, most often meaning “full of Pokémon” (Pokéful). It can also be a playful made-up word meaning “full of poking.”","zh":"“pokeful”是非正式、非标准形容词，最常见指“充满宝可梦的（Pokéful）”；也可作玩笑式自造词，表示“一直在戳/捅的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Full of Pokémon; related to Pokémon (often written “Pokéful”).","zh":"（非正式、非标准）充满宝可梦的；与宝可梦相关的（常写作“Pokéful”）。"},"examples":[{"en":"The new event is really Pokéful—Pokémon are everywhere in the park.","zh":"这个新活动真的很“Pokéful”——公园里到处都是宝可梦。"},{"en":"She decorated her room in a Pokéful style with Pikachu posters.","zh":"她用很“Pokéful”的风格装饰房间，贴满了皮卡丘海报。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare/creative) Full of pokes; involving a lot of poking (often used as a playful made-up word).","zh":"（少见/创造性用法）满是戳/捅的；一直在戳来戳去的（常是开玩笑的自造词）。"},"examples":[{"en":"Stop being so pokeful—just tap the screen once.","zh":"别一直戳来戳去的——点一下屏幕就好。"},{"en":"The kitten was in a pokeful mood, tapping my hand again and again.","zh":"小猫很爱“戳人”，一直用爪子拍我的手。"}]}],"synonyms":["Pokémon-themed","full of Pokémon","poke-heavy (informal)"],"phonetic":"/ˈpoʊkˌfʊl/","extraExplanation":["“pokeful”不是常见标准英语词，更多是网络或口语里的自造词。最常见的解读是把“Poké-（宝可梦相关）”+“-ful（充满……的）”组合成“充满宝可梦的”。","如果你本来想写的是“pocketful”（一口袋/满兜的），拼写是 pocketful，读音也不同；例如：a pocketful of coins（满兜硬币）。"]}
{"word":"pokelogan","summary":{"en":"“pokelogan” isn’t a standard English word; it’s likely a misspelling or a name/handle. Context is needed to identify the intended meaning.","zh":"“pokelogan”不是标准英语单词；更可能是拼写错误或名字/网名。需要语境才能判断你想表达的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a made-up/brand term.","zh":"不是标准英语单词。更可能是拼写错误、用户名，或自创/品牌用词。"},"examples":[{"en":"I can’t find “pokelogan” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“pokelogan”——你是不是想写别的词？"},{"en":"If “pokelogan” is a username or product name, its meaning depends on the context.","zh":"如果“pokelogan”是用户名或产品名，它的含义取决于具体语境。"}]},{"partOfSpeech":"other","definition":{"en":"Possible intended words (closest common matches): “logon/log in” (to sign in), “slogan” (a short phrase for advertising), or “poke” (to prod lightly).","zh":"可能想表达的常见近似词：logon/log in（登录），slogan（口号/标语），poke（轻戳/捅一下）。"},"examples":[{"en":"Did you mean “log on”? Example: Please log on to your account.","zh":"你是不是想写“log on”？例：Please log on to your account.（请登录你的账户。）"},{"en":"Did you mean “slogan”? Example: Their slogan is easy to remember.","zh":"你是不是想写“slogan”？例：Their slogan is easy to remember.（他们的口号很容易记。）"},{"en":"Did you mean “poke”? Example: He poked me on the shoulder.","zh":"你是不是想写“poke”？例：He poked me on the shoulder.（他戳了戳我的肩膀。）"}]}],"phonetic":"/ˈpoʊkˌloʊɡən/","extraExplanation":["“pokelogan”看起来像把两个词拼在一起（例如 poke + Logan / logon），但英语里没有固定、通用的词条对应它。","如果你能提供它出现的句子、截图，或你想表达的中文意思（比如“登录/口号/戳一下/某个人名Logan”），我可以帮你确认正确拼写与用法。"]}
{"word":"pokeloken","summary":{"en":"“Pokeloken” isn’t a recognized English word; it’s likely a name or a misspelling.","zh":"“pokeloken”不是常见英语词汇，更可能是专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a game term, or a proper name (brand/place/person).","zh":"不是标准英语单词。可能是拼写错误、用户名、游戏用语，或专有名词（品牌/地名/人名）。"},"examples":[{"en":"I couldn’t find “pokeloken” in a dictionary—could it be a username or a misspelling?","zh":"我在词典里找不到“pokeloken”——它会不会是用户名或拼写错误？"},{"en":"If you meant “Pokémon,” the spelling is different.","zh":"如果你想写的是“Pokémon（宝可梦）”，拼写是不一样的。"}]}],"phonetic":"/ˈpoʊkˌloʊkən/","extraExplanation":["“pokeloken”看起来像是把两个部分拼在一起的自造词（例如 poke + token / Pokémon + token 之类），但没有固定的通用含义。","如果你告诉我它出现的语境（哪部游戏/哪段句子/哪个网站），我可以帮你判断它最可能指什么，并给出对应的英文解释与用法。"]}
{"word":"pokeout","summary":{"en":"“Poke out” usually means “stick out,” and it can also mean “push something out by poking,” or informally “go out briefly.”","zh":"“poke out”通常表示“伸出/突出”，也可指“戳出来”，口语里还可表示“短暂外出”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to stick out; to extend beyond a surface or boundary","zh":"伸出；突出；从表面或边界外露出来"},"examples":[{"en":"A nail was poking out of the board.","zh":"一根钉子从木板里突出来。"},{"en":"His shirt was poking out from under his jacket.","zh":"他的衬衫从夹克下面露出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to push something out by poking; to make something come out with a quick push","zh":"戳（挤）出来；用戳的动作把东西弄出来"},"examples":[{"en":"She poked the plug out with a pencil.","zh":"她用铅笔把塞子戳出来。"},{"en":"He poked the stuck key out from the lock.","zh":"他把卡住的钥匙从锁里戳出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) to go out briefly, often for a short errand","zh":"（非正式）短暂外出（多指办点小事）"},"examples":[{"en":"I’m just going to poke out to the store for milk.","zh":"我就出去一趟到店里买牛奶。"},{"en":"She poked out for a few minutes and came right back.","zh":"她出去几分钟就马上回来了。"}]}],"synonyms":["stick out","protrude","jut out","extend","pop out","go out"],"phonetic":"/poʊk aʊt/","extraExplanation":["“poke out”更常见的写法是分开写（poke out），而不是合写“pokeout”。它是可分离/不可分离要看用法：\n- 表“伸出/突出”时通常不可分离：A nail poked out.\n- 表“把……戳出来”时常可分离：She poked the plug out / She poked out the plug（两种都可能，但前者更自然）。\n- 表“短暂外出”多见于英式/口语场景，带一点轻松随意的语气。"]}
{"word":"poker","summary":{"en":"Poker most commonly means a betting card game; it can also mean a tool used to stir a fire.","zh":"poker 最常指一种下注的纸牌游戏；也可指用来拨动火的工具（拨火棍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A card game (and a family of card games) in which players bet on the strength of their hands, often trying to win by having the best hand or by making others fold.","zh":"扑克游戏（及其一类游戏的总称）：玩家根据手牌强弱下注，常通过拿到最好牌或让对手弃牌来获胜。"},"examples":[{"en":"They played poker after dinner with a small buy-in.","zh":"晚饭后他们玩了一局扑克，买入金额不大。"},{"en":"In poker, bluffing can be as important as the cards you get.","zh":"在扑克里，虚张声势（诈唬）有时和拿到什么牌一样重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A long metal tool used to stir a fire or move burning wood or coal (a fire poker).","zh":"拨火棍：用来拨动火炉里木柴或煤炭的长金属工具。"},"examples":[{"en":"He used a poker to push the logs closer together.","zh":"他用拨火棍把木柴拨得更靠近一些。"},{"en":"Keep the poker by the fireplace for safety.","zh":"把拨火棍放在壁炉旁以备需要。"}]}],"synonyms":["card game","Texas hold'em","fire iron","fire poker"],"phonetic":"/ˈpoʊkər/","extraExplanation":["“poker（扑克游戏）”在美式文化中很常见，既指家庭或朋友间的小赌怡情，也常出现在拉斯维加斯等赌场环境。常见搭配：play poker（玩扑克）、poker game（扑克局）、poker face（扑克脸：不露情绪的表情）、poker chip（筹码）、bluff（诈唬）、fold（弃牌）、bet/raise/call（下注/加注/跟注）。","词源方面，poker 作为纸牌游戏名称一般认为与19世纪美国的纸牌玩法发展有关；作为“拨火棍”的意思更直观，来自“poke（戳、捅）”的动作概念。"]}
{"word":"pokerface","summary":{"en":"“Poker face” means a neutral expression that hides your feelings, often to avoid giving others clues.","zh":"“poker face”指隐藏真实情绪的面无表情，常用于不让别人看出线索。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a neutral, unreadable facial expression that hides your true feelings or reactions","zh":"（隐藏真实情绪的）面无表情；不露声色的表情"},"examples":[{"en":"She kept a poker face during the meeting, even when the plan was criticized.","zh":"即使方案被批评，她在会议上也一直保持扑克脸。"},{"en":"Try to keep a poker face so they can’t guess the surprise.","zh":"尽量保持扑克脸，这样他们就猜不到惊喜了。"},{"en":"His poker face made it hard to tell whether he was joking.","zh":"他的扑克脸让人很难判断他是不是在开玩笑。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in poker) a calm expression used to avoid giving opponents clues about your hand","zh":"（扑克牌游戏中）用来不让对手看出牌力的镇定表情"},"examples":[{"en":"In poker, a good player practices a poker face to avoid giving tells.","zh":"在扑克里，高手会练习扑克脸，避免露出“破绽”。"},{"en":"He wore a poker face while betting, so no one knew he had strong cards.","zh":"他下注时一脸镇定，没人知道他手牌很强。"}]}],"synonyms":["straight face","blank expression","deadpan face"],"phonetic":"/ˈpoʊkɚ feɪs/","extraExplanation":["“poker face”源自扑克牌游戏：玩家会用毫无表情的脸来掩盖紧张、兴奋或失望，避免对手从表情读出“tells（破绽）”。","在流行文化中，这个短语也因Lady Gaga的歌曲《Poker Face》（2008）而广为人知；日常使用时通常指“故意不让人看出情绪”的表情。"]}
{"word":"pokerish","summary":{"en":"“Pokerish” means poker-like, especially calm and hard to read (like a poker face).","zh":"“pokerish”意为“像扑克玩家一样的”，尤指表情冷静、难以看出情绪（像“扑克脸”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like poker or a poker player; especially having a calm, unreadable expression that hides your feelings (a “poker face”).","zh":"像打牌（扑克）的人；尤指表情冷静、难以看出情绪，能把感受藏起来（“扑克脸”）。"},"examples":[{"en":"He kept a pokerish expression while everyone else panicked.","zh":"大家都慌了，他却一直保持着一副扑克式的冷静表情。"},{"en":"Her pokerish smile made it hard to know what she was thinking.","zh":"她那种扑克式的微笑让人很难看出她在想什么。"},{"en":"The negotiator stayed pokerish and didn’t react to the bad news.","zh":"谈判代表保持扑克式的镇定，对坏消息毫无反应。"}]}],"synonyms":["poker-faced","deadpan","impassive","unreadable","stoic"],"phonetic":"/ˈpoʊkərɪʃ/","extraExplanation":["“pokerish”不算特别常见，更常见的说法是“poker-faced”（面无表情的）或直接说“a poker face”。它来自扑克文化：玩家会尽量不让对手从表情看出自己手里的牌。","语气上它通常带一点评价意味：可能是在夸一个人“很会控制情绪/很冷静”，也可能是在说“太冷淡/不容易亲近”，要看上下文。"]}
{"word":"pokerishly","summary":{"en":"Pokerishly means “with a poker face”—calm and unreadable, showing little emotion.","zh":"pokerishly 表示“带着扑克脸”——冷静不露声色、难以从表情看出情绪或想法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calm, unreadable way, showing little or no emotion (as if keeping a “poker face”).","zh":"面无表情地；不动声色地（像保持“扑克脸”一样）。"},"examples":[{"en":"He listened pokerishly, giving no clue about what he really thought.","zh":"他不动声色地听着，一点也看不出他真实的想法。"},{"en":"She pokerishly accepted the criticism and changed the topic.","zh":"她面无表情地接受了批评，然后把话题岔开了。"},{"en":"The suspect answered pokerishly, even when the questions got personal.","zh":"即使问题变得很私人，嫌疑人也依然冷静无表情地作答。"}]}],"synonyms":["impassively","expressionlessly","blankly","coolly","stoically","with a poker face"],"phonetic":"/ˈpoʊkɚɪʃli/","extraExplanation":["“pokerishly”来自“poker（扑克/扑克游戏）+ -ish + -ly”。扑克游戏里常见的策略是保持“poker face（扑克脸）”，不让对手从表情看出你的牌或情绪，所以这个词常用来形容“刻意不露声色”。","语体上它比较少见、略带文学/叙述感；日常更常说：with a poker face / impassively / expressionlessly。"]}
{"word":"pokerishness","summary":{"en":"Pokerishness means a calm, unreadable manner—showing little emotion, like having a poker face.","zh":"pokerishness 指一种冷静克制、难以看透的态度或气质，类似“扑克脸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being pokerish: showing little emotion, staying calm and hard to read (like someone with a “poker face”).","zh":"“扑克式”的特质：情绪不外露、冷静克制、让人难以看透（像“扑克脸”一样）。"},"examples":[{"en":"His pokerishness made it impossible to tell whether he was joking.","zh":"他那种扑克式的冷静让人根本看不出他是在开玩笑还是认真的。"},{"en":"In negotiations, her pokerishness often gave her an advantage.","zh":"在谈判中，她这种不露声色的作风常常让她占上风。"},{"en":"The actor played the role with a quiet pokerishness that fit the character.","zh":"那位演员用一种安静的“扑克式克制”来演这个角色，很贴合人物。"}]}],"synonyms":["poker-facedness","impassiveness","unreadability","reserve","stoicism"],"phonetic":"/ˈpoʊkərɪʃnəs/","extraExplanation":["这个词比较少见，通常是由形容词 pokerish（像打扑克的人那样不动声色、难以读懂）加上名词后缀 -ness 构成，表示“某种性格/状态的特质”。","语感上偏书面或描写性写作；日常口语里更常说 a poker face（扑克脸）、being hard to read（难以看透）、stoicism（克制/坚忍）等。","pokerishness 多用来形容在社交、谈判、比赛或需要隐藏情绪的场景中表现出的冷静与不外露。"]}
{"word":"pokerlike","summary":{"en":"“Pokerlike” means poker-like—suggesting bluffing, risk, and hidden information.","zh":"“pokerlike”意为“像扑克一样的”，常暗示虚张声势、风险和信息隐藏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling poker in style, strategy, or atmosphere—often involving risk, high stakes, bluffing, or hidden information.","zh":"像扑克（德州扑克等）的；指风格、策略或氛围类似扑克——常含有冒险、高风险、虚张声势或信息隐藏等特点。"},"examples":[{"en":"Negotiations turned pokerlike, with both sides bluffing and revealing little.","zh":"谈判变得像打扑克一样，双方都在虚张声势，很少透露真实信息。"},{"en":"The market felt pokerlike today: lots of uncertainty and a few bold bets.","zh":"今天的市场感觉像扑克局：不确定性很大，只有少数人下了大胆的赌注。"}]}],"synonyms":["poker-like","high-stakes","risky","strategic","bluffing"],"phonetic":"/ˈpoʊkərˌlaɪk/","extraExplanation":["“pokerlike”更常见的写法是“poker-like”（带连字符），在正式写作中更清晰。","它通常是比喻用法，不一定真的与扑克有关，而是强调“信息不透明、需要读懂对方、以及承担风险的决策”。"]}
{"word":"pokeroot","summary":{"en":"Pokeroot = the root of American pokeweed, a plant known in folk medicine but potentially poisonous.","zh":"pokeroot 指美洲商陆的根，民间曾用作草药，但可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (American pokeweed, *Phytolacca americana*) whose large root was used in traditional medicine; the plant is also known for its dark purple berries and is considered poisonous if prepared incorrectly.","zh":"美洲商陆（pokeweed，学名 *Phytolacca americana*）的根；传统民间有入药用法，但植物（尤其根与浆果）若处理不当有毒。"},"examples":[{"en":"Some old folk remedies mention pokeroot, but modern guidance warns it can be toxic.","zh":"一些民间偏方会提到 pokeroot，但现代建议强调它可能有毒。"},{"en":"In the woods we saw pokeweed, sometimes called pokeroot, with clusters of dark berries.","zh":"我们在林子里看到商陆（pokeweed），也有人叫它 pokeroot，结着一串串深色浆果。"}]}],"synonyms":["poke root","pokeweed","American pokeweed","Phytolacca americana"],"phonetic":"/ˈpoʊkˌruːt/","extraExplanation":["pokeroot 常写作 poke root，也常被统称为 pokeweed（商陆）。在美国南方与阿巴拉契亚地区，相关饮食文化里有 “poke sallet / poke salad”（把幼叶反复焯煮后食用）的说法，但这不等于根可安全食用。","注意：商陆的根、成熟叶与浆果含毒性成分；历史上虽有外用或草药用途，但不建议自行采集或药用。","文化线索：流行文化里偶尔会借商陆/“poke salad”营造乡土或南方意象（如歌曲《Poke Salad Annie》）。"]}
{"word":"pokeroots","summary":{"en":"“Pokeroots” means the roots of pokeweed, sometimes mentioned in folk medicine but potentially poisonous.","zh":"“Pokeroots”指商陆（pokeweed）的根，常见于民俗/草药语境，但可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the root of pokeweed (a wild North American plant), sometimes used in traditional/folk medicine (but potentially poisonous)","zh":"商陆（北美野生植物 pokeweed）的根；有时用于民间/草药疗法（但可能有毒）"},"examples":[{"en":"Some old folk remedies mention pokeroots, but you should not try them without medical advice.","zh":"一些古老的民间偏方会提到 pokeroots，但没有医生建议不要尝试。"},{"en":"The label warned that pokeroots can be toxic if taken incorrectly.","zh":"标签警告说，如果使用不当，pokeroots 可能有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the pokeweed plant itself, especially when talking about it as an herbal remedy","zh":"（较少见）指商陆植物本身，尤其在把它当作草药来谈时"},"examples":[{"en":"In some communities, people talked about “pokeroots” as a traditional herb.","zh":"在一些社区里，人们会把“pokeroots”当作一种传统草药来谈。"}]}],"synonyms":["pokeweed root","pokeroot","Phytolacca root"],"phonetic":"ˈpoʊkˌruːts","extraExplanation":["“pokeroot / pokeroots”常见于美国南方或阿巴拉契亚地区的民俗与草药语境，指商陆（pokeweed, *Phytolacca americana*）的根。","重要提醒：商陆的根、叶、浆果都可能含毒成分；即使在传统用法中也强调剂量与处理方式。现代语境里多用于历史/文化描述或警示，不建议自行食用或入药。"]}
{"word":"pokers","summary":{"en":"“Pokers” most commonly means multiple fireplace pokers (metal rods for stirring a fire). It can also (less commonly) mean multiple poker games.","zh":"“pokers”最常指多根“拨火棍”（用于拨弄火的金属棒）；也可（较少见）指多场/多局扑克游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of poker: a metal rod used for stirring or adjusting a fire (especially in a fireplace)","zh":"poker 的复数：拨火棍；（用于壁炉等的）拨火铁棒"},"examples":[{"en":"She used the pokers to pull the logs closer together.","zh":"她用拨火棍把木头拨得更靠近一些。"},{"en":"The old fireplace set included tongs, a brush, and two pokers.","zh":"那套老式壁炉工具里有火钳、刷子和两根拨火棍。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of poker: the card game (or a set of people/games involving poker)","zh":"poker 的复数：扑克游戏（或多场/多局扑克）"},"examples":[{"en":"They played pokers all weekend at the cabin.","zh":"他们在小木屋里整个周末都在打扑克。"},{"en":"Online pokers can be fast-paced, so set a time limit.","zh":"线上扑克节奏很快，所以最好设定时间限制。"}]}],"synonyms":["fire pokers","stoking rods","poker games","card games"],"phonetic":"/ˈpoʊkərz/","extraExplanation":["“poker”也可以作动词，意思是“用手指/物体戳、捅”（poke）或“拨弄火”。不过“pokers”通常更常见的是名词复数（拨火棍/扑克游戏）。","注意：标准用法里，指“多局扑克”一般说“poker games”更自然；“pokers”作“扑克游戏的复数”较口语、也不如前者常见。"]}
{"word":"pokes","summary":{"en":"“Pokes” most commonly means “pushes/prods lightly” (3rd-person singular of poke). It can also mean “makes a small hole,” or “teases” in the phrase “poke fun at.” Rarely, it’s the plural of an old word for “bag.”","zh":"“pokes”最常见指“轻戳/轻推”（poke 的第三人称单数）。也可指“戳出小洞”，或在短语“poke fun at”中表示“取笑”。少见情况下是旧式用法“袋子”的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Verb, third-person singular of “poke”) to push or prod someone or something lightly, often with a finger or a small object.","zh":"（动词，poke 的第三人称单数）轻戳；轻推（常用手指或小物件）。"},"examples":[{"en":"She pokes me in the arm to get my attention.","zh":"她轻戳我的手臂来引起我的注意。"},{"en":"The child pokes the sand with a stick.","zh":"孩子用棍子戳沙子。"}]},{"partOfSpeech":"v.","definition":{"en":"(Verb) to make a small hole in something; to pierce or puncture.","zh":"（动词）戳出小洞；刺破。"},"examples":[{"en":"He pokes a hole in the lid so the steam can escape.","zh":"他在盖子上戳了个小洞，让蒸汽散出去。"}]},{"partOfSpeech":"v.","definition":{"en":"(Verb) to tease or make fun of (usually used with “fun”).","zh":"（动词）取笑；开玩笑（常与 fun 连用：poke fun at）。"},"examples":[{"en":"He pokes fun at my accent, but I try not to take it personally.","zh":"他拿我的口音开玩笑，但我尽量不往心里去。"},{"en":"It’s okay to joke, but don’t poke fun at people’s mistakes.","zh":"开玩笑可以，但别拿别人的错误取笑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, plural) bags or sacks (more common in British or older usage, e.g., “a poke” meaning a bag).","zh":"（名词复数）袋子；麻袋（较偏英式或较旧用法，a poke 可指袋子）。"},"examples":[{"en":"They carried their food in small pokes.","zh":"他们用小袋子装食物。"}]}],"synonyms":["prods","jabs","nudges","punches (lightly)","teases (context-dependent)"],"phonetic":"/poʊks/","extraExplanation":["“pokes”最常见是动词“poke”的第三人称单数（he/she/it pokes）。如果你看到“a poke”表示“袋子”的意思，通常是较旧或偏英式的用法；现代日常英语里更常说 bag/sack。","常见搭配：poke someone (in/on) + 身体部位（轻戳某处）；poke a hole in + 物（戳洞）；poke fun at + 人/事（取笑）。注意：poke fun at 的语气可能伤人，使用时要留意场合与关系。"]}
{"word":"pokeweed","summary":{"en":"Pokeweed is a North American wild plant with purple berries; parts of it are poisonous to humans.","zh":"Pokeweed（商陆）是北美常见的野生植物，结紫色浆果；对人类而言部分有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall wild plant with clusters of dark purple berries, common in North America; the berries and roots are poisonous if eaten (though the leaves are sometimes cooked as a traditional food when properly prepared)","zh":"一种北美常见的高大野生植物，结深紫色浆果；浆果和根有毒（不过叶子在某些传统做法中会被充分处理后烹食）"},"examples":[{"en":"Pokeweed grows quickly in empty lots and along fences in late summer.","zh":"夏末时，商陆常在空地和篱笆旁快速生长。"},{"en":"The birds ate the pokeweed berries, but people shouldn’t.","zh":"鸟会吃商陆的浆果，但人不应该吃。"}]}],"synonyms":["American pokeweed","poke","Phytolacca americana"],"phonetic":"/ˈpoʊkˌwiːd/","extraExplanation":["“pokeweed”通常指北美商陆（*Phytolacca americana*）。它的紫色汁液会染色，过去有人用它做简易染料或“墨水”，但并不安全可食用。","在美国南方文化里，“poke sallet/salad”（商陆嫩叶做的菜）是带有乡土与传统意味的食物说法；关键是必须反复焯煮去毒。日常英语里提到它时，多半是在提醒有毒或指一种常见野草。"]}
{"word":"pokeweeds","summary":{"en":"Pokeweeds are North American wild plants with dark berries; they are generally poisonous, though very young leaves are sometimes cooked in regional traditions.","zh":"pokeweeds 指北美常见的商陆野生植物，结深色浆果；整体有毒，但在部分地区传统里会将极嫩叶反复焯煮后食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall wild plant (pokeweed) with purple-black berries, common in North America; its roots, berries, and mature leaves are poisonous","zh":"（美洲）商陆；一种常见于北美的高大野生植物，结紫黑色浆果；其根、浆果和老叶有毒"},"examples":[{"en":"Pokeweeds grow quickly along fences and in abandoned lots.","zh":"商陆常在篱笆旁和荒地里长得很快。"},{"en":"The dark berries of pokeweeds can look tempting, but they are poisonous.","zh":"商陆深色的浆果看起来很诱人，但它们有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"the leaves of young pokeweed plants cooked as food (regional, especially in the U.S. South), after careful boiling and draining","zh":"（地区用法，尤指美国南部）将幼嫩商陆叶反复焯煮并倒掉水后食用的“商陆菜/商陆叶”（需谨慎处理）"},"examples":[{"en":"Some families in the South still cook young pokeweed leaves as a traditional spring dish.","zh":"在美国南部，有些家庭仍会把嫩商陆叶当作春天的传统菜肴来烹调。"}]}],"synonyms":["pokeweed","American pokeweed","poke","Phytolacca americana"],"phonetic":"/ˈpoʊkˌwid/","extraExplanation":["“pokeweed”在美国文化里很常见，常出现在乡村记忆、民间采野菜（foraging）与自然书写中。需要注意的是：商陆的毒性较强，民间食用通常只指“非常幼嫩的叶子”，并且要反复焯煮、倒掉水；浆果和根尤其危险。日常英语里看到“pokeweeds”，多半是在讲院子里或路边长出的这种杂草样植物。"]}
{"word":"pokey","summary":{"en":"Pokey means “slow” in informal English, and it can also mean “jail” in slang (usually as “the pokey”).","zh":"Pokey 在非正式英语里常表示“慢吞吞的”，也可作俚语指“监狱/拘留所”（多说 the pokey）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Slow, not quick; moving or working at a leisurely pace.","zh":"（非正式）慢吞吞的；不快的；拖拖拉拉的。"},"examples":[{"en":"Traffic was pokey this morning, so I got to work late.","zh":"今天早上路况很慢吞吞，所以我上班迟到了。"},{"en":"The line at the coffee shop is a bit pokey today.","zh":"今天咖啡店排队有点慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, usually ‘the pokey’) A jail or prison, especially a local jail for short stays.","zh":"（俚语，常用作 the pokey）监狱；拘留所（多指短期关押的地方）。"},"examples":[{"en":"He spent the night in the pokey for disorderly conduct.","zh":"他因扰乱治安在拘留所过了一夜。"},{"en":"In old movies, characters joke about ending up in the pokey.","zh":"在老电影里，角色常开玩笑说自己会进拘留所。"}]}],"synonyms":["slow","sluggish","leisurely","poky","the slammer","jail"],"phonetic":"/ˈpoʊki/","extraExplanation":["“pokey”也常拼作“poky”。表示“慢吞吞”时更常见；表示“监狱”时多用于口语和幽默/老派语境，常见固定说法是“the pokey”。"]}
{"word":"pokeys","summary":{"en":"“Pokeys” most commonly means (informal) jails or prisons; it can also jokingly refer to slow people or things.","zh":"“pokeys”最常指（非正式）监狱/拘留所；也可开玩笑地指动作慢的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Jails or prisons; places where people are kept after being arrested (informal).","zh":"（复数）监狱；拘留所（非正式说法）。"},"examples":[{"en":"He spent a night in the pokey for drunk driving.","zh":"他因为酒驾在拘留所待了一晚。"},{"en":"The movie shows the characters trying to stay out of the pokeys.","zh":"电影里的人物想方设法不进拘留所。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, informal) Slow or boring people or things; used jokingly or mildly negatively.","zh":"（复数，非正式）动作慢或无聊的人/事物；带玩笑或轻微贬义。"},"examples":[{"en":"Come on, you pokeys—let’s hurry up!","zh":"快点啦，你们这些慢吞吞的人——赶紧！"},{"en":"The line was full of pokeys, so we were late.","zh":"队伍里全是慢吞吞的人，所以我们迟到了。"}]}],"synonyms":["jails","prisons","the slammer","the joint","slowpokes"],"phonetic":"/ˈpoʊki/","extraExplanation":["“pokeys”是“pokey / poky”的复数。最常见的固定说法是 **in the pokey**（在拘留所/进了局子）。","拼写上 **pokey** 和 **poky** 都能见到；在“监狱/拘留所”这个意思里，**pokey** 更常见。","语气偏口语、略带戏谑；正式写作建议用 **jail / prison / detention center** 等。"]}
{"word":"pokie","summary":{"en":"An informal Australian/New Zealand word for a slot machine (often said as “pokies”).","zh":"澳大利亚/新西兰的非正式说法，指“老虎机”（常用复数“pokies”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand, informal) a slot machine; a poker/slot gambling machine, often found in pubs and clubs.","zh":"（澳大利亚/新西兰，非正式）老虎机；（酒吧、俱乐部里常见的）赌博机。"},"examples":[{"en":"They spent an hour playing the pokies at the local pub.","zh":"他们在当地酒吧玩了一小时老虎机。"},{"en":"The government introduced stricter rules for pokies to reduce problem gambling.","zh":"政府对老虎机出台了更严格的规定，以减少赌博成瘾问题。"}]}],"synonyms":["slot machine","gaming machine","one-armed bandit (informal)"],"phonetic":"/ˈpoʊki/","extraExplanation":["“pokie”主要是澳大利亚和新西兰的口语用法，更常见的复数形式是“pokies”（例如：play the pokies）。在其他英语地区通常说“slot machine(s)”。","这个词和“poker”有历史关联：早期一些赌博机被称为“poker machine”，后来口语里简化成“pokie/pokies”。","在澳新文化语境中，“pokies”常和公共讨论联系在一起，比如“problem gambling（赌博成瘾）”与相关监管政策。"]}
{"word":"pokier","summary":{"en":"“Pokier” means “more poky”: slower or more cramped/small than something else.","zh":"“pokier”是“poky”的比较级：表示“更慢/更磨蹭的”或“更狭小局促的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “poky”) slower or taking more time than usual; not quick.","zh":"（“poky”的比较级）更慢的；磨磨蹭蹭的；不快的。"},"examples":[{"en":"Traffic is pokier than usual this morning.","zh":"今天早上的交通比平时更慢。"},{"en":"The old computer feels pokier after the update.","zh":"更新之后，这台老电脑感觉更卡、更慢了。"},{"en":"We took the pokier route to avoid tolls.","zh":"为了避开收费路段，我们走了更慢的那条路。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “poky”) smaller and more cramped or uncomfortable than something else.","zh":"（“poky”的比较级）更狭小的；更局促不舒服的。"},"examples":[{"en":"This office is pokier than my last one.","zh":"这个办公室比我之前的那个更小、更挤。"},{"en":"The hotel room was pokier than the photos suggested.","zh":"酒店房间比照片看起来更狭小。"}]}],"synonyms":["slower","more sluggish","more cramped","more confined","tinier"],"phonetic":"/ˈpoʊkiər/","extraExplanation":["“pokier”来自形容词“poky”。“poky”在美式英语里常见两种意思：①慢吞吞的、效率不高的（人、电脑、交通等）；②狭小局促的（房间、办公室等）。口语中比较常用，语气通常偏随意，有时带一点抱怨或吐槽。"]}
{"word":"pokies","summary":{"en":"“Pokies” most commonly means slot machines in Australian/New Zealand English.","zh":"“pokies”最常见指澳大利亚/新西兰英语里的“老虎机”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, mainly Australia & New Zealand) Slot machines; gambling machines often found in pubs and clubs.","zh":"（非正式，主要用于澳大利亚和新西兰）老虎机；常见于酒吧、俱乐部等场所的赌博机器。"},"examples":[{"en":"They spent an hour playing the pokies at the pub.","zh":"他们在酒吧玩了一小时老虎机。"},{"en":"Many towns debate how many pokies should be allowed in local clubs.","zh":"很多城镇会讨论当地俱乐部应该允许多少台老虎机。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, informal) Games of poker; poker played casually.","zh":"（较少见，非正式）扑克（德州扑克等）的牌局；随意玩的扑克。"},"examples":[{"en":"We had a quiet night in with some snacks and a bit of pokies.","zh":"我们在家安静地待着，吃点零食，随便打了几局扑克。"}]}],"synonyms":["slot machines","slots","poker machines","pokie machines"],"phonetic":"/ˈpoʊkiz/","extraExplanation":["“pokies”最常见的意思是澳新英语里的“老虎机”（也叫 poker machines / pokie machines）。在北美更常说 slot machines；如果在澳大利亚说“play the pokies”，通常指去玩老虎机而不是打扑克。","注意别和美式俚语“the pokey”（监狱）混淆：拼写通常是 pokey（单数），含义也不同。"]}
{"word":"pokiest","summary":{"en":"“Pokiest” means the slowest, or the most cramped/small (superlative of poky/pokey).","zh":"“pokiest”意为“最慢的”或“最狭小/最局促的”（poky/pokey 的最高级）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of poky/pokey: the slowest; taking the most time to move or finish something.","zh":"（poky/pokey 的最高级）最慢的；最拖拉的；花时间最多的。"},"examples":[{"en":"This is the pokiest elevator in the building.","zh":"这是这栋楼里最慢的电梯。"},{"en":"Of all the lines, that one is the pokiest—let’s choose another.","zh":"在所有队伍里，那一队最慢——我们换一条吧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative of poky/pokey: the smallest, most cramped, or least comfortable (often about rooms or spaces).","zh":"（poky/pokey 的最高级）最狭小的；最拥挤不舒服的（常形容房间、空间）。"},"examples":[{"en":"We ended up in the pokiest room at the hotel.","zh":"我们最后住进了酒店里最狭小的房间。"},{"en":"The pokiest apartment can still feel cozy with good lighting.","zh":"再小的公寓也能靠好的灯光变得温馨。"}]}],"synonyms":["slowest","sluggish","most cramped","most confined","smallest","tiny"],"phonetic":"/ˈpoʊkiəst/","extraExplanation":["“pokiest”来自形容词“poky/pokey”。两种拼写都常见；美式英语里“pokey”更常见一些。“poky/pokey”常带轻微抱怨或吐槽语气：要么嫌慢（slow），要么嫌地方小、局促（cramped）。另外，“pokey”在俚语里还可指“监狱”（the pokey），但“pokiest”很少用在这个含义上。"]}
{"word":"pokily","summary":{"en":"“Pokily” means doing something slowly and cautiously, often with hesitation.","zh":"“pokily”表示做事慢吞吞且小心，常带犹豫的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow and cautious way, often because you are uncertain, shy, or slightly afraid.","zh":"慢吞吞又小心翼翼地；常因不确定、害羞或有点害怕而显得犹豫。"},"examples":[{"en":"He pokily walked into the room, unsure of what to say.","zh":"他慢吞吞又小心地走进房间，不知道该说什么。"},{"en":"She pokily raised her hand to ask a question.","zh":"她犹犹豫豫地举起手想提问。"}]}],"synonyms":["slowly","cautiously","hesitantly","tentatively","leisurely"],"phonetic":"/ˈpoʊkəli/","extraExplanation":["“pokily”来自形容词“poky”，意思是“慢的、迟钝的、行动不快的”。在现代英语里，“pokily”不算常用；更常见的说法是“slowly”“cautiously”或“hesitantly”。","语气上，“pokily”常带一点点不耐烦或调侃：强调一个人动作慢、磨蹭，而不只是客观地“慢”。"]}
{"word":"pokiness","summary":{"en":"Pokiness means slowness, especially in how someone moves or how fast something gets done.","zh":"Pokiness 指“慢吞吞、迟缓”，常用来形容人或服务做事不够快。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Slowness in movement, progress, or doing things; a lack of speed.","zh":"迟缓；慢吞吞（在行动、进展或做事速度上不快）。"},"examples":[{"en":"We missed the train because of the pokiness of the bus.","zh":"因为公交车太慢吞吞，我们错过了火车。"},{"en":"Customers complained about the pokiness of the service during lunch rush.","zh":"午餐高峰时顾客抱怨服务太慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A tendency to poke or stick out; a protruding shape.","zh":"（较少用）突出的状态；向外戳出或翘起的样子。"},"examples":[{"en":"The pokiness of the nails made the chair unsafe to sit on.","zh":"钉子突出来，让那把椅子坐起来不安全。"}]}],"synonyms":["slowness","sluggishness","delay","lack of speed"],"phonetic":"/ˈpoʊki.nəs/","extraExplanation":["“pokiness”通常是口语、略带抱怨语气的词，来自形容词“poky”（慢吞吞的、效率低的）。在日常生活中更常见的近义说法有“slowness”“delay”“lack of speed”。","在英美文化里，用“poky”/“pokiness”形容人或服务速度慢，语气一般不算粗鲁，但带一点不耐烦；正式场合可换成更中性的“slow service / slow progress”。"]}
{"word":"pokinesses","summary":{"en":"“Pokinesses” means multiple instances or kinds of pokiness: slowness/dragging behavior, or small cramped space.","zh":"“pokinesses”指多种或多处的“pokiness”：要么是做事慢、拖拉；要么是空间狭小、局促的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “pokiness”) The quality of being slow, not energetic, or taking too long to act or move.","zh":"（“pokiness”的复数）缓慢、拖拉、缺乏干劲的状态或特质。"},"examples":[{"en":"The project’s delays came from the team’s pokinesses in making decisions.","zh":"项目的拖延来自团队在做决定时的各种拖拉。"},{"en":"I can handle mistakes, but I can’t handle pokinesses when we’re on a deadline.","zh":"我能接受犯错，但在截止日期前我无法接受各种拖拉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of “pokiness”) The quality of being small, cramped, or uncomfortably tight (often describing rooms or spaces).","zh":"（“pokiness”的复数）狭小、逼仄、让人不舒服的拥挤感（常形容房间或空间）。"},"examples":[{"en":"They renovated to reduce the pokinesses of the old apartments.","zh":"他们翻新是为了减少老公寓的逼仄感。"},{"en":"The café is charming, but the pokinesses of the seating area can be annoying.","zh":"这家咖啡馆很有魅力，但座位区的拥挤逼仄有时会让人烦。"}]}],"synonyms":["slownesses","dawdling","sluggishness","crampedness","tightness"],"phonetic":"ˈpoʊkinəsɪz","extraExplanation":["“poky”在美式英语中常表示“慢吞吞的、磨蹭的”；在英式英语里也常用来形容地方“狭小、局促”。因此“pokiness”既可以指“拖拉”，也可以指“逼仄感”。","“pokinesses”是很少见的复数形式；日常表达里更常用“a lot of pokiness”或用形容词直接说“poky”。"]}
{"word":"poking","summary":{"en":"\"Poking\" usually means lightly pressing/touching with a finger or pointed object, and it can also mean intruding into something or teasing someone.","zh":"“poking”通常指用手指或尖物轻戳；也可指打探（poking into/around）或取笑（poking fun at）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"touching or pressing something lightly and quickly, often with a finger or a pointed object","zh":"（用手指或尖物）轻戳；轻轻而快速地碰或按"},"examples":[{"en":"Stop poking your sister and sit down.","zh":"别再戳你妹妹了，坐下。"},{"en":"He kept poking the screen to see if it would respond.","zh":"他不停地戳屏幕，想看看会不会有反应。"}]},{"partOfSpeech":"v.","definition":{"en":"prodding or stirring something (for example, food) to check it or move it","zh":"（为检查或移动）捅一捅；拨弄（例如食物）"},"examples":[{"en":"She was poking the potatoes with a fork to see if they were soft.","zh":"她用叉子戳土豆，看看软了没有。"}]},{"partOfSpeech":"v.","definition":{"en":"intruding by asking questions or investigating in an annoying way (often with \"into\")","zh":"（常与 into 连用）打探、探听；多管闲事地追问"},"examples":[{"en":"Why are you poking into my personal life?","zh":"你为什么要打探我的私生活？"},{"en":"The reporter was poking around for information.","zh":"那位记者在四处打探消息。"}]},{"partOfSpeech":"phrase","definition":{"en":"teasing or making fun of someone (often with \"fun at\")","zh":"（常与 fun at 连用）取笑；逗弄"},"examples":[{"en":"They were poking fun at his accent, which was rude.","zh":"他们取笑他的口音，很没礼貌。"}]}],"synonyms":["prod","jab","nudge","tap","pry (into)"],"phonetic":"/ˈpoʊkɪŋ/","extraExplanation":["“poking”通常是动词“poke”的现在分词/动名词形式：可以描述正在发生的动作（He is poking…），也可以当名词用来指这种行为（No poking! 别戳来戳去！）。","语气上，“poke”在“戳人”时常带一点烦人或挑衅的感觉；如果是无意的轻触，更常用“tap”（轻点/轻拍）。"]}
{"word":"pokingly","summary":{"en":"“Pokingly” means speaking in a teasing, joking way (a less common word than “jokingly” or “teasingly”).","zh":"“pokingly”指以打趣、调侃的方式说话（不如“jokingly/teasingly”常用）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a teasing or joking way, often to gently make fun of someone.","zh":"以开玩笑、打趣的方式（常带有轻微取笑的意味）。"},"examples":[{"en":"He said, pokingly, that she was “always five minutes late.”","zh":"他打趣地说她“总是迟到五分钟”。"},{"en":"She pokingly asked if he had finally learned how to cook.","zh":"她开玩笑地问他是不是终于学会做饭了。"}]}],"synonyms":["jokingly","teasingly","playfully","facetiously"],"phonetic":"/ˈpoʊkɪŋli/","extraExplanation":["“pokingly”比较少见，更常见的表达是：jokingly（开玩笑地）、teasingly（逗弄地）、playfully（顽皮地）。","它和短语“poke fun (at someone)”有关，意思是“拿某人开玩笑/取笑”。语气通常比 insult（侮辱）轻，但如果对方敏感也可能显得不礼貌。","在写作里用“pokingly”会带一点“戳一戳式的调侃”的画面感，但日常口语更自然的是用“jokingly/teasingly”。"]}
{"word":"pokom","summary":{"en":"“pokom” is not a standard English word; it’s usually a typo for “Pokémon.”","zh":"“pokom”不是标准英语词；通常是“Pokémon（宝可梦）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly a misspelling or shorthand for “Pokémon” (the media franchise and its fictional creatures).","zh":"不是标准英语单词；最常见是“Pokémon（宝可梦/口袋妖怪）”的拼写错误或简写。"},"examples":[{"en":"I think you meant “Pokémon,” not “pokom.”","zh":"我觉得你想写的是“Pokémon”，不是“pokom”。"},{"en":"My little brother loves Pokémon cards.","zh":"我弟弟很喜欢宝可梦卡牌。"}]}],"synonyms":["Pokémon","Pokemon"],"phonetic":"/ˈpoʊkeɪmɑn/","extraExplanation":["“Pokémon”来自日语“ポケモン”，是“Pocket Monsters（口袋妖怪）”的缩略说法。英语中常见写法带重音符号：Pokémon（é），但日常不写也能被理解（Pokemon）。","如果你指的是别的词（例如人名、地名、游戏名或某种缩写），告诉我你看到它的句子/语境，我可以按那个意思解释。"]}
{"word":"pokomam","summary":{"en":"“pokomam” isn’t a recognized English word; it’s likely a misspelling (often of “Pokémon”) or a name.","zh":"“pokomam”不是常见英文词，可能是拼写错误（常见是“Pokémon/宝可梦”）或某个名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (proper noun). Many learners intend “Pokémon.”","zh":"不是标准英语单词，可能是拼写错误或专有名词（名字）。很多学习者想表达的是“Pokémon（宝可梦）”。"},"examples":[{"en":"I can’t find “pokomam” in an English dictionary—did you mean “Pokémon”?","zh":"我在英文词典里找不到“pokomam”——你是不是想写“Pokémon（宝可梦）”？"},{"en":"If “pokomam” is a username or place name, please share the context.","zh":"如果“pokomam”是用户名或地名，请提供上下文。"}]}],"synonyms":["Pokémon (possible intended word)"],"extraExplanation":["“Pokémon”是日本游戏/动画系列名，在英语里通常当作专有名词使用；写法带重音符号é，但日常也常见写作Pokemon。发音一般是 /ˈpoʊkeɪmɑn/（美式常见读法）。如果你告诉我“pokomam”出现在哪句话里，我也可以帮你判断它到底指什么。"]}
{"word":"pokomo","summary":{"en":"Pokomo refers to a Kenyan ethnic group and the Bantu language they speak.","zh":"Pokomo 指肯尼亚的波科莫族群，以及他们所说的班图语支语言（波科莫语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Pokomo, an ethnic group in Kenya (especially along the Tana River).","zh":"波科莫人（肯尼亚的一个族群，主要分布在塔纳河流域）。"},"examples":[{"en":"The Pokomo have long lived along the Tana River in Kenya.","zh":"波科莫人长期居住在肯尼亚的塔纳河沿岸。"},{"en":"A Pokomo elder told stories about farming and river life.","zh":"一位波科莫族长讲述了关于耕作与河流生活的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language spoken by the Pokomo people.","zh":"波科莫语（波科莫人所使用的班图语支语言）。"},"examples":[{"en":"She is learning Pokomo to communicate with her relatives.","zh":"她正在学习波科莫语，以便和亲戚交流。"},{"en":"The radio program included a short segment in Pokomo.","zh":"这档广播节目包含了一小段波科莫语内容。"}]}],"synonyms":["Pokomo people","Pokomo language"],"phonetic":"/poʊˈkoʊmoʊ/","extraExplanation":["“Pokomo”常见于人类学、语言学或东非地区相关的语境中；在日常英文里不算常用词。","有时会看到拼写变体或更具体的称呼（例如指不同方言/群体分支）；如果你是在某篇文章里遇到它，可以提供句子，我可以帮你判断具体指“族群”还是“语言”。"]}
{"word":"pokomoo","summary":{"en":"“pokomoo” isn’t a recognized English word; it’s probably a misspelling (often of “Pokémon”) or a personal name/username.","zh":"“pokomoo”不是常见英语词；多半是拼写错误（常见是“Pokémon/宝可梦”）或人名/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a made-up name (for example, an online username), and it has no fixed dictionary meaning.","zh":"不是标准英语单词。更可能是拼写错误或自造名称（例如网名/ID），因此没有固定的词典释义。"},"examples":[{"en":"My username on the game is Pokomoo.","zh":"我在这个游戏里的用户名是 Pokomoo。"},{"en":"I couldn’t find “pokomoo” in a dictionary—did you mean “Pokémon”?","zh":"我在词典里找不到“pokomoo”——你是不是想写“Pokémon（宝可梦）”？"}]}],"extraExplanation":["“pokomoo”很像把“Pokémon（宝可梦）”拼错了。常见正确拼写是 Pokémon（带重音符号 é），不带重音也常写作 Pokemon。","如果你告诉我它出现的句子/场景（游戏、聊天、品牌名、歌词等），我可以更准确判断它指什么，并给出更贴近语境的解释。"]}
{"word":"pokonchi","summary":{"en":"“Pokonchi” most commonly refers to the Poqomchi’ Maya people or their Mayan language in Guatemala (an alternative spelling of “Poqomchi’”).","zh":"“Pokonchi”多指危地马拉的波科姆奇（Poqomchi’）玛雅族群或其语言，常见为“Poqomchi’”的另一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Poqomchi’ (also spelled Pocomchi/Pokoman) Maya people of Guatemala","zh":"危地马拉波科姆奇（Poqomchi’，也常拼作Pocomchi/Pokonchi 等）的玛雅原住民族群成员"},"examples":[{"en":"She works with Poqomchi’ (Pokonchi) communities in Alta Verapaz, Guatemala.","zh":"她与危地马拉上韦拉帕斯的波科姆奇（Poqomchi’/Pokonchi）社区合作。"},{"en":"Many Pokonchi families maintain traditional weaving and farming practices.","zh":"许多Pokonchi家庭仍保留传统的织布与农耕方式。"}]},{"partOfSpeech":"n.","definition":{"en":"the Poqomchi’ (Pokonchi) Mayan language spoken mainly in Guatemala","zh":"波科姆奇语（Poqomchi’，也有人写作Pokonchi），一种主要在危地马拉使用的玛雅语系语言"},"examples":[{"en":"He is learning Poqomchi’ (Pokonchi) to communicate respectfully with local elders.","zh":"他在学习波科姆奇语（Poqomchi’/Pokonchi），以便尊重地与当地长者交流。"},{"en":"Some schools offer bilingual education in Spanish and Poqomchi’ (Pokonchi).","zh":"一些学校提供西班牙语与波科姆奇语（Poqomchi’/Pokonchi）的双语教育。"}]}],"synonyms":["Poqomchi’","Pocomchi","Poqomchi’ Maya"],"phonetic":"/poʊˈkoʊmtʃi/","extraExplanation":["“Pokonchi”通常是对 **Poqomchi’** 的另一种拼写/转写方式。学术或官方语境里更常见写法是 **Poqomchi’**（末尾的撇号常用来表示原语言里的喉塞音）。","如果你是在特定文章、游戏或社群里看到“pokonchi”，也可能是昵称、用户名或自造词；给我一句原句/出处，我可以帮你判断具体意思与用法。"]}
{"word":"pokunt","summary":{"en":"“pokunt” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“pokunt”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a name, or slang from another language.","zh":"这不是标准英语单词。它可能是拼写错误、人名，或来自其他语言的俚语。"},"examples":[{"en":"I couldn’t find “pokunt” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“pokunt”——你是不是想写别的词？"},{"en":"If you share the sentence where you saw it, I can guess the intended meaning.","zh":"如果你把看到它的句子发我，我可以帮你推测想表达的意思。"}]}],"extraExplanation":["你可能想查的是发音或拼写相近的词，比如：\n- poignant /ˈpɔɪnjənt/（辛酸的、令人感伤的）\n- pocket /ˈpɑkɪt/（口袋）\n- point /pɔɪnt/（要点；指出）\n如果你告诉我：1）你看到它的上下文句子；2）你想表达的中文意思；3）是否是人名/地名/游戏ID，我就能更准确地帮你确认。"]}
{"word":"poky","summary":{"en":"Poky means slow or not very lively, and it can also describe a small, cramped place.","zh":"Poky 表示“慢吞吞、不够利落”，也可形容地方“狭小、局促”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slow, not very lively, or moving in a cautious and slightly annoying way.","zh":"缓慢的；不活跃的；小心翼翼而让人有点不耐烦的。"},"examples":[{"en":"Service can be a bit poky during the lunch rush.","zh":"午餐高峰时服务可能会有点慢。"},{"en":"We took a poky little road through the countryside.","zh":"我们走了一条乡间又窄又慢的小路。"},{"en":"He’s so poky in the morning that he misses the bus.","zh":"他早上动作太慢，结果错过了公交车。"}]},{"partOfSpeech":"adj.","definition":{"en":"Small and unimpressive; cramped or shabby-looking (often about a place).","zh":"（地方等）小而不起眼的；狭窄的；有点破旧寒酸的。"},"examples":[{"en":"They rented a poky apartment near downtown.","zh":"他们在市中心附近租了一间狭小的公寓。"},{"en":"It’s a poky café, but the coffee is great.","zh":"那家咖啡馆地方不大，但咖啡很好喝。"}]}],"synonyms":["slow","sluggish","plodding","cramped","tiny"],"phonetic":"/ˈpoʊki/","extraExplanation":["“poky”在美式英语里常用来形容“慢吞吞的”，也常形容空间“狭小、局促”。在英式英语中也常见，语气通常偏口语、略带抱怨。","容易和“poke”（戳）联想到一起，但“poky”的常用含义主要是“慢/小/局促”，不是“戳”。"]}

