{"word":"pom","summary":{"en":"“Pom” can mean a British person (often informal and sometimes offensive in Australia/NZ) or a short form of “pomegranate.”","zh":"“pom”既可指英国人（澳新常用，语气可能不礼貌），也可作“pomegranate（石榴）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly Australia/New Zealand; sometimes offensive) A British person; an English person.","zh":"（非正式，多用于澳大利亚/新西兰；有时带冒犯性）英国人；英格兰人。"},"examples":[{"en":"In some places, calling someone a “pom” can sound rude, so it’s better to avoid it.","zh":"在一些场合，用“pom”称呼别人可能显得无礼，所以最好避免使用。"},{"en":"He’s a pom who moved to Sydney for work.","zh":"他是个英国人，为了工作搬到悉尼。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “pomegranate,” especially in product names or menus.","zh":"（非正式）“pomegranate（石榴）”的缩写，常见于商品名或菜单。"},"examples":[{"en":"This tea has apple, berry, and pom flavors.","zh":"这款茶有苹果、莓果和石榴口味。"},{"en":"Try the pom juice—it's sweet and slightly tart.","zh":"试试石榴汁——甜中带一点酸。"}]}],"synonyms":["Brit (informal)","British person","pomegranate (for the fruit meaning)"],"phonetic":"/pɑm/","extraExplanation":["“pom”指英国人的用法在澳新比较常见，语气可能从玩笑到贬义不等。因为容易被当作带偏见的称呼，在正式场合或不熟的人之间建议不用。","关于词源有多种说法（例如与“pomegranate”无关的民间解释），但没有一个被普遍、确定地证实。理解为地区性俚语更实用。"]}
{"word":"pomace","summary":{"en":"Pomace is the pressed fruit leftovers (skins, seeds, pulp) after making juice or wine.","zh":"Pomace 指水果榨汁或酿酒后留下的果皮、籽和果肉等固体残渣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The leftover solid material (skins, seeds, and pulp) after fruit—especially grapes or apples—has been pressed for juice or wine.","zh":"（水果，尤指葡萄或苹果）榨汁或酿酒后剩下的固体残渣，如果皮、籽和果肉渣。"},"examples":[{"en":"After pressing the apples, we used the pomace to make compost.","zh":"苹果榨完汁后，我们把果渣用来做堆肥。"},{"en":"In winemaking, grape pomace is what remains after the juice is removed.","zh":"酿酒时，葡萄果渣指的是葡萄汁被取出后剩下的部分。"}]}],"synonyms":["pressed fruit pulp","fruit residue","grape marc","apple marc"],"phonetic":"/ˈpʌməs/","extraExplanation":["“Pomace”常见于食品与农业语境：苹果果渣可用来做饲料、堆肥、果醋或再蒸馏；葡萄果渣在一些地区会再利用来蒸馏成烈酒（如意大利 grappa）。","词源上来自法语/拉丁语系，核心意思就是“压榨之后的残余物”。"]}
{"word":"pomaceae","summary":{"en":"Pomaceae is an older botanical family name for pome-fruit plants (apples, pears, etc.), now usually included in the rose family (Rosaceae).","zh":"Pomaceae 是旧称的“梨果科/苹果科”，指苹果、梨等梨果类植物；现代多并入蔷薇科（Rosaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, older classification) A former plant family name for the group of rose-family plants that produce a pome (apple-like) fruit, such as apples, pears, and quinces; now usually treated as part of the Rosaceae (often as subfamily Maloideae).","zh":"（植物学，旧分类）旧称“梨果科/苹果科”，指结“梨果”（类似苹果的果实）的一类蔷薇科植物，如苹果、梨、榅桲等；现代分类多并入蔷薇科（常作亚科 Maloideae）。"},"examples":[{"en":"In older botany books, apples and pears were sometimes placed in the Pomaceae.","zh":"在较旧的植物学书籍里，苹果和梨有时被归入 Pomaceae（梨果科）。"},{"en":"Many references now list the former Pomaceae within the rose family (Rosaceae).","zh":"现在很多资料把过去的 Pomaceae 归入蔷薇科（Rosaceae）。"}]}],"synonyms":["Maloideae","apple family (informal)","pome-fruit group"],"phonetic":"/poʊˈmeɪsiˌiː/","extraExplanation":["“Pomaceae”来自拉丁语词根 *pomum*（果实/苹果），与英语 *pome*（梨果，如苹果、梨的那类果实）同源。","该名称在现代系统分类中多被视为过时用法：相关植物通常放在蔷薇科（Rosaceae）之下，常见的层级名称是亚科 *Maloideae*（有时也见 *Amygdaloideae* 下的某一支系，取决于分类体系）。","学习时可把它理解为“旧称的苹果/梨这一类果树的家族名”，在历史文献、旧教材或园艺资料中更容易遇到。"]}
{"word":"pomacentrid","summary":{"en":"Pomacentrid refers to (or is) a damselfish—any fish in the family Pomacentridae, including clownfish.","zh":"pomacentrid 指“雀鲷科的（或雀鲷科鱼类）”，即雀鲷/豆娘鱼这一类（包括小丑鱼）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Relating to the fish family Pomacentridae (damselfishes), commonly found in tropical coral reefs.","zh":"（形容词）与雀鲷科（Pomacentridae，常见为雀鲷/豆娘鱼）有关的；雀鲷科的。"},"examples":[{"en":"Clownfish are pomacentrid fishes that often live among sea anemones.","zh":"小丑鱼属于雀鲷科（pomacentrid）鱼类，常常生活在海葵之间。"},{"en":"The survey recorded several pomacentrid species on the reef crest.","zh":"这次调查在礁坪记录到了多种雀鲷科（pomacentrid）物种。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A fish that belongs to the family Pomacentridae; a damselfish (including clownfish).","zh":"（名词）雀鲷科的一种鱼；雀鲷（包括小丑鱼等）。"},"examples":[{"en":"This tiny pomacentrid defends a small patch of coral as its territory.","zh":"这条小小的雀鲷科鱼（pomacentrid）会把一小片珊瑚当作领地来防守。"},{"en":"Many pomacentrids are popular in saltwater aquariums because they are hardy.","zh":"许多雀鲷科鱼（pomacentrids）因较耐养而受海水水族箱玩家欢迎。"}]}],"synonyms":["damselfish","pomacentrid fish","Pomacentridae (technical family name)"],"phonetic":"/ˌpoʊməˈsɛntrɪd/","extraExplanation":["“Pomacentrid”来自拉丁化的科名 Pomacentridae（雀鲷科）。日常英语更常说 damselfish（雀鲷/豆娘鱼）或 clownfish（小丑鱼），而 pomacentrid 多见于生物学、海洋生态与学术写作中。","在珊瑚礁生态里，许多雀鲷科鱼类具有“领地性”（会驱赶其他鱼），有些还会“养藻”（维护藻类作为食物来源），因此常被用来研究珊瑚礁行为与群落结构。"]}
{"word":"pomacentridae","summary":{"en":"Pomacentridae is the scientific family name for damselfishes and clownfishes.","zh":"Pomacentridae 是雀鲷科的科学名称，包含雀鲷与小丑鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small, often brightly colored marine fish that includes damselfishes and clownfishes, common on coral reefs (scientific family name).","zh":"雀鲷科：一种海水鱼类的“科”（科学分类名），多为体型较小、色彩鲜艳的鱼，包括雀鲷和小丑鱼，常见于珊瑚礁。"},"examples":[{"en":"Many reef aquariums feature species from the family Pomacentridae.","zh":"许多珊瑚礁水族箱都会饲养雀鲷科的鱼。"},{"en":"Clownfish belong to Pomacentridae.","zh":"小丑鱼属于雀鲷科。"}]}],"synonyms":["damselfish family","family Pomacentridae"],"phonetic":"/ˌpoʊməˈsɛntrɪˌdiː/","extraExplanation":["“Pomacentridae”是拉丁化的科学名称，写作时首字母大写、整体斜体常见于学术文本（非正式文本可不斜体）。口语或科普中更常说“damselfish family（雀鲷科/雀鲷家族）”。","雀鲷科鱼类多生活在热带、亚热带海域的珊瑚礁附近，常见特征包括体型小、领地性较强；其中小丑鱼与海葵共生的行为在大众文化中很有名。"]}
{"word":"pomacentroid","summary":{"en":"A scientific term for a damselfish-family (Pomacentridae) fish, or something related to that family.","zh":"一个科学用语：指雀鲷科（Pomacentridae）的鱼，或与该科有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A fish that belongs to the family Pomacentridae (the damselfishes, including clownfish and anemonefish).","zh":"（名词）雀鲷科（Pomacentridae）的鱼；雀鲷类鱼（包含小丑鱼、海葵鱼等）。"},"examples":[{"en":"Many pomacentroids are small, brightly colored reef fish.","zh":"许多雀鲷科鱼类体型小、颜色鲜艳，常见于珊瑚礁。"},{"en":"Clownfish are pomacentroids that live in close association with sea anemones.","zh":"小丑鱼属于雀鲷科，常与海葵紧密共生。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to the damselfish family Pomacentridae.","zh":"（形容词）与雀鲷科（Pomacentridae）有关的。"},"examples":[{"en":"The survey recorded pomacentroid species abundance across the reef slope.","zh":"该调查记录了礁坡区域雀鲷科物种的丰度。"},{"en":"Pomacentroid behavior often includes defending a small territory.","zh":"雀鲷科鱼类常表现为守卫小领地的行为。"}]}],"synonyms":["pomacentrid","damselfish"],"phonetic":"/poʊˌmæsənˈtrɔɪd/","extraExplanation":["“pomacentroid”主要见于鱼类学/生态学的学术语境，更常见的相关词是“pomacentrid”（指雀鲷科成员）。","词源上来自科名 Pomacentridae；在论文中常用于分类或群体层级描述（例如“pomacentroid fishes”=雀鲷科鱼类群）。"]}
{"word":"pomacentrus","summary":{"en":"Pomacentrus is a scientific genus name for many reef-dwelling damselfish.","zh":"Pomacentrus 是雀鲷属的学名，指多种生活在珊瑚礁的雀鲷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, colorful damselfish found mainly on coral reefs in the Indo-Pacific.","zh":"雀鲷属（Pomacentrus）：一种主要分布于印度—太平洋珊瑚礁环境的小型、色彩鲜艳的雀鲷科鱼类属。"},"examples":[{"en":"Many Pomacentrus species live close to branching corals for shelter.","zh":"许多雀鲷属（Pomacentrus）的鱼会贴近枝状珊瑚生活，以获得庇护。"},{"en":"A diver spotted a bright blue Pomacentrus guarding its territory.","zh":"一名潜水员看到一条亮蓝色的雀鲷属鱼在守护自己的领地。"}]}],"synonyms":["damselfish (general term)","Pomacentridae (family name)"],"phonetic":"/ˌpoʊməˈsɛntrəs/","extraExplanation":["“Pomacentrus”是生物学拉丁名，常见于学术文章、海洋生物图鉴和水族资料中；日常英语里更常用“damselfish（雀鲷）”。","雀鲷属物种通常体型较小，常见行为包括强烈的领地性、在礁区取食藻类或浮游生物；不同物种外观差异较大（例如蓝色、黄色或带条纹）。","在阅读资料时可留意“genus（属）—species（种）”的写法，例如：Pomacentrus moluccensis（某一具体物种名）。"]}
{"word":"pomaceous","summary":{"en":"Pomaceous describes pome fruits—especially apples and pears—or things related to them.","zh":"pomaceous 指“梨果类（如苹果、梨）”的或与其有关的（偏专业/书面）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling fruits of the apple/pear family (pomes), such as apples, pears, and quinces.","zh":"（与）梨果类（蔷薇科梨果）有关的；像苹果、梨、榅桲等这类果实的。"},"examples":[{"en":"Apples and pears are pomaceous fruits, unlike peaches and cherries.","zh":"苹果和梨属于梨果类（pomaceous）水果，不像桃子和樱桃。"},{"en":"The orchard specializes in pomaceous crops, especially pears.","zh":"这个果园主要种植梨果类作物，尤其是梨。"}]}],"synonyms":["pome","pome-fruit (related)","apple-and-pear (informal)"],"phonetic":"/poʊˈmeɪʃəs/","extraExplanation":["“pomaceous”来自拉丁语 pomum（果实、苹果）加上形容词后缀 -aceous（“……的；类似……的”）。因此它常见于植物学、园艺学、食品与农业写作中。","在日常英语里更常说“apple fruits / pome fruits”或直接说“apples and pears”。“pomaceous”更偏书面、专业。","对比记忆：pome（梨果，如苹果、梨） vs. drupe（核果，如桃、樱桃） vs. berry（浆果，如葡萄、番茄在植物学上也算浆果）。"]}
{"word":"pomaces","summary":{"en":"Pomaces are the leftover fruit solids after pressing for juice, especially from grapes or apples.","zh":"Pomaces 指水果榨汁后剩下的果渣，尤指葡萄或苹果压榨后的残渣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The leftover solid material (skins, seeds, stems, and pulp) after fruit—especially grapes or apples—has been pressed to extract juice.","zh":"（榨汁后留下的）果渣；尤指葡萄或苹果压榨后剩下的果皮、籽、梗和果肉残渣。"},"examples":[{"en":"The winery composts grape pomaces to enrich the soil in its vineyards.","zh":"这家酒庄把葡萄渣堆肥，用来改良葡萄园的土壤。"},{"en":"After pressing apples for cider, the pomaces can be used to feed animals or make vinegar.","zh":"苹果榨汁做苹果酒后，苹果渣可以用来喂动物或做醋。"}]}],"synonyms":["fruit pulp","pressings","marc (grapes)","grape marc","apple pomace"],"phonetic":"/ˈpʌmɪs/","extraExplanation":["“pomaces”是复数形式；单数是“pomace”。在葡萄酒与苹果酒文化中，pomace 很常见：可以拿来蒸馏（如用葡萄渣做 grappa）、做堆肥、提取香气与色素，或作为饲料。","词源来自法语 *pomace*，与“苹果（pomme）”相关的词根有关；因此它最早常指苹果渣，后来也常用于葡萄等水果。"]}
{"word":"pomada","summary":{"en":"“Pomada” is a Spanish word meaning an ointment/medicated cream, and sometimes hair pomade depending on region and context.","zh":"“pomada”是西班牙语，通常指药膏/软膏（外用乳膏），在部分地区和语境中也可指发油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) an ointment or medicated cream applied to the skin; sometimes also a hair pomade.","zh":"（西语）药膏/软膏；涂在皮肤上的乳膏；有时也指发油（发蜡一类）。"},"examples":[{"en":"The pharmacist recommended a pomada for the rash.","zh":"药剂师推荐了一种药膏来治皮疹。"},{"en":"Apply the pomada twice a day to the affected area.","zh":"每天在患处涂两次药膏。"},{"en":"In some countries, people use a pomada to style their hair.","zh":"在一些国家，人们用发油（pomada）来做发型。"}]}],"synonyms":["ointment","cream","balm","pomade"],"phonetic":"/poʊˈmɑːdə/","extraExplanation":["“pomada”主要是西班牙语常用词，在英语环境里多出现在双语标签、拉美文化语境或产品说明中。英语里更常说 ointment（软膏/药膏）、cream（乳膏）、balm（膏/香膏），以及 pomade（发油/发蜡类）。","注意拼写相近：英语 pomade 通常指头发造型产品；而西语 pomada 更常指皮肤用药膏，但在不同地区也可能用于头发产品，需结合包装和使用说明判断。"]}
{"word":"pomade","summary":{"en":"Pomade is a hair-styling product (or the act of applying it) that helps hair look smooth, shiny, and well-shaped.","zh":"Pomade 指发油/发蜡（或抹发油的动作），用于让头发更顺、更有光泽并便于定型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A greasy or waxy product used to style hair, making it look smooth, shiny, and controlled.","zh":"（头发）发油/发蜡：一种油状或蜡状的造型产品，用来让头发更顺、更有光泽、更好定型。"},"examples":[{"en":"He used pomade to slick his hair back for the wedding.","zh":"他用发油把头发往后梳得很服帖，去参加婚礼。"},{"en":"A little pomade can add shine, but too much can look oily.","zh":"一点发油能增加光泽，但太多会显得油腻。"}]},{"partOfSpeech":"v.","definition":{"en":"To apply pomade to hair in order to style it.","zh":"给头发抹发油/发蜡来做造型。"},"examples":[{"en":"She pomaded her hair before the photo shoot.","zh":"拍照前她给头发抹了发油做造型。"}]}],"synonyms":["hair wax","hair grease","hair styling product","hair balm"],"phonetic":"/pəˈmeɪd/","extraExplanation":["“pomade”常见于复古或正式造型语境（如 slick back、side part）。美式文化里也常与“greaser（油头文化）”“barbershop（理发店）”等形象关联。","和“gel（发胶）”相比，pomade通常更偏油/蜡质，质感更柔和；很多产品主打“water-based（水基）”以便清洗。"]}
{"word":"pomaded","summary":{"en":"Pomaded describes hair that has been styled with pomade; it can also be the past form of “pomade” (to apply pomade).","zh":"pomaded 指头发抹了发油/发蜡、显得光亮服帖；也可作动词 pomade 的过去式/过去分词，表示“给头发抹发油/发蜡”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having hair treated with pomade (a scented, oily or waxy hair product), making it look smooth, shiny, and neatly styled","zh":"（头发）涂了发油/发蜡（pomade）而显得光亮、服帖、梳理整齐的"},"examples":[{"en":"He walked in with pomaded hair and a sharp suit.","zh":"他走进来时头发抹了发油，西装笔挺。"},{"en":"Her pomaded curls stayed in place all day.","zh":"她抹了发油的卷发一整天都很稳固。"}]},{"partOfSpeech":"vt.","definition":{"en":"simple past tense and past participle of “pomade”: to apply pomade to (hair) to style it","zh":"“pomade”的过去式/过去分词：给（头发）抹发油/发蜡以便造型"},"examples":[{"en":"He pomaded his hair before the interview.","zh":"面试前他给头发抹了发油。"},{"en":"The actor’s hair was carefully pomaded for the period film.","zh":"为拍这部年代片，演员的头发被仔细地抹上发油做造型。"}]}],"synonyms":["slicked (back)","greased","oiled","well-groomed"],"phonetic":"/pəˈmeɪdəd/","extraExplanation":["“pomade”常让人联想到20世纪中期的复古造型（如slicked-back hair、pompadour），在影视作品里常用来塑造“精心打理、讲究外表”的形象。","用法上，“pomaded hair”偏书面或描写性（narrative/description），日常口语更常说“he has pomade in his hair / he used pomade.”"]}
{"word":"pomaderris","summary":{"en":"Pomaderris is a botanical genus name for shrubs/small trees native mainly to Australia, known for small yellowish flowers and often hairy leaves.","zh":"Pomaderris 是一种植物学属名，指主要原产澳大利亚的灌木或小乔木，常见小黄白花，叶片常带绒毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs or small trees (family Rhamnaceae) native mainly to Australia (and some to New Zealand), often with small yellowish flowers and leaves that may feel woolly or hairy underneath","zh":"一种灌木或小乔木属（鼠李科），主要原产澳大利亚（少数分布于新西兰），常见小型黄白色花，叶背常有绒毛或毛被"},"examples":[{"en":"Pomaderris shrubs can be common in Australian bushland after rain.","zh":"在澳大利亚的灌木丛中，雨后常能看到一些pomaderris灌木。"},{"en":"The reserve has several Pomaderris species with clusters of tiny yellow flowers.","zh":"这个保护区里有好几种pomaderris，会开成簇的细小黄色花。"}]}],"synonyms":["yellowwood","Australian hazel"],"phonetic":"/poʊməˈdɛrɪs/","extraExplanation":["“Pomaderris”多作为植物学的拉丁属名使用，日常英语里通常不作为常用词；在澳大利亚本地语境中，人们有时会用某些物种的俗名（如 *yellowwood*、*Australian hazel* 等）来指代。","发音上常按英语对拉丁学名的习惯读作 /poʊ-mə-DER-iss/。","如果你在自然观察/园艺资料中遇到它，通常是在物种名的组合里出现，如 *Pomaderris apetala*（某一具体物种）。"]}
{"word":"pomades","summary":{"en":"“Pomades” are hair-styling products (plural of pomade), and the verb can mean to apply pomade to hair.","zh":"“pomades”是“pomade（发油/发蜡）”的复数；作动词时可表示“抹发油/发蜡给头发做造型”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hair products (usually oily or waxy) used to style hair and add shine; plural of “pomade.”","zh":"（通常为油性或蜡质的）发用定型/护发产品，用来造型并增加光泽；“pomade”的复数。"},"examples":[{"en":"He keeps a few pomades in his bag for different hairstyles.","zh":"他包里放着几款发油/发蜡，用来做不同发型。"},{"en":"Traditional pomades often give hair a glossy, slick look.","zh":"传统发油常常会让头发呈现有光泽的“油头”效果。"}]},{"partOfSpeech":"v.","definition":{"en":"To apply pomade to hair (or the scalp) to style it.","zh":"给头发（或头皮）抹发油/发蜡以便造型。"},"examples":[{"en":"He pomades his hair before leaving for work.","zh":"他上班前会抹发油整理头发。"}]}],"synonyms":["hair pomade","hair wax","hair gel","styling cream","hair product"],"phonetic":"/pəˈmɑd/","extraExplanation":["“pomade”一词来自法语 pommade，历史上最早常指含香料的软膏/油膏；后来在英语里更常专指“头发造型用的发油/发蜡”。在复古男士发型（如 slick back、pompadour）文化中很常见。"]}
{"word":"pomading","summary":{"en":"Pomading means applying pomade to hair, or the act of doing so.","zh":"Pomading 指给头发涂抹发油/发蜡，或指这一行为本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of applying pomade (a greasy or waxy hair product) to someone’s hair","zh":"（给头发）涂抹发油/发蜡的行为"},"examples":[{"en":"His pomading took longer than his shower.","zh":"他抹发油花的时间比洗澡还长。"},{"en":"The actor sat patiently during the pomading before the scene.","zh":"拍戏前抹发油时，那位演员耐心地坐着。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of pomade: to apply pomade to hair","zh":"pomade 的现在分词：给头发涂抹发油/发蜡"},"examples":[{"en":"She was pomading her hair to keep it neat in the wind.","zh":"她在抹发油，让头发在风里也保持整齐。"},{"en":"He’s pomading the sides for a classic slicked-back look.","zh":"他在两侧抹发油，做出经典的背头造型。"}]}],"synonyms":["applying pomade","greasing (hair)","slicking (hair)","styling (hair)"],"phonetic":"/poʊˈmeɪdɪŋ/","extraExplanation":["“pomade”常指带油脂或蜡质的定型产品，带有一点复古气息（比如油头、背头造型）。在现代口语里，人们更常说“put on pomade / apply pomade / use hair gel(wax)”等；“pomading”作为名词用法比较少见，多出现在较文学化或描述性较强的语境中。"]}
{"word":"pomak","summary":{"en":"Pomak refers to a Balkan Muslim community, often Bulgarian-speaking, and can also describe things related to that community.","zh":"Pomak 指巴尔干地区一个常说保加利亚语的穆斯林社群，也可作形容词表示“与波马克人相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a South Slavic (often Bulgarian-speaking) Muslim community living mainly in the Balkans (especially Bulgaria, Greece, and Turkey)","zh":"波马克人；巴尔干地区的一个南斯拉夫（常为保加利亚语系）穆斯林族群，主要分布在保加利亚、希腊和土耳其"},"examples":[{"en":"Some Pomaks in the Rhodope Mountains speak a Bulgarian dialect at home.","zh":"罗多彼山脉的一些波马克人在家里说一种保加利亚语方言。"},{"en":"The museum has an exhibit on Pomak traditions and clothing.","zh":"博物馆有一个关于波马克人传统与服饰的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pomaks or their language, culture, or communities","zh":"与波马克人（或其语言、文化、社群）有关的"},"examples":[{"en":"Researchers collected Pomak folk songs from several villages.","zh":"研究人员从几个村庄收集了波马克民歌。"},{"en":"She is studying Pomak history in the context of the Ottoman Empire.","zh":"她在奥斯曼帝国的背景下研究波马克人的历史。"}]}],"synonyms":["Bulgarian Muslim (context-dependent)","Slavic Muslim (context-dependent)"],"phonetic":"/ˈpoʊmɑk/","extraExplanation":["“Pomak”在不同国家与语境中可能带有身份与政治敏感性：有人把它当作族群名称，也有人更倾向用“保加利亚语穆斯林”“罗多彼穆斯林”等表述。写作或交流时，最好尊重当事人的自我认同（self-identification）。","词源与确切含义有多种说法（学界并无完全一致结论）。在正式写作中，可补充地理范围（如 Rhodope Mountains）或语言背景，以避免误解。"]}
{"word":"pomander","summary":{"en":"A pomander is a scented ball or container, or an orange stuck with cloves, used to give off a pleasant smell.","zh":"pomander 指用来散发香味的香囊/香球，也可指插满丁香的橙子香球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small ball, pouch, or container holding sweet-smelling substances (like herbs or spices), used to perfume the air or clothing.","zh":"（装香料、香草等的）香囊；香球；香料盒，用来散发香味、给空气或衣物增香。"},"examples":[{"en":"In the old painting, the lady carries a pomander on a chain.","zh":"在那幅古画里，那位女士用链子挂着一个香囊。"},{"en":"People once used pomanders to cover bad smells in crowded streets.","zh":"过去人们曾用香囊来遮盖拥挤街道里的异味。"}]},{"partOfSpeech":"n.","definition":{"en":"A round orange studded with cloves and used as a natural air freshener, especially around holidays.","zh":"（常指）插满丁香的橙子香球（天然香氛/空气清新物，节日期间常见）。"},"examples":[{"en":"We made a pomander by pushing cloves into an orange.","zh":"我们把丁香一颗颗插进橙子里，做了一个橙子香球。"},{"en":"The pomander made the room smell warm and spicy.","zh":"这个橙子香球让房间闻起来温暖又带点香料味。"}]}],"synonyms":["sachet","fragrance pouch","clove-studded orange","potpourri (related)"],"phonetic":"/ˈpɑːmændɚ/","extraExplanation":["“pomander”来自中古法语 *pomme d’ambre*，字面意思是“琥珀苹果”（这里的“琥珀”多指龙涎香等香料）。早期的pomander常是金属镂空小盒，里面放香料与树脂，贵族会随身佩戴。","在欧洲中世纪到文艺复兴时期，pomander也被当作防疫或避“瘴气”的护身香包（当时人们认为香气能驱散疾病）。这种观念属于历史背景，并不代表现代医学观点。","文学/戏剧里常见这一意象：莎士比亚《罗密欧与朱丽叶》中提到“pomander”，用来表现人物随身携带香物、掩盖异味或营造时代氛围。"]}
{"word":"pomanders","summary":{"en":"Pomanders are scented balls or small containers of spices/perfume, historically carried or worn to smell pleasant and mask bad odors.","zh":"Pomanders 指装有香料或香水等的香囊/香丸，历史上常随身携带或佩戴，用来散香并遮掩异味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small ball, case, or sachet that contains sweet-smelling substances (like spices or perfume), traditionally carried or worn to mask bad smells and for comfort.","zh":"（传统）香囊／香丸：装有香料或香水等芳香物的球状物、盒子或小袋，过去常随身携带或佩戴，用来遮掩异味、提神安神。"},"examples":[{"en":"In the museum, we saw a silver pomander that once held cloves and ambergris.","zh":"在博物馆里，我们看到一个银制香丸（香囊盒），里面过去装过丁香和龙涎香。"},{"en":"People in crowded cities sometimes carried pomanders to cover unpleasant odors.","zh":"在拥挤的城市里，人们有时会随身带香囊来遮掩难闻的气味。"}]},{"partOfSpeech":"other","definition":{"en":"Plural form of pomander.","zh":"pomander 的复数形式。"},"examples":[{"en":"The costume designer added pomanders to the actors’ belts for a Renaissance look.","zh":"服装设计师把几个香囊挂在演员的腰带上，营造文艺复兴时期的感觉。"}]}],"synonyms":["sachet","potpourri (related)","perfume pouch","scented charm"],"phonetic":"/ˈpɑːmændɚ/","extraExplanation":["词源：来自中古法语/法语短语 pom(me) d’ambre（“琥珀苹果”），原指用龙涎香（ambergris）等香料做成的“香球”。后来泛指各种装香料的小球或香囊盒。","文化背景：在中世纪到文艺复兴时期，城市卫生条件较差，强烈香味被用来“压过”异味，也有人相信香料能抵御疾病（这属于当时的观念，并非现代医学结论）。","相关搭配：a pomander ball（装香料的香球）、orange pomander（把丁香插进橙子里做成的香橙香球，常见于节日装饰）。"]}
{"word":"pomane","summary":{"en":"“pomane” isn’t a standard English word; it’s likely a misspelling (often “pomade” or “Pomona”).","zh":"“pomane”不是标准英语单词；很可能是拼写错误（常见为“pomade”或“Pomona”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “pomade” (hair styling product) or “Pomona” (a name/place name).","zh":"不是标准英语单词。很可能是拼写错误，常见可能是“pomade”（发油/发蜡等造型产品）或“Pomona”（人名/地名）。"},"examples":[{"en":"I couldn’t find “pomane” in a dictionary—did you mean “pomade”?","zh":"我在词典里找不到“pomane”——你是不是想写“pomade”？"},{"en":"If you mean the city in California, the spelling is “Pomona.”","zh":"如果你指的是加州的城市，拼写是“Pomona”。"}]}],"phonetic":"/poʊˈmeɪn/","extraExplanation":["“pomane”在常用英语里基本不出现，因此更像是拼写错误。","如果你想查的是“pomade”：常指带油性/蜡质的头发造型用品，能让头发更服帖、更有光泽。","如果你想查的是“Pomona”：来源于罗马神话中掌管果树与丰收的女神Pomona，英语里常用作人名或地名。"]}
{"word":"pomard","summary":{"en":"Pomard is a Burgundy village/appellation name and the red wine made there, typically Pinot Noir.","zh":"Pomard 是勃艮第的村庄/法定产区名，也指该地产的红葡萄酒（多为黑皮诺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A red wine (or the wine-producing village/appellation) from Pomard in Burgundy, France, known especially for Pinot Noir wines.","zh":"波玛（Pomard）：法国勃艮第产区的一个村庄/法定产区名，也指该地产的葡萄酒（多为黑皮诺干红），以酒体较扎实著称。"},"examples":[{"en":"We ordered a bottle of Pomard to pair with roast duck.","zh":"我们点了一瓶波玛红酒来配烤鸭。"},{"en":"If you like structured Burgundy, try a Pomard from a good vintage.","zh":"如果你喜欢结构感更强的勃艮第，可以试试好年份的波玛。"}]}],"synonyms":["Burgundy (wine)","Pinot Noir (from Burgundy)"],"phonetic":"/poʊˈmɑːr/","extraExplanation":["Pomard 位于法国勃艮第的 Côte de Beaune（伯恩丘）一带，传统上以黑皮诺（Pinot Noir）为主。与一些更“柔美”的勃艮第红相比，Pomard 常被描述为更有骨架、单宁更明显、适合搭配肉类与熟成。","在英文酒单或品鉴笔记中，Pomard 既可能指“产区/村庄”（the village/appellation of Pomard），也可能直接指“一瓶来自该产区的酒”（a Pomard）。"]}
{"word":"pomarine","summary":{"en":"Pomarine usually describes the pomarine skua, an Arctic seabird; it’s mostly used in the name “pomarine skua.”","zh":"pomarine 通常用于指“中贼鸥（pomarine skua）”这种北极海鸟；多见于鸟名搭配中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pomarine skua, a large seabird of the Arctic; used mainly in the phrase “pomarine skua.”","zh":"与“中贼鸥（pomarine skua）”有关的；主要用于短语“pomarine skua”，指一种生活在北极地区的大型海鸟。"},"examples":[{"en":"We spotted a pomarine skua chasing gulls over the waves.","zh":"我们看到一只中贼鸥在海浪上追逐海鸥。"},{"en":"The guide pointed out the bird’s features: “That’s a pomarine skua.”","zh":"向导指出这只鸟的特征说：“那是中贼鸥。”"}]},{"partOfSpeech":"n.","definition":{"en":"A pomarine skua (used less commonly as a noun).","zh":"中贼鸥（较少见的名词用法）。"},"examples":[{"en":"A pomarine was seen farther offshore than the other skuas.","zh":"有人看到一只中贼鸥在更远的近海处，离其他贼鸥更远。"}]}],"synonyms":["pomarine skua (common full term)"],"phonetic":"/ˈpɑːməˌriːn/","extraExplanation":["“Pomarine”在日常英语里很少单独使用，最常见、最自然的搭配是专有名词式的“pomarine skua”。观鸟、自然纪录片、野外图鉴里更常见。","词源上与法语/拉丁语系有关，常被解释为与“苹果（pome）”相关的形状联想（用来描述该鸟繁殖期尾羽形态的印象），但学习时记住它几乎只出现在鸟名里就够用了。"]}
{"word":"pomarium","summary":{"en":"Pomarium means an orchard or fruit garden, a rare/learned word used mostly in historical or literary contexts.","zh":"pomarium 指“果园/果树园”，属于较少见、偏历史或文学语境的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An orchard or fruit garden (a place where fruit trees are grown), especially in older or academic writing.","zh":"果园；果树园（种植果树的地方），多见于较古老或学术性的用法。"},"examples":[{"en":"Behind the monastery was a small pomarium with apples and pears.","zh":"修道院后面有一座小果园，种着苹果和梨。"},{"en":"The historian describes the estate’s pomarium as carefully walled to protect the trees.","zh":"历史学家描述这座庄园的果园用围墙精心围起，以保护果树。"}]}],"synonyms":["orchard","fruit garden","fruit orchard"],"phonetic":"/poʊˈmɛriəm/","extraExplanation":["“pomarium”源自拉丁语：pomum（果实）+ -arium（表示“场所”的后缀），字面意思就是“果树/果实的园地”。","在英语里它很少用于日常口语，更常出现在描写古罗马、修道院园艺、或古典/文学风格的文本中；现代英语通常直接说“orchard”。"]}
{"word":"pomary","summary":{"en":"“Pomary” is a rare word meaning an orchard, especially an apple orchard.","zh":"“pomary”是个很少见的词，意思是果园，尤其指苹果园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) an orchard, especially an apple orchard.","zh":"（罕见/较古旧）果园，尤指苹果园。"},"examples":[{"en":"In autumn, the village pomary filled the air with the smell of ripe apples.","zh":"到了秋天，村里的苹果园里飘着熟苹果的香味。"},{"en":"They walked past a small pomary behind the farmhouse.","zh":"他们走过农舍后面的一小片果园。"}]}],"synonyms":["orchard","apple orchard"],"phonetic":"/ˈpoʊməˌri/","extraExplanation":["“pomary”在现代英语中非常少见，更常用的词是“orchard”（果园）。","词源与拉丁语“pomarium”（果园）有关，其中“pom-”与“apple/fruit（苹果/水果）”相关；同源词还有“pomology”（果树学、果品学）。","如果你本来想写的是“primary”（主要的/初级的）或其他拼法相近的词，请告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"pomate","summary":{"en":"Pomate is usually a misspelling of “pomade,” a hair-styling product; it can also mean to apply it to hair.","zh":"Pomate 通常是 “pomade” 的误拼，指发油/发蜡等定型产品；也可作动词表示给头发抹发油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “pomade”) a scented, oily or waxy substance used to style hair or to make hair/skin look smooth and shiny.","zh":"（更常见拼写为 pomade）一种带香味的油性或蜡状产品，用于定型头发，或让头发/皮肤更光滑、有光泽。"},"examples":[{"en":"He put a little pomade in his hair before going out.","zh":"他出门前在头发上抹了一点发油（pomade）。"},{"en":"This pomade gives a strong hold and a glossy finish.","zh":"这款发油定型力强，而且很有光泽。"}]},{"partOfSpeech":"vt.","definition":{"en":"To apply pomade to (hair) to style it.","zh":"给（头发）抹发油以定型。"},"examples":[{"en":"She pomaded her hair into a neat side part.","zh":"她把头发抹上发油，梳成整齐的偏分。"}]}],"synonyms":["pomade","hair wax","hair gel","styling cream"],"phonetic":"/pəˈmeɪd/","extraExplanation":["“pomate”多见于拼写误写或少见变体；现代英语里更标准、更常用的是“pomade”。","词源来自法语 *pommade*（原指用苹果等制成的软膏/油膏），后来引申为头发造型用的发油。"]}
{"word":"pomato","summary":{"en":"Pomato usually refers to a grafted plant that yields tomatoes above ground and potatoes below, and it can also mean a playful blend of “potato” and “tomato.”","zh":"Pomato 通常指通过嫁接让同一株植物地上结番茄、地下长土豆的植株；也可指“potato + tomato”的玩笑式混成词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant produced by grafting a tomato plant onto a potato plant so that it can grow tomatoes above ground and potatoes underground (not a true genetic hybrid).","zh":"把番茄植株嫁接到马铃薯植株上形成的“番茄-土豆”组合植株：地上结番茄、地下长土豆（并非真正的基因杂交）。"},"examples":[{"en":"The pomato produced tomatoes on the vines and potatoes in the soil.","zh":"这种番茄土豆植株藤上结番茄，土里长土豆。"},{"en":"A pomato is made by grafting, not by mixing the genes of tomato and potato.","zh":"番茄土豆是通过嫁接做出来的，不是把番茄和土豆的基因混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"an informal portmanteau word formed from “potato” + “tomato,” used in jokes or casual writing.","zh":"由“potato + tomato”拼合而成的非正式混成词，常用于玩笑或随笔。"},"examples":[{"en":"He joked that dinner was a “pomato” dish—half potato, half tomato.","zh":"他开玩笑说晚餐是“番茄土豆菜”——一半土豆一半番茄。"}]}],"synonyms":["potato-tomato plant","tomato-potato graft","grafted tomato-potato"],"phonetic":"/poʊˈmeɪtoʊ/","extraExplanation":["“Pomato”常被误认为是把番茄和土豆“杂交”出来的新物种；实际上更常见的是园艺嫁接：利用两者同属茄科（Solanaceae）的亲缘关系，让它们在同一株植物上分别结果与结薯。","网络上流传过“科学家培育出番茄土豆怪植物”的夸张说法；教学或科普语境里常用它来说明：嫁接≠转基因/杂交，嫁接不会把两种作物的基因真正融合成一个新物种。"]}
{"word":"pomatoes","summary":{"en":"“pomatoes” is usually a misspelling of “tomatoes”; rarely, it can mean the plural of “pomato.”","zh":"“pomatoes”通常是“tomatoes”的误拼；少数情况下也可指“pomato”的复数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling of “tomatoes” (plural of tomato).","zh":"（非标准）“tomatoes”（tomato 的复数，番茄/西红柿）的常见拼写错误。"},"examples":[{"en":"Did you mean “tomatoes”? (Not “pomatoes.”)","zh":"你是想说“tomatoes”吗？（不是“pomatoes”。）"},{"en":"I bought tomatoes for the salad.","zh":"我买了西红柿/番茄做沙拉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The plural of “pomato”: a plant (often created by grafting) that can produce tomatoes above ground and potatoes underground.","zh":"（少见）“pomato”的复数：一种（常通过嫁接得到的）植株，地上结番茄、地下长土豆。"},"examples":[{"en":"Some gardeners try pomatoes for fun, but results vary.","zh":"有些园艺爱好者会尝试种“pomatoes”图个新鲜，但效果不一定稳定。"}]}],"synonyms":["tomatoes","pomato (rare)"],"phonetic":"/təˈmeɪtoʊz/","extraExplanation":["“pomato”一词是由 potato 和 tomato 拼合而来（portmanteau/混成词）。不过日常英语里更常见的是 tomatoes（西红柿/番茄），而 pomato 相对少见，更多见于园艺话题。"]}
{"word":"pomatomid","summary":{"en":"Pomatomid means a fish in the Pomatomidae family, especially the bluefish, mainly used in scientific contexts.","zh":"Pomatomid 指鲭科（Pomatomidae）的鱼类，尤指蓝鱼，主要用于科研或专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish of the family Pomatomidae, especially the bluefish; used mainly in scientific or technical contexts","zh":"鲭科（Pomatomidae）的鱼类，尤指蓝鱼；多用于科学或专业语境"},"examples":[{"en":"The paper compares growth rates of pomatomids in different coastal habitats.","zh":"这篇论文比较了不同沿海栖息地中鲭科鱼类的生长速度。"},{"en":"Bluefish is the best-known pomatomid in the Atlantic.","zh":"蓝鱼是大西洋中最知名的鲭科鱼类。"}]}],"synonyms":["bluefish","Pomatomidae (technical family name)"],"phonetic":"/ˈpoʊməˌtɑmɪd/","extraExplanation":["“pomatomid”属于生物分类学用词，常见于渔业、生物学与生态学文章；日常英语里更常直接说“bluefish（蓝鱼）”。","词源来自拉丁化的科名 Pomatomidae；在写作中常作为形容词式用法出现（例如“pomatomid species”），但语法上仍多按名词理解：指“鲭科成员/鲭科鱼类”。"]}
{"word":"pomatomidae","summary":{"en":"Pomatomidae is the scientific name for the fish family that includes the bluefish.","zh":"Pomatomidae 是包含蓝鱼在内的一个鱼类科的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family of marine fish that includes the bluefish (Pomatomus saltatrix).","zh":"（生物）鲭鲹科：一类海洋鱼类的科级分类单位，其中最著名的成员是蓝鱼（Pomatomus saltatrix）。"},"examples":[{"en":"The bluefish belongs to the family Pomatomidae.","zh":"蓝鱼属于鲭鲹科（Pomatomidae）。"},{"en":"Researchers compared jaw structure across Pomatomidae and related fish families.","zh":"研究人员比较了鲭鲹科与相关鱼类科的颌部结构。"}]}],"synonyms":["bluefish family"],"phonetic":"/ˌpoʊməˈtoʊməˌdiːdiː/","extraExplanation":["“Pomatomidae”是拉丁化的科学名称，常见于动物学、渔业学与生态学论文中；日常英语里更常直接说“bluefish”（蓝鱼），而不是用科名。","该科在现代分类中通常被认为成员很少（在许多资料里主要指蓝鱼及其近缘/历史分类），不同资料对其范围可能略有差异；阅读时可结合具体的分类系统或文献版本。"]}
{"word":"pomatomus","summary":{"en":"Pomatomus is the scientific genus name for the bluefish.","zh":"Pomatomus 是蓝鱼的科学属名（蓝鱼属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the bluefish (especially the species *Pomatomus saltatrix*)","zh":"蓝鱼属（蓝鱼的科学属名，常指蓝鱼这一物种 *Pomatomus saltatrix*）"},"examples":[{"en":"Bluefish are classified in the genus *Pomatomus*.","zh":"蓝鱼在分类学上属于蓝鱼属 *Pomatomus*。"},{"en":"The species name is *Pomatomus saltatrix*.","zh":"它的物种学名是 *Pomatomus saltatrix*。"}]}],"synonyms":["bluefish (common name)"],"phonetic":"/ˌpoʊməˈtoʊməs/","extraExplanation":["这是一个“学名/拉丁学名”（scientific Latin），通常首字母大写并用斜体：*Pomatomus*。日常英语里人们更常说 common name “bluefish”（蓝鱼）。","在生物分类中，属名（genus）位于科（family）之下、种（species）之上；写法一般为“属名 + 种加词”，例如 *Pomatomus saltatrix*。"]}
{"word":"pomatorhine","summary":{"en":"Pomatorhine describes (or names) a bird with a horny, scale-like covering near the nostrils at the base of the upper beak, especially the pomatorhine/pomarine jaeger.","zh":"Pomatorhine 用来形容（或指称）喙基部鼻孔附近带角质鳞片状覆盖物的鸟，尤指角鼻贼鸥（pomatorhine/pomarine jaeger）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology, especially birds) Having a horny, scale-like covering at the base of the upper beak (near the nostrils).","zh":"（动物学，尤指鸟类）上喙基部（靠近鼻孔处）具有角质、鳞片状覆盖物的。"},"examples":[{"en":"Older bird guides describe the pomatorhine jaeger as having a swollen, shield-like area at the base of the bill.","zh":"一些较早的鸟类图鉴会把“pomatorhine jaeger（角鼻贼鸥）”描述为喙基部有肿胀、像盾牌一样的角质区域。"},{"en":"The term pomatorhine is used in technical descriptions of certain seabirds’ bills.","zh":"“pomatorhine”常用于某些海鸟喙部的专业描述中。"}]},{"partOfSpeech":"n.","definition":{"en":"A pomatorhine bird, especially the pomatorhine (pomarine) jaeger.","zh":"角鼻鸟（尤指角鼻贼鸥，即 pomarine jaeger）。"},"examples":[{"en":"We spotted a pomatorhine offshore during migration season.","zh":"迁徙季节我们在近海看见了一只角鼻贼鸥。"}]}],"synonyms":["pomarine","jaeger","skua"],"phonetic":"/ˌpoʊməˈtɔːraɪn/","extraExplanation":["词源来自希腊语：pōma（盖子、覆盖物）+ rhis/rhin-（鼻）。意思是“鼻部有覆盖物”，引申到“喙基部/鼻孔附近有角质覆盖”。","该词在现代日常英语中非常少见，多见于鸟类学或旧式分类/形态学描述。更常见的写法与名称是 pomarine（如 pomarine jaeger）。"]}
{"word":"pomatum","summary":{"en":"Pomatum is an old-fashioned word for a scented greasy ointment used especially for hair styling.","zh":"pomatum 指一种较旧称呼的香膏/发油，主要用于头发造型定型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scented ointment or greasy substance used to style hair or soften the skin (an older-fashioned word, similar to hair pomade).","zh":"（较旧用法）香膏、油膏；用于梳理定型头发或滋润皮肤的油性香膏（类似发油/发蜡 pomade）。"},"examples":[{"en":"He slicked his hair back with pomatum before going out.","zh":"他出门前用香膏把头发往后梳得很服帖。"},{"en":"The old barbershop smelled of pomatum and aftershave.","zh":"那家老理发店闻起来有发油和须后水的味道。"}]}],"synonyms":["pomade","hair grease","ointment","unguent"],"phonetic":"/pəˈmeɪtəm/","extraExplanation":["“pomatum”在现代英语里偏复古，常出现在描写19—20世纪初的文学、历史或老式理发店场景中；日常更常说“pomade”。","词源来自法语 *pommade*（原指用苹果香料做的软膏），所以带有“香味的膏状物”的传统联想。"]}
{"word":"pomatums","summary":{"en":"Pomatum is an old-fashioned word for a scented oily hair-styling product (pomade).","zh":"Pomatum 是“发油/发蜡”的旧式说法，相当于 pomade。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scented oily substance used to style hair (an older word for pomade/hair dressing)","zh":"（旧词）发油；发蜡；用于梳理定型的香味油膏（相当于 pomade）"},"examples":[{"en":"He smoothed pomatum through his hair before the party.","zh":"聚会前，他把发油抹在头发上梳理得很服帖。"},{"en":"The barber’s shop smelled of soap and pomatum.","zh":"那家理发店闻起来有肥皂和发油的味道。"}]}],"synonyms":["pomade","hair dressing","hair grease","hair oil"],"phonetic":"/pəˈmeɪtəm/","extraExplanation":["你输入的“pomatums”通常是复数形式，单数是 pomatum。现代英语里更常用 pomade 或 hair gel/ hair wax；pomatum 带有“老式、复古”的语感，常出现在描写旧时绅士打理头发的场景中。","词源上与“apple（苹果）”有关：早期配方里常用苹果泥或苹果香料做基底，因此名称来自拉丁语 pomum（水果/苹果）。"]}
{"word":"pombe","summary":{"en":"Pombe is a Swahili word meaning beer, often referring to traditional homemade grain beer in East Africa.","zh":"Pombe是斯瓦希里语，意思是啤酒，常指东非的传统谷物自酿啤酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(East Africa, from Swahili) Beer—often traditional homemade beer made from grains like millet, sorghum, or maize.","zh":"（东非用语，源自斯瓦希里语）啤酒；也常指用小米/高粱/玉米等谷物自酿的传统啤酒。"},"examples":[{"en":"In Tanzania, some villages still brew pombe for weddings and community celebrations.","zh":"在坦桑尼亚，一些村庄仍会在婚礼和社区庆典时酿制pombe。"},{"en":"He offered the guests a calabash of pombe as a sign of welcome.","zh":"他端上一葫芦瓢的pombe招待客人，以示欢迎。"},{"en":"The researcher studied how pombe is made and shared in rural areas.","zh":"研究者考察了乡村地区pombe的酿造方式与分享习俗。"}]}],"synonyms":["beer","traditional beer","millet beer","sorghum beer"],"phonetic":"/ˈpɑm.beɪ/","extraExplanation":["“pombe”在东非日常口语里很常见，含义通常就是“啤酒”。在一些语境中它不特指工业啤酒，而更偏向“自酿的谷物酒”，可能带有发酵味更浓、酒精度和口感因家庭配方而差异很大的特点。","在旅行或阅读非洲题材作品时看到“pombe”，可以根据上下文判断：如果出现“brew（酿）/calabash（葫芦瓢）/millet or sorghum（小米或高粱）/village（村庄）”等词，多半指传统自酿酒。"]}
{"word":"pombo","summary":{"en":"“Pombo” is mainly Portuguese for “pigeon,” and it can also appear as a Portuguese surname or name.","zh":"“pombo”主要是葡萄牙语里“鸽子”的意思，也常见作葡语姓氏或名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Portuguese) a pigeon; sometimes also used for a dove.","zh":"（葡萄牙语）鸽子；有时也可泛指“鸠/鸽”（类似 dove）"},"examples":[{"en":"In Portuguese, “pombo” means “pigeon.”","zh":"在葡萄牙语里，“pombo”意思是“鸽子”。"},{"en":"I saw a pombo in the square while traveling in Brazil.","zh":"我在巴西旅行时在广场上看到一只鸽子（pombo）。"}]},{"partOfSpeech":"other","definition":{"en":"a surname, nickname, or brand/name taken from Portuguese (often seen in Brazilian or Portuguese contexts).","zh":"源自葡萄牙语的姓氏、昵称或品牌/名称（常见于巴西或葡语文化语境）"},"examples":[{"en":"Pombo is a common surname in Portuguese-speaking communities.","zh":"Pombo 是葡语社群里较常见的姓氏之一。"}]}],"synonyms":["(for the animal, in English) pigeon","(closer in meaning) dove"],"phonetic":"/ˈpoʊmboʊ/","extraExplanation":["发音小提示：葡萄牙语的“pombo”里常见鼻化音（拼写不一定标出来），实际听起来可能更像“POM-boo”（第二个音节更弱），不同地区口音会有差异。","文化/词汇延伸：你可能会看到“pombo-correio”，意思是“信鸽/传信鸽”（correio=邮政/邮件）。","语域提醒（巴西葡语）：在某些口语里“pombo”也可能被用作粗俗俚语（指男性生殖器）。正式场合建议只用作“鸽子”的字面义，或改用更中性的表达。"]}
{"word":"pome","summary":{"en":"A “pome” is a type of fruit with a seed core, like an apple or a pear; it can also be a poetic word for fruit (especially an apple).","zh":"“pome”指一种有果核的果实（梨果），如苹果或梨；也可作诗意用词指水果（尤指苹果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fruit with a core containing several seeds, surrounded by firm flesh; typical examples are apples and pears.","zh":"梨果（有果核、内含多颗种子、外层为较硬果肉的果实；典型如苹果和梨）"},"examples":[{"en":"Apples and pears are classic examples of a pome.","zh":"苹果和梨是典型的梨果。"},{"en":"In botany class, we learned that a pome has a central core with seeds.","zh":"在植物学课上，我们学到梨果的种子在中央果核里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Poetic or literary) A fruit, especially an apple.","zh":"（诗歌/文学用语）水果，尤指苹果"},"examples":[{"en":"In old poems, “pome” may be used as a poetic word for an apple.","zh":"在一些古老诗歌中，“pome”可能作为“苹果”的诗意说法。"}]}],"synonyms":["apple (poetic sense)","fruit (poetic sense)","pome fruit (category)"],"phonetic":"/poʊm/","extraExplanation":["“pome”常见于植物学/园艺语境，来自拉丁语 *pomum*（水果、果实）。日常英语里通常直接说 *apple* 或 *pear*，而不是用 *pome*。","文学里你可能会看到 *golden pome*（金苹果）这类表达，常用来营造古典、神话或诗意的氛围。"]}
{"word":"pomegranate","summary":{"en":"A pomegranate is a thick-skinned fruit full of many red, juicy seeds.","zh":"pomegranate 指石榴：外皮厚、内含许多红色多汁籽的水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a round fruit with a thick reddish skin, containing many small red seeds (arils) inside","zh":"石榴：一种圆形水果，外皮厚且多为红色，里面有许多红色小籽（假种皮/汁囊）"},"examples":[{"en":"She added pomegranate seeds to the salad for a sweet, tart flavor.","zh":"她在沙拉里加了石榴籽，让味道又甜又微酸。"},{"en":"Pomegranate juice can stain, so be careful with light-colored clothes.","zh":"石榴汁容易染色，所以穿浅色衣服时要小心。"}]}],"synonyms":["fruit","pomegranate fruit"],"phonetic":"/ˈpɑməˌɡrænɪt/","extraExplanation":["“pomegranate”来自拉丁语 pōmum（苹果/果实）+ grānātum（多籽的），字面意思接近“多籽的果实”。","石榴在多种文化中常象征丰饶、生命与繁盛；在文学与艺术里也常因“籽多”而被用作繁衍与富足的意象。","英语里常见搭配：pomegranate seeds（石榴籽）, pomegranate juice（石榴汁）, pomegranate molasses（石榴糖浆/浓缩汁）。"]}
{"word":"pomegranates","summary":{"en":"Pomegranates are round fruits with thick skin and many juicy red seeds inside.","zh":"pomegranates 指石榴：外皮较厚、里面有许多多汁红色籽粒的水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reddish-brown round fruit with a thick skin and many juicy red seeds (arils) inside, often eaten fresh or used for juice.","zh":"石榴（果实）：外皮较厚、呈红褐色的圆形水果，内部有许多多汁的红色籽粒（假种皮），常直接食用或榨汁。"},"examples":[{"en":"She sprinkled pomegranate seeds on the salad for color and crunch.","zh":"她把石榴籽撒在沙拉上，增加颜色和口感。"},{"en":"Pomegranates are often used to make juice or syrup.","zh":"石榴常被用来榨汁或做成果汁糖浆。"},{"en":"In winter, pomegranates can be a popular seasonal fruit in many markets.","zh":"冬天在很多市场里，石榴是很受欢迎的时令水果。"}]}],"synonyms":["pomegranate fruit","pomegranate arils","pomegranate seeds"],"phonetic":"/ˈpɑmɪˌɡrænɪts/","extraExplanation":["“pomegranate”来自拉丁语 *pomum*（苹果/果实）+ *granatum*（多籽的），字面意思接近“多籽的果实”。","在一些文化与文学里，石榴常象征丰饶、生命与繁衍；也会在神话故事中出现（例如与冥界、婚姻或季节变换相关的故事）。","英文里“pomegranate seeds/arils”指可食用的红色籽粒；严格说很多人说的“seeds”其实是包着籽的多汁部分（arils）。"]}
{"word":"pomel","summary":{"en":"“Pomel” is likely a misspelling of **pommel**: a sword-handle knob or a saddle’s front; as a verb it can mean to hit repeatedly (though **pummel** is the more common spelling for the verb).","zh":"“pomel”多半是 **pommel** 的误拼：指剑柄末端的柄头或马鞍前部的鞍头；作动词可表示“连续猛击”（但动词更常见的拼法是 **pummel**）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled **pommel**) The rounded knob on the handle of a sword, or the front raised part of a saddle.","zh":"（常拼作 **pommel**）指剑柄末端的圆形“柄头”，或马鞍前方隆起的“鞍桥/鞍头”。"},"examples":[{"en":"The knight’s sword had a heavy pommel.","zh":"骑士的剑有一个沉重的柄头。"},{"en":"She grabbed the saddle pommel to steady herself.","zh":"她抓住鞍头让自己稳住。"}]},{"partOfSpeech":"v.","definition":{"en":"(Commonly spelled **pommel**) To strike someone repeatedly with the fists or with something heavy.","zh":"（常拼作 **pommel**）用拳头或重物连续猛击。"},"examples":[{"en":"The waves pummeled the coast all night.","zh":"海浪整夜猛击着海岸。"},{"en":"He was pommelled in the crowd and dropped his phone.","zh":"他在人群中被挤撞得很厉害，手机都掉了。"}]}],"synonyms":["hilt knob","saddle horn","beat","pummel"],"phonetic":"/ˈpɑməl/","extraExplanation":["你输入的 **pomel** 在英语里不常见；最可能是拼写成 **pommel**（剑柄的柄头/马鞍鞍头；或“连续猛击”）。","如果你想表达水果“柚子/文旦”，英语是 **pomelo**（/ˈpɑməˌloʊ/）。","注意：表示“猛击”更常见的拼法其实是 **pummel**（两个 m）。很多学习者会把 **pommel**（柄头）和 **pummel**（猛击）混淆。"]}
{"word":"pomelo","summary":{"en":"A pomelo is a large, thick-skinned citrus fruit similar to grapefruit but usually bigger and often milder.","zh":"pomelo 指柚子（文旦），一种比葡萄柚更大、皮更厚、味道通常更温和的柑橘类水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large citrus fruit with a thick peel and pale green, yellow, or pink flesh; it tastes mildly sweet to slightly bitter and is related to grapefruit.","zh":"柚子（文旦）：一种大型柑橘类水果，果皮厚，果肉可呈浅绿、黄色或粉红色，味道微甜到略苦，与葡萄柚同属近亲。"},"examples":[{"en":"She peeled a pomelo and shared the segments with her family.","zh":"她剥开一个柚子，把果瓣分给家人。"},{"en":"Pomelo is often eaten fresh or added to salads for a bright citrus flavor.","zh":"柚子常被直接鲜食，或加入沙拉增添清新的柑橘风味。"}]}],"synonyms":["pummelo","shaddock"],"phonetic":"/ˈpɑːməloʊ/","extraExplanation":["“pomelo”常被用来指真正的柚子（Citrus maxima）。英语里“grapefruit（葡萄柚）”与“pomelo（柚子）”容易混淆：葡萄柚通常更小、苦味更明显；柚子一般更大、皮更厚、果肉更干爽。","词源提示：英语“pomelo”与荷兰语/葡萄牙语在亚洲贸易中记录的水果名称有关，也常见拼写变体“pummelo”。"]}
{"word":"pomelos","summary":{"en":"Pomelos are large, thick-skinned citrus fruits with mild, juicy flesh, similar to a sweeter, less bitter grapefruit.","zh":"Pomelos 指柚子：一种个头很大的柑橘类水果，皮厚多汁，味道类似更甜、没那么苦的葡萄柚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large citrus fruit with a thick rind and pale, juicy flesh; it tastes like a mild, slightly sweet grapefruit.","zh":"柚子（或称：文旦/葡萄柚的近亲）：一种大型柑橘类水果，外皮厚、果肉颜色较浅，多汁，味道像较温和、略带甜味的葡萄柚。"},"examples":[{"en":"Pomelos are often eaten fresh or used in salads.","zh":"柚子常用来直接吃，或做成沙拉。"},{"en":"She peeled a pomelo and shared the segments with her family.","zh":"她剥开一个柚子，把果瓣分给家人。"},{"en":"In some Asian markets, pomelos are sold especially around festivals.","zh":"在一些亚洲市场，柚子在节庆前后会特别常见。"}]}],"synonyms":["pummelo","shaddock"],"phonetic":"/ˈpɑməˌloʊ/","extraExplanation":["“pomelo”是单数，“pomelos”是复数。发音常见两种重音：POH-muh-loh（美式更常见）或 puh-MEH-loh。","柚子在许多东亚与东南亚文化中常与节庆相关，例如中秋、春节等；有的地方也会把柚子皮用于糖渍、炖煮或做香料。","pomelo 常被拿来与 grapefruit（葡萄柚）比较：pomelo 一般更大、皮更厚、苦味较少；grapefruit 则更酸苦。"]}
{"word":"pomely","summary":{"en":"“Pomely” is usually a misspelling of “pommely,” meaning dappled or covered with round spots (often describing a horse’s coat).","zh":"“pomely”通常是“pommely”的误拼，意思是“斑驳的、布满圆点的”（常形容马的毛色）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) likely meant “pommely”: having many round spots; dappled (often used of a horse’s coat).","zh":"（非标准拼写）多半是想写 “pommely”：有许多圆点的；斑驳的（常用来形容马的毛色）。"},"examples":[{"en":"The gray horse had a pomely coat, dotted with light round spots.","zh":"那匹灰马的毛色很斑驳，上面点缀着浅色的圆斑。"},{"en":"In the painting, a pomely sky gives the scene a soft, textured look.","zh":"在这幅画里，斑驳的天空让画面显得柔和而有层次。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) resembling apples or covered with apple-like spots or markings.","zh":"（少见/诗意用法）像苹果的；带有类似苹果的圆形斑点或纹理的。"},"examples":[{"en":"The old poem describes a pomely orchard floor after the harvest.","zh":"那首古诗描写了收获后果园地面上“苹果般点点”的景象。"}]}],"synonyms":["dappled","spotted","mottled","speckled"],"phonetic":"/ˈpɑːməli/","extraExplanation":["“pomely”本身不算常见的标准英语拼写；更常见的是 **pommely**（也可见到 *pommelé* 这种受法语影响的拼法），意思与“dappled（有斑点的）”接近。","词源上与 **pome**（苹果等“梨果”）有关：早期用“像苹果一样的圆点”来比喻“圆斑、斑驳”。","如果你是在描述“马的毛色”，更地道的常用说法是 **dappled gray**（灰白相间的花斑灰马）。"]}
{"word":"pomeranian","summary":{"en":"Pomeranian most commonly means a small fluffy toy dog breed; it can also mean something from the Pomerania region.","zh":"pomeranian 最常指“博美犬”；也可指“波美拉尼亚地区相关的（人、文化、语言等）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, fluffy toy dog breed with a fox-like face and a thick double coat, originally from the Pomerania region","zh":"博美犬；一种小型、毛量蓬松、脸型像小狐狸、拥有双层被毛的玩具犬品种，起源与波美拉尼亚地区有关"},"examples":[{"en":"She has a Pomeranian named Coco.","zh":"她养了一只叫 Coco 的博美犬。"},{"en":"Pomeranians need regular brushing because their coat sheds a lot.","zh":"博美犬需要定期梳毛，因为它们掉毛比较多。"},{"en":"The Pomeranian barked loudly at the doorbell.","zh":"门铃一响，那只博美犬就大声叫起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Pomerania or its people, language, or culture","zh":"波美拉尼亚的；与波美拉尼亚地区或其人民、语言、文化相关的"},"examples":[{"en":"They studied Pomeranian history in a regional museum.","zh":"他们在一座地方博物馆里研究波美拉尼亚历史。"},{"en":"Some families still speak Pomeranian at home.","zh":"有些家庭在家里仍然说波美拉尼亚语。"}]}],"synonyms":["Pom (informal, dog breed)","toy spitz (related type)"],"phonetic":"/ˌpɑːməˈreɪniən/","extraExplanation":["“Pomeranian”作为犬种名称时，常写作首字母大写（a Pomeranian）。它属于尖嘴犬（spitz）类型，外形常被描述为“像小狐狸”。","波美拉尼亚（Pomerania）是波罗的海沿岸的历史地区，如今大致分布在波兰和德国境内；“Pomeranian”也可指该地区相关的人与语言。"]}
{"word":"pomeranians","summary":{"en":"Pomeranians: small fluffy toy dogs; plural of Pomeranian.","zh":"pomeranians：博美犬（复数），一种小型、毛量很蓬松的玩具犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, fluffy toy dog breed with a fox-like face and a thick double coat; plural of Pomeranian.","zh":"博美犬（Pomeranian），一种体型小、毛量蓬松、脸型像小狐狸的玩具犬品种；pomeranian 的复数。"},"examples":[{"en":"Pomeranians are known for their big personalities in small bodies.","zh":"博美犬以“身材小但个性大”而出名。"},{"en":"Her two Pomeranians bark whenever someone knocks on the door.","zh":"她的两只博美犬只要有人敲门就会叫。"}]}],"synonyms":["Poms","toy dogs"],"phonetic":"/ˌpɑː.məˈreɪ.ni.ənz/","extraExplanation":["“Pomeranian（博美犬）”这个名字来自欧洲历史地区 Pomerania（波美拉尼亚，位于今天波兰与德国一带）。早期的博美犬体型更大，后来在英国维多利亚女王时期被培育得更小、更适合作为伴侣犬。","在英语里，犬种名常常可以用来指“这个品种的狗”，单复数按普通名词变化：one Pomeranian / two Pomeranians。"]}
{"word":"pomeria","summary":{"en":"“Pomeria” is rare in English; it most often appears as a nonstandard form of “Pomerania” (a Baltic historical region).","zh":"“Pomeria”在英语中很少见；最常见是作为“Pomerania（波美拉尼亚）”的非标准写法或误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare/unclear) A less common form or misspelling of “Pomerania,” a historical region on the southern coast of the Baltic Sea (today mainly in northern Poland and northeastern Germany).","zh":"（罕见/不够标准）常被当作 “Pomerania（波美拉尼亚）” 的不常见写法或拼写错误；波美拉尼亚是波罗的海沿岸的历史地区（今主要在波兰北部与德国东北部）。"},"examples":[{"en":"Some older texts use spellings close to “Pomeria,” but “Pomerania” is standard in modern English.","zh":"一些较旧的文本里会出现接近 “Pomeria” 的拼写，但现代英语里标准写法是 “Pomerania”。"},{"en":"The novel is set in Pomerania on the Baltic coast.","zh":"这部小说的背景设在波罗的海沿岸的波美拉尼亚。"}]},{"partOfSpeech":"other","definition":{"en":"(Possible proper name) A place name or name variant used in some contexts; it is not a common English vocabulary word and may require the specific source for accurate meaning.","zh":"（可能是专有名）在某些语境中出现的地名或名称变体；它并不是常见英语词汇，通常需要结合具体来源才能确定准确含义。"},"examples":[{"en":"If you saw “Pomeria” in a map or document, check the surrounding context to see which region or town it refers to.","zh":"如果你在地图或文件中看到 “Pomeria”，最好查看上下文，确认它指的是哪个地区或城镇。"}]}],"synonyms":["Pomerania"],"phonetic":"/pəˈmɪriə/","extraExplanation":["“Pomerania”一词源自斯拉夫语族的地名构词，常被解释为与“海边/沿海”相关（类似“po morze”=靠海）。英语里更常见的是 Pomerania（地区）以及 Pomeranian（波美拉尼亚的；博美犬）。","如果你想查的是狗的品种，“Pomeranian（博美犬）”是标准词；若你想查地理区域，多半是 “Pomerania（波美拉尼亚）”。你也可以告诉我你在哪里看到 “pomeria”，我能更精确判断。"]}
{"word":"pomeridian","summary":{"en":"Pomeridian means “in the afternoon” (after noon), and can rarely mean “the afternoon” itself.","zh":"pomeridian 意为“下午的／正午之后的（P.M.）”，也可（较少见）指“下午”这一段时间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Happening in the afternoon; after noon (P.M.).","zh":"（正式用语）下午的；正午之后的（P.M.）。"},"examples":[{"en":"We met in the pomeridian hours, after lunch.","zh":"我们在下午的时间见面，午饭后。"},{"en":"The heat is strongest in the pomeridian sun.","zh":"下午的太阳下暑气最盛。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The afternoon; the time after noon.","zh":"（罕见）下午；正午之后的时间。"},"examples":[{"en":"She spent the pomeridian reading by the window.","zh":"她在下午靠窗读书。"}]}],"synonyms":["afternoon","postmeridian","P.M. (informal abbreviation)"],"phonetic":"/ˌpoʊməˈrɪdiən/","extraExplanation":["“pomeridian”来自拉丁语 *post meridiem*（正午之后），与常见缩写 P.M. 同源；更常见的对应词是 “afternoon” 或 “postmeridian”。在现代英语里它偏书面、较少使用，常见于较古典或幽默的写作风格中。"]}
{"word":"pomerium","summary":{"en":"A sacred, legally important boundary of ancient Rome, distinct from the city walls.","zh":"古罗马具有宗教与法律意义的神圣界线，不同于城墙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, the sacred boundary line around a city (especially Rome) that marked where certain religious and legal rules applied; it was not the same as the city walls.","zh":"（古罗马）城邦的“神圣界线”（尤指罗马的pomerium），用来划定宗教与法律规则适用的范围；它不等同于城墙。"},"examples":[{"en":"In ancient Rome, weapons were not allowed inside the pomerium.","zh":"在古罗马，武器不允许带入pomerium（神圣界线）之内。"},{"en":"Some historians note that the pomerium could be expanded when Rome’s power grew.","zh":"一些历史学家指出，随着罗马势力扩大，pomerium（神圣界线）也可能被扩展。"},{"en":"The general had to lay down his command before crossing the pomerium into the city.","zh":"那位将军在穿越pomerium进入城内之前，必须放下（交出）军权。"}]}],"synonyms":["sacred boundary","city boundary (historical)"],"phonetic":"/poʊˈmiːriəm/","extraExplanation":["pomerium源自拉丁语，常被解释为“城墙之外的地带/界线”（post moerium）。它更像一条具有宗教意义的法律边界：例如某些官职的权力、军队与武器的进入、以及特定仪式的举行地点，都与是否在pomerium之内有关。","在英语历史写作中，你也可能看到它被引申用来比喻“某个制度或文化的不可逾越的界限”，但这种用法较少，通常仍用于古罗马语境。"]}
{"word":"pomeroy","summary":{"en":"Pomeroy is most commonly a surname, and it is also used as a place name (especially in the U.S.).","zh":"Pomeroy 最常见用法是姓氏，也可作为地名（尤其在美国）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname) of French origin, used by people in English-speaking countries.","zh":"一个源自法语的姓氏，在英语国家中有人使用。"},"examples":[{"en":"Her last name is Pomeroy.","zh":"她的姓是 Pomeroy。"},{"en":"Professor Pomeroy published a new article this year.","zh":"Pomeroy 教授今年发表了一篇新文章。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (especially in the United States), used for towns or communities.","zh":"一个地名（尤其在美国），用于城镇或社区的名称。"},"examples":[{"en":"We stopped in Pomeroy for gas on the road trip.","zh":"我们公路旅行时在 Pomeroy 停下来加油。"},{"en":"He grew up near Pomeroy, Ohio.","zh":"他在俄亥俄州的 Pomeroy 附近长大。"}]}],"phonetic":"/ˈpɑməˌrɔɪ/","extraExplanation":["Pomeroy 常被认为来自古法语/诺曼法语词源，和 pommier（苹果树）相关，原意可追溯到“苹果园/果园”之类的概念；因此它作为姓氏时带有地名/居住地来源的色彩（类似于 “来自某个果园的人”）。","在英语里它通常作为专有名词出现：写作首字母大写（Pomeroy）。发音因地区可能略有差异，但美式常见读法接近 “PAH-muh-roy”。"]}
{"word":"pomes","summary":{"en":"“Pomes” means apples/pears-type fruits (plural of pome).","zh":"“pomes”指梨果类水果（pome 的复数），如苹果、梨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pome: a type of fruit with a core containing seeds, surrounded by firm flesh (e.g., apples and pears).","zh":"pome（梨果）的复数：一种果实类型，种子在果核（核心）里，外面包着较硬的果肉（如苹果、梨）。"},"examples":[{"en":"Apples and pears are pomes.","zh":"苹果和梨属于梨果（pomes）。"},{"en":"The orchard grows several pomes, including apples and quince.","zh":"这个果园种了几种梨果类水果，包括苹果和榅桲。"}]}],"synonyms":["apples and pears (in everyday wording)","pome fruits"],"phonetic":"/poʊmz/","extraExplanation":["“pome”是植物学里的分类词，日常英语里人们通常直接说“apples / pears”，不太会说“pomes”。在课堂、科普文章或园艺/植物学语境中更常见。"]}
{"word":"pomeshchik","summary":{"en":"A Russian historical term for a landed noble/estate owner, often associated with serfdom.","zh":"指沙俄时期的地主贵族/庄园主，常与农奴制背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in pre-revolutionary Russia) a landed noble or landowner who owned an estate, often with serfs.","zh":"（沙俄时期）地主、庄园主；拥有土地（常伴随农奴制度）的贵族地主。"},"examples":[{"en":"In Russian history, a pomeshchik could control large estates and the lives of serfs who worked them.","zh":"在俄罗斯历史中，pomeshchik 往往掌控大片庄园，以及为其劳作的农奴的生活。"},{"en":"The novel portrays a pomeshchik as proud, conservative, and dependent on unpaid labor.","zh":"小说把一位 pomeshchik 描写得骄傲、保守，并依赖无偿劳作。"}]}],"synonyms":["landowner","landlord","estate owner","Russian landed noble"],"phonetic":"/pəˈmɛʃtʃɪk/","extraExplanation":["这是从俄语 помещик（pomeshchik）借入英语的词，常见于历史写作或俄国文学研究中，带有明确的时代背景（主要指1917年革命前）。","与一般的英文 landlord 不同，pomeshchik 往往让人联想到沙俄的等级制度与农奴制（1861年改革前尤甚），因此语体偏“历史/文学/学术”。","在英文读物里，它可能出现在谈论果戈里、屠格涅夫、托尔斯泰等作品的语境中，用来强调“俄国式地主阶层”的特殊性。"]}
{"word":"pomewater","summary":{"en":"Pomewater is an old term for a kind of apple (and sometimes, by extension, an apple-based drink).","zh":"Pomewater 是一个较古老的词，指一种苹果品种（有时也泛指苹果制成的饮品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type (variety) of apple, traditionally described as large, sweet, and very juicy.","zh":"一种苹果品种（旧称），传统上形容为个头较大、味甜、多汁。"},"examples":[{"en":"In older English writings, a “pomewater” is mentioned as a sweet, juicy apple.","zh":"在较早的英文作品里，“pomewater”常被提到是一种甜而多汁的苹果。"},{"en":"The orchard list included russets, pippins, and pomewaters.","zh":"果园清单里有黄褐苹果（russets）、皮平苹果（pippins）以及 pomewaters。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) a drink made from apples, similar to apple juice or cider.","zh":"（古义）用苹果制成的饮品，类似苹果汁或苹果酒（cider）。"},"examples":[{"en":"He warmed himself with a cup of pomewater on a cold evening.","zh":"寒冷的夜晚，他喝了一杯 pomewater 暖暖身。"}]}],"synonyms":["(apple variety) pippin","(apple variety) russet","(drink) apple juice","(drink) cider"],"phonetic":"ˈpoʊmˌwɔtər","extraExplanation":["这个词现在很少用于日常英语，更常出现在旧文本、地方性果树/苹果品种记录里。拼写上也可能见到带连字符的形式 pome-water。","在英国文学（包括莎士比亚时代的语境）里，这类具体苹果品种名常被用来营造生活气息；读到时通常按“某种苹果/苹果品种”理解即可。"]}
{"word":"pomey","summary":{"en":"“Pomey” is a slang term (mostly in Australia/NZ) for a British person; it can be offensive, so use with care.","zh":"“pomey”是澳新地区常见的俚语，指英国人；有时带冒犯意味，使用需谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, chiefly Australian/New Zealand; sometimes offensive) a British person; an English person.","zh":"（俚语，主要用于澳大利亚/新西兰；有时带冒犯）英国人；英格兰人。"},"examples":[{"en":"Some older Australians still use “pomey/pommy” to mean a British immigrant.","zh":"一些年纪较大的澳大利亚人仍会用“pomey/pommy”来指英国移民。"},{"en":"It can sound rude, so it’s safer to say “British person” in formal situations.","zh":"它可能听起来不礼貌，所以在正式场合更安全的说法是“British person（英国人）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(slang, chiefly Australian/New Zealand; sometimes offensive) relating to British people; British.","zh":"（俚语，主要用于澳大利亚/新西兰；有时带冒犯）与英国人有关的；英国的。"},"examples":[{"en":"He joked about my “pomey” accent.","zh":"他拿我的“英国口音”开玩笑。"}]}],"synonyms":["Pommy","Pommie","Brit (neutral)","British person (neutral)"],"phonetic":"/ˈpɑmi/","extraExplanation":["“pomey”更常见的拼写是“pommy / pommie”。语气可能从开玩笑到带贬义不等，是否冒犯取决于语境、语气和双方关系；不熟的人之间使用容易显得无礼。","词源不确定：有人认为和“pomegranate（石榴）”有关（早期对英国新移民晒伤变红的调侃），也有人把它解释成“Prisoner of Mother England”的缩写，但这通常被认为是后人编造的“回造词源”。"]}
{"word":"pomeys","summary":{"en":"Pommy (plural: pommies/pommys) is Australian/NZ slang for a British person; it can be joking but may be offensive.","zh":"Pommy（复数：pommies/pommys）是澳大利亚/新西兰对英国人的俚语称呼；可带玩笑语气，但有时会冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand, informal; sometimes offensive) a British person; an immigrant from Britain.","zh":"（澳大利亚/新西兰，非正式；有时带冒犯）英国人；来自英国的移民。"},"examples":[{"en":"When I first moved to Sydney, some people jokingly called me a pommy.","zh":"我刚搬到悉尼时，有些人开玩笑叫我“pommy”（英国佬）。"},{"en":"The team has a couple of pommies who arrived last year.","zh":"队里有几位去年才来的英国人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Britain or British people (informal; sometimes offensive).","zh":"（非正式；有时带冒犯）英国的；英国人的。"},"examples":[{"en":"He has a strong pommy accent.","zh":"他有很重的英式口音。"},{"en":"They served a pommy-style breakfast with baked beans.","zh":"他们端上了英式早餐，有焗豆。"}]}],"synonyms":["Brit","British person","Pom (slang)"],"phonetic":"/ˈpɑmi/","extraExplanation":["你输入的 **pomeys** 多半是 **pommies/pommys** 的拼写变体，来自 **pommy**（复数：pommies/poms）。","使用提醒：在澳大利亚/新西兰，这个词常出现在玩笑或口语里，但对一些英国人来说可能带贬义或让人不舒服；不熟悉关系时，建议用 **British person / Brit** 更安全。","词源并不完全确定。常见说法包括与澳洲俚语、押韵俚语有关（例如 *pomegranate* 等说法），以及“Prisoner of Mother England”等民间解释，但多被认为是后人附会。"]}
{"word":"pomfrest","summary":{"en":"Pomfret (often misspelled as “pomfrest”) is most commonly the name of an edible marine fish; it can also be a U.S. place name.","zh":"Pomfret（常被误写为“pomfrest”）最常指一种可食用的海鱼；也可作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a marine fish (often called pomfret), commonly eaten; in markets it may refer to several similar flat, silvery fish.","zh":"（食用）鲳鱼/鲳鲹类鱼的俗称；市场上有时也泛指几种外形相近、扁平银色的海鱼。"},"examples":[{"en":"We ordered fried pomfret with ginger and scallions.","zh":"我们点了姜葱煎鲳鱼。"},{"en":"Fresh pomfret is usually sold whole at the seafood market.","zh":"新鲜的鲳鱼在海鲜市场通常是整条出售。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): Pomfret is the name of several towns/areas, especially in the U.S. (e.g., Vermont; Connecticut).","zh":"地名（专有名词）：Pomfret 是一些城镇/地区的名称，常见于美国（如佛蒙特州、康涅狄格州）。"},"examples":[{"en":"They spent the weekend hiking near Pomfret, Vermont.","zh":"他们周末在佛蒙特州的 Pomfret 附近徒步。"}]}],"synonyms":["silver pomfret","butterfish (sometimes, in markets)"],"phonetic":"/ˈpɑmfrət/","extraExplanation":["“pomfrest”通常被认为是拼写错误，更常见的拼写是“pomfret”。如果你是在菜单或海鲜摊看到它，很可能指“鲳鱼/鲳鲹类”的一种食用鱼。","不同地区对“pomfret”所指的鱼可能不完全相同：在亚洲语境里常见的是银鲳（silver pomfret），在英语市场里有时也会指其他外形相近的鱼。购买时可看拉丁学名或询问具体品种更准确。"]}
{"word":"pomfret","summary":{"en":"Pomfret usually means an edible sea fish; it can also be a town name.","zh":"Pomfret 通常指一种可食用的海鱼；也可作城镇地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of ocean fish that is popular as food; in English it often refers to certain flat, silvery fish (and in different regions the name may be used for different species).","zh":"一种海鱼（常见食用鱼）；英语里“pomfret”通常指某些银白色、身体较扁的鱼，但不同地区可能用它指代不同物种。"},"examples":[{"en":"We ordered steamed pomfret with ginger and scallions.","zh":"我们点了清蒸鲳鱼，配姜和葱。"},{"en":"Pomfret is valued for its mild flavor and tender meat.","zh":"鲳鱼因味道清淡、肉质细嫩而受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), especially the name of several towns in the U.S. and elsewhere.","zh":"地名（专有名词）；尤其是美国等地一些城镇的名称。"},"examples":[{"en":"She grew up in Pomfret, Connecticut.","zh":"她在康涅狄格州的庞弗雷特（Pomfret）长大。"}]}],"synonyms":["butterfish","pompano (regional/loosely)"],"phonetic":"/ˈpɑm.frɪt/","extraExplanation":["在餐馆或市场里，pomfret 常被翻译成“鲳鱼”，但要注意这不是严格的一一对应：不同国家/地区可能把不同鱼类也叫 pomfret（例如“silver pomfret / golden pomfret”等说法）。如果你需要精确到物种，最好看拉丁学名或中文具体品种名。"]}
{"word":"pomfrets","summary":{"en":"Pomfrets are pomfret fish (plural), a food fish often seen in markets and on menus.","zh":"Pomfrets 是 pomfret 的复数，指常见的食用海鱼，常出现在鱼市、菜单和菜谱中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ocean fish with a flat, roundish body, often eaten as food (plural of pomfret)","zh":"一种海鱼，身体较扁、近圆形，常作为食用鱼（pomfret 的复数）"},"examples":[{"en":"The market was selling fresh pomfrets today.","zh":"今天市场在卖新鲜的鲳鱼。"},{"en":"In some Asian cuisines, pomfrets are often steamed with ginger and soy sauce.","zh":"在一些亚洲菜系里，鲳鱼常用姜和酱油清蒸。"}]}],"synonyms":["pomfret","food fish","butterfish (sometimes, depending on region)"],"phonetic":"ˈpɑmfrət","extraExplanation":["“Pomfret”在英语里多指可食用的海鱼（不同地区可能指不同种类，如常见的鲳鱼类）。在烹饪语境中很常见，但在日常口语里不如“fish”那么泛用，更多出现在菜单、菜谱或鱼市场景。","词形提示：单数 pomfret，复数 pomfrets。"]}
{"word":"pomiculture","summary":{"en":"Pomiculture is the practice or study of growing and managing fruit trees, especially apples and pears.","zh":"Pomiculture 指果树（尤其苹果、梨等树果）的栽培与管理实践/学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The cultivation of fruit, especially apples, pears, and other tree fruits (a branch of horticulture).","zh":"果树栽培学；果树栽培（尤其指苹果、梨等树果的栽培，属园艺学分支）。"},"examples":[{"en":"She studied pomiculture to learn how to manage an apple orchard.","zh":"她学习果树栽培学，以了解如何管理苹果园。"},{"en":"Modern pomiculture focuses on pruning, pest control, and improving fruit quality.","zh":"现代果树栽培侧重于修剪、病虫害防治以及提升果实品质。"}]}],"synonyms":["fruit growing","fruit cultivation","orchard management","pomology (related)"],"phonetic":"/ˈpoʊməˌkʌltʃɚ/","extraExplanation":["词源与相关词：pomiculture 来自拉丁语 pomum（果实）+ culture（栽培）。它与 pomology（果树学/果品学，偏研究与科学）关系密切；pomiculture 更偏“栽培与管理实践”。","使用范围：该词较正式、偏学术或农业领域日常用语；一般日常英语更常说 fruit growing（种果树/种水果）或 orchard management（果园管理）。"]}
{"word":"pomiculturist","summary":{"en":"A pomiculturist is someone who grows fruit, especially professionally.","zh":"pomiculturist 指从事水果（果树）栽培的人，常用于较正式或专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who grows fruit (especially as a job or area of expertise); a fruit grower.","zh":"果树栽培者；果农；从事（或研究）水果种植的人。"},"examples":[{"en":"The pomiculturist tested different apple varieties to find which grew best in the local climate.","zh":"这位果树栽培者测试了不同的苹果品种，看看哪一种最适合当地气候。"},{"en":"As a pomiculturist, she focuses on improving fruit quality and disease resistance.","zh":"作为一名果树栽培者，她专注于提升果实品质和抗病性。"}]}],"synonyms":["fruit grower","orchardist","pomologist"],"phonetic":"/ˌpoʊmɪˈkʌltʃərɪst/","extraExplanation":["词源提示：pomi- 来自拉丁语 pomum（“水果/果实”），-culturist 与 culture（栽培、耕作）相关，所以 pomiculturist 字面意思就是“从事水果栽培的人”。","使用场景：该词较正式、偏专业，常见于农业、园艺、果树学（pomology）等语境。日常英语里更常说 fruit grower（果农）或 orchardist（果园经营者）。"]}
{"word":"pomiferous","summary":{"en":"Pomiferous means “bearing apple-like fruits (pomes),” especially apples and pears.","zh":"pomiferous 指“结梨果（苹果类果实）的”，常用于苹果、梨等植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bearing pomes (apple-like fruits), such as apples, pears, or quinces.","zh":"结梨果（苹果类果实）的；结像苹果那样果实的（如苹果、梨、榅桲）。"},"examples":[{"en":"Apples and pears are pomiferous trees in the rose family.","zh":"苹果和梨是蔷薇科中结梨果的树木。"},{"en":"The orchard is planted with pomiferous species like apple and pear.","zh":"这个果园种了苹果、梨等结梨果的树种。"}]}],"synonyms":["pome-bearing","apple-bearing (informal)","pear-bearing (informal)"],"phonetic":"/poʊˈmɪfərəs/","extraExplanation":["“pomiferous”是一个较少见、偏植物学用语的形容词：pomi- 来自拉丁语 pomum（“果实/苹果”），-ferous 表示“携带/产生”（如 coniferous=结球果的）。","梨果（pome）是一类特殊的果实类型：我们吃的“苹果肉”主要来自花托等组织，而真正的子房部分形成果核。日常英语里更常用的说法是“apple/pear-bearing”或直接说“apple trees/pear trees”。"]}
{"word":"pomiform","summary":{"en":"Pomiform means “apple-shaped.”","zh":"pomiform 意为“苹果形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Apple-shaped; rounded like an apple.","zh":"苹果形的；像苹果一样圆鼓的。"},"examples":[{"en":"The fruit had a pomiform shape, round with a slight dimple at the top.","zh":"这种果实呈苹果形，圆润，顶部还有一点凹陷。"},{"en":"Some gourds can look pomiform when fully grown.","zh":"有些葫芦成熟后看起来会呈苹果形。"}]}],"synonyms":["apple-shaped","round","orbicular","globose"],"phonetic":"/ˈpɑːməˌfɔːrm/","extraExplanation":["“pomiform”较偏学术/描写性用词，常见于植物学、园艺、自然观察或文学性的外形描写。日常英语里更常说“apple-shaped”或“round”。词根来自拉丁语：pom-（水果/苹果）+ -form（形状）。"]}
{"word":"pomivorous","summary":{"en":"Pomivorous describes animals that mainly eat fruit.","zh":"pomivorous 用来形容主要以水果为食的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fruit-eating; feeding mainly on fruit.","zh":"食果的；以水果为主食的。"},"examples":[{"en":"Many bats are pomivorous and help disperse seeds across forests.","zh":"许多蝙蝠是食果的，并帮助把种子传播到森林各处。"},{"en":"The zoo designed a pomivorous diet with bananas, figs, and berries.","zh":"动物园设计了一份以水果为主的饮食，包括香蕉、无花果和莓果。"}]}],"synonyms":["frugivorous","fruit-eating"],"phonetic":"/poʊˈmɪvərəs/","extraExplanation":["“pomivorous”较少见，更常用的是“frugivorous（食果的）”。","词源：来自拉丁语 pomum（水果）+ -vorous（吃……的，源自 vorare“吞食”）。常用于动物学/生态学语境，描述以果实为主要食物来源的动物。"]}
{"word":"pommado","summary":{"en":"Pomade is a hair-styling product (often oily or waxy) used to add shine and hold; it can also mean to apply it to hair.","zh":"Pomade 指发油/发蜡等造型产品（常偏油或蜡质），用于增加光泽并定型；也可作动词表示给头发抹发油做造型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A greasy or waxy product used to style hair, add shine, and hold it in place.","zh":"（头发用）发油；发蜡；定型油（通常偏油、偏蜡，用来让头发有光泽并固定造型）。"},"examples":[{"en":"He used pomade to slick his hair back for the wedding.","zh":"他用发油把头发向后梳得很服帖，去参加婚礼。"},{"en":"This pomade gives a strong hold and a glossy finish.","zh":"这款发蜡定型力强，而且很有光泽。"}]},{"partOfSpeech":"vt.","definition":{"en":"To apply pomade to (someone’s hair) in order to style it.","zh":"给（头发）抹发油/发蜡并做造型。"},"examples":[{"en":"She pomaded his hair before the photo shoot.","zh":"拍照前她给他的头发抹了发油做造型。"}]}],"synonyms":["hair wax","hair gel","styling wax","styling cream"],"phonetic":"/pəˈmeɪd/","extraExplanation":["“pommado”并不是常见英文拼写，最接近、最常用的词是 **pomade**。它来自法语 *pommade*，原意与“苹果（pomme）香膏”有关。现代英语里主要指复古风（如油头、背头）常用的头发造型产品。"]}
{"word":"pommage","summary":{"en":"Pommage is a (rare) word for pomade—a greasy hair dressing—or the act of applying it.","zh":"pommage 是较少见的用法，指发油/发蜡等油性护发膏，或指涂抹这类产品的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hair dressing (a greasy ointment) used to smooth, shape, or add shine to hair; also the act of applying such a dressing.","zh":"（头发用的）发油/发蜡等油性护发膏；也可指涂抹发油的动作。"},"examples":[{"en":"He used a little pommage to keep his hair neat for the interview.","zh":"他用了一点发油让头发在面试时看起来整齐。"},{"en":"Too much pommage can make fine hair look greasy.","zh":"发量细软的人发油抹太多会显得油腻。"}]},{"partOfSpeech":"v.","definition":{"en":"To apply pomade or a greasy dressing to hair.","zh":"给头发抹发油/发蜡等油性造型品。"},"examples":[{"en":"In old-fashioned barbershops, the barber would pommage the hair and then comb it into place.","zh":"在老式理发店里，理发师会先抹发油，再把头发梳到位。"}]}],"synonyms":["pomade","hair grease","hair dressing"],"phonetic":"pɑˈmɑʒ","extraExplanation":["“pommage”在现代英语中比较少见，更常见的词是“pomade”（发油/发蜡）。它源自法语“pommade”，原意与“苹果（pomme）香气的软膏”有关，后来泛指油性膏状的护发或护肤用品。","语体上常带一点复古、理发店（barbershop）或老式造型的感觉；在日常对话中用“pomade”会更自然。"]}
{"word":"pommard","summary":{"en":"Pommard is a Burgundy village and also the Pinot Noir–based red wine made there.","zh":"Pommard既指勃艮第的一个村庄，也指该产区出产的以黑皮诺为主的红葡萄酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village in Burgundy, France, famous for producing red Burgundy wines (mainly Pinot Noir).","zh":"法国勃艮第（Burgundy）的一个村庄，以出产红葡萄酒闻名（主要为黑皮诺 Pinot Noir）。"},"examples":[{"en":"We visited Pommard during our trip through Burgundy.","zh":"我们在勃艮第旅行时去了波玛（Pommard）。"},{"en":"This Pinot Noir is from Pommard, in the Côte de Beaune.","zh":"这款黑皮诺来自博纳丘（Côte de Beaune）的波玛（Pommard）。"}]},{"partOfSpeech":"n.","definition":{"en":"A red wine from the Pommard appellation, typically known for a firm structure and dark-fruit flavors.","zh":"波玛产区（Pommard 法定产区）出产的红葡萄酒，常以结构感扎实、深色水果风味著称。"},"examples":[{"en":"He ordered a bottle of Pommard to go with the roast duck.","zh":"他点了一瓶波玛红酒来配烤鸭。"},{"en":"The sommelier described the Pommard as earthy and tannic.","zh":"侍酒师形容这款波玛酒带有泥土气息、单宁较明显。"}]}],"synonyms":["Burgundy (wine)","Pinot Noir","Côte de Beaune","red Burgundy"],"phonetic":"/poʊˈmɑrd/","extraExplanation":["“Pommard”常出现在酒单或葡萄酒书里，既可指“地名”（村庄），也可指“酒”（该AOC产区的红酒）。写作时通常大写Pommard。","在勃艮第语境中，Pommard多与“Côte de Beaune（博纳丘）”“Pinot Noir（黑皮诺）”“AOC/Appellation（法定产区）”等一起出现。它常被描述为比一些更“轻柔”的勃艮第红更结实、更有单宁。"]}
{"word":"pomme","summary":{"en":"“Pomme” is French for “apple,” and appears in some French food terms used in English.","zh":"“pomme”是法语“苹果”，英语中多见于法式菜名等借用表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French word meaning “apple,” sometimes used in English in French-style menus or set phrases","zh":"法语里“苹果”的意思；英语中偶尔在法式菜单或固定搭配里借用"},"examples":[{"en":"The dessert was listed as “tarte aux pommes” (apple tart) on the menu.","zh":"菜单上把甜点写成“tarte aux pommes”（苹果塔）。"},{"en":"In French, “pomme” means “apple.”","zh":"在法语里，“pomme”就是“苹果”。"}]}],"synonyms":["apple"],"phonetic":"/pɑm/","extraExplanation":["在英语环境里单独写“pomme”并不常见，更多出现在法式菜名或短语中，用来营造“法式/高级餐饮”的语感。","常见相关表达：pommes frites（薯条，字面“炸土豆”）、pomme de terre（土豆，字面“地里的苹果”）、tarte aux pommes（苹果派/苹果塔）。","发音提示：法语“pomme”末尾的 e 通常不发音，整体接近英语里的“palm”去掉 l 的感觉。"]}
{"word":"pommee","summary":{"en":"Pommee means “apple-ended,” especially describing a cross or design whose ends are rounded like small balls.","zh":"Pommee 指“苹果状/球状末端的”，常用于纹章或设计中描述末端呈圆球的十字或图案。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry/Design) Having ends shaped like small round knobs or apples; said especially of a cross or object whose arms end in rounded balls (a “cross pommee”).","zh":"（纹章学/设计）末端呈圆球状、像小苹果一样的；常用于描述十字架或器物的臂端带圆球的样式（如“球端十字/苹果端十字”）。"},"examples":[{"en":"The emblem features a cross pommee at the center of the shield.","zh":"这个徽章的盾牌中央是一枚球端十字。"},{"en":"In medieval art, pommee cross endings often look like small beads or apples.","zh":"在中世纪艺术中，球端十字的末端常看起来像小珠子或小苹果。"}]},{"partOfSpeech":"n.","definition":{"en":"A pommee cross; a cross whose arms end in rounded knobs.","zh":"球端十字；臂端为圆球状的十字架。"},"examples":[{"en":"The flag design includes a pommee to echo historical heraldry.","zh":"旗帜设计加入球端十字，以呼应历史纹章风格。"}]}],"synonyms":["pommeled","knobbed","ball-ended"],"phonetic":"/pɑˈmeɪ/","extraExplanation":["“pommee”常见拼写也有带重音的法语形式“pommée”。它源自法语“pomme”（苹果），在英语里主要用于纹章学、宗教艺术与装饰设计语境。","如果你是在描述日常“苹果”相关词汇：英文“apple”，法语“pomme”。而“pommee/pommée”通常不是日常英语词。"]}
{"word":"pommel","summary":{"en":"A pommel is a rounded knob on a sword’s hilt or the raised front part of a saddle.","zh":"pommel 指剑柄末端的圆头（剑首），也可指马鞍前部突起的鞍桥/鞍头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rounded knob at the end of a sword handle (hilt), used to balance the sword and help grip it","zh":"（剑柄末端的）圆头；剑首（用于平衡并便于握持）"},"examples":[{"en":"The knight’s sword had a heavy pommel that helped balance the blade.","zh":"骑士的剑有个很重的剑首，有助于平衡剑身。"},{"en":"He gripped the hilt tightly, his hand resting against the pommel.","zh":"他紧紧握住剑柄，手靠在剑首上。"}]},{"partOfSpeech":"n.","definition":{"en":"the raised front part of a saddle (especially on some English saddles), helping the rider stay secure","zh":"（马鞍前部的）鞍桥；鞍头（帮助骑手更稳固）"},"examples":[{"en":"She held the pommel as the horse started to trot.","zh":"马开始小跑时，她抓住了鞍桥。"},{"en":"The child sat in front of the rider, near the pommel.","zh":"孩子坐在骑手前面，靠近鞍桥的位置。"}]},{"partOfSpeech":"vt.","definition":{"en":"to strike repeatedly with the fists; to beat strongly","zh":"用拳猛击；痛打"},"examples":[{"en":"The boxer pummeled his opponent with quick punches.","zh":"拳击手用快速的拳头猛击对手。"},{"en":"Hail pummeled the roof all night.","zh":"冰雹整夜砸在屋顶上。"}]}],"synonyms":["knob","hilt-end (sword)","saddle horn (related, not identical)"],"phonetic":"/ˈpɑməl/","extraExplanation":["注意拼写：名词“pommel”（剑首/鞍桥）与动词“pummel”（痛打）很容易混淆。动词通常拼作 pummel（多一个 u），读音也不同。","文化语境：在中世纪题材（骑士、长剑）或骑马运动（马术）相关文本中，pommel 很常见。文学作品里常用来营造“武器/骑乘”的画面感。"]}
{"word":"pommeled","summary":{"en":"“Pommeled” is the past form of “pommel,” meaning to beat repeatedly (like “pummel”) or to strike/equip with a sword’s pommel (knob).","zh":"“pommeled”是“pommel”的过去式，常指反复击打（近似“pummel”），也可指用剑柄末端圆头击打或给器物装上把头。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “pommel”: to hit or beat someone repeatedly (often with fists), similar to “pummel.”","zh":"“pommel”的过去式/过去分词：反复击打、痛打（常指用拳头），意思接近“pummel”。"},"examples":[{"en":"He was pommeled by the crowd before security stepped in.","zh":"保安介入前，他被人群一顿痛打。"},{"en":"The waves pommeled the boat all night.","zh":"海浪整夜不断拍打着小船。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “pommel”: to strike with the pommel (the knob) of a sword, or to equip something with a pommel (a knob-like end).","zh":"“pommel”的过去式/过去分词：用剑柄末端的圆头（pommel）击打；或给某物装上（类似圆头的）末端饰件/把头。"},"examples":[{"en":"The knight pommeled the attacker with the sword’s pommel.","zh":"骑士用剑柄末端的圆头猛击袭击者。"},{"en":"The antique dagger was pommeled with a silver cap.","zh":"这把古董匕首的把头装有银制饰帽。"}]}],"synonyms":["pummeled","battered","thrashed","hammered"],"phonetic":"/ˈpɑməld/","extraExplanation":["“pommeled”多见于美式拼写：动词以 -el 结尾时，加 -ed 常不双写 l（pommeled）；英式更常写作 “pommelled”。","学习时容易和 “pummeled” 混淆：pummel = 反复痛打（更常用）；pommel 原义与“剑柄末端的圆头/马鞍前桥的凸起”有关，引申才有“用拳头或硬物猛击”的意思。","pommel 这个名词来自法语词根，和“pomme（苹果）”有关，因为那个圆头形状像小苹果。"]}
{"word":"pommeler","summary":{"en":"A “pommeler” is someone or something that hits repeatedly and forcefully.","zh":"“pommeler”指反复、用力猛击的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that pommels (hits repeatedly with fists or blows); a hard hitter.","zh":"猛击者；反复用拳头或重击打人的人或事物；狠揍者。"},"examples":[{"en":"The striker became a real pommeler in the second half, keeping the defense under constant pressure.","zh":"下半场那名前锋成了真正的“狠揍者”，持续给防线施压。"},{"en":"In the bar fight, he was known as a pommeler—someone who wouldn’t stop throwing punches.","zh":"在那场酒吧斗殴里，他被称为“猛击者”——那种出拳不停的人。"}]}],"synonyms":["pummeler","beater","hard hitter","puncher"],"phonetic":"/ˈpɑmələr/","extraExplanation":["“pommeler”来自动词“to pommel”（反复猛击）。需要注意的是，它比较少见；更常用的表达是“a hard hitter / someone who pummels”。","有时会与“pommel”（名词：剑柄末端的圆头、马鞍前端凸起）混淆；但“pommeler”指“打的人/东西”，不是“剑柄/鞍部的圆头”。"]}
{"word":"pommeling","summary":{"en":"“Pommeling” is usually a misspelling of “pummeling,” meaning a hard beating or heavy criticism/attack.","zh":"“pommeling”多半是“pummeling”的拼写错误，指猛烈殴打或强烈抨击/打击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A repeated, heavy hitting or beating; a rough physical attack.","zh":"反复、猛烈的击打或殴打；粗暴的身体攻击。"},"examples":[{"en":"He took a severe pummeling in the fight.","zh":"他在打斗中遭到一顿狠揍。"},{"en":"The storm gave the coast a pummeling all night.","zh":"暴风雨整晚猛烈侵袭海岸。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong, repeated criticism or pressure (often in politics or the media).","zh":"强烈、持续的批评或压力（常见于政治或媒体语境）。"},"examples":[{"en":"The company faced a pummeling from the press after the scandal.","zh":"丑闻曝光后，这家公司遭到媒体连番抨击。"},{"en":"The mayor took a pummeling during the debate.","zh":"市长在辩论中被对手猛烈抨击。"}]}],"synonyms":["beating","battering","thrashing","pounding","lashing (criticism)"],"phonetic":"/ˈpʌməlɪŋ/","extraExplanation":["“pommeling”在英语里不常见，很多情况下是把常用词“pummeling”（一顿狠揍/猛烈打击）拼错了。","“pummeling”来自动词“pummel”（用拳头反复猛击）。在新闻里也常用来形容“猛烈袭击”，比如风暴、批评、选战压力等。"]}
{"word":"pommelion","summary":{"en":"A rare word meaning a stylized pomegranate used as a heraldic symbol or decorative ornament.","zh":"较少见的词，指用作纹章或装饰的“石榴（纹样/图案）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Heraldry/decoration) A stylized pomegranate, often shown split open to reveal seeds, used as a symbol or ornament.","zh":"（纹章学/装饰）石榴的程式化图案，常画成裂开露出籽粒，用作象征或装饰图案。"},"examples":[{"en":"The shield features a golden pommelion to represent fertility and prosperity.","zh":"这面盾徽上有一枚金色的“pommelion（石榴纹）”，象征多产与繁荣。"},{"en":"Carved pommelions decorate the top of the gate like small pomegranates.","zh":"大门顶部雕着“pommelion（石榴形饰）”，像一颗颗小石榴。"}]}],"synonyms":["pomegranate (device)","heraldic pomegranate","ornament","motif"],"phonetic":"/ˈpɑməljən/","extraExplanation":["“pommelion”较少见，多出现在纹章学（heraldry）或古风/装饰艺术语境里，常被理解为“石榴纹（pomegranate device）”。它与常见词“pomegranate（石榴）”不同：后者是日常水果名，前者强调“图案/纹饰/象征”。","在西方象征体系中，石榴常与“多子多福、丰饶、繁荣”相关；在一些传统纹章或宗教艺术里，裂开的石榴（露出籽）也可被用来表达“团结、生命力”等含义。"]}
{"word":"pommelled","summary":{"en":"Pommelled means repeatedly hit or battered (often a spelling variant of American “pummeled”).","zh":"pommelled 指“被反复击打/被打得很惨；（也常作）受到猛烈冲击”，常被视为美式拼写 pummeled 的变体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past participle/adj.) Hit, punched, or beaten repeatedly; battered.","zh":"（过去分词/形容词）被反复击打；被痛打；被打得遍体鳞伤。"},"examples":[{"en":"The boxer was pommelled against the ropes in the final round.","zh":"在最后一回合，那名拳击手被逼到围绳边一顿猛打。"},{"en":"The coastline was pommelled by strong waves all night.","zh":"海岸线整夜都被巨浪猛烈拍打。"},{"en":"After the scandal, the company’s reputation was pommelled in the press.","zh":"丑闻之后，这家公司在媒体上名誉受到了猛烈抨击。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt., past tense/past participle) To hit or strike someone or something repeatedly with fists or heavy blows.","zh":"（及物动词，过去式/过去分词）反复用拳或重击猛打（某人/某物）。"},"examples":[{"en":"He pommelled the door with his fists until someone answered.","zh":"他用拳头不停地猛砸门，直到有人来开。"},{"en":"The storm pommelled the small town with hail.","zh":"暴风雨用冰雹猛烈袭击了那个小镇。"}]}],"synonyms":["pummeled","battered","beat up","thrashed","pounded","hammered","bludgeoned"],"phonetic":"/ˈpʌməld/","extraExplanation":["“pommelled”在现代英语里常被当作“pummeled”的另一种拼写（尤其在英式拼写中更常见），意思是“痛打/猛烈打击”。在美式英语中，更常见的拼写是“pummeled”。","词源上与“pommel”（马鞍前桥、剑柄圆头）有关，早期含有“用拳头或硬物猛击”的感觉。现在多用于比喻：如被批评“痛击”、被风暴“猛袭”。"]}
{"word":"pommeller","summary":{"en":"“pommeller” is usually a misspelling of “pummeler”: someone or something that hits repeatedly, or a dominant competitor.","zh":"“pommeller”通常是“pummeler”的误写：指反复猛击的人或物，也可指非常强势的竞争者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling of “pummeler”) a person or thing that hits or strikes repeatedly; a heavy hitter.","zh":"（常见拼写误写，正确多为“pummeler”）反复猛击的人或物；重拳手、猛击者。"},"examples":[{"en":"In the second round, the boxer turned into a real pummeler and kept attacking.","zh":"第二回合，这位拳击手变成了真正的猛击者，一直在进攻。"},{"en":"The waves were like a pummeler, slamming the rocks all night.","zh":"海浪像猛击者一样，整夜拍打着岩石。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports/informal) a team or player that wins by overwhelming force; a dominant competitor.","zh":"（体育/非正式）以压倒性力量取胜的队伍或选手；强势竞争者。"},"examples":[{"en":"That school’s football team is a pummeler—they rarely lose.","zh":"那所学校的橄榄球队很强势——他们很少输。"}]}],"synonyms":["puncher","brawler","hitter","beater","dominator"],"phonetic":"/ˈpʌmələr/","extraExplanation":["“pommeller”通常不是标准拼写，更常见是“pummeler”（来自动词 pummel，意为“猛击、痛打”）。","容易混淆的词还有“pommel”（马鞍前桥/剑柄圆头，或用拳头柄端击打）。拼写上：pummel（u…e）≠ pommel（o…e）。"]}
{"word":"pommelling","summary":{"en":"“Pommelling” means hitting repeatedly and hard, or a severe beating; it’s an uncommon spelling, usually written as “pummeling/pummelling.”","zh":"“pommelling”表示反复猛烈击打，或指一顿痛打/重创；这种拼写较少见，通常写作“pummeling/pummelling”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of pommel/pummel) hitting someone or something repeatedly, often violently.","zh":"（pommel/pummel 的现在分词）反复猛烈地击打某人或某物。"},"examples":[{"en":"Waves were pommelling the rocks along the shore.","zh":"海浪不断猛烈拍打着岸边的岩石。"},{"en":"The boxer kept pommelling his opponent with quick punches.","zh":"拳击手用快速的拳不停猛击对手。"},{"en":"Heavy rain was pommelling the windows all night.","zh":"大雨整夜猛打着窗户。"}]},{"partOfSpeech":"n.","definition":{"en":"a severe or repeated beating or attack.","zh":"一顿痛打；反复的猛烈攻击（也可指比喻性的“打击”）。"},"examples":[{"en":"The team took a pommelling in the second half.","zh":"那支球队在下半场被打得很惨（遭到重创）。"},{"en":"The company’s stock took a pommelling after the bad news.","zh":"坏消息传出后，公司股价遭到重挫。"}]}],"synonyms":["pummeling","beating","battering","hammering","thrashing"],"phonetic":"/ˈpʌməlɪŋ/","extraExplanation":["“pommelling”在现代英语中更常见的拼写是“pummeling”（美式）或“pummelling”（英式）。“pommel”原本也可作动词，意思接近“pummel”，但日常写作里通常用 pummel/pummelling/pummeling 表示“连续猛击”。"]}
{"word":"pommelo","summary":{"en":"Pomelo: a large citrus fruit with thick peel and sweet to mildly tart segments, similar to grapefruit.","zh":"Pomelo：一种大型柑橘类水果，皮厚，果肉甜到微酸，类似葡萄柚但通常更大、较不苦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large citrus fruit with a thick rind and sweet to mildly tart flesh; it is similar to grapefruit but usually larger and often less bitter.","zh":"柚子（葡萄柚的近亲）：一种大型柑橘类水果，果皮厚，果肉甜到微酸，通常比葡萄柚更大、苦味更少。"},"examples":[{"en":"Pomelo is often eaten fresh or added to salads.","zh":"柚子常常直接生吃，或加入沙拉里。"},{"en":"She peeled a pomelo and shared the segments with her family.","zh":"她剥开一个柚子，把果瓣分给家人。"}]}],"synonyms":["pummelo","shaddock"],"phonetic":"/ˈpɑməˌloʊ/","extraExplanation":["“pomelo”也常写作“pummelo”，两种拼写都正确；在英式与美式写法中都能见到。","在东亚与东南亚饮食文化中，柚子常用于甜品、沙拉或蘸料；英文里有时会把它与grapefruit（葡萄柚）混淆，但pomelo通常更大、皮更厚、苦味更轻。"]}
{"word":"pommels","summary":{"en":"“Pommels” usually means the plural of “pommel”: the rounded front of a saddle or the knob at the end of a sword handle; it can also be the verb form meaning “hits repeatedly.”","zh":"“pommels”通常是“pommel”的复数：指马鞍前端的圆形鞍头或剑柄末端的柄头；也可作动词，表示“连续猛击/痛打”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pommel: the rounded front part of a saddle, used to help a rider keep balance and grip.","zh":"（pommel 的复数）马鞍前端的圆形隆起部分，用来帮助骑手保持平衡和抓握。"},"examples":[{"en":"He grabbed the pommels as the horse jumped the fence.","zh":"马跳过栅栏时，他抓住马鞍前端的隆起部分。"},{"en":"The saddle’s pommels were worn smooth from years of use.","zh":"这副马鞍的鞍头因多年使用而被磨得很光滑。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of pommel: the rounded knob at the end of a sword’s hilt (handle).","zh":"（pommel 的复数）（剑柄末端的）圆形柄头／配重球，用来平衡武器并防止手滑落。"},"examples":[{"en":"The knight’s sword had silver pommels shaped like lions.","zh":"那位骑士的剑柄末端有银制柄头，做成狮子的形状。"},{"en":"A jeweler restored the dagger’s damaged pommels.","zh":"一位珠宝匠修复了这把匕首损坏的柄头。"}]},{"partOfSpeech":"vt.","definition":{"en":"Third-person singular of pommel: to hit someone repeatedly with fists or a blunt force.","zh":"（pommel 的第三人称单数）连续猛击、痛打（常用拳头或钝器）。"},"examples":[{"en":"In the action scene, he pommels the attacker until help arrives.","zh":"在动作戏里，他不断痛打袭击者，直到援助赶到。"},{"en":"The headline says the storm pommels the coast all night.","zh":"标题写道：暴风雨整夜猛袭海岸。"}]}],"synonyms":["saddle horn (similar)","hilt knob","butt (of a sword)","pummel (spelling variant for the verb)"],"phonetic":"ˈpɑməlz","extraExplanation":["“pommel”来自法语词根，和“pomme”（苹果）有关，因为早期鞍头或剑柄末端常做成类似苹果的圆形。","在英式拼写中也常见同形；复数一般写作“pommels”。","文学/历史语境里，骑士与冷兵器描写常出现“sword pommel（剑柄末端）”，如中世纪传奇或骑士小说。"]}
{"word":"pommer","summary":{"en":"“Pommer” is a rare term for a person from Pomerania, and it’s also sometimes used (often as a misspelling) for “Pomeranian,” including the dog breed.","zh":"“Pommer”较少见：可指波美拉尼亚人；也常被当作（多为误拼的）“Pomeranian”，包括指博美犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Pomerania (a historical region on the Baltic Sea); an old-fashioned or rare term in English","zh":"波美拉尼亚人（波罗的海沿岸的历史地区居民）；英语中较古旧或少见的说法"},"examples":[{"en":"In older texts, you may see “Pommer” used for someone from Pomerania.","zh":"在较早的文本里，你可能会看到用“Pommer”指波美拉尼亚人。"},{"en":"The story mentions a Pommer who later moved to Berlin.","zh":"故事中提到一位波美拉尼亚人后来搬到了柏林。"}]},{"partOfSpeech":"n.","definition":{"en":"a rare variant spelling referring to a Pomeranian (especially the small spitz-type dog)","zh":"“Pomeranian”的少见变体拼写；也可指博美犬（小型尖嘴犬）"},"examples":[{"en":"She adopted a Pomeranian—sometimes misspelled as “pommer” online.","zh":"她领养了一只博美犬——网上有时会把它错拼成“pommer”。"}]}],"synonyms":["Pomeranian","Pomeranian person","Pomeranian dog"],"phonetic":"/ˈpɑmɚ/","extraExplanation":["“Pommer”更常见于专有名词（如姓氏）或较旧的英语/德语语境。它与德语“Pommern”（波美拉尼亚）相关；现代英语里通常用“Pomeranian”来指该地区的人或博美犬。","如果你是在其他语境看到“pommer”（例如人名、地名或品牌名），它可能不作为普通英语词汇使用，需要结合上下文判断。"]}
{"word":"pommery","summary":{"en":"Pommery is a famous Champagne brand/house from France.","zh":"Pommery 是法国著名的香槟品牌/酒庄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A well-known Champagne producer (a Champagne house/brand) from Reims, France, especially famous for its brut-style Champagne.","zh":"法国兰斯（Reims）著名的香槟酒庄/品牌（香槟厂商），以干型（brut）香槟闻名。"},"examples":[{"en":"They served Pommery at the wedding toast.","zh":"婚礼祝酒时他们端上了保美（Pommery）香槟。"},{"en":"For a crisp, dry option, she chose a bottle of Pommery Brut.","zh":"想要清爽干型的口感，她选了一瓶保美（Pommery）Brut。"}]}],"synonyms":["Champagne (general term)","Champagne house (category)"],"phonetic":"/ˈpɑməri/","extraExplanation":["“Pommery”是专有名词（品牌名），通常大写；在英语里常与“Champagne / Brut / cuvée”等词搭配使用，如“Pommery Brut”。","在文化语境中，它常出现在餐饮、庆祝、奢华或法式生活方式的描述里；也可能被用作“香槟品牌的代表”来营造氛围。"]}
{"word":"pommet","summary":{"en":"Pommet is a rare word meaning a small rounded knob (often on a weapon handle), and in heraldry it can describe shapes with small knob-like ends.","zh":"Pommet 是较少见的词，指小圆钮状突起（常见于武器柄端等），在纹章学中也可形容末端带小圆球装饰的图形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small rounded knob or button-like ornament (especially a small pommel on a sword hilt or similar fitting)","zh":"（尤指剑柄等部位的）小圆头、小球形突起；钮状装饰（类似小型 pommel）"},"examples":[{"en":"The dagger’s pommet was worn smooth from years of use.","zh":"这把匕首的柄头小圆球因多年使用而磨得光滑。"},{"en":"A tiny silver pommet decorated the end of the handle.","zh":"柄端有一枚小小的银色圆钮作装饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(heraldry) having small knob-like ends or ornaments","zh":"（纹章学）末端带小圆球/小圆钮装饰的（常用于描述十字等图形）"},"examples":[{"en":"The shield shows a cross described as pommet in the blazon.","zh":"这面盾徽上有一个在纹章描述中被称为 pommet 的十字。"}]}],"synonyms":["knob","button","pommel","ornament"],"phonetic":"/ˈpɑmɪt/","extraExplanation":["“pommet”在现代英语里很少见，常被视为“pommel（鞍桥/剑柄的圆头）”的变体或更小的形式。","词源上与法语 pomme（苹果）同源，因为这种圆形突起像小苹果；在纹章学语境中也会用来描述图形末端带小圆球的装饰。"]}
{"word":"pommetty","summary":{"en":"A heraldic adjective meaning “having small ball-like knobs at the ends,” especially used for crosses.","zh":"纹章学形容词，指末端带小球状突起（尤用于十字），即“球头状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Describing an object (especially a cross) whose ends are rounded into small knob-like balls; “pommeled.”","zh":"（纹章学）形容某物（尤指十字）末端呈圆球状小突起的；“球头状的”。"},"examples":[{"en":"The shield shows a cross pommetty in gold on a blue field.","zh":"这面盾徽在蓝底上绘有一枚金色的球头十字。"},{"en":"In heraldic descriptions, “pommetty” tells you the tips end in little rounded knobs.","zh":"在纹章描述里，“pommetty”表示末端是小小的圆球状突起。"}]}],"synonyms":["pommeled","knobbed (heraldic sense)"],"phonetic":"/pɑˈmɛti/","extraExplanation":["“pommetty”主要用于纹章学（heraldry）的专业描述（blazon）中，日常英语很少见。你更可能在博物馆说明牌、家族徽章记录或中世纪题材作品里遇到。","词源上与法语/拉丁语中表示“苹果”的词根有关（pomme），因为这些小圆球看起来像小苹果。","相关表达：cross pommetty（球头十字）；也可与其他纹章形容词并用，如 “a cross pommetty and fitched”（球头且下端尖的十字）。"]}
{"word":"pommey","summary":{"en":"“Pommey” (more often “pommy/pommie”) is Australian/NZ slang for a British person, and it can be offensive depending on context.","zh":"“pommey”（更常见拼写为“pommy/pommie”）是澳新俚语，指英国人；语境不当时可能带冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian & New Zealand slang, sometimes offensive) A British person; an immigrant from Britain, especially in Australia or New Zealand.","zh":"（澳大利亚和新西兰俚语，有时带冒犯）英国人；尤指移居澳大利亚或新西兰的英国移民。"},"examples":[{"en":"Some Australians jokingly call British tourists “pommies,” but it can sound rude to strangers.","zh":"一些澳大利亚人会开玩笑把英国游客叫作“pommies”，但对陌生人听起来可能很无礼。"},{"en":"He’s a Pommy who moved to Sydney for work.","zh":"他是个来悉尼工作的英国移民（Pommy）。"}]}],"synonyms":["Brit","British person"],"phonetic":"/ˈpɑmi/","extraExplanation":["“pommey”更常见的拼写是“pommy / pommie”。属于地域性俚语：在朋友之间可能是玩笑或自嘲，但在正式场合或对不熟的人使用，容易被认为带有贬义。","词源不完全确定：常见说法包括与“pomegranate（石榴）”相关的民间解释、以及与早期移民/囚犯或英国水手的称呼有关等；因为缺乏一致证据，学习时更重要的是掌握它的语气与使用场合。","相关表达：British / Brit（中性常用）；“Pom”也可指英国人，但同样可能带调侃或冒犯色彩。"]}
{"word":"pommie","summary":{"en":"“Pommie/pommy” is an informal (sometimes offensive) term for a British person, used especially in Australia and New Zealand.","zh":"“pommie/pommy”是对英国人的非正式称呼，在澳大利亚和新西兰常见，但有时带冒犯意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(BrE, informal, sometimes offensive) a British person; an English person (especially used by Australians and New Zealanders).","zh":"（英式口语；有时带冒犯）英国人；英格兰人（尤多为澳大利亚人、新西兰人对英国人的称呼）。"},"examples":[{"en":"Some Australians use “pommie” to refer to British people, but it can sound rude.","zh":"有些澳大利亚人用“pommie”来指英国人，但听起来可能不礼貌。"},{"en":"He joked about being a pommie after moving to Sydney.","zh":"他搬到悉尼后开玩笑说自己是个“pommie”。"}]}],"synonyms":["Brit (neutral)","British person (neutral)"],"phonetic":"/ˈpɑːmi/","extraExplanation":["“pommie / pommy”常见于澳大利亚、纽西兰英语，语气从开玩笑到贬义都有，取决于说话人关系与语境。对不熟的人使用可能会显得不尊重；更中性安全的说法是“British person / Brit”。","关于词源有多种说法（例如与“pomegranate/石榴红”或缩写有关），但缺乏一致且可靠的定论；学习时把它当作地区性、带情绪色彩的俗称即可。"]}
{"word":"pommies","summary":{"en":"“Pommies” is a plural slang word for British people, mainly used in Australia and New Zealand, and it can be offensive depending on context.","zh":"“pommies”是指英国人的复数俚语，主要用于澳大利亚和新西兰；视语境可能带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, chiefly in Australia/New Zealand) a British person; “Pommy” is the singular form. Often felt as informal and sometimes insulting, depending on tone and context.","zh":"（俚语，主要用于澳大利亚/新西兰）英国人；单数为 pommy。语气随语境而变，常被认为不太礼貌、甚至带侮辱性。"},"examples":[{"en":"Some Australians still use “pommies” to refer to British tourists, but it can sound rude.","zh":"一些澳大利亚人仍会用“pommies”指英国游客，但听起来可能很没礼貌。"},{"en":"He apologized for calling them “pommies” because he didn’t want to offend anyone.","zh":"他为称呼他们“pommies”道歉，因为他不想冒犯任何人。"}]}],"synonyms":["Brits","British people","people from the UK","Britons"],"phonetic":"ˈpɑmiz","extraExplanation":["用法提醒：在许多场合，“pommies/pommy”带有刻板印象或轻蔑意味；即使有些人把它当玩笑或自嘲使用，你对不熟的人这样说也很容易引起反感。更中性、安全的说法是 “British people / Brits / people from the UK”。","词源并不确定：常见的“Prisoner of Mother England”的说法多被认为是后造的“反向缩略语”（backronym）。一些研究认为它可能与“pomegranate”（石榴，指脸被晒得通红）或早期对英国移民/水手的绰号有关，但没有完全定论。"]}
{"word":"pommy","summary":{"en":"“Pommy” is Australian/NZ slang for a British person; it can be teasing or insulting depending on context.","zh":"“pommy”是澳大利亚/新西兰俚语，指英国人；语气可玩笑也可能带侮辱，取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian/NZ slang) A British person, especially an English person; sometimes used jokingly but can also be insulting.","zh":"（澳大利亚/新西兰俚语）英国人，尤其是英格兰人；可开玩笑使用，但也可能带有冒犯或贬义。"},"examples":[{"en":"Some Aussies call British tourists “pommies,” but it can sound rude to strangers.","zh":"有些澳洲人会把英国游客叫作“pommies”，但对不熟的人听起来可能很无礼。"},{"en":"He moved from London last year, so his coworkers teased him for being a pommy.","zh":"他去年从伦敦搬来，所以同事开玩笑说他是个“pommy”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to British people (often informal and sometimes derogatory).","zh":"与英国人有关的（非正式用法，有时带贬义）。"},"examples":[{"en":"They made a few pommy jokes during the game.","zh":"比赛时他们讲了几个取笑英国人的“pommy”笑话。"}]}],"synonyms":["Brit","British person","English person (more specific)"],"phonetic":"/ˈpɑmi/","extraExplanation":["用法提醒：在澳大利亚/新西兰，朋友之间可能把它当作玩笑昵称，但在正式场合或对陌生英国人使用，容易被认为是带偏见或歧视性的称呼，建议改用“British person / Brit”。","词源不完全确定：常见说法包括与“pomegranate（石榴）”有关（指英国人晒伤后皮肤发红），以及民间讹传的缩写“Prisoner of Mother England（母国英格兰的囚犯）”，但后者多被认为是后起的解释。"]}
{"word":"pomo","summary":{"en":"“Pomo” is an informal short form of “postmodern” or “postmodernism.”","zh":"“pomo”是“postmodern（后现代的）”或“postmodernism（后现代主义）”的非正式缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Postmodernism; a style or movement in art, literature, architecture, or culture that often mixes styles, questions “one true meaning,” and may use irony or parody.","zh":"（非正式）后现代主义；一种艺术、文学、建筑或文化思潮/风格，常混搭多种风格、质疑“唯一真理/唯一意义”，并常用反讽或戏仿。"},"examples":[{"en":"Her essay compares modernism and pomo in American fiction.","zh":"她的文章比较了美国小说中的现代主义与后现代主义。"},{"en":"The museum’s new show leans heavily into pomo—bright colors, collage, and irony.","zh":"博物馆的新展览很“后现代”——鲜艳色彩、拼贴和反讽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Postmodern; having qualities associated with postmodernism.","zh":"（非正式）后现代的；具有后现代主义特征的。"},"examples":[{"en":"The building looks very pomo, with playful shapes and mixed materials.","zh":"这栋建筑看起来很后现代，造型俏皮、材质混搭。"},{"en":"It’s a pomo novel that tells the story from many conflicting viewpoints.","zh":"这是一部后现代小说，用多个彼此矛盾的视角讲故事。"}]}],"synonyms":["postmodern","postmodernism","postmodernist"],"phonetic":"/ˈpoʊmoʊ/","extraExplanation":["“pomo”通常出现在英语口语、评论或社交媒体里，是“postmodern / postmodernism”的缩写，语气更随意；正式写作中更常用全称。","后现代作品常见特征包括：拼贴/混搭（pastiche）、自我指涉（作品意识到自己是作品）、非线性叙事、反讽、对“权威叙事”的怀疑等。","小提醒：在不同圈子里“pomo”偶尔也可能被用作其他缩写（如特定社群或品牌用法），若上下文不是艺术/文化讨论，最好确认具体含义。"]}
{"word":"pomoerium","summary":{"en":"The pomerium was the sacred boundary defining the official limits of ancient Rome, with special legal and religious rules tied to it.","zh":"pomerium 指古罗马的神圣城界线，界定城市正式范围，并关联特殊的法律与宗教规定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, a sacred boundary line marking the official limits of the city; building and certain political or military actions were restricted within it.","zh":"（古罗马）“城界/圣界”：标示罗马城正式范围的神圣边界线；在此界内建造、以及某些政治或军事行为受到限制。"},"examples":[{"en":"In Roman history, generals were expected to lay down their military command before crossing the pomerium.","zh":"在罗马史中，将领通常被要求在跨越城界（pomerium）之前解除军权。"},{"en":"The emperor extended the pomerium to symbolize Rome’s growth and authority.","zh":"皇帝扩展城界（pomerium）以象征罗马的扩张与权威。"}]}],"synonyms":["sacred boundary","city boundary","ritual boundary"],"phonetic":"/poʊˈmɪriəm/","extraExplanation":["你写的“pomoerium”常见为拼写误差；标准拼写是 **pomerium**。它不是普通的“城墙”，而是一条带有宗教意义的界线：罗马的“城市身份”与某些法律/仪式规定都与这条界线相关。","相关文化点：在传统观念里，罗马城内（pomerium 之内）更强调“公民与政治秩序”，而军队与武装力量更偏向城外；因此跨越 pomerium 往往具有象征意义。"]}
{"word":"pomolo","summary":{"en":"Pomolo means a knob-like handle or rounded decorative piece, especially in Italian-style design contexts.","zh":"Pomolo 指圆形把手或球状装饰件，多见于意式风格的设计、古董或装饰语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a knob or rounded ornament (often on furniture, doors, or the end of an object), from Italian usage","zh":"（常指家具、门或物体末端的）圆形把手；球形装饰（源自意大利语用法）"},"examples":[{"en":"The antique cabinet has brass pomoli that match the hinges.","zh":"那只古董柜子有黄铜的圆形拉手，和铰链很搭。"},{"en":"He replaced the broken pomolo on the drawer with a simple wooden one.","zh":"他把抽屉上坏掉的圆形拉手换成了一个朴素的木制拉手。"}]}],"synonyms":["knob","handle","pull","ornament"],"phonetic":"/poʊˈmoʊloʊ/","extraExplanation":["“Pomolo”主要来自意大利语，原意接近“旋钮/把手/球形突起”。在英语里它不算常见，更多出现在艺术史、家具设计、建筑装饰或古董描述中。","相关词对比：英语更常用的是 knob（旋钮/把手）、handle（把手）、pull（抽屉拉手）。如果指武器末端的圆头，更常见的英语词是 pommel（剑柄末端的圆头）。"]}
{"word":"pomological","summary":{"en":"Pomological means “related to the scientific study and cultivation of fruit.”","zh":"pomological 指“与果树学（水果的研究与栽培）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pomology (the study and cultivation of fruit, especially apples, pears, and other tree fruits).","zh":"与果树学（研究与栽培果树，尤指苹果、梨等树果）有关的。"},"examples":[{"en":"She wrote a pomological report on apple varieties grown in the region.","zh":"她写了一份关于本地区苹果品种的果树学报告。"},{"en":"The museum has a small pomological collection of wax fruit models.","zh":"这家博物馆有一小批果树学相关的蜡制水果模型收藏。"}]}],"synonyms":["pomology-related","fruit-cultivation (related)","fruit-growing (related)"],"phonetic":"/ˌpoʊməˈlɑːdʒɪkəl/","extraExplanation":["“pomological”来自“pomology”（果树学），词根“pomo-”源自拉丁语“pomum”（水果），“-logy”表示“学科/研究”。日常生活中不常用，多见于农业、园艺、博物馆收藏与品种研究等语境。","相关词：pomology（果树学）；pomologist（果树学家/果树研究者）。常见近义表达（更口语）：fruit-growing / fruit cultivation（果树栽培/水果种植）。"]}
{"word":"pomologically","summary":{"en":"“Pomologically” means “in a way related to the scientific study of fruit and fruit cultivation.”","zh":"“pomologically”表示“从果树学/果品学角度；与水果及其栽培的科学研究相关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to pomology (the study of fruit and fruit growing).","zh":"以果树学/果品学（研究水果及其栽培的学科）的方式；在果树学意义上。"},"examples":[{"en":"The orchard was evaluated pomologically, focusing on apple varieties and their harvest times.","zh":"果园从果树学角度进行了评估，重点关注苹果品种及其采收期。"},{"en":"Pomologically speaking, this pear has strong storage potential.","zh":"从果树学角度来说，这种梨的贮藏潜力很强。"}]}],"synonyms":["from a pomological perspective","in terms of pomology","horticulturally (broader)"],"phonetic":"/ˌpoʊməˈlɑdʒɪkli/","extraExplanation":["“Pomology”源自拉丁语 pomum（水果）+ -logy（学科/研究）。在农业、园艺、食品科学语境中更常见；日常口语里很少用“pomologically”，通常会说“from a pomology/pomological perspective（从果树学角度）”。"]}
{"word":"pomologies","summary":{"en":"“Pomologies” is the plural of “pomology,” meaning the study (or sometimes the books) of fruit and fruit-growing.","zh":"“Pomologies”是“pomology”的复数，指果树学/果品栽培学（有时也指相关著作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of fruit and fruit-growing (plural form)","zh":"果树学；果品栽培学（复数形式）"},"examples":[{"en":"Universities sometimes offer courses in pomologies such as apple and pear cultivation.","zh":"大学有时会开设果树学相关课程，例如苹果和梨的栽培。"},{"en":"Her research interests include several pomologies, especially citrus and stone fruits.","zh":"她的研究兴趣包括多个果树学方向，尤其是柑橘类和核果类水果。"}]},{"partOfSpeech":"n.","definition":{"en":"books or written works about fruit and fruit-growing (less common; plural form)","zh":"果树学著作；果品栽培相关书籍（较少见；复数形式）"},"examples":[{"en":"The library’s rare pomologies contain detailed illustrations of old apple varieties.","zh":"图书馆的珍稀果树学著作里有许多老苹果品种的精细插图。"}]}],"synonyms":["pomology","fruit science","fruit growing","horticulture (broader)"],"phonetic":"/pəˈmɑlədʒi/","extraExplanation":["“pomologies”是“pomology”的复数。日常英文里更常说“pomology”（这门学科）或“fruit science / fruit growing”。","词源上，“pomo-”来自拉丁语“pomum”（水果），“-logy”表示“……的学问/研究”。","在学术或农业语境中常见：如“pomology department（果树学系）”“pomological research（果树学研究）”。"]}
{"word":"pomologist","summary":{"en":"A pomologist is a fruit-growing and fruit-science specialist, especially for tree fruits.","zh":"pomologist 指研究与栽培果树的专家，尤指苹果、梨等树生水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist or specialist who studies and grows fruit, especially tree fruit such as apples, pears, and peaches.","zh":"果树学家；果树栽培与研究专家（尤指苹果、梨、桃等树生水果）。"},"examples":[{"en":"The pomologist evaluated which apple varieties would grow best in the local climate.","zh":"果树学家评估哪些苹果品种最适合当地气候。"},{"en":"She works as a pomologist, developing disease-resistant pear trees.","zh":"她是一名果树学家，致力于培育抗病的梨树品种。"}]}],"synonyms":["fruit scientist","fruit specialist","horticulturist"],"phonetic":"/pəˈmɑlədʒɪst/","extraExplanation":["词源：pomo- 来自拉丁语 pomum（“水果”），-logist 表示“研究……的人”。合起来就是“研究水果（尤其果树）的专家”。","使用场景：该词多见于农业、园艺、科研或果园管理语境；日常口语中更常说 fruit scientist（水果研究员）或 horticulturist（园艺学家）。","相关词：pomology（果树学/果树栽培学）；pomological（果树学的）。","小提示：pomologist 通常关注可食用水果的品种改良、栽培管理、病虫害防治与采后品质等，区别于专门研究观赏植物的 botanist（植物学家）或园艺范围更广的 horticulturist。"]}
{"word":"pomology","summary":{"en":"Pomology is the branch of science that focuses on fruit and fruit trees.","zh":"Pomology 指研究水果与果树的科学（果树学/果品学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of fruit and fruit trees, including how to grow, improve, store, and use them","zh":"果树学；果品学（研究水果与果树的栽培、改良、贮藏与利用的科学）"},"examples":[{"en":"She studied pomology and now works at an apple research center.","zh":"她学习果树学，现在在苹果研究中心工作。"},{"en":"Pomology helps farmers choose fruit varieties that grow well in their climate.","zh":"果树学能帮助农民选择适合当地气候的水果品种。"}]}],"synonyms":["fruit science","fruit growing (contextual)","horticulture (broader)"],"phonetic":"/pəˈmɑːlədʒi/","extraExplanation":["词源：pomo- 来自拉丁语 pomum（“水果/果实”），-logy 表示“……学/研究”。所以 pomology 字面意思是“关于水果的研究”。","使用场景：多见于农业、园艺、食品科学和高校专业名称中；日常生活中更常说 fruit science 或 horticulture（园艺学）来泛指。","相关词：pomologist（果树学家）；horticulture（园艺学，范围比果树学更广，还包括蔬菜、花卉等）。"]}
{"word":"pomona","summary":{"en":"Pomona is a proper noun: the Roman goddess of orchards and fruit, and also the name of a city in Southern California (and institutions named after it).","zh":"Pomona 是专有名词：既指罗马神话中的果园与水果女神，也指美国南加州的一座城市（以及以此命名的机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman mythology) The goddess of fruit trees, gardens, and orchards.","zh":"（罗马神话）果树、花园与果园的女神。"},"examples":[{"en":"In Roman myths, Pomona protects orchards and the harvest of fruit.","zh":"在罗马神话中，Pomona 守护果园与水果的收成。"},{"en":"The poem mentions Pomona to symbolize abundance and ripe fruit.","zh":"诗歌提到 Pomona，用来象征丰饶与成熟的果实。"}]},{"partOfSpeech":"n.","definition":{"en":"A city in Los Angeles County, Southern California.","zh":"（美国）加利福尼亚州南部洛杉矶县的城市 Pomona（波莫纳）。"},"examples":[{"en":"She drove from Pomona to downtown Los Angeles for work.","zh":"她从 Pomona 开车到洛杉矶市中心上班。"},{"en":"The concert will be held in Pomona this weekend.","zh":"这场音乐会将于本周末在 Pomona 举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also in names) Refers to institutions named after the city or the goddess, such as Pomona College.","zh":"（也用于名称中）指以该城市或女神命名的机构，如 Pomona College（波莫纳学院）。"},"examples":[{"en":"He applied to Pomona College and other liberal arts schools.","zh":"他申请了 Pomona College 等文理学院。"}]}],"synonyms":["(mythology) none common","(place) none; it’s a proper name"],"phonetic":"/pəˈmoʊnə/","extraExplanation":["Pomona 这个名字来自拉丁语 pomum（“水果/果实”）。在艺术与文学里，她常被描绘为手持果篮、修剪果树，象征丰收与园艺之美。","英语里它通常作为专有名词使用，首字母大写（Pomona）。当指“城市/学院”等具体对象时，含义取决于上下文。"]}
{"word":"pomonal","summary":{"en":"Pomonal is a rare adjective meaning “related to fruit (especially apples).”","zh":"Pomonal 是一个罕用形容词，意思是“与水果（尤指苹果）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to fruit, especially to apples or orchard fruit (from Latin *pomum* “fruit”).","zh":"（罕用）与水果有关的；尤指与苹果或果园水果有关的（源自拉丁语 *pomum*“果实”）。"},"examples":[{"en":"The study describes pomonal traits in different apple varieties.","zh":"这项研究描述了不同苹果品种的果实相关特征。"},{"en":"They recorded pomonal changes as the fruit ripened in the orchard.","zh":"他们记录了果园里水果成熟过程中与果实相关的变化。"}]}],"synonyms":["fruity","fruit-related","orchard-related","pomaceous (more specific: apple-like)"],"phonetic":"/ˈpoʊmənəl/","extraExplanation":["“pomonal”在现代英语中非常少见，通常只会在较旧的植物学/农业写作里出现。更常见、更容易理解的表达是：“fruit-related / related to apples / orchard-related”。","注意不要和“pulmonal / pulmonary”（与肺有关的）混淆；两者拼写相近，但含义完全不同。若你原本想查“与肺有关的”，更可能是“pulmonary”。"]}
{"word":"pomonic","summary":{"en":"Pomonic means “related to fruit or orchards,” often in a literary/formal way.","zh":"pomonic 指“与水果或果园有关的”，多见于文学或较正式的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to fruit, fruit trees, or orchards (especially in a literary or formal style).","zh":"（尤用于文学或正式语境）与水果、果树或果园有关的；果实的。"},"examples":[{"en":"The region’s pomonic wealth comes from its long tradition of apple orchards.","zh":"这个地区的“果园之富”来自其悠久的苹果种植传统。"},{"en":"She described the pomonic scent of late summer—peaches, plums, and warm sunlight.","zh":"她描写了夏末那种“果香”的气息——桃子、李子与温暖的阳光。"}]}],"synonyms":["orchard","fruity","pomal","pomological"],"phonetic":"/pəˈmɑːnɪk/","extraExplanation":["“pomonic”源自拉丁语 Pomona（波莫娜），罗马神话中掌管果树与果园的女神。这个词在现代英语里较少见，多出现在文学描写、园艺写作或带有古典色彩的表达中。","与常用词对比：日常表达通常用 “fruity / orchard / fruit-growing”，而 “pomonic”更强调一种带古典或诗意的“果园/果实氛围”。"]}
{"word":"pomp","summary":{"en":"Pomp means impressive, formal display—either grand ceremony or (disapprovingly) showy self-importance.","zh":"pomp 指隆重的排场或仪式；也可（贬义）指装腔作势、自命不凡的架子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A grand, showy display or ceremony, especially by people in power; splendor with a formal, impressive style.","zh":"（尤指权势人物的）盛大排场；隆重的仪式；华丽的场面。"},"examples":[{"en":"The wedding was full of pomp and tradition.","zh":"这场婚礼充满了盛大的排场和传统仪式。"},{"en":"The president arrived with great pomp, surrounded by guards and cameras.","zh":"总统在警卫和镜头的簇拥下盛大登场。"},{"en":"Some people prefer simple celebrations rather than pomp.","zh":"有些人更喜欢朴素的庆祝方式，而不是铺张排场。"}]},{"partOfSpeech":"n.","definition":{"en":"Self-important pride shown through fancy behavior or speech; a sense of being more important than others (often disapproving).","zh":"（常含贬义）自命不凡的傲气；装腔作势的架子。"},"examples":[{"en":"He spoke with pomp, as if everyone should listen.","zh":"他说话带着架子，好像所有人都该听他。"},{"en":"Her writing avoids pomp and stays clear and direct.","zh":"她的写作避免装腔作势，保持清晰直接。"}]}],"synonyms":["ceremony","splendor","pageantry","show","ostentation","self-importance"],"phonetic":"/pɑmp/","extraExplanation":["“pomp”常与“circumstance（场面/情势）”一起出现，最有名的搭配来自莎士比亚《奥赛罗》中的短语“Pride, pomp, and circumstance…”。英语里也有进行曲名《Pomp and Circumstance》，常用于毕业典礼等庄重场合。","近义词辨析：pomp偏“正式、隆重、有排场（有时显得过度）”；“luxury”更偏“奢华享受”；“pageantry”强调“游行、服饰、舞台化表演”的视觉效果。"]}
{"word":"pompa","summary":{"en":"“Pompa” usually means “pump,” but it’s not common standard English; English typically uses “pump.”","zh":"“pompa”通常相当于“pump（泵）”，但在英语里不算常用标准词；英语一般直接说“pump”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pump; a machine that moves liquids or gases (commonly used in languages like Indonesian, Italian, Spanish, and Polish; not a standard everyday English word).","zh":"泵；用来输送液体或气体的机器（常见于印尼语、意大利语、西班牙语、波兰语等；在英语里不是常用标准词）。"},"examples":[{"en":"In Indonesian, “pompa air” means “water pump.”","zh":"在印尼语里，“pompa air”意思是“水泵”。"},{"en":"The mechanic replaced the fuel pump.","zh":"修理工更换了燃油泵。"}]}],"synonyms":["pump"],"phonetic":"/ˈpɑmpə/","extraExplanation":["在英语里更常见的是 **pump**（泵）以及 **pomp**（排场、盛况）。很多学习者看到“pompa”时，其实是在别的语言里遇到的拼写，英语交流中通常建议直接用 **pump**。","如果你是在特定语境（例如产品名、品牌、外文说明书、歌名/人名/地名）看到 “Pompa”，它可能是专有名词，需要结合上下文判断。你可以把原句发来，我可以帮你确定意思。"]}
{"word":"pompadour","summary":{"en":"A pompadour is most commonly a hairstyle with hair swept up and back to form height at the front.","zh":"pompadour最常指一种把头发向上并向后梳、前部蓬起有高度的发型（庞帕杜发型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hairstyle with the hair swept up and back from the forehead, creating a raised “pomp” (volume) in front.","zh":"（一种发型）把前额前方的头发向上梳起并向后梳，前部蓬起、有明显高度的“蓬巴杜/庞帕杜”发型。"},"examples":[{"en":"He styled his hair into a pompadour for the rock-and-roll concert.","zh":"他为了那场摇滚音乐会把头发做成了庞帕杜发型。"},{"en":"A classic pompadour needs height at the front and a smooth sweep to the back.","zh":"经典的庞帕杜发型前部要有高度，后面要梳得顺滑。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman’s dress or jacket with a long, full back (an older fashion term).","zh":"（旧时用语）后摆加长且较蓬松的女装连衣裙或外套。"},"examples":[{"en":"In the museum, there was an 18th-century pompadour displayed beside other court fashions.","zh":"在博物馆里，一件18世纪的庞帕杜式服装与其他宫廷服饰一起展出。"}]}],"synonyms":["quiff","swept-back hairstyle","bouffant (related, but not the same)"],"phonetic":"/ˈpɑm.pəˌdɔr/","extraExplanation":["“pompadour”源自法国路易十五的情妇蓬帕杜夫人（Madame de Pompadour）。她的名字后来被用来指一种强调前额发量与高度的发型。","现代英语里最常用的是“发型”的意思，常与复古风、摇滚（尤其是50年代风格）联系在一起；例如有人会提到Elvis Presley的经典庞帕杜造型。"]}
{"word":"pompadours","summary":{"en":"Pompadours are high, swept-back hairstyles (plural of “pompadour”).","zh":"Pompadours 指“庞巴杜发型”的复数，即把头发从额前向上向后梳起的高耸发型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hairstyle in which the hair is brushed up and back from the forehead, forming a high, rounded shape (often associated with Elvis Presley and 1950s style); “pompadours” is the plural form","zh":"一种把头发从前额向上、向后梳起、形成高高蓬松弧形的发型（常与猫王和20世纪50年代风格有关）；“pompadours”为复数"},"examples":[{"en":"In the 1950s, many young men wore pompadours and leather jackets.","zh":"在20世纪50年代，很多年轻男性会梳庞巴杜发型、穿皮夹克。"},{"en":"Her pompadour made her look taller and more dramatic on stage.","zh":"她的庞巴杜发型让她在舞台上看起来更高、更有气场。"}]}],"synonyms":["quiff","swept-back hairstyle","rockabilly hairstyle"],"phonetic":"/ˈpɑmpəˌdʊr/","extraExplanation":["“pompadour”一词来自18世纪法国的蓬巴杜夫人（Madame de Pompadour），据说她的发型把头发在前额处梳得很高，因此这种“高耸前额”的造型后来以她命名。后来在摇滚与复古文化中（尤其是猫王形象）再度流行。","用法提示：日常会说 “a pompadour” 或 “wear a pompadour”。当你看到 “pompadours”，通常是指“多个这样的发型/不同人的庞巴杜发型”。"]}
{"word":"pompal","summary":{"en":"“Pompal” is rare/nonstandard; it means “pompous” or “showing pomp.” Use “pompous” in most situations.","zh":"“pompal”很罕见且不太标准，意思接近“pompous / 有排场而自负的”。大多数场合建议用“pompous”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Showing pomp; overly grand or self-important. In modern English, people usually say “pompous.”","zh":"（罕见/非标准）表现出排场或盛大；自命不凡、装腔作势。现代英语中通常用“pompous”。"},"examples":[{"en":"His speech sounded pompal, as if he wanted to impress everyone.","zh":"他的演讲听起来很“pompal”，仿佛想给所有人留下深刻印象。"},{"en":"The ceremony felt a bit pompal for such a small event.","zh":"对这么小的活动来说，这个仪式显得有点过于铺张。"}]}],"synonyms":["pompous","grand","self-important","pretentious"],"phonetic":"ˈpɑmpəl","extraExplanation":["“pompal”不是现代英语里常见、标准的词；很多情况下可能是拼写错误或误听。更自然的表达通常是：pompous（装腔作势的/自负的）、pomp（排场/盛况）。","如果你想说“很有排场的仪式/场面”，也可以用：grand, ceremonial, ornate；如果想说“人很爱摆架子”，用：pompous, arrogant, self-important 更常见。"]}
{"word":"pompano","summary":{"en":"Pompano is a popular edible saltwater fish, often served in seafood dishes.","zh":"Pompano 指一种常见的可食用海鱼，常用于各类海鲜料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of edible marine fish, often found in warm waters and valued for its mild, rich flavor","zh":"一种可食用的海鱼，常见于温暖海域，以味道清淡但鲜美而受欢迎"},"examples":[{"en":"We ordered grilled pompano with lemon and herbs.","zh":"我们点了柠檬香草烤鲳鲹（pompano）。"},{"en":"Pompano is popular in coastal seafood restaurants.","zh":"在海边的海鲜餐厅里，pompano 很受欢迎。"},{"en":"Fresh pompano has firm, white flesh.","zh":"新鲜的 pompano 肉质紧实、颜色偏白。"}]}],"synonyms":["Florida pompano","pomfret (sometimes used loosely on menus)"],"phonetic":"/ˈpɑːm.pə.noʊ/","extraExplanation":["“pompano”在餐馆菜单上通常直接写作 pompano，中文有时会按不同地区翻译为“鲳鲹”等（对应不同鱼类/品种的俗名可能不完全一致）。点餐时把它理解为“可食用的海水鱼名”最稳妥。","在美国语境里，pompano 常让人联想到佛罗里达等温暖海域的海鲜；也常出现在菜名如 “Florida pompano”。"]}
{"word":"pompanos","summary":{"en":"“Pompanos” means more than one pompano, a popular edible ocean fish.","zh":"“Pompanos”是pompano的复数，指多条庞帕诺鱼，一种常见且受欢迎的可食用海鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pompano: a group of ocean fish (especially the Florida pompano) valued for eating.","zh":"pompano（鲳鲹/庞帕诺鱼）的复数：一种海水鱼（尤其指佛罗里达鲳鲹），常被视为美味食用鱼。"},"examples":[{"en":"The market had fresh pompanos on ice.","zh":"市场里有新鲜的庞帕诺鱼，放在冰上保鲜。"},{"en":"They grilled the pompanos with lemon and herbs.","zh":"他们用柠檬和香草把这些鱼烤了。"}]}],"synonyms":["pompano (plural form)","pompanos (as a menu/market term for multiple fish)"],"phonetic":"/pɑmˈpænoʊz/","extraExplanation":["“Pompano”常见于美国沿海地区的菜单与海鲜市场，尤其在佛罗里达很有名。它通常指肉质细嫩、适合清蒸、香煎或烧烤的鱼类。","在英语里食物名常用复数表示“几条/几只”，如：oysters（牡蛎）、sardines（沙丁鱼）；因此菜单上看到“pompanos”通常意味着“几条庞帕诺鱼”。"]}
{"word":"pompatic","summary":{"en":"Pompous means overly self-important or showy in a formal, grand way.","zh":"Pompous 指人过分自命不凡、摆架子；也可指过于讲排场、隆重而显得做作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too proud and self-important; speaking or acting as if you are better or more important than others.","zh":"自命不凡的；傲慢自大的；说话或行为表现得好像自己比别人更重要。"},"examples":[{"en":"He sounded pompous when he kept using big words to impress everyone.","zh":"他为了给大家留下深刻印象一直用大词儿，说话听起来很自大。"},{"en":"Her pompous attitude made it hard for the team to work with her.","zh":"她那种自大的态度让团队很难跟她合作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing or involving formal ceremony and display (sometimes used for events, speeches, or writing).","zh":"铺张的；讲排场的；（用于形容活动、演讲或文章）带有隆重仪式感与炫耀性。"},"examples":[{"en":"The speech was so pompous that it felt more like a performance than a welcome.","zh":"这场演讲太讲排场了，感觉更像表演而不是欢迎致辞。"},{"en":"They planned a pompous ceremony with flags, music, and long introductions.","zh":"他们策划了一场很铺张的仪式，有旗帜、音乐和冗长的介绍。"}]}],"synonyms":["self-important","arrogant","pretentious","conceited","grandiose"],"phonetic":"/ˈpɑmpəs/","extraExplanation":["你输入的“pompatic”不是常见英文单词，最可能是拼写想表达 **pompous**（自大、装腔作势的）。","词源提示：**pompous** 来自 **pomp**（盛况、排场、夸耀），常用来批评一个人“端着、摆架子”。","文学/文化中常见用法：在讽刺作品里，作家常用 **pompous** 描写“爱说教、爱摆官腔”的人物（例如某些自以为是的官员或老师形象）。","相关表达：**pomp and circumstance**（盛典排场；隆重场面，常指仪式感很强的场合）。"]}
{"word":"pompeian","summary":{"en":"Pompeian means “connected with Pompeii,” especially its ruins, art, and culture; less commonly, it can mean a person from Pompeii.","zh":"Pompeian指“与庞贝有关的”，尤指其遗址、艺术与文化；较少情况下也可指“庞贝人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Pompeii (the ancient Roman city near Naples, Italy) or its people, art, and culture—especially in reference to the city preserved by the eruption of Mount Vesuvius in AD 79.","zh":"与庞贝（意大利那不勒斯附近的古罗马城市）及其居民、艺术、文化有关的；尤指被公元79年维苏威火山喷发保存下来的庞贝遗址相关的。"},"examples":[{"en":"The museum has a Pompeian fresco showing everyday Roman life.","zh":"这家博物馆收藏了一幅庞贝壁画，展现了古罗马的日常生活。"},{"en":"We visited Pompeian ruins and saw the streets, homes, and public baths.","zh":"我们参观了庞贝遗址，看到了街道、民居和公共浴场。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Pompeii (less common).","zh":"庞贝人；来自庞贝的人（较少用）。"},"examples":[{"en":"Some writings mention Pompeians fleeing toward the coast.","zh":"一些记载提到庞贝人逃向海岸。"}]}],"synonyms":["Pompeiian (variant spelling, less common)","of Pompeii"],"phonetic":"/pɑmˈpeɪən/","extraExplanation":["“Pompeian”多用于历史、考古、艺术语境（如Pompeian fresco/house/style）。在英语里更常见的搭配是“Pompeii (n.) + 名词”（如Pompeii ruins），而“Pompeian + 名词”更像学术/展览说明的用法。","文化背景：庞贝因火山灰迅速覆盖而保存了大量壁画、马赛克、涂鸦与建筑细节，因此“Pompeian”常带有“细节丰富、保存完好、古罗马日常生活的窗口”的联想。","文学与常见提及：在英语写作中，Pompeii/ Pompeian常作为“突如其来的灾难、时间凝固、文明被瞬间定格”的象征意象出现。"]}
{"word":"Pompeii","summary":{"en":"Pompeii is an ancient Roman city in Italy, buried by the AD 79 eruption of Mount Vesuvius and now famous for its well-preserved ruins.","zh":"Pompeii（庞贝）是意大利的古罗马城市，公元79年因维苏威火山喷发被掩埋，如今以保存完好的遗址闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Roman city near Naples, Italy, famously buried by ash and pumice after the eruption of Mount Vesuvius in AD 79; today it is a major archaeological site.","zh":"庞贝：意大利那不勒斯附近的古罗马城市，公元79年因维苏威火山喷发被火山灰与浮石掩埋；如今是重要的考古遗址。"},"examples":[{"en":"Pompeii was buried in AD 79 when Mount Vesuvius erupted.","zh":"公元79年维苏威火山喷发，庞贝城被掩埋。"},{"en":"Many tourists visit Pompeii to see preserved streets, homes, and frescoes.","zh":"许多游客参观庞贝，观看保存下来的街道、住宅和壁画。"},{"en":"The ruins of Pompeii offer a vivid picture of daily life in the Roman Empire.","zh":"庞贝遗址生动展现了罗马帝国时期的日常生活。"}]}],"phonetic":"/pɑmˈpeɪ.i/","extraExplanation":["“Pompeii”在英语里通常直接指这座城市/遗址；形容词形式常见为“Pompeian”（庞贝的、庞贝风格的）。","庞贝因“瞬间被封存”的特征而常被用作文化隐喻：突然的灾难、时间被凝固的场景、或被完整保留下来的过去。","在影视与流行文化中（如歌曲、电影、小说），“Pompeii”常被借来表达灾难后的沉默、遗憾与记忆。"]}
{"word":"pompeii","summary":{"en":"Pompeii is an ancient Roman city buried by Mount Vesuvius in AD 79, and it’s also used as a metaphor for sudden destruction or a moment frozen in time.","zh":"Pompeii（庞贝）是公元79年被维苏威火山掩埋的古罗马城市，也常被用作“突如其来的毁灭/时间被定格”的比喻。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An ancient Roman city near Naples, Italy, famously destroyed and buried by the eruption of Mount Vesuvius in AD 79; today it is a major archaeological site.","zh":"庞贝：意大利那不勒斯附近的一座古罗马城市，公元79年因维苏威火山喷发被毁并掩埋；如今是重要的考古遗址。"},"examples":[{"en":"We visited Pompeii and walked along its preserved streets and villas.","zh":"我们参观了庞贝，走在保存完好的街道和别墅之间。"},{"en":"Pompeii offers a rare snapshot of everyday life in the Roman Empire.","zh":"庞贝为研究罗马帝国的日常生活提供了罕见的“定格画面”。"}]},{"partOfSpeech":"other","definition":{"en":"A cultural reference meaning sudden destruction, tragedy, or a moment “frozen in time,” often used in writing and media.","zh":"（引申义）文化意象：常用来指突如其来的毁灭与悲剧，或“时间被凝固”的瞬间（常见于文章与媒体表达）。"},"examples":[{"en":"The abandoned town felt like a modern Pompeii after the disaster.","zh":"灾难过后，这座被遗弃的小镇像“现代庞贝”一样。"},{"en":"The photographs turned the scene into a kind of Pompeii—everything stopped mid‑gesture.","zh":"这些照片让现场像庞贝一样——一切都停在动作的中途。"}]}],"synonyms":["ancient Roman city","archaeological site"],"phonetic":"/pɑmˈpeɪ/","extraExplanation":["“Pompeii”读作/ pɑmˈpeɪ /，英语里通常把重音放在第二个音节。","庞贝位于意大利坎帕尼亚大区，靠近那不勒斯；火山灰与浮石迅速覆盖城市，使大量建筑、壁画、器物甚至人体空腔都得以保存，成为考古学与古罗马史的重要资料来源。","在英语写作中，“a modern Pompeii”常作为比喻，用来强调灾难后的突然停摆与被保存/被定格的场景；使用时注意语境庄重，避免轻率地套用在与悲剧不相称的场合。","相关词：Mount Vesuvius（维苏威火山）、Herculaneum（赫库兰尼姆，另一座同样受灾的古城）、archaeological site（考古遗址）。"]}
{"word":"pompelmoose","summary":{"en":"“pompelmoose” is a playful, nonstandard spelling for “pamplemousse” (grapefruit).","zh":"“pompelmoose”是“pamplemousse（葡萄柚/西柚）”的俏皮、非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) A humorous misspelling or playful way to say “pamplemousse,” meaning grapefruit (especially in menus, flavors, or perfumes).","zh":"（非标准拼写）“pamplemousse（葡萄柚/西柚）”的搞笑拼写或俏皮说法，常见于菜单、口味或香氛语境。"},"examples":[{"en":"This label says “pompelmoose,” but the flavor is just grapefruit.","zh":"这个标签写“pompelmoose”，但味道其实就是葡萄柚。"},{"en":"I ordered the pamplemousse soda—my friend jokingly called it “pompelmoose.”","zh":"我点了葡萄柚汽水——朋友开玩笑叫它“pompelmoose”。"}]}],"synonyms":["pamplemousse","grapefruit"],"phonetic":"/ˈpɑːm.pəl.muːs/","extraExplanation":["“pamplemousse”是从法语借来的词，在英语里常用于饮料口味（如气泡水）、甜点、香水等，听起来带点“高级/法式”的感觉。","“pompelmoose”不是标准英语单词，更像是网络/口语里的谐趣拼写（把词尾看成了“moose=麋鹿”），用于搞笑或卖萌。正式场合建议用“grapefruit”或“pamplemousse”。"]}
{"word":"pompelmous","summary":{"en":"“pompelmous” is a rare/nonstandard spelling used to mean “grapefruit,” related to French *pamplemousse*.","zh":"“pompelmous”是较少见/非标准的拼写，用来表示“葡萄柚”，与法语 *pamplemousse*（葡萄柚）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare spelling) a grapefruit; sometimes used as a playful or French-influenced way to refer to grapefruit (cf. French *pamplemousse*).","zh":"（非标准/较少见拼写）葡萄柚；有时带一点法语或戏谑语气，用来指葡萄柚（参见法语 *pamplemousse*）。"},"examples":[{"en":"They served a fresh pompelmous (grapefruit) salad for breakfast.","zh":"早餐他们端上了一份新鲜的“pompelmous”（葡萄柚）沙拉。"},{"en":"In the menu, “pompelmous” clearly means grapefruit juice.","zh":"在菜单里，“pompelmous”显然指葡萄柚汁。"}]}],"synonyms":["grapefruit","pamplemousse","pomelo"],"phonetic":"/ˈpæmpəlˌmus/","extraExplanation":["“pompelmous”不是常见的标准英语拼写，更常见的相关形式是法语 *pamplemousse*（葡萄柚）以及英语里的 *grapefruit*（葡萄柚）和 *pomelo*（柚子/文旦类，和葡萄柚是近亲）。在英文语境里，如果你写“pompelmous”，读者可能会以为是拼写错误。"]}
{"word":"pomperkin","summary":{"en":"“Pomperkin” is almost certainly a misspelling of “pumpkin,” the orange squash often used in fall foods and Halloween traditions.","zh":"“pomperkin”很可能是“pumpkin”的拼写错误；pumpkin 指南瓜，也常与秋季美食和万圣节传统有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, round orange squash with a thick rind and edible flesh, commonly used in cooking and seasonal celebrations (especially Halloween and Thanksgiving).","zh":"南瓜；一种大而圆、橙色的葫芦科蔬菜，外皮厚、果肉可食，常用于烹饪和节日活动（尤其万圣节和感恩节）。"},"examples":[{"en":"We made pumpkin soup for dinner.","zh":"我们晚餐做了南瓜汤。"},{"en":"They carved a pumpkin for Halloween.","zh":"他们为万圣节雕刻了一个南瓜灯。"},{"en":"Pumpkin pie is popular in the fall in the U.S.","zh":"在美国，秋天南瓜派很受欢迎。"}]},{"partOfSpeech":"vt.","definition":{"en":"To carve, decorate, or shape something like a pumpkin (often for Halloween).","zh":"把……雕刻/装饰成南瓜（常指万圣节时制作南瓜灯）。"},"examples":[{"en":"We pumpkined the biggest squash from the garden into a jack-o’-lantern.","zh":"我们把花园里最大的瓜雕成了南瓜灯。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the color of a pumpkin; a warm orange shade.","zh":"南瓜色的；温暖的橙色。"},"examples":[{"en":"She wore a pumpkin sweater.","zh":"她穿了一件南瓜色的毛衣。"}]}],"synonyms":["squash","gourd"],"phonetic":"/ˈpʌmpkɪn/","extraExplanation":["“pomperkin”并不是常见英文单词，通常是把 **pumpkin** 拼错或口误。标准拼写是 **pumpkin**。","美国文化里，pumpkin 和秋季强关联：万圣节会把南瓜雕成 **jack-o’-lantern（南瓜灯）**，感恩节常吃 **pumpkin pie（南瓜派）**。","词源小知识：pumpkin 通过法语等语言演变而来，最初和“瓜类（melon/gourd）”相关，后来在英语里固定指如今的“南瓜”。"]}
{"word":"pompey","summary":{"en":"Pompey: a famous Roman general and politician, best known as Julius Caesar’s rival in the late Roman Republic.","zh":"Pompey（庞培）：古罗马著名将军与政治家，以罗马共和国末期与恺撒的竞争最为人熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gnaeus Pompeius Magnus (“Pompey the Great”), a powerful Roman general and statesman (106–48 BCE) who was a key rival of Julius Caesar and part of the First Triumvirate.","zh":"格奈乌斯·庞培·马格努斯（“庞培大帝”），古罗马重要将军与政治家（公元前106—48年），曾与恺撒竞争，并是“前三头同盟”成员之一。"},"examples":[{"en":"Pompey was once celebrated as a hero of the Roman Republic.","zh":"庞培曾被视为罗马共和国的英雄。"},{"en":"In many history courses, Pompey is discussed alongside Julius Caesar and Crassus.","zh":"在许多历史课程中，庞培常与尤利乌斯·恺撒和克拉苏一起被讨论。"},{"en":"Shakespeare’s plays often mention Pompey when describing the fall of the Roman Republic.","zh":"莎士比亚的戏剧在描写罗马共和国的衰落时常提到庞培。"}]}],"synonyms":["Gnaeus Pompeius Magnus","Pompey the Great"],"phonetic":"/ˈpɑm.pi/","extraExplanation":["“Pompey”在英语里通常指“庞培大帝”。他与恺撒、克拉苏组成的“First Triumvirate（前三头同盟）”是理解罗马共和国末期权力斗争的关键词。","文化与文学中常见的说法包括“Pompey’s Pillar（庞培石柱）”，但它并不一定与庞培本人有直接关系；更多是一种后世命名。","在英语写作里，Pompey也可能作为人名或绰号出现；如果出现在现代语境（如体育、学校昵称），通常是借用其历史形象。"]}
{"word":"pompholix","summary":{"en":"Pompholix is a kind of eczema that causes very itchy small blisters on the hands or feet.","zh":"Pompholix（汗疱疹）是一种会在手或脚出现非常瘙痒小水疱的湿疹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of eczema (skin inflammation) that causes very itchy, small fluid-filled blisters, usually on the sides of the fingers, palms, or soles; also called dyshidrotic eczema.","zh":"一种湿疹（皮肤炎症），特点是在手指侧面、手掌或脚底出现非常瘙痒、细小的充满液体的水疱；也称“汗疱疹/出汗不良性湿疹（dyshidrotic eczema）”。"},"examples":[{"en":"The dermatologist diagnosed her hand rash as pompholix.","zh":"皮肤科医生把她手上的皮疹诊断为汗疱疹（pompholix）。"},{"en":"Pompholix often causes tiny blisters that itch and burn.","zh":"汗疱疹常会引起又痒又灼热的小水疱。"},{"en":"Stress and frequent handwashing can trigger pompholix in some people.","zh":"压力和频繁洗手可能会诱发一些人的汗疱疹。"}]}],"synonyms":["dyshidrotic eczema","dyshidrosis"],"phonetic":"/pɑmˈfɑlɪks/","extraExplanation":["“pompholix”是医学用语，在日常英语里更常见的说法是“dyshidrotic eczema”。如果在医生说明、检查报告或医学文章中看到它，基本就是指手脚部位反复起小水疱、瘙痒的那种湿疹。","词源上与希腊语中表示“水疱/泡”的词根有关，因此这个词本身就带有“起水疱”的含义。","学习时可联想：pomp(h)- 与“blister（水疱）”相关；临床上常与“eczema（湿疹）”一起出现。"]}
{"word":"pompholygous","summary":{"en":"Pompholygous means “blistering” or “covered with blisters,” mainly used in medical contexts.","zh":"pompholygous 意为“起水疱的/布满水疱的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having blisters; full of blisters (especially on the skin).","zh":"（医学）起水疱的；布满水疱的（尤指皮肤）。"},"examples":[{"en":"The patient had a pompholygous rash on the hands and feet.","zh":"病人的手和脚出现了起水疱的皮疹。"},{"en":"A pompholygous eruption can be painful and itchy.","zh":"起水疱的皮肤爆发（疹/疱疹）可能会又痛又痒。"}]}],"synonyms":["blistering","vesicular","bullous"],"phonetic":"/ˌpɑːm.fəˈlɪɡ.əs/","extraExplanation":["这个词很少用于日常英语，多见于医学/皮肤科语境。","词源来自希腊语 *pompholyx*（意为“水泡、泡”）。在临床上常与 *dyshidrotic eczema*（汗疱疹/出汗障碍性湿疹）等“起小水疱”的情况相关，但具体诊断仍取决于上下文和医生判断。"]}
{"word":"pompholyx","summary":{"en":"Pompholyx is a type of eczema that causes very itchy small blisters on the hands (and sometimes feet).","zh":"Pompholyx（汗疱疹）是一种湿疹，会在手部（有时脚部）出现非常痒的小水疱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a skin condition (a type of eczema) that causes very itchy, small fluid-filled blisters, usually on the sides of the fingers, palms, and sometimes the soles of the feet; also called dyshidrotic eczema","zh":"一种湿疹（皮肤炎症）类型，会出现非常痒、充满液体的小水疱，常见于手指侧面、手掌，有时也在脚底；也称“汗疱疹/出汗不良性湿疹（dyshidrotic eczema）”"},"examples":[{"en":"The doctor said the itchy blisters on my palms were pompholyx.","zh":"医生说我手掌上那些很痒的小水疱是汗疱疹（pompholyx）。"},{"en":"Stress and frequent hand-washing can make pompholyx worse.","zh":"压力和频繁洗手可能会让汗疱疹更严重。"},{"en":"She uses a prescription cream when her pompholyx flares up.","zh":"她在汗疱疹发作时会用处方药膏。"}]}],"synonyms":["dyshidrotic eczema","dyshidrosis","vesicular hand eczema"],"phonetic":"/pɑmˈfɑlɪks/","extraExplanation":["“Pompholyx”是医学用词，在日常交流里更常说“dyshidrotic eczema（出汗不良性湿疹/汗疱疹）”。","词源来自希腊语，和“起泡/水疱”有关；这个词强调皮肤上出现小水疱的特点。","在医学写作中常见搭配：pompholyx eczema；也常与“flare-up（复发/发作）”“blisters（水疱）”“itching（瘙痒）”一起出现。"]}
{"word":"pomphus","summary":{"en":"Pomphus is a rare medical word meaning a blister, especially a large burn blister (bulla).","zh":"pomphus 是一个较少见的医学词，指水疱，尤指较大的烧伤水泡（大疱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blister (a large bubble-like swelling of the skin), especially one caused by a burn or irritation; a bulla.","zh":"（医学/较少用）水疱；（尤指烧伤或刺激引起的）大水泡；大疱。"},"examples":[{"en":"The doctor noted a large pomphus on his forearm after the burn.","zh":"医生记录到他前臂烧伤后出现了一个很大的水疱。"},{"en":"Keep the area clean so the pomphus doesn’t get infected.","zh":"保持患处清洁，避免水疱感染。"}]}],"synonyms":["blister","bulla","vesicle (smaller blister)"],"phonetic":"/ˈpɑm.fəs/","extraExplanation":["“pomphus”是非常偏医学、较少见的词，日常英语更常用“blister”或“bulla（医学：大疱）”。","词源来自希腊语，含义与“泡、气泡”相关，因此常用于描述皮肤表面鼓起、充满液体的水泡。","在现代医学语境中，你更可能在皮肤科/病理学资料里看到它，而不是在一般新闻或口语中。"]}
{"word":"pompier","summary":{"en":"“Pompier” usually means a French “firefighter,” and in art criticism it can describe showy, overdramatic academic art.","zh":"“pompier”通常指法语里的“消防员”；在艺术批评中也可指矫饰、浮夸的学院派风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a firefighter.","zh":"（源自法语）消防员。"},"examples":[{"en":"In French, a firefighter is called a “pompier.”","zh":"在法语里，消防员叫“pompier”。"},{"en":"The guide explained that the word “pompier” appears on old French uniforms.","zh":"导游解释说，“pompier”这个词会出现在旧式法国制服上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(art, often critical) showy, overdramatic academic art; also describing something grand but lacking real depth.","zh":"（艺术用语，常带批评）矫饰、浮夸的学院派绘画；也可形容“看起来很宏大但欠缺内涵”的风格。"},"examples":[{"en":"Some critics dismissed the painting as pompier—technically impressive but emotionally empty.","zh":"一些评论家把这幅画批评为pompier——技巧很厉害，但情感空洞。"},{"en":"The film’s speeches felt a bit pompier, with lots of grandeur and little truth.","zh":"这部电影的演讲部分有点pompier：场面很宏大，但真诚不多。"}]}],"synonyms":["firefighter","fireman","showy","overblown","grandiose","bombastic"],"phonetic":"/pɑmˈpjɛr/","extraExplanation":["“pompier”是法语词，最常见意思就是“消防员”。英语里偶尔会直接借用，多见于谈法国文化、旅游或历史语境。","艺术上的“pompier”多用于19世纪法国的学院派历史画，常被批评为过度庄严、戏剧化、卖弄技巧。它带有评价色彩，使用时语气通常偏负面。"]}
{"word":"pompilid","summary":{"en":"A pompilid is a spider-hunting wasp (a spider wasp).","zh":"pompilid 指“捕蛛蜂/蜘蛛蜂”，一种专门捕捉蜘蛛的黄蜂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of wasp (family Pompilidae) that hunts spiders, often paralyzing them and using them as food for its larvae; a spider wasp","zh":"一种捕蛛蜂（蛛蜂科 Pompilidae）；会捕捉并麻痹蜘蛛，常把蜘蛛作为幼虫食物；又称“捕蛛蜂/蜘蛛蜂”"},"examples":[{"en":"A pompilid wasp dragged a paralyzed spider across the sand to its nest.","zh":"一只捕蛛蜂把被麻痹的蜘蛛拖过沙地，带回巢里。"},{"en":"Gardeners sometimes notice pompilids because they run quickly on the ground searching for spiders.","zh":"园丁有时会注意到捕蛛蜂，因为它们常在地面快速奔跑，寻找蜘蛛。"},{"en":"The documentary showed a pompilid carefully stinging a spider to immobilize it.","zh":"纪录片展示了一只捕蛛蜂小心地蜇刺蜘蛛，使其失去行动能力。"}]}],"synonyms":["spider wasp","pompilid wasp"],"phonetic":"/ˈpɑːmpɪlɪd/","extraExplanation":["“pompilid”来自昆虫分类学：蛛蜂科名 Pompilidae 源于属名 Pompilus。日常英语里更常说 spider wasp（蜘蛛蜂/捕蛛蜂）。","捕蛛蜂通常对人不主动攻击，但被抓握或受威胁时可能会蜇人；它们最典型的行为是“麻痹蜘蛛→拖回巢→产卵→幼虫取食”。"]}
{"word":"pompilidae","summary":{"en":"Pompilidae is the scientific family name for spider wasps.","zh":"Pompilidae 是“捕蛛蜂/蛛蜂”（spider wasps）的科学分类科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of wasps (often called spider wasps) whose females typically hunt and paralyze spiders to use as food for their larvae","zh":"一种黄蜂科（常称“捕蛛蜂/蛛蜂”），雌蜂常捕捉并麻痹蜘蛛，把蜘蛛作为幼虫的食物"},"examples":[{"en":"Pompilidae are known for hunting spiders rather than other insects.","zh":"捕蛛蜂科以捕捉蜘蛛（而非其他昆虫）而闻名。"},{"en":"A spider wasp in the family Pompilidae dragged a paralyzed spider into a burrow.","zh":"一只捕蛛蜂科的蛛蜂把被麻痹的蜘蛛拖进洞穴里。"}]}],"synonyms":["spider wasps","pompilids"],"phonetic":"/pɑmˈpɪlɪdi/","extraExplanation":["“Pompilidae”是一个生物分类学名称（科名），在英文里通常不加冠词当作专有名词来用；更常见、好理解的日常说法是“spider wasps（蛛蜂/捕蛛蜂）”。","读音上常见分法是 pom-PIL-ih-dee；在科普文章里你也会看到单数“pompilid（某一种捕蛛蜂科成员）”。","这类黄蜂一般不主动攻击人，但如果被抓握或逼迫可能会蜇人；它们在生态上有助于控制蜘蛛数量。"]}
{"word":"pompiloid","summary":{"en":"“Pompiloid” means spider-wasp-like (related to or resembling Pompilidae).","zh":"“pompiloid”指“似蛛蜂的/与蛛蜂科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or relating to spider wasps (family Pompilidae), especially in form or behavior.","zh":"（昆虫学）似蜘蛛蜂（蛛蜂科 Pompilidae）的；与蜘蛛蜂有关的，尤指外形或行为特征相似。"},"examples":[{"en":"The researcher described the insect as pompiloid because it hunted spiders and had long, spiny legs.","zh":"研究人员称这种昆虫为“pompiloid（似蛛蜂的）”，因为它捕猎蜘蛛且腿长并带刺。"},{"en":"A pompiloid wasp was seen dragging a paralyzed spider across the ground.","zh":"有人看到一只似蛛蜂的黄蜂拖着一只被麻痹的蜘蛛穿过地面。"}]}],"synonyms":["pompilid","spider-wasp-like"],"phonetic":"/ˈpɑːm.pɪˌlɔɪd/","extraExplanation":["“pompiloid”主要见于生物学/昆虫学写作中，来自属名 Pompilus（历史上用于指某些蛛蜂）+ 后缀 -oid（表示“……状/类似……”）。日常英语里很少用，常出现在学术描述（如“pompiloid wasp”）或形态分类讨论中。","蛛蜂（spider wasps）以捕捉并麻痹蜘蛛、把蜘蛛拖回巢中供幼虫取食而闻名；因此在描述某昆虫的捕食行为或体态特征时，作者可能用“pompiloid”来强调其“蛛蜂式”的特征。"]}
{"word":"pompilus","summary":{"en":"Pompilus: a genus name for spider wasps; sometimes used generally for spider wasps.","zh":"Pompilus：蜘蛛蜂的一类属名；有时也泛指蜘蛛蜂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of spider wasps (family Pompilidae); also used more loosely to mean a spider wasp.","zh":"一种蜘蛛蜂属名（蛛蜂科）；也可较宽泛地指“蜘蛛蜂”这种专门捕蜘蛛的蜂类。"},"examples":[{"en":"A Pompilus wasp paralyzes a spider and drags it to a nest for its larvae.","zh":"蜘蛛蜂（Pompilus）会麻痹蜘蛛，并把它拖到巢里给幼虫当食物。"},{"en":"In older nature books, you may see “Pompilus” used for several kinds of spider wasps.","zh":"在较早的自然观察书中，你可能会看到“Pompilus”被用来泛指几种不同的蜘蛛蜂。"}]}],"synonyms":["spider wasp","pompilid"],"phonetic":"ˈpɑmpɪləs","extraExplanation":["“Pompilus”是生物分类学里的拉丁化属名，属于蛛蜂科（Pompilidae）。很多蛛蜂以捕蜘蛛闻名：雌蜂会用螫针让蜘蛛瘫痪但不立即致死，然后在蜘蛛身上产卵，幼虫孵化后以蜘蛛为食。","在现代分类中，具体哪些物种被归入“Pompilus”可能会随着研究更新而变化；因此在科普或旧文献里，它有时会被当作“蜘蛛蜂”的泛称来用。"]}
{"word":"pompion","summary":{"en":"“Pompion” is an old-fashioned word for “pumpkin.”","zh":"“pompion”是“pumpkin（南瓜）”的旧式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pumpkin (an older or dialect word, now rare).","zh":"南瓜（较古老或方言用法，如今较少见）。"},"examples":[{"en":"In older texts, you may see “pompion” where modern English would say “pumpkin.”","zh":"在较老的文本里，你可能会看到“pompion”，现代英语则会说“pumpkin”。"},{"en":"They baked a pompion pie for the harvest feast.","zh":"他们为丰收宴会烤了一个南瓜派。"}]}],"synonyms":["pumpkin"],"phonetic":"/ˈpɑːm.pi.ən/","extraExplanation":["“pompion”是“pumpkin”的旧式拼写/旧称，源自法语（如 *pompon* / *pompion* 一类形式），再往前与拉丁语 *pepo*（瓜类）有关。","在英语文学中它常见于早期作品与复古语境；例如莎士比亚《快乐的温莎》（*The Merry Wives of Windsor*）里有用到“pompion”来指南瓜，用词带有时代感与乡土气息。","现代日常英语几乎都用“pumpkin”。如果你在阅读古典文学或仿古写作时遇到“pompion”，通常可以直接理解为“pumpkin”。"]}
{"word":"pompist","summary":{"en":"A rare word meaning a person who loves or shows pomp and ceremony.","zh":"一个罕用词，指喜欢或展示排场与盛大仪式的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who likes or displays pomp—showy ceremony, grandeur, or self-important display; a lover of pageantry.","zh":"（罕用）喜爱或刻意展示排场/盛大仪式的人；爱摆架子、爱做表面文章的人。"},"examples":[{"en":"Some critics called him a pompist who cared more about ceremony than real reform.","zh":"一些评论家说他爱摆排场，比起真正的改革更在意仪式感。"},{"en":"The novel gently mocks a court full of pompists and flattering advisers.","zh":"这部小说温和地讽刺了一个满是爱排场之人和阿谀奉承的顾问的宫廷。"}]}],"synonyms":["pompous person","show-off","poser","self-important person","lover of pomp and ceremony"],"phonetic":"/ˈpɑmpɪst/","extraExplanation":["“pompist”在现代英语里非常少见，读者更常看到的是pomp（排场、盛典）、pompous（浮夸的、自命不凡的）或pompous person（爱摆架子的人）。","构词上可理解为pomp（排场）+ -ist（……主义者/……爱好者/从事者），意思类似“pageant lover / show-off”，但不算常用标准词。写作中若想更自然，可用“a pompous person”“a lover of pomp and ceremony”。"]}
{"word":"pompless","summary":{"en":"“Pompless” means simple and low-key, without pomp or ceremony.","zh":"“Pompless”指朴素低调、没有排场或隆重仪式的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking pomp; simple and not showy, without ceremony or grand display.","zh":"没有排场的；朴素不张扬的；不讲究仪式和隆重排面的。"},"examples":[{"en":"They held a pompless wedding at city hall with only close family.","zh":"他们在市政厅办了一场没有排场的婚礼，只请了至亲。"},{"en":"The new principal preferred a pompless style of leadership—quiet work over big speeches.","zh":"新校长更喜欢不讲排场的领导风格——重在踏实做事，而不是高调演讲。"},{"en":"The award was given in a pompless ceremony, with no cameras or red carpet.","zh":"颁奖以一种朴素不张扬的方式进行，没有镜头也没有红毯。"}]}],"synonyms":["unpretentious","low-key","plain","simple","modest","without ceremony"],"phonetic":"/ˈpɑmpləs/","extraExplanation":["“pompless”由“pomp（排场、盛况、仪式感）+ -less（无、缺少）”构成，意思直观：缺少排场与华丽仪式。它不算常见词，更常用的表达是“without pomp”“unpretentious”“low-key”。","语气通常偏正面：强调朴素、低调、务实；但在某些语境里也可能暗示“缺乏隆重感/不够体面”，需看上下文。"]}
{"word":"pompoleon","summary":{"en":"“pompoleon” is not a standard English word; it’s likely a misspelling or a proper name whose meaning depends on context.","zh":"“pompoleon”不是标准英语词汇；更可能是拼写错误或专有名词，其含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a made-up name. It does not appear in major English dictionaries as a common vocabulary item.","zh":"不是标准英语词汇；很可能是拼写错误或自造名称。在主流英语词典中通常找不到作为常用词的词条。"},"examples":[{"en":"I searched for “pompoleon,” but I couldn’t find a dictionary definition—did you mean “Napoleon” or “pompous” ?","zh":"我查了“pompoleon”，但找不到词典释义——你是不是想写“Napoleon（拿破仑）”或“pompous（浮夸的、爱摆架子的）”？"},{"en":"If “Pompoleon” is a character or brand name, the meaning depends on the story or context.","zh":"如果“Pompoleon”是角色名或品牌名，它的含义要看具体作品或语境。"}]}],"phonetic":"/ˌpɑmpəˈliən/","extraExplanation":["“pompoleon”看起来像把 **pomp**（排场、盛典）和 **Napoleon**（拿破仑）混在一起的拼写，但英语里没有固定用法。","如果你能提供一句原文（它出现的句子/截图/出处），我可以帮你判断：是拼写错误、专有名词，还是某个梗/昵称。","你可能想找的词：\n- **pompous**（adj. 自负的；浮夸的）\n- **pomp**（n. 排场；盛况）\n- **Napoleon**（专有名词：拿破仑）"]}
{"word":"pompom","summary":{"en":"A pompom is a fluffy decorative ball, or (often plural) a cheerleading pom-pom used for cheering.","zh":"pompom 指装饰用的绒球；也可指（常用复数）啦啦队助威用的花球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small fluffy ball made of yarn, plastic, or feathers, used as a decoration on clothing, hats, bags, or crafts.","zh":"（毛线/塑料/羽毛等做的）绒球；毛球（常用于帽子、衣服、包或手工装饰）"},"examples":[{"en":"Her winter hat has a big pompom on top.","zh":"她的冬帽顶上有一个大绒球。"},{"en":"I added pompoms to the gift wrap to make it look festive.","zh":"我在礼物包装上加了绒球，让它看起来更喜庆。"}]},{"partOfSpeech":"n.","definition":{"en":"(Usually plural: pom-poms) A cheerleading prop made of many thin plastic strands, shaken to make noise and show team spirit.","zh":"（常用复数 pom-poms）啦啦队花球（由许多塑料条组成，用来挥舞助威）"},"examples":[{"en":"The cheerleaders waved their pom-poms during the game.","zh":"比赛时啦啦队挥舞着花球助威。"},{"en":"She grabbed her pom-poms and ran onto the field.","zh":"她拿起花球就跑进了场地。"}]}],"synonyms":["pom-pom","pompon","tassel (similar decoration)","cheerleading pom-pom"],"phonetic":"/ˈpɑmˌpɑm/","extraExplanation":["在英文里常见两种拼法：pompom（更像“绒球/装饰球”）与 pom-pom（更常见于“啦啦队花球”）。两者在日常使用中常被混用。","这个词也常写作 pompon；来源与法语 pompon（装饰用小球）有关。"]}
{"word":"pompoms","summary":{"en":"Pompoms are fluffy balls used for cheering (especially by cheerleaders) or as small decorative balls on clothing and accessories.","zh":"pompoms 指用于助威的啦啦队花球/彩球，或用于衣物配饰上的装饰毛球/绒球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fluffy balls (usually made of plastic, paper, or fabric) that people shake or wave to cheer at sports games or performances.","zh":"（通常由塑料、纸或布制成的）啦啦队花球/彩球，用来在比赛或表演时挥动助威。"},"examples":[{"en":"The cheerleaders waved their pompoms as the team ran onto the field.","zh":"球队跑进场时，啦啦队挥舞着花球助威。"},{"en":"She bought blue-and-white pompoms for the school game.","zh":"她为学校比赛买了蓝白相间的花球。"}]},{"partOfSpeech":"n.","definition":{"en":"Small soft decorative balls attached to clothing or accessories (like hats, scarves, or bags).","zh":"（装饰用的）毛球/绒球，常缝在帽子、围巾或包上。"},"examples":[{"en":"His winter hat has a pompom on top.","zh":"他的冬帽顶上有一个毛球。"},{"en":"The scarf ends were finished with little pompoms.","zh":"围巾的两端用小毛球作收尾装饰。"}]}],"synonyms":["pom-poms","cheerleading pom-poms","pompons","fluffy pom-poms"],"phonetic":"/ˈpɑmˌpɑmz/","extraExplanation":["“pom-pom / pompom”两种拼法都常见；作助威道具时常用复数“pom-poms / pompoms”。","口语里也常说“cheerleading pom-poms”。在服饰上那种小毛球有时也叫“pompon（较少见拼法）”。"]}
{"word":"pompon","summary":{"en":"A pompon (also spelled pompom) is a fluffy decorative ball, or a cheerleader’s colorful handheld pompon.","zh":"pompon（也写作pompom）指装饰用的绒球/毛球，也可指啦啦队挥舞的彩球（彩穗球）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small fluffy ball (often made of yarn, feathers, or plastic) used for decoration, such as on hats, clothing, or accessories.","zh":"（常用毛线、羽毛或塑料做的）绒球/毛球装饰，常见于帽子、衣物或配饰上。"},"examples":[{"en":"Her beanie has a big red pompon on top.","zh":"她的针织帽顶上有一个大红色的绒球。"},{"en":"The child’s scarf ends in two soft pompons.","zh":"那条儿童围巾的两端各有一个柔软的毛球。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often plural) A cheerleader’s handheld bundle of plastic or paper strands, shaken to make noise and look energetic.","zh":"（常用复数）啦啦队用的彩球/彩穗球（挥舞时能制造动感和声响的塑料或纸条束）。"},"examples":[{"en":"The cheerleaders waved their pompons during the final song.","zh":"在最后一首歌时，啦啦队员挥舞着彩球。"},{"en":"She grabbed her pompons and ran onto the court.","zh":"她拿起彩球就跑上了球场。"}]}],"synonyms":["pompom","tassel (similar but not the same)","tuft"],"phonetic":"/ˈpɑm.pɑm/","extraExplanation":["“pompon”也常写作“pompom”。两种拼法都正确；“pompon”更接近法语原拼写，“pompom”在日常英语里更常见。"]}
{"word":"pompons","summary":{"en":"Pompons are small fluffy balls used for decoration or, especially in sports, cheerleaders’ hand-held pompoms.","zh":"Pompons 指用于装饰的绒球，也常指啦啦队表演时手持挥舞的花球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small fluffy ball (often made of yarn, plastic, or feathers) used as a decoration on clothes, hats, or accessories.","zh":"（常由毛线、塑料或羽毛制成的）小绒球，用作衣物、帽子或饰品的装饰。"},"examples":[{"en":"Her winter hat has a red pompon on top.","zh":"她的冬帽顶部有一个红色的绒球。"},{"en":"The baby’s shoes were decorated with tiny pompons.","zh":"宝宝的鞋子上装饰着小小的绒球。"}]},{"partOfSpeech":"n.","definition":{"en":"A bright, fluffy ball used by cheerleaders, usually held in the hand and shaken during chants.","zh":"（啦啦队用的）彩色手持花球，表演时挥舞助威。"},"examples":[{"en":"The cheerleaders waved their pompons during the game.","zh":"比赛时，啦啦队挥舞着花球助威。"},{"en":"She practiced a routine with silver pompons.","zh":"她拿着银色花球练习一套动作。"}]}],"synonyms":["pompoms","tassels (similar in decoration)","cheerleading pompoms"],"phonetic":"/ˈpɑmˌpɑnz/","extraExplanation":["“pompon”也常写作“pompom”。在美式英语里两种拼法都常见；“pompom”更口语、更常用于啦啦队花球。","词源来自法语“pompon”，原意与“装饰性的绒球/小球”有关。"]}
{"word":"pompoon","summary":{"en":"Pompon (often spelled pompom) is a fluffy decorative ball used on clothing, crafts, or by cheerleaders.","zh":"Pompon（常写作 pompom）指用于衣物、手工或拉拉队的蓬松装饰球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, round ball of fluffy material (like yarn, wool, or plastic) used as decoration, especially on hats, clothing, or crafts; also the fluffy ball used by cheerleaders","zh":"（毛线、羊毛或塑料等做的）绒球；常用于帽子、衣物或手工装饰；也可指拉拉队手持的彩球"},"examples":[{"en":"Her winter hat has a red pompon on top.","zh":"她的冬帽顶部有一个红色绒球。"},{"en":"The cheerleaders waved their pompons during the game.","zh":"拉拉队员在比赛中挥舞着彩球。"},{"en":"I added pompons to the gift wrap to make it look festive.","zh":"我在礼物包装上加了绒球，让它更有节日气氛。"}]}],"synonyms":["pompom","pom-pom","tassel (similar, not the same)","decoration"],"phonetic":"/ˈpɑmˌpɑn/","extraExplanation":["“pompoon”不是常见标准拼写，最常见的是 **pompom**（也写作 **pom-pom**）或 **pompon**。在日常英语里，指装饰用绒球时多用 **pompom**；**pompon** 更像是较正式或受法语影响的拼写。","词源与法语有关（法语 *pompon*），在英语里常用来描述帽子顶端的绒球、手工装饰物，以及拉拉队的彩球。"]}
{"word":"pomposities","summary":{"en":"Pomposities are acts or words that are overly self-important or grand in a way that feels insincere or empty.","zh":"Pomposities 指那些自命不凡、装腔作势、听起来很宏大却显得空洞不真诚的言行（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Self-important or overly formal behavior, speech, or writing that sounds grand but lacks real substance (plural).","zh":"（复数）浮夸、自命不凡的言行；故作庄重但缺乏实质内容的表达。"},"examples":[{"en":"The article was full of pomposities, so it was hard to trust the writer.","zh":"这篇文章充满了浮夸的措辞，让人很难信任作者。"},{"en":"She laughed at the manager’s pomposities during the meeting.","zh":"她在会议上对经理那套自命不凡的做派忍不住发笑。"}]}],"synonyms":["pretentiousness","pompousness","self-importance","grandiosity","bluster"],"phonetic":"pɑmˈpɑsətiz","extraExplanation":["“pomposities”是名词复数，单数是“pomposity”。常用来批评某人的语气、用词或态度“装腔作势、摆架子”。","词源上与“pomp”（排场、盛典的华丽场面）有关，所以常带有“外表很隆重、内里很空”的讽刺意味。"]}
{"word":"pomposity","summary":{"en":"Pomposity means arrogant, overly grand, self-important behavior or speech.","zh":"Pomposity 指自大浮夸、装腔作势的言行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of speaking or behaving in a self-important, overly formal, or “grand” way that feels arrogant or inflated.","zh":"（言行）自命不凡、装腔作势、浮夸自大（常带贬义）。"},"examples":[{"en":"People stopped listening because his speech was full of pomposity.","zh":"因为他的演讲充满装腔作势，大家都不想听了。"},{"en":"She used a simple tone to avoid pomposity in her writing.","zh":"她用朴素的语气来避免文章显得自大浮夸。"}]}],"synonyms":["self-importance","pretentiousness","arrogance","grandiosity","pomp"],"phonetic":"/pɑmˈpɑsəti/","extraExplanation":["“pomposity”来自形容词“pompous”（浮夸的、摆架子的）。它常用来批评某人把小事说得很伟大、用过度正式或夸张的方式表现权威感。","语感提示：它通常不是“庄重/正式”（formal/solemn），而是“过头的庄重”，让人感觉不真诚或爱摆架子。"]}
{"word":"pomposo","summary":{"en":"Pomposo means pompous or showy in Spanish—overly grand, self-important, or overly ornate.","zh":"Pomposo是西语词，表示“浮夸自大/装腔作势”，也可指“过度华丽、过分隆重”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) Pompous; using an overly grand, self-important style to impress others.","zh":"（西语）浮夸的；自命不凡的，用过分隆重、摆架子的方式来给人留下深刻印象。"},"examples":[{"en":"His speech sounded pomposo, full of big words but few ideas.","zh":"他的演讲听起来很“pomposo”，堆满了大词，却没什么实质内容。"},{"en":"She didn’t mean to be pomposo; she was just nervous and overprepared.","zh":"她并不是故意要显得“pomposo”；只是紧张，准备得太过头了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish) Showy or ornate; grand-looking in an exaggerated way.","zh":"（西语）华丽而招摇的；夸张地“看起来很气派”的。"},"examples":[{"en":"The restaurant’s pomposo decoration felt too formal for a casual lunch.","zh":"这家餐厅的装潢很“pomposo”，对随便吃个午饭来说太隆重了。"},{"en":"They chose a simpler design instead of something pomposo.","zh":"他们选择了更简洁的设计，而不是那种“pomposo”的风格。"}]}],"synonyms":["pompous","pretentious","grandiose","ostentatious","showy","ornate"],"phonetic":"/poʊmˈpoʊsoʊ/","extraExplanation":["“pomposo”是西班牙语形容词，常用来形容人的言谈举止“摆架子、装腔作势”，或事物“过度华丽、过度隆重”。对应英语里最常见的词是 **pompous**（也可接近 pretentious / ostentatious，视语境而定）。","在英语语境中直接使用“pomposo”多见于双语交流、文学对话或带有文化/地域色彩的表达；正式英文写作里通常改用 **pompous**。"]}
{"word":"pompous","summary":{"en":"Pompous describes someone (or their words/style) who seems overly important, formal, and showy—often in an annoying way.","zh":"pompous形容人或言行显得自命不凡、过分正式又爱摆排场，通常带贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an exaggerated sense of importance; speaking or behaving in a way that sounds self-important and overly formal.","zh":"自命不凡的；浮夸自大的；言行显得过分正式、摆架子的。"},"examples":[{"en":"He gave a pompous speech full of big words but little meaning.","zh":"他发表了一篇自命不凡的演讲，堆满大词却没什么内容。"},{"en":"She sounded pompous when she kept reminding everyone of her title.","zh":"她不停提醒大家她的头衔，听起来很摆架子。"},{"en":"The review criticized the film for its pompous tone.","zh":"影评批评这部电影的语气过于浮夸自大。"}]},{"partOfSpeech":"adj.","definition":{"en":"Grand and showy in an overly serious way; marked by too much ceremony or display.","zh":"盛大而做作的；过于讲排场、仪式感太强的。"},"examples":[{"en":"The event felt pompous, with endless introductions and formalities.","zh":"这场活动显得很做作，没完没了的介绍和繁文缛节。"},{"en":"They arrived in a pompous parade of luxury cars.","zh":"他们坐着一队豪车，像摆排场的游行一样到场。"}]}],"synonyms":["self-important","pretentious","puffed-up","grandiose","bombastic"],"phonetic":"/ˈpɑmpəs/","extraExplanation":["“pompous”常带贬义，强调“摆架子、装腔作势”。它和“confident（自信）”不同：自信通常自然、踏实；pompous更像是用夸张的语言、头衔或排场来抬高自己。","词根提示：与“pomp（排场、盛典）”同源，联想到“讲排场的人/语气”更容易记。","常见搭配：pompous speech/tone/attitude（浮夸的演讲/语气/态度）；sound pompous（听起来很自大）。"]}
{"word":"pompously","summary":{"en":"“Pompously” means in a self-important, overly formal, trying-to-impress way.","zh":"“pompously”表示以自命不凡、装腔作势、过度正式以求显得重要的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows self-importance and tries to impress others (often in an annoying or overly formal way).","zh":"以自命不凡、爱摆架子（常带有令人反感或过度正式的感觉）的方式。"},"examples":[{"en":"He spoke pompously about his achievements, as if no one else had ever succeeded.","zh":"他自夸地谈论自己的成就，好像别人从来都没成功过一样。"},{"en":"The report was written so pompously that it was hard to understand.","zh":"这份报告写得太装腔作势，反而让人很难读懂。"}]}],"synonyms":["pretentiously","self-importantly","grandly","arrogantly"],"phonetic":"/ˈpɑm.pəs.li/","extraExplanation":["“pompously”来自形容词“pompous”（自大的、摆架子的）。它常用来批评某人的说话/写作风格太“端着”、太爱显示权威。","常见搭配：speak pompously（说话装腔作势）、write pompously（写作矫饰）、announce pompously（煞有介事地宣布）。","近义词语气差别：“pretentiously”更强调“装”（装有品味/有学问）；“arrogantly”更强调“傲慢”；“pompously”更强调“排场/官腔/隆重得过头”的自大感。","文学/常见叙述中，作者会用“pompously”来刻画角色的可笑与虚荣，比如描写某个官员、学究或自以为是的演讲者。"]}
{"word":"pompousness","summary":{"en":"Pompousness means exaggerated self-importance, often shown through grand, showy speech or behavior.","zh":"pompousness 指夸张的自我重要感，常表现为装腔作势、说话摆架子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of behaving or speaking as if you are more important, intelligent, or impressive than other people; exaggerated self-importance.","zh":"自大；自命不凡；（言行）浮夸的自负感。"},"examples":[{"en":"His pompousness made even a simple introduction sound like a speech.","zh":"他的自大让一个简单的自我介绍听起来都像一场演讲。"},{"en":"She disliked the manager’s pompousness and preferred straightforward communication.","zh":"她不喜欢经理的自大作风，更喜欢直截了当的沟通。"}]}],"synonyms":["self-importance","pomposity","pretentiousness","grandiosity","conceit"],"phonetic":"/ˈpɑmpəsnəs/","extraExplanation":["词源提示：pompousness 来自 pompous（浮夸的、爱摆架子的）+ -ness（名词后缀，表示“性质/状态”）。pomp 原意与“盛大的排场、仪式”有关，因此这个词常带有“摆排场、装腔作势”的负面评价。","语体与语气：pompousness 通常用于批评某人的态度或说话方式，语气偏负面；比 arrogant（傲慢）更强调“爱摆架子、讲话官腔、故作高深”。","文学/文化用法：在描写官僚主义、虚伪的上流社交场合、或自以为是的角色时很常见，用来营造讽刺或喜剧效果。"]}
{"word":"pomps","summary":{"en":"Pomps is the plural of pomp: impressive ceremony or showy display, sometimes with a sense of empty pride.","zh":"pomps 是 pomp 的复数：指隆重的仪式/排场，也可带有“浮夸炫耀”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ceremony or impressive display used in formal events (often with uniforms, music, and processions).","zh":"（正式场合的）盛典；排场；仪式感（常有制服、音乐、游行队伍等）"},"examples":[{"en":"The wedding was full of pomp, with a long procession and live music.","zh":"这场婚礼排场十足，有长长的队伍和现场音乐。"},{"en":"They opened the new museum with great pomp and speeches.","zh":"他们用盛大的仪式和演讲为新博物馆揭幕。"}]},{"partOfSpeech":"n.","definition":{"en":"Self-important display meant to impress others; showy pride.","zh":"（为博人眼球的）虚张声势；浮夸的自大；炫耀式的排场"},"examples":[{"en":"He disliked the pomp of politics and preferred straightforward talk.","zh":"他不喜欢政治上的浮夸排场，更偏好直截了当的交流。"},{"en":"Behind all the pomp, the company had serious problems.","zh":"在一切浮华背后，这家公司其实问题很严重。"}]}],"synonyms":["ceremony","pageantry","splendor","display","show","ostentation"],"phonetic":"/pɑmp/","extraExplanation":["“pomps”通常是名词“pomp”的复数，表示多种/多次的“盛典、排场”。也可能是专有名词（如人名或地名）的复数形式，要看上下文。","常见搭配“pomp and circumstance”（盛大的排场与场面），因莎士比亚《奥赛罗》中出现而广为流传；英语里常用来形容隆重但有时略显浮夸的仪式感。"]}
{"word":"pompster","summary":{"en":"“Pompster” is an informal, usually mocking word for someone who acts pompous and loves showing off status or ceremony.","zh":"“pompster”是非正式、带嘲讽色彩的词，指爱摆架子、讲排场、显得很重要的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often derogatory) A person who acts very self-important and enjoys showing off status, ceremony, or “pomp.”","zh":"（非正式，常带贬义）爱摆架子、讲排场、故作庄严或自以为很重要的人。"},"examples":[{"en":"He talks like a pompster in meetings, using big words to sound important.","zh":"他在会议上说话像个爱摆架子的人，总用大词来显得很重要。"},{"en":"Ignore the pompster online—he’s more interested in looking impressive than being helpful.","zh":"别理那个网上爱摆排场的人——他更在意看起来厉害，而不是帮忙。"}]}],"synonyms":["pompous person","show-off","snob","prig","self-important person"],"phonetic":"/ˈpɑmpstɚ/","extraExplanation":["“pompster”不是非常标准或常见的词，更像是口语里的临时造词/网络用语：把“pomp（排场、盛况、浮夸的仪式感）”加上表示“某一类人”的后缀“-ster”（如 youngster, prankster），用来讽刺“爱排场的人”。","更常见、更自然的表达是：pompous person（自命不凡的人）、show-off（爱炫耀的人）、snob（势利/自视甚高的人）、someone full of himself/herself（自我感觉良好的人）。在正式写作中建议用这些更常见的词。"]}
{"word":"pomptine","summary":{"en":"“Pomptine” is not a standard English word; it’s likely a misspelling (often of “prompting” or “pompous”).","zh":"“pomptine”不是标准英语单词；很可能是拼写错误（常见是“prompting”或“pompous”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a mistaken form (common intended words: “prompting,” “pompous,” or “pompentine” in very rare contexts).","zh":"不是标准英语单词。更可能是拼写错误或误写（常见可能想表达的词有 prompting、pompous；极少数语境可能与罕见词形有关）。"},"examples":[{"en":"“Pomptine” isn’t in most English dictionaries—did you mean “prompting”?","zh":"“pomptine”在大多数英语词典里找不到——你是不是想写“prompting（提示/促使）”？"},{"en":"If you meant “pompous,” it describes someone who acts too important.","zh":"如果你想写“pompous”，它形容一个人自以为很重要、很摆架子。"}]}],"synonyms":["prompting","pompous"],"phonetic":"/ˈpɑmptin/","extraExplanation":["“pomptine”很可能是把常见词拼错了。你可以回想一下你看到它的上下文：\n- 如果句子里有“提示/引导/促使”的意思，最可能是 prompting（/ˈprɑmptɪŋ/）。\n- 如果是在评价人的态度“傲慢/装腔作势”，可能是 pompous（/ˈpɑmpəs/）。\n- 如果你能提供原句或截图，我可以更准确判断你想要的词。"]}
{"word":"poms","summary":{"en":"“Poms” most often means British people (informal in Australia/NZ; can be offensive). It can also mean cheerleader/decoration pom‑poms.","zh":"“poms”最常指英国人（澳新非正式用法，可能带冒犯）。也可指拉拉队或装饰用的绒球（pom‑poms）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly Australia & New Zealand, informal; sometimes offensive) British people; people from the UK.","zh":"（主要用于澳大利亚和新西兰，非正式；有时带冒犯）英国人；来自英国的人。"},"examples":[{"en":"Some Aussies call British tourists “Poms,” but it can sound rude.","zh":"有些澳大利亚人把英国游客叫作“Poms”，但听起来可能不礼貌。"},{"en":"He moved from London, so his friends jokingly call him a Pom.","zh":"他从伦敦搬来，所以朋友开玩笑叫他“Pom”。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “pom‑poms”: small balls of fluffy material used by cheerleaders or as decoration.","zh":"“pom‑poms”的简称：拉拉队或装饰用的小绒球。"},"examples":[{"en":"The cheer team waved red and white poms.","zh":"拉拉队挥舞着红白相间的绒球。"},{"en":"She made a hat with two little poms on top.","zh":"她做了一顶帽子，上面有两个小绒球。"}]}],"synonyms":["Brits (informal)","British people","pom-poms"],"phonetic":"/pɑmz/","extraExplanation":["“Pom / Pommie”作为对英国人的称呼，多见于澳新英语。词源不完全确定：有人说与“pomegranate（石榴）”的俚语用法有关（指晒红的脸），也有人说与早期移民与军队用语有关。因为历史与殖民背景，这个词在不同语境里可能是玩笑、也可能带贬义；对不熟的人最好避免使用。","表示“绒球”时通常写作“pom‑poms”，口语里常简写成“poms”。"]}
{"word":"pomster","summary":{"en":"“Pomster” is informal slang (mainly in Australia/NZ) for a British person; rarely it may mean a pom‑pom cheerer.","zh":"“pomster”多为澳新地区的非正式俚语，指“英国人”；很少情况下也可指“挥舞啦啦队彩球助威的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Australia/New Zealand) A British person; someone from England. Often playful, but it can sound mildly insulting depending on tone and context.","zh":"（非正式，主要用于澳大利亚/新西兰）英国人；英格兰人。多为玩笑式称呼，但语气不当时可能带轻微贬义。"},"examples":[{"en":"He’s a pomster from London, but he’s lived in Sydney for years.","zh":"他是个来自伦敦的英国人，不过在悉尼住了很多年。"},{"en":"Some people avoid the word “pomster” because it can sound rude.","zh":"有些人会避免用“pomster”，因为听起来可能不礼貌。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Someone who cheers with pom‑poms; a cheerleader (not common in standard English).","zh":"（少见）挥舞啦啦队彩球（pom‑poms）助威的人；啦啦队队员（在标准英语中不常用）。"},"examples":[{"en":"The pomsters were loud during the final quarter.","zh":"最后一节时，那些挥着彩球助威的人很吵。"}]}],"synonyms":["pom (AU/NZ)","pommy (AU/NZ)","Brit (informal)"],"phonetic":"/ˈpɑm.stɚ/","extraExplanation":["“pomster”并不是非常常见的标准英语词，更常见的形式是澳新英语里的“pom”（指英国人）以及“pommy”。“-ster”是英语里常见的后缀，用来表示“某类人”（如 youngster）。","关于“pom”一词的来源有多种说法，其中一个广为流传但不一定准确的民间解释是“Prisoner Of Mother England”的缩写；语言学上更常见的观点是它与早期对英国移民/英军的昵称及俚语演变有关。使用时要注意场合与语气。"]}

