{"word":"pon","summary":{"en":"“PON” most commonly means Passive Optical Network (fiber internet technology). “pon” can also be used as a playful sound effect in comics.","zh":"“PON”最常见指无源光网络（光纤接入技术）；“pon”也可作漫画里的拟声词，表示轻微碰撞或弹响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for Passive Optical Network, a fiber‑optic network technology used to deliver internet service to homes and businesses","zh":"Passive Optical Network（无源光网络）的缩写，一种利用光纤把网络服务（如宽带）送到家庭或企业的通信技术"},"examples":[{"en":"Our building uses a PON system for fiber internet.","zh":"我们这栋楼用的是 PON 光纤网络系统。"},{"en":"The technician checked the PON signal levels at the terminal.","zh":"技术员在终端检查了 PON 的光信号强度。"}]},{"partOfSpeech":"int.","definition":{"en":"a short sound word like “pon,” used in comics or playful writing to show a light impact or pop","zh":"拟声词（如“pon”），常见于漫画或俏皮写法中，表示轻轻的碰撞声或“啵/砰”的轻响"},"examples":[{"en":"The comic showed the ball hitting the wall: “pon!”","zh":"漫画里球撞到墙上写着：“pon！”"}]}],"synonyms":["Passive Optical Network","fiber network"],"phonetic":"/pɑn/","extraExplanation":["在英语里，“pon”单独作为常用词并不多见；最常见的是技术领域的缩写 PON（无源光网络）。如果你是在网络设备、光猫/ONU、运营商资料里看到的，几乎就是这个意思。","作为拟声词的“pon”更多出现在漫画、游戏文本或带日式风格的作品中，用来表现轻微的碰撞/弹跳声音；日常对话里不太会这么说。"]}
{"word":"ponca","summary":{"en":"Ponca refers to a Native American people and the language traditionally spoken by them.","zh":"Ponca 指庞卡族（北美原住民部族）以及他们传统使用的庞卡语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people originally from the Great Plains (especially present-day Nebraska), with communities today mainly in Oklahoma and Nebraska","zh":"庞卡族：北美原住民部族之一，起源于大平原地区（尤指今内布拉斯加州一带），现今主要社群分布在俄克拉荷马州与内布拉斯加州"},"examples":[{"en":"The Ponca were relocated in the late 1800s, which deeply affected their communities.","zh":"19世纪后期庞卡族经历了被迫迁移，这对他们的社群造成了深远影响。"},{"en":"She is researching Ponca history for a school project.","zh":"她正在为学校作业研究庞卡族的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Siouan language traditionally spoken by the Ponca people","zh":"庞卡语：庞卡族传统使用的苏语族（Siouan）语言"},"examples":[{"en":"A few elders still teach Ponca to younger learners through community classes.","zh":"一些长者仍通过社区课程把庞卡语教给年轻学习者。"},{"en":"This dictionary includes Ponca words and English glosses.","zh":"这本词典收录了庞卡语词汇及其英文释义。"}]}],"synonyms":["Ponca people","Ponca Nation","Ponca language"],"phonetic":"ˈpɑŋkə","extraExplanation":["“Ponca”在英语里通常作为专有名词使用（首字母大写更常见：Ponca），指族群或语言。用作形容时也常见于复合名词中，如“Ponca Nation（庞卡族国家/部族政府）”。","历史文化补充：19世纪末，庞卡族领袖Standing Bear（站立的熊）相关的法律事件常被提及；1879年的案件推动了“原住民被承认为‘人（person）’并能在联邦法院提起诉讼”的重要先例。","地名用法：美国也有以Ponca命名的地名（如Ponca City, Oklahoma）。在这种情况下，“Ponca”指地点而非族群或语言。"]}
{"word":"Ponce","summary":{"en":"Ponce is usually a Spanish surname (famously in “Ponce de León”) and can also refer to the city of Ponce in Puerto Rico.","zh":"Ponce 通常是西班牙语姓氏（常见于“Ponce de León”），也可指波多黎各的庞塞市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Spanish surname used in English, most commonly recognized from the explorer Juan Ponce de León.","zh":"一个西班牙语姓氏；在英语语境中最常见的联想是探险家胡安·庞塞·德·莱昂（Juan Ponce de León）。"},"examples":[{"en":"Our history class talked about Juan Ponce de León and early Spanish exploration.","zh":"我们的历史课讲到了胡安·庞塞·德·莱昂和早期西班牙探险。"},{"en":"Ponce is a common last name in Spanish-speaking communities.","zh":"Ponce 是西语社群中比较常见的姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"A city in southern Puerto Rico (often called “La Perla del Sur,” meaning “The Pearl of the South”).","zh":"波多黎各南部的一座城市——庞塞（Ponce），常被称为“南方明珠”。"},"examples":[{"en":"We drove from San Juan to Ponce to visit the historic downtown.","zh":"我们从圣胡安开车去庞塞，参观了历史悠久的市中心。"},{"en":"Ponce is known for its architecture and cultural festivals.","zh":"庞塞以建筑风格和文化节庆而闻名。"}]}],"synonyms":["Ponce de León","(surname)","(place name)"],"phonetic":"/ˈpɑːnseɪ/","extraExplanation":["“Ponce”源自西班牙语专名/姓氏。在英语里常见于“Ponce de León”。英语读法会因地区而不同；如果是西班牙语读法，结尾的 e 通常更接近“eh”的感觉。","胡安·庞塞·德·莱昂常与“青春之泉（Fountain of Youth）”的传说联系在一起；在文学与流行文化中也常被用作“寻找永恒青春”的象征。"]}
{"word":"ponce","summary":{"en":"“ponce” is mainly British slang meaning a pimp, or someone who lives off others; it can also be an offensive slur.","zh":"“ponce”主要是英式俚语，指皮条客或靠别人养活的人；也可作冒犯性贬称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British slang) A man who lives off money earned by a sex worker; a pimp.","zh":"（英式俚语）靠性工作者赚钱为生的男人；皮条客。"},"examples":[{"en":"The police said he was working as a ponce and taking her earnings.","zh":"警方称他在当皮条客，拿走她的收入。"},{"en":"In the novel, the ponce controls the women through threats.","zh":"在小说里，这个皮条客用威胁控制那些女性。"}]},{"partOfSpeech":"v.","definition":{"en":"(British slang, informal; often offensive) To live off someone else’s money or work, especially a partner’s or a sex worker’s earnings.","zh":"（英式俚语，非正式；常带冒犯）靠别人养活、占别人便宜（尤指伴侣或性工作者的收入）。"},"examples":[{"en":"He was accused of poncing off his friends instead of paying his share.","zh":"他被指责总占朋友便宜，不付自己那份钱。"},{"en":"She told him to stop poncing and get a job.","zh":"她让他别再吃软饭了，去找份工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(British slang, offensive) A derogatory term for a gay man or an “effeminate” man.","zh":"（英式俚语，冒犯性）对同性恋男性或被认为“娘娘腔”的男性的贬称。"},"examples":[{"en":"That word is insulting and should not be used.","zh":"这个词带侮辱性，不应使用。"}]}],"synonyms":["pimp (sense 1)","freeloader (sense 2)","sponger (UK, sense 2)"],"phonetic":"/pɑns/","extraExplanation":["“ponce”主要见于英式英语口语/俚语，在不同语境里语气可能很难听。第3条用法对性少数群体带有贬损色彩，属于冒犯性词汇；学习时建议识别其含义以便理解影视/文学，但不要用来称呼他人。","动词搭配常见：ponce off someone（占某人便宜、靠某人供养）。"]}
{"word":"ponceau","summary":{"en":"Ponceau means a bright poppy-like red, used as a color name or a dye/pigment; it can also describe something that is that vivid red.","zh":"Ponceau 指一种明亮的罂粟红，可作颜色名或该色染料/颜料；也可作形容词表示“鲜红的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright red color (poppy-like red), or a dye/pigment of that color","zh":"鲜红色（类似罂粟花的红色）；或指这种颜色的染料/颜料"},"examples":[{"en":"The designer chose a ponceau accent to make the poster stand out.","zh":"设计师选用一抹鲜红色（ponceau）来让海报更醒目。"},{"en":"The illustration uses ponceau and black for a bold, vintage look.","zh":"这幅插画用鲜红色（ponceau）和黑色搭配，呈现大胆的复古风格。"}]},{"partOfSpeech":"adj.","definition":{"en":"bright red; poppy-red","zh":"鲜红的；罂粟红的"},"examples":[{"en":"She wore a ponceau scarf that instantly drew attention.","zh":"她戴着一条鲜红的围巾，立刻吸引了目光。"},{"en":"The ponceau flowers in the field looked like small flames.","zh":"田野里鲜红的花朵像一簇簇小火焰。"}]}],"synonyms":["poppy red","scarlet","crimson","vermilion"],"phonetic":"/pɑnˈsoʊ/","extraExplanation":["“ponceau”来自法语，原义与“罂粟花（poppy）”的鲜红色相关，因此常带有“明亮、醒目、偏橘调的红”的感觉。","在生物/化学实验中你可能会见到“Ponceau S”（一种蛋白染色剂），用于在Western blot等实验里快速给膜上的蛋白染色以检查转膜情况。这里的“Ponceau”主要作为专有名词出现在试剂名称中。"]}
{"word":"ponced","summary":{"en":"“Ponced” is the past form of “ponce,” meaning to sponge off others; it can also mean (UK, often offensive) to act as a pimp, and it appears in “ponced up” meaning dressed up showily.","zh":"“ponced”是“ponce”的过去式/过去分词：常指“蹭吃蹭喝、占便宜”；也可（英式俚语且常冒犯）指“当皮条客”；在“ponced up”中还可表示“打扮得花哨/盛装”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of ponce) to get things (especially money, food, or favors) by begging or sponging off others instead of earning them.","zh":"（ponce 的过去式/过去分词）指通过乞求、占便宜、蹭吃蹭喝等方式从别人那里弄到钱、食物或好处，而不是自己赚取。"},"examples":[{"en":"He ponced a free meal off his friends again.","zh":"他又从朋友那里蹭了一顿免费的饭。"},{"en":"She admitted she’d ponced money from her parents for months.","zh":"她承认自己好几个月都在向父母伸手要钱。"}]},{"partOfSpeech":"v.","definition":{"en":"(UK slang, often offensive) (past tense/past participle) to work as a pimp or to live off the earnings of sex work.","zh":"（英式俚语，常带冒犯性）（过去式/过去分词）指当皮条客，或靠性工作者的收入为生。"},"examples":[{"en":"The newspaper claimed he had ponced for years.","zh":"报纸声称他当了多年的皮条客。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, usually in the phrase “ponced up”) dressed up in a showy or overly fancy way.","zh":"（非正式，常用于短语“ponced up”）打扮得花哨、过于讲究。"},"examples":[{"en":"He turned up all ponced up for a casual dinner.","zh":"他把自己打扮得很隆重，却只是来吃一顿随便的晚饭。"},{"en":"They got ponced up for the photos.","zh":"他们为了拍照特意打扮了一下。"}]}],"synonyms":["sponged","mooched","cadged","bumed","freeloaded"],"phonetic":"/pɑnst/","extraExplanation":["“ponced/ponce”主要见于英式英语（British English）。在不同语境里可能是“占便宜/蹭”的意思，也可能指“皮条客”。后者带有明显贬义，部分语境还可能被视为冒犯；使用时务必谨慎。","常见搭配：ponce off (someone)（从某人那里蹭/占便宜）；ponced up（盛装、打扮得花哨）。","相关词：ponce around/about（英式口语，指游手好闲或装腔作势；有时也带有对“举止娘气/做作”的贬义色彩，可能冒犯）。"]}
{"word":"poncelet","summary":{"en":"Poncelet is a proper name, referring to the French mathematician Jean-Victor Poncelet or to mathematical theorems named after him.","zh":"Poncelet 是专有名词，指法国数学家庞斯列，或指以他命名的数学定理/结论。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Jean-Victor Poncelet (1788–1867), a French mathematician and engineer, best known for major contributions to projective geometry.","zh":"庞斯列（Jean-Victor Poncelet，1788–1867），法国数学家与工程师，以对射影几何的重要贡献而闻名。"},"examples":[{"en":"In our geometry unit, we briefly discussed Poncelet and the birth of projective geometry.","zh":"在几何单元里，我们简要提到庞斯列以及射影几何的兴起。"},{"en":"Poncelet’s work influenced how mathematicians think about perspective and invariants.","zh":"庞斯列的工作影响了数学家对透视与不变量的思考方式。"}]},{"partOfSpeech":"other","definition":{"en":"Used in names of mathematical results associated with him (e.g., Poncelet’s theorem, Poncelet’s porism).","zh":"用于与他相关的数学定理/结论名称（如“庞斯列定理”“庞斯列闭合定理/庞斯列定理的一个推论”）。"},"examples":[{"en":"The textbook includes a short note on Poncelet’s porism.","zh":"教材里有一段关于庞斯列闭合定理的简短说明。"},{"en":"We won’t prove Poncelet’s theorem, but we’ll use its idea in problems.","zh":"我们不证明庞斯列定理，但会在题目中用到它的思想。"}]}],"synonyms":["Jean-Victor Poncelet","Poncelet’s theorem","Poncelet’s porism"],"phonetic":"/ˈpɑnsəleɪ/","extraExplanation":["“Poncelet”常见于数学与工程史语境；英语里多作为专有名词出现。课堂或论文中通常以“Poncelet’s + 名词”形式出现，表示“庞斯列的……”。","庞斯列与“射影几何（projective geometry）”关系密切；这门学科与绘画透视、投影与不变性质（在投影变换下保持不变的性质）有关。","发音方面：法语原音更接近鼻化的“pon-”，结尾近似“-let”；但在英语学术环境中常英语化读作“PON-suh-lay”。"]}
{"word":"ponces","summary":{"en":"“ponces” is the plural of “ponce,” mainly British slang meaning (1) male sex worker/pimp or (2) a showy, self-important person; it can also relate to the verb meaning to scrounge (“ponce off”).","zh":"“ponces”是“ponce”的复数，主要为英式俚语，可指（1）男妓/皮条客或（2）爱摆谱、装腔作势的人；也可与动词用法有关，表示“蹭、占便宜”（ponce off）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ponce” (British slang): a man who sells sex, or a pimp.","zh":"“ponce”的复数（英式俚语）：男妓；也可指皮条客。"},"examples":[{"en":"In old British crime stories, the police sometimes talk about “ponces” in the red-light district.","zh":"在一些老英国犯罪故事里，警察有时会提到红灯区的“ponces”（男妓/皮条客）。"},{"en":"The novel uses the word “ponces” to show the narrator’s judgmental attitude, not to praise them.","zh":"小说用“ponces”这个词是为了表现叙述者带有偏见的态度，并不是褒义。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “ponce” (British slang, informal): a showy, self-important person; a “poser.”","zh":"“ponce”的复数（英式俚语，非正式）：爱摆谱、爱炫耀的人；装腔作势的人。"},"examples":[{"en":"He called them “ponces” for wearing expensive clothes and acting superior.","zh":"他骂他们是“ponces”，因为他们穿得很贵还摆出高人一等的样子。"},{"en":"Try not to judge—slang like “ponces” can be harsh and unfair.","zh":"尽量别急着下结论——像“ponces”这样的俚语可能很刻薄也不公平。"}]},{"partOfSpeech":"v.","definition":{"en":"Plural form of the verb “ponce” (UK, informal): to get things from others without paying; to scrounge (often in “ponce off”).","zh":"动词“ponce”的第三人称单数形式对应的复数语境（英式，非正式）：不付钱占便宜；蹭（常见于“ponce off”）。"},"examples":[{"en":"They always ponce off their friends for free drinks.","zh":"他们总爱从朋友那里蹭免费的饮料。"},{"en":"He ponces whenever he can instead of paying his share.","zh":"他只要有机会就会占便宜，而不是付自己该付的那份。"}]}],"synonyms":["pimp","male prostitute","poser","show-off","scrounger"],"phonetic":"/pɑns/","extraExplanation":["“ponce/ponces”主要是英式俚语，在不同语境里可能指男妓/皮条客或“装腔作势的人”。它带有明显贬义，可能冒犯他人，不建议在正式场合或不熟悉语境时使用。","如果你想表达“猛扑、跃扑”，你要找的可能是“pounces”（来自动词 pounce）。也可能是专有名词“Ponce”的复数（如人名或地名），那就需要看上下文。"]}
{"word":"poncho","summary":{"en":"A poncho is a loose, cloak-like garment with a head opening, often used as a rain cover or as a traditional Latin American garment.","zh":"poncho 指一种宽松的套头披风式外衣，既可作雨披，也常指拉丁美洲传统斗篷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loose, simple outer garment (often waterproof) with a hole for the head, worn over the body like a cloak.","zh":"一种宽松的套头外衣（常为防水材质），中间有头部开口，像披风一样罩在身上。"},"examples":[{"en":"I brought a rain poncho in case the weather changed.","zh":"我带了一件雨披，以防天气变化。"},{"en":"He threw on a poncho over his backpack to keep everything dry.","zh":"他把雨披罩在背包外面，防止东西被淋湿。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional-style cloak-like garment associated especially with parts of Latin America, often made of wool and sometimes patterned.","zh":"一种传统披风式衣物，尤其常见于拉丁美洲部分地区，通常为羊毛材质，有时带有图案。"},"examples":[{"en":"In the market, you could see colorful wool ponchos for sale.","zh":"在集市上，你能看到色彩鲜艳的羊毛斗篷（poncho）在出售。"},{"en":"The dancer’s costume included a striped poncho.","zh":"舞者的服装里有一件条纹的斗篷（poncho）。"}]}],"synonyms":["rain cape","cloak","cape"],"phonetic":"/ˈpɑn.tʃoʊ/","extraExplanation":["“poncho”一词来自西班牙语，常与安第斯地区（如秘鲁、玻利维亚、智利、阿根廷等）的传统服饰形象联系在一起。英语里也很常见“rain poncho（一次性雨披/雨衣式雨披）”，多用于旅行、露营、音乐节等场景，强调“轻便、可套在衣服或背包外”。"]}
{"word":"ponchoed","summary":{"en":"“Ponchoed” usually means someone has put on a poncho or is covered/wearing a poncho.","zh":"“ponchoed”通常表示（某人）已经披上雨披/斗篷式外套，或处于被雨披覆盖的状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) to put a poncho on someone or yourself; to cover with a poncho.","zh":"（过去式/过去分词）给某人（或自己）披上斗篷式雨衣；用斗篷式雨衣覆盖。"},"examples":[{"en":"We got ponchoed before the rain started.","zh":"下雨前我们就披上了雨披。"},{"en":"The staff quickly ponchoed the kids for the outdoor game.","zh":"工作人员很快给孩子们都披上了雨披，好去户外比赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) wearing a poncho; covered by a poncho.","zh":"（非正式）披着雨披的；被雨披覆盖的。"},"examples":[{"en":"Everyone was ponchoed and still somehow got wet.","zh":"大家都披着雨披，但不知怎么还是淋湿了。"},{"en":"A ponchoed figure stood by the entrance.","zh":"入口处站着一个披着雨披的人。"}]}],"synonyms":["covered","cloaked","wrapped (up)","wearing a poncho"],"phonetic":"/ˈpɑn.tʃoʊd/","extraExplanation":["“poncho”一词来自西班牙语，常指拉丁美洲常见的披风式外套/雨具。英语里把名词当动词用（to poncho）比较口语化，常见于户外活动、旅游或临时躲雨的语境。","更正式的表达常用 wear/put on a poncho 或 cover with a poncho；“ponchoed”更像是现场口头描述动作的快捷说法。"]}
{"word":"ponchos","summary":{"en":"Ponchos are loose, sleeveless garments—often used as rain covers; “ponchos” is the plural of “poncho.”","zh":"Ponchos 指斗篷式披风/雨披；它是 poncho 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loose, sleeveless outer garment made from one large piece of fabric with a hole for the head, often used as a rain cover.","zh":"斗篷式披风；（常指）雨披：一种宽松、无袖的外套，通常由一整块布制成，中间开头洞套头，常用于挡雨。"},"examples":[{"en":"I packed a poncho in case it rains during the hike.","zh":"我带了一件雨披，以防徒步时下雨。"},{"en":"Tourists bought colorful ponchos at the market.","zh":"游客在市场上买了五颜六色的斗篷式披风（雨披）。"}]}],"synonyms":["rain cape","raincoat (similar purpose)","cape"],"phonetic":"/ˈpɑn.tʃoʊz/","extraExplanation":["“Poncho”一词来自西班牙语，常与拉丁美洲（尤其是安第斯地区）传统服饰相关；在英语里也很常见于“一次性塑料雨披（disposable poncho）”等现代场景。","复数形式是“ponchos”。在口语中，人们有时会直接说“a rain poncho（雨披）”来明确它的用途。"]}
{"word":"poncing","summary":{"en":"“Poncing” is British informal slang for cadging things from others, or for acting in a showy, self-important way. It can also have older, offensive meanings, so use with care.","zh":"“Poncing”是英式非正式说法，常指向别人白拿/蹭，或指装腔作势、招摇。它也有较旧且可能冒犯的含义，使用需谨慎。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE, informal) Getting something (money, food, favors) by asking others repeatedly, without intending to pay back; “cadging.”","zh":"（英式英语，非正式）反复向别人讨要东西（钱、食物、好处）而不打算偿还；“白拿、蹭”。"},"examples":[{"en":"He’s always poncing cigarettes off his coworkers.","zh":"他总是跟同事蹭烟。"},{"en":"Stop poncing and buy your own lunch.","zh":"别老蹭了，自己买午饭吧。"}]},{"partOfSpeech":"v.","definition":{"en":"(BrE, informal) Acting in a showy or self-important way; “poncing about/around.”","zh":"（英式英语，非正式）装腔作势、摆架子；“到处招摇/装样子”。"},"examples":[{"en":"He was poncing around in designer clothes like a celebrity.","zh":"他穿着名牌到处招摇，像个明星似的。"},{"en":"Quit poncing about and help us carry the boxes.","zh":"别装模作样了，来帮我们搬箱子。"}]},{"partOfSpeech":"other","definition":{"en":"(UK slang, dated/offensive) Related to a “ponce” (a pimp), or used as an insult meaning an “effeminate” or “contemptible” man.","zh":"（英国俚语，过时/冒犯）与“ponce”（皮条客）有关；或作侮辱语，指“娘娘腔/讨厌的人”等。"},"examples":[{"en":"In older crime fiction, you may see “ponce” used to mean a pimp.","zh":"在较老的犯罪小说里，你可能会看到“ponce”指皮条客。"},{"en":"Avoid using it as an insult—it can be offensive.","zh":"避免把它当侮辱语使用——可能会冒犯他人。"}]}],"synonyms":["cadging","scrounging","mooching","showing off","strutting"],"phonetic":"/ˈpɑːnsɪŋ/","extraExplanation":["“poncing”是“ponce”的现在分词/动名词形式。日常最常见的是“ponce off someone”（向某人白拿/蹭），以及“ponce around/about”（装腔作势、招摇）。","“ponce”在英国还有与性产业相关的旧义，以及带贬损色彩的辱骂义；这类用法在当代容易引发冒犯，尤其涉及性别气质的贬低，建议避免。"]}
{"word":"poncirus","summary":{"en":"Poncirus is a citrus-related plant genus best known for the trifoliate orange, widely used as hardy citrus rootstock.","zh":"Poncirus 指枳属植物，最常见为三叶枳，常作为耐寒的柑橘砧木使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of citrus-related trees and shrubs (especially the trifoliate orange), often used as hardy rootstock for citrus and sometimes grown as an ornamental plant","zh":"枳属（柑橘近缘的树/灌木属），尤其指三叶枳；常用作柑橘的耐寒砧木，也可作观赏植物"},"examples":[{"en":"Poncirus trifoliata is often used as rootstock to help citrus trees tolerate colder weather.","zh":"三叶枳（Poncirus trifoliata）常被用作砧木，帮助柑橘树更耐寒。"},{"en":"In some gardens, Poncirus is planted as a thorny hedge because it is hardy and dense.","zh":"在一些花园里，人们会种枳属植物当带刺的绿篱，因为它耐寒又茂密。"}]}],"synonyms":["trifoliate orange","hardy orange","Poncirus trifoliata"],"phonetic":"/pɑnˈsaɪrəs/","extraExplanation":["“Poncirus”是拉丁化的植物学属名，常见成员为三叶枳（也叫枳、三叶橙）。它的果实通常很酸、偏苦，不像甜橙那样直接食用，但在柑橘栽培中非常重要，因为它抗寒、抗病，常被用来嫁接柑橘。","现代分类中，有些资料会把Poncirus并入Citrus（柑橘属）或视为与之近缘的独立属；不同书籍/数据库可能用法略有差异。"]}
{"word":"pond","summary":{"en":"A pond is a small, calm body of water; as a verb, it means water collects and becomes still in one place.","zh":"pond 指小而平静的水体“池塘”；作动词可表示“积水成塘/成水洼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, still body of water, smaller than a lake (often natural or man-made)","zh":"池塘；小水塘（通常比湖小，水面较平静，可为天然或人工）"},"examples":[{"en":"There’s a small pond behind our house with ducks in it.","zh":"我们房子后面有个小池塘，里面有鸭子。"},{"en":"The children fed the fish at the park pond.","zh":"孩子们在公园的池塘里喂鱼。"}]},{"partOfSpeech":"v.","definition":{"en":"to store or hold back water in a pond or small pool; to form a still pool","zh":"蓄水成塘；（水）积成小水洼/小池"},"examples":[{"en":"After the heavy rain, water ponded in the low areas of the road.","zh":"大雨过后，路面的低洼处积了水。"}]}],"synonyms":["pool","waterhole","small lake"],"phonetic":"/pɑnd/","extraExplanation":["在英式英语里，“across the pond”常指“横跨大西洋”，英国人说的通常是去美国/北美，美国人说的常是去英国。它是一种幽默、亲切的说法。"]}
{"word":"pondage","summary":{"en":"Pondage means the storage capacity of a pond or reservoir, especially used for regulating water flow or supporting hydropower.","zh":"Pondage指池塘或水库的蓄水量/库容，常用于调节水流或支持水电等系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount of water that can be stored in a pond or reservoir (storage capacity), often for controlling flow or supplying a system (e.g., hydropower).","zh":"（池塘或水库的）蓄水量/库容；常用于调节水流或为系统（如水电）供水。"},"examples":[{"en":"The dam’s pondage helps smooth out daily changes in electricity demand.","zh":"这座大坝的蓄水库容有助于平衡用电需求的日内波动。"},{"en":"Low pondage means the plant cannot store much water for later use.","zh":"库容偏低意味着电站无法储存太多水以备后用。"},{"en":"Engineers measured pondage to estimate how long the reservoir could support irrigation.","zh":"工程师测量库容来估算水库能为灌溉提供多长时间的支持。"}]}],"synonyms":["storage capacity","reservoir storage","impoundment storage","water storage"],"phonetic":"/ˈpɑndɪdʒ/","extraExplanation":["“pondage”主要出现在水利工程、河流调度与水电领域的技术语境中，日常口语里不常用。","在水电站语境中，pondage常指用于短期调节的可用蓄水量（例如在一天内调峰），不同于更广义的“reservoir storage”（水库总库容）在某些文献中的用法。"]}
{"word":"pondbush","summary":{"en":"“pondbush” is uncommon; it usually means a bush near a pond (often written “pond bush”) or may be a name/username.","zh":"“pondbush”不常见；通常指池塘边的灌木（常写作“pond bush”），也可能只是名字/用户名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A bush or shrub growing near a pond; often written as two words: “pond bush.”","zh":"（不常见）长在池塘边的灌木；常写作两个词：pond bush（池塘边的灌木）。"},"examples":[{"en":"A small pond bush leaned over the water, giving frogs a place to hide.","zh":"一丛小小的池塘边灌木伸向水面，给青蛙提供了藏身处。"},{"en":"We cleared some pond bushes to open a view of the pond.","zh":"我们清理了一些池塘边的灌木，好让视野能看到池塘。"}]},{"partOfSpeech":"other","definition":{"en":"A name-like form (e.g., a username, family name, or place name) that looks like “pond” + “bush,” but is not a standard dictionary word in general English.","zh":"一种类似专有名词的形式（如用户名、姓氏或地名），看起来由 pond（池塘）+ bush（灌木）组成，但并非通用英语里的标准词条。"},"examples":[{"en":"Online, “pondbush” might be a username rather than a vocabulary word.","zh":"在网上，“pondbush”可能是用户名，而不是常用词汇。"}]}],"synonyms":["pond-side bush","bush by the pond","shrub by the pond"],"phonetic":"/ˈpɑːndˌbʊʃ/","extraExplanation":["“pondbush”作为一个连写词在通用英语里很少见；更自然的表达通常是“a bush by the pond”或“pond-side bushes”。如果你是在特定文本、地名或用户名里看到它，含义可能依上下文而定。"]}
{"word":"ponded","summary":{"en":"“Ponded” means water collected into a pool (or was made to collect) like a small pond.","zh":"“ponded”表示（水）积成一滩/一潭，或被拦蓄而聚集成类似小池塘的水域。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of \"pond\") To collect and stay in one place as a small pool; to form a pond-like area of water.","zh":"（动词 pond 的过去式/过去分词）积水成潭；形成像池塘一样的一片水。"},"examples":[{"en":"After the storm, water ponded on the road.","zh":"暴风雨过后，路面上积了水。"},{"en":"Rainwater ponded in the low spots of the parking lot.","zh":"雨水在停车场的低洼处形成积水。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of \"pond\") To cause water to collect by blocking or controlling its flow.","zh":"（动词 pond 的过去式/过去分词）拦蓄（水）；使水因阻挡或控制流动而聚集。"},"examples":[{"en":"Engineers ponded the runoff behind a small berm to reduce flooding.","zh":"工程师在小土堤后蓄积径流，以减少洪水风险。"},{"en":"The beavers ponded the stream by building a dam.","zh":"海狸筑坝把溪水拦蓄成一片水域。"}]}],"synonyms":["pooled","collected","accumulated","impounded"],"phonetic":"/ˈpɑndɪd/","extraExplanation":["“ponded”在日常英语里不算常见，更常见于道路工程、排水、防洪、地质/水文等语境（例如 *ponded water* “积水”).","很多学习者会把“ponded”和“pondered（沉思，仔细考虑）”混淆：*ponded* = 积水/蓄水；*pondered* = 深思。"]}
{"word":"ponder","summary":{"en":"Ponder means to think carefully and deeply about something, often before making a decision.","zh":"Ponder 指对某事进行认真、深入的思考，常用于做决定或权衡之前。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to think about something carefully for a period of time; to consider it deeply","zh":"仔细思考；深思；反复琢磨（某事）"},"examples":[{"en":"She pondered the question before answering.","zh":"她在回答前先仔细思考了这个问题。"},{"en":"I’m still pondering whether to take the new job.","zh":"我还在琢磨要不要接受那份新工作。"}]},{"partOfSpeech":"v.","definition":{"en":"to quietly think about something serious or difficult (often with a thoughtful, calm tone)","zh":"沉思；静静地思索（常带有认真、平静的语气）"},"examples":[{"en":"He sat by the window, pondering his next move.","zh":"他坐在窗边，沉思着下一步该怎么做。"}]}],"synonyms":["consider","reflect on","contemplate","mull over"],"phonetic":"ˈpɑndɚ","extraExplanation":["“ponder”比“think”更强调“慢慢想、想得更深”，常用于更严肃或更需要权衡的事情（比如决定、问题、人生选择）。","常见搭配：ponder a question/idea/decision；ponder whether/what/how…。语气通常偏书面或较正式。"]}
{"word":"ponderability","summary":{"en":"Ponderability means the quality of having weight (being able to be weighed), and less commonly a figurative sense of seriousness or “weightiness.”","zh":"Ponderability 指“有重量、可称重”的性质；较少见的比喻义为“有分量、严肃/厚重感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having weight; the fact that something can be weighed (being “ponderable”)","zh":"有重量的性质；可被称重（可衡量性）"},"examples":[{"en":"In physics, ponderability refers to whether a body has weight and can be measured on a scale.","zh":"在物理学中，ponderability 指物体是否有重量、能否用秤测量。"},{"en":"The experiment compared the ponderability of different materials under the same conditions.","zh":"该实验在相同条件下比较了不同材料的可称重性。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, less common) heaviness in a serious or impressive way; gravity or solidity","zh":"（比喻，不常用）沉重感（庄重/有分量）；严肃性或厚重感"},"examples":[{"en":"His voice had a certain ponderability that made even simple words sound important.","zh":"他的声音带着一种“分量感”，连简单的话听起来都很重要。"},{"en":"The film’s slow pace adds to its ponderability.","zh":"这部电影的慢节奏增加了它的厚重感。"}]}],"synonyms":["weight","heaviness","mass","gravity","seriousness","weightiness"],"phonetic":"/ˌpɑn.də.rəˈbɪl.ə.ti/","extraExplanation":["这个词比较书面、也较少在日常英语中使用。更常见的表达是 weight / heaviness（字面重量），或 seriousness / gravity（比喻“有分量、很严肃”）。","词源来自拉丁语 ponderare（称重、掂量），与 ponder（沉思、反复思量）同源：都带有“掂量/权衡”的核心意象。","在文学或评论语境里，“ponderability”常用来形容语气、风格或作品带来的“厚重、郑重”的感觉（比喻用法）。"]}
{"word":"ponderable","summary":{"en":"Ponderable means “able to be weighed” or, more rarely, “important/weighty.”","zh":"Ponderable 表示“可称重的”，更少见时也可表示“重要的、有分量的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be weighed; having measurable weight (often used in technical or formal writing).","zh":"可称重的；有可测重量的（常用于技术或正式语境）。"},"examples":[{"en":"Gold is ponderable, so it can be weighed on a scale.","zh":"黄金是可称重的，所以可以用天平称量。"},{"en":"The experiment compared the behavior of ponderable matter and light.","zh":"该实验比较了可称重的物质与光的行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"important or serious; weighty in meaning or effect (rare in everyday speech).","zh":"重要的；严肃的；有分量的（日常口语中较少见）。"},"examples":[{"en":"She raised a ponderable objection to the plan.","zh":"她对这个计划提出了一个很有分量的反对意见。"},{"en":"The judge considered the most ponderable facts first.","zh":"法官先考虑最关键、最有分量的事实。"}]}],"synonyms":["measurable","physical","material","weighty","significant","important"],"phonetic":"/ˈpɑndərəbəl/","extraExplanation":["“Ponderable”来自拉丁语词根 pondus（重量）和动词 ponderare（称重、权衡）。因此它既可以指“可称重的物质”（常见于物理/哲学语境，如“ponderable matter”），也可引申为“有分量的、重要的”。","日常英语里更常用的近义表达是 measurable/physical（可测量的/物质的）或 important/significant/weighty（重要的/有分量的）。另外，“ponderous”表示“笨重的；冗长沉闷的”，不要与“ponderable”混淆。"]}
{"word":"ponderableness","summary":{"en":"Ponderableness means “the quality of being weighable or having weight,” and (rarely) “a sense of seriousness or weightiness.”","zh":"ponderableness 指“可称量/有重量的性质”，也可（较罕见地）指“庄重、沉重或重要的感觉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be weighed; having measurable weight.","zh":"可称量性；具有可测量重量的性质。"},"examples":[{"en":"In early science writing, the ponderableness of air was debated and tested.","zh":"在早期科学著作中，人们曾争论并通过实验检验空气是否具有可称量性。"},{"en":"The experiment was meant to prove the ponderableness of the gas.","zh":"该实验旨在证明这种气体具有可称量性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) The quality of feeling weighty, serious, or important.","zh":"（引申义，罕见）沉重感；严肃或重要的感觉。"},"examples":[{"en":"The long silence added to the ponderableness of the moment.","zh":"长久的沉默增加了那一刻的沉重感。"},{"en":"He spoke with a ponderableness that made everyone listen.","zh":"他说话带着一种庄重感，让所有人都认真聆听。"}]}],"synonyms":["weight","mass","measurable weight","weightiness","heaviness","gravitas"],"phonetic":"/ˈpɑndərəbəlnəs/","extraExplanation":["这个词非常少见，多见于较早的科学/哲学英语中（尤其讨论“物质”“重量”“可称量性”时）。现代英语更常用 weight、mass、measurable weight，或用 weightiness/gravitas 表示“庄重、重要”。","构词：ponderable（可称量的）+ -ness（名词后缀）。词根 ponder- 来自拉丁语 pondus（重量），也和动词 ponder（仔细思考）同源，但这里的核心含义是“重量/可称量”。"]}
{"word":"ponderal","summary":{"en":"“Ponderal” is a formal adjective meaning “related to weight” or “measured by weight,” often used in medical/scientific contexts.","zh":"“ponderal”是正式用语，作形容词，表示“与重量有关/按重量计量”，常见于医学或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to weight; measured or estimated by weight (often used in scientific or technical writing).","zh":"与重量有关的；按重量计量或估算的（常见于科学或技术语境）。"},"examples":[{"en":"The drug dose was adjusted based on the patient’s ponderal mass.","zh":"药物剂量根据患者的体重（质量）进行了调整。"},{"en":"Some studies compare ponderal measurements like body weight with height-based indexes.","zh":"一些研究会把体重等按重量的测量，与按身高计算的指数进行比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In phrases like “ponderal index”) A term used in medicine to describe a weight-to-height relationship, especially in newborns.","zh":"（如“ponderal index/皮下脂肪指数/体重身长指数”等术语中）医学用语，用来描述体重与身长的比例关系，常用于新生儿。"},"examples":[{"en":"The clinician calculated the ponderal index to assess the baby’s growth pattern.","zh":"临床医生计算了 ponderal index 来评估婴儿的生长模式。"},{"en":"A low ponderal index may suggest thinness for length, but interpretation depends on context.","zh":"ponderal index 偏低可能提示“身长相对偏瘦”，但仍需结合具体情况解读。"}]}],"synonyms":["weight-related","by weight","gravimetric","mass-based"],"phonetic":"/ˈpɑːn.dɚ.əl/","extraExplanation":["“ponderal”源自拉丁语 pondus（重量）。它比常见词“weight-related / by weight”更正式，通常出现在医学、营养学、人体测量学（anthropometry）等文献里。","常见搭配：ponderal mass（体重/按重量的质量）、ponderal measurement（按重量的测量）、ponderal index（体重身长相关指数，常用于婴儿体格评估）。日常英语里很少单独使用。","易混词：ponder（沉思）拼写相近但意思完全不同。记忆法：ponderal 里有“pondus（重量）”的词根联想。"]}
{"word":"ponderance","summary":{"en":"Ponderance means a greater amount, weight, or influence; in law it often refers to the “preponderance of the evidence” standard (more likely than not).","zh":"ponderance 指相较之下更大的数量、分量或影响力；在法律语境中常指“优势证据”标准（更可能为真）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Greater weight, amount, influence, or importance compared with something else; the state of being more powerful or numerous.","zh":"较大的分量/数量/影响力；优势地位（相较于其他事物更占上风）。"},"examples":[{"en":"In the debate, the ponderance of evidence supported her claim.","zh":"在辩论中，占优势的证据支持了她的主张。"},{"en":"There is a ponderance of opinion that the policy should be changed.","zh":"多数意见认为这项政策应该调整。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) The “preponderance of the evidence” standard: one side’s evidence is more convincing than the other’s (more likely than not).","zh":"（法律）“优势证据”标准：一方证据更有说服力（更可能为真，通常指超过50%的可能性）。"},"examples":[{"en":"In civil cases, the plaintiff usually must prove the claim by a preponderance of the evidence.","zh":"在民事案件中，原告通常需要以“优势证据”来证明其主张。"},{"en":"The judge said the preponderance of the evidence favored the defendant.","zh":"法官表示优势证据更支持被告。"}]}],"synonyms":["preponderance","dominance","majority","superiority","weight","influence"],"phonetic":"/ˈpɑndərəns/","extraExplanation":["“ponderance”来自拉丁语词根 *ponder-*（意为“重量/衡量”），与 *ponder*（认真思考、反复掂量）同源，因此它既可指“更重/更多”，也常引申为“更有影响力/更占优势”。","日常英语里，“ponderance”较正式，常见搭配有：a ponderance of evidence/opinion（大量/占优势的证据或观点）。法律语境里更常固定为“preponderance of the evidence（优势证据）”。"]}
{"word":"ponderancy","summary":{"en":"“Ponderancy” means predominance or greater weight/influence, but it’s rare; “preponderance” is the common word.","zh":"“ponderancy”指优势地位/更大的分量或影响力，但很少用；常用词是“preponderance”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Greater weight, importance, or influence; predominance (rare form of “preponderance”).","zh":"（较少见）更大的分量、重要性或影响力；优势地位（相当于 preponderance）。"},"examples":[{"en":"The ponderancy of public opinion shaped the final decision.","zh":"公众舆论的主导影响塑造了最终决定。"},{"en":"In the report, economic factors had clear ponderancy over cultural ones.","zh":"在报告中，经济因素明显比文化因素更占主导。"}]}],"synonyms":["preponderance","predominance","ascendancy","dominance","superiority","weight"],"phonetic":"/ˈpɑːndərənsi/","extraExplanation":["“ponderancy”在现代英语中很少使用，更常见、更自然的说法是“preponderance”（优势、主导地位）或“predominance”。","词根与拉丁语“ponder-（重量）”有关，也见于“ponder（仔细思考）”“ponderous（沉重的）”。这里的意思更偏“重量/分量”引申出的“影响力/重要性”，而不是“思考”。","如果你在学术写作中表达“某因素占主导”，更推荐用：the preponderance of evidence / the predominance of X / X outweighs Y。"]}
{"word":"ponderant","summary":{"en":"Ponderant means “having great weight or influence,” especially in decisions.","zh":"ponderant 指“分量很重、很有影响力”，常用于表示在决策中占重要比重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Important or influential; having a lot of weight in deciding something.","zh":"重要的；有影响力的；（在决定中）占很大分量的。"},"examples":[{"en":"Cost was a ponderant factor in choosing the apartment.","zh":"费用是选择公寓时一个很重要的因素。"},{"en":"Her opinion became more ponderant as she gained experience.","zh":"随着经验增长，她的意见变得更有分量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Heavy; weighty (literally or figuratively).","zh":"（较少见）沉重的；有重量的（字面或比喻）。"},"examples":[{"en":"He carried a ponderant package up the stairs.","zh":"他把一个沉重的包裹搬上楼梯。"}]}],"synonyms":["influential","important","weighty","decisive","dominant"],"phonetic":"/ˈpɑndərənt/","extraExplanation":["“ponderant”较正式，常见于学术写作或法律/政策语境，表示“在判断中占主导权重”。日常英语更常用 important / major / decisive / influential。","词源与拉丁语 pondus（重量）有关，所以它既可指“实际很重”，也常比喻“分量很重、影响很大”。"]}
{"word":"ponderare","summary":{"en":"Ponderare means to weigh or to think carefully and seriously about something before deciding.","zh":"ponderare 指“称量/衡量”，也指“认真权衡、深思后再决定”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to consider something carefully before deciding; to think about it deeply","zh":"仔细考虑；深思（在决定前认真权衡）"},"examples":[{"en":"Before you reply, take a moment to ponderare what she really meant.","zh":"在你回复之前，先花点时间仔细想想她真正的意思。"},{"en":"He ponderare the risks and chose the safer option.","zh":"他权衡了风险，选择了更安全的方案。"}]},{"partOfSpeech":"vt.","definition":{"en":"to weigh (literally or figuratively), especially by comparing importance or value","zh":"称量；衡量（字面或比喻，尤指比较重要性或价值）"},"examples":[{"en":"The jeweler must ponderare the gold to set a fair price.","zh":"珠宝商必须称量黄金，才能定出公道的价格。"},{"en":"We should ponderare the benefits against the costs.","zh":"我们应该把收益和成本放在一起衡量。"}]}],"synonyms":["consider","weigh","ponder","contemplate","evaluate"],"phonetic":"/ˌpɑn.deˈrɑ.re/","extraExplanation":["“ponderare”常见于意大利语（也可追溯到拉丁语词根），意思与英语的“ponder / weigh”很接近：既可以指“实际称重”，也常用来指“在脑中权衡、深思”。","词根与英语“ponder”（沉思）同源：都来自表示“重量/衡量”的概念，因此它带有“把想法放在秤上掂量”的形象感。"]}
{"word":"ponderary","summary":{"en":"Ponderary means “related to weight” or, formally, “carrying weight as evidence.”","zh":"ponderary 指“与重量有关/按重量计”的；正式用法中也可指“证据有分量、具说服力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to weight; measured or evaluated by weight (rather than by number or size).","zh":"与重量有关的；按重量计量或衡量的（而不是按数量或体积）。"},"examples":[{"en":"The shipment cost is based on ponderary weight, not on the number of boxes.","zh":"这批货的运费按重量计算，而不是按箱子的数量计算。"},{"en":"Some chemicals are sold by ponderary measure, such as grams or kilograms.","zh":"有些化学品按重量单位出售，例如克或千克。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law, formal) Having weight or force as evidence; persuasive because it carries “weight.”","zh":"（法律，正式）有分量的；作为证据具有说服力的（因为“分量”足）。"},"examples":[{"en":"The judge found the document to be ponderary evidence.","zh":"法官认为该文件是有分量的证据。"},{"en":"Her calm testimony was more ponderary than the rumors online.","zh":"她冷静的证词比网上的传言更有说服力。"}]}],"synonyms":["weight-based","by weight","gravimetric","weighty","compelling"],"phonetic":"/ˈpɑːndəˌreri/","extraExplanation":["“ponderary”来自拉丁语词根 *ponder-*（重量），同源词有 *ponder*（认真思考，原义也与“掂量、权衡”有关）和 *ponderous*（沉重的/冗长的）。","在现代英语中，“ponderary”非常少见，更常用的表达是 *by weight*, *weight-based*, *gravimetric*（偏学术/技术）。","法律语境里偶见 “ponderary evidence”，强调证据的“分量/力度”，但日常写作里通常会用 *strong/compelling evidence* 更自然。"]}
{"word":"ponderate","summary":{"en":"Ponderate means to weigh or carefully consider something; it’s a formal, less common word today.","zh":"ponderate 意为“称量”或“仔细权衡、评估”，属于较正式、现代较少用的词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to weigh something (literally or figuratively); to assess carefully","zh":"（字面或比喻）称量；仔细权衡、评估"},"examples":[{"en":"Before you decide, ponderate the risks and benefits.","zh":"在你决定之前，先权衡一下风险和收益。"},{"en":"The committee ponderated several proposals before choosing one.","zh":"委员会仔细评估了几项提案后才选定其中一个。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literal, uncommon) to determine the weight of something","zh":"（字面义，较少用）测定某物的重量"},"examples":[{"en":"In the lab, they ponderated the sample to record its exact mass.","zh":"在实验室里，他们称量样品以记录其精确质量。"}]}],"synonyms":["ponder","weigh","consider","evaluate","assess","deliberate"],"phonetic":"/ˈpɑːndəˌreɪt/","extraExplanation":["“ponderate”在现代英语里比较少见，写作中更常用的是“ponder”（认真思考）或“weigh”（权衡/称重）。如果你想表达“仔细考虑”，用“ponder”更自然；如果强调“权衡利弊”，用“weigh (up)”更地道。","词源上与拉丁语“pondus”（重量）有关，因此既可指“称重”，也可比喻“权衡”。在正式或学术语境中偶尔会出现，但日常对话中很少用。"]}
{"word":"ponderation","summary":{"en":"Ponderation means weighing or carefully considering something before deciding.","zh":"ponderation 指“称量/衡量”，也指“权衡后做决定的慎重考虑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of weighing something (literally or figuratively)","zh":"（字面或比喻）称重；衡量的过程"},"examples":[{"en":"In chemistry class, accurate ponderation is necessary before mixing solutions.","zh":"在化学课上，混合溶液前必须先精确称量。"},{"en":"The committee’s decision came after careful ponderation of the risks and benefits.","zh":"委员会在仔细权衡风险与收益后才做出决定。"}]},{"partOfSpeech":"n.","definition":{"en":"careful consideration; the evaluation of reasons, evidence, or factors before deciding","zh":"深思熟虑；对理由、证据或因素的评估与权衡"},"examples":[{"en":"After some ponderation, she chose the job with better long-term growth.","zh":"经过一番慎重考虑，她选择了更有长期发展空间的工作。"},{"en":"His words show ponderation rather than impulse.","zh":"他的话体现出深思熟虑，而不是冲动。"}]}],"synonyms":["consideration","deliberation","weighing","evaluation","reflection"],"phonetic":"/ˌpɑndəˈreɪʃən/","extraExplanation":["“ponderation”在现代英语中较为正式且不常用；日常表达里更常用“consideration / weighing / deliberation”。","词根来自拉丁语pondus（重量），与“ponder（沉思、权衡）”“ponderous（沉重的）”有同源关系。"]}
{"word":"ponderative","summary":{"en":"Ponderative means deeply thoughtful or reflective, as if carefully weighing ideas.","zh":"ponderative 指“沉思的、深思熟虑的”，带有仔细权衡想法的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"deeply thoughtful; inclined to think carefully and seriously (often in a quiet way)","zh":"沉思的；爱深思熟虑的（常带安静、严肃的语气）"},"examples":[{"en":"He gave a ponderative pause before answering the question.","zh":"他沉思地停顿了一下才回答问题。"},{"en":"Her ponderative expression suggested she was weighing every possibility.","zh":"她沉思的表情暗示她在权衡各种可能性。"}]}],"synonyms":["thoughtful","reflective","pensive","contemplative"],"phonetic":"/ˈpɑːndərətɪv/","extraExplanation":["“ponderative”属于较少见、较正式的词，多用于写作或文学语境；日常口语里更常用 thoughtful, reflective, pensive。","词源与拉丁语 ponderare（“权衡、掂量”）有关，所以它常带有“像称重一样把想法仔细衡量”的感觉。"]}
{"word":"pondered","summary":{"en":"“Pondered” means “thought about something carefully,” the past form of “ponder.”","zh":"“pondered”表示“认真思考过/深思过”，是“ponder”的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"thought about something carefully for a period of time; considered deeply (past tense/past participle of “ponder”).","zh":"仔细想过；深思过（“ponder”的过去式/过去分词）。"},"examples":[{"en":"She pondered the question before answering.","zh":"她仔细想了那个问题才回答。"},{"en":"He pondered whether to accept the new job offer.","zh":"他反复思考是否要接受那份新工作。"},{"en":"We pondered the risks and decided to wait.","zh":"我们权衡了风险，决定先等等。"}]}],"synonyms":["considered","reflected (on)","contemplated","deliberated","weighed"],"phonetic":"/ˈpɑndərd/","extraExplanation":["“ponder”比“think”更正式，强调“慢慢地、认真地想”，常用来表示在做决定、讨论复杂问题或反思人生时的深思熟虑。","常见搭配：ponder a question/idea/problem（思考问题/想法/难题）；ponder whether/how/what...（思考是否/如何/什么……）。"]}
{"word":"ponderer","summary":{"en":"“Ponderer” means a person who thinks deeply and carefully.","zh":"“ponderer”指“爱深思、仔细思考的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who thinks about something carefully for a long time; a deep thinker","zh":"沉思者；爱深思的人"},"examples":[{"en":"She’s a quiet ponderer who likes to reflect before speaking.","zh":"她是个安静的沉思者，喜欢先思考再开口。"},{"en":"As a ponderer, he often asks big questions about life and meaning.","zh":"作为一个爱深思的人，他常常提出关于人生与意义的大问题。"}]}],"synonyms":["deep thinker","thinker","reflective person","contemplative person"],"phonetic":"/ˈpɑːndərər/","extraExplanation":["“ponderer”来自动词“ponder”（沉思、仔细考虑），后缀“-er”表示“做某事的人”，所以字面意思是“沉思的人”。","语体上，“ponderer”不算特别常用；日常更常见的说法是“a thoughtful person / a deep thinker”。在写作或较正式的语境里用“ponderer”会显得更文学一点。","相关词：ponder（v. 沉思）、pondering（n./adj. 思考；沉思的）、thoughtful（adj. 深思的/体贴的）、philosopher（n. 哲学家；爱思考的人）。"]}
{"word":"ponderers","summary":{"en":"“Ponderers” means people who think deeply and carefully.","zh":"“ponderers” 指“认真深思的人（们）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who ponder; people who think about something carefully for a long time.","zh":"沉思者；深思者；会长时间认真思考某事的人。"},"examples":[{"en":"The book is popular with ponderers who enjoy big questions about life.","zh":"这本书很受沉思者欢迎，因为他们喜欢思考人生的大问题。"},{"en":"In the quiet room, the ponderers sat with notebooks and read slowly.","zh":"在安静的房间里，沉思者们坐着写笔记，慢慢阅读。"}]}],"synonyms":["thinkers","contemplators","reflective people","philosophers"],"phonetic":"/ˈpɑndərərz/","extraExplanation":["“ponderers” 是 “ponderer”（沉思者）的复数形式：ponder（思考）+ -er（做某事的人）+ -s（复数）。","语气通常偏中性或带一点文艺感，常用于形容喜欢深入思考、爱问“为什么”的人；比 “thinkers” 更强调“反复琢磨、慢慢想”。"]}
{"word":"pondering","summary":{"en":"“Pondering” means thinking deeply and carefully about something, often for a while.","zh":"“pondering”表示对某事进行深入、认真、持续的思考或权衡。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"thinking about something carefully and for a long time; considering it deeply","zh":"仔细地、长时间地思考；深思"},"examples":[{"en":"She sat by the window, pondering what to do next.","zh":"她坐在窗边，深思接下来该怎么办。"},{"en":"I’m pondering whether to change my major.","zh":"我正在考虑要不要换专业。"},{"en":"He walked home slowly, pondering the meaning of the message.","zh":"他慢慢走回家，琢磨那条信息的含义。"}]},{"partOfSpeech":"n.","definition":{"en":"a deep, thoughtful state of thinking; careful reflection (less common)","zh":"沉思；深思熟虑（较不常用）"},"examples":[{"en":"After some pondering, she gave her answer.","zh":"经过一番思考后，她给出了答案。"},{"en":"His long pondering led him to a simple decision.","zh":"他长时间的沉思让他最终做出了一个简单的决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"thoughtful; showing careful consideration","zh":"沉思的；若有所思的"},"examples":[{"en":"He had a pondering look on his face.","zh":"他脸上带着沉思的神情。"},{"en":"Her pondering silence made everyone wait.","zh":"她若有所思地沉默着，让大家都在等待。"}]}],"synonyms":["thinking","reflecting","considering","mulling (over)","contemplating","deliberating"],"phonetic":"/ˈpɑndərɪŋ/","extraExplanation":["“ponder”语气比“think”更郑重、更慢一些，常用在需要认真权衡或反复思考的情境。日常口语里也常用“think about”来表达更轻松的“考虑”。","常见搭配：ponder a question（思考一个问题）、ponder the meaning（琢磨含义）、ponder whether/if…（考虑是否……）。"]}
{"word":"ponderingly","summary":{"en":"“Ponderingly” means “in a deep, reflective, thinking way.”","zh":"“ponderingly”表示“沉思地、若有所思地”，带有深思熟虑的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a thoughtful, reflective way; as if thinking carefully about something.","zh":"沉思地；若有所思地；以认真思考的方式。"},"examples":[{"en":"She stared out the window ponderingly, weighing her options.","zh":"她若有所思地望着窗外，权衡着自己的选择。"},{"en":"He nodded ponderingly before answering the question.","zh":"他沉思地点了点头，然后才回答问题。"},{"en":"The teacher looked at the drawing ponderingly, then asked a gentle question.","zh":"老师若有所思地看着那幅画，然后温和地问了一个问题。"}]}],"synonyms":["thoughtfully","pensively","reflectively","contemplatively"],"phonetic":"/ˈpɑndərɪŋli/","extraExplanation":["“ponderingly”来自动词“ponder”（仔细思考、反复琢磨）+ 副词后缀“-ly”。语气比“thoughtfully”更强调“反复权衡、深思熟虑”的感觉。","在现代口语里并不算高频，更常见的是用“thoughtfully / pensively”或用短语表达：“in a thoughtful way / as if deep in thought”。写作（叙事、描写人物神态）中更常见。"]}
{"word":"ponderling","summary":{"en":"“Ponderling” is a rare/nonstandard word, usually meaning a person who ponders or (less commonly) something related to pondering.","zh":"“ponderling”是罕见且非标准的用法，通常指“爱沉思的人”（较少情况下可指“与沉思相关的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A person who ponders; someone who thinks about something carefully.","zh":"（罕见／非标准用法）爱沉思的人；思考者。"},"examples":[{"en":"In the poem, the narrator is a lonely ponderling, turning the same question over and over.","zh":"在这首诗里，叙述者像个孤独的“ponderling”，反复琢磨同一个问题。"},{"en":"He described himself as a quiet ponderling rather than a talker.","zh":"他形容自己是安静的“ponderling”，而不是健谈的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Thinking carefully and for a long time; pondering.","zh":"（罕见／非标准用法）长时间认真思考的；沉思的。"},"examples":[{"en":"She sat in a ponderling mood before answering.","zh":"她带着沉思的心情坐了一会儿才回答。"}]}],"synonyms":["ponderer","thinker","contemplator","ruminator"],"phonetic":"/ˈpɑndɚlɪŋ/","extraExplanation":["“ponderling”并不是现代英语里的常见词，很多情况下可能是拼写错误或创意用词（nonce word）。最常见的目标词可能是 **pondering**（沉思、思索）。","如果你是在小说、诗歌、游戏ID、用户名或方言语境里看到它，它可能是把 **ponder**（沉思）加上类似“小称/指人”的后缀 **-ling** 来造出的词，语气上有时会带一点俏皮或文学感。","如果你愿意，告诉我你看到“ponderling”的原句/截图，我可以帮你判断它在该语境里更接近“pondering（思索）”“a ponderer（思考者）”还是另有特殊含义。"]}
{"word":"ponderment","summary":{"en":"“Ponderment” means deep thought, but it’s a rare/nonstandard word; “pondering” or “contemplation” is more natural.","zh":"“ponderment”意为“深思”，但非常罕见且非标准；更自然的说法是“pondering”或“contemplation”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) deep thought; the act or state of pondering something carefully.","zh":"（罕见、非标准用法）深思；仔细思考某事的行为或状态。"},"examples":[{"en":"After a moment of ponderment, she chose to apologize first.","zh":"深思片刻后，她决定先道歉。"},{"en":"His quiet ponderment made everyone wait before speaking again.","zh":"他沉默地深思，让大家都等了一会儿才再开口。"}]}],"synonyms":["pondering","contemplation","reflection","thoughtfulness","deliberation"],"phonetic":"/ˈpɑndɚmənt/","extraExplanation":["“ponderment”在现代英语里非常少见，很多词典不收录，写作中可能会显得不自然或被认为是误用。更常见、更地道的表达是“pondering”（思考的过程）或“contemplation”（沉思、冥想式的思索）。","词形上看，它像由“ponder（仔细思考）+ -ment（名词后缀）”构成，逻辑上能理解，但实际使用频率远低于常见替代词。"]}
{"word":"ponderomotive","summary":{"en":"A physics adjective describing forces/effects that push charged particles due to changing electromagnetic fields (common in plasma and laser contexts).","zh":"物理学形容词，指变化电磁场导致的对带电粒子的推挤作用（常见于等离子体与强激光语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physics) Relating to a force that pushes charged particles (like electrons or ions) because of a varying electromagnetic field, often in plasmas or strong laser fields.","zh":"（物理）指由于变化的电磁场而产生、会推动带电粒子（如电子或离子）的“有质动力/庞德罗莫特力”相关的。"},"examples":[{"en":"The ponderomotive force can push electrons away from regions of high laser intensity.","zh":"庞德罗莫特力会把电子从激光强度高的区域推开。"},{"en":"Researchers modeled ponderomotive effects in a plasma created by an ultra-intense laser pulse.","zh":"研究人员对超强激光脉冲产生的等离子体中的庞德罗莫特效应进行了建模。"}]}],"synonyms":["ponderomotive-force-related","field-driven"],"phonetic":"/ˌpɑːn.də.roʊˈmoʊ.tɪv/","extraExplanation":["这个词在日常英语中很少单独使用，最常见搭配是 **ponderomotive force**（庞德罗莫特力/有质动力）和 **ponderomotive potential**（庞德罗莫特势）。","词源上可理解为“与推动（动量/运动）有关的力”：来自拉丁语词根 *ponder-*（重量）+ *motive*（推动的）。在现代物理语境里，它特指电磁场对带电粒子的平均“推开/驱赶”作用，而不是一般意义的“推动”。"]}
{"word":"ponderosa","summary":{"en":"Ponderosa most commonly refers to the ponderosa pine, a large pine tree in western North America; it can also describe things related to that tree or be used as a place/business name.","zh":"Ponderosa 最常指黄松（庞德罗萨松），一种分布于北美西部的大型松树；也可作形容词表示“与黄松有关”，或作为地名/商号等专名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large North American pine tree (Pinus ponderosa), common in the western U.S. and Canada, known for its tall trunk and thick, orange-brown bark","zh":"黄松（又称庞德罗萨松；学名 Pinus ponderosa），一种北美大型松树，常见于美国西部和加拿大，以高大的树干和厚实的橙褐色树皮著称"},"examples":[{"en":"Ponderosa pines can live for hundreds of years in dry, sunny forests.","zh":"黄松在干燥、阳光充足的森林里可存活数百年。"},{"en":"The trail climbed through a grove of ponderosa pine.","zh":"小路向上穿过一片黄松林。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or made from the ponderosa pine tree","zh":"与黄松有关的；由黄松制成的"},"examples":[{"en":"The cabin used ponderosa pine boards for the floor.","zh":"小木屋的地板用了黄松木板。"},{"en":"We camped in a ponderosa pine forest.","zh":"我们在黄松林里露营。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name used for places, businesses, or ranches in the U.S. (often suggesting a Western or pine-forest image)","zh":"（美国常见）用作地名、商号或牧场名的专有名词，常带有“西部风情/松林景象”的联想"},"examples":[{"en":"They stopped for lunch at a diner called Ponderosa.","zh":"他们在一家叫“Ponderosa”的小餐馆停下来吃午饭。"},{"en":"Ponderosa is a common name for neighborhoods near pine forests.","zh":"靠近松林的社区常会取名叫 Ponderosa。"}]}],"synonyms":["ponderosa pine","Pinus ponderosa","western yellow pine"],"phonetic":"/ˌpɑn.dəˈroʊ.sə/","extraExplanation":["“ponderosa”来自西班牙语 ponderoso，意为“沉重的、庞大的、强壮的”。因此它常被用来给体型高大、树干粗壮的松树命名（ponderosa pine）。","在文学与美国文化语境中，“Ponderosa”常让人联想到美国西部的自然景观与牛仔/牧场意象；例如流行文化里曾有以“Ponderosa”命名的牧场与相关作品标题。"]}
{"word":"ponderosae","summary":{"en":"*ponderosae* is a taxonomic Latin form meaning “of/related to ponderosa,” seen in scientific names, especially in botany.","zh":"*ponderosae* 是分类学拉丁语词形，表示“属于/与 *ponderosa* 有关”，常见于科学命名（尤其植物学）中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Scientific/Taxonomic Latin) A Latin form meaning “of/related to *ponderosa*,” used in biological names (especially botany), often referring to the ponderosa pine (*Pinus ponderosa*) or a group associated with it.","zh":"（科学/分类学拉丁语）拉丁语形式，表示“属于/与 *ponderosa*（常指黄松、庞德罗莎松）有关”，常见于生物学命名（尤其植物学）中。"},"examples":[{"en":"The specimen was labeled with a name ending in *ponderosae*, indicating a taxonomic connection to *Pinus ponderosa*.","zh":"标本标签上的名称以 *ponderosae* 结尾，表示它在分类上与 *Pinus ponderosa*（黄松）有关。"},{"en":"In older botanical writing, you may see *ponderosae* used in Latinized descriptions or headings.","zh":"在较早的植物学著作中，你可能会看到 *ponderosae* 出现在拉丁化的描述或标题里。"}]}],"synonyms":["taxonomic Latin","botanical Latin","(related term) *Pinus ponderosa*","(related term) ponderosa pine"],"phonetic":"/ˌpɑndəˈroʊsi/","extraExplanation":["*ponderosae* 不是现代英语里的常用词，而多是“拉丁语词形”。在分类学命名中，*-ae* 常见于拉丁语变格：\n- 作为**属格单数**时，可理解为“……的”（例如“*ponderosa* 的/与 *ponderosa* 有关的”）。\n- 在某些分类层级或标题里，也可能出现作**复数形式**来指代一个群（具体要看上下文与原文作者的用法）。","在英语语境里读音常被英语化；不同学科/老师可能会把词尾 *-ae* 读成 /i/（类似“ee”）或 /eɪ/（类似“ay”）。如果你能提供它出现的完整学名或句子，我可以更准确判断它在该处的语法功能与含义。"]}
{"word":"ponderosapine","summary":{"en":"Ponderosa pine is a large pine tree native to western North America.","zh":"Ponderosa pine 指原产于北美西部的高大黄松。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large North American pine tree (Pinus ponderosa) common in the western United States and Canada, known for its tall straight trunk, thick orange-brown bark, and long needles","zh":"黄松（学名 Pinus ponderosa），一种北美大型松树，主要分布于美国西部和加拿大，以高大笔直的树干、厚厚的橙褐色树皮和较长的针叶著称"},"examples":[{"en":"Ponderosa pine forests cover many dry mountain slopes in the American West.","zh":"在美国西部，黄松林覆盖了许多干燥的山地坡面。"},{"en":"The park trail winds through tall ponderosa pines with cinnamon-colored bark.","zh":"公园小径蜿蜒穿过高大的黄松，树皮呈肉桂色。"},{"en":"Ponderosa pine needles often grow in bundles of three.","zh":"黄松的针叶常常三根一束地生长。"}]}],"synonyms":["yellow pine","western yellow pine"],"phonetic":"/ˌpɑːn.dəˈroʊ.sə paɪn/","extraExplanation":["“Ponderosa”源自西班牙语，含义接近“厚重的、庞大的”。因此这个树名带有“高大粗壮的松树”的感觉。","在北美文化与自然写作中，ponderosa pine 常被用来呈现“美国西部”的景象（干燥的松林、山地、开阔的空气）。","常见搭配：ponderosa pine forest（黄松林）、ponderosa pine cone（黄松球果）、ponderosa pine bark（黄松树皮）。"]}
{"word":"ponderosity","summary":{"en":"Ponderosity means heaviness or a slow, awkward, overly serious style.","zh":"ponderosity 指“沉重/笨重”，也可指“风格或态度过分严肃、显得沉闷笨拙”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often humorous or critical) the quality of being heavy, bulky, or slow and awkward in movement or style.","zh":"（常带幽默或批评）沉重、笨重；行动或风格上的迟缓、笨拙。"},"examples":[{"en":"The old suitcase was famous for its ponderosity—it took two people to lift it.","zh":"那个旧行李箱以“笨重”出名——要两个人才能抬起来。"},{"en":"Some readers enjoy the novel’s grandeur, while others complain about its ponderosity.","zh":"有些读者喜欢这部小说的宏大气势，但也有人抱怨它文风沉闷拖沓。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of seeming very serious and important, sometimes in an overly formal or self-important way.","zh":"（有时带贬义）一本正经、故作庄重；显得很重要（但可能过于正式或自以为是）。"},"examples":[{"en":"He spoke with such ponderosity that even simple jokes sounded like official announcements.","zh":"他说话一本正经，连简单的玩笑都像正式公告。"},{"en":"She tried to avoid ponderosity by using clear, simple language.","zh":"她尽量用清晰朴素的语言来避免故作庄重。"}]}],"synonyms":["heaviness","weight","bulk","ponderousness","gravity"],"phonetic":"/ˌpɑn.dəˈrɑ.sə.ti/","extraExplanation":["词源提示：ponderosity 来自拉丁语 ponderosus（“沉重的”），与 ponder（“仔细思考/掂量”）同源，核心意象是“重量”。因此它既可以指“物理上的重”，也常引申到“文风/态度上的沉重、过分严肃”。","使用场景：它在日常口语中不算常见，更常见于较正式的评论（例如文学评论、写作风格评价）或带一点讽刺意味的表达。","相关词对比：heavy（常用、可指重量或情绪“沉重”）；weighty（更偏“重要、有分量”）；pompous（更偏“自大、装腔作势”）；verbosity（“啰嗦”）——有时文章让人觉得“ponderous”，也可能同时“verbose”。"]}
{"word":"ponderous","summary":{"en":"Ponderous means heavy and slow or awkward, and it can also describe writing or speech that feels overly serious and dull.","zh":"Ponderous表示“沉重笨拙、缓慢”，也可形容文风或表达“过于严肃冗长、沉闷”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slow and heavy in movement or action; awkward because of weight or seriousness.","zh":"（动作/行动）缓慢而沉重的；因笨重或过于严肃而显得不灵活的。"},"examples":[{"en":"The old truck made a ponderous turn into the narrow street.","zh":"那辆旧卡车笨重地拐进了狭窄的街道。"},{"en":"He climbed the stairs with ponderous steps, carrying two heavy bags.","zh":"他提着两大袋东西，迈着沉重缓慢的步子上楼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Too serious, long, or dull in style (especially writing or speech); not lively or engaging.","zh":"（文风/讲话等）过于严肃、冗长或沉闷的；不够生动有趣的。"},"examples":[{"en":"The lecture was informative, but the delivery was ponderous.","zh":"讲座内容很有信息量，但讲得很沉闷。"},{"en":"She rewrote the essay to remove the ponderous introductions.","zh":"她重写了文章，删掉那些冗长沉闷的开头。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very large, massive, or heavy.","zh":"庞大而沉重的；巨大的。"},"examples":[{"en":"They moved the ponderous stone with rollers and ropes.","zh":"他们用滚木和绳索搬动那块巨石。"}]}],"synonyms":["heavy","weighty","cumbersome","clumsy","slow-moving","plodding","labored"],"phonetic":"/ˈpɑndərəs/","extraExplanation":["“ponderous”来自拉丁语词根 pondus（重量），所以核心感觉是“有重量感→显得慢、笨重”，也常引申到语言风格上“沉重、拗口、不轻快”。","近义词里：heavy/weighty更中性（重/重要）；clumsy强调笨拙；plodding强调慢吞吞；bombastic更偏“浮夸夸张”，不等于ponderous。"]}
{"word":"ponderously","summary":{"en":"“Ponderously” means in a slow, heavy, overly serious way.","zh":"“ponderously”表示“缓慢沉重、过分严肃（常显得拖沓沉闷）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, heavy, and serious way (often so that it feels dull or overly formal).","zh":"以缓慢、沉重而严肃的方式（常给人沉闷或过分郑重的感觉）。"},"examples":[{"en":"He walked ponderously up the stairs, carrying two heavy boxes.","zh":"他提着两个沉重的箱子，沉重缓慢地走上楼梯。"},{"en":"The meeting moved ponderously from one topic to the next.","zh":"会议沉闷而缓慢地从一个话题推进到下一个。"},{"en":"She spoke ponderously, as if every sentence were a formal announcement.","zh":"她说话郑重而拖沓，仿佛每一句都是正式公告。"}]}],"synonyms":["heavily","slowly","laboriously","solemnly","ploddingly"],"phonetic":"/ˈpɑːn.dɚ.əs.li/","extraExplanation":["“ponderously”来自形容词“ponderous”（沉重的；笨重的；冗长乏味的），与动词“ponder”（仔细思考）同源，核心感觉是“重量感/负担感”。因此它既可描述动作很“笨重缓慢”，也可形容风格“过分严肃、显得拖沓”。","文学或叙述中常用来营造节奏：写角色移动时突出“吃力、沉重”；写语言/文章时暗示“冗长、一本正经到让人不耐”。"]}
{"word":"ponderousness","summary":{"en":"Ponderousness means a heavy, slow, or overly serious quality, in movement or in speaking/writing style.","zh":"Ponderousness 指沉重迟缓或过分严肃的特质，可形容动作，也常批评言语/文风拖沓乏味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being heavy, slow, and clumsy in movement, speech, or style.","zh":"（动作、言语或文风）沉重迟缓、笨拙的特质。"},"examples":[{"en":"After the long hike, he walked with a noticeable ponderousness.","zh":"长途徒步后，他走路明显变得沉重迟缓。"},{"en":"Some readers find the novel’s early chapters full of ponderousness and too many details.","zh":"有些读者觉得这部小说前几章过于沉闷拖沓、细节太多。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being overly serious, formal, or dull in tone (often used critically).","zh":"（常含批评）过分严肃、一本正经或乏味的腔调。"},"examples":[{"en":"The speech had an air of ponderousness that made it hard to stay focused.","zh":"这场演讲有种过分严肃的腔调，让人很难集中注意力。"},{"en":"She tried to lighten the meeting to avoid unnecessary ponderousness.","zh":"她试着让会议轻松一点，避免不必要的沉闷和拘谨。"}]}],"synonyms":["heaviness","clumsiness","slowness","dullness","solemnity"],"phonetic":"/ˈpɑn.dɚ.əs.nəs/","extraExplanation":["“ponderousness”来自形容词“ponderous”（沉重的；笨重的；冗长乏味的），常见于写作或评论，用来批评文风“太重、太慢、太严肃”。","常见搭配：the ponderousness of the prose（文笔的冗重）、an air of ponderousness（一本正经的气氛）。","近义词对比：heaviness偏“重量/沉重感”；clumsiness偏“笨拙”；verbosity偏“啰嗦”；pompousness偏“自大摆架子”。“ponderousness”更强调“沉重+拖沓/乏味”。"]}
{"word":"ponders","summary":{"en":"“Ponders” means “thinks about something carefully and deeply.”","zh":"“ponders”表示“认真而深入地思考/仔细考虑”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to think about something carefully for a period of time; to consider it deeply","zh":"长时间认真思考；深思；仔细考虑"},"examples":[{"en":"She ponders whether to change jobs.","zh":"她在认真考虑是否要换工作。"},{"en":"He ponders the meaning of the poem before class.","zh":"他在课前琢磨那首诗的含义。"},{"en":"The team ponders several options before making a decision.","zh":"团队在做决定前仔细权衡了几个方案。"}]}],"synonyms":["considers","contemplates","reflects (on)","mulls over"],"phonetic":"/ˈpɑndərz/","extraExplanation":["“ponders”是动词“ponder”的第三人称单数现在时（he/she/it ponders）。也可以用于一般现在时描述习惯或常态（e.g., He often ponders big questions）。","语气上，“ponder”比“think”更正式、更慢、更有“反复权衡/深度思索”的感觉；常和whether、how、what等疑问词或“the meaning/idea/question”等抽象名词搭配。"]}
{"word":"pondez","summary":{"en":"“pondez” is likely French (from “répondez”): “answer/respond.” The closest English word is “respond.”","zh":"“pondez” 很可能是法语（来自“répondez”）：意为“回答/回复”。最接近的英语是 “respond”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“pondez” is not an English word. It is most likely part of the French command “répondez,” meaning “answer” or “respond” (used for “you” plural or formal “you”).","zh":"“pondez” 不是英语单词。它很可能是法语命令式“répondez”的一部分，意思是“回答 / 回复”（用于复数的“你们”或正式的“您”）。"},"examples":[{"en":"French: Répondez, s’il vous plaît. / English: Please answer.","zh":"法语：Répondez, s’il vous plaît. / 英语：请回答。"},{"en":"French: Répondez aux questions. / English: Answer the questions.","zh":"法语：Répondez aux questions. / 英语：回答这些问题。"}]},{"partOfSpeech":"v.","definition":{"en":"Closest common English equivalent: “respond” (to reply to someone).","zh":"最接近的常用英语对应词：respond（回应、回复）。"},"examples":[{"en":"He didn’t respond to my email.","zh":"他没有回复我的邮件。"},{"en":"Please respond quickly.","zh":"请尽快回复。"}]}],"synonyms":["reply","answer"],"phonetic":"/rɪˈspɑnd/","extraExplanation":["在法语里，“répondez”来自动词“répondre（回答）”，这是命令式（impératif）用法：对“vous”（你们/您）说“请回答”。如果你是想输入英语“respond”，拼写应为 respond。"]}
{"word":"pondfish","summary":{"en":"A pondfish is a fish that lives in a pond, often one kept for decoration or small-scale farming.","zh":"pondfish 指生活在池塘里的鱼，常指用于观赏或小规模养殖的鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish that lives in a pond, especially one kept in a garden pond or fish pond (often for decoration or small-scale farming)","zh":"池塘鱼；生活在池塘里的鱼（常指庭院观赏池或养殖池里饲养的鱼）"},"examples":[{"en":"Goldfish are common pondfish in backyard ponds.","zh":"金鱼是后院池塘里很常见的池塘鱼。"},{"en":"The farmer raised pondfish for local markets.","zh":"农民养殖池塘鱼供应本地市场。"}]}],"synonyms":["pond fish","fish in a pond","pond-raised fish"],"phonetic":"/ˈpɑndˌfɪʃ/","extraExplanation":["“pondfish”更常见的写法是分开写作“pond fish”，意思不变。","在北美语境里，这个词常让人联想到庭院观赏鱼（如koi锦鲤、goldfish金鱼）或小规模淡水养殖。正式写作中也可用更具体的说法：“fish in a pond / pond-raised fish”。"]}
{"word":"pondfishes","summary":{"en":"“Pondfishes” means small fish living in ponds or still freshwater.","zh":"“pondfishes”指生活在池塘或静水淡水中的小鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small fish that live in ponds or other still freshwater (plural of “pondfish”; often used generally rather than for one specific species).","zh":"生活在池塘或其他静止淡水中的小鱼（“pondfish”的复数；常作泛指，不一定是特定物种）。"},"examples":[{"en":"The children watched pondfishes dart between the water plants.","zh":"孩子们看着池塘里的小鱼在水草间快速穿梭。"},{"en":"In summer, pondfishes gather near the shallow edges where the water is warmer.","zh":"夏天，小鱼常聚集在较浅的池边，因为那里的水更温暖。"}]}],"synonyms":["small freshwater fish","minnows","killifish"],"phonetic":"/ˈpɑndˌfɪʃɪz/","extraExplanation":["“pondfishes”是复合词 pond + fishes（fishes 强调“不同种类的鱼”或“许多鱼”，而 fish 也常作复数用）。在日常写作中，它多半是泛指池塘里的小鱼；在生物学语境里，可能也会被用作某些“pondfish/killifish（鳉鱼类）”相关物种的统称，具体要看上下文。"]}
{"word":"pondful","summary":{"en":"“Pondful” means a pond-sized amount—how much a pond can hold.","zh":"“pondful”指“一池塘的量”，也就是池塘能容纳的液体数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount of water (or other liquid) that a pond can hold; a pond-sized quantity","zh":"（池塘能容纳的）一池塘的量；池塘大小的一份液体"},"examples":[{"en":"After the storm, it felt like a whole pondful of water had collected in the backyard.","zh":"暴风雨后，后院里好像积了一整池塘的水。"},{"en":"The pump can move a pondful of water in a few hours.","zh":"这台水泵几小时就能抽走一池塘的水。"}]}],"synonyms":["a pond’s worth","a lot (of water)","a large quantity"],"phonetic":"/ˈpɑndˌfʊl/","extraExplanation":["“pondful”由 pond（池塘）+ -ful（表示“……的量”）构成，类似的词有 “cupful（一杯的量）”“handful（一把的量）”。","这个词在日常英语里不算常见，更常见的表达是 “a pond’s worth of water”（相当于一个池塘那么多的水）或更笼统的 “a lot of water”（很多水）。"]}
{"word":"pondgrass","summary":{"en":"A common name for grass-like aquatic plants growing in ponds or still water.","zh":"池塘中生长的“像草的”水生植物的俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a grass-like aquatic plant that grows in ponds or slow-moving water; often used as a common (non-scientific) name for certain pond plants such as pondweeds.","zh":"池塘草；生长在池塘或缓流水域里的“像草的”水生植物（多为俗称，常泛指某些池塘水草/眼子菜等）。"},"examples":[{"en":"Pondgrass provides shelter for small fish and insects.","zh":"池塘草为小鱼和昆虫提供庇护。"},{"en":"The pond is full of pondgrass in summer.","zh":"夏天池塘里长满了池塘草。"},{"en":"We removed some pondgrass to keep the water from getting too crowded.","zh":"我们清理了一些池塘草，避免水面过于拥挤。"}]}],"synonyms":["pondweed","aquatic grass","water grass"],"phonetic":"/ˈpɑndˌɡræs/","extraExplanation":["“pondgrass”更像是日常用语里的泛称，而不是非常固定的植物学名称；不同地区可能用它指不同的水生植物。","书写上也常见作“pond grass”（分开写）。如果你需要精确识别植物种类，最好结合图片、叶形或当地常用名/学名。"]}
{"word":"ponding","summary":{"en":"Ponding means water collecting and staying in one place because it can’t drain well.","zh":"Ponding 指因排水不畅而在某处聚集并滞留的积水/滞水现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the buildup or standing of water in a low area because it cannot drain away (often used in engineering, drainage, or roofing contexts)","zh":"（因排水不良而产生的）积水、滞水（常用于工程排水、道路或屋面等语境）"},"examples":[{"en":"After the heavy rain, ponding formed along the curb where the drain was blocked.","zh":"大雨之后，排水口被堵住，路缘旁出现了积水。"},{"en":"The inspector noted ponding on the flat roof near the HVAC unit.","zh":"检查员指出在空调机组附近的平屋顶上有滞水。"}]},{"partOfSpeech":"vi.","definition":{"en":"the act or process of water collecting and forming a pond-like area; water is pooling","zh":"（水）汇集并形成类似小池的过程；正在积成一片水"},"examples":[{"en":"Water was ponding in the parking lot because the surface slopes the wrong way.","zh":"由于地面坡度方向不对，停车场里的水在不断积起来。"},{"en":"If water keeps ponding, the soil may become too saturated for the plants.","zh":"如果一直积水，土壤可能会过于饱和，不利于植物生长。"}]}],"synonyms":["pooling","standing water","water accumulation"],"phonetic":"/ˈpɑndɪŋ/","extraExplanation":["“ponding”在日常口语里不算常见，更常见于土木/建筑/屋面防水等专业语境。平屋顶上的“roof ponding（屋面积水）”尤其重要：长期滞水可能导致渗漏、材料老化，甚至在极端情况下增加结构荷载风险。"]}
{"word":"pondlet","summary":{"en":"A pondlet is a very small pond or pool of still water.","zh":"pondlet 指很小的池塘或静水小水洼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small pond; a little pool of still water","zh":"小池塘；小水洼（静水）"},"examples":[{"en":"After the rain, a pondlet formed in the low part of the field.","zh":"下雨后，田地低洼处形成了一个小水洼。"},{"en":"Frogs gathered around a pondlet behind the barn.","zh":"青蛙聚集在谷仓后面的小池塘周围。"}]}],"synonyms":["small pond","little pond","pool","puddle (usually shallower and temporary)"],"phonetic":"/ˈpɑnd.lət/","extraExplanation":["“pondlet”不是常用词，更常见的说法是“small pond / little pond / pool”。它由“pond（池塘）+ -let（表示‘小’的后缀）”构成，和“streamlet（小溪）”“leaflet（小叶；小册子）”里的 -let 用法类似。","在写作中用“pondlet”会带一点文学/描写性的感觉，强调“又小又静”的水面。"]}
{"word":"pondlike","summary":{"en":"Pondlike means “resembling a pond,” especially calm, still, and enclosed water.","zh":"pondlike 指“像池塘的”，尤指水面平静、静止、较封闭的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a pond; having the look, feel, or characteristics of a pond (still water, small and enclosed, often calm).","zh":"像池塘的；具有池塘特征的（静止、小而封闭、常很平静）。"},"examples":[{"en":"Behind the house was a pondlike pool with still, dark water.","zh":"房子后面有一个像池塘一样的水池，水面静止而深暗。"},{"en":"The park’s pondlike lake stayed calm even when the wind picked up.","zh":"即使起风，公园里那片“像池塘一样的湖面”仍然很平静。"},{"en":"After the rain, the street became pondlike in low areas where water collected.","zh":"下雨后，路面低洼处积水，变得像一个个小池塘。"}]}],"synonyms":["pond-like","pondy (informal/rare)","still","placid","stagnant (when emphasizing unmoving/unclean water)"],"phonetic":"/ˈpɑndˌlaɪk/","extraExplanation":["“pondlike”由名词“pond（池塘）”+ 后缀“-like（像……一样）”构成，常用于描写外观或氛围（如“平静、停滞、狭小封闭”）。写作中可用来营造安静或略显阴暗的画面感。"]}
{"word":"pondman","summary":{"en":"A pondman is a worker who looks after a pond, especially a log pond at a sawmill.","zh":"pondman 指看管池塘的工人，尤指锯木厂贮木池里负责管理原木的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a worker who manages or works at a pond—especially an industrial log pond where logs are stored, sorted, or moved before processing (e.g., at a sawmill).","zh":"池塘工；（尤指锯木厂等的）贮木池工人：负责在贮木池中存放、分拣或搬运原木的人。"},"examples":[{"en":"The pondman used a pike pole to guide the logs toward the mill.","zh":"贮木池工人用撑杆把原木引导到锯木厂那边。"},{"en":"After the storm, the pondman checked the boom to make sure the logs wouldn’t drift away.","zh":"暴风雨过后，贮木池工人检查了拦木浮栏，确保原木不会漂走。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, a person employed to look after a pond (for example, a fish pond).","zh":"（较广义）看管池塘的人（例如管理鱼塘的人）。"},"examples":[{"en":"The pondman fed the fish at dawn every day.","zh":"看塘人每天黎明时喂鱼。"}]}],"synonyms":["log-pond worker","pond worker","caretaker","attendant"],"phonetic":"/ˈpɑːndmən/","extraExplanation":["“pondman”在现代日常英语里不常见，更常出现在林业、木材加工等行业语境中（如 log pond：贮木池）。在普通对话里，人们往往会改用更直白的说法，例如 “a worker at the log pond / someone who manages the pond”。"]}
{"word":"pondo","summary":{"en":"Pondo refers to the amaPondo people of South Africa, or to things related to their culture and language.","zh":"Pondo 指南非的庞多族（amaPondo）人，也可指与其文化或语言相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Pondo (amaPondo) people, a Nguni ethnic group mainly in South Africa.","zh":"庞多族（amaPondo）人；主要分布在南非的一支恩古尼（Nguni）族群。"},"examples":[{"en":"She is Pondo, and her family is from the Eastern Cape.","zh":"她是庞多族人，家人来自东开普省。"},{"en":"The museum has an exhibit on Pondo history and traditions.","zh":"博物馆有一个关于庞多族历史与传统的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Pondo people, their culture, or their language variety.","zh":"与庞多族、其文化或其语言变体有关的。"},"examples":[{"en":"They performed a Pondo dance at the cultural festival.","zh":"他们在文化节上表演了庞多族舞蹈。"},{"en":"He is researching Pondo oral storytelling.","zh":"他正在研究庞多族的口述叙事传统。"}]}],"synonyms":["amaPondo","Pondo people","Mpondo"],"phonetic":"/ˈpɑn.doʊ/","extraExplanation":["在英语中这个词通常写作 **Pondo**（首字母大写），因为它多指族群/文化名称。也常见自称或学术写法 **amaPondo**（复数，“庞多人们”）与 **Mpondo**（与族名相关的另一种拼写/形式）。"]}
{"word":"pondok","summary":{"en":"Pondok means a small hut/cabin, and in Indonesia it can also refer to an Islamic boarding school (or its dormitory).","zh":"Pondok 指小屋/棚屋；在印尼语境中也可指伊斯兰寄宿学校（或其宿舍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple hut or cabin (an Indonesian/Malay word, often used in English when talking about local housing).","zh":"（印尼语/马来语）小屋、棚屋；简陋的住处（英语中多用于描述当地住房时借用）。"},"examples":[{"en":"We stayed in a pondok near the rice fields.","zh":"我们住在稻田旁的一间小棚屋里。"},{"en":"The beach resort offers private pondoks for guests.","zh":"那家海滩度假村为客人提供独立的小屋。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some Indonesian contexts) an Islamic boarding school or its dormitory/residence (short for “pondok pesantren”).","zh":"（在印尼一些语境中）伊斯兰寄宿学校或其宿舍/住处（“pondok pesantren”的简称）。"},"examples":[{"en":"He studied at a pondok in East Java.","zh":"他在东爪哇的一所伊斯兰寄宿学校读书。"},{"en":"Life in the pondok is simple and disciplined.","zh":"寄宿学校（宿舍）里的生活朴素而有纪律。"}]}],"synonyms":["hut","cabin","shack","bungalow","boarding school (context-specific)"],"phonetic":"/ˈpɔn.dɔk/","extraExplanation":["“Pondok”常见于印尼/马来西亚相关旅游、文化与宗教语境。在英文资料里，它通常作为外来词保留原称呼。","在印尼，“pondok pesantren”指伊斯兰寄宿学校；口语里常直接说“pondok”。去不同地区时，具体含义可能偏向“小屋”或“寄宿学校”，可根据上下文判断。"]}
{"word":"pondokkie","summary":{"en":"“Pondokkie” means a small, simple hut or shack in South African English.","zh":"“pondokkie”在南非英语中指小而简陋的茅屋/棚屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, informal) a small, simple hut or shack; a tiny “pondok.”","zh":"（南非英语，非正式）小茅屋；简陋的小棚屋；“pondok（小屋）”的指小/昵称形式。"},"examples":[{"en":"They stayed in a pondokkie near the beach for the weekend.","zh":"他们周末住在海边的一间小棚屋里。"},{"en":"The caretaker lives in a pondokkie behind the main house.","zh":"看护人住在主屋后面的一间小茅屋里。"}]}],"synonyms":["pondok","shack","hut"],"phonetic":"/pɑnˈdɑki/","extraExplanation":["“pondokkie”主要见于南非语境（尤其受南非荷兰语 Afrikaans 影响）。它来自“pondok”（小屋/棚屋）加上 Afrikaans 常见的指小后缀“-kie”，语气通常表示“小、简陋、亲切或随口一说”。","在不同语境里它可以是中性描述（简易小屋），也可能暗示贫困或居住条件差。谈到他人居住环境时，语气要谨慎，避免带有贬低意味。","相关词：pondok（更一般的“小屋/棚屋”）、shack（棚屋/简易房）、hut（小屋/茅屋）。"]}
{"word":"pondomisi","summary":{"en":"“pondomisi” is not recognized as a standard English word; it’s probably a misspelling or a proper name.","zh":"“pondomisi”不是标准英语词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a name, or a word from another language (so it has no fixed meaning in English dictionaries).","zh":"不是标准英语词。更可能是拼写错误、人名/地名，或来自其他语言的词（因此在英语词典中没有固定释义）。"},"examples":[{"en":"I couldn’t find “pondomisi” in an English dictionary—do you mean “pandemic” or “condominium”?","zh":"我在英语词典里找不到“pondomisi”——你是不是想写“pandemic（大流行病）”或“condominium（公寓/公寓楼）”？ "},{"en":"If “Pondomisi” is a person or place name, please share a sentence so I can help explain it.","zh":"如果“Pondomisi”是人名或地名，请给我一个包含它的句子，我就能更准确地解释。"}]}],"phonetic":"/pɑn.doʊˈmi.si/","extraExplanation":["“pondomisi”看起来不像常见英语单词，可能是把某个词拼错了。你可以告诉我：\n1）你在哪看到的（文章/歌曲/游戏/聊天）？\n2）原句是什么？\n3）你想表达的中文意思？\n我就能帮你定位最可能的正确单词并讲清用法。"]}
{"word":"ponds","summary":{"en":"“Ponds” usually means multiple small still-water bodies (plural of pond); more rarely it can be a verb meaning water collects into ponds.","zh":"“ponds”通常指多个“池塘/小水塘”（pond 的复数）；较少情况下也可作动词，表示水积成一片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small bodies of still water, smaller than lakes (plural of “pond”).","zh":"池塘；小湖（“pond”的复数），指比湖更小、通常水面较平静的水域。"},"examples":[{"en":"There are several ponds in the park where ducks gather.","zh":"公园里有好几个池塘，鸭子常常聚在那儿。"},{"en":"After the rain, small ponds formed in the low areas of the field.","zh":"下雨后，田地低洼处形成了一些小水塘。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Forms into ponds or causes water to collect into ponds; third-person singular of “pond.”","zh":"（较少用）形成池塘/积水成塘；或使水聚成塘（“pond”的第三人称单数）。"},"examples":[{"en":"Water ponds on the road after heavy storms.","zh":"暴风雨过后，路面会积水成一片。"},{"en":"Poor drainage ponds rainwater near the entrance.","zh":"排水不良会让入口附近积起雨水。"}]}],"synonyms":["pools","small lakes","waterholes","puddles (for very small, shallow water on the ground)"],"phonetic":"/pɑnd/","extraExplanation":["“ponds”最常见是名词复数，表示多个“池塘”。口语里谈“路面/地面有积水”更常用动词/短语：water pools / puddles form / there is standing water；“water ponds”也能用，但相对不那么常见。","pond vs. lake：没有绝对统一的尺寸标准，但一般来说 pond 更小、更浅；lake 更大、更深。有些地区会按生态特征（是否能长满水草、是否有温度分层等）来区分。"]}
{"word":"pondside","summary":{"en":"“Pondside” means “beside a pond,” used mainly as an adjective and sometimes as a noun for the area next to a pond.","zh":"“pondside”指“池塘边的/在池塘旁”，多作形容词，也可作名词表示“池塘边的地方”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located beside a pond; relating to the area next to a pond.","zh":"池塘边的；与池塘旁区域有关的。"},"examples":[{"en":"We had a picnic in the pondside grass.","zh":"我们在池塘边的草地上野餐。"},{"en":"Pondside plants attract frogs and dragonflies.","zh":"池塘边的植物会吸引青蛙和蜻蜓。"}]},{"partOfSpeech":"n.","definition":{"en":"The area or place next to a pond.","zh":"池塘边；池塘旁的地方。"},"examples":[{"en":"They walked along the pondside at sunset.","zh":"他们在日落时沿着池塘边散步。"}]}],"synonyms":["by the pond","pond-side","lakeside (similar idea)","waterside (broader)"],"phonetic":"/ˈpɑndˌsaɪd/","extraExplanation":["“pondside”是由 pond（池塘）+ side（边）组合而成的复合词，常见于自然写作、园艺、房地产描述等语境。","英语里也常用类似结构：lakeside（湖边的/湖畔）, riverside（河边的/河畔）, seaside（海边的/海滨）。","在文学或描写性文字中，pondside 常带有安静、乡野、亲近自然的画面感。"]}
{"word":"pondus","summary":{"en":"Pondus is a rare Latin loanword meaning “weight” or “burden,” sometimes used in older scientific writing for “weight as a force.”","zh":"Pondus 是较少见的拉丁语借词，意为“重量”或“负担”；在较早的科学写作中也可指“作为力的重量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin loanword, rare in modern English) weight; a heavy load; a burden.","zh":"（拉丁语借词，现代英语中较少见）重量；重负；负担。"},"examples":[{"en":"The writer used the Latin word pondus to suggest the emotional weight of grief.","zh":"作者用拉丁词 pondus 来暗示悲伤带来的情感重量。"},{"en":"She spoke of the pondus of responsibility that came with leadership.","zh":"她谈到领导职责所带来的沉重负担。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scientific/technical, rare) weight as a physical force, especially in older texts influenced by Latin.","zh":"（科学/技术用语，较少见）作为物理力的“重量”（尤见于受拉丁语影响的旧文献）。"},"examples":[{"en":"In older notes, pondus is contrasted with mass, emphasizing the force due to gravity.","zh":"在较早的笔记中，pondus 常与 mass（质量）对比，强调由重力产生的力。"},{"en":"The diagram labels the downward pondus acting on the object.","zh":"图示标注了物体所受向下的重量（pondus）。"}]}],"synonyms":["weight","burden","load","heaviness"],"phonetic":"/ˈpɑndəs/","extraExplanation":["pondus 源自拉丁语，基本义是“重量、重物、负担”。它不是现代英语里的常用词，更常出现在学术写作、古典学、或模仿拉丁文风的修辞中。","在日常英语里，通常用 weight（重量）或 burden（负担）来表达同样意思；用 pondus 会带有“古典/庄重/学术化”的语气。"]}
{"word":"pondville","summary":{"en":"Pondville is mainly used as a place name (real or fictional), meaning a town/village associated with a pond.","zh":"Pondville主要作为地名（真实或虚构）使用，含义大致是“与池塘相关的小镇/村镇”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), likely referring to a town or neighborhood; not a common standard English vocabulary word.","zh":"地名（专有名词），通常指某个城镇或社区；不是常见的标准英语词汇。"},"examples":[{"en":"I grew up in Pondville, a small town with lots of lakes.","zh":"我在Pondville长大，那是一个有很多湖泊的小镇。"},{"en":"The package was sent to Pondville, Massachusetts.","zh":"包裹寄到了马萨诸塞州的Pondville。"}]},{"partOfSpeech":"other","definition":{"en":"a descriptive, invented name meaning “a village/town near a pond,” often used in fiction or branding.","zh":"一个带描述性的虚构名称，字面意思是“池塘旁的村镇”，常见于小说/影视或品牌命名。"},"examples":[{"en":"In the story, Pondville is the quiet town where the mystery begins.","zh":"在故事里，Pondville是谜团开始的安静小镇。"},{"en":"They named the cafe “Pondville Coffee” to sound cozy and local.","zh":"他们把咖啡馆取名为“Pondville Coffee”，听起来更温馨、更本地化。"}]}],"synonyms":["(as a pattern) -ville place names","town name","village name"],"phonetic":"/ˈpɑndˌvɪl/","extraExplanation":["“Pondville”由 pond（池塘）+ -ville（常见于地名的后缀，表示“城镇/村镇”，源自法语 ville）组成，所以整体给人的感觉是“水边的小镇”。","如果你是在地图、地址或某部作品里看到它，它通常是专有名词：首字母大写（Pondville），一般不加冠词（不说 the Pondville），除非指“Pondville 这个地区/这个地方”作特指。"]}
{"word":"pondweed","summary":{"en":"Pondweed is a common name for aquatic plants that grow in ponds and similar waters.","zh":"Pondweed是对生长在池塘等水域的水生植物（水草）的统称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A water plant that grows in ponds, lakes, or slow-moving rivers, often with long, thin leaves; it commonly forms underwater mats.","zh":"一种生长在池塘、湖泊或缓慢河流中的水生植物，常有细长叶片；常在水下成片生长。"},"examples":[{"en":"The pond was full of pondweed, so the fish had plenty of places to hide.","zh":"池塘里长满了眼子菜等水草，所以鱼有很多地方可以躲藏。"},{"en":"We cleared some pondweed near the dock to make room for swimming.","zh":"我们清理了码头附近的一些水草，好腾出游泳的地方。"}]}],"synonyms":["aquatic plant","waterweed","water plant"],"phonetic":"/ˈpɑndˌwid/","extraExplanation":["“pondweed”通常是统称（common name），并不只指一种植物；最常见的是眼子菜属（Potamogeton）的多种水草。不同地区也可能把伊乐藻等其他沉水植物俗称为pondweed。","在生态上，pondweed既可能是良好的栖息地与食物来源（给鱼、鸭等），也可能在过度繁殖时影响划船、游泳或水体景观；语境里有时会带一点“杂草/水草太多”的意味。"]}
{"word":"pondweeds","summary":{"en":"Pondweeds are common water plants that grow in ponds and similar waters.","zh":"Pondweeds 指常见的池塘等水域中的水生植物（水草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquatic plants that grow in ponds, lakes, and slow-moving water; they often have long stems and narrow leaves and may float or grow underwater.","zh":"生长在池塘、湖泊或缓流水域的水生植物；常有细长的茎和狭长的叶，可能漂浮在水面或生长在水下。"},"examples":[{"en":"The ducks hid among the pondweeds near the shore.","zh":"鸭子躲在岸边的水草（pondweeds）里。"},{"en":"Pondweeds can make the water look green and crowded in summer.","zh":"夏天水草繁茂时，池水看起来会发绿、很拥挤。"},{"en":"The fish lay their eggs on pondweed stems.","zh":"鱼会把卵产在水草的茎上。"}]}],"synonyms":["aquatic plants","water plants","waterweed"],"phonetic":"/ˈpɑndˌwid/","extraExplanation":["“pondweeds”是复数形式；单数是“pondweed”。在自然科普中，“pondweed”也常用来泛指多种常见的沉水或浮叶水生植物（如眼子菜属 Potamogeton），不一定指某一种。"]}
{"word":"pondwort","summary":{"en":"A (somewhat uncommon) word for pond plants, especially pondweed (Potamogeton).","zh":"一个较少见的词，指池塘里的水生植物，尤指眼子菜（pondweed，Potamogeton）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any of several aquatic plants that grow in ponds, especially plants in the arrowhead family (genus Potamogeton), often called pondweed.","zh":"池塘里生长的水生植物的统称，尤指眼子菜属（Potamogeton）的植物，常称为“眼子菜/池塘水草（pondweed）”。"},"examples":[{"en":"Pondwort forms thick underwater mats that provide shelter for small fish.","zh":"pondwort 会在水下形成茂密的草丛，为小鱼提供栖身之处。"},{"en":"The lake’s edges were lined with pondwort and reeds.","zh":"湖边长满了 pondwort 和芦苇。"}]}],"synonyms":["pondweed","aquatic plant","waterweed"],"phonetic":"/ˈpɑndˌwɝt/","extraExplanation":["“pondwort”在现代日常英语里不算常用，更常见的说法是“pondweed”。在自然观察、园艺或生态语境中可能会见到它，用来泛指池塘里的水草，或更具体地指眼子菜属（Potamogeton）的植物。","词源上可拆为 pond（池塘）+ wort（古英语中指“植物/草药”，在许多植物名里保留，如 St. John’s wort）。因此 pondwort 直观意思就是“池塘里的草本植物”。"]}
{"word":"pondy","summary":{"en":"“Pondy” is an informal short name most commonly used for Puducherry (formerly Pondicherry) in India, and sometimes a casual nickname for someone/something named Pondy.","zh":"“Pondy”通常是对印度的本地治里（Puducherry，旧称Pondicherry）的非正式简称；也可作对名为Pondy的人/事物的随意昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) Puducherry (formerly Pondicherry), a coastal union territory/city in south India.","zh":"（非正式）印度南部沿海的本地治里（旧称“本地治里/Pondicherry”），一个联邦属地/城市。"},"examples":[{"en":"We spent the weekend in Pondy and visited the seaside promenade.","zh":"我们周末去了Pondy，在海滨步道散步。"},{"en":"Many travelers call Puducherry “Pondy” for short.","zh":"很多旅行者把Puducherry简称为“Pondy”。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) A nickname for a person or place named “Pondy.”","zh":"（非正式）对名为“Pondy”的人或事物的昵称/简称。"},"examples":[{"en":"Everyone calls him Pondy because his last name is Pond.","zh":"大家都叫他Pondy，因为他姓Pond。"}]}],"synonyms":["Puducherry","Pondicherry"],"phonetic":"ˈpɑndi","extraExplanation":["“Pondy”最常见于旅行语境，是对Puducherry（旧英文名Pondicherry）的口语简称。官方名称在2006年改为Puducherry，但在英语口语和旅游圈里旧名及简称仍很常见。","用作昵称时属于非正式用法，通常出现在熟人之间或特定圈子里；正式写作建议用全名（如Puducherry/Pondicherry或人的正式姓名）。"]}
{"word":"pone","summary":{"en":"“Pone” means a traditional (often Southern U.S.) cornbread, sometimes shaped like a small loaf or cake.","zh":"“pone”指传统的玉米面包（常见于美国南方），常做成小条状或饼状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple type of cornbread (often baked or fried), traditionally associated with the Southern United States; sometimes shaped into a small loaf or cake","zh":"一种简单的玉米面包（常烤或煎），常与美国南方饮食文化相关；有时做成小面包/饼状"},"examples":[{"en":"They served chili with a warm slice of cornbread pone.","zh":"他们端上辣味炖肉，配了一片热热的玉米面包（pone）。"},{"en":"Grandma fried pone in a cast-iron skillet.","zh":"奶奶用铸铁锅把玉米面包（pone）煎了。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader/older use) a small loaf or cake of bread, especially made from cornmeal","zh":"（较宽泛/较旧用法）一种小条状或饼状的面包，尤指用玉米面制成的"},"examples":[{"en":"In some older stories, travelers eat a “pone” they carry with them.","zh":"在一些较早的故事里，旅人会吃随身带着的“pone”（小面包）。"}]}],"synonyms":["cornbread","johnnycake (regional)","corn cake"],"phonetic":"/poʊn/","extraExplanation":["“pone”多见于美国南方或带有乡土/传统风格的语境中，现代更常说“cornbread”。在文学或历史写作里，用“pone”能营造朴素、乡村或早期定居者生活的氛围。","容易与“prone”（/proʊn/，意为“倾向于；俯卧的”）拼写混淆；如果你想查的是“prone”，告诉我我可以另作词条。"]}
{"word":"ponent","summary":{"en":"“Ponent” is a rare word meaning “western,” and in formal legal use it can mean the person who puts forward a will or claim.","zh":"“ponent”很少见，常指“西方的”；在正式法律语境中也可指提出并主张遗嘱或主张应被认可的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Western; from or toward the west.","zh":"（罕见/文学用语）西方的；来自西方或朝向西方的。"},"examples":[{"en":"The ship turned ponent, heading toward the setting sun.","zh":"船只转向西方，朝着落日的方向航行。"},{"en":"In some old texts, “levant” and “ponent” mean east and west.","zh":"在一些古老文本中，“levant”和“ponent”分别指东方和西方。"}]},{"partOfSpeech":"n.","definition":{"en":"(law, formal) A person who presents or “propounds” a will or claim for acceptance (for example, in court).","zh":"（法律/正式用语）提出并主张某份遗嘱或主张应被认可的人（如在法庭上）。"},"examples":[{"en":"The ponent of the will provided witnesses and documents.","zh":"遗嘱的提出方提供了证人和文件。"},{"en":"As ponent, she had to prove the document was valid.","zh":"作为提出方，她必须证明该文件有效。"}]}],"synonyms":["western","occidental","proponent (related, more common)","petitioner (legal, related)"],"phonetic":"/ˈpoʊnənt/","extraExplanation":["“ponent”在现代英语里非常少见，更多出现在法律语境或文学/历史文本中。表示“西方的”这一义项与拉丁语“ponere”（放置）相关，和“sun is set（太阳落下）在西方”的文化联想有关。","在地中海与欧洲的古典/航海写作里，常用“Levant（东方，日出之地）—Ponent（西方，日落之地）”来对举。"]}
{"word":"ponera","summary":{"en":"*Ponera* is a scientific genus name for certain small ants.","zh":"*Ponera* 是某些小型蚂蚁的属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small ants (genus name *Ponera*), used in biology/scientific writing","zh":"（生物学）小型蚂蚁的一属名：*Ponera*（常见于科学文献中的拉丁学名）"},"examples":[{"en":"The researcher identified the specimen as *Ponera* based on its body shape.","zh":"研究人员根据体型特征将该标本鉴定为 *Ponera* 属。"},{"en":"*Ponera* ants are often studied in taxonomy and ecology.","zh":"*Ponera* 属的蚂蚁常用于分类学与生态学研究。"}]}],"synonyms":["(no common synonyms; scientific name)"],"phonetic":"/poʊˈnɪrə/","extraExplanation":["*Ponera* 通常以拉丁学名形式出现，写作时首字母大写并用斜体（*Ponera*）。日常英语里很少用到，更多见于论文、物种名录、自然观察记录等。","词源上常被认为与希腊语词根相关（含“阴暗/凶恶”的意义色彩），用于给某些生物类群命名；不过在现代英语使用中，它主要就是一个中性的科学名称。"]}
{"word":"poneramoeba","summary":{"en":"Poneramoeba is a scientific genus name for an amoeba-like microorganism.","zh":"Poneramoeba 是一种变形虫样微生物的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for an amoeba-like microorganism (a type of single-celled protist) used in biological classification","zh":"一个用于生物分类的科学属名，指一种“变形虫样”的微生物（单细胞原生生物）"},"examples":[{"en":"In the lab notes, the sample was labeled as Poneramoeba sp., meaning the exact species was not identified.","zh":"在实验记录里，样本被标注为 Poneramoeba sp.，表示尚未确定具体物种。"},{"en":"Researchers compared Poneramoeba with other amoebae under the microscope.","zh":"研究人员在显微镜下把 Poneramoeba 与其他变形虫作比较。"}]}],"synonyms":["amoeba (general term)","amoeboid protist"],"phonetic":"/ˌpoʊnərəˈmiːbə/","extraExplanation":["“Poneramoeba”看起来是拉丁化的生物学属名（genus）。这类词通常首字母大写并用斜体书写：*Poneramoeba*；当物种不确定时常写作 *Poneramoeba* sp.（sp.=species，某一物种）。","由于它是专门的分类学名称，不同资料库对其收录与释义可能不一致；如果你能提供出现它的句子、论文链接或图片，我可以更准确地解释它指的具体类群与用法。"]}
{"word":"ponere","summary":{"en":"*Ponere* is a Latin verb meaning “to put/place,” and it appears as a root in many English words (often as -pose or -posit).","zh":"*Ponere* 是拉丁语“放/置”的动词词根，常以 -pose 或 -posit 的形式出现在许多英语词中。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"a Latin verb meaning “to put, place, or set (something down).”","zh":"拉丁语动词，意思是“放、置、把……放下/安置”。"},"examples":[{"en":"In Latin, *ponere* can mean “to put” or “to place.”","zh":"在拉丁语中，*ponere* 可以表示“放”或“安置”。"},{"en":"Many English words contain the root from *ponere*, such as *postpone* (post- + ponere).","zh":"许多英语词含有来自 *ponere* 的词根，比如 *postpone*（post- + ponere，意为“把事情往后放”→“推迟”）。"},{"en":"The noun form is related to *position*—the idea of “where something is placed.”","zh":"它的名词相关形式与 *position*（位置）有关，核心概念是“被放置在哪里”。"}]}],"synonyms":["put","place","set","position"],"phonetic":"/poʊˈnɛreɪ/","extraExplanation":["“ponere”常见于英语词源学习：它的核心意象是“把某物放到某处”。很多英语词通过前缀改变“放”的方向或时间，如 post-（在……之后）+ ponere → postpone（往后放→推迟）。","同源/相关词根常以 -pose / -posit 的形式出现（来自拉丁语的不同词形变化），例如: compose（放在一起→组成）、expose（放到外面→暴露）、deposit（放下→存放/存款）、opposite（放在对面→相对的）。"]}
{"word":"ponerid","summary":{"en":"“Pioneered” means someone was the first to develop or introduce something new, or to settle and open up a new area for others.","zh":"“pioneered”表示“率先开创/引入新事物”，也可指“拓荒定居，为后来者开路”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “pioneer”) to be among the first people to develop, introduce, or use something new; to lead the way.","zh":"（“pioneer”的过去式/过去分词）开创；率先开发/引入/使用（新事物）；走在前面带路。"},"examples":[{"en":"She pioneered a new method for teaching reading to young children.","zh":"她开创了一种教小孩阅读的新方法。"},{"en":"The company pioneered online shopping in the early 1990s.","zh":"这家公司在20世纪90年代初率先发展了网上购物。"},{"en":"Researchers pioneered techniques that later became standard in hospitals.","zh":"研究人员率先开发了一些技术，后来成了医院里的标准做法。"}]},{"partOfSpeech":"vt.","definition":{"en":"To settle in a new area and help make it possible for others to live there later (often used when talking about history).","zh":"（常用于历史语境）到新地区拓荒定居，为后来者的生活与发展打基础。"},"examples":[{"en":"They pioneered the region, building roads and farms where there were none.","zh":"他们在那片地区拓荒，修路建农场，把原本没有的基础设施建起来。"},{"en":"Many families pioneered the American West in the 1800s.","zh":"19世纪许多家庭在美国西部拓荒定居。"}]}],"synonyms":["spearheaded","initiated","developed","introduced","opened up","blazed a trail"],"phonetic":"/ˌpaɪəˈnɪrd/","extraExplanation":["“pioneer”既可作名词（n. 先驱、拓荒者），也可作动词（vt. 开创、率先）。你写的“ponerid”很可能是拼写错误，想表达的是“pioneered”。如果你本来想查的是别的词，也可以告诉我上下文句子，我可以帮你定位正确拼法与意思。"]}
{"word":"poneridae","summary":{"en":"Poneridae is an older scientific name for a group of ants, now usually treated as the subfamily Ponerinae.","zh":"Poneridae 是旧文献中用于一类蚂蚁的科学名称，现代多对应为针蚁亚科（Ponerinae）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific taxonomic name once used for a family of ants; in modern classification it is usually treated as the ant subfamily Ponerinae (within the family Formicidae).","zh":"一个曾用于“蚁科”中某一类群的科学分类名称（旧称“针蚁科/猛蚁科”一类）；在现代分类中通常对应为蚁科（Formicidae）下的针蚁亚科（Ponerinae）。"},"examples":[{"en":"Some older biology books list Poneridae as a separate ant family.","zh":"一些较老的生物学书会把 Poneridae 列为一个独立的蚂蚁“科”。"},{"en":"In many modern sources, species once placed in Poneridae are now grouped under the subfamily Ponerinae.","zh":"在许多现代资料中，过去归入 Poneridae 的物种现在多归在针蚁亚科 Ponerinae 之下。"}]}],"synonyms":["Ponerinae"],"phonetic":"/pəˈnɪrədiː/","extraExplanation":["Poneridae 属于生物分类学中的拉丁化名称，常见于旧版文献。随着系统发育研究（尤其是分子证据）更新，许多“旧科”被重新划分层级或拆分/合并，因此你会在新旧资料中看到不同用法。","如果你是在论文或标本标签上看到 Poneridae，通常需要对照该资料的年代与所采用的分类体系；在检索时可以同时用关键词 Poneridae 与 Ponerinae 以获得更完整结果。"]}
{"word":"ponerinae","summary":{"en":"Ponerinae: a subfamily of mostly predatory ants, many with a strong sting.","zh":"Ponerinae：多为捕食性、且不少具有强螫针的蚂蚁亚科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of ants (family Formicidae), often called “ponerine ants,” which typically have a strong sting and are mostly predatory.","zh":"（蚁科 Formicidae 的）一个亚科，常称“刺蚁亚科/猎蚁亚科（ponerine ants）”，通常具有较强的螫针，多为捕食性。"},"examples":[{"en":"Ponerinae ants are often solitary hunters rather than trail-following foragers.","zh":"刺蚁亚科的蚂蚁常常是独自狩猎，而不是沿着气味路径集体觅食。"},{"en":"Some species in Ponerinae can deliver a painful sting.","zh":"刺蚁亚科的一些物种会造成相当疼痛的螫刺。"}]}],"synonyms":["ponerine ants"],"phonetic":"ˌpoʊnəˈriːniː","extraExplanation":["“Ponerinae”是生物分类学中的拉丁化名称：属名/科名等通常首字母大写，而亚科名常以 -inae 结尾（如 Ponerinae）。在写作中多用斜体表示学名（例如 *Ponerinae*）。","学习相关词：ant（蚂蚁）、subfamily（亚科）、predatory（捕食性的）、sting（螫针/螫刺）。"]}
{"word":"ponerine","summary":{"en":"Ponerine means “of the ant subfamily Ponerinae,” or a member of that group.","zh":"ponerine 指“刺蚁亚科（Ponerinae）的”，也可指刺蚁亚科的一员（某种蚂蚁）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ant subfamily Ponerinae (a group of mostly predatory ants, often with a painful sting).","zh":"（昆虫学）与蚁科中“刺蚁亚科”（Ponerinae）有关的；刺蚁亚科的（多为捕食性蚂蚁，常带有较强蜇刺）。"},"examples":[{"en":"Some ponerine ants hunt termites and other insects.","zh":"一些刺蚁亚科的蚂蚁会捕食白蚁和其他昆虫。"},{"en":"The researcher compared ponerine behavior across different habitats.","zh":"研究人员比较了不同栖息地中刺蚁亚科蚂蚁的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"An ant that belongs to the subfamily Ponerinae.","zh":"刺蚁亚科的蚂蚁；刺蚁亚科成员。"},"examples":[{"en":"A ponerine was found under a log near the stream.","zh":"在小溪旁的一根倒木下发现了一只刺蚁亚科的蚂蚁。"}]}],"synonyms":["Ponerinae (adj./n.)","ponerine ant"],"phonetic":"/ˈpoʊnəraɪn/","extraExplanation":["“ponerine”是分类学用语，来自亚科名 Ponerinae。日常英语里很少用到，更多见于生物学、昆虫学文章或自然观察记录中。","刺蚁亚科常被描述为“原始型（primitive）蚂蚁”之一：通常个体较大、以捕食为主、群体规模相对较小；有些种类会蜇人，野外观察需注意安全。"]}
{"word":"poneroid","summary":{"en":"“Poneroid” is a rare term meaning “psychopath-like,” used mainly in political psychology writing, especially Political Ponerology.","zh":"“Poneroid”是少见词，主要用于政治心理学写作中，表示“类似精神病态/类病态人格”的特征或人物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In political psychology / “political ponerology”) resembling a personality disorder—showing some manipulative or emotionally cold traits—but not considered a true psychopath.","zh":"（政治心理学／“政治邪恶学”用语）类似人格病态——表现出某些操控性或情感冷漠等特征——但并不被认为是真正的精神病态者（psychopath）。"},"examples":[{"en":"Some writers use “poneroid” to describe leaders who imitate psychopathic behavior to gain power.","zh":"一些作者用“poneroid”来形容为了夺取权力而模仿精神病态行为的领导者。"},{"en":"The article warns that a poneroid style can normalize cruelty in an organization.","zh":"文章警告说，“poneroid”的作风可能让残酷在组织里变得“正常”。"}]},{"partOfSpeech":"n.","definition":{"en":"A person described as having poneroid traits.","zh":"被描述为具有 poneroid 特征的人。"},"examples":[{"en":"In that book, a “poneroid” is someone who adopts harmful, manipulative tactics without meeting the clinical definition of psychopathy.","zh":"在那本书里，“poneroid”指的是采用有害、操控手段但未必符合精神病态临床定义的人。"}]}],"synonyms":["psychopath-like","pseudo-psychopathic","pathology-adjacent","manipulative","callous"],"phonetic":"/ˈpɑːnərɔɪd/","extraExplanation":["“Poneroid”是非常少见、也不属于主流临床诊断体系（如 DSM）的词，主要出现在波兰心理学家安德烈·洛巴切夫斯基（Andrzej Łobaczewski）的“政治邪恶学（Political Ponerology）”相关讨论中。","词根来自希腊语 ponēros（πονηρός，意为“邪恶的/恶劣的”）。在该理论语境里，它常用于区分“真正的精神病态者”与“在环境、权力结构或模仿中形成的类精神病态表现”。使用时要注意：它更多是思想/社会评论用语，而非医学定论。"]}
{"word":"ponerology","summary":{"en":"Ponerology means the study of evil, often used for analyzing political or social wrongdoing.","zh":"Ponerology 指“对邪恶/恶行的研究”，常用于分析政治或社会层面的作恶与其成因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of evil, especially the causes and nature of harmful or destructive behavior in individuals or societies (often used in discussions of political or social wrongdoing)","zh":"恶之学；对“邪恶/恶行”的研究，尤指探讨个人或社会中有害、破坏性行为的成因与本质（常用于政治或社会层面的恶行讨论）"},"examples":[{"en":"The author uses ponerology to analyze how ordinary people can participate in cruelty under certain systems.","zh":"作者用“恶之学”来分析：在某些体制下，普通人如何会参与残酷行为。"},{"en":"In that book, political ponerology focuses on the psychology behind oppressive regimes.","zh":"在那本书里，“政治恶之学”关注压迫性政权背后的心理机制。"}]}],"synonyms":["the study of evil","the study of wrongdoing","moral psychology (related)","political evil (related)"],"phonetic":"/ˌpoʊnəˈrɑːlədʒi/","extraExplanation":["词源：来自希腊语 *ponēros*（意为“邪恶的、恶劣的”）+ *-logy*（“……之学/研究”）。","该词在一般英语中较少见，更常出现在哲学、心理学或政治批评语境里；尤其与波兰心理学家安德鲁·沃巴切夫斯基（Andrzej Łobaczewski）的《Political Ponerology》（《政治恶之学》）相关，用来讨论“系统性/制度性作恶”与病态人格对政治结构的影响。","用法提示：它通常指“研究/分析框架”，而不是简单说“邪恶”本身；如果只是指“邪恶”，更常用 *evil* 或 *wrongdoing*。"]}
{"word":"pones","summary":{"en":"“Pones” is the plural of “pone,” meaning small loaves/cakes of cornbread (Southern U.S.).","zh":"“pones”是“pone”的复数，指（美国南部常见的）小块玉米面包/玉米饼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in the Southern U.S.) a small, usually round or oval loaf of cornbread.","zh":"（尤指美国南部）一小块（多为圆形或椭圆形）的玉米面包/玉米饼。"},"examples":[{"en":"Grandma served soup with warm cornbread pones on the side.","zh":"奶奶端上汤，旁边配了热乎乎的玉米面包小饼。"},{"en":"He ate two pones with butter for breakfast.","zh":"他早餐吃了两块抹黄油的玉米面包小饼。"}]}],"synonyms":["cornbread (general)","corn cake"],"phonetic":"/poʊn/","extraExplanation":["“pone”常见于美国南部英语与历史写作中，指用玉米粉做的简单面包/饼，和更广义的“cornbread”相比，pone更强调“单个小块/小饼”的形状。","你输入的“pones”是复数形式；单数是“pone”。（注意不要和“ponies/pony（小马）”混淆。）"]}
{"word":"poney","summary":{"en":"“Poney” is usually a nonstandard spelling of “pony,” meaning a small horse.","zh":"“poney”通常是“pony”的非标准拼写，意思是“小马”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or misspelled form of “pony” (a small horse), sometimes seen in French-influenced contexts.","zh":"“pony（小马）”的非标准拼写或拼写错误；有时会在受法语影响的语境中出现。"},"examples":[{"en":"I think you mean “pony,” not “poney.”","zh":"我觉得你想写的是“pony”，不是“poney”。"},{"en":"The child rode a pony at the fair.","zh":"孩子在游乐集市骑了一匹小马。"}]}],"synonyms":["pony","small horse"],"phonetic":"/ˈpoʊni/","extraExplanation":["在标准英语里通常写作 **pony**。**poney** 更常见于拼写错误，或在法语里（如 *poney*）偶尔出现的写法；如果你在英文写作、考试或正式场合，建议使用 **pony**。","补充：英语 **pony** 也可引申指“小型版本/简化版本”（如 *a pony bottle* 小瓶装），但这个意义较少见。"]}
{"word":"pong","summary":{"en":"“Pong” most commonly means a strong bad smell, or the act of smelling bad; it can also refer to table tennis in some informal contexts.","zh":"“pong”最常指难闻的臭味或发臭；在某些非正式语境中也可指乒乓球（或出现在“beer pong”等游戏名称中）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, unpleasant smell (informal)","zh":"难闻的强烈气味；臭味（非正式）"},"examples":[{"en":"There was a terrible pong coming from the trash can.","zh":"垃圾桶里散发出一股很难闻的臭味。"},{"en":"After the game, the locker room had a real pong.","zh":"比赛后，更衣室里真是臭气熏天。"}]},{"partOfSpeech":"v.","definition":{"en":"to smell strongly and unpleasantly (informal)","zh":"散发难闻的气味；发臭（非正式）"},"examples":[{"en":"These socks pong—please put them in the laundry.","zh":"这些袜子好臭——请把它们放进洗衣篮。"},{"en":"The kitchen was ponging of old oil.","zh":"厨房里有股旧油的臭味。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, in some places) table tennis; also used in names of games like “beer pong”","zh":"（非正式，部分地区）乒乓球；也用于“beer pong”等游戏名称"},"examples":[{"en":"We played pong in the basement after dinner.","zh":"晚饭后我们在地下室打乒乓球。"},{"en":"They set up a beer pong table for the party.","zh":"他们为聚会摆了一张投杯球（beer pong）的桌子。"}]}],"synonyms":["stink","reek","smell (bad)","funk"],"phonetic":"/pɔŋ/","extraExplanation":["“pong”表示“臭味/发臭”主要见于英式口语，在美式英语里也能听到，但更常见的说法是“stink (n./v.)”。","它有拟声/口语色彩，语气通常比较随意，有时带点抱怨或调侃。","“Pong”也会让人联想到经典电子游戏《Pong》（乒乓球风格），以及派对游戏“beer pong”（把乒乓球投进杯子里）。"]}
{"word":"ponga","summary":{"en":"“Ponga” is Spanish for “put/place,” used especially as a formal command or in the subjunctive.","zh":"“Ponga”是西班牙语“放/置”的变位，常用于正式命令式或虚拟式结构中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Spanish) A form of the verb “poner” meaning “put / place / set.” It is commonly used as a formal command (“put…!”) or in the present subjunctive (after expressions like “I hope that…”).","zh":"（西班牙语）动词“poner（放、置、设定）”的一种变位。常用于正式命令式（“请放……！”）或现在虚拟式（用于“希望/要求/建议……”等结构之后）。"},"examples":[{"en":"Ponga la taza en la mesa, por favor.","zh":"请把杯子放在桌子上。"},{"en":"Espero que usted ponga atención en clase.","zh":"我希望您上课时注意听。"},{"en":"El médico recomienda que ponga hielo en la rodilla.","zh":"医生建议在膝盖上敷冰。"}]}],"synonyms":["(Spanish) coloque","(Spanish) ponga (from poner)"],"phonetic":"ˈpoʊŋɡə","extraExplanation":["“Ponga”通常对应“usted”（您）的正式用法：\n- 命令式：Ponga + 名词（请放……）\n- 虚拟式：希望/建议/要求 + que + ponga（希望/建议您放……）\n在拉美与西班牙都很常见，语气比“pon”（对tú/你）更正式、更礼貌。"]}
{"word":"ponged","summary":{"en":"“Ponged” is the past tense of “pong,” meaning either “smelled very bad” or (informally) “hit a ball back and forth,” often in table tennis.","zh":"“Ponged”是“pong”的过去式，常指“散发臭味”，也可非正式地指“把球来回击打”（常和乒乓有关）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense of “pong”) to give off a strong, unpleasant smell.","zh":"（“pong”的过去式）散发出强烈难闻的气味。"},"examples":[{"en":"After the hike, my socks ponged so badly that everyone opened a window.","zh":"徒步后，我的袜子臭得厉害，大家都把窗户打开了。"},{"en":"The trash bin ponged when we forgot to take it out.","zh":"我们忘了倒垃圾时，垃圾桶就开始散发臭味。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense of “pong”) to hit a ball back and forth (often used informally about table tennis).","zh":"（“pong”的过去式）把球来回击打（常非正式地指打乒乓球）。"},"examples":[{"en":"We ponged the ball across the table for a few minutes.","zh":"我们在桌子上把球来回打了几分钟。"},{"en":"The kids ponged in the basement while it rained outside.","zh":"外面下雨时，孩子们在地下室里打“乒乓”（来回对打）。"}]}],"synonyms":["stank","reeked","smelled","smelled bad","played table tennis"],"phonetic":"/pɑŋd/","extraExplanation":["“pong（臭味）”在英式英语里更常见，带一点口语/俚语感觉；美式英语更常用“stink / smell bad”。","和乒乓相关的用法来自“ping-pong / Pong（早期电子游戏名）”的联想式简称，属于比较非正式的说法。"]}
{"word":"pongee","summary":{"en":"Pongee is a soft plain-woven fabric, traditionally silk, used for clothing and linings.","zh":"Pongee是一种柔软的平纹布料，传统为丝织，常用于衣物和里衬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of soft, plain-woven fabric, traditionally made of silk (now often silk-blend or synthetic), used for clothing, linings, and sometimes umbrellas","zh":"一种柔软的平纹布料，传统上为丝织（现在也常见丝混纺或化纤），用于衣物、里衬，有时也用于雨伞等"},"examples":[{"en":"She wore a lightweight pongee blouse in summer.","zh":"她夏天穿了一件轻薄的pongee（茧绸/薄绸）衬衫。"},{"en":"The coat has a pongee lining that feels smooth against the skin.","zh":"这件外套有pongee里衬，贴肤摸起来很顺滑。"},{"en":"Some classic umbrellas were once made with pongee fabric.","zh":"一些传统雨伞过去曾用pongee布料制作。"}]}],"synonyms":["silk (general)","plain-weave fabric","dress lining"],"phonetic":"/pɑnˈdʒi/","extraExplanation":["“pongee”常译作“茧绸/庞绸/薄绸”，在服装语境里多指质地较轻、较薄、表面略有自然纹理的平纹面料。不同品牌与产地对具体成分和手感会有差异，购买时可看成分标签（silk / silk blend / polyester等）。","词源上与“Pongee（庞绸）”在欧洲对某类东方丝织物的称呼有关，带有历史上的贸易与纺织文化背景。"]}
{"word":"pongees","summary":{"en":"Pongee is a light plain-woven silk (or silk-like) fabric; “pongees” is the plural form.","zh":"Pongee 指轻薄的平纹真丝（或仿丝）面料；“pongees”为其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lightweight plain-woven fabric (usually silk, or made to look like silk) used especially for linings, dresses, and umbrellas","zh":"一种轻薄的平纹织物（通常为真丝或仿丝质感），常用于衣物里衬、连衣裙和伞面等"},"examples":[{"en":"She chose a pongee lining to make the coat feel lighter.","zh":"她选了庞绮（pongee）作里衬，让外套穿起来更轻便。"},{"en":"Many classic umbrellas were covered with pongee fabric.","zh":"许多经典雨伞的伞面会用庞绮（pongee）布料。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of pongee (more than one type or piece of pongee fabric)","zh":"pongee 的复数形式（指多种或多块庞绮布料）"},"examples":[{"en":"The shop had several pongees in different shades of beige.","zh":"这家店有好几种不同米色调的庞绮布料。"}]}],"synonyms":["silk","silk fabric","lining fabric","lightweight fabric"],"phonetic":"/pɑnˈdʒeɪ/","extraExplanation":["“pongee”常见于纺织与服装语境，属于偏书面/商品描述用词，日常口语里更可能用“silk fabric（丝绸面料）”“lining fabric（里料）”等更泛的说法。","词源上通常被认为与法语的纺织品名称有关，并与东亚丝织品贸易历史有联系；在英语里多用来指一种“轻薄、平纹、略带自然颗粒感”的面料风格。"]}
{"word":"pongid","summary":{"en":"A largely outdated term for a great ape (formerly classified in the family Pongidae).","zh":"一个基本过时的词，指类人猿（旧时归入“猿科 Pongidae”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Older classification) a great ape, especially an orangutan, chimpanzee, or gorilla; a member of the former family Pongidae.","zh":"（旧分类）类人猿，尤指猩猩、黑猩猩或大猩猩；旧时“猿科（Pongidae）”的成员。"},"examples":[{"en":"In older biology books, chimpanzees were sometimes described as pongids rather than members of the human family.","zh":"在较早的生物学书籍中，黑猩猩有时被称为“pongid”，而不是被归入人科。"},{"en":"The term “pongid” is now mostly found in historical discussions of primate classification.","zh":"“pongid”这个词现在多见于关于灵长类分类史的讨论中。"}]}],"synonyms":["great ape","orangutan","chimpanzee","gorilla"],"phonetic":"/ˈpɑːndʒɪd/","extraExplanation":["“pongid”来自拉丁化的属名 Pongo（猩猩），加上 -id（表示“……类/……科成员”的后缀）。","现代分类学通常不再使用“Pongidae（猿科）”这一旧科名，因为基于遗传与演化关系，人类与黑猩猩、猩猩、大猩猩被更常一起归入 Hominidae（人科）。因此“pongid”带有明显的历史/过时色彩，学术写作中多用 great ape 或直接说 orangutan/chimpanzee/gorilla。","阅读旧文献时，“pongid vs. hominid（人科成员/旧指人类及其祖先）”的对立很常见；在新分类里，hominid 的范围扩大了，容易造成术语误读。"]}
{"word":"pongidae","summary":{"en":"Pongidae is an older, mostly outdated family name once used for the great apes (excluding humans).","zh":"Pongidae 是一个较旧、现多已不用的分类“科”名，曾用于指大型类人猿（通常不含人类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now largely outdated) biological family name that was used to group the great apes—especially chimpanzees, gorillas, and orangutans—separately from humans.","zh":"（旧称，现多已不用）灵长类中的一个“科”名，过去常用来把大型类人猿（尤其黑猩猩、大猩猩、猩猩等）与人类分开归类。"},"examples":[{"en":"Older biology books sometimes list chimpanzees and gorillas under the family Pongidae.","zh":"较旧的生物学书有时会把黑猩猩和大猩猩列在“Pongidae（猿科）”之下。"},{"en":"In modern classification, these apes are usually placed in Hominidae instead of Pongidae.","zh":"在现代分类中，这些类人猿通常归入 Hominidae（人科），而不是 Pongidae。"}]}],"synonyms":["Hominidae (modern usage)","great apes"],"phonetic":"/pɑŋˈɡaɪdi/","extraExplanation":["Pongidae 是一种较早期的分类用法，反映了过去“把人类与其他类人猿分开”的思路。后来随着化石证据与分子生物学（如 DNA 比对）发展，学界更强调人类与黑猩猩等的近缘关系，因此多改用 Hominidae（人科）来涵盖人类与其他大型类人猿。","在阅读英文文献时，若看到 Pongidae，通常意味着文本较旧，或在讨论分类史/术语演变。"]}
{"word":"pongids","summary":{"en":"“Pongids” is an older term for the great apes (often excluding humans).","zh":"“pongids”是较早的说法，指大型类人猿（常不包括人类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Great apes such as orangutans, gorillas, and chimpanzees (sometimes excluding humans), used especially in older scientific classification.","zh":"（复数）类人猿（如红毛猩猩、大猩猩、黑猩猩等；有时不包括人类），多见于较早的科学分类用法。"},"examples":[{"en":"Older textbooks sometimes grouped chimpanzees and gorillas as “pongids.”","zh":"一些较早的教材会把黑猩猩和大猩猩归为“pongids（类人猿）”。"},{"en":"The paper uses “pongids” in a historical discussion of primate classification.","zh":"这篇论文在讨论灵长类分类史时使用了“pongids”这个词。"}]}],"synonyms":["great apes","hominoids"],"phonetic":"/ˈpɑn.dʒɪdz/","extraExplanation":["“pongid”源自拉丁化的属名 Pongo（红毛猩猩属）。在旧分类中常把“Pongidae（类人猿科）”与“Hominidae（人科）”区分开；但现代系统分类更常把人类与其他大型类人猿放在同一科（Hominidae），因此“pongid(s)”如今多用于历史/过时语境，日常或现代学术更常说“great apes（大型类人猿）”或“hominoids（人猿总科成员）”。"]}
{"word":"ponging","summary":{"en":"“Ponging” means “smelling very bad,” especially in British informal English.","zh":"“ponging”指“很臭、难闻”，多见于英式口语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British informal) smelling very bad; giving off a strong unpleasant odor.","zh":"（英式非正式）很臭的；散发出强烈难闻气味的。"},"examples":[{"en":"After the game, everyone’s shoes were ponging.","zh":"比赛结束后，大家的鞋子都臭烘烘的。"},{"en":"The kitchen was ponging with burnt oil.","zh":"厨房里弥漫着焦油味，很难闻。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “pong”: to smell very bad; to give off a strong unpleasant odor.","zh":"“pong”的现在分词：发臭；散发出强烈难闻的气味。"},"examples":[{"en":"Something is ponging in the fridge—maybe the old fish.","zh":"冰箱里有东西在发臭——可能是那条放久了的鱼。"},{"en":"His clothes were ponging after the long hike.","zh":"长途徒步之后，他的衣服都馊臭了。"}]}],"synonyms":["stinking","smelly","reeky","rank (BrE)","reeking"],"phonetic":"/ˈpɔŋɪŋ/","extraExplanation":["“pong / ponging”在英国英语里很常见，语气偏口语、带点嫌弃或吐槽；在美式英语中相对少见，美式更常说“stinky / smelly / reeks”。","常见搭配：ponging shoes（臭鞋）、ponging clothes（臭衣服）、ponging kitchen（臭厨房）；也常与介词“of/with”连用：ponging of sweat（汗臭）、ponging with smoke（烟味很冲）。"]}
{"word":"pongo","summary":{"en":"Pongo most commonly means an orangutan, especially the scientific genus name for orangutans.","zh":"Pongo最常见指“猩猩”，尤其是猩猩属的学名；少见情况下也可指“臭味”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an orangutan; also used as the scientific genus name for orangutans (Pongo).","zh":"猩猩（特指“红毛猩猩/婆罗洲猩猩”等）；也作猩猩属的学名（Pongo）。"},"examples":[{"en":"Orangutans belong to the genus Pongo.","zh":"猩猩属于猩猩属（Pongo）。"},{"en":"Scientists study Pongo to better understand great ape behavior.","zh":"科学家研究猩猩属（Pongo），以更好地了解大型类人猿的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) a strong, unpleasant smell; a “pong.”","zh":"（罕见，非正式）难闻的气味；臭味。"},"examples":[{"en":"There was a real pongo in the locker room after practice.","zh":"训练后更衣室里真是臭得不行。"}]}],"synonyms":["orangutan","great ape","pong (smell)"],"phonetic":"/ˈpɑŋɡoʊ/","extraExplanation":["“Pongo”在英语里最常见于动物学/科普语境，作为猩猩属的拉丁学名。这个名称来自早期欧洲旅行记中对非洲大型猿类的记载，后来被博物学家用于分类命名。","“pongo=臭味”的用法更偏英式口语、也比较少见；更常见的说法是“pong”（臭味/发臭）。"]}
{"word":"pongs","summary":{"en":"“Pongs” can mean unpleasant smells (plural noun) or “smells bad” (verb form of pong).","zh":"“pongs”可指“臭味”（名词复数），也可指“很臭/散发臭味”（动词形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “pong”) strong, unpleasant smells.","zh":"（“pong”的复数）刺鼻的臭味、难闻的气味。"},"examples":[{"en":"After the blackout, the refrigerator produced all kinds of pongs.","zh":"停电后，冰箱里散发出各种难闻的臭味。"},{"en":"The locker room was full of sweaty pongs.","zh":"更衣室里充满了汗味等臭味。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “pong”) to smell strongly and unpleasantly.","zh":"（“pong”的第三人称单数）散发出强烈难闻的气味；很臭。"},"examples":[{"en":"Something in the trash pongs whenever you open the lid.","zh":"垃圾桶里有东西，一打开盖子就臭味扑鼻。"},{"en":"The shoes pongs after practice.","zh":"训练后鞋子特别臭。"}]}],"synonyms":["stinks","smells bad","reek(s)","odor(s)","stench(es)"],"phonetic":"/pɔŋ/","extraExplanation":["“pong”是比较口语、偏英式英语（BrE）的说法，表示“臭味/很臭”。美式英语里更常见的表达是“stink”或“smell bad”。另外，“pongy”也常用来形容“有臭味的”。"]}
{"word":"ponhaws","summary":{"en":"“ponhaws” isn’t a recognized English word; it’s probably a misspelling or a proper name.","zh":"“ponhaws”不是常见英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username rather than a dictionary word.","zh":"不是标准英语单词。更可能是拼写错误，或是姓名/网名等专有名词，而不是词典收录的词。"},"examples":[{"en":"I couldn’t find “ponhaws” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“ponhaws”——你可以确认一下拼写吗？"},{"en":"Did you mean “ponchos” or “Pony Hawks”?","zh":"你是想说“ponchos（斗篷雨衣）”还是“Pony Hawks（人名/专有名词）”？"}]}],"extraExplanation":["“ponhaws”看起来像是把两个音拼在一起的写法，但在常见英语语料和词典里并不常见。你可以告诉我：①它出现在哪句话/哪段文字里；②你想表达的中文意思；③是否可能是人名、地名或品牌名。我就能更准确地帮你确定正确拼写和含义。"]}
{"word":"poniard","summary":{"en":"A poniard is a small dagger; as a verb it means to stab with one or to attack in a treacherous way.","zh":"poniard 指短匕首；作动词指用匕首刺杀，也可比喻为阴险地攻击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, slender dagger (often used for stabbing); sometimes used figuratively for a hidden betrayal or attack","zh":"短匕首；细长的匕首（多用于刺击）；也可作比喻，指暗中的背叛或攻击"},"examples":[{"en":"In the museum, a 16th‑century poniard was displayed beside swords and armor.","zh":"在博物馆里，一把16世纪的短匕首与刀剑和盔甲一起展出。"},{"en":"His polite words felt like a poniard aimed at her reputation.","zh":"他客气的话语却像一把刺向她名誉的匕首。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stab or kill with a small dagger; to attack treacherously","zh":"用短匕首刺伤或杀害；暗算、阴险地攻击"},"examples":[{"en":"In the play, the villain tries to poniard the king in the dark.","zh":"在这出戏里，反派试图在黑暗中用匕首刺杀国王。"},{"en":"Critics said the article poniarded his character rather than addressing facts.","zh":"评论家说那篇文章是在暗中刺人，攻击他的人品，而不是讨论事实。"}]}],"synonyms":["dagger","stiletto","dirk","knife"],"phonetic":"/ˈpɑːn.jɚd/","extraExplanation":["“poniard”常见于历史小说、戏剧和文学描写中，语感比普通的“dagger”更古典、更带“阴谋/暗杀”的色彩。","词源来自法语 *poignard*（与“拳/握拳”相关的词根有关），暗示“手持刺击的武器”。"]}
{"word":"poniarded","summary":{"en":"“Poniarded” means stabbed with a dagger, or figuratively hurt/attacked sharply; it’s also the past form of “poniard.”","zh":"“poniarded”意为“被匕首/短剑刺伤的”，也可比喻“被尖锐地伤害/暗算”；同时是动词“poniard”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"stabbed or pierced with a dagger (a small, sharp knife), or attacked in a sudden, cruel way (often figurative).","zh":"被短剑（匕首）刺伤的；（常作比喻）遭到突然、残酷的伤害或背刺的。"},"examples":[{"en":"The villain fell, poniarded in the chest.","zh":"恶棍倒下了，胸口被短剑刺中。"},{"en":"Her pride felt poniarded by the harsh comment.","zh":"那句刻薄的话像一剑刺穿了她的自尊。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of “poniard”: to stab with a dagger; to attack treacherously.","zh":"“poniard”的过去式/过去分词：用短剑刺；（引申）暗算、背刺。"},"examples":[{"en":"He was accused of having poniarded his rival in the dark alley.","zh":"他被指控在黑巷里用短剑刺了对手。"},{"en":"The reputation he had carefully built was poniarded by one scandal.","zh":"他苦心经营的名声被一桩丑闻刺得粉碎。"}]}],"synonyms":["stabbed","daggered","pierced","wounded","betrayed"],"phonetic":"/ˈpɔɪniɑrdɪd/","extraExplanation":["“poniard”指一种细长的匕首/短剑，词源来自法语 *poignard*（匕首），再往上与“拳头/握拳（poing）”有关，暗示“握在手里行刺”的武器。这个词在现代英语里比较文学化或戏剧化，日常更常用“stabbed (with a knife/dagger)”。","在文学语境中，“poniarded”常被用作强烈的比喻，表示“被背叛/被一句话刺痛”，带有突然、尖锐、恶意的情绪色彩。"]}
{"word":"poniarding","summary":{"en":"“Poniarding” means stabbing with a small dagger (poniard), or figuratively making a sharp, wounding attack with words.","zh":"“poniarding”指用小匕首刺伤；也可比喻用尖刻话语进行突然、伤人的攻击。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"stabbing or attacking someone with a poniard (a small dagger); also used figuratively for a sudden, sharp verbal attack.","zh":"用匕首（短剑）刺伤或袭击；也可作比喻，指突然尖刻的言语攻击。"},"examples":[{"en":"In the old tale, the traitor tried poniarding the king in the dark corridor.","zh":"在那则古老故事里，叛徒试图在昏暗的走廊里用匕首刺杀国王。"},{"en":"Her remark felt like poniarding—quick, cruel, and meant to wound.","zh":"她那句话像“匕首一刺”——又快又狠，专为伤人。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of using or carrying a poniard; daggering (rare/archaic).","zh":"使用或携带匕首的行为；相当于“持匕首/用匕首”（少见、古语感较强）。"},"examples":[{"en":"The novel describes the assassin’s quiet poniarding before the escape.","zh":"小说描写了刺客在逃走前悄无声息的匕首行刺。"}]}],"synonyms":["stabbing","knifing","daggering","backstabbing (figurative)","skewering (figurative)"],"phonetic":"/ˈpɑːniərdɪŋ/","extraExplanation":["“poniard”原指一种细长的小匕首，在英语里常带有文学性、历史感或戏剧性的色彩；现代日常英语更常说“stab (someone)”或“knife (someone)”。","“poniarding”多见于较旧的文本、历史小说、诗歌或修辞性写作中；用作比喻时，常强调“冷不防、刺痛感强”的言语伤害。"]}
{"word":"poniards","summary":{"en":"“Poniards” means small daggers (plural of “poniard”), a literary/historical word; it can also mean “to stab with a dagger.”","zh":"“poniards”是“poniard”的复数，指匕首/短剑（偏文学、历史用语）；也可作动词表示“用匕首刺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dagger (a short, pointed knife), often used for stabbing","zh":"匕首；短剑（短而尖的刀，常用于刺击）"},"examples":[{"en":"The guard confiscated several weapons, including two poniards.","zh":"守卫没收了几件武器，包括两把匕首。"},{"en":"In the story, the assassin hid a poniard under his cloak.","zh":"在故事里，刺客把匕首藏在斗篷下。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stab someone with a dagger; to wound with a poniard","zh":"用匕首刺；用短剑刺伤"},"examples":[{"en":"He was poniarded in the side during the fight.","zh":"他在打斗中肋部被匕首刺伤。"}]}],"synonyms":["dagger","knife","stiletto","dirk"],"phonetic":"/ˈpɑniərd/","extraExplanation":["“poniards”是“poniard”的复数形式，单数更常见；在现代英语里，这个词带有明显的文学/历史色彩，日常更常说“dagger”或“knife”。","词源来自法语“poignard”（匕首），与“poign-”（拳/手）有关，暗示“手握的刺击武器”。","文学中常用来营造阴谋、暗杀、宫廷斗争等氛围，例如在描写“cloak-and-dagger（披风与匕首）”式的秘密行动时会出现。"]}
{"word":"ponica","summary":{"en":"“ponica” is not a common English vocabulary word; it’s usually a proper name or a specialized/scientific term, or a misspelling of a similar word (often “japonica”).","zh":"“ponica”不是常见英语词汇；通常是专有名词或专业/科学用语，也可能是相近词（常见为“japonica”）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it most often appears as a proper name (e.g., a surname, brand, or place name) or as part of a scientific/Latin-style name.","zh":"不是常见英语词典里的标准词；多见作专有名词（如姓氏、品牌、地名），或作为科学/拉丁式名称的一部分。"},"examples":[{"en":"I couldn’t find a clear English dictionary definition for “Ponica.” It may be a name or a specialized term.","zh":"我在英语词典里找不到“Ponica”的明确释义；它可能是专有名词或专业术语。"},{"en":"If you saw “Ponica” in a biology text, it might be part of a Latin scientific name.","zh":"如果你在生物学文本里看到“Ponica”，它可能是拉丁学名的一部分。"}]}],"phonetic":"ˈpɑnɪkə","extraExplanation":["“ponica”很可能是拼写误差：很多学习者会把 **japonica**（常见于“Japanese/Japonica rice，日本粳稻”等语境）漏写开头的“ja-”。如果你想查的是 **japonica** 或其他相近词（如 *poncho,onica* 等），把完整句子或上下文发我，我可以更准确解释。","如果“Ponica”是品牌/人名/地名：请告诉我它出现的国家/领域（例如食品、化妆品、公司名、地图位置），我会按该语境给出含义与用法。"]}
{"word":"ponied","summary":{"en":"“Ponied” most commonly means “paid or contributed money” (past of “pony up”). Less commonly, it refers to leading one horse from another while riding.","zh":"“ponied”最常见表示“掏钱/出钱”（“pony up”的过去式）。较少见时指骑着一匹马并牵引另一匹马同行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pony up”: to pay (especially reluctantly) or to contribute money.","zh":"（“pony up”的过去式/过去分词）付钱（常指不情愿地）；出钱分担。"},"examples":[{"en":"Everyone ponied up $10 for the gift.","zh":"大家每人都出了10美元买礼物。"},{"en":"He finally ponied up and paid the fine.","zh":"他最后还是掏钱把罚款交了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pony”: to lead or carry a rider while another horse is led by a person (often by a rope), especially in training or travel.","zh":"（“pony”的过去式/过去分词）（尤指训练或赶路时）用一匹马载人，同时牵引另一匹马同行。"},"examples":[{"en":"They ponied the young horse along the trail to get it used to the route.","zh":"他们牵着那匹小马沿小路同行，让它熟悉路线。"}]}],"synonyms":["paid","coughed up","chipped in","contributed"],"phonetic":"/ˈpoʊnid/","extraExplanation":["“pony up”在美式英语里很常见，语气偏口语，有点像中文里的“掏钱吧/该你出钱了”。常用于朋友间分摊费用、买单、交罚款等场景。","字面上“pony”是“小马”，但“pony up”的“付钱”含义属于习语用法，通常不按字面理解。"]}
{"word":"ponier","summary":{"en":"Ponier is a rare/old spelling of pannier: a carrying basket, often one of a pair hung on the sides of an animal or bicycle.","zh":"Ponier 是 pannier 的罕见/旧拼写：指用来装载物品的篮筐，常成对挂在牲畜或自行车两侧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old spelling of “pannier”) A basket—often one of a pair—used for carrying goods, especially hung on the sides of a horse, donkey, bicycle, or motorcycle.","zh":"（罕见/旧拼写，等同于 pannier）篮筐；（常成对的）驮篮/车筐，用来装载物品，常挂在马、驴、自行车或摩托车两侧。"},"examples":[{"en":"The rider packed apples into the ponier on each side of the saddle.","zh":"骑手把苹果分别装进马鞍两侧的驮篮（ponier）里。"},{"en":"Touring cyclists often use rear paniers; older texts may spell it as “ponier.”","zh":"长途骑行者常用后车筐（paniers）；较旧的文字里有时拼作 ponier。"}]}],"synonyms":["pannier","basket","saddlebag"],"phonetic":"/ˈpæniər/","extraExplanation":["“ponier”在现代英语中非常少见，多见于方言或旧文献，是“pannier”的变体拼写。日常写作与考试中一般用更常见的拼法“pannier”。","不要和“pioneer”（开拓者；开创）混淆：两者拼写与读音相近，但意义完全不同。"]}
{"word":"ponies","summary":{"en":"“Ponies” most commonly means small horses (plural of pony). In informal use, it can also mean a small serving of alcohol.","zh":"“Ponies”最常指小马（pony的复数）；在非正式用法中，也可指一小杯酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small horses (the plural of “pony”), often used for riding by children or for light work; also used in shows and racing.","zh":"小马（“pony”的复数），常用于儿童骑乘或轻便工作；也可用于表演和赛马。"},"examples":[{"en":"The children rode ponies at the farm.","zh":"孩子们在农场骑小马。"},{"en":"She keeps two ponies in the stable behind her house.","zh":"她在房子后面的马厩里养了两匹小马。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A small amount of alcohol, especially a small glass or shot (varies by region).","zh":"（非正式）少量酒，尤指一小杯/一口（各地用法和容量可能不同）。"},"examples":[{"en":"He ordered a pony of brandy after dinner.","zh":"晚饭后他点了一小杯白兰地。"}]}],"synonyms":["small horses","ponies (riding)","(alcohol) shot","small glass"],"phonetic":"/ˈpoʊniz/","extraExplanation":["“pony”通常指体型比一般马小的马种（常以肩高衡量），不一定是“幼马”；幼马更常用“foal”（小马驹）。","在流行文化里，“ponies”也可能让人联想到《My Little Pony》（我的小马宝莉）等作品；如果你是在特定语境里看到这个词（比如动画、歌曲或俚语），我也可以帮你按语境解释。"]}
{"word":"ponja","summary":{"en":"“Ponja” is Spanish slang (not standard English) meaning “a Japanese person,” and it can be disrespectful in some contexts.","zh":"“ponja”是西语俚语（非标准英语），意为“日本人”，在某些语境中可能不礼貌或带冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish slang; sometimes offensive) a Japanese person; by extension, Japanese people or things from Japan. Not standard English, but you may see it in English text influenced by Spanish.","zh":"（西班牙语俚语；有时带冒犯意味）日本人；也可泛指日本的事物。不是标准英语，但可能出现在受西语影响的英文语境中。"},"examples":[{"en":"Some older slang in Latin America uses “ponja” to mean “a Japanese person,” but it can sound disrespectful.","zh":"在拉丁美洲一些较老的俚语里会用“ponja”指“日本人”，但听起来可能不尊重。"},{"en":"In formal writing, say “a Japanese person” instead of “ponja.”","zh":"在正式写作中，用“a Japanese person（日本人）”而不是“ponja”。"}]}],"synonyms":["Japanese person","Japanese (person)","person from Japan"],"phonetic":"ˈpoʊn.hɑ","extraExplanation":["“ponja”主要是西班牙语圈（尤其拉美部分地区）的口语/俚语，用来指日本人；在一些语境中可能带有刻板印象或贬义，因此与不熟的人、正式场合或公共表达中不建议使用。","如果你是在英文环境里看到它，通常是因为说话者/文本带有西语背景。更中性、安全的英文表达是：“Japanese person/people,” “Japanese,” 或“from Japan”。"]}
{"word":"ponograph","summary":{"en":"A phonograph is an early device for recording and playing sound (an old-style record player).","zh":"phonograph 指早期用于录音与播放声音的装置（老式唱机/留声机）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine (especially an early one) that records and plays back sound, using grooves on a cylinder or disc; an early record player.","zh":"留声机；（尤指早期的）用圆筒或唱片刻纹来录音并回放声音的机器。"},"examples":[{"en":"Thomas Edison invented the phonograph in 1877.","zh":"托马斯·爱迪生于1877年发明了留声机。"},{"en":"They listened to jazz on an old phonograph.","zh":"他们用一台老式留声机听爵士乐。"}]}],"synonyms":["record player","gramophone","turntable"],"phonetic":"/ˈfoʊnəˌɡræf/","extraExplanation":["你输入的“ponograph”很可能是拼写错误；常见正确拼写是 **phonograph**。","词源：**phono-**（声音）+ **-graph**（书写/记录），字面意思是“记录声音的东西”。","文化背景：早期留声机常用蜡筒（cylinder）录音，后来更常见的是唱片（disc）。在文学与影视中，留声机常用来营造“复古、怀旧”的氛围。"]}
{"word":"ponos","summary":{"en":"Ponos means “toil/strenuous labor” in Greek, and it can also refer to the mythological personification of labor.","zh":"Ponos 在希腊语中指“辛劳/苦工”，也可指希腊神话中“劳作”的拟人化形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek) hard work, toil, or strenuous effort; sometimes implying struggle or hardship.","zh":"（希腊语）辛劳、苦工、艰苦的努力；常带有“伴随痛苦/困难的奋斗”之意。"},"examples":[{"en":"In ancient Greek texts, ponos often describes the exhausting work of a hero.","zh":"在古希腊文本中，ponos 常用来描写英雄令人精疲力竭的劳作。"},{"en":"She achieved her goal through years of ponos and patience.","zh":"她通过多年的辛劳与耐心达成了目标。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mythology) Ponos, the personification of toil and labor in Greek mythology.","zh":"（神话）Ponos：希腊神话中“辛劳/劳作”的拟人化神祇。"},"examples":[{"en":"Ponos appears in some mythological lists as a figure representing labor.","zh":"在一些神谱或拟人化概念的列表中，Ponos 作为象征“劳作”的形象出现。"}]}],"synonyms":["toil","labor","drudgery","hardship","struggle"],"phonetic":"/ˈpoʊnɑːs/","extraExplanation":["Ponos（πόνος）是古希腊语词，常与“艰苦的劳动、忍耐的付出”相关；在更广泛的文化语境里，它可以指身体或精神层面的“吃苦”。","在现代学术写作（如古典学、哲学或文学研究）中，你可能会看到 ponos 用来讨论希腊人对“劳动、痛苦与成就”的观念。"]}
{"word":"pons","summary":{"en":"Pons most commonly means the “pons” (a bridge-like part of the brainstem). It can also be a Latin word meaning “bridge.”","zh":"Pons 最常指“脑桥”（脑干的一部分）。它也可以是拉丁语，意思是“桥”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of the brainstem that connects different parts of the brain and helps control breathing, sleep, and facial movements.","zh":"脑干的一部分，连接大脑不同区域，并参与调控呼吸、睡眠以及面部运动等功能。"},"examples":[{"en":"The MRI showed a small lesion in the pons.","zh":"核磁共振显示脑桥处有一个小病灶。"},{"en":"Damage to the pons can affect breathing and sleep.","zh":"脑桥受损可能影响呼吸和睡眠。"}]},{"partOfSpeech":"n.","definition":{"en":"A Latin word meaning “bridge,” sometimes used in academic or historical contexts (it is also the source of the English word “pont-,” as in “pontoon” or “pontiff”).","zh":"拉丁语中表示“桥”的词，有时在学术或历史语境中使用（也是英语词根 pont- 的来源，如 pontoon 或 pontiff）。"},"examples":[{"en":"In Latin, pons means “bridge.”","zh":"在拉丁语里，pons 的意思是“桥”。"},{"en":"The term appears in old inscriptions describing a pons across the river.","zh":"这个词出现在一些古代铭文中，用来描述一座跨河的桥。"}]}],"synonyms":["pons (Varolii)","brainstem structure","bridge (Latin sense)"],"phonetic":"/pɑnz/","extraExplanation":["在解剖学里，pons 常译为“脑桥”。它位于延髓（medulla）上方、中脑（midbrain）下方，是脑干的重要“中转站”，因此英文用“bridge（桥）”的拉丁词来命名很形象。","如果你在英语文章里看到 pons，大多数情况下指“脑桥”；若出现在拉丁语或古典研究语境，才更可能是“桥”的本义。"]}
{"word":"pont","summary":{"en":"“Pont” usually means “bridge” in French names; in rare medical shorthand it can relate to the brain’s pons.","zh":"“Pont”多用于法语名称中表示“桥”；极少数情况下在医学缩写里指与脑桥（pons）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bridge; used mainly in French loanwords and place names (e.g., Pont Neuf, Pont du Gard).","zh":"桥；主要出现在法语借词或地名中（如 Pont Neuf“新桥”、Pont du Gard“加尔桥”）。"},"examples":[{"en":"They walked across the Pont Neuf at sunset.","zh":"他们在日落时分走过巴黎的新桥（Pont Neuf）。"},{"en":"Many European towns have names starting with “Pont-,” referring to an old bridge.","zh":"欧洲不少城镇名称以“Pont-”开头，表示那里曾有一座古桥。"}]},{"partOfSpeech":"other","definition":{"en":"(informal/abbreviation, rare) short for “pontine,” relating to the pons (a part of the brainstem).","zh":"（非正式/缩写，少见）“pontine”的缩写，指与脑桥（pons，脑干的一部分）有关的。"},"examples":[{"en":"The report mentioned a pont lesion, meaning a pontine (pons-related) lesion.","zh":"报告提到“pont lesion”，意思是脑桥相关的病灶。"}]}],"synonyms":["bridge (in meaning)"],"phonetic":"/pɑnt/","extraExplanation":["“pont”在现代英语里不是常用词；你更常见到的是它出现在法语名称中（如景点、街道、桥名）。如果你想表达英文里的“桥”，最常用的词是 bridge。","词根提示：拉丁语 pons/pont- 表示“桥”，因此你会在一些英语词里看到它的影子，如 pontoon（浮桥/浮筒）、pontiff（教皇，词源上有“搭桥者/沟通者”的文化含义）。"]}
{"word":"pontac","summary":{"en":"Pontac is an old term for a famous red Bordeaux (Graves) wine, often mentioned in historical English writing.","zh":"Pontac是一个较古老的词，指曾在英国很有名的波尔多（格拉夫）红葡萄酒，常见于历史文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of red Bordeaux wine (from the Graves area) that was especially famous in England in the 1600s–1700s; also used more generally in older texts for a fine claret-like wine from that region.","zh":"一种波尔多（格拉夫 Graves 一带）的红葡萄酒，17–18世纪在英国尤为有名；在旧文献中也可泛指该地区的优质“波尔多红/类似克莱雷(Claret)的酒”。"},"examples":[{"en":"In the old novel, the gentlemen order a bottle of pontac after dinner.","zh":"在那本旧小说里，绅士们晚餐后点了一瓶pontac。"},{"en":"Historical records show pontac was a fashionable wine in London society.","zh":"史料显示，pontac曾是伦敦上流社会时髦的葡萄酒。"}]}],"synonyms":["Bordeaux (general)","claret (historical British usage)"],"phonetic":"/pɑnˈtæk/","extraExplanation":["“Pontac”常见于较早的英语作品与历史材料，和波尔多的酒庄/产区传统有关。它与“Pontack’s”（庞塔克餐馆，伦敦早期著名餐馆）在拼写与历史背景上有关联：当时一些英国文人会把葡萄酒名称、酒庄名与餐馆名联系在一起提及。","现代日常英语里几乎不再用“pontac”指葡萄酒；你更可能看到“Bordeaux”“claret”或具体酒庄/产区名称。"]}
{"word":"pontacq","summary":{"en":"Pontacq is a place name: a commune (small town) in southwestern France.","zh":"Pontacq 是地名：法国西南部的一个市镇（小镇/公社）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pontacq: a small town (commune) in southwestern France, in the Pyrénées-Atlantiques department, near the Pyrenees mountains.","zh":"Pontacq：法国西南部的一个小镇（市镇/公社），位于比利牛斯-大西洋省，靠近比利牛斯山脉。"},"examples":[{"en":"They stayed in Pontacq on their way to the Pyrenees.","zh":"他们去比利牛斯山途中在 Pontacq 住了一晚。"},{"en":"Pontacq is a quiet commune in the Pyrénées-Atlantiques region of France.","zh":"Pontacq 是法国比利牛斯-大西洋省一个安静的小市镇。"}]}],"phonetic":"/pɑnˈtɑk/","extraExplanation":["“Pontacq”是法语地名，英语里常按法语读音近似发音；如果你在地图、旅行路线或法国产品/地址中看到它，通常指这个地方而不是普通英语词汇。"]}
{"word":"pontage","summary":{"en":"Pontage is a rare medical term in English meaning a bypass (“bridge”) surgery, especially coronary bypass grafting.","zh":"Pontage 是英语中较少见的医学词，意思是“搭桥/旁路”手术，尤指冠状动脉搭桥移植。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in English, medicine) A bypass or “bridging” surgical procedure, especially coronary artery bypass grafting (CABG); also used for a graft/bridge that connects blood vessels.","zh":"（英语中较少见，医学）指“搭桥/旁路”手术，尤指冠状动脉搭桥术（CABG）；也可指用于连接血管的“桥/移植物”。"},"examples":[{"en":"He underwent a coronary pontage to restore blood flow to his heart.","zh":"他接受了冠状动脉搭桥手术，以恢复心脏的血流。"},{"en":"In the report, “pontage” refers to bypass grafting rather than medication.","zh":"在报告中，“pontage”指的是旁路移植（搭桥），而不是药物治疗。"}]}],"synonyms":["bypass surgery","bypass grafting","coronary artery bypass graft (CABG)","bridging"],"phonetic":"/pɑnˈtɑʒ/","extraExplanation":["“pontage”多见于法语医学语境（如 *pontage aorto-coronarien*），英语里通常直接说 *bypass surgery* 或 *coronary artery bypass graft (CABG)*。如果你是在英文材料里看到它，往往是作者沿用了法语术语或翻译腔。","词源提示：来自法语 *pont*（桥），核心意象是“搭一座桥”让血液绕过阻塞处。"]}
{"word":"pontal","summary":{"en":"Pontal most commonly means “related to the pons (brainstem)” in medical English; it can also be a Portuguese-based place name meaning a sandbar or point of land.","zh":"Pontal 在医学英语中多指“脑桥的”；也可作源自葡语的地名用法，含“沙嘴/岬角/伸出的陆地”之意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Relating to the pons, a part of the brainstem.","zh":"（解剖/医学）与脑桥（脑干的一部分）有关的；脑桥的。"},"examples":[{"en":"The MRI showed a small pontal lesion near the brainstem.","zh":"核磁共振显示脑干附近有一个小的脑桥病灶。"},{"en":"Doctors monitored pontal function because it can affect breathing and sleep.","zh":"医生监测脑桥功能，因为它可能影响呼吸和睡眠。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun) found especially in Portuguese-speaking regions; in Brazilian Portuguese, pontal can refer to a sandbar, spit, or point of land by the sea or a river.","zh":"（专有名词）常见于葡语地区的地名；在巴西葡语中，pontal 可指海边或河边的沙嘴、沙洲或伸入水中的陆地尖端。"},"examples":[{"en":"They spent the weekend in Pontal, a coastal community.","zh":"他们周末在 Pontal 这个海边社区度过。"},{"en":"The boat passed the pontal where the river meets the ocean.","zh":"船经过河海交汇处的那段沙嘴。"}]}],"synonyms":["pontine","pons-related"],"phonetic":"ˈpɑn.təl","extraExplanation":["在英语里，pontal 作为“脑桥的”非常少见，更常用的词是 pontine（如 pontine stroke=脑桥卒中）。如果你是在医学文章里看到 pontal，多半就是这个意思。","如果你是在地图、旅游内容或巴西相关语境里看到 Pontal，它通常是地名；而在葡语里 pontal 还可泛指“沙嘴/岬角/伸出的陆地”。"]}
{"word":"pontederia","summary":{"en":"Pontederia is a genus of aquatic plants, especially pickerelweed, common in ponds and wetlands.","zh":"Pontederia 指一种水生植物属，尤指常见的梭鱼草/雨久花，多见于池塘与湿地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aquatic flowering plants (family Pontederiaceae), especially the plant commonly known as pickerelweed, often found in ponds and wetlands with showy purple-blue flower spikes","zh":"一种水生开花植物属（雨久花科 Pontederiaceae），尤指常见的“梭鱼草/雨久花（pickerelweed）”，多生长在池塘与湿地，开紫蓝色穗状花"},"examples":[{"en":"Pontederia grows well along the edges of ponds and slow-moving rivers.","zh":"Pontederia 常生长在池塘与缓流水域的边缘。"},{"en":"The wetland restoration plan includes pontederia to provide habitat for insects and frogs.","zh":"湿地修复计划把 pontederia 纳入种植清单，用来为昆虫和青蛙提供栖息地。"}]}],"synonyms":["pickerelweed (common name, esp. Pontederia cordata)"],"phonetic":"/ˌpɑn.təˈdɪr.i.ə/","extraExplanation":["“Pontederia”这个属名来自意大利植物学家 Giulio Pontedera（朱利奥·蓬特代拉）的姓氏，属于以人名命名的拉丁学名。","在园艺与生态语境里，你更常见到它的通用名 pickerelweed（常译“梭鱼草/雨久花”）。不同地区中文名可能不一致，建议结合具体物种名（如 Pontederia cordata）确认。","注意：日常讨论“水葫芦/凤眼莲”时也可能看到旧的分类名称含 Pontederia，但现代分类多将其归入其他属（如 Eichhornia）。"]}
{"word":"pontederiaceae","summary":{"en":"Pontederiaceae is the botanical family name for the pickerelweed family—freshwater aquatic flowering plants.","zh":"Pontederiaceae 指雨久花科（梭鱼草科），一种淡水水生开花植物的植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of freshwater aquatic flowering plants (the pickerelweed family), including genera such as Pontederia; many members grow in ponds, lakes, and wetlands","zh":"雨久花科；一类淡水水生开花植物的科（又称“梭鱼草科”），包括雨久花属（Pontederia）等，常生长在池塘、湖泊与湿地"},"examples":[{"en":"Pontederiaceae includes several aquatic plants common in wetlands.","zh":"雨久花科包含多种常见于湿地的水生植物。"},{"en":"The botanist identified the specimen as belonging to Pontederiaceae.","zh":"植物学家将该标本鉴定为雨久花科植物。"}]}],"synonyms":["pickerelweed family"],"phonetic":"ˌpɑn.təˌdɪr.iˈeɪ.si.i","extraExplanation":["“Pontederiaceae”来自模式属名“Pontederia（雨久花属）”，后缀“-aceae”是植物科名的常见拉丁化结尾。","雨久花科植物多适应淡水环境，常见形态特点包括丛生叶、挺水或浮水习性，以及穗状或总状花序；在生态上可为水域提供栖息地并帮助稳定岸线。","学习提示：在植物分类里，科名通常以“-aceae”结尾（如 Rosaceae 蔷薇科、Fabaceae 豆科）。看到这个后缀，往往可以判断它是“某某科”。"]}
{"word":"pontederiaceous","summary":{"en":"A scientific adjective meaning “of the Pontederiaceae (pickerelweed/water-hyacinth) family.”","zh":"一个植物学形容词，意思是“雨久花科（梭鱼草/凤眼莲科）的；与该科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Pontederiaceae (the pickerelweed/water-hyacinth family), which includes aquatic plants often found in ponds, lakes, and wetlands.","zh":"与雨久花科（Pontederiaceae，常称“雨久花/凤眼莲科”或“梭鱼草科”）植物有关的；指该科的水生植物，常见于池塘、湖泊与湿地。"},"examples":[{"en":"Water hyacinth is a pontederiaceous plant that can spread quickly in warm waters.","zh":"凤眼莲是一种雨久花科植物，在温暖水域中可能快速蔓延。"},{"en":"The researcher compared pontederiaceous species across different wetlands.","zh":"研究人员比较了不同湿地中的雨久花科物种。"}]}],"synonyms":["Pontederiaceae (of the family)","pickerelweed-family (informal)"],"phonetic":"/ˌpɑn.təˌdɪr.iˈeɪ.ʃəs/","extraExplanation":["这个词主要用于植物学/生态学写作，日常英语里很少见。更常见的说法是直接用“Pontederiaceae”或具体植物名（如 water hyacinth 凤眼莲、pickerelweed 梭鱼草）。","词形上常见的学术形容词后缀是 -aceous，表示“……类的/……科的”（如 rosaceous“蔷薇科的”）。"]}
{"word":"pontee","summary":{"en":"“Pontee” usually refers to ponte knit: a thick, stretchy fabric used in clothing.","zh":"“Pontee”通常指“ponte knit”面料：一种较厚、有弹性的针织面料，常用于服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of thick, stretchy double-knit fabric (often spelled “ponte”), used for pants, dresses, and skirts","zh":"一种较厚、有弹性的双面针织面料（常也拼作“ponte”），常用于裤子、连衣裙、裙子等"},"examples":[{"en":"These work pants are made of pontee fabric, so they look formal but feel comfortable.","zh":"这条通勤裤是pontee面料的，看起来正式但穿着很舒服。"},{"en":"A pontee dress holds its shape better than many jersey dresses.","zh":"pontee连衣裙比很多平纹针织（jersey）裙更挺括不易变形。"}]},{"partOfSpeech":"adj.","definition":{"en":"made from pontee (ponte) knit fabric","zh":"由pontee（ponte）针织面料制成的"},"examples":[{"en":"She wore a pontee skirt with a simple white shirt.","zh":"她穿了一条pontee半身裙，配一件简单的白衬衫。"}]}],"synonyms":["ponte","ponte knit","ponte di roma"],"phonetic":"/ˈpɑn.ti/","extraExplanation":["“pontee”在时尚/服装语境里多被当作“ponte”的变体拼写；更常见的写法是“ponte knit”。","“ponte”来自意大利语表达“Ponte di Roma”（罗马桥），常指一种双面针织结构：比一般的jersey更厚、更挺、弹性也不错，因此很适合做修身但不紧绷的衣物。","如果你想问的是芭蕾中的“pointe”（脚尖/足尖立），那是另一个词，读音和意思都不同。你也可以告诉我你看到“pontee”的具体句子，我可以帮你确认。"]}
{"word":"pontes","summary":{"en":"“Pontes” is most commonly a surname in English contexts; “pontes” can also be the Portuguese plural of “ponte” (“bridges”).","zh":"“Pontes” 在英语里多作姓氏；“pontes” 也可能是葡语“ponte（桥）”的复数，意为“桥梁（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pontes (proper noun): a family name (surname), often found in Portuguese- or Spanish-speaking contexts.\nExample: “Dr. Pontes will present the research today.” / “Pontes 博士今天会做研究报告。”","zh":"Pontes（专有名词）：一个姓氏，常见于葡语或西语文化语境中。\n例： “Dr. Pontes will present the research today.” / “Pontes 博士今天会做研究报告。”"},"examples":[{"en":"Dr. Pontes will present the research today.","zh":"Pontes 博士今天会做研究报告。"},{"en":"I met Ms. Pontes at the conference.","zh":"我在会议上认识了 Pontes 女士。"}]},{"partOfSpeech":"other","definition":{"en":"pontes (non-English form): the Portuguese plural of “ponte,” meaning “bridges.” In English writing, you might see it in Portuguese place names or texts.\nExample: “As pontes da cidade são antigas.” / “这座城市的桥梁很古老。”","zh":"pontes（非英语形式）：葡萄牙语中 “ponte（桥）” 的复数，意思是“桥梁、桥（复数）”。英语文章里多见于葡语地名或引用的葡语文本中。\n例： “As pontes da cidade são antigas.” / “这座城市的桥梁很古老。”"},"examples":[{"en":"As pontes da cidade são antigas.","zh":"这座城市的桥梁很古老。"},{"en":"The guidebook described the pontes along the river (Portuguese term).","zh":"导游手册描述了河边的 pontes（葡语：桥梁）。"}]}],"synonyms":["(surname) none","(Portuguese meaning) bridges"],"phonetic":"/ˈpɑn.tɛz/","extraExplanation":["在英语里，Pontes 最常作为“姓氏”出现（首字母大写）。若在旅行、历史或地名中看到小写的 pontes，往往是在引用葡萄牙语（“桥”的复数）。","发音会因语言而变：英语环境中通常按英语习惯读；在葡萄牙语中则会有鼻化元音等特点（与英语读法不同）。"]}
{"word":"pontiac","summary":{"en":"Pontiac can refer to a discontinued GM car brand, a city in Michigan, or a Native American leader linked to Pontiac’s War.","zh":"Pontiac 可指已停产的通用汽车品牌、密歇根州城市，或与“庞蒂亚克战争”相关的原住民领袖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former American car brand (by General Motors), known for sporty models; the brand was discontinued in 2010.","zh":"（庞蒂亚克）美国通用汽车旗下的一个汽车品牌，以运动型车型著称；该品牌已于2010年停产。"},"examples":[{"en":"My uncle used to drive a Pontiac Firebird in the 1980s.","zh":"我叔叔在20世纪80年代曾开过一辆庞蒂亚克 Firebird。"},{"en":"Pontiac was one of GM’s well-known performance brands.","zh":"庞蒂亚克曾是通用汽车旗下知名的性能取向品牌之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A city in Michigan, USA (near Detroit).","zh":"美国密歇根州的一座城市（靠近底特律）。"},"examples":[{"en":"She grew up in Pontiac, Michigan, and later moved to Detroit.","zh":"她在密歇根州的庞蒂亚克长大，后来搬到底特律。"},{"en":"The conference will be held in Pontiac next month.","zh":"会议将于下个月在庞蒂亚克举行。"}]},{"partOfSpeech":"n.","definition":{"en":"A Native American leader (Ottawa) associated with Pontiac’s War (1763), a major resistance movement against British rule in the Great Lakes region.","zh":"（庞蒂亚克）一位与“庞蒂亚克战争”（1763年）相关的美洲原住民（渥太华族）领袖；该战争是五大湖地区反抗英国统治的重要运动。"},"examples":[{"en":"In history class, we learned about Pontiac and the conflict that followed the Seven Years’ War.","zh":"历史课上我们学到了庞蒂亚克，以及七年战争之后发生的冲突。"},{"en":"Pontiac’s War changed relationships between Native nations and European powers in the region.","zh":"庞蒂亚克战争改变了当地原住民族与欧洲列强之间的关系。"}]}],"synonyms":["(car brand) GM Pontiac","(place) Pontiac, Michigan"],"phonetic":"/ˈpɑn.ti.æk/","extraExplanation":["“Pontiac”这个名字常被用作地名与品牌名。汽车品牌“Pontiac”据说取名于庞蒂亚克（Pontiac）这位原住民领袖，以呼应北美历史与地区文化。","作为地名时，Pontiac 常指密歇根州的 Pontiac；在日常对话里若听到“a Pontiac”，通常指“庞蒂亚克牌汽车”。"]}
{"word":"pontiacs","summary":{"en":"Pontiacs usually means Pontiac-brand cars; it can also mean people from Pontiac (e.g., Pontiac, Michigan).","zh":"Pontiacs 通常指庞蒂亚克品牌的汽车；也可指来自 Pontiac（如密歇根州庞蒂亚克市）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Pontiac brand cars or vehicles made by Pontiac (a former division of General Motors).","zh":"（复数）庞蒂亚克（Pontiac）品牌的汽车；庞蒂亚克生产的车辆（通用汽车旗下的已停产品牌）。"},"examples":[{"en":"My uncle collected old Pontiacs from the 1960s.","zh":"我叔叔收藏了很多 20 世纪 60 年代的老款庞蒂亚克汽车。"},{"en":"You still see classic Pontiacs at local car shows.","zh":"在本地车展上仍然能看到经典的庞蒂亚克车型。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) People from Pontiac (especially Pontiac, Michigan), or things related to that place.","zh":"（复数）来自 Pontiac（常指密歇根州庞蒂亚克市）的人；与该地相关的事物。"},"examples":[{"en":"Many Pontiacs commute to Detroit for work.","zh":"很多庞蒂亚克市的居民通勤去底特律工作。"},{"en":"The article interviewed several Pontiacs about the new policy.","zh":"这篇文章采访了几位庞蒂亚克市的居民，了解他们对新政策的看法。"}]}],"synonyms":["Pontiac cars","Pontiac vehicles","residents of Pontiac"],"phonetic":"/ˈpɑn.ti.æks/","extraExplanation":["“Pontiac”最常见的文化指向是美国汽车品牌 Pontiac（庞蒂亚克），曾是通用汽车（GM）旗下品牌，后来在 2010 年左右停止生产，因此现在常出现在“经典车/老爷车（classic cars）”语境中。","“Pontiac”也可以指地名（如密歇根州的 Pontiac 市）；当用作“Pontiacs”时，有时表示该地居民。","词源上，“Pontiac”还与 18 世纪渥太华族（Odawa）领袖 Pontiac 同名；在历史语境中可能出现，但日常英语里“Pontiacs”更常被理解为汽车或居民。"]}
{"word":"pontianac","summary":{"en":"Pontiac can refer to a former GM car brand, a city in Michigan, or an 18th-century Ottawa leader.","zh":"Pontiac 可指：通用旗下已停产的汽车品牌、密歇根州城市，或18世纪渥太华族领袖庞蒂亚克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former American car brand (a division of General Motors), known for sporty models; the brand was discontinued in 2010","zh":"庞蒂亚克（Pontiac）：曾隶属通用汽车（GM）的美国汽车品牌，以运动风格车型闻名，2010年停产"},"examples":[{"en":"My uncle used to drive a Pontiac Firebird in the 1990s.","zh":"我叔叔在90年代开过一辆庞蒂亚克 Firebird。"},{"en":"Pontiac was one of GM’s well-known brands for decades.","zh":"庞蒂亚克曾是通用汽车几十年来很有名的品牌之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in Michigan, USA (near Detroit)","zh":"美国密歇根州的一座城市（靠近底特律）"},"examples":[{"en":"She lives in Pontiac, Michigan, and commutes to Detroit.","zh":"她住在密歇根州的庞蒂亚克，每天通勤去底特律。"}]},{"partOfSpeech":"n.","definition":{"en":"an 18th-century Ottawa leader (often called Chief Pontiac) associated with Indigenous resistance to British rule in the Great Lakes region; also used as a given name or reference to him","zh":"庞蒂亚克（常称“庞蒂亚克酋长”）：18世纪渥太华族领袖，与五大湖地区原住民反抗英国统治的行动相关；也可作人名或对其本人的指称"},"examples":[{"en":"Pontiac is remembered for leading a major uprising in 1763.","zh":"庞蒂亚克因在1763年领导一次重要起义而被人们记住。"},{"en":"The museum had an exhibit about Pontiac and the Great Lakes region.","zh":"博物馆有一个关于庞蒂亚克和五大湖地区的展览。"}]}],"synonyms":["GM (context: company)","General Motors (context: company)"],"phonetic":"/ˈpɑn(t)iˌæk/","extraExplanation":["你输入的“pontianac”很可能是拼写错误。常见的正确拼写有：Pontiac（庞蒂亚克：车品牌/美国城市/历史人物）以及 Pontianak（坤甸：印度尼西亚加里曼丹的一座城市）。如果你想查的是印尼城市“Pontianak”，告诉我我可以按那个词条解释。","Pontiac 这个名字来自一位18世纪的渥太华族（Ottawa）领袖；后来也被用作地名与汽车品牌名。"]}
{"word":"pontianak","summary":{"en":"Pontianak can mean (1) a city in West Kalimantan, Indonesia, or (2) a female ghost in Malay/Indonesian folklore (often linked to the term kuntilanak).","zh":"Pontianak 可指（1）印尼西加里曼丹的城市“坤甸”，也可指（2）马来/印尼民间传说中的女性鬼魅（常与 kuntilanak 相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in West Kalimantan, Indonesia, on the island of Borneo, known for being near the Equator (it has an “Equator Monument”).","zh":"坤甸（Pontianak），印度尼西亚西加里曼丹省的城市，位于婆罗洲，以靠近赤道而闻名（有“赤道纪念碑”）。"},"examples":[{"en":"Pontianak sits close to the Equator, so the days and nights are almost the same length year-round.","zh":"坤甸靠近赤道，所以全年昼夜长度几乎一样。"},{"en":"She flew from Jakarta to Pontianak for a family visit in West Kalimantan.","zh":"她从雅加达到坤甸，去西加里曼丹探亲。"}]},{"partOfSpeech":"n.","definition":{"en":"in Malay and Indonesian folklore, a female vampire-like ghost, often linked to stories of childbirth and haunting; also spelled “pontianak” or “kuntilanak” depending on the region.","zh":"在马来与印尼民间传说中，一种女性吸血鬼式的幽灵，常与生产、怨灵与作祟的故事相关；不同地区也常写作 pontianak 或称 kuntilanak（昆蒂拉纳克）。"},"examples":[{"en":"In the movie, the characters believe a pontianak haunts the old house at night.","zh":"在电影里，角色们相信夜里有“坤甸鬼”在老房子作祟。"},{"en":"Some folktales warn travelers not to whistle in the dark, or a pontianak may come closer.","zh":"一些民间故事告诫旅人不要在黑暗中吹口哨，否则“坤甸鬼”可能会靠近。"}]}],"synonyms":["Kuntilanak","Pontianak (city)"],"phonetic":"/ˌpɑn.tiˈɑ.nɑk/","extraExplanation":["“Pontianak（坤甸）”这个地名在当地传说中常被解释为与“pontianak/kuntilanak（女鬼）”有关，因此城市名称在旅游与民俗叙事中常被拿来做文化联想；但在正式地理语境中它就是印尼的一座城市名。","“kuntilanak”在印尼语流行文化（电影、恐怖故事、游戏）中更常见；英语文本里两种拼法都可能出现，读者需根据上下文判断是“城市”还是“传说中的女鬼”。"]}
{"word":"pontic","summary":{"en":"Pontic means “related to Pontus/the Black Sea region” or “related to Pontic Greeks and their culture/language.”","zh":"Pontic 指“与本都/黑海地区有关的”，也指“与本都希腊人及其文化、语言有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Black Sea region, especially the ancient area called Pontus (on the southern coast of the Black Sea, in modern-day Turkey).","zh":"（形容词）与黑海地区有关的，尤指古代称为“本都”（Pontus，今土耳其黑海南岸一带）的地区。"},"examples":[{"en":"Archaeologists found Pontic-era coins near the Black Sea coast.","zh":"考古学家在黑海沿岸附近发现了本都时期的硬币。"},{"en":"The museum has a small collection of Pontic artifacts from northern Anatolia.","zh":"这家博物馆收藏了一小批来自安纳托利亚北部的本都文物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pontic Greeks (a Greek community historically from the Black Sea coast) or to their culture and language varieties (such as Pontic Greek).","zh":"（形容词）与本都希腊人（历史上生活在黑海沿岸的希腊族群）或其文化、语言（如本都希腊语）有关的。"},"examples":[{"en":"She is researching Pontic Greek songs and oral traditions.","zh":"她正在研究本都希腊语歌曲和口述传统。"},{"en":"A Pontic dance was performed at the cultural festival.","zh":"文化节上表演了一支本都舞蹈。"}]}],"synonyms":["Black Sea (related)","Pontus-related","Pontic Greek (in context)"],"phonetic":"/ˈpɑn.tɪk/","extraExplanation":["“Pontic”来自“Pontus”，而Pontus一词源于希腊语 *póntos*（意为“海”），在历史语境中常指黑海沿岸的“本都地区”。","现代英语里“Pontic”常见于历史、考古、民族与语言学写作，例如“Pontic Kingdom（本都王国）”“Pontic Greek（本都希腊语/本都希腊人）”。"]}
{"word":"ponticello","summary":{"en":"Ponticello is a music term meaning playing near the bridge of a string instrument for a bright, thin tone; it can also mean the bridge itself.","zh":"Ponticello 是音乐术语，指弦乐器靠近琴桥处演奏以获得尖亮、发薄的音色；也可指琴桥本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in music, especially for string instruments) A playing technique or direction meaning “at/near the bridge,” producing a thin, bright, sometimes eerie sound.","zh":"（音乐术语，尤指弦乐器）一种演奏法或指示，意为“在/靠近琴桥处拉（弹）”，音色会更尖亮、发薄，常带神秘或紧张感。"},"examples":[{"en":"The composer marks sul ponticello to create a whispery, glassy tone.","zh":"作曲家标注“sul ponticello”来制造一种轻声、玻璃般的音色。"},{"en":"In the film score, the violins move to ponticello during the suspense scene.","zh":"在电影配乐里，悬疑段落时小提琴改用靠近琴桥的演奏法。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) The bridge of a string instrument (Italian: ponticello).","zh":"（英语中较少见）弦乐器的琴桥（意大利语：ponticello）。"},"examples":[{"en":"The luthier adjusted the strings near the ponticello.","zh":"制琴师在琴桥附近调整了琴弦。"}]}],"synonyms":["sul ponticello","near the bridge","pont."],"phonetic":"/ˌpɑn.tɪˈtʃɛl.oʊ/","extraExplanation":["“Ponticello”来自意大利语，字面意思是“小桥”，在乐器上指“琴桥”。乐谱里更常见的是完整写法“sul ponticello”（在琴桥上/靠近琴桥处），有时会简写为“pont.”。","与之相对的常见指示是“sul tasto”（靠近指板处演奏），音色更柔和、更圆润。作曲家常用“ponticello ↔ tasto”的切换来制造气氛变化，尤其在现代音乐与影视配乐中。","常见相关写法：“ordinario”（恢复正常拉奏位置/音色），表示从 ponticello 等特殊音色回到普通音色。"]}
{"word":"ponticellos","summary":{"en":"“Ponticellos” means multiple instances of playing string instruments near the bridge for a bright, edgy tone.","zh":"“Ponticellos”指多处/多段靠近琴桥的弦乐奏法，用来获得明亮、尖锐的音色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ponticello: in string playing, passages performed at or near the bridge (often marked sul ponticello) to produce a bright, thin, sometimes eerie sound.","zh":"ponticello 的复数：弦乐演奏中指在琴桥附近演奏（常写作 sul ponticello），产生明亮、偏尖、甚至带诡异感的音色。"},"examples":[{"en":"The score asks for ponticellos in the violins to create a glassy shimmer.","zh":"乐谱要求小提琴用 ponticellos（靠琴桥奏法）来制造一种玻璃般的闪烁感。"},{"en":"The composer contrasts warm legato lines with sudden ponticellos.","zh":"作曲家把温暖的连奏旋律与突然出现的 ponticellos 形成对比。"}]}],"synonyms":["sul ponticello (marking)","bridge playing (informal)"],"phonetic":"/ˌpɑn.tɪˈtʃɛ.loʊ/","extraExplanation":["这是意大利语音乐术语。ponticello 原意与“桥”（琴桥）有关；在谱面上更常见的写法是 sul ponticello（在琴桥上/靠近琴桥）。其反向常见标记是 sul tasto（靠指板），音色更柔和。","在现代与当代古典音乐里，ponticello 常用来营造紧张、寒冷、金属感或“悬疑”氛围，电影配乐里也很常见。"]}
{"word":"ponticular","summary":{"en":"Ponticular is a rare adjective meaning “related to a bridge” or “acting as a connecting bridge.”","zh":"Ponticular 是个罕用形容词，意思是“与桥有关”或“起连接桥梁作用”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a bridge; serving as a bridge or connection between two things.","zh":"（罕用）与桥有关的；起“桥梁/连接”作用的。"},"examples":[{"en":"In his essay, the author uses one story as a ponticular link between two historical periods.","zh":"在文章中，作者用一个故事作为连接两个历史时期的“桥梁”。"},{"en":"The old stone structure had a ponticular function, allowing people to cross the river.","zh":"那座古老的石造结构起到桥的作用，让人们得以过河。"}]}],"synonyms":["bridging","connective","linking","pontic"],"phonetic":"/pɑnˈtɪkjələr/","extraExplanation":["“ponticular”在现代英语中非常少见，多出现在较旧的文本或刻意使用的写作里。词根来自拉丁语 pons/pont-（“桥”）。","很多学习者会把它和常用词 particular（“特别的/特定的”）混淆；如果你想表达“特别的”，通常应使用 particular。"]}
{"word":"ponticulus","summary":{"en":"Ponticulus is an anatomical term meaning a small “bridge,” most often referring to a bony bridge on the atlas (C1) called ponticulus posticus.","zh":"Ponticulus 是解剖学术语，指“像小桥一样的连接结构”，最常见特指寰椎（C1）的后弓骨桥（ponticulus posticus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bridge-like structure in the body (an anatomical term, from Latin for “little bridge”).","zh":"（解剖学用语）身体里呈“桥状”的小骨桥/小连接结构（源自拉丁语，意为“ 小桥 ”）。"},"examples":[{"en":"In anatomy, a ponticulus can describe a small bony bridge connecting two parts of a bone.","zh":"在解剖学中，ponticulus 可用来指连接骨头两部分的一小段骨桥。"},{"en":"The report noted a ponticulus near the vertebral arch.","zh":"报告提到椎弓附近有一个小骨桥（ponticulus）。"}]},{"partOfSpeech":"n.","definition":{"en":"(most commonly) ponticulus posticus: a bony bridge on the first cervical vertebra (C1, the atlas) that may form a ring over the vertebral artery groove.","zh":"（最常见用法）ponticulus posticus（“后弓骨桥”）：出现在第一颈椎（寰椎，C1）上的骨性桥，可能在椎动脉沟上方形成环状结构。"},"examples":[{"en":"A CT scan showed a ponticulus posticus on the atlas.","zh":"CT 显示寰椎上存在 ponticulus posticus（后弓骨桥）。"},{"en":"Some clinicians check for ponticulus posticus before certain neck manipulations.","zh":"一些临床人员会在进行某些颈部操作前检查是否存在 ponticulus posticus。"}]}],"synonyms":["bony bridge","osseous bridge","(specific) ponticulus posticus","(broader) arch"],"phonetic":"/pɑnˈtɪkjələs/","extraExplanation":["词源：来自拉丁语 ponticulus，是 pons（桥）的指小词，字面意思是“ 小桥 ”，所以常用来形容“像桥一样连接两处”的小结构。","使用场景：该词多见于解剖学、影像学、脊柱相关文献中，日常英语里很少使用。","临床提示（背景知识）：ponticulus posticus 属于常见的解剖变异之一；在某些操作或置钉评估中，医生可能会特别关注它与椎动脉沟/周围结构的关系。"]}
{"word":"pontifex","summary":{"en":"Pontifex is a Latin word meaning a high priest in ancient Rome; later it also came to mean the pope or a high church leader.","zh":"Pontifex 是拉丁词：原指古罗马的大祭司；后来也可指教皇或高级教会领袖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, a high priest; especially a member of the College of Pontiffs who supervised religious law and public rituals.","zh":"（古罗马）大祭司；尤指“祭司团”（College of Pontiffs）的成员，负责宗教法与公共祭仪。"},"examples":[{"en":"Julius Caesar once served as a pontifex maximus, the chief priest of Rome.","zh":"尤利乌斯·凯撒曾担任过 pontifex maximus（最高祭司），是罗马的首席祭司。"},{"en":"As a pontifex, he oversaw sacred calendars and state ceremonies.","zh":"作为一名 pontifex，他负责管理神圣历法与国家仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"(In later Christian use) The pope; more broadly, a bishop or high church leader.","zh":"（后期基督宗教用法）教皇；更广义指主教或高级教会领袖。"},"examples":[{"en":"Some writers use pontifex as a formal Latin word for the pope.","zh":"一些作者把 pontifex 当作教皇的正式拉丁称呼。"},{"en":"In older texts, “pontifex” can refer to a senior churchman.","zh":"在较旧的文本中，“pontifex”也可指一位资深的教会人士。"}]}],"synonyms":["pontiff","high priest","pope"],"phonetic":"/ˈpɑn.təˌfɛks/","extraExplanation":["词源常被解释为“架桥者”（pons=桥，facere=做），引申为“在人与神之间搭桥的人”，因此常用来比喻“调停者/连接者”。","最常见的固定搭配是 pontifex maximus（最高祭司）。这个头衔后来被罗马皇帝采用；基督宗教语境中常与教皇相关。","英语里 pontifical（教皇的；自以为是的）与 pontiff（教皇）都和 pontifex 同源。注意 pontifical 在日常语境里可能带贬义，表示“摆架子、说教式”。"]}
{"word":"pontiff","summary":{"en":"Pontiff most commonly means the Pope (the leader of the Roman Catholic Church).","zh":"pontiff 最常指“教皇”（罗马天主教会的领袖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pope; the bishop of Rome and spiritual leader of the Roman Catholic Church","zh":"教皇；罗马主教，罗马天主教会的精神领袖"},"examples":[{"en":"The pontiff addressed the crowd from the balcony of St. Peter’s Basilica.","zh":"教皇在圣彼得大教堂的阳台上向人群致意。"},{"en":"Many Catholics look to the pontiff for guidance on faith and morals.","zh":"许多天主教徒会向教皇寻求信仰与道德方面的指引。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a high priest or religious leader, especially in ancient Rome","zh":"（较少用）大祭司或宗教领袖，尤指古罗马的祭司"},"examples":[{"en":"In Roman history, a pontiff could be a member of the priestly college.","zh":"在罗马历史中，pontiff 也可指祭司团的成员。"}]}],"synonyms":["pope","Holy Father","bishop of Rome"],"phonetic":"/ˈpɑn.tɪf/","extraExplanation":["词源上，pontiff 来自拉丁语 pontifex，常被解释为“桥的建造者”（pons=桥，facere=做）。在宗教语境里，这个“桥”常被引申为连接人与神（或世俗与神圣）的象征。","在英语新闻或正式写作中，pontiff 多用来指“教皇”，带有较正式、庄重的语体色彩；日常更常直接说 the Pope。"]}
{"word":"pontiffs","summary":{"en":"“Pontiffs” is the plural of “pontiff,” most commonly meaning popes; more generally, it can mean high-ranking priests or religious leaders (especially in ancient Rome).","zh":"pontiffs 是 pontiff 的复数，最常指历任教皇；更广义上也可指高级祭司或宗教领袖（尤指古罗马）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pope; the bishop of Rome, leader of the Roman Catholic Church","zh":"（特指）教皇；罗马天主教会的领袖（罗马主教）"},"examples":[{"en":"Many Catholics listened closely to the pontiff’s message of peace.","zh":"许多天主教徒认真聆听教皇关于和平的讲话。"},{"en":"The pontiff met with world leaders to discuss humanitarian aid.","zh":"教皇与各国领导人会面，讨论人道主义援助。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal) a high-ranking priest; a religious leader, especially in ancient Rome","zh":"（正式）高级祭司；宗教领袖（尤指古罗马时期）"},"examples":[{"en":"In ancient Rome, pontiffs supervised important religious ceremonies.","zh":"在古罗马，祭司（pontiffs）负责监督重要的宗教仪式。"},{"en":"The novel describes the pontiffs as guardians of tradition.","zh":"小说把这些高级祭司描写为传统的守护者。"}]}],"synonyms":["popes","Holy Fathers","bishops","high priests"],"phonetic":"/ˈpɑn.tɪfs/","extraExplanation":["“pontiff”来自拉丁语 pontifex，常被解释为“造桥者”（pons=桥，facere=做）。在文化语境中，它暗示“在神与人之间搭桥”的宗教角色。","英语里最常见的用法是专指教皇（the Pontiff / the Supreme Pontiff）。复数 pontiffs 通常指历任教皇，或在历史语境中指多位高级祭司。","搭配提示：papal pontiff（教皇）、the Roman Pontiff（罗马教皇）、pontifical duties（教皇/主教的礼仪职责）。注意 pontifical 也可形容人“自以为权威、装腔作势”，带贬义。"]}
{"word":"pontific","summary":{"en":"Pontific means “related to the pope” (formal) and can suggest a highly authoritative, pope-like tone.","zh":"pontific 指“与教皇有关的”（正式用语），也可引申为带有很强权威感、像教皇一样的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) relating to a pope (a \"pontiff\") or to the authority and style of the pope.","zh":"（正式用语）与教皇（pontiff）有关的；教皇的；带有教皇权威/风格的。"},"examples":[{"en":"The museum displayed pontific robes and ceremonial objects.","zh":"博物馆展出了教皇的礼服和仪式用品。"},{"en":"The document used a pontific tone, as if speaking with unquestionable authority.","zh":"这份文件语气带有“教皇式”的权威感，仿佛不容置疑。"}]}],"synonyms":["pontifical","papal","ecclesiastical"],"phonetic":"/pɑnˈtɪfɪk/","extraExplanation":["“pontific”在现代英语里比较少见，更常见的是：\n- “pontifical”（形容词）：教皇的；或（贬义）自以为权威的、说教式的。\n- “pontificate”（动词）：（常带贬义）夸夸其谈、摆架子、像权威一样训人。日常表达里，如果你想说“爱说教/自命不凡地发言”，通常用“pontificate”。","词源提示：来自拉丁语“pontifex”（大祭司、教皇），因此这类词常带“宗教权威/仪式感”的色彩，也引申出“摆出权威姿态”的语气。"]}
{"word":"pontifical","summary":{"en":"Pontifical usually means “related to the Pope,” and it can also mean “preachy or self-important in tone.”","zh":"pontifical 通常指“与教皇有关的”，也可指“说教式、显得自以为是的语气”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pope or to the Roman Catholic Church’s highest authority.","zh":"与教皇有关的；与罗马天主教最高权威有关的。"},"examples":[{"en":"The cathedral hosted a pontifical Mass led by the archbishop.","zh":"这座大教堂举行了一场由大主教主礼的教皇礼仪弥撒。"},{"en":"A pontifical statement was released from the Vatican.","zh":"梵蒂冈发布了一份教皇官方声明。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often critical) Speaking in a way that sounds overly confident, moralizing, or self-important, as if you are always right.","zh":"（常含贬义）以自以为是、说教式的口吻讲话；显得高高在上。"},"examples":[{"en":"He became pontifical during the meeting, lecturing everyone about what to do.","zh":"他在会议上变得很说教，对大家指指点点讲该怎么做。"},{"en":"Try not to sound pontifical when you give advice.","zh":"你提建议时尽量别显得太居高临下。"}]}],"synonyms":["papal","Vatican","ecclesiastical","authoritative","preachy"],"phonetic":"/ˌpɑnˈtɪfɪkəl/","extraExplanation":["这个词来自拉丁语 pontifex（意为“祭司/大祭司”）。在英语里既可用于宗教语境（与教皇或教廷礼仪相关），也可引申为“像权威人士一样说教”的语气，因此第二个含义在日常交流中多带批评色彩。"]}
{"word":"pontificalia","summary":{"en":"Pontificalia are the ceremonial vestments and official items associated with the pope (and sometimes bishops).","zh":"pontificalia 指教宗（亦可指主教）在正式宗教仪式中使用的礼仪服饰与徽记用品的总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the official vestments, insignia, and ceremonial items used by the pope (or sometimes by bishops) in formal religious ceremonies","zh":"（教宗，亦可指主教）在隆重宗教仪式中使用的正式礼服、徽记与礼仪用品（如法衣、权杖等）的总称"},"examples":[{"en":"During the Mass, the pope appeared wearing full pontificalia.","zh":"在弥撒中，教宗以全套教宗礼仪服饰与徽记出场。"},{"en":"The museum displayed pontificalia from different centuries, including richly embroidered vestments.","zh":"博物馆展出了不同时代的教宗礼仪用品，包括刺绣华美的法衣。"}]}],"synonyms":["papal vestments","episcopal vestments","liturgical vestments","insignia"],"phonetic":"ˌpɑn.təˈfɪk.eɪ.li.ə","extraExplanation":["该词源自拉丁语传统（与“pontifical/教宗的、主教的”同源）。英语里常见于宗教史、艺术史、博物馆说明和正式报道中，语体偏正式。","用法提示：pontificalia 通常作为集合名词使用，常被理解为“整套礼仪服饰与徽记”；在句中可当作复数概念处理（如“the pontificalia were…”），但也常见把它当作整体看作单数（如“the pontificalia was on display”），以写作风格与语境为准。","相关词：pontifical（adj. 教宗的/主教的；也可指“自以为是、摆架子”的语气）与本词的宗教含义有关，但日常“pontifical tone（居高临下的口吻）”是引申义，与礼仪用品不同。"]}
{"word":"pontificalibus","summary":{"en":"“pontificalibus” is a Latin term used (mostly as “in pontificalibus”) meaning “wearing full ceremonial church vestments.”","zh":"“pontificalibus”是拉丁语用法（多见于“in pontificalibus”），意思是“身着全套隆重的教会礼仪服饰（主教/教宗礼服）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Latin (usually in the phrase “in pontificalibus”): wearing full ceremonial vestments (especially of a bishop or the pope). Example: “The bishop processed in pontificalibus.” / “主教身着全套主教礼服列队前行。”","zh":"拉丁语（多见于短语“in pontificalibus”）：指（尤指主教或教宗）身着全套隆重的礼仪服饰。例： “The bishop processed in pontificalibus.” / “主教身着全套主教礼服列队前行。”"},"examples":[{"en":"The cathedral was filled with incense as the bishop appeared in pontificalibus.","zh":"当主教身着全套主教礼服现身时，大教堂里弥漫着乳香。"},{"en":"In old church records, you may read that an abbot officiated in pontificalibus on feast days.","zh":"在旧教会档案中，你可能会看到：某位隐修院院长在节庆日“身着主教礼服”主持礼仪。"}]}],"synonyms":["in pontificals","in full regalia","in ceremonial vestments"],"phonetic":"/ˌpɑn.tɪ.fɪˈkeɪ.lɪ.bəs/","extraExplanation":["“pontificalibus”本身是拉丁语形式，常与介词 in 连用成固定写法“in pontificalibus”，在英文宗教/礼仪语境中相当于“in pontificals（穿着主教礼服）”。","它多出现在天主教或圣公会等传统礼仪文本、教会史写作与正式记载中，日常英语里很少单独使用。"]}
{"word":"pontificality","summary":{"en":"Pontificality is an overly formal, ceremonious (often religious-sounding) manner, sometimes implying pompous self-importance; it can also mean an officially church-ceremonial quality.","zh":"Pontificality 指过于正式、仪式化（常带宗教腔调）的作派，常暗含自命不凡；也可指与教会官方礼仪相关的“仪式性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal, solemn, or ceremonially religious manner—often suggesting self-importance or an overly grand style.","zh":"（常带贬义）一种过于庄严、仪式化、带宗教感的作派或腔调；常暗示自命不凡、过分摆架子。"},"examples":[{"en":"The speech was full of pontificality, with grand phrases that sounded more important than the message.","zh":"这篇演讲充满了“摆架子”的庄严腔调，华丽措辞听起来比内容本身还重要。"},{"en":"Her pontificality made a casual discussion feel like a formal ceremony.","zh":"她那种过分郑重的作派，让一次随意的讨论变得像正式仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being “pontifical”: relating to a pope, bishops, or official church ceremonies (formal or technical use).","zh":"（较正式/专业）“教宗的/主教的/教会仪式的”特质；与教宗、主教或官方宗教礼仪相关。"},"examples":[{"en":"The text describes the pontificality of the procession, including robes, chants, and ritual steps.","zh":"这篇文字描写了游行的宗教仪式性，包括法衣、圣歌和仪式步骤。"},{"en":"In art history, pontificality can refer to visual signs of papal authority.","zh":"在艺术史中，pontificality 可指象征教宗权威的视觉符号。"}]}],"synonyms":["pompousness","grandiosity","solemnity","formality","ceremoniousness"],"phonetic":"/ˌpɑn.tɪˈfɪk.əˌlɪ.ti/","extraExplanation":["词源提示：pontificality 来自 pontifical（“教宗的；庄严的”），而 pontifical 又与拉丁语 pontifex（古罗马“祭司/大祭司”，后也用于指“教宗”）有关。因此这个词既可指“教会礼仪的正式感”，也常被引申为“装腔作势、一本正经”。","语用提醒：在日常英语里它更常带有轻微讽刺/批评色彩，意思接近 “pompousness（自大/浮夸）” 或 “grandiosity（夸张的宏大感）”。如果你想更中性地表达“正式、庄重”，可用 formality / solemnity。"]}
{"word":"pontifically","summary":{"en":"“Pontifically” means speaking in a very solemn, authoritative, and often annoyingly self-important way.","zh":"“Pontifically”指用非常庄严、权威、且常令人反感的自以为是口吻说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a solemn, dogmatic, or self-important way, as if giving authoritative judgments (often sounding like you think you cannot be wrong).","zh":"以庄严、武断或自以为权威的方式说话（常带有“我一定正确”的感觉）。"},"examples":[{"en":"He spoke pontifically about politics, as if no one else understood the issue.","zh":"他谈论政治时语气很武断，好像别人都不懂这个问题。"},{"en":"Don’t lecture me pontifically—I’m asking for advice, not a sermon.","zh":"别用那种居高临下的口吻来教训我——我是在求建议，不是在听布道。"}]}],"synonyms":["dogmatically","pompously","self-righteously","authoritatively"],"phonetic":"/ˌpɑn.tɪˈfɪk.li/","extraExplanation":["“pontifically”来自“pontiff”（教皇）。因为教皇在宗教语境中象征权威与庄重，这个副词就常被用来形容某人说话像“在宣告教义”一样郑重、权威，日常使用时多带批评或讽刺意味。","近义表达（语气相近）：“dogmatically（教条地/武断地）”“pompously（浮夸地）”“authoritatively（以权威口吻）”。要注意：authoritatively 有时是中性/正面的（确实很专业），但 pontifically 通常更像在嘲讽对方摆架子。"]}
{"word":"pontificals","summary":{"en":"Pontificals are the formal vestments and insignia of a pope or bishop, and can also mean the bishop’s liturgical book.","zh":"Pontificals 指教皇或主教的礼服与礼仪标志（多用复数），也可指《主教礼仪书》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) The ceremonial clothes and official symbols worn by a pope or bishop (for example, the mitre and crozier) during formal church services.","zh":"（通常用复数）教皇或主教在隆重庆典/礼仪中穿戴的礼服与标志性配饰（如主教冠 mitre、牧杖 crozier 等）。"},"examples":[{"en":"The bishop entered the cathedral in full pontificals for the ordination.","zh":"主教身着全套主教礼服与配饰进入大教堂主持祝圣仪式。"},{"en":"The museum displayed pontificals from the medieval period.","zh":"博物馆展出了中世纪时期的主教礼服与礼仪用品。"}]},{"partOfSpeech":"n.","definition":{"en":"A liturgical book containing instructions and texts for ceremonies led by a bishop (such as confirmations and ordinations).","zh":"《主教礼仪书》：记载由主教主持的礼仪（如坚振礼、祝圣/授职等）所用流程与经文的礼仪书。"},"examples":[{"en":"The librarian found a Latin pontifical in the archives.","zh":"图书馆员在档案中发现了一本拉丁文《主教礼仪书》。"},{"en":"The ceremony followed the directions in the pontifical.","zh":"仪式按《主教礼仪书》中的指引进行。"}]}],"synonyms":["episcopal vestments","ceremonial vestments","liturgical vestments","pontifical (book)"],"phonetic":"/pɑnˈtɪfɪkəlz/","extraExplanation":["“pontificals”多见于天主教或圣公会（英国国教）等传统礼仪语境，带有较强的历史与宗教色彩。日常英语中不常用，常出现在宗教史、艺术史、博物馆说明或文学作品的庄严描写里。","词根来自拉丁语 pontifex（原指古罗马的祭司长，后用于指教皇/大祭司），因此与“教皇/主教的礼仪与权威象征”相关。"]}
{"word":"pontificate","summary":{"en":"“Pontificate” means to speak in a pompous, overly confident, preachy way, as if you’re an authority.","zh":"“Pontificate”指以自以为权威、过于自信且带说教意味的口吻高谈阔论（常令人反感）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to speak or write in a way that sounds too confident, formal, or moralizing, as if you know everything (often annoying to others)","zh":"（常带贬义）以过于自信、教训人或道貌岸然的口吻高谈阔论；好为人师地发表意见"},"examples":[{"en":"He tends to pontificate about politics at family dinners.","zh":"他在家庭聚餐时总爱对政治高谈阔论。"},{"en":"She wasn’t asking for advice—she just didn’t want him to pontificate.","zh":"她并不是在求建议——她只是不想听他好为人师地说教。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to give a formal speech or statement, especially in a serious or authoritative tone","zh":"（较少见）以严肃或权威的语气发表正式讲话或声明"},"examples":[{"en":"The CEO pontificated on the company’s future during the annual meeting.","zh":"首席执行官在年会上就公司的未来发表了正式讲话。"}]}],"synonyms":["lecture","preach","moralize","hold forth","expound","rant"],"phonetic":"/pɑnˈtɪfɪˌkeɪt/","extraExplanation":["这个词源于“pontiff”（教皇）。因此它常带有“像宗教权威那样发言”的联想，语感上更容易让人觉得“端着、说教、居高临下”。","常见搭配：pontificate about/on (something)。常见语境：饭局/社交媒体/会议上“讲道理讲太多”。","近义词语感对比：lecture（训斥式讲课/说教）、preach（宣讲道德或宗教）、rant（激动地抱怨）、opine（较正式地发表意见，语气通常更中性）。"]}
{"word":"pontificated","summary":{"en":"“Pontificated” means spoke in an overly confident, preachy way (often annoying), and less commonly it means acted like a pope in a religious context.","zh":"“pontificated”常指以过度自信、爱说教的口吻发表意见（常令人反感）；较少见的意思是在宗教语境中指教宗式地主持仪式/行事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Spoke or wrote in a confident, formal way as if you were an expert—often sounding too certain or a bit arrogant.","zh":"（以专家口吻）自信而正式地发表意见；常带有自以为是或爱说教的意味。"},"examples":[{"en":"He pontificated about politics at dinner, even though no one asked.","zh":"晚餐时他滔滔不绝地评论政治，尽管没人问他。"},{"en":"She pontificated on what “good parenting” should look like.","zh":"她以说教的口吻评判“好父母”应该是什么样。"}]},{"partOfSpeech":"v.","definition":{"en":"(Roman Catholic context) Acted as a pope or high bishop; performed official religious duties.","zh":"（天主教语境）以教宗或高级主教身份行事；主持正式宗教仪式。"},"examples":[{"en":"In the film, the pope pontificated before a large crowd.","zh":"在电影里，教宗在大批人群面前主持仪式。"}]}],"synonyms":["lectured","preached","moralized","held forth","expounded"],"phonetic":"/pɑnˈtɪfɪˌkeɪtɪd/","extraExplanation":["“pontificated”是动词“pontificate”的过去式/过去分词。日常英语里更常用的是第一义（带点贬义：爱说教、太武断）。","词源与“pontiff”（教宗）有关，来自拉丁语，原意与“架桥者”有关，后来指宗教权威。因为教宗讲话具有权威性，“pontificate”才引申为“以权威口吻高谈阔论”。","语气提示：如果想表达更中性，可以用“commented”“gave their opinion”“spoke confidently”；如果想更强烈地批评，可以用“lectured”“preached”或“talked down to people”。"]}
{"word":"pontificates","summary":{"en":"“Pontificates” means speaks in a preachy, overly authoritative way (often annoying); less commonly, it means acts as a pope/bishop.","zh":"“pontificates”指（常带贬义）以说教、过度权威的口吻高谈阔论；较少见义为担任教宗/主教并履职。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of someone) to speak in a confident, preachy way, as if you are always right—often annoying to others.","zh":"（某人）以自以为是、说教式的口吻高谈阔论，好像自己永远正确——常让人反感。"},"examples":[{"en":"He pontificates about politics at dinner, so people change the subject.","zh":"他吃饭时总爱对政治高谈阔论，所以大家会换话题。"},{"en":"She was tired of managers pontificating instead of listening to the team.","zh":"她厌倦了经理们只会说教、不愿听团队意见。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to act as a pope or bishop; to perform the duties of a high church leader.","zh":"（较少见）担任教宗或主教；履行高级教会领袖的职责。"},"examples":[{"en":"In the novel, the old cleric pontificates from the grand cathedral.","zh":"在小说里，那位年迈的神职人员在宏伟的大教堂里以主教的身份行事。"}]}],"synonyms":["lecture","preach","moralize","grandstand","hold forth"],"phonetic":"pɑnˈtɪfɪˌkeɪts","extraExplanation":["“pontificate”来自拉丁语 *pontifex*（大祭司），后来与“教宗/主教的权威”联系在一起。因此它在现代英语里常带有贬义：不是单纯“发表意见”，而是“摆出权威姿态、爱说教”。","常见搭配：pontificate about/on something（就某事高谈阔论）。语气提示：比“talk”更负面，比“lecture”更强调自以为是。"]}
{"word":"pontificating","summary":{"en":"“Pontificating” describes self-important, preachy talk that sounds like unquestionable authority.","zh":"“pontificating”指自以为权威、说教、居高临下的讲话方式（通常带贬义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Speaking or writing in a self-important, preachy way, as if you are an unquestionable authority.","zh":"以自以为权威、说教、居高临下的方式讲话或写作，好像自己无可质疑。"},"examples":[{"en":"He kept pontificating about parenting even though he doesn’t have children.","zh":"他虽然没有孩子，却一直在居高临下地说教如何育儿。"},{"en":"Instead of listening, she started pontificating about what everyone should do.","zh":"她没有倾听，反而开始自以为是地说大家都该怎么做。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of speaking in a self-important, preachy way; giving opinions as if they are facts.","zh":"自以为是的说教式讲话；把个人观点当成事实来下结论。"},"examples":[{"en":"His pontificating annoyed the whole team.","zh":"他的说教式发言惹恼了整个团队。"},{"en":"We need discussion, not pontificating.","zh":"我们需要讨论，而不是说教。"}]}],"synonyms":["preachy","self-righteous","didactic","lecturing","dogmatic"],"phonetic":"/pɑnˈtɪfɪˌkeɪtɪŋ/","extraExplanation":["“pontificating”来自动词“pontificate”。词源与拉丁语“pontifex”（古罗马祭司、后也指教皇）有关，因此这个词常带有“像宗教权威一样发号施令”的语气。","语气提示：这个词通常是负面评价，暗示对方不够谦逊、缺少倾听。更中性可以用“lecture（讲课式说教）”“opine（发表看法）”，更客观可用“explain（解释）”。"]}
{"word":"pontification","summary":{"en":"Pontification means long, preachy, overly confident talk that sounds like a lecture.","zh":"pontification 指冗长、爱说教、带权威口吻的高谈阔论（多含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, formal-sounding speech or explanation in which someone expresses their opinions as if they are unquestionably correct (often in an annoying or preachy way).","zh":"（常带贬义）冗长而一本正经的高谈阔论；以“权威口吻”讲道理、说教，仿佛自己绝对正确。"},"examples":[{"en":"The meeting got stuck in twenty minutes of pontification and no one made a decision.","zh":"会议陷入了二十分钟的高谈阔论，结果谁也没做决定。"},{"en":"I didn’t ask for a lecture—I just wanted advice, not pontification.","zh":"我不是来听训话的——我只是想要建议，不是高谈阔论。"},{"en":"Her pontification about “how things should be” annoyed the team.","zh":"她关于“事情应该怎样”的说教让团队很反感。"}]}],"synonyms":["preaching","ranting","lecturing","sermonizing","moralizing"],"phonetic":"/ˌpɑːn.tə.fəˈkeɪ.ʃən/","extraExplanation":["“pontification”源自“pontiff”（教宗）。最初与教宗/主教以权威口吻讲话有关，所以这个词常带有“居高临下、爱说教”的语气。","语体上多用于批评：表示内容不一定错，但说话方式让人反感、像在“训人”。","常见搭配：endure/sit through someone’s pontification（忍受某人的高谈阔论）、a bit of pontification（来一段说教）、pontification about/on…（就……高谈阔论）。"]}
{"word":"pontificator","summary":{"en":"A pontificator is someone who talks in a self-important, preachy way, as if they are an unquestionable authority.","zh":"pontificator 指喜欢以权威口吻高谈阔论、带说教和自以为是语气的人（多为贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who speaks or writes as if they know everything, often in a moralizing or overly confident way; a pompous lecturer.","zh":"爱摆架子、像“权威”一样说教的人；常带有自以为是、夸夸其谈的语气。"},"examples":[{"en":"He sounded like a pontificator, giving advice even when nobody asked.","zh":"他听起来像个说教者，没人问他也要给建议。"},{"en":"The meeting went poorly because one pontificator dominated the conversation.","zh":"会议进展不顺，因为有个爱说教的人一直霸占着发言。"}]}],"synonyms":["know-it-all","preacher","moralizer","windbag","blowhard"],"phonetic":"/pɑnˈtɪfɪˌkeɪtɚ/","extraExplanation":["“pontificator”来自“pontificate”（像教皇/主教那样发表权威式讲话）。词根“pontiff”原指教皇，因此这个词常含讽刺意味：并不是真的宗教领袖，却用一种“我最懂”的口吻讲道理。","语气提示：它通常是贬义，用来批评别人“居高临下、爱教育人”。比较接近的词有“know-it-all”（万事通/自以为什么都懂的人）和“pompous speaker”（自大夸张的演讲者）。"]}
{"word":"pontifice","summary":{"en":"“Pontifice” is a rare form meaning a pontiff, especially the Pope; in modern English, “pontiff” is the standard word.","zh":"“pontifice”是少见的形式，意为“教宗/教皇”；现代英语中更标准的词是“pontiff”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard in modern English) A pontiff; especially the Pope, or a high-ranking bishop.","zh":"（现代英语中少见/不规范用法）教宗；尤指罗马教皇，或高级主教。"},"examples":[{"en":"In some older texts, “pontifice” is used to mean the Pope.","zh":"在一些较旧的文本中，“pontifice”被用来指“教皇”。"},{"en":"The people gathered to hear the pontifice speak.","zh":"人们聚集起来聆听那位教宗讲话。"}]}],"synonyms":["pontiff","pope","prelate"],"phonetic":"/pɑnˈtɪfɪs/","extraExplanation":["“pontifice”在当代英语里非常少见，很多情况下会被视为拼写/用词不当。更常用、也更标准的说法是：pontiff（名词：教皇/主教）和 pontificate（动词：以教皇身份统治；也可指“武断说教”）。","词源来自拉丁语 pontifex，原意与“造桥者”有关（pont- = bridge，facere = to make），后来成为古罗马宗教官职的称号，再发展为指天主教教皇等宗教领袖。","常见搭配：the Pontiff / the Supreme Pontiff（最高教宗=教皇）；papal（教皇的）常用来作形容词。"]}
{"word":"pontifices","summary":{"en":"Pontifices means “pontifex/pontiff” in the plural—either ancient Roman high priests or (formally) popes/senior bishops.","zh":"pontifices 是 pontifex/pontiff 的复数，指古罗马高级祭司，或（正式）多位教皇/高级主教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of pontifex: in ancient Rome, high-ranking priests (especially members of the College of Pontiffs) who oversaw religious law and rituals.","zh":"pontifex 的复数：古罗马的高级祭司（尤指“祭司团”成员），负责宗教法与仪式的管理。"},"examples":[{"en":"The pontifices supervised public religious ceremonies and the calendar in Rome.","zh":"这些 pontifices 负责监督罗马的公共宗教仪式和历法。"},{"en":"In the text, the pontifices are described as guardians of sacred tradition.","zh":"在该文本中，pontifices 被描写为神圣传统的守护者。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of pontiff: (formal) popes or other high bishops; sometimes used broadly for senior religious leaders.","zh":"pontiff 的复数：（正式用语）多位教皇或其他高级主教；有时也泛指资深宗教领袖。"},"examples":[{"en":"The book compares several pontifices and their influence on Church history.","zh":"这本书比较了多位教皇（pontifices）及其对教会历史的影响。"},{"en":"Portraits of past pontifices lined the hallway.","zh":"走廊里挂着历代教皇（pontifices）的画像。"}]}],"synonyms":["pontiffs","high priests","priests","bishops","popes (context-dependent)"],"phonetic":"/pɑnˈtɪfɪˌsiz/","extraExplanation":["“pontifices”常见于历史、宗教研究或拉丁语语境。更日常的英语里，人们通常说“pontiffs”（教皇/宗教领袖）或直接说“popes”（教皇）。","词源来自拉丁语“pontifex”，常被解释为与“桥（pons）”有关，隐喻祭司在“人与神之间搭桥”的角色；在古罗马宗教制度中，祭司团（College of Pontiffs）权力与影响很大。"]}
{"word":"pontificial","summary":{"en":"Pontifical means (1) relating to the Pope or high Catholic ceremonies, and (2) (often disapproving) speaking in a self-important, preachy way; it can also mean the ceremonial robes of high clergy.","zh":"Pontifical 意为（1）与教皇或天主教高级仪式有关的；（2）（常含贬义）语气武断、自以为是、爱说教的；也可指高级神职人员的礼仪服饰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Relating to the Pope or to the Roman Catholic Church’s highest leaders and ceremonies.","zh":"（形容词）与教皇有关的；与罗马天主教最高领袖或其宗教仪式有关的。"},"examples":[{"en":"The cathedral hosted a pontifical Mass led by the archbishop.","zh":"这座主教座堂举行了一场由大主教主持的隆重主教弥撒（pontifical Mass）。"},{"en":"They visited Rome during a pontifical celebration.","zh":"他们在一次与教皇有关的庆典期间参观了罗马。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) (Often disapproving) Speaking in a proud, preachy, or overly certain way, as if you are the authority.","zh":"（形容词）（常含贬义）语气武断自大、爱说教的；仿佛自己最权威一样。"},"examples":[{"en":"He gave a pontifical lecture about how everyone else should live.","zh":"他用一种居高临下的说教口吻讲别人该怎么生活。"},{"en":"Try not to sound pontifical when you give advice.","zh":"给建议时尽量别显得太武断爱说教。"}]},{"partOfSpeech":"n.","definition":{"en":"(n., usually plural) The official ceremonial robes or insignia worn by a pope or high-ranking clergy.","zh":"（名词，常用复数）教皇或高级神职人员在仪式中穿戴的礼服、法衣或标志物。"},"examples":[{"en":"The museum displayed pontificals from different centuries.","zh":"博物馆展出了不同时代的教皇（或主教）礼仪服饰。"}]}],"synonyms":["papal","ecclesiastical","clerical","pompous","preachy","dogmatic"],"phonetic":"/pɑnˈtɪfɪkəl/","extraExplanation":["你输入的 **pontificial** 更常见的标准拼写是 **pontifical**。两者有时会被混用或拼错，但在现代英语里以 *pontifical* 为主。","词源来自拉丁语 *pontifex*（大祭司、教皇），所以在宗教语境里常见搭配有 **pontifical Mass**（由主教/教皇主持的隆重弥撒）。","在日常英语中，*pontifical* 的“爱说教、武断”用法带有语气评价，常用来批评某人讲话像在“宣讲真理”一样。"]}
{"word":"pontificially","summary":{"en":"Pontifically means speaking or acting in a pompous, authoritative way; less commonly, it means in a way connected to the Pope.","zh":"pontifically 常指以自负、权威式的口吻说话或行事；较少见时指与教皇相关的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a self-important, pompous, or dogmatic way, as if giving unquestionable authority.","zh":"以自以为是、摆架子或武断的方式（好像自己拥有不可质疑的权威）。"},"examples":[{"en":"He spoke pontifically about politics, as if no one else could be right.","zh":"他谈起政治来一副武断的口吻，仿佛别人都不可能是对的。"},{"en":"She pontifically corrected everyone’s grammar during the meeting.","zh":"她在会议上摆出一副高高在上的样子纠正每个人的语法。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way related to the Pope or the Roman Catholic Church (formal, less common).","zh":"以与教皇或罗马天主教会相关的方式（正式用法，较少见）。"},"examples":[{"en":"The document was written in a pontifically approved form.","zh":"该文件采用了经教皇方面认可的形式写成。"}]}],"synonyms":["pompously","dogmatically","authoritatively","self-importantly"],"phonetic":"/ˌpɑnˈtɪfɪkli/","extraExplanation":["“pontifically”常带负面语感，通常不是指宗教意义上的“教皇的”，而是形容说话/态度像“在下达权威裁决”一样。","你输入的“pontificially”更常见的标准拼写是“pontifically”。“pontifical”是形容词（教皇的；或自负的、摆架子的），对应的副词是“pontifically”。"]}
{"word":"pontificious","summary":{"en":"An uncommon adjective meaning “self-important and dogmatic in tone.”","zh":"较少见的形容词，意为“语气自大武断、爱摆权威”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Speaking or behaving in a self-important, overly confident way, as if you have special authority (often giving opinions like they are facts).","zh":"自以为是、武断的；以权威口吻高谈阔论的（常把个人观点说得像事实）。"},"examples":[{"en":"He gave a pontificious speech about parenting, even though he doesn’t have children.","zh":"他用很武断的口吻发表了一通育儿演讲，尽管他自己并没有孩子。"},{"en":"Try not to sound pontificious when you disagree—ask questions instead.","zh":"不同意时尽量别显得自以为是——可以改为提问。"}]}],"synonyms":["pompous","dogmatic","self-important","preachy","overbearing","authoritative"],"phonetic":"/ˌpɑn.təˈfɪʃ.əs/","extraExplanation":["“pontificious”较少见，更常见的相关词是“pontificating”（动名词/现在分词，指以权威口吻高谈阔论）和“pontifical”（形容词，除“武断的”之外还可指“教皇的/庄严的”）。","词源与“pontiff”（教皇）有关：最初带有“像教皇那样发表权威言论”的意味，现代日常语境多为贬义，表示“自命权威、爱说教”。"]}
{"word":"pontify","summary":{"en":"“Pontify” means to speak as if you’re an unquestionable authority—often in a preachy, overly confident way.","zh":"“pontify”指以不容置疑的权威口吻说话，常带“爱说教、过度自信”的贬义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To speak or write in a way that sounds too confident or morally superior, as if you are an expert; to lecture others.","zh":"（自以为是地）高谈阔论；以权威口吻说教、训人。"},"examples":[{"en":"He kept pontifying about how everyone should live their lives.","zh":"他不停地对别人该怎么生活指手画脚、说教。"},{"en":"I don’t want a lecture—please stop pontifying and listen.","zh":"我不想听你讲大道理——别再说教了，先听我说。"}]},{"partOfSpeech":"v.","definition":{"en":"To deliver a formal speech or opinion, especially in a serious, public, or official way.","zh":"（尤指在公开或正式场合）庄重地发表意见或演说。"},"examples":[{"en":"The host invited the professor to pontify on the future of education.","zh":"主持人邀请那位教授就教育的未来发表看法。"},{"en":"She pontified from the stage for nearly an hour.","zh":"她在台上郑重其事地讲了将近一个小时。"}]}],"synonyms":["pontificate","preach","lecture","moralize","harangue"],"phonetic":"/pɑnˈtɪfaɪ/","extraExplanation":["“pontify”在英语里较少见，更常见、也更标准的动词是“pontificate”。两者意思几乎一样：常带贬义，强调说话像权威一样、爱训人。","词源与“pontiff（教皇）/pontifical（教皇的；自以为权威的）”相关，所以“pontify/pontificate”常暗含“像教皇一样发表权威言论”的讽刺意味。"]}
{"word":"pontil","summary":{"en":"Pontil is a glassmaking rod used to handle hot glass; it can also mean the mark left where the rod was attached.","zh":"Pontil 指玻璃製作中用來支撐熱玻璃的金屬桿，也可指器物底部留下的 pontil 痕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In glassmaking, a metal rod used to hold, shape, or carry hot glass while it is being worked (also spelled “punty”).","zh":"（玻璃製作中）用來握持、塑形或搬運高溫玻璃的金屬桿（也作 punty）。"},"examples":[{"en":"The glassblower transferred the vase to a pontil to finish the rim.","zh":"玻璃匠把花瓶轉接到 pontil 上，好完成瓶口的修整。"},{"en":"A new assistant learned how to attach the pontil without cracking the glass.","zh":"新助手學著如何把 pontil 接上去而不讓玻璃裂開。"}]},{"partOfSpeech":"n.","definition":{"en":"The rough scar or mark left on the bottom of a hand-blown glass object where it was attached to the pontil (pontil mark).","zh":"（pontil mark）手工吹製玻璃器物底部因連接 pontil 而留下的粗糙痕跡／疤痕。"},"examples":[{"en":"Collectors often look for a pontil mark to confirm a piece is hand-blown.","zh":"收藏家常會看有沒有 pontil 痕，來判斷是否為手工吹製。"},{"en":"The bottle’s pontil is slightly raised and uneven.","zh":"這個瓶子的 pontil 痕有點凸起，而且不太平整。"}]}],"synonyms":["punty","pontil rod","pontil mark (for the mark sense)"],"phonetic":"/ˈpɑn.təl/","extraExplanation":["在古董玻璃收藏語境中，看到「pontil / pontil mark」常表示那件器物曾用 pontil（金屬桿）支撐加工，因此底部可能有粗糙的斷痕。後期大量機器製作的玻璃通常沒有這種痕跡或會被磨平，因此「有 pontil 痕」常被當作手工製作的線索之一（但仍需搭配其他特徵判斷）。","拼寫方面：英式與工坊用語中也常見 punty；兩者多半指同一工具。"]}
{"word":"pontile","summary":{"en":"Pontile means a pier or (often floating) dock, especially in Italian/Mediterranean settings.","zh":"pontile 指（多见于意大利/地中海语境的）栈桥或（常为浮动的）码头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pier or floating dock (often in Italian or Mediterranean contexts), used for boats to moor or for people to board.","zh":"（多用于意大利/地中海语境）栈桥；码头（有时为浮动码头），供船只停靠或人员上下船。"},"examples":[{"en":"We walked to the pontile to catch the water taxi.","zh":"我们走到栈桥上去搭水上出租船。"},{"en":"Small boats were tied along the pontile behind the hotel.","zh":"酒店后面的码头边系着一排小船。"}]}],"synonyms":["pier","dock","jetty","pontoon","landing stage"],"phonetic":"/pɑnˈtiːli/","extraExplanation":["“pontile”是意大利语借词，来自拉丁语词根“pons”（桥）。在英语中它不算常见，更常出现在旅游、地图标注、航海/港口介绍里，尤其指意大利海岸或湖区的登船栈桥。","在日常英语里，人们通常用更通用的词：pier（栈桥/码头，常供人行走）、dock（码头/船坞，更泛）、jetty（防波堤式的突堤）、pontoon（浮筒/浮码头）。"]}
{"word":"pontils","summary":{"en":"Pontils are rods used in glassblowing, and the term can also refer to the mark left where the rod was removed.","zh":"Pontils 指玻璃吹制中使用的接杆，也可指接杆拆离后在器物底部留下的痕迹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In glassblowing, a metal rod used to hold, shape, or finish a hot glass object while it is being worked.","zh":"（玻璃吹制中）用于夹持、旋转、整形或收尾加工热玻璃制品的金属杆（接杆）。"},"examples":[{"en":"The glassblower attached the vase to a pontil to finish the rim.","zh":"玻璃工把花瓶接到接杆（pontil）上，用来修整瓶口。"},{"en":"Once the piece was on the pontil, the bottom could be shaped safely.","zh":"作品接到接杆后，就能更安全地塑造底部。"}]},{"partOfSpeech":"n.","definition":{"en":"The rough scar/mark left on the bottom of a glass object where the pontil was detached (often called a pontil mark).","zh":"（玻璃器物底部）接杆拆离后留下的粗糙痕迹（常称 pontil mark，接杆痕）。"},"examples":[{"en":"You can feel the pontil mark on the underside of the old goblet.","zh":"你能在那只旧高脚杯底部摸到接杆痕。"},{"en":"Collectors sometimes use a pontil mark to help date handmade glass.","zh":"收藏者有时会用接杆痕来辅助判断手工玻璃的年代。"}]}],"synonyms":["punty","pontil rod","pontil mark (for the scar)"],"phonetic":"/ˈpɑn.təl/","extraExplanation":["“pontils”是“pontil”的复数。相关词：punty（同义词，口语/行业用法更常见）。","在传统玻璃工艺中，工匠会先用吹管（blowpipe）成形，然后把作品“转接”到pontil/punty上，方便处理开口处或做最后修饰；因此底部常会留下接杆痕（pontil mark）。"]}
{"word":"pontin","summary":{"en":"“Pontin” is mainly a proper noun, most commonly referring to the UK holiday-park brand “Pontin’s,” and it can also be a surname.","zh":"“Pontin”主要是专有名词，最常见指英国度假营地品牌“Pontin’s”，也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a British brand name for a chain of holiday parks and resorts (often written “Pontin’s”)","zh":"英国的度假公园/度假村连锁品牌名（常写作“Pontin’s”）"},"examples":[{"en":"My grandparents used to take the family to Pontin’s for a cheap seaside holiday.","zh":"我爷爷奶奶以前常带全家去Pontin’s，来一趟便宜的海边假期。"},{"en":"She worked a summer job at Pontin’s as an entertainer.","zh":"她在Pontin’s做过一份暑期工作，当表演人员。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name)","zh":"姓氏"},"examples":[{"en":"Mr. Pontin signed the letter at the bottom.","zh":"Pontin先生在信的末尾签了名。"}]}],"synonyms":["(brand) Pontin’s","(surname) —"],"phonetic":"/ˈpɑːntɪn/","extraExplanation":["“Pontin”在通用英语里不是常见词汇，最常见的用法是专有名词“Pontin’s”（英国度假营地品牌），对英国文化更熟悉的人更可能认识。","如果你本来想查的是发音/拼写相近的词：pontoon（浮桥/趸船）或 pontine（“脑桥的”，医学/解剖学用语），告诉我你想要哪一个，我可以给出更标准的词条与用法。"]}
{"word":"pontine","summary":{"en":"Pontine most commonly means “related to the pons in the brainstem,” and less commonly “related to the Pontine Marshes in Italy.”","zh":"pontine 最常指“脑桥的（与脑干的脑桥有关）”，较少指“与意大利蓬廷沼泽/该地区有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the pons, a part of the brainstem.","zh":"（解剖）与脑桥有关的；脑桥的。"},"examples":[{"en":"The scan showed a small pontine stroke.","zh":"扫描显示有一个小的脑桥部位中风（脑桥梗死）。"},{"en":"Pontine neurons help relay signals between different parts of the brain.","zh":"脑桥神经元帮助在大脑不同部位之间传递信号。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Pontine Marshes (an area in central Italy) or, more broadly, to that region.","zh":"与意大利中部的蓬廷沼泽（Pontine Marshes）有关的；该地区的。"},"examples":[{"en":"They studied the history of malaria in the Pontine Marshes.","zh":"他们研究了蓬廷沼泽地区疟疾的历史。"},{"en":"Pontine land-reclamation projects changed the local economy.","zh":"蓬廷地区的围垦/排水工程改变了当地经济。"}]}],"synonyms":["pons-related","brainstem (related)","Pontine Marshes–related"],"phonetic":"ˈpɑn.taɪn","extraExplanation":["“pontine（脑桥的）”来自拉丁语 pons（桥）。脑桥之所以得名，是因为它像“桥”一样连接并中转多条神经通路（例如连接大脑与小脑/脑干的信号）。在医学英语里最常见的搭配包括 pontine stroke（脑桥卒中）、pontine hemorrhage（脑桥出血）。","“Pontine Marshes（蓬廷沼泽）”位于意大利拉齐奥大区一带，历史上因疟疾著名，20世纪经历大规模排水与垦殖；在历史、地理语境中才较常见 “pontine”。"]}
{"word":"pontist","summary":{"en":"A rare/archaic word meaning “papal” or “a supporter/follower of the Pope.”","zh":"较少见/古义：指“教皇的（papal）”，或“教皇的支持者/追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) relating to a pontiff, especially the Pope; papal.","zh":"（古义）与教皇（尤指罗马教皇）有关的；教皇的。"},"examples":[{"en":"The museum displayed pontist documents from the Vatican archives.","zh":"博物馆展出了来自梵蒂冈档案的教皇相关文件。"},{"en":"In older writings, “pontist” could describe papal authority.","zh":"在较早的著作中，“pontist”可用来形容教皇权威。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) a supporter or follower of the Pope; a Roman Catholic (used by some writers historically, sometimes with a hostile tone).","zh":"（古义）教皇的支持者／追随者；（旧时用法）天主教徒（部分历史语境中可能带贬义）。"},"examples":[{"en":"The pamphlet attacked the pontists of the city.","zh":"这本小册子抨击了城里的“教皇派”。"},{"en":"He was labeled a pontist by his political opponents.","zh":"他被政治对手贴上了“教皇派”的标签。"}]}],"synonyms":["papal","Roman Catholic","papist (historical/often derogatory)"],"phonetic":"/ˈpɑːntɪst/","extraExplanation":["“pontist”比较少见，多出现在较早的宗教或政治争论文本里。现代英语更常用的词是 **papal**（形容词：教皇的）和 **Catholic / Roman Catholic**（名词：天主教徒）。","词根 **pont-** 来自拉丁语 *pons*（桥）。**pontiff** 源自 *pontifex*，古罗马原意与“造桥/祭司”有关，后来成为“教皇”的称号。"]}
{"word":"pontius","summary":{"en":"Pontius is a Roman name most commonly recognized in the phrase “Pontius Pilate,” the Roman governor in the New Testament.","zh":"Pontius 是一个罗马姓氏，最常见于“Pontius Pilate（本丢·彼拉多）”，指《新约》中的罗马总督。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Roman family name best known from the New Testament figure Pontius Pilate, the Roman governor of Judea who presided over Jesus’s trial.","zh":"一个罗马人的姓氏，最著名的来源是《新约》中的“本丢·彼拉多”（Pontius Pilate）——他是罗马在犹太行省的总督，主持了对耶稣的审判。"},"examples":[{"en":"Pontius Pilate appears in the Bible as the governor who questioned Jesus.","zh":"《圣经》中记载，本丢·彼拉多是审问耶稣的总督。"},{"en":"In art and literature, Pontius is usually used as part of the name “Pontius Pilate.”","zh":"在艺术与文学作品中，“Pontius”通常作为“Pontius Pilate（本丢·彼拉多）”这一姓名的一部分出现。"}]},{"partOfSpeech":"n.","definition":{"en":"A given or family name used in some cultures, often associated with the historical/Biblical reference.","zh":"在一些文化中用作名字或姓氏的词，常带有历史/《圣经》联想。"},"examples":[{"en":"He was named Pontius after a character from religious history.","zh":"他取名为 Pontius，是借用了宗教历史中的人物。"}]}],"synonyms":["Pontius Pilate (as the common full reference)"],"phonetic":"/ˈpɑnʃəs/","extraExplanation":["“Pontius”本身多作为罗马姓氏出现，单独使用时往往让人联想到“Pontius Pilate（本丢·彼拉多）”。英语里也常由此引申出表达：wash one’s hands of something（‘洗手不管’、推卸责任），典故来自彼拉多“洗手表示无罪/不承担责任”的叙述。","在英语书写中，它通常首字母大写（Pontius），因为多用于专有名词（人名）。"]}
{"word":"pontlevis","summary":{"en":"Pontlevis means a castle-style drawbridge (often written pont-levis).","zh":"pontlevis 指城堡式的吊桥/升降桥（常写作 pont-levis）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drawbridge, especially one at the entrance of a castle or fortified place (also written \"pont-levis\")","zh":"（尤指城堡或要塞入口的）吊桥；升降桥（也常写作 pont-levis）"},"examples":[{"en":"The guards raised the pontlevis at sunset to secure the castle.","zh":"日落时守卫升起吊桥，以确保城堡安全。"},{"en":"In the novel, the hero waits outside the moat until the pont-levis is lowered.","zh":"在小说里，主人公在护城河外等待吊桥放下。"}]}],"synonyms":["drawbridge","lifting bridge"],"phonetic":"ˈpɑntləˌvi","extraExplanation":["“Pont-levis”源自法语：pont（桥）+ levis（可抬起的）。在中世纪欧洲城堡里常见，用来跨越护城河，必要时升起以防御敌人。英语里更常用的普通词是 drawbridge；pontlevis/pont-levis 带有更强的历史或文学色彩。","拼写提示：更常见的写法是带连字符的 pont-levis；不带连字符的 pontlevis 比较少见。"]}
{"word":"ponto","summary":{"en":"“Ponto” is a Portuguese word meaning “point/dot,” and by extension it can also mean “stitch,” “(bus) stop,” “the right cooking doneness,” or “time-clock attendance record,” depending on context.","zh":"“ponto”是葡语词，基本义为“点/点号”，并可引申为“针脚”“（公交）站点”“火候刚好”“考勤打卡记录”等，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a point; a dot or mark (used for locations, punctuation, or an item in a list)","zh":"点；点号；标记（用于表示位置、标点或条目）"},"examples":[{"en":"On the map, mark the meeting spot with a ponto.","zh":"在地图上，用一个“ponto”把集合地点标出来。"},{"en":"In Portuguese, “ponto final” means a period (.) at the end of a sentence.","zh":"在葡语里，“ponto final”指句末的句号（.）。"}]},{"partOfSpeech":"n.","definition":{"en":"a stitch in sewing/embroidery (a unit of needlework)","zh":"（缝纫/刺绣的）针脚；一针"},"examples":[{"en":"She learned a basic ponto to fix the torn shirt.","zh":"她学会了一个基本的针脚来补那件破衬衫。"},{"en":"This pattern uses the same ponto again and again.","zh":"这个图案反复使用同一种针法。"}]},{"partOfSpeech":"n.","definition":{"en":"a stop or station (especially a bus stop); a designated spot where something happens","zh":"（尤指）公交站；固定地点/站点"},"examples":[{"en":"Let’s meet at the ponto de ônibus (bus stop).","zh":"我们在公交站（ponto de ônibus）见。"},{"en":"There’s a taxi stand at that ponto.","zh":"那个点有一个出租车停靠点。"}]},{"partOfSpeech":"n.","definition":{"en":"the right stage/level of cooking (doneness or correct consistency)","zh":"（烹饪的）火候；稠度/状态刚刚好"},"examples":[{"en":"Cook the caramel until it reaches the right ponto.","zh":"把焦糖煮到火候刚刚好。"},{"en":"The steak is at the perfect ponto—juicy but not raw.","zh":"牛排火候正好——多汁但不生。"}]},{"partOfSpeech":"n.","definition":{"en":"an attendance/time clock record (workplace timekeeping)","zh":"（考勤）打卡记录；出勤记录"},"examples":[{"en":"He forgot to record his ponto when he arrived.","zh":"他到公司时忘了打卡。"},{"en":"Employees must register their ponto every day.","zh":"员工每天都必须打卡。"}]}],"synonyms":["point","dot","mark","stitch","stop","doneness"],"phonetic":"/ˈpɑn.toʊ/","extraExplanation":["“ponto”是葡萄牙语常用词，在巴西日常生活里出现频率很高。常见固定搭配包括：\n- bater o ponto：上/下班打卡（用于考勤）\n- ponto de ônibus：公交站\n- ponto final：句号，也可引申为“到此为止”\n- ao ponto：火候刚好（常用于牛排：steak ao ponto）\n在英语环境中单独写“ponto”通常会被当作外来词或专有名词，需要结合上下文理解。"]}
{"word":"pontocaspian","summary":{"en":"Pontocaspian means “from or related to the Black Sea–Caspian Sea region.”","zh":"Pontocaspian 指“与黑海—里海地区有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Black Sea (Pontic) and Caspian Sea region, especially in geography, ecology, or biogeography (e.g., species that evolved or spread around these connected basins).","zh":"与黑海（本都地区）和里海地区有关的，尤指地理、生态或生物地理学语境中（如起源于或分布于这两大海盆周边的物种）。"},"examples":[{"en":"Pontocaspian species often live in brackish water around the Black Sea and the Caspian Sea.","zh":"本都—里海区（Pontocaspian）的物种常生活在黑海和里海周边的半咸水环境中。"},{"en":"Researchers studied Pontocaspian mollusks to understand how ancient waterways shaped biodiversity.","zh":"研究人员通过研究本都—里海区的软体动物，来理解古代水系如何塑造生物多样性。"}]}],"synonyms":["Black Sea–Caspian","Ponto-Caspian","Pontic–Caspian"],"phonetic":"/ˌpɑn.toʊˈkæ.spi.ən/","extraExplanation":["“Pontocaspian”由两部分构成：Ponto- 指 Pontus/Black Sea（本都/黑海），-caspian 指 Caspian Sea（里海）。该词常见于学术写作（生态学、地质学、古生物学、入侵生物学），日常英语中较少使用。","在生物地理学里，“Pontocaspian fauna/flora（本都—里海区动植物群）”常指在历史上黑海—里海水体更频繁连通时形成的特有物种群；这些物种也常被讨论为可能的“入侵物种来源区”。"]}
{"word":"pontocerebellar","summary":{"en":"Pontocerebellar means “related to the pons and the cerebellum,” usually in medical contexts.","zh":"pontocerebellar 指“与脑桥和小脑有关的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pons and the cerebellum (two connected parts of the brain), especially describing nerves, pathways, or disorders linking them.","zh":"与脑桥和小脑有关的（脑内两个相互连接的结构），常用于描述它们之间的神经通路、纤维或相关疾病。"},"examples":[{"en":"The MRI report mentioned pontocerebellar atrophy.","zh":"MRI 报告提到“脑桥-小脑萎缩”。"},{"en":"Pontocerebellar fibers carry signals between the pons and the cerebellum.","zh":"脑桥-小脑纤维在脑桥和小脑之间传递信号。"}]}],"synonyms":["ponto-cerebellar","pons-to-cerebellum (descriptive)"],"phonetic":"/ˌpɑn.toʊˌsɛr.əˈbɛl.ɚ/","extraExplanation":["“ponto-”来自拉丁语 pons（意为“桥”，指脑桥），-cerebellar 来自 cerebellum（小脑）。这是医学/解剖学用语，日常英语里很少见。","常见搭配：pontocerebellar fibers（脑桥-小脑纤维）、pontocerebellar tract/pathway（脑桥-小脑束/通路）、pontocerebellar atrophy（脑桥-小脑萎缩）。","有时也会写成带连字符的形式 ponto-cerebellar；两者含义相同。"]}
{"word":"ponton","summary":{"en":"Ponton is a less common spelling of pontoon: a flat-bottomed boat or floating platform, often for bridges or docks.","zh":"ponton 是 pontoon 的较少见拼写：指平底船或浮动平台，常用于浮桥或浮动码头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Less common spelling of “pontoon”) a flat-bottomed boat or floating platform, often used to support a bridge or dock.","zh":"（较少见的拼写，等同于 pontoon）平底船或浮动平台，常用来支撑浮桥或浮动码头。"},"examples":[{"en":"The engineers built a ponton bridge to cross the river quickly.","zh":"工程兵搭建了一座浮桥，迅速渡过河流。"},{"en":"We rented a ponton boat for a slow ride around the lake.","zh":"我们租了一艘平底浮船，在湖上慢慢兜了一圈。"}]}],"synonyms":["pontoon","flat-bottomed boat","floating platform","raft (approx.)"],"phonetic":"/pɑnˈtun/","extraExplanation":["“ponton”在现代英语中多见于历史或军事语境，日常更常用拼写“pontoon”。该词与法语/意大利语中表示“桥、浮舟”的词有关，常让人联想到临时浮桥（ponton/pontoon bridge）。"]}
{"word":"pontoneer","summary":{"en":"A pontoneer is a soldier/engineer who builds and runs pontoon bridges.","zh":"pontoneer 指负责架设与操作舟桥（浮桥）的军人或工兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a military engineer or soldier who builds and operates pontoon (floating) bridges, especially for troops to cross rivers","zh":"（军队中的）舟桥兵；架设与操作浮桥（舟桥）的人，尤指协助部队渡河"},"examples":[{"en":"During the flood, the pontoneers built a temporary bridge so vehicles could pass.","zh":"洪水期间，舟桥兵架起了一座临时浮桥，让车辆能够通行。"},{"en":"The army relied on pontoneers to cross the river quickly and safely.","zh":"军队依靠舟桥兵快速而安全地渡河。"}]}],"synonyms":["pontooner","combat engineer","bridge engineer"],"phonetic":"/ˌpɑn.təˈnɪr/","extraExplanation":["“pontoneer”在现代英语里较少见，更常见的拼写是“pontooner”。两者通常都指军用工兵中负责舟桥/浮桥的人员。","词根来自“pontoon”（浮筒、舟桥），常出现在军事史、工兵部队、战争回忆录等语境中。"]}
{"word":"pontonier","summary":{"en":"A pontonier is a military engineer who builds or operates pontoon (floating) bridges.","zh":"pontonier 指负责架设或操作舟桥（浮桥）的军队工兵/舟桥兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soldier or engineer who builds, maintains, or operates pontoon bridges (floating bridges), especially for military crossings","zh":"（尤指军队中的）舟桥兵；架设、维护或操作浮桥（舟桥）的人"},"examples":[{"en":"The pontonier team assembled a pontoon bridge so the vehicles could cross the river.","zh":"舟桥兵小队搭起了一座浮桥，让车辆得以渡河。"},{"en":"During the exercise, the pontoniers practiced launching boats and connecting bridge sections.","zh":"在演习中，舟桥兵练习下水船只并连接桥面模块。"}]}],"synonyms":["combat engineer","military engineer","bridge engineer","pontoon-bridge builder"],"phonetic":"/ˌpɑn.təˈnɪr/","extraExplanation":["“pontonier”常见于军事语境，尤其是工兵（engineers）部队中负责“pontoon bridge（舟桥/浮桥）”任务的人。现代军队也会用更通用的说法如“combat engineer（战斗工兵）”或“bridge engineer（桥梁工兵）”。","词源上与法语 *ponton*（浮桥/平底船）有关，因此拼写看起来偏“欧陆风格”。在英式英语里也可见拼写与用法相近的“pontooner”（较少见）。"]}
{"word":"pontons","summary":{"en":"Pontons are floating boats/structures used as supports on water, often for temporary bridges.","zh":"Pontons 指水上支撑用的浮筒/浮船，常用于搭建临时浮桥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ponton/pontoon) Flat-bottomed boats or floating structures used to support something on water, especially a temporary bridge or platform.","zh":"（ponton/pontoon 的复数）浮筒/平底浮船；用来在水上支撑结构的漂浮装置，尤指临时桥或平台的支撑体。"},"examples":[{"en":"The engineers assembled pontons to build a temporary bridge across the river.","zh":"工程兵组装浮筒，在河上搭起一座临时桥。"},{"en":"During the flood, the rescue team used pontons to reach stranded families.","zh":"洪水期间，救援队用浮筒船去救援被困的家庭。"}]}],"synonyms":["pontoons","floats","buoys","rafts"],"phonetic":"/pɑnˈtun/","extraExplanation":["“ponton / pontoon”常见于军事与工程语境，尤其是“pontoon bridge（浮桥）”。它指靠一排浮筒（pontons/pontoons）提供浮力来承重的临时桥梁，便于快速架设与拆除。","拼写提醒：英语里更常见的复数是“pontoons”。“pontons”也会出现，更多见于某些历史/地区用法或受法语影响的拼写。"]}
{"word":"pontoon","summary":{"en":"A pontoon is a floating platform/float used to support structures (often a floating bridge), and it can also mean a leisure pontoon boat.","zh":"pontoon 指用于支撑水上结构的浮台/浮筒（常见于浮桥），也可指休闲用的浮筒船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat boat or floating platform (or one of several connected floats) used to support a bridge, dock, or other structure on water.","zh":"（可漂浮的）平底船/浮台；也指用来支撑浮桥、码头等水上结构的浮筒（之一）。"},"examples":[{"en":"The engineers built a pontoon bridge to let vehicles cross the river.","zh":"工程兵搭建了一座浮桥，让车辆穿过河流。"},{"en":"The dock is supported by pontoons, so it rises and falls with the tide.","zh":"这个码头由浮筒支撑，因此会随潮汐升降。"}]},{"partOfSpeech":"v.","definition":{"en":"To support or carry something on pontoons; to build or use a floating bridge.","zh":"用浮筒支撑/承载；架设或使用浮桥。"},"examples":[{"en":"They pontooned the equipment across the lake.","zh":"他们用浮筒把设备运过了湖面。"}]},{"partOfSpeech":"n.","definition":{"en":"A pontoon boat: a leisure boat with one or more large floats that keep it stable.","zh":"浮筒船：底部有一个或多个大型浮筒、稳定性强的休闲船。"},"examples":[{"en":"We rented a pontoon for a slow cruise around the bay.","zh":"我们租了一艘浮筒船，在海湾里慢慢巡游。"}]}],"synonyms":["float","floating platform","pontoon boat","floating bridge (phrase)"],"phonetic":"/pɑnˈtun/","extraExplanation":["“pontoon”常见于军事与工程语境，尤其是“pontoon bridge（浮桥）”。在一些历史叙事与战争题材作品里，浮桥常被用来表现部队快速机动、跨越河流的能力。","词源上来自法语 ponton，与“pont（桥）”同源，因此它常与“桥/支撑”这一功能联想在一起。"]}
{"word":"pontooneer","summary":{"en":"A pontooner is someone who works with pontoon bridges or pontoon equipment, often in a military engineering role.","zh":"pontooner 指从事舟桥/浮桥及浮筒装备作业的人，常见于军事工兵语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a soldier or engineer) who builds, operates, or works with pontoon bridges or pontoon equipment.","zh":"（常指士兵或工程人员）搭建、操作或使用浮桥（舟桥）及相关浮桥器材的人。"},"examples":[{"en":"The pontooner assembled the floating bridge so vehicles could cross the river.","zh":"舟桥兵搭起浮桥，让车辆可以渡过河流。"},{"en":"During the exercise, pontooners practiced deploying pontoons quickly.","zh":"在演习中，舟桥兵练习快速展开浮筒装备。"}]}],"synonyms":["pontoon engineer","combat engineer","bridge builder"],"phonetic":"/ˌpɑn.tuˈnɪr/","extraExplanation":["“pontooneer”更常见的拼写是“pontooner”。词根来自“pontoon”（浮筒、舟桥），常见于军事语境（如工兵部队搭设舟桥/浮桥），也可泛指从事浮桥设备作业的人。"]}
{"word":"pontooner","summary":{"en":"A pontooner is a person who builds or operates pontoon bridges (often in the military), or someone who operates a pontoon boat.","zh":"pontooner 指搭建/操作浮桥（多见于军队工兵）的人员，也可指操作浮筒船的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier or worker (especially in military engineering) who builds, uses, or operates pontoon bridges and floating structures.","zh":"（尤指军队工兵中的）舟桥兵；负责搭建、使用或操作浮桥（舟桥）等漂浮结构的人。"},"examples":[{"en":"During the war, the pontooners built a bridge across the river overnight.","zh":"战争期间，舟桥兵一夜之间在河上架起了一座浮桥。"},{"en":"The pontooner checked the floating sections to make sure vehicles could cross safely.","zh":"舟桥兵检查了各个浮桥段，确保车辆能安全通过。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who works on or operates a pontoon boat (a boat supported by floating tubes).","zh":"操作或从事浮筒船（庞通船）相关工作的人。"},"examples":[{"en":"A local pontooner ferried tourists to the quiet side of the lake.","zh":"当地一位浮筒船船工把游客渡到湖的静谧一侧。"},{"en":"Ask the pontooner where to wear a life jacket before you board.","zh":"上船前问问船工救生衣该怎么穿。"}]}],"synonyms":["bridge builder","combat engineer","engineer","pontoon boat operator"],"phonetic":"/pɑnˈtuːnɚ/","extraExplanation":["“pontooner”常见于军事语境，和“pontoon bridge（浮桥/舟桥）”密切相关。在英美军队传统中，pontooners 通常属于工兵（engineers），负责快速架桥、保障部队与车辆渡河。","词根提示：pontoon 来自法语，指“浮筒/浮舟”；加上 -er 表示“从事某事的人”，因此 pontooner 字面义就是“做浮筒/浮桥工作的人”。","现代日常英语里更常说 “combat engineer / engineer unit” 或直接说 “bridge builders”；在休闲水上活动中则多说 “pontoon boat operator”。"]}
{"word":"pontooning","summary":{"en":"Pontooning means going out on a pontoon boat for leisure, or (less commonly) using pontoons to build or operate a temporary bridge.","zh":"Pontooning 指乘坐/驾驶浮筒船进行休闲游船；较少见时也可指用浮筒架设或使用临时浮桥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Recreational boating on a pontoon boat (a flat-deck boat supported by floating tubes), often used for relaxed cruising on lakes or rivers.","zh":"乘坐或驾驶浮筒船（一种由浮筒支撑的平底甲板船）进行休闲游船活动，常见于湖泊或河流的轻松巡航。"},"examples":[{"en":"We went pontooning on the lake and watched the sunset.","zh":"我们去湖上坐浮筒船游玩，一边看日落。"},{"en":"Pontooning is popular with families because the boat feels stable.","zh":"浮筒船游玩很受家庭欢迎，因为船很稳。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of using pontoons to support a structure—especially building or operating a temporary pontoon bridge (often in military or engineering contexts).","zh":"使用浮筒来支撑结构的行为——尤其指搭建或使用临时浮桥（常见于军事或工程语境）。"},"examples":[{"en":"The engineers practiced pontooning to cross the river quickly.","zh":"工程兵训练用浮桥快速渡河。"},{"en":"Flood conditions complicated the pontooning operation.","zh":"洪水状况使架设浮桥的作业更复杂。"}]}],"synonyms":["pontoon boating","boating","lake cruising","pontoon bridging"],"phonetic":"/pɑnˈtuːnɪŋ/","extraExplanation":["“pontooning”更常见于口语或非正式写法，表示“去坐浮筒船玩”；更正式的表达常用 go boating on a pontoon boat / pontoon boating。","在军事与工程语境里，相关更常见的词组是 pontoon bridge（浮桥）与 pontoon bridging（浮桥架设/架桥行动）。","词根 pontoon 来自法语 ponton（“浮筒、浮桥船”），与 pont（“桥”）同源，所以常和“桥、跨越河流”这类概念一起出现。"]}
{"word":"pontoons","summary":{"en":"Pontoons are floating structures used to support bridges or platforms, and they also refer to the floats (or float-based boats) that provide buoyancy.","zh":"Pontoons 指用于支撑浮桥或平台的浮筒结构，也可指提供浮力的浮筒（或以浮筒为基础的船）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Flat-bottomed floating structures used to support a bridge, platform, or boat (often connected together).","zh":"浮筒；（用于支撑桥梁、平台或船只的）浮体结构（常由多个连接组成）。"},"examples":[{"en":"The army built a pontoon bridge across the river overnight.","zh":"军队一夜之间在河上架起了一座浮桥。"},{"en":"The dock was made of pontoons that rose and fell with the tide.","zh":"码头由浮筒组成，会随潮水升降。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of boat (or part of a boat) that uses one or more large floats for buoyancy, especially a leisure “pontoon boat.”","zh":"浮筒船；（船的一部分）靠一个或多个大浮筒提供浮力的船，常指休闲用浮筒船。"},"examples":[{"en":"We rented a pontoon boat for a slow ride around the lake.","zh":"我们租了一艘浮筒船，在湖上慢慢兜风。"},{"en":"The boat’s pontoons kept it stable even with several passengers onboard.","zh":"船的浮筒让它即使载着好几位乘客也很稳。"}]}],"synonyms":["floats","buoys (context-dependent)","pontoon boats (specific)"],"phonetic":"/pɑnˈtun/","extraExplanation":["“Pontoon”常见于军事与工程语境：pontoon bridge（浮桥）可以快速搭建，用于临时跨越河流或湿地。","在北美语境里，“pontoon boat”很常见，通常是两到三个大型浮筒加上平坦甲板，适合家庭聚会、钓鱼、观光等。"]}
{"word":"pontus","summary":{"en":"Pontus most commonly refers to an ancient Black Sea region (and the Kingdom of Pontus); in Greek mythology, it can also mean the primordial sea-god.","zh":"Pontus 最常指黑海沿岸的古代地区（及本都王国）；在希腊神话中也可指原初的海神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical geography) An ancient region on the southern coast of the Black Sea (in what is now northern Turkey). It later became known as the Kingdom of Pontus.","zh":"（历史地理）黑海南岸的古代地区（今土耳其北部一带）；后来也指“本都王国”。"},"examples":[{"en":"Mithridates VI ruled the Kingdom of Pontus and fought Rome.","zh":"米特里达梯六世统治本都王国，并与罗马作战。"},{"en":"Trade routes connected Pontus with other Black Sea ports.","zh":"贸易路线把本都与其他黑海港口连接起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mythology) In Greek myth, Pontus is the primeval personification of the sea.","zh":"（神话）在希腊神话中，Pontus（本都）是“海”的原初拟人化神祇。"},"examples":[{"en":"In some genealogies, Pontus is listed among the earliest gods.","zh":"在一些神谱中，Pontus 被列为最早期的神祇之一。"}]}],"synonyms":["Kingdom of Pontus","Pontic region","Black Sea region"],"phonetic":"/ˈpɑːntəs/","extraExplanation":["“Pontus”源自希腊语“póntos（海）”。在历史语境里，它常和“Pontic（本都的）”一起出现，如 Pontic Greeks（本都希腊人）、Pontic Mountains（本都山脉）。","文学/史学写作中常见搭配：the Kingdom of Pontus（本都王国）、Pontus Euxinus（古人对黑海的称呼之一，意为“好客的海”，属于较书面/古典表达）。"]}
{"word":"pontvolant","summary":{"en":"Pontvolant (from French) usually refers to a floating/pontoon bridge; in nautical use it can also mean a boat’s upper “flying bridge” deck.","zh":"Pontvolant（源自法语）通常指浮桥/舟桥；在航海语境中也可指船只的上层“飞桥”驾驶甲板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a temporary floating bridge, often made with pontoons or boats.","zh":"（源自法语）浮桥；常由浮箱或船只支撑的临时桥梁。"},"examples":[{"en":"During the flood, engineers built a pontvolant to restore traffic quickly.","zh":"洪水期间，工程人员搭建了一座pontvolant（浮桥）来迅速恢复通行。"},{"en":"The army crossed the river using a pontvolant made of boats and planks.","zh":"军队用由船只和木板搭成的pontvolant（浮桥）渡过河流。"}]},{"partOfSpeech":"n.","definition":{"en":"(nautical) the upper open deck on some boats, used for steering and visibility; a “flying bridge.”","zh":"（航海）某些船只上的上层露天驾驶甲板；“飞桥/上层驾驶台”。"},"examples":[{"en":"They watched the coastline from the pontvolant as the captain steered.","zh":"船长驾驶时，他们在pontvolant（上层驾驶甲板）上眺望海岸线。"}]}],"synonyms":["pontoon bridge","floating bridge","flying bridge"],"phonetic":"/pɑn voʊˈlɑn/","extraExplanation":["“pont volant”在法语里字面意思是“会飞的桥/可移动的桥”，实际常指“临时搭建、可快速架设或可移动的桥”，很多语境下对应英语的pontoon bridge（浮桥）。","在英文资料里更常见的是分开写作“pont volant”，或直接用英语说法；把它写成一个词“pontvolant”较少见，通常出现在借用法语术语的文本中。"]}
{"word":"pony","summary":{"en":"A pony is a small horse; in some varieties of English, it can also mean bangs (a fringe).","zh":"pony 常指“小马”；在某些英语变体中也可指“刘海”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small horse, often strong and sturdy; some types are bred for riding (especially children) or for work.","zh":"小马（体型比一般马小，通常结实；有些品种常用于儿童骑乘或拉运工作）。"},"examples":[{"en":"The children took turns riding the pony at the farm.","zh":"孩子们在农场里轮流骑那匹小马。"},{"en":"A pony can be gentle, but it still needs proper training and care.","zh":"小马可能很温顺，但仍然需要正确的训练和照顾。"},{"en":"She brushed the pony’s mane before the lesson.","zh":"上课前她给小马梳理了鬃毛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Hair) a hairstyle where the front hair is cut to hang over the forehead; bangs.","zh":"（头发）刘海。"},"examples":[{"en":"She got a new pony that frames her face nicely.","zh":"她剪了新的刘海，把脸型衬得很好看。"},{"en":"In British English, “pony” can mean “fringe,” which is “bangs” in American English.","zh":"在英式英语里，pony 有时指 fringe，而在美式英语里叫 bangs（刘海）。"}]}],"synonyms":["small horse","bangs","fringe"],"phonetic":"/ˈpoʊni/","extraExplanation":["“pony”作“刘海”主要见于部分英式或地区用法；在美式英语中更常说“bangs”。","词源上，“pony”来自法语/古法语词汇，原义与“小型马”有关；作为“刘海”的用法更偏口语与地域表达。"]}
{"word":"ponycart","summary":{"en":"A ponycart is a small cart pulled by a pony, used mainly for short, leisurely rides.","zh":"ponycart 指由小马拉的轻便马车，主要用于短途的休闲乘坐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, light cart pulled by a pony, often used for short rides, children’s driving lessons, or leisure outings","zh":"小马拉的轻便马车（常用于短途乘坐、儿童驾车学习或休闲出行）"},"examples":[{"en":"The children rode in a pony cart around the park.","zh":"孩子们坐着小马车在公园里转了一圈。"},{"en":"We booked a pony-cart ride at the farm for the weekend.","zh":"我们周末在农场预订了小马车体验。"}]}],"synonyms":["pony cart","horse-drawn cart","cart","trap (BrE)"],"phonetic":"/ˈpoʊni kɑrt/","extraExplanation":["“pony cart”更常见写法是分开写（two words）。写成“ponycart”通常是非正式或品牌/标题式拼写。","在英式英语里也可能看到“pony and trap”（小马拉的双轮轻便马车）等更传统的说法；在旅游宣传语境中常见如“pony-cart ride”。","该词多与乡村、农场、游园等休闲场景相关；现代城市语境较少使用。"]}
{"word":"ponying","summary":{"en":"“Ponying” usually means (1) riding/using a pony, or (2) in “ponying up,” paying or contributing money.","zh":"“Ponying”通常指（1）骑/用小马；或（2）在短语“ponying up”中表示掏钱、出份子钱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “pony”) riding, using, or working with a pony (a small horse).","zh":"（“pony”的现在分词）骑小马、用小马或与小马一起工作（小型马）。"},"examples":[{"en":"The kids are ponying at the ranch this weekend.","zh":"孩子们这个周末在牧场骑小马。"},{"en":"She’s ponying her horse in a parade, walking alongside it.","zh":"她在游行中牵着马并在旁边步行（牵马随行）。"}]},{"partOfSpeech":"v.","definition":{"en":"In the phrase “ponying up,” paying money—often reluctantly—or contributing your share.","zh":"用于短语“ponying up”，指掏钱（常常有点不情愿）或分摊自己应付的一份。"},"examples":[{"en":"Everyone is ponying up $10 for the gift.","zh":"大家都掏出10美元买礼物。"},{"en":"He finally started ponying up for rent.","zh":"他终于开始按时掏钱付房租了。"},{"en":"If you want to join the trip, you’ll need to pony up.","zh":"如果你想参加这次旅行，你就得出钱。"}]}],"synonyms":["paying (up)","contributing","chipping in","putting in","riding (a pony)"],"phonetic":"/ˈpoʊniɪŋ/","extraExplanation":["“pony up”是很常见的口语表达，语气通常带一点催促或不情愿的感觉（比如“该你出钱了”）。常见于朋友AA、筹款、付账等场景。来源常被认为与赌博/扑克场合的“先把钱押上”有关，但并没有完全统一的定论。"]}
{"word":"ponytail","summary":{"en":"A ponytail is a hairstyle where hair is pulled back and tied to hang down; it can also mean to tie hair that way (less common).","zh":"ponytail 指把头发向后扎起并垂下的“马尾辫/马尾”；也可作动词表示“把头发扎成马尾”（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hairstyle in which the hair is pulled back and tied so that it hangs down from the back of the head.","zh":"马尾辫；把头发向后梳拢并扎起，让头发从后脑勺垂下的一种发型。"},"examples":[{"en":"She wore her hair in a high ponytail for the game.","zh":"她比赛时扎了一个高马尾。"},{"en":"He tied his long hair into a ponytail.","zh":"他把长头发扎成马尾。"},{"en":"Put your hair in a ponytail so it won’t get in your face.","zh":"把头发扎成马尾吧，这样就不会挡住脸。"}]},{"partOfSpeech":"vt.","definition":{"en":"To tie hair back into a ponytail.","zh":"（把头发）扎成马尾。"},"examples":[{"en":"She ponytailed her hair before class.","zh":"她上课前把头发扎成马尾。"},{"en":"He quickly ponytailed his hair and left the house.","zh":"他迅速把头发扎成马尾就出门了。"}]}],"synonyms":["tail (hairstyle)","pigtail (related, usually two)"],"phonetic":"/ˈpoʊniˌteɪl/","extraExplanation":["“ponytail”这个名字来自“像小马的尾巴一样垂下”的形状。日常英语里更常用作名词；作动词时比较口语、少见一些。","常见搭配：high ponytail（高马尾）、low ponytail（低马尾）、side ponytail（侧马尾）、ponytail holder / hair tie（发圈/橡皮筋）。","文化提示：在不同场合（学校、运动、职场）对发型的要求可能不同；“wear your hair in a ponytail”是比较中性、礼貌的说法。"]}
{"word":"ponytails","summary":{"en":"Ponytails are a hairstyle where hair is tied back and hangs down.","zh":"ponytails 指把头发在脑后扎起并垂下的发型（马尾辫/马尾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hairstyle in which the hair is gathered and tied back so it hangs down from the back of the head.","zh":"马尾辫（把头发在脑后扎起并垂下的一种发型）。"},"examples":[{"en":"She wore her hair in a ponytail for practice.","zh":"她练习时把头发扎成马尾。"},{"en":"He tied his long hair into a low ponytail.","zh":"他把长发扎成一个低马尾。"},{"en":"Please keep ponytails and loose hair away from the machine.","zh":"请让马尾和散落的头发远离机器。"}]}],"synonyms":["ponytail","pigtail (if two)","hair tie style"],"phonetic":"/ˈpoʊniˌteɪl/","extraExplanation":["“ponytail”这个词来自“pony（小马）+ tail（尾巴）”，因为这种发型垂下的形状像马尾巴。","拼写上既可写作一个词“ponytail”，也常见两词形式“pony tail”；日常英语里更常用一个词。复数是“ponytails”。"]}
{"word":"ponzite","summary":{"en":"“Ponzi” usually refers to a Ponzi scheme: a fraud that uses new investors’ money to pay earlier investors, not real profits.","zh":"“Ponzi”通常指“庞氏骗局”：用新投资者的钱支付早期投资者回报的投资诈骗，而非真实盈利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fraudulent investment plan that pays early investors with money from new investors, not from real profits (often called a “Ponzi scheme”)","zh":"庞氏骗局：一种投资诈骗，用后来投资者的钱去支付早期投资者的回报，并非来自真实盈利"},"examples":[{"en":"It turned out the ‘investment fund’ was a Ponzi scheme.","zh":"结果那个“投资基金”其实是庞氏骗局。"},{"en":"Ponzi schemes often collapse when new investors stop coming.","zh":"庞氏骗局常常在新投资者不再加入时崩盘。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or involving a Ponzi scheme","zh":"与庞氏骗局有关的；具有庞氏骗局性质的"},"examples":[{"en":"Regulators warned about Ponzi-like returns that sounded too good to be true.","zh":"监管机构警告说，那些“好得不像真的”的回报很像庞氏骗局。"},{"en":"They were charged with running a Ponzi operation.","zh":"他们被指控经营庞氏骗局。"}]}],"synonyms":["pyramid scheme","investment scam","fraud","con"],"phonetic":"/ˈpɑnzi/","extraExplanation":["你输入的“ponzite”更常见是拼写误差；英语里通常写作 Ponzi（庞氏）或 Ponzi scheme（庞氏骗局）。","“Ponzi”来自 Charles Ponzi（查尔斯·庞兹），他在20世纪初用类似方式行骗，因此这种模式以他的姓命名。","学习提示：如果你想表达“把某事做成庞氏骗局/用庞氏手法操作”，英语更自然的说法是 run a Ponzi scheme（经营庞氏骗局）或 a Ponzi-like scheme（类似庞氏的骗局）；“ponzite”不属于常见标准用词。"]}

