{"word":"pov","summary":{"en":"POV means “point of view”—your perspective or stance; online it also labels first-person-style videos or memes.","zh":"POV是“point of view（观点/视角）”的缩写；在网络上也常用来标注第一人称视角的短视频或梗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"point of view; the position, opinion, or perspective from which someone thinks, speaks, or tells a story.","zh":"观点；视角；立场；（叙事中的）视点。"},"examples":[{"en":"From my POV, this plan is too risky.","zh":"从我的角度看，这个计划太冒险了。"},{"en":"The movie switches POV to show what each character knows.","zh":"这部电影切换叙事视角来展示每个角色知道的事。"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet slang) a post, video, or meme filmed/written as if the audience is seeing through a particular person’s eyes.","zh":"（网络用语）“POV：……”式内容；用某个人的第一人称视角来拍/写的短视频、梗图或段子。"},"examples":[{"en":"POV: You walk into class late and everyone looks at you.","zh":"POV：你迟到了走进教室，所有人都看着你。"},{"en":"She makes funny POV videos about customer service jobs.","zh":"她做很多关于客服工作的搞笑POV短视频。"}]}],"synonyms":["perspective","viewpoint","stance","angle","take"],"phonetic":"/pɔv/","extraExplanation":["“POV”是point of view的缩写，常见于聊天、社交媒体和影评/书评。正式写作里更常直接写出point of view。","叙事里常见的POV类型：第一人称（I/we）、第三人称有限（贴近某个角色）、第三人称全知（讲述者知道所有人的想法）。网络“POV：……”通常模仿第一人称体验，但有时也会被用得不严格。"]}
{"word":"poverish","summary":{"en":"Impoverish means to make someone/something poor or to weaken it by taking away resources or richness.","zh":"impoverish 表示“使贫穷”或“使资源/内容变得贫乏、被削弱”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something poor; to reduce wealth, resources, or quality","zh":"使贫穷；使资源减少；使（质量/内容）贫乏"},"examples":[{"en":"The long war impoverished many families in the region.","zh":"长期战争使该地区许多家庭陷入贫困。"},{"en":"Overfarming can impoverish the soil and lower crop yields.","zh":"过度耕作会使土壤贫瘠，降低农作物产量。"},{"en":"Cuts to arts education can impoverish a community’s cultural life.","zh":"削减艺术教育会使一个社区的文化生活变得贫乏。"}]}],"synonyms":["make poor","ruin","bankrupt","deprive","exhaust","drain"],"phonetic":"/ɪmˈpɑvərɪʃ/","extraExplanation":["词源提示：im-（使……）+ poor（贫穷的）+ -ish（使变得……），整体含义就是“使变穷/使变贫乏”。","常见搭配：impoverish a family/region（使家庭/地区贫困）；impoverish the soil（使土壤贫瘠）；impoverish culture/language/life（使文化/语言/生活变得贫乏）。","语感区别：impoverish 往往带有“被削弱、被掏空”的感觉，不只指没钱，也可指资源、环境或精神文化层面的“贫乏”。","同族词：impoverished（adj. 贫困的；资源匮乏的），如 an impoverished neighborhood（贫困社区）。"]}
{"word":"poverishment","summary":{"en":"Impoverishment means the condition of being poor or the process of becoming poor (or being made poor).","zh":"Impoverishment 指“贫困的状态”，也可指“变得贫困/被致贫的过程”（也可用于土壤等变得贫乏、贫瘠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being poor or having too little money, resources, or opportunities.","zh":"贫困；缺乏金钱、资源或机会的状态。"},"examples":[{"en":"The report links child poverty to long-term impoverishment.","zh":"报告把儿童贫困与长期的贫困化联系起来。"},{"en":"Years of drought led to the impoverishment of many farming families.","zh":"多年的干旱导致许多农户陷入贫困。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of making someone or something poor or weaker by taking away resources, money, or richness.","zh":"使贫困（化）的过程；使某人或某物因资源/财富/养分减少而变得更贫乏。"},"examples":[{"en":"War can cause the impoverishment of entire communities.","zh":"战争可能导致整个社区的贫困化。"},{"en":"Overfarming may result in the impoverishment of the soil.","zh":"过度耕作可能导致土壤贫瘠化。"}]}],"synonyms":["poverty","destitution","deprivation","penury","indigence"],"phonetic":"/ɪmˈpɑvərɪʃmənt/","extraExplanation":["词源上来自 impoverish（使贫困）+ -ment（名词后缀，表示“……的状态/结果”）。因此 impoverishment 常指“贫困的状态”或“变得贫困的过程”。","在社会议题语境中，impoverishment 比 plain “poverty” 更强调“被削弱/被剥夺资源而变穷”的过程感；在环境/农业语境中也常用于指“土壤贫瘠化（soil impoverishment）”。"]}
{"word":"poverties","summary":{"en":"Poverties is the plural of poverty, used mainly to talk about different kinds or instances of poverty; less commonly, it can mean serious lacks or weaknesses.","zh":"poverties 是 poverty 的复数，主要用于指不同类型或不同情境下的贫困；较少情况下可比喻为严重不足或缺陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of poverty: different kinds or instances of poverty (very little money and resources)","zh":"poverty（贫穷）的复数：不同类型或不同情况下的贫困（缺乏金钱与资源）"},"examples":[{"en":"The report compares rural and urban poverties.","zh":"这份报告比较了农村与城市的贫困状况。"},{"en":"War and disease can create new poverties in a region.","zh":"战争和疾病可能在一个地区制造新的贫困问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, less common) serious lacks or weaknesses; shortages in something important","zh":"（比喻，用得较少）严重的不足、缺陷；重要方面的匮乏"},"examples":[{"en":"The essay has poverties of evidence and clear examples.","zh":"这篇文章在证据和清晰例子方面很欠缺。"},{"en":"She criticized the poverties in the city’s public services.","zh":"她批评了这座城市公共服务的不足。"}]}],"synonyms":["forms of poverty","types of poverty","deprivation","hardship","lacks","deficiencies"],"phonetic":"/ˈpɑvərtiz/","extraExplanation":["“poverty”通常是不可数名词（poverty is rising）。当你强调“不同类型/不同地区/不同层面的贫困”时，才会用复数“poverties”。","在学术写作里更常见“forms of poverty / different kinds of poverty”来避免复数形式显得生硬。"]}
{"word":"poverty","summary":{"en":"Poverty means extreme lack of money/resources for basic living, and it can also mean a serious lack of a particular quality (e.g., ideas).","zh":"Poverty 指“贫困/穷困”，也可引申为某种品质或数量的“匮乏”（如创意匮乏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being very poor; not having enough money or resources to meet basic needs (like food, housing, healthcare)","zh":"贫困；贫穷状态；缺乏足够金钱或资源以满足基本需求（如食物、住房、医疗）"},"examples":[{"en":"Many families live in poverty and struggle to pay for rent and food.","zh":"许多家庭生活在贫困中，连房租和食物都难以负担。"},{"en":"She grew up in poverty but worked hard to change her life.","zh":"她在贫困中长大，但努力奋斗改变了人生。"},{"en":"The report highlights child poverty in rural areas.","zh":"这份报告强调了农村地区的儿童贫困问题。"}]},{"partOfSpeech":"n.","definition":{"en":"a lack of a particular quality or amount; scarcity (often used in phrases like “poverty of imagination”)","zh":"（某种品质或数量的）匮乏；缺乏（常见于“poverty of + 名词”，如“想象力的匮乏”）"},"examples":[{"en":"The film suffers from a poverty of ideas.","zh":"这部电影的问题在于创意匮乏。"},{"en":"A poverty of vocabulary can make writing unclear.","zh":"词汇匮乏会让写作不够清晰。"}]}],"synonyms":["destitution","privation","hardship","penury","indigence","scarcity"],"phonetic":"/ˈpɑːvərti/","extraExplanation":["“Poverty”既可以指经济意义上的“贫困”，也可以比喻某种“缺乏/匮乏”。在社会议题中常见搭配有：poverty line（贫困线）、fight/reduce poverty（反贫困/减少贫困）、extreme poverty（极端贫困）。","在文学与公共讨论中，“poverty”常与不平等、机会缺失等主题相连；使用时注意避免把贫困当作个人道德问题，更常见、更尊重的表达是强调结构性原因（如教育、就业、政策、地域差异）。"]}
{"word":"poverty trap","summary":{"en":"A “poverty trap” is a self-reinforcing situation that keeps people in poverty, often because limited resources and incentives make it hard to improve their income.","zh":"“poverty trap（贫困陷阱）”指一种自我强化的困境：资源与激励不足让人难以提升收入，导致长期停留在贫困中。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A situation where people remain poor because low income makes it hard to access education, healthcare, assets, or opportunities that could help them earn more.","zh":"一种“越穷越难翻身”的处境：因为收入太低，难以获得教育、医疗、资产或机会，从而长期停留在贫困状态。"},"examples":[{"en":"Without affordable childcare, many parents get stuck in a poverty trap.","zh":"没有负担得起的托儿服务，许多家长就会陷入“贫困陷阱”。"},{"en":"The report says poor schools and low wages can create a poverty trap.","zh":"报告指出，薄弱的学校教育和低工资可能造成贫困陷阱。"}]},{"partOfSpeech":"phrase","definition":{"en":"In economics and public policy, a pattern where some benefits or taxes reduce a person’s incentive to work more because extra earnings lead to losing support, so their net income barely rises.","zh":"在经济学/公共政策中：某些补贴或税制让人“多挣一点就少拿补助”，导致继续增加工作或收入的动力变弱，净收入几乎不增长的模式（也叫福利陷阱的一种）。"},"examples":[{"en":"If earning a little more means losing housing support, that can become a poverty trap.","zh":"如果多赚一点就失去住房补助，就可能形成贫困陷阱。"},{"en":"Policymakers try to design programs that avoid a poverty trap.","zh":"政策制定者会努力设计项目来避免贫困陷阱。"}]}],"synonyms":["vicious cycle of poverty","welfare trap","cycle of poverty"],"phonetic":"/ˈpɑvɚti træp/","extraExplanation":["“poverty trap”常用于新闻、社会学与经济学语境，强调贫困是“系统性循环”而不只是个人选择。","相关表达：vicious cycle of poverty（贫困的恶性循环）、welfare trap（福利陷阱，侧重补助制度带来的工作激励问题）、debt trap（债务陷阱）。"]}
{"word":"povertyweed","summary":{"en":"“Povertyweed” is a common (non-scientific) name for certain fast-spreading weeds, often in dry or poor soil.","zh":"“povertyweed”是某些易蔓延杂草的俗名，常见于干旱或贫瘠土壤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for certain wild plants that spread easily and are considered weeds, especially in dry or poor soil (in North America often referring to plains/western ragweed).","zh":"一些容易蔓延、常被视为杂草的野生植物的俗名，尤指在干旱或贫瘠土壤中生长的杂草（在北美常指“平原/西部豚草”一类）。"},"examples":[{"en":"The yard was taken over by povertyweed after a dry summer.","zh":"干旱的夏天过后，院子里被贫穷草（povertyweed）占满了。"},{"en":"Farmers try to control povertyweed because it competes with crops for water.","zh":"农民会设法控制贫穷草，因为它会和作物争夺水分。"}]}],"synonyms":["poverty weed","plains ragweed","western ragweed"],"phonetic":"ˈpɑvɚtiˌwid","extraExplanation":["“povertyweed/poverty weed”是俗名而不是严格的学名，不同地区可能指不同植物；在北美语境里常见指 Iva axillaris（常被叫作plains ragweed/western ragweed）。","写法上常见两种：povertyweed（合写）与poverty weed（分写），含义通常相同。","之所以叫“poverty weed”，多与它常在贫瘠土地、荒地或管理较差的地块中大量出现有关；属于带有民间命名色彩的说法。"]}
{"word":"povindah","summary":{"en":"Not a standard English word; likely a misspelling or a name/term from another language.","zh":"不是标准英语单词；更可能是拼写错误，或人名/外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“povindah” is not a recognized English word in standard dictionaries. It may be a misspelling, a name, or a word from another language.","zh":"“povindah”不是标准英语词典中的单词；它可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “povindah” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“povindah”——你能给我它出现的句子吗？"},{"en":"If you meant “provider,” the spelling is different.","zh":"如果你想写的是“provider（供应者）”，拼写会不一样。"}]}],"extraExplanation":["在英语学习中，遇到查不到的“词”，常见原因有：①拼写打错（多一个/少一个字母）；②网络昵称/人名/地名；③其他语言的音译；④缩写或圈内用语。","你可以把它出现的上下文（完整句子、截图文字）发来，或告诉我是从哪里看到的（游戏、歌曲、社交媒体等），我就能更准确判断它可能是什么词。"]}

