{"word":"POW","summary":{"en":"POW most commonly means “prisoner of war.” It can also be an informal comic-style sound for a punch or impact.","zh":"POW最常见意思是“战俘”。它也可作非正式拟声词，表示打击或撞击的声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prisoner of war; a soldier or combatant captured and held by an enemy during a war","zh":"战俘；在战争中被敌方俘虏并关押的士兵或战斗人员"},"examples":[{"en":"The camp held hundreds of POWs after the battle.","zh":"战斗结束后，营地关押了数百名战俘。"},{"en":"International law says POWs must be treated humanely.","zh":"国际法规定必须人道对待战俘。"},{"en":"He was a POW for two years before being released.","zh":"他当了两年战俘后才获释。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal, in comics or speech) a sound effect for a punch or impact","zh":"（非正式，常见于漫画/口语）“砰/啪”的拟声词，表示打击或撞击声"},"examples":[{"en":"In the comic, the hero hits the villain—POW!","zh":"在漫画里，英雄打中反派——“砰！”"},{"en":"He slammed the door shut, and I said, “POW, that was loud.”","zh":"他把门猛地关上，我说：“砰！真响。”"}]}],"synonyms":["prisoner of war","captive","detainee","pow (sound effect)","wham","bam"],"phonetic":"/ˌpiːoʊˈdʌbəljuː/","extraExplanation":["“POW”是缩写，来自“Prisoner of War”。在新闻、军事历史、纪录片中很常见。写作时通常全大写（POW），复数常写作 POWs。","与 POW 相关的常见表达：POW camp（战俘营）、POW status（战俘身份）、POW/MIA（战俘/失踪人员，常见于美国军方语境）。"]}
{"word":"pow","summary":{"en":"“Pow” is an informal word for a punch or the act of punching, and it’s also a comic-book sound effect for a hit.","zh":"“pow”可指（非正式）打人/一拳，也常作漫画里的击打拟声词（如“砰！”“啪！”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hit or strike someone or something, usually with a fist (informal).","zh":"（非正式）用拳头打；猛击。"},"examples":[{"en":"He threatened to pow anyone who touched his bike.","zh":"他威胁说谁碰他的自行车就揍谁。"},{"en":"The boxer powered forward and tried to pow his opponent.","zh":"拳击手猛冲上去，想用重拳击中对手。"}]},{"partOfSpeech":"n.","definition":{"en":"a blow or punch (informal).","zh":"（非正式）一拳；一记猛击。"},"examples":[{"en":"He gave the bully a quick pow to the shoulder.","zh":"他迅速给了那个霸凌者肩膀一拳。"},{"en":"With one loud pow, the door slammed shut.","zh":"随着一声很响的“砰”，门砰地关上了。"}]},{"partOfSpeech":"int.","definition":{"en":"used in comics to represent the sound of a hit, like “bam!” or “pow!”","zh":"（漫画拟声）表示击打声，相当于“砰！”“啪！”"},"examples":[{"en":"In the comic, the hero shouts, “POW!” as he punches the robot.","zh":"在漫画里，英雄打机器人时喊：“POW！”"},{"en":"The page was full of action words like “BAM,” “POW,” and “ZAP.”","zh":"那一页充满了动作音效词，比如“BAM”“POW”“ZAP”。"}]}],"synonyms":["punch","hit","smack","sock (informal)","whack (informal)","bam (sound effect)"],"phonetic":"/paʊ/","extraExplanation":["“pow”最常见于漫画拟声词（尤其是英美漫画中），用来夸张地表现打斗声效。作为动词/名词时带有强烈口语色彩，日常正式场合更常用“hit / punch / strike”。","注意别和缩写“POW”混淆：POW 也常指“prisoner of war”（战俘）。"]}
{"word":"pow-wow","summary":{"en":"“Pow-wow” can mean an informal meeting for discussion, and it also refers to a Native American/Indigenous gathering or ceremony.","zh":"“pow-wow”既可指非正式的讨论会/碰头会，也可指北美原住民/原住民族的集会或庆典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A meeting or gathering for discussion (often informal).","zh":"（常指非正式的）讨论会；碰头会。"},"examples":[{"en":"Let’s have a quick pow-wow after lunch to plan the next steps.","zh":"我们午饭后快速开个碰头会，规划下一步。"},{"en":"The team held a short pow-wow to solve the problem.","zh":"团队开了个简短的讨论会来解决问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A social gathering or ceremony of Native American/Indigenous peoples, often featuring singing, dancing, and community events.","zh":"（北美原住民／原住民族的）集会／庆典（常包含歌舞与社区活动）。"},"examples":[{"en":"They attended a community pow-wow with traditional drumming and dancing.","zh":"他们参加了一个社区原住民庆典，有传统的击鼓和舞蹈。"},{"en":"The pow-wow welcomed visitors, but guests were asked to follow event guidelines respectfully.","zh":"该庆典欢迎访客，但要求来宾遵守活动规则、保持尊重。"}]},{"partOfSpeech":"v.","definition":{"en":"To meet and talk for a short time; to hold a discussion.","zh":"（短暂地）会面商量；开会讨论。"},"examples":[{"en":"We need to pow-wow and decide who will present.","zh":"我们得商量一下，决定谁来做展示。"},{"en":"The managers pow-wowed about the new schedule.","zh":"经理们就新排班进行了讨论。"}]}],"synonyms":["meeting","huddle","conference","gathering","discussion","check-in"],"phonetic":"/ˈpaʊˌwaʊ/","extraExplanation":["“pow-wow”源自阿尔冈昆语系（Algonquian languages）中与“灵性领袖/疗愈者”等相关的词，后来在英语里逐渐指原住民集会与庆典。","在日常英语里把它当作“碰头会”很常见，但也可能被一些人认为带有挪用（cultural appropriation）或刻板印象的历史色彩。更中性的替代说法包括：meeting, huddle, quick chat, check-in。","如果你在描述原住民族文化活动，最好用其正式语境（如 community powwow / powwow event），并尊重活动礼仪与用词。"]}
{"word":"powan","summary":{"en":"“powan” is not a common standard English word; it is most likely a rare spelling of the South Asian name “Pawan,” and can also refer (uncommonly in English) to the Hindi/Urdu word for “wind.”","zh":"“powan”不是常见的标准英文词；更可能是南亚人名“Pawan”的少见拼写，也可（在英语中较少见）指印地语/乌尔都语里“风”的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A given name, most commonly seen as a South Asian name (more often spelled “Pawan”).","zh":"（专有名词）人名，常见于南亚地区（更常见拼写为 Pawan）。"},"examples":[{"en":"Powan is a rare spelling; you may also see it written as Pawan.","zh":"Powan 是比较少见的拼写；你也可能看到写作 Pawan。"},{"en":"Powan moved to Chicago for graduate school.","zh":"Powan 去芝加哥读研究生了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Loanword, uncommon in English) “Wind,” from Hindi/Urdu usage (usually transliterated as “pawan”).","zh":"（外来词，英语中少见）“风”，源自印地语/乌尔都语用法（通常音译为 pawan）。"},"examples":[{"en":"In Hindi, pawan means “wind.”","zh":"在印地语中，pawan 的意思是“风”。"},{"en":"Some poems use pawan to evoke the feeling of a soft breeze.","zh":"一些诗歌会用 pawan 来营造微风拂面的感觉。"}]}],"synonyms":["Pawan"],"phonetic":"/pəˈwɑn/","extraExplanation":["“Pawan/पवन”源自梵语“Pavana”，常与“风、空气、清风”相关，也常被用作男性名字。在英语语境里，多见于人名；如果你是在查英文词汇本身，powan 不是常见标准英文单词，可能是人名拼写或把 Pawan 误拼成了 Powan。"]}
{"word":"powcat","summary":{"en":"“Powcat” is not a standard dictionary word; it’s usually a made-up name (often “pow” + “cat”) used online or as a brand/character name.","zh":"“Powcat”不是标准词汇；通常是自创名称（常被理解为“pow + cat”），多用于网络昵称、品牌或角色名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal or invented word, often used online as a username, brand name, or character name (commonly interpreted as “pow” + “cat,” suggesting a strong, punchy, or energetic cat).","zh":"一个非正式或自创的词，常见于网络用户名、品牌名或角色名（通常可理解为“pow（砰/一拳的声音）+ cat（猫）”，带有“很有力量/很有冲劲的猫”的感觉）。"},"examples":[{"en":"My friend goes by “Powcat” in online games.","zh":"我朋友在网游里用“Powcat”当昵称。"},{"en":"The artist signed the poster as Powcat.","zh":"那位艺术家在海报上签名为 Powcat。"}]}],"synonyms":["username","screen name","handle","nickname"],"phonetic":"/ˈpaʊˌkæt/","extraExplanation":["“powcat”不是常见英语词典里的标准词汇，更像是自创合成词或专有名称。读者通常会按英语构词习惯把它拆成“pow + cat”来理解，其中“pow”是拟声词，类似漫画里表示打击或爆炸的“砰！”“哐！”的效果。","如果你是在特定平台/作品里看到Powcat（例如游戏角色、品牌、GitHub 项目等），它的准确含义往往取决于该语境；你也可以告诉我出处，我可以帮你更贴切地解释。"]}
{"word":"powder","summary":{"en":"“Powder” usually means a fine dry substance (like cocoa powder), can also mean face makeup powder, and as a verb it means to sprinkle or cover with fine powder.","zh":"“powder”通常指“粉末”（如可可粉）；也可指“化妆用的粉”；作动词表示“撒粉/用粉覆盖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dry substance made of very small, fine particles.","zh":"粉末；由非常细小颗粒组成的干燥物质。"},"examples":[{"en":"Add a little cocoa powder to the milk.","zh":"在牛奶里加一点可可粉。"},{"en":"The room was covered in dust and powder after the old wall broke.","zh":"旧墙倒塌后，房间里满是灰尘和粉末。"}]},{"partOfSpeech":"n.","definition":{"en":"A cosmetic product in fine particles used on the face to reduce shine or even the skin tone.","zh":"（化妆用）散粉/粉饼；用于控油或均匀肤色的粉状化妆品。"},"examples":[{"en":"She put on powder before going on stage.","zh":"她上台前扑了点粉。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover something with powder; to sprinkle fine powder on it.","zh":"把……撒上粉；用粉覆盖。"},"examples":[{"en":"Powder the cake with sugar before serving.","zh":"上桌前在蛋糕上撒些糖粉。"},{"en":"The chef powdered the fish with flour.","zh":"厨师在鱼上薄薄地裹了一层面粉。"}]}],"synonyms":["dust","fine powder","sprinkle","coat"],"phonetic":"/ˈpaʊdər/","extraExplanation":["“powder”作名词时也常出现在固定搭配里：例如“milk powder（奶粉）”“laundry powder（洗衣粉）”“protein powder（蛋白粉）”。","在历史或文学语境中，“powder”有时会让人联想到“gunpowder（火药）”；不过日常语境里更常指食物粉末或化妆粉。"]}
{"word":"powderable","summary":{"en":"“Powderable” means something can be turned into powder or is suitable to be provided/applied as a powder.","zh":"“powderable”指某物“可被制成粉末/适合以粉末形式提供或使用”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made into a powder (easy to crush, grind, or process into fine particles).","zh":"可被制成粉末的；容易被碾碎/研磨成粉的。"},"examples":[{"en":"The dried mushrooms are powderable, so you can grind them into seasoning.","zh":"干蘑菇是可研磨成粉的，所以你可以把它磨成调味粉。"},{"en":"This tablet is powderable, but ask a pharmacist before crushing medicine.","zh":"这片药是可以碾成粉的，但在碾碎药物前先咨询药师。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be supplied or applied in powder form (common in manufacturing, chemicals, and agriculture).","zh":"可制成粉剂供应或以粉末形式使用的（常见于制造业、化工、农业等语境）。"},"examples":[{"en":"The coating comes in a powderable form for industrial use.","zh":"这种涂层可提供粉末形态，便于工业使用。"},{"en":"Some pesticides are powderable and are applied as dust on crops.","zh":"有些农药可做成粉剂，用粉尘方式施用于作物上。"}]}],"synonyms":["grindable","crushable","pulverizable","powder-form"],"phonetic":"/ˈpaʊdərəbəl/","extraExplanation":["“powderable”是由名词/动词“powder（粉末；使成粉末）”加形容词后缀“-able（能够……的）”构成，意思就是“能够变成粉末的/可用粉末形式的”。","它比更常见的“powdery（粉状的；满是粉的）”更强调“可加工/可制成粉末”的性质。日常对话中不算高频，更常见于技术说明、产品描述、化学/农业资料等。"]}
{"word":"powdered","summary":{"en":"“Powdered” usually means in powder form or covered with powder; it can also be the past form of “powder.”","zh":"“powdered”通常表示“粉末状的/撒了粉的”，也可以是动词“powder”的过去式或过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made into a fine, dry powder; in the form of powder.","zh":"粉末状的；做成粉末的。"},"examples":[{"en":"Add the powdered sugar and mix slowly.","zh":"加入糖粉，然后慢慢搅拌。"},{"en":"He wore a powdered wig in the historical play.","zh":"他在历史剧中戴着一顶扑粉假发。"}]},{"partOfSpeech":"adj.","definition":{"en":"Coated or dusted with powder.","zh":"撒了粉的；涂了粉的。"},"examples":[{"en":"Her face was lightly powdered for the photos.","zh":"为了拍照，她的脸上轻轻扑了些粉。"},{"en":"The cookies were powdered with cinnamon.","zh":"饼干上撒了肉桂粉。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “powder”: to reduce something to powder or to apply powder to something.","zh":"“powder”的过去式/过去分词：把……磨成粉；给……上粉。"},"examples":[{"en":"The dried peppers were powdered and stored in a jar.","zh":"干辣椒被磨成粉，装进了罐子里。"},{"en":"She powdered her nose before the meeting.","zh":"开会前她给鼻子扑了粉。"}]}],"synonyms":["powdery","ground (into powder)","dusty"],"phonetic":"/ˈpaʊdɚd/","extraExplanation":["“powdered sugar”在美式英语里非常常见，指糖粉；英式英语也常说“icing sugar”。","“powdered wig”带有历史文化色彩，常见于18世纪欧洲上层社会的形象描写，也常出现在戏剧、小说和影视作品里，用来营造复古或权威的氛围。"]}
{"word":"powderer","summary":{"en":"Powderer usually means someone or something that applies powder; historically it could also mean a person who makes or handles gunpowder.","zh":"Powderer 通常指给某物撒粉/扑粉的人或工具；历史上也可指制造或处理火药的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or tool that puts powder on something (for example, to dust the face with cosmetic powder, or to sprinkle powder on food).","zh":"给某物撒粉/扑粉的人或工具（例如给脸上扑化妆粉，或在食物上撒粉）。"},"examples":[{"en":"The makeup artist used a soft brush as a powderer to set her foundation.","zh":"化妆师用一把柔软的刷子当作“扑粉工具”，把底妆定住。"},{"en":"In old recipes, a “powderer” might dust sugar over the cake.","zh":"在一些旧食谱里，“powderer”可能指把糖粉撒在蛋糕上的人/工具。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job involves making or handling gunpowder (an older, less common meaning).","zh":"制造或处理火药的人（较旧、较少见的意思）。"},"examples":[{"en":"In historical records, a powderer was sometimes listed among military suppliers.","zh":"在历史记录中，“powderer”有时会被列为军需供应人员之一。"}]}],"synonyms":["duster","applicator","powder brush","powder puff"],"phonetic":"/ˈpaʊdərər/","extraExplanation":["“powderer”来自动词 powder（撒粉、扑粉）+ 表示“做某事的人/物”的后缀 -er。现代英语里更常说 powderer 这个“人”的意思时，会直接用更具体的词（如 makeup artist 化妆师、baker 面包师），或说 powder brush/compact powder（工具/产品）。","如果你想表达“撒粉的工具”，英语更自然的搭配通常是 powder brush（粉刷/散粉刷）、powder puff（粉扑）或 sugar shaker（糖粉罐）。"]}
{"word":"powderers","summary":{"en":"“Powderers” means people who apply or dust with powder; less commonly, it can mean tools that spread powder.","zh":"“powderers”指扑粉/撒粉的人；较少见时也可指撒粉的工具或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who apply powder (such as face powder) or who dust something with powder.","zh":"使用粉末的人（如扑粉化妆的人），或把粉末撒在某物上的人。"},"examples":[{"en":"In old films, the powderers worked backstage to keep actors’ faces from shining under the lights.","zh":"在老电影里，扑粉的人在后台工作，让演员的脸在灯光下不反光。"},{"en":"The bakery hired extra powderers to dust the pastries with sugar before opening.","zh":"那家面包店雇了额外的人手，在开门前把糖粉撒在点心上。"}]},{"partOfSpeech":"n.","definition":{"en":"Devices or tools that spread powder (less common).","zh":"撒粉装置或工具（较少见）。"},"examples":[{"en":"The label said the container could be used as one of the powderers for baby powder.","zh":"标签上说这个容器可以当作婴儿爽身粉的撒粉器使用。"}]}],"synonyms":["people who apply powder","dusting workers","powder applicators","powder dispensers"],"phonetic":"/ˈpaʊdərərz/","extraExplanation":["“powderers”是“powderer”的复数形式。英语里常用“-er”构成“做某事的人/物”（agent noun），例如 baker（烘焙师）、cleaner（清洁工/清洁器）。","在现代英语中，表示“撒粉装置”的用法比较少见；更常见的说法是 powder puff（粉扑）、powder dispenser（撒粉器/粉末分配器）等。"]}
{"word":"powderies","summary":{"en":"“Powderies” is a rare plural noun meaning fine powdery substances (often dust or cosmetic powders).","zh":"“powderies”是较少见的复数名词，指细粉末状物质（常为尘粉或化妆粉类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural noun: fine powdery substances; powders (often cosmetic or dust-like material).","zh":"复数名词：粉末状物质；（常指化妆用或尘土般的）粉。"},"examples":[{"en":"The wind blew the desert powderies into the cracks of the window frame.","zh":"风把沙漠里细细的粉尘吹进了窗框的缝隙里。"},{"en":"She packed a small case of powderies and brushes for the trip.","zh":"她为旅行装了一小盒粉和刷具。"}]}],"synonyms":["powders","dusts","fine particles"],"phonetic":"ˈpaʊdəriz","extraExplanation":["“powderies”在现代英语中比较少见，更多时候人们会说“powders”（粉末/粉类）或用形容词“powdery”（粉状的、覆着粉尘的）。","在文学或描写性写作里，“powderies”有时用来强调“细碎、轻飘、像粉一样散开的质感”，比普通的“powders”更有画面感。"]}
{"word":"powderiness","summary":{"en":"Powderiness means the quality of being powdery, or a dry, fine-particle texture; it can also describe a figuratively dry, lifeless tone.","zh":"Powderiness 指“粉状/粉末感”，也可指干燥的细粉质地或口感；比喻时可形容语气或文风干涩缺乏生气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being powdery (made of or covered with fine, dry particles).","zh":"粉状；粉末感（由细小干燥颗粒构成或覆盖的状态）。"},"examples":[{"en":"The cookie’s surface had a pleasant powderiness from the powdered sugar.","zh":"饼干表面因为糖粉而有一种舒服的粉感。"},{"en":"After the storm, a powderiness of dust covered the windowsill.","zh":"暴风过后，窗台上覆了一层粉粉的灰尘。"}]},{"partOfSpeech":"n.","definition":{"en":"A dry, slightly rough or chalky texture or taste, especially in food, cosmetics, or materials.","zh":"（尤指食物、化妆品或材料的）干、略粗或带粉笔感的质地/口感。"},"examples":[{"en":"The hot cocoa had a slight powderiness because the mix didn’t dissolve fully.","zh":"这杯热可可有点粉感，因为冲调粉没有完全溶开。"},{"en":"The foundation looked cakey, with an unwanted powderiness on my skin.","zh":"粉底看起来结块，皮肤上出现了不想要的粉感。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, a dry or lifeless quality in a voice, writing style, or atmosphere.","zh":"（比喻）声音、文风或氛围的干涩、缺乏生气。"},"examples":[{"en":"There was a powderiness in his speech, as if he were reading from a script.","zh":"他说话有种干涩的“粉感”，像是在照稿念。"},{"en":"The report’s tone had a powderiness that made it hard to stay engaged.","zh":"这份报告的语气有点干巴巴的，让人难以投入。"}]}],"synonyms":["powdery texture","dustiness","chalkiness","dryness","mealiness"],"phonetic":"/ˈpaʊdərɪnəs/","extraExplanation":["“Powderiness”来自形容词“powdery（粉状的）+ -ness（名词后缀）”，常用于描述可触摸的质地（糖粉、面粉、灰尘）或化妆效果（妆面偏干、浮粉、结块）。","与“graininess（颗粒感）”不同：powderiness 更像细粉、干、轻；graininess 往往是更明显的颗粒、砂砾感。"]}
{"word":"powdering","summary":{"en":"“Powdering” means applying a light layer of powder, or the process of grinding something into powder; it can also be the -ing form of “powder.”","zh":"“powdering”指撒/扑一层粉，或把东西研磨成粉的过程；也可作“powder”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting a fine powder on something (often for cosmetics, cleaning, or to prevent sticking)","zh":"给某物撒上或涂上一层细粉（常用于化妆、清洁或防粘）"},"examples":[{"en":"She finished her makeup with a light powdering on her face.","zh":"她在脸上轻轻扑了一层粉，完成了妆容。"},{"en":"A quick powdering of flour keeps the dough from sticking to the counter.","zh":"台面上轻撒一层面粉可以防止面团粘住。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making something into powder by crushing or grinding","zh":"把某物碾碎或研磨成粉末的过程"},"examples":[{"en":"The factory’s powdering of spices happens in a separate room to control dust.","zh":"工厂把香料研磨成粉的工序在单独房间进行，以控制粉尘。"},{"en":"After powdering the tablets, he mixed them with water (only if a doctor says it’s safe).","zh":"把药片研成粉后，他把它们和水混合（仅在医生确认安全时才这样做）。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “powder”: putting powder on something or turning something into powder","zh":"“powder”的现在分词：给……上粉/撒粉；或把……磨成粉"},"examples":[{"en":"He is powdering his nose before the meeting.","zh":"他在开会前补了点粉。"},{"en":"They were powdering the dried peppers to make chili powder.","zh":"他们把干辣椒研磨成辣椒粉。"}]}],"synonyms":["dusting","sprinkling","coating","grinding","pulverizing"],"phonetic":"/ˈpaʊdərɪŋ/","extraExplanation":["“powdering”在烹饪语境里很常见，常指“轻轻撒一层粉”：powdering of sugar（撒糖粉）、powdering of cocoa（撒可可粉）、powdering with flour（撒面粉防粘）。这种用法强调“薄薄一层”，不同于大量倒入。"]}
{"word":"powderization","summary":{"en":"Powderization means the process of turning something into powder.","zh":"Powderization 指把某物变成粉末的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of turning something into a fine powder (often by grinding, crushing, or milling)","zh":"将某物变成细粉的过程（常通过研磨、粉碎或碾磨）"},"examples":[{"en":"The powderization of the dried herbs makes them easier to mix into tea.","zh":"把干燥的草本粉末化后，更容易混进茶里。"},{"en":"In industry, powderization is used to prepare materials for faster chemical reactions.","zh":"在工业中，粉末化用于制备材料，以加快化学反应速度。"}]}],"synonyms":["pulverization","grinding","milling","powdering","comminution"],"phonetic":"/ˌpaʊdərɪˈzeɪʃən/","extraExplanation":["“powderization”在英语中能被理解，但在正式写作或学术语境里更常见的是“pulverization”（粉碎成粉）或更具体的说法，如“grinding/milling into powder”（研磨/碾磨成粉）。","词尾“-ization”表示“使……化/……的过程”，例如“modernization（现代化）”“globalization（全球化）”。因此“powderization”字面意思就是“粉末化/粉末化过程”。"]}
{"word":"powderize","summary":{"en":"“Powderize” means to crush something into powder, and sometimes (figuratively) to destroy completely.","zh":"“Powderize”指把某物研磨成粉末，也可比喻“彻底摧毁、粉碎”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn something into powder; to crush or grind into very fine particles","zh":"把某物变成粉末；研磨成细粉"},"examples":[{"en":"The machine powderized the dried leaves into a fine green dust.","zh":"机器把干叶子研磨成了细细的绿色粉末。"},{"en":"Wear a mask if you need to powderize spices, because the dust can irritate your nose.","zh":"如果要把香料研磨成粉，最好戴口罩，因为粉尘可能刺激鼻子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to destroy completely; to smash into pieces","zh":"（比喻）彻底摧毁；粉碎"},"examples":[{"en":"The new evidence powderized his argument in seconds.","zh":"新的证据几秒钟就把他的论点彻底击碎了。"},{"en":"A single scandal can powderize a public image.","zh":"一次丑闻就可能彻底摧毁公众形象。"}]}],"synonyms":["pulverize","grind","crush","mill","reduce to powder","smash (figurative)"],"phonetic":"/ˈpaʊdərˌaɪz/","extraExplanation":["“powderize”比较少见，更常用的是“pulverize”（粉碎/研磨成粉）。在科学、工业语境里也常见“grind into a powder”“mill into powder”。","拼写相关：英式有时也写作“powderise”，但在现代英语里这两个形式都不算常见。"]}
{"word":"powderizer","summary":{"en":"A powderizer is a device (or, rarely, a person/thing) that turns material into powder.","zh":"powderizer 指把材料粉碎或研磨成粉末的装置（较少也可指“把东西弄成粉末的人/物”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or device that crushes or grinds something into a fine powder","zh":"把物质压碎或研磨成粉末的机器或装置（粉碎机、研磨机）"},"examples":[{"en":"The lab uses a powderizer to grind dried leaves into a fine powder.","zh":"实验室用粉碎机把干树叶研磨成细粉。"},{"en":"After drying the clay, they ran it through a powderizer for easier mixing.","zh":"黏土干燥后，他们用粉碎机把它打成粉，方便混合。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that makes something into powder (rare; often used humorously or informally)","zh":"把东西弄成粉末的人或事物（较少见；常带调侃或口语色彩）"},"examples":[{"en":"He joked that his blender was a ‘powderizer’ because it turns spices into dust.","zh":"他开玩笑说他的搅拌机是“粉末制造机”，因为能把香料打成粉尘。"}]}],"synonyms":["pulverizer","grinder","mill","crusher"],"phonetic":"/ˈpaʊdərˌaɪzər/","extraExplanation":["“powderizer”不是非常常见的标准词，更常见的对应词是“pulverizer”（粉碎机）或更具体的“grinder / mill”。","词尾“-izer”表示“使……成为……的人/物/装置”（如 “sterilizer” 消毒器）。因此“powderizer”字面意思就是“把东西变成粉末的东西”。"]}
{"word":"powderlike","summary":{"en":"“Powderlike” means having the look or feel of fine powder.","zh":"“powderlike”表示“像细粉一样的、粉末状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling powder; having the texture or appearance of fine powder.","zh":"粉末状的；像粉一样的；质地或外观看起来像细粉的。"},"examples":[{"en":"The medicine has a powderlike texture and dissolves quickly in water.","zh":"这种药呈粉末状，放进水里很快就溶解。"},{"en":"After the eruption, a powderlike ash covered the streets.","zh":"火山喷发后，粉末状的火山灰覆盖了街道。"}]}],"synonyms":["powdery","dust-like","pulverulent"],"phonetic":"/ˈpaʊdərˌlaɪk/","extraExplanation":["“powderlike”是由 powder（粉末）+ -like（像……一样的）构成的形容词，意思直观，常用于科学、医学、化妆品、地质等语境。","近义表达常用：powdery（更常见，偏“带粉感/粉状的”）、dusty（偏“多灰尘的”）。在写作中如果想更自然，很多情况下可用更常见的“powdery”。"]}
{"word":"powderman","summary":{"en":"A powderman is mainly a blasting worker who handles explosives for mining or construction; rarely, it can mean someone who applies powder (cosmetics).","zh":"powderman 主要指在矿山或工程中负责装药与爆破的爆破工；较少见时也可指给人上粉（化妆粉）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who prepares and uses explosive powder (or other explosives) for blasting, especially in mining, quarrying, or tunnel construction.","zh":"（尤指采矿、采石或隧道工程中的）爆破工；负责装药、起爆等使用炸药/火药进行爆破的工人。"},"examples":[{"en":"The powderman loaded the holes with explosives before the crew cleared the area.","zh":"爆破工在工人撤离到安全区域前，把炸药装进钻孔里。"},{"en":"In early mining towns, the powderman’s job was dangerous and highly respected.","zh":"在早期矿业城镇里，爆破工的工作危险，但很受尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, a person who applies powder, especially cosmetic face powder (historical/rare).","zh":"（较少见/较旧用法）给人上粉的人，尤指化妆用的扑粉。"},"examples":[{"en":"In some older texts, a “powderman” could be someone who powdered actors’ faces for the stage.","zh":"在一些较旧的文本中，“powderman”也可指给演员上扑粉的后台人员。"}]}],"synonyms":["blaster","shotfirer","powder worker"],"phonetic":"/ˈpaʊdərmæn/","extraExplanation":["“powderman”里的 powder 原本常指黑火药（black powder），后来也泛指用于爆破的炸药。现代英语里更常见的相关职位说法有 blaster（爆破工）或 shotfirer（起爆员，英式更常见）。","该词带有明显的工业/工程语境，涉及高风险作业与严格安全规程（清场、警戒、引爆信号等）。在正式场合或职业名称中，使用 blaster 往往更通用。"]}
{"word":"powderpuff","summary":{"en":"Powderpuff most commonly means a cosmetic puff for applying powder; it can also refer to a fun women’s exhibition game (especially in American football). A third meaning is a dated, offensive slur for an effeminate man.","zh":"powderpuff 最常见指化妆用的粉扑；也可指女子娱乐性表演赛（尤指“粉扑橄榄球”）。另有一个过时且具冒犯性的贬称用法，指“娘娘腔”的男性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft pad or puff used to apply face powder or other cosmetics.","zh":"（化妆用的）粉扑；扑粉用的软垫"},"examples":[{"en":"She dabbed a little powder on her nose with a powderpuff.","zh":"她用粉扑在鼻子上轻轻扑了点粉。"},{"en":"This compact comes with a mirror and a powderpuff.","zh":"这个粉饼盒带镜子和一个粉扑。"}]},{"partOfSpeech":"adj.","definition":{"en":"A casual sports term for a girls’ or women’s exhibition game (especially in American football), often played as a fun event.","zh":"（口语，尤指美式英语）女子表演赛（常指“粉扑橄榄球”之类的娱乐性比赛）"},"examples":[{"en":"Our school held a powderpuff football game during spirit week.","zh":"我们学校在校园活动周举办了一场女子“粉扑橄榄球”表演赛。"},{"en":"They raised money for charity with a powderpuff game.","zh":"他们用一场女子表演赛为慈善筹款。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dated, offensive) A slur for an effeminate man.","zh":"（过时且具冒犯性）对“娘娘腔”男性的贬称"},"examples":[{"en":"That word is insulting—avoid using it and choose respectful language instead.","zh":"这个词带侮辱性——应避免使用，改用更尊重的表达。"}]}],"synonyms":["powder puff","puff","cosmetic puff","compact puff"],"phonetic":"/ˈpaʊdərˌpʌf/","extraExplanation":["“powderpuff”最早与化妆粉扑有关，因此在一些语境里被延伸为对“女性化”的刻板印象表达。作为贬称（指男性“娘”）时具有明显歧视性与攻击性，现代英语交流中应避免使用；描述气质或性别表达时可改用更中性的说法，如“gentle/soft-spoken（温和的/说话轻声的）”或直接使用对方自我认同的表达。"]}
{"word":"powders","summary":{"en":"“Powders” usually means multiple kinds/amounts of fine dry substances; it can also be the verb form meaning “covers with powder” or “grinds into powder.”","zh":"“Powders”通常指多种/多份粉末；也可作动词形式，表示“撒/涂粉”或“磨成粉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “powder”: a dry substance made of very small particles (fine dust).","zh":"“powder”的复数：由非常细小颗粒组成的干燥物质（粉末、粉状物）。"},"examples":[{"en":"Different cleaning powders work better on different stains.","zh":"不同的清洁粉对不同的污渍效果更好。"},{"en":"Keep food powders in a dry, sealed container.","zh":"把食品粉末放在干燥密封的容器里。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of the verb “powder”: to cover something with powder, or to reduce something to powder.","zh":"动词“powder”的第三人称单数：给某物撒/涂粉；或把某物研磨成粉末。"},"examples":[{"en":"She powders her face lightly before going out.","zh":"她出门前会轻轻地给脸上扑点粉。"},{"en":"The machine powders dried herbs into a fine dust.","zh":"这台机器把干燥的香草研磨成细粉。"}]}],"synonyms":["dusts","fine particles","grinds","pulverizes"],"phonetic":"/ˈpaʊdərz/","extraExplanation":["“Powder”在日常英语里常见几种语境：①食品/饮品粉（protein powder 蛋白粉；cocoa powder 可可粉）；②清洁用品（washing powder 洗衣粉，英式更常见；美式也常说 laundry detergent）；③化妆品（face powder/foundation powder 定妆粉/粉底）；④火药（gunpowder），属于更具体的词汇场景。"]}
{"word":"powdery","summary":{"en":"Powdery means having the look or feel of fine, dry powder—dusty, flour-like, or easily crumbled into powder.","zh":"Powdery 指“像粉一样的”：看起来或摸起来有细小干燥颗粒（带粉尘/面粉感），或质地易碎成粉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with or made of fine, dry particles like powder; dusty or flour-like.","zh":"覆盖着或由细小干燥颗粒构成的；粉状的、带粉尘的。"},"examples":[{"en":"The table was powdery with dust after the renovation.","zh":"装修后桌子上落了一层粉尘，摸起来粉粉的。"},{"en":"Add a little flour until the surface feels powdery, not sticky.","zh":"加一点面粉，直到表面摸起来粉粉的、不粘手。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a substance or texture) Easily crumbled into powder; dry and soft like powder.","zh":"（指物质或质地）容易碎成粉末的；干燥柔软、像粉一样的。"},"examples":[{"en":"The old chalk became powdery and broke in my hand.","zh":"那支旧粉笔变得很粉，很容易在我手里断掉。"},{"en":"The cookie was too dry and powdery.","zh":"这块饼干太干了，吃起来粉粉的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of food or drink, especially wine) Having a light, dry, slightly dusty mouthfeel.","zh":"（指食物或饮品，尤指葡萄酒）口感轻薄、偏干，带一点“粉尘感/涩感”。"},"examples":[{"en":"The red wine has powdery tannins and a smooth finish.","zh":"这款红酒的单宁带一点粉感，但收尾很顺滑。"}]}],"synonyms":["dusty","powdered","floury","crumbly","dry"],"phonetic":"/ˈpaʊdəri/","extraExplanation":["“powdery”常用来描述触感或外观（粉尘、面粉、爽身粉），语气通常是中性；但用来形容饼干、蛋糕等食物时，往往暗示“太干、缺少水分或油脂”。","在葡萄酒描述里，“powdery tannins（粉感单宁）”是一种相对积极或中性的说法，表示单宁细腻、颗粒感很细，不是粗糙的“沙感（gritty）”。","常见搭配：powdery snow（粉雪/干雪）、powdery mildew（白粉病，一种植物病害）、powdery makeup（粉感很重的妆）。"]}
{"word":"powdike","summary":{"en":"“Powdike” is a rare Scots/Northern English dialect noun meaning a small ditch or drainage channel, sometimes also a low embankment or boundary bank.","zh":"“Powdike”是罕见的苏格兰/英格兰北部方言名词，常指小沟渠、排水沟；有时也指矮土堤或边界堤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots / Northern English, dialect) A small ditch or drainage channel; sometimes a low earthen bank built beside it.","zh":"（苏格兰/英格兰北部方言）小沟渠、排水沟；有时也指沟旁的低土堤。"},"examples":[{"en":"After the heavy rain, the field’s water ran into the powdike.","zh":"大雨过后，田里的积水流进了那条排水沟。"},{"en":"They cleared the powdike so the road wouldn’t flood again.","zh":"他们把排水沟清理了一下，这样路面就不会再积水。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A low wall or embankment used as a boundary, especially in rural land.","zh":"（较少见）乡村土地上用作边界的矮墙或土堤。"},"examples":[{"en":"A broken powdike marked the edge of the old pasture.","zh":"一段破损的矮堤标出了旧牧场的边界。"}]}],"synonyms":["ditch","drain","channel","trench","embankment","bank"],"phonetic":"ˈpaʊdaɪk","extraExplanation":["“powdike”是非常少见的方言词，常见于苏格兰或英格兰北部的乡村语境。不同地区记录的拼写可能不一致（如把它分写成 powder dike，或出现类似拼写变体），意思也会在“沟渠/排水沟”和“土堤/边界”之间轻微摆动。","如果你是在某本书、家谱（姓氏/地名）、或地图上看到“Powdike”，它也可能是专有名词（人名或地名）。你可以把原句/出处贴出来，我可以按语境帮你确定更准确的含义。"]}
{"word":"powdry","summary":{"en":"“Powdry” is not standard; it usually means “powdery”: like or covered with fine powder; dry and dusty.","zh":"“powdry”不是标准拼写，通常指“powdery”：像粉末一样的；带粉的；干燥起尘。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “powdery”) Covered with or like fine powder; dry, dusty, and easily crumbled.","zh":"（可能想写的是：powdery）像粉末一样的；带粉的；干燥起尘、易碎的。"},"examples":[{"en":"The table was powdery with dust after weeks of no cleaning.","zh":"好几周没打扫后，桌子上落了一层粉尘。"},{"en":"The cookies turned powdery because they were overbaked.","zh":"饼干烤过头了，所以变得又干又粉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the texture of powder (soft and fine), often used for makeup or snow.","zh":"质地像粉末一样细腻的（常用于形容化妆品或雪）。"},"examples":[{"en":"She used a powdery foundation to reduce shine.","zh":"她用了粉质的粉底来减少油光。"},{"en":"Fresh snow can feel light and powdery under your boots.","zh":"新雪踩在靴子下面会感觉很轻、很粉。"}]}],"synonyms":["dusty","powder-like","crumbly","floury"],"phonetic":"/ˈpaʊdəri/","extraExplanation":["“powdry”不是常见英文拼写，最可能是把“powdery”拼错了。","拼写提示：powder + -y → powdery（以 -y 结尾，表示“有……特征/像……的”）。"]}
{"word":"powellite","summary":{"en":"Powellite is a mineral (calcium molybdate) and an ore of molybdenum.","zh":"Powellite（钼钙矿）是一种钼酸钙矿物，也是钼的重要矿石之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow to brown mineral (calcium molybdate) often found in molybdenum ore deposits; it is an important ore of molybdenum.","zh":"一种矿物（钼酸钙），常呈黄色到棕色，常见于含钼矿床中；是钼的重要矿石之一。"},"examples":[{"en":"The geologist identified powellite in the vein by its yellowish crystals.","zh":"地质学家通过其偏黄色的晶体在矿脉中辨认出了钼钙矿。"},{"en":"Powellite can occur alongside scheelite in some deposits.","zh":"在一些矿床中，钼钙矿可能与白钨矿共生。"}]}],"synonyms":["calcium molybdate"],"phonetic":"/ˈpaʊəlaɪt/","extraExplanation":["“Powellite”这一名称来自美国地质学家 John Wesley Powell（约翰·卫斯理·鲍威尔）的姓氏，加后缀 -ite（常用于矿物名称，意为“……矿/石”）。","钼钙矿在紫外线下常会出现荧光（不同产地表现不一），因此在矿物鉴定与收藏领域也较常被提到。"]}
{"word":"power","summary":{"en":"Power commonly means (1) the ability or authority to control or act, and (2) electricity/energy that runs devices; it can also mean a strong effect, and it can be a verb meaning “to supply energy.”","zh":"power 常见意思是（1）能力或权力，（2）供设备运行的电力/能量；也可指强大影响力；作动词表示“给……提供动力/电力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability or capacity to do something; strength, control, or influence over people or events","zh":"力量；能力；（对人或事的）控制力/影响力/权力"},"examples":[{"en":"She has the power to change the decision.","zh":"她有权力改变这个决定。"},{"en":"Money can give people power and influence.","zh":"金钱可能带来权力和影响力。"}]},{"partOfSpeech":"n.","definition":{"en":"energy or electricity used to run machines, lights, or devices","zh":"（电）能；电力；动力能源"},"examples":[{"en":"The power went out during the storm.","zh":"暴风雨期间停电了。"},{"en":"Please turn off the power before repairing the machine.","zh":"修机器前请先断电。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong effect or force; the quality of being effective or impressive","zh":"强大的作用/影响；感染力；震撼力"},"examples":[{"en":"The power of her speech moved the whole room.","zh":"她演讲的力量打动了全场。"}]},{"partOfSpeech":"vt.","definition":{"en":"to supply something with energy or electricity; to make something operate","zh":"给……提供动力/电力；驱动；使运转"},"examples":[{"en":"The engine powers the boat.","zh":"发动机为这艘船提供动力。"},{"en":"This battery can power a laptop for hours.","zh":"这块电池能给笔记本供电好几个小时。"}]}],"synonyms":["authority","control","influence","strength","energy","electricity"],"phonetic":"/ˈpaʊər/","extraExplanation":["“power”在社会与政治语境里常指“权力/统治力”（power over someone），在科技语境里常指“电力/供能”（power supply）。学习时可以用搭配来区分：have power（有权力/能力）、in power（当权）、power outage（停电）、power button（电源键）。","词源来自拉丁语 potere（能够），所以它既可以表示“能力”，也可以表示“强制性的权力”。"]}
{"word":"power broker","summary":{"en":"A person who wields significant behind-the-scenes influence over important decisions.","zh":"对重要决策拥有强大幕后影响力的人。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A person who has strong influence over decisions (especially in politics, business, or organizations), often without holding the top official title.","zh":"（尤指政治、商界或机构中）在幕后对决策有很大影响力的人，未必拥有最高正式头衔。"},"examples":[{"en":"Even though she isn’t an elected official, she’s a power broker in city politics.","zh":"虽然她不是民选官员，但她在市政政治中是个很有影响力的幕后人物。"},{"en":"The CEO listens to a few key power brokers before making any major changes.","zh":"首席执行官在做重大调整前会先听取几位关键幕后权势人物的意见。"}]}],"synonyms":["kingmaker","influential insider","political boss","power player","fixer"],"phonetic":"/ˈpaʊɚ ˌbroʊkɚ/","extraExplanation":["“power broker”常带有“幕后运作/斡旋资源”的意味：这种人可能通过人脉、资金、媒体、游说或组织动员来影响结果，而不是靠正式职位直接下命令。","该词在美国政治语境里很常见，既可中性（“有影响力的协调者/撮合者”），也可略带负面（“权力掮客/利益操盘手”），具体取决于上下文。","文化提示：The Power Broker 也是美国作家 Robert A. Caro 的著名传记书名（讲纽约公共工程与权力运作的代表人物 Robert Moses），使这个表达更深入人心。"]}
{"word":"power failure","summary":{"en":"Power failure means the electricity stops, or a system loses electrical power and stops working.","zh":"power failure 指停电，或系统/设备失去电力供应而停止运作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation when the supply of electricity stops, often suddenly, so lights and electrical devices don’t work.","zh":"停电；电力中断（通常是突然发生），导致灯和电器无法运作。"},"examples":[{"en":"The power failure lasted three hours, so we used candles at night.","zh":"停电持续了三个小时，所以我们晚上用蜡烛。"},{"en":"After the storm, several neighborhoods reported a power failure.","zh":"暴风雨过后，有几个社区报告停电。"},{"en":"The hospital has backup generators in case of a power failure.","zh":"医院有备用发电机，以防停电。"}]},{"partOfSpeech":"n.","definition":{"en":"A breakdown or loss of electrical power in a device, system, or machine, causing it to stop working.","zh":"（设备/系统/机器的）电源故障；供电失效，导致停止运作。"},"examples":[{"en":"The computer shut down because of a sudden power failure.","zh":"电脑因为突然的电源故障而关机了。"},{"en":"Data can be lost during a power failure, so save your work often.","zh":"断电时可能会丢失数据，所以要经常保存。"}]}],"synonyms":["power outage","outage","blackout (informal)","loss of power"],"phonetic":"/ˈpaʊɚ ˌfeɪljɚ/","extraExplanation":["“power failure”是美式英语中很常用、很中性的说法。日常生活里也常说“power outage”（更强调大范围停电），“blackout”（更口语/戏剧化，也可指城市大停电）。","在安全提示或应急场景中常见搭配：in case of a power failure（以防停电）、during a power failure（停电期间）、restore power after a failure（故障后恢复供电）。"]}
{"word":"power line","summary":{"en":"A power line is a cable (usually overhead) that carries electricity to places like homes and businesses; it can also mean the overhead electric wire for trains or trams.","zh":"power line 指输送电力的电线/输电线（多为架空），也可指电车或火车的架空供电线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cable (or set of cables) that carries electricity, usually on poles or towers, from a power station to homes, businesses, or other places.","zh":"输电线；电力线（通常架在电线杆或铁塔上，把电力从发电站输送到住宅、商业或其他地点）。"},"examples":[{"en":"A tree fell on the power line during the storm, and the neighborhood lost electricity.","zh":"暴风雨中一棵树倒在电力线上，附近社区停电了。"},{"en":"Workers repaired the power line and restored power by midnight.","zh":"工人修好输电线，午夜前恢复了供电。"}]},{"partOfSpeech":"n.","definition":{"en":"An overhead wire that supplies electricity to trains or trams (also called an overhead line).","zh":"（火车/电车的）架空供电线（也常称 overhead line）。"},"examples":[{"en":"The tram stopped because there was a problem with the power line above the tracks.","zh":"有轨电车停了，因为轨道上方的供电线出了问题。"}]}],"synonyms":["electric line","power cable","utility line","transmission line"],"phonetic":"/ˈpaʊɚ laɪn/","extraExplanation":["“power line”在日常英语里通常指户外的输电/配电线路；如果强调“长距离高压输电”，也会说“transmission line”；指城市道路旁给住户供电的常见说法是“power line”或“power lines”。","相关常见搭配：downed power line（倒塌/断落的电线，通常很危险）、live power line（带电的电线）、power line worker/lineman（线路工）。","文化与安全提示：在英语国家，公共安全提示里常强调“Stay away from downed power lines”（远离落地电线），因为即使看起来不动也可能仍然带电。"]}
{"word":"power loss","summary":{"en":"Power loss usually means an electricity outage; it can also mean a drop in influence/strength, or (in engineering) wasted/dissipated power.","zh":"power loss 通常指停电；也可指影响力/实力下降，或（工程中）功率损耗。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A situation in which electricity stops being supplied or available (an outage).","zh":"（电力）停电；断电（电力供应中断的情况）。"},"examples":[{"en":"The storm caused a power loss across the city.","zh":"暴风雨导致全城停电。"},{"en":"During the power loss, the elevators stopped working.","zh":"停电期间，电梯停止运行。"}]},{"partOfSpeech":"phrase","definition":{"en":"A reduction in power, strength, control, or influence (often in politics, business, or sports).","zh":"（权力、实力、控制力或影响力的）削弱；下降。"},"examples":[{"en":"The company’s power loss in the market opened opportunities for new competitors.","zh":"这家公司在市场上的影响力下降，给新竞争者带来了机会。"},{"en":"After the scandal, the minister faced a significant power loss.","zh":"丑闻之后，这位部长面临明显的权力削弱。"}]},{"partOfSpeech":"phrase","definition":{"en":"In engineering/physics, power that is wasted or dissipated (for example as heat) instead of being delivered for useful work.","zh":"（工程/物理）功率损耗：能量没有用于有效做功而以热等形式消耗掉的功率。"},"examples":[{"en":"Long cables increase power loss, so the device receives less energy.","zh":"电缆越长功率损耗越大，因此设备得到的能量更少。"},{"en":"Better insulation can reduce power loss in the system.","zh":"更好的绝缘可以减少系统的功率损耗。"}]}],"synonyms":["power outage","blackout","loss of electricity","outage","power cut","power failure","decline in influence","loss of control","power dissipation","energy loss"],"phonetic":"/ˈpaʊər lɔs/","extraExplanation":["“power loss”在日常生活里最常见就是“停电/断电”，在新闻里也常用“widespread power loss（大范围停电）”。","在工程语境中，它更接近“损耗/耗散”，常与“friction（摩擦）”“resistance（电阻）”“heat（热）”等原因搭配。为了避免歧义，工程写作里也常说“power dissipation（功率耗散）”或“transmission loss（传输损耗）”。","注意与“loss of power”区分：两者很多情况下可互换，但“loss of power”更常见于口语，强调“失去电力/失去权力”这一结果；“power loss”更像一个名词短语，常用于标题、报告或技术语境。"]}
{"word":"power plant","summary":{"en":"A power plant is a facility that generates electricity; in technical contexts it can also mean a machine’s power-producing system.","zh":"power plant 指发电厂/电站；在技术语境中也可指机器的动力系统/动力装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A factory or facility where electricity is generated (for example, using coal, gas, nuclear energy, wind, water, or sunlight).","zh":"发电厂；电站（利用煤、天然气、核能、风能、水能或太阳能等发电的设施）。"},"examples":[{"en":"The city gets most of its electricity from a nearby power plant.","zh":"这座城市的大部分电力来自附近的一座发电厂。"},{"en":"A nuclear power plant produces electricity by using heat from nuclear reactions.","zh":"核电站通过核反应产生的热量来发电。"},{"en":"They protested the plan to build a coal-fired power plant.","zh":"他们抗议修建燃煤发电厂的计划。"}]},{"partOfSpeech":"n.","definition":{"en":"In a specific type of station name, a place that produces power for a system (especially in technical or engineering contexts).","zh":"（特定站点名称中）为某个系统提供动力/电力的装置或站房（多用于工程语境）。"},"examples":[{"en":"The ship’s power plant includes engines, generators, and control systems.","zh":"这艘船的动力装置包括发动机、发电机和控制系统。"},{"en":"Technicians inspected the aircraft’s power plant after the flight.","zh":"飞行后，技术人员检查了飞机的动力系统。"}]}],"synonyms":["power station","generating station","electricity plant","powerhouse"],"phonetic":"/ˈpaʊər plænt/","extraExplanation":["“power plant”在日常英语里最常指“发电厂/电站”。在工程或军工语境中，它也可能指“动力装置/动力系统”（如船舶、飞机的发动机与相关系统）。","常见搭配：power plant operator（电站操作员）、power plant emissions（电厂排放）、coal-fired/gas-fired power plant（燃煤/燃气电厂）、nuclear power plant（核电站）。","词源提示：plant 在这里不是“植物”，而是“工厂/大型设施”的意思，如 chemical plant（化工厂）、water treatment plant（水处理厂）。"]}
{"word":"power point","summary":{"en":"“PowerPoint” commonly means Microsoft’s slide-presentation software; in Australian/New Zealand English, “power point” can mean an electrical outlet.","zh":"“PowerPoint”常指微软的幻灯片演示软件；在澳大利亚/新西兰英语中，“power point”也可指电源插座。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Microsoft PowerPoint) a computer program used to create slide presentations.","zh":"（微软 PowerPoint）用于制作幻灯片演示文稿的软件。"},"examples":[{"en":"She made a PowerPoint for the class presentation.","zh":"她为课堂展示做了一份 PowerPoint 幻灯片。"},{"en":"Please email me the PowerPoint slides after the meeting.","zh":"会后请把 PowerPoint 幻灯片发邮件给我。"}]},{"partOfSpeech":"n.","definition":{"en":"(mainly Australia/New Zealand) an electrical outlet; a place where you can plug in a device.","zh":"（主要用于澳大利亚/新西兰）电源插座；可以给设备插电的地方。"},"examples":[{"en":"Is there a power point near the desk for my laptop charger?","zh":"桌子旁边有电源插座可以给我的笔记本充电器用吗？"},{"en":"The room has only one power point, so bring a power strip.","zh":"这个房间只有一个插座，所以带个排插吧。"}]}],"synonyms":["slide deck","presentation","PPT","electrical outlet","wall outlet","socket"],"phonetic":"/ˈpaʊɚˌpɔɪnt/","extraExplanation":["在北美英语里，通常说“electrical outlet / wall outlet / socket（更偏英式）”，不太说“power point”。“power point”表示插座多见于澳大利亚和新西兰英语。","指微软软件时一般大写并写作“PowerPoint”（品牌名）。口语中也常把文件本身叫“a PowerPoint”，或说“PowerPoint slides / a PPT（更口语/常见缩写）”。"]}
{"word":"power station","summary":{"en":"A power station is a facility where electricity is produced.","zh":"power station 指“发电站/发电厂”，用来生产电力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where electricity is generated, usually by converting energy from fuel, wind, water, nuclear reactions, or sunlight into electrical power.","zh":"发电站；发电厂：把燃料、风、水、核能或太阳能等能量转换成电能的地方。"},"examples":[{"en":"The city gets most of its electricity from a nearby power station.","zh":"这座城市的大部分电力来自附近的一座发电站。"},{"en":"They built a new power station to replace the old coal plant.","zh":"他们建了一座新的发电站来替换旧的燃煤电厂。"}]}],"synonyms":["power plant","generating station","electricity plant"],"phonetic":"/ˈpaʊər ˌsteɪʃən/","extraExplanation":["英式英语更常说 power station，美式英语里也会用，但更常见的对应说法是 power plant。","按能源来源可以说：a coal-fired power station（燃煤电站）, a gas-fired power station（燃气电站）, a nuclear power station（核电站）, a hydroelectric power station（水电站）, a wind power station/plant（风电场/风电站）。日常口语里 wind farm（风电场）也很常用。"]}
{"word":"powerable","summary":{"en":"“Powerable” means “able to be powered so it can work.”","zh":"“powerable”表示“可供电、可被驱动从而运行”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be powered (supplied with electricity, batteries, or another energy source) so it can operate.","zh":"可供电的；可由电力/电池/其他能源驱动而运行的。"},"examples":[{"en":"The sensor is powerable by a small coin battery.","zh":"这个传感器可以用一枚纽扣电池供电。"},{"en":"Choose a powerable device if you need it to run without a wall outlet.","zh":"如果你需要它在没有插座的情况下运行，就选可供电的设备。"}]}],"synonyms":["able to be powered","powered","battery-powered","energizable"],"phonetic":"/ˈpaʊərəbəl/","extraExplanation":["“powerable”不是特别常见，更常见的说法有：*powered*（已供电的）、*battery-powered*（电池供电的）、*can be powered by*（可以由……供电）、*powerable via USB*（可通过USB供电）。","在产品说明或工程语境中偶尔会用“powerable”来强调“具备供电/驱动的可能性”，有时也会写成带连字符的形式（如 *USB-powerable*）。"]}
{"word":"powerably","summary":{"en":"“Powerably” is not standard English; it is usually a misspelling of “probably” or “powerfully.”","zh":"“powerably”不是标准英语，通常是把“probably”或“powerfully”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard / misspelling. “Powerably” is not a common or accepted English word in standard writing. People usually mean either “probably” (most common) or “powerfully.”","zh":"非标准/拼写错误。“powerably”不是标准英语中常见或被接受的单词。人们通常想写的是“probably（可能）”或“powerfully（强有力地）”。"},"examples":[{"en":"I will powerably go tomorrow. (Nonstandard—better: “I will probably go tomorrow.”)","zh":"I will powerably go tomorrow.（不标准——更好：I will probably go tomorrow. 我明天可能会去。）"},{"en":"The engine ran powerably. (Nonstandard—better: “The engine ran powerfully.”)","zh":"The engine ran powerably.（不标准——更好：The engine ran powerfully. 引擎强劲地运转。）"}]}],"synonyms":["probably","powerfully"],"phonetic":"ˈpaʊərəbli","extraExplanation":["“powerably”看起来像把“probably（可能）”和“powerfully（强有力地）/ power（力量）”混在了一起造成的拼写。写正式英语时建议避免使用。","如果你告诉我你的原句，我可以帮你判断应该用：\n- probably：表示“不确定但很可能”\n- powerfully：表示“强烈地/有力量地”"]}
{"word":"powerboat","summary":{"en":"A powerboat is a small motor-driven boat used for travel or recreation on the water.","zh":"powerboat 指靠发动机推进的机动小船，常用于水上出行或休闲娱乐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small boat driven by an engine (motor), not by sails or rowing","zh":"快艇；机动船（靠发动机推进，而不是靠帆或划桨）"},"examples":[{"en":"We rented a powerboat for an hour and toured the lake.","zh":"我们租了一艘快艇一个小时，在湖上游览。"},{"en":"Powerboats must slow down near swimmers and docks.","zh":"快艇在靠近游泳者和码头时必须减速。"}]}],"synonyms":["motorboat","speedboat"],"phonetic":"/ˈpaʊərˌboʊt/","extraExplanation":["在美国日常用法中，powerboat 常指用于娱乐（如湖上巡航、拖曳滑水者）的机动小船；更正式或更宽泛的说法是 motorboat。","构词：power（动力）+ boat（船）。有时也可写作 power boat。"]}
{"word":"powerboats","summary":{"en":"Powerboats are engine-powered boats used for travel, work, or recreation.","zh":"Powerboats 指由发动机驱动的船，用于出行、工作或休闲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small- to medium-sized boat powered by an engine (not by sails or oars), used for travel, work, or recreation","zh":"机动艇；动力船（靠发动机推进，而不是靠帆或桨），用于出行、工作或娱乐"},"examples":[{"en":"Powerboats are not allowed on this quiet lake.","zh":"这座安静的湖里不允许使用机动艇。"},{"en":"We rented a powerboat for a day and explored the coastline.","zh":"我们租了一天的动力船，沿着海岸线探索。"},{"en":"Please slow down—your powerboat is making big waves near the swimmers.","zh":"请慢点——你的机动艇在游泳的人附近掀起了很大的浪。"}]}],"synonyms":["motorboats","speedboats"],"phonetic":"/ˈpaʊərˌboʊts/","extraExplanation":["“powerboat”通常指较小的机动船，常见于休闲娱乐（如滑水、钓鱼）或短途出行；更大的机动船可以叫“motorboat”（更泛）或“speedboat”（更强调速度）。","在水上安全语境中，常会看到“no wake zone”（禁止制造大浪区域），要求机动艇减速，避免浪涌影响他人和岸边。"]}
{"word":"powered","summary":{"en":"“Powered” usually means “having power to operate” or “driven by a specific energy source,” and it is also the past form of “power.”","zh":"“powered”常指“有动力/有电力可运转”或“由某种能源驱动”，也可作动词power的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having power (electricity, an engine, etc.) to operate; motorized","zh":"有动力/有电力驱动的；机动的"},"examples":[{"en":"The hospital has a backup generator to keep the building powered during outages.","zh":"医院有备用发电机，在停电时保证大楼持续供电。"},{"en":"Powered doors make the entrance easier for wheelchair users.","zh":"电动门让轮椅使用者更容易进出。"}]},{"partOfSpeech":"adj.","definition":{"en":"driven or operated by a particular source of energy","zh":"由某种能源驱动的"},"examples":[{"en":"They bought a solar-powered lamp for camping.","zh":"他们买了一盏太阳能灯用于露营。"},{"en":"Many tools are battery-powered now.","zh":"现在很多工具都是电池驱动的。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “power”: to supply with energy or make something work","zh":"“power”的过去式/过去分词：给……提供动力/供电，使运转"},"examples":[{"en":"The engine powered the boat across the river.","zh":"发动机驱动小船渡过了河。"}]}],"synonyms":["motorized","electric","energized","driven"],"phonetic":"/ˈpaʊərd/","extraExplanation":["“powered”常见于复合形容词：battery-powered（电池驱动的）、solar-powered（太阳能驱动的）、gas-powered（燃气/汽油驱动的）。这种结构通常写作“能源/动力来源 + powered”。","注意区分“powered”（有动力/供电的）与“powerful”（强大的、有力量的）。例如：a powered wheelchair（电动轮椅） vs. a powerful engine（强劲的发动机）。"]}
{"word":"powerful","summary":{"en":"Powerful means very strong or having great effect or influence; it can describe physical strength, authority, or emotionally impressive language/art.","zh":"Powerful 表示“很强大、影响力很大或效果很强”；既可形容力量/性能，也可形容权势，以及语言艺术的感染力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having great strength, force, or influence; able to produce strong effects","zh":"强大的；有很大力量/影响力的；能产生强烈效果的"},"examples":[{"en":"She is a powerful leader who can bring people together.","zh":"她是一位强有力的领导者，能够把大家团结起来。"},{"en":"The medicine is powerful, so follow the instructions carefully.","zh":"这种药效很强，所以要严格按说明服用。"},{"en":"That speech was powerful—it changed how I thought about the issue.","zh":"那场演讲很有震撼力——它改变了我对这个问题的看法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person or group) having a lot of authority, control, or wealth","zh":"（人或团体）有权势的；有很大控制力/财力的"},"examples":[{"en":"He comes from a powerful family in the business world.","zh":"他来自商界一个很有势力的家族。"},{"en":"Powerful countries can strongly affect global decisions.","zh":"强国会对全球决策产生很大影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of language, art, or feelings) very moving, impressive, or persuasive","zh":"（语言/艺术/情感）感人至深的；令人印象深刻的；有说服力的"},"examples":[{"en":"The film tells a powerful story about hope and loss.","zh":"这部电影讲述了一个关于希望与失去的动人故事。"},{"en":"Her writing is simple but powerful.","zh":"她的文字朴素却有力量。"}]}],"synonyms":["strong","mighty","influential","forceful","effective","potent"],"phonetic":"/ˈpaʊɚfəl/","extraExplanation":["“powerful”常见搭配：powerful engine（强劲的发动机）、powerful tool（强大的工具）、powerful argument（有力的论点）、powerful voice（有穿透力/感染力的嗓音）、powerful influence（强大影响）。","语气上，“powerful”既可偏中性（强大/强劲），也可能带一点“有权势”的含义；描述人时，有时暗示“能左右局势”。根据语境可用更具体的词：strong（强壮/强烈）、influential（有影响力的）、effective（有效的）、forceful（有气势/有力度的）。","文学与修辞中，“powerful”常用来评价演讲、文字或叙事的感染力与说服力，如“a powerful metaphor / image”（强烈的隐喻/意象）。"]}
{"word":"powerfully","summary":{"en":"“Powerfully” means doing something with strong force or strong emotional/convincing impact.","zh":"“powerfully”表示“强有力地”，既可指力量/力度强，也可指表达或作品带来强烈感染力与说服力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strong or forceful way; with great power or intensity.","zh":"强有力地；有力地；以强烈的力度或影响力。"},"examples":[{"en":"She spoke powerfully about the need for fairness.","zh":"她有力地谈到了公平的重要性。"},{"en":"The music builds powerfully toward the ending.","zh":"音乐强劲地推进，走向结尾。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that strongly affects people’s feelings or opinions; convincingly.","zh":"（使人）深受触动地；令人信服地；有感染力地。"},"examples":[{"en":"The film powerfully captures what it feels like to start over.","zh":"这部电影有力地呈现了重新开始的感受。"},{"en":"He argued powerfully that education should be accessible to everyone.","zh":"他有说服力地论证了教育应对所有人可及。"}]}],"synonyms":["strongly","forcefully","intensely","vigorously","convincingly"],"phonetic":"/ˈpaʊərfəli/","extraExplanation":["“powerfully”常用于两类语境：一是“声音/动作/力量”上的强劲（如speak, strike, push）；二是“表达/作品/论证”带来的强烈情感或说服力（如portray, capture, argue）。","写作中它可以增强语气，但若频繁使用会显得用力过猛；可根据需要换成更具体的副词，如“clearly（清晰地）”“deeply（深深地）”“forcefully（强硬地）”。"]}
{"word":"powerfulness","summary":{"en":"Powerfulness means the quality of being powerful—having great strength, influence, or strong effect.","zh":"powerfulness 指“强大”的特质：力量很强、影响力很大或效果很强烈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Great strength, influence, or ability to have a strong effect.","zh":"强大；威力；影响力（指产生强烈效果的能力）"},"examples":[{"en":"The powerfulness of the storm shocked everyone.","zh":"暴风雨的威力让所有人都震惊了。"},{"en":"She admired the powerfulness of his speech and how it moved the audience.","zh":"她很钦佩他演讲的感染力，以及它如何打动了观众。"},{"en":"The powerfulness of the image stayed in my mind for days.","zh":"那张画面的冲击力在我脑海里持续了好几天。"}]}],"synonyms":["power","strength","might","force","impact"],"phonetic":"/ˈpaʊərf(ə)lnəs/","extraExplanation":["“powerfulness”是由 powerful + -ness 构成的抽象名词，意思很直观，但在日常英语中不算最常用的选择。很多场景下母语者更常用：\n- “power”（力量/权力/动力）\n- “strength”（强度/力量）\n- “force”（武力/力量/冲击力）\n- “impact”（影响/冲击）\n例如更自然的说法常是：the power of the storm / the strength of the storm / the impact of the speech。","在写作中，“powerfulness”常用来强调一种“震撼感、感染力或说服力”，尤其在谈演讲、艺术、情感表达时：the powerfulness of language（语言的力量）。"]}
{"word":"powerhouse","summary":{"en":"A powerhouse is a very strong, influential person/organization/place, or (literally) a power station/strong engine.","zh":"powerhouse 指非常强大、有影响力的人/组织/地区；字面上也可指发电站或强劲发动机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, organization, or place that is very strong, influential, or productive.","zh":"（人、组织或地方）实力强大、影响力大或产出很高的“强者/强国/强队”。"},"examples":[{"en":"The company became a powerhouse in the tech industry.","zh":"这家公司成了科技行业的巨头。"},{"en":"She’s a powerhouse on the basketball court.","zh":"她在篮球场上是个强者。"},{"en":"California is an economic powerhouse.","zh":"加利福尼亚是经济强州。"}]},{"partOfSpeech":"n.","definition":{"en":"A power station or an engine that produces power or drives something.","zh":"发电站；（更少见）提供动力的发动机/动力装置。"},"examples":[{"en":"The region built a new powerhouse to supply electricity.","zh":"该地区建了一座新的发电站来供电。"},{"en":"This truck has a V8 powerhouse under the hood.","zh":"这辆卡车的引擎盖下是一台强劲的V8发动机。"}]}],"synonyms":["giant","leader","heavyweight","dynamo","power station"],"phonetic":"/ˈpaʊərˌhaʊs/","extraExplanation":["“powerhouse”常用作比喻，强调“强大到能带动他人/领域”的力量，语气偏褒义。用于人时，常暗示精力旺盛、能力全面、很能干。","在体育和商业语境里很常见：a powerhouse team/company = 传统强队/行业巨头。","字面意义来自“house（房子）+ power（动力/电力）”，早期指放置机器或发电设备的建筑（发电站），后来引申为“强者、强国”。"]}
{"word":"powerhouses","summary":{"en":"“Powerhouses” is the plural of “powerhouse,” meaning very powerful and successful people/organizations/countries, or (less commonly) buildings where electricity is generated.","zh":"“Powerhouses”是“powerhouse”的复数，常指在某领域实力很强的强者/巨头/强国；较少见时也指发电站等发电设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, team, company, or country that is very strong, successful, or influential in a particular area.","zh":"在某个领域非常强大、成功或有影响力的人、团队、公司或国家（强者、巨头）。"},"examples":[{"en":"Japan is an economic powerhouse in Asia.","zh":"日本是亚洲的经济强国。"},{"en":"That school has become a powerhouse in basketball.","zh":"那所学校已成为篮球强队。"},{"en":"She’s a powerhouse on stage—confident and energetic.","zh":"她在舞台上气场很强——自信又充满能量。"}]},{"partOfSpeech":"n.","definition":{"en":"A building or facility where electric power is produced (a power station).","zh":"发电的建筑或设施（发电站）。"},"examples":[{"en":"The town gets electricity from a nearby hydroelectric powerhouse.","zh":"这个小镇的电力来自附近的水力发电站。"},{"en":"The old powerhouse was turned into a museum.","zh":"那座老发电站被改造成了博物馆。"}]}],"synonyms":["giant","leader","dominant force","heavyweight","major player","power station"],"phonetic":"/ˈpaʊərˌhaʊs/","extraExplanation":["“powerhouse(s)”常用于新闻和评论写作，强调“整体实力很强、在竞争中占主导”。可以形容国家（an industrial powerhouse 工业强国）、公司（a tech powerhouse 科技巨头）、运动队（a baseball powerhouse 棒球强队），也可以形容个人（a creative powerhouse 创意十足的实力派）。","词形上，powerhouses 是复数；单数是 powerhouse。读写时注意：复数通常写作 powerhouses（-es），因为以 -se 结尾更自然加 -s/-es。"]}
{"word":"powering","summary":{"en":"“Powering” usually means supplying energy/electricity to run something, and it can also mean moving forward forcefully.","zh":"“Powering”通常指为某物供能/供电使其运转，也可表示强劲快速地向前推进。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"providing power (electricity or energy) to make something work; also used to describe moving forward strongly and quickly.","zh":"为（某物）提供动力/电力使其运转；也可指强劲地快速前进。"},"examples":[{"en":"Solar panels are powering the streetlights at night.","zh":"太阳能板在夜间为路灯供电。"},{"en":"A small battery is powering the remote control.","zh":"一节小电池在给遥控器供电。"},{"en":"The truck came powering up the hill despite the snow.","zh":"尽管下着雪，那辆卡车仍然强劲地爬上了山坡。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “power”: to supply energy to; to drive or move with force.","zh":"动词 power 的现在分词：为……提供能量/驱动；用力量推动或快速行进。"},"examples":[{"en":"They are powering the factory with wind energy.","zh":"他们正在用风能为工厂供能。"},{"en":"She kept powering through the last mile.","zh":"她继续咬牙坚持，冲过最后一英里。"}]}],"synonyms":["supplying power","energizing","driving","fueling","propelling"],"phonetic":"/ˈpaʊərɪŋ/","extraExplanation":["“Powering”常见于科技/能源语境：powering a device（给设备供电）、powering a city（为城市供能）。当它表示“强劲前进”时，语气更生动，常用于描写车辆、风暴、人物冲刺等场景。","学习搭配：power something with + 能源（用……为……供能），例如 power the home with solar energy（用太阳能为家庭供能）；power through + 困难/任务（咬牙坚持完成），例如 power through a meeting（硬撑着开完会）。"]}
{"word":"powerless","summary":{"en":"Powerless means lacking control or influence, or being ineffective against something.","zh":"powerless 表示缺乏掌控或影响力，或对某事不起作用、无能为力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to control a situation or make things happen the way you want; lacking power or influence.","zh":"无力的；无法掌控局势的；缺乏权力或影响力的。"},"examples":[{"en":"She felt powerless to stop the rumors at school.","zh":"她觉得自己无力阻止学校里的谣言。"},{"en":"Many citizens are powerless when faced with unfair rules.","zh":"面对不公平的规定，许多公民感到无能为力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Unable to act effectively; weak or ineffective in a particular situation.","zh":"不起作用的；（在某种情况下）软弱无效的。"},"examples":[{"en":"His apology was powerless to repair the damage.","zh":"他的道歉无力弥补造成的伤害。"},{"en":"The medicine was powerless against the infection.","zh":"这种药对感染不起作用。"}]}],"synonyms":["helpless","impotent","ineffective","weak","unable"],"phonetic":"/ˈpaʊərləs/","extraExplanation":["“powerless”常用来描述一种心理感受（觉得自己无法改变现状），也可以描述事物“无效/不起作用”（如药物、道歉、法律措施）。语气比“weak（弱）”更强调“缺乏掌控与影响”。","常见搭配：feel powerless（感到无力）、powerless to do sth（无力做某事）、be powerless against sth（对……无能为力）、a powerless victim（无力的受害者）。","文学与写作中，“powerless”常用来突出人物在社会结构、命运或权力体系前的渺小感，用来营造压迫感或悲剧感。"]}
{"word":"powerlessly","summary":{"en":"Powerlessly means “helplessly”—without the power to act or change the situation.","zh":"powerlessly 表示“无力地/无能为力地”，强调缺乏力量或影响，无法改变局势。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you have no power or ability to control what is happening; helplessly.","zh":"无力地；无能为力地（指没有力量或无法控制正在发生的事）。"},"examples":[{"en":"He watched powerlessly as the floodwater rose.","zh":"他无力地看着洪水水位不断上涨。"},{"en":"She lay powerlessly on the ground, too weak to stand.","zh":"她无力地躺在地上，虚弱得站不起来。"}]}],"synonyms":["helplessly","weakly","ineffectively","without control"],"phonetic":"/ˈpaʊər.ləs.li/","extraExplanation":["“powerlessly”常用来表达一种强烈的情绪：明明看见问题发生，却没有办法阻止或改变结果。写作中常和动词如 watch, stand by, struggle, try 连用，营造无助与紧张感。","近义表达里，“helplessly”更常见、更口语；“powerlessly”语气更强调“缺乏力量/影响力”，在新闻或文学描写里更有力度。"]}
{"word":"powerlessness","summary":{"en":"Powerlessness means the state or feeling of having no power or control, often emotionally or socially.","zh":"Powerlessness 指“无力感/无权状态”，强调缺乏控制或影响力，常用于情绪体验或社会政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having no power, control, or ability to change a situation","zh":"无力感；无能为力的状态（缺乏权力、控制或改变处境的能力）"},"examples":[{"en":"She felt a deep sense of powerlessness when she couldn’t help her friend.","zh":"当她无法帮助朋友时，她感到深深的无力感。"},{"en":"Many people experience powerlessness during long delays in the legal process.","zh":"在漫长的法律程序拖延中，许多人会感到无能为力。"}]},{"partOfSpeech":"n.","definition":{"en":"lack of political or social power; being unable to influence decisions or others","zh":"（政治/社会层面的）无权无势；无法影响决策或他人"},"examples":[{"en":"The report highlighted the powerlessness of poor communities in local politics.","zh":"报告强调了贫困社区在地方政治中的弱势与无权无势。"},{"en":"He spoke about the powerlessness workers can feel when policies change suddenly.","zh":"他谈到当政策突然变化时，工人可能感到的那种无力与弱势。"}]}],"synonyms":["helplessness","impotence","lack of control","inability"],"phonetic":"/ˈpaʊɚləsnəs/","extraExplanation":["构词法：power（力量/权力）+ -less（“没有……”）→ powerless（无力的）+ -ness（名词后缀，表示“状态/性质”）→ powerlessness（无力感/无权状态）。","语感区别：powerlessness常带有“心理感受”的意味（感到无力），而lack of power更偏中性描述“缺少权力”。","常见搭配：a sense/feeling of powerlessness（无力感）；political powerlessness（政治无权）；learned powerlessness（常指长期失败后形成的“习得性无助/无力感”，语境多见于心理学或自助类写作）。"]}
{"word":"powermonger","summary":{"en":"A powermonger is someone who aggressively seeks and uses power, often in a selfish or manipulative way.","zh":"powermonger 指以自私、操控的方式积极追逐并运用权力的人（贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who seeks power and influence in an aggressive or selfish way, often by controlling others or using politics.","zh":"权力掮客；权力狂（指以自私或强势方式追求权力与影响力的人，常通过操控他人或玩弄政治手段）"},"examples":[{"en":"Some critics called the senator a powermonger who cared more about control than service.","zh":"一些批评者称这位参议员是个权力狂，比起服务公众更在乎掌控。"},{"en":"In the novel, the powermonger manipulates the court to remove his rivals.","zh":"在小说里，这个权力掮客操纵宫廷来清除对手。"},{"en":"She refused to work for a powermonger who bullied the whole team.","zh":"她拒绝为一个欺压整个团队的权力狂工作。"}]}],"synonyms":["power-hungry person","power seeker","authoritarian","control freak (informal)","tyrant (stronger)"],"phonetic":"/ˈpaʊ.ɚˌmɑŋ.ɡɚ/","extraExplanation":["“powermonger”带明显贬义，常用于批评那些把权力当作目的本身的人。词尾“-monger”有“兜售/贩卖（某物）的人”的含义（如 fishmonger 卖鱼的人），因此该词暗示“像兜售商品一样追逐权力”。","在新闻评论、政治分析或职场批评语境中更常见；比起中性词 power broker（权力掮客/能运作资源的人），“powermonger”更强调滥权、操控与道德问题。"]}
{"word":"powerplants","summary":{"en":"A power plant is a facility that generates electricity.","zh":"power plant 指“发电厂/电站”，用于发电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a factory or facility where electricity (or sometimes heat) is produced, often by burning fuel, using nuclear energy, or using renewable sources like wind, water, or sunlight","zh":"发电厂；电站（生产电力的工厂或设施，有时也供热；能源来源可为燃煤/燃气、核能或风能、水能、太阳能等）"},"examples":[{"en":"The city gets most of its electricity from a natural-gas power plant.","zh":"这座城市的大部分电力来自一座天然气发电厂。"},{"en":"Many old coal power plants are being replaced by wind and solar farms.","zh":"许多老旧的燃煤电站正在被风电和光伏电站取代。"},{"en":"The government announced new safety rules for nuclear power plants.","zh":"政府公布了核电站的新安全规定。"}]}],"synonyms":["power station","generating station","electric plant"],"phonetic":"/ˈpaʊər plænt/","extraExplanation":["“power plant”在美式英语中最常见指“发电厂/电站”。当你写成一个词“powerplant(s)”在技术文档或标题里也能见到，但日常写作更常写作两个词：power plant / power plants。","常见搭配：coal-fired power plant（燃煤电厂）、gas-fired power plant（燃气电厂）、nuclear power plant（核电站）、hydroelectric power plant（/hydropower plant，水电站）、power plant emissions（电厂排放）。"]}
{"word":"PowerPoint","summary":{"en":"PowerPoint is Microsoft’s slide-presentation software; it can also mean presenting with those slides.","zh":"PowerPoint 是微软的幻灯片演示软件；也可指用幻灯片进行演示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Microsoft program used to create and show presentations with slides (text, pictures, charts, etc.)","zh":"（微软的）PowerPoint：用于制作并展示幻灯片演示文稿的软件（可包含文字、图片、图表等）"},"examples":[{"en":"I made a PowerPoint for my history class.","zh":"我为历史课做了一个PPT。"},{"en":"Please send me the PowerPoint before the meeting.","zh":"请在会议前把PowerPoint文件发给我。"},{"en":"She presented her PowerPoint slides to the team.","zh":"她向团队展示了她的PPT幻灯片。"}]},{"partOfSpeech":"v.","definition":{"en":"to present information using PowerPoint slides","zh":"用PPT做展示；用PowerPoint演示"},"examples":[{"en":"He PowerPointed the results in five minutes.","zh":"他用PPT在五分钟内展示了结果。"},{"en":"We’re going to PowerPoint our proposal tomorrow.","zh":"我们明天要用PPT展示我们的方案。"}]}],"synonyms":["slide deck","slides","presentation"],"phonetic":"/ˈpaʊərˌpɔɪnt/","extraExplanation":["在中文语境里，“PPT”常指幻灯片文件本身或演示行为；而英语里更常说“slides / a slide deck / a presentation”。比如：Send me the slides. / I’ll give a presentation.","“PowerPoint”是品牌名，写作时通常首字母大写；文件也常叫“a PowerPoint (file) / a .pptx file”。动词用法“to PowerPoint”较口语、偏随意，正式场合更推荐用“present”。"]}
{"word":"powerpoint","summary":{"en":"PowerPoint is Microsoft’s slide-presentation software, and it can also mean a PPT file or (informally) the act of making one.","zh":"PowerPoint 是微软的幻灯片演示软件，也可指一份PPT文件，口语中还可作动词表示“做PPT”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Microsoft program used to create and show presentations with slides (text, pictures, charts, etc.).","zh":"一种微软软件，用来制作并播放由“幻灯片”组成的演示文稿（包含文字、图片、图表等）。"},"examples":[{"en":"I made a PowerPoint for my class presentation.","zh":"我为课堂展示做了一个PPT。"},{"en":"Please send me the PowerPoint slides before the meeting.","zh":"请在开会前把PPT幻灯片发给我。"}]},{"partOfSpeech":"n.","definition":{"en":"A presentation file or slide deck made with PowerPoint (often called a “PPT”).","zh":"用PowerPoint制作的演示文稿/幻灯片文件（常简称为“PPT”）。"},"examples":[{"en":"Could you share the PowerPoint with everyone?","zh":"你能把这份PPT分享给大家吗？"},{"en":"Her PowerPoint was clear and easy to follow.","zh":"她的PPT很清晰，容易理解。"}]},{"partOfSpeech":"v.","definition":{"en":"To create or prepare a presentation using PowerPoint (informal).","zh":"（非正式）用PowerPoint做演示文稿；做PPT。"},"examples":[{"en":"I need to PowerPoint my results for tomorrow.","zh":"我得把结果做成PPT，明天要用。"},{"en":"He stayed late to PowerPoint the training materials.","zh":"他加班到很晚把培训材料做成PPT。"}]}],"synonyms":["slide deck","presentation","slides"],"phonetic":"/ˈpaʊərˌpɔɪnt/","extraExplanation":["在日常英语里，人们更常说“a PowerPoint presentation / slides / deck”。把它当动词用（例如“I’ll PowerPoint it”）比较口语、也更常见于职场。","“PPT”在英语口语中也会用，但通常在熟悉的工作语境；正式场合写作更推荐写“PowerPoint slides”或“PowerPoint presentation”。"]}
{"word":"powers","summary":{"en":"“Powers” most often means “types of power/authority/ability,” and it can also mean “those in authority,” “major countries,” or (as a verb) “supplies power to.”","zh":"“powers” 常指“多种权力/能力/影响力”，也可指“当权者”“强国”，或作动词表示“为……供电/提供动力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of power: ability, strength, or control; often used for different kinds of ability or influence.","zh":"power 的复数：能力、力量或控制力；常指多种能力或影响力。"},"examples":[{"en":"The new law increases the powers of the police.","zh":"新法律扩大了警方的权力。"},{"en":"She has powers of observation that most people lack.","zh":"她有大多数人所缺乏的观察能力。"}]},{"partOfSpeech":"n.","definition":{"en":"People or groups that hold authority or influence, especially governments or leaders (often: the powers).","zh":"掌权者、当局；尤指政府或领导层（常用：the powers）。"},"examples":[{"en":"The powers decided to raise taxes.","zh":"当局决定提高税收。"},{"en":"He tried to appeal to the powers that be.","zh":"他试图向当权者申诉。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong countries or major political forces, especially in international relations (e.g., world powers).","zh":"强国、大国；国际关系中的主要政治力量（如：world powers）。"},"examples":[{"en":"Several powers competed for influence in the region.","zh":"几个大国争夺在该地区的影响力。"}]},{"partOfSpeech":"n.","definition":{"en":"In math/science: exponents (powers of a number), or the result of raising a number to an exponent.","zh":"数学/科学：幂、指数（如某数的幂），或乘方得到的结果。"},"examples":[{"en":"Two to the powers of three and four are 8 and 16.","zh":"2 的 3 次幂和 4 次幂分别是 8 和 16。"}]},{"partOfSpeech":"vt.","definition":{"en":"Third-person singular of power: to supply energy to; to make a machine or system run.","zh":"power 的第三人称单数：为……提供动力/电力；使机器或系统运转。"},"examples":[{"en":"The battery powers the flashlight.","zh":"电池给手电筒供电。"},{"en":"Solar panels power the building during the day.","zh":"白天太阳能板为这栋楼供电。"}]}],"synonyms":["authorities","abilities","influence","control","strength","leaders","governing bodies"],"phonetic":"/ˈpaʊərz/","extraExplanation":["“the powers that be” 是固定表达，意思是“当权者/掌权的人（或机构）”，语气通常较正式或带一点无奈，强调“决定权在他们手里”。","在文学或奇幻语境里，powers 也常指“超能力”，如: superpowers（超能力）。是否有这种含义要看上下文。"]}
{"word":"powerset","summary":{"en":"The powerset (power set) of a set is the set containing every subset of that set.","zh":"幂集（power set）是由某个集合的所有子集组成的集合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) the set of all subsets of a given set, including the empty set and the set itself.","zh":"（数学）给定集合的所有子集所组成的集合，包括空集和该集合本身。"},"examples":[{"en":"If S = {1, 2}, the powerset of S is {∅, {1}, {2}, {1, 2}}.","zh":"如果 S = {1, 2}，那么 S 的幂集是 {∅, {1}, {2}, {1, 2}}。"},{"en":"In combinatorics, we often look at the powerset when counting possible selections.","zh":"在组合数学中，我们经常通过幂集来统计所有可能的选择方式。"}]}],"synonyms":["power set","P(S)","𝒫(S)"],"phonetic":"/ˈpaʊərˌsɛt/","extraExplanation":["“powerset”更常见的写法是分开写成“power set”，也常用符号 𝒫(S) 表示集合 S 的幂集。","如果一个集合有 n 个元素，它的幂集包含 2^n 个子集，这是因为每个元素都有“选/不选”两种可能。"]}
{"word":"powersets","summary":{"en":"“Powersets” means the power sets of one or more sets: the set(s) containing all subsets.","zh":"“powersets”指一个或多个集合的幂集：包含该集合所有子集的集合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the collection of all possible subsets of a given set (including the empty set and the set itself)","zh":"（数学）幂集：由某个集合的所有子集组成的集合（包含空集和原集合本身）"},"examples":[{"en":"The powerset of {1,2} is {∅, {1}, {2}, {1,2}}.","zh":"集合 {1,2} 的幂集是 {∅, {1}, {2}, {1,2}}。"},{"en":"In set theory, we often write the powerset of S as P(S) or 𝒫(S).","zh":"在集合论中，我们常把集合 S 的幂集写作 P(S) 或 𝒫(S)。"}]}],"synonyms":["power sets","the set of all subsets","P(S)","𝒫(S)"],"phonetic":"ˈpaʊɚ sɛt","extraExplanation":["“powersets”是“power set”的复数形式，常见于数学、计算机科学（如枚举所有子集、子集动态规划）等语境。","如果一个集合有 n 个元素，那么它的幂集有 2^n 个子集；这就是为什么在编程里生成幂集往往会很快变得很慢（规模指数增长）。"]}
{"word":"powerstat","summary":{"en":"A Powerstat is a variable autotransformer used to smoothly adjust AC voltage.","zh":"Powerstat 指用于平滑调节交流电压的可变自耦变压器（常为品牌名的泛称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name often used generically for a variable autotransformer used to adjust AC voltage smoothly (commonly in labs, workshops, and testing).","zh":"（常作通用名）“Powerstat”是可变自耦变压器的一种品牌名，常用于平滑调节交流电压（常见于实验室、车间和测试场景）。"},"examples":[{"en":"Use the Powerstat to bring the voltage up slowly during the test.","zh":"测试时用 Powerstat 把电压慢慢升上去。"},{"en":"The technician set the Powerstat to 90 volts to match the equipment’s requirements.","zh":"技术员把 Powerstat 调到 90 伏，以符合设备需求。"},{"en":"In the lab, we connected the heater to a Powerstat for precise control.","zh":"在实验室里，我们把加热器接到 Powerstat 上以便精确控制。"}]}],"synonyms":["Variac","variable autotransformer","variable transformer"],"phonetic":"/ˈpaʊərˌstæt/","extraExplanation":["“Powerstat”最初是美国公司（如今相关产品常由不同厂商提供）推出的商标，很多工程人员会把它当作“可变自耦变压器（Variac/variable autotransformer）”的泛称使用。","它通常输出交流电压的可调范围（常见如 0–120V 或 0–140V），但不一定提供与市电的电气隔离；需要隔离时一般要配合“隔离变压器（isolation transformer）”。"]}
{"word":"powhatan","summary":{"en":"Powhatan most commonly refers to a Native American people and confederacy in coastal Virginia; it can also mean their language or the title/name of their paramount chief.","zh":"Powhatan 最常指弗吉尼亚沿海地区的美洲原住民族群与“波瓦坦联盟”；也可指其语言，或联盟最高首领的称号/姓名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American people (and political alliance) who historically lived in the Tidewater region of present-day Virginia; often called the Powhatan Confederacy.","zh":"居住在今美国弗吉尼亚州滨海低地（Tidewater）地区的美洲原住民族群与联盟，常称“波瓦坦联盟（Powhatan Confederacy）”。"},"examples":[{"en":"The English settlers at Jamestown had early contact with the Powhatan people.","zh":"詹姆斯敦的英国殖民者早期与波瓦坦人有接触。"},{"en":"Some historians describe the Powhatan Confederacy as a network of many smaller tribes.","zh":"一些历史学家把波瓦坦联盟描述为由许多较小部族组成的网络。"}]},{"partOfSpeech":"n.","definition":{"en":"The Algonquian language traditionally spoken by the Powhatan people, sometimes called Virginia Algonquian.","zh":"波瓦坦人传统使用的一种阿尔冈昆语系语言，也常被称为“弗吉尼亚阿尔冈昆语”。"},"examples":[{"en":"A few Powhatan words survive in place names in Virginia.","zh":"一些波瓦坦语词汇在弗吉尼亚的地名中仍保留下来。"}]},{"partOfSpeech":"n.","definition":{"en":"The title/name used for the paramount chief of the Powhatan Confederacy; especially Wahunsenacawh, the leader during the early Jamestown period.","zh":"波瓦坦联盟最高首领的称号/名称；尤指詹姆斯敦早期时期的领袖瓦洪森纳考（Wahunsenacawh）。"},"examples":[{"en":"In many accounts, Powhatan is portrayed as a powerful leader negotiating with the English.","zh":"在许多记载中，波瓦坦被描绘成与英国人周旋谈判的强势领袖。"}]}],"synonyms":["Powhatan Confederacy","Virginia Algonquian","Wahunsenacawh","Tidewater tribes"],"phonetic":"/ˈpaʊhəˌtæn/","extraExplanation":["“Powhatan”一词在英语材料里常同时指：族群/联盟、语言，以及最高首领的称号（因此读历史文章时要看上下文判断）。","与大众文化相关的背景：波瓦坦首领与其女儿“Pocahontas（宝嘉康蒂）”常出现在早期北美殖民（如詹姆斯敦）叙事与改编作品中；但不少影视讲述会简化或浪漫化历史，学习时可对照较严谨的历史资料。"]}
{"word":"powhead","summary":{"en":"A Scots dialect word meaning “head,” sometimes also used as an insult meaning “blockhead.”","zh":"苏格兰方言词，意为“头”，有时也用作骂人话，指“笨蛋/木头人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) A head; the top part of the body.","zh":"（苏格兰方言）头；头部。"},"examples":[{"en":"He hit his powhead on the low beam.","zh":"他的头撞到了低矮的横梁。"},{"en":"Keep your powhead down when you walk under that stair.","zh":"从楼梯下面走时把头低一点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, informal) Used as an insult meaning “stupid person” or “blockhead.”","zh":"（苏格兰口语）骂人的话，指“笨蛋、木头人”。"},"examples":[{"en":"Don’t be a powhead—read the instructions first.","zh":"别当个笨蛋——先把说明书读一遍。"},{"en":"He called me a powhead for forgetting the keys.","zh":"我忘了带钥匙，他骂我是个笨蛋。"}]}],"synonyms":["head","noggin","blockhead (insult)","idiot (informal)"],"phonetic":"/ˈpaʊhɛd/","extraExplanation":["“pow”在苏格兰英语/苏格兰语（Scots）里常指“头”，所以“powhead”字面意思就是“头”。在现代标准英语里不常用，更可能在苏格兰地区的口语、文学对白或方言写法中见到。","如果你是在网络上看到“powhead”，也可能是拼写变体或打错字（例如想写“powderhead”之类的词）。如你愿意，可以把原句发来，我可以帮你按语境判断。"]}
{"word":"powitch","summary":{"en":"\"Powitch\" is most likely a surname (a proper name), not a standard English word with a dictionary meaning.","zh":"“Powitch”很可能是一个姓氏（专有名词），并非词典里常见、具有固定词义的英语单词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). It is not a common English vocabulary word and is usually seen as a proper name.","zh":"一个姓氏（家族名）。它不是常见的英语词汇，通常作为专有名词出现。"},"examples":[{"en":"Ms. Powitch will lead the meeting today.","zh":"Powitch 女士今天将主持会议。"},{"en":"I found a book by an author named Powitch.","zh":"我找到了一本作者姓 Powitch 的书。"}]}],"phonetic":"/ˈpoʊwɪtʃ/","extraExplanation":["“Powitch”更像是姓名/姓氏的拼写，而不是英语里有固定词义的普通词。若你是在查某个单词，可能是拼写误差（例如：\"Polish\"、\"powder\"、\"switch\" 等）。","如果你能告诉我它出现的句子或来源（书名、文章、截图），我可以帮你判断它到底是哪一个词或是否为专有名词。"]}
{"word":"powldoody","summary":{"en":"“powldoody” isn’t a recognized English word; it’s probably a typo or a made-up term.","zh":"“powldoody”不是常见英语词；多半是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo, username, or playful nonsense word with no fixed dictionary meaning.","zh":"不是标准英语单词；很可能是拼写错误、用户名，或是玩笑式的“无意义词”，没有固定的词典释义。"},"examples":[{"en":"I searched for “powldoody,” but I couldn’t find a dictionary definition.","zh":"我搜索了“powldoody”，但找不到词典释义。"},{"en":"Is “powldoody” a name, or did you mean another word?","zh":"“powldoody”是名字吗，还是你想写另一个词？"}]}],"phonetic":"/ˌpaʊlˈduːdi/","extraExplanation":["从拼写看，powldoody 可能是随手打出来的拟声/搞笑词，或是把某个词拼错了。你可以告诉我：①你在哪个句子里看到它；②想表达的中文意思；③是否可能是这些更常见的词：\"pal\"（朋友）、\"poultry\"（家禽）、\"duty\"（责任/税）、\"poodle\"（贵宾犬）等。提供上下文后我可以帮你准确匹配目标词并给出正式释义与例句。"]}
{"word":"pownie","summary":{"en":"“pownie” is a Scots dialect spelling meaning “pony,” a small horse.","zh":"“pownie”是苏格兰方言中“pony（小马）”的一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots dialect) a pony; a small horse.","zh":"（苏格兰方言）小马；矮种马。"},"examples":[{"en":"In the old story, the child rode a pownie across the moor.","zh":"在老故事里，孩子骑着一匹小马穿过荒原。"},{"en":"They kept a sturdy pownie for carrying supplies.","zh":"他们养了一匹结实的小马用来搬运物资。"}]}],"synonyms":["pony","small horse"],"phonetic":"/ˈpoʊni/","extraExplanation":["“pownie”不是现代标准英语里的常用拼写，更常见的是“pony”。在一些苏格兰英语/苏格兰方言（Scots）语境中，会看到“pownie”这种更口语、更地方化的写法，用来表示“小马”。","如果你是在聊天或作业里看到“pownie”，也可能是把“pony”拼错了。你可以告诉我出现它的句子，我能帮你判断具体是哪一种。"]}
{"word":"powny","summary":{"en":"“powny” is not standard; it’s usually a misspelling of “pony.”","zh":"“powny”不是标准拼写；通常是把“pony”误拼了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“powny” is not a standard English word. It most often appears as a misspelling of “pony.”","zh":"“powny”不是标准英语单词，最常见是把“pony”误拼成“powny”。"},"examples":[{"en":"I think you meant “pony,” not “powny.”","zh":"我觉得你想写的是“pony”，不是“powny”。"},{"en":"She typed “powny” by mistake while searching for pony pictures.","zh":"她在搜小马图片时不小心把“pony”打成了“powny”。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “pony”: a small horse; also a small ponytail hairstyle (informal).","zh":"如果你想说“pony”：指“小马”；也可非正式指“小马尾”发型。"},"examples":[{"en":"The kids rode a pony at the farm.","zh":"孩子们在农场骑了小马。"},{"en":"She tied her hair in a pony (ponytail).","zh":"她把头发扎成了马尾。"}]}],"synonyms":["pony (likely intended word)"],"phonetic":"/ˈpoʊni/","extraExplanation":["“powny”在词典里通常查不到；如果你是在游戏/网络语境看到的，也可能是打字错误或用户名拼写。你可以告诉我它出现的句子，我能更准确判断你想表达的是“pony”还是别的词（比如俚语“pwn”相关的变体）。"]}
{"word":"pows","summary":{"en":"POWs means “prisoners of war,” the plural form of POW.","zh":"POWs 指“战俘”，是 POW（prisoner of war，战俘）的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"prisoners of war; people captured and held by an enemy during a war (plural of POW).","zh":"战俘；在战争中被敌方俘虏并拘押的人（POW 的复数）。"},"examples":[{"en":"The camp held hundreds of POWs during the conflict.","zh":"冲突期间，这个营地关押了数百名战俘。"},{"en":"After the war ended, many POWs were finally allowed to return home.","zh":"战争结束后，许多战俘终于获准回家。"},{"en":"The documentary interviews former POWs about their daily life in captivity.","zh":"这部纪录片采访了前战俘，了解他们被囚禁时的日常生活。"}]}],"synonyms":["prisoners of war","captives (in war)"],"phonetic":"/ˌpiː.oʊˈdʌb.əl.juːz/","extraExplanation":["“POW”是“prisoner of war”的缩写，常用全大写；复数写作“POWs”。在新闻与历史写作中很常见，语气相对正式。"]}
{"word":"powsoddy","summary":{"en":"A traditional Scottish soup, often made from a sheep’s head with barley or oatmeal.","zh":"一种传统苏格兰汤品，常用羊头配大麦或燕麦熬煮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish) A traditional soup or broth, usually made from a sheep’s head (or sometimes other meat) and barley or oatmeal.","zh":"（苏格兰用语）一种传统汤/肉汤，通常用羊头（有时也用其他肉）加大麦或燕麦煮成。"},"examples":[{"en":"In some parts of Scotland, powsoddy was a common winter meal.","zh":"在苏格兰的一些地区，powsoddy 曾是常见的冬季餐食。"},{"en":"He ordered powsoddy to try an old Scottish dish.","zh":"他点了 powsoddy，想尝尝一道古老的苏格兰菜。"}]}],"synonyms":["broth","soup","Scottish broth"],"phonetic":"/ˈpaʊˌsaʊdi/","extraExplanation":["这是一个带有浓厚地域色彩的苏格兰词，多见于方言/民俗饮食语境；在现代英语中比较少见，更多出现在历史描述、地方菜单或文学再现里。","词形常见变体包括 powsowdie / pow-sowdie（不同地区拼写不同）。其中 pow 在苏格兰语里可指“头”（如动物头），因此整词与“用头煮的汤”相关。"]}
{"word":"powsowdy","summary":{"en":"“powsowdy” isn’t recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“powsowdy”不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username. I can’t give a reliable dictionary definition without more context.","zh":"不是标准英语单词；很可能是拼写错误，或是人名/用户名。没有更多语境我无法给出可靠的词典释义。"},"examples":[{"en":"I couldn’t find “powsowdy” in a dictionary—did you mean “powwow” or another word?","zh":"我在词典里找不到“powsowdy”——你是不是想写“powwow”或其他单词？"},{"en":"Can you paste the sentence where you saw “powsowdy”?","zh":"你能把出现“powsowdy”的句子贴出来吗？"}]}],"phonetic":"/ˈpaʊˌsaʊdi/","extraExplanation":["“powsowdy”很像是拼写变体或键盘误触。最接近的常见英语词可能是：\n1) powwow（会谈；开会；也可指源自北美原住民文化的集会/舞会，这个用法在当代语境中需要更注意文化敏感度）；\n2) howdy（口语：你好，多见于美国南部/西部口吻）；\n3) possibly “Powsowdy” 作为专有名词（人名、地名、账号名等）。\n如果你提供来源句子或你想表达的中文意思，我可以帮你锁定正确单词并给出准确释义。"]}
{"word":"powter","summary":{"en":"Powter is an old spelling of “pewter,” a tin-based gray metal used for cups, plates, and other items.","zh":"Powter 是“pewter”的旧式拼写，指以锡为主的灰色金属合金，常用于制作杯子、盘子等器物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old or nonstandard spelling of “pewter,” a soft gray metal alloy (mainly tin) used to make cups, plates, and other objects","zh":"“pewter（白镴/锡合金）”的旧式或非标准拼写；指一种柔软的灰色金属合金（主要成分是锡），常用于制作杯子、盘子等器皿"},"examples":[{"en":"The inn served ale in powter mugs.","zh":"旅店用白镴（powter）杯子盛啤酒。"},{"en":"In old documents, you may see “powter” where modern English would write “pewter.”","zh":"在旧文献中，你可能会看到用“powter”来表示现代英语的“pewter”。"}]}],"synonyms":["pewter"],"phonetic":"/ˈpjuːtɚ/","extraExplanation":["“powter”多见于较早期的英语拼写变体。现代标准拼写通常是“pewter”。如果你是在小说、历史记录或仿古文本里看到“powter”，一般可直接按“pewter（白镴/锡器）”来理解。","白镴器在欧洲历史上很常见：比银便宜、比陶更耐用，所以在酒馆、家庭餐具和装饰品中经常出现。"]}
{"word":"powters","summary":{"en":"“Powters” is an archaic plural meaning “pewterers,” people who made or sold pewter goods.","zh":"“Powters”是古体拼写的复数，意思是“白镴匠/白镴制品商”，指制作或贩卖白镴器的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A person who makes or sells pewter goods; a pewterer.","zh":"（古体）白镴（pewter）制品的制造者或卖家；白镴匠。"},"examples":[{"en":"In old records, the town listed several powters who supplied cups and plates.","zh":"在旧档案里，这个镇登记了几位powters，负责供应杯子和盘子。"},{"en":"He apprenticed as a powter before opening his own small shop.","zh":"他先当白镴匠学徒，后来才开了自己的小店。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of powter (pewterer).","zh":"powter 的复数形式（白镴匠/白镴制品商）。"},"examples":[{"en":"The guild admitted three new powters this year.","zh":"这个行会今年接纳了三位新的powters。"}]}],"synonyms":["pewterer","metalworker","tinsmith"],"phonetic":"/ˈpjuːtər/","extraExplanation":["“powter”是“pewter”的古拼写变体之一，现代英语更常用“pewterer”（白镴匠）来指从事白镴器制作/买卖的人。","白镴（pewter）是一种以锡为主的合金，历史上常用于制作餐具、酒壶、烛台等日用品。阅读历史小说、行会记录或家谱资料时，可能会遇到“powter/powters”这种拼写。"]}
{"word":"powwow","summary":{"en":"Powwow can mean an informal meeting for discussion, and it can also refer to a traditional Native American cultural gathering.","zh":"Powwow 可指非正式的碰头会/讨论会，也可指北美原住民/原住民族的传统文化聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A meeting or gathering for discussion, planning, or making decisions (often informal).","zh":"（常指非正式的）会议；聚会商量、讨论或做决定。"},"examples":[{"en":"Let’s have a quick powwow after class to plan the project.","zh":"下课后我们快速开个小会来规划这个项目。"},{"en":"The team held a powwow to decide who would present.","zh":"团队开了个小会来决定谁来做展示。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional gathering of Native American/Indigenous peoples featuring dancing, singing, drumming, and community activities.","zh":"（北美原住民/原住民族的）传统聚会；常包括舞蹈、歌唱、击鼓与社区活动。"},"examples":[{"en":"We visited a local powwow and watched the drummers and dancers.","zh":"我们参观了当地的传统聚会，看了鼓手和舞者表演。"},{"en":"The powwow celebrates community, culture, and tradition.","zh":"这场传统聚会庆祝社区、文化与传统。"}]},{"partOfSpeech":"v.","definition":{"en":"To meet and talk or discuss something, usually quickly or informally.","zh":"（非正式）开会商量；碰头讨论。"},"examples":[{"en":"We’ll powwow tomorrow to finalize the schedule.","zh":"我们明天碰头把日程定下来。"},{"en":"The managers powwowed about the budget changes.","zh":"经理们就预算变动进行了简短讨论。"}]}],"synonyms":["meeting","huddle","discussion","gathering"],"phonetic":"/ˈpaʊwaʊ/","extraExplanation":["在现代英语里，powwow 很常用于“开个小会/碰头会”。但它最初指北美原住民族的传统聚会。因为涉及特定文化来源，在正式写作或对外场合使用时，若只是想表达“会议”，可以改用 meeting / huddle / quick chat 等更中性词汇，以避免给人“借用原住民文化当作随口说法”的感觉。","词源提示：该词来自阿尔冈昆语系相关词汇（早期英语中拼写与用法多有变化），后来在英语里扩展出“讨论会”的引申义。"]}
{"word":"powwowed","summary":{"en":"“Powwowed” means “had an informal discussion/meeting,” and it can also mean “attended a Native American powwow.”","zh":"“powwowed”表示“进行了一次非正式商量/小型会议”，也可表示“参加了北美原住民的powwow传统聚会”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense of “powwow”) to have an informal meeting or discussion, often to make a plan or decision together.","zh":"（“powwow”的过去式）进行非正式的会谈/商量，常为了一起制定计划或作出决定。"},"examples":[{"en":"We powwowed after class to decide who would present first.","zh":"下课后我们一起商量，决定谁先做展示。"},{"en":"The team powwowed in the hallway to fix the schedule problem.","zh":"团队在走廊里临时开了个小会，解决排期问题。"}]},{"partOfSpeech":"vi.","definition":{"en":"to attend or take part in a powwow (a Native American gathering that includes dance, music, and community events).","zh":"参加powwow（北美原住民的聚会/庆典，常包含舞蹈、音乐与社区活动）。"},"examples":[{"en":"They powwowed with the community during the weekend gathering.","zh":"他们在周末的社区聚会中参加了powwow活动。"}]}],"synonyms":["met","huddled","conferred","talked","consulted"],"phonetic":"/ˈpaʊ.waʊd/","extraExplanation":["“powwow”一词源自北美原住民语言（常被认为与阿尔冈昆语族有关）。在现代英语里，它既可以指原住民的传统聚会，也常被引申为“非正式开会/商量”。在日常写作中，用它表示“开个小会”通常不带恶意，但在强调文化尊重的场合（例如与原住民相关的正式语境）更建议清晰区分：谈会议可用 “meet / huddle / confer”，谈传统活动则用 “attend a powwow”。"]}
{"word":"powwower","summary":{"en":"Powwow most commonly means a quick informal meeting; it can also mean a traditional Indigenous gathering with music and dance.","zh":"Powwow 常指非正式的“碰头会/简短商量”；也可指原住民传统聚会（含歌舞与鼓乐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An informal meeting or discussion, often used for a quick talk to plan or decide something.","zh":"（非正式的）碰头会；简短的商量或讨论（常用于快速计划或做决定）。"},"examples":[{"en":"Let’s have a quick powwow after class to plan the project.","zh":"下课后我们快速碰头一下，计划一下这个项目。"},{"en":"The team had a short powwow to decide who would present.","zh":"团队简单开了个小会，决定谁来做展示。"}]},{"partOfSpeech":"n.","definition":{"en":"A gathering or ceremony of Native American/Indigenous peoples featuring traditional singing, dancing, drumming, and community activities.","zh":"（北美原住民/原住民族的）传统聚会或仪式；常有歌唱、舞蹈、鼓乐与社区活动。"},"examples":[{"en":"She attended a local powwow to learn about Indigenous culture.","zh":"她参加了当地的传统聚会，以了解原住民文化。"},{"en":"The powwow included drumming, dancing, and craft booths.","zh":"聚会有击鼓、舞蹈，还有手工艺摊位。"}]}],"synonyms":["meeting","huddle","chat","get-together","conference"],"phonetic":"/ˈpaʊwaʊ/","extraExplanation":["你写的 **powwower** 通常是拼写错误，更常见的词是 **powwow**。","在日常英语里，powwow 表示“碰头会”很常见；但它也有特定的原住民文化含义。使用时要注意语境：谈工作/学习的简短讨论可以用；指原住民活动时更要尊重其文化背景。"]}
{"word":"powwowing","summary":{"en":"Powwowing means having an informal meeting or discussion, or the act of meeting to talk things over.","zh":"powwowing 指进行一次非正式的会议/讨论，或“聚在一起商量”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal meeting or discussion (often to plan something or make a decision)","zh":"（非正式的）碰头会；商量；讨论（常为制定计划或做决定）"},"examples":[{"en":"We had a quick powwowing before the presentation.","zh":"我们在演示前快速碰头讨论了一下。"},{"en":"The team is powwowing about how to fix the problem.","zh":"团队正在商量如何解决这个问题。"}]},{"partOfSpeech":"v.","definition":{"en":"to meet and talk together informally; to hold a discussion or conference","zh":"（非正式地）开会商量；讨论；碰头"},"examples":[{"en":"Managers are powwowing to decide next year’s budget.","zh":"经理们正在开会商量决定明年的预算。"},{"en":"Let’s powwow after class about the project.","zh":"我们下课后碰头聊聊这个项目吧。"}]}],"synonyms":["huddle","meet","confer","discuss","hash out","talk over"],"phonetic":"ˈpaʊˌwaʊɪŋ","extraExplanation":["“powwow”原本指北美原住民的一种聚会/仪式（不同部族意义与形式不一），后来在日常英语里被借用为“开会、商量”。在正式写作中，若担心文化挪用或语气不够尊重，可用更中性的说法如 “meeting / discussion / huddle / conference”。","拼写与用法：powwowing 是 powwow 的现在分词/动名词形式；也常见 “have a powwow（开个会/碰头）”。"]}
{"word":"powwowism","summary":{"en":"Powwowism is a (usually critical) word for romanticizing or imitating Native American powwow culture in a stereotyped or appropriative way.","zh":"Powwowism通常是带批评的说法，指以刻板或挪用的方式浪漫化、模仿北美原住民powwow文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often critical) An excessive interest in, imitation of, or romanticized focus on Native American “powwows” and related imagery—especially by non-Native people; sometimes used to describe cultural appropriation or stereotypes.","zh":"（常含批评）对北美原住民“powwow（传统聚会/舞会）”及相关形象的过度迷恋、模仿或浪漫化关注——尤其指非原住民的行为；有时用来描述文化挪用或刻板印象。"},"examples":[{"en":"The museum was criticized for powwowism—using flashy “Indian” costumes without explaining their real cultural meaning.","zh":"这家博物馆因“powwowism”而受批评——只展示花哨的“印第安”服装，却不解释其真实文化含义。"},{"en":"Her essay warns that powwowism can turn living traditions into entertainment for outsiders.","zh":"她的文章警告说，“powwowism”可能把仍在延续的传统变成外来者的娱乐。"}]}],"synonyms":["cultural appropriation","stereotyping","romanticization"],"phonetic":"/ˈpaʊ.waʊ.ɪz.əm/","extraExplanation":["这个词比较少见，通常带有批评意味。\n\n“Powwow”在当代常指北美原住民的聚会（含歌舞、鼓乐、社交与仪式元素），不同部族与不同场合的意义并不相同。\n\n在讨论“powwowism”时，常涉及“文化挪用（cultural appropriation）”：把他者文化符号当作装饰或噱头使用，却忽略其语境、历史与当事社群的感受。若要参与或报道powwow，更合适的做法是尊重主办方规则、了解背景、避免把传统简化成刻板印象。"]}
{"word":"powwows","summary":{"en":"Powwows are meetings—either informal planning talks or traditional Native American cultural gatherings.","zh":"Powwows 指“会议/碰头会”，也可指北美原住民的传统文化聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meeting or gathering for discussion, planning, or decision-making (informal)","zh":"（非正式）商议会；讨论/筹划的会议"},"examples":[{"en":"Let’s have a quick powwow after lunch to plan the presentation.","zh":"午饭后我们开个简短的碰头会，规划一下演示。"},{"en":"The team held a powwow to decide who would handle customer support.","zh":"团队开了个小会，决定由谁负责客服支持。"}]},{"partOfSpeech":"n.","definition":{"en":"a Native American gathering that often includes singing, dancing, drumming, and cultural ceremonies","zh":"（北美原住民的）传统聚会（常含歌舞、击鼓与文化仪式）"},"examples":[{"en":"We attended a powwow to learn about local Indigenous traditions.","zh":"我们参加了一场原住民传统聚会，了解当地的原住民文化。"},{"en":"Powwows can include grand entry, dancing competitions, and drum groups.","zh":"传统聚会可能包括盛大入场、舞蹈比赛和鼓队表演。"}]},{"partOfSpeech":"v.","definition":{"en":"to meet and talk informally, usually for planning or solving a problem","zh":"（非正式）碰头商量；开个小会"},"examples":[{"en":"We should powwow tomorrow morning about the budget.","zh":"我们明早应该碰头聊聊预算。"},{"en":"The editors powwowed to agree on the final headline.","zh":"编辑们碰头商量，确定最终标题。"}]}],"synonyms":["meeting","huddle","conference","gathering","sit-down"],"phonetic":"/ˈpaʊˌwaʊ/","extraExplanation":["“powwow”一词源自北美原住民语言（常被追溯到阿尔冈昆语族相关词形），原意与“治病的仪式/灵性领袖”有关，后来在英语中扩展为“聚会”。","在日常英语里把 powwow 用作“碰头会”很常见，但它来自原住民文化语境；在正式或跨文化场合，建议用 meeting / huddle / check-in 等更中性词，以避免让人觉得在借用或淡化原住民传统。"]}

