{"word":"poz","summary":{"en":"“poz” most commonly means HIV-positive (slang/shorthand).","zh":"“poz”最常见的意思是HIV阳性（俚语/简写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, especially in LGBTQ+ and health contexts) HIV-positive; having the HIV virus.","zh":"（俚语，常见于LGBTQ+与健康语境）HIV阳性；感染了HIV病毒。"},"examples":[{"en":"He disclosed that he’s poz and is taking medication.","zh":"他坦白自己是poz（HIV阳性），并在服药治疗。"},{"en":"Some support groups are specifically for poz people.","zh":"有些互助小组是专门为poz（HIV阳性）人士设立的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal shorthand) “positive,” usually in test results or status labels (less common than the HIV-related use).","zh":"（非正式缩写）“阳性/积极的”，多见于检测结果或状态标签（但不如“HIV阳性”的用法常见）。"},"examples":[{"en":"The chart marked the sample as poz.","zh":"图表把样本标为poz（阳性）。"}]}],"synonyms":["HIV-positive","positive (test result)","POZ"],"phonetic":"/pɑz/","extraExplanation":["“poz”常写作大写“POZ”，在英语里最常指“HIV-positive”。这是一个带有身份与健康含义的词，使用时要注意语境与尊重当事人：不要随意给别人贴标签；在医疗或自我认同语境中可中性使用，但在玩笑或贬义语境中可能造成伤害。","在一些社群中，“poz/POZ”也用于自我认同与倡议（例如“POZ community”），强调去污名化与可治疗、可检测（如U=U：Undetectable = Untransmittable，病毒载量检测不到=几乎不具传染性）等公共卫生信息。"]}
{"word":"Poznan","summary":{"en":"Poznań is a major city in Poland (often written “Poznan” in English).","zh":"Poznań（英语常写作 Poznan）是波兰的一座重要城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in west-central Poland, known for its history, universities, international trade fairs, and as one of the country’s important economic and cultural centers.","zh":"波兰中西部的重要城市，以悠久历史、大学教育、国际贸易展会闻名，也是波兰重要的经济与文化中心之一。"},"examples":[{"en":"I’m traveling to Poznań for a conference next week.","zh":"我下周要去波兹南参加会议。"},{"en":"Poznań is often mentioned as one of Poland’s oldest cities.","zh":"波兹南常被提到是波兰最古老的城市之一。"}]}],"synonyms":["Poznan"],"phonetic":"/ˈpoʊz.nɑn/","extraExplanation":["“Poznań”中“ń”是波兰语字母，发音接近英语里带轻微“y”音的 /n/（类似“ny”）。英语里常写作“Poznan”（不带变音符）以方便输入。","英语中常见读法是重音在第一音节（POHZ-nahn）。在波兰语中重音通常落在倒数第二个音节，因此当地读法会与英语略有差别。"]}
{"word":"pozzolan","summary":{"en":"A volcanic-ash-type material used with lime/cement to make concrete stronger and more durable.","zh":"一种类似火山灰的材料，可与石灰/水泥反应，提高混凝土强度与耐久性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural or artificial volcanic-ash-like material (usually containing silica and alumina) that reacts with lime and water to form a cement-like binder, often used to make stronger or more durable concrete.","zh":"火山灰质材料（天然或人工，常含二氧化硅与氧化铝），能与石灰和水发生反应形成类似水泥的胶结物，常用于制备更坚固或更耐久的混凝土。"},"examples":[{"en":"Roman builders mixed pozzolan with lime to create concrete that could set underwater.","zh":"罗马建筑者把火山灰掺入石灰中，制成甚至能在水下凝结的混凝土。"},{"en":"Adding pozzolan can reduce cracking and improve long-term strength in concrete.","zh":"在混凝土中加入火山灰质材料可以减少开裂并提升长期强度。"}]}],"synonyms":["volcanic ash (contextual)","cementitious additive (broad)","SCM (supplementary cementitious material, broad)"],"phonetic":"/ˈpɑt͡soʊlən/","extraExplanation":["“pozzolan”一词源自意大利地名 Pozzuoli（波佐利），古罗马时期当地火山灰（pulvis Puteolanus）因能与石灰反应而闻名，被广泛用于港口、防波堤等海工建筑。","现代工程里，“pozzolan”常与“supplementary cementitious materials (SCMs) / 掺合料”相关联，常见例子包括粉煤灰（fly ash）、硅灰（silica fume）、偏高岭土（metakaolin）等。"]}
{"word":"pozzolana","summary":{"en":"A volcanic-ash material used with lime/cement to make stronger, water-resistant concrete.","zh":"与石灰/水泥配合使用、可增强并提高抗水性的火山灰质材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A volcanic ash or pumice-rich material that reacts with lime in the presence of water to form a cement-like binder; used to make hydraulic cement and concrete.","zh":"一种火山灰或富含浮石的材料，能在有水时与石灰发生反应形成胶凝物；用于制造水硬性水泥与混凝土。"},"examples":[{"en":"The engineer specified pozzolana to improve the durability of the concrete in seawater.","zh":"工程师指定使用火山灰材料（pozzolana），以提高混凝土在海水中的耐久性。"},{"en":"Traditional lime mortar becomes stronger when mixed with pozzolana.","zh":"传统石灰砂浆加入火山灰材料后会变得更坚固。"},{"en":"Some eco-cements replace part of Portland cement with pozzolana to reduce carbon emissions.","zh":"一些环保水泥用火山灰材料替代部分波特兰水泥，以降低碳排放。"}]}],"synonyms":["pozzolan","volcanic ash","hydraulic additive"],"phonetic":"/ˌpɑt͡soʊˈlɑnə/","extraExplanation":["词源与文化背景：pozzolana（也拼作pozzolan）源自意大利那不勒斯附近的波佐利（Pozzuoli）。古罗马人广泛使用当地火山灰与石灰拌合，制造能在水下硬化的“罗马混凝土”，对港口、桥梁、穹顶等工程影响深远。","学习提示：在材料与土木工程语境中，你也会看到“pozzolanic reaction（火山灰反应）”“pozzolanic material（火山灰质材料）”。常见天然或人工的pozzolans包括火山灰、硅灰、粉煤灰、煅烧黏土等。"]}
{"word":"pozzolanic","summary":{"en":"“Pozzolanic” describes materials that react with lime and water to form cement-like compounds, improving concrete performance.","zh":"“Pozzolanic”指能与石灰和水反应生成胶凝物质、从而改善混凝土性能的火山灰质材料相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to materials (like volcanic ash or certain industrial byproducts) that react with lime and water to form cement-like compounds, making concrete stronger and more durable.","zh":"指（如火山灰或某些工业副产物等）能与石灰和水发生反应生成类似水泥的胶凝物质，从而使混凝土更坚固、更耐久的；火山灰质的。"},"examples":[{"en":"Pozzolanic materials can improve concrete’s long-term strength.","zh":"火山灰质材料可以提高混凝土的长期强度。"},{"en":"Fly ash is often used as a pozzolanic additive in cement.","zh":"粉煤灰常被用作水泥中的火山灰质掺合料。"},{"en":"Engineers chose a pozzolanic binder to reduce cracking and heat buildup.","zh":"工程师选择了火山灰质胶凝材料，以减少开裂并降低水化热积累。"}]}],"synonyms":["cementitious","reactive (in cement)","hydraulic (related, not identical)"],"phonetic":"/ˌpɑtsoʊˈlænɪk/","extraExplanation":["“pozzolanic”来自意大利波佐利（Pozzuoli），古罗马时期当地火山灰被用来制造能在水下硬化的砂浆与混凝土（如港口与穹顶建筑）。因此该词常见于土木工程、材料科学与建筑语境。","常见“pozzolanic materials（火山灰质材料）”包括：天然火山灰、煅烧黏土/偏高岭土（metakaolin）、粉煤灰（fly ash）、硅灰（silica fume）、粒化高炉矿渣（有时也被归入更广义的补充胶凝材料SCMs）。在环保语境下，它们也常用于部分替代熟料以降低水泥碳排放。"]}
{"word":"pozzolans","summary":{"en":"Pozzolans are materials (often volcanic ash) used with lime/cement to improve concrete strength and durability.","zh":"Pozzolans 指与石灰/水泥一起使用、能提升混凝土强度与耐久性的材料（常为火山灰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural or artificial material (often volcanic ash) that reacts with lime and water to form cement-like compounds, used to make stronger, more durable concrete.","zh":"一种天然或人造材料（常见为火山灰），能与石灰和水发生反应生成类似水泥的胶结物，用来制成更坚固、更耐久的混凝土。"},"examples":[{"en":"Roman builders used pozzolans to make concrete that could survive in seawater.","zh":"罗马建筑者使用火山灰材料（pozzolans）来制作能在海水中长期耐久的混凝土。"},{"en":"Adding pozzolans can reduce cracking and improve the long-term strength of cement.","zh":"加入火山灰材料可以减少开裂，并提高水泥的长期强度。"}]}],"synonyms":["pozzolanic material","volcanic ash (in this context)","supplementary cementitious materials (SCMs)"],"phonetic":"/pɑtˈsoʊlənz/","extraExplanation":["“Pozzolan”一词来自意大利那不勒斯附近的波佐利（Pozzuoli），当地火山灰在古罗马时期被广泛用于建筑，因此得名。","在工程语境里，pozzolans 常包括火山灰、粉煤灰（fly ash）、硅灰（silica fume）等；它们与氢氧化钙反应生成更稳定的胶结产物，从而提升耐久性。"]}
{"word":"pozzuolana","summary":{"en":"Pozzuolana is volcanic ash used as a cement-like material, especially in durable mortar and Roman concrete.","zh":"Pozzuolana 指用于砂浆与混凝土的火山灰掺合料，常与坚固耐久的古罗马混凝土相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic ash (a natural “pozzolan”) that reacts with lime and water to form a cement-like material; used to make strong mortar and concrete, especially in Roman-style construction","zh":"火山灰（天然“火山灰质材料/火山灰掺合料”）：与石灰和水发生反应形成类似水泥的胶结物，用于制作坚固的砂浆和混凝土（常与古罗马建筑相关）"},"examples":[{"en":"Roman builders used pozzuolana to make concrete that could set underwater.","zh":"古罗马建造者用 pozzuolana 制作能在水下凝固的混凝土。"},{"en":"The restoration team matched the original mortar by adding a small amount of pozzuolana.","zh":"修复团队加入少量 pozzuolana 来配出与原砂浆相近的配方。"}]}],"synonyms":["pozzolan","volcanic ash","natural pozzolan","puzzolana"],"phonetic":"/ˌpɑt.suˈɑː.nə/","extraExplanation":["“Pozzuolana”来自意大利语 pozzolana，源于意大利那不勒斯附近的波佐利（Pozzuoli）地区，那里的火山灰在古代非常有名。","在材料学里，pozzuolana 属于“pozzolan（火山灰质材料）”的一种：它本身不一定像水泥那样“自硬”，但会与石灰（lime）发生火山灰反应，生成更耐久的胶结产物，因此常被用于提高混凝土的强度与耐久性。","常见拼写也有：pozzolana（更常见）与 pozzuolana（较少见但可见于历史/技术文本）。"]}
{"word":"pozzuolanic","summary":{"en":"“Pozzolanic” describes materials (like volcanic ash or fly ash) that react with lime and water to form cement-like binders, improving concrete.","zh":"“pozzolanic”指具有火山灰活性的材料（如火山灰、粉煤灰等），能与石灰和水反应形成胶凝物质，从而改善混凝土性能。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a material) able to react with lime and water to form cement-like compounds; used to improve concrete or mortar.","zh":"（材料）具有火山灰活性；能与石灰和水反应生成类似水泥的化合物，用于改善混凝土或砂浆性能。"},"examples":[{"en":"Pozzolanic materials can make concrete stronger over time.","zh":"火山灰活性材料能让混凝土随着时间推移变得更坚固。"},{"en":"The mix includes pozzolanic ash to reduce cracking and improve durability.","zh":"配方中加入火山灰以减少开裂并提高耐久性。"},{"en":"Engineers chose a pozzolanic additive to lower the heat of hydration in mass concrete.","zh":"工程师选择火山灰活性掺合料，以降低大体积混凝土的水化热。"}]}],"synonyms":["cementitious (in context)","reactive (with lime)","volcanic-ash (related)"],"phonetic":"ˌpɑtsoʊˈlænɪk","extraExplanation":["“pozzolanic”来自意大利地名 Pozzuoli（波佐利）附近的火山灰“pozzolana”。古罗马人常用这种火山灰与石灰配合，制造出耐久性很高的“罗马混凝土”，一些港口与建筑遗迹至今仍保存良好。","在现代工程语境里，常见的“pozzolanic materials（火山灰质材料）”包括粉煤灰（fly ash）、硅灰（silica fume）、火山灰（volcanic ash）等；它们通常用于提高长期强度、抗渗与耐久性，并减少水泥用量。"]}
{"word":"pozzy","summary":{"en":"“Pozzy” is informal slang meaning either a place/position or a positive, upbeat attitude, depending on context.","zh":"“pozzy”是非正式俚语，可指“位置/地点”，也可指“积极正向的心态”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A position or place; someone’s spot or location.","zh":"（非正式/俚语）位置、地点；某人的“位子/所在”"},"examples":[{"en":"Let’s meet at my pozzy after class.","zh":"下课后我们在我那儿（我的位置/地点）见。"},{"en":"Save me a pozzy near the front.","zh":"帮我在前面留个座/留个位置。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, slang) Positive; optimistic; having good vibes.","zh":"（非正式/俚语）积极的；正向的；氛围很好的"},"examples":[{"en":"Try to stay pozzy about the interview.","zh":"尽量对面试保持积极。"},{"en":"She’s really pozzy even on tough days.","zh":"就算日子很难，她也很正向。"}]}],"synonyms":["position","spot","place","location","positive","upbeat","optimistic"],"phonetic":"/ˈpɑzi/","extraExplanation":["“pozzy”多见于口语和网络用语，带有地区色彩（如英式/澳新英语圈更常见）。正式写作中通常用“position/place”或“positive”。","语境判断很重要：如果前后提到地点/座位，多半是“位置”；如果在谈心态、情绪、氛围，多半是“积极/正向”。"]}

