{"word":"ppa","summary":{"en":"PPA most commonly means “Power Purchase Agreement,” but it can also refer to a photography association or a medical condition depending on context.","zh":"PPA最常见指“购电协议（Power Purchase Agreement）”，也可能指摄影行业组织或一种医学疾病，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Acronym) Power Purchase Agreement: a long-term contract where a buyer agrees to purchase electricity from a power producer, often used for renewable energy projects.","zh":"（缩写）购电协议：买方与发电方签订的长期合同，约定购买电力，常用于可再生能源项目。"},"examples":[{"en":"The company signed a 15-year PPA to buy solar power at a fixed price.","zh":"这家公司签署了一份15年的购电协议（PPA），以固定价格购买太阳能电力。"},{"en":"A PPA can help a wind farm secure stable revenue.","zh":"购电协议（PPA）可以帮助风电场获得稳定收入。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym) Professional Photographers of America: a U.S. organization that supports photographers with education, certifications, and industry resources.","zh":"（缩写）美国职业摄影师协会：美国的摄影行业组织，提供培训、认证与行业资源支持。"},"examples":[{"en":"She joined PPA to take business workshops for photographers.","zh":"她加入了PPA，参加面向摄影师的商业课程。"},{"en":"PPA offers certifications that can strengthen a photographer’s portfolio.","zh":"PPA提供的认证可以增强摄影师的作品集竞争力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym, medicine) Primary Progressive Aphasia: a neurological condition that causes a gradual loss of language abilities.","zh":"（缩写，医学）原发性进行性失语症：一种神经系统疾病，会导致语言能力逐渐下降。"},"examples":[{"en":"The neurologist explained that PPA mainly affects speech and word-finding.","zh":"神经科医生解释说，PPA主要影响说话能力和找词能力。"},{"en":"Supportive therapy can help people with PPA communicate more comfortably.","zh":"支持性治疗可以帮助PPA患者更顺畅地交流。"}]}],"synonyms":["(Power Purchase Agreement) electricity supply contract","(Power Purchase Agreement) energy offtake agreement"],"phonetic":"/ˌpiː piː ˈeɪ/","extraExplanation":["“PPA”是首字母缩写词，常见于专业语境（能源、行业组织、医学）。在英文写作中通常大写；口语里常按字母逐个读（P-P-A）。","如果你是在某个具体场景里看到“PPA”（比如合同、医疗报告或社交媒体），告诉我上下文，我可以帮你确认最可能的含义。"]}
{"word":"ppan","summary":{"en":"“ppan” is an informal romanized Korean word meaning “bread” (more commonly spelled “ppang”).","zh":"“ppan”通常是韩语“빵”的非正式罗马字写法，意思是“面包”（更常见拼写为“ppang”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(loanword, informal) A romanization of Korean “빵” (ppang), meaning bread; used in Korean food contexts online.","zh":"（外来词，非正式）韩语“빵”（常见拼写为 ppang）的罗马字写法，意思是“面包”；多见于韩食语境或网络用语。"},"examples":[{"en":"I bought some fresh ppang from a bakery in Seoul.","zh":"我在首尔的一家面包店买了些新鲜的 ppang（面包）。"},{"en":"This café is famous for its garlic ppang.","zh":"这家咖啡馆以蒜香 ppang（面包）出名。"}]}],"synonyms":["bread","ppang"],"phonetic":"/pɑŋ/","extraExplanation":["“ppan”在英语里不是常见标准拼写，更常见的是“ppang”。其中“pp-”表示韩语的紧音（更用力、较短促的 p 声），结尾的“-ng”对应鼻音“ㅇ”。如果你是在菜单或社交媒体上看到“ppan”，通常就是在指韩式面包或某种面包点心。"]}
{"word":"ppe","summary":{"en":"PPE most commonly means personal protective equipment—gear worn to keep you safe from hazards.","zh":"PPE最常指个人防护装备——用于防止危险伤害的安全防护用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Personal protective equipment: special clothing or tools (like masks, gloves, helmets) worn to protect the body from injury, infection, or other hazards.","zh":"个人防护装备：为保护身体免受受伤、感染或其他危险而穿戴的特殊衣物或工具（如口罩、手套、安全帽等）。"},"examples":[{"en":"Hospital staff must wear PPE such as masks, gloves, and gowns.","zh":"医院工作人员必须穿戴PPE，例如口罩、手套和隔离衣。"},{"en":"Always check your PPE before entering the lab.","zh":"进入实验室前一定要检查你的PPE。"},{"en":"Construction workers need PPE to prevent eye and head injuries.","zh":"建筑工人需要PPE来预防眼部和头部受伤。"}]}],"synonyms":["protective gear","safety equipment","protective equipment"],"phonetic":"/ˌpiː piː ˈiː/","extraExplanation":["PPE通常读作字母音“P-P-E”，在工作安全、医疗和实验室环境里非常常见。","疫情期间（如COVID-19）媒体中频繁出现PPE，常指口罩、面罩、防护服、手套等防感染用品。","英语里常说“wear PPE”（穿戴防护装备）或“provide PPE”（提供防护装备）。"]}
{"word":"ppeculiar","summary":{"en":"Peculiar means “strange/unusual” or “specific to a particular person/place/thing.”","zh":"peculiar 可指“奇怪/不寻常”，也可指“某人/某地/某事物所特有的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange or unusual; different from what is normal or expected.","zh":"奇怪的；不寻常的；与常态不同的。"},"examples":[{"en":"There was a peculiar smell coming from the kitchen.","zh":"厨房里飘来一股奇怪的味道。"},{"en":"It’s peculiar that he left without saying goodbye.","zh":"他不告而别，这很奇怪。"}]},{"partOfSpeech":"adj.","definition":{"en":"Belonging to one person, group, place, or thing; specific to them.","zh":"特有的；某人/某地/某事物所特有的。"},"examples":[{"en":"This kind of bird is peculiar to this island.","zh":"这种鸟是这座岛屿特有的。"},{"en":"Each family has its own peculiar traditions.","zh":"每个家庭都有自己特有的传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person) having unusual habits or qualities.","zh":"（指人）有点古怪的；有特殊习惯或特质的。"},"examples":[{"en":"My uncle is a little peculiar, but he’s very kind.","zh":"我叔叔有点古怪，但人很善良。"}]}],"synonyms":["strange","unusual","odd","weird","distinctive","unique","specific"],"phonetic":"/pɪˈkjuːljɚ/","extraExplanation":["你输入的 **ppeculiar** 多半是拼写错误，正确拼写是 **peculiar**。","**peculiar** 有两种很常见的用法：① 表示“奇怪的/反常的”（a peculiar feeling/smell）；② 表示“……所特有的”（be peculiar to…）。第二种用法在写作中更正式。","语气提醒：形容人 **peculiar** 往往带有“有点怪”的含义，比 **unique**（独特的，偏褒义）更容易显得不太客气；若想更中性，可用 **unusual** 或 **quirky**。"]}
{"word":"ppel","summary":{"en":"“ppel” is not a standard English word; it’s likely a misspelling (often of “apple”).","zh":"“ppel”不是标准英语单词；很可能是拼写错误（常见是“apple”的误拼）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a typing/spelling mistake (commonly for “apple”).","zh":"不是标准英语单词。它通常是打字或拼写错误（常见为把“apple”打错）。"},"examples":[{"en":"I can’t find “ppel” in an English dictionary—did you mean “apple”?","zh":"我在英语词典里找不到“ppel”——你是不是想写“apple”？"},{"en":"If you meant “apple,” the spelling is A-P-P-L-E.","zh":"如果你想写“apple”，拼写是 A-P-P-L-E。"}]}],"extraExplanation":["“ppel”常见原因是把单词首字母漏掉（例如把 apple 的 a 漏了），或是键盘输入顺序出错。","如果你想查的是缩写（例如某个课程/机构/文件名的 PPEL），告诉我它出现的上下文句子，我可以按语境帮你解释。"]}
