{"word":"prebachelor","summary":{"en":"Prebachelor refers to something before a bachelor’s degree, especially preparatory courses or pathway programs.","zh":"Prebachelor 指学士学位之前的阶段，尤其是本科前的预科或衔接课程/项目。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to studies, status, or programs that happen before earning a bachelor’s degree (undergraduate level)","zh":"与获得学士学位之前的学习、身份或项目有关的（本科前/学士前）"},"examples":[{"en":"She took some prebachelor courses to improve her academic English before starting her bachelor’s program.","zh":"她在开始本科学位课程前，先修了一些本科前课程来提高学术英语。"},{"en":"The university offers prebachelor pathways for international students who don’t yet meet entry requirements.","zh":"这所大学为尚未达到入学要求的国际学生提供本科前衔接项目。"}]},{"partOfSpeech":"n.","definition":{"en":"a preparatory program or stage before a bachelor’s degree (often used in university admissions and pathway contexts)","zh":"本科前的预科/阶段（常用于大学申请与衔接项目语境）"},"examples":[{"en":"He enrolled in a prebachelor to qualify for the engineering bachelor’s degree.","zh":"他报名了本科前预科，以达到工程学本科的入学资格。"}]}],"synonyms":["pre-bachelor","bachelor’s preparatory","foundation (program/year)","pathway program","undergraduate preparatory"],"phonetic":"/ˌpriːˈbætʃələr/","extraExplanation":["“prebachelor”不是最标准、最常见的拼写形式，更常见的是加连字符的“pre-bachelor”，或直接说“pre-bachelor program / pathway / preparatory program”。在不同国家/学校里，它可能对应“预科”“桥梁课程（pathway）”“基础课程（foundation program）”等。","在正式写作里，建议用更明确的说法：例如“pre-bachelor program (foundation year)”或“undergraduate preparatory program”，以免读者不清楚具体指哪种项目。"]}
{"word":"prebacillary","summary":{"en":"Prebacillary means “before bacilli are present or detectable,” especially in medical descriptions of early infection.","zh":"prebacillary 指“杆菌尚未出现或尚不可检出之前的”，常用于描述感染的早期阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Occurring before bacilli (rod-shaped bacteria) are present or detectable; relating to an early stage of an infection before bacteria can be found in tests.","zh":"（医学）在杆菌（杆状细菌）出现或可被检测到之前发生的；指感染早期、检测尚未发现细菌的阶段。"},"examples":[{"en":"In the prebacillary stage, symptoms may appear even though lab tests are still negative.","zh":"在前杆菌期，可能已经出现症状，但化验结果仍可能为阴性。"},{"en":"Researchers studied prebacillary tuberculosis to understand how infection begins before bacilli are detectable.","zh":"研究人员研究结核病的前杆菌期，以了解在检测到杆菌之前感染是如何开始的。"}]}],"synonyms":["pre-bacillary","early-stage","prodromal (in some contexts)"],"phonetic":"/ˌpriːbəˈsɪləri/","extraExplanation":["该词多见于医学/传染病学语境，常用于描述“临床上已有表现，但细菌学证据尚未检出”的早期阶段。","构词：pre-（在……之前）+ bacillary（与杆菌有关的）。在专业写作中也常见连字符形式 pre-bacillary。","不要与 paucibacillary（少菌型，细菌数量很少但仍可检出）混淆：prebacillary 强调“尚未检出/尚未出现”，paucibacillary 强调“数量少”。"]}
{"word":"prebade","summary":{"en":"“Prebade” is an archaic past-tense form meaning “forbade in advance.”","zh":"“prebade”是古体用法，意思是“事先禁止/预先告诫（过去时）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) past tense of “prebid,” meaning to forbid or warn against something in advance.","zh":"（古体）“prebid”的过去式，表示“事先禁止；预先告诫不要做某事”。"},"examples":[{"en":"The rules prebade any visitor from entering the sanctuary.","zh":"规则事先禁止任何访客进入圣所。"},{"en":"He prebade them to speak of the plan until morning.","zh":"他预先告诫他们在早晨之前不要谈论这个计划。"}]}],"synonyms":["forbade","prohibited","barred","warned against"],"phonetic":"/ˌpriːˈbeɪd/","extraExplanation":["“prebade”在现代英语里几乎不用，读到它通常是在较旧的文学作品、宗教/法律文体或仿古写作中。现代英语更常用的表达是：forbade（过去式）/ had forbidden / warned against / prohibited。","词形上可以理解为 pre-（预先）+ bade（bid 的过去式，表示“命令/要求”）。因此整体含义就是“提前下令禁止”。"]}
{"word":"prebake","summary":{"en":"Prebake means to bake something partly or ahead of time so it can be finished or reheated later.","zh":"Prebake 指先把食物预烤到半熟或提前烤好，之后再完成烘烤或复热。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bake something partly (not fully) so it can be finished later, often for convenience or better texture","zh":"把食物先烤到半熟（未完全烤熟），之后再烤完；常为省时或改善口感"},"examples":[{"en":"We prebake the pizza crust for 5 minutes so it stays crisp after adding toppings.","zh":"我们先把披萨饼底预烤5分钟，这样加上配料后也能保持酥脆。"},{"en":"The recipe says to prebake the pie crust before adding the filling.","zh":"食谱说要先预烤派皮，再加入馅料。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bake ahead of time (before the final serving time)","zh":"提前烤好（在正式食用/上桌之前先烤）"},"examples":[{"en":"You can prebake the rolls in the morning and warm them up for dinner.","zh":"你可以早上把面包卷先烤好，晚餐前再加热。"}]}],"synonyms":["parbake","partially bake","pre-cook (broader)"],"phonetic":"/ˌpriːˈbeɪk/","extraExplanation":["“pre-”表示“在……之前”，所以 prebake 字面意思是“先烤”。烹饪里常见的对应词有 preheat（预热烤箱）和 parboil（先煮到半熟）。","在烘焙语境里，prebake 常与 pie crust（派皮）、tart shell（挞皮）、pizza crust（披萨饼底）一起出现；中文里也常说“预烤”“先烤”“烤到半熟”。"]}
{"word":"prebalance","summary":{"en":"“Prebalance” means to balance or adjust something beforehand.","zh":"“prebalance”指“预先使……达到平衡/先行调整”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to balance or adjust something in advance, before final measurement, assembly, or use (often in technical or accounting contexts).","zh":"在最终测量、组装或使用之前，先行把某物调平、校准或使其达到平衡（常见于技术或会计语境）。"},"examples":[{"en":"Engineers prebalance the rotor to reduce vibration during testing.","zh":"工程师会先对转子做预平衡，以减少测试时的振动。"},{"en":"The team prebalanced the budget categories before the final review.","zh":"团队在最终审查前先把各项预算类别做了预平衡调整。"}]}],"synonyms":["pre-balance","balance beforehand","pre-adjust","precalibrate"],"phonetic":"/ˌpriːˈbæləns/","extraExplanation":["“prebalance”不是非常常见的标准词汇，更常见的写法是带连字符的“pre-balance”，或用更具体的动词如“pre-adjust / calibrate / balance beforehand”。在正式写作中，如果不是行业术语，建议改用这些更常见的表达，以免读者困惑。"]}
{"word":"prebalanced","summary":{"en":"Prebalanced describes something already set to the right balance or proportions ahead of time.","zh":"prebalanced 指某物在使用前就已提前调好平衡或比例。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"balanced in advance; already adjusted so that parts are in the right proportion before being used or sold.","zh":"预先配平的；事先调整好比例/平衡的（在使用或出售前就已处理好）。"},"examples":[{"en":"The meal plan uses prebalanced portions of protein, carbs, and vegetables.","zh":"这个餐食计划使用预先配平的蛋白质、碳水和蔬菜份量。"},{"en":"Some audio interfaces come with prebalanced input levels for beginners.","zh":"有些音频接口为新手提供预先配平的输入电平。"}]}],"synonyms":["pre-set","pre-adjusted","pre-mixed","already balanced","balanced beforehand"],"phonetic":"/ˌpriːˈbælənst/","extraExplanation":["“prebalanced”常见于产品说明或技术/商业语境，表示厂家或系统已经提前把各部分“调到合适的比例”。例如：营养补充剂里的配方（宏量营养素比例）、音频设备的输入/输出电平或左右声道平衡、投资组合/基金的预设资产配置比例等。","构词法：pre-（提前）+ balanced（平衡的）。日常口语里更常说“already balanced / pre-set / pre-mixed / pre-adjusted”。"]}
{"word":"prebalancing","summary":{"en":"Prebalancing means adjusting investments ahead of a planned rebalance, often to manage costs and risk.","zh":"Prebalancing 指在计划再平衡之前提前调整投资，以管理成本与风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of adjusting a portfolio or account *before* an official or scheduled rebalancing happens (often to prepare for known changes such as index updates, cash flows, or risk targets)","zh":"在正式或预定的再平衡之前，先对投资组合或账户进行调整的行为（常为提前应对指数调整、资金进出或风险目标）"},"examples":[{"en":"The fund started prebalancing ahead of the index reconstitution to reduce trading costs.","zh":"该基金在指数重编之前开始预平衡，以降低交易成本。"},{"en":"Prebalancing can help smooth large price moves when many investors rebalance on the same day.","zh":"预平衡可以帮助缓解很多投资者在同一天再平衡时造成的大幅价格波动。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) to adjust holdings in advance so the portfolio is closer to its target allocation or constraints","zh":"（现在分词）提前调整持仓，使投资组合更接近目标配置或满足约束条件"},"examples":[{"en":"They are prebalancing the bond positions because rates may change before month-end.","zh":"他们正在提前调整债券仓位，因为月底前利率可能变化。"},{"en":"The manager was prebalancing to keep the stock-to-cash ratio within limits.","zh":"经理在做预平衡，以把股票与现金比例控制在限制范围内。"}]}],"synonyms":["rebalance early","rebalance in advance","pre-rebalance","position ahead of a rebalance"],"phonetic":"/ˌpriːˈbælən(s)ɪŋ/","extraExplanation":["“Prebalancing”在金融语境里更常见，尤其与指数基金/ETF有关：当市场预期某些股票会被纳入或剔除指数时，机构可能提前调整仓位，以减少在“官方生效日”集中交易带来的冲击成本与滑点。","它不是一个非常通用的日常词，更像行业用语；在普通表达中也可用“rebalance early / rebalance in advance（提前再平衡）”来说明。"]}
{"word":"preballot","summary":{"en":"Preballot means “before voting,” describing actions or the period leading up to a ballot.","zh":"preballot 指“投票前的”，用于描述投票开始前的活动或阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a ballot (vote) is cast; done in the period leading up to an election or voting process.","zh":"在投票之前发生的；投票前阶段进行的（选举或表决前）。"},"examples":[{"en":"The campaign team focused on preballot outreach to undecided voters.","zh":"竞选团队把重点放在投票前对未决定选民的动员上。"},{"en":"Preballot surveys suggested the measure would pass.","zh":"投票前的民调显示该提案可能会通过。"}]},{"partOfSpeech":"n.","definition":{"en":"The time or stage before a ballot; the period leading up to voting.","zh":"投票前阶段；投票前的时期。"},"examples":[{"en":"During the preballot, both sides held public meetings.","zh":"在投票前阶段，双方都举行了公众会议。"},{"en":"They raised concerns about fairness in the preballot process.","zh":"他们对投票前程序的公平性提出了担忧。"}]}],"synonyms":["pre-election","pre-vote","before the ballot","prior to voting"],"phonetic":"/ˌpriˈbælət/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。“preballot”多见于政治、公共政策公投、工会或协会选举等语境，用来强调“正式投票开始之前”的宣传、拉票、程序与规则（例如资格审核、候选人登记、信息发放等）。","在一些工会/劳动关系语境里，你可能会看到“preballot meeting（投票前会议）”“preballot notice（投票前通知）”“preballot campaign（投票前宣传/竞选）”等搭配，用于描述投票开始前的规定动作与沟通环节。"]}
{"word":"preballoted","summary":{"en":"Preballoted means decided by a prior ballot (a vote held in advance).","zh":"preballoted 指“已通过事先投票决定的（预先表决过的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already decided or chosen in advance by a vote (a ballot), before a later meeting or official vote.","zh":"在之后的会议或正式投票之前，已通过投票（投票表决）预先决定或选定的。"},"examples":[{"en":"The union’s preballoted strike action could begin as early as next week.","zh":"工会已预先投票通过的罢工行动最早可能下周开始。"},{"en":"Only preballoted candidates were allowed onto the final list.","zh":"只有已预先投票选出的候选人才能进入最终名单。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “preballot”: to hold a ballot in advance to decide something before a later stage.","zh":"“preballot”的过去式：在后续阶段之前先行进行投票表决。"},"examples":[{"en":"Members preballoted on the proposal before the conference.","zh":"成员们在大会前先对该提案进行了预先投票。"}]}],"synonyms":["pre-approved","voted in advance","previously balloted","preselected"],"phonetic":"/ˌpriˈbælətɪd/","extraExplanation":["“preballoted”通常写作带连字符的 pre-balloted，更常见于英式英语、工会与组织治理语境（例如对罢工行动进行预先投票以满足程序要求）。","词源结构：pre-（预先）+ ballot（投票）+ -ed（过去式/过去分词）。在美式英语中，类似含义更常用 voted in advance / approved by a prior vote。"]}
{"word":"preballoting","summary":{"en":"Preballoting means the preparation or preliminary process before an official vote (ballot).","zh":"Preballoting 指正式投票（选举）前的准备或预先筛选流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of preparing for a ballot (vote), especially by deciding who will be on the ballot or by organizing rules and procedures before the actual vote","zh":"投票前的准备程序（预投票流程），尤其指在正式投票前决定候选人名单或安排投票规则与步骤"},"examples":[{"en":"The party began preballoting to narrow the list of candidates before the final vote.","zh":"该政党开始进行预投票流程，在最终投票前缩小候选人名单。"},{"en":"Preballoting meetings focused on eligibility rules and how the ballot would be counted.","zh":"预投票会议主要讨论资格规则以及如何计票。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done before a ballot (vote)","zh":"在投票前发生的；投票前进行的"},"examples":[{"en":"They held a preballoting discussion to address concerns from members.","zh":"他们举行了投票前讨论，回应成员的担忧。"},{"en":"Preballoting checks helped prevent mistakes on the final ballot.","zh":"投票前核查有助于避免最终选票出错。"}]}],"synonyms":["pre-vote process","preliminary ballot process","pre-ballot screening"],"phonetic":"/ˌpriːˈbælətɪŋ/","extraExplanation":["“preballoting”多见于政治、工会或组织选举语境（尤其英式英语/新闻报道中），强调“正式投票之前的筛选与组织”。在一些政党候选人提名中，可能会先用内部程序筛掉部分人，再进入最终投票。","构词上是“pre-（在……之前）+ balloting（投票）”。更常见的写法有“pre-balloting”（加连字符），具体取决于媒体或机构的风格指南。"]}
{"word":"prebankruptcy","summary":{"en":"Prebankruptcy describes the period or actions before an official bankruptcy filing or bankruptcy status.","zh":"prebankruptcy 指正式破产或申请破产保护之前的阶段或相关行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or existing before a person or company officially becomes bankrupt or files for bankruptcy","zh":"（在个人或公司）正式破产或申请破产保护之前的；破产前的"},"examples":[{"en":"The company tried to renegotiate its debt in a prebankruptcy agreement.","zh":"公司试图在破产前协议中重新协商债务。"},{"en":"Prebankruptcy planning can include cutting costs and selling nonessential assets.","zh":"破产前规划可能包括削减成本和出售非核心资产。"},{"en":"Workers feared layoffs during the prebankruptcy period.","zh":"员工在破产前阶段担心裁员。"}]},{"partOfSpeech":"n.","definition":{"en":"the time or situation before bankruptcy occurs (less common)","zh":"破产发生之前的阶段或情形（较少见）"},"examples":[{"en":"In prebankruptcy, lenders often demand stricter terms.","zh":"在破产前阶段，放贷方往往会要求更严格的条件。"}]}],"synonyms":["pre-bankruptcy","before bankruptcy","pre-insolvency"],"phonetic":"/ˌpriˌbæŋkˈrʌptsi/","extraExplanation":["“Prebankruptcy”常见于商业与法律语境，尤其是讨论公司在申请破产（如美国的 Chapter 11 重整或 Chapter 7 清算）之前采取的措施，例如债务重组、与债权人谈判、出售资产等。","书写上也常见作 “pre-bankruptcy”（加连字符），两者含义相同；正式写作中加连字符更常见。"]}
{"word":"prebaptismal","summary":{"en":"Prebaptismal means “before baptism,” especially describing preparation or events that happen prior to being baptized.","zh":"prebaptismal 指“受洗前的”，常用于描述受洗之前的准备或相关事项。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time or events before a person is baptized.","zh":"与受洗之前的时期或事件有关的；受洗前的。"},"examples":[{"en":"The church offers prebaptismal classes for parents and godparents.","zh":"教会为父母和教父母提供受洗前课程。"},{"en":"They discussed the prebaptismal preparation required for new members.","zh":"他们讨论了新成员需要完成的受洗前准备。"}]}],"synonyms":["before baptism","pre-baptism"],"phonetic":"/ˌpriˌbæpˈtɪzməl/","extraExplanation":["词形结构：pre-（在……之前）+ baptism（洗礼、受洗）+ -al（形容词后缀）。","常见语境多在基督宗教（尤其天主教、东正教、圣公会及部分新教传统）中，指受洗前的教理学习、面谈、仪式准备等；不同教派对“受洗前准备”的要求与形式可能差异很大。","在学术或历史写作中，prebaptismal 也可用于讨论早期教会的入教流程（如慕道期 catechumenate）以及相关礼仪实践。"]}
{"word":"prebaptize","summary":{"en":"Prebaptize means to baptize someone beforehand; it can also mean to “prepare/condition” someone in advance in a figurative way.","zh":"prebaptize 指“提前为某人施洗”，也可作比喻，指“事先使某人接受某种观念或习惯”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to baptize (someone) in advance or before a later event (for example, before official admission to a church)","zh":"（在之后某个正式仪式或事件之前）提前为（某人）施洗/行洗礼"},"examples":[{"en":"In some historical records, infants were prebaptized at home when illness made a church ceremony risky.","zh":"在一些历史记载中，如果婴儿病情不稳、去教堂有风险，家中会先行“提前施洗”。"},{"en":"The group required members to be prebaptized before attending the main service.","zh":"该团体要求成员在参加主礼拜之前先“提前受洗”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to condition or “initiate” someone beforehand into a set of beliefs or habits","zh":"（比喻）事先让某人接受某套观念/习惯的灌输或“预先入门”"},"examples":[{"en":"The training course prebaptized new employees into the company’s culture.","zh":"这门培训课让新员工预先“入门”公司的文化。"},{"en":"He felt the textbooks were trying to prebaptize students into one political viewpoint.","zh":"他觉得这些教材在试图把学生预先灌输到一种政治立场里。"}]}],"synonyms":["baptize beforehand","baptize in advance","initiate","indoctrinate","condition"],"phonetic":"/ˌpriˈbæp.taɪz/","extraExplanation":["这个词非常少见，多出现在宗教史/教会实践的讨论里，或在写作中用作比喻（强调“在正式加入前就先被塑造/归化”）。","构词：pre-（在……之前）+ baptize（施洗）。如果你想表达更常见的意思，日常英语通常会用 “baptize early / baptize beforehand”，比喻义可用 “indoctrinate / condition / initiate”。"]}
{"word":"prebarbaric","summary":{"en":"Prebarbaric means “before the barbaric stage,” often used to mean very early or prehistoric.","zh":"prebarbaric 指“在所谓野蛮阶段之前”，常用来表示非常早期或史前的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to a time before a society is considered “barbaric”; very early, primitive, or prehistoric.","zh":"（罕见）指在被认为“野蛮/未开化”之前的时期；非常早期的、原始的或史前的。"},"examples":[{"en":"The museum displays tools from a prebarbaric period of human history.","zh":"博物馆展出了人类史前早期（“前野蛮时期”）的工具。"},{"en":"Some writers use “prebarbaric” to describe myths from humanity’s earliest stages.","zh":"有些作者用 prebarbaric 来形容人类最早阶段的神话。"}]}],"synonyms":["prehistoric","primitive","primeval","early","ancient"],"phonetic":"/ˌpriːbɑrˈbærɪk/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ barbaric（“野蛮的/未开化的”）构成，但在现代英语里非常少见，多出现在人类学、考古学或文学化的写作中。","注意：barbaric 在历史语境中常带有“以文明中心为标准的评价”，可能隐含文化偏见；更中性的表达常用 prehistoric（史前的）、early human（早期人类的）、preliterate（文字出现前的）。"]}
{"word":"prebarbarically","summary":{"en":"“Prebarbarically” means “in a pre-barbaric (very early or primitive) way,” and it’s a rare, mainly academic/older term.","zh":"“prebarbarically”意为“以野蛮之前（更早期、极原始）阶段的方式”，较少见，多用于学术或较旧语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that belongs to a time or stage before something is considered “barbaric” (often used when describing early or very primitive societies or conditions).","zh":"以属于“野蛮”之前阶段的方式；指在被认为“野蛮”之前的时代或发展阶段（常用于描述更早期、非常原始的社会或状态）。"},"examples":[{"en":"The author describes the tribe’s tools as prebarbarically simple.","zh":"作者把这个部落的工具形容为“野蛮之前阶段”那种极其简单。"},{"en":"In older anthropology books, cultures were sometimes ranked as prebarbarically organized—a view we now treat with caution.","zh":"在较早期的人类学著作里，文化有时会被排成“野蛮之前阶段的组织形态”——这种看法今天我们会更谨慎对待。"}]}],"synonyms":["primitively","prehistorically","rudimentarily","in an early stage"],"phonetic":"/ˌpriˌbɑrˈbɛrɪkli/","extraExplanation":["这个词很少见，多见于较旧的历史学/人类学/文学批评语境，用来表达“比barbaric（野蛮的）还早、更原始的阶段”。构词为 pre-（在……之前）+ barbaric（野蛮的）+ -ally（副词后缀）。","在现代写作里，把社会“分等级”称为civilized / barbaric / prebarbaric 之类，容易带有价值判断或文化偏见；学术写作通常会改用更中性的说法，例如 early / prehistoric / pre-state / non-literate 等（视语境而定）。"]}
{"word":"prebarbarous","summary":{"en":"Prebarbarous means “before the barbarous stage,” or (rhetorically) extremely primitive and uncivilized.","zh":"prebarbarous 指“野蛮时代之前的”，也可修辞性地表示“极其原始、不文明的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing before a society or culture is considered “barbarous”; referring to a very early stage of human life, history, or culture (often used in anthropology or older writing).","zh":"（多用于人类学或较旧的写作）指“野蛮时代”之前的；形容人类生活、历史或文化处于更早期阶段的。"},"examples":[{"en":"Some early scholars used the term prebarbarous to describe the earliest human tools and shelters.","zh":"一些早期学者用 prebarbarous 来描述人类最早的工具和住所。"},{"en":"The book traces society from a prebarbarous stage to organized communities.","zh":"这本书追溯社会从 prebarbarous 的阶段发展到有组织的共同体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely crude or primitive; even “more” uncivilized than barbarous (a rhetorical, often critical use).","zh":"（修辞、批评用法）极其粗糙、原始；甚至比“野蛮的”还要更不文明的。"},"examples":[{"en":"He called the conditions in the camp prebarbarous, lacking even basic sanitation.","zh":"他称营地的条件为 prebarbarous，连最基本的卫生都没有。"},{"en":"The reviewer attacked the film’s prebarbarous violence.","zh":"影评人抨击这部电影里“prebarbarous”的暴力描写。"}]}],"synonyms":["prehistoric","primitive","primeval","uncivilized","crude"],"phonetic":"/ˌpriːˈbɑːr.bə.rəs/","extraExplanation":["prebarbarous 由前缀 pre-（“在……之前”）+ barbarous（“野蛮的”）构成，含义通常是时间上的“更早于野蛮阶段”。在19世纪一些“社会进化阶段”理论（如把社会分成“蒙昧/野蛮/文明”等阶段）的语境中更常见；现代学术写作中较少使用，因为这类分期带有价值判断。","如果你想表达“史前/早期人类”的中性说法，现代英语里更常用 prehistoric（史前的）、early human（早期人类的）、preliterate（无文字时期的）等。"]}
{"word":"prebarbarously","summary":{"en":"“Prebarbarously” (rare) means “in a pre-barbarous, very early/primitive way.”","zh":"“prebarbarously”（罕见）表示“以前野蛮/前文明、非常早期原始的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that belongs to a time or condition before something is considered “barbarous” or uncivilized; in an early, pre-civilized manner (rare/academic usage).","zh":"以“野蛮化”之前的方式；带有早期、前文明（前野蛮）状态的方式（罕见/学术用法）。"},"examples":[{"en":"The author imagines humans living prebarbarously, before settled laws and cities existed.","zh":"作者想象人类生活在前野蛮状态下，在稳定的法律和城市出现之前。"},{"en":"Some early tools were used prebarbarously, long before organized societies formed.","zh":"一些早期工具在前文明时期就被使用了，远早于有组织社会的形成。"}]}],"synonyms":["primitively","uncivilizedly","in a pre-civilized way","in an early/primitive manner"],"phonetic":"/ˌpriːˈbɑːrbərəsli/","extraExplanation":["“pre-”表示“在……之前”。“barbarous”常指“野蛮的、粗野的、缺乏文明教养的”。因此“prebarbarously”多见于讨论历史阶段、文明演进的写作中，用来强调“比被称为野蛮的阶段更早”。","这个词非常少见；更常见的表达是“in a primitive way（以原始的方式）”、“in a pre-civilized way（以前文明的方式）”或“before civilization（在文明出现之前）”。"]}
{"word":"prebarbarousness","summary":{"en":"Prebarbarousness means an extremely early, primitive stage of society or culture—before “barbarism.”","zh":"prebarbarousness 指社会或文化极早期、原始的阶段，被描述为“野蛮”之前的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being pre-barbarous; a very early, primitive stage of society or culture (before what might be called “barbarism”)","zh":"前野蛮状态；指社会或文化在被称为“野蛮”之前的更早、更原始阶段"},"examples":[{"en":"The author describes the tribe’s prebarbarousness as a time when tools were simple and traditions were just forming.","zh":"作者把这个部落的前野蛮状态描写为工具简陋、传统刚刚形成的时期。"},{"en":"In the essay, prebarbarousness is used to contrast with later urban life and written law.","zh":"在这篇文章里，“前野蛮状态”用来与后来的城市生活和成文法律形成对比。"}]}],"synonyms":["primitiveness","early civilization","pre-civilization","rudimentary state"],"phonetic":"/ˌpriːˈbɑːrbərəsnəs/","extraExplanation":["这个词非常罕见，多见于较旧的学术/散文语境。结构是 pre-（在……之前）+ barbarous（野蛮的）+ -ness（……的状态），字面意思就是“在野蛮之前的状态”。","语气上常带有评判色彩：用“barbarous/野蛮”来划分社会阶段在现代写作中可能显得不够中立；较中性的表达可用 early/primitive stage（早期/原始阶段）或 pre-literate society（前文字社会）等。"]}
{"word":"prebargain","summary":{"en":"“Prebargain” means to negotiate or agree on terms in advance.","zh":"“prebargain”表示在事前就把价格或条件谈判、议定好。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bargain or negotiate in advance (before a later decision, purchase, or agreement)","zh":"预先讨价还价；事先谈判价格或条件"},"examples":[{"en":"We prebargained the price with the supplier before placing the large order.","zh":"我们在下大订单前先和供应商预先谈好了价格。"},{"en":"If you prebargain, you may avoid awkward discussions at the last minute.","zh":"如果你事先谈好条件，就能避免临时尴尬地讨论价格。"}]},{"partOfSpeech":"adj.","definition":{"en":"agreed on in advance by bargaining or negotiation","zh":"（通过协商）事先谈妥的；预先议定的"},"examples":[{"en":"They signed a contract with a prebargained rate for overtime pay.","zh":"他们签了合同，加班费按事先谈妥的费率计算。"},{"en":"A prebargained deal can protect both sides from sudden price changes.","zh":"预先谈妥的交易能保护双方免受突然的价格变化影响。"}]}],"synonyms":["pre-negotiate","bargain beforehand","negotiate in advance","agree in advance"],"phonetic":"/ˌpriːˈbɑrɡən/","extraExplanation":["“prebargain”在现代英语中不算常见，更常见的表达是“negotiate in advance / bargain beforehand / pre-negotiate”。在写作中常见带连字符的形式“pre-bargain”，更清晰易读。","这种词更可能出现在商业、合同或劳资协商（collective bargaining）语境里，用来强调“在正式签约或行动之前就把关键条件谈定”。"]}
{"word":"prebasal","summary":{"en":"Prebasal means “in front of or just before the base,” mainly used in scientific descriptions.","zh":"prebasal 指“在基部之前/靠近基部前方”，主要用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Biology) Located in front of or before the base of a structure; situated just ahead of the basal (base) part.","zh":"（解剖/生物）位于某结构的基部之前、在基部前方；紧靠基部前面的。"},"examples":[{"en":"In some insects, a small prebasal segment connects the main part of the appendage to its base.","zh":"在一些昆虫中，一个很小的基前节把附肢的主体与其基部连接起来。"},{"en":"The paper describes prebasal bristles near the base of the wing.","zh":"论文描述了靠近翅基部附近的基前刚毛。"}]}],"synonyms":["anterior basal","before the base"],"phonetic":"/ˌpriːˈbeɪsəl/","extraExplanation":["“pre-”表示“在……之前/前方”，“basal”表示“基部的”。因此 prebasal 常见于生物学、昆虫学、植物形态学等专业语境，用来精确描述相对位置（在基部前面），日常英语中很少使用。","与之相对的常见相关词：basal（基部的）、postbasal（基部之后的/基后）。"]}
{"word":"prebasilar","summary":{"en":"A medical adjective meaning “in front of the basilar region (especially the basilar artery).”","zh":"医学形容词，指“位于基底区/基底动脉前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in front of (anterior to) the basilar artery or the base of the skull; used mainly in medical/anatomical contexts.","zh":"（解剖/医学用语）位于基底动脉或颅底的前方；多用于描述位置。"},"examples":[{"en":"The report noted a small prebasilar lesion on the MRI.","zh":"报告指出核磁共振上有一个小的基底动脉前方病灶。"},{"en":"Prebasilar anatomy is important when planning surgery near the brainstem.","zh":"在规划脑干附近的手术时，了解基底动脉前方的解剖结构很重要。"}]}],"synonyms":["anterior basilar (region)","ventral to the basilar artery"],"phonetic":"/ˌpriːˈbeɪsɪlər/","extraExplanation":["“pre-”表示“在……之前/前方”， “basilar”常与“basilar artery（基底动脉）”相关。基底动脉位于脑干前方，是供应脑部的重要血管，因此“prebasilar”常见于影像学（CT/MRI）或神经外科描述中，用来精确定位病灶或结构。"]}
{"word":"prebattle","summary":{"en":"Prebattle means “before a battle,” usually describing preparation or events that happen in advance.","zh":"prebattle 指“战前的”，常用于描述战斗开始前的准备或相关活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a battle (often used to describe planning, meetings, speeches, or preparation).","zh":"战前的；在战斗开始之前进行的（常用于描述计划、会议、讲话或准备工作）。"},"examples":[{"en":"The commanders held a prebattle meeting to review the plan.","zh":"指挥官们召开了战前会议来复盘作战计划。"},{"en":"Prebattle preparations included checking supplies and treating the wounded.","zh":"战前准备包括检查物资和救治伤员。"}]}],"synonyms":["prewar","before the battle","pre-fight"],"phonetic":"/ˌpriːˈbæt̬əl/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”（如 prewar 战前的，preseason 季前的）。因此 prebattle 通常写作一个词或连字符形式 pre-battle，多见于军事历史、游戏、体育类的“对战/赛前”语境。","在非军事语境里，battle 也可引申为“斗争/挑战”，所以 prebattle 也可能用于比喻：指“面对艰难挑战前的准备”。"]}
{"word":"prebble","summary":{"en":"“Prebble” is mainly used as a surname (a family name).","zh":"“Prebble”主要用作姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), found especially in New Zealand and the UK/Scotland.","zh":"（姓氏）普雷布尔；常见于新西兰以及英国/苏格兰等地的家族姓。"},"examples":[{"en":"Richard Prebble was a well-known New Zealand politician.","zh":"Richard Prebble 是一位知名的新西兰政治人物。"},{"en":"The book was written by John Prebble.","zh":"这本书由 John Prebble 所著。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈprɛbəl/","extraExplanation":["“Prebble”通常作为专有名词（姓氏）使用，不是常见的英语词汇。读音上多按拼写规律读作 /ˈprɛbəl/，中间的 -bb- 发短促的 /b/ 音，结尾 -le 常弱读成 /-əl/。","有些姓氏来自古老的职业、地名或家族称呼，但“Prebble”的具体词源在日常词典里不一定会单独标注；更常见的学习价值在于：把它当作人名/姓氏识别与正确读音。"]}
{"word":"prebeleve","summary":{"en":"“Prebelieve” is a rare, nonstandard verb meaning “to believe ahead of time.”","zh":"“prebelieve” 是少见且不太标准的动词，意思是“预先相信”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/rare) to believe in advance; to accept something as true before having full evidence.","zh":"（非标准/少见用法）预先相信；在证据不足前就先认定为真。"},"examples":[{"en":"Try not to prebelieve the rumor before you check the facts.","zh":"在核实事实之前，尽量不要先相信那个传言。"},{"en":"Some readers prebelieve the ending after seeing spoilers online.","zh":"有些读者在网上看到剧透后，会先入为主地相信结局。"}]}],"synonyms":["assume","presume","prejudge"],"phonetic":"/ˌpriːbəˈliːv/","extraExplanation":["“prebeleve” 很可能是拼写错误；更接近的拼法是 **prebelieve**（但它在现代英语里非常少见、也不算标准词）。","日常表达里，更自然的选择通常是：**assume**（以为/假设）、**presume**（推定）、**prejudge**（预判/先入为主地判断）、**jump to conclusions**（草率下结论）、**take it for granted**（想当然）。","如果你想表达“以前相信过”，英语更常说 **used to believe** 或 **previously believed**，而不是 prebelieve。"]}
{"word":"prebelief","summary":{"en":"A prebelief is a belief you hold beforehand, especially one that shapes how you interpret new information.","zh":"prebelief 指你事先持有的信念，尤其会影响你如何解读新信息的那种先入为主的看法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief you already have before you get new information or evidence; a prior assumption.","zh":"在获得新信息或证据之前就已经持有的信念；先入为主的看法。"},"examples":[{"en":"We all bring prebeliefs to a discussion, so it helps to state them openly.","zh":"我们在讨论时都会带着一些预设信念，所以把它们说清楚会更有帮助。"},{"en":"Her prebelief that the test would be difficult made her nervous.","zh":"她先入为主地认为考试会很难，这让她很紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"(Academic/philosophy) A prior belief used as a starting point for reasoning or for updating beliefs when new evidence appears.","zh":"（学术/哲学）作为推理起点的先验信念；用于在出现新证据时更新判断的“先前信念”。"},"examples":[{"en":"In Bayesian thinking, you start with a prebelief and then update it with data.","zh":"在贝叶斯思维中，你先有一个先前信念，然后用数据来更新它。"},{"en":"The argument challenges our prebelief that money always brings happiness.","zh":"这个论证挑战了我们“钱总能带来幸福”的先前信念。"}]}],"synonyms":["prior belief","preconception","assumption","presupposition","bias"],"phonetic":"/ˌpriːbəˈlif/","extraExplanation":["“prebelief”不是日常英语里的高频词，更常见的表达是“prior belief”“preconception”“assumption”或“presupposition”。在学术语境（尤其是统计/心理学/哲学）里，和“Bayesian prior（先验）”的概念接近。","构词：pre-（在……之前）+ belief（信念）。写作时如果面向大众读者，通常用更常见的“preconception/assumption”会更自然。"]}
{"word":"prebelieve","summary":{"en":"Prebelieve means to believe something in advance, before evidence or experience.","zh":"prebelieve 指在证据或经历之前就预先相信某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to believe (something) in advance, before having full evidence or experience; to assume beforehand","zh":"在充分证据或亲身经历之前就相信（某事）；预先相信、先入为主地认为"},"examples":[{"en":"Some readers prebelieve the ending because they’ve seen spoilers.","zh":"有些读者因为看过剧透，就会预先相信结局会是什么。"},{"en":"Try not to prebelieve rumors before you check the facts.","zh":"在核实事实之前，尽量不要先入为主地相信传言。"}]}],"synonyms":["presume","assume","prejudge","preconceive"],"phonetic":"/ˌpriːbəˈliːv/","extraExplanation":["“prebelieve”不是常见的标准词，多见于个人造词、文学/修辞语境或少量网络用法。日常英语更常用“believe beforehand / assume / presume / prejudge”。","构词上由前缀“pre-”（在……之前）+“believe”（相信）组成，语气常带一点提醒：别在证据不足时就先相信。"]}
{"word":"prebelieved","summary":{"en":"“Prebelieved” is a rare word meaning “believed beforehand,” often better expressed as “believed in advance” or “already believed.”","zh":"“prebelieved”很少用，意思是“事先就相信了（未经核实）”，通常可用“believed in advance / already believed”等更自然的表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of a rare verb) to have believed something beforehand, before getting proof or direct experience.","zh":"（罕见动词的过去式/过去分词）在获得证据或亲身经历之前就先相信某事。"},"examples":[{"en":"She had prebelieved the rumor, so the correction felt surprising.","zh":"她先入为主地相信了那个谣言，所以后来的澄清让她很意外。"},{"en":"The committee prebelieved the claim and didn’t check the data carefully.","zh":"委员会先就相信了这个说法，没有认真核对数据。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, rare) believed in advance; accepted as true before verification.","zh":"（形容词，罕见）预先相信的；在核实之前就当作真的。"},"examples":[{"en":"Their prebelieved assumptions shaped the whole discussion.","zh":"他们那些“预先相信”的假设影响了整场讨论。"},{"en":"Try to separate prebelieved ideas from what the evidence actually shows.","zh":"尽量把先入为主的想法和证据真正显示的内容分开。"}]}],"synonyms":["believed beforehand","believed in advance","already believed","assumed"],"phonetic":"/ˌpriːbəˈliːvd/","extraExplanation":["“prebelieved / prebelieve”在现代英语里非常少见，很多读者会觉得不自然或不规范。更常见的表达有：“believed beforehand / believed in advance / already believed / assumed”。","如果你想表达“先入为主地相信”，也可以用更地道的说法：“took it for granted（想当然）”“jumped to conclusions（仓促下结论）”“was predisposed to believe（倾向于相信）”。"]}
{"word":"prebeliever","summary":{"en":"A prebeliever is someone who does not yet believe in a religion, often implying they may believe in the future.","zh":"prebeliever 指尚未信仰某宗教的人，常含“未来可能成为信徒”的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not yet believe in a religion (often used for someone who may become a believer later); a “not-yet believer.”","zh":"（尚未）信徒；尚未信仰某宗教的人（常指未来可能成为信徒的人）。"},"examples":[{"en":"The church welcomed visitors and called them prebelievers rather than outsiders.","zh":"这间教会欢迎来访者，并称他们为“prebelievers”，而不是“外人”。"},{"en":"He described his friends as prebelievers because they were curious about faith but not ready to commit.","zh":"他把朋友们称为“prebelievers”，因为他们对信仰好奇，但还没准备好投入。"}]}],"synonyms":["nonbeliever","unbeliever","seeker","spiritual seeker"],"phonetic":"/ˌpriːbəˈliːvɚ/","extraExplanation":["“prebeliever”不是非常常见的标准词，更常见于部分基督教社群/传福音语境，用来以较温和、积极的方式称呼“尚未信主的人”（有时也会用“seekers / spiritual seekers”）。在正式写作里，更中性的表达通常是“nonbeliever”或“unbeliever”（但语气可能更直接）。","构词很好理解：pre-（在……之前）+ believer（信徒）。因此它带有“目前还不是，但可能会成为”的含义。"]}
{"word":"prebelieving","summary":{"en":"Prebelieving means “before believing,” usually in religious contexts.","zh":"prebelieving 意为“相信之前”，多用于宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) describing a time or state before someone starts to believe in something (often used in religious writing to mean “before faith” or “before conversion”).","zh":"（罕见）形容某人在开始相信某事之前的阶段或状态（常见于宗教语境，指“信仰之前/归信之前”）。"},"examples":[{"en":"In his prebelieving years, he was curious about religion but not committed to any faith.","zh":"在他尚未信教的那些年里，他对宗教很好奇，但并未投入任何信仰。"},{"en":"The counselor asked her to describe her prebelieving experience and what changed later.","zh":"辅导员请她描述自己信之前的经历，以及后来发生了什么变化。"}]}],"synonyms":["before believing","prior to belief","pre-conversion","unbelieving (context-dependent)"],"phonetic":"/ˌpriːbəˈliːvɪŋ/","extraExplanation":["“prebelieving”不是常见词，更常见的写法是带连字符的“pre-believing”，或直接说“before believing / prior to belief”。","该词多见于神学、见证（testimony）或宗教心理研究中，用来对比“believing / post-conversion（归信后）”。"]}
{"word":"prebellum","summary":{"en":"“Prebellum” means “before a war,” especially the period before the U.S. Civil War.","zh":"“prebellum”意为“战前的”，尤指美国南北战争之前的时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before a war, especially (in U.S. history) the period before the American Civil War.","zh":"战前的；（尤指美国历史中）南北战争之前那段时期的。"},"examples":[{"en":"The novel is set in the prebellum South.","zh":"这部小说以南北战争前的美国南方为背景。"},{"en":"Prebellum politics were shaped by debates over slavery and states’ rights.","zh":"战前政治深受关于奴隶制与州权的争论影响。"}]}],"synonyms":["antebellum","prewar"],"phonetic":"/ˌpriːˈbɛləm/","extraExplanation":["“Prebellum”来自拉丁语：pre-（在……之前）+ bellum（战争）。在美国语境里，它最常指1861年南北战争爆发之前的时期；在其他语境中也可泛指“某场战争之前”。","在历史与文化讨论中，prebellum 常与“prebellum South（战前南方）”“prebellum plantation life（战前种植园生活）”等搭配出现。使用时要注意：一些作品会浪漫化战前南方生活，但那一时期同时包含奴隶制等严重的不公正现实。"]}
{"word":"prebeloved","summary":{"en":"“Prebeloved” means ‘once beloved’—loved in the past, often with a literary or poetic tone.","zh":"“prebeloved”意为“曾经被深爱/曾经钟爱”，带有文学或诗意的语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loved in the past; once dear or cherished (but not necessarily now).","zh":"过去曾被爱过的；曾经珍爱/钟爱的（现在未必仍然如此）。"},"examples":[{"en":"She found a box of letters from a prebeloved friend she hadn’t spoken to in years.","zh":"她找到一盒彩信，是一位多年未联系、曾经很亲近的朋友写的。"},{"en":"The novel follows a man haunted by memories of his prebeloved wife.","zh":"这部小说讲述一名男子被对已故（或已失去联系的）昔日挚爱妻子的回忆所困扰。"}]}],"synonyms":["formerly beloved","once-beloved","once loved","one-time beloved","former love"],"phonetic":"/ˌpriːbɪˈlʌvɪd/","extraExplanation":["“prebeloved”不是日常英语常用词，更常见的表达是“formerly beloved / once-beloved / a former love”。它常见于文学、诗歌或较有文风的写作，用来强调“曾经被深深爱过”的时间感与情绪层次。","构词上可理解为“pre-（先前）+ beloved（被爱的）”。注意：它通常描述“过去的挚爱/旧爱/昔日珍爱之物”，并不自动表示现在已不爱了，但常带有“物是人非”的暗示。"]}
{"word":"prebend","summary":{"en":"A prebend is a church-related stipend (and sometimes the income source behind it), especially connected with cathedral clergy.","zh":"prebend 指教会中（常与主教座堂圣职人员相关的）俸禄/津贴，也可指提供该俸禄的收入来源或财产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in some Christian churches) a salary or stipend paid to a clergyperson from church funds, often linked to duties at a cathedral or collegiate church.","zh":"（某些基督教教会中）圣职人员的俸禄/津贴，通常来自教会基金，并常与在主教座堂或学院教堂的职务相关。"},"examples":[{"en":"After he was appointed to the cathedral, he received a prebend to support his work.","zh":"他被任命到主教座堂后，获得了一份俸禄来支持他的工作。"},{"en":"The document lists the prebends assigned to each canon.","zh":"文件列出了分配给每位教士（座堂参事）的俸禄。"}]},{"partOfSpeech":"n.","definition":{"en":"The source of income or property that provides that church stipend (for example, land or endowments set aside for it).","zh":"用于提供该俸禄的收入来源或财产（例如专门划拨的土地或捐赠基金）。"},"examples":[{"en":"Historically, some prebends were funded by rents from church-owned land.","zh":"历史上，有些俸禄来自教会土地的租金收入。"},{"en":"A dispute arose over who controlled the prebend’s revenues.","zh":"关于谁来管理该俸禄收入发生了争议。"}]}],"synonyms":["stipend","salary","endowment","benefice (related)"],"phonetic":"/ˈpriːbɛnd/","extraExplanation":["“prebend”主要用于英国等地的历史与教会语境，常见于讨论中世纪或近代教会体制（如cathedral、canon等）。现代日常英语里很少用到。","词源来自拉丁语praebenda，意为“供给、配给的食物/给养”，后来引申为“供养圣职人员的收入”。"]}
{"word":"prebendal","summary":{"en":"Prebendal means “connected with a church prebend”—a stipend or income given to a clergy member.","zh":"prebendal 指“与教会俸禄（prebend）有关的”，常用来形容教会职务或收入来源。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prebend (an income or stipend given to a church official, traditionally from church lands or endowments).","zh":"与“教会俸禄/教会圣职俸给”（prebend）有关的；指由教会土地或基金等提供给教会圣职人员的收入或津贴。"},"examples":[{"en":"He held a prebendal post at the cathedral and received a regular stipend.","zh":"他在主教座堂担任带有教会俸禄的职务，并领取固定津贴。"},{"en":"The document lists several prebendal revenues attached to the chapter.","zh":"文件列出了隶属于教堂参事会的几项教会俸禄收入。"}]}],"synonyms":["clerical","ecclesiastical"],"phonetic":"/prɪˈbɛn.dəl/","extraExplanation":["“prebendal”常见于宗教史、教会制度与中世纪英国等语境，描述与prebend制度相关的职位、收入或权利。","词根来自拉丁语praebenda，原意与“供给/配给”有关；在教会语境中逐渐专指供养教士的收入来源。","相关词：prebend（教会俸禄/俸给）、prebendary（领取prebend的教士/教堂参事）。在阅读历史或文学作品时，这类词往往带有制度性与阶层意味。"]}
{"word":"prebendaries","summary":{"en":"Prebendaries are clergy members who receive a prebend (fixed church income), especially in a cathedral or collegiate church.","zh":"prebendaries 指领取圣俸（固定教会收入）的教士成员，尤指在主教座堂或学院教堂任职者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of prebendary: a member of a cathedral or collegiate church clergy who receives a fixed income (a prebend) for their position.","zh":"prebendary 的复数：指在主教座堂或学院教堂中担任职务、并因该职务领取固定俸禄（prebend，圣职俸禄/圣俸）的教士成员。"},"examples":[{"en":"In the novel, the prebendaries argue over who should manage the cathedral’s funds.","zh":"在小说里，这些领圣俸的教士为谁该管理教堂资金而争论。"},{"en":"Several prebendaries attended the special service at the cathedral.","zh":"几位领圣俸的教士成员出席了主教座堂的特别礼拜。"}]}],"synonyms":["canons (often related, but not always identical)","cathedral clergy","church officials"],"phonetic":"/ˈprɛbənˌdɛriz/","extraExplanation":["“prebendary / prebendaries”主要出现在英国教会（尤其是英格兰教会）等历史语境中，带有明显的宗教与制度色彩。现代日常英语里不常用，更多见于历史、宗教研究、古典小说或关于教会组织的写作中。","“prebend”原指分配给教会神职人员的一份收入来源（可能来自土地租金、什一税等），因此“prebendary”强调的是“因某个教会职位而享有固定收入的人”。"]}
{"word":"prebendary","summary":{"en":"A Church of England clergyperson who holds a cathedral/church post and receives a prebend (church income).","zh":"指英格兰教会中在大教堂/教堂担任带俸职务并领取“prebend（教会俸禄）”的神职人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clergyperson (usually in the Church of England) who is a member of a cathedral or collegiate church chapter and receives income called a prebend for their role.","zh":"（通常指英格兰教会的）受俸牧师／座堂参事：在大教堂或学院教堂的教务会（chapter）中担任成员，并因该职务领取称为“prebend（教会俸禄）”的收入。"},"examples":[{"en":"The prebendary attended the cathedral chapter meeting every month.","zh":"这位受俸牧师每个月都会参加大教堂教务会会议。"},{"en":"In the novel, a prebendary appears as a minor character in the cathedral town.","zh":"在小说中，一位受俸牧师作为小角色出现在那座主教座堂小镇里。"}]}],"synonyms":["canon (often related but not identical)","cathedral clergyman","church dignitary"],"phonetic":"/prɪˈbɛn.də.ri/","extraExplanation":["“prebendary”来自“prebend（教会俸禄）”。在英国教会传统中，cathedral（大教堂）通常有一个管理与礼拜相关事务的“chapter（教务会/参事会）”，成员可能包括dean（座堂主任牧师）、canons（参事）等；prebendary是其中一种带俸禄的职位。","在现代日常英语中这个词较少见，多出现在英国历史、宗教制度、文学作品（尤其以教会生活为背景的小说）或正式介绍教会职衔的语境里。","相关词：canon（参事）、prebend（教会俸禄）、chapter（教务会/参事会）、cathedral（大教堂）、clergy（神职人员）。"]}
{"word":"prebendaryship","summary":{"en":"A church office/position held by a prebendary, typically involving income from a cathedral or collegiate church.","zh":"参事（有俸禄教士）的职位/职务，通常与大教堂或学院教会的固定收入有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The position or office of a prebendary (a member of clergy who receives income from a cathedral or collegiate church).","zh":"（教会）有俸禄的参事（prebendary）的职位；参事职。"},"examples":[{"en":"He held a prebendaryship at the cathedral and attended chapter meetings.","zh":"他在那座大教堂担任参事职，并参加教士会议。"},{"en":"The novel mentions a prebendaryship as a mark of church status and steady income.","zh":"小说里提到参事职，象征教会地位与稳定收入。"}]}],"synonyms":["prebend","prebendary office","ecclesiastical benefice"],"phonetic":"/prɪˈbɛndəriˌʃɪp/","extraExplanation":["“prebendaryship”来自“prebendary”（领受prebend教会俸禄的教士）+ “-ship”（表示身份、职位、状态）。","在英国国教与部分欧洲教会传统中，prebend 指由教会地产或捐赠产生的收益，用来供养特定教士；因此 prebendaryship 常带有“有固定教会收入的教会职位”这一社会含义。","阅读历史或文学作品时，这个词常用于描写教会体系中的等级、任命与经济来源（例如与“benefice / living / canonry”等概念一起出现）。"]}
{"word":"prebendate","summary":{"en":"A prebendate is a church official (like a prebendary) who receives a prebend—an income or endowment attached to duties at a cathedral or similar church body.","zh":"prebendate 指领取教会圣职俸禄（prebend）的教士（类似 prebendary），多见于历史或教会制度语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a cathedral or collegiate church who receives a salary or income (a prebend) for their duties; a prebendary","zh":"（大教堂或教会团体的）受俸牧师／领取“圣职俸禄（prebend）”的教士；相当于 prebendary"},"examples":[{"en":"In the medieval records, he is listed as a prebendate of the cathedral chapter.","zh":"在中世纪的档案里，他被列为该主教座堂会（cathedral chapter）的受俸教士。"},{"en":"The prebendate’s income came from land given to support the church.","zh":"这位受俸教士的收入来自用于资助教会的土地。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the income, salary, or church endowment (prebend) attached to such a position","zh":"（较少用）与该职位相关的俸禄／收入／教会赐产（即 prebend）"},"examples":[{"en":"The document describes the prebendate granted to the cleric.","zh":"文件描述了授予该教士的圣职俸禄（prebend）。"}]}],"synonyms":["prebendary","canon (in some contexts)","church benefice holder"],"phonetic":"/ˈpriːbənˌdeɪt/","extraExplanation":["这个词在现代英语里很少见，多用于历史、宗教史或英国教会制度语境。更常见、也更容易在书里见到的同义词是 prebendary。","prebend 指“教会为支持教士而提供的固定收入/地产来源”；prebendate（人）就是“领这份收入的教士”。"]}
{"word":"prebends","summary":{"en":"“Prebends” are church incomes (or the posts) that support clergy, especially in a cathedral system.","zh":"“Prebends”指教会（尤指主教座堂体系）给予神职人员的固定俸给/收益，或指带这种俸给的圣职职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Regular income or land given by a church (especially a cathedral) to support a member of the clergy, such as a canon.","zh":"（尤指主教座堂等教会）给神职人员（如教士/法政牧师 canon）的固定俸给或收益（可能来自土地或基金）。"},"examples":[{"en":"In medieval Europe, some priests lived on prebends provided by the cathedral.","zh":"在中世纪欧洲，一些神职人员依靠主教座堂提供的圣职俸给（prebends）生活。"},{"en":"The document lists several prebends assigned to different canons.","zh":"文件列出了分配给不同教士的多项圣职俸给（prebends）。"}]},{"partOfSpeech":"n.","definition":{"en":"The church position (benefice) that comes with such income; a prebendal post.","zh":"带有上述俸给的圣职职位（圣俸/圣职俸给所附的职务）。"},"examples":[{"en":"He was appointed to a prebend at the cathedral and moved to the city.","zh":"他被任命到主教座堂的一个圣俸职位（prebend），于是搬到城里。"}]}],"synonyms":["benefices","stipends","ecclesiastical incomes","canonries"],"phonetic":"/ˈpriːbɛndz/","extraExplanation":["“prebends”是复数形式，单数是“prebend”。这个词多见于历史、宗教史、文学或教会制度相关的语境，日常英语里并不常用。","在英国国教、天主教等传统中，prebend常与cathedral（主教座堂）、canon（座堂教士/法政牧师）等制度相连，表示“供养某个教会职务的固定收入/俸给”，也可指“带俸给的职位本身”。"]}
{"word":"prebenediction","summary":{"en":"A short prayer or blessing said before the final benediction.","zh":"终祷（最后祝祷）之前的简短祷告或祝福。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prayer, blessing, or short religious address given before the main benediction (final blessing), especially in a church service.","zh":"（尤指教会礼拜中）在正式的“祝祷/终祷”（最后的祝福）之前所作的简短祈祷、祝福或劝勉。"},"examples":[{"en":"After the sermon, the pastor offered a brief prebenediction before the final blessing.","zh":"讲道结束后，牧师在最后的祝祷前先作了一个简短的预祝祷。"},{"en":"The choir sang softly during the prebenediction, and the congregation began to stand.","zh":"在预祝祷时诗班轻声献唱，会众开始起立。"}]}],"synonyms":["pre-blessing","pre-benediction prayer","closing prayer (context-dependent)"],"phonetic":"/ˌpriːˌbɛnɪˈdɪkʃən/","extraExplanation":["这是一个比较少见、偏教会礼仪用语的词。更常见的表达是“a prayer before the benediction / a closing prayer”或直接说“benediction”。","词形上由前缀 pre-（“在……之前”）+ benediction（“祝福、祝祷”）构成，因此含义直观：在终祷之前的祝祷/祷告。"]}
{"word":"prebeneficiaries","summary":{"en":"Prebeneficiaries are people pre-designated to receive benefits from a legal or financial arrangement.","zh":"Prebeneficiaries 指在法律或金融安排中被预先指定将获得利益/财产的人（预定受益人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people named in advance to receive benefits (such as money or property) from a plan, trust, will, or insurance policy; prospective or designated beneficiaries (plural form)","zh":"（在计划、信托、遗嘱或保险中）预先被指定将获得利益/财产的人；预定受益人（复数）"},"examples":[{"en":"The policy lists the spouse and children as prebeneficiaries in case something happens to the account holder.","zh":"该保单把配偶和子女列为预定受益人，以防账户持有人发生意外。"},{"en":"Before signing, confirm that the prebeneficiaries’ names are spelled correctly.","zh":"签字前，请确认预定受益人的姓名拼写正确。"}]}],"synonyms":["designated beneficiaries","named beneficiaries","prospective beneficiaries","potential beneficiaries"],"phonetic":"/ˌpriːˌbɛnəˈfɪʃiˌɛriz/","extraExplanation":["“prebeneficiaries”不是日常英语里的常见词，更常见的写法是“designated beneficiaries（指定受益人）”“named beneficiaries（列名受益人）”或“prospective beneficiaries（潜在/拟定受益人）”。","在法律/金融文件中，前缀“pre-”常表示“提前、预先”，所以该词通常强调“在事件发生前就已先行指定”。不同机构或合同对该词的定义可能略有差异，实际含义应以文件条款为准。"]}
{"word":"prebeneficiary","summary":{"en":"“Prebeneficiary” is an uncommon term meaning a person provisionally named as a beneficiary before the designation becomes legally effective.","zh":"“Prebeneficiary”是不常见的用语，指在指定尚未正式生效前被暂定/预先列为受益人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon; mainly in legal/insurance writing) A person who is named or intended to be a beneficiary before a later step (such as formal approval, vesting, or a triggering event) makes the beneficiary status fully effective.","zh":"（不常见；多见于法律/保险文件）在后续步骤（如正式核准、权利归属/生效或触发事件）之前，被指定或被意图指定为受益人的人。"},"examples":[{"en":"The trust lists Maya as a prebeneficiary until the court confirms the final beneficiaries.","zh":"该信托在法院确认最终受益人之前，将玛雅列为“预受益人”。"},{"en":"Under the policy draft, a prebeneficiary has no payout rights until the designation becomes effective.","zh":"在该保单草案下，“预受益人”在指定生效前没有领取保险金的权利。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a status or designation made before someone becomes a beneficiary in the legal sense.","zh":"（形容）指在法律意义上的“受益人”身份成立之前所做的指定/状态。"},"examples":[{"en":"They used prebeneficiary language in the contract to show the appointment was provisional.","zh":"他们在合同中使用“prebeneficiary”的表述来说明该指定是暂定的。"}]}],"synonyms":["potential beneficiary","provisional beneficiary","intended beneficiary","designated beneficiary (context-dependent)"],"phonetic":"/ˌpriˌbɛnəˈfɪʃiˌɛri/","extraExplanation":["这个词在日常英语里几乎不用，也不是最常见的标准术语；很多场景更常用 beneficiary（受益人）、potential beneficiary（潜在受益人）、designated beneficiary（指定受益人）、contingent beneficiary（备选/或有受益人）、provisional beneficiary（暂定受益人）。","如果你是在遗嘱/信托/保险文件里看到它，通常是在强调：此人“被提名/被考虑”为受益人，但在某个条件满足之前并不一定享有最终的法律权利。具体权利要以文件定义为准。"]}
{"word":"prebenefit","summary":{"en":"“Prebenefit” is an uncommon term meaning “before benefits are paid/begin,” mostly used in insurance or internal system labels.","zh":"“prebenefit”很少见，主要表示“在福利/理赔开始或支付之前”，多见于保险语境或系统内部标签。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) happening before a benefit is paid or before you receive benefits; used mainly as a modifier in insurance/finance contexts (often written with a hyphen: “pre-benefit”).","zh":"（不常见）在福利/理赔金支付之前发生的；在保险、金融语境中多作定语使用（常写作 pre-benefit / prebenefit）。"},"examples":[{"en":"Some plans cover pre-benefit medical expenses only under strict conditions.","zh":"有些计划只在严格条件下才覆盖理赔前（pre-benefit）的医疗费用。"},{"en":"The policy excludes pre-benefit claims related to existing conditions.","zh":"该保单不涵盖与既有疾病相关的理赔前（pre-benefit）索赔。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) the period or stage before benefits begin; “prebenefit” may appear in internal labels or software fields.","zh":"（不常见）福利开始之前的阶段/时期；“prebenefit”有时出现在内部标签或软件字段中。"},"examples":[{"en":"During the prebenefit period, you must submit all required documents.","zh":"在福利开始前阶段（prebenefit period），你必须提交所有必需文件。"},{"en":"The system flags accounts as “prebenefit” until eligibility is confirmed.","zh":"系统会在资格确认前将账户标记为“prebenefit”。"}]}],"synonyms":["pre-benefit","prior to benefits","before benefits begin","pre-payout"],"phonetic":"/ˌpriːˈbɛnəfɪt/","extraExplanation":["这个词在日常英语中几乎不用，更常见的写法是带连字符的 **pre-benefit**，或者直接用更清楚的表达：**before benefits begin / prior to benefit payment / before payout**。","在正式写作中，建议改用更明确的短语，以避免读者误解为一个固定术语。"]}
{"word":"prebenefited","summary":{"en":"“Prebenefited” is a rare word meaning “benefited in advance,” often in HR/insurance contexts.","zh":"“prebenefited”很少见，通常指“提前受益/福利提前计入或发放”，多用于人事/保险等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having already received a benefit in advance; benefited before the usual time.","zh":"（罕见）提前获得好处/福利的；在通常时间之前就已受益的。"},"examples":[{"en":"Some employees are effectively prebenefited because their employer pays part of the cost upfront.","zh":"有些员工等于被“提前受益”，因为雇主预先承担了一部分费用。"},{"en":"The plan treats certain early payments as prebenefited amounts.","zh":"该计划把某些提前支付视为“已提前受益”的金额。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, past tense/past participle of prebenefit) To give someone benefits in advance; to credit or pay benefits before they are normally due.","zh":"（罕见，“prebenefit”的过去式/过去分词）提前给予某人福利/好处；在通常到期前预先计入或支付福利。"},"examples":[{"en":"They prebenefited retirees by covering premiums for the first year.","zh":"他们通过承担第一年的保费来提前让退休人员受益。"},{"en":"Members were prebenefited through an early cash-out option.","zh":"成员通过提前提现吗选项而被提前给予利益。"}]}],"synonyms":["benefited in advance","received benefits early","credited upfront","prepaid (context-dependent)"],"phonetic":"/ˌpriˈbɛnəˌfɪtɪd/","extraExplanation":["“prebenefited”在日常英语里非常少见，更常见的写法是带连字符的“pre-benefited”，或直接改写为更自然的表达：benefited in advance / received benefits early / was credited upfront。","该词多出现在人力资源、保险、退休金（pension）或福利计划（benefits plan）的语境，用来描述“福利提前发放/提前计入”的情况。"]}
{"word":"prebenefiting","summary":{"en":"“Prebenefiting” is a rare term meaning giving benefits early or in advance.","zh":"“prebenefiting”是个较少见的说法，意思是提前/预先给予福利或让人受益。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) giving someone benefits in advance; providing an early benefit before it is normally due.","zh":"（少见用法）预先给予某人福利/好处；在通常应得之前先提供好处。"},"examples":[{"en":"Some companies are prebenefiting new hires by covering moving costs before the first day.","zh":"有些公司在入职第一天之前就预先给新员工福利，比如报销搬家费用。"},{"en":"The program focuses on prebenefiting low-income families with early childcare support.","zh":"该项目重点在于用早期托育支持来预先惠及低收入家庭。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) describing a policy or plan that delivers benefits early or ahead of schedule.","zh":"（少见用法）形容政策或方案“提前发放福利/提前带来好处”的。"},"examples":[{"en":"A prebenefiting plan can reduce financial stress at the start of the year.","zh":"一种提前发放福利的方案可以减轻年初的经济压力。"},{"en":"They discussed a prebenefiting approach to help students before the semester begins.","zh":"他们讨论了一种在学期开始前就帮助学生的“提前惠益”做法。"}]}],"synonyms":["providing benefits in advance","advance benefits","front-load benefits","pre-fund","help early"],"phonetic":"/ˌpriːˈbɛnəˌfɪtɪŋ/","extraExplanation":["“prebenefiting”并不是常见标准词，更常见的表达是：provide benefits in advance / give an early benefit / advance benefits / pre-funded benefits（预先出资的福利）/ front-load benefits（把福利前置）。","构词上是前缀 pre-（在……之前）+ benefit（使受益）+ -ing（进行/现在分词），因此语感上表示“正在提前让……受益/提前提供福利”。","如果你是在写人力资源、保险或公共政策文本，建议用更常见的说法以避免读者困惑。"]}
{"word":"prebeset","summary":{"en":"“prebeset” isn’t a standard English word; you probably mean “preset” or “beset.”","zh":"“prebeset”不是标准英语词；你很可能想写“preset”或“beset”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “preset” or “beset.”","zh":"不是标准英语单词。很可能是拼写错误，原本想写“preset”或“beset”。"},"examples":[{"en":"Did you mean “preset” (a pre-chosen setting), like a preset temperature?","zh":"你是不是想写“preset”（预先设定的设置），比如“preset temperature（预设温度）”？ "},{"en":"Or did you mean “beset” (to trouble or surround), like “She was beset by problems”?","zh":"或者你想写“beset”（困扰/围住），比如“She was beset by problems（她被各种问题困扰）”？ "}]}],"synonyms":["preset","beset"],"phonetic":"/ˈpriːsɛt/","extraExplanation":["“prebeset”里多出来的字母 b 可能是把“preset”和“beset”两词混在一起，或是打字时误触导致。","如果你能提供一句原句（上下文），我可以更准确判断你想表达的是“preset”还是“beset”，并给出对应用法。"]}
{"word":"prebesetting","summary":{"en":"A rare/nonstandard adjective meaning “before something becomes a persistent (besetting) problem or temptation.”","zh":"一个罕见／非标准形容词，表示“在某事变成长期反复困扰（besetting）的问题或诱惑之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Existing or happening before something becomes “besetting” (a persistent, recurring problem, temptation, or habit).","zh":"（罕见／非标准用法）指在某件事变成“长期反复困扰的”（besetting）问题、诱惑或习惯之前就已存在或发生的。"},"examples":[{"en":"The therapist focused on the prebesetting stresses that later fed his anxiety.","zh":"治疗师把重点放在那些在后来焦虑形成之前就存在的压力源上。"},{"en":"They tried to address the prebesetting causes before the conflict became a constant pattern.","zh":"他们试图在冲突变成长期模式之前，先处理其早期成因。"}]}],"synonyms":["early-stage","incipient","preexisting","underlying"],"phonetic":"/ˌpriːbɪˈsɛtɪŋ/","extraExplanation":["“prebesetting”在现代英语里几乎不作为固定词条使用，读者常会把它看成临时造词（pre- + besetting）。如果你是在阅读中遇到它，通常可理解为“在……成为长期困扰之前的/早期的”。","你可能想找的是：\n- “besetting”（尤用于短语“besetting sin”=“最容易反复犯的毛病/痼习”）\n- “prepossessing”（=“讨人喜欢的、有魅力的”，与“besetting”无关，拼写相近容易混淆）","常见搭配与更自然的替代表达包括：“early signs,” “underlying causes,” “preexisting issues,” “incipient problems”。"]}
{"word":"prebestow","summary":{"en":"“Prebestow” means to give or grant something in advance, before it is officially needed or before an event happens.","zh":"“prebestow”指“在事情发生前提前给予/授予”，属于较少见、偏书面的用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give, grant, or confer beforehand; to bestow in advance","zh":"预先给予；提前授予（在事情发生前就赐予/给予）"},"examples":[{"en":"The scholarship was prebestowed on students who had already demonstrated strong community service.","zh":"奖学金预先授予那些已经展现出强烈社区服务精神的学生。"},{"en":"Some benefits were prebestowed before the program officially began.","zh":"有些福利在项目正式开始前就已提前发放。"}]}],"synonyms":["give in advance","grant in advance","award beforehand","confer beforehand","bestow beforehand"],"phonetic":"/ˌpriːbɪˈstoʊ/","extraExplanation":["“prebestow”由前缀 pre-（“在……之前”）+ bestow（“授予/赠与”）组成，意思直观但非常少见，带有偏书面、古旧（archaic）的色彩。现代英语更常用 give/grant/award in advance 或 confer beforehand 来表达。","它常见于较旧的宗教或文学语境中，用来强调“恩赐/授予”是提前安排、甚至带有命定色彩（例如“恩典在你尚未知晓前已赐下”这类表达）。"]}
{"word":"prebestowal","summary":{"en":"Prebestowal means giving or granting something beforehand.","zh":"prebestowal 指在某事发生之前就先行授予或给予。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving or granting something in advance (before an event or time); an advance bestowal","zh":"（在某个事件或时间之前）预先授予、预先给予；预先赠与"},"examples":[{"en":"The scholarship was a prebestowal meant to help students pay the enrollment fee.","zh":"这笔奖学金是为了帮助学生支付注册费而预先发放的。"},{"en":"In some traditions, a ring is given as a prebestowal of commitment.","zh":"在一些传统中，戒指被视为对承诺的预先授予。"}]}],"synonyms":["advance grant","early award","prior conferral","pre-grant","pre-award"],"phonetic":"/ˌpriːbɪˈstoʊəl/","extraExplanation":["这个词非常少见，多见于正式或学术语境。构词上可拆成 pre-（“在……之前”）+ bestow（“授予/赠与”）+ -al（名词后缀），字面意思就是“提前的授予”。日常表达更常用 advance grant / early award / prior conferral。"]}
{"word":"prebetray","summary":{"en":"“Prebetray” is a rare, informal verb meaning to betray someone in advance or to commit an early betrayal.","zh":"“prebetray”是罕见、非正式动词，指提前背叛或在关键事件前就做出背叛行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare / informal) To betray someone in advance, or to take actions that amount to an early betrayal before the main betrayal happens.","zh":"（罕见／非正式）提前背叛（某人）；在真正的背叛发生前就做出等同于“先背叛”的行为。"},"examples":[{"en":"In the negotiation, leaking the plan to the other side would be to prebetray your own team.","zh":"在谈判中把计划泄露给对方，就等于提前背叛自己的团队。"},{"en":"Fans felt the company had prebetrayed them by secretly cutting features before launch.","zh":"粉丝觉得公司在发布前偷偷砍功能，已经算是提前背叛了他们。"}]}],"synonyms":["betray beforehand","betray in advance","preemptively betray","sell out"],"phonetic":"/ˌpriːbɪˈtreɪ/","extraExplanation":["“prebetray”不是标准常用词，更多是临时造词（nonce word）或网络语境中的写法，用来强调“背叛发生得很早／在关键事件之前就已经背叛”。更自然的表达通常是：“betray (someone) beforehand / betray (someone) in advance / preemptively betray”。","书写上也常见带连字符的形式“pre-betray”，更容易让读者看出前缀 pre-（“在……之前”）+ betray（“背叛”）的结构。"]}
{"word":"prebetrayal","summary":{"en":"“Prebetrayal” (rare) means before a betrayal happens, or the time before it.","zh":"“prebetrayal”（少见）指背叛发生之前，或背叛发生前的那段时间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or existing before a betrayal; relating to the time before someone betrays another person.","zh":"（少见）背叛发生之前的；与背叛发生前那段时间有关的。"},"examples":[{"en":"In the prebetrayal stage, she still trusted him completely.","zh":"在背叛发生之前的阶段，她还完全信任他。"},{"en":"The novel lingers on the prebetrayal calm before everything falls apart.","zh":"这部小说着墨于背叛前的平静，直到一切崩塌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The period or situation before a betrayal occurs.","zh":"（少见）背叛发生前的时期或情境。"},"examples":[{"en":"Their friendship in the prebetrayal felt almost innocent.","zh":"他们在背叛发生前的友谊几乎显得很单纯。"},{"en":"The film cuts between the prebetrayal and the aftermath.","zh":"电影在背叛发生前与事后之间来回切换。"}]}],"synonyms":["pre-betrayal","before the betrayal","prior to the betrayal","prelude to betrayal"],"phonetic":"/ˌpriːbɪˈtreɪəl/","extraExplanation":["“prebetrayal”不是常见词，更像是写作者临时造的复合词（pre- + betrayal）。在正式写作中，更自然的表达通常是 “before the betrayal” 或 “pre-betrayal (period)”。","连字符形式 “pre-betrayal” 有时更清晰，读者更容易一眼看懂结构。"]}
{"word":"prebetrothal","summary":{"en":"Prebetrothal refers to the stage or actions before a formal promise to marry (betrothal).","zh":"Prebetrothal 指正式订婚（婚约）之前的阶段或相关行为/习俗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time, stage, or customs that happen before a formal betrothal (an official promise to marry)","zh":"正式订婚（婚约）之前的阶段、时期或相关习俗"},"examples":[{"en":"In some cultures, families hold a prebetrothal meeting to discuss expectations.","zh":"在一些文化中，双方家庭会在订婚前举行会面，讨论彼此的期望。"},{"en":"Their prebetrothal talks lasted for months before they announced an engagement.","zh":"他们在公开宣布订婚前，进行了数月的订婚前商谈。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done before a formal betrothal","zh":"发生在正式订婚之前的；订婚前的"},"examples":[{"en":"They signed a prebetrothal agreement about finances.","zh":"他们签了一份关于财务的订婚前协议。"},{"en":"The novel describes the couple’s prebetrothal courtship in detail.","zh":"那部小说细致描写了这对恋人在订婚前的求爱过程。"}]}],"synonyms":["pre-engagement","before the betrothal","prior to engagement","courtship (in some contexts)"],"phonetic":"/ˌpriːbɪˈtroʊðəl/","extraExplanation":["“betrothal”指的是比“engagement（订婚）”更偏正式、带有法律或宗教意味的“婚约/订婚承诺”。因此“prebetrothal”常见于人类学、历史研究或描写传统婚俗的语境中，而在日常口语里更常说“before the engagement / before they got engaged（订婚之前）”。"]}
{"word":"prebiblical","summary":{"en":"Prebiblical means “before the Bible” or “before the period described in the Bible,” often used in history, archaeology, and religious studies.","zh":"prebiblical 指“《圣经》成书之前/圣经叙事所述时期之前的”，常用于历史、考古与宗教研究语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a time, culture, text, or belief) existing before the Bible was written or before the events described in the Bible.","zh":"（时间、文化、文本或信仰）《圣经》成书之前的；或早于《圣经》所记载事件的。"},"examples":[{"en":"Archaeologists study prebiblical cities in Mesopotamia to understand early urban life.","zh":"考古学家研究美索不达米亚的前圣经时期城市，以了解早期的城市生活。"},{"en":"The museum has artifacts from prebiblical Egypt.","zh":"博物馆里有前圣经时期的埃及文物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to writings or traditions that existed before or outside the Bible’s texts.","zh":"与《圣经》文本之前或《圣经》之外的著作与传统有关的。"},"examples":[{"en":"The course compares prebiblical myths with stories in Genesis.","zh":"这门课把前圣经时期的神话与《创世记》中的故事作比较。"},{"en":"Some scholars look at prebiblical laws to understand the background of biblical commandments.","zh":"一些学者研究前圣经时期的法律，以理解圣经诫命的背景。"}]}],"synonyms":["pre-Christian","ancient","early","proto-biblical","primeval"],"phonetic":"/ˌpriˈbɪb.lɪ.kəl/","extraExplanation":["“pre-”表示“在……之前”，“biblical”指“与《圣经》有关的”。因此 prebiblical 常见于考古、历史、宗教学与圣经研究语境，用来做时间或文本来源的划分（例如“前以色列/前《圣经》传统”）。","它并不一定带有“比《圣经》更正确/更权威”的价值判断，更多是一个学术性的时间或材料来源标签。"]}
{"word":"prebid","summary":{"en":"Prebid is an open-source ad-tech toolkit for header bidding, commonly referring to Prebid.js and related components.","zh":"Prebid 是用于头部竞价的开源广告技术工具集，常指 Prebid.js 等组件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ad tech) An open-source set of tools used for header bidding, helping websites invite multiple advertising buyers to bid on an ad impression before the ad server chooses a winner.","zh":"（广告技术）一套用于“头部竞价（header bidding）”的开源工具，帮助网站在广告服务器选定赢家之前，让多个广告买方对一次广告展示机会进行竞价。"},"examples":[{"en":"Our publisher uses Prebid to run header bidding and increase competition for ad inventory.","zh":"我们这个媒体站用 Prebid 做头部竞价，提高广告库存的竞争度。"},{"en":"They integrated Prebid.js on the site to connect several demand partners at once.","zh":"他们在网站上集成了 Prebid.js，一次连接多个需求方（买方）。"}]}],"synonyms":["Prebid.js","header bidding","Prebid Server"],"phonetic":"/ˈpriːbɪd/","extraExplanation":["Prebid 最常指 Prebid.js（运行在网页端的 JavaScript 库）以及 Prebid Server（服务端组件）。它们的核心目的，是在广告请求进入广告服务器（如 Google Ad Manager）之前，先进行一轮多方竞价，从而减少只依赖单一广告平台带来的价格信息不透明。","在行业讨论中，人们也会说“用 prebid（小写）”来泛指“做头部竞价这套流程”，但严格来说 Prebid 是项目/生态的名称。"]}
{"word":"prebidding","summary":{"en":"Prebidding means bidding in advance, especially in procurement or online ad auctions.","zh":"Prebidding 指“提前出价/预先竞标”，常见于采购招标或线上广告竞价场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity of submitting a bid before a formal deadline or before a live auction begins (common in business procurement and online advertising).","zh":"预先出价；在正式截止时间或现场竞拍开始前提前提交报价/出价（常见于采购招标与线上广告）。"},"examples":[{"en":"Several contractors submitted prebidding proposals to show they were interested.","zh":"几家承包商提交了预先报价，以表示有意参与。"},{"en":"In online ads, prebidding helps decide which ad is likely to win an auction.","zh":"在网络广告中，预先出价有助于判断哪条广告更可能赢得竞价。"}]},{"partOfSpeech":"v.","definition":{"en":"To place a bid in advance of an auction or bidding process.","zh":"提前出价；在竞价/招标过程开始前先行报价。"},"examples":[{"en":"Some buyers prebidded online before the live auction started.","zh":"一些买家在现场拍卖开始前就在网上提前出价。"},{"en":"Vendors may prebidding to signal their pricing range early.","zh":"供应商可能会提前出价，以便早早表明价格区间。"}]}],"synonyms":["advance bidding","early bidding","pre-bid (adj./n.)"],"phonetic":"/ˌpriːˈbɪdɪŋ/","extraExplanation":["“pre-”表示“在……之前”，加上“bidding（出价/竞标）”构成“prebidding（预先出价）”。在不同领域含义略有差别：\n- 采购招标：常见于“pre-bid meeting（投标前会议）”“pre-bid questions（投标前提问）”，而“prebidding”本身不如这些搭配常见。\n- 数字广告：常用于“pre-bid / prebid”相关技术与策略，指在实时竞价（RTB）之前进行的出价预判或准备工作。","写法上也常见连字符形式“pre-bidding”，在正式写作里更常见、更清晰。"]}
{"word":"prebill","summary":{"en":"Prebill means to bill in advance, or an advance/preliminary bill before the final invoice.","zh":"prebill 指提前计费/预先开账单，也可指最终账单前的预账单或初步发票。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to prepare and issue a bill (invoice) in advance, often before the service period ends or before final charges are confirmed","zh":"预先开账单；提前出具发票（常在服务期结束前或最终费用确认前）"},"examples":[{"en":"The hotel may prebill your card for incidentals at check-in.","zh":"酒店可能在入住时先对你的卡进行预扣/预先入账，用于杂费。"},{"en":"We prebill monthly subscriptions on the first day of each month.","zh":"我们在每月第一天对月度订阅进行预先计费。"}]},{"partOfSpeech":"n.","definition":{"en":"an advance bill or preliminary invoice issued before the final bill","zh":"预账单；预开票（最终账单出具前的初步账单）"},"examples":[{"en":"Could you send me a prebill so I can get the purchase approved?","zh":"你能先发我一份预账单吗？我需要用它走审批。"},{"en":"The prebill doesn’t include late fees or adjustments.","zh":"这份预账单不包含滞纳金或后续调整。"}]}],"synonyms":["bill in advance","advance bill","pre-invoice","precharge","issue a preliminary invoice"],"phonetic":"/ˌpriːˈbɪl/","extraExplanation":["“prebill / pre-bill”多见于酒店、订阅服务、医疗/保险结算、企业采购等场景。它通常表示“提前计费或出具初步账单”，不一定等于最终金额。","在信用卡场景里，prebill 有时会接近“预授权/预扣（pre-authorization）”的效果，但严格来说预授权是银行交易流程，prebill 更偏向商家开具账单或提前入账的做法。","写法上常见 prebill（一个词）或 pre-bill（带连字符）；作名词时也可写作 pre-bill / prebill。"]}
{"word":"prebilled","summary":{"en":"“Prebilled” means billed in advance (often for subscriptions or services).","zh":"“prebilled”指“提前开账单/预先计费”，常用于订阅或服务费用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already billed in advance; charged before the service period or delivery happens","zh":"预先开账单的；提前收费的（在服务期开始或交付前就已计费）"},"examples":[{"en":"The subscription is prepaid and prebilled each month.","zh":"这个订阅是预付的，并且每个月都会提前开账单。"},{"en":"Your hotel room rate was prebilled to your credit card.","zh":"你的酒店房费已提前记入你的信用卡账单。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past participle of “prebill”) to send a bill in advance","zh":"（动词 prebill 的过去式/过去分词）提前开账单；预先计费"},"examples":[{"en":"The company prebilled customers for the first year of service.","zh":"公司为客户第一年的服务提前开了账单。"},{"en":"If you were prebilled by mistake, contact support.","zh":"如果你被误提前计费，请联系客户支持。"}]}],"synonyms":["billed in advance","advance-billed","precharged"],"phonetic":"/ˌpriːˈbɪld/","extraExplanation":["“prebilled”常见于账单/订阅/保险/医疗等场景，表示费用在服务发生前就已生成并可能已扣款。和“prepaid（预付）”不同：prebilled强调“账单先开出来”，是否已付款要看具体情况。","相关词：bill（开账单/收费）、billing cycle（账单周期）、advance billing（预先计费）、postpaid（后付费）。"]}
{"word":"prebilling","summary":{"en":"Prebilling means handling billing tasks or creating a bill in advance, before the service is finished or the final invoice is issued.","zh":"Prebilling 指在服务完成或最终账单出具之前，提前进行计费处理或生成账单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of preparing or issuing a bill before a service is completed or before the final invoice is sent (often used in healthcare, legal, or subscription billing).","zh":"在服务完成之前，先行准备或开具账单的流程（常见于医疗、法律或订阅计费等场景）。"},"examples":[{"en":"The clinic uses prebilling to check insurance details before the patient’s visit.","zh":"这家诊所使用预先计费，在病人就诊前核对保险信息。"},{"en":"Prebilling helps the company catch coding errors before the final invoice goes out.","zh":"预先计费能帮助公司在最终账单发出前发现编码错误。"}]},{"partOfSpeech":"n.","definition":{"en":"A billing amount or charge that is sent in advance (less common).","zh":"提前发送的账单金额或预收费用（较少见）。"},"examples":[{"en":"They asked for a prebilling before starting the project.","zh":"他们要求在项目开始前先出一份预先账单。"}]}],"synonyms":["advance billing","pre-invoicing","billing in advance","preparation of invoices"],"phonetic":"/ˌpriːˈbɪlɪŋ/","extraExplanation":["“prebilling”多见于行业内部用语，尤其是医疗账务（medical billing）里：常包含核对保险资格（eligibility）、核对收费/诊断编码（coding）、估算自付额（patient responsibility）等步骤。","写法上也常见作形容词或动名词形式：pre-billing / prebilling（两种拼写都能见到），具体取决于机构的风格指南。"]}
{"word":"prebills","summary":{"en":"“Prebills” are bills/invoices sent in advance, or the act of billing in advance.","zh":"“prebills”指预先开出的账单，或指提前开账的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bills or invoices issued in advance (often before a service period begins), especially in utilities, subscriptions, or recurring services.","zh":"预先开出的账单；预开账单（常用于水电气、订阅或周期性服务，在服务期开始前先出账）。"},"examples":[{"en":"The apartment complex sends prebills for electricity at the start of each month.","zh":"公寓小区会在每月初寄出电费预开账单。"},{"en":"Please review the prebills and report any incorrect charges before payment is processed.","zh":"请核对这些预开账单，如有不正确的费用请在付款处理前反馈。"}]},{"partOfSpeech":"vt.","definition":{"en":"To issue a bill in advance; to invoice someone before the usual billing date or before a service is fully delivered.","zh":"预先开账；提前开具发票（在正常结算日之前或服务尚未完全提供前先出账）。"},"examples":[{"en":"Some gyms prebill members a week before the next membership period starts.","zh":"有些健身房会在下一个会员周期开始前一周就向会员预先开账。"},{"en":"They prebilled us for the annual plan, even though we upgraded later.","zh":"他们先按年付方案给我们预先开账，尽管我们之后又升级了。"}]}],"synonyms":["advance bills","pre-invoices","advance billing","invoice in advance"],"phonetic":"/ˌpriːˈbɪl/","extraExplanation":["“prebill / prebills”常见于账务、财务或客服邮件语境，强调“提前出账”。不同公司对预开账单的处理方式不同：有的会在最终结算时再调整差额（例如按实际用量补退），因此看到prebills时，建议同时查看是否标注了“estimated/estimated usage（预估用量）”“adjustment（调整）”等字样。"]}
{"word":"prebind","summary":{"en":"Prebind means to bind or connect something in advance, especially in computing.","zh":"Prebind 指“预先绑定/预先连接”，多用于计算机领域。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(computing) To bind in advance; to connect names, addresses, or resources before the program runs (often to reduce startup time or avoid repeated work).","zh":"（计算机）预先绑定；在程序运行前把名称、地址或资源先连接/绑定好（常为加快启动或避免重复工作）。"},"examples":[{"en":"The build system can prebind libraries so the app launches faster.","zh":"构建系统可以预先绑定库，从而让应用启动更快。"},{"en":"If you prebind the assets, the game won’t need to look them up at runtime.","zh":"如果你把资源预先绑定，游戏运行时就不需要再去查找它们了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(general) To fasten or tie something beforehand (rare outside technical use).","zh":"（一般用法）事先捆绑/固定（较少见，通常只在技术语境外偶尔使用）。"},"examples":[{"en":"They prebound the cables into bundles to make installation easier.","zh":"他们把电缆事先捆成束，便于安装。"}]}],"synonyms":["pre-link","bind ahead of time","preconnect"],"phonetic":"/ˌpriːˈbaɪnd/","extraExplanation":["“prebind”常见于软件工程/系统领域，尤其与“linking（链接）”“dynamic linker（动态链接器）”“symbol binding（符号绑定）”等概念相关。意思接近“先把要用到的链接关系/查找结果准备好”，以减少程序运行时的开销。","在某些平台或工具链的文档里，你可能会看到“prebinding / pre-bind”作为名词或动名词用法，指一种优化策略或构建步骤；具体行为会因系统实现而不同。"]}
{"word":"prebinding","summary":{"en":"Prebinding means preparing program links/bindings in advance to speed up startup or initial loading.","zh":"Prebinding 指“预先绑定/预先链接”：提前准备连接信息以加快程序启动或初次加载。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Computing) A technique where information needed for linking/loading is prepared in advance so a program can start faster.","zh":"（计算机）一种把程序链接/加载所需的信息提前准备好的技术，从而让程序启动更快。"},"examples":[{"en":"Older systems used prebinding to reduce application launch time.","zh":"一些较旧的系统会用 prebinding 来减少应用启动时间。"},{"en":"If prebinding fails, the program may need to re-link when it starts.","zh":"如果 prebinding 失败，程序启动时可能需要重新链接。"}]},{"partOfSpeech":"n.","definition":{"en":"(Software development) Preparing connections (bindings) ahead of time between components, such as libraries, modules, or UI/data bindings.","zh":"（软件开发）提前建立组件之间的“绑定/关联”，比如库、模块之间的连接，或界面与数据的绑定。"},"examples":[{"en":"The framework supports prebinding data so the first screen renders quickly.","zh":"这个框架支持数据预绑定，让首屏渲染更快。"},{"en":"Prebinding can improve performance, but it may complicate updates.","zh":"预绑定可以提升性能，但可能会让更新更复杂。"}]}],"synonyms":["pre-linking","ahead-of-time binding","static linking (related)","early binding (related)"],"phonetic":"/priːˈbaɪndɪŋ/","extraExplanation":["“prebinding”由 pre-（预先）+ binding（绑定/关联）组成，常见于技术语境。尤其在 macOS 早期的动态链接机制中，prebinding 指把动态库的地址信息预先写入应用，从而加快启动；但在系统更新或库变化后可能失效，因此后来逐渐被更现代的机制取代。"]}
{"word":"prebinds","summary":{"en":"Prebinds means “binds ahead of time,” either physically (tying/securing) or digitally (setting bindings in advance).","zh":"prebinds 指“预先绑定/事先绑好”，既可指实体捆绑固定，也可指在软件或游戏中提前设置绑定关系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To bind or tie something in advance; to prepare by fastening or securing beforehand.","zh":"预先捆绑；事先绑好（在使用或操作前先固定/系牢）。"},"examples":[{"en":"The stage crew prebinds the cables to keep the area safe.","zh":"舞台工作人员会预先把电缆捆扎好，确保现场安全。"},{"en":"She prebinds the package with twine before shipping it.","zh":"她在寄出前用麻绳把包裹先绑好。"}]},{"partOfSpeech":"v.","definition":{"en":"(Computing/gaming) To set key bindings or link functions ahead of time (e.g., before a program runs or before a match starts).","zh":"（计算机/游戏）预先绑定（功能/按键）；提前设置键位或功能映射（如程序运行前、比赛开始前）。"},"examples":[{"en":"He prebinds his hotkeys so he doesn’t waste time in-game.","zh":"他会预先绑定快捷键，这样在游戏里就不浪费时间。"},{"en":"The app prebinds common actions to the toolbar for faster access.","zh":"这个应用把常用操作预先绑定到工具栏上，方便快速使用。"}]}],"synonyms":["pre-tie","pre-attach","secure beforehand","preset","preconfigure"],"phonetic":"/ˌpriːˈbaɪndz/","extraExplanation":["“prebinds”通常是动词“prebind”的第三人称单数现在时（he/she/it prebinds）。更常见的基础形式是“prebind”。","在日常英语里，“prebind”不算高频词；如果想更自然，也可用“tie/secure beforehand（事先系好/固定好）”。在技术语境中，“bind”表示“把功能/变量/按键与某个动作连接起来”，加上“pre-”强调“提前完成”。"]}
{"word":"prebiologic","summary":{"en":"“Prebiologic” means before biological life existed, often used in scientific contexts about early Earth and the origin of life.","zh":"“prebiologic”指生命出现之前的（前生物时期的），常用于地球早期与生命起源等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before life began; relating to the period before biological life (especially in discussions of Earth’s early history or the origins of life).","zh":"生命出现之前的；与“生物出现之前的时期”（常见于地球早期历史或生命起源讨论）有关的。"},"examples":[{"en":"Scientists study prebiologic Earth to understand how life could start from nonliving chemistry.","zh":"科学家研究“前生物时期”的地球，以理解生命如何从非生命的化学过程开始。"},{"en":"The paper discusses prebiologic conditions in the oceans, such as temperature and available minerals.","zh":"这篇论文讨论了海洋中的前生物条件，例如温度和可获得的矿物质。"}]}],"synonyms":["prebiotic (in origin-of-life sense)","prelife","abiotic (related)"],"phonetic":"/ˌpriːbaɪəˈlɑːdʒɪk/","extraExplanation":["“prebiologic”在日常英语中比较少见，多见于学术语境（地质学、天体生物学、生命起源研究）。更常见的表达是“prebiotic”（前生物的/生命起源前的），但要注意：在营养学里“prebiotic”通常指“益生元”（促进益生菌生长的膳食成分），含义不同。阅读文章时要根据上下文判断。"]}
{"word":"prebiological","summary":{"en":"Prebiological means “before life existed,” often used in discussions of early Earth and chemical steps toward the origin of life.","zh":"prebiological 意为“生命出现之前的”，常用于讨论早期地球以及可能通向生命起源的化学过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before biological life (organisms) appeared; relating to the time before life began on Earth.","zh":"（地球上）生命出现之前的；与生命起源之前时期有关的。"},"examples":[{"en":"Scientists study prebiological Earth to understand how life could have started.","zh":"科学家研究前生物时期的地球，以了解生命可能如何起源。"},{"en":"Prebiological conditions may have allowed simple molecules to form more complex ones.","zh":"前生物时期的条件可能使简单分子形成更复杂的分子。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to chemical processes that occurred before life, especially those leading toward the origin of life (prebiotic chemistry).","zh":"与生命出现之前的化学过程有关的，尤指可能促成生命起源的过程（前生物化学/前生命化学）。"},"examples":[{"en":"The paper discusses prebiological chemistry in early oceans.","zh":"这篇论文讨论了早期海洋中的前生物化学。"},{"en":"Researchers test whether prebiological reactions can produce amino acids.","zh":"研究人员测试前生物反应是否能生成氨基酸。"}]}],"synonyms":["pre-life","abiotic (in some contexts)","prebiotic (in origin-of-life contexts)"],"phonetic":"/ˌpriːbaɪəˈlɑːdʒɪkəl/","extraExplanation":["“prebiological”常见于生命起源（origin of life）相关的科普与论文语境，强调“在生物学意义上的生命出现之前”。在很多写作里，它与“prebiotic（前生物的/益生元的）”容易混淆：prebiotic在营养学中多指“益生元”，而在生命起源领域也可指“前生物化学”。为避免歧义，学术写作中常用“prebiological”或更明确的“prebiotic chemistry/abiotic chemistry（非生物化学）”。","词形上：pre-（在……之前）+ biological（生物的）。该词相对偏学术，用于描述早期地球环境（如大气成分、海洋化学、能量来源）或可能通向“abiogenesis（非生物起源）”的反应路径。"]}
{"word":"prebiotic","summary":{"en":"Prebiotic = a fiber-like substance that feeds helpful gut bacteria; also an adjective for products that contain it.","zh":"prebiotic（益生元）= 为肠道有益菌提供养分的物质（常为纤维）；也可作形容词表示“含益生元的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often a type of fiber) that feeds beneficial gut bacteria and helps them grow.","zh":"益生元：一种物质（常为膳食纤维），能为肠道有益菌提供“食物”，促进其生长。"},"examples":[{"en":"Foods like onions and bananas contain prebiotic fiber.","zh":"洋葱和香蕉等食物含有益生元纤维。"},{"en":"She added a prebiotic supplement to support her gut health.","zh":"她加用了益生元补充剂来支持肠道健康。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or containing prebiotics.","zh":"益生元的；含益生元的。"},"examples":[{"en":"This yogurt is labeled as prebiotic and probiotic.","zh":"这款酸奶标注为“含益生元与益生菌”。"},{"en":"He chose a prebiotic drink with added fiber.","zh":"他选了一款添加纤维的益生元饮料。"}]}],"synonyms":["dietary fiber (some types)","gut bacteria–feeding fiber","inulin (a common type)"],"phonetic":"/ˌpriːbaɪˈɑːtɪk/","extraExplanation":["“prebiotic”常与“probiotic（益生菌）”一起出现：益生元是“喂菌的”（给好菌当食物），益生菌是“活菌本身”。两者并用有时会写成“synbiotic（合生元）”。","词源上，前缀“pre-”有“在……之前/预先”的意思，这里可理解为：在益生菌发挥作用之前，先提供它们需要的营养。","日常语境里，“prebiotic”多见于营养学与食品标签；并非所有“高纤维”都等同于益生元，但很多益生元属于可被肠道菌群利用的特定纤维（如菊粉inulin、低聚果糖FOS）。"]}
{"word":"prebless","summary":{"en":"“Prebless” means to bless something in advance, or figuratively to approve it ahead of time.","zh":"“prebless”指“预先祝福”，也可引申为“提前认可/背书”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bless in advance; to give an early blessing before an event, action, or use","zh":"预先祝福；在某事发生、开始或使用之前先行赐福/祝福"},"examples":[{"en":"The priest preblessed the rings before the wedding rehearsal.","zh":"神父在婚礼彩排前预先为戒指祝福。"},{"en":"Some families like to prebless a new home before moving in.","zh":"有些家庭喜欢在搬入新家前先做预先祝福。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to approve or support something ahead of time, as if giving it a blessing","zh":"（引申）提前认可/背书；在事情发生前就表示支持，仿佛“先给祝福”"},"examples":[{"en":"The manager wouldn’t prebless the plan without seeing the budget.","zh":"经理在没看到预算前不会提前认可这个计划。"},{"en":"We shouldn’t prebless a decision before hearing everyone’s concerns.","zh":"在听完大家的顾虑之前，我们不该先行拍板支持这个决定。"}]}],"synonyms":["bless beforehand","bless in advance","give an early blessing","pre-approve (figurative)","endorse (figurative)"],"phonetic":"/ˌpriːˈblɛs/","extraExplanation":["“prebless”不是非常常见的标准词，更常见的写法是带连字符的“pre-bless”。在宗教语境里通常更自然的表达是“bless in advance / bless beforehand / offer a blessing before…”。","词根提示：前缀“pre-”表示“在……之前”，加上“bless（祝福）”，组合出“预先祝福”的意思。"]}
{"word":"preblessed","summary":{"en":"Preblessed means “already blessed beforehand,” often used for religious items; it can also be a humorous, informal way to say something is ‘blessed’ in advance.","zh":"preblessed 指“事先已被祝福/祝圣过的”，常用于宗教物品；也可作幽默的口语说法，表示“提前算祝福过了”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of an object) already blessed in advance, often by a priest or in a religious setting.","zh":"（尤指物品）事先已被祝福过的，常见于宗教（如神父祝圣）语境。"},"examples":[{"en":"The shop sells preblessed rosaries and medals.","zh":"那家店出售事先祝福过的玫瑰念珠和圣牌。"},{"en":"You can bring a preblessed candle to the ceremony.","zh":"你可以带一支事先祝福过的蜡烛参加仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, humorous) treated as “blessed” before it is used or eaten, often as a joke about saying grace.","zh":"（非正式/幽默）在使用或吃之前就被当作“已经祝福过”，常用来开玩笑指代饭前祷告/谢饭。"},"examples":[{"en":"These donuts are preblessed—go ahead and have one.","zh":"这些甜甜圈算是提前祝福过了——尽管吃吧。"},{"en":"He called his coffee “preblessed” because he forgot to say grace.","zh":"他忘了谢饭，就把咖啡说成是“提前祝福过的”。"}]}],"synonyms":["already blessed","blessed beforehand","pre-blessed"],"phonetic":"/ˌpriːˈblɛst/","extraExplanation":["“preblessed”在正式写法中常见作“pre-blessed”（带连字符），意思更明确：pre-（事先）+ blessed（被祝福的）。","在英语文化中，“bless”既可指宗教仪式中的祝福/祝圣，也可在日常口语里带幽默或夸张意味（例如把食物说成“blessed”）。因此“preblessed”在社交媒体或口语里也可能带玩笑语气。","不同宗教传统对“blessing”的含义与使用场景不完全相同；如果你在正式场合使用，最好根据具体社群的习惯选择更清晰的表达（如“already blessed”或“blessed beforehand”）。"]}
{"word":"preblesses","summary":{"en":"“Preblesses” means “blesses beforehand,” usually in a religious or ceremonial sense.","zh":"“preblesses”意思是“预先祝福/事先赐福”，多用于宗教或仪式场合。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bless in advance; to give a blessing beforehand (often in a religious or ceremonial context).","zh":"预先祝福；事先赐福（常见于宗教或仪式语境）。"},"examples":[{"en":"Before the journey begins, the priest preblesses the travelers.","zh":"在旅程开始之前，神父会预先为旅行者祝福。"},{"en":"Some families ask an elder to prebless the home before moving in.","zh":"有些家庭会请长辈在搬进去之前先为新家祝福。"}]}],"synonyms":["blesses beforehand","blesses in advance","consecrates beforehand"],"phonetic":"/priˈblɛsɪz/","extraExplanation":["“preblesses”通常是动词“prebless”的第三人称单数（he/she/it preblesses）。这个词在现代日常英语里很少见，更常见的是用“bless … beforehand / in advance”来表达同样意思。","前缀“pre-”表示“在……之前”，常见于preheat（预热）、prepay（预付）、prejudge（预判/成见）等词。"]}
{"word":"preblessing","summary":{"en":"“Preblessing” means a blessing given in advance, before something happens.","zh":"“preblessing”指在事情发生前给予的预先祝福/预先祈祷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blessing or prayer said in advance (before an event, meal, journey, ceremony, etc.); an advance request for protection or good fortune","zh":"（在事情发生前给予的）预先祝福/预先祈祷；事先祈求平安与顺利"},"examples":[{"en":"Before we left for the trip, my grandmother gave us a preblessing for safety.","zh":"出发旅行前，奶奶先给我们做了一个平安的预先祝福。"},{"en":"Some couples ask for a preblessing from a priest before the wedding day.","zh":"有些情侣会在婚礼当天之前请神父给予预先祝福。"},{"en":"Let’s do a quick preblessing before dinner.","zh":"我们开饭前先简单做个预先祝福吧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) done or given as a blessing beforehand","zh":"（罕见）作为提前祝福而进行的/给予的"},"examples":[{"en":"They held a preblessing ceremony for the new home.","zh":"他们为新家举行了一个预先祝福仪式。"}]}],"synonyms":["advance blessing","blessing in advance","blessing beforehand","pre-blessing"],"phonetic":"/ˌpriːˈblɛsɪŋ/","extraExplanation":["“preblessing”不是非常常见的标准词，更常见的说法有：a blessing beforehand / an advance blessing / a blessing in advance，宗教语境里也可能说 pre-service blessing 或 blessing before the meal。写作时常见带连字符的形式 pre-blessing，用来强调“提前进行”。","在基督教（尤其是天主教/圣公会等）语境中，blessing 常指由神职人员进行的祝祷；在更日常的语境里，也可以泛指长辈或亲友给出的“事前祝福/好话”。"]}
{"word":"preblockade","summary":{"en":"Preblockade (often pre-blockade) means “before a blockade,” describing a time or situation prior to the start of a blockade.","zh":"preblockade（常写作 pre-blockade）表示“封锁开始之前的”，可形容封锁前的时期或状况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often hyphenated: pre-blockade) happening or existing before a blockade began.","zh":"（常写作 pre-blockade）封锁开始之前发生的；封锁前的。"},"examples":[{"en":"Many families remember the pre-blockade years as a time of easier trade.","zh":"许多家庭记得封锁前的那些年贸易更便利。"},{"en":"The museum has photos of pre-blockade Havana.","zh":"博物馆里有封锁前哈瓦那的照片。"}]},{"partOfSpeech":"n.","definition":{"en":"the period of time before a blockade (used mainly in historical or political writing).","zh":"封锁开始之前的时期（多用于历史或政治写作）。"},"examples":[{"en":"In the preblockade, imported goods were more common.","zh":"在封锁前时期，进口商品更常见。"},{"en":"Researchers compare health data from the preblockade and post-blockade periods.","zh":"研究人员比较封锁前与封锁后的健康数据。"}]}],"synonyms":["pre-blockade","before the blockade","prior to the blockade","pre-embargo (similar, not identical)"],"phonetic":"/ˌpriːˈblɑːkeɪd/","extraExplanation":["“preblockade”不是非常常见的日常词，更常见的写法是加连字符的 **pre-blockade**（尤其在新闻、历史与学术语境中）。","它常出现在讨论某些国家或地区被实施经济/海上封锁之前的社会与经济状况时（例如谈到“封锁前的古巴/加沙”等语境）。","词形结构：**pre-**（“在……之前”）+ **blockade**（“封锁”）。"]}
{"word":"preblockaded","summary":{"en":"“Preblockaded” means already blocked off ahead of time, or having been blocked off in advance.","zh":"“preblockaded”指“预先封锁的”，或“已被提前封锁”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"blocked or cut off in advance (before an expected blockade, attack, or restriction); already sealed off ahead of time.","zh":"预先封锁的；在预期的封锁、攻击或限制发生之前就已被切断或封闭的。"},"examples":[{"en":"The harbor was preblockaded with floating barriers before the ships arrived.","zh":"在船只到达之前，港口就用浮动障碍物预先封锁了。"},{"en":"Some neighborhoods were effectively preblockaded by police checkpoints hours before the protest.","zh":"在抗议开始前数小时，一些街区就通过警方检查站被实际“预先封锁”了。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of \"preblockade\": to block off or isolate something in advance.","zh":"“preblockade”的过去式：预先封锁；提前隔离某地/某物。"},"examples":[{"en":"They preblockaded the main road to stop deliveries from getting through.","zh":"他们预先封锁了主干道，阻止物资运送通过。"},{"en":"The exits were preblockaded as part of the emergency drill.","zh":"作为应急演练的一部分，出口被预先封锁了。"}]}],"synonyms":["blocked off in advance","sealed off","cordoned off","isolated","pre-emptively blocked"],"phonetic":"/ˌpriːˈblɑːkeɪdɪd/","extraExplanation":["“preblockaded”不是特别常见的标准词形，更常见的表达是“pre-blockaded”（加连字符）或直接说“blocked off in advance / sealed off ahead of time”。","在军事、海运、治安管控或大型活动的语境里更可能见到类似用法；正式写作中建议改用更常见的短语以避免读者困惑。"]}
{"word":"preblockading","summary":{"en":"Preblockading describes something that occurs before a blockade, or (more rarely) actions taken to get ready to impose one.","zh":"preblockading 指“封锁前的”，或（较少见）“为实施封锁而提前采取行动的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before a blockade begins (especially a military or naval blockade).","zh":"发生在封锁（尤指军事/海上封锁）开始之前的；封锁前的。"},"examples":[{"en":"Preblockading negotiations failed, and the navy announced the blockade the next day.","zh":"封锁前的谈判失败了，海军第二天宣布实施封锁。"},{"en":"The report focuses on preblockading conditions in the port, such as fuel supplies and shipping traffic.","zh":"这份报告重点讨论港口在封锁前的状况，例如燃料供应与航运流量。"}]},{"partOfSpeech":"v.","definition":{"en":"Preparing for or taking early steps toward imposing a blockade (rare).","zh":"为实施封锁做准备的；提前采取封锁相关措施的（较少见）。"},"examples":[{"en":"The commander was preblockading the area by moving ships into position.","zh":"指挥官通过将军舰移至指定位置来提前为封锁该地区做准备。"}]}],"synonyms":["pre-blockade","prior-to-the-blockade","before-the-blockade","preliminary"],"phonetic":"/ˌpriːˈbloʊkeɪdɪŋ/","extraExplanation":["“preblockading”更常写成带连字符的“pre-blockading”，表示“封锁前的”。不带连字符也能见到，但多出现在较技术性或编辑风格更自由的文本里。","它主要用于政治、历史、军事报道语境；日常英语里更常说“before the blockade”或“prior to the blockade”。"]}
{"word":"preblooming","summary":{"en":"Preblooming means “before blooming,” literally for plants and figuratively for something still in an early, developing stage.","zh":"preblooming 意为“开花前的”，既可指植物花前期，也可比喻处于萌芽、发展初期的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a plant blooms (in the stage leading up to flowering).","zh":"（植物）在开花之前的；花前期的。"},"examples":[{"en":"Use a low-nitrogen fertilizer during the preblooming stage to encourage buds.","zh":"在花前期使用低氮肥料有助于促进花芽形成。"},{"en":"The orchard needs careful watering in the preblooming weeks.","zh":"果园在开花前的几周需要细心浇水。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Early-stage; not yet fully developed or ready to appear.","zh":"（比喻）萌芽期的；尚未成熟、尚未显现的。"},"examples":[{"en":"Her preblooming talent became obvious after a few months of practice.","zh":"经过几个月练习，她尚在萌芽期的天赋就变得很明显。"},{"en":"The team had a preblooming idea for a new app, but it needed more testing.","zh":"团队对一款新应用有个萌芽期的想法，但还需要更多测试。"}]}],"synonyms":["pre-flowering","prebloom","bud-forming","early-stage","nascent"],"phonetic":"/ˌpriːˈbluːmɪŋ/","extraExplanation":["“pre-”表示“在……之前”，“bloom”是“开花”。因此“preblooming”常见于园艺/农业语境，描述“现蕾、花芽形成到开花前”的阶段。","书面语里也会用作比喻，表示“潜力正在形成但尚未完全展现”。"]}
{"word":"preboast","summary":{"en":"“Preboast” means to brag in advance; it’s a rare, nonstandard word.","zh":"“preboast”指“预先夸口/提前吹嘘”，但这是罕见且不太标准的用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To boast in advance; to brag before something actually happens or before results are known.","zh":"（罕见、非标准用法）预先夸口；事情还没发生或结果未明就先吹嘘。"},"examples":[{"en":"Don’t preboast about the exam—you haven’t seen the questions yet.","zh":"别在考试前就预先夸口——你还没看到题目呢。"},{"en":"He preboasted that his team would win, but they lost badly.","zh":"他赛前就吹嘘自己队一定会赢，但结果惨败。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, nonstandard) To boast about something beforehand (takes an object).","zh":"（罕见、非标准用法）对某事先夸口（可接宾语）。"},"examples":[{"en":"She preboasted her “guaranteed success” to everyone.","zh":"她把自己“必然成功”的说法提前对所有人吹了一遍。"}]}],"synonyms":["boast beforehand","brag in advance","make premature boasts","brag prematurely"],"phonetic":"ˌpriːˈboʊst","extraExplanation":["“preboast”在现代英语里非常少见，许多词典不收录；写作或正式场合更自然的表达通常是：boast beforehand / brag in advance / make premature boasts（过早吹嘘）。","构词上它由前缀“pre-（在……之前）”+“boast（夸口）”组成，因此意义比较直观，但因为不常用，读者可能会觉得别扭或不地道。"]}
{"word":"preboding","summary":{"en":"Foreboding means a feeling or sign that something bad is going to happen.","zh":"Foreboding 指一种预感或迹象，暗示不好的事情将要发生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a feeling, sign, or situation) suggesting that something bad is going to happen; giving a warning of trouble.","zh":"（感觉、迹象或局势）预示不祥的；不好的预兆感很强的。"},"examples":[{"en":"Dark clouds gathered, and the sky looked foreboding.","zh":"乌云密布，天空看起来很不祥。"},{"en":"There was a foreboding silence before the exam results were announced.","zh":"考试成绩公布前，有一种令人不安的沉默。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong feeling that something bad is going to happen; a sense of impending trouble.","zh":"一种强烈的“不好的事要发生了”的预感；不祥的预感。"},"examples":[{"en":"She couldn’t shake the foreboding that something would go wrong.","zh":"她摆脱不了一种预感：事情会出岔子。"},{"en":"His words filled me with foreboding.","zh":"他的话让我充满不祥的预感。"}]}],"synonyms":["ominous","threatening","sinister","premonition","apprehension"],"phonetic":"/fɔrˈboʊdɪŋ/","extraExplanation":["你输入的 **preboding** 很可能是 **foreboding** 的拼写误写；标准英语里常用的是 *foreboding*。","词源上，*fore-* 表示“在前、预先”，*bode* 表示“预示”。所以 *foreboding* 字面就是“预先预示（坏事）”。","文学和影视里，*foreboding* 常用来营造气氛（例如“foreboding atmosphere/forest/silence”），暗示后面会出现冲突或灾难。"]}
{"word":"preboil","summary":{"en":"“Preboil” means to boil something briefly before another cooking step.","zh":"“Preboil”指在进一步烹饪前先短时间煮（预煮/焯）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to boil something briefly before doing another cooking step (such as frying, roasting, or freezing)","zh":"（烹饪前）先短时间煮/焯一下，为后续步骤（如煎、烤、冷冻）做准备"},"examples":[{"en":"Preboil the potatoes for 10 minutes, then roast them until crispy.","zh":"把土豆先煮10分钟，然后再烤到外脆。"},{"en":"Some recipes ask you to preboil the noodles so they cook evenly later.","zh":"有些食谱会让你先把面条预煮一下，这样后面更容易均匀熟透。"}]}],"synonyms":["parboil","blanch (similar)","precook"],"phonetic":"/ˌpriːˈbɔɪl/","extraExplanation":["在英文食谱里，preboil 常用于“为缩短后续烹调时间/让食材更易熟/去除涩味或杂味”。和 blanch（焯水）很接近，但 blanch 更强调“短时间入沸水后立刻过冷水”以保持颜色与口感；preboil 不一定会过冷水，时间也可能稍长一些。"]}
{"word":"preboiled","summary":{"en":"Preboiled means already boiled in advance (or to boil beforehand), often used in cooking to save time.","zh":"preboiled 指“预先煮过的”（或“预先把……煮一下”），多用于烹饪语境，强调省时。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cooked in boiling water in advance; already boiled before being used or finished later.","zh":"预先用沸水煮过的；事先煮好的（之后再加工或直接使用）。"},"examples":[{"en":"Use preboiled potatoes to save time when making roasted potatoes.","zh":"做烤土豆时用预煮土豆可以省时间。"},{"en":"The recipe asks for preboiled noodles, then you stir-fry them with vegetables.","zh":"这个食谱需要预煮面条，然后和蔬菜一起炒。"}]},{"partOfSpeech":"vt.","definition":{"en":"To boil something beforehand.","zh":"把……预先煮一下。"},"examples":[{"en":"Preboil the shrimp for two minutes, then chill them.","zh":"把虾预煮两分钟，然后冰镇。"},{"en":"We preboiled the beans to shorten the cooking time.","zh":"我们把豆子预煮过，以缩短烹饪时间。"}]}],"synonyms":["parboiled","already boiled","precooked"],"phonetic":"/ˌpriːˈbɔɪld/","extraExplanation":["“pre-”表示“在……之前”，所以 preboiled 字面意思就是“事先煮过的”。常见于菜谱或食品包装，用来强调后续烹饪会更快。","在日常表达里也常用更通俗的说法：already boiled / parboiled（半熟预煮，通常时间更短、还没完全煮熟）。如果强调“煮到全熟”，preboiled 更贴近 “already boiled”。"]}
{"word":"preboiling","summary":{"en":"Preboiling means boiling briefly in advance to prepare food for the next cooking step.","zh":"preboiling 指烹饪前先短时间煮沸，用于为下一步做准备（预熟、去腥等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of boiling something briefly before cooking it further (often to partially cook or remove odors/impurities).","zh":"在进一步烹饪前，先把食材短时间煮沸的过程（常用于预熟、去腥、去杂质）。"},"examples":[{"en":"Preboiling the potatoes makes them roast faster and more evenly.","zh":"土豆先预煮一下，会让烤制更快、更均匀。"},{"en":"In some recipes, you preboil bones to remove blood and reduce the smell.","zh":"有些做法会先把骨头预煮，去血沫并减轻腥味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Boiled briefly in advance; partially boiled before another cooking step.","zh":"预先短时间煮过的；半熟的（通常为下一步烹饪做准备）。"},"examples":[{"en":"Use preboiling water when the instructions say to start with hot water.","zh":"如果说明要求用热水开始，就用预先烧开的水。"},{"en":"Add the preboiled noodles to the soup for the last two minutes.","zh":"把预煮过的面条在最后两分钟加入汤里。"}]}],"synonyms":["parboiling","blanching","pre-cooking"],"phonetic":"/ˌpriːˈbɔɪlɪŋ/","extraExplanation":["“preboil / preboiling”在食谱里很常见，常对应中文的“焯水/汆烫/预煮”。严格说，“焯水”多指短时间烫一下再捞出；“预煮”可能时间更长一些，目的是让食材部分熟化。","拼写提示：更常见的动词是“preboil”（先煮一下）；“preboiling”既可作名词（预煮这一步），也可作形容词（预煮过的）。在说明书里也可能看到“pre-boiling”这种加连字符的写法。"]}
{"word":"preboils","summary":{"en":"“Preboils” means “boils something briefly before the main cooking step.”","zh":"“preboils”指“在主要烹调前先把食材预煮一下”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to boil (food or an ingredient) briefly before the main cooking step; to parboil","zh":"（正式烹调前）先把（食材）预煮一下；汆烫"},"examples":[{"en":"She preboils the potatoes for 10 minutes, then roasts them until crisp.","zh":"她先把土豆预煮10分钟，然后再烤到外脆里软。"},{"en":"The recipe says he preboils the noodles so they don’t stick later.","zh":"食谱说他会先把面条预煮一下，这样后面就不容易粘在一起。"}]}],"synonyms":["parboils","blanches (in some contexts)"],"phonetic":"/ˌpriːˈbɔɪl/","extraExplanation":["“preboils”是动词“preboil”的第三人称单数现在时（he/she/it preboils）。在烹饪语境中常用于提高熟成速度、去除腥味或杂质、让后续煎/烤/炒更容易达到理想口感。","相关近义词：parboil（半煮/预煮）、blanch（焯水/汆烫，通常时间更短且常接冷水降温）。"]}
{"word":"preboom","summary":{"en":"Preboom means “before a boom,” describing a time or condition before rapid growth or popularity.","zh":"preboom 表示“繁荣/热潮之前”，用于描述快速增长或走红之前的时期或状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a period of rapid growth or popularity (a “boom”).","zh":"发生在某个快速增长或大热（“繁荣/热潮”）之前的；繁荣前的。"},"examples":[{"en":"The city was much quieter in the preboom years.","zh":"在繁荣到来之前的那些年，这座城市安静得多。"},{"en":"Preboom housing prices were low compared with today.","zh":"与今天相比，繁荣前的房价很低。"}]},{"partOfSpeech":"n.","definition":{"en":"The time or situation before a boom period.","zh":"繁荣（热潮）发生之前的时期或阶段。"},"examples":[{"en":"They bought the land in the preboom and made a big profit later.","zh":"他们在繁荣前买下那块地，后来赚了很多。"},{"en":"Life felt stable in the preboom, before everything sped up.","zh":"在繁荣前、在一切加速之前，生活感觉更稳定。"}]}],"synonyms":["pre-boom","before-the-boom","prior-to-the-boom","early-stage"],"phonetic":"/ˌpriːˈbuːm/","extraExplanation":["“preboom”更常见的写法是带连字符的“pre-boom”（尤其在新闻、学术写作里更清晰）。在口语或非正式写作中，有时会连写成“preboom”。","常用搭配：pre-boom prices（繁荣前的价格）, pre-boom era/years（繁荣前的年代）, pre-boom conditions（繁荣前的状况）。"]}
{"word":"preborn","summary":{"en":"Preborn means “before birth; unborn,” and it’s often used in abortion-related discussions.","zh":"Preborn 意为“出生前的；未出生的”，并常见于与堕胎相关的公共讨论中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a baby or life) existing before birth; unborn.","zh":"（指婴儿或生命）出生前的；未出生的。"},"examples":[{"en":"Some religions teach that a preborn child has a soul.","zh":"一些宗教认为未出生的孩子拥有灵魂。"},{"en":"The clinic provides support for people who want to protect preborn life.","zh":"这家机构为希望保护未出生生命的人提供支持。"}]}],"synonyms":["unborn","prenatal","in utero"],"phonetic":"/ˌpriːˈbɔrn/","extraExplanation":["“preborn”在日常英语里不如“unborn”常见，更多出现在美国关于堕胎（abortion）的公共讨论中，常被用来强调“胎儿也是生命/孩子”的立场，因此带有明显的立场色彩。写作或正式交流中，如果想保持中性，通常用“unborn baby / fetus / unborn child”等更常见、更客观的表达。"]}
{"word":"preborrowing","summary":{"en":"Preborrowing means borrowing money in advance, before it is immediately needed, often for planning or to lock in interest rates.","zh":"Preborrowing 指“提前借款”，即在尚未立刻需要资金时先借入，常用于资金规划或锁定利率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of borrowing money earlier than needed, usually to ensure funding is available in advance (often used in government or project finance).","zh":"提前借款；在真正需要资金之前先借入资金（常见于政府或项目融资语境）。"},"examples":[{"en":"The city used preborrowing to lock in lower interest rates before starting the construction project.","zh":"该市通过提前借款在开工前锁定了较低的利率。"},{"en":"Preborrowing can provide cash stability, but it may increase short-term debt levels.","zh":"提前借款能提高现金流稳定性，但可能会在短期内推高债务水平。"}]},{"partOfSpeech":"v.","definition":{"en":"Borrowing in advance; to take out a loan before the money is immediately required.","zh":"提前借入；在资金尚未立刻需要时就先贷款/借款。"},"examples":[{"en":"Some agencies are preborrowing to cover expected costs later in the year.","zh":"一些机构正在提前借款，以支付今年晚些时候的预期支出。"},{"en":"If you’re preborrowing, make sure you have a clear plan for holding the cash safely.","zh":"如果你要提前借款，务必对资金如何安全存放有明确计划。"}]}],"synonyms":["borrow in advance","borrow ahead of time","advance borrowing"],"phonetic":"/ˌpriːˈbɑːroʊɪŋ/","extraExplanation":["“preborrowing”不是日常英语高频词，更常见于公共财政与债务管理（如政府在预算年度内提前发行债券/借款），目的是提前备足资金或在利率较低时先融资。","含义通常带有策略性：好处是提早锁定资金与利率；潜在问题是增加持有现金的成本（利息支出、资金闲置）以及账面短期债务上升。","更常见的表达有：“borrow in advance / borrow ahead of time”。在正式文件中也可能看到“pre-borrowing”（带连字符）。"]}
{"word":"prebound","summary":{"en":"“Prebound” usually describes books that are bound in a durable hard cover before sale or library use; it can also mean to bind a book in advance.","zh":"prebound 通常指书在出售或入馆前被预先加固装订成耐用精装；也可作动词，指提前装订。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a book) bound into a hard cover by a publisher or library supplier before it is sold or placed in a library, usually to make it more durable.","zh":"（书）在出售或入馆前由出版社或图书馆供应商预先装订成精装（硬壳），通常为提高耐用性。"},"examples":[{"en":"The library ordered a prebound edition to survive heavy student use.","zh":"图书馆订购了预装订版，以便经得住学生高频使用。"},{"en":"Prebound books cost more, but they last longer than paperbacks.","zh":"预装订书更贵，但比平装书更耐用。"}]},{"partOfSpeech":"vt.","definition":{"en":"To bind (a book) in advance, especially into a sturdy cover for library circulation.","zh":"（尤指为图书馆流通）提前把（书）装订好，通常装成更结实的封面。"},"examples":[{"en":"Some vendors prebound the titles before shipping them to schools.","zh":"一些供应商会在发货到学校前先把书预装订好。"},{"en":"They decided to prebound the most popular novels to reduce damage.","zh":"他们决定把最受欢迎的小说先预装订，以减少损坏。"}]}],"synonyms":["library-bound","library binding (related)","reinforced binding (related)","pre-bind"],"phonetic":"/ˌpriˈbaʊnd/","extraExplanation":["“prebound”常见于北美图书馆与教材采购语境，指“为图书馆耐用度而做的加固精装”。它并不等同于普通“hardcover（精装）”：精装是出版形态；prebound更强调“在流通前做的耐用装订/加固服务”。","相关对比：paperback（平装）通常更便宜但更易磨损；library binding（图书馆装订/馆藏加固装订）强调更结实的封面、书脊与胶装/线装工艺。"]}
{"word":"preboyhood","summary":{"en":"Preboyhood means “before boyhood,” referring to a boy’s early childhood years (a rare, literary/formal word).","zh":"preboyhood 意为“男童期之前”，指男孩较早的童年阶段（较少见，多用于文学或正式语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) relating to the time before a boy reaches boyhood; pre-adolescent childhood.","zh":"（罕见）与“男孩进入男童期之前”的阶段有关；指男孩的前青春期/较早的童年阶段。"},"examples":[{"en":"The novel describes his preboyhood days in a quiet village.","zh":"这部小说描写了他在宁静乡村的“男童期之前”的日子。"},{"en":"In his preboyhood years, he learned to read from his grandmother.","zh":"在他进入男童期之前的那些年里，他跟祖母学会了阅读。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the period of time before boyhood.","zh":"（罕见）男童期之前的一段时期。"},"examples":[{"en":"The biography spends only one chapter on his preboyhood.","zh":"这本传记只用一章写了他男童期之前的阶段。"}]}],"synonyms":["early childhood","childhood","pre-adolescence","boyhood (as a contrast)"],"phonetic":"/ˌpriːˈbɔɪhʊd/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ boyhood（“男童期/少年时期”）构成，多见于较正式或文学性的写作里，用来强调“在进入男孩较独立、较具社会角色的阶段之前”的时期。日常英语更常用 childhood（童年）、early childhood（幼年）、pre-adolescence（青春期前）等表达。","拼写上常见连字符形式 pre-boyhood；不加连字符的 preboyhood 更少见。"]}
{"word":"prebrachial","summary":{"en":"An uncommon anatomy term meaning “in front of/before the upper arm (brachial) region.”","zh":"一个较少见的解剖学用词，表示“在上臂（肱部）之前/前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in front of, or occurring before, the brachial region (the upper arm); used mainly in anatomical descriptions.","zh":"位于肱部（上臂）之前的；或在解剖学描述中指“在肱部之前/先于肱部发生的”。"},"examples":[{"en":"The report noted mild swelling in the prebrachial soft tissues.","zh":"报告指出上臂前方（肱部之前）的软组织有轻度肿胀。"},{"en":"A small incision was made in a prebrachial position to avoid major vessels.","zh":"为了避开主要血管，切口选择在上臂前方的位置。"}]}],"synonyms":["pre-brachial","anterior to the brachium (phrase)","brachial (related)"],"phonetic":"/ˌpriːˈbreɪkiəl/","extraExplanation":["这个词由前缀 pre-（“在……之前/预先”）+ brachial（“肱的、上臂的”）构成，但在现代英语里非常少见，通常只在医学/解剖学语境中出现。","如果你想表达“前臂”的常用医学/解剖学词，更常见的是 antebrachial（前臂的）或直接用 forearm（前臂）。"]}
{"word":"prebrachium","summary":{"en":"A rare anatomical word meaning “forearm.”","zh":"一个罕用的解剖学词，意思是“前臂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, anatomy) the forearm; the part of the arm between the elbow and the wrist.","zh":"（罕用，解剖）前臂；位于肘与腕之间的那段手臂。"},"examples":[{"en":"The injury affected the prebrachium, making it painful to rotate the wrist.","zh":"伤势影响到前臂（prebrachium），转动手腕时会疼。"},{"en":"In older anatomical writing, “prebrachium” may be used where modern texts prefer “forearm” or “antebrachium.”","zh":"在较早的解剖学写作中，prebrachium 有时用来表达现代更常说的 forearm 或 antebrachium。"}]}],"synonyms":["forearm","antebrachium"],"phonetic":"/priːˈbreɪkiəm/","extraExplanation":["这个词非常少见，多出现在较旧或较专业的解剖学语境中。日常英语几乎不用，通常直接说 forearm。","词源上可拆为 pre-（在前）+ brachium（拉丁语“上臂/臂”）。不过现代解剖学里更常见、也更标准的是 antebrachium（前臂）。"]}
{"word":"prebranchial","summary":{"en":"Prebranchial means “in front of the gill (branchial) region,” mainly used in anatomy and embryology.","zh":"Prebranchial 指「位於鰓（鰓弓）區之前的」，多用於解剖學與胚胎學語境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/embryology) Located in front of the gills or the gill (branchial) region; relating to structures that occur before the gill area.","zh":"（解剖／胚胎學）位於鰓或鰓（鰓弓）區之前的；與出現在鰓區前方的結構有關的。"},"examples":[{"en":"In some fish, the prebranchial region includes parts of the head that lie before the gill openings.","zh":"在一些魚類中，prebranchial 區域包括位於鰓裂之前的頭部部分。"},{"en":"Researchers measured prebranchial length to compare head shapes across species.","zh":"研究人員測量 prebranchial length（鰓前長度）來比較不同物種的頭部形狀。"}]}],"synonyms":["anterior to the gills","pregill (less common)"],"phonetic":"/ˌpriːˈbræŋkiəl/","extraExplanation":["pre- 表示「在……之前」，branchial 來自「gills（鰓）」或「branchial arches（鰓弓）」。因此 prebranchial 常用於魚類解剖或脊椎動物胚胎學，描述「鰓區前方」的位置或結構。常見搭配如 prebranchial region / prebranchial length。"]}
{"word":"prebreakfast","summary":{"en":"Prebreakfast means “before breakfast,” usually describing an activity; less commonly, it can mean a small snack or drink taken before breakfast.","zh":"prebreakfast 表示“早餐前的”，多用于描述活动；较少情况下也可指早餐前吃的少量点心或饮品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before breakfast.","zh":"（在）早餐之前发生的；早餐前进行的。"},"examples":[{"en":"I went for a prebreakfast walk to wake up.","zh":"我在吃早餐前散步，让自己清醒一下。"},{"en":"She prefers prebreakfast exercise, then coffee.","zh":"她喜欢早餐前运动，然后再喝咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"A small snack or drink taken before breakfast (less common).","zh":"早餐前吃的少量点心或饮品（较少见用法）。"},"examples":[{"en":"He had a prebreakfast banana because he was hungry.","zh":"他饿了，早餐前先吃了一根香蕉。"},{"en":"A cup of tea served as my prebreakfast.","zh":"一杯茶就是我的“早餐前小食”。"}]}],"synonyms":["before breakfast","pre-breakfast","early-morning (context-dependent)"],"phonetic":"/priˌbrɛkfəst/","extraExplanation":["“prebreakfast”在日常英语里不算常见，更常写作“pre-breakfast”（带连字符）或直接说“before breakfast”。作为形容词用最自然：pre-breakfast walk/exercise/meeting。","在英国文化语境里，“pre-breakfast”常见于酒店行程或活动安排（如pre-breakfast swim）。在文学里也能见到更夸张的用法：例如《霍比特人》中提到的“first breakfast / second breakfast”，因此也有人半开玩笑说“pre-breakfast”。"]}
{"word":"prebreathe","summary":{"en":"To breathe oxygen beforehand to prepare safely for a low-pressure/low-oxygen environment.","zh":"为安全进入低气压/低氧环境而提前吸氧（预呼吸）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to breathe pure oxygen (or a special gas mix) for a period of time before going into a low-pressure or low-oxygen environment, to reduce nitrogen in the body and lower the risk of decompression sickness (“the bends”)","zh":"（在进入低气压或低氧环境前）预先呼吸纯氧（或特定混合气体）一段时间，以减少体内氮气、降低减压病（“潜水夫病/弯曲病”）风险"},"examples":[{"en":"Astronauts prebreathe oxygen before a spacewalk.","zh":"宇航员在出舱执行太空行走前会预先呼吸氧气。"},{"en":"The crew had to prebreathe for an hour before entering the low-pressure suit.","zh":"机组人员在进入低压宇航服前必须预呼吸一小时。"}]}],"synonyms":["preoxygenate","denitrogenate (context-specific)","oxygen prebreathe (phrase)"],"phonetic":"/ˌpriːˈbriːð/","extraExplanation":["“prebreathe”常见于航天与高空/低压作业（如太空行走、低压舱、某些高空飞行）等语境。这样做的核心目的是“脱氮”（denitrogenation）：把血液和组织中的氮气尽量排出，避免压力突然变化时产生气泡。","在一般日常英语里很少用到；更常见的相关表达有“prebreathe protocol（预呼吸流程）”“oxygen prebreathe（氧气预呼吸）”。"]}
{"word":"prebreathed","summary":{"en":"Prebreathed is a rare, poetic word meaning “breathed beforehand,” often suggesting air or spirit already present.","zh":"prebreathed 是罕见的诗性用词，意为“预先呼吸过的/先行吹入气息的”，常用来暗示空气或灵性早已存在。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(poetic/rare) Breathed in earlier; filled with breath beforehand, as if life or spirit was put into something before it appears.","zh":"（诗歌/罕用）预先吸入的；（仿佛）在出现之前就被先行吹入气息/生命的。"},"examples":[{"en":"In the poem, dawn arrives with a prebreathed calm, as if the air has already been softened.","zh":"在诗中，黎明带着一种“预先呼吸过的”宁静到来，仿佛空气早已被柔化。"},{"en":"She described the room as prebreathed—warm with the presence of people who had just left.","zh":"她形容那间房间是“预先呼吸过的”——还带着刚离开的人留下的温热气息。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of a rare verb form meaning “to breathe beforehand” or “to breathe into in advance.”","zh":"（罕用动词形式的过去分词）意为“预先呼吸/先吸入”，或“提前向……吹入气息”。"},"examples":[{"en":"The myth says the statue was prebreathed with life before it opened its eyes.","zh":"神话说，那座雕像在睁眼前就已被提前吹入生命。"}]}],"synonyms":["already breathed","previously breathed","breathed into beforehand","pre-infused (figurative)"],"phonetic":"/priˈbrɛðd/","extraExplanation":["“pre-”表示“在……之前/预先”，加在 breathe（呼吸）前形成非常少见、偏文学的表达。现代英语里更常用的说法是 already breathed, previously breathed, breathed into beforehand 等。","这种词形常见于诗歌或宗教/神话语境，用来营造“生命/灵性被注入”的意象感，比普通的 “breathed” 更强调“先行、预备”的氛围。"]}
{"word":"prebreathing","summary":{"en":"Breathing (often pure oxygen) beforehand to reduce nitrogen in the body and prevent decompression sickness in low-pressure situations.","zh":"事先吸入（常为纯氧）以降低体内氮气、预防低压环境下减压病的预呼吸过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Breathing a specific gas (often pure oxygen) before exposure to low pressure (such as in spacewalks or high-altitude operations) or before certain dives, in order to remove dissolved nitrogen from the body and reduce the risk of decompression sickness.","zh":"在进入低气压环境（如太空行走、高空作业）或某些潜水前，先按规定吸入特定气体（常为纯氧），以加速体内氮气排出、降低减压病风险的“预先呼吸/预呼吸”过程。"},"examples":[{"en":"Astronauts do prebreathing before a spacewalk to lower the risk of decompression sickness.","zh":"宇航员在太空行走前会进行预先呼吸，以降低减压病的风险。"},{"en":"The protocol requires two hours of prebreathing oxygen before entering the low-pressure suit.","zh":"流程要求在进入低压航天服前先预呼吸氧气两小时。"}]}],"synonyms":["oxygen pre-breathe","pre-breathe (O2)","denitrogenation"],"phonetic":"/ˈpriːˌbriːðɪŋ/","extraExplanation":["“prebreathing”常见于航天与航空医学语境：人在常压下体内会溶解一定量的氮气；若突然进入低压环境，氮气可能形成气泡，引发减压病（关节痛、皮疹、严重时神经症状）。预呼吸纯氧会减少体内氮含量，从而降低风险。","在潜水领域也可能遇到类似概念，但更常见的说法是“oxygen pre-breathe / pre-breathe O2”或与“decompression”流程一起讨论；具体时长、气体与步骤必须遵循机构/教练的安全规范。"]}
{"word":"prebridal","summary":{"en":"“Prebridal” means “before the wedding” and describes events or preparations leading up to the wedding.","zh":"“Prebridal”表示“婚前的”，用来形容婚礼前的活动或准备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a wedding; related to events and preparations before the wedding day.","zh":"婚前的；与婚礼前的活动或准备有关的。"},"examples":[{"en":"She planned a prebridal dinner for close family members.","zh":"她为亲近的家人安排了一场婚前晚餐。"},{"en":"Prebridal events can include a shower, rehearsal dinner, and fittings.","zh":"婚前活动可能包括新娘送礼会、彩排晚宴和试装。"}]}],"synonyms":["before-the-wedding","premarital","wedding-prep"],"phonetic":"/ˌpriˈbraɪdəl/","extraExplanation":["“Pre-”是英语里很常见的前缀，表示“在……之前”。所以 prebridal = pre-（之前）+ bridal（新娘的／婚礼的）。","这个词在日常口语里不算最常见，很多时候人们会更常说“before the wedding”或“wedding-related events before the wedding”。","与 bridal shower（新娘送礼会）不同，prebridal 是更泛的形容词，可以修饰 events / parties / counseling / preparations 等。"]}
{"word":"prebroadcasting","summary":{"en":"Prebroadcasting means doing or relating to broadcasting in advance, especially pre-broadcast preparation and checks.","zh":"prebroadcasting 指预先播出，或与“播出前准备/检查”相关的流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of broadcasting something in advance, or preparing content right before it is broadcast (especially in radio/TV/streaming workflows)","zh":"（广播/电视/直播等）预先播出；或指播出前的内容准备与制作流程（行业用法）"},"examples":[{"en":"The network spent the morning prebroadcasting election updates to regional stations.","zh":"该电视网上午向各地区台预先播出了选举最新消息。"},{"en":"Prebroadcasting checks help catch audio problems before the show goes live.","zh":"播出前的预播检查有助于在节目直播前发现音频问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening before something is broadcast; done as a pre-broadcast step","zh":"在播出之前进行的；作为播出前步骤完成的"},"examples":[{"en":"A prebroadcasting rehearsal was scheduled for 2 p.m.","zh":"下午两点安排了一次播出前彩排。"},{"en":"They ran prebroadcasting captions to make sure the timing was correct.","zh":"他们先跑了一遍播出前字幕，以确认时间轴无误。"}]}],"synonyms":["pre-broadcasting","prebroadcast","pre-broadcast","advance broadcasting","pre-airing"],"phonetic":"/ˌpriːˈbrɔːdˌkæstɪŋ/","extraExplanation":["“prebroadcasting”不是最常见的日常词，更常见的说法有“pre-broadcast”（播出前的）或“prebroadcast”（作形容词/名词）。在媒体行业里，它通常指播出前的测试、审片/审听、字幕对时、信号链路检查等流程。"]}
{"word":"prebromidic","summary":{"en":"Prebromidic is a rare/nonstandard form, usually a misspelling of perbromidic, meaning “related to perbromidic acid (HBrO₄).”","zh":"prebromidic 很罕見且不標準，通常是 perbromidic 的誤拼，意思是「與過溴酸（HBrO₄）有關的」。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to perbromidic acid (HBrO₄) or its salts; the highest-oxidation-state bromine oxyacid system (often spelled “perbromidic”).","zh":"（化學）與過溴酸（HBrO₄）或其鹽有關；指溴在最高氧化態的含氧酸體系（更常見拼法為 perbromidic）。"},"examples":[{"en":"Perbromidic acid is named by analogy with perchloric acid.","zh":"過溴酸的命名方式類比於高氯酸（perchloric acid）。"},{"en":"In some texts, “prebromidic” appears as a misspelling of “perbromidic.”","zh":"在一些資料中，“prebromidic” 可能是 “perbromidic” 的拼寫錯誤。"}]}],"synonyms":["perbromidic","perbromic"],"phonetic":"/ˌpɝːbroʊˈmɪdɪk/","extraExplanation":["「prebromidic」並不是常見或標準的英語化學用語；在命名規則中，表示「最高含氧酸」通常用前綴 per-（如 perchloric、perbromic / perbromidic）。因此你看到的「prebromidic」多半是把 per- 誤寫成 pre-。","化學命名小提示：bromic acid（溴酸，HBrO₃）→ perbromic/perbromidic acid（過溴酸，HBrO₄）；對應的陰離子常見寫法是 perbromate（過溴酸根）。"]}
{"word":"prebronchial","summary":{"en":"Prebronchial means “in front of a bronchus,” used mainly in medical/anatomy contexts.","zh":"prebronchial 指“在支气管前方的”，主要用于医学与解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Located in front of a bronchus (one of the main air passages leading into the lungs).","zh":"（解剖/医学）位于支气管前方的；在支气管前面的。"},"examples":[{"en":"The CT report noted a small prebronchial lymph node.","zh":"CT报告提到一个小的支气管前淋巴结。"},{"en":"Inflammation was seen in the prebronchial region.","zh":"在支气管前区域可见炎症。"}]}],"synonyms":["anterior to the bronchus","pre-bronchial (variant spelling)"],"phonetic":"/ˌpriːˈbrɑːŋkiəl/","extraExplanation":["这个词由前缀 pre-（“在……之前/前方”）+ bronchial（“支气管的”）构成，属于医学影像与解剖学里用来描述“相对位置”的形容词。","在临床语境中，它常用于描述淋巴结、肿块、或病变的位置（例如影像学报告中），帮助医生判断病灶与气道结构的关系。"]}
{"word":"prebronze","summary":{"en":"Prebronze means “before the use of bronze / before the Bronze Age.”","zh":"prebronze 指“青铜使用之前／青铜时代之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaeology/history) Happening before the use of bronze or before the Bronze Age; earlier than bronze-working societies.","zh":"（考古/历史）发生在青铜使用之前的；青铜时代之前的；早于青铜冶炼社会的。"},"examples":[{"en":"The site has a prebronze layer with stone tools and simple pottery.","zh":"这个遗址有一层青铜时代之前的地层，出土石器和简单陶器。"},{"en":"Researchers compared prebronze settlements with later Bronze Age towns.","zh":"研究人员把前青铜时代的聚落与后来的青铜时代城镇作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"The time period before the Bronze Age or before bronze technology in a particular region.","zh":"（某地区）青铜时代之前的时期；青铜技术出现之前的阶段。"},"examples":[{"en":"In this region, the prebronze lasted much longer than expected.","zh":"在这个地区，前青铜时期持续的时间比预期更长。"}]}],"synonyms":["pre-Bronze","pre-Bronze Age","prehistoric (context-dependent)","Stone Age (context-dependent)"],"phonetic":"/ˌpriːˈbrɑːnz/","extraExplanation":["“prebronze”在英语中非常少见，更常见的写法是加连字符的“pre-Bronze”或“pre-Bronze Age”，也常用更标准的术语“Chalcolithic”（铜石并用时代）或“Neolithic”（新石器时代），具体取决于地区与年代分期。","学术写作里通常需要说明“before bronze in this region”，因为不同地区进入青铜时代的时间并不相同。"]}
{"word":"prebrute","summary":{"en":"“Prebrute” is informal jargon meaning preparation done before a brute-force attempt (or to do that preparation).","zh":"“prebrute”是非正式术语，指在暴力破解前的准备工作（或进行这些准备）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, cybersecurity/CTF) Done before a brute-force attempt; used to describe preparation steps that make brute-forcing easier or faster.","zh":"（非正式，网络安全/CTF）在暴力破解（brute force）之前进行的；指为暴力破解做的准备步骤，用来提高效率或成功率。"},"examples":[{"en":"We did some prebrute work by narrowing the password list to common patterns.","zh":"我们先做了些 prebrute 的工作，把密码列表缩小到常见模式。"},{"en":"Prebrute checks like rate-limit testing can save time later.","zh":"像测试限速这种 prebrute 的检查，之后能省不少时间。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To do preparation before brute-forcing, such as collecting hints, filtering wordlists, or testing lockout rules.","zh":"（非正式）在暴力破解前做准备工作，例如收集线索、筛选字典、测试锁定/限速规则等。"},"examples":[{"en":"Let’s prebrute the login page to see if it blocks repeated attempts.","zh":"我们先 prebrute 一下登录页，看看它会不会拦截重复尝试。"},{"en":"They prebruted the dataset and removed duplicates before running the brute-force tool.","zh":"他们在跑暴力破解工具前先 prebrute 处理数据集，去掉了重复项。"}]}],"synonyms":["pre-brute","pre-bruteforce","preparation","reconnaissance (recon)","profiling"],"phonetic":"/ˌpriːˈbruːt/","extraExplanation":["“prebrute”不是标准英语词汇，更常见的写法是带连字符的“pre-brute”，或直接说“pre-brute-force steps / reconnaissance / preparation”。","在网络安全语境中，“brute force（暴力破解）”通常指大量尝试密码/密钥；“prebrute”强调在真正开始大量尝试前，通过信息收集、缩小搜索空间、验证限制策略等方式提高效率。使用时建议根据场合改为更正式的表达。"]}
{"word":"prebuccal","summary":{"en":"Prebuccal means located in front of the cheek (buccal) area, mainly used in medical/dental contexts.","zh":"prebuccal 指“位于颊部之前的”，主要用于医学/牙科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Situated in front of the cheek (buccal) region, especially in dentistry or anatomy.","zh":"位于颊部（buccal，脸颊）之前的；多用于牙科或解剖学语境。"},"examples":[{"en":"The dentist noted a prebuccal swelling near the lower molars.","zh":"牙医注意到下磨牙附近有颊前部的肿胀。"},{"en":"In the report, the lesion was described as prebuccal rather than buccal.","zh":"在报告中，该病灶被描述为颊前部，而不是颊部。"}]}],"synonyms":["anterior to the buccal region","pre-cheek (rare)"],"phonetic":"/ˌpriːˈbʌkəl/","extraExplanation":["词源提示：pre- 表示“在……之前/前方”，buccal 来自拉丁语 bucca（脸颊）。因此 prebuccal 字面意思就是“在脸颊之前的（部位）”。","使用场景：这是偏专业的医学/牙科形容词，日常英语中很少用。更常见的相关词是 buccal（颊侧的）与 oral（口腔的）。"]}
{"word":"prebudget","summary":{"en":"Prebudget (often pre-budget) refers to things happening before an official budget announcement, especially in politics and news.","zh":"Prebudget（常写作 pre-budget）指在正式公布预算之前发生或进行的事情，常用于政治与新闻语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often hyphenated: pre-budget) happening or done before a government or organization officially announces its budget.","zh":"（常写作 pre-budget）在政府或机构正式公布预算之前发生的；预算公布前进行的。"},"examples":[{"en":"The finance minister gave a pre-budget speech to outline priorities.","zh":"财政部长发表了预算公布前的讲话，概述优先事项。"},{"en":"Markets reacted to pre-budget rumors about new taxes.","zh":"市场对有关新税收的预算前传闻作出了反应。"}]},{"partOfSpeech":"n.","definition":{"en":"Information, commentary, or events that occur before the budget announcement (especially in news and politics).","zh":"（尤用于新闻与政治）预算公布前的消息、评论或事件。"},"examples":[{"en":"The report is part of the prebudget coverage on TV.","zh":"这份报道属于电视上的预算前报道内容。"},{"en":"Journalists focused on the prebudget debate in parliament.","zh":"记者把注意力放在议会里的预算前辩论上。"}]}],"synonyms":["pre-budget","ahead of the budget","before the budget announcement","budget-preview"],"phonetic":"/ˌpriˈbʌdʒɪt/","extraExplanation":["拼写上常见两种：pre-budget（更常见、也更清晰）与 prebudget（较少见）。在正式写作中，尤其是新闻标题或政策文件里，常用带连字符的形式。","这个词多见于英国、加拿大、澳大利亚等国家的公共财政语境（如“预算案公布前的声明/讨论”）。在美国语境里也能理解，但更常直接说 “before the budget announcement” 或 “ahead of the budget release”。"]}
{"word":"prebudgetary","summary":{"en":"“Prebudgetary” describes things happening before the official budget is made or approved.","zh":"“prebudgetary”指发生在预算正式制定或批准之前的事项（预算前的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time or actions before a budget is officially prepared, presented, or approved.","zh":"与预算正式编制、提交或批准之前的时间或活动有关的。"},"examples":[{"en":"The finance team held several prebudgetary meetings to gather department requests.","zh":"财务团队召开了几次预算前会议，以收集各部门的需求。"},{"en":"Prebudgetary planning helps the company avoid surprises later in the year.","zh":"预算前规划有助于公司在年内避免后续出现意外情况。"}]}],"synonyms":["pre-budget","budget-planning","budget preparation","ahead of the budget"],"phonetic":"/ˌpriˌbʌdʒəˈtɛri/","extraExplanation":["这个词由 pre-（“在……之前”）+ budgetary（“预算的”）构成，常见于政府财政或大型机构的正式写作中。日常英语里更常说：before the budget / ahead of the budget / budget-planning.","synonyms与相关表达：pre-budget（更常见，尤其英式英语中常写作 pre-budget statement）、budget planning、budget preparation、budget cycle（预算周期）。"]}
{"word":"prebuilt","summary":{"en":"Prebuilt means made ahead of time and ready to use, often in construction or technology.","zh":"prebuilt 指“预先做好的、现成可用的”，常用于建筑（预制）或科技（预编译/现成组件）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made in advance and ready to use; not built from scratch on site","zh":"预先做好的；现成的；不是在现场从零开始建造的"},"examples":[{"en":"We used a prebuilt website template to launch the store quickly.","zh":"我们用一个预先做好的网页模板，快速上线了商店。"},{"en":"The cabin is prebuilt in a factory and then shipped to the site.","zh":"这间小木屋是在工厂预制好，然后运到现场的。"}]},{"partOfSpeech":"n.","definition":{"en":"a building, module, or component that is made ahead of time and then installed or assembled later","zh":"预制件；预制建筑（或模块/部件），先做好再安装或组装"},"examples":[{"en":"They ordered a prebuilt and had it delivered to the construction site.","zh":"他们订购了一套预制建筑，并送到工地。"}]}],"synonyms":["prefabricated","prefab","ready-made","preassembled"],"phonetic":"/ˌpriːˈbɪlt/","extraExplanation":["在建筑领域，prebuilt 常和 prefabricated / prefab（预制的）意思相近：强调“在工厂先做成，再到现场安装”。","在科技领域，prebuilt 常见于软件/代码语境，比如 prebuilt binaries（预编译好的可执行文件）或 prebuilt components（现成组件），意思是“已经做好、可直接使用”。","拼写上也常见 pre-built（加连字符）和 prebuilt（不加连字符），含义基本相同；作定语时两种都常见。"]}
{"word":"prebullying","summary":{"en":"Prebullying refers to early warning signs or situations that come before clear bullying and may develop into it.","zh":"Prebullying 指明显霸凌发生前的早期警讯或情境，可能进一步发展成霸凌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Education/psychology) Early actions, warning signs, or conditions that happen before clear bullying begins.","zh":"（教育/心理学）在明显霸凌发生之前出现的早期行为、警讯或环境条件。"},"examples":[{"en":"Teachers look for prebullying behaviors like repeated teasing and exclusion.","zh":"老师会留意像反复取笑、排挤这类“霸凌前期”行为。"},{"en":"Addressing prebullying can stop a small problem from becoming bullying.","zh":"处理霸凌前期状况能阻止小问题发展成霸凌。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that happens or is used before bullying starts, especially to prevent it.","zh":"（形容词用法）指在霸凌开始前发生的，或用于预防霸凌的。"},"examples":[{"en":"The school launched a prebullying intervention program.","zh":"学校启动了一个霸凌前期介入计划。"},{"en":"Parents asked for prebullying guidance for younger students.","zh":"家长为低年级学生咨询霸凌前期的应对指导。"}]}],"synonyms":["early signs of bullying","bullying precursors","pre-bullying behaviors","early-stage bullying behaviors"],"phonetic":"/ˌpriːˈbʊliɪŋ/","extraExplanation":["“prebullying”不是非常常见的标准词，更常见的表达包括：\n- “early signs of bullying”（霸凌的早期迹象）\n- “bullying precursors”（霸凌的前兆/先导因素）\n- “pre-bullying behaviors”（霸凌前期行为）\n写作时如果担心读者不熟悉，可以用这些更常见的说法，或第一次出现时加一句解释。"]}
{"word":"preburlesque","summary":{"en":"“Preburlesque” means before burlesque (as a style or event).","zh":"“preburlesque”指在 burlesque（滑稽戏仿风格/表演）形成或某场演出之前的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before burlesque (as a style, genre, or performance) became established or before a particular burlesque show/event.","zh":"发生在滑稽歌舞/脱口秀式表演（burlesque）形成或流行之前的；在某场 burlesque 演出/事件之前的。"},"examples":[{"en":"The director described the film as preburlesque, made before burlesque comedy became popular on stage.","zh":"导演把这部电影称为 preburlesque——它拍摄于舞台 burlesque 喜剧流行之前。"},{"en":"Her early sketches feel preburlesque: playful, but not yet built around parody and exaggeration.","zh":"她早期的短剧给人一种 preburlesque 的感觉：很俏皮，但还没有以戏仿和夸张为核心。"}]}],"synonyms":["pre-burlesque","before burlesque","early","proto-burlesque"],"phonetic":"/ˌpriːbɝˈlɛsk/","extraExplanation":["这个词很少见，通常是由前缀 pre-（“在……之前”）+ burlesque 组合而成，用来做时间或风格上的标记。","burlesque 在英语里常指“以夸张、戏仿为特色的滑稽表演/戏剧风格”，也常与带歌舞元素的成人舞台表演相关；具体含义要看语境。"]}
{"word":"preburn","summary":{"en":"Preburn means to burn an area ahead of time (or the area that was burned) to reduce fuel and help control future fire.","zh":"preburn 指为降低火灾风险而提前燃烧某片区域（或指预先烧出的区域），以清除可燃物、帮助控火。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to burn an area intentionally before a planned event (such as a larger controlled burn, construction, or military training) in order to remove fuel and reduce the risk or intensity of later fire.","zh":"（为降低之后火灾风险或强度）在计划活动之前，先对某片区域进行有意燃烧（预烧），以清除可燃物。"},"examples":[{"en":"Fire crews preburned a strip of grass to create a safer firebreak.","zh":"消防人员先预烧了一条草带，形成更安全的防火隔离带。"},{"en":"They plan to preburn the hillside before the main prescribed burn.","zh":"他们计划在主要的计划燃烧之前先对山坡进行预烧。"}]},{"partOfSpeech":"n.","definition":{"en":"a deliberately burned area made in advance, especially as part of wildfire control.","zh":"（尤指用于野火防控的）预先烧出的区域；预烧带。"},"examples":[{"en":"The preburn helped slow the wildfire as it reached the ridge.","zh":"野火到达山脊时，预烧带帮助减缓了火势。"}]}],"synonyms":["pre-burn","burn off","fuel reduction burn","prescribed burn (related)","backburn (related)"],"phonetic":"/ˌpriːˈbɝn/","extraExplanation":["“preburn”常见于野火管理与生态保护语境，和“prescribed burn（计划燃烧/控烧）”“backburn（反烧）”有关：预烧通常是更大行动前的准备步骤，用来清除可燃物、建立隔离带，降低火势蔓延。","拼写上也常见作“pre-burn”（带连字符），意思相同；在学术或管理文件中更常用“preburn”或“pre-burn”作为动词/名词。"]}

