{"word":"pref","summary":{"en":"“pref” is an informal abbreviation, most often meaning “preference(s)” (including app/device preferences). Less commonly, it can mean “prefix” or “preferred.”","zh":"“pref”是非正式缩写，最常指“偏好/偏好设置（preferences）”；较少情况下也可指“前缀（prefix）”或“更偏好的/优先的（preferred）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) short for “preference” or “preferences,” meaning what someone likes more; also used for the settings/options you choose in an app or device.","zh":"（非正式）“preference / preferences”的缩写，表示“偏好/喜好”；也常指软件或设备里的“偏好设置/选项”。"},"examples":[{"en":"What’s your pref: tea or coffee?","zh":"你的偏好是什么：茶还是咖啡？"},{"en":"Go to Settings → Prefs to change the language.","zh":"去“设置 → 偏好设置”更改语言。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, informal) short for “prefix,” the beginning part added to a word (like un- or re-).","zh":"（较少见，非正式）“prefix（前缀）”的缩写，指加在词前面的部分（如 un-、re-）。"},"examples":[{"en":"In ‘rewrite,’ the pref is re-.","zh":"在 rewrite 里，前缀是 re-。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common, informal) short for “preferred,” meaning liked more or chosen first.","zh":"（较少见，非正式）“preferred（更喜欢的/优先的）”的缩写。"},"examples":[{"en":"Seat by the window is pref if available.","zh":"如果有的话，优先要靠窗的座位。"}]}],"synonyms":["preference","prefs","settings","options"],"phonetic":"/prɛf/","extraExplanation":["“pref/prefs”最常见于口语、短信、论坛、以及软件界面（尤其是“Prefs”= Preferences）。正式写作中一般写全：preference(s) / settings。","不同地区和不同软件里，“Preferences”也可能叫“Settings”或“Options”；但语感上“Preferences”更像“个性化选择/偏好”，而“Settings”更泛指“所有设置”。"]}
{"word":"prefab","summary":{"en":"“Prefab” means prefabricated: made from factory-built parts that are assembled quickly on site, often used for buildings or building components.","zh":"“prefab”指“预制的/预制建筑”：在工厂预先制造部件，现场快速组装，常用于建筑或建筑构件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building or structure that is made from pre-manufactured parts and quickly assembled on site (often a prefabricated house or office).","zh":"预制建筑；活动房（由工厂预先制造的部件在现场快速组装，常指预制房屋或临时办公室）。"},"examples":[{"en":"After the storm, the family lived in a prefab until their house was rebuilt.","zh":"暴风雨后，这家人住在一间预制房里，直到房子重建完成。"},{"en":"The construction company set up prefab classrooms for the school renovation.","zh":"施工公司为学校翻修期间搭建了预制教室。"}]},{"partOfSpeech":"adj.","definition":{"en":"Prefabricated; made in a factory in parts so it can be assembled quickly elsewhere.","zh":"预制的；工厂预先制作、可在别处快速组装的。"},"examples":[{"en":"They chose prefab panels to speed up the build.","zh":"他们选择预制板材来加快施工速度。"},{"en":"Prefab bathrooms are common in some apartment buildings.","zh":"在一些公寓楼里，预制浴室很常见。"}]}],"synonyms":["prefabricated","modular","pre-made"],"phonetic":"/ˈpriːˌfæb/","extraExplanation":["“prefab”是“prefabricated”的口语/书面简写，常见于建筑与工程领域。日常语境里，它有时带一点“临时、标准化”的联想，但在现代建筑中也常与“高效率、模块化、质量可控、减少工地浪费”相关。"]}
{"word":"prefabbed","summary":{"en":"“Prefabbed” means prefabricated—made ahead of time (usually in a factory) and assembled later.","zh":"“prefabbed”意为“预制的/预先制作好的”，通常在工厂做好，之后再组装安装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made in advance in a factory and then assembled or installed later (often in construction).","zh":"（常用于建筑）预先在工厂制作好，之后再到现场组装/安装的；预制的。"},"examples":[{"en":"They used prefabbed wall panels to finish the house faster.","zh":"他们用了预制墙板，让房子更快完工。"},{"en":"The bathroom was prefabbed off-site and lifted into place by crane.","zh":"卫生间在场外预制好，再用吊车吊装到位。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something in advance as prefabricated parts (informal).","zh":"（非正式）把……预制；预先制作成可组装的部件。"},"examples":[{"en":"The company prefabbed the sections in a workshop, then shipped them to the site.","zh":"公司在车间把各段预制好，然后运到工地。"}]}],"synonyms":["prefabricated","pre-made","factory-built","modular"],"phonetic":"/ˌpriːˈfæbd/","extraExplanation":["“prefabbed”来自“prefab”，是“prefabricated（预制的）”的口语/缩写形式；在英美建筑、模块化住房（modular housing）等语境里很常见。","日常写作里更正式的表达是“prefabricated”；口语或行业交流里常说“prefab/prefabbed”。"]}
{"word":"prefabbing","summary":{"en":"Prefabbing means using prefabrication—building parts off-site (in a factory) and assembling them on-site.","zh":"Prefabbing 指“预制化”：构件在工厂制作，再到工地组装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of making building parts in a factory (off-site) and then assembling them on-site; prefabricating.","zh":"在工厂（现场外）预先制作建筑构件，然后运到工地组装；预制化施工。"},"examples":[{"en":"Prefabbing can cut construction time because walls and floors are built in a factory first.","zh":"预制化施工可以缩短工期，因为墙体和楼板先在工厂制作完成。"},{"en":"They used prefabbing to reduce noise and disruption in the neighborhood.","zh":"他们采用预制化施工来减少对社区的噪音和干扰。"}]},{"partOfSpeech":"v.","definition":{"en":"Making something with prefabricated parts; using prefabrication (often in construction).","zh":"用预制部件制作/建造；进行预制（多用于建筑领域）。"},"examples":[{"en":"The company is prefabbing bathroom units to install quickly in new apartments.","zh":"这家公司正在预制整体卫浴单元，以便快速安装到新公寓里。"},{"en":"More builders are prefabbing components to improve quality control.","zh":"越来越多的建造商在预制构件，以提升质量控制。"}]}],"synonyms":["prefabrication","off-site construction","modular construction"],"phonetic":"/ˌpriːˈfæbɪŋ/","extraExplanation":["“prefabbing”来自“prefab / prefabricate”。在北美建筑语境里，它常指把墙板、楼板、楼梯、管线模块等在工厂标准化生产，再运到工地拼装，从而提高效率与一致性。","常见搭配：prefabbing components（预制构件）、prefabbing modules（预制模块）、off-site prefabbing（场外预制）、prefab house（预制房屋）。"]}
{"word":"prefabricate","summary":{"en":"Prefabricate means to make something in advance (often in a factory) for later assembly, and less commonly to make up a story or excuse in advance.","zh":"prefabricate 指（多用于建筑）预先制造以便之后组装；较少见也可指事先编造说辞或信息。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make or build something (or its parts) in advance, usually in a factory, so it can be quickly put together later","zh":"（通常在工厂）预先制造（整体或零部件），以便之后快速组装"},"examples":[{"en":"The walls were prefabricated off-site and delivered by truck.","zh":"墙体在工地外预制好后用卡车运来。"},{"en":"Prefabricated homes can be assembled in a few days.","zh":"预制房屋可以在几天内完成组装。"}]},{"partOfSpeech":"vt.","definition":{"en":"to invent or make up (a story, excuse, or information) in advance; to fabricate","zh":"（事先）编造、捏造（故事、借口或信息）；虚构"},"examples":[{"en":"He prefabricated an excuse for being late.","zh":"他事先编了个迟到的借口。"},{"en":"The report was accused of being prefabricated to mislead the public.","zh":"这份报告被指控是事先捏造来误导公众的。"}]}],"synonyms":["preassemble","prebuild","prefab","manufacture","fabricate"],"phonetic":"/ˌpriːˈfæbrɪˌkeɪt/","extraExplanation":["“prefab”是“prefabricated”的常见口语缩写，常用于建筑领域（如 prefab house/ prefab unit）。","词根理解：pre- 表示“在……之前”，fabricate 表示“制造/加工”，合起来就是“预先制造”。不过 fabricate 也有“捏造”的意思，所以 prefabricate 在少数语境下也可指“事先编造”。"]}
{"word":"prefabricated","summary":{"en":"Prefabricated means made in advance (often in a factory) and later assembled; it can also mean ‘ready-made’ in a negative sense for ideas or speech.","zh":"prefabricated 指“预制的（工厂先做、现场组装）”；也可指“现成/套路化的”（多用于想法或话语，常带贬义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially of a building or its parts) made in a factory and put together on the site where it will be used.","zh":"（尤指建筑物或其部件）在工厂预先制造好，然后运到现场组装的；预制的。"},"examples":[{"en":"They live in a prefabricated house that was assembled in just a few days.","zh":"他们住在一栋预制房里，几天内就搭建完成了。"},{"en":"The bridge used prefabricated concrete sections to speed up construction.","zh":"这座桥使用了预制混凝土构件来加快施工进度。"},{"en":"Prefabricated classrooms were installed to handle the growing number of students.","zh":"为了应对学生人数增长，学校安装了预制教室。"}]},{"partOfSpeech":"adj.","definition":{"en":"Prepared in advance in a fixed or “ready-made” form (often used negatively about ideas, speech, or emotions).","zh":"事先准备好的；现成的（常带贬义，指想法、话语或情感缺乏新意、像套话）。"},"examples":[{"en":"His apology sounded prefabricated, like something he had rehearsed.","zh":"他的道歉听起来很套路，像是排练过的一样。"},{"en":"The article relied on prefabricated opinions instead of real evidence.","zh":"这篇文章依赖现成的观点，而不是确凿的证据。"}]}],"synonyms":["prefab","preassembled","factory-made","ready-made","precast"],"phonetic":"/ˌpriːˈfæbrɪˌkeɪtɪd/","extraExplanation":["词源上由 pre-（“预先”）+ fabricate（“制造、加工”）构成，因此核心含义就是“先做出来再使用”。","在建筑领域也常见同义表达：prefab（口语/行业简称）、precast（“预制的”，多指预制混凝土）。注意 prefab 更口语、precast 更具体。","比喻义（“套路化的、现成的”）常用于评价语言或情绪不真诚：a prefabricated smile / a prefabricated response。"]}
{"word":"prefabricates","summary":{"en":"“Prefabricates” means makes parts in advance (usually in a factory) so they can be assembled later, especially in construction.","zh":"“prefabricates”表示把部件预先（多在工厂）制造好，之后再组装，尤用于建筑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make or build parts of something in a factory or before they are needed, so they can be quickly put together later (often used in construction)","zh":"（通常用于建筑）预制；预先在工厂制造（部件），以便之后快速组装"},"examples":[{"en":"The company prefabricates wall panels and ships them to building sites.","zh":"这家公司预制墙板，然后把它们运到工地。"},{"en":"This factory prefabricates bathroom units to speed up apartment construction.","zh":"这家工厂预制整体卫浴单元，以加快公寓施工速度。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular present) makes or builds something in advance; produces prefabricated parts","zh":"（一般现在时第三人称单数）预制；预先制造（部件）"},"examples":[{"en":"Our supplier prefabricates the steel frames to reduce on-site work.","zh":"我们的供应商预制钢结构框架，以减少现场施工量。"}]}],"synonyms":["preassemble","manufacture","produce","prefab (informal)","pre-make"],"phonetic":"/ˌpriːˈfæbrɪˌkeɪts/","extraExplanation":["“prefabricate”由 pre-（预先）+ fabricate（制造）构成。建筑领域常说“prefab / prefabricated”，指“预制房、预制构件”。这种做法通常强调：更快、更标准化、现场更少工序，但也可能带来运输、尺寸限制或设计灵活性较低等讨论。"]}
{"word":"prefabricating","summary":{"en":"Prefabricating means making parts in advance (often in a factory) to be assembled later, especially in construction.","zh":"prefabricating 指提前（常在工厂）制作构件，之后再组装，尤用于建筑领域。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making parts (especially building parts) in advance in a factory, so they can be put together quickly later at the site","zh":"（尤指建筑）预先在工厂制作构件，之后运到现场快速组装"},"examples":[{"en":"They are prefabricating wall panels to speed up construction.","zh":"他们正在预制墙板以加快施工进度。"},{"en":"Prefabricating the bathroom units helped reduce on-site labor.","zh":"预制浴室模块有助于减少现场用工。"}]},{"partOfSpeech":"v.","definition":{"en":"planning and producing something in advance from standardized parts","zh":"用标准化部件提前规划并制作（某物）"},"examples":[{"en":"The company is prefabricating kits for emergency shelters.","zh":"这家公司正在预制应急避难所套件。"},{"en":"By prefabricating components, the team reduced mistakes during assembly.","zh":"通过预制组件，团队减少了组装时的错误。"}]}],"synonyms":["prebuilding","preassembling","prefabbing","preforming"],"phonetic":"/ˌpriˌfæbrɪˈkeɪtɪŋ/","extraExplanation":["“prefabricating”是动词“prefabricate”的现在分词/动名词形式，常见于建筑与制造业语境（如prefabricated houses 预制房屋、prefab units 预制模块）。","与“manufacturing”相比，“prefabricating”更强调“先在别处做好、再到现场安装/拼装”的流程；常与on-site（现场）、assembly（组装）、modules/panels（模块/板材）等词搭配。"]}
{"word":"prefabrication","summary":{"en":"Prefabrication means making building parts or units in advance (usually in a factory) and assembling them on site.","zh":"Prefabrication 指在工厂提前制造建筑构件或单元，再运到工地组装的“预制/预制化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making building parts (or whole units) in a factory before transporting them to the construction site for assembly.","zh":"预制：在工厂先制造建筑构件（或整套单元），再运到工地进行组装的过程。"},"examples":[{"en":"Prefabrication can reduce construction time and waste on site.","zh":"预制化可以减少施工时间，并降低工地上的浪费。"},{"en":"The school used prefabrication to add new classrooms quickly.","zh":"这所学校用预制方式快速增加了新教室。"}]},{"partOfSpeech":"n.","definition":{"en":"The prefabricated parts or units themselves (e.g., prefabricated walls, modules).","zh":"预制构件/预制单元：指那些在工厂提前做好的部件或模块本身（如预制墙体、模块）。"},"examples":[{"en":"The prefabrication arrived in large modules ready to be installed.","zh":"预制单元以大型模块形式运到现场，安装即可。"}]}],"synonyms":["prefab construction","off-site construction","modular construction","preassembly"],"phonetic":"/ˌpriˌfæbrɪˈkeɪʃən/","extraExplanation":["“prefabrication”常用于建筑与工程领域，相关词有：prefab（口语/行业简称）、prefabricated（形容词，预制的）、modular construction（模块化建造）。","从词源看：pre-（提前）+ fabrication（制造/加工），字面意思就是“提前制造”。","在英语语境中，prefabrication常与效率、质量控制（工厂环境更稳定）、以及可持续性（减少现场材料浪费）等话题一起出现。"]}
{"word":"prefabrications","summary":{"en":"“Prefabrications” means the process of making parts in advance (usually in a factory) or the prefabricated parts themselves.","zh":"“prefabrications”指预制的过程，或指预制好的构件/单元（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making parts of a building, machine, or product in a factory so they can be quickly assembled later on-site.","zh":"（预制）在工厂先把建筑/设备/产品的部件制造好，之后运到现场快速组装的过程。"},"examples":[{"en":"Modern hospitals often rely on prefabrications to speed up construction.","zh":"现代医院的建造常依赖预制工艺来加快施工。"},{"en":"After the storm, the town used prefabrications to rebuild homes faster.","zh":"暴风雨后，小镇用预制方式更快重建住房。"}]},{"partOfSpeech":"n.","definition":{"en":"Prefabricated parts or units (such as wall panels or building modules) that are produced in advance and then assembled.","zh":"预制构件；预制单元（如墙板、模块化建筑单元等），先生产好再组装使用。"},"examples":[{"en":"The site manager checked the prefabrications before lifting them into place.","zh":"现场经理在吊装前检查了这些预制构件。"},{"en":"Shipping delays meant the prefabrications arrived a week late.","zh":"运输延误导致这些预制单元晚到了一周。"}]}],"synonyms":["prefab parts","precast units","modules","components","factory-built units"],"phonetic":"/ˌpriːˌfæbrɪˈkeɪʃənz/","extraExplanation":["“prefabrications”是名词复数，单数是“prefabrication”。在建筑语境里非常常见，常与“prefab housing（预制房屋）”“modular construction（模块化建造）”“off-site construction（场外/工厂建造）”一起出现。","在口语和新闻里，人们更常直接说“prefab(s)”来指预制房或预制构件（例如：They installed prefabs.）。"]}
{"word":"prefabricator","summary":{"en":"A prefabricator makes factory-built building parts (prefab components) that are assembled on-site.","zh":"prefabricator 指生产预制建筑部件并供现场装配的个人或公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that makes building parts (such as walls or roof sections) in a factory so they can be quickly put together on-site.","zh":"预制构件制造者；预制建筑公司（在工厂制作墙体、屋顶等部件，运到工地快速装配）。"},"examples":[{"en":"The prefabricator delivered the wall panels early, so the crew could start assembly right away.","zh":"预制构件供应商提前送达墙板，所以施工队能立刻开始装配。"},{"en":"We chose a local prefabricator to reduce shipping costs and delays.","zh":"我们选择了本地的预制厂家，以减少运输成本和延误。"}]}],"synonyms":["prefab manufacturer","prefabrication company","component manufacturer","supplier"],"phonetic":"/ˌpriˌfæbɹəˈkeɪtɚ/","extraExplanation":["在建筑语境里，prefabricator 常与 prefabricated（预制的）、prefab（口语：预制房/预制构件）一起出现。预制化在二战后及现代模块化建筑中很常见，强调“工厂标准化生产 + 现场快速安装”。","在商务沟通中也可用 supplier/manufacturer（供应商/制造商）替换，但 prefabricator 更强调“做预制件的人/公司”，尤其用于结构件、墙板、楼板、模块化单元等。"]}
{"word":"prefabs","summary":{"en":"“Prefabs” means prefabricated buildings (often houses) or prefabricated items made in a factory and assembled later.","zh":"“prefabs”指预制建筑（常指预制房）或预制品：在工厂制作、运到现场再组装的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"prefabricated buildings (especially houses) made in parts in a factory and then assembled on-site","zh":"（尤指房屋等）预制建筑；在工厂分段制作、运到现场再组装的建筑"},"examples":[{"en":"After the earthquake, the city put up prefabs to house displaced families.","zh":"地震后，城市搭建了预制房来安置流离失所的家庭。"},{"en":"The workers assembled the prefabs in just a few days.","zh":"工人们在短短几天内就把预制建筑组装好了。"}]},{"partOfSpeech":"n.","definition":{"en":"things made in advance from standard parts; prefabricated items","zh":"预制品；提前按标准部件制作好的东西"},"examples":[{"en":"The set was built from prefabs to save time and money.","zh":"布景用预制件搭建，以节省时间和成本。"},{"en":"Many modern offices use prefabs for quick renovations.","zh":"许多现代办公室用预制件来快速翻新。"}]},{"partOfSpeech":"adj.","definition":{"en":"prefabricated; made in parts before being used or assembled (often used before a noun: prefab homes)","zh":"预制的；预先分段制作、使用时再组装的（常作定语：prefab homes）"},"examples":[{"en":"They chose a prefab home because it was faster to build.","zh":"他们选择了预制房，因为建造速度更快。"},{"en":"Prefab panels reduced construction time dramatically.","zh":"预制板大幅缩短了施工时间。"}]}],"synonyms":["prefabricated buildings","prefab housing","modular buildings","prebuilt units","prefabricated units"],"phonetic":"/ˈpriˌfæb/","extraExplanation":["“prefab”是“prefabricated”的常用口语缩写；“prefabs”既可以指复数名词（多栋预制房/多种预制件），也常见于口语里泛指“预制房”。","在英国英语中，“prefab”常让人联想到二战后为解决住房紧缺而建的临时/快速住宅；在当代语境里也可中性地指现代模块化或装配式建筑。"]}
{"word":"preface","summary":{"en":"“Preface” usually means a beginning section that introduces a book or work; as a verb, it means to begin with something that prepares for what comes next.","zh":"“preface”常指书或作品的前言/序言；作动词时指先说/先做某事作为铺垫，再进入正题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introduction at the beginning of a book, speech, or other work that explains its purpose, background, or how it was created.","zh":"（书、演讲或作品开头的）前言；序言，用来说明写作目的、背景或创作过程。"},"examples":[{"en":"In the preface, the author explains why she wrote the book.","zh":"在前言里，作者解释了她为什么写这本书。"},{"en":"Please read the preface before you start Chapter 1.","zh":"开始读第一章之前，请先读前言。"},{"en":"The preface gives some historical context for the novel.","zh":"前言为这部小说提供了一些历史背景。"}]},{"partOfSpeech":"vt.","definition":{"en":"To introduce a statement or action by saying or doing something first, often as preparation for what follows.","zh":"以……作为开场；在说/做某事前先说/做另一件事作为铺垫。"},"examples":[{"en":"He prefaced his question with an apology.","zh":"他先道了歉，然后才提出问题。"},{"en":"She prefaced her remarks by thanking everyone for coming.","zh":"她先感谢大家到场，然后才开始发言。"}]}],"synonyms":["foreword","introduction","prologue","preamble"],"phonetic":"/ˈprɛfəs/","extraExplanation":["“preface”来自拉丁语 prae-（在前）+ fari（说）。所以它的核心感觉是“在内容之前先说的话”。","在书籍结构中：preface（前言）通常由作者写，较偏个人写作动机与过程；introduction（导言/引言）更常进入主题内容本身、提供概念与背景；foreword（序）常由他人（如专家/名人）为作者写。不同出版社用法可能略有重叠。"]}
{"word":"prefaceable","summary":{"en":"“Prefaceable” means suitable to be introduced with a preface or brief context.","zh":"“prefaceable”指“适合用序言或简短背景说明来引入的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able or suitable to be introduced with a preface; fit to have an introductory explanation.","zh":"可加序言的；适合用序言/前言来引入或说明的。"},"examples":[{"en":"This is a prefaceable topic—you may need a short explanation before the details.","zh":"这是个可加序言的话题——在细节之前你可能需要一个简短的说明。"},{"en":"The author chose a prefaceable opening to guide new readers into the story.","zh":"作者选择了一个适合加前言的开头，引导新读者进入故事。"}]}],"synonyms":["introductory","explanatory","context-setting","needing context"],"phonetic":"/ˈpriːfeɪsəbəl/","extraExplanation":["这个词非常少见，多见于较旧或较正式的英语写作。它由 preface（序言/前言）+ -able（“能够……的/适合……的”）构成，意思是“可以（或值得）写个序言来引入”。日常表达里更常用：\"needs a preface/needs some context\"（需要前言/需要一些背景）。"]}
{"word":"prefaced","summary":{"en":"“Prefaced” means introduced something with preliminary remarks, or added a written preface at the beginning of a text.","zh":"“prefaced”表示在某事前加铺垫性的引言，或在文章/书前添加序言。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to introduce a speech, statement, or action with preliminary remarks (often to explain, soften, or give context)","zh":"在讲话、陈述或行动前加上引言/铺垫（常用于解释、缓和语气或交代背景）"},"examples":[{"en":"She prefaced her question with an apology.","zh":"她先道了歉，再提出问题。"},{"en":"He prefaced the bad news by saying, “I don’t want to worry you, but…”","zh":"他说“我不想让你担心，不过……”来为坏消息做铺垫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to write or add a preface (an introductory section) to a book, report, or document","zh":"为书籍、报告或文件写（或添加）序言/前言"},"examples":[{"en":"The new edition is prefaced by a short note from the author.","zh":"新版前面有作者的一段简短前言。"},{"en":"The report was prefaced with a summary of the project’s goals.","zh":"这份报告前面加了一段对项目目标的概述作为引言。"}]}],"synonyms":["introduced","began with","led off with","preluded","foreworded"],"phonetic":"/ˈprɛfəst/","extraExplanation":["“prefaced”是动词“preface”的过去式/过去分词，常见结构是“preface A with B”（用B来为A做铺垫）。","日常交流里它常带有“先说点铺垫话、把话说得委婉些”的意味；写作语境里则更接近“在正文前写序言/前言”。"]}
{"word":"prefacer","summary":{"en":"Prefacer means a person who writes a book’s preface, or (less commonly) someone who gives an opening introduction.","zh":"Prefacer 指“序言撰写者”；较少用时也可指“做开场介绍的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or provides the preface (introductory section) of a book or document","zh":"（书或文件的）序言撰写者；写序的人"},"examples":[{"en":"The prefacer explained why the new edition was necessary.","zh":"写序的人解释了为什么需要这本新版。"},{"en":"As the prefacer, she thanked the researchers and set the tone for the book.","zh":"作为序言撰写者，她感谢了研究人员，并为全书定下基调。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who introduces something by saying or writing a few opening words (less common)","zh":"（较少用）做开场介绍的人；以开场白引出内容的人"},"examples":[{"en":"He served as a prefacer, giving a brief opening before the keynote speech.","zh":"他担任开场介绍的人，在主题演讲前做了简短开场。"}]}],"synonyms":["writer of the preface","introducer","prologist"],"phonetic":"/ˈpriːˌfeɪsər/","extraExplanation":["“Prefacer”来自“preface（序言）”。在英语出版文化里，preface通常由作者或他人撰写，用来说明写作动机、感谢协助者、交代背景或引导读者阅读；与“introduction”相比，preface更偏向个人说明与写作缘起。","这个词在日常口语中不算常见，更常见的说法是“the author of the preface”或直接说“she wrote the preface”。"]}
{"word":"prefacers","summary":{"en":"“Prefacers” are people who write a preface, or (less commonly) introductory words/phrases that lead into a statement.","zh":"“Prefacers”指撰写序言的人；较少见时也可指口语中用来引出话语的引入语/铺垫语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who write or provide a preface (an introduction at the beginning of a book, report, or speech).","zh":"撰写或提供“前言/序言”（书、报告或演讲开头的介绍文字）的人。"},"examples":[{"en":"The editor thanked the prefacers for explaining the book’s goals clearly.","zh":"编辑感谢这些撰写序言的人把本书的目标解释得很清楚。"},{"en":"Different prefacers highlighted different themes in the new edition.","zh":"新版中，不同的序言作者强调了不同的主题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Linguistics, less common) Words or short phrases used to introduce what you are about to say (e.g., “Well,” “To be honest,” “In my opinion”).","zh":"（语言学/口语表达中，较少见）用来引出接下来要说内容的“引入语/铺垫语”，如“Well…” “To be honest…” “In my opinion…”。"},"examples":[{"en":"In conversation, “Well,” is a common prefacer before giving an answer.","zh":"在对话中，“Well…”常用作回答前的引入语。"},{"en":"He used prefacers like “Honestly” to soften criticism.","zh":"他用“Honestly”之类的引入语来缓和批评的语气。"}]}],"synonyms":["preface writers","introducers","foreword authors","discourse markers (for the linguistic sense)"],"phonetic":"/ˈpriˌfeɪsərz/","extraExplanation":["“prefacers”是复数形式；单数是“prefacer”。在出版语境里更常见的是“preface writer / author of the preface”，而“prefacer”本身比较少用。","在口语研究/会话分析中，“prefacer”指帮助你“铺垫、转场、表达态度”的小词或短语，常用来让话更礼貌、更委婉，或给自己一点思考时间。"]}
{"word":"prefaces","summary":{"en":"“Prefaces” can mean the introductory sections of books (plural noun) or the action “he/she prefaces…” meaning to introduce remarks with a brief statement.","zh":"“prefaces”既可指（复数）书等的前言/序言，也可作动词第三人称单数，表示在讲话或陈述前先作简短说明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “preface”) Introductory words at the beginning of a book, speech, or report that explain its purpose, background, or how to read it.","zh":"（“preface”的复数）序言；前言：写在书、演讲或报告开头的引言，用来说明写作目的、背景或阅读方式。"},"examples":[{"en":"She always reads the prefaces before starting a new history book.","zh":"她开始读一本新的历史书之前，总会先读前言。"},{"en":"The prefaces in these textbooks explain how each unit is organized.","zh":"这些教材的前言说明了每个单元如何编排。"}]},{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “preface”) To introduce something (often a talk or statement) with a short explanation or remark.","zh":"（“preface”的第三人称单数）在……前先作简短说明；以……作为开场白。"},"examples":[{"en":"He prefaces his comments with a quick apology.","zh":"他在发言前先快速道了个歉。"},{"en":"The teacher prefaces the lesson with a review of yesterday’s key points.","zh":"老师在上课前先复习了昨天的要点。"}]}],"synonyms":["introductions","forewords","prologues","openings"],"phonetic":"ˈprɛfəs","extraExplanation":["“preface”常见于书籍体裁：作者在前言里可能会感谢他人（acknowledgments）、说明写作动机、交代资料来源或版本差异。注意它和“introduction”的区别：preface更偏“作者写给读者的开场说明”，introduction更偏“进入主题的导论内容”。"]}
{"word":"prefacial","summary":{"en":"Prefacial means “connected with a preface” (rare), or in technical use, “in front of the face.”","zh":"prefacial 指“与序言/前言相关的”（较少见）；在专业语境中也可指“位于面部之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a preface; used in or placed before the main part of a book, speech, or document.","zh":"（较少见）与“序言/前言”有关的；用于或放在书籍、演讲或文件正文之前的。"},"examples":[{"en":"The author added a prefacial note to explain why the names were changed.","zh":"作者加了一段前言性质的说明，解释为什么改了名字。"},{"en":"In her prefacial remarks, the speaker thanked the audience and set the topic.","zh":"在她的开场前言中，演讲者感谢了听众并引出主题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical) Located in front of the face or facial region.","zh":"（专业用语）位于面部之前的；面前的。"},"examples":[{"en":"The diagram marks the prefacial area with a dotted line.","zh":"图示用虚线标出了面前区域。"}]}],"synonyms":["prefatory","introductory","proemial","preliminary"],"phonetic":"/priˈfeɪʃəl/","extraExplanation":["“prefacial”在日常英语里很少见；表达“前言的/序言的”更常用的是“prefatory”（如：prefatory remarks）。","词源上可理解为“pre-（在……之前）+ facial（面部的）”。第一义是由“在正文前面”的位置引申而来；第二义则更接近字面“在脸前面”。"]}
{"word":"prefacing","summary":{"en":"“Prefacing” means introducing something with a brief lead-in or writing/adding a preface to a text.","zh":"“prefacing”指在正式内容前先做简短铺垫/开场说明，也可指为文章撰写或添加前言。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"introducing something (a talk, message, or statement) with preliminary remarks or context; saying something first to prepare the listener/reader.","zh":"在正式内容之前先做铺垫或说明；用开场的话引出主题。"},"examples":[{"en":"She began by prefacing her comment with an apology.","zh":"她先用一句道歉来为自己的评论做铺垫。"},{"en":"Prefacing the request with a compliment made it sound less demanding.","zh":"先夸一句再提出请求，会显得没那么强硬。"},{"en":"The teacher kept prefacing each topic with a short story.","zh":"老师总会先讲个小故事来引出每个主题。"}]},{"partOfSpeech":"v.","definition":{"en":"writing or adding a preface (an introductory section) to a book, report, or other text.","zh":"为书、报告等撰写或添加“前言/序言”。"},"examples":[{"en":"He spent the afternoon prefacing the new edition with updated notes.","zh":"他花了一下午为新版写前言并补充更新说明。"},{"en":"Prefacing the report helped explain the study’s purpose and limits.","zh":"在报告前加一段前言有助于说明研究目的和局限。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of introducing something with preliminary remarks; an instance of giving a preface.","zh":"做铺垫/作开场说明的行为；一次引言。"},"examples":[{"en":"The constant prefacing made the conversation feel cautious.","zh":"频繁的铺垫让对话显得很谨慎。"},{"en":"After a brief prefacing, she got straight to the point.","zh":"简单铺垫后，她就直奔主题了。"}]}],"synonyms":["introducing","leading off","preliminary remarks","framing","setting the stage","preambling"],"phonetic":"ˈpriːfeɪsɪŋ","extraExplanation":["“preface”在写作里指“前言/序言”，常用来交代写作目的、背景、致谢或阅读方法；在口语中则更常指“先说几句铺垫的话”，有时带有“先打预防针/先说明立场”的语气。","常见搭配：preface A with B（用B来为A做铺垫），例如：preface a critique with praise（先表扬再批评）。"]}
{"word":"prefacist","summary":{"en":"A rare word meaning someone who writes a preface to a book.","zh":"一个罕见词，指为书写前言/序言的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A person who writes a preface (an introductory section) for a book or other work.","zh":"（罕见、非标准用法）为书籍或作品撰写“前言/序言”（preface）的人。"},"examples":[{"en":"The publisher hired a well-known historian as the prefacist to introduce the new edition.","zh":"出版社请了一位知名历史学家担任这本新版的“序言撰写者”。"},{"en":"In academic books, the prefacist may explain why the work matters and how to read it.","zh":"在学术书里，序言撰写者可能会说明这部作品为何重要，以及该如何阅读。"}]}],"synonyms":["writer of the preface","author of the preface","foreword writer"],"phonetic":"/ˈprɛfəsɪst/","extraExplanation":["“prefacist”在现代英语里非常少见，很多词典不收录；更常见的说法是“the author wrote a preface”（作者写了前言）或“someone wrote the foreword”（某人写了序/导言）。","区分：preface（前言/作者序，通常由作者写）vs. foreword（序/他序，通常由他人写来推荐或介绍）。如果你想表达“写序的人”，更自然的说法包括“the writer of the preface/foreword”或“the author of the preface”。"]}
{"word":"prefactor","summary":{"en":"A prefactor is usually a coefficient placed in front of an expression to multiply it; more generally, it can mean an earlier factor that helps determine something.","zh":"prefactor 通常指“前因子/系数”，即放在表达式前并与之相乘的系数；更广义也可指对结果有影响的“先行因素”（偏学术）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coefficient (number or expression) placed in front of another quantity and multiplied by it; often used in math, physics, and statistics.","zh":"（数学/物理/统计中）前因子、前置系数：放在某个量前面并与之相乘的系数（数或表达式）。"},"examples":[{"en":"In the formula, the prefactor 2 multiplies the entire expression in parentheses.","zh":"在这个公式里，前因子 2 会乘以括号内的整个表达式。"},{"en":"The temperature-dependent prefactor changes how fast the reaction rate grows.","zh":"与温度相关的前因子会改变反应速率增长的快慢。"}]},{"partOfSpeech":"n.","definition":{"en":"A factor or element that comes before something else and helps determine it (used in technical or formal writing).","zh":"（较正式/技术语境）先行因素、前置要素：在某事之前出现并对其产生影响的因素。"},"examples":[{"en":"Clear communication is often a prefactor for successful teamwork.","zh":"清晰沟通常常是团队合作成功的先行因素。"},{"en":"Early funding can be an important prefactor in whether a project survives.","zh":"早期资金投入可能是决定项目能否存活的重要前置因素。"}]}],"synonyms":["coefficient","multiplier","constant (in formulas)","factor","contributing factor"],"phonetic":"/ˌpriːˈfæk.tɚ/","extraExplanation":["词源上，pre- 表示“在……之前”，factor 表示“因素/因子”。在科研写作里，prefactor 最常见的意思还是“前因子/系数”（第一条），比如指数函数前面的常数项或比例常数。","在日常英语中，人们更常说 prerequisite（先决条件）、contributing factor（影响因素）或 leading indicator（领先指标）；prefactor 用作“先行因素”时偏学术和正式。"]}
{"word":"prefactory","summary":{"en":"Prefactory is usually a misspelling of prefatory, meaning “introductory; before the main part.”","zh":"prefactory 通常是 prefatory 的拼写误写，意思是“序言的/引言的；在正文之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually: prefatory) Serving as an introduction; coming before the main part (often describing remarks, pages, or material at the beginning of a book or speech).","zh":"（通常写作 prefatory）序言的；引言的；在正文之前的（常指书/演讲开头的说明或内容）。"},"examples":[{"en":"The author wrote a prefatory note to explain why the book was revised.","zh":"作者写了一段序言说明为什么要修订这本书。"},{"en":"After a few prefatory remarks, the speaker began the main topic.","zh":"讲者做了几句开场白后就进入主题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An introduction or preface itself.","zh":"（较少见）序言；前言（指序言内容本身）。"},"examples":[{"en":"The edition includes a short prefatory by the editor.","zh":"这个版本包含编辑写的一段简短前言。"}]}],"synonyms":["prefatory","introductory","preliminary","opening"],"phonetic":"/ˈprɛfəˌtɔri/","extraExplanation":["“prefactory”在现代英语中非常少见，很多时候是把“prefatory”（序言的）拼错了。日常写作更常用“preface”（前言/序言，名词）或“introductory”（介绍性的，形容词）。","词源提示：prefatory 来自拉丁语前缀 pre-（在……之前）+ -fatory（与“说/讲”有关的词根），所以核心意思是“在正文之前用来引入的”。","相关常见表达：prefatory remarks（开场白）、prefatory note（序言说明）、preface to a book（书的前言）、by way of preface（作为开场/先说几句）。"]}
{"word":"prefade","summary":{"en":"Prefade means a signal taken before the fader in audio mixing, so the fader doesn’t affect it; it can also mean the prefade send/setting itself.","zh":"Prefade 指音频混音中在推子之前取信号，因此推子不影响它；也可指该推子前发送/设置本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Audio mixing) Taken from a signal path before the channel fader, so changes to the fader do not change the level being sent or monitored.","zh":"（音频混音）在通道推子（fader）之前取出的信号，因此推子的音量变化不会影响该路发送或监听的电平。"},"examples":[{"en":"Send the singer’s reverb pre-fade so it stays steady even if you lower the main fader.","zh":"把歌手的混响发送设为 pre-fade，这样即使你拉低主推子，混响也能保持稳定。"},{"en":"The engineer used a pre-fade aux for the stage monitors.","zh":"工程师用 pre-fade 的辅助发送给舞台返听音箱。"}]},{"partOfSpeech":"n.","definition":{"en":"A pre-fade send or setting on a mixer (often an aux send).","zh":"调音台上的 pre-fade 发送/设置（常指辅助发送 aux send）。"},"examples":[{"en":"Switch that aux to prefade for the monitor mix.","zh":"把那路 aux 切到 prefade，用来做返听混音。"},{"en":"This console has prefade options on every channel.","zh":"这台调音台每个通道都有 prefade 选项。"}]}],"synonyms":["pre-fade","PFL (related)","pre-fader (related)"],"phonetic":"/priˈfeɪd/","extraExplanation":["“Pre-fade”最常见于调音台/DAW里的路由设置：pre-fade 常用于舞台返听（monitor）或单独录音/广播分轨，因为你调主推子不会影响它；相对的 “post-fade” 则会跟随推子变化，常用于效果器发送（如混响、延迟）以保持干湿比例自然。","常见相关表达：PFL（pre-fader listen，推子前监听）、pre-fade aux send（推子前辅助发送）、post-fade（推子后）。"]}
{"word":"prefaded","summary":{"en":"“Prefaded” means made to look faded (usually clothing) before purchase.","zh":"“prefaded”指（多用于衣物）在出售前就被处理成褪色、做旧的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially of clothing) made to look slightly worn or faded in color before being sold.","zh":"（尤指衣物）在出售前就经过处理，让颜色看起来有些褪色、旧旧的（做旧/预先褪色）。"},"examples":[{"en":"I bought a prefaded denim jacket so it would look broken-in right away.","zh":"我买了一件预先褪色的牛仔夹克，这样一穿上就有“穿旧了”的感觉。"},{"en":"These prefaded jeans have a lighter blue wash on the thighs.","zh":"这条预先褪色的牛仔裤大腿位置的蓝色更浅。"}]}],"synonyms":["pre-faded","prewashed","stone-washed","washed-out"],"phonetic":"/ˌpriːˈfeɪdɪd/","extraExplanation":["“prefaded”常见于服装与面料描述，尤其是牛仔（denim）产品。更常见的写法是 **pre-faded**（带连字符）或写作 **prewashed**（预洗、做旧的一种方式）。","它通常指通过洗水、漂洗、打磨等工艺让颜色变浅，营造复古/休闲风格；并不一定表示衣物质量差或真的旧。"]}
{"word":"prefades","summary":{"en":"“Prefades” is mainly an audio/video term meaning to fade something out beforehand, or to use/monitor a signal taken before the fader affects it.","zh":"“prefades”主要用于音频/视频领域，指在切换/事件前先做渐弱，或指推子前取信号/监听（不受推子影响）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(audio/video) To reduce a signal or image gradually *before* another event (like a cut, transition, or level change), or to send/monitor a signal taken before the fader affects it.","zh":"（音频/视频）在另一个事件（如切换、转场或音量变化）发生之前，先让信号/画面逐渐减弱；也可指“推子前”（不受推子影响的）取信号/监听。"},"examples":[{"en":"In the edit, the engineer prefades the music before the dialogue starts.","zh":"在剪辑里，工程师会在对白开始前先把音乐做渐弱处理。"},{"en":"This aux send is pre-fade, so it stays the same even if you pull the channel fader down.","zh":"这个辅助发送是推子前（pre-fade）的，所以即使你把通道推子拉低，它的发送量也不会变。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A fade or signal taken before the fader; a “pre-fade” point in a mixing chain.","zh":"（较少见）推子前的渐弱/取样点；混音流程中的“推子前（pre-fade）”位置。"},"examples":[{"en":"Check the prefade level to make sure the recorder isn’t clipping.","zh":"检查推子前电平，确保录音没有削波（爆音）。"}]}],"synonyms":["fade out (before)","pre-fade","PFL (related)"],"phonetic":"/ˌpriːˈfeɪd/","extraExplanation":["“prefades”通常是动词第三人称单数（he/she/it prefades），或名词复数（two prefades）。在录音/混音里更常见的写法是连字符形式“pre-fade”，例如“pre-fade send / pre-fade level / pre-fade listen (PFL)”。"]}
{"word":"prefamiliar","summary":{"en":"“Prefamiliar” means already familiar beforehand (rare in everyday English).","zh":"“prefamiliar”表示“事先就熟悉的”，但在日常英语中较少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already familiar in advance; known before a particular event or experience (rare/less common word).","zh":"事先就熟悉的；在某个事件或经历之前就已了解的（较少见用法）。"},"examples":[{"en":"Because the route was prefamiliar, she didn’t need to check the map.","zh":"因为路线事先就很熟悉，她不需要看地图。"},{"en":"The students felt prefamiliar with the topic after watching the short video.","zh":"学生看完短视频后，对这个主题就已经有了预先的熟悉感。"}]}],"synonyms":["already familiar","previously familiar","familiar beforehand","pre-known"],"phonetic":"/ˌpriːfəˈmɪljɚ/","extraExplanation":["“prefamiliar”在现代英语里不算常用，更多时候人们会说“already familiar / previously familiar / familiar beforehand”。写作中如果担心读者不认识，建议用这些更自然的表达。","构词上是前缀“pre-（在……之前）”+“familiar（熟悉的）”，含义直观，但因为“familiar”本身就常和“already/previously”搭配，所以该合成词使用频率较低。"]}
{"word":"prefamiliarity","summary":{"en":"“Prefamiliarity” means prior familiarity, but it’s uncommon; “prior/previous familiarity” is more natural.","zh":"“prefamiliarity”指“预先熟悉”，但不常用；更自然的说法是“prior/previous familiarity”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"prior familiarity with something; knowing something already before a particular event, test, or meeting (a rare, nonstandard word).","zh":"预先的熟悉；在某个事件、测试或会面之前就已经了解某事（较少见、非标准用词）。"},"examples":[{"en":"Her prefamiliarity with the software made the training session easy.","zh":"她对这款软件的预先熟悉让培训变得很轻松。"},{"en":"The results may be affected by students’ prefamiliarity with the reading topic.","zh":"结果可能会受到学生对阅读主题的预先熟悉程度影响。"}]}],"synonyms":["prior familiarity","previous familiarity","pre-existing familiarity","familiarity beforehand"],"phonetic":"/ˌpriːfəˌmɪliˈærɪti/","extraExplanation":["“prefamiliarity”在日常英语中很少见，写作里更常用“prior familiarity”“previous familiarity”或“familiarity beforehand”。","构词上可理解为 pre-（预先）+ familiarity（熟悉）。如果你在论文/报告中使用，建议改成更常见的表达，以避免读者觉得不自然。"]}
{"word":"prefamiliarly","summary":{"en":"Prefamiliarly is a rare adverb meaning “as if already familiar,” and sometimes (archaically) “in advance.”","zh":"prefamiliarly 是一个罕见副词，主要指“仿佛早就熟悉”，有时（旧用）也可指“事先/预先”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a way that assumes you already know someone or something; as if familiar beforehand.","zh":"（罕见）以一种“好像早就很熟”的方式；带着预先熟悉的态度。"},"examples":[{"en":"He spoke prefamiliarly to the professor, as if they had met before.","zh":"他对那位教授说话很“仿佛早就认识”的样子，好像他们以前见过。"},{"en":"The novel introduces the city prefamiliarly, treating it like an old friend.","zh":"小说以一种“像在介绍老朋友”的口吻描写这座城市，仿佛读者早已熟悉。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Very rare/archaic) Beforehand; in advance.","zh":"（非常罕见/旧用）预先；事先。"},"examples":[{"en":"She had prefamiliarly prepared answers to common interview questions.","zh":"她事先准备好了对常见面试问题的回答。"}]}],"synonyms":["as if already familiar","in a familiar way","overfamiliarly","beforehand","in advance"],"phonetic":"/ˌpriːfəˈmɪliərli/","extraExplanation":["“prefamiliarly”在现代英语里非常少见，读者更常用的表达是：\n- “as if we’d met before”（好像以前见过）\n- “in a familiar way / too familiarly”（很熟络地/过于熟络地）\n- 表示“事先”：用 “in advance / beforehand” 更自然。","构词提示：pre-（提前、预先）+ familiarly（熟悉地、熟络地）。因此它通常带有“预先就显得很熟”的语感，偶尔也被人用来表示“预先”。"]}
{"word":"prefamous","summary":{"en":"“Prefamous” means already somewhat famous before becoming much more famous later.","zh":"“prefamous”指在后来更出名之前就已小有名气、已有一定知名度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Famous or well-known before becoming more widely famous later (often referring to someone’s earlier work or career stage).","zh":"在后来更出名之前就已小有名气的；“成名之前就已被认识”的（常指某人的早期作品或职业阶段）。"},"examples":[{"en":"She was prefamous in the local jazz scene long before her first hit album.","zh":"在她第一张畅销专辑之前，她在本地爵士圈就已经小有名气了。"},{"en":"The museum is showing a prefamous sketch by the artist from his student years.","zh":"博物馆正在展出这位艺术家学生时代的一幅“成名之前”的素描。"}]}],"synonyms":["already-famous","early-career","pre-celebrity","previously known"],"phonetic":"/ˌpriˈfeɪməs/","extraExplanation":["“prefamous”是由前缀 pre-（“在……之前”）+ famous（“著名的”）构成的较新、较口语化的词，常见于媒体、影评、时尚与流行文化语境，用来强调某人“后来大红大紫之前其实就已经有人关注/在圈内有名”。","它通常带一点“圈内人懂”的味道：并不是完全无名，而是“早期就有一定名气”，因此比“unknown（无名的）”更贴切。也常见于“prefamous ____”的搭配，如 prefamous photos（成名前照片）、prefamous work（成名前作品）。"]}
{"word":"prefamously","summary":{"en":"“Prefamously” is a nonstandard adverb sometimes used to mean “before becoming famous,” but clearer choices are “before becoming famous” or “previously.”","zh":"“prefamously”是非标准副词，有时想表达“成名之前”，但更自然的说法是“before becoming famous”或“previously”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard) in a way that happened before someone or something became famous; before becoming well-known.","zh":"（非标准用法）在某人或某事成名之前；在变得广为人知之前。"},"examples":[{"en":"The actor, prefamously, worked as a waiter in New York.","zh":"这位演员在成名前曾在纽约当过服务员。"},{"en":"Prefamously, the band played tiny clubs before their first hit.","zh":"这支乐队在走红之前曾经在小酒吧演出。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/awkward) used to mean “previously, as is well known,” but most speakers would say “previously” or “famously” instead.","zh":"（少见/别扭）有时被用来表示“众所周知地在以前”，但大多数人会改用“previously（以前）”或“famously（著名地）”。"},"examples":[{"en":"He was previously (not prefamously) the CEO of the company.","zh":"他以前（不太会说 prefamously）是这家公司的CEO。"},{"en":"She is famously shy, even in interviews.","zh":"她出了名地害羞，连采访时也是。"}]}],"synonyms":["before becoming famous","previously","formerly","once","earlier"],"phonetic":"/priˈfeɪməsli/","extraExplanation":["“prefamously”不是常见词，很多词典不收录。写作中更自然的表达通常是：\n- before becoming famous / before she became famous（在成名之前）\n- previously / formerly（以前）\n如果你想表达“臭名昭著地”，常用词是 infamously（例如：He was infamously corrupt. 他臭名昭著地腐败）。"]}
{"word":"prefashion","summary":{"en":"“Prefashion” is a rare verb meaning to shape or design something beforehand.","zh":"“prefashion”是一个罕见动词，意思是“事先塑造/提前设计”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To shape, design, or make something in advance; to form beforehand.","zh":"（罕见）预先塑造；事先设计或制作；提前形成。"},"examples":[{"en":"The team prefashioned a basic prototype before the final materials arrived.","zh":"在最终材料到达之前，团队先预制了一个基础原型。"},{"en":"Her ideas were prefashioned by years of reading and observation.","zh":"她的想法是多年阅读与观察预先塑成的。"}]}],"synonyms":["preform","pre-shape","pre-design","pre-make","predetermine"],"phonetic":"/priˈfæʃən/","extraExplanation":["“prefashion”由前缀 pre-（“在……之前”）+ fashion（“塑造/制作”）组成，但在现代英语中非常少见。日常表达更常用 “design in advance / pre-form / pre-shape / pre-make”。在文学或较正式的写作里，它有时用来强调“某事在发生前就已被塑造（如观念、性格、命运）”。"]}
{"word":"prefashioned","summary":{"en":"“Prefashioned” means made or shaped in advance; pre-made.","zh":"“prefashioned”指“预先制作/预先成形的；现成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made or formed in advance; already prepared or pre-made (often before assembly or use).","zh":"预先制作的；预先成形的；现成的（常指在使用或组装前就已做好）。"},"examples":[{"en":"The kit includes prefashioned parts, so you can build the model quickly.","zh":"这个套件包含预先制作的零件，所以你可以很快完成模型。"},{"en":"They used prefashioned panels to speed up construction.","zh":"他们使用预制板来加快施工进度。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped in advance into a particular form (especially in crafts, clothing, or manufacturing).","zh":"预先塑造成特定形状的（尤用于手工、服装或制造业语境）。"},"examples":[{"en":"The jeweler worked with prefashioned wax forms before casting the rings.","zh":"珠宝匠先用预先做好的蜡模，再浇铸戒指。"},{"en":"She bought a prefashioned collar and sewed it onto the shirt.","zh":"她买了一个预先做好的衣领，再把它缝到衬衫上。"}]}],"synonyms":["pre-made","ready-made","prefabricated","preformed","preassembled"],"phonetic":"/ˌpriˈfæʃənd/","extraExplanation":["“prefashioned”由前缀 pre-（“在……之前、预先”）+ fashioned（“做成某种形状/式样的”）构成。实际使用中更常见的写法与同义表达是 pre-fashioned（带连字符）、preformed、prefabricated、ready-made。","它通常用于较正式或技术性的描述（制造、工艺、建筑等），日常口语里更常说 pre-made 或 ready-made。"]}
{"word":"prefatial","summary":{"en":"“Prefatial” means “of or relating to a preface,” used mainly in formal writing.","zh":"“prefatial”意为“序言的/与前言有关的”，多用于较正式或学术的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a preface (the introduction at the beginning of a book or written work).","zh":"与“序言/前言”（书或文章开头的介绍部分）有关的；序言的。"},"examples":[{"en":"In his prefatial note, the author explains why he revised the second edition.","zh":"在他的序言说明中，作者解释了他为何修订第二版。"},{"en":"The prefatial pages include acknowledgments and a short explanation of the book’s purpose.","zh":"序言部分的页码包括致谢以及对本书目的的简短说明。"}]}],"synonyms":["prefatory","introductory","proemial"],"phonetic":"/prɪˈfeɪʃəl/","extraExplanation":["“prefatial”来自“preface（序言/前言）”。在日常英语里更常见的说法是“preface (to) … / in the preface …”，而“prefatial”多见于较正式或学术性的写作（谈论“序言性质的内容”时用）。","注意拼写：prefatial（有时也会看到较少见的变体“prefatory”，意思相近，更常用；例如“a prefatory remark（开场白/引言性质的评论）”。"]}
{"word":"prefator","summary":{"en":"Prefator is a rare noun meaning a person who writes or gives a preface/introductory remarks.","zh":"prefator 是个罕见名词，指写序言或做开场引言的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person who writes or delivers a preface; an introducer.","zh":"（罕见）写（或发表）序言的人；引言者。"},"examples":[{"en":"The prefator thanked the readers before the main text began.","zh":"序言作者在正文开始前向读者致谢。"},{"en":"In older editions, the prefator often explained why the book was written.","zh":"在较早的版本里，序言作者常常说明写作这本书的缘由。"}]}],"synonyms":["preface writer","introducer","prologist"],"phonetic":"/ˈprɛfəˌtɔr/","extraExplanation":["“prefator”在现代英语中非常少见，读者更常看到的是“preface writer / author of the preface（序言作者）”。","很多学习者想查的其实是“prefatory”（形容词，意为“序言的；引言性的”），如：a prefatory note（序言/前言性质的说明）。","词源上与“preface（序言）”同源，来自拉丁语前缀“prae-（在前）”+“fari（说）”，核心含义是“在前面先说的话”。"]}
{"word":"prefatorial","summary":{"en":"“Prefatorial” is usually a mistaken form of “prefatory,” meaning introductory or preceding the main part.","zh":"“prefatorial”通常是“prefatory”的误写，意为“引言的/前置的，在主要内容之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely intended as “prefatory”: serving as an introduction; coming before the main part (of a book, speech, or event).","zh":"多半是想写“prefatory”：作引言的；前置的；在正文/主要部分之前的（常用于书、演讲或活动）。"},"examples":[{"en":"She wrote a prefatory note to explain why she chose these poems.","zh":"她写了一段前言说明自己为何选择这些诗。"},{"en":"The professor gave a prefatory remark before starting the lecture.","zh":"教授在开始讲课前先说了几句开场白。"}]}],"synonyms":["prefatory","introductory","preliminary","opening"],"phonetic":"/ˈprɛfəˌtɔri/","extraExplanation":["“prefatorial”在现代英语中非常少见，通常被认为是拼写误写或误用；更标准、常用的词是“prefatory”。","“prefatory”来自拉丁语 praefari（prae- ‘在前’ + fari ‘说’），字面意思接近“在前面说的话”，所以常与前言、序言、开场说明相关。","常见搭配：prefatory remarks（开场白）、prefatory note（前言说明）、prefatory chapter（引言章节）。"]}
{"word":"prefatorially","summary":{"en":"“Prefatorially” means “as an introduction” or “in a preface-like way,” before the main point.","zh":"“prefatorially”表示“作为引言/开场白地；以序言式地”，强调在进入重点之前的铺垫。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that serves as an introduction; as a preliminary remark before the main content.","zh":"以引言的方式；作为正文之前的开场或铺垫。"},"examples":[{"en":"Prefatorially, the speaker thanked the audience before beginning the lecture.","zh":"作为开场，演讲者先感谢了听众，然后才开始讲座。"},{"en":"She spoke prefatorially about the project’s goals, then moved on to the details.","zh":"她先用开场性的语言谈了项目目标，然后再进入细节。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner related to a preface (the introductory section of a book or document).","zh":"以（书籍或文件的）前言/序言相关的方式。"},"examples":[{"en":"The editor commented prefatorially on why this new edition matters.","zh":"编辑在序言中谈到了为何这个新版很重要。"},{"en":"Some notes appear prefatorially to explain the author’s background.","zh":"有些说明性文字放在序言部分，用来介绍作者背景。"}]}],"synonyms":["introductory","preliminary","by way of introduction","as a preface","to begin with"],"phonetic":"/ˌprɛfəˈtɔriəli/","extraExplanation":["“prefatorially”来自“prefatory”（序言的、开场的），而“prefatory”又与“preface”（前言/序言）同源。它在日常口语中不太常见，更常见的替换说法有“by way of introduction”“as an introduction”“to begin with”。","用在写作里时，它常带有“先说一句铺垫的话”的语气，强调“还没进入重点内容”。"]}
{"word":"prefatorily","summary":{"en":"“Prefatorily” means “as an introduction, in a prefatory way,” usually in formal writing or speech.","zh":"“prefatorily”意为“作为引言/序言地、以开场介绍的方式”，多用于正式写作或演讲。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a prefatory way; as an introduction before the main part (often in formal writing or speech).","zh":"以序言/引言的方式；作为正文或主要内容之前的介绍（多用于正式写作或演讲）。"},"examples":[{"en":"Prefatorily, the author thanks her family and explains why she wrote the book.","zh":"在引言部分，作者先感谢家人，并说明她写这本书的原因。"},{"en":"The professor spoke prefatorily about the course rules before starting the lecture.","zh":"教授先用引导性的开场说明课程规则，然后才开始讲课。"}]}],"synonyms":["by way of introduction","introductorily","in the preface","preliminarily"],"phonetic":"/ˌprɛfəˈtɔrəli/","extraExplanation":["“prefatorily”比较少见、偏书面和正式；日常更常用的表达是 “in the preface / by way of introduction / as an introduction”。","它来自形容词 “prefatory”（序言的、开场的），常见于学术写作、书评或较正式的演讲文字中。"]}
{"word":"prefatory","summary":{"en":"“Prefatory” means introductory or preliminary—something at the beginning that prepares for what follows.","zh":"“prefatory”表示“序言的/引言的；预备性的”，指在开头用来铺垫、说明或准备的内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as an introduction at the beginning of a book, speech, or piece of writing (like a preface).","zh":"（书、演讲或文章）作为开头的引言性质的；序言的。"},"examples":[{"en":"She wrote a prefatory note to explain why she chose these stories.","zh":"她写了一段序言式的说明，解释为什么选择这些故事。"},{"en":"The report includes a prefatory section outlining its goals.","zh":"这份报告包含一个引言部分，概述其目标。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done or said as preparation before the main action; preliminary.","zh":"在主要事情开始前作为准备的；预备性的。"},"examples":[{"en":"After a few prefatory remarks, the coach began the training session.","zh":"说了几句开场的准备性话之后，教练开始训练。"},{"en":"They had a brief prefatory meeting before negotiations.","zh":"谈判前他们开了一个简短的预备会议。"}]}],"synonyms":["introductory","preliminary","opening","proemial"],"phonetic":"/ˈprɛfəˌtɔri/","extraExplanation":["“prefatory”来自“preface（序言）”，都源于拉丁语词根，核心意思是“放在前面说的话”。在正式写作中，它常用来形容开头的说明、背景交代或铺垫性发言。","常见搭配：prefatory note/remarks/section（序言式的说明/开场白/引言部分）。语气偏正式，日常口语更常说“introductory”。"]}
{"word":"prefavor","summary":{"en":"A rare verb meaning to favor or give preference to someone/something beforehand.","zh":"一个罕用动词，意思是“事先偏袒或预先给予偏好”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To favor or support someone or something in advance; to show preference beforehand.","zh":"（罕用）事先偏袒/支持；预先表示偏好。"},"examples":[{"en":"The policy seemed to prefavor large companies over small local shops.","zh":"这项政策似乎预先偏向大公司，而不是本地小店。"},{"en":"Some applicants felt the selection process prefavored people with connections.","zh":"一些申请者觉得筛选过程事先偏袒有关系的人。"}]}],"synonyms":["favor beforehand","show preference to","predispose toward","prefer"],"phonetic":"/priˈfeɪvər/","extraExplanation":["“prefavor”在现代英语中非常少见，更常见的表达是“favor … in advance / show preference to … beforehand”，或用更自然的动词如“favor”“prefer”。","在写作中如果一定要用，常见写法也可能带连字符“pre-favor”，以强调“预先”的含义；在正式文本里建议改用更常见的表达以避免读者困惑。"]}
{"word":"prefavorable","summary":{"en":"A rare adjective meaning “favorable in advance.”","zh":"一个罕用形容词，意为“预先有利的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Favorable beforehand; giving someone an advantage or positive opinion in advance.","zh":"（罕用）预先有利的；事先就对某人/某事抱有好感或给予优势的。"},"examples":[{"en":"The new policy created a prefavorable environment for small businesses.","zh":"新政策为小企业创造了一个预先有利的环境。"},{"en":"The judge avoided any prefavorable remarks before hearing both sides.","zh":"法官在听取双方陈述之前避免发表任何可能造成先入为主的有利评价。"}]}],"synonyms":["favorable","advantageous","beneficial","prejudicial (in sense of predisposing, but usually negative)"],"phonetic":"/ˌpriˈfeɪv(ə)rəbəl/","extraExplanation":["“prefavorable”在现代英语里非常少见，多数场合人们会用“favorable”（有利的）或“preferable”（更好的/更可取的）。学习时要注意不要把它当成“preferable”的变体。","构词上可理解为 pre-（在……之前）+ favorable（有利的），因此语感是“事先就有利/先天占优势/先入为主地偏向有利”。"]}
{"word":"prefavorably","summary":{"en":"“Prefavorably” is a very rare adverb meaning “in a favorable way beforehand,” but most writers use “preferably” or “favorably” instead.","zh":"“prefavorably”是非常少见的副词，大意为“事先以有利/正面的方式”，但写作中通常用“preferably（最好）”或“favorably（正面地/有利地）”更自然。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare/awkward) In a favorable way beforehand; with a positive bias in advance.","zh":"（非常少见/不自然）事先以有利的方式；预先带着正面倾向。"},"examples":[{"en":"The committee seemed to view the proposal prefavorably before the public hearing.","zh":"在公开听证会之前，委员会似乎就已经对该提案持有利看法。"},{"en":"Try not to judge people prefavorably or unfavorably without evidence.","zh":"不要在没有证据的情况下，先入为主地把别人想得太好或太坏。"}]}],"synonyms":["in advance","with a favorable bias","prejudicially (in a positive sense)","favorably (common alternative)","preferably (common alternative)"],"phonetic":"/priˈfeɪvərəbli/","extraExplanation":["“prefavorably”在现代英语里几乎不用，读者可能会觉得不地道。多数情况下你想表达的是：\n- “preferably”（最好/更理想的是），强调“选择偏好”：Preferably, we should leave early.（最好我们早点走。）\n- “favorably”（有利地/正面地），强调“评价积极”：The plan was received favorably.（该计划受到好评。）\n如果你要表达“先入为主地偏向好评”，更自然的说法是 “with a favorable bias” 或 “be predisposed to view … favorably”。"]}
{"word":"prefavorite","summary":{"en":"A prefavorite is the expected winner or top choice before an event starts (common in sports/competition talk).","zh":"prefavorite 指“在事件开始前就被看好会赢/最可能被选中”的赛前热门（常见于体育或竞赛语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, team, or option that is expected to win or be chosen even before an event begins (often used in sports, competitions, or betting)","zh":"在比赛或事件开始前就被看好会获胜或被选择的人/队/选项（常用于体育、竞赛或博彩语境）"},"examples":[{"en":"The Lakers were the prefavorite to win the series before the first game.","zh":"第一场比赛开打前，湖人就被看作系列赛的赛前热门。"},{"en":"She entered the contest as a prefavorite, but she still had to prove herself.","zh":"她以赛前热门身份参赛，但仍然需要用表现证明自己。"}]},{"partOfSpeech":"adj.","definition":{"en":"considered the likely winner or most popular choice before something starts","zh":"在事情开始前就被认为最可能获胜/最受欢迎的"},"examples":[{"en":"He was the prefavorite candidate in the polls months before the election.","zh":"在选举前几个月，他就在民调中被视为赛前最被看好的候选人。"},{"en":"The prefavorite team lost early, surprising many fans.","zh":"这支赛前热门球队早早出局，让很多球迷意外。"}]}],"synonyms":["early favorite","front-runner","preseason favorite","favorite"],"phonetic":"/ˌpriˈfeɪvərɪt/","extraExplanation":["“prefavorite”不是最常见的标准词，更常见的写法是带连字符的“pre-favorite”，或直接说“early favorite / preseason favorite / pregame favorite”。在体育新闻、赔率/博彩讨论里更容易看到。","语气上它强调“在开始之前就被看好”，所以常用来对比结果：例如赛前热门最终失利，会带出“爆冷（upset）”的感觉。"]}
{"word":"prefearful","summary":{"en":"“Prefearful” is a rare adjective meaning “fearful in advance” (or “causing fear in advance”).","zh":"“prefearful”是个较罕见的形容词，表示“事情发生前就先害怕/担忧”（或“让人提前害怕”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Feeling fear in advance; anxious or worried about something before it happens.","zh":"（罕见）在事情发生之前就感到害怕；对即将发生的事感到焦虑、担忧。"},"examples":[{"en":"She was prefearful the night before the exam, imagining the worst.","zh":"考试前一晚她就预先害怕，老是往最坏处想。"},{"en":"Don’t be prefearful—let’s look at the facts first.","zh":"别先害怕——我们先看看事实再说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Causing fear beforehand; making people feel afraid in advance.","zh":"（罕见）预先引发恐惧的；让人提前感到害怕的。"},"examples":[{"en":"The prefearful rumors spread quickly and unsettled everyone.","zh":"那些让人提前害怕的传言迅速传播，弄得大家都很不安。"}]}],"synonyms":["apprehensive","anxious","fearful","worried","foreboding"],"phonetic":"/priˈfɪr.fəl/","extraExplanation":["“prefearful”不是常见标准词，更像是由前缀 pre-（“在……之前”）+ fearful（“害怕的”）临时组合出来的用法，因此在字典或正式写作中不一定能见到。","日常英语里更自然的表达通常是：apprehensive（担心的/忐忑的）、anxious（焦虑的）、fearful（害怕的）、dreading（害怕/担心即将发生的事）。如果你在阅读文学或较旧/较个性化的文本里看到它，多半是在强调“还没发生就先害怕”。"]}
{"word":"prefearfully","summary":{"en":"“Prefearfully” is not standard English; it’s likely a misspelling—often of “preferably” or “fearfully.”","zh":"“prefearfully”不是标准英语词，通常是拼写错误；常见可能是把“preferably（最好）”或“fearfully（害怕地）”写错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a mistaken blend of other words (especially “preferably” or “fearfully”).","zh":"不是标准英语单词；很可能是拼写错误或把两个词混在一起（常见是把“preferably（最好）”或“fearfully（害怕地）”写错）。"},"examples":[{"en":"If you meant “preferably”: Please reply by Friday, preferably in the morning.","zh":"如果你想表达“preferably（最好）”：请在周五前回复，最好在上午。"},{"en":"If you meant “fearfully”: The child looked fearfully at the barking dog.","zh":"如果你想表达“fearfully（害怕地）”：孩子害怕地看着那只吠叫的狗。"}]}],"synonyms":["preferably","fearfully"],"phonetic":"/priˈfɪrfəli/","extraExplanation":["“prefearfully”在常见词典与语料中基本找不到，通常会被视为拼写错误。你可以告诉我它出现的完整句子（或你想表达的意思），我能帮你判断最合适的词。","最常见的两种可能：\n1) preferably /ˈprɛfərəbli/（最好，宁可）——表示偏好；\n2) fearfully /ˈfɪrfəli/（害怕地）——表示恐惧的方式。两者意思差别很大。"]}
{"word":"prefeast","summary":{"en":"“prefeast / pre-feast” means happening or done before a big feast or celebratory meal.","zh":"“prefeast / pre-feast”指在盛宴或庆祝性大餐之前发生或进行的事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written “pre-feast”) happening or done before a feast or big celebratory meal.","zh":"（常写作 pre-feast）在盛宴/大餐之前发生的；为大餐前做的。"},"examples":[{"en":"We had a pre-feast snack while the turkey was still cooking.","zh":"火鸡还在烤的时候，我们先吃了点大餐前的小点心。"},{"en":"They held a pre-feast gathering to welcome relatives arriving early.","zh":"他们在宴席前先办了个小聚会，欢迎提前到的亲戚。"}]},{"partOfSpeech":"adv.","definition":{"en":"before a feast or celebratory meal (used like an adverb, usually with a hyphen: “pre-feast”).","zh":"在盛宴/庆祝性大餐之前（作副词用，通常加连字符：pre-feast）。"},"examples":[{"en":"We ate lightly pre-feast so we’d have room for dessert.","zh":"我们在大餐前吃得清淡些，这样甜点还有肚子装。"}]}],"synonyms":["pre-feast","before the feast","before the meal","pre-dinner"],"phonetic":"/priːˈfiːst/","extraExplanation":["“prefeast”不是非常常见的标准拼写；更常见的是加连字符的“pre-feast”，也可以写成“before the feast/meal”。","在英语文化语境里，它常用来描述节日大餐（如 Thanksgiving 感恩节、Christmas 圣诞节）之前的零食、活动或准备工作。注意它与“appetizer（开胃菜）”不同：appetizer 是正式餐桌上的一道菜，而 pre-feast snack/gathering 更泛指“宴前的吃点/活动”。"]}
{"word":"prefect","summary":{"en":"A prefect is either a student leader who helps maintain order in a school (especially in the UK) or a regional government official in some countries.","zh":"prefect 指（尤指英国）协助管理纪律的学生干部/级长，也可指某些国家负责地方行政的官员（如法国的省长/行政长官）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in British schools) a senior student chosen to help teachers and keep discipline; often a student leader.","zh":"（尤指英国学校）学长/级长；被选来协助老师、维持纪律的高年级学生（常为学生干部）。"},"examples":[{"en":"She became a prefect in her final year and helped organize assemblies.","zh":"她在最后一年当上了级长，并协助组织集会。"},{"en":"The prefects reminded everyone to keep the hallway quiet.","zh":"级长们提醒大家走廊里要保持安静。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some countries) a government official in charge of a district or region.","zh":"（在一些国家）地方行政长官；负责某个地区/省区的政府官员。"},"examples":[{"en":"The prefect met with local leaders to discuss safety plans.","zh":"地方行政长官与当地领导会面讨论安全计划。"},{"en":"In France, the prefect represents the national government in a department.","zh":"在法国，省长代表国家政府管理一个省。"}]}],"synonyms":["student leader","monitor","school prefect","administrator","governor (regional)"],"phonetic":"/ˈpriːfɛkt/","extraExplanation":["在英式校园语境里，prefect 常带有“被信任的高年级学生领袖”的色彩，可能负责维持秩序、带领新生、协助活动等；不同学校权力与职责差异很大。","在法国语境中，prefect（法语 préfet）是中央政府派驻地方的代表，常译为“省长/行政长官”；与英语里学校的 prefect 是两种不同体系下的同形词。"]}
{"word":"prefectly","summary":{"en":"Perfectly means “completely/exactly” or “in a flawless way.”","zh":"Perfectly 表示“完全/正好”，也可表示“完美地、毫无瑕疵地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"completely; exactly; in every way that is needed","zh":"完全地；正好；在各方面都符合要求地"},"examples":[{"en":"I understand you perfectly.","zh":"我完全理解你。"},{"en":"The timing worked perfectly.","zh":"时间安排得刚刚好。"},{"en":"That’s perfectly normal.","zh":"那完全正常。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a flawless or very skillful way","zh":"完美地；非常熟练地"},"examples":[{"en":"She played the piece perfectly.","zh":"她把那首曲子演奏得很完美。"},{"en":"The plan was executed perfectly.","zh":"计划执行得非常到位。"}]}],"synonyms":["completely","exactly","entirely","totally","flawlessly","perfectly well"],"phonetic":"/ˈpɝːfɪktli/","extraExplanation":["你输入的“prefectly”通常是拼写错误，正确拼法是“perfectly”。常见原因是把“perfect”的中间字母顺序写错。记忆法：perfect + -ly。"]}
{"word":"prefectoral","summary":{"en":"“Prefectoral” means relating to a prefect or a prefecture (local government/administrative district).","zh":"“prefectoral”表示与地方行政长官（prefect）或行政区（prefecture）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefect (a government official) or to a prefecture (an administrative district).","zh":"与“长官/地方行政长官（prefect）”或“行政区（prefecture）”有关的；州/县级行政区的。"},"examples":[{"en":"The prefectoral office issued a warning about heavy rain.","zh":"都道府县（行政区）政府办公室发布了暴雨警报。"},{"en":"She works in the prefectoral administration.","zh":"她在地方行政长官的行政机构工作。"}]}],"synonyms":["prefectural","administrative","governmental","civic"],"phonetic":"/prəˈfɛktərəl/","extraExplanation":["“prefectoral”较少见，更常用的是“prefectural”（例如：prefectural government / prefectural police）。在日本语境里，“prefecture”常指“都/道/府/县”，如 Tokyo Metropolitan Government（东京都政府）也可被称为prefectural-level government。","在法国语境中，“prefect（省长/地方行政长官）”是中央政府在地方的代表，负责协调公共秩序与行政事务；相关机构与职务可用prefectoral来形容。","拼写提示：如果你想表达“与prefecture有关的”，更推荐用 prefectural；prefectoral 有时也被当作 prefectural 的变体或少数用法。"]}
{"word":"prefectorial","summary":{"en":"Prefectorial means “related to a prefect,” especially school prefects and their duties, and sometimes government prefects/prefectures.","zh":"prefectorial 意为“与 prefect（学长/学生干部或行政长官）相关的”，常用于校园学长制度，也可用于行政体系语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefect (a student given authority in a school) or to a prefect system in a school.","zh":"与（学校里被授予管理权的）学生干部/学长（prefect）有关的；与学长制度有关的。"},"examples":[{"en":"The school introduced prefectorial duties such as monitoring the hallway during lunch.","zh":"学校引入了学长职责，例如在午餐时间巡查走廊。"},{"en":"She wore a badge showing her prefectorial role.","zh":"她佩戴着徽章，表明自己担任学长职务。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefect or a prefecture (an administrative division) in government.","zh":"与（行政体系中的）长官/地方行政长官（prefect）或“prefecture（专区/县级以上的行政区划）”有关的。"},"examples":[{"en":"The report discussed prefectorial authority over local policing.","zh":"报告讨论了地方行政长官对本地治安的权限。"},{"en":"Prefectorial offices coordinated the emergency response.","zh":"行政长官办公室协调了应急响应。"}]}],"synonyms":["prefect-related","prefectural (often preferred for administrative meaning)","administrative (context-dependent)"],"phonetic":"/ˌpriːfɛkˈtɔːriəl/","extraExplanation":["“prefectorial”较少见，更常见的形容词是“prefectural”（尤其指“prefecture/都道府县级行政区”的场景，如 Japanese prefectural government）。在英国等地的校园语境里，“prefectorial system（学长制度）”更常用。","词源上来自“prefect”（监督者、长官），带有“管理/督导”的含义；在不同国家语境中，既可指学校管理角色，也可指行政管理体系。"]}
{"word":"prefectorially","summary":{"en":"“Prefectorially” means “in the manner of a prefect,” either an administrative official or a school prefect.","zh":"“prefectorially”表示“以prefect（地方行政长官或学校风纪委员/学长）的方式；带有其权威或作风地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a manner relating to a prefect (an official) or a prefecture; as a prefect would act.","zh":"以（行政）地方长官/省长（prefect）的方式；与地方行政长官或其管辖区（prefecture）有关地。"},"examples":[{"en":"The letter was written prefectorially, with a formal tone and official stamps.","zh":"这封信写得很“官样”，带着正式语气和官方印章。"},{"en":"The town was governed prefectorially from the regional capital.","zh":"这个城镇由地区首府以“长官制/地方行政长官”的方式进行管理。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner relating to a school prefect (a student leader with limited authority), especially in British-style schools.","zh":"以（学校）学长/风纪委员（prefect）的方式（尤指英式学校中有一定管理权限的学生干部）。"},"examples":[{"en":"He spoke prefectorially to the younger students about keeping the hallway quiet.","zh":"他以“学长/风纪委员”的口吻对低年级学生说要保持走廊安静。"},{"en":"She organized the line prefectorially, reminding everyone of the rules.","zh":"她以“风纪委员”的方式整理队伍，提醒大家遵守规定。"}]}],"synonyms":["officially","authoritatively","administratively","in an official capacity"],"phonetic":"/prɪˈfɛktərli/","extraExplanation":["“prefectorially”非常少见，更多时候英语会用更自然的表达，如 “in an official manner（以官方方式）”、“like a prefect（像长官/学长那样）”、“with prefectural authority（带有地方行政权限）”。","“prefect”在不同文化语境里含义不完全相同：在法国等国家可指地方行政长官（prefecture 也指其辖区/机构）；在英国或英式学校里则常指被赋予一定管理职责的学生干部（school prefect）。"]}
{"word":"prefectorian","summary":{"en":"Praetorian means ‘related to the Roman emperor’s elite guard’ and can also describe forcefully loyal protectors of a leader.","zh":"Praetorian 意为“与古罗马皇帝禁卫军有关”，也可引申为“以强硬方式效忠并保护某位领袖的人/作风”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Praetorian Guard (the elite soldiers who protected Roman emperors).","zh":"与“禁卫军”（古罗马皇帝的精锐近卫部队）有关的。"},"examples":[{"en":"The museum has a display of praetorian armor from ancient Rome.","zh":"博物馆展出了古罗马禁卫军的盔甲。"},{"en":"The novel describes a praetorian unit guarding the emperor’s palace.","zh":"小说描写了一支禁卫军部队守卫皇帝的宫殿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overly loyal in a forceful or military way, especially to a ruler or political leader.","zh":"（尤指对统治者或政治领袖）以强硬、带军事色彩的方式极度忠诚的。"},"examples":[{"en":"Critics warned about a praetorian culture inside the security forces.","zh":"批评者警告说安保力量内部存在一种“禁卫军式”的文化。"},{"en":"He surrounded himself with praetorian advisers who never challenged him.","zh":"他身边围着一群“禁卫军式”的顾问，从不提出异议。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Praetorian Guard.","zh":"禁卫军士兵；禁卫军成员。"},"examples":[{"en":"A praetorian stood at the entrance, watching every visitor.","zh":"一名禁卫军士兵站在入口处，注视着每位来访者。"}]}],"synonyms":["imperial","guard","protective","militarized"],"phonetic":"/priˈtɔriən/","extraExplanation":["你输入的“prefectorian”通常是对 **praetorian** 的拼写误写。标准拼写是 **praetorian**（来自拉丁语 *praetorium*，意为将军/统帅的营帐或官邸）。","历史上，罗马禁卫军不仅负责保护皇帝，也曾参与政治斗争，甚至左右皇位继承。因此在现代英语里，*praetorian* 有时带有“以武力维护领袖、可能干预政治”的含义。"]}
{"word":"prefects","summary":{"en":"Prefects are usually student leaders in British-style schools; the word can also mean government officials who oversee a region.","zh":"prefects通常指英式学校的学生级长；也可指负责某地区行政事务的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Students given authority to help maintain discipline and represent the school (common in British-style schools).","zh":"（英式学校常见）级长；学生干部（负责维持纪律、协助老师管理）"},"examples":[{"en":"In many British schools, prefects help keep order in the hallways.","zh":"在许多英国学校里，级长会帮助维持走廊秩序。"},{"en":"She was chosen as a prefect because teachers trusted her.","zh":"她被选为级长，因为老师信任她。"}]},{"partOfSpeech":"n.","definition":{"en":"Officials appointed to oversee an area or administrative department (often used in historical or non-U.S. contexts).","zh":"（多用于历史或非美国语境）地方行政长官；辖区负责人"},"examples":[{"en":"The prefect announced new safety rules for the region.","zh":"这位地方行政长官宣布了该地区新的安全规定。"},{"en":"In some countries, a prefect manages government work in a district.","zh":"在一些国家，地方行政长官负责管理一个地区的政府事务。"}]}],"synonyms":["student leader","monitor","hall monitor","student prefect","official","administrator"],"phonetic":"/ˈpriːfekts/","extraExplanation":["“prefect”最常见于英式寄宿学校或中学体系，指由学校任命、协助老师管理学生的高年级学生干部；不同学校职责不同，可能包括维持纪律、带领新生、组织活动等。","流行文化里《哈利·波特》系列让很多学习者熟悉“prefect”：如级长会在校园内行使一定的管理权，并可能佩戴徽章（badge）。","在行政意义上，“prefect”常见于翻译或国际新闻语境（如某些国家的行政区负责人），在美国英语里更常用“official / administrator / governor / superintendent”等词来表达类似概念。"]}
{"word":"prefectship","summary":{"en":"Prefectship means the office or term of being a prefect, especially a student leader in some British-style schools.","zh":"Prefectship 指担任 prefect 的职位或任期，尤指英式学校体系中的学生级长/学生干部任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, office, or term of service of a prefect (a person with official authority, or in some schools, a student leader)","zh":"（prefect 的）职位、职务或任期；（某些学校中）学生干部/级长的任期"},"examples":[{"en":"She earned her prefectship in her final year at boarding school.","zh":"她在寄宿学校的最后一年获得了级长（prefect）的职位。"},{"en":"His prefectship involved supervising younger students and keeping order.","zh":"他的级长任期包括管理低年级学生并维持秩序。"}]}],"synonyms":["office","post","position","tenure","prefecture (sometimes, but not always the same)"],"phonetic":"/ˈpriːfɛktʃɪp/","extraExplanation":["“prefectship”较常见于英式教育语境（尤其是寄宿学校），指被任命为prefect（级长/学生干部）的“职位或任期”。在美式英语中不算常用；美国学校更常说“student leadership position / hall monitor / student prefect（较少）”。","词形上由“prefect + -ship”构成，-ship 常表示“身份/职位/状态/任期”（如 friendship 友谊、leadership 领导力/领导职位）。","历史上 prefect 也可指政府或行政官员（如某些国家的“地方行政长官”）；因此在正式或历史文本里，prefectship 也可能指“行政官的任职/任期”。"]}
{"word":"prefectual","summary":{"en":"Prefectual means “related to a prefecture or a prefect,” but the more common form is prefectural.","zh":"prefectual 表示“与行政区（prefecture）或行政长官（prefect）有关”，但更常见的形式是 prefectural。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefecture (an administrative area), or to a prefect (an official who governs such an area).","zh":"与“prefecture（行政区）”或“prefect（行政长官/地方官员）”有关的；县/府/专区级的。"},"examples":[{"en":"Prefectural governments in Japan handle many local services.","zh":"日本的都道府县（prefectural）政府负责许多地方公共服务。"},{"en":"The prefectual office announced new regulations for the district.","zh":"该地区的行政长官办公室公布了新规定。"}]}],"synonyms":["prefectural","administrative","governmental","provincial"],"phonetic":"/priˈfɛktʃuəl/","extraExplanation":["“prefectual”较少见；更常用、也更标准的拼写是 **prefectural**，意思相同。写作或正式场合建议用 *prefectural*。","在不同国家，“prefecture”的中文对应会不同：例如日本常译为“都/道/府/县”，法国的 *préfet* 常译为“省长/地方行政长官”等。理解时可把它当作“省/府/县一级政府或机构的”。"]}
{"word":"prefectural","summary":{"en":"Prefectural means “related to a prefecture or its government.”","zh":"prefectural 表示“与某个行政区（prefecture）或其政府机构有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefecture (an administrative region) or to the government/office that manages it.","zh":"与“prefecture（行政区）”有关的；属于该行政区或其政府/机构的。"},"examples":[{"en":"The prefectural government announced new disaster-prevention guidelines.","zh":"县级（prefectural）政府发布了新的防灾指南。"},{"en":"She works at the prefectural office in charge of education.","zh":"她在县政府（prefectural office）负责教育工作。"}]}],"synonyms":["provincial","regional","administrative"],"phonetic":"/prɪˈfɛktʃərəl/","extraExplanation":["“Prefectural”最常见于讨论日本等国家的行政区划：日本的47个“都、道、府、县”常被英文统称为 “prefectures”，因此会看到 “prefectural government / prefectural police / prefectural university”等搭配。","在不同国家语境里，“prefecture”可能对应不同级别（类似省/州/县等），翻译时常需根据具体国家与上下文确定更自然的中文说法。"]}
{"word":"prefecture","summary":{"en":"A prefecture is an administrative division of a country, especially one of Japan’s main local government units.","zh":"Prefecture 指国家的行政区划单位，尤其常指日本的主要地方行政单位（都/道/府/县）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of administrative area (a division of a country) that is usually below a province/state and above a city/town; in Japan, one of the main local government units","zh":"（行政区划）“府/县/专区”等级别的行政区域，通常介于省/州与市/镇之间；在日本尤指“都/道/府/县”（prefecture）"},"examples":[{"en":"Kyoto Prefecture is famous for its temples and traditional culture.","zh":"京都府以寺庙和传统文化闻名。"},{"en":"The policy is managed at the prefecture level, not by the city.","zh":"这项政策在“prefecture（府/县）”层级管理，而不是由市政府管理。"}]}],"synonyms":["administrative district","region","province (sometimes, depending on country)"],"phonetic":"/ˈpriːfɛktʃɚ/","extraExplanation":["“prefecture”在不同国家对应的行政层级不完全一样：\n- 日本：常译为“都/道/府/县”（如Tokyo Metropolis/東京都也常被统称为prefecture）。\n- 法国：历史上有“prefecture（省会/行政长官辖区）”的概念，现多与“département（省）”的行政体系相关。\n翻译时可根据语境灵活处理：有时译作“县/专区/行政区/府”等，以读者更容易理解为准。","词源上与“prefect（行政长官）”同源，核心意思是“由行政长官管辖的区域”。","相关词：\n- prefect（n.）行政长官；（某些学校）学生干部\n- prefectural（adj.）府级的/县级的（如prefectural government 府政府）\n- province（n.）省；（更泛指）外省、地方（常与prefecture对比）"]}
{"word":"prefectures","summary":{"en":"“Prefectures” are administrative regions governed by a prefect, most commonly referring to Japan’s major local divisions.","zh":"“prefectures”指由长官（prefect）管理的行政区，最常见于指日本的都道府县等主要地方行政区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An administrative area (a region or district) governed by a prefect, especially in some countries such as Japan and France.","zh":"（行政）地方区划；（由长官管理的）行政区，尤指日本、法国等国家的“县/省级”行政区。"},"examples":[{"en":"Japan is divided into 47 prefectures.","zh":"日本分为47个都道府县。"},{"en":"She moved from Tokyo to a rural prefecture for work.","zh":"她为了工作从东京搬到一个乡村县。"}]},{"partOfSpeech":"n.","definition":{"en":"The office, authority, or area of responsibility of a prefect (an official who governs a district).","zh":"（长官的）职务、权限或管辖范围。"},"examples":[{"en":"Public safety was handled by the prefecture in that period.","zh":"在那个时期，公共安全由该长官的管辖机构负责。"}]}],"synonyms":["administrative region","district","province","region"],"phonetic":"/ˈpriːfɛktʃər/","extraExplanation":["“prefecture”来自拉丁语 *praefectura*（意为“长官的管辖区/职权范围”）。英语里最常见的用法是指日本的都道府县（如 Kyoto Prefecture 京都府、Okinawa Prefecture 冲绳县），也可用于描述法国等国家历史或行政体系中的“省/区”。","注意：中文常把日本的“prefecture”译作“县”，但日本的都道府县并不完全等同于中国的“县”，更接近“省级/地区级”的行政单位。"]}
{"word":"prefecundation","summary":{"en":"Prefecundation means the time or processes before fertilization occurs.","zh":"prefecundation 指受精发生之前的时间段或相关过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare) The stage or process that happens before fertilization (fecundation), especially the events leading up to the union of sperm and egg.","zh":"（生物学，少见）受精（fertilization/fecundation）发生之前的阶段或过程，尤指促成精子与卵子结合之前的一系列事件。"},"examples":[{"en":"Researchers measured calcium changes in the egg during the prefecundation period.","zh":"研究人员测量了卵子在受精前（prefecundation）阶段的钙离子变化。"},{"en":"Temperature can affect prefecundation behaviors, such as courtship and mating.","zh":"温度会影响受精前的行为，例如求偶和交配。"}]}],"synonyms":["pre-fertilization","before fertilization","prefertilization"],"phonetic":"/ˌpriːfiːkʌnˈdeɪʃən/","extraExplanation":["这个词非常少见，多见于较旧或较专门的学术写作。现代英文中更常用的是 “pre-fertilization” 或 “before fertilization”。","词形结构：pre-（在……之前）+ fecundation（受精、繁殖）。其中 fecundation 在当代语境里常被 fertilization 取代，但在生殖生物学、农业育种等领域仍可能出现。"]}
{"word":"prefecundatory","summary":{"en":"Prefecundatory means “before fertilization” or “before becoming reproductively capable,” used mostly in scientific contexts.","zh":"prefecundatory 指“受精前的/具备生殖能力之前的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Occurring before fertilization or before becoming able to produce offspring.","zh":"（生物学）发生在受精之前的；在具备生殖能力之前的。"},"examples":[{"en":"Some hormones play a prefecundatory role, preparing the body for possible fertilization.","zh":"有些激素在受精前起准备作用，使身体为可能的受精做好准备。"},{"en":"The study focused on prefecundatory changes in the reproductive tract.","zh":"这项研究聚焦于生殖道在受精前发生的变化。"}]}],"synonyms":["pre-fertilization","preconception","before fertilization"],"phonetic":"/ˌpriːfɪˈkʌndəˌtɔːri/","extraExplanation":["这个词非常罕见，主要出现在较正式的生物学/医学语境里。日常英语更常用 before fertilization（受精前）或 pre-fertilization / preconception（受孕前）。","构词上可拆解为 pre-（在……之前）+ fecund（多产的/有生殖力的）+ -atory（形容词后缀，表示“与……有关的”）。因此整体意思就是“与受精/生殖能力形成之前有关的”。"]}
{"word":"prefederal","summary":{"en":"Prefederal means “before a federal government (especially the U.S. federal government) was established.”","zh":"prefederal 指“联邦政府（尤指美国联邦政府）建立之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in U.S. history) relating to the period before a federal government was formed or before the U.S. Constitution established a stronger national government.","zh":"（尤指美国历史）指联邦政府建立之前的时期，或指美国宪法建立更强国家政府之前的阶段。"},"examples":[{"en":"Prefederal America was governed mainly by the Articles of Confederation.","zh":"美国在“前联邦时期”主要由《邦联条例》治理。"},{"en":"The museum has prefederal documents from the 1780s.","zh":"博物馆收藏了许多18世纪80年代的前联邦时期文件。"}]}],"synonyms":["pre-constitutional","pre-Union (context-dependent)","pre-federal (hyphenated variant)"],"phonetic":"/ˌpriˈfɛdərəl/","extraExplanation":["“prefederal”最常见于美国历史与政治写作，通常指1787年制宪会议之前、以及1789年联邦政府正式运作之前的阶段（常与“Articles of Confederation/《邦联条例》时期”相关）。","构词法：前缀 pre-（“在……之前”）+ federal（“联邦的”）。在学术语境中也可泛指“某国联邦制建立之前”的时期，但不如指美国时常见。","相关常见搭配：prefederal period（前联邦时期）、prefederal era（前联邦时代）、prefederal government/documents（前联邦时期的政府/文件）。"]}
{"word":"prefelic","summary":{"en":"“prefelic” is not a recognized standard English word; it’s likely a misspelling or a context-specific name/term.","zh":"“prefelic”不是常见的标准英语词；更可能是拼写错误或特定语境下的名称/术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a name/brand, an acronym, or a made-up term in a specific context.","zh":"不是标准英语单词。更可能是拼写错误、姓名/品牌名、缩写，或某个特定语境中自造的词。"},"examples":[{"en":"I couldn’t find “prefelic” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“prefelic”，你能把看到它的句子发我吗？"},{"en":"“Prefelic” might be a product name rather than a real English word.","zh":"“prefelic”可能是产品名，而不是正规英语词。"}]}],"phonetic":"/priːˈfɛlɪk/","extraExplanation":["“prefelic”看起来像由前缀 pre-（“在……之前”）+ 词根 felic-（来自拉丁语，常见于 felicity “幸福/好运”）拼出来的，但英语里并没有固定、通用的单词 prefelic。","你可能想写的是：\n1) prolific /prəˈlɪfɪk/（adj. 多产的；大量的）\n2) prefect（n. 级长；（某些国家/体系中的）行政长官）\n3) pre-Felix（“Felix 之前的/早于 Felix 的”，多见于人名或项目名）\n如果你把原句贴出来，我可以帮你判断最可能的目标词并解释用法。"]}
{"word":"prefer","summary":{"en":"“Prefer” means to like or choose one option more than another; it can also mean to formally submit something for consideration.","zh":"“prefer”主要表示“更喜欢/更偏爱、在比较中选择其一”；较正式时也可表示“提出/呈交（供审议）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to like one thing, person, or option more than another; to choose it instead","zh":"更喜欢；更偏爱（某人/某物/某种选择）"},"examples":[{"en":"I prefer tea to coffee.","zh":"比起咖啡，我更喜欢茶。"},{"en":"She prefers working from home because it’s quieter.","zh":"她更喜欢在家工作，因为更安静。"},{"en":"Would you prefer to sit by the window?","zh":"你更想坐在窗边吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to present or suggest something for consideration (more formal usage)","zh":"提出；呈交（较正式用法，用于供考虑）"},"examples":[{"en":"I would like to prefer this proposal to the committee.","zh":"我想把这项提案提交给委员会审议。"}]}],"synonyms":["like better","favor","choose","opt for"],"phonetic":"/prɪˈfɝ/","extraExplanation":["常用搭配：prefer A to B（更喜欢A而不是B）；prefer doing A to doing B（更喜欢做A而不是做B）；prefer to do A（更愿意做A）。","语气区别：prefer（偏好、比较中选择）比 like（喜欢）更强调“比较与选择”。","礼貌表达：Would you prefer…? / I’d prefer…（更委婉）。"]}
{"word":"preferability","summary":{"en":"Preferability means how much one option is more desirable or suitable than another.","zh":"Preferability 指某个选项相较于另一个更值得选择、更合适的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being more desirable, more suitable, or more acceptable than something else; the state of being preferable","zh":"更可取性；更合适／更受欢迎的程度（指比其他选择更好、更适合或更可接受）"},"examples":[{"en":"For long trips, the preferability of a direct flight is obvious.","zh":"长途旅行时，直飞的更可取性很明显。"},{"en":"They debated the preferability of renting versus buying.","zh":"他们讨论了租房和买房哪种更可取。"}]}],"synonyms":["preference","desirability","superiority (in suitability)","advantage"],"phonetic":"/ˌprɛfərəbɪˈlɪti/","extraExplanation":["“Preferability”是从形容词“preferable（更可取的）”加名词后缀“-ity”构成，意思是“更可取的程度/性质”。在日常口语里，这个词偏正式，更多见于写作、报告或学术讨论；口语中常用“how preferable…is / which is better / the advantage of…”来表达。"]}
{"word":"preferable","summary":{"en":"Preferable means “more desirable or more suitable,” often used to recommend one option over another.","zh":"Preferable 表示“更可取/更合适”，常用来建议在多个选项中选择更好的那个。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More desirable or better to choose; liked more than another option.","zh":"更可取的；更合适/更受欢迎的（比另一个选择更好）。"},"examples":[{"en":"A quiet room is preferable for studying.","zh":"安静的房间更适合学习。"},{"en":"It’s preferable to book tickets in advance.","zh":"最好提前订票。"},{"en":"For beginners, shorter texts are preferable to long novels.","zh":"对初学者来说，短文本比长篇小说更合适。"}]}],"synonyms":["more desirable","more suitable","better","advisable","more favorable"],"phonetic":"/ˈprɛfərəbəl/","extraExplanation":["“preferable”常见句型：be preferable (to ...)（比……更可取）；It is preferable to + 动词原形（最好做……）。","易混淆：preferable（更可取的，强调“更好/更合适”）≠ preferred（被偏爱的/首选的，常指“被人选中、最受欢迎的那个”）。例如：My preferred option is tea.（我首选茶。）","语气与使用场景：比“better”更正式，常用于建议、说明选择标准或写作（报告、邮件、说明书）。"]}
{"word":"preferableness","summary":{"en":"Preferableness means how desirable or preferable something is compared with other choices.","zh":"Preferableness 指某事物相对其他选择有多“可取/更受偏好”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being more desirable or better than other options; preference","zh":"更可取性；更优选性；偏好程度"},"examples":[{"en":"We compared the preferableness of the two plans before making a decision.","zh":"我们在做决定前比较了两个方案的更可取性。"},{"en":"The preferableness of remote work depends on your role and lifestyle.","zh":"远程工作的更可取性取决于你的岗位和生活方式。"}]}],"synonyms":["desirability","preference","advantage","appeal"],"phonetic":"/ˈprɛfərəbəlnəs/","extraExplanation":["“preferableness”由 prefer（更喜欢）+ -able（可……的）+ -ness（名词后缀：……的性质）构成，意思是“可取的程度/性质”。","它在日常英语里不算常用，常见替代表达有：preference（偏好）、desirability（理想/可取程度）、advantage（优势）、appeal（吸引力）。在学术或正式写作中偶尔会看到。"]}
{"word":"preferably","summary":{"en":"“Preferably” means “ideally; if possible,” used to suggest the most desired option in a polite way.","zh":"“Preferably”表示“最好/更理想的是（如果可以的话）”，常用于礼貌地提出最希望的选择。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"If possible; in a way that is more desirable than other options.","zh":"最好；更理想的是（在可能的情况下，比其他选择更可取）。"},"examples":[{"en":"Please submit the form online, preferably by Friday.","zh":"请在线提交表格，最好在周五之前。"},{"en":"We’d like a quiet table, preferably near the window.","zh":"我们想要一张安静的桌子，最好靠窗。"},{"en":"Wear comfortable shoes—preferably ones you’ve already broken in.","zh":"穿舒适的鞋——最好是你已经穿磨合过的那种。"}]}],"synonyms":["ideally","if possible","rather","by preference"],"phonetic":"/ˈprɛfərəbli/","extraExplanation":["“Preferably”常用来礼貌地表达“理想选择/建议”，不等于强制要求。语气比“must/need to”更柔和。","常见位置：放在句首（Preferably, ...）、句中（..., preferably ...）、或句末（..., preferably.）。后面常接介词短语（near the window）或时间（by Friday）。","与“preferable（adj. 更可取的）”相关：preferably（adv.）修饰动作/建议；preferable（adj.）修饰名词（a preferable option）。"]}
{"word":"prefered","summary":{"en":"“Preferred” means “liked or chosen more,” and it’s also the past form of “prefer.”","zh":"“preferred”表示“更喜欢的/首选的”，也可作“prefer”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"liked more than others; chosen as the best or most suitable option","zh":"更受喜欢的；首选的；更合适的"},"examples":[{"en":"Email is my preferred way to communicate at work.","zh":"电子邮件是我在工作中首选的沟通方式。"},{"en":"We should use the preferred term in the report.","zh":"我们应在报告中使用更推荐的术语。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “prefer” (to like or choose something more than another)","zh":"“prefer”的过去式/过去分词（更喜欢；更倾向于选择）"},"examples":[{"en":"She preferred tea to coffee.","zh":"她更喜欢茶而不是咖啡。"},{"en":"They preferred to leave early to avoid traffic.","zh":"他们更愿意早点离开以避开交通。"}]}],"synonyms":["favored","chosen","recommended","desired"],"phonetic":"/prɪˈfɝd/","extraExplanation":["拼写提示：正确拼写是 preferred，不是 *prefered*。因为 prefer 重读在第二音节（pre-FER），按规则在加 -ed/-ing 时要把词尾的 r 双写：prefer → preferred / preferring。"]}
{"word":"preferee","summary":{"en":"“Preferee” is usually a misspelling of “referee” (sports judge; also a recommender in applications).","zh":"“preferee”通常是“referee”的拼写错误；“referee”可指比赛裁判，也可指申请中的推荐人。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “referee,” the person who enforces rules in a game, match, or competition.","zh":"“referee”的常见拼写错误，指在比赛中执行规则、维持秩序的裁判。"},"examples":[{"en":"I think you meant “referee,” not “preferee.”","zh":"我觉得你想写的是“referee”，不是“preferee”。"},{"en":"The referee stopped the match after the foul.","zh":"裁判在犯规后叫停了比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also “referee”) A person who gives an official opinion about someone’s character or ability, especially for a job or school application.","zh":"（也写作“referee”）推荐人/证明人：在求职或申请学校时，为某人提供正式评价的人。"},"examples":[{"en":"Please list two referees on your application form.","zh":"请在申请表上填写两位推荐人。"},{"en":"She asked her former manager to be her referee.","zh":"她请前经理做她的推荐人。"}]}],"synonyms":["referee","umpire","official","judge","recommender","reference"],"phonetic":"/ˌrɛfəˈri/","extraExplanation":["“preferee”通常不是标准英语单词，多数情况下是把“referee”（裁判/推荐人）拼错了。最常见的拼写是 re + fe + ree。","英式英语里“referee”在求职语境更常指“推荐人”；美式英语里更常说“reference”（推荐人/推荐信）或“referee”（也能用，但较少见于日常口语）。"]}
{"word":"preference","summary":{"en":"Preference means what you like or choose more, and it can also mean priority or special advantage given to someone in formal situations.","zh":"preference 表示“偏好/更喜欢的选择”，也可表示在正式场合中的“优先权/优先对待”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A choice or liking for one thing over another.","zh":"偏好；更喜欢某一事物而不是另一事物的选择或倾向。"},"examples":[{"en":"Her preference is for tea rather than coffee.","zh":"她更偏好茶而不是咖啡。"},{"en":"We asked guests about their seating preferences.","zh":"我们询问了客人对座位的偏好。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of giving someone or something an advantage or special treatment (often in formal contexts).","zh":"优先；给予某人或某事优势或特殊待遇（常用于较正式语境）。"},"examples":[{"en":"In hiring, no preference will be given based on gender.","zh":"在招聘中，不会基于性别给予任何优先待遇。"},{"en":"Members may receive preference in ticket sales.","zh":"会员在购票时可能享有优先权。"}]}],"synonyms":["liking","choice","favor","inclination","priority"],"phonetic":"/ˈprɛf(ə)rəns/","extraExplanation":["“Preference”常见搭配：have a preference for…（对……有偏好）；show/express a preference for…（表示更喜欢……）；personal preference（个人偏好）；preference is given to…（给予……优先权，偏正式/政策语境）。","词源上来自拉丁语“prae-（在前）+ ferre（携带/带来）”，引申为“把某人/某物放在前面”，因此既可表示“更喜欢”，也可表示“优先对待”。"]}
{"word":"preferences","summary":{"en":"Preference means a liking or choice for something over something else.","zh":"Preference 指对某事物的偏好或更倾向的选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A choice or liking for one thing over another; what someone likes best.","zh":"偏好；更喜欢某事物而不是另一事物；最喜欢的选择。"},"examples":[{"en":"I have a preference for quiet cafés when I study.","zh":"我学习时更偏好安静的咖啡馆。"},{"en":"What are your preferences in music—pop or jazz?","zh":"你在音乐方面有什么偏好——流行还是爵士？"}]},{"partOfSpeech":"n.","definition":{"en":"Something a person chooses as more desirable; a prioritized option.","zh":"优先选择；更理想的选项。"},"examples":[{"en":"For this job, experience is a preference, not a requirement.","zh":"这份工作更倾向于有经验，但不是硬性要求。"},{"en":"Please list your seating preferences on the form.","zh":"请在表格上写下你的座位偏好。"}]}],"synonyms":["liking","choice","taste","inclination","favoritism"],"phonetic":"/ˈprɛf(ə)rəns/","extraExplanation":["“preference”常与介词 for 搭配：a preference for + 名词/动名词（a preference for tea / for working at night）。","常见搭配：personal preference（个人偏好）、consumer preferences（消费者偏好）、have/show a preference for（对……有/表现出偏好）、in order of preference（按偏好顺序）。","注意区分：preference（偏好，主观喜欢） vs. priority（优先级，强调先后顺序和重要程度）。"]}
{"word":"preferent","summary":{"en":"“Preferent” means preferred or given priority; it’s a rare word today, often replaced by “preferred” or “preferential.”","zh":"“preferent”表示“更受偏爱/更被优先选择的；优先的”，现代英语较少用，常被“preferred / preferential”替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preferred over others; given priority or special choice.","zh":"更受偏爱/更被优先选择的；优先的。"},"examples":[{"en":"Applicants with teaching experience may receive preferent consideration.","zh":"有教学经验的申请者可能会获得优先考虑。"},{"en":"In this policy, local suppliers are treated as preferent partners.","zh":"在这项政策中，本地供应商被视为优先合作伙伴。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is preferred; a favored option (rare).","zh":"被偏爱的人/事物；更受青睐的选项（较少见）。"},"examples":[{"en":"Among the finalists, her proposal became the clear preferent.","zh":"在入围者中，她的方案成了明显更受青睐的选择。"}]}],"synonyms":["preferred","favored","priority","chosen","select","preferential"],"phonetic":"/prɪˈfɝːənt/","extraExplanation":["“preferent”在现代英语里相对少见，更常见的表达是“preferred”或“preferential”（尤其在“preferential treatment/terms”=“优惠/优待/优先待遇”中非常常用）。","词源上它与拉丁语“preferre”（把……放在前面、优先）有关，因此常出现在较正式、法律或政策语境里，如“preferent consideration（优先考虑）”。"]}
{"word":"preferential","summary":{"en":"Preferential means giving someone or something special priority or more favorable treatment.","zh":"Preferential 指给予某人或某事优先权或更优惠、更偏袒的待遇。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving preference; treating one person or thing more favorably than others.","zh":"给予优先；对某人或某事更偏袒／更优待的。"},"examples":[{"en":"The company offers preferential rates to long-term customers.","zh":"这家公司给老客户提供优惠（优先）费率。"},{"en":"Preferential treatment can feel unfair to other employees.","zh":"偏袒性的待遇会让其他员工觉得不公平。"},{"en":"Students from the local area may receive preferential admission.","zh":"本地学生可能会获得优先录取。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to choosing or showing a preference (often used in economics, politics, or law).","zh":"与“偏好／优先选择”有关的（常用于经济、政治或法律语境）。"},"examples":[{"en":"The countries signed a preferential trade agreement to reduce tariffs.","zh":"两国签署了优惠（优先）贸易协定以降低关税。"},{"en":"This policy creates a preferential system for certain industries.","zh":"这项政策为某些行业建立了优惠（优先）制度。"}]}],"synonyms":["preferred","favored","advantageous","priority","privileged"],"phonetic":"/ˌprɛfəˈrɛnʃəl/","extraExplanation":["“preferential”常见搭配：preferential treatment（优待/偏袒性待遇）、preferential rate（优惠利率/费率）、preferential access（优先使用权/优先进入权）、preferential tariff（优惠关税）。","词根记忆：prefer（更喜欢）+ -ential（形容词后缀）→ “带有偏好/优先的”。","语气提示：在日常语境里，preferential treatment 往往暗含“不公平的偏袒”；但在商业/政策语境里也可以是“对特定群体的优惠”。"]}
{"word":"preferentialism","summary":{"en":"Preferentialism means giving certain people or choices special preference, often in a way seen as unfair.","zh":"Preferentialism 指对某些人或选择给予特殊优先待遇，常带有“不公平的偏袒”含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or policy of giving preference (special advantage) to certain people, groups, or options over others","zh":"偏袒主义；优待政策（对某些人/群体/选择给予优先或特殊待遇的做法或政策）"},"examples":[{"en":"The report criticized preferentialism in hiring because it reduced trust in the process.","zh":"报告批评了招聘中的偏袒主义，因为这降低了人们对流程的信任。"},{"en":"Preferentialism can appear in school admissions when some applicants get extra consideration.","zh":"当一些申请者得到额外照顾时，学校招生中就可能出现偏袒主义。"}]},{"partOfSpeech":"n.","definition":{"en":"the belief that it is acceptable or desirable to favor one group over others (often in social, ethnic, political, or economic contexts)","zh":"偏好某一群体的观念（常见于社会、族群、政治或经济语境，认为偏向某一群体是合理或可取的）"},"examples":[{"en":"Some argued that the policy encouraged preferentialism instead of equal opportunity.","zh":"一些人认为该政策鼓励偏袒主义，而不是机会平等。"},{"en":"In debates about fairness, preferentialism is often contrasted with neutrality.","zh":"在关于公平的讨论中，偏袒主义常与中立原则相对照。"}]}],"synonyms":["favoritism","preferential treatment","bias","partiality","nepotism"],"phonetic":"/ˌprɛfəˈrɛnʃəˌlɪzəm/","extraExplanation":["“preferentialism”不是非常常见的日常词，更常见的说法是“preferential treatment（优待/照顾）”“favoritism（偏心）”“nepotism（裙带关系）”。它通常带有批评意味，强调“制度性或观念上的偏向”。","在公共政策语境中，它有时会被用来讨论“平权措施/优先照顾（affirmative action）”这类做法，但不同立场的人可能会用该词表达支持或反对；写作时注意语气与立场。","构词提示：preferential（优先的）+ -ism（主义/倾向）。因此它往往指一种“倾向、风气或政策取向”，而不仅是一次性的偏心行为。"]}
{"word":"preferentialist","summary":{"en":"A preferentialist is someone who supports giving preference to certain people or options, often in policy or voting contexts.","zh":"preferentialist 指支持在政策或制度中对某些人或选项给予优先权的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or advocates giving preference to some people, groups, or options over others (for example, in hiring, policy, or voting systems).","zh":"主张“优先待遇/优先选择”的人；支持对某些人、群体或选项给予优先权的人（如招聘、政策或投票制度中）。"},"examples":[{"en":"Some preferentialists argue that targeted scholarships can reduce long-term inequality.","zh":"一些优先待遇支持者认为，定向奖学金可以减少长期不平等。"},{"en":"In the debate on voting reform, preferentialists supported ranked-choice ballots.","zh":"在投票改革的辩论中，偏好投票制度的支持者支持排序选择选票（排名投票）。"}]}],"synonyms":["advocate of preferential treatment","proponent","supporter","partisan"],"phonetic":"/ˌprɛfəˈrɛnʃəlɪst/","extraExplanation":["“preferentialist”不是日常高频词，更多出现在政治学、公共政策、选举制度或社会议题讨论中。常见搭配包括：preferential treatment（优先待遇）、preferential voting（偏好/排序投票）、preferential trade agreement（优惠贸易协定）。在不同语境里，它可能带有立场色彩，因此写作时可用更具体的说法来避免歧义，比如：supporter of affirmative action（支持平权措施的人）或 supporter of ranked-choice voting（支持排名投票的人）。"]}
{"word":"preferentially","summary":{"en":"“Preferentially” means ‘with preference’—giving someone or something priority or more favorable treatment (sometimes unfairly).","zh":"“preferentially”表示“以优先/偏好的方式”，即给予某人或某事优先权或更有利的对待（有时带偏袒之意）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that gives preference; choosing or treating someone/something as more important or more likely than others.","zh":"以偏好/优先的方式；更倾向于选择或对待某人/某事（而不是其他）。"},"examples":[{"en":"Some universities admit local applicants preferentially.","zh":"一些大学会优先录取本地申请者。"},{"en":"The drug binds preferentially to certain receptors in the brain.","zh":"这种药物更倾向于与大脑中的某些受体结合。"},{"en":"In the story, the king treats his eldest son preferentially, which creates resentment.","zh":"在故事中，国王偏袒长子，这引发了怨恨。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a biased or unfair way (often implying favoritism).","zh":"带有偏袒/不公的意味（常暗示任人唯亲或不公平对待）。"},"examples":[{"en":"Employees complained that promotions were given preferentially to friends of management.","zh":"员工抱怨晋升优先给了管理层的熟人。"}]}],"synonyms":["with preference","in preference","primarily","especially","favorably","selectively","prioritizing"],"phonetic":"/ˌprɛfəˈrɛnʃəli/","extraExplanation":["“preferentially”常用于更正式或学术的语境（如政策、法律、经济、医学/生物学），比日常的“mostly / usually / more”更强调“有规则或倾向性的优先”。","常见搭配：preferentially treat（优待/偏袒对待），preferentially select（优先选择），preferentially bind（生物/化学：优先结合），preferentially allocate（优先分配）。","写作提示：如果只是说“更喜欢/更常”，可以用“prefer to / tend to / usually”；如果强调“给予某方优先权”，用“preferentially”更准确。"]}
{"word":"prefering","summary":{"en":"“Preferring” is the -ing form of “prefer,” meaning you like or choose one thing more than another.","zh":"“preferring”是“prefer”的-ing形式，表示更喜欢或更倾向选择某个事物而不是另一个。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “prefer”) liking one option more than another; choosing one thing rather than another.","zh":"（“prefer”的现在分词）更喜欢某个选项；选择A而不是B。"},"examples":[{"en":"I’m preferring quieter places these days.","zh":"这些天我更喜欢安静的地方。"},{"en":"She’s preferring tea to coffee right now.","zh":"她现在更喜欢喝茶而不是咖啡。"},{"en":"We’re preferring to stay home tonight.","zh":"我们今晚更想待在家里。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common, in formal writing) having a preference for something as a general tendency.","zh":"（较少见，多用于较正式表达）总体上倾向于/偏好某事。"},"examples":[{"en":"Consumers are preferring online shopping for convenience.","zh":"消费者因为方便而更偏好网购。"},{"en":"Many students are preferring digital notes over paper notebooks.","zh":"很多学生更偏好用电子笔记而不是纸质笔记本。"}]}],"synonyms":["liking better","favoring","choosing","opting for"],"phonetic":"/prɪˈfɝɪŋ/","extraExplanation":["你写的“prefering”拼写不标准：正确是“preferring”。规则是：以重读闭音节结尾且末尾是“辅音+元音+辅音”的动词（prefer /prɪˈfɝ/），加 -ing 时通常要双写最后一个辅音字母：prefer → preferring。","口语里更常说“I prefer …”而不是“I’m preferring …”。“I’m preferring …”强调“此刻/最近的变化或暂时的偏好”，但用得相对少。"]}
{"word":"preferment","summary":{"en":"A preferment is a pre-fermented mixture used to improve bread flavor and texture; it can also mean the act of fermenting dough in advance.","zh":"preferment 指烘焙中的“预发酵面团/预酵种”，用于提升面包风味与口感；也可作动词表示“预先发酵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ingredient mixture (usually flour + water, sometimes yeast/sourdough starter) prepared before the final dough to develop flavor and texture.","zh":"（烘焙）预发酵面团/预酵种：在最终和面之前先把面粉和水（有时加酵母或酸种）混合并发酵，用来增加风味与改善组织口感。"},"examples":[{"en":"This bread uses a poolish preferment to make the crumb lighter and more aromatic.","zh":"这款面包用了波兰液种（poolish）作预酵种，让内部组织更轻盈、香气更足。"},{"en":"Make the preferment the night before, then mix the final dough in the morning.","zh":"前一晚先做预酵种，第二天早上再揉最终面团。"}]},{"partOfSpeech":"v.","definition":{"en":"To ferment (a dough or mixture) in advance before the main process; to prepare a preferment.","zh":"（烘焙）预先发酵；做预酵种。"},"examples":[{"en":"Some bakers preferment 30% of the flour for deeper flavor.","zh":"有些面包师会把30%的面粉先预发酵，以获得更深的风味。"},{"en":"If you preferment too long, the dough may taste overly sour or weaken.","zh":"如果预发酵时间过长，面团可能会太酸，筋性也会变弱。"}]}],"synonyms":["pre-ferment","starter (baking)","poolish","biga","sponge"],"phonetic":"/ˈpriːfɚˌmɛnt/","extraExplanation":["“Preferment”在日常英语里不算常用词，主要出现在烘焙配方与面包师交流中。常见的预酵种类型包括：poolish（液种，水和面粉比例接近1:1）、biga（意大利硬种，较干）、sponge（海绵种，较松散的预发酵面团）。","使用预酵种的好处通常是：提升香气与层次、让面包更湿润柔软、改善内部孔洞结构，也可能延长保鲜。配方里常会写“X% prefermented flour”（有X%的面粉先进入预酵种）。"]}
{"word":"prefermentation","summary":{"en":"Prefermentation means the period or steps before fermentation starts, especially in brewing or winemaking.","zh":"Prefermentation 指发酵开始前的准备或处理阶段，常用于酿造与食品加工语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stage or process that happens before fermentation begins, especially in brewing, winemaking, or food processing (e.g., preparing, soaking, adjusting temperature, or building yeast activity).","zh":"（尤指酿酒、葡萄酒或食品加工中）发酵开始之前的阶段或处理过程，如预处理、浸泡、调温、培养酵母活性等。"},"examples":[{"en":"During prefermentation, the winemaker adjusts the must’s temperature to improve color extraction.","zh":"在预发酵阶段，酿酒师会调节葡萄汁（must）的温度，以改善颜色萃取。"},{"en":"A short prefermentation soak can bring out more aroma in some wines.","zh":"短时间的预发酵浸渍可以让某些葡萄酒的香气更突出。"}]}],"synonyms":["pre-fermentation","pre-fermentation stage","pre-fermentation process","pre-fermentation treatment"],"phonetic":"/ˌpriːfɚmɛnˈteɪʃən/","extraExplanation":["“prefermentation”多见于专业语境（葡萄酒、啤酒、咖啡与可可等发酵食品的加工说明或论文），日常英语中不算常用。","常见相关表达还有“pre-fermentation (stage/step)”以及更具体的说法，如“cold soak（冷浸渍）”“pre-fermentation maceration（预发酵浸渍）”。"]}
{"word":"preferments","summary":{"en":"“Preferments” can mean promotions/advancements, or (in baking) pre-fermented starter mixtures added to dough for better flavor and texture.","zh":"“Preferments”既可指“晋升/提升”，也可指烘焙中的“预发酵面种”，用于提升面包的风味与口感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) promotions or advancements in rank, position, or honor; acts of giving someone a better job or status.","zh":"（复数）晋升；提升（职位、地位或荣誉）；授予更高职位或待遇的行为。"},"examples":[{"en":"After years of steady work, she finally received two preferments in the same year.","zh":"多年踏实工作后，她竟在同一年获得了两次晋升。"},{"en":"In the old system, preferments sometimes depended on family connections.","zh":"在旧制度下，晋升有时取决于家族关系。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, baking) mixtures of flour, water, and yeast (or sourdough) prepared ahead of time and added to the final dough to improve flavor and texture.","zh":"（复数，烘焙）预发酵面种：把面粉、水和酵母（或天然酵种）提前混合发酵，再加入主面团，用来提升风味与组织口感。"},"examples":[{"en":"This recipe uses two preferments to build deeper flavor.","zh":"这个配方使用两种预发酵面种来增加更深的风味。"},{"en":"The baker mixes preferments the night before and makes the final dough in the morning.","zh":"面包师前一晚先拌好面种，早上再做主面团。"}]}],"synonyms":["promotions","advancements","elevations","appointments","pre-ferments","starters"],"phonetic":"/prɪˈfɝːmənts/","extraExplanation":["“Preferment”有两个常见语境：\n1）职场/社会语境：更偏正式用语，常见于较书面或历史语境。\n2）烘焙语境：指“预发酵面种”。常见类型包括 poolish（波兰种，偏稀）、biga（意大利老面，偏硬）、sponge（海绵种）等；使用面种通常能带来更复杂的香气、较好的延展性与更湿润的组织。"]}
{"word":"preferral","summary":{"en":"“Preferral” is a rare noun meaning “preference” or “favoring.” In most writing, use “preference.”","zh":"“preferral”是较少见的名词，意思是“偏好/偏向”。多数情况下建议用更常见的“preference”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Preference; the act of choosing or favoring one thing over another.","zh":"（较少用）偏好；更喜欢某物而不选另一物的行为。"},"examples":[{"en":"She expressed a clear preferral for tea over coffee.","zh":"她明确表示更偏好喝茶而不是咖啡。"},{"en":"In hiring, the manager showed preferral toward candidates with experience.","zh":"在招聘中，经理更偏向有经验的候选人。"}]}],"synonyms":["preference","favoring","partiality","favoritism"],"phonetic":"/prɪˈfɝːəl/","extraExplanation":["“preferral”在现代英语中很少见，更常用的对应词是“preference”（偏好）或“favoritism”（偏袒）。在正式写作中通常建议用“preference”。","词源上与动词“prefer”（更喜欢）有关；结构类似“referral（转介）/deferral（延期）”这类由动词派生的名词，但“preferral”的使用频率远低于这些词。"]}
{"word":"preferred","summary":{"en":"“Preferred” means “liked or chosen more than others,” and it can also be the past form of “prefer.”","zh":"“preferred”表示“更偏好的/首选的”，也可以是动词“prefer”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Liked more than other options; chosen as the best or most suitable.","zh":"更受喜欢的；优先选择的；被认为最合适的。"},"examples":[{"en":"Email is my preferred way to communicate at work.","zh":"在工作中，电子邮件是我更偏好的沟通方式。"},{"en":"If you have a preferred seat, please tell us in advance.","zh":"如果你有偏好的座位，请提前告诉我们。"}]},{"partOfSpeech":"vt.","definition":{"en":"To like, choose, or want one thing more than another.","zh":"更喜欢；更愿意选择（某个事物）而不是另一个。"},"examples":[{"en":"I prefer tea to coffee.","zh":"比起咖啡，我更喜欢茶。"},{"en":"She preferred to wait until the next day.","zh":"她更愿意等到第二天。"}]}],"synonyms":["favored","chosen","selected","preferred option (phrase)","first choice (phrase)"],"phonetic":"/prɪˈfɝd/","extraExplanation":["“preferred”常见两种用法：①作形容词，表示“首选的/偏好的”（preferred option / preferred method）。②作动词prefer的过去式/过去分词，用在一般过去时或被动结构里（He preferred… / X is preferred by…）。","常见搭配：preferred + noun（preferred candidate 首选候选人）；preferred to（preferred to stay 更愿意留下）；prefer A to B（prefer tea to coffee 更喜欢A而不是B）。注意：英语里通常说“prefer A to B”，而不是“prefer A than B”。"]}
{"word":"preferredly","summary":{"en":"“Preferredly” means “in a preferred way,” but it is rare; “preferably” is usually better.","zh":"“preferredly”表示“以更受偏好的方式”，但较少用；通常用“preferably”更自然。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is preferred; in preference to other options (rare/uncommon in modern English).","zh":"以更受偏好的方式；相较其他选项更倾向于（现代英语中较少用）。"},"examples":[{"en":"If possible, the report should be sent preferredly by email.","zh":"如果可以的话，报告最好优先用电子邮件发送。"},{"en":"Guests were preferredly seated near the front.","zh":"客人优先被安排坐在前排。"}]}],"synonyms":["preferably","by preference","ideally"],"phonetic":"/prɪˈfɝdli/","extraExplanation":["“preferredly”在当代英语里很少见，更自然、更常用的是“preferably”（最好/更理想的是）。例如：Preferably, send the report by email.（最好用邮件发送。）","构词上是 preferred（更受偏爱的）+ -ly（表示“以……方式”），但因为“preferably”已固定为常用表达，所以“preferredly”多见于较旧或较正式的写法。"]}
{"word":"preferredness","summary":{"en":"“Preferredness” means the degree to which something is preferred (chosen or liked more than alternatives), often in formal or technical contexts.","zh":"“preferredness”指某事物被偏好、被优先选择的程度，常用于较正式或技术性语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being preferred; how much something is chosen over alternatives","zh":"被偏好（被优先选择）的程度；某事物相对其他选项更受青睐的程度"},"examples":[{"en":"In this survey, we measured the preferredness of each logo design.","zh":"在这项调查中，我们测量了每个标志设计的“被偏好程度”。"},{"en":"Price and comfort both affect the preferredness of a product.","zh":"价格和舒适度都会影响产品的受偏好程度。"},{"en":"The app ranked songs by preferredness based on user likes.","zh":"这个应用根据用户点赞按“受偏好程度”给歌曲排序。"}]}],"synonyms":["preference","preference level","favorability","appeal","popularity"],"phonetic":"/prɪˈfɝdnəs/","extraExplanation":["“preferredness”不是日常最常用的词，更常见的表达是“preference（偏好）”或“how preferred something is（有多受欢迎/多被偏好）”。它常见于较正式或技术性的语境，比如市场研究（量化偏好）、用户体验/推荐系统（偏好评分）、以及语言学/心理学实验（比较不同选项的可取性/自然度）。","在写作中如果担心生硬，可以用更自然的替换：“preference rating（偏好评分）”、“degree of preference（偏好程度）”、“preference level（偏好水平）”。"]}
{"word":"preferrer","summary":{"en":"A preferrer is someone who likes one option better than another.","zh":"preferrer 指更喜欢某个选择的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who prefers one thing over another; someone who shows a preference","zh":"偏好者；更喜欢某物的人"},"examples":[{"en":"I’m a tea preferrer, but I’ll drink coffee if I have to.","zh":"我更偏好喝茶，但如果不得不的话我也会喝咖啡。"},{"en":"As a quiet preferrer, she chose the library over the café.","zh":"作为喜欢安静的人，她选择了图书馆而不是咖啡馆。"}]}],"synonyms":["person who prefers","fan","enthusiast"],"phonetic":"/prɪˈfɜrɚ/","extraExplanation":["“preferrer”是由动词“prefer（更喜欢）”加上表示“做某事的人”的后缀“-er”构成，意思是“偏好……的人”。\n\n拼写上因为“prefer”重读在第二音节（pre-FER），加“-er”时通常会把词尾的“r”双写成“preferrer”（类似“refer → referrer”）。\n\n注意：在日常英语里，“preferrer”不算特别常用；更常见的说法是“I prefer …”或“a person who prefers … / a fan of …”。"]}
{"word":"preferrers","summary":{"en":"“Preferrers” means people who prefer one option over another.","zh":"“preferrers”指更喜欢某一选项而不是另一选项的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who like one thing or choice more than another","zh":"更喜欢某事物或某种选择的人；偏好者"},"examples":[{"en":"Tea preferrers often choose cafes with a wide variety of blends.","zh":"爱喝茶的人往往会选择有多种茶叶可选的咖啡馆。"},{"en":"The survey showed more online-shopping preferrers than in-store shoppers.","zh":"调查显示，偏好网购的人比喜欢线下购物的人更多。"}]}],"synonyms":["fans","supporters","people who prefer…","those who prefer…","choosers"],"phonetic":"/prɪˈfɝɚz/","extraExplanation":["“preferrers”是“preferrer”的复数形式，来自动词“prefer（更喜欢）+ -er（表示做某事的人）”。","日常英语里更常见的表达是“people who prefer …（喜欢……的人）”或“those who prefer …”，而“preferrer(s)”多见于统计、问卷、市场报告等较正式语境。"]}
{"word":"preferring","summary":{"en":"“Preferring” means choosing or liking one option more than another, and it’s the -ing form of “prefer.”","zh":"“preferring”表示“更喜欢/偏爱某个选项”，是动词“prefer”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"choosing or liking one thing more than another; favoring","zh":"更喜欢某事而不是另一件事；偏爱"},"examples":[{"en":"She is preferring tea to coffee these days.","zh":"她这些天更喜欢喝茶而不是咖啡。"},{"en":"Many students are preferring online classes because they save time.","zh":"许多学生更偏好网课，因为更省时间。"}]},{"partOfSpeech":"v.","definition":{"en":"politely stating what you would like more (often in requests: “I’d prefer…”)","zh":"（常用于提出请求时）礼貌地表达更想要的选择（如：I’d prefer...）"},"examples":[{"en":"I’m preferring a quiet table, if possible.","zh":"如果可以的话，我更想要一张安静一点的桌子。"},{"en":"He’s preferring to meet tomorrow rather than today.","zh":"他更希望明天见，而不是今天。"}]}],"synonyms":["favoring","liking better","choosing","opting for"],"phonetic":"/prɪˈfɝɪŋ/","extraExplanation":["“preferring”是动词“prefer”的现在分词/动名词形式。拼写上把词尾的字母“r”双写（prefer → preferring），因为重音在最后一个音节（pre-FER），常见规则是：重读闭音节结尾的辅音要双写再加 -ing。"]}
{"word":"preferrous","summary":{"en":"Preferrous (rare) means “pre–Iron Age; before iron use became common.”","zh":"preferrous（罕见）指“铁器使用普及之前的；铁器时代之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Existing or happening before iron was used or became important; pre–Iron Age.","zh":"（罕见）在铁器使用之前的；铁器时代之前的。"},"examples":[{"en":"Archaeologists described the site as preferrous, dating to a time before iron tools were common.","zh":"考古学家把该遗址描述为 preferrous（铁器使用尚未普及之前的时期），年代早于铁制工具普遍出现。"},{"en":"The museum has a small collection of preferrous artifacts made of stone and bronze.","zh":"博物馆有一小批 preferrous 文物，主要由石器和青铜制成。"}]}],"synonyms":["pre-Iron Age","pre-ferrous","prehistoric","Bronze Age (context-dependent)"],"phonetic":"/priˈfɛrəs/","extraExplanation":["“preferrous”非常少见，更常见的写法是带连字符的 **pre-ferrous**，意思接近 **pre-Iron Age / before ironworking**。在一般英语里，人们更常用 **prehistoric（史前的）**、**pre-Iron Age（铁器时代之前的）**、**Bronze Age（青铜时代的）** 来表达类似概念。"]}
{"word":"prefers","summary":{"en":"“Prefers” means “likes/chooses something more,” the third-person singular form of “prefer.”","zh":"“prefers”表示“更喜欢/更偏向选择某物”，是“prefer”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"likes one thing or choice more than another; chooses it instead of something else (third-person singular of “prefer”).","zh":"更喜欢某物或某种选择；在两者中选择更偏好的那个（“prefer”的第三人称单数）。"},"examples":[{"en":"She prefers tea to coffee.","zh":"她更喜欢茶而不是咖啡。"},{"en":"He prefers working from home on Fridays.","zh":"他更喜欢周五在家工作。"},{"en":"The customer prefers the blue one.","zh":"这位顾客更喜欢蓝色那款。"}]},{"partOfSpeech":"v.","definition":{"en":"would rather; expresses a polite preference (often about what someone wants).","zh":"宁愿；用于较礼貌地表达偏好（常用于说明想要什么）。"},"examples":[{"en":"My mother prefers that we call before visiting.","zh":"我妈妈更希望我们拜访前先打电话。"},{"en":"The manager prefers everyone to arrive on time.","zh":"经理更希望大家准时到。"}]}],"synonyms":["likes better","would rather","favors","chooses"],"phonetic":"/prɪˈfɝz/","extraExplanation":["“prefers”是动词“prefer”的一般现在时第三人称单数形式（he/she/it prefers）。","常见搭配：\n1) prefer A to B（更喜欢A而不是B）：She prefers tea to coffee.\n2) prefer doing A to doing B：He prefers walking to driving.\n3) prefer to do A (rather than do B)：I prefer to stay home (rather than go out).\n4) prefer + that从句（带虚拟/建议语气更常见于正式表达）：She prefers that he (should) apologize.","注意不要说成“prefer than”。英语里通常用“to”来对比两者（prefer A to B）。"]}
{"word":"prefertile","summary":{"en":"A rare adjective meaning “before becoming fertile; not yet able to reproduce.”","zh":"一个较少见的形容词，意思是“生育前的；尚未具备繁殖能力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) happening or existing before an organism becomes fertile (able to reproduce).","zh":"（罕见/生物学术语）指在生物达到“可繁殖/具生育能力”之前发生或存在的。"},"examples":[{"en":"Some insects have a prefertile stage when they grow but cannot reproduce yet.","zh":"一些昆虫有“生育前期”（prefertile stage）：它们在生长，但还不能繁殖。"},{"en":"The study compared hormone levels in prefertile and fertile animals.","zh":"这项研究比较了生育前期与具生育能力动物的激素水平。"}]}],"synonyms":["pre-fertile","pre-reproductive","immature","not yet fertile"],"phonetic":"/ˌpriːˈfɝːtaɪl/","extraExplanation":["“prefertile”并不是日常英语常用词，更常见的写法是带连字符的“pre-fertile”。在普通语境里，人们往往用“prepubertal”（青春期前的）、“immature”（未成熟的）、或“not yet fertile”（尚未具生育能力）来表达。","构词：前缀“pre-”（在……之前）+ “fertile”（可繁殖的/有生育能力的）。","如果你原本想拼的是别的词（例如“preferable”“fertile”“prefabricate”等），告诉我句子或上下文，我可以帮你确认正确单词与用法。"]}
{"word":"prefertility","summary":{"en":"Prefertility means the stage before fertility or before reproduction begins.","zh":"prefertility 指“生育前期”，即在具备生育能力或开始生殖之前的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period of life before a person becomes biologically able to have children; also used in biology/demography for the stage before reproduction begins","zh":"生育前期；（生物/人口学）指在具备生殖能力或开始生殖之前的阶段"},"examples":[{"en":"In humans, the prefertility stage includes childhood and early adolescence.","zh":"在人类中，生育前期包括儿童期和青春期早期。"},{"en":"The study compared nutrition during prefertility with health outcomes later in life.","zh":"这项研究比较了生育前期的营养状况与后来健康结果之间的关系。"}]},{"partOfSpeech":"n.","definition":{"en":"(in demography) the time before a woman’s first birth (used in some older or specialized writing)","zh":"（人口学）初育前阶段；指女性第一次生育之前的一段时间（多见于较旧或专门文献）"},"examples":[{"en":"Their model measured the length of prefertility before the first child was born.","zh":"他们的模型测量了第一次生育之前的初育前阶段时长。"}]}],"synonyms":["prepuberty","pre-reproductive period","before reproductive age"],"phonetic":"/ˌpriːfərˈtɪləti/","extraExplanation":["“prefertility”由前缀 pre-（在……之前）+ fertility（生育力）组成，属于偏学术/专业用词，日常英语中更常说 “before puberty（青春期前）” 或 “before reproductive age（到达生育年龄之前）”。","在医学语境里，如果你想表达“还没有生育能力/未到生育年龄”，更自然的搭配是 “prepubertal” 或 “not yet of reproductive age”。"]}
{"word":"prefertilization","summary":{"en":"“Prefertilization” means “before fertilization,” mainly used in medical or biology contexts.","zh":"“prefertilization”表示“受精前”，主要用于医学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before fertilization (before an egg and sperm join).","zh":"发生在受精之前的；在卵子与精子结合之前进行的。"},"examples":[{"en":"Doctors sometimes give prefertilization counseling to explain treatment options.","zh":"医生有时会在受精前进行咨询，解释治疗选择。"},{"en":"In biology class, we learned about prefertilization events like ovulation and sperm migration.","zh":"在生物课上，我们学习了排卵、精子移动等受精前过程。"}]}],"synonyms":["before fertilization","pre-conception (related, not identical)"],"phonetic":"/ˌpriːˌfɝːtəlaɪˈzeɪʃən/","extraExplanation":["“prefertilization”多见于医学与生殖生物学语境，常用来修饰“screening（筛查）”“diagnosis（诊断）”“counseling（咨询）”“events/processes（事件/过程）”等名词。","构词：pre-（在……之前）+ fertilization（受精）。在日常英语中更常见的表达是“before fertilization”。"]}
{"word":"prefertilize","summary":{"en":"Prefertilize means to fertilize soil before planting.","zh":"prefertilize 指在种植或播种之前先给土壤施肥。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add fertilizer to soil (or a planting area) before planting or sowing seeds","zh":"在播种或栽种之前给土壤（或种植区域）施肥、预先施肥"},"examples":[{"en":"The farmer prefertilized the field in early spring to prepare for corn planting.","zh":"农民在早春给田地预先施肥，为种玉米做准备。"},{"en":"If you prefertilize the garden bed, young plants may establish faster.","zh":"如果你先给花坛预施肥，幼苗可能会更快扎根生长。"}]}],"synonyms":["pre-fertilize","fertilize beforehand","pre-plant fertilize","apply fertilizer before planting"],"phonetic":"/ˌpriˈfɝtəˌlaɪz/","extraExplanation":["“prefertilize”由前缀 pre-（“在……之前”）+ fertilize（施肥）构成，常见于农业、园艺、草坪养护等语境。","实际使用中，人们也常说“fertilize the soil before planting / apply fertilizer pre-plant（播种前施肥）”。"]}
{"word":"prefertilized","summary":{"en":"Prefertilized means “fertilized in advance,” most often used for soil, potting mix, or fields.","zh":"prefertilized 指“预先施肥的”，最常用于土壤、盆栽土或农田。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in gardening or farming) fertilized in advance, before planting or before a later stage of growth.","zh":"（尤用于园艺或农业）预先施肥的；在播种或后续生长阶段之前就施过肥的。"},"examples":[{"en":"Buy prefertilized potting soil if you want an easy start for houseplants.","zh":"如果你想让室内植物更容易上手，可以买预先施肥的盆栽土。"},{"en":"The prefertilized field needed less fertilizer during the early growth period.","zh":"这块预先施肥的田地在早期生长期需要的肥料更少。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, less common) fertilized ahead of time or before another planned step in a process.","zh":"（生物学，较少见）在某个计划步骤之前就完成受精/使其受精的。"},"examples":[{"en":"Researchers compared prefertilized samples with samples fertilized later.","zh":"研究人员比较了预先受精的样本与后期受精的样本。"}]}],"synonyms":["pre-fertilized","pretreated","enriched"],"phonetic":"/ˌpriˈfɝːtəˌlaɪzd/","extraExplanation":["“prefertilized”常见于园艺/农业语境，也常写作“pre-fertilized”（加连字符更清晰），意思是“先把肥料拌入土壤/基质或先对地块施肥”，强调“提前完成”。","注意区分：在种植语境里通常指“预先施肥”；在生物学语境里才可能接近“预先受精/使受精”，具体要看上下文。"]}
{"word":"prefertilizing","summary":{"en":"“Prefertilizing” means fertilizing the soil in advance—before planting or transplanting.","zh":"“prefertilizing”指在播种、栽种或移栽前预先施肥（预施肥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Applying fertilizer to soil before planting or seeding (the act or process of fertilizing in advance).","zh":"（在播种或栽种之前）预先给土壤施肥；预施肥（这一行为或过程）。"},"examples":[{"en":"Prefertilizing the field can help young plants get nutrients early.","zh":"在田地里预施肥可以帮助幼苗更早获得养分。"},{"en":"They recommend prefertilizing the garden bed before you transplant seedlings.","zh":"他们建议在移栽幼苗之前先给菜床预施肥。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of fertilizing something in advance (present participle of “prefertilize”).","zh":"预先施肥的动作（“prefertilize”的现在分词形式）。"},"examples":[{"en":"We are prefertilizing the soil this week, then planting next week.","zh":"我们这周先给土壤预施肥，下周再种植。"}]}],"synonyms":["pre-fertilizing","pre-fertilization","pre-fertilizing the soil","applying base fertilizer","fertilizing before planting"],"phonetic":"ˌpriˈfɝtəˌlaɪzɪŋ","extraExplanation":["“prefertilizing / prefertilize”多见于农业、园艺语境（说明书、种植指南、论文等），日常口语里更常说“fertilize the soil before planting”。","预施肥常见做法包括：基肥（base fertilizer）、翻入土中（work it into the soil）等；是否适合要看作物、土壤检测结果和肥料类型（尤其要避免过量导致“烧根/烧苗”。）"]}
{"word":"prefervid","summary":{"en":"“prefervid” is not a standard word; it often reads as shorthand for “prefer vid(=video),” meaning you prefer video content.","zh":"“prefervid”不是标准词；常被理解为“prefer vid（=prefer video）”的简写，意思是你更喜欢视频内容。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Internet slang/text shorthand) “prefer vid” = “prefer video,” meaning you would rather watch a video than use another format (like text or images).","zh":"（网络/聊天简写）“prefer vid”=“prefer video（更喜欢视频）”，表示你更愿意看视频，而不是看文字或图片等形式。"},"examples":[{"en":"If you have instructions, I prefer vid instead of a long article.","zh":"如果你有教程，我更喜欢视频，而不是很长的文章。"},{"en":"I prefer vid—can you send a clip?","zh":"我更喜欢视频——你能发个短片吗？"}]},{"partOfSpeech":"other","definition":{"en":"A likely misspelling or username/brand; it is not a standard English dictionary word.","zh":"可能是拼写错误、用户名或品牌名；它不是标准英语词典词汇。"},"examples":[{"en":"Did you mean “prefer” or “preference”?","zh":"你想说的是“prefer（更喜欢）”还是“preference（偏好）”？"},{"en":"I couldn’t find “prefervid” in the dictionary.","zh":"我在词典里找不到“prefervid”。"}]}],"synonyms":["prefer video","rather watch a video","would rather see a video"],"phonetic":"/prɪˈfɝ vɪd/","extraExplanation":["“vid”常见于口语或网络用语，是“video”的非正式缩写（比“video”更随意）。","如果你是在某个应用/网站里看到“prefervid”，也可能是功能名或账号名。你可以告诉我它出现的句子或页面，我可以帮你更准确判断意思。"]}
{"word":"prefestival","summary":{"en":"Prefestival means “before a festival,” especially describing events or preparations leading up to it.","zh":"prefestival 指“节日前的”，多用于描述节日开始前的活动或准备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a festival; related to the period or activities leading up to a festival.","zh":"节日前的；与节日前期（筹备、预热）活动有关的。"},"examples":[{"en":"The city held a pre-festival concert to build excitement for the main event.","zh":"这座城市举办了节前音乐会，为主活动预热。"},{"en":"We joined some pre-festival workshops on local crafts.","zh":"我们参加了几个节前的本地手工艺工作坊。"},{"en":"Pre-festival preparations can take weeks.","zh":"节前准备可能需要好几周。"}]},{"partOfSpeech":"n.","definition":{"en":"A time or stage before a festival (less common usage).","zh":"节日前期；节日开始前的阶段（较少见用法）。"},"examples":[{"en":"During the pre-festival, hotels often raise their prices.","zh":"在节日前期，酒店常常会上调价格。"},{"en":"The pre-festival is usually the best time to arrive and avoid crowds.","zh":"节日前期通常是抵达并避开人群的最佳时间。"}]}],"synonyms":["pre-festival","before-the-festival","lead-up (to the festival)","pre-event"],"phonetic":"/ˌpriːˈfɛstəvəl/","extraExplanation":["“prefestival”更常写作“pre-festival”（带连字符），尤其在新闻报道、活动宣传中更自然清晰：pre-festival events / pre-festival season。","常见搭配：pre-festival concert（节前音乐会）、pre-festival market（节前集市）、pre-festival preparations（节前准备）、pre-festival buzz（节前热度/话题）。"]}
{"word":"prefet","summary":{"en":"“Prefect” most commonly means a student leader with discipline duties (especially in British schools); it can also mean a French regional state official.","zh":"“Prefect”最常指（尤指英国学校的）学生级长/学长；也可指法国的地方行政长官（省长）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Especially in British schools) a student who is given authority and responsibilities to help teachers maintain discipline and organize school activities.","zh":"（尤指英国学校）级长；学长（被授予一定管理权，协助老师维持纪律、组织活动的学生）"},"examples":[{"en":"She was chosen as a prefect because she was responsible and fair.","zh":"她因为认真负责、处事公平而被选为级长。"},{"en":"Prefects help keep order in the hallway during breaks.","zh":"级长会在课间休息时协助维持走廊秩序。"}]},{"partOfSpeech":"n.","definition":{"en":"A French government official who represents the state in a region (a “préfet”).","zh":"（法国）省长／地方行政长官（代表中央政府的官员，“préfet”）"},"examples":[{"en":"The prefect announced new safety measures after the storm.","zh":"风暴过后，省长宣布了新的安全措施。"},{"en":"In France, the prefect represents the national government locally.","zh":"在法国，省长在地方代表国家政府。"}]}],"synonyms":["student leader","hall monitor","school prefect","administrator (French context)"],"phonetic":"/ˈpriːfekt/","extraExplanation":["你输入的“prefet”通常是拼写错误，英语标准拼法是 **prefect**。但在法语里 **préfet**（常在英文中写作 prefect）是一个正式的行政官职。","在英语语境中，**prefect** 最常见的是英式校园文化：由学校任命的学生干部（如 hall prefect、head prefect），在美式学校里不算常见，类似概念更常用 *student leader*、*hall monitor*、*student prefect*（较少见）。"]}
{"word":"prefeudal","summary":{"en":"“Prefeudal” means “before feudalism.”","zh":"“prefeudal”指“封建制度之前的；前封建的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before feudalism (the medieval European system in which land was held by nobles in exchange for service).","zh":"发生在封建制度（中世纪欧洲以土地换取效忠与服役的制度）之前的；前封建的。"},"examples":[{"en":"The textbook describes prefeudal farming communities that relied on kinship ties.","zh":"这本教材描述了依靠亲族关系维系的前封建农业社群。"},{"en":"In some regions, prefeudal laws were replaced gradually rather than suddenly.","zh":"在一些地区，前封建的法律是逐步被取代的，而不是突然改变的。"}]}],"synonyms":["pre-feudal","pre-feudalistic","early (pre-)medieval (context-dependent)"],"phonetic":"/priˈfjuːdəl/","extraExplanation":["“prefeudal”常写作“pre-feudal”，尤其在学术写作中更常见。它多用于历史、考古、人类学语境，强调“封建制度形成之前的社会形态”，不一定等同于“原始/落后”，而是指不同的经济与权力结构。","“feudal/feudalism”通常让人想到欧洲中世纪，但在不同国家的历史讨论里，有时也会借用“feudal”来类比其他地区的制度；使用“prefeudal”时，最好说明具体地区与时代，避免过度概括。"]}
{"word":"prefeudalic","summary":{"en":"Prefeudal means “before feudalism,” mostly used in historical writing.","zh":"prefeudal 指“封建制度之前的”，多用于历史类写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before feudalism (the medieval system where land was held in exchange for service and loyalty).","zh":"封建制度出现之前的；前封建的（指在中世纪“以土地换取效忠与服役”的封建制度形成之前）。"},"examples":[{"en":"The book describes prefeudal communities and how they organized land and labor.","zh":"这本书描述了前封建社会，以及它们如何组织土地与劳作。"},{"en":"Some historians debate whether these customs are truly prefeudal or early feudal.","zh":"一些历史学家争论这些习俗究竟是前封建的，还是早期封建的。"}]}],"synonyms":["pre-feudal","pre-feudalistic","early medieval (context-dependent)"],"phonetic":"/ˌpriːˈfjuːdəl/","extraExplanation":["“prefeudalic”更常见的拼写是 prefeudal 或 pre-feudal；“prefeudalic”在现代英语里很少见，可能会被当作拼写错误。","feudalism（封建制度）在英语语境里常指中世纪欧洲的社会结构：领主拥有土地，附庸/骑士以军事或其他服务换取土地与保护；因此 prefeudal 常用于历史、考古、人类学写作，指该体系形成之前的社会与制度。"]}
{"word":"prefeudalism","summary":{"en":"“Prefeudalism” means the conditions or systems that came before feudalism, mainly used in historical contexts.","zh":"“Prefeudalism”指封建制度出现之前的社会或制度状态，主要用于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the social, political, or economic conditions that existed before feudalism developed (especially in early medieval Europe).","zh":"前封建制度；封建制度形成之前的社会、政治或经济状态（尤指欧洲中世纪早期）。"},"examples":[{"en":"Some historians use “prefeudalism” to describe the period before full feudal lord–vassal relationships became common.","zh":"一些历史学家用“prefeudalism（前封建制度）”来描述完整的领主—附庸关系普及之前的时期。"},{"en":"In this textbook, prefeudalism refers to early local power structures that were not yet formal feudalism.","zh":"在这本教材里，prefeudalism 指尚未发展成正式封建制度的早期地方权力结构。"}]}],"synonyms":["pre-feudal society","early medieval social system","protofeudalism","pre-feudal period"],"phonetic":"/ˌpriːˈfjuːdəlˌɪzəm/","extraExplanation":["“prefeudalism”通常写作带连字符的“pre-feudalism”。它不是日常英语词汇，更常见于历史学写作或课堂讨论。","不同学者对“前封建制度”的界定不完全一致：有人强调罗马帝国晚期到中世纪早期的土地制度与军事依附关系的过渡；也有人用它泛指“封建制度出现之前的阶段”。使用时最好说明你所指的地区与时期。"]}
{"word":"preffroze","summary":{"en":"“Prefroze” means “froze in advance” (past tense of “prefreeze”).","zh":"“Prefroze” 表示“预先冷冻”（是 “prefreeze” 的过去式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense of **prefreeze**) to freeze something in advance, before it is needed or before the next step (often in cooking or food storage).","zh":"（**prefreeze** 的过去式）预先冷冻；在需要之前或下一步操作前先把某物冻起来（常见于烹饪/食品保存语境）。"},"examples":[{"en":"I **prefroze** the berries so they wouldn’t turn into mush in the smoothie.","zh":"我把莓果**预先冷冻**了，这样做果昔时就不会变成糊。"},{"en":"The chef **prefroze** the cake layers to make frosting easier.","zh":"厨师把蛋糕胚**先冷冻**，这样更容易抹奶油。"}]}],"synonyms":["froze in advance","froze ahead of time","pre-chilled (similar idea)"],"phonetic":"/priːˈfroʊz/","extraExplanation":["“preffroze” 很可能是拼写错误；更常见的拼法是 **prefroze**（= pre + froze）。其原形是 **prefreeze**，过去分词常写作 **prefrozen**。","这个词在日常口语里不算常见，食谱、食品加工说明或家庭备餐（meal prep）语境中更容易见到。更常用的表达包括 **freeze ahead of time**（提前冷冻）或 **freeze in advance**（预先冷冻）。"]}
{"word":"preffrozen","summary":{"en":"“Pre-frozen” means already frozen ahead of time; it can also refer to freezing something in advance (often phrased as “pre-freeze”).","zh":"“pre-frozen”指“预先冷冻的”；也可表示“提前冷冻”（更常用动词形式“pre-freeze”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “pre-frozen”) already frozen before being sold, cooked, or used.","zh":"（通常拼作“pre-frozen”）预先冷冻的；在出售、烹饪或使用前就已经冻结的。"},"examples":[{"en":"Use pre-frozen fruit to make a smoothie without adding ice.","zh":"用预先冷冻的水果做奶昔，就不用再加冰了。"},{"en":"The recipe calls for pre-frozen shrimp, thawed overnight in the fridge.","zh":"这个食谱需要预先冷冻的虾，放冰箱冷藏室过夜解冻。"}]},{"partOfSpeech":"vt.","definition":{"en":"to freeze something in advance (often used as “pre-freeze”).","zh":"提前把某物冷冻（常用作“pre-freeze”）。"},"examples":[{"en":"You can pre-freeze the bowl so the ice cream sets faster.","zh":"你可以提前把碗冷冻，这样冰淇淋更快成型。"}]}],"synonyms":["frozen in advance","previously frozen","pre-chilled (related, but not the same)"],"phonetic":"/ˌpriːˈfroʊzən/","extraExplanation":["“preffrozen”看起来像拼写错误，常见写法是“pre-frozen”（加连字符）或“prefrozen”（不加连字符）。在包装食品、烹饪说明中更常见“pre-frozen”。","注意区分：形容词多说“pre-frozen”（预先冷冻的），动词更常说“pre-freeze”（提前冷冻）。"]}
{"word":"prefiction","summary":{"en":"A prediction is a statement about what you think will happen in the future.","zh":"prediction 指对未来将发生的事情作出的预测或推测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A statement or guess about what will happen in the future, based on information or experience.","zh":"对未来将发生事情的预测；根据信息或经验做出的推测。"},"examples":[{"en":"Her prediction was correct: it started raining at noon.","zh":"她的预测是对的：中午开始下雨了。"},{"en":"The weather forecast includes a prediction of heavy snow tonight.","zh":"天气预报里预测今晚会有大雪。"},{"en":"It’s hard to make a prediction without enough data.","zh":"没有足够的数据，很难做出预测。"}]}],"synonyms":["forecast","projection","estimate","guess"],"phonetic":"/prɪˈdɪkʃən/","extraExplanation":["“prefiction”不是常见或标准的英语单词，通常是把 **prediction** 拼错了。","**prediction** 来自前缀 **pre-**（“在……之前”）+ **dict**（“说、宣告”，同根词如 *dictionary*、*dictate*），字面意思是“提前说出（将会发生的事）”。","相关常见搭配：*make a prediction*（做预测），*accurate prediction*（准确的预测），*weather prediction*（天气预测）。"]}
{"word":"prefictional","summary":{"en":"Prefictional means “before or relating to the period before developed fiction,” mainly used in academic/literary contexts.","zh":"prefictional 指“在成熟虚构文学形成之前的/与之相关的”，多用于学术或文学研究语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; literary studies) Existing before, or relating to a time before, fully developed fictional storytelling (e.g., before the modern novel or short story).","zh":"（少见；文学研究）指在成熟的虚构叙事（如现代小说、短篇小说）形成之前的，或与其之前阶段相关的。"},"examples":[{"en":"Some scholars describe certain myths and legends as part of a prefictional stage of narrative.","zh":"一些学者把某些神话与传说描述为叙事的“前虚构”阶段。"},{"en":"The book traces how prefictional forms gradually shaped what we now call fiction.","zh":"这本书追溯了“前虚构”形式如何逐渐塑造出我们今天所说的小说/虚构文学。"}]}],"synonyms":["protofictional","pre-novelistic","pre-literary","early narrative"],"phonetic":"/ˌpriˈfɪkʃənəl/","extraExplanation":["“prefictional”并不是日常英语中的常用词，更多出现在文学史、叙事学等学术写作里。更常见的表达通常是 before fiction developed / early narrative traditions / proto-fiction 等。","构词理解：pre- 表示“在……之前”，fiction 表示“虚构文学/小说”，-al 构成形容词，因此整体意思就是“在虚构文学出现或定型之前的”。"]}
{"word":"prefight","summary":{"en":"“Prefight” (more commonly written “pre-fight”) means “before a fight,” especially in combat sports.","zh":"“prefight”（更常写作“pre-fight”）指“赛前的/赛前阶段的”，尤用于格斗类运动语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in boxing, MMA, etc.) happening before a fight; relating to activities, interviews, or training done before the match.","zh":"（尤指拳击、综合格斗等）赛前的；与比赛前的活动、采访或训练有关的。"},"examples":[{"en":"The fighters did a prefight weigh-in on Friday.","zh":"选手们在周五进行了赛前称重。"},{"en":"There was a lot of prefight talk, but the match was respectful.","zh":"赛前放了不少狠话，但比赛过程很尊重对手。"}]},{"partOfSpeech":"n.","definition":{"en":"the period of time before a fight, or the events that happen then (often written with a hyphen: pre-fight).","zh":"赛前阶段；赛前发生的事情（常写作带连字符的 pre-fight）。"},"examples":[{"en":"During the prefight, the coach kept his athlete calm.","zh":"在赛前阶段，教练一直让运动员保持冷静。"},{"en":"The documentary focuses on the prefight more than the fight itself.","zh":"这部纪录片更多聚焦赛前，而不是比赛本身。"}]}],"synonyms":["pre-fight","before the fight","pregame (in other sports)"],"phonetic":"/ˌpriːˈfaɪt/","extraExplanation":["“prefight”在实际英语中更常写作 **pre-fight**（带连字符），属于前缀 **pre-**（“在……之前”）+ fight 组合而成。体育新闻和比赛宣传里非常常见，例如：pre-fight interview（赛前采访）、pre-fight press conference（赛前发布会）、pre-fight jitters（赛前紧张）。"]}
{"word":"prefigurate","summary":{"en":"Prefigurate means to foreshadow or symbolically show something before it happens.","zh":"Prefigurate 指“预示、预先呈现”，常带有象征性地提前暗示之意。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to represent or show something in advance; to foreshadow or be an early sign of something later","zh":"预先呈现；预示；作为后来事物的先兆"},"examples":[{"en":"Early protests can prefigurate larger political changes.","zh":"早期的抗议活动可能预示更大的政治变化。"},{"en":"In the novel, the opening storm prefigurates the family’s collapse.","zh":"在小说中，开篇的暴风雨预示着这个家庭的崩溃。"}]},{"partOfSpeech":"v.","definition":{"en":"to portray something in a symbolic way before it happens, especially in religious or literary writing","zh":"（尤用于宗教或文学语境）以象征方式预先描绘尚未发生之事"},"examples":[{"en":"Some readers say the sacrifice in the story prefigurates a later act of redemption.","zh":"一些读者认为故事中的牺牲象征性地预示了后来的一次救赎。"}]}],"synonyms":["prefigure","foreshadow","portend","herald","anticipate"],"phonetic":"/priˈfɪɡjəreɪt/","extraExplanation":["“prefigurate”较少见，更常用的是“prefigure”（预示、预兆）或名词“prefiguration”（预示、预表）。写作中若想自然一些，通常用“prefigure”。","该词常出现在文学批评与神学讨论中，尤其涉及“预表/预象（typology）”：早期人物或事件被视为后续更重大事件的象征性预告。"]}
{"word":"prefiguration","summary":{"en":"Prefiguration means an early sign or symbolic preview that points to something later.","zh":"prefiguration 指对后续事物的预示或象征性的先行呈现（预表）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early sign, hint, or example that points to something that will happen later; a “preview” of a later event or idea.","zh":"预示；预兆；（对后来事件或观念的）提前暗示、先行呈现。"},"examples":[{"en":"In the novel, the storm in chapter one is a prefiguration of the family’s later crisis.","zh":"在小说里，第一章的暴风雨预示了这个家庭后来的危机。"},{"en":"Her small act of rebellion felt like a prefiguration of the social changes to come.","zh":"她那次小小的反抗像是对即将到来的社会变革的预示。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature, art, or religion: a person, event, or image that symbolically foreshadows and “points forward” to a later, fuller meaning (often called a type).","zh":"（文学/艺术/宗教中）预表：用象征方式预示并指向后续更完整意义的人物、事件或意象（常称“预表/类型”）。"},"examples":[{"en":"Some readers see the lamb as a prefiguration of later themes of sacrifice.","zh":"一些读者认为“羔羊”是对后续“牺牲”主题的预表。"},{"en":"In religious writing, an earlier story may be treated as a prefiguration of a later one.","zh":"在宗教写作中，较早的故事可能被视为对后来故事的预表。"}]}],"synonyms":["foreshadowing","portent","omen","harbinger","anticipation","type (religious/literary)"],"phonetic":"/priˌfɪɡjəˈreɪʃən/","extraExplanation":["词源提示：pre- 表“在……之前”，figuration 来自 figure（形象/塑造）。因此 prefiguration 字面意思是“提前形成的形象”，引申为“提前呈现、预示”。","与 foreshadowing（伏笔/预示）相比：foreshadowing 更常用于叙事技巧（作者埋伏笔）；prefiguration 常更强调“象征性的先行版本/原型”，在文学批评、宗教或艺术语境中更常见。"]}
{"word":"prefigurative","summary":{"en":"Prefigurative describes something that previews or models a future outcome—especially when people try to live out a desired future society in the present.","zh":"Prefigurative 指对未来的预示或雏形，尤其常用于社会运动语境，表示在当下先实践并示范理想的未来社会。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of politics, culture, or social movements) showing or practicing in the present what a hoped-for future society should be like.","zh":"（指政治、文化或社会运动）以“未来理想社会”为蓝本，在当下先行实践、预示未来的。"},"examples":[{"en":"Some activist groups use prefigurative politics, organizing without formal leaders to model equality.","zh":"一些行动团体采用“预示性政治”，以无正式领袖的方式组织，来示范平等。"},{"en":"The community’s prefigurative approach included shared childcare and collective decision-making.","zh":"这个社群的预示性做法包括共同育儿和集体决策。"}]},{"partOfSpeech":"adj.","definition":{"en":"serving as an early sign, model, or “preview” of something that will happen or develop later.","zh":"作为先兆、雏形或“预览”，预示某事在之后会发生或发展。"},"examples":[{"en":"Her early essays were prefigurative of the themes in her later novel.","zh":"她早期的随笔预示了她后来小说中的主题。"},{"en":"The small pilot project was prefigurative of a larger reform.","zh":"这个小型试点项目是更大改革的雏形。"}]}],"synonyms":["anticipatory","foreshadowing","prototype","modeling","indicative"],"phonetic":"/priːˈfɪɡjərətɪv/","extraExplanation":["词源提示：pre-（在前）+ figurative（形象的、比喻的/成形的），字面意思是“在之前先形成一个形象/模型”。","在社会运动语境里，prefigurative politics（预示性政治）很常见，强调“手段要体现目的”：你想要的未来社会是什么样，现在的组织方式就尽量先做到那样。","常见搭配：prefigurative politics / prefigurative practice / prefigurative organizing。","近义表达（按语境选）：anticipatory（先行的）、foreshadowing（预示的）、prototype-like（像原型的）。注意：foreshadowing更偏文学叙事“伏笔”，而prefigurative在政治社会学里更强调“实践示范”。"]}
{"word":"prefiguratively","summary":{"en":"Prefiguratively means “in a way that foreshadows or symbolically points to something later.”","zh":"prefiguratively 意为“以预示/预表的方式，象征性地指向之后会发生的事”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that foreshadows or represents something that will happen later; as an advance sign or symbolic preview.","zh":"以预示性的方式；作为对未来事件的预兆或象征性预览。"},"examples":[{"en":"In the opening scene, the storm acts prefiguratively, hinting at the chaos to come.","zh":"在开场那一幕里，暴风雨起到预示作用，暗示了即将到来的混乱。"},{"en":"Her early sketches work prefiguratively for the final painting.","zh":"她早期的素描在预示意义上为最终画作做了铺垫。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Religion/Literature) In a way that treats an earlier person, event, or image as a “type” that points forward to a later one.","zh":"（宗教/文学）以“预表”的方式；把较早的人物、事件或意象看作指向后续对象的象征类型。"},"examples":[{"en":"Some readers interpret the story prefiguratively, linking the early sacrifice to a later redemption.","zh":"一些读者用预表的方式解读这个故事，把早期的牺牲与后来的救赎联系起来。"}]}],"synonyms":["foreshadowingly","symbolically","prophetically","anticipatorily"],"phonetic":"/ˌpriːˈfɪɡjərətɪvli/","extraExplanation":["这个词比较少见，多用于文学批评、宗教阐释或学术写作中。日常英语里更常用的说法是 foreshadowingly（以铺垫/伏笔的方式）或 as a foreshadowing（作为伏笔）。","构词上是 prefigure（预示、预表）+ -atively（表示“以……方式”）→ prefiguratively。写作时如果担心读者不熟悉，可用更直白的表达替换。"]}
{"word":"prefigurativeness","summary":{"en":"Prefigurativeness means the quality of foreshadowing or symbolically pointing to something that happens later.","zh":"Prefigurativeness 指“预示性/前兆性”：某种事物通过暗示或象征指向未来将发生的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being prefigurative—suggesting, foreshadowing, or symbolically “pointing ahead” to something that comes later","zh":"预示性；前兆性；（象征性地）指向未来事物的特质"},"examples":[{"en":"The novel’s prefigurativeness becomes clear in the final chapter, when early images return with new meaning.","zh":"到最后一章时，这部小说的预示性变得很明显：早期的意象再次出现，但意义已不同。"},{"en":"Critics discussed the prefigurativeness of the opening scene, which hints at the ending.","zh":"评论家讨论了开场景的预示性，因为它暗示了结局。"},{"en":"In religious studies, prefigurativeness can describe how an earlier story is read as a sign of a later event.","zh":"在宗教学研究中，“预示性”可指早期故事被解读为后来事件的象征或预兆。"}]}],"synonyms":["foreshadowing","anticipation","presaging","predictiveness"],"phonetic":"/ˌpriːˈfɪɡjərətɪvnəs/","extraExplanation":["“prefigurativeness”来自 prefigure（预示、预先描绘）+ -ness（名词后缀）。它多见于文学批评、宗教研究（如“预表/预像”式解读）和艺术理论中，日常英语里较少用。更常见的替代表达有 foreshadowing（伏笔/预示）或 being symbolic/anticipatory（具有象征性/前瞻性）。"]}
{"word":"prefigure","summary":{"en":"Prefigure means to foreshadow or show early signs of something, or to imagine/represent something in advance.","zh":"prefigure 指“预示/埋下伏笔”，也可指“预想”，或在文学宗教语境中“预表、象征”后来出现的事物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To be an early sign of something that will happen later; to foreshadow.","zh":"预示；预兆；（以某种迹象）预先暗示将要发生的事。"},"examples":[{"en":"The dark clouds prefigured a heavy storm that night.","zh":"乌云预示着那天晚上会有一场暴风雨。"},{"en":"Early protests prefigured the larger movement that followed.","zh":"早期的抗议预示了后来更大的运动。"}]},{"partOfSpeech":"v.","definition":{"en":"To imagine or picture something in advance; to form a mental image beforehand.","zh":"预想；预先设想；在心里提前勾勒出（某事物）的样子。"},"examples":[{"en":"She tried to prefigure what life would be like in a new country.","zh":"她试着预想在一个新国家生活会是什么样。"},{"en":"Before the interview, he prefigured possible questions and practiced answers.","zh":"面试前，他预想了可能的问题并练习作答。"}]},{"partOfSpeech":"v.","definition":{"en":"To represent or symbolize something that comes later (often used in religious or literary contexts).","zh":"（尤用于宗教/文学语境）预表；象征后来出现的事物或人物。"},"examples":[{"en":"In some readings, the story is said to prefigure later themes of sacrifice.","zh":"在某些解读中，这个故事被认为预表了后来关于牺牲的主题。"},{"en":"The character’s early choices prefigure the ending in a symbolic way.","zh":"这个角色早期的选择以象征性的方式预示了结局。"}]}],"synonyms":["foreshadow","portend","herald","anticipate","presage"],"phonetic":"/priˈfɪɡjɚ/","extraExplanation":["词源提示：pre- 表示“在……之前”，figure 有“形象、描绘”的意思；合起来就是“提前描绘/提前呈现”，因此常引申为“预示、伏笔、预表”。","用法辨析：prefigure 比 foreshadow 更偏“提前呈现某种形状/模式或象征意义”，语气更书面；日常口语里更常用 foreshadow。"]}
{"word":"prefigured","summary":{"en":"Prefigured means “foreshadowed” or “hinted at in advance,” often used in literary or academic contexts.","zh":"prefigured 意为“预示、伏笔、提前暗示”，常用于文学或学术语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of prefigure) to show or suggest something before it happens; to foreshadow.","zh":"（prefigure 的过去式/过去分词）在事情发生前预示、暗示；铺垫（伏笔）。"},"examples":[{"en":"In the first chapter, the storm prefigured the conflict to come.","zh":"第一章里的暴风雨预示了即将到来的冲突。"},{"en":"Her early sketches prefigured the style of her later paintings.","zh":"她早期的速写预示了她后期绘画的风格。"}]},{"partOfSpeech":"vt.","definition":{"en":"(often in academic or literary writing) to represent in an earlier form; to be an early sign or pattern of something later.","zh":"（常见于学术/文学语境）以较早的形式呈现；作为后来事物的早期征兆或雏形。"},"examples":[{"en":"The small local protests prefigured a nationwide movement.","zh":"这些小规模的地方抗议成了全国性运动的前兆。"},{"en":"Some critics argue the character’s childhood prefigured his moral choices as an adult.","zh":"一些评论家认为，这个角色的童年为他成年后的道德选择埋下了伏笔。"}]}],"synonyms":["foreshadowed","heralded","signaled","anticipated","presaged"],"phonetic":"/priˈfɪɡjɚd/","extraExplanation":["“prefigure”来自前缀 pre-（“在……之前”）+ figure（“形象/描绘”），所以核心感觉是“提前描绘未来的样子”。在文学评论里常用来谈“伏笔/预兆”。","在宗教或神学写作中，prefigure 还可指“旧约中的某人/某事预表新约中的某人/某事”（typology，预表论），例如某些事件被认为“预表”后来更重要的事件。"]}
{"word":"prefigurement","summary":{"en":"Prefigurement means an early hint or symbolic example of something that comes later, especially in literature, art, or religious interpretation.","zh":"Prefigurement 指对后来事物的早期暗示或象征性雏形，常见于文学、艺术与宗教阐释中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early sign or example of something that will happen later; a hint or foreshadowing.","zh":"对后来将发生之事的早期迹象或例子；预示、伏笔。"},"examples":[{"en":"The sudden silence was a prefigurement of the argument that followed.","zh":"突如其来的沉默预示了随后将发生的争吵。"},{"en":"In many novels, a small detail acts as a prefigurement of the ending.","zh":"在许多小说中，一个小细节会作为结局的伏笔。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature, religion, or art: a person, event, or symbol that represents or points to a later person, event, or meaning.","zh":"（文学、宗教或艺术中）指代或预表后来人物、事件或意义的人物、事件或象征。"},"examples":[{"en":"Some readers see the early hero as a prefigurement of the later leader.","zh":"一些读者认为早期的英雄形象预表了后来的领袖。"},{"en":"The painting’s lamb can be read as a prefigurement of sacrifice.","zh":"画中的羔羊可被解读为“牺牲”的预表。"}]}],"synonyms":["foreshadowing","hint","sign","portent","anticipation","type"],"phonetic":"/priˈfɪɡjɚmənt/","extraExplanation":["词源上与 prefigure（预示、预先描绘）有关，字面含义是“提前把形象/意义勾勒出来”。在文学批评里常与 foreshadowing（伏笔）相近，但 prefigurement 更强调“后面会出现的主题/人物/意义在前面已有一个雏形或对应物”。","在宗教语境中，prefigurement 常用于“预表/预象”（typology）：早期人物或事件被视为后来更重要事件的象征性预告。这种用法带有解释传统，不一定适用于所有文本。"]}
{"word":"prefigurer","summary":{"en":"A prefigurer is a person or thing that foreshadows or serves as an early sign/model of something that happens later.","zh":"prefigurer 指“预示者/预表者”，即预示或作为后来事物早期征兆、雏形的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that prefigures something—someone/something that foreshadows, predicts, or serves as an early sign or model of what will come later.","zh":"预示者；预表者：指预示、预告或作为后来事物早期征兆/雏形的人或事物。"},"examples":[{"en":"Some critics call early science-fiction writers prefigurers of today’s AI debates.","zh":"一些评论家称早期科幻作家是当今人工智能讨论的预示者。"},{"en":"In the novel, the child’s drawings are a prefigurer of the disaster at the end.","zh":"在小说中，孩子的画是结尾灾难的预兆。"},{"en":"Many readers see the character as a prefigurer of the hero’s future choices.","zh":"许多读者认为这个角色预示了主人公未来的选择。"}]}],"synonyms":["forerunner","precursor","harbinger","foreshadower","predictor"],"phonetic":"/ˌpriːˈfɪɡjɚɚ/","extraExplanation":["“prefigurer”来自动词“prefigure”（预示；预先描绘）。它在日常口语中不算常见，更常见的是“forerunner”（先驱/前兆）、“precursor”（先兆/先导）、“foreshadowing”（伏笔，名词，多指写作手法）。","在宗教或文学评论语境里，“prefigurer”有时带有“预表/象征未来意义”的色彩（例如旧约人物被视为新约事件的“预表”）。"]}
{"word":"prefigures","summary":{"en":"“Prefigures” means “foreshadows” or “shows an early form of something that will come later.”","zh":"“prefigures”表示“预示/预兆”，或“提前体现某事物未来将出现的雏形”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to foreshadow something; to show or suggest that it will happen in the future","zh":"预示；预兆；预先暗示（某事将会发生）"},"examples":[{"en":"The dark opening scene prefigures the tragedy at the end of the story.","zh":"阴暗的开场场景预示了故事结尾的悲剧。"},{"en":"Her early sketches prefigure the style of her later paintings.","zh":"她早期的素描预示了她后期绘画的风格。"}]},{"partOfSpeech":"v.","definition":{"en":"to represent or portray something in advance, as an early form or model of it","zh":"预先呈现；提前体现（作为某事物的早期形式或雏形）"},"examples":[{"en":"This small prototype prefigures the final product.","zh":"这个小型原型提前体现了最终产品的样子。"},{"en":"In the novel, the city prefigures a future society shaped by technology.","zh":"在小说中，这座城市提前呈现了一个由科技塑造的未来社会。"}]}],"synonyms":["foreshadows","portends","anticipates","heralds","predicts","presages"],"phonetic":"/priˈfɪɡjɚz/","extraExplanation":["“prefigures”是动词“prefigure”的第三人称单数（he/she/it prefigures）。常见搭配：prefigure + an event/change/outcome（预示事件/变化/结果）。","词源上可理解为“pre-（在前）+ figure（形象/图像）”，即“在事情真正发生前就出现一个‘形状/轮廓’”。因此它常用于文学批评、历史叙述、学术写作中，语气比“hint/suggest”更正式、更强调‘预兆/雏形’。"]}
{"word":"prefiguring","summary":{"en":"Prefiguring means foreshadowing—suggesting or showing something in advance, often in literary or academic contexts.","zh":"prefiguring 指“预示/铺垫”，提前暗示未来将发生的事，常见于文学或学术语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “prefigure”) suggesting or showing something that will happen later; foreshadowing.","zh":"（prefigure 的现在分词）预示、预兆；暗示未来将发生的事；铺垫。"},"examples":[{"en":"In her early poems, we already see themes prefiguring her later novels.","zh":"在她早期的诗歌里，我们已经能看到一些主题，预示了她后来的小说。"},{"en":"The protests were prefiguring a bigger political shift.","zh":"这些抗议是在预示更大的政治转变。"},{"en":"A brief scene at the start is prefiguring the ending.","zh":"开头的一个短场景是在为结局做铺垫。"}]},{"partOfSpeech":"adj.","definition":{"en":"coming before and hinting at a later development (often used in academic or literary writing).","zh":"先于出现并暗示后续发展（常见于学术或文学表达）。"},"examples":[{"en":"The prefiguring chapter introduces ideas that return in the conclusion.","zh":"这个“铺垫性”的章节提出了一些观点，并在结论中再次出现。"},{"en":"They analyzed prefiguring signs of the social changes of the 1960s.","zh":"他们分析了20世纪60年代社会变迁的先兆。"}]}],"synonyms":["foreshadowing","portending","anticipating","hinting at","presaging"],"phonetic":"/priˈfɪɡjərɪŋ/","extraExplanation":["“prefigure”来自拉丁语前缀 pre-（在前）+ figure（形象/塑造）。因此 prefiguring 常带有“提前勾勒轮廓、先行呈现”的感觉，比普通的 foreshadow 更偏“结构性铺垫/提前显形”。","语域上更正式，常用于文学批评、历史研究、社会学等写作：强调某个早期现象与后来的结果之间的呼应关系。","相关表达：foreshadow（更常用、更口语一点）、anticipate（强调预期/提前想到）、hint at（轻微暗示）、set the stage for（为……铺路/奠定基础）。"]}
{"word":"prefile","summary":{"en":"“Prefile” means to submit paperwork ahead of time.","zh":"“prefile”表示提前提交（预先递交）文件或表格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to file (a document, form, or case) in advance, usually before an official deadline or before a main filing happens","zh":"（在截止日期或正式提交之前）预先提交（文件、表格或案件）"},"examples":[{"en":"You can prefile your tax return as soon as you have all your documents.","zh":"一旦资料齐全，你就可以尽早预先提交报税表。"},{"en":"Some states let you prefile the application online to save time later.","zh":"有些州允许你先在网上预先提交申请，之后能省时间。"}]}],"synonyms":["file early","submit in advance","pre-submit"],"phonetic":"/ˌpriːˈfaɪl/","extraExplanation":["“Prefile”常见于美国语境，尤其是报税（tax return）、法院/政府文件（court/government forms）、或候选人参选文件（candidate filings）。它强调“提前把文件交上去”，并不一定代表已经最终审核通过。"]}
{"word":"prefiled","summary":{"en":"“Prefiled” means submitted or filed in advance; it’s also the past form of “prefile.”","zh":"“prefiled”表示“已预先提交/备案的”，也是“prefile”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of documents, forms, taxes, etc.) submitted in advance, before a deadline or official date.","zh":"（文件、表格、税务等）预先提交的；在截止日期或正式日期之前递交的。"},"examples":[{"en":"Bring a copy of your prefiled application to the interview.","zh":"面试时带一份你已预先提交的申请表复印件。"},{"en":"The court reviewed the prefiled motions before the hearing.","zh":"法院在听证会前审查了预先提交的动议。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “prefile”: to file or submit something in advance.","zh":"“prefile”的过去式/过去分词：预先归档或提前提交（某物）。"},"examples":[{"en":"We prefiled the paperwork to avoid delays.","zh":"我们提前提交了文件以避免延误。"},{"en":"She had already prefiled her tax return online.","zh":"她已经在网上预先提交了报税表。"}]}],"synonyms":["filed in advance","submitted in advance","pre-submitted","pre-filed"],"phonetic":"/priˈfaɪld/","extraExplanation":["“prefiled”常见于法律、税务、行政流程等正式语境，强调“提前递交/备案”，目的是节省时间或满足程序要求。","拼写上也可见到“pre-filed”（加连字符），意思相同；是否加连字符常取决于机构写作规范。"]}
{"word":"prefiles","summary":{"en":"“Prefiles” means “files something in advance” (the 3rd-person singular form of prefile).","zh":"“prefiles”表示“预先提交”，是动词“prefile”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to file (submit) a document or form before an official deadline or before a formal process begins","zh":"（在正式程序开始前或截止日期前）预先提交（文件、表格）"},"examples":[{"en":"The lawyer prefiled the motion so the judge could review it early.","zh":"律师预先提交了动议，以便法官能提前审阅。"},{"en":"Some states let you prefile a bill before the legislative session starts.","zh":"有些州允许你在立法会期开始前预先提交法案。"},{"en":"She prefiles her tax documents to avoid last-minute stress.","zh":"她会预先提交报税资料，以避免临近截止日期的压力。"}]}],"synonyms":["file early","submit in advance","pre-submit"],"phonetic":"/ˌpriːˈfaɪl/","extraExplanation":["“prefiles”通常是动词“prefile”的第三人称单数形式（he/she/it prefiles）。在美国常见于法律、政府、立法与报税等语境：先把材料交上去，后续再按流程处理。也可写作“pre-file”。"]}
{"word":"prefill","summary":{"en":"“Prefill” means to fill something in advance, especially form fields with existing info.","zh":"“prefill”指预先填写/预先填充，常用于用已有信息提前填好表格或字段。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill (a form, container, or data field) in advance, often automatically with existing information","zh":"（通常指用已有信息）预先填写；预先填充（表格/字段/容器）"},"examples":[{"en":"The app can prefill your address from your profile.","zh":"这个应用可以从你的个人资料里预先填充你的地址。"},{"en":"Please check the prefilled answers before you submit the form.","zh":"提交表格前请检查已预先填写的答案。"}]},{"partOfSpeech":"adj.","definition":{"en":"already filled in advance (especially on a form or online field)","zh":"预先填写的；预填的（尤指表格或线上字段）"},"examples":[{"en":"Some sections are prefill by default, but you can edit them.","zh":"有些部分默认是预填的，但你可以修改。"},{"en":"Look for prefill fields marked in gray.","zh":"找找那些用灰色标出的预填字段。"}]}],"synonyms":["prepopulate","autofill","fill in advance"],"phonetic":"/ˌpriːˈfɪl/","extraExplanation":["在实际英语中更常见的写法是动词“prefill”（一个词）和形容词“prefilled”。例如：“The form is prefilled.”（表格已预填）。有些界面会把“pre-fill / pre fill / prefill”混用，但正式写作里通常推荐“prefill / prefilled”。","“prefill”多用于软件、网页表单、数据库与用户体验（UX）语境，常与“autofill（自动填充）”一起出现：autofill强调系统自动完成输入，prefill强调在你开始填写之前就先放入默认或已知信息。"]}
{"word":"prefiller","summary":{"en":"A prefiller is something (a machine, person, or material) used to fill or prepare filling in advance, before the main filling step.","zh":"prefiller 指在主要灌装/填充之前用于“预先填充或准备填充”的设备、人员或材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, machine, or part that fills something in advance (before the main filling step), especially in packaging or manufacturing","zh":"（尤指包装或制造业中）预先灌装/预填的人、机器或部件（在主要灌装步骤之前先进行填充）"},"examples":[{"en":"The prefiller loads the bottles with a small amount of liquid before the final fill.","zh":"预灌装机会在最终灌装前先往瓶子里加入少量液体。"},{"en":"A prefiller can speed up the line by preparing containers ahead of time.","zh":"预填设备可以提前准备容器，从而加快生产线速度。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance or material used as a preliminary filler or base layer before the main filling material is added","zh":"预填料；在加入主要填充材料前先使用的填充物或底层材料"},"examples":[{"en":"They applied a prefiller to smooth the surface before adding the final compound.","zh":"他们先涂了一层预填料来抹平表面，再加入最终材料。"},{"en":"Use a prefiller to reduce how much expensive resin you need.","zh":"用预填料可以减少昂贵树脂的用量。"}]}],"synonyms":["pre-filler","pre-fill unit","preloader","primer filler","base filler"],"phonetic":"/priˈfɪlər/","extraExplanation":["“prefiller”更常见的写法是带连字符的“pre-filler”。在不同领域含义会稍有差异：在灌装/包装行业多指设备或工序；在材料/涂装领域可能指“打底用的填充材料”。如果你告诉我它出现的行业或句子，我可以帮你确认最准确的对应翻译。"]}
{"word":"prefills","summary":{"en":"“Prefills” means fills in advance—often automatically (especially for forms or fields).","zh":"「prefills」指預先填入，常見於系統自動為表格或欄位預填資料。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill something (especially a form, field, or container) in advance, often automatically using existing information","zh":"（尤指表格、欄位或容器）預先填入；（常指系統用既有資料）自動預填"},"examples":[{"en":"The website prefills your address if you’ve used it before.","zh":"如果你以前用過，網站會自動預填你的地址。"},{"en":"The app prefills the date, so you only need to add the time.","zh":"這個應用程式會預填日期，所以你只要補上時間。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put a base or initial amount into something before the main use or before adding more","zh":"在正式使用或再添加之前先填入一部分（作為底量或初始量）"},"examples":[{"en":"She prefills the water bottle before the hike.","zh":"健行前她先把水壺預先裝好水。"},{"en":"The lab technician prefills the trays with solution.","zh":"實驗室技術員先在托盤裡預先加入溶液。"}]}],"synonyms":["pre-populates","fills in ahead of time","autofills","preloads"],"phonetic":"/priːˈfɪlz/","extraExplanation":["「prefills」通常是動詞第三人稱單數（he/she/it prefills）。在介面與文件情境中，也常看到過去分詞/形容詞用法「prefilled」（如：prefilled form＝已預填的表格）。","在隱私與合規語境裡，系統「prefill」資料可能引發個資疑慮，因此常搭配提示（例如“Please review and confirm”）要求使用者確認。"]}
{"word":"prefilter","summary":{"en":"A prefilter is an early filter (or the act of filtering early) used before the main filter or process.","zh":"prefilter 指在主过滤或主要处理之前进行的“预过滤”（或预过滤器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in engineering) A filter used before a main filter or process to remove larger particles or reduce contamination early.","zh":"（常用于工程/设备）预过滤器；在主过滤器或主要流程之前使用，用来先去除较大颗粒或降低污染。"},"examples":[{"en":"The water system uses a prefilter to catch sand before the carbon filter.","zh":"这套净水系统先用预过滤器拦截沙粒，再进入活性炭滤芯。"},{"en":"Change the prefilter regularly to protect the main filter.","zh":"定期更换预过滤器，能保护主滤芯。"}]},{"partOfSpeech":"v.","definition":{"en":"To filter something in an early step before the main filtering or processing happens.","zh":"预先过滤；在主要过滤或处理之前先进行过滤。"},"examples":[{"en":"We prefilter the samples to remove dust before testing.","zh":"我们先对样品预过滤，去除灰尘后再测试。"},{"en":"Prefilter the oil to prevent the machine from clogging.","zh":"先把油预过滤，避免机器堵塞。"}]}],"synonyms":["pre-filter","screen (early)","pre-screen (in data contexts)"],"phonetic":"/ˌpriːˈfɪltər/","extraExplanation":["“prefilter”常见于净水/空气净化、实验室样品处理、相机/成像算法（如先筛掉明显不合格的数据）等语境。核心思想是“先做一道粗处理/第一道防线”，以延长后续更精细部件的寿命或提高整体效果。","拼写上也常见作“pre-filter”（加连字符），含义相同。"]}
{"word":"prefilters","summary":{"en":"Prefilters are filters used first to remove bigger or obvious unwanted material, or the act of filtering something in advance.","zh":"prefilters 指前置过滤器（先去除较大/明显杂质），也可指“预先过滤”的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a filter used before another filter or processing step to remove large particles or obvious unwanted items first","zh":"预过滤器；前置过滤器（在主要过滤或处理之前先去除较大颗粒或明显杂质）"},"examples":[{"en":"The air purifier has washable prefilters to catch dust and hair.","zh":"这台空气净化器有可清洗的预过滤网，用来拦截灰尘和毛发。"},{"en":"Replace the prefilters regularly to protect the main filter.","zh":"定期更换预过滤器，以保护主过滤器。"}]},{"partOfSpeech":"v.","definition":{"en":"to filter something in advance before deeper filtering or analysis","zh":"预先过滤；先行筛选（在更深入的过滤或分析之前）"},"examples":[{"en":"We prefiltered the data to remove duplicate entries.","zh":"我们先对数据做了预过滤，去掉重复记录。"},{"en":"Prefilter the water to reduce sediment before using the carbon filter.","zh":"先把水预过滤以减少沉淀物，再使用活性炭滤芯。"}]}],"synonyms":["pre-filter","pre-screen","screen (out)","preprocess"],"phonetic":"/ˌpriːˈfɪltərz/","extraExplanation":["“prefilter(s)”常见于工程与日常用品语境：比如空气净化器、吸尘器、水处理系统里，预过滤负责“粗滤”，主要过滤/HEPA/活性炭等负责“细滤”。在数据与信号处理里，prefilter也指先用简单规则或初步算法把明显噪声、异常值、重复项剔除。","形式上是“pre-（在前）+ filter（过滤）”。你输入的“prefilters”多半是复数名词（多个预过滤器），也可能是动词第三人称单数（He prefilters the data）。"]}
{"word":"prefinal","summary":{"en":"“Prefinal” means second-to-last, or (in linguistics) positioned just before the final element.","zh":"“prefinal”表示“倒数第二的”，或（语言学中）“位于最后一个之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coming immediately before the last; second-to-last.","zh":"倒数第二的；紧挨着最后一个之前的。"},"examples":[{"en":"In the prefinal round, the team finally found its rhythm.","zh":"在倒数第二轮比赛中，球队终于找到了节奏。"},{"en":"The prefinal chapter sets up the ending.","zh":"倒数第二章为结局做铺垫。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Located just before the final sound, syllable, or word in a sequence.","zh":"（语言学）位于一串语音/音节/词中最后一个之前的位置。"},"examples":[{"en":"In this word, the stress falls on the prefinal syllable.","zh":"在这个词里，重音落在倒数第二个音节上。"},{"en":"The prefinal consonant changes in fast speech.","zh":"在快速语流中，倒数第二个辅音会发生变化。"}]}],"synonyms":["second-to-last","next-to-last","penultimate"],"phonetic":"/ˌpriːˈfaɪnəl/","extraExplanation":["“prefinal”多见于较正式或学术写作（如比赛赛程、章节结构、语言学分析）。日常口语中更常说“second-to-last”或“next-to-last”。"]}
{"word":"prefinance","summary":{"en":"Prefinance means to fund something in advance before repayment or final financing.","zh":"prefinance 指在回款、报销或最终融资之前先行提供资金（预融资/垫资）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to provide money for a project or purchase in advance, before repayment or final funding happens (often used in business and government contexts).","zh":"（在最终付款、报销或正式融资之前）预先提供资金；先行垫付（多用于商业、政府项目等语境）。"},"examples":[{"en":"The bank agreed to prefinance the exporter’s shipments until the invoices were paid.","zh":"银行同意在发票结清之前，为出口商的货物运输提供预融资。"},{"en":"Our company can prefinance the materials, and you repay us after delivery.","zh":"我们公司可以先垫付材料款，你们在交付后再偿还。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or arrangement of funding something in advance (less common; more often written as “pre-financing”).","zh":"预先融资；垫资安排（较少见；更常写作 pre-financing）。"},"examples":[{"en":"The contract includes prefinance for the first phase of construction.","zh":"合同包含对施工第一阶段的预融资安排。"}]}],"synonyms":["pre-finance","advance funds","front (the money)","provide upfront funding"],"phonetic":"/ˌpriːˈfaɪnæns/","extraExplanation":["“prefinance”常见写法是带连字符的“pre-finance”，名词形式更常用“pre-financing”。在外贸、工程承包、政府补贴报销等场景里很常见：先把钱付出去，让项目先启动，之后再通过回款、报销或长期贷款把资金补回来。使用时要注意它通常暗示“先垫付/先行提供资金”，而不只是一般的“finance（融资）”。"]}
{"word":"prefinanced","summary":{"en":"Prefinanced means funded in advance, often with borrowed or arranged financing.","zh":"prefinanced 指通过借款或安排资金提前融资、先把钱筹到位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a project, purchase, or activity) paid for in advance with borrowed money or arranged funding.","zh":"（指项目、购买或活动）通过借款或安排好的资金“预先融资”的；提前筹到钱来支付的。"},"examples":[{"en":"The developer launched the project with a prefinanced construction loan.","zh":"开发商用一笔预先融资的建设贷款启动了项目。"},{"en":"They chose a prefinanced option so the supplier could start work immediately.","zh":"他们选择了预先融资的方案，好让供应商能立刻开工。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide money for something in advance; to finance before it happens (often used in passive forms).","zh":"预先为……提供资金；在事情发生前融资（常用被动形式）。"},"examples":[{"en":"The purchase was prefinanced by the bank.","zh":"这笔购买由银行预先融资。"},{"en":"Some export orders are prefinanced to cover production costs.","zh":"有些出口订单会预先融资，以覆盖生产成本。"}]}],"synonyms":["pre-funded","financed in advance","advance-funded"],"phonetic":"/ˌpriːˈfaɪnænst/","extraExplanation":["“prefinanced”常见于商业、房地产、国际贸易和项目管理语境，强调“资金先到位，再开始做事”。它通常意味着有贷款、授信额度或已安排的投资资金来先行垫付成本。","与“prepaid（预付）”不同：prepaid更偏“先付款”，资金来源不一定是融资；prefinanced强调“通过融资渠道”提前获得资金。"]}
{"word":"prefinancial","summary":{"en":"“Prefinancial” means ‘before a financial stage or event,’ but it’s uncommon; “pre-financial + noun” is more typical.","zh":"“prefinancial”表示“某个财务阶段或事件之前的”，但并不常见；更常用“pre-financial + 名词”的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before a major financial stage or event (such as financing, formal financial reporting, or a financial crisis).","zh":"发生在某个重要财务阶段或事件之前的（如融资之前、正式财务报表之前、金融危机之前）。"},"examples":[{"en":"The company’s prefinancial plan focused on product testing before seeking investors.","zh":"公司的融资前（prefinancial）计划侧重于产品测试，然后才去找投资人。"},{"en":"Analysts compared consumer habits in the prefinancial-crisis years and the years after.","zh":"分析师比较了金融危机前（prefinancial-crisis years）和危机后的消费习惯。"}]}],"synonyms":["pre-financial","pre-financing","before financing","pre-crisis"],"phonetic":"/ˌpriːfaɪˈnænʃəl/","extraExplanation":["“prefinancial”不是非常常见的标准词形，更常见的写法是带连字符的“pre-financial”，并且通常需要接一个名词来说明“在什么财务事件之前”，例如：pre-financial crisis（金融危机前）、pre-financing stage（融资前阶段）、pre-financial statements（正式财务报表前的）。","如果你想表达“融资前估值/融资前阶段”，在创业与投资语境中更常用的是“pre-money (valuation)”（融资前估值）或“pre-revenue”（尚未产生营收的）。"]}
{"word":"prefinancing","summary":{"en":"Prefinancing means getting or providing money in advance to cover costs before the final funds or payment arrives.","zh":"Prefinancing 指在最终资金或付款到位之前，为支付成本而提前获得或提供资金的“预先融资”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Finance) providing money in advance to fund a project, purchase, or operation before the final payment, reimbursement, or long-term financing happens.","zh":"（金融）预先融资；在最终付款、报销或长期融资到位之前，先提供资金来支持项目、采购或运营。"},"examples":[{"en":"The supplier offered prefinancing so the factory could buy raw materials immediately.","zh":"供应商提供预先融资，让工厂能立刻购买原材料。"},{"en":"The NGO needed prefinancing to start the program while waiting for the grant to arrive.","zh":"该非政府组织需要预先融资，以便在拨款到账前启动项目。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide money in advance for something (often used in business, trade, or project funding).","zh":"为某事提供预付款资金；进行预先融资（常用于商业、贸易或项目融资语境）。"},"examples":[{"en":"A bank may prefinance the shipment and get repaid after the goods are delivered.","zh":"银行可能会为货物出运先行融资，并在交付后收回款项。"},{"en":"They agreed to prefinance the construction phase to avoid delays.","zh":"他们同意为施工阶段先行融资，以避免延误。"}]}],"synonyms":["advance financing","bridge financing","pre-finance","upfront funding"],"phonetic":"/ˌpriːˈfaɪnænsɪŋ/","extraExplanation":["“prefinancing”在英美日常口语中不如“advance financing / bridge financing / pre-finance”常见，更常出现在合同、贸易融资、政府或国际组织项目文件里。","常见搭配：prefinancing arrangement（预融资安排）、prefinancing facility（预融资额度/工具）、prefinancing costs（预融资成本/利息）。","近义概念区分：bridge financing（过桥融资）强调“临时过渡”；advance payment（预付款）更偏“先付钱给对方”；prefinancing既可能是贷款/授信，也可能是对未来应收款的提前垫资。"]}
{"word":"prefine","summary":{"en":"“Prefine” is a rare verb meaning to refine something in advance (an initial refining step).","zh":"“prefine”是个很少见的动词，表示“预先精炼/预先提纯（先做初步精炼）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To refine or purify something in advance; to do an initial refining step before the final refining process.","zh":"（罕见）预先精炼/提纯；在最终精炼之前先进行初步精炼。"},"examples":[{"en":"The company prefines the crude oil before sending it to the main refinery.","zh":"公司会先对原油进行预先精炼，再送往主炼油厂。"},{"en":"We prefined the sample to remove obvious impurities.","zh":"我们先对样品做预处理式的提纯，以去除明显杂质。"}]}],"synonyms":["pre-refine","purify (in an initial step)","preprocess"],"phonetic":"/ˌpriːˈfaɪn/","extraExplanation":["“prefine”在现代英语中非常少见，多出现在技术/工业语境里，意思接近“pre-refine（预先精炼）”。日常写作中更常用的词是“refine（精炼；改进）”。","如果你本来想表达“改进、完善（想法/文字/计划）”，通常应写“refine”，例如：refine an essay（润色文章）、refine a plan（完善计划）。"]}
{"word":"prefinish","summary":{"en":"“Prefinish” means to finish (paint/stain/seal) something before installing or assembling it.","zh":"“prefinish”指在安装或组装之前，先把材料/构件的表面涂装或封闭处理做好。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to apply a protective or decorative finish (such as stain, paint, or clear coat) to something before it is installed or assembled","zh":"（在安装或组装之前）预先给……上漆/上清漆/做表面处理"},"examples":[{"en":"We decided to prefinish the hardwood floors before moving in.","zh":"我们决定在搬进去之前先把硬木地板预先做完表面处理。"},{"en":"The carpenter prefinshed the cabinets in the workshop, then installed them on site.","zh":"木工在工坊里先把橱柜预先上好漆，然后再到现场安装。"},{"en":"Prefinishing the trim helps avoid paint drips on the wall later.","zh":"先把线条预先上漆能避免之后在墙面上滴得到处都是。"}]}],"synonyms":["precoat","prepaint","prestain","seal (before installation)"],"phonetic":"/priːˈfɪnɪʃ/","extraExplanation":["“prefinish”常见于家装、木工和室内装修语境，强调“先在车间/地面上做好表面涂装，再安装”，这样通常更省时间、成品更均匀，也能减少现场粉尘、气味和对墙面的污染。","在地板领域，prefinish 常与 “pre-finished flooring（预先涂装地板）”相关：工厂提前上好多层耐磨涂层，安装后一般只需简单清洁与收边。"]}
{"word":"prefire","summary":{"en":"Prefire means to shoot in advance based on prediction, especially in FPS games.","zh":"prefire 指基于预判提前开枪，尤指 FPS 游戏中的“提前枪”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To shoot before you can clearly see the enemy, based on prediction (common in FPS games).","zh":"（常用于第一人称射击游戏）在还没清楚看到敌人前，基于预判提前开枪。"},"examples":[{"en":"In tight corridors, players often prefire the corner to catch someone peeking.","zh":"在狭窄走廊里，玩家常常预瞄并提前对着拐角开火，抓住探头的人。"},{"en":"He prefired the doorway because he heard footsteps on the other side.","zh":"他听到门另一侧的脚步声，所以对着门口提前开火。"}]},{"partOfSpeech":"vt.","definition":{"en":"To ignite or trigger something in advance so it will fire at a planned moment (rare; technical use).","zh":"（较少见；技术用法）提前点火或预先触发，使其在预定时刻发射/启动。"},"examples":[{"en":"The system can prefire the ignition sequence to reduce delay.","zh":"该系统可以预先触发点火流程，以减少延迟。"}]}],"synonyms":["shoot early","anticipate and fire","preemptive shot"],"phonetic":"/ˈpriːˌfaɪr/","extraExplanation":["“prefire”最常见于电竞/FPS语境（如 CS、VALORANT）。通常指在“拐角、门口、烟雾边缘”等位置，根据对手常见站位、脚步声或队友信息进行提前扫射/点射。","它和“pre-aim（预瞄）”相关但不完全相同：pre-aim 只是把准星提前放到可能出现的位置；prefire 则是直接提前开枪。","写法上多为合写 prefire，也常见作名词用法（非正式）如 “a prefire”：His prefire was perfect.（他的提前枪很准。）"]}
{"word":"prefired","summary":{"en":"Prefired means fired or heated in advance, especially in ceramics before glazing or a final firing.","zh":"prefired 指“预先烧制/预烧的”，尤用于陶瓷等在上釉或终烧前先烧过。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Ceramics/materials) fired in a kiln before a later step (such as glazing or final firing).","zh":"（陶瓷/材料）预烧的；在后续工序（如上釉或二次烧制）之前先入窑烧过的。"},"examples":[{"en":"The tiles are prefired to make them stronger before glazing.","zh":"这些瓷砖会先预烧以增强强度，然后再上釉。"},{"en":"We used prefired clay pieces for the workshop to save time.","zh":"为了节省时间，我们在工作坊使用了预烧过的陶土坯件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fired, shot, or activated earlier than something else; done in advance.","zh":"预先发射/开火的；提前启动的；事先完成的。"},"examples":[{"en":"The system uses prefired charges to reduce delay.","zh":"该系统使用预先点火的装药来减少延迟。"},{"en":"They had prefired the signal flare before the storm arrived.","zh":"暴风雨到来前，他们就提前发射了信号弹。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “prefire”: to fire or heat in advance.","zh":"“prefire”的过去式/过去分词：预先烧制；预先点火或加热。"},"examples":[{"en":"The manufacturer prefired the parts to remove moisture.","zh":"制造商对零件进行了预烧以去除水分。"}]}],"synonyms":["pre-fired","preheated","prebaked","bisque-fired"],"phonetic":"/ˌpriˈfaɪrd/","extraExplanation":["“prefired”更常见的写法是带连字符的“pre-fired”，在陶瓷与建材语境里尤其常见（如 pre-fired tiles/brick）。","陶瓷里“预烧”常对应“bisque firing / biscuit firing（素烧）”：先把坯体烧硬，之后更方便上釉与二次烧制。"]}
{"word":"prefires","summary":{"en":"“Prefires” usually means shooting before seeing the target (often in games), and less commonly refers to earlier/separate fires before a main blaze.","zh":"“prefires”通常指（多在游戏中）未看清目标就先开枪；较少见时可指在主火情之前发生的先发火点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang, especially in shooting/video games) To shoot at a spot before you clearly see an enemy, based on prediction or sound.","zh":"（俚语，尤指射击/电子游戏）在还没清楚看到敌人前，凭预判或声音朝某个位置先开枪。"},"examples":[{"en":"He prefires the doorway whenever he hears footsteps.","zh":"他一听到脚步声就会对着门口预先开火。"},{"en":"Try to prefire common hiding spots, but don’t waste all your ammo.","zh":"可以对常见躲藏点预开火，但别把子弹都浪费掉。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, technical) Fires that exist or start before a main fire event being discussed (for example, earlier or separate fires in an area).","zh":"（较少见，技术用语）在所讨论的主要火灾/火情之前就已存在或先发生的火（如同一区域更早或独立的火点）。"},"examples":[{"en":"The report distinguishes the main blaze from smaller prefires nearby.","zh":"报告把主火情和附近较小的先发火点区分开来。"}]}],"synonyms":["fire in advance","shoot preemptively","preemptive fire","anticipatory fire"],"phonetic":"/ˌpriːˈfaɪr/","extraExplanation":["“prefire(s)”最常见于游戏/枪战语境，属于口语化用法：pre-（预先）+ fire（开火）。在正式写作中可用更中性的说法，如 “shoot preemptively / fire in advance”。","拼写提示：prefires 可以是动词第三人称单数（He prefires…）或名词复数（the prefires were…），要根据句子结构判断。"]}
{"word":"prefix","summary":{"en":"A prefix is a word part added to the beginning of another word to modify its meaning; it can also mean adding such a beginning label.","zh":"prefix 指“前缀”，即加在词首改变意义的构词成分；也可指“在……前加上某标记/内容”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word part added to the beginning of a word to change its meaning (e.g., “un-” in “unhappy”).","zh":"加在词根或单词前面的构词成分，用来改变意思（如 unhappy 里的 un-）。"},"examples":[{"en":"The prefix “re-” usually means “again,” as in “rewrite.”","zh":"前缀 re- 通常表示“再次”，如 rewrite（重写）。"},{"en":"Learning common prefixes can help you guess new vocabulary.","zh":"学习常见前缀能帮助你猜测生词意思。"}]},{"partOfSpeech":"vt.","definition":{"en":"To add something in front of a name, title, or number (especially in computing or formal labeling).","zh":"在名称、头衔或编号前加上某内容（尤用于计算机或正式标注）。"},"examples":[{"en":"Prefix the filename with the date, like “2026-02-08_report.”","zh":"在文件名前加上日期，如“2026-02-08_report”。"}]}],"synonyms":["word beginning","preformative","prefixation (related term)"],"phonetic":"/ˈpriːfɪks/","extraExplanation":["prefix（前缀）常见于英语构词法：一个前缀往往带有稳定的意义线索。比如 un-（否定）、pre-（在……之前）、mis-（错误地）、inter-（在……之间）。见到陌生词时，先识别前缀 + 词根，常能快速推断大意。","和它相关的概念：suffix（后缀，放在词尾，如 -ness）、root/base（词根/词基）。例如: un + happy；care + -less；tele + scope。"]}
{"word":"prefixable","summary":{"en":"“Prefixable” means a word can take a prefix to form a new word.","zh":"“prefixable”指一个词可以加前缀来构成新词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to have a prefix added (used in word formation).","zh":"（用于构词）可以加前缀的；可加前缀的。"},"examples":[{"en":"“Happy” is prefixable: you can form “unhappy.”","zh":"“happy”是可加前缀的：你可以构成“unhappy”。"},{"en":"Not every word is easily prefixable in natural English.","zh":"并不是每个词在自然英语里都容易加前缀来构词。"}]}],"synonyms":["able to take a prefix","prefix-compatible","affixable (broader)"],"phonetic":"/ˈpriːfɪksəbəl/","extraExplanation":["“prefixable”多见于语言学、词典编写或编辑讨论中，表示某个词根/词能否自然地接上常见前缀（如 un-, re-, pre-, non-）而形成常用词。可加前缀并不等于“语法上可能”，还要看是否符合英语习惯与是否真的有人这样用。"]}
{"word":"prefixal","summary":{"en":"“Prefixal” means “related to or functioning as a prefix” in word formation.","zh":"“prefixal”表示“与前缀有关的；起前缀作用的（构词中）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prefix (a word part added to the beginning of a word to change its meaning).","zh":"与“前缀”有关的；前缀的（前缀是加在词根或词前面的构词成分，用来改变或补充词义）。"},"examples":[{"en":"In English, “un-” is a prefixal element that often means “not,” as in “unhappy.”","zh":"在英语中，“un-”是一个前缀成分，常表示“否定”，如“unhappy（不开心的）”。"},{"en":"The word “rewrite” has a prefixal part “re-” meaning “again.”","zh":"“rewrite（重写）”这个词有一个前缀部分“re-”，意思是“再一次”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Functioning like a prefix or occurring in a prefix position in word formation.","zh":"（语言学）起前缀作用的；在构词中处于前缀位置的。"},"examples":[{"en":"Some languages use prefixal markers to show tense or person.","zh":"有些语言用前缀性的标记来表示时态或人称。"},{"en":"In the analysis, the researcher described the syllable as prefixal rather than a separate word.","zh":"在分析中，研究者把这个音节描述为前缀性的，而不是一个独立的词。"}]}],"synonyms":["prefix","prefixed","prefix-like"],"phonetic":"/ˈpriːfɪksəl/","extraExplanation":["“prefixal”是比较偏学术/语言学写作的词，日常英语里更常见的说法是“prefix”（名词）或“prefix + noun”（如 prefix meaning、prefix form）。","词源上它来自“prefix”（前缀）+ 形容词后缀“-al”（表示“……的”）。"]}
{"word":"prefixally","summary":{"en":"Prefixally means “by using or adding a prefix.”","zh":"prefixally 意为“通过使用/添加前缀的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves adding a prefix (a beginning part of a word) or relating to something as a prefix.","zh":"以加前缀（词首构词成分）的方式；在前缀意义上。"},"examples":[{"en":"The term is formed prefixally by adding “un-” to the adjective.","zh":"这个词是通过在形容词前加“un-”以前缀方式构成的。"},{"en":"In this language, negation is often marked prefixally rather than with a separate word.","zh":"在这种语言里，否定常常通过加前缀来表示，而不是用一个单独的词。"}]}],"synonyms":["with a prefix","by adding a prefix","prefix-wise","as a prefix"],"phonetic":"/ˈpriːfɪk.səl.i/","extraExplanation":["“prefixally”在日常英语里很少见，更常见的表达是“by adding a prefix / with a prefix / using a prefix”。它多出现在语言学、语法或词汇学讨论中。","词汇结构小提示：prefix（前缀）+ -al（……的）→ prefixal（前缀的）+ -ly（以……方式）→ prefixally（以前缀方式）。","常见前缀例子：un-（否定，如 unhappy）、re-（再次，如 rewrite）、pre-（之前，如 prepay）、mis-（错误，如 misunderstand）。"]}
{"word":"prefixation","summary":{"en":"Prefixation is word formation by adding a prefix at the beginning of a base word.","zh":"Prefixation 指通过在词前加前缀来构成新词的构词法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of forming a new word by adding a prefix (a word part put at the beginning), such as un- in unhappy or re- in rewrite.","zh":"“加前缀构词”：在词的开头加上前缀来构成新词的过程，例如 unhappy 中的 un-，rewrite 中的 re-。"},"examples":[{"en":"Prefixation is common in English: add un- to kind to get unkind.","zh":"前缀构词在英语中很常见：在 kind 前加 un- 变成 unkind。"},{"en":"In class we studied prefixation with re-, like re-read and re-use.","zh":"课上我们学习了用 re- 的前缀构词，比如 re-read、re-use。"}]},{"partOfSpeech":"n.","definition":{"en":"The resulting set or pattern of words created through prefixes (how a language uses prefixes).","zh":"由前缀构词形成的词汇系统或模式（指一种语言如何使用前缀来造词的规律）。"},"examples":[{"en":"English prefixation often changes meaning without changing the word’s main category.","zh":"英语的前缀构词常常改变词义，但不一定改变词的主要词类。"}]}],"synonyms":["prefixing","prefixation process","prefix formation"],"phonetic":"/ˌpriːfɪkˈseɪʃən/","extraExplanation":["prefixation 常用于语言学和词汇学（morphology）中。前缀一般放在词根/词干前面，主要作用是改变意义（disagree=“不同意”）或表达否定、重复、时间顺序、程度等（un-, re-, pre-, over-）。","与后缀构词 suffixation（如 -ness, -able）对比：后缀更常影响词类（happy→happiness），而前缀在英语里更常保持原词类（kind→unkind 仍是形容词）。"]}
{"word":"prefixed","summary":{"en":"“Prefixed” means having something added to the beginning, especially a prefix added to a word.","zh":"“prefixed”表示“在开头加了东西”，尤其指“词前加了前缀”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a prefix added; beginning with a prefix.","zh":"带有前缀的；以某个前缀开头的。"},"examples":[{"en":"In English, many negative adjectives are prefixed with “un-,” like “unhappy.”","zh":"在英语里，很多否定形容词会加上前缀“un-”，比如“unhappy（不开心的）”。"},{"en":"The prefixed form can change the meaning of the base word.","zh":"加了前缀的形式会改变词根（原词）的意思。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Added to the front of a word or element.","zh":"（语言学）加在词或语素前面的；前置的。"},"examples":[{"en":"“Re-” is a prefixed element in the verb “rewrite.”","zh":"“re-”在动词“rewrite（重写）”中是一个前置（加在前面）的成分。"},{"en":"Some languages use prefixed markers to show grammar information.","zh":"有些语言会用前缀形式的标记来表达语法信息。"}]},{"partOfSpeech":"vt.","definition":{"en":"To add a prefix to (a word or element).","zh":"给（词或成分）加前缀。"},"examples":[{"en":"Teachers may ask students to prefix “dis-” to make opposites, like “agree” → “disagree.”","zh":"老师可能会让学生给词加上“dis-”来构成反义，比如“agree（同意）→ disagree（不同意）”。"},{"en":"The editor prefixed the report with a short introduction.","zh":"编辑在报告前加了一段简短的引言。"}]}],"synonyms":["prefaced","preceded","with a prefix","prefixal"],"phonetic":"/ˈpriːfɪkst/","extraExplanation":["“prefixed”常见于语言学习/语法讨论中，指“在词前面加上前缀”。常见英语前缀有：un-（否定，如 unhappy）、re-（再次，如 redo）、dis-（相反/否定，如 dislike）、pre-（在……之前，如 pretest）。","注意区分：prefix（n. 前缀；v. 加前缀） vs. prefixed（adj. 带前缀的；vt. 已加上前缀的）。在语法或词汇讲解里，prefixed 常作形容词使用。"]}
{"word":"prefixedly","summary":{"en":"“Prefixedly” means “in a way that adds or uses a prefix.” It’s rare; “by adding a prefix” is more common.","zh":"“prefixedly”指“以加前缀/带前缀的方式”。较少见，更常用说法是“by adding a prefix（通过加前缀）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has a prefix added (i.e., with something placed at the beginning of a word or expression).","zh":"以加前缀的方式；带有前缀地（指在词或表达前面加上成分）。"},"examples":[{"en":"Some technical terms are formed prefixedly, for example by adding “pre-” or “re-.”","zh":"一些技术术语是通过加前缀形成的，例如加上“pre-”或“re-”。"},{"en":"In this list, the root is shown plainly, and the variations are marked prefixedly.","zh":"在这份列表中，词根直接显示，而变体则用加前缀的方式标注出来。"}]}],"synonyms":["with a prefix","by adding a prefix","prefixally (rare)"],"phonetic":"/ˈpriːfɪkstli/","extraExplanation":["“prefixedly”在日常英语中非常少见，更常见的表达是：\n- “with a prefix / with prefixes”\n- “by adding a prefix”\n- “prefix + root”（语言学/词法讲解里）\n例如：Terms are formed **by adding a prefix** to the root.\n\n词形上，它来自“prefix”（前缀）→ “prefixed”（加了前缀的）→ “prefixedly”（以……方式）。在写作中用它可能显得偏学术或生硬，除非你在讲词法规则或编排说明。"]}
{"word":"prefixes","summary":{"en":"“Prefixes” are word beginnings added to change meaning; in linguistics, it refers to multiple such word-beginning elements.","zh":"“prefixes”指加在词首、用来改变词义的前缀；在语言学中也可指多个前缀成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “prefix”: a letter group added to the beginning of a word to change its meaning (e.g., un-, re-, pre-).","zh":"“prefix”的复数：加在词首、用来改变词义的词缀（如 un-，re-，pre-）。"},"examples":[{"en":"English prefixes like un- and re- can change a word’s meaning.","zh":"英语里的前缀（prefixes）如 un- 和 re- 可以改变词的意思。"},{"en":"Learning common prefixes helps you guess the meanings of new words.","zh":"学习常见前缀能帮助你猜出生词的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(Linguistics) More than one prefix used in word formation and analysis.","zh":"（语言学）在构词与分析中使用的多个前缀。"},"examples":[{"en":"In morphology class, we analyzed the prefixes in words like “disagree” and “misunderstand.”","zh":"在构词学课上，我们分析了 “disagree” 和 “misunderstand” 这类词中的前缀。"},{"en":"Some words contain multiple prefixes, though this is less common in everyday English.","zh":"有些词会包含多个前缀，不过在日常英语中不太常见。"}]}],"synonyms":["word beginnings","initial affixes","prefix forms"],"phonetic":"/ˈpriːfɪksɪz/","extraExplanation":["前缀（prefix）属于“词缀”（affix）的一种，放在词根/词干（root/stem）前面，常用来表达否定（un-）、相反（dis-）、重复（re-）、时间顺序（pre-）、数量（bi-, tri-）等概念。","小提示：很多前缀来自拉丁语或希腊语，所以在学术词汇里特别常见。例如 pre-（在……之前）、sub-（在……之下/次级）、trans-（跨越）。把“前缀 + 词根”的结构看懂，能更快扩展词汇量。"]}
{"word":"prefixing","summary":{"en":"Prefixing means adding a prefix to a word, or more generally placing something at the beginning of something else.","zh":"Prefixing 指给单词加前缀，或更广义地指把某物放在另一个东西的开头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of adding a prefix to a word (especially in spelling, linguistics, or word formation)","zh":"（尤指在拼写、语言学或构词中）给单词加前缀的行为或过程"},"examples":[{"en":"In English, prefixing “un-” to “happy” makes “unhappy.”","zh":"在英语里，把“un-”加在“happy”前面就变成“unhappy”。"},{"en":"The worksheet practices prefixing and suffixing to build new words.","zh":"这份练习单训练通过加前缀和后缀来构造新词。"}]},{"partOfSpeech":"n.","definition":{"en":"putting something in front of something else (often before the main item, name, or number)","zh":"把某物放在另一个东西前面（常指放在主要内容、名称或编号之前）"},"examples":[{"en":"Try prefixing the country code before the phone number.","zh":"试着在电话号码前加上国家代码。"},{"en":"They solved the filing problem by prefixing each document title with the date.","zh":"他们通过在每个文件标题前加上日期来解决归档问题。"}]},{"partOfSpeech":"v.","definition":{"en":"adding a prefix to (a word or expression)","zh":"给（单词或表达）加前缀"},"examples":[{"en":"She is prefixing “re-” to verbs to show the action happens again.","zh":"她给动词加上“re-”来表示动作再次发生。"},{"en":"When prefixing “in-,” watch how spelling can change (like “im-” before p/b/m).","zh":"加“in-”时要注意拼写可能变化（如在 p/b/m 前变成“im-”）。"}]}],"synonyms":["adding a prefix","prefixation","prepending","adding in front"],"phonetic":"/ˈpriːfɪksɪŋ/","extraExplanation":["“prefixing”常见于语言学习与语言学：prefix（前缀）是加在词根前、用来改变词义或语法功能的部分。常见前缀有 un-（否定）、re-（再次）、pre-（在……之前）、mis-（错误地）。","英语里有些前缀会因发音更顺口而改变拼写：例如 in- 在 p/b/m 前常变成 im-（impossible, imbalance, immature）。"]}
{"word":"prefixion","summary":{"en":"Prefixion means adding a prefix to a word to create a new word or meaning (rare term; “prefixation” is more common).","zh":"Prefixion 指给词语加前缀以产生新词或新意义（较少用；更常见说法是 prefixation / 前缀化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of adding a prefix to a word (rare; more commonly called “prefixation”)","zh":"给词语加前缀的行为或过程（较少用；更常见的说法是“prefixation / 前缀化”）"},"examples":[{"en":"In English word formation, prefixion can change meaning without changing the word’s part of speech.","zh":"在英语构词中，前缀添加（prefixion）常常改变词义，但不一定改变词性。"},{"en":"The prefixion of “un-” in “unhappy” makes the adjective negative.","zh":"在“unhappy”里加上前缀“un-”，使这个形容词变成否定意义。"}]}],"synonyms":["prefixation","prefixing","affixation (broader)"],"phonetic":"/priːˈfɪkʃən/","extraExplanation":["“prefixion”是一个相对少见的术语，通常在语言学/构词法语境中出现。更常用的是“prefixation（前缀化）”。\n\n前缀（prefix）是加在词根或词首的词缀，如 re-（再次）、un-（否定）、pre-（在……之前）。它常用于改变词义：\n- write → rewrite（再写）\n- possible → impossible（不可能）\n也可能影响语义范围或语气，但多数情况下不改变基本词性。"]}
{"word":"prefixions","summary":{"en":"“Prefixions” is the plural of “prefixion,” meaning the act of adding something at the beginning (especially adding a prefix), or the thing added; rarely, it can mean a mental fixation.","zh":"“prefixions”是“prefixion”的复数，常指把某物加在开头（尤指加前缀）的行为，或指被加在开头的成分；极少数情况下也可指一种“执念/固定关注”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of adding or placing something at the beginning (in front of something else), especially a word-part added to the front of a word","zh":"把某物加在开头（放在前面）的行为；尤指在词前加“前缀”的做法"},"examples":[{"en":"In older grammar books, you may see “prefixion” used for the prefixing of a syllable.","zh":"在较老的语法书里，你可能会看到用 prefixion 表示“在音节前加前缀”。"},{"en":"The prefixion of “un-” often changes a word to its opposite meaning.","zh":"加上 “un-” 这个前缀常常会把词的意思变成相反。"}]},{"partOfSpeech":"n.","definition":{"en":"something that is placed at the beginning; a prefixed element (such as a prefix)","zh":"加在开头的东西；前置成分（如前缀）"},"examples":[{"en":"The name includes a prefixion that indicates rank.","zh":"这个名字里有一个前置成分，用来表示等级。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a fixed attachment of attention or thought to something; a fixation","zh":"（罕见）注意力或思想对某事物的固定依恋；执念"},"examples":[{"en":"He spoke of a prefixion on the past that kept him from moving forward.","zh":"他谈到自己对过去的执念，使他无法向前。"}]}],"synonyms":["prefixing","prefixation","addition (at the beginning)","prefixed element","fixation (rare sense)"],"phonetic":"/priˈfɪkʃən/","extraExplanation":["“prefixion”比较少见，现代英语更常用的是“prefixing”（加前缀的动作）或“prefixation”（语言学术语，指前缀化的构词过程）。","词源上与“prefix”同源，来自拉丁语前缀形式，核心意思都是“放在前面”。在阅读旧文献或旧版语法书时更容易遇到它。"]}
{"word":"prefixture","summary":{"en":"“Prefixture” means adding a prefix to a word (prefixation); it can also refer to the prefixed form, but this use is rare.","zh":"“Prefixture”指给词加前缀的过程（前缀化）；也可指加了前缀后的形式，但较少用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) the act or process of adding a prefix to a word (also called “prefixation”).","zh":"（语言学）给词加前缀的行为或过程（也叫 prefixation「前缀化」）。"},"examples":[{"en":"In English word formation, prefixture is less common than suffixation, but it is still productive (e.g., re- + build → rebuild).","zh":"在英语构词中，prefixture 不如后缀化常见，但仍然很常用（如 re- + build → rebuild「重建」）。"},{"en":"The paper compares prefixture and suffixation across several languages.","zh":"这篇论文比较了多种语言中的前缀化（prefixture）与后缀化。"}]},{"partOfSpeech":"n.","definition":{"en":"a prefix that has been attached to a base word; the resulting prefixed form (rare).","zh":"加到词根/词基上的前缀；或指“加了前缀后的形式”（较少见）。"},"examples":[{"en":"Some learners misunderstand the prefixture in “unhappy” and think it changes the tense.","zh":"有些学习者误解了 unhappy 里的前缀 un-，以为它会改变时态。"}]}],"synonyms":["prefixation","prefixing","affixation"],"phonetic":"/ˌpriːˈfɪkstʃɚ/","extraExplanation":["“prefixture”不是日常英语高频词，更常见的说法是 **prefixation**（前缀化）或 **prefixing**（加前缀）。在语言学写作里偶尔会用“prefixture”来对应“suffixation（后缀化）”。","前缀（prefix）通常改变词义（如 **un-** 表否定、**re-** 表“再次”），但一般不负责表达时态或人称等语法信息；英语里这类语法信息更多由词尾变化或助动词表达。"]}
{"word":"preflagellate","summary":{"en":"Relating to a developmental stage before flagella form.","zh":"与鞭毛形成之前的发育阶段有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Describing a stage in an organism’s life cycle before it develops flagella (tail-like structures used for movement).","zh":"（生物）指生物生命周期中尚未长出鞭毛（用于运动的尾状结构）之前的阶段。"},"examples":[{"en":"Under the microscope, the cells were in a preflagellate stage and showed no active swimming.","zh":"在显微镜下，这些细胞处于前鞭毛阶段，没有出现主动游动。"},{"en":"The parasite transitions from a preflagellate form to a flagellated form as it enters a new host environment.","zh":"这种寄生虫进入新的宿主环境后，会从前鞭毛形态转变为有鞭毛形态。"}]}],"synonyms":["preflagellar","non-flagellated"],"phonetic":"/ˌpriːˈflædʒəˌleɪt/","extraExplanation":["“pre-”表示“之前”，flagellate与flagellum（鞭毛）同源，因此preflagellate常用于描述某些原生生物、藻类或寄生虫在发育过程中“尚未形成鞭毛、运动能力尚不明显”的时期。","该词多见于学术论文或教材，比日常英语更专业；在论文写作中也常见近义表达preflagellar（前鞭毛的）或“non-flagellated stage”（无鞭毛阶段）。"]}
{"word":"preflagellated","summary":{"en":"Preflagellated means “before developing flagella,” and more rarely “before being flogged/flagellated.”","zh":"preflagellated 意为“形成鞭毛之前的”，较少也可指“遭鞭笞之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Describing a stage or cell form that occurs before it develops flagella (whip-like structures used for movement).","zh":"（生物）指在形成鞭毛（用于运动的鞭状结构）之前的阶段或细胞形态。"},"examples":[{"en":"The organism passes through a preflagellated stage before becoming motile.","zh":"该生物在能够运动之前，会经历一个前鞭毛阶段。"},{"en":"Researchers observed preflagellated cells under the microscope during early development.","zh":"研究人员在早期发育过程中用显微镜观察到了前鞭毛细胞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening before flagellation (being whipped or beaten), usually in a historical or literary context.","zh":"（罕见）指在鞭笞（被鞭打）发生之前，常见于历史或文学语境。"},"examples":[{"en":"In the narrative, the prisoner’s preflagellated silence heightens the tension.","zh":"在叙事中，囚犯在受鞭笞前的沉默加剧了紧张气氛。"},{"en":"The text contrasts the preflagellated calm with the violence that follows.","zh":"文章将鞭笞前的平静与随后的暴力形成对照。"}]}],"synonyms":["pre-flagellated","before flagella formation","pref lagellar (rare)"],"phonetic":"ˌpriːˈflædʒəˌleɪtɪd","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ flagellated（源自拉丁语 flagellum，“鞭子/鞭状物”；在生物学里也指“鞭毛”）构成。实际使用中更常见于生物学写作（如“preflagellated stage/cells”）。","拼写上常见两种写法：连写 preflagellated 或加连字符 pre-flagellated；学术文本里两者都可能出现。"]}
{"word":"preflame","summary":{"en":"“Preflame” is a rare technical term meaning “before the main flame/ignition,” and it can also mean to start a preliminary flame.","zh":"“preflame”是较少见的技术用语，表示“主火焰/点燃之前的”，也可作动词指“先引发预备性的火焰”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Happening before the main flame or full ignition; related to an early stage of burning.","zh":"（技术用语）发生在主火焰或完全点燃之前的；与燃烧早期阶段有关。"},"examples":[{"en":"Engineers studied preflame reactions to understand how ignition begins.","zh":"工程师研究预火焰反应，以了解点火是如何开始的。"},{"en":"The report describes preflame chemistry in fuel–air mixtures.","zh":"报告描述了燃料—空气混合物中的预火焰化学过程。"}]},{"partOfSpeech":"v.","definition":{"en":"To start a small or preliminary flame before the main flame (rare; technical).","zh":"（少见；技术用语）在主火焰之前先引发小的、预备性的火焰。"},"examples":[{"en":"In some lab setups, technicians preflame the burner to stabilize the heat.","zh":"在一些实验装置中，技术人员会先让燃烧器预燃，以稳定热量。"}]}],"synonyms":["pre-ignition","preheat","pilot light","incipient combustion"],"phonetic":"/ˈpriːfleɪm/","extraExplanation":["“preflame”在日常英语里很少单独使用，更常见的写法是带连字符的“pre-flame”，或用更常用的词替代，比如“pre-ignition（预点火）”“preheat（预热）”“pilot light（引火火种/长明小火）”。","在燃烧科学里，“preflame reactions / preflame chemistry”通常指火焰前沿到来之前，混合气体已经发生的缓慢化学反应（为点燃做准备），常出现在学术论文或技术报告中。"]}
{"word":"preflatter","summary":{"en":"To flatter someone in advance to gain favor.","zh":"为讨好对方、获取好感而提前奉承。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, often written with a hyphen: pre-flatter) To flatter someone beforehand, especially to make them more willing to agree or cooperate later.","zh":"（罕用，常写作 pre-flatter）事先奉承（某人），通常是为了让对方之后更愿意同意或配合。"},"examples":[{"en":"He tried to preflatter the manager before asking for a raise.","zh":"他在提出加薪前先奉承了一下经理。"},{"en":"The email was written to pre-flatter the client and soften the bad news.","zh":"这封邮件写得先恭维客户一番，好让坏消息更容易接受。"}]}],"synonyms":["butter up","sweet-talk","curry favor (with)","ingratiate (oneself)","flatter"],"phonetic":"/priːˈflætər/","extraExplanation":["“preflatter”并不是常见词，更多时候人们会直接用“flatter someone before…”或更自然的表达，如“butter someone up (before…)”（先拍马屁/先哄一哄）。“pre-”这个前缀表示“在……之前”，所以词义很好猜，但在真实语境里出现频率很低。","如果你是在阅读中看到它，作者可能在刻意用“pre-”突出“提前铺垫、先讨好”的策略意味，带一点讽刺或批评的语气。"]}
{"word":"preflattery","summary":{"en":"Preflattery means praising someone beforehand, usually to make a later request easier.","zh":"preflattery 指在提出请求前先奉承夸赞，通常为了让后续请求更好开口或更容易成功。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Flattery given in advance (before asking for something), often to make someone more willing to agree or help.","zh":"预先的奉承（在提出请求或目的之前先夸赞讨好），常用来让对方更愿意答应或帮忙。"},"examples":[{"en":"He started with a little preflattery before asking for a favor.","zh":"他先来了一点预先奉承，然后才开口求帮忙。"},{"en":"She saw through the preflattery and asked what he really wanted.","zh":"她看穿了这套预先奉承，问他到底想要什么。"}]}],"synonyms":["preemptive flattery","buttering up","sweet talk","ingratiation"],"phonetic":"/priˈflætəri/","extraExplanation":["“preflattery”不是非常常见的标准词，更像是由前缀“pre-（在……之前）”+“flattery（奉承）”临时组合出来的说法。写作中若想更自然，常用表达包括“butter someone up (before…)（先拍马屁）”“lay it on thick（夸得很过火）”“preemptive flattery（先发制人的奉承）”。","这种做法在英语语境里常带一点负面或讽刺意味：暗示说话者的赞美不够真诚，而是为了后面的请求、推销或谈判铺路。"]}
{"word":"preflavor","summary":{"en":"“Preflavor” means to season or add flavor in advance (often in food manufacturing), or the flavoring added ahead of time.","zh":"“Preflavor”指在前期预先调味（常见于食品加工语境），也可指预先添加的调味/风味成分。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add flavor to food (or an ingredient) in advance, before further processing, cooking, or packaging; to season ahead of time","zh":"（在进一步加工、烹饪或包装之前）预先给食物或原料调味；提前加味"},"examples":[{"en":"The manufacturer preflavors the chips before they are baked.","zh":"厂家在烘烤前就先给薯片预先调味。"},{"en":"Some meal kits preflavor the sauce so dinner comes together faster.","zh":"有些料理包会把酱料预先调味，这样晚餐能更快完成。"}]},{"partOfSpeech":"n.","definition":{"en":"a pre-added flavoring or seasoning used before a main cooking or production step","zh":"预先添加的调味料；预调味（用于后续主要烹饪或生产步骤之前）"},"examples":[{"en":"The soup base includes a garlic preflavor.","zh":"这款汤底包含蒜味的预调味。"}]}],"synonyms":["pre-season","season ahead of time","pre-flavor (hyphenated)","pre-flavored"],"phonetic":"/priˈfleɪvɚ/","extraExplanation":["“preflavor”并不是日常英语中很常见的标准词，更常见的说法是：season ahead of time（提前调味）、pre-season（预先调味）、pre-flavored / preflavoured（预调味的）。它多见于食品工业、配方、产品说明等语境。","构词上是前缀 pre-（“在……之前”）+ flavor（“调味/风味”）。书写上也常见连字符形式 pre-flavor / pre-flavored。"]}
{"word":"preflavoring","summary":{"en":"Preflavoring means adding flavor ahead of time, often before further processing or cooking.","zh":"preflavoring 指提前调味/加香，常用于进一步加工或烹调之前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of adding flavor to something in advance, especially before further manufacturing or preparation","zh":"（尤指在进一步加工或烹调之前）预先给某物调味/加香的过程"},"examples":[{"en":"The company uses preflavoring to make the snack taste consistent in every batch.","zh":"这家公司用预先调味来保证每一批零食的味道一致。"},{"en":"Preflavoring the meat can save time during service, but it may change the texture.","zh":"肉类预先调味能节省出餐时间，但可能会影响口感/质地。"}]}],"synonyms":["pre-seasoning","seasoning in advance","pre-season","pre-flavoring"],"phonetic":"/priːˈfleɪvərɪŋ/","extraExplanation":["“preflavoring”多见于食品工业、配方与加工语境（如零食、饮料粉、肉制品），日常口语里更常说“season in advance / pre-season / pre-seasoning”。","拼写上有时会写成“pre-flavoring”（加连字符），意思不变。","注意美式英语用“flavor”，英式英语常见拼写为“flavour”，因此也可能见到“preflavouring”。"]}
{"word":"preflection","summary":{"en":"Preflection means thinking (or writing) about your goals and possible outcomes before you act, often used in education as a ‘before’ partner to reflection.","zh":"Preflection 指在行动或学习之前进行的预先思考/书写：设定目标并预测可能结果，常在教育语境中与 reflection（事后反思）搭配使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Education, personal development) Thinking ahead before you act—anticipating outcomes, risks, or feelings; “reflection in advance.”","zh":"（教育/自我成长）在行动之前先思考——预想结果、风险或感受；相当于“事前反思/预先反思”。"},"examples":[{"en":"Before I replied to the email, I did a quick preflection about how my words might sound.","zh":"在回复邮件之前，我先做了个简短的预先反思，想想我的措辞听起来会怎样。"},{"en":"Our teacher asks for preflection at the start of each project: What could go wrong, and what help will you need?","zh":"老师要求我们在每个项目开始时做“预先反思”：可能会出什么问题？你需要什么帮助？"}]},{"partOfSpeech":"n.","definition":{"en":"A short written or spoken statement made before an activity, explaining your goals, expectations, or plan.","zh":"活动开始前写下或说出的简短说明：你的目标、期待或计划。"},"examples":[{"en":"Write a one-paragraph preflection before the lab and a reflection afterward.","zh":"实验前写一段“预先反思”，实验后再写“反思”。"},{"en":"My preflection was simple: stay calm, ask questions, and take notes.","zh":"我的预先反思很简单：保持冷静、多提问、做笔记。"}]}],"synonyms":["anticipation","forethought","planning","self-check","pre-mortem"],"phonetic":"/priˈflɛkʃən/","extraExplanation":["“preflection”是由“pre-（在……之前）+ reflection（反思）”组合而来的较新用词，常见于教育、培训与写作课堂（如“preflection + reflection”的学习流程）。","在日常口语中更常用的表达有：“think ahead / plan ahead / anticipate consequences / do a quick check-in with yourself”。使用“preflection”会带有课堂或训练语境的感觉。"]}
{"word":"preflexion","summary":{"en":"Preflexion is a rare noun meaning a forward bend (flexion), especially one that happens before another movement.","zh":"Preflexion 是个较少见的名词，指向前弯曲（屈曲），尤其指在另一动作之前发生的“预先屈曲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Forward bending of a joint or body part; flexion that happens beforehand or in preparation for another movement (a rare term).","zh":"（较少见）关节或身体部位向前弯曲；为下一步动作做准备而先发生的屈曲动作。"},"examples":[{"en":"In some exercises, a brief preflexion of the knees helps you jump more smoothly.","zh":"在一些训练中，膝盖先轻微屈曲（preflexion）能让起跳更顺畅。"},{"en":"The therapist noted preflexion of the neck before the patient turned to the side.","zh":"治疗师记录到患者侧转之前颈部先出现了前屈（preflexion）。"}]}],"synonyms":["flexion","forward flexion","bending"],"phonetic":"/priˈflɛkʃən/","extraExplanation":["这个词非常少见，更多时候人们直接用更常见的 flexion（屈曲/弯曲）或用短语表达，如 slight knee flexion（膝关节轻微屈曲）、forward flexion（前屈）。","构词上 pre- 表示“在……之前/预先”，flexion 表示“屈曲”。因此 preflexion 字面意思就是“预先的屈曲”。在运动科学/康复语境中，有时用来强调某个动作前的“先屈再伸”的准备阶段。"]}
{"word":"preflight","summary":{"en":"Preflight means a safety/ready check before a flight, or more generally an advance test before the main action.","zh":"Preflight 指起飞前的安全与准备检查；也可泛指在正式执行前进行的预检或预先测试。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A check done before a flight to make sure an aircraft, crew, and plans are ready and safe.","zh":"（飞行前的）检查；起飞前确认飞机、机组与飞行计划是否准备就绪并安全。"},"examples":[{"en":"The pilot completed the preflight before boarding began.","zh":"飞行员在登机开始前完成了飞行前检查。"},{"en":"A thorough preflight can prevent small problems from becoming emergencies.","zh":"彻底的起飞前检查可以防止小问题演变成紧急情况。"}]},{"partOfSpeech":"v.","definition":{"en":"To check or prepare something in advance, especially by running a set of tests before the main event.","zh":"（尤指在正式开始前）进行预检/预先测试；提前检查准备。"},"examples":[{"en":"We preflighted the presentation to make sure the videos would play.","zh":"我们在演示前做了预检，确保视频能正常播放。"},{"en":"The app preflights your internet connection before uploading files.","zh":"该应用在上传文件前会先检测你的网络连接。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done before a flight; relating to preflight checks or preparation.","zh":"起飞前的；与飞行前检查或准备有关的。"},"examples":[{"en":"The mechanic reviewed the preflight checklist.","zh":"机务人员查看了起飞前检查清单。"},{"en":"Preflight planning includes checking weather and fuel needs.","zh":"飞行前规划包括查看天气和燃油需求。"}]}],"synonyms":["preflight check","preflight inspection","run-through","dry run","test"],"phonetic":"/ˈpriˌflaɪt/","extraExplanation":["在航空领域里，preflight 常与 checklist（检查清单）搭配使用，强调“按步骤逐项确认”，例如检查燃油、操纵面、仪表、天气与航线等。","在软件/网络语境中，preflight 常指“正式执行前的自动检测”，比如浏览器在跨域请求（CORS）前的预检请求也常被称为 preflight。"]}
{"word":"preflood","summary":{"en":"“Preflood” means “before a flood,” especially used for conditions, images, or planning before a flood; it can also refer to the biblical era before Noah’s Flood.","zh":"“preflood”意为“洪水前的”，常指洪水发生前的情况/影像/规划；也可指《圣经》中诺亚大洪水之前的时代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing, happening, or relating to the time before a flood (especially a major or historic flood).","zh":"（尤指重大或历史性洪水）发生之前的；洪水前的。"},"examples":[{"en":"They studied preflood satellite images to map the damage afterward.","zh":"他们研究洪水前的卫星图像，以便在事后绘制受损情况。"},{"en":"Preflood planning can save lives during evacuation.","zh":"洪水前的规划可以在撤离时挽救生命。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the world “before the Flood” in the Bible (the period before Noah’s Flood), often used in religious or literary contexts.","zh":"（宗教/文学语境）指《圣经》中“诺亚洪水”之前的世界/时期的；大洪水前的。"},"examples":[{"en":"The novel describes a preflood world full of myth and mystery.","zh":"这部小说描写了一个充满神话与神秘色彩的大洪水前世界。"},{"en":"Some writers use “preflood” to evoke an ancient, vanished age.","zh":"一些作者用“preflood”来唤起一种古老而消逝的时代。"}]}],"synonyms":["pre-flood","before the flood","anteflood (rare)"],"phonetic":"/ˌpriːˈflʌd/","extraExplanation":["“preflood”更常见的写法是带连字符的“pre-flood”。在科学/灾害管理语境里，它通常指某次具体洪水事件之前（如“pre-flood conditions/imagery/planning”）。","在宗教语境中，“the Flood”常特指《创世记》里的诺亚洪水，因此“preflood”可能带有特定信仰背景；在学术写作中使用时，注意说明指的是哪一种“洪水”。"]}
{"word":"prefloration","summary":{"en":"Prefloration means the arrangement of petals/sepals in a flower bud before it opens (a botany term).","zh":"prefloration 指花蕾中花瓣或萼片在开放前的排列方式（植物学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The arrangement of petals or sepals in a flower bud before it opens; how the floral parts overlap or touch while still in the bud.","zh":"（植物学）花在尚未开放的花蕾中，花瓣或萼片的排列方式；即花部在花蕾期如何相互重叠或接触。"},"examples":[{"en":"In some species, prefloration is twisted, so each petal overlaps the next in one direction.","zh":"在一些物种中，花前式为“扭转式”，每片花瓣都按同一方向覆盖下一片。"},{"en":"Botanists often describe prefloration to help identify plant families.","zh":"植物学家常通过描述花前式来辅助鉴定植物科属。"}]}],"synonyms":["aestivation","estivation","bud arrangement"],"phonetic":"/ˌpriːfləˈreɪʃən/","extraExplanation":["“prefloration”是较少见的术语，更常见的同义词是“aestivation”（英式拼写）/“estivation”（美式拼写在植物学里也可见），都指花蕾中花被片（花瓣、萼片）的排列方式。","常见类型包括：valvate（镊合式：边缘相接不重叠）、imbricate（覆瓦式：部分重叠）、twisted/contorted（扭转式：按固定方向依次重叠）。","词源可拆为“pre-（在……之前）+ flor-（花）+ -ation（名词后缀）”，字面意思就是“开花之前的状态/排列”。"]}
{"word":"preflowering","summary":{"en":"Preflowering means “before flowering,” describing the stage or conditions before a plant starts to bloom.","zh":"preflowering 指“开花前的”，用于描述植物开始开花之前的阶段或相关条件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a plant begins to flower; relating to the stage of growth before flowering starts.","zh":"开花前的；与植物开始开花之前的生长阶段有关的。"},"examples":[{"en":"Keep nitrogen levels moderate during the preflowering stage to avoid too much leaf growth.","zh":"在开花前阶段要把氮肥控制在适中水平，以免叶子长得过旺。"},{"en":"The preflowering period is a good time to check for pests and improve airflow.","zh":"开花前这段时间很适合检查虫害并改善通风。"}]}],"synonyms":["pre-bloom","before flowering","pre-flowering"],"phonetic":"/ˌpriˈflaʊərɪŋ/","extraExplanation":["“pre-”表示“在……之前”，加在“flowering（开花）”前面就构成“preflowering（开花前的）”。该词常见于园艺、农业、植物学或种植说明中，用来区分生长阶段（如营养生长期、开花期、结果期等）。","写法上也常见带连字符的形式“pre-flowering”，两者意思相同；在学术或说明书中带连字符更常见。"]}
{"word":"prefocus","summary":{"en":"Prefocus means to focus a camera ahead of time so you’re ready to capture a moment quickly.","zh":"prefocus 指在摄影/摄像中提前对焦，以便迅速捕捉关键瞬间。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Photography/filming) To focus a camera or lens in advance, usually before pressing the shutter or starting to record, so the subject will be sharp at the right moment.","zh":"（摄影/摄像）预先对焦：在按下快门或开始录制之前先把镜头对好焦，以便关键瞬间主体清晰。"},"examples":[{"en":"I prefocused on the spot where the runner would cross the finish line.","zh":"我先对准跑者将要冲线的位置预先对焦。"},{"en":"To capture the bird in flight, she prefocused on a nearby branch and waited.","zh":"为了拍到鸟儿起飞，她先对附近的树枝预先对焦，然后等待。"},{"en":"The phone camera can prefocus when you tap the screen.","zh":"手机相机在你点按屏幕时可以先行对焦。"}]}],"synonyms":["pre-focus","focus in advance","pre-set focus","focus lock (related)"],"phonetic":"/ˌpriːˈfoʊkəs/","extraExplanation":["“Prefocus”常见于摄影技巧里：当你预计主体会快速进入某个位置（如运动、街拍、舞台表演），先把焦点设在那个位置，等瞬间发生时直接按下快门，可减少对焦延迟。常与“manual focus（手动对焦）”“focus lock（对焦锁定）”一起使用。"]}
{"word":"prefocused","summary":{"en":"“Prefocused” means already focused or set up to focus in advance (literally in optics, or figuratively in attention).","zh":"“prefocused”指“预先对焦/预先聚焦好的”，也可比喻“事先把注意力或方向锁定”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already focused (or set to focus) in advance, so it needs little or no adjustment later.","zh":"预先对焦的；提前把焦点设定好的（因此之后几乎不需要再调整）。"},"examples":[{"en":"The camera has a prefocused lens, so it’s quick to shoot street scenes.","zh":"这台相机是预先对焦镜头，所以拍街景很快。"},{"en":"For the demo, we used a prefocused projector to save time.","zh":"为了演示节省时间，我们用了预先对焦的投影仪。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figuratively: already directed toward a particular goal, topic, or outcome before starting.","zh":"（比喻）事先就把注意力/目标对准某个方向的；预先定向的。"},"examples":[{"en":"The interview questions felt prefocused on one issue.","zh":"这些采访问题给人的感觉是事先就锁定在一个议题上。"},{"en":"Try not to be prefocused on the result; focus on the process too.","zh":"别一开始就只盯着结果，也要关注过程。"}]}],"synonyms":["pre-focused","preset","pre-set","prearranged","preconfigured","predirected"],"phonetic":"/priːˈfoʊkəst/","extraExplanation":["“prefocused”= pre-（预先）+ focused（已聚焦/已专注）。在摄影里常见：指镜头在出厂或拍摄前就设定好焦距/对焦距离（常见于一次性相机、某些街拍相机），以便快速拍摄。","比喻用法在写作和评论中也常见，暗示“带着预设立场或方向”，有时带一点批评意味（如问题设计不够开放）。"]}
{"word":"prefocuses","summary":{"en":"“Prefocuses” means sets focus in advance (especially for a camera), or prepares attention/planning ahead of time.","zh":"“Prefocuses”指（尤其在摄影中）预先对焦；也可引申为提前把注意力或计划聚焦到某事上。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a camera or a person using a camera) to set focus in advance, usually before the exact moment you take a photo.","zh":"（相机或拍摄者）预先对焦；在真正按下快门前先把焦点设好。"},"examples":[{"en":"She prefocuses on the spot where the runner will cross the finish line.","zh":"她先对焦在跑者将冲线的位置。"},{"en":"The photographer prefocuses so the shot is sharp the moment the bird lands.","zh":"摄影师先预先对焦，这样鸟一落下画面立刻就清晰。"}]},{"partOfSpeech":"v.","definition":{"en":"to direct attention or planning toward something ahead of time; to focus in advance.","zh":"（引申）事先把注意力/计划集中到某事上；提前聚焦。"},"examples":[{"en":"The team prefocuses on the key risks before the launch.","zh":"团队在上线前先把注意力集中在关键风险上。"},{"en":"He prefocuses his study time on the chapters most likely to be tested.","zh":"他把学习时间提前聚焦在最可能考的章节。"}]}],"synonyms":["pre-focuses","prepares","anticipates","targets","zeroes in on"],"phonetic":"/priˈfoʊkəs/","extraExplanation":["“prefocuses”是动词“prefocus”的第三人称单数（he/she/it prefocuses）。更常见的表达还有：pre-focus / pre-focuses（带连字符）、prefocus on…（在……上预先对焦/提前聚焦）。","在摄影语境里，prefocus常用于“动作会发生在固定位置”的场景（如跑步冲线、人物走到门口、鸟停在树枝上）。先对焦能减少快门延迟与对焦失败，提高抓拍成功率。"]}
{"word":"prefocusing","summary":{"en":"Prefocusing means setting focus in advance, especially in photography, so you can react quickly when the moment happens.","zh":"Prefocusing 指提前把焦点设定好（尤指摄影中的预先对焦），以便在关键时刻快速拍到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of focusing something in advance, before the main action happens (especially setting a camera or lens to a chosen distance ahead of time)","zh":"预先对焦；在主要动作发生前先把焦点调好（尤指相机/镜头先对到某个距离）"},"examples":[{"en":"In street photography, prefocusing helps you capture quick moments without waiting for autofocus.","zh":"在街头摄影中，预先对焦能让你不用等自动对焦就抓到瞬间。"},{"en":"She used prefocusing at two meters and waited for people to walk into that zone.","zh":"她把焦点预设在两米处，等人走进那个范围再拍。"}]},{"partOfSpeech":"v.","definition":{"en":"focusing in advance; setting focus before taking a photo or before a subject reaches a specific point","zh":"预先对焦；提前把焦点设定好（在拍摄前或主体到达某个位置前）"},"examples":[{"en":"Try prefocusing on the spot where the runner will pass.","zh":"试着先对焦在跑者将要经过的位置。"},{"en":"He was prefocusing while the band was still setting up on stage.","zh":"乐队还在台上布置时，他就已经在预先对焦了。"}]}],"synonyms":["pre-focusing","pre-focus (on)","set focus in advance","zone focusing (related)"],"phonetic":"/ˌpriˈfoʊkəsɪŋ/","extraExplanation":["“prefocusing”多见于摄影语境，也常写作“pre-focusing”或动词短语“pre-focus”。在自动对焦不稳定、光线很暗、或需要快速抓拍的场景（如街拍、舞台、体育）尤其常用。与之相关的技巧还有“zone focusing（区域对焦）”“hyperfocal distance（超焦距）”。"]}
{"word":"prefocussed","summary":{"en":"“Prefocussed” means already focused in advance, literally (lens) or figuratively (attention).","zh":"“prefocussed”表示事先已经对焦或预先集中注意力（英式拼写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already focused in advance (physically, such as a camera lens) or mentally prepared to concentrate on something.","zh":"事先已经对焦的（如镜头）；或（注意力、思维）预先集中、准备好专注于某事的。"},"examples":[{"en":"The camera comes with a prefocussed lens, so it’s quick to use.","zh":"这台相机配有预先对焦的镜头，所以用起来很快。"},{"en":"She arrived prefocussed on the key points for the meeting.","zh":"她到场时已经把注意力预先集中在会议要点上。"}]}],"synonyms":["prefocused","pre-focused","prepared","ready","focused"],"phonetic":"/ˌpriːˈfoʊkəst/","extraExplanation":["“prefocussed”是英式拼写，常见于采用英式拼写规则的写法；美式更常写作“prefocused”。两者意思相同。","在摄影/光学语境中，它常指镜头或装置出厂或使用前就“预对焦”；在日常比喻用法中，表示人在开始前就把注意力或目标“先对准”。"]}
{"word":"prefocusses","summary":{"en":"“Prefocusses” means “focuses in advance,” especially in photography or planning attention ahead of time.","zh":"“prefocusses”表示“预先聚焦/提前集中注意力”，常见于摄影或提前规划注意力的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular present) to focus in advance; to set attention or a camera lens on something before the main action happens.","zh":"（动词第三人称单数）预先聚焦；在主要行动发生前先把注意力或相机镜头对准某物。"},"examples":[{"en":"The photographer prefocusses on the doorway, waiting for the couple to step into the light.","zh":"摄影师预先把焦点对在门口，等新人走进光线里。"},{"en":"She prefocusses her thinking on the first problem before the meeting starts.","zh":"会议开始前，她先把思路集中到第一个问题上。"}]}],"synonyms":["prefocuses","pre-focuses","prepares","anticipates","zeroes in (on)"],"phonetic":"/ˌpriːˈfoʊkəsɪz/","extraExplanation":["“prefocusses”是“prefocus”的第三人称单数现在时形式，意思等同于“prefocuses”。在拼写上，美式英语更常用“focuses”，英式英语有时会写“focusses”。在摄影语境里更常见，指先把镜头焦点设在预计主体会出现的位置。"]}
{"word":"prefocussing","summary":{"en":"“Prefocussing” means focusing in advance, especially setting focus before taking a photo or before starting a task.","zh":"“prefocussing”指预先对焦或事先把注意力集中好，常用于摄影/工作准备等语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of focusing something in advance; adjusting focus before a later action (especially before taking a photo or before a task begins)","zh":"预先对焦；事先把注意力集中好（尤指拍照前先调好焦点或做事前先确定重点）"},"examples":[{"en":"In low light, try prefocussing on a nearby object before you press the shutter.","zh":"在光线较暗时，可以先对附近的物体预先对焦，再按下快门。"},{"en":"She spent the morning prefocussing her efforts on the most urgent problems.","zh":"她用整个上午先把精力预先集中在最紧急的问题上。"}]}],"synonyms":["pre-focusing","prefocusing","pre-focusing on","locking focus","zeroing in beforehand"],"phonetic":"/priˈfoʊkəsɪŋ/","extraExplanation":["“prefocussing”通常是“prefocus”的现在分词/动名词形式，更常见的拼写是美式“prefocusing”。英式拼写里常见“双写 s”的形式：focussing。","常见于摄影与影视语境：在按下快门/开始录制前先锁定焦点（也可写作 pre-focus / prefocus）。在比喻用法中，表示“提前确定关注点/重点”。"]}
{"word":"prefoliation","summary":{"en":"Prefoliation is the way young leaves are arranged inside a bud before they unfold.","zh":"Prefoliation 指幼叶在芽内、展开之前的排列方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The arrangement of young leaves in a bud before they open and expand.","zh":"（植物学）叶芽中幼叶在尚未展开前的排列方式。"},"examples":[{"en":"Different species can be identified by their prefoliation patterns in the bud.","zh":"不同物种有时可以通过芽中幼叶的 prefoliation（幼叶排列）模式来辨认。"},{"en":"The textbook compares prefoliation in oaks and maples.","zh":"教材比较了橡树和枫树的幼叶排列方式。"}]}],"synonyms":["vernation","leaf arrangement in bud"],"phonetic":"/ˌpriːfoʊliˈeɪʃən/","extraExplanation":["词源提示：pre-（在……之前）+ foliation（叶的形成/叶状结构），字面意思是“叶子展开之前的状态/排列”。","相关术语对比：aestivation 指“花芽中花瓣/萼片”的排列；vernation 常指“蕨类等幼叶在展开前的卷曲/排列”。在一些资料里 vernation 也会被用来泛指叶芽内幼叶的排列。"]}
{"word":"prefool","summary":{"en":"“Prefool” is not standard English; it’s probably a misspelling or an invented word.","zh":"“prefool”不是标准英语单词，多半是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a made-up form. It may be intended to mean “before someone is fooled” or “to fool beforehand,” but this is not established usage.","zh":"不是常见词典中的标准英语单词；很可能是拼写错误或自造词。可能想表达“在某人被骗/被愚弄之前”或“提前愚弄”，但这并不是规范用法。"},"examples":[{"en":"I can’t find “prefool” in a dictionary—did you mean “foolproof” or “pre-school”?","zh":"我在词典里查不到“prefool”——你是不是想写“foolproof（万无一失的）”或“pre-school（学前的）”？"},{"en":"If you tell me the full sentence, I can guess what “prefool” was supposed to mean.","zh":"如果你把完整句子发给我，我可以帮你判断“prefool”本来想表达什么。"}]}],"phonetic":"priːˈfuːl","extraExplanation":["在英语里，前缀 pre- 通常表示“之前/预先”（如 preheat 预热、prepay 预付）。但 pre- 一般不会直接和名词/动词 fool 组合成“prefool”这种常用词。更自然的相关词包括：\n- foolproof（形容词）“不会出错的；万无一失的”\n- fool someone（动词短语）“欺骗/愚弄某人”\n- April Fools’ Day（文化用语）“愚人节”\n如果你能提供你看到它的上下文（句子、领域：游戏/编程/社交媒体等），我也可以判断它是否是某个圈子的术语或用户名。"]}
{"word":"preforbidden","summary":{"en":"“Preforbidden” means “forbidden beforehand,” but it’s rare and nonstandard; use more common phrasing in most writing.","zh":"“preforbidden”意为“事先被禁止的”，但很少见且非标准；大多数场合建议用更常见的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"forbidden in advance; prohibited beforehand (rare, nonstandard).","zh":"预先禁止的；事先被禁止的（较少见、非标准用法）。"},"examples":[{"en":"Certain actions are preforbidden in the contract, even before the project begins.","zh":"合同中某些行为在项目开始之前就被预先禁止。"},{"en":"The game has a list of preforbidden words you can’t use in chat.","zh":"这个游戏有一份聊天中预先禁止使用的词表。"}]}],"synonyms":["forbidden in advance","prohibited beforehand","banned ahead of time","preemptively banned"],"phonetic":"/ˌpriːfərˈbɪdən/","extraExplanation":["“preforbidden”在现代英语中非常少见，通常不作为标准词条出现。更自然的表达是“forbidden in advance / prohibited beforehand / banned ahead of time”。","构词上可理解为“pre-（在……之前）+ forbidden（被禁止的）”。在正式写作中，建议改用更常见的短语来避免读者困惑。"]}
{"word":"preforceps","summary":{"en":"“Preforceps” is a rare medical term meaning “before forceps are used,” especially in assisted childbirth.","zh":"“Preforceps”是较少见的医学用语，表示“上产钳之前”，多用于产钳助产的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, medical/obstetrics) Relating to the period or condition before forceps are applied during an assisted delivery.","zh":"（罕见，医学/产科）与使用产钳（forceps）进行助产之前的阶段或状态有关的。"},"examples":[{"en":"The team reassessed fetal position in the preforceps stage.","zh":"医疗团队在上产钳前（preforceps阶段）再次评估了胎位。"},{"en":"Preforceps checks include confirming dilation and head station.","zh":"上产钳前（preforceps）的检查包括确认宫口开大程度和胎头下降位置。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The time just before forceps are used in childbirth.","zh":"（罕见）在分娩过程中使用产钳之前的时间段。"},"examples":[{"en":"In the preforceps, the clinician explained the risks and benefits to the patient.","zh":"在上产钳前，临床医生向产妇解释了风险与益处。"}]}],"synonyms":["before forceps are applied","prior to forceps delivery","pre-forceps"],"phonetic":"/ˌpriˈfɔrˌsɛps/","extraExplanation":["“Preforceps”不是日常英语词汇，更常见的表达是“before forceps are applied / prior to forceps delivery（上产钳前/产钳助产前）”。","构词上：pre-（在……之前）+ forceps（钳子；产钳）。在产科语境里，forceps 指“产钳”，不是普通工具钳。"]}
{"word":"preforgave","summary":{"en":"“Preforgave” means “forgave in advance,” but it’s informal and uncommon.","zh":"“preforgave”意为“提前原谅”，但用法偏非正式且不常见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Informal, rare) To forgive someone in advance—before they have apologized or before the mistake happens.","zh":"（非正式、较少见）预先原谅；在对方道歉之前，甚至在事情发生前就先选择原谅。"},"examples":[{"en":"She prefogave her friend, knowing he might say something awkward under stress.","zh":"她预先原谅了朋友，因为她知道他在压力下可能会说些尴尬的话。"},{"en":"I prefogave myself for the small mistakes I might make during my first week at work.","zh":"我在上班第一周前就先原谅自己可能会犯的小错误。"}]}],"synonyms":["forgave in advance","already forgave","let it go beforehand","preemptively forgave"],"phonetic":"/ˌpriːfərˈɡeɪv/","extraExplanation":["“preforgave”通常被理解为动词“preforgive”的过去式（preforgive → prefogave），意思是“提前原谅”。但它并不是常见或标准的词形，日常写作里更常用“forgave (in advance)”或“had already forgiven”。","从构词看，前缀“pre-”表示“在……之前”。因此“preforgive”直观含义就是“在事情发生/道歉之前先原谅”。","如果你是在文章里看到“preforgave”，也可能是作者刻意创造的词（neologism）来强调“主动、提前的宽恕”这一语气。"]}
{"word":"preforgive","summary":{"en":"“Preforgive” means to forgive someone ahead of time, before a mistake happens.","zh":"“Preforgive”指在错误发生之前就先表示原谅。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to forgive someone in advance, before they have actually done something wrong (often used when you expect a small mistake).","zh":"预先原谅；在对方还没真正犯错之前就先表示原谅（常用于预期会有小失误时）。"},"examples":[{"en":"I preforgive you for being five minutes late—traffic is awful today.","zh":"我先原谅你迟到五分钟——今天路况太糟了。"},{"en":"The teacher preforgave the class for any nervous mistakes during the first presentation.","zh":"老师先原谅全班在第一次展示时可能因为紧张出现的错误。"}]}],"synonyms":["forgive in advance","excuse in advance","pardon in advance"],"phonetic":"/ˌpriːfɚˈɡɪv/","extraExplanation":["“preforgive”并不是非常常见的标准词汇，更像是把前缀 pre-（“预先”）加在 forgive（“原谅”）上形成的创造性用法。常见于口语、社交媒体或幽默语境，用来表达体谅与降低压力。","语气通常友善、宽容，但也可能带一点点调侃（暗示对方“很可能会犯错”）。在正式写作中，更常用 forgive in advance / forgive me in advance。"]}
{"word":"preforgiven","summary":{"en":"“Preforgiven” means forgiven in advance—treated as already forgiven before something wrong happens.","zh":"“preforgiven”表示“预先被原谅的”，即在做错事之前就被当作已经得到原谅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"forgiven in advance; treated as already forgiven before a mistake or wrongdoing happens","zh":"预先被原谅的；在犯错或做错事之前就被当作已经得到原谅"},"examples":[{"en":"He acted as if he were preforgiven, so he never apologized.","zh":"他表现得好像自己已经被预先原谅了，所以从不道歉。"},{"en":"A healthy relationship doesn’t mean you’re preforgiven for hurting others; it means you take responsibility quickly.","zh":"健康的关系并不意味着你伤害别人也能被预先原谅，而是你会迅速承担责任。"}]}],"synonyms":["pre-forgiven","already forgiven","forgiven in advance"],"phonetic":"/priːfɔrˈɡɪvən/","extraExplanation":["“preforgiven”不是非常常见的标准词，更常见的写法是带连字符的“pre-forgiven”。在口语或写作中它常带一点批评意味：指某人觉得自己无论做什么都会被原谅，因此不认真道歉或不改正。","在宗教或神学语境里，有时也会用来讨论“先被赦免/预先赦免”的观念，但在日常英语中更多是修辞性（带态度）用法。"]}
{"word":"preforgiveness","summary":{"en":"Preforgiveness means forgiving someone in advance, before an apology or even before a mistake happens.","zh":"Preforgiveness 指在对方道歉之前、甚至在犯错之前就先选择原谅的做法或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of forgiving someone in advance (before they apologize or even before they do something wrong)","zh":"预先原谅；事先宽恕（在对方道歉之前，甚至在对方犯错之前就先选择原谅）"},"examples":[{"en":"She practiced preforgiveness so she wouldn’t carry anger into the conversation.","zh":"她练习“预先原谅”，这样就不会把愤怒带进谈话。"},{"en":"Preforgiveness can help couples handle mistakes with more patience.","zh":"“预先原谅”能帮助伴侣更有耐心地面对失误。"},{"en":"He asked for preforgiveness for being late because the trains are unreliable.","zh":"他因为火车不准点，先请求大家“预先原谅”他可能迟到。"}]}],"synonyms":["forgiveness in advance","preemptive forgiveness","anticipatory forgiveness"],"phonetic":"/ˌpriːfərˈɡɪvnəs/","extraExplanation":["“preforgiveness”不是非常常见的标准词汇，更像是由 prefix “pre-”（提前）+ “forgiveness”（原谅）拼出来的现代用语/新造词，用在自助、心理健康、关系沟通等语境里比较多。","语用上它强调一种“提前选择不记仇/不纠缠”的态度，但并不等于纵容：在很多讨论中，它会与“设定界限（boundaries）”一起出现，表示你可以先放下怨气，同时仍然清楚表达底线与后果。","更常见、较自然的表达包括：“forgive in advance”（提前原谅）或 “preemptive forgiveness”（先发制人的宽恕/提前的宽恕）。"]}
{"word":"preforgiving","summary":{"en":"Preforgiving means being ready to forgive ahead of time—choosing not to hold onto anger, often even before an apology.","zh":"Preforgiving 指“预先愿意原谅”：提前选择不执着于怨恨，常常在对方道歉之前就先放下。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) willing to forgive in advance; ready to let go of resentment before an apology or before a mistake even happens.","zh":"（指人）预先愿意原谅的；在对方道歉之前、甚至错误发生之前就准备放下怨恨的。"},"examples":[{"en":"She tries to be preforgiving with her kids, knowing they’re still learning.","zh":"她对孩子尽量保持预先原谅的态度，因为她知道他们还在学习。"},{"en":"Being preforgiving doesn’t mean you accept bad behavior; it means you choose not to carry anger.","zh":"预先原谅不代表你认可不良行为；而是你选择不背负怒气。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of forgiving ahead of time.","zh":"预先原谅（的做法）；提前选择原谅的行为。"},"examples":[{"en":"Preforgiving can reduce stress, but you still need clear boundaries.","zh":"预先原谅可以减轻压力，但你仍然需要清晰的界限。"}]}],"synonyms":["forgiving","lenient","understanding","merciful","ready to forgive"],"phonetic":"/ˌpriːfərˈɡɪvɪŋ/","extraExplanation":["“preforgiving”不是传统词典里常见的标准词，更常见于心理学/自我成长语境，表示一种“提前决定不把怨恨留在心里”的态度。","词形上可理解为前缀 pre-（预先）+ forgiving（愿意原谅的）。日常写作中也可以用更常见的表达：“willing to forgive in advance / ready to forgive.”","使用时要注意文化与人际边界：预先原谅强调情绪上的放下，但不等于纵容（enable）或取消后果（no consequences）。"]}
{"word":"preforgotten","summary":{"en":"“Preforgotten” means already-forgotten-in-advance—something treated as if it will be forgotten, often in a poetic or ironic way.","zh":"“preforgotten”指“预先就被遗忘的/注定被忘的”，多带诗意或反讽色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, often literary) Already forgotten before it really matters; treated as if it will be forgotten in advance.","zh":"（罕见，多用于文学）在真正重要之前就已经被遗忘；预先被当作“注定会被忘”的。"},"examples":[{"en":"The singer revived a preforgotten tune from the 1930s.","zh":"这位歌手让一首注定被遗忘的三十年代老曲重新被听见。"},{"en":"Their preforgotten promises faded as soon as the campaign ended.","zh":"竞选一结束，他们那些早就注定会被忘的承诺也随之淡去。"}]}],"synonyms":["long-forgotten","nearly forgotten","overlooked","forgotten","doomed to be forgotten"],"phonetic":"/ˌpriːfərˈɡɑtən/","extraExplanation":["“preforgotten”不是常见的标准词，更像是写作者临时造的词（nonce word）。它由前缀“pre-（预先）”+ “forgotten（被遗忘的）”组成，用来强调一种反讽：某事还没来得及被记住，就已经像被遗忘了一样。","常见搭配多是名词前作定语：preforgotten song/poem/story/promise（注定被忘的歌/诗/故事/承诺）。如果写作或正式场合想用更自然的表达，可以用“long-forgotten（早已被遗忘的）”“nearly forgotten（几乎被遗忘的）”“destined to be forgotten（注定会被遗忘的）”。"]}
{"word":"preform","summary":{"en":"A “preform” is a partly shaped piece (or the act of shaping it) made before the final product is formed—mainly used in manufacturing.","zh":"“preform”指制造中用于后续加工的预成型件/半成品，或“预成型”的动作，主要用于工业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Manufacturing) a piece of material that has been partly shaped so it can be formed into the final product later.","zh":"（制造业）预成型件；半成品（先做出大致形状，之后再加工成最终成品）。"},"examples":[{"en":"The factory heats the plastic preform and blows it into a bottle.","zh":"工厂把塑料预成型件加热，然后吹制成瓶子。"},{"en":"Each preform is inspected for defects before the final molding step.","zh":"每个预成型件在最终成型前都会检查是否有缺陷。"}]},{"partOfSpeech":"vt.","definition":{"en":"To shape something into a preliminary form before the final processing or assembly.","zh":"（先）预成型；把……先做成初步形状，便于后续加工或装配。"},"examples":[{"en":"They preform the metal sheets to reduce stress during final pressing.","zh":"他们先把金属板预成型，以减少最终冲压时的应力。"},{"en":"The material is preformed in a mold before it is cured.","zh":"材料会先在模具里预成型，然后再固化。"}]}],"synonyms":["preform (n.) : blank","preform (n.) : pre-shaped piece","preform (v.) : pre-shape","preform (v.) : pre-mold"],"phonetic":"/ˈpriːfɔrm/","extraExplanation":["“preform”常见于工程/制造语境（如塑料瓶胚、复合材料预成型件）。日常英语里更常见的是“perform”（表演/执行）。拼写只差一个字母，但词义和使用场景差别很大：\n- preform：预先成型（多用于工艺流程）\n- perform：表演；执行（更通用）"]}
{"word":"preformant","summary":{"en":"Preformant means “preformed; made in advance,” but it is rare and often confused with preformed or performant.","zh":"preformant 意为“预先形成/预先制备的”，但非常少见，常与 preformed 或 performant 混淆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"formed or prepared in advance; preformed (rare).","zh":"预先形成的；预先制备的（较少见）。"},"examples":[{"en":"The device uses a preformant plastic shell that is later heated into its final shape.","zh":"这个装置使用一种预先制备的塑料外壳，之后再加热成最终形状。"},{"en":"In some manufacturing steps, a preformant part helps speed up assembly.","zh":"在一些制造步骤中，预先成型的零件有助于加快装配速度。"}]}],"synonyms":["preformed","prefabricated","pre-made"],"phonetic":"/ˌpriːˈfɔrmənt/","extraExplanation":["“preformant”在现代英语里非常少见，很多时候人们其实想写的是“preformed”（预成型的）或“performant”（高性能的、表现良好的，常见于科技/工程语境）。写作或简历中建议优先用更常用、更明确的词，以免读者误解。"]}
{"word":"preformation","summary":{"en":"Preformation is mainly a historical biology term for the belief that embryos are already fully formed in miniature; it can also mean forming something in advance.","zh":"preformation主要指生物学史上的“前成说”（认为胚胎以缩小版完整形态预先存在）；也可泛指“预先形成/先行塑造”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, history of science) The old theory that an organism develops from a tiny, fully formed version of itself (a “miniature” being) already present in the egg or sperm, rather than being gradually built during development.","zh":"（生物学／科学史）前成说：一种旧理论，认为生物在卵或精子中已以“缩小版完整个体”的形式预先存在，发育只是把它长大，而不是逐步形成。"},"examples":[{"en":"In the 1700s, many scientists debated preformation versus epigenesis.","zh":"在18世纪，许多科学家争论前成说与渐成说（表观发生）孰是孰非。"},{"en":"Preformation is now rejected because embryos form structures gradually during development.","zh":"前成说如今已被否定，因为胚胎的结构是在发育过程中逐步形成的。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of forming something in advance; an earlier shaping or arrangement before the final form.","zh":"预先形成：在最终形态出现之前，先行塑造或安排的过程。"},"examples":[{"en":"The preformation of the plan made the project easier to manage later.","zh":"计划的预先成形让后续项目更容易管理。"}]}],"synonyms":["preformationism","pre-existence (theory)","prearrangement","prior formation"],"phonetic":"/ˌpriːfɔrˈmeɪʃən/","extraExplanation":["“前成说（preformationism）”在17–18世纪很有影响，常见两派：卵内预成（ovism）认为完整个体在卵中；精子动物说（animalculism）认为在精子中。随着显微观察、胚胎学与遗传学发展，科学界转向“渐成说/表观发生（epigenesis）”，强调结构在发育中逐步分化形成。","拼写上常与“preformationism（前成说）”一起出现；现代教材更多用后者来指该理论本身。"]}
{"word":"preformationary","summary":{"en":"Preformationary means “related to preformationism,” a historical theory about embryos being pre-made in miniature.","zh":"preformationary 指“与预成论有关的”，是一种关于胚胎发育的历史性理论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, historical) Relating to preformationism—the old idea that an embryo is already fully formed in miniature and only grows larger during development.","zh":"（生物学，历史用语）与“预成论”有关的；指一种旧观点：胚胎在一开始就以微型的完整形态存在，发育只是变大。"},"examples":[{"en":"In a preformationary view, the embryo is treated as a tiny version of the adult.","zh":"在预成论（preformationary）的观点里，胚胎被看作是成人的微型版本。"},{"en":"Modern embryology rejected many preformationary explanations in favor of epigenesis.","zh":"现代胚胎学否定了许多预成论式的解释，转而支持渐成论（epigenesis）。"}]}],"synonyms":["preformationist","related to preformationism","(historical) preformation-based"],"phonetic":"/ˌpriː.fɔːrˈmeɪ.ʃə.nə.ri/","extraExplanation":["“Preformationary”主要出现在科学史/哲学史语境中，而不是日常英语。更常见的相关词是 **preformation**（预成论）或 **preformationism**（预成主义/预成论学说）。","预成论在17–18世纪较有影响，后来随着显微观察、胚胎发育研究的进展，逐渐被“渐成论（epigenesis）”取代。阅读英文科学史材料时，看到它通常是在描述“当时的理论立场”，不表示现代科学观点。"]}
{"word":"preformationism","summary":{"en":"Preformationism is an old biological theory that embryos start as tiny, fully formed organisms and mainly grow larger during development.","zh":"预成论是一种早期生物学理论，认为胚胎起初就是微型完整个体，发育主要只是长大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical theory in biology that an embryo develops from a tiny, fully formed miniature organism (a “preformed” person or animal) that simply grows bigger during development, rather than forming gradually.","zh":"（生物学史上的）预成论：认为胚胎发育来自一个已完整成形的“微型个体”，发育过程主要只是变大，而不是逐步形成各器官。"},"examples":[{"en":"In the 1700s, preformationism competed with epigenesis as an explanation for how embryos develop.","zh":"在18世纪，预成论与渐成论（表成说）竞争，解释胚胎如何发育。"},{"en":"Many scientists later rejected preformationism after better microscopes and experiments supported gradual development.","zh":"后来随着显微镜改进与实验积累，更多证据支持逐步发育，许多科学家便否定了预成论。"}]}],"synonyms":["preexistence theory (in embryology)","preformism"],"phonetic":"/ˌpriːfɔːrˈmeɪʃənɪzəm/","extraExplanation":["预成论在17—18世纪较流行，常分为两派：卵内先成（ovism）与精内先成（animalculism），分别认为“微型个体”在卵子或精子里。","它与“渐成论/表成说（epigenesis）”形成对比：后者认为结构在发育过程中逐步出现。现代胚胎学与遗传学普遍支持后者的核心观点。","历史上有人用“homunculus（小人）”来形象化预成论的想法；这在今天多作为科学史与哲学讨论的例子出现。"]}
{"word":"preformationist","summary":{"en":"A preformationist is someone who believed embryos were already fully formed in miniature and development was mainly enlargement.","zh":"preformationist 指“前成论者”，认为胚胎在卵子或精子中已是微型完整个体，发育主要只是长大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in preformationism: the old idea that a fully formed miniature organism already exists in an egg or sperm and development is mainly growth in size","zh":"前成论者：相信“前成论”的人；这是一种旧观念，认为卵子或精子里已存在一个完整的微型个体，发育主要只是长大"},"examples":[{"en":"In the 1700s, some preformationists argued that embryos were already fully formed, just too small to see.","zh":"在18世纪，一些前成论者认为胚胎早已完整成形，只是小到看不见。"},{"en":"Modern biology rejected the preformationist view in favor of epigenesis and cell differentiation.","zh":"现代生物学否定了前成论者的观点，转而支持后成说与细胞分化。"}]}],"synonyms":["preformationism supporter","preformationist theorist"],"phonetic":"/ˌpriːfɔrˈmeɪʃənɪst/","extraExplanation":["“前成论（preformationism）”在17—18世纪较常见，和当时显微镜技术的发展有关。有人主张在精子或卵子中能找到“微型人”（homunculus）的想象图景。","它与“后成说（epigenesis）”相对：后成说认为个体是在发育过程中逐步形成结构与功能。今天的胚胎学与遗传学支持更接近后成说的观点。","词形上：pre-（在……之前）+ formation（形成）+ -ist（……主义者/拥护者），所以 preformationist 字面意思就是“相信事物在发育前已预先形成的人”。"]}
{"word":"preformative","summary":{"en":"Preformative describes something added at the beginning (especially a grammatical prefix) or something formed in advance.","zh":"Preformative 指位于开头的前置成分（尤指语法前缀），或指预先成形的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) describing a prefix or element added to the beginning of a word (especially a verb) to mark grammatical information such as person, tense, or mood.","zh":"（语言学）指加在词（尤其是动词）开头、用来表达语法信息（如人称、时态、语气等）的“前置成分/前加词缀”的。"},"examples":[{"en":"In Arabic, some verb forms use a preformative prefix to mark the subject.","zh":"在阿拉伯语中，有些动词形式用前置词缀来标记主语人称。"},{"en":"The grammar notes explain the preformative letters that appear before the verb stem.","zh":"语法笔记解释了出现在动词词干前的那些前置字母（前加成分）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General/technical) existing in an early, already-shaped form; formed in advance before later development.","zh":"（一般/技术用法）预先形成的；在后续发展之前就已具雏形的。"},"examples":[{"en":"Some older theories described development as following a preformative plan.","zh":"一些较早的理论把发展描述为遵循一种预先成形的蓝图。"},{"en":"The design uses preformative parts that are later assembled.","zh":"这个设计使用预先成形的部件，之后再进行组装。"}]}],"synonyms":["prefixal","prefixed","preposed","preformed"],"phonetic":"/priˈfɔrmətɪv/","extraExplanation":["在闪米特语系（如阿拉伯语、希伯来语）的语法学习中，preformative 常指“词干前的标记字母/前缀”，用来表达人称、数或时态等。例如有的教材会讲“preformative letters（前加字母）”与词干如何组合。","不要把 preformative 和 performative（施为/施事的，如 performative utterance“施为句”）混淆：两者拼写相近，但含义与领域不同。"]}
{"word":"preformed","summary":{"en":"Preformed means made or shaped in advance (often in manufacturing).","zh":"preformed 指“预先成型的/预制成形的”，常用于制造与工程语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) made, shaped, or put into its final form before it is used or before a later step in a process.","zh":"（某物）预先成型的；在使用前或后续工序前就已经做成最终形状的。"},"examples":[{"en":"The contractor used preformed concrete panels to save time on the building site.","zh":"承包商使用预制混凝土板来节省工地时间。"},{"en":"The dentist fitted a preformed crown to protect the damaged tooth.","zh":"牙医安装了预制牙冠来保护受损的牙齿。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of preform: to form or shape something in advance (especially in manufacturing).","zh":"preform 的过去式/过去分词：预先使……成型（尤指制造业）。"},"examples":[{"en":"The factory preformed the plastic parts so they could be assembled quickly later.","zh":"工厂把塑料零件预先成型，这样后续就能快速组装。"},{"en":"Once the metal was preformed, it went into the final finishing process.","zh":"金属预成型后，就进入最后的精加工工序。"}]}],"synonyms":["prefabricated","pre-shaped","ready-made","precast"],"phonetic":"/ˌpriːˈfɔrmd/","extraExplanation":["“preformed”常被误写或误读为“performed”（表演/执行）。两者发音和意思都不同：preformed=预先成型；performed=执行、表演。","在工程与制造语境中，preformed 常接 material/part/panel/crown 等名词；含义接近“prefabricated（预制的）”，但 preformed 更强调“形状先成型”。"]}
{"word":"preforming","summary":{"en":"Preform means to shape something in advance; a preform is a pre-shaped piece used to make a final product.","zh":"preform 指“预先成形”；preform（名词）指“预制坯/预成形件”，用于进一步加工成最终产品。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to shape or form something in advance, especially in manufacturing (e.g., shaping material before a final process).","zh":"（尤指制造业中）预先成形；预制成形（在最终加工前先把材料做成大致形状）。"},"examples":[{"en":"The factory preforms the plastic before it is blown into a bottle.","zh":"工厂先把塑料预制成形，然后再吹制成瓶子。"},{"en":"The metal was preformed to reduce time during final assembly.","zh":"金属先被预先成形，以减少最终装配的时间。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of material that has been shaped in advance and will be processed into a final product.","zh":"预制坯；预成形件（已先做出形状、等待进一步加工的材料/零件）。"},"examples":[{"en":"The technician loaded the preform into the machine.","zh":"技术员把预制坯装入机器中。"},{"en":"These preforms will become glass bottles after heating.","zh":"这些预制坯加热后会变成玻璃瓶。"}]}],"synonyms":["pre-shape","form in advance","mold beforehand"],"phonetic":"/priˈfɔrm/","extraExplanation":["你输入的 **preforming** 常见是把 **performing**（表演/执行）拼错了。**preform** = “预先成形（制造工艺）”；**perform** = “表演、执行（任务/工作）”。如果你想表达“正在表演/正在执行”，正确拼写通常是 **performing**。"]}
{"word":"preformism","summary":{"en":"Preformationism is an old biological theory that embryos grow from a tiny pre-made organism already present in egg or sperm.","zh":"预成论是一种早期生物学理论，认为胚胎是由卵子或精子中早已存在的“微型完整个体”长大而来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, history of science) The old theory that an embryo develops by growing from a tiny, fully formed version of the organism already present in the egg or sperm, rather than forming new structures gradually.","zh":"（生物学／科学史）“预成论”：一种早期胚胎发育理论，认为胚胎是在卵子或精子里早已存在的“微型完整个体”长大而成，而不是在发育过程中逐步形成新的结构。"},"examples":[{"en":"Preformationism suggested that a miniature human was already inside the sperm or egg.","zh":"预成论认为精子或卵子里已经有一个微型的人类。"},{"en":"Modern embryology rejected preformationism in favor of epigenesis.","zh":"现代胚胎学否定了预成论，转而支持渐成论（表成论／后成论）。"}]}],"synonyms":["preformation theory"],"phonetic":"/ˌpriːfɔːrˈmeɪʃənɪzəm/","extraExplanation":["你输入的 **preformism** 通常是 **preformationism**（预成论）的拼写误差；在学术写作中更常用完整形式。","预成论在17—18世纪较流行，常与“卵生论（ovism）/精生论（animalculism）”联系：争论“微型个体”究竟在卵里还是在精子里。","与之相对的是 **epigenesis**（渐成论／表成论／后成论），强调器官与结构在发育过程中逐步形成；这是现代发育生物学的主流观点。","词源提示：prefix **pre-**（预先）+ **formation**（形成）+ **-ism**（主义/学说），字面意思就是“预先形成的学说”。"]}
{"word":"preformist","summary":{"en":"Preformist refers to a supporter of preformationism, an old theory that organisms develop from a tiny, already fully formed version of themselves.","zh":"Preformist 指“前成论者/前成论的”，是一种旧理论的支持者：认为生物发育来自于生殖细胞中已存在的微型完整个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in preformationism (the old idea that a living thing develops from a tiny, fully formed version of itself already present in the egg or sperm)","zh":"前成论者；相信“前成论”的人（古老观点：生物在卵或精子中已存在一个微小但完整的个体，发育只是把它放大）"},"examples":[{"en":"In the 1700s, some preformists argued that a miniature human was already present in reproductive cells.","zh":"在18世纪，一些前成论者认为生殖细胞中已经存在一个微型的人。"},{"en":"Modern embryology rejects preformists’ claims in favor of evidence-based development.","zh":"现代胚胎学否定了前成论者的主张，转而依据证据解释发育过程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or supporting preformationism","zh":"与前成论有关的；支持前成论的"},"examples":[{"en":"The article describes a preformist view of how embryos develop.","zh":"这篇文章描述了一种关于胚胎如何发育的前成论观点。"},{"en":"Preformist theories were gradually replaced by epigenesis.","zh":"前成论逐渐被渐成论（后成论）取代。"}]}],"synonyms":["supporter of preformationism","preformationist"],"phonetic":"/priˈfɔrmɪst/","extraExplanation":["“preformist”主要出现在科学史/哲学史语境，尤其是早期胚胎学讨论。与之相对的概念常见为“epigenesis”（渐成论/后成论），主张个体结构是在发育过程中逐步形成的。","词形上由“pre-（预先）+ form（形成）+ -ist（……主义者/从事者）”构成，因此容易从构词法理解为“认为形态是预先形成的那一派”。","日常英语里非常少用；写作时如果面向普通读者，常改用更易懂的表达：“supporter of preformationism”（前成论的支持者）。"]}
{"word":"preformistic","summary":{"en":"“Preformistic” means connected to preformationism, an outdated theory of biological development.","zh":"“preformistic”指与“预成论”相关（现已过时的一种生物发育理论）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to preformationism (the old biological idea that an organism develops from a tiny, already fully-formed version of itself).","zh":"与“预成论”有关的（早期生物学观点：生物从一个微小但已完整成形的“迷你体”发育而来）。"},"examples":[{"en":"Some 17th-century scientists supported preformistic ideas about embryos.","zh":"一些17世纪的科学家支持关于胚胎的预成论观点。"},{"en":"Modern biology rejects most preformistic explanations of development.","zh":"现代生物学否定了大多数预成论式的发育解释。"}]}],"synonyms":["preformationist","preformationist","preformationism-related"],"phonetic":"/ˌpriːfɔːrˈmɪstɪk/","extraExplanation":["“preformistic”在现代英语里非常少见，更常见的相关词是：\n- preformationism（名词：预成论）\n- preformationist（名词/形容词：预成论者/预成论的）\n历史上，预成论常与“ovism（卵预成论）”和“animalculism（精子预成论）”等争论有关，后来被“epigenesis（渐成论/表成说）”与现代胚胎学发展所取代。","如果你本来想写的是“performative（表演性的/作秀式的）”或“perfectionistic（完美主义的）”，告诉我语境，我可以帮你选对词并对比用法。"]}
{"word":"preforms","summary":{"en":"“Preforms” usually means partially shaped pieces made before the final product (common in manufacturing, especially plastic bottles).","zh":"“Preforms”通常指制造业中的“预制坯/预成型件”（如塑料瓶坯）；也可作动词表示“预先成型”，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of) a partially shaped piece made before the final product, especially in manufacturing (e.g., a plastic tube that will be heated and blown into a bottle).","zh":"（preform 的复数）预制坯／预成型件：在最终成品完成前先做出的半成品，尤用于制造业（如加热后吹制成塑料瓶的瓶坯）。"},"examples":[{"en":"The factory stores PET preforms before turning them into water bottles.","zh":"工厂会先储存 PET 瓶坯（preforms），再把它们加工成矿泉水瓶。"},{"en":"Each preform is inspected for defects before it goes to the next step.","zh":"每个预成型件在进入下一道工序前都会检查是否有瑕疵。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) forms or shapes something in advance; makes a preliminary form before the final version.","zh":"（较少见）预先成型；先做出初步形状，再进行最终加工。"},"examples":[{"en":"The technician preforms the material to reduce stress during final shaping.","zh":"技术员先把材料预成型，以减少最终成型时的应力。"}]}],"synonyms":["preforms (manufacturing): blanks","preforms (manufacturing): preforms (PET)","preforms (verb): pre-shapes","preforms (verb): forms beforehand"],"phonetic":"/ˈpriːfɔrmz/","extraExplanation":["很多学习者会把 **preforms** 看成 **performs**（“表演；执行”）的拼写错误。两者读写很像，但意思差很多：\n- **preforms** 多用于制造业语境，指“预成型件/瓶坯”或“预先成型”。\n- **performs** 是 *perform* 的第三人称单数，意思是“表演；执行（任务）”。\n如果你想表达“他执行/表演”，应写 **performs**。"]}
{"word":"preformulate","summary":{"en":"Preformulate means to formulate something in advance, especially an idea, argument, or set of questions.","zh":"preformulate 指“预先拟定/预先表述”，尤用于观点、论证或问题等在正式场合提前成形。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to formulate in advance; to plan or express an idea, question, or statement before a later step (such as discussion, research, or writing)","zh":"预先表述；事先拟定（在讨论、研究或写作等后续步骤之前先把想法、问题或说法整理出来）"},"examples":[{"en":"Before the interview, she preformulated a few key questions.","zh":"面试前，她预先拟定了几个关键问题。"},{"en":"The team preformulated their main argument to keep the presentation focused.","zh":"团队事先整理了主要论点，以便让汇报更聚焦。"}]}],"synonyms":["formulate in advance","prepare","draft","plan out","frame"],"phonetic":"/ˌpriːˈfɔːrmjəˌleɪt/","extraExplanation":["“pre-”表示“在……之前”，“formulate”是“形成/表述（观点、计划、措辞）”。因此 preformulate 常见于学术或正式语境，强调“先把表达和结构想清楚”，而不只是“先想一想”。","在日常英语里，这个词不算特别常用，更常见的替代说法有 “plan out,” “draft,” “prepare,” “frame (a question/argument),” 或 “formulate in advance”。"]}
{"word":"preformulated","summary":{"en":"Preformulated means made or written in advance, either as a ready-made mixture (technical use) or as fixed, scripted wording (communication use).","zh":"preformulated 指“预先配制/预先拟定”的：既可指技术场景中的现成配方或预混材料，也可指交流中程式化、像照稿念的固定表述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Prepared or formulated in advance, often as a standard mixture, plan, or statement.","zh":"预先配制的；事先拟定的（常指标准混合物、方案或说法）。"},"examples":[{"en":"The lab uses preformulated solutions to save time and reduce errors.","zh":"实验室使用预先配制的溶液来节省时间并减少错误。"},{"en":"The teacher avoided giving preformulated answers and encouraged real discussion.","zh":"老师避免给出事先准备好的标准答案，鼓励真正的讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"Already expressed in a fixed, ready-made wording (often suggesting it is not original or spontaneous).","zh":"用固定措辞预先写好的；套话式的（常暗示不够原创或不够自然）。"},"examples":[{"en":"His apology sounded preformulated, like something from a script.","zh":"他的道歉听起来像预先写好的，像照着台词念。"},{"en":"Try not to rely on preformulated phrases in your essay.","zh":"写作文尽量别依赖预先准备的套话。"}]}],"synonyms":["pre-prepared","premade","ready-made","preplanned","standardized"],"phonetic":"/ˌpriˈfɔr.mjəˌleɪ.t̬ɪd/","extraExplanation":["“pre-”表示“在……之前”，“formulate”是“配方/制定/表述”。因此 preformulated 强调“提前做好、按标准准备好”。在药品、化工、食品、实验材料中常指“预配方/预混合”的产品或溶液；在写作与交流中则常带一点批评意味，指“套话、程式化表达”。"]}
{"word":"preformulating","summary":{"en":"Preformulating means creating an initial formulation in advance, before testing or revising.","zh":"preformulating 指在测试或修改之前先预先拟定、先行形成初步方案或表述。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Formulating (a plan, question, model, or wording) in advance; creating an initial version before later testing or revision.","zh":"预先拟定（计划、问题、模型或措辞）；在后续测试或修改之前先做出初步版本。"},"examples":[{"en":"We are preformulating the survey questions to avoid bias before we run the pilot test.","zh":"我们在试测之前先预先拟定问卷问题，以避免偏差。"},{"en":"The team spent a week preformulating the outline so the meeting could move faster.","zh":"团队花了一周时间预先拟定大纲，好让会议推进更快。"}]}],"synonyms":["preplan","predraft","outline","prepare","formulate in advance"],"phonetic":"/ˌpriːˈfɔːrmjəˌleɪtɪŋ/","extraExplanation":["“preformulating”是动词“preformulate”的现在分词/动名词形式，意思比普通的“formulating”更强调“提前、先行”。","该词常见于学术写作、研究设计、技术文档或项目管理语境；日常口语里更常用“drafting in advance / planning ahead / preparing”。","近义词在不同语境下可替换：pre-draft（先打草稿）、pre-plan（预先规划）、outline（拟大纲）、set up (a framework)（搭建框架）。"]}
{"word":"preformulation","summary":{"en":"Preformulation is the early drug-development work that studies a drug’s properties to guide formulation design.","zh":"Preformulation 指药物研发早期对候选药物理化性质的研究，用于指导后续制剂/处方设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Pharmaceutics) The early stage of drug development where a potential drug is studied to understand its physical and chemical properties (such as solubility, stability, and particle size) so scientists can design a safe and effective dosage form.","zh":"（药剂学）药物研发的早期阶段：研究候选药物的理化性质（如溶解度、稳定性、粒径等），以便设计安全有效的剂型。"},"examples":[{"en":"Preformulation studies showed the compound was unstable in light, so the team chose amber packaging.","zh":"预制剂研究显示该化合物遇光不稳定，因此团队选择了棕色避光包装。"},{"en":"Solubility testing is a key part of preformulation before deciding whether to make a tablet or a capsule.","zh":"在决定做片剂还是胶囊之前，溶解度测试是预制剂阶段的关键工作。"}]}],"synonyms":["preformulation studies","preformulation assessment","formulation groundwork","early formulation research"],"phonetic":"/ˌpriːˌfɔr.mjəˈleɪ.ʃən/","extraExplanation":["“Preformulation”常见于制药/生物医药语境，属于“配方前研究/预制剂研究”。目的不是“做出最终产品”，而是为后续的处方设计（formulation）提供依据，例如：选择盐型或晶型、确定pH范围、评估吸湿性、与辅料相容性等。","词形结构：pre-（在……之前）+ formulation（制剂/配方）。因此可理解为“正式制剂开发之前的准备研究”。在科研或注册资料中也可能看到“preformulation data / preformulation profile”等搭配。"]}
{"word":"prefortunate","summary":{"en":"Prefortunate means “already fortunate beforehand,” but it’s very rare in modern English.","zh":"prefortunate 指“事先就很幸运/先天占优势”，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) fortunate beforehand; already lucky or well-provided for before a particular event or time.","zh":"（罕见/古体）事先就很幸运的；在某个事件或时间之前就已处于有利、富足或幸运状态的。"},"examples":[{"en":"Compared with others, she seemed prefortunate, having savings before the crisis began.","zh":"与别人相比，她似乎是“prefortunate”的——在危机开始前就已经有存款。"},{"en":"He was prefortunate in education, with books and tutors from an early age.","zh":"他在教育资源上可谓先天幸运，从小就有书籍和家教。"}]}],"synonyms":["already fortunate","fortunate from the start","advantaged","well-provided-for","privileged"],"phonetic":"/priːˈfɔrtʃənət/","extraExplanation":["这个词很少在现代英语中使用，更常见的表达是 already fortunate / fortunate from the start / advantaged early on。","词形上由前缀 pre-（“在……之前”）+ fortunate（“幸运的”）构成，字面意思就是“预先幸运”。","如果你在文学或较古老的文本里见到它，通常是在强调某人“在关键事件发生前就已占优势/有好运”的对比效果。"]}
{"word":"prefortunately","summary":{"en":"“Prefortunately” is a very rare, nonstandard adverb, usually used jokingly to mean “before the fortunate part,” or it’s a mix-up of “fortunately/unfortunately.”","zh":"“prefortunately”非常少见且非标准，多为玩笑用法表示“在好事发生之前”，或是把“fortunately/unfortunately”混写。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard, very rare) Used humorously to mean “before the good/fortunate part happened,” i.e., earlier; previously.","zh":"（非标准用法，很少见）幽默地表示“在幸运/好事发生之前”，即“先前；之前”。"},"examples":[{"en":"Prefortunately, I saved a copy of the file before my laptop crashed.","zh":"幸好（更准确说：在幸运发生之前）我在笔记本死机前把文件备份了一份。"},{"en":"Prefortunately, we didn’t know the ending—so the twist shocked us.","zh":"在好结局揭晓之前，我们并不知道结尾，所以反转让我们很震惊。"}]},{"partOfSpeech":"other","definition":{"en":"Often a mistaken blend of fortunately/unfortunately; in standard English, use “fortunately,” “unfortunately,” “previously,” or “beforehand,” depending on what you mean.","zh":"常见于把 fortunately / unfortunately 混在一起的误写；标准英语中应根据意思用“fortunately（幸运地）”“unfortunately（不幸地）”“previously（先前）”或“beforehand（事先）”。"},"examples":[{"en":"Unclear: Prefortunately, I missed the bus.","zh":"不清楚：prefortunately 我错过了公交。"},{"en":"Better: Unfortunately, I missed the bus. / Fortunately, the next one came quickly.","zh":"更好：Unfortunately（不幸的是），我错过了公交。/ Fortunately（幸运的是），下一班很快就来了。"}]}],"synonyms":["previously","earlier","beforehand","fortunately","unfortunately"],"phonetic":"/ˌpriːˈfɔrtʃənətli/","extraExplanation":["“prefortunately”不是常见词典词，通常出现在玩笑、口误或网络文字中，用来表达一种“在事情变好之前”的时间感（pre- = “在……之前” + fortunately）。","如果你想表达“先前/之前”，最自然的是 previously / earlier / beforehand；如果你想表达“幸运地/不幸地”，则用 fortunately / unfortunately。"]}
{"word":"prefortune","summary":{"en":"“Prefortune” is an archaic word meaning one’s former fortune, especially past good luck or prosperity.","zh":"“prefortune”是古体词，指先前的运势，尤指过去的好运或兴盛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, very rare) A person’s earlier or former fortune—especially past good luck or prosperity.","zh":"（古体、极少用）先前的运势／旧日的好运或兴盛。"},"examples":[{"en":"After the war, he looked back on his prefortune and felt it had vanished overnight.","zh":"战后，他回望自己先前的好运，觉得一夜之间就消失了。"},{"en":"She could not rely on prefortune; she had to start again.","zh":"她不能再依赖旧日的好运；她必须重新开始。"}]}],"synonyms":["former fortune","previous fortune","past prosperity","old good luck"],"phonetic":"/ˌpriːˈfɔrtʃən/","extraExplanation":["“prefortune”由前缀 pre-（“在……之前、先前的”）+ fortune（“运气；命运；财富”）构成，属于早期英语里较自由的造词方式。现代英语中几乎不用，阅读旧文学或古文时偶尔会见到。","如果你是在现代文章里看到它，有可能是拼写或断词问题（例如把“pre-fortune / pre fortune”写连了），或原意想表达“previous fortune / former fortune（先前的好运/境况）”。"]}
{"word":"prefoundation","summary":{"en":"Prefoundation means “before the foundation stage,” especially a preparatory course before a foundation program (common in UK education).","zh":"Prefoundation 指“在预科/基础阶段之前”，尤其指进入预科课程前的衔接准备课程（常见于英国教育语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Education, especially in the UK) done before a “foundation” level program; a preparatory stage or course that comes before the main foundation course.","zh":"（教育用语，尤指英国）在“基础课程/预科（foundation）”之前的阶段或课程；为进入预科做准备的衔接课程。"},"examples":[{"en":"She enrolled in a prefoundation English course before starting the foundation year.","zh":"她在开始预科（foundation year）之前报名了一个 prefoundation 英语衔接课程。"},{"en":"The university offers prefoundation support for students who need extra academic skills.","zh":"这所大学为需要额外学术技能的学生提供 prefoundation 支持。"}]},{"partOfSpeech":"adj.","definition":{"en":"Before the founding or establishment of something; happening earlier than an organization, system, or institution was created.","zh":"在某事物成立/建立之前的；发生在组织、制度或机构创建之前的。"},"examples":[{"en":"These letters come from the prefoundation period of the charity.","zh":"这些信件来自该慈善机构成立之前的时期。"},{"en":"Prefoundation research helped shape the final design.","zh":"建立前的研究帮助塑造了最终设计。"}]},{"partOfSpeech":"n.","definition":{"en":"A prefoundation course or stage (used as a noun, less common).","zh":"prefoundation 课程/阶段（作名词用法，较少见）。"},"examples":[{"en":"He completed a prefoundation and then progressed to the foundation program.","zh":"他完成了 prefoundation 衔接课程，然后升入预科课程。"}]}],"synonyms":["pre-foundation","preparatory","preliminary","bridging"],"phonetic":"ˌpriːfaʊnˈdeɪʃən","extraExplanation":["这个词在日常英语里不算常见，更常见的写法是带连字符的 **pre-foundation**，或直接说 **pre-foundation course/program**。在英国高校语境中，**foundation year** 通常指为进入本科做准备的预科年；**prefoundation** 则是更早一步的语言/学术能力衔接阶段。","读写时注意不要和 **foundation**（基金会/基础/粉底）混淆：这里的 foundation 多指“预科/基础阶段”。"]}
{"word":"prefounder","summary":{"en":"A rare word meaning an earlier/original founder of something.","zh":"一个较少见的词，指某事物的更早／最初的创立者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who founded something earlier than others; an earlier or original founder (rare).","zh":"比他人更早创立某事的人；先创立者／早期创办者（较少见的用法）。"},"examples":[{"en":"In local history books, she is remembered as a prefounder of the town’s first school.","zh":"在地方史书中，她被记载为该镇第一所学校的早期创办者。"},{"en":"The museum honored several prefounders who helped shape the community before it officially became a city.","zh":"博物馆表彰了几位在该社区正式建市之前就参与塑造它的先创立者。"}]}],"synonyms":["founder","originator","pioneer","forerunner","co-founder"],"phonetic":"/priˈfaʊndər/","extraExplanation":["“prefounder”在现代英语里非常少见，很多情况下人们更常用“founder（创始人）”“co-founder（联合创始人）”“early founder（早期创始人）”或“pioneer（开拓者）”。","构词上可理解为“pre-（在……之前）+ founder（创始人）”，意思是“更早的创始人/先驱式的创办者”。但在正式写作中，若担心读者不熟悉这个词，建议改用更常见的表达。"]}
{"word":"prefract","summary":{"en":"“Prefract” isn’t standard English; it’s likely a typo (often for “refract” or a word meaning “come before”).","zh":"“prefract”不是标准英语词；很可能是拼写错误（常见是想写“refract 折射”或表示“在……之前”的词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or a rare/nontechnical coinage. In normal writing, you should use a different word (often “refract” or “preface,” depending on your meaning).","zh":"不是标准英语单词；多为拼写错误或极少见的自造词。正式写作中通常应改用其他词（常见可能是“refract 折射”或“preface/precede 作为前言/在……之前”，取决于你想表达的意思）。"},"examples":[{"en":"I can’t find “prefract” in a dictionary—did you mean “refract” (light bends through glass)?","zh":"我在词典里找不到“prefract”——你是不是想写“refract”（光穿过玻璃会发生折射）？"},{"en":"If you meant “before,” you might want “precede,” not “prefract.”","zh":"如果你想表达“在……之前”，可能该用“precede”，而不是“prefract”。"}]}],"phonetic":"/priˈfrækt/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。“refract”是常用词，表示“（光）折射”。很多学习者会把不熟悉的拼写混在一起，形成类似“prefract”的拼写。","如果你能提供一句包含“prefract”的原句（或你想表达的中文意思），我可以帮你精准判断你要的词，并给出更地道的替换。"]}
{"word":"prefragrance","summary":{"en":"“Prefragrance” usually means a preparatory scent used before the main fragrance, or a faint first hint of smell. It’s uncommon in everyday English.","zh":"“prefragrance”通常指在主要香水前使用的打底/前置香味，或更强烈气味出现前的一丝淡味；日常英语中并不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scent (or scented product) that is used before the main fragrance, often as a preparatory or “first layer” smell (not a very common standard word; more often written as “pre-fragrance” or described as “a base/prep scent”).","zh":"在主要香水之前使用的气味（或带香味的产品），常用来“打底/预先铺垫”的前置香味（不是很常见的标准词，更常写作“pre-fragrance”，或用“打底香/准备香味”等说法表达）。"},"examples":[{"en":"Some brands recommend a lightly scented body lotion as a pre-fragrance so the perfume lasts longer.","zh":"有些品牌会建议先用带淡香的身体乳做 pre-fragrance，让香水更持久。"},{"en":"The soap leaves a clean pre-fragrance that changes once you apply the perfume.","zh":"这款香皂会留下干净的前置香味，上了香水后气味会再变化。"}]},{"partOfSpeech":"n.","definition":{"en":"The first, faint smell you notice before a stronger scent appears (rare; in everyday English people usually say “a hint of scent” or “a faint smell”).","zh":"在更强烈气味出现前，先闻到的那一点点淡味（较少见；日常英语更常说“a hint of scent / a faint smell”）。"},"examples":[{"en":"There was a prefragrance of smoke in the hallway, and then the fire alarm went off.","zh":"走廊里先有一丝烟味，接着火警警报就响了。"},{"en":"I caught a prefragrance of citrus before the drink even touched my lips.","zh":"饮料还没碰到嘴唇，我就先闻到一丝柑橘香。"}]}],"synonyms":["pre-fragrance","prep scent","base-layer scent","a hint of scent","faint smell"],"phonetic":"ˌpriːˈfreɪɡrəns","extraExplanation":["“prefragrance”不是高频词，常见写法是带连字符的“pre-fragrance”。在香水/香氛语境中，更常见的表达包括：“base layer scent（打底香）”“primer（打底/妆前概念借用）”“scented lotion as a base（用香体乳打底）”。","如果你是在产品成分或行业资料里看到它，它可能是品牌或供应链内部用语，意思接近“前置香调/铺垫香”，但严格来说香水更常用“top/middle/base notes（前调/中调/后调）”来描述香调结构。"]}
{"word":"prefragrant","summary":{"en":"Prefragrant is a rare, literary word meaning very pleasantly fragrant.","zh":"prefragrant 是一个罕见的文学用词，意思是“非常芬芳、香气怡人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) pleasantly smelling; sweet-scented; very fragrant.","zh":"（罕见／文学用语）芳香的；香气怡人的；非常芬芳的。"},"examples":[{"en":"In the garden, prefragrant roses filled the air with a soft sweetness.","zh":"花园里芬芳的玫瑰让空气充满了柔和的甜香。"},{"en":"She opened the box, and a prefragrant scent of lavender drifted out.","zh":"她打开盒子，一阵薰衣草的芬芳飘了出来。"}]}],"synonyms":["fragrant","sweet-smelling","aromatic","perfumed","scented"],"phonetic":"/priˈfreɪɡrənt/","extraExplanation":["“prefragrant”在现代英语里非常少见，多见于较早期或刻意文雅的写作中。日常表达更常用“fragrant”“sweet-smelling”“aromatic”。","词形上可理解为“pre-（加强语气）+ fragrant（芬芳的）”，整体有“格外芬芳、香气更浓”的文学色彩。"]}
{"word":"prefrank","summary":{"en":"Prefrank means to prepare mail in advance so it can be sent without adding stamps later; it can also describe mail that is already prepared this way.","zh":"prefrank 指把邮件预先处理为无需再贴邮票即可寄出；也可形容已这样处理过的信封或邮件。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stamp or mark mail in advance so it can be sent without adding postage later (often using a printed permit or official “frank”)","zh":"（在寄出前）预先加盖免邮资标记；预付邮资/预印邮资标记"},"examples":[{"en":"The company prefranked the envelopes to speed up its monthly mailing.","zh":"这家公司把信封预先加盖免邮资标记，以加快每月寄送。"},{"en":"These letters were prefranked, so the staff didn’t need to buy stamps.","zh":"这些信件已经预先处理成免贴邮票，所以员工不需要再买邮票。"}]},{"partOfSpeech":"adj.","definition":{"en":"already marked in advance so it can be mailed without adding postage","zh":"（信封/邮件）已预先印好邮资或免邮资标记的"},"examples":[{"en":"Please use the prefrank envelope for returns.","zh":"退货请使用这只已预先印好邮资的信封。"},{"en":"We received a prefrank postcard from the organization.","zh":"我们收到该机构寄来的一张已预先处理邮资的明信片。"}]}],"synonyms":["prepay (postage)","stamp (in advance)","frank"],"phonetic":"/ˌpriːˈfræŋk/","extraExplanation":["“frank”在邮政语境里指“免邮资特权/免邮资签章”（常见于政府或官方机构）。因此“prefrank”多用于商业或机构批量寄送：提前用印刷的许可标识（permit imprint）或类似方式处理邮资，让后续投递更省时。","现代英语里更常见的相关说法包括：“prepaid envelope（预付邮资信封）”“postage-paid envelope（邮资已付信封）”“business reply mail（商业回邮）”。“prefrank”相对偏书面或专业邮政用语。"]}
{"word":"prefranked","summary":{"en":"Prefranked means postage is already paid and shown on the mail item.","zh":"prefranked 指邮件已预先付邮资并在邮件上标示出来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already stamped or printed with postage in advance, so it can be mailed without adding stamps (often used for envelopes, postcards, or labels).","zh":"已预先付邮资的；（信封、明信片、标签等）上面已印好或贴好邮资，无需再贴邮票即可寄出。"},"examples":[{"en":"Please return the form in the prefranked envelope.","zh":"请把表格放进已预付邮资的回邮信封寄回。"},{"en":"The company sent prefranked postcards for customers to reply easily.","zh":"公司寄了预付邮资的明信片，方便顾客回覆。"}]}],"synonyms":["postage-paid","prepaid","pre-stamped"],"phonetic":"/ˌpriːˈfræŋkt/","extraExplanation":["“Prefranked”常见于商业邮件、回邮信封（reply envelope）或批量寄送材料中，强调邮资已由寄件方预付，收件人寄回时不需要自己买邮票。","在美国语境里，它通常指信封/卡片上已印有邮资标记（如许可邮资 indicia），不一定是传统的贴邮票。"]}
{"word":"prefranking","summary":{"en":"Prefranking means postage is paid in advance, often shown by a printed postage mark on mail.","zh":"prefranking 指预先支付邮资，常通过在邮件上印刷“邮资已付”的标记来体现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or system of paying postage in advance, often by printing a postage mark (instead of using a physical stamp) on envelopes or mail pieces","zh":"预付邮资；（常指）用印刷邮资标记代替贴邮票的预付方式"},"examples":[{"en":"The company uses prefranking to mail thousands of bills efficiently.","zh":"这家公司用预付邮资方式寄出成千上万份账单，以提高效率。"},{"en":"Prefranking reduces the time staff spend sticking stamps on each envelope.","zh":"预付邮资减少了员工逐一贴邮票所花的时间。"}]},{"partOfSpeech":"n.","definition":{"en":"a printed postage marking on mail showing that postage has been prepaid","zh":"（信封上的）预付邮资印记；邮资已付标记"},"examples":[{"en":"Look for the prefranking in the top-right corner of the envelope.","zh":"看看信封右上角的预付邮资印记。"},{"en":"The postcard had prefranking, so no stamp was needed.","zh":"这张明信片已经印有预付邮资标记，所以不需要再贴邮票。"}]}],"synonyms":["prepaid postage","postage paid (mark)","franking (in mailing context)"],"phonetic":"/priˈfræŋkɪŋ/","extraExplanation":["“pre-”表示“预先”，而“frank/franking”在邮政语境里与“付邮资、免邮资（官方签署免邮）或加盖邮资标记”有关。prefranking常见于企业批量寄送（账单、广告信、通知），通过邮资机或印刷方式一次性处理，省时省力。","在不同国家/地区，类似做法可能出现在“business reply mail（商业回邮信件）”“postage paid（邮资已付）”等标记中；具体规则取决于当地邮政系统。"]}
{"word":"prefrankness","summary":{"en":"Prefrankness means the condition of having postage paid in advance (usually shown by a printed postage mark).","zh":"prefrankness 指“邮资已预先支付”的状态（通常以印刷邮资标记体现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being prefranked (having postage paid in advance, especially shown by a printed marking on an envelope or label)","zh":"预付邮资状态；（尤指信封或标签上用印刷标记表示的）预付邮资的情况"},"examples":[{"en":"The company uses prefrankness on its bulk mail to speed up processing.","zh":"这家公司在大量邮件上采用预付邮资标记，以加快处理速度。"},{"en":"Look for the prefrankness mark in the top-right corner before you drop it in the mailbox.","zh":"投进邮筒前，先看看右上角有没有预付邮资标记。"}]}],"synonyms":["postage-paid status","prepaid postage","prefranked status"],"phonetic":"/ˌpriˈfræŋknəs/","extraExplanation":["“prefrankness”并不是日常英语中的常用词，更常见的表达是 **prefranked**（已预付邮资的）或 **postage-paid**（邮资已付）。它属于由 **prefrank + -ness** 临时构成的名词，用来指“预付邮资这一属性/状态”。","在邮政与集邮语境里，**prefranked mail** 通常指带有印刷邮资戳记（postage indicia/permit imprint）的信封或标签，常用于广告信、账单等批量邮寄。"]}
{"word":"prefranks","summary":{"en":"Prefranks are letters/envelopes with postage printed in advance; to prefrank means to prepay and print the postage before mailing.","zh":"prefranks指预印（预付）邮资的信件/信封；to prefrank指在寄出前预先付邮资并印上邮资标记。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to print or mark postage on a letter or package in advance (so it is already paid when mailed)","zh":"预先付邮资并在邮件上预印/标注邮资（寄出前就已付费）"},"examples":[{"en":"The company prefranks thousands of envelopes every week to save time.","zh":"这家公司每周预印成千上万只信封的邮资，以节省时间。"},{"en":"These forms are prefranked, so you can mail them without adding a stamp.","zh":"这些表格已经预付并标注邮资，所以不用再贴邮票就能寄出。"}]},{"partOfSpeech":"n.","definition":{"en":"a mail piece (such as an envelope) with postage printed on it in advance; also used for prefranked mail in general","zh":"预印邮资的邮件（如信封）；也可泛指“预付邮资邮件”"},"examples":[{"en":"Please return the documents in the prefrank included in the packet.","zh":"请把文件放入包裹里附带的预印邮资回邮信封寄回。"},{"en":"The office keeps a box of prefranks for customer returns.","zh":"办公室备有一箱预印邮资信封，供客户退件使用。"}]}],"synonyms":["prepay (postage)","postage-paid","prefranked (mail)","frank (mail)"],"phonetic":"/priˈfræŋk/","extraExplanation":["“prefrank”常见于邮政与商业寄递语境，尤其是批量寄信（账单、广告、回邮信封等）。它和“prepaid postage / postage paid”意思接近；在信封或标签上常能看到类似“POSTAGE PAID”的印记（indicia），这类就属于prefranked mail。","你输入的“prefranks”通常是复数名词（多份预印邮资邮件/信封），也可能是动词第三人称单数（He/She prefranks…）。"]}
{"word":"prefraternal","summary":{"en":"“Prefraternal” is a rare adjective meaning “before a brother-like (fraternal) bond exists.”","zh":"“prefraternal”是个很少见的形容词，意思是“在兄弟般情谊（fraternal）形成之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) Happening or existing before a fraternal relationship (a brother-like bond) is formed; before someone becomes “fraternal.”","zh":"（罕见、非标准用法）指在“兄弟般的／同伴式的（fraternal）关系”形成之前发生或存在的；在变得“如兄弟般亲近”之前的。"},"examples":[{"en":"Their prefraternal conversations were polite but distant, before they started calling each other brothers.","zh":"他们在建立兄弟般情谊之前的谈话礼貌却疏远，后来才开始互称兄弟。"},{"en":"The novel focuses on the prefraternal stage of the team, when trust still had to be earned.","zh":"这部小说聚焦团队尚未产生“兄弟情”之前的阶段，那时信任仍需要争取。"}]}],"synonyms":["early","prior","before the bond formed","pre-bond","initial"],"phonetic":"/priˌfrætɚnəl/","extraExplanation":["这个词在现代英语里非常少见，很多词典不收录，写作中也不常用。通常人们会用更自然的表达来替代，例如：before they became close / before the bond formed / in the early days of their friendship。","也可能是拼写误差：常见的相近词有 prefrontal（前额叶的）或 fraternal（兄弟般的/同伴式的）。如果你告诉我出现的句子语境，我可以帮你判断原意更可能是哪一个。"]}
{"word":"prefraternally","summary":{"en":"“Prefraternally” means “before a fraternity/brotherly bond exists or is formed.”","zh":"“prefraternally”表示“在兄弟会／兄弟情谊形成之前（先前）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"before a fraternal (brotherly) relationship, bond, or organization exists or is formed; beforehand in relation to fraternity/brotherhood","zh":"在兄弟情谊／兄弟会（友爱关系或组织）形成之前；就“兄弟般关系”而言在此前"},"examples":[{"en":"They had known each other prefraternally, before the club turned their friendship into a formal brotherhood.","zh":"他们在加入俱乐部之前就认识了；在组织把友谊变成正式的“兄弟情谊”之前，他们就已相识。"},{"en":"Prefraternally, the group was just a few classmates who studied together.","zh":"在形成“兄弟会式”的团体之前，这群人只是一起学习的几个同学。"}]}],"synonyms":["beforehand","previously","prior to forming a brotherhood","before joining the fraternity"],"phonetic":"/ˌpriːfrəˈtɝːnəli/","extraExplanation":["这是一个非常少见的词，多用于特定语境的“造词/书面用法”。构词法为 pre-（在……之前）+ fraternal（兄弟般的；兄弟会的）+ -ly（副词后缀）。","常见、更自然的表达通常是：before joining the fraternity（加入兄弟会之前）、before the brotherhood formed（在情谊/组织形成之前）、previously（先前）。"]}
{"word":"prefraud","summary":{"en":"“Pre-fraud” (often hyphenated) means “before fraud happens,” especially in early fraud prevention/detection contexts.","zh":"“Pre-fraud”（常写作带连字符的“pre-fraud”）表示“欺诈发生之前”，多用于提前预防/识别欺诈的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon; usually written “pre-fraud”.) Happening or existing before a fraudulent act occurs; aimed at preventing or detecting fraud early.","zh":"（不常见，通常写作“pre-fraud”。）发生在欺诈行为之前的；用于提前预防或及早识别欺诈的。"},"examples":[{"en":"The bank uses pre-fraud alerts to warn customers about suspicious transactions.","zh":"银行使用“预欺诈”提醒来警告客户可疑交易。"},{"en":"Pre-fraud controls can stop scammers before money is transferred.","zh":"预欺诈控制措施可以在资金转出前阻止骗子。"}]},{"partOfSpeech":"n.","definition":{"en":"A stage, period, or set of actions before fraud happens (used mainly in technical or business writing).","zh":"欺诈发生之前的阶段、时期或一系列措施（多见于技术或商业写作）。"},"examples":[{"en":"Our system focuses on pre-fraud rather than post-fraud recovery.","zh":"我们的系统侧重于预欺诈，而不是事后追回。"},{"en":"The report compares pre-fraud screening with post-fraud investigation.","zh":"该报告比较了预欺诈筛查与事后欺诈调查。"}]}],"synonyms":["preemptive (anti-fraud)","preventive","early-warning","before-the-fact"],"phonetic":"/priˈfrɔd/","extraExplanation":["“prefraud”不是日常英语里的常用单词，更常见的写法是加连字符的“pre-fraud”。在金融风控、支付、保险反欺诈、数据科学/机器学习语境中更容易见到。","写作建议：如果你是在正式文件或论文里使用，优先写“pre-fraud detection / pre-fraud screening / pre-fraud controls”，读者更容易理解。"]}
{"word":"prefreeze","summary":{"en":"“Prefreeze” means to freeze something beforehand, often as part of food processing.","zh":"“prefreeze”指把东西提前冷冻，常用于食品加工等流程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to freeze something in advance, before the next step in a process (especially in food preparation or manufacturing)","zh":"预先冷冻；提前冻结（常用于食品处理或工业流程中）"},"examples":[{"en":"Some berries are prefreeze-dried to preserve flavor and color.","zh":"有些浆果会先预冻再进行冻干，以保留风味和颜色。"},{"en":"We prefreezed the fish at the factory to keep it fresh during shipping.","zh":"我们在工厂先把鱼预先冷冻，以便运输途中保持新鲜。"}]}],"synonyms":["freeze in advance","freeze ahead of time","pre-chill (similar idea, not always fully freeze)"],"phonetic":"/ˌpriːˈfriːz/","extraExplanation":["“prefreeze”常见于食品工业与冷链/加工语境，例如“prefreeze before freeze-drying（冻干前预冻）”。在日常口语中更常说“freeze ahead of time / freeze in advance（提前冷冻）”。"]}
{"word":"prefreezes","summary":{"en":"“Prefreezes” means “freezes something in advance.”","zh":"“prefreezes”表示“把某物提前冷冻（预先冷冻）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to freeze something in advance (before storage, shipping, cooking, or a later processing step)","zh":"预先冷冻；提前把某物冷冻起来（用于储存、运输、烹饪或后续加工前）"},"examples":[{"en":"The factory prefreezes the berries before packaging them.","zh":"工厂在包装前先把浆果预先冷冻。"},{"en":"If you prefreeze the ice packs overnight, they’ll stay cold longer in the cooler.","zh":"如果你把冰袋提前一晚冷冻好，它们在保冷箱里会更持久。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the process or stage of freezing something ahead of time","zh":"（较少见）预冷冻步骤；预先冷冻过程"},"examples":[{"en":"Prefreeze is recommended to reduce sticking during processing.","zh":"建议进行预冷冻，以减少加工时的粘连。"}]}],"synonyms":["freeze in advance","freeze ahead of time","pre-chill (similar idea, usually cooling not freezing)"],"phonetic":"/ˌpriːˈfriːz/","extraExplanation":["“prefreezes”通常是动词“prefreeze”的第三人称单数（He/She/It prefreezes...），常见于食品加工、冷链运输、实验室样本保存（如生物样本冷冻保存）等语境。","拼写构词：pre-（在……之前）+ freeze（冷冻）。日常英语中也常用更口语的说法：“freeze ahead of time / freeze in advance”。"]}
{"word":"prefreezing","summary":{"en":"“Prefreezing” means freezing something ahead of time as a preparation step.","zh":"“prefreezing”指为后续步骤做准备而提前冷冻/预冻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freezing something before a later step (such as storage, shipping, or cooking)","zh":"（为后续步骤如保存、运输或烹饪而）预先冷冻；预冻（的过程）"},"examples":[{"en":"Prefreezing berries on a tray keeps them from sticking together in the bag.","zh":"把浆果先铺在托盘上预冻，可以防止装袋后黏成一团。"},{"en":"The recipe suggests prefreezing the dough for 20 minutes so it’s easier to cut.","zh":"食谱建议把面团先预冻20分钟，这样更容易切割。"}]},{"partOfSpeech":"adj.","definition":{"en":"done or happening before freezing; chilled or partially frozen in advance","zh":"在冷冻之前完成的；事先冷却/预冻的"},"examples":[{"en":"Use a prefreezing step to firm up the filling before you wrap the dumplings.","zh":"包饺子前先进行预冻步骤，让馅料变硬一些。"},{"en":"Prefreezing temperatures can damage some plants if the cold arrives suddenly.","zh":"突然来临的预冻温度可能会伤害某些植物。"}]},{"partOfSpeech":"v.","definition":{"en":"freezing something ahead of time (often used as a gerund form)","zh":"提前把……冷冻（常作动名词用）"},"examples":[{"en":"Prefreezing helps preserve texture in some fruits and vegetables.","zh":"预先冷冻有助于保留某些果蔬的口感。"},{"en":"They recommend prefreezing the ice packs overnight before the trip.","zh":"他们建议出发前把冰袋提前冷冻一整夜。"}]}],"synonyms":["pre-freezing","freezing ahead of time","pre-chilling"],"phonetic":"/priˈfriːzɪŋ/","extraExplanation":["“prefreezing”更常见的写法是带连字符的“pre-freezing”，尤其在说明书、食品加工和实验步骤中。日常表达里也可以说“freeze (something) first / freeze it ahead of time”。"]}
{"word":"prefreshman","summary":{"en":"“Prefreshman” refers to the time, program, or student before freshman year begins.","zh":"“prefreshman”指大学一年级开始之前的阶段/项目，或指尚未入学的一年级准新生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in schools/colleges) relating to the period or program before a student begins freshman year","zh":"（学校/大学）与入学一年级（freshman year）之前的阶段或预科/衔接项目有关的"},"examples":[{"en":"She attended a prefreshman summer program to improve her study skills.","zh":"她参加了入学前的暑期衔接项目来提升学习技能。"},{"en":"The university offers prefreshman orientation for first-generation students.","zh":"这所大学为第一代大学生提供入学前的新生说明会。"}]},{"partOfSpeech":"n.","definition":{"en":"a student who has been admitted but has not yet started freshman year","zh":"（已被录取但尚未开始一年级的）准新生"},"examples":[{"en":"As a prefreshman, he joined online advising sessions in July.","zh":"作为准新生，他在七月参加了线上学业咨询。"},{"en":"Prefreshmen can register for placement tests before classes begin.","zh":"准新生可以在开课前报名参加分班测试。"}]}],"synonyms":["incoming freshman","pre-frosh","new student (before matriculation)"],"phonetic":"/ˌpriːˈfrɛʃmən/","extraExplanation":["这个词主要见于美国教育语境，尤其是大学的“prefreshman summer program（入学前暑期衔接项目）”。目的常是帮助学生适应大学学习（写作、数学、时间管理等），或为弱势群体/第一代大学生提供支持。","构词法：pre-（在……之前）+ freshman（大学一年级新生）。日常更常见的说法包括 “incoming freshman（即将入学的新生）” 或 “pre-frosh（非正式）”。"]}
{"word":"prefreshmen","summary":{"en":"“Prefreshman” means an incoming college freshman—admitted but not yet started the first year—and can also describe pre-freshman programs or events.","zh":"“Prefreshman”指已录取但尚未开始大一的准大学新生，也可形容大一前的相关项目或活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A student who has been admitted to a college or university but has not started the first year (freshman year) yet; an incoming first-year student.","zh":"已被大学录取但尚未开始大一（freshman year）的学生；准大一新生。"},"examples":[{"en":"The university offers a summer bridge program for prefreshmen.","zh":"这所大学为准大一新生提供暑期衔接课程。"},{"en":"As a prefreshman, she joined online orientation sessions before moving to campus.","zh":"作为准大一新生，她在搬进校园前参加了线上新生说明会。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the period or activities before a student begins the first year of college (freshman year).","zh":"与开始大一之前的阶段或活动有关的；大一前的。"},"examples":[{"en":"He attended a prefreshman orientation to learn about course registration.","zh":"他参加了大一前的新生说明会，了解如何选课注册。"}]}],"synonyms":["incoming freshman","incoming first-year student","pre-freshman (hyphenated form)"],"phonetic":"/priˈfrɛʃmən/","extraExplanation":["“prefreshman”常见于美国高校语境，有时也写作“pre-freshman”。通常指已经拿到录取、还没正式入学的“incoming freshman”。不同学校用词不一：有的更常说“incoming first-year student”。","注意：在美国，“freshman”也可指高中/大学的一年级学生；但“prefreshman”一般特指“入学前的大学新生阶段”（如夏季衔接课程、选课指导、宿舍安排等）。"]}
{"word":"prefriendly","summary":{"en":"“Prefriendly” is an informal adjective meaning friendly in advance or beforehand (often written pre-friendly).","zh":"“prefriendly”多为非正式形容词，表示“事先/提前就很友好（常写作 pre-friendly）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Friendly or welcoming in advance; showing friendliness before meeting or before something happens (often used informally, sometimes written with a hyphen: pre-friendly).","zh":"预先友好的；事先表现得友善/热情的（多为非正式用法，也常写作 pre-friendly）。"},"examples":[{"en":"The host sent a pre-friendly message to make everyone feel comfortable before the event.","zh":"主持人在活动前发了一条预先友好的信息，让大家更放松。"},{"en":"Some companies create a pre-friendly onboarding email for new employees.","zh":"有些公司会给新员工准备一封“预先友好”的入职欢迎邮件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable for something before it is ready for public use or before it becomes common (rare; usually expressed differently in natural English).","zh":"在尚未正式推出/普及之前就“适合/友好”的（较少见；英语里通常会换一种更自然的说法）。"},"examples":[{"en":"This design is not very pre-friendly for beginners; it needs clearer instructions.","zh":"这个设计对新手来说还不够“预先友好”；需要更清晰的说明。"}]}],"synonyms":["friendly in advance","welcoming beforehand","approachable","cordial"],"phonetic":"/ˌpriːˈfrɛndli/","extraExplanation":["“prefriendly”不是非常标准或常见的词，更常见写法是“pre-friendly”，或直接说“friendly beforehand / friendly in advance”。","如果你想表达“对用户友好”，英语更自然的表达通常是“user-friendly”。如果是“对初学者友好”，常用“beginner-friendly”。"]}
{"word":"prefriendship","summary":{"en":"“Prefriendship” is a rare, informal word meaning the time before two people become friends.","zh":"“prefriendship”是少见的非正式用法，指两个人成为朋友之前的那段时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Informal) The stage or period before two people become friends; the time when they are not yet friends but may be getting to know each other.","zh":"（少见/非正式）成为朋友之前的阶段或时期；两个人还不是朋友、但可能正在认识彼此的那段时间。"},"examples":[{"en":"In our prefriendship, we only talked about homework and never about our lives.","zh":"在我们成为朋友之前，我们只聊作业，从不聊生活。"},{"en":"Looking back at the prefriendship days, I was too shy to start a conversation.","zh":"回想还没成为朋友的那些日子，我太害羞，不敢主动搭话。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/Creative use) Before friendship exists; describing something that happens prior to a friendship forming.","zh":"（少见/创意用法）友谊形成之前的；形容在友谊建立前发生的事。"},"examples":[{"en":"They kept their prefriendship messages polite and formal.","zh":"在成为朋友之前，他们的聊天信息一直很客气、很正式。"}]}],"synonyms":["before we became friends","early days","when we first met","getting-to-know-you stage"],"phonetic":"/priːˈfrɛndʃɪp/","extraExplanation":["“prefriendship”不是常见词，更像是把前缀 pre-（“在……之前”）加在 friendship 上的临时造词，常见于社交媒体、随笔或口语化写作，用来强调“还没变熟”的那段暧昧/试探期。","更自然的表达通常是：“before we became friends / before our friendship started / when we first met / early on”。如果写作需要正式一些，建议用这些替代表达。"]}
{"word":"prefright","summary":{"en":"Preflight means “before a flight,” especially the checks and preparation done before takeoff.","zh":"preflight 指“飞行前的”，尤其是起飞前的检查与准备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or done before a flight (especially checks and preparation).","zh":"（尤指检查与准备）在飞行前进行的；飞行前的。"},"examples":[{"en":"The pilot completed a preflight check before takeoff.","zh":"飞行员在起飞前完成了飞行前检查。"},{"en":"Please attend the preflight safety briefing.","zh":"请参加飞行前安全讲解。"}]},{"partOfSpeech":"n.","definition":{"en":"a set of inspections and preparations done before a flight.","zh":"飞行前检查与准备（的一套流程）。"},"examples":[{"en":"Preflight is required for every trip, even short ones.","zh":"每次出行都必须做飞行前检查，即使是短途。"},{"en":"The checklist helps you finish preflight in the correct order.","zh":"清单能帮助你按正确顺序完成飞行前检查。"}]},{"partOfSpeech":"v.","definition":{"en":"to inspect and prepare an aircraft (or flight plan) before flying.","zh":"在飞行前检查并准备（飞机或飞行计划）。"},"examples":[{"en":"The crew preflighted the aircraft in under twenty minutes.","zh":"机组在二十分钟内完成了飞机的飞行前检查。"},{"en":"He always preflights carefully because weather can change fast.","zh":"他总是认真做飞行前检查，因为天气变化很快。"}]}],"synonyms":["pre-flight","before takeoff","predeparture"],"phonetic":"/ˈpriˌflaɪt/","extraExplanation":["你输入的“prefright”很可能是拼写错误；常见正确形式是 **preflight** 或 **pre-flight**。","在航空与无人机（drone）语境中更常用 **preflight check / preflight inspection**（飞行前检查）。在软件/网页里，**preflight** 也可指“发布/印前检查”（例如检查文件是否符合要求）。"]}
{"word":"prefrighten","summary":{"en":"“Prefrighten” means to frighten someone (or feel frightened) beforehand, usually in a playful or informal way.","zh":"“prefrighten”指“提前吓唬/提前害怕”，多为非正式或带玩笑意味的说法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to frighten someone in advance; to make someone feel afraid before something happens (often used humorously or informally).","zh":"事先吓唬（某人）；在事情发生前就让人感到害怕（常带幽默或口语色彩）。"},"examples":[{"en":"Don’t prefrighten the kids with scary stories before the trip.","zh":"别在出发前讲恐怖故事先把孩子们吓到。"},{"en":"The warning signs prefrightened me more than the movie itself.","zh":"这些警告标语比电影本身更让我提前害怕。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become frightened in advance; to get nervous or scared ahead of time (rare; usually phrased as “get scared beforehand”).","zh":"提前害怕；事先就紧张或恐惧（很少用，通常会说“提前害怕/事先紧张”）。"},"examples":[{"en":"I always prefrighten before exams, even when I’m prepared.","zh":"就算准备充分，我考试前也总会提前紧张害怕。"}]}],"synonyms":["scare in advance","frighten beforehand","make someone nervous","spook"],"phonetic":"/priˈfraɪtən/","extraExplanation":["“prefrighten”不是常见标准词，更像是把前缀“pre-（在……之前）”+ “frighten（吓唬）”临时拼出来的表达。写作或正式场合更自然的说法是：frighten someone beforehand / scare someone in advance / make someone nervous ahead of time。"]}
{"word":"prefrontal","summary":{"en":"Prefrontal refers to (or sometimes means) the brain’s front frontal-lobe area, especially the prefrontal cortex, linked to planning and self-control.","zh":"prefrontal 指（或有时直接指）大脑额叶最前部区域，尤指前额叶皮层，与计划、决策和自我控制等有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of the brain) relating to the front part of the frontal lobe, especially the prefrontal cortex, which is involved in planning, decision-making, attention, and self-control.","zh":"（大脑）与额叶最前部有关的，尤指前额叶皮层；该区域与计划、决策、注意力和自我控制等功能相关。"},"examples":[{"en":"The prefrontal cortex helps you plan what to do next.","zh":"前额叶皮层帮助你规划下一步要做什么。"},{"en":"Stress can make prefrontal functions like focus and self-control harder.","zh":"压力会让专注和自我控制等前额叶功能变得更困难。"},{"en":"In teenagers, prefrontal development is still in progress.","zh":"在青少年时期，前额叶的发育仍在进行中。"}]},{"partOfSpeech":"n.","definition":{"en":"The prefrontal cortex or prefrontal area of the brain.","zh":"前额叶（皮层）区域；指大脑的前额叶皮层/前额叶部位。"},"examples":[{"en":"Researchers measured activity in the prefrontal during the memory task.","zh":"研究人员在记忆任务中测量了前额叶的活动。"},{"en":"Damage to the prefrontal can affect judgment and impulse control.","zh":"前额叶受损会影响判断力和冲动控制。"}]}],"synonyms":["anterior frontal","prefrontal-cortex (related)","frontal (front) area"],"phonetic":"/ˌpriˈfrʌn.təl/","extraExplanation":["“pre-”表示“在……之前/前面的”，frontal与“额头/额叶”有关，所以prefrontal字面意思就是“额叶前部的”。在科普文章里常见搭配是prefrontal cortex（前额叶皮层）。","日常英语中更常说完整的prefrontal cortex；单独用the prefrontal多见于神经科学或心理学语境，指“前额叶区域”。"]}
{"word":"prefrosh","summary":{"en":"“Prefrosh” is an informal U.S. campus term for a first-year college student, often around orientation time.","zh":"“Prefrosh”是美国校园里常见的非正式说法，指大学一年级新生，常用于迎新/入学教育等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a first-year student at a college or university (especially used at some U.S. schools)","zh":"（大学或学院的）一年级新生；大一新生（多见于美国部分学校用语）"},"examples":[{"en":"The prefrosh orientation starts next week.","zh":"新生入学教育下周开始。"},{"en":"I met a lot of prefrosh in my dorm during move-in day.","zh":"搬入宿舍那天，我在宿舍里认识了很多大一新生。"}]}],"synonyms":["freshman","first-year student","frosh"],"phonetic":"/ˈpriːfrɑːʃ/","extraExplanation":["“prefrosh”是非正式（informal）的校园俚语，常见于美国大学语境，尤其在一些学校的社团、宿舍和迎新活动宣传中。","词源上通常被认为是“pre-”（在……之前）+“frosh”（“freshman”的口语缩写）组合而来，常用来指“刚入学、还没正式开始上课的新生”或“新生群体”。不同学校使用习惯略有差异。","相关词：frosh（新生的口语说法）、freshman（较正式）、first-year student（更中性、包容的说法，在一些场合更推荐）。"]}
{"word":"prefroze","summary":{"en":"“Prefroze” means “froze in advance,” the past tense of “prefreeze.”","zh":"“prefroze”表示“预先冷冻”，是“prefreeze”的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “prefreeze”: to freeze something in advance (often before shipping, cooking, or using it in another process).","zh":"“prefreeze”的过去式：预先冷冻（常指在运输、烹饪或后续加工前先把东西冻起来）。"},"examples":[{"en":"The factory prefroze the berries before packaging them.","zh":"工厂在包装前先把莓果预先冷冻了。"},{"en":"We prefroze the sauce in small portions for quick dinners.","zh":"我们把酱汁分成小份预先冷冻起来，方便快手晚餐。"}]}],"synonyms":["froze in advance","froze ahead of time","pre-froze"],"phonetic":"/ˌpriːˈfroʊz/","extraExplanation":["“prefreeze / prefroze / prefrozen”多见于食品加工、冷链物流、餐饮备餐等语境；在日常口语里更常说“freeze ahead of time / freeze in advance”。","拼写提示：英式/美式都能见到“prefreeze”，但“prefroze”相对少见；如果想更自然，可改用一般动词结构表达“提前冷冻”。"]}
{"word":"prefrozen","summary":{"en":"“Prefrozen” means frozen beforehand, especially for food or products that will be stored, shipped, or reheated later.","zh":"“prefrozen”表示“预先冷冻的”，常用于食品或产品在储存、运输或之后加热使用前已先冷冻的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Frozen in advance (before being shipped, stored, cooked, or used).","zh":"预先冷冻的；事先冻好的（在运输、储存、烹饪或使用之前已冷冻）。"},"examples":[{"en":"Use prefrozen berries if fresh ones aren’t available.","zh":"如果买不到新鲜莓果，可以用预先冷冻的莓果。"},{"en":"Many restaurants rely on prefrozen fries to save time.","zh":"很多餐馆依靠预先冷冻的薯条来节省时间。"},{"en":"The company sells prefrozen meals that you just reheat.","zh":"这家公司出售预先冷冻的餐食，你只需加热即可。"}]}],"synonyms":["pre-frozen","previously frozen","frozen ahead of time","already frozen"],"phonetic":"/priˈfroʊzən/","extraExplanation":["“prefrozen”常见于食品与冷链/物流语境，强调“在某个后续步骤之前就已经冻好”。也常写作“pre-frozen”。在包装上看到“prefrozen”通常表示产品在出厂或运输前已完成冷冻处理。"]}
{"word":"prefulfill","summary":{"en":"“Prefulfill” means to fulfill or prepare something in advance, often used in logistics/e-commerce.","zh":"“prefulfill”指提前履行或提前把某事准备到“已完成”的状态，常见于物流/电商语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fulfill or complete (an order, requirement, promise, etc.) in advance; to prepare so it is already fulfilled when needed","zh":"预先履行；提前完成（订单、要求、承诺等）；使之在需要时已处于完成状态"},"examples":[{"en":"The warehouse prefulfilled the first 500 orders so they could ship the moment the sale started.","zh":"仓库预先完成了前500个订单的配货处理，这样促销一开始就能立刻发货。"},{"en":"To avoid delays, the team tried to prefulfill the paperwork before the deadline week.","zh":"为避免耽误，团队尽量在截止周之前把手续预先办好。"}]}],"synonyms":["fulfill in advance","pre-fulfil (BrE spelling)","prepare in advance","pre-process","pre-pack"],"phonetic":"/ˌpriːfʊlˈfɪl/","extraExplanation":["“prefulfill”不是传统词典中很常见的标准词，更多见于电商、仓储、物流等场景，是在“fulfill（履行/完成/配货发货）”前加前缀“pre-（提前）”形成的行业用语。","在电商语境里，它常指“提前拣货、打包、贴单或做发货准备”，以便活动开始或条件满足时能立刻发出。更常见、也更自然的表达还包括：prepare in advance, pre-process orders, pre-pack, pre-stage inventory 等。"]}
{"word":"prefulfillment","summary":{"en":"Prefulfillment means the steps before an order is fulfilled (picked, packed, and shipped).","zh":"Prefulfillment 指订单履约（拣货、打包、发货）之前的准备与审核流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Business/e-commerce) The stage or activities before an order is fulfilled (picked, packed, shipped, or delivered), such as inventory checks, address validation, fraud review, and preparing the warehouse to process the order.","zh":"（商业/电商）订单正式履约（拣货、打包、发货或交付）之前的阶段或相关工作，例如库存核对、地址校验、风控审核，以及为仓库处理订单做准备等。"},"examples":[{"en":"During prefulfillment, the system checks inventory and verifies the shipping address.","zh":"在 prefulfillment 阶段，系统会检查库存并验证收货地址。"},{"en":"Delays in prefulfillment can push back the shipping date even if items are in stock.","zh":"即使有现货，prefulfillment 的延迟也可能导致发货日期推迟。"},{"en":"We added an anti-fraud step to prefulfillment for high-value orders.","zh":"我们为高价订单在 prefulfillment 阶段增加了反欺诈步骤。"}]}],"synonyms":["pre-fulfillment","pre-shipping process","order processing (early stage)","pre-dispatch checks"],"phonetic":"/ˌpriːfʊlˈfɪlmənt/","extraExplanation":["这是一个偏行业的合成词：pre-（“在……之前”）+ fulfillment（“履约/配送完成”）。在电商与仓储物流语境里，fulfillment 通常指从接单到发货/交付的一整套流程，因此 prefulfillment 常用来标记“进入仓库履约流程之前”的准备与审核环节。","拼写上更常见的写法是带连字符的 pre-fulfillment，或直接说 pre-fulfillment stage / pre-fulfillment checks。不同公司对它涵盖的内容可能略有差异，使用时最好配合具体流程说明。"]}
{"word":"prefulgence","summary":{"en":"Prefulgence means a foreglowing radiance—light or brilliance that appears before something else, usually in poetic contexts.","zh":"Prefulgence 指“先兆般的光辉/辉光”，即在某事到来之前出现的光亮，多见于诗歌或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright glow or radiance that seems to come before something else; an anticipatory or foreglowing light (often used in poetic or literary writing).","zh":"（多用于诗歌/文学）在某事发生或出现之前就显现的光辉；预示性的光芒、先兆般的辉光。"},"examples":[{"en":"In the east, a faint prefulgence hinted at the coming sunrise.","zh":"东方一抹淡淡的先兆光辉，暗示着日出将至。"},{"en":"The poem describes hope as a prefulgence before the storm breaks.","zh":"这首诗把希望写成风暴来临前的预示性光芒。"}]}],"synonyms":["radiance","glow","foreglow","luster","brilliance"],"phonetic":"/priˈfʌldʒəns/","extraExplanation":["“prefulgence”是非常少见、偏文学的词，日常英语中几乎不用；更常见的表达是“a glow/foreglow”或“a hint of light”。","词源上可理解为“pre-（在前）+ fulgence（光辉）”，因此带有“先于……出现的光亮/光辉”的意味，常用于描写黎明、希望、预兆等意象。"]}
{"word":"prefulgency","summary":{"en":"“Prefulgency” isn’t standard; it likely means “radiant brightness,” like “effulgence/refulgency.”","zh":"“prefulgency”不是标准用词；多半想表达“灿烂的光辉”，相当于“effulgence/refulgency”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “refulgency” or “effulgence,” meaning a bright, radiant shine (often used in poetic/literary writing).","zh":"不是标准英语单词；很可能是把“refulgency”或“effulgence”拼错了，意思是“耀眼的光辉、灿烂的光芒”（常见于诗歌/文学语境）。"},"examples":[{"en":"In the refulgency of the morning sun, the lake looked like silver.","zh":"在清晨阳光的灿烂光辉中，湖面看起来像银子一样闪亮。"},{"en":"The cathedral windows filled the room with a soft effulgence.","zh":"教堂的彩窗让房间充满了柔和的光辉。"}]}],"synonyms":["effulgence","refulgency","radiance","brightness","splendor"],"phonetic":"/ɪˈfʌldʒəns/","extraExplanation":["“prefulgency”在常见词典中基本查不到，通常被认为是拼写错误。最接近且有实际用法的词是：\n- refulgency（更少见、偏文学）：来自 refulgent（“辉煌的、闪耀的”）\n- effulgence（更常见、偏文学/正式）：来自 effulgent（“放光的、灿烂的”）\n两者都强调“光芒四射、灿烂夺目”的感觉。","如果你是在某段文字里看到“prefulgency”，也可能是作者的创造性拼写（nonce word）或排版错误；你可以把原句发来，我可以帮你判断最合理的词。"]}
{"word":"prefulgent","summary":{"en":"Prefulgent means “very bright and shining; radiant.”","zh":"prefulgent 意为“非常明亮、闪耀的；光辉灿烂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shining brightly; radiant; glowing with strong light.","zh":"光辉灿烂的；明亮耀眼的；光芒四射的。"},"examples":[{"en":"The prefulgent sun rose above the hills.","zh":"光辉灿烂的太阳从山丘上升起。"},{"en":"Her prefulgent smile made the room feel warmer.","zh":"她光芒四射的笑容让房间显得更温暖。"}]}],"synonyms":["radiant","brilliant","dazzling","luminous","resplendent"],"phonetic":"/priˈfʌldʒənt/","extraExplanation":["“prefulgent”是一个非常少见、偏文学化的形容词，日常英语里更常用的表达是“radiant / brilliant / dazzling / shining”。","词源上与拉丁语“fulgent”（闪耀的、发光的）相关；前缀“pre-”在这里更像是加强语气，用来强调“非常明亮、极其耀眼”。在文学描写（如写日光、宝石、盔甲、星光）中更容易见到。"]}
{"word":"prefunction","summary":{"en":"“Prefunction” usually means “done before normal operation,” especially in engineering (prefunctional checks/tests).","zh":"“prefunction”通常指“在正式运行前进行的”，多用于工程领域（如预功能检查/预功能测试）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(mainly engineering/construction) Happening before a system or device is put into normal operation; done to prepare for full functional testing or use.","zh":"（主要用于工程/施工）在设备或系统正式投入运行之前进行的；用于为后续的功能测试或正式使用做准备的。"},"examples":[{"en":"The team completed prefunctional checks on the HVAC units before commissioning.","zh":"在系统调试（commissioning）前，团队完成了暖通空调机组的预功能检查。"},{"en":"Prefunctional testing confirmed the sensors were wired correctly.","zh":"预功能测试确认传感器接线正确。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A prefunctional test or check.","zh":"（较少见）预功能测试或预检（指这类测试/检查本身）。"},"examples":[{"en":"We still have two prefunctions left before the final start-up.","zh":"在最终启动前，我们还剩两项预功能测试要做。"}]}],"synonyms":["prefunctional","pre-operational","precommissioning","pre-startup"],"phonetic":"/ˌpriːˈfʌŋkʃən/","extraExplanation":["“prefunction”更常见的写法是带连字符或分开写：pre-functional / prefunctional（形容词），以及 prefunctional test/check（名词短语）。","在建筑机电与调试领域里，prefunctional 通常指：在“功能性能测试（functional performance testing）”之前，先做基础核对（如接线、阀门位置、传感器校准、转向、联锁与安全保护等），确保系统具备进入正式测试的条件。"]}
{"word":"prefunctional","summary":{"en":"“Prefunctional” means happening before something is fully functional—often used for early-stage or preparatory training and development.","zh":"“prefunctional”表示在事物完全具备功能之前的阶段，常用于描述早期阶段或预备性训练/发展。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Before something becomes functional; preparatory or occurring at an early stage before normal function begins.","zh":"在某事物变得“可发挥功能”之前的；功能形成前的；预备性的。"},"examples":[{"en":"The clinic uses prefunctional exercises to build basic strength before swallowing practice.","zh":"诊所会用功能前训练来建立基础力量，然后再进行吞咽练习。"},{"en":"They tested the device in a prefunctional stage to check safety and stability.","zh":"他们在设备尚未具备完整功能的阶段进行测试，以检查安全性和稳定性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical) Describing a stage in development or analysis where functional roles (what something is used for) are not yet established or are not the focus.","zh":"（专业）指在发展/分析中，尚未建立功能角色（用途/作用），或暂不以功能为重点的阶段。"},"examples":[{"en":"The paper discusses a prefunctional phase of language development.","zh":"这篇论文讨论了语言发展中的功能形成前阶段。"}]}],"synonyms":["preliminary","preparatory","early-stage","incipient"],"phonetic":"/ˌpriːˈfʌŋkʃənəl/","extraExplanation":["“prefunctional”由前缀 pre-（在……之前）+ functional（功能性的）构成，多见于医学康复、言语治疗、发育心理/语言发展等语境，强调“先建立基础能力，再进入真正的功能性训练/表现”。","写作时常用在名词前：prefunctional stage/phase（功能前阶段），prefunctional exercises/therapy（功能前训练/治疗）。日常口语较少用，更偏学术或专业表达。"]}
{"word":"prefuneral","summary":{"en":"“Prefuneral” means occurring before a funeral or related to preparations for one.","zh":"“prefuneral”指发生在葬礼之前的，或与葬礼准备相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a funeral; done in preparation for a funeral.","zh":"（葬礼）前的；为葬礼做准备的。"},"examples":[{"en":"The family held a prefuneral gathering at the house.","zh":"家人在家里举行了一个葬礼前的聚会。"},{"en":"Prefuneral arrangements can include choosing music and writing an obituary.","zh":"葬礼前的安排可能包括选择音乐和撰写讣告。"}]}],"synonyms":["before the funeral","pre-funeral","funeral-prep","pre-burial"],"phonetic":"/ˌpriːˈfjuːnərəl/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ funeral（“葬礼”）组成，多用于较正式或专业的语境（如殡葬服务、医院社工、法律文件）。日常口语里也常用 before the funeral / leading up to the funeral 来表达。","发音上通常重读 funeral 的第一音节，整体读起来像把 pre- 轻轻加在 funeral 前面。"]}
{"word":"prefungoidal","summary":{"en":"A rare medical adjective meaning “before the fungoid (mushroom-like) stage,” often used for early lesions in mycosis fungoides.","zh":"一个少见的医学形容词，指“在蕈样（蘑菇样）阶段之前”，常用于描述蕈样肉芽肿的早期皮损。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Occurring before a “fungoid” (mushroom-like) stage; especially used in medicine to describe early-stage skin changes before the development of fungoid tumors (classically in mycosis fungoides).","zh":"发生在“蕈样/蘑菇样（fungoid）”阶段之前的；尤用于医学语境，指在出现蕈样肿瘤之前的早期皮肤表现（典型见于蕈样肉芽肿相关病程）。"},"examples":[{"en":"The report described prefungoidal lesions that could be mistaken for eczema.","zh":"报告描述了蕈样前期的皮损，可能会被误认为湿疹。"},{"en":"In some patients, the prefungoidal stage lasts for years before tumors appear.","zh":"在一些患者中，蕈样前期可能持续多年，之后才出现肿瘤样改变。"}]}],"synonyms":["early-stage","pre-tumorous","incipient"],"phonetic":"/priˌfʌnˈɡɔɪdəl/","extraExplanation":["这个词非常少见，主要出现在皮肤科/病理科的专业文献里。它常与“mycosis fungoides（蕈样肉芽肿，一种皮肤T细胞淋巴瘤）”的分期讨论相关：早期可表现为红斑或斑片/斑块，外观不一定“蘑菇样”，因此称“prefungoidal（蕈样前期）”。","词形结构：pre-（在……之前）+ fungoid（蕈样的、蘑菇样的）+ -al（形容词后缀）。这里的“fungoid”指外观像蘑菇，并不等同于“真菌感染”。"]}
{"word":"prefurlough","summary":{"en":"Prefurlough (more commonly pre-furlough) means “before a furlough,” especially in workplace contexts.","zh":"prefurlough（更常见写作 pre-furlough）表示“停薪休假/临时停工之前的”，多用于职场语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written with a hyphen: pre-furlough) happening or existing before a furlough (a temporary leave from work, often unpaid).","zh":"（常写作带连字符的 pre-furlough）指“在休假停薪（临时停工留职）之前发生的/存在的”。"},"examples":[{"en":"The company offered pre-furlough training to help staff prepare for time away from work.","zh":"公司提供了停薪休假前培训，帮助员工为离岗期间做准备。"},{"en":"She saved extra money during the pre-furlough period in case her pay stopped.","zh":"她在停薪休假前那段时间多存了些钱，以防工资暂停。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the time or stage before a furlough begins.","zh":"（较少见）指休假停薪开始前的那段时间/阶段。"},"examples":[{"en":"During the prefurlough, managers met with each team to explain the schedule.","zh":"在停薪休假前的阶段，管理者与各团队开会说明安排。"}]}],"synonyms":["pre-furlough","before the furlough","prior to the furlough"],"phonetic":"/ˌpriːˈfɝːloʊ/","extraExplanation":["“prefurlough”并不是非常常见的标准词形；在职场/人力资源语境里更常见写法是“pre-furlough”（带连字符），用来修饰training、meeting、notice、period等名词。","“furlough”在美式英语里常指雇主安排的临时停工或停薪留职（与永久裁员 layoff 不同）。因此“pre-furlough”通常出现在公司通知、政策说明、财务与保险安排等文本中。"]}
{"word":"prefurnish","summary":{"en":"“Prefurnish” means to furnish a place ahead of time, typically before someone moves in.","zh":"“Prefurnish”指在入住或使用前提前为房屋等配齐家具/设施并布置好。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to furnish (a home, apartment, room, etc.) in advance, especially before someone moves in","zh":"（在入住前）预先配备家具/设施；提前布置（房屋、房间等）"},"examples":[{"en":"The landlord prefurnished the apartment with a bed, a table, and basic kitchenware.","zh":"房东在入住前就把公寓配好了床、桌子和基本的厨房用具。"},{"en":"They decided to prefurnish the guest room before their parents arrived.","zh":"他们决定在父母到来之前先把客房布置好。"}]}],"synonyms":["furnish in advance","furnish ahead of time","equip beforehand"],"phonetic":"/priːˈfɝːnɪʃ/","extraExplanation":["“prefurnish”由前缀 pre-（“在……之前”）+ furnish（“配备家具/提供设备”）组成，是一个相对少见但很好理解的动词。更常见的表达是：furnish in advance / furnish ahead of time，或用形容词说 a furnished apartment（带家具的公寓）。在租房语境里也常看到 fully furnished（全套家具）、partly furnished（部分家具）、unfurnished（不带家具）。"]}

