{"word":"prehallux","summary":{"en":"A prehallux is a small extra digit or related bone in front of the big toe (hallux) in some animals.","zh":"prehallux 指某些动物拇趾（大脚趾）前方的小型附加趾状结构或相关的额外骨/软骨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(anatomy, zoology) A small extra digit, nub, or bony structure located in front of the hallux (the big toe), seen in some animals.","zh":"（解剖学／动物学）位于拇趾（大脚趾，hallux）前方的一个小的附加“趾”、突起或骨性结构，在某些动物中可见。"},"examples":[{"en":"Some frogs have a prehallux that helps them grip surfaces.","zh":"有些青蛙具有 prehallux，有助于它们抓握表面。"},{"en":"The specimen shows a distinct prehallux near the base of the big toe region.","zh":"该标本在拇趾区域的基部附近显示出明显的 prehallux。"}]},{"partOfSpeech":"n.","definition":{"en":"An extra bone or cartilage associated with that extra digit/structure (the prehallux bone).","zh":"与该附加结构相关的一块额外骨或软骨（prehallux 骨）。"},"examples":[{"en":"Researchers compared the prehallux bone across several amphibian species.","zh":"研究人员比较了多种两栖动物的 prehallux 骨。"}]}],"synonyms":["prehallux bone","accessory digit (context-dependent)","supernumerary digit (general)"],"phonetic":"/ˌpriːˈhælʌks/","extraExplanation":["这个词主要出现在动物解剖与进化研究语境中，常见于两栖类（如蛙类）或部分爬行类的形态描述。一般不用于描述人类脚部结构；谈到人类的“多趾”更常用 polydactyly。","词形构成：pre-（在……之前）+ hallux（拇趾）。因此字面意思就是“在拇趾前的结构”。"]}
{"word":"prehalter","summary":{"en":"“Prehalter” is not a common English word; it’s probably a misspelling (often of “halter” or “preheat”).","zh":"“prehalter”不是常见英语单词；很可能是拼写错误（常见是“halter”或“preheat”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a name, or a specialized term. Common intended words include “halter” (a strap/device for holding or leading an animal; or a halter-style top) or “preheat” (to heat beforehand).","zh":"不是标准英语单词。更可能是拼写错误、人名或非常专业的术语。常见可能想写的是“halter”（缰绳/笼头；或挂脖式上衣）或“preheat”（预热）。"},"examples":[{"en":"I couldn’t find “prehalter” in an English dictionary—did you mean “halter”?","zh":"我在英语词典里找不到“prehalter”——你是不是想写“halter”？"},{"en":"If you meant “preheat,” the recipe says to preheat the oven to 350°F.","zh":"如果你想写“preheat”，食谱会说把烤箱预热到350华氏度。"}]}],"phonetic":"/priˈhɔltər/","extraExplanation":["如果你能提供一句包含“prehalter”的原句（或说明它来自哪里：课本/游戏/医学/姓名等），我可以更准确判断它的意思与正确拼写。","如果你想表达“在……之前的（pre-）+ halter（笼头/挂脖式）”，这种构词在英语里不常见，通常会改用更自然的说法（例如“before putting on the halter / a halter-style …”）。"]}
{"word":"prehalteres","summary":{"en":"Prehalteres are anterior, haltere-like balancing structures in some insects.","zh":"Prehalteres 指某些昆虫翅前方类似平衡棒的平衡结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) Small, club-like balancing organs located in front of the wings in some insects (often contrasted with halteres behind the wings in flies).","zh":"（昆虫学）某些昆虫在翅前方的小型棒状平衡器官（常与双翅目昆虫位于翅后方的“平衡棒/翅平衡器”haltere 相对）。"},"examples":[{"en":"In this species, the prehalteres are visible as tiny knobbed stalks near the wing base.","zh":"在这个物种中，prehalteres 可见为翅基附近带小球状末端的细柄结构。"},{"en":"The researcher compared the movement of the prehalteres and the halteres during flight.","zh":"研究人员比较了飞行时 prehalteres 与 halteres 的运动方式。"}]}],"synonyms":["fore halteres","anterior halteres"],"phonetic":"/ˌpriːˈhɔːltəˌriz/","extraExplanation":["这是一个相对少见的专业词，主要出现在昆虫解剖或分类学文献里。pre- 表示“在前/前面的”，halteres（平衡棒）来自希腊语词根，常指双翅目（如苍蝇）翅后方用于保持平衡的棒状器官。prehalteres 通常用来指“位于更前方的、类似平衡棒的结构”（具体所指会随研究对象与文献传统而变化）。","阅读论文时可以注意作者是否在比较“前平衡器官（prehalteres）”与“后平衡器官（halteres）”，或是否把它作为某些类群的诊断特征（用于区分物种/类群）。"]}
{"word":"prehandicap","summary":{"en":"“Prehandicap” is a rare verb meaning to handicap or disadvantage something in advance.","zh":"“prehandicap”是个罕用动词，指提前设置让分/差点/负重等，使其预先处于不利地位。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) to handicap someone or something in advance; to set a disadvantage beforehand (often in sports or competition contexts).","zh":"（罕用）预先使某人/某事处于不利地位；提前设定“让分/让杆/负重”等不利条件（多见于体育或竞赛语境）。"},"examples":[{"en":"Some critics said the new rule would prehandicap smaller teams before the season even started.","zh":"一些批评者说，新规则会在赛季开始前就让小球队先天处于劣势。"},{"en":"The event organizers tried not to prehandicap beginners with complicated equipment requirements.","zh":"主办方尽量不用复杂的装备要求来提前“卡住”新手。"}]}],"synonyms":["handicap in advance","disadvantage beforehand","pre-assign a handicap","stack the odds against"],"phonetic":"/ˌpriːˈhændɪˌkæp/","extraExplanation":["“prehandicap”不是常见标准词汇，更常见的表达是：handicap someone in advance / put someone at a disadvantage beforehand / pre-assign a handicap（预先设定让分/让杆/负重）。","在高尔夫、赛马等项目里，handicap 指“差点/让杆/负重”等制度；因此 prehandicap 可理解为“在比赛前就把差点或负重先定好”，但正式写作里通常会用更清楚的短语来表达。"]}
{"word":"prehandicapped","summary":{"en":"“Pre-handicapped” is uncommon and usually means “given a handicap in advance,” not a recommended word for talking about disability.","zh":"“pre-handicapped”很少见，通常指“事先被加上让分/劣势”；不建议用它来谈论残障。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; sometimes used to mean “given a handicap in advance” (for example, in a game or competition).","zh":"不是标准词典词；有时用来表示“事先被设置障碍/让其处于不利条件”（例如在游戏或比赛中提前被加上让分或劣势）。"},"examples":[{"en":"In the tournament, new players were pre-handicapped so the matches would be fairer.","zh":"在锦标赛中，新选手被事先设定让分（劣势），让比赛更公平。"},{"en":"The rules felt like we were pre-handicapped before we even started.","zh":"这些规则让人感觉我们还没开始就已经被提前设了不利条件。"}]}],"synonyms":["disadvantaged","given a handicap","set up to fail","starting at a disadvantage"],"phonetic":"/ˌpriːˈhæn.dɪ.kæpt/","extraExplanation":["“handicapped”在描述残障人士时带有过时、可能冒犯的感觉。更推荐用以人为本的表达：例如“a person with a disability”（有残障的人）或更具体的说法（如“a wheelchair user” 使用轮椅者）。","如果你想表达“提前就处于不利条件/被针对”，更自然的英文可以说：“disadvantaged from the start / set up to fail / given a handicap in advance”。","如果你原本想写的是“preconceived”（先入为主的）或“predisposed”（倾向于……的），告诉我你的上下文，我可以帮你选更准确的词。"]}
{"word":"prehandicapping","summary":{"en":"Prehandicapping means doing handicapping ahead of time—predicting outcomes or assigning ratings/odds before an event starts.","zh":"prehandicapping 指“赛前让分/评级/预测”，即在事件开始前先做分析、预测或设定赔率/等级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of handicapping in advance (making predictions, setting odds, or assigning disadvantages/ratings before an event happens).","zh":"赛前让分/评定的行为；提前做“让分（或评级、预测赔率）”的过程。"},"examples":[{"en":"In horse racing, prehandicapping helps bettors narrow down the field before they see the track conditions.","zh":"在赛马中，赛前让分/评定能帮助下注者在看到赛道状况之前先缩小候选马匹范围。"},{"en":"The analyst’s prehandicapping was strong, but the weather change shifted the results.","zh":"分析师的赛前评定很到位，但天气变化改变了结果。"}]},{"partOfSpeech":"v.","definition":{"en":"To handicap in advance; to estimate likely outcomes or assign ratings/advantages before a contest or event begins.","zh":"在赛前进行让分/评定；在比赛或事件开始前估计结果或给出评级、优势/劣势设定。"},"examples":[{"en":"Some fans prehandicap the playoffs using team statistics from the regular season.","zh":"一些球迷会根据常规赛数据来赛前评估季后赛。"},{"en":"It’s hard to prehandicap fairly when you don’t know who will be injured.","zh":"在不知道谁会受伤的情况下，很难做出公平的赛前评定。"}]}],"synonyms":["pre-analysis","advance handicapping","early prediction","forecasting"],"phonetic":"/ˌpriːˈhændɪˌkæpɪŋ/","extraExplanation":["这个词不算常见，更多见于赛马、博彩分析、体育预测等语境。通常会写作 **pre-handicapping**（带连字符）或当作“handicapping（赛前分析）”的一部分来表达。","handicap 在体育/比赛里常指“让分/让时/让球”或“按实力分级以求公平”；在博彩语境里也常指“赛前分析与预测（handicapping a race/game）”。"]}
{"word":"prehandle","summary":{"en":"Prehandle means to deal with something beforehand, especially in technical contexts.","zh":"prehandle 指“事先处理/提前应对”，多用于技术或计算机语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to handle or deal with something in advance; to prepare it before the main step happens (often used in computing or technical writing).","zh":"预先处理；事先应对（常见于计算机或技术语境，指在主要步骤前先做处理）"},"examples":[{"en":"We prehandle invalid input so the main program won’t crash.","zh":"我们先预处理无效输入，这样主程序就不会崩溃。"},{"en":"The server prehandles authentication before routing the request.","zh":"服务器在转发请求前先预处理身份验证。"}]}],"synonyms":["preprocess","handle in advance","deal with beforehand","prepare","pre-treat"],"phonetic":"/ˌpriːˈhændəl/","extraExplanation":["“prehandle”不是非常常见的日常英语词，更常见于程序开发、系统设计或技术文档里，用来强调“在主流程之前先处理”。在一般写作中，人们更常用“preprocess”（预处理）、“handle in advance”（提前处理）、“deal with beforehand”（事先应对）。"]}
{"word":"prehandled","summary":{"en":"Prehandled means already dealt with or processed in advance.","zh":"prehandled 指“已预先处理过的、提前处理好的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already handled, processed, or dealt with before the current step or time (often used in technical, logistics, or customer-service contexts).","zh":"在当前步骤或时间之前就已被处理、加工或应对过的（常见于技术、物流或客服语境）。"},"examples":[{"en":"The samples were prehandled to reduce contamination risk.","zh":"这些样品已预先处理，以降低污染风险。"},{"en":"Prehandled requests usually move through the system faster.","zh":"已预先处理过的请求通常在系统里流转更快。"}]}],"synonyms":["preprocessed","pretreated","already handled","pre-addressed"],"phonetic":"/ˌpriːˈhændəld/","extraExplanation":["“pre-”表示“预先、在……之前”，加在过去分词“handled（处理过的）”前，构成形容词“prehandled”，强调“已经提前处理好”。","该词多见于专业写作（如实验流程、制造业、仓储/物流、工单系统），日常口语里更常用“already handled / taken care of / processed”。"]}
{"word":"prehandling","summary":{"en":"Prehandling means doing handling or preparation steps before the main process, especially in logistics or production.","zh":"Prehandling 指在主要流程之前进行的搬运或准备步骤，常见于物流与生产场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of handling, preparing, or processing something before the main handling/processing step (often in logistics, manufacturing, or food processing)","zh":"（常用于物流、制造、食品加工等）在主要操作之前对某物进行搬运、准备或预处理的行为"},"examples":[{"en":"Prehandling the packages at the warehouse helped the delivery route run faster.","zh":"在仓库对包裹进行预先处理让配送路线更顺畅、更快。"},{"en":"Good prehandling reduces damage during shipping.","zh":"良好的预先处理能减少运输过程中的损坏。"}]},{"partOfSpeech":"n.","definition":{"en":"the preparatory steps done before using or installing something (such as checking, sorting, labeling, or cleaning)","zh":"在使用或安装之前进行的准备步骤（如检查、分类、贴标签或清洁）"},"examples":[{"en":"The technician completed prehandling by inspecting and labeling each part.","zh":"技术员通过检查并给每个零件贴标签完成了预先处理。"},{"en":"In food production, prehandling may include washing and trimming ingredients.","zh":"在食品生产中，预先处理可能包括清洗和修整食材。"}]}],"synonyms":["preparation","preprocessing","initial handling","pre-treatment"],"phonetic":"/priˈhændlɪŋ/","extraExplanation":["“prehandling”在日常英语中不算常见，更常见的写法是带连字符的“pre-handling”，或用更具体的词表达，如“preparation / preprocessing / initial handling”。在正式写作中，建议根据行业语境选用更常见、更明确的术语。"]}
{"word":"prehaps","summary":{"en":"Perhaps means “maybe” or “possibly,” used when you’re not sure.","zh":"Perhaps 表示“也许/可能”，用于表达不确定或有可能的情况。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"used to say something is possible but not certain; maybe","zh":"用于表示某事有可能但不确定；也许；可能"},"examples":[{"en":"Perhaps it will rain later, so bring an umbrella.","zh":"也许晚点会下雨，所以带把伞。"},{"en":"Perhaps we can meet after class.","zh":"也许我们可以下课后见面。"},{"en":"He is perhaps the best player on the team.","zh":"他可能是队里最好的球员。"}]}],"synonyms":["maybe","possibly","perhaps so","potentially"],"phonetic":"/pɚˈhæps/","extraExplanation":["“prehaps”是常见拼写错误，正确拼法是“perhaps”。可以记成 per-（每/通过）+ haps（偶然发生的事，旧用法相关），整体有“或许发生”的感觉。"]}
{"word":"preharden","summary":{"en":"Preharden means to harden something ahead of time, especially metal, to prepare it for later processing.","zh":"Preharden 指在后续工序之前先进行硬化处理（多用于金属），以便加工或提升性能。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to harden something in advance (often partially), especially metal, so it is stronger or ready for later processing","zh":"预先硬化（常指金属先进行部分或初步硬化处理），使其更坚硬或便于后续加工"},"examples":[{"en":"The manufacturer prehardens the steel plates before cutting them to size.","zh":"厂家在把钢板切割到尺寸之前，会先对钢板进行预硬化处理。"},{"en":"Prehardening the part can reduce distortion during final heat treatment.","zh":"对零件进行预硬化处理可以减少最终热处理时的变形。"}]}],"synonyms":["pre-harden","preheat-treat","harden (in advance)"],"phonetic":"/ˌpriˈhɑrdən/","extraExplanation":["“preharden”多见于工程、金属加工与材料科学语境，常写作“pre-harden / preharden”。它强调“在最终加工或最终热处理之前先硬化”，例如为了提高强度、稳定尺寸，或让材料达到某个预定硬度范围（如“pre-hardened steel”预硬化钢）。","与“harden”相比，“preharden”更突出“提前做”这一工序安排；具体方法可能包括预淬火、预回火或其他热处理步骤，取决于材料与工艺要求。"]}
{"word":"prehardened","summary":{"en":"Prehardened means hardened beforehand, especially referring to steel that already has a set hardness before further processing.","zh":"prehardened 指“预先硬化的”，多用于材料/钢材已在后续加工前达到一定硬度的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of metal, especially steel) hardened in advance (before machining, forming, or final heat treatment).","zh":"（尤指金属、钢材）预先硬化的；在加工、成形或最终热处理之前就已硬化的。"},"examples":[{"en":"The mold was made from prehardened steel to reduce heat‑treatment time.","zh":"这个模具用预硬钢制作，以减少热处理时间。"},{"en":"Prehardened plates are easier to use when you need consistent hardness right away.","zh":"当你需要立刻获得稳定硬度时，预硬板材更方便使用。"}]}],"synonyms":["pre-hardened","hardened","heat-treated","pretreated"],"phonetic":"/ˌpriːˈhɑrdənd/","extraExplanation":["“Prehardened”常见于工程与制造业语境，尤其是“prehardened steel（预硬钢）”。它的优点通常是：材料到手就有较稳定的硬度与强度、可以减少或省去后续的淬火/回火流程，从而节省时间与成本。缺点可能是：硬度较高会让切削加工更费刀具、加工难度更大。","构词很直观：pre-（预先）+ hardened（已硬化的）。在技术文档里也常写作“pre-hardened”。"]}
{"word":"prehardener","summary":{"en":"A prehardener is an additive used to begin or speed up curing before the main hardener.","zh":"prehardener 指用于在主要硬化剂之前启动或加速固化的预硬化添加剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical additive used before or along with a main hardener to start or speed up curing (hardening), especially in coatings, resins, plastics, or adhesives.","zh":"（工业用语）预硬化剂：在主要硬化剂之前或配合使用，用来启动或加速材料（如涂料、树脂、塑料、胶黏剂）固化（变硬）的化学添加剂。"},"examples":[{"en":"Add the prehardener first, then mix in the hardener to control the curing time.","zh":"先加入预硬化剂，再混入硬化剂，以控制固化时间。"},{"en":"This resin system uses a prehardener to improve hardness at room temperature.","zh":"这套树脂体系使用预硬化剂来提高室温下的硬度。"}]}],"synonyms":["pre-hardener","accelerator","catalyst","curing agent additive"],"phonetic":"/ˌpriˈhɑrdənər/","extraExplanation":["“Prehardener”多见于材料与化工领域（如汽车修补漆、工业涂料、复合材料树脂等）的产品说明书或技术资料中。它不是日常英语常用词，更常见的相关说法包括“(pre-)accelerator（促进剂）”“catalyst（催化剂）”“curing agent（固化剂/硬化剂）”。不同厂家对“prehardener”的定义可能略有差异，使用时以具体配方与安全数据表（SDS）为准。"]}
{"word":"prehardening","summary":{"en":"Prehardening means hardening a material in advance (or the resulting pre-hardened condition), commonly used in manufacturing and metallurgy.","zh":"Prehardening 指材料在加工前进行预先硬化（或处于预硬化状态），常见于制造业与冶金语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a material hard (or harder) before the main manufacturing step, so later shaping or use is easier or more stable","zh":"在主要加工步骤之前，先把材料硬化（或提高硬度）的过程，以便后续加工更稳定或更方便"},"examples":[{"en":"The mold steel was supplied after prehardening, so it could be machined without further heat treatment.","zh":"这种模具钢以预硬化状态供应，因此可以直接加工，不需要再进行热处理。"},{"en":"Prehardening reduces distortion during the final finishing process.","zh":"预硬化可以减少最终精加工时的变形。"}]},{"partOfSpeech":"adj.","definition":{"en":"already hardened in advance; treated to reach a usable hardness before final processing","zh":"预先硬化的；在最终加工前已处理到可用硬度的"},"examples":[{"en":"They chose prehardening steel for faster turnaround on the tooling.","zh":"他们选择预硬化钢，以加快工装的交付速度。"}]}],"synonyms":["pre-hardening","prehardening treatment","pre-hardening process","pre-hardened"],"phonetic":"/ˌpriːˈhɑːrdənɪŋ/","extraExplanation":["“prehardening / pre-hardening / prehardened”多见于材料与制造业语境，尤其是模具钢（pre-hardened mold steel）。意思通常是材料在出厂前已达到一定硬度，买方可直接机加工，减少或省略后续淬火/回火等热处理步骤。","在不同领域它可能指不同手段的“预先变硬”，例如金属的预硬化（热处理）、树脂/涂层的预固化（cure）等；具体要看上下文。"]}
{"word":"prehardens","summary":{"en":"“Prehardens” means “hardens something in advance,” especially in manufacturing and materials contexts.","zh":"“prehardens”表示“预先使某物硬化”，多用于制造与材料领域。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hardens something in advance (often metal, plastic, or another material) so it is already strong or wear-resistant before later processing or use","zh":"预先使（材料）硬化；在后续加工或使用前先提高其硬度与耐磨性（常用于金属、塑料等）"},"examples":[{"en":"The supplier prehardens the steel so it can be machined without a separate heat-treatment step.","zh":"供应商会先把钢材预硬化，这样加工时就不需要再单独做热处理。"},{"en":"This process prehardens the surface to reduce scratches during shipping.","zh":"这个工艺会先让表面预硬化，以减少运输过程中的刮痕。"}]}],"synonyms":["pre-treat","harden","case-harden (in some contexts)","precondition (broadly)"],"phonetic":"/ˌpriˈhɑrdənz/","extraExplanation":["“prehardens”是动词“preharden”的第三人称单数（he/she/it prehardens）。在工程语境里常见于材料与制造业，意思是“在后续步骤之前先硬化”。","相关常见搭配：prehardened steel（预硬钢/预硬化钢）。它通常指材料在出厂前已达到一定硬度，方便用户直接加工或装配。","注意区分：preharden（预硬化）强调“先做”，而 harden/heat-treat（硬化/热处理）更泛指使材料变硬的过程，不一定发生在前面。"]}
{"word":"preharmonious","summary":{"en":"Preharmonious means “before harmony,” often describing an early stage that isn’t harmonious yet, or (rarely) music before full harmony develops.","zh":"preharmonious 意为“和谐之前的”，常指尚未和谐的早期阶段；（罕用）也可指完整和声形成之前的音乐阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) existing or happening before harmony is achieved; not yet harmonious, but moving toward harmony.","zh":"（罕用）指在达到和谐之前的；尚未和谐但正走向和谐的。"},"examples":[{"en":"The team was in a preharmonious stage, still learning how to communicate.","zh":"团队还处在“和谐之前”的阶段，仍在学习如何沟通。"},{"en":"Some early talks were tense but preharmonious, setting the ground for agreement.","zh":"一些早期谈判虽紧张，却像是“达成和谐前的铺垫”，为协议打下基础。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music, rare) relating to musical practices or sounds before full harmonic (chord-based) development; before clear harmony is established.","zh":"（音乐，罕用）指完整和声（以和弦为基础）发展之前的音乐做法或声音；在清晰和声建立之前的。"},"examples":[{"en":"The lecture compared preharmonious chant with later harmonic writing.","zh":"讲座对比了“和声形成前”的圣咏与后来的和声写作。"}]}],"synonyms":["not yet harmonious","before harmony","transitional","incipient","nascent"],"phonetic":"/ˌpriːhɑrˈmoʊniəs/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ harmonious（“和谐的”）构成，但在现代英语中非常少见；更常用的表达通常是 before harmony is achieved / not yet harmonious / early-stage harmony。","在日常语境里，用它多半是修辞性的写法（强调“从不协调走向协调的过程”）；在音乐语境中则可能用来描述“和声体系确立之前”的风格或阶段。"]}
{"word":"preharmoniously","summary":{"en":"A rare adverb meaning “harmoniously in advance; in a way intended to ensure harmony beforehand.”","zh":"一个很少见的副词，意为“事先以和谐的方式；为了提前保证和谐而……”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare, often nonstandard) In a harmonious way beforehand; in advance in a way meant to create or preserve harmony.","zh":"（罕见，常被视为非标准用法）以“事先保持/营造和谐”的方式；在事情发生前就和谐地（安排、协调）。"},"examples":[{"en":"The team agreed preharmoniously on rules for speaking, so meetings stayed calm.","zh":"团队事先以和谐的方式约定了发言规则，所以会议一直很平和。"},{"en":"They tried to solve conflicts preharmoniously by setting clear expectations early.","zh":"他们尝试通过尽早设定明确期望来“事先和谐地”化解冲突。"}]}],"synonyms":["in advance","beforehand","preemptively","harmoniously beforehand"],"phonetic":"/ˌpriːhɑrˈmoʊniəsli/","extraExplanation":["这个词由 pre-（“在……之前”）+ harmoniously（“和谐地”）构成，但在现代英语中非常少见，读者可能觉得别扭或不地道。更自然的表达通常是：in advance to keep things harmonious（为了保持和谐而提前……）、harmoniously beforehand（事先和谐地……）、to prevent conflict early（尽早避免冲突）。","多见于刻意造词、修辞或特定写作风格中，用来强调“还没发生就先把关系/氛围协调好”。"]}
{"word":"preharmoniousness","summary":{"en":"Preharmoniousness means a prior or already-present harmony—being harmonious in advance (rare).","zh":"preharmoniousness 指“预先/先在的和谐状态”，表示在事情展开之前就存在的和谐（很少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being harmonious in advance; an earlier or prior harmony (a very rare, often theoretical word)","zh":"预先和谐的状态；在某事发生之前就呈现出的（或被设想的）和谐（非常罕见、偏理论性的词）"},"examples":[{"en":"The critic praised the novel’s preharmoniousness, saying the themes feel unified even before the plot fully begins.","zh":"评论家称赞这部小说的“预先和谐感”，认为主题在情节完全展开之前就已显得统一。"},{"en":"In some philosophical writing, preharmoniousness refers to a sense of order that seems to exist before experience.","zh":"在一些哲学写作中，“预先和谐”指一种仿佛先于经验而存在的秩序感。"}]}],"synonyms":["preexisting harmony","prior harmony","underlying harmony","orderliness"],"phonetic":"/ˌpriːhɑrˈmoʊniəsnəs/","extraExplanation":["这个词极少见，多为“临时造词/学术写作中的造词”。常见结构是：pre-（预先）+ harmonious（和谐的）+ -ness（名词后缀，表示“……的性质/状态”）。","更常用、更自然的表达通常是：preexisting harmony（既存的和谐）、prior harmony（先前的和谐）、a sense of harmony beforehand（事先的和谐感）。如果你在论文或文学评论里使用它，最好先给出简短定义。"]}
{"word":"preharmony","summary":{"en":"Preharmony is a rare term meaning a preliminary or early form of harmony—especially in linguistics (sound/vowel harmony) and sometimes in music (harmonic preparation).","zh":"Preharmony 是较少见的术语，指一种“预先的/初步的和谐”，常用于语言学（语音/元音和谐），有时也用于音乐（和声铺垫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics, rare) A kind of partial or preliminary sound agreement (often vowel harmony) that happens before the main harmony pattern is fully applied in a word.","zh":"（语言学，较少见）一种“预先的/初步的”和谐现象（常指元音和谐），指在一个词中，主要的和谐规则完全体现之前就已出现的部分同化/协调。"},"examples":[{"en":"In some analyses, the first vowel shows preharmony, hinting at the harmony class of the suffix.","zh":"在一些分析中，第一个元音出现“预和谐”，暗示后缀将属于哪一类元音和谐。"},{"en":"The researcher argues that preharmony is not a separate rule but an early stage of the same harmony process.","zh":"研究者认为预和谐并不是独立规则，而是同一和谐过程的早期阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music, very rare) Harmonic preparation that comes before a main harmonic goal (such as a cadence), creating a sense of approach.","zh":"（音乐，极少见）在主要和声目标（如终止式）之前的和声铺垫，用来营造“逐步接近”的感觉。"},"examples":[{"en":"The passage functions as preharmony, setting up the tension before the cadence.","zh":"这一段起到预和声的作用，在终止式前先建立张力。"}]}],"synonyms":["pre-harmony","anticipatory harmony (in some linguistic contexts)","harmonic preparation (music)"],"phonetic":"/ˌpriˈhɑrməni/","extraExplanation":["“preharmony”不是日常英语词汇，多见于学术写作；更常见的写法是加连字符的“pre-harmony”。","在语音学/音系学里，它通常和“harmony（和谐）”类现象一起讨论（如 vowel harmony 元音和谐）；作者用它来强调“还没完全成形、但已提前显现的和谐特征”。","如果你是在某篇论文里看到该词，建议同时查看作者对它的定义，因为不同研究可能用它指不同的“前置/预备”同化现象。"]}
{"word":"preharsh","summary":{"en":"“Preharsh” is not standard English; it’s likely a typo or a creative form meaning “before becoming harsh” or “harsh too early.”","zh":"“preharsh”不是标准英语；多半是拼写错误或临时造词，可理解为“变得严厉/刺耳之前”或“过早地严厉/刺耳”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a typo or an ad‑hoc (made-up) form meaning “before becoming harsh” or “harsh too early.”","zh":"不是标准英语单词；通常是拼写错误或临时造词，可被理解为“在变得严厉/刺耳之前”或“过早地严厉/刺耳”。"},"examples":[{"en":"I think you meant “too harsh,” not “preharsh.”","zh":"我觉得你想说的是“too harsh（太严厉/太刺耳）”，而不是“preharsh”。"},{"en":"If you really mean “before it becomes harsh,” you could write “pre-harsh” or “not yet harsh.”","zh":"如果你确实想表达“在它变得刺耳/严厉之前”，可以写“pre-harsh”或“not yet harsh（尚不刺耳/严厉）”。"}]}],"synonyms":["too harsh","overly harsh","not yet harsh","before it becomes harsh"],"phonetic":"ˌpriˈhɑrʃ","extraExplanation":["“pre-”是常见前缀，意思是“在……之前”（例如 prewar 战前，prepaid 预付）。但“preharsh”几乎不作为固定词出现；更自然的表达通常是“too harsh（太严厉/刺耳）”“overly harsh（过于严厉）”“prematurely harsh（过早地变得严厉）”或“not yet harsh（还不严厉/还不刺耳）”。","如果这是某个专业领域或特定社群的术语，请告诉我它出现的句子和语境（比如写作、评论、音乐/声音描述等），我可以帮你判断最贴切的标准表达。"]}
{"word":"preharshness","summary":{"en":"A rare, nonstandard noun meaning the early stage or hint before something becomes harsh.","zh":"一个罕见、非标准名词，指某事变得严厉/严酷之前的早期阶段或预兆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The state or period before something becomes harsh; early signs of harshness.","zh":"（罕见、非标准用法）在某事变得严厉/刺耳/苛刻之前的状态或阶段；严厉的早期迹象。"},"examples":[{"en":"Before the manager’s tone turned openly harsh, there was a kind of preharshness in his short, clipped replies.","zh":"在经理的语气明显变得严厉之前，他简短、生硬的回答里已经透出一种“严厉前兆”。"},{"en":"The novel captures the preharshness of winter—thin ice, sharp wind, and early darkness.","zh":"这部小说写出了冬天的“严酷前奏”——薄冰、刺骨的风和提早降临的黑暗。"}]}],"synonyms":["early signs of harshness","a hint of harshness","the beginnings of harshness","lead-up"],"phonetic":"/priːˈhɑrʃnəs/","extraExplanation":["这是一个很少见的构词，通常不是词典里的标准词：pre-（“在……之前/预先”）+ harshness（“严厉/刺耳/严酷”）。在写作中它更像是临时造词（nonce word），用来强调“严厉/严酷尚未完全到来，但迹象已出现”的感觉。","更自然的替代表达（根据语境选择）：the beginnings of harshness（严厉的开端）、early signs of harshness（严厉的早期迹象）、a hint/trace of harshness（一丝严厉）、the lead-up to harsher conditions（更严酷环境到来前的阶段）。"]}
{"word":"preharvest","summary":{"en":"Preharvest means “before harvest,” usually describing actions, conditions, or rules related to crops before they are collected.","zh":"preharvest 指“收获前”，常用来描述作物收割之前的措施、情况或规定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before crops are harvested (often in farming, food safety, or crop management).","zh":"收获前的；在作物收割之前进行的（常用于农业、食品安全或作物管理）。"},"examples":[{"en":"Preharvest testing helps farmers check pesticide levels before picking the fruit.","zh":"收获前检测帮助农民在采摘水果前检查农药残留水平。"},{"en":"Good preharvest planning can improve yield and reduce waste.","zh":"良好的收获前规划可以提高产量并减少浪费。"}]}],"synonyms":["pre-harvest","before harvest"],"phonetic":"/ˌpriːˈhɑːrvɪst/","extraExplanation":["“Preharvest”多见于农业与食品供应链语境，例如“preharvest interval (PHI) / 收获前间隔期”，指施用农药后到允许收获之间必须等待的时间，用来降低残留风险。","拼写上也常写作“pre-harvest”。在学术或法规文件中更常见，日常口语里通常会说“before harvest”。"]}
{"word":"prehatred","summary":{"en":"“Prehatred” means hatred that existed beforehand; it’s rare, and “pre-existing/prior hatred” is more natural.","zh":"“prehatred”指“事先就存在的仇恨”，但用法少见；更自然的说法是“pre-existing/prior hatred”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hatred that already exists before a particular event, relationship, or new information (a rare, nonstandard word; more often expressed as “pre-existing hatred” or “prior hatred”).","zh":"在某个事件、关系或新信息出现之前就已经存在的仇恨（很少见、非标准用词；更常说“pre-existing hatred / prior hatred”）。"},"examples":[{"en":"The debate didn’t create hostility—it revealed prehatred that had been there for years.","zh":"这场辩论并没有制造敌意——它只是暴露了多年来就存在的“先在仇恨”。"},{"en":"Because of prehatred between the two groups, even small misunderstandings felt threatening.","zh":"由于两群人之间早已有仇恨，即使是小误会也显得充满威胁。"}]}],"synonyms":["pre-existing hatred","prior hatred","longstanding hatred","deep-seated hatred","prejudice"],"phonetic":"/priˈheɪtrɪd/","extraExplanation":["“prehatred”不是常见词，写作中容易显得生硬或不地道。更自然的表达通常是：pre-existing hatred（既有/早已存在的仇恨）、prior hatred（先前的仇恨）、longstanding hatred（长期的仇恨）、deep-seated hatred（根深蒂固的仇恨）。","如果你想强调“在看到事实之前就先入为主地讨厌/敌视”，也可用更常见的词组：prejudice（偏见）、preconceived hostility（先入为主的敌意）。"]}
{"word":"prehaunt","summary":{"en":"“Prehaunt” is a rare verb meaning to haunt someone’s mind beforehand, or (less commonly) to haunt a place in advance.","zh":"“Prehaunt”是个罕用动词，指某种念头/恐惧在事情发生前就萦绕心头；较少见地也可指提前在某地“出没/作祟”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To haunt or trouble someone’s mind in advance; to be a persistent thought or fear before something happens.","zh":"（罕用）在事情发生之前就萦绕心头、预先困扰（某人）；提前成为挥之不去的念头或恐惧。"},"examples":[{"en":"Even before the trial began, doubts prehaunted him every night.","zh":"审判还没开始，疑虑就每晚预先萦绕着他。"},{"en":"A sense of loss seemed to prehaunt the family long before the news arrived.","zh":"噩耗传来之前，家人似乎就已被一种失落感提前缠绕。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To visit or frequent a place beforehand; to haunt in advance.","zh":"（罕用）提前出没于（某地）；事先常去某处（像“出没/徘徊”那样）。"},"examples":[{"en":"In the story, the ghost is said to prehaunt the hallway before the house is even built.","zh":"在故事里，据说鬼魂在房子尚未建成前就已提前出没在走廊。"}]}],"synonyms":["forebode","preoccupy","weigh on","loom over","haunt"],"phonetic":"/priˈhɔnt/","extraExplanation":["“prehaunt”由前缀 pre-（“在……之前”）+ haunt（“萦绕/作祟/出没”）构成，属于非常少见的词，多见于文学化或刻意营造氛围的写作。日常英语更常用的表达是：be haunted by (thoughts), be preoccupied with, forebode, loom over, weigh on someone。"]}
{"word":"prehaunted","summary":{"en":"Prehaunted means “already haunted in advance,” often used creatively to describe an eerie feeling or a sense of inevitable trouble before it happens.","zh":"prehaunted 指“提前就像闹鬼一样”，常用于创意写作，形容在事情发生前就出现的诡异氛围或难以避免的不安。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary/creative) Seeming to be haunted before anything “haunting” has happened; already shadowed by an eerie, ghostlike feeling in advance.","zh":"（文学/创意用语）在事情发生前就仿佛闹鬼；提前被一种诡异、幽灵般的气氛所笼罩。"},"examples":[{"en":"The empty hallway felt prehaunted, as if it remembered footsteps that never came.","zh":"那条空荡的走廊有种“预先闹鬼”的感觉，仿佛记得从未到来的脚步声。"},{"en":"Even in daylight, the house looked prehaunted—too quiet, too still.","zh":"即使在白天，那栋房子也像是“预先闹鬼”——安静得过头，静止得不自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Marked in advance by a sense of loss, fear, or inevitability; as if the future is already “haunting” the present.","zh":"（比喻）提前被失落、恐惧或宿命感所影响；仿佛未来已经在“纠缠”当下。"},"examples":[{"en":"Her smile was prehaunted by the goodbye she couldn’t yet say.","zh":"她的微笑里带着一种“预先闹鬼”的告别感——那句再见她还说不出口。"},{"en":"The town had a prehaunted calm before the storm.","zh":"暴风雨来临前，小镇有一种“预先闹鬼”的平静。"}]}],"synonyms":["eerie","spooky","uncanny","foreboding","omen-filled"],"phonetic":"/ˌpriˈhɔntɪd/","extraExplanation":["“pre-”表示“在……之前/预先”，与“haunted（闹鬼的；被困扰的）”组合，形成一种带文学色彩的造词。它不算常见标准词，更常用于小说、诗歌、影评等，强调“还没发生就已经有阴影/余波”的氛围。","与常见的“haunted”相比，“prehaunted”更强调时间感（提前的幽灵感）与预兆感（预感、命运、未发生的创伤）。"]}
{"word":"prehaustorium","summary":{"en":"A prehaustorium is the early, not-yet-fully-penetrating form of a parasitic feeding/attachment organ (a developing haustorium).","zh":"prehaustorium 指寄生体在尚未完全侵入寄主前形成的早期吸器结构（吸器的前期/发育阶段）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) An early or preliminary haustorium: a young attachment/feeding organ formed by a parasitic plant (or fungus) before it fully penetrates and connects to the host’s tissues.","zh":"（植物学）前吸器：寄生植物（或真菌）在完全侵入并与寄主组织建立连接之前形成的早期/预备性吸器结构，用于附着并准备吸收养分。"},"examples":[{"en":"Under the microscope, the parasite formed a prehaustorium at the point where it touched the host root.","zh":"在显微镜下，可以看到寄生体在接触寄主根部的位置形成了前吸器。"},{"en":"The prehaustorium develops first, and later it becomes a functional haustorium that draws nutrients from the host.","zh":"前吸器先形成，随后发育成能够从寄主吸收养分的真正吸器。"}]}],"synonyms":["early haustorium","developing haustorium"],"phonetic":"/ˌpriːhɔːˈstɔːriəm/","extraExplanation":["“pre-”表示“在……之前/早期”，而“haustorium（吸器）”来自拉丁语 *haurire*（汲取、吸取）。因此 *prehaustorium* 字面意思就是“吸器形成前的阶段”。","该词多见于寄生植物研究（如菟丝子、列当科相关文献）以及植物病理学/真菌学论文中，日常英语里很少使用。","相关术语：*haustorium*（吸器，成熟的吸收结构）、*parasitic plant*（寄生植物）、*host tissue*（寄主组织）、*penetration*（侵入/穿透）。"]}
{"word":"prehazard","summary":{"en":"A rare technical word meaning “before a hazard,” often in safety and risk-prevention contexts.","zh":"一个较少见的技术用词，意思是“危险发生之前”，多用于安全与风险预防语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; technical) Happening or done before a potential danger is present or before a hazardous step begins; used to prevent accidents.","zh":"（罕见；技术用语）在潜在危险出现之前、或在进入危险步骤之前进行的；用于预防事故。"},"examples":[{"en":"The team used a prehazard checklist before starting the chemical mixing process.","zh":"团队在开始化学混合流程前使用了预危险检查清单。"},{"en":"Prehazard training helps new workers recognize risks early.","zh":"预危险培训能帮助新员工更早识别风险。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A stage or period before a hazard occurs; the time when people can still take preventive action.","zh":"（罕见）危险发生之前的阶段/时期；仍可采取预防措施的时间。"},"examples":[{"en":"During the prehazard period, officials issued warnings and prepared shelters.","zh":"在危险来临前的阶段，官员发布预警并准备避难所。"}]}],"synonyms":["pre-hazard","preventive","proactive","pre-incident"],"phonetic":"/ˌpriˈhæzɚd/","extraExplanation":["“prehazard”不是日常英语里的常用词，更常见的表达是“pre-hazard”（带连字符）或直接说“before a hazard / before the hazardous step”。在安全工程与职业健康领域，相关常见搭配包括：pre-hazard analysis（预危险分析）、hazard assessment（危险评估）、risk mitigation（风险缓解/降低）。"]}
{"word":"prehazardous","summary":{"en":"“Prehazardous” means ‘before hazardous’—an early condition or sign that could turn dangerous.","zh":"“prehazardous”表示“尚未危险但可能发展成危险的早期状态/信号”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or occurring before something becomes hazardous; relating to an early stage where danger could develop.","zh":"在变得危险之前的；指危险可能形成但尚未达到危险程度的早期阶段。"},"examples":[{"en":"Regular maintenance helps detect prehazardous conditions before accidents happen.","zh":"定期维护有助于在事故发生前发现潜在的早期危险状况。"},{"en":"The report lists prehazardous signs, like small chemical leaks and unusual odors.","zh":"报告列出了早期危险信号，例如轻微化学品泄漏和异常气味。"}]}],"synonyms":["potentially hazardous","incipient","unsafe","at-risk","danger-prone"],"phonetic":"/ˌpriːˈhæzərdəs/","extraExplanation":["“prehazardous”不是日常高频词，更常见的表达有“potentially hazardous（可能有危险的）”“incipient hazard（初现的危险）”“hazard precursor（危险前兆）”。在安全生产、环境监测、职业健康等语境中，为了强调“尚未到危险程度但正在朝危险发展”，会使用这类前缀 pre-（在……之前）构成的形容词。"]}
{"word":"preheal","summary":{"en":"“Preheal” means to heal in advance (informal, mostly gaming).","zh":"“preheal”指“预先治疗/预读治疗”，属非正式用法，多见于游戏语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Informal, rare) To heal someone in advance or ahead of expected damage/need; to apply healing preemptively (often used in online games).","zh":"（非正式，用法少见）预先治疗；在预计会受伤/掉血之前先进行治疗（常见于网络游戏语境）。"},"examples":[{"en":"In raids, healers sometimes preheal the tank before a big hit lands.","zh":"在团本里，治疗有时会在坦克吃到大伤害前先预读治疗。"},{"en":"The medic tried to preheal the team by giving them support items before the fight.","zh":"医疗兵试着在开战前用支援物品给队友“预先治疗”。"}]}],"synonyms":["pre-heal","heal preemptively","preemptively heal","pre-treat"],"phonetic":"ˌpriːˈhiːl","extraExplanation":["“preheal”不是标准英语里很常见的词，更常见的写法是带连字符的“pre-heal”，且多出现在游戏、论坛或口语化表达中。","如果你原本想写的是厨房用语“preheat（预热）”，那是完全不同的词，例如：Preheat the oven to 350°F.（把烤箱预热到350华氏度。）"]}
{"word":"prehearing","summary":{"en":"Prehearing refers to a meeting or procedure before a formal hearing, often in legal or administrative cases.","zh":"Prehearing 指正式听证会之前的预备会议或程序步骤，常用于法律或行政案件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A meeting, conference, or procedural step that happens before a formal legal hearing to organize issues, evidence, or schedules.","zh":"（法律）正式听证会之前举行的预备会议或程序步骤，用来整理争议点、证据或时间安排。"},"examples":[{"en":"The judge set a prehearing to decide what evidence could be used later.","zh":"法官安排了一次预备听证（会），以决定之后哪些证据可以使用。"},{"en":"During the prehearing conference, both sides agreed on a timeline.","zh":"在预备会议上，双方就时间表达成一致。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening or used before a formal hearing.","zh":"（形容）发生在正式听证会之前的；用于听证会之前的。"},"examples":[{"en":"Please submit your prehearing statement by Friday.","zh":"请在周五前提交你的听证前陈述。"},{"en":"The agency issued prehearing instructions to the parties.","zh":"该机构向各方发布了听证前指引。"}]}],"synonyms":["prehearing conference","preliminary hearing (context-dependent)","preliminary conference","case management conference (similar purpose)"],"phonetic":"/ˌpriːˈhɪrɪŋ/","extraExplanation":["prehearing 常见于美国法律与行政程序语境（如劳动仲裁、移民、监管机构案件）。目的通常是让双方“把事情说清楚、把材料准备好”，例如：确认争议点、交换证据（discovery/交换材料）、讨论是否和解、安排证人和日程等。","常见搭配：prehearing conference（听证前会议）、prehearing statement（听证前陈述）、prehearing order（听证前命令/指令）。写作中也常见连字符形式：pre-hearing。"]}
{"word":"preheat","summary":{"en":"“Preheat” means to heat something in advance, especially an oven or pan before cooking.","zh":"“preheat”指在使用前先加热，尤指烹饪前预热烤箱或锅。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to heat (an oven, pan, or another thing) before using it, so it is ready at the right temperature","zh":"（在使用前）预热（烤箱、平底锅或其他器具），使其达到合适温度"},"examples":[{"en":"Preheat the oven to 350°F before you put the cookies in.","zh":"把饼干放进去之前，把烤箱预热到350华氏度。"},{"en":"I preheated the pan so the eggs wouldn’t stick.","zh":"我先把锅预热，这样鸡蛋就不容易粘锅。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become heated in advance (before being used)","zh":"（器具）提前升温、预热（到可使用的状态）"},"examples":[{"en":"Let the oven preheat for 10 minutes.","zh":"让烤箱预热10分钟。"}]}],"synonyms":["warm up","heat up (beforehand)"],"phonetic":"/priːˈhiːt/","extraExplanation":["pre- 是常见前缀，表示“在……之前”；heat 表示“加热”。合起来 preheat 就是“提前加热”。","烹饪语境里很常见：烤箱预热能让食物从一开始就处在稳定温度，影响烘焙膨胀、上色与熟成效果。"]}
{"word":"preheated","summary":{"en":"“Preheated” means already heated in advance; commonly used for ovens or pans.","zh":"“preheated”指“已经预先加热过的”，常用于烤箱或锅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"heated in advance to a particular temperature (often before cooking or using a machine).","zh":"预先加热到某个温度的（常用于烹饪或机器使用前）。"},"examples":[{"en":"Put the cake batter into a preheated oven at 350°F (175°C).","zh":"把蛋糕面糊放入预热至350°F（175°C）的烤箱里。"},{"en":"Using a preheated pan helps the food cook more evenly.","zh":"用预热过的锅能让食物受热更均匀。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “preheat”: to heat something in advance.","zh":"“preheat”的过去式/过去分词：在使用前把……预先加热。"},"examples":[{"en":"I preheated the oven while I prepared the vegetables.","zh":"我在处理蔬菜的时候把烤箱预热了。"},{"en":"The oven should be preheated for at least 10 minutes.","zh":"烤箱应至少预热10分钟。"}]}],"synonyms":["warmed up","heated beforehand"],"phonetic":"/ˌpriːˈhiːtɪd/","extraExplanation":["在食谱里常见的表达是“Preheat the oven to …”，意思是先把烤箱升到指定温度再开始烘烤，这样更容易保证时间与成品效果。","“pre-”是英语里表示“在……之前”的前缀：preheat（预热）、prepay（预付）、preview（预览）。"]}
{"word":"preheater","summary":{"en":"A preheater is a device or feature that heats something ahead of time to improve efficiency or prepare for use.","zh":"preheater 指“预热器/预热装置”，用于在正式加热或使用前先把介质或设备加热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that warms something in advance (often air, water, fuel, or materials) before it enters the main heater, furnace, boiler, or processing unit.","zh":"预热器：在进入主要加热设备（如炉子、锅炉或工艺装置）之前，用来提前加热空气、水、燃料或物料的装置。"},"examples":[{"en":"The boiler runs more efficiently with a preheater that warms the incoming water.","zh":"锅炉配有预热器来加热进水，会运行得更高效。"},{"en":"In many factories, a preheater heats air before it goes into the furnace.","zh":"在许多工厂里，预热器会先把空气加热，再送入炉膛。"}]},{"partOfSpeech":"n.","definition":{"en":"A heating component or setting that preheats an appliance (especially an oven) before cooking or use.","zh":"（尤指烤箱等电器的）预热功能/预热装置：在使用或烹饪前先把设备加热到所需温度的部件或设置。"},"examples":[{"en":"Turn on the oven’s preheater and wait until it reaches 350°F.","zh":"打开烤箱的预热功能，等它升到350华氏度。"},{"en":"The recipe says the preheater should run for ten minutes before baking.","zh":"食谱说烘焙前要先预热十分钟。"}]}],"synonyms":["preheating unit","heater (general)","air preheater","feedwater heater"],"phonetic":"/ˈpriːˌhiːtɚ/","extraExplanation":["“preheater”通常用于工程与工业语境（如锅炉、换热器、炉窑系统），家用场景更常见的说法是动词“preheat”（预热）或名词“preheating”（预热过程）。","构词法：pre-（在……之前）+ heater（加热器）。在技术文档里也常见更具体的词，如“air preheater（空气预热器）”“feedwater preheater（给水预热器）”。"]}
{"word":"preheating","summary":{"en":"Preheating means heating something ahead of time before using it, especially an oven or pan.","zh":"preheating 指在使用前先把设备或器具（尤指烤箱、锅）加热到合适温度的“预热”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of heating an oven, pan, engine, or other equipment to a certain temperature before you use it.","zh":"（使用前）预热：在开始使用烤箱、锅、发动机或设备之前，先加热到一定温度的过程。"},"examples":[{"en":"Preheating the oven to 350°F helps the cake bake evenly.","zh":"把烤箱预热到350华氏度有助于蛋糕受热均匀。"},{"en":"The recipe starts with preheating a pan before adding the oil.","zh":"食谱第一步是先预热平底锅，再倒入油。"},{"en":"In cold weather, preheating the car can make it run more smoothly.","zh":"天气冷时，给汽车预热可能会让运转更顺畅。"}]},{"partOfSpeech":"v.","definition":{"en":"Heating something in advance before the main cooking or operation begins.","zh":"预先加热（动作）：在主要烹饪或操作开始前先把某物加热。"},"examples":[{"en":"I’m preheating the oven now—give me five minutes.","zh":"我现在在预热烤箱——给我五分钟。"},{"en":"She preheated the skillet so the vegetables would sear quickly.","zh":"她先把煎锅预热好，这样蔬菜能快速煎出焦香。"}]}],"synonyms":["warming up","preheating (an oven/pan)","heating in advance"],"phonetic":"/ˌpriːˈhiːtɪŋ/","extraExplanation":["“pre-”表示“在……之前”，“heat”是“加热”。日常最常见的搭配是 preheat the oven（预热烤箱）和 preheat the pan/skillet（预热锅）。","与 warm up（热身/预热）相比，preheat 更偏向“按目标温度提前加热”，常见于烹饪、烘焙和设备操作说明。"]}
{"word":"preheats","summary":{"en":"“Preheats” means “heats something beforehand,” commonly used for ovens, pans, or water.","zh":"“preheats”表示“预热”，常用于烤箱、锅或水等在正式使用前先加热。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to heat something in advance before using it or before the main cooking/heating step","zh":"（在使用或主要加热/烹饪前）预热，使提前变热"},"examples":[{"en":"She preheats the oven to 350°F before baking the cake.","zh":"她在烤蛋糕前把烤箱预热到350°F。"},{"en":"The system preheats the water to save time.","zh":"这个系统会先把水预热，以节省时间。"},{"en":"He preheats the pan so the vegetables cook quickly.","zh":"他先把锅预热，这样蔬菜能更快炒熟。"}]}],"synonyms":["warm up","heat up (beforehand)"],"phonetic":"/priˈhits/","extraExplanation":["“preheats”是动词“preheat”的第三人称单数形式（he/she/it preheats）。常见于食谱和说明书：preheat the oven（预热烤箱）、preheat the pan（预热锅）。","烘焙里预热很关键：温度稳定后再放入食物，受热更均匀、成品更稳定。"]}
{"word":"prehemiplegic","summary":{"en":"Prehemiplegic describes the stage or symptoms occurring before one-sided paralysis (hemiplegia) develops.","zh":"prehemiplegic 用于描述偏瘫发生之前的阶段或症状（多见于医学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) relating to the time before hemiplegia (paralysis of one side of the body) develops, often describing early symptoms or a stage before a stroke-related paralysis.","zh":"（医学）指偏瘫（身体一侧瘫痪）发生之前的阶段或状态，常用于描述在中风等导致偏瘫前出现的早期症状或时期。"},"examples":[{"en":"The patient reported prehemiplegic warning signs such as sudden weakness and slurred speech.","zh":"患者报告了偏瘫前的预警症状，如突然无力和言语含糊。"},{"en":"In the prehemiplegic phase, doctors focus on urgent evaluation to prevent permanent damage.","zh":"在偏瘫前阶段，医生会紧急评估，以尽量避免永久性损伤。"}]}],"synonyms":["prodromal","premonitory","preparalytic"],"phonetic":"/ˌpriˌhɛməˈplidʒɪk/","extraExplanation":["“pre-”表示“在……之前”，“hemi-”表示“一半/一侧”，“plegic/plegia”与“瘫痪”有关。合起来就是“偏瘫发生之前的”。","该词较少用于日常英语，更多见于医学记录或学术语境中。更常见的表达可能是“before hemiplegia”或“prodromal (early warning) stage of stroke”。"]}
{"word":"prehend","summary":{"en":"Prehend is a rare formal verb meaning “grasp/understand,” and sometimes “seize physically.”","zh":"prehend 是个罕见的正式动词，主要表示“理解/把握”，有时也指“（身体上）抓住”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, formal) To grasp or understand something; to comprehend.","zh":"（罕见、正式）理解；领会；把握（某事）。"},"examples":[{"en":"At first, the theory was difficult to prehend, but the examples made it clearer.","zh":"起初这个理论很难理解，但例子让它更清楚了。"},{"en":"She tried to prehend the poet’s meaning by reading the line aloud.","zh":"她试着把诗句大声读出来，以领会诗人的意思。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To seize, grasp, or take hold of something physically.","zh":"（罕见）抓住；握住；（身体上）把某物抓在手里。"},"examples":[{"en":"The tool is designed to prehend small objects without slipping.","zh":"这种工具被设计用来稳稳抓取小物体而不打滑。"}]}],"synonyms":["understand","grasp","comprehend","seize","take hold of"],"phonetic":"/prɪˈhɛnd/","extraExplanation":["“prehend”在现代英语中非常少见，多见于学术或技术语境。更常用的表达是“understand / grasp / comprehend”。","词源来自拉丁语 prehendere（抓住）。因此它既可指“抓住（具体的东西）”，也可引申为“抓住要点→理解”。","你更可能在含有这个词根的常用词里见到它：comprehend（完全理解）、apprehend（理解；也可指逮捕）、prehensile（能抓握的，如某些动物的尾巴）。"]}
{"word":"prehended","summary":{"en":"“Prehended” means “grasped” or “understood,” but it’s rare in modern everyday English.","zh":"“prehended”表示“抓住”或“理解/领会”，但在现代日常英语中很少用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense / past participle of **prehend**: to grasp, seize, or take hold of something (often used in a mental/intellectual sense: to understand or apprehend).","zh":"**prehend** 的过去式/过去分词：抓住、握住；（常指在思想上）理解、领会。"},"examples":[{"en":"She quickly **prehended** the main idea of the article.","zh":"她很快就**领会**了文章的主旨。"},{"en":"In the dark, he **prehended** the rope with his left hand.","zh":"在黑暗中，他用左手**抓住**了绳子。"}]}],"synonyms":["grasped","seized","understood","apprehended","comprehended"],"phonetic":"/priˈhɛndɪd/","extraExplanation":["“prehend”在现代英语里非常少见，更常用的是 **grasp / seize**（抓住）和 **understand / comprehend / apprehend**（理解）。","词源来自拉丁语 *prehendere*（抓住），同源词包括 **comprehend**（完全抓住→理解）和 **apprehend**（抓住→逮捕/理解）。","在哲学语境中（尤其是怀特海 Alfred N. Whitehead 的过程哲学），常见名词 **prehension**（“摄取/把握”），表示主体对经验或世界的“把握/吸纳”。"]}
{"word":"prehendere","summary":{"en":"*Prehendere* is a Latin verb meaning “to seize/grasp,” and it is the root behind English words like “apprehend” and “comprehend.”","zh":"*prehendere* 是拉丁语动词，意为“抓住/握住”，也是英语 apprehend、comprehend 等词的词源根。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Latin) to seize, grasp, or catch; to take hold of something physically or mentally (a root behind words like “apprehend” and “comprehend”).","zh":"（拉丁语）抓住、握住、逮住；也可引申为“把握/理解”（是 apprehend、comprehend 等词的词根来源）。"},"examples":[{"en":"In Latin, *prehendere* means “to seize” or “to grasp.”","zh":"在拉丁语中，*prehendere* 的意思是“抓住/握住”。"},{"en":"The English verb “apprehend” originally carried the idea of “seizing,” from *ad-* + *prehendere*.","zh":"英语动词 “apprehend” 最初带有“抓住/捕获”的含义，来自 *ad-* + *prehendere*。"},{"en":"“Comprehend” comes from *com-* + *prehendere*, literally “to grasp together,” meaning “to understand.”","zh":"“Comprehend” 来自 *com-* + *prehendere*，字面是“把……一起抓住”，引申为“理解”。"}]}],"synonyms":["seize","grasp","catch","take hold of"],"phonetic":"/priˈhɛn.dɚ.i/","extraExplanation":["*prehendere* 常被当作英语词源学习中的“词根动词”来记：它的核心意象是“用手抓住”。英语里很多抽象意义（如“理解、领会”）常用“抓住一个想法/概念”来比喻，所以从“抓住”自然发展出“理解”。","常见派生/相关词：**prehensile**（可抓握的，如“卷尾猴有可抓握的尾巴”）、**apprehend**（逮捕；理解；担忧）、**comprehend**（理解）、**reprehend**（责备，较正式）。","如果你在英语文章里看到 *prehendere*，通常是出现在词源解释、语言学或古典学语境，而不是日常英语词汇。"]}
{"word":"prehensibility","summary":{"en":"Prehensibility means the quality or degree of being understandable, though “comprehensibility” is more common in everyday English.","zh":"prehensibility 指“可理解性/易懂程度”，但在日常英语中更常用的说法是 comprehensibility。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being easy to understand; how understandable something is.","zh":"可理解性；易懂程度（某事物有多容易被理解）。"},"examples":[{"en":"The teacher checked the prehensibility of the reading by asking a few simple questions.","zh":"老师通过问几个简单问题来检查这篇阅读的可理解性。"},{"en":"Good diagrams can improve the prehensibility of a report.","zh":"好的图表能提高报告的可理解性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The degree to which a listener or reader can grasp meaning in real communication.","zh":"（较少见）在真实交流中听者或读者能把握意义的程度。"},"examples":[{"en":"Speaking slowly increased the prehensibility of the instructions for new employees.","zh":"说得慢一些提高了新员工对指示内容的可理解程度。"}]}],"synonyms":["comprehensibility","understandability","clarity","intelligibility"],"phonetic":"/prɪˌhɛn.səˈbɪl.ə.ti/","extraExplanation":["“prehensibility”在日常英语里不算常用，更常见的说法是“comprehensibility”（可理解性）。","词源上它与拉丁语 *prehendere*（抓住、把握）有关，因此可以把它理解为“能不能把意思抓住”。","语言学习里常见搭配是“comprehensible input（可理解输入）”，强调材料要“略难但仍能理解”，有助于习得。"]}
{"word":"prehensible","summary":{"en":"Prehensible means “able to be understood,” but it is uncommon today; “comprehensible” is more common.","zh":"prehensible 意为“可理解的”，但现代英语中较少用；更常见的是 comprehensible。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be understood; understandable.","zh":"可以被理解的；可懂的。"},"examples":[{"en":"The professor tried to make the theory prehensible for first-year students.","zh":"教授努力让一年级学生也能理解这个理论。"},{"en":"Her explanation was clear and prehensible, even to beginners.","zh":"她的解释清楚易懂，即使是初学者也能明白。"}]}],"synonyms":["understandable","comprehensible","clear","intelligible"],"phonetic":"/prɪˈhɛn.sə.bəl/","extraExplanation":["“prehensible”在现代英语里比较少见，更常用的是“comprehensible（可理解的）”。词根来自拉丁语 prehendere/comprehendere，意思是“抓住、领会”，所以“prehensible”字面上就是“能被领会的”。在正式或学术语境偶尔会看到，但日常写作建议用“understandable / comprehensible”。"]}
{"word":"prehensile","summary":{"en":"“Prehensile” means able to grasp or wrap around something, especially used for an animal’s tail or limbs.","zh":"“Prehensile”指能抓握或缠绕抓住东西的（多用于动物的尾巴或四肢）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to grasp, hold, or wrap around something (often used for a tail, hand, foot, or similar body part).","zh":"（常指尾巴、手、脚等）能抓握、能缠绕以抓住物体的。"},"examples":[{"en":"Some monkeys have prehensile tails that help them swing through trees.","zh":"一些猴子有能抓握的尾巴，帮助它们在树间摆荡。"},{"en":"The chameleon’s prehensile tail can curl around branches for balance.","zh":"变色龙的抓握性尾巴可以缠绕树枝来保持平衡。"}]}],"synonyms":["grasping","gripping","clinging"],"phonetic":"/prɪˈhɛnsaɪl/","extraExplanation":["词源上与“prehend（抓住、理解）”同源，来自拉丁语 prehendere（抓住）。因此它常见于动物学/生物学语境。","常见搭配：prehensile tail（抓握性尾巴）、prehensile hands/feet（可抓握的手/脚）。","也可在比喻意义上形容“能牢牢抓住某物”的东西，但日常英语里更多还是用于生物特征。"]}
{"word":"prehensility","summary":{"en":"Prehensility means the ability to grasp or hold, especially with a tail, trunk, or similar body part.","zh":"Prehensility 指抓握能力，尤用于尾巴、象鼻等身体部位的缠握与抓取特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of an animal body part (such as a tail, trunk, or hand) to grasp or hold things","zh":"（动物身体部位如尾巴、象鼻、手等的）抓握能力、缠握性"},"examples":[{"en":"The monkey’s tail has great prehensility, so it can hold onto branches.","zh":"猴子的尾巴抓握能力很强，所以能抓住树枝。"},{"en":"An elephant’s trunk shows remarkable prehensility when it picks up small objects.","zh":"大象用象鼻捡起小物体时展现出很强的抓握能力。"}]}],"synonyms":["grasping ability","gripping ability","prehensile ability"],"phonetic":"/ˌpriːˌhɛnˈsɪləti/","extraExplanation":["“Prehensility”在日常英语中比较少见，更常用的形式是形容词“prehensile”（如：a prehensile tail 抓握性的尾巴）。写作和阅读中见到“prehensility”时，通常是在动物学/解剖学语境里，用来强调“能抓握”这种特性。","词根来自拉丁语 prehendere，意思是“抓住、握住”。同源词还有“apprehend”（理解、领会；也可指逮捕）和“comprehend”（理解）。"]}
{"word":"prehension","summary":{"en":"Prehension means physical grasping (often in biology/robotics) and, more formally, mental grasping—understanding.","zh":"Prehension 指“抓握”（常见于生物学/机器人学），也可较正式地指“领会、理解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology or formal) the act of grasping or holding something, especially with a hand, tail, or other body part.","zh":"（生物学或较正式）抓握、攫取的动作；尤指用手、尾巴或身体其他部位抓住东西。"},"examples":[{"en":"Monkeys use tail prehension to hold onto branches.","zh":"猴子会用尾巴的抓握能力抓住树枝。"},{"en":"The robot hand was designed for strong prehension.","zh":"这只机器人手被设计成具备强力抓握能力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Formal) the ability to understand or mentally grasp an idea; comprehension.","zh":"（正式）对思想或概念的理解、领会能力；理解力（comprehension）。"},"examples":[{"en":"His prehension of the main argument was quick and accurate.","zh":"他对主要论点的领会很快也很准确。"},{"en":"Clear diagrams can improve students’ prehension of difficult topics.","zh":"清晰的图表能提升学生对难题的理解。"}]}],"synonyms":["grasping","seizing","holding","comprehension","understanding","grasp"],"phonetic":"/prɪˈhɛnʃən/","extraExplanation":["“Prehension”来自拉丁语 *prehendere*（抓住、握住），与常见词 *comprehend*（理解）同源：英语里常用“抓住”来比喻“抓住要点/理解”。","在日常英语中，人们更常说 *grasp*（抓住/理解）或 *comprehension*（理解）。因此在写作与口语里，“prehension”更偏学术或技术语境（如生物学、机器人学、哲学）。"]}
{"word":"prehensive","summary":{"en":"“Pprehensive” is not normally used alone; it appears mainly inside “comprehensive,” meaning complete and covering almost everything.","zh":"“prehensive”通常不单独使用；主要出现在“comprehensive”中，表示“全面的、综合的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Almost always in the word “comprehensive”) complete and including all or nearly all parts, details, or aspects.","zh":"（几乎只出现在“comprehensive”中）全面的、综合的；涵盖几乎所有部分或细节的。"},"examples":[{"en":"This report is comprehensive—it covers costs, risks, and timelines.","zh":"这份报告很全面——涵盖了成本、风险和时间表。"},{"en":"She gave a comprehensive explanation of the problem.","zh":"她对这个问题做了全面的解释。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In schools) involving many subjects or a wide range of abilities; also, a type of school that accepts students of different levels.","zh":"（学校语境）综合性的；（也可指）综合学校（接收不同水平的学生）。"},"examples":[{"en":"He attends a comprehensive school in the UK.","zh":"他在英国读一所综合学校。"},{"en":"The exam is comprehensive, testing multiple subjects.","zh":"这次考试是综合性的，会考多门科目。"}]}],"synonyms":["thorough","complete","all-inclusive","extensive","wide-ranging"],"phonetic":"/ˌkɑːmprəˈhensɪv/","extraExplanation":["“prehensive”本身在现代英语里几乎不单独使用；你看到它通常是把“comprehensive”去掉前缀“com-”后的残片。学习和使用时建议直接记“comprehensive”。","词源提示：com- 表示“共同、全部”，-prehens- 来自拉丁语“prehendere”（抓住、理解）。因此 comprehensive 有“把所有内容都‘抓住/涵盖’”的感觉。","常见搭配：comprehensive plan（全面计划）、comprehensive review（全面审查/回顾）、comprehensive coverage（全面报道/覆盖）、comprehensive exam（综合考试）。"]}
{"word":"prehensiveness","summary":{"en":"Prehensiveness means thoroughness—the quality of covering many parts or details completely.","zh":"prehensiveness 指“周全、全面性”，强调覆盖许多部分或细节，内容很完整。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of covering many details or parts; being thorough and complete.","zh":"涵盖面广、细节充分的特质；周全、全面性。"},"examples":[{"en":"We value the comprehensiveness of the report because it includes data, methods, and clear conclusions.","zh":"我们重视这份报告的全面性，因为它包含数据、方法和清晰的结论。"},{"en":"The course is known for its comprehensiveness, from basic concepts to real-world practice.","zh":"这门课程以内容全面著称，从基础概念到真实世界的实践都有涉及。"}]}],"synonyms":["thoroughness","completeness","breadth","coverage","inclusiveness"],"phonetic":"/ˈpriːhɛnsɪvnəs/","extraExplanation":["“prehensiveness”本身在现代英语中比较少见，更常用的是“comprehensiveness”。两者意义基本一致：表示“全面、周全”。","词根来自拉丁语“prehendere”（抓住、掌握），所以“comprehensive/prehensiveness”有“把内容都‘抓住’、覆盖到”的感觉。正式写作中更推荐用“comprehensiveness”。"]}
{"word":"prehensor","summary":{"en":"A prehensor is a grasping organ (or, rarely, a “grasper”) used to seize and hold things, mainly in biological contexts.","zh":"prehensor 指用于抓握、攫取并持物的器官（罕指抓握者），主要见于生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A grasping organ used to seize or hold things, such as an elephant’s trunk, a monkey’s tail, or an insect’s foreleg.","zh":"（生物）用于抓握、攫取或持物的器官，例如大象的鼻子、猴子的尾巴或昆虫的前足。"},"examples":[{"en":"An elephant’s trunk is a powerful prehensor for lifting food and water.","zh":"大象的鼻子是一种强有力的抓握器官，可以用来提起食物和水。"},{"en":"Some insects use their forelegs as prehensors to capture prey.","zh":"一些昆虫会把前足当作抓握器官来捕捉猎物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person or thing that grasps or seizes.","zh":"（罕用）抓住、攫取的人或物。"},"examples":[{"en":"In older scientific writing, the hand may be described as the human prehensor.","zh":"在较早的科学写作中，手可能被描述为人类的“抓握者/抓握器官”。"}]}],"synonyms":["grasping organ","gripper (informal)","prehensile organ"],"phonetic":"/prɪˈhɛnsɚ/","extraExplanation":["词源上来自拉丁语词根 *prehendere*（抓住、攫取），也常见于相关词：*apprehend*（逮捕/理解）、*comprehend*（理解）、*prehensile*（善于抓握的，如“prehensile tail”能抓握的尾巴）。在现代英语里，*prehensor* 多用于生物学或解剖学语境，日常表达更常用 *grasping organ* 或直接说 *trunk / tail / claw*。"]}
{"word":"prehensorial","summary":{"en":"Prehensorial means “able to grasp,” especially describing a body part used to grip.","zh":"prehensorial 指“能抓握的”，常用来形容用于抓握的身体部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Able to grasp or hold things; relating to an organ (like a hand, tail, or tongue) used for grasping.","zh":"（罕用）能抓握的；与抓握器官（如手、尾巴或舌头）有关的。"},"examples":[{"en":"Some monkeys have a prehensorial tail that helps them grip branches.","zh":"有些猴子有抓握性的尾巴，能帮助它们抓住树枝。"},{"en":"The chameleon’s prehensorial tongue shoots out to catch insects.","zh":"变色龙的抓握性舌头会弹射出去捕捉昆虫。"},{"en":"The report compared the robot’s prehensorial “hand” to a human hand.","zh":"报告把机器人的抓握式“手”与人手作了比较。"}]}],"synonyms":["prehensile","grasping","prehensory"],"phonetic":"/ˌpriːhɛnˈsɔːriəl/","extraExplanation":["“prehensorial”在现代英语里比较少见，更常用的近义词是“prehensile”（能抓握的）。两者都来自拉丁语词根，和“prehend / comprehend（理解、抓住概念）”同源，核心含义都是“抓住、握住”。在生物学、动物学或机器人领域更可能见到这个词。"]}
{"word":"prehensory","summary":{"en":"Prehensory describes something (especially an animal body part) that can grasp or hold.","zh":"prehensory 指（尤指动物身体部位）“能抓握、能攀附”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal body part, especially a tail, hand, or tongue) able to grasp, hold, or wrap around something.","zh":"（多指动物身体部位，如尾巴、手或舌头）能抓握、攀附或缠绕以抓住东西的。"},"examples":[{"en":"Many monkeys have prehensory tails that help them climb trees.","zh":"许多猴子有能抓握的缠绕性尾巴，帮助它们爬树。"},{"en":"A chameleon’s prehensory tongue can shoot out to catch insects.","zh":"变色龙的可抓握舌头能快速弹出捕捉昆虫。"},{"en":"The animal used its prehensory tail to hold onto the branch.","zh":"那只动物用可抓握的尾巴抓住树枝。"}]}],"synonyms":["grasping","clinging","prehensile (close in meaning)"],"phonetic":"/prɪˈhɛn.sɚ.i/","extraExplanation":["词源上与拉丁语 *prehendere*（抓住、握住）有关，也和英语里的 **comprehend**（理解：把意思“抓住”）同源。","常见搭配：**prehensory tail**（缠绕性/可抓握的尾巴）、**prehensory feet/hands**（可抓握的脚/手）。在动物学语境中很常用。"]}
{"word":"prehepatic","summary":{"en":"Prehepatic means “before the liver,” often used in medical contexts about anatomy or causes of disease affecting blood flow to the liver.","zh":"prehepatic 指“肝前的/在肝脏之前的”，多用于医学语境，常描述解剖位置或影响肝脏入血流的病因。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located or occurring before the liver; relating to blood flow or structures upstream of the liver.","zh":"肝前的；发生在肝脏之前的（常指血流或结构在进入肝脏之前的部分）。"},"examples":[{"en":"Prehepatic portal hypertension can be caused by a blood clot in the portal vein.","zh":"肝前性门静脉高压可能由门静脉血栓引起。"},{"en":"The doctor explained that the problem was prehepatic, not inside the liver itself.","zh":"医生解释说问题是肝前性的，并不在肝脏内部。"}]}],"synonyms":["before the liver","pre-liver (informal)"],"phonetic":"/ˌpriːhɪˈpætɪk/","extraExplanation":["这是医学术语，常用于描述“肝脏之前”的解剖位置或病因分类，尤其在讨论门静脉（portal vein）及其血流时常见。与之相对的常用词还有：intrahepatic（肝内的）和 posthepatic（肝后的）。"]}
{"word":"prehepaticus","summary":{"en":"“Prehepaticus” means “before/in front of the liver” (prehepatic).","zh":"“prehepaticus”意为“在肝脏之前/肝前的”（即 prehepatic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical/Latin-based) Located or occurring before the liver; prehepatic.","zh":"（医学/拉丁语系用语）位于肝脏之前的；肝前的。"},"examples":[{"en":"The portal vein brings blood from prehepatic organs to the liver.","zh":"门静脉把来自肝前器官的血液输送到肝脏。"},{"en":"Prehepatic obstruction can reduce blood flow into the liver.","zh":"肝前性阻塞会减少进入肝脏的血流。"}]}],"synonyms":["prehepatic","before the liver"],"phonetic":"/ˌpriːhɪˈpætɪkəs/","extraExplanation":["“prehepaticus”带有拉丁语/新拉丁语色彩：pre- 表示“在……之前”，hepatic- 与“肝脏”有关（源自希腊语 hēpar，意为“肝”）。在现代英文医学写作中更常见的形式是 **prehepatic**（如 prehepatic portal hypertension：肝前性门静脉高压）。","它常用于解剖学或病理生理学的分类：例如把某些原因归为肝前（prehepatic）、肝内（intrahepatic）或肝后（posthepatic）。"]}
{"word":"preheroic","summary":{"en":"Preheroic means “before the heroic age” or, more generally, “before someone/something becomes heroic.”","zh":"preheroic 指“英雄时代之前的”，也可泛指“尚未成为英雄（或尚未被视为英雄）的早期阶段”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in history or archaeology) from a time before the “heroic age,” or before stories of heroes and epic wars became part of a culture’s tradition.","zh":"（尤用于历史或考古语境）指“英雄时代”之前的；或指某种文化形成英雄传说、史诗战争叙事之前的时期。"},"examples":[{"en":"The site contains preheroic pottery that predates the famous warrior legends.","zh":"遗址出土了前英雄时代的陶器，其年代早于著名的武士传说。"},{"en":"Some scholars describe the settlement as preheroic, before centralized kingship developed.","zh":"一些学者把这个聚落称为前英雄时代的，因为当时尚未发展出中央集权的王权。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring before an important person becomes known for heroic actions; early and not yet celebrated as heroic.","zh":"（较少见）指某人尚未以英雄事迹闻名之前的；早期的、尚未被称颂为英雄的。"},"examples":[{"en":"Her journals reveal a preheroic stage of her life, when she doubted herself often.","zh":"她的日记展现了她人生的“前英雄阶段”，那时她经常怀疑自己。"},{"en":"The film focuses on the preheroic years of the leader, before the revolution began.","zh":"这部电影聚焦这位领袖的前英雄岁月，即革命开始之前。"}]}],"synonyms":["pre-heroic","prehistoric (context-dependent)","early","protoheroic (rare)"],"phonetic":"/ˌpriːhəˈroʊɪk/","extraExplanation":["“pre-”表示“在……之前”（如: prewar 战前的）。“heroic”常与“Heroic Age（英雄时代）”相关，指某些文化中以史诗、战争与英雄传说为代表的时期（例如希腊的特洛伊战争传统，或北欧史诗中的英雄叙事）。因此 preheroic 常见于学术写作，强调年代分期或文化阶段。","拼写上通常写作一个词（preheroic），也可见带连字符的写法（pre-heroic），多取决于出版风格。"]}
{"word":"prehesitancy","summary":{"en":"Prehesitancy means a brief or noticeable hesitation before acting or speaking (uncommon word).","zh":"prehesitancy 指在行动或开口之前的犹豫（较少见的用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of pausing or feeling uncertain before you act or speak; a moment of hesitation beforehand","zh":"（在行动或说话之前的）犹豫、迟疑状态；事前的一瞬间停顿"},"examples":[{"en":"There was a brief prehesitancy before she answered the question.","zh":"她回答问题前有一瞬间的犹豫。"},{"en":"His prehesitancy suggested he wasn’t sure about the plan.","zh":"他的事前迟疑暗示他对这个计划并不确定。"}]}],"synonyms":["hesitancy","hesitation","pause","uncertainty","reluctance"],"phonetic":"/ˌpriːˈhɛzɪtənsi/","extraExplanation":["“prehesitancy”比较少见，更常见的表达是“hesitancy / hesitation”。它可以理解为把前缀“pre-（在……之前）”加到“hesitancy（犹豫）”上，用来强调“在做出反应之前就已经出现的迟疑”。在正式写作中，很多人会选择改用更常见的词，以避免读者觉得生僻或像临时造词。"]}
{"word":"prehesitate","summary":{"en":"“Prehesitate” is a nonstandard, informal word meaning to hesitate in advance or overthink before acting.","zh":"“prehesitate”是非标准的非正式说法，意思是“提前犹豫/事前想太多而不敢行动”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Nonstandard, informal) To hesitate in advance; to pause or feel unsure before you actually need to decide or act.","zh":"（非标准、非正式用语）提前犹豫；在真正需要决定或行动之前就先感到不确定、先停住。"},"examples":[{"en":"I always prehesitate before making phone calls, even simple ones.","zh":"我总是在打电话之前就先犹豫一下，哪怕是很简单的电话。"},{"en":"Don’t prehesitate—just ask the question when you’re ready.","zh":"别提前犹豫；你准备好了就直接提问。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Humorous) To overthink so much beforehand that it delays getting started.","zh":"（幽默用法）事前想太多，以至于拖延到迟迟无法开始。"},"examples":[{"en":"He prehesitated for days and never sent the email.","zh":"他事前纠结了好几天，结果邮件一直没发出去。"},{"en":"If you prehesitate too long, the opportunity can pass.","zh":"如果你事前犹豫太久，机会可能就溜走了。"}]}],"synonyms":["hesitate","second-guess","overthink","dither","waver"],"phonetic":"/priˈhɛzɪteɪt/","extraExplanation":["“prehesitate”并不是常见的标准英语词，更多像是把前缀“pre-（在……之前）”加到“hesitate（犹豫）”上形成的幽默/自创词（nonce word）。在正式写作中一般建议改用“hesitate（犹豫）”“second-guess（反复怀疑）”“overthink（想太多）”“delay（拖延）”等更规范的表达。"]}
{"word":"prehesitated","summary":{"en":"“Prehesitated” is not standard English; it’s sometimes used to mean “hesitated beforehand.”","zh":"“prehesitated”不是标准英语；有时被用来表示“事先就犹豫”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) Hesitated beforehand; paused or showed uncertainty in advance.","zh":"（非标准/罕见用法）事先犹豫；提前表现出迟疑、不确定。"},"examples":[{"en":"I prehesitated before the meeting because I wasn’t sure how my idea would be received.","zh":"开会前我就先犹豫了，因为不确定大家会怎么接受我的想法。"},{"en":"She had already prehesitated all day, so she didn’t sign the form at the last minute.","zh":"她一整天都在提前犹豫，所以最后一刻也没有签表。"}]}],"synonyms":["hesitated","wavered","had second thoughts","paused"],"phonetic":"/ˌpriˈhɛzəˌteɪtɪd/","extraExplanation":["“prehesitated”一般不被当作标准英语单词使用，更多时候会被看作拼写错误或玩笑式的造词（把前缀 pre- “事先”加到 hesitated “犹豫”前面）。","如果你想表达“犹豫”，标准写法是 hesitated；如果你想表达“事先就犹豫/反复考虑”，更自然的说法有: had been hesitating, hesitated beforehand, had second thoughts, wavered."]}
{"word":"prehesitating","summary":{"en":"“Prehesitating” is a rare/nonstandard form meaning “hesitating beforehand.”","zh":"“prehesitating”属少见/非标准用法，大意是“事先就犹豫”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) hesitating in advance; pausing before you even start an action or decision.","zh":"（非标准/少见用法）在行动或决定开始之前就先犹豫；提前迟疑。"},"examples":[{"en":"She seemed prehesitating at the door, as if deciding whether to knock.","zh":"她在门口显得提前就犹豫，好像在决定要不要敲门。"},{"en":"Don’t get stuck prehesitating—just ask the question politely.","zh":"别一直提前犹豫了——礼貌地把问题问出来就好。"}]}],"synonyms":["hesitating","reluctant","having second thoughts","wavering"],"phonetic":"/ˌpriːˈhɛzɪˌteɪtɪŋ/","extraExplanation":["“prehesitating”不是常见的标准英语单词，更像是临时造词（pre- + hesitating）或拼写错误。日常表达里通常直接用“hesitating”（犹豫的）或“hesitate”（犹豫）。","前缀“pre-”表示“在……之前/预先”。如果你想表达“事先就犹豫/畏缩”，更自然的说法有：“already hesitating,” “hesitating beforehand,” “having second thoughts,” “reluctant to begin”。"]}
{"word":"prehesitation","summary":{"en":"“Prehesitation” is a rare/nonstandard form, usually meaning a moment of hesitation beforehand; in normal English, use “hesitation” or “a moment’s hesitation.”","zh":"“prehesitation”很少见且不标准，通常指“事前的犹豫”；日常英语更建议用“hesitation”或“a moment’s hesitation”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or very rare word, likely intended to mean “hesitation in advance” (a pause or uncertainty before acting or speaking).","zh":"非标准或非常少见的词，通常可能想表达“事前的犹豫”（在行动或开口之前的停顿或不确定）。"},"examples":[{"en":"There was a moment of prehesitation before she answered the phone.","zh":"她接电话前有一瞬间的事前犹豫。"},{"en":"His prehesitation showed he wasn’t sure the plan was safe.","zh":"他的事前犹豫表明他不确定这个计划是否安全。"}]}],"synonyms":["hesitation","a moment’s hesitation","pause","reluctance"],"phonetic":"/ˌpriˌhɛzɪˈteɪʃən/","extraExplanation":["“prehesitation”在主流英语词典与常用语料中几乎不作为标准词条出现，日常写作与考试中不建议使用。","如果你想表达类似意思，更自然的说法是：hesitation（犹豫）、a moment’s hesitation（犹豫了一下）、pause（停顿）、reluctance（不情愿/勉强）。","如果你是在阅读中看到这个词，它很可能是作者的临时造词（creative coinage）或拼写错误。建议结合上下文判断是否其实想写“hesitation”。"]}
{"word":"prehexameral","summary":{"en":"An academic theological adjective meaning “before the six days of Creation (the Hexaemeron).”","zh":"一个少见的神学形容词，表示“六日创世（Hexaemeron）之前的；与六日创世之前有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or occurring before the Hexaemeron (the six days of Creation described in Genesis).","zh":"（神学用语）与“六日创世”（《创世纪》中上帝创造世界的六天，Hexaemeron/Hexaëmeron）之前有关的；发生在六日创世之前的。"},"examples":[{"en":"Some theologians discuss a prehexameral state, asking what existed before the first day of Creation.","zh":"一些神学家会讨论“六日创世之前”的状态，探问在创造的第一天之前存在什么。"},{"en":"The essay compares prehexameral eternity with the created order that follows the six days.","zh":"这篇文章把六日创世之前的永恒与随后被创造出来的秩序作比较。"}]}],"synonyms":["pre-creation","before Creation","antecedent to the Hexaemeron"],"phonetic":"/ˌpriˌhɛkˈsæmərəl/","extraExplanation":["这是一个非常少见、偏学术/神学的词。词根可拆解为 pre-（在……之前）+ hexameral（与“六日”有关）。hexameral 源自希腊语 hexa-（六）+ hēmera（天/日）。","Hexaemeron 常见于基督教神学与教父文学的语境（例如巴西尔《Hexaemeron》讲解《创世纪》六日创世）。prehexameral 用来指涉“六日创世之前”的存在、时间或状态，通常涉及“时间从何开始”“创造以前是否有‘之前’”等哲学/神学问题。"]}
{"word":"prehistorian","summary":{"en":"A specialist who studies prehistory (before written records).","zh":"研究史前时期（文字记录之前）的专家/学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies or specializes in prehistory (the time before written records), often through archaeology and ancient artifacts.","zh":"研究或专门研究史前时期（文字记录出现之前）的学者，常通过考古与遗物来了解过去。"},"examples":[{"en":"The prehistorian analyzed stone tools found in the cave.","zh":"这位史前史学者分析了在洞穴里发现的石器。"},{"en":"As a prehistorian, she focuses on how early humans lived and migrated.","zh":"作为史前史学者，她专注于早期人类的生活方式与迁徙。"}]}],"synonyms":["prehistory scholar","archaeologist (related)"],"phonetic":"/ˌpriːhɪˈstɔːriən/","extraExplanation":["“prehistorian”由“prehistory（史前史）+ -ian（表示从事某领域的人）”构成。它与“historian（历史学家）”不同：historian通常研究有文字记录的历史；prehistorian更依赖考古证据（如石器、陶器、骨骼、壁画、遗址层位等）来推断过去。","相关常见词：archaeologist（考古学家，更偏“方法与挖掘”）、anthropologist（人类学家，更偏“人类与文化”）。在日常英语里“prehistorian”较偏学术语境。"]}
{"word":"prehistorians","summary":{"en":"“Prehistorians” means scholars who research human life before written history.","zh":"“prehistorians”指研究文字记录出现之前人类生活与文化的史前学者（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who study prehistory (the time before written records), using evidence like fossils, stone tools, and ancient art.","zh":"研究史前时代（文字记录出现之前）的学者，主要依据化石、石器、古代艺术等证据进行研究。"},"examples":[{"en":"Prehistorians study stone tools to understand how early humans lived.","zh":"史前学家研究石器来了解早期人类如何生活。"},{"en":"The museum invited prehistorians to explain the cave paintings to visitors.","zh":"博物馆邀请史前学家为游客讲解洞穴壁画。"}]}],"synonyms":["prehistory researchers","archaeologists (overlapping)","scholars of prehistory"],"phonetic":"/ˌpriːhɪˈstɔːriənz/","extraExplanation":["“Prehistorians”是“prehistorian”的复数形式。","“Prehistory（史前史）”通常指没有文字记载的时期；不同地区进入“有文字史”的时间并不相同，所以史前学家的研究常结合考古学、人类学、古生物学等方法。","相关常见词：archaeologist（考古学家，范围更广，含有文字时期的遗址也会研究）、anthropologist（人类学家）。"]}
{"word":"prehistoric","summary":{"en":"Prehistoric means “before written history,” and it can also (informally) mean “very old or outdated.”","zh":"Prehistoric 指“史前的（文字记载之前的）”，也可口语化地表示“非常古老/过时的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before people had written records; very ancient.","zh":"史前的；有文字记载之前的；非常古老的。"},"examples":[{"en":"Dinosaurs lived in prehistoric times.","zh":"恐龙生活在史前时代。"},{"en":"Archaeologists found prehistoric cave paintings in Spain.","zh":"考古学家在西班牙发现了史前洞穴壁画。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Extremely old or outdated, as if from a very long time ago.","zh":"（非正式）非常陈旧的；过时得像“史前”一样。"},"examples":[{"en":"My laptop is prehistoric—I really need a new one.","zh":"我的笔记本电脑太“史前”了——我真的需要换新的。"},{"en":"Their office software looks prehistoric compared with ours.","zh":"他们的办公软件跟我们的相比显得非常落后。"}]}],"synonyms":["ancient","primeval","primitive","prehistoric (informal sense: outdated)","out-of-date"],"phonetic":"/ˌpriːhɪˈstɔrɪk/","extraExplanation":["词源：pre- 表示“在……之前”，historic 来自 history（历史）。因此 prehistoric 字面意思是“在历史（文字记载）之前”。","常见搭配：prehistoric times（史前时代）、prehistoric animals（史前动物）、prehistoric art（史前艺术）、prehistoric site（史前遗址）。","用在比喻义时通常带一点夸张和幽默语气，用来吐槽某物太旧、太落后。"]}
{"word":"prehistorical","summary":{"en":"Prehistorical means “before written history,” though the more common word is prehistoric.","zh":"prehistorical 指“史前的（文字记载之前）”，但更常用的说法是 prehistoric。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"From a time before written history (before people kept written records).","zh":"史前的；文字记载出现之前的。"},"examples":[{"en":"Prehistorical people used stone tools to hunt and cook.","zh":"史前人类用石器来狩猎和烹饪。"},{"en":"The museum has prehistorical bones from an ancient cave.","zh":"博物馆里有来自古老洞穴的史前骨骼。"}]}],"synonyms":["prehistoric","primeval","ancient"],"phonetic":"/ˌpriːhɪˈstɔːrɪkəl/","extraExplanation":["“prehistorical”常见但更标准、更常用的词是“prehistoric”。两者意思基本相同：都指“有文字记录之前的时期”。在学术写作、新闻和博物馆说明牌上通常用“prehistoric”。","词源上：pre- 表示“在……之前”，historical 来自 history（历史）。因此字面意思就是“历史（记载）之前的”。"]}
{"word":"prehistorically","summary":{"en":"Prehistorically means “in relation to prehistoric times,” and it can also mean “a very long time ago” in a playful way.","zh":"prehistorically 意为“在史前时期相关的意义上”；口语中也可夸张地表示“很久很久以前”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to prehistoric times (the period before written records).","zh":"以史前时期（文字记录出现之前）相关的方式；在史前意义上。"},"examples":[{"en":"Prehistorically, humans lived as hunters and gatherers for most of our history.","zh":"从史前角度看，人类历史的大部分时间都以狩猎采集为生。"},{"en":"This region is prehistorically important because many ancient tools were found here.","zh":"这个地区在史前研究上很重要，因为这里发现了许多古代工具。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the very distant past; long ago (often used humorously or loosely).","zh":"在很久很久以前；非常久远地（常带夸张或调侃语气）。"},"examples":[{"en":"I prehistorically forgot my password again—like, years ago.","zh":"我“史前时代”就把密码忘了——也就是好多年前。"},{"en":"We’ve known each other prehistorically, back in elementary school.","zh":"我们认识得可“史前”了——从小学就认识。"}]}],"synonyms":["in prehistoric times","in ancient times","long ago","ages ago"],"phonetic":"/ˌpriːhɪˈstɔrɪkli/","extraExplanation":["“prehistorically”来自“prehistoric（史前的）+ -ally（以……方式）”。在学术写作中更常见，用来描述与史前时期相关的证据、文化或环境（如 prehistorically significant：在史前研究中具有重要意义）。","第二种用法多见于口语或轻松语境，带夸张色彩，强调“非常久以前”，不一定真的指史前时代。"]}
{"word":"prehistorics","summary":{"en":"“Prehistorics” usually refers to prehistoric people/things, but it’s uncommon; “prehistoric” is more common as an adjective meaning ‘before written history.’","zh":"“prehistorics”多指史前的人/物，但用法较少见；更常见的是形容词“prehistoric”，表示“史前的（有文字记载之前的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to a time before written history (before people kept written records).","zh":"（形容词）史前的；有文字记载之前的（人类尚未留下书面记录的时期）。"},"examples":[{"en":"Dinosaurs lived in prehistoric times.","zh":"恐龙生活在史前时代。"},{"en":"They found prehistoric tools in the cave.","zh":"他们在洞穴里发现了史前工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) Prehistoric people, animals, or things as a group (rare; more common: “prehistoric people/animals/artifacts”).","zh":"（名词复数）史前的人类/动物/事物的统称（较少见；更常用说法是 prehistoric people/animals/artifacts）。"},"examples":[{"en":"The exhibit compares modern humans with the prehistorics.","zh":"这个展览把现代人和史前人类作比较。"},{"en":"Some films show the prehistorics living alongside dinosaurs.","zh":"有些电影把史前人类和恐龙生活在一起（虽然并不准确）。"}]}],"synonyms":["ancient","prehistory-related","Stone Age (context-specific)","primitive (sometimes, but can sound judgmental)"],"phonetic":"/ˌpriːhɪˈstɔrɪk/","extraExplanation":["“prehistorics”作为复数名词在日常英语里不太常见，写作或学术表达通常会用更明确的名词短语：prehistoric humans/people（史前人类）、prehistoric animals（史前动物）、prehistoric artifacts（史前文物）、prehistory（史前史）。","文化常识：很多影视作品会让“史前人类”和恐龙同框，但从时间上看，人类与非鸟类恐龙并未共存；因此这类用法常带有娱乐/幻想色彩。"]}
{"word":"prehistories","summary":{"en":"“Prehistories” means multiple prehistory periods (before writing) or multiple early backgrounds of something.","zh":"“prehistories”指多个地区的史前时期，或某事物在被广泛记录/成形前的多段早期背景与发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural form of “prehistory”: the time periods before written records in different places or cultures.","zh":"“prehistory（史前时期）”的复数：指不同地区或文化在有文字记载之前的各个时期。"},"examples":[{"en":"Archaeologists compare the prehistories of Europe and East Asia to understand early farming.","zh":"考古学家比较欧洲和东亚的史前时期，以了解早期农业。"},{"en":"Different prehistories can produce very different tools and art.","zh":"不同地区的史前时期会产生很不一样的工具和艺术。"}]},{"partOfSpeech":"n.","definition":{"en":"The earlier, usually little-known background or development of something (before it became well recorded or widely known).","zh":"某事物较早、通常不太为人所知的背景或发展阶段（在被详细记录或广为人知之前）。"},"examples":[{"en":"The book explores the prehistories of the internet, before it became public.","zh":"这本书探讨互联网在走向公众之前的早期发展史。"},{"en":"Every city has prehistories hidden under its streets.","zh":"每座城市的街道下面都藏着它的“前史”。"}]}],"synonyms":["prehistory (plural)","early histories","backgrounds","origins","antecedents"],"phonetic":"/ˌpriˈhɪstəriz/","extraExplanation":["“prehistories”多用于学术或写作中，强调“多个地区/文化的史前时期”或“同一主题的多条早期发展脉络”。日常对话更常见的是单数“prehistory”。","写作中把“prehistory”用于现代事物（如电影、科技、社会运动）时，往往带有比喻意味：指正式成形之前的孕育阶段。"]}
{"word":"prehistory","summary":{"en":"Prehistory is the period before written records; it can also mean the early beginnings of something.","zh":"Prehistory 指文字记录出现之前的史前时代；也可引申为某事物发展的早期“前史”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time before written records, studied through archaeology (tools, bones, cave art, etc.)","zh":"史前时代；文字记录出现之前的时期，主要通过考古发现来研究（工具、骨骼、洞穴壁画等）"},"examples":[{"en":"Dinosaurs lived long before human prehistory began.","zh":"恐龙生活在远早于人类史前时代开始之前。"},{"en":"Archaeologists use pottery and stone tools to learn about prehistory.","zh":"考古学家通过陶器和石器来了解史前时代。"},{"en":"The museum has an exhibit on European prehistory.","zh":"这家博物馆有一个关于欧洲史前时代的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the earliest stage of something, before it is fully developed or clearly recorded","zh":"（某事物的）早期萌芽阶段；在充分发展或有清楚记录之前的时期"},"examples":[{"en":"The 1980s were the prehistory of the modern internet.","zh":"20世纪80年代是现代互联网的早期萌芽阶段。"},{"en":"Some critics call her early short stories the prehistory of her later novels.","zh":"一些评论家把她早期的短篇小说称为她后来长篇小说的前史。"}]}],"synonyms":["ancient times","the Stone Age","early beginnings","origins"],"phonetic":"/ˌpriːˈhɪstəri/","extraExplanation":["词源：pre- 表示“在……之前”，history 表示“历史”。合在一起就是“历史之前”。","用法提示：prehistory 通常是不可数名词（in prehistory / during prehistory），但也可在特定语境中可数（the prehistories of different regions）。","相关词：prehistoric（adj. 史前的；也可比喻“非常老旧的”，如 prehistoric computer）。"]}
{"word":"prehnite","summary":{"en":"Prehnite is a greenish mineral sometimes used as a gemstone.","zh":"Prehnite（葡萄石）是一种偏绿色的矿物，有时用作宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pale green to yellow-green mineral (a calcium–aluminum silicate) that is sometimes used as a gemstone","zh":"一种浅绿到黄绿色的矿物（钙铝硅酸盐），有时用作宝石"},"examples":[{"en":"She wore a pendant set with prehnite and silver.","zh":"她戴着一条镶有葡萄石和银的吊坠。"},{"en":"Prehnite is often found in cavities of volcanic rocks.","zh":"葡萄石常见于火山岩的空洞中。"},{"en":"The jeweler showed me prehnite as a softer alternative to harder stones like sapphire.","zh":"珠宝商给我看了葡萄石，说它比蓝宝石等更硬的宝石要软一些。"}]}],"synonyms":["gemstone (general)","mineral (general)","prehnite gemstone (common phrase)"],"phonetic":"/ˈprɛn.aɪt/","extraExplanation":["“Prehnite”的常见中文名是“葡萄石”。它通常呈半透明的浅绿、黄绿色，常被切磨成珠子、戒面或雕刻小件。","词源上，它以18世纪的荷兰军官 Hendrik von Prehn 命名；也常被说成是最早以“人名”命名的矿物之一。","发音里常见重音在第一个音节（PREH-），结尾的 -nite 常见于矿物名称（表示“某种矿物/岩石”），如 granite（花岗岩）等。"]}
{"word":"prehnitic","summary":{"en":"Prehnitic means “related to the mineral prehnite.”","zh":"prehnitic 指“与矿物葡萄石（prehnite）有关的；葡萄石质的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or consisting of the mineral prehnite (a typically pale green mineral found in some volcanic and metamorphic rocks).","zh":"与葡萄石（prehnite，一种常见于某些火山岩与变质岩中的浅绿色矿物）有关的；由葡萄石构成的。"},"examples":[{"en":"The geologist identified a prehnitic coating lining the cavities in the basalt.","zh":"地质学家辨认出玄武岩空洞内壁有一层葡萄石质（prehnitic）的涂层。"},{"en":"Prehnitic veins can form when mineral-rich fluids move through cracks in rock.","zh":"当富含矿物的流体穿过岩石裂隙时，可能形成葡萄石质（prehnitic）的矿脉。"}]}],"synonyms":["prehnite-bearing","prehnite-related"],"phonetic":"/prɛˈnaɪtɪk/","extraExplanation":["“prehnitic”来自矿物名“prehnite（葡萄石）”。葡萄石常呈浅绿到黄绿色，常见于气孔玄武岩的空洞充填物，也可见于低级变质作用环境。","该词多用于地质、矿物学语境；日常英语中很少出现。如果你想表达“先天的/前历史的”，应注意那是不同词（如“prehistoric”）。"]}
{"word":"preholder","summary":{"en":"“Preholder” is an uncommon word; it can mean someone/something that holds or reserves something in advance, but it is often a mistaken form of “placeholder.”","zh":"“preholder”不常用；可指提前代为持有/保留的人或物，但很多时候是把“placeholder（占位符）”写错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A person or thing that holds, reserves, or keeps something in advance (before the main owner/user takes it).","zh":"（不常用）提前替他人持有、保留或暂存某物的人或事物。"},"examples":[{"en":"The venue used a staff member as a preholder for the VIP tickets until the guests arrived.","zh":"场地方安排工作人员提前代为保管贵宾票，直到客人到达。"},{"en":"He acted as a preholder of the documents during the handover period.","zh":"在交接期间，他临时代为保管这些文件。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often a mistaken form) Used when the speaker/writer actually means “placeholder” (something temporary used to mark a position or substitute until the real item is ready).","zh":"（常见为误用）很多时候其实是想说“placeholder（占位符/临时替代物）”。"},"examples":[{"en":"Please insert a placeholder image for now, not a “preholder.”","zh":"现在先放一张占位图，不要写成“preholder”。"},{"en":"In the template, those brackets are placeholders for your name and date.","zh":"在这个模板里，括号是给你的姓名和日期用的占位符。"}]}],"synonyms":["(sense 1) temporary holder","custodian","keeper","(often intended) placeholder"],"phonetic":"ˈpriˌhoʊldɚ","extraExplanation":["“preholder”不是英语里的常用标准词，日常写作和工作场景中更常见、也更地道的是“placeholder（占位符/临时替代物）”。","如果你看到“preholder”出现在合同、房产或金融文件中，它可能是某个机构的内部用词，或是把“holder（持有人）”加上“pre-（预先）”临时造出来的词；遇到正式文本建议回到原文定义或向对方确认具体含义。"]}
{"word":"preholding","summary":{"en":"Preholding means the stage or costs before something is officially held or owned (a rare, technical term).","zh":"preholding 指“正式持有/拥有之前的阶段或成本”（较少见、偏技术语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to the period or stage before you officially hold, own, or keep something (such as an asset, shares, or a position).","zh":"（较少见）指在你正式持有、拥有或保留某物（如资产、股票或某个头寸）之前的阶段或期间。"},"examples":[{"en":"The report separates preholding costs from holding costs to show when the money is spent.","zh":"报告把“持有前成本”和“持有期成本”分开，以展示资金是在什么时候花出去的。"},{"en":"They reviewed the preholding conditions before transferring the shares to investors.","zh":"在把股票转给投资者之前，他们审查了持有前条件。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The time or costs before something is officially held or kept.","zh":"（较少见）指某物被正式持有或保留之前的时间或相关成本。"},"examples":[{"en":"Preholding can include paperwork, fees, and approval steps.","zh":"持有前阶段可能包括文件手续、费用和审批步骤。"}]}],"synonyms":["pre-holding (as a modifier)","before holding","pre-ownership","pre-acquisition"],"phonetic":"/ˌpriːˈhoʊldɪŋ/","extraExplanation":["“preholding”不是非常常见的标准词条，更常见的表达是“pre-holding period（持有前期间）”“before holding（在持有之前）”“pre-ownership（拥有之前）”。它通常出现在金融、会计或法律写作里，用来区分“正式持有之前”的步骤/费用与“持有期间”的管理成本。","写作上更自然的做法：在首次出现时用短语解释清楚（如“pre-holding costs (costs incurred before the asset is held)”），或直接改用更常见的词组。"]}
{"word":"preholiday","summary":{"en":"Preholiday means “before a holiday,” often describing the busy time, activities, or feelings leading up to a holiday.","zh":"preholiday 表示“节日前的”，常用来指假日前那段忙碌的时期、活动或氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a holiday (often describing time, mood, travel, or work).","zh":"节日前的；在假日之前进行的（常用来形容时间、气氛、出行或工作安排）。"},"examples":[{"en":"Preholiday traffic is usually heavier than normal.","zh":"节日前的交通通常比平时更拥堵。"},{"en":"We’re busy with preholiday shopping this week.","zh":"我们这周忙着节日前采购。"},{"en":"The office feels tense during the preholiday rush.","zh":"办公室在节日前的忙乱中显得有点紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time before a holiday.","zh":"假日前的这段时间。"},"examples":[{"en":"The preholiday is a good time to plan your budget.","zh":"假日前这段时间很适合做预算规划。"},{"en":"During the preholiday, delivery times can be longer.","zh":"在假日前这段时间，配送时间可能会更长。"}]}],"synonyms":["pre-holiday","before the holiday","ahead of the holiday","holiday-season (related)"],"phonetic":"/ˌpriˈhɑləˌdeɪ/","extraExplanation":["“preholiday”在英语里更常见的写法是带连字符的“pre-holiday”，尤其在正式写作中更自然；不带连字符的写法也能见到，但多见于商业文案或标题。","常见搭配：pre(-)holiday sales（节前促销）, pre(-)holiday season（节前季）, pre(-)holiday rush（节前忙碌/高峰）, pre(-)holiday travel（节前出行）。"]}
{"word":"prehominid","summary":{"en":"Prehominid describes something from before the earliest humans or human ancestors.","zh":"Prehominid 指与最早人类或人类祖先出现之前的时期相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the period or forms of life that existed before the earliest humans or human ancestors (hominins) appeared.","zh":"（与）人类或人族（hominin）出现之前的时期或生命形式有关的；前人类的。"},"examples":[{"en":"Scientists found prehominid fossils in rocks that are millions of years older than the earliest hominins.","zh":"科学家在比最早人族还要古老数百万年的岩层中发现了前人类时期的化石。"},{"en":"The documentary begins with prehominid climates and landscapes to set the scene for human evolution.","zh":"这部纪录片先介绍前人类时期的气候与地貌，为人类演化铺垫背景。"}]}],"synonyms":["prehuman","prehistoric (broader)","prehominin (often preferred in modern science writing)"],"phonetic":"/ˌpriːˈhɑːməˌnɪd/","extraExplanation":["“prehominid”由前缀 pre-（“在……之前”）+ hominid 组成。现代学术写作中更常用的是 “prehominin”（在最早人族/人科支系成员出现之前），因为 “hominid” 的分类范围在不同时期的科学文献里曾有变化。","该词多见于人类演化、古生物学、考古学等语境；日常英语中较少使用。"]}
{"word":"prehorizon","summary":{"en":"Prehorizon means “before the planning/forecasting horizon (endpoint),” mainly used in technical contexts like finance or project planning.","zh":"Prehorizon 指“在规划/预测期限（终点）之前”，主要用于金融、项目管理等技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Happening or existing before the time limit or endpoint you are planning toward (the “horizon”), especially in planning, forecasting, or investing.","zh":"（技术用语）在计划、预测或投资所设定的“时间终点/期限（horizon）”之前发生或存在的；“终点之前的/到期前的”。"},"examples":[{"en":"The team focused on prehorizon risks that could derail the launch schedule.","zh":"团队重点关注可能打乱发布进度的到期前风险。"},{"en":"In portfolio management, prehorizon decisions can strongly affect long-term returns.","zh":"在投资组合管理中，到期前的决策会显著影响长期回报。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time before a chosen planning endpoint (the “horizon”).","zh":"（较少见）在某个规划终点（horizon）之前的那段时间；“终点前阶段”。"},"examples":[{"en":"During the prehorizon, the company prioritized cash flow over expansion.","zh":"在终点前阶段，公司把现金流置于扩张之上。"}]}],"synonyms":["pre-horizon","before the horizon","pre-deadline","prior to the endpoint"],"phonetic":"/ˌpriː həˈraɪzən/","extraExplanation":["“prehorizon”不是日常英语常用词，更常见的写法是带连字符的“pre-horizon”。它多出现在金融（投资期限）、项目管理（规划期限）、预测/建模等语境中。","这里的“horizon”指“规划或预测的时间界限/终点”，不是地平线的字面意义。"]}
{"word":"prehorror","summary":{"en":"Prehorror means “before the horror”—the tense lead-up or setup before something frightening happens (rare; often written pre-horror).","zh":"Prehorror 指“恐怖发生之前”的紧张铺垫或前奏（较少见，常写作 pre-horror）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening before a horror event; describing the tense period or atmosphere leading up to something frightening.","zh":"（少见）恐怖事件发生之前的；指可怕事情来临前那段紧张的时期或氛围。"},"examples":[{"en":"The film spends a long time in a prehorror mood, building tension before anything scary appears.","zh":"这部电影用很长篇幅营造“恐怖来临前”的氛围，在真正吓人的画面出现前不断累积紧张感。"},{"en":"She noticed a prehorror silence in the house, as if something bad were about to happen.","zh":"她察觉到屋子里一种“暴风雨前”的沉寂，仿佛有什么不好的事即将发生。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The period or setup before horror begins, especially in a story or film.","zh":"（少见）恐怖开始之前的阶段或铺垫（尤指故事或电影中的开端部分）。"},"examples":[{"en":"The director treats the first act as prehorror, focusing on ordinary life and small warnings.","zh":"导演把第一幕当作“恐怖前段”，先展现日常生活与细微的预兆。"}]}],"synonyms":["pre-horror","lead-up","build-up","suspenseful setup","foreboding"],"phonetic":"/ˌpriːˈhɔːrɚ/","extraExplanation":["“prehorror”不是常用标准词，更常见的写法是带连字符的“pre-horror”，或直接说“before the horror starts / the build-up / the suspenseful lead-up”。在影评、类型片讨论里用它，多半是强调“恐怖尚未爆发但气氛已开始不对劲”的铺垫阶段。"]}
{"word":"prehostile","summary":{"en":"Rare adjective meaning “before open hostility or conflict begins.”","zh":"罕用形容词，指“公开敌对或冲突开始之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Existing or happening before open hostility begins; occurring in a period leading up to conflict.","zh":"（罕用）敌对关系公开爆发之前的；发生在冲突/敌意出现之前阶段的。"},"examples":[{"en":"The report described rising tension in the prehostile phase of the negotiations.","zh":"报告描述了谈判进入敌对爆发前阶段时不断上升的紧张气氛。"},{"en":"They noticed prehostile behavior—short answers and avoidance—before the argument started.","zh":"他们在争吵开始前就注意到一些“敌意前兆”的行为——回答简短、刻意回避。"}]}],"synonyms":["pre-conflict","prewar","before hostilities began","nonhostile (context-dependent)"],"phonetic":"/ˌpriːˈhɑstəl/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ hostile（“敌对的”）构成，但在日常英语里非常少见。更常用的表达是 before things became hostile / before hostilities began（在变得敌对之前/在敌对行动开始之前）或 pre-conflict / prewar（冲突前/战前）。","在新闻与学术语境中，hostilities 常指“敌对行动/军事冲突”，所以 prehostile 也可理解为“冲突尚未正式开始的阶段”。"]}
{"word":"prehostility","summary":{"en":"“Prehostility” means the time or conditions before open hostilities (armed conflict) begin, or something connected to that phase.","zh":"“prehostility”指敌对行动（武装冲突）公开爆发之前的时期/状态，或与该阶段相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period or conditions before open conflict or hostility begins; a “before-the-fighting” phase","zh":"敌对行动或公开冲突开始之前的时期或状态；“开战前/敌对前”阶段"},"examples":[{"en":"The two countries held emergency talks during the prehostility period to avoid war.","zh":"两国在敌对行动爆发前的阶段举行紧急会谈，以避免战争。"},{"en":"Hospitals prepared extra supplies in the prehostility phase, expecting possible attacks.","zh":"医院在敌对行动前的阶段储备了更多物资，以应对可能的袭击。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the time before hostilities begin","zh":"与敌对行动开始之前相关的；开战前的"},"examples":[{"en":"The report focuses on prehostility decisions made by political leaders.","zh":"该报告聚焦政治领袖在敌对行动爆发前作出的决定。"},{"en":"They discussed prehostility planning for civilian evacuation.","zh":"他们讨论了敌对行动前的平民撤离规划。"}]}],"synonyms":["pre-hostility","prewar","before hostilities","run-up to conflict","pre-conflict"],"phonetic":"/ˌpriˌhɑˈstɪləti/","extraExplanation":["“prehostility”并不是日常常用词，更常见的写法是加连字符的“pre-hostility”，或用更常见表达如“prewar (战前的)”“before hostilities (敌对行动之前)”。","在军事、国际法与政策文件中，hostilities 通常指“武装冲突/敌对行动”；因此 prehostility 常用于描述冲突尚未公开爆发、但紧张升级、准备与部署已开始的阶段。"]}
{"word":"prehuman","summary":{"en":"Prehuman means “before humans existed” (and sometimes “before modern humans,” referring to early ancestors).","zh":"prehuman 指“人类出现之前的”（有时也指现代人之前、与早期祖先相关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"existing, happening, or relating to a time before humans existed on Earth","zh":"（地球上）人类出现之前的；史前人类之前的"},"examples":[{"en":"Scientists study prehuman climates to understand long-term changes in Earth’s environment.","zh":"科学家研究史前（人类出现之前）的气候，以了解地球环境的长期变化。"},{"en":"Some rocks in this region formed in a prehuman era.","zh":"这个地区的一些岩石形成于人类出现之前的时代。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to early human ancestors (hominins) before modern humans","zh":"（较少用）与现代人之前的早期人类祖先（古人类）有关的"},"examples":[{"en":"The museum has tools that may have been used by prehuman ancestors.","zh":"博物馆里有一些工具，可能被早期人类祖先使用过。"},{"en":"In older writing, “prehuman” sometimes includes Australopithecus and other early hominins.","zh":"在较旧的文章里，“prehuman”有时也包括南方古猿等早期人族。"}]}],"synonyms":["pre-human","before humans","prehistoric (often preferred in many contexts)","primeval"],"phonetic":"/priˈhjuːmən/","extraExplanation":["“prehuman”常见于科普、地质学、进化论语境，强调“在人类出现之前”。如果你想更准确地表达“史前（有人类但无文字）”，英语更常用“prehistoric”。","在现代人类学写作中，把早期人族称为“prehuman”有时会显得不够严谨或带价值判断；更中性常见的说法是“early humans / human ancestors / hominins”。"]}
{"word":"prehumans","summary":{"en":"“Prehumans” usually means human ancestors or related hominin species that lived before modern humans; in sci‑fi it can mean an earlier intelligent race.","zh":"“prehumans”通常指现代人之前的人类祖先或近缘人族；在科幻中也可指早于人类的智慧种族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hominins (human ancestors or closely related species) that lived before modern Homo sapiens.","zh":"早于现代智人（Homo sapiens）的人族成员：人类祖先或与人类近缘的物种。"},"examples":[{"en":"Scientists study prehumans to understand how modern humans evolved.","zh":"科学家研究前人类（早期人族），以了解现代人是如何进化来的。"},{"en":"Fossils of prehumans have been found in parts of Africa and Eurasia.","zh":"在非洲和欧亚部分地区发现了前人类（早期人族）的化石。"}]},{"partOfSpeech":"n.","definition":{"en":"In science fiction or speculative writing, intelligent beings that existed before humans (not necessarily related to human evolution).","zh":"在科幻或推想作品中：早于人类出现的智慧生物（不一定与人类进化有关）。"},"examples":[{"en":"The novel imagines prehumans who built cities long before recorded history.","zh":"这部小说想象有一种前人类（史前智慧种族），在有文字记载之前就建造了城市。"},{"en":"In the game’s lore, prehumans left clues for humans to discover.","zh":"在这款游戏的世界观里，前人类留下线索让人类去发现。"}]}],"synonyms":["hominins","human ancestors","early humans","prehistoric humans","protohumans"],"phonetic":"/ˌpriːˈhjuːmənz/","extraExplanation":["“prehumans”常见于两种语境：①人类学/古生物学里，指“现代人之前的人族/人类祖先”（更严谨的常用词是“hominins（人族）”“human ancestors（人类祖先）”，或直接点名如“Neanderthals（尼安德特人）”“Homo erectus（直立人）”）；②科幻设定中指“先于人类的智慧种族”。","日常交流中单说“prehumans”可能显得不够精确，学术写作通常会改用更具体的术语；同时也要注意避免把“早期人类/近缘人族”用作贬义标签。"]}
{"word":"prehumiliate","summary":{"en":"“Prehumiliate” is a rare, nonstandard verb meaning “to humiliate someone beforehand.” Prefer clearer phrases like “humiliate in advance.”","zh":"“prehumiliate”很少见且不太规范，意思是“事先羞辱某人”。更建议用“humiliate in advance/ beforehand”等更自然的说法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard/rare) To humiliate someone beforehand; to humiliate in advance (often meaning to lower someone’s confidence before a contest or public moment).","zh":"（非标准/少见）事先羞辱；提前让某人难堪（常指在比赛或公开场合前先打击对方信心）。"},"examples":[{"en":"The captain tried to prehumiliate the new player with jokes before the tryouts.","zh":"队长在选拔前用玩笑试图先羞辱新队员。"},{"en":"Online comments can prehumiliate someone before they even speak on stage.","zh":"网络评论可能会在一个人登台前就先让他难堪。"}]}],"synonyms":["humiliate in advance","belittle beforehand","undermine (someone) beforehand","mock beforehand"],"phonetic":"ˌpriːhjuːˈmɪlieɪt","extraExplanation":["“prehumiliate”不是常见或规范的英语单词，很多词典里找不到。更自然的表达通常是：\n- “humiliate someone in advance / beforehand”（提前羞辱）\n- “try to humiliate someone before …”（在……之前羞辱）\n- “undermine someone’s confidence”（打击某人信心，语气更中性/正式）","词源提示：前缀“pre-”表示“在……之前”，而“humiliate”来自拉丁语“humilis”（低的、卑微的）。把“pre-”直接加在“humiliate”前在构词上能理解，但实际使用非常少，写作或正式场合不建议用。"]}
{"word":"prehumiliation","summary":{"en":"Prehumiliation means being humiliated beforehand or using humiliation as a pre-event tactic.","zh":"prehumiliation 指“事先的羞辱/预先被羞辱”，也可指作为事前策略的羞辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"humiliation that happens before something else (such as an event, negotiation, or public appearance), often used to describe being embarrassed in advance or as a way to weaken someone beforehand.","zh":"在某件事发生之前就遭受的羞辱（如在活动、谈判或公开露面前），常用来指“事先被羞辱”、或用羞辱来先削弱对方。"},"examples":[{"en":"He felt a sense of prehumiliation walking into the interview after the harsh email exchange.","zh":"在经历了那封严厉的邮件往来后，他走进面试时就有一种“事先被羞辱”的感觉。"},{"en":"The coach’s comments were seen as prehumiliation meant to intimidate the team before the match.","zh":"教练的言论被视为赛前的“预先羞辱”，意在在比赛前震慑那支队伍。"}]}],"synonyms":["preemptive humiliation","prior humiliation","advance humiliation","public shaming (beforehand)","humiliation in advance"],"phonetic":"/ˌpriː.hjuːˌmɪl.iˈeɪ.ʃən/","extraExplanation":["“prehumiliation”不是常见标准词，更常见的表达是“preemptive humiliation”（先发制人的羞辱）或“public humiliation beforehand”（事先的公开羞辱）。在写作中用它会显得更“造词/文风化”，读者可能需要从语境猜意思。","构词上可拆为：pre-（在……之前）+ humiliation（羞辱）。因此它通常强调时间顺序（先发生的羞辱）或策略目的（先羞辱以控制/压制对方）。"]}
{"word":"prehumor","summary":{"en":"“Prehumor” is a rare, informal word meaning a serious/neutral setup that comes before the humor.","zh":"“prehumor”是少见的非正式用法，指幽默出现前的严肃/中性铺垫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) Coming before humor; used to describe a serious or neutral moment that sets up a joke or a funny tone.","zh":"（罕见，非正式）在幽默之前的；指为笑点做铺垫的严肃或中性时刻。"},"examples":[{"en":"The speaker’s prehumor tone made the punchline hit harder.","zh":"演讲者在幽默前的那种严肃语气，让最后的笑点更有冲击力。"},{"en":"Give the story a little prehumor setup before the funny part.","zh":"在进入搞笑部分前，先加一点铺垫。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A serious or neutral introduction that comes before a humorous section; a setup.","zh":"（罕见）幽默段落之前的认真/中性引入；铺垫。"},"examples":[{"en":"His prehumor was long, but the joke was worth it.","zh":"他的铺垫很长，但那个笑话很值得。"},{"en":"The essay has a page of prehumor before it turns playful.","zh":"这篇文章在变得轻松诙谐之前，有一页比较严肃的引入。"}]}],"synonyms":["setup","lead-in","straight-faced introduction","serious preface"],"phonetic":"/priˈhjuːmər/","extraExplanation":["“prehumor”不是常见标准词，更多是把“pre-（在……之前）+ humor（幽默）”临时组合出来的用法；写作中更常见的表达是“setup（铺垫）”“lead-in（引入）”“straight-faced/serious introduction（一本正经的开场）”。","如果你想表达“笑点之前的铺垫”，也可以用“the setup before the punchline（包袱前的铺垫）”。"]}
{"word":"prehunger","summary":{"en":"“Prehunger” is an informal, uncommon word meaning “before hunger starts” or “the stage right before you feel hungry.”","zh":"“prehunger”是较少见的非正式用法，表示“饥饿开始之前”或“快饿但还没饿的阶段”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Happening before you feel hungry; relating to the time or state just before hunger starts.","zh":"（非正式／少见）在你感到饥饿之前发生的；与“将要饿但还没饿”的阶段有关。"},"examples":[{"en":"I eat a small snack in that prehunger window so I don’t overeat at dinner.","zh":"我会在“还没饿但快饿了”的那个预饥饿时间吃点小零食，这样晚餐就不会吃太多。"},{"en":"She gets irritable in the prehunger stage, so she keeps nuts in her bag.","zh":"她在预饥饿阶段会有点烦躁，所以包里常备坚果。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, rare) The period or state before hunger begins.","zh":"（非正式／少见）饥饿开始之前的那段时间或状态。"},"examples":[{"en":"A quick walk helps me through the prehunger without reaching for chips.","zh":"快走一会儿能帮我度过预饥饿状态，不至于去拿薯片。"},{"en":"During prehunger, I try to drink water first.","zh":"在预饥饿阶段，我会先喝点水。"}]}],"synonyms":["before getting hungry","not quite hungry yet","between meals","pre-meal"],"phonetic":"/ˌpriˈhʌŋɡɚ/","extraExplanation":["“prehunger”不是标准常用词，更常见的表达是“before I get hungry / when I’m not quite hungry yet / between meals”。它由前缀“pre-（在……之前）+ hunger（饥饿）”构成，常见于健身、饮食管理或营销语境（比如“prehunger snack”）。如果你在正式写作中使用，建议改用更通用的说法或加引号说明。"]}
{"word":"prehydration","summary":{"en":"Prehydration means drinking fluids before an activity to prevent dehydration.","zh":"prehydration 指在活动开始前先补充水分（常含电解质）以预防脱水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Drinking water or an electrolyte drink before exercise, heat exposure, or a long event to reduce the risk of dehydration and improve performance.","zh":"在运动、炎热环境或长时间活动开始前先补充水分或电解质饮料，以降低脱水风险并帮助发挥表现。"},"examples":[{"en":"Good prehydration can help you handle a long run in hot weather.","zh":"良好的预先补水能帮助你在炎热天气里更轻松地完成长跑。"},{"en":"The coach reminded the team to focus on prehydration the day before the tournament.","zh":"教练提醒队员在比赛前一天就要重视预先补水。"},{"en":"For prehydration, she chose an electrolyte drink instead of plain water.","zh":"为了预先补水，她选择了电解质饮料而不是纯水。"}]}],"synonyms":["pre-event hydration","hydration beforehand","fluid loading"],"phonetic":"/ˌpriːhaɪˈdreɪʃən/","extraExplanation":["“prehydration”常见于运动科学、耐力运动（马拉松、铁人三项）和高温作业相关语境中；也可能出现在医疗/营养建议里。","与“rehydration（补水/复水）”不同：prehydration是“事前”，rehydration多指“事后”或“脱水后”恢复。","实际做法通常强调“适量”和“电解质平衡”；过量饮水在极端情况下可能导致低钠血症（hyponatremia）。"]}
{"word":"prehypophysis","summary":{"en":"Prehypophysis means the anterior (front) lobe of the pituitary gland.","zh":"prehypophysis 指垂体的前叶（垂体前部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the anterior lobe of the pituitary gland (the front part), which produces and releases several important hormones","zh":"脑下垂体前叶；垂体前叶（垂体的前部），负责产生并分泌多种重要激素"},"examples":[{"en":"The prehypophysis secretes hormones such as ACTH, TSH, and growth hormone.","zh":"垂体前叶会分泌促肾上腺皮质激素（ACTH）、促甲状腺激素（TSH）和生长激素等。"},{"en":"Damage to the prehypophysis can lead to hormonal imbalances.","zh":"垂体前叶受损可能导致激素失衡。"}]}],"synonyms":["anterior pituitary","anterior pituitary gland","adenohypophysis"],"phonetic":"/ˌpriˌhaɪˈpɑfəsɪs/","extraExplanation":["“prehypophysis”多用于医学、生理学与内分泌学语境，日常英语里更常说“anterior pituitary (gland)”或“adenohypophysis（腺垂体）”。","词源上：pre- 表示“前/在前”，hypophysis 是“垂体”的较正式说法。","垂体通常分为前叶（prehypophysis/anterior pituitary）与后叶（neurohypophysis/posterior pituitary）。前叶主要“制造并分泌”激素；后叶主要“储存并释放”下丘脑产生的激素（如ADH与催产素）。"]}

