{"word":"prejacent","summary":{"en":"Prejacent means the underlying embedded proposition that an operator (negation, modal, attitude verb, question, etc.) applies to.","zh":"Prejacent 指被否定、情态词、态度动词、疑问等算子所作用的“基础/嵌入命题”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/logic) Of a proposition: the embedded statement that an operator (like “not,” “must,” “believe,” or a question) applies to.","zh":"（语言学/逻辑）指“命题”：被某个算子（如“不”、 “必须”、 “相信”、或疑问句式）所作用/支配的嵌入式陈述。"},"examples":[{"en":"In “Alex believes that it’s raining,” the prejacent is “it’s raining.”","zh":"在“Alex believes that it’s raining（亚历克斯相信在下雨）”中，prejacent 是“it’s raining（在下雨）”。"},{"en":"For negation, the prejacent of “not P” is the proposition P.","zh":"对否定来说，“not P”的 prejacent 就是命题 P。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, general) Lying before or underneath; situated in front of something.","zh":"（罕见，一般义）位于前方或下方的；在某物之前/之下的。"},"examples":[{"en":"The report mentions the prejacent layers of rock beneath the site.","zh":"报告提到该地点下方的下伏岩层。"}]}],"synonyms":["embedded proposition","base proposition","underlying proposition","scope proposition"],"phonetic":"/ˌpriˈdʒeɪsənt/","extraExplanation":["在语义学与语用学里，prejacent 常用来讨论“某个表达式如何改变或限制一个基本命题”。例如：\n- 情态词 must/可能 等：把基础命题包在“必然/可能”的框架里。\n- 预设触发词（如 stop、again）：常用于分析其与“基础命题”的关系。\n- 疑问句：有时会把问题对应的“命题内容”称为 prejacent（不同理论用法略有差异）。\n这个词在日常英语中几乎不用，主要出现在论文、课堂讲义和形式语义学讨论中。"]}
{"word":"prejournalistic","summary":{"en":"Prejournalistic means “before modern journalism” or “like early, not-yet-professional news forms.”","zh":"prejournalistic 指“现代新闻业之前的”，或“类似早期、尚未职业化的新闻传播形式”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing before modern, professional journalism, or relating to early forms of news-sharing (such as pamphlets, broadsides, rumors, or court reports) that came before today’s journalistic standards.","zh":"存在于现代职业新闻业之前的；或指早期“新闻传播”形式（如传单、布告、谣言、宫廷/官方记录等），尚未具备当代新闻规范的。"},"examples":[{"en":"The book describes a prejournalistic culture in which people learned news mainly through gossip and public announcements.","zh":"这本书描述了一种前新闻主义的文化：人们主要通过闲谈和公共告示获取消息。"},{"en":"Some historians call these handwritten newsletters a prejournalistic medium.","zh":"一些历史学家把这些手写通讯称为前新闻主义的媒介。"}]}],"synonyms":["proto-journalistic","early news-related","pre-press-era"],"phonetic":"/ˌpriˌdʒɝnəˈlɪstɪk/","extraExplanation":["“pre-”表示“在……之前”。“prejournalistic”常见于历史、媒体研究写作，用来区分：在报纸制度化、编辑规范、采访与核实流程成熟之前的“准新闻/早期新闻传播”。","它并不一定带贬义；更多是在描述一种发展阶段：信息可能更零散、来源更不透明、叙述更像传闻或宣传，而不是现代意义上的“新闻报道”。","相关概念可联想到：broadsides（单页大字报/布告）、pamphlets（小册子/宣传册）、gazette（早期公报/报刊）、oral news（口头传播的消息）。"]}
{"word":"prejudge","summary":{"en":"“Prejudge” means to judge or decide in advance, often unfairly and without enough information.","zh":"“prejudge” 指在信息不足时就提前下结论、预先评判，常含不公平的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To form an opinion about someone or something before having enough information; to judge in advance (often unfairly).","zh":"在了解足够信息之前就对某人或某事形成看法；预先评判（通常带有不公平的成分）。"},"examples":[{"en":"Try not to prejudge people based on their appearance.","zh":"尽量不要只凭外表就预判别人。"},{"en":"The interviewer promised she wouldn’t prejudge any applicant before reading the full résumé.","zh":"面试官承诺在看完完整简历之前不会预先评判任何应聘者。"}]},{"partOfSpeech":"vt.","definition":{"en":"To decide a legal case or issue beforehand, especially in a way that prevents a fair trial.","zh":"（法律）预先裁定某个案件或问题，尤其指以影响公正审理的方式。"},"examples":[{"en":"The judge warned the jury not to prejudge the case before hearing all the evidence.","zh":"法官警告陪审团在听完所有证据之前不要预断案情。"},{"en":"Public comments can prejudge the investigation and damage trust.","zh":"公开评论可能会预断调查结果并损害信任。"}]}],"synonyms":["judge prematurely","jump to conclusions","assume","preconceive"],"phonetic":"/ˌpriːˈdʒʌdʒ/","extraExplanation":["“pre-”表示“在……之前”，“judge”是“判断”。因此 prejudge 的核心意思就是“提前下结论”。","学习提示：prejudge 常带有“信息不足却先入为主”的负面含义；更中性的表达可以用 “form an early impression（形成初步印象）”。","常见搭配：prejudge someone/something; prejudge based on…; don’t prejudge.","相关词：prejudice（n. 偏见），prejudiced（adj. 有偏见的），judgment/judgement（n. 判断）。"]}
{"word":"prejudged","summary":{"en":"“Prejudged” means judged in advance, often unfairly or before enough information is known.","zh":"“prejudged”表示在信息不足时就提前下判断，常带不公平或先入为主的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to form an opinion or judgment about someone or something before you have enough information; to judge in advance (often unfairly)","zh":"在了解足够信息之前就对某人或某事下结论；预先评判（常带不公平的意味）"},"examples":[{"en":"I prejudged her based on her accent, and I was wrong.","zh":"我因为她的口音就先入为主地评判了她，结果我错了。"},{"en":"Don’t prejudge the new policy until you read the full details.","zh":"在你读完全部细节之前，别急着对新政策下结论。"}]},{"partOfSpeech":"vt.","definition":{"en":"to decide a legal case or issue beforehand; to make a decision in advance","zh":"（法律/正式语境）预先裁决；提前决定（案件或争议）"},"examples":[{"en":"A judge must not prejudge a case before hearing all the evidence.","zh":"法官在听取所有证据之前不应预先裁决案件。"},{"en":"The committee was accused of having prejudged the outcome.","zh":"该委员会被指责已经预先决定了结果。"}]}],"synonyms":["prejudge","judge beforehand","preconceive","assume","jump to conclusions"],"phonetic":"/ˌpriːˈdʒʌdʒd/","extraExplanation":["“prejudged”常作为动词“prejudge”的过去式/过去分词使用，也常见于被动结构：be prejudged（被预先评判）。","词源上由“pre-”（在……之前）+“judge”（判断）组成，含义直观：在事实充分之前就先判断。","学习提示：别和“prejudice”（偏见，名词）混淆；prejudge强调“动作：先判断”，prejudice更强调“状态/态度：偏见”。"]}
{"word":"prejudgement","summary":{"en":"A prejudgement is an opinion formed too early—before enough facts—often leading to unfairness.","zh":"prejudgement 指在事实不充分前就形成的看法或判断，常带来不公平的先入为主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opinion or decision formed before you have enough information, often in an unfair way; a preconceived judgment.","zh":"在了解事实之前就形成的看法或判断；常带有不公正的“先入为主/预断”。"},"examples":[{"en":"Try not to make a prejudgement about someone just because of their accent.","zh":"不要仅仅因为一个人的口音就对他先入为主地下判断。"},{"en":"Her prejudgement of the situation caused unnecessary tension in the team.","zh":"她对情况的预断给团队带来了不必要的紧张。"},{"en":"The article warns against prejudgement and encourages readers to check the facts first.","zh":"这篇文章提醒人们不要先入为主，并鼓励读者先核实事实。"}]}],"synonyms":["prejudgment","preconception","assumption","bias","premature judgment","jumping to conclusions"],"phonetic":"/ˌprɛdʒʌdʒˈmɛnt/","extraExplanation":["“prejudgement”在英语里能被理解，但更常见、更标准的拼写（尤其是美式英语）是“prejudgment”；英式英语中也常见“prejudice/prejudgement”的相关用法。","在法律语境中，“prejudgment”常指“在正式裁决前的判断/偏见”，比如担心陪审员“prejudgment the case”（未审先判）。","词源上可拆解为 pre-（在……之前）+ judgment（判断）。日常表达中也可以用更常见的词组：“jump to conclusions”（妄下结论）或“make assumptions”（做假设）。"]}
{"word":"prejudger","summary":{"en":"A person who decides too early without enough facts.","zh":"未掌握足够事实就过早下结论的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who forms an opinion or decision too early, before knowing all the facts; someone who “prejudges.”","zh":"预先下结论的人；未了解全部事实就先作判断的人。"},"examples":[{"en":"It’s hard to have a fair discussion with a prejudger who refuses to listen.","zh":"和一个拒绝倾听、总是预先下结论的人很难进行公平的讨论。"},{"en":"Try not to be a prejudger—ask questions before you decide.","zh":"尽量不要做预先下结论的人——先提问、再判断。"}]}],"synonyms":["someone who prejudges","judger (rare in this sense)","biased person (close)"],"phonetic":"/ˌpriːˈdʒʌdʒɚ/","extraExplanation":["“Prejudger”由动词“prejudge（预先判断）”加上表示“人”的后缀“-er”构成，但在现代英语里并不常用；更常见的表达是“someone who prejudges”或使用名词“prejudgment（先入为主的判断）/ prejudice（偏见）”。","含义上，“prejudger”强调“行动/习惯：过早判断”；而“prejudiced person”更强调“态度：带有偏见”。在写作中可根据侧重点选择。"]}
{"word":"prejudges","summary":{"en":"“Prejudges” means “judges in advance,” often unfairly, before knowing enough facts.","zh":"“prejudges”表示“在了解事实前就先下判断”，常带不公平、先入为主的含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to form an opinion about someone or something before you have enough information; to judge in advance (often unfairly)","zh":"在了解事实之前就对某人或某事下结论；预先判断（常带不公平的意味）"},"examples":[{"en":"He prejudges people by their accent, which can be unfair.","zh":"他常根据口音就先入为主地评判别人，这可能不公平。"},{"en":"Don’t prejudge the new teacher before you’ve met her.","zh":"在见到新老师之前，别先下结论。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law) to influence or harm the fairness of a legal case before all evidence is heard","zh":"（法律）在证据尚未充分呈现前就影响案件公正；使案件“先被定调”"},"examples":[{"en":"The judge warned the jury not to prejudge the case from headlines.","zh":"法官警告陪审团不要根据新闻标题就先断定案情。"}]}],"synonyms":["judge beforehand","prejudge","jump to conclusions","assume","preconceive"],"phonetic":"/ˌpriˈdʒʌdʒ/","extraExplanation":["“prejudges”是动词“prejudge”的第三人称单数（he/she/it prejudges）。常见搭配：prejudge someone/something; prejudge by…（根据……就先判断）。","注意区分：prejudice（n. 偏见；vt. 使产生偏见/使不利）更常用；prejudge更强调“在了解之前就下判断”，语气较正式。"]}
{"word":"prejudging","summary":{"en":"Prejudging means judging or deciding too early, before you know the facts.","zh":"Prejudging 指在不了解事实前就过早地下结论、先入为主地评判。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To form an opinion or make a decision about someone or something before you have enough information; to judge in advance (often unfairly).","zh":"在信息不足时就先入为主地下结论；预先评判（常带不公平之意）。"},"examples":[{"en":"Try not to be prejudging people based on their accent or appearance.","zh":"尽量不要因为口音或外表就先入为主地评判别人。"},{"en":"The interviewer focused on the candidate’s skills instead of prejudging their background.","zh":"面试官把重点放在候选人的能力上，而不是先入为主地看待其背景。"}]}],"synonyms":["prejudge","judge prematurely","jump to conclusions","assume","preconceive"],"phonetic":"/ˌpriːˈdʒʌdʒɪŋ/","extraExplanation":["“Prejudge”由前缀 pre-（“在……之前”）+ judge（“判断”）组成。现在分词/动名词形式 prejudging 常用于描述一种正在发生的“先下结论”的行为，语气通常偏负面。","容易与“prejudice（偏见）”混淆：prejudge 是“先判断的行为”，prejudice 更强调“根深蒂固的偏见/成见”（名词）或“使产生偏见”（动词）。","更自然的表达常见为：Don’t prejudge. / Don’t prejudge someone. / Don’t prejudge the situation. 也可用更中性的说法：reserve judgment（保留判断）、keep an open mind（保持开放心态）。"]}
{"word":"prejudgment","summary":{"en":"A prejudgment is an opinion made too early—before you know enough—often leading to unfairness.","zh":"prejudgment 指在信息不足时过早下结论的先入判断，常会造成不公平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opinion or decision formed before you have enough information, often unfair or biased.","zh":"在了解充分信息之前就形成的看法或判断，常带有不公平或偏见。"},"examples":[{"en":"Try not to make a prejudgment about someone based on their accent.","zh":"不要因为别人的口音就对他做出先入为主的判断。"},{"en":"The article warns that quick prejudgments can lead to discrimination.","zh":"这篇文章提醒：草率的先入判断可能导致歧视。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of judging something in advance; pre-judging.","zh":"预先评断某事的行为或过程。"},"examples":[{"en":"Prejudgment of the case by the jury is not allowed.","zh":"陪审团不得对案件进行预断。"},{"en":"The company’s policy discourages prejudgment during interviews.","zh":"公司政策不鼓励面试中带有预先评断。"}]}],"synonyms":["preconception","bias","prejudice","pre-judgment","premature judgment"],"phonetic":"/ˌprɛdʒʌdʒˈmɛnt/","extraExplanation":["在日常英语里更常见的是形容词“prejudged / prejudging”或名词“prejudice”（偏见）。prejudgment更偏正式，尤其常出现在法律、媒体评论或学术写作中。","词形上是“pre-（在……之前）+ judgment（判断）”，强调“在证据不足前先下结论”。在法律语境里常与“fair trial（公平审判）”“jury（陪审团）”等搭配，表示不应先入为主。"]}
{"word":"prejudgments","summary":{"en":"“Prejudgments” means judgments formed in advance, often without enough information and sometimes involving bias.","zh":"“prejudgments”指在信息不足前就形成的预先判断，常带有主观成见或偏见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opinions or decisions formed before having enough information; judgments made in advance.","zh":"在缺乏足够信息之前就形成的看法或决定；预先下的判断。"},"examples":[{"en":"Try to meet people without prejudgments; listen first and ask questions.","zh":"尽量不要带着预设判断去认识别人；先倾听，再提问。"},{"en":"Her prejudgments about the new class changed after the first week.","zh":"她对新班级的预设判断在第一周后就改变了。"}]},{"partOfSpeech":"n.","definition":{"en":"A negative bias against a person or group formed in advance (often based on stereotypes).","zh":"对某个人或群体在事先形成的负面偏见（常与刻板印象有关）。"},"examples":[{"en":"Prejudgments about immigrants can lead to unfair treatment at work.","zh":"对移民的成见可能导致职场中的不公平对待。"},{"en":"The training encourages staff to recognize and reduce prejudgments.","zh":"这项培训鼓励员工识别并减少成见。"}]}],"synonyms":["preconceptions","assumptions","biases","prejudices","premature judgments"],"phonetic":"/ˌpriːˈdʒʌdʒmənts/","extraExplanation":["“prejudgment(s)”常见于较正式的写作或讨论中，强调“还没了解清楚就先下结论”。日常口语里更常用“judgment(s)”或“assumption(s)”来表达类似意思。","词形提示：单数是“prejudgment”，复数是“prejudgments”。","相关词区分：prejudice（偏见，尤其指对群体的偏见）更常见；prejudgment更强调“提前判断”的过程或结果。"]}
{"word":"prejudicate","summary":{"en":"Prejudicate means to decide or judge in advance, or to unfairly influence an outcome beforehand.","zh":"Prejudicate 指在了解全部事实前预先判断，或提前造成不公平影响（常见于法律语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to judge or decide something in advance, especially before hearing all the facts; to prejudge","zh":"（尤指在未了解全部事实前）预先判断；先入为主地下结论"},"examples":[{"en":"Try not to prejudicate the case before you read the evidence.","zh":"在阅读证据之前，尽量不要对案件先入为主地下结论。"},{"en":"The judge warned the jury not to prejudicate the defendant’s guilt.","zh":"法官警告陪审团不要预先认定被告有罪。"}]},{"partOfSpeech":"vt.","definition":{"en":"to harm or unfairly influence a result or decision in advance; to bias","zh":"（事先）损害或不公正地影响（结果/决定）；使产生偏见"},"examples":[{"en":"Careless comments can prejudicate an investigation.","zh":"不谨慎的评论可能会不公正地影响调查。"},{"en":"Publishing details too early could prejudicate a fair trial.","zh":"过早公开细节可能会损害公正审判。"}]}],"synonyms":["prejudge","bias","predetermine","preconceive"],"phonetic":"/prɪˈdʒuːdɪkeɪt/","extraExplanation":["“prejudicate”较正式、偏法律/新闻语体，常见于“prejudicate a fair trial（损害公正审判）”“prejudicate the jury（影响陪审团）”。日常英语更常用“prejudge（预判）”或“bias（使偏向）”。","词源上可理解为 pre-（在前）+ judge（判断）：强调“在事实充分呈现之前就先作判断”，或“提前造成不公平影响”。"]}
{"word":"prejudication","summary":{"en":"Prejudication means forming a judgment in advance, often before all facts are known.","zh":"prejudication 指在事实未明前就先做判断（预断），多见于法律或正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of judging something in advance, especially before hearing all the facts (often seen in legal or formal writing)","zh":"（尤用于法律/正式语境）在了解全部事实之前就先行作出判断的行为；预断"},"examples":[{"en":"The judge warned the jury not to make any prejudication before hearing all the evidence.","zh":"法官警告陪审团在听完所有证据之前不要先下预断。"},{"en":"Public prejudication can damage a fair trial.","zh":"公众的先入为主的预断会损害公正审判。"}]}],"synonyms":["prejudgment","pre-judgment","prejudgement","preconception","bias"],"phonetic":"/priˌdʒuːdɪˈkeɪʃən/","extraExplanation":["“prejudication”在现代英语中较少见，更常见的是“prejudgment / pre-judgment（预断）”或“prejudice（偏见；使……受损）”。在法律语境里，它强调“还未充分审理就先做判断”，容易导致不公。","词形上可理解为 pre-（在……之前）+ judic-（判断/审判，与 judge 同源）+ -ation（名词后缀，表示行为/过程）。"]}
{"word":"prejudicative","summary":{"en":"Prejudicative describes something that is harmful or unfairly biasing, especially in legal contexts.","zh":"prejudicative 指“有害或造成不公平偏见的”，尤用于法律等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) causing harm or disadvantage; likely to influence someone unfairly or damage a fair process.","zh":"（正式）有害的；不利的；可能造成偏见或损害公平程序的。"},"examples":[{"en":"The judge ruled that the comment was prejudicative and told the jury to ignore it.","zh":"法官裁定该评论具有偏害性，并指示陪审团忽略它。"},{"en":"Publishing the suspect’s name early could be prejudicative to a fair trial.","zh":"过早公布嫌疑人姓名可能会对公平审判造成不利影响。"}]}],"synonyms":["prejudicial","harmful","detrimental","biasing","unfair"],"phonetic":"/ˌpriːdʒəˈdɪkətɪv/","extraExplanation":["“prejudicative”较少见，常出现在法律或正式写作中，含义接近更常用的“prejudicial”。在法庭语境里，它通常指某些证据、言论或报道会“影响公正”“误导陪审团”或“损害当事人权益”。"]}
{"word":"prejudicator","summary":{"en":"A prejudicator is someone who prejudges—decides too early without enough evidence.","zh":"prejudicator 指“预断者”，即在证据不足时就过早下结论的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who forms an opinion or decision too early, especially without enough evidence; someone who prejudges","zh":"（尤指缺乏证据就）过早下结论的人；预断者"},"examples":[{"en":"A fair judge should not be a prejudicator who decides before hearing both sides.","zh":"公正的法官不应是未听双方陈述就先下结论的预断者。"},{"en":"In science, being a prejudicator can lead you to ignore data that doesn’t fit your idea.","zh":"在科学研究中，过早下结论会让你忽视与观点不符的数据。"}]}],"synonyms":["prejudger","biased judge","prejudiced person"],"phonetic":"/priˈdʒuːdɪˌkeɪtər/","extraExplanation":["“prejudicator”在现代英语里非常少见，更常用的表达是“someone who prejudges / prejudges things”或形容词“prejudiced person（有偏见的人）”。","注意不要和“adjudicator（裁决者/仲裁人）”混淆：adjudicator强调“依法/按规则作出裁决”，而prejudicator强调“在了解事实前就先判断”。","相关词：prejudge（v. 预先判断）、prejudgment（n. 预断）、prejudice（n. 偏见；v. 使产生偏见）。"]}
{"word":"prejudice","summary":{"en":"Prejudice means an unfair, pre-judged opinion about someone, or a harmful disadvantage in a situation.","zh":"Prejudice 指对他人/群体在不了解情况下形成的不公平成见，也可指造成不利影响的“损害”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unfair opinion or feeling about a person or group, formed without enough knowledge or experience (often based on stereotypes).","zh":"偏见；成见：在缺乏足够了解或经验的情况下，对某个人或群体形成的不公平看法或情绪（常与刻板印象有关）。"},"examples":[{"en":"He was denied the job because of prejudice against his accent.","zh":"他因为口音而遭到偏见，没拿到那份工作。"},{"en":"We should challenge prejudice whenever we hear it in everyday conversation.","zh":"我们应在日常对话中听到偏见时就加以质疑与纠正。"},{"en":"Her story shows how prejudice can quietly shape people’s choices.","zh":"她的故事说明偏见会如何悄悄影响人们的选择。"}]},{"partOfSpeech":"n.","definition":{"en":"Harm or damage that makes a situation worse or unfair (often used in the phrase “without prejudice”).","zh":"损害；不利影响（常见于短语“without prejudice”，表示“不损害……权益/不影响……立场”）。"},"examples":[{"en":"The delay caused prejudice to the company’s reputation.","zh":"这次延误对公司的声誉造成了不利影响。"},{"en":"The judge warned the jury not to let media coverage create prejudice.","zh":"法官提醒陪审团不要让媒体报道造成先入为主的不利影响。"}]}],"synonyms":["bias","preconception","bigotry","stereotype","prejudgment"],"phonetic":"/ˈprɛdʒəˌdɪs/","extraExplanation":["常见搭配：racial prejudice（种族偏见）、gender prejudice（性别偏见）、prejudice against + 人/群体（对……的偏见）。","“prejudice”与“discrimination”不同：prejudice 多指内心的偏见/态度；discrimination 多指外在的差别对待/行为。","文化与文学提示：《Pride and Prejudice》（《傲慢与偏见》）里，“prejudice”指因先入为主与社会阶层观念而产生的误解与成见。"]}
{"word":"prejudiced","summary":{"en":"Prejudiced means having unfair, fixed opinions about people or being influenced in an unfair way.","zh":"Prejudiced 指对人或事抱有不公正、先入为主的看法，或指内容/判断不够中立、带偏向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an unfair opinion or feeling about a person or group, usually without enough knowledge or evidence.","zh":"对某个人或群体抱有不公平的看法或情绪，通常缺乏足够了解或证据。"},"examples":[{"en":"Some people are prejudiced against immigrants because of stereotypes.","zh":"有些人因为刻板印象而对移民抱有偏见。"},{"en":"It’s important not to be prejudiced when you meet someone from a different culture.","zh":"遇到不同文化背景的人时，重要的是不要带偏见。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of information, a report, or a trial) influenced in an unfair way, so it is not neutral or objective.","zh":"（指信息、报道或审判）被不公平地影响，因此不够中立或客观。"},"examples":[{"en":"The coverage was prejudiced, focusing only on negative stories.","zh":"这篇报道带有偏见，只关注负面故事。"},{"en":"A prejudiced jury cannot give a fair decision.","zh":"有偏见的陪审团无法做出公正裁决。"}]}],"synonyms":["biased","bigoted","discriminatory","partial","one-sided"],"phonetic":"/ˈprɛdʒədɪst/","extraExplanation":["“prejudiced”来自“prejudice”（偏见），字面含义是“在判断之前（pre- + judge）就下结论”。它常用于讨论种族、性别、宗教、国籍等议题时，语气较严肃，通常带负面评价。","常见搭配：be prejudiced against sb（对某人/某群体有偏见）；a prejudiced view/report（带偏见的观点/报道）。在正式写作中，也常用“biased”表示“有偏向的”，语气有时比“prejudiced”稍弱。"]}
{"word":"prejudicedly","summary":{"en":"Prejudicedly means “in a biased, unfair way,” especially when judging people or groups without facts.","zh":"prejudicedly 指“带着偏见地、不公平地（看待/评价）”，尤其是未了解事实就评判他人或群体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased way; showing or influenced by unfair negative opinions about a person or group before knowing the facts.","zh":"以有偏见的方式；在不了解事实前就对某个人或群体抱有不公平（通常是负面的）看法。"},"examples":[{"en":"The manager judged her prejudicedly because of her accent.","zh":"经理因为她的口音而带着偏见地评价她。"},{"en":"Don’t speak prejudicedly about people you haven’t met.","zh":"不要对你没见过的人带着偏见说话。"}]}],"synonyms":["biasedly","unfairly","discriminatively"],"phonetic":"/ˈprɛdʒədɪstli/","extraExplanation":["“prejudicedly”来自形容词“prejudiced（有偏见的）”，再加副词后缀“-ly”，表示“以……的方式”。日常英语里更常用的表达是“in a prejudiced way”或直接用“biasedly”。","语气与场合：这个词多用于正式写作、评论或批评语境；口语中出现频率较低。"]}
{"word":"prejudiceless","summary":{"en":"“Prejudiceless” means unbiased or without prejudice, but it is uncommon; “unprejudiced,” “impartial,” or “unbiased” are more natural.","zh":"“prejudiceless”意为“没有偏见的/公正的”，但不常用；更地道的说法是“unprejudiced / impartial / unbiased”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without prejudice; not biased against a person or group.","zh":"没有偏见的；不带歧视的；公正的。"},"examples":[{"en":"A good judge should be prejudiceless and focus only on the evidence.","zh":"一位好的法官应当不带偏见，只关注证据。"},{"en":"We need a prejudiceless discussion about immigration and jobs.","zh":"我们需要就移民与就业进行一次不带偏见的讨论。"}]}],"synonyms":["unbiased","impartial","unprejudiced","open-minded","fair-minded"],"phonetic":"ˈprɛdʒədɪsləs","extraExplanation":["“prejudiceless”是由 prejudice（偏见）+ -less（“没有……”）构成，意思很直观，但在现代英语里并不常见。更自然、更常用的表达通常是 unprejudiced、impartial、unbiased。","在正式写作中，用 unprejudiced / impartial 往往更地道；“prejudiceless”更可能出现在学习者写作、口语临时造词，或个别作者为了强调“完全没有偏见”而使用。"]}
{"word":"prejudices","summary":{"en":"“Prejudices” means unfair beliefs or feelings about others; it can also mean actions or comments that unfairly influence someone’s judgment.","zh":"“Prejudices”指对他人的不公平看法或情绪（偏见）；也可指使判断变得不公正的影响或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Unfair opinions or feelings about a person or group, often formed without enough knowledge or experience.","zh":"对某个人或群体的不公平看法或情绪，常常在缺乏了解或经验的情况下形成。"},"examples":[{"en":"She faced prejudices at work because of her accent.","zh":"她因为口音在工作中遭遇偏见。"},{"en":"We should challenge our own prejudices and listen more.","zh":"我们应该反思自己的偏见，多倾听。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause someone to have an unfair opinion, or to harm the chance of something being accepted (often used as “prejudice against”).","zh":"使某人产生偏见；或损害某事被接受的机会（常与“prejudice against”连用）。"},"examples":[{"en":"The rumor may prejudice people against the new student.","zh":"这个谣言可能会让大家对新同学产生偏见。"},{"en":"Public comments could prejudice the jury.","zh":"公开评论可能会影响陪审团的公正判断。"}]}],"synonyms":["bias","preconception","stereotype","bigotry"],"phonetic":"/ˈprɛdʒəˌdɪsɪz/","extraExplanation":["“Prejudices”是“prejudice”的复数形式，表示“多种偏见”或“不同方面的偏见”。可数时常用复数；不可数时也可用单数泛指“偏见这种现象”（e.g., prejudice in society）。","词源上，“pre-”（在……之前）+“judge”（判断），字面意思是“在了解之前就下判断”，所以核心含义是“先入为主的不公平判断”。","常见搭配：racial prejudices（种族偏见），gender prejudices（性别偏见），prejudice against…（对……有偏见），overcome/face prejudice（克服/面对偏见），deep-seated prejudice（根深蒂固的偏见）。","文学/文化中常见：Jane Austen 的《Pride and Prejudice》（《傲慢与偏见》）让“prejudice”这个词更广为人知，强调先入为主的判断如何影响人际关系与决定。"]}
{"word":"prejudiciable","summary":{"en":"Prejudiciable means “likely to cause harm or unfair disadvantage,” especially in legal or formal contexts.","zh":"prejudiciable 指“可能造成损害或不利影响”，多用于法律或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) Likely to cause harm, damage, or unfair disadvantage to someone’s rights, interests, or position.","zh":"（正式用语）可能造成伤害、损害，或对某人的权利、利益、处境造成不利（产生偏害）的。"},"examples":[{"en":"The lawyer argued that releasing the documents now would be prejudiciable to the defendant’s right to a fair trial.","zh":"律师主张现在公开这些文件会损害被告获得公正审判的权利。"},{"en":"Public comments by officials can be prejudiciable during an ongoing investigation.","zh":"在调查进行期间，官员的公开评论可能造成不利影响。"}]}],"synonyms":["prejudicial","harmful","damaging","detrimental","adverse"],"phonetic":"/ˌprɛdʒəˈdɪʃəbəl/","extraExplanation":["这个词在现代英语里比较少见，更多出现在法律或正式写作中，强调“会造成不利后果/损害权利”。在日常表达中更常用的说法有：prejudicial（更常见）、harmful、damaging、detrimental。","不要和 prejudice（偏见）混淆：prejudiciable 的核心是“造成不利/损害”，不一定指“带有偏见”。在法律语境里，它常与 rights（权利）、fair trial（公正审判）、case（案件）等搭配。"]}
{"word":"prejudicial","summary":{"en":"Prejudicial means unfairly biased or likely to cause an improper, unfair influence—especially in legal contexts.","zh":"Prejudicial 指“带有偏见的”或“可能造成不当、不公影响的”，在法律语境中尤常见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unfairly negative or harmful to someone or something; showing prejudice or causing bias.","zh":"不公平地负面或有害的；带有偏见的，或会造成偏见/偏向的。"},"examples":[{"en":"Comments like that are prejudicial and can hurt people.","zh":"那样的评论带有偏见，会伤害别人。"},{"en":"The judge told the jury to ignore any prejudicial information.","zh":"法官告诉陪审团要忽略任何可能造成偏见的信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law) Likely to influence a decision in an improper way, making a fair judgment difficult.","zh":"（法律）可能不当地影响裁决，使公正判断变得困难的。"},"examples":[{"en":"The defense argued that the evidence was more prejudicial than helpful.","zh":"辩方主张该证据带来的偏见影响大于其帮助。"},{"en":"The article contained prejudicial statements that could affect the trial.","zh":"那篇文章包含可能影响审判公正的偏颇说法。"}]}],"synonyms":["biased","discriminatory","unfair","partial","one-sided","harmful"],"phonetic":"/ˌprɛdʒəˈdɪʃəl/","extraExplanation":["词源与搭配：prejudicial 来自 prejudice（偏见；成见）。常见搭配有 prejudicial remarks/comments（带偏见的言论）、prejudicial treatment（歧视性对待）、prejudicial effect（不利/有偏向的影响）。","与“prejudice”的区别：prejudice 更常指“偏见”本身（名词），或“使产生偏见”（动词）；prejudicial 是形容词，强调“带偏见的/会造成不公影响的”。","法律语境提示：在美国法律表达中常见“unduly prejudicial（过度造成偏见）”，意思是某信息的负面情绪影响可能让陪审团不客观，因此可能被排除。"]}
{"word":"prejudicially","summary":{"en":"Prejudicially means ‘in a biased/unfair way,’ and in legal contexts ‘in a way that unfairly harms a case or party.’","zh":"prejudicially 指“带偏见/不公平地”；在法律语境中指“以不当方式对案件或一方造成不利影响地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased or unfair way that harms someone’s chances or reputation; with prejudice.","zh":"带偏见地；不公平地（以偏见对待，从而损害他人的机会或名誉）。"},"examples":[{"en":"The interviewer spoke prejudicially about applicants from certain neighborhoods.","zh":"面试官带偏见地谈论来自某些社区的求职者。"},{"en":"If you judge people prejudicially, you may miss their real abilities.","zh":"如果你带偏见地评价别人，你可能会忽视他们真正的能力。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Law) In a way that causes disadvantage or legal harm to a party or a case.","zh":"（法律）以造成不利或法律损害的方式；对一方或案件产生不利影响地。"},"examples":[{"en":"The judge ruled that the evidence was presented prejudicially and could mislead the jury.","zh":"法官裁定该证据的呈现方式具有不利影响，可能误导陪审团。"},{"en":"Comments made prejudicially can affect the fairness of a trial.","zh":"带有不利影响的言论可能影响审判的公正性。"}]}],"synonyms":["unfairly","biasedly","partially","discriminatorily","detrimentally"],"phonetic":"/ˌprɛdʒəˈdɪʃəli/","extraExplanation":["在法律英语里，prejudicially 常与“公平审判”相关，意思不是“有成见地”那么简单，而是“会对陪审团/案件判断造成不当影响”。常见搭配有: prejudicially affect（不利地影响）、prejudicially presented evidence（以造成不利影响的方式呈现证据）。"]}
{"word":"prejudicialness","summary":{"en":"Prejudicialness means the quality of being likely to cause unfair harm or bias, especially in formal or legal settings.","zh":"Prejudicialness 指“具有可能造成不公平伤害或偏见的不利性”，尤其常见于正式或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being prejudicial; likely to cause unfair harm, disadvantage, or bias (often in legal or formal contexts).","zh":"“有偏害性/不利性”的性质；指可能造成不公平的伤害、不利影响或偏见（常见于法律或正式语境）。"},"examples":[{"en":"The judge considered the prejudicialness of the evidence before allowing the jury to hear it.","zh":"法官在允许陪审团听取该证据前，先考虑了该证据可能造成的不利偏害性。"},{"en":"They argued that the article’s tone increased the prejudicialness of the report against immigrants.","zh":"他们认为文章的语气加重了报道对移民的不利偏见。"}]}],"synonyms":["prejudice","bias","unfairness","harmfulness","prejudicial effect","adverse impact"],"phonetic":"/ˌprɛdʒəˈdɪʃəl.nəs/","extraExplanation":["“prejudicialness”较少见，更常用的表达是“prejudice”（偏见/歧视）、“prejudicial effect”（不利影响/偏害效果）或“prejudicial impact”。在英美法律语境中，常讨论证据是否会对陪审团造成“不公平的偏见”（unfair prejudice）。","构词上：prejudicial（有偏害性的/不利的）+ -ness（名词后缀，表示“……的状态/性质”）。因此它强调“这种性质/程度”，而不是具体的偏见本身。"]}
{"word":"prejudicing","summary":{"en":"Prejudicing means (1) harming someone’s chances/rights or (2) causing unfair bias before the facts are known.","zh":"Prejudicing 指（1）损害某人的机会/权利，或（2）在事实不清前造成不公平的偏见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"causing harm or damage to someone’s rights, chances, or reputation; making a situation less fair.","zh":"损害（某人的权利、机会或名誉）；使情况变得不公。"},"examples":[{"en":"The lawyer argued that the news coverage was prejudicing the jury.","zh":"律师辩称新闻报道正在影响陪审团的公正判断。"},{"en":"Delays in shipping are prejudicing small businesses that rely on quick delivery.","zh":"运输延误正在损害依赖快速配送的小企业。"}]},{"partOfSpeech":"v.","definition":{"en":"creating or increasing bias against someone or something; leading people to judge unfairly before knowing the facts.","zh":"使人产生或加深偏见；在了解事实前就导致不公平的判断。"},"examples":[{"en":"That stereotype is prejudicing how people see immigrants.","zh":"那种刻板印象正在影响人们看待移民的方式。"},{"en":"Try not to let one bad experience go on prejudicing your view of the whole group.","zh":"尽量别让一次不愉快的经历继续影响你对整个群体的看法。"}]}],"synonyms":["biasing","influencing","skewing","harming","damaging","disadvantaging"],"phonetic":"/ˈprɛdʒəˌdaɪsɪŋ/","extraExplanation":["“prejudice”作动词时常见于较正式或法律语境，表示“损害/不利影响”，比如：prejudice the case（对案件造成不利影响）、prejudice the jury（影响陪审团公正）。","在日常英语里，更常用形容词/名词表达偏见：biased / prejudice（偏见）。例如：He is biased. / She has prejudice. 但“prejudicing”也能用来强调“正在造成偏见/不利影响”的过程。"]}
{"word":"prejudicious","summary":{"en":"Prejudicious means harmful or likely to cause unfair bias; it’s a rarer form of prejudicial.","zh":"prejudicious 指“有害的、会造成偏见或不利影响的”；它较少见，常用对应词是 prejudicial。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmful; causing prejudice or damage (often by making someone less likely to be treated fairly).","zh":"有害的；会造成偏见或不利影响的（常指让某人更难被公平对待）。"},"examples":[{"en":"Public comments like that can be prejudicious to a fair trial.","zh":"那样的公开言论可能会对公正审判造成不利影响。"},{"en":"The rumor was prejudicious to her reputation.","zh":"那个谣言对她的名誉造成了损害。"}]}],"synonyms":["prejudicial","harmful","damaging","detrimental","biased"],"phonetic":"/ˌprɛdʒəˈdɪʃəs/","extraExplanation":["“prejudicious”这个词在现代英语里比较少见，更常用的是“prejudicial”。两者意思非常接近：都表示“造成不利影响/引起偏见/有害于公正”。在正式写作（法律、新闻）中通常优先选“prejudicial”。","词源上与“prejudice（偏见；不利）”相关：pre-（在前）+ judge（判断），原本含义有“预先判断”，引申为“偏见”或“使事情变得不利”。"]}
{"word":"prejudiciously","summary":{"en":"Prejudiciously means “in a biased, unfair way,” judging before you know the facts.","zh":"prejudiciously 表示“带着偏见、不公平地”，在不了解事实前就先下结论。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased or prejudiced way; judging unfairly before knowing the facts.","zh":"以偏见的方式；在不了解事实前就不公平地下结论。"},"examples":[{"en":"The committee evaluated the candidates prejudiciously, focusing on their accents instead of their skills.","zh":"委员会带着偏见评估候选人，把注意力放在口音而不是能力上。"},{"en":"If you read the report prejudiciously, you may miss the strongest evidence.","zh":"如果你带着偏见阅读这份报告，你可能会忽略最有力的证据。"}]}],"synonyms":["biasedly","unfairly","prejudicially","with prejudice"],"phonetic":"/ˌprɛdʒəˈdɪʃəsli/","extraExplanation":["“prejudiciously”在现代英语中很少见；更常用、更标准的说法通常是“prejudicially”（意为“带来不利影响/造成偏见地”）或“with prejudice / in a biased way”。在正式写作中，建议优先用“prejudicially”或直接用“biasedly / unfairly”。","词根提示：prejudice（偏见）+ -ous（形容词后缀）+ -ly（副词后缀），整体强调“带着偏见地”。"]}
{"word":"prejunior","summary":{"en":"Prejunior describes a level or group that comes before “junior,” often in schools or sports.","zh":"Prejunior 指“junior 之前”的级别或组别，常见于学校或体育等分级体系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in schools, clubs, or sports) coming before the “junior” level; for younger or less advanced members than juniors.","zh":"（尤用于学校、社团或体育分组）“junior（青少年/初级）”之前的阶段；比 junior 年龄更小或程度更初级。"},"examples":[{"en":"She joined the prejunior swim team this year.","zh":"她今年加入了 prejunior（低于 junior 的）游泳队。"},{"en":"The program has prejunior and junior groups.","zh":"这个项目分为 prejunior 组和 junior 组。"}]},{"partOfSpeech":"n.","definition":{"en":"A prejunior member, group, or category.","zh":"prejunior 组员；prejunior 组别/类别。"},"examples":[{"en":"He competed as a prejunior at the regional meet.","zh":"他以 prejunior 组别参加了地区比赛。"},{"en":"Prejuniors practice on Mondays and Wednesdays.","zh":"prejunior 组在周一和周三训练。"}]}],"synonyms":["pre-junior","before junior","under-junior (less common)"],"phonetic":"/ˌpriːˈdʒuːniər/","extraExplanation":["“pre-”是英语常见前缀，表示“在……之前”。因此 prejunior 字面意思就是“在 junior 之前”。","这个词多见于特定机构的分级命名（如学校课程、兴趣班、体育队、童子军等），并不是所有场合都通用；不同组织对年龄/水平的划分可能不一样。","更常见的写法有时会用连字符：pre-junior。"]}
{"word":"prejurisdiction","summary":{"en":"“Prejurisdiction” describes the stage before a court’s jurisdiction is established, often used in legal writing.","zh":"“prejurisdiction”指法院（或机关）尚未确定/取得管辖权之前的阶段，多用于法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal) Before a court, agency, or authority has the legal power (jurisdiction) to hear or decide a case; occurring at the stage where jurisdiction has not yet been established.","zh":"（法律）在法院/机构/机关尚未取得对案件的管辖权之前的；发生在“管辖权尚未确定”的阶段。"},"examples":[{"en":"The judge limited the hearing to prejurisdiction questions, such as whether the court could hear the case at all.","zh":"法官将听证范围限制在管辖权确定前的问题上，例如法院是否根本有权审理该案。"},{"en":"Prejurisdiction filings often focus on service of process and where the lawsuit should be brought.","zh":"管辖权确定前的文件往往聚焦于送达程序以及应在何地起诉。"}]},{"partOfSpeech":"n.","definition":{"en":"A pre-jurisdiction stage or period in a legal process (less common usage).","zh":"（较少见）法律程序中“管辖权之前”的阶段或期间。"},"examples":[{"en":"The case spent months in prejurisdiction while the parties argued about venue.","zh":"当事人就审判地点争执不下，案件在“管辖权之前”的阶段拖了数月。"}]}],"synonyms":["pre-jurisdiction","before jurisdiction is established","jurisdictional threshold (issues)","jurisdictional stage"],"phonetic":"/ˌpriːˌdʒʊrɪsˈdɪkʃən/","extraExplanation":["“prejurisdiction”不是日常英语里的常用词，更多见于法律写作或诉讼文件中；很多作者会写成带连字符的“pre-jurisdiction”，或改用更常见的表达：before jurisdiction is established / jurisdictional threshold issues / jurisdictional stage。","与其相关的常见法律概念包括：subject-matter jurisdiction（事项管辖/案件类型管辖）、personal jurisdiction（属人管辖/对当事人的管辖）、venue（审判地/管辖地区）、service of process（诉讼文书送达）。"]}
{"word":"prejustification","summary":{"en":"Prejustification means providing reasons or justification ahead of time, sometimes in academic or religious contexts.","zh":"Prejustification 指在事情发生前先给出理由或辩护，有时用于学术或宗教讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving a justification in advance (before an action, decision, or claim happens), often to make it seem acceptable or unavoidable","zh":"预先辩护；事先正当化（在行动、决定或主张发生之前先给出理由，使其看起来合理或不可避免）"},"examples":[{"en":"The report reads like a prejustification for cutting the budget.","zh":"这份报告读起来像是在为削减预算做预先辩护。"},{"en":"She offered a prejustification for the delay before anyone complained.","zh":"还没人抱怨之前，她就先为延误做了事先解释。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some religious or philosophical writing) justification that is said to come before a person’s conscious choice or moral change","zh":"（宗教或哲学语境）先于个人自觉选择或道德转变的“称义/正当化”"},"examples":[{"en":"In that tradition, prejustification is discussed alongside grace and free will.","zh":"在该传统中，“预先称义”常与恩典和自由意志一起讨论。"}]}],"synonyms":["advance justification","preemptive justification","rationalization (often negative)","prior justification"],"phonetic":"/ˌpriːˌdʒʌstɪfɪˈkeɪʃən/","extraExplanation":["“prejustification”不是日常高频词，更常见的表达是“justify in advance / pre-emptively justify”。它多见于学术写作、批评性文章或神学讨论中。","词形结构：pre-（在……之前）+ justification（辩护/正当化）。在批评语境里，它有时带有贬义，暗示“先找理由为不合理的事铺路”。"]}
{"word":"prejustified","summary":{"en":"Prejustified means “already justified in advance,” though it’s rare; it’s sometimes used in theology.","zh":"prejustified 意为“预先被正当化/预先称义的”，较少见；偶尔见于神学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already justified in advance; treated as right, acceptable, or proven before a later event or explanation happens","zh":"预先被证明为正当的；在事情发生或解释之前就被视为正确/合理/成立的"},"examples":[{"en":"The company’s press release sounded prejustified, as if the decision needed no explanation.","zh":"公司的新闻稿听起来像是“预先正当化”的，好像这个决定不需要任何解释。"},{"en":"He offered a prejustified excuse before anyone even questioned him.","zh":"还没人质疑他，他就先抛出了一个“预先正当化”的借口。"}]},{"partOfSpeech":"adj.","definition":{"en":"(specialized, theology) described as being justified by God beforehand (an uncommon term, sometimes used in discussions of predestination and salvation)","zh":"（神学用语）被描述为“预先称义”的（较少见，偶见于关于预定论与救恩的讨论）"},"examples":[{"en":"Some writers debate whether believers can be called prejustified in certain theological systems.","zh":"一些作者会讨论在某些神学体系中，信徒是否可以被称为“预先称义的”。"}]}],"synonyms":["justified in advance","already justified","pre-approved (context-dependent)","pre-validated (context-dependent)","preemptively justified"],"phonetic":"/ˌpriːˈdʒʌstəˌfaɪd/","extraExplanation":["这个词在日常英语里非常少见，更常见的表达是 already justified / justified in advance / pre-approved（若强调“事先批准”）/ pre-validated（若强调“事先验证”）。","构词上：pre- 表示“在……之前”，justified 表示“被证明正当/合理；被辩护成立”。因此 prejustified 往往带有一种语气：说话者觉得某种立场或决定在解释之前就被“先行合理化”了。","写作建议：如果你想表达“为了某个结论而提前找理由”，更地道的词常是 rationalized in advance / a preemptive justification。"]}
{"word":"prejustify","summary":{"en":"“Prejustify” means to justify something ahead of time.","zh":"“prejustify”指在事情发生前就先为其辩解或合理化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to justify something in advance (before it actually happens), often by giving reasons or excuses ahead of time","zh":"事先为某事辩解／预先合理化（在事情发生前先给出理由或借口）"},"examples":[{"en":"He tried to prejustify the delay by blaming traffic before the meeting even started.","zh":"会议还没开始，他就先用堵车来为迟到预先辩解。"},{"en":"Don’t prejustify your decision—wait until you have the full facts.","zh":"别急着为你的决定预先辩解——等掌握全部事实再说。"}]}],"synonyms":["justify in advance","preemptively justify","make excuses in advance","rationalize in advance"],"phonetic":"/ˌpriːˈdʒʌstəˌfaɪ/","extraExplanation":["“prejustify”由前缀 pre-（“预先、在……之前”）+ justify（“证明……正当、辩解”）构成。它不是日常最常见的词，更常见的表达是 “justify in advance” 或 “make excuses in advance”。","语用上，“prejustify”常带一点负面含义：暗示说话者还没做事就先找理由，给人“心虚”或“先打预防针”的感觉。"]}
{"word":"prejustifying","summary":{"en":"Prejustifying means justifying something before anyone asks, often by giving reasons or excuses in advance.","zh":"Prejustifying 指在别人还没质疑前就先给出理由或借口，带有“预先辩解”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving reasons or excuses in advance for something you are going to do or say; justifying beforehand","zh":"在做或说之前先提出理由/借口；预先辩解"},"examples":[{"en":"He started prejustifying his late arrival before anyone asked.","zh":"还没人问，他就开始为自己迟到预先辩解。"},{"en":"Stop prejustifying—tell me what happened first.","zh":"别先辩解了——先告诉我发生了什么。"},{"en":"The memo felt like prejustifying a decision that would anger staff.","zh":"那份备忘录读起来像是在为一个会惹恼员工的决定预先辩解。"}]}],"synonyms":["justifying in advance","justifying beforehand","preemptively justifying","preemptive rationalizing","offering excuses in advance"],"phonetic":"/ˌpriːˈdʒʌstəˌfaɪ.ɪŋ/","extraExplanation":["“prejustifying”来自“pre-（在……之前）+ justify（证明……正当/辩解）”。它不是非常常见的日常用词，更常见的说法是“justify in advance / justify beforehand”或“offer an excuse in advance”。","在语气上，它常带有一点负面暗示：说话者似乎“心里有数可能会被质疑”，所以提前铺垫理由。在讨论修辞、公共关系、政治声明或职场沟通时更容易见到。"]}
{"word":"prejuvenile","summary":{"en":"Prejuvenile means “before the juvenile stage,” mainly used in scientific contexts.","zh":"prejuvenile 指“幼体期之前的”，主要用于科学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, medicine) Relating to a stage before the juvenile stage; not yet juvenile.","zh":"（生物学/医学）幼体期之前的；尚未进入幼体阶段的。"},"examples":[{"en":"In some insects, the prejuvenile stages include eggs and early larvae.","zh":"在一些昆虫中，prejuvenile 阶段包括卵和早期幼虫。"},{"en":"The study compared growth rates in prejuvenile and juvenile fish.","zh":"这项研究比较了幼鱼前期与幼鱼期鱼类的生长速度。"}]}],"synonyms":["pre-juvenile","pre-adult (context-dependent)","early developmental"],"phonetic":"/ˌpriːˈdʒuːvənaɪl/","extraExplanation":["这个词多见于学术写作（如动物学、生态学、发育生物学），日常英语里非常少用。","构词：pre- 表示“在……之前”，juvenile 表示“幼体/少年期的”。因此 prejuvenile 字面意思就是“在幼体/少年期之前”。在具体学科里，“juvenile”对应的生命阶段可能不同（例如昆虫、鱼类、两栖类），所以最好结合文章定义来理解。"]}

