{"word":"prela","summary":{"en":"“prela” isn’t a standard English word; it’s likely incomplete or misspelled.","zh":"“prela”不是标准英语单词；很可能不完整或拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or an incomplete form of another word (for example, “prelaw,” “prelate,” or the prefix “pre-” + something).","zh":"不是标准英语单词。更可能是拼写错误或未写完整的词（例如“prelaw”“prelate”，或“pre-”前缀加后面的词）。"},"examples":[{"en":"I couldn’t find “prela” in a dictionary—did you mean “prelaw” or “prelate”?","zh":"我在词典里找不到“prela”——你想写的是“prelaw”还是“prelate”？"}]}],"extraExplanation":["“prela”本身在常见英语词典中通常查不到。如果你告诉我你看到它的句子或想表达的意思，我可以帮你判断最可能的目标词。","常见相近候选：\n- prelaw（准备读法律/法学院方向的）\n- prelate（n. 主教等高级神职人员）\n- pre-（前缀：表示“在……之前/预先”，如 prepay, preschool）"]}
{"word":"prelabel","summary":{"en":"Prelabel means to label something in advance (or an advance-made label).","zh":"prelabel 指“预先贴/做标签”，也可指“预先制作的标签”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to attach a label to something in advance, especially before shipping, stocking, or processing","zh":"（尤指在运输、上架或处理之前）预先给某物贴标签/标注"},"examples":[{"en":"The warehouse prelabels each box with a barcode before it goes on the truck.","zh":"仓库会在装车前给每个箱子预先贴上条形码标签。"},{"en":"Please prelabel the samples with the date and your initials.","zh":"请在样本上预先标注日期和你的姓名缩写。"}]},{"partOfSpeech":"n.","definition":{"en":"a label that is printed or applied in advance","zh":"预先制作/预先贴上的标签"},"examples":[{"en":"Use the prelabel to avoid writing the address by hand.","zh":"用预印标签可以避免手写地址。"}]}],"synonyms":["label in advance","pre-tag","pre-mark"],"phonetic":"/ˌpriːˈleɪbəl/","extraExplanation":["“pre-”是常见前缀，表示“在……之前/预先”。因此 prelabel 字面意思就是“先贴标签”。在正式写作中，也常见写作 pre-label 或用更常用的表达：label in advance / preprint labels（预印标签）。"]}
{"word":"prelabial","summary":{"en":"Prelabial means “before a lip sound,” used mainly in phonetics/linguistics.","zh":"prelabial 指“在唇音之前的”，主要用于语音学/语言学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In linguistics/phonetics) occurring before a labial sound (a sound made with the lips, like /p/, /b/, /m/, /f/, /v/).","zh":"（语言学/语音学）出现在唇音（用嘴唇发出的音，如 /p/、/b/、/m/、/f/、/v/）之前的；前唇音位置的。"},"examples":[{"en":"In some languages, a vowel may become more rounded in a prelabial position.","zh":"在一些语言中，元音在前唇音位置（prelabial position）可能会变得更圆唇。"},{"en":"The researcher compared the vowel quality in prelabial contexts and non-labial contexts.","zh":"研究者比较了前唇音语境与非唇音语境中的元音音质。"}]}],"synonyms":["before a labial (sound)","pre-labial (variant)"],"phonetic":"/priˈleɪbiəl/","extraExplanation":["“pre-”表示“在……之前”，“labial”指“唇音/与嘴唇有关的音”。“prelabial”多见于语音学或历史语言学的描述，用来谈某个音在唇音之前受到影响（例如出现更圆唇的倾向），属于比较专业的术语。"]}
{"word":"prelabor","summary":{"en":"A medical adjective meaning “before the start of childbirth labor.”","zh":"医学形容词，表示“在分娩产程开始之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) happening before the start of labor (childbirth).","zh":"（医学）发生在分娩阵痛/产程开始之前的；产前临产前的。"},"examples":[{"en":"The doctor noted signs of infection in the prelabor period.","zh":"医生记录了临产前阶段出现的感染迹象。"},{"en":"Prelabor rupture of membranes can require careful monitoring.","zh":"临产前胎膜早破可能需要密切监测。"}]}],"synonyms":["before labor","pre-labor","antepartum (medical)"],"phonetic":"/ˌpriːˈleɪbɚ/","extraExplanation":["“prelabor”多用于产科/医学语境，日常英语中很少单独使用。更常见的搭配是 **prelabor rupture of membranes (PROM)**（临产前胎膜早破）。","拼写上有时也会见到 **pre-labor**（加连字符），意思相同，取决于期刊或医院的写法规范。","不要与 **prenatal**（产前，怀孕期间）混用：prenatal 范围更广；prelabor 专指“真正进入产程之前”。"]}
{"word":"prelabrum","summary":{"en":"Prelabrum is an insect-anatomy term for a small plate in front of the labrum (upper lip).","zh":"Prelabrum 是昆虫解剖学术语，指位于唇基（上唇）前方的一小块板状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In insect anatomy) a small plate or sclerite located in front of the labrum (the insect’s “upper lip”), often considered part of the mouthpart region.","zh":"（昆虫解剖）位于唇基（labrum，昆虫的“上唇”）前方的一小块板状硬化结构（骨片），常被视为口器区域的一部分。"},"examples":[{"en":"Under the microscope, the prelabrum appears as a narrow sclerite in front of the labrum.","zh":"在显微镜下，前唇板（prelabrum）看起来是一条位于唇基前方的狭窄硬化片。"},{"en":"The paper describes the shape of the prelabrum to help distinguish between two closely related beetle species.","zh":"论文通过描述前唇板的形状来区分两种亲缘关系很近的甲虫。"}]}],"synonyms":["anterior labral sclerite"],"phonetic":"/priˈleɪbrəm/","extraExplanation":["这是一个比较少见、偏专业的昆虫形态学术语：pre- 表示“在……之前”，labrum 指昆虫口器的“上唇/唇基”。不同昆虫类群对该结构是否独立成“prelabrum”、其边界如何划分，文献中可能存在差异，因此阅读论文时建议结合作者的图示或解剖标注来理解。"]}
{"word":"prelachrymal","summary":{"en":"An anatomical adjective meaning “in front of the tear (lacrimal) structures.”","zh":"一个解剖学形容词，表示“位于泪（泪器）结构前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Situated in front of (or occurring before) the lacrimal structures of the eye (the tear duct/tear gland area).","zh":"（解剖）位于泪器（泪腺、泪道等）前方的；在泪器之前发生的。"},"examples":[{"en":"The surgeon made a small incision in the prelachrymal region near the inner corner of the eye.","zh":"外科医生在眼内眦附近的泪器前区（prelachrymal region）做了一个小切口。"},{"en":"The report describes a prelachrymal swelling that may affect tear drainage.","zh":"报告描述了一个泪器前部的肿胀，可能会影响泪液引流。"}]}],"synonyms":["prelacrimal","anterior to the lacrimal apparatus","in front of the lacrimal region"],"phonetic":"/ˌpriːˈlækrɪməl/","extraExplanation":["“prelachrymal”在现代医学英语中更常写作“prelacrimal”。两者含义相同：pre-（在……之前）+ lacrimal（泪的、泪器的）。","“lachrymal”是“lacrimal”的较旧拼写形式，常见于旧文献或英式拼写影响的资料中；现在多用“lacrimal”。","该词多用于眼科/解剖学语境，日常英语中很少见；遇到时可把它理解为“泪器前方的/泪道前部的”。"]}
{"word":"prelacies","summary":{"en":"Prelacy means the office/authority of a high-ranking church leader (a prelate), or the group of such leaders.","zh":"Prelacy 指主教等高级神职人员的职位/权力，也可指这些高级神职人员的整体（领导层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in Christian churches) the office, rank, or authority of a prelate (a high-ranking clergy member such as a bishop).","zh":"（常用于基督宗教语境）主教等高级神职人员（prelate）的职位、等级或管辖权。"},"examples":[{"en":"He served in the prelacy for decades before retiring.","zh":"他在主教等高级教会职务上任职数十年后才退休。"},{"en":"The dispute was brought to the prelacy for a final decision.","zh":"这场争议被提交给主教当局作最终裁决。"}]},{"partOfSpeech":"n.","definition":{"en":"Prelates as a group; the collective leadership of high clergy.","zh":"主教等高级神职人员的整体；高级教会领导层。"},"examples":[{"en":"The prelacy issued a statement on the new policy.","zh":"主教团（高级神职层）就新政策发表了声明。"}]}],"synonyms":["episcopate","church hierarchy","clergy leadership"],"phonetic":"/ˈprɛləsi/","extraExplanation":["你输入的“prelacies”通常是名词“prelacy”的复数形式（prelacy → prelacies）。这个词带有明显的宗教/教会色彩，多见于讨论天主教或圣公会等教会的等级制度与权力结构。","“prelate”一般指“高级神职人员”（如主教 bishop、大主教 archbishop）。因此“prelacy”可以指：①这种职位/权力本身；②这些人所构成的领导层。日常英语中不算高频，更常见于历史、宗教、政治与教会制度相关的文章。"]}
{"word":"prelacrimal","summary":{"en":"An anatomy term meaning “in front of the lacrimal (tear) region/bone.”","zh":"解剖学术语，指“位于泪区/泪骨前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"located in front of (anterior to) the lacrimal bone or lacrimal region of the face (near the tear duct area)","zh":"位于泪骨或泪区（靠近泪道的部位）前方的；泪前的"},"examples":[{"en":"The surgeon noted a small prelacrimal depression near the nasal side of the orbit.","zh":"外科医生注意到眼眶靠鼻侧有一个小的泪前凹陷。"},{"en":"Some anatomy texts describe a prelacrimal crest on the maxilla.","zh":"一些解剖学教材会描述上颌骨上的泪前嵴。"}]}],"synonyms":["anterior to the lacrimal region","pre-lacrimal"],"phonetic":"/ˌpriːˈlæk.rə.məl/","extraExplanation":["这是一个较少见的医学/解剖学形容词：pre- 表示“在……之前/前方”，lacrimal 表示“泪的、泪器官的”。常见于描述鼻腔、上颌骨、眼眶内侧等区域的结构定位。","相关常见词：lacrimal gland（泪腺）、lacrimal duct（泪管/鼻泪管）、lacrimal bone（泪骨）；方向词对比：anterior（前）、posterior（后）、medial（内侧）、lateral（外侧）。"]}
{"word":"prelacteal","summary":{"en":"“Prelacteal” describes food or drink given to a newborn before breastfeeding begins.","zh":"“prelacteal”指在开始母乳喂养之前给新生儿喂的食物或饮品（或相关的“初乳前喂养”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food or drink) given to a newborn before breastfeeding is started.","zh":"（指食物或饮品）在开始母乳喂养之前给新生儿喂的。"},"examples":[{"en":"Health workers encouraged families to avoid prelacteal feeds and begin breastfeeding within the first hour.","zh":"医护人员鼓励家庭避免给新生儿喂“初乳前食”，并在出生后一小时内开始母乳喂养。"},{"en":"In some communities, sugar water is used as a prelacteal drink.","zh":"在一些社区里，糖水被当作初乳前饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"A food or drink given to a newborn before breastfeeding begins (often called a “prelacteal feed”).","zh":"在开始母乳喂养前给新生儿喂的食物或饮品（常称“prelacteal feed / 初乳前喂养”）。"},"examples":[{"en":"The study recorded whether any prelacteal was given in the first three days after birth.","zh":"研究记录了产后前三天是否给过任何初乳前喂养。"},{"en":"Counseling focused on reducing prelacteals and supporting exclusive breastfeeding.","zh":"咨询重点是减少初乳前喂养，并支持纯母乳喂养。"}]}],"synonyms":["prelacteal feed","pre-breastfeeding feed"],"phonetic":"/ˌpriːˈlæk.ti.əl/","extraExplanation":["“prelacteal”由 pre-（在……之前）+ lacteal（乳的、与乳汁有关的）构成，主要用于医学、公共卫生和营养学语境，日常口语中更常说“prelacteal feed(s)”而不是单独用“prelacteal”。","在母婴健康讨论中，这个词常与“early initiation of breastfeeding（早期开始母乳喂养）”和“exclusive breastfeeding（纯母乳喂养）”一起出现；不同地区的传统做法差异很大，讨论时通常会强调尊重文化并提供循证建议。"]}
{"word":"prelacy","summary":{"en":"Prelacy means the office, authority, or collective leadership of high-ranking church officials (prelates), and sometimes the system of rule under bishops.","zh":"Prelacy 指主教等高级教士的职位与权力、主教团等教会高层的统称，也可指主教制度/教会高层统治体系（有时带批评意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rank, authority, or office of a prelate (a high-ranking church leader such as a bishop)","zh":"（主教等）高级教士的职位、权力或管辖权；主教职权"},"examples":[{"en":"He spent years serving the church before being raised to the prelacy.","zh":"他在教会服务多年后才被擢升为主教等高级教职。"},{"en":"The dispute was settled by an official decision from the prelacy.","zh":"这场争端通过教会高层（主教团）的正式裁决得到解决。"}]},{"partOfSpeech":"n.","definition":{"en":"the group of prelates as a governing body (church leadership)","zh":"（统称）教会主教等高级教士；教会高层"},"examples":[{"en":"The prelacy issued a statement on the matter.","zh":"教会高层就此事发表了声明。"},{"en":"Local priests waited for guidance from the prelacy.","zh":"地方神父等待教会高层的指示。"}]},{"partOfSpeech":"n.","definition":{"en":"the system or influence of church rule led by prelates (sometimes used critically)","zh":"由主教等主导的教会统治体系或影响（有时带贬义）"},"examples":[{"en":"Some reformers argued that prelacy had grown too powerful.","zh":"一些改革者认为主教制度的权力变得过大。"},{"en":"The pamphlet attacked prelacy as an obstacle to change.","zh":"这本小册子抨击主教制度是改革的障碍。"}]}],"synonyms":["episcopacy","bishopric","church leadership","hierarchy"],"phonetic":"/ˈprɛləsi/","extraExplanation":["“prelacy”常见于宗教史与教会政治语境，尤其涉及基督教（多指圣公会、天主教等）中主教层级的权力结构。","词根来自“prelate”（高级教士、主教）+ “-cy”（表示“身份/职位/制度”的名词后缀，如 presidency）。","在英国宗教改革与17世纪的宗教争论中，“prelacy”有时带批评意味，用来指“主教制/教会高层的统治”。"]}
{"word":"prelanguage","summary":{"en":"Prelanguage is a theoretical stage of communication that comes before fully developed language.","zh":"Prelanguage 指在完整语言形成之前的理论性交流阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hypothetical stage of communication before fully developed human language, often involving gestures, sounds, or simple symbols.","zh":"（假设的）“前语言”阶段：指在人类完整语言形成之前的交流形式，常包括手势、声音或简单符号。"},"examples":[{"en":"Some researchers argue that pointing and facial expressions were part of human prelanguage.","zh":"一些研究者认为，指向动作和面部表情属于人类的前语言。"},{"en":"The book discusses how prelanguage might have shaped early social bonds.","zh":"这本书讨论了前语言可能如何塑造早期的社会纽带。"}]}],"synonyms":["prelinguistic communication","prelinguistic stage","proto-communication"],"phonetic":"/ˌpriːˈlæŋɡwɪdʒ/","extraExplanation":["“prelanguage”不是日常高频词，更多见于语言学、人类学、认知科学等学术语境，用来讨论“语言起源”（language origins）或婴幼儿从咿呀学语到真正语言的过渡。","在儿童发展领域，更常用的相关术语是“prelinguistic communication / prelinguistic stage”（前语言交流/前语言阶段），强调婴儿在会说词语前就能用眼神、哭声、手势进行沟通。"]}
{"word":"prelapsarian","summary":{"en":"Prelapsarian means ‘before the Fall’—innocent, pure, and unspoiled (often in religious or literary contexts).","zh":"prelapsarian 指“堕落之前”的状态，常形容天真、纯洁、未受污染（多见于宗教或文学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before the Fall of Adam and Eve; innocent, pure, and untouched by sin or corruption.","zh":"与“堕落之前”（亚当和夏娃犯罪之前）有关的；天真纯洁、未受罪恶或腐化影响的。"},"examples":[{"en":"The poet describes a prelapsarian world where humans live in harmony with nature.","zh":"诗人描写了一个“堕落之前”的世界，人类与自然和谐共处。"},{"en":"She missed the prelapsarian innocence of childhood.","zh":"她怀念童年那种堕落之前般的纯真。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (or thing) imagined as belonging to a state of innocence before moral fall or corruption.","zh":"（较少用）指被想象为处在“堕落之前”那种无罪纯真状态的人（或事物）。"},"examples":[{"en":"In the story, the child is treated as a kind of prelapsarian, unspoiled by the city.","zh":"在故事里，这个孩子被视为一种“堕落之前”的存在，未被城市所污染。"}]}],"synonyms":["innocent","unspoiled","Edenic","pristine"],"phonetic":"/ˌpriːlæpˈsɛriən/","extraExplanation":["词源：pre-（在……之前）+ lapsus（拉丁语“跌落、失足”）。这里的“Fall”是基督教语境中“人类的堕落”（原罪）的专有概念，所以该词常带宗教/文学色彩。","常见用法：多用于文学评论、艺术史或哲学语境，形容伊甸园式的纯真状态（prelapsarian innocence）或“未被现代性破坏的自然/社会”。","文学关联：英语里谈到“失乐园”（Paradise Lost）的伊甸园、浪漫主义对自然纯净的想象，常会用到 prelapsarian 这种带神话象征的形容词。"]}
{"word":"prelaryngoscopic","summary":{"en":"Relating to the time or preparation before a laryngoscopic exam.","zh":"与喉镜检查前的时间或准备有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Happening before a laryngoscopic examination or relating to the period/preparation before laryngoscopy.","zh":"（医学）喉镜检查前的；与喉镜检查前准备阶段有关的。"},"examples":[{"en":"The nurse reviewed the prelaryngoscopic instructions with the patient.","zh":"护士与患者一起复核了喉镜检查前的注意事项。"},{"en":"Prelaryngoscopic fasting may be required if sedation is planned.","zh":"如果计划镇静，可能需要在喉镜检查前禁食。"}]}],"synonyms":["pre-laryngoscopy","before laryngoscopy","preprocedure (for laryngoscopy)"],"phonetic":"/ˌpriːˌlærɪŋɡəˈskɑːpɪk/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ laryngoscopic（“喉镜检查的”）构成，常见于医疗记录、检查流程说明或学术写作中。","在日常英语中不常用；更常见的表达是 “before laryngoscopy” 或 “pre-laryngoscopy (instructions/prep)”。","相关词：laryngoscopy（喉镜检查），laryngoscope（喉镜），preoperative（术前的）可类比记忆。"]}
{"word":"prelate","summary":{"en":"A prelate is a high-ranking Christian church leader, especially a bishop or archbishop.","zh":"prelate 指基督教会中地位较高的领导者，尤指主教或大主教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-ranking Christian clergy member, especially a bishop or archbishop, with authority over other clergy.","zh":"（基督教）高级神职人员，尤指主教或大主教，通常对其他神职人员有管理权。"},"examples":[{"en":"The prelate addressed the congregation during the holiday service.","zh":"这位高级神职人员在节日礼拜中向会众致辞。"},{"en":"As a respected prelate, she worked to improve education in the diocese.","zh":"作为一位备受尊敬的高级神职人员，她致力于改善教区的教育。"}]}],"synonyms":["bishop","archbishop","church leader","cleric"],"phonetic":"/ˈprɛlət/","extraExplanation":["“prelate”源自拉丁语praelatus，意为“被置于前面的人/被提升的人”，因此常带有“地位较高、具领导权”的含义。","在英语语境里它多用于天主教、圣公会等有明确教阶制度的传统中；在新闻或历史写作中常见，语气较正式。"]}
{"word":"prelatehood","summary":{"en":"Prelatehood means the office or status of a high-ranking church leader (like a bishop).","zh":"Prelatehood 指主教等高级神职人员的职位或身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The status, office, or rank of a prelate (a high-ranking member of the clergy, such as a bishop or archbishop).","zh":"（高级神职人员如主教、大主教的）职位、身份或等级；主教（等）之职。"},"examples":[{"en":"In medieval Europe, prelatehood often carried political influence as well as spiritual authority.","zh":"在中世纪欧洲，主教等人的职位往往不仅有宗教权威，也带有政治影响力。"},{"en":"He wrote a memoir about the responsibilities and pressures of prelatehood.","zh":"他写了一本回忆录，讲述担任主教等高级神职的责任与压力。"}]}],"synonyms":["episcopacy","bishopric","prelacy","clerical office"],"phonetic":"/ˈprɛlətˌhʊd/","extraExplanation":["词形拆解：prelate（高级神职人员）+ -hood（表示“身份/状态/时期”的后缀，如 childhood 童年、neighborhood 邻里）。因此 prelatehood 字面意思就是“作为 prelate 的身份/职位”。","使用场景与语域：该词较少用于日常口语，更常见于历史、宗教研究或较正式的写作中。日常表达更常说 the office of a bishop / the episcopacy（主教职）。","文化背景提示：在许多历史时期（尤其是欧洲中世纪），高级教士往往同时拥有宗教与世俗权力，因此讨论 prelatehood 时常会涉及教会与政治的关系。"]}
{"word":"prelateity","summary":{"en":"A rare word meaning the office or power of a prelate (high-ranking church leader).","zh":"一个很少用的词，指高级教士（如主教）的职务或权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The status, office, or power of a prelate (a high-ranking Christian church leader such as a bishop).","zh":"（罕见、非标准用法）主教等高级教士的身份、职务或权力。"},"examples":[{"en":"In some older writings, the author criticizes church “prelateity” as worldly ambition.","zh":"在一些较旧的文章里，作者批评教会的“prelateity”（教长权势）是一种世俗野心。"},{"en":"The reformers argued that prelateity should not outweigh spiritual service.","zh":"改革者认为，教长的地位与权力不应凌驾于属灵服事之上。"}]}],"synonyms":["prelacy","prelateship","episcopacy","clerical authority"],"phonetic":"/ˈpriːlətaɪti/","extraExplanation":["“prelateity”非常少见，多数词典不收，通常被视为由 prelate（高级教士）+ -ity（表示“性质/状态”）临时拼成的词。","更常见、也更自然的表达是：prelacy（主教职/主教制度）、prelateship（教长职位）、the office/power of a prelate（教长的职权）。","如果你是在历史、宗教或政治语境里读到它，作者往往在讨论教会高层的权威、等级制度或特权，有时带批判色彩。"]}
{"word":"prelates","summary":{"en":"“Prelates” means high-ranking church leaders, especially bishops or archbishops.","zh":"“prelates”指教会中的高级神职人员，尤指主教或大主教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"High-ranking members of the Christian clergy (especially bishops or archbishops), often with authority over a region or church organization.","zh":"（基督教）高级神职人员；主教或大主教等（通常对某一地区或教会机构有管辖权）。"},"examples":[{"en":"The prelates met to discuss church policy and education.","zh":"这些高级神职人员召开会议，讨论教会政策和教育问题。"},{"en":"In medieval Europe, some prelates held great political influence.","zh":"在中世纪欧洲，一些高级神职人员拥有很大的政治影响力。"}]}],"synonyms":["bishops","archbishops","high clergy","church leaders"],"phonetic":"/ˈprɛlɪts/","extraExplanation":["“prelate”源自拉丁语 praelatus，意为“被置于前面的人”，引申为“被提升到领导位置的人”。因此它常用于正式、历史或宗教语境。","在英语里它通常指天主教、圣公会等传统教会体系中的高级神职人员；在更宽泛的用法中，也可指其他教派或宗教中“类似级别”的领导人物，但最典型的仍是主教/大主教。","文学与历史写作中常见搭配有：the prelates and princes（教会与世俗权力并列）、prelates of the Church（教会高级神职人员）。"]}
{"word":"prelateship","summary":{"en":"Prelateship means the office, rank, or term of a high-ranking church leader (a prelate).","zh":"Prelateship 指主教等高级神职人员的职位／等级，或其任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The office, rank, or authority of a prelate (a high-ranking Christian church leader such as a bishop or archbishop).","zh":"（基督教会中）主教等高级神职人员的职位、等级或权力。"},"examples":[{"en":"In medieval Europe, prelateship often came with both spiritual duties and political influence.","zh":"在中世纪欧洲，主教等高级神职的地位常常兼具宗教职责与政治影响力。"},{"en":"He was elevated to prelateship after years of service in the church.","zh":"他在教会服事多年后被擢升为主教等高级神职。"}]},{"partOfSpeech":"n.","definition":{"en":"The time period during which someone holds the position of a prelate.","zh":"（某人担任主教等高级神职的）任期。"},"examples":[{"en":"During his prelateship, the diocese expanded its schools and charities.","zh":"在他的主教任期内，教区扩展了学校与慈善事业。"}]}],"synonyms":["episcopate","bishopric","prelacy","ecclesiastical office"],"phonetic":"/ˈprɛlətˌʃɪp/","extraExplanation":["“prelate”常指主教、总主教等教会高阶神职人员；“prelateship”是由 prelate + -ship 构成，-ship 表示“身份／职位／状态”（如 friendship 友谊、leadership 领导地位）。","该词多见于历史、宗教研究或较正式的写作中；日常英语里更常直接说 “the office of a bishop/archbishop” 或 “his time as bishop”。"]}
{"word":"prelatess","summary":{"en":"A prelate is a senior Christian church leader (like a bishop).","zh":"prelate 指基督教中的高级教会领袖（如主教）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-ranking Christian church leader, especially a bishop, archbishop, or other senior clergy member.","zh":"（基督教）高级教会领袖；尤指主教、大主教等高级神职人员。"},"examples":[{"en":"The prelate spoke at the cathedral’s anniversary service.","zh":"这位高级神职人员在大教堂的周年礼拜上发表了讲话。"},{"en":"In medieval Europe, some prelates had significant political power.","zh":"在中世纪欧洲，一些高级神职人员拥有相当大的政治权力。"}]}],"synonyms":["bishop","archbishop","clergyman","church leader"],"phonetic":"/ˈprɛlət/","extraExplanation":["你输入的“prelatess”通常被视为拼写错误，更常见的是“prelates”（prelate 的复数）。","词源上来自拉丁语，与“在前/居首”的含义相关，因此常用来指“位阶较高的”教会人士。","在文学或历史叙述中，prelate 常带有“教会权威/显贵神职人员”的语气；在讨论教会与政治关系（尤其是中世纪）时很常见。"]}
{"word":"prelatial","summary":{"en":"Prelatial means “connected with high-ranking church leaders (prelates) or church hierarchy.”","zh":"prelatial 指“与主教等高级教士或教会等级制度/教权有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prelate (a high-ranking Christian church leader such as a bishop) or to church hierarchy and authority.","zh":"与主教等高级教士（教会“主教长”）有关的；与教会等级制度或教权有关的。"},"examples":[{"en":"The dispute was partly about prelatial authority over local churches.","zh":"这场争端部分与主教等教会高层对地方教会的教权有关。"},{"en":"He wrote a critique of prelatial government in the church.","zh":"他写了一篇对教会主教制（教会高层治理方式）的批评文章。"},{"en":"The ceremony had a distinctly prelatial tone, with bishops leading the procession.","zh":"这场仪式带有明显的主教式（教会高层）的氛围，由主教领队游行。"}]}],"synonyms":["episcopal","clerical","ecclesiastical","hierarchical"],"phonetic":"/prɪˈleɪʃəl/","extraExplanation":["“prelatial”较少用于日常英语，更常见于历史、宗教研究或教会政治语境。","词源上与 Latin *praelatus*（意为“被置于前面的人”，引申为“上级教士/主教长”）有关。","在英国历史与宗教讨论中，它有时会出现在关于“episcopal / prelacy（主教制）”与其他教会治理形式的对比中。"]}
{"word":"prelatic","summary":{"en":"Prelatic means “connected with a prelate (especially a bishop) or with church authority led by high-ranking clergy.”","zh":"prelatic 指“与主教等高级神职人员有关的；带有主教阶层教会权威/治理色彩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prelate (a high-ranking member of the Christian clergy, such as a bishop) or to the leadership/style associated with such church officials.","zh":"与主教等高级神职人员（教会“prelate”）有关的；具有主教等高级教士作风或权威色彩的。"},"examples":[{"en":"The historian described the prelatic power of bishops in medieval Europe.","zh":"这位历史学家描述了中世纪欧洲主教的主教式（prelatic）权力。"},{"en":"Some critics opposed the prelatic control of the local church.","zh":"一些批评者反对当地教会受到主教阶层（prelatic）的控制。"}]}],"synonyms":["episcopal","clerical","hierarchical","ecclesiastical"],"phonetic":"/prɪˈlætɪk/","extraExplanation":["“prelatic”是较少见的形容词，常用于宗教史、教会制度或批评性写作中，强调“主教阶层/高阶神职人员”的权威与治理方式。","词源上来自“prelate”（高级神职人员），常见搭配有 prelatic authority/power/control（主教式权威/权力/控制）。"]}
{"word":"prelatical","summary":{"en":"“Prelatical” means relating to a prelate (high church leader) or to church hierarchy/authority.","zh":"“prelatical”指与教会高级神职人员（如主教）有关，或带有教会等级与教权色彩的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of a prelate (a high-ranking Christian church leader, such as a bishop); connected with church hierarchy or authority.","zh":"与主教等教会高级神职人员（教长）有关的；具有教会等级制度或教权色彩的。"},"examples":[{"en":"The debate centered on prelatical authority versus local church control.","zh":"争论的焦点是主教式（教长式）的教权与地方教会自治之间的冲突。"},{"en":"Some critics disliked the novel’s prelatical tone when it described the clergy.","zh":"一些批评者不喜欢这部小说在描写神职人员时带有的“教长式”口吻。"}]}],"synonyms":["episcopal","hierarchical","clerical","ecclesiastical"],"phonetic":"/ˌpriːləˈtɪkəl/","extraExplanation":["“prelatical”较为少见，常见于历史、宗教研究或批评性写作中，用来强调“教会高层/等级化”的色彩。","词根来自“prelate”（教长、主教等高级神职人员）。在语气上，它有时会带一点批判意味，暗示官僚化、权威化或脱离基层信徒。"]}
{"word":"prelatically","summary":{"en":"Prelatically means “in a way connected with a prelate (e.g., a bishop) or church hierarchy,” sometimes implying a pompous, authoritative tone.","zh":"prelatically 指“以（主教等）高级神职人员/教会等级制度相关的方式”，有时带“专断、官腔”的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a prelate (a high-ranking Christian clergyperson, such as a bishop) or to church leadership.","zh":"以（主教等）高级神职人员的方式；与教会高层领导或主教制度有关地。"},"examples":[{"en":"The bishop spoke prelatically, stressing order and tradition in the church.","zh":"主教以一种“主教式”的口吻讲话，强调教会中的秩序与传统。"},{"en":"Some critics said the committee’s rules were written too prelatically, with little room for debate.","zh":"一些批评者说委员会的规则写得太“教会高层式”，几乎不给讨论留空间。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Less common) In a pompous or authoritative way associated with high church officials.","zh":"（较少见）带有教会高层那种傲慢、专断或居高临下的口吻地。"},"examples":[{"en":"He answered prelatically, as if his opinion ended the conversation.","zh":"他用一种居高临下的口气回答，仿佛他的意见就能终结对话。"}]}],"synonyms":["episcopally","clerically","authoritatively","pompously"],"phonetic":"/ˌprɛləˈtɪkli/","extraExplanation":["“prelatically”很少在日常英语中出现，多见于宗教史、教会政治、或带讽刺意味的评论写作中。","词根来自“prelate”（高级神职人员），因此它常带有“教会等级、权威口吻、仪式感”的联想；在批评语境里可能隐含负面意味（官僚、专断）。"]}
{"word":"prelaticalness","summary":{"en":"“Prelaticalness” means the quality of being prelatical—connected with or favoring the authority, style, or hierarchy of church prelates (especially bishops).","zh":"“prelaticalness”指“教长式/主教式”的特质：强调或偏向教会教长（尤其主教）的权威、作风与等级制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being prelatical; a strong association with (or tendency toward) church prelates and their authority, style, or hierarchy.","zh":"主教式（教长式）的特质或状态；与教会教长（如主教）及其权威、作风或等级制度密切相关的倾向。"},"examples":[{"en":"The essay criticizes the church’s prelaticalness, arguing that titles mattered more than service.","zh":"这篇文章批评教会的“教长化”倾向，认为头衔比服务更重要。"},{"en":"In the novel, the bishop’s prelaticalness is shown through formal ceremonies and strict rules.","zh":"在小说中，主教的“教长式作风”通过隆重仪式和严苛规矩表现出来。"}]}],"synonyms":["prelacy","clericalism","hierarchy","ecclesiastical authority","episcopacy"],"phonetic":"/ˌpriːləˈtɪk(ə)lnəs/","extraExplanation":["“prelaticalness”非常罕见，多见于历史评论或带批评意味的宗教/政治写作中。日常英语里更常用“prelacy（主教制度/主教阶层）”“hierarchical church structure（等级化的教会结构）”或直接说“clerical authority（教士权威）”。","“prelate”指教会中的高级神职人员（常见为主教）。因此“prelatical-”常带“偏重教会高层权威、讲排场或讲等级”的语感，具体褒贬取决于语境。"]}
{"word":"prelation","summary":{"en":"Prelation usually means a prelate’s office or term in the church; rarely, it means priority or higher rank.","zh":"Prelation 通常指（教会中）主教等高级神职的职位或任期；少见时也可指优先权或更高等级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Church) the office, authority, or period of service of a prelate (a high-ranking Christian clergyperson, such as a bishop).","zh":"（教会用语）主教等高级神职人员（prelate）的职位、权力，或其任职期间。"},"examples":[{"en":"During his prelation, the bishop focused on education and charity.","zh":"在他担任主教的任职期间，他把重点放在教育与慈善上。"},{"en":"The abbey’s archives contain records from an earlier prelation.","zh":"修道院的档案里保存着更早一任教长任期的记录。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) priority or precedence over others; higher rank.","zh":"（罕用）优先权；居先地位；更高的等级。"},"examples":[{"en":"By tradition, senior members were given prelation in the procession.","zh":"按传统，资深成员在队列中享有优先位置。"},{"en":"The debate was about prelation, not ability.","zh":"争论的焦点是先后与地位，而不是能力。"}]}],"synonyms":["prelacy","episcopacy","tenure","term of office","precedence","priority"],"phonetic":"/priˈleɪʃən/","extraExplanation":["这个词主要出现在宗教/历史语境，尤其与天主教或英国国教等的教阶制度有关；日常英语中很少用，更常见的是 prelacy（主教制度/主教的统治）或用更通用的 leadership / tenure 来表达“任期/领导”。","词根来自拉丁语 prae-（在前）+ latus（带来、提出），和 prelate 同源；因此也引申出“在前、优先”的罕见义。"]}
{"word":"prelatish","summary":{"en":"Prelatish means ‘like a prelate’—having a formal, authoritative, sometimes moralizing clerical tone.","zh":"prelatish 指“像高级教士（主教等）一样的”——语气或作风正式、权威，有时带说教或摆架子感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the manner, style, or attitudes of a prelate (a high-ranking church leader); suggesting clerical authority or formality.","zh":"带有主教等高级教士（prelate）的作风或派头的；显得教会权威、庄重或官僚化的。"},"examples":[{"en":"His prelatish tone made the casual meeting feel like a formal ceremony.","zh":"他那种带主教派头的语气，让原本随意的会面变得像正式仪式。"},{"en":"The critic called the speech prelatish—solemn, moralizing, and a little self-important.","zh":"评论家说那篇演讲很“主教腔”——庄严、说教，还带点自以为是。"}]}],"synonyms":["episcopal","clerical","pontifical","pompous","formal"],"phonetic":"/ˈprɛlətɪʃ/","extraExplanation":["“prelatish”较少见，常见于批评或讽刺语境，带一点“装腔作势/官僚教会味”的意味。","prelate 指基督教（尤其天主教、圣公会等）中较高阶的神职人员，如主教（bishop）或大主教（archbishop）。因此 prelatish 通常描述说话方式、气场或作风，而不是宗教信仰本身。"]}
{"word":"prelatism","summary":{"en":"Prelatism is support for church government led by bishops (prelates).","zh":"Prelatism 指支持由主教等高级神职人员领导的教会治理制度（主教制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"belief in or support for church rule by prelates (high-ranking bishops), especially in the Anglican/Episcopal tradition; opposition to non-episcopal church governance.","zh":"主教制主义；支持由主教等高级神职人员掌管教会的观点（尤指英国国教/圣公会传统），常与反对长老制、会众制等相对。"},"examples":[{"en":"Some Puritans criticized prelatism and argued for a simpler church structure.","zh":"一些清教徒批评主教制主义，主张更简化的教会结构。"},{"en":"The pamphlet attacked prelatism as a threat to religious freedom.","zh":"这本小册子抨击主教制主义，认为它威胁宗教自由。"}]}],"synonyms":["episcopacy","episcopalism"],"phonetic":"/ˈprɛləˌtɪzəm/","extraExplanation":["“prelatism”来自“prelate”（主教等高级教士）+ “-ism”（主义）。在英语历史语境中，它常出现在16—17世纪英国宗教与政治争论里，尤其与清教徒（Puritans）对英国国教主教制度的反对有关。","语体上偏学术/历史写作，日常口语很少用。相关对立概念常见：Presbyterianism（长老制）、congregationalism（会众制）。"]}
{"word":"prelatist","summary":{"en":"Prelatist refers to someone (or a viewpoint) that supports church governance by bishops.","zh":"prelatist 指支持由主教（教长）治理教会的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or favors rule by bishops (prelates) in the Christian church, especially in contrast to Presbyterian or Congregational church government","zh":"主教制拥护者；支持由主教（教长）治理教会的人（常与长老制、会众制相对）"},"examples":[{"en":"In the debate over church government, he was labeled a prelatist by his opponents.","zh":"在关于教会治理的争论中，他被对手称为“主教制拥护者”。"},{"en":"Some prelatists argued that bishops provided stability and unity for the church.","zh":"一些主教制拥护者认为，由主教领导能为教会带来稳定与合一。"}]},{"partOfSpeech":"adj.","definition":{"en":"favoring or relating to church rule by bishops (prelates)","zh":"（与）主教制有关的；倾向主教治理教会的"},"examples":[{"en":"The writer took a strongly prelatist position on church authority.","zh":"这位作者在教会权威问题上采取了强烈的主教制立场。"},{"en":"Prelatist policies were criticized by groups who wanted more local control.","zh":"主教制政策受到一些希望地方自治更多的团体批评。"}]}],"synonyms":["episcopalian (in the sense of favoring bishops)","supporter of episcopal polity","high-church (sometimes, depending on context)"],"phonetic":"/ˈprɛləˌtɪst/","extraExplanation":["“prelatist”常见于16–17世纪英国宗教与政治语境（如英国国教与清教徒之争）。在当时的争论里，它往往带有立场色彩，可能是中性描述，也可能是对立阵营用来批评对方“偏向主教权威”的标签。","词根来自“prelate”（教长、主教），因此理解关键是：它指向“由主教体系来治理教会”的制度与态度。"]}
{"word":"prelatize","summary":{"en":"A rare verb meaning to make something controlled by or like high-ranking church leaders (prelates).","zh":"一个罕用动词，指使某事物带有“主教等高级神职人员”主导/控制的特征。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make someone or something more like a prelate (a high-ranking church leader), or to put under the control or influence of prelates.","zh":"（罕用）使某人/某事更像“主教级高级神职人员”（prelate），或使其受高级神职人员的控制/影响。"},"examples":[{"en":"Some critics feared the school system would be prelatized and lose its independence.","zh":"一些批评者担心学校体系会被“主教化”，从而失去独立性。"},{"en":"He argued that the church had been prelatized over time, with more power concentrated at the top.","zh":"他认为随着时间推移，教会逐渐“主教化”，权力越来越集中在高层。"}]}],"synonyms":["clericalize","episcopalize","hierarchize","centralize"],"phonetic":"/ˈprɛləˌtaɪz/","extraExplanation":["“prelate”指基督教（尤其天主教、圣公会等）中的高级神职人员，如主教、大主教等；因此 prelatize 往往带有批评色彩，暗示制度被“教阶化/官僚化”，权力向少数高层集中。","这是一个非常少见的词，更常见的表达包括：centralize power（权力集中）、clericalize（使教权化/神职化）、put under episcopal control（置于主教管辖之下）。"]}
{"word":"prelatry","summary":{"en":"Prelatry means the group of high-ranking church leaders (especially bishops), or the office/authority they hold.","zh":"Prelatry 指主教等高级神职人员的整体（主教团），也可指其职位或权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the body of prelates (high-ranking clergy such as bishops) in a church; bishops and similar leaders considered collectively","zh":"（教会中）主教等高级神职人员的整体；主教团（统称）"},"examples":[{"en":"In medieval Europe, the prelatry often held significant political power.","zh":"在中世纪欧洲，主教团往往拥有重要的政治影响力。"},{"en":"The king negotiated with the prelatry to gain support for his reforms.","zh":"国王与主教团谈判，以争取对改革的支持。"}]},{"partOfSpeech":"n.","definition":{"en":"the office, rank, or authority of a prelate","zh":"主教等高级神职人员的职位、等级或权威"},"examples":[{"en":"He was elevated to the prelatry after years of service in the church.","zh":"他在教会服务多年后被擢升到主教等高级神职的职位。"}]}],"synonyms":["episcopacy","bishops","hierarchy (church hierarchy)","clergy (in context)"],"phonetic":"/ˈprɛlətri/","extraExplanation":["“prelatry”较偏书面与历史语境，常见于谈论中世纪/早期近代欧洲的教会政治结构。日常英语里更常用“the bishops”或“the episcopacy（主教制/主教团）”。","词根来自“prelate（高级神职人员）”，多与天主教或英国国教等有主教体系的教会背景相关。"]}
{"word":"prelature","summary":{"en":"A prelature is a Catholic church jurisdiction or body led by a prelate, sometimes with special autonomy.","zh":"prelature 指由教长领导的天主教会管辖区或神职团体，有时具有一定自治性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of clergy or a church jurisdiction led by a prelate (a high-ranking Catholic bishop), sometimes with special autonomy","zh":"由“主教级”教长（天主教高阶主教）领导的神职团体或教会管辖区；有时享有一定自治权"},"examples":[{"en":"Opus Dei is organized as a personal prelature in the Catholic Church.","zh":"主业团（Opus Dei）在天主教会中被组织为“个人监督区”（personal prelature）。"},{"en":"The prelature oversees pastoral work for its members across different dioceses.","zh":"该监督区为分布在不同教区的成员提供牧灵照顾。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the office, authority, or term of a prelate","zh":"（较少见）教长的职位、权力或任期"},"examples":[{"en":"During his prelature, he focused on education and charity.","zh":"在他担任教长期间，他重点推动教育与慈善。"}]}],"synonyms":["church jurisdiction","ecclesiastical jurisdiction","bishopric (near)","diocese (related)"],"phonetic":"/ˈprɛlətʃər/","extraExplanation":["“prelature”主要用于天主教语境，日常英语里不算常见；更常见的相关词是“diocese（教区）”“bishopric（主教职位/辖区）”。","“personal prelature（个人监督区）”指以“人”为对象而不是以“地域”为对象的教会管辖形式；因此成员可分布在不同地方教区。"]}
{"word":"prelaty","summary":{"en":"A rare word meaning the prelates collectively (or their authority), and sometimes describing something related to prelates.","zh":"一个罕见词，指主教等高级神职人员整体（或其权威），也可作形容词表示“与主教阶层有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The prelates (high-ranking clergy) collectively; the influence or authority of prelates.","zh":"（罕见）主教等高级神职人员的整体；（也指）他们的影响力或权威。"},"examples":[{"en":"In some medieval writings, the king negotiated with the prelaty over church lands.","zh":"在一些中世纪著作中，国王会就教会土地与主教团（prelaty）进行谈判。"},{"en":"The reformers criticized the prelaty for being too involved in politics.","zh":"改革者批评主教阶层（prelaty）过度介入政治。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to or characteristic of prelates or the church hierarchy.","zh":"（罕见）与高级神职人员或教会等级制度有关的；带有主教阶层特点的。"},"examples":[{"en":"The sermon used a prelaty tone, emphasizing obedience to the hierarchy.","zh":"这篇讲道带有“主教式”的语气，强调服从等级制度。"}]}],"synonyms":["prelacy","the prelates","clergy (general)","church hierarchy"],"phonetic":"/ˈprɛləti/","extraExplanation":["“prelaty”非常少见，多数现代英语更常用“prelacy”（主教阶层/主教制度）或直接说“the prelates”（主教们）。在阅读历史、宗教或政治相关的旧文献时更可能遇到。","词根来自“prelate”（主教/高级神职人员），常见于讨论中世纪欧洲教会权力、教俗关系等语境。"]}
{"word":"prelaunch","summary":{"en":"Prelaunch refers to the time or actions before an official launch, especially in marketing and product development.","zh":"Prelaunch 指正式发布前的阶段或活动，常用于营销与产品开发语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a product, service, or event is officially launched (introduced to the public).","zh":"（产品/服务/活动）正式发布之前的；预发布的。"},"examples":[{"en":"We’re running a prelaunch campaign to collect email sign-ups before the app goes live.","zh":"我们在应用上线前做预发布营销活动，用来收集邮箱订阅。"},{"en":"The team fixed several bugs during the prelaunch testing phase.","zh":"团队在预发布测试阶段修复了好几个漏洞。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or activities before an official launch, such as testing, marketing, and preparing operations.","zh":"正式发布前的阶段或相关活动（如测试、预热营销、运营准备等）。"},"examples":[{"en":"During prelaunch, we focused on user feedback and onboarding materials.","zh":"在预发布阶段，我们重点关注用户反馈和新手引导材料。"}]}],"synonyms":["pre-launch","before launch","launch prep","run-up to launch"],"phonetic":"/ˌpriːˈlɔntʃ/","extraExplanation":["“Prelaunch”常见于创业、科技产品和营销语境中，强调“公开发布前的预热/准备”。写作时也常见两种拼法：prelaunch（合写）与 pre-launch（带连字符）；在正式文档里用 pre-launch 更常见一些。","与“beta / soft launch（试运营/小范围上线）”不同：prelaunch 通常发生在产品公开可用之前；beta/soft launch 则往往已经让一部分用户开始使用。"]}
{"word":"prelaunching","summary":{"en":"“Prelaunching” means doing preparation and early promotion before an official launch.","zh":"“prelaunching”指在正式发布前进行准备与宣传预热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of doing preparation and early marketing before an official launch (often for a product, app, or event)","zh":"（常指产品/应用/活动）在正式发布之前进行的准备与预热营销过程"},"examples":[{"en":"We’re prelaunching the new app by collecting email sign-ups.","zh":"我们通过收集邮箱订阅来为新应用做发布前预热。"},{"en":"During prelaunching, the team tests the checkout flow and fixes bugs.","zh":"在发布前阶段，团队测试结账流程并修复漏洞。"}]},{"partOfSpeech":"v.","definition":{"en":"preparing and promoting something before it officially launches","zh":"在正式发布前为某事做准备并进行宣传预热"},"examples":[{"en":"They’re prelaunching a course with a free webinar.","zh":"他们用一场免费的网络讲座为课程做发布前预热。"},{"en":"We’re prelaunching quietly to learn from a small group of users.","zh":"我们先低调预发布，以便从一小群用户那里获得反馈。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening before an official launch; related to early testing or marketing","zh":"发生在正式发布之前的；与早期测试或预热营销有关的"},"examples":[{"en":"The prelaunching campaign focuses on short teaser videos.","zh":"发布前预热活动主打短预告视频。"},{"en":"We got feedback from prelaunching users.","zh":"我们从预发布用户那里收到了反馈。"}]}],"synonyms":["pre-launch","soft-launching","beta testing","teasing","building a waitlist"],"phonetic":"/priˈlɔntʃɪŋ/","extraExplanation":["“prelaunching”来自动词“prelaunch”（pre- 表示“在……之前” + launch “发布/推出”）。在商业与互联网语境里很常见，通常包括：建立候补名单（waitlist）、预告内容（teasers）、小范围内测（beta）、收集反馈与调整定价/定位等。","常见搭配：prelaunching campaign（预热活动）、prelaunching page/landing page（预热落地页）、prelaunching email sequence（预热邮件序列）、prelaunching users/beta users（预发布/内测用户）。"]}
{"word":"prelaw","summary":{"en":"Prelaw (often “pre-law”) means preparation for law school or a college program/track designed to get students ready for studying law.","zh":"Prelaw（常写作pre-law）指法学院预科：为进入法学院学习而做的准备，或大学里为此设置的项目/方向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Education) Preparation for studying law, especially undergraduate courses or advising meant to get you ready for law school.","zh":"（教育）法学院预科；为进入法学院学习而做的准备，尤其指本科阶段的课程或指导。"},"examples":[{"en":"She’s a prelaw student who plans to apply to law school next year.","zh":"她是法学院预科学生，计划明年申请法学院。"},{"en":"Our university offers prelaw advising on classes, internships, and the LSAT.","zh":"我们学校提供法学院预科咨询，包括选课、实习和LSAT备考。"}]},{"partOfSpeech":"n.","definition":{"en":"A prelaw program or track at a college (often written “pre-law”).","zh":"法学院预科项目/方向（常写作“pre-law”）。"},"examples":[{"en":"He joined the prelaw program to explore legal careers.","zh":"他加入法学院预科项目，以了解法律职业。"},{"en":"The pre-law track emphasizes writing, critical reading, and research.","zh":"法学院预科方向强调写作、批判性阅读和研究能力。"}]}],"synonyms":["pre-law","law school preparation","legal studies track"],"phonetic":"/ˌpriˈlɔ/","extraExplanation":["在美国语境里更常写作“pre-law”。它不是一个固定专业（major），而是一种“准备走法学院路线”的学习规划：选课、能力训练、实习与申请准备。","“Prelaw/Pre-law”通常与美国法学院入学相关：Law school 是研究生阶段；本科阶段以培养阅读、写作、逻辑与论证能力为主，不一定必须学政治或法律相关。"]}
{"word":"prelawful","summary":{"en":"“Prelawful” is rare/nonstandard; it usually tries to mean “before something becomes legal.”","zh":"“prelawful”很少见、非标准；通常想表达“在某事变得合法之前”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word; sometimes used informally to mean “before something becomes lawful/legal” (i.e., before legalization or before a rule recognizes it).","zh":"不是标准英语词；有时在非正式语境中用来表示“在某事变得合法/依法之前”（即尚未合法化、尚未被法规认可之前）。"},"examples":[{"en":"In some articles, people describe the “prelawful” period—before the activity was legalized.","zh":"在一些文章里，人们用“prelawful”来指“合法化之前的时期”。"},{"en":"If you mean “before it was legal,” “pre-legal” or “before legalization” will sound more natural than “prelawful.”","zh":"如果你想说“在它合法之前”，用“pre-legal”或“before legalization”会比“prelawful”更自然。"}]}],"synonyms":["pre-legal","before legalization","prior to legalization","not yet legal"],"phonetic":"/ˌpriːˈlɔːfəl/","extraExplanation":["“Pre-”是常见前缀，表示“之前”。但“lawful（合法的）”通常不和“pre-”这样组合成固定词，所以“prelawful”很少见，读者可能会觉得不自然或不确定意思。","更地道的表达往往是：before it was legal / before legalization / pre-legal / prior to legalization。若你是在法律学习语境（pre-law）中写作，“pre-law student（法学院预科/准备读法学院的学生）”是常见说法。"]}
{"word":"prelawfully","summary":{"en":"“Prelawfully” is a rare, nonstandard adverb meaning “before something is lawful/legally authorized.”","zh":"“prelawfully”是罕见且不太标准的副词，表示“在合法/获得法律授权之前”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare / nonstandard) In a way that happens before something is lawful or legally authorized; before legal permission exists.","zh":"（罕见/非标准用法）以“在合法之前”的方式；在获得法律授权或许可之前。"},"examples":[{"en":"The software was distributed prelawfully, before the company obtained the proper licenses.","zh":"这款软件在公司取得必要许可之前就被传播了（prelawfully）。"},{"en":"Any use of the land prelawfully may still violate local regulations.","zh":"在合法程序完成之前对该土地的任何使用仍可能违反当地法规。"}]}],"synonyms":["before it was legal","before it became legal","without legal authorization","without permission"],"phonetic":"/ˌpriːˈlɔːfəli/","extraExplanation":["“prelawfully”不是常见英语词汇，很多情况下会被视为拼写或用词不自然。写作中更常用、更清晰的表达包括：\n- “before it became legal / before it was legal”（在变得合法之前）\n- “without legal authorization / without permission”（未经法律授权/许可）\n- 如果你想表达“此前一直是合法的”，通常说 “previously lawfully” 或直接 “lawfully before …”。\n\n另外要注意：带有前缀 “pre-” 的副词在英语里并不常见；“pre-”更常见于名词/形容词（如 pretrial 预审的，premarital 婚前的）。"]}
{"word":"prelawfulness","summary":{"en":"“Prelawfulness” is a rare noun meaning a pre-legal condition—before formal laws—or an order based on custom and shared norms rather than state law.","zh":"“Prelawfulness”是一个较罕见的名词，指“法律出现之前的状态”，或指依靠习俗与共同规范而非国家法律维持的秩序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The condition or idea of being before laws or formal legal rules exist; a pre-legal state.","zh":"（罕见）指在法律或正式法律规则出现之前的状态或概念；“前法律”状态。"},"examples":[{"en":"In the novel, the island is described as a place of prelawfulness, where customs matter more than written rules.","zh":"在小说中，这座岛被描写成一种“前法律”之地，习俗比成文规则更重要。"},{"en":"The researcher compared early village life to a kind of prelawfulness, before courts and police were established.","zh":"研究者把早期村落生活比作一种“前法律”状态——在法庭和警察制度建立之前。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, abstract) A moral or social order that relies on tradition, religion, or community norms rather than state law.","zh":"（罕见，抽象）指依靠传统、宗教或社区规范来维持的道德或社会秩序，而不是依靠国家法律。"},"examples":[{"en":"Some writers use “prelawfulness” to talk about ethics grounded in community responsibility instead of legal punishment.","zh":"一些作者用“prelawfulness”来讨论一种以社区责任为基础的伦理，而非以法律惩罚为核心。"},{"en":"Their sense of justice came from prelawfulness—shared norms—rather than official legislation.","zh":"他们的正义感来自“前法律”的共同规范，而不是来自官方立法。"}]}],"synonyms":["pre-legal state","state of nature","custom-based order","customary norms"],"phonetic":"/ˌpriːˈlɔːf(ə)lnəs/","extraExplanation":["“prelawfulness”并不是常见英语词，更多像是临时造词（nonce word）：前缀 pre-（“在……之前”）+ lawfulness（“守法、合法性”）。在正式写作中，更常见的表达是：pre-legal state（前法律状态）、before formal law（在正式法律之前）、lawless (state)（无法律/失序的状态，含义更负面）、customary law（习惯法，强调虽非成文法但仍有规则）。","语气区别：prelawfulness 偏中性、学术/文学化，强调“尚未有国家法律”；lawless 往往暗示混乱或犯罪。","可拆读为 pre + lawfulness，重音通常落在 LAW 上（pre-LAW-ful-ness）。"]}
{"word":"prelease","summary":{"en":"“Prelease” most commonly means to lease a property in advance (often written “pre-lease”); it is also sometimes a misspelling of “please.”","zh":"“prelease”通常指“预租/提前签租约”（常写作“pre-lease”）；也可能是把“please（请）”拼错了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lease (rent) a property in advance, before it is available to move into; to sign a lease ahead of time","zh":"（在房屋/店面可入住或正式开放前）预租；提前签租约"},"examples":[{"en":"Many students prelease apartments months before the semester starts.","zh":"很多学生会在学期开始前几个月就预租公寓。"},{"en":"The new building is not finished yet, but you can prelease a unit now.","zh":"这栋新楼还没完工，但你现在可以预租一个房源。"},{"en":"We decided to prelease the storefront to secure a good location.","zh":"我们决定预租这间店面，以确保好地段。"}]},{"partOfSpeech":"n.","definition":{"en":"a lease agreement made in advance (especially in real estate)","zh":"预租协议；提前签订的租约（尤指房地产）"},"examples":[{"en":"The agent showed us a prelease for the new apartment complex.","zh":"经纪人给我们看了那座新公寓楼的预租合同。"}]},{"partOfSpeech":"other","definition":{"en":"(common misspelling) If you meant “please,” it is used to be polite or to ask for something.","zh":"（常见拼写错误）如果你想写的是“please”，它用来表示礼貌或提出请求。"},"examples":[{"en":"Please help me with this homework.","zh":"请帮我做这道作业。"},{"en":"Could you speak more slowly, please?","zh":"你能说慢一点吗？谢谢/请问。"}]}],"synonyms":["pre-lease","lease in advance","reserve (a rental)"],"phonetic":"/priˈlis/","extraExplanation":["“prelease”更常见的写法是“pre-lease”。在房地产语境中很常用，表示房源尚未交付/开放就先把租约签好。","如果你是在聊天或做作业时输入“prelease”，多数情况下是把“please”拼错了：please = /pliz/（礼貌用语）。"]}
{"word":"preleased","summary":{"en":"“Preleased” means already leased out in advance, especially in real estate.","zh":"“preleased”多用于房地产，表示“已经提前出租/预租”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Real estate) already rented/leased in advance, before a building or unit is finished or officially available.","zh":"（房地产）在房屋/铺位完工或正式可用之前就已提前出租（预租）的。"},"examples":[{"en":"The developer said 80% of the apartments are preleased before construction ends.","zh":"开发商表示在施工结束前，80%的公寓已经预租出去了。"},{"en":"A preleased retail space can be easier to finance because it has a tenant lined up.","zh":"预租的零售铺位更容易获得融资，因为已经有确定的租户。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “prelease”: to lease (rent out) something in advance.","zh":"“prelease”的过去式/过去分词：在正式可用之前提前出租（预租）。"},"examples":[{"en":"They preleased the new office floors months before the building opened.","zh":"他们在大楼启用前几个月就把新的办公楼层预租出去了。"},{"en":"All units were preleased by the time permits were approved.","zh":"许可证获批时，所有房源都已被预租。"}]}],"synonyms":["pre-let","leased in advance","pre-rented"],"phonetic":"/ˌpriːˈliːst/","extraExplanation":["“preleased”在商业地产/公寓租赁新闻里很常见，意思接近“已预租”。写法上也常见作“pre-leased”（带连字符），尤其在标题或正式文件中。","不要和娱乐行业的“pre-release（预发布/提前放出）”混淆；那个通常写作“pre-release”，含义是提前发布内容，而不是租赁。"]}
{"word":"preleasing","summary":{"en":"Preleasing means renting a property (or signing tenants) before the space is ready or officially available.","zh":"Preleasing 指在房源完工或正式可入住/可使用前进行提前出租（预租）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Real estate) renting out apartments, offices, or other space before the building is finished or before the space becomes available.","zh":"（房地产）在建筑完工前或房源正式可入住/可使用前，提前对外出租（预租）。"},"examples":[{"en":"The developer started preleasing the new apartments months before construction ended.","zh":"开发商在工程结束前几个月就开始对新公寓进行预租。"},{"en":"Preleasing helps the owner know how much demand there is before opening.","zh":"预租能帮助业主在正式开放前了解市场需求。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a property or units that are available to rent in advance of opening or move-in.","zh":"（形容词）指房源/单位可在开放或入住前提前出租的（预租的）。"},"examples":[{"en":"Preleasing specials are available for students who sign early.","zh":"为提前签约的学生提供预租优惠。"},{"en":"A preleasing event was held at the leasing office on Saturday.","zh":"周六在租赁办公室举办了预租活动。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of renting something (especially property) before it is ready or officially available.","zh":"（动名词）在尚未准备好或正式可用之前进行出租的行为。"},"examples":[{"en":"They are preleasing the retail space to secure tenants.","zh":"他们正在预租商铺，以提前锁定租户。"}]}],"synonyms":["pre-leasing","pre-lease","advance leasing","early leasing"],"phonetic":"/ˌpriˈliːsɪŋ/","extraExplanation":["“preleasing”常见于美国房地产广告与校园周边公寓市场，尤其是新建楼盘或学期开始前的学生公寓。","相关词：pre-lease（动词/名词：预租、预先签租约）、preleasing agent（预租专员）、preleasing offer/special（预租优惠）。注意有时会写作“pre-leasing”或“preleasing”，意思相同。"]}
{"word":"prelect","summary":{"en":"Prelect means to lecture or (archaically) to read aloud from a text as instruction; it is rare and formal.","zh":"prelect 指（罕见、正式）讲课/做讲座；古义也可指为教学而朗读文本。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give a lecture or formal talk; to teach by lecturing (rare, formal)","zh":"（罕见、较正式）讲课；做正式讲座；以讲授方式教学"},"examples":[{"en":"The professor will prelect on American literature this afternoon.","zh":"教授今天下午将就美国文学进行讲座。"},{"en":"In earlier times, scholars often prelected to small groups of students.","zh":"在较早的时期，学者常常对小规模学生群体讲授课程。"}]},{"partOfSpeech":"vt.","definition":{"en":"to read aloud (especially from a text) as a form of instruction (archaic)","zh":"（古义）朗读（尤指照本宣读）以进行教学"},"examples":[{"en":"He prelected passages from the play before discussing them.","zh":"他先朗读剧本片段，再进行讲解。"}]}],"synonyms":["lecture","teach","give a lecture","give a talk","present"],"phonetic":"/priˈlɛkt/","extraExplanation":["“prelect”是较少见的词，现代英语里更常用 lecture（讲课/讲座）、teach（教）、give a talk（做报告）。","词源与拉丁语有关：prae-（在前）+ legere（读），原本有“先读出来、朗读讲解”的味道，因此也带有“照文本讲授”的历史感。","如果你在学术或历史语境里看到它，通常是在强调“正式讲授”或“朗读式讲解”，语气较书面。"]}
{"word":"prelected","summary":{"en":"**Prelected** means “gave a formal lecture” (past tense of *prelect*), a rare, academic-sounding word; usually you can say **lectured**.","zh":"**prelected** 意为“进行了正式讲授/演讲”（*prelect* 的过去式），较罕见、偏学术书面；多数情况下可用 **lectured**。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of **prelect**) to give a lecture or formal talk, especially in an academic setting.","zh":"（**prelect** 的过去式/过去分词）作学术性讲授；进行正式演讲（多用于学术语境）。"},"examples":[{"en":"She **prelected** on Shakespeare’s tragedies to a small seminar.","zh":"她在一个小型研讨班上**讲授**莎士比亚的悲剧。"},{"en":"The professor **prelected** for an hour before taking questions.","zh":"教授**讲授**了一个小时，然后才开始提问环节。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective (rare): having been lectured; delivered as a lecture.","zh":"（罕见，用作形容词）被讲授过的；以讲座形式呈现的。"},"examples":[{"en":"The course relied heavily on **prelected** material and slides.","zh":"这门课很大程度依赖**讲授过的**材料和幻灯片。"}]}],"synonyms":["lectured","gave a lecture","spoke","addressed"],"phonetic":"/ˈpriːlɛkt/","extraExplanation":["“prelect / prelected”在现代英语中非常少见，更常用的是“lecture / lectured”。如果你是在阅读学术文本或较旧的书面英语，才更可能遇到它。","词源上与拉丁语 *prae-*（在前）+ *legere*（读）有关，带有“在众人面前宣读/讲授”的历史意味。"]}
{"word":"prelecting","summary":{"en":"“Prelecting” means giving a lecture; it’s a rare, formal word.","zh":"“prelecting”指“正在讲课/讲演”，用法偏正式且较少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving a lecture or formal talk (present participle of “prelect,” a rare verb meaning “to lecture”).","zh":"正在讲课／作正式讲座（“prelect”的现在分词；该动词较少见，意为“讲授、讲演”）。"},"examples":[{"en":"The professor is prelecting on Shakespeare this afternoon.","zh":"教授今天下午在讲授莎士比亚。"},{"en":"She spent the summer prelecting to first-year students.","zh":"她整个夏天都在给大一学生授课。"}]},{"partOfSpeech":"v.","definition":{"en":"speaking at length in a formal, lecture-like way (sometimes used critically, like “to lecture someone”).","zh":"以“说教式”的方式长篇讲述（有时带批评意味，类似“训人/说教”）。"},"examples":[{"en":"He was prelecting about manners again, as if everyone needed a lesson.","zh":"他又在说教礼貌问题，好像所有人都需要被上课一样。"}]}],"synonyms":["lecturing","teaching","giving a talk","presenting","discoursing"],"phonetic":"/prɪˈlɛktɪŋ/","extraExplanation":["“prelect”较为书面且少见，现代英语里更常用 lecture / teach / give a talk。","词源上与拉丁语有关：prae-（在前）+ legere（读），早期含“在众人面前朗读/讲读”的意味，因此常出现在较正式或学术语境。"]}
{"word":"prelection","summary":{"en":"Prelection is a formal, rare word meaning a lecture, or historically, reading a text aloud with explanation.","zh":"Prelection 是一个正式且少见的词，指讲座/授课；历史上也指朗读并讲解文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(formal, rare) A lecture, especially one given at a university; a spoken lesson or talk to teach something.","zh":"（正式、少见）讲座；（尤指）大学里的授课或演讲。"},"examples":[{"en":"The professor’s prelection on Shakespeare drew a large crowd.","zh":"那位教授关于莎士比亚的讲座吸引了很多人。"},{"en":"Students were expected to take notes during the prelection.","zh":"学生被要求在授课时记笔记。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) The act of reading a text aloud and explaining it, often line by line.","zh":"（历史用法）朗读并讲解文本（常逐行讲解）的行为。"},"examples":[{"en":"In earlier classrooms, prelection often meant reading from a book and commenting as you went.","zh":"在较早的课堂里，“prelection”常指边朗读书本边做讲解。"}]}],"synonyms":["lecture","talk","address","lesson"],"phonetic":"/priˈlɛkʃən/","extraExplanation":["词源来自拉丁语 praelectio（prae- “在前/预先” + lectio “阅读/讲读”）。因此它最初强调“朗读并讲解”，后来也可泛指“讲课/讲座”。","现代英语里它很少用，更常见的替代词是 lecture（讲座/讲课）或 talk（演讲）。在学术语境中用 prelection 会显得偏古典、偏书面。"]}
{"word":"prelector","summary":{"en":"A prelector is a lecturer or formal speaker (a rare, old-fashioned term).","zh":"prelector 指讲师或正式演讲者（较少用、偏古旧的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who gives a formal lecture, especially in a university or learned setting (an old-fashioned or rare word).","zh":"讲师；讲演者（尤指大学或学术场合；用法较古旧或少见）。"},"examples":[{"en":"In older university records, he is listed as a prelector in philosophy.","zh":"在较早的大学档案中，他被列为哲学课的讲师。"},{"en":"The prelector delivered a short talk before the ceremony began.","zh":"典礼开始前，讲演者做了简短发言。"}]}],"synonyms":["lecturer","speaker","instructor","reader"],"phonetic":"/priˈlɛktər/","extraExplanation":["“prelector”源自拉丁语 *praelector*，与“lecture（讲课）”同源，字面含义接近“在前面朗读/讲授的人”。现代英语里很少用，通常用更常见的“lecturer”“speaker”“instructor”。","在一些宗教或传统机构的英文材料中偶尔仍会出现，用来指负责讲解、朗读或讲授的人；具体职责会因机构而异。"]}
{"word":"prelectorship","summary":{"en":"Prelectorship means the post or tenure of a prelector—an appointed lecturer or formal reader in an institution.","zh":"Prelectorship 指 prelector 的职位或任期，即在机构中受任命负责讲授或正式宣读/讲读的人所担任的职务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a position or term of office as a prelector (someone appointed to give lectures or deliver formal readings, especially in a university or institutional setting)","zh":"（prelector 的）职位或任期；prelector 指受任命负责讲授课程或进行正式宣读/讲读的人（多见于大学或机构语境）"},"examples":[{"en":"She held a prelectorship at the college and delivered weekly lectures on ethics.","zh":"她在学院担任 prelectorship，毎周讲授伦理学。"},{"en":"The advertisement mentioned a prelectorship with teaching and public-lecture duties.","zh":"招聘启事提到该 prelectorship 需要承担教学与公开讲座的职责。"}]}],"synonyms":["lectureship","lecturership","teaching post","academic appointment"],"phonetic":"/ˈpriːlɛktərʃɪp/","extraExplanation":["这个词非常少见，常见于较正式、偏英式或历史性的学术/机构文本。日常英语里更常用 lectureship（讲师职位/讲师任期）、lectureship/lecturer（讲师）、teaching post（教学岗位）。","词源上来自拉丁语 prae-（在前/预先）+ lector（朗读者/讲读者）。在某些宗教或学院传统里，prelector 也可指负责“宣读、讲读”文本的人，因此 prelectorship 有时带有仪式性或制度性的色彩。"]}
{"word":"prelectress","summary":{"en":"An old-fashioned word meaning a female lecturer or reader who gives instruction.","zh":"指“女讲师/女讲授者”的古旧用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who gives a lecture or reads aloud as a lecturer (an old-fashioned term).","zh":"女讲师；女朗读讲授者（较古旧的用法）。"},"examples":[{"en":"In the old program notes, she is listed as the prelectress for the evening lecture.","zh":"在那份旧的节目说明里，她被列为当晚讲座的女讲师。"},{"en":"The prelectress read passages from the text and explained them to the group.","zh":"这位女讲师朗读了文本片段，并向大家讲解。"}]}],"synonyms":["lecturer","speaker","instructor","reader"],"phonetic":"/ˈpriːlɛktrəs/","extraExplanation":["“prelectress”比较罕见，带有历史感，多见于旧文献或特定场景；现代英语通常直接用“lecturer / speaker / instructor”，不再强调性别。","词根来自“prelect”（意为“讲授、朗读式讲解”），后缀“-ess”传统上表示女性（如 actress），但当代英语中这种性别化后缀使用减少。"]}
{"word":"prelects","summary":{"en":"“Prelects” is the third-person singular form of “prelect,” meaning to give a (formal) lecture or teach by lecturing; it’s rare in modern English.","zh":"“prelects”是动词“prelect”的第三人称单数，意思是（正式地）讲课/作讲座；现代英语中较罕用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare, formal) To give a lecture; to teach by giving a formal talk, especially at a university.","zh":"（罕用/正式）讲课；作学术讲座（尤指在大学里以正式方式授课）。"},"examples":[{"en":"The professor prelects on modern history every Monday.","zh":"那位教授每周一讲授现代史。"},{"en":"She prelects to first-year students about research methods.","zh":"她给大一学生讲授研究方法。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, older use) To read aloud or deliver a prepared text as instruction.","zh":"（罕用/较旧）朗读并讲解（准备好的文本），作为教学或训导。"},"examples":[{"en":"In earlier times, teachers often prelected from a single authoritative book.","zh":"在较早的年代，老师常常依据一本权威教材朗读并讲解授课。"}]}],"synonyms":["lectures","teaches","presents","instructs"],"phonetic":"/ˌpriːˈlɛkts/","extraExplanation":["“prelect”来自拉丁语 *praelegere*，字面意思是“在……之前读/预先读”（*prae-* = 之前，*legere* = 读）。早期的课堂常见“老师朗读—学生抄记”的授课方式，因此这个词带有“朗读式讲课”的历史色彩。","在现代英语里它非常少见，通常用更常用的词：*lecture*（讲课/讲座）、*teach*（教）、*present*（做报告/呈现）。"]}
{"word":"prelecture","summary":{"en":"“Prelecture” (often “pre-lecture”) refers to something done before a lecture, especially preparation work like readings or quizzes.","zh":"“prelecture”（常写作“pre-lecture”）指讲座/课堂开始前的内容，尤其是课前准备任务，如阅读、视频或测验。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often written “pre-lecture”) happening before a lecture; connected with preparation done before a lecture begins.","zh":"（常写作 pre-lecture）在讲座/课堂开始之前发生的；与课前准备有关的。"},"examples":[{"en":"Please read the article as pre-lecture preparation.","zh":"请在上课前阅读这篇文章作为课前准备。"},{"en":"We had a short pre-lecture quiz to check the basics.","zh":"我们在课前做了一个小测验来检查基础知识。"}]},{"partOfSpeech":"n.","definition":{"en":"Work or activities done before a lecture (such as readings, videos, or quizzes).","zh":"课前任务/课前学习活动（如阅读、视频或测验）。"},"examples":[{"en":"The prelecture for tomorrow includes two short videos.","zh":"明天课前学习包括两个短视频。"},{"en":"I finished the prelecture and took notes on the key terms.","zh":"我完成了课前学习，并把关键术语记了下来。"}]}],"synonyms":["pre-lecture","pre-class","before class","lecture prep"],"phonetic":"/ˌpriːˈlɛk.tʃɚ/","extraExplanation":["“prelecture”在正式英文里不算非常固定的标准词，更常见的写法是带连字符的“pre-lecture”，或者直接说“before the lecture / pre-class”。在学校的学习平台（如Canvas、Moodle）里，人们也会用“prelecture”当作标签或模块名。","常见搭配：pre-lecture reading（课前阅读）、pre-lecture video（课前视频）、pre-lecture quiz（课前小测）、pre-lecture notes（课前笔记）。"]}
{"word":"prelectured","summary":{"en":"“Prelectured” means “gave a lecture / taught by lecturing,” often in formal or older academic usage.","zh":"“Prelectured”指“进行了讲授/以讲课方式教学”，多见于较正式或偏旧的学术用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle) gave a lecture or taught by giving a formal talk (often used in academic or older/formal writing).","zh":"（动词过去式/过去分词）进行讲授；以讲课/正式演讲的方式教学（常见于学术语境或较旧/正式的用法）。"},"examples":[{"en":"The visiting professor prelectured on climate policy to a packed auditorium.","zh":"来访教授在座无虚席的礼堂里讲授了气候政策。"},{"en":"In his memoir, he wrote that he prelectured for years before publishing his first book.","zh":"在回忆录中他写道，自己在出版第一本书之前讲授了很多年。"}]},{"partOfSpeech":"adj.","definition":{"en":"lectured in advance; delivered as a preparatory lecture (rare).","zh":"预先讲授的；作为预备性讲座而讲的（较少见）。"},"examples":[{"en":"Students reviewed the prelectured topics before the lab session.","zh":"学生在实验课前复习了预先讲授的主题。"}]}],"synonyms":["lectured","taught","instructed","gave a lecture","presented"],"phonetic":"/priˈlɛktʃɚd/","extraExplanation":["“prelect-”源自拉丁语前缀prae-（在……之前）+ legere（读/讲解），原义接近“朗读并讲解”。在英式大学传统里，prelect有时指教师对文本的讲解式讲授，因此在现代英语中显得偏正式或带古典/学术色彩。","如果你想表达更自然的现代英语，通常用“lectured”或“gave a lecture”；表达“课前讲解/预先讲授”可用“gave a preparatory lecture”或“previewed the material in a lecture”。"]}
{"word":"prelecturing","summary":{"en":"Prelecturing means giving an introductory lecture or instruction before the main lesson or event.","zh":"prelecturing 指在主要课程或活动之前先做导入式讲解/预讲。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"giving a lecture or explanation beforehand; delivering introductory teaching before the main instruction or event","zh":"（在正式内容/活动之前）先行讲解；做预讲、导入式讲授"},"examples":[{"en":"The trainer tried prelecturing so participants would understand the safety rules before the lab.","zh":"培训师先做预讲，让学员在进实验室前理解安全规则。"},{"en":"Instead of prelecturing for 30 minutes, she asked a few questions to activate students’ background knowledge.","zh":"她没有先讲30分钟，而是先提几个问题来激活学生的背景知识。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of giving preliminary instruction or an introductory lecture","zh":"预先讲授；预讲（这一行为）"},"examples":[{"en":"Too much prelecturing can make a workshop feel slow.","zh":"预讲太多会让工作坊显得拖沓。"}]}],"synonyms":["giving an introduction","previewing","briefing","front-loading instruction","pre-teaching"],"phonetic":"/ˌpriˈlɛktʃɚɪŋ/","extraExplanation":["“prelecturing”是由前缀 pre-（“在……之前”）+ lecture（讲课）构成的较少见用法，多出现在教学法或培训语境里。更常见、更自然的表达包括：give an introduction（做介绍/导入）、preview the lesson（预习式概览）、front-load instruction（把关键说明前置）、provide a briefing（做简报/说明）。"]}
{"word":"prelegacy","summary":{"en":"Prelegacy (often written pre-legacy) means “before something becomes legacy,” most often used about systems/technology before they are replaced.","zh":"prelegacy（常写作 pre-legacy）意为“在成为遗留（legacy）之前”，最常用于描述系统/技术在被替换前的阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually hyphenated) Existing or happening before something becomes “legacy” (old but still in use), especially before a system or product is officially replaced.","zh":"（少见；常写作 pre-legacy）指在某事物成为“遗留的/旧但仍在使用的（legacy）”之前的阶段，尤用于系统或产品正式被替换之前。"},"examples":[{"en":"We need to migrate the data while the platform is still in its pre-legacy phase.","zh":"我们需要在这个平台还处于“成为遗留系统之前”的阶段就完成数据迁移。"},{"en":"The team documented the pre-legacy architecture before starting the modernization project.","zh":"团队在启动现代化改造项目之前，先记录了“前遗留”架构。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) The period or situation before something becomes a legacy in the sense of “something left behind” (e.g., work, reputation).","zh":"（少见，非正式）指某事物在成为“遗产/留下的东西（legacy）”（如作品、名声）之前的阶段或状态。"},"examples":[{"en":"In the pre-legacy years, she experimented with styles that later defined her work.","zh":"在“成就其后续影响（legacy）之前”的那些年里，她尝试了多种风格，后来这些风格定义了她的作品。"}]}],"synonyms":["pre-legacy","pre-existing (context-dependent)","pre-modernization (context-dependent)"],"phonetic":"/ˌpriˈlɛɡəsi/","extraExplanation":["这个词不是常见词汇，更常见的写法是加连字符的 **pre-legacy**，多用于IT与企业管理语境，表示“还没被归类为遗留系统，但迟早会变成遗留系统”的阶段。","如果你想表达“传统的/旧的但仍在用的系统”，更常用 **legacy system**；表达“现代化改造之前”，也常用 **pre-migration / pre-modernization** 等更标准的说法。"]}
{"word":"prelegal","summary":{"en":"Prelegal means “before formal legal action or court proceedings begin,” often used in business contexts like notices, reviews, or debt collection.","zh":"prelegal 指“在正式法律行动或诉讼开始之前”，常用于商业语境，如通知、审核或催收阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a legal case is formally filed or before lawyers and courts become directly involved.","zh":"在正式提起诉讼之前发生或进行的；在律师或法院直接介入之前的。"},"examples":[{"en":"The company sent a prelegal notice asking for payment within 10 days.","zh":"公司发出一份诉前通知，要求在10天内付款。"},{"en":"We are trying to resolve this dispute in the prelegal stage.","zh":"我们正努力在诉前阶段解决这场纠纷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Business, especially debt collection/insurance) Relating to early steps taken to encourage compliance or payment before starting legal action.","zh":"（商业用语，尤指催收/保险）指在启动法律程序前，为促使对方履行义务或付款而采取的早期措施。"},"examples":[{"en":"Your account is in prelegal collections, so you may still avoid court fees.","zh":"你的账户处于诉前催收阶段，因此你仍可能避免诉讼费用。"},{"en":"The insurer completed a prelegal review of the claim.","zh":"保险公司对该理赔进行了诉前审核。"}]}],"synonyms":["pre-litigation","before legal action","prior to litigation","out-of-court (context-dependent)"],"phonetic":"/priˈliːɡəl/","extraExplanation":["“pre-”是前缀，表示“在……之前”；“legal”表示“法律的”。合在一起，prelegal 常见于催收、合规通知、保险理赔等场景，意思通常是“尚未进入正式诉讼/法律程序”。","它多用于书面或行业语境（如邮件、账单、通知函）。在日常口语里，人们更常说“before taking legal action / before going to court（在采取法律行动/上法庭之前）”。"]}
{"word":"prelegate","summary":{"en":"A rare formal verb meaning to send someone ahead or officially assign/dispatch them to a place or duty in advance.","zh":"一个罕见的正式动词，指预先派遣某人先行（作使者/代表），或以官方方式调派、指派到某地/某职。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to send (someone) ahead of others; to dispatch as a messenger or representative in advance","zh":"（在他人之前）先派（某人）前往；预先派作使者/代表"},"examples":[{"en":"The governor prelegated an envoy to prepare the terms of peace.","zh":"总督先派一名使者去拟定和平条款。"},{"en":"She was prelegated to the capital to report the situation before the main delegation arrived.","zh":"她被先派到首都汇报情况，主代表团到达前先行说明。"}]},{"partOfSpeech":"vt.","definition":{"en":"to transfer or assign (someone) to another place or duty, often by official order (rare)","zh":"（常指以官方命令）调派/指派（某人）到别处或另任职务（罕见）"},"examples":[{"en":"After the dispute, the officer was prelegated to a remote post.","zh":"争端之后，那名军官被调派到偏远驻地。"}]}],"synonyms":["send ahead","dispatch","delegate","depute","assign","transfer"],"phonetic":"/ˈpriˌlɛɡeɪt/","extraExplanation":["这是一个非常罕见、偏书面/古典的动词，常见于历史或法律语境。现代英语里更常用 send ahead, dispatch, delegate, assign/transfer 等词来表达相近意思。","词源可追溯到拉丁语前缀 prae-（“在前、预先”）+ legare（“派遣、委任；任命为使节”）。因此它的核心画面是“先派人去做准备/传话/代表”。"]}
{"word":"prelegatee","summary":{"en":"A prelegatee is a person who receives a specified gift in a will, often intended to be satisfied before other legacies.","zh":"prelegatee 指遗嘱中被指定领取某项遗赠的人，常带有“优先领取/先满足”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is named in a will to receive a particular gift (a legacy), especially one intended to be paid or satisfied before other legacies.","zh":"（遗嘱中的）先受遗赠人；被指定优先领取某项遗赠（特定财产/金额）的人。"},"examples":[{"en":"Under the will, Maya was a prelegatee of $5,000 before the remaining estate was divided.","zh":"根据遗嘱，Maya 作为先受遗赠人先领取 5,000 美元，其余遗产再进行分配。"},{"en":"If the estate is small, a prelegatee may still be paid before residuary beneficiaries receive anything.","zh":"如果遗产规模较小，先受遗赠人仍可能在剩余遗产受益人获得任何东西之前先得到给付。"}]}],"synonyms":["legatee","beneficiary","heir (general)"],"phonetic":"/ˌpriˈlɛɡəti/","extraExplanation":["这是一个非常少见、偏法律/遗嘱语境的词。在现代英语里更常用 legatee（受遗赠人）或 beneficiary（受益人）。","词源上可理解为 pre-（在前）+ legatee（受遗赠人），强调“在其他遗赠之前先满足/先支付”的顺序概念。实际操作中是否“优先”，通常取决于遗嘱条款以及当地遗嘱认证（probate）规则。"]}
{"word":"prelegend","summary":{"en":"“Prelegend” is not standard English. It’s usually a technical label meaning “before the legend/key,” or (rarely) an informal way to mean “before it became legendary.”","zh":"“Prelegend” 不是标准英语，多为技术标签，表示“图例/说明之前的内容”；少见情况下可非正式表示“成传奇之前”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a technical or made-up label meaning “before the legend” (the legend/key section) in a map, chart, document, or interface.","zh":"不是标准英语词；常见于技术或自造用法，表示“图例/说明（legend/key）之前的部分”，如地图、图表、文档或界面中的图例前内容。"},"examples":[{"en":"In the layout file, the prelegend text appears above the map legend.","zh":"在版面文件中，prelegend 文本出现在地图图例（legend）上方。"},{"en":"Move the prelegend note to the top so readers see the warning before the legend.","zh":"把 prelegend 提示移到顶部，这样读者会在图例之前看到警告。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare, informal) “Before it became legendary” or “not yet legendary.” This is uncommon; writers usually say “before it became legendary” or “pre-legendary.”","zh":"（少见，非正式）表示“在变得传奇之前”或“尚未称得上传奇”。这种用法不常见；更常说 “before it became legendary” 或 “pre-legendary”。"},"examples":[{"en":"They were just a small band in their pre-legendary days.","zh":"在他们还没成名的时期（pre-legendary days），他们只是个小乐队。"},{"en":"The story focuses on the hero’s pre-legend phase, before anyone knew his name.","zh":"这个故事聚焦于英雄成名之前的阶段（pre-legend phase），那时还没人知道他的名字。"}]}],"synonyms":["before the legend","text above the legend","pre-legend note","pre-legendary (more common)","before it became legendary"],"phonetic":"/ˌpriˈlɛdʒənd/","extraExplanation":["“legend” 在英文里常见意思有两个：① 图例/符号说明（地图、图表里的 key）；② 传说/传奇人物。你看到的 “prelegend” 多半是把 “pre-”（在……之前）+ “legend” 拼在一起，用作字段名、标题或标签，并不属于常用词典词条。","如果你是在代码/软件/GIS 场景看到它，通常更建议写成更清晰的表达，例如：\"text above the legend\"（图例上方文字）、\"pre-legend note\"（图例前说明）。如果是想表达“传奇之前”，更地道的是 “pre-legendary” 或直接说 “before it became legendary”。"]}
{"word":"prelegendary","summary":{"en":"“Prelegendary” means before someone/something became legendary; it’s a rare, creative adjective often used in storytelling or commentary.","zh":"“prelegendary”指在“成为传奇/封神”之前的阶段；是较少见、偏写作用的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before someone or something becomes legendary or widely admired; before the “legend” status.","zh":"（在时间上）发生在某人/某事成名、被奉为传奇之前的；“成为传奇之前的”。"},"examples":[{"en":"The documentary shows the singer’s prelegendary years in small clubs.","zh":"这部纪录片展示了这位歌手在小酒吧驻唱的“成传奇之前”的岁月。"},{"en":"Fans love hearing prelegendary stories about how the team first formed.","zh":"粉丝很爱听这支队伍刚成立时那些“尚未成传奇”的故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a period before a story, figure, or event enters legend or folklore (used in history, mythology, or world-building).","zh":"（用于历史/神话/架空设定）与某人物、事件或叙事进入传说/民间故事之前的时期有关的。"},"examples":[{"en":"The novel imagines a prelegendary version of the hero—still unsure and learning.","zh":"小说想象了英雄“进入传说之前”的样子——仍然犹豫、还在学习。"},{"en":"Archaeologists debate whether the site connects to a prelegendary phase of the myth.","zh":"考古学家讨论该遗址是否与这则神话“传说化之前”的阶段有关。"}]}],"synonyms":["pre-fame","early","formative","before-the-legend","proto-legendary"],"phonetic":"/ˌpriːˈlɛdʒənˌdɛri/","extraExplanation":["这个词由前缀 pre-（“在……之前”）+ legendary（“传奇的”）构成，但在日常英语中并不常见，更像是写作、评论、影评/乐评里为了表达“成名之前/封神之前”而临时造出来的形容词。","更常见、自然的替代表达包括：early (years), before they were famous, pre-fame, before the legend, the formative years。"]}
{"word":"prelegislative","summary":{"en":"Prelegislative means “before formal lawmaking begins,” often describing early review, consultation, or hearings about a proposed law.","zh":"prelegislative 指“立法前的”，常用于描述法案进入正式立法程序之前的审查、征询或听证等阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a law is formally introduced or debated in a legislature, especially the early planning and consultation stage of making policy.","zh":"立法前的；在法案正式提交或在立法机关辩论之前发生的，尤指政策制定的早期规划与征询意见阶段。"},"examples":[{"en":"The committee held a prelegislative hearing to gather public feedback.","zh":"委员会举行了立法前听证会，以收集公众反馈。"},{"en":"Prelegislative talks helped different parties agree on the main goals of the bill.","zh":"立法前的磋商帮助不同阵营在法案的主要目标上达成一致。"}]}],"synonyms":["pre-law-making","preparliamentary","pre-enactment","pre-bill"],"phonetic":"/ˌpriːˌlɛdʒəˈsleɪtɪv/","extraExplanation":["该词常见于英美政治与公共政策语境，如“prelegislative scrutiny（立法前审查）”“prelegislative hearing（立法前听证）”。其核心含义不是“法律之外”，而是强调“在正式立法程序开始之前”的阶段。","构词：pre-（在……之前）+ legislative（立法的）。在英国议会语境中，“pre-legislative scrutiny”指在法案正式提交前，由委员会先行审阅草案并提出建议，以提高透明度与可操作性。"]}
{"word":"prelexical","summary":{"en":"Prelexical describes processing that happens before a signal is recognized as a word in the mental lexicon.","zh":"prelexical 指在信息被识别为“词”并进入心理词库之前的处理过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics, psycholinguistics) Happening before a word is recognized or accessed in the mental dictionary (lexicon).","zh":"（语言学/心理语言学）指在大脑把输入识别为“词”并进入心理词库（词汇表）之前发生的。"},"examples":[{"en":"Prelexical processing helps listeners turn raw sounds into units that can later become words.","zh":"前词汇加工帮助听者把原始语音信号转成单位，之后这些单位才可能被识别为词。"},{"en":"The model separates prelexical phonetic analysis from lexical word recognition.","zh":"该模型把前词汇的语音分析与词汇层面的词识别区分开来。"}]}],"synonyms":["pre-lexical","pre-word (informal)"],"phonetic":"/ˌpriˈlɛksɪkəl/","extraExplanation":["“pre-”表示“在……之前”，“lexical”表示“词汇的”。因此 prelexical 直译为“词汇之前的”。","常见搭配：prelexical processing（前词汇加工）、prelexical analysis（前词汇分析）、prelexical stage（前词汇阶段）。","在听觉理解中，它常指对声音/音素/音节等的初步处理；在阅读研究中，也可能指对字形、字母特征等的早期处理。","相关对比：lexical（词汇层面的）、postlexical（后词汇的：在词识别之后，如句法/语义整合）。"]}
{"word":"preliability","summary":{"en":"“Preliability” is rare/nonstandard; it may mean “before liability is established,” but it’s often a mistaken form of “reliability.”","zh":"“preliability”属罕见/非标准用法；可勉强指“责任尚未确定之前”，但更常见是把“reliability（可靠性）”写错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A suggested term meaning “before legal responsibility (liability) is established,” or “related to potential future liability.”","zh":"（罕见/非标准用法）一种拟造用法，指“在法律责任（liability）尚未确定之前的状态/阶段”，或“与未来可能产生的法律责任有关”。"},"examples":[{"en":"The report discusses preliability risks that could arise before any contract is signed.","zh":"这份报告讨论了在合同签署前可能出现的“责任未定”风险。"},{"en":"They added warning labels to reduce preliability exposure.","zh":"他们加上警示标签，以降低“责任确定之前”的潜在风险暴露。"}]},{"partOfSpeech":"n.","definition":{"en":"Often a misspelling or mistaken form; many writers actually mean “reliability” (how dependable something is).","zh":"常见于拼写或用词错误；很多人其实想表达的是“reliability（可靠性）”。"},"examples":[{"en":"If you mean reliability: We test the system’s reliability under heavy traffic.","zh":"如果你想说的是 reliability：我们在高流量下测试系统的可靠性。"},{"en":"Reliability matters more than speed for this task.","zh":"对这个任务来说，可靠性比速度更重要。"}]}],"synonyms":["potential liability","liability exposure","reliability"],"phonetic":"/ˌpriːˌlaɪəˈbɪləti/","extraExplanation":["“preliability”不是英语里常见、固定的标准词条；在法律/保险/风控语境中，更常见的表达包括：\n- “potential liability”（潜在责任）\n- “pre-existing liability”（既存责任/既有责任）\n- “liability exposure”（责任风险暴露）\n如果你告诉我句子原文或领域（法律、保险、工程等），我可以帮你判断最自然的标准说法。"]}
{"word":"preliable","summary":{"en":"“Preliable” is not standard English; it’s usually a misspelling of “reliable.”","zh":"“preliable” 不是标准英语；通常是把 “reliable（可靠的）” 拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) A rare or incorrect form, usually a misspelling of “reliable” (dependable; can be trusted).","zh":"（非标准用法）很少见或不正确的写法，通常是把 “reliable”（可靠的；值得信赖的）拼错了。"},"examples":[{"en":"I couldn’t find “preliable” in most dictionaries—did you mean “reliable”?","zh":"我在大多数词典里找不到 “preliable”——你是不是想写 “reliable”？"},{"en":"She is a reliable coworker who always finishes tasks on time.","zh":"她是个可靠的同事，总能按时完成任务。"}]}],"synonyms":["reliable","dependable","trustworthy","consistent"],"phonetic":"/priˈlaɪəbəl/","extraExplanation":["“preliable” 不是现代英语里的常用标准单词，所以在正式写作、考试、简历中建议不要使用。","如果你本来想表达“可靠的”，正确拼写通常是 **reliable**。","如果你想表达“柔软可弯曲的/有弹性的”，你可能想写的是 **pliable**（可弯曲的、柔韧的）。"]}
{"word":"prelibation","summary":{"en":"Prelibation is a rare, literary noun meaning a small foretaste or early sample of what’s to come.","zh":"prelibation 是较少见、偏文学的名词，指对将来事物的“先尝一口/预先体验”，即一种“预尝、先感受”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small preliminary taste; a foretaste of something (literal or figurative).","zh":"预先尝到的一点滋味；（对将来事物的）预尝、先尝、预感（可指字面或比喻意义）。"},"examples":[{"en":"The first chapter offers a prelibation of the novel’s darker themes.","zh":"第一章让人预先尝到这部小说更黑暗主题的味道。"},{"en":"A short rehearsal can be a prelibation of the pressure you’ll feel on opening night.","zh":"一次简短的彩排，可能就是你在首演之夜将感受到压力的预演。"}]}],"synonyms":["foretaste","preview","taste","hint","glimpse"],"phonetic":"/ˌpriːlaɪˈbeɪʃən/","extraExplanation":["这是一个很少见、偏文学/修辞的词，常用来强调“先尝一口”“先感受一点点”的效果，比常见的 foretaste / preview 更文艺。","词源来自拉丁语：prae-（在前）+ libare（尝一点/啜饮；也与 libation“奠酒、祭酒”同源）。因此它的核心画面感是“在正式享用前先抿一口”。"]}
{"word":"preliberal","summary":{"en":"Preliberal means “before liberalism,” especially in political or historical discussion.","zh":"preliberal 指“自由主义之前的”，常用于政治或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(politics, history) Existing before the rise of liberalism; belonging to a time, system, or attitude earlier than modern liberal ideas (such as individual rights, constitutional government, or free markets).","zh":"（政治/历史）自由主义兴起之前的；属于现代自由主义观念（如个人权利、宪政、自由市场）出现之前的时代、制度或观念的。"},"examples":[{"en":"Some historians describe the absolute monarchy as a preliberal form of government.","zh":"一些历史学家把君主专制描述为一种前自由主义的政体。"},{"en":"The essay compares preliberal political thought with later liberal theories of rights.","zh":"这篇文章比较了前自由主义的政治思想与后来的自由主义权利理论。"}]}],"synonyms":["pre-liberal","pre-modern (in some contexts)","traditional (sometimes)","illiberal (related but not identical)"],"phonetic":"/ˌpriˈlɪbərəl/","extraExplanation":["“preliberal”不是日常高频词，更多出现在政治哲学、历史学写作中，用来概括“自由主义成为主流之前”的制度与观念（例如等级秩序、宗教权威或君主权力更强的社会结构）。","理解时可抓住词缀：pre- = “在……之前”，liberal = “自由主义的/自由派的”。它通常是中性描述，但在不同作者笔下可能带有评价色彩。"]}
{"word":"preliberality","summary":{"en":"A rare noun meaning the state or period before liberality (generosity or liberal outlook) is shown or adopted.","zh":"一个罕见名词，指在表现或接受“liberality”（多指慷慨；也可指开明态度）之前的状态或时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A period, condition, or attitude that exists before liberality (generosity or open-handed giving) is shown; a lack of liberality beforehand.","zh":"（罕见）在表现出慷慨（大方施与）之前的时期、状态或态度；指尚未慷慨、之前的不大方。"},"examples":[{"en":"The essay contrasts the ruler’s preliberality with his later generosity toward the poor.","zh":"这篇文章对比了这位统治者早期的不慷慨与他后来对穷人的慷慨。"},{"en":"In her preliberality, she counted every dollar, but later she donated regularly.","zh":"在她还不够大方的时候，她每一块钱都算得很细；但后来她开始定期捐款。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, political) The time or viewpoint before someone adopts liberal ideas or policies.","zh":"（罕见，政治）某人在接受自由主义思想或政策之前的时期或立场。"},"examples":[{"en":"He describes his preliberality as cautious and tradition-bound.","zh":"他把自己成为自由派之前的立场描述为谨慎而守旧。"},{"en":"The book traces her journey from preliberality to activism.","zh":"这本书追踪了她从前自由主义阶段到投身行动主义的转变。"}]}],"synonyms":["lack of generosity","stinginess (for meaning 1)","pre-liberal period (for meaning 2)","early outlook"],"phonetic":"/ˌpriːˌlɪbəˈræləti/","extraExplanation":["这个词非常少见，多属于“临时造词/学术写作中的派生词”。它由前缀 pre-（“在……之前”）+ liberality 组成。","liberality 在英语里最常见的意思是“慷慨、大方”，其次才可能指“开明/宽容”的态度；政治语境里更常用 liberalism（自由主义）而不是 liberality。","写作中如果想更自然：表示“不慷慨”可用 stinginess / lack of generosity；表示“成为自由派之前”可用 before he became a liberal / his pre-liberal period。"]}
{"word":"preliberally","summary":{"en":"A rare adverb meaning “in a pre-liberal (before liberalism) way.”","zh":"一个很少见的副词，意思是“以自由主义之前（前自由主义）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that belongs to or reflects a period before liberal political ideas or liberal reforms became influential; in a “pre-liberal” manner.","zh":"以（政治或思想上）自由主义兴起或自由主义改革之前的方式；以“前自由主义时期”的方式。"},"examples":[{"en":"Preliberally, the state regulated printing much more strictly.","zh":"在自由主义出现之前的时期，国家对印刷出版的管制要严格得多。"},{"en":"The essay compares how rights were discussed preliberally and in modern democracies.","zh":"这篇文章比较了在前自由主义时期与现代民主社会中，人们如何讨论权利。"}]}],"synonyms":["pre-liberally","in a pre-liberal way","before liberal reforms"],"phonetic":"/ˌpriːˈlɪbərəli/","extraExplanation":["这个词非常少见，多用于学术写作（政治思想史、制度史等）。构词上是 pre-（“在……之前”）+ liberally（“自由地/慷慨地”，也可引申为“自由主义地”）。在此通常不是“慷慨地”，而是与 liberal（自由主义）相关：preliberally ≈ “在自由主义之前/以非自由主义框架”。如果你想表达“以前更慷慨地”，更自然的说法是 earlier/more generously in the past。"]}
{"word":"preliberate","summary":{"en":"“Preliberate” is a rare word meaning “to liberate in advance” or “to free beforehand.”","zh":"“preliberate”是一个罕见词，意思是“提前解放/预先释放”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free or release someone or something in advance; to liberate beforehand (rare/nonstandard usage).","zh":"提前解放；预先释放（用法罕见/不太规范）。"},"examples":[{"en":"Some activists argued that education can preliberate people from fear before any political change happens.","zh":"一些行动者认为，教育能在人们的政治处境改变之前，就先把他们从恐惧中“预先解放”出来。"},{"en":"The writer uses “preliberate” to suggest an early inner freedom, not an official or legal liberation.","zh":"作者用“preliberate”来表达一种更早出现的内在自由，而不是正式或法律意义上的解放。"}]}],"synonyms":["free in advance","liberate early","release beforehand"],"phonetic":"/ˌpriˈlɪbəˌreɪt/","extraExplanation":["“preliberate”由前缀 pre-（“在……之前”）+ liberate（“解放/释放”）构成，但它不是常见标准词汇，更像是作者临时造词（nonce word）或较少见的学术/修辞用法。","在更自然的英语里，通常会用更常见的表达来替代，例如：liberate early / free in advance / provide an early sense of freedom（根据语境选用）。"]}
{"word":"preliberated","summary":{"en":"Preliberated means “liberated in advance,” often used in thoughtful or metaphorical writing.","zh":"Preliberated 意为“预先被解放/提前获得自由”，常用于较具思辨或隐喻的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"freed or released in advance; liberated before some later event, change, or official action","zh":"预先被解放的；提前获得自由的（在某个后续事件或正式行动之前）"},"examples":[{"en":"Some people feel preliberated by remote work—they gained freedom before their company changed its official policy.","zh":"有些人觉得远程办公让他们“预先被解放”了——在公司正式改政策之前，他们就已经获得了自由。"},{"en":"The artist described her style as preliberated, as if she had escaped the rules before learning them.","zh":"那位艺术家把自己的风格形容为“预先被解放的”，仿佛在学习规则之前就已经逃离了规则。"}]}],"synonyms":["freed in advance","already liberated","prematurely freed","liberated ahead of time"],"phonetic":"/ˌpriːˈlɪbəˌreɪtɪd/","extraExplanation":["“preliberated”不是日常高频词，更常见于写作、评论或思想讨论中，用来表达一种带有隐喻的“提前获得自由/解放”的状态。","构词：pre-（在……之前）+ liberated（被解放的）。在现实语境里，它常用来强调“尚未正式发生，但心理上/实际效果上已经发生”的感觉。","近义表达可用：already free（已经自由了）、liberated ahead of time（提前解放）、freed in advance（预先释放）。"]}
{"word":"preliberating","summary":{"en":"Preliberating (often written pre-liberating) is a rare word meaning “before liberation” or “helping to bring about liberation in advance.”","zh":"preliberating（常写作 pre-liberating）是个罕见词，表示“解放之前的”，或“提前促成解放的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually written with a hyphen) happening before liberation, or intended to prepare for liberation.","zh":"（罕见；通常写作带连字符的形式）发生在“解放/摆脱束缚”之前的；或为解放作准备的。"},"examples":[{"en":"The essay focuses on pre-liberating movements that shaped the later revolution.","zh":"这篇文章关注那些影响后续革命的“解放前”运动。"},{"en":"Some leaders used pre-liberating reforms to weaken the old system.","zh":"一些领导人用“解放前”的改革来削弱旧制度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of liberating in advance; taking steps that help someone/something become free before a key event.","zh":"（罕见）提前进行解放/解困的行为；在关键事件前采取措施让某人/某事变得更自由。"},"examples":[{"en":"They spoke of pre-liberating the workforce through education and legal rights.","zh":"他们谈到通过教育与法律权利来“提前解放”劳动力。"},{"en":"The group saw community organizing as preliberating people from fear.","zh":"该团体把社区组织视为让人们摆脱恐惧的“提前解放”。"}]}],"synonyms":["pre-liberation","before liberation","preparatory","emancipatory (in effect)"],"phonetic":"/ˌpriˈlɪbəˌreɪtɪŋ/","extraExplanation":["“preliberating / pre-liberating”不是常见词，在主流词典中也不一定收录。写作中更自然的表达通常是：\n- “pre-liberation” （解放前的）\n- “before liberation” （在解放之前）\n- “preparatory steps for liberation” （为解放作准备的步骤）\n如果你是在特定理论/政治语境里看到它，往往是作者为了强调“解放尚未发生，但已经开始产生解放效果”的概念而造词或非常规用法。"]}
{"word":"preliberation","summary":{"en":"Preliberation refers to the period or conditions before liberation, often used in historical or political contexts.","zh":"preliberation 指“解放之前的（时期/状况）”，常用于历史或政治语境中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before a country, group, or place is liberated (freed from control, occupation, or oppression).","zh":"发生在“解放”之前的；指某个国家、群体或地区在摆脱控制、占领或压迫之前的。"},"examples":[{"en":"The museum has a section on preliberation life under colonial rule.","zh":"博物馆有一个展区介绍殖民统治下的解放前生活。"},{"en":"Preliberation documents are often harder to find because many records were lost.","zh":"解放前的文件往往更难找到，因为很多档案已经遗失。"}]},{"partOfSpeech":"n.","definition":{"en":"The time or conditions before liberation.","zh":"解放前时期；解放前的社会状况。"},"examples":[{"en":"In the novel, the narrator describes preliberation as a period of fear and scarcity.","zh":"在小说中，叙述者把解放前描写成一个充满恐惧与匮乏的时期。"}]}],"synonyms":["before liberation","prior to liberation","pre-independence","prewar"],"phonetic":"/ˌpriˌlɪbəˈreɪʃən/","extraExplanation":["“preliberation”多见于历史、政治叙述或回忆录中，常用来对比“pre-/post-liberation（解放前/解放后）”。具体“解放”指什么要看语境：可能是摆脱殖民统治、结束战争占领，或某个政治力量取得政权后所称的“解放”。","这个词在日常口语中不常用，更常见的替代表达有“before liberation”“prior to liberation”“pre-independence（独立前）”“prewar（战前）”等，选择哪一个取决于历史事件的性质。"]}
{"word":"prelicense","summary":{"en":"Prelicense means “before getting a license,” especially for required courses, training, or exams.","zh":"prelicense 指“取得执照之前的”，尤指必须完成的课程、培训或考试。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often written “pre-license” or “prelicensing”) happening or required before you officially receive a license; used especially for required education, training, or exams.","zh":"（常写作 pre-license 或 prelicensing）指在正式取得执照/许可证之前发生的或必须完成的；常用于执照前的课程、培训或考试。"},"examples":[{"en":"She completed the prelicense course before applying for her real estate license.","zh":"她在申请房地产执照之前完成了执照前课程。"},{"en":"The state requires prelicense training for new insurance agents.","zh":"该州要求新保险代理人完成执照前培训。"}]},{"partOfSpeech":"n.","definition":{"en":"A course, program, or requirement you complete before getting a professional license.","zh":"（非正式用法）指取得职业执照前需要完成的课程/项目/要求。"},"examples":[{"en":"I’m finishing my prelicense this month and then I can schedule the exam.","zh":"我这个月把执照前课程修完，然后就可以预约考试。"}]}],"synonyms":["prelicensing","pre-license","pre-licensure"],"phonetic":"/ˌpriːˈlaɪsəns/","extraExplanation":["在美国语境里，这个词常见于房地产（real estate）和保险（insurance）行业，最常搭配的是 prelicense course / prelicensing education（执照前课程/教育）。","拼写上更规范的写法通常是带连字符的 pre-license（作形容词）或合写的 prelicensing（多作形容词/名词修饰语），例如：prelicensing requirements。不同州/行业用法略有差异。"]}
{"word":"prelicensed","summary":{"en":"Prelicensed means licensed in advance, especially for software or digital content.","zh":"prelicensed 指“预先获得许可/授权的”，常用于软件或数字内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already licensed in advance; having a license granted before use, sale, or distribution.","zh":"预先获得许可的；在使用、销售或分发之前就已被授权的。"},"examples":[{"en":"The laptop came with prelicensed software, so we didn’t need to buy a separate key.","zh":"这台笔记本自带预先授权的软件，所以我们不需要另外买序列号。"},{"en":"They sell prelicensed music for videos to avoid copyright problems.","zh":"他们出售用于视频的预先授权音乐，以避免版权问题。"}]}],"synonyms":["pre-approved","already licensed","licensed in advance","authorized in advance"],"phonetic":"/priˈlaɪsənst/","extraExplanation":["“prelicensed”常见于软件、音乐、图片等数字内容领域，强调授权（license）已经在产品交付或使用之前办妥，例如“预装并已授权的软件”。","有时也会写作“pre-licensed”。在正式写作中，如果需要更自然的表达，也可用“already licensed”“licensed in advance”。"]}
{"word":"prelicensing","summary":{"en":"“Prelicensing” refers to the period, requirements, or activities before someone receives an official license.","zh":"“prelicensing”指取得正式执照之前的阶段、要求或相关活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Before receiving an official license; relating to the period or requirements that come before you are licensed.","zh":"发放正式执照之前的；与取得执照前的阶段或要求有关的。"},"examples":[{"en":"She completed a prelicensing course before taking the real estate exam.","zh":"她在参加房地产考试前完成了执照前课程。"},{"en":"Prelicensing requirements vary by state.","zh":"各州的执照前要求各不相同。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or activities done before getting an official license.","zh":"取得正式执照之前要完成的流程或活动。"},"examples":[{"en":"Prelicensing can include classes, background checks, and fingerprinting.","zh":"执照前流程可能包括上课、背景审查和采集指纹。"},{"en":"They’re still in prelicensing, so they can’t practice independently yet.","zh":"他们还在执照前阶段，所以还不能独立执业。"}]}],"synonyms":["pre-licensing","prelicensure","licensure preparation","license preparation"],"phonetic":"/ˌpriːˈlaɪsənsɪŋ/","extraExplanation":["“pre-”表示“在……之前”，“licensing”表示“发放执照/许可”。合在一起常见于需要考试或监管的行业，如房地产（real estate）、保险（insurance）、护理/医学（nursing/medical）、心理咨询（counseling）等。","拼写上也常见作“pre-licensing”（带连字符）或“prelicensure”（多用于医学/护理领域，表示执照前阶段）。在正式写作中按你所在行业或机构的规范用法为准。"]}
{"word":"prelife","summary":{"en":"Prelife means “before life,” describing conditions or a time period prior to the existence of living things (and sometimes, informally, before someone’s birth).","zh":"prelife 表示“生命之前”，可形容生命出现前的条件或时期；也可（较口语）指某人出生之前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before life begins or before living things exist.","zh":"生命出现之前的；在生命开始之前发生的。"},"examples":[{"en":"Some researchers discuss the prelife conditions of early Earth.","zh":"一些研究者讨论地球早期的“前生命”条件。"},{"en":"The novel imagines a prelife world where oceans are chemically active but lifeless.","zh":"这部小说想象了一个“前生命”的世界：海洋化学活动频繁，但没有生命。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or state before life exists, or (more informally) the time before someone is born.","zh":"生命出现之前的时期或状态；（较口语）某人出生之前的时期。"},"examples":[{"en":"In cosmology discussions, “prelife” can mean the era before the first organisms.","zh":"在宇宙学讨论中，“prelife”可指最早生物出现之前的时代。"},{"en":"He joked that in his “prelife,” he didn’t worry about deadlines.","zh":"他开玩笑说在他的“前世”（指出生前），根本不用担心截止日期。"}]}],"synonyms":["prebiotic","primordial","lifeless (context-dependent)","before life emerged","pre-birth (informal sense)"],"phonetic":"/ˈpriːlaɪf/","extraExplanation":["“prelife”不是非常常见的标准词，更常见的写法是加连字符的“pre-life”。在科学写作中，人们往往会用更具体的词，如“prebiotic（前生物的）”“primordial（原初的）”或“before life emerged（生命出现之前）”。","在科幻、哲学或宗教语境里，“prelife”有时会被用来讨论“生命出现之前的世界”或“出生之前”的概念；正式场合建议根据语境改用更明确的表达。"]}
{"word":"prelim","summary":{"en":"“Prelim” is an informal short form of “preliminary,” meaning something or an event that comes before the main one.","zh":"“prelim”是“preliminary”的非正式缩写，表示“初步的”或“预赛/初试”，发生在正式环节之前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Preliminary; happening before the main event or final stage.","zh":"（非正式）初步的；在主要事件或最后阶段之前发生的。"},"examples":[{"en":"We had a prelim meeting to agree on the basic plan.","zh":"我们开了一个初步会议，先把基本计划定下来。"},{"en":"The fighters won their prelim bouts before the main card.","zh":"选手们先打预赛，再进入主赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A preliminary event, round, exam, or meeting held before the main one.","zh":"（非正式）预赛；初试；初步的活动/会议（在正式环节之前）。"},"examples":[{"en":"I passed the prelim, so now I can take the final exam.","zh":"我通过了初试，所以现在可以参加期末考试了。"},{"en":"Let’s do a quick prelim before we invite the whole team.","zh":"在邀请整个团队之前，我们先做个简短的初步讨论。"}]}],"synonyms":["preliminary","trial","qualifier","warm-up","opening round"],"phonetic":"/prəˈlɪm/","extraExplanation":["“Prelim”是“preliminary”的缩写，常见于口语、短信、标题、体育/赛事（如拳击、综合格斗的prelim bouts/undercard）、以及学校或职业考试语境（prelim exam/round）。正式写作里通常用完整形式“preliminary”。","常见搭配：prelim meeting（初步会议），prelim results（初步结果），prelim round（预赛/初赛），prelims and finals（预赛和决赛）。"]}
{"word":"preliminaries","summary":{"en":"“Preliminaries” means the things done or said before the main event, or the basic introductory material before deeper study.","zh":"“preliminaries”指主要事情开始前的准备/前置程序，也可指深入学习前的基础入门内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"preparatory actions, information, or details that come before the main event or work","zh":"前期准备；预备工作；开场前的事项（在主要事情开始之前的行动、信息或细节）"},"examples":[{"en":"Let’s get the preliminaries out of the way before the meeting starts.","zh":"我们先把会议开始前的准备事项处理好。"},{"en":"After the preliminaries, the judge began the trial.","zh":"完成庭审前的程序后，法官开始审理。"}]},{"partOfSpeech":"n.","definition":{"en":"basic introductory material needed before deeper study of a subject","zh":"入门知识；基础导论（深入学习前需要先掌握的内容）"},"examples":[{"en":"You should learn the preliminaries of algebra before taking calculus.","zh":"学微积分之前，你应该先掌握代数的基础。"},{"en":"The book covers the preliminaries and then moves to more advanced topics.","zh":"这本书先讲基础导论，然后进入更高级的主题。"}]}],"synonyms":["preparations","prelim steps","preparation work","introductory material","groundwork","formalities"],"phonetic":"/prɪˈlɪməˌnɛriz/","extraExplanation":["“Preliminaries”通常用复数形式，指一组“先做的事/先说明的事”。在正式场合很常见：会议、比赛、法庭程序、学术写作等。","词根来自拉丁语 *prae-*（在……之前）+ *limen*（门槛）。可以理解为“进门前的门槛步骤”。","常见搭配：**the preliminaries**（会前/赛前/正戏开始前的程序或寒暄）、**preliminaries out of the way**（把前置事项先处理掉）。在体育语境里也可指“预赛/初赛（preliminary rounds）”。"]}
{"word":"preliminarily","summary":{"en":"Preliminarily means “in a preliminary, not-yet-final way.”","zh":"preliminarily 表示“初步地、尚未最终确定地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an initial or tentative way; before a final decision, result, or detailed work is completed.","zh":"初步地；预先地；在最终决定、结果或详细工作完成之前（带有试探性）。"},"examples":[{"en":"We preliminarily agreed on the schedule, but we still need approval.","zh":"我们初步同意了时间安排，但还需要批准。"},{"en":"The data were preliminarily analyzed to identify major trends.","zh":"对数据进行了初步分析，以找出主要趋势。"}]}],"synonyms":["initially","provisionally","tentatively","at first","in the early stages"],"phonetic":"/prɪˌlɪməˈnɛrəli/","extraExplanation":["“Preliminarily”来自“preliminary（初步的）”，常用于学术研究、报告、调查、会议纪要、法律/医疗等场景，表示“先做个初步结论，之后还会更改或补充”。","语气上比“initially（起初）”更强调“尚未最终确定/仍需进一步验证”。常见搭配：preliminarily agreed / preliminarily concluded / preliminarily analyzed / preliminarily identified。"]}
{"word":"preliminary","summary":{"en":"Preliminary means “initial and not final,” used for early plans, results, meetings, or stages before the main event.","zh":"preliminary 表示“初步的、非最终的”，常用于计划、结果、会议或进入正赛前的阶段/预赛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done first to prepare for something more important; not final.","zh":"初步的；预备性的；在更重要或最终步骤之前进行的。"},"examples":[{"en":"These are just preliminary results, so we may need more data.","zh":"这些只是初步结果，所以我们可能还需要更多数据。"},{"en":"We had a preliminary meeting to discuss the plan.","zh":"我们开了一个预备会议来讨论计划。"}]},{"partOfSpeech":"n.","definition":{"en":"An initial contest or stage (often plural) used to decide who can enter the main event.","zh":"（常用复数）预赛；初赛；用来决定谁能进入正赛的初步比赛或阶段。"},"examples":[{"en":"She qualified for the finals after winning the preliminaries.","zh":"她赢得预赛后晋级决赛。"}]}],"synonyms":["initial","early","introductory","preparatory","tentative"],"phonetic":"/prɪˈlɪməˌnɛri/","extraExplanation":["常见搭配：preliminary results（初步结果）、preliminary investigation（初步调查）、preliminary hearing（法庭的初步听证）、preliminary round（预赛/初赛）。","语气上，preliminary 常暗示“之后可能会改变或补充”，比 temporary（临时的）更强调“为下一步做准备”。"]}
{"word":"prelimit","summary":{"en":"Prelimit means to set a limit beforehand (uncommon; often replaced by more natural phrases like “set a limit in advance”).","zh":"Prelimit 指“预先设限/事先限制”（不常见，常用更自然的说法如 set a limit in advance）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to set a limit in advance; to restrict ahead of time","zh":"预先设限；事先限制"},"examples":[{"en":"The organizers prelimit ticket sales to reduce overcrowding.","zh":"主办方预先限制门票销售，以减少拥挤。"},{"en":"Some apps prelimit how many requests you can make per minute.","zh":"一些应用会预先限制你每分钟可发起的请求次数。"}]},{"partOfSpeech":"n.","definition":{"en":"a limit set in advance (less common)","zh":"预先设定的上限（较少用）"},"examples":[{"en":"The policy includes a prelimit on monthly spending.","zh":"该政策包含每月支出的预先上限。"}]}],"synonyms":["set a limit in advance","cap","restrict","impose a limit","pre-set a limit"],"phonetic":"/ˌpriːˈlɪmɪt/","extraExplanation":["“prelimit”不是非常常见的标准词，更常见的表达是“set a limit in advance / cap / restrict / impose a limit beforehand”。在技术或管理语境里偶尔会看到用作动词，意思通常能被理解。","构词上：pre-（预先）+ limit（限制）。因为“limit”本身就可作动词/名词，所以日常写作中更推荐用更自然的搭配来表达。"]}
{"word":"prelimitate","summary":{"en":"“Prelimitate” is not standard English; use “preliminary,” “preliminaries,” or (rarely) “preliminate,” depending on your meaning.","zh":"“prelimitate”不是标准英语；请根据意思改用“preliminary”“preliminaries”，或（较少见）“preliminate”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or mistaken form. Writers often mean “preliminary” (adj.), “preliminaries” (n.), or (more rarely) “preliminate” (v., meaning to do something in a preliminary way).","zh":"不是标准英语单词；通常是拼写或用词错误。写作者往往想表达“preliminary”（形容词：初步的）、“preliminaries”（名词：准备工作/预赛），或（较少见）“preliminate”（动词：进行初步处理）。"},"examples":[{"en":"Incorrect: We need to prelimitate the report before the meeting.","zh":"错误：We need to prelimitate the report before the meeting."},{"en":"Better: We need to do a preliminary review of the report before the meeting.","zh":"更好：我们需要在会议前对报告做一次初步审查。"},{"en":"Alternative (rare): We need to preliminate the report before the meeting.","zh":"另一种（少见）：我们需要在会议前对报告做初步处理。"}]}],"synonyms":["preliminary","preliminaries","(rare) preliminate"],"phonetic":"/prɪˈlɪməˌteɪt/","extraExplanation":["“prelimitate”在常见词典与标准用法中基本不存在。如果你是在写“初步的/预备的”，通常用形容词“preliminary”（如：a preliminary check）。如果你是指“准备工作/预赛”，常用名词复数“preliminaries”（如：the preliminaries of a project / Olympic preliminaries）。","“preliminate”作为动词非常少见，正式写作更自然的表达是：do a preliminary review/check/analysis，或用更具体的动词如 review / check / draft / prepare。","如果你本来想表达“事先谋划、预谋”，那更可能是“premeditate”（如：premeditated crime = 预谋犯罪）。"]}
{"word":"prelimitated","summary":{"en":"“Prelimitated” is not standard English; you probably want “premeditated” or “preliminary,” depending on your meaning.","zh":"“prelimitated”不是标准英语；通常应根据意思改用“premeditated（预谋的）”或“preliminary（初步的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard / likely misspelling. “Prelimitated” is not a common or accepted English word in standard dictionaries. People often write it when they mean “premeditated” (planned in advance) or “preliminary” (done first / early).","zh":"非标准用法／很可能是拼写错误。“prelimitated”不是标准词典中常见或被接受的英语单词。人们常用它来误写“premeditated”（预先策划的）或“preliminary”（初步的／先行的）。"},"examples":[{"en":"The judge said the attack was premeditated (not “prelimitated”).","zh":"法官说这次袭击是预谋的（应写 premeditated，而不是“prelimitated”）。"},{"en":"We had a preliminary meeting before the main conference.","zh":"在主会议之前我们开了一个初步会议。"}]}],"synonyms":["premeditated","preplanned","prearranged","preliminary","initial"],"phonetic":"/priˌlɪməˈteɪtɪd/","extraExplanation":["这个词看起来像把两个词的感觉混在一起了：pre-（“提前”）+ limited（“受限的”）或 + preliminary（“初步的”）。但英语里不这样构词，所以写作“prelimitated”会显得不自然。","如果你告诉我你想表达的中文意思（例如“预谋的/初步的/提前设限的/预先限定的”），我可以帮你选最贴切的标准表达，并给更多例句。"]}
{"word":"prelimitating","summary":{"en":"Premeditating = planned in advance; done with prior intent (often negative).","zh":"Premeditating = 事先计划好的；有预谋的（常带负面含义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(likely intended spelling) thinking about and planning something—especially something bad—before doing it; acting with prior intent.","zh":"（可能是你想拼写的词）事先想好并计划要做某事（尤指不好的事）；有预谋的。"},"examples":[{"en":"The prosecutor argued the attack was premeditating, not accidental.","zh":"检方认为这次袭击是有预谋的，而不是意外。"},{"en":"He denied premeditating any harm.","zh":"他否认自己预谋伤害任何人。"},{"en":"The novel describes a premeditating villain who carefully sets traps for others.","zh":"小说描写了一个有预谋的反派，他精心为他人设下陷阱。"}]}],"synonyms":["planned","intentional","deliberate","calculated","premeditated"],"phonetic":"/priˈmɛdəˌteɪtɪŋ/","extraExplanation":["“prelimitating”在英语里几乎不使用，最常见的目标词是 **premeditating**（或形容词 **premeditated**）。","用法提示：日常英语里更常说 **premeditated (adj.)**（“有预谋的”）或动词 **premeditate (v.)**（“预谋”）。例如：*a premeditated murder*（预谋杀人）。","不要和 **preliminary**（初步的）混淆：*preliminary results* 是“初步结果”，和“预谋”无关。"]}
{"word":"prelimitation","summary":{"en":"“Prelimitation” is an uncommon noun meaning a limitation set beforehand.","zh":"“prelimitation”是一个不常见的名词，意思是“事先设定的限制/界限”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) a limitation or restriction set in advance; a pre-set boundary.","zh":"（不常见）预先设定的限制；事先规定的界限。"},"examples":[{"en":"The grant comes with prelimitation on how the money may be spent.","zh":"这项拨款对资金用途有预先设定的限制。"},{"en":"Before the discussion begins, we should agree on a prelimitation to keep the meeting focused.","zh":"在讨论开始前，我们应先约定一些事先的限制，以便让会议更聚焦。"}]}],"synonyms":["limitation","restriction","constraint","condition","boundary"],"phonetic":"/priˌlɪməˈteɪʃən/","extraExplanation":["“prelimitation”在现代英语中非常少见，很多情况下人们会用更常见的词来表达同样意思，比如 limitation（限制）、restriction（限制/约束）、constraint（约束）。","它由前缀 pre-（在……之前）+ limitation（限制）构成，字面意思就是“提前的限制”。","如果你想表达“初步的/预备的”，通常应该用 preliminary（初步的）或 preparation（准备）而不是 prelimitation。"]}
{"word":"prelimited","summary":{"en":"“Prelimited” means limited beforehand—its limit is decided in advance.","zh":"“prelimited”指“事先就限定好上限/名额/次数”的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Limited in advance; set with a fixed limit before something begins.","zh":"预先限定的；事先设定上限的。"},"examples":[{"en":"Each applicant gets a prelimited number of attempts to take the test.","zh":"每位申请者在考试中都有一个预先限定的尝试次数。"},{"en":"The event uses prelimited seating, so tickets may sell out quickly.","zh":"该活动采用预先限定的座位数，因此门票可能很快售罄。"}]}],"synonyms":["pre-limited","pre-set","predetermined","capped","fixed","restricted"],"phonetic":"/priˈlɪmɪtɪd/","extraExplanation":["“prelimited”在日常英语里不算常见，更常见的写法是带连字符的“pre-limited”，或直接用更自然的表达：“limited in advance / set in advance / capped beforehand”。","在商业、保险、金融、软件许可等语境里偶尔会看到，用来强调“限制不是临时决定的，而是事先就规定好了（例如额度、名额、次数、资源上限）”。"]}
{"word":"prelimiting","summary":{"en":"“Prelimiting” usually means “before reaching a limit,” mainly in academic contexts; as a verb form, it can mean “restricting in advance” (rare).","zh":"“prelimiting”通常指“在达到极限之前的（预极限）”，多见于学术语境；作动词形式时可指“事先限制”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in math/science) happening before a final limit or limiting case is reached; not yet fully “limiting.”","zh":"（尤用于数学/科学）在达到最终“极限/极限情形”之前发生的；尚未进入真正极限状态的。"},"examples":[{"en":"They studied the prelimiting behavior of the model before taking the limit as time goes to infinity.","zh":"他们在令时间趋于无穷之前，先研究了该模型的预极限（prelimiting）行为。"},{"en":"In the prelimiting case, small differences in the parameters still matter.","zh":"在预极限情况下，参数的微小差异仍然会产生影响。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “prelimit”: to set a limit in advance or restrict beforehand (rare).","zh":"“prelimit”的现在分词：预先设定限制；事先约束（较少见）。"},"examples":[{"en":"The policy is prelimiting who can access the data before the review is finished.","zh":"在审核完成之前，该政策正在预先限制谁可以访问数据。"}]}],"synonyms":["preliminary","pre-limit","prior","incipient","restricting beforehand"],"phonetic":"/ˌpriːˈlɪmɪtɪŋ/","extraExplanation":["“prelimiting”在日常英语里很少单独使用，更常见于学术写作（尤其是数学、物理、统计）中，如“prelimiting distribution / behavior（预极限分布/行为）”，用来强调：你还没有真正把某个参数“取极限”，而是在接近极限之前先分析其性质。","如果你想表达更通用的意思，很多场景用“preliminary（初步的）”“prior（先前的）”“restricting beforehand（事先限制）”会更自然。"]}
{"word":"prelimits","summary":{"en":"“Prelimits” is a rare word meaning preliminary limits; many people actually mean “prelims” (= preliminaries).","zh":"“prelimits”较罕见，意为“预先限制/界限”；很多情况下实际想表达的是“prelims”（preliminaries 的缩写，指预赛/初试）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) preliminary limits or boundaries set before a final decision, plan, or measurement.","zh":"（罕见用法）在最终决定、计划或测量前预先设定的限制/界限。"},"examples":[{"en":"Before we start the design, let’s agree on the prelimits for cost and timing.","zh":"在开始设计之前，我们先就成本和时间的预先限制达成一致。"},{"en":"The team discussed the prelimits of the study to avoid overpromising results.","zh":"团队讨论了研究的前期限制，以避免对结果过度承诺。"}]}],"synonyms":["preliminary limits","initial limits","constraints","boundaries"],"phonetic":"/ˌpriːˈlɪmɪts/","extraExplanation":["“prelimits”不是常见英语词。很多情况下人们想写的是：\n1）“prelims”（preliminaries 的口语缩写）：指“初赛/预赛/初试/前期考试”，如 *the prelims*（预赛/初试）。\n2）“preliminary limits”（预先限制）：更自然的表达是直接说 *preliminary limits* 或 *initial limits*。如果你告诉我你看到这个词的句子/场景（考试、比赛、工程、研究等），我可以帮你确认最贴切的意思与用法。"]}
{"word":"prelims","summary":{"en":"“Prelims” means preliminary rounds, exams, or preparatory work before the main event.","zh":"“prelims”指正式活动或最终阶段之前的预赛、初试或准备性工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Preliminary events, examinations, or rounds held before the main event.","zh":"（非正式）预赛；初试；在正式活动/比赛前进行的初步环节或考试。"},"examples":[{"en":"She passed the prelims and qualified for the finals.","zh":"她通过了预赛，进入了决赛。"},{"en":"The prelims start at 9 a.m., and the main conference begins after lunch.","zh":"预备环节早上9点开始，正式会议午饭后开始。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Preliminary information, papers, or work done before the final version or main task.","zh":"（非正式）初步资料；预备文件；正式版本/主要任务前的准备工作。"},"examples":[{"en":"Send me the prelims, and I’ll review them before you submit the final draft.","zh":"把初稿/初步材料发给我，我会在你交最终稿前帮你看看。"},{"en":"We’ve done the prelims—now we can plan the budget in detail.","zh":"准备工作已经做完了——现在可以详细做预算了。"}]}],"synonyms":["preliminaries","preliminary round(s)","qualifiers","heats","early round(s)","preliminary exam(s)"],"phonetic":"/prɪˈlɪmz/","extraExplanation":["“prelims”是“preliminaries”的口语缩写，常见于英式英语以及学校、比赛、会议等场景。","在英国大学语境里，prelims也可指某些院系的阶段性/入门考试（具体含义因学校而异）。","用法提示：多用复数（the prelims），很少说单数a prelim；更正式的写法通常用preliminary round / preliminary exam / preliminaries。"]}
{"word":"prelingual","summary":{"en":"Prelingual describes something that happens or is related to the time before a person learns spoken language.","zh":"prelingual 指发生在学会口语语言之前、或与语言习得前阶段有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a person has learned to speak or use language.","zh":"发生在一个人学会说话或使用语言之前的；（尤指）语言习得前的。"},"examples":[{"en":"She became deaf in her prelingual years, before she learned to talk.","zh":"她在语言习得前的年纪就失聪了，还没学会说话。"},{"en":"Prelingual hearing loss often affects how children learn spoken language.","zh":"语言习得前的听力损失常常会影响儿童学习口语语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the period of early childhood before speech and complex language develop.","zh":"与幼儿早期、口语和复杂语言尚未发展出来的阶段有关的。"},"examples":[{"en":"The researcher studied prelingual communication, like pointing and facial expressions.","zh":"研究者研究了语言前的交流方式，比如指物和面部表情。"}]}],"synonyms":["prespeech","preverbal","before speech"],"phonetic":"/priˈlɪŋɡwəl/","extraExplanation":["常见搭配：prelingual deafness（语言习得前失聪）、prelingual hearing loss（语言习得前听力损失）、prelingual child（尚未学会说话的孩子）。","词源：pre-（“在……之前”）+ lingual（“语言的/舌的”，来自拉丁语 lingua“舌头/语言”）。在医学、听力学、语言学中很常用。","对比：postlingual 指“学会说话之后”发生的；nonverbal 指“不会/不使用言语的”（不一定与年龄阶段有关）。"]}
{"word":"prelingually","summary":{"en":"“Prelingually” means before language development/learning, often used in contexts like prelingual deafness.","zh":"“prelingually”指在语言发展/习得之前，常用于如“语言习得前失聪”等语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before a person has learned or developed language (especially spoken language).","zh":"在一个人学会或发展出语言之前（尤指口语）。"},"examples":[{"en":"She became deaf prelingually, so she learned sign language early.","zh":"她在学会语言之前就失聪了，所以很早就学习了手语。"},{"en":"Prelingually deaf children may need different support at school.","zh":"先天或幼年失聪、在习得语言之前失聪的孩子在学校可能需要不同的支持。"}]}],"synonyms":["before language acquisition","prior to language development"],"phonetic":"/ˌpriˈlɪŋɡwəli/","extraExplanation":["该词常用于医学、教育与听力学语境，最常见搭配是“prelingually deaf（语言习得前失聪）”。它强调失聪发生在建立母语（尤其口语）之前，这会影响口语/听觉语言的自然习得路径，因此在评估与支持（如助听设备、口语训练、双语双模式教育等）时常被特别指出。","词形构成：pre-（“在……之前”）+ lingual（“语言的/舌的”）+ -ly（副词）。对应的形容词形式是 prelingual（语言习得前的）。","相关对比：postlingually（语言习得后）表示在已经学会语言之后发生的情况，如“postlingual hearing loss（语言习得后听力损失）”。"]}
{"word":"prelinguistic","summary":{"en":"Prelinguistic means “before language develops or is used.”","zh":"prelinguistic 指“语言发展或使用之前的（阶段/行为）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Before a person has developed or uses language, especially in early childhood or in studies of language development.","zh":"语言出现之前的；指个体尚未发展出或使用语言的阶段（常用于婴幼儿或语言发展研究）。"},"examples":[{"en":"Babies communicate in prelinguistic ways, like crying and pointing.","zh":"婴儿会用语言前的方式交流，比如哭泣和指指点点。"},{"en":"The researcher analyzed prelinguistic vocalizations such as cooing and babbling.","zh":"研究者分析了语言前的发声，比如咕咕声和咿呀学语。"},{"en":"Prelinguistic social skills can support later language learning.","zh":"语言前的社交能力可以帮助之后的语言学习。"}]}],"synonyms":["preverbal","before-language","nonverbal (partly overlapping)"],"phonetic":"/ˌpriːlɪŋˈɡwɪstɪk/","extraExplanation":["词形拆解：pre- 表示“在……之前”，linguistic 表示“语言的/语言学的”，合起来就是“语言之前的”。","常见搭配：prelinguistic communication（语言前交流）、prelinguistic stage/period（语言前阶段）、prelinguistic vocalizations（语言前发声）。","使用场景多在心理学、语言学、教育与儿童发展领域；日常对话里相对少见。"]}
{"word":"prelinpinpin","summary":{"en":"“prelinpinpin” is not a standard English word; please provide the intended spelling or context.","zh":"“prelinpinpin”不是标准英文单词；请提供你想查的正确拼写或上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t match a recognized English word. It may be a misspelling or random typing.","zh":"这不是一个常见/可识别的英文单词，可能是拼写错误或随意输入。"},"examples":[{"en":"Did you mean “preliminary” (early/introductory) or “pin” (a small fastener)?","zh":"你是不是想写“preliminary”（初步的/预备的）或“pin”（别针/固定）？"}]}],"extraExplanation":["看起来像是把“prelim…”（常见于 preliminary / prelim）和“pin”重复混在一起的输入。你可以告诉我：\n1) 你想查的正确拼写；或\n2) 你想表达的中文意思；或\n3) 这是在哪个句子/场景里看到的。\n我就能给你准确的发音、词性、释义和例句。"]}
{"word":"preliquidate","summary":{"en":"To settle or close something (a debt, claim, or financial position) ahead of the usual time.","zh":"指在通常时间之前提前结清（债务、理赔或金融仓位）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Finance/insurance) To pay off, settle, or close an account, debt, claim, or position before it is due or before the normal final settlement date.","zh":"（金融/保险）在到期或正常结算日之前，提前清偿、结清或了结（债务、理赔、账户或仓位）。"},"examples":[{"en":"The borrower chose to preliquidate the loan to reduce interest costs.","zh":"借款人选择提前清偿贷款，以减少利息成本。"},{"en":"The company preliquidated several outstanding claims before the fiscal year ended.","zh":"公司在财年结束前提前结清了几笔未结理赔。"},{"en":"Traders may preliquidate a position to limit risk during volatile markets.","zh":"在市场波动较大时，交易者可能会提前平仓以控制风险。"}]}],"synonyms":["pay off early","settle early","close out early","liquidate early"],"phonetic":"/ˌpriːˈlɪkwɪdeɪt/","extraExplanation":["“pre-”表示“提前”，“liquidate”在金融语境中常指“清算/变现/了结（资产或仓位）”。因此 preliquidate 多用于合同、贷款、保险理赔、交易等场景，强调“比约定时间更早地完成结算/清偿”。","该词在日常口语中不常见，更常见的替代表达包括：pay off early（提前还清）、settle early（提前结算）、close out early（提前了结/平仓）。"]}
{"word":"preliquidated","summary":{"en":"“Preliquidated” means fixed in advance—most often a pre-set damages amount in a contract.","zh":"“preliquidated”指事先确定的，多用于合同中“预先约定的赔偿金额/违约金”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Set or calculated in advance (especially an amount of damages written into a contract).","zh":"预先确定的；事先计算好的（尤指合同中事先约定的赔偿金额）。"},"examples":[{"en":"The contract includes preliquidated damages if the work is finished late.","zh":"合同规定如果工程延期完工，将适用预先约定的违约金（预先确定的赔偿金额）。"},{"en":"Because the loss is hard to measure, the parties agreed on a preliquidated amount.","zh":"由于损失难以精确计算，双方同意采用一个预先确定的金额。"}]}],"synonyms":["predetermined","pre-set","pre-established","fixed in advance"],"phonetic":"/ˌpriˈlɪkwəˌdeɪtɪd/","extraExplanation":["“preliquidated”多见于法律与商业英语，常出现在“preliquidated damages（预先约定的损害赔偿/违约金）”这一搭配中，意思是把将来可能发生的损失金额提前写进合同。","相关概念是“liquidated damages（约定损害赔偿/违约金）”。加上“pre-”强调“在事件发生前就已确定”。在实际合同语境里，两者常被近似使用。","注意区分：如果合同金额被认为不合理、带有惩罚性质，可能会被称为“penalty（罚金条款）”，在一些法域可能不被支持。"]}
{"word":"preliquidating","summary":{"en":"Preliquidating means settling an estimated payment (often duties or taxes) in advance before final liquidation.","zh":"preliquidating 指在最终清算前，先行结清（多为估算的）税费或关税等款项。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of preliquidate) to calculate and settle a payment or charge in advance, especially taxes, duties, or customs fees, before the final amount is officially confirmed.","zh":"（preliquidate 的现在分词）在最终金额正式确认之前，先行计算并结清应付款项或费用，尤指税款、关税或海关费用。"},"examples":[{"en":"The broker is preliquidating the estimated duties so the shipment won’t be delayed at the port.","zh":"经纪人正在预先结清预计关税，以免货物在港口被耽搁。"},{"en":"We’re preliquidating the tax liability for this quarter to avoid a last-minute cash squeeze.","zh":"我们正在预先结清本季度的税务负担，以避免临时出现现金紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an action or process where a payment (often in trade or finance) is settled ahead of final liquidation.","zh":"（作形容词用）形容在最终清算前就先行结清款项（常见于贸易或金融语境）的做法或过程。"},"examples":[{"en":"A preliquidating payment can speed up customs clearance in some cases.","zh":"在某些情况下，预先结清的款项可以加快海关放行。"},{"en":"They used a preliquidating approach to reduce administrative back-and-forth.","zh":"他们采用预先结清的方式来减少行政往返沟通。"}]}],"synonyms":["prepaying","settling in advance","paying up front","advance payment (context-dependent)"],"phonetic":"/ˌpriˈlɪkwɪˌdeɪtɪŋ/","extraExplanation":["这个词主要出现在海关、进出口贸易和税务文件里：liquidate 在此不是“液化”，而是“结清/清算（账款、税费）”。pre- 表示“提前”，所以 preliquidate/preliquidating 强调“在最终核算前先结清（通常按估算）”。日常英语里很少用，更常见于行业术语或法规文本。"]}
{"word":"preliquidation","summary":{"en":"Preliquidation means the stage or preliminary work/estimates before a formal liquidation (closing and distributing/selling assets).","zh":"preliquidation 指正式清算（关闭并出售/分配资产）之前的阶段，以及相关的准备工作或初步估算。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period or actions that happen before a company, fund, or account is formally liquidated (closed and its assets sold or distributed).","zh":"在公司、基金或账户正式清算（关闭并出售/分配资产）之前的阶段或准备行动。"},"examples":[{"en":"During preliquidation, the firm stopped taking new orders and began selling non‑essential assets.","zh":"在预清算阶段，公司停止接新订单，并开始出售非核心资产。"},{"en":"The report covers preliquidation costs such as legal fees and auditing.","zh":"报告涵盖了预清算成本，例如律师费和审计费。"}]},{"partOfSpeech":"n.","definition":{"en":"In some legal/financial contexts, a preliminary calculation or estimate of what will be owed, paid out, or recovered before a final liquidation amount is set.","zh":"在某些法律/金融语境中，指在最终清算金额确定前，对应付/应付出/可追回金额做的初步计算或估算。"},"examples":[{"en":"The insurer provided a preliquidation estimate of the claim payment.","zh":"保险公司给出了该理赔付款的预清算估算。"},{"en":"They requested a preliquidation statement before signing the settlement.","zh":"他们在签署和解前要求提供预清算说明。"}]}],"synonyms":["pre-liquidation phase","wind-down period","run-up to liquidation","preliminary liquidation estimate"],"phonetic":"/ˌpriˌlɪkwɪˈdeɪʃən/","extraExplanation":["“preliquidation”不是日常高频词，更多见于法律、破产、基金/公司解散、保险理赔或会计文件中。实际写作里也常用更常见的表达，如“pre-liquidation phase / before liquidation / wind-down period”。","拼写上既可写作一个词“preliquidation”，也常见带连字符的“pre-liquidation”；是否连字符通常取决于机构文书风格。"]}
{"word":"preliteral","summary":{"en":"Preliteral means “before literacy” (not yet able to read/write), and less commonly “before literal interpretation.”","zh":"preliteral 指“读写之前/尚未识字的”，较少见的用法是“在字面解读之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a child or learner) not yet able to read and write; before the stage of literacy.","zh":"（指儿童或学习者）尚未具备读写能力的；识字/读写之前的。"},"examples":[{"en":"The teacher used songs and pictures with preliteral children.","zh":"老师对尚未识字的孩子使用歌曲和图片教学。"},{"en":"Preliteral skills include listening, speaking, and recognizing shapes and sounds.","zh":"读写前能力包括听、说，以及辨认形状和声音。"}]},{"partOfSpeech":"adj.","definition":{"en":"before a text is understood in a literal, word-for-word way; before literal interpretation.","zh":"在对文本进行字面理解（逐字理解）之前的；字面解读之前的。"},"examples":[{"en":"He responded at a preliteral level, focusing on feelings rather than exact words.","zh":"他的回应停留在字面解读之前的层次，更关注感受而不是逐字意思。"},{"en":"In some discussions, a preliteral reading highlights themes instead of details.","zh":"在某些讨论中，字面解读之前的阅读更强调主题而非细节。"}]}],"synonyms":["preliterate","pre-reading","illiterate (context-dependent)","preliteracy (related term)"],"phonetic":"/ˌpriːˈlɪtərəl/","extraExplanation":["“preliteral”在英语里不算非常常见，最常见于教育、心理发展与阅读教学领域，常与“preliteracy / emergent literacy（读写前/萌芽读写能力）”相关。","如果你在学术文章里看到它，通常是在描述儿童在正式识字之前需要发展的能力（如音素意识、口语表达、握笔与手眼协调、图画叙事等）。"]}
{"word":"preliterally","summary":{"en":"“Preliterally” means ‘before writing; in a pre-literate way’ (rare).","zh":"“preliterally”意为“在文字出现之前；以前文字方式”（较少使用）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before a society or person has writing; in a pre-literate way (rare; usually written as “pre-literate(ly)”).","zh":"在（某个社会或个人）尚未有文字书写之前；以“前文字/前识字”的方式（很少用，常写作 pre-literate(ly)）。"},"examples":[{"en":"The story may have existed preliterally, passed on only by spoken tradition.","zh":"这个故事可能在前文字时代就已存在，只靠口头传统流传。"},{"en":"Archaeologists try to understand how people lived preliterally, without written records.","zh":"考古学家试图理解人们在没有文字记录的前文字时代如何生活。"}]}],"synonyms":["pre-literate(ly)","before written records","orally"],"phonetic":"/ˌpriˈlɪtərəli/","extraExplanation":["“preliterally”不是常见词，在正规写作中更常用：pre-literate（前文字的/未识字的）或 in pre-literate societies（在前文字社会中）。","不要把它和“literally（字面地，确实地）”混淆：preliterally 讲的是“文字出现之前/没有文字的状态”，而 literally 讲的是“按字面意义/确实”。","如果你想表达“在文字之前的时期”，更自然的说法有：before writing existed / before written records / in the prehistoric period（更偏史前）。"]}
{"word":"preliteralness","summary":{"en":"Preliteralness usually means a stage before literacy (before a person can read/write). It can also refer to understanding something before focusing on a strictly literal, word-for-word meaning.","zh":"Preliteralness 通常指“识字/读写之前的阶段”。也可较少见地指“在严格逐字解读之前的理解方式”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being preliteral; relating to a stage before reading and writing (or before a person can understand written language).","zh":"前文字状态；指在学习读写之前的阶段（或尚不能理解文字之前的状态/特征）。"},"examples":[{"en":"In early childhood research, preliteralness can shape how children respond to picture books.","zh":"在幼儿研究中，“前文字状态”会影响孩子如何回应图画书。"},{"en":"The teacher used songs and storytelling to support preliteralness before introducing letters.","zh":"老师在教授字母之前，用歌曲和讲故事来支持孩子的前文字阶段发展。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, an approach that comes before a strictly literal interpretation (for example, focusing on mood, symbolism, or overall meaning rather than word-for-word reading).","zh":"较少见：指在严格的字面解读之前的一种理解方式（例如先关注氛围、象征或整体意义，而非逐字理解）。"},"examples":[{"en":"Some readers start with preliteralness—feeling the poem’s rhythm—before analyzing each line.","zh":"有些读者会先进行“非字面先行”的体验：先感受诗的节奏，再分析每一行。"},{"en":"In discussion, she encouraged preliteralness so the class could grasp the story’s emotional tone first.","zh":"讨论时，她鼓励先进行“非字面先行”的理解，让全班先抓住故事的情感基调。"}]}],"synonyms":["preliteracy","emergent literacy","before literacy","nonliteral reading"],"phonetic":"/ˌpriˈlɪtərəl.nəs/","extraExplanation":["这个词非常少见，多半是由 preliteral（“前文字的/非字面之前的”）+ -ness（名词后缀，表示“……的状态/性质”）临时构造出来的学术或说明性用语。日常英语里更常用的表达有：preliteracy / emergent literacy（早期读写能力）、before literacy（识字前）。","如果你想表达“不要按字面理解”，英语里更自然的说法通常是 nonliteral meaning（非字面意义）、figurative reading（比喻性解读）、not meant literally（不是字面意思）。"]}
{"word":"preliterary","summary":{"en":"Preliterary means “before written literature or writing,” and it can also describe early pre-reading stages in education.","zh":"preliterary 指“文字/书面文学出现之前的”，也可指教育中“识字前（读写启蒙早期）”阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"existing before a society developed writing and a written literary tradition","zh":"（社会/文化）在发展出文字与书面文学传统之前的；前文字/前文学的"},"examples":[{"en":"Anthropologists study preliterary cultures through oral stories, art, and tools.","zh":"人类学家通过口述故事、艺术和工具来研究前文字文化。"},{"en":"The museum has objects from a preliterary period, so there are no written records to compare.","zh":"博物馆里有前文字时期的文物，因此没有书面记录可供对照。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the earliest stage of learning to read and write (especially in young children)","zh":"（尤指儿童）与识字读写的最早阶段有关的；识字前的"},"examples":[{"en":"The teacher used preliterary activities like picture talk and rhyming games.","zh":"老师用了看图说话和押韵游戏等识字前活动。"},{"en":"Preliterary skills include understanding that stories have a beginning and an end.","zh":"识字前能力包括理解故事有开头和结尾。"}]}],"synonyms":["preliterate","nonliterate","oral","unwritten"],"phonetic":"/ˌpriˈlɪtərˌɛri/","extraExplanation":["在学术语境里，preliterary常用于人类学/历史学，强调“没有文字记录”，研究多依靠口述传统、考古遗存与物质文化。","在教育学里，它也可指儿童“识字前”阶段（如语音意识、叙事理解、对书本结构的认识）。读文献时可根据上下文判断是哪一种用法。"]}
{"word":"preliterate","summary":{"en":"Preliterate means “before or without literacy,” describing societies without writing or young children not yet able to read and write.","zh":"Preliterate 指“在识字之前/尚未具备读写能力”，可形容没有文字书写体系的社会，或尚未学会读写的幼儿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or society) not yet able to read and write; existing before widespread literacy or formal writing.","zh":"（人或社会）尚未具备读写能力的；（在文字普及或正式书写出现之前的）前文字的。"},"examples":[{"en":"The museum has an exhibit on preliterate societies and their oral traditions.","zh":"博物馆有一个关于前文字社会及其口述传统的展览。"},{"en":"In preliterate communities, history is often passed down through stories and songs.","zh":"在前文字社区里，历史常通过故事和歌谣代代相传。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a child) not yet able to read and write because they are still very young.","zh":"（儿童）尚未学会读写的（因年龄尚小）。"},"examples":[{"en":"The app is designed for preliterate children who learn through pictures and sounds.","zh":"这款应用专为尚未识字的幼儿设计，通过图片和声音学习。"},{"en":"Teachers use games to build preliterate skills like recognizing letters and sounds.","zh":"老师用游戏来培养识字前技能，比如识别字母和语音。"}]}],"synonyms":["nonliterate","oral","before writing","not yet literate"],"phonetic":"/ˌpriˈlɪtərət/","extraExplanation":["“preliterate”常用于人类学与历史语境，强调“没有（或尚未发展出）书写系统、主要依靠口述文化”的社会；它不等同于“uneducated（没受教育的）”。","谈儿童时，“preliterate”通常是中性、发展阶段性的说法，常搭配“preliterate skills（识字前技能）”，比“illiterate（文盲的）”更不带贬义。"]}
{"word":"preliterature","summary":{"en":"“Preliterature” refers to the period before written literature, when culture is passed on mainly through oral tradition.","zh":"“preliterature”指书面文学出现之前的时期，文化主要靠口述传统传播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The time or cultural stage before a society has written literature, when stories and knowledge are mainly passed on orally (through speech, songs, myths, etc.).","zh":"指一个社会尚未产生书面文学之前的时期或文化阶段；故事与知识主要通过口述（讲述、歌谣、神话等）来传承。"},"examples":[{"en":"In the preliterature period, myths were remembered and retold rather than written down.","zh":"在前文学时期，神话更多是靠记忆与复述来传承，而不是写下来。"},{"en":"Researchers study preliterature traditions to understand how early communities explained the world.","zh":"研究者会研究前文学传统，以了解早期社群如何解释世界。"}]}],"synonyms":["pre-literature","preliterate era","oral tradition (related)","before written literature"],"phonetic":"/ˌpriːˈlɪtərətʃər/","extraExplanation":["“preliterature”在现代英语里相对少见，更常见的写法是带连字符的“pre-literature”，或用更常用的词组表达：例如“preliterate society（前文字社会）”“oral tradition（口述传统）”“before written literature（书面文学出现之前）”。","语境上它常用于人类学、历史、民俗学讨论：强调“没有书写文学”并不代表“没有文化/故事”，而是以口头形式保存与传播。"]}
{"word":"prelithic","summary":{"en":"Prelithic means “before the use of stone tools,” mainly used in archaeology.","zh":"prelithic 指“石器工具出现/使用之前的”，多用于考古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaeology) existing or happening before the development or use of stone tools; before the “lithic” (stone-tool) stage.","zh":"（考古）指在石器工具出现或被使用之前的；石器时代之前的（前石器的）。"},"examples":[{"en":"Some researchers describe the earliest camps as prelithic because no stone tools have been found there.","zh":"一些研究者把最早的营地称为“前石器的”，因为在那里没有发现石器工具。"},{"en":"The book discusses possible prelithic technology made from wood or bone.","zh":"这本书讨论了可能存在的“前石器”技术，例如木器或骨器。"}]}],"synonyms":["prehistoric","pre–Stone Age","prelithic (variant: pre-lithic)"],"phonetic":"/ˌpriˈlɪθɪk/","extraExplanation":["这个词很少见，主要出现在考古/人类学的学术写作里。它由前缀 pre-（在……之前）+ lithic（石头的；石器的）构成，字面意思就是“在石器之前”。","在实际表达中，很多时候作者会用更常见的 prehistoric（史前的）或 pre–Stone Age（石器时代之前的）来替代；prelithic 更强调“还没进入石器工具阶段”这一点。"]}
{"word":"prelitigation","summary":{"en":"Prelitigation means “before a lawsuit is filed,” especially in legal preparation or negotiation.","zh":"prelitigation 指“起诉之前的（诉讼前）”，多用于法律准备、沟通与谈判等场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before a lawsuit is officially filed; related to preparing for possible legal action (for example, negotiation, investigation, or sending a demand letter).","zh":"诉讼前的；在正式起诉前进行的；与准备可能提起诉讼相关（如谈判、调查、发送律师函/催告函等）。"},"examples":[{"en":"The parties tried to resolve the dispute through prelitigation negotiation.","zh":"双方试图通过诉讼前谈判解决争议。"},{"en":"Our lawyer sent a prelitigation demand letter to request payment.","zh":"我们的律师在诉讼前发送了催款律师函。"},{"en":"Prelitigation discovery can help each side understand the key facts.","zh":"诉讼前调查/信息收集可以帮助双方了解关键事实。"}]}],"synonyms":["pre-suit","before filing","pre-action (BrE)","litigation-prep (informal)"],"phonetic":"/ˌpriˌlɪtɪˈɡeɪʃən/","extraExplanation":["“prelitigation”常见于美国法律英语与商务场景，属于较正式的用词。常见搭配有：prelitigation strategy（诉讼前策略）、prelitigation settlement（诉讼前和解）、prelitigation counsel（诉讼前法律顾问）、prelitigation investigation（诉讼前调查）。","词形上是前缀 pre-（在……之前）+ litigation（诉讼）。在写作中也可见到带连字符的形式 pre-litigation。"]}
{"word":"prelives","summary":{"en":"“Prelives” usually means “past/previous lives,” especially in reincarnation contexts; it’s not a very common standard word.","zh":"“prelives”通常指“前世/前几世”，多见于轮回转世语境；它并不是非常常见的标准用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Previous lives (especially in the context of reincarnation): lives a person is believed to have lived before the present one.","zh":"前世；前几世（多用于“轮回/转世”的语境中，指一个人在今生之前被认为经历过的生命）。"},"examples":[{"en":"In the novel, the heroine has dreams that seem to come from her prelives.","zh":"在小说里，女主角做的梦似乎来自她的前世。"},{"en":"Some people say they can remember details from their prelives.","zh":"有些人说他们能记起前世的细节。"}]},{"partOfSpeech":"v.","definition":{"en":"To live earlier than someone or something; to exist before (rare and nonstandard).","zh":"比……更早生活/存在；先于……存在（用法少见，通常不标准）。"},"examples":[{"en":"The term is rare; most writers would say “predate” instead of “prelives.”","zh":"这个说法很少见；大多数作者会用“predate（早于）”而不是“prelives”。"}]}],"synonyms":["past lives","previous lives","former incarnations","prior lives"],"phonetic":"/ˌpriːˈlaɪvz/","extraExplanation":["“prelives”在现代英语里不算常见或固定的标准词。很多时候它其实是把“previous lives / past lives（前世）”写成了一个词，常见于奇幻、灵性（spiritual）或转世题材的作品与讨论中。","更自然的表达通常是：past lives（前世）、previous lives（前几世）、former incarnations（前世化身）。如果你想表达“早于……存在”，更地道的动词是 predate（早于）。"]}
{"word":"preload","summary":{"en":"“Preload” means to load something ahead of time (especially data/content) or to apply an initial load/tension before use.","zh":"“preload”指提前加载（尤指数据/内容），也可指在使用前预先施加负载/张力（预紧/预载）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to load something in advance so it is ready to use quickly later (often used for software, web pages, or data)","zh":"（预先）加载；提前载入（常用于软件、网页或数据），以便之后更快使用"},"examples":[{"en":"The app preloads images to make scrolling smoother.","zh":"这个应用会预加载图片，让滚动更流畅。"},{"en":"We should preload the next lesson so it opens instantly.","zh":"我们应该预先加载下一课，这样就能立刻打开。"}]},{"partOfSpeech":"vt.","definition":{"en":"to place an initial load, pressure, or tension on something before it starts working (common in engineering/fitness contexts)","zh":"（在开始工作前）预先施加负载/压力/张力（常见于工程或健身语境）"},"examples":[{"en":"The bolt is preloaded to reduce vibration.","zh":"螺栓会被预紧（预加载）以减少振动。"},{"en":"Some exercises preload the muscles before the main movement.","zh":"有些训练会在主要动作前先让肌肉预先受力。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount of data or content loaded in advance; also, an initial load or tension applied to a part or system","zh":"预加载的内容/数据；（工程中）预载荷、预紧力"},"examples":[{"en":"The game’s preload finished overnight.","zh":"游戏的预加载在夜里完成了。"},{"en":"Too much preload can damage the bearing.","zh":"预载荷过大可能会损坏轴承。"}]}],"synonyms":["load in advance","prefetch","preload resources","precharge","pre-tension"],"phonetic":"/ˌpriːˈloʊd/","extraExplanation":["在互联网/前端开发里，preload 常指“提前把资源（如图片、字体、脚本）下载到浏览器”，让页面关键内容更快显示；但过度 preload 可能浪费带宽或影响真正重要资源的加载顺序。","在机械工程里，preload 常译为“预紧/预载”，比如轴承预紧力（bearing preload），目的是减少间隙、提高稳定性，但需要精确控制。"]}
{"word":"preloaded","summary":{"en":"Preloaded means “loaded in advance,” especially for devices/software; it can also describe parts that are pre-tensioned or pre-pressurized in engineering.","zh":"preloaded 表示“预先加载/预装”的，常用于设备或软件；在工程语境中也可指“预紧/预载荷”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something such as content, software, or a device) loaded in advance so it is ready to use immediately.","zh":"（指内容、软件或设备）预先加载好的；提前装入以便马上使用。"},"examples":[{"en":"The tablet comes with several preloaded apps.","zh":"这款平板电脑预装了好几个应用。"},{"en":"The webpage has preloaded images to reduce waiting time.","zh":"这个网页预加载了图片，以减少等待时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"(engineering) having a preload: a part is given an initial force or tension before it is used.","zh":"（工程）预紧的；带预载荷的：在使用前先施加初始压力或拉力。"},"examples":[{"en":"Preloaded bolts help the joint resist vibration.","zh":"预紧螺栓能帮助连接处抵抗振动。"},{"en":"The bearing is preloaded to improve stability.","zh":"轴承经过预紧以提高稳定性。"}]},{"partOfSpeech":"vt.","definition":{"en":"to load or put something into a device/system in advance.","zh":"预先加载；提前装入（到设备/系统中）。"},"examples":[{"en":"The manufacturer preloaded the operating system before shipping.","zh":"厂家在出货前就预装了操作系统。"},{"en":"We preloaded the presentation onto the classroom computer.","zh":"我们把演示文稿预先加载到教室电脑上了。"}]}],"synonyms":["preinstalled","preloaded","loaded ahead of time","pre-equipped","preconfigured"],"phonetic":"/ˌpriːˈloʊdɪd/","extraExplanation":["“preload / preloaded”在机械工程里常见：preload 指在零件正式工作前就施加的初始力（例如给螺栓“预紧”、给轴承“预压”），目的通常是减少松动、提高刚性与稳定性。"]}
{"word":"preloan","summary":{"en":"Preloan means “before a loan,” especially in banking processes like credit checks or counseling.","zh":"preloan 指“贷款前的”，多用于银行流程，如信用审查或贷款前辅导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a loan is given or taken (often used to describe checks, counseling, or procedures).","zh":"发生在贷款发放或借款之前的；用于描述贷款前的审查、辅导或流程（常见于金融语境）。"},"examples":[{"en":"The bank requires a preloan credit check before approving the mortgage.","zh":"银行在批准房贷前要求进行贷款前的信用审查。"},{"en":"Many programs offer preloan counseling to help borrowers understand the risks.","zh":"许多项目提供贷款前辅导，帮助借款人了解风险。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or stage before a loan is made (less common; usually written with a hyphen as “pre-loan”).","zh":"贷款发生前的阶段或时期（较少见；更常写作带连字符的“pre-loan”）。"},"examples":[{"en":"During the preloan stage, the lender verifies income and employment.","zh":"在贷款前阶段，放贷方会核实收入和就业情况。"}]}],"synonyms":["pre-loan","before the loan","prior-to-loan"],"phonetic":"/ˈpriːˌloʊn/","extraExplanation":["“preloan”在实际写作中更常见的形式是“pre-loan”（带连字符），尤其是在正式文件或合同里。","常见搭配：pre(-)loan application（贷款前申请/申请阶段）、pre(-)loan screening（贷款前筛查/预审）、pre(-)loan approval（贷款前批准/预批准）、pre(-)loan counseling（贷款前辅导）。"]}
{"word":"prelocalization","summary":{"en":"Prelocalization is the preparation done before localization so a product can be translated and adapted smoothly for different languages and regions.","zh":"预本地化是指在本地化之前做的准备工作，让产品能更顺利地进行翻译并适配不同语言与地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Software, business) Preparation work done before localization, such as designing text, dates, currencies, and layouts so a product can be translated and adapted easily for different languages and regions.","zh":"（软件/商业）本地化之前的准备工作，例如提前设计文本、日期/货币格式、界面布局等，让产品更容易被翻译并适配不同语言与地区。"},"examples":[{"en":"We built the UI with prelocalization in mind, so adding Arabic later won’t break the layout.","zh":"我们在设计界面时就考虑了预本地化，所以以后加入阿拉伯语也不会把布局弄乱。"},{"en":"Prelocalization includes separating text from code and supporting multiple date formats.","zh":"预本地化包括把文字从代码中分离出来，并支持多种日期格式。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific step or phase in a development workflow focused on getting a product ready for later localization.","zh":"（流程）开发工作流中的一个具体阶段：把产品“准备好”，以便后续做本地化。"},"examples":[{"en":"The project plan has a prelocalization phase before translation begins.","zh":"项目计划里在开始翻译之前安排了预本地化阶段。"}]}],"synonyms":["internationalization","localization readiness","globalization prep","translation readiness"],"phonetic":"/ˌpriːˌloʊkəlaɪˈzeɪʃən/","extraExplanation":["“prelocalization”在英语里多见于软件与产品全球化语境，常与 i18n（internationalization，国际化）和 l10n（localization，本地化）一起出现。它强调“先把结构做对”，再进入翻译与地区适配。","常见任务：把界面文字从程序代码中抽离、避免把文本写死在图片里、为不同语言预留更长/更短的文字空间、支持从右到左书写（如阿拉伯语/希伯来语）、支持不同地区的数字/日期/货币格式。","不要与“pseudo-localization（伪本地化）”混淆：伪本地化是用“假翻译”来测试界面是否能承受字符变长、特殊字符等；预本地化是更广义的提前准备。"]}
{"word":"prelocate","summary":{"en":"Prelocate means to decide or set a location in advance, and in technical contexts it can mean to pre-allocate resources.","zh":"prelocate 指“预先定位/事先确定位置”；在技术语境中也可指“预先分配资源（常写作 pre-allocate）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to locate or place something in a position in advance; to decide its location ahead of time","zh":"预先定位；事先确定（某物）的位置"},"examples":[{"en":"Engineers prelocate sensors on the bridge before construction begins.","zh":"工程师在施工开始前就预先确定桥上的传感器位置。"},{"en":"The team prelocated emergency exits on the map for quick access.","zh":"团队在地图上预先标出紧急出口，便于快速找到。"}]},{"partOfSpeech":"vt.","definition":{"en":"(computing/operations) to allocate space or resources in advance (often written as “pre-allocate”)","zh":"（计算/运维）预先分配（空间或资源，常写作 pre-allocate）"},"examples":[{"en":"The program prelocates memory to reduce delays during processing.","zh":"该程序预先分配内存，以减少处理过程中的延迟。"},{"en":"We prelocated server capacity for the holiday traffic spike.","zh":"我们为假日流量高峰预先分配了服务器容量。"}]}],"synonyms":["locate in advance","predetermine","position beforehand","pre-allocate","allocate beforehand"],"phonetic":"/ˌpriːˈloʊkeɪt/","extraExplanation":["“prelocate”在日常英语里很少见，更常见的说法是“locate in advance / decide the location beforehand”。在技术语境（尤其是计算机）中，人们更常写作“pre-allocate（预分配）”，表示提前分配内存、容量或资源。","词形拆解：pre-（在……之前）+ locate（定位/放置）。如果你写正式文档，建议根据语境改用更常见的表达，以避免读者觉得生僻。"]}
{"word":"prelocated","summary":{"en":"“Prelocated” means placed or positioned ahead of time, often for planning or quick access.","zh":"“prelocated”表示“提前放置/提前定位”，多用于规划或快速取用的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"placed or positioned in advance (before something happens or before people arrive), especially for convenience or planning.","zh":"预先放置的；预先定位的（通常指为方便或规划，在事情发生前或人员到达前先把某物放好/定好位置）。"},"examples":[{"en":"Prelocated supplies were waiting at the field office before the storm hit.","zh":"在暴风雨来临前，预先放置的物资已经在现场办公室等候。"},{"en":"The company uses prelocated parts to speed up repairs.","zh":"公司使用预先放置的零件来加快维修速度。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “prelocate”: to place or position something in advance.","zh":"“prelocate”的过去式/过去分词：预先放置；预先定位。"},"examples":[{"en":"They prelocated emergency kits at each station.","zh":"他们在每个站点预先放置了应急包。"}]}],"synonyms":["pre-positioned","preplaced","staged","positioned in advance"],"phonetic":"/ˌpriːloʊˈkeɪtɪd/","extraExplanation":["“prelocated / prelocate”在日常英语里不算常用，更常见于物流、工程、应急管理等场景。口语中人们往往会说“pre-positioned（预先部署的）”或“placed in advance（提前放好）”。","常见搭配：prelocated supplies/resources/equipment（预置物资/资源/设备）。在正式文件里也可能写作“pre-located”。"]}
{"word":"prelocating","summary":{"en":"“Prelocating” means locating or positioning something in advance.","zh":"“prelocating”指提前确定位置或预先安置。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to decide or mark the location of something in advance; to locate beforehand (often in planning, logistics, or computing).","zh":"预先确定某物的位置；提前定位（常用于规划、物流或计算机语境）。"},"examples":[{"en":"They are prelocating emergency supplies at schools before the storm season.","zh":"他们在暴风季来临前，把应急物资预先安置在各学校。"},{"en":"The app is prelocating nearby shelters to speed up search results.","zh":"这个应用在预先定位附近的避难所，以加快搜索结果。"}]}],"synonyms":["pre-position","position in advance","stage","site (in advance)","locate beforehand"],"phonetic":"/ˌpriːloʊˈkeɪtɪŋ/","extraExplanation":["“prelocating”是动词“prelocate”的现在分词/动名词形式，由前缀pre-（“预先”）+ locate（“定位/找到位置”）构成。","该词不算日常高频，更常见的替代表达有“locate in advance”“pre-position”“stage (supplies)”。在正式写作中用它通常带有“提前规划与布置资源/位置”的意味。"]}
{"word":"prelogic","summary":{"en":"Prelogic describes thinking that happens before (or without) formal, rule-based logic.","zh":"Prelogic 指发生在正式、规则化逻辑之前（或缺乏这种逻辑）的思维方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of thinking, reasoning, or a stage of development) happening before formal logical reasoning; not yet based on clear rules of logic.","zh":"（指思维、推理或发展阶段）发生在正式逻辑推理之前的；尚未建立在清晰逻辑规则上的。"},"examples":[{"en":"Young children often show prelogic thinking, focusing on one detail and ignoring others.","zh":"幼儿常表现出前逻辑式思维，只关注一个细节而忽略其他信息。"},{"en":"In the story, fear drives the hero’s prelogic decisions before he calms down and thinks clearly.","zh":"在故事里，恐惧让英雄在冷静思考前做出一些前逻辑式的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of thinking or a developmental stage that comes before formal logic.","zh":"前逻辑的思维方式；（发展中的）前逻辑阶段。"},"examples":[{"en":"The researcher described the child’s answers as prelogic rather than fully logical reasoning.","zh":"研究者把孩子的回答描述为前逻辑，而不是完全的逻辑推理。"},{"en":"Some educators design activities that guide students from prelogic to basic reasoning skills.","zh":"一些教育者设计活动，引导学生从前逻辑过渡到基础推理能力。"}]}],"synonyms":["prelogical","pre-logical","illogical (context-dependent)","nonlogical"],"phonetic":"/priːˈlɑːdʒɪk/","extraExplanation":["“prelogic”不是特别常见，更常见的拼写是“pre-logical”或“prelogical”，意思基本相同。","在人类学与哲学史中，“pre-logical mentality（前逻辑心态）”曾与法国学者列维-布留尔（Lévy-Bruhl）的讨论有关，但现代写作里使用时要注意：不要把它当成对某些文化或群体“更低级”的价值判断，更适合用来描述发展阶段（如儿童认知）或情绪主导下的推理方式。"]}
{"word":"prelogical","summary":{"en":"Prelogical means ‘before formal logic’ or ‘not guided by logical reasoning,’ often used in psychology, philosophy, or academic discussion.","zh":"prelogical 指“逻辑出现之前的/不受逻辑推理支配的”，多用于心理学、哲学或学术讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of thinking, reasoning, or a stage of development) happening before formal logic is used; not yet guided by logical rules.","zh":"（指思维、推理或发展阶段）逻辑出现之前的；尚未受形式逻辑规则支配的。"},"examples":[{"en":"Young children often show prelogical thinking, such as believing that a taller glass always has more water.","zh":"小孩常表现出前逻辑思维，比如以为更高的杯子一定装了更多的水。"},{"en":"The author describes a prelogical stage in which feelings and images guide decisions more than reasons.","zh":"作者描述了一个前逻辑阶段：做决定更多受情绪和意象影响，而不是受理由影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not based on logic; driven more by instinct, emotion, or association than by reasoning (often used in academic writing).","zh":"不以逻辑为依据的；更多由直觉、情绪或联想驱动的（常见于学术语境）。"},"examples":[{"en":"Her fear was prelogical—she couldn’t explain it, but it felt real.","zh":"她的恐惧是非逻辑的——说不清原因，但感觉很真实。"},{"en":"The debate became prelogical, with people reacting to slogans instead of evidence.","zh":"辩论变得不讲逻辑，人们对口号作出反应，而不是看证据。"}]}],"synonyms":["pre-rational","nonlogical","illogical","instinctive","intuitive"],"phonetic":"/ˌpriˈlɑdʒɪkəl/","extraExplanation":["“prelogical”相对少见，常见于哲学、人类学与发展心理学语境，强调“在形式逻辑之前”的思维方式。","在早期人类学写作中（如列维-布留尔 Lucien Lévy-Bruhl），“prelogical mentality（前逻辑心态）”曾用来讨论某些文化中的思维模式；现代学界往往更谨慎使用，避免带有价值评判。","在儿童发展研究里，它常与皮亚杰（Piaget）的“前运算阶段（preoperational stage）”相关联，但两者并非完全同义：prelogical更强调“未使用逻辑规则”，preoperational是具体的发展阶段名称。"]}
{"word":"preloral","summary":{"en":"Preloral means “in front of the lore,” a small facial region between the eye and the bill/snout, used in zoological descriptions.","zh":"preloral 指“位于眶喙区（眼与喙／吻基之间的区域）前方”，常用于动物形态学与图鉴描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, zoology) Located in front of the lore (the area between the eye and the base of the bill or snout).","zh":"（解剖／动物学）位于“喙基与眼之间的区域（lore）”之前的；喙前眶区的。"},"examples":[{"en":"The field guide notes a small preloral patch of white feathers.","zh":"野外图鉴提到眼与喙之间区域前方有一小块喙前眶区的白色羽斑。"},{"en":"In some reptiles, preloral scales differ in size from the scales around the eye.","zh":"在一些爬行动物中，喙前眶区的鳞片大小与眼周鳞片不同。"}]}],"synonyms":["anterior to the lore","frontal to the lore"],"phonetic":"/priˈlɔrəl/","extraExplanation":["“pre-”表示“在……之前／前方”， “loral”来自“lore”，指鸟类（或某些爬行动物）眼与喙（或吻端）基部之间的区域。preloral 多见于野外图鉴、形态学描述或分类学文献中，用来精确定位羽斑、鳞片或颜色分布。","相关常见搭配：loral area（眶喙区）、lores（复数，用于描述两侧）、postloral（眶喙区之后的）。"]}
{"word":"preloreal","summary":{"en":"“preloreal” is not standard English; it’s likely a typo or an informal “pre- + L’Oréal” usage meaning “before L’Oréal / before using L’Oréal products.”","zh":"“preloreal”不是标准英语；更可能是拼写错误，或非正式的“pre- + L’Oréal（欧莱雅）”，表示“在欧莱雅之前/使用欧莱雅产品之前”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/username, or an invented term. If intended as “pre- + L’Oréal,” it would mean “before L’Oréal” or “prior to using L’Oréal products” in informal/marketing context.","zh":"不是标准英语单词。可能是拼写错误、品牌/用户名或自造词。如果你想表达“pre- + L’Oréal（欧莱雅）”，在非正式/营销语境中可理解为“在欧莱雅之前”或“使用欧莱雅产品之前”。"},"examples":[{"en":"This looks like a nonstandard term—did you mean “L’Oréal” or “pre-oral”?","zh":"这看起来不像标准用词——你是想写“L’Oréal（欧莱雅）”还是“pre-oral（口服前的）”吗？"},{"en":"In a skincare diary, someone might write: “My preloreal routine was just cleanser and sunscreen.”","zh":"在护肤记录里，有人可能会写：“我用欧莱雅之前（preloreal）的护肤流程只有洁面和防晒。”}],"},{"en":"If you tell me where you saw “preloreal,” I can suggest the most likely intended word.","zh":"如果你告诉我“preloreal”出现在哪个句子/场景里，我可以帮你判断最可能想表达的词。"}]}],"synonyms":["before L’Oréal","prior to using L’Oréal","pre- (as a prefix meaning “before”)"],"phonetic":"/ˌpriːlɔːriˈæl/","extraExplanation":["英语里“pre-”是常见前缀，表示“在……之前/预先”。但“loreal”本身不是通用英语词；常见的是品牌名“L’Oréal”（欧莱雅）。因此“preloreal”更像是把前缀加到品牌名上的非正式写法。","如果你本来想写的是别的词，常见的相近拼写/读音可能包括：preoral（口服前的，医学语境）、pleural（胸膜的，医学语境）、prelateral（在侧方之前的，较少见/专业）。"]}
{"word":"preloss","summary":{"en":"Preloss (often written pre-loss) refers to the state or value of something before an accident, damage, or loss—most commonly used in insurance.","zh":"Preloss（常写作 pre-loss）指事故/损坏/损失发生之前的状态或价值，最常用于保险理赔语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Insurance/claims) existing or measured before a loss or damage happens; used to describe the condition or value of property before an accident.","zh":"（保险/理赔）指损失或损坏发生之前的；常用于描述事故发生前财产的状态或价值。"},"examples":[{"en":"The insurer paid based on the car’s pre-loss value.","zh":"保险公司按这辆车的损失前价值进行赔付。"},{"en":"We need photos showing the home’s pre-loss condition.","zh":"我们需要能显示房屋损失前状况的照片。"}]},{"partOfSpeech":"n.","definition":{"en":"The condition or value of something before it is lost or damaged (often used in insurance reports).","zh":"（常见于保险报告）损失或损坏发生之前的状态或价值。"},"examples":[{"en":"The adjuster documented the preloss in the report.","zh":"理赔员在报告中记录了损失前情况。"},{"en":"They compared the post-loss damage to the preloss state.","zh":"他们将损失后的损坏与损失前的状态进行对比。"}]}],"synonyms":["pre-loss","before-loss","prior-loss"],"phonetic":"/ˌpriːˈlɔs/","extraExplanation":["“preloss”更常见的写法是带连字符的“pre-loss”。在保险理赔语境里，它常与“value（价值）”“condition（状况）”“photos（照片）”“documentation（证明材料）”等词搭配。","常见相关表达：pre-loss value（损失前价值）、pre-loss condition（损失前状况）、actual cash value/ACV（实际现金价值，常以损失前价值为基础并考虑折旧）。"]}
{"word":"prelucent","summary":{"en":"Prelucent is a rare word meaning almost transparent—light can pass through and things behind may be seen.","zh":"Prelucent 是个很少见的词，意思是“近乎透明的”，光能透过，后面的东西可能看得见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Almost transparent; allowing light to pass through so that objects behind can be seen, though not always perfectly clearly.","zh":"（罕见）近乎透明的；能让光线穿过，使后面的物体可见（但不一定非常清晰）。"},"examples":[{"en":"A prelucent veil softened the light on her face.","zh":"一层近乎透明的面纱柔化了她脸上的光线。"},{"en":"The artist painted the water as prelucent, with stones visible beneath the surface.","zh":"画家把水画得近乎透明，水面下的石头依稀可见。"}]}],"synonyms":["translucent","semi-transparent","pellucid (literary)","clear"],"phonetic":"/priˈluːsənt/","extraExplanation":["“prelucent”在现代英语中非常少见，更常用的词是“translucent”（半透明的）或“transparent”（透明的）。在写作里用“prelucent”会带一点文学、古典或刻意精致的感觉。","词根与拉丁语“luc-（光）”有关（如 lucid, illuminate）。可把它理解为“让光穿过的”。"]}
{"word":"prelude","summary":{"en":"A prelude is an opening or introduction, especially a short piece of music or an event that leads into something bigger.","zh":"prelude 指“序幕/前奏”，可用于事情的铺垫或音乐中的“前奏/前奏曲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introduction or opening part that comes before the main event, story, or piece of music.","zh":"序幕；前奏；引子（在主要事件、故事或音乐作品之前的开头部分）。"},"examples":[{"en":"The first chapter is a prelude to the bigger conflict later in the novel.","zh":"第一章是小说后面更大冲突的序幕。"},{"en":"They played a short prelude before the ceremony began.","zh":"仪式开始前，他们演奏了一段短小的前奏。"},{"en":"A tense silence was the prelude to an argument.","zh":"紧张的沉默成了一场争吵的前兆。"}]},{"partOfSpeech":"n.","definition":{"en":"A short musical piece that introduces a longer work, or a standalone piece with an “introductory” feel (often for piano or organ).","zh":"前奏曲（引出更长作品的短音乐；也可独立成曲，常见于钢琴或管风琴）。"},"examples":[{"en":"She practiced Chopin’s preludes every morning.","zh":"她每天早上练习肖邦的前奏曲。"},{"en":"The organist played a prelude and then the choir entered.","zh":"管风琴手先弹了前奏，接着合唱团入场。"}]}],"synonyms":["introduction","opening","lead-in","foreword","prologue","overture"],"phonetic":"/ˈprɛl.jud/","extraExplanation":["“prelude”来自拉丁语前缀“pre-”（在……之前）+“ludere”（玩耍、演奏），原义与“先奏/先演”有关，所以既可指“事情发生前的铺垫”，也常用于音乐语境。","在文学里，prelude常带有“铺陈气氛、埋下伏笔”的感觉；例如莎士比亚《罗密欧与朱丽叶》开头的“Prologue（序言）”在功能上就类似prelude（为后文悲剧定调）。","相关表达：a prelude to sth（……的前奏/前兆）；prelude in C major（C大调前奏曲）；prologue更偏“文字上的开场白/序言”，overture更常指歌剧或音乐会的“序曲”。"]}
{"word":"preluded","summary":{"en":"“Preluded” is the past tense/past participle of “prelude,” meaning it introduced or foreshadowed something that came later.","zh":"“preluded”是“prelude”的过去式/过去分词，表示“作为开端/铺垫”，或“预示后续发生的事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of an event, speech, or action) to come before something and serve as an introduction or warning of what will happen next.","zh":"（事件、讲话或行动）发生在……之前，起到引子/铺垫作用；预示后续将发生的事。"},"examples":[{"en":"The small protest preluded a much larger movement.","zh":"这场小规模抗议为更大规模的运动拉开了序幕。"},{"en":"A brief silence preluded her announcement.","zh":"短暂的沉默为她的宣布做了铺垫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to introduce something by doing or saying something first; to preface.","zh":"用先做/先说的内容来引出（某事）；作为……的前言/序言。"},"examples":[{"en":"He preluded the main topic with a personal story.","zh":"他先讲了一个个人故事来引出主题。"},{"en":"The lecture was preluded by a quick review of last week’s notes.","zh":"讲座先快速回顾了上周笔记作为开场。"}]}],"synonyms":["prefaced","introduced","foreshadowed","heralded","preceded","set the stage for"],"phonetic":"/ˈprɛluːdɪd/","extraExplanation":["“prelude”最常见的名词义是“前奏/序曲”（尤其在音乐里，如巴赫的《前奏曲与赋格》）。动词用法“to prelude”在现代英语里相对更正式、书面，日常口语更常用“lead up to / set the stage for / foreshadow”。"]}
{"word":"preluder","summary":{"en":"“Preluder” is a rare noun meaning something or someone that introduces or leads into something else.","zh":"“preluder”是很少见的名词，指起到引入、铺垫作用的人或事（相当于“前奏/序幕”的承担者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that serves as an introduction or opening act; someone who “preludes” (leads into something).","zh":"前奏者；引子（事物）；起到“前奏/引入”作用的人或事。"},"examples":[{"en":"In the speech, a brief story was the preluder to the main point.","zh":"在演讲中，一个简短的故事是引出要点的前奏。"},{"en":"The warm-up band acted as a preluder to the headline performer.","zh":"暖场乐队起到了主咖登场前的前奏作用。"}]}],"synonyms":["opener","forerunner","precursor","lead-in","introduction"],"phonetic":"/ˈpriˌluːdər/","extraExplanation":["“preluder”在现代英语中非常少见，多数情况下人们会用更常见的词：名词用“prelude”（前奏、序幕），动词用“prelude (to)”（作为……的前奏/预示）。如果你想表达“前奏者/开场者”，也可以用“opener”“forerunner”“introductory act”等更自然。","拼写上也常被误写：很多人其实想查的是“prelude”。"]}
{"word":"preluders","summary":{"en":"Preluders (plural of rare “preluder”) means people/things that serve as a prelude—an introduction, warning, or forerunner; it can also mean someone who performs a musical prelude.","zh":"preluders（较少见的名词“preluder”的复数）指作为前奏/序幕的人或事（引子、警示、先兆），也可指演奏前奏曲的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that comes before something else and serves as an introduction or warning; a forerunner","zh":"（人或事物）前奏；序幕；先导；（对后事的）预示"},"examples":[{"en":"Many small policy changes were preluders to a larger reform.","zh":"许多小的政策调整成了更大改革的前奏。"},{"en":"The heated online debate was a preluder to public protests.","zh":"网络上的激烈争论是公众抗议的先兆。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who plays or performs a prelude (for example, on a piano or organ)","zh":"（音乐中）演奏前奏曲的人"},"examples":[{"en":"The organ preluder began softly before the choir entered.","zh":"风琴演奏者先轻柔地奏起前奏，随后合唱团加入。"}]}],"synonyms":["forerunner","precursor","harbinger","usher","introductory act"],"phonetic":"/prɪˈluːdər/","extraExplanation":["“preluder”在现代英语里非常少见。多数情况下人们会用更常见的词，比如：forerunner（先驱/先兆）、harbinger（预兆）、precursor（先导），或直接用“prelude”（n. 前奏/序幕；v. 作为……的前奏）。","如果你想表达“前奏/序幕（事件本身）”，更自然的复数通常是“preludes”。“preluders”更像是在说“起到前奏作用的人/事”，但在实际写作中不常用。"]}
{"word":"preludes","summary":{"en":"“Preludes” is the plural of “prelude”: an introduction or early event that leads into something, or a short opening piece of music.","zh":"“preludes”是“prelude”的复数：指（重大事件前的）序幕/前奏，也可指（音乐的）前奏曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an introduction or opening event that comes before something more important; a sign that something is about to happen","zh":"（更重要事情前的）序幕、前奏；（事情将发生的）预兆"},"examples":[{"en":"The negotiation was a prelude to a long-term partnership.","zh":"这次谈判是长期合作的序幕。"},{"en":"A series of small protests became the prelude to a larger movement.","zh":"一连串小规模抗议成了更大运动的前奏。"}]},{"partOfSpeech":"n.","definition":{"en":"a short piece of music that introduces a larger piece or sets a mood; also a standalone short piece (often for piano)","zh":"（音乐的）前奏曲；（也可独立成曲的）短小乐曲（常见于钢琴）"},"examples":[{"en":"The concert opened with a prelude by Bach.","zh":"音乐会以巴赫的一首前奏曲开场。"},{"en":"She practiced Chopin’s Preludes every evening.","zh":"她每晚练习肖邦的《前奏曲集》。"}]},{"partOfSpeech":"v.","definition":{"en":"to serve as an introduction to; to come before and lead into something","zh":"作为……的序幕；为……作铺垫；先于……发生并引出……"},"examples":[{"en":"Rising prices may prelude a change in policy.","zh":"物价上涨可能预示政策将发生变化。"},{"en":"A brief speech preluded the award ceremony.","zh":"一段简短致辞为颁奖典礼作了开场铺垫。"}]}],"synonyms":["introduction","opening","foreword","prologue","lead-in","overture"],"phonetic":"/ˈprɛlud/","extraExplanation":["“preludes”是名词复数，单数是“prelude”。在文学和新闻写作中，prelude常用来表示“某事的序幕/预兆”，语气比“beginning”更正式。","音乐里“Prelude（前奏曲）”常与“Fugue（赋格）”“Nocturne（夜曲）”等并列出现；例如巴赫的《平均律钢琴曲集》里有大量“Prelude and Fugue（前奏与赋格）”，肖邦也写过著名的《24首前奏曲》。"]}
{"word":"preludial","summary":{"en":"Preludial means “introductory” or “like a prelude,” often used in literary or musical contexts.","zh":"preludial 意为“序幕的/前奏的”，指作为引子、铺垫或类似前奏的内容，常见于文学或音乐语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as an introduction; coming before something more important (like a prelude).","zh":"序幕的；前奏的；作为引子、在重要事情之前发生的。"},"examples":[{"en":"The meeting began with some preludial small talk.","zh":"会议以一些作为铺垫的寒暄开场。"},{"en":"A brief preludial chapter sets the scene for the novel.","zh":"一个简短的序章为小说铺陈背景。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a musical prelude (an introductory musical piece).","zh":"（音乐）与前奏曲有关的；前奏性的。"},"examples":[{"en":"The pianist played a preludial passage to introduce the main theme.","zh":"钢琴家用一段前奏性的乐句引出主旋律。"},{"en":"Preludial effects in the orchestra created a sense of expectation.","zh":"管弦乐中前奏性的效果营造出期待感。"}]}],"synonyms":["introductory","preliminary","prefatory","proemial","opening"],"phonetic":"/prɪˈluːdiəl/","extraExplanation":["“preludial”来自“prelude（前奏/序幕）+ -ial（……的）”。在现代英语里它相对少见，更常见的表达是“preliminary（初步的）”“introductory（介绍性的）”或“prefatory（序言的）”。","用法提示：在写作或评论（尤其是音乐评论、文学评论）中，“preludial”带有一点正式、文学化的味道；日常对话里通常用“introductory/early/preliminary”更自然。"]}
{"word":"preluding","summary":{"en":"“Preluding” means happening beforehand as an introduction or sign of what will follow; in music, it means playing a prelude.","zh":"“preluding”指在某事之前发生、作为引子或预兆；在音乐中指演奏前奏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of prelude) happening before something else and serving as an introduction or warning of what is coming.","zh":"（prelude 的现在分词）在某事之前发生，作为引子、前奏或预示接下来会发生什么。"},"examples":[{"en":"The protests were preluding a major political change.","zh":"这些抗议正在为一次重大的政治变化拉开序幕。"},{"en":"A quiet conversation in the hallway was preluding the announcement.","zh":"走廊里一段安静的谈话预示着公告即将发布。"}]},{"partOfSpeech":"v.","definition":{"en":"(music) playing or performing an introduction (a prelude) before the main piece.","zh":"（音乐）在主曲之前演奏前奏（prelude）。"},"examples":[{"en":"She sat at the piano, preluding softly before the song began.","zh":"她坐在钢琴前，在歌曲开始前轻轻弹奏前奏。"},{"en":"The orchestra was preluding to the overture.","zh":"乐团在序曲之前演奏前奏。"}]}],"synonyms":["foreshadowing","leading up to","heralding","portending","setting the stage (for)"],"phonetic":"/prɪˈluːdɪŋ/","extraExplanation":["“preluding”常见于较正式或文学性的语境，日常表达里更常用“leading up to”“setting the stage for”“foreshadowing”。","常见搭配是“prelude to + 名词”：例如“events preluding a crisis”≈“events that were a prelude to a crisis”（危机的前兆/导火索）。","词源上“prelude”来自拉丁语前缀“pre-（在前）”+“ludere（玩/演奏）”，因此既可指“音乐前奏”，也可比喻“事情的前兆”。"]}
{"word":"preludio","summary":{"en":"Preludio means a musical prelude or, figuratively, an opening that leads to something bigger (often used in Spanish/Italian contexts).","zh":"Preludio 指“前奏/前奏曲”，也可比喻为某事的“开端/前兆”（常见于西语/意语语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) A short introductory piece, especially in Spanish or Italian contexts; similar to a “prelude.”","zh":"（音乐）短小的引子/前奏曲；多见于西班牙语或意大利语语境，类似英语的 prelude（前奏）"},"examples":[{"en":"The guitarist opened the concert with a preludio before the main suite.","zh":"吉他手在主要组曲前先演奏了一段 preludio 作为开场。"},{"en":"In the score, the preludio leads into the first movement.","zh":"在乐谱中，这段 preludio 引出第一乐章。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) An introduction or early sign that something larger will follow.","zh":"（比喻）前奏、开端；预示后面会发生更重要的事情"},"examples":[{"en":"The heated exchange was a preludio to a long negotiation.","zh":"这场激烈的交锋只是漫长谈判的 preludio（前奏）。"},{"en":"Small policy changes can be a preludio to broader reform.","zh":"一些小的政策调整可能是更大改革的 preludio（前奏）。"}]}],"synonyms":["prelude","introduction","opening","overture","prologue"],"phonetic":"/prɪˈluːdioʊ/","extraExplanation":["“Preludio”主要是西班牙语/意大利语词（意为“前奏”）。在英语文章里通常出现在音乐评论、曲目名称、或引用原语的语境中；日常英语更常用“prelude”。","如果你是在乐曲标题里看到它（如“Preludio”），往往就是作曲家或出版方保留的原语名称，不一定需要翻译。"]}
{"word":"preludious","summary":{"en":"“Preludious” is a rare/nonstandard adjective meaning “like a prelude; introductory; leading into something.”","zh":"“preludious”是很罕见/不标准的形容词，意思是“像前奏一样；引子般的；引出后续的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Serving as a prelude; introductory; happening before and leading into something else.","zh":"（罕见/非标准用法）作为序曲的；引子般的；发生在前并引出后续事情的。"},"examples":[{"en":"The small disagreement was preludious to a much bigger argument later.","zh":"那次小小的分歧成了后来更大争吵的前奏。"},{"en":"In some older writings, a brief scene may feel preludious, preparing the reader for the main event.","zh":"在一些较旧的写作中，短短一幕可能带有“序曲”感，为主要事件做铺垫。"}]}],"synonyms":["preludial","introductory","preliminary","foreshadowing","prefatory"],"phonetic":"/prɪˈluːdiəs/","extraExplanation":["“preludious”在现代标准英语里几乎不用，很多时候是拼写或造词。更常见、自然的表达是：preludial（与序曲有关的/引导性的）、preliminary（初步的）、introductory（介绍性的）、foreshadowing（预示的）或 a prelude to …（……的前奏）。","词根提示：prelude（序曲/前奏）来自拉丁语 prae-（在前）+ ludere（玩/演奏）。如果你想表达“为后面铺垫/引出”，用 a prelude to 或 foreshadow 往往更地道。"]}
{"word":"preludiously","summary":{"en":"“Preludiously” means “in a way that serves as a prelude; introductively.”","zh":"“preludiously”表示“作为前奏/铺垫地；引入性地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an introductory way; as a prelude to something that follows.","zh":"以引子/序曲的方式；作为后续事情的前奏（铺垫）。"},"examples":[{"en":"The speaker began preludiously, offering a brief story before the main message.","zh":"演讲者先做了个铺垫，讲了一个小故事，然后才进入主题。"},{"en":"A few quiet chords sounded preludiously, preparing the audience for the song.","zh":"几段轻柔的和弦像序曲一样响起，为歌曲做准备。"}]}],"synonyms":["introductively","preliminarily","by way of introduction","as a prelude"],"phonetic":"/prɪˈluːdiəsli/","extraExplanation":["“preludiously”非常少见，带有较强的书面语/古雅色彩。日常英语里更常用：“as a prelude (to) … / as an introduction / preliminarily / by way of introduction”。","词源上来自“prelude（序曲；前奏；开场）”，因此常用于音乐、演讲、文章结构等语境，表示“先铺垫一下”。"]}
{"word":"preludium","summary":{"en":"“Preludium” is a rare English word meaning “prelude,” especially a musical prelude or (figuratively) an introduction to something bigger.","zh":"“preludium”在英语中较少见，意思相当于“prelude（前奏/序幕）”，常指音乐前奏曲，也可比喻为重大事件的铺垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music, fairly rare in modern English) A prelude; a short piece of music that introduces or leads into something larger, or a standalone piece called “Prelude.”","zh":"（音乐用语，现代英语中较少见）前奏曲；引出更大型作品的短乐段，或题名为“Prelude（前奏曲）”的独立作品。"},"examples":[{"en":"The organist opened the service with a quiet preludium.","zh":"风琴师用一段安静的前奏曲开启了礼拜。"},{"en":"On the program, the preludium comes before the fugue.","zh":"在节目单上，前奏曲排在赋格之前。"},{"en":"He practiced the Bach preludium slowly to improve his touch.","zh":"他慢慢练习巴赫的前奏曲来改善触键。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) An event or period that serves as an introduction to something more important; a prelude.","zh":"（比喻）为更重要的事情作铺垫的事件或阶段；序幕。"},"examples":[{"en":"The small debate was only a preludium to the larger conflict.","zh":"那场小争论只是更大冲突的序幕。"},{"en":"Her first short film was a preludium to a successful career.","zh":"她的第一部短片是成功职业生涯的序曲。"}]}],"synonyms":["prelude","introduction","overture","opening","prologue"],"phonetic":"/prɪˈluːdiəm/","extraExplanation":["“preludium”源自拉丁语 *praeludium*（意为“在……之前演奏”）。在英语里它比常见的“prelude”更少用，更多出现在古典音乐/教会音乐语境，或受德语、波兰语等欧洲语言影响的写法。","文学或标题中若看到“Preludium”，通常带有“开场、引子、序章”的艺术感，类似一些作品会用“Prelude/Preludes”来命名开篇章节或组曲。"]}
{"word":"preludize","summary":{"en":"A rare verb meaning “to act as a prelude; to prepare for what follows.”","zh":"一个较少见的动词，意思是“作为序幕/前奏；为后续事件铺垫”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to serve as an introduction or lead-in to something; to come before and prepare for something. Example: “Small protests preludized the larger movement.”","zh":"作为……的序幕/前奏；在……之前发生并为其铺垫。例： “一些小规模抗议为更大的运动拉开序幕（preludized）。”"},"examples":[{"en":"A short poem preludized the novel’s main themes.","zh":"一首短诗为小说的主题作了铺垫。"},{"en":"These early talks preludized a formal agreement.","zh":"这些早期会谈为正式协议做了前期铺垫。"}]}],"synonyms":["prelude","foreshadow","pave the way (for)","set the stage (for)","herald"],"phonetic":"/prɪˈluːdaɪz/","extraExplanation":["“preludize”是由“prelude（前奏/序幕）+ -ize（使成为……）”构成的动词，但在现代英语中非常少见，很多母语者也不常用。写作或考试中更自然的表达通常是：用“prelude”作动词（The talks preluded the agreement.），或用更常见的动词如“foreshadow / pave the way for / set the stage for”。","在文学或正式文体里，你更常见到“prelude”作名词（a prelude to…）或动词（to prelude something）。而“preludize”带有一种“刻意造词/古风”的感觉。"]}
{"word":"prelumbar","summary":{"en":"Prelumbar means “in front of/before the lower back (lumbar) region,” used mainly in medical anatomy.","zh":"prelumbar 指“腰部（下背部）前方/腰前的”，主要用于医学解剖语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in front of or occurring before the lumbar region (the lower back).","zh":"位于腰部（下背部）前方的；发生在腰部之前的。"},"examples":[{"en":"The surgeon identified a prelumbar nerve pathway during the procedure.","zh":"外科医生在手术中识别出一条腰前（prelumbar）的神经通路。"},{"en":"Pain in the prelumbar area can sometimes be related to abdominal organs rather than the spine.","zh":"腰前区域的疼痛有时与腹部器官有关，而不一定是脊柱问题。"}]}],"synonyms":["anterior lumbar","ventral lumbar (less common)"],"phonetic":"/ˌpriːˈlʌm.bɚ/","extraExplanation":["“pre-”表示“在……之前/在……前方”，“lumbar”指“腰部（下背部）”。因此 prelumbar 多见于医学解剖或影像学语境，用来描述相对位置（位于腰椎或腰部结构的前方）。","常见的相关解剖表达还有：lumbar region（腰部区域）、anterior to the lumbar vertebrae（在腰椎前方）、retroperitoneal（腹膜后，常与腰部前方结构相关）。"]}
{"word":"prelunch","summary":{"en":"Prelunch means ‘before lunch,’ describing something that happens or is done earlier in the day.","zh":"prelunch意为“午餐前”，用于描述在午饭之前发生或进行的事情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before lunch.","zh":"午餐前发生的；午餐前进行的。"},"examples":[{"en":"I had a prelunch meeting with my manager.","zh":"我在午餐前和经理开了个会。"},{"en":"She likes a prelunch walk to clear her mind.","zh":"她喜欢在午餐前散步，让头脑更清醒。"}]},{"partOfSpeech":"adv.","definition":{"en":"Before lunch (used to describe when something happens).","zh":"在午餐之前（用于说明时间）。"},"examples":[{"en":"Let’s meet prelunch, around 11:30.","zh":"我们午餐前见面吧，大概11:30左右。"},{"en":"I usually feel most productive prelunch.","zh":"我通常在午餐前效率最高。"}]}],"synonyms":["before lunch","pre-lunch","midmorning"],"phonetic":"/priˈlʌntʃ/","extraExplanation":["“prelunch”在日常英语里不算特别常见，更常见的写法是“pre-lunch”（带连字符）或直接说“before lunch”。在工作邮件、日程安排、餐饮活动描述里会更常见。"]}
{"word":"prelusion","summary":{"en":"Prelusion means a prelude—an introductory part or lead-in to something that follows; it is rare in modern English.","zh":"prelusion 指“序幕/前奏/引子”，相当于 prelude，但在现代英语中较为罕见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an introduction or preliminary part that comes before the main event; a prelude","zh":"序幕；前奏；正题之前的引子"},"examples":[{"en":"The opening scene felt like a prelusion to the conflict that followed.","zh":"开场那一幕像是后续冲突的序幕。"},{"en":"In music history, some short keyboard pieces were written as a prelusion to a larger work.","zh":"在音乐史中，有些短小的键盘乐曲被写作大型作品的前奏。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of beginning or introducing something (rare usage)","zh":"（罕用）开始或引入某事的行为"},"examples":[{"en":"His quiet questions were a prelusion to a serious discussion.","zh":"他轻声的提问是严肃讨论的开端。"}]}],"synonyms":["prelude","introduction","opening","lead-in","prologue"],"phonetic":"/prɪˈluːʒən/","extraExplanation":["“prelusion”在现代英语中非常少见，更常用的是“prelude”。写作时如果想表达“序幕/前奏”，一般用“prelude”更自然。","词源上与拉丁语“prae-（在前）+ ludere（玩耍/演奏）”有关，因此常带有“在正式内容前的引入、铺垫”的意味，尤其常见于音乐与文学语境。"]}
{"word":"prelusive","summary":{"en":"“Prelusive” means introductory or serving as a prelude, especially in formal writing.","zh":"“prelusive”指“引入性的、作为前奏/序幕的”，多见于较正式的书面语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Serving as a prelude; introductory; coming before something more important.","zh":"（罕见）作为序曲/前奏的；引入性的；在更重要的事情之前出现的。"},"examples":[{"en":"The professor gave a prelusive overview of the course before the first lecture.","zh":"教授在第一堂课前给出了课程的引导性概览。"},{"en":"A brief, prelusive scene sets the mood for the main story.","zh":"一个简短的前奏场景为主线故事定下氛围。"}]}],"synonyms":["introductory","preliminary","prefatory","proemial","prelude-like"],"phonetic":"/prɪˈluːsɪv/","extraExplanation":["词源上与 prelude（前奏、序幕）同源：pre-（在前）+（与“玩/演奏”相关的词根）→ 引申为“在正题前的铺垫”。","prelusive 很少用于日常口语；写作中更常用 introductory / preliminary / prefatory / prelude-like。"]}
{"word":"prelusively","summary":{"en":"“Prelusively” means “as a prelude; in an introductory or preparatory way.”","zh":"“prelusively” 表示“作为序曲/引子地；以介绍或铺垫的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that serves as a prelude or introduction; by way of preparation for what comes next.","zh":"以序曲/开端的方式；作为引子或铺垫地，为接下来的内容作准备。"},"examples":[{"en":"The speaker began, prelusively, with a short story to set the mood.","zh":"演讲者先用一个短故事作为铺垫，营造气氛。"},{"en":"A brief overview was offered prelusively before the detailed discussion.","zh":"在深入讨论之前，先给出了一个简要概览作为引入。"}]}],"synonyms":["introductorily","preliminarily","as a prelude","by way of introduction"],"phonetic":"/prɪˈluːsɪvli/","extraExplanation":["“prelusively” 来自较少见的形容词 “prelusive”（意为“作为序曲的/引入的”），与 “prelude”（序曲；前奏；开端）同源。现代英语里更常用的表达是 “as a prelude,” “by way of introduction,” “to begin with,” 或 “as a preliminary step”。","由于较罕见，“prelusively” 多见于较正式或文学化的语境；在日常写作中用更常见的替换说法通常更自然。"]}
{"word":"prelusorily","summary":{"en":"“Prelusorily” means “as a preliminary introduction; as a prelude.” It is rare and formal.","zh":"“prelusorily”表示“作为预备性介绍/作为序幕或铺垫地”，用法正式且少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a preliminary or introductory way; as something that comes before the main event or action.","zh":"以预备性的、引导性的方式；作为正式事情之前的铺垫。"},"examples":[{"en":"The speaker talked prelusorily about the theme before presenting the main argument.","zh":"演讲者先以预告性的方式谈了主题，然后才提出主要论点。"},{"en":"A short video played prelusorily to set the mood for the ceremony.","zh":"一段短片作为开场铺垫播放，为典礼营造氛围。"}]}],"synonyms":["preliminarily","introductory","as a prelude","by way of introduction","in advance"],"phonetic":"/priˈluːsərɪli/","extraExplanation":["这个词非常少见，写作中更常用的替代表达是 “preliminarily / by way of introduction / as a prelude”。","词源上与 “prelude（前奏、序幕）”同源，来自拉丁语词根，含义核心是“在前面先玩/先演”→“作为开场或铺垫”。"]}
{"word":"prelusory","summary":{"en":"Prelusory means introductory or preliminary—meant to prepare for what comes next.","zh":"prelusory 表示“引入性的、预备性的”，用于为后续内容做铺垫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Introductory; serving as a preparation for something that will follow.","zh":"序言的；预备性的；作为后续内容的引子。"},"examples":[{"en":"The prelusory remarks were short, but they explained the purpose of the meeting.","zh":"这些开场性的简短发言说明了会议的目的。"},{"en":"She gave a prelusory overview before diving into the main argument.","zh":"她在进入主要论点之前先做了一个引导性的概述。"}]}],"synonyms":["introductory","preliminary","opening","prefatory","proemial"],"phonetic":"/priˈluːsəri/","extraExplanation":["“prelusory”较为少见，常见替代词包括“preliminary / introductory / opening”。","词源上与“prelude（前奏、序幕）”相关：前面的“pre-”表示“在……之前”，整体含义就是“起到铺垫、引入作用的”。在文学或正式写作里偶尔会见到。"]}
{"word":"preluxurious","summary":{"en":"Preluxurious describes something that is not yet luxurious—an earlier stage before it becomes luxury-level.","zh":"preluxurious 形容“尚未奢华”的阶段，即在变得豪华/奢华之前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or existing before something becomes luxurious; not yet luxurious, but on the way toward luxury.","zh":"（较少见）指在某事物变得“奢华/豪华”之前的阶段；尚未奢华，但正朝奢华发展。"},"examples":[{"en":"The hotel’s preluxurious design was simple, but the service felt carefully planned.","zh":"这家酒店在变得豪华之前的设计很朴素，但服务显得经过精心规划。"},{"en":"They marketed the area as preluxurious—quiet now, with upscale development coming soon.","zh":"他们把这一带宣传为“尚未豪华但即将升级”的地区——现在安静，之后会有高端开发。"}]}],"synonyms":["not yet luxurious","pre-luxury","before it became luxurious","up-and-coming (in luxury context)"],"phonetic":"ˌpriːlʌɡˈʒʊriəs","extraExplanation":["“pre-”是英语常见前缀，意思是“在……之前/预先”。“preluxurious”不是高频词，更常见的写法是加连字符的“pre-luxurious”，或用更自然的表达：not yet luxurious / before it became luxurious / on the way to luxury。","这种词在房地产、品牌营销或评论中偶尔出现，用来强调“目前还不算奢华，但有升级/高端化趋势”。使用时注意语境，避免让读者觉得生造词。"]}
{"word":"preluxuriously","summary":{"en":"“Preluxuriously” is a rare/nonstandard adverb meaning “before becoming luxurious,” and it’s often better to rephrase or use “luxuriously” if that was intended.","zh":"“preluxuriously”很罕见/不标准，大意是“在变得奢华之前”；正式语境中通常建议改写，或直接用“luxuriously（奢华地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare / nonstandard) In a way that comes before becoming luxurious; in an earlier, not-yet-luxurious stage.","zh":"（罕见/非标准）以“在变得奢华之前”的方式；处于更早、尚未奢华的阶段。"},"examples":[{"en":"The hotel started preluxuriously, with simple rooms, before it was renovated into a five-star resort.","zh":"这家酒店最初还算“preluxuriously”（尚未奢华），房间很简单，后来翻新成了五星度假村。"},{"en":"They described the neighborhood’s preluxuriously quiet past, before expensive boutiques moved in.","zh":"他们描述了这个街区在高价精品店进驻之前那段“preluxuriously”（尚未奢华的）宁静过往。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Likely intended) Luxuriously; in a very comfortable, rich, or expensive way.","zh":"（更可能是想表达）luxuriously：以非常舒适、富丽或昂贵的方式；奢华地。"},"examples":[{"en":"They lived luxuriously near the beach.","zh":"他们在海边过着奢华的生活。"},{"en":"The room was luxuriously furnished with soft carpets and warm lighting.","zh":"房间布置得很奢华，有柔软的地毯和温暖的灯光。"}]}],"synonyms":["(rare sense) before it became luxurious","in earlier, simpler days","previously","(intended sense) luxuriously","opulently","lavishly"],"phonetic":"/ˌpriː lʌɡˈʒʊriəsli/","extraExplanation":["“preluxuriously”在现代英语里几乎不作为固定词条出现，更像是把前缀 pre-（“在……之前”）临时加到 luxuriously 上的创造性写法。正式写作中通常建议改为更自然的表达：\n- before it became luxurious（在变得奢华之前）\n- in its earlier, simpler days（在早期更朴素的时候）\n- previously / once（先前/曾经）+ luxuriously（若要表达“曾经奢华地”）"]}
{"word":"preluxuriousness","summary":{"en":"A rare, coined noun meaning the simpler state or time before something becomes luxurious.","zh":"一个较少见的临时造词名词，指事物变得奢华之前较朴素的状态或时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) The state or period before something becomes luxurious; an earlier, simpler stage before luxury is added or achieved.","zh":"（罕见／非标准用法）指某事物变得奢华之前的状态或时期；在加入或达到奢华之前的较早、较朴素阶段。"},"examples":[{"en":"The hotel’s preluxuriousness is clear in old photos—plain rooms and basic furniture.","zh":"从老照片里能看出这家酒店的“前奢华阶段”——房间朴素、家具简单。"},{"en":"She wrote about the city’s preluxuriousness, when life felt more modest and practical.","zh":"她写到这座城市的“奢华之前”，那时生活更朴实、更讲求实用。"}]}],"synonyms":["simplicity","plainness","austere beginnings","pre-luxury stage"],"phonetic":"/ˌpriːlʌɡˈʒʊriəsnəs/","extraExplanation":["这个词多半是把前缀 pre-（“在……之前”）接到 luxuriousness（“奢华、豪华的程度/性质”）上临时造出来的名词，并不是常见词。写作中若想更自然，通常会改成：the earlier, simpler period（较早更朴素的时期）、before it became luxurious（在它变得奢华之前）、pre-luxury stage（前奢华阶段）、austere beginnings（朴素的开端）。","构词提示：pre- + luxurious + -ness。英语里 -ness 常把形容词变成名词（如 kindness, darkness）。但 luxuriousness 本身已较长，前面再加 pre- 会显得笨重，所以不常用。"]}

