{"word":"prem","summary":{"en":"“Prem” is an informal short form most commonly meaning a premature baby; it can also mean “premier” (chiefly British) or “premium.”","zh":"“prem”是非正式缩略词，最常指“早产儿”；也可指“premier（主要英式：政府首脑）”或“premium（高级/高价选项）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) a premature baby; a baby born before the expected time.","zh":"（非正式）早产儿；未到预产期出生的婴儿。"},"examples":[{"en":"Her son was a prem, so he stayed in the NICU for several weeks.","zh":"她儿子是早产儿，所以在新生儿重症监护室待了好几个星期。"},{"en":"The nurses showed the parents how to care for their prem at home.","zh":"护士教父母如何在家照顾早产儿。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly British) short for “premier,” meaning the leader of a government (similar to a prime minister).","zh":"（非正式，主要英式）“premier”的缩写，指政府首脑（类似首相/总理）。"},"examples":[{"en":"The prem spoke to the press after the meeting.","zh":"会议结束后，政府首脑对媒体发表了讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) short for “premium,” meaning a higher-priced or higher-quality option.","zh":"（非正式）“premium”的缩写，指更高价/更高品质的版本或服务。"},"examples":[{"en":"I upgraded to the prem plan for more storage.","zh":"我升级到高级套餐来获得更多存储空间。"}]}],"synonyms":["preemie","premature baby","premature infant","premier","premium"],"phonetic":"/prɛm/","extraExplanation":["“prem”作“早产儿”在医院或育儿语境里更常见，属于口语缩略，用于较随意的交流；正式写法通常用“premature baby/infant”。","作“premier”的缩略更偏英联邦新闻或口语场景；在美式英语里更常用“governor/premier/prime minister”等完整说法。","作“premium”的缩略常见于广告、订阅服务或软件套餐介绍中，但正式写作里一般仍写“premium”。"]}
{"word":"premachine","summary":{"en":"Premachine is a rare word meaning “before machines were widely used,” often referring to the pre-industrial/pre-mechanized era.","zh":"Premachine 是个较少见的词，意思是“机器广泛使用之前的（时代/事物）”，常指工业化或机械化之前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Existing, happening, or made before machines were used widely; relating to a time before mechanization.","zh":"（罕见）指在机器被广泛使用之前存在、发生或制作的；与“机械化之前的时代”有关的。"},"examples":[{"en":"The museum displays premachine tools used by farmers and carpenters.","zh":"博物馆展出了农民和木匠在机械化之前使用的工具。"},{"en":"She studies premachine weaving techniques from local villages.","zh":"她研究当地村落的机械化之前的传统织布技法。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The period of time before widespread use of machines; the pre-industrial or pre-mechanized era.","zh":"（罕见）指机器尚未被广泛使用的时期；即工业化/机械化之前的时代。"},"examples":[{"en":"In the premachine, most work was done by hand or with simple tools.","zh":"在机械化之前的时代，大多数工作靠手工或简单工具完成。"}]}],"synonyms":["pre-industrial","pre-mechanized","pre-mechanisation","handcrafted","non-mechanized"],"phonetic":"/ˌpriːməˈʃiːn/","extraExplanation":["“premachine”并不是现代英语里的常用词，更常见的表达是“pre-industrial”（工业化前的）或“pre-mechanized / pre-mechanisation”（机械化前的）。","构词上它由前缀“pre-”（在……之前）+“machine”（机器）组成，读者通常能从字面理解含义，但在正式写作中建议用更常见的替代表达。"]}
{"word":"premade","summary":{"en":"Premade means “already made/prepared in advance,” especially for food or items you buy ready-to-use.","zh":"Premade 指“事先做好的/预先准备好的”，常用于现成食品或可直接使用的物品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made in advance; already prepared before you need it","zh":"预先做好的；事先准备好的"},"examples":[{"en":"We bought a premade salad at the grocery store.","zh":"我们在超市买了一份预先做好的沙拉。"},{"en":"Using premade dough saves time when making pizza.","zh":"做披萨时用预先做好的面团很省时间。"},{"en":"Some premade meals have a lot of salt, so check the label.","zh":"有些预制餐盐分很高，所以要看看标签。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make (something) in advance; to prepare beforehand","zh":"预先制作（某物）；提前准备"},"examples":[{"en":"You can premade the sauce and keep it in the fridge.","zh":"你可以提前把酱汁做好，放在冰箱里。"},{"en":"They premade the name tags before the event started.","zh":"活动开始前他们就把名牌提前做好了。"}]}],"synonyms":["pre-made","ready-made","preprepared","prepared in advance"],"phonetic":"/ˌpriːˈmeɪd/","extraExplanation":["在日常英语里，premade 最常见是形容词（premade meal / premade salad / premade dough）。动词用法相对少见，很多场合更自然的说法是 make ahead / prepare in advance。","在食品语境中，premade 常带有“方便但不一定新鲜或更健康”的暗示；是否好坏取决于具体产品与个人需求。"]}
{"word":"premadness","summary":{"en":"Premadness is a rare term meaning the period or signs before someone becomes mad; it’s often written as “pre-madness.”","zh":"premadness 是个较罕见的说法，指“发疯/精神崩溃之前的阶段或征兆”，常见写法为 pre-madness。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonce word) The state or period before someone becomes mad; a time leading up to mental breakdown or extreme irrationality.","zh":"（罕见/临时造词）“发疯之前”的状态或阶段；走向精神崩溃或极端不理性的前期。"},"examples":[{"en":"In the novel, the narrator describes his sleepless weeks as a kind of premadness.","zh":"在小说里，叙述者把自己连续失眠的几周形容为一种“发疯前期”。"},{"en":"She kept a journal to track the anxiety and confusion that felt like premadness.","zh":"她写日记来记录那种像“发疯前兆”一样的焦虑与混乱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often written with a hyphen) Related to or occurring before madness; serving as a warning sign of a coming breakdown.","zh":"（常写作带连字符的形式）与“发疯之前”有关的；发生在精神崩溃之前、起到预警作用的。"},"examples":[{"en":"He shows pre-madness symptoms: paranoia, insomnia, and sudden anger.","zh":"他出现了“崩溃前期”的症状：偏执、失眠、突然发怒。"},{"en":"The film uses pre-madness scenes to build tension.","zh":"电影用“发疯前的”片段来营造紧张感。"}]}],"synonyms":["lead-up (to a breakdown)","early warning signs","prelude to madness","descent into madness (related phrase)"],"phonetic":"/ˌpriːˈmædnəs/","extraExplanation":["“premadness”不是常见标准词，更常见的写法是带连字符的“pre-madness”，或者直接用更自然的表达：\"before madness\" / \"the lead-up to a breakdown\" / \"early signs of a breakdown\"。","在文学与影评语境里，这类临时造词常用来制造一种“不可避免地滑向崩溃”的气氛；日常英语更倾向用“prelude to madness（发疯的前奏）/ descent into madness（逐渐陷入疯狂）”。"]}
{"word":"premaintain","summary":{"en":"“Premaintain” is an uncommon verb meaning to do maintenance in advance (preventive upkeep).","zh":"“premaintain”是不常见的动词，意思是提前做维护（预防性保养）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) To maintain something in advance; to do preventive upkeep so problems don’t happen later.","zh":"（不常用）提前维护；做预防性保养，以避免之后出问题。"},"examples":[{"en":"We premaintain the servers every month to reduce downtime.","zh":"我们每个月都会提前维护服务器，以减少宕机时间。"},{"en":"The team premaintained the equipment before the busy season.","zh":"团队在旺季前对设备做了预防性维护。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, informal) To keep something in a stable/working condition before it is officially put into service.","zh":"（很少见，非正式）在正式投入使用前就保持/维持其良好状态。"},"examples":[{"en":"The lab premaintains new instruments so they’re ready for students.","zh":"实验室会提前维护新仪器，确保学生随时可用。"}]}],"synonyms":["perform preventive maintenance","do preventative maintenance","maintain in advance","service proactively"],"phonetic":"/ˌpriːmeɪnˈteɪn/","extraExplanation":["“premaintain”不是常见标准词，更多时候会写成带连字符的“pre-maintain”，或直接用更自然的表达：\n- “perform preventive maintenance” / “do preventative maintenance”（做预防性维护）\n- “maintain in advance”（提前维护）\n在正式写作或工作邮件里，建议优先用这些更常见的说法。"]}
{"word":"premaintenance","summary":{"en":"Premaintenance means maintenance-related checks or preparation done before a main task or before maintenance starts.","zh":"premaintenance 指在主要任务或正式维护开始之前进行的维护相关检查与准备工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Maintenance or preparatory work done before a main operation, repair, shutdown, or inspection to prevent problems and make later maintenance easier.","zh":"在主要操作、维修、停机或检查之前进行的维护或准备性工作，用于预防问题并让后续维护更顺利。"},"examples":[{"en":"The crew completed premaintenance checks before the machine was shut down.","zh":"设备停机前，工作人员完成了预维护检查。"},{"en":"Good premaintenance reduces the risk of delays during the planned repair.","zh":"良好的预维护能降低计划维修时出现延误的风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"(As a modifier) happening or done before maintenance work begins.","zh":"（作修饰语）在维护工作开始之前发生或进行的。"},"examples":[{"en":"Please follow the premaintenance safety steps.","zh":"请遵循维护前的安全步骤。"},{"en":"They held a premaintenance briefing to review hazards.","zh":"他们在维护前开了简报会来复盘风险。"}]}],"synonyms":["pre-maintenance","pre-service checks","pre-operation checks","preventive maintenance (related)","preliminary maintenance"],"phonetic":"/ˌpriːˈmeɪntənəns/","extraExplanation":["“premaintenance”在日常英语里不算常见，更常见的说法是“preventive maintenance（预防性维护）”或“pre-maintenance（维护前/预维护）”。在工程、制造、航空等场景里，有些团队会把它当作内部术语使用。","前缀“pre-”表示“在……之前”。因此该词的核心意思就是“maintenance（维护）之前的准备/检查/处理”。"]}
{"word":"premake","summary":{"en":"“Premake” means to make something in advance; it can also refer to the Premake software tool that generates build/project files.","zh":"“premake”指“提前制作/预先准备”；也可指用于生成构建/工程文件的 Premake 软件工具。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make or prepare something in advance (before it is needed)","zh":"预先制作；提前准备（在需要之前先做好）"},"examples":[{"en":"They premake the dough in the morning so they can bake quickly at lunch.","zh":"他们早上就把面团预先做好，这样午餐时间就能快速烘焙。"},{"en":"Some restaurants premake sauces to save time during busy hours.","zh":"有些餐厅会提前把酱汁做好，以便在高峰时段节省时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) a software tool used to generate project/build files for different platforms","zh":"（专有名词）Premake：用于为不同平台生成工程/构建文件的软件工具"},"examples":[{"en":"Our team uses Premake to generate Visual Studio and Makefile projects from one script.","zh":"我们团队用 Premake 通过一份脚本生成 Visual Studio 和 Makefile 工程文件。"},{"en":"Premake helps keep the build setup consistent across Windows, macOS, and Linux.","zh":"Premake 有助于让 Windows、macOS 和 Linux 的构建配置保持一致。"}]}],"synonyms":["make in advance","prepare ahead of time","preprepare"],"phonetic":"/priːˈmeɪk/","extraExplanation":["在日常英语里，premake 作为动词并不算特别常见，更常见的说法是 “make in advance / prepare ahead of time”。但在烹饪、工厂生产或工作流程语境中，premake 仍然能被理解。","作为软件工具名的 Premake（常写作 Premake5）在程序开发圈更常见：它用脚本描述工程配置，再生成各平台需要的工程文件。"]}
{"word":"premaker","summary":{"en":"“Premaker” is a rare, nonstandard word meaning someone or something that makes or prepares things in advance.","zh":"“premaker”是罕见且不太标准的词，意思是“提前制作/准备的人或事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A person or thing that makes, prepares, or produces something in advance; a “pre-maker.”","zh":"（罕见/非标准用法）指提前制作、准备或预先生产某物的人或事物；相当于“预先制作者/预制者”。"},"examples":[{"en":"In the workshop, a premaker prepares the parts before final assembly.","zh":"在车间里，预制人员会在最终装配前先把零件准备好。"},{"en":"The team hired a premaker to create templates ahead of the busy season.","zh":"团队雇了一个人提前做模板，以应对旺季。"}]}],"synonyms":["preparer","producer","maker","fabricator"],"phonetic":"/ˈpriːˌmeɪkər/","extraExplanation":["“premaker”在现代英语中非常少见，通常不算标准词汇；更自然的表达常用“someone who prepares/makes … in advance”“preparer”“producer”。","如果你想表达“调解者/促成和解的人”，常见词是“peacemaker”。如果你想表达“电影/节目预告片制作人”，可以用“trailer editor”或“promo producer”。建议你告诉我上下文句子，我可以帮你确认你真正想找的词。"]}
{"word":"premaking","summary":{"en":"Premaking means making or preparing something in advance; it can also describe things that are prepared ahead of time.","zh":"Premaking 指“提前制作/提前准备”；也可形容“预先制作好的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making or preparing something in advance (before it is needed); the process of “premake.”","zh":"预先制作；提前准备（在需要之前先做好）的行为或过程。"},"examples":[{"en":"Premaking the sauce saves time on busy weeknights.","zh":"提前把酱汁做好，可以在忙碌的工作日晚餐时省时间。"},{"en":"In the factory, premaking parts helps the final assembly go faster.","zh":"在工厂里，预先制作零件能让最终装配更快。"}]},{"partOfSpeech":"adj.","definition":{"en":"made or prepared in advance (premade).","zh":"预先制作的；提前准备好的。"},"examples":[{"en":"They used premaking steps to reduce mistakes during installation.","zh":"他们用预先制作的步骤来减少安装时的错误。"},{"en":"Some shops sell premaking kits for beginners.","zh":"有些店会卖给新手用的预制/提前准备套件。"}]}],"synonyms":["making ahead","advance preparation","preassembly","premade preparation"],"phonetic":"/ˌpriːˈmeɪkɪŋ/","extraExplanation":["“premaking”来自动词“premake”（pre- + make），意思是“提前做”。日常英语里更常见的是形容词“premade”（例如：premade meals / premade dough）。","在制造业、施工、餐饮备料等语境中，“premaking”常用来强调“先做一部分/先把组件做好”，以便后续流程更快、更稳定。","拼写上有时也会看到“pre-making”（加连字符），尤其在较正式或技术性的写作中，用来突出前缀pre-的含义。"]}
{"word":"premalignant","summary":{"en":"Premalignant means ‘not cancer yet, but it could develop into cancer.’","zh":"premalignant 指“尚未是癌症，但有可能发展为癌症的癌前状态”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a condition, tissue, or cells) showing changes that may become cancer if not treated or monitored.","zh":"（指病变、组织或细胞）癌前的；有可能发展为癌症的（若不治疗或不监测）。"},"examples":[{"en":"The biopsy showed premalignant changes, so the doctor recommended close follow-up.","zh":"活检显示癌前改变，所以医生建议密切随访。"},{"en":"Removing the premalignant polyp can reduce the risk of colon cancer.","zh":"切除癌前息肉可以降低结肠癌风险。"}]}],"synonyms":["precancerous","pre-cancerous"],"phonetic":"/ˌpriˌməˈlɪɡnənt/","extraExplanation":["词源与构词：pre- 表示“在……之前”，malignant 表示“恶性的（癌性的）”。合在一起，premalignant 强调“尚未恶性，但有发展为恶性的风险”。","使用场景：这是医学/病理学用语，多用于检查结果与风险评估（如“premalignant lesion/changes/cells/polyp”）。日常对话中更常说“precancerous（癌前的）”。","学习提示：premalignant 描述的是“风险与倾向”，不等于“已经是癌症”。医生通常会根据部位、程度与个人风险因素来决定监测、切除或治疗。"]}
{"word":"preman","summary":{"en":"Preman is an Indonesian word meaning a gangster or thug (sometimes used in English when talking about Indonesia).","zh":"Preman 是印尼语，指“流氓/黑帮打手”（英语中多在谈论印尼时使用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian) A gangster, street thug, or hired muscle; someone who intimidates others or runs illegal protection/racketeering, often outside formal law enforcement.\nExamples: EN: “The shop owner paid a preman for ‘security.’” / ZH: “店主付钱给一个 preman 买‘保护’。”\nEN: “He was threatened by local preman.” / ZH: “他被当地的 preman 威胁了。”","zh":"（印尼语借词）流氓、黑帮打手、地痞；常指以恐吓、收保护费、非法“看场”等方式牟利、游走在法律边缘的人。\n例：EN: “The shop owner paid a preman for ‘security.’” / ZH: “店主付钱给一个 preman 买‘保护’。”\nEN: “He was threatened by local preman.” / ZH: “他被当地的 preman 威胁了。”"},"examples":[{"en":"The shop owner paid a preman for “security.”","zh":"店主付钱给一个 preman 买“保护”。"},{"en":"He was threatened by local preman.","zh":"他被当地的 preman 威胁了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing behavior that is thuggish or gangster-like.\nExamples: EN: “preman tactics” / ZH: “流氓手段”","zh":"（较少见）形容“像流氓/黑帮一样的”、带有地痞式威胁或欺压的。\n例：EN: “preman tactics” / ZH: “流氓手段”"},"examples":[{"en":"The group used preman tactics to scare vendors.","zh":"那伙人用流氓手段恐吓摊贩。"}]}],"synonyms":["thug","gangster","hoodlum","goon","hired muscle"],"phonetic":"/ˈprɛmɑn/","extraExplanation":["“Preman”主要是印尼语词，在英语里通常出现在谈论印度尼西亚社会、政治或新闻语境时（并不是常见的日常英语词）。","在印尼语境里，它往往带有强烈负面色彩：指地头蛇、收保护费者、黑帮打手等。有时也特指“非正式的暴力/胁迫力量”，与正式警察或军队相对。","常见于纪录片与报道中，例如关于印尼黑帮与政治的讨论里（如纪录片《The Act of Killing》里会听到相关用法）。使用时要注意语境，避免随意给个人或群体贴标签。"]}
{"word":"premandibular","summary":{"en":"Premandibular means “in front of the lower jaw” (or “before the mandible develops”), used mainly in anatomy and dentistry.","zh":"Premandibular 指“位于下颌骨前方的”（或“在下颌发育/出现之前的”），主要用于解剖与牙科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Dentistry) Located in front of the mandible (lower jaw) or occurring before the mandible develops or appears.","zh":"（解剖/牙科）位于下颌骨（下颌）前方的；或指在下颌出现/发育之前发生的。"},"examples":[{"en":"The scan showed a small mass in the premandibular region.","zh":"扫描显示下颌前区有一个小肿块。"},{"en":"In some animals, premandibular structures help support the mouth area.","zh":"在一些动物中，下颌前结构有助于支撑口部区域。"}]}],"synonyms":["anterior to the mandible","pre-mandibular (hyphenated variant)"],"phonetic":"/ˌpriˌmænˈdɪbjələr/","extraExplanation":["词形拆解：pre- 表示“在……之前/在……前方”，mandibular 与 mandible（下颌骨）相关，因此 premandibular 多用于医学、解剖学或兽医学语境。","该词属于专业用语，日常英语中很少使用；更常见的相关表达包括 mandibular（下颌的）、submandibular（下颌下的）、premaxillary（上颌前部/前上颌的，偏动物解剖）。"]}
{"word":"premanhood","summary":{"en":"Premanhood means the period before manhood—boyhood or early youth.","zh":"premanhood 指成年（男子）之前的时期，即少年或早年。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The stage of life before becoming a man; boyhood or early youth (often used in older or formal writing).","zh":"成为成年男子之前的人生阶段；少年时期、早年（多见于较旧或较正式的写法）。"},"examples":[{"en":"In his premanhood, he worked on his family’s farm and dreamed of traveling.","zh":"在他未成年之前，他在家里的农场干活，并梦想去旅行。"},{"en":"The novel follows the hero from premanhood to adulthood.","zh":"这部小说描写主人公从少年时期走向成年。"}]}],"synonyms":["boyhood","youth","adolescence","early years"],"phonetic":"/ˌpriˈmænˌhʊd/","extraExplanation":["“premanhood”较少见，更常见的写法是“pre-manhood”（带连字符），意思是“manhood（成年男子/成年）之前的阶段”。在现代英语里，人们更常用“boyhood”“childhood”“adolescence/teenage years”来表达类似概念。"]}
{"word":"premaniacal","summary":{"en":"Premaniacal means “before or showing early signs of mania,” and it’s a rare, mostly clinical term.","zh":"premaniacal 指“躁狂前的/出现躁狂早期迹象的”，较罕用，多用于临床语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing early signs of mania; occurring before a manic episode (rare, mainly medical/clinical use).","zh":"（罕用，多见于医学/临床语境）躁狂前的；出现躁狂早期迹象的；发生在躁狂发作之前的。"},"examples":[{"en":"The clinician noted premaniacal symptoms such as reduced sleep and unusually high energy.","zh":"临床医生记录到一些躁狂前症状，比如睡眠减少和异常亢奋。"},{"en":"Family members said his talkativeness felt premaniacal compared with his usual mood.","zh":"家人说，他那阵子话特别多，和他平时的状态比起来像是躁狂前的表现。"}]}],"synonyms":["pre-maniacal","prodromal (mania-related)","early-manic"],"phonetic":"/ˌpriːməˈnaɪəkəl/","extraExplanation":["这个词非常少见，常见的写法是加连字符的“pre-maniacal”，意思是“在躁狂（maniacal/manic）之前/早期”。在日常英语里更常用“early signs of mania（躁狂的早期迹象）”或“prodromal manic symptoms（躁狂前驱症状）”。","构词：pre-（在……之前）+ maniacal（躁狂的/狂躁的）。其中“manic”在医学上指“躁狂”，而口语里有时被随意用来表示“很疯狂/很忙乱”，但在描述心理健康时最好用更准确、尊重的表达。"]}
{"word":"premanifest","summary":{"en":"Premanifest means ‘before something becomes obvious or clearly expressed,’ often used in academic/medical contexts.","zh":"Premanifest 指“在某事变得明显或清楚表现出来之前的”，多用于学术/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) existing or happening before something becomes clear, visible, or fully developed.","zh":"（少见，正式）在某事变得清楚、可见或充分发展之前就已存在或发生的；先于显现的。"},"examples":[{"en":"In some theories, anxiety is a premanifest sign of deeper conflict.","zh":"在一些理论中，焦虑被认为是更深层冲突的先显迹象。"},{"en":"Researchers looked for premanifest indicators of the disease in families at risk.","zh":"研究人员在高风险家庭中寻找该疾病的先显指标。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) to show or indicate something in advance; to appear before full expression.","zh":"（少见）提前显示或预示；在完全显现之前出现。"},"examples":[{"en":"Certain symptoms may premanifest before the illness is diagnosed.","zh":"某些症状可能在疾病确诊前就提前显现。"}]}],"synonyms":["latent","early","incipient","preclinical","subclinical","prodromal"],"phonetic":"/ˌpriːˈmænəˌfɛst/","extraExplanation":["“premanifest”由前缀“pre-（在……之前）”+“manifest（显现的；明显的）”构成，常见于学术或医学语境（如“premanifest stage/phase”指“尚未明显发病/表现出来的阶段”）。在日常英语中更常用“early/initial/latent”或“before it becomes apparent”来表达类似意思。"]}
{"word":"premanifestation","summary":{"en":"Premanifestation means the period or state before something becomes clearly visible or expressed, often used in academic or medical contexts.","zh":"Premanifestation 指某事物在明显呈现/表现出来之前的阶段或状态，常见于学术或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The stage or condition before something becomes visible, clear, or fully expressed (before it “manifests”).","zh":"在某事物变得可见、明确或完全呈现之前的阶段或状态（“显现”之前）。"},"examples":[{"en":"Early fatigue can be a premanifestation of a more serious illness.","zh":"早期疲劳可能是更严重疾病的前期征兆。"},{"en":"In the novel, the character’s uneasy dreams feel like a premanifestation of the disaster to come.","zh":"在小说中，人物不安的梦像是即将到来灾难的前期预兆。"}]},{"partOfSpeech":"n.","definition":{"en":"In some academic or medical contexts: the period before a disease or condition shows clear clinical signs (often used like “premanifest” + a condition name).","zh":"在某些学术或医学语境中：疾病或状况尚未出现明确临床表现之前的时期（常与某疾病名称搭配，如“premanifest Huntington’s disease”）。"},"examples":[{"en":"Researchers studied people in the premanifestation phase to understand early brain changes.","zh":"研究人员研究了处于前显现阶段的人群，以了解早期的大脑变化。"},{"en":"Support services can be helpful during premanifestation, even before symptoms are obvious.","zh":"在前显现期，即使症状尚不明显，支持服务也可能有帮助。"}]}],"synonyms":["early stage","prodrome","preclinical phase","warning sign","precursor"],"phonetic":"/ˌpriˌmænəfəˈsteɪʃən/","extraExplanation":["“premanifestation”并不是日常英语里很常见的词，更常见的表达是 “before manifestation / prior to manifestation”，或在医学论文中用形容词 “premanifest”（如 “premanifest symptoms / premanifest stage”）。","构词上：pre-（在……之前）+ manifestation（显现、表现）。因此它通常强调“尚未显现，但可能正在形成/发展”的状态，语气比单纯的 “early sign” 更偏向学术或专业写法。"]}
{"word":"premankind","summary":{"en":"Premankind means “before humans existed,” and it’s a rare, mostly literary/science‑fiction adjective.","zh":"premankind 表示“在人类存在之前的”，是较少见、偏文学/科幻用作形容词的词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Existing, happening, or relating to the time before humans (mankind) existed.","zh":"（罕见）指人类出现之前的；发生在“人类（mankind）”存在之前的；与史前人类出现之前时期有关的。"},"examples":[{"en":"Some sci‑fi stories describe a premankind Earth ruled by ancient creatures.","zh":"一些科幻作品会描写一个由远古生物统治的“人类出现之前的地球”。"},{"en":"The author imagines premankind civilizations, long before any humans lived.","zh":"作者想象了“人类出现之前”的文明，发生在任何人类存在之前很久。"}]}],"synonyms":["prehuman","before humans","prehuman era","primeval"],"phonetic":"/ˌpriːˈmænkaɪnd/","extraExplanation":["“premankind”由前缀 pre-（在……之前）+ mankind（人类）构成，属于不常见的自造/文学用词，常见于科幻、奇幻、架空历史或带有神话色彩的写作中。","在学术或新闻语境里，更自然的表达通常是 “prehuman” / “before humans” / “prehistoric (times)”（注意 prehistoric 更常指“有文字记录之前”，不一定等于“人类出现之前”）。"]}
{"word":"premanufacture","summary":{"en":"Premanufacture means to make something in advance, usually in a factory for later assembly or use.","zh":"premanufacture 指把某物提前制造好，常在工厂预制，之后再组装或使用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to manufacture (something) in advance, often in a standard form so it can be assembled or used later","zh":"预先制造（某物）；提前按标准化形式生产，以便之后组装或使用"},"examples":[{"en":"The company premanufactures wall panels in a factory and assembles them on site.","zh":"这家公司在工厂里预先制造墙板，然后在现场组装。"},{"en":"Premanufactured parts can reduce construction time and labor costs.","zh":"预先制造的零件可以缩短施工时间并降低人工成本。"}]}],"synonyms":["prefabricate","preproduce","pre-make","mass-produce"],"phonetic":"/ˌpriːˌmæn.jəˈfæk.tʃɚ/","extraExplanation":["“pre-”表示“在……之前”，加在manufacture（制造）前面，就变成“提前制造/预制”。在建筑、装配式住宅、工业生产中更常见，实际使用里也常见同义表达：prefabricate / pre-make / preproduce。"]}
{"word":"premanufactured","summary":{"en":"Premanufactured means made in a factory ahead of time, before being delivered for use or assembly.","zh":"premanufactured 指“预先在工厂制造好”，再运到使用地点安装或组装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made in advance in a factory (not built or produced at the final site); manufactured beforehand.","zh":"预先在工厂制造好的（不是在最终使用/施工现场制作的）；预制的。"},"examples":[{"en":"The builder used premanufactured wall panels to finish the house faster.","zh":"建造商使用预制墙板，让房子更快完工。"},{"en":"Premanufactured parts can reduce waste and improve quality control.","zh":"预制部件可以减少浪费，并改善质量控制。"}]}],"synonyms":["prefabricated","prebuilt","factory-made","ready-made"],"phonetic":"/ˌpriˌmæn.jəˈfæk.tʃɚd/","extraExplanation":["“premanufactured”常用于建筑、工程、家具与零部件供应等语境，强调“先在工厂做好，再运到现场安装/组装”。","它与“prefabricated”非常接近；在很多场合两者可互换，但“prefabricated”更常见、更地道（尤其在建筑领域常说 prefab）。","词形结构：pre-（在……之前）+ manufactured（制造的）。在写作中也常见作定语：premanufactured components/panels/modules。"]}
{"word":"premanufacturer","summary":{"en":"A rare noun meaning a person/company that works on preparation before manufacturing; in US chemical regulation, a company that submits a premanufacture notice (PMN).","zh":"较少见的名词：指制造前期的准备方；在美国化学品监管语境中也可指提交生产前通知（PMN）的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company involved in preparation before full manufacturing begins (for example: designing, testing, sourcing materials, or setting up production).","zh":"在正式制造开始之前参与准备工作的人或公司（例如：设计、测试、采购材料或建立生产流程）。"},"examples":[{"en":"The premanufacturer created prototypes and tested the materials before mass production.","zh":"该前期制造方在量产前制作了样品并测试材料。"},{"en":"We hired a premanufacturer to set up the assembly line and quality checks.","zh":"我们聘请了前期制造方来建立装配线和质量检查流程。"}]},{"partOfSpeech":"n.","definition":{"en":"(US environmental regulation, less common) A company that plans to manufacture or import a new chemical substance and submits a premanufacture notice (PMN) before doing so.","zh":"（美国环境法规中，较少见）计划制造或进口一种新化学物质，并在进行前提交“生产前通知”（PMN）的公司/单位。"},"examples":[{"en":"The premanufacturer filed a PMN with the EPA before importing the new chemical.","zh":"该生产前申报方在进口这种新化学品之前向美国环保署提交了PMN。"},{"en":"Premanufacturers must keep documentation about the substance’s safety data.","zh":"生产前申报方必须保存该物质的安全数据文件。"}]}],"synonyms":["pre-production contractor","prototype maker","pre-production company","PMN submitter"],"phonetic":"/ˌpriːˌmæn.jəˈfæk.tʃɚ.ɚ/","extraExplanation":["“premanufacturer”不是日常常用词，更常见的表达是“pre-production company（前期制作/生产公司）”“prototype maker（样品/原型制作方）”或直接说“supplier/contractor（供应商/承包商）”。","在化学品合规语境中，它与“Premanufacture Notice (PMN)”密切相关：这是美国《有毒物质控制法》(TSCA) 下在制造或进口某些新化学物质前需要提交的申报。具体义务会随法规和物质类别而变化。"]}
{"word":"premanufacturing","summary":{"en":"Premanufacturing refers to the time and work done before actual production starts.","zh":"Premanufacturing 指正式生产开始前的阶段与相关准备工作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening before the actual manufacturing process; relating to planning, design, testing, or preparation done before production begins","zh":"发生在正式制造之前的；与生产开始前的规划、设计、测试或准备工作有关的"},"examples":[{"en":"Premanufacturing tests help engineers find problems before mass production.","zh":"生产前测试能帮助工程师在大规模生产前发现问题。"},{"en":"The team spent weeks on premanufacturing planning to reduce waste on the factory line.","zh":"团队花了数周做生产前规划，以减少产线浪费。"}]},{"partOfSpeech":"n.","definition":{"en":"the stage or activities that occur before manufacturing, such as design, prototyping, sourcing, and process setup","zh":"制造前阶段/活动（如设计、打样、采购准备与工艺/产线设置等）"},"examples":[{"en":"Most delays happened during premanufacturing, not on the assembly line.","zh":"多数延误发生在制造前阶段，而不是装配线上。"},{"en":"They hired a specialist to manage premanufacturing for the new product.","zh":"他们聘请了专家来管理新产品的制造前工作。"}]}],"synonyms":["pre-production","preparatory","upstream (manufacturing)","planning-stage"],"phonetic":"/ˌpriˌmænjuˈfæktʃərɪŋ/","extraExplanation":["“premanufacturing”常见于供应链、工程与成本核算语境，尤其在“premanufacturing stage / premanufacturing costs / premanufacturing activities”等搭配中，强调“在工厂正式开工生产之前”的一整套准备工作。","写作中也常用带连字符的形式“pre-manufacturing”，两者含义相同；是否加连字符多取决于公司风格指南或出版规范。"]}
{"word":"premarital","summary":{"en":"Premarital means “before marriage.”","zh":"premarital 意为“婚前的；在结婚之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before marriage, especially relating to sex, counseling, or agreements between a couple.","zh":"婚前的；（尤指）与婚前性行为、婚前辅导或婚前协议等有关的。"},"examples":[{"en":"Some schools offer premarital counseling to help couples communicate better.","zh":"一些学校/机构提供婚前辅导，帮助伴侣更好地沟通。"},{"en":"The clinic provides premarital health screenings.","zh":"这家诊所提供婚前健康检查。"},{"en":"They discussed a premarital agreement (a prenup) before the wedding.","zh":"他们在婚礼前讨论了婚前协议（婚前财产协议）。"}]}],"synonyms":["before marriage","prenuptial (more formal, especially about agreements)","pre-wedding (general)"],"phonetic":"/ˌpriːˈmɛrɪtəl/","extraExplanation":["在不同文化与宗教语境中，“premarital sex（婚前性行为）”是一个可能较敏感的话题；在写作或交流时可以根据场合选择更中性的表达，如“before marriage”或强调健康与法律层面的“premarital counseling / screening / agreement”。","“premarital”由前缀“pre-（在……之前）+ marital（婚姻的）”构成；在较正式的语境中更常用。日常口语也常说“before marriage”。"]}
{"word":"premarketing","summary":{"en":"Premarketing means promoting and researching something before its official launch.","zh":"Premarketing 指在正式发布前进行的推广与调研等预营销活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Marketing activities done before a product, service, or event is officially launched, to build awareness and interest.","zh":"在产品、服务或活动正式推出之前进行的营销活动，用来提高知名度并激发兴趣。"},"examples":[{"en":"The company started premarketing six months before the app launch.","zh":"公司在应用上线前六个月就开始做预营销。"},{"en":"Premarketing surveys helped them understand what customers wanted.","zh":"预营销调查帮助他们了解顾客想要什么。"}]}],"synonyms":["prelaunch marketing","launch prep","teaser campaign (related)","market seeding (related)"],"phonetic":"/ˌpriːˈmɑːrkɪtɪŋ/","extraExplanation":["“Premarketing”常见于商业与市场营销语境，尤其是新品发布（product launch）前的阶段。常见做法包括：市场调研（market research）、预热宣传（teaser campaign）、建立等待名单（waitlist）、媒体试用/测评（press preview）、试点测试（beta test）。","写法上也常见作“pre-marketing”（加连字符）或“pre marketing”（分开写），但作为一个名词合写“premarketing”也很常见。与“prelaunch marketing（上线前营销）”含义接近。"]}
{"word":"premarriage","summary":{"en":"Premarriage means “before marriage,” most often used to describe counseling, classes, or checkups done before a wedding.","zh":"Premarriage 表示“婚前的”，多用于描述婚前辅导、课程或体检等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually as an adjective) happening or done before marriage.","zh":"（通常作形容词）婚前的；结婚之前进行的。"},"examples":[{"en":"They took a premarriage counseling course to talk about money and family expectations.","zh":"他们参加了婚前辅导课程，讨论金钱和家庭期待。"},{"en":"Some clinics offer premarriage health checkups.","zh":"一些诊所提供婚前体检。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, as a noun) the period of time before marriage.","zh":"（较少见，作名词）婚前时期。"},"examples":[{"en":"During premarriage, they tried living in the same city to see if daily life worked well.","zh":"在婚前时期，他们尝试在同一城市生活，看看日常相处是否顺利。"}]}],"synonyms":["pre-marriage","premarital","before marriage"],"phonetic":"/ˌpriːˈmærɪdʒ/","extraExplanation":["“premarriage”更常见的写法是 **pre-marriage** 或 **premarital**。在较正式或学术语境里，**premarital**（如 premarital sex/relationship）更常用；在日常搭配里，**pre-marriage counseling**（婚前辅导）也很常见。"]}
{"word":"premarried","summary":{"en":"Premarried means “before marriage,” but it’s uncommon; premarital is more standard.","zh":"premarried 表示“婚前的”，但较少见；更常用、更标准的是 premarital。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or existing before a person gets married; before marriage.","zh":"（罕见用法）发生在结婚之前的；婚前的。"},"examples":[{"en":"They attended a premarried counseling session.","zh":"他们参加了一次婚前辅导。"},{"en":"Some cultures have premarried rituals for engaged couples.","zh":"一些文化里，订婚情侣会有婚前仪式。"}]}],"synonyms":["premarital","before marriage"],"phonetic":"/ˌpriːˈmærid/","extraExplanation":["“premarried”在现代英语里比较少见，常见、更标准的表达是 **premarital**（婚前的），例如 *premarital counseling*（婚前辅导）、*premarital sex*（婚前性行为）。\n\n词形上：**pre-**（在……之前）+ **married**（已婚的）。不过因为“married”本身强调“已婚状态”，搭配“pre-”会显得不够地道，所以英语更倾向用“premarital”（marital=婚姻的）。\n\n写作或正式场合建议用 **premarital**；日常口语里也可用 **before marriage** 来表达。"]}
{"word":"premarry","summary":{"en":"“Premarry” is uncommon; it refers to things happening or done before marriage. In everyday English, “premarital” or “before marriage” is more natural.","zh":"“premarry”较少见，表示“婚前的/在结婚之前”。日常表达更常用“premarital”或“before marriage（在婚前）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"To do something before getting married; to happen before marriage.","zh":"婚前的；在结婚之前进行（或发生）的。"},"examples":[{"en":"Some couples choose to do premarital counseling to communicate better.","zh":"有些伴侣会选择做婚前辅导，以便更好地沟通。"},{"en":"The contract covers premarriage property as well as shared assets after the wedding.","zh":"这份合同涵盖婚前财产以及婚后共同资产。"}]}],"synonyms":["premarital","pre-marriage","before marriage","prior to marriage"],"phonetic":"/ˌpriːˈmærɪdʒ/","extraExplanation":["“premarry”本身在现代英语中不太常见，更常见的是前缀 pre- 加在相关词上：\n- premarital（adj.）婚前的（最常用，如 premarital counseling 婚前辅导）\n- premarriage（adj./n. 作定语或名词）婚前（如 premarriage agreement 婚前协议）\n- pre-marriage（adj.）也可用连字符写法\n如果你想表达“婚前做某事”，通常说 before getting married / prior to marriage 更自然。"]}
{"word":"premarrying","summary":{"en":"“Premarrying” means “before marriage,” but it’s uncommon; “premarital” is more standard.","zh":"“premarrying”指“婚前的/结婚前的”，但不常用；更标准常见的是“premarital”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or relating to the time before someone gets married; before marriage (less common than “premarital”).","zh":"发生在结婚之前的；与婚前阶段有关的（不如“premarital”常用）。"},"examples":[{"en":"They attended a premarrying class at their church.","zh":"他们在教会参加了一个婚前课程。"},{"en":"Some couples choose premarrying counseling to talk about money and family expectations.","zh":"有些伴侣会选择婚前咨询，讨论金钱和家庭期望。"},{"en":"The study looked at premarrying relationships and later marital satisfaction.","zh":"这项研究考察了婚前关系与后来的婚姻满意度。"}]}],"synonyms":["premarital","before marriage","prenuptial (more formal/legal)"],"phonetic":"/priˈmɛriɪŋ/","extraExplanation":["“premarrying”在现代英语里不太常见，更自然、更常用的说法是“premarital”（婚前的）或“before marriage”（结婚前）。在正式写作（新闻、学术、法律、医疗）中通常用“premarital”。","如果你看到“premarrying”作名词短语修饰词（如“premarrying counseling/class”），功能上等同于“premarital counseling/class”。"]}
{"word":"premastery","summary":{"en":"Premastery refers to the period before full mastery of a skill, or materials aimed at learners in that early stage.","zh":"Premastery 指在技能完全熟练掌握之前的阶段，也可指面向该早期学习阶段的内容或练习。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stage or period before someone has fully mastered a skill; an early-learning phase","zh":"（技能）尚未熟练掌握之前的阶段；学习早期阶段"},"examples":[{"en":"In the premastery stage, learners make many small mistakes but improve quickly with feedback.","zh":"在尚未熟练掌握的阶段，学习者会出现很多小错误，但在反馈下进步很快。"},{"en":"The app is designed for premastery practice, not advanced performance.","zh":"这个应用是为熟练掌握前的练习设计的，不是给高阶表现用的。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something meant for learners before mastery (often used before a noun)","zh":"（作定语）指“面向熟练掌握之前学习者的”（常用于名词前）"},"examples":[{"en":"We created premastery exercises to build confidence step by step.","zh":"我们设计了熟练掌握前的练习，帮助学习者一步步建立信心。"},{"en":"Premastery students benefit from clear examples and short tasks.","zh":"尚未熟练的学生更受益于清晰的例子和短小的任务。"}]}],"synonyms":["early stage","pre-mastery stage","learning phase","beginner level","skill-building stage"],"phonetic":"/priˈmæstəri/","extraExplanation":["“premastery”通常写作“pre-mastery”或“pre-mastery stage”，属于由前缀 pre-（在……之前）+ mastery（熟练掌握）构成的教学/训练用语，常见于教育评估、技能训练、语言学习、游戏训练等语境。","在学习科学里，它常暗示“还没到自动化/稳定正确”的程度：需要更多重复练习、纠错与巩固，而不是追求速度或高难度表现。"]}
{"word":"prematch","summary":{"en":"“Prematch” means “before a match,” describing the time or activities leading up to a sports game or competition.","zh":"“prematch”表示“赛前”，可作形容词指赛前的，也可作名词指赛前阶段或赛前活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in sports) happening or done before a match begins.","zh":"（尤指体育）赛前的；在比赛开始之前进行的。"},"examples":[{"en":"The coach gave a short prematch talk in the locker room.","zh":"教练在更衣室里做了简短的赛前讲话。"},{"en":"Fans watched the prematch warm-up from the stands.","zh":"球迷在看台上观看了赛前热身。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time before a match, or activities/events that happen before the match starts.","zh":"赛前（时间段）；赛前活动/环节。"},"examples":[{"en":"The prematch was filled with music and introductions.","zh":"赛前环节有音乐和出场介绍。"},{"en":"In the prematch, the team focused on staying calm.","zh":"在赛前阶段，球队专注于保持冷静。"}]}],"synonyms":["pre-match","pre-game","before the match","pregame"],"phonetic":"/ˌpriːˈmætʃ/","extraExplanation":["“prematch”常见于体育新闻与转播语境（如 soccer/football、boxing、MMA、esports）。美式英语里也常说“pre-game”（赛前），英式体育报道里“pre-match”更常见；“prematch”多见于标题、社媒或作为合成词/标签使用。"]}
{"word":"premate","summary":{"en":"Premate is a rare verb meaning to mate animals in advance.","zh":"Premate 是个很少见的动词，指让动物提前交配/提前配种。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to mate (animals) before a particular time or planned event; to pair up for mating in advance.","zh":"（罕见用法）在特定时间或计划事件之前让（动物）交配；提前配种。"},"examples":[{"en":"Some breeders premate the animals so the births happen in early spring.","zh":"有些饲养者会提前让动物配种，好让幼崽在早春出生。"},{"en":"The herd may premate if food is plentiful and the weather is mild.","zh":"如果食物充足、天气温和，这群动物可能会提前进入交配状态。"}]}],"synonyms":["mate beforehand","breed early","pair up in advance"],"phonetic":"/priːˈmeɪt/","extraExplanation":["“premate”在现代英语里非常少见，更常见的写法是带连字符的“pre-mate”，尤其在动物繁殖/畜牧语境中更清楚。","学习时容易和“premade（预制的）”或“primates（灵长类）”混淆：拼写接近，但意义完全不同。若你想查的是其中之一，可以告诉我。"]}
{"word":"premated","summary":{"en":"“Premated” is a rare adjective meaning “already mated in advance,” mostly used in scientific contexts; many people actually mean “premeditated.”","zh":"“premated”是很少见的形容词，主要用于科学语境，表示“预先交配过的”；很多情况下人们想写的是“premeditated（预谋的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) having been mated in advance; already paired for breeding before a later event (used mainly in biology/animal studies).","zh":"（罕见）预先交配过的；在某个后续事件之前就已完成配对繁殖的（多用于生物学/动物研究）。"},"examples":[{"en":"The premated females were kept separate from the males during the experiment.","zh":"在实验期间，这些已预先交配的雌性与雄性被分开饲养。"},{"en":"Researchers compared premated and unmated groups to measure fertility changes.","zh":"研究人员比较了预先交配组与未交配组，以测量生育力的变化。"}]}],"synonyms":["pre-mated","already mated","previously mated"],"phonetic":"/priˈmeɪtɪd/","extraExplanation":["“premated”在日常英语中几乎不用；更常见的写法是加连字符的“pre-mated”。","很多学习者把“premated”误写成“premeditated”（/priˈmɛdɪteɪtɪd/，意为“预谋的；事先计划的”，常见于法律语境，如“premeditated murder”预谋杀人）。如果你想表达“预谋的”，你要查的词很可能是“premeditated”。"]}
{"word":"prematerial","summary":{"en":"Prematerial means “before something becomes material/physical,” and more rarely “before materials are used in a project.”","zh":"prematerial 指“在某事物质化/有形化之前”；较少见时也可指“项目材料使用之前”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or existing before something becomes physical, concrete, or made into materials (often used in philosophy or theology).","zh":"在某事变得有形、具体或进入“物质层面”之前发生或存在的（常用于哲学或神学语境）。"},"examples":[{"en":"Some traditions describe the soul as having a prematerial existence.","zh":"有些传统认为灵魂在进入物质世界之前有一种“前物质”的存在。"},{"en":"The author contrasts prematerial reality with the visible world.","zh":"作者把前物质的实在与可见世界作对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening before materials are purchased, delivered, or used in a project (less common; often written with a hyphen: pre-material).","zh":"在项目材料采购、交付或使用之前发生的（较少见；常写作带连字符的 pre-material）。"},"examples":[{"en":"The contractor scheduled a prematerial site visit to confirm measurements.","zh":"承包商安排了一次材料进场前的现场勘察以确认尺寸。"},{"en":"Prematerial planning reduced delays once supplies arrived.","zh":"材料到位前的规划减少了后续延误。"}]}],"synonyms":["pre-material","immaterial (related, not identical)","nonphysical","spiritual (context-dependent)"],"phonetic":"/ˌpriːməˈtɪriəl/","extraExplanation":["这个词在日常英语里很少见，更常见的写法是带连字符的 **pre-material**。学术写作里（尤其哲学/神学）也可能用 **prematerial** 来强调“在物质化之前”的状态。","如果你想表达“非物质的/精神性的”，更常用的词是 **immaterial**（非物质的）或 **spiritual**（精神的）。如果想表达“材料到位之前的”，更自然的说法是 **before materials arrive/are delivered**。"]}
{"word":"prematernity","summary":{"en":"Prematernity means “before childbirth / before maternity begins,” usually in medical or workplace-policy contexts.","zh":"prematernity 指“分娩前/进入产后阶段之前”，多见于医疗或职场政策语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a period, care, leave, or condition) happening before a woman gives birth; relating to the time before maternity (childbirth and the period after).","zh":"（指时期、护理、休假或状态）发生在分娩之前的；与“产前/成为母亲之前的阶段”有关的。"},"examples":[{"en":"Some companies offer prematernity checkups as part of their health plan.","zh":"一些公司把产前检查纳入员工的健康计划。"},{"en":"She asked about prematernity leave policies during the interview.","zh":"面试时她询问了产前休假政策。"}]}],"synonyms":["prenatal","antepartum","pre-birth","before childbirth"],"phonetic":"/ˌpriːməˈtɝːnəti/","extraExplanation":["“prematernity”在日常英语中不常见，更常用的是“prenatal”（产前的）或“antepartum”（医学语：产前的）。","书写上也常见带连字符的形式“pre-maternity”，尤其在政策/人力资源语境里（如pre-maternity leave）。","如果你想表达“怀孕期间”，通常用“during pregnancy”；表达“产前检查/护理”用“prenatal care/checkups”。"]}
{"word":"premating","summary":{"en":"“Premating” means before mating, especially in biology (premating behavior/phase).","zh":"“premating”指“交配前的”，多用于生物学语境（如交配前行为/阶段）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before mating; relating to behaviors, signals, or processes that occur prior to mating (often used in biology).","zh":"（常用于生物学）发生在交配之前的；与交配前的行为、信号或过程有关的。"},"examples":[{"en":"Birds use premating songs to attract a partner.","zh":"鸟类会用交配前的鸣唱来吸引伴侣。"},{"en":"The study focuses on premating behavior such as courtship and mate choice.","zh":"这项研究关注求偶和择偶等交配前行为。"}]},{"partOfSpeech":"n.","definition":{"en":"A period or stage before mating occurs.","zh":"交配发生之前的时期或阶段。"},"examples":[{"en":"During the premating phase, males often compete for access to females.","zh":"在交配前阶段，雄性常常会竞争接近雌性的机会。"}]}],"synonyms":["pre-mating","before mating","courtship-related"],"phonetic":"/priˈmeɪtɪŋ/","extraExplanation":["“premating”更常见于学术或科普语境，尤其是动物行为学、进化生物学与生态学中。日常英语里一般会说“before mating”。","写法上常见“pre-mating”（加连字符），尤其在正式写作中更清晰；两者通常意义相同。","相关概念：premating isolation（交配前隔离，指阻止不同物种交配的机制），与 postmating（交配后）相对。"]}
{"word":"prematrimonial","summary":{"en":"Prematrimonial means “before marriage,” often used in formal contexts like law, counseling, or sociology.","zh":"prematrimonial 指“婚前的、结婚之前的”，多用于法律、辅导或社会学等较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before marriage; relating to the period before two people are married.","zh":"婚前的；发生在结婚之前的；与结婚前阶段有关的。"},"examples":[{"en":"Some couples choose prematrimonial counseling to talk through expectations before they marry.","zh":"有些情侣会选择婚前辅导，在结婚前把彼此的期待谈清楚。"},{"en":"They signed a prematrimonial agreement to clarify finances and property.","zh":"他们签了婚前协议，用来明确财务和财产问题。"},{"en":"The novel explores prematrimonial love and the social pressure to marry.","zh":"这部小说探讨了婚前的爱情以及社会对结婚的压力。"}]}],"synonyms":["prenuptial","before marriage","pre-marital"],"phonetic":"/ˌpriˌmætrəˈmoʊniəl/","extraExplanation":["“prematrimonial”较正式、法律/学术语境更常见。日常口语里常用“before marriage”或“prenup/prenuptial（婚前协议相关）”。","常见搭配：prematrimonial counseling（婚前辅导）、prematrimonial relationship（婚前关系）、prematrimonial agreement（婚前协议）。","在不同文化与宗教语境中，“prematrimonial sex（婚前性行为）”可能带有明显的价值判断；在使用时注意场合与语气。"]}
{"word":"prematrimonially","summary":{"en":"Prematrimonially means “before marriage,” used mostly in formal contexts.","zh":"prematrimonially 意为“婚前地、结婚之前”，多用于较正式的语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before marriage; in the time prior to getting married.","zh":"婚前地；在结婚之前。"},"examples":[{"en":"They signed a financial agreement prematrimonially.","zh":"他们在婚前签署了一份财务协议。"},{"en":"Prematrimonially, she wanted to finish graduate school first.","zh":"在结婚前，她希望先完成研究生学业。"},{"en":"The couple discussed expectations prematrimonially to avoid misunderstandings later.","zh":"这对伴侣在婚前讨论了彼此的期待，以避免日后误会。"}]}],"synonyms":["before marriage","premaritally","prenuptially"],"phonetic":"/ˌpriˌmætrəˈmoʊniəli/","extraExplanation":["“prematrimonially”由前缀 pre-（“在……之前”）+ matrimonial（“婚姻的”）+ 副词后缀 -ly 组成，语气较正式，常见于法律、政策、学术或严肃写作中。日常口语更常说 “before getting married / before marriage”。","在法律语境里，它常与财产、协议、权利义务等话题同现，例如 premarital/prenuptial agreement（婚前协议）。"]}
{"word":"prematuration","summary":{"en":"Prematuration means becoming mature earlier than normal, usually in scientific or medical contexts.","zh":"Prematuration 指“比正常更早的成熟/早熟”，多用于科学或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming mature too early (especially in biology or medicine).","zh":"过早成熟；早熟（尤用于生物学或医学语境）。"},"examples":[{"en":"In some fish, prematuration can reduce final body size.","zh":"在一些鱼类中，过早成熟会降低最终体型。"},{"en":"Doctors monitored the child for signs of prematuration.","zh":"医生监测这个孩子是否有早熟的迹象。"}]}],"synonyms":["early maturation","premature maturation","premature development","precocious development"],"phonetic":"/ˌpriːˌmætʃəˈreɪʃən/","extraExplanation":["“prematuration”较少出现在日常英语中，更常见于学术写作（生物学、医学、畜牧/养殖等）。日常表达通常用“early maturation / premature development / precocious puberty（性早熟）”。","构词法：pre-（提前）+ maturation（成熟）。含义强调“成熟发生得比正常时间更早”，并不一定带有褒义。"]}
{"word":"premature","summary":{"en":"Premature means “too early,” often suggesting something happens before the right time; it can also describe a baby born before full term.","zh":"Premature 表示“过早的/时机不成熟的”，也可指“早产的（未足月出生的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening too early; earlier than expected or appropriate.","zh":"过早的；早于预期或不合适地发生的。"},"examples":[{"en":"The celebration felt premature because nothing was officially confirmed yet.","zh":"由于还没有正式确认，这场庆祝显得有点过早。"},{"en":"Don’t make a premature decision—take time to compare your options.","zh":"别过早下决定——花点时间比较你的选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a baby) born before the expected time; preterm.","zh":"（婴儿）早产的；未足月出生的。"},"examples":[{"en":"The baby was born premature and needed special care at the hospital.","zh":"宝宝早产了，需要在医院接受特殊护理。"}]}],"synonyms":["too early","early","untimely","hasty","preterm"],"phonetic":"/ˌpriːməˈtʃʊr/","extraExplanation":["在正式场合或写作中，premature 常用来委婉地表示“时机不成熟/操之过急”，语气比 too early 更书面一些。","与“早产”相关时，医学上也常用 preterm（更专业、客观）；日常表达中 premature baby 也很常见。"]}
{"word":"prematurely","summary":{"en":"“Prematurely” means happening too early or ending before it is properly finished, often suggesting an unwanted or problematic early timing.","zh":"“prematurely”表示“过早地/提前地”，常带有“不该这么早”的语气，也可指事情在未完成前就结束。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too early; before the usual, expected, or proper time.","zh":"过早地；在通常、预期或适当的时间之前。"},"examples":[{"en":"The baby was born prematurely and needed special medical care.","zh":"宝宝早产了，需要特别的医疗照护。"},{"en":"Don’t celebrate prematurely—wait until the results are official.","zh":"别过早庆祝——等结果正式公布再说。"}]},{"partOfSpeech":"adv.","definition":{"en":"Before something has fully developed or finished; in a way that prevents a complete result.","zh":"在尚未充分发展或完成之前；以致无法得到完整结果地。"},"examples":[{"en":"The discussion ended prematurely because everyone had to leave.","zh":"因为大家都得离开，讨论提前结束了。"},{"en":"Cutting the training short prematurely can lead to mistakes later.","zh":"过早缩短训练可能会导致之后出错。"}]}],"synonyms":["too early","ahead of time","early","before its time","untimely"],"phonetic":"/ˌpriːməˈtʃʊrli/","extraExplanation":["“prematurely”常带有“本来不该这么早”的语气，暗示结果可能不理想或会造成问题（如 premature death 过早死亡；premature celebration 过早庆祝）。","词源上与拉丁语前缀“pre-（在前）”相关，核心概念是“时间上提前发生”。"]}
{"word":"prematureness","summary":{"en":"“Prematureness” means the state/quality of being premature (too early), but “prematurity” is more common in everyday and medical English.","zh":"“prematureness”指“过早/早产的状态”，但在日常和医学英语里更常用“prematurity”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being premature; happening too early or before the proper time","zh":"过早；早产（的状态）；不合时宜（在恰当时机之前发生的状态）"},"examples":[{"en":"The prematureness of the announcement caused confusion inside the company.","zh":"这次公告发布得过早，导致公司内部一片困惑。"},{"en":"Critics argued that the prematureness of the decision prevented a careful discussion.","zh":"批评者认为，这个决定做得太早，阻碍了充分的讨论。"}]}],"synonyms":["prematurity","untimeliness","earliness"],"phonetic":"/ˌpriːməˈtʊr.nəs/","extraExplanation":["“prematureness”在现代英语中不算常用；更常见、更自然的名词是“prematurity”。在医学语境中通常说“prematurity / premature birth（早产）”，在一般语境中也更常用“prematurity（过早、轻率）”。","构词：premature（过早的）+ -ness（名词后缀，表示“……的性质/状态”）。因此它强调“过早这一性质”。"]}
{"word":"prematurities","summary":{"en":"“Prematurities” is the plural of “prematurity,” most often referring to early birth and the problems that can result from it.","zh":"“prematurities”是“prematurity”的复数，最常指早产以及由此可能带来的问题/并发症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being born too early (before full development); also, the health problems that can result from being born early","zh":"早产；（也可指）早产导致的健康问题/并发症"},"examples":[{"en":"The doctor explained the risks of prematurities for babies born before 37 weeks.","zh":"医生解释了妊娠不足37周出生的婴儿可能面临的早产风险。"},{"en":"Modern neonatal care has improved outcomes for many prematurities.","zh":"现代新生儿重症护理改善了许多早产相关问题的预后。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of happening too soon; lack of appropriate time or development (less common)","zh":"过早；不成熟（较少用）"},"examples":[{"en":"Critics noted the prematurities in the policy announcement, saying key details were missing.","zh":"评论者指出该政策发布过于仓促，称关键细节缺失。"},{"en":"They regretted the prematurities in their decision to expand too quickly.","zh":"他们后悔自己扩张过快，认为决定过于仓促。"}]}],"synonyms":["prematurity","preterm birth","premature birth","early birth","neonatal complications"],"phonetic":"/ˌpriːməˈtʃʊrɪtiz/","extraExplanation":["“prematurities”多见于医学或公共卫生语境，常指“早产（儿）相关问题”的复数用法；日常英语里更常说“prematurity”（不可数）或“premature birth / preterm birth（早产）”。","医学上常以孕周来界定早产：通常将37周以前出生称为preterm/premature。不同国家/机构可能有更细的分类（如极早产等）。"]}
{"word":"prematurity","summary":{"en":"Prematurity means being born too early, or more generally, happening too early.","zh":"Prematurity 指“早产”，也可泛指“过早发生/操之过急”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being born too early (before the normal length of pregnancy is completed).","zh":"早产；未满正常孕期就出生的状态。"},"examples":[{"en":"The baby was in the hospital because of prematurity.","zh":"宝宝因为早产而住院。"},{"en":"Prematurity can lead to breathing or feeding problems at first.","zh":"早产一开始可能会引起呼吸或喂养方面的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of happening too early; being done before the right or expected time.","zh":"过早（发生）；未到合适或预期时间就发生/进行。"},"examples":[{"en":"They criticized the prematurity of the decision.","zh":"他们批评这个决定下得过早。"},{"en":"The report warned about the prematurity of celebrating success.","zh":"报告提醒：现在就庆祝成功还为时过早。"}]}],"synonyms":["preterm birth","early birth","untimeliness","prematureness"],"phonetic":"/ˌpriːməˈtʃʊrəti/","extraExplanation":["在医学语境里，prematurity 常与 preterm birth（早产）一起出现；日常英语里也可比喻“操之过急/过早下结论”。","相关搭配：prematurity complications（早产并发症）、extreme prematurity（极早产）、due to prematurity（由于早产）。"]}
{"word":"premaxilla","summary":{"en":"Premaxilla: the front bone of the upper jaw, often bearing the upper front teeth.","zh":"premaxilla：上颌最前端的骨（上颌前骨），常承载上门牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bone at the very front of the upper jaw in many vertebrates (including many animals and early human ancestors), which typically bears the upper front teeth (incisors).","zh":"（上颌前骨）许多脊椎动物（包括许多动物及人类早期祖先）上颌最前端的一块骨头，通常承载上门牙（切牙）。"},"examples":[{"en":"In many mammals, the premaxilla holds the incisors at the front of the mouth.","zh":"在许多哺乳动物中，上颌前骨承载位于口腔前方的门牙。"},{"en":"Fossil skulls often show how the premaxilla connects with neighboring facial bones.","zh":"化石头骨常能显示上颌前骨如何与相邻的面部骨骼连接。"}]}],"synonyms":["incisive bone","intermaxillary bone"],"phonetic":"/ˌpriːmækˈsɪlə/","extraExplanation":["词源提示：pre- 表示“在……之前/前部”，maxilla 表示“上颌骨”，合起来就是“上颌骨前部的骨”。","在人类现代解剖学中，这块骨在胚胎发育早期可作为独立结构出现，随后与上颌骨融合；因此在成人颅骨中常不再作为“独立骨”被单独描述，但在比较解剖与古生物学里仍很常用。"]}
{"word":"premaxillae","summary":{"en":"Premaxillae are the paired front bones of the upper jaw in many vertebrates.","zh":"premaxillae 指许多脊椎动物上颌最前端的一对骨（前上颌骨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The paired bones at the very front of the upper jaw in many vertebrates; they typically bear the upper front teeth and form part of the roof of the mouth and the border of the nose.","zh":"（许多脊椎动物）上颌最前端的一对骨（前上颌骨）；通常承载上前牙，并构成口腔上壁与鼻部边界的一部分。"},"examples":[{"en":"In many fish and reptiles, the premaxillae hold several front teeth.","zh":"在许多鱼类和爬行动物中，前上颌骨承载多枚前牙。"},{"en":"The fossil showed enlarged premaxillae, suggesting a strong bite at the front of the mouth.","zh":"该化石显示前上颌骨增大，提示其口腔前部咬合力较强。"}]}],"synonyms":["premaxillary bones","incisive bones"],"phonetic":"/ˌpriːmækˈsɪliː/","extraExplanation":["“premaxillae”是“premaxilla”的复数形式；单数为“premaxilla”。","在人类解剖学中，这一区域通常与上颌骨融合，相关结构常在胚胎学、颌面发育与比较解剖学（如恐龙/鸟类化石研究）中讨论。"]}
{"word":"premaxillary","summary":{"en":"Premaxillary means “of or relating to the premaxilla,” the front part of the upper jaw associated with the upper front teeth.","zh":"premaxillary 指“与前上颌骨有关的”，即与上颌前部、上门牙相关的解剖区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the premaxilla, the front part of the upper jawbone that holds the upper front teeth (incisors) in many animals, including humans during early development.","zh":"与“前上颌骨（premaxilla）”有关的；前上颌骨是上颌最前部的骨区，在许多动物中承载上门牙（切牙），在人类早期发育中也具有对应结构。"},"examples":[{"en":"The CT scan showed a small premaxillary fracture near the upper incisors.","zh":"CT 显示上门牙附近有一处小的前上颌骨骨折。"},{"en":"In comparative anatomy, premaxillary features help distinguish different species.","zh":"在比较解剖学中，前上颌骨相关特征有助于区分不同物种。"}]}],"synonyms":["premaxilla-related","incisive (region-related)","anterior maxillary"],"phonetic":"/ˌpriː.mækˈsɪl.ə.ri/","extraExplanation":["“premaxillary”常见于医学、牙科、解剖学与古生物学文献中，用来描述与前上颌骨相关的结构、损伤或手术区域。","在人类成人解剖里，前上颌骨与上颌骨通常已融合，因此临床上有时会更多用“premaxilla（前上颌骨）/ incisive region（切牙区）”等说法来指代相关部位。"]}
{"word":"premeal","summary":{"en":"“Premeal” means “before a meal,” often used in medical contexts (e.g., premeal insulin/glucose).","zh":"“premeal”表示“餐前/饭前”，常用于医学语境（如餐前胰岛素、餐前血糖）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or taken before a meal.","zh":"（在）饭前的；进餐前发生的或服用的。"},"examples":[{"en":"Take your premeal insulin about 15 minutes before you eat.","zh":"在进食前大约15分钟注射餐前胰岛素。"},{"en":"The doctor recommended checking my blood sugar premeal and at bedtime.","zh":"医生建议我在餐前和睡前测血糖。"}]}],"synonyms":["pre-meal","before meals","prior to meals"],"phonetic":"/ˌpriːˈmiːl/","extraExplanation":["“premeal”在日常英语里不算常见，更常见的写法是“pre-meal”（加连字符）或直接说“before meals”。在医学语境（尤其是糖尿病管理）中更常见，如：premeal insulin（餐前胰岛素）、premeal glucose（餐前血糖）。","构词法：前缀“pre-”表示“在……之前”，加上“meal”（一餐），合起来就是“餐前/饭前的”。"]}
{"word":"premeasure","summary":{"en":"Premeasure means to measure something ahead of time, often to make a later task faster or more accurate.","zh":"premeasure 指在做某事之前先把东西量好，常用于提高后续操作的效率或准确性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to measure something in advance (before using, cutting, cooking, building, etc.)","zh":"预先测量；事先量好（以便之后使用、裁剪、烹饪、施工等）"},"examples":[{"en":"I premeasured the flour and sugar so baking would go faster.","zh":"我把面粉和糖都预先量好了，这样烘焙会更快。"},{"en":"The carpenter premeasured the boards before cutting them.","zh":"木匠在切割木板前先预先测量。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to plan or prepare in advance; to arrange beforehand","zh":"（较少见）预先规划；事先安排"},"examples":[{"en":"They tried to premeasure every detail of the trip.","zh":"他们尽量把旅行的每个细节都事先规划好。"}]}],"synonyms":["measure beforehand","measure in advance","prep","portion out"],"phonetic":"/ˌpriˈmɛʒɚ/","extraExplanation":["“pre-”是英语里很常见的前缀，表示“在……之前”。所以 premeasure 字面意思就是“先量”。在美式英语中，这个词常见于烹饪/烘焙语境（先把食材称重或量杯量好），也常用于手工、木工等需要先量尺寸再切割的场景。","拼写提示：premeasure（一个词）比“pre-measure”（带连字符）更常见；口语里也常用更直白的说法，如 “measure ahead of time”。"]}
{"word":"premeasured","summary":{"en":"Premeasured means already measured in advance into the exact amount needed.","zh":"premeasured 指“预先量好并分装成准确用量的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Measured in advance and already divided into the exact amount needed (often for convenience or accuracy).","zh":"预先量好并分装成所需准确用量的（常用于方便或保证准确）。"},"examples":[{"en":"The recipe uses premeasured ingredients, so you just pour and mix.","zh":"这个食谱使用预先量好的材料，所以你只要倒进去搅拌就行。"},{"en":"They sell premeasured detergent pods to avoid wasting soap.","zh":"他们卖预先量好的洗衣凝珠，以避免浪费洗涤剂。"}]}],"synonyms":["pre-portioned","measured out","ready-measured"],"phonetic":"/ˌpriːˈmɛʒɚd/","extraExplanation":["在日常英语里，premeasured常见于烹饪、烘焙、健身补剂、清洁用品（如洗衣凝珠/洗碗块）等场景，强调“省事、省时、用量更准确”。","构词：pre-（预先）+ measured（量过的）。也可写作 pre-measured（加连字符，尤其在修饰名词时更常见），两种写法都能用。"]}
{"word":"premeasurement","summary":{"en":"A premeasurement is a measurement taken beforehand to serve as a baseline for later comparison.","zh":"premeasurement 指在开始前进行的测量，用作之后比较的基线数据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a measurement taken before an event, treatment, or process begins (used as a baseline for comparison later)","zh":"（在事件、治疗或流程开始前做的）预先测量；基线测量（用于之后对比）"},"examples":[{"en":"We recorded a premeasurement of blood pressure before starting the new medication.","zh":"在开始使用新药之前，我们记录了血压的预先测量数据。"},{"en":"The teacher did a premeasurement of students’ reading level at the start of the semester.","zh":"老师在学期开始时对学生的阅读水平做了基线测量。"}]}],"synonyms":["baseline measurement","initial measurement","pre-test measurement","pretest"],"phonetic":"/ˌpriːˈmɛʒɚmənt/","extraExplanation":["“pre-”是常见前缀，意思是“在……之前”。“premeasurement”多见于研究、医疗、工程或教育评估场景，强调先测一次作为baseline（基线），之后再做post-measurement（后测）来比较变化。","在日常英语中，这个词相对少见；更常见的表达有“baseline measurement”“initial measurement”“pre-test measurement”。"]}
{"word":"premeasuring","summary":{"en":"Premeasuring means measuring something ahead of time.","zh":"premeasuring 指“事先量好、预先测量”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"measuring something in advance (before cooking, building, packing, or another main task).","zh":"预先测量；事先量好（在烹饪、施工、打包等主要步骤之前）。"},"examples":[{"en":"She is premeasuring the flour and sugar for tomorrow’s baking class.","zh":"她正在把面粉和糖提前量好，准备明天的烘焙课。"},{"en":"Premeasuring the ingredients saves time when you’re in a hurry.","zh":"在赶时间时，提前量好食材能节省时间。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of measuring ahead of time.","zh":"预先测量这一行为或过程。"},"examples":[{"en":"A little premeasuring can make meal prep much easier.","zh":"做一点预先测量会让备餐轻松很多。"},{"en":"In the lab, premeasuring helps reduce mistakes during the experiment.","zh":"在实验室里，预先测量有助于减少实验过程中的错误。"}]}],"synonyms":["measuring ahead","measuring in advance","pre-measuring","portioning (in cooking)"],"phonetic":"/ˌpriˈmɛʒɚɪŋ/","extraExplanation":["“premeasuring”来自动词“premeasure”（pre- 表示“预先” + measure “测量”）。日常写作中常见拼写有不加连字符的 premeasure / premeasuring，也常见带连字符的 pre-measure / pre-measuring（尤其在作定语时，如 pre-measuring cups “预先分量杯/预量杯”）。","多用于“先量好再做”的场景：烹饪（ingredients）、手工/施工（materials）、实验（samples）等。"]}
{"word":"premechanical","summary":{"en":"Premachanical means “before widespread use of machines,” often describing historical periods or processes prior to mechanization.","zh":"premachanical 指“在机器广泛使用之前的”，常用于描述机械化之前的历史时期或流程阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a time or culture before machines (especially complex machinery) were widely used; from an era when work was done mainly by hand or simple tools.","zh":"与机械（尤其是复杂机器）尚未普及使用之前的时代或文化有关的；指主要靠手工或简单工具完成工作的时期。"},"examples":[{"en":"In a premechanical society, most textiles were made by hand on simple looms.","zh":"在前机械化社会里，大多数纺织品都是用简单织机手工制作的。"},{"en":"The museum shows how people cooked and farmed in premechanical times.","zh":"博物馆展示了人们在前机械化时代如何做饭和耕作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Happening before mechanical processing or mechanization in a specific workflow or system.","zh":"（较少见，技术用法）在某个流程或系统中，发生在机械处理或机械化之前的。"},"examples":[{"en":"They recorded the premechanical steps of the production line for comparison.","zh":"他们记录了生产线机械化之前的步骤以便对比。"},{"en":"Premachanical inspection can prevent tool damage later.","zh":"机械处理前的检查可以避免后续工具损坏。"}]}],"synonyms":["pre-industrial","pre-mechanization","nonmechanized","handcrafted","manual"],"phonetic":"/ˌpriːməˈkænɪkəl/","extraExplanation":["“pre-”表示“在……之前”，“mechanical”表示“机械的”。这个词并不常见，更常见的表达是“pre-industrial（工业化前）”“pre-mechanization（机械化前）”或“before mechanization（在机械化之前）”。","在历史语境中，它常用来强调生产方式：手工、畜力、水力/风力（简单装置）与后来工厂机器生产的对比。"]}
{"word":"premed","summary":{"en":"“Premed” means “pre-medical,” describing or referring to students preparing to apply to medical school.","zh":"“premed”是“pre-medical”的缩写，指为申请医学院做准备的学习路线或学生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Short for “pre-medical”: relating to college studies and activities that prepare a student to apply to medical school.","zh":"“pre-medical”的缩写：指大学阶段为申请医学院做准备的学习方向与相关活动。"},"examples":[{"en":"She’s a premed student majoring in biology.","zh":"她是预科医学生，主修生物学。"},{"en":"Many premeds volunteer at hospitals to gain experience.","zh":"很多预科医学生会去医院做志愿者来积累经验。"}]},{"partOfSpeech":"n.","definition":{"en":"A student who is on a pre-medical track (planning to apply to medical school).","zh":"走医学预科路线的学生（计划申请医学院的人）。"},"examples":[{"en":"As a premed, he spends a lot of time studying for the MCAT.","zh":"作为预科医学生，他花很多时间准备MCAT。"},{"en":"The club is open to premeds and other health-related majors.","zh":"这个社团对预科医学生和其他健康相关专业的学生开放。"}]}],"synonyms":["pre-med","pre-medical"],"phonetic":"/ˌpriːˈmɛd/","extraExplanation":["在美国大学语境里，“premed”通常不是一个正式专业名称，更像是一种“培养路线/身份”。学生常选生物、化学、神经科学等专业，同时完成医学院要求的先修课（如普通化学、有机化学、生物、物理等）。","“premed”也常暗示竞争压力与经历积累：科研、临床志愿、影子实习（shadowing）、领导力活动等。不同学校要求可能不同。","拼写上常见形式：premed / pre-med；复数常写 premeds。"]}
{"word":"premedia","summary":{"en":"Premedia is the pre-publication/printing preparation stage (or work) that makes files ready to print or publish.","zh":"Premedia 指出版或印刷前的准备与处理阶段（印前制作），把文件整理到可发布/可印刷的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stage of preparing text, images, and layout files before they are published or printed (for example, checking colors, fonts, and file formats).","zh":"（印刷/出版的）前期制作；印前准备：在出版或印刷之前，对文字、图片与版面文件进行处理与检查（如校色、字体、格式等）。"},"examples":[{"en":"The design team sent the brochure to premedia for a final color check.","zh":"设计团队把宣传册交给印前部门做最后的颜色检查。"},{"en":"Premedia work includes proofreading, image retouching, and making print-ready PDFs.","zh":"印前工作包括校对、修图以及制作可直接印刷的 PDF 文件。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to preparation work done before publishing or printing.","zh":"（与）出版或印刷前准备工作相关的；印前的。"},"examples":[{"en":"She works in a premedia department at a packaging company.","zh":"她在一家包装公司的印前部门工作。"},{"en":"We offer premedia services such as layout cleanup and file conversion.","zh":"我们提供印前服务，例如版面整理和文件格式转换。"}]}],"synonyms":["prepress","prepress work","production preparation","preflight (printing)"],"phonetic":"/ˌpriːˈmiːdiə/","extraExplanation":["“Premedia”多见于印刷、包装、出版与广告制作行业，和“prepress（印前）”含义很接近；在实际工作中常涵盖：排版检查（preflight）、色彩管理、打样（proofing）、以及把设计稿输出成印刷机可用的文件。","拼写上也常写作“pre-media”或直接用“prepress”。在非专业语境中比较少见。"]}
{"word":"premedial","summary":{"en":"Premedial means ‘front and medial/midline,’ mainly used in anatomy or technical contexts.","zh":"premedial 指“前内侧/前中部的”，主要用于解剖学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in front of (or toward the front of) the middle/medial part of something; used mostly in anatomy and technical descriptions.","zh":"（多用于解剖学/技术描述）位于某物的内侧（中线）部分之前/更靠前的位置；“前内侧的/前中部的”。"},"examples":[{"en":"The report mentioned changes in the premedial region of the frontal lobe.","zh":"报告提到额叶前内侧区域出现变化。"},{"en":"Pain was noted near the premedial area of the knee.","zh":"记录到膝盖前内侧区域附近疼痛。"}]}],"synonyms":["anteromedial","front-medial"],"phonetic":"/ˌpriˈmiːdiəl/","extraExplanation":["“premedial”在日常英语中非常少见，更多出现在医学、解剖学或科研写作里，表示“前（pre-）+ 内侧/中线（medial）相关的区域”。","很多学习者会把它和更常见的“premedical / pre-med”（医学院预科、学医前的）混淆；如果你想表达“医学院预科生/学医方向”，通常应写“premedical”或“pre-med”。"]}
{"word":"premedian","summary":{"en":"Premedian describes something positioned near the body’s midline, often slightly in front of it, mainly in medical/anatomical contexts.","zh":"Premedian 指靠近身体正中线的位置，常带“略偏前/在正中结构前方”的含义，多用于医学与解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located or occurring before (in front of) the median line; toward the midline but on the front/anterior side (used especially in anatomy).","zh":"（尤用于解剖学）位于正中线之前/前方的；朝向中线但更偏前（前侧/前方）的。"},"examples":[{"en":"The surgeon made a small premedian incision to avoid damaging the central structures.","zh":"外科医生在接近正中线但略偏前的位置做了一个小切口，以避免损伤中央结构。"},{"en":"In some diagrams, the artery is labeled as running in a premedian position.","zh":"在一些示意图中，这条动脉被标注为走行于正中线前方的位置。"}]},{"partOfSpeech":"adj.","definition":{"en":"Near the median line; slightly to one side of the midline (a less common, broader use).","zh":"靠近正中线的；略偏离中线一侧的（较少见、较宽泛的用法）。"},"examples":[{"en":"A premedian approach may give better access than a strictly midline approach.","zh":"略偏中线的入路有时比完全正中入路更便于操作。"},{"en":"The pain was described as premedian rather than clearly left-sided.","zh":"疼痛被描述为靠近中线，而不是明显偏左。"}]}],"synonyms":["paramedian","near-midline","anterior (context-dependent)"],"phonetic":"/priˈmiːdiən/","extraExplanation":["这个词在日常英语中非常少见，主要出现在医学/解剖学与手术路径（approach, incision）等语境里。","词形可拆为 pre-（在……之前/前方）+ median（正中的/中线的）。在解剖语境中，premedian 往往更强调“在正中结构前方（anterior to the midline region）”或“靠近中线但不完全在正中（paramedian 的近义倾向）”。实际含义需结合具体图谱/文献的坐标体系来判断。","相关近义词：paramedian（旁正中/近中线）、midline（正中线的）、anterior（前侧的）。"]}
{"word":"premedic","summary":{"en":"Premedic (premed) refers to students or preparation for medical school.","zh":"premedic（premed）指医预科学生或为申请医学院做的准备/课程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A student or course of study intended to prepare someone for medical school (often called “pre-med”).","zh":"（为进入医学院做准备的）医预科学生；医预科课程（常简称为 pre-med）。"},"examples":[{"en":"She’s a premed major and volunteers at a hospital on weekends.","zh":"她是医预科专业的学生，周末在医院做志愿者。"},{"en":"Premed requirements usually include biology, chemistry, and physics.","zh":"医预科要求通常包括生物、化学和物理。"}]},{"partOfSpeech":"n.","definition":{"en":"A premedical student; someone planning to apply to medical school.","zh":"医预科生；计划申请医学院的人。"},"examples":[{"en":"As a premed, he spends a lot of time preparing for the MCAT.","zh":"作为医预科生，他花很多时间准备 MCAT。"}]}],"synonyms":["pre-med","premedical","prehealth (related)"],"phonetic":"/ˌpriˈmɛd/","extraExplanation":["“Premed / pre-med / premedical”在美国校园语境里非常常见，更多是“升学路径/身份标签”，不一定是一门正式独立的专业；很多学校没有“premed”这个学位，但会提供“pre-health/pre-med advising（预科咨询/指导）”。","常见写法有 premed（较口语/非正式）、pre-med（更清晰的连字符写法）和 premedical（更正式）。","美国常提到的 MCAT 是医学院入学考试；此外还常见“clinical hours（临床时数）”“shadowing（跟诊观摩）”“research（科研）”等与 premed 相关的申请要素。"]}
{"word":"premedical","summary":{"en":"Premedical means “related to preparing for medical school.”","zh":"Premedical 指“与准备进入医学院（学医）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to preparation for studying medicine (especially the college stage before medical school).","zh":"与医学院学习前的准备阶段有关的（尤其指大学里为读医学院做准备的阶段）。"},"examples":[{"en":"She’s a premedical student who plans to apply to medical school next year.","zh":"她是一名医学预科学生，计划明年申请医学院。"},{"en":"He’s taking premedical courses like biology and chemistry.","zh":"他正在修读生物和化学等医学预科课程。"}]}],"synonyms":["pre-med","pre-medical"],"phonetic":"/ˌpriːˈmɛdɪkəl/","extraExplanation":["在美国教育语境里，premedical（常写作 pre-med）通常不是一个正式的“专业”名称，而是指一套为申请医学院（medical school / med school）做准备的学习路径与经历：包括先修课程（如生物、化学、有机化学、物理）、相关实践（志愿服务、临床见习、科研等）以及准备入学考试（MCAT）。","常见搭配：premedical student（医学预科学生）、premedical program/track（医学预科项目/方向）、premedical requirements（医学预科要求）。也常见更口语的写法：pre-med。"]}
{"word":"premedicate","summary":{"en":"Premedicate means to give medicine before a medical procedure to prepare the patient.","zh":"premedicate 指在医疗操作前预先给药，让病人做好准备并减轻不适。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone medicine before a medical procedure (such as surgery or anesthesia) to calm them, reduce pain, prevent nausea, or prepare the body","zh":"（在手术或麻醉等医疗操作前）预先给药；术前用药，以镇静、止痛、防恶心或为治疗做准备"},"examples":[{"en":"The nurse will premedicate you before the procedure to help you relax.","zh":"护士会在操作前给你预先用药，帮助你放松。"},{"en":"Some patients are premedicated to reduce nausea caused by anesthesia.","zh":"有些病人会在麻醉前预先用药，以减少恶心。"}]}],"synonyms":["pre-medicate","administer premedication","medicate beforehand"],"phonetic":"/ˌpriːˈmɛdɪˌkeɪt/","extraExplanation":["在医疗英语里，premedicate 常见于医院流程说明（术前准备）中。它通常表示“在主要治疗之前先给一剂或一组药”，目的可能是镇静、止痛、抗过敏或预防术后不适。","常见搭配：premedicate someone with + 药物（如 antihistamines 抗组胺药、sedatives 镇静剂）；be premedicated before surgery（手术前已进行预先用药）。","与 premeditation（预谋）无关。虽然都来自 pre-（在…之前）+ medic-（药/医），但语境完全不同。"]}
{"word":"premedicated","summary":{"en":"“Premedicated” means given medicine in advance, especially before anesthesia or a medical procedure.","zh":"premedicated 指在麻醉或医疗操作前预先给予药物（术前用药/预用药）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given medicine (often a sedative, pain reliever, or anti-nausea drug) before a medical procedure or anesthesia.","zh":"在医疗操作或麻醉前预先给予药物（常见为镇静、止痛或止吐药）。"},"examples":[{"en":"The patient was premedicated to reduce anxiety before surgery.","zh":"为了减轻手术前的焦虑，病人在术前接受了预用药。"},{"en":"Children may be premedicated before an MRI to help them stay still.","zh":"儿童在做核磁共振前可能会预先用药，以帮助他们保持不动。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of premedicate: to give medicine in advance of a procedure.","zh":"premedicate 的过去式/过去分词：在操作前先行用药。"},"examples":[{"en":"They premedicated him with an anti-nausea drug before chemotherapy.","zh":"在化疗前，他们先给他用了止吐药。"},{"en":"She was premedicated and then taken to the operating room.","zh":"她术前已用药，随后被送入手术室。"}]}],"synonyms":["given premedication","medicated beforehand","sedated (in some contexts)"],"phonetic":"/priːˈmɛdɪˌkeɪtɪd/","extraExplanation":["“premedicated”常见于医院语境，特别是麻醉学、外科、影像检查等。它强调“事先用药”的时间点，而不是长期用药。","不要和“premeditated（预谋的）”混淆：两者拼写接近，但意思完全不同。医学里是 premedicated（预用药）；法律/新闻里常见 premeditated（预先策划）。","相关表达：premedication（术前用药/预用药）；to premedicate someone with + 药物（用某药进行术前用药）。"]}
{"word":"premedicating","summary":{"en":"Premedicating means giving or taking medicine ahead of time—often before a medical procedure—to prevent or lessen expected discomfort or side effects.","zh":"Premedicating 指提前用药（常在医疗操作前），以预防或减轻预期的不适和副作用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Giving medicine before a procedure (especially before anesthesia or surgery) to reduce pain, anxiety, nausea, or other side effects.","zh":"（尤指手术或麻醉前）预先给药，以减轻疼痛、焦虑、恶心等不适或副作用。"},"examples":[{"en":"The nurse is premedicating the patient before the MRI to help with anxiety.","zh":"护士正在在核磁共振检查前给病人预先用药，以缓解焦虑。"},{"en":"Premedicating with an anti-nausea drug can reduce vomiting after anesthesia.","zh":"预先使用止吐药可以减少麻醉后的呕吐。"}]},{"partOfSpeech":"v.","definition":{"en":"Taking medicine in advance for a predictable situation (such as motion sickness or allergies).","zh":"在可预见的情况发生前提前服药（如晕车、过敏）。"},"examples":[{"en":"She’s premedicating for motion sickness before the boat trip.","zh":"她在坐船前提前吃药预防晕船。"},{"en":"If pollen is high, some people start premedicating a day early.","zh":"花粉浓度高时，有些人会提前一天开始用药预防。"}]}],"synonyms":["pre-treating","medicating beforehand","prophylactically medicating","administering premedication"],"phonetic":"/ˌpriːˈmɛdɪˌkeɪtɪŋ/","extraExplanation":["“premedicating”是动词“premedicate”的现在分词/动名词形式，常见于医院沟通（如术前用药、检查前镇静）。名词形式是“premedication”（术前用药/预处理用药）。","在医疗语境中，premedication可能包括：镇静药（减轻紧张）、止痛药（减轻疼痛）、止吐药（减少恶心呕吐）、抗过敏药（降低过敏反应风险）等；具体用药必须遵医嘱。"]}
{"word":"premedication","summary":{"en":"Premedication is medicine (or the practice of giving medicine) given before a procedure to prepare the patient and reduce risks or discomfort.","zh":"Premedication 指在医疗操作前给予的术前用药，或“预先给药”的做法，用于让病人更舒适并降低风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicine given before a medical procedure (such as surgery or anesthesia) to prepare the patient—for example, to reduce anxiety, pain, nausea, or infection risk.","zh":"（在手术、麻醉或检查前）预先给药；为准备病人而提前使用的药物，例如用于减轻焦虑、疼痛、恶心或降低感染风险。"},"examples":[{"en":"The nurse explained that the premedication would help her relax before the operation.","zh":"护士解释说，术前用药会帮助她在手术前放松。"},{"en":"Some patients receive premedication to prevent nausea after anesthesia.","zh":"有些病人会接受术前用药，以预防麻醉后的恶心。"},{"en":"He is allergic to penicillin, so the doctor chose a different premedication.","zh":"他对青霉素过敏，所以医生选择了另一种术前用药。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or practice of giving medicine in advance of a treatment or procedure.","zh":"预先给药的行为或做法（在治疗或操作前提前用药）。"},"examples":[{"en":"Premedication is common before endoscopy to reduce discomfort.","zh":"在内镜检查前进行预先给药很常见，以减轻不适。"},{"en":"The hospital has a protocol for premedication before contrast scans.","zh":"医院有一套在增强扫描前进行预先给药的流程。"}]}],"synonyms":["pre-op medication","preoperative medication","pre-op meds"],"phonetic":"/ˌpriːˌmɛdɪˈkeɪʃən/","extraExplanation":["在英语医疗语境中，premedication 常见于 “premedication with + 药物/药物类别”（例如 premedication with antibiotics/antihistamines）或 “premedication for + 目的”（例如 for anxiety/nausea）。","它常与 premed（口语/临床简写）一起出现，但 premed 也可能指“医学预科学生”，需根据上下文判断。","前缀 pre- 表示“在……之前”，medication 表示“用药/药物”，合起来就是“事先用药”。"]}
{"word":"premedics","summary":{"en":"Premedics are students preparing for medical school (pre-med students).","zh":"Premedics 指准备申请医学院的医学预科生（pre-med 学生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (usually students) who are preparing to study medicine, especially by taking premedical courses before medical school.","zh":"（通常指学生）准备学医的人，尤指在医学院之前修读“医学预科”课程的人。"},"examples":[{"en":"Many premedics volunteer at hospitals to gain experience.","zh":"很多医学预科生会去医院做志愿者来积累经验。"},{"en":"She joined a study group for premedics to prepare for the MCAT.","zh":"她加入了医学预科生的学习小组来备考 MCAT。"}]}],"synonyms":["pre-meds","premed students","pre-medical students"],"phonetic":"/ˌpriːˈmɛdɪks/","extraExplanation":["在美国语境里，premedic(s) 常指“pre-med student(s)”（医学预科生）。它不是一个正式学位专业名称，更常见的是一种“学习方向/目标”：学生在本科阶段修生物、化学、有机化学、物理等课程，并完成临床影子（shadowing）、科研或志愿服务等经历，为申请医学院做准备。","写法上更常见的是连字符形式 pre-med / premed（单数）和 premeds（复数）。premedics 也能见到，但相对不如 premeds 常用。"]}
{"word":"premedieval","summary":{"en":"Premedieval means “before the Middle Ages,” often used in historical or academic contexts.","zh":"premedieval 意为“中世纪之前的（前中世纪的）”，多用于历史或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a time, culture, or object) belonging to the period before the Middle Ages (before about the 5th century in Europe).","zh":"（时间、文化或事物）属于中世纪之前的；前中世纪的（欧洲通常指约公元5世纪以前）。"},"examples":[{"en":"The museum has a small collection of premedieval coins.","zh":"这家博物馆收藏了一小批前中世纪的钱币。"},{"en":"The book compares Roman law with premedieval local customs.","zh":"这本书把罗马法与前中世纪的地方习俗作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally: earlier than medieval-style society, art, or institutions; from an ancient or early historical period.","zh":"更广义：早于“中世纪式”的社会、艺术或制度的；来自古代或早期历史时期的。"},"examples":[{"en":"The researcher studies premedieval religious practices in Northern Europe.","zh":"这位研究者研究北欧前中世纪的宗教实践。"},{"en":"Some premedieval legends later became popular medieval stories.","zh":"一些前中世纪的传说后来变成了流行的中世纪故事。"}]}],"synonyms":["pre-medieval","ancient","early","classical (in some contexts)","pre-Christian (in some contexts)"],"phonetic":"/ˌpriːmɪˈdiːvəl/","extraExplanation":["“premedieval”由前缀 pre-（“在……之前”）+ medieval（“中世纪的”）构成，常见于历史、考古、艺术史等学术语境。","在欧洲史的常见分期里，“中世纪”大致从西罗马帝国灭亡（公元476年）前后算起；因此“premedieval”常指古典时代（如希腊、罗马）或更早期，以及晚期古代（Late Antiquity）的部分内容。","使用时注意语境：不同地区的“中世纪”起止并不完全一致，所以写作中最好说明具体年代或文明范围（例如“premedieval Britain”或“premedieval Europe, before the 5th century”）。"]}
{"word":"premedievalism","summary":{"en":"Premedievalism means a focus on cultures and history before the Middle Ages.","zh":"Premedievalism 指对中世纪之前历史与文化的关注或研究取向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An interest in, study of, or cultural/academic focus on societies and cultures before the European Middle Ages (roughly before AD 500), such as the Classical world or Late Antiquity.","zh":"对欧洲中世纪之前（大约公元500年以前）的社会与文化的兴趣、研究或文化/学术关注，例如古典时代或“晚期古代”。"},"examples":[{"en":"Her research centers on premedievalism, especially the transition from the Roman Empire to early medieval kingdoms.","zh":"她的研究聚焦于前中世纪研究，尤其是从罗马帝国到早期中世纪王国的转变。"},{"en":"The museum’s new exhibit highlights premedievalism through artifacts from Greece, Rome, and Late Antiquity.","zh":"博物馆的新展览通过希腊、罗马与晚期古代的文物来呈现前中世纪主题。"}]}],"synonyms":["pre-medieval studies","classical studies (often related)","Late Antiquity studies (often related)"],"phonetic":"/ˌpriːˌmiːˈdiːvəˌlɪzəm/","extraExplanation":["“premedievalism”并不是日常英语常用词，更多见于学术写作或讨论文化史的语境中。它通常指“前中世纪时期”的研究兴趣或视角，而不是一个具体历史时期本身。","可与“medievalism（中世纪主义/中世纪风）”区分：medievalism常指后世对中世纪的想象、再现与复兴（如文学、电影、建筑中的“中世纪风格”）；premedievalism更偏向把注意力放在中世纪之前的文化与历史。","时间范围会因学科而略有不同：有人用它指古典时代（希腊罗马），也有人更强调“晚期古代”（约公元3–8世纪）这一从古典走向中世纪的过渡阶段。"]}
{"word":"premeditate","summary":{"en":"Premeditate means to plan something in advance, especially a harmful or illegal act.","zh":"Premeditate 指事先计划，尤用于描述有害或违法行为的“预谋”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to think about and plan something (especially a harmful or illegal act) before doing it","zh":"（尤指不良或违法行为）事先考虑并计划；预谋"},"examples":[{"en":"The police believe the attack was premeditated.","zh":"警方认为这次袭击是有预谋的。"},{"en":"He premeditated the robbery for weeks before taking action.","zh":"他在行动前花了数周预谋这次抢劫。"},{"en":"In court, the prosecutor argued it was a premeditated crime.","zh":"在法庭上，检察官主张这是一起预谋犯罪。"}]}],"synonyms":["plan","plot","scheme","devise"],"phonetic":"/priˈmɛdɪˌteɪt/","extraExplanation":["“premeditate”常出现在法律与新闻语境中，强调“事先计划”这一点，常用于区分冲动行为与“有预谋”的行为（如 premeditated murder 常译为“预谋杀人”或“故意杀人”，具体用语因法域与语境而异）。","词源上，pre- 表示“在……之前”，meditate 有“沉思、思考”的意思；合起来就是“事前仔细想过”。"]}
{"word":"premeditated","summary":{"en":"Premeditated means planned beforehand and done deliberately; in law it often refers to a killing planned in advance.","zh":"Premeditated 指事先计划、蓄意做出的；在法律语境中常指预谋杀人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Planned in advance; done on purpose after thinking about it beforehand (not accidental or spontaneous).","zh":"预先计划的；经过事先考虑、蓄意做出的（非偶然或一时冲动）。"},"examples":[{"en":"The attack was premeditated, not a random act.","zh":"这次袭击是蓄意的，并非随机行为。"},{"en":"She wrote a premeditated response instead of replying in anger.","zh":"她没有在气头上回复，而是事先想好后写了回应。"}]},{"partOfSpeech":"adj.","definition":{"en":"In law, describing a killing that was planned beforehand (often used to distinguish first-degree murder from lesser charges).","zh":"（法律）指预谋的杀人行为（常用于区分一级谋杀与较轻罪名）。"},"examples":[{"en":"The prosecutor argued the murder was premeditated.","zh":"检察官主张这是一起预谋杀人。"},{"en":"The jury considered whether there was premeditated intent.","zh":"陪审团在考虑是否存在预谋意图。"}]}],"synonyms":["planned","deliberate","intentional","calculated"],"phonetic":"/priˈmɛdɪˌteɪtɪd/","extraExplanation":["在日常语境里，premeditated 常带有“故意、带恶意”的含义，比 planned 更强调“事先想过、不是临时起意”。如果只是中性地说“安排好”，更常用 planned / scheduled。","词根提示：pre-（在……之前）+ meditate（思考、沉思）。这里的 meditate 不是“打坐”，而是“认真想过”。"]}
{"word":"premeditatedly","summary":{"en":"Premeditatedly means “in a planned, thought-out way beforehand,” often implying intent rather than impulse.","zh":"premeditatedly 指“事先计划、预先考虑过地”，常强调有意为之而非一时冲动。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is planned or considered beforehand (often used about actions, especially harmful or illegal ones).","zh":"以预先计划或事先考虑过的方式（常用于指行为，尤其是有害或违法的行为）。"},"examples":[{"en":"The attack was carried out premeditatedly, not in the heat of the moment.","zh":"这次袭击是有预谋地实施的，并非一时冲动。"},{"en":"She spoke calmly, as if she had premeditatedly chosen every word.","zh":"她说话很平静，仿佛每个词都是事先斟酌好的。"}]}],"synonyms":["deliberately","intentionally","purposefully","with premeditation"],"phonetic":"/ˌpriːˈmɛdɪˌteɪtɪdli/","extraExplanation":["“premeditatedly”来自“premeditate（预先思考/预谋）”，其中“pre-”表示“在……之前”，“meditate”本义是“沉思”。在法律语境里，它常用来强调行为并非冲动，而是事先计划，因此可能影响对责任程度的判断。","语气上，“premeditatedly”往往带有负面或严肃色彩（如犯罪、伤害、欺骗）；如果只是表达“认真准备/深思熟虑”，更常用“deliberately”“intentionally”或“after careful thought”。"]}
{"word":"premeditatedness","summary":{"en":"Premeditatedness means the quality of being planned beforehand rather than done on impulse.","zh":"Premeditatedness 指“预先计划、非冲动行事”的性质，即预谋性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being planned in advance; the fact that something was done on purpose after thinking about it beforehand","zh":"预先策划（深思熟虑后再行动）的性质；预谋性"},"examples":[{"en":"The prosecutor tried to prove the premeditatedness of the attack.","zh":"检察官试图证明这次袭击具有预谋性。"},{"en":"The notes on his phone suggested premeditatedness rather than an impulsive decision.","zh":"他手机里的笔记表明这是有预谋的，而不是一时冲动的决定。"}]}],"synonyms":["premeditation","planning","forethought","intentionality","deliberateness"],"phonetic":"/ˌpriːməˈdɪteɪtɪdnəs/","extraExplanation":["这个词在日常口语中不算常见，更常见的表达是 **premeditation**（预谋/预先计划）。**premeditatedness** 更强调“具有预谋这一性质/程度”，因此在法律写作或正式论证中更容易出现。","在美国法律语境中，证明行为的“预谋性”（premeditation）常与是否构成更严重的罪名相关；但不同州的定义与要求不完全一致。"]}
{"word":"premeditates","summary":{"en":"“Premeditates” means “thinks or plans ahead of time,” often implying deliberate planning, especially in legal contexts.","zh":"“premeditates”表示“事先思考或预先策划”，在法律语境中常带“蓄意预谋”的含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to think about something in advance; to consider it before acting","zh":"事先思考；预先考虑（在行动前先想好）"},"examples":[{"en":"She premeditates before making big decisions.","zh":"她在做重大决定前会事先仔细思考。"},{"en":"He rarely premeditates; he often acts on impulse.","zh":"他很少预先考虑；经常冲动行事。"}]},{"partOfSpeech":"vt.","definition":{"en":"(often in law) to plan something deliberately ahead of time, especially a harmful or illegal act","zh":"（常用于法律）预谋；蓄意事先策划（尤指伤害或违法行为）"},"examples":[{"en":"The prosecutor argued that he premeditates the attack.","zh":"检察官主张他是预谋这次袭击。"},{"en":"Premeditates violence is treated more seriously than a sudden fight.","zh":"预谋的暴力行为通常比一时冲突更严重。"}]}],"synonyms":["plans","intends","considers","plots","schemes","deliberates"],"phonetic":"/priˈmɛdəˌteɪt/","extraExplanation":["“premeditate”由“pre-（预先）+ meditate（沉思、思考）”构成，字面是“提前思考”。在日常英语里可指“提前想好”；但在新闻与法律语境中更常指“预谋”，例如“premeditated murder（预谋杀人）”。","词形提示：你输入的是第三人称单数现在时“premeditates”（he/she/it premeditates）。常见搭配：premeditate a crime/attack（预谋犯罪/袭击）；act without premeditation（毫无预谋地行动）。"]}
{"word":"premeditating","summary":{"en":"Premeditating means planning something in advance (often something harmful), rather than acting impulsively.","zh":"premeditating 指事先筹划、预先谋划（常指不好的事），而不是一时冲动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"thinking about and planning something (especially a harmful act) before doing it; considering it in advance","zh":"事先考虑并计划某事（尤指不好的或有害的行为）；预先谋划"},"examples":[{"en":"He was premeditating the whole time, pretending it was a sudden decision.","zh":"他一直在预先谋划，还假装这是临时决定。"},{"en":"The messages suggest she was premeditating revenge for weeks.","zh":"这些信息表明她几周前就在预谋报复。"}]},{"partOfSpeech":"adj.","definition":{"en":"(law) planned in advance and not done on impulse","zh":"（法律）事先策划的；非一时冲动的"},"examples":[{"en":"The prosecutor argued the attack was premeditating, not accidental.","zh":"检察官认为这次袭击是事先策划的，并非意外。"},{"en":"Premeditating intent can affect how serious the charge is.","zh":"预谋的意图会影响指控的严重程度。"}]}],"synonyms":["planning","plotting","scheming","deliberating","calculating"],"phonetic":"/priˈmɛdəˌteɪtɪŋ/","extraExplanation":["在英语里，premeditating 常出现在法律或犯罪语境中，强调“事先计划、冷静思考过”，与 on impulse（冲动之下）形成对比。","相关概念：premeditated murder（预谋杀人）。是否“预谋”往往会影响定罪类别与量刑轻重。","词源提示：pre-（在……之前）+ meditate（沉思、深思），字面意思就是“事先深思”。"]}
{"word":"premeditatingly","summary":{"en":"“Premeditatingly” means doing something in a planned, pre-thought-out way, often implying intent or wrongdoing.","zh":"“premeditatingly”指以事先筹划的方式去做某事，常带有“有意/预谋（做坏事）”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is planned or decided in advance (especially about doing something harmful or wrong).","zh":"以预先计划、事先决定的方式（尤指做有害或错误的事）。"},"examples":[{"en":"The prosecutor argued that he acted premeditatingly, not in the heat of the moment.","zh":"检方主张他是预谋行事，而不是一时冲动。"},{"en":"She spoke calmly, almost premeditatingly, as if every word had been prepared.","zh":"她说话很平静，几乎像是事先想好了每个词。"}]}],"synonyms":["premeditatedly","deliberately","intentionally","purposefully","with premeditation"],"phonetic":"/priːˈmɛdəˌteɪtɪŋli/","extraExplanation":["“premeditatingly”来自“premeditate”（预先谋划、预谋）+ 副词后缀“-ly”。在法律语境里常用来强调“有预谋”，与“spur-of-the-moment”（一时冲动）形成对比。","这个词在日常口语中较少见，更常见的表达是“with premeditation”（有预谋地）或“premeditatedly”（有预谋地）。两者意思接近，但“premeditatedly”更常用。"]}
{"word":"premeditation","summary":{"en":"Premeditation means planning something in advance—especially planning a crime before it happens.","zh":"premeditation 指事先计划，尤指在犯罪发生前的预谋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Careful planning of an action before doing it, especially planning a crime ahead of time.","zh":"事先的周密计划；（尤指）预谋（犯罪）"},"examples":[{"en":"The prosecutor argued that the murder involved premeditation.","zh":"检方主张这起谋杀案属于预谋。"},{"en":"There was no sign of premeditation; it seemed like a sudden decision.","zh":"没有预谋的迹象；看起来像是临时起意。"}]},{"partOfSpeech":"n.","definition":{"en":"In law, the fact of thinking about and deciding to commit a crime before it happens (often used to distinguish first-degree murder from other types).","zh":"（法律）预先考虑并决定实施犯罪这一事实（常用于区分一级谋杀与其他类型）"},"examples":[{"en":"To prove first-degree murder, the state must show intent and premeditation.","zh":"要证明一级谋杀，控方必须证明意图和预谋。"},{"en":"The defense challenged whether there was enough time for premeditation.","zh":"辩方质疑是否有足够时间形成预谋。"}]}],"synonyms":["planning","forethought","prior intent","plotting","deliberation"],"phonetic":"/priˌmɛdɪˈteɪʃən/","extraExplanation":["“premeditation”来自拉丁语前缀 pre-（在前）+ meditation（思考、沉思）。日常英语里它常带有“带着目的、提前算计”的负面色彩，最常出现在犯罪或伦理讨论中。","常见搭配：with premeditation（有预谋地）、evidence/proof of premeditation（预谋的证据）、lack of premeditation（缺乏预谋）。相关词：premeditate（v. 预谋）、premeditated（adj. 预谋的）。"]}
{"word":"premeditations","summary":{"en":"Premeditations means plans or thoughts made beforehand, often implying intention; in law, it refers to prior intent to commit a crime.","zh":"premeditations 指事先的思考与策划，常带“蓄意”含义；在法律中指犯罪的预谋与先前意图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"careful planning or thinking about something before doing it (often implying the act is intentional)","zh":"事先的深思熟虑；预先策划（常含“故意、蓄意”的意味）"},"examples":[{"en":"The policy changes were not an accident; they were the result of months of premeditation.","zh":"这些政策变化不是偶然的，而是几个月深思熟虑的结果。"},{"en":"She spoke with such calm premeditation that everyone knew she had prepared her words.","zh":"她说话冷静而有预谋，大家都看得出来她事先准备过措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"(law) prior intent and planning to commit a crime, especially used to distinguish degrees of murder","zh":"（法律）预谋；预先意图并策划犯罪（尤用于区分谋杀的不同等级）"},"examples":[{"en":"Prosecutors tried to prove premeditation by showing he bought the weapon days earlier.","zh":"检方试图通过证明他几天前就购买了武器来证明存在预谋。"},{"en":"Without evidence of premeditation, the charge may be reduced.","zh":"如果没有预谋的证据，指控可能会被降低。"}]}],"synonyms":["planning","forethought","prior consideration","deliberation","intention","design"],"phonetic":"/ˌpriːˌmɛdɪˈteɪʃənz/","extraExplanation":["“premeditation(s)”常见于法律与新闻语境，尤其与“first-degree murder（一等谋杀）”相关。一般说来，是否“premeditated（预谋的）”会影响罪名与量刑，但具体标准因地区法律而异。","词形上，“premeditation”多为不可数名词；当强调“多次/多种预先考虑或筹划”时可用复数“premeditations”。"]}
{"word":"premeditative","summary":{"en":"Premeditative means planned in advance and done deliberately, often used in legal or formal contexts.","zh":"Premeditative 指“事先策划、蓄意而为”，常用于法律或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an act, especially a crime) planned in advance; done deliberately after thinking about it beforehand.","zh":"（尤指犯罪行为）预先策划的；蓄意的；事先考虑过后故意实施的。"},"examples":[{"en":"The prosecutor argued that the attack was premeditative, not spontaneous.","zh":"检察官认为这次袭击是蓄意预谋的，而不是一时冲动。"},{"en":"Leaving a note made the act seem more premeditative.","zh":"留下字条让这件事显得更像是事先策划的。"}]}],"synonyms":["premeditated","planned","deliberate","intentional"],"phonetic":"/priˈmɛdəˌteɪtɪv/","extraExplanation":["“premeditative”较常见于法律或正式语境，更常用的形容词是“premeditated”（如：premeditated murder 预谋杀人）。两者意思接近，但“premeditated”更固定、更常用。","词根提示：pre-（在……之前）+ meditate（思考、沉思）→ 事先想过的、预谋的。"]}
{"word":"premeditator","summary":{"en":"A premeditator is someone who plans a harmful or criminal act ahead of time.","zh":"premeditator 指事先预谋、提前策划（多用于严重犯罪）的那个人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who plans a harmful or criminal act in advance (especially a murder)","zh":"预谋者；事先策划（尤其是谋杀等严重犯罪）的人"},"examples":[{"en":"The prosecutor argued that the defendant was a premeditator, not acting on impulse.","zh":"检察官认为被告是预谋者，并非一时冲动。"},{"en":"Investigators looked for messages that could show he was a premeditator.","zh":"调查人员寻找可能证明他曾预谋的讯息。"}]}],"synonyms":["plotter","planner","schemer","conspirator"],"phonetic":"/ˌpriːˈmɛdɪˌteɪtər/","extraExplanation":["“Premeditator”来自动词“premeditate”（预先思考/预谋）+ 表示“做某事的人”的后缀“-or”。在法律语境中，它常用来强调行为具有“事先计划”的性质。","更常见的说法是“premeditated”作形容词（如：a premeditated murder 预谋杀人）或名词短语“the perpetrator planned it”（作案者计划过）。日常英语里“premeditator”相对少见，多见于新闻或法律报道。"]}
{"word":"premeditators","summary":{"en":"Premeditators are people who plan actions—often crimes—in advance.","zh":"Premeditators 指事先计划行动的人，常用于描述有预谋的犯罪者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who plan something (especially a crime) in advance; those who act with forethought rather than on impulse","zh":"预先策划者；（尤指犯罪的）预谋者；事先计划的人"},"examples":[{"en":"The investigators believed the attackers were premeditators, not impulsive vandals.","zh":"调查人员认为袭击者是有预谋的策划者，而不是一时冲动的破坏者。"},{"en":"In court, the prosecutor argued that the defendants were premeditators who had carefully prepared the plan.","zh":"在法庭上，检察官辩称被告是预谋者，曾精心准备计划。"}]}],"synonyms":["planners","plotters","schemers","conspirators"],"phonetic":"/priˈmɛdɪˌteɪtərz/","extraExplanation":["“premeditator”来自动词“premeditate”（预先谋划）。在法律语境中，是否“premeditated”（有预谋的）常关系到罪名轻重与量刑，例如区分“冲动行凶”与“事先策划”。","日常英语里这个词不算常用，更常见的说法是“planner”（计划者）或在犯罪语境中用“someone who planned it in advance”（事先策划的人）。"]}
{"word":"premeds","summary":{"en":"Premeds are students preparing to apply to medical school.","zh":"premeds 指准备申请医学院的学生（医学预科生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Students who plan to apply to medical school; premedical students.","zh":"（非正式）准备申请医学院的学生；医学预科生。"},"examples":[{"en":"She’s one of the top premeds in her class.","zh":"她是班里最优秀的医学预科生之一。"},{"en":"Many premeds volunteer at hospitals to gain experience.","zh":"很多医学预科生会去医院做志愿者来积累经验。"},{"en":"The premeds formed a study group for organic chemistry.","zh":"医学预科生们为有机化学组了一个学习小组。"}]}],"synonyms":["premedical students","pre-meds","pre-med students"],"phonetic":"/ˈpriːmɛdz/","extraExplanation":["在美国大学里，premed（或 pre-med）通常不是一个独立专业，而是一条“申请医学院的方向/轨道”。学生可能主修生物、化学、心理学等，同时完成医学院要求的先修课（如生物、普通化学/有机化学、物理等），并准备 MCAT 等。","写法上常见：premed（最常见）、pre-med（较正式）、premeds（复数）。口语里也会说：I’m premed.（我是走医学院申请路线的。）"]}
{"word":"premeet","summary":{"en":"“Premeet” means to meet before the main event or official meeting.","zh":"“premeet”指在主要活动或正式会议之前先见面/先开个预备会。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to meet (someone) before a main event or official meeting; to have a preliminary meeting","zh":"在主要活动或正式会议前先见面；进行预先会谈"},"examples":[{"en":"Let’s premeet for 10 minutes to align on the agenda.","zh":"我们先预会 10 分钟，把议程对齐。"},{"en":"The host premet the speakers online to test their audio.","zh":"主持人提前在线与讲者见面，测试他们的音频。"}]}],"synonyms":["meet beforehand","meet in advance","have a pre-meeting","touch base (beforehand)"],"phonetic":"/ˌpriːˈmiːt/","extraExplanation":["“premeet”在标准英语中非常少见，更多见于口语、公司内部沟通或临时造词。更常见、更自然的表达是：meet beforehand / meet in advance / have a pre-meeting。","书写上常用连字符“pre-meet”（更清晰），过去式可写作“pre-met”（也有人写“premet”，但不太规范）。","在正式邮件或对外文档中，建议用“a pre-meeting”（预备会议）或“a brief meeting beforehand”（事前简短会面）来避免读者困惑。"]}
{"word":"premegalithic","summary":{"en":"Premegalithic describes things from a time before megalithic (large-stone) monuments or the megalithic period.","zh":"premegalithic 指巨石文化（大型石构遗迹）出现之前的时期或事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaeology) Happening before, or belonging to a time earlier than, the megalithic period or megalithic monuments (large-stone structures such as dolmens and stone circles).","zh":"（考古）发生在巨石文化时期之前的；属于早于巨石遗迹（如支石墓、石圈等大型石构建筑）时代的。"},"examples":[{"en":"Archaeologists found premegalithic pottery beneath the stone tombs.","zh":"考古学家在石墓下方发现了巨石文化之前的陶器。"},{"en":"The site includes a premegalithic settlement layer and a later megalithic burial area.","zh":"该遗址包含一层巨石文化之前的聚落遗存，以及较晚期的巨石文化墓葬区。"}]}],"synonyms":["pre-megalithic","before the megalithic period","predating megalithic monuments"],"phonetic":"/ˌpriˌmɛɡəˈlɪθɪk/","extraExplanation":["“premegalithic”由前缀 pre-（在……之前）+ megalithic（巨石文化的）构成。常见于考古与史前研究写作，用来说明某些遗物、地层或文化阶段早于巨石遗迹兴建的时期。","“巨石文化/巨石遗迹”（megalithic monuments）通常指用巨大石块建造的史前建筑，如欧洲常见的 dolmen（支石墓）、menhir（立石）与 stone circle（石圈）。不同地区的“巨石时期”年代并不完全一致，因此该词更多是相对时间概念：强调“在当地巨石建造传统出现之前”。"]}
{"word":"premeiotic","summary":{"en":"Premeiotic describes something that occurs before meiosis or is related to the stage before meiotic division.","zh":"premeiotic 指“减数分裂之前的”，或“与减数分裂前阶段有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Happening before meiosis begins, or relating to the stage before meiotic cell division.","zh":"（生物）减数分裂开始之前发生的；或与减数分裂前阶段有关的。"},"examples":[{"en":"In many animals, premeiotic DNA replication occurs before meiosis I.","zh":"在许多动物中，减数分裂前的 DNA 复制发生在减数分裂 I 之前。"},{"en":"Researchers compared premeiotic germ cells with cells actively undergoing meiosis.","zh":"研究人员将减数分裂前的生殖细胞与正在进行减数分裂的细胞进行了比较。"}]}],"synonyms":["pre-meiotic","before meiosis","prematuration (context-dependent)"],"phonetic":"/ˌpriːmaɪˈɑːtɪk/","extraExplanation":["“pre-” 表示“在……之前”，而 “meiotic” 来自 “meiosis（减数分裂）”。因此 premeiotic 常用于遗传学与发育生物学语境，描述生殖细胞在进入减数分裂程序前的阶段（例如进入减数分裂前的准备、DNA 复制或基因表达变化）。","学习提示：不要把 premeiotic 和 “mitotic（有丝分裂的）” 混淆；前者强调“进入减数分裂之前”，后者强调“与有丝分裂相关”。"]}
{"word":"prememoda","summary":{"en":"“prememoda” isn’t a standard English word; you may mean “pre-med” (premedical).","zh":"“prememoda”不是标准英语单词；你可能想写的是“pre-med”（医学预科/医学院申请准备方向）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a typed-together form of “pre-med” (short for premedical), meaning a course of study preparing a student for medical school.","zh":"不是标准英语单词。它看起来像是拼写错误，或把“pre-med”（premedical 的简称）连在一起输入；“pre-med”指为申请医学院做准备的学习方向/课程。"},"examples":[{"en":"She’s pre-med and plans to apply to medical school next year.","zh":"她是 pre-med（医学预科方向），计划明年申请医学院。"},{"en":"I’m taking biology and chemistry because I’m on a pre-med track.","zh":"我在上生物和化学课，因为我走的是 pre-med（医学预科）路线。"}]},{"partOfSpeech":"other","definition":{"en":"If you meant “pre-memo” or “prememo,” it is not a common set term in English; people would usually say “a brief memo in advance” or “a pre-meeting memo.”","zh":"如果你想写的是“pre-memo / prememo”，它并不是英语里的常见固定说法；更常见的表达是“提前发的简短备忘录”或“会前备忘录（pre-meeting memo）”。"},"examples":[{"en":"Can you send a pre-meeting memo outlining the main points?","zh":"你能发一份会前备忘录，把要点列出来吗？"}]}],"synonyms":["pre-med","premedical","pre-med track"],"phonetic":"/ˈpriˌmɛd/","extraExplanation":["“pre-”是常见前缀，表示“在……之前/预先”。例如：preheat（预热）、prepay（预付）、preorder（预订）。\n如果你告诉我你想表达的语境（学习、工作邮件、还是某个产品/名字），我可以帮你确认最可能的正确拼写和最自然的英文表达。"]}
{"word":"prememoranda","summary":{"en":"Prememoranda means rare, formal advance reminder notes—things written down beforehand to remember later.","zh":"prememoranda 指（罕见、正式）“预先写下的备忘事项”，用于之后提醒自己记住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) Notes or items written down in advance as reminders; things to be remembered beforehand.","zh":"（罕见，正式）预先写下的备忘事项；提前记录以提醒自己要记住的内容。"},"examples":[{"en":"Before the meeting, she reviewed her prememoranda so she wouldn’t miss any key points.","zh":"开会前，她复习了自己预先写下的备忘事项，免得漏掉关键点。"},{"en":"The lawyer kept prememoranda of the deadlines and documents to file.","zh":"律师把截止日期和要提交的文件预先记成备忘事项。"}]}],"synonyms":["memoranda","memos","notes","reminders","aide-mémoire"],"phonetic":"/ˌpriˌmɛməˈrændə/","extraExplanation":["这个词非常少见，常被当作“memoranda（备忘录/备忘事项）”的变体或带有拉丁式风格的用法；实际写作中更常用：memoranda / memos / notes.","词形提示：memorandum（单数）→ memoranda（复数）；如果你想表达“提前准备的提醒清单”，用“prepared notes”或“a checklist”会更自然。"]}
{"word":"prememorandum","summary":{"en":"A rare term meaning a preliminary or draft memorandum written before the final memo.","zh":"一个较少见的词，指在正式备忘录之前写的预备/草拟备忘录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preliminary memorandum; a short written note or document prepared before a final (official) memo or report","zh":"预备备忘录；（在正式备忘录/报告之前写的）初步说明或简短记录"},"examples":[{"en":"Before sending the official memo, she drafted a prememorandum to organize her main points.","zh":"在发送正式备忘录之前，她先写了一份预备备忘录来整理要点。"},{"en":"The team shared a prememorandum outlining possible risks and next steps.","zh":"团队分享了一份预备备忘录，概述了可能的风险和下一步。"}]}],"synonyms":["preliminary memorandum","draft memo","working memo","informal memo"],"phonetic":"/ˌpriːˌmɛməˈrændəm/","extraExplanation":["“prememorandum”在现代英语中非常少见，更常见的表达是“preliminary memorandum”“draft memo”或“working memo”。也常写成带连字符的“pre-memorandum”。","词根上可以理解为前缀“pre-（在……之前）”+“memorandum（备忘录）”。在商务、法律或行政写作里，用更常规的搭配会更自然、更易懂。"]}
{"word":"prememorandums","summary":{"en":"Prememorandums are preliminary notes or draft memos made before a formal memorandum.","zh":"prememorandums 指正式备忘录之前的初步笔记或草拟备忘（用法很少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pre-memorandum: informal term for preliminary notes or draft memos written before a formal memorandum.","zh":"pre-memorandum 的复数：非正式用法，指在正式备忘录（memorandum）之前写的初步笔记或草拟备忘。"},"examples":[{"en":"Before the meeting, she circulated a few prememorandums to outline the key issues.","zh":"开会前，她发了几份 prememorandums 来概述关键问题。"},{"en":"The team’s prememorandums later became the basis for the final memo.","zh":"团队的这些 prememorandums 后来成了最终备忘录的基础。"}]}],"synonyms":["preliminary memos","draft memos","pre-meeting notes","working notes"],"phonetic":"/ˌpriːˌmɛməˈrændəmz/","extraExplanation":["这个词在真实英语中非常少见，更多时候人们会说 preliminary memos / draft memos / pre-meeting notes（会议前笔记）。","注意：memorandum 的常见复数是 memoranda（较正式/学术）或 memorandums（较口语/一般）。如果你想表达“备忘录们”，通常直接用 memoranda 或 memorandums 就够了。"]}
{"word":"premen","summary":{"en":"“Premen” is not a standard word; it’s usually an informal abbreviation for “premenstrual” (and sometimes “premenopausal”).","zh":"“premen”不是标准英语词，通常是“premenstrual（经前的）”（有时也指“premenopausal（绝经前的）”）的非正式缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) An informal abbreviation used in some medical notes to mean “premenstrual” (before a menstrual period) or sometimes “premenopausal” (before menopause).","zh":"（非标准词）在一些医疗记录中作为缩写使用，常指“经前的”（premenstrual，经期来临之前），有时也指“绝经前的”（premenopausal）。"},"examples":[{"en":"The chart notes say “premen symptoms,” meaning symptoms before the period starts.","zh":"病历里写“premen symptoms”，意思是月经来之前的症状。"},{"en":"If you see “premen,” ask the writer whether they mean premenstrual or premenopausal.","zh":"如果你看到“premen”，最好确认对方指的是“经前”还是“绝经前”。"}]}],"synonyms":["premenstrual (common full form)","premenopausal (possible full form)"],"phonetic":"/ˈpriːmɛn/","extraExplanation":["“premen”本身不是常见的标准英语单词，更像是口语/笔记里的简写。正式写作中建议直接写清楚：premenstrual（经前的）或 premenopausal（绝经前的），避免歧义。"]}
{"word":"premenace","summary":{"en":"Premenace is a rare word meaning an advance warning or threat, sometimes also used as a verb meaning to threaten beforehand.","zh":"Premenace是一个罕见词，指“预先的警告或威胁”，有时也可作动词表示“事先威胁/预警”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warning or threat given in advance; an indication that something harmful may happen","zh":"（罕见/古旧）预先的威胁；事先的警告；不祥的预兆"},"examples":[{"en":"The sudden silence felt like a premenace before the storm hit.","zh":"突如其来的寂静像暴风雨来临前的不祥预兆。"},{"en":"His letter carried a premenace: comply, or face consequences.","zh":"他的信里带着预先的威胁：照办，否则将承担后果。"}]},{"partOfSpeech":"vt.","definition":{"en":"to threaten or warn beforehand (rare)","zh":"（罕见）事先威胁；预先警告"},"examples":[{"en":"They tried to premenace the witness into staying silent.","zh":"他们试图事先威胁证人保持沉默。"}]}],"synonyms":["forewarning","warning","threat","omen","portent"],"phonetic":"/priˈmɛnəs/","extraExplanation":["“premenace”非常少见，多数现代英语中更常用的表达是：warning（警告）、threat（威胁）、forewarning（预警）、omen（不祥预兆）。","容易与“premonition（预感）”混淆：premonition强调“心里的预感”，而premenace更偏“外在的威胁/预警”或“带威胁意味的预兆”。"]}
{"word":"premenaced","summary":{"en":"“Premenaced” is a very rare word meaning “threatened beforehand.”","zh":"“premenaced”非常少见，通常表示“预先受到威胁/事先被恐吓”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) threatened or intimidated in advance; already menaced beforehand.","zh":"（非常少见）预先受到威胁的；事先被恐吓的。"},"examples":[{"en":"The villagers felt premenaced by rumors of attack long before any soldiers arrived.","zh":"士兵到来之前很久，村民就因袭击传闻而感到自己已被预先威胁。"},{"en":"She spoke cautiously, as if the meeting were premenaced by conflict.","zh":"她说话很谨慎，仿佛这次会面早已被冲突阴影预先笼罩。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “pre-menace” (to menace beforehand).","zh":"“pre-menace”（预先威胁）的过去式/过去分词。"},"examples":[{"en":"The letter premenaced legal action if they didn’t pay within seven days.","zh":"信中预先威胁称若七天内不付款将采取法律行动。"}]}],"synonyms":["threatened","intimidated","menaced","under threat"],"phonetic":"/ˌpriːˈmɛnəst/","extraExplanation":["“premenaced”不是现代英语里的常用词，很多词典里也查不到。实际阅读中更常见的是 menaced（被威胁的）或 threatened（被威胁的）。如果你是在文学作品/旧文本里看到它，通常可理解为“事先就被威胁”。","也可能是拼写或识别错误：常被混淆的词有 premeditated（预谋的）和 menacing（威胁性的）。如果你能提供原句，我可以帮你更准确判断含义。"]}
{"word":"premenacing","summary":{"en":"A rare adjective meaning “already sounding/looking threatening ahead of time.”","zh":"一个较罕见的形容词，指“提前就显得有威胁、不祥的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) seeming threatening in advance; giving an early hint that something dangerous or unpleasant may happen.","zh":"（罕见）预先显得有威胁的；提前显露出可能发生危险或不愉快事情的迹象。"},"examples":[{"en":"The premenacing silence before the storm made everyone uneasy.","zh":"暴风雨来临前那种预先显得不祥的寂静，让大家都感到不安。"},{"en":"In the novel, the author uses premenacing details—dark clouds and sudden cold—to build tension.","zh":"在小说里，作者用一些预先显得不祥的细节——乌云和骤冷——来营造紧张感。"}]}],"synonyms":["ominous","foreboding","threatening","sinister"],"phonetic":"ˌpriːˈmɛnəsɪŋ","extraExplanation":["“premenacing”不是常见词，更常见的表达是“ominous（不祥的）”“foreboding（预感不妙的）”或“menacing（有威胁的）”。","构词上可理解为前缀“pre-（在……之前）”+“menacing（威胁的）”，意思是“还没真正变得危险/可怕之前，就已经让人感觉到威胁”。","如果你是在某篇文章里看到它，也可能是作者的临时造词（nonce word），用来强调“早早就透出威胁感”的氛围。"]}
{"word":"premenopausal","summary":{"en":"Premenopausal means “before menopause.”","zh":"premenopausal 意为“绝经前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a woman) relating to the time before menopause, when menstrual periods have not permanently stopped yet.","zh":"（女性）绝经前的；与绝经前阶段有关的（此时月经尚未永久停止）。"},"examples":[{"en":"Premenopausal women can still become pregnant, so reliable contraception may be needed.","zh":"绝经前女性仍可能怀孕，因此可能需要可靠的避孕方式。"},{"en":"The doctor explained that her symptoms were common in premenopausal years.","zh":"医生解释说，她的症状在绝经前几年很常见。"}]}],"synonyms":["before menopause","not yet menopausal"],"phonetic":"/ˌpriːˌmɛnəˈpɔːzəl/","extraExplanation":["“premenopausal”由前缀 pre-（“在……之前”）+ menopausal（“绝经的”）构成，是医学与健康语境中常见的正式用词。","相关词：menopause（绝经）、perimenopausal（围绝经期的：绝经前后过渡阶段）、postmenopausal（绝经后的）。它们描述的是不同生理阶段，不是疾病本身。"]}
{"word":"premenstrual","summary":{"en":"Premenstrual means “before a period,” or related to changes that happen before menstruation (often PMS).","zh":"premenstrual 指“月经来之前的；经前的”，也可指与经前变化有关（常见于PMS，经前综合征）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before menstruation (the monthly period).","zh":"发生在月经来临之前的；经前的。"},"examples":[{"en":"Many people feel tired or moody in the premenstrual days.","zh":"很多人在经前几天会感到疲惫或情绪波动。"},{"en":"She gets premenstrual cramps the week before her period.","zh":"她在月经来之前的一周会有经前腹痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the physical or emotional changes that can happen before a period (often in the phrase “premenstrual syndrome/PMS”).","zh":"与月经前可能出现的身体或情绪变化有关的（常用于短语“经前综合征/PMS”）。"},"examples":[{"en":"The doctor discussed premenstrual symptoms like bloating and headaches.","zh":"医生讨论了经前症状，如腹胀和头痛。"},{"en":"Regular sleep can help reduce premenstrual irritability for some people.","zh":"规律睡眠对一些人有助于减轻经前易怒。"}]}],"synonyms":["pre-period","before a period","PMS-related"],"phonetic":"/ˌpriːˈmɛnstruəl/","extraExplanation":["“premenstrual”由前缀 pre-（在……之前）+ menstrual（与月经有关的）组成，字面意思就是“月经之前的”。","日常表达里更常见的是说“before my period / before her period”，医学或健康话题中常见“premenstrual”以及“PMS（premenstrual syndrome，经前综合征）”。","与之相关、但不同的词有：“menstrual”（经期的），“postmenstrual”（经后/经期之后的）。"]}
{"word":"premenstrually","summary":{"en":"Premenstrually means “during or in relation to the time before a menstrual period starts.”","zh":"premenstrually 意为“在月经开始之前的时期；经前地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the time before menstruation begins (before a period).","zh":"以与月经开始前（经前）这段时间有关的方式；经前地。"},"examples":[{"en":"Some people feel more tired premenstrually.","zh":"有些人在经前会觉得更疲惫。"},{"en":"She noticed her skin breaks out premenstrually.","zh":"她发现自己经前皮肤更容易长痘。"}]}],"synonyms":["before a period","in the premenstrual phase","prior to menstruation"],"phonetic":"/ˌpriːˈmɛnstr(u)əli/","extraExplanation":["“premenstrually”来自前缀 pre-（在……之前）+ menstrual（与月经有关的）+ -ly（副词后缀）。常用于健康科普或医学语境中，比口语里的 “before my period” 更正式。","日常更常见的说法有：premenstrual（形容词，如 premenstrual symptoms 经前症状）、PMS（经前综合征）。在交流中注意尊重与隐私：可以用更中性的表达，如 “around that time of the month / before my period”。"]}
{"word":"premention","summary":{"en":"Premention means to mention something in advance; it can also refer to that earlier mention.","zh":"premention 指“预先提到/提前提及”；也可指“那次预先的提到”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mention something earlier or beforehand (usually before a main point or later discussion)","zh":"（在主要内容或后续讨论之前）预先提到、提前提及"},"examples":[{"en":"I should premention that this report is based on a small sample.","zh":"我得先说明一下，这份报告基于的样本量不大。"},{"en":"She prementioned the deadline so no one would be surprised later.","zh":"她提前提到了截止日期，这样之后大家就不会感到意外。"}]},{"partOfSpeech":"n.","definition":{"en":"an earlier mention of something; a prior reference","zh":"预先提及；先前的提到"},"examples":[{"en":"Thanks to the premention, the audience already understood the key term.","zh":"因为事先提到过，听众已经理解了这个关键词。"}]}],"synonyms":["mention beforehand","mention in advance","mention earlier","previously mention","foremention"],"phonetic":"/ˌpriːˈmɛnʃən/","extraExplanation":["“premention”在日常英语中不算常用，写作和口语里更自然的说法通常是“mention beforehand / mention earlier / previously mention”。不过在较正式或说明性的语境中，用“premention”也能被理解。","构词上：pre- 表示“在……之前”，mention 表示“提到”。因此整体意思就是“先提到”。"]}
{"word":"premere","summary":{"en":"*Premere* is a Latin verb meaning “to press,” used both literally (physical pressure) and figuratively (to burden or oppress).","zh":"*Premere* 是拉丁语动词，意思是“按、压”，既可指具体的挤压动作，也可引申为“使人感到压迫或负担”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to press (down/on); to squeeze or compress","zh":"按；压；挤压（使变紧或变扁）"},"examples":[{"en":"In Latin, *premere* means “to press,” and it’s related to the English word *press*.","zh":"在拉丁语里，*premere* 的意思是“按、压”，与英语 *press* 同源。"},{"en":"The poet uses *premere* to suggest a heavy force pressing down.","zh":"诗人用 *premere* 来表达一种沉重的力量“压下来”。"}]},{"partOfSpeech":"v.","definition":{"en":"to burden or oppress (figuratively: to “press” someone mentally or socially)","zh":"（引申）使负担沉重；压迫（心理或社会层面的“压”）"},"examples":[{"en":"In some Latin texts, *premere* can describe worries that “press” the mind.","zh":"在一些拉丁文作品中，*premere* 可用来写“忧虑压在心头”。"},{"en":"The idea is not physical pressure, but pressure from fear or duty.","zh":"这里不是身体的压力，而是来自恐惧或责任的压力。"}]}],"synonyms":["press","squeeze","compress","oppress","burden"],"phonetic":"/ˈprɛməreɪ/","extraExplanation":["“premere”主要见于拉丁语（也可见于意大利语形式相同的动词），核心意象是“向下施力”。英语里的 press、pressure、oppress、compress 等词都与这一词根有关（通过拉丁语/法语传入）。","文学上它常被用来营造“重量、压迫感”的画面：既可以是具体的“压住、按住”，也可以是抽象的“忧虑、责任、权力带来的压迫”。"]}
{"word":"premeridian","summary":{"en":"Premeridian means “before noon; a.m.”","zh":"premeridian 指“中午之前的；上午的（a.m.）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of time) happening before noon; a.m.","zh":"（时间）中午之前的；上午的（a.m.）"},"examples":[{"en":"Our meeting is scheduled for a premeridian hour, so it starts before lunch.","zh":"我们的会议安排在上午，所以会在午饭前开始。"},{"en":"The train has both premeridian and afternoon departures.","zh":"这趟火车既有上午班次，也有下午班次。"}]}],"synonyms":["antemeridian","A.M.","forenoon"],"phonetic":"/ˌpriːməˈrɪdiən/","extraExplanation":["“premeridian”由前缀 pre-（在……之前）+ meridian（子午线；正午）构成，字面意思是“在正午之前”。在现代英语里更常用 antemeridian 或缩写 A.M. 表达“上午/中午之前”。","在较正式或较旧的用法中，你可能会在天文学、航海或时间记录语境里见到它，用来与 postmeridian / P.M.（下午、正午之后）对照。"]}
{"word":"premerit","summary":{"en":"“Premerit” is not a standard English word; it’s likely a misspelling (often of “premedit”) or a nonstandard coinage.","zh":"“premerit”不是标准英语单词；多半是拼写错误（常见为“premedit”）或非标准造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a made-up form. People sometimes intend to write “premedit” (to plan in advance) or “pre-merit” (not common; could mean merit beforehand in a specific context).","zh":"不是标准英语单词。它很可能是拼写错误或临时造词。很多情况下，人们可能想写的是“premedit”（预先策划/预谋）或“pre-merit”（不常见，可能在特定语境里表示“事先的功绩/先行的价值评估”）。"},"examples":[{"en":"I couldn’t find “premerit” in a dictionary—did you mean “premedit”?","zh":"我在词典里找不到“premerit”——你是想写“premedit”吗？"},{"en":"In legal writing, “premeditated” is common, but “premerit” isn’t used.","zh":"在法律写作中，“premeditated（有预谋的）”很常见，但“premerit”并不用。"}]}],"synonyms":["premedit","premeditated","merit","deserve"],"phonetic":"/priːˈmɛrɪt/","extraExplanation":["如果你想表达“预谋/事先计划”，正确拼写通常是 **premedit**（动词）或 **premeditated**（形容词，如 *premeditated murder* 预谋杀人）。","如果你是想表达“优点/功绩”，常用词是 **merit**（名词：优点、价值；动词：值得）。","你也可以把你看到或想用的完整句子发我，我可以根据上下文判断你真正想要的词。"]}
{"word":"premetallic","summary":{"en":"Premetallic means “before becoming metallic” (in science) or “from a time before widespread metal use” (in history).","zh":"premetallic 可指“尚未金属化/变为金属态”（科学语境），也可指“金属广泛使用之前的时代/文化”（历史语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology/chemistry) Existing or occurring before a substance becomes metallic in form or properties; not yet metallic.","zh":"（地质/化学）在物质呈现金属形态或金属性质之前存在或发生的；尚未金属化的。"},"examples":[{"en":"Under high pressure, the material passes through a premetallic phase before turning metallic.","zh":"在高压下，这种材料在变成金属态之前会经历一个前金属相（premetallic phase）。"},{"en":"Researchers measured electrical changes in the premetallic state.","zh":"研究人员测量了该物质在前金属态中的电学变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaeology/history) Belonging to a period before humans commonly used metals (before the Bronze and Iron Ages).","zh":"（考古/历史）属于人类普遍使用金属之前的时期（青铜时代、铁器时代之前）。"},"examples":[{"en":"The museum has a small collection of premetallic tools made of stone and bone.","zh":"博物馆收藏了一小批前金属时代的工具，由石头和骨头制成。"},{"en":"Premetallic societies relied on stone, wood, and clay for most daily objects.","zh":"前金属时代的社会在日常用品上主要依赖石器、木材和陶土。"}]}],"synonyms":["pre-metal","nonmetallic (sometimes, in science context)","pre-Bronze-Age (history context)"],"phonetic":"/ˌpriːməˈtælɪk/","extraExplanation":["“premetallic”在日常英语中不常见，更常出现在科研论文或考古学写作中。材料科学里常说“premetallic phase/state（前金属相/前金属态）”，指从绝缘体/半导体向金属导电行为转变之前的阶段。","历史语境下，它强调“未进入冶金技术普及的时代”，表达上也常用更常见的说法如“pre-Bronze Age（青铜时代之前）”或直接说“Stone Age（石器时代）”，视具体地区与分期而定。"]}
{"word":"premethodical","summary":{"en":"Premethodical describes actions or thinking that are not organized or systematic.","zh":"premethodical 用来形容做事或思考不够有条理、不系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not methodical or not done in an orderly, systematic way.","zh":"不讲方法的；不按步骤、不系统的。"},"examples":[{"en":"His premethodical approach meant he kept starting tasks without finishing them.","zh":"他做事不讲方法，总是开始很多任务却做不完。"},{"en":"The team’s premethodical planning led to confusion during the event.","zh":"团队的计划不够系统，导致活动当天一片混乱。"}]}],"synonyms":["unmethodical","unsystematic","disorganized","haphazard"],"phonetic":"/ˌpriːməˈθɑdɪkəl/","extraExplanation":["这个词比较少见，更多时候英语会用 unmethodical（不按章法的）或 unsystematic（不系统的）来表达类似意思。","pre- 通常表示“在……之前”，但在 premethodical 里更像强调“还没进入有方法、有步骤的阶段”，带有“前方法阶段/缺乏条理”的语感。"]}
{"word":"premi","summary":{"en":"“premi” isn’t a standard English word; it’s usually a fragment or a misspelling (often of premium/premise/premier).","zh":"“premi”不是标准英文词；通常是打字片段或拼写错误（常见对应 premium/premise/premier）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; most often seen as an incomplete word (typing fragment) or a misspelling. Common intended words include “premium,” “premise,” or “premier.”","zh":"本身不是一个标准的英文单词；最常见是打字打到一半的片段或拼写错误。常见想表达的词可能是“premium（高端/保费）”“premise（前提/场所）”或“premier（首要的/总理）”。"},"examples":[{"en":"Did you mean “premium” (e.g., a premium account) or “premise” (e.g., on the premise that…)?","zh":"你想说的是“premium”（例如 premium account 高级账号）还是“premise”（例如 on the premise that… 在……这个前提下）？"}]}],"synonyms":["premium","premise","premier"],"phonetic":"ˈpriːmi","extraExplanation":["“premi”在英语里没有固定、通用的词条含义。若你告诉我你看到它的句子或你想表达的意思（比如“保费/高端版/前提/首要的”），我可以给出对应正确单词的发音、用法和例句。"]}
{"word":"premia","summary":{"en":"“Premia” is the plural of “premium,” especially used in finance/economics and insurance to mean premiums or risk premiums.","zh":"“premia”是“premium”的复数，尤用于金融/经济学与保险语境，表示（保险）保费或（风险等）溢价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “premium”: extra payments or prizes given for something (often used in insurance, finance, and economics).","zh":"“premium”的复数：指额外支付的款项或奖励（常见于保险、金融与经济学语境）。"},"examples":[{"en":"Insurance premia have risen because repair costs are higher this year.","zh":"由于今年维修成本更高，保险费（premia）上涨了。"},{"en":"Investors demanded higher risk premia after the market became unstable.","zh":"市场变得不稳定后，投资者要求更高的风险溢价（risk premia）。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, formal) rewards or benefits given for effort, service, or achievement.","zh":"（较少见，较正式）指因努力、服务或成就而获得的奖赏或益处。"},"examples":[{"en":"They hoped to enjoy the premia of years of careful planning.","zh":"他们希望享受多年谨慎规划所带来的回报（premia）。"}]}],"synonyms":["premiums","risk premiums","insurance premiums"],"phonetic":"/ˈpriːmiə/","extraExplanation":["“premia”是“premium”的拉丁式复数形式，常见于学术写作、经济学论文、金融报道（如 risk premia）以及保险行业文件中。日常英语里也常用更规则的复数“premiums”。","常见搭配：risk premia（风险溢价）、term premia（期限溢价）、insurance premia（保险费，较正式）。"]}
{"word":"premial","summary":{"en":"Premial means “related to a prize or reward,” used mainly in formal contexts.","zh":"Premial 指“与奖品或奖励有关的”，主要用于较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prize or reward (especially something given for winning or as an incentive).","zh":"与奖品或奖励有关的；（尤指）为获胜或作为激励而给予的奖赏相关的。"},"examples":[{"en":"The competition offers premial funding to the top three teams.","zh":"这项比赛为前三名队伍提供获奖奖励资金。"},{"en":"Some companies use premial bonuses to encourage employees to meet targets.","zh":"一些公司用奖励性奖金来鼓励员工达成目标。"}]}],"synonyms":["prize","reward-based","incentive-based","prize-winning"],"phonetic":"/ˈpriːmiəl/","extraExplanation":["“premial”较少见，多出现在正式或学术语境里；日常英语里更常用“prize (adj.) / prize-winning / reward-based / incentive-based”等表达来传达类似意思。","词源上与拉丁语“premium”（奖赏、奖金）有关；“premium”在现代英语里还常指“保险费”“溢价”等，这些含义与“奖励/额外给付”的概念有关联。"]}
{"word":"premiant","summary":{"en":"A rare adjective meaning “award-winning,” especially “first-prize.”","zh":"一个罕用形容词，表示“获奖的”，尤指“一等奖/头奖”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Award-winning; receiving a prize, especially first prize.","zh":"（罕用）获奖的；得奖的，尤指一等奖的。"},"examples":[{"en":"Her premiant essay was published in the school magazine.","zh":"她那篇获奖作文发表在校刊上。"},{"en":"The festival honored several premiant films from new directors.","zh":"电影节表彰了几部新导演的获奖影片。"}]}],"synonyms":["award-winning","prize-winning","first-prize","decorated","laureled"],"phonetic":"/ˈpriːmiənt/","extraExplanation":["“premiant”在现代英语中非常少见，多见于较正式或受法语影响的语境；更常用的说法是“award-winning / prize-winning / first-prize”。","词源上与法语“premier（第一）”相关，因此常带有“第一名/头奖”的含义，但在实际使用中不如常用替代表达自然。"]}
{"word":"premiate","summary":{"en":"Premiate means to award a prize or reward (a rare, formal verb).","zh":"Premiate 意为“授奖/奖励”，属于较少见、偏正式的动词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to award a prize, honor, or reward to someone; to give someone a premium (a special payment or benefit).","zh":"授予（某人）奖项/荣誉/奖励；给（某人）发放奖金或额外津贴。"},"examples":[{"en":"The jury premiated the young poet for her powerful debut collection.","zh":"评审团把奖项授予了那位年轻诗人，以表彰她极具力量的首部诗集。"},{"en":"Employees were premiated with a bonus after the company exceeded its targets.","zh":"公司超额完成目标后，员工获得了奖金奖励。"}]}],"synonyms":["award","honor","reward","prize","give a prize to"],"phonetic":"/ˈpriːmieɪt/","extraExplanation":["“premiate”在现代英语中很少见，更常用的是“award / honor / reward / give a prize to”。在新闻、文学或正式场合偶尔会出现，尤其在谈论比赛、评奖、学术或艺术奖励时。","词源上与拉丁语“praemium”（奖赏、报酬）有关，也与“premium”（奖金、额外补贴）同源。"]}
{"word":"premiated","summary":{"en":"“Premiated” means “award-winning; having received a prize.”","zh":"“premiated”意为“获奖的；得奖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having received a prize or award; prizewinning","zh":"获奖的；得奖的"},"examples":[{"en":"The film is a premiated documentary shown at international festivals.","zh":"这部电影是一部获奖纪录片，在国际影展上放映。"},{"en":"She is a premiated writer, known for short stories about family life.","zh":"她是一位获奖作家，以描写家庭生活的短篇小说闻名。"}]}],"synonyms":["award-winning","prizewinning","decorated","acclaimed"],"phonetic":"/ˈpriːmiˌeɪtɪd/","extraExplanation":["“premiated”在日常英语里比较少见，更常用的表达是“award-winning / prizewinning”。它来自动词“premiate”（给……颁奖、授奖），该词又与拉丁语“praemium”（奖赏、奖品）有关。","在写作语域上，“premiated”更偏正式，常见于艺术、文学、学术或竞赛相关的介绍文字（如影展、摄影比赛、论文奖项等）。"]}
{"word":"premiating","summary":{"en":"“Premiating” means awarding a prize or rewarding someone (formal, less common).","zh":"“Premiating”指颁奖或奖励某人（较正式、较少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle) giving someone a prize or award; rewarding, especially in contests or formal settings","zh":"（现在分词）给某人颁奖或奖励；（尤指在比赛或正式场合）授予奖项"},"examples":[{"en":"The jury is premiating the top three films tonight.","zh":"评审团今晚将为前三名电影颁奖。"},{"en":"They are premiating students who showed outstanding community service.","zh":"他们正在奖励那些在社区服务方面表现突出的学生。"}]}],"synonyms":["awarding","rewarding","honoring","prizing","granting a prize"],"phonetic":"/ˈpriːmiˌeɪtɪŋ/","extraExplanation":["“premiating”来自动词“premiate”，词根与拉丁语“praemium”（奖赏、奖金）有关，因此含义与“prize / reward”相近。","在现代英语中，“premiate / premiating”相对少见，更常见的表达是“award / reward / honor / give a prize to”。在写作里用“premiate”会显得较正式或偏学术。"]}
{"word":"premidnight","summary":{"en":"“Premidnight” is a rare adjective meaning “before midnight.”","zh":"“premidnight”是个较少见的形容词，意思是“午夜之前的/午夜前发生的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Happening or occurring before midnight.","zh":"（罕见用法）发生在午夜之前的；午夜前的。"},"examples":[{"en":"We made a premidnight snack and watched a movie.","zh":"我们在午夜前吃了点夜宵，然后看了部电影。"},{"en":"The premidnight train is usually less crowded than the one after midnight.","zh":"午夜前的那班火车通常比午夜后的更不拥挤。"}]}],"synonyms":["before midnight","pre-midnight","late-evening"],"phonetic":"/priːˈmɪdˌnaɪt/","extraExplanation":["“premidnight”由前缀 pre-（“在……之前”）+ midnight（“午夜”）构成，但在现代英语中并不常见。更自然的表达通常是 “before midnight” 或 “pre-midnight”（加连字符）。在正式写作中，建议使用更常见的说法以避免读者困惑。"]}
{"word":"premidsummer","summary":{"en":"“Premidsummer” means ‘before midsummer’ (around the summer solstice).","zh":"“premidsummer”意为“仲夏之前的”（夏至前后到来之前）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before midsummer (around the summer solstice, usually late June in the Northern Hemisphere).","zh":"发生在仲夏之前的；仲夏（夏至前后，通常指北半球六月下旬）之前的。"},"examples":[{"en":"We planned a premidsummer picnic before the crowds arrived.","zh":"我们计划在仲夏到来、游客变多之前去野餐。"},{"en":"Premidsummer weather can still feel like late spring in some regions.","zh":"在一些地区，仲夏前的天气可能仍然像晚春。"}]}],"synonyms":["pre-midsummer","before midsummer","early-summer (approx.)"],"phonetic":"/ˌpriːˈmɪdˌsʌmər/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。“midsummer”常指夏至前后的一段时间（北半球多在6月下旬），在一些文化中也与节庆相关：例如瑞典的Midsommar（仲夏节）通常在6月下旬的周末庆祝。把它们合在一起写成“premidsummer”并不算固定词汇，更常见的写法是“pre-midsummer”或直接说“before midsummer”。"]}
{"word":"premie","summary":{"en":"A “premie” is an informal word for a baby born early (preterm).","zh":"“Premie”是“早产儿”的口语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a baby born before full term (before about 37 weeks of pregnancy)","zh":"早产儿（通常指妊娠未满约37周出生的婴儿）"},"examples":[{"en":"The doctors put the premie in an incubator to help with breathing and temperature.","zh":"医生把早产儿放进保温箱，帮助呼吸并维持体温。"},{"en":"She was a premie, but she grew up healthy with good medical care.","zh":"她是早产儿，但在良好医疗照护下健康长大。"}]}],"synonyms":["preterm baby","preterm infant","premature baby","premature infant"],"phonetic":"/ˈpriːmi/","extraExplanation":["“Premie”是口语、较亲昵的说法，来自“premature (baby)”的缩写；在正式写作或医疗语境中更常用“preterm baby/infant”（早产儿）。","在英美文化中谈到早产儿通常会涉及NICU（新生儿重症监护室）等医学话题；与家长交流时语气需要更体贴，避免带有评判。"]}
{"word":"premier","summary":{"en":"“Premier” most commonly means “top/leading,” and it can also mean a head of government; as a verb, it means to appear for the first time (often a film or show).","zh":"“premier”最常见意思是“顶尖的/首位的”；也可指“政府首脑”；作动词表示“首次推出/首映”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The most important, best, or highest-ranking; first in position or quality.","zh":"最重要的；最好的；最高级的；首位的。"},"examples":[{"en":"She studied at a premier university in the U.S.","zh":"她在美国一所顶尖大学学习。"},{"en":"This is a premier destination for food lovers.","zh":"这里是美食爱好者的首选目的地。"}]},{"partOfSpeech":"n.","definition":{"en":"The leader of a government in some countries; often the head of government (similar to a prime minister).","zh":"（某些国家的）政府首脑；总理／首相级别的领导人。"},"examples":[{"en":"The premier announced new economic policies.","zh":"总理宣布了新的经济政策。"},{"en":"In some places, a premier leads a province or state government.","zh":"在一些地区，premier 也指省长或州政府的领导人。"}]},{"partOfSpeech":"v.","definition":{"en":"To introduce or present something for the first time (especially a movie, show, or product).","zh":"（首次）推出；首映；首发（尤指电影、演出或产品）。"},"examples":[{"en":"The film will premier next Friday.","zh":"这部电影将于下周五首映。"},{"en":"They plan to premier the new app at the conference.","zh":"他们计划在会议上首发这款新应用。"}]}],"synonyms":["leading","top","first-rate","foremost","chief"],"phonetic":"/ˈpriːmjər/","extraExplanation":["“premier”作形容词时，常用于正式或宣传语境，语气比“very good / top”更“高端”，如 premier hotel（顶级酒店）、premier brand（高端品牌）。","作名词时，不同国家用法不同：在加拿大，“Premier”常指省长（省政府首脑）；在一些国家也可泛指政府首脑，接近“prime minister”。","作动词时，在美式英语里常见拼写是“premiere”（更常用来表示“首映/首演”）；“premier”作动词也可见但相对少。"]}
{"word":"premiere","summary":{"en":"Premiere most commonly means the first public showing of a film or show, and it can also mean to release something for the first time.","zh":"Premiere最常指电影或节目“首映/首播”，也可作动词表示“首次推出”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first public showing of a film, TV show, play, or other performance; an opening night or debut event","zh":"（电影、电视剧、戏剧等的）首映；首演；首播；开幕演出"},"examples":[{"en":"We’re going to the film’s premiere tonight.","zh":"我们今晚要去看这部电影的首映。"},{"en":"The series premiere will air on Friday.","zh":"这部剧的首播将在周五播出。"},{"en":"She wore a black dress to the red-carpet premiere.","zh":"她穿着黑色礼服参加红毯首映礼。"}]},{"partOfSpeech":"v.","definition":{"en":"to present something for the first time to the public (especially a film, show, or episode)","zh":"（尤指电影、节目或剧集）首次公开推出；首映；首播"},"examples":[{"en":"The documentary will premiere at an international festival.","zh":"这部纪录片将于一个国际电影节上首映。"},{"en":"The new episode premieres next week.","zh":"新一集将于下周首播。"}]},{"partOfSpeech":"adj.","definition":{"en":"first; of the highest rank or importance (more formal)","zh":"首要的；顶级的；最重要的（较正式）"},"examples":[{"en":"It’s a premiere university for engineering.","zh":"这是一所工程学顶尖的大学。"}]}],"synonyms":["debut","opening night","first showing","launch","first airing"],"phonetic":"/prəˈmɪr/","extraExplanation":["“premiere”来自法语，读音也带有法语色彩。在现代英语里，最常见的是名词/动词用法，指“首映/首播”。","拼写提示：与“premier”常混淆。“premier”（常作名词/形容词）更常指“首相/总理”或“首要的”。“premiere”更常指“首映/首演”。"]}
{"word":"premiered","summary":{"en":"“Premiered” means something was shown or released to the public for the first time.","zh":"“Premiered”表示某作品或事物首次公开上映、首播、首演或发布。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To be shown, performed, or released to the public for the first time (e.g., a film, TV show, play, album, or product).","zh":"（电影、电视剧、戏剧、专辑或产品等）首次公开上映／首播／首演／发布。"},"examples":[{"en":"The movie premiered in Los Angeles last night.","zh":"这部电影昨晚在洛杉矶举行了首映。"},{"en":"The new season premiered on Netflix in April.","zh":"新一季在四月于奈飞首播。"},{"en":"Her new song premiered on the radio this morning.","zh":"她的新歌今天早上在电台首播。"}]}],"synonyms":["debuted","launched","opened","was released"],"phonetic":"/prɪˈmɪrd/","extraExplanation":["“premiere /prɪˈmɪr/”来自法语，意思是“第一”。英语里常用“premiere”指首次公开亮相；动词过去式/过去分词就是“premiered”。","搭配很固定：premiere on（在某平台首播）、premiere at/in（在某地首映/首演）、world premiere（全球首映/首演）、season premiere（季首播）、series premiere（剧集首播）。","注意不要和“premier（总理/首相）”混淆：那个是名词或形容词，发音也不同。"]}
{"word":"premieres","summary":{"en":"“Premieres” can mean multiple first showings (noun) or that a show is debuting (verb).","zh":"“premieres”可指多场首映/首演（名词复数），也可指某节目首次上映/首播（动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first public showing or performance of a movie, TV show, play, or other event; plural of “premiere”","zh":"（电影、电视剧、戏剧等的）首映/首演；“premiere”的复数"},"examples":[{"en":"The film’s premieres in New York and Los Angeles drew huge crowds.","zh":"这部电影在纽约和洛杉矶的首映吸引了大批观众。"},{"en":"Several premieres will be streamed online this week.","zh":"本周将有多场首映在网上直播。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to be shown or performed publicly for the first time","zh":"（第三人称单数）首次公开上映/首演"},"examples":[{"en":"The new series premieres tonight at 9 p.m.","zh":"这部新剧今晚9点首播。"},{"en":"Her play premieres at a local theater next month.","zh":"她的戏剧下个月将在当地剧院首演。"}]}],"synonyms":["debuts","first showings","openings","launches"],"phonetic":"/prɪˈmɪr/","extraExplanation":["“premiere”来自法语，原意与“第一（first）”有关，所以常用于强调“首次公开”。在英语里既可以作名词（a premiere），也可以作动词（to premiere）。","美式英语中常读作 /prɪˈmɪr/。在一些英式语境里也可能听到不同读法，但学习与使用时跟随你所在地区或媒体常用读音即可。"]}
{"word":"premieress","summary":{"en":"“Premiere” means the first public showing or performance of something, or the act of being shown for the first time.","zh":"“Premiere” 指作品的首次公开上映/上演（首映/首演/首播），也可作动词表示“首次上映/首播”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “premiere”) the first public showing of a movie, play, TV show, or other performance.","zh":"（你可能想写的是：premiere）电影、戏剧、电视剧等的“首映/首演”。"},"examples":[{"en":"We watched the movie’s premiere in Los Angeles.","zh":"我们在洛杉矶看了这部电影的首映。"},{"en":"The play had its premiere last night.","zh":"这出戏昨晚首演。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Likely intended: “premiere”) to be shown or performed in public for the first time.","zh":"（你可能想写的是：premiere）首次公开上映/播出/上演。"},"examples":[{"en":"The new series premieres next Friday.","zh":"这部新剧下周五首播。"},{"en":"Her documentary premiered at an international film festival.","zh":"她的纪录片在一个国际电影节上首映。"}]}],"synonyms":["debut","first showing","opening night","launch"],"phonetic":"/prɪˈmɪr/","extraExplanation":["“premieress” 不是常见英语单词。最可能是把 “premieres”（premiere 的复数，或第三人称单数动词）拼错了。","拼写提示：美式英语常用 “premiere”（首映/首演；首播）。动词第三人称单数是 “premieres”：The show premieres tonight."]}
{"word":"premiering","summary":{"en":"“Premiering” means being shown or performed publicly for the first time.","zh":"“premiering”指某作品或事物第一次公开上映、首演或首播。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To be shown or performed publicly for the first time (often for a movie, TV show, play, or new product).","zh":"首次公开上映／首演／首发（常指电影、电视节目、戏剧或新产品）。"},"examples":[{"en":"The film is premiering at the Sundance Film Festival this weekend.","zh":"这部电影将于本周末在圣丹斯电影节首映。"},{"en":"A new season of the series is premiering tonight at 9 p.m.","zh":"这部剧的新一季今晚9点首播。"}]},{"partOfSpeech":"n.","definition":{"en":"The event or occasion when something is shown or performed publicly for the first time (less common in everyday use than the verb).","zh":"首映式／首演（作为名词较少见，日常更常用动词）。"},"examples":[{"en":"They walked the red carpet at the movie’s premiering.","zh":"他们参加了这部电影的首映活动，并走了红毯。"}]}],"synonyms":["debuting","launching","opening"],"phonetic":"/prɪˈmɪrɪŋ/","extraExplanation":["“premiering”来自动词“premiere”（首映/首演/首播）的现在分词形式。英语里常用“be premiering / is premiering”表示“即将首播/正在首映”（强调安排在近期的首次公开呈现）。","注意拼写与发音：英式里更常见“première”（带重音符号的法语借词写法），美式通常写作“premiere”。在口语和新闻标题中，“premiering”很常见。","易混点：不要把“premiering”与“premier”（首相；最好的/首要的）混淆。两者拼写相近，但词性和含义不同。"]}
{"word":"premierjus","summary":{"en":"“Premier jus” is a French culinary term meaning the first, most flavorful meat juices used as a light sauce.","zh":"“Premier jus”是法语烹饪用语，指第一道、最鲜最浓的肉汁原汁，用作清淡酱汁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Culinary, from French) the first-run, most flavorful meat juices/drippings used as a light sauce (a type of “jus”).","zh":"（烹饪用语，源自法语）“第一道肉汁/原汁”：指最先流出的、风味最浓的肉汁/滴汁，用作清淡酱汁（属 jus 的一种）。"},"examples":[{"en":"Serve the roast with a little premier jus instead of a heavy gravy.","zh":"烤肉搭配少量的第一道原汁，比浓稠肉汁更清爽。"},{"en":"The chef reduced the premier jus to intensify the flavor.","zh":"主厨把第一道肉汁收汁浓缩，让味道更集中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) the best or most essential part of something; the “choicest bits.”","zh":"（比喻义，较少见）某事物中最好、最精华的部分；“最值得取用的精华”。"},"examples":[{"en":"He gave us the premier jus of the book in a short talk.","zh":"他用一段简短的分享，把那本书的精华讲给我们听。"}]}],"synonyms":["jus","pan juices","drippings","au jus"],"phonetic":"/prəˈmjɛr ʒuː/","extraExplanation":["“Premier jus”是法语：premier（第一的）+ jus（肉汁/原汁）。在英语菜单里常见的是“jus / au jus”（配原汁/蘸原汁），而“premier jus”更偏向专业或较讲究的餐饮语境，强调“第一道、最鲜”的滴汁。","发音在英语环境里通常会保留法语风格：jus 常读作 /ʒuː/（类似“zhoo”），而不是 juice /dʒuːs/。","如果你输入的“premierjus”其实是品牌名、用户名或产品名，也可能不属于常见词汇；可以告诉我它出现的句子/场景，我能更准确解释。"]}
{"word":"premiers","summary":{"en":"“Premiers” most commonly means multiple government leaders called premiers, or multiple first showings (premieres) of films/shows/events.","zh":"“Premiers”通常指多个称为 premier 的政府首脑，或指多场电影/节目/活动的首映（首播）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of premier) the head of a government in some countries or regions (similar to a prime minister), especially in Canada and some other parliamentary systems.","zh":"（premier 的复数）某些国家或地区的政府首脑（类似“总理/首席部长”），尤其常见于加拿大等议会制地区。"},"examples":[{"en":"Canada’s premiers met to discuss health care funding.","zh":"加拿大各省省长（premiers）会面讨论医疗经费问题。"},{"en":"Several premiers promised new policies on housing.","zh":"多位政府首脑（premiers）承诺推出新的住房政策。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of premier) the first public showing of a movie, TV series, play, or event.","zh":"（premier 的复数）电影、剧集、戏剧或活动的首映/首播（场次）。"},"examples":[{"en":"The film had two premiers: one in New York and one in Los Angeles.","zh":"这部电影有两场首映：一场在纽约，一场在洛杉矶。"},{"en":"The streaming platform announced several international premiers this month.","zh":"该流媒体平台宣布本月将有多场国际首播。"}]}],"synonyms":["first ministers","heads of government","premieres","first showings","debuts"],"phonetic":"/prɪˈmɪr/","extraExplanation":["“premier”有两条常见意思：①“政府首脑”（如加拿大各省的省长常称 premier）；②“首映/首播”。美式英语里“电影首映”也常说 movie premiere（更常见拼法是 premiere），而“政府首脑”的 premier 仍很常用。"]}
{"word":"premiership","summary":{"en":"Premiership means a prime minister’s office/term, or the top division/championship in certain sports leagues (especially in the UK).","zh":"Premiership 指“首相的职位/任期”，也可指（尤指英国）某些体育项目的顶级联赛或联赛冠军。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The position or term of office of a prime minister.","zh":"首相的职位；首相任期。"},"examples":[{"en":"Her premiership lasted six years.","zh":"她的首相任期持续了六年。"},{"en":"During his premiership, the country introduced major healthcare reforms.","zh":"在他担任首相期间，国家推行了重大的医疗改革。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports, especially in the UK) The top division or championship title in a league, especially in football (soccer).","zh":"（体育，尤指英国）顶级联赛；（常指足球）超级联赛或联赛冠军。"},"examples":[{"en":"The club was promoted to the Premiership.","zh":"这家俱乐部升入了英超（顶级联赛）。"},{"en":"They won the Scottish Premiership last season.","zh":"他们上赛季赢得了苏格兰超级联赛冠军。"}]}],"synonyms":["(politics) prime ministership","(politics) tenure","(sports) top flight","(sports) first division"],"phonetic":"/prɪˈmɪrʃɪp/","extraExplanation":["在英国语境里，premiership 常指“首相职位/任期”；而在体育新闻里，Premiership 往往是正式联赛名称的一部分（如 Scottish Premiership、rugby 的 Premiership）。具体含义通常可从上下文（政治 vs. 体育）判断。","词形上，premier（首相/总理；首位的）+ -ship（表示“身份、职位、状态或任期”的后缀，如 leadership, membership），因此 premiership 有“担任……的状态/任期”的感觉。"]}
{"word":"premierships","summary":{"en":"“Premierships” means championship titles (often in sports) or periods when someone serves as prime minister.","zh":"“premierships”指（常见于体育的）冠军头衔/夺冠次数，或（政治上的）首相任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"championship titles (especially in sports leagues), meaning times a team has finished as the champion.","zh":"（尤指体育联赛的）冠军头衔；夺冠次数。"},"examples":[{"en":"The club has won six premierships in the last twenty years.","zh":"这家俱乐部在过去二十年里赢得了六次联赛冠军。"},{"en":"Fans still talk about the premierships of the early 2000s.","zh":"球迷们仍然在谈论2000年代初的那些冠军赛季。"}]},{"partOfSpeech":"n.","definition":{"en":"periods of serving as prime minister; prime ministerships.","zh":"（首相/总理的）任期；首相在任的时期。"},"examples":[{"en":"The book compares the premierships of two leaders.","zh":"这本书比较了两位领导人的首相任期。"},{"en":"During her premiership, several major reforms were introduced.","zh":"在她担任首相期间，推出了几项重大改革。"}]}],"synonyms":["championships","titles","crowns","prime ministerships","terms in office"],"phonetic":"/ˈprɛmiərʃɪps/","extraExplanation":["“premiership”在不同英语国家里常见两大用法：一是英联邦国家（如澳大利亚）体育语境中指“联赛冠军/冠军赛季”；二是政治语境中指“首相任期”。在美式英语里，体育上更常说“championship(s)”。"]}
{"word":"premies","summary":{"en":"“Premies” (more commonly spelled “preemies”) means premature babies—infants born early.","zh":"“premies”（更常见拼写为“preemies”）指早产儿，即提前出生的婴儿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A premature baby; a baby born before the normal length of pregnancy. “Premies” is the plural form of “preemie.”","zh":"（非正式）早产儿；在正常妊娠期结束前出生的婴儿。“premies”是“preemie”的复数形式。"},"examples":[{"en":"The hospital’s NICU cares for premies who need extra help breathing.","zh":"医院的新生儿重症监护室（NICU）照护需要额外呼吸支持的早产儿。"},{"en":"Some premies gain weight slowly, so doctors monitor them closely.","zh":"有些早产儿体重增长较慢，所以医生会密切观察。"},{"en":"She joined a support group for parents of premies.","zh":"她加入了一个早产儿家长互助小组。"}]}],"synonyms":["preemies","premature babies","premature infants","preterm infants"],"phonetic":"/ˈpriːmiz/","extraExplanation":["“preemie”主要是美式口语/日常用语，较为亲切；在医疗或正式写作中更常见的是“premature infant / premature baby（早产儿）”。","发音与拼写提示：单数是“preemie”，复数常写作“preemies”（更常见），也有人写“premies”。","相关常见搭配：NICU（neonatal intensive care unit，新生儿重症监护室）、preterm（早产的，较正式/医学用语）。"]}
{"word":"premilitary","summary":{"en":"Premilitary means “before military service” or “before a society becomes militarized.”","zh":"premilitary 表示“入伍前的/参军前准备的”，也可指“军事化之前的（社会、时期等）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before someone begins military service, or to training/preparation done before joining the armed forces.","zh":"与入伍前阶段有关的；（正式参军前的）训练或准备的。"},"examples":[{"en":"She attended a premilitary training program during her last year of high school.","zh":"她在高中最后一年参加了一个入伍前训练项目。"},{"en":"The hospital required a premilitary physical exam before he could enlist.","zh":"医院要求他在入伍前做体检才能参军。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of a society, policy, or period: occurring before a country becomes strongly shaped by military values or rule.","zh":"（指社会、政策或时期）在军事化或军人价值观/统治变得强势之前的。"},"examples":[{"en":"The book describes the country’s premilitary political culture.","zh":"这本书描述了该国军事化之前的政治文化。"},{"en":"They studied premilitary traditions that existed before the new regime.","zh":"他们研究了新政权出现之前的非军事化传统。"}]}],"synonyms":["pre-service (military)","pre-enlistment","preinduction"],"phonetic":"/ˌpriːˈmɪləˌtɛri/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。所以 premilitary 字面意思是“在军事/参军之前的”。实际使用中多见于正式语境（如政策、教育、体检、训练项目）或学术写作中。","容易与 paramilitary（准军事的/类似军队的）混淆：premilitary 强调“时间在前”，paramilitary 强调“性质类似军队但不属于正规军”。"]}
{"word":"premillenarian","summary":{"en":"A premillenarian believes (or describes a view) that Christ returns before the Millennium.","zh":"premillenarian 指相信（或形容一种观点）：基督会在“千禧年”之前再来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that Jesus Christ will return before a future thousand-year period of peace and justice (the Millennium), as described in some Christian interpretations of the Bible.","zh":"前千禧年论者；相信耶稣基督会在未来“千禧年”（一千年的和平与公义时期）之前再来的一种基督教末世论观点的信徒/拥护者。"},"examples":[{"en":"Some early Christians were premillenarians who expected Christ’s return soon.","zh":"一些早期基督徒属于前千禧年论者，期待基督很快再来。"},{"en":"In the discussion of end-times beliefs, she identified herself as a premillenarian.","zh":"在谈到末世信仰时，她表明自己是前千禧年论者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or supporting the belief that Christ’s second coming happens before the Millennium.","zh":"与“基督在千禧年之前再来”的观点有关的；支持前千禧年论的。"},"examples":[{"en":"The pastor taught a premillenarian view of Revelation.","zh":"那位牧师以前千禧年论的观点来讲解《启示录》。"},{"en":"Premillenarian churches often interpret apocalyptic passages more literally.","zh":"前千禧年论的教会常常更倾向按字面来理解启示性经文。"}]}],"synonyms":["chilialist","premillennialist"],"phonetic":"/ˌpriːmɪˈlɛniən/","extraExplanation":["词源拆解：pre-（在……之前）+ millen(n)-（一千年）+ -arian（表示“持某种信念的人/派别”）。核心就是“在千禧年之前”。","相关概念对比：premillenarian（前千禧年）常与 amillennial（无千禧年：把“千禧年”多理解为象征）和 postmillennial（后千禧年：认为基督在“千禧年之后”再来）并列讨论。","文学/文化语境：该词多见于神学著作、教会历史、以及对《启示录》等末世经文的解释讨论中；属于较正式的宗教术语。"]}
{"word":"premillenarianism","summary":{"en":"Premillenarianism is the belief that Christ will return before a future thousand-year kingdom (the Millennium), and it can also refer to a broader expectation of an imminent end-times turning point.","zh":"premillenarianism 指“千禧年前论”：认为基督会在未来千年国度开始前再临；也可泛指对末世临近、神即将介入并开启新时代的期待。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian belief that Jesus Christ will return to Earth before (“pre-”) a future thousand-year reign of peace and justice (the Millennium).","zh":"千禧年前论：一种基督教末世论观点，认为耶稣基督会在未来“千年国度”（一千年的和平与公义统治）开始之前再临。"},"examples":[{"en":"In their theology class, they compared premillenarianism with postmillennialism and amillennialism.","zh":"在神学课上，他们比较了千禧年前论、千禧年后论和无千禧年论。"},{"en":"Some churches interpret certain Bible passages as supporting premillenarianism.","zh":"一些教会把某些圣经经文解释为支持千禧年前论。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, the religious expectation that the world is nearing an end-time crisis and that a dramatic divine intervention will soon begin a new era.","zh":"（广义）末世临近的期待：认为世界正接近末世危机，神将很快以戏剧性的方式介入并开启新时代。"},"examples":[{"en":"During times of war, premillenarianism can become more visible in popular preaching.","zh":"在战争时期，千禧年前论式的末世期待在大众讲道中可能更为显眼。"},{"en":"Some critics say premillenarianism can encourage an overly pessimistic view of politics.","zh":"一些批评者认为，千禧年前论可能助长对政治过度悲观的看法。"}]}],"synonyms":["premillennialism","millenarianism","apocalypticism (broader)"],"phonetic":"/ˌpriˌmɪləˈnɛriəˌnɪzəm/","extraExplanation":["“premillenarianism”常与“premillennialism”同义；写法不同但指向的核心观念相近。","它属于基督教“末世论（eschatology）”的一部分。常见相关词包括：the Second Coming（再临）、the Millennium（千禧年）、tribulation（大灾难）。在某些传统中还会谈到 rapture（被提），但并非所有千禧年前论者都以同样方式理解。","理解上可用对比记忆：pre-（之前）= 基督先再临再进入千禧年；post-（之后）= 先出现某种“千禧年式的黄金时代”再再临；a-（没有）= 不把千禧年当作字面的一千年统治。"]}
{"word":"premillenial","summary":{"en":"Premillennial describes a Christian belief that Christ returns before a coming thousand-year reign (the Millennium).","zh":"premillennial 指一种基督教观点：基督会在未来“千禧年”开始之前再来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the belief that Jesus Christ will return before a future thousand-year period of peace (the Millennium), as described in some interpretations of the Bible","zh":"与“前千禧年论”有关：指相信耶稣基督会在未来“千禧年”（一千年的和平国度）开始之前再来的一种基督教末世论观点"},"examples":[{"en":"In his youth, he was raised in a premillennial church.","zh":"他年轻时在一间持前千禧年观点的教会中长大。"},{"en":"Premillennial interpretations often read the Book of Revelation quite literally.","zh":"前千禧年式的解读常常较为字面地理解《启示录》。"}]}],"synonyms":["chilialist","premillennarian"],"phonetic":"/ˌpriˌmɪˈlɛniəl/","extraExplanation":["拼写提示：更常见的标准拼写是 premillennial（两个 n）。你输入的 premillenial 少了一个 n，但通常仍能被理解。","语境提示：该词多用于神学、宗教史与教会传统讨论中，属于较正式的术语；日常英语中不算常见。"]}
{"word":"premillennial","summary":{"en":"Premillennial refers to the Christian belief that Christ will return before a future thousand-year Millennium; it can also mean a person who believes this.","zh":"premillennial 指基督教“前千禧年派”观点：认为基督会在未来千禧年之前再临；也可指持此观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Believing that Jesus Christ will return to Earth before a future 1,000-year period of peace and rule (the Millennium), as described in some Christian interpretations of biblical prophecy.","zh":"（基督教末世论中）“前千禧年派”的：相信耶稣基督会在未来的“千禧年”（一千年的和平与统治时期）开始之前再临的。"},"examples":[{"en":"Many premillennial Christians read the book of Revelation as pointing to a future, literal Millennium.","zh":"许多前千禧年派的基督徒认为《启示录》指向一个未来、字面意义上的千禧年。"},{"en":"The church’s premillennial teaching shaped how some members viewed world events.","zh":"该教会的前千禧年派教导影响了一些成员看待世界事件的方式。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds premillennial beliefs.","zh":"前千禧年派信徒；持前千禧年派观点的人。"},"examples":[{"en":"Premillennials and amillennials often disagree about how to interpret prophecy passages.","zh":"前千禧年派与无千禧年派常在如何解读预言经文上意见不同。"}]}],"synonyms":["premillenarian","chilialist"],"phonetic":"/ˌpriːmɪˈlɛniəl/","extraExplanation":["“premillennial”来自前缀 pre-（在……之前）+ millennial（千年的）。在基督教讨论中，它常与“amillennial”（无千禧年派：认为没有字面的一千年国度）和“postmillennial”（后千禧年派：认为基督在千禧年之后再临）并列出现。","在日常英语里这个词主要出现在宗教研究、神学讨论、或新闻评论宗教群体时；一般对话中较少使用。使用时注意语境与尊重不同信仰立场。"]}
{"word":"premillennialise","summary":{"en":"To interpret or shape beliefs in a premillennial way; to adopt premillennialism.","zh":"以前千禧年论来解释或塑造观点；采纳前千禧年论。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to interpret Christian end-times beliefs in a premillennial way, or to make someone/something adopt premillennialism (the belief that Christ will return before a thousand-year reign).","zh":"以“前千禧年论”的方式来解释基督教末世观，或使某人/某事接受前千禧年论（相信基督会在“千年国度”之前再临）。"},"examples":[{"en":"Some writers try to premillennialise the Book of Revelation.","zh":"有些作者试图用前千禧年论来解读《启示录》。"},{"en":"The preacher premillennialised his interpretation of world events.","zh":"这位牧师用前千禧年论来阐释他对世界事件的解读。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to become premillennial in belief or approach.","zh":"（较少见）在信念或立场上转向前千禧年论。"},"examples":[{"en":"Over time, the group premillennialised as its leaders changed.","zh":"随着领导层更替，这个团体逐渐转向前千禧年论。"}]}],"synonyms":["premillennialize","interpret as premillennial","adopt premillennialism"],"phonetic":"/ˌpriːmɪˈlɛniəˌlaɪz/","extraExplanation":["“premillennialise”多见于英式拼写（-ise），美式常写作“premillennialize”（-ize）。两者意思相同。","该词属于神学/宗教研究语境：premillennialism（前千禧年论）是基督教末世论的一种立场，通常与“amillennialism（无千禧年论）”“postmillennialism（后千禧年论）”对比使用。","这是相对少见的学术/评论用动词，更常见的表达是“interpret (something) as premillennial”或“adopt premillennialism”。"]}
{"word":"premillennialised","summary":{"en":"Premillennialised means influenced by premillennialism, or presented/changed in a premillennial way (BrE spelling).","zh":"Premillennialised 指“受前千禧年论影响的”，或“以/被前千禧年论方式诠释或改变的”（英式拼写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, church, or teaching) shaped by or based on premillennialism—the Christian belief that Jesus will return before a literal thousand-year reign (the Millennium).","zh":"（指人、教会或教义）受“前千禧年论”影响或以其为基础；即基督教中认为耶稣会在“千禧年”（一千年国度）开始之前再临的观点。"},"examples":[{"en":"Some churches became more premillennialised during times of war and uncertainty.","zh":"一些教会在战争与不确定时期变得更“前千禧年论化”。"},{"en":"His sermons were strongly premillennialised and focused on Christ’s soon return.","zh":"他的讲道明显带有前千禧年论色彩，强调基督即将再临。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of premillennialise: to interpret or present Christian teaching in a premillennial way.","zh":"premillennialise 的过去式/过去分词：以“前千禧年论”的方式来解读或呈现基督教教义。"},"examples":[{"en":"The writer premillennialised the prophecies in the book of Revelation.","zh":"这位作者用前千禧年论的方式解读《启示录》中的预言。"},{"en":"Over time, the movement was premillennialised by new leaders.","zh":"随着时间推移，这个运动在新领袖影响下被“前千禧年论化”了。"}]}],"synonyms":["premillennialized","premillennial","shaped by premillennialism","interpreted premillennially"],"phonetic":"/ˌpriˌmɪˈlɛniəˌlaɪzd/","extraExplanation":["“premillennialised”是英式拼写（-ise），美式更常见“premillennialized”（-ize）。","“前千禧年论”（premillennialism）属于基督教末世论（eschatology）的一支，常与“后千禧年论”（postmillennialism）和“无千禧年论”（amillennialism）对比讨论。","这个词较学术/神学语境使用，日常英语中不常见；写作时可用更通俗的说法，如“influenced by premillennialism（受前千禧年论影响）”。"]}
{"word":"premillennialising","summary":{"en":"Premillennialising means promoting or applying premillennialism—reading end-times texts as pointing to Christ’s return before the millennium.","zh":"Premillennialising 指推动或采用前千禧年论，用该立场解读末世经文：基督会在千禧年之前再来。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"interpreting Christian end-times teachings in a premillennial way, or promoting premillennialism (the belief that Christ will return before the millennium).","zh":"以“前千禧年论”的方式解读基督教末世教义，或推广前千禧年论（相信基督会在“千禧年”之前再来）。"},"examples":[{"en":"Some sermons focus on premillennialising the book of Revelation.","zh":"有些讲道会把《启示录》用前千禧年论的方式来解读。"},{"en":"He worries that the discussion is premillennialising every symbol into a timeline.","zh":"他担心讨论把每个象征都“前千禧年化”，硬要变成时间表。"}]},{"partOfSpeech":"vt.","definition":{"en":"making something (a message, movement, or interpretation) more aligned with premillennial expectations.","zh":"使某个信息、运动或诠释更符合前千禧年论的期待与框架。"},"examples":[{"en":"The speaker kept premillennialising the conversation, returning to predictions about the end times.","zh":"那位讲者一直把对话“前千禧年化”，不断拉回到对末世的预测。"}]}],"synonyms":["premillennializing","advocating premillennialism","interpreting (something) premillennially","applying a premillennial reading"],"phonetic":"/ˌpriˌmɪˈnɪəliˌzaɪzɪŋ/","extraExplanation":["“premillennialising”多见于宗教研究、神学讨论或教会语境里，是由“premillennial”（前千禧年论的）+“-ise/-ize”（使……化）组成的动词现在分词/动名词形式。美式拼写常见为“premillennializing”。","前千禧年论（premillennialism）是基督教末世论的一种立场，核心是：基督再来发生在“千禧年”（启示录20章提到的千年统治）之前。与之对比的常见立场还有 postmillennialism（后千禧年论）与 amillennialism（无千禧年论/象征性千禧年观）。","在一些福音派传统中，前千禧年论常与“时代论”（dispensationalism）在历史上有较强关联，但两者并不完全等同。"]}
{"word":"premillennialism","summary":{"en":"Premillennialism is the belief that Jesus will return before a future thousand-year reign (the Millennium).","zh":"前千禧年论指相信耶稣会在未来千年国度开始之前再临。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian belief that Jesus Christ will return to earth before (“pre-”) a future thousand-year reign of peace and justice (the Millennium), often connected with end-times (eschatology) expectations.","zh":"一种基督教末世观，认为耶稣基督将在未来“千年国度”（千禧年）开始之前（pre-）再临，并在地上建立或开启一段一千年的和平与公义统治；常与末世论期待相关。"},"examples":[{"en":"Premillennialism teaches that Christ will return before the Millennium begins.","zh":"前千禧年论教导：基督会在千禧年开始之前再临。"},{"en":"Some churches read Revelation and support premillennialism, expecting a dramatic end-times sequence.","zh":"一些教会按《启示录》的理解支持前千禧年论，期待一套戏剧性的末世发展顺序。"}]}],"synonyms":["pre-millennialism","premillennial belief","premillennial view"],"phonetic":"/ˌpriˌmɪˈlɛniəlˌɪzəm/","extraExplanation":["“premillennialism”由 pre-（在……之前）+ millennial（千年的）+ -ism（主义/观点）组成。与之常一起比较的有：\n- amillennialism（无千禧年论）：通常把“千年”更多理解为象征性的属灵统治，而不是未来地上字面的一千年。\n- postmillennialism（后千禧年论）：认为基督会在“千年国度”之后再临。\n在北美语境中，premillennialism 常与“dispensational premillennialism（时代论前千禧年论）”联系更紧密，但也存在“historic premillennialism（历史前千禧年论）”等不同版本。"]}
{"word":"premillennialist","summary":{"en":"A premillennialist believes Christ will return before the biblical Millennium (a future thousand-year reign).","zh":"premillennialist 指相信基督会在《圣经》所说的“千禧年”开始之前再临的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that Jesus Christ will return before a future thousand-year period of peace and justice (the Millennium) described in the Bible.","zh":"千禧年前论者；相信耶稣基督会在未来“千禧年”（一千年的和平与公义时期）开始之前再临的人。"},"examples":[{"en":"Some premillennialists interpret world events as signs that Christ’s return is near.","zh":"一些千禧年前论者把世界事件解读为基督再临临近的征兆。"},{"en":"In that church, both premillennialists and amillennialists study the same Bible passages but reach different conclusions.","zh":"在那间教会里，千禧年前论者和无千禧年论者研读同样的经文，却得出不同结论。"}]}],"synonyms":["premillennial believer","premillennial (person)"],"phonetic":"/ˌpriˌmɪˈlɛniəlɪst/","extraExplanation":["“premillennialist”常出现在基督教末世论（eschatology）的讨论中，核心差异在于对《启示录》20章“一千年”的理解与时间顺序：pre-（之前）+ millennial（千禧年的）。常见相关立场还有：amillennialism（无千禧年论：更倾向把“千禧年”视为象征性时期）与 postmillennialism（后千禧年论：认为基督在“千禧年”之后再临）。","在美国宗教语境中，这个词经常与“dispensational premillennialism（时代论式千禧年前论）”一起出现，尤其在某些福音派传统里；但并非所有千禧年前论者都接受时代论。"]}
{"word":"premillennialize","summary":{"en":"to interpret or present something according to premillennialism.","zh":"按前千禧年论来解读或呈现某事物（多指经文/教义/预言）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to interpret (religious teaching or prophecy) in a premillennial way; to adopt or promote premillennialism","zh":"以“前千禧年论”的方式解释（宗教教义或预言）；使（观点/教导）带有前千禧年论色彩或推动前千禧年论"},"examples":[{"en":"Some preachers premillennialize passages from Revelation to emphasize an imminent return of Christ.","zh":"一些传道人会把《启示录》的段落作前千禧年式解读，以强调基督即将再来。"},{"en":"Critics argue that the author premillennialized the text instead of reading it in its historical context.","zh":"批评者认为作者把文本“前千禧年化”了，而不是放在历史语境中解读。"}]}],"synonyms":["interpret premillennially","take a premillennial view","read as premillennial","cast in premillennial terms"],"phonetic":"/ˌpriːmɪˈlɛniəlaɪz/","extraExplanation":["“premillennialize”源自“premillennial”（前千禧年论的）+“-ize”（使成为/使具有某性质）。它主要出现在基督教神学讨论中，表示把某段经文或神学观点按“基督将在千禧年前再来”的框架来理解或强调。","“前千禧年论”（premillennialism）通常指：耶稣基督将先再来，然后在地上施行一段象征或字面意义上的“千年”国度（millennium）。与之相关、容易混淆的还有“后千禧年论”（postmillennialism）与“无千禧年论”（amillennialism）。","这是一个较少见、偏学术/宗教语境的动词；在一般英语中更常见的说法是“take a premillennial view (of…) / interpret … premillennially”。"]}
{"word":"premillennialized","summary":{"en":"Premillennialized means made or interpreted in a way that reflects premillennialist end-times beliefs.","zh":"premillennialized 指被“前千禧年论”化的：被改写或被解读为符合前千禧年论末世观的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changed or interpreted to fit premillennialism (the belief that Christ will return before a thousand-year reign).","zh":"被“前千禧年论”化的；被改写或被解读为符合前千禧年论（认为基督将在“千年国”之前再来）的。"},"examples":[{"en":"Some readers say the passage was premillennialized in later sermons.","zh":"一些读者认为，这段经文在后来的讲道中被“前千禧年论”化了。"},{"en":"The novel’s ending feels premillennialized, emphasizing crisis and an imminent return.","zh":"这部小说的结尾带有“前千禧年论”化的色彩，强调危机与迫近的再来。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of premillennialize: to make something premillennial in emphasis or interpretation.","zh":"premillennialize 的过去式/过去分词：使某事物在强调或解读上呈现前千禧年论取向。"},"examples":[{"en":"Over time, the teacher premillennialized the timeline to match his preferred theology.","zh":"随着时间推移，这位老师把时间线“前千禧年论”化，以符合他偏好的神学观点。"}]}],"synonyms":["interpreted premillennially","reframed","recast","theologically reinterpreted"],"phonetic":"/ˌpriˌmɪˈlɛniəˌlaɪzd/","extraExplanation":["这个词多见于神学写作或宗教史研究里，常用于批评或描述：某段经文、某个传统、或某种叙事被“重新框定”为前千禧年论的解读（例如更强调末世危机、基督即将再来、以及随后展开的“千年国”）。","相关术语：premillennialism（前千禧年论）、postmillennialism（后千禧年论：认为基督在千年国之后再来）、amillennialism（无千禧年论：更象征性地理解“千年”）。"]}
{"word":"premillennializing","summary":{"en":"Premillennializing means interpreting or shaping religious teaching to emphasize premillennialism—belief in Christ’s return before a thousand-year reign.","zh":"Premillennializing 指用或强化“前千禧年论”的立场来解读或塑造宗教教导，即强调基督在千禧年之前再临并开始一千年国度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"interpreting, teaching, or describing Christian end-times beliefs in a way that supports premillennialism (the view that Christ returns before a literal thousand-year reign).","zh":"以“前千禧年论”（认为基督将在“千禧年”之前再临，并开始字面意义上的一千年国度）的立场来解读、教导或表述基督教末世观。"},"examples":[{"en":"Some readers say the author is premillennializing the book of Revelation.","zh":"有些读者认为作者在用前千禧年论来解读《启示录》。"},{"en":"The sermon was criticized for premillennializing every prophetic passage.","zh":"那篇讲道因把每一段预言经文都按前千禧年论来解释而受到批评。"}]},{"partOfSpeech":"v.","definition":{"en":"making something more premillennial in tone or content; giving it a premillennial emphasis.","zh":"使某内容在语气或观点上更偏向前千禧年论；为其加入前千禧年论的强调。"},"examples":[{"en":"Later editions added notes that further premillennialized the commentary.","zh":"后来的版本加入了一些注释，使这本注释书更明显地偏向前千禧年论。"},{"en":"He worried that the study guide was premillennializing the course.","zh":"他担心这份学习指南会让课程整体变得更偏向前千禧年论。"}]}],"synonyms":["interpreting through a premillennial lens","imposing a premillennial reading","premillennial-style interpretation","premillennial emphasis"],"phonetic":"ˌpriːmɪˈlɛniəlaɪzɪŋ","extraExplanation":["“premillennializing”来自动词“premillennialize”，常见于神学写作或宗教研究语境，属于比较学术/圈内的表达。","前千禧年论（premillennialism）是基督教末世论的一种立场，常与“后千禧年论（postmillennialism）”“无千禧年论（amillennialism）”对比使用。"]}
{"word":"premillennially","summary":{"en":"Premillennially means “before the millennium,” or “in a premillennialist (theological) way.”","zh":"premillennially 意为“千禧年前”，也可指“以前千禧年派（基督教神学）观点的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(1) Before the start of a new millennium; in the period leading up to a millennium (often used about the years before 2000).\nExamples: (EN) Premillennially, many people worried about the “Y2K” problem. (ZH) 千禧年前，许多人担心“千年虫（Y2K）”问题。 / (EN) The city upgraded its systems premillennially. (ZH) 这座城市在千禧年到来之前升级了系统。","zh":"(1) 在新千年开始之前；千禧年前（常指 2000 年之前的一段时期）。\n例句：(EN) Premillennially, many people worried about the “Y2K” problem. (ZH) 千禧年前，许多人担心“千年虫（Y2K）”问题。 / (EN) The city upgraded its systems premillennially. (ZH) 这座城市在千禧年到来之前升级了系统。"},"examples":[{"en":"Premillennially, many people worried about the “Y2K” problem.","zh":"千禧年前，许多人担心“千年虫（Y2K）”问题。"},{"en":"The city upgraded its systems premillennially.","zh":"这座城市在千禧年到来之前升级了系统。"}]},{"partOfSpeech":"adv.","definition":{"en":"(2) In a premillennialist way (Christian theology): based on the belief that Jesus will return before a thousand-year period of peace (the Millennium).\nExamples: (EN) The preacher spoke premillennially about end-times events. (ZH) 牧师以“前千禧年派”的观点谈论末世事件。","zh":"(2) （基督教神学）以前千禧年派（premillennialism）的方式；指认为耶稣会在“千禧年”（一千年和平时期）之前再临的观点。\n例句：(EN) The preacher spoke premillennially about end-times events. (ZH) 牧师以前千禧年派的观点谈论末世事件。"},"examples":[{"en":"The preacher spoke premillennially about end-times events.","zh":"牧师以前千禧年派的观点谈论末世事件。"}]}],"synonyms":["before the millennium","prior to the millennium","in a premillennialist way"],"phonetic":"/ˌpriˌmɪˈlɛniəli/","extraExplanation":["这个词比较少见，通常来自两个语境：\n1）日常/历史语境：指“千禧年前”，尤其常见于谈 2000 年前后的社会现象（例如 Y2K）。\n2）宗教语境：来自 premillennialism（前千禧年派），与末世论（eschatology）相关，用来说明某人的解读立场。"]}
{"word":"premillennian","summary":{"en":"Premillennian describes the belief that Christ will return before the millennium, or a person who believes this.","zh":"premillennian 指“基督将于千禧年之前再来”的观点，或持此观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Christian theology) Believing that Jesus Christ will return before a future thousand-year period of peace and justice (the “millennium”).","zh":"（基督教神学）主张耶稣基督将在未来“千禧年”（一段象征或字面上的一千年和平与公义时期）开始之前再来。"},"examples":[{"en":"Some premillennian writers interpret Revelation as a timetable for end-time events.","zh":"一些前千禧年派的作者把《启示录》解读为末世事件的时间表。"},{"en":"The church debated whether a premillennian reading should be taken literally or symbolically.","zh":"教会讨论前千禧年式的解读应按字面理解还是象征理解。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds premillennian beliefs.","zh":"前千禧年派信徒；持前千禧年观点的人。"},"examples":[{"en":"He identified as a premillennian and expected Christ’s return to precede the millennium.","zh":"他自认是前千禧年派，认为基督再来会先于千禧年。"},{"en":"Premillennian thinkers often disagree among themselves about details like the timing of tribulation.","zh":"前千禧年派思想家之间也常就“大灾难”的时间等细节存在分歧。"}]}],"synonyms":["premillennial","chiliastic","millenarian"],"phonetic":"/ˌpriːmɪˈlɛniən/","extraExplanation":["“premillennian”较常见的拼写是“premillennial”。它主要用于基督教末世论（eschatology）的讨论，常与“amillennial（无千禧年派：认为千禧年主要是象征性的）”和“postmillennial（后千禧年派：认为基督在千禧年之后再来）”对比。","“millennium/千禧年”在不同传统中可能被理解为字面的一千年，或象征性的长时期；因此同为前千禧年立场的人，对《启示录》等经文的解读也可能差异很大。"]}
{"word":"preminister","summary":{"en":"Preminister is a rare word meaning to administer or provide something in advance.","zh":"Preminister 是个很少见的词，意思是“预先施行/预先提供（某物）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) To administer or provide (something) beforehand; to prepare in advance.","zh":"（罕见/古用）预先提供或施行（某事）；事先准备。"},"examples":[{"en":"In older medical writing, doctors might preminister a calming drink before a procedure.","zh":"在较早的医学写作中，医生可能会在手术前预先给病人一份镇静饮料。"},{"en":"The handbook says to preminister the test materials so the session runs smoothly.","zh":"手册说要先把测试材料准备好（预先发放），这样流程会更顺畅。"}]}],"synonyms":["administer beforehand","prepare","provide in advance","prearrange"],"phonetic":"/ˌpriːˈmɪnɪstɚ/","extraExplanation":["“preminister”在现代英语里非常少见，多见于旧文献或特定专业文体中，含义接近“administer beforehand（预先施行/发放）”。","学习时要特别注意不要和“prime minister（首相）”混淆：两者拼写相近，但意义完全不同。"]}
{"word":"preministries","summary":{"en":"“preministries” is a rare plural form meaning pre-ministry preparation or early ministry programs.","zh":"“preministries”是较少见的复数形式，通常指“事工开始前的准备阶段”或“早期/前期事工项目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The period of preparation or training before someone begins formal ministry work (for example, before becoming a pastor, priest, or church leader).","zh":"（较少见）指在正式开始教会事工之前的准备或受训阶段（例如成为牧师、神父或教会领袖之前）。"},"examples":[{"en":"She spent two years in pre-ministry training before applying to seminary.","zh":"她在申请神学院之前用了两年时间进行事工前训练。"},{"en":"The church offers mentoring for people in pre-ministry.","zh":"教会为处在事工前阶段的人提供辅导与带领。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, plural) Early or preliminary ministry programs or departments that exist before a larger ministry is formally organized.","zh":"（非常少见，复数）指在较大型事工正式成立之前的早期／前期事工项目或部门。"},"examples":[{"en":"These small groups became the preministries that later formed the youth ministry.","zh":"这些小组后来成了青少年事工的前期基础。"}]}],"synonyms":["pre-ministry (period)","ministry preparation","ministerial training","early ministry programs"],"phonetic":"/ˌpriˈmɪnɪstriz/","extraExplanation":["“preministries”更常见的写法是带连字符的“pre-ministries”，或用“pre-ministry”（作名词）表示“事工前阶段”。","在英语里，前缀“pre-”表示“在……之前”。因此该词通常出现在基督教语境的培训、神学教育、教会同工培育等话题中。","如果你是在某篇文章里看到“preministries”，也可能是作者/机构的内部用词，或是排版省略了连字符。"]}
{"word":"preministry","summary":{"en":"Preministry means the time, training, or preparation before someone officially begins ministry work, especially in a church setting.","zh":"preministry 指（尤指教会语境中）开始正式事工之前的阶段、训练或准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Especially in Christian contexts) the period of time, or the training/education, that happens before someone officially begins ministry work (for example, becoming a pastor or missionary).","zh":"（尤指基督教语境）开始正式事工（如成为牧师、宣教士）之前的阶段，或指事工前的训练/教育。"},"examples":[{"en":"She completed a preministry internship at a local church before applying to seminary.","zh":"她在申请神学院前，在本地教会完成了一段事工前（preministry）实习。"},{"en":"The program offers mentoring and classes for students in their preministry years.","zh":"该项目为处于事工预备阶段（preministry）的学生提供导师指导和课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before someone starts ministry work; preparatory for ministry.","zh":"与开始事工之前有关的；为事工做准备的。"},"examples":[{"en":"He took several preministry courses in biblical studies.","zh":"他修了几门事工预备（preministry）的圣经研究课程。"},{"en":"The church provides preministry support for young leaders.","zh":"教会为年轻领袖提供事工前（preministry）的支持。"}]}],"synonyms":["pre-ministry","pre-ministerial","ministerial preparation","preparatory training"],"phonetic":"/ˌpriːˈmɪnɪstri/","extraExplanation":["这个词在日常英语里不算常见，更常见的写法是带连字符的 pre-ministry（如 pre-ministry training / pre-ministry students）。在宗教教育、教会实习、神学院申请等语境中更容易见到。","注意不要和 “prime ministry”（首相/总理办公室）混淆：preministry 是 “在 ministry（事工）之前”，而 prime ministry 是政府体系里的机构名称。"]}
{"word":"premio","summary":{"en":"“Premio” usually means “prize/award” in Spanish or Italian, and is often seen in the names of major literary or cultural awards.","zh":"“premio”在西班牙语/意大利语中通常指“奖、奖项”，在英文中多见于各类文学、文化奖项的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish/Italian) a prize or award given to someone for an achievement, contest, or honor.","zh":"（西班牙语/意大利语）奖；奖项；奖励（因成就、比赛或荣誉而颁发）。"},"examples":[{"en":"She won a premio for her short story at a local festival.","zh":"她在当地文化节上凭短篇小说获得了一个奖项（premio）。"},{"en":"The film received a premio for best director.","zh":"这部电影获得了“最佳导演奖”。"}]},{"partOfSpeech":"n.","definition":{"en":"A named prize or award title (often capitalized), used in the names of competitions and institutions.","zh":"（常大写）某个特定奖项/竞赛的名称，用于奖项或机构名称中。"},"examples":[{"en":"He was nominated for the Premio Cervantes.","zh":"他被提名角逐塞万提斯奖（Premio Cervantes）。"},{"en":"The book earned the Premio Strega in Italy.","zh":"这本书在意大利获得了斯特雷加文学奖（Premio Strega）。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand or model name (for example, in cars or products) where “Premio” is used as a proper noun.","zh":"（专有名词）品牌名/型号名（如汽车或产品中用“Premio”作名称）。"},"examples":[{"en":"He drives a Toyota Premio.","zh":"他开的是一辆丰田 Premio。"}]}],"synonyms":["prize","award","accolade","honor"],"phonetic":"/ˈprɛmioʊ/","extraExplanation":["“premio”在英语里不是常见的普通词汇，更常见于西语/意语语境或奖项名称中；如果在英文文章里使用，通常保留原文并按原语规则大写（如奖项名）。","词形小提示：西班牙语复数常见为“premios”；意大利语复数常见为“premi”。","如果你本来想查的是英语“premium”（溢价/保费/高端的），拼写不同，但来源同样和“奖赏/报酬”有关。"]}
{"word":"premious","summary":{"en":"“Premious” is not standard English; it is usually a misspelling of “precious,” meaning very valuable or deeply loved.","zh":"“premious”不是标准英语，通常是“precious”的拼写错误，意思是“珍贵的/宝贵的、令人珍爱的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; usually a misspelling of “precious.”","zh":"非标准拼写；通常是把“precious”拼错了。"},"examples":[{"en":"I think you meant “precious,” not “premious.”","zh":"我觉得你想写的是“precious”，不是“premious”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Intended word: “precious”) very valuable or important to you, especially emotionally.","zh":"（应为“precious”）非常珍贵的；（尤指情感上）非常重要的。"},"examples":[{"en":"This photo is precious to my family.","zh":"这张照片对我们家来说很珍贵。"},{"en":"Time with loved ones is precious.","zh":"和所爱的人在一起的时间很宝贵。"}]},{"partOfSpeech":"n.","definition":{"en":"(“Precious”) a loved person or thing; something treasured.","zh":"（“precious”）心爱的人或物；珍爱之物。"},"examples":[{"en":"Be careful with that vase—it’s a precious.","zh":"小心那个花瓶——那是件珍品。"}]}],"synonyms":["valuable","treasured","beloved","dear","priceless"],"phonetic":"/ˈprɛʃəs/","extraExplanation":["“premious”在现代英语里几乎不使用，词典中一般找不到。最常见的情况是把“precious”（珍贵的）拼错了：pre-ci-ous。","“precious”也可带一点讽刺或夸张语气，表示“装腔作势/自以为是”（多见于英式英语语境），例如：Don’t be so precious about it.（别那么矫情/别太小题大做。）"]}
{"word":"premisal","summary":{"en":"Premisal means “related to a premise or assumptions used in an argument.” It’s a rare adjective, mostly seen in academic writing.","zh":"Premisal 指“与前提/假设（论证依据）有关的”。这是个较少见的形容词，多用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a premise (an assumption or statement used as a basis for reasoning).","zh":"（少见）与“前提、假设、论据”有关的；前提性的。"},"examples":[{"en":"The argument fails because its premisal assumptions are not proven.","zh":"这个论证失败了，因为它的前提性假设没有被证明。"},{"en":"She challenged the premisal claim before discussing the conclusion.","zh":"在讨论结论之前，她先质疑了那个前提性主张。"}]}],"synonyms":["premise-based","assumptive","foundational","presuppositional"],"phonetic":"/ˈprɛmɪsəl/","extraExplanation":["“premisal”在日常英语里很少见，更常用的表达是“premise-based”（以某个前提为基础的）或“based on the premise that …”（基于……这一前提）。","词源上它来自“premise（前提）+ -al（形容词后缀）”。在逻辑、哲学、学术写作中偶尔会见到，用来强调“属于前提层面”的内容。"]}
{"word":"premise","summary":{"en":"Premise most commonly means a starting assumption in reasoning; in legal/formal contexts it can also mean a property or place.","zh":"premise 最常见义为“推理/论证的前提”；在法律或正式语境中也可指“房屋及其场地（不动产/场所）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a statement or idea that you accept as true and use as a basis for reasoning or an argument","zh":"（论证/推理的）前提；前提条件（被视为真实，用来推导结论的陈述或观点）"},"examples":[{"en":"The argument is based on the premise that all people are equal.","zh":"这个论证建立在“人人平等”这一前提之上。"},{"en":"If your premise is wrong, your conclusion may be wrong too.","zh":"如果你的前提错了，你的结论也可能会错。"}]},{"partOfSpeech":"n.","definition":{"en":"a building and the land it stands on; property, especially in formal or legal language","zh":"（正式/法律用语）房屋及其占用土地；不动产；场所"},"examples":[{"en":"No smoking is allowed on the premises.","zh":"场所内禁止吸烟。"},{"en":"The police searched the premises with a warrant.","zh":"警方持搜查令对该处房屋及场地进行了搜查。"}]},{"partOfSpeech":"vt.","definition":{"en":"to set out an idea or claim as a starting point for an argument (formal)","zh":"（正式）提出…作为前提；以…为论证起点"},"examples":[{"en":"The essay is premised on the belief that education changes lives.","zh":"这篇文章以“教育能改变人生”的信念为前提展开。"}]}],"synonyms":["assumption","basis","starting point","proposition","property (legal sense)","site"],"phonetic":"/ˈprɛmɪs/","extraExplanation":["易混点：premise（前提）常用于逻辑/写作；而 preface 是“前言/序”，preliminary 是“初步的”。","法律与告示语里常见 on the premises（在本场所/本区域内）。注意 premises 多用复数形式表示“场地/营业场所”。"]}
{"word":"premised","summary":{"en":"“Premised (on/upon)” means “based on” or “built on” an assumption or condition, often in formal writing.","zh":"“premised（on/upon）”常指“以……为基础/前提”，多用于正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"based on a particular idea, assumption, or condition; built from it","zh":"以某个观点/假设/条件为基础的；建立在其上的"},"examples":[{"en":"The proposal is premised on the belief that public transit will reduce traffic.","zh":"这项提案以“公共交通能减少拥堵”的信念为基础。"},{"en":"Her argument is premised on incomplete data, so the conclusion is weak.","zh":"她的论证建立在不完整的数据之上，所以结论站不住脚。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “premise” (to base something on an assumption or condition)","zh":"“premise”的过去式/过去分词：以……为前提（或依据）"},"examples":[{"en":"The policy was premised on cooperation between the two departments.","zh":"该政策以两个部门之间的合作为前提。"},{"en":"They premised their strategy on rapid growth in online sales.","zh":"他们把策略建立在网购销售快速增长的假设上。"}]}],"synonyms":["based on","grounded in","founded on","built on","predicated on"],"phonetic":"/ˈprɛmɪst/","extraExplanation":["“premised on/upon …”是最常见搭配，语气偏正式，常用于学术写作、政策文件、法律语境，表示“以……为基础/前提”。","不要与名词“premise（前提）/premises（论证前提们）”或“premises（房屋/场所）”混淆：例如“on the premises”指“在场所内”。"]}
{"word":"premises","summary":{"en":"“Premises” most often means a building and its land (a formal word for a place). It can also mean the premises of an argument: the assumptions or statements that lead to a conclusion.","zh":"“premises”最常见意思是“房屋及其所属土地/场所”（较正式）。也可指“论证的前提”：用来推出结论的假设或陈述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building and the land it is on; a place (often used in formal/legal or business contexts)","zh":"（常用于正式/法律/商业语境）房屋及其所属土地；场所；经营地点"},"examples":[{"en":"No smoking is allowed on the premises.","zh":"场所内禁止吸烟。"},{"en":"The police searched the premises after the alarm went off.","zh":"警报响起后，警方搜查了该处房屋及周边范围。"},{"en":"Customers must leave the premises by 10 p.m.","zh":"顾客必须在晚上十点前离开店内/场地。"}]},{"partOfSpeech":"n.","definition":{"en":"statements or ideas that form the basis for a conclusion or argument (used in logic or debate)","zh":"（逻辑/辩论中）前提；用来推出结论的陈述或假设"},"examples":[{"en":"If the premises are true, the conclusion should follow.","zh":"如果前提为真，就应该能推出结论。"},{"en":"Her argument is strong, but I disagree with one of her premises.","zh":"她的论证很有力，但我不同意其中一个前提。"}]}],"synonyms":["property","building","site","location","grounds","assumptions","basis"],"phonetic":"/ˈprɛmɪsɪz/","extraExplanation":["“premises”在表示“房屋/场所”时，英语里常用复数形式（on the premises / leave the premises），即使指的是一个地点也常写成premises，这在法律文件、租赁合同、店铺告示里特别常见。","表示“前提”时，“premise”既可作名词，也可作动词（to premise A on B = 以B为依据/前提来建立A）。但日常写作里更常见的是名词用法。"]}
{"word":"premising","summary":{"en":"“Premising” means assuming something as a starting point or basing an argument on a stated premise (formal).","zh":"“Premising”表示“以……为前提来假定”或“把论证建立在某个前提之上”（较正式用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"assuming something is true as a starting point for reasoning; basing an argument on an initial idea or statement","zh":"把某事当作前提来假定为真；以某个起点/前提来展开推理或论证"},"examples":[{"en":"Premising that the data is accurate, we can estimate next year’s sales.","zh":"在假定数据准确的前提下，我们可以估算明年的销售额。"},{"en":"The report is premising its conclusions on a small sample size.","zh":"这份报告的结论是建立在一个很小的样本量这个前提之上的。"},{"en":"She began by premising that everyone would act in good faith.","zh":"她一开始就以“大家都会善意行事”为前提来讨论。"}]}],"synonyms":["assuming","presuming","supposing","basing (on)","positing"],"phonetic":"/prɪˈmaɪzɪŋ/","extraExplanation":["“premising”来自动词 premise（= assume / base on a premise），常见于较正式的写作与学术语境。要注意：名词 premise（前提/基本假设）与动词 premise（以……为前提）读音不同——名词多读 /ˈprɛmɪs/，动词读 /prɪˈmaɪz/。","常见搭配：premise that + 从句（以……为前提）；premise A on B（把A建立在B之上）。"]}
{"word":"premisory","summary":{"en":"“Premisory” is usually a misspelling of “promissory,” meaning “related to a (legal/financial) promise to pay.”","zh":"“premisory”多为“promissory”的误拼，意为“与（法律/金融上的）付款承诺有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “promissory”) relating to a promise to pay money, especially in a legal or financial document.","zh":"（通常拼作 promissory）与“承诺付款”有关的，尤指法律或金融文件中的付款承诺。"},"examples":[{"en":"She signed a promissory note to repay the loan in twelve months.","zh":"她签署了一张本票（promissory note），承诺在十二个月内还清贷款。"},{"en":"The bank asked for promissory documents before releasing the funds.","zh":"银行在放款前要求提供与付款承诺相关的文件。"}]}],"synonyms":["promising (not legal sense)","obligatory","binding","contractual"],"phonetic":"ˈprɑməˌsɔri","extraExplanation":["“premisory”通常被认为是拼写错误或少见变体；标准拼写是 **promissory**。最常见搭配是 **promissory note**（本票/借据），指写明欠款金额、还款时间与签署人承诺的正式文件。","词源上与 **promise（承诺）** 同源，所以核心含义就是“基于承诺（尤其是还款承诺）的”。"]}
{"word":"premisrepresent","summary":{"en":"Misrepresent means to describe or present something inaccurately or misleadingly, often deliberately.","zh":"misrepresent 指以不准确或具有误导性的方式描述/呈现（常带故意歪曲之意）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To describe or show someone or something in an inaccurate or misleading way (often on purpose).","zh":"（常指故意）歪曲、误述或以误导方式描述/呈现某人或某事。"},"examples":[{"en":"The article misrepresented what she said in the interview.","zh":"那篇文章歪曲了她在采访中的原话。"},{"en":"He felt the report misrepresented the company’s financial situation.","zh":"他觉得那份报告误导性地呈现了公司的财务状况。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give false or incomplete information, especially in order to gain an advantage.","zh":"（为获取利益而）提供虚假或不完整的信息；虚假陈述。"},"examples":[{"en":"She was accused of misrepresenting her experience on her resume.","zh":"她被指控在简历上虚报自己的工作经历。"},{"en":"It’s illegal to misrepresent the condition of a product in an advertisement.","zh":"在广告中虚假陈述产品状况是违法的。"}]}],"synonyms":["distort","twist","misstate","falsify","mislead","mischaracterize"],"phonetic":"/ˌmɪsˌrɛprɪˈzɛnt/","extraExplanation":["“premisrepresent”不是常见或标准英语单词，通常是拼写错误。你很可能想写的是“misrepresent”（歪曲/误述）。","如果你本意是加前缀“pre-”，英语里一般不会说“pre-misrepresent”。更自然的表达是：to misrepresent in advance（提前歪曲）、to preemptively misrepresent（先发制人地歪曲）或 to mischaracterize beforehand（事先曲解）。","词根提示：represent=“代表/呈现/描述”；mis-=“错误地/不当地”。所以 misrepresent 字面意思就是“错误地呈现”。"]}
{"word":"premisrepresentation","summary":{"en":"Misrepresentation means presenting something falsely or misleadingly; it’s also a legal term for a false statement that can affect a contract.","zh":"Misrepresentation 指对事实作虚假或误导性的呈现；在法律上也指可能影响合同的虚假陈述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A false or misleading statement (or way of presenting facts) that makes something seem better, worse, or different than it really is.","zh":"虚假陈述；误导性说法（或呈现事实的方式），使事情看起来比实际更好、更差或不同。"},"examples":[{"en":"The ad was accused of misrepresentation because it hid important fees in small print.","zh":"这则广告被指控存在误导性陈述，因为它把重要费用藏在小字条款里。"},{"en":"He apologized for the misrepresentation and corrected the numbers in the report.","zh":"他为不实陈述道歉，并在报告中更正了数据。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) A false statement that can affect an agreement or decision; in some cases it can make a contract invalid.","zh":"（法律）可能影响协议或决定的虚假陈述；在某些情况下可导致合同无效。"},"examples":[{"en":"The buyer claimed misrepresentation about the car’s accident history.","zh":"买方主张卖方对车辆事故史作了虚假陈述。"},{"en":"If misrepresentation is proven, the contract may be canceled.","zh":"如果虚假陈述被证实，合同可能被撤销。"}]}],"synonyms":["falsehood","distortion","deception","misstatement","inaccuracy"],"phonetic":"/ˌmɪsˌrɛprɪzɛnˈteɪʃən/","extraExplanation":["你输入的“premisrepresentation”在英语中不常见，通常是拼写错误。最可能的目标词是 **misrepresentation**（虚假陈述/误导）。","如果你想表达“对前提（premise）的误导/歪曲”，更自然的说法是：**a misrepresentation of the premise** 或 **misrepresenting the premise**。"]}
{"word":"premiss","summary":{"en":"Premiss means a premise: a starting assumption used to support reasoning, or (less commonly) the central idea of a story or plan.","zh":"premiss 指“前提/设定”：用于推理论证的起点假设；较少见时也指故事或计划的核心概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled “premise”) a statement or idea that you accept as true and use as a basis for reasoning or an argument (especially in logic).","zh":"（也拼作 premise）前提：在推理或论证中被接受为真的陈述或观点，用作推理基础（尤用于逻辑学）。"},"examples":[{"en":"If the premiss is wrong, the conclusion may be wrong too.","zh":"如果前提是错的，结论也可能会错。"},{"en":"The argument depends on the premiss that everyone has equal access to education.","zh":"这个论证依赖于“每个人都能平等接受教育”这一前提。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the basic idea or starting situation of a book, movie, or plan; the central concept.","zh":"（较少见）故事/电影/计划的基本设定或核心概念。"},"examples":[{"en":"The film’s premiss is simple: two strangers wake up in the wrong bodies.","zh":"这部电影的设定很简单：两个陌生人醒来后发现身体互换了。"},{"en":"It’s a clever premiss, but the story needs stronger characters.","zh":"这个核心概念很巧妙，但故事需要更立体的人物。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to state something as a premiss before giving an argument; to assume as a starting point.","zh":"（罕用）把某事作为前提提出；作为论证的起点来假设。"},"examples":[{"en":"Let us premiss that resources are limited, and then discuss priorities.","zh":"我们先把“资源有限”作为前提，再讨论优先顺序。"}]}],"synonyms":["premise","assumption","basis","foundation","starting point"],"phonetic":"/ˈprɛmɪs/","extraExplanation":["“premiss”是“premise”的较旧/较少见拼法。现代英语中更常用“premise”。","在逻辑里常见搭配：major premiss（大前提）、minor premiss（小前提）、draw a conclusion（得出结论）。","注意区分：premise（前提/设定）与 premises（房屋及其附属场地，常用于法律或告示：No smoking on the premises）。"]}
{"word":"premissable","summary":{"en":"“premissable” is generally a misspelling of “permissible,” meaning “allowed.”","zh":"“premissable”通常是“permissible”的误拼，意思是“被允许的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of **permissible**: allowed by rules, law, or social norms. Examples: EN: Smoking is not permissible in the building. / ZH: 大楼内不允许吸烟。 EN: Is it permissible to take photos here? / ZH: 这里可以拍照吗？","zh":"（非标准拼写）通常是 **permissible** 的误拼：指被规则、法律或社会规范所允许。例：EN: Smoking is not permissible in the building. / ZH: 大楼内不允许吸烟。EN: Is it permissible to take photos here? / ZH: 这里可以拍照吗？"},"examples":[{"en":"Smoking is not permissible in the building.","zh":"大楼内不允许吸烟。"},{"en":"Is it permissible to take photos here?","zh":"这里可以拍照吗？"}]}],"synonyms":["allowed","acceptable","permitted","lawful"],"phonetic":"pərˈmɪsəbəl","extraExplanation":["“premissable”在现代英语中不是常见或标准的拼写。正式写作、考试、邮件中建议使用 **permissible**。","容易混淆：**premise**（n. 前提；房屋/场所）与 **permissible**（adj. 允许的）拼写和含义不同。"]}
{"word":"premisses","summary":{"en":"“Premisses” is a less common spelling of “premises,” meaning either (1) a place/property or (2) the assumptions/facts that support an argument.","zh":"“premisses”是“premises”的不常见拼写，可指（1）场所/房产，或（2）论证的前提/依据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) A building and the land it is on; the place where a business or activity happens.","zh":"（复数名词）房屋及其所属土地；（公司、机构等的）经营场所、场地。"},"examples":[{"en":"No smoking is allowed on the premises.","zh":"场所内禁止吸烟。"},{"en":"Please wait outside the hotel premises.","zh":"请在酒店场地外等候。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Statements or facts that are used as the basis for an argument or conclusion.","zh":"（复数名词）（推理、论证的）前提、依据。"},"examples":[{"en":"If your premises are wrong, your conclusion may be wrong too.","zh":"如果你的前提不对，结论也可能不对。"},{"en":"The argument is based on two key premises.","zh":"这个论证建立在两个关键前提之上。"}]}],"synonyms":["property","site","building","assumptions","grounds (for)","basis"],"phonetic":"/ˈprɛmɪsɪz/","extraExplanation":["“premisses”是“premises”的较少见拼写（更偏英式/旧式用法）；现代英语里更常用“premises”。","在逻辑/写作中，单数是“premise”（前提）；复数是“premises”。但在“经营场所/房产”这个意思上，英语里通常直接用复数“premises”来指一个地点（如：on the premises）。"]}
{"word":"premit","summary":{"en":"Permit means to allow something, or an official document giving permission.","zh":"permit 表示“允许；准许”，也可指“许可证/执照”等官方许可文件。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to allow something to happen; to give permission","zh":"允许某事发生；准许；许可"},"examples":[{"en":"Smoking is not permitted in this building.","zh":"这栋楼里不允许吸烟。"},{"en":"The rules permit students to use a dictionary during the test.","zh":"规定允许学生在考试中使用词典。"},{"en":"My parents won’t permit me to stay out late.","zh":"我父母不允许我在外面待到很晚。"}]},{"partOfSpeech":"n.","definition":{"en":"an official document that gives you permission to do something","zh":"许可证；执照（官方文件，允许你做某事）"},"examples":[{"en":"You need a permit to park here.","zh":"在这里停车需要许可证。"},{"en":"They applied for a building permit.","zh":"他们申请了建筑许可（施工许可证）。"}]}],"synonyms":["allow","let","authorize","approve","license"],"phonetic":"/pərˈmɪt/","extraExplanation":["你输入的“premit”通常是拼写错误，正确拼写是 permit。","permit 的重音会随词性变化：作动词常读 /pərˈmɪt/（重音在后）；作名词常见重音在前（很多人读作 PER-mit）。本条只给出一个常用的美式 IPA。","常见搭配：permit sb to do sth（允许某人做某事）；parking/building/work permit（停车/建筑/工作许可）；permit required（需要许可）。"]}
{"word":"premium","summary":{"en":"Premium most often means “high-end or more expensive with extra benefits” (adj.), and it can also mean “insurance payment” or “extra charge/price above normal” (n.).","zh":"Premium常指“高端/更贵并带额外权益的”（形容词）；也可作名词表示“保费”或“额外费用/溢价”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a higher-quality or more expensive version of something, often with extra benefits or features","zh":"（商品/服务的）高端的；价格更高的；通常带有额外福利或功能的"},"examples":[{"en":"This app has a premium plan with more storage.","zh":"这个应用有高级方案，提供更多存储空间。"},{"en":"They sell premium coffee made from carefully selected beans.","zh":"他们卖精品咖啡，用精心挑选的咖啡豆制作。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount paid regularly for insurance or a special service","zh":"（保险/特殊服务的）保费；定期缴纳的费用"},"examples":[{"en":"My car insurance premium went up this year.","zh":"我今年的汽车保险保费上涨了。"},{"en":"If you pay the premium monthly, it’s easier to budget.","zh":"如果按月缴保费/服务费，更容易做预算。"}]},{"partOfSpeech":"n.","definition":{"en":"an extra payment or something added on top of the basic price or value","zh":"额外费用；溢价（在基础价格/价值之上的加价）"},"examples":[{"en":"There’s a premium for same-day delivery.","zh":"当天送达需要额外加价。"},{"en":"Investors paid a premium to buy the company’s shares.","zh":"投资者以溢价购买该公司的股票。"}]}],"synonyms":["high-end","top-quality","upscale","deluxe","insurance payment","surcharge","markup"],"phonetic":"/ˈpriːmiəm/","extraExplanation":["“Premium”在现代生活中很常见，尤其出现在订阅制服务（premium plan/account）、电商（premium delivery/packaging）和金融保险（insurance premium）里。作形容词时强调“更高品质/更高价位”；作名词时在保险领域几乎固定指“保费”，在商业/投资语境里常指“溢价/加价”。","在营销语境中，“premium”有时带有主观色彩：商家用它传达“更好、更值得”，但是否真的更高品质要看具体指标（材料、功能、服务条款等）。"]}
{"word":"premiums","summary":{"en":"“Premiums” most often means insurance payments; it can also mean extra charges (a premium price) or promotional gifts/prizes.","zh":"“Premiums”最常指“保险保费”；也可指“溢价/额外费用”，或“促销赠品/奖品”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of premium) an amount of money paid regularly for insurance (for example, health, car, or home insurance).","zh":"（premium 的复数）保险费；保费（如健康险、车险、房屋险等需要定期缴纳的费用）。"},"examples":[{"en":"Our health insurance premiums went up again this year.","zh":"我们的健康保险保费今年又上涨了。"},{"en":"If you pay premiums on time, your coverage stays active.","zh":"如果你按时缴纳保费，你的保障就会保持有效。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of premium) extra money paid on top of a usual price or salary, often for special service, higher risk, or better quality.","zh":"（premium 的复数）溢价；额外费用（在常规价格或薪酬之外支付的额外金额，常因更好品质、特殊服务或更高风险）。"},"examples":[{"en":"Investors are paying high premiums for homes in that neighborhood.","zh":"投资者愿意为那个社区的房子支付很高的溢价。"},{"en":"Night-shift workers often receive premiums for working late hours.","zh":"上夜班的员工通常会因为晚间工作获得额外津贴。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of premium) special gifts or prizes offered to encourage people to buy something or take an action.","zh":"（premium 的复数）赠品；奖品（为促销或鼓励行动而提供的礼品/奖励）。"},"examples":[{"en":"The store offered small premiums with every purchase.","zh":"这家店每次购物都会送小赠品。"},{"en":"Credit card sign-up premiums can include miles or cash back.","zh":"信用卡开卡奖励可能包括里程或返现。"}]}],"synonyms":["insurance payments","insurance fees","surcharges","markups","bonuses","perks","giveaways","promotional gifts"],"phonetic":"/ˈpriːmiəm/","extraExplanation":["“Premium”常见于金融与商业语境：保险里指“保费”，市场交易里常说“at a premium（溢价）/ at a discount（折价）”。在口语中提到“my premiums”时，多半默认指保险保费。"]}
{"word":"premix","summary":{"en":"Premix means a ready-to-use mixture of ingredients, or the act of mixing ingredients in advance.","zh":"Premix 指可直接使用的预先混合材料（预拌粉等），也可指“预先混合”这一动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prepared mixture of ingredients (often dry) that is ready to use, especially for baking or cooking","zh":"预拌粉；预先配好的材料混合物（常为干粉），可直接用于烘焙或烹饪"},"examples":[{"en":"I bought a pancake premix—just add water and cook.","zh":"我买了煎饼预拌粉——只要加水就能煎。"},{"en":"This bread premix is convenient for beginners.","zh":"这个面包预拌粉对新手很方便。"}]},{"partOfSpeech":"v.","definition":{"en":"to mix ingredients in advance before the main process (such as cooking, manufacturing, or blending)","zh":"预先混合（原料），在主要加工/烹饪/生产步骤之前先拌好"},"examples":[{"en":"Premix the dry ingredients before adding the eggs.","zh":"先把干性材料预拌好，再加入鸡蛋。"},{"en":"The factory premixes vitamins into the feed.","zh":"工厂会把维生素预先混入饲料中。"}]}],"synonyms":["mix","blend","ready mix","dry mix"],"phonetic":"/ˈpriːˌmɪks/","extraExplanation":["“premix”常见于包装食品与工业领域：在烘焙中多指“预拌粉”（如蛋糕粉、松饼粉）；在饲料、饮料、化工中也指把微量成分（如维生素、香料、添加剂）先与载体混匀，方便后续均匀分散与计量。","书写上既可作一个词“premix”，也可见到“pre-mix”。作为名词时通常重音在前（PRE-mix），作动词时也常保持类似读法。"]}
{"word":"premixed","summary":{"en":"Premixed means already mixed in advance (or to mix in advance), often used for foods, drinks, paint, and concrete.","zh":"Premixed 指“预先混合好的”（或“预先混合”），常用于食品饮料、油漆、混凝土等场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already mixed together before being sold or used","zh":"预先混合好的；成品式混合的（使用或销售前已混合）"},"examples":[{"en":"We used premixed concrete to save time on the job.","zh":"我们用预拌混凝土来节省工期。"},{"en":"This premixed salad dressing is convenient for busy nights.","zh":"这种预先调好的沙拉酱很适合忙碌的晚上。"}]},{"partOfSpeech":"v.","definition":{"en":"to mix (ingredients) in advance; to prepare a mixture before the main use","zh":"预先混合；提前把（原料）调好"},"examples":[{"en":"Premix the dry ingredients before adding the eggs.","zh":"先把干性材料预混，再加入鸡蛋。"},{"en":"The factory premixes the paint to keep the color consistent.","zh":"工厂会预先调漆，以保持颜色一致。"}]}],"synonyms":["pre-mixed","ready-mixed","preblended","pre-mix"],"phonetic":"/ˌpriːˈmɪkst/","extraExplanation":["“premixed / premix”常见于烹饪、饮料、化工与建筑领域，强调“为了方便与稳定品质，在使用前就已混好”。例如“premixed concrete（预拌混凝土）”“premixed cocktail（预调鸡尾酒）”。","在标签或说明书里，premixed 往往暗示“不需要再按比例混合/兑水或只需少量步骤”。但也要注意有些产品会写“ready-to-use（开封即用）”与“premixed（已混合）”不同：premixed 可能仍需要稀释、加热或摇匀。"]}
{"word":"premixer","summary":{"en":"A premixer is something (or someone) that mixes materials or audio tracks in an earlier stage before the final mixing step.","zh":"premixer 指在最终混合/混音之前进行初步混合的设备、步骤或人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine, container, or stage in a process that mixes ingredients or materials before the main mixing step.","zh":"（主混合之前的）预混机；预混装置；预混步骤"},"examples":[{"en":"Add the dry powder to the premixer before it goes into the main mixer.","zh":"把干粉先加入预混机，再送入主混合机。"},{"en":"Using a premixer helps distribute additives evenly.","zh":"使用预混装置有助于让添加剂分布更均匀。"}]},{"partOfSpeech":"n.","definition":{"en":"(Audio/film) A person or system that does an earlier stage of mixing—balancing and preparing tracks before the final mix.","zh":"（音频/影视）预混音师；预混音系统（在最终混音前做初步平衡与整理）"},"examples":[{"en":"The dialogue premixer cleaned up the voices before the final dub stage.","zh":"对白预混音师在最终混录前先把人声清理并整理好。"},{"en":"In post-production, premix sessions can save time during the final mix.","zh":"在后期制作中，预混环节能为最终混音节省时间。"}]}],"synonyms":["pre-mixer","preblend unit","pre-blender","pre-mix engineer (audio)","submixer (audio, related)"],"phonetic":"/ˈpriːmɪksər/","extraExplanation":["“premixer”通常出现在工业生产（如食品、化工、制药、饲料）和影视声音后期两大语境中。工业里强调“先把少量添加剂分散均匀”，避免结团或局部浓度过高；影视声音里“premix”常指先分别处理对白/音乐/音效等，再进入最终总混（final mix）。","词形上是“pre-（预先）+ mixer（混合器/混音者）”。在实际文本里也常见作定语：premixer tank（预混罐）、premixer stage（预混阶段）、premixer session（预混音场次）。"]}
{"word":"premixes","summary":{"en":"Premixes are ready-made mixtures prepared in advance; it can also mean “mixes in advance” as a verb form.","zh":"premixes 指预先配好的混合料（复数），也可作动词第三人称单数，表示“预先混合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prepared mixture of ingredients made in advance, ready to be used (often for baking, drinks, or industrial materials).","zh":"预先配好的混合料；预拌料（常用于烘焙、饮品或工业材料等）"},"examples":[{"en":"She bought a pancake premix to save time.","zh":"她买了煎饼预拌粉来省时间。"},{"en":"The factory adds vitamins to the premix before making the final product.","zh":"工厂在生产最终产品前会把维生素加入预混料中。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of premix: to mix ingredients before the main process or before use.","zh":"premix 的第三人称单数：在主要工序或使用前先把原料预先混合"},"examples":[{"en":"The recipe says he premixes the dry ingredients before adding eggs.","zh":"食谱说他会先把干性材料预先混合，再加入鸡蛋。"},{"en":"In production, the machine premixes the powder and oil for consistency.","zh":"在生产中，机器会先把粉末和油预混，以保证均匀。"}]}],"synonyms":["pre-mixed blend","mix","blend","prepared mix","base mix"],"phonetic":"/ˈpriːˌmɪks/","extraExplanation":["“premix”常见于包装食品（如 cake/pancake premix 预拌粉）、饲料/营养品行业（vitamin premix 维生素预混料）、以及建筑材料（premix mortar 预拌砂浆）。复数“premixes”通常指不同批次或不同配方的预混料。"]}
{"word":"premixing","summary":{"en":"Premixing means mixing materials beforehand so they are evenly combined and ready for later use.","zh":"Premixing 指在后续使用或加工前先把材料预先混合好，以保证均匀并便于操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of mixing ingredients or materials in advance (before the main step or final use), so they are evenly combined and ready to use","zh":"预混；预先把配料或材料混合好（在主要步骤或最终使用之前），以便更均匀、方便使用"},"examples":[{"en":"Premixing the dry ingredients helps the cake batter come out smooth.","zh":"先把干性材料预混，蛋糕面糊会更细腻。"},{"en":"In animal feed production, premixing vitamins ensures each batch has the right nutrients.","zh":"在饲料生产中，预混维生素能确保每一批都有合适的营养含量。"}]},{"partOfSpeech":"v.","definition":{"en":"mixing something in advance; preparing a mixture before a later processing step","zh":"预先混合（作为动作/过程）；在后续加工前先配成混合物"},"examples":[{"en":"They are premixing the paint colors to match the wall exactly.","zh":"他们正在预先调和（预混）油漆颜色，以便与墙面完全匹配。"},{"en":"The lab technician spent an hour premixing solutions before the experiment began.","zh":"实验开始前，实验员花了一小时预混溶液。"}]}],"synonyms":["preblending","pre-mixing","preparation mixing","blending beforehand"],"phonetic":"/priˈmɪksɪŋ/","extraExplanation":["“premixing”常见于工业与配方语境（食品、饲料、化工、涂料、混凝土等）。目的通常是：提高均匀性、减少结块、提升生产效率、让后续步骤更稳定。","在一些行业里会出现名词搭配：premix（预混料/预混粉）与 premixing（预混过程）。例如 feed premix（饲料预混料）、spice premix（香料预混）。"]}
{"word":"premixture","summary":{"en":"Premixture means a mixture prepared ahead of time for later use.","zh":"Premixture 指“预先配制好、供之后使用的混合物/预混料”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mixture made in advance, especially a prepared blend of ingredients used later in manufacturing, cooking, or construction","zh":"预先配制的混合物（尤指在制造、烹饪或施工中之后要使用的原料配方混合物）"},"examples":[{"en":"The bakery uses a premix for pancakes to save time in the morning.","zh":"这家烘焙店用预拌粉做煎饼，这样早上更省时。"},{"en":"Add water to the premixture and stir until smooth.","zh":"把水加入预混料中，搅拌至顺滑。"},{"en":"The contractor ordered a premixture of cement and sand for the small repair job.","zh":"承包商为这次小型修补工程订购了水泥和沙子的预拌料。"}]}],"synonyms":["premix","preblend","prepared mix"],"phonetic":"/ˈpriːmɪkstʃər/","extraExplanation":["“premixture”在日常英语里不如“premix”常见；在食品领域常指“预拌粉/预混粉（premix）”，在化工、饲料或建材领域也可指“预混料/预配料”。","词形上是 pre-（预先）+ mixture（混合物）。有些场景中会写作“pre-mixture”或更常用“premix”。"]}
{"word":"premodel","summary":{"en":"A “premodel” is an early or preliminary model, or the act of making one before the final version.","zh":"“premodel”指早期的初步模型，或指在最终版本前先做初步建模。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to build or create a preliminary model (a rough plan, mock-up, or simulation) before the final design or analysis","zh":"在正式设计或分析之前，先建立一个初步模型（草案、样机或模拟）"},"examples":[{"en":"Engineers premodel the airflow to see where heat might build up.","zh":"工程师会先对气流进行预建模，看看热量可能在哪里累积。"},{"en":"We premodeled the process in a spreadsheet before writing any code.","zh":"我们在写代码之前，先用电子表格对流程做了初步建模。"}]},{"partOfSpeech":"n.","definition":{"en":"a preliminary model made early in a project to test ideas or assumptions","zh":"用于早期测试想法或假设的初步模型"},"examples":[{"en":"The premodel showed that the original schedule was unrealistic.","zh":"这个初步模型显示原来的时间表不现实。"},{"en":"They revised the premodel several times before building the prototype.","zh":"他们在制作原型前多次修改初步模型。"}]}],"synonyms":["pre-model","make a preliminary model","prototype (informal/related)","mock up (related)","simulate (related)"],"phonetic":"/ˌpriˈmɑdəl/","extraExplanation":["“premodel / pre-model”并不是非常标准、固定的通用词，更多见于技术团队的内部表达（工程、数据分析、机器学习等）。更常见的说法是“build a preliminary model / create an early model”。","如果你想表达机器学习里的“预训练模型”，英语通常说“pretrained model”，而不是“premodel”。拼写上也常写作“pre-model”（加连字符）来避免歧义。"]}
{"word":"premodeled","summary":{"en":"Premodeled means already modeled in advance, often used for ready-made 3D/CAD assets.","zh":"Premodeled 指“预先建模过的/现成模型的”，常用于3D建模或CAD等领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already modeled (created as a model) in advance, especially before a later step like assembly, animation, analysis, or customization","zh":"预先建模过的；事先做成模型的（尤指在后续装配、动画、分析或定制之前就已完成建模）"},"examples":[{"en":"The game uses premodeled characters to save development time.","zh":"这款游戏使用预先建模过的角色来节省开发时间。"},{"en":"Choose a premodeled sofa from the library, then change the fabric color.","zh":"从素材库里选一个预先建模过的沙发，然后再改布料颜色。"},{"en":"The engineer ran stress tests on a premodeled part.","zh":"工程师对一个预先建模过的零件做了应力测试。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of the rare verb “premodel”: to model something in advance","zh":"（罕见）动词 premodel 的过去式/过去分词：预先建模"},"examples":[{"en":"They premodeled the main components before designing the final layout.","zh":"他们在设计最终布局前就把主要部件预先建模了。"}]}],"synonyms":["pre-modeled","prebuilt","pre-made","ready-made","already modeled"],"phonetic":"/ˌpriːˈmɑːdəld/","extraExplanation":["“premodeled”常见于3D建模/CAD/建筑可视化等领域，表示“现成的模型（ready-made model）”。在普通日常英语中不算高频，更常说“pre-made model / prebuilt model / already modeled”。"]}
{"word":"premodeling","summary":{"en":"Premodeling means doing preparatory work or giving an early demonstration before the main modeling or learning happens.","zh":"Premodeling 指在正式建模或学习前进行准备工作，或提前示范/预演以便后续模仿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Preparatory work done before the main modeling process (for example, planning, gathering reference, setting scale, or making rough shapes) in art, 3D design, engineering, or data/model development.","zh":"在正式“建模/塑形”之前进行的准备工作（如规划、收集参考资料、设定比例、做粗略形状等），常见于艺术、3D 设计、工程或数据/模型开发。"},"examples":[{"en":"In 3D animation, premodeling includes collecting reference images and blocking out basic shapes.","zh":"在 3D 动画里，premodeling 常包括收集参考图并先搭出基础形状。"},{"en":"We spent a day on premodeling to avoid mistakes in the final model.","zh":"我们花了一天做前期建模准备，以避免最终模型出错。"}]},{"partOfSpeech":"n.","definition":{"en":"In teaching, coaching, or therapy, demonstrating or rehearsing an example beforehand so someone can imitate the target behavior later.","zh":"在教学、训练或治疗中，先示范或预演一个例子，让学习者之后能模仿目标行为。"},"examples":[{"en":"Premodeling the conversation helped the student feel more confident.","zh":"先预演那段对话（premodeling）让学生更有信心。"},{"en":"The therapist used premodeling to show how to ask for help politely.","zh":"治疗师先示范如何礼貌地求助（premodeling）。"}]}],"synonyms":["preparation","planning","pre-modeling","preview demonstration","rehearsal"],"phonetic":"/ˌpriːˈmɑːdəlɪŋ/","extraExplanation":["“premodeling”不是非常固定的日常词，更常见的写法是加连字符的“pre-modeling”，意思更清晰。","不同领域里“modeling”含义不一样：在 3D/工程里偏“建模/塑形”，在教育与行为训练里偏“示范”。理解时要看上下文。"]}
{"word":"premodern","summary":{"en":"Premodern describes things from before the modern era, especially in historical or academic contexts.","zh":"Premodern 指“现代之前”的事物，常用于历史或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a time before modern society and industry, often describing cultures, ideas, or history before modern science, technology, and institutions became dominant.","zh":"与“现代”之前的时代有关的；常指在现代科学、技术与制度成为主流之前的文化、观念或历史。"},"examples":[{"en":"The course compares premodern and modern views of the universe.","zh":"这门课比较前现代与现代对宇宙的看法。"},{"en":"Premodern cities often grew around markets, temples, or fortresses.","zh":"前现代城市常围绕集市、寺庙或要塞发展起来。"},{"en":"She studies premodern Japanese literature.","zh":"她研究前现代日本文学。"}]}],"synonyms":["pre-modern","preindustrial","ancient (context-dependent)","medieval (context-dependent)"],"phonetic":"/ˌpriːˈmɑːdɚn/","extraExplanation":["“premodern”常用于学术语境（历史、艺术史、宗教学、人类学等），用来粗略区分“现代性（modernity）”之前的社会形态。它不是一个精确年代：在欧洲语境里常大致涵盖古代与中世纪；放到全球语境则可能因地区不同而有所变化。","与“ancient（古代的）”“medieval（中世纪的）”相比，“premodern”更强调“尚未进入现代化体系”这一对比关系；与“traditional（传统的）”相比，它更偏时间分期与历史研究的说法。"]}
{"word":"premodification","summary":{"en":"Premodification is noun modification placed before the noun (like adjectives or noun modifiers).","zh":"Premodification 指名词前的修饰（如形容词或名词作定语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In grammar) the use of one or more words placed before a noun to describe or limit it (for example, adjectives or noun modifiers).","zh":"（语法）名词前置修饰：用一个或多个词放在名词前面来描述或限定名词（如形容词或名词作定语）。"},"examples":[{"en":"In “a beautiful old house,” “beautiful” and “old” are examples of premodification of “house.”","zh":"在“a beautiful old house”中，“beautiful”和“old”就是对“house”的前置修饰。"},{"en":"English often prefers premodification, as in “a three-year plan,” rather than a longer phrase.","zh":"英语常偏好前置修饰，如“a three-year plan”，而不是更长的短语。"}]},{"partOfSpeech":"n.","definition":{"en":"A premodifying element itself; a word or phrase that appears before a noun and modifies it.","zh":"前置修饰成分；出现在名词之前并修饰它的词或短语。"},"examples":[{"en":"In “student loan program,” “student loan” functions as a premodification of “program.”","zh":"在“student loan program”中，“student loan”作为“program”的前置修饰成分。"},{"en":"Too many premodifications can make a sentence hard to read.","zh":"前置修饰成分过多会让句子更难读。"}]}],"synonyms":["pre-nominal modification","prenominal modification"],"phonetic":"/ˌpriːˌmɑːdɪfɪˈkeɪʃən/","extraExplanation":["在英语写作中，前置修饰常见于“形容词 + 名词”（a strong team）以及“名词 + 名词”（data analysis, family business）。后者在中文学习者眼里容易误解为“名词所有格”，但很多时候只是类别/用途关系。","前置修饰堆叠过多时，读者需要先“解码”一串修饰语才能见到中心名词，例如“long-term regional public health funding strategy”。写作上可以适当改成后置修饰（用of短语、定语从句等）来提高清晰度。","相关对比：premodification（前置） vs. postmodification（后置，如“the book on the table”“the people who came yesterday”）。"]}
{"word":"premodified","summary":{"en":"Premodified means “having modifiers placed before a noun,” or more generally “modified in advance.”","zh":"premodified 指“名词前有前置修饰语”，更广义也可指“事先修改/调整过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing a noun (or noun phrase) that has words placed before it to add information (premodifiers), such as adjectives or other nouns.","zh":"（语言学）指名词（或名词短语）前面带有修饰成分（前置修饰语）的结构，如形容词或名词用来修饰后面的名词。"},"examples":[{"en":"In “a beautiful old house,” the noun “house” is premodified by “beautiful” and “old.”","zh":"在“a beautiful old house”中，名词“house”被“beautiful”和“old”作前置修饰。"},{"en":"English often uses premodified noun phrases in headlines, like “city budget cuts.”","zh":"英语标题里常用前置修饰的名词短语，比如“city budget cuts（城市预算削减）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Changed or adjusted in advance; modified beforehand (often in technical or planning contexts).","zh":"事先调整过的；预先修改的（常用于技术或规划语境）。"},"examples":[{"en":"The device ships with a premodified firmware version for safety testing.","zh":"该设备出厂时带有为安全测试而预先修改过的固件版本。"},{"en":"We used premodified templates to speed up the report writing.","zh":"我们使用预先修改好的模板来加快报告撰写。"}]}],"synonyms":["modified beforehand","changed in advance","pre-adjusted","pre-edited"],"phonetic":"/ˌpriːˈmɑːdɪˌfaɪd/","extraExplanation":["在英语语法里，premodifier（前置修饰语）常见类型包括：形容词（a new plan）、名词作定语（a coffee shop）、数量词/限定词（three books, the book）、以及较长的名词短语（a high-school student）。相对地，放在名词后面的修饰叫 postmodifier（后置修饰语），如介词短语（the book on the table）或定语从句（the book that I bought）。","“premodified”多见于语法分析、写作课堂或语言学论文里；日常口语更常说“modified beforehand / changed in advance”。"]}
{"word":"premodifies","summary":{"en":"“premodifies” means “modifies something by coming before it,” used in grammar/linguistics.","zh":"“premodifies”指“以前置方式修饰”，多用于语法/语言学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(In grammar) to modify a word or phrase by placing the modifier before it.","zh":"（语法）以前置方式修饰某个词或短语；修饰语放在被修饰成分之前。"},"examples":[{"en":"In the noun phrase “red car,” “red” premodifies “car.”","zh":"在名词短语“red car”中，“red”以前置方式修饰“car”。"},{"en":"The adverb “really” premodifies the adjective in “really important.”","zh":"在“really important”中，副词“really”以前置方式修饰形容词。"}]}],"synonyms":["modifies (before)","precedes as a modifier","pre-modifies"],"phonetic":"/ˌpriːˈmɑːdəˌfaɪz/","extraExplanation":["“premodifies”是动词第三人称单数形式，原形是“premodify”。常见于语言学/语法分析（尤其是名词短语 noun phrase）。","与之相对的是“postmodify（后置修饰）”，例如“the book on the table”中，“on the table”后置修饰“book”。","英语里常见的前置修饰包括：形容词（a beautiful day）、名词作定语（a coffee cup）、数量词/限定词（these students）、以及某些副词对形容词的修饰（very cold）。"]}
{"word":"premodify","summary":{"en":"Premodify means to describe something by putting the modifier before the main word (often a noun).","zh":"premodify 指用修饰语放在中心词（常为名词）前来进行修饰。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Linguistics, grammar) To modify a word (especially a noun) by placing descriptive words or phrases before it.","zh":"（语言学/语法）用词语或短语放在中心词（尤其是名词）前面来修饰它；作“前置修饰”。"},"examples":[{"en":"In the phrase “a beautiful old house,” “beautiful” and “old” premodify “house.”","zh":"在短语 “a beautiful old house” 中，“beautiful”和“old”前置修饰“house”。"},{"en":"English often premodifies nouns with adjectives, but some languages prefer modifiers after the noun.","zh":"英语常用形容词前置修饰名词，但有些语言更常把修饰语放在名词后面。"}]}],"synonyms":["modify (before the noun)","prepose (grammar)","attribute (in front)"],"phonetic":"/priːˈmɑːdɪfaɪ/","extraExplanation":["“premodify”是语法术语，常见于语言学和写作分析里：修饰语在名词前面叫前置修饰（premodification）；在名词后面叫后置修饰（postmodification），如 “the house on the hill”。","英语中常见的前置修饰包括：形容词（a small car）、名词作定语（a coffee cup）、分词（a broken window）以及某些短语（a well-known artist）。修饰语越长，英语往往更倾向于放在名词后面以避免句子头重脚轻。"]}
{"word":"premodifying","summary":{"en":"Premodifying means modifying something by coming before it, especially before a noun in a noun phrase.","zh":"Premodifying 指“前置修饰”：修饰语位于被修饰成分之前，尤指在名词短语中放在名词前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) describing a word or phrase that modifies something (especially a noun) by coming before it.","zh":"（语法）指某个词或短语通过出现在被修饰成分（尤其是名词）之前来起修饰作用的。"},"examples":[{"en":"In “a beautiful day,” “beautiful” is a premodifying adjective before the noun “day.”","zh":"在“a beautiful day”中，“beautiful”是放在名词“day”前面的前置修饰形容词（premodifying）。"},{"en":"The phrase “very quickly” is premodifying in “very quickly solved problem,” because it comes before “solved.”","zh":"在“very quickly solved problem”中，“very quickly”位于“solved”之前，因此是前置修饰（premodifying）。"},{"en":"English often allows several premodifying words, as in “a small old stone house.”","zh":"英语常允许多个前置修饰语，例如“a small old stone house（一个小的、旧的、石头房子）”。"}]}],"synonyms":["prenominal","attributive","pre-nominal modifying"],"phonetic":"/ˌpriːˈmɑːdəˌfaɪɪŋ/","extraExplanation":["这是语法学里的术语，常用于讲“名词短语（noun phrase）”结构：\n- premodifying（前置修饰）= 修饰语在中心词（head）前面，如“a red car”里的“red”。\n- postmodifying（后置修饰）= 修饰语在中心词后面，如“the car in the garage”里的“in the garage”。","在实际写作中，多个前置修饰语叠加会让句子更紧凑，但也可能更难读；信息较长时，英语更常用后置修饰（如介词短语、定语从句）来表达。"]}
{"word":"premoisten","summary":{"en":"“Premoisten” means to wet something slightly in advance.","zh":"“premoisten”指“事先把某物稍微弄湿/润湿”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something slightly wet or damp before using it or before another step in a process","zh":"在使用前或下一步操作前，先把某物稍微弄湿/润湿"},"examples":[{"en":"Premoisten the cloth before wiping the screen so you don’t scratch it.","zh":"擦屏幕前先把布稍微润湿，避免刮花。"},{"en":"The lab instructions say to premoisten the filter paper with distilled water.","zh":"实验说明要求先用蒸馏水预先润湿滤纸。"}]}],"synonyms":["moisten","dampen","wet (slightly)","pre-wet"],"phonetic":"/priːˈmɔɪsən/","extraExplanation":["“pre-”表示“预先、在……之前”，加在动词前很常见，如 preheat（预热）、prewash（预洗）。","premoisten 常见于说明书、实验步骤、清洁/护理产品指示等偏正式语境；日常口语里也可用 moisten first（先弄湿）表达同样意思。"]}
{"word":"premoistened","summary":{"en":"Premoistened means already moistened in advance, especially for wipes or pads.","zh":"Premoistened 指“预先润湿的”，常用于湿巾、棉片等即用型产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a product) already made slightly wet before you use it, so you don’t need to add water.","zh":"（指产品）在使用前就已预先润湿的，因此不需要再加水。"},"examples":[{"en":"Use a premoistened wipe to clean the screen gently.","zh":"用一张预先润湿的湿巾轻轻擦拭屏幕。"},{"en":"The first-aid kit includes premoistened antiseptic pads.","zh":"急救包里有预先润湿的消毒棉片。"}]}],"synonyms":["pre-moistened","prewetted","ready-moistened","dampened (beforehand)"],"phonetic":"/ˌpriːˈmɔɪsənd/","extraExplanation":["“premoistened”常见于产品包装（如 wipes / towelettes / pads），有时会写作“pre-moistened”。它强调“已经处理好、打开即可用（ready-to-use）”。"]}
{"word":"premoistening","summary":{"en":"Premoistening means moistening something beforehand, or describing something that has been moistened in advance.","zh":"premoistening 指“预先润湿”的过程，也可形容“预先已湿润的”物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of moistening something beforehand (before its main use or next step)","zh":"预先润湿；事先把某物弄湿的过程"},"examples":[{"en":"Premoistening the cloth helps it pick up dust without scratching the surface.","zh":"先把布预先润湿，有助于它吸附灰尘而不刮伤表面。"},{"en":"In labs, premoistening a filter can improve how evenly liquid flows through it.","zh":"在实验室里，预先润湿滤膜可以让液体流过得更均匀。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often used before a noun) already moistened in advance","zh":"（常作定语）预先湿润的；事先已弄湿的"},"examples":[{"en":"Use a premoistening wipe for quick cleanup.","zh":"用一张预先湿润的湿巾快速清洁。"},{"en":"The kit includes premoistening pads sealed in foil.","zh":"套装里有用锡箔密封的预湿棉片。"}]}],"synonyms":["pre-wetting","moistening beforehand","pre-moistening","pre-moistened"],"phonetic":"/ˌpriːˈmɔɪsənɪŋ/","extraExplanation":["“premoistening”多见于产品说明、医疗/清洁用品包装或技术写作中，强调“在使用前就已经加湿/润湿”。日常口语里更常说“pre-moistened (wipes)”或直接说“wet wipes”。","构词：pre-（在……之前）+ moisten（使湿润）+ -ing（名词化表示过程，或形容词化表示性质）。拼写上也常见带连字符的形式：pre-moistening。"]}
{"word":"premoistens","summary":{"en":"“Premoistens” means “makes something slightly wet beforehand,” often in instructions or product directions.","zh":"“premoistens”表示“事先把某物稍微弄湿”，常用于说明书或产品使用指引。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something slightly wet before using it or before another step in a process (third-person singular of “premoisten”)","zh":"（在使用或进行下一步之前）预先把某物稍微弄湿；“premoisten”的第三人称单数形式"},"examples":[{"en":"She premoistens the cloth before wiping the screen.","zh":"她在擦屏幕前先把布预先弄湿。"},{"en":"The instructions say the sponge premoistens easily with warm water.","zh":"说明书说海绵用温水很容易预先润湿。"}]}],"synonyms":["dampens first","pre-wets","moistens beforehand"],"phonetic":"/ˌpriːˈmɔɪsənz/","extraExplanation":["“premoisten”常见于说明书、实验步骤、清洁/护理产品介绍等偏正式语境，强调“先润湿再操作”。日常口语里更常说“wet it first / dampen it first”。","构词：pre-（预先）+ moisten（使湿润）。你看到的“premoistens”通常对应现在时第三人称单数：he/she/it premoistens。"]}
{"word":"premolar","summary":{"en":"A premolar is a tooth between the canine and the molars, used for crushing and grinding food.","zh":"前磨牙是位于犬齿和磨牙之间的牙齿，用于压碎和磨碎食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"either of the teeth between the canine (pointed tooth) and the molars, used mainly for crushing and grinding food","zh":"前磨牙：位于犬齿（尖牙）与磨牙之间的牙齿，主要用于压碎和磨碎食物"},"examples":[{"en":"The dentist found a small cavity in my upper premolar.","zh":"牙医在我上颌的一颗前磨牙上发现了一个小蛀洞。"},{"en":"Premolars help you chew tougher foods by crushing them.","zh":"前磨牙通过压碎食物，帮助你咀嚼较硬的食物。"}]}],"synonyms":["bicuspid"],"phonetic":"/ˌpriːˈmoʊlər/","extraExplanation":["“premolar”由前缀 pre-（在……之前）+ molar（磨牙）组成，因此字面意思是“在磨牙之前的牙”。","人类通常每侧上下各有两颗前磨牙（在恒牙中），牙科记录中常简称为“PM”。"]}
{"word":"premolars","summary":{"en":"Premolars are the teeth between canines and molars, used for chewing and grinding.","zh":"Premolars（前磨牙）是位于犬齿与磨牙之间的牙齿，用于咀嚼与磨碎食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the teeth between the canine (pointed tooth) and the molars, used for tearing and grinding food; adults usually have eight premolars in total (two in each quadrant).","zh":"前磨牙：位于犬齿与磨牙之间的牙齿，用于撕裂与磨碎食物；成人通常共有8颗前磨牙（每个象限2颗）。"},"examples":[{"en":"The dentist said I have a cavity in my left premolar.","zh":"牙医说我左侧的一颗前磨牙有蛀牙。"},{"en":"Wisdom teeth are molars, not premolars.","zh":"智齿属于磨牙，不是前磨牙。"},{"en":"Premolars help you chew tougher foods like nuts and meat.","zh":"前磨牙帮助你咀嚼较硬的食物，比如坚果和肉。"}]}],"synonyms":["premolar teeth","bicuspids (common in BrE)"],"phonetic":"/ˌpriːˈmoʊlərz/","extraExplanation":["“premolar”由前缀“pre-”（在……之前）+“molar”（磨牙）组成，意思是“在磨牙之前的牙”。","英式英语中常见同义说法是“bicuspid（双尖牙）”，但在现代牙科语境里“premolar”更常用、更中性。"]}
{"word":"premold","summary":{"en":"Premold means to shape or mold something ahead of a later manufacturing step.","zh":"Premold 指在后续制造步骤之前先把材料预先模塑/成型。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to mold or shape something in advance (before a later step such as assembly, casting, or overmolding)","zh":"（在后续工序之前）预先模塑；预先成型"},"examples":[{"en":"The factory premolds the plastic shells before adding the electronic parts.","zh":"工厂先把塑料外壳预先模塑成型，再装入电子元件。"},{"en":"These parts are premolded to ensure consistent size and fit.","zh":"这些零件采用预先成型，以确保尺寸和配合一致。"}]}],"synonyms":["preform","pre-shape","mold in advance","pre-mold"],"phonetic":"/ˌpriːˈmoʊld/","extraExplanation":["“premold”常见于制造业/工程语境，尤其是塑料、橡胶、复合材料等的成型流程中；有时也写作“pre-mold”或英式拼写“premould / pre-mould”。","在塑料工业里，它常与“overmold/overmolding（包胶/二次注塑）”一起出现：先把内层零件premold成型，再在外面二次包覆成型。"]}
{"word":"premolder","summary":{"en":"“Premolar” is a tooth between the canine and the molars.","zh":"“Premolar（前磨牙）”指位于犬齿与磨牙之间的牙齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “premolar”) a tooth located between the canine (pointed tooth) and the molars (back grinding teeth).","zh":"（很可能想写的是：premolar）前磨牙：位于犬齿（尖牙）与磨牙（后方咀嚼牙）之间的牙齿。"},"examples":[{"en":"My dentist said I might need a filling in a premolar.","zh":"牙医说我的一颗前磨牙可能需要补牙。"},{"en":"Premolars help you chew food before it reaches the molars.","zh":"前磨牙帮助你在食物到达磨牙前先进行咀嚼。"}]}],"synonyms":["bicuspid"],"phonetic":"/priˈmoʊlər/","extraExplanation":["“premolder”不是常见英文词，最接近且非常常用的医学/牙科词是“premolar（前磨牙）”。它由 pre-（在……之前）+ molar（磨牙）组成，意思是“在磨牙之前的牙”。"]}
{"word":"premolding","summary":{"en":"Premolding is an advance molding step (or something made that way) done before final shaping or assembly.","zh":"Premolding 指在最终成型或装配前进行的预成型/预先模压工序，或指预先成型的部件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or step of molding a material in advance, usually to create a basic shape before final molding, assembly, or finishing","zh":"预成型；预先模压（在最终成型、装配或后续加工前，先把材料模塑成基本形状的工序）"},"examples":[{"en":"Premolding helps the parts hold their shape before the final press.","zh":"预成型能帮助零件在最终压制前保持形状。"},{"en":"The factory added a premolding stage to reduce defects in the final product.","zh":"工厂增加了预成型工序，以减少成品的缺陷。"}]},{"partOfSpeech":"adj.","definition":{"en":"made by molding in advance; shaped before a later manufacturing step","zh":"预成型的；预先模压成形的（在后续制造步骤前已先成形）"},"examples":[{"en":"They used premolding inserts to speed up assembly.","zh":"他们使用预成型嵌件来加快装配。"},{"en":"Premolding components can improve consistency across batches.","zh":"预成型部件能提高不同批次之间的一致性。"}]}],"synonyms":["pre-molding","preforming","preform molding"],"phonetic":"/ˌpriːˈmoʊldɪŋ/","extraExplanation":["“premolding”常见于制造业与材料加工语境（如塑料、橡胶、复合材料、粉末冶金等）。它通常表示“先做一道成形/预制坯”的步骤：先得到更稳定、便于搬运或定位的形状，再进行二次模压、注塑、热压、固化或精加工。","拼写上也常写作“pre-molding”（加连字符）以强调前缀pre-（预先）。在技术文档里，“premolding”可能与“preform（预制坯）”“preform molding（预制坯成型）”“overmolding（包覆成型/二次包胶）”一起出现。"]}
{"word":"premolds","summary":{"en":"Premolds are parts that are molded in advance, or the act of molding something before the final production step.","zh":"Premolds 指预先模制/预成型的零件，或指在最终工序前进行预成型的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mold or shape something in advance (before a later step such as final molding, assembly, or curing)","zh":"（在后续工序之前）预先模制、预成型"},"examples":[{"en":"The factory premolds the plastic shells before painting them.","zh":"工厂先把塑料外壳预先模制好，再进行喷涂。"},{"en":"These parts are premolded to speed up final assembly.","zh":"这些零件先预成型，以加快最终组装。"}]},{"partOfSpeech":"n.","definition":{"en":"premolded parts or pre-formed molds used before the final production step","zh":"预制件；预成型的模件（用于最终工序之前）"},"examples":[{"en":"The technician checked the premolds for cracks and bubbles.","zh":"技术员检查这些预制件是否有裂纹和气泡。"},{"en":"We ran out of premolds and had to pause the line.","zh":"预制件用完了，只能暂停产线。"}]}],"synonyms":["preform(s)","premolded parts","pre-mold","pre-shape","preform mold(s)"],"phonetic":"/ˌpriːˈmoʊldz/","extraExplanation":["“premold(s)”常见于制造业语境（如塑料注塑、橡胶、复合材料）。意思是“先做出一个初步形状/半成品”，后面再进行二次加工（例如二次注塑、包胶 overmolding、上漆、热压或最终固化）。","在日常英语里这个词不算常见，更常见的表达有：“pre-molded parts / premolded parts（预成型零件）”、“preform（预制坯/预成型坯）”。如果你是在技术文件里看到“premolds”，通常就是指这些预制件（名词复数）或“进行预成型”（动词第三人称单数）。"]}
{"word":"premolt","summary":{"en":"Premolt means “before molting,” and it can also refer to the stage right before an animal sheds its skin or shell.","zh":"Premolt 指“蜕皮/换壳之前的”，也可指动物蜕皮/换壳前的阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Happening before an animal molts (sheds its outer covering, such as a crustacean’s shell or an insect’s skin).","zh":"（生物）发生在动物蜕皮/换壳之前的；蜕皮前的（如甲壳类换壳、昆虫蜕皮之前）。"},"examples":[{"en":"During the premolt stage, the crab absorbs minerals and prepares a new shell underneath the old one.","zh":"在蜕皮前阶段，螃蟹会吸收矿物质，并在旧壳下面准备新的外壳。"},{"en":"Researchers measured hormone levels in premolt shrimp to predict when molting would occur.","zh":"研究人员测量蜕皮前虾的激素水平，以预测何时会蜕皮。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or stage right before molting.","zh":"蜕皮/换壳前期；蜕皮前阶段。"},"examples":[{"en":"The aquarium guide explained that premolt is a stressful time for many crustaceans.","zh":"水族馆讲解员解释说，蜕皮前期对许多甲壳类来说是一个压力较大的时期。"},{"en":"Feeding often decreases in premolt.","zh":"在蜕皮前期，进食量常常会下降。"}]}],"synonyms":["pre-molt","pre-ecdysis","pre-shed"],"phonetic":"/ˌpriːˈmoʊlt/","extraExplanation":["“premolt”常见于动物学、生态学与水产养殖语境，尤其描述甲壳类（螃蟹、虾、龙虾）与昆虫的蜕皮周期。它通常可写作“pre-molt”（更直观）或“premolt”（合写，多见于科研写作）。","在甲壳类中，premolt 往往涉及：旧壳部分钙化物被回收、体内形成新表皮/新壳、行为上更隐蔽以避免捕食；因此养殖管理上会特别关注这一阶段（如水质、躲避空间与营养）。"]}
{"word":"premonarchal","summary":{"en":"Premonarchal means “before a monarchy (or a monarch’s rule).”","zh":"premonarchal 指“君主制或君主统治之前的（时期/事物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing, happening, or relating to a time before a monarchy or a monarch ruled.","zh":"君主制出现之前的；君主统治之前的；与前君主制时期有关的。"},"examples":[{"en":"Archaeologists studied premonarchal burial sites to understand early social hierarchy.","zh":"考古学家研究前君主制时期的墓葬遗址，以了解早期的社会等级。"},{"en":"The text describes premonarchal Israel as a loose confederation of tribes.","zh":"这篇文章把前君主制时期的以色列描述为一个松散的部落联盟。"}]}],"synonyms":["pre-monarchal","pre-monarchical","before the monarchy","pre-royal"],"phonetic":"/ˌpriːˈmɑːnərkəl/","extraExplanation":["“premonarchal”常见于历史、考古与宗教研究写作中，表示“君主制建立之前的时期”。有时也写作“pre-monarchal”（加连字符），两种拼写都可见。","常见搭配：premonarchal period/era/society、premonarchal state、premonarchal traditions。与“monarchical（君主制的）”“postmonarchal（后君主制的）”形成对比。"]}
{"word":"premonarchial","summary":{"en":"Premonarchial means “before a monarchy,” but it’s rare; premonarchical is more common.","zh":"premonarchial 指“君主制之前的”，但很少用；更常见的是 premonarchical。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Existing, happening, or relating to the time before a monarchy was established; pre-monarchical.","zh":"（少见）君主制建立之前的；与君主制出现之前时期有关的。"},"examples":[{"en":"Archaeologists study premonarchial burial sites to understand early social hierarchy.","zh":"考古学家研究前君主制时期的墓葬遗址，以了解早期的社会等级。"},{"en":"The museum has artifacts from the premonarchial era, before any king ruled the region.","zh":"博物馆收藏了前君主制时期的文物，那时该地区还没有国王统治。"}]}],"synonyms":["premonarchical","pre-monarchical","pre-monarchy"],"phonetic":"/ˌpriːməˈnɑːrkiəl/","extraExplanation":["这个词非常少见，更常见、更规范的形式是 **premonarchical**（前君主制的）。写作与学术语境中通常用 *premonarchical period/era/society*。","构词：**pre-**（在……之前）+ **monarch**（君主）+ **-ial/-ical**（形容词后缀）。两种后缀都可能出现，但现代英语更偏好 *-ical*。"]}
{"word":"premonarchical","summary":{"en":"Premonarchical means “before a monarchy existed.”","zh":"premonarchical 指“君主制出现之前的（时期/社会）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a period before a country or society had a monarchy (a king or queen as head of state).","zh":"与君主制建立之前的时期有关；指国家或社会在出现国王/女王统治之前的阶段。"},"examples":[{"en":"Archaeologists study premonarchical settlements to understand how people governed themselves before kings ruled.","zh":"考古学家研究君主制之前的聚落，以了解在国王统治之前人们如何自我治理。"},{"en":"The book describes premonarchical traditions that later influenced the royal court.","zh":"这本书描述了君主制之前的传统，这些传统后来影响了王室宫廷。"}]}],"synonyms":["pre-monarchy","pre-royal","pre-kingdom","pre-dynastic"],"phonetic":"/ˌpriˌmɑːnɑːr.kɪ.kəl/","extraExplanation":["词形拆解：pre-（“在……之前”）+ monarchical（“君主制的”）。常用于历史、政治学、人类学语境，用来强调“王权出现之前”的社会结构、习俗或制度。","用法提示：它通常修饰表示“时代/社会/制度/文化”的名词，如 premonarchical society / era / period / institutions。相比更常见的 before the monarchy / pre-monarchy，premonarchical 更偏学术书面语。"]}
{"word":"premonetary","summary":{"en":"Premonetary describes a time or society before money was widely used.","zh":"premonetary 指“货币广泛使用之前的（时期/社会）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before money was used as a main system for buying and selling; relating to societies that traded without coins or cash.","zh":"发生在使用货币作为主要交易方式之前的；与没有硬币或现金、以物物交换为主的社会有关的。"},"examples":[{"en":"Anthropologists study premonetary societies to understand early trade and social relationships.","zh":"人类学家研究前货币社会，以了解早期的交易方式和社会关系。"},{"en":"In a premonetary economy, people often exchanged goods like grain, tools, or livestock.","zh":"在前货币经济中，人们常用谷物、工具或牲畜等物品进行交换。"}]}],"synonyms":["pre-money","non-monetary","barter-based","pre-currency"],"phonetic":"/ˌpriːˈmʌnəˌtɛri/","extraExplanation":["“premonetary”由前缀“pre-”（在……之前）+“monetary”（货币的）组成，常见于人类学、考古学、经济史等语境。","它通常暗示以“物物交换（barter）”、礼物交换（gift exchange）或以商品作为交换媒介（例如盐、贝壳、牲畜）等方式为主，但不同地区与时期的交易形式可能很复杂，并不只是简单的“以物换物”。"]}
{"word":"premonetory","summary":{"en":"Premonitory means giving a warning or hint of something (often something bad) that will happen in the future.","zh":"Premonitory 指“预示将发生（常是不好的事）”或“带有提前警告意味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a feeling, sign, or event) suggesting that something will happen in the future, especially something bad or important; giving a warning in advance","zh":"（感觉、征兆或事件）预示将要发生（尤指不好的或重要的事）；预先警告的"},"examples":[{"en":"She had a premonitory feeling that something was wrong.","zh":"她有一种不祥的预感，觉得哪里不对劲。"},{"en":"The dark clouds were a premonitory sign of a storm.","zh":"乌云是暴风雨来临的预兆。"},{"en":"His premonitory tone made everyone take the risk seriously.","zh":"他带有警告意味的语气让大家认真对待这个风险。"}]}],"synonyms":["foreboding","ominous","warning","prophetic","predictive"],"phonetic":"/ˌpriːˈmɑːnəˌtɔːri/","extraExplanation":["你写的“premonetory”通常是拼写错误；标准拼写是 **premonitory**。它来自“premonition（预感）”，常和 feeling / sign / dream / look / tone 等搭配。语气上常带“隐隐不祥的预兆”或“提前警告”的感觉，比单纯的“predictive（预测性的）”更偏主观或氛围感。"]}
{"word":"premongolian","summary":{"en":"Pre-Mongolian means “before the Mongols/Mongol Empire,” used mainly in historical or archaeological contexts.","zh":"pre-Mongolian 指“蒙古人/蒙古帝国之前的”，多用于历史或考古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time, cultures, or languages that existed before the Mongols or the Mongol Empire (especially before the 13th century in Inner Asia).","zh":"与蒙古人或蒙古帝国之前的时代、文化或语言有关的（尤指内亚地区13世纪以前）。"},"examples":[{"en":"Archaeologists found pre-Mongolian pottery in the valley.","zh":"考古学家在山谷里发现了前蒙古时期的陶器。"},{"en":"The museum has a section on pre-Mongolian Central Asia.","zh":"博物馆有一个展区介绍前蒙古时期的中亚。"}]}],"synonyms":["pre-Mongol","pre-imperial Mongol-era (context-dependent)","pre-13th-century (context-dependent)"],"phonetic":"/ˌpriːmɑŋˈɡoʊliən/","extraExplanation":["“Pre-”表示“在……之前”。因此 pre-Mongolian 常用于历史与考古语境，指蒙古帝国兴起与扩张（约13世纪）之前的政治、文化与物质遗存。具体时间范围会因地区不同而变化。","该词多用于学术写作与博物馆说明文字；日常英语中较少见。写作时常用连字符：pre-Mongolian。"]}
{"word":"premonish","summary":{"en":"A rare/formal verb meaning “to warn in advance.”","zh":"一个罕见且较正式的动词，意思是“事先警告/预先提醒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare or formal) To warn someone in advance; to give an early caution or forewarning.","zh":"（罕见/正式）事先警告；预先提醒；预先告诫。"},"examples":[{"en":"The doctor premonished her to watch for signs of infection after surgery.","zh":"医生事先提醒她，手术后要留意感染迹象。"},{"en":"History often premonishes us that small conflicts can grow into larger wars.","zh":"历史常常预先警示我们，小冲突可能升级成大战。"}]}],"synonyms":["warn","forewarn","caution","admonish","alert"],"phonetic":"/ˌpriːməˈnɪʃ/","extraExplanation":["“premonish”在现代英语中非常少见，更常用的是动词“warn / forewarn / caution”，以及名词“premonition（预感）”。它来自拉丁语词根“pre-（在前）+ monere（提醒/警告）”，和“admonish（告诫）”“monition（警告）”是同源词。","使用建议：写作或口语中一般不推荐用“premonish”，除非你想要一种古典/正式的文风；日常表达用“warn/forewarn”更自然。"]}
{"word":"premonishment","summary":{"en":"Premonishment means a forewarning or uneasy feeling that something is about to happen.","zh":"Premonishment 指对即将发生之事的预警或不安的预感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warning or forewarning—often a vague feeling or sign that something (usually bad) is going to happen","zh":"预警；预示；（常指）对将发生之事（多为不祥）的模糊预感或征兆"},"examples":[{"en":"She couldn’t explain it, but she had a strong premonishment that something was wrong.","zh":"她说不清原因，但她有一种强烈的预感，觉得出事了。"},{"en":"The sudden silence felt like a premonishment before the storm hit.","zh":"突如其来的寂静像暴风雨来临前的预兆。"}]}],"synonyms":["premonition","forewarning","foreboding","presentiment","intuition"],"phonetic":"/ˌpriːməˈnɪʃmənt/","extraExplanation":["“premonishment”在现代英语中比较少见，更常用的是“premonition（预感）”或“foreboding（不祥预感）”。如果你在写作中用“premonishment”，会带有更文学化、较古旧的语感。","词源上与拉丁语“prae-（在前）+ monere（提醒、警告）”有关，所以它的核心含义是“提前提醒/警告”。","用法提示：它通常指一种不确定但强烈的感觉或征兆；如果是具体、明确的警告信息，更常说“warning”。"]}
{"word":"premonition","summary":{"en":"Premonition means a strong feeling that something is about to happen, often something unpleasant.","zh":"Premonition 指对将要发生之事（常为不好的事）的强烈预感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling that something (usually something bad) is going to happen before it happens.","zh":"对某事（通常是不好的事）将要发生的强烈预感；预兆般的直觉。"},"examples":[{"en":"I had a premonition that something would go wrong on the trip.","zh":"我有一种预感，这趟旅行会出问题。"},{"en":"She couldn’t explain it, but a sudden premonition made her call her family.","zh":"她说不清原因，但一个突然的预感让她给家人打了电话。"},{"en":"His premonition of danger kept him from taking the late train.","zh":"他对危险的预感让他没有搭乘那班深夜火车。"}]}],"synonyms":["foreboding","intuition","presentiment","hunch","omen"],"phonetic":"/ˌpriːməˈnɪʃən/","extraExplanation":["“premonition”常用于文学、电影和新闻叙事中，营造悬念或不祥的气氛；语气通常比“guess（猜测）”更强烈、更情绪化，也不一定基于证据。","词源上：pre-（在……之前）+ monition（警告/提醒），带有“事前提醒”的感觉。","近义词辨析：premonition 强调强烈直觉（常带不安）；intuition 更中性（直觉判断）；foreboding 更偏“隐隐的不祥感”；omen 多指外在“征兆/兆头”（如黑云、怪事），而 premonition 多指内心感觉。"]}
{"word":"premonitions","summary":{"en":"Premonitions are strong feelings, warnings, or dream-like signs that something will happen in the future, often something bad.","zh":"Premonitions 指对未来将发生之事的强烈预感、警兆或梦境般的暗示，通常带有不祥意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling or warning that something (usually bad) is going to happen in the future, without clear evidence.","zh":"一种强烈的预感或警兆（通常指不好的事情将发生），但没有明确证据。"},"examples":[{"en":"She had a premonition that something was wrong, so she called home.","zh":"她有种不对劲的预感，于是给家里打了电话。"},{"en":"His premonitions of danger made him avoid traveling at night.","zh":"他对危险的预感让他避免在夜间出行。"}]},{"partOfSpeech":"n.","definition":{"en":"An idea, dream, or mental image that seems to predict a future event.","zh":"一种似乎在预示未来事件的想法、梦境或脑海画面。"},"examples":[{"en":"The dream felt like a premonition of the news that arrived the next day.","zh":"那个梦感觉像是在预示第二天到来的消息。"},{"en":"In the novel, the hero’s premonitions guide many of his choices.","zh":"在小说里，主角的预兆般直觉引导了他许多选择。"}]}],"synonyms":["forebodings","hunches","omens","presentiments"],"phonetic":"/ˌpriːməˈnɪʃənz/","extraExplanation":["“premonition”常带有“神秘/直觉”的语感，日常也可用来表达一种说不清原因的担心：I have a bad premonition.（我有种不祥的预感。）","词源上来自拉丁语：pre-（在前）+ monere（警告、提醒），所以核心含义是“提前的警告/提醒”。","文学与影视里常用“premonition”营造悬念或不安氛围；比起“prediction（预测）”，“premonition”更强调感觉而非推理或证据。"]}
{"word":"premonitive","summary":{"en":"Premonitive means “having the quality of a warning or sign of what will happen in the future.”","zh":"Premonitive 指“具有预兆/警示性质的，预示未来将发生某事的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Giving a warning or sign of something that will happen in the future; suggesting a future event, often something unpleasant.","zh":"（正式/文艺用法）预示未来将发生某事的；带有预兆或警示意味的（常指不祥的事）。"},"examples":[{"en":"She had a premonitive dream the night before the accident.","zh":"事故前一晚她做了一个带有预兆的梦。"},{"en":"The sudden silence felt premonitive, as if trouble were coming.","zh":"突如其来的寂静让人觉得像是某种不祥的预兆，仿佛麻烦就要来了。"},{"en":"In the novel, a premonitive storm signals the family’s collapse.","zh":"在小说里，一场带有预兆意味的暴风雨暗示这个家庭将走向崩溃。"}]}],"synonyms":["prophetic","foreboding","ominous","predictive"],"phonetic":"/priˈmɑnətɪv/","extraExplanation":["“premonitive”与名词“premonition（预感/预兆）”同源，常见搭配有：premonitive dream（预兆之梦）、premonitive feeling（预感）、premonitive sign（预兆）。","这个词比“predictive/prophetic（预言性的）”更强调一种“隐约的警告感”或“不祥的气氛”，因此在文学描写、心理感受或悬疑语境中更常见。"]}
{"word":"premonitor","summary":{"en":"A premonitor is an advance warning or a sign that something is about to happen; the verb form is rare and means “to warn in advance.”","zh":"premonitor 指“预先警告/预兆”，也可作动词（较少见）表示“事先提醒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that gives an advance warning (a warning sign before something happens)","zh":"预先警告者；预兆（在事情发生前给出警示的人或事物）"},"examples":[{"en":"In old stories, a sudden chill in the air can be a premonitor of danger.","zh":"在一些古老故事里，空气突然变冷常被当作危险的预兆。"},{"en":"She treated his repeated headaches as a premonitor of stress and changed her schedule.","zh":"她把他反复头痛当作压力的预警，于是调整了作息。"}]},{"partOfSpeech":"v.","definition":{"en":"to warn in advance (rare, formal)","zh":"预先警告；事先提醒（少见、较正式）"},"examples":[{"en":"The report premonitors the risks of flooding if the river keeps rising.","zh":"报告预先提醒：如果河水继续上涨，将有洪涝风险。"}]}],"synonyms":["warning","forewarning","omen","sign","harbinger"],"phonetic":"/priˈmɑnɪtər/","extraExplanation":["这个词在现代英语里比较少见；更常见的是名词/形容词形式：premonition（预感、预兆）和 premonitory（预示性的、预警的）。","词源上来自拉丁语：pre-（在前）+ monitor（提醒者/警告者）。因此核心意思就是“在事情发生之前就提醒”。"]}
{"word":"premonitorily","summary":{"en":"premonitorily means “in a warning, foretelling way.”","zh":"premonitorily 表示“以预兆/预警的方式，带有预感地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that warns or suggests something will happen in the future; as a sign or forewarning.","zh":"以预兆的方式；带有预警意味地，暗示未来将发生某事。"},"examples":[{"en":"The dog barked premonitorily before the earthquake.","zh":"地震前，狗带着预兆般地狂吠。"},{"en":"She glanced at the dark clouds premonitorily and packed an umbrella.","zh":"她带着预感看了看乌云，就带上了雨伞。"}]}],"synonyms":["ominously","forebodingly","prophetically","warningly"],"phonetic":"/ˌpriːˈmɑːnɪtɔrəli/","extraExplanation":["词源提示：来自 Latin（拉丁语）前缀 pre-（“在……之前”）+ monitor（“提醒、警告”）。因此它常出现在较文学或正式的语境里，带有“仿佛命运在提醒你”的感觉。","用法提示：premonitorily 通常修饰“说/看/感觉/行动”的方式（例如 spoke/glanced/acted premonitorily）。日常口语更常用：as if in warning, ominously, like a bad sign, with a sense of foreboding。"]}
{"word":"premonitory","summary":{"en":"Premonitory means giving an advance warning or hint that something is about to happen, often something unpleasant.","zh":"Premonitory 指“预示将发生某事的（常为不好的事）”，带有“提前警示/先兆”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a sign, feeling, or event) suggesting that something (often bad) is going to happen soon; warning in advance","zh":"（征兆、感觉或事件）预示（常为不好的事）将要发生的；先兆性的；警示性的"},"examples":[{"en":"She had a premonitory feeling that something was wrong.","zh":"她有一种不祥的预感，觉得哪里不对劲。"},{"en":"Dark clouds were a premonitory sign of the storm.","zh":"乌云是暴风雨来临前的征兆。"}]}],"synonyms":["foreboding","ominous","prophetic","portentous","warning"],"phonetic":"/ˌpriːməˈnɪtəri/","extraExplanation":["“premonitory”来自拉丁语前缀 pre-（“在……之前”）+ monere（“提醒、警告”），核心含义是“提前提醒”。常用于比较正式或文学化的语境。","它与“premonition（预感）”关系密切：premonitory 常修饰 feeling/sign/voice/silence 等名词；而 premonition 通常作名词（a premonition）。","语气上，“premonitory”比“warning”更强调“像预兆一样的暗示”，不一定是明确的警告。"]}
{"word":"premonopolies","summary":{"en":"Premonopolies are early or emerging monopolies—situations trending toward monopoly power.","zh":"premonopolies 指“早期/正在形成的垄断”，强调正在走向垄断但尚未完全确立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"early or emerging monopolies; market situations that are moving toward monopoly control but are not fully established yet.","zh":"早期或正在形成的垄断；指市场正在走向垄断控制但尚未完全确立的状态或企业。"},"examples":[{"en":"Regulators try to spot premonopolies before one company can dominate the entire market.","zh":"监管机构会在某家公司完全主导整个市场之前，尽量识别出正在形成的垄断。"},{"en":"Some critics argued that exclusive contracts created premonopolies in the industry.","zh":"一些批评者认为，独家合同在该行业制造了早期垄断。"}]}],"synonyms":["incipient monopolies","proto-monopolies","early monopolies"],"phonetic":"/ˌpriːməˈnɑːpəliz/","extraExplanation":["“premonopolies”并不是非常常见的标准词，更多见于学术或评论性写作中，用来强调“尚未完全形成但已显现垄断趋势”的阶段。","写作中也常见带连字符的形式：pre-monopolies，意思相同但更直观。若想用更常见的表达，可用“incipient monopolies（正在形成的垄断）”或“proto-monopolies（原型/早期垄断）”。"]}
{"word":"premonopolize","summary":{"en":"Premonopolize means to gain exclusive control of something ahead of others.","zh":"premonopolize 指在他人之前提前取得对某物的排他性控制（预先垄断）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to monopolize (control or take the whole supply of something) in advance, before others can share or compete; to preemptively secure exclusive control","zh":"预先垄断；在他人参与或竞争之前先行把持（某物的全部供应或控制权）"},"examples":[{"en":"The company tried to premonopolize key patents before smaller rivals entered the market.","zh":"这家公司试图在较小竞争者进入市场之前，先行垄断关键专利。"},{"en":"Early access to data can let a few players premonopolize opportunities.","zh":"对数据的提前获取可能让少数参与者预先垄断机会。"}]}],"synonyms":["preempt","monopolize","corner the market","lock up","take over early"],"phonetic":"ˌpriːməˈnɑːpəlaɪz","extraExplanation":["“premonopolize”由前缀 pre-（“事先、提前”）+ monopolize（“垄断”）构成，字面意思很直观，但在现代英语中非常少见，更常用的表达是 “preempt” 或 “corner the market early”。在正式写作中使用它时，通常带有批评或警惕的语气。"]}
{"word":"premonopolized","summary":{"en":"Premonopolized means “already monopolized beforehand” or “monopolized in advance.”","zh":"Premonopolized 指“事先已被垄断的/提前垄断的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already monopolized in advance (before a later event, reform, or competition begins)","zh":"事先（提前）已被垄断的；在后来事件/改革/竞争开始之前就已被一家或一方独占的"},"examples":[{"en":"In some industries, access to key suppliers was premonopolized by a few large firms.","zh":"在一些行业中，关键供应商的渠道早已被少数大公司事先垄断。"},{"en":"Because the market was premonopolized, new startups struggled to attract customers.","zh":"由于市场早已被提前垄断，新创公司很难吸引客户。"}]},{"partOfSpeech":"vt.","definition":{"en":"to monopolize beforehand; to gain exclusive control of something early (often before others can enter)","zh":"提前垄断；抢先取得对某物的独占控制（常指在他人进入之前）"},"examples":[{"en":"They premonopolized the best storefront locations long before the neighborhood became popular.","zh":"在那片社区走红很久之前，他们就提前垄断了最好的临街店铺位置。"},{"en":"A company may try to premonopolize a technology by buying up patents early.","zh":"公司可能会通过早早收购专利来提前垄断某项技术。"}]}],"synonyms":["preemptively monopolized","already monopolized","monopolized in advance","cornered (the market)"],"phonetic":"/ˌpriːməˈnɑːpəlaɪzd/","extraExplanation":["“premonopolized”由 pre-（预先、提前）+ monopolize（垄断）构成，常见于商业、经济、政策评论等语境，强调“在竞争或变革发生之前就已经被控制”。","更常见的替代表达有：already monopolized（已经被垄断）、preemptively monopolized（先发制人地垄断）、cornered the market early（早早垄断市场/抢占市场）。"]}
{"word":"premonopolizing","summary":{"en":"Premonopolizing means seeking to monopolize something ahead of time.","zh":"premonopolizing 指“提前试图垄断/独占”某事物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) trying to gain exclusive control of something in advance, before others can compete or use it.","zh":"（现在分词）在别人参与或使用之前，提前试图取得对某事物的独占控制。"},"examples":[{"en":"Some firms are premonopolizing key patents to block future competitors.","zh":"一些公司在提前“独占”关键专利，以阻挡未来的竞争者。"},{"en":"By buying most of the available land early, the developer was premonopolizing the area.","zh":"开发商通过早早买下大部分可用土地，正在对该地区进行提前垄断式的控制。"}]}],"synonyms":["preempting","cornering","locking up","securing exclusivity","foreclosing competition"],"phonetic":"/ˌpriːməˈnɑːpəlaɪzɪŋ/","extraExplanation":["这个词非常不常见，通常是由前缀 pre-（“预先、提前”）+ monopolize（“垄断、独占”）构成，用来强调“在别人之前先把资源/渠道/机会锁住”的动作。更常见、更自然的表达包括: cornering the market（垄断市场/把货源买光）, locking up resources（锁定资源）, gaining exclusive control early（提前取得独占控制）。","语域上更偏学术、评论或批判性写作（例如讨论市场竞争、专利、平台、媒体资源等），日常口语里较少使用。"]}
{"word":"premonopoly","summary":{"en":"Premonopoly refers to the time or conditions before a monopoly forms, or describes things that occur before monopoly power is established.","zh":"Premonopoly 指垄断形成之前的时期或状况，也可形容发生在垄断势力建立之前的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Economics) the period or situation before a market becomes a monopoly (i.e., before one company controls most or all of the market).","zh":"（经济学）垄断形成之前的阶段或状况（即在某家公司控制大部分或全部市场之前）。"},"examples":[{"en":"In the premonopoly stage, several firms still competed on price and service.","zh":"在垄断形成前的阶段，仍有多家公司在价格和服务上竞争。"},{"en":"Regulators watched the industry closely during its premonopoly growth.","zh":"监管机构在该行业垄断前的增长阶段密切关注它。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or existing before a monopoly forms or before monopoly power is established.","zh":"发生于或存在于垄断形成之前的；垄断势力建立之前的。"},"examples":[{"en":"The report focuses on premonopoly market behavior.","zh":"这份报告关注垄断形成前的市场行为。"},{"en":"They studied premonopoly pricing patterns to predict future consolidation.","zh":"他们研究垄断前的定价模式，以预测未来的行业整合。"}]}],"synonyms":["pre-monopoly","before monopolization","prior to monopoly formation","pre-consolidation"],"phonetic":"/ˌpriːməˈnɑːpəli/","extraExplanation":["“premonopoly”不是日常英语中的常用词，更常见的表达包括“pre-monopoly period / before monopoly formation / prior to monopolization”。在学术写作或政策讨论中，如果需要更自然的表达，通常会用这些更常见的短语。"]}
{"word":"premonstrant","summary":{"en":"Premonstrant: a member of (or relating to) the Catholic Norbertine order founded at Prémontré in 1120.","zh":"premonstrant：指（或形容）1120年在法国普雷蒙特雷创立的天主教诺伯特会/普雷蒙特雷会成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Roman Catholic religious order founded in 1120 at Prémontré (France), also called the Norbertines; officially, the Order of Prémontré","zh":"普雷蒙特雷会（也称“诺伯特会/白衣会”）的成员：一个天主教修会，1120年在法国普雷蒙特雷（Prémontré）创立"},"examples":[{"en":"The monastery was founded by Premonstrants in the Middle Ages.","zh":"这座修道院在中世纪由普雷蒙特雷会的修士建立。"},{"en":"A Premonstrant abbot led the community’s daily prayers and work.","zh":"一位普雷蒙特雷会的院长带领团体的日常祈祷与劳动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Premonstrant (Norbertine) order","zh":"与普雷蒙特雷会（诺伯特会）有关的；属于该修会的"},"examples":[{"en":"They studied a Premonstrant manuscript copied in the 13th century.","zh":"他们研究了一份13世纪抄写的普雷蒙特雷会手稿。"},{"en":"The church preserves Premonstrant traditions in its liturgy.","zh":"这座教堂在礼仪中保留了普雷蒙特雷会的传统。"}]}],"synonyms":["Norbertine","Premonstratensian"],"phonetic":"/priˈmɑnstrənt/","extraExplanation":["“Premonstrant”来自法语地名 Prémontré（普雷蒙特雷），该修会由圣诺伯特（St. Norbert）创立，因此也常被称为 Norbertines（诺伯特会）。","在历史与艺术史语境里，你可能会看到“Premonstratensian”（更正式/学术的形容词与名词形式），意思与 Premonstrant 基本相同。","与之容易混淆的词是“premonition”（预感）或“premonitory”（预兆的），它们词形相似但词源与意义无关。"]}
{"word":"premonstratensian","summary":{"en":"Premonstratensian: a member of (or relating to) the Roman Catholic Order of Prémontré, founded in 1120 in France.","zh":"premonstratensian：指（或形容）天主教“普雷蒙特雷会/诺伯特会”（1120年创立于法国）的成员或相关事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Roman Catholic religious order (the Order of Prémontré) of canons regular, founded in 1120 in Prémontré, France","zh":"普雷蒙特雷会（又称诺伯特会）会士：天主教的一个修会成员，属于“正规会士”（canons regular）传统，1120年在法国普雷蒙特雷创立"},"examples":[{"en":"The abbey’s early records mention Premonstratensian canons serving nearby villages.","zh":"这座修道院的早期记载提到普雷蒙特雷会的正规会士在附近村庄服务。"},{"en":"In medieval Europe, Premonstratensian communities often combined prayer with pastoral work.","zh":"在中世纪欧洲，普雷蒙特雷会团体常把祈祷生活与牧灵工作结合在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Premonstratensian order","zh":"与普雷蒙特雷会（诺伯特会）有关的"},"examples":[{"en":"We visited a Premonstratensian monastery known for its quiet cloister.","zh":"我们参观了一座以宁静回廊闻名的普雷蒙特雷会修道院。"}]}],"synonyms":["Norbertine"],"phonetic":"/ˌpriːmənˈstrætənsiən/","extraExplanation":["“Premonstratensian”来自法语地名 Prémontré（普雷蒙特雷）+ 拉丁/英语构词后缀 -ian（表示“属于……的人/事物”）。","该修会常被称为 Norbertines（诺伯特会），创立者是圣诺伯特（St. Norbert）。他们属于“canons regular（正规会士）”：既像修士一样共同生活、遵守会规，也像司铎一样从事礼仪与牧灵工作。","拼写较长，读音中常见重音落在“stan”附近；写作时注意中间的 -strat- 组合。"]}
{"word":"premonstratensis","summary":{"en":"A Latin term meaning “Premonstratensian,” relating to (or a member of) the Premonstratensian/Norbertine order; more common in Latin records than in modern English.","zh":"拉丁术语，意为“普雷蒙特雷会的/普雷蒙特雷会会士”，多见于拉丁文史料与教会文献，现代英文更常用 Premonstratensian。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in church/history contexts) “of Prémontré” or “Premonstratensian,” relating to the Premonstratensian (Norbertine) religious order.","zh":"（拉丁文；多用于教会/历史语境）“属于普雷蒙特雷的”或“普雷蒙特雷会的/普雷蒙特雷修会的”，指与普雷蒙特雷会（诺伯丁会）相关。"},"examples":[{"en":"The manuscript ends with a Latin note: Ordo Praemonstratensis.","zh":"这份手稿末尾有一条拉丁文注记：Ordo Praemonstratensis（普雷蒙特雷会/诺伯丁会）。"},{"en":"In some older records, a monastery is labeled simply “Praemonstratensis.”","zh":"在一些较早的记录中，修道院会被简单标注为“Praemonstratensis”（意为“普雷蒙特雷会的”）。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Premonstratensian (Norbertine) order (rare in English; more often written “Premonstratensian”).","zh":"普雷蒙特雷会（诺伯丁会）的成员（英文中较少用此形式；更常写作 Premonstratensian）。"},"examples":[{"en":"The chronicle describes him as a Praemonstratensis serving at the abbey.","zh":"编年史称他为一位在修道院服事的 Praemonstratensis（普雷蒙特雷会会士）。"}]}],"synonyms":["Premonstratensian","Norbertine","Praemonstratensian"],"phonetic":"/priˌmɑnstrəˈtɛnsɪs/","extraExplanation":["“Praemonstratensis”是拉丁文形容词（阴阳性变化之一），常见于拉丁文公文、印章、碑铭或书名中；现代英文里更常见的对应形式是 **Premonstratensian**。","普雷蒙特雷会（Premonstratensians）又常被称为 **Norbertines（诺伯丁会）**，源自法国普雷蒙特雷（Prémontré），与圣诺伯特（St. Norbert，约1120年创立）相关。"]}
{"word":"premonstration","summary":{"en":"Premonstration means an advance sign or showing—something that foreshadows what will happen later.","zh":"Premonstration 指“事先的征兆或先行展示”，即对未来事件的预示或预警。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an advance showing or indication of something that will happen; a foreshadowing or warning beforehand","zh":"事先的显示或征兆；预示、预警"},"examples":[{"en":"Some readers treat the storm in the first chapter as a premonstration of the tragedy to come.","zh":"有些读者把第一章的暴风雨看作后续悲剧的预示。"},{"en":"The sudden silence in the room felt like a premonstration that bad news was coming.","zh":"房间里突然安静下来，让人感觉像是不祥消息将至的预兆。"}]}],"synonyms":["foreshadowing","omen","portent","warning","sign"],"phonetic":"/ˌpriːmənˈstreɪʃən/","extraExplanation":["“premonstration”比较少见、偏书面或古旧，现代英语更常用“foreshadowing”（文学中的伏笔/预示）或“warning”（警告）。它也常被误写/误用为更常见的“premonition”（预感）。","词源来自拉丁语：prae-（在前）+ monstrare（展示、指示），字面意思是“提前展示”。","在文学分析里，它可指某个细节“先行暗示”后续事件，作用类似伏笔（foreshadowing）。"]}
{"word":"premonumental","summary":{"en":"Premonumental describes an early stage before something becomes monumental or historically significant.","zh":"premonumental 指某事物在变得宏大或具有纪念碑意义/历史重要性之前的早期阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Existing or happening before something becomes monumental (very important, large, or widely remembered); early, not yet monumental.","zh":"（罕用）在某事物变得“具有纪念碑意义/极其重要、宏大、广为铭记”之前的；尚未达到宏大或里程碑程度的。"},"examples":[{"en":"The museum’s exhibit includes premonumental sketches that show the artist’s earliest ideas.","zh":"博物馆的展览包含一些“前纪念碑式”的草图，展示了艺术家最早的构想。"},{"en":"In his premonumental years, the writer published short pieces in local newspapers.","zh":"在他尚未成名、作品还未具“里程碑意义”的时期，这位作家曾在地方报纸上发表短文。"}]}],"synonyms":["early","initial","preliminary","formative","proto-"],"phonetic":"/ˌpriˌmɑn.jəˈmɛn.təl/","extraExplanation":["这个词很少见，通常出现在艺术史、建筑史或文学评论里，用来强调“后来变得宏大/经典/具有纪念意义之前的阶段”。","构词上是 pre-（在……之前）+ monumental（纪念碑式的；极重要的）。如果用于人或作品，语气往往偏学术、评价性。"]}
{"word":"premoral","summary":{"en":"Premoral means “before moral understanding develops.”","zh":"Premoral 指“道德意识形成之前的（前道德的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, child, or behavior) existing before a sense of right and wrong has developed; not yet guided by moral rules.","zh":"（人、儿童或行为）处于道德意识尚未形成之前的；尚未受到“对错/善恶”规则指导的。"},"examples":[{"en":"Toddlers are often described as premoral because they don’t yet understand fairness or rules.","zh":"幼儿常被形容为 premoral，因为他们还不理解公平或规则。"},{"en":"The study focused on premoral decision-making in very young children.","zh":"这项研究聚焦于年幼儿童的“前道德”决策。"}]}],"synonyms":["pre-ethical","preconventional (in some theories)","morally undeveloped"],"phonetic":"/priˈmɔrəl/","extraExplanation":["“premoral”多见于发展心理学、伦理学或教育学语境，强调“道德判断尚未出现/尚未内化规则”，而不是说某人“没有道德”。","常与“stage/period/behavior/childhood”搭配：premoral stage（前道德阶段）、premoral period（前道德时期）。","相关概念常与“moral（道德的）/immoral（不道德的）/amoral（不涉及道德、非道德范畴的）”区分：premoral = 还没发展出来；immoral = 违背既有道德；amoral = 与道德无关。"]}
{"word":"premorality","summary":{"en":"Premorality means a stage before a clear moral sense develops.","zh":"Premorality 指道德观尚未形成之前的阶段或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state, period, or stage that comes before a developed sense of morality (before a person or group has clear ideas of right and wrong).","zh":"道德形成之前的状态／时期／阶段；指在个人或群体尚未形成明确“是非对错”观念之前。"},"examples":[{"en":"Some researchers describe early childhood as a premorality stage, when rules are followed mainly to avoid punishment.","zh":"一些研究者把幼儿早期描述为“前道德”阶段：遵守规则主要是为了避免惩罚。"},{"en":"The novel portrays a society in premorality, where loyalty matters more than justice.","zh":"这部小说描绘了一个处于“前道德”状态的社会：忠诚比正义更重要。"}]}],"synonyms":["pre-morality","pre-moral stage","amoral stage","moral infancy"],"phonetic":"/ˌpriːməˈrælɪti/","extraExplanation":["“premorality”并不是日常高频词，更常见的表达有“pre-moral stage / amoral stage（前道德/无道德阶段）”。在发展心理学或伦理学讨论中，它用来强调：某个时期的行为还不能用成熟的道德标准来评判。","构词法：pre-（在……之前）+ morality（道德）。有时也会写作“pre-morality”。"]}
{"word":"premorally","summary":{"en":"“Premorally” means ‘before moral understanding develops.’","zh":"“premorally”表示“在道德意识形成之前（前道德阶段）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before a person has developed moral awareness or the ability to judge right and wrong; in a morally undeveloped stage.","zh":"在（个人）尚未形成道德意识或分辨是非能力之前；处于道德尚未发展阶段地。"},"examples":[{"en":"Children often act premorally, focusing on what they want rather than what is fair.","zh":"孩子常常会以“前道德”的方式行事，更在意自己想要什么，而不是公平与否。"},{"en":"The author describes early human societies as living premorally, guided more by survival than ethical rules.","zh":"作者把早期人类社会描写为处于前道德阶段，更多由生存需求而非伦理规则所引导。"}]}],"synonyms":["before moral development","in a premoral way","pre-ethically"],"phonetic":"/priˈmɔrəli/","extraExplanation":["“premorally”并不是日常高频词，更常见的是形容词“premoral”（前道德的）。它多见于哲学、心理学与发展心理学语境，用来讨论人在道德判断形成之前的行为或动机。","在儿童道德发展讨论中，它有时会与皮亚杰/科尔伯格等理论的“前习俗（preconventional）阶段”相近，但不完全等同；写作时可根据理论框架选用更标准的术语。"]}
{"word":"premorbid","summary":{"en":"Premorbid means “before the illness began,” often describing someone’s prior health or abilities.","zh":"Premorbid 指“发病之前的”，常用于描述一个人在疾病发生前的健康、能力或人格等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before the start of an illness or medical condition (often used to describe a person’s earlier health, personality, or ability).","zh":"（医学/心理学）在疾病或某种状况发生之前就存在的；常用来描述一个人在发病前的健康状况、人格或能力。"},"examples":[{"en":"Doctors asked about his premorbid health and lifestyle.","zh":"医生询问了他发病前的健康状况和生活方式。"},{"en":"Her premorbid personality was described as outgoing and energetic.","zh":"据描述，她发病前的性格外向而精力充沛。"}]}],"synonyms":["pre-illness","preexisting (in a medical context)","prior (clinical use)"],"phonetic":"/ˌpriːˈmɔːr.bɪd/","extraExplanation":["“Premorbid”常见于临床医学、精神科与神经心理学写作中，用来把“发病前的基线（baseline）状态”和“发病后的改变”区分开。","词源上由拉丁前缀 pre-（在……之前）+ morbid（与疾病有关的）构成。日常口语较少用，更常见于病历、研究论文或评估报告。","常见搭配：premorbid functioning（发病前功能水平）、premorbid IQ（发病前智力估计）、premorbid condition/status（发病前状况）。注意不要与“comorbid（共病的）”混淆。"]}
{"word":"premorbidly","summary":{"en":"Premorbidly means “before illness or injury began,” often used in medical or psychological contexts.","zh":"premorbidly 指“在疾病或受伤发生之前”，常见于医学或心理学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(medical/psychology) Before a person became ill or was injured; relating to the time before the onset of a disease or disorder.","zh":"（医学/心理学）在生病或受伤之前；指疾病或障碍发生前的时期。"},"examples":[{"en":"Premorbidly, she was independent and socially active.","zh":"在发病前，她生活独立、社交活跃。"},{"en":"The report describes his premorbidly normal memory and attention.","zh":"报告描述他在发病前记忆力和注意力正常。"}]}],"synonyms":["before the onset (of illness)","previously","prior to illness","at baseline"],"phonetic":"/priˈmɔr.bɪd.li/","extraExplanation":["“premorbidly”多用于临床记录、心理评估与研究论文中，用来对比“发病前（premorbid）”与“发病后/当前（postmorbid/current）”的功能差异，如性格、智力、工作能力、社交状态等。","词根提示：pre-（在……之前）+ morbid（与疾病有关的）。日常英语中较少使用，更常见于医学语境。"]}
{"word":"premorbidness","summary":{"en":"Premorbidness means a person’s condition or functioning before an illness begins, used mainly in medical and psychological contexts.","zh":"Premorbidness 指“病前状态/病前功能”，主要用于医学与心理学语境，表示疾病发生前的状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being premorbid; a person’s condition or functioning before the onset of an illness or disorder (especially in medicine and psychology).","zh":"病前状态；指在疾病或障碍发生之前，一个人的健康状况、能力或功能水平（尤用于医学与心理学）。"},"examples":[{"en":"The doctor asked about her premorbidness to understand what her memory was like before the injury.","zh":"医生询问她的病前状态，以了解受伤前她的记忆力如何。"},{"en":"In the report, premorbidness included his ability to work full-time and live independently.","zh":"报告中，病前状态包括他全职工作的能力以及独立生活的情况。"}]}],"synonyms":["premorbid state","premorbid functioning","premorbidity","baseline (clinical)"],"phonetic":"/ˌpriːˈmɔr.bɪd.nəs/","extraExplanation":["该词多用于临床语境（如精神科、神经科、康复评估）。医生或研究者会比较“病前状态”与“患病后状态”，用来判断疾病造成的变化与影响。","更常见的写法是形容词 premorbid（如 premorbid functioning = 病前功能）。名词 premorbidity 也较常见；premorbidness 相对少见，但含义相近。"]}
{"word":"premorning","summary":{"en":"Premorning means ‘before morning begins,’ especially the very early hours before dawn.","zh":"premorning 指“清晨开始之前”，常用来表示黎明前的凌晨时段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before the morning begins; in the very early hours (often late at night or just before dawn).","zh":"发生在清晨开始之前的；（通常指深夜到黎明前的）凌晨时段的。"},"examples":[{"en":"She works the premorning shift at the bakery, starting at 3 a.m.","zh":"她在面包店上凌晨班，凌晨3点开始。"},{"en":"We got a premorning call that woke everyone up.","zh":"我们接到一个凌晨来电，把大家都吵醒了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the time before morning; very early, before dawn (less common).","zh":"在清晨之前；黎明前（较少见）。"},"examples":[{"en":"He usually runs premorning when the streets are quiet.","zh":"他通常在黎明前跑步，那时街道很安静。"}]}],"synonyms":["pre-dawn","before dawn","early-hours","wee-hours"],"phonetic":"/ˌpriˈmɔrnɪŋ/","extraExplanation":["“premorning”不是非常常见的标准词，更常见的写法是“pre-morning”（带连字符）或直接说“before dawn / early morning / in the early hours”。在日常表达里，用更常见的说法会更自然。"]}
{"word":"premorse","summary":{"en":"Premorse describes something (often a leaf or root) whose tip looks as if it has been bitten off.","zh":"Premorse 常用于植物学，指叶或根等末端看起来像被咬掉一样，顶端不规则截断。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in botany) Having an end that looks as if it has been bitten off; abruptly and irregularly cut or notched at the tip.","zh":"（尤用于植物学）末端像被咬掉一样的；顶端突然且不规则地截断/缺刻的。"},"examples":[{"en":"The plant has premorse leaves, as if the tips were bitten off.","zh":"这种植物的叶片呈“premorse”状，叶尖看起来像被咬掉一样。"},{"en":"Look for premorse root ends when identifying this sedge.","zh":"辨认这种莎草时，可以留意根的末端是否呈“premorse”（像被咬断）状。"}]}],"synonyms":["truncate","notched","eroded","bitten-off"],"phonetic":"/priˈmɔrs/","extraExplanation":["这个词在日常英语里非常少见，最常出现在植物学/生态学的描述中，用来精确描述叶、根等器官“末端像被咬掉”的形态特征。","词源来自拉丁语前缀 pre-（向前）+ morsus（咬），核心意象就是“咬断/咬去一块”。因此它描述的是外观形状，并不表示“后悔/悔恨”（remorse）的意思。"]}
{"word":"premortal","summary":{"en":"Premortal means ‘before death’; in some religious contexts it can mean ‘before earthly life (before birth).’","zh":"premortal 指“死前的”；在某些宗教语境中也可指“尘世生命之前（出生前/前生）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Existing, happening, or relating to the time before death.","zh":"（正式）存在于、发生于或与死亡之前的时期有关的；死前的。"},"examples":[{"en":"The poet writes about premortal fear and the wish to live fully.","zh":"诗人写到死前的恐惧，以及想要尽情活着的愿望。"},{"en":"The story contrasts premortal choices with what happens after death.","zh":"这个故事把死前的选择与死后的结果作对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"(religion, especially Latter-day Saint/Mormon usage) Relating to existence before earthly life (the ‘premortal life’).","zh":"（宗教用语，尤指摩门教/耶稣基督后期圣徒教会）与尘世生命之前的存在有关的；前生的（“premortal life”）。"},"examples":[{"en":"In Latter-day Saint teachings, premortal life is discussed as a time before birth.","zh":"在后期圣徒的教导中，“前生”被描述为出生之前的时期。"},{"en":"They used the term premortal to describe events believed to have happened before mortality.","zh":"他们用“premortal”来描述被认为发生在尘世生命之前的事件。"}]}],"synonyms":["antemortem","pre-death","before death","pre-birth","prenatal (not the same nuance)"],"phonetic":"/ˌpriːˈmɔr.təl/","extraExplanation":["“premortal”常见于宗教或哲学语境；在日常英语中更常用的表达是“before death”（死前）或“before birth / prenatal”（出生前/产前，生物学意义）。","在英语写作里，“premortal”带有较强的正式、抽象色彩；如果你不是在讨论特定宗教教义或严肃的哲学主题，用它可能显得过于学术或小众。"]}
{"word":"premortally","summary":{"en":"“Premortally” means “before death; while alive,” usually in formal contexts.","zh":"“premortally”意为“死亡之前、在世时（生前）”，多用于正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"before death; while still alive (often used in medical, legal, or ethical contexts).","zh":"在死亡之前；生前（常用于医学、法律或伦理语境）。"},"examples":[{"en":"The patient’s premortally expressed wishes were included in the care plan.","zh":"病人生前表达的意愿被写入了护理计划。"},{"en":"Researchers compared premortally collected data with postmortem findings.","zh":"研究人员将生前收集的数据与尸检后的发现进行对比。"}]}],"synonyms":["before death","while alive","premortem","antemortem"],"phonetic":"/priˈmɔrtəli/","extraExplanation":["“premortally”较少见，更常见的词是“premortem / antemortem（死前的、生前的）”，在医学报告、法医讨论或生命伦理（如预立医疗指示、临终照护）中更常用。","构词上：pre-（在……之前）+ mortal（会死的；与死亡有关的）+ -ly（副词后缀），字面意思就是“在死亡之前地/生前地”。"]}
{"word":"premortification","summary":{"en":"Premortification is a rare noun meaning shame felt in advance, or (medically) an early stage before tissue death (gangrene).","zh":"premortification 是个罕见名词，指“事前就感到的羞愧/难堪”，也可指（医学）组织坏死（坏疽）前的早期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A feeling of shame or humiliation you experience in advance, before something happens.","zh":"（罕见）在事情发生之前就预先感到的羞愧、难堪或丢脸。"},"examples":[{"en":"She felt a wave of premortification before giving her speech, imagining she would forget her lines.","zh":"她在演讲前涌起一阵“预先的难堪”，想象自己会忘词。"},{"en":"His premortification made him cancel the meeting, even though nothing bad had happened yet.","zh":"他的“预先羞辱感”让他取消了会议，尽管坏事还没发生。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine, rare) An early stage of tissue damage that may lead to mortification (gangrene).","zh":"（医学，罕见）可能发展为组织坏死（坏疽）的早期组织损伤阶段。"},"examples":[{"en":"The doctor watched the wound for signs of premortification and infection.","zh":"医生观察伤口是否出现早期坏死和感染的迹象。"}]}],"synonyms":["anticipatory embarrassment","foreboding","apprehension","early tissue necrosis"],"phonetic":"/ˌpriːˌmɔːr.t̬ə.fəˈkeɪ.ʃən/","extraExplanation":["这个词非常少见，多数人更常用的是 anticipatory embarrassment（预先尴尬/预先难堪）、preemptive shame（先发制人的羞耻感）等表达。","构词上是 pre-（在……之前）+ mortification。注意 mortification 常见有两类意思：①“羞辱/难堪”；②医学上“组织坏死、坏疽”。premortification 就是在这两类意思上加了“事前/早期”的概念。"]}
{"word":"premortified","summary":{"en":"“Premortified” usually means preserved or fixed before death (medical/biological use); rarely, it can jokingly mean feeling embarrassed in advance.","zh":"“premortified”通常指（医学/生物）死亡前已被保存或固定；较少见的用法是带幽默地表示“提前就尴尬/羞愧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine, biology) Preserved or fixed before death (used especially of tissue or an organism).","zh":"（医学/生物）在死亡之前就已被保存或固定的（尤指组织或生物体）。"},"examples":[{"en":"Researchers compared premortified tissue samples with postmortem samples to reduce damage from decomposition.","zh":"研究人员将“死亡前固定”的组织样本与“死亡后”的样本进行比较，以减少腐败分解带来的损伤。"},{"en":"The lab requested premortified specimens to improve the accuracy of staining results.","zh":"实验室要求提供死亡前固定的标本，以提高染色结果的准确性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, humorous) Already embarrassed or ashamed in advance; “mortified” ahead of time.","zh":"（罕见/带幽默）提前就感到尴尬、羞愧；“先尴尬起来”。"},"examples":[{"en":"He was premortified about meeting her parents and rehearsed what to say all week.","zh":"他一想到要见她父母就提前尴尬，整整一周都在排练要说什么。"},{"en":"I’m premortified just imagining myself forgetting everyone’s names.","zh":"我光想象自己把大家名字都忘了就已经先尴尬了。"}]}],"synonyms":["antemortem-fixed","prefixed (medical context)","mortified in advance","pre-embarrassed"],"phonetic":"/ˌpriːˈmɔr.təˌfaɪd/","extraExplanation":["“premortified”比较少见，最常出现在医学/解剖学语境中，结构上是 pre-（在……之前）+ mort-（死亡，见 mortal）+ -ified（使……成为/变成）。在科研写作里，它通常是在说样本在个体死亡前就已处理（如固定、保存），以减少死亡后变化对实验的影响。","日常英语里更常用的表达是 “mortified in advance / already mortified / pre-embarrassed（较口语）”。如果你在普通对话中用 premortified，往往会显得很书面或带一点自嘲幽默。"]}
{"word":"premortify","summary":{"en":"Premortify means to embarrass or humble someone (or yourself) beforehand—feeling or causing shame in advance.","zh":"premortify 指“提前让人难堪/羞辱（或自己先觉得丢脸）”，也就是在事情发生前就产生或造成尴尬与受挫感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to mortify (embarrass, shame, or humble) someone beforehand; to cause or anticipate humiliation in advance","zh":"（事先）使某人难堪、羞辱或挫其锐气；预先让人感到丢脸/受挫"},"examples":[{"en":"He tried to premortify her by criticizing her work before the meeting.","zh":"他试图在开会前就批评她的工作，好让她先难堪。"},{"en":"I felt premortified just thinking about forgetting my lines on stage.","zh":"光是想到自己在台上忘词，我就已经提前觉得很丢脸了。"},{"en":"Don’t premortify yourself—everyone makes small mistakes.","zh":"别先把自己想得很难堪——每个人都会犯小错。"}]}],"synonyms":["embarrass in advance","humiliate beforehand","preemptively shame","mortify"],"phonetic":"/ˌpriːˈmɔːrtɪfaɪ/","extraExplanation":["这个词非常少见，日常英语里几乎不用；更常见的表达是：preemptively embarrass/shame（先发制人地让人难堪）、humiliate in advance（提前羞辱），或用名词 anticipation of embarrassment（对尴尬的预期）。","词源上可拆为 pre-（在……之前）+ mortify（使难堪/使受挫；也可指“克制欲望、苦修”）。在现代语境里通常取“使难堪/羞辱”的含义，而不是宗教苦修的含义。"]}
{"word":"premortifying","summary":{"en":"“Premortifying” is a rare word meaning ‘mortifying in advance’—embarrassing or anxiety-inducing before something happens.","zh":"“premortifying”很少见，意思是“提前就让人难堪/紧张的”——在事情发生前就尴尬或不安。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Embarrassing, humiliating, or anxiety-producing in advance (before something happens).","zh":"（罕见）在事情发生之前就让人尴尬、难堪或感到紧张不安的。"},"examples":[{"en":"Meeting my partner’s parents felt premortifying—I worried I’d say something rude by accident.","zh":"要见伴侣的父母让我提前就很难堪——我担心自己会不小心说出失礼的话。"},{"en":"The premortifying silence before the announcement made everyone stare at the floor.","zh":"宣布消息前那段令人坐立不安的沉默，让大家都盯着地板。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “premortify”: to embarrass or make someone feel mortified beforehand (often used humorously).","zh":"“premortify”的现在分词：在事情发生前就让（某人）感到难堪/尴尬（常带幽默语气）。"},"examples":[{"en":"I’m premortifying myself by imagining every possible mistake in the interview.","zh":"我在面试前就把所有可能犯的错都想了一遍，提前把自己尴尬住了。"},{"en":"Don’t keep premortifying him with scary stories about the exam.","zh":"别再用考试的恐怖故事吓他了，让他提前难堪紧张。"}]}],"synonyms":["embarrassing","awkward","humiliating","nerve-racking","cringe-inducing"],"phonetic":"/ˌpriːˈmɔr.təˌfaɪ.ɪŋ/","extraExplanation":["这个词非常少见，更多时候人们会说 “mortifying”（令人尴尬的）或用更自然的表达如 “embarrassing”/“awkward”/“nerve‑racking”。“premortifying”常见于口语或写作里带一点自嘲的造词：pre-（提前）+ mortify（使难堪）。","“mortify”最早和拉丁语 mors/mort-（死亡）有关，含义从“使肉体受苦、克己”逐渐发展到现代常用的“使羞愧、使难堪”。因此 “premortifying”字面上有“提前被羞死/尴尬死”的夸张效果。"]}
{"word":"premortuary","summary":{"en":"Premortuary means ‘before death,’ used mostly in formal medical/legal contexts.","zh":"premortuary 指“死前的”，多用于较正式的医学或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before death; relating to the time before someone dies.","zh":"死前的；发生在死亡之前的；与临终前阶段有关的。"},"examples":[{"en":"The doctor discussed premortuary symptoms with the family.","zh":"医生和家属讨论了死前症状。"},{"en":"Premortuary planning can include writing a will and sharing care wishes.","zh":"死前规划可能包括立遗嘱和表达照护意愿。"}]}],"synonyms":["pre-death","before death","end-of-life","terminal"],"phonetic":"/ˌpriːˈmɔr.tʃu.er.i/","extraExplanation":["“premortuary”由前缀 pre-（在……之前）+ mortuary（太平间的；与死亡/葬仪有关的）构成，语体偏正式，常见于医学、法律或临终关怀语境。","日常英语里更常说“before death / pre-death / end-of-life”。“premortuary”听起来更学术或专业。","注意不要和“postmortem”（死后检验；死后）混淆：pre- 是“死前”，post- 是“死后”。"]}
{"word":"premorula","summary":{"en":"Premorula means an early embryo stage before the morula, typically the 2–8 cell cleavage stages.","zh":"Premorula 指桑椹胚之前的早期胚胎阶段，通常为2–8细胞的卵裂期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early stage of an embryo *before* the morula stage, usually referring to the cleavage stages when the embryo is still a small number of separate cells (about 2–8 cells).","zh":"（胚胎发育中）桑椹胚（morula）之前的早期阶段，通常指卵裂期，此时胚胎仍由少量彼此分开的细胞组成（约2–8细胞）。"},"examples":[{"en":"In the lab report, the embryo was described as a premorula with four cells.","zh":"在实验室报告中，该胚胎被描述为“四细胞的桑椹胚前期（premorula）”。"},{"en":"During the premorula stage, the cells have not compacted into a solid ball yet.","zh":"在桑椹胚前期，细胞尚未发生“紧密化”，还没有形成一个实心细胞团。"}]}],"synonyms":["cleavage-stage embryo","early cleavage stage","pre-morula stage"],"phonetic":"/ˌpriːməˈruːlə/","extraExplanation":["这是胚胎学/生殖医学里的专业术语，常见于科研论文或试管婴儿（IVF）胚胎发育记录中。","“morula（桑椹胚）”来自拉丁语 *morula*，意为“小桑葚”，形容细胞团外观像桑葚；“premorula”就是“在桑椹胚之前”。","与之相关的更常见分期表达包括：zygote（受精卵）、2-cell/4-cell/8-cell（2/4/8细胞期）、morula（桑椹胚）、blastocyst（囊胚）。"]}
{"word":"premosaic","summary":{"en":"Premosaic means “before Moses” or “before the Mosaic Law,” mainly used in biblical or theological writing.","zh":"Premosaic 指“摩西之前/摩西律法之前”，主要用于圣经研究或神学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biblical/theological) Happening before Moses or before the Law of Moses in the Hebrew Bible.","zh":"（圣经/神学）发生在摩西之前，或在《摩西律法》颁布之前的；属“摩西以前”的。"},"examples":[{"en":"Some scholars discuss pre-Mosaic worship practices in the ancient Near East.","zh":"一些学者讨论古代近东地区摩西以前的敬拜方式。"},{"en":"The story of Noah is often described as pre-Mosaic history.","zh":"挪亚的故事常被称为摩西以前的历史。"}]}],"synonyms":["pre-Mosaic","ante-Mosaic","before the Mosaic Law"],"phonetic":"/ˌpriˈmoʊzeɪɪk/","extraExplanation":["“pre-”表示“在……之前”。“Mosaic”在宗教语境中多指“摩西的/与摩西律法有关的”，因此 premosaic（更常写作 pre-Mosaic 或 pre-Mosaic period）主要用于神学、圣经研究或宗教史写作。","在基督教与犹太教讨论中，“pre-Mosaic”常用来区分：律法颁布之前（如亚当、挪亚、亚伯拉罕时期）与之后（以色列在西奈山领受律法之后）的制度、伦理与盟约背景。"]}
{"word":"premotion","summary":{"en":"Premotion is a rare noun meaning a forewarning or anticipation of something that will happen; it can also mean (obsolete) moving something beforehand.","zh":"Premotion 是个罕用名词，表示对将发生之事的预感/预先警示；也可指（过时）事先推动或预先使某事开始运作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A feeling or idea that something will happen in the future; a forewarning.","zh":"（罕用）对未来将发生之事的预感；预先的警示。"},"examples":[{"en":"She had a strange premotion that the trip would be delayed.","zh":"她有种奇怪的预感，这趟行程会被耽搁。"},{"en":"His premotion of trouble made him double-check the locks.","zh":"他对麻烦将至的预感让他又检查了一遍门锁。"}]},{"partOfSpeech":"n.","definition":{"en":"(Obsolete) The act of moving or setting something in motion beforehand.","zh":"（过时）事先推动；预先使某物开始运作/行动的行为。"},"examples":[{"en":"In older writings, “premotion” could refer to starting a process before its proper time.","zh":"在较早的文字中，“premotion”有时指在合适时机之前就启动某个过程。"}]}],"synonyms":["premonition","forewarning","presentiment","anticipation","foreboding"],"phonetic":"ˌpriːˈmoʊʃən","extraExplanation":["“premotion”在现代英语里非常少见，很多时候人们其实想写的是更常用的“premonition”（预感、预兆）。如果你是在日常写作或考试中使用，通常建议用“premonition”。","构词提示：pre- 表示“在……之前”，motion 表示“运动/行动”。因此它字面上有“预先的行动/运动”的感觉，但在现代语境中并不常用。"]}
{"word":"premourn","summary":{"en":"“Premourn” means to mourn or grieve before something bad has actually happened.","zh":"“premourn”指在不幸尚未发生前就先哀悼、先感到悲伤。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mourn in advance; to feel grief or sadness before a loss or bad event actually happens (often because you expect it).","zh":"预先哀悼；在失去或不幸尚未发生前就先感到悲伤（常因预期会发生）。"},"examples":[{"en":"She began to premourn the end of the friendship long before they stopped talking.","zh":"在他们真正不再说话之前，她就已经开始为这段友谊的结束预先哀悼。"},{"en":"Don’t premourn—wait until you know what the doctor says.","zh":"别先哀悼——等你知道医生怎么说再担心。"}]}],"synonyms":["grieve in advance","anticipatory grief","foregrieve","lament beforehand"],"phonetic":"/priˈmɔrn/","extraExplanation":["“premourn”是比较少见、偏文学/修辞的用词，结构是前缀 pre-（“在……之前”）+ mourn（“哀悼”）。日常英语更常用的表达包括：anticipatory grief（预期性悲伤，偏心理学/医学语境）、grieve in advance（提前悲伤）、worry ahead of time（提前担心，语气更口语）。","它常用来描述一种心理状态：事情还没发生，人已经在“提前经历失去”。在写作中用它可以突出角色的焦虑、悲观或对未来的强烈预感。"]}
{"word":"premove","summary":{"en":"A “premove” is an advance move in online chess that may play automatically, used to save time but risky if the position changes.","zh":"“premove”指网络国际象棋中预先输入、可能自动执行的一步棋，用来省时间，但局面变化时有风险。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a move in advance (especially online in chess) that will be played automatically if the opponent’s move allows it","zh":"（尤指网络国际象棋中）预先下好一步；若对手的走法允许，该步会自动执行"},"examples":[{"en":"In bullet chess, players often premove to save time.","zh":"在超快棋里，玩家常常预先走子来省时间。"},{"en":"I premoved a capture, but my opponent moved away, so nothing happened.","zh":"我预走了一个吃子，但对手躲开了，所以那步没有执行。"},{"en":"Don’t premove here—you might blunder your queen.","zh":"这里别预走，你可能会送掉后。"}]},{"partOfSpeech":"n.","definition":{"en":"a move entered in advance (in online chess) that may execute automatically","zh":"（网络国际象棋中）预先输入的一步棋；可能会自动执行的预走"},"examples":[{"en":"That premove cost me the game.","zh":"那次预走让我输掉了比赛。"},{"en":"He won on time thanks to a quick premove.","zh":"他靠快速预走在时间上获胜。"}]}],"synonyms":["pre-enter a move","move in advance"],"phonetic":"/ˈpriːmuːv/","extraExplanation":["“premove”主要见于线上棋类平台（如快棋/超快棋）。它的优势是省时间，但风险是对手走法变化后，你的预走可能变成很差的一步，甚至直接送子。","常见搭配：premove a recapture（预走回吃）、premove a check（预走将军）、safe premove（相对安全的预走）。","在书面英语里它仍偏“网络用语/圈内用语”，正式文章中可能会写成“make a premove”或解释为“enter a move in advance”。"]}
{"word":"premovement","summary":{"en":"Premovement means a preparatory motion or phase that happens before the main movement.","zh":"Premovement 指主要动作之前的准备性前置动作或动作前阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Movement that happens before the main or intended movement; a preparatory motion (often in sports, dance, biomechanics, or animal behavior).","zh":"在主要或预期动作之前发生的动作；准备性的前置动作（常见于运动、舞蹈、生物力学或动物行为）。"},"examples":[{"en":"In tennis, a quick shoulder turn is a premovement that helps you hit a stronger forehand.","zh":"在网球中，快速转肩就是一种前置动作，能帮助你打出更有力的正手。"},{"en":"The coach asked the dancers to control their premovement so the start looks clean.","zh":"教练让舞者控制前置动作，这样起步看起来更干净利落。"}]},{"partOfSpeech":"n.","definition":{"en":"The “pre-movement” phase in an activity or routine (for example, the setup before an exercise).","zh":"某项活动中的“动作前阶段”（例如练习开始前的准备环节）。"},"examples":[{"en":"Our training plan includes a premovement routine: breathing, posture check, and a light warm-up.","zh":"我们的训练计划包含动作前流程：呼吸、姿势检查和轻度热身。"}]}],"synonyms":["pre-movement","preparatory movement","setup motion","wind-up"],"phonetic":"/ˌpriːˈmuːvmənt/","extraExplanation":["“premovement”由前缀 pre-（在……之前）+ movement（移动/动作）构成，属于较偏专业的用词；日常英语里更常见的表达是 “pre-movement” 或 “preparatory movement / preparatory motion”。","在体育与表演中，premovement 常带有“泄露意图”的含义：对手可能从你的前置动作预测你接下来的动作，因此教练有时会强调减少或控制 premovement。"]}
{"word":"premover","summary":{"en":"Premover means an early mover/first actor, but it’s rare and usually written as “pre-mover” or expressed as “first mover.”","zh":"Premover 指“先行者/率先行动者”，但很少见，通常写作“pre-mover”或用“first mover”等更常用说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that moves or acts first, starting a change that others follow; an early mover (not a standard/common English word—often written as “pre-mover” or expressed as “first mover”).","zh":"先行者；率先行动（或迁移）的人/群体；带头者（这不是常见标准英语词，更常写作“pre-mover”，或用“first mover”等表达）。"},"examples":[{"en":"As a pre-mover in electric vehicles, the company gained a big advantage.","zh":"作为电动车领域的先行者，这家公司获得了很大的优势。"},{"en":"Early pre-movers into the new neighborhood saw property prices rise later.","zh":"最早搬进新社区的先行者后来看到房价上涨。"}]}],"synonyms":["first mover","pioneer","early adopter","trailblazer","forerunner"],"phonetic":"/ˌpriːˈmuːvər/","extraExplanation":["“premover”在现代英语中非常少见，读者更可能看到带连字符的“pre-mover”，或更自然的表达如“first mover”（商业/竞争语境），“pioneer”（开拓者），“early adopter”（早期采用者）。","如果你是在学术/专业文本里看到它，建议回到上下文确认是否其实是拼写错误（例如“premotor”）或特定领域的内部用语。"]}
{"word":"premuddle","summary":{"en":"Premuddle (rare) means to confuse or make something messy in advance.","zh":"Premuddle（少见）指在事情开始前就先把它弄乱或弄糊涂。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To confuse or muddle something in advance; to make a situation unclear before it fully begins.","zh":"（罕见、非标准用法）事先把某事弄乱/搞糊涂；在事情真正开始前就先制造混乱或不清楚。"},"examples":[{"en":"Let’s not premuddle the plan with too many rules—start simple and adjust later.","zh":"我们别在计划还没开始前就用太多规则把它预先搞乱——先从简单开始，再慢慢调整。"},{"en":"The speaker premuddled the topic by mixing up key terms in the opening minutes.","zh":"演讲者在开场几分钟把关键术语混在一起，导致话题一开始就被预先讲乱了。"}]}],"synonyms":["confuse","muddle","complicate","muddy","jumble"],"phonetic":"/priˈmʌdəl/","extraExplanation":["“premuddle”不是常见词，一般词典里未必收录。它看起来像由前缀“pre-（预先）”+“muddle（弄乱、使糊涂）”临时拼造出来的词，常用于幽默或强调“还没开始就先搞复杂/搞糊涂”的语气。正式写作中更常用：“confuse from the start / muddy the waters early / complicate things in advance（从一开始就弄糊涂/提前把水搅浑/事先把事情复杂化）”。"]}
{"word":"premuddled","summary":{"en":"Premuddled means already confused or unclear before something begins.","zh":"premuddled 指在事情开始前就已经糊涂或不清楚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/creative) Already confused or unclear before something starts; confused in advance.","zh":"（罕见/创造性用法）在事情开始之前就已经糊涂、混乱；事先就不清楚。"},"examples":[{"en":"I walked into the meeting premuddled, so the new budget numbers sounded even worse.","zh":"我进会议时就已经有点糊涂，所以新的预算数字听起来更让人头大。"},{"en":"Her premuddled explanation made the simple instructions hard to follow.","zh":"她事先就不清不楚的解释，让本来简单的说明变得很难照做。"}]}],"synonyms":["already confused","confused from the start","unclear beforehand","pre-confused","muddled"],"phonetic":"/priˈmʌd(ə)ld/","extraExplanation":["“premuddled”不是常见标准词，更像是把前缀 pre-（“在……之前”）加在 muddled（“糊涂的/混乱的”）上形成的临时造词，用来强调“还没开始就已经乱了”。在正式写作里通常会改用 already confused / confused from the start / unclear beforehand 等更常见表达。"]}
{"word":"premuddling","summary":{"en":"Premuddling means making something confusing or mixed up ahead of time (a rare, informal word).","zh":"premuddling 指“事先把事情弄乱/弄糊涂”，是较罕见的非正式用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) Causing something to become confused or mixed up in advance; “pre-confusing.”","zh":"（罕见，非正式）事先把某事弄乱/弄糊涂的；“提前造成混乱”的。"},"examples":[{"en":"The premuddling instructions made the task harder than it needed to be.","zh":"那些“提前搞糊涂”的说明让任务变得没必要地更难。"},{"en":"Avoid premuddling the discussion with too many side issues.","zh":"别用太多枝节问题把讨论提前搅乱。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of premuddle: to muddle (confuse or mix up) something beforehand.","zh":"premuddle 的现在分词：在开始前就把（信息/计划等）弄乱或弄糊涂。"},"examples":[{"en":"By premuddling the data labels, he created errors before the analysis even began.","zh":"他在分析开始前就把数据标签弄乱了，导致一开始就出现错误。"},{"en":"She apologized for premuddling the schedule with last-minute changes.","zh":"她为临时改动把日程提前搅乱而道歉。"}]}],"synonyms":["pre-confusing","muddling early","muddying the waters","complicating prematurely"],"phonetic":"/ˌpriˈmʌd(ə)lɪŋ/","extraExplanation":["这个词并不常见，更多是临时造词/口语式用法：pre-（提前）+ muddle（弄乱、弄糊涂）。在正式写作中，常用更自然的表达来替代，例如：confuse things in advance / create confusion early / muddy the waters early（把水搅浑）。","如果你是在某本书/文章里看到它，可能带有轻微的讽刺意味：还没开始做正事，就先把事情讲乱、搞复杂。"]}
{"word":"premultiplication","summary":{"en":"Premultiplication means multiplying first—often multiplying on the left in matrix math.","zh":"premultiplication 指先乘，常见于矩阵运算中表示从左边相乘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of multiplying something first (before another multiplication), especially multiplying a matrix or expression on the left side","zh":"先乘（在另一项乘法之前先进行的乘法），尤指在线性代数中把矩阵或表达式从左边相乘"},"examples":[{"en":"In matrix algebra, premultiplication by a rotation matrix can change the coordinate system.","zh":"在线性代数中，用旋转矩阵进行左乘（premultiplication）可以改变坐标系。"},{"en":"Premultiplication by 2 means you multiply by 2 first, before any other operation.","zh":"“premultiplication by 2”表示先乘以 2，再进行其他运算。"}]}],"synonyms":["left multiplication","pre-multiplying"],"phonetic":"/ˌpriːmʌltəpləˈkeɪʃən/","extraExplanation":["在矩阵里，premultiplication 通常指“左乘”：如果有矩阵 A 和 B，写作 A·B 时，A 是 premultiplier（左边的乘数），对 B 进行 premultiplication。相对地，postmultiplication 常指“右乘”（B·A）。","很多教材会用“premultiply by A”来强调乘法的方向，因为矩阵乘法一般不满足交换律（A·B 不一定等于 B·A），所以“从左乘还是从右乘”会影响结果。"]}
{"word":"premultiplier","summary":{"en":"A premultiplier is an electronics device that multiplies a signal’s frequency by a set factor before further processing.","zh":"premultiplier 指在后续处理前将信号频率按固定倍数进行倍增的电子装置（预倍频器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Electronics) A circuit or device that multiplies a signal (often a radio frequency) by an integer factor before it is processed by later stages (such as mixing or counting).","zh":"（电子/射频）预倍频器：在后续处理（如混频、计数）之前，把输入信号（常为射频）按整数倍放大的电路或装置。"},"examples":[{"en":"The receiver uses a premultiplier to raise the local oscillator frequency before mixing.","zh":"该接收机使用预倍频器在混频前提高本地振荡器频率。"},{"en":"A ×10 premultiplier makes it easier to measure a low-frequency reference with a frequency counter.","zh":"×10 的预倍频器能让频率计更容易测量较低频率的参考信号。"}]}],"synonyms":["frequency multiplier","frequency doubler","multiplier stage"],"phonetic":"/ˌpriːˈmʌltəˌplaɪ.ɚ/","extraExplanation":["“Pre-”表示“在……之前”，multiplier 表示“倍增器/乘法器”。在射频系统里，premultiplier 常用于把振荡器或参考信号先倍频到更合适的频段，从而改善后级（例如混频器或锁相环 PLL）的工作范围与分辨率。","它通常按整数倍（×2、×4、×10 等）倍频；与“amplifier（放大器）”不同，premultiplier 的核心是改变频率（或等效地增加周期内的脉冲数），不只是把幅度变大。"]}
{"word":"premultiply","summary":{"en":"Premultiply means multiply on the left (often in matrix math) before other operations.","zh":"Premultiply 指从左边相乘（常见于矩阵运算），并强调先于其他运算进行。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To multiply (a number, expression, or matrix) on the left side by another number or matrix; to apply multiplication before another operation.","zh":"（数学/矩阵）用另一个数或矩阵从左边去乘；在其他运算之前先进行乘法处理。"},"examples":[{"en":"In matrix algebra, premultiply A by B to get BA.","zh":"在矩阵代数里，用 B 去左乘 A 得到 BA。"},{"en":"Premultiply both sides of the equation by 2 to clear the fraction.","zh":"把等式两边先乘以 2 来消去分数。"},{"en":"The algorithm premultiplies the vector by a scaling matrix before rotation.","zh":"该算法先用缩放矩阵左乘向量，再进行旋转。"}]}],"synonyms":["left-multiply","pre-multiply"],"phonetic":"/ˌpriːˈmʌltəˌplaɪ/","extraExplanation":["在矩阵运算里，“premultiply”通常暗示顺序很关键：premultiply A by B 指的是 BA（B 在左，A 在右），而 postmultiply A by B 才是 AB。很多初学者会把顺序看反，所以可以记成“pre=在前/在左边先做”。","在计算机图形学里也常见 premultiply（如 premultiplied alpha，预乘透明度），但那是更专门的用法；若你看到的是图像处理语境，可以告诉我上下文我再解释。"]}
{"word":"premultiplying","summary":{"en":"Premultiplying means multiplying on the left—especially in matrix math, where order matters.","zh":"Premultiplying 指“左乘”，尤其用于矩阵运算中，强调运算顺序很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"multiplying something (often a matrix or expression) on the left by another factor; the action of doing a left-side multiplication.","zh":"（常指矩阵或代数式）在左侧乘以另一个因子；进行“左乘”的动作。"},"examples":[{"en":"Premultiplying the equation by A can simplify the system.","zh":"把等式左乘矩阵 A 可以简化这个方程组。"},{"en":"After premultiplying by the inverse matrix, we isolate x.","zh":"左乘逆矩阵后，我们就能把 x 单独解出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a person or thing) performing a left-side multiplication; multiplying before another multiplication in a specified order.","zh":"（人或事物）在运算顺序中先进行左侧乘法；先于后续乘法进行相乘。"},"examples":[{"en":"You are premultiplying by the rotation matrix to change coordinates.","zh":"你是在用旋转矩阵左乘来改变坐标系。"},{"en":"She checked whether the algorithm was premultiplying or postmultiplying the vector.","zh":"她检查算法是在左乘还是右乘该向量。"}]}],"synonyms":["left-multiplying","premultiplication (related noun)","multiplying on the left"],"phonetic":"/ˌpriːˈmʌltɪˌplaɪɪŋ/","extraExplanation":["在矩阵运算里，“premultiply（左乘）”强调乘法发生在左边：A·B 表示 A 左乘 B。因为矩阵乘法通常不满足交换律（A·B ≠ B·A），所以“左乘/右乘（postmultiply）”会导致不同结果。","常见场景：解线性方程组时左乘逆矩阵（A^{-1}·(A·x)=x）；坐标变换或图形学里也常讨论对向量是用矩阵左乘还是右乘，取决于你把向量写成列向量还是行向量。"]}
{"word":"premundane","summary":{"en":"Premundane means “before the world (before creation).”","zh":"premundane 指“世界形成之前的；创世之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or occurring before the world (or before the creation of the world); pre-world.","zh":"世界（或天地）形成之前的；创世之前的。"},"examples":[{"en":"In some myths, a premundane ocean existed before land and sky were separated.","zh":"在一些神话中，天地分开之前存在着一个创世之前的海洋。"},{"en":"The poet describes a premundane silence that came before time began.","zh":"诗人描写了一种时间开始之前的、创世之前的寂静。"}]}],"synonyms":["precosmic","primordial","precreation"],"phonetic":"/ˌpriːmʌnˈdeɪn/","extraExplanation":["这个词非常少见，多出现在神学、神话学、宇宙论或文学写作中，用来营造“创世以前/万物未生”的氛围。","词源可拆为 pre-（在……之前）+ mundane（世间的；尘世的）。mundane 来自拉丁语 mundus（世界）。因此 premundane 字面意思就是“在世界之前”。","使用上常与 premundane chaos（创世前的混沌）、premundane waters（创世前之水）、premundane darkness（创世前的黑暗）等搭配。"]}
{"word":"premune","summary":{"en":"Premune means immune or resistant (and rarely, to protect in advance).","zh":"Premune 指“免疫的/有抵抗力的”（也可很少见地指“预先保护”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Naturally protected against a particular disease; resistant or immune.","zh":"（正式用语）对某种疾病天生有保护力的；有抵抗力的；免疫的。"},"examples":[{"en":"Some people seem premune to the virus and never develop symptoms.","zh":"有些人似乎对这种病毒有免疫力，从不出现症状。"},{"en":"The researchers looked for genes that might make certain groups premune to malaria.","zh":"研究人员寻找可能使某些群体对疟疾具免疫力的基因。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal, rare) To protect in advance; to make resistant or immune.","zh":"（正式，少见）预先保护；使产生抵抗力/免疫力。"},"examples":[{"en":"The goal of the vaccine is to premune the body against future infection.","zh":"疫苗的目标是让身体对未来感染产生预先的保护力。"}]}],"synonyms":["immune","resistant","protected","insusceptible"],"phonetic":"/priˈmjun/","extraExplanation":["“premune”在现代英语中非常少见，更常见的表达是“immune to … / resistant to … / protected against …”。在医学或学术写作里偶尔会看到它，用来强调“先天或预先形成的免疫/抵抗”。","词源上与拉丁语前缀“pre-（在……之前）”相关，带有“事先防护”的意味；因此它既可形容“已具备免疫”，也可（很少见地）作动词表示“使预先防护”。"]}
{"word":"premunicipal","summary":{"en":"Premunicipal means “before a place had municipal (city/town) government or was officially incorporated.”","zh":"premunicipal 指“在某地建立市政（设市）之前的；市政成立前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an area, organization, or period) existing before a place became a municipality or before municipal government was established.","zh":"（指地区、组织或时期）在某地成为市镇/市政机构建立之前存在的；市政成立前的。"},"examples":[{"en":"The museum has records from the premunicipal era, before the city was officially incorporated.","zh":"博物馆保存着市政成立前时期的记录，也就是这座城市正式设市之前的资料。"},{"en":"Premunicipal land boundaries were later redrawn when the town created its first city council.","zh":"该镇成立第一届市议会后，原先市政成立前的土地边界后来被重新划定。"}]}],"synonyms":["pre-incorporation","pre-city","pre-township","before incorporation","prior to municipal government"],"phonetic":"/ˌpriːmjuːˈnɪsəpəl/","extraExplanation":["“premunicipal”多见于美国/加拿大等地的地方史、城市规划、地产与档案文献中，用来标注“设市（incorporation）之前”的阶段或资料。","结构上是前缀 pre-（在……之前）+ municipal（市政的）。日常口语里不常用，写作中更常见的替代说法包括 “before incorporation” 或 “prior to municipal government.”"]}
{"word":"premunire","summary":{"en":"Premunire is an archaic legal term from English history, meaning to charge someone with (or the offense of) supporting a foreign authority over the Crown.","zh":"Premunire 是英国历史上的古旧法律术语，指（起诉某人）犯“承认外国权威高于王权”的罪，或指该罪名本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(historical law) To bring a legal charge against someone under the old English offense of “premunire,” meaning they were accused of supporting a foreign authority (especially the Pope) over the English Crown.","zh":"（历史法律）以英国旧时的“premunire（僭越王权罪）”起诉某人，即指控其支持外国权威（尤指教皇）高于英王/英国王权。"},"examples":[{"en":"In Tudor England, a powerful official could be premunired for appealing to Rome instead of accepting the king’s authority.","zh":"在都铎时期的英格兰，有权势的官员若向罗马上诉而不承认国王权威，可能会被以 premunire 罪起诉。"},{"en":"The lawyer explained that “to premunire” is an archaic verb found mainly in historical writing.","zh":"律师解释说，“to premunire”是一个古旧动词，主要出现在历史类文章中。"}]},{"partOfSpeech":"n.","definition":{"en":"The offense (or the legal penalty) under old English law for recognizing or enforcing a foreign power’s authority in England.","zh":"（旧英格兰法）“premunire（僭越王权罪）”这一罪名（或其刑罚），指在英格兰承认或执行外国势力的权威。"},"examples":[{"en":"He was accused of premunire for actions interpreted as giving the Pope authority in England.","zh":"他被指控犯有 premunire 罪，因为其行为被解读为让教皇在英格兰拥有权威。"},{"en":"History texts mention premunire as part of the Crown’s effort to control church power.","zh":"历史教材会提到 premunire，作为王权控制教会权力的一部分。"}]}],"synonyms":["(v.) prosecute (historical sense)","(n.) offense (historical/legal sense)","high treason (rough modern parallel, not exact)"],"phonetic":"/priːˈmjuːnɪr/","extraExplanation":["这个词来自拉丁语 *praemunire*，意为“预先警告/防范”。在中世纪到都铎时期，英王用相关法律限制教廷对英格兰的影响，特别是当人们把案件上诉到罗马、或承认教皇的司法权时。","在现代英语中它几乎只出现在历史、法律史或学术写作里；日常场景不使用。更常见的表达会用：*to prosecute for treason / to charge with an offense* 等更通用的说法。"]}
{"word":"premunition","summary":{"en":"Premunition means an advance warning or a foreboding feeling; less commonly, it can mean protection against danger.","zh":"Premunition 指预先的警告或不祥的预感；较少见时也可指对危险的防护或庇佑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an advance warning or a feeling that something (often bad) is going to happen; a presentiment","zh":"预先的警告；（常指不祥的）预感、预兆"},"examples":[{"en":"She had a strange premunition that the trip would be delayed.","zh":"她有种奇怪的预感，这趟旅行会被耽搁。"},{"en":"His dream felt like a premunition of trouble ahead.","zh":"他的梦像是对未来麻烦的预兆。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) protection or safeguarding against danger, especially spiritual or moral protection","zh":"（较少见）防护、庇佑；（尤指精神或道德层面的）保护"},"examples":[{"en":"Some people wear a charm as premunition against harm.","zh":"有些人戴护身符来求平安、防祸。"},{"en":"Prayer was seen as a kind of premunition in difficult times.","zh":"在艰难时期，祈祷被视为一种精神上的庇佑。"}]}],"synonyms":["premonition","forewarning","presentiment","foreboding","warning"],"phonetic":"/ˌpriːmjuːˈnɪʃən/","extraExplanation":["这个词在现代英语里比较书面、偏文学，日常更常用的说法是 *premonition*（预感、预兆）。它来自拉丁语词根：*pre-*（在前）+ *munire*（防护、加固），因此既可以表示“提前提醒”，也能引申出“防护/庇佑”。","在文学语境中，*premunition* 往往带一点宿命感或神秘色彩，用来渲染人物对未来事件的隐约察觉。"]}
{"word":"premunitory","summary":{"en":"Premunitory means “giving an early warning; suggesting something (often bad) may happen.”","zh":"premunitory 指“预先警告的、预兆性的”，暗示某事（常为不好的事）可能将发生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as a warning about something that may happen in the future; giving a sign that trouble or change is coming.","zh":"预先警告的；预兆性的；暗示未来可能发生的事情（通常是不好的事）。"},"examples":[{"en":"The sudden drop in sales was a premonitory sign of bigger problems.","zh":"销售额的突然下降是更大问题的预兆。"},{"en":"He had a premonitory feeling that the trip would be delayed.","zh":"他有一种预感，这趟行程会被耽误。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an early warning or a presentiment (a strong feeling that something is about to happen).","zh":"与“预警/预感”有关的；带有预感性质的。"},"examples":[{"en":"In the novel, a premonitory dream foreshadows the ending.","zh":"在小说里，一个预兆性的梦预示了结局。"}]}],"synonyms":["foreboding","ominous","warning","prophetic"],"phonetic":"/ˌpriːˈmʌnɪˌtɔri/","extraExplanation":["词源提示：premunitory 来自拉丁语词根 pre-（在前）+ monere（提醒、警告），所以核心意思是“事先提醒”。","常见搭配：premonitory sign（预兆）、premonitory feeling（预感）、premonitory dream（预示性的梦）。在文学作品里常用于“foreshadowing（伏笔/预示）”的氛围。","易混词：premonitory（预兆性的）≈ prophetic（预言性的，更像“先知式预测”）；warning（警告，通常更直接、明确）。"]}
{"word":"premusical","summary":{"en":"Premusical means “before musical training or development,” and is a rare term often written as pre-musical.","zh":"Premusical 指“音乐学习或音乐能力发展之前的阶段”，较少见，常写作 pre-musical。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening before formal music study or before a person develops musical skills; relating to an early stage when musical ability is just beginning.","zh":"（少见）发生在正式音乐学习之前的；与音乐能力尚在萌芽的早期阶段有关的。"},"examples":[{"en":"The teacher designed premusical activities to help children feel the beat and recognize patterns.","zh":"老师设计了“前音乐”活动，帮助孩子感受节拍并识别规律。"},{"en":"Premusical skills like clapping rhythms can support later piano learning.","zh":"像拍节奏这样的前音乐技能可以支持之后的钢琴学习。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, arts/theater) Taking place before a musical production is fully developed, such as early workshops or planning stages.","zh":"（较少见，艺术/戏剧）发生在音乐剧等作品完全成型之前的，例如早期工作坊或策划阶段。"},"examples":[{"en":"They held a premusical workshop to test songs and story ideas.","zh":"他们举办了一个音乐剧前期工作坊来测试歌曲和剧情想法。"}]}],"synonyms":["pre-musical","early musical","before formal music training","pre-instrumental"],"phonetic":"/ˌpriːˈmjuːzɪkəl/","extraExplanation":["这个词在日常英语中不常见，更常见的写法是带连字符的 **pre-musical**。含义通常来自前缀 **pre-**（“在……之前”）+ **musical**（“音乐的/有音乐性的”）。如果你是在学术或教学语境里写作，用 **pre-musical activities/skills** 会更自然。"]}
{"word":"premusically","summary":{"en":"Premusically means “in a pre-music stage” or “before the music begins.”","zh":"premusically 指“前音乐阶段/音乐训练之前”，也可指“音乐开始之前”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"before something becomes musical; in an early or pre-training stage related to music","zh":"在变得“音乐化”之前；处于与音乐相关的早期/训练前阶段"},"examples":[{"en":"Many children explore rhythm premusically by clapping and tapping before they learn songs.","zh":"很多孩子在学会唱歌之前，会先通过拍手、敲击来做“前音乐阶段”的节奏探索。"},{"en":"The teacher focused on premusically building listening skills, not on reading notes yet.","zh":"老师先在前音乐阶段培养聆听能力，还不急着教识谱。"}]},{"partOfSpeech":"adv.","definition":{"en":"before the music starts (e.g., in a performance or recording); in the moments leading up to the first musical sound","zh":"在音乐开始之前（如演出或录音中）；在第一个音乐声音出现之前的时刻"},"examples":[{"en":"Premusically, the hall was quiet except for a few coughs.","zh":"音乐开始前，厅里很安静，只偶尔有人咳嗽。"},{"en":"The conductor held the silence premusically to heighten anticipation.","zh":"指挥在音乐开始前刻意保持静默，以增强期待感。"}]}],"synonyms":["pre-musically","before the music begins","in a pre-musical stage","prior to musical training"],"phonetic":"/ˌpriːˈmjuːzɪkli/","extraExplanation":["“premusically”并不常见，更常见的写法是带连字符的 **pre-musically**，意思是“在音乐/音乐训练之前（的方式/阶段）”。","构词：**pre-**（在……之前）+ **musical**（音乐的）+ **-ly**（副词）。在学术语境（音乐教育、儿童发展）里更可能出现。"]}
{"word":"premuster","summary":{"en":"Premuster means to gather or inspect in advance—often before an official muster or inspection.","zh":"Premuster 指在正式集合/点名或检查前进行预先的集合或检阅（也可作名词指预集合/预检）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to assemble, gather, or organize (people, supplies, etc.) in advance, especially before an inspection, operation, or event","zh":"（尤指在检查、行动或活动前）预先集合、集结或整编（人员、物资等）"},"examples":[{"en":"The unit premustered at dawn before moving to the training area.","zh":"部队在天亮时预先集结，然后前往训练区域。"},{"en":"We premustered the equipment to make sure nothing was missing.","zh":"我们预先整理并清点装备，确保没有遗漏。"}]},{"partOfSpeech":"n.","definition":{"en":"a preliminary gathering or inspection held before the official muster","zh":"正式点名/集合（muster）之前的预集合或预检"},"examples":[{"en":"There was a premuster in the courtyard before the parade.","zh":"游行开始前，大家先在院子里进行了预集合。"},{"en":"The premuster revealed a few uniform issues that were fixed quickly.","zh":"预检发现了几处制服问题，很快就修正了。"}]}],"synonyms":["assemble","gather","muster","marshal","preassemble","precheck","inspect"],"phonetic":"/ˌpriːˈmʌstɚ/","extraExplanation":["“premuster”由前缀 pre-（“在……之前”）+ muster（集合、点名、检阅）构成，常见于军事、准军事组织或需要统一清点人数/装备的场景。","在现代英语里它相对少见，写作或正式文件中有时也会写成“pre-muster”。日常口语更常用“gather (everyone) beforehand / do a preliminary inspection”。"]}
{"word":"premutation","summary":{"en":"A premutation is a genetic DNA repeat expansion that’s bigger than normal but not big enough to cause the full disorder, though it can be inherited and may expand in the next generation.","zh":"premutation（预突变）指DNA重复序列的扩增超过正常但未达致病的全突变水平，可遗传并可能在下一代进一步扩增。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) A moderate-sized change (expansion) in a DNA repeat sequence that is larger than normal but not large enough to cause the full genetic disorder; it can be passed on and may expand in the next generation.","zh":"（遗传学）“预突变”：DNA重复序列出现中等程度的扩增，超过正常范围但尚未达到引发典型遗传病的程度；可遗传，并可能在下一代进一步扩增成“全突变”。"},"examples":[{"en":"She was found to carry a premutation in the FMR1 gene.","zh":"检查发现她携带FMR1基因的预突变。"},{"en":"A premutation may not cause clear symptoms, but it can be important for family planning.","zh":"预突变可能不会出现明显症状，但对家族生育规划很重要。"},{"en":"Doctors explained that a premutation can expand when passed from parent to child.","zh":"医生解释说，预突变在亲代传给子代时可能会进一步扩增。"}]}],"synonyms":["carrier state (context-dependent)","intermediate allele (context-dependent)"],"phonetic":"/ˌpriːmjuːˈteɪʃən/","extraExplanation":["这个词最常见于“脆性X综合征（Fragile X syndrome）”相关语境：FMR1基因中的CGG重复次数介于正常与全突变之间时，常被称为premutation。不同疾病/基因对“正常、预突变、全突变”的重复次数阈值可能不同。","拼写提示：premutation 是专门的遗传学术语；如果你想表达“排列/组合的变化”，更常用的词是 permutation（排列；置换）。"]}
{"word":"premutative","summary":{"en":"“Premutative” is rare and usually intended to mean “permutative” (about rearranging order).","zh":"“Premutative”很少见，通常是想表达“permutative”（与改变排列顺序/置换有关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; often a misspelling) relating to permuting—changing the order or arrangement of things.","zh":"（罕见；常为拼写错误）与“置换/排列顺序”有关；指把事物的顺序或组合方式改变。"},"examples":[{"en":"In many texts, “premutative” is a misspelling of “permutative.”","zh":"在很多文本中，“premutative”是“permutative”的拼写错误。"},{"en":"A permutative rule lets you rearrange the symbols without changing the set of symbols used.","zh":"置换规则允许你重新排列符号，但不改变所使用符号的集合。"}]}],"synonyms":["permutative","rearranging","commutative (sometimes confused)"],"phonetic":"/pɚˈmjuːtətɪv/","extraExplanation":["“premutative”在标准英语词典中很少作为常用词条出现；在数学、逻辑、计算机领域，更常见的是 **permutative**（与 permutation/permute 相关）或 **commutative**（可交换的，如加法满足交换律）。如果你是在数学/编程语境里看到它，建议先确认原文是否应为 permutative 或 commutative。"]}
{"word":"premutinied","summary":{"en":"Premunited means warned or protected in advance; prepared beforehand.","zh":"Premunited 指“事先被警告或防护的；预先做好准备的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: premunited) warned or protected in advance against possible danger, criticism, or temptation; made ready.","zh":"（多半指 premunited）预先警告或预先防护的；事先做好准备以应对危险、批评或诱惑的。"},"examples":[{"en":"She felt premunited against online scams after taking the training.","zh":"参加培训后，她感觉自己对网络诈骗有了预先防护。"},{"en":"The community was premunited by early warnings before the storm arrived.","zh":"暴风雨到来前，社区因提前预警而有所准备。"}]},{"partOfSpeech":"vt.","definition":{"en":"(premunite) to warn or protect someone in advance; to prepare someone to resist harm or persuasion.","zh":"（premunite）事先提醒或保护某人；让某人提前做好心理或行动准备以抵御伤害或蛊惑。"},"examples":[{"en":"The teacher tried to premunite students against misleading information.","zh":"老师试图让学生提前防备误导性信息。"},{"en":"Good mentoring can premunite new employees against common workplace mistakes.","zh":"良好的导师指导能让新员工提前避免常见的职场错误。"}]}],"synonyms":["forewarned","prepared","protected","armed (against)","cautioned"],"phonetic":"priˈmjuːnaɪtɪd","extraExplanation":["你写的 **premutinied** 很可能是拼写误写；更常见、也更符合语义的词是 **premunited**（形容词，意为“预先警告/预先防护过的”），动词原形是 **premunite**。","词源来自拉丁语 *praemunire*（意为“事先警告、事先武装/防护”）。在现代英语里它偏正式、较少见，日常更常用 **forewarned / prepared / protected** 等表达。"]}
{"word":"premutinies","summary":{"en":"“premutinies” is a rare way to mean the conditions or events leading up to mutinies.","zh":"“premutinies”是较罕见的说法，指多次兵变发生前的酝酿阶段与相关事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Events, tensions, or actions that happen before one or more mutinies; the lead-up to mutiny.","zh":"（罕见用法）一次或多次叛变/兵变发生之前的事件、紧张局势或行动；叛变的前奏。"},"examples":[{"en":"The report focused on the premutinies—pay cuts, harsh discipline, and growing resentment.","zh":"报告重点讨论了兵变前的征兆——减薪、严苛纪律以及不断累积的不满。"},{"en":"Historians study these premutinies to understand why sailors finally rebelled.","zh":"历史学家研究这些“兵变前期”的情况，以理解水手为何最终反叛。"}]}],"synonyms":["lead-up (to mutiny)","pre-mutiny unrest","build-up","warning signs","rising tensions"],"phonetic":"/priːˈmjuːtəniz/","extraExplanation":["“premutinies”并不是常见或标准词形，通常会写成 **pre-mutiny**（作形容词/定语用，如 *pre-mutiny tension*）或更自然地说 **the lead-up to the mutiny**（兵变的前因后果/酝酿阶段）。","如果你是想表达“叛变之前的迹象/动向”，常用搭配包括：**warning signs**, **unrest**, **rising tensions**, **grievances**（不满/诉求）。","若你的原意是“mutinies（多次兵变）”，那标准拼写是 **mutinies**。"]}
{"word":"premutiny","summary":{"en":"Premutiny (often pre-mutiny) means “before a mutiny,” or the period right before a mutiny happens.","zh":"premutiny（常写作 pre-mutiny）指“叛变发生之前的”，也可指“叛变爆发前的那段时期”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often hyphenated: pre-mutiny) Happening or existing before a mutiny; relating to the time right before a rebellion by soldiers or crew.","zh":"（常写作 pre-mutiny）发生在叛变/兵变之前的；与叛变爆发前那段时期有关的。"},"examples":[{"en":"The captain noticed pre-mutiny tension among the crew.","zh":"船长察觉到船员之间有叛变前的紧张气氛。"},{"en":"In the pre-mutiny days, food shortages and harsh punishments fueled anger.","zh":"在叛变爆发前的那些日子里，食物短缺和严厉惩罚激起了愤怒。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or situation immediately before a mutiny.","zh":"叛变爆发前的时期或局面。"},"examples":[{"en":"Historians focus on the premutiny as much as the mutiny itself.","zh":"历史学家研究叛变前的酝酿阶段，投入的精力不亚于研究叛变本身。"}]}],"synonyms":["pre-mutiny","before the mutiny","pre-rebellion","pre-uprising"],"phonetic":"/priːˈmjuːtəni/","extraExplanation":["“premutiny”不是非常常见的标准词，更常见的写法是带连字符的“pre-mutiny”，尤其在历史叙事、军事或航海题材中，用来强调“叛变发生前的征兆/酝酿阶段”。","词缀“pre-”表示“在……之前”。类似结构还有：prewar（战前的）、pretrial（审判前的）、preseason（赛季前的）。"]}
{"word":"premutinying","summary":{"en":"“premutinying” is a rare/nonstandard form meaning “before a mutiny” or “leading up to mutiny.”","zh":"“premutinying”属罕见/非标准用法，大意是“叛变之前的、叛变一触即发的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard) Happening before a mutiny; showing signs that people are about to mutiny.","zh":"（罕见/非标准用法）发生在叛变之前的；显示出即将叛变迹象的。"},"examples":[{"en":"Tension rose in the pre-mutinying hours, and the officers tightened security.","zh":"在叛变前的几个小时里紧张气氛加剧，军官们加强了安保。"},{"en":"The captain sensed a pre-mutinying mood among the crew.","zh":"船长察觉到船员中有一种叛变前的情绪。"}]}],"synonyms":["pre-mutiny","before the mutiny","on the verge of mutiny","close to mutiny"],"phonetic":"/ˌpriːˈmjuːtəniɪŋ/","extraExplanation":["“premutinying”不是英语里常见或标准的词形。更自然的表达通常是：\n- pre-mutiny (adj.)：a pre-mutiny atmosphere（叛变前的氛围）\n- before the mutiny：in the days before the mutiny（叛变发生前的几天）\n- on the verge of mutiny / close to mutiny：The crew was on the verge of mutiny（船员几乎要叛变了）。\n如果你原本想写“正在叛变”，标准形式是“mutinying”（现在分词）。"]}
{"word":"premycotic","summary":{"en":"Premycotic means occurring before a fungal infection (mycosis) becomes clearly present.","zh":"Premycotic 指“真菌感染（真菌病）尚未明显出现之前的/前期的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening before a fungal infection or before fungal features appear; occurring in an early stage that precedes mycosis","zh":"（医学）真菌感染发生之前的；在出现真菌感染特征之前的；真菌病（mycosis）前期的"},"examples":[{"en":"The rash looked premycotic, so the doctor monitored it before starting antifungal medicine.","zh":"这片皮疹看起来像真菌感染前期，所以医生先观察，再决定是否用抗真菌药。"},{"en":"Premycotic changes can be subtle and easily mistaken for eczema.","zh":"真菌感染前期的变化可能很细微，容易被误认为湿疹。"}]}],"synonyms":["prefungal","pre-infectious (fungal context)","early (possible) fungal"],"phonetic":"/ˌpriːmaɪˈkɑːtɪk/","extraExplanation":["“premycotic”由前缀 pre-（在……之前）+ mycotic（与真菌/真菌感染有关）构成，属于较少见的医学用词，多见于皮肤科或病理描述。日常英语里更常用的说法通常是 “before a fungal infection” 或 “early fungal/possible fungal” 之类的表达。"]}
{"word":"premyelocyte","summary":{"en":"A promyelocyte is an immature granulocyte-forming white blood cell mainly found in bone marrow.","zh":"早幼粒细胞是主要存在于骨髓中的未成熟白细胞（粒细胞前体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an immature white blood cell (a precursor of a granulocyte) found mainly in the bone marrow, developing from a myeloblast and later becoming a myelocyte","zh":"（骨髓中的）早幼粒细胞：一种未成熟的白细胞（粒细胞的前体），由髓母细胞发育而来，之后继续分化为幼粒细胞"},"examples":[{"en":"The bone marrow smear showed an increased number of promyelocytes.","zh":"骨髓涂片显示早幼粒细胞数量增多。"},{"en":"Promyelocytes normally stay in the bone marrow rather than circulating in the blood.","zh":"早幼粒细胞通常停留在骨髓中，而不是在血液里循环。"}]}],"synonyms":["promyelocyte cell (less common)","granulocyte precursor (broader)"],"phonetic":"/ˌpriːˈmaɪ.ə.loʊ.saɪt/","extraExplanation":["词源拆解：pre-（在……之前）+ myelo-（骨髓）+ -cyte（细胞），字面意思就是“骨髓细胞发育较早阶段的细胞”。","在血液学里，早幼粒细胞是粒细胞生成（granulopoiesis）中的一个阶段，位于“髓母细胞 myeloblast”之后、“幼粒细胞 myelocyte”之前。","临床相关：在急性早幼粒细胞白血病（APL）中，可见异常增多的早幼粒细胞；但是否异常需要结合检验范围、临床表现与医生解读。"]}
{"word":"premythical","summary":{"en":"Premythical means “before myths” or “not yet mythologized.”","zh":"premythical 指“神话形成之前的”或“尚未被神话化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing before the time when myths were formed or recorded; earlier than the mythic/legendary period.","zh":"发生在神话形成或被记录之前的；早于神话/传奇时代的。"},"examples":[{"en":"Some writers imagine a prem mythical age when humans and nature were not yet separated.","zh":"有些作家想象一个前神话时代，那时人类与自然尚未分离。"},{"en":"The story hints at prem mythical rituals that later became part of local legend.","zh":"这个故事暗示了一些前神话的仪式，后来成为当地传说的一部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not yet turned into myth; still historical or ordinary rather than legendary.","zh":"尚未被神话化的；仍属历史或日常层面、尚未传奇化的。"},"examples":[{"en":"The hero begins as a prem mythical figure—just a flawed person in a real town.","zh":"这位英雄一开始是个尚未被神话化的人物——只是现实小镇里一个有缺点的人。"},{"en":"The film focuses on the leader’s prem mythical years before later stories exaggerated his achievements.","zh":"这部电影聚焦于这位领袖尚未被神话化的岁月，之后的故事才夸大了他的成就。"}]}],"synonyms":["pre-mythic","proto-mythic","prelegendary","unmythologized","preheroic"],"phonetic":"/ˌpriːˈmɪθɪkəl/","extraExplanation":["“premythical”由前缀 pre-（“在……之前”）+ mythical（“神话的”）构成，多见于文学评论、历史/人类学写作或学术语境，日常口语中不常用。","它常用来讨论“神话如何产生”：先有某段被记忆、讲述的经历（premythical），后来在传播中被象征化、夸张化，逐渐变成“神话/传奇”（mythical）。","相关对比：mythical（神话中的、虚构传奇的）≠ prehistoric（史前的，指有文字记载之前，偏时间分期）。两者有时重叠，但侧重点不同：premythical 更强调“尚未神话化”的文化叙事阶段。"]}

