{"word":"preobedience","summary":{"en":"Preobedience means obeying in advance—showing compliance before being asked.","zh":"preobedience 指“预先服从”：在被要求之前就先表现出顺从与配合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) obedience shown in advance; a willingness to comply before being asked or ordered.","zh":"（罕见用法）预先的服从；在被要求或下达命令之前就表现出的顺从与配合。"},"examples":[{"en":"In some strict communities, preobedience is valued as a sign of respect.","zh":"在一些严格的群体中，预先的服从被视为尊重的表现。"},{"en":"The policy seemed to expect preobedience rather than open discussion.","zh":"这项政策似乎期待人们预先顺从，而不是公开讨论。"}]}],"synonyms":["obedience","compliance","willing compliance","submission","preemptive compliance"],"phonetic":"/ˌpriːəˈbiːdiəns/","extraExplanation":["“preobedience”在现代英语中非常少见，很多词典不收录。写作或正式表达时，更常用更自然的说法包括：“obedience”（服从）、“willing compliance”（自愿配合）、“prior obedience / obedience in advance”（预先服从）、“preemptive compliance”（先发制人的配合/先行顺从）。","构词上可理解为“pre-（在……之前）+ obedience（服从）”，用来强调“还没被要求就先顺从”的态度；语气常带有批评或强调权威氛围的意味。"]}
{"word":"preobedient","summary":{"en":"“Preobedient” means being obedient ahead of time—complying before you’re asked.","zh":"“preobedient”指“预先顺从的”——在被要求之前就先行服从。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) obedient in advance; ready to comply before being asked or commanded.","zh":"（罕见）预先顺从的；在被要求或命令之前就先行服从的。"},"examples":[{"en":"The preobedient staff had the documents prepared before the meeting began.","zh":"这些预先顺从的员工在会议开始前就把文件都准备好了。"},{"en":"A preobedient attitude can look like good initiative, but it may also hide fear of disagreement.","zh":"预先顺从的态度看起来像主动性，但也可能掩盖了害怕表达不同意见。"}]}],"synonyms":["overly compliant","eager to please","submissive","deferential"],"phonetic":"/ˌpri.oʊˈbiːdiənt/","extraExplanation":["“preobedient”非常少见，多见于较旧或刻意书面化的语境；也常写作“pre-obedient”。","前缀“pre-”表示“在……之前”，加上“obedient（顺从的）”，整体强调“提前就表现出服从”。日常英语更常用“overly compliant / eager to please / obedient”。"]}
{"word":"preobediently","summary":{"en":"A very rare/nonstandard adverb meaning “obediently in advance.”","zh":"一个非常少见/不规范的副词，意思是“事先就很顺从地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare or nonstandard) In an obedient way beforehand; obediently in advance (as if showing obedience before being asked).","zh":"（非常少见或不规范用法）预先地、事先地以顺从的方式；在被要求之前就表现得很服从。"},"examples":[{"en":"The child nodded preobediently, already ready to follow the rules before anyone spoke.","zh":"孩子预先地顺从地点了点头，还没人开口他就准备遵守规则。"},{"en":"She answered preobediently, trying to please her supervisor before the meeting even began.","zh":"她预先地顺从作答，想在会议开始前就取悦上司。"}]}],"synonyms":["obediently","submissively","dutifully","in advance"],"phonetic":"/ˌpriːəˈbiːdiəntli/","extraExplanation":["这个词在现代英语里几乎不使用，很多词典也不收录。它看起来是由前缀 pre-（“预先”）+ obediently（“顺从地”）临时拼出来的“造词/修辞用词”。日常表达中更自然的说法通常是 obediently（顺从地），或用 in advance（事先）+ obediently 来表达“事先就很顺从”的意思。"]}
{"word":"preobject","summary":{"en":"“Preobject” is a rare/nonstandard term meaning something that comes before a full “object,” often used in technical contexts; “pre-object” is more common.","zh":"“preobject”较少见且不太标准，常指“对象形成之前的东西/预对象”，多见于技术语境；更常见写法是“pre-object”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or rare term meaning “before an object” or “pre-object.” It’s usually used in technical or theoretical contexts to describe something that exists prior to being treated as a full “object” (for example, a placeholder or an early stage of object creation).","zh":"一个不太标准、较少见的词，意思大致是“在对象之前 / 预对象（pre-object）”。多见于技术或理论语境，指在被当作完整“对象”之前的东西（例如占位物或对象创建的早期阶段）。"},"examples":[{"en":"In this design note, a “preobject” is created first and later finalized into a full object.","zh":"在这份设计说明里，会先创建一个“preobject（预对象）”，之后再完善成完整对象。"},{"en":"Because “preobject” isn’t standard English, many writers prefer “pre-object” or “placeholder object.”","zh":"因为“preobject”不是标准英语，很多作者更倾向用“pre-object（预对象）”或“placeholder object（占位对象）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) Something considered before choosing the real target of attention, interest, or discussion.","zh":"（少见，非正式）在真正的关注对象/讨论对象确定之前，被先拿来考虑的事物。"},"examples":[{"en":"We talked about a few preobjects before deciding on the main topic.","zh":"在决定主要话题之前，我们先讨论了一些“预对象”。"}]}],"synonyms":["pre-object","placeholder object","prototype (context-dependent)","preliminary object"],"phonetic":"/priˈɑbdʒɛkt/","extraExplanation":["“preobject”在日常英语里几乎不会单独出现，更多是把“pre-（预先的）”和“object（对象）”临时拼在一起的写法。正式写作里更常见的是带连字符的“pre-object”。","如果你是在编程/计算机语境中看到它，建议你提供上下文（例如语言、框架、原句），因为不同系统里它可能是特定术语或类名/变量名，含义会更精确。"]}
{"word":"preobjection","summary":{"en":"A rare term meaning an objection raised in advance.","zh":"较少见，指“提前提出的反对意见”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An objection made in advance, before the main discussion or event (rare; more commonly phrased as “preemptive objection” or “preliminary objection”).","zh":"预先提出的反对意见（较少见；更常说 preemptive objection 或 preliminary objection）。"},"examples":[{"en":"Before the meeting even started, she raised a preobjection about the budget.","zh":"会议还没开始，她就先对预算提出了预先反对意见。"},{"en":"His preobjection was that the plan would cost too much and take too long.","zh":"他预先反对的理由是：这个计划太费钱也太耗时。"}]}],"synonyms":["preemptive objection","preliminary objection","objection in advance"],"phonetic":"/ˌpriːəbˈdʒɛkʃən/","extraExplanation":["“preobjection”在现代英语里非常不常见，很多词典不会单独收录。写作中更自然的表达包括：\n- preemptive objection（预先反对，强调“抢先提出”以防后续争论）\n- preliminary objection（初步/程序性反对，法律或正式辩论中常见）\n- objection in advance（提前提出的反对）","在法律语境里，“preliminary objection”更固定，常指在进入实体争议前先就程序或管辖权提出异议。"]}
{"word":"preobjective","summary":{"en":"Preobjective means ‘before something becomes objective or clearly defined,’ especially in psychology/philosophy; rarely, it can mean ‘before objectives (goals) are set.’","zh":"preobjective 指“在变得客观/清晰可界定之前”的（多用于心理学/哲学）；少见时也可指“在设定目标之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before something becomes objective (clearly defined, measurable, or recognized as an “object” of thought). Often used in psychology or philosophy to describe very early, pre-conceptual experience.","zh":"在某事变得“客观”（清晰可界定、可衡量，或被当作思考对象）之前就存在或发生的。常见于心理学或哲学中，指概念形成之前的早期经验。"},"examples":[{"en":"Some researchers describe an infant’s earliest sensations as preobjective experience, before clear self–other boundaries form.","zh":"一些研究者把婴儿最早期的感觉称为“前客观”的经验，因为那时自我与他者的界限尚未清晰形成。"},{"en":"The therapy focuses on preobjective feelings that are hard to put into words.","zh":"这种治疗关注那些难以言说的“前客观”感受。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Before goals or targets (“objectives”) are set; occurring prior to planning objectives.","zh":"（少见）在目标（objectives）设定之前的；发生在制定目标之前的。"},"examples":[{"en":"During the preobjective phase, the team gathers data before writing the project objectives.","zh":"在“目标设定前”的阶段，团队会先收集数据，再撰写项目目标。"}]}],"synonyms":["preconceptual","pre-verbal","pre-reflective","predefined (different nuance)"],"phonetic":"/ˌpriːəbˈdʒɛktɪv/","extraExplanation":["“preobjective”不是日常高频词，更常见于学术语境（心理学、哲学、现象学等），用来表达“概念化之前/对象化之前”的状态。","如果你想表达“客观的、无偏见的”，通常用 objective；如果你想表达“制定目标之前的阶段”，更自然的说法是 pre-planning phase 或 before setting objectives。"]}
{"word":"preobligate","summary":{"en":"“Preobligate” means to obligate or commit someone (often funds or a party) in advance, before a later approval or agreement.","zh":"“preobligate”指在正式批准或协议之前就预先使某人/资金承担义务或作出承诺。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bind (someone) in advance by an obligation; to make a prior commitment before a later event or agreement","zh":"（在事前）使（某人）承担义务；预先约束；先行承诺"},"examples":[{"en":"The contract does not preobligate you to renew after the trial period.","zh":"这份合同不会让你在试用期结束后就必须续约。"},{"en":"The policy is designed to prevent agencies from preobligating funds before approval.","zh":"该政策旨在防止机构在获批前就预先承诺（支出）资金。"}]}],"synonyms":["obligate in advance","commit in advance","bind beforehand","precommit"],"phonetic":"/ˌpriːˈɑːbləˌɡeɪt/","extraExplanation":["“preobligate”较少见，常出现在法律、政府采购、财务与合同语境中，强调“在正式批准/签署/发生之前就先把义务或资金承诺固定下来”。","常见搭配：preobligate funds（预先承诺资金）、preobligate a party（预先约束一方）。在日常英语中更常用 commit in advance, obligate in advance, bind beforehand 等表达。"]}
{"word":"preobligated","summary":{"en":"Preobligated means ‘already committed or obligated in advance.’","zh":"preobligated 指“事先已经承担义务/已被预先承诺（占用）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already obligated or committed in advance (often by a prior agreement, rule, or expectation)","zh":"预先被要求承担义务的；事先已承诺的（常因协议、规定或期待而产生）"},"examples":[{"en":"Because the budget was preobligated, we couldn’t use that money for new projects.","zh":"因为预算已被预先锁定（用于既定义务），我们不能把那笔钱用在新项目上。"},{"en":"He felt preobligated to help his family, even before anyone asked.","zh":"他觉得自己在别人开口之前就有义务帮助家人。"}]}],"synonyms":["already committed","already obligated","earmarked","set aside","precommitted"],"phonetic":"/ˌpriːˈɑːblɪˌɡeɪtɪd/","extraExplanation":["“preobligated”较少见，多用于正式语境（如政府预算、合同、项目管理）。更常见的表达包括：“already committed / already obligated / earmarked / set aside”。","词形拆解：pre-（预先）+ obligated（有义务的）。理解前缀pre-能帮助你猜测许多词义，如 prepay（预付）、preapprove（预先批准）。"]}
{"word":"preobligating","summary":{"en":"Preobligating means committing or setting aside funds/resources ahead of a formal obligation, especially in budgeting contexts.","zh":"preobligating 指在正式义务或合同形成前，提前锁定/预留资金或资源，常用于预算语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of) preobligate: committing money or resources in advance, before the final obligation/contract is formally made (often in government or organizational budgeting).","zh":"（preobligate 的现在分词）预先承诺/预先占用资金或资源：在正式形成合同或法律义务之前，先把资金或资源提前锁定（常见于政府或机构预算）。"},"examples":[{"en":"The agency is preobligating funds so the project can start as soon as the contract is signed.","zh":"该机构正在预先占用资金，这样合同一签署项目就能立刻启动。"},{"en":"By preobligating part of the budget, the department reduced the risk of delays later in the year.","zh":"通过预先锁定部分预算，该部门降低了年底出现延误的风险。"}]}],"synonyms":["precommitting","setting aside","earmarking","allocating in advance","reserving funds"],"phonetic":"/ˌpriːˈɑːbləˌɡeɪtɪŋ/","extraExplanation":["“preobligate / preobligating”多见于财政、采购、拨款管理等正式语境，尤其是美国政府或大型机构的预算流程中。它强调的是一种“内部先行锁定/预留”的动作，不等同于已经签署合同或已经产生最终的法律义务。","词形上：pre-（预先）+ obligate（使承担义务/使受约束）。在日常英语里不常用，更常见的替代表达是 “set aside funds”（预留资金）或 “commit funds in advance”（提前承诺资金）。"]}
{"word":"preobligation","summary":{"en":"A preobligation is a duty or debt that existed before a new agreement or event.","zh":"preobligation 指在新协议或事件之前就已经存在的义务或债务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an obligation (duty, responsibility, or debt) that already exists before a particular event, agreement, or new obligation begins","zh":"既存义务；先前义务（在某事件、协议或新义务开始之前就已经存在的责任、义务或债务）"},"examples":[{"en":"The contract states that the new terms do not cancel any preobligations to third parties.","zh":"合同规定，新条款不会取消对第三方的任何既存义务。"},{"en":"She disclosed her preobligation to repay a student loan before applying for the mortgage.","zh":"她在申请房贷前披露了自己偿还助学贷款的既存义务。"}]}],"synonyms":["prior obligation","pre-existing obligation","existing obligation","previous commitment"],"phonetic":"/ˌpriːˌɑːbləˈɡeɪʃən/","extraExplanation":["“preobligation”在日常英语中很少见，更常用的说法是“prior obligation”或“pre-existing obligation”。","多见于法律、合同、财务场景，用来强调某项责任/债务在时间上早于当前讨论的安排，因此可能影响新的协议（例如违约、优先顺位、披露义务等）。","构词：pre-（在……之前）+ obligation（义务/责任）。"]}
{"word":"preoblige","summary":{"en":"Preoblige means to do a favor first so someone feels obligated later.","zh":"preoblige 指先施恩让对方之后觉得有义务回报或不好拒绝。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to oblige someone in advance; to place someone under an obligation beforehand (often by doing a favor first).","zh":"预先施恩使人欠情；事先让某人负人情债（常指先做个好处让对方不好拒绝）。"},"examples":[{"en":"He tried to preoblige the committee by offering free services before the vote.","zh":"他在投票前主动提供免费服务，想先让委员会欠他一个人情。"},{"en":"Don’t preoblige your guests with expensive gifts—they may feel pressured to reciprocate.","zh":"别用昂贵礼物先“让”客人欠情——他们可能会觉得被迫要回礼。"}]}],"synonyms":["oblige beforehand","place under an obligation","make someone feel obligated","put in one’s debt"],"phonetic":"/ˌpriəˈblaɪdʒ/","extraExplanation":["“preoblige”比较少见，语气偏正式或带一点批评意味：强调“先施恩→让对方难以拒绝/不好意思反对”。日常更常用的表达有：do someone a favor in advance / put someone under an obligation / make someone feel obligated。"]}
{"word":"preobliged","summary":{"en":"“Preobliged” means already obligated or indebted in advance; it’s rare and somewhat old-fashioned.","zh":"“preobliged”指“事先就负有义务/欠人情”，用法较少见，略偏旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already obligated or indebted (to someone) in advance; having a prior obligation.","zh":"预先负有义务的；事先受人恩惠而“先欠一份情”的。"},"examples":[{"en":"I felt preobliged to help because she had supported me earlier.","zh":"因为她之前帮助过我，我觉得自己预先就欠她一个人情，应该去帮忙。"},{"en":"The committee was accused of being preobliged to the donor before the vote.","zh":"委员会被指责在投票前就对捐赠者有所亏欠，从而难以保持公正。"}]}],"synonyms":["indebted","beholden","already obligated","under an obligation","duty-bound"],"phonetic":"/ˌpriːəˈblaɪdʒd/","extraExplanation":["“preobliged”比较少见，常见于较正式或偏旧式的写法，意思接近“事先就负有义务/人情债”。在现代英语里，人们更常用：already obligated / indebted / beholden / under an obligation。","构词上是 pre-（在……之前）+ obliged（有义务的）。有时也会被当作“pre-obliged”理解。若你是在法律或合同语境里看到它，现代文本更可能用 preexisting obligation（既存义务）或 pre-obligated（预先被要求承担义务）。"]}
{"word":"preobliging","summary":{"en":"Preobliging means being helpful or accommodating in advance (a rare word), sometimes implying being overly eager to please.","zh":"preobliging 指“预先体贴、提前帮忙”（较罕见），有时也暗示“过于殷勤、太想讨好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Being obliging or helpful in advance; doing something kindly before you are asked, often to prevent trouble or win favor.","zh":"（罕见）预先体贴／预先帮忙的；在别人开口之前就先友善地提供帮助，常带有避免麻烦或赢得好感之意。"},"examples":[{"en":"The preobliging host had already arranged a taxi before we even mentioned leaving.","zh":"那位预先体贴的主人在我们还没提要走之前，就已经安排好了出租车。"},{"en":"Her preobliging emails answered questions I hadn’t yet asked.","zh":"她那些预先体贴的邮件把我还没来得及问的问题都回答了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Acting overly eager to please; too ready to do favors.","zh":"（较少见）过于殷勤的；太急于讨好、太急着帮忙的。"},"examples":[{"en":"He sounded preobliging, as if he wanted something in return.","zh":"他听起来有点过于殷勤，像是想要回报一样。"}]}],"synonyms":["obliging","helpful","accommodating","thoughtful","eager to please"],"phonetic":"/ˌpriəˈblaɪdʒɪŋ/","extraExplanation":["“pre-”表示“在……之前/预先”。“preobliging”在现代英语里非常少见，多数情况下人们会用更常见的词来表达相似意思，例如：obliging（乐于助人的）、helpful（有帮助的）、accommodating（通融体贴的）、thoughtful（体贴的）。","如果你在旧文本或较正式的文体中看到它，通常强调“还没被请求就先帮忙”的感觉；有时也可能带一点“殷勤得过头”的暗示，需要看语境。"]}
{"word":"preoblongata","summary":{"en":"A rare anatomical term for the brainstem area anterior to the medulla, often meaning the pons in older texts.","zh":"一个较少用的解剖学术语，指延髓前方的脑干区域；旧文献中常指脑桥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, rare) A region of the brainstem in front of the medulla oblongata; in older usage, often referring to the pons (pons Varolii).","zh":"（解剖学，较少用）位于延髓（medulla oblongata）之前的脑干区域；在较早的用法中常用来指脑桥（pons／pons Varolii）。"},"examples":[{"en":"In some older anatomy texts, the pons is described as the preoblongata.","zh":"在一些较早的解剖学教材中，脑桥会被称为 preoblongata。"},{"en":"The term preoblongata is uncommon in modern medical writing.","zh":"preoblongata 这个词在现代医学写作中并不常见。"}]}],"synonyms":["pons","pons Varolii","brainstem (context-dependent)"],"phonetic":"/ˌpriːɑːblɑːŋˈɡɑːtə/","extraExplanation":["这个词属于历史性/书面化的解剖学术语：pre- 表示“在……之前”，oblongata 指“延髓”。在现代解剖学中，更常直接使用 brainstem（脑干）、pons（脑桥）、medulla oblongata（延髓）等标准术语。"]}
{"word":"preobservance","summary":{"en":"“Preobservance” is a rare noun meaning observing or complying with something in advance, especially a ritual or rule.","zh":"“preobservance”是一个罕见名词，指对仪式或规则等的提前遵行/预先举行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) the act of observing, keeping, or complying with something in advance; an anticipatory or preliminary observance (often of a rule, ritual, or custom).","zh":"（罕见用法）提前遵守、奉行或举行某事；对规则、仪式或习俗的预先遵行/预先举行。"},"examples":[{"en":"In some communities, there is a quiet preobservance of the festival, such as fasting the day before.","zh":"在一些社群里，节日前会有较安静的预先遵行，比如提前一天禁食。"},{"en":"The policy does not require preobservance; compliance begins on the effective date.","zh":"该政策不要求预先遵守；从生效之日起开始执行。"}]}],"synonyms":["prior observance","preliminary observance","advance observance","early observance"],"phonetic":"/ˌpriːəbˈzɝːvəns/","extraExplanation":["“preobservance”不是常见标准词，更多像是由前缀 pre-（“在……之前”）+ observance（“遵守/仪式/纪念活动”）临时组合出来的用法。在正式写作中，更自然的表达通常是：prior observance / preliminary observance / advance observance，或直接改写为“observe beforehand / comply in advance”。","如果你本来想表达“预先观察/预先观测”，更常用的是“pre-observation”或“prior observation”，而不是“preobservance”。"]}
{"word":"preobservation","summary":{"en":"Preobservation means the time or stage before formal observation or data collection starts, mainly used in academic or research contexts.","zh":"preobservation 指正式观察或数据收集开始之前的阶段，主要见于学术/研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period or stage before formal observing, measuring, or recording begins (often in research, studies, or fieldwork).","zh":"（常用于研究/实地工作中）正式观察、测量或记录开始之前的阶段或时期。"},"examples":[{"en":"During the preobservation period, the researchers practiced using the survey tools.","zh":"在预观察阶段，研究人员练习使用调查工具。"},{"en":"We used preobservation notes to plan what to focus on during the site visit.","zh":"我们用预观察笔记来规划实地走访时要关注的重点。"}]}],"synonyms":["pre-observation period","preliminary observation","baseline period","pre-study phase"],"phonetic":"/ˌpriːˌɑːbzɚˈveɪʃən/","extraExplanation":["“preobservation”不是日常英语里的常见词，更常见的写法是带连字符的“pre-observation”，或用更自然的表达：例如“before observation begins / preliminary observation / baseline period（基线期）”。","在科研语境中，pre-observation 常指“正式数据收集前的准备期”：熟悉环境、试用工具、训练观察者、制定编码规则，以减少正式观察时的偏差。"]}
{"word":"preobservational","summary":{"en":"Preobservational means “before observation,” especially describing assumptions made prior to evidence, or early child thinking before reliable observational reasoning.","zh":"preobservational 指“在观察之前的”，常形容在证据/测量之前的假设；也可用于儿童发展领域，指儿童尚未能稳定运用观察进行推理的早期思维阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before careful observation or measurement; based on assumptions rather than direct evidence.","zh":"发生在系统观察或测量之前的；基于假设而非直接证据的。"},"examples":[{"en":"The team made a few preobservational guesses about what caused the error, then tested them with data.","zh":"团队先对错误原因做了一些观察前的猜测，然后再用数据验证。"},{"en":"Try not to treat first impressions as facts—they’re often preobservational.","zh":"不要把第一印象当作事实——它们往往属于观察前的判断。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Education/psychology) Relating to a child’s early thinking before they can reliably use observation to reason (often used in discussions of early childhood development).","zh":"（教育/心理学）与儿童在尚不能稳定地通过观察进行推理之前的早期思维有关（常见于早期儿童发展讨论）。"},"examples":[{"en":"In class, we discussed preobservational thinking and why young children may focus on one feature at a time.","zh":"课堂上我们讨论了观察前思维，以及为什么幼儿可能一次只关注一个特征。"},{"en":"Some textbooks describe a preobservational period within the broader preoperational stage.","zh":"一些教材把“观察前时期”描述为“前运算阶段”中的一个部分。"}]}],"synonyms":["preliminary","prior","pre-evidence","theoretical","speculative"],"phonetic":"/ˌpriˌɑbzərˈveɪʃənəl/","extraExplanation":["“preobservational”由前缀 pre-（在……之前）+ observational（观察的）组成，常见于学术写作，日常口语中不算高频。","在儿童发展理论里，它常与皮亚杰（Piaget）的“前运算阶段（preoperational stage）”一起出现；有些教材会把2–4岁左右称为“preobservational period”，强调此时儿童推理更依赖直觉与表面特征，而不是系统观察与逻辑操作。"]}
{"word":"preobserve","summary":{"en":"Preobserve means to observe something beforehand; it’s a rare word in modern English.","zh":"preobserve 指“预先观察”，但在现代英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to observe or watch something in advance; to notice something beforehand (rare).","zh":"预先观察；事先留意（较少见/不常用）。"},"examples":[{"en":"Researchers preobserved the site to plan where to place the cameras.","zh":"研究人员先预先观察现场，以便规划摄像机的摆放位置。"},{"en":"If you preobserve the traffic pattern, you can choose a faster route.","zh":"如果你事先观察交通规律，就能选择更快的路线。"}]}],"synonyms":["observe beforehand","observe in advance","do a preliminary observation","survey"],"phonetic":"/priːəbˈzɝːv/","extraExplanation":["“preobserve”在现代英语中非常少见，实际写作与口语更常用：observe beforehand / observe in advance / do a preliminary observation。","构词上是前缀 pre-（“在……之前”）+ observe（“观察”）。在正式学术语境里，也可能用“pre-observe”（加连字符）来强调“预先做观察”。"]}
{"word":"preobserved","summary":{"en":"“Preobserved” means already observed beforehand, often used in academic or analytic contexts.","zh":"“preobserved”表示“预先观察到的/事先已观测的”，多见于学术或分析语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Observed beforehand; already seen, measured, or recorded before a later stage (often in research or analysis).","zh":"预先观察到的；事先已经看到、测量或记录下来的（常用于研究或分析语境）。"},"examples":[{"en":"The model cannot use preobserved outcomes to make a fair prediction.","zh":"模型不能用预先观察到的结果来做公平的预测。"},{"en":"We excluded any preobserved errors from the final evaluation.","zh":"我们把事先已发现的错误排除在最终评估之外。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “preobserve”: to observe in advance (rare in everyday English).","zh":"“preobserve”的过去式/过去分词：预先观察（在日常英语中很少用）。"},"examples":[{"en":"The researchers had preobserved the trend in a pilot study.","zh":"研究人员在预实验中已预先观察到这一趋势。"}]}],"synonyms":["previously observed","already observed","observed in advance","pre-recorded"],"phonetic":"/ˌpriːəbˈzɝvd/","extraExplanation":["“preobserved”不是非常常见的日常用词，更常见的表达是 “previously observed / already observed / observed in advance”。在统计、因果推断或机器学习语境中，有时会用来强调“在某一步决策或推断之前就已经被观测到”的信息（例如：preobserved covariates 预先观测到的协变量）。","拼写上也常见带连字符的形式：pre-observed（尤其在学术写作里更清晰）。"]}
{"word":"preobserving","summary":{"en":"“Preobserving” means observing something beforehand or in advance.","zh":"“preobserving”表示在行动或决定之前先进行观察、提前观察。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"observing something in advance or beforehand (the present participle/gerund form of “preobserve”).","zh":"事先观察；提前观察（“preobserve”的现在分词/动名词形式）。"},"examples":[{"en":"By preobserving the traffic pattern, we planned a safer route to school.","zh":"通过事先观察交通规律，我们规划了更安全的上学路线。"},{"en":"Preobserving the patient’s breathing helps the nurse notice small changes early.","zh":"提前观察病人的呼吸有助于护士及早发现细微变化。"}]}],"synonyms":["observing beforehand","observing in advance","making prior observations","preliminary observation"],"phonetic":"/ˌpriːəbˈzɝːvɪŋ/","extraExplanation":["“preobserving”来自前缀 pre-（“在……之前”）+ observe（“观察”）。在日常英语里不算常见，更自然的说法通常是：observe beforehand / observe in advance / make observations beforehand（先观察/提前观察）。","使用场景多出现在较正式、技术性或学术写作中（例如实验步骤、医疗记录、风险评估），强调“在正式行动/实验/决定之前先观察”。"]}
{"word":"preobstruct","summary":{"en":"“Preobstruct” is a rare verb meaning to block or hinder something beforehand.","zh":"“preobstruct”是很少见的动词，表示“事先阻挡/预先设置障碍”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to block or hinder something in advance; to create an obstruction before something can happen","zh":"事先阻挡；预先设置障碍（使某事难以发生）"},"examples":[{"en":"If the drain is likely to clog, install a filter to preobstruct debris from entering the pipe.","zh":"如果下水道容易堵塞，可以安装过滤网，预先阻挡杂物进入管道。"},{"en":"The new rules were designed to preobstruct misuse of the system.","zh":"这些新规定旨在预先阻止系统被滥用。"}]}],"synonyms":["prevent","preempt","block","obstruct","hinder","forestall"],"phonetic":"/ˌpriːəbˈstrʌkt/","extraExplanation":["“preobstruct”非常罕见，日常英语里几乎不用；更自然的表达通常是“prevent obstruction / keep … from being obstructed（防止堵塞）”，或直接用“obstruct（阻挡）”。","构词上由前缀“pre-（在……之前）”+“obstruct（阻挡）”组成，意思可以被理解，但在正规写作中可能会被视为不地道或非标准用词。"]}
{"word":"preobstruction","summary":{"en":"A medical term for the early stage before a full obstruction (blockage) develops.","zh":"医学用语：指完全梗阻发生前的早期阶段（正在形成的阻塞/预梗阻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A stage before a complete blockage (obstruction), especially in a hollow organ (such as the intestine or airway), where narrowing or partial blockage is starting to cause symptoms.","zh":"（医学）“完全梗阻/阻塞”发生之前的阶段，常指中空器官（如肠道、气道）开始出现狭窄或部分阻塞并引起症状的情况。"},"examples":[{"en":"After abdominal surgery, doctors watch for signs of preobstruction, such as bloating and reduced bowel sounds.","zh":"腹部手术后，医生会观察是否出现肠道预梗阻的迹象，例如腹胀和肠鸣音减弱。"},{"en":"Persistent vomiting can be a warning sign of preobstruction in the digestive tract.","zh":"持续呕吐可能是消化道预梗阻的警示信号。"}]}],"synonyms":["impending obstruction","early obstruction","partial obstruction","incipient obstruction"],"phonetic":"/ˌpriːəbˈstrʌkʃən/","extraExplanation":["这是一个偏医学、较少见的术语，常见于病历或影像学/外科讨论中。它通常强调“尚未完全堵死，但正在走向梗阻”的状态，便于医生决定是否需要禁食、减压、补液、影像复查或手术评估。","构词上由前缀 pre-（“在……之前”）+ obstruction（“阻塞/梗阻”）组成；临床上也可能用“impending obstruction（即将梗阻）”“partial obstruction（部分梗阻）”来表达相近概念。"]}
{"word":"preobtain","summary":{"en":"“Preobtain” means to get something beforehand; it’s rare, and “obtain in advance” is more common.","zh":"“preobtain”指“预先获得/事先取得”，较少见；更常用表达是“obtain in advance”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to obtain or acquire something in advance (before it is needed or before a planned time)","zh":"预先获得；事先取得（在需要之前或计划时间之前得到）"},"examples":[{"en":"The company tried to preobtain key materials before prices increased.","zh":"公司试图在价格上涨前预先取得关键材料。"},{"en":"If you can preobtain permission, the process will go faster.","zh":"如果你能事先取得许可，流程会更快。"}]}],"synonyms":["obtain in advance","get beforehand","secure","procure"],"phonetic":"/ˌpriːəbˈteɪn/","extraExplanation":["“Preobtain”不是常见词，在现代英语里比较少见；更自然、更常用的说法通常是 “obtain in advance”“get beforehand” 或根据语境用 “secure”“procure” 等。","构词：pre-（在……之前）+ obtain（获得）。多见于较正式或技术/法律/行政类文本中。"]}
{"word":"preobtainable","summary":{"en":"“Preobtainable” means “able to be obtained in advance.”","zh":"“preobtainable”意为“可预先获得的、可提前取得的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be obtained in advance (before a particular time, event, or need).","zh":"可预先获得的；可提前取得的。"},"examples":[{"en":"Tickets are preobtainable online before the concert date.","zh":"演唱会门票可在日期前于网上预先购买。"},{"en":"Some documents are preobtainable from the office to speed up the application.","zh":"有些文件可从办公室提前领取，以加快申请流程。"}]}],"synonyms":["obtainable in advance","available in advance","attainable beforehand","gettable ahead of time"],"phonetic":"/ˌpriːəbˈteɪnəbəl/","extraExplanation":["“preobtainable”由前缀 pre-（“预先、在……之前”）+ obtain（“获得”）+ -able（“能够……的”）构成。实际写作中更常见、更自然的表达是 “available in advance / obtainable in advance / can be obtained ahead of time”。如果你在正式文件或说明书里看到 preobtainable，通常是在强调“提前准备/提前拿到”的可行性。"]}
{"word":"preobtrude","summary":{"en":"Preobtrude means to push something forward or bring it up too early, often in an intrusive way.","zh":"preobtrude 指把某事以打扰/强加的方式过早提出或推到前面。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to thrust or push something forward beforehand; to bring up or impose something prematurely or before it is needed","zh":"预先突兀地提出/推到前面；在不合时宜或过早的时候把某事强加给别人"},"examples":[{"en":"The memo preobtruded concerns that should have been discussed after the data was reviewed.","zh":"这份备忘录过早地抛出了本应在审阅数据之后再讨论的担忧。"},{"en":"Try not to preobtrude your personal opinions in the first meeting; listen first.","zh":"第一次会议尽量不要过早强行表达个人观点；先听再说。"}]}],"synonyms":["introduce prematurely","bring up too early","impose beforehand","obtrude","interject"],"phonetic":"/priːˌɑbˈtruːd/","extraExplanation":["“pre-”表示“在……之前”，而“obtrude”表示“硬插入、打扰、强加（观点/事物）”。合在一起，“preobtrude”就是“提前强加/提前突兀地插入”。这个词非常少见，写作中更常用的替代说法有：bring up too early / introduce prematurely / impose beforehand。"]}
{"word":"preobtruded","summary":{"en":"Preobtruded means “made to stick out beforehand” or “already protruding in advance,” and it is very rare in modern English.","zh":"preobtruded 指“预先使之突出”或“已预先突出的”，在现代英语中非常罕见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To push or stick out in front beforehand; to make something protrude in advance.","zh":"（罕见）预先伸出；事先使某物突出在前。"},"examples":[{"en":"In the sketch, the artist had preobtruded the balcony line so the depth looked stronger.","zh":"在这张草图里，画家预先把阳台的线条画得更突出，让纵深感更强。"},{"en":"The designer preobtruded a small ridge to guide the user’s fingers.","zh":"设计师预先做出一条小凸起，用来引导用户的手指。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, as a participle adjective) Already sticking out in front; previously made prominent or protruding.","zh":"（罕见，作分词形容词）已预先突出的；先前被做得显眼/凸出的。"},"examples":[{"en":"The preobtruded edge caught the light and looked brighter than the rest.","zh":"那条预先突出的边缘反光，看起来比其他部分更亮。"},{"en":"He adjusted the model so the preobtruded parts wouldn’t snag on the casing.","zh":"他调整了模型，避免那些预先突出的部分卡住外壳。"}]}],"synonyms":["protruded","stuck out","jutted out","projected"],"phonetic":"/ˌpriːəbˈtruːdɪd/","extraExplanation":["这个词非常少见，多见于较旧或偏技术/文学的写法。结构上是 pre-（“在……之前”）+ obtrude（“突出来/伸出来”）。","日常英语里通常用更常见的说法替代：protruded / stuck out / jutted out；如果强调“提前设计或预先突出”，可用 made to protrude / designed to stick out 等表达。"]}
{"word":"preobtruding","summary":{"en":"“Preobtruding” is a rare word meaning “sticking out/projecting forward,” often understood as “obtruding beforehand.”","zh":"“preobtruding” 很少见，意思是“向外/向前凸出、很显眼地伸出”，常可理解为“提前就突出/冒出来”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) Sticking out or projecting forward, especially in a way that is noticeable; protruding beforehand.","zh":"（作形容词）向前凸出、伸出；尤指很显眼地（预先）突出。"},"examples":[{"en":"A preobtruding rock made the narrow path dangerous after the rain.","zh":"雨后，一块向外凸出的岩石让狭窄的小路变得危险。"},{"en":"He avoided the preobtruding nail on the old fence.","zh":"他避开了旧篱笆上那颗凸出来的钉子。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “preobtrude”) To push or thrust forward so as to stick out; to protrude in advance or beforehand (rare).","zh":"（“preobtrude”的现在分词）向前推/突，使之突出；（罕见）预先凸出、提前突显。"},"examples":[{"en":"Branches were preobtruding into the walkway, so they trimmed them back.","zh":"树枝提前伸到人行道上了，所以他们把枝条修剪回去。"},{"en":"A detail kept preobtruding into his thoughts, distracting him from the main point.","zh":"一个细节不断冒到他脑海里，让他偏离了重点。"}]}],"synonyms":["protruding","jutting (out)","sticking out","projecting","obtruding"],"phonetic":"/ˌpriːəbˈtruːdɪŋ/","extraExplanation":["这个词非常少见，常见的基础词是 **obtrude / obtruding**（闯入、伸出、碍眼地突出）。**pre-** 表示“在前、预先”，所以 **preobtruding** 可以理解为“提前/在前方就突出”。写作中更常用 **protruding, jutting out, sticking out, obtruding** 等。"]}
{"word":"preobtrusion","summary":{"en":"A rare technical term for an early or preliminary forward protrusion (often in dentistry).","zh":"一个较罕见的技术词，指较早/预先发生的向前前突（常用于牙科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) A forward thrust or projection that happens beforehand; a pre-protrusive movement (often used in dental/orthodontic contexts).","zh":"（罕见、技术用语）预先发生的前突/向前伸出；先于正式前突动作的前向移动（常见于牙科/正畸语境）。"},"examples":[{"en":"In some orthodontic notes, “preobtrusion” describes an early forward movement of the lower jaw before full protrusion.","zh":"在一些正畸记录中，“preobtrusion”用来描述下颌在完全前突之前的早期前移。"},{"en":"The clinician observed slight preobtrusion during the bite test.","zh":"临床医生在咬合测试中观察到轻微的预前突。"}]}],"synonyms":["preliminary protrusion","early protrusion","forward movement","protrusion"],"phonetic":"ˌpriːəbˈtruːʒən","extraExplanation":["“preobtrusion”不是常用英语词，更多可能出现在专业笔记、旧文献，或作为“pre- + obtrusion（前突/伸出）”的临时构词。日常表达一般用“early protrusion / initial protrusion / forward movement”更自然。","词形提示：前缀“pre-”表示“在……之前”；“obtrusion”可指（不合时宜的）插入/打扰，也可在某些技术语境中指“伸出/前突”。很多情况下更常见的词是“protrusion（前突）”。"]}
{"word":"preobtrusive","summary":{"en":"A rare adjective meaning “before becoming obtrusive/too noticeable or intrusive.”","zh":"一个罕见形容词，意思是“在变得碍眼或打扰人之前的；尚未造成干扰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) happening or existing before something becomes obtrusive (too noticeable, pushy, or intrusive).","zh":"（罕见）在某事变得“碍眼/唐突/打扰人”（obtrusive）之前发生或存在的；“尚未造成干扰的”。"},"examples":[{"en":"The designer aimed for a preobtrusive interface that stays out of the user’s way.","zh":"设计师希望界面在变得打扰用户之前都能保持“不过度抢眼”。"},{"en":"A preobtrusive warning can help people adjust before the problem becomes disruptive.","zh":"在问题变得严重干扰之前，提前但不强迫的提醒能帮助人们调整。"}]}],"synonyms":["unobtrusive (closest common word)","subtle","low-key","before it becomes intrusive"],"phonetic":"/ˌpriːəbˈtruːsɪv/","extraExplanation":["“preobtrusive”并不是常见标准词，很多词典可能查不到；它更像是临时造词（pre- “在……之前” + obtrusive “唐突的/碍眼的”）。写作中如果想更自然，可以考虑用：subtle（不显眼的）、unobtrusive（不打扰人的）、not yet obtrusive（尚未变得碍眼的）、before it becomes intrusive（在它变得冒犯/打扰之前）。","含义通常依语境而定：有时强调“提前、尚未造成干扰”，有时强调“刻意保持低调，避免变得碍眼”。如用于正式写作，建议改用更常见表达以避免读者困惑。"]}
{"word":"preobviate","summary":{"en":"Preobviate means to make something unnecessary in advance, usually by planning or taking early action (formal and rare).","zh":"preobviate 指“预先使某事变得不必要”，常用于强调通过提前规划或行动来免除后续需要（正式且少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Formal, rare) To remove the need for something; to make something unnecessary in advance by taking action or providing an alternative.","zh":"（正式，罕见）预先消除某事的必要性；通过采取措施或提供替代方案使某事变得不再需要。"},"examples":[{"en":"Good planning can preobviate many problems later.","zh":"良好的规划可以预先消除许多日后的问题。"},{"en":"The company updated its software to preobviate the need for manual reports.","zh":"公司更新了软件，从而预先消除了手动报表的需要。"},{"en":"Clear instructions preobviated any confusion among new employees.","zh":"清晰的说明预先消除了新员工的困惑。"}]}],"synonyms":["obviate","prevent","avoid","forestall","eliminate the need for","make unnecessary"],"phonetic":"/priːˈɑːbviˌeɪt/","extraExplanation":["这个词非常少见，语体偏正式或书面语。日常英语里更常用：prevent（防止）、avoid（避免）、eliminate the need for（免除……的需要）、make unnecessary（使不必要）。","词源上可理解为：obviate（排除/使不必要）前加 pre-（预先）。不过在现代用法中，preobviate 往往只是强调“提前把问题/需要消掉”。","近义词 obviate 更常见：The new system obviates the need for paperwork（新系统免除了纸质文书的需要）。"]}
{"word":"preobviated","summary":{"en":"“Preobviated” means prevented something in advance or made it unnecessary beforehand (rare).","zh":"“preobviated”意为“预先防止/预先排除，使某事提前变得不必要”（较罕用）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To have prevented a problem, need, or difficulty before it happened; to have made something unnecessary in advance.","zh":"（罕用）事先防止（问题/需要/困难）发生；预先排除；使某事提前变得不必要。"},"examples":[{"en":"The new safety checks preobviated many accidents that used to happen on the job.","zh":"新的安全检查预先防止了许多过去在工作中常发生的事故。"},{"en":"Careful planning preobviated the need for last-minute changes.","zh":"周密的计划使临时改动的需要提前变得不必要。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To have taken action beforehand so that an objection, question, or argument would not arise later.","zh":"（罕用）预先处理，使日后不会出现异议、疑问或争论。"},"examples":[{"en":"He clarified the rules early, preobviating complaints from the team.","zh":"他很早就把规则讲清楚，从而预先避免了团队的抱怨。"}]}],"synonyms":["prevented","avoided","headed off","forestalled","precluded","made unnecessary"],"phonetic":"/ˌpriːˈɑːbviˌeɪtɪd/","extraExplanation":["“preobviated”是动词“preobviate”的过去式/过去分词，日常英语中非常少见。更常用的表达是“prevent”“avoid”“head off”“make … unnecessary”。","词源上，“obviate”有“排除障碍、使不必要”的意思，加上前缀“pre-”（提前）就变成“提前排除/预先避免”。在正式或学术写作里偶尔可见。"]}
{"word":"preobviating","summary":{"en":"“Preobviating” means preventing something ahead of time or making it unnecessary in advance (formal).","zh":"“preobviating”意为事先预防、提前消除需要（较正式用语）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “preobviate”) preventing a problem in advance; making something unnecessary beforehand.","zh":"（“preobviate”的现在分词）事先预防问题；提前消除需要，使某事变得不必发生。"},"examples":[{"en":"Clear safety rules are preobviating many accidents in the lab.","zh":"明确的安全规定正在提前预防实验室里的许多事故。"},{"en":"By answering common questions on the website, the team is preobviating extra customer emails.","zh":"通过在网站上回答常见问题，团队正在提前减少（让不再需要）额外的客服邮件。"}]}],"synonyms":["preventing","avoiding","forestalling","heading off","averting","making unnecessary"],"phonetic":"/priːˈɑːbviˌeɪtɪŋ/","extraExplanation":["“preobviating”来自“pre-”（预先）+ “obviate”（排除、使不必要）。整体语气非常正式、偏学术/法律写作；日常英语更常用“preventing,” “avoiding,” “making unnecessary,” “heading off”。","用法小提示：常见结构是“preobviate + 问题/需要/风险”，意思是“提前把问题处理到不会出现/把某种需要提前消除”。"]}
{"word":"preobvious","summary":{"en":"“Preobvious” is a nonstandard, informal coinage meaning “obvious beforehand / already obvious.”","zh":"“preobvious”不是标准词，非正式用法里可理解为“事先就很明显 / 早就显而易见”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word; sometimes used informally as a made-up adjective meaning “obvious in advance” or “already obvious before something happens.”","zh":"不是标准英文单词；有时在非正式语境中被临时造出来，当作形容词，表示“事先就很明显 / 早就显而易见”。"},"examples":[{"en":"It was preobvious that the plan would fail, but no one wanted to say it out loud.","zh":"这计划会失败早就显而易见，但没人愿意说破。"},{"en":"The ending feels preobvious if you’ve seen a lot of movies like this.","zh":"如果你看过很多类似电影，这个结局会显得早就能猜到。"}]}],"synonyms":["already obvious","obvious from the start","predictable","a foregone conclusion"],"phonetic":"/priːˈɑbviəs/","extraExplanation":["“preobvious”更像是把前缀 pre-（“在……之前”）加到 obvious（“明显的”）上临时拼出来的词，因此在字典、正式写作中一般不推荐使用。","更自然的表达通常是：“already obvious”（已经很明显）、“obvious from the start”（从一开始就很明显）、“predictable”（可预料的/老套的）、“foregone conclusion”（早已注定的结论，偏正式）。","如果你本来想写的是口语里的“pretty obvious”（挺明显的），注意拼写应为 pretty obvious，而不是 preobvious。"]}
{"word":"preobviously","summary":{"en":"“Preobviously” is not standard English; it’s usually a joke meaning “beforehand, obviously,” or a misspelling of “previously.”","zh":"“preobviously”不是标准英语；多为网络玩笑，意为“当然是事先/在之前”，或是把“previously（以前）”拼错了。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard; humorous internet slang) Before something happens—used jokingly to mean “beforehand, obviously.”","zh":"（非标准；网络幽默用语）在某事发生之前——带玩笑语气，意思类似“事先啦，很明显/当然是在之前”。"},"examples":[{"en":"Preobviously, you should back up your files before updating your computer.","zh":"Preobviously，你在更新电脑前应该先备份文件。"},{"en":"He apologized preobviously—before anyone even complained.","zh":"他在任何人抱怨之前就先道歉了（preobviously）。"}]},{"partOfSpeech":"other","definition":{"en":"Often a mistaken spelling of “previously.”","zh":"常见为“previously”的拼写错误。"},"examples":[{"en":"I lived in Chicago previously. (Not: preobviously)","zh":"我以前住在芝加哥。（不要写成 preobviously）"}]}],"synonyms":["previously","earlier","beforehand","obviously"],"phonetic":"/priːˈɑbviəsli/","extraExplanation":["“preobviously”通常是把前缀 pre-（表示“在……之前”）和 obviously（表示“显然”）拼在一起的搞笑说法，用来制造一种“这还用说吗？当然是在之前”的效果。正式写作中不建议使用。","如果你想表达“以前/之前”，更标准的是 previously / earlier / beforehand；如果想表达“显然”，用 obviously / clearly。"]}
{"word":"preobviousness","summary":{"en":"Preobviousness means being (or seeming) obvious beforehand, and it can also refer to a patent-law claim that something was already obvious before filing.","zh":"Preobviousness 指“事前显而易见”的状态；在专利法中也可指在申请日前基于既有信息而“本来就显而易见”的主张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of seeming obvious in advance; the sense that something was “clearly going to happen” before it actually happened","zh":"（事前）显而易见的状态；在事情发生前就觉得“很明显会这样”的感觉"},"examples":[{"en":"In hindsight, the decision feels like preobviousness, but at the time it was risky.","zh":"事后看这个决定显得事前就很明显，但当时其实很冒险。"},{"en":"The story builds preobviousness by dropping small clues early on.","zh":"这个故事通过早早埋下小线索来营造“事前就能看出来”的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(law, especially patent law) the idea that an invention would have been obvious before the filing date, based on what was already known","zh":"（法律，尤指专利法）基于既有技术或公开信息，在申请日前该发明“本来就显而易见”的主张/性质"},"examples":[{"en":"The examiner questioned the patent application on grounds of preobviousness.","zh":"审查员以“申请日前已属显而易见”为由对该专利申请提出质疑。"},{"en":"They gathered prior art to argue preobviousness in court.","zh":"他们收集现有技术证据以在法庭上主张“事前显而易见”。"}]}],"synonyms":["predictability","foreseeability","(patent) obviousness"],"phonetic":"/ˌpriːˈɑbviəsnəs/","extraExplanation":["“preobviousness”不是高频日常词，更常见的相关词是“obviousness”（显而易见性），尤其在专利语境中非常常用。日常表达里如果想说“事前就很明显”，更自然的说法常用：“It was obvious from the start.” / “It was predictable.”","构词上是 pre-（在……之前）+ obvious（明显的）+ -ness（名词后缀）。在写作中使用时，通常带有“事后诸葛亮/后见之明”的对比意味。"]}
{"word":"preoccasioned","summary":{"en":"Preoccasioned means “caused or set in motion beforehand” (a rare, formal word).","zh":"preoccasioned 指“事先引起/预先促成”（较罕见、偏正式的用词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, usually as a past participle/adjective) caused or brought about beforehand; having had its occasion or cause set in advance.","zh":"（罕见，多作过去分词/形容词）事先引起的；预先促成的；其起因或“契机”已提前形成的。"},"examples":[{"en":"A preoccasioned misunderstanding can be hard to correct later.","zh":"一个事先就被引发的误会，后来往往很难纠正。"},{"en":"His early comments preoccasioned the conflict that followed.","zh":"他早先的言论预先引发了随后发生的冲突。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of preoccasion) to give rise to something in advance; to provide a prior occasion or cause for.","zh":"（preoccasion 的过去式/过去分词）预先引起；提前造成；为某事提供先行的“契机/原因”。"},"examples":[{"en":"The delay preoccasioned further complaints from customers.","zh":"这次延误提前引发了顾客更多的投诉。"},{"en":"A small error preoccasioned a larger problem in the report.","zh":"一个小错误预先造成了报告里更大的问题。"}]}],"synonyms":["caused beforehand","triggered earlier","precipitated","set the stage for","led to"],"phonetic":"/ˌpriːəˈkeɪʒənd/","extraExplanation":["“preoccasioned / preoccasion”在现代英语中非常少见，更多见于较旧的书面语或较正式的论述性文字。日常表达里通常用 caused beforehand, triggered earlier, set the stage for 等更常见的说法。","词形上：pre- 表示“在……之前”，occasion 在这里更接近“引发某事的契机/原因”。因此整体含义是“在之前就成为诱因、提前造成后果”。"]}
{"word":"preoccipital","summary":{"en":"Preoccipital means “in front of the occipital (back-of-the-skull) area.”","zh":"preoccipital 指“位于枕部（后脑/枕骨）之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Located in front of the occipital bone (the back part of the skull) or the occipital region.","zh":"（解剖）位于枕骨（头骨后部）或枕部区域之前的；枕前的。"},"examples":[{"en":"The doctor noted tenderness in the preoccipital area after the fall.","zh":"医生在跌倒后发现患者枕前区域有压痛。"},{"en":"Preoccipital swelling can be hard to see because it blends into the back of the head.","zh":"枕前肿胀有时不容易看出来，因为它与后脑部位连在一起。"}]}],"synonyms":["anterior to the occiput","front-of-occipital (informal)"],"phonetic":"/ˌpriˌɑkˈsɪpɪtəl/","extraExplanation":["“pre-”表示“在……之前”，“occipital”指“枕部/枕骨（后脑勺附近）”。因此 preoccipital 多用于医学或解剖学语境，描述“枕部之前”的位置（例如头皮、颅骨或相关区域）。在日常英语中很少见。"]}
{"word":"preocclusion","summary":{"en":"Preocclusion is an uncommon dental term meaning a premature tooth contact that makes the bite meet too early in one spot.","zh":"Preocclusion 是较少见的牙科术语，指咬合时某处牙齿过早接触（早接触），导致咬合提前在一点“先顶上”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry/orthodontics) A premature contact between teeth when the jaws close, causing the bite to meet too early at one point before full, balanced contact is reached.","zh":"（牙科/正畸）指下颌闭合时牙齿在某一点过早接触，导致咬合在达到完整、均衡接触前就“先碰到”某处。"},"examples":[{"en":"The dentist noticed a preocclusion on the right molar that made her jaw shift slightly.","zh":"牙医发现她右侧磨牙有早接触（preocclusion），导致下颌轻微偏移。"},{"en":"After the filling, a small preocclusion caused discomfort when he chewed.","zh":"补牙后出现轻微早接触，导致他咀嚼时不舒服。"},{"en":"Correcting the preocclusion helped reduce muscle tension and headaches.","zh":"纠正早接触后，他的咀嚼肌紧张和头痛有所缓解。"}]}],"synonyms":["premature contact","occlusal interference","high spot"],"phonetic":"/ˌpriəˈkluʒən/","extraExplanation":["这个词在日常英语里很少见，主要出现在牙科或正畸记录中。更常见的表达是：premature contact（早接触）、high spot（补牙后“高点”）、occlusal interference（咬合干扰）。","如果你是在病例或论文里看到它，通常指“某颗牙/某个区域先碰到”，可能引起下颌偏移、咀嚼不适、牙周负担增加等问题；临床上常通过调整咬合（occlusal adjustment）或重新修整修复体来处理。"]}
{"word":"preoccultation","summary":{"en":"Preoccultation is the time just before an occultation event in astronomy.","zh":"preoccultation 指天文学中掩星发生之前的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) The period or conditions just before an occultation, when one celestial body is about to pass in front of another and block it from view.","zh":"（天文学）掩星发生之前的阶段或状态；指一个天体即将遮挡另一个天体、使其暂时不可见之前的时段或情形。"},"examples":[{"en":"During preoccultation, astronomers prepare their instruments and timing systems for the moment the star disappears.","zh":"在掩星前阶段，天文学家会准备仪器与计时系统，以捕捉恒星消失的瞬间。"},{"en":"Preoccultation images help researchers predict exactly when the occultation will begin.","zh":"掩星前的影像有助于研究人员更准确地预测掩星开始的时间。"}]}],"synonyms":["pre-occultation phase","before the occultation"],"phonetic":"/ˌpriˌɑk.jəˈleɪ.ʃən/","extraExplanation":["这个词很少在日常英语中出现，多见于天文学观测报告、论文或观测计划中。更常见的表达是 “before the occultation” 或 “the pre-occultation phase”（带连字符）。","词源上由前缀 pre-（“在……之前”）+ occultation（“掩星/掩蔽”）构成。occultation 在天文学中指一个天体从观察者视角遮住另一个天体，例如月球掩星。"]}
{"word":"preoccupancy","summary":{"en":"Preoccupancy means being mentally absorbed in something (common) or, less commonly, prior/ongoing occupancy of a place.","zh":"preoccupancy 常指“全神贯注/被某事占据心思”，较少见时指“某处先前已被占用/已入住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being so busy thinking about something that you pay less attention to other things; mental absorption.","zh":"全神贯注；（因某事）心事重重而分心的状态。"},"examples":[{"en":"Her preoccupancy with work made her forget the appointment.","zh":"她一心扑在工作上，结果忘了预约。"},{"en":"I noticed his preoccupancy during the meeting—he kept checking his phone.","zh":"我注意到他开会时心不在焉——他一直看手机。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The fact that a place is already occupied before a given time (often in housing or planning contexts).","zh":"（较少见）在某一时间之前某处已被占用/入住的情况（常见于住房或规划语境）。"},"examples":[{"en":"Renovation was delayed because of preoccupancy in several units.","zh":"由于几个单元已有人入住，翻修被推迟了。"},{"en":"The report lists preoccupancy as a major obstacle to relocation.","zh":"报告将既有入住情况列为搬迁的主要障碍。"}]}],"synonyms":["preoccupation","absorption","engrossment","occupation"],"phonetic":"/priˈɑkjəpənsi/","extraExplanation":["这个词由 pre-（“在……之前”）+ occupancy/occupy（“占用；占据”）构成。日常英语里更常用的是 preoccupation（“挂念；专注”）来表达“心不在焉/被某事占据心思”。在住房、物业管理语境中，preoccupancy 才更可能指“先前已被占用/已入住”的事实。"]}
{"word":"preoccupant","summary":{"en":"A preoccupant is the person who was in a position or place before you.","zh":"preoccupant 指在你之前占据某个职位或某个地方的人（前任/原住户）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who occupied a job, position, or place before someone else; a predecessor or previous tenant/occupier.","zh":"先前的占用者；前任；原来的住户/使用者。"},"examples":[{"en":"I asked my preoccupant for advice about running the department.","zh":"我向我的前任请教如何管理这个部门。"},{"en":"The new tenant couldn’t reach the preoccupant to forward the old mail.","zh":"新租客联系不上之前的住户来转寄旧邮件。"}]}],"synonyms":["predecessor","former occupant","previous tenant","previous owner"],"phonetic":"priˈɑkjəpənt","extraExplanation":["“preoccupant”由前缀 pre-（在……之前）+ occupant（占用者）构成，语气偏正式，常见于法律、房产、合同或职场交接等语境。日常口语里更常用 predecessor（前任/前辈）、previous tenant（前房客）、former occupant（前任占用者）。"]}
{"word":"preoccupate","summary":{"en":"“Preoccupy” means to take over someone’s thoughts or attention so they can’t focus on other things.","zh":"“Preoccupy”指占据某人的思绪或注意力，使其难以关注其他事情。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill someone’s mind so much that they cannot think about other things; to absorb someone’s attention","zh":"使（某人）满脑子想着某事；占据（某人）的注意力，以至于难以想到别的事"},"examples":[{"en":"Work problems have been preoccupying her all week.","zh":"工作上的问题一整周都在占据她的心思。"},{"en":"He was so preoccupied with his phone that he missed his stop.","zh":"他太专注于手机了，结果坐过站了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to occupy (a time, place, or position) in advance; to take up beforehand (less common)","zh":"预先占用（时间、地点或位置）；事先占据（较不常用）"},"examples":[{"en":"The conference had preoccupied all the meeting rooms for the week.","zh":"这场会议把所有会议室一整周都提前占用了。"}]}],"synonyms":["absorb","distract","engross","consume","take up"],"phonetic":"/priˈɑkjəˌpaɪ/","extraExplanation":["“preoccupate”通常被视为拼写错误；标准动词是 **preoccupy**。形容词常用 **preoccupied**（心不在焉的、被某事困扰的），名词是 **preoccupation**（挂念、心事）。","词源上，**pre-** 表示“提前”，**occupy** 表示“占据”，合起来有“先占住（心思/位置）”的感觉。日常更常用的是“占据心思/注意力”的意思。"]}
{"word":"preoccupation","summary":{"en":"Preoccupation means an absorbing concern—something you keep thinking about that takes up your attention.","zh":"preoccupation 指“过度关注/心事”，即某件事一直占据你的注意力，让你分心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of thinking about something so much that it takes most of your attention; an absorbing concern or worry.","zh":"过度关注；心事；让人分心的担忧（一直占据注意力的想法）"},"examples":[{"en":"Her main preoccupation is finding a stable job.","zh":"她最挂心的事是找到一份稳定的工作。"},{"en":"I couldn’t focus on the meeting because of my preoccupation with the exam.","zh":"我因为一直想着考试，开会时无法专心。"},{"en":"Money can become a preoccupation for people under stress.","zh":"在压力下，金钱可能会变成很多人挥之不去的心事。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of occupying someone’s attention beforehand; being mentally taken up with something.","zh":"（注意力）被事先占据；先入为主的心念（使人无暇顾及其他）"},"examples":[{"en":"His preoccupation with details slowed the project down.","zh":"他对细节的过度在意拖慢了项目进度。"},{"en":"Preoccupation can make you miss what’s happening right now.","zh":"过度挂念会让你错过正在发生的事。"}]}],"synonyms":["concern","worry","fixation","obsession","absorption"],"phonetic":"/priˌɑkjəˈpeɪʃən/","extraExplanation":["词源上，pre- 表示“在前”，occupation 表示“占用/占据”。因此 preoccupation 的核心意象是“注意力被某个念头占住”。","语气区别：preoccupation 常带有“分心、难以摆脱”的感觉；而 interest（兴趣）更中性，obsession（痴迷）更强烈甚至不健康。","常见搭配：preoccupation with + 名词（对……的挂念/专注）；a preoccupation for sb（对某人来说是一大关注点）。"]}
{"word":"preoccupations","summary":{"en":"“Preoccupations” means the worries or interests that take up your mind, or the state of being deeply absorbed in something.","zh":"“preoccupations”指占据你心思的担忧或兴趣，也可指对某事全神贯注、心里被占满的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things you think about a lot, especially worries or interests that take up much of your attention.","zh":"你经常挂在心上的事；心事或关注点（常指占据大量注意力的担忧或兴趣）。"},"examples":[{"en":"Her main preoccupations are her family and her work.","zh":"她最牵挂的是家庭和工作。"},{"en":"Money became one of his daily preoccupations.","zh":"金钱成了他每天的心事之一。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of being so absorbed in something that you pay less attention to other things.","zh":"全神贯注的状态；被某事占据心思，以至于忽略其他事情。"},"examples":[{"en":"In his preoccupation with the deadline, he forgot to eat lunch.","zh":"他一心想着截止日期，连午饭都忘了吃。"},{"en":"Her preoccupations made her seem distant in conversation.","zh":"她心事重重，聊天时显得有些疏离。"}]}],"synonyms":["concerns","worries","obsessions","fixations","interests","anxieties"],"phonetic":"/priˌɑːkjəˈpeɪʃənz/","extraExplanation":["“preoccupations”是复数形式，单数是“preoccupation”。常见搭配：one of my preoccupations（我挂念/关注的事之一）、daily/constant preoccupations（每天/持续的心事）、preoccupation with…（对……的沉迷/专注）。","语气上它常带一点“心里被占满”的感觉：可以是正面的兴趣（hobby, art），也常用于负面的担忧（money, health, safety）。"]}
{"word":"preoccupative","summary":{"en":"Preoccupative means “causing or showing preoccupation”—something so absorbing or worrying that it takes up your attention.","zh":"preoccupative 意为“令人牵挂/令人分心的；表现出心事重重的”，指某事过于吸引或令人担忧，以至于占据注意力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal, uncommon) So absorbing or worrying that it takes up much of your attention; causing preoccupation.","zh":"（正式用语，较少见）令人牵挂/分心的；使人过度关注、难以专注于其他事的。"},"examples":[{"en":"She found the legal dispute preoccupative, making it hard to focus on work.","zh":"她觉得那场法律纠纷很让人牵挂，导致她很难专心工作。"},{"en":"For many families, rent is a preoccupative concern.","zh":"对许多家庭来说，房租是一个令人焦虑、挥之不去的担忧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(formal, uncommon) Relating to a state of being preoccupied; marked by strong mental focus on something.","zh":"（正式用语，较少见）与“心事重重/全神贯注于某事”的状态有关的；带有被某事占据心神特征的。"},"examples":[{"en":"His preoccupative mood kept him quiet during dinner.","zh":"他心事重重，晚餐时一直很沉默。"},{"en":"The novel portrays the character’s preoccupative thoughts about identity and belonging.","zh":"这部小说描写了人物对身份与归属感的萦绕心头的思绪。"}]}],"synonyms":["preoccupying","absorbing","engrossing","all-consuming","distracting","worrying"],"phonetic":"priˈɑkjəˌpeɪtɪv","extraExplanation":["“preoccupative”在现代英语里比较少见，更多时候人们会用更自然的形容词：preoccupying（令人牵挂的/令人分心的）、absorbing（引人入胜的）、distracting（分散注意力的）、all-consuming（占据全部心神的）。","词源上来自 preoccupy（先占据、使先入为主→使人心神被占据）。在学术或较正式的写作中偶尔会出现，但日常表达里用“preoccupying”更常见、更地道。"]}
{"word":"preoccupied","summary":{"en":"Preoccupied means your mind is so busy with thoughts or worries that you’re not paying full attention to what’s happening now.","zh":"preoccupied 指心里被某事（多为想法、担忧或事务）占据，以至于对眼前事情不够专注、显得心不在焉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thinking a lot about something so that it takes your attention away from what is happening now.","zh":"全神贯注于某事；心事重重，以至于分散了对当前事情的注意力。"},"examples":[{"en":"She looked preoccupied and didn’t hear me call her name.","zh":"她看起来心事重重，没听到我叫她的名字。"},{"en":"I was too preoccupied with work to reply right away.","zh":"我太专注（或挂心）工作了，没能立刻回复。"}]},{"partOfSpeech":"adj.","definition":{"en":"Already filled with something (such as thoughts, worries, or plans); mentally occupied.","zh":"（心里）已经被某些想法、担忧或计划占满；被占据。"},"examples":[{"en":"His mind was preoccupied with the upcoming exam.","zh":"他的心思全被即将到来的考试占据了。"},{"en":"She was preoccupied by worries about her family.","zh":"她被对家人的担忧所困扰（占据心神）。"}]}],"synonyms":["distracted","absorbed","wrapped up","lost in thought","occupied","worried"],"phonetic":"/priˈɑkjəˌpaɪd/","extraExplanation":["词源上是 pre-（预先）+ occupy（占据）。所以它带有“先被占了”的感觉：注意力在当下之前就被别的事占满了。","常见搭配：be preoccupied with sth（专注/挂心某事）；be preoccupied by sth（被某事困扰/占据）。语气上多用于“心不在焉、被烦恼或事务缠住”，不太用于“积极投入的专注”（那更常用 focused/absorbed）。"]}
{"word":"preoccupiedly","summary":{"en":"“Preoccupiedly” means doing something while distracted by your thoughts or worries.","zh":"“preoccupiedly”表示做某事时因思绪或担忧被占据而分心、心不在焉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you are so busy thinking about something else that you are not paying full attention to what is happening now.","zh":"心事重重地；心不在焉地（因为一直在想别的事而没能专注于当下）。"},"examples":[{"en":"She nodded preoccupiedly and kept staring at her phone.","zh":"她心不在焉地点了点头，眼睛一直盯着手机。"},{"en":"He smiled preoccupiedly, clearly thinking about the upcoming interview.","zh":"他心事重重地笑了笑，显然在想着即将到来的面试。"}]}],"synonyms":["distractedly","absentmindedly","in a distracted way","with one’s mind elsewhere"],"phonetic":"/priˈɑkjəˌpaɪdli/","extraExplanation":["“preoccupiedly”来自形容词“preoccupied”（心事重重的、被某事占据心神的）+ 副词后缀“-ly”。日常更常用“preoccupied”或“absentmindedly / distractedly”来表达类似意思；“preoccupiedly”在书面语里更常见。"]}
{"word":"preoccupiedness","summary":{"en":"Preoccupiedness means the state of being mentally absorbed and not fully attentive to your surroundings.","zh":"preoccupiedness 指“心不在焉/被心事占据的状态”，注意力不完全在周围或当下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being so absorbed in your own thoughts, worries, or interests that you are not paying full attention to what is happening around you.","zh":"心不在焉；（因思虑或担忧而）专注于自己的想法，以至于对周围不够留意的状态。"},"examples":[{"en":"Her preoccupiedness made her miss the last stop on the train.","zh":"她心不在焉，结果坐过了最后一站。"},{"en":"I noticed his preoccupiedness during the meeting—he barely responded to questions.","zh":"我注意到他开会时心不在焉——几乎不回答问题。"},{"en":"Preoccupiedness is common before big exams, but try to rest and eat well.","zh":"大考前心神不定很常见，但还是尽量休息好、吃好。"}]}],"synonyms":["absent-mindedness","distractedness","preoccupation","inattentiveness"],"phonetic":"/priˈɑkjəˌpaɪidnəs/","extraExplanation":["“preoccupiedness”是由形容词“preoccupied”（心事重重的、被占据心思的）加名词后缀“-ness”构成，表示一种“状态”。日常更常见的表达是“preoccupation”（分心/挂念）或直接说“being preoccupied”。","语气上它常暗示“注意力被内心事务占用”，不一定是坏事：可以是担忧（worries），也可以是沉浸在计划、灵感或兴趣里。若想表达“因为压力而走神”，也可用“distractedness”。"]}
{"word":"preoccupier","summary":{"en":"A rare noun meaning someone or something that takes up your attention (or, less commonly, takes up a place first).","zh":"一个较少见的名词，指占据你注意力的人/事物（较少见也可指先占据某处的位置或事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that preoccupies someone (takes their attention so they can’t think about other things).","zh":"使人心事重重的人或事物；让人分心、占据心思的人或事。"},"examples":[{"en":"Work has become my main preoccupier lately, so I haven’t had much time to relax.","zh":"最近工作成了我主要的“占心事”，所以我没怎么有时间放松。"},{"en":"For many students, exam results are a constant preoccupier in the final semester.","zh":"对很多学生来说，考试成绩在最后一个学期一直是挥之不去的心头事。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that occupies a place or position in advance; something that comes first and takes up space.","zh":"先占据某处（位置、空间）的事物；先行占位者。"},"examples":[{"en":"A temporary fence acted as a preoccupier of the lot until construction began.","zh":"一圈临时围栏在施工开始前先占用了那块地。"}]}],"synonyms":["distraction","obsession","concern","preoccupation (more common)","occupant (place-related)"],"phonetic":"/priˈɑkjəˌpaɪɚ/","extraExplanation":["“preoccupier”在现代英语里很少见，更多时候人们会说：something that preoccupies me / a major preoccupation（让我牵挂的事/主要的牵挂）。","和“preoccupied（心事重重的）”同源：pre-（在前）+ occupy（占据）。常见用法是动词/形容词（preoccupy, preoccupied），名词更常见的是“preoccupation”。"]}
{"word":"preoccupies","summary":{"en":"“Preoccupies” means “absorbs the mind/attention” (most common) or “takes up in advance.”","zh":"“preoccupies”多指“占据心思/使人心不在焉”，也可指“提前占用（时间/场地等）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fill someone’s mind so much that they can’t easily think about other things; to absorb (someone’s attention)","zh":"使某人满脑子都是某事，以至于难以想到别的；占据（注意力）"},"examples":[{"en":"She was so preoccupied with work that she forgot to eat lunch.","zh":"她一心忙工作，连午饭都忘了吃。"},{"en":"I’m preoccupied by the upcoming exam.","zh":"我一直被即将到来的考试困扰/占据心思。"},{"en":"His face looked preoccupied, as if he were solving a problem in his head.","zh":"他看起来心事重重，仿佛在脑子里解一道难题。"}]},{"partOfSpeech":"v.","definition":{"en":"to occupy (a place, position, or time) in advance","zh":"预先占用（某处/某个位置/某段时间）"},"examples":[{"en":"The conference room is preoccupied on Friday afternoon.","zh":"会议室周五下午已被提前占用/预订。"},{"en":"Early bookings can preoccupy all the best seats.","zh":"早订票可能会把最好的座位都提前占走。"}]}],"synonyms":["absorbs","distracts","engrosses","consumes","takes up","occupies"],"phonetic":"/priˈɑkjəˌpaɪz/","extraExplanation":["“pre-”表示“在……之前”，“occupy”表示“占据”。合在一起，既可指“心里被占据（心事重重）”，也可指“事先占用（场地/时间）”。","常见搭配：be preoccupied with (something)（一心想着……）；be preoccupied by (something)（被……占据心思/困扰）。日常更常用 with。","相关词：preoccupation（n. 心事；关注点），preoccupied（adj. 心不在焉的；心事重重的）。"]}
{"word":"preoccupy","summary":{"en":"“Preoccupy” means to take up someone’s mind or attention so they can’t focus on other things; it can also mean to use up someone’s time in advance.","zh":"“preoccupy”指占据某人的心思/注意力，使难以顾及其他事；也可指预先占用某人的时间。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fill your mind so much that you can’t think about other things; to absorb your attention","zh":"（某事）占据你的心思，使你难以想别的；使你全神贯注"},"examples":[{"en":"She was so preoccupied with work that she forgot to eat lunch.","zh":"她太专注于工作，连午饭都忘了吃。"},{"en":"Don’t be preoccupied with what others think—focus on your own progress.","zh":"别总被别人怎么想所困扰，专注于自己的进步。"},{"en":"He looked preoccupied, as if he had something important on his mind.","zh":"他看起来心事重重，像是有重要的事挂在心上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take control of someone’s attention or time in advance","zh":"预先占用（某人的注意力或时间）；使提前被某事牵制"},"examples":[{"en":"I’m preoccupied this evening, but I’m free tomorrow.","zh":"我今晚已经有事要忙，但明天有空。"},{"en":"The meeting preoccupied most of her afternoon.","zh":"那场会议占用了她下午的大部分时间。"}]}],"synonyms":["absorb","distract","consume","engross","occupy","preoccupy (oneself) with"],"phonetic":"/priˈɑkjəˌpaɪ/","extraExplanation":["“pre-”表示“在……之前”，“occupy”表示“占据”。合在一起就有“先把注意力/时间占满”的感觉，所以既可表示“心里被某事占据”，也可表示“时间被安排得满满的”。","常见搭配：be preoccupied with…（心里/注意力被……占据）；look/seem preoccupied（看起来心事重重）。","语气上它通常偏中性，有时暗示“因为想太多而分心”，比 worried（担心）更强调“注意力被占着”，不一定表示害怕或焦虑。"]}
{"word":"preoccupying","summary":{"en":"“Preoccupying” describes something that strongly holds your attention or thoughts, often in a worrying or absorbing way.","zh":"“preoccupying”形容某事强烈占据你的注意力或思绪，常带有令人担忧或十分吸引的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"taking up someone’s attention or thoughts; hard to stop thinking about (often because it worries or interests you).","zh":"占据某人的注意力或思绪；让人难以不去想（常因担忧或强烈兴趣）。"},"examples":[{"en":"The preoccupying question was whether the family would be safe.","zh":"那个令人挥之不去的问题是：家人是否会安全。"},{"en":"She found the novel preoccupying and finished it in one night.","zh":"她觉得这本小说很引人入胜，一夜就读完了。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “preoccupy”: to fill someone’s mind so they cannot think about other things.","zh":"“preoccupy”的现在分词：使某人满脑子都是某事，以至于难以顾及其他事情。"},"examples":[{"en":"He sat quietly, preoccupying himself with plans for the interview.","zh":"他安静地坐着，满脑子都在想面试的计划。"},{"en":"Preoccupying herself with work helped her during a difficult week.","zh":"在艰难的一周里，让自己忙于工作对她有所帮助。"}]}],"synonyms":["absorbing","engrossing","consuming","distracting","troubling"],"phonetic":"/priˈɑkjəˌpaɪɪŋ/","extraExplanation":["“preoccupying”常带有“占据心神、分散注意力”的感觉；语气通常比“interesting（有趣）”更强，也常暗示“担心/烦恼”。","常见搭配：a preoccupying thought/question（挥之不去的想法/问题）；be preoccupied with…（一心想着……）。注意：be preoccupied with… 多指心理状态；busy with… 更偏“事情多、忙碌”。"]}
{"word":"preoccur","summary":{"en":"“Preoccur” means to happen earlier than something else (a less common, more academic word).","zh":"“preoccur”表示“先于某事发生”，较少见，多用于学术或医学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to happen or occur before something else; to take place earlier in time","zh":"在某事之前发生；先于……发生"},"examples":[{"en":"Flu-like symptoms may preoccur the rash by a day or two.","zh":"类似流感的症状可能会在皮疹出现前一两天先发生。"},{"en":"In some patients, anxiety can preoccur a panic attack.","zh":"在一些患者身上，焦虑可能会先于惊恐发作出现。"}]}],"synonyms":["precede","happen before","occur before","come before","antedate"],"phonetic":"/ˌpriəˈkɝ/","extraExplanation":["“preoccur”比较少见，多用于医学、心理学、研究写作里，描述某种症状、事件或条件“先于”另一件事出现。日常英语里更常用“occur before…/happen before…”或用动词“precede”（如：Symptoms may precede the rash）。","构词上是前缀“pre-”（在……之前）+ “occur”（发生），含义直观，但因为不够常用，写作时可优先选更常见的表达以提高可读性。"]}
{"word":"preoccurred","summary":{"en":"“Preoccurred” means “happened earlier (before something else),” but it’s rare in modern English.","zh":"“preoccurred”意为“先前发生”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Happened earlier than something else; occurred beforehand.","zh":"（罕用）比另一件事更早发生；先前发生。"},"examples":[{"en":"A scheduling conflict had preoccurred, so the meeting was moved to Friday.","zh":"之前先发生了行程冲突，所以会议改到周五。"},{"en":"The symptoms that preoccurred can help the doctor identify the cause.","zh":"先前出现的症状可以帮助医生判断原因。"}]}],"synonyms":["occurred earlier","previously occurred","happened beforehand","preceded"],"phonetic":"/ˌpriəˈkɝd/","extraExplanation":["“preoccurred”是动词“preoccur”的过去式/过去分词，但在现代英语里非常少见。日常写作更常用：“occurred earlier/previously/beforehand”。","构词：pre-（在……之前）+ occur（发生）。因此它的意思基本等于“previously occurred”。"]}
{"word":"preoccurrence","summary":{"en":"Preoccurrence means a prior or earlier occurrence of something, often used in technical writing.","zh":"preoccurrence 指“先前发生/先前出现”，多见于医学、统计等技术性语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an earlier occurrence of something; an instance that happened before a later event or condition","zh":"先前发生；先前出现的情况（指在某一事件或状况之前已经发生过的实例）"},"examples":[{"en":"The doctor asked about any preoccurrence of the same symptoms.","zh":"医生询问以前是否出现过同样的症状。"},{"en":"In the report, preoccurrence of errors was linked to unclear instructions.","zh":"报告指出，错误的先前发生与说明不清有关。"}]}],"synonyms":["prior occurrence","previous occurrence","earlier instance","preceding event"],"phonetic":"/ˌpriəˈkɝəns/","extraExplanation":["这个词在日常英语里不常见，更常见的表达是：a previous occurrence / prior occurrence（先前发生）。在医学、统计、工程报告里偶尔会看到 preoccurrence，用来强调“在此之前就发生过”。","构词上是 pre-（在……之前）+ occurrence（发生；出现）。如果你写作想更自然，通常用 previous/prior + occurrence 或 simply “had occurred before”。"]}
{"word":"preoccurring","summary":{"en":"Preoccurring means happening or existing before something else.","zh":"preoccurring 表示“先前发生的/先前存在的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or existing before something else; occurring earlier (often used in technical or formal writing).","zh":"先前发生的；在某事之前已经存在或出现的（多用于技术或正式语境）。"},"examples":[{"en":"The researchers controlled for preoccurring health conditions.","zh":"研究人员控制了先前存在的健康状况。"},{"en":"Any preoccurring problems in the system can affect the final results.","zh":"系统中任何先前出现的问题都可能影响最终结果。"}]}],"synonyms":["previous","prior","earlier","pre-existing","already present"],"phonetic":"/ˌpriːəˈkɝːrɪŋ/","extraExplanation":["“preoccurring”由前缀 pre-（在……之前）+ occurring（发生的）构成，但在日常英语里不算常见。很多场合更自然的说法是：previously occurring / prior existing / pre-existing。","常见搭配：preoccurring condition(s)（先前存在的状况/病症）、preoccurring event(s)（先前发生的事件）。在写作中注意它通常作定语放在名词前。"]}
{"word":"preoceanic","summary":{"en":"Preoceanic means ‘before oceans formed’ or ‘before something became oceanic,’ mainly used in scientific contexts.","zh":"preoceanic 表示“海洋形成之前/成为海洋环境之前的”，主要用于科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology/planet science) Existing or happening before oceans formed, or before an area became oceanic.","zh":"（地质学/行星科学）指在海洋形成之前存在或发生的；或指某一区域在成为海洋环境/洋壳之前的。"},"examples":[{"en":"Some researchers discuss a preoceanic Earth, when large stable oceans may not yet have existed.","zh":"一些研究者会讨论“前海洋时期”的地球，即可能尚未出现大型稳定海洋的时候。"},{"en":"The paper compares preoceanic rocks with later oceanic crust.","zh":"这篇论文把前海洋阶段的岩石与后来形成的洋壳进行对比。"}]}],"synonyms":["pre-oceanic","pre-marine","primordial (context-dependent)","early (Earth) (context-dependent)"],"phonetic":"/ˌpriːoʊʃiˈænɪk/","extraExplanation":["该词非常少见，多出现在学术写作中，常与 early Earth（早期地球）、primordial（原始的）、ocean formation（海洋形成）、oceanic crust（洋壳）等主题一起出现。","构词上通常可理解为 pre-（在……之前）+ oceanic（海洋的/洋壳的）。在具体语境里，它可能指“海洋尚未出现的时期”，也可能指“某一地质单元在变成海洋环境之前的阶段”，需结合论文/报告的定义来读。"]}
{"word":"preocular","summary":{"en":"Preocular means “in front of the eye,” mainly used in zoology and anatomy.","zh":"preocular 指“在眼睛前方的”，主要用于动物学与解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Situated in front of the eye; relating to the area just before the eye (especially in animals’ anatomy).","zh":"位于眼睛前方的；与眼前区域有关的（尤用于动物解剖学）。"},"examples":[{"en":"In some reptiles, the preocular scale lies just in front of the eye.","zh":"在一些爬行动物中，preocular（眼前鳞片）位于眼睛正前方。"},{"en":"The field guide notes a dark mark on the preocular region.","zh":"野外图鉴提到眼前区域有一个深色斑点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In entomology or zoology) Describing a structure or segment located before the eye, used in technical descriptions of species.","zh":"（昆虫学/动物学）描述位于眼之前的结构或节段，用于物种的专业形态描述。"},"examples":[{"en":"The species can be identified by the shape of its preocular ridge.","zh":"这种物种可通过其眼前脊的形状来辨认。"},{"en":"Researchers measured the preocular distance as part of the head morphology study.","zh":"研究人员测量了眼前距离，作为头部形态研究的一部分。"}]}],"synonyms":["preorbital","anterior to the eye"],"phonetic":"/priˈɑkjələr/","extraExplanation":["这是一个偏学术的形态学术语，常见于爬行动物的“鳞片命名”（如 preocular scale 眼前鳞片）以及昆虫/节肢动物的头部结构描述。日常英语里很少用到。","词源上，pre- 表示“在……之前”，ocular 来自拉丁语 oculus（眼睛），合起来就是“眼前的/在眼之前的”。"]}
{"word":"preodorous","summary":{"en":"“Preodorous” is a very rare, nonstandard adjective that can be interpreted as “having an odor beforehand.”","zh":"“preodorous”是非常罕见且非标准的形容词，可理解为“提前有气味/先闻到的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / nonstandard) Having an odor in advance; smelling beforehand.","zh":"（非常罕见/非标准用法）提前有气味的；先闻到的。"},"examples":[{"en":"The word “preodorous” is extremely rare; most writers would simply say “odorous” or “already smelling.”","zh":"“preodorous”这个词极其罕见；大多数作者会直接用“odorous”或“already smelling（已经有味道）”。"},{"en":"If you mean the smell comes first, you could say: “A preodorous hint of smoke warned us before we saw the fire.”","zh":"如果你想表达“气味先出现”，可以说：“A preodorous hint of smoke warned us before we saw the fire（在看到火之前，一丝先出现的烟味就提醒了我们）。”"}]}],"synonyms":["odorous","smelly","fragrant (pleasant)","musty"],"phonetic":"/priˈoʊdərəs/","extraExplanation":["这个词不属于现代英语里的常用词，很多词典不会收录。它看起来像由前缀 pre-（“在……之前”）+ odorous（“有气味的”）拼出来的“造词/临时词（nonce word）”。","如果你是在文本里看到它：很可能是拼写错误或非常文艺/古怪的用法。更自然的表达通常是 odorous（有气味的）、smelly（难闻/有味道的）、already smelling（已经有味道）、a smell preceded…（气味先于……出现）。"]}
{"word":"preoesophageal","summary":{"en":"Medical term meaning “in front of the esophagus.”","zh":"医学术语，表示“位于食管前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Situated or occurring in front of the esophagus (the tube that carries food from the throat to the stomach).","zh":"位于食管（连接咽喉与胃的管道）前方的；发生在食管前方的。"},"examples":[{"en":"The CT scan showed a preoesophageal mass.","zh":"CT 扫描显示有一个位于食管前方的肿块。"},{"en":"The surgeon carefully avoided preoesophageal tissues during the procedure.","zh":"手术过程中，外科医生小心避开了食管前方的组织。"}]}],"synonyms":["preesophageal","anterior to the esophagus"],"phonetic":"/ˌpriːoʊˌiːsəˈfɑːdʒiəl/","extraExplanation":["这是医学/解剖学用语：pre- 表示“在……之前/前方”，oesophageal（英式拼写）= esophageal（美式拼写）表示“食管的”。因此 preoesophageal 与 preesophageal 含义相同，只是拼写偏英式。","这类词常用于影像学、手术记录、解剖描述，用来精确说明位置关系（在食管的前面）。"]}
{"word":"preoffend","summary":{"en":"“Preoffend” is a rare, informal verb meaning to offend someone in advance (often used humorously).","zh":"“preoffend”是一个罕见、非正式的动词，意思是“预先冒犯”（常带玩笑或自嘲语气）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, informal) To offend someone in advance; to do or say something that causes offense before any later event happens.","zh":"（罕见，非正式）预先冒犯；在某件事发生之前就做/说让人觉得被冒犯的话或行为。"},"examples":[{"en":"I’m not trying to preoffend anyone, but we may need to change the plan.","zh":"我不是想预先冒犯任何人，但我们可能需要改变计划。"},{"en":"He added a quick apology, as if to preoffend critics before they reacted.","zh":"他先快速道歉了一句，好像是为了在批评者反应之前先“预先冒犯”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) To commit an offense beforehand; to do something that could be seen as wrongdoing in advance.","zh":"（非常罕见）预先犯错/预先犯罪；提前做出可能被视为不当或违规的行为。"},"examples":[{"en":"The term is sometimes used jokingly: “Don’t preoffend—just ask politely.”","zh":"这个词有时被开玩笑地用：“别预先冒犯——礼貌地问就好。”}],"}]}],"synonyms":["offend in advance","risk offending","cause offense"],"phonetic":"/ˌpriəˈfɛnd/","extraExplanation":["“preoffend”不是常见标准词汇，更像是把前缀 pre-（“预先”）加到 offend（“冒犯”）上形成的临时造词/网络用语。正式写作中更自然的表达通常是：offend someone in advance, unintentionally offend, risk offending, cause offense。"]}
{"word":"preoffense","summary":{"en":"Preoffense refers to the period or behavior before an offense, and it can also describe things that happen before an offense.","zh":"preoffense 指犯罪/违规发生之前的阶段或行为，也可作形容词表示“作案前的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time, stage, or behavior before someone commits an offense (a crime or rule-breaking act)","zh":"（犯罪或违规）发生之前的阶段、时期或相关行为"},"examples":[{"en":"Investigators reviewed the suspect’s preoffense actions, such as searching for the victim online.","zh":"调查人员审查了嫌疑人在作案前的行为，比如在网上搜索受害者的信息。"},{"en":"The report focuses on preoffense warning signs and how communities can respond.","zh":"这份报告重点讨论作案前的预警信号以及社区如何应对。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done before an offense","zh":"发生在（犯罪或违规）之前的；作案前的"},"examples":[{"en":"Police collected preoffense data from security cameras near the store.","zh":"警方收集了商店附近监控摄像头的作案前数据。"},{"en":"The training emphasizes preoffense planning patterns.","zh":"培训强调作案前的计划模式。"}]}],"synonyms":["pre-offense","before the offense","pre-crime (context-dependent)","preincident (security context)"],"phonetic":"/ˌpriːəˈfɛns/","extraExplanation":["“preoffense”在日常英语里不算常见，更常见的写法是“pre-offense”（加连字符）或“pre-offense behavior / pre-offense planning”。在学术与执法语境（犯罪学、心理学、案件分析）中使用较多。","注意不要与“pretense（假装）”或“offense（冒犯/进攻）”混淆；这里的“offense”通常指“违法/犯罪”或“违规行为”。"]}
{"word":"preoffensive","summary":{"en":"Preoffensive means “before an offensive/attack; related to preparations leading up to it.”","zh":"preoffensive 指“进攻前的；与进攻前准备阶段相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before an attack or major push forward (especially in military, sports, or politics).","zh":"（尤指军事、体育或政治中）在进攻或大规模推进之前发生的；进攻前的。"},"examples":[{"en":"The army increased surveillance during the preoffensive phase.","zh":"军队在进攻前阶段加强了侦察监视。"},{"en":"In the preoffensive meetings, the coach focused on defense and teamwork.","zh":"在进攻前的会议上，教练强调防守与团队配合。"}]}],"synonyms":["pre-attack","pre-assault","preinvasion","preoperative (different context: before surgery)"],"phonetic":"/ˌpriː.əˈfɛn.sɪv/","extraExplanation":["“preoffensive”更常见的写法是带连字符的 **pre-offensive**，在新闻、军事报告、分析文章中较常见；日常口语里通常会改说 “before the offensive / leading up to the offensive（进攻前/在进攻前这段时间）”。","词缀提示：**pre-** 表示“在……之前”，**offensive** 表示“进攻/攻势”。合起来就是“进攻前的”。在一些语境里也可引申为“行动前的准备阶段”（如外交、媒体或舆论上的铺垫）。"]}
{"word":"preoffensively","summary":{"en":"Preoffensively means “before an offensive,” usually describing preparation or positioning ahead of an attack or major confrontation.","zh":"preoffensively 指“在进攻之前/进攻前地”，多用于描述发动进攻或重大对抗前的准备与部署。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens before an offensive action or attack (especially in military or strategic contexts).","zh":"（尤用于军事/战略语境）在进攻行动或攻击之前地；以进攻前的方式。"},"examples":[{"en":"The troops repositioned preoffensively to secure supply routes.","zh":"部队在进攻前重新部署，以确保补给线安全。"},{"en":"Preoffensively, the team focused on gathering intelligence and mapping risk areas.","zh":"在进攻行动前，团队专注于收集情报并标出高风险区域。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that prepares for a future confrontation, before taking openly aggressive action.","zh":"（更宽泛）以为未来冲突做准备、在公开采取强硬行动之前的方式。"},"examples":[{"en":"The company acted preoffensively by strengthening its legal protections.","zh":"公司在采取更强硬行动前，先加强了法律保护措施。"},{"en":"Preoffensively, she documented every incident in case the dispute escalated.","zh":"她在事态升级前先记录每一次事件，以备发生纠纷。"}]}],"synonyms":["before the offensive","in advance","preemptively (close, but not the same)","ahead of time"],"phonetic":"/ˌpriːəˈfɛn.sɪv.li/","extraExplanation":["这个词非常少见，更多见的是形容词 preoffensive（“进攻前的”）或短语 before the offensive（“进攻之前”）。在新闻、军事分析或历史写作中，为了强调“在发动进攻前的部署/准备阶段”，有时会临时造出 preoffensively 这种副词形式。","构词上：pre-（“在……之前”）+ offensive（“进攻的/冒犯性的”）+ -ly（副词后缀）。注意 offensive 既可指“军事进攻”，也可指“令人反感/冒犯的”；但 preoffensively 通常更偏“军事/策略上的进攻前”。"]}
{"word":"preoffensiveness","summary":{"en":"Preoffensiveness means perceived offensiveness in advance—something seems likely to offend before it actually does.","zh":"preoffensiveness 指“预先被感知到的冒犯性”——在事情真正发生前就显得可能冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of seeming offensive in advance, before anything is actually said or done; a perceived “potential to offend.”","zh":"（较少见）指在事情尚未发生前就显得冒犯/令人不快的特质；一种“尚未发生就被认为可能冒犯”的感觉或评价。"},"examples":[{"en":"Some readers complained about the preoffensiveness of the headline, even before reading the article.","zh":"有些读者在还没读文章前，就抱怨那个标题“预先就很冒犯”。"},{"en":"The comedian tried to reduce preoffensiveness by explaining the context first.","zh":"那位喜剧演员先解释背景，试图降低观众对内容的“预先冒犯感”。"}]}],"synonyms":["potential offensiveness","perceived offensiveness","risk of offending","offensive potential"],"phonetic":"/ˌpriːəˈfɛn(s)ɪvnəs/","extraExplanation":["这个词非常少见，通常不算标准词典词条；更常见的表达是：potential offensiveness（潜在冒犯性）、perceived offensiveness（被感知的冒犯性）、the risk of being offensive（冒犯的风险）。","构词上它由前缀 pre-（在……之前）+ offensiveness（冒犯性）组成，常用于讨论媒体标题、笑话、政治言论等在“还没被完整理解之前”就引发的反感或警惕。","使用时要注意语域：在正式写作里，用更常规的短语会更清楚；在评论/社交媒体语境中，用 preoffensiveness 可能带一点批评意味（暗示对方“还没听完就先觉得被冒犯”）。"]}
{"word":"preoffer","summary":{"en":"Preoffer (often written pre-offer) refers to the period or actions before a formal job offer is made.","zh":"preoffer（常写作pre-offer）指正式发录用通知之前的阶段或相关事项。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Hiring/HR) Happening before an official job offer is made; related to steps, communication, or documents that come before the formal offer.","zh":"（招聘/人力资源）在正式录用通知（offer）发出之前发生的；与发offer前的流程、沟通或材料有关。"},"examples":[{"en":"The recruiter scheduled a pre-offer call to confirm my salary expectations.","zh":"招聘方安排了一次发offer前的电话沟通，确认我的薪资期望。"},{"en":"Pre-offer paperwork may include background-check consent forms.","zh":"发offer前的材料可能包括背景调查同意书。"}]},{"partOfSpeech":"n.","definition":{"en":"(Hiring/HR) A stage or step before a formal job offer, especially discussions that may lead to an offer.","zh":"（招聘/人力资源）正式offer之前的阶段或步骤，尤其指可能促成offer的沟通与谈判。"},"examples":[{"en":"We are still in pre-offer, so nothing is final yet.","zh":"我们还处在发offer前阶段，所以一切都还没最终确定。"},{"en":"He asked if the company could share details during the pre-offer stage.","zh":"他问公司能否在发offer前阶段提供更多细节。"}]}],"synonyms":["pre-offer stage","before the offer","offer pending","preliminary offer discussions"],"phonetic":"/ˌpriːˈɔfər/","extraExplanation":["“preoffer / pre-offer”多见于招聘语境（邮件、ATS系统、HR口头沟通）。在更正式的英文里，人们也常说“before the offer,” “pre-offer stage,” 或“offer pending”。","注意区分：pre-offer（发正式录用通知之前）≠ pre-approval（预批准，如贷款）≠ proposal（提案/建议）。"]}
{"word":"preoffering","summary":{"en":"Preoffering means “before a formal securities offering,” either as an adjective (preoffering stage) or a noun (the preoffering period).","zh":"preoffering 指“正式证券发行之前的”，可作形容词（发行前阶段）或名词（发行前期）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance) Happening before a company’s formal securities offering (such as an IPO, bond issue, or secondary stock offering).","zh":"（金融）在公司正式发行证券（如 IPO、债券发行或增发）之前发生的。"},"examples":[{"en":"Preoffering research is often limited to avoid promoting the deal too early.","zh":"为避免过早宣传交易，发行前（preoffering）的研究报告通常会受到限制。"},{"en":"The company held preoffering meetings with potential investors.","zh":"公司在发行前与潜在投资者举行了沟通会议。"}]},{"partOfSpeech":"n.","definition":{"en":"The period, stage, or activities before a formal securities offering.","zh":"正式发行证券之前的阶段或相关活动（发行前阶段）。"},"examples":[{"en":"During the preoffering, the firm finalized its prospectus and pricing range.","zh":"在发行前阶段，公司完成了招股说明书并确定了价格区间。"},{"en":"Compliance checks are especially strict in the preoffering period.","zh":"发行前阶段的合规审查尤其严格。"}]}],"synonyms":["pre-offering","before the offering","pre-IPO (context-dependent)","prelaunch (general)"],"phonetic":"/ˌpriːˈɔfərɪŋ/","extraExplanation":["“preoffering”多见于投行、证券发行与合规语境，也常写作“pre-offering”。在美国市场，发行前沟通需要谨慎，常涉及对“gun-jumping（抢跑式宣传）”的监管风险：在注册与路演等正式流程完成前，公开宣传可能被限制。","相关常见搭配：preoffering period（发行前期）、preoffering meeting（发行前会议）、preoffering materials（发行前材料）、preoffering investors（发行前接触的投资者）。"]}
{"word":"preofficial","summary":{"en":"Preofficial describes something that happens or exists before it becomes official; it’s often written as “pre-official.”","zh":"preofficial（更常写作 pre-official）指“在成为正式之前的、预正式的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before something becomes officially established, approved, announced, or recognized.","zh":"在某事“正式”确立、批准、公布或被承认之前发生或存在的；非正式前期的。"},"examples":[{"en":"The team held a preofficial meeting to agree on the agenda before the first official session.","zh":"团队在第一次正式会议前先开了一次“预正式”会议，先把议程定下来。"},{"en":"These numbers are preofficial and may change after the final review.","zh":"这些数字是预正式的，最终审核后可能会变动。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an early stage before someone or something has an official title, role, or status.","zh":"与获得正式头衔、角色或身份之前的早期阶段有关的。"},"examples":[{"en":"In his preofficial role, she was already handling many of the duties.","zh":"在她尚未正式上任的阶段，就已经在处理很多工作了。"},{"en":"The committee’s preofficial spokesperson answered questions informally.","zh":"委员会的“预正式”发言人以非正式方式回答了问题。"}]}],"synonyms":["pre-official","preliminary","unofficial","tentative","interim"],"phonetic":"/ˌpriːəˈfɪʃəl/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。“preofficial”在英语里不算常用词，更常见的写法是带连字符的“pre-official”，读者也更容易理解。","如果你要表达“尚未正式/临时/非正式”，也常用：unofficial（非官方的）、tentative（暂定的）、preliminary（初步的）、interim（过渡/临时的）。"]}
{"word":"preofficially","summary":{"en":"Preofficially means “before something is official.”","zh":"preofficially 意为“在正式之前（非正式地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"before something becomes official; in an unofficial or preliminary way","zh":"在某事变成正式之前；以非正式或预备的方式"},"examples":[{"en":"The two teams met preofficially at a friendly game before the tournament began.","zh":"锦标赛开始前，两支队伍在一场友谊赛中进行了非正式的交手。"},{"en":"She was preofficially offered the job, pending a background check.","zh":"在背景调查完成前，她已非正式地被告知将获得这份工作。"},{"en":"They preofficially agreed on the schedule, but the final plan still needed approval.","zh":"他们先非正式地同意了日程，但最终方案仍需要批准。"}]}],"synonyms":["unofficially","tentatively","provisionally","informally"],"phonetic":"/ˌpriːəˈfɪʃəli/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”。因此 *preofficially* 多用于口语或写作中，表达“还没正式宣布/签字/批准前的状态”。更常见的替代表达有 *unofficially*（非正式地）、*tentatively*（暂定地）、*in principle*（原则上）。"]}
{"word":"preominate","summary":{"en":"Predominate means to be the most common or most influential; to prevail over others.","zh":"Predominate 指“占多数/占主导”，也可指“压过、胜过”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of something) to be the most common, most noticeable, or most important among a group.","zh":"（某事物）在一组事物中占多数、最显著或最重要。"},"examples":[{"en":"Blue and gray predominate in the painting, creating a calm mood.","zh":"这幅画以蓝色和灰色为主，营造出平静的氛围。"},{"en":"In this area, small family businesses predominate.","zh":"在这个地区，小型家族企业占多数。"},{"en":"One theme predominate(s) throughout the novel: the search for identity.","zh":"这部小说贯穿始终的一个主题是：寻找自我认同。"}]},{"partOfSpeech":"vi.","definition":{"en":"To have greater strength, influence, or control than others; to prevail.","zh":"比其他事物更有力量/影响力/控制力；占上风，支配。"},"examples":[{"en":"Reason should predominate over anger when you make decisions.","zh":"做决定时，理性应当胜过愤怒。"},{"en":"In the debate, practical concerns predominated over ideology.","zh":"在这场辩论中，现实考量压过了意识形态。"}]}],"synonyms":["prevail","dominate","be prevalent","be widespread","outweigh"],"phonetic":"/prɪˈdɑːməˌneɪt/","extraExplanation":["你输入的 **preominate** 常见为拼写错误，正确拼写通常是 **predominate**。","**predominate** 来自拉丁语词根：*prae-*（在前）+ *dominari*（支配、统治）。因此它既可表示“数量上占多数”，也可表示“影响力上占主导”。","常见搭配：**predominate in**（在……中占主导/占多数）；**predominate over**（胜过/压过……）。"]}
{"word":"preomission","summary":{"en":"“Preomission” is rare/nonstandard; it means an omission made in advance, but “omission” or “leave out” is usually better.","zh":"“preomission”较少见且不太标准，意为“预先的遗漏”；通常用“omission”或“leave out”更自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) An omission that happens beforehand (for example, leaving something out in advance). In most writing, people would simply say “omission” or “leave out.”","zh":"（罕见／非标准）指“预先的遗漏”，也就是在一开始就把某些内容先行省略。在大多数英文写作中通常直接用“omission（遗漏）”或“leave out（省略）”。"},"examples":[{"en":"The policy document had a pre-omission of key safety steps, which caused confusion later.","zh":"这份政策文件一开始就预先漏掉了关键的安全步骤，导致后来产生混乱。"},{"en":"If you intentionally leave out names at the start, it’s better to call it an omission rather than “preomission.”","zh":"如果你一开始就故意不写名字，更好的说法是“omission（遗漏）”，而不是“preomission”。"}]}],"synonyms":["omission","leaving out","deliberate omission","omission in advance"],"phonetic":"/ˌpriːəˈmɪʃən/","extraExplanation":["“preomission”不是常见的标准英语拼写，很多情况下读者会把它看成临时造词或拼写错误。更自然的表达包括：\n- omission / leave out（遗漏／省略）\n- deliberate omission（刻意隐瞒／刻意省略）\n- omission in advance（提前省略）\n另外，如果你本来想表达“预感”，常见词是 premonition（预感），拼写很接近但意思不同。"]}
{"word":"preomit","summary":{"en":"“Preomit” isn’t a standard word; it’s likely a misspelling of “preempt,” meaning to act first to prevent something or to take priority over something.","zh":"“preomit”不是标准词；很可能是“preempt”的误拼，意思是先发制人以阻止某事，或优先取代原本会发生的事。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “preempt.”","zh":"不是标准英语单词。很可能是“preempt”的拼写错误。"},"examples":[{"en":"I think you meant “preempt,” not “preomit.”","zh":"我想你想写的是“preempt”，不是“preomit”。"},{"en":"Could you check the spelling and tell me the sentence you want to use it in?","zh":"你可以检查一下拼写，并告诉我你想放在什么句子里吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"(Likely intended word) “preempt”: to act before someone else to prevent them from doing something, or to take the place of something that would normally happen.","zh":"（可能想写的词）“preempt”：先发制人以阻止他人；或抢先取代原本会发生/会被做的事。"},"examples":[{"en":"The company released a discount early to preempt competitors.","zh":"公司提前推出折扣来抢在竞争对手之前。"},{"en":"A breaking news alert can preempt a regular TV program.","zh":"突发新闻提醒可能会打断并取代正常的电视节目。"},{"en":"She answered the question quickly to preempt further criticism.","zh":"她迅速回答问题，以免招来更多批评。"}]}],"synonyms":["preempt","forestall","prevent","anticipate","take precedence over"],"phonetic":"/priˈɛmpt/","extraExplanation":["“preempt”常见于商业竞争、政治/军事语境（先发制人），以及媒体领域（节目被突发内容打断）。","如果你本来想表达“预先省略/提前删掉”，英语更自然的说法通常是“omit in advance / leave out beforehand”，而不是把“pre-”直接加在“omit”前面造词。"]}
{"word":"preomitted","summary":{"en":"Preomitted means omitted beforehand (a rare word).","zh":"preomitted 指“事先被省略/删去的”（较罕用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) omitted beforehand; left out in advance, especially by prior arrangement or editing.","zh":"（罕用）预先省略的；事先被删去的（常指在编辑或安排中提前不写出）。"},"examples":[{"en":"In the final report, a few technical details were preomitted to keep the language simple.","zh":"在最终报告中，为了让语言更易懂，一些技术细节被预先省略了。"},{"en":"The anthology notes that certain passages were preomitted from this edition.","zh":"这本选集注明：某些段落在这一版中被预先删去。"}]}],"synonyms":["previously omitted","omitted in advance","left out beforehand"],"phonetic":"/ˌpri.oʊˈmɪtɪd/","extraExplanation":["“preomitted”在现代英语中非常少见，更自然的说法通常是“previously omitted / already omitted / omitted in advance”。","写作时也常见带连字符的形式“pre-omitted”，用来强调“pre-（事先）+ omitted（省略）”的构词关系；正式出版物里更可能改写为更常用的表达。"]}
{"word":"preomitting","summary":{"en":"“Preomitting” is a rare, nonstandard form meaning “omitting something in advance.” In formal English, use “pre-omitting,” “omitting in advance,” or simply “omit/leave out.”","zh":"“preomitting”是很少见且不太标准的写法，意思是“提前省略”。正式表达更常用“pre-omitting”“omitting in advance”，或直接用“omit/leave out”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) leaving something out in advance; omitting beforehand.","zh":"（非标准/罕见）提前把某些内容省略掉；事先不写/不提。"},"examples":[{"en":"I’m preomitting the confidential numbers from this draft.","zh":"我会在这份草稿里提前把机密数字省略掉。"},{"en":"The editor suggested preomitting repeated details to keep the article short.","zh":"编辑建议提前删去重复细节，让文章更精炼。"}]}],"synonyms":["omit in advance","pre-omit","leave out","exclude","remove"],"phonetic":"/ˌpriː oʊˈmɪtɪŋ/","extraExplanation":["“preomitting”在现代英语中几乎不作为标准拼写出现，更常见的写法会加连字符：pre-omitting（由 pre- + omitting 组成）。","在正式写作里，通常直接用 omit（省略）、leave out（删去/不包括）、exclude（排除），或用更自然的表达：omit in advance / omit proactively（提前省略）。","如果你想表达“先发制人地阻止/抢先做某事”，可能你本来想写的是 preempting（抢先；先发制人地）。两者意思不同：pre-omit 是“先删掉”，preempt 是“先行动以防止别人/别的事发生”。"]}
{"word":"preopen","summary":{"en":"Preopen means to open something before its official opening time, sometimes specifically in finance for pre-open market activity.","zh":"Preopen 指在正式开放前提前开放；在金融语境中也可指盘前时段的交易准备或活动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to open (a store, event, system, etc.) before the official opening time, often for preparation or limited early access","zh":"（在正式开放前）提前开放（店铺、活动、系统等），常用于准备工作或提供有限的提前进入"},"examples":[{"en":"The café will preopen at 7:30 a.m. for staff training, then open to the public at 8:00.","zh":"这家咖啡馆将于早上7:30提前开放进行员工培训，8:00再对公众正式营业。"},{"en":"We preopened the app to a small group of users to test for bugs.","zh":"我们把应用提前开放给一小部分用户，以测试漏洞。"}]},{"partOfSpeech":"v.","definition":{"en":"(finance) to allow trading preparation before the regular market session, or to trade during a pre-open session","zh":"（金融）在常规开盘前进行交易准备，或在“盘前/集合竞价”时段进行交易"},"examples":[{"en":"Some exchanges preopen for order entry before the opening auction begins.","zh":"有些交易所在开盘集合竞价开始前会允许提前输入订单。"},{"en":"The stock looked strong in the preopen session.","zh":"这只股票在盘前时段看起来很强势。"}]}],"synonyms":["open early","soft-open","launch early","early-access (contextual)"],"phonetic":"/priˈoʊpən/","extraExplanation":["“preopen”多见于商业与产品运营语境，含义接近“soft open（试营业）/early access（提前开放）”，但更强调“在正式开放前先打开/先上线”。","在金融语境里，“preopen”常指交易所开盘前的订单录入或集合竞价阶段（不同市场规则不同）；也常看到名词形式“pre-open（盘前）”。"]}
{"word":"preopening","summary":{"en":"Preopening refers to the time or activities before an official opening, or describes something happening before opening day.","zh":"preopening 指正式开业/开幕前的筹备与试运行阶段，也可作形容词表示“开业前的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period or activities before a business, show, exhibition, or building officially opens to the public (often including preparation, training, or trial runs).","zh":"（正式对外开放前的）筹备期；试运营/预开业阶段（常包括准备、培训或试运行）。"},"examples":[{"en":"The restaurant is in its preopening phase, so service may be slower than usual.","zh":"这家餐厅正处于预开业阶段，所以出餐可能比平时慢。"},{"en":"They hired extra staff during preopening to train everyone before opening day.","zh":"他们在预开业期间多招了员工，以便在开业前完成培训。"},{"en":"A preopening checklist helped the team catch problems early.","zh":"一份预开业清单帮助团队提前发现问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening before the official opening; related to preparation for an opening.","zh":"开业前的；与开业前准备相关的。"},"examples":[{"en":"We attended a preopening event for the new museum.","zh":"我们参加了新博物馆的预开幕活动。"},{"en":"Preopening inspections are required for safety reasons.","zh":"出于安全原因，需要进行开业前检查。"}]}],"synonyms":["pre-opening","soft opening (related)","lead-up (to an opening)","prelaunch (similar)"],"phonetic":"/ˌpriːˈoʊpənɪŋ/","extraExplanation":["“pre-”表示“在……之前”，加在“opening（开幕/开业）”前形成“preopening”。在商业语境中常见于零售、餐饮、酒店，指试营业、员工培训、系统调试、软启动（soft opening）等。","常见写法有连字符形式“pre-opening”（更常见、也更易读），以及合写“preopening”（多见于内部文件、标题或复合词风格较强的写法）。","相关表达：soft opening（试营业/试运营，强调对外开放但规模较小）、grand opening（盛大开业/正式开幕）。"]}
{"word":"preoperate","summary":{"en":"A rare verb meaning “to prepare before surgery” (or, less commonly, “to operate in advance”).","zh":"一个较少见的动词，主要指“术前准备/实施术前步骤”（也可较少见地指“提前运作”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do preparations before a surgical operation; to carry out preoperative steps (rare in everyday English).","zh":"在手术前进行准备；实施术前步骤（在日常英语中较少见）。"},"examples":[{"en":"The nurse will preoperate the patient by checking vital signs and confirming allergies.","zh":"护士会在术前为病人做准备，比如检查生命体征并确认过敏史。"},{"en":"The team preoperated carefully to reduce the risk of infection.","zh":"团队细致地进行术前准备，以降低感染风险。"}]},{"partOfSpeech":"v.","definition":{"en":"to operate or function in advance or beforehand (very uncommon usage).","zh":"提前运作；预先运行（非常少见的用法）。"},"examples":[{"en":"Some systems preoperate in the background to speed up loading.","zh":"有些系统会在后台预先运行，以加快加载速度。"}]}],"synonyms":["prepare (for surgery)","do preoperative preparation","pre-op","ready"],"phonetic":"/ˌpriˈɑpəˌreɪt/","extraExplanation":["“preoperate”不是常见词，写作中更常用的表达是：\n- 医疗语境：用“prepare the patient for surgery / do preoperative preparation / pre-op (adj.)”更自然。\n- 形容词更常见：preoperative（术前的），副词：preoperatively（在术前）。\n另外，这个词有时会写成带连字符的“pre-operate”，但在现代英语里仍不算主流。"]}
{"word":"preoperated","summary":{"en":"“Preoperated” means “before an operation,” but the more common medical word is “preoperative.”","zh":"“preoperated”可表示“术前的”，但医学中更常用、更规范的是“preoperative（术前的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) done or happening before a surgical operation.","zh":"（医学）在手术之前进行的；术前的。"},"examples":[{"en":"The nurse reviewed the patient’s preoperated checklist before surgery.","zh":"护士在手术前复核了病人的术前检查清单。"},{"en":"He was given preoperated instructions about fasting and medications.","zh":"他收到了关于禁食和用药的术前说明。"}]},{"partOfSpeech":"adj.","definition":{"en":"prepared or adjusted in advance so that it is ready to be operated (used more generally, but uncommon).","zh":"（较少见）为之后操作而提前准备/调整好的。"},"examples":[{"en":"The machine was preoperated to reduce setup time during the test.","zh":"这台机器已提前调试，以减少测试时的设置时间。"}]}],"synonyms":["preoperative","pre-op (informal)","before surgery"],"phonetic":"/ˌpriːˈɑːpəˌreɪtɪd/","extraExplanation":["“preoperated”在真实英语中不算常见拼写；医学语境里更标准、更常用的是“preoperative”（adj. 术前的），例如：preoperative care / preoperative evaluation。","如果你想表达“术前检查/评估”，更自然的搭配是：preoperative tests / preoperative assessment。","如果你本来想写“pre-owned”（二手的）或“pre-op”（术前/整形术前准备的口语缩写），也请告诉我具体句子，我可以帮你改得更地道。"]}
{"word":"preoperating","summary":{"en":"Preoperating means “before an operation,” especially before surgery; it’s a less common form of “preoperative.”","zh":"preoperating 指“手术前的/术前的”，在医学语境里较不常见，常用说法是 preoperative。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or done before an operation (especially a surgical operation); preoperative","zh":"（尤指外科）手术前的；术前的"},"examples":[{"en":"The nurse checked his blood pressure during the preoperating assessment.","zh":"护士在术前评估时测量了他的血压。"},{"en":"Preoperating instructions often include fasting after midnight.","zh":"术前说明通常包括午夜后禁食。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the act of preparing to operate a machine, system, or process; getting ready to begin operation","zh":"（罕见）在启动机器/系统/流程之前的准备操作；准备开始运行"},"examples":[{"en":"The technician finished the preoperating checks before starting the engine.","zh":"技术员在启动引擎前完成了运行前检查。"}]}],"synonyms":["preoperative","before surgery","prior to surgery"],"phonetic":"/ˌpriˈɑpəˌreɪtɪŋ/","extraExplanation":["“preoperating”在现代英语里不如“preoperative”常见，医学场景中更标准、更常用的写法是 preoperative（术前的）。如果你在医院表格或说明里看到 preoperating，多半就是指“术前”的意思。"]}
{"word":"preoperation","summary":{"en":"“Preoperation” refers to the time or preparations before an operation, especially a medical surgery.","zh":"“preoperation”指（尤其是医疗手术）开始之前的阶段或准备工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period, planning, or preparation that happens before a medical or technical operation (often written as “pre-operation” or expressed as “preoperative”)","zh":"（医疗或技术）手术/操作之前的阶段、计划或准备（常写作“pre-operation”，也常用“preoperative”表达）"},"examples":[{"en":"The nurse reviewed the patient’s preoperation checklist.","zh":"护士检查了病人的术前清单。"},{"en":"Good preoperation planning can prevent delays in the operating room.","zh":"良好的术前规划可以避免手术室延误。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done before an operation; preoperative","zh":"发生在手术/操作之前的；术前的"},"examples":[{"en":"He had preoperation tests early in the morning.","zh":"他一大早做了术前检查。"},{"en":"The team discussed preoperation safety procedures.","zh":"团队讨论了术前安全流程。"}]}],"synonyms":["preoperative","pre-op","pre-operation"],"phonetic":"/ˌpriːˌɑpəˈreɪʃən/","extraExplanation":["“preoperation”在实际英文里更常见的写法是分开的或加连字符：pre-operation；在医学语境中，更常用、更标准的形容词是“preoperative”（如：preoperative evaluation 术前评估）。如果你是在写论文、病历或说明书，优先考虑用“preoperative”。"]}
{"word":"preoperational","summary":{"en":"Preoperational describes the early childhood stage (about ages 2–7) when thinking is symbolic but not yet fully logical.","zh":"Preoperational 指儿童早期（约2–7岁）的“前运算阶段”：能进行符号化思考，但逻辑推理尚未成熟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Psychology) Relating to Piaget’s preoperational stage of cognitive development (about ages 2–7), when children use symbols and language but often think in intuitive, not fully logical ways.","zh":"（心理学）与皮亚杰所说的“前运算阶段”有关（约2–7岁）：儿童开始使用符号与语言，但思考多凭直觉，尚未形成成熟的逻辑运算能力。"},"examples":[{"en":"In the preoperational stage, many children struggle to understand that the same amount of water can look different in a taller glass.","zh":"在前运算阶段，很多孩子难以理解：同样多的水换到更高的杯子里看起来变多了，但数量其实不变。"},{"en":"The teacher used pictures and pretend play to support preoperational learners.","zh":"老师用图片和角色扮演来支持前运算阶段的学习者。"}]}],"synonyms":["preoperational stage–related","early-childhood cognitive (context-dependent)"],"phonetic":"/ˌpriˌɑpəˈreɪʃənəl/","extraExplanation":["“preoperational”最常见于发展心理学与教育学语境，尤其是皮亚杰（Jean Piaget）的认知发展理论。","前运算阶段的典型特点常被用来解释儿童的思维方式，例如：自我中心（较难从他人视角看问题）、聚焦（容易只注意到事物的一个显著特征）、以及对“守恒”（数量、体积等不因外形变化而改变）的理解尚不稳定。","在日常英语里它不算高频词，通常出现在教材、论文、课堂讨论或专业报告中。"]}
{"word":"preoperative","summary":{"en":"Preoperative means “before surgery” or “related to the period before an operation.”","zh":"preoperative 指“术前的”，即在手术之前或与手术前阶段有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a surgical operation; relating to the time before surgery.","zh":"术前的；在手术之前进行的；与手术前阶段有关的。"},"examples":[{"en":"The nurse checked his blood pressure during the preoperative exam.","zh":"护士在术前检查时测量了他的血压。"},{"en":"You may need to stop eating and drinking the night before, depending on the preoperative instructions.","zh":"根据术前指示，你可能需要从前一晚开始禁食禁饮。"},{"en":"Preoperative tests help doctors plan the safest anesthesia.","zh":"术前检查有助于医生制定最安全的麻醉方案。"}]}],"synonyms":["pre-op","pre-surgical"],"phonetic":"/ˌpriːˈɑːpərətɪv/","extraExplanation":["词源提示：pre- 表示“在……之前”，operative 来自 operate（手术/操作）。因此 preoperative 就是“手术之前的”。","常见搭配：preoperative assessment（术前评估）、preoperative screening/tests（术前筛查/检查）、preoperative instructions（术前注意事项）、preoperative fasting（术前禁食）。","同类词对比：postoperative 是“术后的”；intraoperative 是“术中（手术过程中）的”。"]}
{"word":"preoperatively","summary":{"en":"“Preoperatively” means “before surgery,” often used in medical contexts.","zh":"“Preoperatively”意为“术前/手术前”，常用于医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before a surgical operation; during the period leading up to surgery.","zh":"（在）手术前；指手术前准备阶段。"},"examples":[{"en":"The doctor explained the risks to the patient preoperatively.","zh":"医生在术前向病人解释了风险。"},{"en":"Preoperatively, she was asked not to eat or drink after midnight.","zh":"术前，她被要求午夜后不要进食或饮水。"},{"en":"Pain levels were recorded preoperatively and again after surgery.","zh":"疼痛程度在术前记录一次，手术后又记录一次。"}]}],"synonyms":["before surgery","prior to surgery","pre-op (informal)"],"phonetic":"/ˌpriːˌɑpəˈreɪtɪvli/","extraExplanation":["词源与构成：pre-（在……之前）+ operative（手术的/操作的）+ -ly（副词后缀），常见于医学写作与病历记录，与 intraoperatively（术中）和 postoperatively（术后）并列使用。","使用场景：多用于正式语境，如医生沟通、研究论文、护理记录；日常口语里更常说 “before surgery / before the operation”。"]}
{"word":"preoperator","summary":{"en":"A preoperator is a prefix operator placed before the operand in programming.","zh":"preoperator 指编程中放在操作数前面的前缀运算符。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Programming) An operator written before its operand; a prefix operator (for example, ++i, --i, !x).","zh":"（编程）写在操作数前面的运算符；前缀运算符（例如 ++i、--i、!x）。"},"examples":[{"en":"In C++, ++i is a preoperator form of increment.","zh":"在 C++ 中，++i 是自增的前缀（preoperator）写法。"},{"en":"A preoperator often changes the value before the expression is evaluated.","zh":"前缀运算符通常会在表达式求值前就改变数值。"}]}],"synonyms":["prefix operator","pre-increment operator","pre-decrement operator"],"phonetic":"/ˌpriːˈɑːpəˌreɪtɚ/","extraExplanation":["这个词在一般英语里不常见，更常见的说法是 prefix operator（前缀运算符）或 pre-increment/pre-decrement operator（前置自增/自减运算符）。","以 ++i 和 i++ 为例：前者通常表示“先加再用”，后者通常表示“先用再加”（具体细节取决于语言与上下文）。"]}
{"word":"preopercle","summary":{"en":"A fish bone located in front of the gill cover (opercle).","zh":"鱼类鳃盖前方的一块骨板（前鳃盖骨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bony plate in many fishes that lies in front of the opercle (the gill cover) and helps support/protect the gill area.","zh":"（鱼类）前鳃盖骨：位于鳃盖（鳃盖骨）前方的一块骨板，起到支撑和保护鳃部区域的作用。"},"examples":[{"en":"The biologist examined the fish’s preopercle to help identify the species.","zh":"生物学家检查这条鱼的前鳃盖骨，以帮助鉴定物种。"},{"en":"In some fish, the edge of the preopercle has small spines.","zh":"在一些鱼类中，前鳃盖骨的边缘带有小棘刺。"}]}],"synonyms":["preopercular bone"],"phonetic":"/ˌpriˈɑːpɚkəl/","extraExplanation":["词源小提示：pre- 表示“在前”，opercle 指“鳃盖/盖子”（也可泛指盖状结构）。preopercle 字面意思就是“位于鳃盖之前的结构”。","在鱼类形态学与分类学中，前鳃盖骨的形状、边缘锯齿/棘刺、以及与周围骨骼的连接方式，常被用作鉴别特征。"]}
{"word":"preopercular","summary":{"en":"Preopercular means “related to the preopercle,” a bone near the gill cover in fish.","zh":"preopercular 指“与前鳃盖骨/前鳃盖有关的”，常用于鱼类解剖与分类描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, especially in fish) relating to the preopercle (also called the preopercular bone), a bone near the gill cover (operculum).","zh":"（解剖学，尤指鱼类）与“前鳃盖骨/前鳃盖”（preopercle）有关的；指位于鳃盖（operculum）前方附近的一块骨骼。"},"examples":[{"en":"The specimen has a serrated preopercular margin.","zh":"该标本的前鳃盖骨边缘呈锯齿状。"},{"en":"Researchers measured preopercular length to compare related fish species.","zh":"研究人员测量前鳃盖骨长度，以比较近缘鱼类物种。"}]}],"synonyms":["preopercle-related","(related term) preopercle","(related term) opercular"],"phonetic":"/ˌpriːoʊˈpɝːkjələr/","extraExplanation":["词源拆解有助记忆：pre-（在……之前）+ operculum（鳃盖/盖子）→ preopercular（位于鳃盖之前/与其相关）。","这个词多见于鱼类形态学、分类学论文或鉴定手册中，用来描述“前鳃盖骨”的形状、棘刺、边缘是否锯齿等特征，这些细节常用于区分物种。"]}
{"word":"preoperculum","summary":{"en":"A fish skull bone in front of the operculum (gill cover).","zh":"鱼类鳃盖前方的一块骨（前鳃盖骨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In fish anatomy, the bony plate (part of the gill cover) located in front of the operculum; it helps protect and support the gill chamber.","zh":"（鱼类解剖）鳃盖骨前部的一块骨板，位于主鳃盖（operculum）之前；用于保护并支撑鳃腔。"},"examples":[{"en":"The biologist examined the preoperculum to identify the fish species.","zh":"生物学家检查了前鳃盖骨，以鉴定鱼的物种。"},{"en":"Spines on the preoperculum can be an important feature in field guides.","zh":"前鳃盖骨上的棘突常是野外识别手册中的重要特征。"}]}],"synonyms":["preopercular bone","preopercle"],"phonetic":"/ˌpriːoʊˈpɝːkjələm/","extraExplanation":["这个词主要用于鱼类学（ichthyology）与解剖学论文或物种鉴定资料中，日常英语里很少见。","构词上可理解为 pre-（在……之前）+ operculum（鳃盖/盖子）。在鱼类头部骨骼中，preoperculum 通常与 operculum、suboperculum、interoperculum 等骨片一起构成“鳃盖骨复合体”（opercular series）。","在分类与鉴定中，研究者常记录前鳃盖骨的形状、边缘是否有锯齿/棘突、以及与相邻骨片的连接方式等特征。"]}
{"word":"preopinion","summary":{"en":"A preopinion is an opinion formed in advance—before you have all the facts.","zh":"preopinion 指在没有充分事实前就先形成的看法（先入之见/成见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prior or already-formed opinion about something before getting full information; a preconception","zh":"先入为主的看法；在了解充分信息之前就形成的意见（成见）"},"examples":[{"en":"Try to set aside your preopinion and listen to both sides.","zh":"尽量放下先入为主的看法，听听双方怎么说。"},{"en":"Her preopinion of the new teacher changed after the first class.","zh":"第一节课后，她对新老师的先入为主印象改变了。"}]}],"synonyms":["preconception","preconceived notion","bias","assumption"],"phonetic":"/ˌpriːəˈpɪnjən/","extraExplanation":["“preopinion”在英语中并不常见，更多时候会用更自然的表达，比如：preconception（成见/先入之见）、preconceived notion（先入为主的观念）、bias（偏见）、assumption（假设）。","构词上可理解为 pre-（在……之前）+ opinion（意见/看法），意思接近“事先的看法”。在正式写作里建议改用上面更常用的词。"]}
{"word":"preopinionated","summary":{"en":"“Preopinionated” means already having a fixed opinion before hearing the facts—going in with a preconceived view.","zh":"“preopinionated”指在了解事实之前就已有定见，带着先入为主的看法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a fixed opinion before hearing the facts or other people’s views; already decided in advance.","zh":"在了解事实或听取他人观点之前就已有定见的；先入为主的。"},"examples":[{"en":"Try not to be preopinionated—listen to both sides first.","zh":"尽量别先入为主——先把双方的说法都听完。"},{"en":"The interviewer seemed preopinionated and didn’t ask many follow-up questions.","zh":"那位面试官看起来已经带着成见，所以没怎么追问。"},{"en":"If you go in preopinionated, you may miss important details.","zh":"如果你带着先入为主的想法进入讨论，你可能会错过重要细节。"}]}],"synonyms":["prejudiced","biased","preconceived","closed-minded"],"phonetic":"/ˌpriː.əˈpɪn.jəˌneɪ.tɪd/","extraExplanation":["“preopinionated”不是非常常见的标准词，更常见的表达是 **opinionated**（很有主见/固执己见）、**prejudiced**（有偏见的）、**biased**（有倾向性的）或 **with preconceived notions**（带着先入为主的观念）。","构词理解：**pre-** 表示“在……之前”，**opinionated** 表示“强烈坚持自己观点的”。合起来就是“事先就持有强烈看法”，语气往往带批评意味。"]}
{"word":"preoppose","summary":{"en":"To oppose something beforehand; to object in advance.","zh":"在事情发生前就反对；事先提出反对。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to oppose (a plan, idea, or action) in advance; to object beforehand","zh":"预先反对；事先提出反对（某计划、想法或行动）"},"examples":[{"en":"Several members preopposed the proposal before the meeting even started.","zh":"会议还没开始，一些成员就预先反对了这项提案。"},{"en":"It’s hard to negotiate if one side preopposes every change.","zh":"如果一方对每个改动都事先反对，协商就很难进行。"}]}],"synonyms":["object beforehand","oppose in advance","raise objections early","preemptively oppose"],"phonetic":"/ˌpriəˈpoʊz/","extraExplanation":["“preoppose”很少见，更多时候英语会用更自然的表达：**oppose in advance / object beforehand / raise objections early**。","词形来自前缀 **pre-**（“在……之前”）+ **oppose**（“反对”）。在正式写作中，为了清晰，常建议改写为上述更常用的短语。"]}
{"word":"preopposed","summary":{"en":"“Preopposed” means already opposed in advance—showing objection before something is fully considered.","zh":"“preopposed”指“事先就反对的”，强调在充分了解或讨论前就先持反对立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already opposed in advance; having a prior objection before something is fully presented or tried","zh":"事先就反对的；在事情充分提出或尝试之前就先持反对立场的"},"examples":[{"en":"Some people are preopposed to any new taxes, even before they hear the details.","zh":"有些人对任何新税收都事先反对，甚至在听到细节之前就先否定了。"},{"en":"If the committee is preopposed, you’ll need stronger evidence to change minds.","zh":"如果委员会事先就反对，你就需要更有力的证据来改变他们的想法。"}]},{"partOfSpeech":"v.","definition":{"en":"past form/past participle of “preoppose”: to oppose beforehand or in anticipation","zh":"“preoppose”的过去式/过去分词：预先反对；事先表示反对"},"examples":[{"en":"Several groups preopposed the proposal months before the public meeting.","zh":"在公开会议前几个月，已有几个团体预先反对该提案。"}]}],"synonyms":["prejudiced (against)","predisposed (to oppose)","already opposed","set against","anti-"],"phonetic":"/ˌpriːəˈpoʊzd/","extraExplanation":["“preopposed”不算常见词，更常见的表达是：be opposed from the start（从一开始就反对）、be predisposed to oppose（倾向于反对）、have a preconceived objection（先入为主地反对）。","构词上由前缀 pre-（“在……之前”）+ opposed（反对的）组成，强调“反对发生得很早、带有预设立场”。在正式写作里使用时，通常需要上下文说明你指的是“提前反对/先入为主的反对”。"]}
{"word":"preopposing","summary":{"en":"“Preopposing” means opposing something in advance (a rare word).","zh":"“preopposing”表示“事先反对”（较罕用的词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) opposing something in advance; showing opposition before an event, action, or proposal happens.","zh":"（罕用）事先反对的；在某事发生、行动开始或提案提出之前就表示反对的。"},"examples":[{"en":"Some community groups were preopposing the plan before the official meeting even began.","zh":"有些社区团体在正式会议开始之前就已经在事先反对这个计划。"},{"en":"Preopposing criticism can make honest discussion difficult.","zh":"事先反对式的批评会让坦诚的讨论变得困难。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of the rare verb “preoppose”: to oppose in advance.","zh":"罕用动词 preoppose 的现在分词：指事先反对。"},"examples":[{"en":"They are preopposing any change to the schedule.","zh":"他们正在事先反对对日程安排的任何改动。"}]}],"synonyms":["preemptively opposing","opposing in advance","against from the start"],"phonetic":"/ˌpriːəˈpoʊzɪŋ/","extraExplanation":["“preopposing / preoppose”在现代英语中非常少见，更自然的表达通常是“oppose in advance”“preemptively oppose”“be against it from the start”。","书面语中也常见带连字符的写法“pre-opposing”，用来强调“pre-（事先）+ opposing（反对）”的构词关系。"]}
{"word":"preopposition","summary":{"en":"A rare word meaning “before opposition,” used for a stage or situation prior to open disagreement.","zh":"一个较少见的词，意思是“反对出现之前”，指公开分歧发生前的阶段或情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The period or situation before open opposition begins; a stage before people publicly disagree or resist.","zh":"（罕见）公开反对开始之前的时期或情境；在人们公开表达反对或抵制之前的阶段。"},"examples":[{"en":"In the preopposition phase, the team raised concerns quietly instead of arguing in meetings.","zh":"在公开反对之前的阶段，团队只是私下提出担忧，而不是在会议上争论。"},{"en":"The report describes preopposition tensions inside the organization.","zh":"这份报告描述了组织内部在公开反对出现之前的紧张气氛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening before opposition forms or is expressed.","zh":"（罕见）发生在反对意见形成或被表达之前的。"},"examples":[{"en":"They held a preopposition discussion to prevent conflict later.","zh":"他们举行了一次“反对出现之前”的讨论，以避免之后的冲突。"},{"en":"Preopposition signals can be easy to miss.","zh":"反对出现之前的信号很容易被忽略。"}]}],"synonyms":["prior to opposition","pre-opposition (hyphenated)","before opposition arose","pre-conflict stage"],"phonetic":"/ˌpriːˌɑpəˈzɪʃən/","extraExplanation":["“preopposition”不是常见标准词，写作中很少见；更多时候人们会用更自然的表达，如 “before opposition arose / prior to opposition / pre-opposition stage”。","它也很容易被误写成 “preposition”（介词）。如果你原本想查的是 “preposition”，告诉我语境（句子或主题），我可以按“介词”给出标准释义与用法。"]}
{"word":"preoppress","summary":{"en":"“Preoppress” is not standard English; it’s probably a typo for “oppress” or “pre-op.”","zh":"“preoppress”不是标准英语词；多半是把“oppress”或“pre-op”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a made-up form. You may have meant “oppress” or “pre-op” (short for preoperative).","zh":"不是标准英语单词；很可能是拼写错误或自造词。你可能想写的是“oppress（压迫）”或“pre-op（术前的/术前检查的）”。"},"examples":[{"en":"I couldn’t find “preoppress” in a dictionary—did you mean “oppress”?","zh":"我在词典里找不到“preoppress”——你是不是想写“oppress”？"},{"en":"The nurse explained the pre-op instructions before surgery.","zh":"护士在手术前解释了术前（pre-op）注意事项。"}]}],"synonyms":["oppress","suppress (possible intended)","pre-op (possible intended)"],"phonetic":"/ˌpriːoʊˈprɛs/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”（例如 prewar 战前，prepaid 预付）。理论上把 pre- 加在动词前有时能造出新词，但“preoppress”并不是约定俗成的用法，因此读者通常会认为是拼写错误。","如果你想表达“在某事发生前就进行压迫/打压”，更自然的说法包括：“oppress in advance”“preemptively suppress”“crack down before …”。","如果你告诉我你的原句（上下文），我可以帮你判断你真正想用的词，并给出更地道的改写。"]}
{"word":"preoppression","summary":{"en":"“Preoppression” is a rare form meaning the time before oppression; “pre-oppression” is the clearer, more common spelling.","zh":"“preoppression”很少见，意思是“压迫发生之前的时期/状态”；更清晰常见的写法是“pre-oppression”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) The period or condition before oppression begins; “pre-oppression” is more commonly written with a hyphen.","zh":"（罕见/不规范用法）指压迫开始之前的时期或状态；更常见写法为带连字符的“pre-oppression”。"},"examples":[{"en":"The novel’s first chapters describe a pre-oppression era, when the community still had basic rights.","zh":"这部小说的前几章描写了一个“压迫之前”的时代，那时社区仍享有基本权利。"},{"en":"Activists studied pre-oppression social structures to understand what was lost later.","zh":"活动人士研究“压迫前”的社会结构，以理解后来失去了什么。"}]}],"synonyms":["pre-oppression","before oppression","prior to oppression","pre-repression"],"phonetic":"/ˌpriːəˈprɛʃən/","extraExplanation":["“preoppression”在现代英语中非常少见，读者可能会以为是拼写错误。更自然的写法通常是“pre-oppression”（带连字符），或直接用“before the oppression / prior to oppression”。","前缀“pre-”表示“在……之前”（如 prewar 战前、preindustrial 工业化前）。与抽象名词“oppression（压迫）”组合时，加连字符能让结构更清晰、可读性更高。"]}
{"word":"preoppressor","summary":{"en":"“Preoppressor” is rare and nonstandard; it usually means a potential future oppressor, or it may be a misspelling of “oppressor.”","zh":"“preoppressor”很罕见且不标准：多指“潜在的未来压迫者”，也可能只是把“oppressor（压迫者）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A person or group seen as a likely future oppressor; a “would-be oppressor” before they gain power.","zh":"（罕见／非标准用法）指被认为将来可能成为压迫者的人或群体；还未掌权时的“潜在压迫者”。"},"examples":[{"en":"Some activists warned that the militia was a preoppressor, already testing how far it could control people.","zh":"一些行动者警告说，这支民兵是“潜在压迫者”，已经在试探能把人控制到什么程度。"},{"en":"He argued that unchecked authority can turn a preoppressor into an oppressor.","zh":"他认为，不受约束的权力会让“潜在压迫者”变成真正的压迫者。"}]},{"partOfSpeech":"other","definition":{"en":"(Likely intended meaning) A misspelling or mistaken form of “oppressor.”","zh":"（更可能的情况）“oppressor（压迫者）”的拼写错误或误写形式。"},"examples":[{"en":"If you mean “oppressor,” the spelling is o-p-p-r-e-s-s-o-r.","zh":"如果你想表达“压迫者”，拼写是 o-p-p-r-e-s-s-o-r。"},{"en":"In that sentence, “oppressor” fits the meaning better than “preoppressor.”","zh":"在那个句子里，用“oppressor”比“preoppressor”更符合意思。"}]}],"synonyms":["would-be oppressor","potential oppressor","proto-oppressor"],"phonetic":"/ˌpriːəˈprɛsər/","extraExplanation":["“preoppressor”不是常见英语词，通常需要连字符写成“pre-oppressor”才更容易被读者理解，意思类似“would-be oppressor / potential oppressor”。","如果你是在历史、政治或社会批评语境中看到它，往往是作者刻意造词，用来强调“压迫尚未发生，但条件与倾向已经出现”。","如果你提供原句，我可以帮你判断这里究竟是在造词（pre-oppressor）还是单纯把“oppressor”拼错了。"]}
{"word":"preoptic","summary":{"en":"Preoptic describes the brain region in front of the optic chiasm (the preoptic area), important for temperature, sleep, and reproductive control.","zh":"preoptic 指位于视交叉前方的脑区（下丘脑视前区），与体温、睡眠及生殖调控密切相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the area in front of the optic chiasm in the brain (the preoptic area of the hypothalamus), involved in functions such as body temperature regulation, sleep, and reproduction.","zh":"与大脑中视交叉前方的区域有关（下丘脑的视前区），该区域参与体温调节、睡眠与生殖等功能。"},"examples":[{"en":"Researchers studied preoptic neurons to understand how the body controls temperature.","zh":"研究人员研究视前区神经元，以了解身体如何控制体温。"},{"en":"The preoptic area plays an important role in sleep regulation.","zh":"视前区在睡眠调节中起重要作用。"}]}],"synonyms":["preoptic area–related","anterior to the optic chiasm (descriptive phrase)"],"phonetic":"/priːˈɑːp.tɪk/","extraExplanation":["“pre-”表示“在……之前/前方”，“optic”与“视觉/视神经”有关；因此preoptic字面意思是“视（觉）之前的/视前的”。","在医学与神经科学文献中，preoptic通常特指“下丘脑视前区（preoptic area）”，而不是泛指“眼睛前方”。"]}
{"word":"preoptimistic","summary":{"en":"Preoptimistic describes a stage before optimism—when someone is not yet hopeful or confident.","zh":"preoptimistic 表示“乐观之前的阶段”，指还没变得乐观、尚未产生希望或信心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before a person or group becomes optimistic; describing an earlier stage when hope or confidence has not yet developed.","zh":"发生在变得乐观之前的；描述尚未产生希望或信心的较早阶段。"},"examples":[{"en":"In the preoptimistic days of the project, the team focused on risks and worst-case scenarios.","zh":"在项目的“乐观之前”阶段，团队主要关注风险和最坏情况。"},{"en":"Her preoptimistic mood changed after she saw the test results improve.","zh":"看到测试结果变好后，她那种“尚未乐观”的情绪就改变了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used more loosely to mean \"not yet optimistic\" or \"skeptical/uncertain\" (often in informal or creative writing).","zh":"较宽泛地表示“还不乐观 / 未到乐观的时候”，带有怀疑或不确定的含义（常见于非正式或创意写作）。"},"examples":[{"en":"I’m still preoptimistic about the economy—let’s wait for more data.","zh":"我对经济形势现在还不太乐观——再等等更多数据。"}]}],"synonyms":["not yet optimistic","cautious","uncertain","skeptical"],"phonetic":"/ˌpriːˌɑp.təˈmɪs.tɪk/","extraExplanation":["“preoptimistic”不是常见词，更像是由前缀 pre-（“在……之前”）+ optimistic（“乐观的”）临时组合出来的写法。正式写作中更常用 not yet optimistic、cautious、uncertain、skeptical 等表达。","语境提示：它通常用于描述“情绪/判断从谨慎或担忧逐渐转向乐观”的过程，因此常与阶段性词汇连用，如 phase, period, days, mindset。"]}
{"word":"preoption","summary":{"en":"Preoption means a prior right to buy or choose something before others, especially in legal or business contexts.","zh":"Preoption 指在他人之前享有购买或选择某物的优先权，常见于法律或商业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prior right to buy, take, or choose something before other people; a right of first refusal (often in law or business).","zh":"优先购买/优先选择权；先买权（多用于法律或商业语境，类似“优先承购权/优先权”）"},"examples":[{"en":"The contract gives the tenant a preoption to buy the apartment if the owner decides to sell.","zh":"合同赋予房客在房主决定出售时优先购买公寓的权利。"},{"en":"Investors asked for a preoption on any new shares issued by the company.","zh":"投资者要求对公司未来发行的新股享有优先认购权。"}]},{"partOfSpeech":"n.","definition":{"en":"A preliminary agreement that grants someone the chance to enter a later, formal option contract (finance).","zh":"（金融）预先期权安排：允许一方在之后签订正式期权合约的初步协议"},"examples":[{"en":"They signed a preoption so the buyer could decide later whether to purchase at a fixed price.","zh":"他们签了预先期权协议，让买方之后再决定是否按固定价格购买。"}]}],"synonyms":["right of first refusal","first option","pre-emption right","preemption"],"phonetic":"/ˌpriːˈɑpʃən/","extraExplanation":["“preoption”在现代英语中相对少见，很多场合更常用的是“right of first refusal（优先购买权）”或“pre-emption right（优先认购权/先买权）”。","拼写上也容易与“preemption/pre-emption（先占、先买权）”混淆；如果你是在法律条款或公司融资文件里看到它，通常是在表达“别人之前你有优先权”。"]}
{"word":"preoral","summary":{"en":"Preoral means “in front of the mouth” or “before oral activity,” mainly in scientific contexts.","zh":"preoral 主要指“口前的/在口之前的”，多用于科学与医学相关语境，也可少见地指“口腔活动之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in front of the mouth; occurring before the mouth (used in anatomy or zoology).","zh":"（解剖学/动物学）位于口部前方的；发生在口之前的。"},"examples":[{"en":"In some fish, the preoral region includes structures used to sense food.","zh":"在一些鱼类中，口前区域（preoral region）包含用于感知食物的结构。"},{"en":"The diagram labels the preoral area just ahead of the mouth opening.","zh":"图示把口前区标注在口开口的正前方。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a stage or condition before oral activity (rare; sometimes seen in developmental or clinical writing).","zh":"（少见；有时用于发展/临床语境）与口腔活动之前的阶段或状态有关的。"},"examples":[{"en":"The author briefly mentions a preoral phase before feeding behaviors become oral.","zh":"作者简要提到在进食行为变为口腔主导之前存在一个“口前阶段”。"}]}],"synonyms":["anterior to the mouth","in front of the mouth"],"phonetic":"/priˈɔrəl/","extraExplanation":["pre- 表示“在……之前”，oral 表示“口的/口腔的”。因此 preoral 字面意思是“在口之前/口前的”。它更常见于解剖学、动物学或胚胎发育相关的专业语境，日常英语中很少用。","更常见、更自然的替代表达包括：in front of the mouth（在口前）、anterior to the mouth（在口的前方/前侧，偏学术）。"]}
{"word":"preorally","summary":{"en":"“Preorally” means “before something is taken by mouth,” mainly in medical/scientific contexts.","zh":"“Preorally” 指“在经口（口服/吞咽）之前”，主要用于医学或科研语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Before something is taken or given by mouth; prior to oral administration or ingestion (used mainly in medical or scientific writing).","zh":"在经口（口服/吞咽）之前；在进行口服给药或经口摄入之前（多用于医学或科研语境）。"},"examples":[{"en":"The medication was given intravenously preorally to control the patient’s nausea.","zh":"为控制患者恶心，在口服之前先静脉给药。"},{"en":"Researchers collected baseline saliva samples preorally, before participants swallowed the solution.","zh":"研究人员在受试者吞咽溶液之前（经口之前）先采集了基础唾液样本。"}]}],"synonyms":["before oral administration","prior to oral administration","before taking (something) by mouth","pre-oral (as an adjective)"],"phonetic":"/priˈɔrəli/","extraExplanation":["这个词非常少见，多出现在医学/药理或实验流程描述中，意思是“在口服/吞咽之前”。日常英语里更常用的写法是 before oral administration / prior to taking it by mouth，或用形容词 pre-oral（例如 pre-oral phase）。","在写作中有时也会写成 pre-orally（加连字符），但并非固定标准；正式稿件建议根据期刊/机构的格式指南统一用法。"]}
{"word":"preorbital","summary":{"en":"Preorbital means “in front of the eye socket.”","zh":"preorbital 指“位于眼眶（眼窝）前方的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Located in front of the orbit (the eye socket).","zh":"（解剖）位于眼眶（眼窝）前方的。"},"examples":[{"en":"The doctor noted mild swelling in the preorbital area.","zh":"医生注意到眼眶前区有轻微肿胀。"},{"en":"Preorbital pain can sometimes be linked to sinus problems.","zh":"眼眶前部疼痛有时与鼻窦问题有关。"}]}],"synonyms":["anterior to the orbit","in front of the orbit"],"phonetic":"/priˌɔrˈbaɪt̬əl/","extraExplanation":["该词多用于医学/解剖语境：orbit 指“眼眶（眼窝）”，pre- 表示“在……之前/前面”，所以 preorbital 就是“眼眶前的”。日常英语里不常用，更多见于体格检查、影像学报告或动物解剖描述中。"]}
{"word":"preordain","summary":{"en":"Preordain means to decide or set something in advance, often implying it is fated or unavoidable; it can also be used in religious contexts to mean “predestine.”","zh":"preordain 指“预先决定/预定”，常带“仿佛命中注定、难以改变”的含义；也可用于宗教语境指“（上帝）预定/命定”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To decide or determine something in advance, often suggesting that it cannot be changed.","zh":"预先决定；预定（常含“无法改变”的意味）。"},"examples":[{"en":"Some people believe our lives are preordained by fate.","zh":"有些人相信我们的生命是由命运预定的。"},{"en":"It seemed preordained that she would become a musician, given her talent.","zh":"考虑到她的天赋，她似乎注定会成为音乐家。"}]},{"partOfSpeech":"vt.","definition":{"en":"(In religious use) To predestine someone or something, especially by God’s will.","zh":"（宗教用法）预定（尤指上帝的旨意）；命定。"},"examples":[{"en":"The preacher spoke about souls preordained for salvation.","zh":"牧师谈到被预定得救的灵魂。"},{"en":"In some traditions, events are seen as preordained by a divine plan.","zh":"在某些传统中，人们认为事件是由神圣计划所预定的。"}]}],"synonyms":["predestine","foreordain","destine","decree","determine"],"phonetic":"/ˌpriːɔrˈdeɪn/","extraExplanation":["“pre-”表示“提前”，而“ordain”原意与“任命、制定（规则）”有关，因此 preordain 有“提前安排/命定”的语感。","日常语境里它常带有文学或略正式的色彩，强调“仿佛早就注定”，比 decide earlier 更有“不可避免”的宿命感。","常见搭配：preordained destiny（注定的命运）、preordained outcome（预定的结果）。相关词：predestine（宿命论色彩更强）、foreordain（更偏宗教/正式）。"]}
{"word":"preordained","summary":{"en":"Preordained means decided in advance, often with a sense of destiny or divine plan.","zh":"preordained 指“预先注定的”，常带“命运或神意安排”的语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decided or set in advance, as if by fate or a higher power; destined to happen.","zh":"预先注定的；（仿佛由命运或更高力量）事先决定必然发生的。"},"examples":[{"en":"Some people believe that our lives are preordained by fate.","zh":"有些人相信我们的人生是由命运预先注定的。"},{"en":"In the novel, their meeting feels preordained, not accidental.","zh":"在小说里，他们的相遇显得像是命中注定，而不是偶然。"},{"en":"She refused to accept that failure was preordained.","zh":"她拒绝接受失败是注定的。"}]}],"synonyms":["predestined","destined","fated","foreordained"],"phonetic":"/ˌpriːɔrˈdeɪnd/","extraExplanation":["词源提示：pre- 表示“在……之前”，ordain 原意有“任命、制定（规则）”，在宗教语境里也有“按神意安排”的含义。因此 preordained 常带有“冥冥之中被安排好”的色彩。","语用提醒：它常用于谈论“命运/宿命”（destiny/fate）或“神的安排”（God’s plan）。如果只是“提前计划好”，更中性、日常的词通常是 planned、scheduled 或 arranged。","文学/文化常见用法：在爱情叙事或史诗式故事里，preordained 常用来营造“天意/宿命感”，强调事件似乎不可避免。"]}
{"word":"preordaining","summary":{"en":"Preordaining means deciding or determining something in advance—sometimes in a religious sense of fate being set by divine will.","zh":"preordaining 指“预先决定/预定”，有时带宗教含义，表示命运由神意预定。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Deciding or arranging something in advance, especially in a way that makes it seem certain to happen.","zh":"预先决定或安排某事（常暗示结果几乎注定会发生）。"},"examples":[{"en":"The early funding is preordaining the project’s success.","zh":"早期的资金支持几乎注定了这个项目会成功。"},{"en":"By choosing that major, she felt she was preordaining her future career.","zh":"选择那个专业后，她觉得自己在预先决定未来的职业方向。"}]},{"partOfSpeech":"v.","definition":{"en":"(Religious) Determining someone’s fate in advance by God or a divine power.","zh":"（宗教语境）由上帝或神圣力量预定某人的命运。"},"examples":[{"en":"Some traditions teach that God is preordaining who will be saved.","zh":"一些传统教义认为，上帝预定哪些人会得救。"},{"en":"The poem suggests an unseen hand preordaining their meeting.","zh":"这首诗暗示有一只看不见的手在预定他们的相遇。"}]}],"synonyms":["predetermining","foreordaining","preplanning","predestining","decreeing"],"phonetic":"/ˌpriɔrˈdeɪnɪŋ/","extraExplanation":["“preordain”由“pre-（预先）+ ordain（任命、规定）”组成。现代英语里，它既可用于日常语境（强调“事情几乎不可避免/早已被安排好”），也常用于宗教或哲学语境（强调“命运/救赎被预定”）。","语气上，“preordaining”往往带有“不是偶然，而是早有安排”的感觉；若你想表达更中性、更少宿命色彩，可以用“planning”或“deciding in advance”。"]}
{"word":"preordainment","summary":{"en":"Preordainment means that someone’s fate or events are decided in advance, often by God.","zh":"preordainment 指命运或事件在事前已被决定（常带有神意预定的含义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or idea that events or a person’s fate have been decided in advance (often by God or a higher power); predestination","zh":"预先决定（常指由上帝或更高力量决定）的行为或观念；宿命、预定"},"examples":[{"en":"In some religious traditions, salvation is seen as a matter of preordainment.","zh":"在一些宗教传统中，得救被看作是预定（预先决定）的结果。"},{"en":"He struggled with the idea of preordainment versus free will.","zh":"他在“预定”与“自由意志”的观念之间感到挣扎。"}]}],"synonyms":["predestination","preordination","foreordination","fate","destiny"],"phonetic":"/ˌpriːˌɔrˈdeɪnmənt/","extraExplanation":["“preordainment”多见于宗教或哲学语境，语气通常比“plan（计划）”更强，强调“在你行动之前就已注定”。日常英语里更常用“predestination（宿命/预定）”或“preordination”。","词源上由“pre-（预先）+ ordain（任命/规定/授予神圣职分）”构成，因此它常带有“神意安排、神圣命定”的色彩。"]}
{"word":"preordains","summary":{"en":"“Preordains” means “decides in advance; predestines.”","zh":"“preordains”意为“预先决定；注定”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of preordain) to decide or arrange something in advance, as if by fate or a higher power.","zh":"（preordain 的第三人称单数）预先决定；（仿佛由命运或更高力量）注定。"},"examples":[{"en":"Some people believe God preordains every event in our lives.","zh":"有些人相信上帝预先安排了我们生命中的每一件事。"},{"en":"The story suggests that fate preordains the hero’s final choice.","zh":"这个故事暗示命运早已注定了英雄最后的选择。"},{"en":"She refuses to think that her future is preordained; she wants to shape it herself.","zh":"她拒绝认为自己的未来是注定的；她想靠自己去塑造。"}]}],"synonyms":["predestines","foreordains","destines","ordains","decrees"],"phonetic":"/ˌpriɔrˈdeɪnz/","extraExplanation":["“preordain”常见于宗教或哲学语境，尤其与“predestination（预定论）”相关：强调人的命运或结局在出生前就已被决定。日常写作中也可较文学化地表示“似乎早已注定”。"]}
{"word":"preorder","summary":{"en":"“Preorder” means ordering something before it is officially released; it can be a verb (to preorder) or a noun (a preorder).","zh":"“preorder”指在商品正式发售前预订/提前下单；既可作动词（预订），也可作名词（预购订单）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to order (a product) in advance before it is available for general sale","zh":"（在商品正式发售前）预订、提前下单"},"examples":[{"en":"You can preorder the new phone today, and it ships next month.","zh":"你今天就可以预订这款新手机，下个月发货。"},{"en":"I preordered the book so I’ll get it on release day.","zh":"我预订了这本书，这样发售当天就能拿到。"}]},{"partOfSpeech":"n.","definition":{"en":"an order placed in advance for a product not yet released","zh":"预购订单；预订（尚未发售的商品）"},"examples":[{"en":"The game has thousands of preorders already.","zh":"这款游戏已经有成千上万的预购订单了。"},{"en":"Your preorder includes a bonus item.","zh":"你的预购包含一个赠品。"}]}],"synonyms":["pre-order","order in advance","advance order","reserve"],"phonetic":"/ˌpriːˈɔːrdər/","extraExplanation":["“preorder”常见于电商、游戏、电影票、演唱会等语境。预订通常会涉及：定金/全款、预计发货或到货时间、取消与退款规则（不同平台差异很大）。","拼写上也常见作“pre-order”（带连字符），意思相同；作动词用“to preorder”，作名词用“a preorder”。"]}
{"word":"preordered","summary":{"en":"“Preordered” means someone already placed an advance order for something before it’s released.","zh":"“preordered”表示某物在正式发售/上市前已经被提前下单预订了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “preorder”: to order something before it is officially available (often online).","zh":"“preorder”的过去式/过去分词：在商品正式上市或发售前（常见于线上）提前下单预订。"},"examples":[{"en":"I preordered the new game months ago.","zh":"我几个月前就预订了那款新游戏。"},{"en":"The phones were preordered online before the launch event.","zh":"这些手机在发布会之前就已在网上被预订了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Already ordered in advance; reserved by ordering before release.","zh":"（形容词）已提前下单预订的；预售前已订购的。"},"examples":[{"en":"Your preordered copy will ship on release day.","zh":"你预订的那份会在发售当天发货。"},{"en":"Preordered items may arrive later than expected due to high demand.","zh":"由于需求量大，预订商品可能会比预期更晚到货。"}]}],"synonyms":["ordered in advance","reserved","pre-purchased"],"phonetic":"/ˌpriːˈɔrdɚd/","extraExplanation":["在电商和游戏/数码产品领域，“preorder（预订/预购）”很常见：商家用它来估算销量、安排生产与库存。预订通常可能包含“定金/全款”“发售日发货”“限量赠品”等条款，购买前可以留意取消政策（cancellation policy）与预计发货时间（estimated shipping date）。"]}
{"word":"preordering","summary":{"en":"Preordering means ordering something in advance (or the advance order itself).","zh":"preordering 指提前预订/预购（或指该预购订单本身）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to order (something) in advance, often before it is officially available","zh":"（在正式上市或可获得之前）预订、提前下单"},"examples":[{"en":"I’m preordering the new game so I can play it on release day.","zh":"我在预订这款新游戏，这样发售当天就能玩。"},{"en":"Many fans preordered tickets months before the concert.","zh":"很多粉丝在演唱会前几个月就预订了门票。"}]},{"partOfSpeech":"n.","definition":{"en":"an order placed in advance for something that will be available later","zh":"预购订单；预订（指提前下的订单）"},"examples":[{"en":"The phone already has a million preorders.","zh":"这款手机已经有一百万个预购订单了。"},{"en":"Your preorder will ship next week.","zh":"你的预购订单下周发货。"}]}],"synonyms":["ordering ahead","advance order","preorder","pre-order"],"phonetic":"/ˌpriːˈɔrdərɪŋ/","extraExplanation":["“preorder / pre-order”常见于电商、游戏、电影票、演唱会门票等场景。口语里也会说“place a preorder”（下预购单）或“available for preorder”（开放预订）。","写法上“preorder”“pre-order”都常见；作名词时常用复数“preorders”。"]}
{"word":"preordinance","summary":{"en":"Preordinance is a rare noun meaning “preordination/predestination”—something decided in advance, often by God.","zh":"Preordinance 是罕见名词，意为“预先决定/预定（宿命）”，常见于宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; often considered a misspelling or variant of “preordination”) the act of deciding or arranging something in advance, especially by God; predestination.","zh":"（罕见；常被视为“preordination”的拼写变体）预先决定或预先安排（尤指上帝的安排）；宿命、预定。"},"examples":[{"en":"In some religious writings, preordinance is used to mean that God has already planned a person’s fate.","zh":"在一些宗教著作中，preordinance 用来表示上帝已预先安排人的命运。"},{"en":"They debated whether human choice can exist alongside preordinance.","zh":"他们讨论人的选择是否能与预定（preordinance）并存。"}]}],"synonyms":["preordination","predestination","foreordination","divine decree"],"phonetic":"/ˌpriːˈɔːrdɪnəns/","extraExplanation":["“Preordinance”在现代英语中非常少见，更多情况下你会看到 **preordination** 或 **predestination**。在神学语境（如加尔文主义相关讨论）里，它通常指“上帝预先拣选/预定”。","不要把它和 **ordinance**（法令；条例）混淆：ordinance 更偏法律/规章；preordinance/preordination 更偏“预先决定（常带宗教意味）”。"]}
{"word":"preordination","summary":{"en":"Preordination means being decided in advance—especially in theology, God’s prior decision about events or salvation.","zh":"Preordination 指“预先定下、预先决定”，尤指神学中上帝对事件或得救与否的预先决定（预定论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In theology) the belief that God decided in advance what would happen, especially who would be saved; predestination.","zh":"（神学）预先定命；上帝预先决定将发生什么，尤指谁将得救（即“预定论”）。"},"examples":[{"en":"In some Christian traditions, preordination means that God chooses who will be saved.","zh":"在一些基督教传统中，“preordination”指上帝拣选谁将得救。"},{"en":"The debate about preordination and free will has lasted for centuries.","zh":"关于预先定命与自由意志的争论持续了几个世纪。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of deciding or arranging something in advance; prior planning or determination.","zh":"预先决定；预先安排（指提前作出的决定或规划）。"},"examples":[{"en":"The outcome felt like preordination rather than coincidence.","zh":"这个结果让人感觉像是早已注定，而不是巧合。"},{"en":"They rejected the idea of preordination and argued that choices shape a person’s life.","zh":"他们反对“预先注定”的观念，认为选择塑造人生。"}]}],"synonyms":["predestination","foreordination","prearrangement","prior determination"],"phonetic":"/ˌpriːˌɔːr.dəˈneɪ.ʃən/","extraExplanation":["该词常见于宗教与哲学语境，尤其与“predestination（预定论）”紧密相关。日常英语里更常用 predestination；preordination 略显正式、书面或神学色彩更强。","构词上，pre- 表示“预先”，ordination 来自“安排/任命/制定秩序”的含义，因此整体有“预先安排、预先定下”的感觉。"]}
{"word":"preorganic","summary":{"en":"Preorganic means “before life/organic organisms existed,” especially in discussions of early Earth or origin-of-life chemistry.","zh":"preorganic 指“有机生命出现之前的”，常用于早期地球或生命起源化学等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before life (organic organisms) appeared; relating to Earth’s early, lifeless stage.","zh":"有机生命出现之前的；与地球早期无生命阶段有关的。"},"examples":[{"en":"Scientists study preorganic Earth to understand how life could begin.","zh":"科学家研究前有机生命时期的地球，以了解生命如何可能起源。"},{"en":"Some rocks preserve chemical clues from a preorganic environment.","zh":"一些岩石保留了来自前有机环境的化学线索。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Referring to chemical conditions or reactions that occur before organic compounds or biological systems form; often similar in meaning to “prebiotic.”","zh":"（化学）指在有机化合物或生物系统形成之前的化学条件或反应；常与“prebiotic（生命起源前的）”含义相近。"},"examples":[{"en":"The experiment modeled preorganic chemistry in the early ocean.","zh":"该实验模拟了早期海洋中的前有机化学过程。"},{"en":"Researchers compared preorganic reactions with later, life-driven processes.","zh":"研究人员将前有机反应与后期由生命驱动的过程进行比较。"}]}],"synonyms":["prebiotic","abiotic","primordial","inorganic"],"phonetic":"/ˌpriːɔrˈɡænɪk/","extraExplanation":["“preorganic”在现代日常英语中很少见，更多出现在地质学、天体生物学（astrobiology）和生命起源研究的学术语境里。","写作中更常见的替代词是“prebiotic（生命出现之前的）”“primordial（原始的、早期的）”或“abiotic（非生物的）”。选择哪个词取决于你强调的是“生命前的化学”（prebiotic/preorganic）还是“非生物因素”（abiotic）。"]}
{"word":"preorganically","summary":{"en":"Preorganically means “before organic matter or life forms existed,” mainly used in scientific contexts.","zh":"preorganically 指“在有机物或生命出现之前”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens before organic matter, living organisms, or organic development exists or forms.","zh":"以（在）有机物、生命体或有机发展出现/形成之前的方式；在前有机阶段地。"},"examples":[{"en":"Some scientists discuss how Earth’s atmosphere may have changed preorganically, before life began.","zh":"一些科学家讨论地球大气在前有机阶段如何变化，也就是生命开始之前。"},{"en":"The experiment aims to model preorganically produced molecules under early-Earth conditions.","zh":"该实验旨在模拟早期地球条件下前有机阶段生成的分子。"}]}],"synonyms":["prebiotically","before life began","in a prebiotic way"],"phonetic":"/ˌpriːɔrˈɡænɪkli/","extraExplanation":["“preorganically”不是日常英语高频词，更多见于学术语境，尤其是生命起源研究（origin of life）、前生物化学（prebiotic chemistry）、地质与行星科学等领域，用来强调“在生命/有机系统出现之前”的时间阶段或过程。","词形上可理解为 pre-（在……之前）+ organically（以有机方式/在有机体系中）。在写作中常与 before life began、early Earth、prebiotic 等词搭配。"]}
{"word":"preorganization","summary":{"en":"Preorganization means organizing in advance; in science, it also means a structure already arranged to bind or react efficiently.","zh":"Preorganization 指“预先组织”；在科学语境中也指“在结合或反应前就已排列好的有利结构”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of organizing something in advance; planning structures, roles, or steps before the main work begins","zh":"预先组织；在正式开始前先把结构、角色或步骤安排好"},"examples":[{"en":"Good preorganization made the event run smoothly.","zh":"良好的预先组织让活动进行得很顺利。"},{"en":"The team focused on preorganization—setting deadlines and assigning tasks—before writing the report.","zh":"团队在写报告前先做预先组织——设定截止日期并分配任务。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in chemistry/biology) a structure that is already arranged in a useful shape before binding or reacting, making interaction easier and more efficient","zh":"（尤用于化学/生物）预组织状态；在结合或反应前就已排列成有利构型，从而更容易、更高效地相互作用"},"examples":[{"en":"Preorganization of the molecule helps it bind strongly to the target.","zh":"分子的预组织状态帮助它与靶标更牢固地结合。"},{"en":"Researchers design receptors with preorganization to improve selectivity.","zh":"研究人员设计具有预组织特征的受体，以提高选择性。"}]}],"synonyms":["pre-planning","advance planning","prearrangement","preparation"],"phonetic":"/ˌpriːˌɔrɡənəˈzeɪʃən/","extraExplanation":["在日常英语里，preorganization 比较少见，更常用的是 pre-planning（预先规划）、advance planning（提前规划）或 preparation（准备工作）。","在超分子化学（supramolecular chemistry）中，preorganization 是一个常用概念：如果受体/主体分子在结合前就“预先摆好姿势”，通常会减少构象变化带来的能量代价，从而提升结合强度与选择性。"]}
{"word":"preorganize","summary":{"en":"Preorganize means to organize something ahead of time.","zh":"preorganize 指“提前把事情组织/整理好”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to organize or arrange something in advance, before an event or task begins","zh":"在开始之前预先组织、安排（某事）"},"examples":[{"en":"Let’s preorganize the files so we can work faster tomorrow.","zh":"我们先把文件预先整理好，这样明天就能更快工作。"},{"en":"The teacher preorganized the materials for the group activity.","zh":"老师为小组活动提前把材料准备并分好类。"}]}],"synonyms":["organize in advance","prepare in advance","plan ahead","arrange ahead of time"],"phonetic":"/ˌpriːˈɔrɡənaɪz/","extraExplanation":["“pre-”是常见前缀，表示“在……之前/预先”。因此 preorganize = pre-（预先）+ organize（组织、整理）。在正式写作中，更常见的表达是 “organize in advance / plan ahead / prepare in advance”。"]}
{"word":"preorganized","summary":{"en":"Preorganized means prepared and organized ahead of time.","zh":"preorganized 指“提前准备并整理好的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"arranged, planned, or structured in advance (before something happens), so it is ready to use or follow.","zh":"事先组织好的；预先安排/规划好的（在事情发生前就已准备就绪）。"},"examples":[{"en":"The workshop includes preorganized activities, so participants can start right away.","zh":"这次工作坊包含预先安排好的活动，因此参与者可以立刻开始。"},{"en":"She brought a preorganized folder with all the documents labeled by date.","zh":"她带来一个预先整理好的文件夹，所有文件都按日期贴好标签。"},{"en":"Using a preorganized schedule helps reduce stress during busy weeks.","zh":"使用预先排好的日程表能在繁忙的几周里减轻压力。"}]}],"synonyms":["prearranged","preplanned","prestructured","organized in advance","prepared"],"phonetic":"/ˌpriːˈɔrɡənaɪzd/","extraExplanation":["“preorganized”由前缀“pre-（预先）”+“organized（有条理的/整理好的）”构成，常用于强调“在开始之前就已经整理完成”。在更正式或学术写作里，也可能看到类似表达如“prearranged / preplanned / prestructured”。"]}
{"word":"preorganizing","summary":{"en":"Preorganizing means organizing or planning something ahead of time.","zh":"preorganizing 指“提前组织/规划/准备”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “preorganize”) arranging, planning, or setting up something in advance so it runs smoothly later.","zh":"（动词 preorganize 的现在分词）事先把事情安排、规划或准备好，以便之后更顺利地进行。"},"examples":[{"en":"We are preorganizing the seating chart to avoid confusion on the day of the event.","zh":"我们正在提前安排座位表，避免活动当天混乱。"},{"en":"Preorganizing your files can save you a lot of time later.","zh":"提前整理文件可以为你之后省下很多时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"done in advance; used to describe planning or organizing that happens before the main activity.","zh":"提前完成的；用于描述在主要活动开始前进行的规划或整理。"},"examples":[{"en":"The team used a preorganizing checklist before the conference.","zh":"团队在会议前使用了一份提前准备的清单。"},{"en":"Her preorganizing habits make group projects easier.","zh":"她提前规划的习惯让小组项目更轻松。"}]}],"synonyms":["planning ahead","organizing in advance","preparing","arranging"],"phonetic":"/ˌpriːˈɔːrɡənaɪzɪŋ/","extraExplanation":["“preorganize / pre-organize”在日常英语里不算非常常见；更自然的表达常用“organize in advance / plan ahead / get things organized beforehand”。写作中也常见拼写为“pre-organizing”（加连字符）。"]}
{"word":"preoriginal","summary":{"en":"“Preoriginal” (rare) means earlier than the original or an earliest accepted form.","zh":"“preoriginal”（罕用）指“比原版/原始形态更早的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before the “original”; earlier than the earliest accepted version (rare).","zh":"（罕用）在“原始/原版”之前就已存在或发生的；比公认的最早版本还早的。"},"examples":[{"en":"The author found a preoriginal draft that shows how the story first took shape.","zh":"作者找到了一份更早的草稿，显示这个故事最初是如何成形的。"},{"en":"Some researchers argue there was a preoriginal form of the legend shared orally.","zh":"一些研究者认为这个传说在口头传播阶段就有一个更早的形态。"}]}],"synonyms":["pre-original","earlier","prior","proto-","preexisting","primitive"],"phonetic":"/ˌpriːəˈrɪdʒənəl/","extraExplanation":["“preoriginal”在现代英语中非常少见，更多时候会写成“pre-original”，或直接用更常见、更自然的表达：earliest / prior / earlier version, proto-, preexisting 等。","词缀角度：pre- 表示“在……之前”，original 表示“原始的/原版的”。把两者合在一起，强调“比原版还早”。在学术语境（如文献学、神话学、版本学）偶尔会见到类似造词。"]}
{"word":"preoriginally","summary":{"en":"“Preoriginally” is rare and nonstandard; it sometimes means “before the original version,” but it’s often a mistaken form of “previously” or “originally.”","zh":"“preoriginally”很少见且非标准；有时指“在原版之前”，但更常是把“previously（先前）”或“originally（最初）”写错了。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare, nonstandard) Before the original version or source existed; at an earlier stage than what is considered the “original.”","zh":"（罕见、非标准用法）在“原始版本/原始来源”出现之前；比被视为“原版”的阶段更早。"},"examples":[{"en":"In some editing notes, “pre-originally” is used to describe an earlier draft before the version treated as the original.","zh":"在一些编辑说明里，“pre-originally”用来指被当作原版之前的更早草稿。"},{"en":"The archive lists a pre-originally recorded outline that later became the main document.","zh":"档案中列出了一份“原版”之前记录的提纲，后来发展成了正文。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Often a mistake) Used when someone actually means “previously,” “earlier,” or “originally.”","zh":"（常见为误用）有人用它其实想表达“先前/更早/最初”。"},"examples":[{"en":"Nonstandard: The file was preoriginally saved on my old laptop. (Better: previously/originally.)","zh":"非标准：这个文件 preoriginally 保存在我的旧电脑里。（更好：previously/originally）"},{"en":"Nonstandard: The song was preoriginally written for a movie. (Better: originally.)","zh":"非标准：这首歌 preoriginally 为电影创作。（更好：originally）"}]}],"synonyms":["previously","earlier","beforehand","originally (often intended)","prior to the original (sense)"],"phonetic":"/ˌpriːəˈrɪdʒənəli/","extraExplanation":["“preoriginally”几乎不出现在主流词典里；更常见的形式是带连字符的“pre-originally”，而且多见于学术写作、文本校勘或版本比较的语境，用来讨论“被当作原版之前的材料/阶段”。","如果你只是想说“先前”“更早”，通常用 previously / earlier；想说“最初/原本”，用 originally。"]}
{"word":"preornamental","summary":{"en":"Preornamental means “before ornamentation,” often used in archaeology, art history, or design to describe an early, undecorated stage.","zh":"preornamental 指“装饰之前的/装饰前阶段的”，常用于考古、艺术史或设计语境，强调发展早期尚未出现装饰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing before ornamentation or decorative details are added; relating to an early stage before something becomes decorative.","zh":"装饰之前的；指在添加装饰细节之前的早期阶段。"},"examples":[{"en":"The architect showed a preornamental sketch to explain the building’s basic shape.","zh":"建筑师展示了一张装饰前的草图，用来说明建筑的基本形状。"},{"en":"Archaeologists described the pot as preornamental, made before the culture developed complex patterns.","zh":"考古学家说这只陶罐属于装饰前阶段，制作时该文化尚未发展出复杂纹样。"}]},{"partOfSpeech":"adj.","definition":{"en":"In art history or archaeology, describing a period or style that comes before a tradition of ornament or pattern becomes common.","zh":"（艺术史/考古）指某一时期或风格处在“尚未普遍发展装饰/纹样传统”的阶段。"},"examples":[{"en":"The exhibition moves from preornamental tools to highly decorated ceremonial objects.","zh":"展览从装饰前的工具过渡到高度装饰的礼仪器物。"},{"en":"Some scholars argue the settlement belonged to a preornamental phase of the region’s craft tradition.","zh":"一些学者认为该聚落属于该地区工艺传统的装饰前阶段。"}]}],"synonyms":["pre-decorative","undecorated","unadorned","plain"],"phonetic":"/ˌpriˌɔrnəˈmɛntəl/","extraExplanation":["“pre-”表示“在……之前”，“ornamental”表示“装饰性的”。因此 preornamental 多用于学术语境（如考古、艺术史、设计过程），强调“时间/发展阶段在装饰出现之前”，而不只是“看起来朴素”。日常英语里更常说 unadorned（未加修饰的）或 plain（朴素的）。"]}
{"word":"preost","summary":{"en":"Presto means “suddenly/right away,” and it’s also used as a magician’s word and a music term meaning “very fast.”","zh":"Presto 表示“突然/立刻”，也可作魔术口头禅；在音乐中表示“极快”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(used to show something happens quickly or as if by magic) suddenly; right away.","zh":"（表示事情发生得很快或像变魔法一样）突然地；立刻。"},"examples":[{"en":"He typed a few keys and—presto—the file appeared.","zh":"他敲了几下键盘——瞧，文件立刻就出现了。"},{"en":"Add hot water, stir, and presto: instant soup.","zh":"加热水、搅拌一下，瞧：速食汤就好了。"}]},{"partOfSpeech":"n.","definition":{"en":"a word said by performers to suggest a magic trick is happening.","zh":"（表演者用的）表示“变魔术啦”的口头禅。"},"examples":[{"en":"The magician waved the wand and said, “Presto!”","zh":"魔术师挥了挥魔杖，说：“Presto！”"}]},{"partOfSpeech":"other","definition":{"en":"(music) a tempo marking meaning “very fast.”","zh":"（音乐术语）速度记号，表示“极快”。"},"examples":[{"en":"This section is marked presto, so it should be played very fast.","zh":"这一段标注为presto，所以要弹得很快。"}]}],"synonyms":["instantly","immediately","at once","in a flash"],"phonetic":"/ˈprɛstoʊ/","extraExplanation":["你输入的“preost”很可能是拼写错误，常见正确拼写是“presto”。“presto”来自意大利语，在音乐里非常常见（如“Allegro”“Presto”等）。在日常英语中，它常用于轻松幽默的语气，表示“立刻就搞定/像变魔法一样”。"]}
{"word":"preotic","summary":{"en":"Preotic means “in front of the ear,” mainly used in anatomy/biology.","zh":"preotic 指“耳前的/位于耳朵前方的”，主要用于解剖与生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(anatomy, biology) Located in front of the ear; relating to the area before the ear (especially in embryos or skull anatomy).","zh":"（解剖/生物）耳前的；位于耳朵前方的（尤用于胚胎或颅骨解剖位置描述）。"},"examples":[{"en":"In early development, several preotic structures form before the ear region is fully defined.","zh":"在早期发育中，一些耳前结构会在耳区完全成形之前出现。"},{"en":"The report describes a preotic swelling along the side of the head.","zh":"报告描述了头部侧面出现的耳前肿胀。"}]}],"synonyms":["preauricular","anterior to the ear"],"phonetic":"/priˈɑtɪk/","extraExplanation":["“pre-”表示“在……之前/在……前方”，“-otic”与“耳（ear）”相关（如 otic capsule 指“耳囊/耳部结构”）。因此 preotic 多用于学术语境，日常英语更常说 in front of the ear 或 preauricular（耳前的）。","容易与 prebiotic（益生元）混淆：prebiotic 是营养/肠道健康领域的常用词；preotic 则是解剖位置术语，含义不同。"]}
{"word":"preoutfit","summary":{"en":"“Preoutfit” is an informal word for an outfit you plan or prepare ahead of time.","zh":"“preoutfit”是个非正式说法，指你提前想好或准备好的穿搭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) An outfit planned or prepared in advance, especially before an event (often used in fashion/social media contexts).","zh":"（非正式）提前搭配或准备好的穿搭，尤指为参加活动而事先想好的整套衣服（常见于时尚/社交媒体语境）。"},"examples":[{"en":"I always choose my preoutfit the night before a big meeting.","zh":"重要会议前一晚我总会把预先搭好的穿搭选好。"},{"en":"She posted her preoutfit ideas for the concert on TikTok.","zh":"她在 TikTok 上发了音乐会的预先穿搭灵感。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/Informal) To plan or pick an outfit in advance.","zh":"（较少见/非正式）提前规划或选定穿搭。"},"examples":[{"en":"We preoutfited for the wedding so we wouldn’t rush in the morning.","zh":"我们为了婚礼提前把穿搭定好，这样早上就不用赶。"}]}],"synonyms":["planned outfit","outfit planned in advance","pre-planned outfit","look (fashion)"],"phonetic":"/ˌpriːˈaʊtˌfɪt/","extraExplanation":["“preoutfit”更像是网络造词/口语写法，常见形式也会写成“pre-outfit”或更自然地说“planned outfit / outfit planned in advance”。","在英语里“pre-”常作前缀表示“预先的”（如 pregame 赛前聚会、preorder 预订）。把它接到 outfit 上属于比较口语、社媒风格的用法，正式写作中建议换成更标准表达。"]}
{"word":"preoutfitted","summary":{"en":"“Preoutfitted” means already equipped in advance with needed items or features.","zh":"“preoutfitted”指“提前就已配齐所需装备或配置”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"equipped or supplied in advance with the necessary items, features, or gear (often before delivery or before an activity begins).","zh":"预先配备（装备/配置）好的；提前装配齐全的（常指在交付前或活动开始前就已准备好所需物品或功能）。"},"examples":[{"en":"The cabins come preoutfitted with basic cookware and bedding.","zh":"这些小木屋在交付时就已经预先配好了基本的炊具和床品。"},{"en":"We rented a preoutfitted van for the road trip, so we didn’t need to buy extra camping gear.","zh":"我们租了一辆预先配齐装备的面包车去公路旅行，所以不用再买额外的露营装备。"},{"en":"The lab ordered preoutfitted kits to make training new staff faster.","zh":"实验室订购了预先配好的工具包，以加快新员工培训。"}]}],"synonyms":["pre-equipped","fully equipped","ready-equipped","kitted out","preconfigured"],"phonetic":"/ˌpriːˈaʊtˌfɪtɪd/","extraExplanation":["“preoutfitted”由前缀 pre-（预先）+ outfit（配备装备）+ -ed 组成，常作形容词使用，语气偏书面或产品/商业描述。日常口语里也常用 “already equipped” 或 “fully equipped”。","拼写上也可能见到 “pre-outfitted”（带连字符）这一更清晰的写法，尤其在广告文案或技术说明中。"]}
{"word":"preoutfitting","summary":{"en":"Preoutfitting means pre-installing equipment and systems—especially in shipbuilding—before final assembly or launching.","zh":"Preoutfitting 指在最终总装或下水前（尤指造船）预先安装设备与系统的“预舾装”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of installing equipment, systems, or components into a structure (especially a ship) before the final assembly or before launching, so later work is faster and safer","zh":"（尤指造船中）在最终总装或下水之前，预先安装设备、系统或部件的过程；以便后续施工更快、更安全"},"examples":[{"en":"Preoutfitting allows crews to install pipes and cables while the ship sections are still easy to access.","zh":"预舾装让工人在船体分段仍便于进入时就安装管路和电缆。"},{"en":"The yard increased preoutfitting to reduce work done after the vessel was launched.","zh":"船厂提高预舾装比例，以减少船舶下水后的施工量。"}]},{"partOfSpeech":"v.","definition":{"en":"to carry out preoutfitting work; to pre-install equipment or systems before final assembly (mainly used in technical writing)","zh":"进行预舾装；在最终总装前预先安装设备或系统（多见于技术语境）"},"examples":[{"en":"They preoutfitted the engine room with major pumps before joining the hull blocks.","zh":"他们在合拢分段前，先在机舱内预装了主要泵组。"},{"en":"The modules are preoutfitted in the workshop and then lifted into place.","zh":"这些模块在车间完成预装，然后吊装就位。"}]}],"synonyms":["pre-installation","prefabrication outfitting","modular outfitting","advance outfitting"],"phonetic":"/ˌpriːˈaʊtˌfɪtɪŋ/","extraExplanation":["“Preoutfitting”多用于造船/海工等行业，常与“block construction（分段建造）”一起出现：先在分段或模块阶段把管系、电缆桥架、阀门、通风、舾装件等装好，再进行合拢与总装。","相关常见指标：preoutfitting rate（预舾装率），指在总装前完成的舾装工作占比；提高预舾装率通常能缩短工期、降低高空/狭小空间作业风险。","词形上是 pre-（预先）+ outfitting（舾装/配装）。在一般日常英语中不常见，更多属于工程术语。"]}
{"word":"preoutline","summary":{"en":"“Preoutline” means to outline something in advance—to plan the main points before writing or presenting.","zh":"“preoutline”指在正式写作或展示之前先把要点列成提纲、提前规划结构。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a rough outline in advance; to plan the main points before writing or presenting","zh":"（在正式写作或展示前）预先列提纲；先把要点大致规划出来"},"examples":[{"en":"Before she wrote the essay, she preoutlined her main arguments on a blank page.","zh":"写论文前，她先在空白纸上预先列出了主要论点。"},{"en":"Let’s preoutline the meeting agenda so we don’t miss anything.","zh":"我们先把会议议程预先列个提纲，这样就不会漏掉内容。"},{"en":"The teacher asked students to preoutline their stories before drafting.","zh":"老师让学生在起草前先把故事预先列提纲。"}]}],"synonyms":["pre-outline","outline beforehand","make an outline first","pre-plan"],"phonetic":"/ˌpriːˈaʊtlaɪn/","extraExplanation":["“preoutline”在现代英语里不算特别常见，更常见的表达是“outline first / make an outline beforehand / pre-plan the outline”。在正式写作中也常写作“pre-outline”（加连字符）。","词根拆解：pre- 表示“在……之前”，outline 表示“提纲/概述”。意思很直观：在正式展开之前先做一个大纲。"]}
{"word":"preoutlined","summary":{"en":"Preoutlined means outlined in advance (or the past form of preoutline).","zh":"preoutlined 表示“事先列好提纲的”，也可作动词 preoutline 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Already outlined or sketched in advance; having the main points planned before writing or doing something.","zh":"（形容词）事先已经列好提纲的；预先勾勒出要点的。"},"examples":[{"en":"The report followed a preoutlined structure, so it was easy to read.","zh":"这份报告采用了事先列好的结构，所以很容易阅读。"},{"en":"With a preoutlined lesson plan, the teacher moved smoothly from one topic to the next.","zh":"有了预先写好的教学提纲，老师能很顺畅地从一个主题过渡到下一个。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Simple past/past participle of preoutline: to outline something beforehand.","zh":"（动词）preoutline 的过去式/过去分词：在开始之前先为某事列提纲。"},"examples":[{"en":"She preoutlined her essay before writing the first paragraph.","zh":"她在写第一段之前先把文章提纲列好了。"},{"en":"We had preoutlined the meeting agenda, so the discussion stayed on track.","zh":"我们事先拟好了会议议程，所以讨论没有跑题。"}]}],"synonyms":["outlined in advance","already outlined","preplanned","mapped out","sketched out"],"phonetic":"/ˌpriːˈaʊtˌlaɪnd/","extraExplanation":["“pre-”表示“预先、在……之前”（如 prepay 预付、preheat 预热）；“outline”是“提纲/概述”。所以“preoutlined”常用于写作、报告、课程设计等语境，强调“在正式开始前已把结构和要点搭好”。","在实际英语中，“preoutlined”不算特别常见；更常见的表达是“already outlined”“outlined in advance”或“a pre-written outline / an outline prepared in advance”。"]}
{"word":"preoutlining","summary":{"en":"Preoutlining means outlining in advance to plan the structure before writing or presenting.","zh":"preoutlining 指在写作或演示前先预先列出结构大纲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making an outline in advance (before writing, speaking, designing, or planning something)","zh":"预先列大纲；在开始写作/演讲/设计/规划之前先做框架"},"examples":[{"en":"Preoutlining helps me organize my ideas before I start writing the essay.","zh":"预先列大纲能帮助我在开始写论文前把想法整理清楚。"},{"en":"The team did some preoutlining to decide the main points for the presentation.","zh":"团队先预先列大纲，确定演示的要点。"}]},{"partOfSpeech":"v.","definition":{"en":"to outline in advance; to sketch the main structure before working in detail","zh":"预先概述；在展开细节之前先勾勒主要结构"},"examples":[{"en":"I preoutlined the report so each section would have a clear purpose.","zh":"我先把报告预先列了大纲，这样每一部分都有明确目的。"},{"en":"Before filming, the director preoutlined the story beats for each scene.","zh":"开拍前，导演先把每个场景的关键情节点预先列出来。"}]}],"synonyms":["outline in advance","make a preliminary outline","plan the structure","sketch an outline first"],"phonetic":"/ˌpriːˈaʊtˌlaɪnɪŋ/","extraExplanation":["“preoutlining”不是特别常见的固定词，更多时候人们会说“make an outline first / outline in advance / create a preliminary outline”。在学术写作、商业写作和内容创作中，这个动作很常见：先确定主题、主论点和分段结构，再补充证据与细节。"]}
{"word":"preoverthrew","summary":{"en":"“Preoverthrew” is not a standard word; it likely means “previously/had overthrown.” The standard form is “overthrew,” past tense of “overthrow.”","zh":"“preoverthrew”不是标准用词，多半想表达“先前/已经推翻”。标准形式是“overthrew”，为“overthrow（推翻/打翻）”的过去式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/rare form: usually read as “pre- + overthrew,” meaning “overthrew earlier/before something else.” In normal English, people would simply say “had overthrown” or “previously overthrew.”","zh":"非标准/罕见形式：通常可理解为“pre-（在……之前）+ overthrew（推翻）”，表示“更早/在某事之前就推翻了”。日常英语更常说“had overthrown”或“previously overthrew”。"},"examples":[{"en":"By the time the rebels arrived, the army had already overthrown the governor.","zh":"叛军到达时，军队已经推翻了总督。"},{"en":"If you mean “preoverthrew,” it’s clearer to write “previously overthrew” in an essay.","zh":"如果你想表达“preoverthrew”，在作文里写“previously overthrew（先前推翻）”会更清楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense of “overthrow”: to remove a ruler/government from power by force.","zh":"“overthrow”的过去式：用武力推翻统治者或政府，使其下台。"},"examples":[{"en":"The revolution overthrew the king in 1911.","zh":"1911年的革命推翻了国王。"},{"en":"They tried to overthrow the regime, but failed.","zh":"他们试图推翻政权，但失败了。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense of “overthrow”: to defeat completely or knock down/turn over.","zh":"“overthrow”的过去式：彻底击败；（把东西）打翻、掀翻。"},"examples":[{"en":"The champion was overthrown by a younger fighter.","zh":"冠军被一位更年轻的选手击败了。"},{"en":"The strong wind overthrew several trees.","zh":"大风刮倒了好几棵树。"}]}],"synonyms":["overthrew","toppled","ousted","deposed","dethroned","overturned"],"phonetic":"/ˌoʊvərˈθruː/","extraExplanation":["“pre-”作前缀常表示“在……之前”（如 prewar 战前、preexisting 先前存在的）。但把“pre-”直接加在一个过去式动词 overthrew 前面几乎不这么用，所以“preoverthrew”看起来更像拼写错误或临时造词。","如果你想表达“在更早之前就已经推翻”，英语更自然的表达是：had overthrown（过去完成时）、previously/earlier overthrew（副词修饰）、the pre-overthrow period（名词短语：推翻前时期）。"]}
{"word":"preoverthrow","summary":{"en":"Preoverthrow means ‘before an overthrow,’ often describing the time or conditions before a regime or leader was removed.","zh":"preoverthrow 意为“政权/统治者被推翻之前的”，常用来描述被推翻前的时期或状况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing, happening, or referring to the period before a government or ruler is overthrown.","zh":"指在（政府或统治者）被推翻之前的；发生在推翻之前的。"},"examples":[{"en":"The museum has photos from the preoverthrow era.","zh":"博物馆里有一些来自政权被推翻之前时期的照片。"},{"en":"Preoverthrow policies were very different from what came after the revolution.","zh":"推翻之前的政策与革命之后的政策非常不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) Happening before a major removal or defeat of a person in power (not necessarily a government).","zh":"（更广义）指在掌权者被赶下台或失势之前的（不一定是政府层面）。"},"examples":[{"en":"In the biography, the author compares his preoverthrow and postoverthrow leadership styles.","zh":"在传记中，作者比较了他下台前与下台后的领导风格。"}]}],"synonyms":["pre-coup","pre-revolutionary","before the overthrow","prior to the overthrow"],"phonetic":"/ˌpriːˈoʊvərˌθroʊ/","extraExplanation":["“preoverthrow”不是非常常见的标准词，更多是写作中为强调时间顺序而临时组合出来的形容词（pre- + overthrow）。在正式写作里也常用更自然的表达，如“before the overthrow / prior to the overthrow / pre-coup / pre-revolutionary”。"]}
{"word":"preoverthrowing","summary":{"en":"“Preoverthrowing” means “before an overthrow,” but it’s uncommon; “pre-overthrow” or “before the overthrow” is more natural.","zh":"“preoverthrowing”大致表示“推翻之前的”，但不常用；更自然的是“pre-overthrow”或“before the overthrow”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or existing before an overthrow (the removal of a government by force or sudden change).","zh":"发生在政权被推翻之前的；推翻前的（指以武力或突变方式更换政府之前的时期/状态）。"},"examples":[{"en":"The museum has a section on preoverthrowing politics and daily life.","zh":"博物馆有一个展区介绍推翻前的政治与日常生活。"},{"en":"Preoverthrowing tensions were already visible in the streets.","zh":"在推翻之前，街头的紧张气氛就已显现。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of overthrowing something, viewed as being planned or prepared in advance (rare; usually written with a hyphen).","zh":"预先策划/准备推翻某事的行为或过程（较少见；通常会写成带连字符的形式）。"},"examples":[{"en":"They were accused of pre-overthrowing planning against the regime.","zh":"他们被指控预先策划推翻该政权。"},{"en":"Most writers would say “planning an overthrow” rather than “preoverthrowing.”","zh":"大多数写作者会说“策划推翻（planning an overthrow）”，而不是“preoverthrowing”。"}]}],"synonyms":["pre-overthrow","before the overthrow","pre-coup","pre-revolution"],"phonetic":"/ˌpriːˌoʊvərˈθroʊɪŋ/","extraExplanation":["“preoverthrowing”不是很常见的标准词，更常见的写法是带连字符的“pre-overthrow”作定语（如：pre-overthrow government / pre-overthrow period），或直接用“before the overthrow”。","构词上是前缀“pre-（在……之前）”+ “overthrow（推翻）”。在学术写作、新闻或历史叙述中，为了清晰与正式，通常会优先选择“pre-overthrow + 名词”。"]}
{"word":"preoverthrown","summary":{"en":"Pre-overthrown means “from the period before a regime or ruler was overthrown.”","zh":"pre-overthrown 指“政权/统治者被推翻之前那段时期的（推翻前的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, usually written with a hyphen: pre-overthrown) Describing something that existed or happened before a government/ruler/system was overthrown.","zh":"（较少见，通常写作 pre-overthrown）形容某个事物发生在政权/统治者/制度被推翻之前；即“推翻前的”。"},"examples":[{"en":"The museum has a small collection of pre-overthrown royal portraits.","zh":"这家博物馆收藏了一小批政权被推翻前的王室肖像。"},{"en":"She studied pre-overthrown laws to understand what changed after the revolution.","zh":"她研究了政权被推翻前的法律，以了解革命后发生了哪些变化。"}]}],"synonyms":["pre-revolutionary","pre-coup","prewar (in similar time-before sense)","before the overthrow"],"phonetic":"/ˌpriː ˈoʊvərˌθroʊn/","extraExplanation":["“preoverthrown”本身并不是常见的标准拼写，更自然的写法是加连字符：pre-overthrown，意思是“在（某政权）被推翻之前的”。","英语里 pre- 常用来构成“……之前的”形容词（如 prewar 战前的、precolonial 殖民前的）。overthrown 是 overthrow 的过去分词，常见搭配是 “the overthrown regime（被推翻的政权）”。把二者合起来用于修饰名词时，加连字符更清晰。"]}
{"word":"preoviposition","summary":{"en":"Preoviposition means the time period before an animal (often an insect) starts laying eggs.","zh":"preoviposition 指（常見於昆蟲）開始產卵之前的那段時間。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The period of time before an animal—especially an insect—begins laying eggs (oviposition).","zh":"（生物學）產卵前期；指動物（尤其是昆蟲）開始產卵（oviposition）之前的一段時間。"},"examples":[{"en":"The preoviposition period in this moth lasts about three days after mating.","zh":"這種蛾在交配後的產卵前期大約持續三天。"},{"en":"Temperature can shorten the preoviposition period and increase egg-laying sooner.","zh":"溫度可能縮短產卵前期，讓產卵更早開始。"}]}],"synonyms":["pre-oviposition period","pre-laying period","pre-egg-laying period"],"phonetic":"/ˌpriːˌoʊvɪpəˈzɪʃən/","extraExplanation":["這個詞多見於昆蟲學、寄生蜂研究、害蟲生態與繁殖生物學。研究者常用「preoviposition period（產卵前期）」來描述成蟲羽化後到第一次產卵之間的時間，或交配後到開始產卵的時間（依研究定義而定）。","字面結構：pre-（在……之前）+ oviposition（產卵）。在論文或報告中常與 fecundity（繁殖力/產卵量）、longevity（壽命）、oviposition rate（產卵速率）一起討論。"]}
{"word":"preovulatory","summary":{"en":"Preovulatory means ‘before ovulation,’ often used in medical or fertility contexts.","zh":"preovulatory 指“排卵前的”，常用于医学或生育相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before ovulation (the release of an egg from the ovary).","zh":"排卵前的；发生在排卵（卵子从卵巢释放）之前的。"},"examples":[{"en":"Some people notice mild cramping during the preovulatory phase.","zh":"有些人在排卵前阶段会感觉到轻微的腹部痉挛。"},{"en":"Doctors may monitor preovulatory follicles during fertility treatment.","zh":"在生育治疗中，医生可能会监测排卵前的卵泡。"}]}],"synonyms":["before ovulation","follicular (phase)"],"phonetic":"/ˌpriː.ɑːv.jəˈleɪ.tɚ.i/","extraExplanation":["医学语境中常说“preovulatory phase（排卵前期）”，大致对应月经周期中从月经结束到排卵发生之前的一段时间；此时通常以卵泡发育和雌激素逐渐升高为特征。","也常见搭配：preovulatory follicle（排卵前卵泡）、preovulatory surge（排卵前激增，常指LH激增前后的阶段）。"]}

