{"word":"prequalification","summary":{"en":"Prequalification is an early screening to see if someone meets basic requirements before moving forward.","zh":"prequalification 指在正式进入下一步前进行的初步筛选/资格预审，以确认是否符合基本要求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of checking whether someone (or a company) meets basic requirements before they can move to a later stage (such as getting a loan, bidding on a project, or being hired).","zh":"（在进入下一阶段前）对个人或公司是否符合基本条件进行的预先审核/资格审查。"},"examples":[{"en":"The bank requires prequalification before you apply for a mortgage.","zh":"银行要求你在申请房贷之前先进行预审（预资格审查）。"},{"en":"Contractors must pass prequalification to bid on the public project.","zh":"承包商必须通过预资格审查才能投标这个公共项目。"}]}],"synonyms":["screening","initial assessment","eligibility check","pre-screening"],"phonetic":"/ˌpriː.kwɑː.lə.fəˈkeɪ.ʃən/","extraExplanation":["常见场景：\n1）贷款/信用：prequalification 通常指“初步评估”，多基于你提供的基本信息（收入、债务等），一般不如 preapproval（预批准）严格；preapproval 往往需要更深入的材料验证。\n2）招投标/采购：prequalification 常指“供应商/承包商资格预审”，用于筛掉不符合资质或经验要求的投标方。\n常见搭配：prequalification process（预审流程）、prequalification criteria（预审标准）、letter of prequalification（预审函/预资格证明）。"]}
{"word":"prequalified","summary":{"en":"Prequalified means approved in advance after a basic initial check, often for loans or selection processes.","zh":"Prequalified 指在初步审核基本条件后获得“预先认可/预审通过”，常用于贷款或筛选流程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"approved in advance (usually after an initial check of basic requirements), especially for a loan, job, or program","zh":"（通常在初步核查基本条件后）预先批准的；预审通过的（常用于贷款、工作或项目）"},"examples":[{"en":"I was prequalified for a mortgage, but I still need final approval.","zh":"我拿到了房贷预资格/预审通过，但仍需要最终批准。"},{"en":"Prequalified candidates will be invited to the next interview round.","zh":"预审通过的候选人会被邀请进入下一轮面试。"}]},{"partOfSpeech":"vt.","definition":{"en":"to check and approve someone or something in advance based on basic requirements","zh":"预先审查并初步认可（基于基本条件）"},"examples":[{"en":"The bank prequalified her for a $300,000 loan.","zh":"银行预先审查并初步认可她可贷30万美元。"},{"en":"Applicants are prequalified online before submitting documents.","zh":"申请人会先在网上进行预审，再提交材料。"}]}],"synonyms":["pre-screened","preselected","preapproved (often stronger)"],"phonetic":"/ˌpriːˈkwɑːləˌfaɪd/","extraExplanation":["在美国金融语境里，prequalified（预资格/预审）通常比 preapproved（预先批准）更“初步”。prequalification 往往基于自报信息或初步查询；preapproval 通常需要更严格的材料审核（如收入证明、信用报告），可信度更高。","常见搭配：prequalified for a mortgage/loan（房贷/贷款预审）、prequalified candidates/applicants（预审通过的候选人/申请人）。","词形：pre-（预先）+ qualified（符合条件的）。注意不要和 qualified（合格的）混用：qualified 表示已经具备能力/资质；prequalified 强调“提前筛选后初步符合”。"]}
{"word":"prequalify","summary":{"en":"Prequalify means to do an early check to see if someone is likely to qualify (often for a loan or program).","zh":"prequalify 指在正式流程前做初步审核，判断某人是否可能符合资格（常用于贷款或项目）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To check (a person or application) in advance to see if they are likely to meet the main requirements for a loan, program, job, or other opportunity.","zh":"（在正式申请前）预先审核/预资格审查（某人或申请），看是否大概率符合贷款、项目、工作等的主要条件。"},"examples":[{"en":"The bank can prequalify you for a mortgage in minutes.","zh":"银行可以在几分钟内为你做房贷预资格审查。"},{"en":"We prequalified applicants by reviewing their income and credit history.","zh":"我们通过查看收入和信用记录对申请者进行预先筛选。"},{"en":"I want to prequalify before I start house hunting.","zh":"我想在开始看房之前先做预资格审查。"}]}],"synonyms":["screen","vet","assess","pre-screen"],"phonetic":"/ˌpriːˈkwɑːləˌfaɪ/","extraExplanation":["常见于美国金融与招聘语境：prequalify 通常表示“初步判断是否符合条件”。它往往不等于正式批准（如房贷的正式批准常说 preapprove）。","构词法：pre-（在……之前）+ qualify（使符合资格/条件）。拼写也常见为 pre-qualify。"]}
{"word":"prequalifying","summary":{"en":"Prequalifying means checking basic eligibility in advance, or the preliminary stage where eligibility is tested.","zh":"Prequalifying 指提前核查基本资格，或指进行资格测试的预先阶段/预选资格赛。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Especially in lending, hiring, or competitions) checking in advance whether someone meets basic requirements before a full application or review.","zh":"（尤指贷款、招聘或竞赛中）在正式申请/审核之前，先行检查某人是否符合基本资格或条件。"},"examples":[{"en":"The bank is prequalifying customers to see who may qualify for a mortgage.","zh":"银行正在对客户进行预先资格审核，看看哪些人可能符合房贷条件。"},{"en":"The company is prequalifying candidates before scheduling interviews.","zh":"公司在安排面试前先对候选人进行预筛选。"}]},{"partOfSpeech":"n.","definition":{"en":"A process or stage where participants must meet requirements in advance (for example, in sports or contests).","zh":"（如体育或竞赛中的）预先资格赛/预先资格阶段；参赛者需先满足条件才能进入下一阶段。"},"examples":[{"en":"She advanced through prequalifying to reach the main tournament.","zh":"她通过预选资格赛晋级到正赛。"},{"en":"Teams must complete prequalifying before the final round.","zh":"队伍必须先通过预先资格阶段才能进入决赛圈。"}]}],"synonyms":["screening","pre-screening","eligibility check","vetting","preliminary round"],"phonetic":"/ˌpriːˈkwɑːlɪˌfaɪɪŋ/","extraExplanation":["“Prequalifying”常见于美国英语的金融与房贷语境：prequalify（预先资格评估）通常比 preapprove（预先批准）更“轻”，多依据你提供的基本信息做初步判断；preapprove 往往需要更严格的材料核验。","词形提示：pre- 表示“在……之前”，qualify 表示“使具备资格/符合条件”。在句子里既可作动词（is prequalifying），也可作名词（through prequalifying）。"]}
{"word":"prequarantine","summary":{"en":"“Prequarantine” is an informal word meaning “before quarantine,” often used when comparing life before, during, and after quarantine.","zh":"“prequarantine”是非正式用词，意思是“隔离/封控之前（的）”，常用于对比隔离前、隔离中和隔离后的生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Happening or existing before a quarantine period began.","zh":"（非正式）发生在隔离/封控开始之前的；隔离前的。"},"examples":[{"en":"I miss my prequarantine routine of going to the gym after work.","zh":"我想念隔离前下班后去健身房的日常。"},{"en":"In prequarantine times, the office was always crowded on Mondays.","zh":"隔离前，每周一办公室总是很拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) The time or period before a quarantine started.","zh":"（非正式）隔离/封控开始之前的那段时间。"},"examples":[{"en":"Prequarantine feels like a different life now.","zh":"隔离前的日子现在感觉像是另一种生活。"},{"en":"We made this decision in prequarantine, before travel restrictions.","zh":"我们是在隔离前、旅行限制出台之前做的这个决定。"}]}],"synonyms":["before quarantine","prior to quarantine","pre-lockdown","before lockdown"],"phonetic":"/ˌpriːˈkwɔrənˌtin/","extraExplanation":["这是一个较新的、口语化的用法，常见于新冠疫情语境中，用来和“during quarantine / post-quarantine（隔离期间/隔离后）”对比。","更正式的表达可以说：before the quarantine / prior to quarantine / before lockdown。"]}
{"word":"prequarantined","summary":{"en":"Prequarantined means already quarantined in advance, before arriving or taking part in something.","zh":"prequarantined 指“提前已被隔离”，在到达或参与某事之前就先进行隔离。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially online) already placed in quarantine before arrival, entry, or participation; isolated in advance to reduce disease spread.","zh":"（尤用于网络语境）在到达、入境或参加之前就已被隔离；为减少传染而提前隔离。"},"examples":[{"en":"Travelers who were prequarantined could join the program after a negative test.","zh":"提前隔离的旅客在检测阴性后就可以参加该项目。"},{"en":"The team stayed prequarantined for a week before the tournament.","zh":"球队在比赛前提前隔离了一周。"}]}],"synonyms":["quarantined in advance","pre-arrival quarantined","isolated beforehand"],"phonetic":"/ˌpriːˈkwɔːrənˌtiːnd/","extraExplanation":["“prequarantined”多见于新冠疫情相关报道与社交媒体用语，属于较新的合成词：pre-（提前）+ quarantined（被隔离的）。在正式文书里也常写作“quarantined in advance / pre-arrival quarantine”。"]}
{"word":"prequarantining","summary":{"en":"Prequarantining means quarantining in advance before an event, trip, or possible exposure.","zh":"prequarantining 指在活动/旅行或可能接触风险前，提前进行隔离。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"The act of quarantining (isolating) someone or something in advance, before a trip, event, or possible exposure to illness.","zh":"（在旅行、活动或可能接触疾病之前）提前进行隔离/居家隔离的行为。"},"examples":[{"en":"Many students did prequarantining before moving into the dorms.","zh":"许多学生在搬进宿舍前先进行了提前隔离。"},{"en":"Prequarantining for a week helped reduce the risk of bringing illness to older relatives.","zh":"提前隔离一周有助于降低把疾病带给年长亲属的风险。"}]},{"partOfSpeech":"v.","definition":{"en":"The process of arranging or putting an early quarantine plan into action (often used in public-health or workplace policies).","zh":"（常用于公共卫生或单位政策语境中）制定并执行“提前隔离”安排的过程。"},"examples":[{"en":"The company’s policy required prequarantining after international travel.","zh":"公司政策要求国际旅行后进行提前隔离。"},{"en":"They discussed prequarantining measures for staff before the conference.","zh":"他们讨论了会议前员工的提前隔离措施。"}]}],"synonyms":["quarantining in advance","self-quarantining ahead of time","pre-isolating","isolating beforehand"],"phonetic":"/ˌpriːˈkwɔrənˌtaɪnɪŋ/","extraExplanation":["“prequarantining”常见于新冠疫情（COVID-19）相关语境，是由前缀 pre-（提前）+ quarantine（隔离）构成的较新、非正式用法。更常见、更标准的表达包括：self-quarantine ahead of time（提前自我隔离）、quarantine before/ prior to…（在……之前隔离）。","在写作中，如果想更自然：可以用“People quarantined for X days before…”来替代“prequarantined/prequarantining”，尤其在正式文体里。"]}
{"word":"prequel","summary":{"en":"A later-made story that takes place before an earlier work, explaining what happened first.","zh":"在原作之后创作、但时间发生在原作之前的“前传”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A story, movie, book, or episode that is created after an earlier work but tells events that happened before it (showing the backstory).","zh":"前传：在较早作品之后创作，但叙述发生在原作之前的故事（补充背景与起源）。"},"examples":[{"en":"The film is a prequel to the original trilogy, showing how the hero became a leader.","zh":"这部电影是原三部曲的前传，讲述主角如何成为领袖。"},{"en":"I watched the prequel first, but some jokes made more sense after the main movie.","zh":"我先看了前传，但有些笑点要看完主电影才更懂。"}]}],"synonyms":["backstory (informal)","origin story","prehistory (context-dependent)"],"phonetic":"/ˈpriːkwəl/","extraExplanation":["“prequel”是“prefix pre-（在……之前）+ sequel（续集）”的合成词，常用于电影、电视剧、小说、游戏等系列作品。","不要和“sequel（续集）”混淆：sequel讲“之后发生的故事”，prequel讲“之前发生的故事”。","观看顺序上常见两种说法：按“上映/出版顺序”或按“时间线（chronological order）”。两者各有体验：前者通常更能保留悬念与彩蛋，后者更连贯。"]}
{"word":"prequestion","summary":{"en":"A “prequestion” is a question asked in advance (and rarely, the act of asking in advance).","zh":"“prequestion”指预先提出的问题（很少也可作动词，表示事先询问）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a question asked beforehand, especially to check or prepare for what will happen later","zh":"预先提出的问题；事先用来确认或铺垫的提问"},"examples":[{"en":"Before the interview, the recruiter sent a few prequestions about my work experience.","zh":"面试前，招聘人员发来几个关于我工作经历的预先问题。"},{"en":"The teacher used prequestions to help students focus on the reading.","zh":"老师用预设问题帮助学生集中注意力阅读。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to ask someone a question in advance; to question beforehand","zh":"（罕用）预先提问；事先询问"},"examples":[{"en":"We prequestioned participants to make sure they understood the rules.","zh":"我们事先询问参与者，以确保他们理解规则。"}]}],"synonyms":["pre-question","preliminary question","screening question","initial question","follow-up question"],"phonetic":"/ˌpriːˈkwɛstʃən/","extraExplanation":["“prequestion”不是很常见的标准词，更常见的说法是：**pre-question**, **preliminary question**, **screening question**, **follow-up question**（根据语境选择）。在学术研究或问卷场景中，也常用 **pretest questions**（预测题/预试题）。","在议会程序里有一个相似但不同的术语 **the previous question**，指“终止辩论、立即表决”的动议；它不是“事先问的问题”。"]}
{"word":"prequotation","summary":{"en":"A prequotation is an earlier example of a quotation that appears before the commonly cited first source.","zh":"prequotation 指比通常所认定的最早出处更早出现的引文实例。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An earlier (often newly discovered) instance of a quote or wording that predates the source people usually cite as the earliest.","zh":"（引文研究中）比人们通常认为的最早来源还要早的引文/措辞实例；更早出现的“版本”或用例。"},"examples":[{"en":"The researcher found a prequotation of the famous line in an 1890 newspaper, decades before the movie.","zh":"研究者在一份1890年的报纸里找到了这句名言的更早引文，比电影早了几十年。"},{"en":"This prequotation suggests the quote was circulating in print before it was attributed to the author.","zh":"这个更早引文表明，这句话在被归于那位作者之前就已经在印刷品中流传。"}]}],"synonyms":["earlier citation","antecedent quote","prior occurrence","earliest known instance"],"phonetic":"/ˌpriːkwoʊˈteɪʃən/","extraExplanation":["“prequotation”不是日常英语高频词，更常见的表达包括：an earlier citation（更早引证）、an antecedent quote（前身引文）、the earliest known occurrence（目前已知最早出现）。","在格言/名言溯源（quote attribution）或词源与用例研究中，人们会用类似概念来说明：某句话并非首次出自广为流传的来源，而是有更早的报刊、书信、书籍等证据。"]}
{"word":"prequote","summary":{"en":"Prequote means to provide a quote (usually a preliminary price estimate) in advance, or less commonly to quote something ahead of time.","zh":"Prequote 指预先给出报价（通常是初步估价），较少见时也可指提前引用内容。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give a quote in advance; to provide a preliminary quoted price or estimate before final details are confirmed","zh":"预先报价；在细节尚未最终确定前先给出初步报价/估价"},"examples":[{"en":"The insurer can prequote your policy, but the final price depends on your driving record.","zh":"保险公司可以先为你预先报价，但最终价格取决于你的驾驶记录。"},{"en":"Can you prequote the repair so I know roughly how much it will cost?","zh":"你能先预估/预先报价一下维修费用吗？"},{"en":"We prequoted $2,000, but materials costs went up, so the final quote is higher.","zh":"我们先报了2000美元，但材料成本上涨了，所以最终报价更高。"}]},{"partOfSpeech":"vt.","definition":{"en":"to quote (someone or something) ahead of time, before the main statement or publication","zh":"预先引用（在正式陈述或发表前先引用某人/某内容）"},"examples":[{"en":"The editor asked the writer not to prequote the ending in the introduction.","zh":"编辑让作者不要在引言里提前引用结局内容。"},{"en":"If you prequote a line from the interview, make sure you keep it accurate and in context.","zh":"如果你要提前引用采访中的一句话，要确保准确并符合语境。"}]}],"synonyms":["give a preliminary quote","estimate","quote in advance","provide an estimate"],"phonetic":"/ˌpriːˈkwoʊt/","extraExplanation":["“prequote”不是非常常见的通用词，更常见的表达是“give a preliminary quote / provide an estimate / quote in advance”。在商务、保险、维修等场景里，有时会写成“pre-quote”。","注意区分：estimate（估算，通常更不确定）与 quote（报价，通常更正式、可执行）；prequote 往往暗示“先给个大概的报价，之后可能调整”。"]}
{"word":"prequoted","summary":{"en":"Prequoted means a price or rate was given ahead of time.","zh":"prequoted 指价格或费率在事前已给出（预先报价）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in business) quoted in advance; already given a price or rate before a transaction happens.","zh":"（尤指商业场景）预先报价的；事先给出价格或费率的。"},"examples":[{"en":"The customer selected a prequoted shipping rate at checkout.","zh":"顾客在结账时选择了一个预先报价的运费。"},{"en":"We used a prequoted price, so there were no surprises on the invoice.","zh":"我们使用了预先报价的价格，所以发票上没有意外费用。"}]},{"partOfSpeech":"v.","definition":{"en":"(past participle form) to have quoted in advance.","zh":"（过去分词形式）已预先报价；已事先报出（价格/费率）。"},"examples":[{"en":"The vendor had prequoted the project cost by email.","zh":"供应商已经通过邮件预先报出了项目成本。"}]}],"synonyms":["quoted in advance","pre-priced","already quoted","advance-quoted"],"phonetic":"/ˌpriːˈkwoʊtɪd/","extraExplanation":["“prequoted”多见于商业写作（如合同、发票、物流、保险、采购），表示价格/费率在交易前就确定下来。口语中更常说“already quoted”或“quoted in advance”。"]}
{"word":"prequoting","summary":{"en":"Prequoting means providing a preliminary quote or estimate before a final official quote.","zh":"prequoting 指在正式报价前先给出初步报价或估价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of giving a preliminary price/quote (or estimate) before a final, official quote is issued.","zh":"在正式报价出具之前，先提供一个初步报价/预估价格的行为。"},"examples":[{"en":"The vendor’s prequoting helped us compare costs before the official bid.","zh":"供应商的预先报价帮助我们在正式投标前比较成本。"},{"en":"Our sales team is prequoting based on last year’s rates, but the final quote may change.","zh":"我们的销售团队先按去年的费率做预先报价，但最终报价可能会调整。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle/gerund) Giving a preliminary quote or estimate before final confirmation.","zh":"（现在分词/动名词）在最终确认前先进行初步报价/估价。"},"examples":[{"en":"They are prequoting shipping fees while they verify the exact weight.","zh":"他们在核实准确重量的同时，先预估并报价运费。"},{"en":"Prequoting can speed up negotiations, but it should include clear assumptions.","zh":"预先报价能加快谈判进度，但应清楚写明假设条件。"}]}],"synonyms":["preliminary quote","rough quote","ballpark estimate","initial estimate"],"phonetic":"/ˌpriːˈkwoʊtɪŋ/","extraExplanation":["“prequoting”常见于商务/采购/销售语境，强调“先给一个大致价格”，方便客户做预算或内部审批；但通常不具法律约束力，需以正式quote/报价单为准。","写作或邮件中，为避免误解，常搭配说明：subject to change（可能变动）、for budgeting purposes（仅供预算）、based on…（基于某些条件）。"]}

