{"word":"prerace","summary":{"en":"“Prerace” means “before a race,” describing the period or activities leading up to the start.","zh":"“prerace”表示“赛前”，可指赛前的（形容词）或赛前阶段/活动（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or done before a race begins (often written with a hyphen: pre-race).","zh":"赛前的；在比赛开始前进行的（常写作带连字符：pre-race）。"},"examples":[{"en":"The runners did a short warm-up during the pre-race period.","zh":"选手们在赛前进行了简短的热身。"},{"en":"He felt nervous in the pre-race interview.","zh":"他在赛前采访中感到紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"the time, activities, or events before a race starts.","zh":"赛前阶段；赛前活动/事件。"},"examples":[{"en":"The pre-race was full of music and announcements.","zh":"赛前有音乐和广播通知，气氛很热闹。"},{"en":"During pre-race, check your bike and helmet one last time.","zh":"在赛前，最后再检查一次你的自行车和头盔。"}]}],"synonyms":["pre-race","before the race","prior to the race","lead-up (to the race)"],"phonetic":"/ˌpriˈreɪs/","extraExplanation":["“prerace”更常见的写法是“pre-race”。在体育报道、活动海报和赛程安排里，这个词经常用来修饰名词：pre-race briefing（赛前说明会）、pre-race warm-up（赛前热身）、pre-race jitters（赛前紧张）。"]}
{"word":"preracing","summary":{"en":"Preracing means “before a race,” especially the preparations and activities leading up to the start.","zh":"preracing 指“赛前的/赛前阶段”，尤指比赛开始前的各种准备与活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done before a race; relating to preparation for a race.","zh":"赛前的；与比赛开始前的准备有关的。"},"examples":[{"en":"The team held a preracing meeting to review safety rules.","zh":"车队开了赛前会议来复习安全规则。"},{"en":"Preracing checks include fuel, tires, and radio communication.","zh":"赛前检查包括燃油、轮胎和无线电通讯。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time or set of activities before a race begins (warm-up, inspections, strategy, etc.).","zh":"赛前阶段；比赛开始前的一段时间或一系列活动（热身、检验、战术安排等）。"},"examples":[{"en":"Preracing is often the most stressful part of the day.","zh":"赛前阶段往往是一天里最紧张的部分。"},{"en":"During preracing, drivers focus on mental preparation.","zh":"在赛前阶段，车手会专注于心理准备。"}]}],"synonyms":["pre-race","prerace","before-the-race","warm-up","pre-event"],"phonetic":"/ˌpriːˈreɪsɪŋ/","extraExplanation":["“preracing”由前缀 pre-（“在……之前”）+ racing 构成，常见于赛车/体育语境，用来概括“赛前准备”的一切事项。日常英语里更常写作 **pre-race**（如 pre-race meeting / pre-race checks），作为复合形容词更自然。"]}
{"word":"preradio","summary":{"en":"“Preradio” describes the time or things from before radio broadcasting became common.","zh":"“preradio”指广播普及之前的时代或事物（前广播时代的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from a time before radio existed or before radio was common; belonging to the period before radio broadcasting.","zh":"属于“无线电/广播出现之前”或“广播尚未普及之前”的；前广播时代的。"},"examples":[{"en":"Many preradio families got news mainly from newspapers and word of mouth.","zh":"在前广播时代，许多家庭主要通过报纸和口耳相传获取新闻。"},{"en":"The museum displays preradio communication tools like telegraphs and early telephones.","zh":"博物馆展出了电报机和早期电话等前广播时代的通信工具。"}]}],"synonyms":["pre-radio","before radio","prebroadcast (context-dependent)"],"phonetic":"/ˌpriːˈreɪdioʊ/","extraExplanation":["“preradio”由前缀 pre-（“在……之前”）+ radio 组成，常用于历史、媒体研究或展览说明中，表示“广播普及前的时代/文化”。日常口语里更常见的说法是“before radio”或“pre-radio era”。","写法上也常见连字符形式“pre-radio”。作为形容词，常搭配：preradio era（前广播时代）、preradio society（前广播时代的社会）、preradio communication（前广播时代的通信方式）。"]}
{"word":"prerailroad","summary":{"en":"Prerailroad means “from the time before railroads,” often describing life, travel, or society before trains became common.","zh":"Prerailroad 指“铁路普及之前的”，常用来描述火车出现前的生活、交通或社会。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the time before railroads existed or became widely used; from an earlier, pre-train era.","zh":"与铁路出现或普及之前的时期有关的；属于“铁路之前/火车之前”的年代。"},"examples":[{"en":"In prerailroad America, most long-distance travel was by horse, boat, or stagecoach.","zh":"在美国的铁路出现之前，人们长途出行主要靠马、船或驿马车。"},{"en":"The museum shows prerailroad tools used by farmers and craftsmen.","zh":"博物馆展示了农民和手工匠人在铁路时代之前使用的工具。"}]}],"synonyms":["pre-railroad","pre-railway (BrE)","before the railroad era","preindustrial (sometimes, broader)"],"phonetic":"/ˌpriːˈreɪlˌroʊd/","extraExplanation":["这个词更常写作 **pre-railroad**（带连字符）或 **pre railroad**（较少见），在学术写作里常用来描述“铁路普及之前的社会/经济/交通”。","它通常用来修饰名词：**prerailroad era/period**, **prerailroad transportation**, **prerailroad society**。","在美国语境中，提到 *prerailroad* 往往指 19 世纪中期铁路大规模扩张之前的阶段（各地区时间略有差异）。"]}
{"word":"prerailroadite","summary":{"en":"Someone (or something) from the time before railroads, or with attitudes that feel pre-railroad and old-fashioned.","zh":"指铁路普及之前时代的人（或事物），也可形容带有前铁路时代、较老派的观念或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lived in the time before railroads were common, or someone whose ideas and habits belong to that pre-railroad era.","zh":"生活在铁路尚未普及之前的人；或思想与习惯仍停留在“铁路出现之前时代”的人。"},"examples":[{"en":"In the historian’s account, the village elders seemed like prerailroadites, measuring distance by days on horseback.","zh":"在历史学家的叙述中，村里的长者仿佛是“前铁路时代的人”，用骑马要走几天来衡量距离。"},{"en":"He joked that he was a prerailroadite when he refused to trust any new transportation technology.","zh":"他开玩笑说自己是“前铁路时代的人”，因为他拒绝相信任何新的交通技术。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the period before railroads, or having old-fashioned attitudes associated with that time.","zh":"与铁路出现之前的时期有关的；带有前铁路时代那种“老派”观念的。"},"examples":[{"en":"The museum has a prerailroadite map that shows routes by river and stagecoach.","zh":"博物馆里有一张前铁路时代的地图，上面标的是河运和驿站马车路线。"},{"en":"Her prerailroadite view of travel favored slow journeys and long stops.","zh":"她对旅行的看法很“前铁路时代”：偏爱慢慢赶路、长时间停留。"}]}],"synonyms":["pre-railroad","preindustrial (approx.)","old-fashioned","traditionalist"],"phonetic":"/ˌpriːˈreɪlˌroʊdˌaɪt/","extraExplanation":["这个词非常少见，常见于历史写作或带一点幽默/讽刺的语境，用来对比“铁路带来的现代化”（更快的速度、更大的流动性、城市与市场的连接）。","构词上是 pre-（在……之前）+ railroad（铁路）+ -ite（表示“某类人/某派别的人”，如 socialite）。因此它带有“某一时代/群体的人”的感觉。"]}
{"word":"prerailway","summary":{"en":"Prerailway means “before the railway era,” describing things from the time before railways were common.","zh":"prerailway 指“铁路普及之前的（前铁路时代的）”，用来描述铁路出现前的事物或时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"existing or happening before railways were built or widely used; from the time before the railway era.","zh":"铁路出现或普及之前的；属于“前铁路时代”的。"},"examples":[{"en":"The museum has a prerailway map showing how people traveled by river and horse.","zh":"博物馆里有一张前铁路时代的地图，展示人们如何靠河运和马匹出行。"},{"en":"Many towns shrank after rail lines opened, but in the prerailway period they were busy market centers.","zh":"很多城镇在铁路开通后逐渐衰落，但在前铁路时代它们曾是繁忙的集市中心。"}]},{"partOfSpeech":"n.","definition":{"en":"the time period before railways; the pre-railway era (often used in historical writing).","zh":"铁路出现之前的时期；前铁路时代（多用于历史写作）。"},"examples":[{"en":"Researchers compared wages in the prerailway with those after the first rail network expanded.","zh":"研究人员比较了前铁路时代与第一批铁路网扩张后的人们工资水平。"},{"en":"In the prerailway, long-distance travel could take weeks.","zh":"在前铁路时代，长途旅行可能要花上数周。"}]}],"synonyms":["pre-railway","pre-railroad","preindustrial","premodern"],"phonetic":"/ˌpriˈreɪlweɪ/","extraExplanation":["“prerailway”并不是日常高频词，更常见的写法是“pre-railway”或“pre-railroad”（美式）。在学术与历史语境里，用它来对比铁路出现前后对交通、城市发展、贸易和生活节奏的影响。","英式英语通常说“railway”，美式英语更常说“railroad”。因此在美国历史语境中，你更可能看到“pre-railroad era/period”。"]}
{"word":"preramus","summary":{"en":"“Preramus” is not a standard English word; it’s likely a misspelling or a specialized term. Provide context to identify the intended word.","zh":"“preramus”不是标准常见英语单词；更可能是拼写错误或专业术语。请提供上下文以确定目标词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling, a name (proper noun), or a specialized Latin/scientific term. Please share the sentence or field (e.g., anatomy, biology) so I can identify the intended word.","zh":"这不是常见英语词典里的标准单词。它可能是拼写错误、专有名词（人名/地名/品牌名），或某个学科里的拉丁/科学术语。请提供出现的句子或所属领域（如解剖学、生物学），我才能判断你想表达的词。"},"examples":[{"en":"I couldn’t find “preramus” in standard English dictionaries—could you paste the sentence where you saw it?","zh":"我在常见英语词典里查不到“preramus”，你能把它出现的句子贴出来吗？"},{"en":"If you meant “ramus” (a branch, especially in anatomy), the spelling is different.","zh":"如果你想写的是“ramus”（分支，尤指解剖学中的“支”），拼写会不一样。"}]}],"phonetic":"/priːˈreɪməs/","extraExplanation":["“preramus”很像把前缀 pre-（“在……之前/预先”）和拉丁词 ramus（“枝、支”）拼在一起，但这并不是英语里常用的构词形式。","你可能想找的词：\n- ramus：解剖学中常见，表示“骨的支/神经的支”等\n- pre-ramosal / pre-ramal（更偏专业、需看具体学科用法）\n也有可能是把 prerogative、preamble、primrose 等词打错了。","给我更多线索会更快：它来自哪本书/哪篇文章？是医学/生物/拉丁语相关内容吗？"]}
{"word":"prerational","summary":{"en":"Prerational means “before rational, logical thinking develops or is used,” often describing early-childhood thinking or instinctive, intuitive responses.","zh":"Prerational 指“理性逻辑思维形成或被运用之前的”，常用来描述儿童早期思维或更本能、直觉的反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing before the development or use of logical, analytical reasoning; not yet shaped by rational thought.","zh":"发生在理性（逻辑、分析性思维）形成或运用之前的；尚未被理性思考所塑造的。"},"examples":[{"en":"Young children often rely on prerational thinking, like believing a wish can change reality.","zh":"幼儿常常依赖前理性的思维，比如相信许愿就能改变现实。"},{"en":"The story describes a prerational worldview where nature is full of spirits and signs.","zh":"这个故事描绘了一种前理性的世界观：自然充满了精灵与征兆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to instincts, emotions, symbols, or intuition rather than explicit reasoning (often used in psychology, anthropology, or spirituality).","zh":"与本能、情感、象征或直觉有关，而不是与清晰的推理有关（常用于心理学、人类学或灵性语境）。"},"examples":[{"en":"Her fear response felt prerational—she knew she was safe, but her body disagreed.","zh":"她的恐惧反应像是前理性的——她知道自己很安全，但身体并不这么认为。"},{"en":"The ritual speaks to prerational needs for belonging and meaning.","zh":"这种仪式触及人们对归属感与意义的前理性需求。"}]}],"synonyms":["prelogical","intuitive","instinctive","nonrational"],"phonetic":"/ˌpriˈræʃənəl/","extraExplanation":["“prerational”由前缀 pre-（在……之前）+ rational（理性的）构成，意思不是“反理性/不理性”（irrational），而是“在理性能力出现或主导之前”。","常见于发展心理学或教育语境，用来描述儿童早期更依赖直觉、具体经验、想象与象征的思维方式；也可用于文化人类学讨论神话、仪式等如何在非分析性的层面提供解释与安定感。","使用时要注意语气：它通常是描述性的（developmental/阶段性），不一定带贬义。若想表达“缺乏逻辑、荒谬”，更常用 irrational 或 illogical。"]}
{"word":"prereadiness","summary":{"en":"Prereadiness means being prepared ahead of time—doing early groundwork before the main event or task starts.","zh":"Prereadiness 指提前做好准备：在主要事件或任务开始前先打基础、做铺垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being prepared in advance; early preparation before something officially begins","zh":"预先准备的状态；在正式开始前的准备阶段"},"examples":[{"en":"The team focused on prereadiness tasks like setting goals and gathering materials.","zh":"团队专注于“预先准备”的任务，比如设定目标和收集材料。"},{"en":"In the first week, we built prereadiness for the course by reviewing basic vocabulary.","zh":"第一周，我们通过复习基础词汇来为课程建立预备状态。"}]}],"synonyms":["preparation","preparedness","readiness","advance planning","groundwork"],"phonetic":"/ˌpriːˈrɛdinəs/","extraExplanation":["“prereadiness”不是特别常见的日常词，更常见的表达是“preparation / preparedness / readiness”。它多见于教育（如学习前的准备）、管理与培训（项目启动前的准备）、以及公共卫生/应急领域（预先部署与训练）。","构词上是“pre-（在……之前）+ readiness（准备就绪）”，强调“更早一步的准备”，往往指进入正式阶段之前的基础打底。"]}
{"word":"preready","summary":{"en":"“Preready” means prepared in advance; in computing, it can mean not fully ready yet but close to ready.","zh":"“Preready”表示“提前准备好”；在计算机语境中可指“尚未完全就绪但接近就绪”的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"prepared or made ready in advance (often written with a hyphen as “pre-ready”).","zh":"提前准备好的；预先就绪的（常写作带连字符的“pre-ready”）。"},"examples":[{"en":"The team kept a pre-ready response plan for emergencies.","zh":"团队为紧急情况准备了一份预先就绪的应对方案。"},{"en":"Make the documents pre-ready so we can submit them quickly tomorrow.","zh":"把文件先准备好，这样我们明天就能快速提交。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) describing a state just before something is fully “ready,” such as a process or item waiting to become active.","zh":"（计算机）指在“就绪”之前的状态，例如进程或任务等待变为可运行/可用。"},"examples":[{"en":"Some systems move tasks from a pre-ready stage into the ready queue.","zh":"一些系统会把任务从“预就绪”阶段移入就绪队列。"}]}],"synonyms":["prepared","ready beforehand","pre-prepared","in advance"],"phonetic":"/ˌpriˈrɛdi/","extraExplanation":["“preready”并不是非常常见的标准词形，更常见写法是“pre-ready”。在正式写作中，如果不是特定领域术语，通常用更自然的表达：prepared in advance / already prepared / ready beforehand。"]}
{"word":"prerealization","summary":{"en":"“Prerealization” means awareness or a stage that comes before something is fully realized or confirmed.","zh":"“prerealization”指在某事被完全实现或证实之前的提前认知，或实现之前的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an understanding, expectation, or recognition that happens before something is fully realized or confirmed","zh":"在某事真正实现或被证实之前出现的理解、预感或提前认知"},"examples":[{"en":"She had a prerealization that the meeting would change the project’s direction.","zh":"她在会议开始前就有一种预感：这次会议会改变项目方向。"},{"en":"The team’s prerealization of the risks helped them prepare a backup plan.","zh":"团队对风险的提前认知帮助他们准备了备用方案。"}]},{"partOfSpeech":"n.","definition":{"en":"the stage or period before an idea, plan, or value becomes ‘realized’ (made real, achieved, or converted into results)","zh":"在想法、计划或价值被“实现/兑现”（变为现实、达成或转化为成果）之前的阶段"},"examples":[{"en":"In the prerealization phase, the company focused on testing and training.","zh":"在实现前阶段，公司主要进行测试与培训。"},{"en":"Investors often study prerealization indicators, like early sales and user growth.","zh":"投资者常研究实现前指标，比如早期销量和用户增长。"}]}],"synonyms":["pre-realization","early awareness","prior recognition","foreknowledge","anticipation"],"phonetic":"/ˌpriːˌriːələˈzeɪʃən/","extraExplanation":["“prerealization”不是非常常见的标准词汇，更常见的写法是带连字符的“pre-realization”。在正式写作中，你也可以用更自然的表达来替换，比如“early awareness / prior recognition / before full realization（在完全意识到之前）”。","在金融语境里，“realization”常指“实现收益/兑现（例如卖出资产后确认利润）”。因此“pre-realization”有时也会被用来指“尚未兑现之前”的阶段或估计，但具体含义要看上下文。"]}
{"word":"prerealize","summary":{"en":"“Prerealize” means to make something ready in advance (often in computing), and more rarely to realize/foresee something beforehand.","zh":"“prerealize”主要指（常在计算机领域）提前使某物就绪/初始化；较少见义为提前意识到、预见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Especially in computing) to make something ready, created, or “active” in advance; to prepare or initialize it before it is actually needed.","zh":"（尤用于计算机领域）提前使某物就绪、创建或“激活”；在真正需要之前先准备/初始化。"},"examples":[{"en":"The UI framework prerealizes the window so it can appear instantly when the user clicks the button.","zh":"这个界面框架会预先初始化窗口，这样用户点击按钮时就能立刻显示出来。"},{"en":"We prerealized the textures during loading to avoid lag in the first scene.","zh":"我们在加载阶段预先处理（初始化）纹理，以避免第一幕卡顿。"}]},{"partOfSpeech":"vt.","definition":{"en":"to understand or imagine something beforehand; to foresee mentally (rare).","zh":"提前理解或在脑中预想某事；预见（较少见）。"},"examples":[{"en":"She prerealized the difficulties and planned extra time.","zh":"她预先意识到困难，并多预留了时间。"}]}],"synonyms":["pre-initialize","preload","prepare","initialize","anticipate","foresee"],"phonetic":"/ˌpriːˈriːəˌlaɪz/","extraExplanation":["“prerealize”不是常见日常英语词，更常见于技术语境（如图形界面、资源加载、框架生命周期），意思接近“pre-initialize / pre-load / prepare in advance”。","写法上也常见连字符形式“pre-realize”。在普通表达中，通常用“realize beforehand / anticipate / foresee”更自然。"]}
{"word":"prerealized","summary":{"en":"Prerealized means already realized in advance (often in finance); it can also be a rare verb form meaning “realized ahead of time.”","zh":"prerealized 指“预先实现的/提前已实现的”（常见于金融语境）；也可作罕见动词形式，表示“提前意识到/预见并先行实现”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) already realized or achieved before a later point in time; realized in advance.","zh":"（罕见）在较晚的时间点之前就已经实现/达成的；预先实现的。"},"examples":[{"en":"The company reported prerealized gains from earlier investments.","zh":"公司报告了来自早期投资的预先实现收益。"},{"en":"These savings are prerealized, so the new plan won’t add much more.","zh":"这些节省已经预先实现，所以新方案不会再增加多少。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, as a verb form) past tense/past participle of prerealize: to realize or anticipate something in advance.","zh":"（罕见，作动词形式）prerealize 的过去式/过去分词：提前意识到或预见并“先行实现”。"},"examples":[{"en":"She prerealized the risk and changed her approach early.","zh":"她提前意识到风险，并很早就调整了方法。"}]}],"synonyms":["pre-realized","already realized","previously realized","anticipated","foreseen"],"phonetic":"/ˌpriːˈriːəˌlaɪzd/","extraExplanation":["“prerealized”在日常英语中非常少见，更常见的写法是带连字符的“pre-realized”，或直接用更自然的表达：already realized / realized earlier / anticipated in advance。","它常出现在财务/会计/投资语境里，用来强调“这些收益/效果并不是这次行动带来的，而是在更早之前就已实现”。"]}
{"word":"prerealizing","summary":{"en":"“Prerealizing” is a rare, nonstandard way to say “realizing in advance.”","zh":"“prerealizing”是少见且不太标准的说法，大意是“提前意识到”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) realizing something in advance; thinking of a result, feeling, or consequence before it actually happens.","zh":"（非标准/少见）提前意识到（某事）；在事情真正发生之前先想到结果、感受或后果。"},"examples":[{"en":"I was prerealizing the awkwardness of the conversation before I even walked in.","zh":"我还没走进去，就已经提前意识到那段对话会很尴尬。"},{"en":"She kept prerealizing how tired she would feel after the trip.","zh":"她总是提前想到旅行后自己会有多累。"}]},{"partOfSpeech":"other","definition":{"en":"The present participle/gerund form of the rare verb “pre-realize” (to realize beforehand).","zh":"少见动词“pre-realize”（提前意识到）的现在分词/动名词形式。"},"examples":[{"en":"Prerealizing the risks helped them prepare a backup plan.","zh":"提前意识到风险帮助他们准备了备用方案。"}]}],"synonyms":["realizing beforehand","realizing in advance","anticipating","foreseeing","seeing it coming"],"phonetic":"/ˌpriːˈriːəˌlaɪzɪŋ/","extraExplanation":["“prerealizing”在标准英语里很少见，读者也可能觉得不自然。更常见、更地道的说法包括：realizing beforehand / realizing in advance / anticipating / seeing it coming（更口语）。","写作中如果想表达“提前在脑中预演并意识到”，可以用：I could already tell… / I could already imagine… / I anticipated that… 来更清楚地传达意思。"]}
{"word":"prerebellion","summary":{"en":"Prerebellion means “before a rebellion,” either describing something from that time or naming the period leading up to an uprising.","zh":"prerebellion 表示“起义/叛乱之前的”，既可作形容词描述起义前的事物，也可作名词指起义爆发前的时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(attributive) Happening or existing before a rebellion; relating to the time leading up to an uprising.","zh":"（作定语）叛乱/起义发生之前的；与起义前时期有关的。"},"examples":[{"en":"The novel is set in prerebellion Boston, when tensions were rising.","zh":"这部小说以起义前的波士顿为背景，当时紧张局势正在上升。"},{"en":"Researchers compared prerebellion speeches with later revolutionary writings.","zh":"研究者把起义前的演讲与后来的革命著作进行了对比。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time before a rebellion begins.","zh":"起义/叛乱爆发之前的时期；起义前阶段。"},"examples":[{"en":"In the prerebellion, protests spread quickly through the capital.","zh":"在起义前阶段，抗议迅速蔓延到首都。"},{"en":"Her diary captures the fear and hope of the prerebellion.","zh":"她的日记记录了起义前时期的恐惧与希望。"}]}],"synonyms":["pre-rebellion","pre-uprising","pre-revolution","before the rebellion"],"phonetic":"/ˌpriːrɪˈbɛljən/","extraExplanation":["“prerebellion”是由前缀 pre-（在……之前）+ rebellion（叛乱/起义）构成的合成词。实际写作中更常见的形式是带连字符的“pre-rebellion”，尤其在正式出版物里更清晰易读。","常见搭配：pre(-)rebellion period（起义前时期）、pre(-)rebellion society/economy（起义前的社会/经济）、pre(-)rebellion tensions（起义前的紧张局势）。","语境提示：rebel/rebellion在英语里不一定带褒贬，但在历史叙述中可能因立场不同而被称为“rebellion（叛乱）”或“revolution（革命）”。如果你想表达更中性或更正面的“革命”，可改用“pre-revolution”或“pre-uprising”。"]}
{"word":"prereceipt","summary":{"en":"Prereceipt (more commonly written “pre-receipt”) is an uncommon term meaning something done or recorded before an official receipt/receiving happens, sometimes referring to an advance-payment confirmation.","zh":"Prereceipt（更常写作 pre-receipt）是不常见用语，指在正式“收讫/收货”之前的处理或记录；在某些场景也可指预付款或正式收据前的临时收款确认。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Something that happens or is done before an item, payment, or information is officially received; a “before-receipt” stage or record.","zh":"（不常见）在正式“收到”物品、款项或信息之前发生/完成的事情；“收讫之前”的阶段或记录。"},"examples":[{"en":"Please complete the pre-receipt check before you sign for the package.","zh":"在你签收包裹之前，请先完成收货前检查。"},{"en":"The system logs a pre-receipt status while the shipment is still being processed.","zh":"当货物仍在处理时，系统会记录“收货前/未收讫”的状态。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some business/accounting contexts) An advance payment or temporary acknowledgment made before a final receipt is issued.","zh":"（某些商业/会计语境）在开具正式收据之前的预付款，或临时的收款确认。"},"examples":[{"en":"We can provide a pre-receipt confirmation today and the official receipt tomorrow.","zh":"我们今天可以先提供预收款确认，明天再开正式收据。"},{"en":"The customer requested proof of payment, so we sent a pre-receipt email.","zh":"客户需要付款证明，所以我们发了一封预收款确认邮件。"}]}],"synonyms":["pre-receipt","advance payment","payment confirmation","pre-delivery check","pre-acceptance"],"phonetic":"/ˌpriːrɪˈsiːt/","extraExplanation":["“prereceipt”不是常见标准词形，更常见的写法是带连字符的“pre-receipt”，或直接用更自然的表达，如“pre-delivery check（交付前检查）”“advance payment（预付款）”“payment confirmation（付款确认）”。如果你是在某个系统界面/表单里看到它，很可能是公司内部术语。"]}
{"word":"prereceive","summary":{"en":"A technical verb meaning “receive beforehand,” especially the Git concept of checking something before a server accepts a push.","zh":"一个技术性动词，意为“预先接收/接收前检查”，尤指 Git 中服务器在接受 push 前进行检查的概念。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Computing, especially Git) to receive something in advance, or to handle checks/actions before a server accepts incoming data (e.g., before accepting a pushed commit).","zh":"（计算机领域，尤指 Git）预先接收；或在服务器正式接受传入数据之前先进行接收前的检查/处理（如在接受 push 的提交前先执行检查）。"},"examples":[{"en":"The server runs a pre-receive hook to block commits that fail the tests.","zh":"服务器会运行 pre-receive hook 来阻止未通过测试的提交。"},{"en":"We added pre-receive checks to prevent large files from being pushed.","zh":"我们添加了 pre-receive 检查，防止把超大的文件推送上来。"}]}],"synonyms":["receive in advance","pre-accept (contextual)","screen (before accepting)"],"phonetic":"/ˌpriːrɪˈsiːv/","extraExplanation":["“prereceive”在日常英语里非常少见，最常见的来源是 Git 术语“pre-receive（hook）”。它指的是：当你把代码 push 到远程仓库时，服务器在“接受并写入”之前运行的一段脚本，用来做权限校验、格式检查、测试门禁、阻止敏感信息等。","写法上更常见的是带连字符的“pre-receive”，或作为名词短语“pre-receive hook”。如果你想表达普通含义“提前收到”，更自然的说法是“receive in advance”或“get/receive early”。"]}
{"word":"prereceived","summary":{"en":"“Prereceived” means already received in advance (often in business or administrative contexts).","zh":"“prereceived”表示“预先收到的/已提前收到的”，常用于商务或行政语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"received in advance; already received before a particular time, event, or process.","zh":"预先收到的；在某个时间、事件或流程之前已经收到的。"},"examples":[{"en":"Please check the prereceived materials before the meeting starts.","zh":"请在会议开始前检查预先收到的资料。"},{"en":"The prereceived payment will be applied to next month’s invoice.","zh":"预先收到的款项将用于抵扣下个月的发票。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to receive something in advance.","zh":"（较少见）预先接收；提前收到（某物）。"},"examples":[{"en":"Some offices prereceive mail for traveling staff.","zh":"有些办公室会为出差员工预先代收邮件。"}]}],"synonyms":["received in advance","already received","previously received","pre-collected"],"phonetic":"/ˌpriːrɪˈsiːvd/","extraExplanation":["“prereceived”在日常英语里不算常见，更多见于行政、财务、物流或表单用语，用来强调“在正式处理/登记之前已收到”。更自然的表达常见有：already received / received in advance / previously received。","在会计或业务流程里，类似表达可能出现在“预收款”（advance payment / payment received in advance）或“预收货/预先到货”（goods received in advance）等语境中。"]}
{"word":"prereceiver","summary":{"en":"A prereceiver is usually a technical pre-stage (device/circuit) placed before a receiver to improve the incoming signal.","zh":"prereceiver 通常指接收机之前的前置级（设备/电路），用于改善输入信号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(technical) A device or circuit stage placed before a receiver to condition, amplify, or filter a signal before it enters the main receiver.","zh":"（技术）位于接收机之前的设备或电路级，用于在信号进入主接收机前进行调理、放大或滤波。"},"examples":[{"en":"In the radio test setup, a prereceiver boosted the weak signal before it reached the receiver.","zh":"在这套无线电测试装置中，前置接收级（prereceiver）在信号进入接收机之前把微弱信号放大了。"},{"en":"The engineer added a prereceiver filter to reduce noise.","zh":"工程师加了一个前置滤波模块（prereceiver filter）来降低噪声。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person or thing that receives something earlier than others; an early recipient.","zh":"（罕见）比别人更早收到某物的人或事物；先收到者。"},"examples":[{"en":"As a prereceiver of the announcement, she helped prepare the team.","zh":"作为提前得知公告的人，她帮助团队做好准备。"}]}],"synonyms":["pre-receiver","front end","preamplifier","preamp","preselector"],"phonetic":"/ˌpriːrɪˈsiːvər/","extraExplanation":["“prereceiver”在日常英语中很少见，更常见的写法是带连字符的“pre-receiver”，或直接用更通用的术语如“preamplifier（前置放大器）”“front end（前端）”“preselector（前选器）”。","该词多出现在无线电、通信、雷达、音频等工程语境里，强调“在接收机之前的一段处理/模块”，具体功能取决于系统设计（放大、滤波、匹配阻抗等）。"]}
{"word":"prereceiving","summary":{"en":"“Prereceiving” is a nonstandard form meaning “receiving in advance,” usually written as “pre-receiving” in logistics/business contexts.","zh":"“prereceiving”属非标准写法，通常指“提前接收/预收（货）”，在物流/商业语境里更常写作“pre-receiving”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) The act of receiving something in advance, or the process done before official receipt (often used in business/logistics writing as “pre-receiving”).","zh":"（非标准用法）提前接收某物；或在正式“收货/签收”前进行的预收流程（常见于商业/物流语境，更多写作“pre-receiving”）。"},"examples":[{"en":"We started pre-receiving the shipment so the warehouse team can check quantities before it’s officially received.","zh":"我们开始进行预收货，这样仓库团队可以在正式入库前核对数量。"},{"en":"The system supports pre-receiving to reduce errors on receiving day.","zh":"系统支持预收货，以减少正式收货当天的错误。"}]}],"synonyms":["pre-receiving","advance receiving","preliminary receiving","receive in advance"],"phonetic":"/ˌpriːrɪˈsiːvɪŋ/","extraExplanation":["“prereceiving”不是常见标准拼写；更自然的写法是加连字符的“pre-receiving”，或直接用更常见表达：\n- 动作/名词：pre-receiving process（预收流程）, advance receiving（提前收货）, preliminary receiving（初步收货）\n- 表达“提前收到”：receive in advance / get something ahead of time（提前收到）\n在正式写作中，若不是公司内部术语，建议改用更通用的说法以避免读者困惑。"]}
{"word":"prerecital","summary":{"en":"“Prerecital” (more often written “pre-recital”) means before a recital, or an event held before a recital.","zh":"“prerecital”（更常写作“pre-recital”）指“演出/独奏会之前的”，也可指“演出前的活动/环节”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in music or dance) happening before a recital; relating to the time before a recital.","zh":"（尤指音乐或舞蹈）在独奏会/汇报演出之前发生的；与演出前时间有关的。"},"examples":[{"en":"The pianist did a short prerecital warm-up backstage.","zh":"那位钢琴家在后台做了一个简短的演出前热身。"},{"en":"We arrived early for the prerecital talk about the composer.","zh":"我们提前到场，听了演出前关于作曲家的讲座。"}]},{"partOfSpeech":"n.","definition":{"en":"A meeting, activity, or event held before a recital (less common).","zh":"演出前举行的聚会、活动或环节（较少见）。"},"examples":[{"en":"Parents were invited to a prerecital with the teacher to discuss etiquette.","zh":"家长被邀请参加一个演出前的说明会，与老师讨论观演礼仪。"}]}],"synonyms":["pre-recital","before the recital","preperformance (broader)"],"phonetic":"/ˌpriːrɪˈsaɪtəl/","extraExplanation":["“prerecital”在实际写作中更常见的形式是“pre-recital”（带连字符），尤其在正式英文里更规范：pre-recital dinner / pre-recital talk。","recital 常指个人或小型的表演（如钢琴独奏会、舞蹈汇报演出）。因此“pre-recital”通常搭配 warm-up（热身）、nerves（紧张）、talk（导赏讲座）、dinner（演出前晚餐）等。"]}
{"word":"prerecite","summary":{"en":"“Prerecite” means to recite something beforehand, usually as practice.","zh":"“prerecite”指提前背诵/预先朗诵，通常用于练习。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to recite (something) in advance, especially as practice before a performance or formal recitation","zh":"（尤指为正式背诵/表演）提前背诵、预先朗诵（作为练习）"},"examples":[{"en":"She prerecited the poem quietly before going on stage.","zh":"上台前，她轻声把诗先背诵了一遍。"},{"en":"The students prerecited their lines to make sure they remembered them.","zh":"学生们先把台词预先背了一遍，确保记得住。"}]}],"synonyms":["rehearse","practice","run through","recite beforehand","prepractice (rare)"],"phonetic":"/ˌpriːrɪˈsaɪt/","extraExplanation":["“prerecite”由前缀 pre-（在……之前）+ recite（背诵/朗诵）构成，属于较少见的用法；日常英语更常说 practice reciting / rehearse / run through (your lines) / recite beforehand。"]}
{"word":"prerecited","summary":{"en":"“Prerecited” means already cited earlier; it’s a formal/technical word often seen in legal or academic writing.","zh":"“prerecited”指“先前已引用的”，多见于法律或学术等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already cited (mentioned as a reference) earlier in the same document or discussion.","zh":"（在同一份文件或讨论中）先前已经引用过的。"},"examples":[{"en":"The court rejected the argument for reasons stated in the prerecited cases.","zh":"法院基于先前已引用的判例所述理由驳回了该主张。"},{"en":"See the prerecited sources for the full data table.","zh":"完整数据表请参见前文已引用的资料来源。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “prerecite”: to cite or mention earlier in a text.","zh":"“prerecite”的过去式/过去分词：在文章较前处先行引用或提及。"},"examples":[{"en":"The author prerecited the key studies before presenting the new findings.","zh":"作者在提出新发现之前，先引用了关键研究。"}]}],"synonyms":["previously cited","earlier-cited","aforementioned","cited above"],"phonetic":"/ˌpriːrɪˈsaɪtɪd/","extraExplanation":["“prerecited”不是日常英语常用词，较常见于法律文书、学术写作或正式报告里，用来避免重复列举同一批参考文献/判例。更口语或更常见的表达通常是 “previously cited / earlier-cited / cited above”。"]}
{"word":"prereciting","summary":{"en":"“Prereciting” is a rare/nonstandard way to mean reciting something in advance as practice.","zh":"“prereciting”是少见/非标准说法，通常指提前背诵或朗诵作为练习。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare / nonstandard) reciting something ahead of time, especially as practice before a performance or recording.","zh":"（少见/非标准用法）事先背诵/朗诵，尤指在正式表演或录制前的练习。"},"examples":[{"en":"She did some prereciting in the hallway to calm her nerves before the poetry reading.","zh":"在诗歌朗诵会开始前，她在走廊里先练习背诵，让自己镇定下来。"},{"en":"The actor spent the morning prereciting his lines before rehearsal.","zh":"那位演员在排练前的上午先把台词预先背了一遍。"}]}],"synonyms":["practice reciting","rehearse","run through (lines)","practice"],"phonetic":"ˌpriːrɪˈsaɪtɪŋ","extraExplanation":["“prereciting”在英语里不算常见的标准词，更常见的表达是：practice reciting（练习朗诵/背诵）、rehearse（排练）、run through the lines（把台词过一遍）。","如果你想表达“先修条件/前置课程”，你可能想查的是 prerequisite（先决条件/先修课）。","构词上它看起来像 pre-（在……之前）+ reciting（朗诵/背诵），因此读者通常能猜到意思，但在正式写作中建议换成更常用的说法。"]}
{"word":"prereckon","summary":{"en":"“Prereckon” means to estimate or anticipate something in advance (rare in modern English).","zh":"“prereckon”指“预先估计/预判”，在现代英语中很少用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to reckon, estimate, or consider in advance; to anticipate","zh":"预先估计；事先考虑；预判"},"examples":[{"en":"We prereckoned the total cost before signing the contract.","zh":"我们在签合同前先预估了总费用。"},{"en":"She prereckoned that traffic would be heavy and left early.","zh":"她预判会堵车，所以提前出门。"}]}],"synonyms":["anticipate","foresee","estimate","project","predict"],"phonetic":"/ˌpriːˈrɛkən/","extraExplanation":["“prereckon”非常少见，更多时候会写成带连字符的“pre-reckon”，而且在现代英语里也不常用。实际交流中更自然的替代词包括：anticipate（预料）、estimate beforehand（事先估计）、consider in advance（提前考虑）。","词根提示：reckon 本意是“计算/估算、认为”，加前缀 pre- 表示“在……之前”，合起来就是“提前估算/提前认为”。"]}
{"word":"prereckoning","summary":{"en":"“Prereckoning” is a rare word meaning the period or state before an accounting, judgment, or settling of consequences.","zh":"“Prereckoning”是个罕见词，指在清算、评判或后果结算之前的阶段或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A time, stage, or set of conditions that happens before a reckoning—before an accounting, judgment, or final decision.","zh":"（罕见）“清算/算账/裁决”之前的阶段或情境；指在最终结算、评判或决定之前。"},"examples":[{"en":"The novel lingers in a prereckoning mood, when everyone senses consequences are coming but nothing has been settled yet.","zh":"这部小说停留在一种“清算前”的氛围里：人人都感觉后果将至，但一切尚未尘埃落定。"},{"en":"In the prereckoning period, the company tried to hide its losses.","zh":"在清算前的阶段，公司试图掩盖亏损。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, adjective use) Happening before a reckoning; preliminary to judgment or accounting.","zh":"（罕见，形容词用法）发生在清算/评判/结算之前的；预备性的。"},"examples":[{"en":"They held a prereckoning meeting to gather the facts.","zh":"他们开了一次清算前会议来收集事实。"},{"en":"Her prereckoning apology sounded cautious, as if she expected criticism later.","zh":"她清算前式的道歉听起来很谨慎，仿佛预料到之后会被批评。"}]}],"synonyms":["pre-reckoning","prejudgment period","lead-up","run-up","prelude"],"phonetic":"/ˌpriːˈrɛkənɪŋ/","extraExplanation":["“prereckoning”不是常见词，更常见的写法是带连字符的“pre-reckoning”，意思也更清楚：pre-（在……之前）+ reckoning（清算、算账、评判）。","在文学语境里，reckoning常带有“最终要面对后果/真相”的意味，因此“prereckoning”常用来营造一种“风暴将至、但尚未揭晓”的张力。","如果你本来想查的是“prerequisite（先决条件）”或“precalculation（预先计算）”，拼写和含义会完全不同。"]}
{"word":"prerecognition","summary":{"en":"Prerecognition means knowing or sensing something before it happens, often described as a psychic ability.","zh":"prerecognition 指在事件发生前就知道或预感到某事，常被描述为一种“预知”的通灵能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often in paranormal contexts) knowledge or awareness of an event before it happens; foreknowledge.","zh":"（多用于超自然/灵异语境）在事情发生之前就知道或预感到某事；预知。"},"examples":[{"en":"She claimed to have prerecognition of the accident the night before.","zh":"她声称在事故发生前一晚就预知到了这场事故。"},{"en":"In the novel, the hero’s prerecognition shapes every decision he makes.","zh":"在小说里，主角的预知能力影响了他做的每一个决定。"}]}],"synonyms":["foreknowledge","premonition","second sight","prophecy"],"phonetic":"/ˌpriːrɛkəɡˈnɪʃən/","extraExplanation":["“prerecognition”由前缀 pre-（在……之前）+ recognition（认知、辨认）构成，字面意思是“提前认知”。","这个词在日常英语中不算常见，更多见于超自然题材、科幻/奇幻作品或讨论心灵现象（psychic phenomena）的语境。在学术或新闻写作里，若强调缺乏证据，常会加上 claimed / alleged 等词来保持中立。"]}
{"word":"prerecognize","summary":{"en":"“Prerecognize” means to recognize or foresee something in advance.","zh":"“prerecognize”指“事先认出/预先识别；预见”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to recognize or identify something beforehand; to foresee or anticipate.","zh":"事先认出；预先识别；预见；预先察觉。"},"examples":[{"en":"Experienced nurses can sometimes prerecognize signs of infection before the lab results come back.","zh":"有经验的护士有时能在化验结果出来前就预先察觉感染迹象。"},{"en":"The team prerecognized the risks and prepared a backup plan.","zh":"团队预先识别了风险，并准备了备用方案。"}]}],"synonyms":["anticipate","foresee","predict","recognize in advance","preidentify"],"phonetic":"/ˌpriːˈrɛkəɡnaɪz/","extraExplanation":["“prerecognize”在现代英语中非常少见，更多见于较正式或技术性的语境。日常表达中，人们通常用“anticipate / foresee / predict / recognize in advance”等更常用的说法。","构词上：pre-（预先）+ recognize（识别/认出），字面意思就是“提前认出/提前识别”。"]}
{"word":"prerecognized","summary":{"en":"“Prerecognized” means already recognized or acknowledged in advance, often in technical or formal contexts.","zh":"“Prerecognized”指“预先被识别/被承认的”，多见于技术或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"recognized in advance; already known or accepted before something happens (often used as an adjective, especially in technical or formal writing).","zh":"预先被识别的；事先就被认识或承认的（常作形容词，用于技术或正式语境）。"},"examples":[{"en":"The system works best with prerecognized patterns, like common shapes and letters.","zh":"系统在处理预先识别的模式（比如常见形状和字母）时效果最好。"},{"en":"Her contributions were prerecognized by the team before the official announcement.","zh":"在正式宣布之前，团队就已经事先认可了她的贡献。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past form of \"prerecognize\") to recognize or identify beforehand; to acknowledge in advance (rare).","zh":"（prerecognize 的过去式）预先识别；事先承认或确认（较少见）。"},"examples":[{"en":"The panel prerecognized several risks and planned responses early.","zh":"评审小组事先识别了几项风险，并提前制定了应对方案。"}]}],"synonyms":["pre-identified","previously recognized","recognized in advance","preapproved","preknown"],"phonetic":"ˌpriːˈrɛkəɡnaɪzd","extraExplanation":["“prerecognized”不是非常常见的日常用词，更常见的表达是 “recognized in advance / previously recognized / pre-identified”。在计算机视觉、OCR（文字识别）、数据标注等领域，会看到它用来表示“系统/模型已经能识别的东西”。","构词上由前缀 pre-（在……之前）+ recognized（被识别/被承认的）组成，因此整体意思直观：在事件发生前就已识别或认可。"]}
{"word":"prerecognizing","summary":{"en":"“Prerecognizing” means recognizing something in advance; it can also be a rare legal term for taking testimony beforehand.","zh":"“prerecognizing”指“预先识别/提前认出”；也可作少见的法律用语，指“庭前预先取证/讯问”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Recognizing something in advance; noticing or identifying it before it fully happens or before you see it clearly.","zh":"预先识别；提前认出（在事情完全发生或看清之前就先判断出来）。"},"examples":[{"en":"From the first chapter, the reader is prerecognizing the twist because of the small clues.","zh":"从第一章开始，读者就因为一些小线索而提前识别到了反转。"},{"en":"Good trainers are prerecognizing injuries by watching tiny changes in movement.","zh":"优秀的教练会通过观察动作的细微变化来提前识别伤病。"}]},{"partOfSpeech":"v.","definition":{"en":"In some legal contexts (especially in Scotland), taking or recording an advance statement or testimony before a trial; examining a witness beforehand.","zh":"（某些法律语境中，尤指苏格兰）在审判前预先获取/记录证词；提前讯问证人。"},"examples":[{"en":"The lawyer focused on prerecognizing key witnesses before court.","zh":"律师把重点放在开庭前对关键证人进行预先讯问上。"},{"en":"Prerecognizing the facts helped the team prepare their case.","zh":"预先了解并记录事实帮助团队准备案件。"}]}],"synonyms":["anticipating","foreseeing","recognizing early","seeing (something) coming","predicting"],"phonetic":"/ˌpriːˈrɛkəɡnaɪzɪŋ/","extraExplanation":["“prerecognizing”是动词“prerecognize”的现在分词形式，但在现代英语中非常少见。更自然的表达通常是“recognizing in advance / anticipating / seeing it coming”。","如果你是在写作或学术语境中想表达“提前识别”，可以考虑用更常见的搭配：“early recognition（早期识别）”“pattern recognition（模式识别）”“anticipate（预判）”。","法律义项更偏专业用法；日常英语里一般不这么说。"]}
{"word":"prerecommend","summary":{"en":"“Prerecommend” is an uncommon verb meaning “recommend in advance.”","zh":"“prerecommend”是不太常见的动词，意思是“提前/预先推荐”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to recommend something in advance (before a decision, event, or formal request)","zh":"预先推荐；提前推荐（在决定、活动或正式申请之前先提出推荐）"},"examples":[{"en":"The advisor pre-recommended three courses so I could register quickly.","zh":"导师提前推荐了三门课，这样我就能快速选课。"},{"en":"Can you pre-recommend a good hotel before we finalize our itinerary?","zh":"在我们最后确定行程前，你能先推荐一家好酒店吗？"}]}],"synonyms":["recommend in advance","recommend beforehand","suggest ahead of time"],"phonetic":"/ˌpriːˌrɛkəˈmɛnd/","extraExplanation":["“prerecommend”并不是常见或标准的英语单词，多见于内部文件、产品功能描述或非正式写作中。更自然的表达通常是：recommend in advance / recommend beforehand / preselect and recommend。","写作时若担心读者不熟悉，可用连字符写成“pre-recommend”，或直接改成更常见的短语以避免生硬。"]}
{"word":"prerecommendation","summary":{"en":"A recommendation given in advance (often informal).","zh":"事先给出的推荐（多为非正式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A recommendation made in advance, before a final decision, full evaluation, or official process (often informal or specialized usage).","zh":"事先提出的推荐；在最终决定、完整评估或正式流程之前给出的推荐（多为非正式或特定领域用法）。"},"examples":[{"en":"The recruiter gave a prerecommendation based on the candidate’s resume, but the final decision came after the interview.","zh":"招聘人员根据简历先给了一个事先推荐，但最终决定在面试后才做出。"},{"en":"Before the committee meeting, the chair circulated a prerecommendation to guide discussion.","zh":"在委员会开会前，主席发出一份事先推荐，用来引导讨论。"}]}],"synonyms":["advance recommendation","preliminary recommendation","initial recommendation","early recommendation"],"phonetic":"/ˌpriˌrɛkəˌmɛnˈdeɪʃən/","extraExplanation":["“prerecommendation”不是非常常见的标准词，更多见于内部流程/表格/行业写法。日常英语里更自然的表达通常是：advance recommendation（事先推荐）、preliminary recommendation（初步建议/初步推荐）、initial recommendation（初步推荐）。","构词上由前缀 pre-（在……之前）+ recommendation（推荐）组成；有时也会写成带连字符的 pre-recommendation。"]}
{"word":"prereconcile","summary":{"en":"“Prereconcile” means to reconcile records ahead of time, especially in accounting.","zh":"“Prereconcile”指在正式对账前先进行预先核对，常用于会计与财务场景。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to reconcile in advance; to compare and match records (such as transactions) before the final reconciliation step","zh":"预先对账；在最终对账前，先对记录（如交易）进行比对并找出差异"},"examples":[{"en":"We prereconciled the bank transactions to catch errors before month-end closing.","zh":"我们先预先对账银行交易，以便在月末结账前发现错误。"},{"en":"The accounting team prereconciles invoices with purchase orders every Friday.","zh":"会计团队每周五都会先把发票与采购订单预先核对。"},{"en":"This tool lets you prereconcile payments against open bills.","zh":"这个工具可以让你把付款与未结账单进行预先匹配核对。"}]}],"synonyms":["reconcile in advance","pre-reconcile","do a preliminary reconciliation","pre-match"],"phonetic":"/ˌpriːˈrɛkənsaɪl/","extraExplanation":["“prereconcile”常见于会计、财务软件与数据处理场景，表示在正式（final）reconciliation之前做的一轮“提前匹配/提前核对”。它通常是“pre- + reconcile”的构词，很多时候也会写作“pre-reconcile”。","在正式写作中更常见的表达是：reconcile in advance / do a preliminary reconciliation / perform pre-reconciliation。"]}
{"word":"prereconciled","summary":{"en":"Prereconciled means already reconciled or matched ahead of a later step, especially in accounting or data workflows.","zh":"Prereconciled 指在后续流程之前就已完成对账/核对一致（多用于会计或数据流程）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"already reconciled or matched before a later step (often used in accounting, data processing, or operations).","zh":"在后续步骤之前就已对账/核对一致（常用于会计、数据处理或运营场景）。"},"examples":[{"en":"These transactions are prereconciled, so they won’t appear in the review queue.","zh":"这些交易已预先对账，因此不会出现在复核队列中。"},{"en":"We use a prereconciled dataset to reduce errors in the final report.","zh":"我们使用预先核对过的数据集来减少最终报告中的错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) reconciled in advance in a relationship or disagreement, so conflict is resolved before it arises again.","zh":"（较少见）提前和解/消除分歧，使矛盾在再次出现前就已解决。"},"examples":[{"en":"They set clear boundaries and felt prereconciled before meeting the team again.","zh":"他们先明确了界限，再次见团队前就感觉已提前和解。"}]}],"synonyms":["pre-reconciled","already reconciled","pre-matched","pre-verified"],"phonetic":"/ˌpriːˈrɛkənsaɪld/","extraExplanation":["“prereconciled”由前缀 pre-（预先）+ reconciled（已对账/已调和）构成，多见于企业软件、财务系统或数据管道的字段名/状态名，属于偏行业化的用词；日常英语里更常说 “already reconciled” 或 “pre-reconciled”。","在会计语境里 reconcile 常指“对账/核对一致”（如银行对账）；在一般语境里则指“调和、和解”。因此理解时要根据上下文判断。"]}
{"word":"prereconcilement","summary":{"en":"A rare noun meaning reconciliation done in advance; sometimes used in formal or religious contexts for preparation to be reconciled.","zh":"一个罕见名词，指“预先的和解/复和”；在正式或宗教语境中也可指为复和所做的准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) reconciliation done in advance; the act of making peace or restoring a good relationship before something else happens.","zh":"（罕见）预先的和解／调解；在某事发生之前先恢复关系、消除冲突的行为。"},"examples":[{"en":"The mediator pushed for prereconcilement so the two sides could negotiate calmly.","zh":"调解员推动先进行预先和解，好让双方能冷静谈判。"},{"en":"They tried a kind of prereconcilement before the family meeting to avoid an argument.","zh":"他们在家庭会议前做了某种“预先和解”，以避免争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"(Religious or formal, rare) preparation for being reconciled—often with God or a community—before a major event (such as a crisis, death, or a public apology).","zh":"（宗教或正式语境，罕见）在重大事件（如危机、临终或公开道歉）之前，为与上帝或群体“复和/修好”所做的准备或安排。"},"examples":[{"en":"In older religious writing, prereconcilement could refer to spiritual preparation before a final confession.","zh":"在较古老的宗教著作中，prereconcilement 有时指临终告解前的灵性准备。"},{"en":"The ritual was described as a prereconcilement with the community after a serious offense.","zh":"该仪式被描述为在严重冒犯之后与社群复和的“预先步骤”。"}]}],"synonyms":["pre-reconciliation","prior reconciliation","reconciliation","making peace beforehand"],"phonetic":"/ˌpriˌrɛkənˈsaɪlmənt/","extraExplanation":["这个词非常少见，常见的现代英语更倾向用 reconciliation（和解、复和）或 make peace beforehand（提前和解）来表达。","构词上是 pre-（在……之前）+ reconcilement（和解；较少用，更多见 reconciliation）。因此 prereconcilement 带有明显的“书面/古风”色彩。"]}
{"word":"prereconciliation","summary":{"en":"Prereconciliation means “before reconciliation,” used in relationship, legal, or accounting contexts.","zh":"prereconciliation 表示“在和解/对账之前”，常见于关系、法律或会计语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Used as an adjective) Happening or existing before reconciliation (the act of restoring friendly relations or bringing accounts into agreement).","zh":"（作形容词）发生在“和解/对账核对（reconciliation）”之前的；和解前的；对账前的。"},"examples":[{"en":"The report focuses on prereconciliation disputes and how they escalated.","zh":"这份报告关注和解前的争议以及它们如何升级。"},{"en":"In accounting, prereconciliation balances may include uncleared bank transactions.","zh":"在会计中，对账前的余额可能包含尚未清算的银行交易。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or stage before reconciliation.","zh":"和解/对账之前的阶段；和解前时期。"},"examples":[{"en":"They needed counseling during the prereconciliation to rebuild trust.","zh":"在和解前阶段，他们需要心理咨询来重建信任。"},{"en":"Audit notes highlighted errors made in the prereconciliation.","zh":"审计备注指出了对账前阶段出现的错误。"}]}],"synonyms":["pre-reconciliation","before reconciliation","prior to reconciliation"],"phonetic":"/ˌpriˌrɛkənˌsɪliˈeɪʃən/","extraExplanation":["这个词在日常英语里不算常见，更常见的写法是带连字符的 **pre-reconciliation**，用来强调“reconciliation 之前的”。在财务/会计语境里，reconciliation 常指“对账、核对账目”；在人际或政治语境里则更偏“和解、修复关系”。","构词上是前缀 **pre-**（在……之前）+ **reconciliation**（和解；对账）。正式写作中如果当作定语修饰名词（如 *pre-reconciliation meeting*），通常更自然。"]}
{"word":"prereconciling","summary":{"en":"“Prereconciling” means doing an advance/preliminary reconciliation—checking and matching records before the final reconciliation.","zh":"“Prereconciling”指“预对账/预核对”：在最终对账之前先把记录进行提前匹配和检查。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of checking and matching records (such as payments, invoices, or transactions) in advance, before doing a final reconciliation","zh":"在正式“对账/核对”之前，提前检查并匹配记录（如付款、发票或交易）的过程"},"examples":[{"en":"We’re prereconciling last month’s card transactions so the final close goes faster.","zh":"我们在对上个月的刷卡交易做预对账，这样月底正式结账会更快。"},{"en":"The finance team spent the morning prereconciling vendor invoices against purchase orders.","zh":"财务团队上午在把供应商发票和采购订单进行预核对。"}]}],"synonyms":["pre-reconciling","doing a preliminary reconciliation","reconciling in advance","prechecking records"],"phonetic":"/ˌpriːˈrɛkənˌsaɪlɪŋ/","extraExplanation":["“prereconciling”多见于会计、财务运营、数据对账等工作语境，属于相对不常见的业务用语。更常见、标准的表达是“do a preliminary reconciliation / pre-reconcile (transactions) / reconcile in advance”。","词形上可理解为“pre-（预先）+ reconcile（对账/调和）+ -ing（进行中/动名词）”。在正式写作中，建议根据语境改用更常见的说法以避免读者困惑。"]}
{"word":"prerecord","summary":{"en":"Prererecord means to record something ahead of time to use later.","zh":"prerecord 指为了之后使用而提前录制内容。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to record something in advance so it can be played or broadcast later","zh":"（为之后播放或播出而）预先录制"},"examples":[{"en":"We prerecord the interviews and edit them before the show airs.","zh":"我们会先把采访预录下来，剪辑后再播出。"},{"en":"The band prerecorded the vocals to save time during the live event.","zh":"为了节省现场活动时间，乐队把人声提前录好了。"}]},{"partOfSpeech":"v.","definition":{"en":"(in education or work) to record a lesson, presentation, or message ahead of time","zh":"（在教学或工作中）提前录制课程、演示或信息"},"examples":[{"en":"She prerecorded a short video lesson for students who couldn’t attend.","zh":"她为无法到场的学生提前录制了一段简短的视频课。"},{"en":"Please prerecord your presentation and upload it by Friday.","zh":"请提前录制你的演示，并在周五前上传。"}]}],"synonyms":["pre-record","record in advance","tape ahead of time"],"phonetic":"/ˌpriːrɪˈkɔrd/","extraExplanation":["“prerecord”常见于媒体与内容制作语境（电视、播客、直播带货、线上课程等）。它强调“不是现场实时发生”，而是先录好再播放。","拼写上也常见作“pre-record”（加连字符），在较正式的写作或标题里更常用；口语和网络文本中也常写成一个词“prerecord”。","相关对比：live（直播/现场） vs. prerecorded / pre-recorded（预录/录播）。"]}
{"word":"prerecorded","summary":{"en":"Prererecorded means recorded earlier to be played later, not live.","zh":"prerecorded 指“事先录制的、之后播放的”，不是直播或现场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made, captured, or stored earlier (audio or video) to be played later, not live","zh":"预先录制的；事先录好的（音频或视频），非现场直播"},"examples":[{"en":"The show includes a prerecorded interview with the author.","zh":"节目包含一段事先录好的作者采访。"},{"en":"Please leave a message after the prerecorded greeting.","zh":"请在预录的问候语之后留言。"},{"en":"The class has prerecorded lectures you can watch anytime.","zh":"这门课有预先录制的讲座，你可以随时观看。"}]}],"synonyms":["pre-recorded","recorded","taped","not live"],"phonetic":"/ˌpriːrɪˈkɔːrdɪd/","extraExplanation":["在媒体和活动中，prerecorded 常用来对比 live（直播/现场）。例如 “live and prerecorded content”（直播与预录内容）。","常见搭配：prerecorded message（预录留言/语音提示）、prerecorded greeting（预录问候语）、prerecorded video/lecture（预录视频/课程）。","拼写提示：pre- 表示“在……之前”，recorded 表示“录制过的”。因此 prerecorded 强调“事先录好、之后再播放”。"]}
{"word":"prerecording","summary":{"en":"A prerecording is audio or video recorded ahead of time (not live).","zh":"prerecording 指提前录制好的音频或视频（非直播/非现场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A recording made in advance (before an event or broadcast), rather than performed live.","zh":"预先录制的内容（在活动或播出前录好的录音/录像），不是现场表演或直播。"},"examples":[{"en":"The show uses prerecordings for some musical performances.","zh":"这个节目有些音乐表演使用预录内容。"},{"en":"Because of the time difference, the interview was a prerecording.","zh":"因为时差问题，那次采访是预先录制的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made or done in advance as a recording.","zh":"（作为录音/录像）预先录制的。"},"examples":[{"en":"They played a prerecording message before the meeting started.","zh":"他们在会议开始前播放了一段预先录制的消息。"},{"en":"The presenter read from a prerecording track to keep the timing perfect.","zh":"主持人跟着预录音轨朗读，以确保时间精准。"}]}],"synonyms":["pre-recording","recording in advance","prerecorded segment","taped segment"],"phonetic":"/ˌpriːrɪˈkɔːrdɪŋ/","extraExplanation":["在媒体语境里，prerecording 常和 live（直播/现场）对比使用：live 表示实时发生；prerecorded/prerecording 表示提前录好再播放。","更常见的拼写/形式是形容词 prerecorded（如 a prerecorded video）；名词也常写作 pre-recording（加连字符）或用短语 a pre-recorded segment（预录片段）。"]}
{"word":"prerecords","summary":{"en":"“Prerecords” usually means records in advance (verb: prerecords), or less commonly the prerecordings themselves (noun: prerecords).","zh":"“prerecords”通常是动词第三人称单数，表示“预先录制”；较少见时也可作名词复数，指“预录内容/素材”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to record (audio, video, a TV show, a message, etc.) in advance, so it can be played or broadcast later","zh":"预先录制（音频、视频、节目、留言等），以便之后播放或播出"},"examples":[{"en":"The interview was prerecorde d and aired the next day.","zh":"这段采访是预先录制的，第二天才播出。"},{"en":"They prerecord the safety announcement so it sounds the same on every flight.","zh":"他们会预先录制安全提示，这样每次航班听起来都一致。"},{"en":"The band prerecords some parts for the live show.","zh":"乐队会为现场演出预先录制一些部分。"}]},{"partOfSpeech":"n.","definition":{"en":"recordings made in advance (plural form)","zh":"预先录制的内容；预录素材（复数）"},"examples":[{"en":"The producer used prerecords for the opening narration.","zh":"制片人用预录素材来做开场旁白。"},{"en":"In some competitions, prerecords are not allowed.","zh":"在一些比赛中，不允许使用预录内容。"}]}],"synonyms":["pre-record","record in advance","tape ahead of time"],"phonetic":"/ˌpriːrɪˈkɔrd/","extraExplanation":["“prerecord”常见于电视、广播、网络直播等语境，用来强调“不是现场（live）”。有时也会与“pre-recorded（预录的）”这个形容词形式一起出现。","拼写上也常写作“pre-record / pre-recorded”（带连字符），意思相同。"]}
{"word":"prerectal","summary":{"en":"“Prerectal” means “in front of the rectum,” mainly used in medical/anatomy contexts.","zh":"“Prerectal” 指“直肠前方的”，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Located in front of the rectum; relating to the area immediately before the rectum.","zh":"（解剖/医学）位于直肠前方的；与直肠前方区域有关的。"},"examples":[{"en":"The scan showed a small prerectal mass that needed further evaluation.","zh":"影像检查显示有一个小的直肠前肿块，需要进一步评估。"},{"en":"Surgeons must be careful of prerectal tissues during pelvic procedures.","zh":"在进行盆腔手术时，外科医生必须小心处理直肠前组织。"}]}],"synonyms":["anterior to the rectum","pre-rectal","rectal anterior"],"phonetic":"/ˌpriːˈrɛktəl/","extraExplanation":["这是一个较少见、偏医学的形容词：pre- 表示“在……之前/前方”，rectal 表示“直肠的”，合起来就是“直肠前的/直肠前方的”。在临床语境中更常见的相关说法包括 “anterior to the rectum”（在直肠前方）或根据解剖结构具体写成 “presacral/retrorectal”等更精确的部位术语。"]}
{"word":"preredeem","summary":{"en":"“Preredeem” (often written “pre-redeem”) means to redeem something early or in advance.","zh":"“Preredeem”（常写作“pre-redeem”）指“提前兑换/预先赎回”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to redeem something in advance; to exchange a coupon, code, points, or a benefit before the normal time or official redemption period","zh":"提前兑换；在正常时间或正式兑换期之前把优惠券、兑换码、积分或权益换成实际物品/福利"},"examples":[{"en":"You can preredeem your gift card online before you visit the store.","zh":"你可以在去商店之前先在网上提前兑换礼品卡。"},{"en":"Some airlines let members preredeem miles for seat upgrades during a promotion.","zh":"一些航空公司允许会员在促销期间用里程提前兑换座位升舱。"},{"en":"I preredeemed the voucher so I wouldn’t forget it later.","zh":"我把优惠券提前兑换了，免得之后忘记。"}]}],"synonyms":["redeem early","redeem in advance","pre-redeem","cash in early"],"phonetic":"/ˌpriːrɪˈdiːm/","extraExplanation":["“preredeem”不是非常常见的标准词，更常见的写法是带连字符的“pre-redeem”，意思是“预先兑换”。它多见于电商、会员积分、游戏兑换码、金融产品（如提前赎回/兑现）等语境。正式写作中可考虑用更常见表达：redeem early / redeem in advance。"]}
{"word":"preredemption","summary":{"en":"Preredemption means the time or condition before redemption (financial redemption or moral/spiritual redemption).","zh":"preredemption 指“赎回/救赎之前”的时期或状态，可用于金融或文学/宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period or state before something is redeemed (paid back, exchanged, or saved from harm).","zh":"赎回/偿还/兑换或“得救”之前的阶段或状态。"},"examples":[{"en":"During the preredemption period, the bond cannot be cashed in early.","zh":"在提前赎回前的期间，这种债券不能提前兑现。"},{"en":"The novel focuses on the hero’s preredemption years, when he is still making serious mistakes.","zh":"这部小说聚焦于主人公“获得救赎之前”的岁月，那时他仍在犯严重的错误。"}]}],"synonyms":["pre-redemption period","preliminary stage","prelude"],"phonetic":"/ˌpriːrɪˈdempʃən/","extraExplanation":["这个词更常见的写法是带连字符的 **pre-redemption**，表示“赎回/救赎之前”。在金融语境里通常指“赎回前（限制）期、未到可赎回阶段”。在宗教或文学语境里则更接近“救赎前的状态/阶段”。","构词法：**pre-**（在……之前）+ **redemption**（赎回；救赎）。因此理解为“before redemption”最直接。"]}
{"word":"prereduction","summary":{"en":"Prereduction means a preliminary decrease or a preliminary chemical reduction done before the main step.","zh":"prereduction 指“预先减少/预处理降幅”，也可指化学中的“预还原”步骤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reduction or decrease that happens beforehand; an earlier step taken to reduce something (such as weight, cost, pressure, or size) before the main process.","zh":"预先减少；在主要过程开始之前进行的减量/降幅（如先降低重量、成本、压力或尺寸等）。"},"examples":[{"en":"The engineer recommended a prereduction in pressure before the valve is opened fully.","zh":"工程师建议在阀门完全打开之前先预先降低压力。"},{"en":"A small prereduction in package size helped the company cut shipping costs.","zh":"先把包装尺寸略微缩小，有助于公司降低运输成本。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry/biochemistry) A preliminary reduction step—adding electrons or hydrogen to a substance—done before another reaction or analysis.","zh":"（化学/生化）预还原步骤；在后续反应或检测之前，先对物质进行还原（获得电子或加氢）的预处理。"},"examples":[{"en":"The protocol includes a prereduction of the sample to stabilize the reagent.","zh":"该流程包含对样品的预还原，以稳定试剂。"},{"en":"Prereduction can improve the accuracy of certain redox measurements.","zh":"预还原可以提高某些氧化还原测量的准确性。"}]}],"synonyms":["pre-reduction","preliminary reduction","initial reduction","early reduction","pretreatment reduction"],"phonetic":"/ˌpriːrɪˈdʌkʃən/","extraExplanation":["“prereduction”通常写作带连字符的 **pre-reduction**，在学术论文、工程说明或实验步骤里更常见；日常口语中较少用。","构词很好理解：**pre-**（在……之前）+ **reduction**（减少/还原）。根据语境，它可能指“先降低/先缩减”，也可能指化学意义的“预还原”。阅读时可通过附近词判断：如出现 pressure/cost/size，多半是“减少”；出现 electrons/redox/reagent，多半是“还原”。"]}
{"word":"prerefer","summary":{"en":"“Prefer” means to like or choose one thing more than another; it can also mean to give someone/something an advantage (formal).","zh":"“Prefer”表示“更喜欢/更愿意选择”；也可表示（较正式）“优待、使更占优势”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often used with “to”) to like one option more than another; to choose something because you like it better.","zh":"（常与 to 连用）更喜欢某个选项；因为更喜欢而选择。"},"examples":[{"en":"I prefer tea to coffee.","zh":"我更喜欢喝茶而不是咖啡。"},{"en":"Do you prefer to walk or take the bus?","zh":"你更喜欢走路还是坐公交？"},{"en":"She prefers working in the morning when it’s quiet.","zh":"她更喜欢在安静的早晨工作。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give something or someone an advantage; to favor one option over others (more formal).","zh":"（较正式）给予某事/某人优先或优势；偏袒、优待。"},"examples":[{"en":"The new policy may prefer large companies over small ones.","zh":"新政策可能会让大公司比小公司更占优势。"},{"en":"We should not prefer one student over another.","zh":"我们不应该偏袒任何学生。"}]}],"synonyms":["like better","choose","favor","opt for","would rather"],"phonetic":"/prɪˈfɝ/","extraExplanation":["你写的“prerefer”通常是拼写错误；正确拼写是 **prefer**。","常见搭配：**prefer A to B**（比起B更喜欢A）；**prefer to do**（更喜欢做某事）；**would prefer**（更想/宁愿，语气更礼貌）。注意：不要说“prefer than”，通常用 **to**。"]}
{"word":"prereference","summary":{"en":"Preference means what you like better, or priority given to someone/something.","zh":"Preference 指“偏好/更喜欢”，也可指“优先权/优先考虑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly intended word) a greater liking for one thing than another; a choice you like better.","zh":"（常见想表达的词）偏爱；更喜欢某物而非另一物；偏好的选择。"},"examples":[{"en":"I have a preference for tea over coffee.","zh":"比起咖啡，我更偏爱茶。"},{"en":"Tell us your seating preference: window or aisle.","zh":"告诉我们你的座位偏好：靠窗还是靠走道？"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) the fact of being chosen first or having priority in a situation.","zh":"（较少见）优先权；在某种情况下被优先选择的资格。"},"examples":[{"en":"Local residents are given preference for the job.","zh":"当地居民在这份工作上享有优先权。"},{"en":"Applications with complete documents will receive preference.","zh":"材料齐全的申请将被优先处理。"}]}],"synonyms":["choice","liking","favor","priority","inclination"],"phonetic":"/ˈprɛf(ə)rəns/","extraExplanation":["“prereference”不是标准英文拼写，通常是把“preference”拼错了。标准拼写是 preference。","如果你想表达“事先的参考资料/预先引用”，英语更常说 pre-reference（较少用）、prior reference，或更自然的 reference beforehand。"]}
{"word":"prereferred","summary":{"en":"“Prereferred” is usually a misspelling of “preferred” (liked most / chosen as the best).","zh":"“prereferred”通常是“preferred”的拼写错误，意思是“更喜欢的/首选的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “preferred.”","zh":"不是标准英语单词；最常见是把“preferred（更喜欢的/首选的）”拼错了。"},"examples":[{"en":"I think you mean “preferred,” not “prereferred.”","zh":"我想你要写的是“preferred”，不是“prereferred”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(preferred) liked more than another option; chosen as the best or most suitable.","zh":"（preferred）更喜欢的；首选的；认为最合适的。"},"examples":[{"en":"Email is my preferred way to contact me.","zh":"电子邮件是我首选的联系方式。"},{"en":"We chose the preferred candidate after the final interview.","zh":"最终面试后，我们选定了首选候选人。"}]},{"partOfSpeech":"v.","definition":{"en":"(preferred) past tense/past participle of “prefer”: to like one thing more than another.","zh":"（preferred）“prefer”的过去式/过去分词：更喜欢某物胜过另一物。"},"examples":[{"en":"She preferred tea to coffee.","zh":"她更喜欢茶而不是咖啡。"},{"en":"I preferred to stay home because it was raining.","zh":"因为下雨，我更愿意待在家里。"}]}],"synonyms":["favorite","favored","recommended","chosen","selected"],"phonetic":"/prɪˈfɝd/","extraExplanation":["“preferred”是“prefer”后面接-ed的规则变化，但因为词尾是r且重读在后一个音节（pre-FER），所以要双写r：prefer → preferred。常见错误拼成“prereferred”。如果你想表达“之前被转介/介绍”，英语更常说“was referred earlier / previously referred”。"]}
{"word":"prereferring","summary":{"en":"“Preferring” means liking or choosing something more than another thing (present participle of “prefer”).","zh":"“preferring”表示更喜欢/更倾向于选择某事物（是“prefer”的现在分词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the present participle of “prefer”; liking or choosing one thing more than another","zh":"“prefer”的现在分词；更喜欢/更倾向于选择某一事物而不是另一事物"},"examples":[{"en":"She is preferring tea to coffee these days.","zh":"她这些天更喜欢喝茶而不是咖啡。"},{"en":"I’m preferring quieter places since I moved to the city.","zh":"自从我搬到城里后，我更喜欢安静一点的地方。"}]}],"synonyms":["liking","choosing","favoring","opting for"],"phonetic":"/prɪˈfɝɪŋ/","extraExplanation":["“prereferring”一般不是标准拼写。最常见的正确形式是“preferring”。如果你想表达“提前推荐/事先转介（refer）”，英语通常会写成“pre-referring（to）”或用更自然的说法如“refer in advance / make an early referral”。","用法提示：prefer 常见结构是“prefer A to B”（更喜欢A而不是B）以及“prefer to do / prefer doing”（更喜欢做某事）。在口语里谈“当前的偏好变化”偶尔会用进行时（I’m preferring…），但更常见、也更自然的是一般现在时（I prefer…）。"]}
{"word":"prerefine","summary":{"en":"Prerefine means to refine or improve something in an early step before the final refining.","zh":"Prerefine 指在最终精炼/完善之前，先进行预先精炼或初步改进。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to refine something in an earlier step (before a later, final refining process)","zh":"对某物进行预先精炼/预先提纯（在后续最终精炼之前的步骤）"},"examples":[{"en":"The crude oil is prerefined to remove water and salts before it enters the main refinery units.","zh":"原油会先进行预先提纯，去除水分和盐分，然后再进入主要炼油装置。"},{"en":"Researchers prerefined the raw data to reduce noise before running the final model.","zh":"研究人员先对原始数据做预处理式的“预先精炼”，降低噪声，再运行最终模型。"}]},{"partOfSpeech":"vt.","definition":{"en":"to improve a draft or idea slightly in advance (often used in technical or writing contexts)","zh":"提前对草稿/想法做初步润色或改进（常见于技术或写作语境）"},"examples":[{"en":"I prerefined the outline so the team could give feedback on the structure.","zh":"我先把大纲做了初步润色，方便团队对结构提出反馈。"},{"en":"Try prerefining your argument before you write the final version.","zh":"在写最终稿之前，先把论点做一次初步打磨。"}]}],"synonyms":["pre-refine","preprocess","pre-treat","purify (partly)","polish"],"phonetic":"/ˌpriːrɪˈfaɪn/","extraExplanation":["“prerefine”由前缀“pre-（在……之前）”+“refine（精炼/改进）”组成，多见于工程、化工、数据处理等领域的流程描述。日常英语里更常用的表达是“pre-refine”（带连字符）或用更具体的词替代，如“preprocess（预处理）”“pre-treat（预处理/预先处理）”“polish（润色）”。"]}
{"word":"prerefined","summary":{"en":"Prerefined means refined or improved ahead of time, especially before a later manufacturing or processing step.","zh":"Prerefined 指“预先精炼/提前改进过的”，常用于强调在后续加工步骤之前已完成提纯或优化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Refined in advance; processed to remove impurities or improve quality before a later step or use.","zh":"预先精炼的；在后续步骤或使用之前就已进行提纯/精制处理的。"},"examples":[{"en":"The factory buys prerefined sugar to save time during production.","zh":"工厂购买预先精炼的糖，以节省生产时间。"},{"en":"We used prerefined oil so the final product would have a cleaner taste.","zh":"我们使用预先精炼的油，使成品口感更纯净。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) Made more polished or improved ahead of time (e.g., a material, plan, or draft).","zh":"（更广义）预先打磨/改进过的；提前完善的（如材料、方案或草稿）。"},"examples":[{"en":"She shared a prerefined draft of the proposal with the team.","zh":"她把一份预先完善过的提案草稿分享给团队。"},{"en":"The editor asked for prerefined notes before the meeting.","zh":"编辑要求在会议前先整理出更完善的笔记。"}]}],"synonyms":["pre-refined","preprocessed","already refined","refined beforehand","purified"],"phonetic":"/ˌpriːrɪˈfaɪnd/","extraExplanation":["“prerefined”由前缀“pre-”（在……之前）+ “refined”（精炼的/改良的）构成，常见于工业、化工、食品加工等语境，用来强调“在下一道工序前就已完成精炼”。在日常英语中不算高频词，更常见的替代表达有“already refined”“pre-processed”或“refined beforehand”。"]}
{"word":"prerefinement","summary":{"en":"Prerefinement means a preparatory stage before later refinement or purification.","zh":"prerefinement 指在后续精炼/提纯/优化之前的预处理阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stage or process that happens before refinement, meant to prepare something for later improvement or purification","zh":"精炼/提纯/优化之前的阶段或过程，用来为后续改进或净化做准备"},"examples":[{"en":"The prerefinement step removes large impurities before the final purification.","zh":"预精炼步骤会在最终提纯前去除较大的杂质。"},{"en":"We do prerefinement on the draft to fix the structure before polishing the language.","zh":"我们先对草稿做预优化，先把结构理顺，再润色语言。"},{"en":"Engineers added a prerefinement stage to reduce waste in the later process.","zh":"工程师增加了预精炼阶段，以减少后续流程的浪费。"}]}],"synonyms":["pre-refinement","preprocessing","pre-treatment","preliminary treatment","roughing (stage)"],"phonetic":"/ˌpriːrɪˈfaɪnmənt/","extraExplanation":["“prerefinement”通常写作“pre-refinement”（带连字符）更常见；在学术/工程写作中也可能写成“pre refinement”。它多见于制造业（如金属、石油、化工）表示“初步处理/预提纯”，在写作或算法流程里也可引申为“正式打磨前的预处理/预优化”。","词源构成很透明：pre-（在……之前）+ refinement（精炼、提纯、改进）。因此它一般是可数或不可数名词都能用，取决于你指的是“一道步骤/阶段”（可数）还是“一个过程”（不可数）。"]}
{"word":"prerefining","summary":{"en":"Prerefining means an early, preparatory refining step done before the main refining process, mainly used in technical/industrial contexts.","zh":"Prerefining 指在主要精炼/提纯之前进行的预先精炼步骤，多用于工业与技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of refining something in an early or preliminary step before the main refining stage (often in industry, e.g., oil, sugar, metals, chemicals)","zh":"预精炼；预处理式的精炼：在正式精炼之前进行的前期精炼/提纯步骤（常用于工业领域，如石油、糖、金属、化工等）"},"examples":[{"en":"Prerefining removes impurities so the main refining step is faster and cheaper.","zh":"预精炼先去除杂质，使后续的主要精炼步骤更快、更省成本。"},{"en":"The plant added a prerefining unit to improve product quality.","zh":"工厂增加了预精炼装置来提升产品质量。"}]},{"partOfSpeech":"adj.","definition":{"en":"done as an early refining step; serving to prepare material for later refining","zh":"预精炼的；用于在后续精炼前进行准备的"},"examples":[{"en":"They used prerefining filtration to reduce solids before processing.","zh":"他们用预精炼过滤在加工前降低固体含量。"},{"en":"Prerefining treatment can lower sulfur levels ahead of full refining.","zh":"预精炼处理可以在全面精炼前降低硫含量。"}]}],"synonyms":["pre-refining","pre-treatment","preprocessing","preliminary refining"],"phonetic":"/ˌpriːrɪˈfaɪnɪŋ/","extraExplanation":["“prerefining”多见于技术/工程写作，是由前缀“pre-（在……之前）”+“refining（精炼/提纯）”构成的行业用词；日常英语里更常说“pre-treatment（预处理）”或“preprocessing（预加工）”，具体用哪个取决于工艺是否确实属于“refining（精炼/提纯）”范畴。"]}
{"word":"prereform","summary":{"en":"“Prereform” means “before reforms,” usually describing the period, policies, or conditions that existed prior to major changes.","zh":"“prereform”表示“改革前的”，通常用来描述重大改革实施之前的时期、政策或状况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written “pre-reform”) happening in, relating to, or characteristic of the period before a major set of reforms or policy changes.","zh":"（常写作“pre-reform”）改革之前的；与改革前时期有关的；具有改革前特征的。"},"examples":[{"en":"The paper compares pre-reform education with the current system.","zh":"这篇论文比较了改革前的教育与现行制度。"},{"en":"Pre-reform housing policies made it hard for young families to buy a home.","zh":"改革前的住房政策让年轻家庭很难买房。"}]},{"partOfSpeech":"n.","definition":{"en":"The time or conditions that existed before reforms were introduced.","zh":"改革前的时期；改革前的状况。"},"examples":[{"en":"Many older residents still remember the prereform.","zh":"许多老居民仍然记得改革前的那段时期。"},{"en":"Researchers use prereform data to measure how much change occurred.","zh":"研究人员用改革前的数据来衡量变化有多大。"}]}],"synonyms":["pre-reform","before reforms","prior to reform","prechange"],"phonetic":"/ˌpriːˈriːfɔːrm/","extraExplanation":["“prereform”在实际写作中更常见的形式是“pre-reform”（带连字符），尤其在学术或新闻语体里。两者通常意思相同，是否加连字符取决于编辑风格。","这个词经常出现在历史、经济与公共政策语境中，如“pre-reform era/period（改革前时期）”“pre-reform policies（改革前政策）”。在中文语境里也常用于指某国某次重要改革之前的阶段（例如“改革开放前”常可对应为“pre-reform”）。"]}
{"word":"prereformation","summary":{"en":"Prereformation means “before the (Protestant) Reformation,” especially in European religious history.","zh":"prereformation 指“（新教）宗教改革之前的”，多用于欧洲宗教史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Historical) The period or ideas in Western Christianity just before the Protestant Reformation (early 1500s), often referring to late medieval church life and early calls for reform.","zh":"（历史）指西方基督教在宗教改革（16世纪初）之前的时期或思想，常指中世纪晚期的教会生活以及早期改革呼声。"},"examples":[{"en":"Some historians study prereformation movements like the Lollards and the Hussites.","zh":"一些历史学家研究宗教改革前的运动，如罗拉德派和胡斯派。"},{"en":"The novel is set in prereformation Europe, when religious authority shaped daily life.","zh":"这部小说以宗教改革前的欧洲为背景，当时宗教权威深刻影响日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"The time before the Protestant Reformation.","zh":"宗教改革之前的时期。"},"examples":[{"en":"Art from the prereformation is often called late medieval religious art.","zh":"宗教改革前的艺术常被称为中世纪晚期的宗教艺术。"}]}],"synonyms":["pre-Reformation","late medieval (in some contexts)"],"phonetic":"/ˌpriːrɛfəˈmeɪʃən/","extraExplanation":["“prereformation”由前缀 pre-（在……之前）+ Reformation（宗教改革）构成，常见于历史、宗教学和文学研究中。拼写上有时也写作 pre-Reformation（加连字符并大写），表示特指的历史事件。","语境提示：它通常不是指“任何改革之前”，而是特指16世纪欧洲的“新教宗教改革”（与马丁·路德等相关）。与之相关的常见搭配有 prereformation Europe / church / theology / piety（改革前的欧洲/教会/神学/虔敬）。"]}
{"word":"prereformatory","summary":{"en":"Prerefomatory means “before the (Protestant) Reformation,” mainly in historical or religious contexts.","zh":"prereformatory 指“宗教改革（新教改革）之前的”，多用于历史或宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before the Protestant Reformation in 16th‑century Europe (often used about the Church, religion, art, or history).","zh":"（尤指教会、宗教、艺术或历史）发生在16世纪欧洲宗教改革（新教改革）之前的；宗教改革前的。"},"examples":[{"en":"The museum has a collection of prereformatory religious paintings.","zh":"这家博物馆收藏了一批宗教改革前的宗教绘画作品。"},{"en":"Scholars study prereformatory church practices to understand how reform ideas developed.","zh":"学者研究宗教改革前的教会实践，以了解改革思想是如何发展的。"}]}],"synonyms":["pre-Reformation","pre-Reformation-era","medieval (context-dependent)"],"phonetic":"/ˌpriːrɪˈfɔrmətɔri/","extraExplanation":["“prereformatory”较少用于日常英语，更常见于历史、宗教学、艺术史写作中。它通常指16世纪“Protestant Reformation（宗教改革/新教改革）”之前的欧洲，尤其与天主教会相关的制度与文化。","也会看到更常用的近义表达：pre-Reformation（更常见，带连字符）。"]}
{"word":"prerefusal","summary":{"en":"“Prerefusal” means an advance or early refusal made before something is formally requested or considered (rare usage).","zh":"“prerefusal”指在正式提出或审议之前就先行表示拒绝（用法较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early or advance refusal, especially one made before a request, application, or offer is formally presented or fully considered (rare; often written with a hyphen: “pre-refusal”)","zh":"（罕用）预先拒绝；在正式提出请求/申请/报价之前就先行表示拒绝（常写作 pre-refusal）"},"examples":[{"en":"The landlord’s pre-refusal made negotiations impossible from the start.","zh":"房东的预先拒绝让谈判从一开始就无法进行。"},{"en":"We received a pre-refusal response before the committee reviewed the proposal.","zh":"委员会还没审议提案，我们就收到了预先拒绝的回复。"}]}],"synonyms":["preemptive refusal","refusal in advance","early rejection","advance rejection"],"phonetic":"/ˌpriːrɪˈfjuːzəl/","extraExplanation":["“prerefusal”不是常见标准词汇，更常见的表达是 preemptive refusal（先发制人的拒绝）、refusal in advance（提前拒绝）、或 simply “refused before reviewing”（未审先拒）。","写作中若要使用，建议加连字符写作“pre-refusal”，更容易读懂；在正式文件里也可以直接改用更常见的表达，避免读者困惑。"]}
{"word":"prerefuse","summary":{"en":"“Prerefuse” is a rare, nonstandard verb meaning “to refuse beforehand.”","zh":"“prerefuse”是罕见且不太规范的动词，用来表示“提前拒绝”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To refuse or decline something in advance; to reject beforehand.","zh":"（罕见/非标准用法）事先拒绝；提前回绝。"},"examples":[{"en":"I prerefused the invitation because I knew I wouldn’t be in town.","zh":"我提前拒绝了邀请，因为我知道自己不在城里。"},{"en":"She prerefused any extra tasks before the meeting even began.","zh":"会议还没开始，她就先把任何额外任务都拒绝了。"}]}],"synonyms":["refuse in advance","decline ahead of time","turn down beforehand","preemptively decline"],"phonetic":"/ˌpriːrɪˈfjuz/","extraExplanation":["“prerefuse”不是常见标准英语词，日常写作和考试中不推荐使用。更自然的表达通常是：refuse in advance / decline ahead of time / turn down beforehand（提前拒绝）。","需要注意“refuse”本身就有“拒绝”的意思；加上“pre-”只是强调“提前”，但在英语里这种构词不常用，所以会显得别扭或像临时造词。"]}
{"word":"prerefused","summary":{"en":"“Prerefused” (more commonly “pre-refused”) means refused in advance, before something is formally offered or decided.","zh":"“prerefused”（更常见写作“pre-refused”）指“预先被拒绝/预先否决”，即在正式提出或决定前就被拒绝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Refused in advance; decided not to accept or approve something before it is formally offered or requested (uncommon; often written with a hyphen: “pre-refused”).","zh":"预先拒绝的；在正式提出或申请之前就决定不接受/不批准的（不常用，常写作 pre-refused）。"},"examples":[{"en":"The bank said the application looked pre-refused because the income documents were incomplete.","zh":"银行说因为收入文件不完整，这份申请看起来可能会被预先拒绝。"},{"en":"She felt the proposal was pre-refused before she even finished explaining it.","zh":"她觉得自己还没解释完，这个提案就已经被预先否决了。"}]}],"synonyms":["pre-refused","refused in advance","already refused","predetermined to be refused"],"phonetic":"/ˌpriːrɪˈfjuzd/","extraExplanation":["“prerefused”不是常见的标准拼写，更常见的是加连字符的“pre-refused”。在正式写作中也可以改写成更自然的表达：already refused / refused in advance / likely to be refused（尤其在申请、审批、行政语境里）。","前缀“pre-”表示“在……之前”；“refused”是动词refuse的过去分词，用作形容词表示“被拒绝的”。"]}
{"word":"prerefusing","summary":{"en":"“Prerefusing” means refusing something beforehand; it’s informal and uncommon compared with “refuse in advance.”","zh":"“prerefusing”指“预先拒绝”，用法较口语且不常见，更常用“refuse in advance”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"refusing something in advance; deciding to say “no” before an offer, request, or situation fully happens.","zh":"预先拒绝；在事情发生或对方正式提出之前就先说“不”。"},"examples":[{"en":"He’s prerefusing every invitation because he’s overwhelmed.","zh":"他因为压力太大，几乎把所有邀请都预先拒绝了。"},{"en":"Try not to prerefuse—listen to the details first.","zh":"尽量不要先入为主地拒绝，先听听细节。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the act of refusing in advance.","zh":"（较少见）预先拒绝这一行为。"},"examples":[{"en":"Her prerefusing of the proposal surprised the team.","zh":"她对这个提案的预先拒绝让团队很惊讶。"}]}],"synonyms":["refusing beforehand","refusing in advance","preemptively refusing","rejecting in advance"],"phonetic":"/ˌpriːrɪˈfjuzɪŋ/","extraExplanation":["“prerefusing”不是非常常见的标准词形，更常见的表达是：refuse in advance / refuse beforehand，或用形容词 preemptive（先发制人的、预先的）来描述一种“提前拒绝”的态度。","写作中如果要用这种结构，通常会写成带连字符的形式：pre-refusing（表示“预先拒绝”的动作）。在正式文本里建议改用更常见的说法，以免读者觉得生硬或像拼写错误。"]}
{"word":"preregal","summary":{"en":"Preregal means “before a reign” or “before becoming a king/queen,” and it’s a rare, mainly historical adjective.","zh":"preregal 指“统治开始之前/即位之前的”，是较罕用、偏历史语境的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or existing before a person becomes a king/queen or before someone’s reign begins; pre-royal.","zh":"（罕用）在某人成为国王/女王之前的；在某段王朝统治开始之前的；即位前的。"},"examples":[{"en":"The biography focuses on his preregal years as a military officer.","zh":"这本传记重点描写他即位前作为军官的岁月。"},{"en":"In her preregal life, she traveled widely and studied politics.","zh":"她在即位前的生活中广泛旅行并学习政治。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, historical writing) Relating to the period before royal government or monarchy is established in a place.","zh":"（罕用，史学语境）与某地建立君主制或王权统治之前的时期有关的。"},"examples":[{"en":"Archaeologists found artifacts from the preregal period of the city-state.","zh":"考古学家发现了这座城邦王权建立前时期的文物。"}]}],"synonyms":["pre-royal","before the reign","pre-coronation","pre-accession"],"phonetic":"/ˌpriˈriɡəl/","extraExplanation":["这个词很少见，多见于历史写作或传记体语境。构词上是 pre-（在……之前）+ regal（王室的、君王的）。日常英语更常用的表达有 before his reign（在他统治之前）、before she became queen（在她成为女王之前）、pre-royal（较少但更直观）。"]}
{"word":"preregister","summary":{"en":"“Preregister” means to sign up or register in advance.","zh":"“preregister”指在规定时间或活动开始前提前注册／预登记。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to register or sign up in advance (before an event, deadline, or official opening).","zh":"（在活动、截止日期或正式开放前）提前注册／预先登记。"},"examples":[{"en":"Please preregister online to save time on the day of the conference.","zh":"请提前在网上注册，以节省会议当天的时间。"},{"en":"Students must preregister for classes before the semester begins.","zh":"学生必须在学期开始前提前选课登记。"}]},{"partOfSpeech":"vt.","definition":{"en":"to record someone or something in advance in an official list or system.","zh":"将某人或某事物预先录入官方名单或系统中。"},"examples":[{"en":"The clinic can preregister patients to speed up check-in.","zh":"诊所可以预先登记病人，以加快报到流程。"},{"en":"We preregistered our new devices with the network administrator.","zh":"我们把新设备提前在网络管理员那里登记入网。"}]}],"synonyms":["pre-register","sign up in advance","register ahead of time","enroll in advance"],"phonetic":"/ˌpriːˈrɛdʒɪstɚ/","extraExplanation":["“preregister”由前缀“pre-”（在……之前）+“register”（登记）组成，常见于会议、课程、疫苗接种、软件/设备开通等场景。","写法上也常见“pre-register”（加连字符）；不同机构偏好不同，但含义相同。","相关常见搭配：preregister for a course/event（为课程/活动提前注册）、preregistration required（需要提前注册）、preregistration form（预登记表）。"]}
{"word":"preregistered","summary":{"en":"“Preregistered” means already registered in advance; it can also be the past form of “preregister.”","zh":"“preregistered”表示“已预先注册的”，也可作动词“preregister”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"registered in advance (before an event, deadline, or official opening).","zh":"预先注册的（在活动、截止日期或正式开始前完成注册）。"},"examples":[{"en":"Only preregistered attendees can enter the workshop room.","zh":"只有预先注册的参加者才能进入工作坊教室。"},{"en":"Please arrive early if you preregistered online.","zh":"如果你已在网上预先注册，请提前到达。"}]},{"partOfSpeech":"v.","definition":{"en":"to register in advance.","zh":"预先注册；提前登记。"},"examples":[{"en":"You can preregister for classes starting next month.","zh":"你可以为下个月开始的课程预先注册。"},{"en":"Everyone must preregister before picking up a badge.","zh":"每个人都必须先预先注册才能领取胸牌。"}]}],"synonyms":["pre-registered","registered in advance","advanced registration (phrase)"],"phonetic":"/ˌpriːˈrɛdʒɪstɚd/","extraExplanation":["常见写法还有 pre-registered（加连字符），在正式公告或表格中更常见；日常邮件里 preregistered 也很常用。","preregister 通常用于会议、课程、选举投票登记、疫苗接种预约等情境，强调“提前完成手续/锁定名额”。","注意拼写：preregister（动词）→ preregistered（过去式/过去分词）；preregistration（名词：预先注册）。"]}
{"word":"preregistering","summary":{"en":"“Preregistering” means signing up in advance before the official deadline or main registration.","zh":"“preregistering”指在正式截止日期或主要报名开始前提前注册/登记。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to register in advance; to sign up before an official deadline or before the main registration opens","zh":"预先登记；提前注册（在截止日期前或正式报名开始前先报名）"},"examples":[{"en":"You can save money by preregistering online before Friday.","zh":"你可以在周五之前在网上提前注册来省钱。"},{"en":"Students are preregistering for next semester’s classes this week.","zh":"学生们这周在为下学期的课程提前选课/注册。"}]}],"synonyms":["pre-registering","signing up in advance","registering ahead of time","enrolling early"],"phonetic":"/ˌpriːˈrɛdʒɪstərɪŋ/","extraExplanation":["“preregister” = prefix “pre-”（在……之前） + “register”（登记/注册）。常见于活动、课程、会议、软件服务等语境。","在美式英语里也常写作“pre-register”。作名词时常见“preregistration”（提前注册）。"]}
{"word":"preregisters","summary":{"en":"“Preregisters” means “registers in advance.”","zh":"“preregisters”意思是“提前登记/预先注册”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to register in advance, especially before an event, class, or deadline.","zh":"（第三人称单数）提前登记/预先注册，尤指在活动、课程或截止日期之前。"},"examples":[{"en":"She preregisters online so she can skip the long line on the day of the event.","zh":"她在网上提前注册，这样活动当天就能避开长队。"},{"en":"The system preregisters new employees for basic safety training.","zh":"系统会为新员工预先登记基础安全培训。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to sign up in advance (without mentioning what you register for).","zh":"（较不常见）提前报名/预先登记（不特别说明报名对象）。"},"examples":[{"en":"If he preregisters, he’ll receive a confirmation email right away.","zh":"如果他提前报名，就会立刻收到确认邮件。"}]}],"synonyms":["register in advance","sign up early","pre-enroll"],"phonetic":"/ˌpriːˈrɛdʒɪstərz/","extraExplanation":["“preregister”常用于学校选课、会议/比赛报名、疫苗或体检预约等场景，含义是“在正式开始或截止前先把信息填好/锁定名额”。","拼写上常见两种形式：preregister（美式常见）与 pre-register（更强调前缀）。"]}
{"word":"preregistration","summary":{"en":"Preregistration means registering ahead of time, usually before an event or deadline.","zh":"preregistration 指在活动或截止日期之前进行的提前注册/预先登记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of registering in advance (before an event, class, service, or official deadline)","zh":"预先登记；提前注册（在活动、课程、服务或截止日期之前）"},"examples":[{"en":"Preregistration is required for the workshop because space is limited.","zh":"由于名额有限，这个工作坊需要提前注册。"},{"en":"You can complete preregistration online and pick up your badge at the door.","zh":"你可以在网上完成预先登记，然后在入口处领取胸牌。"}]},{"partOfSpeech":"n.","definition":{"en":"a system or period in which people sign up early, often to help organizers plan","zh":"预报名流程/阶段（通常用于方便主办方统计与安排）"},"examples":[{"en":"The preregistration period ends on Friday at 5 p.m.","zh":"预报名阶段将于周五下午5点结束。"},{"en":"We opened preregistration to estimate how many meals to prepare.","zh":"我们开启预报名是为了估算需要准备多少份餐食。"}]}],"synonyms":["advance registration","pre-registration","early registration"],"phonetic":"/ˌpriːˌrɛdʒəˈstreɪʃən/","extraExplanation":["这个词常见于校园、会议、培训、医疗（如门诊就诊信息预填）等场景。含义通常比 sign up 更正式，强调“在正式办理前先把信息填好/锁定名额”。","词形结构：pre-（“在……之前”）+ registration（“登记/注册”）。写法上也常见作 pre-registration（加连字符）。","相关常用表达：preregister (v.) 提前注册；preregistered (adj.) 已提前注册的；early-bird registration 早鸟优惠报名（强调优惠而非仅提前）。"]}
{"word":"preregistrations","summary":{"en":"Preregistrations are advance sign-ups completed before an event or official start date.","zh":"preregistrations 指在活动或正式开始日期之前完成的预先报名/登记（或预登记人数/记录）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of registering in advance (before an event, class, service, or official date), or the records/people who have done so","zh":"预先登记；预注册（在活动、课程、服务或正式日期之前完成登记的行为，或指已预登记的记录/人数）"},"examples":[{"en":"We received 300 preregistrations for the conference before the early-bird deadline.","zh":"早鸟截止日期前，我们收到了这场会议的300份预先登记。"},{"en":"Preregistrations help the organizers plan seating and materials.","zh":"预先登记能帮助主办方规划座位和物料。"},{"en":"Online preregistrations close at midnight on Friday.","zh":"线上预注册将于周五午夜截止。"}]}],"synonyms":["advance registrations","early registrations","pre-registrations","sign-ups (in advance)"],"phonetic":"/ˌpriˌrɛdʒəˈstreɪʃənz/","extraExplanation":["“preregistration”也常写作“pre-registration”（带连字符），两者意思相同；在正式写作中通常保持一种拼写方式前后一致。","在通知或公告里，“preregistrations”有时指“预登记人数/预报名量”（count），比如“Preregistrations are up 20% this year.”"]}
{"word":"preregnant","summary":{"en":"Pregnant means expecting a baby; it can also mean “full of meaning or possibility,” often in the phrase “pregnant with.”","zh":"pregnant 指“怀孕的”；也可指“充满（意义/可能性）的”，常见搭配为“pregnant with…”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a baby developing inside the body; expecting a child.","zh":"怀孕的；有孕的；正在期待宝宝出生的。"},"examples":[{"en":"She is three months pregnant.","zh":"她怀孕三个月了。"},{"en":"Many pregnant people avoid alcohol to protect the baby.","zh":"许多孕期的人会避免饮酒来保护宝宝。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal/literary) Full of something, especially meaning, emotion, or possibility; often used as “pregnant with.”","zh":"（正式/文学用法）充满（意义、情感或可能性）的；常用作“pregnant with…”。"},"examples":[{"en":"The silence was pregnant with tension.","zh":"沉默中充满了紧张气氛。"},{"en":"His words were pregnant with meaning.","zh":"他的话意味深长。"}]}],"synonyms":["expecting","with child","in the family way (old-fashioned)","full of","laden with (formal)"],"phonetic":"/ˈprɛɡnənt/","extraExplanation":["你输入的“preregnant”常见拼写错误，正确拼写是 **pregnant**（中间没有第二个 r，也没有“pre-”前缀）。","谈到怀孕时，英语里也常用更委婉或更中性的说法：**expecting (a baby)**（在等宝宝/怀孕中）、**pregnant person**（更包容的表达，适用于不使用“woman”身份的人）。","文学/修辞用法“pregnant with…”强调“像怀孕一样‘装满’某种东西”，所以多用于气氛、沉默、时刻、话语等抽象名词。"]}
{"word":"preregulate","summary":{"en":"Preregulate means to control or regulate something ahead of time.","zh":"preregulate 指在主要过程之前先进行调节或控制。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to regulate or control something in advance, before the main process happens","zh":"预先调节；预先控制（在主要过程开始之前先进行调控）"},"examples":[{"en":"The system preregulates the voltage to protect sensitive components.","zh":"该系统会预先调节电压，以保护敏感元件。"},{"en":"Some devices preregulate the fuel flow before ignition.","zh":"有些设备会在点火前预先控制燃料流量。"}]}],"synonyms":["precontrol","pre-adjust","regulate in advance","precondition"],"phonetic":"/ˌpriːˈrɛɡjəˌleɪt/","extraExplanation":["“preregulate”由前缀 pre-（预先）+ regulate（调节、监管）组成，多见于工程、电子、电源设计等技术语境（如“preregulator 预稳压器/前级稳压器”）。在日常英语里不算常用，很多情况下也可以用更自然的说法，如 “regulate in advance / pre-adjust / pre-control”。"]}
{"word":"preregulated","summary":{"en":"Preregulated means something is regulated ahead of time, before it is used or sold.","zh":"preregulated 指某事物在使用或销售之前就已经被提前监管/按规定处理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"regulated in advance; controlled by rules or standards before something begins or is offered to the public","zh":"预先监管的；事先按规则/标准加以管制的"},"examples":[{"en":"In a preregulated market, companies must meet safety standards before selling a product.","zh":"在预先监管的市场中，公司必须在销售产品前满足安全标准。"},{"en":"The new medicine went through preregulated testing procedures.","zh":"这种新药经历了预先规定的测试流程。"}]}],"synonyms":["pre-regulated","regulated in advance","precontrolled"],"phonetic":"/ˌpriːˈrɛɡjəˌleɪtɪd/","extraExplanation":["“preregulated”常见于较正式的写作（法律、金融、医疗、工程等），意思是“在进入市场/投入使用前就已被监管或按规定处理”。","拼写上也常见作“pre-regulated”（加连字符更清晰），两者含义相同。"]}
{"word":"preregulating","summary":{"en":"Preregulating means controlling or adjusting something ahead of time, often in technical systems.","zh":"Preregulating 指“提前进行控制或调节”，多用于技术系统语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"regulating or controlling something in advance (before a later process or main control system).","zh":"预先调节；提前控制（在后续流程或主要控制系统之前先进行控制）。"},"examples":[{"en":"The device uses a preregulating valve to keep the pressure stable before it reaches the main regulator.","zh":"该设备使用预调阀，在压力进入主调节器之前先保持稳定。"},{"en":"Preregulating the temperature reduces sudden changes during production.","zh":"预先调节温度可以减少生产过程中的突然波动。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of regulating something in advance; present participle of “preregulate.”","zh":"预先调节的动作；“preregulate”的现在分词形式。"},"examples":[{"en":"Engineers are preregulating the flow rate to protect the sensors.","zh":"工程师正在预先调节流量以保护传感器。"},{"en":"Preregulating helps the system start up smoothly.","zh":"预先调节有助于系统平稳启动。"}]}],"synonyms":["pre-adjusting","preconditioning","pre-controlling","regulating in advance"],"phonetic":"/ˌpriːˈrɛɡjəˌleɪtɪŋ/","extraExplanation":["这个词更常见于工程、控制系统、气体/液体管路等技术语境。日常英语里更常用的表达是 “regulating in advance / pre-adjusting / pre-conditioning”。","构词上是前缀 pre-（“在……之前”）+ regulate（“调节、管理”）。因此 preregulating 强调“先把参数调到合适范围”，再交给后面的主控制器去精细调节。"]}
{"word":"preregulation","summary":{"en":"“Preregulation” means the time or conditions before formal rules or government regulation were introduced.","zh":"“preregulation”指某项活动或行业在正式规则/政府监管出台之前的时期或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period, situation, or conditions before a government or authority introduces rules (regulation) for an activity or industry","zh":"（某项活动或行业）实施监管之前的时期、状态或环境"},"examples":[{"en":"In the preregulation era, safety standards varied widely from company to company.","zh":"在监管实施之前的时期，各公司的安全标准差异很大。"},{"en":"Researchers compared pollution levels in preregulation years with those after new laws took effect.","zh":"研究人员比较了监管前几年与新法规生效后的污染水平。"}]},{"partOfSpeech":"n.","definition":{"en":"the idea or concept of being ‘before regulation’ (often used in academic or policy writing)","zh":"“处于监管之前”的概念或视角（常见于学术或政策写作）"},"examples":[{"en":"The paper discusses preregulation market behavior and why voluntary guidelines failed.","zh":"这篇论文讨论了监管前的市场行为，以及为何自愿性指南会失败。"}]}],"synonyms":["pre-regulation period","before regulation","unregulated era","pre-oversight"],"phonetic":"/ˌpriˌrɛɡjəˈleɪʃən/","extraExplanation":["“preregulation”不是非常常见的日常用词，更常见的写法是带连字符的 **pre-regulation**，尤其在正式写作中更清晰。","它多出现在公共政策、经济学、环境研究、金融监管等语境，用来对比“监管前/监管后”的变化。"]}
{"word":"prerehearsal","summary":{"en":"A preparatory rehearsal held before the main rehearsals.","zh":"正式排练前进行的准备性排练。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rehearsal that happens before the main rehearsal period, often used to prepare basics (like lines, music, blocking, or logistics).","zh":"正式排练期开始前的预排练／预演练，常用于先打基础（如台词、音乐、走位或流程安排）。"},"examples":[{"en":"The cast did a prerehearsal to read through the script and discuss characters.","zh":"演员们在预排练中通读了剧本并讨论了角色。"},{"en":"We scheduled a prerehearsal to check the microphones and stage layout.","zh":"我们安排了预排练来检查麦克风和舞台布置。"}]}],"synonyms":["pre-rehearsal","preliminary rehearsal","run-through (context-dependent)"],"phonetic":"/ˌpriːrɪˈhɝːsəl/","extraExplanation":["“prerehearsal”由前缀 pre-（在……之前）+ rehearsal（排练）构成，常见于戏剧、舞蹈、音乐会、学校演出等场景。更自然、更常见的写法通常是分开的：pre-rehearsal（带连字符）或 pre rehearsal（少见）。","在专业演出语境里，prerehearsal 往往偏“准备性排练”，可能不做完整连贯演出，而是解决基础问题；与 dress rehearsal（彩排，通常接近正式演出状态）不同。"]}
{"word":"prereject","summary":{"en":"“Prereject” means to reject something ahead of the full review or decision process.","zh":"“prereject”指在完整审查或决策流程开始前就把某事先行拒绝/筛掉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to reject something in advance, often before it is formally reviewed or fully considered","zh":"预先拒绝；在正式审查或充分考虑之前先行否决"},"examples":[{"en":"Some journals prereject most submissions that don’t match their scope.","zh":"一些期刊会对不符合收稿范围的稿件进行预先拒绝。"},{"en":"The system may prereject applications that are missing required documents.","zh":"系统可能会预先拒绝缺少必要材料的申请。"},{"en":"Try not to prereject your own idea before you test it.","zh":"在验证之前，尽量不要先否定自己的想法。"}]}],"synonyms":["reject upfront","screen out","pre-screen out","dismiss early"],"phonetic":"/ˌpriːrɪˈdʒɛkt/","extraExplanation":["“prereject”常见于学术期刊投稿、招聘筛选或自动化审核场景，表示在进入完整评审/面试/人工审核前就被筛掉。语气通常比“reject”更强调“时间上更早、流程上更前置”。","拼写上也可见作“pre-reject”。在较正式写作中，有时会用更常见的表达替代，如“reject upfront / reject at the initial screening stage”。"]}
{"word":"prerejection","summary":{"en":"Prerejection means an early rejection made before a full review or formal decision process.","zh":"Prerejection 指在正式审查或完整决策流程之前发生的提前拒绝/预先驳回。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early refusal or rejection made before a full review, interview, or formal decision process","zh":"（在正式审查、面试或完整决策流程之前作出的）提前拒绝／预先驳回"},"examples":[{"en":"The journal gave the paper a prerejection because it didn’t fit the scope.","zh":"这家期刊对论文做了预先驳回，因为主题不符合期刊范围。"},{"en":"Many candidates receive a prerejection after the initial screening call.","zh":"很多候选人在初步筛选电话后就会收到提前拒绝。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reject something early, before completing the usual evaluation or selection steps","zh":"在完成常规评估或筛选步骤之前就提前拒绝（某事/某人）"},"examples":[{"en":"Some editors prereject submissions that clearly ignore the guidelines.","zh":"一些编辑会对明显不按投稿指南来的稿件直接提前拒绝。"}]}],"synonyms":["early rejection","desk rejection","rejection without review","preliminary rejection"],"phonetic":"/ˌpriːrɪˈdʒekʃən/","extraExplanation":["“prerejection”多见于学术出版与招聘语境，尤其是期刊投稿中的 desk rejection（编辑部直接拒稿）。有时作者会用“prerejection”强调：拒绝发生在外审（peer review）之前。","该词在日常口语中不算常见，更常见的表达是 “early rejection / desk rejection / rejected without review”。"]}
{"word":"prerejoice","summary":{"en":"“Prerejoice” means to feel joy in advance, before something happens.","zh":"“prerejoice”指在事情发生前就预先感到喜悦、提前欢庆。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rejoice in advance; to feel happy about something before it happens (often because you expect a good outcome).","zh":"预先欢喜；在事情发生前就因期待好结果而感到高兴（较少见用法）。"},"examples":[{"en":"She began to prerejoice at the thought of seeing her family again.","zh":"一想到很快就能再见到家人，她就开始预先欢喜。"},{"en":"Don’t prerejoice too early—wait until the results are official.","zh":"别高兴得太早——等结果正式公布再说。"}]}],"synonyms":["rejoice in advance","celebrate early","anticipate with joy","look forward to"],"phonetic":"/ˌpriːrɪˈdʒɔɪs/","extraExplanation":["“prerejoice”非常少见，属于偏文学/古风的用词：前缀“pre-”（在……之前）+ “rejoice”（欢喜）。日常英语里更常说“rejoice in advance / be happy ahead of time / celebrate early”。","在宗教或诗歌语境中，它有时带一点“以信心提前欢庆”的意味，但在现代口语里可能显得生僻或夸张。"]}
{"word":"prerejoiced","summary":{"en":"“Prerejoiced” means “rejoiced in advance,” but it’s very rare in modern English.","zh":"“Prerejoiced”意为“提前欢喜/预先庆祝”，但在现代英语中非常罕见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Rejoiced in advance; felt happiness or celebration before something happened.","zh":"（罕见）提前欢喜；在某事发生之前就感到高兴或庆祝。"},"examples":[{"en":"She prerejoiced at the thought of seeing her family again.","zh":"一想到又能见到家人，她就提前欢喜起来。"},{"en":"The fans prerejoiced, convinced their team would win the final.","zh":"球迷们提前欢呼庆祝，深信他们的球队会赢得决赛。"},{"en":"He prerejoiced over the good news he expected to hear.","zh":"他为自己以为将会听到的好消息而提前高兴。"}]}],"synonyms":["rejoiced beforehand","rejoiced in advance","celebrated early","pre-celebrated"],"phonetic":"/ˌpriːrɪˈdʒɔɪst/","extraExplanation":["“prerejoiced”是动词“prerejoice”的过去式/过去分词，但在现代英语里非常少见，读者更常见到的表达是“rejoiced beforehand / rejoiced in advance / was already celebrating”。","它常见于较有文学色彩或宗教语境的写法，用来强调“尚未发生就先欢喜（有时也暗示过早庆祝）”。"]}
{"word":"prerejoicing","summary":{"en":"Prerejoicing means rejoicing or celebrating in advance.","zh":"prerejoicing 指“预先欢喜/提前庆祝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of rejoicing in advance; feeling happy ahead of time about something expected to happen","zh":"预先欢喜；在事情发生前就先感到高兴、庆祝"},"examples":[{"en":"Her prerejoicing was obvious—she smiled all week before the results came out.","zh":"她的预先欢喜很明显——成绩还没出来，她就整整一周都在笑。"},{"en":"Try not to let prerejoicing turn into disappointment if plans change.","zh":"尽量别让预先欢喜在计划改变时变成失落。"}]},{"partOfSpeech":"adj.","definition":{"en":"rejoicing in advance; celebrating before something happens","zh":"提前庆祝（的）；在事情发生前就先欢庆（的）"},"examples":[{"en":"His prerejoicing tone made it seem like the deal was already done.","zh":"他那种提前庆祝的语气，让人觉得交易已经谈成了。"}]}],"synonyms":["celebrating too soon","rejoicing in advance","premature celebration","counting your chickens"],"phonetic":"/ˌpriːrɪˈdʒɔɪsɪŋ/","extraExplanation":["“prerejoicing”由前缀 pre-（“在……之前”）+ rejoicing（“欢喜/庆祝”）构成，属于比较少见的用法，更多时候人们会说“rejoicing in advance”或“celebrating too soon”。","在写作里它常带一点提醒意味：提前高兴可能会“乐极生悲”，接近中文的“别高兴太早”。"]}
{"word":"prerelate","summary":{"en":"A “prelate” is a high-ranking church leader, such as a bishop or archbishop.","zh":"“prelate”指（基督教）高级神职人员，如主教或大主教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-ranking member of the Christian clergy (especially a bishop or archbishop).","zh":"（尤指基督教的）高级神职人员；（尤指）主教、大主教等。"},"examples":[{"en":"The prelate addressed the crowd from the cathedral steps.","zh":"这位高级神职人员在大教堂台阶上向人群致辞。"},{"en":"In medieval Europe, some prelates also held political power.","zh":"在中世纪欧洲，一些高级神职人员也拥有政治权力。"}]}],"synonyms":["bishop","archbishop","church leader","clergyman"],"phonetic":"/ˈprɛlət/","extraExplanation":["你输入的“prerelate”在英语里不常见，最可能是拼写想写 **prelate**。","**prelate** 多用于较正式或历史/宗教语境，日常口语里更常说 **bishop（主教）**、**archbishop（大主教）**。","词源来自拉丁语 *praelatus*，有“被提升的人、被任命在前的人”的意思。文学或历史写作中常用来营造宗教或中世纪氛围。"]}
{"word":"prerelated","summary":{"en":"“Prerelated” means already related or connected in advance (uncommon; often written “pre-related”).","zh":"“prerelated”表示“预先相关/事先已有关联的”（不常见，常写作“pre-related”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) related in advance; already connected to something before a particular time or event.","zh":"（不常见）预先相关的；在某个时间或事件之前就已有关联的。"},"examples":[{"en":"Please remove any prerelated accounts before creating a new user profile.","zh":"在创建新用户资料前，请移除任何预先关联的账户。"},{"en":"The survey avoids questions that are prerelated to the training materials.","zh":"这份调查避免使用与培训材料预先关联的问题。"}]}],"synonyms":["pre-related","previously related","already linked","already associated","pre-existing"],"phonetic":"/ˌpriːrɪˈleɪtɪd/","extraExplanation":["“prerelated”在英文里不算常见写法，更常见的是加连字符写成“pre-related”，或直接用更自然的表达：\n- previously related（先前有关联的）\n- pre-existing relationship（既有关系）\n- already linked/associated（已经关联/关联了）\n在正式写作中，通常建议用更常见的表达，读者更容易理解。"]}
{"word":"prerelating","summary":{"en":"“Prerelating” is a rare form meaning “related to something earlier / previously connected.”","zh":"“prerelating”很少见，通常表示“与先前的事物有关/之前就相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to something earlier; connected to what happened before (rare, usually written as “pre‑relating” or replaced by “previously related / prior to / relating to”).","zh":"与更早的事物有关；与之前发生的情况相关（很少见，常写作“pre‑relating”，也常用“previously related / prior to / relating to”来替代）。"},"examples":[{"en":"The report focuses on prerelating factors such as childhood stress.","zh":"这份报告关注与先前相关的因素，例如童年压力。"},{"en":"Please attach any prerelating documents from the earlier case.","zh":"请附上此前案件中相关的文件。"}]},{"partOfSpeech":"v.","definition":{"en":"(as a present participle) relating something in advance or linking it to earlier information (very rare).","zh":"（作现在分词）提前叙述/联系；把某事与先前信息联系起来（非常少见）。"},"examples":[{"en":"He kept prerelating the new rule to last year’s policy changes.","zh":"他不断把新规定与去年的政策变化联系起来。"}]}],"synonyms":["related to","previously related","earlier-related","prior to","preexisting (context-dependent)"],"phonetic":"/ˌpriːrɪˈleɪtɪŋ/","extraExplanation":["“prerelating”不是常用标准词，很多情况下更自然的表达是：relating to (…)/ related to (…)/ prior to (…)/ previously mentioned/ earlier-related。写作（尤其是正式写作）中建议改用这些更常见的搭配，以避免读者困惑。","如果你本意是“pre‑existing / pre‑related / previously related（先前就存在/先前已经相关）”，可以告诉我句子，我帮你选最地道的词。"]}
{"word":"prerelation","summary":{"en":"“Prerelation” is a rare, nonstandard noun meaning a preexisting relationship or prior connection.","zh":"“prerelation”是很少见、非标准的名词，大致表示“既有关系/之前的联系”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) A relationship or connection that existed before a particular event, time, or new relationship.","zh":"（罕见/非标准用法）指在某个事件、时间点或新关系发生之前就已经存在的关系或联系。"},"examples":[{"en":"Because of their prerelation, they already trusted each other when the project began.","zh":"因为他们之前就有关系/联系，所以项目一开始彼此就有信任。"},{"en":"The report mentions a prerelation between the two organizations from earlier partnerships.","zh":"报告提到这两个组织因早期合作而存在的既有联系。"}]}],"synonyms":["prior relationship","preexisting relationship","previous connection","prior connection"],"phonetic":"/ˌpriːrɪˈleɪʃən/","extraExplanation":["“prerelation”在现代英语里非常不常见，很多情况下会被视为生造词或拼写不自然。正式写作里更常用：prior relationship / preexisting relationship / previous connection。","如果你的意思是“前提条件/先决条件”，更常用 prerequisite（先决条件）。如果你的意思是“时间顺序上的先后关系”，要看语境，可能会用 precedence (relation) 或 temporal relationship。"]}
{"word":"prerelationship","summary":{"en":"“Prerelationship” (more commonly “pre-relationship”) means the stage before a romantic relationship becomes official.","zh":"“prerelationship”（更常写作“pre-relationship”）指正式确定恋爱关系之前的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) The time or stage before two people officially start a romantic relationship; the “talking/dating but not committed yet” period.","zh":"（非正式）两个人正式确定恋爱关系之前的阶段；“暧昧/接触中但还没确定关系”的时期。"},"examples":[{"en":"In the pre-relationship stage, they texted every day but didn’t call it dating.","zh":"在确定关系之前的阶段，他们每天都发消息，但还不称之为在交往。"},{"en":"She wanted clarity before leaving the pre-relationship limbo.","zh":"她想要一个明确说法，别再卡在“确定关系前的暧昧期”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the period before a relationship is established.","zh":"与“关系建立之前的时期”有关的。"},"examples":[{"en":"They set some pre-relationship boundaries about communication and expectations.","zh":"他们在确定关系之前就沟通并设定了一些界限，比如联系频率和期待。"}]}],"synonyms":["pre-relationship stage","talking stage","early dating stage","before the relationship"],"phonetic":"/ˌpriːrɪˈleɪʃənˌʃɪp/","extraExplanation":["“prerelationship”不是很标准的词，更常见的写法是带连字符的 **pre-relationship**，或者用更自然的表达：**before the relationship**, **early dating stage**, **talking stage**（口语：暧昧期/聊天期）。","前缀 **pre-** 表示“在……之前”。在写作中，遇到自造复合词时用连字符（pre-relationship）通常更清晰。"]}
{"word":"prerelease","summary":{"en":"A prerelease is something (often a test version or event) that comes before the official release.","zh":"prerelease 指正式发布之前的事物，常见为预发布版本或预发布活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Software, games, books, etc.) a version made available before the official release, often for testing, previews, or early access.","zh":"（软件、游戏、书籍等）正式发布前提供的版本，常用于测试、预览或抢先体验。"},"examples":[{"en":"The studio sent reviewers a prerelease build of the game.","zh":"工作室给评测者发送了游戏的预发布版本。"},{"en":"Some bugs were found during prerelease testing.","zh":"在预发布测试期间发现了一些漏洞。"},{"en":"Users can sign up for the prerelease to try new features early.","zh":"用户可以报名参加预发布版本，提前体验新功能。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening or done before an official release date.","zh":"发生在正式发布日之前的；在发布前进行的。"},"examples":[{"en":"They held a prerelease event for the new album.","zh":"他们为新专辑举办了一场预发布活动。"},{"en":"The prerelease announcement revealed the main features.","zh":"预发布公告披露了主要功能。"}]}],"synonyms":["preview","beta (version)","early access","pre-release","advance release"],"phonetic":"/ˌpriːrɪˈliːs/","extraExplanation":["“prerelease”通常写作一个词（prerelease），也常见写法有“pre-release”“pre release”。在科技与游戏圈里最常指“预发布版本/测试版”（build/beta/preview）。在出版与音乐领域，也可指“预发行宣传/活动”。"]}
{"word":"prereligious","summary":{"en":"Prereligious means “before organized religion or established religious belief.”","zh":"prereligious 意为“在有组织的宗教或宗教信仰确立之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing, happening, or relating to a time before organized religion or religious belief became established (often used in academic or historical writing).","zh":"（多用于学术/历史语境）指在有组织的宗教或宗教信仰形成、确立之前的；前宗教的。"},"examples":[{"en":"Some scholars describe certain burial practices as prereligious rituals rather than formal worship.","zh":"一些学者将某些葬礼做法描述为“前宗教”的仪式，而不是正式的崇拜活动。"},{"en":"The article compares prereligious myth-making with later religious traditions.","zh":"这篇文章比较了前宗教的神话建构与后来的宗教传统。"}]}],"synonyms":["pre-religious","proto-religious","pre-Christian (context-specific)","pre-Islamic (context-specific)"],"phonetic":"/ˌpriːrɪˈlɪdʒəs/","extraExplanation":["“prereligious”由前缀 pre-（“在……之前”）+ religious（“宗教的”）构成，属于较少见、偏学术的词。写作中常用来指史前社会或早期文化中的信仰、仪式、神话等现象，强调它们尚未发展为制度化的宗教体系。","注意区分：pre-religious/prereligious 强调“宗教之前”；而 nonreligious 则是“非宗教的/与宗教无关的”。"]}
{"word":"prereluctance","summary":{"en":"A rare, nonstandard noun meaning “reluctance in advance; initial unwillingness before something happens.”","zh":"一个罕见、非标准名词，表示“事前的犹豫/预先的不情愿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) Reluctance that exists before something happens; an initial unwillingness in advance.","zh":"（罕见/非标准用法）在某事发生之前就存在的犹豫或不情愿；预先的抗拒。"},"examples":[{"en":"She had a prereluctance to speak in public, even before the first rehearsal.","zh":"她在第一次彩排之前就对公开发言有一种预先的抗拒。"},{"en":"Any prereluctance from the team disappeared after they saw the results.","zh":"团队最初的预先顾虑在看到成果后就消失了。"}]}],"synonyms":["initial reluctance","prior reluctance","preexisting reluctance","reluctance beforehand","hesitation"],"phonetic":"/ˌpriːrɪˈlʌktəns/","extraExplanation":["“prereluctance”不是常见的标准英语词，许多词典里找不到。写作中更自然的表达通常是：initial reluctance（最初的不情愿）、prior reluctance（事先的犹豫）、preexisting reluctance（原本就存在的抗拒）、reluctance beforehand（事前的犹豫）。","如果你是在学术/技术文本里看到它，它可能是作者临时造词（nonce word），用“pre- + reluctance”来强调“在事件发生之前就已存在的犹豫”。正式写作建议改用更常见的搭配，以免读者困惑。"]}
{"word":"prereluctation","summary":{"en":"Prereluctation is a very rare noun meaning an initial hesitation or resistance before acting.","zh":"Prereluctation 是一个非常罕见的名词，指行动前的最初犹豫或抗拒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preliminary struggle, hesitation, or resistance before doing something (very rare and not standard in modern English).","zh":"（非常罕见、现代英语中不常用）指在做某事之前的预先挣扎、犹豫或抗拒。"},"examples":[{"en":"After a moment of prereluctation, she agreed to speak in the meeting.","zh":"短暂犹豫之后，她同意在会上发言。"},{"en":"His prereluctation showed that the decision didn’t sit well with him.","zh":"他的那种预先抗拒表明他并不认同这个决定。"}]}],"synonyms":["hesitation","reluctance","resistance","misgiving","wavering"],"phonetic":"/ˌpriːrɪlʌkˈteɪʃən/","extraExplanation":["这个词在主流词典中通常查不到，属于极罕见/可能为临时造词（nonce word）。更常见、自然的表达是 hesitation（犹豫）、reluctance（不情愿）、resistance（抵触）。","构词上可理解为 pre-（在……之前）+ reluctation（抗拒、挣扎；本身也偏罕见，源自拉丁语 reluctari “反抗/不愿”）。因此 prereluctation 可以被理解为“行动前的抗拒/挣扎”。","如果你是在某篇文章里看到它，作者很可能想强调：真正的拒绝或对抗发生之前，先出现了一段内心的‘卡住/抗拒’。写作中建议用更常用词以免读者不理解。"]}
{"word":"preremit","summary":{"en":"“Preremit” (usually “pre-remit”) means to send payment in advance.","zh":"“preremit”（常写作“pre-remit”）指提前汇款或预先付款。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, usually written “pre-remit”) to send money or payment in advance; to remit beforehand.","zh":"（罕见，通常写作 pre-remit）预先汇款；提前付款。"},"examples":[{"en":"Please pre-remit the invoice amount before we ship the order.","zh":"请在我们发货前预先支付发票金额。"},{"en":"Some suppliers ask customers to pre-remit for large custom orders.","zh":"有些供应商会要求客户对大型定制订单提前付款。"}]}],"synonyms":["prepay","pay in advance","remit in advance","pay upfront"],"phonetic":"ˌpriːrɪˈmɪt","extraExplanation":["“preremit”在现代英语中非常少见，更常见、也更自然的写法是“pre-remit”（带连字符），或直接用更常用的表达：“pay in advance / prepay / remit in advance”。","“remit”本身在商务英语里常指“汇款、缴款”；加上“pre-”表示“提前”。如果你是在合同、发票或付款条款里看到它，多半就是“先付款/先汇款”的意思。"]}
{"word":"preremittance","summary":{"en":"Preremittance means an advance remittance: money paid or transferred before something is delivered or due.","zh":"Preremittance 指“预先汇款/预付款”：在交付或到期之前先支付或汇出款项。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a payment (money transfer) made in advance, before goods are shipped, services are provided, or an obligation is due","zh":"预先汇款；在发货、提供服务或到期付款之前先行支付/汇出的一笔款项"},"examples":[{"en":"The supplier requires preremittance before they begin production.","zh":"供应商要求先预汇款，然后才开始生产。"},{"en":"Preremittance reduces the seller’s risk but increases the buyer’s risk.","zh":"预先汇款能降低卖方风险，但会增加买方风险。"},{"en":"We arranged preremittance by bank transfer to secure the order.","zh":"我们通过银行转账办理预先汇款，以确认订单。"}]}],"synonyms":["advance remittance","prepayment","payment in advance","upfront payment"],"phonetic":"/ˌpriːrɪˈmɪtəns/","extraExplanation":["这个词在日常英语里很少见，更常用的说法是 prepayment（预付款）或 payment in advance（提前付款）。在国际贸易/外贸合同中，preremittance 通常指“先款后货”的付款方式，常见于信用较弱、金额较小，或卖方议价能力更强的交易。"]}
{"word":"preremitted","summary":{"en":"“Preremitted” means sent or paid in advance, often used in formal financial/insurance writing.","zh":"“Preremitted”指“预先汇出/预先缴付”，多用于较正式的财务或保险语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"sent or paid in advance (before it is officially due), especially of money or documents.","zh":"预先汇出或预先缴付的（在正式到期前），尤指款项或文件。"},"examples":[{"en":"The grant requires preremitted funds before the project begins.","zh":"这项补助要求在项目开始前预先汇款。"},{"en":"Please attach proof of the preremitted payment with your application.","zh":"请在申请材料中附上预先缴款的证明。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “preremit”: to remit (send or pay) in advance.","zh":"“preremit”的过去式/过去分词：预先汇款；预先缴付。"},"examples":[{"en":"They preremitted the premium to avoid any lapse in coverage.","zh":"他们预先缴纳保费，以避免保障中断。"}]}],"synonyms":["prepaid","paid in advance","advance-paid","remitted in advance"],"phonetic":"/ˌpriːrɪˈmɪtɪd/","extraExplanation":["“preremitted”在日常英语里很少见，更常出现在保险、财务、税务或合同文件中。一般口语会说 paid in advance / prepaid / submitted in advance。","词根提示：remit 在金融语境里常指“汇款/缴付”，所以 preremit / preremitted 就是“提前汇（缴）”。"]}
{"word":"preremitting","summary":{"en":"Preremitting means sending or paying money ahead of time (a rare form; often written as pre-remitting).","zh":"Preremitting 指提前汇款或付款（较少见，常写作 pre-remitting）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) paying or sending money in advance; remitting ahead of the usual time or before something is officially due.","zh":"（罕见）预先付款或汇款；在通常时间之前、或在正式到期/要求之前先行缴付。"},"examples":[{"en":"Some suppliers offer a discount for pre-remitting payment before shipment.","zh":"有些供应商会对发货前预先付款提供折扣。"},{"en":"The company is preremitting taxes this quarter to avoid any late fees.","zh":"公司本季度提前缴税以避免滞纳金。"}]}],"synonyms":["pre-remitting","remitting in advance","paying in advance","making an advance payment","prepaying"],"phonetic":"/ˌpriːrɪˈmɪtɪŋ/","extraExplanation":["“preremitting”通常可理解为动词“pre-remit”的现在分词/动名词形式，但它不是高频词，更常见的写法是加连字符的“pre-remitting”，或直接用更自然的表达：“remit in advance / pay in advance / make an advance payment”。","“remit”在英文里常见含义是“汇款、缴款”，在法律/政府语境里也可指“减免（罚款、债务等）”，所以在阅读时要看上下文判断是“提前缴付”还是“减免”。"]}
{"word":"preremorse","summary":{"en":"Preremorse means feeling remorse or guilt in advance, before you take an action.","zh":"preremorse 指在做某事之前就预先感到懊悔或内疚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of remorse (guilt or regret) that you imagine in advance, before you do something; anticipatory remorse","zh":"在做某事之前就预先感到的懊悔/内疚；预期的悔意"},"examples":[{"en":"She felt preremorse about lying, even before she opened her mouth.","zh":"她还没开口撒谎，就已经预先感到内疚了。"},{"en":"His preremorse kept him from sending the angry message.","zh":"他预先想到会后悔，所以没有发出那条愤怒的信息。"},{"en":"If you’re feeling preremorse, it may be a sign to pause and rethink your choice.","zh":"如果你有预期的悔意，可能是在提醒你先停一下、重新考虑选择。"}]}],"synonyms":["anticipatory remorse","anticipated regret","preemptive guilt","foreboding regret"],"phonetic":"/ˌpriːrɪˈmɔːrs/","extraExplanation":["“Preremorse”并不是常见的标准词汇，更常见的表达是 “anticipatory remorse / anticipated regret / pre-emptive guilt”。在写作里偶尔会被用作创意造词：前缀 pre-（在……之前）+ remorse（懊悔）。","语感上它强调“还没发生就已经在心里上演后悔”，常用于描述道德冲突、冲动行为前的自我拉扯。正式写作中建议用更常见的说法，以避免读者不熟悉。"]}
{"word":"preremote","summary":{"en":"“Preremote” means “before remote work,” usually describing an earlier period, policies, or habits.","zh":"“preremote”指“远程办公之前”的，多用来形容当时的时代、制度或习惯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mostly in work/tech contexts) happening or existing before people worked remotely; from an earlier “before remote work” period.","zh":"（多用于工作/科技语境）指“远程办公之前”的；属于“远程化之前时代/阶段”的。"},"examples":[{"en":"In the preremote era, most meetings happened in a conference room.","zh":"在远程办公之前的时代，大多数会议都在会议室里开。"},{"en":"Our preremote policies didn’t mention video calls or time zones.","zh":"我们远程化之前的制度里并没有提到视频会议或时区问题。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to plan, prepare, or set up something before moving a team or system to remote work.","zh":"（较少见）在转为远程工作之前，为某事做规划、准备或预先配置。"},"examples":[{"en":"They preremoted their IT support process before going fully remote.","zh":"他们在全面转为远程之前，先把 IT 支持流程预先做了远程化准备。"}]}],"synonyms":["pre-remote","before-remote","pre-pandemic (context-dependent)","earlier (work) era"],"phonetic":"/ˌpriːrɪˈmoʊt/","extraExplanation":["“preremote”不是传统词典里很常见的标准词，更像是工作场景里的新造词（neologism）。写作时更常见的形式是加连字符的“pre-remote”（如：pre-remote policies / pre-remote era），可读性更强、更正式。","构词：前缀“pre-”表示“在……之前”，加上“remote”（远程的/远程工作）。它常用来对比“pre-remote”与“remote-first / post-remote（远程之后）”的做法与文化差异。"]}
{"word":"preremoval","summary":{"en":"Preremoval means the time or actions before something is removed; it’s often used in formal or technical contexts.","zh":"Preremoval 指“移除之前”的阶段或措施，常见于较正式或技术性的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time, stage, or actions that happen before something is removed (often used as a modifier, e.g., “preremoval inspection”).","zh":"移除之前的时间、阶段或措施（常作定语使用，如“preremoval inspection / 移除前检查”）。"},"examples":[{"en":"The technician performed a preremoval inspection to make sure the old unit could be taken out safely.","zh":"技术人员做了移除前检查，确保旧设备能安全拆除。"},{"en":"Preremoval planning reduced the risk of damaging nearby pipes.","zh":"移除前的规划降低了损坏附近管道的风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the period before removal (used like an adjective in formal writing).","zh":"与“移除之前”有关的（在正式文本中常像形容词一样作定语）。"},"examples":[{"en":"The report focuses on preremoval procedures and safety rules.","zh":"报告重点讨论移除前流程与安全规定。"}]}],"synonyms":["pre-removal","before removal","prior to removal"],"phonetic":"/ˌpriːrɪˈmuːvəl/","extraExplanation":["“preremoval”并不是非常常见的日常词，更常见的写法是加连字符的“pre-removal”，意思更清楚（pre- 表示“在……之前”）。","在移民或法律语境中，你可能会看到类似 “pre-removal” 的搭配，用来指“遣返/驱逐之前”的阶段或评估（不同国家/地区用词略有差异）。","更自然的替代表达包括：“before removal”、“prior to removal”、“pre-removal (with a hyphen)”。"]}
{"word":"preremove","summary":{"en":"“Preremove” means to remove something in advance, before a later step or process.","zh":"“preremove”表示“预先移除/提前去掉”，强调在后续步骤之前先移除。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove something ahead of time (before a later step or process); to take out in advance","zh":"预先移除；提前去掉（在后续步骤或流程之前先拿掉）"},"examples":[{"en":"Please pre-remove any staples before scanning the documents.","zh":"扫描文件前，请先把订书钉预先取下。"},{"en":"The app lets you pre-remove unwanted photos before you upload the album.","zh":"这个应用可以让你在上传相册前先把不想要的照片提前删掉。"}]}],"synonyms":["remove in advance","remove beforehand","pre-remove","take out beforehand"],"phonetic":"/ˌpriːrɪˈmuːv/","extraExplanation":["“preremove / pre-remove”不是非常常见的标准词，多见于技术写作、流程说明或软件界面里，用来强调“在某一步之前先移除”。在正式写作中，也可以用更自然的表达：remove in advance / remove beforehand / remove before (doing something)。","构词：pre-（在……之前）+ remove（移除）。有时会写成带连字符的“pre-remove”，可读性更强。"]}
{"word":"preremoved","summary":{"en":"“Preremoved” means something has been removed beforehand (often in technical or instruction contexts).","zh":"“preremoved”表示某物已在较早之前被提前移除（常见于说明书或技术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"removed in advance; taken away before a later step, event, or process.","zh":"预先移除的；提前拿走/去除的（在后续步骤或事件之前）。"},"examples":[{"en":"The preremoved seats made extra space for wheelchairs.","zh":"提前拆掉的座位为轮椅留出了更多空间。"},{"en":"Use the preremoved label to avoid damaging the package.","zh":"使用预先撕下的标签，以免弄坏包装。"}]},{"partOfSpeech":"v.","definition":{"en":"(past form) to remove something in advance.","zh":"（过去式用法）预先移除/提前去除某物。"},"examples":[{"en":"The technician preremoved the old filter before installing the new one.","zh":"技术员在安装新滤芯之前先把旧滤芯拆下来了。"}]}],"synonyms":["pre-removed","previously removed","already removed","removed in advance"],"phonetic":"/ˌpriːrɪˈmuːvd/","extraExplanation":["“preremoved”在日常英语中不算常见，更常见的写法是带连字符的“pre-removed”，或直接用更自然的表达：“removed in advance / previously removed / already removed”。","多用于说明书、工程/制造、物流标签等偏技术或流程化的语境，用来强调“这一步在更早之前已经完成”。"]}
{"word":"preremoving","summary":{"en":"“Preremoving” means removing something ahead of time, before a later process or step.","zh":"“preremoving”指在后续流程/步骤之前先把某物预先移除。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing something in advance; taking something out before a later step happens","zh":"预先移除；在后续步骤之前先把某物拿掉/删除"},"examples":[{"en":"In data cleaning, preremoving duplicates can reduce errors later.","zh":"在数据清理中，预先移除重复项可以减少后续错误。"},{"en":"The surgeon focused on preremoving damaged tissue before the main repair.","zh":"外科医生先预先移除受损组织，再进行主要修复。"}]}],"synonyms":["remove in advance","remove beforehand","pre-remove"],"phonetic":"/ˌpriːrɪˈmuːvɪŋ/","extraExplanation":["“preremoving”并不常见，更多见于技术写作（如数据处理、工程流程）中，表示“提前移除”。更自然的表达常用：remove beforehand / remove in advance / pre-remove（更常写成带连字符的 pre-remove）。","构词上是前缀 pre-（在……之前）+ remove（移除）形成的动词 preremove，其现在分词/动名词形式为 preremoving。"]}
{"word":"preremunerate","summary":{"en":"Preremunerate means to pay someone in advance for work or services (a rare word).","zh":"Preremunerate 指“预先支付报酬”（很少使用的词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To pay someone in advance for work or services; to remunerate beforehand.","zh":"（罕见）预先支付（报酬）；在工作或服务完成前先付酬劳。"},"examples":[{"en":"The company agreed to preremunerate contractors for the first month to help with startup costs.","zh":"公司同意为承包商预先支付第一个月的报酬，以帮助承担启动成本。"},{"en":"Some freelance clients preremunerate to secure a booking date.","zh":"有些自由职业客户会预先付款，以确保预约日期。"}]}],"synonyms":["pay in advance","prepay","pay upfront","advance payment (phrase)","pay beforehand"],"phonetic":"/ˌpriːrɪˈmjuːnəˌreɪt/","extraExplanation":["这个词在现代英语中非常少见，更多时候人们会说 pay in advance、prepay、pay upfront，或用更正式的 advance payment / advance fee。","构词上可以理解为前缀 pre-（“在……之前”）+ remunerate（“付酬、给报酬”）。因此它的含义基本等同于“预付报酬”。","如果你要写正式合同或商务文本，通常更自然的表达是 “The client will make an advance payment.”（客户将支付预付款）。"]}
{"word":"preremunerated","summary":{"en":"Preremunerated means paid in advance (before the work is done).","zh":"Preremunerated 指“预先支付报酬的（在工作完成前就支付）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"paid in advance; compensated before the work is done","zh":"预先支付报酬的；在工作完成前就已补偿的"},"examples":[{"en":"The consultant is preremunerated for the first month of work.","zh":"这位顾问第一个月的工作报酬是预先支付的。"},{"en":"Some gigs are preremunerated, so you receive the money before you start.","zh":"有些临时工作是预先付费的，所以你在开始前就能拿到钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) having already been paid; paid ahead of time","zh":"（指人）已经预先领到报酬的；提前拿到薪酬的"},"examples":[{"en":"She felt more secure knowing she was preremunerated for the project.","zh":"知道这个项目的报酬已预先支付，她感觉更安心。"}]}],"synonyms":["paid in advance","prepaid","paid upfront","advance-paid"],"phonetic":"/ˌpriːrɪˈmjuːnəˌreɪtɪd/","extraExplanation":["“preremunerated”由前缀 pre-（“在……之前”）+ remunerate（“支付报酬”）构成，语感偏正式，常见于合同、政策或学术写作中。日常英语里更常说：paid in advance / prepaid / paid upfront。"]}
{"word":"preremunerating","summary":{"en":"Preremunerating means paying compensation in advance (a rare, formal word).","zh":"preremunerating 指“预先付酬/提前支付报酬”（罕用、偏正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Paying someone in advance for work or services; prepaying as compensation.","zh":"（罕用）预先支付报酬的；在工作或服务完成前先行给付薪酬的。"},"examples":[{"en":"Some short-term contracts are preremunerating, offering part of the fee up front.","zh":"有些短期合约会预先支付部分费用，先给一部分报酬。"},{"en":"They negotiated a preremunerating arrangement to cover travel costs before the job began.","zh":"他们谈成了一种预先付酬的安排，用来在工作开始前覆盖差旅费用。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of paying someone in advance; providing compensation before work is completed.","zh":"预先付酬；在工作完成前先行支付报酬。"},"examples":[{"en":"Preremunerating can reduce financial risk for freelancers.","zh":"预先付酬可以降低自由职业者的经济风险。"}]}],"synonyms":["prepaid","paid in advance","advance-payment","upfront"],"phonetic":"/ˌpriːrɪˈmjuːnəˌreɪtɪŋ/","extraExplanation":["这个词非常少见，多见于正式或法律/财务语境。结构上是 pre-（“在……之前”）+ remunerate（“给……报酬”）+ -ing（现在分词/形容词化）。日常英语里更常用的说法是 prepaid / paid in advance / advance payment。"]}
{"word":"preremuneration","summary":{"en":"Preremuneration is a rare word meaning payment arranged or given in advance, before work or service.","zh":"Preremuneration 是个罕见词，指在工作或服务开始前就安排或支付的预付报酬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) payment or compensation considered or arranged before work is done or before a service is provided; advance remuneration.","zh":"（罕见）在工作开始前或服务提供前就被考虑或安排的报酬；预付报酬。"},"examples":[{"en":"The contract included preremuneration to cover the consultant’s initial travel costs.","zh":"合同包含预付报酬，用于支付顾问最初的差旅费用。"},{"en":"Some freelancers ask for preremuneration when a project is high-risk.","zh":"一些自由职业者在项目风险较高时会要求预付报酬。"}]}],"synonyms":["advance payment","upfront payment","prepayment","retainer","advance"],"phonetic":"/ˌpriˌrɪˌmjuːnəˈreɪʃən/","extraExplanation":["“preremuneration”由前缀 pre-（在……之前）+ remuneration（报酬）组成，但在现代英语中非常不常用，更多时候会直接说 advance payment / upfront payment / prepayment / retainer。","在商务语境里：为减少违约风险，常见说法是 “request an upfront payment” 或 “ask for a retainer”，比使用 preremuneration 更自然。"]}
{"word":"prerenal","summary":{"en":"Prerenal means “before the kidneys,” usually describing kidney problems caused by low blood flow to the kidneys.","zh":"Prerenal 指“肾前性”，通常描述因肾脏血流灌注不足而引起的肾功能问题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a condition that occurs before the kidneys (renal) and affects kidney function because of reduced blood flow to the kidneys.","zh":"肾前性的；指发生在肾脏（renal）之前的问题，因肾脏血流灌注不足而影响肾功能。"},"examples":[{"en":"Dehydration can cause prerenal acute kidney injury because less blood reaches the kidneys.","zh":"脱水会导致肾前性急性肾损伤，因为到达肾脏的血流减少。"},{"en":"The doctor suspected a prerenal cause and gave IV fluids to improve kidney perfusion.","zh":"医生怀疑是肾前性原因，于是给予静脉补液来改善肾脏灌注。"}]}],"synonyms":["pre-renal"],"phonetic":"/ˌpriːˈriːnəl/","extraExplanation":["“prerenal”多用于医学语境（尤其是肾功能不全/急性肾损伤 AKI 的分类）。常见对比：\n- 肾前性（prerenal）：血流/灌注不足（如脱水、出血、心衰）\n- 肾性/肾内性（intrarenal / renal）：肾脏本身受损（如肾小管坏死）\n- 肾后性（postrenal）：尿路梗阻（如结石、前列腺增生）\n词形上：pre-（在……之前）+ renal（肾的）。"]}
{"word":"prerent","summary":{"en":"“Prerent” is likely a misspelling of “parent,” meaning a mother or father; it can also mean to raise a child or describe a controlling main company.","zh":"“prerent”很可能是“parent”的拼写错误，意思是父母之一；也可作动词表示养育孩子，或作形容词表示“母公司/母体的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely the intended word) a mother or father; someone who has a child.","zh":"（很可能你想写的是）父母之一；有孩子的人。"},"examples":[{"en":"Her parents live in California.","zh":"她的父母住在加利福尼亚。"},{"en":"He became a parent at 30.","zh":"他在30岁时当了父亲/母亲。"}]},{"partOfSpeech":"v.","definition":{"en":"to act as a parent; to raise and care for a child.","zh":"做父母；抚养并照顾孩子。"},"examples":[{"en":"It’s not easy to parent a teenager.","zh":"养育青少年并不容易。"},{"en":"They try to parent with patience and clear rules.","zh":"他们努力用耐心和清晰的规则来教育孩子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Usually before another noun) related to or belonging to the main organization or company that controls others.","zh":"（常作定语）母体的；母公司的；控制其他机构的。"},"examples":[{"en":"The parent company owns three smaller brands.","zh":"母公司拥有三个较小的品牌。"},{"en":"Check the parent website for official updates.","zh":"去母网站查看官方更新。"}]}],"synonyms":["mother","father","guardian","caregiver"],"phonetic":"/ˈperənt/","extraExplanation":["你输入的“prerent”在英文里通常不是一个标准单词，更常见的正确拼写是“parent”。","如果你本来想表达“提前租（房）”，英文更常说“rent in advance / prepay the rent”，而不是“prerent”。"]}
{"word":"prerental","summary":{"en":"“Prerental” means “before renting,” especially for inspections or preparation.","zh":"“Prerental”表示“租赁之前的”，常用于租前检查或准备工作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done or occurring before something is rented (often for checking condition, paperwork, or preparation).","zh":"在出租之前进行的；租赁前的（常指检查状况、办理手续或准备工作）。"},"examples":[{"en":"The mechanic completed a prerental inspection of the van.","zh":"技师对这辆面包车做了租前检查。"},{"en":"Please review the prerental checklist before you pick up the equipment.","zh":"取设备前请先查看租前清单。"}]},{"partOfSpeech":"n.","definition":{"en":"a process, check, or document used before renting something.","zh":"租前流程/检查/文件（用于正式出租前）。"},"examples":[{"en":"The prerental includes a safety check and a photo report.","zh":"租前流程包括安全检查和拍照记录。"}]}],"synonyms":["pre-rental","before-rental","pre-lease"],"phonetic":"/ˌpriːˈrɛntəl/","extraExplanation":["“prerental”在实际使用中更常见的写法是连字符形式“pre-rental”，尤其在正式文件里（如“pre-rental inspection / pre-rental checklist”）。不加连字符也能见到，但更像行业用语或内部文档用法。","构词：前缀“pre-”（在……之前）+ “rental”（租赁/出租）。常见搭配：pre-rental inspection（租前检查）、pre-rental agreement/forms（租前协议/表格）、pre-rental checklist（租前清单）。"]}
{"word":"prereport","summary":{"en":"“Prereport / pre-report” means a preliminary report shared before the final report.","zh":"“prereport / pre-report”指在最终报告前提交/发布的初步报告。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preliminary report given before the full or final report is ready (often written as “pre-report”).","zh":"预先报告；在完整/最终报告完成前先提交的初步报告（常写作“pre-report”）。"},"examples":[{"en":"Please submit a pre-report by Friday, and the final report next week.","zh":"请在周五前提交一份预先报告，最终报告下周再交。"},{"en":"The safety team shared a brief pre-report after the incident.","zh":"事故发生后，安全团队先发布了一份简短的初步报告。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide a preliminary report in advance of a full report (rare in everyday English; more common: “report in advance” or “issue a pre-report”).","zh":"在完整报告前先行做初步汇报（日常英语较少用作动词；更常说“report in advance”或“issue a pre-report”）。"},"examples":[{"en":"We will report in advance with initial findings, then confirm them later.","zh":"我们会先行汇报初步发现，之后再进行确认。"}]}],"synonyms":["pre-report","preliminary report","initial report","advance report"],"phonetic":"/ˌpriːrɪˈpɔːrt/","extraExplanation":["“prereport”不是特别常见的标准词形，更常见的写法是带连字符的“pre-report”，尤其在商务、科研、内部流程文件中出现。","在新闻语境里，如果想表达“事先报道/预告”，更自然的说法通常是“preview (a story)”“report ahead of time”“advance coverage”。"]}
{"word":"prerepresent","summary":{"en":"“Prerepresent” is a rare verb meaning “to represent or depict in advance.”","zh":"“Prerepresent”是个很少见的动词，表示“提前代表或预先呈现/描绘”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to represent (something) in advance; to depict or stand for something before it fully happens or is formally presented (rare/nonstandard usage)","zh":"（罕见/不太规范用法）预先代表；提前呈现或描绘（某事），在其正式发生或呈现之前先行象征/展示"},"examples":[{"en":"The sketch prerepresents the final logo by showing its key shapes early.","zh":"这张草图通过提前展示关键形状，预先呈现了最终的标志。"},{"en":"Some critics say the opening scene prerepresents the conflict that follows.","zh":"一些评论家认为开场一幕预示性地呈现了随后出现的冲突。"}]}],"synonyms":["prefigure","foreshadow","anticipate","represent in advance","depict beforehand"],"phonetic":"/ˌpriːˌrɛprɪˈzɛnt/","extraExplanation":["“prerepresent”在现代英语里非常少见，很多时候会被认为不自然或不规范。写作中更常用：represent in advance（提前呈现/代表）、prefigure（预示）、foreshadow（铺垫/伏笔）、depict beforehand（事先描绘）。","如果你的意思是“预先代表某人/某团体”，更自然的表达通常是：act as a representative ahead of time / serve as an interim representative（提前/临时担任代表）。"]}
{"word":"prerepresentation","summary":{"en":"A rare term meaning an early or preliminary version of a representation.","zh":"较少用：指对某事物的早期/初步呈现或表述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preliminary or earlier representation of something; a way of showing, describing, or modeling something before the final version is made","zh":"（较少用）预先的呈现/表述；在最终版本之前对某事物的初步展示、描述或建模"},"examples":[{"en":"The designer shared a prerepresentation of the logo to get quick feedback before refining it.","zh":"设计师先分享了一个标志的初步版本，以便在进一步完善前快速收集反馈。"},{"en":"In the report, the first chart is only a prerepresentation of the final data visualization.","zh":"在报告中，第一张图表只是最终数据可视化的初步呈现。"}]}],"synonyms":["preliminary representation","early depiction","rough draft","prototype (context-dependent)"],"phonetic":"/ˌpriːˌrɛprɪzənˈteɪʃən/","extraExplanation":["“prerepresentation”在日常英语中很少作为固定词条使用，更常见的写法是分开或加连字符：pre-representation / preliminary representation（初步呈现、预呈现）。","如果你是在学术写作（例如计算机科学、数学、认知科学）中看到它，通常表示“在正式/最终表示之前的早期表示或表征”，强调“尚未完成、用于过渡或试验”的性质。","写作建议：若读者不熟悉该词，用“preliminary representation”会更自然、更易懂。"]}
{"word":"prereproductive","summary":{"en":"“Prereproductive” means happening before an organism becomes able to reproduce.","zh":"“Prereproductive”指在生物具备繁殖能力之前的阶段或情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Before an organism reaches reproductive maturity; occurring prior to the ability to reproduce.","zh":"生殖前的；在达到生殖成熟、具备繁殖能力之前发生的。"},"examples":[{"en":"Many birds have a long prereproductive period while they learn to find food and avoid predators.","zh":"许多鸟类在学会觅食和躲避天敌期间，会经历较长的生殖前阶段。"},{"en":"Researchers measured survival rates in prereproductive individuals.","zh":"研究人员测量了生殖前个体的存活率。"}]}],"synonyms":["pre-breeding","immature","juvenile (context-dependent)"],"phonetic":"/ˌpriːˌriːprəˈdʌktɪv/","extraExplanation":["该词多用于生物学与生态学语境（如种群生态、生命史理论）。它强调“还不能繁殖”的阶段，常与 reproductive（生殖的）、postreproductive（生殖后的）一起用来划分生命周期。","构词上：pre-（在……之前）+ reproductive（生殖的）。在学术写作中常见搭配：prereproductive age/period/individuals（生殖前年龄/阶段/个体）。"]}
{"word":"prereption","summary":{"en":"“prereption” isn’t a standard English word; it’s likely a misspelling (often “preparation” or “preemption”).","zh":"“prereption” 不是标准英文；通常是拼写错误（常见为 “preparation” 或 “preemption”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“prereption” is not a standard English word; it is most likely a misspelling of another word (commonly “preparation” or “preemption”), depending on your context.","zh":"“prereption” 不是标准英文单词；很可能是其他单词的拼写错误（常见可能是 “preparation” 或 “preemption”），需要结合语境判断。"},"examples":[{"en":"If you meant “preparation”: The team did a lot of preparation for the exam.","zh":"如果你想写 “preparation”：团队为考试做了很多准备。"},{"en":"If you meant “preemption”: The company claimed preemption under federal law.","zh":"如果你想写 “preemption”：公司主张联邦法优先适用（排除州法）。"}]}],"phonetic":"/priːrɪˈpʃən/","extraExplanation":["最常见的可能是 **preparation（准备）**：用于学习、工作、旅行前的准备，如 “exam preparation / food preparation”。","如果你是在法律/政策语境里看到的，可能是 **preemption（优先权；优先适用）**：指更高层级的法律或规则排除/覆盖较低层级的规则。","你可以把原句发我（前后各3–10个词就行），我能更准确判断你想要的正确单词。"]}
{"word":"prerepublican","summary":{"en":"Prererepublican describes something that happened before the Republican Party (U.S.) or before a country became a republic.","zh":"prerepublican 指发生在（美国）共和党成立之前，或某国成为共和国之前的事物/时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often in U.S. politics) Existing or happening before the founding of the Republican Party (1854) or before “Republican” politics became influential.","zh":"（常用于美国政治）指在共和党（1854年成立）出现之前，或“共和党政治”产生重要影响之前的。"},"examples":[{"en":"Some historians study prerepublican party politics in the early 1850s.","zh":"一些历史学家研究19世纪50年代初共和党成立前的政党政治。"},{"en":"The newspaper’s prerepublican editorials show different priorities from later Republican viewpoints.","zh":"这家报纸在共和党出现之前的社论，反映出与后来共和党观点不同的关注点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical, general) From a time before a country became a republic; pre-republic era.","zh":"（历史、泛指）指某国成为共和国之前的时期或属于那一时期的；共和国之前的。"},"examples":[{"en":"The museum includes prerepublican coins from the monarchy period.","zh":"博物馆里有一些来自君主制时期的共和国成立前的硬币。"},{"en":"The novel is set in prerepublican Rome.","zh":"这部小说的背景设定在罗马共和国之前的时期。"}]}],"synonyms":["pre-Republican","pre-republic","pre-republican era","pre-1854 (U.S. context)"],"phonetic":"/ˌpriː rɪˈpʌblɪkən/","extraExplanation":["这个词通常写作“pre-Republican”或“pre-republican”，连字符是否使用取决于写作风格与是否需要避免歧义。","在美国语境里，“Republican”通常特指共和党；在更广泛的历史语境里，“republican”则是“共和国的/共和制的”。大小写能帮助区分：大写多指政党，小写多指政治制度。"]}
{"word":"prerequest","summary":{"en":"A prerequest is an advance request, or (in API tools) a pre-request script/step run before sending a request.","zh":"prerequest 指“预先提出的请求”，或（在 API 工具中）指“发送请求前运行的预请求脚本/步骤”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A request made in advance, before a main action or event.","zh":"（不常见）预先提出的请求；在主要行动或事件之前提出的请求。"},"examples":[{"en":"Please send any prerequest documents before the meeting.","zh":"请在会议前把所有预先需要的文件发过来。"},{"en":"We can’t start the project until the client’s prerequest is approved.","zh":"在客户的预先请求获批之前，我们无法启动项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing, especially API tools like Postman) A script or step that runs before an API request is sent.","zh":"（计算机用语，常见于 Postman 等 API 工具）在发送 API 请求之前运行的脚本或步骤（预请求）。"},"examples":[{"en":"Add a token in the prerequest script so every call is authenticated.","zh":"在预请求脚本里添加 token，这样每次调用都会通过身份验证。"},{"en":"The prerequest step sets the timestamp and signs the request.","zh":"预请求步骤会设置时间戳并对请求进行签名。"}]}],"synonyms":["request in advance","prior request","pre-request script","preflight step"],"phonetic":"/ˈpriːˌrɛk.wɛst/","extraExplanation":["“prerequest”在日常英语里并不常见；更常用的说法通常是“request in advance”（提前请求）或“prior request”（事先请求）。","如果你是在 Postman 里看到的，它常写作“Pre-request Script”，属于工具里的固定术语，用来在请求发出前自动生成变量、签名、token 等。","容易和“prerequisite”（先决条件/前置要求）混淆：prerequisite 是“必须先具备的条件”，而 prerequest 更偏向“先提出的请求/预先执行的脚本”。"]}
{"word":"prerequire","summary":{"en":"“Prerequire” means to require something beforehand as a prerequisite.","zh":"“Prerequire”指把某事预先要求为先决条件。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to require (something) in advance as a condition before something else can happen","zh":"（在之前）预先要求，把……作为先决条件"},"examples":[{"en":"The program prerequires students to complete basic algebra before applying.","zh":"该项目预先要求学生在申请前完成基础代数课程。"},{"en":"Some visas prerequire proof of financial support.","zh":"有些签证会预先要求提供经济担保证明。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to need something beforehand; to have a prerequisite","zh":"（不常用）事先需要；具有前置条件"},"examples":[{"en":"This course prerequires strong reading skills.","zh":"这门课事先需要较强的阅读能力。"}]}],"synonyms":["require beforehand","make a prerequisite","require as a prerequisite","stipulate"],"phonetic":"/ˌpriːrɪˈkwaɪər/","extraExplanation":["“prerequire”在日常英语里不算常见，更常见的表达是“require as a prerequisite / require beforehand”，或直接用名词“prerequisite（先决条件）”。","有时也会写成“pre-require”。在正式写作中，如果担心读者不熟悉这个词，用更常见的说法会更清晰。"]}
{"word":"prerequired","summary":{"en":"“Prerequired” means required in advance, before something else can be done.","zh":"“Prerequired”表示“必须预先满足的要求”，即做某事前先要完成/具备的条件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"required before something else can happen; needed in advance","zh":"预先要求的；必须先满足的（在做别的事之前就需要）"},"examples":[{"en":"Completion of safety training is prerequired before you can enter the lab.","zh":"完成安全培训是进入实验室的预先要求。"},{"en":"A valid ID is prerequired for check-in.","zh":"办理入住需要预先提供有效证件。"}]}],"synonyms":["required beforehand","required in advance","mandatory prior to","prerequisite (closest common term)"],"phonetic":"/ˌpriːrɪˈkwaɪrd/","extraExplanation":["“prerequired”在日常英语里不算常见，更多见于学校/公司制度、表格或技术文档中（有时也写作“pre-required”）。更自然、更常用的表达通常是“required beforehand / required in advance”。","如果你想表达“先修条件/先决条件”，最标准的词是“prerequisite”（例如：Calculus is a prerequisite for Physics）。在课程语境里，用“prerequisite”通常比“prerequired”更地道。"]}
{"word":"prerequirement","summary":{"en":"A prerequirement is a condition you must meet before something else, similar to a prerequisite.","zh":"prerequirement 指必须先满足的条件，类似 prerequisite（先决条件/先修要求）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that must happen or be true before something else can happen; a required condition beforehand (often used like “prerequisite”).","zh":"（先决）要求；前置条件：在另一件事发生之前必须满足的条件（常用于类似“prerequisite/先修条件”的语境）。"},"examples":[{"en":"English 101 is a prerequirement for the advanced writing class.","zh":"英语101是高级写作课的先修要求。"},{"en":"A valid passport is a prerequirement for international travel.","zh":"有效护照是国际旅行的前置条件。"}]}],"synonyms":["prerequisite","precondition","requirement","condition"],"phonetic":"/ˌpriːrɪˈkwaɪərmənt/","extraExplanation":["“prerequirement”在现代英语中不算常见，更常用的是“prerequisite”（先决条件/先修课）或“requirement”（要求）。在正式写作里，优先用“prerequisite / precondition / requirement”，除非你所在机构或文件明确使用“prerequirement”。","构词：pre-（在……之前）+ requirement（要求）。意思直观，但因为“prerequisite”更固定、更地道，所以“prerequirement”听起来可能偏“机构用语/文件用语”。"]}
{"word":"prerequiring","summary":{"en":"“Prerequiring” means requiring something beforehand as a prerequisite (often in formal/academic contexts).","zh":"“prerequiring”表示“事先要求；作为前置条件而要求”（多用于正式/学术语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of “prerequire”) requiring something in advance as a condition; requiring as a prerequisite.","zh":"（“prerequire”的现在分词）预先要求；作为前提条件而要求。"},"examples":[{"en":"Some courses are prerequiring a placement test before you can enroll.","zh":"有些课程要求你在选课前先参加分班考试。"},{"en":"The program is prerequiring basic Python knowledge.","zh":"这个项目把基础的 Python 知识设为前置要求。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a rule, step, or condition that requires something beforehand.","zh":"形容某项规定、步骤或条件：事先要求某事。"},"examples":[{"en":"A prerequiring policy can prevent unprepared students from joining the class.","zh":"“前置要求”的政策可以避免准备不足的学生进入课堂。"},{"en":"We removed the prerequiring step to make the process simpler.","zh":"我们取消了那一步前置要求，让流程更简单。"}]}],"synonyms":["requiring as a prerequisite","requiring beforehand","preconditioning","making a prerequisite"],"phonetic":"/ˌpriːrɪˈkwaɪrɪŋ/","extraExplanation":["“prerequiring”在日常英语里不算常见，更自然的说法通常是：\n- “requiring X as a prerequisite”（把X作为先决条件）\n- 用名词“prerequisite”（先决条件/前置要求），例如：“Python is a prerequisite.”\n在学校课程、证照、申请流程等语境里最常见。"]}
{"word":"prerequisite","summary":{"en":"A prerequisite is something required beforehand—often a course, condition, or skill you must have before moving on.","zh":"Prerequisite 指“先决条件/前置要求”，常见于先修课程、必备条件或技能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that must be done, met, or learned before you can do something else; a required condition.","zh":"做某事之前必须先完成、满足或学会的事情；先决条件。"},"examples":[{"en":"English 101 is a prerequisite for English 201.","zh":"英语101是英语201的先修课。"},{"en":"A valid passport is a prerequisite for international travel.","zh":"有效护照是出国旅行的先决条件。"},{"en":"Trust is a prerequisite for a healthy relationship.","zh":"信任是健康关系的先决条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Required before you can take a course or join a program.","zh":"（课程/项目）规定必须先修或先具备的。"},"examples":[{"en":"The prerequisite course must be completed with a B or higher.","zh":"先修课程必须达到B或更高成绩。"},{"en":"Do you have the prerequisite credits for this major?","zh":"你有这个专业要求的先修学分吗？"}]}],"synonyms":["requirement","precondition","condition","necessity","qualification"],"phonetic":"/ˌpriˈrɛkwəzɪt/","extraExplanation":["“prerequisite”常见于教育、培训与职场要求中：course prerequisite（先修课）、prerequisite skills（必备技能）、prerequisite condition/requirement（先决条件/前置要求）。","词形提示：pre- 表示“在……之前”，requisite 表示“必要的/必需的”。记忆时可理解为“事前必需的东西”。","易混词：requirement（要求，范围更广）；qualification（资格，常指符合标准的资历）；precondition（先决条件，语气更正式，偏强调逻辑或因果前提）。"]}
{"word":"prerequisites","summary":{"en":"Required conditions or things that must come first.","zh":"必须先具备的条件或先完成的事项。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things you must have or do before something else can happen; required conditions","zh":"做某事之前必须具备或完成的事情；先决条件"},"examples":[{"en":"English 101 is a prerequisite for this writing course.","zh":"英语101是这门写作课的先修课。"},{"en":"A passport is a prerequisite for international travel.","zh":"护照是国际旅行的必备条件。"}]}],"synonyms":["requirements","conditions","preconditions","qualifications"],"phonetic":"/ˌpriːˈrɛkwəzɪts/","extraExplanation":["prerequisite 常用于学习、工作、申请等正式语境：表示“先修课/前置条件”。复数 prerequisites 很常见，因为通常不止一个条件。","构词提示：pre-（在……之前）+ requisite（必要的）。所以字面意思就是“事先需要的东西/条件”。","常见搭配：meet the prerequisites（满足先决条件）、prerequisite course（先修课）、prerequisite skills（必备技能）、a prerequisite for/to…（……的先决条件）。"]}
{"word":"prerequisition","summary":{"en":"A prerequisite is something required or needed before you can do something else.","zh":"prerequisite 指“先决条件/先修要求”，即做某事之前必须先满足的条件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that must happen or be true before something else can happen (a requirement in advance).","zh":"（先决条件）在另一件事发生之前必须先满足的条件或要求。"},"examples":[{"en":"Basic algebra is a prerequisite for this physics course.","zh":"基础代数是这门物理课的先修条件。"},{"en":"One prerequisite for the job is strong communication skills.","zh":"这份工作的一个先决条件是良好的沟通能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Required beforehand; needed as a condition before something else.","zh":"（形容词）先决的；作为前提条件所必需的。"},"examples":[{"en":"You must complete the prerequisite training before starting work.","zh":"你必须先完成必修培训才能开始工作。"}]}],"synonyms":["requirement","condition","precondition","necessity","qualification"],"phonetic":"/ˌpriˈrɛkwəzɪt/","extraExplanation":["你输入的拼写“prerequisition”不常见，通常应为 **prerequisite**。常见错误是把 *-quisite*（来自拉丁语，含“取得/获得”之意）误写成 *-quisition*。","在教育语境中，**prerequisite** 常对应“先修课/先修条件”；在工作或生活语境中，更常译为“必要条件/前提”。相关词：**corequisite**（必须同时修的课程）。"]}
{"word":"preresemblance","summary":{"en":"“Preresemblance” is not a standard word; use “early/prior resemblance” or “prefigure” instead.","zh":"“preresemblance”不是标准英语；更建议用“early/prior resemblance”或“prefigure”等表达。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it looks like a formed word meaning “a resemblance that comes before something else” (pre- + resemblance). In normal writing, people usually say “early resemblance,” “prior resemblance,” or use a different verb like “prefigure.”","zh":"不是标准英语词；看起来像是把 pre-（在……之前）+ resemblance（相似）组合出来，意思可能是“事先的相似/先出现的相似之处”。实际写作中更常用 “early/prior resemblance（早期/先前的相似）”，或用 “prefigure（预示、预现）” 等表达。"},"examples":[{"en":"There is an early resemblance between the two sketches.","zh":"这两幅草图之间有一种早期的相似之处。"},{"en":"The first draft prefigures the final chapter in tone and imagery.","zh":"初稿在语气和意象上预示了最终章节。"}]}],"synonyms":["early resemblance","prior resemblance","prefigure","foreshadow"],"phonetic":"/ˌpriːrɪˈzɛmbləns/","extraExplanation":["“preresemblance”在常见词典和语料中几乎不出现，因此更可能是拼写错误或临时造词。","如果你本来想写的是“resemblance（相似）”，更自然：There is a strong resemblance between A and B.（A和B非常相像。）","如果你想表达“预示/预现的相似”，常用搭配是 early/prior resemblance，或用动词：prefigure / foreshadow（预示）、anticipate（先呈现出…的特征）。"]}
{"word":"preresemble","summary":{"en":"“Preresemble” is a very rare/nonstandard verb meaning “to resemble beforehand.” In most cases, use “resemble,” “look like,” or “foreshadow.”","zh":"“preresemble”是极少见/非标准用法，可理解为“预先相像”。多数情况下建议用更常见的“resemble / look like / foreshadow”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/very rare) To resemble something beforehand; to look like something that comes later.","zh":"（非标准/极少见）预先相像；在某事发生或出现之前就呈现出相似的样子。"},"examples":[{"en":"Her early sketches preresembled the final logo design.","zh":"她早期的草图就已经预先像最终的标志设计了。"},{"en":"The childhood photo almost preresembles the actor he became.","zh":"那张童年照片几乎就预示般地像他后来成为的那个演员。"}]},{"partOfSpeech":"other","definition":{"en":"(More common alternatives) Use “resemble,” “look like,” or “foreshadow” depending on what you mean.","zh":"（更常用的表达）根据意思选择“resemble（像）”“look like（看起来像）”或“foreshadow（预示/埋伏笔）”。"},"examples":[{"en":"These clouds resemble mountains.","zh":"这些云看起来像山。"},{"en":"That small detail foreshadows the ending of the story.","zh":"那个小细节为故事结局埋下了伏笔。"}]}],"synonyms":["resemble","look like","foreshadow","prefigure"],"phonetic":"/ˌpriːrɪˈzɛmbəl/","extraExplanation":["“preresemble”不是常见词，很多词典不会收录；读者可能会觉得不自然或像拼写错误。正式写作里建议用更标准的动词：单纯“像”用 resemble / look like；强调“提前预示”用 foreshadow、hint at。","构词上可以理解为前缀 pre-（“在……之前”）+ resemble（“相像”），但英语里很少这样造词；需要时也可以改写成：“resemble … even before …”来表达“提前就像”。"]}
{"word":"preresembled","summary":{"en":"“Preresembled” is not standard; you probably mean “resembled” = looked like / was similar to.","zh":"“preresembled”不是标准用法；你多半想写“resembled”，表示“像/相似”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Not a standard English word; it is most likely a misspelling of “resembled” (past tense of “resemble”), meaning “looked like” or “was similar to.”","zh":"不是标准英语词；很可能是把“resembled”（动词resemble的过去式）拼错了，意思是“看起来像/与……相似”。"},"examples":[{"en":"The child resembled her mother in both voice and smile.","zh":"这个孩子在声音和笑容上都像她妈妈。"},{"en":"The old house resembled a small museum after the renovation.","zh":"翻新后，这座老房子看起来像个小博物馆。"}]}],"synonyms":["looked like","was similar to","took after","matched"],"phonetic":"/rɪˈzɛmbəld/","extraExplanation":["“resemble”后面通常直接接宾语（resemble someone/something），不常用进行时（一般不说 *is resembling*）。","如果你本来想表达“事先/预先……”，英语里常用前缀“pre-”，但“pre + resemble”并不构成常见词。你可能想写的是：\n- “resembled”（像）\n- “preassembled”（预先组装好的）\n- “prearranged”（预先安排好的）","如果你能提供一句原句（你想表达的整句话），我可以帮你确定最合适的词和改法。"]}
{"word":"preresembling","summary":{"en":"“Preresembling” is a rare, nonstandard form meaning “resembling beforehand.” In most writing, use “similar” or “already resembling.”","zh":"“preresembling”是罕见且不标准的形式，大意为“事先就相似”。正式写作中通常改用“similar”或“already resembling”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) resembling something in advance or beforehand; having an earlier resemblance.","zh":"（非标准/罕见用法）预先相似的；在某事发生前就呈现出相似特征的。"},"examples":[{"en":"In some drafts, the author described a “preresembling” pattern, but later changed it to “already similar.”","zh":"在一些草稿中，作者写到“preresembling（预先相似的）”模式，但后来改成了“already similar（已经相似）”。"},{"en":"If you mean the two designs look alike from the start, you can say they are “similar” or “resembling each other.”","zh":"如果你想表达两个设计一开始就很像，可以说它们“similar（相似）”或“resembling each other（彼此相像）”。"}]}],"synonyms":["already similar","similar from the start","bearing an early resemblance","prefiguring (context-dependent)"],"phonetic":"/ˌpriːrɪˈzɛmblɪŋ/","extraExplanation":["“preresembling”不是常见英语词，通常被视为拼写/造词。英语里更自然的表达是：\n- already similar（已经相似）\n- similar from the beginning（一开始就相似）\n- bearing a resemblance beforehand（事先就带有相似之处）\n如果你提供原句，我可以帮你改成地道表达。"]}
{"word":"preresolution","summary":{"en":"“Pre-resolution” means before something is officially resolved or decided.","zh":"“Pre-resolution”表示在事情正式解决或作出决定之前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written “pre-resolution”) happening or existing before a decision, agreement, or problem is formally settled (before it is “resolved”).","zh":"（常写作 pre-resolution）在正式作出决定、达成协议或问题被解决之前发生或存在的；解决/定案之前的。"},"examples":[{"en":"They held a pre-resolution meeting to discuss possible compromises.","zh":"他们在决议通过前开了个会，讨论可能的折中方案。"},{"en":"The report covers pre-resolution negotiations between the two sides.","zh":"这份报告涵盖了双方在问题解决前的谈判过程。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or stage before a resolution (a final decision or settlement) is reached.","zh":"在达成最终决定或解决方案之前的阶段；未定案期。"},"examples":[{"en":"In the pre-resolution stage, emotions can run high.","zh":"在未定案阶段，人们情绪可能会很激动。"}]}],"synonyms":["pre-decision","pre-settlement","pre-agreement","before resolution"],"phonetic":"/ˌpriːˌrɛzəˈluːʃən/","extraExplanation":["“preresolution”更常见的写法是带连字符的“pre-resolution”。在正式写作里，用连字符能更清楚地表示它是由前缀 pre-（在……之前）+ resolution（解决/决议）构成的复合词。","在不同领域含义会稍有侧重：在法律/政治语境里多指“决议通过前/和解前”；在工作管理里常指“问题关闭前的阶段”；在成像/视频技术里也可能指“达到目标分辨率之前的（预览/较低分辨率）”，但这种用法通常会写得更具体（如 pre-resolution preview）。"]}
{"word":"preresolve","summary":{"en":"Preresolve means to resolve something ahead of time, often in computing (like DNS or dependencies).","zh":"Preresolve 指“预先解析/预先解决”，常用于计算机语境（如 DNS 或依赖关系）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to resolve (a problem, name, dependency, etc.) in advance, before it is needed later","zh":"预先解析/预先解决（在真正需要之前，先把问题、名称、依赖关系等处理好）"},"examples":[{"en":"The app preresolves DNS names to reduce delays during startup.","zh":"这个应用会预先解析 DNS 域名，以减少启动时的延迟。"},{"en":"We preresolved the dependencies so the deployment wouldn’t fail at runtime.","zh":"我们预先解决了依赖关系，这样部署时就不会在运行阶段失败。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a decision or reach a conclusion ahead of time","zh":"提前决定；事先定论"},"examples":[{"en":"Try not to preresolve the conflict before hearing both sides.","zh":"在听完双方说法之前，尽量不要先入为主地把争议定论。"}]}],"synonyms":["pre-resolve","resolve in advance","precompute","preprocess"],"phonetic":"/ˌpriːrɪˈzɑlv/","extraExplanation":["“preresolve”更常见于技术语境（如网络、编译、打包、构建流程），意思是把“解析/解决”这一步提前做掉，以换取后续更快或更稳定。","写法上也常见带连字符的“pre-resolve”，尤其在文档或技术说明中；含义相同。"]}
{"word":"preresolved","summary":{"en":"“Preresolved” means already decided or resolved in advance, often used in formal or computing contexts.","zh":"“preresolved”指“已经预先决定或事先解决”，常见于正式语境或计算机/工程语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decided or settled in advance; already resolved before something happens or before a process begins.","zh":"预先决定的；事先解决/已先行定案的（在某事发生或某流程开始前就已解决）。"},"examples":[{"en":"The issue was preresolved in the contract, so there was no debate later.","zh":"这个问题在合同里已经预先定案，所以后来就没有争议了。"},{"en":"Because the conflict was preresolved, the meeting moved quickly to planning.","zh":"因为冲突已经事先解决，会议很快就进入了规划环节。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Already converted into a final, ready-to-use result (such as a value, address, or dependency) before runtime or before a later step.","zh":"（计算机）在运行时或后续步骤之前，已经被提前解析/计算成可直接使用的最终结果（如值、地址、依赖）。"},"examples":[{"en":"The build tool stores preresolved dependencies to speed up installation.","zh":"构建工具会保存已预先解析的依赖，以加快安装速度。"},{"en":"These preresolved URLs reduce the work the app has to do at startup.","zh":"这些已预先解析的 URL 减少了应用启动时的工作量。"}]}],"synonyms":["pre-decided","prearranged","settled in advance","already resolved","precomputed","preprocessed"],"phonetic":"/ˌpriːrɪˈzɑlvd/","extraExplanation":["“preresolved”由前缀 pre-（“预先”）+ resolved（“已解决的/已确定的”）组成，常见于技术写作、工程文档或正式说明中。日常口语里更常用 already decided / settled / resolved 之类的表达。","在软件语境里，它强调“提前处理以节省后续成本”（比如更快启动、更少网络请求、更少运行时计算）。不同项目可能也会写作 pre-resolved 或 preresolved。"]}
{"word":"preresolving","summary":{"en":"Preresolving means resolving something ahead of time, often used in computing (like DNS or dependencies) to improve speed.","zh":"Preresolving 指“预先解析/预先解决”，多用于计算机语境（如 DNS 或依赖项），目的是提升速度与响应。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) Resolving something in advance, especially before it is needed (often in computing, e.g., resolving names, links, or dependencies early).","zh":"（现在分词）提前解析/提前解决某事，尤其指在需要之前先处理（计算机语境常见，如提前解析名称、链接或依赖）。"},"examples":[{"en":"The browser is preresolving the domain to speed up page loading.","zh":"浏览器正在提前解析该域名，以加快页面加载。"},{"en":"We’re preresolving dependencies during startup to avoid delays later.","zh":"我们在启动时提前解析依赖，以避免后续卡顿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a process or feature that resolves something ahead of time.","zh":"形容一种“预先解析/预先解决”的流程或功能。"},"examples":[{"en":"Enable preresolving to reduce lookup time.","zh":"启用预解析以减少查询时间。"},{"en":"The preresolving step happens before the main request is sent.","zh":"预解析步骤发生在主请求发送之前。"}]}],"synonyms":["pre-resolving","resolving in advance","preprocessing","prefetching (related)"],"phonetic":"/ˌpriːrɪˈzɑlvɪŋ/","extraExplanation":["“preresolving”来自动词“preresolve”（pre- + resolve）。在技术文档里也常写作“pre-resolving”或“pre resolving”，含义基本相同，但“pre-resolving”更符合传统拼写习惯。","在网络/浏览器语境中，它常指“DNS pre-resolving（DNS 预解析）”：先把域名解析成 IP，以减少用户真正点击或请求时的等待。"]}
{"word":"preresort","summary":{"en":"Pre-resort means “before an area becomes a tourist resort or is developed like one.”","zh":"preresort（常写作 pre-resort）指“某地成为旅游度假区或进行度假区开发之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written as “pre-resort”) before an area becomes a tourist resort or before resort-style development happens.","zh":"（常写作 pre-resort）指某地成为旅游度假区之前，或度假区式开发发生之前的。"},"examples":[{"en":"The photos show the coastline in its pre-resort days, before the hotels were built.","zh":"这些照片展示了海岸在“度假区开发前”的样子，当时酒店还没建起来。"},{"en":"Residents want to protect the island’s pre-resort environment and local culture.","zh":"居民希望保护这座岛“度假区化之前”的自然环境和本地文化。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) the time/period before resort development; “the pre-resort era.”","zh":"（少见，非正式）度假区开发前的时期；即“度假区化之前的年代”。"},"examples":[{"en":"He researched the pre-resort history of the town.","zh":"他研究了这座城镇在度假区开发前的历史。"}]}],"synonyms":["pre-development","before resort development","undeveloped (in context)","original (in context)"],"phonetic":"/ˌpriːrɪˈzɔːrt/","extraExplanation":["这个词不算常用词，更多出现在旅游、城市规划、房地产开发、环境保护等语境里；常见写法是带连字符的 **pre-resort**。","构词上是前缀 **pre-**（“在……之前”）+ **resort**（“度假胜地/度假区”）。用于强调“开发前的自然状态、社区生活或文化面貌”。"]}
{"word":"prerespectability","summary":{"en":"“Prerespectability” means the time or state before becoming socially respectable or accepted, often used in a literary or slightly ironic tone.","zh":"“prerespectability”指在变得社会认可的“体面/可敬”之前的阶段或状态，常见于文学或带一点讽刺的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, period, or condition before someone or something becomes socially respectable or widely accepted","zh":"（某人或某事）在变得“体面/受人尊敬/被社会认可”之前的状态、阶段或处境"},"examples":[{"en":"The novel shows the family’s prerespectability years, when they were still struggling to fit into polite society.","zh":"这部小说描写了这家人在“变得体面”之前的那些年——他们还在努力融入所谓的上流社会。"},{"en":"He wrote about the city’s prerespectability: noisy, chaotic, and full of new money.","zh":"他写到这座城市在“赢得体面名声”之前的面貌：喧闹、混乱，充斥着暴发户。"}]}],"synonyms":["pre-respectable years","before respectability","earlier days","unrespectable period"],"phonetic":"/ˌpriːrɪˌspɛktəˈbɪləti/","extraExplanation":["这是一个非常罕见、带“文风/讽刺意味”的构词：pre-（在……之前）+ respectability（体面；可敬；名声）。多用于文学或评论写作，强调“还没被主流认可、还不够体面”的阶段。","在日常英语里更常见的说法是：before they became respectable / before respectability / pre-respectable years（较口语）。"]}
{"word":"prerespectable","summary":{"en":"A rare/nonstandard adjective meaning ‘before becoming respectable.’","zh":"一个罕见/非标准形容词，意思是“变得体面（受人尊敬）之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) Existing before someone became respectable or socially accepted; earlier than a respectable stage.","zh":"（罕见、非标准用法）指在某人变得“体面/受人尊敬”之前的；处于尚未被社会认可的早期阶段。"},"examples":[{"en":"The biography focuses on his prerespectable years, when he struggled to find steady work.","zh":"这本传记聚焦于他尚未“体面”之前的那些年——那时他还在为稳定工作而挣扎。"},{"en":"She wrote about the city’s prerespectable neighborhoods before they were redeveloped.","zh":"她写到了这座城市在改造前那些尚未变得“体面”的街区。"}]}],"synonyms":["pre-respectable","early","before becoming respectable","former"],"phonetic":"ˌpriːrɪˈspɛktəbəl","extraExplanation":["“prerespectable”不是常见词，更多是一种临时造词（nonce word），由前缀 pre-（在……之前）+ respectable（体面/受人尊敬的）拼出来，用来强调“变得体面之前的阶段”。在正式写作中，更自然的表达通常是：before he became respectable / in his early years / before the neighborhood became respectable。"]}
{"word":"prerespiration","summary":{"en":"A rare biology term meaning the stage/processes before respiration starts.","zh":"一个较少见的生物学用语，指呼吸开始前的阶段/过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare) The stage or processes occurring before respiration begins; pre-respiratory activity.","zh":"（生物学，较少用）呼吸开始之前的阶段或过程；呼吸前活动。"},"examples":[{"en":"In some lab notes, “prerespiration” describes early cellular changes before measurable respiration.","zh":"在一些实验记录中，“prerespiration”用来描述在可测得呼吸作用之前出现的早期细胞变化。"},{"en":"The researchers compared prerespiration signals with later oxygen consumption.","zh":"研究人员将呼吸前信号与后期的氧气消耗进行比较。"}]}],"synonyms":["pre-respiratory stage","before respiration begins","pre-respiratory phase"],"phonetic":"/ˌpriːˌrɛspəˈreɪʃən/","extraExplanation":["“prerespiration”不是现代英语里常见或标准化的术语，更多见于个别论文、实验记录或较旧的资料中，用来做字面意义的描述（pre- = “在……之前” + respiration = “呼吸作用/呼吸”）。","如果你是在生理学/医学语境中想表达“呼吸发生之前”，更常见的写法是“pre-respiratory (stage/phase)”或直接说“before respiration begins”。","也有可能是拼写或分词习惯不同：建议核对原文是否写作“pre-respiration”或“prerespiratory”。"]}
{"word":"prerespire","summary":{"en":"A rare form meaning “to breathe beforehand; take a preparatory breath.”","zh":"一个罕见用法，意思是“预先呼吸/先吸一口气做准备”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare/nonce) To breathe beforehand; to take preparatory breaths before an action (such as speaking, singing, or diving).","zh":"（罕见/临时造词）预先呼吸；在行动（如说话、唱歌、潜水）前先做准备性的吸气/呼吸。"},"examples":[{"en":"She paused to prerespire before starting the long speech.","zh":"她停了一下，先预先吸了口气，再开始那段很长的演讲。"},{"en":"Divers often prerespire slowly to calm their breathing.","zh":"潜水员常常会先慢慢地“预先呼吸”，让呼吸节奏平稳下来。"}]}],"synonyms":["pre-breathe","take a breath beforehand","breathe in first"],"phonetic":"/ˌpriːrɪˈspaɪr/","extraExplanation":["“prerespire”并不是现代英语里常见或规范的词，更像是把前缀 pre-（“在……之前”）加到 respire（“呼吸”）上形成的临时用法。在正式写作中，通常会改用更自然的表达，如 “take a breath (before…)”“breathe in (before…)”“prepreathe / pre-breathe（较专业/少见）”。","如果你是在医学/生理或潜水语境中看到它，也可能是拼写或排版误差；你可以把原句发来，我可以帮你判断更合适的标准用词。"]}
{"word":"preresponsibility","summary":{"en":"An uncommon term meaning a prior obligation or duty that exists before something else.","zh":"不常见用法，指在某事发生之前就已存在的既有责任或义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A responsibility or duty that exists beforehand (before something else happens); a prior obligation. (Uncommon; usually written as “pre-responsibility” or expressed as “prior responsibility.”)","zh":"（不常见）事前责任；在某事发生之前就已存在的责任或义务。通常写作“pre-responsibility”，或用“prior responsibility”等更常见表达。"},"examples":[{"en":"Before I accept the new role, I need to finish my pre-responsibilities at my current job.","zh":"在我接受新职位之前，我需要先完成我在现有工作中的事前责任。"},{"en":"Childcare is a pre-responsibility we must plan for before traveling.","zh":"育儿是我们出行前必须规划好的事前责任。"}]}],"synonyms":["prior responsibility","existing obligation","previous commitment","pre-existing duty"],"phonetic":"/ˌpriːrɪˌspɑːnsəˈbɪləti/","extraExplanation":["“preresponsibility”不是常见英语词形；在正式写作中更建议用更自然的表达，例如：prior responsibility（既有/先前责任）、existing obligations（既有义务）、responsibilities beforehand（事先的责任）。","如果你想强调“在承担新职责之前要先完成的事”，也可以说：I have responsibilities to wrap up before… / I need to fulfill my current obligations first.","写法上更符合英语习惯的是加连字符“pre-responsibility”，因为“pre-”作前缀连接名词时常用连字符以提升可读性（尤其是较少见或较长的组合词）。"]}
{"word":"preresponsible","summary":{"en":"“Preresponsible” is a rare adjective meaning responsible in advance (or, less commonly, previously responsible).","zh":"“preresponsible”是个不常见的形容词，意思是“预先负责的”（或较少见地指“先前负责过的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/uncommon) Responsible in advance; having a duty or obligation before something happens or before a later stage.","zh":"（罕见/不常用）预先负责的；在某事发生之前或在后续阶段之前就承担责任的。"},"examples":[{"en":"In the contract, the supplier is pre-responsible for checking safety standards before delivery.","zh":"在合同中，供应商在交付前对安全标准的检查负有预先责任。"},{"en":"A pre-responsible review helps catch mistakes before the report is published.","zh":"预先负责的审查能在报告发布前发现错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Previously responsible for something (emphasizing an earlier period of responsibility).","zh":"（罕见）先前负责过的（强调早期一段时间的责任）。"},"examples":[{"en":"She was pre-responsible for the budget, but the new manager handles it now.","zh":"她之前负责预算，但现在由新经理负责。"}]}],"synonyms":["responsible beforehand","responsible in advance","previously responsible","accountable in advance"],"phonetic":"/ˌpriːrɪˈspɑnsəbəl/","extraExplanation":["“preresponsible”并不是常见英语词，更多情况下会用更自然的表达来替代，例如：\n- responsible beforehand（事先负责）\n- responsible in advance（提前负责）\n- previously responsible（先前负责）\n如果你是在某篇文章/合同里看到这个词，它可能是作者临时造词（带有“pre- 前置/预先”的构词方式），用来强调责任发生在更早的阶段。"]}
{"word":"prerestoration","summary":{"en":"Prerestoration (usually pre-Restoration) means “before the English Restoration of 1660,” used in history, literature, and art contexts.","zh":"Prerestoration（多写作 pre-Restoration）指“1660年英国王政复辟之前的”，常用于历史、文学与艺术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written pre-Restoration) relating to the time before the English Restoration of the monarchy in 1660.","zh":"（常写作 pre-Restoration）指1660年英国王政复辟（斯图亚特王朝复辟）之前的时期；与该时期有关的。"},"examples":[{"en":"The museum has a small collection of pre-Restoration portraits.","zh":"这家博物馆收藏了一小批王政复辟前时期的肖像画。"},{"en":"Her research focuses on pre-Restoration theater and censorship.","zh":"她的研究聚焦于王政复辟前的戏剧与审查制度。"}]},{"partOfSpeech":"n.","definition":{"en":"the period before the English Restoration (used especially in historical writing).","zh":"英国王政复辟之前的时期（尤用于历史写作中）。"},"examples":[{"en":"The diary offers a vivid look at prerestoration London.","zh":"这本日记生动展现了王政复辟前的伦敦。"}]}],"synonyms":["pre-Restoration","pre-1660","pre-Commonwealth (context-dependent)"],"phonetic":"ˌpriˌrɛstəˈreɪʃən","extraExplanation":["“Restoration（王政复辟）”通常特指1660年查理二世（Charles II）回到英格兰王位，标志着英格兰从共和时期（如克伦威尔时期）转入王权复归。因而“pre-Restoration”常用于英国历史、文学与艺术史语境，尤其谈到17世纪中叶的政治、宗教与文化变化。","拼写上更常见的是加连字符的“pre-Restoration”。写成一个词“prerestoration”较少见，但意思相同。","文学语境中，这个时间段常与清教徒影响、剧院关闭（1642年起）等话题并提；而“Restoration drama/comedies（复辟时期戏剧/喜剧）”则指1660年之后的舞台文化。"]}
{"word":"prerestrain","summary":{"en":"Prerestrain means to limit or control something in advance.","zh":"Prerestrain 指“预先限制或控制”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to restrain or limit in advance; to place controls on something before it happens","zh":"预先约束；事先限制（在事情发生前先加以控制）"},"examples":[{"en":"The new policy is meant to prerestrain risky trading before losses occur.","zh":"这项新政策旨在在亏损发生之前预先约束高风险交易。"},{"en":"Some schools prerestrain internet access during exams to prevent cheating.","zh":"一些学校在考试期间会事先限制网络访问，以防作弊。"}]}],"synonyms":["restrict in advance","restrain beforehand","preemptively restrict","limit beforehand"],"phonetic":"/ˌpriːrɪˈstreɪn/","extraExplanation":["“prerestrain”由前缀 pre-（“在……之前”）+ restrain（“约束、限制”）构成，含义通常可以从词形直接推断。","这个词在日常英语中较少见，更常用的表达是 “restrain beforehand / restrict in advance / preemptively restrict”。在正式写作里偶尔会用作强调“提前控制”。"]}
{"word":"prerestraint","summary":{"en":"“Prerestraint” (more commonly “pre-restraint”) means the time or state before restraint or restrictions are applied.","zh":"“prerestraint”（更常见写法为“pre-restraint”）指在约束或限制措施实施之前的时间或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The period, situation, or condition before a restraint is applied (for example, before someone is physically restrained or before restrictions are imposed).","zh":"（少见）在“约束/限制”被施加之前的时期、情境或状态（如被身体束缚前，或规定/限制实施前）。"},"examples":[{"en":"The nurse recorded the patient’s behavior in the pre-restraint period.","zh":"护士记录了患者在约束措施实施前这段时间的行为。"},{"en":"The report compares stress levels during pre-restraint and post-restraint handling.","zh":"报告比较了实施约束前后处理过程中的压力水平。"}]}],"synonyms":["pre-restraint","before restraint","prior to restraint","pre-restriction period"],"phonetic":"/ˌpriːrɪˈstreɪnt/","extraExplanation":["“prerestraint”不是非常常见或固定的标准拼写；更常见的写法是加连字符的“pre-restraint”。在正式写作中，若指“实施限制之前”，也可用“before restraint”或“prior to restraint”。","如果你想表达法律中的“事前审查/事前禁止出版”等概念，常用术语是“prior restraint”，而不是“pre-restraint”。“prior restraint”有明确的法律含义，尤其在美国语境中常出现在言论与出版自由的讨论里。"]}
{"word":"prerestrict","summary":{"en":"“Prerestrict” means to place limits on something ahead of time.","zh":"“prerestrict”表示“事先/预先对某事加以限制”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to restrict in advance; to set limits on something before it happens or before it is used","zh":"预先限制；事先设定限制（在事情发生或使用之前就先加以约束）"},"examples":[{"en":"The system prerestricts access to adult content for all new accounts.","zh":"系统对所有新账号预先限制访问成人内容。"},{"en":"Some countries prerestrict certain medicines until more safety data is available.","zh":"一些国家在获得更多安全数据之前，会预先限制某些药物。"}]}],"synonyms":["pre-restrict","restrict in advance","limit beforehand","preemptively restrict","impose restrictions beforehand"],"phonetic":"/ˌpriːrɪˈstrɪkt/","extraExplanation":["“prerestrict”较少见，通常写作带连字符的“pre-restrict”，或用更常见的表达：restrict in advance / impose restrictions beforehand。","前缀“pre-”表示“在……之前、预先”。把它加在动词“restrict（限制）”前面，就形成“预先限制”的意思。常见于政策、合规、IT权限设置等语境。"]}
{"word":"prerestriction","summary":{"en":"A pre-restriction is a limitation set in advance, before something happens or starts.","zh":"prerestriction 指“事先设置的限制”，在某事发生或开始之前就规定好的约束。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A restriction or limitation that is applied in advance (before an event, action, or process begins).","zh":"预先施加的限制；事先规定的约束（在某个事件、行动或流程开始之前就设置的限制）。"},"examples":[{"en":"The app requires several pre-restrictions, such as verifying your email before you can post.","zh":"这款应用有几项预先限制，比如必须先验证邮箱才能发帖。"},{"en":"Because of safety pre-restrictions, visitors must sign in and wear a badge.","zh":"由于安全方面的预先限制，访客必须登记并佩戴访客证。"}]}],"synonyms":["pre-restriction","advance restriction","prior restriction","precondition"],"phonetic":"/ˌpriːrɪˈstrɪkʃən/","extraExplanation":["“prerestriction”并不是非常常见的标准词形，更常见的写法是带连字符的“pre-restriction”，或直接说“prior restriction / advance restriction”。在正式写作中，建议用这些更常见的表达以避免读者困惑。","构词上：pre- 表示“在……之前”，restriction 表示“限制”。合起来就是“事先设置的限制”，常见于政策、流程、软件权限、入场规则等语境。"]}
{"word":"preretiree","summary":{"en":"A preretiree is someone nearing retirement and preparing for it.","zh":"preretiree 指临近退休并开始为退休做准备的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is close to retiring from work (often in the last few years before retirement)","zh":"临近退休的人；准退休者（通常指退休前的最后几年）"},"examples":[{"en":"The company offers financial-planning workshops for preretirees.","zh":"公司为准退休员工提供理财规划讲座。"},{"en":"As a preretiree, she started thinking about health insurance and where to live.","zh":"作为准退休者，她开始考虑医保和住在哪里。"}]}],"synonyms":["near-retiree","soon-to-be retiree","pre-retirement worker"],"phonetic":"/ˌpriːrɪˈtaɪɹiː/","extraExplanation":["“preretiree”由前缀 pre-（“在……之前”）+ retiree（“退休者”）构成，常见于人力资源、福利与个人理财语境。","它通常暗示仍在工作但已进入“为退休做准备”的阶段（如规划养老金、医疗保险、生活方式），与已退休的 retiree 区分。"]}
{"word":"preretirement","summary":{"en":"Preretirement refers to the time or stage before retirement, especially for planning money, benefits, and lifestyle.","zh":"preretirement 指退休前的时期或阶段，常用于规划财务、福利与生活方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The period of time shortly before someone retires from work, often used for planning finances, health, and lifestyle changes.","zh":"临近退休的时期（退休前阶段），常用于规划财务、健康和生活方式的改变。"},"examples":[{"en":"Many people increase their savings during the preretirement years.","zh":"很多人在临近退休的几年里会增加储蓄。"},{"en":"She attended a preretirement workshop to learn about Social Security and Medicare.","zh":"她参加了退休前讲座，了解社会保障和医疗保险。"}]},{"partOfSpeech":"n.","definition":{"en":"A phase or stage before retirement, especially in financial or career planning contexts.","zh":"退休前阶段（尤指在财务或职业规划语境中）。"},"examples":[{"en":"The company offers counseling in the preretirement stage.","zh":"公司在退休前阶段提供咨询服务。"},{"en":"Preretirement can be a good time to pay off debt.","zh":"退休前阶段是还清债务的好时机。"}]}],"synonyms":["pre-retirement","before retirement","retirement planning period","late-career"],"phonetic":"/ˌpriːrɪˈtaɪərmənt/","extraExplanation":["在美国职场语境里，preretirement 常出现在福利与人力资源文件中，如“preretirement planning（退休前规划）”“preretirement counseling（退休前咨询）”。通常指退休前的几年到十几年不等，并非固定时长。","构词法：pre-（在……之前）+ retirement（退休）。有时也写作 pre-retirement（带连字符），意思相同；正式写作中两种都常见，按机构风格指南选择即可。"]}
{"word":"prereturn","summary":{"en":"“Prereturn” refers to the period or actions before a return is made, especially in e-commerce/logistics.","zh":"“prereturn”指退货发生之前的阶段或相关操作，常见于电商/物流语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in business, e-commerce, or logistics) happening before an item or customer is returned; related to the steps taken before a return is completed.","zh":"（尤用于商业、电商或物流）发生在退货之前的；与完成退货前的步骤或流程有关。"},"examples":[{"en":"Contact customer support for prereturn instructions before sending the package back.","zh":"在把包裹寄回之前，请先联系客服获取退货前（prereturn）的说明。"},{"en":"The company offers prereturn labels to make returns faster.","zh":"公司提供退货前（prereturn）的预付运单标签，让退货更快捷。"}]},{"partOfSpeech":"v.","definition":{"en":"To take actions in advance of returning something (for example, requesting a label, getting authorization, or preparing paperwork).","zh":"在退货之前采取行动（例如申请退货标签、获取授权或准备材料）。"},"examples":[{"en":"Please prereturn the item by requesting an RMA number online.","zh":"请先在网上申请退货授权编号（RMA），完成退货前准备（prereturn）。"},{"en":"Customers can prereturn through the app and drop the box off later.","zh":"顾客可以通过应用先完成退货前操作（prereturn），之后再把箱子送到投递点。"}]}],"synonyms":["pre-return","before returning","return preparation","return authorization (context-specific)"],"phonetic":"/ˌpriː rɪˈtɝːn/","extraExplanation":["“prereturn”不是非常常见的标准词，更多见于行业文档或系统字段名。写作中常用更自然的表达，如“before returning”“pre-return instructions/steps”“return preparation”。也常写作带连字符的“pre-return”。"]}
{"word":"prereveal","summary":{"en":"“Prereveal” means to reveal something ahead of time, before the main announcement or release.","zh":"“Prereveal”指在正式公布或发布前提前揭露、预告信息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to reveal (something) in advance; to give people information before the main announcement or official release","zh":"提前揭露／预告（某事）；在正式公布或发布前先透露信息"},"examples":[{"en":"The company prerevealed a few features to build excitement before the product launch.","zh":"公司在产品发布前提前透露了一些功能来制造期待。"},{"en":"Try not to prereveal the ending of the movie to your friends.","zh":"尽量不要提前把电影结局剧透给朋友。"}]}],"synonyms":["reveal early","reveal in advance","preannounce","preview","tease","leak"],"phonetic":"/ˌpriːrɪˈviːl/","extraExplanation":["“prereveal”不是最常见的标准词汇，更常见的说法是“reveal in advance / reveal early / preview / tease / preannounce”。但在市场营销、游戏发布、媒体宣传等语境里，人们会用“pre- + reveal”的造词方式来表达“提前揭露/预告”。","构词提示：前缀“pre-”表示“在……之前”，所以“prereveal”字面就是“在之前揭露”。写作时如果想更自然正式，可优先改用“preannounce（预先宣布）”或“tease（放出悬念式预告）”。"]}
{"word":"prerevelation","summary":{"en":"“Prerevelation” (often written “pre-revelation”) means the period or situation before a revealing event or disclosure.","zh":"“prerevelation”（常写作“pre-revelation”）指揭示/披露发生之前的时期或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The time or state before a revelation or major disclosure happens; something occurring prior to a revealing event.","zh":"（罕见/非规范用法）在“揭示/启示/重大披露”发生之前的时间或状态；指揭露事件发生前的阶段或事情。"},"examples":[{"en":"In the prerevelation scenes, the audience senses something is wrong but doesn’t know why.","zh":"在“揭示发生之前”的几幕里，观众感觉不对劲，却不知道原因。"},{"en":"The diary describes her prerevelation life—ordinary days before she learned the secret.","zh":"日记描写了她“得知秘密之前”的生活——在知道真相前的平凡日子。"}]}],"synonyms":["pre-revelation","before the revelation","prior to the revelation","pre-disclosure","before the disclosure"],"phonetic":"/ˌpriːˌrɛvəˈleɪʃən/","extraExplanation":["“prerevelation”不太常见，多见于作者临时造词或学术/宗教语境的扩展用法。更自然、常用的表达通常是：\n- “pre-revelation” （加连字符更符合英语构词习惯）\n- “before the revelation” / “prior to the revelation”（更口语、清晰）\n- 若是宗教语境（如伊斯兰研究），常说 “the pre-revelation period” 指“启示降示前时期”。"]}
{"word":"prerevenge","summary":{"en":"“Prerevenge” means taking revenge in advance (a rare, informal word).","zh":"“prerevenge”指“预先报复/提前复仇”，属于少见的非正式用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) Revenge taken in advance—hurting or punishing someone before they do something to you, because you expect they will.","zh":"（非正式、少见）“预先报复”：在对方还没伤害你之前，因你预期对方会这么做而先下手伤害或惩罚对方。"},"examples":[{"en":"He called it prerevenge: striking first so they couldn’t strike him later.","zh":"他把这叫作“预先报复”：先出手，让他们以后没法对他下手。"},{"en":"Online prerevenge often looks like attacking someone’s reputation before any real conflict happens.","zh":"网络上的“预先报复”常常表现为在真正冲突发生前就先攻击别人的名声。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, rare) To take revenge preemptively; to retaliate before the other person acts.","zh":"（非正式、少见）进行预先报复；在对方行动前就先反击。"},"examples":[{"en":"She tried to prerevenge by spreading rumors first.","zh":"她试图先散布谣言来进行预先报复。"},{"en":"If you prerevenge, you may create the very fight you fear.","zh":"如果你选择预先报复，反而可能制造出你害怕的那场冲突。"}]}],"synonyms":["preemptive revenge","preemptive retaliation","strike first","retaliate preemptively"],"phonetic":"/ˌpriːrɪˈvɛndʒ/","extraExplanation":["“prerevenge”是由前缀 pre-（在……之前）+ revenge（报复）拼出来的非标准新造词，常带有讽刺或批评意味，用来强调“还没发生就先报复”的不合理或不公平。正式写作中更常用的表达是 “preemptive retaliation / preemptive revenge”（先发制人的报复）或 “retaliate preemptively”。"]}
{"word":"prerevenged","summary":{"en":"“Prerevenged” is a rare, nonstandard word meaning “already avenged beforehand” or “preemptively retaliated.”","zh":"“prerevenged”是罕见且偏非标准的用法，表示“提前报复/事先已经报仇（雪耻）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) Having taken revenge in advance; already avenged beforehand.","zh":"（罕见/非标准用法）提前复仇的；事先已经报过仇的。"},"examples":[{"en":"In the story, the prince is described as prerevenged, as if his enemies had already been punished before the war began.","zh":"在故事里，王子被描写成“prerevenged”，仿佛战争开始前敌人就已受到惩罚。"},{"en":"The author uses “pre-revenged” to suggest a kind of preemptive retaliation.","zh":"作者用“pre-revenged”来暗示一种先发制人的报复。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare) Past-tense form used as if it were a verb meaning “to revenge beforehand.”","zh":"（极罕见）被当作动词过去式使用，表示“提前复仇/预先报复”。"},"examples":[{"en":"He prerevenged the insult by spreading rumors first.","zh":"他为了提前报复那次侮辱，先散布了谣言。"}]}],"synonyms":["avenged","preemptively retaliated","retaliated in advance","took revenge beforehand"],"phonetic":"/ˌpriːrɪˈvɛndʒd/","extraExplanation":["“prerevenged”不是常见的标准词汇，更多时候你会看到带连字符的写法“pre-revenged”，或直接用更自然的表达。","更常用的替代说法：\n- “avenged”/“already avenged”（已经报仇/雪耻）\n- “preemptively retaliated”（先发制人地报复）\n- “took revenge in advance”（提前报复）","如果你是在某本书/某段台词里看到它，发我上下文句子，我可以帮你判断作者想表达的是“提前报复”还是“已经雪耻”。"]}
{"word":"prerevenging","summary":{"en":"“Prerevenging” is a rare, informal word meaning taking revenge in advance (preemptive retaliation).","zh":"“prerevenging”是罕见的非正式说法，意思是“提前报复/先发制人的报复”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare, informal, nonstandard) Taking revenge in advance; planning or carrying out retaliation before the other person actually harms you (often imagined or expected harm).","zh":"（罕见、非正式、非标准用法）“提前报复”；在对方尚未真正伤害你之前，就因预期或想象中的伤害而计划或实施报复。"},"examples":[{"en":"He talked about prerevenging, saying he wanted to strike first so they couldn’t hurt him later.","zh":"他谈到“prerevenging（提前报复）”，说他想先下手，这样他们以后就伤不到他了。"},{"en":"The movie shows a character prerevenging a betrayal that hasn’t even happened yet.","zh":"电影里有个角色对一场甚至还没发生的背叛进行“提前报复”。"}]}],"synonyms":["preemptive revenge","preemptive retaliation","strike first","retaliate preemptively"],"phonetic":"/ˌpriːrɪˈvɛndʒɪŋ/","extraExplanation":["“prerevenging”不是常见词，通常被看作把前缀 pre-（提前）+ revenge（报复）临时拼出来的说法（类似网络或口语造词）。正式写作中更自然的表达是：preemptive revenge（先发制人的报复）、retaliate preemptively（先发制人地报复）、strike first（先下手）。","如果你原本想写的是“preventing”（阻止、防止），那是完全不同的词：preventing /prɪˈvɛntɪŋ/。可以告诉我上下文句子，我能帮你确认意思。"]}
{"word":"prereversal","summary":{"en":"Prereversal means “before a reversal,” often describing a phase right before a change in direction or outcome.","zh":"prereversal 指“反转/逆转之前”，常用来描述方向或结果即将改变前的阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often hyphenated: pre-reversal) Happening or existing before a reversal (a change to the opposite direction or decision).","zh":"（常写作 pre-reversal）发生在“逆转/反转”之前的；处于逆转前阶段的。"},"examples":[{"en":"The analyst warned that the market looked pre-reversal after several failed rallies.","zh":"分析师警告说，在多次反弹失败后，市场看起来处于反转前的状态。"},{"en":"Doctors monitored the patient’s pre-reversal symptoms before the condition improved.","zh":"在病情好转（出现逆转）之前，医生监测了患者的反转前症状。"}]},{"partOfSpeech":"n.","definition":{"en":"The period or condition before a reversal happens.","zh":"反转发生之前的阶段或状态；反转前期。"},"examples":[{"en":"Volume often increases during the prereversal.","zh":"在反转前期，成交量常常会上升。"},{"en":"We collected more data in the prereversal to understand what triggered the change.","zh":"我们在反转前期收集了更多数据，以了解是什么触发了变化。"}]}],"synonyms":["pre-reversal","before the reversal","leading up to a reversal","preturning","pre-change"],"phonetic":"/ˌpriːrɪˈvɝːsəl/","extraExplanation":["“prereversal / pre-reversal”不是非常常见的标准词条，更常见的表达是“before the reversal / leading up to the reversal / pre-reversal phase”。在金融交易语境里，它常指趋势可能即将反转之前的迹象（如动能减弱、成交量变化等）。在医学或科学写作里，它也可能指病情、反应或信号（例如某种曲线走势）出现逆转前的阶段。"]}
{"word":"prereverse","summary":{"en":"Prereverse means ‘before reversing’ (mainly technical usage).","zh":"prereverse 指“反向/倒档之前的”（主要用于技术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) happening before a reverse movement, reverse gear, or reversal of direction; preceding a reversal.","zh":"（技术用语）发生在倒退/倒档/反向或方向反转之前的；反转之前的。"},"examples":[{"en":"Check the prereverse checklist before shifting into reverse.","zh":"挂入倒档前先检查“prereverse（倒档前）”清单。"},{"en":"The controller runs a prereverse safety test to prevent sudden direction changes.","zh":"控制器会执行反向前的安全测试，以避免突然变向。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, technical) to prepare for reversing or to set a system to reverse later.","zh":"（少见，技术用语）为反向做准备；把系统预设为稍后反向。"},"examples":[{"en":"The operator prereversed the motor sequence in the control software.","zh":"操作员在控制软件里预设了电机的反向顺序。"}]}],"synonyms":["pre-reverse","pre-reversal","before reversing","prior to reversing"],"phonetic":"ˌpriːrɪˈvɝːs","extraExplanation":["“prereverse”不是日常英语里的常见词，更多见于工程、机械、控制系统等语境。写作中更常用带连字符的形式“pre-reverse”，或改写成更自然的表达：“before reversing / prior to reversing / pre-reversal”。","如果你是在某个产品界面、说明书或论文里看到它，建议结合上下文确认它指的是“倒档前/反向前的步骤（检查、测试、延时）”，还是某种特定功能名称（例如某设备的‘prereverse mode’）。"]}
{"word":"prereversed","summary":{"en":"“Prereversed” means “already reversed beforehand,” often used in technical contexts like code or printing.","zh":"“prereversed”指“事先已经反转/倒序的”，多见于编程、数据处理或印刷等技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Reversed in advance (before another step or process).","zh":"预先反转的；事先倒置的（在后续步骤或流程之前就已经反转）。"},"examples":[{"en":"Use the prereversed list so the program can read items from the end first.","zh":"使用预先反转的列表，这样程序就能先从末尾读取项目。"},{"en":"The image was prereversed before printing, so it appears correct on the transfer.","zh":"图片在打印前已预先反转，因此转印后看起来是正确的。"}]}],"synonyms":["pre-reversed","reversed in advance","already reversed","pre-inverted"],"phonetic":"/ˌpriːrɪˈvɝːst/","extraExplanation":["“prereversed”通常是技术写作里的临时造词（比较少见），由前缀“pre-”（预先）+ “reversed”（反转的）组成。更常见的表达是“reversed in advance”或“pre-reversed”。在编程/数据处理中，预先反转常用于优化：例如先把数组倒序，以便后续循环更简单或更高效。"]}
{"word":"prereversing","summary":{"en":"A rare/technical form meaning “before reversing” or “done prior to reversal.”","zh":"一个较少见、偏技术的表达，意思是“反转之前的/在反转前进行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a common standalone English word. Usually a technical or made-up form meaning “done before reversing” or “before the direction/order is reversed.”","zh":"不是常见的独立英语单词。通常是技术语境或临时造词，意思是“在反转/倒转之前进行的”或“反转发生前的”。"},"examples":[{"en":"In some machine controls, a prereversing step slows the motor before it switches direction.","zh":"在一些机器控制中，会有一个“预反转”步骤：在切换方向前先让电机减速。"},{"en":"The software runs a prereversing check to confirm the list can be safely reversed.","zh":"软件会先做一个“反转前检查”，确认列表可以安全地倒序。"}]},{"partOfSpeech":"v.","definition":{"en":"(As a verb form/gerund in writing) the act of reversing beforehand; used rarely and mainly in specialized writing.","zh":"（作为动名词式写法）指“提前进行反转的行为”；很少见，多出现在专业写作中。"},"examples":[{"en":"Prereversing the tape can reduce tangles when you rewind it later.","zh":"先把磁带倒转一次，之后倒带时可能更不容易打结。"}]}],"synonyms":["pre-reversal","before reversing","pre-switch (direction)","pre-check"],"phonetic":"/ˌpriːrɪˈvɝːsɪŋ/","extraExplanation":["“prereversing”通常由前缀 pre-（“在……之前”）+ reversing 组合而成，更自然、更常见的写法是带连字符的 “pre-reversing”，或直接改写为 “a check before reversing / before reversal”。","如果你是在某个句子或技术文档里看到它，贴出原句我可以帮你判断它具体指哪种“反转”（方向反转、顺序倒序、极性反转等）。"]}
{"word":"prereview","summary":{"en":"A prereview is an initial check done before a full review; it can also mean to do that initial check.","zh":"prereview 指正式评审前的预先审查/初步评估，也可作动词表示进行预审。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an initial check or evaluation done before a main review or formal decision","zh":"（正式评审/决定之前的）预先审查；预评估"},"examples":[{"en":"All applications go through a prereview before the committee meeting.","zh":"所有申请都会在委员会开会前先进行预审。"},{"en":"The editor did a quick prereview to see if the article fit the journal.","zh":"编辑先做了快速预审，看看文章是否符合期刊范围。"}]},{"partOfSpeech":"v.","definition":{"en":"to check or evaluate something briefly before a fuller review","zh":"在正式审查前先行查看/预评估"},"examples":[{"en":"We prereview proposals to remove duplicates and missing documents.","zh":"我们会先预审提案，剔除重复项并补齐缺失文件。"},{"en":"The teacher prereviewed the essays and flagged common grammar mistakes.","zh":"老师先预看了作文，并标出了常见语法错误。"}]}],"synonyms":["preliminary review","initial review","screening","pre-assessment","prescreen"],"phonetic":"/ˌpriːrɪˈvjuː/","extraExplanation":["“prereview”多见于较正式或专业场景（学术期刊投稿、项目申请、药物/伦理审批、法务流程等），强调“正式评审之前的第一道筛查”。日常口语里更常用“quick review / initial review / preliminary review”。","拼写上通常写作一个词“prereview”，也能见到连字符形式“pre-review”。"]}
{"word":"prerevise","summary":{"en":"“Prerevise” means to revise something in advance, before a formal review or final version.","zh":"“prerevise”指在正式审阅或最终定稿前先进行预先修改。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to revise or edit something beforehand, especially before a formal review, submission, or final revision","zh":"在正式审阅、提交或最终修改之前先行修改/预先修订"},"examples":[{"en":"I prerevised my essay before sending it to my teacher for feedback.","zh":"我在把作文发给老师反馈之前，先预先修改了一遍。"},{"en":"The team prerevised the report to remove unclear wording ahead of the meeting.","zh":"团队在会议前预先修订了报告，删掉了不清楚的措辞。"}]}],"synonyms":["pre-revise","revise in advance","pre-edit","edit beforehand"],"phonetic":"ˌpriːrɪˈvaɪz","extraExplanation":["“prerevise”并不是很常见的标准词；写作中更常见的是写成“pre-revise”，或直接用“revise in advance / do an early revision / pre-edit”。在正式文体里，用更常见的表达会更自然。"]}
{"word":"prerevised","summary":{"en":"“Prerevised” means revised ahead of time, before a final review or submission.","zh":"“prerevised”表示在最终审查或提交之前就提前修订过。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"revised in advance (often before submission, publication, or a final review); edited ahead of time","zh":"预先修订的；提前修改过的（常指在提交、出版或最终审查前先编辑）"},"examples":[{"en":"Please upload the prerevised manuscript before the editor’s meeting.","zh":"请在编辑会议前上传预先修订的稿件。"},{"en":"The team shared a prerevised budget draft to save time during the discussion.","zh":"团队分享了一份预先修订的预算草案，以节省讨论时间。"}]}],"synonyms":["pre-revised","pre-edited","revised in advance","preliminary revised","already revised"],"phonetic":"/ˌpriː rɪˈvaɪzd/","extraExplanation":["“prerevised”并不是非常常见的标准词，实际写作中更常见的形式是加连字符的“pre-revised”（尤其在正式出版、学术或编辑语境里），意思相同：先修改好、提前润色过。","构词法：前缀“pre-”（在……之前）+ “revised”（已修订的）。如果你在正式文件里使用，建议写作“pre-revised”以提高可读性。"]}
{"word":"prerevising","summary":{"en":"“Prerevising” means making an early, advance revision before a formal or final revision.","zh":"“prerevising”指在正式或最终修订之前进行提前修改。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"revising something in advance (often before a formal review, submission, or a later, more complete revision)","zh":"提前修改；在正式审阅、提交或下一轮更全面修订之前先行修改"},"examples":[{"en":"I’m prerevising my essay tonight so I can get feedback tomorrow.","zh":"我今晚先把作文提前修改一下，这样明天就能拿去获得反馈。"},{"en":"She spent the weekend prerevising the report before the manager’s review.","zh":"她周末先把报告提前修改了一遍，赶在经理审阅之前。"},{"en":"Prerevising your notes makes the final revision much faster.","zh":"提前修改你的笔记，会让最后的复习修改快很多。"}]}],"synonyms":["pre-editing","making preliminary edits","revising beforehand","early revision"],"phonetic":"/ˌpriːrɪˈvaɪzɪŋ/","extraExplanation":["“prerevising”来自“pre-（预先）+ revise（修改）”。它在日常英语中不算常见，更常见的说法是：“revise it beforehand / do an early revision / make preliminary edits（先做初步修改）”。","学术写作或项目流程里，有时会用“pre-revise / prerevise”来强调“在正式修订周期前的先行修改”，但在一般交流中用更自然的替代表达会更地道。"]}
{"word":"prerevision","summary":{"en":"“Prerevision” means “before revision,” referring to an earlier draft or the state before changes.","zh":"“prerevision”表示“修订前的”，常指修改前的草稿/版本或修改前的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing or happening before a revision; the earlier version before changes are made.","zh":"修订前的；在修改发生之前的；修改前的版本。"},"examples":[{"en":"Please compare the prerevision draft with the revised version.","zh":"请把修订前的草稿和修订后的版本进行对比。"},{"en":"The prerevision text had several grammar mistakes.","zh":"修订前的文本有好几处语法错误。"}]},{"partOfSpeech":"n.","definition":{"en":"The state or version of something before it is revised.","zh":"修订前的状态；修订前的版本。"},"examples":[{"en":"In prerevision, the argument wasn’t very clear.","zh":"在修订前，这个论点不太清楚。"},{"en":"Keep a copy of the prerevision for your records.","zh":"保留一份修订前的版本以备存档。"}]}],"synonyms":["pre-revision","preliminary","earlier draft","unrevised","original"],"phonetic":"/ˌpriːrɪˈvɪʒən/","extraExplanation":["“prerevision”常见于学术写作、编辑与出版语境，意思是“修改之前的（版本/状态）”。更常见的拼写是带连字符的“pre-revision”，尤其在正式写作中；不带连字符也能见到，但可能因风格指南而异。","构词法：前缀“pre-”（在……之前）+ “revision”（修订）。"]}
{"word":"prerevival","summary":{"en":"Prerevival means “before a revival,” often used in historical, religious, or cultural contexts.","zh":"prerevival 指“复兴之前的（时期/状态）”，常用于历史、宗教或文化语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often in religious or cultural history) happening before a revival—before a renewed period of interest, faith, or activity.","zh":"（常用于宗教或文化历史）复兴之前的；在一段信仰/兴趣/活动重新兴起之前发生的。"},"examples":[{"en":"The historian described the prerevival churches as smaller and less organized.","zh":"历史学家把复兴前的教会描述为规模更小、组织性更弱。"},{"en":"They compared prerevival traditions with the practices that emerged during the revival.","zh":"他们把复兴前的传统与复兴时期出现的做法进行了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"The time or conditions before a revival begins.","zh":"复兴开始之前的时期或状态。"},"examples":[{"en":"In the prerevival, attendance was low and many members felt discouraged.","zh":"在复兴前时期，出席人数很少，许多成员感到沮丧。"}]}],"synonyms":["pre-revival","before the revival","pre-awakening (context-specific)"],"phonetic":"/ˌpriːrɪˈvaɪvəl/","extraExplanation":["“prerevival”多见于学术写作或历史叙述，尤其是基督教语境中的“revival（宗教复兴/奋兴）”，如 Great Awakening（大觉醒运动）相关研究。日常英语里更常写作 “pre-revival”（加连字符）以增加可读性。","在建筑与艺术史中也可能出现，如 “pre-revival style”，表示在某种复兴风格（例如 Gothic Revival 哥特复兴）流行之前的阶段。"]}
{"word":"prerevolutionary","summary":{"en":"Before a revolution; relating to the period leading up to a revolution.","zh":"革命前的；与革命爆发前一段时期有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening, existing, or relating to the period just before a revolution (a major political or social change).","zh":"发生在革命之前的；与革命前时期有关的（革命指重大的政治或社会变革）。"},"examples":[{"en":"The novel is set in prerevolutionary France.","zh":"这部小说以革命前的法国为背景。"},{"en":"Prerevolutionary tensions were growing between the government and ordinary people.","zh":"革命前，政府与普通民众之间的紧张关系不断加剧。"}]}],"synonyms":["pre-revolutionary","prewar (in some contexts)","pre-uprising (context-specific)"],"phonetic":"/ˌpriˌrɛvəˈluʃəˌnɛri/","extraExplanation":["“prerevolutionary”由前缀 pre-（“在……之前”）+ revolutionary（“革命的”）构成，常用于历史、政治与文学语境中，用来概括“革命爆发前的社会气氛/矛盾/制度”。","它通常不是指“很久以前”，而是强调“即将发生剧烈变革之前”的阶段，例如“prerevolutionary Russia/China/Iran”等。"]}
{"word":"prerheumatic","summary":{"en":"Prerheumatic means “before rheumatic disease,” especially describing early signs that may come before rheumatic fever.","zh":"prerheumatic 指“风湿性疾病发生之前的”，常用于描述可能先于风湿热出现的早期征象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Happening before rheumatic fever or other rheumatic disease; suggesting an early stage or warning signs of rheumatic illness.","zh":"（医学）风湿病（如风湿热）发生之前的；提示可能处于风湿性疾病早期或前驱期的。"},"examples":[{"en":"The doctor asked about sore throats and joint pain to check for prerheumatic symptoms.","zh":"医生询问是否有咽喉痛和关节痛，以判断是否存在风湿前期症状。"},{"en":"In some cases, a skin rash may appear in a prerheumatic stage.","zh":"在某些情况下，皮疹可能出现在风湿前期。"}]}],"synonyms":["pre-rheumatic","premorbid (less specific)","prodromal (more general)"],"phonetic":"/ˌpriːruˈmætɪk/","extraExplanation":["“prerheumatic”由前缀 pre-（在……之前）+ rheumatic（风湿的）组成，多见于医学语境，日常英语中比较少用。","它常用来描述“可能会发展为风湿热/风湿性疾病”的早期表现（例如链球菌咽炎之后出现的关节痛等），但是否会发展取决于具体检查与诊断。","更常见、更通俗的表达包括：early signs of rheumatic fever（风湿热的早期征象）、before rheumatic disease develops（在风湿性疾病发展之前）。"]}
{"word":"prerich","summary":{"en":"“Prerich” (more commonly “pre-rich”) means “before becoming rich,” used informally to talk about someone’s life before wealth.","zh":"“prerich”（更常写作“pre-rich”）表示“致富之前”，多用于非正式场合，谈论一个人在有钱之前的生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Before becoming rich; describing a time or situation when someone had not yet gained wealth.","zh":"（非正式）致富之前的；形容某人在变有钱之前的时期或处境。"},"examples":[{"en":"She kept her prerich apartment photos to remember where she started.","zh":"她保留了致富前公寓的照片，用来提醒自己从哪里起步。"},{"en":"In his prerich years, he took the bus and worked two jobs.","zh":"在他致富之前的那些年里，他坐公交车、打两份工。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) The period of time before someone became wealthy.","zh":"（非正式）致富之前的一段时间。"},"examples":[{"en":"He talks about his prerich like it was a different life.","zh":"他谈起自己致富前的生活时，仿佛那是另一种人生。"},{"en":"They met in the prerich, long before fame and money.","zh":"他们在致富之前就认识了，那时还没有名气和金钱。"}]}],"synonyms":["pre-rich","before becoming rich","in the early days","pre-fame (related)"],"phonetic":"/ˌpriˈrɪtʃ/","extraExplanation":["“prerich”更常见的写法是带连字符的“pre-rich”。它不是标准词典里的常用词，更像是口语/网络用语，用来幽默或带点自嘲地强调“那时候我还没钱/还没成功”。","在正式写作里，更自然的表达有：“before he became rich / before she made it / in his early days / in her pre-fame years”。"]}
{"word":"prerighteous","summary":{"en":"A rare, informal adjective meaning “self-righteous in advance.”","zh":"一个少见的非正式形容词，意思是“还没了解情况就先自以为正义”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Acting or speaking as if you are already morally right or virtuous—often in a smug or judgmental way; like being “righteous in advance.”","zh":"（非标准/少见）表现得好像自己先天就道德正确、很有“正义感”，常带自满或评判他人的语气；有点像“先把自己摆在正确的一方”。"},"examples":[{"en":"His prerighteous comments made the discussion feel like a lecture.","zh":"他那种“先入为主的正义感”评论，让讨论听起来像在上课。"},{"en":"Try not to sound prerighteous—ask questions before judging.","zh":"尽量别用那种“我已经站在道德高地”的口吻——先提问再判断。"}]}],"synonyms":["self-righteous","sanctimonious","holier-than-thou","smug","priggish"],"phonetic":"/ˌpriˈraɪtʃəs/","extraExplanation":["“prerighteous”不是常见标准词，更像是把前缀 pre-（“提前、预先”）加到 righteous（“正义的、道德上正确的”）上形成的玩笑式/自创词，用来讽刺某人还没了解情况就先摆出道德评判的姿态。","在日常表达里，更自然的说法通常是 self-righteous（自以为正义/道貌岸然）、sanctimonious（假装虔诚道德）、holier-than-thou（自命清高）等。"]}
{"word":"prerighteously","summary":{"en":"“Prerighteously” is a very rare/nonstandard adverb meaning “to act or judge as righteous in advance.”","zh":"“prerighteously”是非常少见/非标准的副词，表示“提前以正义/道德正确的姿态行事或评判”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard/very rare) In a “righteous” or morally correct way beforehand; as if acting righteous in advance.","zh":"（非标准/极少见）以“正义的、道德正确的”方式在事前（提前）行事；带有“先把自己摆在正义一方”的意味。"},"examples":[{"en":"He spoke prerighteously, as if he had already decided what the moral answer must be.","zh":"他说话带着prerighteously的味道，仿佛早就认定了道德上的“正确答案”。"},{"en":"Try not to judge prerighteously before you hear the whole story.","zh":"在听完整个故事之前，尽量别先入为主地“预设自己是正义的”去评判。"}]}],"synonyms":["righteously","self-righteously","judgmentally","morally"],"phonetic":"ˌpriˈraɪtʃəsli","extraExplanation":["“prerighteously”并不是常见的标准英语拼写/用词，读者更可能想表达的是：\n- **righteously**（正当地/正义地）\n- **self-righteously**（自以为正义地、道貌岸然地，常带贬义）\n如果你看到它出现在小说、社媒或口语化写作中，多半是作者为了强调“**pre-（提前）+ righteously（正义地）**”的效果而临时造词。正式写作中建议改用上面更常见的词。"]}
{"word":"prerighteousness","summary":{"en":"Prerighteousness is a rare term meaning “rightness or moral superiority claimed in advance,” often used critically.","zh":"Prerighteousness 是个不常见的词，指“在事情未明前就宣称自己正确/道德上占优”，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonce) The supposed state of being righteous or morally correct *before* a key event, decision, or test—“rightness in advance.”","zh":"（罕见/临时造词）指在关键事件、决定或考验发生之前就被认为“正确/正义”的状态，即“预先的正当性/正义性”。"},"examples":[{"en":"Some leaders claim a kind of prerighteousness, insisting they were right before any evidence appeared.","zh":"有些领导人宣称一种“prerighteousness（预先正义）”，坚持在任何证据出现之前他们就已经是对的。"},{"en":"The speech suggested prerighteousness: the decision was framed as morally perfect from the start.","zh":"那场演讲暗示了一种“预先正义”：这个决定从一开始就被包装成道德上无可挑剔。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often critical or humorous) A premature show of moral superiority—acting “holier-than-thou” before the full story is known.","zh":"（常带批评或调侃）在真相未明前就摆出道德优越感的姿态，提前“站在道德高地”。"},"examples":[{"en":"Before you post online, check the facts—prerighteousness can backfire.","zh":"在你发到网上之前先核实事实——“预先道德优越”很容易翻车。"},{"en":"Her prerighteousness disappeared when new details came out.","zh":"当新细节曝光后，她那种“预先正义感”就消失了。"}]}],"synonyms":["self-righteousness","moral superiority","holier-than-thou attitude","moral grandstanding","premature judgment"],"phonetic":"ˌpriˈraɪtʃəsnəs","extraExplanation":["这个词在英语里并不常见，更多像是临时造词（nonce word）。它由前缀 pre-（“在……之前”）+ righteous（“正义的/道德正确的”）+ -ness（名词后缀）组成，用来表达“还没发生/还没弄清楚就先宣布自己道德正确”。","如果你想表达更常见、更自然的意思，通常会用 self-righteousness（自以为义/道德优越感）或 moral grandstanding（道德作秀）。"]}
{"word":"prerinse","summary":{"en":"Prerinse means to rinse something briefly before the main washing, especially dishes before a dishwasher cycle.","zh":"Prerinse 指在正式清洗前先快速冲洗一下，尤指把餐具放进洗碗机前的预冲洗。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rinse something briefly before the main wash (especially dishes before using a dishwasher).","zh":"（在主要清洗前）先把东西快速冲洗一下；（尤指）把餐具放进洗碗机前先预冲洗。"},"examples":[{"en":"Do we need to prerinse the plates before putting them in the dishwasher?","zh":"把盘子放进洗碗机之前需要先预冲洗吗？"},{"en":"I prerinse the bowls to remove rice and sauce.","zh":"我会先把碗预冲洗一下，把米粒和酱汁冲掉。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick rinse done before the main wash cycle.","zh":"预冲洗；主要清洗前的快速冲洗步骤。"},"examples":[{"en":"This dishwasher has a prerinse cycle for heavily soiled dishes.","zh":"这台洗碗机有“预冲洗”程序，适合特别脏的餐具。"}]}],"synonyms":["rinse off","prewash","pre-rinse"],"phonetic":"/ˌpriːˈrɪns/","extraExplanation":["这个词常见于洗碗机说明书或家务场景。很多现代洗碗机并不建议把餐具“洗得太干净”再放进去，只需要刮掉大块残渣即可；是否需要 prerinse 通常取决于机器型号、洗涤剂和污渍程度。"]}
{"word":"preriot","summary":{"en":"A patriot is a person who strongly supports and defends their country.","zh":"patriot 指“爱国者”，即强烈支持并愿意保卫国家的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who loves their country and is willing to support or defend it.","zh":"爱国者；热爱并愿意支持或保卫自己国家的人。"},"examples":[{"en":"Many patriots volunteered to help during the war.","zh":"许多爱国者在战争期间自愿去帮忙。"},{"en":"She is a patriot, but she also believes in criticizing the government when it is wrong.","zh":"她很爱国，但也相信政府做错时应当批评。"}]}],"synonyms":["nationalist","defender","loyalist"],"phonetic":"/ˈpeɪtriət/","extraExplanation":["“preriot” 不是常见英语单词，最可能是拼写错误，通常想写的是 **patriot**。","词源上，**patriot** 来自希腊语/拉丁语词根，和“祖国、同胞”有关，后来在英语里发展为“爱国者”。","使用提醒：在一些语境中，**patriot** 可能带有强烈政治情绪；中性表达“爱国”也可用 **love for one’s country** 或 **national pride**。"]}
{"word":"prerock","summary":{"en":"Prerock means “before rock”: music or styles from the era and roots that led to rock and roll.","zh":"Prerock意为“摇滚之前”：指孕育并影响摇滚乐的早期时期与根源风格/音乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(music) Relating to the time or styles that came before rock music became widely recognized (roughly before the mid-1950s), often referring to roots like blues, rhythm and blues, country, gospel, and swing.","zh":"（音乐）指摇滚乐广泛成形之前的时期或风格（大致为20世纪50年代中期之前），常指其根源风格，如布鲁斯、节奏布鲁斯、乡村、福音与摇摆乐等。"},"examples":[{"en":"This playlist focuses on prerock sounds that influenced early rock and roll.","zh":"这个歌单主打“prerock（前摇滚）”的声音，它们影响了早期摇滚乐。"},{"en":"Some critics call him a prerock artist because his hits came before rock was named as a genre.","zh":"一些乐评人称他为“prerock（前摇滚）”艺人，因为他的热门歌曲在“摇滚”作为一种流派被命名之前就出现了。"}]},{"partOfSpeech":"n.","definition":{"en":"Music from the pre-rock era; recordings and styles that directly led into rock and roll.","zh":"前摇滚时期的音乐；直接孕育并导向摇滚乐的录音与风格。"},"examples":[{"en":"I’ve been listening to prerock all week—lots of jump blues and early R&B.","zh":"我这周一直在听prerock——很多跳跃布鲁斯和早期节奏布鲁斯。"},{"en":"The documentary traces prerock to rock through a series of famous guitar riffs.","zh":"这部纪录片用一系列著名的吉他乐句，梳理了从prerock到摇滚的发展。"}]}],"synonyms":["pre-rock","pre–rock and roll","early roots music","proto-rock (related)"],"phonetic":"/ˌpriˈrɑk/","extraExplanation":["“prerock”更常见的写法是“pre-rock”，通常用于音乐评论、乐史文章或歌单分类中，并不是一个非常固定的“标准词”。","语境上它强调“摇滚之前的根源”，常会提到：blues（布鲁斯）、R&B（节奏布鲁斯）、country（乡村乐）、gospel（福音音乐）、boogie-woogie、swing 等。","如果你在标题里看到“prerock”，通常是在做时间或风格划分：把“早期影响摇滚的音乐”打包成一类，方便讨论其演变。"]}
{"word":"prerogatival","summary":{"en":"“Prerogatival” means relating to a special right or privileged power (a prerogative), often in legal or constitutional contexts.","zh":"“prerogatival”表示与某种特权/专属权力（prerogative）有关，常用于法律或宪政语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a prerogative (a special right or privilege, especially one held by an official, ruler, or institution).","zh":"与“特权/专属权利（prerogative）”有关的；（尤指）与官方、君主或机构所享有的特权相关的。"},"examples":[{"en":"The constitution limits certain prerogatival powers of the executive.","zh":"宪法限制了行政机关的某些特权性权力。"},{"en":"They debated whether the monarch’s prerogatival authority could be used in this case.","zh":"他们讨论君主的特权性权威是否能用于此案。"}]}],"synonyms":["privileged","special-rights-related","prerogative-related"],"phonetic":"/prɪˈrɑɡətɪvəl/","extraExplanation":["“prerogatival”多见于法律、宪政与政治学语境，常和 power/authority/rights 等词搭配，意思接近“基于（或属于）特权的”。在英国法语境中常见“royal prerogative（王室特权）”，因此也会看到“prerogatival powers（特权性权力）”来指不经议会立法、传统上由王室/政府行使的一类权力（现代往往受法律与惯例约束）。","词形上：prerogative（名词）→ prerogatival（形容词）。日常英语更常用的表达是 “special privileges/rights” 或直接用 “prerogative” 作名词。"]}
{"word":"prerogative","summary":{"en":"Prerogative means a special right or authority, especially one tied to a role or status; it can also mean someone’s personal right to choose.","zh":"Prerogative 指（与身份/职位相关的）特权或职权；也可指个人自行选择或决定的权利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A special right or power that belongs to a particular person, group, or position (often because of status, rank, or role).","zh":"（因身份、地位或职责而拥有的）特权；专属权力。"},"examples":[{"en":"It’s the manager’s prerogative to approve vacation requests.","zh":"批准休假申请是经理的职权。"},{"en":"As a parent, she felt it was her prerogative to set the rules at home.","zh":"作为家长，她觉得制定家规是她的权利。"},{"en":"In some countries, the president has the prerogative to pardon prisoners.","zh":"在一些国家，总统有赦免囚犯的特权。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal freedom to choose or decide something for yourself (sometimes implying “I have the right to do it”).","zh":"（个人）自行选择/决定的权利（常带“我有权这样做”的意味）。"},"examples":[{"en":"You can disagree—it’s your prerogative.","zh":"你可以不同意——那是你的权利。"},{"en":"It’s your prerogative to change your mind.","zh":"改变主意是你的自由/权利。"}]}],"synonyms":["right","privilege","authority","entitlement","power"],"phonetic":"/prɪˈrɑɡətɪv/","extraExplanation":["“prerogative”常用于较正式的语境（职场、法律、政治）。日常口语里也能用，但语气会显得更“强硬/正式”，有时带一点“我有权这么做，不用解释”的感觉。","词源上来自拉丁语，含义与“优先（pre-）提出/要求（-rogative）”相关，历史上常指君主或政府机构的“特权/特权性权力”（如“royal prerogative”王室特权）。"]}
{"word":"prerogatived","summary":{"en":"A prerogative is a special right or privilege, often linked to someone’s role or authority.","zh":"prerogative 指因职位或身份而拥有的特权或专属权利（常见于较正式语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special right, power, or privilege that belongs to a particular person or group (often because of their position)","zh":"（因身份或职位而拥有的）特权；专属权利；（尤指）特有的权力"},"examples":[{"en":"It’s the manager’s prerogative to approve vacations.","zh":"批准休假的权力是经理的特权。"},{"en":"As a customer, you have the prerogative to ask for a refund within 30 days.","zh":"作为顾客，你有权在30天内要求退款。"},{"en":"She claimed the prerogative to make the final decision.","zh":"她声称自己有权做最终决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"belonging to or connected with a particular person or group as a special right (often used in formal contexts)","zh":"（正式用法）特有的；专属的（与某人/某群体的特权相关）"},"examples":[{"en":"This issue falls under the president’s prerogative powers.","zh":"这个问题属于总统的特权范围。"},{"en":"Certain responsibilities are prerogative to the office.","zh":"某些职责是该职位所特有的。"}]}],"synonyms":["privilege","right","entitlement","authority","power"],"phonetic":"/prɪˈrɑːɡətɪv/","extraExplanation":["你输入的“prerogatived”看起来像拼写错误。常见正确拼写是 **prerogative**（名词/形容词）。","在英国政治与法律语境中常见 **royal prerogative**，指君主或政府在某些领域的传统特权（常用于较正式的新闻或学术写作）。"]}
{"word":"prerogatively","summary":{"en":"“Prerogatively” means “by special right or official authority.”","zh":"“Prerogatively”表示“凭借（制度或职位赋予的）特权/专属权限”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"By virtue of an exclusive right, privilege, or authority (often official or legal).","zh":"凭借（某种）专属权利、特权或权威（常见于官方或法律语境）。"},"examples":[{"en":"The president may prerogatively veto a bill under certain conditions.","zh":"在特定条件下，总统可凭其特权否决法案。"},{"en":"Some decisions are prerogatively reserved for the board, not individual managers.","zh":"有些决定是董事会的专属权限，而非个别经理可以决定。"}]}],"synonyms":["by right","rightfully","authoritatively","as a prerogative","within one’s authority"],"phonetic":"/prɪˈrɑːɡətɪvli/","extraExplanation":["“prerogatively”是较少见的副词形式，常用于法律、政治或公司治理的正式写作中；日常英语更常说“as a prerogative”或“by right/within one’s authority”。","词根来自拉丁语前缀prae-（在前）+ rogare（询问/提出要求），历史上与“君主/政府的特权（royal prerogative）”相关；因此它常带有“制度赋予的权限”而不只是个人偏好的感觉。"]}
{"word":"prerogatives","summary":{"en":"“Prerogatives” means special rights or powers, especially those linked to an official role; it can also refer to legal/government powers (often royal or executive).","zh":"“Prerogatives”指（多为与职位或身份相关的）特权、专有权或职权；也可指法律/政治语境中的政府或王室等专属权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special right, power, or privilege (often official or tied to a role)","zh":"（常指与职位或身份相关的）特权；专有权；特殊权力"},"examples":[{"en":"As manager, it’s her prerogative to approve the final budget.","zh":"作为经理，批准最终预算是她的职权范围。"},{"en":"In some cultures, it is the parents’ prerogative to make major family decisions.","zh":"在一些文化中，做重大家庭决定被视为父母的权利。"},{"en":"It’s your prerogative to say no, but please be clear about your reasons.","zh":"你有权说“不”，但请把理由说明白。"}]},{"partOfSpeech":"n.","definition":{"en":"(law/government, often plural) rights or powers that belong specifically to a ruler, government, or office","zh":"（法律/政治，常用复数）君主/政府/公职所特有的权力；（王室/官方）特权"},"examples":[{"en":"The constitution limits the executive’s prerogatives.","zh":"宪法限制行政部门的特权权力。"},{"en":"Historically, royal prerogatives allowed the monarch to act without Parliament in certain areas.","zh":"历史上，王室特权使君主在某些领域无需议会就能采取行动。"}]}],"synonyms":["rights","privileges","powers","authority","entitlement"],"phonetic":"prɪˈrɑɡətɪvz","extraExplanation":["“prerogative”常用于较正式的语境，强调“这是某个角色/职位本来就拥有的权力或选择权”。口语里也常用在句型：It’s (someone’s) prerogative to do sth.（某人有权做某事）。","词源来自拉丁语 prae-（在前）+ rogare（询问/提议），原意与“先被询问、先提出”有关，后来引申为“优先权/特权”。在英国历史与法律语境中，royal prerogative（王室特权）是常见搭配。"]}
{"word":"prerogativity","summary":{"en":"Prerogative means a special right or power (often linked to a role), or the freedom to choose for yourself.","zh":"Prerogative 指（与身份/职位相关的）特权或特有权力，也可指个人自行决定的选择权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A special right, power, or privilege that belongs to a particular person, group, or position (often official or legal).","zh":"（常指官方或法律上的）特权；特权范围内的权力；（某职位/身份固有的）特有权利。"},"examples":[{"en":"It’s the manager’s prerogative to approve the final schedule.","zh":"批准最终排班表是经理的特权（职责范围内的权力）。"},{"en":"As a citizen, voting is both a right and a prerogative.","zh":"作为公民，投票既是一项权利，也是一种特权。"}]},{"partOfSpeech":"n.","definition":{"en":"A choice that someone is free to make, even if others disagree.","zh":"（即使他人不同意也）由某人自行决定的选择权；自主决定权。"},"examples":[{"en":"It’s your prerogative to change your mind.","zh":"改变主意是你的自由（你的决定权）。"},{"en":"If she wants to leave early, that’s her prerogative.","zh":"如果她想早走，那是她的选择权（她自己决定）。"}]}],"synonyms":["privilege","right","authority","power","entitlement","choice"],"phonetic":"/prɪˈrɑɡətɪv/","extraExplanation":["你输入的 **prerogativity** 通常被认为是拼写错误；标准拼写是 **prerogative**。","词源上来自拉丁语，核心含义是“事先（pre-）要求/主张（rogare）而得到的权利”，因此常和“职位自带的权力、法定权限”相关。正式语境中常见搭配：**exercise one’s prerogative**（行使特权/决定权）、**royal prerogative**（君主特权）、**executive prerogative**（行政/总统特权）。"]}
{"word":"prerolandic","summary":{"en":"Prerolandic means “in front of the central sulcus (Rolandic fissure)” in the brain.","zh":"Prerolandic 指“大脑中央沟（罗兰裂）前方的（中央沟前）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, neurology) Located in front of the Rolandic fissure (the central sulcus) in the brain; precentral.","zh":"（解剖学/神经学）位于罗兰裂（中央沟）前方的；中央沟前的（即中央前回区域相关）。"},"examples":[{"en":"Damage to the prerolandic cortex can affect voluntary movement.","zh":"中央沟前（prerolandic）皮层受损会影响随意运动。"},{"en":"The tumor is in a prerolandic location, close to the primary motor area.","zh":"肿瘤位于中央沟前的区域，靠近初级运动区。"},{"en":"Surgeons plan carefully when operating near prerolandic structures.","zh":"在靠近中央沟前结构的区域手术时，外科医生会谨慎规划。"}]}],"synonyms":["precentral","anterior to the central sulcus"],"phonetic":"/ˌpriːroʊˈlændɪk/","extraExplanation":["“Rolandic”来自“罗兰裂/罗兰沟（Rolandic fissure）”，也就是常说的“中央沟（central sulcus）”。因此“pre- + Rolandic”字面意思就是“在中央沟之前/前方”。","在临床与影像报告中，它常用来描述位置（例如病灶在中央沟前），因为中央沟附近与运动、感觉功能密切相关，手术与评估时会特别注意。","这个词较偏医学专业用语；普通英语里更常见的说法是“precentral（中央前回的）”或“anterior to the central sulcus（在中央沟前方）”。"]}
{"word":"preromantic","summary":{"en":"Preromantic describes art or literature that comes before Romanticism and already shows early Romantic themes like emotion, nature, and imagination.","zh":"Preromantic 指浪漫主义之前的艺术或文学，已体现情感、自然与想象等早期浪漫主义特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to artistic and literary ideas that came just before Romanticism, showing early Romantic themes such as strong emotion, imagination, nature, and interest in the past.","zh":"（艺术、文学）指浪漫主义之前的思潮或风格，常呈现早期浪漫主义特征，如强烈情感、想象力、自然崇尚与对历史/中世纪的兴趣。"},"examples":[{"en":"The poet’s preromantic style focuses on wild landscapes and deep personal feelings.","zh":"这位诗人的前浪漫主义风格聚焦于荒野景观与深沉的个人情感。"},{"en":"Some critics call the novel preromantic because it values emotion over reason.","zh":"一些评论家称这部小说为前浪漫主义，因为它更重情感而非理性。"}]}],"synonyms":["pre-Romantic","early Romantic","proto-Romantic"],"phonetic":"/ˌpriːroʊˈmæntɪk/","extraExplanation":["“Preromantic / pre-Romantic”多用于文学史与艺术史语境，常指18世纪中后期到19世纪初的一些作品与潮流，为浪漫主义（Romanticism）铺路。","常见关联关键词：the Sublime（崇高：面对宏大自然时的敬畏与震撼）、Gothic（哥特：阴森、神秘的美学）、sensibility（感伤主义：强调细腻情感与同情心）。","拼写上既可写作preromantic也可写作pre-Romantic（更常见于学术写作，且常大写R以强调“Romanticism”这一历史时期/流派）。"]}
{"word":"preromanticism","summary":{"en":"Pre-Romanticism: an 18th‑century movement that emphasized emotion and nature, paving the way for Romanticism.","zh":"前浪漫主义：18世纪强调情感与自然、并引向浪漫主义的思潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early literary and artistic movement (mainly in 18th‑century Europe) that reacted against strict classical rules and emphasized emotion, nature, imagination, and individual feeling—helping lead to Romanticism.","zh":"前浪漫主义：18世纪欧洲早期的文学与艺术思潮，反对古典主义的严格规范，强调情感、自然、想象与个人感受，并为“浪漫主义”铺路。"},"examples":[{"en":"Pre-Romanticism in poetry often highlights intense personal emotion and the beauty of wild landscapes.","zh":"前浪漫主义诗歌常强调强烈的个人情感与荒野景观之美。"},{"en":"Many scholars see Pre-Romanticism as a bridge between the Enlightenment and Romanticism.","zh":"许多学者认为前浪漫主义是启蒙运动与浪漫主义之间的桥梁。"}]}],"synonyms":["pre-Romantic movement","early Romantic tendencies"],"phonetic":"/ˌpriːroʊˈmæntɪsɪzəm/","extraExplanation":["“前浪漫主义”常与18世纪中后期的感伤主义（sentimentalism）、“崇高”（the sublime）、对民间传统与中世纪题材的兴趣联系在一起。","在英语文学语境中，常提到“墓园派诗歌”（Graveyard poetry）以及托马斯·格雷（Thomas Gray）的《乡村教堂墓地挽歌》（Elegy Written in a Country Churchyard）等作品，体现对死亡、自然与内心情感的关注。","拼写上常见两种：pre-Romanticism（更常见，带连字符）与 preromanticism（较少见）。在学术写作中建议使用前者以提高可读性。"]}
{"word":"preroute","summary":{"en":"Preroute means to route or plan routing in advance; in networking it can refer to the pre-routing stage before routing decisions.","zh":"Preroute 指“提前规划/指定路线”；在网络中也可指“路由判断之前的预路由阶段”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to plan or assign a route for something before it starts moving (e.g., shipments, calls, data)","zh":"在开始移动/传输之前，提前为某物规划或指定路线（如货物、电话、数据）"},"examples":[{"en":"The company preroutes packages to avoid bad weather and delays.","zh":"公司会提前为包裹规划路线，以避开恶劣天气和延误。"},{"en":"Our system preroutes customer calls to the right support team.","zh":"我们的系统会把客户来电预先分配到合适的客服团队。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/networking) a stage where packets can be processed before routing decisions are made","zh":"（计算机/网络）在做出路由决定之前，对数据包进行处理的阶段"},"examples":[{"en":"In Linux firewall rules, PREROUTING happens before the packet is routed.","zh":"在 Linux 防火墙规则中，PREROUTING 发生在数据包被路由之前。"},{"en":"We applied a NAT rule in the preroute step to redirect traffic.","zh":"我们在 preroute（预路由）阶段应用了 NAT 规则来重定向流量。"}]}],"synonyms":["pre-route","preplan","route in advance","preassign","preprocess (traffic)"],"phonetic":"/ˌpriːˈruːt/","extraExplanation":["“preroute”在日常英语里不算常见词，更常见的写法是“pre-route”（加连字符），意思是“提前安排路线/分流”。","在网络语境中，你可能会看到大写的“PREROUTING”，这是 Linux 的 netfilter/iptables 里的一个链（chain）名称，表示“在路由判断之前”处理数据包的阶段。"]}
{"word":"prerouted","summary":{"en":"“Prerouted” means routed or directed in advance according to a plan, commonly used in logistics, telecom, and networking.","zh":"“prerouted”指按计划提前完成路由/转接/分配，常用于物流、电信与网络等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in logistics, telecom, or networking) routed in advance to a planned destination or path.","zh":"（尤用于物流、电信或网络）预先按计划把……路由/分配到某个目的地或路径的。"},"examples":[{"en":"The shipment was prerouted through the regional hub to avoid delays.","zh":"货物被预先安排经由区域枢纽转运，以避免延误。"},{"en":"Calls from this number are prerouted to customer support.","zh":"来自这个号码的电话会被预先转接到客服。"},{"en":"The traffic was prerouted to a backup server during maintenance.","zh":"维护期间，流量被预先导向备用服务器。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “preroute”: to plan and set a route for something ahead of time.","zh":"“preroute”的过去式/过去分词：提前规划并设定某物的路线或转接路径。"},"examples":[{"en":"We prerouted all deliveries before the holiday weekend.","zh":"假期周末前我们把所有配送路线都预先规划好了。"},{"en":"The system prerouted emergency alerts to multiple channels.","zh":"系统把紧急警报预先分发到多个渠道。"}]}],"synonyms":["preassigned","preplanned","prearranged","already routed","preconfigured"],"phonetic":"ˌpriˈraʊtɪd","extraExplanation":["“prerouted”多见于专业语境（如呼叫中心转接、网络流量调度、物流分拣）。日常英语里更常说“already routed / pre-assigned / pre-planned route”。","构词：pre-（提前）+ route（路线/路由）。在 IT 里 route 常译为“路由”，在物流/交通里常译为“路线/转运路径”。"]}
{"word":"preroutine","summary":{"en":"A regular set of steps done before the main routine or activity; sometimes used in computing for a preparatory subroutine.","zh":"指在主要日常或活动开始前固定进行的一套步骤；在计算机语境中也可指主程序前的准备性子程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of regular actions you do before your main routine or activity (a “before-the-main-thing” routine)","zh":"在主要日常/活动开始之前固定会做的一套步骤（“正式开始前的流程”）"},"examples":[{"en":"My preroutine before studying is to make tea and silence my phone.","zh":"我学习前的 preroutine 是泡茶并把手机调成静音。"},{"en":"The team’s preroutine includes stretching and a short warm-up.","zh":"球队的 preroutine 包括拉伸和简短热身。"},{"en":"A simple preroutine can help you get focused faster.","zh":"一个简单的 preroutine 可以帮助你更快进入专注状态。"}]},{"partOfSpeech":"n.","definition":{"en":"in computing, a preparatory subroutine or step that runs before the main routine (often written as “pre-routine” or described as a “setup” step)","zh":"（计算机）主程序/主例程运行前执行的准备性子程序或步骤（常写作 pre-routine，也常称 setup 步骤）"},"examples":[{"en":"Run the preroutine to load the configuration before starting the main process.","zh":"启动主流程前先运行 preroutine 来加载配置。"},{"en":"The preroutine checks permissions and creates needed folders.","zh":"preroutine 会检查权限并创建所需文件夹。"}]}],"synonyms":["pre-routine","warm-up routine","pre-game routine","setup routine","preparatory routine"],"phonetic":"/ˌpriːruːˈtiːn/","extraExplanation":["“preroutine”不是特别常见的标准拼写，更常见的是写成“pre-routine”（带连字符）或直接说“pre-game routine / warm-up routine / setup routine”。","在运动或表演语境里，它通常强调“帮助进入状态”的固定动作；在编程语境里，更接近“初始化/准备步骤（setup/initialization）”。"]}
{"word":"prerouting","summary":{"en":"Prerouting is the networking step (or related adjective) for handling incoming packets before a routing decision is made.","zh":"Prerouting 指网络中“在作出路由决定前处理入站数据包”的阶段（也可作形容词表示“路由前的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, networking) The step where a device or system processes incoming packets before it decides how to route (forward) them.","zh":"（计算机/网络）“预路由”：系统在决定数据包如何转发（路由）之前，对进入的数据包进行处理的阶段。"},"examples":[{"en":"In Linux netfilter, PREROUTING happens before the kernel chooses the outgoing interface.","zh":"在 Linux 的 netfilter 中，PREROUTING 发生在内核选择输出网卡之前。"},{"en":"We added a prerouting rule to rewrite the destination address of incoming traffic.","zh":"我们添加了一条预路由规则，用来改写入站流量的目标地址。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring before routing; related to the stage before a routing decision is made.","zh":"发生在路由之前的；与“作出路由决定之前的阶段”有关的。"},"examples":[{"en":"The firewall applies prerouting checks to inbound packets.","zh":"防火墙会对入站数据包做预路由检查。"},{"en":"Prerouting NAT can change where a request is sent.","zh":"预路由阶段的 NAT 可以改变请求被发送到哪里。"}]}],"synonyms":["pre-routing","pre-route processing","pre-forwarding (context-dependent)"],"phonetic":"/priˈraʊtɪŋ/","extraExplanation":["“prerouting”多见于 Linux 防火墙/路由配置语境，尤其是 iptables/nftables 的链名 PREROUTING。它属于 netfilter 的数据包处理流程之一：数据包刚进入主机、还没决定走哪条路（哪个接口/路由）时，就可以在这里做匹配与改写。","常见搭配：PREROUTING chain（预路由链）、prerouting rule（预路由规则）、DNAT in PREROUTING（在预路由阶段做目的地址转换）。学习时可把它理解为“先处理、后选路”。"]}
{"word":"preroyal","summary":{"en":"Preroyal (rare) means “before someone becomes royal” or “before a royal/monarchical period.”","zh":"Preroyal（少见）指“成为王室成员之前的”，或“王室/君主制时期开始之前的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or existing before someone becomes royal, or before a monarchy/royal period begins.","zh":"（少见）发生在某人成为王室成员之前的；或指王朝/王室时期开始之前的。"},"examples":[{"en":"The biography focuses on the leader’s preroyal years, before he was crowned.","zh":"这本传记重点写他加冕前的“preroyal”岁月。"},{"en":"Archaeologists found preroyal artifacts from the era before the first dynasty.","zh":"考古学家发现了第一王朝之前时期的“preroyal”文物。"}]}],"synonyms":["pre-royal","pre-coronation","pre-monarchical","pre-dynastic"],"phonetic":"/priːˈrɔɪəl/","extraExplanation":["“preroyal”并不是常见词，更常见的写法是加连字符的 **pre-royal**，或直接用更清楚的表达，比如 **before the coronation**（加冕前）、**pre-monarchical**（君主制出现之前）、**pre-dynastic**（王朝出现之前）。","构词法提示：**pre-** 表示“在……之前”（prewar 战前，prehistory 史前）。把它加在 **royal**（王室的）前面，就形成“王室之前/成为王室之前”的含义。正式写作中通常会选择更具体的历史术语（如 pre-dynastic）以避免歧义。"]}
{"word":"preroyally","summary":{"en":"Preroyally means “before becoming royal” (and more rarely, “before royal rule existed”). It’s an uncommon word, often written as pre-royally.","zh":"preroyally 指“成为王室成员之前”（较少见也可指“王权统治出现之前”）。该词很少用，常写作 pre-royally。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens before someone becomes royal (for example, before becoming a king, queen, prince, or princess).","zh":"以（某人）成为王室成员之前的方式；在登基/受封之前。"},"examples":[{"en":"The biography focuses on her preroyally years, when she lived a quiet life away from the court.","zh":"这本传记主要写她成为王室成员之前的岁月，那时她远离宫廷，过着安静的生活。"},{"en":"He worked in the family business preroyally, long before the crown changed his daily routines.","zh":"他在成为王室成员之前就在家族企业工作，远在王冠改变他日常生活之前。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that belongs to the time before a monarchy or royal rule existed in a place (rare).","zh":"以某地尚未出现君主制/王权统治之前的方式（较少见）。"},"examples":[{"en":"Archaeologists describe the settlement as preroyally organized, before any palace system appeared.","zh":"考古学家形容这个聚落是在王权体系出现之前形成的组织结构。"}]}],"synonyms":["before becoming royal","in (someone’s) pre-royal life","prior to the coronation","before royal rule"],"phonetic":"ˌpriːˈrɔɪəli","extraExplanation":["“preroyally”非常少见，写作上更常见的是加连字符的“pre-royally”，或直接用更自然的表达：before becoming royal / before the coronation / in her pre-royal life。","构词法：pre-（在……之前）+ royally（像王室一样；王室地）。因此它多用于传记、历史写作中，为了强调“成为王室之前/王权出现之前”的时间段。"]}
{"word":"preroyalty","summary":{"en":"Preroyalty (often written pre-royalty) refers to something paid or arranged before royalties are paid or calculated, especially an advance or up-front payment.","zh":"preroyalty（常写作 pre-royalty）指在版税/特许权使用费计算或支付之前发生的安排或款项，尤其指预付款或前期一次性费用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Business/finance) Existing or occurring before royalties are paid or calculated (often written with a hyphen: pre-royalty).","zh":"（商业/金融）在版税/特许权使用费支付或计算之前的；常写作带连字符的 pre-royalty。"},"examples":[{"en":"The company offered the songwriter a pre-royalty advance to cover living expenses.","zh":"公司给词曲作者提供了“版税前预支款”，用来支付生活开销。"},{"en":"They negotiated a pre-royalty deal, then agreed on the royalty rate later.","zh":"他们先谈妥了“版税前”的交易条件，之后再确定版税比例。"}]},{"partOfSpeech":"n.","definition":{"en":"A payment or arrangement made before royalties begin (for example, an advance or up-front fee).","zh":"（在版税开始之前的）款项或安排（例如预付款、一次性前期费用）。"},"examples":[{"en":"She received a small preroyalty payment when she signed the contract.","zh":"她签约时收到了少量的版税前款项。"},{"en":"The label treated the $5,000 as preroyalty, not part of future royalties.","zh":"唱片公司把这5000美元算作版税前款项，而不是未来版税的一部分。"}]}],"synonyms":["pre-royalty","up-front payment","advance (against royalties)","up-front fee","royalty advance"],"phonetic":"/ˌpriːˈrɔɪəlti/","extraExplanation":["这个词在通用英语里很少见，更常见的写法是 **pre-royalty**（加连字符）或更直接说 **advance (against royalties)**（版税预付款/预支）。","常见场景：出版、音乐、影视授权、矿产或石油天然气等“按产出分成”的行业。合同里会区分“前期费用/预付款”和“后续按销售或产量计算的 royalties”。","写作建议：如果是正式合同或商业文件，优先用更标准的表达（如 **royalty advance / advance against royalties / up-front fee**），避免读者误解。"]}
{"word":"prerupt","summary":{"en":"Prerupt (rare) means “before an eruption,” especially in volcanology.","zh":"Prerupt（罕见）指“喷发前的”，多用于火山学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; geology/volcanology) Happening before a volcanic eruption; pre-eruption.","zh":"（罕见；地质/火山学）发生在火山喷发之前的；喷发前的。"},"examples":[{"en":"Scientists compared prerupt gas levels with measurements taken after the eruption.","zh":"科学家将喷发前（prerupt）的气体含量与喷发后的测量结果进行比较。"},{"en":"The report describes prerupt warning signs such as increased tremors.","zh":"报告描述了喷发前的预警信号，例如震动增多。"}]},{"partOfSpeech":"vi.","definition":{"en":"(very rare) To experience an eruption earlier; to erupt in advance (usually said of a volcano).","zh":"（非常罕见）提前喷发；更早发生喷发（通常指火山）。"},"examples":[{"en":"Some models suggest the volcano could prerupt under certain pressure conditions.","zh":"一些模型认为在特定压力条件下，这座火山可能会提前喷发。"}]}],"synonyms":["pre-eruption","preruptive","before the eruption"],"phonetic":"/priˈrʌpt/","extraExplanation":["“prerupt”在现代英语中非常少见，更常见、更标准的学术写法是 **pre-eruption**（名词/形容词短语）或 **preruptive**（形容词，如 preruptive signals）。","构词上：**pre-** 表示“在……之前”，**erupt** 表示“喷发/爆发”。因此它的核心意思就是“喷发前”。","如果你是在论文、报告或新闻里看到它，通常可以用更常见的替代表达：**before the eruption**, **pre-eruption conditions**, **preruptive activity**。"]}
{"word":"preruption","summary":{"en":"“Preruption / pre-eruption” means ‘before a volcanic eruption’ (adjective) or ‘the time before an eruption’ (noun).","zh":"“preruption / pre-eruption”表示“火山喷发前的”（形容词）或“喷发前期/喷发前阶段”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written “pre-eruption”) happening or existing before a volcanic eruption.","zh":"（常写作“pre-eruption”）火山喷发之前发生的；喷发前就存在的。"},"examples":[{"en":"Scientists measured preeruption gas levels to help forecast the eruption.","zh":"科学家测量喷发前的气体水平，以帮助预测喷发。"},{"en":"The pre-eruption landscape was covered with forests.","zh":"喷发前的地貌被森林覆盖。"}]},{"partOfSpeech":"n.","definition":{"en":"the period or conditions before a volcanic eruption.","zh":"火山喷发前期；喷发前的状况。"},"examples":[{"en":"During the preeruption, small earthquakes became more frequent.","zh":"在喷发前期，小地震变得更频繁。"}]}],"synonyms":["pre-eruption","before the eruption","pre-eruptive"],"phonetic":"/ˌpri ɪˈrʌpʃən/","extraExplanation":["“preruption”在通用英语里很少见，更常见的写法是带连字符的“pre-eruption”。在地质学、火山监测报告中会用它来描述喷发前的地震活动、地表形变、气体释放等信号。"]}

