{"word":"prewar","summary":{"en":"“Prewar” means “before a war,” often referring to the period before World War II.","zh":"prewar 意为“战前的”，常指（二战等）战争爆发之前的时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening, existing, or made before a war (often used to mean before World War II in a particular country).","zh":"战前的；发生在战争之前的（常指某地二战前的时期）。"},"examples":[{"en":"The museum has a collection of prewar photographs of the city.","zh":"博物馆收藏了一批这座城市的战前照片。"},{"en":"Many prewar buildings were destroyed during the bombing.","zh":"许多战前建筑在轰炸中被毁。"}]}],"synonyms":["before the war","wartime (contrast)","postwar (contrast)"],"phonetic":"/ˌpriˈwɔr/","extraExplanation":["“pre-”是常见前缀，表示“在……之前”（例如：prewar 战前，preseason 季前，pretest 预测验）。","在不同国家/地区，“prewar”具体指哪一场战争要看语境；在英语文本里常见的是指二战前的社会、文化或经济状态，如“prewar Europe（战前欧洲）”。"]}
{"word":"prewarm","summary":{"en":"Prewarm means to warm or prepare something ahead of time; it’s also used in tech for getting systems ready to respond quickly.","zh":"prewarm 指“预热/提前准备”，也常用于技术语境，表示让系统提前就绪以便更快响应。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to warm something up in advance (before it is used, served, or needed)","zh":"预热；事先加热（在使用、上桌或需要之前先把某物加热）"},"examples":[{"en":"Prewarm the oven to 350°F before you put the cake in.","zh":"把烤箱预热到350华氏度，再把蛋糕放进去。"},{"en":"I prewarmed the baby’s bottle in warm water.","zh":"我把宝宝的奶瓶放在温水里预热了一下。"}]},{"partOfSpeech":"vt.","definition":{"en":"(computing) to start or load a system, server, or cache ahead of time so it responds faster later","zh":"（计算机）预热；提前启动/加载（系统、服务器或缓存），以便之后更快响应"},"examples":[{"en":"We prewarm the application servers before peak traffic.","zh":"在流量高峰前，我们会预热应用服务器。"},{"en":"The app prewarms the cache to reduce loading time.","zh":"这个应用会预热缓存来减少加载时间。"}]}],"synonyms":["preheat","warm up","heat up","prime"],"phonetic":"/ˌpriːˈwɔrm/","extraExplanation":["“prewarm”由前缀 pre-（预先）+ warm（加热/变暖）构成。在日常英语里更常见的说法是“preheat”（尤其是烤箱），但在计算机与工程语境中“prewarm”很常用，强调“先让系统进入可工作状态/减少冷启动延迟”。"]}
{"word":"prewarmed","summary":{"en":"“Prewarmed” means warmed ahead of time, or it can be the past form of “prewarm.”","zh":"“prewarmed”表示“预先温热/加热的”，也可作动词“prewarm”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Warmed in advance so it is ready to use, eat, or feel comfortable right away.","zh":"预先加热的；事先温热的（以便立刻使用、食用或更舒适）。"},"examples":[{"en":"Serve the soup in prewarmed bowls to keep it hot longer.","zh":"把汤盛在预先温热的碗里，这样能更久保持热度。"},{"en":"He climbed into a prewarmed bed on a cold night.","zh":"在寒冷的夜晚，他钻进了预先暖好的被窝。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “prewarm”: to warm something before it is needed.","zh":"“prewarm”的过去式/过去分词：在需要之前把某物先加热或暖一暖。"},"examples":[{"en":"I prewarmed the oven to 350°F before baking the cake.","zh":"我在烤蛋糕前把烤箱预热到350°F。"},{"en":"The towels were prewarmed for the guests.","zh":"毛巾已为客人预先加热（温热）好了。"}]}],"synonyms":["preheated","warmed","heated in advance","preheated (oven)"],"phonetic":"/ˌpriːˈwɔrmd/","extraExplanation":["“prewarmed”常见于烹饪与家居语境：prewarm an oven（预热烤箱）、prewarmed plates/bowls（温热过的盘子/碗）、prewarmed bed/towels（暖过的床/毛巾）。拼写中“pre-”表示“提前、预先”。","注意与“preheated”区别：烤箱、金属、器具更常用preheated；强调“变得温暖舒适”或轻度加热时，prewarmed更自然。"]}
{"word":"prewarming","summary":{"en":"Prewarming means warming something in advance before its main use.","zh":"prewarming 指在正式使用前先把某物预热/提前加热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of warming something up in advance before its main use (such as an oven, a car engine, or food).","zh":"（在正式使用前）预热；提前加热（如烤箱、发动机或食物）。"},"examples":[{"en":"Prewarming the oven helps the cake bake evenly.","zh":"预热烤箱能让蛋糕受热更均匀。"},{"en":"In cold weather, prewarming the car can make driving more comfortable.","zh":"天气寒冷时，提前预热汽车会让驾驶更舒适。"},{"en":"Some labs recommend prewarming samples to a specific temperature.","zh":"一些实验室建议将样品预热到指定温度。"}]},{"partOfSpeech":"v.","definition":{"en":"Warming something up in advance before using it.","zh":"（动词用法）在使用前预热；提前加热。"},"examples":[{"en":"I’m prewarming the pan before adding the vegetables.","zh":"我在下蔬菜前先把锅预热。"},{"en":"The technician is prewarming the device to stabilize it.","zh":"技术员正在预热设备以使其稳定。"}]}],"synonyms":["preheating","warming up","heating beforehand"],"phonetic":"/priːˈwɔːrmɪŋ/","extraExplanation":["“prewarming / pre-warming / preheating”在日常英语里常用的是preheating（预热），尤其用于烤箱、煎锅等；prewarming也能用，但更像“先暖一暖”的感觉，在技术或产品说明中也会出现。","构词：pre-（在……之前）+ warm（使变暖）。因此它强调“提前做”的时间顺序。"]}
{"word":"prewarms","summary":{"en":"“Prewarms” means “warms something up in advance,” often used for ovens, blankets, or even computer systems.","zh":"“prewarms”表示“提前预热/预先暖一下”，常用于烤箱、毯子，也可用于计算机系统的“预热/预加载”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to warm something slightly beforehand so it is ready to use or comfortable later","zh":"预先加热；提前把……稍微暖起来，以便之后使用或更舒适"},"examples":[{"en":"She prewarms the oven for ten minutes before baking.","zh":"她在烘焙前先把烤箱预热十分钟。"},{"en":"The nurse prewarms the blanket so the patient won’t feel cold.","zh":"护士先把毯子预热，让病人不会觉得冷。"},{"en":"The app prewarms the cache to make the first screen load faster.","zh":"这个应用会预先“热身”缓存，让首屏加载更快。"}]}],"synonyms":["preheat","warm up","heat up (in advance)","prime (computing)"],"phonetic":"/priˈwɔrm/","extraExplanation":["“prewarms”通常是动词“prewarm”的第三人称单数（he/she/it prewarms）。也常写作“pre-warms / pre-warm”。","在科技语境里，prewarm 常用作比喻，表示“预热/预加载/热身”（例如预热缓存、预热服务器连接），含义是提前做准备以减少延迟。"]}
{"word":"prewarn","summary":{"en":"Prewarn means to warn someone in advance.","zh":"prewarn 指“事先警告/提前提醒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to warn someone in advance about something that may happen or be dangerous","zh":"事先警告；预先提醒（某人可能发生的事或危险）"},"examples":[{"en":"The police prewarned drivers about icy roads.","zh":"警方提前提醒司机注意道路结冰。"},{"en":"Please prewarn me if the meeting time changes.","zh":"如果会议时间有变，请提前通知我。"},{"en":"We were prewarned that the hike would be difficult.","zh":"我们事先被告知这次徒步会很艰难。"}]},{"partOfSpeech":"n.","definition":{"en":"an advance warning (rare as a noun in modern English)","zh":"预先警告；预先提醒（作名词用法较少见）"},"examples":[{"en":"They gave us a prewarn before the loud test sound.","zh":"在测试的巨大声响前，他们先给了我们一个预先提醒。"}]}],"synonyms":["warn","forewarn","alert","notify","caution"],"phonetic":"/priˈwɔrn/","extraExplanation":["“pre-”表示“在……之前”，所以 prewarn 字面意思就是“在发生前就警告”。在现代英语里更常用作动词，名词用法比较少。","常见搭配：prewarn someone about something / prewarn someone that + 从句。也常见过去分词作形容词：prewarned（如：We were prewarned.）。"]}
{"word":"prewarned","summary":{"en":"Prewarned means “warned in advance,” and it comes from the verb prewarn, “to warn beforehand.”","zh":"prewarned 表示“事先被警告/被提醒”；来自动词 prewarn，意思是“提前警告/提醒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"warned in advance; given notice before something happens.","zh":"事先被警告的；预先被提醒的。"},"examples":[{"en":"We were prewarned about the heavy traffic, so we left early.","zh":"我们事先被提醒会堵车，所以提前出发了。"},{"en":"The staff felt calmer because they were prewarned about the schedule change.","zh":"员工因为事先知道日程变更而更安心。"}]},{"partOfSpeech":"vt.","definition":{"en":"to warn someone in advance about a possible problem or danger.","zh":"预先警告；事先提醒（某人）可能的麻烦或危险。"},"examples":[{"en":"Please prewarn me if the meeting runs late.","zh":"如果会议会拖延，请提前提醒我。"},{"en":"The guide prewarned us not to feed the animals.","zh":"导游事先警告我们不要喂动物。"}]}],"synonyms":["forewarned","warned beforehand","alerted","notified"],"phonetic":"/ˌpriːˈwɔrnd/","extraExplanation":["“prewarned”常见于被动或形容词用法（be prewarned）。更常见、也更固定的表达是“forewarned”，尤其在谚语“Forewarned is forearmed.”（有备无患）里。语气上，“prewarn”偏中性、口语/书面都可；“forewarn”更偏正式或带一点格言色彩。"]}
{"word":"prewarning","summary":{"en":"Prewarning means an advance warning given before something happens.","zh":"prewarning 指在事情发生前给出的预先警告/事先通知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an advance warning; information given before something happens so people can prepare","zh":"预先警告；事先通知（让人提前准备）"},"examples":[{"en":"The system gives a prewarning when the temperature rises too fast.","zh":"当温度上升过快时，系统会发出预先警告。"},{"en":"With no prewarning, the storm caught many drivers off guard.","zh":"由于没有任何事先警告，暴风雨让许多司机措手不及。"},{"en":"The teacher gave a prewarning about the surprise quiz the next day.","zh":"老师事先提醒说第二天会有突击小测。"}]}],"synonyms":["advance warning","early warning","forewarning","prior notice"],"phonetic":"/ˌpriːˈwɔrnɪŋ/","extraExplanation":["“prewarning”在日常口语中不如“warning”“advance warning”常见，更常见的动词形式是“prewarn”（预先警告、提前提醒）。在写作里，如果想更自然，可以用“give advance warning / warn someone in advance”。"]}
{"word":"prewarns","summary":{"en":"“prewarns” means “warns someone in advance.”","zh":"“prewarns”表示“提前警告/预先提醒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to warn someone in advance about a possible danger, problem, or event","zh":"事先警告；预先提醒（某人可能发生的危险、问题或事件）"},"examples":[{"en":"The weather service prewarns people when a severe storm is likely.","zh":"气象部门在可能出现强风暴时会提前警告民众。"},{"en":"The teacher prewarns the class that the test will be difficult.","zh":"老师提前提醒全班这次考试会很难。"}]}],"synonyms":["warn","forewarn","alert","caution","notify"],"phonetic":"/ˌpriˈwɔrn/","extraExplanation":["“prewarns”是动词“prewarn”的第三人称单数形式（he/she/it prewarns）。常见搭配：prewarn someone (about/of) something（事先提醒某人某事）；prewarn that + 从句（提前警告……）。","前缀“pre-”表示“在……之前”，所以prewarn强调“提前”这一层意思；与warn相比更突出预先准备的感觉。"]}
{"word":"prewarrant","summary":{"en":"Prewarrant is a rare verb meaning to guarantee, justify, or authorize something in advance.","zh":"Prewarrant 是一个较少见的动词，意思是“事先保证、事先证明合理或预先授权”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to guarantee or authorize in advance; to give prior justification for something","zh":"（提前）保证或授权；事先为某事提供正当理由"},"examples":[{"en":"No one can prewarrant the outcome of an election.","zh":"没有人能事先保证选举的结果。"},{"en":"The policy was meant to prewarrant emergency spending if a disaster occurred.","zh":"这项政策旨在在发生灾害时预先授权紧急支出。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law, rare) to provide a prior warrant or legal authority for an action","zh":"（法律，用法较少）为某项行动事先提供令状或法律授权"},"examples":[{"en":"The attorney argued that the search was not prewarranted by the judge.","zh":"律师主张该搜查并未事先得到法官签发令状。"},{"en":"In some discussions, critics ask whether surveillance can be prewarranted at all.","zh":"在一些讨论中，批评者质疑监控是否可能真正做到“事先授权”。"}]}],"synonyms":["preauthorize","authorize in advance","guarantee beforehand","justify in advance","predetermine"],"phonetic":"/ˌpriːˈwɔr.ənt/","extraExplanation":["“prewarrant”非常少见，多数情况下人们会用更常见的表达：preauthorize（预先授权）、predetermine（预先确定）、guarantee beforehand（事先保证）、justify in advance（事先辩护/证明合理）。","词形上：pre- 表示“在……之前”，warrant 作动词常见义是“保证、担保；使……有正当理由；（法律）签发令状/授权”。因此 prewarrant 就是“在之前就 warrant”。","在真实法律写作里，更常见的说法是 “a warrant was obtained beforehand / prior judicial authorization”。使用 prewarrant 可能显得过时或不够地道，建议谨慎。"]}
{"word":"prewash","summary":{"en":"Prewash means washing briefly before the main wash, or the machine’s prewash step; it can also describe fabric that has been washed in advance.","zh":"prewash 指正式清洗前的“预洗”，也可指洗衣机的预洗程序；还可形容已预先洗过的布料等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wash something briefly before the main wash (often to remove heavy dirt or stains)","zh":"（正式清洗前）预洗；先简单洗一遍（常为去除较重污渍或泥垢）"},"examples":[{"en":"I prewash the baby clothes to remove any leftover chemicals.","zh":"我会先预洗婴儿衣物，去掉可能残留的化学物质。"},{"en":"Prewash this muddy jacket before putting it in with the rest of the laundry.","zh":"这件外套太多泥了，先预洗再和其他衣物一起洗。"}]},{"partOfSpeech":"n.","definition":{"en":"a short washing step before the main wash cycle, especially on a washing machine","zh":"（洗衣机的）预洗程序；预洗步骤"},"examples":[{"en":"Use the prewash if the towels are heavily soiled.","zh":"毛巾特别脏的话就用预洗程序。"},{"en":"The prewash adds about 10 minutes to the cycle.","zh":"预洗会让整个程序多大约10分钟。"}]},{"partOfSpeech":"adj.","definition":{"en":"washed in advance (especially fabric) to prevent shrinking or color bleeding later","zh":"（布料等）预先洗过的（用于减少后续缩水或掉色）"},"examples":[{"en":"Choose prewash fabric to reduce shrinking after sewing.","zh":"做衣服时选预洗过的布料可以减少缩水。"}]}],"synonyms":["rinse","soak","pre-rinse","pre-treat"],"phonetic":"/ˈpriˌwɑʃ/","extraExplanation":["“prewash / pre-wash”常见于洗衣机面板与洗涤说明中，拼写上既可连写（prewash）也可加连字符（pre-wash）。在家用语境里，多指“预洗程序”；在手洗或护理衣物时，多指“先简单洗一遍再正式清洗”。"]}
{"word":"prewashed","summary":{"en":"Prewashed means already washed before sale or use, often to make products cleaner, softer, or less likely to shrink.","zh":"Prewashed 指在出售或使用前已预洗过，常见于食品或衣物，表示更干净、手感更柔软或不易缩水。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"washed before being sold or used, so it is already clean or ready to use.","zh":"（在出售或使用前）已预先清洗过的；开封即可用的。"},"examples":[{"en":"These prewashed salad greens save a lot of time.","zh":"这些预洗过的沙拉菜叶很省时间。"},{"en":"The jeans are prewashed to reduce shrinking.","zh":"这条牛仔裤经过预洗以减少缩水。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of clothing or fabric) treated with a wash during manufacturing to create a softer feel or a worn-in look.","zh":"（指衣物/布料）在生产时经过水洗处理，使手感更柔软或呈现做旧效果。"},"examples":[{"en":"I like the prewashed cotton—it feels softer.","zh":"我喜欢这种预洗棉，摸起来更柔软。"},{"en":"The shirt has a prewashed, vintage style.","zh":"这件衬衫有预洗的复古风格。"}]}],"synonyms":["pre-cleaned","washed (already)","rinse-washed"],"phonetic":"/ˌpriːˈwɑʃt/","extraExplanation":["“pre-”表示“在……之前”。“prewashed”常见于商品标签，如：prewashed salad / prewashed fabric。","和“washed”相比，“prewashed”更强调“出厂前/出售前已经洗过”，通常暗示“更方便”或“减少缩水/掉色”等问题。","购买食品时看到“prewashed”一般表示已清洗过，但是否需要再冲洗取决于包装说明与个人卫生习惯。"]}
{"word":"prewashes","summary":{"en":"“Prewashes” means preliminary washes done before the main wash, or the action of washing something briefly first.","zh":"“prewashes”指主洗前的预洗（复数），或指先简单清洗一下的动作（动词形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preliminary wash (a short wash or rinse) done before the main washing cycle, especially in laundry or dishwashing","zh":"（洗衣或洗碗前的）预洗；主洗前的短暂清洗/冲洗程序"},"examples":[{"en":"Use the prewash if the clothes are very muddy.","zh":"如果衣服很泥泞，可以用预洗程序。"},{"en":"This dishwasher has a prewash cycle for dried-on food.","zh":"这台洗碗机有预洗程序，适合处理干结的食物残渣。"}]},{"partOfSpeech":"v.","definition":{"en":"to wash something briefly before the main wash (often to remove heavy dirt or stains)","zh":"在正式清洗前先预洗（通常为了去掉较重污渍）"},"examples":[{"en":"She prewashes the towels before putting them in the washer.","zh":"她会先把毛巾预洗一下再放进洗衣机。"},{"en":"He prewashes the pan to loosen the stuck sauce.","zh":"他先把锅预洗一下，把粘住的酱汁泡松。"}]}],"synonyms":["prewash cycles","rinse cycles","pre-rinses","precleaning","pre-rinse"],"phonetic":"/ˈpriːˌwɑʃɪz/","extraExplanation":["“prewashes”通常是复数名词（prewashes）或动词第三人称单数（he/she prewashes）。在家电面板上更常见的是“prewash”（预洗）作为功能名称。","预洗的作用多是“先把大块污垢/顽固污渍冲掉或泡开”，从而让主洗更有效；但如果污渍不重，使用预洗会增加用水和时间。"]}
{"word":"prewashing","summary":{"en":"Prewashing means washing something first—especially new fabric or clothes—before using it, to remove residues and prevent later shrinkage or dye bleeding.","zh":"Prewashing 指在正式使用前先把新布料或衣物洗一遍，以去除残留物，并减少之后缩水或掉色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Washing something before its first real use, especially fabric/clothes to remove chemicals, dye, dust, or shrinkage.","zh":"在第一次正式使用前先清洗（尤指布料/衣物），以去除化学残留、染料、灰尘或预先缩水。"},"examples":[{"en":"Prewashing the fabric helps prevent the finished shirt from shrinking later.","zh":"先把布料预洗可以防止成衣之后缩水。"},{"en":"Many people prewash new towels to remove lint and improve absorbency.","zh":"很多人会先预洗新毛巾，去掉浮毛并让吸水性更好。"},{"en":"The care label recommends prewashing before wearing.","zh":"护理标签建议穿之前先预洗。"}]},{"partOfSpeech":"v.","definition":{"en":"To wash something before its first real use (common in sewing, laundry, and manufacturing).","zh":"在第一次正式使用前先清洗（常见于缝纫、洗衣与生产制造语境）。"},"examples":[{"en":"I always prewash cotton before I sew with it.","zh":"我用棉布做衣服前总会先预洗。"},{"en":"Prewash the jeans in cold water to reduce color bleeding.","zh":"用冷水预洗牛仔裤可以减少掉色。"}]}],"synonyms":["prewash","wash first","rinse out (partial)","launder beforehand"],"phonetic":"/ˌpriːˈwɑʃɪŋ/","extraExplanation":["“Prewashing”在北美家居/手工缝纫语境里非常常见：布料在制作前预洗，主要是为了“预缩水”和去除上浆、整理剂等化学处理物。","与“rinse（漂洗）”不同，prewash 通常包含使用清洁剂的“洗”，但强度可能较轻；在洗衣机上也可能对应“prewash cycle（预洗程序）”。","拼写提示：可写作 prewash（动词/名词），其动名词形式为 prewashing。"]}
{"word":"preweigh","summary":{"en":"Preweigh means to weigh something in advance, before another process or use.","zh":"preweigh 指在进行后续处理或使用之前，先把某物称重。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to weigh something before a later step (such as packaging, cooking, shipping, or an experiment)","zh":"（在后续步骤之前）预先称重"},"examples":[{"en":"In the lab, we preweigh the filter paper before collecting the sample.","zh":"在实验室里，我们会在收集样品之前先给滤纸预先称重。"},{"en":"The bakery preweighs portions of dough to keep every loaf the same size.","zh":"面包店会把面团分成固定份量并预先称重，以确保每条面包大小一致。"}]}],"synonyms":["weigh beforehand","weigh in advance","pre-measure (similar idea)"],"phonetic":"/ˌpriːˈweɪ/","extraExplanation":["“preweigh”常见写法也有“pre-weigh”。多用于实验、食品加工、物流等场景，强调“先称好重量，再进行下一步”。"]}
{"word":"prewelcome","summary":{"en":"“Prewelcome” is a rare, informal word meaning an early welcome given in advance (often by email/message), or to welcome someone beforehand.","zh":"“prewelcome”是较少见、偏非正式的用法，指在对方到达前通过邮件/信息等提前表达欢迎，或表示“提前欢迎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A welcome given in advance, before someone arrives or an event begins; an “early welcome.”","zh":"（少见用法）在某人到达或事情开始之前提前表达的欢迎；“预先的欢迎”。"},"examples":[{"en":"The host sent a short prewelcome message to guests the day before the party.","zh":"主人在派对前一天给客人发了一条简短的预先欢迎信息。"},{"en":"We received a warm prewelcome email with directions and check-in details.","zh":"我们收到一封热情的预先欢迎邮件，里面有路线和入住细节。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To welcome someone in advance (usually by message or announcement).","zh":"（少见用法）提前欢迎（通常通过信息或公告）。"},"examples":[{"en":"Our team will prewelcome new members with a note and a short guide.","zh":"我们团队会用一张便条和一份简短指南来提前欢迎新成员。"},{"en":"They prewelcomed the visitors online before the conference began.","zh":"会议开始前，他们在网上提前欢迎来访者。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, informal) Happening before an official welcome (email, event, greeting).","zh":"（少见、非正式）发生在正式欢迎之前的（邮件、活动、问候等）。"},"examples":[{"en":"The prewelcome call helped everyone feel comfortable on day one.","zh":"那通预先欢迎电话让大家在第一天就感到自在。"}]}],"synonyms":["welcome in advance","pre-arrival welcome","welcome message","welcome email","advance greeting"],"phonetic":"/ˌpriːˈwɛlkəm/","extraExplanation":["“prewelcome”不是常见标准词，更多见于公司邮件、活动组织等语境里的临时造词（pre- + welcome）。在正式写作中更自然的表达通常是：\"welcome in advance\"（提前欢迎）、\"a welcome message\"（欢迎信息）、\"pre-arrival welcome\"（到达前欢迎）、\"welcome email\"（欢迎邮件）。","读写时可把它理解为“到达前/活动前就发出的欢迎”。如果你要写得更地道，优先用上面那些更常用的说法。"]}
{"word":"prewelcomed","summary":{"en":"“Prewelcomed” means “welcomed in advance,” though it’s informal and not very common.","zh":"“prewelcomed”表示“提前欢迎”，但属于较不常见、偏非正式的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Welcomed in advance; treated as welcome before arriving or before something happens.","zh":"预先欢迎的；在到来或事情发生之前就表示欢迎的。"},"examples":[{"en":"New students are prewelcomed with an email and a campus guide.","zh":"新生会提前收到欢迎邮件和校园指南。"},{"en":"You’re already prewelcomed—just come as you are.","zh":"你已经被提前欢迎了——按你自己的样子来就好。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form used to mean “to welcome (someone) in advance.”","zh":"（非正式用法）作动词的过去式/过去分词：指“提前欢迎（某人）”。"},"examples":[{"en":"We prewelcomed the guests by preparing their rooms and leaving a note.","zh":"我们提前欢迎客人：整理好房间并留了便条。"}]}],"synonyms":["welcomed in advance","warmly received","greeted ahead of time"],"phonetic":"/ˌpriːˈwɛlkəmd/","extraExplanation":["“prewelcomed”在标准英语中不算常见，更多见于口语、活动文案或社群表达。更常见、更自然的写法是“welcomed in advance”或“given a warm welcome ahead of time”。","也有人写成带连字符的“pre-welcomed”。在正式写作里，如果担心读者不熟悉，建议改用更常见的表达。"]}
{"word":"prewelcoming","summary":{"en":"“Prewelcoming” (usually written “pre-welcoming”) describes something done before an official welcome to set a friendly, welcoming tone.","zh":"“prewelcoming”（更常写作“pre-welcoming”）指在正式欢迎之前做的准备性、铺垫性的欢迎安排或友好氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Happening before the official welcome; meant to prepare people for a warm reception.","zh":"（不常见）发生在正式欢迎之前的；用于为热情接待做铺垫的。"},"examples":[{"en":"The organizer sent a prewelcoming email with directions and a friendly note.","zh":"组织者发了一封“预欢迎”邮件，附上路线并写了几句友好的话。"},{"en":"They played a short game as a prewelcoming activity before introductions.","zh":"在自我介绍前，他们用一个小游戏作为“预欢迎”活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Showing a welcoming attitude in advance; already friendly and open before meeting someone.","zh":"（不常见）提前表现出欢迎的态度；在见面前就已很友好、很开放的。"},"examples":[{"en":"Her prewelcoming messages made the new student feel less nervous.","zh":"她提前发来的欢迎信息让新同学没那么紧张了。"},{"en":"The host’s prewelcoming tone set everyone at ease.","zh":"主人提前展现的欢迎语气让大家放松了下来。"}]}],"synonyms":["pre-welcoming","welcoming in advance","preliminary","preparatory","introductory","warm-up","inviting"],"phonetic":"/ˌpriːˈwɛlkəmɪŋ/","extraExplanation":["“prewelcoming”在标准英语里非常少见，实际写作中更常用带连字符的“pre-welcoming”，或直接用更自然的表达：“welcoming in advance / early welcome / preparatory welcome / introductory message”。","前缀“pre-”表示“在……之前”，搭配“welcoming（欢迎的）”时，通常指活动、邮件、信息、氛围等在正式欢迎前的“铺垫”。"]}
{"word":"prewelwired","summary":{"en":"Prewired means wiring has already been installed in advance; to prewire means to install wiring ahead of time.","zh":"prewired 指“已预先布线的”；to prewire 指“提前布线/预接线”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of a building or device) already fitted with electrical wires before installation or final assembly.","zh":"（尤指建筑或设备）在安装或最终组装之前就已预先布好电线的；预接线的。"},"examples":[{"en":"The house is prewired for internet and security cameras.","zh":"这套房子已经为网络和安防摄像头预先布线了。"},{"en":"Buy a prewired control panel to save installation time.","zh":"买一个预接线的控制面板可以节省安装时间。"}]},{"partOfSpeech":"vt.","definition":{"en":"to install wiring in advance, before something is finished or put in place.","zh":"预先布线；提前安装电线（在完工或就位之前）。"},"examples":[{"en":"They prewired the office for additional outlets.","zh":"他们为办公室额外的插座预先布线。"},{"en":"The contractor will prewire the walls before the drywall goes up.","zh":"承包商会在上石膏板之前先把墙内的线路布好。"}]}],"synonyms":["wired in advance","pre-installed (wiring)","preconnected"],"phonetic":"/ˌpriˈwaɪrd/","extraExplanation":["你输入的“prewelwired”不是常见英文拼写，最可能想写的是 **prewired**（常写作 pre-wired）。","在房产/装修广告里很常见：**prewired for + 功能** 表示“已经为某功能预留线路”，不一定代表设备都已安装好。"]}
{"word":"prewelwiring","summary":{"en":"Prewiring means putting wires/cables in place ahead of time, before the final devices are installed.","zh":"Prewiring 指在安装最终设备之前，先把电线或各类线缆预先铺设好（预布线）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of installing electrical or communication cables in a building or device before the final equipment (lights, outlets, speakers, internet devices, etc.) is connected","zh":"（在最终设备如灯具、插座、音响、网络设备等安装前）预先铺设电线/线缆的行为；预布线"},"examples":[{"en":"The contractor finished the prewiring for the kitchen before the cabinets arrived.","zh":"承包商在橱柜到货前就完成了厨房的预布线。"},{"en":"We paid extra for prewiring the house for surround sound.","zh":"我们多花了一些钱给房子做环绕声音响的预布线。"}]},{"partOfSpeech":"v.","definition":{"en":"to install wiring in advance, usually during construction or before a system is set up","zh":"（通常在施工阶段或系统安装前）提前布线；预先接好线"},"examples":[{"en":"They prewired the living room for ceiling speakers.","zh":"他们给客厅的天花板音箱提前布好了线。"},{"en":"If you prewire now, adding smart switches later will be easier.","zh":"如果你现在先预布线，以后加装智能开关会更容易。"}]}],"synonyms":["pre-wire","rough-in (wiring)","wire in advance"],"phonetic":"/ˌpriːˈwaɪrɪŋ/","extraExplanation":["“prewelwiring”很可能是拼写错误。更常见的拼法是 **prewiring** 或 **pre-wiring**。在房屋装修/新建中很常见，尤其是网络（Ethernet）、安防摄像头、门铃、音响、充电桩等项目。"]}
{"word":"prewhip","summary":{"en":"“Prewhip” means to whip something ahead of time (or the prewhipped result), mainly used in cooking.","zh":"“prewhip”多用于烹饪，指提前打发/搅打（或指提前打发好的成品）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to whip (a liquid or mixture) in advance of a later step, so it is partially or fully aerated beforehand","zh":"（烹饪中）提前把（液体或混合物）打发/搅打好，以便后续步骤使用"},"examples":[{"en":"Prewhip the cream and keep it chilled until you’re ready to fold it in.","zh":"把奶油提前打发好，冷藏保存，等需要时再拌入。"},{"en":"If you prewhip the eggs, the batter will be lighter.","zh":"如果把鸡蛋提前打发，面糊会更蓬松。"}]},{"partOfSpeech":"n.","definition":{"en":"something that has been whipped ahead of time (especially prewhipped cream)","zh":"提前打发好的东西（尤指预先打发的奶油）"},"examples":[{"en":"The recipe calls for prewhip, but fresh whipped cream works too.","zh":"食谱需要用预先打发的奶油，不过现打的也可以。"}]}],"synonyms":["whip in advance","whip ahead of time","pre-beat","pre-aerate"],"phonetic":"/priˈwɪp/","extraExplanation":["“prewhip”不是非常常见的标准词，更常见的写法是带连字符的“pre-whip”，或直接说“whip in advance / whip ahead of time”。在烹饪语境里最容易遇到，尤其是甜点中提前打发奶油、蛋白等。"]}
{"word":"prewhipped","summary":{"en":"Prewhipped means already whipped and ready to use, especially for food like cream or topping.","zh":"prewhipped 指“已经打发好、可直接使用的”，多用于奶油等食品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already whipped (beaten until light and airy) before being sold or used; not needing you to whip it yourself.","zh":"预先打发好的；在出售或使用前就已经打到蓬松状态的（不需要你再打发）。"},"examples":[{"en":"The recipe is faster if you use prewhipped cream.","zh":"如果用预先打发好的奶油，这个食谱会更快。"},{"en":"She topped the cake with prewhipped topping from a can.","zh":"她用罐装的预先打发好的奶油顶料给蛋糕装饰。"},{"en":"Do not overmix prewhipped egg whites, or they will deflate.","zh":"不要过度搅拌预先打发好的蛋白，否则会消泡。"}]}],"synonyms":["ready-whipped","whipped (already whipped)","aerosol whipped (for canned products)"],"phonetic":"/ˌpriːˈwɪpt/","extraExplanation":["在食品包装上，prewhipped 常见于 cream（鲜奶油）或 topping（奶油顶料）。它强调“省去打发步骤”，但口感可能与现打的不同：有的产品会加入稳定剂或糖，适合快速装饰或夹馅。烘焙时要注意：预打发的材料更容易“消泡”，拌入面糊时通常用“切拌/翻拌（fold in）”更稳妥。"]}
{"word":"prewhipping","summary":{"en":"Prewhipping means whipping an ingredient in advance (or partly) before the next cooking step.","zh":"Prewhipping 指在下一步烹饪前先（部分）打发食材的做法，或指预处理/预打发的配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of whipping (mixing air into) a food ingredient ahead of time, so it is partly thickened before the next step","zh":"（烹饪中）预先打发：在后续步骤之前先把食材（如奶油、蛋白等）打入空气，使其部分变稠/起泡的做法"},"examples":[{"en":"Prewhipping the cream helps it hold its shape when you fold it into the mousse.","zh":"先把奶油预先打发，有助于在拌入慕斯时保持形状。"},{"en":"The recipe recommends prewhipping the egg whites to soft peaks.","zh":"食谱建议先把蛋白预先打发到软性发泡。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an ingredient that is made for easy whipping or partly whipped in advance (common in food manufacturing)","zh":"（食品/配料）预打发的；为方便打发而预处理的（常见于食品加工语境）"},"examples":[{"en":"Some bakeries use prewhipping cream to save time during busy hours.","zh":"有些烘焙店会用“预打发奶油”来在高峰时段节省时间。"},{"en":"The label says the product is designed for prewhipping before piping.","zh":"标签说明该产品适合先预打发再用于裱花。"}]}],"synonyms":["partial whipping","pre-whip","whip ahead of time","pre-aeration"],"phonetic":"/ˌpriˈwɪpɪŋ/","extraExplanation":["“Prewhipping”不是日常最常见的词，更常出现在烘焙/乳制品加工说明里。家庭烹饪中人们通常直接说“whip the cream first / partially whip the cream（先/稍微打发奶油）”。","在工业或配方语境里，预打发常用来控制成品稳定性与口感（例如让奶油更容易裱花，或让混合物更轻盈但不消泡）。"]}
{"word":"prewilling","summary":{"en":"“Prewilling” is a rare adjective meaning willing in advance or already willing beforehand.","zh":"“prewilling”是个很少见的形容词，意思是“事先就愿意的／预先愿意的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) willing in advance; ready and willing beforehand.","zh":"（罕见）预先愿意的；事先就乐意的。"},"examples":[{"en":"She was prewilling to help, so we didn’t need to persuade her.","zh":"她事先就愿意帮忙，所以我们不需要劝她。"},{"en":"Having a prewilling attitude makes teamwork easier.","zh":"带着“预先愿意配合”的态度会让团队合作更顺利。"}]}],"synonyms":["willing in advance","already willing","willing beforehand","ready and willing"],"phonetic":"/ˌpriːˈwɪlɪŋ/","extraExplanation":["“prewilling”在现代英语里非常少见，更多时候人们会说：“willing in advance / already willing / willing beforehand”。","构词上是前缀“pre-（在……之前）”+“willing（愿意的）”，含义直观，但因为不常用，正式写作中建议改用更常见表达以避免读者困惑。"]}
{"word":"prewillingly","summary":{"en":"“Prewillingly” means doing something willingly ahead of time.","zh":"“prewillingly”指在事情发生前就心甘情愿地去做。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in advance and with willingness; willingly beforehand","zh":"事先而且心甘情愿地；预先自愿地"},"examples":[{"en":"She prewillingly agreed to cover the shift before anyone asked her.","zh":"还没等别人开口，她就事先心甘情愿地答应代班。"},{"en":"The team prewillingly shared their notes to help new members.","zh":"团队成员预先自愿分享笔记，帮助新成员。"}]}],"synonyms":["willingly beforehand","willingly in advance","voluntarily","readily","gladly"],"phonetic":"/ˌpriˈwɪlɪŋli/","extraExplanation":["“prewillingly”比较少见，更常见的表达是：**willingly in advance / willingly beforehand / volunteered ahead of time**。","前缀 **pre-** 表示“在……之前、预先”，加在 **willingly**（心甘情愿地）前面，强调“还没被要求/还没发生之前就自愿去做”。在正式写作中通常会改用更自然的短语来表达。"]}
{"word":"prewillingness","summary":{"en":"Prewillingness means being willing or ready in advance.","zh":"prewillingness 指“事先就愿意/准备好”的意愿或倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a willingness in advance; a prior readiness or openness to do something before being asked or before a situation happens","zh":"预先的意愿；事先的准备与愿意（在被要求或事情发生之前就愿意去做）"},"examples":[{"en":"Her prewillingness to help new employees made the team feel welcome.","zh":"她事先就愿意帮助新员工，让团队感到很受欢迎。"},{"en":"Without prewillingness to compromise, the negotiation stalled.","zh":"如果没有事先愿意妥协，谈判就会陷入僵局。"}]},{"partOfSpeech":"n.","definition":{"en":"a predisposition or inclination (often used in academic or formal writing) to accept an idea or action","zh":"（常见于学术/正式语境）预倾向；事先更容易接受某个观点或做法的心理倾向"},"examples":[{"en":"Participants’ prewillingness to trust the system affected the results.","zh":"参与者对系统的预先信任倾向影响了结果。"},{"en":"Their prewillingness to try unfamiliar foods was shaped by past travel.","zh":"他们愿意尝试陌生食物的预先倾向受过去旅行经历影响。"}]}],"synonyms":["prior willingness","readiness","openness","inclination","predisposition"],"phonetic":"/ˌpriˈwɪlɪŋnəs/","extraExplanation":["“prewillingness”并不是非常常见的标准词，更常见的表达有：“willingness beforehand / prior willingness / readiness / openness”。","构词上，“pre-”表示“在……之前”，加在“willingness（意愿）”前面强调“事先就愿意/准备好”。在正式写作中可以用，但日常口语建议用更自然的替代表达。"]}
{"word":"prewire","summary":{"en":"Prewire means to put wiring in place ahead of time, usually during construction, so connections can be added easily later.","zh":"Prewire 指在施工等早期阶段提前把线路布好（预埋/预留布线），方便后续直接接入设备。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to install electrical or network wiring in advance, before walls, ceilings, or equipment are finished or put in place","zh":"（在墙面/天花板封闭或设备安装前）预先布线；预埋电线/网线"},"examples":[{"en":"We decided to prewire the house for speakers before the drywall went up.","zh":"我们决定在装石膏板之前先给房子预埋音箱线。"},{"en":"The office was prewired for high-speed internet during construction.","zh":"办公室在施工期间就预先布好了高速网络线。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide a building or system with wiring in advance so it is ready to connect later","zh":"让建筑/系统提前具备布线条件，便于之后直接接入"},"examples":[{"en":"The contractor prewired each room so future smart lights would be easy to add.","zh":"承包商给每个房间都预先布线，方便以后加装智能灯。"}]}],"synonyms":["wire in advance","pre-install wiring","rough-in wiring"],"phonetic":"/ˌpriːˈwaɪr/","extraExplanation":["“pre-”表示“在……之前”，所以 prewire 常用于房屋装修、楼宇弱电（网线/电话线/同轴线）、安防（摄像头）、音响系统等场景。","在美式英语里它多作动词使用；在工程沟通中也常见被动形式：be prewired for…（为……预留/预埋了线路）。"]}
{"word":"prewired","summary":{"en":"Prewired means already wired in advance, or (figuratively) set up in advance to respond a certain way.","zh":"prewired 指“已预先布线/接线”，也可比喻“被预先设定为某种反应/倾向”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Already fitted with electrical wires (or cables) during manufacture or construction, so it is ready to connect and use.","zh":"（在制造或施工时）已预先装好电线/线缆的，因此可以直接连接使用。"},"examples":[{"en":"The house is prewired for an alarm system.","zh":"这栋房子已预先布线，可以安装报警系统。"},{"en":"Choose a prewired doorbell to make installation easier.","zh":"选一个预先接好线的门铃，安装会更简单。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figuratively: designed or set up in advance to react in a particular way.","zh":"（比喻）被预先设定/“写好程序”的，会以某种方式反应。"},"examples":[{"en":"Some apps feel prewired to collect data by default.","zh":"有些应用看起来默认就被“预设”为收集数据。"},{"en":"He seems prewired to worry about everything.","zh":"他好像天生就“预设”为会担心所有事。"}]}],"synonyms":["preinstalled","wired","preconfigured","ready-wired"],"phonetic":"/ˌpriːˈwaɪrd/","extraExplanation":["“prewired”常见于房屋与装修语境：prewired for X 表示“已为X预留线路/接口”，比如 prewired for speakers（已为音响布线）、prewired for Ethernet（已布网线）。","比喻用法带一点口语色彩，常和“by default（默认）”“designed to（被设计成）”一起出现，用来表达系统或人的“倾向/设定”。"]}
{"word":"prewireless","summary":{"en":"Prewireless (more commonly pre-wireless) means “from the time before wireless technology was common.”","zh":"prewireless（更常见写法为 pre-wireless）指“无线技术普及之前的（时代/方式）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually written with a hyphen: pre-wireless) Relating to the time before wireless communication/technology became common; from an earlier era when devices depended mainly on wires (cables).","zh":"（通常写作 pre-wireless）与无线通信/无线技术普及之前的时期有关的；指更早期主要依赖有线（电缆）连接的年代或方式。"},"examples":[{"en":"In the pre-wireless era, offices relied on phone cords and Ethernet cables for almost everything.","zh":"在无线普及之前的年代，办公室几乎所有事情都靠电话线和网线。"},{"en":"Some museums show pre-wireless equipment like wired microphones and early telephones.","zh":"一些博物馆会展示无线之前的设备，例如有线麦克风和早期电话。"}]}],"synonyms":["pre-cellphone","pre-digital","pre-internet","wired-era"],"phonetic":"/priːˈwaɪrləs/","extraExplanation":["这个词不是特别常见，更常见的写法是加连字符的 pre-wireless，用来做“时代/背景”式的形容（类似 pre-digital, pre-internet）。在正式写作里，你也可以直接说 “before wireless technology became widespread” 来更清楚。"]}
{"word":"prewiring","summary":{"en":"Prewiring means installing wiring in advance (or the wiring installed in advance) so equipment can be connected later.","zh":"Prewiring 指提前布线（或已提前铺设的线缆），以便日后连接设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of installing electrical or network wires in a building (often inside walls or ceilings) before the final devices, fixtures, or finishes are added.","zh":"（在安装最终设备、灯具或完成装修之前）预先在建筑物内（通常在墙体/天花板内）铺设电线或网络线的过程。"},"examples":[{"en":"Prewiring the house for internet and speakers is easier before the drywall goes up.","zh":"在安装石膏板之前为房子预埋网线和音箱线会更容易。"},{"en":"The contractor included prewiring for security cameras in the renovation plan.","zh":"承包商在改造计划中包含了为安防摄像头预布线的内容。"}]},{"partOfSpeech":"n.","definition":{"en":"The set of wires that have been installed in advance for later connection to equipment (such as lights, alarms, or speakers).","zh":"预先铺设好、用于以后连接设备（如照明、报警器、音响）的那套线缆。"},"examples":[{"en":"The prewiring is already in place, so adding extra lights will be simple.","zh":"预布线已经到位，所以加装灯具会很简单。"},{"en":"We found the prewiring behind the wall plate near the TV area.","zh":"我们在电视区域附近的墙面面板后面找到了预留的布线。"}]}],"synonyms":["rough-in wiring","prewire","structured wiring"],"phonetic":"/ˌpriːˈwaɪrɪŋ/","extraExplanation":["“Prewiring”常见于房屋建筑、装修和弱电工程（网络、音响、门禁、安防）。在中文语境里常对应“预埋（线管/线缆）”“预留布线”。","词形上来自“pre-（提前）+ wiring（布线）”。更常见的动词是“to prewire”（例如：The builder prewired the home for Ethernet）。","相关搭配：prewire for speakers/security cameras/Ethernet（为音响/摄像头/网线预布线）；prewired home（已预布线的房子）。"]}
{"word":"prewitness","summary":{"en":"“Prewitness” means to give testimony or evidence beforehand, often in religious or formal writing.","zh":"“Prewitness”指在事情发生前提前作见证或证明，常见于宗教或正式写作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to witness or testify beforehand; to give evidence in advance (often in a religious or formal context)","zh":"预先作见证；提前证明（常见于宗教或正式语境）"},"examples":[{"en":"Some early Christian writers believed the prophets prewitnessed the coming of the Messiah.","zh":"一些早期基督教作家认为先知预先为弥赛亚的到来作了见证。"},{"en":"The document was said to prewitness the agreement before it was officially signed.","zh":"据说该文件在正式签署前就已预先证明了这项协议。"}]}],"synonyms":["foretell","predict","prefigure","attest","testify"],"phonetic":"/ˌpriːˈwɪt.nəs/","extraExplanation":["“prewitness”是较少见的词，多出现在宗教写作或较古旧/正式的英语里，强调“在事件发生前就作证、预示或证明”。现代日常英语更常用“foretell”（预言）、“predict”（预测）、“testify in advance”（提前作证）或“prefigure”（预示、预表）来表达相近意思。"]}
{"word":"prewonder","summary":{"en":"“Prewonder” is a rare word meaning to wonder in advance, or the feeling of curiosity before something happens.","zh":"“prewonder”较罕见，表示“提前好奇/事先惊奇”，也可指“事情发生前的好奇感”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To wonder or feel curiosity about something in advance; to imagine with curiosity before it happens.","zh":"（罕见）在事情发生前就感到好奇、先行猜想；事先带着好奇去想象。"},"examples":[{"en":"Before the trip, she prewondered what the city would smell like after rain.","zh":"出发前，她就先好奇地想：雨后这座城市会是什么味道。"},{"en":"I’m already prewondering how the story will end.","zh":"我已经在提前好奇这个故事会怎么结尾了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, as a noun) A feeling of curiosity or wonder that comes before an event or experience.","zh":"（罕见，作名词）在某件事或体验发生之前出现的好奇与惊奇感。"},"examples":[{"en":"There was a quiet prewonder in the room before the curtain rose.","zh":"帷幕升起前，房间里有一种安静的“预先惊奇感”。"}]}],"synonyms":["wonder beforehand","wonder in advance","anticipate","be curious about"],"phonetic":"/priˈwʌndɚ/","extraExplanation":["“prewonder”不是常见词，更常见的表达是“wonder beforehand / wonder in advance / anticipate / be curious about…”。写作中如果要用它，通常带有一种文学化、自创词（neologism）的感觉；也常写作“pre-wonder”。","构词上是“pre-（在……之前）+ wonder（惊奇/好奇）”，意义一般能被读者猜到，但正式场合建议用更常见的说法。"]}
{"word":"prewonderment","summary":{"en":"Prewonderment is a rare, creative noun meaning anticipation and openness before a feeling of wonder.","zh":"prewonderment 是一个较少见的创意名词，指在产生“惊奇/赞叹”之前的期待与开放心态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/creative) A feeling of anticipation before experiencing something amazing; a sense that wonder is about to happen.","zh":"（罕见/创意用法）在经历惊奇之前的期待感；一种“惊奇即将发生”的预感。"},"examples":[{"en":"As the lights dimmed, a hush of prewonderment settled over the audience.","zh":"灯光渐暗时，观众席上弥漫着一种即将惊叹的期待。"},{"en":"She felt prewonderment walking into the museum’s new exhibit.","zh":"走进博物馆的新展厅时，她感到一种预先的惊奇期待。"}]},{"partOfSpeech":"n.","definition":{"en":"A mental state of being ready to be impressed or surprised; openness to wonder.","zh":"准备被打动或惊讶的心理状态；对惊奇保持开放。"},"examples":[{"en":"Travel often restores our prewonderment—the willingness to be amazed.","zh":"旅行常常能恢复我们的“预惊奇感”——愿意被世界惊艳的心。"},{"en":"In childhood, prewonderment comes easily.","zh":"在童年，“预惊奇感”很容易产生。"}]}],"synonyms":["anticipation","awe (anticipated)","wonder","expectancy","sense of awe"],"phonetic":"/ˌpriːˈwʌndərmənt/","extraExplanation":["“prewonderment”并不是常见的标准词汇，更像是作者/写作者创造的词（nonce word）。它由前缀 pre-（“在……之前”）+ wonderment（“惊奇、赞叹”）组成，因此读者通常会按构词法自然理解为“在惊奇发生之前的情绪/状态”。","写作中如果担心读者不熟悉，可以用连字符写作 “pre-wonderment”，或改用更常见表达：“anticipation of wonder / sense of awe to come / a feeling of impending awe”。"]}
{"word":"prework","summary":{"en":"Prework usually means preparation done before the main activity; in fitness, it can also mean a pre-workout supplement.","zh":"Prework通常指正式活动前的准备工作；在健身语境中也可指训练前补剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"work or preparation done before the main task, class, or job begins","zh":"在主要任务、课程或工作开始之前做的准备性工作"},"examples":[{"en":"Please finish the prework before the workshop so you can follow the discussion.","zh":"请在工作坊开始前完成预习/准备作业，这样你才能跟上讨论。"},{"en":"My prework for the interview included researching the company and practicing answers.","zh":"我面试前的准备包括了解公司和练习回答。"}]},{"partOfSpeech":"n.","definition":{"en":"(fitness) a pre-workout supplement taken before exercise to boost energy or focus","zh":"（健身）训练前补剂（pre-workout），在运动前服用以提升精力或专注"},"examples":[{"en":"He drinks a prework about 20 minutes before lifting weights.","zh":"他在举重前大约20分钟喝训练前补剂。"},{"en":"If you’re sensitive to caffeine, choose a low-stimulant prework.","zh":"如果你对咖啡因敏感，选低刺激（低咖啡因）的训练前补剂。"}]}],"synonyms":["prep work","preparation","pre-work","warm-up (context-dependent)","pre-workout (fitness)"],"phonetic":"/ˈpriːˌwɝːk/","extraExplanation":["“prework”在职场/学习语境里常指“课前/会前要完成的材料或任务”，更正式的说法常见于“pre-work”“prework assignment”“pre-reading”。","健身语境里更常写作“pre-workout”或口语缩写“pre”。不同品牌成分差异很大，常见含咖啡因；如果你有健康状况或对刺激物敏感，使用前最好咨询专业人士。"]}
{"word":"preworldliness","summary":{"en":"Preworldliness means a not-yet-worldly innocence or an early stage before someone becomes influenced by society and worldly concerns.","zh":"preworldliness 指“尚未世故”的天真状态，或一个人在受到社会与世俗观念影响之前的早期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being not yet worldly; innocence or simplicity before being influenced by adult society, money, or status.","zh":"“尚未世故”的状态或特质；在受成人社会、金钱或地位影响之前的天真、单纯。"},"examples":[{"en":"In her memoir, she describes her childhood preworldliness before moving to the big city.","zh":"在回忆录里，她描写了搬到大城市之前那段童年的“尚未世故”。"},{"en":"The film captures the preworldliness of the students at the start of the school year.","zh":"这部电影捕捉了学生们在学年开始时的那种“尚未世故”的气质。"}]},{"partOfSpeech":"n.","definition":{"en":"A time or stage that comes before someone becomes worldly; an early, sheltered period of life.","zh":"在变得世故之前的某个时期或阶段；人生早期较受保护的一段时光。"},"examples":[{"en":"He spoke of his preworldliness as a time when success meant simply being kind.","zh":"他谈到自己“尚未世故”的那段时光：那时成功只是意味着善良。"},{"en":"The letters preserve a sense of preworldliness that later disappears.","zh":"这些信件保留了一种“尚未世故”的感觉，而这种感觉后来消失了。"}]}],"synonyms":["innocence","naivety","naiveté","unworldliness","simplicity"],"phonetic":"/ˌpriːˈwɝːldlinəs/","extraExplanation":["“preworldliness”不是常见词，更多像是作者为了表达细微差别而临时造词（creative coinage）。它由前缀 pre-（在……之前）+ worldliness（世故、世俗、懂人情世故）构成。","语气上通常带一点文学感或怀旧感，用来强调“还没被现实打磨之前的纯真/不谙世事”。日常写作里更常用：innocence, naivety/naiveté, simplicity, being unworldly 等。"]}
{"word":"preworldly","summary":{"en":"Preworldly means “before the world (or ordinary worldly life),” a rare word used mostly in religious/philosophical contexts.","zh":"preworldly 指“在世界（或尘世生活）之前的”，是较罕见的词，多用于宗教/哲学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Existing or happening before the world as we know it, or before ordinary human life in the world (often used in religious or philosophical writing).","zh":"（罕见）指在我们所知的世界之前就存在的，或在一般人世生活之前发生的（常见于宗教或哲学语境）。"},"examples":[{"en":"Some traditions speak of a preworldly realm where souls existed before birth.","zh":"一些传统会提到一个“前世/前世界”的领域，灵魂在出生前就存在。"},{"en":"The poem imagines a preworldly silence before light and time began.","zh":"这首诗想象了光与时间开始之前的“前世界的寂静”。"}]}],"synonyms":["pre-worldly","primordial","primeval","prehuman","before creation"],"phonetic":"/ˌpriˈwɝldli/","extraExplanation":["“preworldly”非常少见，更常见的写法是带连字符的“pre-worldly”。在现代英语里，人们通常用“primeval / primordial（原初的）”“prehuman（人类出现之前的）”“before the creation（创世之前）”等更自然的表达，具体选哪个取决于你想强调“宗教创世之前”还是“地球/生命早期”。","构词：pre-（在……之前）+ worldly（世俗的/尘世的）。因此它常带有“超越尘世、尚未进入人世”的语感，和“otherworldly（超凡的、非人间的）”有一点近，但侧重点是“时间上更早”。"]}
{"word":"preworship","summary":{"en":"“Preworship” refers to what happens before the main worship service, such as music, prayer, or announcements.","zh":"“preworship”指正式敬拜开始前的环节，如音乐、祷告或通知等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Especially in churches) the time, activities, or music that happen before the main worship service begins.","zh":"（尤指教会中）正式敬拜开始之前的时间、活动或音乐（如预备心、安静、唱诗等）。"},"examples":[{"en":"The band plays soft songs during preworship to help people settle in.","zh":"乐队会在 preworship 时段演奏轻柔的歌曲，帮助大家安静下来。"},{"en":"Join us for preworship prayer at 9:30 before the service starts.","zh":"欢迎9:30参加敬拜前祷告（preworship），在聚会开始前一起预备。"},{"en":"Preworship announcements will be on the screen.","zh":"敬拜前的通知（preworship announcements）会显示在屏幕上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening before worship; related to preparation before a worship service.","zh":"发生在敬拜之前的；与敬拜前准备有关的。"},"examples":[{"en":"There will be preworship music in the lobby.","zh":"大厅里会有敬拜前音乐（preworship music）。"},{"en":"We offer a preworship quiet space for reflection.","zh":"我们提供一个敬拜前安静区，方便默想。"}]}],"synonyms":["pre-service","before worship","before the service","service warm-up"],"phonetic":"/ˌpriːˈwɝːʃɪp/","extraExplanation":["“preworship”不是非常标准或普遍的通用英语词，更多见于教会内部通知、流程安排或事工用语中。更常见、更自然的表达包括：“before worship / before the service / pre-service (music, prayer, announcements)”等。","构词上由前缀“pre-（在……之前）”+“worship（敬拜）”组成，含义通常不带贬义，强调“预备、进入状态”。"]}
{"word":"preworthily","summary":{"en":"A very rare adverb meaning “in a praiseworthy way.”","zh":"一个非常少见的副词，意为“以值得称赞的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare) In a way that deserves praise; commendably.","zh":"（非常少见）以值得称赞的方式；可嘉地。"},"examples":[{"en":"She handled the conflict preworthily, staying calm and fair to everyone.","zh":"她以可嘉的方式处理了冲突，保持冷静，并公平对待每个人。"},{"en":"The team worked preworthily under pressure and finished the project on time.","zh":"团队在压力下表现可嘉，按时完成了项目。"}]}],"synonyms":["commendably","admirably","praiseworthily"],"phonetic":"/ˌpriˈwɝðəli/","extraExplanation":["“preworthily”在现代英语中几乎不使用，很多词典也不收录。它看起来像由 preworthy（“值得称赞的”）+ -ly 构成，意思接近 praiseworthily / commendably。正式写作里更建议用更常见的“commendably（可嘉地）”或“admirably（令人钦佩地）”。"]}
{"word":"preworthiness","summary":{"en":"A rare word meaning “assumed or recognized worthiness in advance.”","zh":"一个罕见词，指“在事前被假定或承认的值得性/应得性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The quality of being worthy *before* something happens—e.g., being considered deserving in advance, often before proof, experience, or a final decision.","zh":"（罕见、非标准用法）指在某事发生之前就被认为“值得/配得上”的品质或状态，例如在证据、经历或最终决定之前就被视为应得。"},"examples":[{"en":"Some critics argued the prize was given based on the author’s preworthiness rather than the book itself.","zh":"一些评论者认为，这个奖更多是基于作者“事先被认定的价值”（preworthiness），而不是基于这本书本身。"},{"en":"Treating someone’s preworthiness as a fact can make evaluations unfair.","zh":"把某人的“预先的值得性”（preworthiness）当作事实，可能会让评估变得不公平。"}]}],"synonyms":["worthiness","merit","deservingness","presumed merit","prior qualification"],"phonetic":"ˌpriˈwɝðinəs","extraExplanation":["“preworthiness”在现代英语中非常少见，很多词典不收录，常见写法通常是“worthiness”（值得、应得）或用更自然的表达，如“assumed merit”（被预设的优点/功劳）、“prior qualifications”（既有资历）、“presumed deservingness”（被认为应得）。","构词上可理解为“pre-（在……之前）+ worthiness（值得性）”。因为语感偏“临时造词/理论化用词”，更常见于批评性写作、学术讨论或修辞中，用来强调“在证据之前就先认可”的倾向。"]}
{"word":"preworthy","summary":{"en":"Praiseworthy means deserving praise or admiration.","zh":"Praiseworthy 指“值得称赞/值得表扬的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Deserving praise; good enough to be admired or approved of.","zh":"值得称赞的；可嘉的；值得认可的。"},"examples":[{"en":"Her patience with the children is truly praiseworthy.","zh":"她对孩子们的耐心确实值得称赞。"},{"en":"It’s praiseworthy that he admitted his mistake and apologized.","zh":"他承认错误并道歉，这一点很可嘉。"},{"en":"The team made a praiseworthy effort, even though they lost.","zh":"尽管输了，团队的努力仍然值得肯定。"}]}],"synonyms":["commendable","admirable","laudable","worthy","creditable"],"phonetic":"/ˈpreɪzˌwɝːði/","extraExplanation":["你输入的“preworthy”在英语中不常见，通常是把 **praiseworthy** 拼错了（更标准、更常用）。","构词：**praise**（赞美）+ **-worthy**（值得……的）。类似表达还有 **trustworthy**（值得信赖的）、**newsworthy**（有新闻价值的）。","语气与场景：**praiseworthy** 比 “good” 更正式、更强调“值得公开表扬/肯定”，常用于写作、演讲、评价。"]}
{"word":"prewound","summary":{"en":"Prewound means already wound in advance, especially a spring-driven device like a watch.","zh":"prewound 指“预先上好发条/已上弦的”，常用于手表等弹簧驱动装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wound in advance (already wound before being used), especially of a spring-driven device like a watch or toy.","zh":"预先上好发条的；（使用前）已上弦的（尤指手表、玩具等靠弹簧驱动的装置）。"},"examples":[{"en":"This prewound watch can run for about 40 hours without winding.","zh":"这块预先上好发条的手表不用再上弦也能走大约40小时。"},{"en":"The toy comes prewound, so it starts moving as soon as you set it down.","zh":"这个玩具出厂时已经上好发条，所以你一放下它就会动起来。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “prewind”: to wind something ahead of time.","zh":"“prewind”的过去式/过去分词：提前给某物上发条（或绕线）。"},"examples":[{"en":"The technician prewound the mechanism before shipping it.","zh":"技术员在发货前先把装置上好发条。"},{"en":"Make sure the spring is prewound to the correct tension.","zh":"确保弹簧已按正确的张力预先上好。"}]}],"synonyms":["pre-wound","already wound","pre-winded (less common)"],"phonetic":"ˌpriˈwaʊnd","extraExplanation":["“prewound”在日常中最常见于产品说明，尤其是机械表（mechanical watch）、发条玩具（wind-up toy）或某些计时/机械装置。它强调“出厂或使用前就已经上弦”，区别于你自己手动上弦（wind it up）。","拼写提示：wound 在这里读 /waʊnd/（像“wownd”），表示“上发条/缠绕”的过去分词；不要和表示“伤口”的 wound /wuːnd/ 混淆。"]}
{"word":"prewrap","summary":{"en":"Prewrap means to wrap something ahead of time, or a pre-wrapped item sold/displayed in stores.","zh":"prewrap 指提前包裹/预先包装；也可指商店里预先包装好的商品。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wrap something in advance, especially before selling, storing, shipping, or cooking","zh":"（提前）包裹；预先包装（尤指在出售、储存、运输或烹饪前）"},"examples":[{"en":"The butcher prewraps the meat in plastic for quick checkout.","zh":"肉铺把肉提前用塑料包好，方便顾客快速结账。"},{"en":"You can prewrap the sandwiches the night before the trip.","zh":"你可以在出发前一晚把三明治先包好。"}]},{"partOfSpeech":"n.","definition":{"en":"a package or item that has been wrapped in advance (often for retail display)","zh":"预先包装好的商品；预包装（常用于零售陈列）"},"examples":[{"en":"The store moved the prewraps to the refrigerated case.","zh":"商店把预包装好的商品移到了冷藏柜里。"},{"en":"I grabbed a prewrap instead of asking for it to be wrapped fresh.","zh":"我直接拿了一个预包装的，而没有要求现包。"}]}],"synonyms":["prepackage","pre-pack","package ahead of time","wrap in advance"],"phonetic":"/ˌpriːˈræp/","extraExplanation":["“prewrap”在零售和食品行业里更常见，尤其指把肉类、熟食、蔬果等提前包好并贴上标签、价格，方便陈列与结账。写法也常见作“pre-wrap”（加连字符）。在正式写作中，有时会用更通用的说法如“prepackage / pre-pack”。"]}
{"word":"prewrapped","summary":{"en":"Prewrapped means already wrapped or packaged beforehand.","zh":"prewrapped 指“已经预先包好/提前包装好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wrapped in advance (already covered or packaged before being sold or used).","zh":"预先包好的；事先包装好的（在出售或使用前就已包裹/包装）。"},"examples":[{"en":"The sandwiches are prewrapped and ready to grab.","zh":"这些三明治都已经预先包好，随手就能拿。"},{"en":"For safety, the clinic provides prewrapped sterile tools.","zh":"为安全起见，诊所提供预先包装好的无菌器械。"}]}],"synonyms":["pre-packaged","ready-wrapped","packaged","wrapped"],"phonetic":"/priˈræpt/","extraExplanation":["“pre-”是前缀，表示“在……之前/预先”。因此 prewrapped 强调“不是现场包”，而是“提前就包好”。常见于食品、一次性用品、医疗用品、快消品包装等语境。","拼写上也常见作 pre-wrapped（加连字符），意思相同；作形容词更常见。"]}
{"word":"prewrapping","summary":{"en":"Prewrapping means wrapping something beforehand as a protective or preparatory first layer.","zh":"prewrapping 指“预先包裹/预包”，常作为保护或准备的第一层包裹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of wrapping something in advance, especially as a preparatory step before another wrapping, taping, or packaging process","zh":"预先包裹；预包（指在正式缠绕、贴扎或包装之前先进行的包裹步骤）"},"examples":[{"en":"The trainer used prewrapping to protect the athlete’s skin before applying athletic tape.","zh":"教练先用预包来保护运动员的皮肤，然后再贴运动胶布。"},{"en":"Prewrapping the fragile parts can prevent scratches during shipping.","zh":"先把易碎部位预先包裹起来，可以减少运输中的刮擦。"}]},{"partOfSpeech":"v.","definition":{"en":"wrapping something ahead of time; to wrap first as preparation","zh":"预先包裹（作为动词用法：先包起来，为后续处理做准备）"},"examples":[{"en":"We’re prewrapping the cables to keep them organized before installation.","zh":"我们先把电缆预先缠好，便于安装前整理。"}]}],"synonyms":["pre-wrap","prewrap","preliminary wrapping","protective wrap"],"phonetic":"/ˌpriːˈræpɪŋ/","extraExplanation":["“prewrapping”常见于运动防护与医疗场景：先用一层薄的泡棉/底衬（有时也叫 pre-wrap）包在皮肤上，再贴运动胶布或绷带，以减少摩擦、过敏或撕拉毛发的不适。","在包装语境里，它强调“正式包装前的第一层保护”，例如先用气泡膜/软纸包住边角，再放入箱中并加固。"]}
{"word":"prewraps","summary":{"en":"Prewraps can mean items wrapped ahead of time, or the action of wrapping something in advance.","zh":"prewraps 可指“提前包好的物品”，也可指“预先包裹（的动作）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that are wrapped in advance (for example, food or products prepared and packaged before being sold or stored).","zh":"预先包好的物品（例如提前包装好的食物或商品）。"},"examples":[{"en":"The deli keeps prewraps in the cooler to speed up lunch orders.","zh":"熟食店把预先包好的食品放在冷柜里，以加快午餐出单速度。"},{"en":"Please label the prewraps with today’s date.","zh":"请在这些预先包好的物品上标注今天的日期。"}]},{"partOfSpeech":"v.","definition":{"en":"wraps in advance; prepares something by wrapping it before it is needed.","zh":"预先包裹；提前把某物包好以备后用。"},"examples":[{"en":"She prewraps the sandwiches in the morning for the afternoon meeting.","zh":"她早上就把三明治提前包好，准备下午的会议。"},{"en":"He prewraps gifts to save time during the holidays.","zh":"他会提前把礼物包好，节日期间就能省时间。"}]}],"synonyms":["prepackaged items","wrapped items","package in advance","wrap ahead of time"],"phonetic":"/ˌpriːˈræps/","extraExplanation":["在一些地区的口语或特定行业里，pre-wraps / prewraps 也可能指“预卷好的烟”（例如预先卷好的大麻烟或卷烟产品）。这种用法带有明显的地域与行业色彩，正式写作中更常见的说法是 pre-rolled joints / pre-rolls。"]}
{"word":"prewritten","summary":{"en":"Prewritten means written ahead of time, before being used or spoken.","zh":"prewritten 指“预先写好的”，在使用或发表之前就已写成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"written in advance (before it is used, spoken, or needed).","zh":"预先写好的；事先写成的（在使用、发表或需要之前就写好）。"},"examples":[{"en":"The teacher gave us a prewritten outline to help us organize our essay.","zh":"老师给了我们一份预先写好的提纲，帮助我们组织文章。"},{"en":"He used a prewritten speech, but he added a few personal stories.","zh":"他用了事先写好的演讲稿，但又加了一些个人故事。"},{"en":"Some customer-service replies are prewritten to save time.","zh":"一些客服回复是预先写好的，以节省时间。"}]}],"synonyms":["prepared","ready-made","prefabricated","canned (informal)"],"phonetic":"/priˈrɪtən/","extraExplanation":["“prewritten”由前缀 pre-（“在……之前”）+ written（write 的过去分词）构成，强调“提前准备好文本”。","有时也写作带连字符的形式 “pre-written”，两种都常见；在正式写作中保持一种写法一致即可。"]}

