{"word":"proa","summary":{"en":"A proa is a traditional Pacific/Southeast Asian canoe or small sailing boat, often stabilized by an outrigger.","zh":"proa 指太平洋/东南亚的传统独木舟或小型帆船，常靠侧浮木（外伸浮体）保持稳定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of canoe or small sailing boat used in the Pacific and Southeast Asia, often with an outrigger to keep it stable","zh":"一种太平洋与东南亚地区常见的独木舟或小型帆船，常带有侧浮木（支架/外伸浮体）以保持稳定"},"examples":[{"en":"The fishermen set out at dawn in a proa with an outrigger.","zh":"渔民清晨乘着带侧浮木的 proa 出海。"},{"en":"We watched a traditional proa sail across the lagoon.","zh":"我们看着一艘传统的 proa 穿过泻湖航行。"}]}],"synonyms":["outrigger canoe","canoe","sailing canoe","pra(u) (variant spelling)"],"phonetic":"/ˈproʊ.ə/","extraExplanation":["“Proa”常见于航海与人类学语境，指密克罗尼西亚（如关岛、马里亚纳群岛）等地的传统帆船，外形轻快、适合在岛屿间航行。","词源与拼写有变体：英语里的 proa 与 prau 都出现过，和马来语/印尼语的船只词（如 prahu）有关。不同地区的“proa”结构可能差异很大，但“带支撑结构、适合近海或岛间航行”的概念最常见。","阅读时注意不要和 “prow”（船首）混淆：prow /praʊ/ 是船的前端，而 proa /ˈproʊ.ə/ 是一种船的类型。"]}
{"word":"proabolition","summary":{"en":"Pro-abolition means supporting the ending (abolition) of something, especially slavery.","zh":"pro-abolition 指支持废除（终止）某事物，尤常指历史上的支持废奴立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the abolition (ending) of something, especially slavery in historical contexts.","zh":"支持“废除”（终止）某事物的；尤指历史语境中支持废奴的。"},"examples":[{"en":"Many pro-abolition activists worked for years to end slavery.","zh":"许多支持废奴的活动人士多年努力争取终结奴隶制度。"},{"en":"The newspaper took a pro-abolition stance during the debate.","zh":"那家报纸在辩论期间采取了支持废除的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports abolition (often used as a noun phrase).","zh":"支持废除的人或团体（常以名词短语方式使用）。"},"examples":[{"en":"Pro-abolition leaders organized petitions and speeches.","zh":"支持废除的领袖组织请愿与演讲。"}]}],"synonyms":["anti-slavery","abolitionist","for abolition"],"phonetic":"/ˌproʊ ˌæbəˈlɪʃən/","extraExplanation":["“proabolition”更常见的拼写是 **pro-abolition**（带连字符），表示“支持废除……”。在美国历史里，它经常与 **abolitionism（废奴主义）** 一起出现，指支持废除奴隶制度的立场或人群。","相关表达：**anti-slavery**（反奴隶制），**abolitionist**（废奴主义者/废奴主义的），**pro-emancipation**（支持解放奴隶的）。"]}
{"word":"proabolitionist","summary":{"en":"Pro-abolitionist means supporting (or being) someone who supports the abolition of slavery; commonly tied to historical anti-slavery movements.","zh":"pro-abolitionist 指支持废除奴隶制度（或支持者本人），常与历史上的反奴隶制/废奴运动相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the movement to end slavery (especially in the 18th–19th centuries); favoring abolition.","zh":"支持废除奴隶制度（尤指18—19世纪的废奴运动）；主张废奴的。"},"examples":[{"en":"Many pro-abolitionist newspapers criticized slavery openly.","zh":"许多支持废奴的报纸公开批评奴隶制度。"},{"en":"Her family held strong pro-abolitionist beliefs.","zh":"她的家庭有强烈的废奴立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports abolition, especially the abolition of slavery; an abolitionist.","zh":"支持废除（尤指废除奴隶制度）的人；废奴主义者。"},"examples":[{"en":"Pro-abolitionists organized meetings and petitions to end slavery.","zh":"废奴支持者组织集会并发起请愿，要求终结奴隶制度。"},{"en":"He was known as a pro-abolitionist voice in his community.","zh":"他在社区中以支持废奴的声音而闻名。"}]}],"synonyms":["abolitionist","anti-slavery","emancipationist"],"phonetic":"/ˌproʊ ˌæbəˈlɪʃənɪst/","extraExplanation":["“pro-abolitionist”由前缀 pro-（支持）+ abolitionist（废奴主义者）构成，常用于历史语境（如美国内战前的“废奴运动”）。现代英语里更常直接说 abolitionist；“pro-abolitionist”强调“立场/倾向”。","在英美历史中，abolition/abolitionism最常指“废除奴隶制”；在其他语境也可指废除某种制度（如废除死刑 abolition of the death penalty），但“abolitionist/pro-abolitionist”一词在未加说明时通常默认与奴隶制相关。"]}
{"word":"proabortion","summary":{"en":"“Pro-abortion” means supporting abortion rights, but it is often a loaded term; “pro-choice” is more commonly used by supporters.","zh":"“pro-abortion”指支持堕胎权/堕胎合法化，但常带立场色彩；支持者更常用“pro-choice（支持选择权）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the legal right to have an abortion (often used by opponents; many supporters prefer “pro-choice”)","zh":"支持堕胎合法权利的；（常被反对者使用的说法；许多支持者更倾向用“pro-choice/支持选择权”）"},"examples":[{"en":"Some people describe themselves as pro-choice rather than pro-abortion.","zh":"有些人更愿意称自己是“pro-choice（支持选择权）”，而不是“pro-abortion”。"},{"en":"The article compared pro-abortion and anti-abortion arguments in a courtroom case.","zh":"这篇文章在一宗庭审案件中比较了支持与反对堕胎的论点。"}]}],"synonyms":["pro-choice","supports abortion rights","in favor of legal abortion"],"phonetic":"/ˌproʊ əˈbɔrʃən/","extraExplanation":["“pro-abortion”在英语公共讨论中带有较强立场色彩，常被用来暗示“赞成/鼓励堕胎”，因此可能让一部分支持堕胎合法权利的人感到不准确或带有偏见。较中性或更常见的表达是“pro-choice”（强调个人选择权）与“anti-abortion”或“pro-life”（反对堕胎、强调生命权）。","书写上常见为“pro-abortion”（带连字符）；也能见到“proabortion”，但较不规范。正式写作中，建议根据语境选用更精准的词：讨论权利与法律可用“pro-choice / supports abortion rights”，讨论政策限制可用“abortion restrictions / abortion access”。"]}
{"word":"proabortionist","summary":{"en":"“Pro-abortionist” refers to a person (or stance) that supports abortion rights and the legal option of abortion.","zh":"“Pro-abortionist”指支持堕胎权、支持堕胎合法选择的人（或立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports the legal right to have an abortion; someone who is in favor of abortion rights","zh":"支持堕胎合法权利的人；主张堕胎权的人"},"examples":[{"en":"She identifies as a pro-abortionist and campaigns for access to reproductive healthcare.","zh":"她自认是支持堕胎权的人，并为获得生殖医疗服务的机会而倡议。"},{"en":"The article compared pro-abortionist and anti-abortion groups’ arguments.","zh":"这篇文章比较了支持堕胎权者与反堕胎团体的论点。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting abortion rights","zh":"支持堕胎权的；主张堕胎合法的"},"examples":[{"en":"Some voters described the candidate’s platform as pro-abortionist.","zh":"一些选民把这位候选人的政纲描述为支持堕胎权的。"}]}],"synonyms":["pro-choice (more common)","abortion-rights supporter","abortion-rights advocate"],"phonetic":"/ˌproʊ əˈbɔrʃənɪst/","extraExplanation":["“proabortionist”更常见的写法是“pro-abortionist”（带连字符），在新闻与学术语境中更常用“pro-choice”（支持选择权）或“abortion-rights advocate”（堕胎权倡议者）。","这个词在公共讨论中可能带有强烈立场色彩；若想更中性，可以用“supports abortion rights / supports legal abortion”（支持堕胎权/支持堕胎合法）。"]}
{"word":"proabsolutism","summary":{"en":"Proabsolutism means support for absolutism—favoring unlimited power for a ruler or government.","zh":"proabsolutism 指支持专制主义，即主张统治者或政府拥有几乎无限的权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"support for absolutism, the belief that a ruler or government should have unlimited power","zh":"支持“专制主义/君主专制”的立场，即认为统治者或政府应拥有几乎不受限制的权力"},"examples":[{"en":"Some pamphlets from the period openly argued for proabsolutism to restore order.","zh":"那个时期的一些小册子公开主张支持专制主义，以恢复秩序。"},{"en":"The novel portrays a proabsolutism faction that fears social change more than oppression.","zh":"这部小说描写了一个支持专制主义的派系，他们对社会变革的恐惧超过了对压迫的担忧。"}]}],"synonyms":["pro-absolutism","support for absolutism","absolutist sympathies","royalist (context-dependent)"],"phonetic":"/ˌproʊˈæbsəluˌtɪzəm/","extraExplanation":["“proabsolutism”通常写作“pro-absolutism”，其中前缀 pro- 表示“支持……的”。这是历史与政治学语境中的用法，常用来描述某个人、团体或思想“倾向/拥护君主专制”。","“absolutism（专制主义）”常与17—18世纪欧洲的君主制联系在一起（如路易十四时代的法国），强调权力高度集中、对议会与地方权力的限制。与之相对的常见概念有“constitutionalism（宪政主义）”“limited government（有限政府）”。","在学术写作中也可用更常见的表达替代：“support for absolutism”“absolutist sympathies（专制同情/倾向）”。"]}
{"word":"proabsolutist","summary":{"en":"Proabsolutist (more commonly pro-absolutist) means supporting absolutism or someone who supports it.","zh":"proabsolutist（更常写作 pro-absolutist）指“支持专制政治的”，也可指“支持专制的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting political absolutism (the idea that a ruler or government should have unlimited power).","zh":"支持政治专制（主张统治者或政府应拥有不受限制的权力）。"},"examples":[{"en":"Some pro-absolutist writers argued that strong, centralized rule would prevent chaos.","zh":"一些支持专制的作家认为，强有力的中央集权统治可以防止混乱。"},{"en":"The historian compared pro-absolutist and pro-democracy arguments in the same period.","zh":"这位历史学家比较了同一时期支持专制与支持民主的论点。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports political absolutism.","zh":"支持政治专制的人。"},"examples":[{"en":"During the debate, a pro-absolutist defended the king’s right to rule without limits.","zh":"在辩论中，一位支持专制的人为国王不受限制的统治权辩护。"}]}],"synonyms":["pro-absolutism","absolutist","pro-authoritarian"],"phonetic":"/ˌproʊˈæbsəˌluːtɪst/","extraExplanation":["这个词更常以带连字符的形式出现：pro-absolutist。前缀 pro- 表示“支持……的”。","absolutism 常见于历史语境，尤其是讨论17—18世纪欧洲君主制（如法国路易十四时期）时。日常英语里更常用 authoritarian（威权的）来形容类似倾向，但两者不完全等同：absolutism 更强调“合法的、无约束的最高权力”这一政治理论背景。"]}
{"word":"proabstinence","summary":{"en":"Pro-abstinence describes ideas, programs, or people that promote abstaining (often from sex or from alcohol/drugs).","zh":"pro-abstinence 用来形容主张或推动“禁欲/戒断”（常指禁欲或不饮酒/不吸毒）的观点、项目或人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or promoting abstinence (often meaning not having sex, or not using alcohol/drugs).","zh":"支持或提倡“禁欲/戒断”（常指不发生性行为，或不饮酒/不吸毒）。"},"examples":[{"en":"Some schools teach a pro-abstinence approach in sex education.","zh":"一些学校在性教育中采用提倡禁欲的方式。"},{"en":"The campaign’s message was strongly pro-abstinence and focused on saying no.","zh":"这场宣传的信息非常强调禁欲/戒断，重点在于学会拒绝。"}]}],"synonyms":["abstinence-promoting","abstinence-focused","teetotal (alcohol only)"],"phonetic":"/ˌproʊ ˈæb.stə.nəns/","extraExplanation":["“pro-”是前缀，表示“支持、赞成”（如 pro-choice 支持选择权；pro-environment 支持环保）。因此 pro-abstinence 直译为“支持 abstinence 的”。","在英语里更常见的写法是带连字符的 pro-abstinence；也可能写成 pro abstinence（较少）或 proabstinence（不常见，容易被视为拼写不规范）。","语境上，pro-abstinence 常见于公共政策、宗教讨论与健康教育（如“abstinence-only education”=“只讲禁欲的性教育”）。用词时注意中性表达，避免对不同价值观作评判。"]}
{"word":"proacademic","summary":{"en":"Proacademic means favoring or supporting academic learning and scholarly standards.","zh":"proacademic 指“偏向或支持学术学习与学术标准”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring academic study, universities, or scholarly standards (often used in debates about education policy or school culture).","zh":"支持或偏向学术学习、大学或学术标准的（常用于教育政策或学校文化的讨论中）。"},"examples":[{"en":"The mayor’s proacademic plan increases funding for libraries and research programs.","zh":"市长这项偏向学术的计划增加了对图书馆和科研项目的经费支持。"},{"en":"Some parents prefer a proacademic school environment with more homework and exam preparation.","zh":"有些家长更喜欢偏学术的学校氛围，作业更多、考试准备更充分。"},{"en":"Critics said the curriculum was too proacademic and didn’t teach enough practical skills.","zh":"批评者说课程太偏学术，没有教足够的实用技能。"}]}],"synonyms":["pro-academic","academically oriented","scholarly","education-focused"],"phonetic":"/ˌproʊˌækəˈdɛmɪk/","extraExplanation":["“pro-” 是英语里常见的前缀，表示“支持、赞成”（如 pro-democracy 亲民主的、pro-choice 支持选择权的）。因此 proacademic 通常可理解为 “pro-academic”。","该词不是最常见的标准词条；正式写作中更常见的表达是 “pro-academic” 或 “academically oriented（偏学术的）”。"]}
{"word":"proaccelerin","summary":{"en":"“Proaccelerin” is not a recognized standard English word; it likely needs clarification or correction.","zh":"“proaccelerin”不是常见标准英语词，通常需要核对语境或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a made-up term, or a proprietary/brand name used in a specific field.","zh":"不是标准英语词；可能是拼写错误、杜撰词，或某个专业领域里的专有名词/商品名。"},"examples":[{"en":"I can’t find “proaccelerin” in standard English dictionaries—could you share the sentence you saw it in?","zh":"我在常见英语词典里找不到“proaccelerin”——你能把它出现的句子发我吗？"},{"en":"If you meant “acceleration,” the word describes an increase in speed or rate.","zh":"如果你想写的是“acceleration”，它指“速度或变化率的增加/加速”。"}]}],"synonyms":["acceleration","accelerate"],"phonetic":"/ˌproʊækˈsɛlərɪn/","extraExplanation":["“proaccelerin”看起来像由前缀 pro-（“促进/支持”）+ acceler-（“加速”）组成，但这种拼法在标准英语里不常见。","如果你是在药品、保健品、运动补剂或科研材料里看到它，它可能是产品名或内部术语；这种词通常不收录在普通词典中。","把原句、来源链接或你想表达的中文意思发来，我可以帮你判断最可能的正确词（例如 acceleration / accelerate / pro-accelerant 等）并给出准确用法。"]}
{"word":"proacceptance","summary":{"en":"Pro-acceptance means supporting acceptance and inclusion; it’s a relatively uncommon, context-based label.","zh":"pro-acceptance 指“支持接纳与包容”，属于较不常见、依语境而生的标签式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting acceptance (especially social acceptance, inclusion, or welcoming attitudes toward a person or group).","zh":"支持“接纳/包容”（尤其指对某个人或群体的社会接纳、融合与欢迎态度）。"},"examples":[{"en":"The school adopted a pro-acceptance policy to reduce bullying.","zh":"学校采取了支持接纳的政策，以减少霸凌。"},{"en":"Her talk promoted a pro-acceptance message about mental health.","zh":"她的演讲传达了关于心理健康的“支持接纳”的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A pro-acceptance stance or movement (used as a label for an idea or approach).","zh":"支持接纳的立场或理念（作为一种观点/路线的标签来使用）。"},"examples":[{"en":"Their campaign is built around pro-acceptance and respect.","zh":"他们的活动以支持接纳与尊重为核心。"}]}],"synonyms":["inclusive","acceptance-focused","pro-inclusion","welcoming","supportive"],"phonetic":"/ˌproʊ əkˈsɛptəns/","extraExplanation":["“proacceptance / pro-acceptance”并不是非常固定的词条，更常见的写法是加连字符的“pro-acceptance”，表示“支持……的”。它属于比较新的、语境驱动的表达，常出现在校园文化、心理健康、DEI（多元、平等、包容）等主题中。","更地道的替代表达：acceptance-focused（以接纳为导向的）、pro-inclusion（支持包容/融入的）、inclusive（包容的）、welcoming（友好的、欢迎的）。"]}
{"word":"proach","summary":{"en":"“Proach” is a rare/archaic form meaning “approach.” In modern English, use “approach” instead.","zh":"“proach”是很少见的古体形式，意思是“approach（接近/接洽）”。现代英语中建议用“approach”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare/archaic) to approach; to come near or nearer to someone or something.","zh":"（罕见/古体）接近；靠近（相当于 approach）。"},"examples":[{"en":"As we proached the village, the road became narrower.","zh":"当我们靠近村庄时，道路变得更窄了。"},{"en":"He proached the door quietly and listened.","zh":"他悄悄走近门口听了听。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) to approach (someone) in order to speak to them or deal with them.","zh":"（罕见/古体）接洽；走近（某人）以便交谈或处理事情。"},"examples":[{"en":"She proached the manager with a question.","zh":"她走近经理问了一个问题。"},{"en":"They proached the topic carefully.","zh":"他们小心翼翼地切入这个话题。"}]}],"synonyms":["approach","come near","draw near","near","advance toward"],"phonetic":"/proʊtʃ/","extraExplanation":["“proach”在现代英语中非常少见，多数情况下是古体/方言用法，或是把“approach”误拼、误写后出现的形式。日常写作与考试中建议使用更标准的“approach”。","常见搭配（用 approach）：approach a problem（处理问题）、approach someone（和某人接洽）、as we approach…（当我们接近……）。"]}
{"word":"proacquisition","summary":{"en":"Proacquisition means supportive of acquisitions, especially company buyouts as a growth strategy.","zh":"proacquisition 指“支持并购/收购”的立场或策略，常用于商业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting acquisitions (especially in business, such as one company buying another)","zh":"支持并购的；倾向于通过收购（尤其指企业并购）来发展"},"examples":[{"en":"The CEO is known for a proacquisition strategy to expand into new markets.","zh":"这位CEO以支持并购的策略闻名，用来拓展新市场。"},{"en":"Some investors prefer a proacquisition approach, while others want the company to grow organically.","zh":"有些投资者更偏好并购导向的做法，而另一些人希望公司靠内生增长。"},{"en":"The board took a proacquisition stance after the competitor announced a merger.","zh":"竞争对手宣布合并后，董事会采取了支持并购的立场。"}]}],"synonyms":["pro-M&A","acquisition-friendly","in favor of acquisitions","pro-buyout"],"phonetic":"/ˌproʊˌækwɪˈzɪʃən/","extraExplanation":["“proacquisition”更常见的写法是带连字符的“pro-acquisition”，在商业新闻、投行报告、公司战略讨论中更常用。","这里的“acquisition”通常指企业并购（M&A）中的“收购”，不是日常意义上的“获得/习得”。","如果你想表达“支持企业被收购（卖给别人）”，也可以用“open to being acquired / receptive to an acquisition offer”等更自然的说法，具体看语境。"]}
{"word":"proacquittal","summary":{"en":"Proacquittal means “favoring acquittal” (a not-guilty outcome), mainly used in legal contexts.","zh":"proacquittal 指“倾向于宣告无罪/支持无罪判决”，主要用于法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring a verdict of “not guilty” (acquittal), especially in a legal or judicial context.","zh":"（尤指在法律/司法语境中）倾向于无罪判决（宣告无罪）的；支持判无罪的。"},"examples":[{"en":"The defense argued that the judge should give proacquittal instructions when the evidence is ambiguous.","zh":"辩方主张：当证据含糊时，法官应给予更偏向无罪的陪审团指示。"},{"en":"Some critics said the policy created a proacquittal tilt in close cases.","zh":"一些批评者说，这项政策在势均力敌的案件中造成了偏向无罪的倾向。"}]}],"synonyms":["pro-defendant","defendant-friendly","favoring acquittal","acquittal-oriented"],"phonetic":"/ˌproʊ.əˈkwɪt̬.əl/","extraExplanation":["“pro-”表示“支持/有利于……”，acquittal 是“宣告无罪”。因此 proacquittal 常见于法律写作或学术讨论，用来描述某种规则、推定、证据标准或制度设计在不确定时更倾向于“判无罪”。","该词并不算日常英语常用词，更常见的表达是 “favoring acquittal / pro-defendant / defendant-friendly（偏向被告）”。在正式写作中也可能写作 “pro-acquittal”。"]}
{"word":"proacting","summary":{"en":"Proacting means taking initiative early to prevent problems or create better outcomes, rather than just reacting.","zh":"Proacting 指提前主动采取行动，以预防问题或创造更好结果，而不是仅在事后被动反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"taking initiative by acting in advance to shape events, rather than only responding after something happens; proactive behavior","zh":"主动采取行动、提前应对以影响结果，而不是等事情发生后才反应；主动性行为"},"examples":[{"en":"She’s proacting by setting weekly goals before the busy season starts.","zh":"她在旺季开始前就设定每周目标，这是在主动应对。"},{"en":"Proacting at work can prevent small problems from becoming big ones.","zh":"在工作中主动采取行动可以防止小问题变成大问题。"},{"en":"Instead of waiting for complaints, the team is proacting by improving the service now.","zh":"团队没有等投诉出现，而是现在就主动改进服务。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of taking initiative in advance; behaving proactively","zh":"主动提前行动的做法；以主动方式行事"},"examples":[{"en":"Proacting is a habit you can build through planning and regular check-ins.","zh":"主动行动是一种可以通过计划和定期复盘培养的习惯。"},{"en":"Their proacting saved time and reduced stress later.","zh":"他们的主动行动节省了时间，也减少了后续压力。"}]}],"synonyms":["proactive","taking initiative","anticipatory","forward-looking","preemptive"],"phonetic":"/proʊˈæktɪŋ/","extraExplanation":["“proacting”常见于职场、管理与自我成长语境，强调“先行动、先预防”。它常与“reacting（被动反应）”对比：reacting 是事情发生后再处理；proacting 是提前准备、主动影响局面。","在《高效能人士的七个习惯》（Stephen R. Covey）中，“Be Proactive（积极主动）”是核心概念之一；因此该词在个人效率与领导力课程中使用频率较高。","形式上它来自动词“proact”，但在日常英语里“proactive / proactively / taking initiative”更常见；“proacting”多作为形容词或名词化用法出现在培训材料或企业写作中。"]}
{"word":"proaction","summary":{"en":"Proaction means initiating action ahead of time rather than reacting.","zh":"Proaction 指提前主动行动，而不是被动反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Taking action in advance; an action started by yourself rather than as a response to something else (the opposite of reaction).","zh":"主动采取行动；由自己发起、不是被动回应他人的行动（与 reaction 相对）。"},"examples":[{"en":"Good leaders practice proaction instead of waiting for problems to appear.","zh":"优秀的领导者会主动行动，而不是等问题出现。"},{"en":"Her proaction saved the team a lot of time during the project.","zh":"她的主动作为在项目中为团队节省了很多时间。"}]},{"partOfSpeech":"n.","definition":{"en":"In some psychological and self-help contexts, the idea of choosing your response based on values and goals, rather than reacting emotionally or automatically.","zh":"在一些心理学与自我成长语境中，指基于价值观与目标来做选择，而不是情绪化或自动化地“反应”。"},"examples":[{"en":"The workshop taught proaction: pause, think, and then choose what matters most.","zh":"这场工作坊教的是“主动选择”：先暂停、再思考，然后选择最重要的事。"},{"en":"With proaction, he focused on what he could control instead of blaming others.","zh":"通过主动选择，他把注意力放在自己能控制的事情上，而不是指责别人。"}]}],"synonyms":["initiative","proactive behavior","taking initiative","anticipatory action"],"phonetic":"/proʊˈækʃən/","extraExplanation":["“Proaction”由前缀 pro-（“向前、提前”）+ action（“行动”）构成，强调“先行一步”。在职场沟通里常与 “proactive” 同族，用来赞美“有担当、能预判并提前解决问题”的行为。","在英文中更常见的表达通常是 “proactive behavior / taking initiative”。“Proaction”这个名词在一般口语中不如这些说法常用，但在管理培训、心理学或自我成长写作里会更常出现。"]}
{"word":"proactive","summary":{"en":"Proactive means taking action early—preventing problems and showing initiative instead of waiting to react.","zh":"Proactive 指“提前主动行动”，重在预防问题、展现主动性，而非事后被动反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Acting in advance to prevent problems or to make something happen, rather than reacting after something happens.","zh":"主动采取行动（提前预防问题或促成结果），而不是等事情发生后才被动应对。"},"examples":[{"en":"She is proactive about her health, scheduling checkups before any issues appear.","zh":"她对健康很主动，会在问题出现前就安排体检。"},{"en":"A proactive approach to customer service can prevent complaints.","zh":"对客户服务采取主动做法可以预防投诉。"},{"en":"The team took proactive steps to reduce risk during the project.","zh":"团队采取了主动措施来降低项目中的风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Business/work style) Showing initiative—looking for opportunities and taking responsibility without being told.","zh":"（工作/职场风格）有主动性、能自发发现机会并承担责任，不用别人催或指示。"},"examples":[{"en":"We need someone proactive who can solve problems independently.","zh":"我们需要一个有主动性、能独立解决问题的人。"},{"en":"Being proactive at work often means communicating early and clearly.","zh":"在工作中“主动”往往意味着更早、更清楚地沟通。"}]}],"synonyms":["preventive","forward-thinking","initiative-taking","anticipatory","preemptive"],"phonetic":"/proʊˈæktɪv/","extraExplanation":["“Proactive”常与“reactive（被动应对的）”对比使用：proactive 是先做预防与准备，reactive 是事情发生后才处理。","词源上，pro- 表示“在前/提前”，active 表示“行动的”。因此它强调“先一步行动”。","在英语职场文化中，proactive 通常是强烈的褒义词，常见搭配有 proactive approach/steps/measure、be proactive about…"]}
{"word":"proactively","summary":{"en":"Proactively means acting in advance and taking initiative instead of only reacting.","zh":"proactively 指“提前行动、主动作为”，而不是等问题发生后才反应。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that takes action early—before a problem happens or before you are asked.","zh":"主动地；预先采取行动地（在问题发生前或在被要求前先行动）"},"examples":[{"en":"The team proactively fixed the bug before users noticed it.","zh":"团队在用户注意到之前就主动修复了这个漏洞。"},{"en":"She proactively reached out to new clients to build relationships.","zh":"她主动联系新客户来建立关系。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that actively tries to shape or control a situation, rather than only reacting to it.","zh":"积极掌控局势地（不只是被动反应，而是主动影响或引导事态发展）"},"examples":[{"en":"Managers should proactively communicate changes to avoid confusion.","zh":"管理者应当主动沟通变化，以避免混乱。"},{"en":"He proactively planned his budget to save money each month.","zh":"他主动规划预算，以便每个月存钱。"}]}],"synonyms":["in advance","ahead of time","preemptively","actively","on one’s own initiative"],"phonetic":"/proʊˈæktɪvli/","extraExplanation":["“proactively”常被用于商业、管理、客服、项目管理等语境，强调“事前预防”与“积极作为”。","常见搭配：proactively address (a risk/issue) 主动处理（风险/问题）；proactively reach out 主动联系；proactively manage 主动管理。","对比记忆：reactively=被动地、出了问题才反应；proactively=提前预防、先做准备。"]}
{"word":"proactor","summary":{"en":"A proactor is an official representative—especially in church/legal contexts—or (at Cambridge) an officer overseeing student discipline and administration.","zh":"proactor 指代理他人行事的代表（常见于教会/法律语境），也可指（剑桥大学等）负责学生纪律与行政事务的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who acts on behalf of someone else, especially in a church court or certain legal settings.","zh":"（尤指教会法庭或某些法律场合的）代理人，代诉人；代表他人行事的人。"},"examples":[{"en":"In medieval church courts, a proactor might speak for someone who could not attend.","zh":"在中世纪的教会法庭里，proactor 可能会替无法出庭的人发言。"},{"en":"She hired a proactor to manage the case paperwork and represent her interests.","zh":"她雇了一位 proactor 来处理案件文件并代表她的利益。"}]},{"partOfSpeech":"n.","definition":{"en":"At the University of Cambridge and some other institutions, an official responsible for student discipline and certain administrative duties.","zh":"（剑桥大学等学校的）学监；负责学生纪律与部分行政事务的官员。"},"examples":[{"en":"The proactor announced new rules about conduct during exams.","zh":"学监宣布了考试期间行为规范的新规定。"},{"en":"Students can appeal a decision made by the proactor’s office.","zh":"学生可以对学监办公室作出的决定提出申诉。"}]}],"synonyms":["representative","agent","advocate","delegate","proctor (Cambridge context)"],"phonetic":"/proʊˈæk.tɚ/","extraExplanation":["词源：来自拉丁语 pro-（代表、为……）+ actor（行动者），字面意思是“替别人行动的人”。因此它常带有“代理、代言”的色彩。","用法提示：在现代日常英语中 proactor 不算常见，更常出现在历史、教会法背景或特定大学制度（如 Cambridge）的语境里。美国高校里更常见的是 proctor（监考/监考老师）；别把 proactor 和 proctor 混用。"]}
{"word":"proaddition","summary":{"en":"“Proaddition” is not a standard word; it’s usually meant as “pro-addition,” meaning “in favor of adding something.”","zh":"“proaddition”不是标准词，通常想表达“pro-addition”，意思是“支持增加/添加某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or advocating adding something (not a standard dictionary word; usually written as “pro-addition” or expressed as “in favor of adding …”).","zh":"支持或主张“增加/添加某事”（这不是常见词；通常写作“pro-addition”，或用“in favor of adding …”来表达）。"},"examples":[{"en":"Some residents are pro-addition because the school needs more classrooms.","zh":"一些居民支持扩建，因为学校需要更多教室。"},{"en":"The committee is pro-addition of new safety rules.","zh":"委员会支持增加新的安全规定。"}]},{"partOfSpeech":"n.","definition":{"en":"a stance or argument in favor of adding something (rare/awkward; “support for an addition” or “an argument for adding …” is more natural).","zh":"支持增加某事的立场或论点（较少见/不太地道；更自然的说法是“support for an addition”或“an argument for adding …”）。"},"examples":[{"en":"Her pro-addition was that the extra staff would reduce wait times.","zh":"她支持增员的理由是这样能减少等待时间。"}]}],"synonyms":["in favor of adding","support adding","advocate adding","propose an addition"],"phonetic":"ˌproʊ əˈdɪʃən","extraExplanation":["“pro-”是英语常见前缀，表示“赞成/支持”（如 pro-choice, pro-democracy）。因此“pro-addition”在结构上能被理解，但在真实英语里并不常见，读者可能觉得生硬。","更自然的表达通常是：in favor of adding…, support adding…, advocate adding…, propose an addition (to…).","如果你想表达“额外的补充/附加内容”，可能要用 addition / additional / add-on，而不是“proaddition”。"]}
{"word":"proadjournment","summary":{"en":"Pro-adjournment means supporting or favoring adjournment (pausing/ending a meeting to continue later).","zh":"Pro-adjournment 指“赞成休会/散会”，即支持暂停或结束会议并择日继续。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) In favor of adjourning a meeting; supporting ending the meeting and continuing later.","zh":"（罕见）赞成休会/散会的；支持结束会议并改日再继续的。"},"examples":[{"en":"Several members were pro-adjournment because it was already midnight.","zh":"因为已经到半夜了，有几位成员赞成休会。"},{"en":"The chair asked for comments from both pro-adjournment and anti-adjournment speakers.","zh":"主席请赞成休会和反对休会的发言者都发表意见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A stance or argument supporting adjournment.","zh":"（罕见）赞成休会的立场或论点。"},"examples":[{"en":"Her pro-adjournment argument focused on safety and transportation at night.","zh":"她的赞成休会观点主要强调夜间安全与交通问题。"}]}],"synonyms":["in favor of adjournment","supporting adjournment","for adjournment"],"phonetic":"/ˌproʊ əˈdʒɝnmənt/","extraExplanation":["“proadjournment”更常见的写法是带连字符的“pro-adjournment”，多见于会议记录、议事规则（parliamentary procedure）或较正式的讨论中。","“adjourn”在会议语境里是“休会/散会（暂时停止）”，通常意味着之后还会再开；与“end/close the meeting（结束会议）”不完全相同。"]}
{"word":"proadministration","summary":{"en":"Proadministration means supportive of the current government/administration, or a person/group that supports it.","zh":"proadministration 指“亲政府的/支持现任政府的”，也可指“亲政府派（的人或团体）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the current government or its leadership (often used in politics and news writing).","zh":"支持现任政府或其领导层的（常用于政治与新闻语境）。"},"examples":[{"en":"Several proadministration lawmakers backed the bill in parliament.","zh":"几位亲政府的议员在议会中支持了这项法案。"},{"en":"The newspaper is seen as proadministration during election season.","zh":"在选举季，这家报纸被认为偏向支持现任政府。"},{"en":"Proadministration voices dominated the panel discussion.","zh":"座谈会上以亲政府的观点为主。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or position that supports the current government.","zh":"支持现任政府的人、团体或立场。"},"examples":[{"en":"The proadministration argued that stability mattered more than rapid change.","zh":"亲政府派认为稳定比快速变革更重要。"},{"en":"Both the opposition and the proadministration held rallies downtown.","zh":"反对派和亲政府派都在市中心举行了集会。"}]}],"synonyms":["pro-government","pro-regime","government-aligned","administration-friendly"],"phonetic":"/ˌproʊ ədˌmɪnəˈstreɪʃən/","extraExplanation":["该词由前缀 pro-（“支持、赞成”）+ administration（“政府/执政当局”）构成，常见于新闻与政治评论中，语气可能带有评价色彩（暗示“偏向当权者”）。","更常见的写法是加连字符的 pro-administration；有时也会用更中性的表达，如 supportive of the administration（支持政府的）或 aligned with the administration（与政府立场一致）。"]}
{"word":"proadmission","summary":{"en":"Proadmission (more commonly written pro-admission) means supporting admission or entry, or the stance that supports it.","zh":"proadmission（更常写作 pro-admission）表示“支持准入/录取/接纳”，也可指这种立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting someone’s admission (being allowed to enter or join), especially in debates about schools, programs, organizations, or immigration.","zh":"支持某人被录取/准入（被允许进入或加入），常用于关于学校、项目、组织或移民的讨论。"},"examples":[{"en":"The student group is strongly pro-admission and opposes stricter entry rules.","zh":"这个学生团体强烈支持准入，反对更严格的入门规则。"},{"en":"Her article takes a pro-admission stance toward refugee resettlement.","zh":"她的文章在难民安置问题上采取了支持接纳的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a pro-admission position or argument; support for admission.","zh":"支持准入的立场或论点；支持录取/接纳。"},"examples":[{"en":"The debate became a clash between pro-admission and anti-admission voices.","zh":"这场辩论变成了支持准入与反对准入声音的对立。"},{"en":"His pro-admission was based on fairness and equal opportunity.","zh":"他支持准入的理由是公平与机会平等。"}]}],"synonyms":["pro-entry","in favor of admission","supportive of admission","pro-acceptance"],"phonetic":"/ˌproʊədˈmɪʃən/","extraExplanation":["“proadmission”更常见的写法是带连字符的“pro-admission”。“pro-”表示“赞成、支持”，后面接名词时常用连字符，尤其是在新闻、政策讨论或学术写作中。","常见搭配场景包括：college admissions（大学招生/录取）、program admission（项目准入）、hospital admission（入院收治）、immigration admission（移民准入/接纳）。不同语境里“admission”可译为“录取/准入/入院/接纳”，需要结合上下文判断。"]}
{"word":"proadoption","summary":{"en":"Pro-adoption describes a person, policy, or movement that supports and promotes adoption.","zh":"pro-adoption 指“支持并推动收养”的人、政策或社会倡议。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting adoption or encouraging people/policies that make adoption easier or more accepted","zh":"支持收养的；鼓励收养或支持让收养更容易、更被接受的政策/观点"},"examples":[{"en":"She is pro-adoption and volunteers with a foster care organization.","zh":"她支持收养，并在一个寄养相关的机构做志愿者。"},{"en":"The senator spoke at a pro-adoption rally downtown.","zh":"这位参议员在市中心的一场支持收养的集会上发言。"},{"en":"They launched a pro-adoption campaign to reduce stigma around adopting older children.","zh":"他们发起了一项支持收养的宣传活动，以减少对收养大龄儿童的偏见。"}]}],"synonyms":["pro-adoption (hyphenated)","adoption-friendly","supportive of adoption","in favor of adoption"],"phonetic":"/ˌproʊ əˈdɑpʃən/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持/赞成”。所以 pro-adoption = “支持收养的”。在正式写作中常用连字符 pro-adoption；也可写作 proadoption（较少见）。","该词多用于公共政策、社会议题或倡议语境（例如收养制度改革、寄养转收养、反对对收养的污名化）。使用时注意保持中性与尊重，避免暗示对其他选择（如生育或不收养）的贬低。"]}
{"word":"proadvertising","summary":{"en":"Pro-advertising describes a person, policy, or viewpoint that supports advertising.","zh":"Pro-advertising 用来形容支持广告（或赞成广告作用）的个人、政策或观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting advertising or the advertising industry; favorable toward the use of ads.","zh":"支持广告（或广告行业）的；赞成使用广告的。"},"examples":[{"en":"The senator took a pro-advertising stance, arguing that ads help small businesses grow.","zh":"这位参议员采取了支持广告的立场，认为广告能帮助小企业成长。"},{"en":"Some pro-advertising groups oppose strict limits on online ads.","zh":"一些支持广告的团体反对对网络广告的严格限制。"}]}],"synonyms":["advertising-friendly","pro-ad","pro-commerce (context-dependent)"],"phonetic":"/ˌproʊ ˈædvərˌtaɪzɪŋ/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-choice, pro-democracy）。因此 pro-advertising 通常表示“支持广告的立场/观点”。","这个词更常写作“pro-advertising”（带连字符）。你输入的“proadvertising”在正式写作中不太常见，通常会被当作拼写或排版变体。","常用于政策、媒体监管、隐私与商业讨论的语境中，与 anti-advertising（反广告）形成对比。"]}
{"word":"proadvertizing","summary":{"en":"Proadvertizing is a nonstandard spelling meaning “pro-advertising,” i.e., supportive of advertising.","zh":"proadvertizing 是非标准拼写，意思相当于 pro-advertising，即“支持广告/亲广告的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting advertising or favoring the use of advertising (often used to describe a person, policy, or viewpoint).","zh":"支持广告（或赞成使用广告）的；亲广告的（常用来描述个人、政策或观点）。"},"examples":[{"en":"The senator is openly pro-advertising and opposes strict limits on commercial ads.","zh":"这位参议员公开支持广告，反对对商业广告设立严格限制。"},{"en":"Some people are pro-advertising because ads help fund free online content.","zh":"有些人支持广告，因为广告能为免费的网络内容提供资金。"}]},{"partOfSpeech":"other","definition":{"en":"(rare spelling) a misspelling or nonstandard form of “pro-advertising”; sometimes also reflects the older spelling “advertizing” for “advertising.”","zh":"（罕见拼写）“pro-advertising”的拼写错误或非标准写法；有时也反映“advertizing”（较旧拼写）这一形式，对应标准拼写“advertising”。"},"examples":[{"en":"In formal writing, use pro-advertising rather than proadvertizing.","zh":"在正式写作中，用 pro-advertising，而不要用 proadvertizing。"}]}],"synonyms":["pro-advertising","advertising-friendly","in favor of advertising"],"phonetic":"/ˌproʊ ˈæd.vɚˌtaɪ.zɪŋ/","extraExplanation":["“advertising”是现代标准拼写；“advertizing”曾在部分品牌名、旧式排版或个别出版物中出现，但现在一般被视为少见或非标准。","“pro-”作前缀表示“支持……/赞成……”，英文中常用连字符：pro-advertising、pro-choice、pro-democracy。正式写作里通常加连字符更清楚。"]}
{"word":"proaeresis","summary":{"en":"Proaeresis means dropping the beginning sound or syllable of a word (often in speech or poetry).","zh":"Proaeresis 指省略或脱落词首的音或音节（常见于口语或诗歌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric/Linguistics) The omission or loss of one or more sounds (often an unstressed vowel or syllable) at the beginning of a word, especially in poetic or casual speech.","zh":"（修辞/语言学）省略或脱落词首的一个或多个语音（常为非重读元音或音节），多见于诗歌或口语中的简略表达。"},"examples":[{"en":"In casual speech, “because” may be shortened to “’cause,” which is an example of proaeresis.","zh":"在口语中，“because”常被简化为“’cause”，这就是 proaeresis（词首省音）的例子。"},{"en":"Some poets use proaeresis to fit the meter of a line.","zh":"有些诗人会用 proaeresis（省去词首音）来符合诗行的格律。"},{"en":"The form “’round” for “around” shows proaeresis at the start of the word.","zh":"用“’round”代替“around”体现了词首的省音现象。"}]}],"synonyms":["aphaeresis","aphesis","initial elision"],"phonetic":"/ˌproʊəˈrɛsɪs/","extraExplanation":["这个术语比较少见，常出现在修辞学或历史语言学的讨论中。学习时可以把它理解为“词首省略/脱落”，与更常见的术语 aphaeresis/aphesis（词首音脱落）意义非常接近。"]}
{"word":"proaesthetic","summary":{"en":"Proaesthetic means favoring or promoting aesthetics and beauty as an important priority.","zh":"Proaesthetic 指“推崇审美/美感、把美与艺术风格放在重要位置的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or promoting aesthetics (beauty, artistic style, or sensory appeal) as an important value.","zh":"支持或推崇“审美/美感”的；强调美与艺术风格（或感官美感）很重要的。"},"examples":[{"en":"The designer took a proaesthetic approach, choosing materials that felt beautiful as well as durable.","zh":"这位设计师采取了偏审美的做法，选择既耐用又有美感的材料。"},{"en":"Some critics argue that the film is strongly proaesthetic, prioritizing visual mood over plot.","zh":"一些评论者认为这部电影很“重审美”，更在意画面氛围而不是情节。"}]}],"synonyms":["pro-aesthetic","aesthetic-minded","beauty-oriented","art-centered"],"phonetic":"/ˌproʊ.iˈsθɛtɪk/","extraExplanation":["“proaesthetic”较少见，更常见的写法是带连字符的“pro-aesthetic”。它由前缀“pro-（支持、赞成）”+“aesthetic（审美的）”组成，常用于艺术评论、设计、文化研究等语境，表示“立场上偏向审美价值”。","注意不要与“prosthetic（假体的、义肢的）”混淆；两者拼写和发音相近但意义完全不同。"]}
{"word":"proaggressionist","summary":{"en":"A rare term for someone (or something) that supports aggressive—often warlike—action.","zh":"一个较少见的词，指支持强硬乃至战争/侵略性行动的人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or promotes aggressive actions, especially in politics or war","zh":"主张或鼓吹侵略/强硬行动的人（尤指政治或战争方面）"},"examples":[{"en":"Some critics called the minister a proaggressionist because he argued for expanding the war.","zh":"一些批评者称这位部长是“主战派/鼓吹侵略者”，因为他主张扩大战争。"},{"en":"The article warns that proaggressionists often frame violence as “necessary security.”","zh":"这篇文章警告说，鼓吹侵略的人常把暴力包装成“必要的安全措施”。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring aggressive action (rare; usually used as a label in debate)","zh":"支持或倾向于强硬/侵略性行动的（较少见；多用于争论中的标签）"},"examples":[{"en":"His proaggressionist rhetoric shocked many listeners.","zh":"他那种鼓吹强硬行动的言论让许多听众震惊。"}]}],"synonyms":["hawk","hawkish","pro-war","militaristic","belligerent"],"phonetic":"/proʊ.əˈɡrɛʃ.ə.nɪst/","extraExplanation":["这个词非常少见，多出现在政治评论或争论中，用来给对方“贴标签”。更常见的表达包括：hawkish（鹰派的/强硬的）、pro-war（主战的）、militaristic（军国主义的）、aggressive（好斗的/侵略性的）。","词形结构：pro-（支持、赞成）+ aggression（侵略/攻击行为）+ -ist（……主义者/支持者）。因此它通常带有负面评价色彩，使用时要注意语气与语境。"]}
{"word":"proagitation","summary":{"en":"“Proagitation” is a rare, nonstandard term meaning support for agitation (often written “pro-agitation”). It may be a misspelling of a more common word.","zh":"“proagitation”是罕见的非标准用法，意为“支持鼓动/煽动”（常写作 pro-agitation）。也可能是更常见单词的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, nonstandard/coinage meaning “support for agitation” or “in favor of stirring up public action or debate.” (Often written with a hyphen: “pro-agitation.”)","zh":"一个罕见、非标准的造词，意思是“支持鼓动/煽动”或“赞成通过激起公众行动与讨论来推动议题”（常写作带连字符的 pro-agitation）。"},"examples":[{"en":"The article read like a piece of pro-agitation, urging people to protest immediately.","zh":"这篇文章读起来像是在“支持鼓动”，催促人们立刻上街抗议。"},{"en":"Some viewers criticized the speech as pro-agitation rather than constructive dialogue.","zh":"一些观众批评这场演讲是在“鼓动”，而不是建设性的对话。"}]}],"synonyms":["pro-agitation","rabble-rousing (context-dependent)","incitement (near in meaning)"],"phonetic":"/proʊˌædʒɪˈteɪʃən/","extraExplanation":["“proagitation”并不是常见词典词条，日常英语里几乎不用。很多情况下它可能是拼写错误或误听，常见的目标词有：\n1) propagation /ˌprɑpəˈɡeɪʃən/（传播、繁殖，如“信息传播/植物繁殖”）\n2) agitation /ˌædʒɪˈteɪʃən/（激动、骚动；政治上的鼓动）\n如果你告诉我你看到它的原句/语境，我可以帮你判断最可能想表达哪个词。"]}
{"word":"proagon","summary":{"en":"A proagon is a preliminary ceremony in ancient Greek festivals where upcoming competitors were introduced.","zh":"proagon 指古希腊节庆中在正式演出/比赛前举行的预备仪式，用于介绍或公布参赛者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A formal preliminary event before a dramatic or athletic festival, where competitors (such as playwrights and actors) were announced or introduced.","zh":"（古希腊）戏剧或竞技节庆前的正式预备仪式/活动，用来公布或介绍参赛者（如剧作家、演员等）。"},"examples":[{"en":"Before the plays were performed, Athens held a proagon to present the poets and their casts.","zh":"在戏剧正式上演前，雅典会举行 proagon 来介绍诗人和他们的演员阵容。"},{"en":"The historian describes the proagon as a public preview of the upcoming festival.","zh":"这位历史学家把 proagon 描述为对即将到来的节庆的公开“预告”。"}]}],"synonyms":["preliminary ceremony","prefestival announcement","introductory event"],"phonetic":"/proʊˈæɡɑn/","extraExplanation":["proagon 来自古希腊语 προαγών，字面意思接近“在比赛/竞演之前的活动”。它常见于研究古希腊戏剧（尤其是雅典酒神节等节庆）的学术写作中，在现代英语里非常罕见。","不要与 protagonist（主角）混淆：两者拼写相近，但含义完全不同；protagonist 指故事或戏剧的“主角”。"]}
{"word":"proagones","summary":{"en":"A protagonist is the main character in a story, or a leading supporter of a cause.","zh":"protagonist 指故事中的主角，也可指某事业或观点的主要倡导者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main character in a story, movie, or play (often the person the plot follows)","zh":"（小说、电影、戏剧等中的）主角；故事主要围绕的人物"},"examples":[{"en":"In Harry Potter, Harry is the protagonist.","zh":"在《哈利·波特》中，哈利是主角。"},{"en":"The protagonist changes a lot from the beginning to the end of the novel.","zh":"这位主角从小说开头到结尾变化很大。"},{"en":"The story is told from the protagonist’s point of view.","zh":"故事以主角的视角来讲述。"}]},{"partOfSpeech":"n.","definition":{"en":"a leading supporter of an idea, movement, or cause","zh":"（某观点、运动或事业的）主要倡导者；领军人物"},"examples":[{"en":"She became a protagonist for education reform.","zh":"她成了教育改革的主要倡导者。"},{"en":"He was a protagonist in the fight for civil rights.","zh":"他是民权运动斗争中的重要人物。"}]}],"synonyms":["main character","hero","central figure","lead","champion","advocate"],"phonetic":"/proʊˈtæɡənɪst/","extraExplanation":["你输入的“proagones”很可能是拼写错误；常见目标词是 **protagonist**（主角/倡导者）。","词源小知识：protagonist 来自希腊语 *pro-*（在前）+ *agon*（竞争/比赛），原指戏剧中“第一演员/首要角色”，后来引申为“主角”。"]}
{"word":"proagrarian","summary":{"en":"Proagrarian means “supporting agriculture or farmers,” especially in politics or policy.","zh":"proagrarian 指“亲农业、支持农民/农业利益的”，多用于政治或政策语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting farmers, agriculture, or agrarian interests (often in politics or policy).","zh":"支持农民、农业或土地/乡村（农业主义）利益的（常用于政治或政策语境）。"},"examples":[{"en":"The candidate ran on a proagrarian platform, promising better crop insurance and rural schools.","zh":"这位候选人以亲农业的政纲参选，承诺改善作物保险和乡村学校。"},{"en":"Proagrarian policies may include subsidies for small farms and protections for farmland.","zh":"亲农业政策可能包括对小农场的补贴以及对农地的保护。"}]}],"synonyms":["pro-farmer","pro-agriculture","agrarian (in some contexts)","farm-friendly"],"phonetic":"/ˌproʊəˈɡreriən/","extraExplanation":["“pro-”是前缀，表示“支持……的/赞成……的”（如 pro-democracy 亲民主）。因此 proagrarian = 支持 agrarian（农业的/乡村的/以农业为基础的）利益。","“agrarian”常与政治、经济结构有关：强调土地、农民与农村社区的重要性；有时也与“反对过度城市化或工业资本集中”的观点相关。"]}
{"word":"proagreement","summary":{"en":"“proagreement” is not a common standard word; it usually means “pro-agreement,” i.e., supportive of an agreement or favoring reaching agreement.","zh":"“proagreement”不是常见标准词；通常指“pro-agreement”，意思是支持某项协议或倾向于达成一致。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard; usually written with a hyphen) supporting an agreement, or favoring reaching an agreement; pro-consensus.","zh":"（非标准用法；通常加连字符 pro-agreement）支持协议的；倾向于达成一致/达成协议的。"},"examples":[{"en":"The committee took a pro-agreement approach to avoid a long dispute.","zh":"委员会采取了倾向达成协议的做法，以避免长期争执。"},{"en":"She is generally pro-agreement in negotiations and looks for common ground.","zh":"在谈判中她通常倾向于达成协议，会寻找共同点。"}]},{"partOfSpeech":"n.","definition":{"en":"A stance or position that supports an agreement (rare; more natural: “support for the agreement”).","zh":"支持某项协议的立场（较少见；更自然的说法是“对该协议的支持”）。"},"examples":[{"en":"There is strong pro-agreement among senior leaders.","zh":"高层领导中存在强烈的支持协议的态度。"},{"en":"Public pro-agreement increased after the terms were clarified.","zh":"条款被澄清后，公众对协议的支持增加了。"}]}],"synonyms":["pro-consensus","supportive","in favor of (the agreement)","agreement-oriented"],"phonetic":"/ˌproʊ əˈɡriːmənt/","extraExplanation":["“proagreement”作为一个连写词在英语里不常见；更常见的写法是“pro-agreement”（加连字符），或者直接说“in favor of the agreement / supportive of the agreement”。","如果你想表达“预先达成的协议/事先约定”，英语里通常用“pre-agreement”“prior agreement”，或在法律语境中用“agreement in principle”（原则性同意）。"]}
{"word":"proagricultural","summary":{"en":"Proagricultural means supportive of agriculture or farming interests.","zh":"proagricultural 意为“支持农业/农民利益的；亲农业的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring agriculture, farmers, or farming policies.","zh":"支持农业、农民或农业政策的；亲农业的。"},"examples":[{"en":"The senator promoted a pro-agricultural agenda to help small farmers.","zh":"这位参议员推动一项亲农业的议程，以帮助小农户。"},{"en":"Pro-agricultural subsidies can stabilize food prices during droughts.","zh":"亲农业的补贴在干旱时期可以稳定食品价格。"},{"en":"The party’s platform is strongly pro-agricultural and rural.","zh":"该党的政纲强烈亲农业、亲农村。"}]}],"synonyms":["pro-farmer","agriculture-friendly","farm-friendly","supportive of agriculture"],"phonetic":"/ˌproʊˌæɡrɪˈkʌltʃərəl/","extraExplanation":["“pro-”是常见前缀，意思是“支持/赞成”（如 pro-democracy 亲民主的、pro-environment 亲环境的）。因此 pro(-)agricultural 字面意思就是“支持农业的”。","这个词在日常英语里不算常见，更常见的表达有：pro-farmer（亲农的）、agriculture-friendly（对农业友好的）、supportive of agriculture（支持农业的）。写作中常用连字符：pro-agricultural。"]}
{"word":"proagule","summary":{"en":"A propagule is a biological unit (seed, spore, bud, etc.) that can develop into a new organism.","zh":"propagule 指能发育成新个体的生物繁殖单位（如种子、孢子、芽等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A unit that can grow into a new organism, such as a seed, spore, bud, or a piece of a plant that can take root.","zh":"（生物）繁殖体：能够发育成新个体的单位，如种子、孢子、芽，或能生根的植物碎片。"},"examples":[{"en":"Dandelion seeds are propagules that spread easily in the wind.","zh":"蒲公英的种子是繁殖体，能借风轻易传播。"},{"en":"Some plants reproduce when small propagules break off and root in new soil.","zh":"有些植物会通过小的繁殖体脱落并在新土壤中生根来繁殖。"}]}],"synonyms":["reproductive unit","seed (in many cases)","spore (in many cases)"],"phonetic":"/prəˈpæɡjəl/","extraExplanation":["你输入的“proagule”通常是拼写错误；正确拼写更常见的是 **propagule**。","词源提示：来自 *propagate*（繁殖、传播）。在生态学/植物学里常用来描述“用于扩散与繁殖的‘单位’”，强调它能“独立建立新个体”。"]}
{"word":"proairesis","summary":{"en":"Proairesis is a philosophical term for deliberate, reasoned moral choice or purpose.","zh":"Proairesis 是哲学术语，指经过理性思考的道德选择或意志/目的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient philosophy) a person’s deliberate choice or moral purpose—the capacity to choose actions based on reason and values, not just impulse.","zh":"（古代哲学）深思熟虑的选择或道德意志——根据理性与价值作出行动决定的能力，而不只是冲动。"},"examples":[{"en":"For Aristotle, virtue depends on proairesis—choosing the right action for the right reasons.","zh":"对亚里士多德来说，德性取决于proairesis——以正确的理由选择正确的行动。"},{"en":"The Stoics stressed that proairesis is the part of us we can control, even when circumstances are harsh.","zh":"斯多葛学派强调，proairesis是我们能掌控的那部分自我，即使外在处境很艰难。"}]}],"synonyms":["moral choice","deliberate choice","volition","moral purpose","practical reason"],"phonetic":"/proʊ.əˈraɪ.ə.sɪs/","extraExplanation":["该词来自希腊语 προαίρεσις（prohairesis），常见于亚里士多德《尼各马可伦理学》与斯多葛传统（如爱比克泰德）中。它不只是“选择”本身，更强调“经过思考、带有价值判断的选择/意向”。","在英文哲学写作里，proairesis 有时译作 “rational choice / moral choice / moral purpose / faculty of choice”。不同作者会根据语境偏向“意志”“意向”或“可控的内在选择”。","用法提示：它多用于学术或哲学语境，日常英语里很少直接使用；写作时常搭配 talk about / emphasize / ground (virtue in) 等动词。"]}
{"word":"proairplane","summary":{"en":"“Proairplane” isn’t standard; you probably mean “prop airplane” (a propeller-driven airplane).","zh":"“proairplane”不是标准用法；你可能想表达“prop airplane（螺旋桨飞机）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard English word) Likely meant: “prop airplane” — an airplane driven by one or more propellers (rotating blades).","zh":"（不是标准英文单词）可能想写：prop airplane——“螺旋桨飞机”，由一个或多个螺旋桨提供动力的飞机。"},"examples":[{"en":"We flew to the island on a small prop airplane.","zh":"我们坐一架小型螺旋桨飞机飞到岛上。"},{"en":"Prop airplanes are common on short regional routes.","zh":"螺旋桨飞机常见于短途支线航线。"}]}],"synonyms":["prop plane","propeller airplane","turboprop (type)"],"phonetic":"/prɑp ˈɛrˌpleɪn/","extraExplanation":["“proairplane”看起来像把两个词连在一起了。更常见的写法是 **prop plane**（更口语）或 **propeller airplane**（更正式）。","有时也会看到 **turboprop**（涡轮螺旋桨飞机），指用涡轮发动机带动螺旋桨的机型，常用于支线航班。"]}
{"word":"proal","summary":{"en":"“Proal” is not a recognized English word; it’s likely a misspelling.","zh":"“proal”不是规范英语词，通常是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “proal” is most likely a misspelling or a typo, so it doesn’t have an agreed dictionary meaning in English.","zh":"不是标准英语单词。“proal”很可能是拼写错误或打字错误，因此在英语里没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “proal” in a dictionary—did you mean “plural” or “prologue”?","zh":"我在词典里找不到“proal”——你是不是想写“plural（复数的）”或“prologue（序言/开场白）”？"}]}],"phonetic":"ˈproʊæl","extraExplanation":["“proal”常见于拼写输入错误。你可以告诉我：\n1）你看到它的句子/上下文；或 2）你想表达的中文意思；或 3）你是否想查下面这些相近词之一：\n- plural（复数的）\n- moral（道德的）\n- prologue（序言/开场白）\n- pluralism（多元主义）\n- prole（口语/带贬义：无产者；不建议随意使用）\n给我上下文后我可以按正确词条详细解释。"]}
{"word":"proalcoholism","summary":{"en":"“Proalcoholism” means support for or promotion of alcohol use, often implying a critical view that drinking is being overly normalized or encouraged.","zh":"“proalcoholism”指支持或宣扬饮酒的立场/氛围，常带批评意味，暗示饮酒被过度正常化或被鼓励。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for or promotion of drinking alcohol, or the belief that alcohol use is good, normal, or desirable.","zh":"亲酒精主义；支持或宣扬饮酒的立场，认为喝酒是好的、正常的或值得提倡的。"},"examples":[{"en":"The article was criticized for sounding like proalcoholism rather than health advice.","zh":"那篇文章被批评听起来像是在宣扬亲酒精主义，而不是健康建议。"},{"en":"Some ads subtly encourage proalcoholism by linking alcohol with success and popularity.","zh":"有些广告把酒精和成功、受欢迎联系在一起，含蓄地鼓励亲酒精主义。"}]},{"partOfSpeech":"n.","definition":{"en":"A social attitude or culture in which alcohol is strongly accepted or encouraged.","zh":"（社会）亲酒精文化；一个强烈接受或鼓励饮酒的社会态度或氛围。"},"examples":[{"en":"He felt uncomfortable with the proalcoholism at office parties.","zh":"他对公司聚会里的那种亲酒精文化感到不自在。"}]}],"synonyms":["pro-alcohol","pro-drinking attitudes","a pro-alcohol culture","alcohol-positive messaging"],"phonetic":"/ˌproʊˈæl.kəˌhɑːl.ɪ.zəm/","extraExplanation":["“proalcoholism”不是非常常见的标准词，更常见的表达有：pro-alcohol (adj.)、pro-drinking attitudes（亲饮酒态度）、a pro-alcohol culture（亲酒精文化）。","构词：pro-（支持/赞成）+ alcoholism（酒精依赖/酗酒）。因此它常带有批评色彩，暗示“把酒说得太正面，忽视风险”。","语境提醒：在公共健康讨论中，用它往往是在反对某些媒体、广告或社交压力对饮酒的美化。"]}
{"word":"proalien","summary":{"en":"“Proalien” means supportive of aliens—either extraterrestrials in fiction or foreign nationals/immigrants in political usage.","zh":"“Proalien”指“支持外星人”（科幻）或“支持外国人/移民”（政治语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring aliens (non-human extraterrestrials in fiction, or “aliens” meaning foreign nationals/immigrants in political talk).","zh":"支持或偏向“外星人”（科幻语境）或“外国人/移民”（政治语境中对“alien”的用法）。"},"examples":[{"en":"In the sci‑fi novel, the senator is openly proalien and wants peace talks with the visitors.","zh":"在这本科幻小说里，那位参议员公开亲外星人，想和来访者进行和平谈判。"},{"en":"Some headlines used the term proalien to accuse the group of supporting immigrants, though the label was controversial.","zh":"一些标题用“proalien”指责该团体支持移民，不过这个标签很有争议。"}]}],"synonyms":["pro-immigrant","pro-migrant","pro-extraterrestrial","alien-friendly"],"phonetic":"/ˌproʊˈeɪliən/","extraExplanation":["“pro-”表示“支持、赞成”（如 pro-democracy 亲民主；pro-choice 支持选择权）。“alien”在法律/政治语境里常指“外国人、非本国公民”，但这个词在英语里可能带有距离感甚至贬义色彩；日常更常用 immigrant（移民）、migrant（移居者）、foreign national（外国公民）等更中性表达。","“proalien”不是非常常见的标准词，更多见于科幻作品、网络讨论或带立场的媒体措辞；写作时可以根据语境改用更清晰的表达，比如 pro-immigrant（亲移民）、pro-ET / pro-extraterrestrial（亲外星生命）。"]}
{"word":"proalliance","summary":{"en":"ProAlliance is usually a proper name; more generally, it can mean “supporting an alliance.”","zh":"ProAlliance 多为专有名称；更一般可理解为“支持联盟/支持合作”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brand name or organization name that suggests support for an alliance (a cooperative partnership). It is not a standard dictionary word and its exact meaning depends on the specific company/group using it.","zh":"一个品牌名或组织名称，字面含义类似“支持联盟/合作伙伴关系”。它不是标准词典词，具体含义取决于使用该名称的公司或团体。"},"examples":[{"en":"ProAlliance announced a new partnership with local clinics.","zh":"ProAlliance 宣布与当地诊所建立新的合作伙伴关系。"},{"en":"Please contact ProAlliance customer support for account help.","zh":"如需账户帮助，请联系 ProAlliance 客服支持。"}]},{"partOfSpeech":"adj.","definition":{"en":"As a descriptive label, “pro-alliance” can mean “in favor of an alliance” or “supporting cooperation between groups.”","zh":"作为描述性标签，“pro-alliance”可表示“支持结盟/支持合作”的。"},"examples":[{"en":"Some lawmakers took a pro-alliance stance during the negotiations.","zh":"在谈判期间，一些立法者采取了支持联盟的立场。"},{"en":"The article argues for a pro-alliance foreign policy.","zh":"这篇文章主张一种支持联盟的外交政策。"}]}],"synonyms":["alliance-supporting","pro-cooperation","in favor of an alliance"],"phonetic":"/proʊ əˈlaɪəns/","extraExplanation":["“ProAlliance”经常以专有名词（公司/机构/项目名）的形式出现，大小写通常固定（P大写、A大写）。如果你能提供它出现的句子或所属行业（医疗、保险、科技等），我可以更准确地解释它在该语境中的含义与用法。"]}
{"word":"proallotment","summary":{"en":"Proallotment means favoring a policy of allotment, especially dividing shared land into individual parcels.","zh":"proallotment 指“支持分配制/分地制”的，尤指把共有土地划分为个人地块的政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a policy of allotment, especially the division of commonly held land into individual parcels.","zh":"支持“分配制/分地制”的；尤指把共同土地分成个人土地的政策。"},"examples":[{"en":"Some late-19th-century politicians were openly proallotment and argued that individual land ownership would encourage assimilation.","zh":"19世纪末的一些政治人物公开支持分地制，认为个人土地所有权会促进同化。"},{"en":"The newspaper took a proallotment position during the debate over land reform.","zh":"在土地改革辩论期间，这家报纸采取了支持分配制的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a pro-allotment stance, movement, or policy (the act of supporting allotment).","zh":"支持分配制/分地制的立场、运动或政策（支持分配制的行为）。"},"examples":[{"en":"Proallotment in this period is often linked to federal Indian policy in the United States.","zh":"这一时期的“支持分地制”常与美国的联邦印第安政策相关联。"}]}],"synonyms":["pro-allotment","in favor of allotment","supporting allotment"],"phonetic":"/ˌproʊ.əˈlɑt.mənt/","extraExplanation":["“proallotment”更常见的写法是带连字符的 **pro-allotment**。它不是日常英语高频词，更多见于历史、政策与学术写作。","在美国历史语境中，它常与19世纪末的“土地分配（allotment）”政策有关，尤其是1887年的《道斯法案》（Dawes Act），该政策将部分原住民部落共有土地划分为个人地块；支持者常被称为“pro-allotment”。"]}
{"word":"proalteration","summary":{"en":"“Proalteration” is not standard English; use clearer phrases like “pro-change” or “in favor of changes.”","zh":"“proalteration”不是标准英语表达；建议用“pro-change”或“in favor of changes（赞成变更）”等更自然的说法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare word in modern English; it is usually not found in major dictionaries. It looks like it means “in favor of alteration/change,” but people normally express this idea with other words (e.g., “pro-change,” “in favor of changes,” “supporting reform”).","zh":"不是现代英语中的标准词（在主流词典中通常查不到），用法非常罕见。字面上看像是“支持改变/赞成变更”，但英语里一般会用其他更自然的说法（如 pro-change、in favor of changes、supporting reform）。"},"examples":[{"en":"The article calls the group “pro-change,” not “proalteration.”","zh":"这篇文章称该团体为“pro-change（支持改变）”，而不是“proalteration”。"},{"en":"If you mean you support policy updates, you can say “in favor of policy changes.”","zh":"如果你想表达支持政策更新，可以说“in favor of policy changes（赞成政策变更）”。"}]}],"synonyms":["pro-change","in favor of changes","supporting reform","pro-reform","advocating change"],"phonetic":"/ˌproʊˌɔltəˈreɪʃən/","extraExplanation":["“pro-”是常见前缀，意思是“支持/赞成”（如 pro-democracy 支持民主）。而“alteration”是名词“改变、改动”（常见于衣物改尺寸：clothing alterations）。把两者直接拼成“proalteration”不符合常见构词习惯，所以读者可能不理解。","你可能想写的词：\n1) proliferation（扩散、激增）——拼写上容易误打；\n2) pro-change（支持改变）——最自然；\n3) pro-reform（支持改革）/ pro-adjustment（支持调整）——更正式。","如果你把“proalteration”用在特定学科/品牌/用户名里，也可以成立，但建议在首次出现时加解释，避免歧义。"]}
{"word":"proamateur","summary":{"en":"A proam (often written pro-am) is an event or format that mixes professional and amateur players.","zh":"proam（常写作 pro-am）指职业选手与业余选手混合参赛的赛事或赛制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sports event or competition in which professional players and amateur players play together or on the same teams","zh":"（体育）职业选手与业余选手共同参赛或同队比赛的赛事；职业—业余混合赛"},"examples":[{"en":"The charity golf pro-am raised money for local schools.","zh":"这场慈善高尔夫职业—业余混合赛为当地学校筹到了资金。"},{"en":"She got an invitation to play in the pro-am on Wednesday.","zh":"她收到了周三参加职业—业余混合赛的邀请。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to, involving, or designed for both professionals and amateurs","zh":"与职业选手和业余选手都有关的；面向职业与业余共同参与的"},"examples":[{"en":"They entered a pro-am tournament at the local tennis club.","zh":"他们报名参加了当地网球俱乐部的职业—业余混合赛。"},{"en":"The event has a pro-am format: one pro paired with three amateurs.","zh":"这项活动采用职业—业余配对形式：一名职业选手搭配三名业余选手。"}]}],"synonyms":["pro-am","pro-am event","mixed pro-and-amateur tournament","exhibition (sometimes)"],"phonetic":"/ˌproʊˈæmətʃɚ/","extraExplanation":["常见写法有 pro-am、proam（较少见），口语里也常说 a pro-am。多见于高尔夫、网球等项目，常用于慈善赛或推广活动。","在许多 pro-am 赛事中，主办方会把“1 位职业选手 + 若干业余选手”组成一队，让业余选手获得与职业选手同场竞技、学习交流的机会。"]}
{"word":"proambient","summary":{"en":"Proambient means supporting environmental protection; similar to pro-environmental (more common).","zh":"proambient 指“支持环境保护、偏向环保”的；英语里更常用 pro-environmental。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or promoting the protection of the environment; environmentally friendly in intention.","zh":"支持或促进环境保护的；倾向环保的（强调立场或理念）。"},"examples":[{"en":"The company says its new packaging is proambient and uses less plastic.","zh":"这家公司说他们的新包装是“proambient（环保取向）”的，用的塑料更少。"},{"en":"She prefers proambient policies, like improving public transportation.","zh":"她更支持环保取向的政策，比如改善公共交通。"}]}],"synonyms":["pro-environmental","eco-friendly","environmentally friendly","green"],"phonetic":"/ˌproʊˈæmbiənt/","extraExplanation":["“proambient”在英语里并不常见，更常见、也更自然的说法是“pro-environment”或“pro-environmental”。如果你在文章、品牌、口号里看到“proambient”，通常是借用拉丁语系语言（如葡萄牙语/西班牙语中与“环境”相关的表达）或作为营销用词。","构词上可以理解为“pro-（支持）+ ambient（环境/周围）”。在英语里“ambient”更常指“周围的、环境的”（如 ambient light 环境光），所以母语者更容易理解“pro-environmental”。"]}
{"word":"proamendment","summary":{"en":"“Pro-amendment” means in favor of a proposed amendment, often in politics or law.","zh":"“Pro-amendment”指赞成某项修正案（常见于政治或法律语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a proposed amendment (especially a change to a law or a constitution).","zh":"支持某项修正案（尤其是对法律或宪法的修改）的。"},"examples":[{"en":"The senator took a pro-amendment position during the debate.","zh":"这位参议员在辩论中采取了支持修正案的立场。"},{"en":"Several pro-amendment groups organized rallies to encourage voters.","zh":"一些支持修正案的团体组织集会来鼓励选民。"}]}],"synonyms":["in favor of the amendment","supporting the amendment","pro-reform"],"phonetic":"/ˌproʊ əˈmendmənt/","extraExplanation":["“pro-”在英语里常作前缀，表示“支持/赞成”（如 pro-democracy 亲民主的）。因此 pro-amendment 常用于政治与公共政策语境，指“支持某项修正案的一方/立场”。","写作中也常见作定语搭配：pro-amendment stance/argument/campaign（支持修正案的立场/论点/运动）。在美式英语里，amendment 也常特指美国宪法修正案（如 the Second Amendment）。"]}
{"word":"proamnion","summary":{"en":"Proamnion is a rare scientific term for a very early temporary embryonic membrane that forms before the amnion in some animals.","zh":"Proamnion（原羊膜）是少见的科学术语，指某些动物在羊膜形成之前出现的早期暂时性胚胎膜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very early embryonic membrane (a temporary sac) in some animals, formed before the amnion develops","zh":"（胚胎学）原羊膜：某些动物在真正的羊膜形成之前出现的一种非常早期、暂时性的胚胎膜（囊膜）"},"examples":[{"en":"In some embryos, the proamnion appears before the amnion is fully formed.","zh":"在一些胚胎中，原羊膜会在羊膜完全形成之前出现。"},{"en":"Researchers use the term proamnion when describing early extraembryonic membranes.","zh":"研究人员在描述早期胚外膜时会使用“原羊膜”这个术语。"}]}],"synonyms":["pre-amnion (rare)"],"phonetic":"/proʊˈæmniən/","extraExplanation":["这是一个非常专业的胚胎学术语，常见于比较胚胎学（不同动物的胚胎发育比较）与早期胚外结构的描述中。日常英语中几乎不会用到。","词源上可理解为 pro-（在……之前）+ amnion（羊膜），强调“先于羊膜出现”的阶段性结构。不同动物类群的胚外膜发育过程不完全相同，因此是否出现“proamnion”以及其形态/功能在文献中可能有所差异。"]}
{"word":"proamniotic","summary":{"en":"Proamniotic means “before the amnion forms” in early embryo development.","zh":"Proamniotic 指“羊膜形成之前”的胚胎早期阶段（羊膜前）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the early embryonic stage before the amnion (the inner membrane that surrounds the embryo) has formed; pre-amniotic.","zh":"与羊膜形成之前的胚胎早期阶段有关的；羊膜前的。"},"examples":[{"en":"In some lab notes, the tissue was labeled as proamniotic to indicate it was taken before the amnion developed.","zh":"在一些实验记录里，组织被标注为 proamniotic，用来表示取样时间在羊膜发育之前。"},{"en":"Researchers compared gene activity in proamniotic embryos and later embryos to see when certain cells begin to specialize.","zh":"研究人员比较了羊膜前胚胎与更晚期胚胎的基因活性，以观察某些细胞何时开始分化。"}]}],"synonyms":["pre-amniotic","preamnionic (rare)"],"phonetic":"/ˌproʊ.æm.niˈɑː.tɪk/","extraExplanation":["这是一个偏专业的胚胎学/发育生物学术语：amniotic（羊膜的）指哺乳动物胚胎周围的羊膜；pro- 有“在……之前”的意思，所以 proamniotic 就是“羊膜形成之前的”。","在学术写作中，它常用来描述“阶段/组织/胚胎（stage/tissue/embryo）”，例如 proamniotic stage（羊膜前阶段）。一般日常英语几乎不用。"]}
{"word":"proamusement","summary":{"en":"Proamusement (rare) means supporting or promoting amusement/entertainment; often used as “pro-amusement.”","zh":"proamusement（较罕见）指“支持或提倡娱乐/消遣”；常写作 pro-amusement。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Supporting or favoring amusement/entertainment; pro-entertainment.","zh":"（罕见）支持或赞成娱乐/消遣的；偏向“娱乐优先”的。"},"examples":[{"en":"The mayor’s pro-amusement stance led to more funding for festivals and concerts.","zh":"市长的“支持娱乐”立场促使政府为节庆和音乐会投入更多资金。"},{"en":"Some critics say the policy is too pro-amusement and not serious enough about education.","zh":"一些批评者说这项政策太偏向娱乐，对教育不够重视。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A viewpoint or policy that promotes amusement or leisure activities.","zh":"（罕见）鼓励娱乐或休闲活动的观点/政策取向。"},"examples":[{"en":"The debate turned into a clash between pro-amusement and pro-safety arguments.","zh":"这场辩论变成了“支持娱乐”与“强调安全”两种观点的对抗。"}]}],"synonyms":["pro-entertainment","leisure-friendly","fun-focused","pro-leisure"],"phonetic":"/ˌproʊ əˈmjuzmənt/","extraExplanation":["“proamusement / pro-amusement”不是常见词，更多是把前缀 pro-（“支持、赞成”）加在 amusement（“娱乐、消遣”）前面形成的临时组合，用来表达“立场上偏向娱乐/休闲”。日常更常用的说法是 pro-entertainment（偏娱乐）、pro-leisure（偏休闲）或 leisure-friendly（对休闲友好）。","写作中如果要用，建议加连字符 pro-amusement，更清晰易读。它多出现在评论、政策讨论或对比语境里（如“pro-amusement vs. pro-safety”）。"]}
{"word":"proanaphora","summary":{"en":"A proanaphora is an anaphoric pro-form that stands in for earlier wording to avoid repetition (e.g., “do so,” “one,” “so”).","zh":"proanaphora 指一种回指前文以避免重复的“替代形式/代形”（如 do so、one、so）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or phrase that replaces a longer expression earlier in the discourse (an antecedent), usually to avoid repetition; an anaphoric pro-form such as “do so,” “one,” or “so”","zh":"（语言学）用来替代前文较长表达以避免重复的词或短语；一种指代前文内容的“替代形式/代形”，如 do so、one、so 等"},"examples":[{"en":"Lina said she would apologize, and she did so the next day.","zh":"Lina 说她会道歉，第二天她就这么做了（did so 替代“apologize”）。"},{"en":"I need a pen. Do you have one?","zh":"我需要一支笔。你有一支吗？（one 替代“a pen”）。"},{"en":"He said the plan was risky, and I think so too.","zh":"他说这个计划很冒险，我也这么认为（so 替代前面的评价/看法）。"}]}],"synonyms":["anaphoric pro-form","pro-form","proform","anaphoric substitute"],"phonetic":"/ˌproʊəˈnæfərə/","extraExplanation":["“proanaphora”由 pro-（代替）+ anaphora（回指/照应）构成，强调它是一种“回指性的替代”。它不一定是代词（pronoun）：代词常替代名词短语（he, it），而 proanaphora 也可以替代动词短语或整句话的内容（do so / so）。","在语法研究中，常把这类替代形式看作 cohesion（语篇衔接）手段：通过“替代”把句子连在一起，同时避免重复。常见相关形式包括：do so（替代动作/动词短语）、one/ones（替代可数名词）、so/not（替代观点或从句内容）。"]}
{"word":"proanaphoral","summary":{"en":"Proanaphoral describes a forward-pointing reference where a pronoun or expression refers to something mentioned later.","zh":"Proanaphoral 指“向前指”的指代：先出现指代形式，后文才出现真正的所指。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing a word or expression that refers forward to something mentioned later in the sentence or discourse (a type of forward-pointing reference, similar to cataphora).","zh":"（语言学）指一种“向前指”的指代：某个词或表达先出现，但它所指的内容在后文才出现（类似于回指/前指中的“后照应”cataphora）。"},"examples":[{"en":"In “When he arrived, John sat down,” some linguists describe “he” as proanaphoral because its clear referent (“John”) comes later.","zh":"在“When he arrived, John sat down”中，一些语言学家会说“he”具有 proanaphoral（向前指）用法，因为它明确的所指（“John”）在后面才出现。"},{"en":"A proanaphoral pronoun can be confusing if the later noun phrase is far away.","zh":"如果后面真正的名词短语离得很远，proanaphoral（向前指）的代词可能会让人读起来困惑。"}]}],"synonyms":["cataphoric","forward-pointing","anticipatory (reference)"],"phonetic":"/ˌproʊ.əˈnæf.ər.əl/","extraExplanation":["“proanaphoral”非常少见，多见于语言学讨论中；更常见的术语是 **cataphoric / cataphora**（后照应、前指）来表示“先出现指代词，后出现被指对象”。","可以把它理解为 anaphora（通常指“回指”，指向前文）的一种反向情况：先用代词/指示语占位，后文再揭示真正指的是谁/什么。","写作上，英语里这种结构常用于制造悬念或保持句子连贯，但在学术写作中要避免造成歧义。"]}
{"word":"proanarchic","summary":{"en":"“Proanarchic” means supportive of anarchism or anti-authoritarian ideas.","zh":"“proanarchic”指支持无政府主义或反权威思想的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting, favoring, or sympathetic to anarchism (the belief that society should not be governed by a state or coercive authority).","zh":"支持、赞同或同情无政府主义（主张社会不应由国家或强制性权威统治的思想）。"},"examples":[{"en":"Some students joined a proanarchic reading group to discuss anti-authoritarian political ideas.","zh":"一些学生参加了一个亲无政府主义的读书小组，讨论反权威的政治思想。"},{"en":"The article takes a proanarchic stance, arguing that communities can organize themselves without a central state.","zh":"这篇文章采取亲无政府主义立场，认为社区无需中央国家也能自我组织。"}]}],"synonyms":["pro-anarchist","anarchist-leaning","anti-authoritarian"],"phonetic":"/ˌproʊ.æˈnɑːr.kɪk/","extraExplanation":["“pro-”表示“支持/赞成”，加在“anarchic/ anarchism（无政府的/无政府主义）”前形成“proanarchic”。常见于政治评论、学术讨论或媒体报道中，用来描述某种立场或倾向。","需要注意语境：在不同国家与媒体中，“proanarchic”可能带有强烈的评价色彩（褒义或贬义不一），有时也会被用来泛指“反政府/反体制”，但这不一定准确等同于无政府主义思想本身。"]}
{"word":"proanarchism","summary":{"en":"Proanarchism means support for anarchism or sympathy toward anarchist ideas.","zh":"proanarchism 指“亲无政府主义”，即支持或同情无政府主义思想/运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for anarchism; the belief that society should organize without a centralized government or coercive authority (often emphasizing voluntary cooperation).","zh":"亲无政府主义；支持无政府主义的立场或思想（主张社会不依赖中央政府或强制权威，而以自愿合作为基础）。"},"examples":[{"en":"Her essays argue for proanarchism as a way to reduce state violence.","zh":"她的文章主张亲无政府主义，认为这能减少国家暴力。"},{"en":"The group’s proanarchism focuses on mutual aid rather than elections.","zh":"这个团体的亲无政府主义更强调互助，而不是选举。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A political stance that is sympathetic to anarchist ideas or movements, even if not fully anarchist.","zh":"（较少见）对无政府主义思想或运动抱持同情、支持的政治立场（即使并非完全认同无政府主义）。"},"examples":[{"en":"He described himself as proanarchism, but he still accepted some limited forms of government.","zh":"他自称亲无政府主义，但仍接受某些有限形式的政府。"}]}],"synonyms":["support for anarchism","pro-anarchist stance","sympathy for anarchism"],"phonetic":"/ˌproʊˈænərˌkɪzəm/","extraExplanation":["“pro-”是英语前缀，表示“支持、赞成”（如 pro-democracy 亲民主）。因此 proanarchism 字面意思就是“支持无政府主义”。","这个词在日常英语中不常见，更常出现在政治讨论、学术写作或网络社群里。更自然的说法通常是 “pro-anarchist (adj.)” 或 “supportive of anarchism”。","理解时要注意：anarchism 在英语语境里通常是一套政治哲学（强调反对强制统治、重视自愿结社与互助），不等同于“混乱、无法无天”（那种含义更接近 anarchy 的口语误用）。"]}
{"word":"proanarchy","summary":{"en":"Proanarchy means supporting or advocating anarchy; it can describe a viewpoint or be used as a label in political discussion.","zh":"proanarchy 指“亲无政府”的：支持或主张无政府状态/无政府社会；也可指这种立场本身，常见于政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring anarchy (a society without a government or formal authority); often used in political discussion.","zh":"支持或赞成“无政府状态/无政府社会”（没有政府或正式权威的社会）；常用于政治讨论。"},"examples":[{"en":"Some people label the group as proanarchy, but the group says it supports community self-management, not chaos.","zh":"有人给这个团体贴上“亲无政府”的标签，但该团体表示它支持社区自我管理，而不是混乱。"},{"en":"The writer’s proanarchy views appear throughout the essay, especially in the sections criticizing state power.","zh":"这位作者的亲无政府观点贯穿全文，尤其是在批评国家权力的部分。"}]},{"partOfSpeech":"n.","definition":{"en":"the position or belief that anarchy is desirable or should be promoted.","zh":"认为无政府社会是理想的、值得推动的立场或信念。"},"examples":[{"en":"His proanarchy is grounded in the idea that people can cooperate without centralized control.","zh":"他的“亲无政府”立场基于这样一种看法：人们可以在没有中央控制的情况下合作。"}]}],"synonyms":["pro-anarchy","anarchist (context-dependent)","anti-government (approx.)"],"phonetic":"/ˌproʊˈænərki/","extraExplanation":["“pro-”是英语常见前缀，表示“赞成、支持”（如 pro-democracy 亲民主）。因此 proanarchy 常写作 pro-anarchy，更清楚易读。","注意区分：anarchy 在日常新闻里常被用来指“混乱、无法无天”，但在政治思想传统中（如无政府主义 anarchism）也可以指一种强调自愿合作、反对强制统治的社会组织理念。语境不同，语气可能从中性到强烈贬义不等。","如果你想表达“支持无政府主义思想”，更常见、也更标准的词是 anarchist（无政府主义者）或 anarchistic（无政府主义的），以及 pro-anarchism（亲无政府主义立场）。"]}
{"word":"proangiosperm","summary":{"en":"Proangiosperm means a proposed or very early precursor/ancestor of angiosperms (flowering plants), used mainly in scientific contexts.","zh":"Proangiosperm 指“被子植物（开花植物）的假设或早期前身/祖先”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hypothetical or very early ancestor/precursor of flowering plants (angiosperms), used mainly in paleobotany or evolutionary discussions","zh":"（主要用于古植物学/进化讨论的）被假设或非常早期的被子植物祖先/前身"},"examples":[{"en":"Some researchers have used the term proangiosperm to discuss possible transitional forms before true flowering plants evolved.","zh":"一些研究者用 proangiosperm 来讨论在真正的开花植物出现之前可能存在的过渡类型。"},{"en":"The fossil record is incomplete, so proangiosperm remains a tentative label rather than a clearly defined group.","zh":"由于化石记录不完整，proangiosperm 仍更多是一种暂时性的称呼，而不是界定清楚的类群。"}]}],"synonyms":["proto-angiosperm","early angiosperm","stem angiosperm"],"phonetic":"/ˌproʊˈændʒi.oʊˌspɝm/","extraExplanation":["词源上可拆为 pro-（“在……之前/前期”）+ angiosperm（“被子植物”）。它不是日常英语词汇，多见于学术写作，用来指“被子植物出现之前的可能祖先或前体”。","在正式科学语境中，更常见的表达是 “early angiosperms（早期被子植物）”“stem angiosperms（被子植物干群）”或更具体的化石类群名称；proangiosperm 往往带有“假设性/概念性”的色彩。"]}
{"word":"proangiospermic","summary":{"en":"A rare scientific adjective meaning “having characteristics of very early or precursor angiosperms (flowering plants).”","zh":"一个罕见的科学形容词，意为“具有早期或前身被子植物（开花植物）特征的；前被子植物性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a very early (primitive or ancestral) stage of flowering plants (angiosperms), or suggesting a form that may have existed before true angiosperms evolved.","zh":"与早期（原始或祖先型）的被子植物（开花植物）有关的；或指可能存在于真正被子植物出现之前的过渡/前身形态。"},"examples":[{"en":"Some fossils have been described as proangiospermic because they show partial angiosperm-like features.","zh":"一些化石被描述为 proangiospermic（前被子植物性的），因为它们呈现出部分类似被子植物的特征。"},{"en":"The paper discusses a proangiospermic hypothesis for the origin of enclosed seeds.","zh":"这篇论文讨论了关于“种子被包被（封闭）”起源的前被子植物性假说。"}]}],"synonyms":["pre-angiospermic","proto-angiospermic","angiosperm-like"],"phonetic":"/ˌproʊˌændʒi.oʊˈspɝːmɪk/","extraExplanation":["这是一个非常少见、主要出现在古植物学/植物进化研究中的学术词。","构词上：pro- 表示“在……之前/早期的”；angiosperm 指“被子植物”（angio- “容器/包裹” + -sperm “种子”）；-ic 表示“……的”。","使用时通常带有推测性：并不一定代表一个被正式承认的分类群，而是用来形容“更像被子植物的早期特征/可能的祖先状态”。"]}
{"word":"proangiospermous","summary":{"en":"A rare botanical adjective meaning “pre- or proto-angiosperm; resembling or ancestral to flowering plants.”","zh":"一个罕见的植物学形容词，指“前/原始被子植物的；类似或可能为开花植物祖先的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or thought to be ancestral to angiosperms (flowering plants), especially in discussions of early plant evolution.","zh":"与被子植物（开花植物）有关的；类似被子植物的；被认为是被子植物祖先类型的（常用于早期植物演化研究）。"},"examples":[{"en":"Some fossil leaves have been described as proangiospermous because they show traits that look like early flowering plants.","zh":"一些叶片化石被描述为 proangiospermous，因为它们呈现出类似早期开花植物的特征。"},{"en":"The paper discusses a proangiospermous lineage that may bridge gymnosperms and angiosperms.","zh":"该论文讨论了一条可能连接裸子植物与被子植物的 proangiospermous 谱系。"}]}],"synonyms":["proto-angiospermous","pre-angiospermous","angiosperm-like"],"phonetic":"/ˌproʊˌændʒioʊˈspɝməs/","extraExplanation":["这是一个非常少见、偏学术的植物学形容词：pro-（“在……之前/原始的/前驱的”）+ angiosperm（被子植物）+ -ous（形容词后缀，“具有……性质的”）。","在现代英文里更常见的表达是“proto-angiosperm（原始被子植物/前被子植物）”或“angiosperm-like（类似被子植物的）”。使用 proangiospermous 往往出现在古植物学、系统发育与演化讨论中，用来强调“被子植物出现之前的、具备类似特征的类型”。"]}
{"word":"proanimistic","summary":{"en":"“Proanimistic” means supportive of animism or inclined to interpret nature as having spirit or agency.","zh":"“proanimistic”指支持泛灵论，或倾向把自然界解读为具有灵性与能动性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring animism (the belief that natural objects, places, or animals can have spirits).","zh":"支持或赞同“泛灵论”（认为自然物、地点或动物可能具有灵魂/灵力的信仰）的。"},"examples":[{"en":"The author takes a proanimistic view, describing rivers and mountains as living presences.","zh":"作者采取亲泛灵论的观点，把河流和山脉描写成有生命的存在。"},{"en":"Her proanimistic interpretation of the story treats the forest as a character with intentions.","zh":"她对故事的亲泛灵论式解读，把森林当作一个有意图的“角色”。"}]}],"synonyms":["pro-animist","animism-friendly","animistic","spiritual-ecological (context-dependent)"],"phonetic":"/ˌproʊˌænəˈmɪstɪk/","extraExplanation":["“pro-”是前缀，表示“支持/赞成”；“animistic”来自“animism（泛灵论）”。因此 proanimistic 通常用于学术、文学批评或宗教学语境，表示立场或倾向，而不是日常口语常用词。","“泛灵论”在不同文化与宗教传统中出现过：例如某些原住民信仰或民间传统会把山川、树木、动物视为具有灵性。使用该词时应注意尊重相关文化，不把真实传统简单等同于“迷信”。"]}
{"word":"proannexation","summary":{"en":"“Proannexation” (more commonly “pro-annexation”) means supporting annexation.","zh":"“proannexation”（更常写作“pro-annexation”）指“支持吞并/并吞”的立场或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring annexation (the act of one country or region taking control of another area and making it part of itself).","zh":"支持或赞成“吞并/并吞”（指一个国家或地区将另一地区纳入其领土、使其成为一部分）的。"},"examples":[{"en":"The pro-annexation party argued that joining the neighboring country would bring economic benefits.","zh":"支持吞并的政党主张，加入邻国会带来经济利益。"},{"en":"Pro-annexation protests broke out in the capital, while others demanded independence.","zh":"首都爆发了支持吞并的抗议活动，而另一些人则要求独立。"},{"en":"The newspaper published a pro-annexation editorial after the referendum.","zh":"公投后，这家报纸发表了一篇支持吞并的社论。"}]}],"synonyms":["pro-annexation","annexationist","in favor of annexation","pro-unification (context-dependent)"],"phonetic":"/ˌproʊˌænekˈseɪʃən/","extraExplanation":["“proannexation”更常见的写法是带连字符的 **pro-annexation**，表示“亲……、支持……”的立场（pro- + annexation）。在新闻与学术写作中，这类词常用来描述政治立场（例如 pro-democracy 亲民主、pro-independence 亲独立）。","语境上通常与领土争端、殖民历史、战争或公投等议题相关；使用时要注意它是立场标签，可能带有强烈政治色彩。"]}
{"word":"proannexationist","summary":{"en":"Proannexationist means supporting annexation, or a person who supports annexing a territory.","zh":"proannexationist 指支持吞并（兼并、并入）领土的（人/立场）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting the annexation of a territory (the act of one country or state taking control of another area and making it part of itself).","zh":"支持吞并（兼并）某块领土的；主张将某地区并入本国（或本州）的。"},"examples":[{"en":"The proannexationist campaign argued that the territory would gain security and investment.","zh":"亲吞并派的竞选宣传称，这片领土会因此获得安全保障与投资。"},{"en":"Many residents rejected proannexationist arguments and preferred autonomy.","zh":"许多居民反对亲吞并派的观点，更倾向于自治。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports annexation of a territory.","zh":"支持吞并（兼并）领土的人；主张并入派人士。"},"examples":[{"en":"Proannexationists were outspoken at public meetings.","zh":"在公开会议上，支持吞并的人士发言非常积极。"},{"en":"He was labeled a proannexationist by opponents during the debate.","zh":"在辩论中，对手给他贴上了“亲吞并派”的标签。"}]}],"synonyms":["pro-annexation","annexationist","expansionist (broader)","pro-expansion (broader)"],"phonetic":"/ˌproʊ ˌænɛkˈseɪʃənɪst/","extraExplanation":["这个词由 pro-（“支持”）+ annexation（“吞并、并入”）+ -ist（“……主义者/支持者”）构成，常用于政治、历史语境。","写法上也常见 pro-annexationist（加连字符）更清晰；在正式写作中，最好配合具体对象说明“支持吞并谁/哪块领土”，以避免含糊或引发误解。"]}
{"word":"proantarctic","summary":{"en":"Proantarctic means “near or just north of Antarctica,” especially in scientific contexts.","zh":"Proantarctic 指“靠近南极、位于南极以北的近南极地区”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the region just north of Antarctica (the waters and islands on the Antarctic fringe), often used in geography, oceanography, and biology.","zh":"与南极洲以北的近南极地区有关的（指靠近南极的海域与岛屿等边缘地带），常用于地理、海洋学与生物学语境。"},"examples":[{"en":"Proantarctic islands are important breeding sites for seabirds.","zh":"近南极群岛是海鸟重要的繁殖地。"},{"en":"The expedition studied proantarctic ocean currents and their effect on climate.","zh":"这次考察研究了近南极洋流及其对气候的影响。"},{"en":"Some plants have adapted to proantarctic winds and cold, wet conditions.","zh":"一些植物已经适应了近南极地区多风、寒冷且潮湿的环境。"}]}],"synonyms":["subantarctic","near-Antarctic","Antarctic fringe"],"phonetic":"/ˌproʊænˈtɑrktɪk/","extraExplanation":["“pro-”在这里表示“在……之前/在……前方、靠近……的一侧”，因此 proantarctic 常被理解为“位于南极之前/靠近南极（但不在南极大陆内部）”的区域。","学术写作中更常见的相关词是 subantarctic（亚南极的），两者在一些语境里会被近似使用，但具体范围可能因学科（生态区划、海洋分区等）而不同。","该词多见于科研或报告文本（如生态、海洋环流、地质分带），日常英语里相对少用。"]}
{"word":"proanthropos","summary":{"en":"A rare term meaning “proto-human” or “pre-human,” used mainly in anthropological or speculative contexts.","zh":"一个罕见词，主要在人类学或推测性语境中指“原人/前人类（阶段）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hypothetical or very early human ancestor; a proto-human (rare, mostly in anthropological or speculative contexts).","zh":"（罕用，多见于人类学或推测性语境）假想的或非常早期的人类祖先；“原始人/原人”（proto-human）。"},"examples":[{"en":"Some early writers used “proanthropos” to mean a proto-human stage before modern humans.","zh":"一些早期作者用“proanthropos”来指现代人之前的“原人阶段”。"},{"en":"The novel imagines a proanthropos learning to use fire.","zh":"这部小说想象一位“原人”学会使用火。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a time or stage before humans as we know them; pre-human (rare).","zh":"（罕用）与“在人类（如我们所知的人类）之前”的时代或阶段有关的；史前人类之前的。"},"examples":[{"en":"The author describes a proanthropos world shaped by climate and migration.","zh":"作者描写了一个受气候与迁徙塑造的“前人类”世界。"}]}],"synonyms":["protohuman","early hominin","human ancestor","prehuman"],"phonetic":"/proʊ.ænˈθroʊ.pɑs/","extraExplanation":["词源上可拆为希腊语前缀 pro-（在……之前、向前）+ anthrōpos（人）。因此它字面含义接近“在人之前/原人”。","这个词在现代学术写作中并不常用；更常见的相关术语是 protohuman（原始人/原人）、early hominin（早期人族）、human ancestor（人类祖先）。如果你是在古人类学资料里看到它，也可能是作者的修辞用法或对术语的非标准拼写。"]}
{"word":"proapostolic","summary":{"en":"Proapostolic means supportive of the apostles or apostolic authority/teachings.","zh":"proapostolic 指“亲使徒的／支持使徒权威或使徒教导的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting, favoring, or aligned with the apostles or with apostolic authority/teachings (often used in religious or historical discussion).","zh":"支持使徒（们）或使徒权威／使徒教导的（多用于宗教或历史讨论）。"},"examples":[{"en":"The author takes a proapostolic view of early church leadership.","zh":"作者对早期教会的领导结构持亲使徒（支持使徒权威）的观点。"},{"en":"Some scholars describe the letter’s tone as strongly proapostolic.","zh":"一些学者认为这封信的语气非常“亲使徒”（强烈支持使徒立场）。"}]}],"synonyms":["pro-apostolic","apostle-supporting","aligned with apostolic teaching"],"phonetic":"/ˌproʊˌæpəˈstɑlɪk/","extraExplanation":["这是一个较少见、偏学术/宗教语境的构词：pro-（支持、赞成）+ apostolic（使徒的、使徒传统/权威的）。常用于描述“立场”或“倾向”，如 proapostolic stance/view（亲使徒立场/观点）。","在不同宗派或学术讨论中，“apostolic”可能指新约使徒本身、教会“使徒传承”（apostolic succession），或与“使徒时代”一致的教义与实践；因此 proapostolic 的具体含义需结合上下文判断。"]}
{"word":"proappointment","summary":{"en":"“Proappointment” is not standard English; you likely mean “appointment” (a scheduled meeting) or “pre-appointment” (before the appointment).","zh":"“proappointment”不是标准英语；你很可能想写“appointment（预约）”或“pre-appointment（预约前的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a mistaken combination of words. People usually mean “appointment” (a scheduled meeting) or “pre-appointment” (before an appointment).","zh":"不是标准英语单词，更可能是拼写错误或把词拼在一起。通常你想表达的是“appointment（预约/约会/任命）”或“pre-appointment（预约前的）”。"},"examples":[{"en":"I think you mean: “Do I need to book an appointment?”","zh":"我猜你想说：“我需要预约吗？”"},{"en":"Some clinics ask you to fill out a form pre-appointment.","zh":"有些诊所会要求你在预约前填写表格。"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible intended word) appointment: a time that is arranged for a meeting, usually with a doctor, a client, or an office.","zh":"（可能你想写的词）appointment：事先安排好的会面时间，常用于医生、客户或办事机构的预约。"},"examples":[{"en":"I have a dentist appointment at 3 p.m.","zh":"我下午三点有牙医预约。"},{"en":"Could we reschedule our appointment to Friday?","zh":"我们能把预约改到周五吗？"}]}],"synonyms":["(for appointment) booking","reservation","scheduled meeting","visit"],"phonetic":"/əˈpɔɪntmənt/","extraExplanation":["“pro-”常见含义是“支持/赞成”（pro-environment = 支持环保），而“pre-”表示“在……之前”（pre-appointment = 预约前）。如果你要表达“支持某项任命”，更自然的说法是 “pro-appointment” 或 “in favor of the appointment”，但这不是很常用的固定词。"]}
{"word":"proapportionment","summary":{"en":"“Proapportionment” means supporting apportionment—fairly distributing representation or resources, often in politics (e.g., redistricting).","zh":"“Proapportionment”指“支持按比例分配/分摊”的立场，常用于政治语境（如选区重划与席位分配）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or advocating apportionment (the fair distribution of seats, resources, or taxes among groups or regions).","zh":"支持“按比例分配/分摊”（例如按人口或比例分配席位、资源或税负）的；主张进行配额/分配的。"},"examples":[{"en":"The group took a proapportionment stance, arguing that seats should match population changes.","zh":"该团体采取支持按比例分配的立场，认为议席应反映人口变化。"},{"en":"In the debate, proapportionment speakers focused on fairness and equal representation.","zh":"在辩论中，支持按比例分配的发言者强调公平与平等代表性。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or policy position that favors apportionment.","zh":"支持按比例分配的观点或政策立场。"},"examples":[{"en":"Her proapportionment was clear in every speech about redistricting.","zh":"她在每次关于选区重划的演讲中都清楚表达了支持按比例分配的立场。"}]}],"synonyms":["in favor of apportionment","supporting apportionment","pro-reapportionment","pro–fair representation"],"phonetic":"/ˌproʊ.əˈpɔr.ʃən.mənt/","extraExplanation":["“pro-”是英语里表示“支持、赞成”的前缀（如 pro-democracy 支持民主，pro-choice 支持选择权）。因此 proapportionment 多见于政治/公共政策语境，尤其与选区重划（redistricting）和代表权分配有关。","该词并非高频标准词，更常见的表达是 “in favor of apportionment” 或 “supporting apportionment”。如果写正式文章，建议根据具体情境改用 “proportional representation”（比例代表制）或 “reapportionment”（重新分配席位/重新划分）等更常用术语。"]}
{"word":"proappreciation","summary":{"en":"A rare/creative term meaning “in favor of showing appreciation or gratitude.”","zh":"一个较少见/偏口语创作的说法，表示“支持表达感激或认可”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon) Support for, or advocacy of, showing appreciation; an attitude of being in favor of gratitude and recognition.","zh":"（不常见）支持或提倡表达感激与认可；一种“赞成感恩/赞赏”的态度。"},"examples":[{"en":"Our team culture is strongly proappreciation—we thank people for small wins, not just big ones.","zh":"我们的团队文化很“proappreciation”——我们会为小进步道谢，而不只为大成果。"},{"en":"The manager’s proappreciation approach improved morale quickly.","zh":"经理提倡“多表达认可”的做法很快提升了士气。"}]}],"synonyms":["pro-gratitude","appreciation-focused","in favor of appreciation","a culture of appreciation"],"phonetic":"/ˌproʊ.əˌpriː.ʃiˈeɪ.ʃən/","extraExplanation":["“proappreciation”不是常见词，更像把前缀 pro-（“赞成、支持”）和 appreciation（“欣赏、感激、认可”）拼在一起的自造词/新造词。正式写作中更自然的表达是：pro-appreciation（加连字符）、in favor of appreciation、a culture of appreciation、appreciation-focused。"]}
{"word":"proappropriation","summary":{"en":"Proappropriation means supporting appropriation, often used in debates about cultural appropriation.","zh":"proappropriation 指“支持挪用”的立场，常用于“文化挪用”相关讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting appropriation (especially in discussions about cultural appropriation or the use of others’ cultural elements).","zh":"支持“挪用/占用”的立场（常见于讨论“文化挪用”或使用他者文化元素的语境）。"},"examples":[{"en":"Some commentators take a proappropriation view, arguing that cultural exchange is normal and unavoidable.","zh":"一些评论者持“支持文化挪用”的观点，认为文化交流是正常且不可避免的。"},{"en":"The article was criticized for sounding proappropriation without addressing power imbalances.","zh":"这篇文章因听起来像是在支持文化挪用、却未讨论权力不平等而受到批评。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or position that supports appropriation.","zh":"支持挪用的观点/立场。"},"examples":[{"en":"Her proappropriation is based on the idea that art always borrows from the past.","zh":"她支持挪用的立场基于一种观点：艺术总是在借鉴过去。"}]}],"synonyms":["pro-appropriation","appropriation-friendly","in favor of appropriation"],"phonetic":"/ˌproʊ.əˌproʊ.priˈeɪ.ʃən/","extraExplanation":["“proappropriation”并不是非常常见或固定的词条，更常见的写法是“pro-appropriation”（带连字符），意思是“赞成挪用的”。在文化议题中，它通常与“cultural appropriation（文化挪用）”相关。","在英语讨论里，“appropriation”本身可中性（如艺术借用、预算拨款 appropriation），也可带批评意味（尤其指强势群体借用弱势群体文化并获利、忽视原文化语境）。因此“proappropriation”常会引发争议，使用时最好说明你指的是哪一种“appropriation”。"]}
{"word":"proapproval","summary":{"en":"“Proapproval” is an uncommon word meaning supportive approval; many people actually mean “preapproval” (approval in advance).","zh":"“proapproval”较不常见，可理解为“支持性的认可”；很多情况下人们其实想表达“preapproval”（预先批准）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Approval that is in favor of something; supportive approval.","zh":"（不常见）对某事的赞成或支持性的认可。"},"examples":[{"en":"The committee’s proapproval of the plan helped it move forward quickly.","zh":"委员会对该计划的支持性认可让它很快推进。"},{"en":"Public proapproval can influence how companies advertise new products.","zh":"公众的支持性认可会影响公司如何宣传新产品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often intended meaning) Approval given in advance, especially for a loan, credit card, or application; preapproval.","zh":"（常见真实意图）预先批准；尤指贷款、信用卡或申请的预先核准（preapproval）。"},"examples":[{"en":"She received mortgage preapproval before she started house hunting.","zh":"她在开始看房前就拿到了房贷预先批准。"},{"en":"The bank sent him a preapproval letter for a credit card.","zh":"银行给他寄来了一封信用卡预先批准信。"}]}],"synonyms":["approval","endorsement","support","preapproval","advance approval"],"phonetic":"/ˌproʊəˈpruvəl/","extraExplanation":["“proapproval”不是常见标准词，更常见的写法是“pro-approval”（带连字符，表示“支持/赞成的批准”）或你可能想表达“preapproval”（预先批准）。在正式写作中，建议用更常见的词以避免误解。"]}
{"word":"proaquatic","summary":{"en":"Proaquatic means favoring or adapted to living in water.","zh":"proaquatic 指“偏好水生环境或适应水中生活的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or adapted to life in water; relating to an aquatic way of life.","zh":"亲水的；偏好水生环境的；与水生生活方式有关的。"},"examples":[{"en":"Some amphibians have a proaquatic stage of life, spending most of their time in water.","zh":"有些两栖动物在生命的某个阶段表现出亲水性，大部分时间待在水里。"},{"en":"The species shows proaquatic behavior during the hot season to avoid dehydration.","zh":"这种物种在炎热季节会表现出偏向水生的行为，以避免脱水。"}]}],"synonyms":["aquatic","water-loving","water-adapted","semi-aquatic (related)"],"phonetic":"/ˌproʊ.əˈkwætɪk/","extraExplanation":["这个词在日常英语中很少见，更常出现在生物学、生态学或动物行为学的描述里。","构词上由 pro-（“支持/偏向”）+ aquatic（“水生的”）组成，因此语感上就是“偏向水里/更适合水中生活”。有时会和 semi-aquatic（半水生的）对比使用。"]}
{"word":"proarbitration","summary":{"en":"Pro-arbitration means favoring arbitration as a way to settle disputes instead of going to court.","zh":"pro-arbitration 指“支持以仲裁而非诉讼来解决争议”的立场或倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring the use of arbitration (a private method of resolving disputes outside court).","zh":"支持或倾向使用“仲裁”（在法院之外以较私密方式解决争议）的一种立场或态度。"},"examples":[{"en":"The company has a pro-arbitration policy in its employment contracts.","zh":"公司在雇佣合同中采取支持仲裁的政策。"},{"en":"Some judges are seen as pro-arbitration because they often enforce arbitration agreements.","zh":"有些法官被认为偏向仲裁，因为他们经常执行仲裁协议。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing laws, court decisions, or systems that encourage arbitration or make it easier to use.","zh":"形容法律、判决或制度鼓励仲裁、或让仲裁更容易被采用。"},"examples":[{"en":"A pro-arbitration ruling can limit how easily a dispute goes to court.","zh":"一项偏向仲裁的裁决可能会限制纠纷进入法院的难易度。"},{"en":"The new regulation is widely described as pro-arbitration.","zh":"这项新规被广泛称为“支持仲裁”的。"}]}],"synonyms":["arbitration-friendly","in favor of arbitration","supporting arbitration"],"phonetic":"/ˌproʊ ɑɹˈbɪtɹeɪʃən/","extraExplanation":["“pro-”在英语里是常见前缀，表示“支持/赞成”（如 pro-democracy, pro-choice）。因此 pro-arbitration 通常是带连字符的形容词（pro-arbitration），用于法律、商业与劳动关系语境。","仲裁（arbitration）常见于合同中的“仲裁条款”（arbitration clause / arbitration agreement）。支持仲裁的人通常强调效率、成本与保密性；批评者则可能担心程序透明度、上诉空间或当事人议价能力不对等。"]}
{"word":"proarbitrationist","summary":{"en":"A proarbitrationist is someone (or something) that supports using arbitration to settle disputes.","zh":"proarbitrationist 指支持用仲裁来解决争议的人，或指主张仲裁的立场/做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or favors arbitration (settling disputes by using a neutral third party) instead of going to court.","zh":"支持或赞成“仲裁”（由中立第三方裁决来解决争议）而不是上法庭诉讼的人。"},"examples":[{"en":"As a proarbitrationist, she argued that business disputes should be resolved quickly through arbitration.","zh":"作为一名支持仲裁的人，她主张商业纠纷应通过仲裁快速解决。"},{"en":"The proarbitrationist view is that arbitration can save time and legal costs.","zh":"支持仲裁的观点认为，仲裁可以节省时间和法律费用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring arbitration.","zh":"支持或偏向仲裁的；主张用仲裁解决争议的。"},"examples":[{"en":"The company took a proarbitrationist stance in its contracts.","zh":"该公司在合同中采取了支持仲裁的立场。"},{"en":"Some labor groups dislike strongly proarbitrationist policies.","zh":"一些劳工团体不喜欢强烈支持仲裁的政策。"}]}],"synonyms":["pro-arbitration advocate","supporter of arbitration","arbitration proponent","arbitration advocate"],"phonetic":"/ˌproʊ ɑrˈbɪˌtreɪʃənɪst/","extraExplanation":["“proarbitrationist”并不常见，更常见的表达是“pro-arbitration”或“proponent of arbitration”（仲裁的支持者）。","“仲裁（arbitration）”通常用于商业合同、雇佣争议或国际贸易纠纷；有时合同会包含“arbitration clause（仲裁条款）”，要求双方先走仲裁而不是直接起诉。"]}
{"word":"proarchery","summary":{"en":"“proarchery” usually means “pro archery”: professional-level competitive archery; it’s also commonly used as a brand or username.","zh":"“proarchery”通常指“pro archery”：职业/专业级竞技射箭；也常作为品牌或用户名。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"professional archery; archery practiced at a high competitive level (often for money, sponsorship, or as a career).","zh":"职业射箭；以高水平竞技为主的射箭运动（常与奖金、赞助或职业生涯相关）。"},"examples":[{"en":"She trains for pro archery events and travels for tournaments.","zh":"她为职业射箭赛事训练，并四处参加比赛。"},{"en":"Pro archery requires consistent form, mental focus, and careful equipment tuning.","zh":"职业射箭需要稳定的动作、专注的心理状态，以及对器材的细致调校。"}]},{"partOfSpeech":"other","definition":{"en":"(Brand/username use) a name suggesting “professional archery,” often used for clubs, shops, channels, or social media accounts.","zh":"（品牌/用户名用法）表示“专业射箭”的名称，常用于俱乐部、店铺、频道或社交媒体账号。"},"examples":[{"en":"I bought my arrows from ProArchery online.","zh":"我在网上的 ProArchery 店铺买了箭。"},{"en":"Search “ProArchery” to find their training videos.","zh":"搜索“ProArchery”就能找到他们的训练视频。"}]}],"synonyms":["professional archery","competitive archery"],"phonetic":"/proʊ ˈɑrtʃəri/","extraExplanation":["“proarchery / ProArchery”通常不是传统词典词条，更常见为“pro archery”（两个词）或作为品牌/账号名使用。","“pro-”在英语里常表示“职业的/专业的”，如 pro athlete（职业运动员）、pro league（职业联赛）。"]}
{"word":"proarctic","summary":{"en":"Proarctic describes something that supports Arctic interests or relates to areas/conditions near the Arctic (rare).","zh":"proarctic 指“支持北极相关利益/政策”的，或（较少见）“与接近北极的地区/环境条件有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting, promoting, or favoring Arctic interests, policies, or research.","zh":"支持、推动或偏向北极相关利益、政策或研究的。"},"examples":[{"en":"The senator took a proarctic stance on funding polar climate research.","zh":"这位参议员在资助极地气候研究方面采取了支持北极的立场。"},{"en":"Some groups argue for proarctic regulations to protect Arctic ecosystems.","zh":"一些团体主张制定偏向北极保护的法规，以保护北极生态系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to regions near the Arctic or approaching Arctic conditions (a rare, specialized use).","zh":"与接近北极的地区或逐渐呈现北极环境条件有关的（较少见、偏专业用法）。"},"examples":[{"en":"The expedition moved into proarctic waters where sea ice becomes more common.","zh":"探险队进入了接近北极的海域，那里海冰变得更常见。"},{"en":"Proarctic vegetation can survive short summers and long winters.","zh":"接近北极环境的植被能在短暂夏季和漫长冬季中生存。"}]}],"synonyms":["pro-Arctic","Arctic-friendly","Arctic-focused","polar-supporting"],"phonetic":"/proʊˈɑrktɪk/","extraExplanation":["“proarctic”并不是高频词，更常见的写法是带连字符的“pro-Arctic”（表示“支持北极/有利于北极”）。","词形上由前缀“pro-”（可表示“支持/赞成”，也可表示“向前、在……之前”）+ “arctic”构成；在不同语境中可能引出“支持北极”或“接近北极/趋向北极条件”的理解。阅读时可根据上下文判断。"]}
{"word":"proaristocracy","summary":{"en":"“Pro-aristocracy” means supporting aristocrats or aristocratic rule.","zh":"“Pro-aristocracy（亲贵族）”指支持贵族或贵族统治。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring rule by an aristocracy (a hereditary upper class) or the interests of aristocrats.","zh":"支持或偏向贵族统治（由世袭上层阶级掌权）或贵族利益的。"},"examples":[{"en":"Some critics called the reform plan pro-aristocracy because it protected noble privileges.","zh":"一些批评者称这项改革方案“亲贵族”，因为它保护了贵族特权。"},{"en":"The author argues that the constitution was not pro-aristocracy, but it still benefited wealthy elites.","zh":"作者认为这部宪法并非“亲贵族”，但它仍让富裕精英受益。"}]},{"partOfSpeech":"n.","definition":{"en":"a pro-aristocracy position, movement, or person (someone who supports aristocratic power).","zh":"亲贵族的立场、运动或人士（支持贵族权力的人）。"},"examples":[{"en":"In the debate, the pro-aristocracy insisted that titles preserved social order.","zh":"在辩论中，亲贵族派坚持认为头衔能维持社会秩序。"},{"en":"The novel portrays a pro-aristocracy character who resists democratic change.","zh":"小说刻画了一个亲贵族角色，他抵制民主变革。"}]}],"synonyms":["pro-nobility","aristocratic (in politics)","elitist (often negative)"],"phonetic":"/ˌproʊ əˈrɪstəˌkrɑsi/","extraExplanation":["“proaristocracy”更常见的写法是带连字符的“pro-aristocracy”，表示“支持/偏向贵族制度”。它多见于政治评论、历史讨论或学术写作中，日常口语里较少使用。","构词法：pro-（支持、赞成）+ aristocracy（贵族统治/贵族阶层）。类似表达还有 pro-democracy（亲民主）、pro-monarchy（亲君主制）。"]}
{"word":"proaristocratic","summary":{"en":"Pro-aristocratic means supporting or favoring aristocracy and elite social power.","zh":"Pro-aristocratic 指支持或偏向贵族阶层及其社会权力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting an aristocracy (the rule or influence of nobles/upper class); anti-egalitarian in politics or social values.","zh":"亲贵族的；支持贵族阶层（贵族统治或影响）的；在政治或社会观念上反对平等主义的。"},"examples":[{"en":"Some critics called the new voting law pro-aristocratic because it gave more power to wealthy families.","zh":"一些批评者称新的投票法“亲贵族”，因为它让富有家族拥有更大的权力。"},{"en":"Her essay takes a pro-aristocratic view of history, praising stable rule by elites.","zh":"她的文章以亲贵族的视角看待历史，称赞精英阶层带来的稳定统治。"}]}],"synonyms":["aristocratic (in attitude)","elitist","pro-elite","pro-nobility"],"phonetic":"/ˌproʊ ˌærəstəˈkrætɪk/","extraExplanation":["这个词更常见的写法是 **pro-aristocratic**（带连字符）。你输入的 *proaristocratic* 多半是拼写或排版合并造成的。","**pro-** 是前缀，表示“支持、赞成”（如 *pro-democracy* 亲民主的；*pro-environment* 亲环保的）。因此 **pro-aristocratic** 直译就是“支持贵族/贵族政治的”。","语境上它常用于政治评论或历史讨论，有时带批判色彩，暗示“偏向上层阶级、削弱平等”。"]}
{"word":"proarmy","summary":{"en":"“Pro-army” means supporting the army or favoring the army’s role or policies.","zh":"“pro-army”指支持军队或倾向于军队的角色与政策的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting the army or favoring the army’s role, policies, or actions.","zh":"亲军方的；支持军队（或军方政策/行动）的。"},"examples":[{"en":"The newspaper was criticized for taking a pro-army position during the conflict.","zh":"这家报纸因在冲突期间采取亲军方立场而受到批评。"},{"en":"Some voters prefer pro-army candidates, while others worry about military influence in politics.","zh":"一些选民更偏好亲军方的候选人，而另一些人担心军方对政治的影响。"}]}],"synonyms":["military-friendly","pro-military","army-supporting"],"phonetic":"/ˌproʊ ˈɑrmi/","extraExplanation":["“pro-”是英语里很常见的前缀，表示“支持、赞成”（例如：pro-democracy 亲民主的、pro-choice 支持选择权的）。因此 pro-army 通常写作连字符形式 pro-army，更清晰、更常见。","在新闻与政治语境中，pro-army 往往带有立场色彩，可能是中性描述，也可能带有批评或争议意味，具体取决于语境与说话者态度。"]}
{"word":"proarrhythmia","summary":{"en":"Proarrhythmia is when a treatment—often a heart-rhythm drug—triggers or worsens abnormal heart rhythms.","zh":"Proarrhythmia 指治疗（常为抗心律失常药）反而诱发或加重异常心律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a harmful effect in which a medicine or treatment (especially a heart-rhythm drug) causes a new abnormal heart rhythm or makes an existing arrhythmia worse","zh":"（有害反应）指药物或治疗（尤指抗心律失常药）诱发新的心律失常，或使原有心律失常加重"},"examples":[{"en":"Some antiarrhythmic drugs can cause proarrhythmia, so patients need close monitoring.","zh":"一些抗心律失常药可能引起促心律失常，因此需要密切监测患者。"},{"en":"The doctor stopped the medication because of suspected proarrhythmia.","zh":"医生因怀疑出现促心律失常而停用了该药。"}]}],"synonyms":["arrhythmia worsening","drug-induced arrhythmia","treatment-induced arrhythmia"],"phonetic":"/ˌproʊ.əˈrɪð.mi.ə/","extraExplanation":["“proarrhythmia”由前缀 pro-（促使、引发）+ arrhythmia（心律失常）构成，意思不是“治疗心律失常”，而是“促发/加重心律失常”的副作用。","临床上常见的关联情境包括：用药后 QT 间期延长、出现尖端扭转型室速（torsades de pointes）等风险，因此医生会关注心电图、血钾/镁等电解质，以及药物相互作用。"]}
{"word":"proart","summary":{"en":"ProArt usually refers to ASUS’s creator-focused product line; informally, “pro art” can mean professional-level art.","zh":"ProArt 通常指华硕面向创作者的产品线；非正式用法中，“pro art”也可指“专业水平的艺术/作品”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(often written ProArt) A brand name used especially by ASUS for computers, monitors, and related hardware designed for professional creators (designers, photographers, video editors, etc.).","zh":"（常写作 ProArt）一个品牌名，尤其指华硕（ASUS）旗下为专业创作者（设计师、摄影师、视频剪辑等）打造的电脑、显示器等硬件产品线。"},"examples":[{"en":"She bought an ASUS ProArt monitor because she needs accurate colors for photo editing.","zh":"她买了华硕 ProArt 显示器，因为修图需要准确的色彩。"},{"en":"The studio upgraded to a ProArt laptop for 4K video work.","zh":"工作室升级了一台 ProArt 笔记本来做 4K 视频。"}]},{"partOfSpeech":"phrase","definition":{"en":"“pro art” (informal): professional art or art made by professionals; sometimes used in conversation as a short label.","zh":"“pro art”（非正式）：专业艺术；由专业人士创作的艺术。有时在口语中作为简短标签使用。"},"examples":[{"en":"His portfolio looks more like pro art than a beginner’s work.","zh":"他的作品集看起来更像专业作品，而不是新手的。"},{"en":"This gallery focuses on pro art rather than student projects.","zh":"这个画廊更关注专业艺术作品，而不是学生项目。"}]}],"synonyms":["creator-focused","professional-grade","creative workstation","professional art"],"phonetic":"/proʊ ɑrt/","extraExplanation":["“ProArt”中“Pro-”常表示“professional（专业的）”。在科技产品语境里，它通常暗示：更重视色彩准确度、创作软件兼容性、接口扩展与散热等，目标用户是内容创作者。","如果你在文章或产品介绍里看到“ProArt”，多半是专有品牌名，建议首字母大写并连写：ProArt。若只是表达“专业艺术”，则更常写作“pro art”。"]}
{"word":"proarthri","summary":{"en":"“proarthri” is not a recognized English word; it is likely a misspelling or an incomplete medical term related to “arthr-” (joint).","zh":"“proarthri”不是规范英语词，可能是拼写错误或未打完整的医学词，可能与“arthr-（关节）”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “proarthri” looks like an incomplete fragment or a misspelling, often seen when typing medical terms.","zh":"不是标准英语单词。“proarthri”看起来像是不完整的词根/片段或拼写错误，常见于医学术语输入时。"},"examples":[{"en":"I couldn’t find “proarthri” in a dictionary—did you mean “proarthritis” or “arthritic”?","zh":"我在词典里找不到“proarthri”——你是不是想写“proarthritis”或“arthritic”？"},{"en":"If you share the full sentence, I can help identify the correct word.","zh":"如果你把完整句子发我，我可以帮你确认正确的单词。"}]}],"synonyms":["(possible intended) arthritis","(possible intended) arthritic","(possible intended) joint-related term"],"phonetic":"ˌproʊɑrˈθraɪ","extraExplanation":["“arthr-”常见于医学英语，来自希腊语，意思是“关节”（如 arthritis 关节炎，arthritic 患关节炎的）。你输入的“proarthri”可能是这些词的开头部分。","可能的目标词（取决于你原文）：\n1) arthritis /ɑrˈθraɪtɪs/：关节炎\n2) arthritic /ɑrˈθrɪtɪk/：关节炎的；患关节炎的\n3) proarthritis：较少见，可能指“关节炎前期/早期”的概念（不同文本用法不一）。\n把原句或你想表达的中文意思发来，我可以更准确判断。"]}
{"word":"proas","summary":{"en":"“Proas” means multiple proa—traditional Pacific outrigger boats/canoes.","zh":"“proas”是“proa”的复数，指多艘太平洋地区传统的支架独木舟/狭长帆船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of proa: a narrow boat (often an outrigger canoe) traditionally used in the Pacific Islands.","zh":"proa 的复数：一种狭长的船（常见为带侧浮木的独木舟/外伸支架船），传统上用于太平洋岛屿地区。"},"examples":[{"en":"We watched several proas crossing the lagoon at sunset.","zh":"我们看着几艘 proas 在日落时分穿过泻湖。"},{"en":"The museum has photos of proas used for long ocean journeys.","zh":"博物馆里有 proas 用于远洋航行的照片。"}]}],"synonyms":["outrigger canoe","canoes (general)"],"phonetic":"/ˈproʊ.əz/","extraExplanation":["“proa”一词常见于航海、民族志与旅行写作中，指密克罗尼西亚、马绍尔群岛等地的传统航船类型；其显著特点常是“单侧支架/侧浮木（outrigger）”以增加稳定性。","英语里可见两种复数：proas 与 proae；在现代英文书写中，proas 更常用、更直观。"]}
{"word":"proassessment","summary":{"en":"“proassessment” usually means a professional/expert assessment; it’s not a common standard spelling in English.","zh":"“proassessment”通常指“专业/专家评估”，但这种连写并不常见、也不算标准拼写。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an informal/marketing-style compound meaning “a professional (expert) assessment or evaluation.”","zh":"一种非正式或营销式组合词，意思是“专业人士（专家）做出的评估/测评”。"},"examples":[{"en":"Before surgery, you should get a pro assessment from a specialist.","zh":"手术前，你应该找专科医生做一次专业评估。"},{"en":"Our company offers a pro assessment of your resume and interview skills.","zh":"我们公司提供对你的简历和面试能力的专业测评。"}]}],"synonyms":["professional assessment","expert assessment","professional evaluation","skills assessment"],"phonetic":"/ˌproʊ əˈsɛsmənt/","extraExplanation":["“proassessment”并不是常见的标准英语拼写；更自然的写法通常是分开写的 “pro assessment”，或直接用更正式的 “professional assessment / expert assessment”。","如果你想表达“课前/事前测验”，英语里常用的是 “pre-assessment”（preassessment 也可见）。建议你确认语境：是“专业评估”还是“预评估/前测”。"]}
{"word":"proassociation","summary":{"en":"Proassociation (more commonly written “pro-association”) means supporting the forming or joining of an association, group, or alliance.","zh":"proassociation（更常写作 pro-association）指支持成立或加入协会/团体/联盟、赞成联合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, nonstandard) In favor of forming or joining an association, group, union, or alliance; supporting association.","zh":"（罕见、非标准用法）支持成立或加入某个协会/团体/联盟；赞成结社或联合的。"},"examples":[{"en":"The senator took a pro-association stance, encouraging small businesses to join trade groups.","zh":"这位参议员采取了支持结社的立场，鼓励小企业加入行业协会。"},{"en":"Their campaign message was strongly pro-association and focused on building partnerships.","zh":"他们的竞选信息明显偏向支持联合，重点在于建立合作关系。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Support for association; a pro-association viewpoint or policy.","zh":"（罕见）对结社/联合的支持；支持联合的观点或政策。"},"examples":[{"en":"The report argues for pro-association rather than isolation between the two communities.","zh":"这份报告主张两地社区应当相互联合，而不是彼此隔绝。"}]}],"synonyms":["pro-association","supportive of association","pro-union (in some contexts)","pro-alliance"],"phonetic":"ˌproʊ əˌsoʊsiˈeɪʃən","extraExplanation":["“proassociation”连写在英语里很少见，写作时更常用带连字符的“pro-association”。如果你想表达“职业协会”，通常说“professional association”（如：the American Medical Association）。","“pro-”常表示“支持/赞成”（pro-choice, pro-democracy），相对的是“anti-”（反对）。因此“pro-association”更自然的意思是“赞成结社/联合”。"]}
{"word":"proatheism","summary":{"en":"Pro-atheism means supporting or promoting atheism (favoring atheistic views).","zh":"Pro-atheism 指支持或推广无神论（偏向无神论观点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"support for atheism; the position of favoring or promoting atheism (the belief that there is no god or gods).","zh":"支持无神论；倾向于赞成或推广无神论（认为没有神或诸神的立场）。"},"examples":[{"en":"The article took a clearly pro-atheism stance and argued against religious explanations.","zh":"这篇文章明显站在支持无神论的立场上，并反对宗教式解释。"},{"en":"In the debate, her comments were seen as pro-atheism rather than neutral.","zh":"在辩论中，她的发言被认为是在支持无神论，而不是中立立场。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective, often written with a hyphen) favoring atheism; supportive of atheists or atheistic ideas.","zh":"（作形容词，常写作带连字符）偏向无神论的；支持无神论者或无神论观点的。"},"examples":[{"en":"He described the club as pro-atheism, but it welcomes students of any belief.","zh":"他把这个社团形容为“支持无神论的”，但它也欢迎任何信仰的学生。"},{"en":"A pro-atheism message may be offensive in some settings, so choose your words carefully.","zh":"在某些场合，支持无神论的信息可能会冒犯他人，所以用词要谨慎。"}]}],"synonyms":["pro-atheist","atheism advocacy","anti-theism (not the same)","secularism (related, broader)"],"phonetic":"/ˌproʊˈeɪθiˌɪzəm/","extraExplanation":["“proatheism”更常见的写法是“pro-atheism”（名词/形容词用法都可能），意思是“支持无神论”。在正式写作中加连字符更清晰，读者也更容易理解。","这是带有立场色彩的词，常用于讨论宗教、哲学或公共政策的语境。跨文化交流时要注意：不同社会对宗教/无神论话题的敏感度不同，表达时可用更中性的说法（如“non-religious perspective 非宗教视角”“secular viewpoint 世俗立场”）来减少对立感。"]}
{"word":"proatheist","summary":{"en":"Pro-atheist means supporting atheism or favoring atheists/atheism; it can also mean a person who does so.","zh":"pro-atheist 指支持无神论或对无神论/无神论者持肯定态度；也可指这样的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting atheism or expressing a positive attitude toward atheists/atheism (often used in debates about religion).","zh":"支持无神论，或对无神论/无神论者持肯定态度（常用于宗教相关讨论）。"},"examples":[{"en":"The article was criticized for being pro-atheist and dismissive of religious people.","zh":"这篇文章因被批评为“偏向无神论”、并轻视宗教人士而受到指责。"},{"en":"He says his goal isn’t to be pro-atheist, but to defend freedom of belief and non-belief.","zh":"他说他的目标不是“支持无神论”，而是捍卫信仰与不信仰的自由。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports atheism or promotes atheist viewpoints.","zh":"支持无神论或推广无神论观点的人。"},"examples":[{"en":"In the panel, a pro-atheist argued that morality doesn’t require religion.","zh":"在座谈中，一位支持无神论的人主张道德不需要宗教。"}]}],"synonyms":["pro-atheism","atheism-friendly","secular (often related)","supportive of atheism"],"phonetic":"/ˌproʊˈeɪθiɪst/","extraExplanation":["“proatheist”更常见的写法是“pro-atheist”（带连字符），表示“赞成/偏向无神论”。它常带有立场色彩，有时会被用作批评用语（暗示“偏颇”），因此在正式写作中可考虑更中性的表达，如“supportive of atheism / supportive of nonbelievers / secular”。","注意区分：pro-atheist（支持无神论）≠ anti-theist（反对有神论/宗教）。后者语气更强、更对立。"]}
{"word":"proatheistic","summary":{"en":"Proatheistic means supportive of or promoting atheism.","zh":"proatheistic 指“支持或宣扬无神论的；倾向无神论立场的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or promoting atheism (the belief that there is no god or gods), or favoring atheistic views in society, politics, or culture.","zh":"支持或宣扬无神论（认为不存在神或诸神的观点）；或在社会、政治、文化中倾向无神论立场。"},"examples":[{"en":"Some critics described the film as proatheistic because it questioned religious authority.","zh":"一些批评者认为这部电影带有“亲无神论”倾向，因为它质疑了宗教权威。"},{"en":"He denies being proatheistic; he says he supports freedom of belief for everyone.","zh":"他否认自己是“亲无神论”的；他说他支持每个人的信仰自由。"}]}],"synonyms":["pro-atheist","atheism-supporting","favoring atheism","secularist (sometimes, depending on context)"],"phonetic":"/ˌproʊˌeɪθiˈɪstɪk/","extraExplanation":["“proatheistic”并不是非常常见或标准化的词，更常见的写法是带连字符的“pro-atheist / pro-atheistic”。在正式写作里，你也可以用更清楚的表达，如“supportive of atheism（支持无神论）”“favoring atheism（倾向无神论）”。","在讨论宗教与政治、教育、媒体时，这个词可能带有立场色彩。为了更中性、避免引起误解，可以具体说明你指的是“支持无神论者的权利”还是“主张无神论观点本身”。"]}
{"word":"proathletic","summary":{"en":"Pro-athletic means supportive of sports and athletic activity; sometimes it also means related to professional athletics.","zh":"Pro-athletic 指“支持/提倡体育运动的”；有时也可指“与职业体育相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or promoting sports and athletic activity; favorable toward athletics (often used in school, policy, or community contexts).","zh":"支持或提倡体育运动的；对体育活动持赞成态度的（常用于学校、政策或社区语境）。"},"examples":[{"en":"The city council adopted a pro-athletic plan to build more public courts and fields.","zh":"市议会通过了一项支持体育的计划，建设更多公共球场和运动场。"},{"en":"Her parents are very pro-athletic and encourage their kids to join teams.","zh":"她的父母非常支持体育，鼓励孩子参加运动队。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to professional athletics or aimed at professional athletes (less common; often written as “pro athletic”).","zh":"与职业体育有关的；面向职业运动员的（较少见；常写作“pro athletic”）。"},"examples":[{"en":"He bought pro athletic gear designed for high-level competition.","zh":"他买了为高水平比赛设计的职业级运动装备。"},{"en":"The clinic offers training programs for pro athletic performance.","zh":"这家诊所提供提升职业运动表现的训练项目。"}]}],"synonyms":["sports-friendly","athletics-friendly","pro-sports","supportive of athletics","(sense 2) professional-level"],"phonetic":"/ˌproʊ æθˈlɛtɪk/","extraExplanation":["“pro-”是前缀，常表示“支持、赞成”（如 pro-environment, pro-democracy）。因此 pro-athletic 直译就是“支持体育的”。","拼写上有时会加连字符（pro-athletic）以更清晰；在更口语或广告语境中也可能写成 pro athletic。","如果你想表达“职业运动员”，更自然的说法通常是 professional athlete 或 pro athlete，而不是 *proathletic*。"]}
{"word":"proatlas","summary":{"en":"“Proatlas/ProAtlas” is usually a name for an atlas or mapping product; informally it can mean a professional-quality atlas.","zh":"“Proatlas/ProAtlas”通常是地图册或制图产品的名称；在非正式语境下也可指“专业级地图册”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand or product name used for a map/atlas-related tool or publication (not a standard dictionary word).","zh":"用于地图/地图册相关工具或出版物的品牌名或产品名（不是标准词典词汇）。"},"examples":[{"en":"I imported the GPS data into ProAtlas to create a route map.","zh":"我把 GPS 数据导入 ProAtlas 来生成路线图。"},{"en":"Check ProAtlas for the updated street layers.","zh":"去 ProAtlas 查看更新后的街道图层。"}]},{"partOfSpeech":"n.","definition":{"en":"An informal compound meaning “pro (professional) atlas”: a professional-quality atlas or map collection.","zh":"非正式合成词，意为“pro（专业的）+ atlas（地图册）”：专业级的地图册或地图汇编。"},"examples":[{"en":"For fieldwork, we brought a proatlas with detailed topographic maps.","zh":"做野外调查时，我们带了一本包含详细地形图的“专业地图册”。"},{"en":"This proatlas shows trails and elevation much more clearly than a basic map.","zh":"这本“专业地图册”比普通地图更清晰地标出步道和海拔。"}]}],"synonyms":["atlas","map book","gazetteer","mapping tool"],"phonetic":"/proʊˈætləs/","extraExplanation":["“ProAtlas”更常见的用法是专有名词（品牌/软件/项目名）。如果你是在某个网站、应用或论文里看到它，建议提供上下文（截图或句子），我可以帮你确认它具体指哪个产品或项目。","如果写作中想表达“专业地图册”，更自然的说法通常是 “a professional atlas” 或 “a detailed atlas”，而不是把它合成成一个新词。"]}
{"word":"proattack","summary":{"en":"“Pro-attack” means supporting or favoring an attacking/offensive style or strategy.","zh":"“Pro-attack”指“支持或偏向进攻（攻势）风格/策略”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting an attacking, offensive style or strategy (especially in sports, games, or military/political discussion).","zh":"（尤用于体育、比赛或军事/政治语境）主张进攻的；偏向进攻策略的。"},"examples":[{"en":"The coach wants a pro-attack system with high pressing and quick counterattacks.","zh":"教练想采用偏进攻的体系，高位逼抢并快速反击。"},{"en":"Fans praised the team’s pro-attack mindset after a series of bold substitutions.","zh":"在一连串大胆换人后，球迷称赞球队“偏进攻”的心态。"}]},{"partOfSpeech":"n.","definition":{"en":"a stance or viewpoint that supports attacking actions (less common).","zh":"支持采取进攻行动的立场/观点（较少见）。"},"examples":[{"en":"His comments were interpreted as a pro-attack position in the debate.","zh":"在那场辩论中，他的言论被解读为支持进攻的立场。"}]}],"synonyms":["offensive-minded","attack-minded","aggressive","forward-thinking"],"phonetic":"/ˌproʊ əˈtæk/","extraExplanation":["“pro-”是英语常见前缀，表示“支持、赞成”（如 pro-choice, pro-democracy）。因此 pro-attack 直译就是“支持进攻的”。在正式写作中更常见的说法是 offensive-minded / attack-minded / aggressive rather than 把 pro- 和 attack 直接拼在一起。","拼写上更自然的是带连字符的 pro-attack；直接写成 proattack 往往像品牌名、用户名或非标准拼写。"]}
{"word":"proattendance","summary":{"en":"“Proattendance” means supporting or encouraging regular attendance; it’s often better written as “pro-attendance.”","zh":"“proattendance”表示“支持/鼓励出勤或到场”，更常见、较规范的写法是“pro-attendance”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or encouraging regular attendance (often used as a label, hashtag, policy name, or program title).","zh":"支持或鼓励按时出勤/到场的（常用作标签、话题、政策或项目名称）。"},"examples":[{"en":"The school launched a proattendance campaign to reduce absences.","zh":"学校发起了一个支持出勤的活动，以减少缺勤。"},{"en":"Our team uses proattendance incentives like small rewards for perfect attendance.","zh":"我们团队使用支持出勤的激励措施，比如全勤小奖励。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare term; more commonly written with a hyphen as “pro-attendance.”","zh":"非标准/较少见的用法；更常见的写法是加连字符的“pro-attendance”。"},"examples":[{"en":"In formal writing, use “pro-attendance policy” rather than “proattendance policy.”","zh":"在正式写作中，最好用“pro-attendance policy”，而不是“proattendance policy”。"}]}],"synonyms":["pro-attendance","attendance-supporting","attendance-focused","anti-absence (contextual)"],"phonetic":"/ˌproʊ əˈtɛn.dəns/","extraExplanation":["“pro-”是英语里常见的前缀，意思是“支持、赞成”（例如：pro-democracy 支持民主的；pro-choice 支持选择权的）。把它和“attendance（出勤/到场）”组合，就形成“pro-attendance / pro-attendance”，表达“鼓励出勤”的含义。","因为“proattendance”不算固定词条，实际使用中更像是组织内部用语、项目名或社交媒体标签；在正式文本里更推荐写成“pro-attendance”。"]}
{"word":"proauction","summary":{"en":"“proauction” is most likely a brand name or shorthand for “pro auction” (a professional auction).","zh":"“proauction”多半是品牌名，或是“pro auction（专业拍卖）”的合写/简称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) Likely a brand name or a clipped/combined form of “pro auction,” meaning a professional auction service or an auction aimed at professionals.","zh":"（非标准词条）可能是品牌名，或由“pro auction”（专业拍卖）拼合而来，指专业拍卖服务或面向专业人士的拍卖。"},"examples":[{"en":"We bought the equipment through a pro auction held online.","zh":"我们通过一次线上专业拍卖买到了那批设备。"},{"en":"ProAuction is the platform they use to manage bids and invoices.","zh":"ProAuction 是他们用来管理出价和发票的平台。"}]}],"synonyms":["professional auction","auction service","auction platform"],"phonetic":"/proʊ ˈɔkʃən/","extraExplanation":["“proauction”更像是公司名/网站名/软件名，而不是常见英语单词。不同写法可能表示不同意思：\n- pro auction：常见口语写法，指“专业拍卖”。\n- pre-auction：指“拍卖前的（预展/预热/准备阶段）”。\n- auction pro：指“拍卖专家/职业拍卖师”。\n如果你能告诉我它出现的句子或链接，我可以更准确判断具体含义与用法。"]}
{"word":"proaudience","summary":{"en":"“Proaudience” is an uncommon term usually meaning “for a professional audience.”","zh":"“Proaudience”是不常见的用法，通常表示“面向专业受众”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) A term used in marketing or content planning to mean “aimed at a professional audience” or “for professional viewers/listeners.”","zh":"（不常见）在营销或内容策划中使用的说法，表示“面向专业受众/专业观众（听众）的”。"},"examples":[{"en":"This webinar is proaudience, so we’ll focus on industry jargon and detailed case studies.","zh":"这场网络研讨会是面向专业受众的，所以我们会使用行业术语并深入分析案例。"},{"en":"We need a proaudience version of the deck for investors and analysts.","zh":"我们需要一份面向专业受众（投资人和分析师）的演示文稿版本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) A label meaning “supportive of the audience” or “audience-friendly,” but this sense is not standard and can be unclear.","zh":"（罕见）作标签时可理解为“偏向观众/对观众友好”，但这种用法不规范，容易让人困惑。"},"examples":[{"en":"The host tried to keep the conversation proaudience by explaining technical terms.","zh":"主持人尽量让对话对观众更友好，解释了技术术语。"}]}],"synonyms":["professional-audience","for professionals","audience-facing","audience-friendly"],"phonetic":"/ˌproʊˈɔdiəns/","extraExplanation":["“proaudience”不是常见的标准英语单词，更常见的写法/表达是：professional audience（专业受众）、for professionals（面向专业人士）、audience-facing（面向受众的）、audience-friendly（对观众友好）。","如果你确实要用这个词，建议加连字符写成“pro-audience”，并在第一次出现时用一句话说明含义，避免读者误解。"]}
{"word":"proaulion","summary":{"en":"Proaulion is a rare architectural term meaning a forecourt or outer courtyard in front of a building.","zh":"Proaulion 是一个较少见的建筑用语，指建筑物前方的前庭／外院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture, rare) A forecourt or outer courtyard in front of a building, especially in Greek or Byzantine contexts; an area just before entering a main courtyard or doorway.","zh":"（建筑，较少见）建筑物前方的外院／前庭，尤指希腊或拜占庭建筑中进入主要庭院或门厅前的那一片区域。"},"examples":[{"en":"Visitors waited in the proaulion before being admitted to the inner courtyard.","zh":"访客先在前庭（proaulion）等候，然后才被带入内院。"},{"en":"In some Byzantine complexes, the proaulion served as a transitional space between the street and the church grounds.","zh":"在一些拜占庭建筑群中，前庭（proaulion）是连接街道与教堂范围的过渡空间。"}]}],"synonyms":["forecourt","outer courtyard","entrance court","courtyard"],"phonetic":"/proʊˈaʊliən/","extraExplanation":["这个词来自希腊语 προαύλιον（proaúlion），由 pro-（“在……之前”）+ aulē（“庭院”）构成，字面意思就是“在庭院之前的地方”。","它在现代英语中非常少见，更多见于考古、古典学或建筑史写作中。日常英语里更常用的近义表达是 forecourt、outer courtyard、entrance court。","如果你原本想拼的是另一个词（比如 prologue, pavilion, or “proa”），告诉我你看到它的句子/出处，我可以帮你确认正确拼写与含义。"]}
{"word":"proauthor","summary":{"en":"“Proauthor” usually means a professional author (more commonly written “pro author”), but it can also be a product/brand name in writing contexts.","zh":"“proauthor”通常指“职业作者”（更常写作“pro author”），也可能是写作相关的产品/品牌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a professional author; someone who writes as a career (often contrasted with an amateur writer)","zh":"职业作者；以写作为职业的人（常与“业余写作者”相对）"},"examples":[{"en":"She’s a pro author who publishes two novels a year.","zh":"她是一位职业作者，每年出版两部小说。"},{"en":"If you want to be a pro author, you need a steady writing habit and deadlines.","zh":"如果你想成为职业作者，就需要稳定的写作习惯和截止日期意识。"}]},{"partOfSpeech":"other","definition":{"en":"a brand/product name (often written “ProAuthor”) used for writing-related tools or services; meaning depends on the specific company or app","zh":"写作相关工具或服务的品牌/产品名（常写作“ProAuthor”）；具体含义取决于对应公司或应用"},"examples":[{"en":"I drafted the chapter in ProAuthor and exported it as a Word file.","zh":"我在 ProAuthor 里写了这一章，然后导出为 Word 文件。"}]}],"synonyms":["professional writer","career author","working writer"],"phonetic":"/ˌproʊ ˈɔːθər/","extraExplanation":["“pro”是“professional（职业的）”的口语缩写；“author”是“作者”。合在一起的写法不固定：更常见的是“pro author”（分开写），也可能作为产品名连写为“ProAuthor”。","如果你是在某个平台/软件里看到这个词（例如账号类型、订阅计划、应用名称），它很可能是专有名词；此时最好结合上下文或该平台说明来理解。"]}
{"word":"proauthority","summary":{"en":"Proauthority means supporting official authority or strong control.","zh":"proauthority 指支持官方权威或强力管控的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring authority, official power, or strict control (often used in political or social discussions).","zh":"支持权威、官方权力或较严格管控的（常用于政治或社会话题）。"},"examples":[{"en":"Some voters prefer proauthority policies because they believe they improve public safety.","zh":"有些选民偏好支持权威的政策，因为他们认为这能提升公共安全。"},{"en":"The article describes a proauthority approach to education that emphasizes discipline.","zh":"这篇文章描述了一种支持权威的教育方式，强调纪律。"}]}],"synonyms":["pro-authority","pro-government","authoritarian-leaning","law-and-order"],"phonetic":"/ˌproʊəˈθɔːrəti/","extraExplanation":["“proauthority”并不是非常常见的标准拼写，更常见的是写作“pro-authority”（加连字符）或用更常用的表达替代，如“pro-government”（亲政府的）、“authoritarian-leaning”（偏威权的）、“in favor of strong authority”（支持强权威的）。","前缀“pro-”表示“支持/赞成”（如 pro-choice, pro-democracy）。当它接在较长或不常见的词前时，英语里常用连字符来提高可读性：pro-authority。使用时要注意语气：在一些语境中它可能带有批评或价值判断。"]}
{"word":"proautomation","summary":{"en":"Pro-automation means supporting or promoting automation.","zh":"Pro-automation 指支持或推动自动化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the use of automation (machines/software doing work that humans used to do)","zh":"支持或赞成采用自动化（用机器/软件完成原本由人做的工作）的"},"examples":[{"en":"The company took a pro-automation approach to reduce repetitive tasks.","zh":"公司采取了支持自动化的做法，以减少重复性工作。"},{"en":"Her pro-automation views focus on safety and efficiency.","zh":"她支持自动化的观点强调安全与效率。"}]},{"partOfSpeech":"n.","definition":{"en":"a stance, policy, or movement that promotes automation","zh":"推动自动化的立场、政策或倾向"},"examples":[{"en":"The new policy is seen as strongly pro-automation by industry groups.","zh":"行业团体认为这项新政策强烈推动自动化。"},{"en":"In the debate, pro-automation arguments were challenged by concerns about jobs.","zh":"在辩论中，支持自动化的论点被“就业问题”的担忧所质疑。"}]}],"synonyms":["automation-friendly","in favor of automation","automation-forward","pro-technology"],"phonetic":"/ˌproʊ ˌɔtəˈmeɪʃən/","extraExplanation":["“proautomation”更常写作 **pro-automation**（带连字符），表示“支持自动化”。在正式写作中用连字符更清晰；不带连字符多见于标签、用户名或公司内部术语。","前缀 **pro-** 表示“赞成/支持”，常见类似表达：**pro-environment**, **pro-democracy**, **pro-choice** 等。","语境上它常出现在关于“效率、成本、质量、安全”与“就业影响、技能转型、监管伦理”等话题的讨论中。"]}
{"word":"proautomobile","summary":{"en":"“Pro-automobile” means favoring cars, especially in transportation policy or city planning.","zh":"“Pro-automobile”指偏向或支持汽车（私家车）的，常用于交通政策或城市规划语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring cars (automobiles), especially in policy, planning, or public debate","zh":"支持或偏向汽车（私家车）的，尤指在政策、城市规划或公共讨论中"},"examples":[{"en":"Some critics say the city’s zoning rules are pro-automobile and make walking harder.","zh":"一些批评者说，这座城市的分区规定偏向汽车，让步行更困难。"},{"en":"The new road expansion plan is seen as a pro-automobile approach to transportation.","zh":"新的道路扩建计划被视为一种“亲汽车”的交通思路。"}]}],"synonyms":["car-friendly","auto-centric","automobile-oriented"],"phonetic":"/ˌproʊ ˈɔtəməˌbil/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如：pro-democracy 支持民主的；pro-environment 支持环保的）。因此 pro-automobile 通常用于对比 pro-transit（偏向公共交通）、pro-cycling（偏向骑行）或 pedestrian-friendly（行人友好）。","该词多见于城市规划、交通政策与环境讨论语境中，常带有评价色彩：支持者可能强调出行便利与经济活动；反对者可能批评其导致拥堵、污染或对行人/骑行不友好。"]}
{"word":"proavian","summary":{"en":"Proavian describes something bird-like or on the evolutionary path leading to birds, especially in paleontology.","zh":"Proavian 指“类鸟的/通往鸟类演化谱系上的”，多用于古生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or considered ancestral to birds; often used in paleontology to describe early bird-like dinosaurs or features on the evolutionary line leading to birds.","zh":"与鸟类有关、类似鸟类，或被认为是鸟类祖先的；常用于古生物学，描述通往鸟类演化谱系上的早期“类鸟”恐龙或特征。"},"examples":[{"en":"Some theropod dinosaurs had proavian features such as feathers and hollow bones.","zh":"一些兽脚类恐龙具有羽毛和中空骨骼等“类鸟（proavian）”特征。"},{"en":"Researchers debate which fossils best represent a proavian stage before modern birds.","zh":"研究者会讨论哪些化石最能代表现代鸟类出现之前的“类鸟阶段”。"}]}],"synonyms":["bird-like","avian-like","proto-avian","incipiently avian"],"phonetic":"/proʊˈeɪviən/","extraExplanation":["这个词不算常见的日常英语，更常见于古生物学/演化生物学写作。它通常表示“朝向鸟类的、在鸟类演化谱系上的”，而不是“赞成鸟类（pro-bird）”。","词形上可理解为 pro-（向前、在……之前/趋向）+ avian（鸟类的）。在科普或论文里，你可能也会看到更具体的说法，如 bird-like（类鸟的）、avian ancestor（鸟类祖先）、stem bird（鸟类干群）等。"]}
{"word":"proaviation","summary":{"en":"Proaviation (often written pro-aviation) means supporting or favoring aviation; it can also be used as a name implying “professional aviation.”","zh":"proaviation（常写作 pro-aviation）指“支持航空”；也可能作为名称表示“专业航空/与航空相关的品牌或账号”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring aviation (air travel, aircraft, or the aviation industry)","zh":"支持航空的；赞成航空（航空旅行、飞机或航空产业）的"},"examples":[{"en":"The city council took a pro-aviation stance and approved funding for the airport expansion.","zh":"市议会采取支持航空的立场，并批准了机场扩建资金。"},{"en":"She joined a pro-aviation group to promote pilot training opportunities for young people.","zh":"她加入了一个支持航空的团体，推广青少年飞行员培训机会。"}]},{"partOfSpeech":"n.","definition":{"en":"a name or label (often a company/online handle) that suggests “professional aviation” or “for aviation”","zh":"一个名称或标签（常见于公司名/网名），暗示“专业航空”或“支持航空”"},"examples":[{"en":"ProAviation posts weekly tips on flight safety and maintenance.","zh":"ProAviation 每周发布飞行安全与维护方面的建议。"}]}],"synonyms":["pro-aviation","aviation-friendly","supportive of aviation"],"phonetic":"/proʊ ˌeɪviˈeɪʃən/","extraExplanation":["“pro-”是英语常见前缀，表示“支持、赞成”（如 pro-environment 支持环保），也可在品牌语境中暗示“专业的”（professional）。因此 pro-aviation 常见两种理解：①支持航空；②与“专业航空”相关。实际含义要结合具体上下文（新闻、组织、品牌介绍等）。","拼写上更常见的是加连字符的 pro-aviation；写成 ProAviation 多见于专有名词（品牌/账号）。"]}
{"word":"proavis","summary":{"en":"A scientific term meaning a hypothetical earliest ancestor (especially in evolution).","zh":"科学用语：指某类群（尤指进化语境中）的假想或最早祖先。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hypothetical or earliest known ancestor of a group of organisms (used mainly in biology and evolutionary discussions)","zh":"（主要用于生物学/进化论语境）某一类生物的假想祖先或最早已知祖先"},"examples":[{"en":"Some researchers proposed a bird-like proavis to explain early flight evolution.","zh":"一些研究者提出一种“类鸟的假想祖先（proavis）”来解释早期飞行的演化。"},{"en":"The fossil record is incomplete, so the proavis is often reconstructed from related species.","zh":"由于化石记录不完整，人们常根据近缘物种来重建这种假想祖先（proavis）。"}]}],"synonyms":["ancestor","progenitor","common ancestor","hypothetical ancestor","proto-ancestor"],"phonetic":"/proʊˈeɪvɪs/","extraExplanation":["“proavis”来自拉丁语：pro-（在前、早期）+ avis（鸟）。它在学术写作里多指某个类群的“原始/祖先型”设想，尤其常见于讨论鸟类起源或早期鸟类演化的文献中。","在现代英语中它属于比较少见、偏专业的词；更常见的通用表达是“ancestor”（祖先）、“common ancestor”（共同祖先）或“proto-”开头的术语（如“proto-bird/原始鸟类”）。"]}
{"word":"proaward","summary":{"en":"“Proaward” is not a standard word; it usually means “pro award,” an award for professionals, or it may be a brand/event name.","zh":"“proaward”不是标准单词；多半指“pro award（专业类奖项）”，也可能是品牌/活动名称。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard dictionary word) Often used informally as “pro award,” meaning an award aimed at professionals or given in a professional setting.","zh":"（不是标准词典词）常见为非正式写法“pro award”，指“面向专业人士的奖项”或“职业/专业领域里的奖”。"},"examples":[{"en":"She won a pro award for her work in graphic design.","zh":"她因平面设计方面的工作获得了一个专业奖项。"},{"en":"Our team is applying for a pro award in the tech industry.","zh":"我们团队正在申请一个科技行业的专业奖项。"}]},{"partOfSpeech":"other","definition":{"en":"A name or label used by some organizations/products (e.g., an event title, brand, or platform) that includes “ProAward/Pro Award.” Meaning depends on the specific context.","zh":"某些机构/产品使用的名称或标签（如活动名、品牌名、平台名）包含“ProAward/Pro Award”。具体含义取决于使用场景。"},"examples":[{"en":"Check the ProAward website for the nomination rules.","zh":"去 ProAward 网站查看提名规则。"}]}],"synonyms":["professional award","industry award","trade award"],"phonetic":"ˈproʊ əˌwɔrd","extraExplanation":["“pro-”在英语里常见含义是“专业的（professional）/职业的”，也可以表示“支持某一方（in favor of）”，但在“pro award”里通常理解为“专业类奖项”。","如果你是想查某个特定平台或公司（例如名为 ProAward 的网站/系统），告诉我它所属行业或给我一句原文语境，我可以帮你更准确地解释。"]}

