{"word":"prob","summary":{"en":"“Prob” is an informal short form meaning either “problem” or (in texts) “probably.”","zh":"“prob”是非正式简写，可表示“problem（问题）”，也可在聊天中表示“probably（可能/大概）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, abbreviation) A problem; short for “problem,” often used in speech or casual writing.","zh":"（非正式缩写）问题；“problem”的简写，常用于口语或随意书写。"},"examples":[{"en":"No prob—I can help you with that.","zh":"没问题——我可以帮你。"},{"en":"We’ve got a prob with the Wi‑Fi.","zh":"我们的 Wi‑Fi 出了点问题。"},{"en":"Is there a prob, officer?","zh":"警官，有什么问题吗？"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal, texting) Probably; short for “probably,” common in messages and online chat.","zh":"（非正式短信/聊天）大概、可能；“probably”的简写，常见于信息和网络聊天。"},"examples":[{"en":"I’ll prob be there around 7.","zh":"我大概 7 点左右到。"},{"en":"She’s prob asleep already.","zh":"她可能已经睡了。"}]}],"synonyms":["problem","issue","probably","likely"],"phonetic":"/prɑb/","extraExplanation":["“No prob”是非常常见的口语表达，意思接近“没事/不客气/没问题”，语气通常轻松随意；正式场合更常用“No problem”或“You’re welcome”。","“prob”在正式写作、作业、商务邮件里不合适；可以改用“problem / probably”。"]}
{"word":"probabil","summary":{"en":"Probable means likely to be true or happen.","zh":"probable 表示“很可能发生/很可能是真的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"likely to be true or to happen; more probable than not","zh":"很可能为真或发生的；更倾向于会发生的"},"examples":[{"en":"It’s probable that it will rain this afternoon.","zh":"今天下午很可能会下雨。"},{"en":"The police think the most probable cause was an accident.","zh":"警方认为最可能的原因是一次事故。"}]}],"synonyms":["likely","plausible","expected"],"phonetic":"/ˈprɑːbəbl/","extraExplanation":["你输入的“probabil”通常不是一个完整的英语单词，更常见的是它作为词干出现在：probability（概率）、probabilistic（概率的/概率论的）等词里。","词源上与拉丁语 probare（“检验、证明”）有关，所以“probable”本义带有“经检验后看起来成立”的感觉。日常英语里，它常与 it is probable that... 搭配使用。","近义词用法小提醒：likely 更口语、更常用；probable 更正式一些；possible 只表示“有可能”，不强调可能性大小。"]}
{"word":"probabiliorism","summary":{"en":"Probabiliorism is the moral-theology view that, in doubt, you should follow the more probable (better-supported) opinion—often the stricter/safer one.","zh":"Probabiliorism（或然较可信说）指在道德不确定时应遵循更可能正确、根据更充分的意见，常倾向更严格/更安全的选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A view in Catholic moral theology that, when you are unsure what is morally required, it is safer to follow the more probable (better-supported) opinion—especially if it favors a stricter or safer course of action.","zh":"（天主教道德神学）“或然较可信说”：当你不确定道德上该怎么做时，应当遵循“更可能正确、证据更充分”的意见（通常倾向较严格、更安全的做法）。"},"examples":[{"en":"In some debates about conscience, probabiliorism is contrasted with more permissive approaches.","zh":"在一些关于良心的讨论中，或然较可信说常被拿来和更宽松的观点对比。"},{"en":"A professor explained that probabiliorism advises choosing the safer moral opinion when certainty is not possible.","zh":"一位教授解释说：当无法确定时，或然较可信说建议选择更安全的道德意见。"}]}],"synonyms":["probabiliorism (the term itself is standard)","tutiorism (related, often even stricter in emphasizing the safest course)"],"phonetic":"/prəˌbæbəˈbɪlərɪzəm/","extraExplanation":["这个词主要出现在16–18世纪的天主教道德神学争论中，常与 probabilism（或然说，更强调“只要有相当可能性就可跟随较宽松意见”）相对。probabiliorism 的核心是“probabilior＝更可能/更有根据”的拉丁词源，强调在疑难处倾向更可靠、通常也更严格的判断。","在历史上，它与“耶稣会道德神学争论”等语境有关；现代日常英语中极少使用，更多见于神学、教会史或伦理学研究文章。"]}
{"word":"probabiliorist","summary":{"en":"A probabiliorist is someone who insists on following the more probable (safer) moral opinion when experts disagree.","zh":"probabiliorist指在道德判断分歧时主张遵循“更可能为真/更安全”意见的人（多见于天主教道德神学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (especially in Catholic moral theology) who follows probabiliorism—the view that, when moral experts disagree, you should follow the more probable or safer opinion rather than a merely “probable” one.","zh":"（尤指天主教道德神学中）“更可能主义者”；主张在道德问题上若权威意见不一，应遵循“更有把握/更可能为真”的较安全观点，而不是仅仅“也算可能”的观点。"},"examples":[{"en":"As a probabiliorist, he argued that confessors should recommend the more defensible moral opinion when there is serious doubt.","zh":"作为一位更可能主义者，他主张在存在重大疑惑时，告解神师应建议更站得住脚的道德意见。"},{"en":"The debate between probabilists and probabiliorists shaped early modern Catholic ethical writing.","zh":"“可能主义者”和“更可能主义者”之间的争论影响了近代早期的天主教伦理写作。"}]}],"synonyms":["probabiliorism advocate","moral rigorist (approx.)"],"phonetic":"/prəˌbæbəlˈaɪəriəɹɪst/","extraExplanation":["该词主要出现在16–18世纪的天主教道德神学语境里，常与probabilism（可能主义）对照：可能主义认为只要某一观点“有充分理由而可能正确”，即使不是最可能，也可遵循；probabiliorism则要求选择“更可能正确/更安全”的一方。","词源上来自拉丁语probabilior（“更可能的”）+ -ist（“……主义者/……者”）。在现代日常英语中很少使用，更多见于学术史、神学史或伦理学讨论。"]}
{"word":"probabilis","summary":{"en":"*probabilis* is a Latin adjective meaning “probable, likely, believable.”","zh":"*probabilis* 是拉丁语形容词，意为“很可能的、可信的、看似合理的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin) probable; likely to be true; believable or plausible.","zh":"（拉丁语）很可能的；大概属实的；可信的、貌似合理的。"},"examples":[{"en":"In Latin, *probabilis* describes an argument that sounds believable, even if it is not fully proven.","zh":"在拉丁语里，*probabilis*可用来形容一个论证“听起来可信”，即使它还没有被完全证明。"},{"en":"The speaker offered a *probabilis* explanation for the event.","zh":"演讲者为这件事给出了一个看似合理的解释。"}]}],"synonyms":["probable","likely","plausible","credible"],"phonetic":"/prəˈbæbəlɪs/","extraExplanation":["*probabilis* 是拉丁语形容词，来自动词 *probare*（证明、检验、认可）。因此它的核心含义不是“确定无疑”，而是“经过检验后显得可信/可接受”。","它是英语 *probable*（很可能的）与 *probability*（概率）的词源之一。学习时可以把它和 “proof（证据/证明）” 这个词根联系起来：*prob-* 常与“证明、检验”相关。","在古典与中世纪哲学/神学写作中，*probabilis* 常用来表示“在理性或证据层面上站得住脚”的观点，强调“可信度”而非“必然性”。"]}
{"word":"probabilism","summary":{"en":"Probabilism is the idea of acting or reasoning based on what is likely rather than certain; it can also name a specific doctrine in Catholic moral theology about following a probable opinion when moral certainty is lacking.","zh":"probabilism 指根据“可能性”而非“确定性”来推理或行动的观点；它也可特指天主教道德神学中的一种学说：在缺乏道德确定性时可遵循一个“较可信”的观点而行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief or approach that emphasizes likelihood rather than certainty, especially in reasoning, science, or decision-making under uncertainty.","zh":"概率主义；一种强调“可能性”而非“确定性”的观点或方法，常用于推理、科学或不确定条件下的决策。"},"examples":[{"en":"In everyday life we often rely on probabilism, making the best choice based on incomplete information.","zh":"在日常生活中，我们常常依靠概率主义，在信息不完整的情况下做出最优选择。"},{"en":"Modern weather forecasts are a practical example of probabilism: they give chances of rain instead of guarantees.","zh":"现代天气预报是概率主义的实际例子：它给出下雨的概率，而不是保证一定会下雨。"}]},{"partOfSpeech":"n.","definition":{"en":"In Catholic moral theology, the view that when it is unclear whether an action is morally allowed, one may follow a “probable” opinion supporting freedom to act, even if an opposing opinion seems more probable.","zh":"（天主教）道德神学中的概率主义：当某行为是否允许不明确时，可以遵循一个“较有根据/较可信”的宽松观点而行动，即使相反的观点看起来更可能正确。"},"examples":[{"en":"Probabilism was debated by theologians who disagreed about how much certainty moral decisions require.","zh":"概率主义曾引发神学家争论：道德决定需要多大的确定性。"},{"en":"Under probabilism, a person may act if there is a solid, well-argued opinion that the action is permitted.","zh":"按照概率主义，只要有一个论证充分的观点认为该行为被允许，人就可以行动。"}]}],"synonyms":["probabilistic reasoning","probability-based approach","(theology) moral probabilism"],"phonetic":"/prəˈbæbəˌlɪzəm/","extraExplanation":["这个词在一般语境里比较少见，更常见的相关词是 probability（概率）、probabilistic（概率的）、Bayesian（贝叶斯的）。","词源上来自 probable（可能的）+ -ism（主义/学说）。在学术写作中，它可能指一种哲学立场：承认知识常以“高可信度”而非“绝对确定”呈现。","在天主教神学语境中（16–17世纪争论较多），probabilism 是一个专门术语；如果你在历史、宗教或伦理文章里看到它，多半是这个含义。"]}
{"word":"probabilist","summary":{"en":"A probabilist is usually a specialist in probability theory; more broadly, it can mean someone who reasons in terms of likelihood, and in philosophy it can mean a supporter of probabilism.","zh":"probabilist 通常指概率论专家；也可泛指用“可能性”来推理的人；在哲学/神学中还可指或然论（probabilism）的支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mathematician or statistician who specializes in probability theory (the study of chance and randomness).","zh":"概率论（研究随机与机会）的专家；概率论学者（数学家或统计学家）。"},"examples":[{"en":"The probabilist proved a new result about random walks.","zh":"这位概率论学者证明了一个关于随机游走的新结果。"},{"en":"She trained as a probabilist before working in machine learning.","zh":"她先接受了概率论方向的训练，后来从事机器学习工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who tends to think and make decisions based on likelihood rather than certainty.","zh":"倾向用“可能性/概率”而非“确定性”来思考和决策的人。"},"examples":[{"en":"As a probabilist, he never promises outcomes—only odds.","zh":"作为一个讲概率的人，他从不保证结果——只谈可能性。"},{"en":"A good investor is often a probabilist, weighing risks and chances.","zh":"优秀的投资者往往很“概率化”，会权衡风险与机会。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy or theology, a supporter of probabilism (the view that it can be morally acceptable to follow a “probable” opinion when certainty is unavailable).","zh":"（哲学/神学）或然论（probabilism）的支持者：在无法确定时，遵循一个“相当有根据/可能正确”的观点也可能在道德上可接受。"},"examples":[{"en":"Some writers describe him as a probabilist in moral reasoning.","zh":"一些作者把他描述为道德推理中的或然论者。"}]}],"synonyms":["probability theorist","mathematician","statistician","risk assessor","odds-maker"],"phonetic":"/prəˈbæbəˌlɪst/","extraExplanation":["“probabilist”在学术语境里最常见，通常指研究概率论的数学家；在统计学、随机过程、金融数学、机器学习等领域都很常用。","日常英语里更常见的说法是“someone who thinks in probabilities / thinks in terms of odds”，而不是直接说“a probabilist”。","哲学/神学里的“probabilism（或然论）”是一个专门术语，和数学概率不同；如果在文章里看到 probabilist，需要根据上下文判断是哪一种。"]}
{"word":"probabilistic","summary":{"en":"Probabilistic means “based on or expressed in terms of probability,” often used when outcomes are uncertain (common in science, statistics, and AI).","zh":"probabilistic 意为“基于概率的/用概率表示的”，常用于描述不确定结果（科学、统计、人工智能中很常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using probability to describe, predict, or model how likely something is, rather than being completely certain.","zh":"用“概率”来描述、预测或建模某件事发生的可能性，而不是绝对确定。"},"examples":[{"en":"Weather forecasts are probabilistic, so a 60% chance of rain means rain is more likely than not.","zh":"天气预报是概率性的，所以“下雨概率60%”表示下雨的可能性更大。"},{"en":"The doctor gave a probabilistic estimate of the risk based on the data.","zh":"医生根据数据给出了风险的概率性估计。"}]},{"partOfSpeech":"adj.","definition":{"en":"Based on probability theory or methods in statistics and computing (often in science/AI).","zh":"基于概率论或统计/计算方法的（常用于科学、统计、人工智能等领域）。"},"examples":[{"en":"They used a probabilistic model to detect spam emails.","zh":"他们用概率模型来识别垃圾邮件。"},{"en":"Probabilistic reasoning helps the system make decisions with incomplete information.","zh":"概率推理帮助系统在信息不完整时做决策。"}]}],"synonyms":["probability-based","stochastic","likely (context-dependent)"],"phonetic":"/prəˌbæbəˈlɪstɪk/","extraExplanation":["“probabilistic”常与确定性（deterministic）对比：deterministic 表示“只要条件相同，结果必然相同”；probabilistic 表示“结果带有随机性/不确定性，用概率来表达”。","常见搭配：probabilistic model（概率模型）, probabilistic approach（概率方法）, probabilistic estimate（概率估计）, probabilistic reasoning（概率推理）, probabilistic forecast（概率预测）。","词形来源：probable（可能的）→ probability（概率）→ probabilistic（概率性的）。"]}
{"word":"probabilistically","summary":{"en":"“Probabilistically” means “based on probability or likelihood, not certainty,” often used in statistics and computing.","zh":"“Probabilistically”表示“以概率/可能性为依据，而非确定无疑”，常用于统计与计算机语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves probability; based on likelihood rather than certainty.","zh":"以概率的方式；基于可能性而非确定性。"},"examples":[{"en":"We can probabilistically estimate how many customers will come tomorrow.","zh":"我们可以用概率方法估计明天会有多少顾客来。"},{"en":"The model predicts outcomes probabilistically, not with 100% certainty.","zh":"这个模型以概率方式预测结果，而不是百分之百确定。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner that is random but follows a probability distribution (common in statistics and computing).","zh":"以随机方式进行，但遵循某种概率分布（常见于统计学与计算机领域）。"},"examples":[{"en":"The algorithm chooses the next step probabilistically to avoid getting stuck.","zh":"该算法以概率方式选择下一步，以避免卡住。"},{"en":"In this simulation, events occur probabilistically according to the data.","zh":"在这个模拟中，事件会根据数据以概率方式发生。"}]}],"synonyms":["likely","probably","statistically","stochastically","by chance"],"phonetic":"/prəˌbæbəˈlɪstɪkli/","extraExplanation":["“Probabilistically”常见于学术写作、数据分析、机器学习等语境，用来强调“不是确定的结论，而是按概率/可能性来描述或决定”。在日常口语中更常说 “probably / likely”。","词形来源：probable（可能的）→ probability（概率）→ probabilistic（概率的）→ probabilistically（以概率方式）。"]}
{"word":"probabilities","summary":{"en":"“Probabilities” means the chances or likelihoods of different outcomes; in math/statistics it refers to numerical measures of likelihood.","zh":"“Probabilities”指各种结果发生的可能性/几率；在数学统计中指用数值衡量可能性的“概率”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The chances that something will happen; how likely different outcomes are.","zh":"（事情发生的）可能性；各种结果出现的几率。"},"examples":[{"en":"There’s a high probability of rain tomorrow.","zh":"明天下雨的可能性很大。"},{"en":"We considered the probabilities before making a decision.","zh":"我们在做决定前先考虑了各种可能性。"}]},{"partOfSpeech":"n.","definition":{"en":"In mathematics and statistics, numbers between 0 and 1 (or 0% and 100%) that measure how likely an event is.","zh":"在数学与统计中，用0到1（或0%到100%）表示事件发生可能性的数值。"},"examples":[{"en":"The probability of getting heads is 0.5.","zh":"抛硬币正面朝上的概率是0.5。"},{"en":"If the probability is close to 1, the event is very likely.","zh":"如果概率接近1，这个事件就很可能发生。"}]}],"synonyms":["chances","likelihoods","odds","prospects"],"phonetic":"/ˌprɑbəˈbɪlətiz/","extraExplanation":["“Probability / probabilities”在日常英语里常和high/low、increase/decrease连用：a high probability（高概率），the probability increases（概率上升）。","在学术或新闻语境中，probability常被更精确地使用；在口语里也常用chance来表达“可能性/机会”，语气更轻松：There’s a good chance…（很有可能……）。"]}
{"word":"probability","summary":{"en":"Probability means how likely something is to happen; in math it can be a number such as 0.5 or 50%.","zh":"Probability 表示某事发生的可能性；在数学中也可指用数值（如 0.5 或 50%）表示的概率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chance or likelihood that something will happen","zh":"（某事发生的）可能性；概率"},"examples":[{"en":"There’s a high probability of rain tomorrow.","zh":"明天下雨的可能性很高。"},{"en":"What is the probability that the team will win?","zh":"这支队伍赢的概率是多少？"}]},{"partOfSpeech":"n.","definition":{"en":"a number that expresses how likely an event is (often written between 0 and 1, or as a percent)","zh":"（数学/统计中表示事件发生可能性的）概率数值（常用 0 到 1 之间的数或百分比表示）"},"examples":[{"en":"If the probability is 0.2, it means a 20% chance.","zh":"如果概率是 0.2，就表示有 20% 的可能。"},{"en":"The probability of getting heads on a fair coin is 0.5.","zh":"抛一枚公平硬币出现正面的概率是 0.5。"}]}],"synonyms":["likelihood","chance","odds","possibility"],"phonetic":"/ˌprɑbəˈbɪləti/","extraExplanation":["在日常英语里，probability 常搭配 high/low probability（高/低概率）以及 the probability of + 名词/动名词（……的概率/可能性）。","在更口语的表达中，人们也常用 chance（机会/可能性）替代 probability：What are the chances?（可能性有多大？）"]}
{"word":"probabilize","summary":{"en":"“Probabilize” means to express something using probabilities or to assign probabilities to possible outcomes.","zh":"“probabilize”指用概率来表达某事，或为可能结果分配概率。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn something into a probability-based form; to assign or estimate probabilities for outcomes or events","zh":"使……概率化；为结果或事件分配/估计概率"},"examples":[{"en":"The model probabilizes each possible label instead of choosing only one.","zh":"这个模型会为每个可能的标签进行概率化处理，而不是只选一个。"},{"en":"We probabilized the survey responses to reflect uncertainty.","zh":"我们将问卷结果概率化，以反映不确定性。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become expressed in terms of probabilities (less common)","zh":"（较少见）以概率形式呈现；变得可用概率来描述"},"examples":[{"en":"As more data arrived, the forecast probabilized and became easier to compare across scenarios.","zh":"随着更多数据到来，预测逐渐概率化，更容易在不同情景间比较。"}]}],"synonyms":["assign probabilities","model probabilistically","quantify uncertainty","estimate likelihoods"],"phonetic":"/prəˈbæbəˌlaɪz/","extraExplanation":["“probabilize”在日常英语中很少使用，更常见的说法是“assign probabilities to…”（给……分配概率）或“model … probabilistically”（用概率方式建模）。在统计学、机器学习、风险分析等语境里，它强调把“确定的判断”改为“带概率的分布/评分”，例如输出每个类别的概率（probability distribution / probability scores）。"]}
{"word":"probabl","summary":{"en":"Probable means “likely” or “having a good chance of being true or happening.”","zh":"Probable 表示“很可能的；发生或为真的概率较大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"likely to be true, real, or to happen; having a good chance of occurring","zh":"很可能为真、真实或会发生的；发生概率较大的"},"examples":[{"en":"It’s probable that it will rain this afternoon.","zh":"今天下午很可能会下雨。"},{"en":"The most probable cause of the problem is a loose cable.","zh":"这个问题最可能的原因是电缆松了。"},{"en":"A probable winner is already emerging in the race.","zh":"比赛中一个很可能的赢家已经显现出来。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is likely to become something (often used with “future”)","zh":"很可能成为某种身份的人（常与“future”连用）"},"examples":[{"en":"She’s a probable future leader of the company.","zh":"她很可能是公司未来的领导者。"}]}],"synonyms":["likely","possible","plausible","expected"],"phonetic":"/ˈprɑbəbəl/","extraExplanation":["你输入的“probabl”通常是拼写到一半或少写了字母e的错误拼写。常见目标词有两个：\n1) probable（形容词）= “可能的”；\n2) probably（副词）= “很可能”。\n区别：probable 修饰名词（a probable reason）；probably 修饰动词/整句（It will probably rain）。","词源上，probable 与 “prove（证明）/ probable（可被证明为可信的）”有关，所以它常用于较正式的判断、推断语境（新闻、报告、学术写作）。"]}
{"word":"probable","summary":{"en":"Probable means “likely” or “supported by evidence,” often used in more formal writing.","zh":"probable 表示“很可能的、可信的”，语气较正式，常用于书面或正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"likely to be true or to happen; more likely than not.","zh":"很可能的；大概会发生的；较大概率为真的。"},"examples":[{"en":"It’s probable that it will rain this afternoon.","zh":"今天下午很可能会下雨。"},{"en":"The most probable cause of the problem is a loose cable.","zh":"这个问题最可能的原因是电缆松了。"}]},{"partOfSpeech":"adj.","definition":{"en":"reasonable to expect or assume, based on available evidence.","zh":"（根据现有证据）合理可推断的；可信的。"},"examples":[{"en":"Given the traffic, a late arrival is probable.","zh":"考虑到交通状况，迟到是大概率的。"},{"en":"Her explanation sounds probable, but we should still verify it.","zh":"她的解释听起来可信，但我们仍然应该核实。"}]}],"synonyms":["likely","plausible","expected"],"phonetic":"/ˈprɑːbəbəl/","extraExplanation":["“probable”常用在正式或书面语中，比“likely”更正式一些：likely 更口语，probable 更偏报告、新闻、学术表达。","常见搭配：It’s probable that + 从句；the probable cause/reason；most/less probable；highly probable（很可能）。","词源来自拉丁语 probare（“证明、检验”），因此带有“有证据支持、经得起推敲”的语感。"]}
{"word":"probableness","summary":{"en":"Probableness means how likely something is to happen, though it’s less common than probability or likelihood.","zh":"Probableness 指某事发生的可能性，但比 probability 或 likelihood 更不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being probable; likelihood.","zh":"可能性；很可能发生的程度。"},"examples":[{"en":"We discussed the probableness of rain this afternoon.","zh":"我们讨论了今天下午下雨的可能性。"},{"en":"The report estimates the probableness of the plan succeeding is high.","zh":"报告估计该计划成功的可能性很高。"}]}],"synonyms":["likelihood","probability","chance","possibility"],"phonetic":"/ˈprɑbəblnəs/","extraExplanation":["“probableness”在现代英语里比较少见，更常用的说法是“probability”或“likelihood”。在较正式或学术写作中，如果你想表达“概率（可计算的数值）”，通常用“probability”；想表达“看起来很可能（主观判断）”，更常用“likelihood”。"]}
{"word":"probably","summary":{"en":"Probably means “most likely,” used when you think something is true or will happen but you aren’t completely certain.","zh":"Probably 表示“很可能/大概”，用于你认为某事很可能真实或会发生，但并不完全确定。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"used to say something is likely true or will likely happen (but not 100% certain)","zh":"用来表示某事很可能是真的或会发生（但不完全确定）"},"examples":[{"en":"It will probably rain later.","zh":"待会儿很可能会下雨。"},{"en":"She’s probably at home right now.","zh":"她现在可能在家。"}]},{"partOfSpeech":"adv.","definition":{"en":"used as a polite, careful answer meaning “I think so” or “most likely”","zh":"作为委婉、谨慎的回答，表示“我想是的/多半是”"},"examples":[{"en":"A: Are you coming tomorrow? B: Probably.","zh":"A：你明天来吗？B：大概会吧。"},{"en":"Probably not—I'm pretty busy this week.","zh":"大概不行——我这周挺忙的。"}]}],"synonyms":["likely","most likely","in all likelihood","presumably"],"phonetic":"/ˈprɑːbəbli/","extraExplanation":["语气与搭配：\"probably\" 比 \"maybe\" 更肯定一些（可能性更高），但比 \"definitely\"（肯定）弱。常见位置在助动词后（will/are/is 等后面）：\"It will probably...\"、\"She is probably...\"；也可以放句首强调：\"Probably, he forgot.\"","口语中常与否定搭配：\"probably not\"（多半不）。注意不是 *\"not probably\"（较少见且语气不同）。"]}
{"word":"probachelor","summary":{"en":"“Pro-bachelor” means favoring bachelors or the bachelor lifestyle (often informal).","zh":"“Pro-bachelor”指“挺单身/支持单身生活方式”（多为非正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting bachelors or bachelorhood; in favor of remaining unmarried (often used in discussion or humor).","zh":"支持单身男性或单身生活方式；赞成保持未婚（常用于讨论或带点调侃的语境）。"},"examples":[{"en":"He has a very pro-bachelor attitude and says marriage can wait.","zh":"他很偏向“单身派”的态度，说结婚可以再等等。"},{"en":"The article sounded pro-bachelor, praising the freedom of living alone.","zh":"那篇文章有点“挺单身”的倾向，称赞独居的自由。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports bachelors or promotes bachelorhood (rare).","zh":"支持单身男性或提倡单身生活的人（较少见）。"},"examples":[{"en":"Some critics called him a pro-bachelor who discourages commitment.","zh":"一些批评者说他是个“单身派”，不鼓励长期承诺。"}]}],"synonyms":["pro-single","in favor of staying single","pro-bachelorhood"],"phonetic":"/ˌproʊˈbætʃələr/","extraExplanation":["“pro-”是英语里很常见的前缀，表示“支持、赞成”（如 pro-democracy 亲民主、pro-environment 亲环保）。因此 pro-bachelor 直译就是“支持单身/挺单身”。","这个词不算常用，更常见、更自然的表达包括：pro-single、pro-bachelorhood，或直接说 someone is in favor of staying single。"]}
{"word":"probal","summary":{"en":"“Probal” is usually a misspelling of “probable,” meaning likely to happen or be true.","zh":"“probal”通常是“probable”的拼写错误，意思是“很可能发生或为真”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “probable.”","zh":"（非标准用法）很可能是 “probable” 的拼写错误。"},"examples":[{"en":"I think you mean “probable,” not “probal.”","zh":"我觉得你想写的是 “probable”，不是 “probal”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Likely to happen or be true; more likely than not.","zh":"可能发生或可能为真；更有可能。"},"examples":[{"en":"It’s probable that it will rain this afternoon.","zh":"今天下午很可能会下雨。"},{"en":"The most probable explanation is a simple mistake.","zh":"最可能的解释是一个简单的错误。"}]}],"synonyms":["likely","plausible","possible","expected"],"phonetic":"/ˈprɑbəbəl/","extraExplanation":["“probal”在现代英语里不是常见标准拼写。最常见的正确形式是形容词“probable”。","“probable”常用于比较正式的语境（新闻、报告、学术写作）。日常口语里也常用“likely”（比如：It’s likely to rain）。","在法律英语中，你可能会见到短语“probable cause”（合理理由/可能原因），尤其在美国法律与新闻报道里很常见。"]}
{"word":"proballein","summary":{"en":"“proballein” isn’t a standard English word; you probably mean “probably” (= most likely; usually).","zh":"“proballein” 不是标准英语词；你很可能想写 “probably”（= 很可能；通常）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Common misspelling) Intended word: “probably” — used to say something is likely true or will likely happen; “most likely.”","zh":"（常见拼写错误）可能想写的是 “probably”——表示某事很可能是真的或会发生；“很可能”。"},"examples":[{"en":"It will probably rain later, so bring an umbrella.","zh":"等会儿很可能会下雨，所以带把伞。"},{"en":"She’s probably at work right now.","zh":"她现在很可能在上班。"}]},{"partOfSpeech":"adv.","definition":{"en":"“Probably” can also mean “in most cases; usually,” when talking about what generally happens.","zh":"“Probably” 也可表示“多半情况下；通常”，用于说明一般规律或常见情况。"},"examples":[{"en":"If you study a little every day, you’ll probably improve faster.","zh":"如果你每天学一点，你通常会进步更快。"}]}],"synonyms":["most likely","likely","in all likelihood","usually (in some contexts)"],"phonetic":"/ˈprɑːbəbli/","extraExplanation":["“proballein” 不是标准英语单词；最接近、最常见的目标词通常是 “probably”。常见错误来源：把 -bly 写成 -blein / -ball- 等。","小提示：把 “probably” 分成 pro + ba + bly 来记，结尾是 -bly（像：possibly, simply）。"]}
{"word":"proballoon","summary":{"en":"“Proballoon” is a nonstandard spelling of “pro-balloon,” meaning supportive of balloons/ballooning, or a supporter of them.","zh":"“proballoon”多为非标准拼写，通常指“pro-balloon”：支持气球/热气球活动的（或支持者）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or in favor of balloons or ballooning (often written “pro-balloon” or “pro balloon”)","zh":"支持气球或热气球活动的；赞成使用气球的（常写作“pro-balloon”或“pro balloon”）"},"examples":[{"en":"The city council heard both pro-balloon and anti-balloon arguments about wildlife safety.","zh":"市议会听取了支持与反对气球（对野生动物安全影响）的双方意见。"},{"en":"Some parks are pro-balloon for festivals, but they require strict cleanup rules.","zh":"有些公园在节庆时对放气球持支持态度，但会要求严格的清理规定。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports balloons or ballooning","zh":"支持气球或热气球活动的人（或团体）"},"examples":[{"en":"Pro-balloons say the event brings tourism and jobs.","zh":"支持者认为活动能带来观光收入和就业。"}]}],"synonyms":["in favor of ballooning","balloon-friendly","supportive of balloon events"],"phonetic":"/proʊ bəˈlun/","extraExplanation":["“pro-”是英语里很常见的前缀，表示“赞成、支持”（如 pro-choice, pro-democracy）。所以“pro-balloon”多用于讨论政策或争议：例如是否允许放气球、热气球节是否继续举办等。","拼写上更自然的是“pro-balloon”（带连字符）或“pro balloon”（分开写）；把它写成一个单词“proballoon”不太常见，通常会被当作非正式写法或临时造词。"]}
{"word":"proban","summary":{"en":"Proban is a brand name for flame-retardant treatment and the fabric made with it, commonly used in protective workwear.","zh":"Proban是阻燃整理/处理的商标名，也可指经该处理的面料，常用于防护工作服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trademark name for a flame-retardant treatment (and fabric made with it), often used for protective workwear such as coveralls and uniforms","zh":"“Proban”是一个商标名，指一种阻燃整理/处理技术（以及经过该处理的面料），常用于防护工作服，如连体服、制服等"},"examples":[{"en":"The workers wear Proban-treated cotton coveralls for added fire protection.","zh":"工人穿着经过Proban阻燃处理的棉质连体服，以增加防火保护。"},{"en":"This uniform uses Proban fabric to meet safety standards.","zh":"这套制服使用Proban面料来符合安全标准。"}]}],"synonyms":["flame-retardant treated cotton","FR-treated fabric"],"phonetic":"/ˈproʊˌbæn/","extraExplanation":["“Proban”多见于服装/劳保品说明书、采购清单或安全规范中，语境通常与“flame-retardant（阻燃）”“protective clothing（防护服）”一起出现。","它是商标/商品名，不是最常见的通用词。口语或学术写作中更常说“flame-retardant treated cotton（阻燃处理棉）”。","如果你想查的是遗传学里的“proband（家系先证者/发端者）”，那是另一个词，拼写多一个字母 d。"]}
{"word":"proband","summary":{"en":"A proband is the first person in a family who is identified and studied (often the first diagnosed) for a genetic condition.","zh":"Proband 指家系中首先被识别并纳入研究（常为首先被诊断）遗传疾病的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics/medicine) a person being studied or described first in a family, especially the first person diagnosed with a genetic condition; the “index case.”","zh":"（遗传学/医学）家系中首先被研究或首先被描述的人，尤其是最先被诊断出遗传性疾病的人；“指示病例/先证者”。"},"examples":[{"en":"The proband was a 12-year-old girl with symptoms of muscular dystrophy.","zh":"先证者是一名12岁女孩，出现了肌营养不良的症状。"},{"en":"After identifying the proband, doctors offered genetic testing to close relatives.","zh":"确定先证者后，医生向近亲属提供了基因检测。"}]}],"synonyms":["index case","case subject"],"phonetic":"/proʊˈbænd/","extraExplanation":["“Proband”常用于遗传咨询、家系图（pedigree）与病例报告中，表示“这次研究从谁开始”。它不一定是家族中第一个患病的人，而是第一个被医疗系统识别、记录或纳入研究的人。","相关术语：index case（指示病例/首例）、patient zero（零号病人，常用于传染病语境，含义与proband不同）、propositus（较旧的术语）。","词源：来自拉丁语 *probandus*，意为“需要被检验/证明的”。"]}
{"word":"probandi","summary":{"en":"Probandi is Legal Latin meaning “of proving,” most often seen in onus probandi (“burden of proof”).","zh":"Probandi 是法律拉丁语，意为“关于证明的”，最常见于 onus probandi（举证责任）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Legal Latin) “of proving”; used in phrases like “onus probandi,” meaning the responsibility to prove a claim in court.","zh":"（法律拉丁语）“关于证明的 / 证明之”；常见于短语“onus probandi（举证责任）”，指在法庭上证明某项主张的责任。"},"examples":[{"en":"In many civil cases, the onus probandi lies with the plaintiff.","zh":"在许多民事案件中，onus probandi（举证责任）通常由原告承担。"},{"en":"The judge explained that probandi refers to proving the facts, not just making accusations.","zh":"法官解释说，probandi 指的是“证明事实”，而不仅是提出指控。"}]}],"synonyms":["burden of proof","onus probandi"],"phonetic":"/proʊˈbændi/","extraExplanation":["“probandi”来自拉丁语动词 probare（证明、检验、认可）的动名词属格形式，字面是“关于证明的”。英语里几乎不单独使用，最常见搭配是 onus probandi（举证责任）。","在英美法语境中，类似的拉丁语表达还有：burden of proof（英语对应说法）、standard of proof（证明标准，如“beyond a reasonable doubt”排除合理怀疑）。"]}
{"word":"probands","summary":{"en":"“Probands” means the people who serve as the starting point (index individuals) in genetic or medical family studies.","zh":"“Probands”指在遗传学或医学家系研究中作为线索起点的个体（先证者），是 proband 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of proband) the person who is the starting point for a medical, genetic, or family-study investigation (for example, the first affected family member who brings a condition to attention).","zh":"（proband 的复数）医学/遗传学/家系研究中作为“起点”的个体（例如最先被发现或就诊、从而引起对某种疾病关注的家族成员）。"},"examples":[{"en":"In this study, probands were recruited from a hospital genetics clinic.","zh":"在这项研究中，proband（先证者/起始个体）来自医院的遗传门诊。"},{"en":"Researchers compared the probands with their siblings to estimate inherited risk.","zh":"研究人员将先证者与其兄弟姐妹进行比较，以估计遗传风险。"},{"en":"The probands’ family histories were used to draw pedigrees.","zh":"研究者用先证者的家族史来绘制家系图。"}]}],"synonyms":["index cases","index patients","cases (in a study)"],"phonetic":"/ˈproʊbænd/","extraExplanation":["“proband”常见于遗传学与家系研究语境，也常译为“先证者”。它不一定是家族中“最先患病的人”，而是研究或就诊时被选为线索/起点的那个人。相关词：index case（指示病例/首发病例）、pedigree（家系图）。"]}
{"word":"probang","summary":{"en":"A probang is a medical tool (and the action of using it) to remove something stuck in the throat or esophagus.","zh":"probang 指用于清除咽喉或食管异物的医疗器具，也可作动词表示“用探棒清除堵塞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, thin medical instrument used to remove something stuck in the throat or esophagus (food pipe) of a person or animal","zh":"（医疗器械）探棒；用于从咽喉或食管中取出卡住异物的细长器具（人或动物）"},"examples":[{"en":"The vet used a probang to remove the piece of bone from the dog’s throat.","zh":"兽医用探棒把卡在狗喉咙里的骨头取了出来。"},{"en":"In older medical texts, a probang is mentioned as a tool for clearing blockages in the esophagus.","zh":"在较早的医学文献中，探棒被提到用于清除食管堵塞。"}]},{"partOfSpeech":"v.","definition":{"en":"to use a probang to clear an obstruction from the throat or esophagus","zh":"（动词）用探棒清除咽喉或食管中的堵塞/异物"},"examples":[{"en":"The doctor probanged the patient to dislodge the lodged food.","zh":"医生用探棒把卡住的食物顶松并取出。"}]}],"synonyms":["probe","esophageal bougie","instrument (medical)"],"phonetic":"/ˈproʊ.bæŋ/","extraExplanation":["“probang”是较偏专业、也较偏旧式的医学/兽医用词，在现代临床语境中更常用更具体的说法来描述器械或操作（例如按部位说“esophageal…”等）。","词源上一般认为与“probe（探针/探查）”相关，指“用于探入并清除阻塞的器具”。","阅读英文医学史或兽医资料时更容易遇到该词；日常英语交流中很少使用。"]}
{"word":"probangs","summary":{"en":"“probangs” isn’t a standard dictionary word; it’s likely a name or an informal form of “pro bangs” (supporting the bangs hairstyle).","zh":"“probangs”不是标准词；多半是名字/网名，或口语写法“pro bangs”（支持留刘海）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a username/brand name, or an informal mash-up (for example, “pro bangs,” meaning in favor of having bangs/fringe haircut).","zh":"不是标准英语单词；更可能是拼写错误、用户名/品牌名，或口语拼合词（例如“pro bangs”，表示支持/喜欢留刘海）。"},"examples":[{"en":"I couldn’t find “probangs” in a dictionary—did you mean “pro bangs” (in favor of bangs)?","zh":"我在词典里找不到“probangs”——你是不是想说“pro bangs”（支持留刘海）？"},{"en":"Her handle is ProBangs on social media.","zh":"她在社交媒体上的用户名是 ProBangs。"}]}],"synonyms":["pro bangs","in favor of bangs"],"phonetic":"/ˈproʊˌbæŋz/","extraExplanation":["“pro-”在英语里常作前缀，表示“支持、赞成”（例如 pro-choice）。而“bangs”在美式英语里通常指“刘海”（英式英语更常说 fringe）。如果你是在发型语境里看到 probangs，它很可能是把 pro + bangs 连在一起的写法。","如果你告诉我看到它的句子/场景（比如社交媒体、游戏、发型讨论），我可以更准确判断它到底是想表达哪个词。"]}
{"word":"probanishment","summary":{"en":"“Probanishment” isn’t a standard English word; you likely mean “banishment” (exile) or “probation” (court supervision).","zh":"“probanishment”不是标准英文；你很可能想写“banishment（放逐/驱逐）”或“probation（缓刑/察看）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a blend of “probation” and “banishment.”","zh":"不是标准英文单词；很可能是“probation（缓刑/察看）”和“banishment（放逐/驱逐）”的拼写错误或混合词。"},"examples":[{"en":"I can’t find “probanishment” in a dictionary—did you mean “banishment” or “probation”?","zh":"我在词典里找不到“probanishment”——你是想写“banishment”还是“probation”？"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant) banishment: the punishment of forcing someone to leave a country or place; exile.","zh":"（如果你想写的是）banishment：作为惩罚被迫离开某个国家或地方；放逐/流放。"},"examples":[{"en":"In the story, the hero faces banishment from the kingdom.","zh":"在故事里，英雄面临被逐出王国的惩罚。"},{"en":"Banishment was once a common punishment in some societies.","zh":"在一些社会中，放逐曾经是常见的惩罚。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant) probation: a period when a person’s behavior is watched, often as a court sentence instead of prison.","zh":"（如果你想写的是）probation：被监督考察的一段时间，常作为替代坐牢的法院判决（缓刑/察看期）。"},"examples":[{"en":"He was sentenced to two years of probation instead of jail.","zh":"他被判两年缓刑，代替坐牢。"},{"en":"During probation, you must meet with an officer regularly.","zh":"在缓刑期间，你必须定期与缓刑监督官见面。"}]}],"synonyms":["banishment","exile","deportation","probation","parole"],"phonetic":"/ˌproʊbəˈnɪʃmənt/","extraExplanation":["“probanishment”有时会被误写出来，是因为“probation”和“banishment”都与“惩罚/限制自由”有关，但它们含义不同：probation强调“留在社会中但被监督”；banishment强调“被驱逐离开某地”。","如果你能提供原句（你看到或想表达“probanishment”的上下文），我可以帮你判断最可能的正确词，并给出更贴切的翻译。"]}
{"word":"probankruptcy","summary":{"en":"“Probankruptcy” (often written “pro-bankruptcy”) means favoring bankruptcy policies or outcomes.","zh":"“probankruptcy”（更常写作“pro-bankruptcy”）指倾向或支持破产相关的政策或结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring bankruptcy (especially laws, policies, or court decisions that make it easier for people or companies to use bankruptcy to reduce or restructure debt).","zh":"支持或倾向于“破产”（尤指支持让个人或公司更容易通过破产来减免或重组债务的法律、政策或判决）。"},"examples":[{"en":"Some critics say the reform is pro-bankruptcy because it makes debt discharge easier.","zh":"一些批评者说这项改革偏“亲破产”，因为它让债务免除更容易。"},{"en":"The senator rejected the claim that her proposal was pro-bankruptcy.","zh":"这位参议员否认她的提案是“亲破产”的说法。"}]}],"synonyms":["pro-debtor","debtor-friendly","bankruptcy-friendly"],"phonetic":"/proʊˈbæŋkrʌptsi/","extraExplanation":["“pro-”是英语中常见前缀，表示“支持/赞成”。因此 pro-bankruptcy 直译为“支持破产（制度或做法）”。","这个词在新闻评论、政治辩论和法律讨论里更常见，常用于评价某项政策是否“更有利于债务人（debtors）”或“更宽松”。","拼写上常见带连字符 pro-bankruptcy；不带连字符（probankruptcy）也能见到，但较少。"]}
{"word":"probant","summary":{"en":"Probant is a rare word meaning “serving as proof,” and it can also be Latin for “they prove.”","zh":"probant 是个罕见词，可指“具有证明力的”，也可作为拉丁语表示“他们证明”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Serving as proof; having the power to prove something.","zh":"（罕见/古义）可作为证据的；具有证明力的。"},"examples":[{"en":"The lawyer cited a probant document to support the claim.","zh":"律师引用了一份具有证明力的文件来支持该主张。"},{"en":"They searched for any probant evidence that could confirm the timeline.","zh":"他们寻找任何能证实时间线的有力证据。"}]},{"partOfSpeech":"other","definition":{"en":"(Latin) “they prove” — third-person plural present of the Latin verb *probare* (“to prove/test/approve”). Used mainly in scholarly or legal-historical writing.","zh":"（拉丁语）“他们证明/他们证实”——拉丁动词 *probare*（证明/检验/认可）的第三人称复数现在时，多见于学术或法律史语境。"},"examples":[{"en":"In the margin, the editor glossed the phrase with “probant” (“they prove”).","zh":"在页边注释中，编辑把该短语释为“probant”（意为“他们证明”）。"}]}],"synonyms":["probative","evidential","demonstrative","confirmatory"],"phonetic":"ˈproʊbənt","extraExplanation":["“probant”在现代英语里非常少见；很多人真正想写的是 **proband**（医学/遗传学：家系中首先被研究或被诊断的“先证者/发端病例”）。如果你是在医学、遗传学或家系研究中看到的，很可能是 **proband**。","词源上与“prove（证明）”同源，都来自拉丁语 *probare*。"]}
{"word":"probare","summary":{"en":"“Probare” is Latin meaning “to prove/test,” and it’s mainly useful for understanding English word origins.","zh":"“Probare”是拉丁语，意思是“证明/检验”，主要用于帮助理解英语词源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to prove; to test; to approve (the base of English words like “prove,” “probation,” and “probable”).","zh":"（拉丁语）证明；检验；认可（是英语 prove、probation、probable 等词的词根来源）"},"examples":[{"en":"In Latin class, we learned that “probare” means “to prove.”","zh":"在拉丁语课上，我们学到“probare”的意思是“证明”。"},{"en":"The idea of “probation” comes from “probare,” meaning to test someone’s conduct.","zh":"“probation（缓刑/试用期）”的概念来自“probare”，强调“对行为进行考验/检验”。"}]}],"synonyms":["prove","test","verify","validate"],"phonetic":"/proʊˈbɑːreɪ/","extraExplanation":["“probare”不是现代英语单词，而是拉丁语动词的不定式（infinitive）。在英语里它常作为词源知识出现：probare → prove（证明）；probation（试用/考验期）；probable（很可能的，原义与“经得起检验”有关）。","如果你其实想查的是英语单词“probate”（遗嘱认证/检验遗嘱的法律程序），告诉我你要哪个意思（法律名词或动词），我可以给你完整的英语词条与用法。"]}
{"word":"probargaining","summary":{"en":"Pro-bargaining means supportive of bargaining, especially collective bargaining in labor relations.","zh":"pro-bargaining 指“支持谈判的”，尤其指支持劳资之间的集体谈判。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting bargaining (especially collective bargaining between workers/unions and employers)","zh":"支持谈判（尤指工会/劳动者与雇主之间的集体谈判）"},"examples":[{"en":"The senator has a pro-bargaining record and often votes to protect collective bargaining rights.","zh":"这位参议员一向支持谈判，常常投票保护集体谈判权。"},{"en":"Some people call the policy pro-bargaining because it encourages workers and managers to negotiate.","zh":"有人称这项政策为“支持谈判”，因为它鼓励员工与管理层进行协商。"}]}],"synonyms":["pro-union","pro-labor","supportive of collective bargaining"],"phonetic":"/proʊ ˈbɑrɡənɪŋ/","extraExplanation":["“probargaining”通常写作 **pro-bargaining**（带连字符）或 **pro bargaining**（分开写）。前缀 **pro-** 表示“支持、赞成”。\n\n多见于新闻、政治评论与劳工议题语境，常与 **collective bargaining（集体谈判）**、**union（工会）**、**labor rights（劳工权利）** 搭配使用。","相关表达：**pro-union（支持工会的）**、**anti-bargaining（反对谈判/反对集体谈判的）**、**collective bargaining rights（集体谈判权）**。"]}
{"word":"probaseball","summary":{"en":"“Pro baseball” means professional baseball—the paid, organized sport (and also describes things related to it).","zh":"“pro baseball”指职业棒球（有薪、职业化的棒球运动），也可作形容词表示“与职业棒球有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"professional baseball (the sport played as a paid job, especially in major leagues)","zh":"职业棒球（以受雇为职业的棒球运动，尤指大联盟等职业联赛）"},"examples":[{"en":"He dreamed of playing pro baseball after college.","zh":"他梦想大学毕业后打职业棒球。"},{"en":"Pro baseball teams have long seasons and lots of travel.","zh":"职业棒球队赛季很长，还要频繁出差奔波。"},{"en":"She follows pro baseball and watches games every weekend.","zh":"她关注职业棒球，每个周末都看比赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to professional baseball players, teams, or leagues","zh":"与职业棒球（球员、球队或联赛）有关的"},"examples":[{"en":"He bought pro baseball tickets for Saturday night.","zh":"他买了周六晚上的职业棒球比赛门票。"},{"en":"They talked about pro baseball stats and trades.","zh":"他们聊职业棒球的数据和球员交易。"}]}],"synonyms":["professional baseball","the pros (informal)","Major League Baseball (MLB) (US context)"],"phonetic":"/ˌproʊ ˈbeɪsˌbɔl/","extraExplanation":["“pro baseball”是口语里常见的简写，更完整的说法是“professional baseball”。在美国语境中，它常让人联想到MLB（Major League Baseball，美国职棒大联盟）；在日本则可能指NPB（日本职业棒球）。","写作时更常见的形式是“pro baseball”（分开写），或用“professional baseball”。把它写成一个词“probaseball”较少见，多出现在账号名、标签或标题中。"]}
{"word":"probasketball","summary":{"en":"“Pro basketball” means professional, paid basketball, usually played in official leagues.","zh":"“Pro basketball”指职业（有报酬的）篮球，通常在正式联赛中进行。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"professional basketball; basketball played as a paid job, usually in official leagues.","zh":"职业篮球；以篮球为职业、获得报酬并通常在正式联赛中进行的篮球运动。"},"examples":[{"en":"He dreams of playing pro basketball after college.","zh":"他梦想大学毕业后打职业篮球。"},{"en":"She follows pro basketball and watches NBA games every weekend.","zh":"她关注职业篮球，每个周末都会看 NBA 比赛。"},{"en":"It’s hard to make it to pro basketball because the competition is intense.","zh":"想打进职业篮球很难，因为竞争非常激烈。"}]}],"synonyms":["professional basketball","the pros (basketball)","NBA basketball (US context)"],"phonetic":"/proʊ ˈbæskətˌbɔl/","extraExplanation":["“pro”是“professional”的常见缩写，口语里也常用作形容词，表示“职业的/专业的”。","在美国语境中，“pro basketball”常让人联想到NBA、WNBA以及发展联盟（G League）等职业联赛；在其他国家也可指各自的职业联赛（如欧洲各国联赛、CBA等）。","写作中更常见的拼写是“pro basketball”（分开写），而不是合在一起的“probasketball”。"]}
{"word":"probata","summary":{"en":"Probata is a Latin legal term meaning “proved/established by evidence,” often seen in fixed phrases like allegata et probata.","zh":"Probata 是法律英语中使用的拉丁语词，意思是“已被证实的/有证据成立的”，常见于 allegata et probata 等固定表达。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in legal English) “proved; established by evidence.” Often appears in fixed legal phrases.","zh":"（拉丁语，在法律英语中使用）“已被证明的；经证据证实的”。常见于固定法律短语中。"},"examples":[{"en":"The court will decide the case based on the facts alleged and proved (allegata et probata).","zh":"法院将根据“所主张并已证明的事实”（allegata et probata）来裁决案件。"},{"en":"Only the probata, not rumors, can support the judgment.","zh":"只有已被证明的事实（probata），而不是传言，才能支持判决。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare outside law) “approved; tested and found good,” in the sense of something being verified.","zh":"（法律语境外较少见）“经检验而认可的；验证可靠的”，强调经过验证。"},"examples":[{"en":"The method was described as probata in the old text.","zh":"那本旧书把这种方法描述为“经验证可靠的”（probata）。"}]}],"synonyms":["proved","proven","established","verified"],"phonetic":"/proʊˈbɑːtə/","extraExplanation":["“probata”来自拉丁语动词 probare（检验、证明）。在英语法律写作里常与“allegata”（所主张的）搭配成“allegata et probata”，强调“主张必须有证据证明”，否则不能作为裁判依据。","注意不要和英语单词“probate”（遗嘱认证/遗产管理）混淆；两者拼写相近，但“probata”更像是法律拉丁语里的“已证实的（事实）”。"]}
{"word":"probate","summary":{"en":"Probate is the legal court process for validating a will and settling a deceased person’s estate; it can also mean to submit a will to court for this process.","zh":"Probate 指通过法院确认遗嘱有效并处理、分配遗产的法律程序；也可作动词，指向法院申请进行遗嘱认证与遗产处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) The official legal process of proving that a will is valid and administering (managing and distributing) a dead person’s property.","zh":"（法律）遗嘱认证与遗产处理的法定程序：确认遗嘱有效，并管理、清算和分配逝者的财产。"},"examples":[{"en":"After their father died, the family had to go through probate to distribute his assets.","zh":"父亲去世后，家人必须经过遗嘱认证/遗产处理程序才能分配他的财产。"},{"en":"The house was tied up in probate for months, so it couldn’t be sold right away.","zh":"房子因遗嘱认证程序拖了几个月，所以不能立刻出售。"},{"en":"A lawyer helped them understand the probate process and the court paperwork.","zh":"律师帮助他们理解遗嘱认证流程和法院文件。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Law) To prove a will in court and handle the estate through the legal process.","zh":"（法律）对遗嘱进行法院认证，并通过法定程序处理遗产。"},"examples":[{"en":"They needed to probate the will before they could access the bank accounts.","zh":"他们需要先对遗嘱进行认证，才能动用银行账户。"},{"en":"The executor will probate the will with the local court.","zh":"遗嘱执行人将向当地法院申请遗嘱认证。"}]}],"synonyms":["estate administration","will validation","surrogate court process","settle an estate"],"phonetic":"/ˈproʊ.beɪt/","extraExplanation":["“Probate”常见于美国/英国的遗产法律语境。通常涉及：遗嘱是否有效、指定的遗嘱执行人（executor）是否有权处理事务、清点资产与债务、缴税、以及把剩余财产分给受益人（beneficiaries）。","口语里常说“in probate / go through probate”（在走遗嘱认证程序/经历遗嘱认证）。有时人们会提到“avoid probate”（避免遗嘱认证），指通过某些安排（如设立信托、共同产权、指定受益人账户等）让部分资产不必经过漫长的法院程序。"]}
{"word":"probated","summary":{"en":"“Probated” means a will/estate has been officially validated in court (probate) and processed under estate law.","zh":"“Probated”指遗嘱/遗产已在法院完成遗嘱认证（probate），并进入或完成遗产处理程序。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Legal) Past tense/past participle of “probate”: to officially prove that a will is valid in court and to begin the legal process of handling a deceased person’s estate.","zh":"（法律）“probate”的过去式/过去分词：在法院正式确认遗嘱有效，并启动处理逝者遗产的法律程序。"},"examples":[{"en":"The will was probated last month in county court.","zh":"那份遗嘱上个月在县法院完成了遗嘱认证（probate）。"},{"en":"After the document was probated, the executor could distribute the assets.","zh":"文件完成遗嘱认证后，遗嘱执行人就可以分配资产了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a will or estate that has already gone through the probate process.","zh":"用于描述已经完成遗嘱认证程序的遗嘱或遗产（遗产案件）。"},"examples":[{"en":"They sold the house from a probated estate.","zh":"他们出售了一处来自已完成遗嘱认证的遗产名下的房子。"},{"en":"Keep a copy of the probated will for the bank.","zh":"给银行留一份已完成认证的遗嘱副本。"}]}],"synonyms":["validated (a will)","court-approved (a will)","admitted to probate"],"phonetic":"ˈproʊˌbeɪtɪd","extraExplanation":["在美国语境里，probate 通常指“遗嘱认证/遗产认证”程序：法院确认遗嘱是否有效、任命（或确认）遗嘱执行人（executor），并监督债务清偿与财产分配。","不是所有财产都需要走 probate：例如设有“受益人指定”的账户、或以“共同共有并带生存者继承权”（joint tenancy with right of survivorship）持有的资产，常可直接转移。"]}
{"word":"probates","summary":{"en":"“Probates” usually means either (1) the court officially validates a will (verb), or (2) multiple probate cases/processes (noun plural).","zh":"“probates”通常指（1）法院对遗嘱进行认证（动词），或（2）多起遗嘱认证案件/程序（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) Third-person singular of “probate”: to officially prove in court that a will is valid and to begin the legal process of settling someone’s estate after death.","zh":"（动词）“probate”的第三人称单数：在法院中正式确认遗嘱有效，并启动处理逝者遗产（清偿债务、分配财产等）的法律程序。"},"examples":[{"en":"The court probates the will before the assets can be distributed.","zh":"法院先对遗嘱进行认证，然后才能分配资产。"},{"en":"In some states, a judge probates the estate even if the will is simple.","zh":"在一些州，即使遗嘱很简单，法官也可能需要对遗产进行遗嘱认证程序。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) Legal proceedings called “probate” cases/processes; matters handled by a probate court.","zh":"（名词复数）“probate”案件/程序：由遗嘱认证法院处理的遗嘱与遗产清算相关法律事务。"},"examples":[{"en":"The lawyer handles several probates each month.","zh":"这位律师每个月都会处理好几起遗嘱认证案件。"},{"en":"Probates can take months when property or debts are complicated.","zh":"如果财产或债务复杂，遗嘱认证程序可能需要数月。"}]}],"synonyms":["validates a will","administers an estate","estate proceedings","probate cases"],"phonetic":"/proʊˈbeɪts/","extraExplanation":["“probate”是英美法系里很常见的概念，核心是：确认遗嘱真伪/有效性，并在法院监督下清点遗产、偿还债务与税款、最后把剩余财产分配给继承人。不同州/地区流程差异很大（是否需要上庭、是否可简化程序、费用与时间等）。","学习提示：日常英语里更常见的说法是“go through probate（走遗嘱认证程序）”“probate court（遗嘱认证法院）”“probate attorney/lawyer（遗产/遗嘱律师）”。"]}
{"word":"probathing","summary":{"en":"“Probathing” is not a standard English word; it is most likely “probating” (dealing with a will/estate in court).","zh":"“probathing”不是标准英文词；最可能是“probating”（通过法院处理遗嘱/遗产的程序）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Likely a misspelling of “probating,” the present participle of “probate”: to handle a dead person’s will and estate through a court process.","zh":"很可能是“probating”的拼写错误（动词“probate”的现在分词）：指通过法院程序处理逝者的遗嘱与遗产。"},"examples":[{"en":"The family is probating her will to distribute the property legally.","zh":"家人正在通过法院认证她的遗嘱，以合法分配财产。"},{"en":"Probating an estate can take months if there are disputes.","zh":"如果有争议，遗产的遗嘱认证程序可能要花好几个月。"}]}],"synonyms":["administering an estate","settling an estate","executing a will"],"phonetic":"/ˈproʊˌbeɪtɪŋ/","extraExplanation":["“probate”是英美法律语境里的常见词，指“遗嘱认证/遗产清算的法院程序”。动词用法是：to probate a will（对遗嘱进行认证）。如果你本来想表达“洗澡/沐浴”，那对应的英文是“bathing”。","拼写提示：probating（在处理遗嘱/遗产） vs. bathing（在洗澡）。这两个词意义差很多，常见混淆来自拼写相似。"]}
{"word":"probatical","summary":{"en":"“Probatical” is a rare adjective meaning related to probation or a trial/assessment period; in most contexts, “probationary” is the standard word.","zh":"“probatical”是很少见的形容词，意为与缓刑或试用/考察期相关；多数场合更标准的说法是“probationary”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) relating to probation, especially the period when someone is being supervised instead of going to prison, or a trial period to prove suitability.","zh":"（罕见）与“缓刑”有关的；也可指“试用期/考察期”的。"},"examples":[{"en":"He was released under probatical supervision for six months.","zh":"他在六个月内接受与缓刑相关的监督而获释。"},{"en":"New employees may face a probatical period before becoming permanent staff.","zh":"新员工在转正前可能会经历一段试用/考察期。"}]}],"synonyms":["probationary","probational"],"phonetic":"/proʊˈbeɪʃənəl/","extraExplanation":["“probatical”在现代英语中很少见，很多情况下是把更常用的“probationary”（缓刑的；试用的）或“probational”（与缓刑相关的，偏法律用语）写错了。写作和考试中建议优先用“probationary”。","词根来自拉丁语“probare”（测试、证明）。因此它既能和法律的“probation（缓刑）”相关，也能引申到工作中的“probation period（试用期）”。"]}
{"word":"probating","summary":{"en":"“Probating” means going through the legal court process of validating a will and settling/distributing an estate.","zh":"“Probating”指遗嘱/遗产正在进行法院的遗嘱认证与遗产清算分配程序。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"the act of proving a will is valid in court and handling the legal process of distributing a deceased person’s estate","zh":"（遗嘱）在法院被证明有效并进入遗产处理程序；办理遗嘱认证与遗产分配的法律程序"},"examples":[{"en":"The family is probating the will before the assets can be distributed.","zh":"在分配资产之前，这家人正在为遗嘱办理认证程序。"},{"en":"They spent months probating the estate because there were many debts to settle.","zh":"由于需要清偿很多债务，他们花了几个月时间办理遗产认证与清算。"}]},{"partOfSpeech":"vi.","definition":{"en":"going through the probate process (being handled by a court after someone dies)","zh":"（遗产/遗嘱）正在进入遗嘱认证程序；正在走法院处理流程"},"examples":[{"en":"The estate is still probating, so the heirs can’t receive everything yet.","zh":"遗产还在认证程序中，所以继承人暂时不能全部拿到。"},{"en":"While the will is probating, the executor must keep careful records.","zh":"在遗嘱认证期间，遗嘱执行人必须仔细做记录。"}]}],"synonyms":["processing (a will/estate)","going through probate","administering an estate (near meaning)"],"phonetic":"/ˈproʊˌbeɪtɪŋ/","extraExplanation":["“Probating”来自法律动词“probate”。在美国语境里，probate通常指由遗嘱检验法院（probate court）确认遗嘱有效、指定或确认遗嘱执行人（executor），并在需要时监督清偿债务、缴税、把剩余财产分配给继承人的过程。","口语中更常见的说法是“go through probate / be in probate”。“Probating”多见于法律或较正式的写法。"]}
{"word":"probation","summary":{"en":"Probation means a monitored trial period—either for work/school performance or as a legal alternative to prison with rules to follow.","zh":"probation 指“被监督的考察期”，既可指工作/学校的试用期，也可指法律上的缓刑（需遵守规定并接受监督）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A trial period when someone’s behavior or performance is watched to decide if they can keep a job, stay in school, or continue in a program.","zh":"（工作/学校/项目的）试用期、考察期；在这段时间内会观察表现，以决定是否能继续留用或继续参加。"},"examples":[{"en":"New employees are usually on probation for three months.","zh":"新员工通常有三个月的试用期。"},{"en":"She passed her probation and became a full-time teacher.","zh":"她通过了试用期，成为了全职教师。"}]},{"partOfSpeech":"n.","definition":{"en":"A legal period when a person who committed a crime is allowed to stay out of prison, but must follow rules and be supervised.","zh":"（法律）缓刑、假释监管期；犯罪者不入狱（或出狱后）在监督下生活，必须遵守规定。"},"examples":[{"en":"He was sentenced to two years of probation instead of jail.","zh":"他被判处两年缓刑，代替入狱。"},{"en":"If you break the rules while on probation, you may be sent to prison.","zh":"缓刑期间如果违反规定，可能会被送进监狱。"}]}],"synonyms":["trial period","testing period","supervision","conditional release"],"phonetic":"/proʊˈbeɪʃən/","extraExplanation":["词源提示：probation 来自拉丁语 probare（“测试、证明”），所以核心含义是“被测试/被观察的一段时间”。","常见搭配：on probation（在试用期/缓刑中）、probation period（试用期）、probation officer（缓刑监督官）、probationary（adj. 试用的/缓刑的）。","注意区分：probation（缓刑/试用期）不同于 parole（假释：通常指服刑一段时间后有条件提前出狱）。不同地区法律用法会有细微差别。"]}
{"word":"probational","summary":{"en":"Probational means connected with a probation or trial period (legal or work-related).","zh":"probational 指“与缓刑或试用/考察期有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to probation (a trial period, especially under legal supervision or during a new job).","zh":"与“缓刑/试用期（probation）”有关的；处于考察期的。"},"examples":[{"en":"The judge imposed a probational sentence instead of jail time.","zh":"法官判处缓刑性质的刑罚，而不是监禁。"},{"en":"She is on a probational period at her new job for three months.","zh":"她在新工作有三个月的试用（考察）期。"}]}],"synonyms":["probationary","conditional","trial"],"phonetic":"/proʊˈbeɪʃənəl/","extraExplanation":["“probational”来自名词“probation（缓刑；试用期）”。在法律语境里，probation 指“在社区接受监督的缓刑”；在职场语境里，指“新员工试用期”。写作中更常见的搭配是“on probation（在缓刑/试用期）”或“probationary（试用的；缓刑的）”；“probational”相对少见，但含义基本一致。"]}
{"word":"probationally","summary":{"en":"Probationally means “in a probation/trial-period way,” used in legal (on probation) or work/school (probationary period) contexts.","zh":"Probationally 表示“以缓刑/试用（考察）期的方式”，常见于法律或工作/学校的试用考察语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is connected to probation—a trial period in which someone’s behavior or performance is being evaluated (often in law or at work/school).","zh":"以“试用/考察期（缓刑观察期）”的方式；处于被观察、被评估的状态（常用于法律或工作/学校情境）。"},"examples":[{"en":"He was released probationally and must report to an officer every week.","zh":"他以缓刑观察的方式获释，并且必须每周向监管官报到。"},{"en":"She was hired probationally for three months before becoming a permanent employee.","zh":"她先以试用方式被录用三个月，之后才可能转为正式员工。"}]}],"synonyms":["on probation","in a probationary way","conditionally"],"phonetic":"/proʊˈbeɪʃənəli/","extraExplanation":["“probationally”比较少见，更常见的说法是用介词短语：in probation / on probation（在缓刑中/在试用期），或用形容词：a probationary period（试用期/考察期）。","法律语境里：on probation 指“缓刑（社区监管）”，不是“保释（bail）”。职场/学校语境里：probationary/probational 指“试用/留校察看等考察期”。"]}
{"word":"probationary","summary":{"en":"Probationary means “on trial for a period”—most often a job trial period, and sometimes related to legal probation.","zh":"probationary 意为“处于考察/试用阶段的”，最常用于工作试用期；也可指与法律上的缓刑相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a period, job, or status) used to test someone’s performance or behavior before a final decision is made","zh":"（指一段时间、工作或身份）试用的；考察期的；在正式决定前用于评估表现或行为的"},"examples":[{"en":"She was hired on a probationary basis for three months.","zh":"她以三个月试用的方式被录用。"},{"en":"During the probationary period, employees receive extra training.","zh":"在试用期内，员工会接受额外培训。"},{"en":"His probationary license limits how late he can drive.","zh":"他的见习驾照限制了他开车到多晚。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to legal probation (a time when a person must follow rules instead of going to prison)","zh":"与“缓刑”有关的；指不入狱但需遵守规定、接受监督的一段时期"},"examples":[{"en":"The court placed him on probationary supervision for a year.","zh":"法院对他实行一年的缓刑监管。"},{"en":"Any violation could end his probationary status.","zh":"任何违规都可能导致他的缓刑身份被取消。"}]}],"synonyms":["trial","provisional","temporary","conditional"],"phonetic":"/proʊˈbeɪʃəˌnɛri/","extraExplanation":["“probationary”来自“probation（试用/缓刑）”。在职场里最常见，常搭配：probationary period（试用期）、probationary employee（试用员工）、on a probationary basis（以试用方式）。在法律语境中则与probation（缓刑/社区矫正）相关。"]}
{"word":"probationer","summary":{"en":"A probationer is someone being tested/monitored during a probation period—either a new worker/trainee or (especially in BrE) a person on legal probation.","zh":"probationer 指处于试用/考核期、被观察评估的人（如新员工/见习者），也可指（尤英式英语）被判缓刑并需遵守条件的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is on probation: someone being observed and tested to see if they meet required standards, especially in a new job or training period.","zh":"试用者；见习者：处于“试用/考核期”的人，会被观察与评估是否符合要求，常见于新工作或培训阶段。"},"examples":[{"en":"She joined the company as a probationer for three months before becoming a full employee.","zh":"她以试用员工身份加入公司三个月，之后才转为正式员工。"},{"en":"Probationers must attend weekly training and follow the rules strictly.","zh":"试用人员必须每周参加培训并严格遵守规定。"}]},{"partOfSpeech":"n.","definition":{"en":"In the legal system (especially in British English), a person placed on probation instead of being sent to prison, and who must follow certain conditions.","zh":"（法律用语，尤英式英语）缓刑者：被判处缓刑、以遵守条件代替入狱的人。"},"examples":[{"en":"The court ordered the probationer to meet a probation officer every month.","zh":"法院要求这名缓刑者每月与缓刑官见面一次。"},{"en":"If a probationer breaks the rules, they may be sent to prison.","zh":"如果缓刑者违反规定，可能会被送进监狱。"}]}],"synonyms":["trainee","intern (sometimes)","new hire (on probation)","probationary employee","offender on probation (legal)"],"phonetic":"/proʊˈbeɪʃənɚ/","extraExplanation":["“probationer”来自“probation（试用期/缓刑）”。在职场语境里更常见的是“on probation / probationary period（试用期）”；在法律语境里常与“probation officer（缓刑监督官）”搭配。","美式英语里，职场常说“a new hire on probation”或“a probationary employee”；英式英语里用“probationer”指缓刑人员的情况更常见。"]}
{"word":"probationerhood","summary":{"en":"Probationerhood means the state or time of being a probationer—someone in a trial, training, or monitored period.","zh":"Probationerhood 指“处于试用/见习/受监督考察的身份或时期”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a probationer (a person who is being tested, trained, or monitored before becoming a full member or receiving full trust)","zh":"见习者/试用者/缓刑监督对象的身份或阶段（指在正式成为成员、获得完全信任或解除监督前所处的考察期）"},"examples":[{"en":"During her probationerhood, she worked under close supervision and received weekly feedback.","zh":"在她的见习阶段，她在严格监督下工作，并每周接受反馈。"},{"en":"The organization evaluates discipline and reliability throughout a member’s probationerhood.","zh":"该组织在成员的试用期内评估其纪律性与可靠性。"}]}],"synonyms":["probationary period","probation","trial period","apprenticeship (in some contexts)"],"phonetic":"/proʊˈbeɪʃəˌnɚˌhʊd/","extraExplanation":["“probationerhood”非常少见，更常用的表达是“probationary period”（试用期/考察期）或“probation”（试用/缓刑监督期）。","词形上由“probationer（见习者/受监督者）+ -hood（……的身份/状态/时期，如 childhood）”构成，强调“作为某种身份的状态或阶段”。","语境可能出现在人事管理（试用期员工）、组织入会（见习会员）、或司法领域（缓刑期间的人员）。具体含义需结合上下文判断。"]}
{"word":"probationers","summary":{"en":"Probationers are people being monitored during a probation period (legal supervision or a job trial period).","zh":"probationers 指处于缓刑监督期或工作试用考察期的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are on probation: a trial period during which their behavior is monitored instead of being in prison, or (in some jobs) a period when a new worker is being tested.","zh":"处于“缓刑/试用期”的人：指在一定期限内接受监督考察（代替入狱）的人；也可指处于工作试用期、被考核的新员工。"},"examples":[{"en":"The probationers must meet with an officer every week and follow strict rules.","zh":"缓刑人员必须每周与监督官会面，并遵守严格规定。"},{"en":"During training, probationers are evaluated before they become full employees.","zh":"在培训期间，试用员工会被评估，合格后才成为正式员工。"}]}],"synonyms":["people on probation","parolees (related, not identical)","trainees (job context)","new hires (job context)"],"phonetic":"/proʊˈbeɪʃənərz/","extraExplanation":["“probationer”来自“probation（试用/考察期）”。在法律语境里，probationer（缓刑人员）通常需要遵守条件（如定期报到、不得接触某些人、不得饮酒等），否则可能被撤销缓刑并入狱。","在职场语境中，英式英语里“probationer”更常指“试用期员工”；美式英语更常说“employee on probation / on a probationary period”，但“probationer”也能理解。"]}
{"word":"probationership","summary":{"en":"Probationership means the status or period of being a probationer—being tested or trained before a permanent role.","zh":"Probationership 指“试用人员的身份或试用期”，即在正式录用前接受考核或培训的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or period of being a probationer (someone being tested, trained, or watched before getting a permanent position).","zh":"试用身份；试用期（指作为“试用人员”在正式录用前接受考核、培训或观察的阶段）。"},"examples":[{"en":"During her probationership, she had to complete weekly training and performance reviews.","zh":"在她的试用期内，她需要完成每周培训并接受绩效评估。"},{"en":"He resigned before his probationership ended, so he was never confirmed as a permanent employee.","zh":"他在试用期结束前辞职了，因此从未被确认转为正式员工。"}]}],"synonyms":["probationary period","probation period","traineeship","internship (sometimes, depending on context)"],"phonetic":"/proʊˈbeɪʃənərʃɪp/","extraExplanation":["“probationership”并不是日常美式英语里最常见的词；在一些地区或行业（例如英式/南亚语境的政府部门、医院护理培训、教育系统等）更常见，用来强调“试用/见习人员的身份或阶段”。在更普通的美式职场表达里，人们更常说“probation period / probationary period（试用期）”。","构词上：probation（试用/察看期）+ -er（人：probationer 试用人员）+ -ship（状态/身份，如 membership, leadership）。因此它的核心意思是“作为 probationer 的身份/期限”。"]}
{"word":"probationism","summary":{"en":"Probationism is the idea or system of relying on probation—supervised community release—as an alternative to prison, aiming to rehabilitate offenders.","zh":"Probationism 指一种依靠缓刑/社区监督作为监禁替代方案、强调改造与回归社会的理念或制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A policy, system, or belief that emphasizes using probation (supervised release in the community) instead of sending people to jail or prison, especially as a method of rehabilitation.","zh":"一种强调“缓刑/社区矫正监管”（在社区内接受监督而非入狱）的政策、制度或理念，尤其把它视为改造与回归社会的方法。"},"examples":[{"en":"The judge supported probationism for first-time, nonviolent offenders.","zh":"法官支持对初犯、非暴力犯罪者采取“以缓刑为主”的理念。"},{"en":"Critics argue that probationism can fail without enough officers and treatment programs.","zh":"批评者认为，如果没有足够的监管人员和治疗项目，“缓刑主义”可能会失效。"}]}],"synonyms":["probation policy","community supervision","alternatives to incarceration","non-custodial sentencing"],"phonetic":"/proʊˈbeɪʃəˌnɪzəm/","extraExplanation":["这个词在现代日常英语里非常少见，更多出现在犯罪学、刑罚政策讨论或历史性文献中。更常用的表达是：the use of probation、probation policy、community supervision、alternatives to incarceration（替代监禁措施）。","probation 在不同司法体系里可能对应不同制度（如美国的 probation、英国的 probation service）。翻译成“缓刑/社区矫正/缓刑监管”时，要根据具体国家与语境选择更准确的说法。"]}
{"word":"probationist","summary":{"en":"A probationist is a person under probation—usually supervised by the legal system instead of being in prison.","zh":"probationist 指“处于缓刑/监督考察期的人”，通常用于司法语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is on probation (a period when someone is supervised instead of being sent to prison, or while their behavior/work is being tested).","zh":"受缓刑监督的人；（在一定期限内）接受监督或考察的人。"},"examples":[{"en":"The probationist must report to a probation officer every week.","zh":"这名缓刑人员必须每周向缓刑官报到。"},{"en":"As a probationist, he has to follow strict rules, like staying away from certain places.","zh":"作为缓刑人员，他必须遵守严格规定，比如远离某些地方。"}]}],"synonyms":["probationer","someone on probation"],"phonetic":"/proʊˈbeɪʃənɪst/","extraExplanation":["“probationist”常见于法律/司法语境，日常口语里更常说“someone on probation”或直接用“probationer”。在英美法律中，probation 通常指“以社区监督替代入狱”的处遇；在工作/学校语境里，probation 也可指“试用/考察期”，但表示“处于试用期的人”时更常见的说法是“employee on probation / a probationary employee”。"]}
{"word":"probations","summary":{"en":"“Probations” is the plural of “probation,” meaning trial/test periods (work/school) or legal probation (time under court supervision).","zh":"“Probations”是“probation”的复数，指（工作/学校的）试用期/考察期，或（法律上的）缓刑期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Periods of time when someone is tested or observed to see if they meet a standard (for example, at a new job or in school).","zh":"（复数）试用期；考察期：在一段时间内对某人进行观察与评估，看是否符合标准（如新工作或学校）。"},"examples":[{"en":"New teachers usually complete one or two probations before they get a permanent contract.","zh":"新教师通常要完成一到两段试用期，才能获得正式合同。"},{"en":"During her probations, she received regular feedback from her supervisor.","zh":"在她的试用期里，她定期收到主管的反馈。"}]},{"partOfSpeech":"n.","definition":{"en":"In law, court-ordered periods when a person is allowed to live in the community instead of going to jail, under rules and supervision.","zh":"（法律）缓刑（复数）：法院命令的在社区生活、接受监督并遵守规定的期限，用以替代入狱。"},"examples":[{"en":"The judge gave him two years of probation, with weekly check-ins.","zh":"法官判他两年缓刑，每周报到一次。"},{"en":"If you break the rules during probation, you may be sent to jail.","zh":"如果在缓刑期间违规，可能会被送进监狱。"}]}],"synonyms":["trial periods","probationary periods","supervision","parole (related, but not the same)"],"phonetic":"/proʊˈbeɪʃənz/","extraExplanation":["“Probations”是名词复数，单数是“probation”。常见两大语境：\n1）工作/学校：trial period（试用期、考察期）；\n2）法律：probation（缓刑）。\n看到搭配词能快速判断含义：如“permanent contract/employee evaluation”多指试用期；“judge/court/officer/check-ins”多指缓刑。"]}
{"word":"probationship","summary":{"en":"“Probationship” is a nonstandard word meaning a probationary/trial period or being on probation.","zh":"“Probationship”是非标准词，通常指试用/考察期或处于缓刑（监管观察）状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) A probationary period or the condition/state of being on probation; a trial period before full acceptance.","zh":"（非标准用法）试用期；缓刑/监管观察期；处于“考察中”的状态（正式资格前的试行阶段）。"},"examples":[{"en":"New employees often have a three-month probationship before they receive full benefits.","zh":"新员工通常会有三个月的“试用期（probationship）”，之后才能享受完整福利。"},{"en":"He violated the rules during his probationship and lost the opportunity to join the team.","zh":"他在考察期（probationship）违反了规定，失去了加入团队的机会。"}]}],"synonyms":["probation","probationary period","trial period","being on probation"],"phonetic":"/proʊˈbeɪʃənˌʃɪp/","extraExplanation":["“probationship”在标准英语里不常见，很多情况下是把 probation（试用期/缓刑）加上 -ship（表示“状态/身份/关系”的后缀，如 friendship）而形成的“自造词/半口语用法”。正式写作中更推荐用 probation / probationary period / trial period。","在法律语境里通常不用“probationship”，而用 probation（缓刑、社区监管）或 on probation（处于缓刑监管中）。职场语境里也更常说 probation period / probationary period。"]}
{"word":"probative","summary":{"en":"Probative means “able to prove something,” especially in legal contexts where it describes evidence that strongly helps establish a fact.","zh":"Probative 指“具有证明力的；能作为有力证据的”，尤其常用于法律语境，描述能有效帮助认定事实的证据。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Providing proof or strong evidence; showing that something is true.","zh":"能证明的；有力佐证的；显示某事为真的。"},"examples":[{"en":"The emails were probative evidence that the company knew about the problem.","zh":"这些邮件是有力的证据，证明公司早就知道这个问题。"},{"en":"The judge said the video was highly probative and allowed it in court.","zh":"法官认为这段视频很有证明力，因此允许在法庭上使用。"},{"en":"We need probative data, not just opinions.","zh":"我们需要有证明力的数据，而不只是观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law) Relevant and helpful for proving a fact in a legal case.","zh":"（法律）与案件事实认定相关、并有助于证明某项事实的。"},"examples":[{"en":"The court excluded the document because it was not probative of intent.","zh":"法院排除了该文件，因为它对证明“意图”没有帮助。"},{"en":"Evidence can be relevant but not very probative if it doesn’t strongly support the claim.","zh":"证据可能“相关”，但如果不能有力支持主张，就未必很有证明力。"}]}],"synonyms":["evidentiary","conclusive","demonstrative","persuasive","convincing"],"phonetic":"/ˈproʊbəˌtɪv/","extraExplanation":["“probative”常见于法律与正式写作，来自拉丁语词根 *probare*（证明、检验），也与 *prove*（证明）同源。","在法律语境里常与“relevant（相关的）”一起出现：relevant 表示“和案件有关”，probative 更强调“能否真正帮助证明某个关键事实”。"]}
{"word":"probatively","summary":{"en":"“Probatively” means “in a way that serves as evidence or proof,” often used in law or academic writing, and can also mean “as a trial/experiment.”","zh":"“probatively”意为“以能作为证据/证明的方式”，常用于法律或学术写作；也可表示“试验性地/作为尝试”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is based on evidence and intended to test or prove something; experimentally or as a trial.","zh":"以证据为基础、用来检验或证明某事的方式；试验性地、作为尝试地。"},"examples":[{"en":"The results were probatively linked to the new training method.","zh":"这些结果在证据层面被用来证明与新的训练方法有关。"},{"en":"They probatively tested the medication on a small group first.","zh":"他们先在一个小组上以试验性方式测试这种药物。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Law) In a way that provides proof in court; having probative value.","zh":"（法律）以能在法庭上提供证明力的方式；具有证据力（证明力）。"},"examples":[{"en":"The emails were presented probatively to show intent.","zh":"这些邮件以具证明力的方式被提交，用来显示意图。"},{"en":"The judge ruled the photo could be used probatively.","zh":"法官裁定这张照片可作为具有证明力的证据使用。"}]}],"synonyms":["evidentially","as evidence","demonstrably","experimentally","on a trial basis"],"phonetic":"/ˈproʊbəˌtɪvli/","extraExplanation":["“probatively”来自形容词“probative”（有证明力的），常见于法律和学术写作，日常口语里更常用“as evidence / in a way that shows…”或“as a trial / experimentally”。","相关词：probative（adj. 有证明力的）、probability（n. 可能性）、prove（v. 证明）。在法律语境里常见搭配是“probative value”（证明力/证据力），常与“prejudicial”（可能造成偏见的）对比。"]}
{"word":"probator","summary":{"en":"A legal term for someone who proves a will or other claim in court, especially in probate.","zh":"法律术语：在法庭上证明某项主张的人，尤指在遗嘱认证中证明并提交遗嘱的一方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) a person who proves something in court; especially, the person who proves a will (the party who presents it for probate).","zh":"（法律）在法庭上提出证据并证明某事的人；尤指在遗嘱认证（probate）程序中证明遗嘱有效、提交遗嘱进行认证的一方。"},"examples":[{"en":"In the probate case, the probator submitted the signed will and witness statements.","zh":"在遗嘱认证案件中，probator 提交了签署的遗嘱和证人陈述。"},{"en":"If the probator cannot prove the will’s validity, the court may reject it.","zh":"如果 probator 无法证明遗嘱的有效性，法院可能会否决该遗嘱。"}]}],"synonyms":["proponent (of a will)","offering party","presenter (legal)"],"phonetic":"ˈproʊbeɪtər","extraExplanation":["这个词比较少见，多用于法律语境，和 probate（遗嘱认证/遗产管理程序）关系密切。日常英语里更常见的说法是 the proponent of the will（遗嘱的提出方/主张方）或 simply “the person offering the will for probate”。","词源上来自拉丁语 probare（证明、检验），同源词包括 prove（证明）、probation（试用期/缓刑）、probable（可能的）。"]}
{"word":"probatory","summary":{"en":"Probatory means “used for testing or proving something,” often in formal or legal contexts.","zh":"Probatory 指“用于测试或证明的”，常见于较正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as a test or trial to judge whether something or someone is suitable, true, or effective.","zh":"起到测试/试验作用的；用于检验某事或某人是否合适、真实或有效的。"},"examples":[{"en":"The first three months are a probatory period to see if the new employee fits the role.","zh":"前三个月是试用期，用来观察新员工是否适合这个岗位。"},{"en":"The committee treated the pilot program as probatory evidence before expanding it nationwide.","zh":"委员会把试点项目当作试验性依据，在全国推广前先评估。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to probation (a period of official testing or supervision, especially in law or at work).","zh":"与“缓刑/监管期”或“试用期”有关的；处于考察/监督阶段的。"},"examples":[{"en":"He is on probatory supervision while the court reviews his progress.","zh":"在法院评估其表现期间，他处于考察性监管之下。"},{"en":"Some schools place new teachers on probatory status for the first year.","zh":"一些学校会让新教师在第一年处于试用（考察）状态。"}]}],"synonyms":["test","trial","experimental","proving","probationary"],"phonetic":"/ˈproʊbəˌtɔri/","extraExplanation":["“probatory”来自拉丁语词根 *probare*（测试、证明），与常见词 **prove**（证明）同源。","它比 **trial** / **test** 更书面、更正式，常见于法律、制度或政策文件。日常口语中更常说 **trial period**（试用期）或 **probationary**（试用的/缓刑的）。","容易混淆：**probatory**（起检验作用的、用于验证的）侧重“用来证明/检验”；**probationary** 更常指“处于试用/缓刑期间的”。"]}
{"word":"probattle","summary":{"en":"“Probattle” is usually read as “pro-battle”: supporting battle/war, or it may simply be a name/label meaning “professional + battle.”","zh":"“probattle”通常被理解为“pro-battle（支持战斗/战争）”，也可能只是名称/标签，意为“专业/进阶 + 战斗/对抗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; most often understood as “pro-battle,” meaning supporting battle or war, or favoring fighting as a solution.","zh":"不是标准词典词；通常可理解为“pro-battle（支持战斗/战争）”，指赞成用战斗或武力来解决问题。"},"examples":[{"en":"Some people criticized the movie for a pro-battle message.","zh":"有人批评这部电影传递了“支持战争/战斗”的信息。"},{"en":"Her speech sounded pro-battle rather than pro-peace.","zh":"她的演讲听起来更像是支持战争，而不是支持和平。"}]},{"partOfSpeech":"n.","definition":{"en":"A name or label (for a product, username, or game tag), where “Pro” suggests “professional/advanced” and “battle” suggests fighting or competition.","zh":"作为名称/标签（产品名、用户名或游戏ID等）使用，其中“Pro”常表示“专业/进阶”，“battle”表示“战斗/对抗”。"},"examples":[{"en":"He goes by ProBattle on streaming platforms.","zh":"他在直播平台上用的名字是 ProBattle。"},{"en":"This controller is sold under the ProBattle brand.","zh":"这个手柄以 ProBattle 品牌销售。"}]}],"synonyms":["pro-war","militaristic","war-supporting"],"phonetic":"/ˌproʊˈbætəl/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持、赞成”（如 pro-democracy 支持民主；pro-choice 支持选择权）。因此 pro-battle 可以按字面理解为“支持战斗/战争”。","但把它连写成“probattle”并不常见，更多时候会用连字符写作“pro-battle”。如果你是在特定语境（游戏、品牌、网名、某个标题）看到它，含义通常取决于那个语境。你也可以告诉我看到它的句子，我可以更准确判断。"]}
{"word":"probattleship","summary":{"en":"A battleship is a large, heavily armed warship; it can also refer to the board game Battleship.","zh":"battleship 指战列舰；也可指桌游《海战棋》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, heavily armed and armored warship (especially important in the early 1900s).","zh":"（尤指20世纪早期很重要的）战列舰；一种大型、重武装、装甲厚的军舰。"},"examples":[{"en":"The museum has a restored battleship you can tour.","zh":"这家博物馆有一艘修复后的战列舰可以参观。"},{"en":"Battleships were designed to carry powerful big guns and survive heavy damage.","zh":"战列舰的设计目的是携带强大的巨炮，并能承受严重打击。"}]},{"partOfSpeech":"n.","definition":{"en":"(Battleship) A popular guessing board game in which players try to “sink” each other’s hidden ships by calling grid coordinates.","zh":"（Battleship）《海战棋》（猜测类桌游）：玩家通过报出坐标来击沉对方隐藏的船只。"},"examples":[{"en":"We played Battleship after dinner.","zh":"晚饭后我们玩了《海战棋》。"},{"en":"She guessed “B-7” and got a hit.","zh":"她猜“B-7”，结果命中了。"}]}],"synonyms":["warship","capital ship"],"phonetic":"/ˈbætəlˌʃɪp/","extraExplanation":["你输入的“probattleship”看起来像是把“battleship”前面多打了“pro-”，或是连在一起的误拼。如果你想表达“专业的战列舰（pro battleship）”或某个游戏/账号名，也可以告诉我具体语境，我可以按你的意思解释。","词源小贴士：battle（战斗）+ ship（船）合成。现代海军中，战列舰在二战后逐渐被航空母舰、导弹驱逐舰等取代，所以在新闻里多见于历史、博物馆或比喻用法。","常见相关词：destroyer（驱逐舰）、cruiser（巡洋舰）、aircraft carrier（航空母舰）、fleet（舰队）。"]}
{"word":"probatum","summary":{"en":"Probatum is a Latin term used in English to mean “proven” or “tested,” especially for remedies or recipes.","zh":"Probatum 是一个拉丁语词，在英语中表示“已验证/已证明有效”，常见于较旧的疗法或配方记录。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in English) proved; tested; shown to work (often used to describe a remedy, method, or recipe).","zh":"（拉丁语，英语中偶见）已被证明有效的；经过检验的（常用于描述疗法、方法或配方）。"},"examples":[{"en":"This herb mixture was labeled probatum in an old medical notebook.","zh":"在一本旧医药笔记里，这种草药混合物被标注为 probatum（意为“已验证有效”）。"},{"en":"The recipe was marked probatum, suggesting the writer had tried it successfully.","zh":"这份配方被标为 probatum，暗示作者亲自试过并且成功。"}]}],"synonyms":["proven","tested","tried-and-true","time-tested"],"phonetic":"/proʊˈbeɪtəm/","extraExplanation":["probatum 是拉丁语，字面意思接近“已被证明”。在英语里多见于较旧的医药、草药、处方或家用偏方记录，用来表示“试过、有效”。","你也可能会看到更完整的写法 probatum est（“已被证明/已验证”）。现代英语更常直接用 proven、tested、tried-and-true。"]}
{"word":"probe","summary":{"en":"Probe means a careful investigation or questioning, and also a device used to explore or measure; as a verb, it means to investigate deeply.","zh":"Probe 既可指深入的调查/追问，也可指用于探测或检查的探针/探测器；作动词表示深入调查、探究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An act of carefully investigating or asking questions to discover the truth or get more information.","zh":"（为找出真相或获取更多信息而进行的）调查、探查、追问。"},"examples":[{"en":"The police launched a probe into the missing funds.","zh":"警方对失踪资金展开了调查。"},{"en":"A committee is conducting a probe into the accident.","zh":"委员会正在对这起事故进行调查。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device used to explore, examine, or measure something, especially in medicine, engineering, or space exploration.","zh":"（用于探测、检查或测量的）探针、探测器（尤用于医学、工程或太空探索）。"},"examples":[{"en":"The doctor used a probe to examine the wound.","zh":"医生用探针检查伤口。"},{"en":"The space probe sent back images of the planet.","zh":"太空探测器传回了这颗行星的图像。"}]},{"partOfSpeech":"v.","definition":{"en":"To investigate something carefully, often by asking questions or searching for hidden information.","zh":"调查；探查；追问（常指通过提问或寻找隐藏信息来弄清情况）。"},"examples":[{"en":"Reporters probed the company about its safety record.","zh":"记者就该公司的安全记录向其追问。"},{"en":"She probed deeper to understand what really happened.","zh":"她进一步探究，想弄清到底发生了什么。"}]}],"synonyms":["investigation","inquiry","examination","exploration","inspect","question"],"phonetic":"/proʊb/","extraExplanation":["“probe”在新闻语境里很常见，尤其指官方或机构的调查：a probe into corruption（对腐败的调查）。语气通常比“check”更正式、更深入。","词源来自拉丁语“probare”（测试、证明），所以它既能表示“探测/测试”（工具或设备），也能表示“调查/追查”（行为）。","搭配小提示：launch/open an investigation/probe（发起调查）；probe into + 名词（调查某事）；probe + 人 + about + 话题（追问某人某事）。"]}
{"word":"probeable","summary":{"en":"Probeable means “able to be probed/examined,” including by medical tools, questioning, or computer/network scanning.","zh":"Probeable 指“可被探查/检查的”，也可用于计算机与网络场景中表示“可被探测/扫描的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be probed, examined, or tested (often by asking questions, using tools, or doing experiments)","zh":"可被探查的；可被检查/测试的（常指通过提问、工具或实验来了解）"},"examples":[{"en":"The doctor said the lump was probeable, so they could examine it more carefully.","zh":"医生说这个肿块是可探查的，所以可以更仔细地检查。"},{"en":"Some areas of the cave are probeable with a long stick, but others are too deep.","zh":"洞穴里有些地方可以用长棍探一探，但有些太深了。"}]},{"partOfSpeech":"adj.","definition":{"en":"in computing/security: able to be scanned or checked by an automated probe (a program that tests systems or networks)","zh":"（计算机/安全）可被探测/扫描的（指可被自动化“探针”程序检查的系统或网络）"},"examples":[{"en":"They found several probeable ports on the server during the audit.","zh":"在审计中，他们发现服务器上有几个可被探测的端口。"},{"en":"Make sure your device isn’t easily probeable from the public internet.","zh":"要确保你的设备不容易被公共互联网探测到。"}]}],"synonyms":["examinable","testable","inspectable","explorable","scannable"],"phonetic":"ˈproʊbəbl̩","extraExplanation":["“probeable”由动词 probe（探查、探测）+ 形容词后缀 -able（能够…的）构成，意思直观：‘能够被probe的’。","在日常英语里更常见的写法是 **probable**（很可能的）与 **probe-able / probeable** 容易拼写混淆；两者含义完全不同。"]}
{"word":"probed","summary":{"en":"“Probed” means “examined or investigated carefully,” and it is the past tense/past participle of “probe.”","zh":"“probed”表示“仔细调查/探查”，是“probe”的过去式和过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “probe”: to examine something carefully by asking questions or looking closely, often to discover hidden facts or the cause of a problem.","zh":"“probe”的过去式和过去分词：仔细调查或盘问，常为发现隐藏事实或找出问题原因。"},"examples":[{"en":"The reporter probed the company’s finances for signs of fraud.","zh":"记者深入调查了公司的财务状况，寻找欺诈迹象。"},{"en":"The doctor probed the painful area gently to see what hurt.","zh":"医生轻轻检查疼痛部位，看看哪里出了问题。"},{"en":"Police probed the timeline and interviewed witnesses again.","zh":"警方调查了时间线，并再次询问了目击者。"}]}],"synonyms":["investigated","examined","questioned","explored","looked into"],"phonetic":"/proʊbd/","extraExplanation":["“probe”常带有“更深一层、带目的地挖掘信息”的语气，比“ask”更像“追问/探查”。在新闻语境里常见于“probe allegations（调查指控）”。","名词“probe”还可以指“探测器/探针”（如 space probe 航天探测器），动词则可表示“用探针探查（身体/设备内部）”。"]}
{"word":"probeer","summary":{"en":"“probeer” is Dutch/Afrikaans for “try/attempt,” not a standard English word.","zh":"“probeer”是荷兰语/南非语里表示“尝试/试试看”的词，不是标准英语单词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Not standard English) A Dutch/Afrikaans verb meaning “to try” or “to attempt.” In English, you would usually say “try.”","zh":"（非标准英语）荷兰语/南非语动词，意思是“尝试；试试看”。英语里通常用“try”。"},"examples":[{"en":"Dutch: Ik probeer Nederlands te leren. / English: I’m trying to learn Dutch.","zh":"荷兰语：Ik probeer Nederlands te leren. / 英语：我正在尝试学荷兰语。"},{"en":"Afrikaans: Ek sal dit probeer. / English: I’ll try it.","zh":"南非语：Ek sal dit probeer. / 英语：我会试试看。"}]}],"synonyms":["try","attempt","give it a try"],"phonetic":"/proʊˈbɪr/","extraExplanation":["“probeer”常见于荷兰语（正确写法通常是“proberen”，第一人称/现在时可用“ik probeer”）以及南非语（“probeer”）。如果你是在英文语境里看到“probeer”，多半是他人夹用母语或在做语言学习练习。"]}
{"word":"probenecid","summary":{"en":"Probenecid is a drug used mainly for gout to help the body excrete uric acid, and it can also raise blood levels of some antibiotics.","zh":"Probenecid（丙磺舒）主要用于痛风，通过促进尿酸排出；也可用于提高某些抗生素的血药浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine used mainly to treat gout by helping the kidneys remove uric acid (and sometimes used to increase the levels of certain antibiotics in the blood).","zh":"（一种药物）主要用于治疗痛风，通过帮助肾脏排出尿酸（有时也用于提高某些抗生素在血液中的浓度）。"},"examples":[{"en":"My doctor prescribed probenecid to help lower my uric acid.","zh":"医生给我开了丙磺舒，帮助降低尿酸。"},{"en":"Probenecid is sometimes taken with certain antibiotics to keep them in the body longer.","zh":"丙磺舒有时会和某些抗生素一起服用，让药物在体内停留更久。"}]}],"synonyms":["Benemid (brand name)"],"phonetic":"/proʊˈbɛnəˌsɪd/","extraExplanation":["“Probenecid”是药名（通用名），中文常译为“丙磺舒”。属于“促尿酸排泄药（uricosuric agent）”，通过减少肾小管对尿酸的重吸收来帮助排酸，因此常用于慢性高尿酸血症/痛风的长期管理（不是急性痛风发作时的首选止痛药）。","它会影响肾脏对多种药物的排泄，可能与青霉素类等抗生素、某些抗病毒药等发生相互作用；是否能合用、剂量如何调整应由医生决定。","用药期间通常会建议多喝水、按医嘱监测尿酸与肾功能；有肾结石史或肾功能不全者需要特别谨慎。"]}
{"word":"probenicid","summary":{"en":"Probenecid is a drug mainly used to help remove uric acid to prevent gout, and it can also be used to boost certain antibiotics.","zh":"Probenecid（丙磺舒）主要用于促进尿酸排出以预防痛风，也可用于提高某些抗生素在体内的药效浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine used to help the body remove uric acid (often to prevent gout attacks) and sometimes used with certain antibiotics to keep them in the blood longer.","zh":"一种药物，可帮助身体排出尿酸（常用于预防痛风发作），也有时与某些抗生素合用以延长其在血液中的作用时间。"},"examples":[{"en":"My doctor prescribed probenecid to help prevent gout flare-ups.","zh":"医生给我开了丙磺舒（probenecid）来帮助预防痛风复发。"},{"en":"In some cases, probenecid is used with antibiotics to increase their levels in the body.","zh":"在某些情况下，丙磺舒会与抗生素合用，以提高药物在体内的浓度。"}]}],"synonyms":["Benemid","uricosuric agent"],"phonetic":"/proʊˈbɛnɪsɪd/","extraExplanation":["发音与拼写提示：probenecid 常见重音在第二音节（pro-BEN-ih-sid）。","用药背景（学习理解用）：它属于“促尿酸排泄药（uricosuric agent）”，通过影响肾脏对尿酸的处理来降低血尿酸；是否适合需要医生根据肾功能、结石史、用药相互作用等评估。"]}
{"word":"prober","summary":{"en":"“Prober” usually means a person who investigates by probing questions, and it can also mean a probing device or tool.","zh":"“Prober”通常指通过追问来调查的人，也可指用于探测/探查的工具或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who probes; someone who investigates or asks questions to find out the truth","zh":"探查者；调查者；追问真相的人"},"examples":[{"en":"The journalist was a relentless prober who kept asking for evidence.","zh":"这位记者是个不懈的追问者，不断要求提供证据。"},{"en":"As a prober, she looks beyond the first answer and asks follow-up questions.","zh":"作为调查者，她不会满足于第一个答案，而是会继续追问。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or device used to probe (to test, measure, or examine something by touching or inserting)","zh":"探针；探测器（用于探查、测量或检查的工具/装置）"},"examples":[{"en":"The technician used an electrical prober to check the circuit.","zh":"技术员用电路探针检查电路。"},{"en":"A temperature prober can measure heat inside the food.","zh":"温度探针可以测量食物内部的温度。"}]}],"synonyms":["investigator","inquirer","questioner","probe","sensor","tester"],"phonetic":"/ˈproʊbər/","extraExplanation":["“prober”由动词“probe（探查、探测、追问）”加上表示“……的人/物”的后缀“-er”构成，因此既可以指“做探查的人”，也可以指“用来探查的工具”。在新闻、审讯、研究等语境里更常指“追问调查的人”；在工程、医疗、电子等语境里常指“探针/探测器”。"]}
{"word":"probers","summary":{"en":"“Probers” is the plural of “prober”: people who investigate deeply, or tools used to probe/test.","zh":"“Probers”是“prober”的复数：可指深入调查的人，也可指用于探测/测试的探针或探测器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who probes—someone who investigates carefully by asking questions or examining details.","zh":"探查者；调查者——指通过提问或仔细检查细节来深入调查的人。"},"examples":[{"en":"Journalists are often probers who keep asking until they find the truth.","zh":"记者常常是探查者，他们不断追问直到找到真相。"},{"en":"The committee hired independent probers to look into the claims.","zh":"委员会雇用了独立调查人员来核查这些说法。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools or devices used to probe, test, or examine something (especially in science, medicine, or engineering).","zh":"探针；探测器——用于探查、测试或检查的工具或装置（尤用于科学、医学或工程领域）。"},"examples":[{"en":"The lab used metal probers to test the material’s thickness.","zh":"实验室用金属探针测量材料的厚度。"},{"en":"Doctors sometimes use thin probers to examine a wound carefully.","zh":"医生有时会用细小的探针仔细检查伤口。"}]}],"synonyms":["investigators","inquirers","examiners","probes","testers"],"phonetic":"/ˈproʊbɚ/","extraExplanation":["“prober”来自动词“probe”（探查、探测）。其词源可追溯到拉丁语“probare”，有“测试、证明”的意思，所以“probe/prober”常带有“为了弄清真相而深入检查”的语感。","日常英语里，指“人”时更常用“investigator / researcher / examiner”等；“prober(s)”更偏正式，或用于强调“不断追问、深入挖掘”的风格。"]}
{"word":"probes","summary":{"en":"“Probes” is usually the plural noun meaning investigations or devices for examining; it can also be the verb form meaning to question or examine closely.","zh":"“probes”通常是复数名词，指“调查/探查”或“探针/探测装置”；也可作动词形式，表示“追问、仔细探究”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of probe) A careful investigation or test to find out the truth or discover information.","zh":"（probe 的复数）为查明真相或获取信息而进行的调查、探查或测试。"},"examples":[{"en":"Police launched probes into the financial records.","zh":"警方对财务记录展开了调查。"},{"en":"Scientists ran several probes to check the water quality.","zh":"科学家做了多项测试来检查水质。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools, devices, or instruments used to explore, measure, or examine something (for example, in medicine, science, or space).","zh":"用于探测、测量或检查的工具/装置（如医学、科学或航天领域）。"},"examples":[{"en":"The technician inserted probes to measure the temperature inside the machine.","zh":"技术员放入探针来测量机器内部温度。"},{"en":"Space probes send pictures back to Earth.","zh":"太空探测器把照片传回地球。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb form) Searches for information by asking questions or examining something closely.","zh":"（动词形式）通过提问或仔细检查来探究、追问。"},"examples":[{"en":"The reporter probed for more details during the interview.","zh":"记者在采访中追问更多细节。"},{"en":"Doctors probed the cause of his pain.","zh":"医生探查他疼痛的原因。"}]}],"synonyms":["investigations","inquiries","examinations","tests","devices","sensors","explores","questions"],"phonetic":"/proʊbz/","extraExplanation":["“probe”作名词时很常见于新闻语境：a probe into… 表示“对……的调查/审查”。如：a probe into corruption（反腐调查）。","作动词时，“probe”常带有“深入追问、刨根问底”的语气，比 ask 更强调“探究到更深层”。在正式写作中很常用。","词源上来自拉丁语 probe（意为“测试、检验”），所以在科学、医学、工程里也常指“探针/探头/探测器”。"]}
{"word":"probetting","summary":{"en":"“Probetting” usually means “pro betting”: professional/expert sports betting (informal).","zh":"“probetting”通常指“pro betting”：职业/专业体育投注（非正式用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Professional or expert sports betting, often implying systematic strategies and long-term profit goals.","zh":"（非正式）职业/专业体育投注，常暗示使用系统策略、以长期盈利为目标。"},"examples":[{"en":"He makes his living from pro betting during the football season.","zh":"他在橄榄球赛季靠职业投注谋生。"},{"en":"Pro betting usually involves careful bankroll management, not just luck.","zh":"职业投注通常需要谨慎的资金管理，而不只是运气。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) Betting heavily or confidently “like a pro.”","zh":"（非正式）像高手一样自信或大额下注。"},"examples":[{"en":"She’s pro betting on the final match, but it’s still a risky pick.","zh":"她在决赛上下注很“专业/很猛”，但这仍然是个高风险选择。"}]}],"synonyms":["pro betting","professional sports betting","sharp betting","expert betting"],"phonetic":"ˌproʊ ˈbɛtɪŋ","extraExplanation":["“probetting”更常见的写法是分开写作“pro betting”。它不是特别标准的词典词，更像口语/网络用语。","在体育博彩语境里，pro betting有时带一点“sharp（精明/懂行）”的意味；不过在很多国家和地区，博彩有严格法律限制，使用时注意场合与合规。","如果你原本想写的是“probating”（办理遗嘱认证）或“probing”（探查/探究），告诉我句子语境，我可以帮你确认。"]}
{"word":"probing","summary":{"en":"“Probing” describes careful, searching questions, looks, or analysis meant to discover the truth; it can also mean a close investigation.","zh":"“probing”指为了弄清真相而进行的深入提问、审视或分析；也可指深入调查这一行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"trying to find out the truth by asking careful, often detailed questions; searching and investigative","zh":"（通过细致、深入的提问）试图弄清真相的；探究性的；追根究底的"},"examples":[{"en":"The interviewer asked probing questions about the company’s finances.","zh":"采访者就公司的财务状况提出了追问式的深入问题。"},{"en":"She gave him a probing look, as if she could tell he was hiding something.","zh":"她用探究的目光看着他，仿佛看出他在隐瞒什么。"},{"en":"The report offers a probing analysis of the causes of inflation.","zh":"这份报告对通货膨胀的原因做了深入探究的分析。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of examining or investigating something closely (often by asking questions or checking carefully)","zh":"（常指通过提问或仔细检查进行的）深入调查；探查"},"examples":[{"en":"After some probing, the truth finally came out.","zh":"经过一番追问和查证，真相终于浮出水面。"},{"en":"The committee’s probing into the incident lasted for weeks.","zh":"委员会对该事件的调查持续了数周。"}]}],"synonyms":["inquisitive","searching","investigative","penetrating","thorough","pointed"],"phonetic":"/ˈproʊbɪŋ/","extraExplanation":["“probing”来自动词“probe”（探测/探查）。在新闻采访、法庭质询、学术研究里很常见，强调问题或观察“有深度”，不是随口问问。","在医疗语境中也会出现，比如“probing pain”（刺探般/深入的疼痛感，或检查时的探查动作）。但日常英语里更常见的是“probing questions / probing look / probing analysis”。"]}
{"word":"probings","summary":{"en":"“Probings” means careful investigations or searching questions meant to discover information.","zh":"“probings”指为获取信息而进行的深入调查或带试探性的追问。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"careful attempts to find out the truth about something; investigations, especially into a difficult or sensitive matter","zh":"（对难题或敏感问题的）探查；调查；试探性了解"},"examples":[{"en":"The journalist’s probings uncovered serious problems in the local government.","zh":"这位记者的深入探查揭露了地方政府的严重问题。"},{"en":"After the accident, the safety team began probings into what went wrong.","zh":"事故发生后，安全小组开始调查哪里出了问题。"}]},{"partOfSpeech":"n.","definition":{"en":"acts of examining or asking questions in a searching way (the -ing form of “probe”), often to learn someone’s thoughts, feelings, or hidden details","zh":"（probe 的 -ing 形式）追问；探究；探查（多指通过追问或细查去了解想法、感受或隐情）"},"examples":[{"en":"Her probings made him uncomfortable, so he changed the subject.","zh":"她的追问让他不舒服，于是他换了话题。"},{"en":"The doctor’s probings helped identify the source of the pain.","zh":"医生的检查性探查帮助确定了疼痛来源。"}]}],"synonyms":["investigations","inquiries","examinations","scrutiny","questioning","exploration"],"phonetic":"/ˈproʊbɪŋz/","extraExplanation":["“probings”常带有“深入、试探性、带点追问”的语气。用于人际场景时，可能暗示问题问得比较私密或尖锐（例如记者、警察、心理咨询等）。","词根 probe 原指“用探针探测”，后来引申为“调查、追问、探究”。因此在新闻和正式语境中很常见，如 probings into corruption（对腐败的调查）。"]}
{"word":"probiology","summary":{"en":"“Probiology” is not a standard dictionary word; it’s usually a marketing/brand term meaning probiotic science or a probiotic product.","zh":"“probiology”不是常见规范词，多用于营销/品牌语境，通常指益生菌相关科学或某种益生菌产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or marketing term, usually used to mean “probiotic biology” (the science of beneficial microbes, especially those used as probiotics) or the study/use of probiotics.","zh":"一个不太规范、常见于营销或品牌语境的词，通常指“益生菌的生物学/益生菌相关科学”（研究有益微生物，尤其是作为益生菌使用的微生物）或益生菌的研究与应用。"},"examples":[{"en":"The company uses “probiology” to describe research on probiotic strains and how they affect gut health.","zh":"这家公司用“probiology”来描述对益生菌菌株及其对肠道健康影响的研究。"},{"en":"I couldn’t find “probiology” in most dictionaries; it seems to be a branded way to say probiotic science.","zh":"我在大多数词典里找不到“probiology”；它看起来像是一种品牌化的说法，用来表示“益生菌科学”。"}]},{"partOfSpeech":"other","definition":{"en":"A brand or product name related to probiotics (capitalized in many real-life uses: Probiology).","zh":"与益生菌相关的品牌名或产品名（现实中常写作大写：Probiology）。"},"examples":[{"en":"Ask your pharmacist if Probiology is suitable for you.","zh":"你可以问药师 Probiology 是否适合你。"},{"en":"She switched to a different probiotic because Probiology was out of stock.","zh":"因为 Probiology 缺货，她换了另一种益生菌产品。"}]}],"synonyms":["probiotics","probiotic science","microbiology","gut microbiome"],"phonetic":"/ˌproʊbaɪˈɑlədʒi/","extraExplanation":["“probiology”在标准英语里并不是一个常见、固定的词条，因此在写作或考试中不建议使用。更常见、更规范的表达是：probiotics（益生菌，名词复数）、probiotic（益生菌的，形容词）、microbiology（微生物学）、gut microbiome（肠道微生物组）。","如果你是在包装、广告或某篇文章里看到该词，它很可能是“probiotic + biology”的混合造词，或者直接是产品/品牌名。最好结合上下文判断其具体指代。"]}
{"word":"probiotic","summary":{"en":"A probiotic is a live “beneficial” microorganism in foods or supplements, often used to support digestion and gut balance; it can also describe products that contain these microbes.","zh":"probiotic 指含有活的“有益”微生物的食物或补充剂，常用于支持消化与肠道菌群平衡；也可作形容词表示“含益生菌的/与益生菌相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a food or supplement that contains live “good” microorganisms (often bacteria) believed to support digestive health and balance the gut microbiome","zh":"含有活的“有益”微生物（常见为细菌）的食物或补充剂，被认为有助于消化健康并维持肠道菌群平衡"},"examples":[{"en":"Yogurt with live cultures is a common probiotic food.","zh":"含活性菌的酸奶是一种常见的益生菌食物。"},{"en":"My doctor suggested a probiotic after I finished antibiotics.","zh":"我用完抗生素后，医生建议我补充益生菌。"},{"en":"This probiotic is marketed for gut health, but results can vary by person.","zh":"这种益生菌主打肠道健康，但效果因人而异。"}]},{"partOfSpeech":"adj.","definition":{"en":"containing or relating to probiotics (live beneficial microorganisms)","zh":"含有益生菌的；与益生菌（活的有益微生物）相关的"},"examples":[{"en":"Some brands sell probiotic drinks and probiotic capsules.","zh":"有些品牌出售益生菌饮料和益生菌胶囊。"},{"en":"Look for “probiotic” on the label if you want products with live cultures.","zh":"如果你想要含活性菌的产品，可以在标签上找“probiotic（益生菌的）”。"}]}],"synonyms":["beneficial bacteria","live cultures","gut-friendly supplement"],"phonetic":"/ˌproʊbaɪˈɑtɪk/","extraExplanation":["“pro-”表示“有利于/支持”，“-biotic”与“生命”有关（同源于bio-）。所以probiotic字面意思接近“有利于生命的”。","学习对比：prebiotic（益生元）不是细菌本身，而是“喂养益生菌的食物/成分”（常见为膳食纤维）。很多产品会写“synbiotic（合生元）”，指益生菌+益生元的组合。"]}
{"word":"probiotics","summary":{"en":"Probiotics are live “good” microorganisms used to help maintain a healthy microbial balance, especially in the gut.","zh":"Probiotics（益生菌）是用于帮助维持体内、尤其肠道微生物平衡的活性有益微生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Live microorganisms (often bacteria or yeast) that may support a healthy balance of microbes in your body, especially in the digestive system; commonly found in supplements and fermented foods.","zh":"益生菌：指活的微生物（常见为细菌或酵母），可能帮助维持体内（尤其是肠道）微生物的健康平衡；常见于营养补充剂和发酵食品中。"},"examples":[{"en":"Some people take probiotics to support digestion after antibiotics.","zh":"有些人会在使用抗生素后补充益生菌来帮助消化。"},{"en":"Yogurt, kefir, and kimchi are foods that may contain probiotics.","zh":"酸奶、开菲尔和泡菜等食物可能含有益生菌。"},{"en":"Ask a doctor which probiotics are suitable if you have a health condition.","zh":"如果你有健康问题，最好咨询医生哪种益生菌适合你。"}]}],"synonyms":["beneficial bacteria","friendly bacteria","live cultures"],"phonetic":"/ˌproʊbaɪˈɑːtɪks/","extraExplanation":["“Probiotics”通常以复数形式出现，因为它常指“一类/多种菌株”的组合（如 Lactobacillus、Bifidobacterium）。不同菌株作用可能不同，且并非对所有人都同样有效。","在日常英语里，probiotics 常与“gut health（肠道健康）”“microbiome（微生物群）”一起出现；与之相对的词是 prebiotics（益生元：给益生菌“当食物”的膳食纤维等）。"]}
{"word":"probit","summary":{"en":"A probit is a statistical unit that transforms a probability into a value on a normal-distribution scale, used especially in dose–response modeling.","zh":"Probit是把概率转换到正态分布尺度上的统计单位，尤其用于剂量—反应建模。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a statistical unit used in probit analysis to express a probability as a value on a normal (bell-curve) scale, often used to analyze dose–response relationships (e.g., in biology or medicine).","zh":"统计学中的“概率单位”，用于概率单位回归（probit analysis）把概率转换到正态分布（钟形曲线）尺度上，常用于分析剂量—反应关系（如生物学、医学）。"},"examples":[{"en":"The researchers used probit analysis to estimate the dose that kills 50% of the insects.","zh":"研究人员使用概率单位回归来估计能杀死50%昆虫的剂量。"},{"en":"In the model, the response was converted to probit units before fitting the curve.","zh":"在建模前，研究者先把反应率转换为probit单位再拟合曲线。"}]}],"synonyms":["probit unit","probability unit","(related) z-score"],"phonetic":"/ˈproʊbɪt/","extraExplanation":["“Probit”一词来自“probability unit（概率单位）”的缩写，常见于毒理学、生物测定（bioassay）与流行病学等领域。","在许多教材里，probit可理解为“把百分比/概率映射到正态分布的z值（有时再做平移/缩放）”，从而让S形的剂量—反应曲线更容易用线性方法建模。"]}
{"word":"probities","summary":{"en":"Probity means strong honesty and moral integrity; probities (plural) can refer to standards or acts of proper, ethical conduct.","zh":"Probity 指“正直、清廉、诚实的品格”；probities（复数）可指“多项廉洁准则或正当行为”，多用于正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being honest and having strong moral principles; integrity","zh":"正直；清廉；诚实（高尚的品德与操守）"},"examples":[{"en":"Everyone trusted her because of her probity.","zh":"大家都信任她，因为她为人正直。"},{"en":"The judge was known for his probity and fairness.","zh":"那位法官以清廉和公正著称。"},{"en":"We need leaders with probity in public office.","zh":"我们需要在公职领域清廉正直的领导者。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: probities) acts or standards of honesty and proper conduct, especially in official or business settings","zh":"（复数：probities）正直的行为/准则（尤指在公务或商业场合的廉洁规范）"},"examples":[{"en":"The report criticized the probities of the procurement process.","zh":"报告批评了采购流程中的廉洁规范问题。"},{"en":"They debated the probities of accepting gifts from suppliers.","zh":"他们讨论接受供应商礼物是否合乎廉洁准则。"}]}],"synonyms":["integrity","honesty","uprightness","rectitude","incorruptibility"],"phonetic":"/ˈproʊbəti/","extraExplanation":["“Probity”更常用作不可数名词（the probity of…），强调“清廉、正直”这一品质；“probities”作为复数较少见，通常出现在较正式的语境里，指多项“廉洁规范/正当性要求”。","词源来自拉丁语 *probitas*（善良、正直），与形容词“probable（很可能的）”同源，都与“证明/可信”这一概念相关。"]}
{"word":"probits","summary":{"en":"“Probits” are statistical values on a probit scale used to represent probabilities, especially in dose–response analysis.","zh":"“Probits”指统计学中的 probit 尺度数值，用于表示概率，尤其常用于剂量—反应分析。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit on the probit scale used in statistics to express probabilities (often in dose–response studies), where values come from converting a probability through the inverse of the normal cumulative distribution function","zh":"（统计学）probit 尺度上的数值单位，用来表示概率（常见于剂量—反应研究）；通常把概率通过“正态分布累积分布函数的反函数”转换后得到"},"examples":[{"en":"In toxicology, researchers often convert response rates into probits to fit a straight-line dose–response model.","zh":"在毒理学中，研究者常把反应率转换成 probits，以便拟合线性的剂量—反应模型。"},{"en":"A probit of 5 corresponds to about a 50% probability on the standard probit scale.","zh":"在常用的 probit 尺度上，probit 为 5 大约对应 50% 的概率。"},{"en":"The table lists probits for each concentration level tested.","zh":"该表列出了每个测试浓度水平对应的 probits 值。"}]}],"synonyms":["probit units","probit values","(context) z-scores (related)"],"phonetic":"/ˈproʊbɪts/","extraExplanation":["“probit”来自“probability unit（概率单位）”的缩写，常见于生物测定（bioassay）、毒理学、流行病学等领域。","在很多教材/软件里会用“probit = 5 + z”的约定（z 为标准正态分布的分位数），因此 50% 对应 5。不同来源可能在尺度平移上有约定差异，读文献时最好确认所用定义。","“probits”是复数形式，表示多个 probit 值；单数是“probit”。"]}
{"word":"probituminous","summary":{"en":"Probituminous means “not yet bituminous,” used in geology for an early stage of coal maturation.","zh":"probituminous 指“尚未成为烟煤的”，多用于地质学描述煤成熟过程的早期阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Not yet bituminous; describing coal or organic-rich rock that has not matured into bituminous coal.","zh":"（地质）未达烟煤阶段的；指尚未成熟为烟煤的煤或富有机质岩石。"},"examples":[{"en":"The sample is probituminous coal, so it contains less energy than bituminous coal.","zh":"该样品为前烟煤（probituminous）煤，因此能量含量低于烟煤。"},{"en":"Researchers compared lignite, probituminous material, and bituminous coal to track coal maturation.","zh":"研究人员比较了褐煤、前烟煤物质与烟煤，以追踪煤的成熟过程。"}]}],"synonyms":["pre-bituminous","nonbituminous","sub-bituminous (often related, not always identical)"],"phonetic":"/ˌproʊbɪˈtuːmənəs/","extraExplanation":["“pro-”有“在……之前/早于”的含义，因此 probituminous 常用于地质与煤化作用语境，表示“尚未达到烟煤（bituminous coal）等级”的阶段。","煤的常见等级（由低到高）可粗略理解为：泥炭（peat）→ 褐煤（lignite）→（介于其间的）前烟煤/次烟煤阶段（不同资料术语可能略有差异）→ 烟煤（bituminous）→ 无烟煤（anthracite）。","该词较少出现在日常英语中，多见于学术论文、地质报告或矿业资料。"]}
{"word":"probity","summary":{"en":"Probity means strong honesty and integrity, often used in formal contexts like public service or business ethics.","zh":"Probity 指高度的诚实与正直，常见于公共事务或商业伦理等较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong honesty and moral principles; integrity (especially in someone’s character or behavior)","zh":"正直；廉洁；品行端正（强调人格或行为上的诚实与道德操守）"},"examples":[{"en":"She was respected for her probity in both public service and private life.","zh":"她在公共服务和私人生活中都以正直著称。"},{"en":"The company promised transparency and probity in its accounting practices.","zh":"公司承诺在会计做法上保持透明与廉洁。"},{"en":"In the novel, the judge’s probity sets him apart from the corrupt officials around him.","zh":"在小说中，这位法官的正直使他与周围腐败的官员形成鲜明对比。"}]}],"synonyms":["integrity","honesty","uprightness","rectitude","incorruptibility"],"phonetic":"/ˈproʊbəti/","extraExplanation":["“probity”常用于较正式的语境，尤其是谈论官员、法官、公司治理、财务与公共事务时，强调“清廉、守正、不贪腐”的品格。日常口语里更常用“honesty / integrity”。","词源来自拉丁语“probitas（善良、正直）”，与“prob（诚实的）”同源。"]}
{"word":"problem","summary":{"en":"“Problem” usually means something difficult that needs a solution; it can also mean a school question, and less commonly it can be a verb meaning “bother.”","zh":"“problem”通常指需要解决的困难/问题；也可指学校里的题目；较少见作动词，表示“困扰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A difficult situation, question, or task that needs to be solved or dealt with.","zh":"需要解决或处理的困难情况、问题或任务。"},"examples":[{"en":"We have a serious problem with the internet connection.","zh":"我们的网络连接出了严重问题。"},{"en":"This math problem is hard, but I’ll try again.","zh":"这道数学题很难，但我会再试一次。"}]},{"partOfSpeech":"n.","definition":{"en":"A question in school (especially math or science) that you must answer by thinking and using methods.","zh":"（尤指数学或科学）需要思考并用方法解答的题目。"},"examples":[{"en":"Solve problems 1–10 for homework.","zh":"家庭作业：解第1到第10题。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause trouble or worry for someone; to bother.","zh":"给某人带来麻烦或担忧；困扰。"},"examples":[{"en":"It doesn’t really problem me if you’re a little late.","zh":"你稍微迟到一点其实不怎么困扰我。"}]}],"synonyms":["issue","trouble","difficulty","challenge","concern"],"phonetic":"/ˈprɑbləm/","extraExplanation":["“problem”最常见是名词，表示“需要解决的难题/麻烦”。作动词时在现代英语里相对少见，更常用的是“bother / trouble / worry”。比如很多人会说：It doesn’t bother me. 而不是 It doesn’t problem me。","常见搭配：have a problem（有问题/遇到麻烦）, solve a problem（解决问题）, a serious/big problem（严重/大问题）, problem with...（……有问题）。"]}
{"word":"problematic","summary":{"en":"Problematic means ‘causing or likely to cause problems,’ ‘hard to handle,’ or ‘possibly inappropriate and open to criticism.’","zh":"problematic 指“会或可能引发问题的、棘手的”，也可指“可能不妥、易受批评的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing problems or likely to cause trouble, difficulty, or disagreement.","zh":"引发问题的；可能带来麻烦、困难或争议的。"},"examples":[{"en":"This plan sounds good, but it could be problematic in a real emergency.","zh":"这个计划听起来不错，但在真正的紧急情况下可能会出问题。"},{"en":"It’s problematic to rely on one person for all the work.","zh":"把所有工作都依赖一个人是很容易出问题的。"},{"en":"Some words are problematic because they can sound rude in certain cultures.","zh":"有些词在某些文化中可能听起来不礼貌，因此会引发问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Difficult to deal with; complicated or tricky.","zh":"棘手的；难处理的；复杂的。"},"examples":[{"en":"Parking downtown is always problematic.","zh":"在市中心停车总是很棘手。"},{"en":"He gave a problematic answer that raised more questions than it solved.","zh":"他的回答很棘手，提出的问题比解决的还多。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not ideal or not socially acceptable; likely to be criticized.","zh":"不太妥当的；可能引发批评的（多用于观念、行为、言论等）。"},"examples":[{"en":"The ad was criticized for a problematic stereotype.","zh":"这则广告因带有有问题的刻板印象而受到批评。"},{"en":"It’s problematic to joke about serious topics in a work meeting.","zh":"在工作会议上拿严肃话题开玩笑不太妥当。"}]}],"synonyms":["troublesome","difficult","complicated","risky","questionable","thorny"],"phonetic":"/ˌprɑːbləˈmætɪk/","extraExplanation":["“problematic”比“bad”更委婉、更书面，常用来表示“可能造成麻烦/存在隐患”，而不一定是已经出错。","常见搭配：problematic situation/relationship/behavior/comment（有问题的情况/关系/行为/言论）；It is problematic to + V（做某事不妥/有风险）。","语气提示：在讨论文化、偏见或不当表达时，“problematic”常表示“可能冒犯/不合时宜”，用于较谨慎的批评。"]}
{"word":"problematical","summary":{"en":"Problematical means uncertain, doubtful, or difficult to deal with (often in formal style).","zh":"Problematical 指“有问题的/成问题的”：不确定、可疑或难以处理（多见于较正式语体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a situation, statement, or plan) hard to deal with, doubtful, or likely to cause disagreement; problematic.","zh":"（情况、说法或计划）棘手的；可疑的；可能引发争议的；有问题的。"},"examples":[{"en":"It’s problematical whether the new policy will actually reduce costs.","zh":"新政策是否真的能降低成本还很成问题。"},{"en":"His explanation sounded problematical to the committee.","zh":"他的解释在委员会听来很可疑。"}]}],"synonyms":["problematic","questionable","doubtful","uncertain","troublesome"],"phonetic":"/ˌprɑːbləˈmætɪkəl/","extraExplanation":["“problematical”与“problematic”意思非常接近，但在现代英语里更常用的是“problematic”。“problematical”常见于较正式、较旧式或英式风格的写作中，用来表达“是否成立仍不确定/值得怀疑”。","常见搭配：it is problematical whether…（是否……仍有疑问）；a problematical claim/plan（有争议或难以落实的说法/计划）。"]}
{"word":"problematically","summary":{"en":"Problematically means “in a way that causes problems or is controversial/ethically concerning.”","zh":"problematically 表示“以会引起问题的方式；或以具争议/在道德上令人担忧的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that causes problems or is likely to cause trouble; not in a smooth or acceptable way.","zh":"以会引起问题的方式；麻烦地、不顺利地（常表示做法或情况令人担忧）。"},"examples":[{"en":"The policy is problematically vague, so different teams interpret it differently.","zh":"这项政策麻烦在于太含糊，所以不同团队会有不同解读。"},{"en":"Problematic stereotypes are sometimes repeated uncritically in movies.","zh":"电影里有时会不加批判地重复一些有问题的刻板印象。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is hard to explain, controversial, or ethically concerning.","zh":"以难以自圆其说、具争议或在道德上令人担忧的方式（常用于评价观点、言论、描写）。"},"examples":[{"en":"He problematically frames the issue as ‘us versus them.’","zh":"他以一种有问题的方式把议题框成“我们对他们”。"},{"en":"The article problematically ignores the voices of the people most affected.","zh":"这篇文章以一种有问题的方式忽视了最受影响人群的声音。"}]}],"synonyms":["troublingly","contentiously","questionably","controversially"],"phonetic":"/ˌprɑːbləˈmætɪkli/","extraExplanation":["“problematically”通常用来评价“表达方式/立场/做法”本身有隐患或会带来负面后果，语气比 simply “badly” 更偏向“有争议、值得警惕”。","常见搭配：problematically vague（含糊得成问题）、problematically narrow（狭隘得成问题）、problematically assumes…（以有问题的方式假设…）、problematically suggests…（以有问题的方式暗示…）。","词形关系：problem（问题）→ problematic（有问题的）→ problematically（以有问题的方式）。"]}
{"word":"problematicness","summary":{"en":"Problematicness means the quality of being problematic—causing trouble, raising doubts, or being controversial.","zh":"problematicness 指“有问题的程度/性质”，即会带来麻烦、引发质疑或具有争议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being problematic (causing difficulties, doubts, or controversy)","zh":"“有问题”的性质；指会引起困难、疑虑或争议的特质"},"examples":[{"en":"The problematicness of the plan became clear when the costs doubled.","zh":"当成本翻倍时，这个计划的“问题性”就明显了。"},{"en":"She wrote about the problematicness of stereotypes in the media.","zh":"她写到了媒体中刻板印象的争议性（问题性）。"},{"en":"We discussed the problematicness of using that data without consent.","zh":"我们讨论了在未获同意的情况下使用那些数据的不妥与问题性。"}]}],"synonyms":["problematic nature","trouble","difficulty","riskiness","controversy","issues"],"phonetic":"/ˌprɑːbləˈmætɪknəs/","extraExplanation":["“problematicness”是由形容词“problematic”加名词后缀“-ness”构成的抽象名词，但在日常英语中不算常见，学术写作或批评性讨论中更可能出现。更自然的替换常见有：“the fact that it’s problematic / the problems with…”或名词“problematic nature”。","注意语气：在社会议题语境里，problematic常表示“可能冒犯/不合适/有偏见”，不一定是“技术上出错”。在一般语境里则更偏“棘手、难处理”。"]}
{"word":"problematist","summary":{"en":"A person who often raises problems or objections; in academic contexts, someone who critically “problematizes” ideas.","zh":"常提出问题或异议的人；在学术语境中指对概念进行“问题化”、揭示其隐含前提的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who habitually raises problems, objections, or difficult questions; someone who likes to challenge or complicate an issue.","zh":"喜欢提出问题、异议或棘手疑问的人；常常挑战或让议题变复杂的人。"},"examples":[{"en":"In every meeting, the problematist questioned our assumptions and asked for evidence.","zh":"在每次会议上，那位“问题提出者”都会质疑我们的假设并要求证据。"},{"en":"Some saw her as a problematist, but her critiques helped improve the plan.","zh":"有些人觉得她爱挑问题，但她的批评确实帮助改进了计划。"}]},{"partOfSpeech":"n.","definition":{"en":"(Academic use) Someone who “problematizes” a concept—showing its hidden assumptions, limits, or power relations.","zh":"（学术用法）将某个概念“问题化”的人——揭示其隐含前提、局限或权力关系。"},"examples":[{"en":"As a cultural critic, he is a problematist who examines how language shapes social norms.","zh":"作为文化评论者，他常把概念问题化，探讨语言如何塑造社会规范。"},{"en":"The author writes like a problematist, turning everyday ideas into questions.","zh":"作者的写法像在做“问题化”，把日常观念变成一连串问题。"}]}],"synonyms":["critic","skeptic","dissenter","questioner","contrarian"],"phonetic":"/prəˈblɛmətɪst/","extraExplanation":["“problematist”在日常英语里不算常见，更常见的是动词“problematize（使……问题化/提出问题）”以及名词“problematization（问题化过程）”。在学术语境中，它通常不是指“爱找茬”，而是指通过提出问题来揭露概念背后的假设与结构。","语气可能偏中性或略带负面，取决于语境：在团队合作里可能被理解为“老是挑毛病的人”，在研究与批评写作中则可能是“善于提出关键问题的人”。"]}
{"word":"problematize","summary":{"en":"Problematize means to question and analyze something as a problem (often in academic/critical discussion), or to make something unnecessarily complicated.","zh":"Problematize 指把某事“问题化”并加以质疑分析（常见于学术/批判讨论），也可指把事情弄复杂、制造不必要的问题。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To treat something as a problem to be questioned, analyzed, or challenged (often by pointing out hidden assumptions or power relations).","zh":"把某事“问题化”：将其视为值得质疑、分析或挑战的问题（常用于揭示隐藏的假设或权力关系）。"},"examples":[{"en":"The author problematizes the idea of “success” by showing how unfair the system can be.","zh":"作者通过展示制度的不公平，把“成功”的概念问题化。"},{"en":"In class, we problematized the news report and asked whose voices were missing.","zh":"在课堂上，我们把那篇新闻报道问题化，追问哪些声音被忽略了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something seem more complicated or difficult than it needs to be; to create unnecessary problems.","zh":"把事情弄复杂或制造不必要的麻烦。"},"examples":[{"en":"Don’t problematize the plan—just start with the first step.","zh":"别把计划问题化了——先从第一步开始。"},{"en":"Some people problematize simple decisions because they fear making mistakes.","zh":"有些人会把简单决定问题化，因为他们害怕犯错。"}]}],"synonyms":["question","challenge","interrogate","critique","complicate"],"phonetic":"/prəˈblɛm.əˌtaɪz/","extraExplanation":["这个词常见于人文社科写作（尤其是批判理论、社会学、教育学、文化研究）。它并不是单纯“发现问题”，而是强调：原本被当作理所当然的概念（例如“正常”“进步”“自由”）也需要被追问其前提、利益相关方与历史背景。","常见搭配：problematize the concept/assumption/idea of…（把……的概念/假设/想法问题化）；problematize notions of…（对……的观念提出质疑）。写作中语气偏学术。"]}
{"word":"problemdom","summary":{"en":"“Problemdom” means a situation or state full of problems, often said in a humorous, informal way.","zh":"“problemdom”指充满问题的处境或状态，常用于幽默、非正式表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or world of having many problems; a collection of problems (often used humorously or informally).","zh":"问题很多的状态；“问题的世界/领域”；一堆问题（常带幽默或口语色彩）。"},"examples":[{"en":"After the system update, we entered full problemdom—nothing worked the way it used to.","zh":"系统更新后，我们就进入了“问题王国”——很多东西都不像以前那样能用。"},{"en":"Moving apartments was fun at first, but soon it turned into problemdom: delays, missing boxes, and extra fees.","zh":"搬家一开始还挺有趣，但很快就变成了“问题一堆”：延期、箱子丢了、还多收费用。"}]}],"synonyms":["a world of problems","a mess","trouble","a problem-filled situation","a sticky situation"],"phonetic":"ˈprɑbləmˌdɑm","extraExplanation":["“problemdom”不是最常见的标准词，更像是口语里的自造词/玩笑说法。","它由 problem + 后缀 -dom 构成。-dom 常表示“领域/状态/统治范围”，如 kingdom（王国）、freedom（自由状态）。因此 problemdom = “问题的领域/问题状态”。","在正式写作中更常用：a lot of problems / a problem-filled situation / a world of problems。"]}
{"word":"problemist","summary":{"en":"A problemist is someone who creates problems (especially puzzles or chess problems), or—more critically—someone who keeps raising problems.","zh":"problemist 指“出题者”（尤指谜题或国际象棋棋题作者），也可带贬义指“爱挑问题、把事情复杂化的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who creates or sets problems, especially puzzles, mathematics questions, or chess problems","zh":"出题者；（尤指）谜题/数学题/国际象棋题的创作者"},"examples":[{"en":"She is a well-known problemist who writes logic puzzles for newspapers.","zh":"她是一位知名的出题者，为报纸撰写逻辑谜题。"},{"en":"The chess problemist composed an elegant mate-in-two.","zh":"这位国际象棋题作家创作了一道优雅的“两步将死”题。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who raises problems or turns situations into problems (often used critically)","zh":"爱挑问题的人；把事情复杂化的人（常含批评意味）"},"examples":[{"en":"Don’t be a problemist—let’s focus on solutions.","zh":"别总挑问题了——我们把重点放在解决方案上吧。"},{"en":"He’s a problemist in meetings, questioning every small detail.","zh":"他在会议上很爱挑问题，连小细节都要质疑。"}]}],"synonyms":["puzzle setter","question writer","exam setter","composer (chess)","nitpicker (critical sense)","faultfinder (critical sense)"],"phonetic":"/ˈprɑːbləmɪst/","extraExplanation":["“problemist”在英语里不算常用词，更正式/常见的表达是 puzzle setter（谜题出题者）、exam setter（考题命题人）、question writer（题目撰写者）。","在国际象棋语境中，“problemist”比较常见，专指创作 chess problems（棋题/残局题）的人，这类作品常见于棋刊与专门的棋题比赛。"]}
{"word":"problemistic","summary":{"en":"Problemistic means “involving difficult problems,” and in academic writing it can mean “problem-framing and questioning assumptions.”","zh":"problemistic 指“涉及棘手问题的”；在学术语境中也可指“以问题界定/质疑前提为重点的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Concerned with problems or difficulties; involving questions that are hard to solve or clearly define.","zh":"与问题/困难有关的；涉及难以解决或难以界定的问题的。"},"examples":[{"en":"The project is exciting, but its funding situation is problemistic.","zh":"这个项目很令人兴奋，但它的资金状况很成问题。"},{"en":"We need to discuss the most problemistic parts of the plan before we vote.","zh":"在投票前，我们需要先讨论计划中最棘手的部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Academic/philosophical) Focused on the nature of a problem and how it should be framed; questioning assumptions rather than offering a final answer.","zh":"（学术/哲学）聚焦于“问题是什么”以及如何界定问题；重在质疑前提而非给出最终答案的。"},"examples":[{"en":"Her paper takes a problemistic approach to the idea of ‘progress.’","zh":"她的论文以“问题化”的方式探讨“进步”这一概念。"},{"en":"The author’s problemistic style raises more questions than it resolves.","zh":"作者这种问题化的写法提出的问题多于给出的解决。"}]}],"synonyms":["problematic","troublesome","thorny","challenging","contentious","questioning"],"phonetic":"/ˌprɑːbləˈmɪstɪk/","extraExplanation":["“problemistic”在日常英语中不算常见，更常出现在学术写作里，意思接近“把某事当作需要被界定与反思的问题”。在普通表达中，人们更常用 problematic（有问题的）、troublesome（麻烦的）、challenging（有挑战的）。","词源上来自 problem（问题）+ -istic（……性质的/……风格的），因此常暗示一种“面向问题、围绕问题展开”的倾向或方法。"]}
{"word":"problemize","summary":{"en":"Problemize (more commonly: problematize) means to question and analyze something by treating it as a problem, often in academic or critical discussion.","zh":"problemize（更常见拼写为problematize）指把某事“问题化”，通过质疑与分析来审视它，常用于学术或批判性讨论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to treat something as a problem to be examined, questioned, or analyzed (often by challenging assumptions)","zh":"把某事当作“问题”来审视、质疑或分析（常指挑战既有假设）"},"examples":[{"en":"The article problematizes the idea that technology always makes life better.","zh":"这篇文章对“科技总能让生活更好”这一观点提出质疑并加以分析。"},{"en":"In class, we will problematize the term “success” and ask who gets to define it.","zh":"在课堂上，我们会把“成功”这个词问题化，追问是谁在定义它。"}]},{"partOfSpeech":"v.","definition":{"en":"to make an issue seem complicated or difficult by emphasizing its problems","zh":"通过强调问题，使某事显得更复杂、更棘手"},"examples":[{"en":"Some critics say the report problemizes a simple policy debate.","zh":"一些批评者认为这份报告把原本简单的政策讨论复杂化了。"},{"en":"He tends to problematize every decision instead of choosing a practical solution.","zh":"他总喜欢把每个决定都问题化，而不是选择一个务实的解决办法。"}]}],"synonyms":["problematize","question","challenge","critique","interrogate","complicate"],"phonetic":"/prəˈblɛməˌtaɪz/","extraExplanation":["“problematize”更常见；“problemize”是较少见的变体拼写。两者意思基本相同，但在学术写作（尤其是人文社科）中通常用“problematize”。","这个词常出现在批判性思维/批判理论语境里，意思不是“制造麻烦”，而是“把看似理所当然的概念拿出来讨论：它的前提是什么、对谁有利、有哪些被忽略的角度”。使用时注意语气：在日常对话里可能显得偏学术或“过度分析”。"]}
{"word":"problems","summary":{"en":"“Problems” means more than one problem: difficulties, troubles, or issues that need solutions.","zh":"“Problems”是“problem”的复数，指多个需要解决的困难、麻烦或问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Difficult situations, questions, or tasks that need a solution.","zh":"需要解决的困难情况、问题或任务。"},"examples":[{"en":"We need to solve these problems before Friday.","zh":"我们需要在周五之前解决这些问题。"},{"en":"Math problems can be challenging, but practice helps.","zh":"数学题可能很有挑战，但练习会有帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"Trouble or difficulties in life; things that cause stress or worry.","zh":"生活中的麻烦与困扰；让人压力或担心的事情。"},"examples":[{"en":"He has problems at work right now.","zh":"他现在工作上有些麻烦。"},{"en":"If you have any problems, tell me and we’ll figure it out.","zh":"如果你遇到任何问题，告诉我，我们一起想办法。"}]},{"partOfSpeech":"n.","definition":{"en":"A negative or harmful issue (often used in phrases like “a problem with…”).","zh":"不好的/有害的情况（常用于“a problem with…”等结构）。"},"examples":[{"en":"There’s a problem with the internet connection.","zh":"网络连接出了问题。"},{"en":"The biggest problem with this plan is the cost.","zh":"这个计划最大的问题是成本。"}]}],"synonyms":["issues","difficulties","troubles","challenges","concerns"],"phonetic":"/ˈprɑbləmz/","extraExplanation":["“Problems”是“problem”的复数。口语里常说“Any problems?”表示“有什么问题/麻烦吗？”。","在学术语境里，“problem”也常指“待研究的议题/课题”（research problem），但日常对话中更常指“需要解决的困难”。","固定搭配：solve problems（解决问题）、have problems (with sth)（在某方面有困难/出问题）、cause problems（引起问题）、problem-solving（解决问题的能力）。"]}
{"word":"problemwise","summary":{"en":"“Problemwise” means “in terms of problems” or “as for the problems.”","zh":"problemwise 意为“就问题而言/从问题角度来看；至于问题方面”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In terms of problems; regarding the problem(s) involved (often used to compare or assess difficulties).","zh":"就问题而言；从问题/困难的角度来看（常用于比较或评估难度）。"},"examples":[{"en":"Problemwise, this project is easier than the last one.","zh":"就问题难度而言，这个项目比上一个更容易。"},{"en":"We’re fine budgetwise, but problemwise we still have a few risks.","zh":"预算方面没问题，但就问题而言我们仍有一些风险。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to mean “as for problems,” introducing what someone wants to say about problems in a situation (informal).","zh":"用于引出“至于问题方面”的说明（较口语）。"},"examples":[{"en":"Problemwise, the biggest issue is communication.","zh":"问题方面，最大的麻烦是沟通。"},{"en":"Problemwise, nothing serious has come up yet.","zh":"就问题而言，目前还没出现什么严重情况。"}]}],"synonyms":["in terms of problems","regarding the problems","as for the problems","problem-wise"],"phonetic":"/ˈprɑbləmˌwaɪz/","extraExplanation":["“problemwise”由 problem + 后缀 “-wise” 构成，-wise 表示“在……方面/就……而言”（如 timewise, moneywise, healthwise）。这种结构在口语、邮件、工作沟通中很常见，但在正式写作中有时会显得随意；更正式的替代说法有：“regarding problems,” “in terms of problems,” “as far as problems are concerned”。"]}
{"word":"problockade","summary":{"en":"Problockade (more commonly written “pro-blockade”) means supporting a blockade, or a person/group that supports it.","zh":"problockade（更常写作 pro-blockade）指“支持封锁的”，也可指“支持封锁的人/团体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a blockade (an effort to stop goods, people, or information from entering or leaving a place), especially as a political position.","zh":"支持封锁的（封锁指阻止货物、人员或信息进出某地的措施），常指一种政治立场。"},"examples":[{"en":"Some lawmakers took a pro-blockade stance during the conflict.","zh":"在冲突期间，一些立法者采取了支持封锁的立场。"},{"en":"Pro-blockade voices argued that cutting supplies would pressure the government to negotiate.","zh":"支持封锁的声音认为，切断物资可以迫使政府进行谈判。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports a blockade.","zh":"支持封锁的人或团体。"},"examples":[{"en":"Pro-blockades and anti-blockades debated the policy on live television.","zh":"支持封锁者与反对封锁者在电视直播中就该政策展开辩论。"}]}],"synonyms":["in favor of the blockade","supporting the blockade","pro-sanctions (related but not identical)"],"phonetic":"/ˌproʊ blɑˈkeɪd/","extraExplanation":["“pro-”是前缀，意思是“赞成、支持”。“blockade”常见于新闻与国际关系语境（如海上封锁、经济封锁或边境封锁）。写作时常加连字符：pro-blockade。","中性表达建议：在正式写作中可用“supporting the blockade / in favor of the blockade”来避免标签化；在报道或评论中“pro-blockade”更像立场称呼。"]}
{"word":"probonding","summary":{"en":"“Probonding” usually means bond-promoting (helping things stick/join), mainly in technical contexts.","zh":"“probonding”通常指“促进粘结/结合”，主要见于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"promoting or helping two materials or parts bond (stick or join) together; used especially in technical contexts (e.g., adhesives, manufacturing).","zh":"促使两种材料或部件更好地粘合/结合在一起；多用于技术语境（如胶黏剂、制造业）。"},"examples":[{"en":"The engineer applied a primer as a pro-bonding layer before adding the adhesive.","zh":"工程师在涂胶之前先涂了一层底涂，作为促进粘结的涂层。"},{"en":"Surface cleaning is a simple pro-bonding step that improves adhesion.","zh":"清洁表面是一个简单的促粘步骤，可以提升附着力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of encouraging bonding (sticking/joining) between surfaces or components.","zh":"促进粘结/结合的行为或过程。"},"examples":[{"en":"Probonding can reduce failures in high-temperature environments.","zh":"促粘处理可以减少高温环境下的失效。"},{"en":"They focused on probonding between the coating and the metal.","zh":"他们重点研究涂层与金属之间的促粘效果。"}]}],"synonyms":["bond-promoting","adhesion-promoting","promoting bonding","improving adhesion"],"phonetic":"/proʊ ˈbɑndɪŋ/","extraExplanation":["“probonding”不是常见的通用英语词，更多像是技术写作里的临时用法（相当于“pro-bonding”=促进粘结）。在正式文本中，更常见的表达有：“bond-promoting”“adhesion-promoting”“promote bonding/adhesion”。如果你是在特定行业（如胶黏剂、涂层、牙科/正畸）看到该词，可能是产品名、工艺名或作者自造的合成词。"]}
{"word":"probonus","summary":{"en":"“Pro bono” means professional work done for free, especially to help the public or people in need.","zh":"“pro bono”指专业服务的无偿提供，尤为公益或帮助有需要的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of legal or professional work) done without charging a fee, especially to help someone who cannot afford it","zh":"（法律或专业服务）无偿提供的，尤指帮助无力支付费用的人"},"examples":[{"en":"The lawyer took the case pro bono for a low-income family.","zh":"这位律师为一个低收入家庭无偿代理了这个案子。"},{"en":"Our clinic offers pro bono counseling a few days each month.","zh":"我们诊所每月有几天提供免费的公益咨询。"}]},{"partOfSpeech":"adv.","definition":{"en":"without charging a fee; for free (used especially about professional services)","zh":"无偿地；免费地（多用于专业服务）"},"examples":[{"en":"She agreed to work pro bono until the nonprofit found funding.","zh":"她同意在非营利组织找到资金前先无偿工作。"},{"en":"He occasionally advises startups pro bono.","zh":"他偶尔会免费为初创公司提供建议。"}]}],"synonyms":["free of charge","voluntary","unpaid","gratis","charitable"],"phonetic":"/proʊ ˈboʊnoʊ/","extraExplanation":["“pro bono”来自拉丁语“pro bono publico”，意思是“为了公众利益”。英语里常用于法律领域（pro bono legal work），也可扩展到医疗、咨询、设计等专业服务的公益性质。","用法提示：通常写作两个词“pro bono”，也常见搭配“do/work pro bono”“take a case pro bono”。有时会看到连字符“pro-bono”（多作形容词），但最常见仍是分开写。"]}
{"word":"proborrowing","summary":{"en":"Proborrowing (more often written pro-borrowing) means supporting borrowing, especially borrowing money.","zh":"proborrowing（更常写作 pro-borrowing）指支持借入/借款，尤其是支持借钱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Supporting borrowing, especially borrowing money (e.g., favoring loans, debt financing, or easier access to credit).","zh":"（不常见）支持“借入/借款”的立场，尤其指支持借钱（例如偏好贷款、举债融资或更容易获得信贷）。"},"examples":[{"en":"Some small businesses take a pro-borrowing approach when cash flow is tight.","zh":"有些小企业在现金流紧张时会采取“支持借款”的做法。"},{"en":"The policy was criticized as too pro-borrowing and risky.","zh":"这项政策被批评为过于“鼓励借债”，风险很高。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A pro-borrowing position or attitude; support for borrowing.","zh":"（不常见）支持借入/借款的立场或态度；对借款的支持。"},"examples":[{"en":"Her pro-borrowing comes from believing credit helps people build opportunities.","zh":"她之所以支持借款，是因为她认为信贷能帮助人们创造机会。"},{"en":"The debate turned into a clash between pro-borrowing and anti-debt voices.","zh":"这场辩论变成了“支持借款”和“反对负债”两派声音的对抗。"}]}],"synonyms":["pro-borrowing","pro-credit","debt-friendly","loan-friendly"],"phonetic":"/proʊˈbɑroʊɪŋ/","extraExplanation":["“proborrowing”不是很固定的标准拼写，更常见写法是带连字符的 **pro-borrowing**，意思相当于“支持借款/偏向借款”。","在金融新闻或政策讨论里，它常用来对比 **anti-debt / anti-borrowing**（反对负债/反对借款）。","如果你本来想查的是 **probation**（缓刑/试用期）或 **borrowing**（借用/借款）等词，也可以告诉我上下文，我可以帮你确认正确词形。"]}
{"word":"proboscidal","summary":{"en":"Proboscidal means “related to a proboscis,” a long nose- or tube-like organ used for feeding or smelling.","zh":"proboscidal 指“与长鼻/喙/口器有关的”，即与用于取食或嗅闻的细长鼻状或管状器官相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a proboscis (a long, nose-like or tube-like organ used for smelling, feeding, or sucking).","zh":"与“长鼻/喙/口器”（用于嗅闻、取食或吸食的细长鼻状或管状器官）有关的。"},"examples":[{"en":"Mosquitoes have proboscidal mouthparts for sucking blood.","zh":"蚊子有用于吸血的喙状（长管状）口器。"},{"en":"The elephant’s proboscidal trunk is used to grasp food and draw up water.","zh":"大象的长鼻（喙状器官）既能抓取食物，也能吸水。"}]}],"synonyms":["proboscis-related","long-nosed","tube-mouthed"],"phonetic":"/proʊˈbɑsɪdəl/","extraExplanation":["“Proboscidal”常见于生物学/动物学语境，描述与proboscis相关的结构（如昆虫口器、象鼻等）。日常英语里更常用“long-nosed”“tube-like mouthparts”这类更直观的说法。","词源上来自希腊语proboskis（意为“向前伸出的鼻/喙”）。在学术写作中，它常与解剖或适应性（例如取食方式）一起出现。"]}
{"word":"proboscidate","summary":{"en":"Proboscidate means “having a proboscis” (a long nose or tube-like mouthpart).","zh":"proboscidate 指“有长鼻/喙/管状口器的（具 proboscis 的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a proboscis (a long nose or tube-like mouthpart), or resembling one; long-snouted.","zh":"具有“长鼻/喙/管状口器”（proboscis）的；像长鼻一样的；长吻的。"},"examples":[{"en":"The proboscidate insect uses its long mouthpart to sip nectar from flowers.","zh":"这种具长喙的昆虫用它的长口器从花中吸取花蜜。"},{"en":"In the museum display, the proboscidate mammal was shown with an elongated snout.","zh":"在博物馆展览中，这种长吻的哺乳动物被展示为有拉长的口鼻部。"}]}],"synonyms":["proboscis-bearing","long-snouted","proboscidian (related term)"],"phonetic":"/proʊˈbɑːsɪˌdeɪt/","extraExplanation":["“proboscidate”是相对少见的形容词，常见于动物学/昆虫学写作。它来自“proboscis（长鼻；喙；口器）”，意思就是“有长鼻/长口器的”。在现代英语里，学术语境更常用“proboscis-bearing”或“having a proboscis”。"]}
{"word":"proboscidea","summary":{"en":"Proboscidea is the scientific order that includes elephants and their extinct relatives (like mammoths).","zh":"Proboscidea 指生物分类中的“长鼻目”，包括大象及其已灭绝的近亲（如猛犸象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific group (an order of mammals) that includes modern elephants and their extinct relatives, typically characterized by a trunk and tusks","zh":"长鼻目：哺乳动物的一个分类“目”，包括现代大象及其已灭绝的近亲，典型特征是长鼻（象鼻）和象牙"},"examples":[{"en":"Elephants are the only living members of the order Proboscidea.","zh":"大象是长鼻目中唯一现存的成员。"},{"en":"Fossils show that Proboscidea once included many species, such as mammoths and mastodons.","zh":"化石显示长鼻目曾包含许多物种，例如猛犸象和乳齿象。"}]}],"synonyms":["the elephant order","proboscideans (related term)"],"phonetic":"/ˌproʊbəˈsɪdiə/","extraExplanation":["词源来自希腊语 proboskis（意为“长鼻、象鼻”）。在科学写作中，Proboscidea 通常首字母大写，表示生物分类中的“目”。","相关词：proboscidean（n./adj. 长鼻目动物；长鼻目的），常用于描述象类及其近亲。"]}
{"word":"proboscidean","summary":{"en":"Proboscidean means an elephant or an extinct elephant relative, or something related to them.","zh":"proboscidean 指长鼻目动物（如大象及其灭绝近亲），或与其相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the mammal order Proboscidea, especially an elephant or an extinct relative like a mammoth or mastodon.","zh":"长鼻目动物；尤指大象或其已灭绝的近亲（如猛犸象、乳齿象等）。"},"examples":[{"en":"Modern proboscideans include elephants, while mammoths are extinct proboscideans.","zh":"现代的长鼻目动物包括大象，而猛犸象是已灭绝的长鼻目动物。"},{"en":"The museum has a skeleton of a proboscidean that lived during the Ice Age.","zh":"博物馆里有一具生活在冰河时期的长鼻目动物骨骼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to elephants or the order Proboscidea.","zh":"（形容词）与大象或长鼻目有关的。"},"examples":[{"en":"Researchers compared proboscidean teeth to study changes in diet.","zh":"研究人员比较长鼻目动物的牙齿来研究饮食变化。"},{"en":"The fossil record shows several proboscidean species in this region.","zh":"化石记录显示这一地区曾有多种长鼻目物种。"}]}],"synonyms":["elephant (informal/general)","proboscidian (variant spelling)"],"phonetic":"/ˌproʊbɑˈsɪdiən/","extraExplanation":["词源提示：proboscis 表示“长鼻、鼻状器官”，来自希腊语；Proboscidea 是动物分类学中的“长鼻目”，因其显著特征——长鼻（象鼻）而得名。","使用场景：proboscidean 常见于动物学、古生物学、博物馆说明牌、纪录片解说等较正式语境；日常英语里更常直接说 elephant（大象）、mammoth（猛犸象）等。","相关词汇：proboscis（长鼻/喙）、mastodon（乳齿象）、mammoth（猛犸象）、elephantine（像大象的；巨大笨重的）。"]}
{"word":"proboscideous","summary":{"en":"Proboscideous means having a long nose/snout (a proboscis) or relating to elephants and their relatives.","zh":"proboscideous 指“有长鼻/长喙状特征的”，也可指“与长鼻目（象及其近亲）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or resembling a proboscis (a long nose or snout), such as an elephant’s trunk or an insect’s extended mouthpart.","zh":"有（或像）长鼻/长喙的；具有“吻突/象鼻”形态的（如大象的鼻子或昆虫延长的口器）。"},"examples":[{"en":"The elephant’s proboscideous trunk can grasp food and draw up water.","zh":"大象那条“长鼻状”的象鼻既能抓取食物，也能吸水。"},{"en":"Some insects have proboscideous mouthparts designed for sipping nectar.","zh":"有些昆虫的口器呈长喙状，专门用来吸食花蜜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Proboscidea, the mammal group that includes elephants and their extinct relatives.","zh":"（动物分类）与长鼻目相关的；指包括现生大象及其灭绝近亲的类群。"},"examples":[{"en":"Fossils from proboscideous mammals help scientists trace elephant evolution.","zh":"长鼻目哺乳动物的化石帮助科学家追踪大象的演化。"},{"en":"The museum’s proboscideous exhibit features skulls of ancient elephant relatives.","zh":"博物馆的长鼻目展区展示了远古象类近亲的头骨。"}]}],"synonyms":["long-nosed","snouted","trunked","proboscidian (related term)"],"phonetic":"proʊˈbɑːsɪdiəs","extraExplanation":["词源提示：proboscideous 来自 proboscis（“长鼻；喙”），而 proboscis 源于希腊语 *proboskis*，原意与“向前伸出、可取食的器官”相关。因此它常用于描述“形态像长鼻/长喙”的特征，也可用于动物学分类（长鼻目）。","使用场景：这是较书面、偏生物学/解剖学的词。日常英语更常用 long-nosed、having a trunk、with a long snout 等表达。"]}
{"word":"proboscides","summary":{"en":"Proboscides = the plural of proboscis, meaning long tube-like noses or mouthparts (often in insects).","zh":"Proboscides 是 proboscis 的复数，指细长管状的鼻子或口器（常见于昆虫等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of proboscis: long, tube-like noses or mouthparts (especially an elephant’s trunk or an insect’s feeding tube).","zh":"proboscis 的复数：指细长管状的“鼻子/口器”（尤其是大象的鼻子或昆虫用于取食的口器）。"},"examples":[{"en":"Butterflies drink nectar using their proboscides.","zh":"蝴蝶用它们的口器（proboscides）吸食花蜜。"},{"en":"The microscope showed the proboscides of several insects.","zh":"显微镜下可以看到几种昆虫的口器（proboscides）。"}]}],"synonyms":["trunks","snouts","mouthparts"],"phonetic":"/proʊˈbɑːsɪˌdiːz/","extraExplanation":["“proboscides”是生物学里常见的复数形式，来自希腊语词根；它是“proboscis”的不规则复数（类似于 appendix → appendices）。日常英语里也有人用规则复数“proboscises”，但在学术/科普写作中“proboscides”更常见、更正式。"]}
{"word":"proboscidial","summary":{"en":"Proboscidial means “related to a proboscis,” such as an elephant’s trunk or an insect’s long mouthpart.","zh":"proboscidial 指“与长鼻/喙/口器（proboscis）有关的”，如大象的象鼻或昆虫的管状口器。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a proboscis (a long, tube-like nose or mouthpart), especially in animals such as elephants or certain insects.","zh":"与“长鼻/喙/口器（proboscis）”有关的；尤指大象的长鼻或某些昆虫的管状口器。"},"examples":[{"en":"Elephants use their proboscidial trunk to grasp food and drink water.","zh":"大象用它们与长鼻相关的鼻（象鼻）来抓取食物并喝水。"},{"en":"Some butterflies have proboscidial mouthparts adapted for sipping nectar.","zh":"一些蝴蝶有与口器相关的管状口器，适合吸食花蜜。"}]}],"synonyms":["proboscis-related","proboscidean (related, but often refers to the elephant group)"],"phonetic":"/ˌproʊbəˈsɪdiəl/","extraExplanation":["“proboscidial”是较少见、偏学术/生物学用语，常见于动物学、解剖学或昆虫学文本。日常英语里更常说“proboscis-related”或直接说“trunk（象鼻）/proboscis（喙、口器）”。","词根提示：proboscis（长鼻/口器）+ -al（……的）→ proboscidial（与长鼻/口器有关的）。"]}
{"word":"proboscidian","summary":{"en":"A proboscidian is an elephant or an elephant-like animal (living or extinct), or something related to that group.","zh":"proboscidian 指长鼻目（象类及其已灭绝近亲）的动物，或与该类群有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An animal in the elephant group (order Proboscidea), such as modern elephants or extinct relatives like mammoths and mastodons.","zh":"长鼻目动物；象类动物（如现代大象，以及已灭绝的猛犸象、乳齿象等）。"},"examples":[{"en":"Elephants are the only living proboscidians today.","zh":"如今仍存活的长鼻目动物只有大象。"},{"en":"Fossils show that proboscidians once lived on several continents.","zh":"化石显示长鼻目动物曾分布在多个大洲。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to elephants and their extinct relatives (the order Proboscidea).","zh":"（形容词）与长鼻目（象类及其近亲）有关的。"},"examples":[{"en":"The museum has a proboscidian fossil exhibit.","zh":"博物馆有一个长鼻目化石展区。"},{"en":"Researchers compared proboscidian teeth to identify the species.","zh":"研究人员比较了长鼻目动物的牙齿来鉴定物种。"}]}],"synonyms":["elephant (common, but not exact)","Proboscidea (technical group name)","elephantine (adj., more general)"],"phonetic":"/proʊˌbɑːˈsɪdiən/","extraExplanation":["“Proboscidian”来自“proboscis”（长鼻子、象鼻）。在生物学里它指“长鼻目”（Proboscidea），包括现存的大象以及已灭绝的近亲（如mammoth 猛犸象、mastodon 乳齿象）。","在科普写作或博物馆语境中更常见；日常英语里通常直接说“elephant(s)”或具体物种名。"]}
{"word":"proboscidiferous","summary":{"en":"Proboscidiferous means “having a proboscis,” i.e., a long nose or trunk-like projecting mouthpart.","zh":"proboscidiferous 意为“有长鼻/象鼻/喙状口器的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or bearing a proboscis (a long nose or trunk-like projecting mouthpart).","zh":"有（或带有）长鼻／鼻状突起／象鼻（喙状口器）的。"},"examples":[{"en":"The illustrator drew a proboscidiferous creature with a long, trunk-like snout.","zh":"插画师画了一只proboscidiferous（有长鼻的）生物，鼻子像象鼻一样细长。"},{"en":"In some old scientific descriptions, certain insects are called proboscidiferous because they feed with an elongated mouthpart.","zh":"在一些较旧的科学描述中，某些昆虫会被称为proboscidiferous，因为它们用细长的口器取食。"}]}],"synonyms":["long-nosed","trunk-nosed","with a proboscis"],"phonetic":"/proʊˌbɑːsɪˈdɪfərəs/","extraExplanation":["这是一个非常罕见、偏学术的形容词，多见于旧式的动物学/昆虫学描写。词形上可拆为：proboscis（长鼻、象鼻、喙状口器）+ -ferous（“带有…的/产生…的”，源自拉丁语 ferre“携带”）。因此字面意思就是“带有长鼻（口器）的”。使用时常可用更常见的表达替换，如 with a proboscis, long-nosed, trunk-nosed。"]}
{"word":"proboscidiform","summary":{"en":"Proboscidiform means “shaped like a proboscis,” especially in biological descriptions.","zh":"proboscidiform 指“象鼻状的、像长鼻/喙那样的”，多用于生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a part of an animal’s body) shaped like or resembling a proboscis (a long nose or trunk).","zh":"（指动物身体的某一部分）呈长鼻/象鼻（proboscis）形的；像长鼻一样的。"},"examples":[{"en":"Some insects have a proboscidiform mouthpart for sucking nectar.","zh":"有些昆虫有象鼻状的口器，用来吸食花蜜。"},{"en":"The illustration shows a proboscidiform structure extending from the head.","zh":"插图显示头部伸出一个象鼻状结构。"}]}],"synonyms":["trunk-like","proboscis-like","tubular","elongated"],"phonetic":"/proʊˈbɑːsɪdɪˌfɔːrm/","extraExplanation":["词源上，proboscis 来自希腊语，意为“向前伸出的器官”，常见于“昆虫的喙/口器”或“象鼻”。proboscidiform 由 proboscis + -form（“……形的”）构成，表示“像象鼻那样的形状”。","这个词偏学术/生物学写作，日常英语里更常说 trunk-like（像象鼻的）或 long-nosed（长鼻的），但在描述昆虫口器或解剖结构时，proboscidiform 更精确。"]}
{"word":"probosciform","summary":{"en":"Probosciform means “having or resembling a proboscis (a trunk-like nose/snout).”","zh":"probosciform 指“具有或类似象鼻/长鼻（吻突）结构的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a long, flexible nose or snout (a proboscis), or relating to animals that have one.","zh":"有长而可弯曲的鼻子/口吻（象鼻）的；与具有象鼻等“吻突/长鼻”的动物有关的。"},"examples":[{"en":"An elephant is a probosciform animal because it has a trunk.","zh":"大象是probosciform（有象鼻的）动物，因为它有鼻子形成的长鼻（象鼻）。"},{"en":"The scientist described the fossil as probosciform, suggesting it may have had a trunk-like nose.","zh":"科学家把这块化石描述为probosciform，暗示它可能有类似象鼻的鼻部结构。"}]}],"synonyms":["proboscis-like","trunk-like","proboscidean (related)"],"phonetic":"/proʊˈbɑːsɪˌfɔːrm/","extraExplanation":["“probosciform”常见于动物学/古生物学写作，用来形容“像象鼻那样的结构”。它与名词“proboscis（长鼻、喙状口器）”同源。","注意拼写：更常见的说法是“proboscis-like（像长鼻的）”或“proboscidean（长鼻目相关的，如象类）”。“probosciform”相对更偏学术、较少用于日常英语。"]}
{"word":"probosciformed","summary":{"en":"Probosciformed means “having or shaped like a proboscis (trunk/snout).”","zh":"probosciformed 指“具有或呈长鼻（象鼻/喙）形状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a proboscis (a long, flexible nose or snout); shaped like a trunk.","zh":"具长鼻（喙、吻突）状的；呈象鼻形的。"},"examples":[{"en":"The probosciformed snout helps the animal reach food hidden in narrow spaces.","zh":"这种象鼻状的口鼻部帮助动物伸进狭窄空间取食。"},{"en":"Scientists described the fossil as probosciformed, suggesting it may have had a trunk-like structure.","zh":"科学家将该化石描述为“具象鼻形”，暗示它可能有类似象鼻的结构。"}]}],"synonyms":["proboscis-like","probosciform","trunk-shaped","snout-like"],"phonetic":"/proʊˈbɑːsɪsˌfɔːrmd/","extraExplanation":["“probosciformed”由 proboscis（喙、长鼻）+ -formed（……形的）构成，常见于动物学、古生物学等学术写作中。","更常见、也更自然的表达包括：proboscis-like（像长鼻的）、having a proboscis（有长鼻/喙的）、probosciform（象鼻形的）。"]}
{"word":"probosciger","summary":{"en":"Probosciger is the scientific genus name for the palm cockatoo.","zh":"Probosciger 是棕榈凤头鹦鹉的属名（学名用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the palm cockatoo (the species in this genus is the palm cockatoo, Probosciger aterrimus).","zh":"（生物分类）凤头鹦鹉科中“棕榈凤头鹦鹉”的属名；该属现主要指棕榈凤头鹦鹉（学名 Probosciger aterrimus）。"},"examples":[{"en":"The palm cockatoo is classified in the genus Probosciger.","zh":"棕榈凤头鹦鹉被归类在 Probosciger 这个属里。"},{"en":"Some older field guides list Probosciger aterrimus as the only species in the genus.","zh":"一些较早的野外图鉴把 Probosciger aterrimus 列为该属唯一的物种。"}]}],"synonyms":["palm cockatoo","Probosciger aterrimus"],"phonetic":"/proʊˈbɑsɪdʒər/","extraExplanation":["这是拉丁化的学名（属名），常见于鸟类学、动物园说明牌、学术论文中；日常英语里更常说 palm cockatoo（棕榈凤头鹦鹉）。","词源上与希腊语 proboskis（长鼻、象鼻）有关，暗示“突出的喙/口鼻部”这一外形特征；属名多由古典语言拼成，用来概括外形或分类关系。","学名通常用斜体书写：Probosciger；属名首字母大写。种名写作 Probosciger aterrimus（属名+种加词）。"]}
{"word":"proboscis","summary":{"en":"A proboscis is a long nose (like an elephant’s trunk) or a long tube-like mouthpart used by some insects to suck liquids.","zh":"proboscis 指动物的长鼻（如象鼻）或某些昆虫用来吸食液体的长管状口器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the long nose of some animals (especially an elephant)","zh":"（某些动物的）长鼻子，尤其指大象的鼻子"},"examples":[{"en":"An elephant uses its proboscis to drink water and pick up food.","zh":"大象用它的长鼻子喝水、拿食物。"},{"en":"The baby elephant curled its proboscis around the branch.","zh":"小象用长鼻子缠住树枝。"}]},{"partOfSpeech":"n.","definition":{"en":"a long, tube-like mouthpart used by some insects to suck up liquids (such as nectar)","zh":"（某些昆虫的）长管状口器，用来吸食液体（如花蜜）"},"examples":[{"en":"A butterfly unrolled its proboscis to sip nectar from the flower.","zh":"蝴蝶伸出卷曲的口器，从花里吸花蜜。"},{"en":"Mosquitoes have a proboscis for piercing skin and feeding.","zh":"蚊子有刺破皮肤并吸食的口器。"}]}],"synonyms":["trunk (elephant)","snout (broader, not always long)","mouthpart (insects, general)","rostrum (some animals/insects, technical)"],"phonetic":"/proʊˈbɑːsɪs/","extraExplanation":["词源来自拉丁语 proboscis（意为“鼻子/长鼻”），常见于动物学与昆虫学语境。日常英语里更常直接说 elephant’s trunk（大象的鼻子）；proboscis 更偏正式、科学。","文学或描述性写作中，proboscis 常用来强调“细长、可卷曲、可伸缩”的形态特征，因此也常出现在自然写作（nature writing）与科普文章里。"]}
{"word":"proboscises","summary":{"en":"Proboscis means a long trunk or nose (like an elephant’s) or a tube-like insect mouthpart used for feeding.","zh":"proboscis 指长鼻或象鼻，也可指昆虫用来取食的管状口器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, flexible nose or trunk, especially that of an elephant.","zh":"（尤指大象的）长而灵活的鼻子／象鼻。"},"examples":[{"en":"The elephant lifted food to its mouth with its proboscis.","zh":"大象用它的象鼻把食物送到嘴边。"},{"en":"The proboscis is strong enough to pick up heavy branches.","zh":"象鼻强壮到能卷起很重的树枝。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, tube-like mouthpart of some insects (such as butterflies and mosquitoes) used for feeding.","zh":"（某些昆虫如蝴蝶、蚊子的）口器；细长管状的取食器官。"},"examples":[{"en":"A butterfly uncoiled its proboscis to drink nectar.","zh":"蝴蝶伸出卷曲的口器吸食花蜜。"},{"en":"A mosquito uses its proboscis to pierce skin and feed.","zh":"蚊子用口器刺入皮肤并吸食。"}]}],"synonyms":["trunk","snout","insect mouthpart"],"phonetic":"/proʊˈbɑːsɪs/","extraExplanation":["你写的“proboscises”通常被认为是不标准或很少用的复数形式。更常见、正确的复数是：proboscises / proboscides（学术或较正式写法，读作类似 pro-BOS-si-deez）。日常英语里用 proboscises 更普遍。","词源来自希腊语，原意与“向前伸出的部分”有关，所以既可指大象的“鼻子/象鼻”，也常指昆虫“伸出来用来取食的口器”。"]}
{"word":"proboscislike","summary":{"en":"Proboscislike means “shaped like a long nose or feeding tube.”","zh":"proboscislike 指“形状像长鼻或（昆虫）口器那样细长管状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a proboscis (a long, tube-like nose or snout, or an insect’s feeding tube).","zh":"像长鼻的；像（动物的）长鼻/口吻，或像（昆虫）口器的。"},"examples":[{"en":"The creature had a proboscislike snout that it used to sniff the ground.","zh":"那生物有一个像长鼻一样的口鼻，用来嗅地面。"},{"en":"In the illustration, the alien is drawn with a proboscislike tube for drinking.","zh":"在插图里，那外星人被画成有一根像长鼻一样的管子用来喝东西。"}]}],"synonyms":["long-nosed","snoutlike","tubular","beaklike"],"phonetic":"/proʊˈbɑsɪsˌlaɪk/","extraExplanation":["“proboscislike”常见于科普、生物学描写或文学性的外貌刻画中，语气偏书面。也常写成带连字符的形式“proboscis-like”。","词根提示：proboscis（长鼻/口器）+ -like（像……一样的）。如果你看到“proboscidean”，那通常指“象类的/与象有关的”（如猛犸象、象）。"]}
{"word":"probouleutic","summary":{"en":"Probouleutic describes preliminary council deliberation that prepares proposals for a larger assembly.","zh":"probouleutic 指议事机构在更大集会表决前进行的“预先审议/预备提案”性质的工作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in ancient Greek politics) relating to a council’s preliminary discussion and preparation of measures before they are presented to a larger assembly.","zh":"（尤指古希腊政治）与“预先审议/预先拟议”有关的；指在提交给更大集会之前，由议事机构先行讨论、准备提案的。"},"examples":[{"en":"In Athens, the Council of 500 had a probouleutic role before proposals reached the Assembly.","zh":"在雅典，五百人议事会在提案提交到公民大会之前承担着预先审议（probouleutic）的角色。"},{"en":"The committee’s probouleutic work helped organize the agenda and refine the wording of the motion.","zh":"该委员会的预先审议工作帮助安排议程并完善动议措辞。"}]}],"synonyms":["preliminary","preparatory","agenda-setting","deliberative"],"phonetic":"/ˌproʊbəˈluːtɪk/","extraExplanation":["这个词来自希腊语词根：pro-（在前、预先）+ boule（议事、商议；也与“议事会”相关）。在古雅典制度中，公民大会（Assembly）是最终表决机构，而议事会会先做“probouleusis（预先审议/预备提案）”，把议题整理成可供大会讨论与表决的形式。","在现代英语里该词非常少见，多出现在古典学、政治思想史或学术写作中；在普通语境里更常用的表达是 “preliminary” / “preparatory” / “agenda-setting” 等。"]}
{"word":"proboulevard","summary":{"en":"A boulevard is a wide main city street, often tree-lined or divided by a median.","zh":"boulevard 指宽阔的城市主干道，常为林荫大道或有中央分隔带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wide city street, often with trees or a central divider (median)","zh":"（城市里常见的）林荫大道；宽阔的大街（常有中央分隔带）"},"examples":[{"en":"We walked down the boulevard after dinner.","zh":"晚饭后我们沿着林荫大道散步。"},{"en":"The hotel is on a busy boulevard near the museum.","zh":"那家酒店在博物馆附近一条繁忙的大街上。"},{"en":"Palm trees line the boulevard along the beach.","zh":"海边的林荫大道两旁种着棕榈树。"}]},{"partOfSpeech":"n.","definition":{"en":"(in business/media) a place where a particular kind of culture or industry is based, used figuratively","zh":"（比喻用法，常见于商业/媒体）某种文化或行业的集中地、中心"},"examples":[{"en":"Madison Avenue is often used as a boulevard for advertising culture.","zh":"“麦迪逊大道”常被用来指代广告业文化中心。"},{"en":"Broadway became a boulevard of theater and nightlife.","zh":"百老汇成了戏剧与夜生活的中心。"}]}],"synonyms":["avenue","main street","thoroughfare","parkway"],"phonetic":"/ˈbuːləˌvɑrd/","extraExplanation":["你输入的“proboulevard”看起来像拼写或分词错误；常见单词是 **boulevard**。如果你本来想写 **pro-boulevard**（支持修建/发展大道的），也可以告诉我具体句子，我可以按语境解释。","**boulevard** 来自法语，原指“城墙顶上的通道”，后来引申为“宽阔的大街”。在英语里也常出现在路名中，如 *Sunset Boulevard*。"]}
{"word":"probowling","summary":{"en":"Pro bowling means professional, high-level competitive bowling (often ten-pin), usually in organized tournaments.","zh":"pro bowling 指职业级别的高水平竞技保龄球（多为十瓶制），常在组织化比赛与巡回赛中进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Professional bowling; the sport of ten‑pin bowling played at a high, competitive level, often in organized tours and tournaments.","zh":"职业保龄球；指以高水平竞技方式进行的十瓶保龄球运动，常见于职业巡回赛与各类锦标赛。"},"examples":[{"en":"She follows pro bowling on TV and knows many top players.","zh":"她在电视上关注职业保龄球，还认识不少顶尖选手。"},{"en":"He hopes to compete in pro bowling after college.","zh":"他希望大学毕业后参加职业保龄球比赛。"}]}],"synonyms":["professional bowling","PBA bowling","competitive bowling"],"phonetic":"/ˈproʊˌboʊlɪŋ/","extraExplanation":["“pro bowling”在美国语境里常让人联想到 PBA（Professional Bowlers Association，职业保龄球协会）巡回赛；比赛通常是十瓶保龄球（ten-pin bowling）。","写法上更常见的是分开写“pro bowling”。合写“probowling”多见于用户名、网站名或品牌名。"]}
{"word":"proboxing","summary":{"en":"Pro boxing means professional (paid) boxing competitions.","zh":"Pro boxing 指职业（有报酬的）拳击比赛。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"professional boxing: boxing fought by paid athletes under the rules of recognized boxing organizations, usually in scheduled bouts for rankings and titles","zh":"职业拳击：由领取报酬的拳击手在公认拳击组织规则下进行的比赛，通常按回合安排，争取排名与头衔"},"examples":[{"en":"He trains every day because he wants to compete in pro boxing.","zh":"他每天训练，因为他想参加职业拳击比赛。"},{"en":"Pro boxing events are often shown on pay-per-view or streaming platforms.","zh":"职业拳击赛事常在付费点播或流媒体平台播出。"},{"en":"Many fans follow pro boxing for the title fights and rivalries.","zh":"很多拳迷关注职业拳击，主要是为了看冠军战和宿敌对决。"}]}],"synonyms":["professional boxing","the pro ranks","paid boxing"],"phonetic":"/proʊ ˈbɑksɪŋ/","extraExplanation":["“pro-”是“professional（职业的）”的常见口语缩写前缀，常见于 pro sports（职业体育）、pro gamer（职业玩家）。写作中更常见的是“pro boxing”或“professional boxing”，而“proboxing”作为连写形式较少见，多出现在用户名、标签（hashtag）或品牌名里。","职业拳击与业余拳击（amateur boxing）的常见区别包括：是否领薪/奖金、比赛场次与回合设置、评分与赛事体系（排名、金腰带）等。不同国家与组织规则会有细节差异。"]}
{"word":"proboycott","summary":{"en":"Pro-boycott describes support for a boycott or the people who support one.","zh":"pro-boycott 指“支持抵制”的立场或支持抵制的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a boycott; in favor of refusing to buy, use, or support something as a form of protest","zh":"支持抵制（拒买/拒用/拒绝支持某人或某事）的一方；赞成用抵制来抗议"},"examples":[{"en":"Many students were pro-boycott and stopped buying products from the company.","zh":"许多学生支持抵制，停止购买那家公司的产品。"},{"en":"The group posted a pro-boycott message on social media.","zh":"该团体在社交媒体上发布了支持抵制的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or position that supports a boycott","zh":"支持抵制的人/团体；支持抵制的立场"},"examples":[{"en":"Pro-boycotts argued that the campaign would pressure the brand to change.","zh":"支持抵制的人认为这场行动会迫使品牌做出改变。"},{"en":"The debate included both pro-boycott and anti-boycott voices.","zh":"辩论中既有支持抵制的声音，也有反对抵制的声音。"}]}],"synonyms":["pro–boycott","in favor of a boycott","supporting the boycott","boycott-supporting"],"phonetic":"/ˌproʊ ˈbɔɪkɑt/","extraExplanation":["“pro-boycott”更常见的写法是带连字符的 pro-boycott，意思是“支持抵制”。也可写作 pro boycott（少见）或用更自然的表达：in favor of a boycott / supporting the boycott。","它通常出现在新闻、评论或社交媒体语境里，用来对立场进行快速分类（如 pro-boycott vs. anti-boycott）。使用时注意避免把它当作动词：一般不说 *to proboycott*。"]}
{"word":"probrick","summary":{"en":"“Probrick” is not a common dictionary word; it’s usually a name/label formed from “pro” + “brick,” and its meaning depends on context.","zh":"“Probrick”不是常见词典词汇；多为由“pro”+“brick”组合的名称/标签，含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word (often a brand name, username, or product label) that looks like it combines “pro” (professional) + “brick.” It is not a widely recognized dictionary word in general English, so its exact meaning depends on the context where you saw it (e.g., toys, construction materials, gaming, online handles).","zh":"一个非标准英语词（常见于品牌名、用户名或产品名称），看起来由“pro”（专业的）+“brick”（砖块/积木）组成。它不是通用英语词典里的常见词，因此具体含义要看使用场景（如玩具、建材、游戏或网络昵称）。"},"examples":[{"en":"I couldn’t find “Probrick” in a standard dictionary—do you mean a brand name for building blocks?","zh":"我在常见词典里找不到“Probrick”——你是指某种积木的品牌名吗？"},{"en":"The store sells Probrick sets that are compatible with other building bricks.","zh":"这家店卖的 Probrick 积木套装可以和其他积木兼容。"},{"en":"Probrick is the name of their online account, not an English vocabulary word.","zh":"Probrick 是他们的网络账号名，不是一个常见的英语词汇。"}]}],"synonyms":["(no standard synonyms; context-dependent)"],"phonetic":"ˈproʊ.brɪk","extraExplanation":["“pro-”在英语里常作前缀或口语缩写，表示“专业的/职业级的”（professional），也可能表示“支持……”（pro-environment = 支持环保）。把它和“brick”拼在一起（pro + brick）很像商标式造词，用来暗示“更专业的砖/积木”。","如果你能提供一句原文（你在哪里看到 probrick），我可以更准确判断它是品牌、拼写变体，还是某个圈子里的专用词（如乐高兼容积木、建材、游戏道具等）。"]}
{"word":"probridge","summary":{"en":"“ProBridge” is usually a brand/proper name; its meaning depends on the field and context.","zh":"“ProBridge”通常是品牌/专有名称，含义取决于所在领域与语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (often written “ProBridge”) used as a brand or product/service name; it is not a standard English dictionary word, so its exact meaning depends on the context (e.g., a company name, a software tool, or a dental/medical product name).","zh":"专有名词（常写作“ProBridge”）的品牌名或产品/服务名；它不是常见英语词典词汇，具体含义需要看语境（例如公司名、软件工具名，或牙科/医疗产品名）。"},"examples":[{"en":"Our clinic uses ProBridge for full-arch restoration cases.","zh":"我们诊所在全口/全弓修复病例中使用 ProBridge。"},{"en":"ProBridge is the platform they chose to connect suppliers and buyers.","zh":"他们选择 ProBridge 这个平台来连接供应商和买家。"}]}],"phonetic":"/proʊˈbrɪdʒ/","extraExplanation":["“pro-”在英语里常有“专业的/支持……的（pro-）”的含义，“bridge”是“桥/连接”。很多品牌会用这种构词让名字传达“专业连接、搭桥”的感觉，但这并不等于它在所有场景都有固定词义。","如果你能提供一句原文或它出现的领域（牙科、IT、公司名等），我可以帮你更准确地解释、翻译成自然中文，并给出更贴近语境的例句。"]}
{"word":"probroadcasting","summary":{"en":"“Probroadcasting” (more commonly “pro-broadcasting”) means supporting or favoring broadcasting.","zh":"“probroadcasting”（更常写作“pro-broadcasting”）指“支持或赞成广播（事业/政策）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring broadcasting (especially policies, institutions, or the expansion of broadcast media).","zh":"支持或赞成广播（尤指相关政策、机构或广播媒体扩张）的。"},"examples":[{"en":"The senator took a pro-broadcasting stance and pushed for funding for public radio.","zh":"这位参议员采取了亲广播的立场，并推动为公共广播电台提供资金。"},{"en":"Some community groups are pro-broadcasting, while others prefer online-only communication.","zh":"一些社区团体支持广播，而另一些更偏好只用线上沟通。"}]}],"synonyms":["in favor of broadcasting","supportive of broadcasting","pro-media","pro-radio","pro-TV"],"phonetic":"/ˌproʊˈbrɔdˌkæstɪŋ/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-environment, pro-choice）。因此 pro-broadcasting 通常理解为“亲广播/支持广播”。","这个词更常以带连字符的形式出现：pro-broadcasting。没有连字符的写法（probroadcasting）较少见，可能是排版或搜索关键词写法。","使用场景多见于政策讨论（频谱分配、公共媒体经费、监管）或媒体行业评论中。日常对话里更常说 “in favor of broadcasting / supportive of broadcasting”。"]}
{"word":"probudget","summary":{"en":"Pro-budget means supporting a budget proposal or favoring careful budgeting.","zh":"pro-budget 指支持某项预算方案，或倾向于严格、谨慎的预算管理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting (or voting in favor of) a proposed budget, especially in government or organizational politics","zh":"支持（或投票赞成）某项预算方案的，尤指政府或组织内部的政治语境"},"examples":[{"en":"Several pro-budget lawmakers said the plan would prevent a shutdown.","zh":"几位支持预算案的议员表示，这项方案将避免政府停摆。"},{"en":"The council’s pro-budget bloc pushed for a quicker vote.","zh":"市议会中支持预算案的阵营推动尽快表决。"}]},{"partOfSpeech":"adj.","definition":{"en":"in favor of strict budgeting or budget discipline (spending carefully and planning costs)","zh":"赞成严格预算管理/预算纪律的（强调谨慎支出与成本规划）"},"examples":[{"en":"She takes a pro-budget approach when managing the team’s travel costs.","zh":"她在管理团队差旅费用时采取偏向严格预算的做法。"},{"en":"The organization is pro-budget and avoids unplanned expenses.","zh":"该组织重视预算管理，尽量避免计划外开支。"}]}],"synonyms":["pro-budget","budget-supporting","in favor of the budget","fiscally responsible","budget-conscious"],"phonetic":"/proʊ ˈbʌdʒɪt/","extraExplanation":["“probudget”更常见的写法是带连字符的 **pro-budget**，表示“支持预算案的/亲预算的”。在新闻与政治报道里，常用来描述某些议员、阵营或投票立场（如 *pro-budget vote*）。","构词提示：**pro-** 表示“支持/赞成”（如 *pro-choice, pro-democracy*），与名词 *budget* 组合后形成形容词。实际写作中，作为定语放在名词前时更倾向用连字符：*pro-budget lawmakers*。"]}
{"word":"probudgeting","summary":{"en":"“Probudgeting” is an informal term meaning supportive of budgeting or promoting budgeting.","zh":"“probudgeting”是较非正式的说法，表示支持做预算或推广做预算。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting budgeting (the practice of planning how money will be spent); favoring careful financial planning.","zh":"支持做预算（规划如何花钱）；赞成谨慎的财务规划。"},"examples":[{"en":"Our team is pro-budgeting, so we track every expense each week.","zh":"我们团队支持做预算，所以每周都会记录每一笔开支。"},{"en":"A pro-budgeting mindset can help you save for emergencies.","zh":"支持做预算的心态能帮助你为紧急情况存钱。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or practice of promoting or encouraging budgeting (often used in social media, marketing, or personal-finance contexts).","zh":"推广或鼓励做预算的行为（常见于社交媒体、营销或个人理财语境）。"},"examples":[{"en":"Her blog is all about pro-budgeting—simple tools and clear goals.","zh":"她的博客主打“推广做预算”——工具简单、目标清晰。"},{"en":"The workshop focuses on pro-budgeting for students living on a tight budget.","zh":"这场工作坊聚焦于为预算紧张的学生推广做预算的方法。"}]}],"synonyms":["budget-conscious","pro-budget","financially disciplined","in favor of budgeting"],"phonetic":"/ˌproʊˈbʌdʒɪtɪŋ/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持、赞成”（如 pro-environment, pro-democracy）。因此 *probudgeting* 多半是把 pro- 和 budgeting 连在一起的非正式写法，常见于标签（hashtag）、社群用语或标题。更标准的写法通常是 **pro-budgeting**（加连字符）或 **pro budgeting**（分开写）。"]}
{"word":"probuilding","summary":{"en":"“Probuilding” (more commonly “pro-building”) means supporting construction and development, especially in housing or city planning contexts.","zh":"“Probuilding”（更常见写作“pro-building”）指支持建设与开发，常用于住房或城市规划语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Supporting or favoring construction and development (such as housing, infrastructure, or new projects).","zh":"（少见）支持或偏向建设与开发（如住房、基础设施或新项目）的。"},"examples":[{"en":"The mayor ran on a probuilding agenda to increase affordable housing.","zh":"市长以支持建设的政纲参选，以增加可负担住房。"},{"en":"Some residents worry that probuilding policies could change the neighborhood’s character.","zh":"一些居民担心支持建设的政策会改变社区风貌。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The idea or stance of being in favor of building and development.","zh":"（少见）“支持建设/开发”的立场或主张。"},"examples":[{"en":"In the debate, probuilding was framed as a way to lower rents by increasing supply.","zh":"在辩论中，“支持建设”被描述为通过增加供给来降低租金的方法。"}]}],"synonyms":["pro-building","pro-development","pro-construction","pro-housing"],"phonetic":"/ˌproʊˈbɪldɪŋ/","extraExplanation":["“probuilding”不是非常常见的标准词，更常见的写法是带连字符的“pro-building”，意思类似“pro-housing（支持建房）”“pro-development（支持开发）”。","在城市规划、住房政策或地方政治讨论中，人们用“pro-building / probuilding”来表达“倾向于多建、快建”的立场；相对的常见说法有“anti-development（反对开发）”或“growth-skeptical（对增长持怀疑态度）”。"]}
{"word":"probusiness","summary":{"en":"Pro-business means supportive of businesses or policies that help companies.","zh":"Pro-business 指“亲商的”，即支持企业或有利于企业的政策与环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or encouraging business activity, especially policies that reduce costs or regulation for companies.","zh":"支持或鼓励商业活动的；（尤指政策）倾向于降低企业成本或减少监管的。"},"examples":[{"en":"The mayor ran on a pro-business platform to attract new employers.","zh":"市长以亲商的政纲参选，以吸引新的雇主入驻。"},{"en":"Some critics say the tax cut is too pro-business and not helpful for workers.","zh":"一些批评者认为这项减税政策过于亲商，对工人帮助不大。"},{"en":"The city wants a pro-business environment, but it also plans to protect local neighborhoods.","zh":"这座城市希望营造亲商环境，但也计划保护本地社区。"}]}],"synonyms":["business-friendly","enterprise-friendly","market-friendly","pro-enterprise"],"phonetic":"/ˌproʊˈbɪznəs/","extraExplanation":["“pro-business”常带连字符（pro-business），也可写作不加连字符的“pro business”（较少见）。在新闻与政治语境里很常用，用来描述政府、政党、政策或整体氛围对企业较友好。","语气上通常是中性描述，但在不同立场的人口中可能带褒义（促进经济、就业）或贬义（偏向企业、忽视劳工/环保）。"]}
{"word":"probuying","summary":{"en":"Pro-buying means supporting or encouraging buying/purchasing.","zh":"Pro-buying 指“支持或鼓励购买/消费”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in favor of buying (something); supportive of purchasing or consumer spending","zh":"支持购买（某物）的；主张消费/购物的"},"examples":[{"en":"The campaign is strongly pro-buying and encourages people to shop locally.","zh":"这场宣传很“支持购买”，鼓励大家在本地商店购物。"},{"en":"Some policies are pro-buying because they give discounts or tax breaks to consumers.","zh":"有些政策偏向“支持购买”，因为它们给消费者折扣或减税。"}]}],"synonyms":["in favor of buying","supportive of purchasing","pro-spending","pro-consumption"],"phonetic":"/proʊ ˈbaɪɪŋ/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持、赞成”（如 pro-choice 支持选择权、pro-environment 支持环保）。因此 pro-buying 通常表示“主张购买/鼓励消费”。","probuying 连在一起更像是非正式写法；更常见的拼写是加连字符的 pro-buying。正式写作中也可以用 in favor of buying / supportive of purchasing 来表达。"]}

