{"word":"prod","summary":{"en":"Prod means to poke lightly, or to push/encourage someone to act; it can also be the noun for that poke or push.","zh":"Prod 指“轻戳/轻捅”，也可引申为“催促、推动某人行动”；也可作名词表示“那一下轻戳/推动”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to poke or jab someone or something lightly (often with a finger or a pointed object)","zh":"（用手指或尖物）轻戳；轻捅"},"examples":[{"en":"She prodded him in the shoulder to get his attention.","zh":"她轻戳了一下他的肩膀，好引起他的注意。"},{"en":"He prodded the fire with a stick to make it burn brighter.","zh":"他用树枝拨弄火堆，让火烧得更旺。"}]},{"partOfSpeech":"v.","definition":{"en":"to encourage or push someone to do something, especially by reminding, teasing, or applying pressure","zh":"敦促；推动（某人去做某事），常含“催促/激将”的意味"},"examples":[{"en":"I had to prod myself to start studying.","zh":"我得逼自己开始学习。"},{"en":"Her friends prodded her into applying for the job.","zh":"朋友们怂恿/催她去申请那份工作。"}]},{"partOfSpeech":"n.","definition":{"en":"a light poke or jab; a push meant to get attention or action","zh":"轻戳；轻捅；（为引起注意或促使行动的）一下推动"},"examples":[{"en":"He gave me a prod in the ribs and pointed at the stage.","zh":"他用胳膊肘轻顶了我一下肋部，并指了指舞台。"},{"en":"Sometimes all you need is a gentle prod to get started.","zh":"有时你只需要一点温和的推动就能开始。"}]}],"synonyms":["poke","jab","nudge","spur","urge","prompt"],"phonetic":"/prɑd/","extraExplanation":["“prod”最常见的画面感来自“赶牲口的刺棒/赶牛棒（prod）”，因此它既可以是“戳一下”，也常引申为“催促、推动（让人行动）”。在口语里常见搭配：prod someone into doing something（促使某人做某事）、need a prod（需要人推一把）。"]}
{"word":"prodatary","summary":{"en":"“Prodatary” is not a standard spelling; the correct word is “predatory,” meaning either “hunting for prey” or “exploiting others unfairly.”","zh":"“prodatary”不是标准拼写；正确应为“predatory”，意思可以是“捕食性的”，也可以引申为“掠夺/剥削性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled: predatory) Hunting and killing other animals for food; related to a predator.","zh":"（通常拼作：predatory）捕猎并以其他动物为食的；与“捕食者”有关的。"},"examples":[{"en":"Lions are predatory animals.","zh":"狮子是捕食性动物。"},{"en":"The owl’s predatory instincts help it hunt at night.","zh":"猫头鹰的捕食本能帮助它在夜间狩猎。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled: predatory) Seeking to exploit, harm, or take advantage of others in an unfair way.","zh":"（通常拼作：predatory）掠夺性的；（以不公平方式）剥削、伤害或占便宜的。"},"examples":[{"en":"The city is trying to stop predatory lending.","zh":"这座城市正努力打击掠夺性放贷。"},{"en":"She warned her friend about predatory behavior online.","zh":"她提醒朋友注意网络上的掠夺性行为。"}]}],"synonyms":["exploitative","aggressive","rapacious","preying","carnivorous"],"phonetic":"/ˈprɛdəˌtɔri/","extraExplanation":["你写的 **prodatary** 很可能是拼写错误；标准拼写是 **predatory**（常见错误包括把 e 写成 o，或把 -tory 写成 -tary）。","词源上与拉丁语 *praeda*（“猎物/战利品”）有关，所以既可指“捕食”，也常引申为“掠夺、剥削他人”。在新闻里常见搭配：**predatory lending**（掠夺性贷款/高利贷式放贷）。"]}
{"word":"prodd","summary":{"en":"“Prod” means to poke something to make it move or react, or to push/encourage someone to take action.","zh":"“Prod”指用手指或尖物戳/捅以让其移动或有反应，也可指催促、督促某人采取行动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to poke or push (someone or something) with a finger or a pointed object, often to make it move or react","zh":"（用手指或尖物）戳、捅、刺（某人或某物），常为让其移动或产生反应"},"examples":[{"en":"She prodded the sleeping dog gently with her foot.","zh":"她用脚轻轻戳了戳睡着的狗。"},{"en":"He prodded the ground with a stick to check if it was safe to step on.","zh":"他用棍子戳了戳地面，看看踩上去安不安全。"}]},{"partOfSpeech":"vt.","definition":{"en":"to encourage or pressure someone to do something (often by repeated reminders)","zh":"催促、督促（某人做某事），常指反复提醒或施压"},"examples":[{"en":"My friend prodded me to apply for the job.","zh":"朋友催我去申请那份工作。"},{"en":"The teacher had to prod the class to start working.","zh":"老师不得不督促全班开始学习。"}]},{"partOfSpeech":"n.","definition":{"en":"a poke or jab; a push intended to get a reaction","zh":"戳一下；捅一下；为了引起反应的推一下"},"examples":[{"en":"With a prod from his sister, he finally apologized.","zh":"在姐姐的“推一把”之下，他终于道歉了。"},{"en":"The cow moved after a quick prod.","zh":"牛被快速捅了一下后就动了。"}]}],"synonyms":["poke","jab","nudge","urge","prompt"],"phonetic":"/prɑd/","extraExplanation":["“prodd”本身不是常见标准拼写。你可能想输入的是 **prod**（原形），或 **prodded**（过去式/过去分词），或 **prodding**（动名词/现在分词）。","与“戳”有关的近义词小对比：**poke** 更口语、用手指戳；**jab** 更突然/更用力；**nudge** 更轻、更像“提醒一下/推一推”；**prod** 常带“为了让它动/让对方行动”的目的性。"]}
{"word":"prodded","summary":{"en":"“Prodded” means “poked” or “urged,” and it is the past form of “prod.”","zh":"“Prodded”表示“戳/捅”或“催促/推动”，是“prod”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “prod”: to poke or push someone/something with a finger or a pointed object, often to get a reaction or make it move","zh":"“prod”的过去式/过去分词：用手指或尖物戳、捅（某人/某物），常为引起反应或让它移动"},"examples":[{"en":"She prodded the sleeping dog gently to wake it up.","zh":"她轻轻戳了戳睡着的狗，把它叫醒。"},{"en":"He prodded the button with a pen tip.","zh":"他用笔尖捅了捅那个按钮。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “prod”: to encourage or push someone to do something (often after they were slow or unwilling)","zh":"“prod”的过去式/过去分词：催促、推动某人去做某事（常指对方拖延或不情愿）"},"examples":[{"en":"Her friends prodded her to apply for the job.","zh":"朋友们催她去申请那份工作。"},{"en":"The deadline prodded the team into working faster.","zh":"截止日期逼得团队加快了进度。"}]}],"synonyms":["poked","jabbed","nudged","prompted","urged"],"phonetic":"/ˈprɑdɪd/","extraExplanation":["“prod”既可以是字面上的“戳/捅”，也常引申为“催促/推动”。常见搭配：prod someone to do something（催某人做某事）、prod someone into doing something（逼/促使某人去做）。","语气上，“prod”比“encourage”更有“推动一下、催一催”的感觉；有时带一点不耐烦或外部压力，但不一定很强硬。"]}
{"word":"prodder","summary":{"en":"A prodder is either a person who pokes or pushes others to act, or a tool used for prodding.","zh":"prodder 指“用戳捅来推动/试探的人”，也可指“用来戳捅的工具”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who prods (pokes) someone or something, often to encourage action or to test whether something will move or work.","zh":"用戳、捅来推动或试探的人；常指催促别人行动或测试是否有反应的人。"},"examples":[{"en":"He’s a natural prodder—he keeps asking questions until the team makes a decision.","zh":"他天生爱“催促推动”——不停提问，直到团队做出决定。"},{"en":"The inspector acted like a prodder, checking every part to see what would fail first.","zh":"检查员像个“试探者”，逐一检查各个部件，看哪里会先出问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool used for prodding, such as a stick or a device used to poke animals or objects.","zh":"用来戳、捅的工具（如棍子，或用来驱赶动物/拨弄物体的器具）。"},"examples":[{"en":"The farmer carried a prodder to move the cattle gently.","zh":"农夫拿着一根赶牛用的戳棒，轻轻驱赶牛群。"},{"en":"Use a prodder to check the ground before you step in tall grass.","zh":"走进高草丛前，用探戳器先检查地面。"}]}],"synonyms":["poker","instigator","catalyst","goad","probe"],"phonetic":"/ˈprɑːdɚ/","extraExplanation":["“prodder”来自动词“prod”（戳、捅、催促）。在日常英语里，这个名词不算特别常用，更常见的说法是用动词：to prod someone into action（促使某人行动）。","在不同语境中，prodder可能带点语气：形容人时，有时暗示“爱催、爱逼问”；形容工具时则是中性描述。"]}
{"word":"prodders","summary":{"en":"“Prodders” usually means people who keep poking/nudging others to act, or tools used for prodding.","zh":"“prodders”通常指不停戳/催促别人行动的人，或用来戳捅的工具（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who prod (poke) someone or something, often to make it move, react, or do something.","zh":"“Prodder”的复数：指用戳、捅的方式推动他人/事物行动或产生反应的人。"},"examples":[{"en":"The prodders kept nudging the crowd forward, but it only made people annoyed.","zh":"那些不停“戳着催促”的人想把人群往前推，但只让大家更烦。"},{"en":"In the workshop, the prodders tested the machine’s sensors by poking different parts.","zh":"在车间里，测试人员通过戳不同部位来测试机器的传感器。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools or objects used for prodding; poking instruments.","zh":"用于戳、捅、拨的工具或物件。"},"examples":[{"en":"The farmhands carried long prodders to guide the cattle.","zh":"农场工人拿着长杆工具来引导牛群。"},{"en":"Be careful with those prodders near the wires.","zh":"那些戳捅工具靠近电线时要小心。"}]}],"synonyms":["pesters","nudgers","pokers","goaders","prodding tools"],"phonetic":"/ˈprɑdərz/","extraExplanation":["“prodders”来自动词 prod（戳、捅、推动），加上表示“做某事的人/物”的后缀 -er，再变为复数 -s。","语气上，形容人是“prodders”时有时带一点负面色彩：暗示对方老是催、逼、戳你去做事（类似 nag / push）。"]}
{"word":"prodding","summary":{"en":"Prodding means poking physically or urging someone to act, often with some pressure.","zh":"Prodding 指“戳/捅一下”或“催促某人行动”，通常带点施压意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of poking someone or something with a finger or a pointed object (or a push meant to make something move)","zh":"戳、捅、刺（用手指或尖物轻推/捅一下；也可指为了让东西动起来而推一下）"},"examples":[{"en":"The horse moved forward after a gentle prodding.","zh":"马被轻轻一捅就往前走了。"},{"en":"Stop your prodding—it hurts.","zh":"别再戳我了，会疼。"}]},{"partOfSpeech":"n.","definition":{"en":"repeated urging or pressure to make someone do something; encouragement that feels like being pushed","zh":"催促；敦促（带点“被推着做”的感觉）"},"examples":[{"en":"With a little prodding from her friends, she applied for the job.","zh":"在朋友们的几句催促下，她去申请了那份工作。"},{"en":"He needed constant prodding to finish his homework.","zh":"他需要不断催促才能把作业做完。"}]},{"partOfSpeech":"adj.","definition":{"en":"poking or urging (describing an action happening now or repeatedly)","zh":"正在戳/捅的；催促的（用于描述动作或行为方式）"},"examples":[{"en":"She kept prodding him to speak up.","zh":"她一直催他把话说出来。"},{"en":"The reporter asked prodding questions.","zh":"记者问了一些步步紧逼的问题。"}]}],"synonyms":["poking","nudging","urging","prompting","pressuring"],"phonetic":"/ˈprɑdɪŋ/","extraExplanation":["“prodding”来自动词“prod”（戳、捅、催促）。它既可以表示实际的“戳一下”，也常用来比喻“推动/催促某人行动”。语气上通常带有一点不耐烦或施压的感觉（比“encouragement”更强）。"]}
{"word":"proddle","summary":{"en":"Proddle means to poke or prod repeatedly, or to fuss/potter about doing small things (a less common, dialect-flavored word).","zh":"Proddle 指反复戳/捅/拨弄，或指东摸西弄、瞎忙（较少见，带方言口语色彩）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to poke or prod (someone or something), often repeatedly or in a fussy way","zh":"（常带“反复、爱摆弄”的感觉）戳、捅、拨弄（某人或某物）"},"examples":[{"en":"He proddled the soil with a stick to see if it was wet underneath.","zh":"他用一根棍子不停地拨弄土，想看看下面是不是湿的。"},{"en":"Stop proddling me—I’m trying to concentrate.","zh":"别老戳我——我在集中注意力。"}]},{"partOfSpeech":"vi.","definition":{"en":"to fuss around; to potter about doing small, unimportant tasks (often used with “about/around”)","zh":"（常与 about/around 连用）瞎忙、东摸西弄（做些琐碎、不重要的事）"},"examples":[{"en":"She spent the morning proddling about in the kitchen, tidying little things.","zh":"她一上午都在厨房里东摸西弄，收拾些小东西。"},{"en":"I was just proddling around online, not really looking for anything.","zh":"我只是随便在网上乱逛，并没真要找什么。"}]}],"synonyms":["prod","poke","nudge","fiddle (with)","potter about","mess around"],"phonetic":"/ˈprɑdəl/","extraExplanation":["“proddle”比较少见，带有英式方言/口语色彩（在英国北部、苏格兰或爱尔兰语境里更可能见到）。在标准英语里更常用的是“prod”（戳、捅）或“poke”。","它常给人一种“反复拨弄、带点烦人/琐碎”的语气：不只是碰一下，而是持续地戳、摆弄，或漫无目的地忙来忙去。"]}
{"word":"prodecoration","summary":{"en":"“Prodecoration” is not standard English; it is likely a misspelling (often of “decoration” or “redecoration”).","zh":"“prodecoration”不是标准英语词；多半是拼写错误（常见是把“decoration”或“redecoration”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a very rare/nontechnical coinage. In ordinary dictionaries you will not find a fixed meaning for “prodecoration.”","zh":"不是标准英语词；很可能是拼写错误或非常少见/非正式的自造词。一般词典里没有“prodecoration”的固定释义。"},"examples":[{"en":"I couldn’t find “prodecoration” in a dictionary—did you mean “decoration” or “redecoration”?","zh":"我在词典里找不到“prodecoration”——你是想写“decoration（装饰）”还是“redecoration（重新装修/重新布置）”？"},{"en":"Please check the spelling of “prodecoration” in your notes.","zh":"请检查你笔记里“prodecoration”的拼写。"}]}],"synonyms":["decoration","redecoration","decorating"],"phonetic":"/ˌproʊdɛkəˈreɪʃən/","extraExplanation":["“pro-”通常表示“支持/赞成”（如 pro-democracy 亲民主），或在少数词里表示“前/在……之前”（多见于拉丁来源的构词）。但“prodecoration”并不是常见的“pro- + decoration”的固定搭配。","如果你想表达“为装饰做准备/用于装饰”，更自然的说法是：decorating supplies（装饰用品）、decorations for the event（活动装饰）、pre-decoration planning（装饰前的规划）。","如果你告诉我这词出现的句子/领域（比如室内设计、活动布置、统计学等），我可以帮你判断最可能的正确词（常见候选：decoration, redecoration, predication, procrastination, procurement 等）。"]}
{"word":"prodefault","summary":{"en":"“Prodefault” (usually “pro-default”) describes support for debt default or policies that make default more likely.","zh":"“prodefault”（通常写作“pro-default”）指支持债务违约或倾向于让违约更可能发生的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually written “pro-default”) favoring or supporting a borrower’s decision to default (not pay back a debt), or favoring a policy outcome where default happens.","zh":"（罕见；通常写作“pro-default”）支持或倾向于“违约”（不偿还债务）的立场；或指政策选择上更倾向让违约发生。"},"examples":[{"en":"Some critics called the proposal pro-default because it encouraged the government to stop paying its debts.","zh":"一些批评者称该提案为“支持违约”，因为它鼓励政府停止偿债。"},{"en":"Investors worried that a pro-default faction might gain influence and raise the risk of missed payments.","zh":"投资者担心“倾向违约”的派别可能影响力上升，从而提高拖欠付款的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A person, group, or argument that supports default.","zh":"（极罕见）支持违约的人、团体或观点。"},"examples":[{"en":"In the debate, he was labeled a prodefault by his opponents.","zh":"在辩论中，他被对手贴上“支持违约者”的标签。"}]}],"synonyms":["pro-default","favoring default","supporting default"],"phonetic":"/ˌproʊ dɪˈfɔlt/","extraExplanation":["“prodefault”不是常见词，更多见于新闻评论、金融/政治争论语境；写作上更标准的是带连字符的“pro-default”。","这里的 pro- 表示“支持/赞成”（如 pro-choice），default 指“债务违约/未履行付款义务”。","注意它常带评价色彩，可能用于批评对方立场；正式写作中可改用更中性的说法，如 “supporting default” 或 “favoring default.”"]}
{"word":"prodefiance","summary":{"en":"“Prodefiance” means supporting or advocating defiance—encouraging resistance to rules, authority, or pressure.","zh":"“prodefiance”指支持或鼓吹“反抗/不服从”的立场或态度，即鼓励对规则、权威或压力进行抵制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring defiance (refusing to obey rules, authority, or pressure); pro-defiance.","zh":"支持或赞成“反抗/不服从”的；主张挑战权威或规则的。"},"examples":[{"en":"The slogan sounded prodefiance, urging people to resist unfair rules.","zh":"这句口号带有“支持反抗”的意味，鼓励人们抵制不公平的规定。"},{"en":"Some readers saw the novel as prodefiance because the hero refuses to be controlled.","zh":"有些读者认为这部小说“偏向赞成反抗”，因为主角拒绝被控制。"}]},{"partOfSpeech":"n.","definition":{"en":"the stance or attitude of supporting defiance; advocacy of resisting authority or pressure.","zh":"支持反抗的立场或态度；鼓吹对权威或压力进行抵制。"},"examples":[{"en":"Her speech was framed as prodefiance, not as a call for violence.","zh":"她的演讲被表述为“支持反抗的立场”，而不是号召暴力。"},{"en":"The article argues that prodefiance can be healthy when it challenges injustice.","zh":"这篇文章认为，当反抗用来挑战不公时，“支持反抗”可能是健康的。"}]}],"synonyms":["pro-defiance","in favor of defiance","supportive of resistance","defiance-supporting","anti-authority (context-dependent)"],"phonetic":"/ˌproʊdɪˈfaɪəns/","extraExplanation":["“prodefiance”并不是非常常见的标准词，更常见的写法是带连字符的 **pro-defiance**，或用更自然的表达：**in favor of defiance / supportive of defiance / encouraging resistance**。","构词上：**pro-** 表示“支持、赞成”（如 pro-democracy），**defiance** 表示“反抗、不服从”。因此它通常用于评论某种言论、作品或立场是否“鼓励反抗”。","语气提醒：在不同语境里它可能带褒义（反抗不公）或贬义（煽动对抗）。写作时可加上对象以更清晰：prodefiance of what/who（对谁/什么的反抗）。"]}
{"word":"prodelay","summary":{"en":"“Prodelay” is not a standard word; it usually means “pro-delay” (favoring delay) or is a misspelling of “prolonged delay.”","zh":"“prodelay”不是标准单词；通常指“pro-delay”（支持延迟）或是“prolonged delay（长期延误）”的误写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A nonstandard or rare form, usually written as “pro-delay,” meaning “in favor of delaying” or “supporting a delay.”","zh":"非标准或少见写法，通常写作“pro-delay”，意思是“支持延迟/主张拖延的”。"},"examples":[{"en":"The committee took a pro-delay position and asked for more time to review the plan.","zh":"委员会采取了支持延迟的立场，要求更多时间来审查该计划。"},{"en":"Some voters were pro-delay because they wanted more public discussion.","zh":"一些选民支持延迟，因为他们希望有更多公众讨论。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or informal shorthand for “prolonged delay” (a long delay).","zh":"可能是“prolonged delay（长期延误）”的拼写错误或非正式简写。"},"examples":[{"en":"There was a prolonged delay due to bad weather.","zh":"由于恶劣天气，出现了长期延误。"},{"en":"We apologize for the prolonged delay in shipping your order.","zh":"对于您订单发货的长期延误，我们深表歉意。"}]}],"synonyms":["in favor of postponement","pro-postponement","delay-friendly","prolonged delay"],"phonetic":"/ˌproʊ dɪˈleɪ/","extraExplanation":["“prodelay”不是常见标准英语单词；更自然的写法通常是“pro-delay”（带连字符）来表示“倾向于延迟/支持延期”的立场。","如果你是在邮件、公告或客服语境里看到它，也可能只是把“prolonged delay（长期延误）”写错或缩写了。想更准确，需要看原句上下文。"]}
{"word":"prodelision","summary":{"en":"Prodelision is the loss of an initial sound (often a vowel) at the start of a word, typically in connected speech or poetry.","zh":"Prodelision 指词首音（常为元音）在连读或诗歌中被省略的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(linguistics, phonetics) The omission of a sound (often a vowel) at the beginning of a word, usually because the preceding word ends in a vowel, so the two words flow together more smoothly.","zh":"（语言学/语音学）省略词首的一个音（常为元音），通常发生在前一个词以元音结尾时，使两词连读更顺畅。"},"examples":[{"en":"In some poetic traditions, prodelision can make a line fit the meter by dropping an initial vowel.","zh":"在某些诗歌传统中，prodelision 可以通过省略词首元音来让诗行符合格律。"},{"en":"A teacher might point out prodelision when explaining how connected speech can reduce sounds in fast reading.","zh":"老师讲解快速朗读中的连读弱化时，可能会提到 prodelision。"}]}],"synonyms":["initial elision","apheresis (related term)"],"phonetic":"/ˌproʊdɪˈlɪʒən/","extraExplanation":["该词主要用于描述某些语言（尤其是古典语言研究、诗歌格律分析）里的“词首脱落”现象，和更常见的 elision（省音）是同一大类，但强调的是“发生在词首（pro-）”。","常见相关概念：apheresis（去头音/词首脱落，较宽泛的术语）、syncope（词中省音）、apocope（词尾省音）。不同书籍对这些术语的划分可能略有差异。"]}
{"word":"prodemocracy","summary":{"en":"Prodemocracy means supporting democracy or democratic reforms.","zh":"prodemocracy 指支持民主或民主改革的（亲民主的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or promoting democracy (a system where people choose leaders through fair elections and have basic rights).","zh":"支持或推动民主（人民通过公平选举选出领导人并享有基本权利的制度）的。"},"examples":[{"en":"Many prodemocracy groups called for free and fair elections.","zh":"许多亲民主团体呼吁举行自由、公正的选举。"},{"en":"She joined a prodemocracy rally to support political reform.","zh":"她参加了一场亲民主集会，以支持政治改革。"}]}],"synonyms":["pro-democracy","democracy-supporting","in favor of democratic reforms"],"phonetic":"/ˌproʊ.dɪˈmɑː.krə.si/","extraExplanation":["“pro-”是常见前缀，意思是“支持、赞成”。因此 prodemocracy = pro- + democracy。类似表达还有 pro-choice（支持选择权）、pro-environment（支持环保）。","在新闻与社会议题语境中，prodemocracy 常用来描述立场或运动（prodemocracy activists / protests / movement）。也可写作 pro-democracy（加连字符），两种写法都常见。","使用时注意语气与立场：它是政治取向用语，可能带有评价色彩；在正式写作中可根据需要改用更中性的说法，如 “in favor of democratic reforms”（支持民主改革）。"]}
{"word":"prodemocrat","summary":{"en":"Pro-democrat means supporting democracy or a movement for democracy; it can also mean a person who supports democracy.","zh":"pro-democrat 指“亲民主的/支持民主的”，也可指“亲民主人士”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting democratic government, democratic values, or a political movement that promotes democracy","zh":"支持民主政体、民主价值观，或支持推动民主的政治运动"},"examples":[{"en":"The group organized a pro-democrat rally calling for free elections.","zh":"该团体组织了一场亲民主集会，呼吁自由选举。"},{"en":"Many students shared pro-democrat messages on social media.","zh":"许多学生在社交媒体上分享亲民主的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports democracy or pro-democracy political changes","zh":"支持民主（或支持推动民主改革）的人"},"examples":[{"en":"Pro-democrats and government supporters held separate demonstrations.","zh":"亲民主人士与政府支持者分别举行了示威活动。"},{"en":"She was known as a pro-democrat in local politics.","zh":"她在地方政治中被认为是亲民主人士。"}]}],"synonyms":["pro-democracy","democracy-supporting","pro-democratic"],"phonetic":"/ˌproʊ ˈdɛməkˌræt/","extraExplanation":["“prodemocrat”更常见的写法是“pro-democrat”（加连字符），表示“亲……的/支持……的”。在新闻里也常见复数“pro-democrats”指“亲民主阵营/人士”。","它与“Democrat”（美国民主党成员）不是一回事：Democrat=民主党人；pro-democrat/pro-democracy=支持民主制度或民主运动（不特指美国政党）。","更普遍、跨语境的表达是“pro-democracy”（亲民主），例如“pro-democracy protesters（亲民主示威者）”。"]}
{"word":"prodemocratic","summary":{"en":"Prodemocratic means supporting democracy or democratic reforms.","zh":"prodemocratic 指“支持民主或民主改革的、亲民主的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting democracy or democratic reforms; favoring a political system where people choose leaders through free and fair elections.","zh":"支持民主或民主改革的；主张通过自由、公平选举由人民选择领导人的政治制度的。"},"examples":[{"en":"The group organized prodemocratic rallies calling for free elections.","zh":"该团体组织了亲民主集会，呼吁举行自由选举。"},{"en":"She wrote prodemocratic articles criticizing government censorship.","zh":"她撰写亲民主文章，批评政府审查制度。"},{"en":"Prodemocratic activists demanded greater transparency and accountability.","zh":"亲民主人士要求更高程度的透明度与问责。"}]}],"synonyms":["pro-democracy","democratic","in favor of democracy","pro-reform"],"phonetic":"/ˌproʊˌdɛməˈkrætɪk/","extraExplanation":["“prodemocratic”也常写作“pro-democratic”。是否加连字符取决于写作风格指南；在新闻与学术写作中两种都常见。","在政治语境中，它通常用来描述“立场/阵营/运动”，而不是一个具体政党名称；使用时要注意中立表达（如“prodemocracy / pro-democracy movement”也常见）。"]}
{"word":"prodenia","summary":{"en":"“Prodenia” is not recognized as a standard English word; it’s probably a misspelling or a proper name.","zh":"“prodenia”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name (proper noun).","zh":"不是标准英语单词，可能是拼写错误或专有名词（名字/地名等）。"},"examples":[{"en":"I couldn’t find “prodenia” in an English dictionary—could you check the spelling?","zh":"我在英语词典里查不到“prodenia”——你能确认一下拼写吗？"},{"en":"If you meant “provenance,” it refers to where something comes from.","zh":"如果你想写的是“provenance”，它指“某物的来源/出处”。"}]}],"extraExplanation":["“prodenia”很可能是拼写误差。你可以告诉我：①你看到它的句子/上下文；②它可能来自哪个领域（医学、游戏、品牌、人名/地名等）；③你想表达的中文意思。这样我能更准确判断你真正想查的词。","可能的接近拼写（仅供参考）：provenance（来源/出处）、protein（蛋白质）、prodigy（天才/神童）、propose（提议）、prodenia 也可能是某个产品/用户名/地名的拼法。"]}
{"word":"prodenominational","summary":{"en":"Prodenominational means supporting or favoring religious denominations, especially in how institutions are organized.","zh":"prodenominational 指支持或偏向宗派（教派）立场，常用于讨论机构是否应按宗派来组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Favoring or supporting religious denominations (separate organized groups within a religion), especially the idea that institutions (like schools or churches) should be organized by denomination.","zh":"支持或偏向“宗派”（同一宗教内部的不同组织/教派），尤指主张学校、教会等机构应按宗派来组织。"},"examples":[{"en":"Some politicians took a prodenominational stance and argued for funding denominational schools.","zh":"一些政治人物采取亲宗派立场，主张资助宗派学校。"},{"en":"Her prodenominational views shaped how she imagined community services through local churches.","zh":"她的亲宗派观点影响了她对社区服务应通过地方教会来开展的设想。"}]}],"synonyms":["pro-denominational","denominationalist","sectarian (context-dependent)"],"phonetic":"/ˌproʊˌdɪˌnɑməˈneɪʃənəl/","extraExplanation":["这个词比较少见，常出现在讨论宗教与公共政策（例如教育经费、学校性质、教会在公共生活中的角色）时。","denominational 指“宗派的/宗派学校的”，pro- 表示“支持/赞成”。因此 prodenominational 通常带有“赞成宗派化安排”的意思，语气取决于语境。","在一些语境里也可能与 anti-denominational（反宗派的）对比，用来描述对宗派差异的态度。"]}
{"word":"prodentine","summary":{"en":"Predentin is the newly formed, unmineralized layer that later becomes dentin.","zh":"前期牙本质是新生成但尚未矿化的一层组织，之后会矿化成为牙本质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry/Anatomy) The soft, unmineralized layer of dentin that is newly formed by odontoblasts and later hardens (mineralizes) to become dentin.","zh":"（牙科／解剖）前期牙本质：由成牙本质细胞生成、尚未矿化的柔软牙本质层，之后会逐渐矿化变硬成为牙本质。"},"examples":[{"en":"Under the microscope, you can see a thin band of predentin next to the pulp.","zh":"在显微镜下，你可以看到靠近牙髓处有一条薄薄的前期牙本质带。"},{"en":"Problems with mineralization may cause predentin to remain thicker than normal.","zh":"矿化过程出现问题时，前期牙本质可能会比正常更厚。"}]}],"synonyms":["predentine","unmineralized dentin"],"phonetic":"/priːˈdɛn.tɪn/","extraExplanation":["“prodentine”不是常见的标准英文术语；你可能想写的是 **predentin**（美式拼法）或 **predentine**（英式拼法）。在牙科语境里两者指同一个概念：未矿化、后来会变硬的那一层牙本质前体。"]}
{"word":"prodeportation","summary":{"en":"“Pro-deportation” describes a stance that supports deporting non-citizens.","zh":"“Pro-deportation”指支持将非公民遣返/驱逐出境的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the deportation (forced removal) of non-citizens from a country","zh":"支持或赞成将非公民（通常指移民）遣返/驱逐出境（强制离境）"},"examples":[{"en":"Some voters described themselves as pro-deportation after a rise in border crossings.","zh":"在越境人数上升后，一些选民称自己是“支持遣返/驱逐出境”的。"},{"en":"The group’s pro-deportation stance drew strong criticism from immigrant-rights advocates.","zh":"该团体支持遣返/驱逐出境的立场遭到移民权利倡导者的强烈批评。"}]}],"synonyms":["in favor of deportation","pro-removal","supporting deportation policies"],"phonetic":"/ˌproʊˌdipɔrˈteɪʃən/","extraExplanation":["“pro-”是常见前缀，表示“支持/赞成”（如 pro-choice, pro-democracy）。因此 pro-deportation 通常写作 pro-deportation（带连字符），比不带连字符的 prodeportation 更常见。","这是政治与公共议题语境中的立场词，使用时要注意受众与语气：它往往带有强烈价值判断，可能被认为对移民群体不友善。中性写法可用 “in favor of deportation policies”（支持遣返政策）或更具体地说明支持哪类遣返（如针对犯罪记录者）。"]}
{"word":"prodespotic","summary":{"en":"“Prodespotic” means favoring or supporting despotic (absolute, tyrannical) rule.","zh":"“prodespotic”指支持或偏好专制（绝对权力、强权）统治。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring despotic rule (government controlled by a despot with absolute power).","zh":"支持或偏好专制统治的（由拥有绝对权力的统治者控制的政体）。"},"examples":[{"en":"Some critics called the new security law prodespotic because it concentrated power in the executive.","zh":"一些评论者称这项新的安全法是“亲专制”的，因为它把权力集中到了行政部门手中。"},{"en":"The writer warned that prodespotic attitudes can grow when people feel afraid and want quick solutions.","zh":"这位作者警告说，当人们感到恐惧、想要快速解决方案时，“亲专制”的态度可能会滋长。"}]}],"synonyms":["pro-authoritarian","pro-tyrannical","anti-democratic","autocratic"],"phonetic":"/ˌproʊdɛˈspɑtɪk/","extraExplanation":["这个词较少见，常出现在政治评论或学术写作中，语气多为批评。","词形结构是 pro-（支持、赞成）+ despotic（专制的）。despotic 来自“despot（专制统治者）”。","用法上可修饰“policies/ideas/attitudes/regime（政策/观念/态度/政权）”，常与反义词 anti-authoritarian（反威权）或 democratic（民主的）形成对比。"]}
{"word":"prodespotism","summary":{"en":"Prodespotism means supporting or favoring despotism (absolute, authoritarian rule).","zh":"prodespotism 指支持或倾向于专制统治（个人绝对权力的威权统治）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for, approval of, or advocacy of despotism (rule by a single leader with absolute power).","zh":"支持、赞成或鼓吹专制统治（由个人掌握绝对权力的统治）。"},"examples":[{"en":"The writer accused the party of prodespotism and hostility to democratic reforms.","zh":"作者指责该党崇尚专制，并敌视民主改革。"},{"en":"Many citizens feared that the new security law was a step toward prodespotism.","zh":"许多民众担心新的安全法是在向专制倾斜的一步。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing ideas, policies, or people that favor despotism.","zh":"（较少见）形容支持专制的观点、政策或人。"},"examples":[{"en":"He criticized the minister’s prodespotism rhetoric in the speech.","zh":"他批评那位部长在演讲中流露出的亲专制言论。"}]}],"synonyms":["pro-authoritarianism","anti-democratic stance","support for dictatorship"],"phonetic":"/ˌproʊˈdɛspəˌtɪzəm/","extraExplanation":["“pro-”是英语常见前缀，表示“支持、赞成”（如 pro-democracy 亲民主，pro-choice 支持选择权）。因此 prodespotism 多见于政治评论或学术写作里，也常写作 pro-despotism（加连字符）以便阅读。","despotism 通常带强烈贬义，暗示权力不受约束、缺乏法治与公民权利。使用该词时往往是在批评某种政治倾向。"]}
{"word":"prodialogue","summary":{"en":"“Prodialogue” is a rare term for an introductory dialogue before the main story; in most cases, people actually mean “prologue.”","zh":"“Prodialogue”较罕见，可指作品开头用于铺垫背景的“开场对话”；多数情况下更常见、标准的表达是“prologue（序幕／序言）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) An introductory dialogue—spoken lines placed before the main action of a play, film, or story to set context.","zh":"（罕见）“开场对话／序幕对话”——在戏剧、电影或故事的主要情节开始前，用对话形式交代背景或铺垫。"},"examples":[{"en":"The playwright uses a prodialogue to explain the family conflict before the first scene.","zh":"剧作家用一段开场对话，在第一幕前交代家庭矛盾。"},{"en":"In some older dramatic styles, a prodialogue addresses the audience directly.","zh":"在一些较古老的戏剧风格中，开场对话会直接对观众说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sometimes used loosely, often mistaken) A prologue; an introduction to a literary or dramatic work.","zh":"（有时被宽泛使用、也常被误写）指“序言／序幕”（prologue），即文学或戏剧作品的开端引介。"},"examples":[{"en":"If you mean an opening section, the more common word is “prologue,” not “prodialogue.”","zh":"如果你指作品的开头部分，更常用的词是“prologue”，而不是“prodialogue。”"}]}],"synonyms":["prologue","opening dialogue","introductory dialogue","preface (for books)"],"phonetic":"/ˌproʊˈdaɪəˌlɔɡ/","extraExplanation":["“prodialogue”并不是现代英语里常见、规范的词；在多数写作与出版场景中，人们通常用 **prologue**（序幕／序言）来表达“开头的引介部分”。","如果你想强调“用对话来开场”，更自然的说法包括：**opening dialogue**, **introductory dialogue**, 或在戏剧语境中用 **prologue (in dialogue form)**。"]}
{"word":"prodigal","summary":{"en":"Prodigal means wasteful with money or resources, and it also appears in the famous biblical phrase “the prodigal son,” referring to someone who returns after going astray.","zh":"prodigal 常指对金钱或资源“挥霍的、浪费的”；也常见于圣经典故“the prodigal son（浪子回头）”，指离家走偏后又回归的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wasteful and careless with money or resources; spending more than is sensible.","zh":"挥霍的；浪费的（对金钱或资源不节制）"},"examples":[{"en":"He was prodigal with his earnings and soon ran out of money.","zh":"他对收入很挥霍，很快就把钱花光了。"},{"en":"The company was criticized for its prodigal use of water during the drought.","zh":"这家公司在干旱期间仍大量用水，被批评太浪费。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/Biblical) Related to someone who leaves home and returns after making mistakes, especially in the phrase “the prodigal son.”","zh":"（文学/圣经）指离家后犯错、最终回归的人；常见于短语“浪子回头”（the prodigal son）"},"examples":[{"en":"After years abroad, she returned home like the prodigal child.","zh":"在国外多年后，她像“浪子回头”的孩子一样回到了家。"},{"en":"The novel tells a modern version of the prodigal son story.","zh":"这部小说讲了一个现代版的“浪子回头”的故事。"}]}],"synonyms":["wasteful","extravagant","spendthrift","profligate"],"phonetic":"/ˈprɑdɪɡəl/","extraExplanation":["“prodigal”最常见的文化来源是《圣经·路加福音》里的“the Prodigal Son（浪子回头/失而复得的儿子）”。故事强调宽恕与回归，因此在英语里“prodigal”有时带有“离家又归来”的文学色彩。","词源来自拉丁语，核心含义与“挥霍、耗费”有关。日常英语里更常用的同义表达是“wasteful / spendthrift（挥霍的）”，而“prodigal son”作为固定文化典故出现频率很高。","搭配提示：常见结构是“prodigal with + money/time/resources（在……方面很挥霍/不节制）”。"]}
{"word":"prodigalish","summary":{"en":"“Prodigalish” means “somewhat prodigal”—a bit wasteful or extravagant (informal/nonstandard).","zh":"“prodigalish”表示“有点挥霍/有点奢侈”，属于较口语、非标准用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like a prodigal person; a bit wasteful with money or resources (not a standard dictionary word, but understandable in context).","zh":"有点像“挥霍的人”；略显浪费（金钱或资源）（不是标准词典词，但在语境中容易理解）。"},"examples":[{"en":"His prodigalish spending worried his friends, even though he wasn’t completely reckless.","zh":"他那种有点挥霍的花钱方式让朋友们担心，尽管他并不算彻底鲁莽。"},{"en":"After the promotion, she became prodigalish with gifts for her team.","zh":"升职后，她给团队买礼物时有点大手大脚。"}]}],"synonyms":["somewhat prodigal","a bit wasteful","a little extravagant","spendthrift-ish"],"phonetic":"/prɑːˈdɪɡəlɪʃ/","extraExplanation":["“prodigalish”通常是把形容词 prodigal（挥霍的）加上后缀 -ish 造出来的临时用法，表达“有点/带点……的感觉”，语气更弱、更委婉，常见于口语或非正式写作。","prodigal 最常见的文化联想来自《圣经》里的“浪子回头”（the Prodigal Son），其中 prodigal 强调“挥霍、浪费”，而不是“离家出走”本身。用 prodigalish 时也可能借这种典故的影子，但核心仍是“略显挥霍”。","在正式写作里，更自然的替代说法有: somewhat prodigal / a bit wasteful / a little extravagant。"]}
{"word":"prodigalism","summary":{"en":"Prodigalism means wasteful, extravagant spending or use of resources.","zh":"prodigalism 指挥霍无度、奢侈浪费的行为或习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit of spending money or resources in a wasteful, extravagant way; reckless extravagance.","zh":"挥霍无度；奢侈浪费（花钱或使用资源非常大手大脚、不节制）。"},"examples":[{"en":"His prodigalism left him in debt by the end of the year.","zh":"他的挥霍无度让他年底时负债累累。"},{"en":"The company tried to reduce prodigalism by cutting unnecessary travel and entertainment costs.","zh":"公司通过削减不必要的差旅和招待费用来减少浪费。"},{"en":"She warned that prodigalism can feel exciting at first, but it often brings stress later.","zh":"她提醒说，挥霍无度一开始可能很刺激，但后来往往会带来压力。"}]}],"synonyms":["extravagance","wastefulness","profligacy","squandering"],"phonetic":"/prəˈdɪɡəlˌɪzəm/","extraExplanation":["“prodigalism”来自形容词“prodigal”（挥霍的）。它也常让人联想到《圣经》里的“The Prodigal Son（浪子回头）”故事：儿子挥霍家产，后来悔改回家。因此在文化语境中，prodigal有时带有“浪子/败家子”的联想，但“prodigalism”更侧重“挥霍这种行为或习惯”。"]}
{"word":"prodigalities","summary":{"en":"“Prodigalities” means multiple acts or instances of wasteful, extravagant spending or use of resources.","zh":"“prodigalities”指多次或多种“挥霍、浪费”的行为或例子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wasteful or reckless spending; extravagant use of money or resources (plural: individual acts or examples of such wastefulness).","zh":"挥霍；浪费（复数：指多次/多种具体的挥霍行为或例子）。"},"examples":[{"en":"The audit uncovered years of prodigalities in the department’s travel budget.","zh":"审计发现该部门差旅预算多年来一直存在挥霍现象。"},{"en":"She looked back on her youth with regret for her prodigalities.","zh":"她回想年轻时的挥霍，感到后悔。"}]}],"synonyms":["extravagances","wastefulness","profligacy","squandering"],"phonetic":"/ˌprɑːdɪˈɡælɪtiz/","extraExplanation":["“prodigalities”是名词“prodigality”的复数形式，语气偏正式，常见于书面语（新闻、评论、文学）。","它与《圣经》中“浪子回头”（the Prodigal Son）的文化意象有关：prodigal 常用来形容“挥霍的、放荡不羁的”，但现代英语里最核心的含义仍是“浪费金钱/资源”。","使用上：prodigality 可作不可数名词表示总体“挥霍”，而 prodigalities 多强调“多次/多种具体的挥霍行为”。"]}
{"word":"prodigality","summary":{"en":"Prodigality means extravagant, often wasteful spending.","zh":"Prodigality 指奢侈挥霍、常带浪费意味的花费方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of spending money or resources freely, often in a wasteful way; extravagance","zh":"挥霍；奢侈浪费（指花钱或使用资源过度、常带有浪费意味）"},"examples":[{"en":"The family’s prodigality left them in debt within a year.","zh":"这家人的挥霍让他们在一年之内就负债了。"},{"en":"He regretted his prodigality after seeing his savings disappear.","zh":"看到存款一点点消失后，他后悔自己曾经挥霍。"},{"en":"In the story, her prodigality contrasts with her sister’s careful budgeting.","zh":"在故事里，她的挥霍与姐姐精打细算形成对比。"}]}],"synonyms":["extravagance","wastefulness","lavishness","spendthriftiness"],"phonetic":"/ˌprɑdɪˈɡæləti/","extraExplanation":["词源与常见联想：prodigality 来自拉丁语词根，和 prodigal（挥霍的）同源。许多英语学习者会因为《圣经》/文学中“the Prodigal Son”（浪子回头）的典故而记住它：prodigal 原意是“把家产挥霍掉的人”，后来也引申为“浪费、奢侈”。","用法提示：prodigality 通常是不可数名词，常与介词 of 连用（the prodigality of …）或与动词 criticize/condemn/regret 搭配。常见近义词有 extravagance, wastefulness；反义概念包括 frugality, thrift。"]}
{"word":"prodigalize","summary":{"en":"“Prodigalize” means to squander resources or behave wastefully and extravagantly.","zh":"“prodigalize”指挥霍资源，或以奢侈、浪费的方式行事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to waste or spend (money, time, resources) too freely; to squander","zh":"挥霍；浪费（钱、时间或资源）"},"examples":[{"en":"He prodigalized his savings on luxury clothes and expensive trips.","zh":"他把积蓄挥霍在奢侈衣服和昂贵旅行上。"},{"en":"The company prodigalized its budget on flashy ads instead of improving the product.","zh":"公司把预算浪费在花哨广告上，而不是改进产品。"}]},{"partOfSpeech":"vi.","definition":{"en":"to live or act in a wasteful, extravagant way","zh":"生活奢侈、挥霍无度（指行为方式）"},"examples":[{"en":"In his twenties, he prodigalized and rarely planned for the future.","zh":"二十多岁时，他挥霍无度，几乎不为未来打算。"}]}],"synonyms":["squander","waste","blow (money)","spend recklessly","lavish (on)"],"phonetic":"/prəˈdɪɡəˌlaɪz/","extraExplanation":["“prodigalize”比较少见，日常英语更常用“squander”“waste”“blow (money)”“spend recklessly”。写作中使用它会显得更书面、更带批评意味。","词根来自“prodigal”（挥霍的），很多学习者会联想到《圣经》里的“The Prodigal Son（浪子回头）”，这个文化背景让“prodigal-”常带“挥霍、放纵后悔悟”的联想，但“prodigalize”本身更侧重“挥霍/浪费”这一动作。"]}
{"word":"prodigally","summary":{"en":"“Prodigally” means doing something wastefully or extravagantly, especially spending or using too much.","zh":"“prodigally”表示以挥霍或奢侈的方式做某事，尤指花费或使用过多。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a wasteful or extravagant way; spending or using too much.","zh":"以挥霍、奢侈的方式；过度花费或消耗。"},"examples":[{"en":"He spent prodigally on designer clothes and expensive dinners.","zh":"他在名牌衣服和昂贵晚餐上挥霍无度。"},{"en":"The company used water prodigally during the dry season.","zh":"这家公司在旱季仍大量浪费用水。"},{"en":"She praised people prodigally, giving compliments to everyone.","zh":"她毫不吝啬地夸奖别人，几乎对每个人都给出赞美。"}]}],"synonyms":["wastefully","extravagantly","lavishly","recklessly"],"phonetic":"/ˈprɑdɪɡəli/","extraExplanation":["“prodigally”来自形容词“prodigal”（挥霍的、浪费的）。常见文化背景是《圣经》中“the Prodigal Son（浪子回头）”的故事：儿子挥霍家产后悔改归来。因此在文学或演讲里，prodigal/prodigally有时带一点“浪费导致后果、后来回头”的联想。","虽然“prodigally”最常见于“挥霍金钱/资源”，也可以用于较中性的“过度给出”（如赞美、关爱、时间），强调“给得太多、毫不节制”。"]}
{"word":"prodigals","summary":{"en":"“Prodigals” means wasteful spenders, and can also refer (with a moral/religious tone) to people who return after living irresponsibly.","zh":"“Prodigals”指挥霍无度的人；也可带宗教/道德意味，指放纵后“回头”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of **prodigal**) a person who spends money or resources wastefully; a reckless spender.","zh":"（**prodigal** 的复数）挥霍无度的人；败家子；浪费资源的人。"},"examples":[{"en":"The tabloids love stories about rich prodigals who waste fortunes overnight.","zh":"小报很爱报道富家败家子一夜挥霍掉巨额财富的故事。"},{"en":"The charity asked prodigals to donate instead of buying more luxury items.","zh":"慈善机构呼吁那些挥霍的人把钱捐出来，而不是再买更多奢侈品。"}]},{"partOfSpeech":"n.","definition":{"en":"People seen as having “returned” after living irresponsibly—often used with a religious or moral tone (from *the Prodigal Son*).","zh":"（带宗教/道德意味）指曾经放纵、后来“回头”的人（源自《浪子回头》的故事）。"},"examples":[{"en":"After years away, they came home like prodigals, ready to rebuild family ties.","zh":"多年离家后，他们像浪子回头一样回家，准备修复亲情关系。"},{"en":"The novel portrays a group of prodigals seeking forgiveness.","zh":"这部小说刻画了一群“浪子”寻求宽恕的人。"}]}],"synonyms":["spendthrifts","wasters","big spenders","reckless spenders"],"phonetic":"/ˈprɑdɪɡəlz/","extraExplanation":["“prodigal”常与《圣经·路加福音》中的“The Prodigal Son（浪子回头）”相关：故事里小儿子挥霍家产、受挫后悔改回家，父亲仍接纳他。因此在英语里，prodigal(s)除了“挥霍的人”，也常带有“迷途后回归、求宽恕”的文化含义。","词形提醒：prodigals 是名词复数；形容词用法是 prodigal（如：a prodigal spender 挥霍的花钱者），不写 *prodigals* 作形容词。"]}
{"word":"prodigies","summary":{"en":"“Prodigies” means people with extraordinary talent (plural of “prodigy”), especially young geniuses; less commonly, it can mean a marvel or remarkable achievement.","zh":"“prodigies”是“prodigy”的复数，常指（多为年轻的）神童/天才；较少见地也可指奇迹般的事物或惊人的成就。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (usually children or young people) who have extraordinary talent or ability, especially in fields like music, math, or art.","zh":"（通常指儿童或年轻人）神童；天才少年/少女，指在音乐、数学、艺术等领域表现出非凡才能的人。"},"examples":[{"en":"She was a piano prodigy who performed in public at age six.","zh":"她是钢琴神童，六岁就公开演出了。"},{"en":"The school created a special program for math prodigies.","zh":"学校为数学神童设立了一个特别项目。"}]},{"partOfSpeech":"n.","definition":{"en":"An exceptionally impressive thing or achievement; a marvel (less common today).","zh":"奇迹般的事物；惊人之举（较少见的用法）。"},"examples":[{"en":"For its time, the bridge was considered a prodigy of engineering.","zh":"在当时，这座桥被认为是工程学的奇迹。"}]}],"synonyms":["geniuses","wunderkinds","phenoms","talents","marvels"],"phonetic":"/ˈprɑːdədʒiz/","extraExplanation":["“prodigies”是“prodigy”的复数。常见搭配：child prodigy（神童），musical prodigy（音乐神童）。","词源上与拉丁语“预兆/征兆”有关，所以旧用法里也会指“奇观、奇迹”一类的“令人惊异之物”。","语气提示：称某人“a prodigy”通常是高度赞美，但在某些语境也可能带一点“让人压力很大/被期待过高”的暗示。"]}
{"word":"prodigiosity","summary":{"en":"Prodigiosity means extraordinary talent (like a prodigy’s) or astonishing greatness in degree or amount.","zh":"prodigiosity 指非凡天赋（如神童般）或在程度/规模上极其惊人的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Extraordinary talent or ability, especially the kind associated with a prodigy (someone unusually gifted at a young age).","zh":"非凡的天赋或能力，尤指“神童/天才少年”那种超常的才能。"},"examples":[{"en":"Her musical prodigiosity was obvious when she performed complex pieces at age eight.","zh":"她八岁就能演奏高难度曲目，音乐天赋之惊人显而易见。"},{"en":"The film highlights the prodigiosity of a child mathematician without turning him into a stereotype.","zh":"这部电影展现了一位儿童数学天才的非凡才能，同时避免把他拍成刻板印象。"}]},{"partOfSpeech":"n.","definition":{"en":"Remarkable greatness in degree or amount; the quality of being prodigious or astonishing.","zh":"极其惊人的程度或规模；“非同寻常、令人震撼”的特质。"},"examples":[{"en":"The prodigiosity of the storm surprised even longtime residents.","zh":"这场风暴的惊人程度连老居民都感到意外。"},{"en":"Scientists discussed the prodigiosity of the data set—millions of samples collected over decades.","zh":"科学家们讨论了该数据集的庞大惊人——几十年间收集了数百万个样本。"}]}],"synonyms":["extraordinary talent","genius","brilliance","prodigiousness","remarkableness","astonishingness"],"phonetic":"/ˌprɑːdɪdʒiˈɑːsɪti/","extraExplanation":["“prodigiosity”在日常口语里不算常见，更常用的是“prodigy（神童/天才）”“prodigious（惊人的）”。写作中用“prodigiosity”会显得更正式、更书面。","词形关系：prodigy（神童）→ prodigious（惊人的）→ prodigiosity（惊人的天赋/惊人程度）。","语义小提示：如果强调“天才本身（人）”，多用prodigy；如果强调“能力/规模很惊人（性质）”，可用prodigious或prodigiosity。"]}
{"word":"prodigious","summary":{"en":"Prodigious means extremely large or impressive; it can also describe someone (often a child) who is extraordinarily talented.","zh":"prodigious 指“巨大/惊人/非凡”；也可形容（常指孩子）“天赋异禀、神童般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very large in size, amount, or degree; remarkable or impressive.","zh":"巨大的；惊人的；非凡的（强调数量、规模或程度很大，令人印象深刻）。"},"examples":[{"en":"She has a prodigious memory and can recall names from years ago.","zh":"她记忆力惊人，能回想起多年前的人名。"},{"en":"The company made prodigious profits last year.","zh":"这家公司去年获得了惊人的利润。"},{"en":"They put in a prodigious amount of work to finish the project on time.","zh":"他们投入了大量工作，才按时完成项目。"}]},{"partOfSpeech":"adj.","definition":{"en":"(About a person, especially a child) Extremely talented; like a prodigy.","zh":"（尤指孩子）天赋异禀的；神童般的。"},"examples":[{"en":"A prodigious young pianist performed a difficult concerto with ease.","zh":"一位天赋异禀的年轻钢琴家轻松演奏了一首高难度协奏曲。"},{"en":"He was known as a prodigious student who learned languages quickly.","zh":"他以学习语言很快的天才型学生而闻名。"}]}],"synonyms":["enormous","immense","extraordinary","remarkable","astounding","phenomenal"],"phonetic":"/prəˈdɪdʒəs/","extraExplanation":["“prodigious”来自拉丁语词根，和“prodigy（神童/奇才）”同源。日常使用中更常指“规模/数量惊人”，用于形容人时则更接近“天才般的”。","语气通常是褒义或带惊叹，但也可中性地表示“非常大/非常多”。常见搭配：prodigious talent（惊人的天赋）, prodigious memory（惊人的记忆力）, prodigious amount（大量）, prodigious feat（壮举）。"]}
{"word":"prodigiously","summary":{"en":"“Prodigiously” means “to an extremely great degree,” often suggesting something unusually impressive or large.","zh":"“prodigiously”表示“极其；非常；惊人地”，常强调程度或规模远超一般。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"To an extremely great degree; remarkably or impressively.","zh":"极其；非常；惊人地（程度很高）"},"examples":[{"en":"She was prodigiously talented for her age.","zh":"以她的年龄来说，她的才华极其出众。"},{"en":"The company grew prodigiously in just two years.","zh":"这家公司在短短两年内以惊人的速度增长。"},{"en":"He ate prodigiously after the long hike.","zh":"长途徒步后，他吃得非常多。"}]}],"synonyms":["extremely","remarkably","exceptionally","immensely","tremendously"],"phonetic":"/prəˈdɪdʒəsli/","extraExplanation":["“prodigiously”来自形容词“prodigious”（惊人的、巨大的），常用于书面语或较正式的语境，强调程度远超一般。","它既可以修饰“talented / fast / successful”等抽象概念，也常用来修饰数量或规模（如“eat / spend / increase”），带有“多得惊人”的语感。","语气上通常偏正面（令人赞叹的巨大/出色），但也可用于中性或略带夸张的描述（如花钱、吃东西“过量”）。"]}
{"word":"prodigiousness","summary":{"en":"“Prodigiousness” means the quality of being extremely great or remarkably extraordinary.","zh":"“prodigiousness”指“极其巨大”或“非凡卓越”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being extremely great in size, amount, degree, or intensity; vastness.","zh":"极其巨大（数量、规模、程度或强度）的特质；庞大。"},"examples":[{"en":"The prodigiousness of the project surprised even the experienced engineers.","zh":"这个项目的庞大程度连经验丰富的工程师都感到惊讶。"},{"en":"We were struck by the prodigiousness of the mountain range stretching for miles.","zh":"我们被绵延数英里的山脉之宏伟所震撼。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being extraordinary or remarkable, especially in ability, talent, or achievement.","zh":"非凡、卓越（尤指能力、天赋或成就）的特质。"},"examples":[{"en":"Her prodigiousness as a pianist was obvious from her first public performance.","zh":"她作为钢琴家的非凡天赋从第一次公开演出就显而易见。"},{"en":"The novel captures the prodigiousness of a young mind learning the world too quickly.","zh":"这部小说描写了一个年轻心灵以惊人速度认识世界的非凡之处。"}]}],"synonyms":["enormity","immensity","vastness","magnitude","extraordinariness","remarkableness"],"phonetic":"/prəˈdɪdʒəsnəs/","extraExplanation":["“prodigiousness”来自形容词“prodigious”（巨大的；惊人的）+ 名词后缀“-ness”，表示“……的性质/状态”。","语域偏正式，常见于评论、报道、学术写作中；日常口语里更常用“how huge/amazing it is”或直接用“prodigious”。","与“prodigy（神童/奇才）”同源但意思不同：prodigy指“人/事物本身很惊人”，而prodigiousness强调“惊人的特质”。"]}
{"word":"prodigus","summary":{"en":"Prodigus is a very rare form (mainly Latin-based) meaning “wasteful or lavish,” close to prodigal.","zh":"prodigus 非常少见（多为拉丁语背景），意为“挥霍的/奢侈的；过度慷慨的”，接近 prodigal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare in modern English) wasteful or extravagantly generous; spending resources too freely (similar to “prodigal”).","zh":"（现代英语中非常少见）挥霍的；慷慨到过度、花费过多的（类似 prodigal“挥霍的”）。"},"examples":[{"en":"In older texts, a “prodigus son” is a son who wastes his inheritance.","zh":"在较旧的文本中，“prodigus son”指挥霍家产的儿子。"},{"en":"The poet describes a prodigus host who pours out wine for everyone.","zh":"诗人描写了一位“prodigus”的主人，为所有人不断斟酒。"}]},{"partOfSpeech":"other","definition":{"en":"(Latin background) “Prodigus” is a Latin word meaning ‘lavish’ or ‘wasteful,’ often discussed when explaining the English word “prodigal.”","zh":"（拉丁语背景）prodigus 是拉丁语，意思是“奢侈/挥霍、过度慷慨”，常用于解释英语单词 prodigal。"},"examples":[{"en":"Teachers may mention Latin prodigus when explaining the meaning of prodigal.","zh":"老师讲解 prodigal 的词源时，可能会提到拉丁语 prodigus。"}]}],"synonyms":["prodigal","lavish","extravagant","wasteful","spendthrift"],"phonetic":"ˈprɑːdɪɡəs","extraExplanation":["在现代英语写作里，prodigus 通常不被当作常用英语词；更常见的对应词是 **prodigal**（挥霍的）或 **prodigious**（巨大的；惊人的）。如果你原本想查“prodigious”，告诉我我可以按正确词条再给你一份。","词根联想：**prodigal**（挥霍的）来自拉丁语 **prodigus**；而 **prodigy / prodigious**（奇才/惊人的）是另一条相关但含义不同的词族，容易拼写和意义混淆。"]}
{"word":"prodigy","summary":{"en":"A prodigy is an exceptionally talented young person, or something/someone remarkably impressive.","zh":"prodigy 指“神童/天才少年”，也可指“极其杰出的典范”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young person who shows extraordinary talent or ability (especially in music, math, chess, etc.).","zh":"神童；天才少年（尤指在音乐、数学、国际象棋等方面表现出非凡才能的年轻人）。"},"examples":[{"en":"She was a piano prodigy who performed in public at age six.","zh":"她是钢琴神童，六岁就公开演出。"},{"en":"People called him a chess prodigy because he beat adults easily.","zh":"人们称他为国际象棋神童，因为他轻松击败成年人。"}]},{"partOfSpeech":"n.","definition":{"en":"An unusually impressive or remarkable example of something.","zh":"杰出典范；非凡之人/物（指某方面极其出色的例子）。"},"examples":[{"en":"The athlete was a prodigy of speed and discipline.","zh":"这位运动员是速度与自律的杰出典范。"},{"en":"Her memory is a prodigy—she remembers names after meeting people once.","zh":"她的记忆力堪称非凡——见过一次就能记住名字。"}]}],"synonyms":["child prodigy","whiz","genius","phenomenon","wonder"],"phonetic":"/ˈprɑdɪdʒi/","extraExplanation":["“prodigy”常用于强调“年纪小但能力极强”。在英语文化中常见搭配有：a child prodigy（儿童神童）、a musical prodigy（音乐神童）、a math prodigy（数学天才）。","词源上与拉丁语中“预兆、奇迹般的事物”相关，因此这个词带有“令人惊叹、不同寻常”的语感。","与“genius”相比，“prodigy”更强调“年少”或“早慧”；与“talented”相比，语气更强，表示“罕见的卓越”。"]}
{"word":"prodisarmament","summary":{"en":"Pro-disarmament means supporting the reduction or elimination of weapons, especially in international politics.","zh":"Pro-disarmament 指支持减少或消除武器（裁军），常用于国际政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting disarmament (the reduction or elimination of weapons, especially military weapons)","zh":"支持裁军（减少或消除武器，尤指军事武器）"},"examples":[{"en":"She is a pro-disarmament activist who campaigns against nuclear weapons.","zh":"她是一位支持裁军的行动者，致力于反对核武器。"},{"en":"The party adopted a pro-disarmament platform during the election.","zh":"该政党在选举期间采纳了支持裁军的政纲。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or position that supports disarmament","zh":"支持裁军的人、团体或立场"},"examples":[{"en":"Pro-disarmament groups called for talks between the two countries.","zh":"支持裁军的团体呼吁两国展开会谈。"},{"en":"In the debate, he spoke as a pro-disarmament voice in parliament.","zh":"在辩论中，他以议会中支持裁军的声音发言。"}]}],"synonyms":["anti-arms","anti-nuclear","disarmament-supporting","pacifist (often related)"],"phonetic":"/ˌproʊ dɪsˈɑrməmənt/","extraExplanation":["这个词通常写作 **pro-disarmament**（带连字符），意思是“支持裁军的”。“pro-”是前缀，表示“赞成/支持”，常见于 pro-democracy（支持民主）、pro-environment（支持环保）。","“disarmament”在国际关系语境里很常见，尤其与 **nuclear disarmament（核裁军）**、**arms control（军备控制）** 一起出现：一般来说，arms control 更强调“限制与管理”，disarmament 更强调“减少甚至消除”。"]}
{"word":"prodisplay","summary":{"en":"“prodisplay / Pro Display” usually refers to a professional-grade monitor, often as a product name.","zh":"“prodisplay / Pro Display”通常指专业级显示器，多见于产品名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high-end display/monitor designed for professional work (often used as a product name, e.g., Apple’s “Pro Display”).","zh":"为专业工作设计的高端显示器/监视器（常见作产品名，如苹果的“Pro Display”）。"},"examples":[{"en":"She edits photos on a Pro Display because it shows colors very accurately.","zh":"她用 Pro Display 修图，因为它的颜色显示很准确。"},{"en":"The studio bought a Pro Display for video color grading.","zh":"工作室买了一台 Pro Display 用来做视频调色。"}]}],"synonyms":["professional monitor","high-end display","studio monitor"],"phonetic":"/proʊ dɪˈspleɪ/","extraExplanation":["“Pro Display”最常见的文化语境是苹果的产品名（如 Pro Display XDR）。在日常英语里一般不会把“prodisplay”当作普通词使用，更常写成分开的“Pro Display”或带型号名。","“pro-”在英语里常表示“professional（专业的）”，所以在科技产品命名中常用来暗示“面向专业用户、高规格”。"]}
{"word":"prodissoconch","summary":{"en":"Prodisoconch is the earliest larval shell of a bivalve, seen near the hinge in adults.","zh":"Prodisoconch 指双壳类在幼体阶段形成的最早期幼壳，成体常在壳铰附近可见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(malacology) The first-formed, larval shell of a bivalve mollusk, produced during the free-swimming larval stage; it later becomes the small, early part near the hinge of the adult shell.","zh":"（软体动物学）双壳类在幼体（浮游）阶段形成的最早期壳（幼壳）；成体壳在壳铰附近常可见到这一早期部分。"},"examples":[{"en":"Under a microscope, the prodisoconch can look smoother than the later shell layers.","zh":"在显微镜下，prodisoconch（幼壳）看起来可能比后期形成的壳层更光滑。"},{"en":"Researchers use the shape of the prodisoconch to help identify bivalve species.","zh":"研究人员会用幼壳（prodisoconch）的形状来辅助鉴定双壳类物种。"}]}],"synonyms":["larval shell","early shell (bivalves)"],"phonetic":"/ˌproʊdaɪzoʊˈkɑːŋk/","extraExplanation":["你输入的“prodissoconch”很可能是拼写误差；更常见、规范的术语是 **prodisoconch**。","词源提示：**pro-**（在……之前）+ **diso-**（与双壳类幼体阶段相关的学术构词）+ **conch**（壳）。该词主要用于贝类发育与古生物学研究。","相关术语：**dissoconch** 指双壳类在定居/变态后形成的后期壳；很多文献会把 prodisoconch（幼体壳）与 dissoconch（后期壳）对照讨论。"]}
{"word":"prodissolution","summary":{"en":"Prodissolution means supporting the dissolution (ending) of a group or institution, especially the dissolution of a parliament.","zh":"prodissolution 指“支持解散/终止”的立场，尤常用于“支持解散议会”的政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the dissolution (ending or breaking up) of an organization, partnership, or political body (especially a parliament).","zh":"支持或赞成“解散/终止/瓦解”（例如组织、合伙关系或政治机构，尤指议会解散）的。"},"examples":[{"en":"Several prodissolution lawmakers argued that early elections were necessary.","zh":"一些支持解散议会的立法者认为提前大选是必要的。"},{"en":"The party took a prodissolution stance during the constitutional crisis.","zh":"在宪政危机期间，该党采取了支持解散的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a position, argument, or group that supports dissolution.","zh":"主张或支持“解散/终止”的立场、论点或群体。"},"examples":[{"en":"Prodissolution gained momentum after weeks of deadlock.","zh":"在僵局持续数周后，支持解散的声音势头增强。"},{"en":"The debate split into prodissolution and anti-dissolution camps.","zh":"辩论分裂为支持解散与反对解散两大阵营。"}]}],"synonyms":["pro-dissolution","in favor of dissolution","dissolution-supporting","pro-breakup","pro-termination"],"phonetic":"/ˌproʊˌdɪsəˈluːʃən/","extraExplanation":["“prodissolution”通常写作带连字符的 **pro-dissolution**（更常见），表示“支持解散”。在英国、加拿大等议会制语境里，**dissolution** 常特指“解散议会并触发大选”。","构词法：**pro-**（支持）+ **dissolution**（解散/终止）。正式或新闻写作中更常用这种结构来表达政治立场（类似 pro-democracy, pro-choice）。"]}
{"word":"prodistribution","summary":{"en":"A rare/nonstandard term meaning support for wider distribution of resources; more commonly written as “pro-distribution.”","zh":"较少见/非标准用语，指支持更广泛的资源分配；更常写作“pro-distribution”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Advocacy or support for distributing resources, goods, or benefits more widely (often used in political/economic discussions; rare and usually written with a hyphen: pro-distribution).","zh":"支持将资源、商品或利益更广泛地分配（常见于政治/经济语境；较少用，通常写作带连字符的 pro-distribution）。"},"examples":[{"en":"The candidate ran on a pro-distribution platform focused on sharing wealth more fairly.","zh":"这位候选人以“支持更广泛分配”的政纲参选，强调更公平的财富分享。"},{"en":"Some critics say the policy is strongly pro-distribution, while supporters call it basic fairness.","zh":"一些批评者认为该政策明显“偏向再分配”，而支持者称之为基本的公平。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an idea, policy, or person as favoring broader distribution of resources (rare; more common as the adjective phrase pro-distribution).","zh":"形容某种观点、政策或人“倾向于更广泛分配资源”（较少用；更常见的表达是形容词短语 pro-distribution）。"},"examples":[{"en":"They proposed a pro-distribution tax plan to reduce inequality.","zh":"他们提出了一项偏向“促进更广泛分配”的税收方案，以减少不平等。"}]}],"synonyms":["redistribution","equitable distribution","fair distribution","resource sharing","pro-redistribution"],"phonetic":"/ˌproʊˌdɪstrəˈbjuːʃən/","extraExplanation":["“prodistribution”不是常见标准词，很多情况下是把前缀 pro-（支持/赞成）加在 distribution（分配）前形成的临时用法；写作时更自然的是加连字符：pro-distribution。","如果你想表达更常见、更明确的概念，英语里通常用 redistribution（再分配）、equitable/fair distribution（公平分配）、resource sharing（资源共享）等。"]}
{"word":"prodition","summary":{"en":"“Prodition” is a rare noun meaning betrayal, especially treason.","zh":"“Prodition” 是个罕用名词，指背叛，尤指叛国（treason）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of betraying someone or one’s country; treason.","zh":"（罕用）背叛；（尤指）叛国、通敌。"},"examples":[{"en":"In old legal writing, prodition could mean treason against the state.","zh":"在早期法律文献中，prodition 可指对国家的叛国行为。"},{"en":"The historian described the general’s secret deal as prodition.","zh":"历史学家把那位将军的秘密交易称为背叛（prodition）。"}]}],"synonyms":["treason","betrayal","perfidy"],"phonetic":"/prəˈdɪʃən/","extraExplanation":["这个词非常少见，现代英语里通常用更常见的 treason（叛国）或 betrayal（背叛）。","词源来自拉丁语 proditio（背叛、出卖），与动词 betray（背叛）在用法上接近，但 prodition 更偏“正式/古典/法律史语境”。"]}
{"word":"proditor","summary":{"en":"A rare, formal word meaning “traitor” or “betrayer.”","zh":"一个罕见的正式/文学用词，意思是“叛徒、背叛者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal or literary) a traitor; someone who betrays a person, group, or cause.","zh":"（罕见，正式或文学用语）叛徒；背叛他人、团体或事业的人。"},"examples":[{"en":"In the novel, the king brands his adviser a proditor and orders him exiled.","zh":"在小说里，国王将顾问斥为叛徒，并下令将他流放。"},{"en":"She felt like a proditor for revealing the plan to the rival team.","zh":"她把计划透露给对手队伍后，觉得自己像个背叛者。"}]}],"synonyms":["traitor","betrayer","turncoat","defector"],"phonetic":"/ˈprɑːdɪtər/","extraExplanation":["“proditor”源自拉丁语 proditor（背叛者），与动词 prodere（出卖、泄露、背叛）同源。现代英语里非常少见，更常用的是 traitor / betrayer。","学习提示：它容易被误看成 predator（掠食者）。predator 指“捕食动物/掠夺者”，意思不同；写作与阅读时要注意拼写与语境。","在历史或文学语境中，proditor 往往带有强烈的道德谴责色彩，比中性一些的“someone who leaked information（泄密者）”更严厉。"]}
{"word":"proditorious","summary":{"en":"Proditorious means “treacherous” or “traitorous,” and it is an archaic word.","zh":"proditorious 意为“背叛的、奸诈的、叛徒般的”，属于古旧用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Treacherous; acting like a traitor; likely to betray someone’s trust.","zh":"（古旧用法）背叛的；叛徒般的；容易出卖他人、辜负信任的。"},"examples":[{"en":"The king feared a proditorious adviser who might sell secrets to the enemy.","zh":"国王害怕一位可能把机密卖给敌人的叛逆顾问。"},{"en":"In old stories, a proditorious friend often appears as the hidden villain.","zh":"在古老故事里，“背叛的朋友”常常以隐藏反派的身份出现。"}]}],"synonyms":["treacherous","traitorous","betraying","disloyal"],"phonetic":"/ˌproʊdɪˈtɔriəs/","extraExplanation":["这个词非常少见，属于古旧/文学用语。现代英语更常用 treacherous、traitorous、betraying 来表达同样的意思。","词源上与拉丁语 proditor（叛徒）有关，同根词包括 betray（背叛）在意义上接近，但 proditorious 更强调“背叛者的性质/倾向”。","阅读旧文献时遇到它，通常是在描写政治阴谋、宫廷背信或朋友出卖等情境。"]}
{"word":"proditoriously","summary":{"en":"“Proditoriously” means “in a treacherous/traitorous way,” but it is very rare in modern English.","zh":"“proditoriously”意为“以背叛、阴险不忠的方式”，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a treacherous or traitorous way; in a manner that betrays trust.","zh":"以背叛、出卖或阴险不忠的方式；以不守信的方式。"},"examples":[{"en":"He proditoriously shared the team’s private plans with a rival company.","zh":"他背信弃义地把团队的秘密计划泄露给了竞争公司。"},{"en":"The general was accused of acting proditoriously by negotiating with the enemy in secret.","zh":"这位将军被指控暗中与敌方谈判，行为属于叛卖。"}]}],"synonyms":["treacherously","traitorously","betrayingly","disloyally"],"phonetic":"/ˌproʊdɪˈtɔriəsli/","extraExplanation":["“proditoriously”非常罕见，多见于法律、历史或文学化的语境。日常英语更常用：treacherously（阴险地）、traitorously（叛变地）、betrayingly（背叛地）。","词源上可追溯到拉丁语 proditor（叛徒、出卖者），与 betray（背叛）在意义上高度相关。"]}
{"word":"prodivision","summary":{"en":"“Prodivision” is not standard English; it is usually a misspelling of “provision,” meaning providing/arranging, stored supplies, or a legal/contract clause.","zh":"“prodivision”不是标准英语，通常是“provision”的误拼，意思可指供给/安排、储备物资，或法律/合同条款。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling; in most cases people mean “provision.”","zh":"（非标准用法）拼写错误；大多数情况下想表达的是“provision（供给／规定／条款）”。"},"examples":[{"en":"I often see “prodivision” online, but the correct spelling is “provision.”","zh":"我经常在网上看到“prodivision”，但正确拼写是“provision”。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of providing something needed (especially food, money, or supplies).","zh":"供给；提供（尤指食物、资金或物资）的行为。"},"examples":[{"en":"The school made provision for free lunches.","zh":"学校为免费午餐做了安排／提供了保障。"},{"en":"Emergency provision of clean water saved lives.","zh":"紧急提供清洁饮用水挽救了生命。"}]},{"partOfSpeech":"n.","definition":{"en":"A supply of something kept for future use; stored supplies.","zh":"储备物；备用物资。"},"examples":[{"en":"They packed provisions for the trip.","zh":"他们为旅行准备了补给品。"},{"en":"The ship carried enough provisions for two weeks.","zh":"船上带了足够两周的补给。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition or rule in a law, contract, or agreement (a “clause”).","zh":"（法律、合同或协议中的）条款；规定。"},"examples":[{"en":"There is a provision that allows early termination.","zh":"有一项条款允许提前终止。"},{"en":"Read the privacy provisions carefully.","zh":"请仔细阅读隐私条款。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide or supply what is needed; to make arrangements for something.","zh":"提供；供给；为……做安排。"},"examples":[{"en":"The charity provisions shelters with blankets.","zh":"该慈善机构为收容所提供毛毯。"},{"en":"The plan provisions for unexpected costs.","zh":"这项计划为意外费用留有安排／预留空间。"}]}],"synonyms":["supply","providing","arrangement","stipulation","clause","supplies","stores"],"phonetic":"/pɹəˈvɪʒən/","extraExplanation":["“Provision”在英式/美式英语里都常见：\n- 讲“补给品”时常用复数 provisions（如旅行、探险、航海语境）。\n- 讲“合同/法律条款”时常见搭配：a provision in the contract / under the provisions of the law（根据法律条款）。\n- 讲“做安排”时常用：make provision for…（为……预作安排/预留）。"]}
{"word":"prodivorce","summary":{"en":"“Pro-divorce” means supporting divorce rights or easier divorce laws.","zh":"“pro-divorce”指支持离婚权利或更容易离婚的法律/政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting divorce rights, laws, or easier access to divorce (often used in politics or social debate).","zh":"支持离婚权利、离婚法律或更容易离婚（常用于政治或社会议题讨论）。"},"examples":[{"en":"The senator is seen as pro-divorce because she voted to simplify the divorce process.","zh":"这位参议员被视为“支持离婚”，因为她投票支持简化离婚程序。"},{"en":"Some groups argue that pro-divorce policies protect people in unhealthy marriages.","zh":"一些团体认为，支持离婚的政策能保护处在不健康婚姻中的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports divorce rights or more permissive divorce laws (less common).","zh":"支持离婚权利或更宽松离婚法律的人（较少见）。"},"examples":[{"en":"In the debate, he spoke as a pro-divorce and emphasized personal freedom.","zh":"在辩论中，他以支持离婚者的立场发言，强调个人自由。"}]}],"synonyms":["pro-divorce rights","in favor of divorce","supportive of divorce laws","pro-separation (context-dependent)"],"phonetic":"/ˌproʊ dɪˈvɔrs/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持/赞成”（如 pro-choice 支持选择权，pro-democracy 支持民主）。因此 pro-divorce 通常写作 pro-divorce（带连字符）来强调它是“支持离婚”的立场，而不是“促进离婚”的行为。","这是带有立场色彩的词，使用时要注意语境与语气：在讨论法律、宗教观点、家庭政策等话题时更常见。"]}
{"word":"prodomoi","summary":{"en":"Prodromoi (also spelled prodomoi) were ancient Macedonian light cavalry used mainly as scouts and fast-moving troops.","zh":"Prodromoi（也可写作 prodomoi）指古马其顿的轻骑兵侦察部队，主要承担侦察与快速机动任务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient history) Light cavalry scouts, especially in the Macedonian army under Alexander the Great; used for reconnaissance and rapid attacks.","zh":"（古代史）轻骑兵侦察队，尤指亚历山大大帝时期马其顿军中的“侦骑/前锋骑兵”，用于侦察与快速突击。"},"examples":[{"en":"Alexander sent the prodromoi ahead to scout the river crossing.","zh":"亚历山大派出 prodromoi 先行侦察渡河点。"},{"en":"In some accounts, the prodromoi screened the main army from surprise attacks.","zh":"在一些记载中，prodromoi 负责为主力遮蔽掩护，防止突袭。"}]}],"synonyms":["scouts","light cavalry","reconnaissance cavalry"],"phonetic":"/proʊˈdrɑːmɔɪ/","extraExplanation":["“prodomoi”常见为拼写变体；更常用的拼写是 **prodromoi**（源自希腊语，意为“先行者/前驱”）。在英文历史写作中，它通常作为外来词使用，指特定时代与军制下的骑兵单位。","不同史家对该部队的编制与具体职能描述可能略有差异；有时也会与其他马其顿骑兵（如伙伴骑兵 Companion Cavalry）区分讨论。"]}
{"word":"prodomos","summary":{"en":"Prodomos means the front porch or vestibule of an ancient Greek temple, just before the main inner room.","zh":"prodomos 指古希腊神庙的前廊或前室，位于主殿之前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek architecture) a front porch or vestibule of a temple; the space in front of the main chamber (naos/cella), often between the entrance and the inner room.","zh":"（古希腊建筑）神庙的前廊/前室；位于入口与主殿（naos/cella）之间、主殿之前的空间。"},"examples":[{"en":"Visitors stepped into the prodomos before entering the temple’s main chamber.","zh":"参观者先进入神庙的前室（prodomos），再进入主殿。"},{"en":"The prodomos was supported by columns, creating a sheltered entryway.","zh":"前廊由柱子支撑，形成一个有遮蔽的入口空间。"},{"en":"In the plan, the prodomos sits directly in front of the naos.","zh":"在平面图中，前室紧挨着主殿（naos）之前。"}]}],"synonyms":["pronaos","vestibule","porch","portico (sometimes, depending on context)"],"phonetic":"/proʊˈdoʊməs/","extraExplanation":["“prodomos”来自希腊语：pro-（在前）+ domos（房屋/居室），字面意思是“前面的房间”。","在古希腊神庙术语中，常见相关词还有：pronaos（前厅/门廊，概念非常接近，有时在英文资料里会与prodomos混用或按不同学者体系区分）、opisthodomos（后室/后廊）。阅读建筑史资料时可留意作者采用的分类。"]}
{"word":"prodproof","summary":{"en":"“Prod-proof” means production-ready: safe and reliable enough for a live environment.","zh":"“Prod-proof”指“可上生产”：足够安全可靠，适用于线上生产环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"safe or reliable enough to be used in a live production environment (where real users/data are affected).","zh":"（软件/系统）足够安全可靠，可用于生产环境（会影响真实用户/数据的线上环境）。"},"examples":[{"en":"Is this change prod-proof, or do we need more testing?","zh":"这个改动够不够“能上生产”，还是需要更多测试？"},{"en":"We added extra logging to make the deployment more prod-proof.","zh":"我们加了更多日志，让部署更“适合上生产/更抗事故”。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to prevent mistakes that commonly happen during production operations (such as deployments or configuration changes).","zh":"（流程/工具）能减少或避免生产操作中常见错误（如发布、配置变更）。"},"examples":[{"en":"A checklist makes the release process more prod-proof.","zh":"用清单能让发布流程更不容易出错、更加“能扛生产”。"},{"en":"We built a prod-proof rollback button in case anything goes wrong.","zh":"我们做了一个“生产可用”的一键回滚按钮，以防出问题。"}]}],"synonyms":["production-ready","production-safe","production-hardened","release-ready"],"phonetic":"/prɑd ˈpruf/","extraExplanation":["“prod”是production（生产环境）的口语缩写，在科技公司里非常常见。","“prod-proof”更偏工程师内部用语/团队黑话，正式文档里也常用更标准的说法：production-ready / production-safe / production-hardened。"]}
{"word":"prodramatic","summary":{"en":"“Prodramatic” isn’t a standard word; it’s usually a mistake for “programmatic” or “dramatic.”","zh":"“prodramatic”不是标准词，多半是把“programmatic”或“dramatic”等词写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or mistaken form. In writing, people usually mean “programmatic” (related to a program/plan) or “(pro-)dramatic” (supporting drama / very dramatic), depending on context.","zh":"不是标准英语单词；多见于拼写或用词错误。写作中常见的本意可能是“programmatic”（与计划/方案/程序相关）或“(pro-)dramatic”（支持戏剧/很戏剧化），需看上下文。"},"examples":[{"en":"I couldn’t find “prodramatic” in a dictionary—did you mean “programmatic”?","zh":"我在词典里找不到“prodramatic”——你是不是想写“programmatic”？"},{"en":"If you mean “very emotional and exaggerated,” the common word is “dramatic,” not “prodramatic.”","zh":"如果你想表达“情绪很强烈、略夸张”，常用词是“dramatic”，而不是“prodramatic”。"}]}],"synonyms":["programmatic","dramatic","melodramatic"],"phonetic":"/ˌproʊdrəˈmætɪk/","extraExplanation":["“programmatic”常用于学术/新闻语境，表示“按计划推进的、与方案相关的”，如：programmatic changes（系统性的规划调整）、a programmatic approach（按方案的方法）。","如果你想表达“戏剧性的/夸张的”，用dramatic；表达“过度煽情、夸张到有点假”的话，更常用melodramatic。","如果你告诉我原句（你写“prodramatic”的那一句），我可以帮你判断最合适的目标词。"]}
{"word":"prodroma","summary":{"en":"Prodroma is a rare term meaning early warning signs (especially of illness) or a preliminary/introductory academic work.","zh":"Prodroma 是较少见的词，可指（尤其疾病的）先兆/前驱症状，也可指学术上的提纲式导论或预备性著作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early sign or symptom that happens before the main event, especially the beginning signs of an illness (similar to “prodrome”)","zh":"（尤指疾病的）前驱症状、先兆；在主要症状出现前发生的早期征象（类似 prodrome）"},"examples":[{"en":"Fatigue and a mild fever can be prodroma of the flu.","zh":"疲劳和轻微发烧可能是流感的前驱症状。"},{"en":"Some people notice prodroma before a migraine, such as mood changes or food cravings.","zh":"有些人在偏头痛前会出现先兆（前驱症状），比如情绪变化或想吃特定食物。"}]},{"partOfSpeech":"n.","definition":{"en":"a preliminary outline or introductory work (a ‘first sketch’), often used in academic or scientific titles","zh":"（学术/科学著作中的）初稿、提纲式的导论；概略性预备著作（常见于书名）"},"examples":[{"en":"The author published a short prodroma to present the main ideas before the full book.","zh":"作者先发表了一部简短的提纲式预备著作，提前呈现全书要点。"},{"en":"In older scientific literature, you may see “Prodroma” in titles meaning an early survey of a subject.","zh":"在较早的科学文献里，你可能在书名中看到“Prodroma”，表示对某个主题的早期综述。"}]}],"synonyms":["prodrome","early sign","warning sign","precursor","forerunner","prelude"],"phonetic":"/proʊˈdroʊmə/","extraExplanation":["“prodroma”源自希腊语词根：pro-（在……之前）+ dromos（奔跑、行进），核心意思是“在前面跑的东西”，因此引申为“先兆/前驱”。","在现代英语里更常见的形式是“prodrome”。“prodroma”较少见，多出现在医学或较古旧/学术语境中；有时会被当作“prodrome”的变体或复数用法，但标准用法仍以“prodrome / prodromes”更常见。"]}
{"word":"prodromal","summary":{"en":"Prodromal means ‘occurring before the main symptoms,’ especially as early warning signs of an illness.","zh":"prodromal 指“前驱的、前期的”，尤指疾病主要症状出现之前的早期预警表现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in the early stage of an illness; describing warning signs that appear before the main symptoms.","zh":"（疾病）前驱的；前期的；指主要症状出现之前的预警表现。"},"examples":[{"en":"She noticed prodromal symptoms like mild headache and fatigue a day before the migraine.","zh":"她在偏头痛发作前一天就注意到轻微头痛和疲劳等前驱症状。"},{"en":"Doctors asked about any prodromal fever before the rash appeared.","zh":"医生询问皮疹出现前是否有任何前驱性发热。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a prodrome (the early set of signs that comes before a disease or event).","zh":"与“前驱期/前驱症状（prodrome）”有关的。"},"examples":[{"en":"The patient kept a diary to track prodromal changes in mood and sleep.","zh":"病人写日记来记录情绪和睡眠的前驱性变化。"},{"en":"Some seizures are preceded by a prodromal phase.","zh":"有些癫痫发作前会出现前驱期。"}]}],"synonyms":["early","preliminary","incipient","premonitory","warning"],"phonetic":"/proʊˈdroʊməl/","extraExplanation":["词源：来自希腊语 pro-（在前）+ dromos（奔跑、路程），原意接近“跑在前面的东西”，引申为“先出现的征兆”。","常见搭配：prodromal symptoms（前驱症状）、prodromal phase（前驱期）、prodromal sign（前驱征象）。","使用场景多见于医学/心理健康语境（如偏头痛、感染、双相情感障碍、癫痫等）。日常英语更常说 early signs / warning signs。"]}
{"word":"prodromata","summary":{"en":"“Prodromata” means early warning signs—especially early symptoms before an illness (like a migraine) fully begins.","zh":"“prodromata”指（尤指疾病发作前的）前驱症状、先兆，即在状况真正开始前出现的预警信号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"early signs or symptoms that warn a disease or condition is about to begin; the plural of \"prodrome.\"","zh":"（疾病或状况发作前的）前驱症状、先兆；为“prodrome”的复数。"},"examples":[{"en":"The doctor asked about any prodromata, such as fatigue or a mild fever, before the rash appeared.","zh":"医生询问在皮疹出现前是否有任何前驱症状，比如疲劳或低烧。"},{"en":"In some patients, migraine prodromata include mood changes and food cravings.","zh":"对一些患者来说，偏头痛的前驱症状包括情绪变化和想吃特定食物。"}]},{"partOfSpeech":"n.","definition":{"en":"earlier events or features that come before and suggest something that will develop later (used in academic or formal writing).","zh":"（更正式/学术用法）预兆、前奏；某事发展前出现并暗示其将发生的迹象。"},"examples":[{"en":"Some historians treat these small protests as prodromata of a larger social movement.","zh":"一些历史学家把这些小规模抗议视为更大社会运动的前奏。"},{"en":"The subtle shifts in tone were prodromata of the conflict that followed.","zh":"语气的细微变化是随后冲突的预兆。"}]}],"synonyms":["prodromes","warning signs","early symptoms","precursors"],"phonetic":"/proʊˈdroʊmətə/","extraExplanation":["“prodromata”源自希腊语：pro-（在前）+ dromos（奔跑、行程），字面有“跑在前面”的意思，因此在医学里常指“症状出现前先跑出来的信号”。","日常英语里更常用单数“prodrome”或复数“prodromes”；“prodromata”更常见于医学论文、临床记录或较正式的写作。"]}
{"word":"prodromatic","summary":{"en":"“Prodromatic” is not common; you probably mean “prodromal/prodromic,” describing early warning symptoms before an illness fully starts.","zh":"“prodromatic”不常见；你大概率想写“prodromal/prodromic”，表示疾病正式发作前的前驱症状或前驱期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: prodromal / prodromic) relating to a prodrome—the early signs or symptoms that appear before a disease or condition fully develops.","zh":"（多半想写：prodromal / prodromic）与“前驱期/前驱症状”有关的；指在疾病或状况完全发作前出现的早期征兆或症状。"},"examples":[{"en":"She noticed prodromal symptoms of a migraine, like yawning and light sensitivity.","zh":"她注意到偏头痛的前驱症状，比如频繁打哈欠和对光敏感。"},{"en":"In some infections, fever can be part of the prodromal phase.","zh":"在一些感染中，发烧可能属于前驱期。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) serving as a warning sign that something is about to happen.","zh":"（少见/偏技术）作为某事即将发生的预兆；预示性的。"},"examples":[{"en":"The sudden silence felt prodromal of an argument.","zh":"突如其来的沉默像是争吵前的预兆。"}]}],"synonyms":["prodromal","prodromic","preliminary","early-warning","premonitory"],"phonetic":"/proʊˈdroʊməl/","extraExplanation":["“prodromatic”在标准英语里非常少见，很多情况下是把“prodromal”（更常用）或“prodromic”拼错了。医学语境中最常见的是“prodromal phase（前驱期）/ prodromal symptoms（前驱症状）”。","词根来自希腊语：pro-（在前）+ dromos（跑、进程），字面意思接近“在前面跑的东西”，引申为“先出现的征兆”。"]}
{"word":"prodromatically","summary":{"en":"“Prodromatically” means “in the early warning (prodromal) stage,” especially before an illness like a migraine fully starts.","zh":"“Prodromatically”意为“以前驱期/先兆的方式”，常指疾病（如偏头痛）正式发作前的早期警示阶段。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a prodromal way; during the early warning stage when symptoms begin to appear before a disease or condition fully develops.","zh":"以“前驱期/前驱症状”的方式；指在疾病或状况完全发作前，早期警示症状开始出现的阶段。"},"examples":[{"en":"Some patients feel unusually tired prodromatically before a migraine attack.","zh":"有些患者在偏头痛发作前的前驱期会感到异常疲惫。"},{"en":"She became irritable prodromatically, which often signaled that a headache was coming.","zh":"她在前驱期会变得易怒，这常常预示着头痛将要来临。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that serves as an early sign or precursor of something (often used in medical or academic writing).","zh":"以“先兆/前兆”的方式；指作为某事的早期迹象或预兆（常见于医学或学术写作）。"},"examples":[{"en":"A mild fever can appear prodromatically in some viral infections.","zh":"在某些病毒感染中，轻微发热可能以前驱形式出现。"}]}],"synonyms":["premonitory","as an early warning sign","in the early stages","precursorily"],"phonetic":"/ˌproʊdrəˈmætɪkli/","extraExplanation":["“prodromatically”来自形容词“prodromal”（前驱的），而“prodrome”在医学里指“发作前的一段早期症状期”。这个副词多见于临床描述或论文写作，日常口语中更常说“in the early stages”或“as an early warning sign”。","词源上与希腊语“prodromos”（跑在前面的人、先行者）有关，所以核心含义就是“提前出现、预告将要发生的事”。"]}
{"word":"prodrome","summary":{"en":"A prodrome is an early warning sign—especially the early symptoms that come before an illness or attack.","zh":"prodrome 指“前驱症状/前兆”，尤指疾病或发作发生前出现的早期征象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early sign or symptom that warns a disease or condition is about to happen (often used in medicine).","zh":"（医学）前驱症状；预兆症状：提示某种疾病或状况即将发生的早期征象。"},"examples":[{"en":"A headache and mood changes can be a prodrome of a migraine.","zh":"头痛和情绪变化可能是偏头痛发作前的前驱症状。"},{"en":"Some people notice a prodrome before a seizure, such as unusual smells or anxiety.","zh":"有些人在癫痫发作前会出现前驱症状，比如闻到异常气味或感到焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, an early sign that something (often important or negative) is going to happen.","zh":"（比喻）前兆；征兆：预示某事（常为重要或不好的事）将发生的迹象。"},"examples":[{"en":"The sudden resignations were a prodrome of a larger scandal.","zh":"突然的辞职潮是更大丑闻的前兆。"},{"en":"Small communication problems can be the prodrome of a breakup.","zh":"一些小的沟通问题可能是分手的前兆。"}]}],"synonyms":["warning sign","early symptom","harbinger","omen","precursor"],"phonetic":"/ˈproʊdroʊm/","extraExplanation":["词源来自希腊语 *prodromos*（意为“跑在前面的人/先行者”），因此 *prodrome* 强调“事情发生前的先行信号”。","在医学语境中很常见（如偏头痛、癫痫、感染等的发作前阶段），语气比普通的 *warning sign* 更专业、更偏临床。","复数常见为 **prodromes**；在更学术的用法中也可能看到希腊式复数 **prodromata**。"]}
{"word":"prodromes","summary":{"en":"“Prodromes” means early warning signs or symptoms that come before a main illness or event.","zh":"“Prodromes”指在主要疾病/事件之前出现的早期征兆或前驱症状（也可泛指先兆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Early signs or symptoms that appear before the main illness or event (often used in medicine).","zh":"（常用于医学）在主要疾病/发作之前出现的早期征兆或前驱症状。"},"examples":[{"en":"For some people, fatigue and mood changes are prodromes of a migraine.","zh":"对一些人来说，疲劳和情绪变化是偏头痛发作的前驱症状。"},{"en":"Doctors asked whether there were any prodromes before the seizure.","zh":"医生询问在癫痫发作前是否出现过任何前驱症状。"}]},{"partOfSpeech":"n.","definition":{"en":"Warning signs that something is about to happen (more formal/literary use).","zh":"（较正式/文学用法）某事将要发生的预兆、先兆。"},"examples":[{"en":"The tense silence felt like the prodromes of a bigger conflict.","zh":"紧张的沉默像是更大冲突的先兆。"},{"en":"In the novel, small acts of cruelty are the prodromes of the tragedy to come.","zh":"在小说中，细小的残忍行为是即将到来的悲剧的先兆。"}]}],"synonyms":["early signs","warning signs","precursors","harbingers","premonitory symptoms"],"phonetic":"/ˈproʊdroʊmz/","extraExplanation":["“Prodromes”是“prodrome”的复数。单数：a prodrome；复数：prodromes。","词源来自希腊语，含义接近“跑在前面的人/先行者”，因此引申为“先兆”。","医学语境里常见搭配：prodrome/prodromal phase（前驱期）。例如偏头痛、癫痫发作、某些感染或精神疾病发作前可能出现prodromal symptoms（前驱症状）。"]}
{"word":"prodromic","summary":{"en":"Prodromic means “occurring before the main illness,” especially early warning symptoms.","zh":"prodromic 指“前驱的”，尤其是疾病主要症状出现前的预警性表现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Happening before the main illness or symptoms; relating to a prodrome (early warning signs).","zh":"（医学）前驱的；指主要疾病或症状出现之前发生的；与前驱症状（prodrome）有关的。"},"examples":[{"en":"She felt unusually tired and irritable—prodromic signs of a migraine.","zh":"她感到异常疲倦和烦躁——这是偏头痛的前驱症状。"},{"en":"Doctors started treatment when prodromic symptoms appeared.","zh":"医生在出现前驱症状时就开始治疗。"}]}],"synonyms":["premonitory","early","preliminary"],"phonetic":"/prəˈdrɑːmɪk/","extraExplanation":["词源与构词：来自希腊语 *prodromos*，意为“跑在前面的人/前导者”。在医学语境中，*prodrome* 指“疾病正式爆发前的预兆性症状”，因此 *prodromic* 就是“前驱性的”。","常见搭配：*prodromic phase*（前驱期）、*prodromic symptoms/signs*（前驱症状/体征）。在偏头痛、癫痫发作、感染性疾病、精神疾病早期（如精神病性障碍的前驱期）等讨论中较常见。","用法提示：*prodromic* 较正式、偏医学写作或临床表达；日常英语里更常说 “early warning signs” 或 “early symptoms”。"]}
{"word":"prodromous","summary":{"en":"Prodromous means “occurring beforehand as an early sign or warning.”","zh":"prodromous 指“先兆的、预示即将发生的（前驱的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before something else and signaling that it is about to happen; serving as an early warning sign.","zh":"（在某事发生前）先兆的；预示即将发生的；前驱的。"},"examples":[{"en":"A prodromous fever can appear a day or two before the main symptoms of the illness.","zh":"在疾病主要症状出现前一两天，可能会先出现先兆性的发热。"},{"en":"The writer uses a prodromous scene early in the novel to hint at the tragedy to come.","zh":"作者在小说开头安排了一个先兆性的场景，暗示即将到来的悲剧。"}]}],"synonyms":["premonitory","preliminary","forerunning","incipient"],"phonetic":"/proʊˈdroʊməs/","extraExplanation":["“prodromous”常见于医学与学术写作，尤其指疾病的“前驱期/前兆症状”（prodrome），例如偏头痛发作前的情绪变化或疲惫。日常口语里更常用“early sign / warning sign / preliminary”来表达类似意思。","词源来自希腊语，含义接近“跑在前面的人/先行者”，因此带有“在前、预告”的感觉。"]}
{"word":"prodromus","summary":{"en":"Prodromus means an early warning sign (especially before illness) or an introductory scholarly work.","zh":"prodromus 指（尤指疾病前的）前驱症状/预兆，也可指学术著作的导论或初步报告。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early sign or symptom that shows a disease or condition is about to begin; a precursor (similar to “prodrome”).","zh":"（疾病等的）前驱症状；预兆（类似 prodrome）。"},"examples":[{"en":"Fatigue can be a prodromus of the flu.","zh":"疲劳可能是流感的前驱症状。"},{"en":"Some people notice mood changes as a prodromus before a migraine attack.","zh":"有些人在偏头痛发作前会注意到情绪变化作为前驱症状。"}]},{"partOfSpeech":"n.","definition":{"en":"A preliminary or introductory work (often the first part of a larger scholarly project), especially used in older academic titles.","zh":"（多见于较旧的学术著作书名中）导论；预备性著作；前言性质的作品。"},"examples":[{"en":"The book was published as a prodromus to a larger catalog of plants.","zh":"这本书作为一部更大型植物目录的导论而出版。"},{"en":"In the 1800s, some scientists used “Prodromus” in titles to signal an early report of results.","zh":"19世纪时，一些科学家会在书名中用“Prodromus”来表示研究成果的初步报告。"}]}],"synonyms":["prodrome","precursor","harbinger","forewarning","prelude"],"phonetic":"/proʊˈdroʊməs/","extraExplanation":["“prodromus”来自希腊语词根，含义与“跑在前面/预先出现”有关，所以常指“先出现的迹象”。英语里更常见的是同源词“prodrome”，而“prodromus”多见于医学写作或拉丁化的学术语境。","在植物学与博物学传统中，“Prodromus”常出现在拉丁文/拉丁化书名里，意思接近“初步报告、先导性整理”，暗示后续还会有更完整的大部头出版。"]}
{"word":"prodrug","summary":{"en":"A prodrug is an inactive (or less active) substance that the body converts into an active drug.","zh":"prodrug 指“前药”：进入体内后才被转化为活性药物的（较不活跃的）物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or chemical that is inactive (or less active) when you take it, and is changed by the body into the active drug.","zh":"一种药物或化学物质：服用时本身不活跃（或活性较低），进入体内后被代谢转化为真正发挥作用的活性药物。"},"examples":[{"en":"Oseltamivir (Tamiflu) is a prodrug that the body converts into its active form.","zh":"奥司他韦（达菲）是一种前药，人体会把它转化成活性形式。"},{"en":"Some drugs are designed as prodrugs to improve absorption or reduce side effects.","zh":"有些药物被设计成前药，以提高吸收或减少副作用。"}]}],"synonyms":["precursor (in pharmacology)","inactive precursor"],"phonetic":"/ˈproʊˌdrʌɡ/","extraExplanation":["“pro-”在这里表示“前/先”，不是“赞成”。“prodrug”常译为“前药”。常见原因包括：让药物更容易被肠道吸收、通过肝脏或特定组织后才被“激活”、或降低对胃的刺激等。","在医学写作中常会看到“X is a prodrug of Y”（X是Y的前药），意思是X在体内会转化成真正起作用的Y。"]}
{"word":"prods","summary":{"en":"“Prods” means either small pokes (plural noun) or “pokes/urges” (third-person singular of the verb “prod”).","zh":"“prods”既可指“几次轻戳/轻推”（名词复数），也可表示“轻戳/催促”（动词第三人称单数，来自 prod）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun, plural) small pokes or pushes, especially with a finger or a pointed object, meant to make someone or something move or react","zh":"（名词复数）轻戳、轻推（尤指用手指或尖物），用来让人/物移动或作出反应"},"examples":[{"en":"She gave him a few prods to wake him up.","zh":"她轻戳了他几下把他叫醒。"},{"en":"The dog responded to gentle prods with a stick.","zh":"那只狗对木棍轻轻的戳弄有反应。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) pokes or pushes lightly, often to encourage action or get attention","zh":"（动词第三人称单数）轻戳、轻推；（常指）催促行动或引起注意"},"examples":[{"en":"The teacher prods the class to speak more English.","zh":"老师会督促全班多讲英语。"},{"en":"A deadline prods him to finish the report.","zh":"截止日期促使他把报告做完。"}]}],"synonyms":["pokes","nudges","jabs","urges","prompts"],"phonetic":"/prɑdz/","extraExplanation":["“prods”可以是名词复数（several prods），也可以是动词第三人称单数（he/she/it prods）。词根是“prod”（轻戳/催促）。在比喻用法里，常见结构是“prod someone into doing something”（促使某人做某事）。"]}
{"word":"produc","summary":{"en":"“Produce” most commonly means “to make/create” (verb). It can also mean “fresh fruits and vegetables” (noun).","zh":"“Produce”最常用作动词，表示“生产/制作/导致”。也可作名词，指“农产品；新鲜水果和蔬菜”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make or create something; to cause something to happen","zh":"生产；制造；创作；导致（某事发生）"},"examples":[{"en":"This factory produces cars for the U.S. market.","zh":"这家工厂为美国市场生产汽车。"},{"en":"Regular practice produces better results.","zh":"规律练习会带来更好的结果。"},{"en":"The film was produced by a small studio.","zh":"这部电影由一家小型制片公司制作。"}]},{"partOfSpeech":"n.","definition":{"en":"fresh fruit and vegetables (especially in a grocery store)","zh":"（商店里的）农产品；新鲜水果和蔬菜"},"examples":[{"en":"The produce here is fresh and affordable.","zh":"这里的农产品新鲜又实惠。"},{"en":"You can find apples in the produce section.","zh":"你可以在生鲜蔬果区找到苹果。"}]}],"synonyms":["make","create","manufacture","generate","grow","bring about"],"phonetic":"/prəˈdus/","extraExplanation":["你输入的“produc”看起来像是不完整的拼写。最常见的可能是：\n1) produce /prəˈdus/（动词：生产、制作；名词：农产品）\n2) product /ˈprɑdʌkt/（名词：产品、产物）\n如果你想查的是“product”，告诉我我可以按“product”再给你一份词条。","发音小提示：produce 作动词重音在第二音节（pro-DUCE）；而 product 重音在第一音节（PRO-duct）。"]}
{"word":"producal","summary":{"en":"“Producal” is not standard; it most likely means “procedural”: relating to or following an official procedure.","zh":"“producal”不是标准拼写；最可能是“procedural”：与程序/流程有关，或按程序进行的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “procedural”) Related to a procedure—i.e., the official or usual way of doing something, especially in work, law, or rules.","zh":"（多半想写的是 procedural）与“程序/流程”有关的；指做事的规定步骤，常用于工作、法律或规则场景。"},"examples":[{"en":"There was a procedural error in the paperwork, so we had to start over.","zh":"文件处理上出现了程序性错误，所以我们得重新开始。"},{"en":"The judge dismissed the case for procedural reasons.","zh":"法官因程序性原因驳回了此案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Following the required steps or formal rules (often contrasted with “substantive,” meaning the main content/issue).","zh":"遵循规定步骤或正式规则的（常与 substantive“实体/内容层面”相对）。"},"examples":[{"en":"We need procedural approval before we can publish the report.","zh":"发布报告前我们需要走程序性审批。"},{"en":"It’s a procedural matter, not a disagreement about the facts.","zh":"这是程序问题，不是对事实本身的分歧。"}]}],"synonyms":["process-related","formal","step-by-step","regulatory","protocol-based"],"phonetic":"/prəˈsidʒərəl/","extraExplanation":["“producal”不是常见的标准英语拼写。最接近、最常见的可能是 **procedural**（程序性的）。如果你想表达“挥霍的/浪费的”，可能是 **prodigal**。","**procedural** 常见搭配：procedural error（程序错误）、procedural rules（程序规则）、procedural justice（程序正义）。","在法律与行政语境中：procedural reasons 通常指“因为流程/手续不符合规定”，不一定表示事情本身（实体）对错。"]}
{"word":"produce","summary":{"en":"“Produce” most commonly means to make or create something (goods, results, ideas), and it can also mean to present something (like evidence) or to produce a film/music project.","zh":"“produce”最常见的意思是“生产/制造/创造（产品、结果、想法）”，也可指“出示（证据等）”，还可表示“制作（影视/音乐项目）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make or create something, especially by a process (such as growing, manufacturing, or developing)","zh":"生产；制造；制作；（通过某种过程）创造出某物"},"examples":[{"en":"This factory produces electric cars.","zh":"这家工厂生产电动汽车。"},{"en":"The tree produces fruit every summer.","zh":"这棵树每年夏天结果。"},{"en":"The team produced a new plan after many meetings.","zh":"开了很多次会后，团队制定出了一个新计划。"}]},{"partOfSpeech":"vt.","definition":{"en":"to show, present, or bring out something for others to see or use (often as proof or evidence)","zh":"出示；拿出；提出（供他人查看或使用，常指证据）"},"examples":[{"en":"He produced his ID at the door.","zh":"他在门口出示了身份证件。"},{"en":"The lawyer produced new evidence in court.","zh":"律师在法庭上提出了新的证据。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause a result or effect","zh":"引起；导致（某种结果或影响）"},"examples":[{"en":"Stress can produce headaches.","zh":"压力会引起头痛。"},{"en":"A small change in policy produced big improvements.","zh":"政策的一个小变化带来了很大的改善。"}]},{"partOfSpeech":"vt.","definition":{"en":"to organize and manage the making of a movie, play, TV show, or music recording","zh":"（影视/戏剧/音乐）制作；担任制片（统筹并管理制作过程）"},"examples":[{"en":"She produced a documentary about ocean pollution.","zh":"她制作了一部关于海洋污染的纪录片。"},{"en":"He has produced albums for several famous singers.","zh":"他为好几位知名歌手制作过专辑。"}]}],"synonyms":["make","create","manufacture","generate","cause","present","turn out"],"phonetic":"/prəˈdus/","extraExplanation":["“produce”既可以指“生产/制造”（常见于工厂、农业、商业语境），也可以指“拿出/出示”（多用于正式或法律场景，如 produce evidence）。注意它在日常口语里较正式；更口语的说法有 make（做）、create（创造）、show（展示/出示）。","名词形式“produce”（重音常在第一音节）指“农产品；（尤指）新鲜蔬果”，如 grocery store produce section（超市生鲜蔬果区）。动词“produce”（重音在第二音节）意为“生产/造成/出示”。两者拼写相同但读音重音不同，是英语中常见的“名词-动词重音变化”现象。"]}
{"word":"produceable","summary":{"en":"Produceable means “able to be produced or made,” and less commonly “able to be presented (as evidence or documents).”","zh":"Produceable 指“可被生产/制造的”，较少见地也可指“（证据或文件）可出示/可提交的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be produced or made; possible to manufacture or create.","zh":"可被生产的；可制造的；能产生的。"},"examples":[{"en":"The design is simple and produceable at a low cost.","zh":"这个设计很简单，可以低成本生产。"},{"en":"We need a produceable plan, not just an idea.","zh":"我们需要一个可执行、能落地的方案，而不只是一个想法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of evidence or documents) Able to be presented or shown, especially in a formal or legal setting.","zh":"（证据或文件）可提交的；可出示的（尤用于正式或法律场合）。"},"examples":[{"en":"Only produceable records should be included in the report.","zh":"报告中只应包含可提交的记录。"},{"en":"The lawyer asked whether the emails were produceable in court.","zh":"律师询问这些邮件是否能在法庭上出示。"}]}],"synonyms":["producible","manufacturable","makeable","feasible","presentable","disclosable"],"phonetic":"/prəˈduːsəbəl/","extraExplanation":["“produceable”在现代英语中较少见，更常见的拼写是“producible”，意思相同。写作或考试中建议优先使用“producible”，以避免被认为是非标准拼写。","在商业语境中，“produceable”常带有“可量产、可落地制造”的含义；在法律/合规语境中，则更接近“可出示、可提交（证据披露）”。"]}
{"word":"produceableness","summary":{"en":"“Produceableness” is a rare/nonstandard noun meaning “the ability to be produced”; usually say “producibility.”","zh":"“produceableness”是罕见/非标准名词，意为“可被生产的能力”；通常用“producibility”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) the quality of being able to be produced or made; producibility.","zh":"（非标准用法）可被生产、制造的性质；可生产性。"},"examples":[{"en":"The report discusses the producibility of the design, not its beauty.","zh":"报告讨论的是这个设计的可生产性，而不是美观。"},{"en":"We need materials that improve the product’s producibility at scale.","zh":"我们需要能提高该产品规模化可生产性的材料。"}]}],"synonyms":["producibility","manufacturability","feasibility"],"phonetic":"/prəˈdusəbəlnəs/","extraExplanation":["“produceableness”在现代英语中几乎不使用，常见写法通常是 **producibility**（可生产性）或形容词 **producible**（可生产的、可制造的）。","构词思路来自 produce + -able + -ness，但英语里更自然的表达往往用拉丁词根形式（如 producible / producibility）。在正式写作、工程或制造语境中，建议用 **producibility**。"]}
{"word":"produced","summary":{"en":"“Produced” usually means “made/created/caused” (past of produce) or “made and managed” a film/show; it can also be an adjective meaning “made in a place or by a process.”","zh":"“Produced”通常表示“生产/制造/产生”（produce的过去式/过去分词），也可指“制作并统筹”电影/节目；还可作形容词表示“某地或某过程生产/生成的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"made or created something (often a result of a process, effort, or performance); past tense/past participle of “produce.”","zh":"制造了/生产了某物；产生了某种结果（常指经过过程、努力或表演后的成果）；为“produce”的过去式/过去分词。"},"examples":[{"en":"The factory produced 5,000 cars last month.","zh":"那家工厂上个月生产了5000辆汽车。"},{"en":"Her research produced surprising results.","zh":"她的研究产生了令人惊讶的结果。"},{"en":"He produced his ID at the entrance.","zh":"他在入口处出示了身份证。"}]},{"partOfSpeech":"vt.","definition":{"en":"(of a book, film, show, etc.) made and organized it, especially by managing money, people, and planning; past tense/past participle of “produce.”","zh":"（指书、电影、节目等）制作并组织（尤其负责资金、人员与计划）；为“produce”的过去式/过去分词。"},"examples":[{"en":"The movie was produced by a small studio.","zh":"这部电影由一家小型制片公司制作。"},{"en":"She produced a podcast series for language learners.","zh":"她为语言学习者制作了一系列播客。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) brought forth; created; resulting from a process (often used before a noun).","zh":"（形容词）被生产出来的；被创造出来的；由某过程产生的（常作定语）。"},"examples":[{"en":"Locally produced honey tastes fresh.","zh":"本地生产的蜂蜜尝起来很新鲜。"},{"en":"This report is based on produced data, not guesses.","zh":"这份报告基于已生成的数据，而不是猜测。"}]}],"synonyms":["made","created","manufactured","generated","caused","developed","crafted","produced (a show/film: made)"],"phonetic":"/prəˈdust/","extraExplanation":["在英语里，单独看到“produced”时，常见两种用法：\n1）作动词过去式/过去分词（The company produced… / has produced…）；\n2）作形容词放在名词前（locally produced goods）。\n语境会决定它是“生产/制造/产生”，还是“制作（电影、节目）”，或“出示（证件、文件）”。"]}
{"word":"producement","summary":{"en":"“Producement” is a rare/obsolete noun meaning “production” or “something produced.” In modern English, “production” or “product” is much more common.","zh":"“producement”是一个罕见/过时名词，意思接近“生产/产出”或“产物”。现代英语更常用“production”或“product”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) The act or process of producing; production.","zh":"（罕见/过时）生产；产生的过程。"},"examples":[{"en":"The report described the producment of goods during the war years.","zh":"报告描述了战争年代物资的生产情况。"},{"en":"Some older texts use “producement” where we would now say “production.”","zh":"一些较老的文本会用“producement”，而现代英语通常说“production”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Something that is produced; a product or result.","zh":"（罕见）产物；成果；结果。"},"examples":[{"en":"The invention was the finest producment of his early career.","zh":"这项发明是他早期职业生涯中最出色的成果。"},{"en":"Their collaboration led to a useful producment: a simple teaching guide.","zh":"他们的合作带来了一个有用的成果：一份简明教学指南。"}]}],"synonyms":["production","product","output","creation","result"],"phonetic":"/prəˈdusmənt/","extraExplanation":["“producement”由 produce（生产、产生）+ 后缀 -ment（表示“行为/结果”）构成，但在现代英语里几乎不用。日常写作与考试更推荐用 production（生产；作品）或 product（产品；产物）。","如果你是在论文或旧文献中看到它，通常不是拼写错误，而是一种较旧或较少见的用法；不过在现代正式写作中使用可能显得不自然。"]}
{"word":"producent","summary":{"en":"“Producent” is not standard English; the correct English word is “producer.”","zh":"“producent”不是标准英语；对应的正确英语词是“producer”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard in English) A misspelling or foreign-language form of “producer”: a person or company that makes goods, creates content, or finances/organizes a project (especially films, TV, music).","zh":"（在英语中不标准）常见拼写错误或外来形式，相当于“producer”：指生产商品的人或公司；也指为电影、电视、音乐等项目出资、组织并推动完成的“制片人/制作人”。"},"examples":[{"en":"In English, you should write “producer,” not “producent.”","zh":"在英语里应写“producer”，而不是“producent”。"},{"en":"The film producer hired the director and managed the budget.","zh":"电影制片人雇了导演并管理预算。"},{"en":"This company is a major producer of coffee.","zh":"这家公司是咖啡的主要生产商。"}]}],"synonyms":["producer","manufacturer","maker","creator"],"phonetic":"/prəˈdusər/","extraExplanation":["“Producent”在波兰语、瑞典语、荷兰语等语言里常见，意思接近英语的“producer”。如果你是在写英文简历/邮件/作业，建议统一用“producer”。","英语里“producer”既可指“生产者/生产商”，也常指影视行业的“制片人/制作人”；具体译法可根据语境选择。"]}
{"word":"producer","summary":{"en":"A producer is someone who makes goods, manages the creation of media (films/music), or, in ecology, an organism that makes its own food.","zh":"producer 指“生产者/制造商”，也指影视音乐等的“制片人/制作人”；在生态学中指能自制养分的“生产者”（如植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that makes or grows goods (especially food or raw materials) for sale.","zh":"生产者；制造商；（尤指农产品或原材料的）出产者/供货者。"},"examples":[{"en":"Local producers sell fresh vegetables at the weekend market.","zh":"本地生产者在周末市场出售新鲜蔬菜。"},{"en":"The country is a major producer of coffee.","zh":"这个国家是咖啡的主要生产国。"}]},{"partOfSpeech":"n.","definition":{"en":"A person responsible for organizing and managing the making of a movie, TV show, music recording, or other performance, often handling budgets, schedules, and hiring.","zh":"（电影/电视/音乐等的）制片人；制作人（常负责预算、进度与人员安排）。"},"examples":[{"en":"The producer approved the final cut of the film.","zh":"制片人批准了电影的最终剪辑版。"},{"en":"She works as a music producer in Los Angeles.","zh":"她在洛杉矶担任音乐制作人。"}]},{"partOfSpeech":"n.","definition":{"en":"In ecology, an organism (such as a plant or algae) that produces its own food, usually through photosynthesis; the first level in a food chain.","zh":"（生态学）生产者（如植物、藻类等能通过光合作用制造养分的生物；食物链的第一营养级）。"},"examples":[{"en":"Plants are producers in most ecosystems.","zh":"在大多数生态系统中，植物是生产者。"},{"en":"Without producers, the rest of the food chain cannot survive.","zh":"没有生产者，食物链的其他部分就无法生存。"}]}],"synonyms":["manufacturer","maker","creator","film producer","grower","supplier"],"phonetic":"/prəˈduːsər/","extraExplanation":["词源提示：producer 来自动词 produce（生产、制作、出产）+ -er（表示“做某事的人/物”）。所以 producer 的核心概念是“把某种东西做出来/促成出来的人或机构”，在不同行业里就具体化为“制造商”“制片人/制作人”“生态学的生产者”。","文化语境：在影视行业里，producer 的权力与职责因项目而异；常见区分包括 executive producer（执行制片人，偏资金/统筹）与 line producer（制作主任/现场制片，偏日程与成本控制）。"]}
{"word":"producere","summary":{"en":"*Producere* is a Latin verb sometimes cited in English writing, meaning “to lead forth; bring out; produce.”","zh":"*producere* 是一个偶尔在英语学术/法律写作中引用的拉丁动词，意思是“引出；带出；产生/使出现”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used rarely in English academic/legal writing) to lead forth; to bring out; to produce.","zh":"（拉丁语；在英语学术/法律语境中偶见）带出；引出；产生；使出现。"},"examples":[{"en":"In classical Latin, *producere* can mean “to bring something forward into view.”","zh":"在古典拉丁语中，*producere* 可以表示“把某物带到前面让人看到”。"},{"en":"The author uses the Latin verb *producere* to emphasize the idea of “bringing forth” new ideas.","zh":"作者用拉丁动词 *producere* 来强调“孕育/提出”新思想的含义。"}]}],"synonyms":["bring forth","bring out","produce","lead out"],"phonetic":"/proʊduˈsɛreɪ/","extraExplanation":["“producere”不是常见的英语单词，更常见的是：\n- **produce** /prəˈdus/（动词：生产；名词：农产品）\n- **producer** /prəˈdusɚ/（名词：生产者；电影/音乐制作人）\n如果你本来想查的是其中一个，请告诉我你想要的词，我可以给出更地道的英语用法与例句。","词源上它与英语 **produce** 同源：来自拉丁语 *pro-*（向前）+ *ducere*（引导）。因此核心意象是“把东西带到前面/带出来”，引申为“产生、提出、生产”。"]}
{"word":"producers","summary":{"en":"“Producers” can mean makers/suppliers of goods, media producers who manage productions, or (in biology) organisms like plants that make their own food.","zh":"“producers”可指商品的生产者/制造商，影视音乐等项目的制片人/制作人，或（生物学中）如植物等能自行制造养分的生产者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that create, make, or supply goods, products, or services.","zh":"生产者；制造商；供应商（指制造或提供商品、产品或服务的人或公司）"},"examples":[{"en":"Local producers sell fresh vegetables at the weekend market.","zh":"当地生产者在周末市场出售新鲜蔬菜。"},{"en":"The country relies on oil producers for most of its export income.","zh":"这个国家的大部分出口收入依赖石油生产国/生产商。"}]},{"partOfSpeech":"n.","definition":{"en":"People who organize and manage the making of a movie, TV show, album, or other media project (including budget, schedule, and hiring).","zh":"（电影/电视/音乐等的）制片人；制作人（负责统筹项目，如预算、进度和人员）"},"examples":[{"en":"The producers approved the final cut of the film.","zh":"制片人批准了电影的最终剪辑版。"},{"en":"She worked as a producer on a popular podcast.","zh":"她在一档热门播客中担任制作人。"}]},{"partOfSpeech":"n.","definition":{"en":"In ecology and biology, organisms (like plants and algae) that make their own food, usually using sunlight (photosynthesis).","zh":"（生态/生物）生产者（如植物、藻类等，通常通过光合作用自己制造养分）"},"examples":[{"en":"Plants are producers at the base of many food chains.","zh":"植物是许多食物链底层的生产者。"},{"en":"Without producers, the ecosystem cannot support consumers.","zh":"没有生产者，生态系统就无法支撑消费者（动物等）。"}]}],"synonyms":["manufacturers","makers","suppliers","film producers","creators"],"phonetic":"/prəˈdusɚz/","extraExplanation":["“Producers”是复数形式，单数是“producer”。在商业语境中常指“生产者/制造商”，在影视音乐行业中特指“制片人/制作人”，在生态学里是食物链中的“生产者”。理解时主要看上下文（market/oil vs. film/album vs. ecosystem/food chain）。","常见搭配：food producers（食品生产商/生产者）, oil producers（石油生产国/生产商）, film/TV producers（电影/电视制片人）, executive producer（执行制片人）。"]}
{"word":"producership","summary":{"en":"The role or position of a producer, especially in media (film/TV/music).","zh":"指制片人（制作人）的职位、身份或任期，常用于影视等媒体语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, role, or term of office of a producer (especially in film, TV, music, or theater)","zh":"（尤指电影、电视、音乐或戏剧中的）制片人职位／身份；制片任期"},"examples":[{"en":"She accepted the producership of the new documentary series.","zh":"她接受了这部新纪录片系列的制片人职位。"},{"en":"During his producership, the show won several awards.","zh":"在他担任制片人期间，这个节目获得了多个奖项。"}]}],"synonyms":["producer role","producer position","producer credit","production leadership"],"phonetic":"/prəˈduːsərʃɪp/","extraExplanation":["“producership”在现代英语里不算常用，更常见的说法是“producer role / producer position / as producer / producer credit”。它由 producer（制片人/制作人）+ -ship（表示“身份、职位、任期”，如 leadership）构成。","在影视行业语境中，它通常强调“担任制片人的身份/任期”，而不强调具体的制作流程本身；若要表达“制作工作/制作过程”，更常用“production”。"]}
{"word":"produces","summary":{"en":"“Produces” most commonly means “makes/creates” or “causes” (the third-person singular form of the verb “produce”). It can also mean “shows/provides (evidence),” and less commonly it is the plural of the noun “produce” (fruits and vegetables).","zh":"“produces”最常见是动词 produce 的第三人称单数，表示“制造/产生/导致（结果）”，也可表示“出示/提供（证据等）”。较少见时，它是名词 produce（农产品、水果蔬菜）的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “produce”) to make, create, or cause something to happen; to bring about a result.","zh":"（produce 的第三人称单数）制造、产生或导致某事发生；带来某种结果。"},"examples":[{"en":"This factory produces car parts.","zh":"这家工厂生产汽车零部件。"},{"en":"Too much stress produces headaches for some people.","zh":"压力过大对一些人来说会引发头痛。"},{"en":"The new policy produces better outcomes in schools.","zh":"新政策在学校里带来了更好的结果。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “produce”) to show or provide something for inspection, proof, or use.","zh":"（produce 的第三人称单数）出示；提供（以供检查、证明或使用）。"},"examples":[{"en":"He produces his ID at the entrance.","zh":"他在入口处出示身份证件。"},{"en":"The lawyer produces new evidence in court.","zh":"律师在法庭上提交新证据。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “produce” (noun): fresh fruits and vegetables, especially sold in a store or market.","zh":"produce（名词）的复数：农产品，尤指商店或市场里出售的新鲜水果和蔬菜。"},"examples":[{"en":"The store sells organic produces from local farms.","zh":"这家店出售来自本地农场的有机农产品。"},{"en":"Wash all fresh produces before eating.","zh":"所有新鲜农产品食用前都要清洗。"}]}],"synonyms":["makes","creates","generates","causes","manufactures","yields"],"phonetic":"/prəˈduːsɪz/","extraExplanation":["“produce”作动词和名词时重音不同：\n- 动词 proDUCE /prəˈduːs/（重音在第二音节），所以 “produces” 常读作 /prəˈduːsɪz/。\n- 名词 PROduce /ˈproʊduːs/（重音在第一音节），复数 “produces” 的读法也会随之变化。\n学习时可用“动词重后、名词重前”来记。"]}
{"word":"producibility","summary":{"en":"Producibility means how doable it is to produce something (especially in manufacturing), and sometimes refers to how results can be produced again in research.","zh":"Producibility 指（尤其在制造业中）某物的可生产性/可量产性；在科研中有时也指结果的可再产生性（常与可重复性相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to be produced or manufactured; how feasible it is to make something reliably, at scale, and with acceptable cost and quality.","zh":"可生产性；（产品/设计）被制造出来的可行性与可量产性，通常考虑成本、品质、稳定性等。"},"examples":[{"en":"Engineers improved the producibility of the part by simplifying its shape.","zh":"工程师通过简化零件形状来提高它的可生产性。"},{"en":"This new design has better producibility, so the factory can make it faster and cheaper.","zh":"这个新设计的可生产性更好，所以工厂能更快、更便宜地生产。"}]},{"partOfSpeech":"n.","definition":{"en":"In science and research: the extent to which a result can be produced again under the same conditions (a concept close to “reproducibility”).","zh":"在科研语境中：结果在相同条件下再次产生的程度（概念接近“reproducibility / 可重复性”）。"},"examples":[{"en":"They questioned the producibility of the experiment’s findings in other labs.","zh":"他们质疑这个实验结果在其他实验室中的可再产生性。"}]}],"synonyms":["manufacturability","production feasibility","makeability","repeatability (research context)","reproducibility (research context)"],"phonetic":"/pɹəˌdusəˈbɪlɪti/","extraExplanation":["“Producibility”更常见于工程、制造与设计评审（例如 DFM：Design for Manufacturing）。它强调“能不能做出来、好不好做、适不适合量产”。","科研写作里通常更常用“reproducibility（可重复性）”或“replicability（可复现性）”。如果你想表达“实验能否被别人重复得到同样结果”，优先用“reproducibility”。"]}
{"word":"producible","summary":{"en":"“Producible” means something can be made/produced, or can be provided/presented (often as evidence).","zh":"“Producible”指「可被生產/製造的」，也可指「可被提供或出示（常作證據）」的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be produced, created, or made (often on demand or in large amounts).","zh":"可生产的；可制造的（常指能按需求或大量生产）。"},"examples":[{"en":"The design is attractive, but we need to know if it’s producible at scale.","zh":"这个设计很吸引人，但我们需要知道它是否能规模化生产。"},{"en":"Not every lab prototype is easily producible in a factory.","zh":"并不是每个实验室原型都能轻易在工厂里生产出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be shown, provided, or presented (especially as proof or evidence).","zh":"可提供的；可出示的（尤指作为证据）。"},"examples":[{"en":"All receipts must be producible during an audit.","zh":"在审计期间，所有收据都必须能够出示。"},{"en":"Make sure the documents are producible if the court requests them.","zh":"确保如果法院要求，这些文件能够提供出来。"}]}],"synonyms":["manufacturable","makeable","feasible","presentable","available"],"phonetic":"/prəˈduːsəbəl/","extraExplanation":["“Producible”來自動詞 produce（生產／出示）+ 形容詞後綴 -ible（表示「能夠被……的」），常見於商業、工程、製造，以及法律或合規語境。","在英語裡，談製造可行性時常見搭配：producible at scale（可量產）、commercially producible（具商業量產可能）、mass-producible（可大規模生產）。","在法律文件中，“producible”常與 discovery（證據開示）、audit（審計）一起出現，意思接近 “available to be produced”＝能夠被提交/出示。"]}
{"word":"producibleness","summary":{"en":"Producibleness means the state or quality of being able to be produced or made.","zh":"Producibleness 指“能够被生产/制造”的性质或状态（常见替代词：producibility）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being able to be produced or made (especially in a practical or reliable way)","zh":"“可被生产/制造”的性质或状态（尤指在实际或可靠的条件下能够产出）"},"examples":[{"en":"We tested the design’s producibleness before approving mass production.","zh":"在批准量产之前，我们测试了这个设计的可生产性。"},{"en":"The report questions the producibleness of the new material at scale.","zh":"报告质疑这种新材料在规模化条件下的可生产性。"}]}],"synonyms":["producibility","manufacturability","feasibility"],"phonetic":"/prəˈduːsəbəlnəs/","extraExplanation":["“producibleness”是由形容词 producible（可生产的、可制造的）加名词后缀 -ness（……的性质/状态）构成的抽象名词。","这个词在日常英语中很少见；写作或专业场景里更常用的替代表达是 producibility（可生产性/可制造性）或 manufacturability（可制造性，偏工程/制造领域）。","语气上它偏“技术/书面”，用在项目评估、工艺验证、供应链讨论等语境更自然。"]}
{"word":"producing","summary":{"en":"“Producing” means making, creating, or generating something; it can be a noun (the process) or a verb form (currently making).","zh":"“producing”表示“生产/制造/产生”；既可作名词（过程），也可作动词形式（正在生产/制作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making, creating, or generating something (often goods, results, or effects)","zh":"生产；制造；产生（某物的过程或行为，常指产品、结果或影响）"},"examples":[{"en":"Producing enough food for the winter was the village’s main concern.","zh":"生产足够的粮食以度过冬天是村里最关心的事。"},{"en":"The machine is capable of producing clean energy from sunlight.","zh":"这台机器能够利用阳光产生清洁能源。"}]},{"partOfSpeech":"v.","definition":{"en":"making or creating something; bringing something into existence (present participle/gerund of “produce”)","zh":"生产；制造；产生（动词 produce 的现在分词/动名词形式）"},"examples":[{"en":"They are producing a new documentary about jazz history.","zh":"他们正在制作一部关于爵士乐历史的新纪录片。"},{"en":"The company is producing more cars to meet demand.","zh":"公司正在生产更多汽车以满足需求。"}]}],"synonyms":["making","creating","manufacturing","generating","forming","turning out"],"phonetic":"/prəˈdusɪŋ/","extraExplanation":["“Producing”通常来自动词“produce”。在商业与工厂语境里更偏“生产/制造”（produce goods）；在创作语境里常指“制作”（produce a film/music）；在科学或自然语境里常指“产生”（produce energy/effects）。","语法提示：当“producing”作名词（动名词）时，可作主语或宾语：Producing vaccines takes time（生产疫苗需要时间）。当作动词时，多用于进行时：They are producing…（他们正在生产/制作……）。"]}
{"word":"product","summary":{"en":"Product most commonly means something made or offered for sale; it can also mean a result of something or, in math, a multiplication answer.","zh":"product 最常见指“产品/商品（或服务）”；也可指“结果/产物”，在数学中还指“乘积”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is made or grown to be sold; an item or service offered to customers.","zh":"（可供出售的）产品；商品；（也可指）服务。"},"examples":[{"en":"This company makes eco-friendly cleaning products.","zh":"这家公司生产环保清洁产品。"},{"en":"They’re launching a new product next month.","zh":"他们下个月将推出一款新产品。"}]},{"partOfSpeech":"n.","definition":{"en":"A result or effect of a process, action, or situation.","zh":"（某过程、行动或情境的）结果；产物。"},"examples":[{"en":"His success is the product of years of practice.","zh":"他的成功是多年练习的成果。"},{"en":"Pollution can be a product of rapid industrial growth.","zh":"污染可能是工业快速增长的产物。"}]},{"partOfSpeech":"n.","definition":{"en":"In math, the answer you get when you multiply numbers.","zh":"（数学）积；乘积。"},"examples":[{"en":"The product of 6 and 7 is 42.","zh":"6和7的乘积是42。"}]}],"synonyms":["goods","item","merchandise","output","result"],"phonetic":"/ˈprɑːdʌkt/","extraExplanation":["在商业英语里，product 常与 marketing（营销）、brand（品牌）、launch（发布）、feature（功能/特点）、customer（客户）等搭配：例如 product launch（产品发布）、product design（产品设计）、product line（产品线）、product manager（产品经理）。","product vs. produce：product 通常指“被制造出来并用于销售的东西”；produce 多指“农产品（水果、蔬菜等）”，也可作动词表示“生产/制作”。"]}
{"word":"product line","summary":{"en":"A “product line” is a group or series of related products a company sells under one brand or category.","zh":"“product line”指公司在同一品牌或类别下销售的一组/一系列相关产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of related products made by the same company, usually under the same brand, designed for a similar market or purpose.","zh":"（同一家公司推出的）产品线：一组相关联的产品，通常在同一品牌下，面向相似的市场或用途。"},"examples":[{"en":"The company expanded its product line to include skincare and makeup.","zh":"这家公司扩大了产品线，把护肤品和化妆品都纳入其中。"},{"en":"Our product line offers three models at different price points.","zh":"我们的产品线提供三种型号，对应不同价位。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific category or series within a company’s offerings, often managed as one unit (for planning, marketing, and sales).","zh":"（企业内部管理/规划用的）某一类/系列产品：常作为一个整体进行规划、营销与销售。"},"examples":[{"en":"She is the manager responsible for the laptop product line.","zh":"她负责笔记本电脑这一产品线。"},{"en":"They discontinued the entire product line due to low demand.","zh":"由于需求低迷，他们停止了整条产品线。"}]}],"synonyms":["product range","line of products","product family"],"phonetic":"/ˈprɑː.dʌkt laɪn/","extraExplanation":["常见搭配：expand/extend a product line（扩展产品线）；launch a new product line（推出新产品线）；discontinue a product line（停产某条产品线）；product-line strategy（产品线策略）。","易混词：product line（同一品牌/用途下的一组相关产品）≠ product range（产品范围，更泛，强调“覆盖面”）≠ product portfolio（产品组合，强调公司所有产品/业务的整体布局）。"]}
{"word":"product placement","summary":{"en":"Product placement is advertising by featuring a real brand or product inside entertainment or other media content.","zh":"Product placement 指在影视或其他内容中植入真实品牌/产品，以实现广告宣传。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of showing or mentioning a brand-name product in a movie, TV show, video, game, or other media as a form of advertising.","zh":"（广告方式）在电影、电视剧、视频、游戏等媒体内容中展示或提及品牌产品，以达到宣传效果。"},"examples":[{"en":"The movie’s product placement included a close-up of the soda can.","zh":"这部电影里有产品置入广告，镜头特写了那罐汽水。"},{"en":"Some viewers felt the product placement was too obvious and distracting.","zh":"一些观众觉得植入广告太明显，影响观看体验。"},{"en":"Creators sometimes use product placement to fund a project without running traditional ads.","zh":"创作者有时会用植入广告来为项目筹资，而不必播放传统广告。"}]}],"synonyms":["embedded advertising","branded content","in-show advertising","brand integration"],"phonetic":"/ˈprɑːdʌkt ˈpleɪsmənt/","extraExplanation":["“product placement”常见近义说法有：branded content（品牌内容，通常更强调内容与品牌的融合）、embedded advertising（嵌入式广告）。在中文里常译为“植入广告/置入广告/产品植入”。","在美国影视与社交媒体语境中，产品植入可能引发“内容是否真实/是否过度商业化”的讨论；在YouTube、TikTok等平台，若为付费推广，通常会要求创作者进行赞助/广告披露（disclosure），例如标注“paid promotion”。"]}
{"word":"producted","summary":{"en":"“Producted” is not standard English; use “produced” (made) or “product” (thing made for sale).","zh":"“producted”不是标准英语；通常应改用“produced”（生产/制作）或“product”（产品）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/incorrect form in modern English. People sometimes write “producted” when they mean “produced” (made/created) or “product” (a thing made to be sold).","zh":"现代英语中不规范/错误的形式。有人会把“producted”写成想表达“produced”（生产/制作）或“product”（产品/成品）。"},"examples":[{"en":"Incorrect: The factory producted 1,000 cars last month.","zh":"错误：The factory producted 1,000 cars last month."},{"en":"Correct: The factory produced 1,000 cars last month.","zh":"正确：The factory produced 1,000 cars last month."},{"en":"Correct: This phone is a popular product.","zh":"正确：This phone is a popular product."}]}],"synonyms":["produced","made","manufactured"],"phonetic":"/prəˈdʌktɪd/","extraExplanation":["“produce”的过去式/过去分词是“produced”，不是“producted”。因为动词是 produce（生产），而 product 是名词（产品）；在英语里通常不能直接把名词 product 加 -ed 当作动词过去式。","如果你想表达“由……生产/制作”，常见结构是：be produced (by…)；例如：These parts are produced in Korea.","在一些非常口语或非正式语境里偶尔能看到“producted”，但在标准写作、考试、工作邮件中应避免。"]}
{"word":"productibility","summary":{"en":"Productibility means the capacity of a system or process to produce goods or results effectively.","zh":"productibility 指一个系统或过程有效产出产品或结果的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of something (a process, method, system, or environment) to produce products or results efficiently; producibility","zh":"（过程、方法、系统或环境的）产出能力；可生产性；生产效率（侧重能否顺利产出与产出水平）"},"examples":[{"en":"Engineers improved the productibility of the line by reducing machine downtime.","zh":"工程师通过减少机器停机时间，提高了生产线的产出能力。"},{"en":"The report compares productibility across different regions.","zh":"这份报告比较了不同地区的产出能力。"}]}],"synonyms":["producibility","productivity","output capacity","production capability"],"phonetic":"/ˌprɑːdəkˈtɪbəlɪti/","extraExplanation":["“productibility”在日常英语中不算常见，更常见的替代词包括：producibility（更偏“可生产/可再现地产出”）、productivity（生产率/生产力，强调单位时间产出）、manufacturability（可制造性，偏设计是否容易制造）。在工程与管理语境里，选词会影响强调点：想强调“能不能做出来/能不能稳定做出来”常用producibility；想强调“产出有多高”常用productivity。"]}
{"word":"productible","summary":{"en":"Productible means “able to be produced or made,” and it is a less common synonym of producible.","zh":"productible 意为“可生产/可制造的”，在现代英语中较少见，常作为 producible 的不太常用同义词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be produced or made; capable of being brought into existence","zh":"可生产的；可制造的；能够被创造出来的"},"examples":[{"en":"The design is productible with current technology.","zh":"这个设计用现有技术是可以生产出来的。"},{"en":"They checked whether the parts were productible at scale.","zh":"他们检查这些零件是否能进行规模化生产。"}]},{"partOfSpeech":"adj.","definition":{"en":"(mathematics/logic) capable of being constructed, derived, or proven to exist","zh":"（数学/逻辑）可构造的；可推导出的；可证明存在的"},"examples":[{"en":"The paper discusses which solutions are productible under the given rules.","zh":"论文讨论在给定规则下哪些解是可构造的。"}]}],"synonyms":["producible","manufacturable","makeable","feasible"],"phonetic":"/prəˈdʌktəbəl/","extraExplanation":["“productible”在现代英语中比较少见，更常用的是“producible”。在工程/制造语境里，常用“manufacturable”（可制造的）来强调工艺可行性。","词形上与“produce（生产/产生）”相关：productible = “能够被生产出来的”。在学术（尤其数学/逻辑）语境中，有时用来表示“可构造/可导出”。"]}
{"word":"productid","summary":{"en":"“Product ID” means a unique identifier for a product in a system.","zh":"“Product ID” 指用于在系统中唯一识别商品的产品编号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unique code or number used to identify a specific product in a system (such as an online store, inventory database, or app)","zh":"用于在系统（如网店、库存数据库或应用）中唯一识别某个商品的代码或编号（产品编号）"},"examples":[{"en":"Please enter the product ID to find the item in our catalog.","zh":"请输入产品编号以在我们的商品目录中找到该商品。"},{"en":"The product ID is printed on the receipt and on the product page.","zh":"产品编号会显示在收据和商品页面上。"},{"en":"If you send me the product ID, I can check the warranty status.","zh":"如果你把产品编号发给我，我可以查询保修状态。"}]}],"synonyms":["item number","product code","ID number","SKU (sometimes, depending on the system)"],"phonetic":"/ˈprɑːdʌkt aɪˈdiː/","extraExplanation":["在电商/仓储中，product ID 常指系统内部的唯一标识；而 SKU（库存单位）更常用于区分不同规格（颜色、尺码等）的库存管理。不同平台可能把两者合并或分别使用。","书写上常见 product ID、Product ID、productId（程式变量命名的驼峰式），你输入的 “productid” 多半是省略空格/大小写的写法。"]}
{"word":"productidae","summary":{"en":"Productidae: an extinct family of brachiopods known mainly from Paleozoic fossils.","zh":"Productidae：主要见于古生代化石记录的一类已灭绝的腕足动物科（产螺科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic family of extinct brachiopods (“lamp shells”) common in Paleozoic marine fossils (especially Carboniferous–Permian).","zh":"（古生物）产螺科：一类已灭绝的腕足动物科（俗称“灯壳”），在古生代海洋化石中很常见，尤以石炭纪—二叠纪为多。"},"examples":[{"en":"The limestone contains abundant Productidae fossils, suggesting a shallow marine environment.","zh":"这层石灰岩含有大量产螺科化石，说明当时可能是浅海环境。"},{"en":"In the museum display, Productidae shells are shown with their characteristic spines.","zh":"在博物馆展柜里，产螺科的壳体常与其典型的刺状结构一起展示。"}]}],"synonyms":["brachiopod family","productid brachiopods"],"phonetic":"/prəˈdʌktɪdi/","extraExplanation":["“Productidae”是拉丁化的生物分类名称，末尾“-idae”表示“科”（family），常见于动物分类学中（如Felidae猫科）。","它通常出现在地质学、古生物学与博物馆说明文字中；日常英语里不常用，多用于学术语境。"]}
{"word":"productile","summary":{"en":"“Productile” isn’t a standard word; it’s likely a misspelling of “projectile” or “productive.”","zh":"“productile”不是标准词，通常是把“projectile”或“productive”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often a misspelling of “projectile” or “productive,” depending on context.","zh":"不是标准英语单词。多半是拼写错误，常见可能想写的是“projectile（抛射物）”或“productive（高效的/富有成效的）”，需看语境。"},"examples":[{"en":"Did you mean “projectile” (a rock thrown through the air) or “productive” (a productive day)?","zh":"你想写的是“projectile”（比如被抛出的石头）还是“productive”（比如富有成效的一天）？"}]}],"synonyms":["projectile","productive"],"phonetic":"/prəˈdʌk.taɪl/","extraExplanation":["“Productile”常见于打字或拼写时把 proDUC-（productive）和 proJEC-（projectile）混在一起。","如果你给我一句包含该词的原句，我可以根据上下文判断你更可能想表达哪一个词，并给出准确释义与用法。"]}
{"word":"production","summary":{"en":"Production means the process of making something, the amount made, or the making/presentation of a play/film/show.","zh":"Production 可指“生产/制作的过程”，也可指“产量/产出”，还可指“戏剧电影等的制作或演出作品”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making or creating goods, services, or artistic work","zh":"生产；制作（商品、服务或艺术作品的过程）"},"examples":[{"en":"The factory increased production to meet demand.","zh":"工厂提高了产量以满足需求。"},{"en":"Food production depends on water and farmland.","zh":"粮食生产依赖水资源和耕地。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount of something that is made (output)","zh":"产量；产出（生产出来的数量）"},"examples":[{"en":"Oil production fell this month.","zh":"本月石油产量下降了。"},{"en":"Daily production is about 2,000 units.","zh":"日产量约为2,000件。"}]},{"partOfSpeech":"n.","definition":{"en":"the work of preparing and presenting a play, film, TV show, or event; also the finished show or performance","zh":"（戏剧/电影/电视节目/活动的）制作与呈现；也可指“作品/演出”本身"},"examples":[{"en":"The school put on a production of Hamlet.","zh":"学校上演了《哈姆雷特》。"},{"en":"She works in film production.","zh":"她在电影制作行业工作。"}]}],"synonyms":["manufacturing","output","creation","making"],"phonetic":"/prəˈdʌkʃən/","extraExplanation":["常见搭配：mass production（大规模生产/流水线生产）、production line（生产线）、production cost（生产成本）、increase/boost production（提高产量）、go into production（进入量产阶段）。","词源提示：production 来自拉丁语 producere（引出、产生）。因此它既可指“产生/制造的过程”，也可指“产生的结果（产量）”。","在商业语境里，production 常与 manufacturing（制造业）相关；但 production 更广，也可用于农业（food production）和媒体行业（film production）。"]}
{"word":"production line","summary":{"en":"A production line is a step-by-step factory system for making products, often like an assembly line.","zh":"production line 指工厂里按工序一步步制造产品的生产线/流水线，常与 assembly line（装配线）相近。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A set of machines and workers arranged in a sequence to make products step by step in a factory (an assembly process).","zh":"（工厂里）按工序顺序排列的一套机器与工人，用于一步步制造产品的生产流程/生产线（常指装配式生产）。"},"examples":[{"en":"The factory added a new production line to make electric cars.","zh":"这家工厂新增了一条生产线来制造电动汽车。"},{"en":"If one station stops, the whole production line can slow down.","zh":"如果某一道工序停了，整条生产线都可能变慢。"},{"en":"They trained new workers before letting them work on the production line.","zh":"他们在让新员工上生产线前先进行培训。"}]},{"partOfSpeech":"phrase","definition":{"en":"A particular product-making stream within a company (the people, equipment, and process dedicated to one type of product).","zh":"（公司内部）专门用于某一类产品的一条生产“线”（包括人员、设备与流程）。"},"examples":[{"en":"We have separate production lines for phones and tablets.","zh":"我们有手机和平板各自独立的生产线。"},{"en":"The company shut down the old production line and replaced the equipment.","zh":"公司关闭了旧生产线，并更换了设备。"}]}],"synonyms":["assembly line","manufacturing line","factory line","production line process"],"phonetic":"/prəˈdʌkʃən laɪn/","extraExplanation":["“production line”和“assembly line”很接近：assembly line（装配线）更强调把零件“装配”成成品；production line（生产线）范围更广，也可包含加工、检测、包装等环节。","常见搭配：run/operate a production line（运行生产线）、set up a production line（建立生产线）、automate the production line（自动化生产线）、production line worker（流水线工人）、production line efficiency（生产线效率）。","文化小知识：流水线大规模普及常与20世纪初的汽车工业（如福特）相关，后来成为现代制造业提升效率的典型方式。"]}
{"word":"productional","summary":{"en":"Productional means “related to production,” especially in manufacturing/business or in language production (speaking/writing) in linguistics.","zh":"productional 意为“与生产/产出有关的”，常用于制造/商业语境，也可用于语言学中指“语言产出（说/写）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the process of producing or manufacturing something (especially in industry or business).","zh":"与生产或制造过程有关的（尤指工业或商业领域）。"},"examples":[{"en":"The company made several productional changes to reduce waste.","zh":"公司做了几项生产方面的改变来减少浪费。"},{"en":"Productional costs rose after the price of energy increased.","zh":"能源价格上涨后，生产成本上升了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to language production—how people plan and say/write words and sentences (used in linguistics and psycholinguistics).","zh":"与语言产出有关——指人们如何计划并说出/写出词语和句子（用于语言学与心理语言学）。"},"examples":[{"en":"The study focuses on productional errors in second-language learners.","zh":"这项研究关注二语学习者在语言产出中的错误。"},{"en":"Productional fluency often improves with repeated speaking practice.","zh":"语言产出的流利度通常会随着反复口语练习而提高。"}]}],"synonyms":["productive (often different nuance)","manufacturing (contextual)","industrial (contextual)","production-related"],"phonetic":"/prəˈdʌkʃənəl/","extraExplanation":["“productional”不如“production”（名词）或“productive”（形容词）常见，更多见于学术写作或技术文档中。日常英语里常用“production”作名词修饰（production costs/production process），或用“manufacturing”表示“制造业/生产的”。","语言学里，“productional”强调“产出/表达”这一侧（说/写），常与“comprehension/perception”（理解/感知）对比。注意别和“productive”混用：productive更常表示“高产的/有成效的”，而productional更偏“与生产/产出过程相关的”。"]}
{"word":"productionem","summary":{"en":"“productionem” is a Latin form meaning “production” (accusative singular of *productio*), closely connected to the English word “production.”","zh":"“productionem”是拉丁语中表示“生产/产出（宾格单数）”的词形，与英语“production”同源、含义相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Latin word form meaning “production” or “a bringing forth/bringing forward” (accusative singular of Latin *productio*). Often appears in older Latin texts or Latin phrases, and it is related to the English word “production.”","zh":"拉丁语词形，意思是“生产；产出；提出/引出”（为拉丁语 *productio* 的宾格单数）。常见于古典或中世纪拉丁文文本/短语中，与英语“production”同源。"},"examples":[{"en":"In a Latin manuscript, you might see *productionem* used where English would say “production” as an object of a verb.","zh":"在拉丁文手稿里，你可能会看到 *productionem* 用作动词的宾语，英语通常对应“production/产出”。"},{"en":"Modern English: The factory increased production.","zh":"现代英语：这家工厂提高了产量。"}]}],"synonyms":["production","output","manufacturing","creation"],"phonetic":"/prəˈdʌkʃən/","extraExplanation":["“productionem”是拉丁语名词 *productio*（意为“生产、产出、提出/引出”）的宾格单数，常用来充当句子里的受事（被动词作用的对象）。如果你在铭文、法律文书或神学/哲学拉丁文中看到它，通常可以把它理解成英语的“production”。","词源上与英语“produce/production”同根：来自拉丁语 *pro-*（向前）+ *ducere*（引导、带领），核心意象是“把东西带到前面/带出来”，因此既可指“生产出产品”，也可指“提出（论点、证据等）”。"]}
{"word":"productionist","summary":{"en":"A productionist is someone (or something) that emphasizes production and higher output, often in economic or policy debates.","zh":"productionist 指强调“提高生产/产出”的人或立场，常用于经济与政策讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or emphasizes production (especially increasing output in industry, agriculture, or the economy).","zh":"生产主义者；主张强调生产/提高产出的人（尤指工业、农业或经济领域）。"},"examples":[{"en":"Some productionists argue that higher output should be the first national priority.","zh":"一些生产主义者认为，提高产出应是国家的首要任务。"},{"en":"The debate set productionists against environmental groups.","zh":"这场辩论让生产主义者与环保团体对立起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or favoring the idea that production and output should be emphasized.","zh":"与生产主义有关的；强调生产/产出的。"},"examples":[{"en":"The plan reflects a strongly productionist mindset.","zh":"这个计划体现了强烈的生产主义思维。"},{"en":"Critics called the policy too productionist and not sustainable.","zh":"批评者称该政策过于生产主义，缺乏可持续性。"}]}],"synonyms":["productivist","producer (context-dependent)","pro-growth (context-dependent)"],"phonetic":"/prəˈdʌkʃənɪst/","extraExplanation":["“productionist”在现代英语中不算常见，更多见于政治经济、环境政策或社会批评语境中，用来对比“环境优先/可持续发展”等立场。","相关词：productionism（生产主义：强调增长与产出）、productivist（更常见，常指“生产至上/重产出”的立场或人）。"]}
{"word":"productions","summary":{"en":"“Productions” is the plural of “production,” meaning outputs/products, the process of making things, or stage/film/TV works.","zh":"“productions”是“production”的复数，可指产品/产出、生产过程，或戏剧/影视等作品与制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that are made or created; the output of a factory, company, or person","zh":"产物；产品；（工厂/公司/个人的）产出"},"examples":[{"en":"The company’s productions include cars, trucks, and buses.","zh":"这家公司的产品包括汽车、卡车和公交车。"},{"en":"We need to increase productions to meet demand.","zh":"我们需要提高产量以满足需求。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making goods, food, art, or other things","zh":"生产过程；制作过程"},"examples":[{"en":"Modern production uses robots to save time.","zh":"现代生产使用机器人来节省时间。"},{"en":"They improved production by reducing waste.","zh":"他们通过减少浪费来改进生产。"}]},{"partOfSpeech":"n.","definition":{"en":"a play, movie, TV show, or other performance; the work of putting it on","zh":"（戏剧/电影/电视等）作品；（演出/拍摄的）制作"},"examples":[{"en":"The school’s latest production is a musical.","zh":"学校最新的演出是一部音乐剧。"},{"en":"She works in film production.","zh":"她从事电影制作工作。"}]}],"synonyms":["output","manufacturing","making","products","goods","show","performance","film"],"phonetic":"/prəˈdʌkʃən/","extraExplanation":["“productions”是“production”的复数形式。常见于：\n- 指“产量/产出”时（更偏数量）：increase productions, daily productions。\n- 指“多部作品/多场演出”时：theater productions, TV productions。\n在更正式的商业语境里，也常用“production”（不可数）表示整体“生产活动”：production costs（生产成本）、production line（生产线）。"]}
{"word":"productive","summary":{"en":"“Productive” mainly means producing a lot or achieving good results; it can also mean “leading to a good outcome.”","zh":"“productive”主要指“高产/高效、成果多”，也可指“促成良好结果的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing a lot; achieving good results, especially in work, study, or business.","zh":"高产的；效率高的；（尤指在工作、学习或生意上）成果多、成效好的。"},"examples":[{"en":"She’s most productive in the morning, so she does her hardest tasks early.","zh":"她早上效率最高，所以会把最难的任务放在一早做。"},{"en":"The team had a productive meeting and left with a clear plan.","zh":"团队开了一场很有成效的会议，离开时带着清晰的计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing or leading to something, usually something helpful or positive.","zh":"促成……的；导致（通常是有益或正面的结果）的。"},"examples":[{"en":"Regular practice is productive of better pronunciation.","zh":"规律练习能促成更好的发音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Economics/industry) Creating goods, services, or value; able to produce efficiently.","zh":"（经济/产业）能创造产品、服务或价值的；具有生产能力且高效率的。"},"examples":[{"en":"Investment in training can make a workforce more productive.","zh":"投资培训可以让劳动力更具生产力。"}]}],"synonyms":["efficient","effective","fruitful","profitable","high-performing"],"phonetic":"/prəˈdʌktɪv/","extraExplanation":["“productive”最常见的搭配是：productive day/week（高效的一天/一周）、productive meeting（富有成效的会议）、productive work session（高产的工作时段）。形容人时，语气通常是中性到积极；形容会议时，强调“有结果/有进展”，不只是“忙”。","常见易混词：\n- productive（有成果/产出多） vs. busy（很忙但未必有成果）\n- productive（产出多） vs. efficient（用更少时间/资源完成同样的事，强调方法）\n在表达上：You were productive today.（你今天很有成效。）比 You were busy today.（你今天很忙。）更偏正面。"]}
{"word":"productively","summary":{"en":"“Productively” means doing something in a way that creates useful results—efficiently, effectively, or even in a “productive/fruitful” sense.","zh":"“productively”表示“富有成效地/高效率地”，强调做事产生有用成果；也可引申为“多产地、丰饶地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that produces a useful result; efficiently and effectively.","zh":"富有成效地；有效率且有效果地（做出有用结果）。"},"examples":[{"en":"If we plan carefully, we can work productively even with limited time.","zh":"如果我们仔细规划，即使时间有限也能高效率地工作。"},{"en":"The team used the meeting time productively by making clear decisions.","zh":"团队把会议时间用得很有效率，通过做出明确决定来推进工作。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that leads to producing many things (goods, work, ideas).","zh":"多产地；能产生很多成果／产品／想法地。"},"examples":[{"en":"She writes productively, finishing several short stories each month.","zh":"她写作很高产，每个月完成好几篇短篇小说。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is fertile or capable of generating growth (often used with land, soil, or nature).","zh":"丰饶地；富有生产力地（常用于土地、土壤或自然环境）。"},"examples":[{"en":"After the rains, the valley began to productively support new crops.","zh":"雨后，山谷开始富有生产力地支撑新作物的生长。"}]}],"synonyms":["efficiently","effectively","fruitfully","profitably"],"phonetic":"/prəˈdʌktɪvli/","extraExplanation":["“productively”来自形容词“productive”（有生产力的、有成效的）+ 副词后缀“-ly”。日常口语里更常见的搭配是“work/study productively（高效工作/学习）”“use time productively（有效利用时间）”。","语气上，“productively”通常带有积极评价，暗示不仅忙（busy），而且做出了有价值的成果；对比“busily”更偏“忙碌”，不一定有效果。"]}
{"word":"productiveness","summary":{"en":"Productiveness means efficiency in producing results; in linguistics, it means a rule’s ability to form new accepted words.","zh":"productiveness 指高效产出成果的能力；在语言学中指构词/语法规则生成并被接受新词的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of producing a lot of results, goods, or work efficiently; effectiveness in output.","zh":"生产力；工作效率（指能高效地产出成果、产品或工作量的能力）。"},"examples":[{"en":"Higher productiveness helps a company grow without adding many more workers.","zh":"更高的生产力能帮助公司在不大幅增加员工的情况下成长。"},{"en":"Sleep and good routines can improve your productiveness at school or work.","zh":"充足睡眠和良好习惯能提高你在学校或工作中的效率。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics, the ability of a word-forming pattern or grammar rule to create new words or expressions that people accept as natural.","zh":"（语言学）能产出新词/新表达的能力；构词规则或语法规则的“能产性/生成力”。"},"examples":[{"en":"The productiveness of “-ness” is clear in words like “happiness” and “kindness.”","zh":"“-ness”的能产性很明显，比如 happiness、kindness 这类词。"},{"en":"Some endings lose productiveness over time, so new words with them sound unusual.","zh":"有些词缀随着时间会失去能产性，因此用它们造的新词听起来不自然。"}]}],"synonyms":["productivity","efficiency","effectiveness","output","fruitfulness"],"phonetic":"/prəˈdʌktɪvnəs/","extraExplanation":["在日常英语里，更常见的说法是 productivity（生产力/效率）。productiveness 也正确，但更偏正式或特定语境（如语言学、写作讨论）。","词源上，productive（多产的/有成效的）+ -ness（名词后缀）→ productiveness，表示“具有成效/能产出的性质”。","语言学里常把 productiveness 和 productivity 区分开：productiveness 更强调“规则能不能继续造出新词并被接受”，而 productivity 有时更偏向“这个规则已经产出了多少词”（不同教材/学者用法略有差异）。"]}
{"word":"productivenesses","summary":{"en":"“Productivenesses” means multiple levels or instances of productiveness (how productive something is).","zh":"“productivenesses”表示多个“产出能力/效率”的水平或表现（多个“生产性”的程度）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of productiveness; the degrees or levels of being productive (especially across different people, teams, systems, or time periods).","zh":"productiveness 的复数；指“生产力/效率/产出能力”的不同程度或水平（常用于比较不同的人、团队、系统或时期）。"},"examples":[{"en":"The report compares the productivenesses of three departments over the last quarter.","zh":"这份报告比较了三个部门在上个季度的不同产出水平。"},{"en":"We measured productivenesses under the same conditions to keep the experiment fair.","zh":"我们在相同条件下测量不同的效率水平，以保证实验公平。"}]}],"synonyms":["levels of productivity","degrees of productiveness","productivity rates","output levels"],"phonetic":"/prəˈdʌktɪvnəsɪz/","extraExplanation":["“productivenesses”在真实语料中相对少见，因为“productiveness”多为不可数名词，通常用作整体概念（如：productiveness improved）。当需要强调“多种/多个层面的产出水平”时，学术写作或技术报告里偶尔会用复数。更常见的替代表达包括：levels of productivity / different degrees of productiveness / productivity across groups。"]}
{"word":"productivities","summary":{"en":"“Productivities” means multiple measures or types of productivity (efficiency of producing results).","zh":"“Productivities”指多个“生产率/效率”的指标或不同主体的生产率水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of productivity; different levels or measures of how efficiently people, teams, companies, or systems produce goods, services, or results","zh":"productivity 的复数形式；指不同的人、团队、公司或系统在产出商品、服务或成果时的效率水平或衡量指标"},"examples":[{"en":"The report compares the productivities of different departments.","zh":"这份报告比较了不同部门的生产率/工作效率。"},{"en":"Training improved employee productivities over the next quarter.","zh":"培训在接下来一个季度提高了员工的工作效率。"}]}],"synonyms":["efficiency","output per hour","work rate","performance","throughput"],"phonetic":"/ˌproʊdʌkˈtɪvɪtiz/","extraExplanation":["“Productivity”在学术/职场语境里既可当不可数名词（强调整体概念：提高生产率），也可在讨论“不同类别/不同主体的生产率”时用复数“productivities”。日常口语更常说“productivity levels/ratings/measures”来避免复数形式听起来偏学术。"]}
{"word":"productivity","summary":{"en":"Productivity means how efficiently you produce results—at work, in the economy, or in nature.","zh":"Productivity 指“产出效率/生产率”，可用于工作表现、经济学衡量或生态系统的生物量产出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The rate or efficiency at which work is done, often measured as output compared to time, effort, or resources used.","zh":"生产率；效率：指完成工作的速度或效能，常用“产出”与时间、精力或资源投入的比例来衡量。"},"examples":[{"en":"Better tools and clear goals can increase productivity.","zh":"更好的工具和清晰的目标可以提高生产率。"},{"en":"Our productivity dropped when the system went down.","zh":"系统宕机时，我们的效率下降了。"}]},{"partOfSpeech":"n.","definition":{"en":"In economics, how much goods or services are produced per unit of input (such as labor hours), often used to compare companies or countries.","zh":"（经济学）劳动生产率：每单位投入（如工时）所产出的商品或服务量，常用于比较企业或国家的表现。"},"examples":[{"en":"Higher labor productivity can lead to higher wages over time.","zh":"更高的劳动生产率长期来看可能带来更高的工资。"},{"en":"The report tracks productivity across different industries.","zh":"这份报告追踪了不同行业的生产率。"}]},{"partOfSpeech":"n.","definition":{"en":"In ecology/biology, the amount of new biological material produced in an ecosystem (for example, plant growth).","zh":"（生态/生物）生产力：生态系统中产生的新生物量（例如植物生长量）。"},"examples":[{"en":"Warm temperatures and sunlight can raise the productivity of a lake.","zh":"温暖的气温和阳光可以提高湖泊的生产力。"}]}],"synonyms":["efficiency","output","production","effectiveness (in some contexts)"],"phonetic":"/ˌproʊdʌkˈtɪvəti/","extraExplanation":["词源提示：productivity 来自 product（产品、产物）+ -ivity（名词后缀，表示“性质/状态”）。因此它本质上强调“产出”的能力或水平。","常见搭配：increase/boost/improve productivity（提高效率）；productivity gains（生产率提升带来的增量）；productivity tools（效率工具）；productivity slump（效率下滑）。","语用区别：日常语境里 productivity 常等同于“效率/完成度”；在经济学语境更偏“单位投入的产出”。当你想表达“勤奋/努力”时，更自然的词通常是 diligence 或 hard work，而不是 productivity。"]}
{"word":"productivus","summary":{"en":"Productivus is Latin for “productive/fruitful,” not a standard English word; in English, use “productive.”","zh":"productivus 是拉丁语“多产的/富饶的”，不是标准英语；英文通常用 “productive”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A Latin word meaning “productive” or “fruitful,” sometimes seen in scientific or taxonomic names.","zh":"（非标准英语）拉丁语词，意为“多产的 / 富饶的”，有时会出现在科学或生物分类（物种命名）中。"},"examples":[{"en":"In older scientific Latin, productivus can describe land that is productive.","zh":"在较早的科学拉丁语中，productivus 可以用来形容“土地很肥沃、产出高”。"},{"en":"You might see productivus used as part of a species description or name in taxonomy.","zh":"在生物分类学里，你可能会看到 productivus 出现在物种描述或命名中。"}]},{"partOfSpeech":"other","definition":{"en":"(Learner note) People sometimes write productivus when they mean the English adjective “productive.”","zh":"（学习提示）有人会把 productivus 当作英文形容词 “productive（高效的/多产的）” 来写，但英文里通常不用这个形式。"},"examples":[{"en":"Correct English: I had a productive day.","zh":"正确英文：I had a productive day.（我今天很高效。）"},{"en":"Correct English: This soil is very productive.","zh":"正确英文：This soil is very productive.（这片土壤很肥沃/产出高。）"}]}],"synonyms":["productive","fruitful","fertile","generative"],"phonetic":"/prəˈdʌk.tɪ.vəs/","extraExplanation":["“productivus”是拉丁语形容词，词尾“-us”是拉丁语常见的阳性单数形式。在生物学命名中，拉丁词常作为“种加词”（species epithet）使用，用来描述特征（例如“多产的/高产的”）。","如果你是在写英文邮件、论文或日常表达，一般应使用英语单词“productive”，而不是“productivus”。除非你是在引用拉丁文、古典文本或物种拉丁学名。"]}
{"word":"productoid","summary":{"en":"A rare noun meaning a product-like thing—often a marketing-made “almost product,” not a truly distinct sellable product.","zh":"一个较少见的名词，指“像产品的东西”，常用于批评：只是被营销包装成产品，但并非真正独立可售的产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Something that looks like a product or is marketed like a product, but is not truly a distinct, sellable product (often used critically in marketing/business).","zh":"（罕见）看起来像“产品”或以产品方式被包装、营销的东西，但实际上并不是一个真正独立可售的产品（常带批评意味，见于营销/商业语境）。"},"examples":[{"en":"Some people call the campaign a productoid because it promotes a brand but isn’t a real product you can buy.","zh":"有人把这次宣传活动称为“productoid”，因为它在推广品牌，但并不是你能直接购买的真正产品。"},{"en":"The company’s “wellness experience” felt like a productoid—more buzzwords than substance.","zh":"这家公司的“健康体验”给人一种“productoid”的感觉——噱头多、内容少。"},{"en":"Critics argued the update was a productoid: a rebrand of old features, not something new.","zh":"批评者认为这次更新是“productoid”：只是把旧功能重新包装，并没有真正新增价值。"}]}],"synonyms":["pseudo-product","product-like offering","marketing gimmick","buzzword-driven offering"],"phonetic":"/prəˈdʌk.tɔɪd/","extraExplanation":["“productoid”由 product（产品）+ -oid（……似的、类似……的）构成；-oid 常见于类似“humanoid（类人）”“android（仿人机器人）”。因此它字面意思是“像产品的东西”。","该词并不常见，通常出现在带讽刺/批判的商业写作中，用来指出某些“看起来像产品”的概念、活动或包装，其实缺乏可交付的实质内容。正式写作中更常用的替代表达有：product-like offering、pseudo-product、marketing gimmick（营销噱头）。"]}
{"word":"productor","summary":{"en":"“Productor” is an uncommon English word meaning “producer,” and it’s often seen as a nonstandard spelling; “producer” is usually preferred.","zh":"“productor”在英语中较少见，意思相当于“producer（制作人/生产者）”，但常被视为不标准或拼写受其他语言影响；一般更推荐用“producer”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon in modern English) A person or company that produces something, especially films, TV shows, music, or goods; essentially the same idea as “producer.”","zh":"（现代英语中较少见）生产者；制作人；出品方（尤指影视、电视、音乐或商品领域），含义基本同 producer。"},"examples":[{"en":"She works as a productor on independent films, but most credits list her as a producer.","zh":"她在独立电影里做制作人，但大多数片尾署名写的是 producer。"},{"en":"The company is the main productor of the software for this project.","zh":"这家公司是这个项目软件的主要出品/生产方。"}]}],"synonyms":["producer","manufacturer","maker"],"phonetic":"/prəˈdʌktər/","extraExplanation":["“productor”在英语里不算常用拼写，很多情况下是把“producer”拼错，或受西班牙语/葡萄牙语中“productor”的影响（在那些语言里是常见词）。在正式英文写作、简历、片尾署名中通常建议用“producer”。","注意区分：producer（制作人/出品人/生产者）更标准；productor在英语语料中更少见，可能会让读者以为是拼写错误。"]}
{"word":"productory","summary":{"en":"“Productory” is a rare word meaning “productive” or “related to producing/production.” In modern English, “productive” or “producing” is usually better.","zh":"“productory”是个很少见的词，意思接近“productive（有成效的/多产的）”或“与生产/产出有关的”。现代英语里通常用 productive 或 producing 更自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"adj. (rare/archaic) Producing results, goods, or effects; productive. \nExamples: \n• The new policy proved productory. (= productive) \n• A productory year for the farm. (= a year that produced a lot)","zh":"adj.（罕见/较古旧）能产生结果、产出或效果的；多产的；有成效的（相当于 productive）。\n例句：\n• 新政策被证明是 productory 的（= 很有成效）。\n• 对农场来说是个 productory 的年份（= 收成很好）。"},"examples":[{"en":"The training was productory, and the team’s performance improved.","zh":"这次培训很有成效，团队表现提高了。"},{"en":"They hoped for a productory season with higher yields.","zh":"他们希望这一季能有好收成、产量更高。"}]},{"partOfSpeech":"adj.","definition":{"en":"adj. (very rare) Related to producing or production; producing. \nExamples: \n• productory processes (= production processes)","zh":"adj.（非常少见）与生产/产出有关的；用于表示“生产的、产出的”。\n例句：\n• productory processes（= 生产流程）"},"examples":[{"en":"Some older texts mention productory forces in nature.","zh":"一些较旧的文本会提到自然界中的“生产性力量”。"}]}],"synonyms":["productive","fruitful","yielding","producing"],"phonetic":"/prəˈdʌktəri/","extraExplanation":["“productory”在现代英语里非常少见，很多情况下会被认为不够自然，甚至可能是把“productive（有成效的）”或“production/producing（生产/产生）”写错了。","如果你想表达“有成效的/高产的”，更常用 productive；想表达“生产的/制造的”，更常用 production (n.)、producing (adj.)、manufacturing (adj./n.)。","词形上它来自 product（产品/产物）+ -ory（表示“与…有关/具有…性质”的后缀），但实际使用频率远低于 productive。"]}
{"word":"productress","summary":{"en":"“Productress” is not a standard English word; it’s likely a typo or a mistaken form of “product” (or possibly “protectress”).","zh":"“productress”不是标准英语词；多半是拼写错误或误造词，通常应是“product”（也可能是“protectress”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or an incorrect formation (adding “-ress” to “product”).","zh":"不是标准英语单词。很可能是拼写错误，或是不恰当的构词（把表示女性的后缀“-ress”加在“product”上）。"},"examples":[{"en":"I think you meant “product”: This store sells eco-friendly products.","zh":"我猜你想写的是“product（产品）”：这家店卖环保产品。"},{"en":"If you meant “protectress” (rare): In old texts, a “protectress” is a woman who protects others.","zh":"如果你想写“protectress”（较少见）：在旧文本中，protectress 指保护他人的女性。"}]}],"synonyms":["product (if that was intended): item, goods, output, result"],"phonetic":"/prəˈdʌktrəs/","extraExplanation":["英语里“-ress”（如 actress, waitress）是较老式的“女性职业/身份”后缀。现代英语越来越倾向用中性形式（actor, server），因此像“productress”这种造法既不常见也不自然。","如果你告诉我你想表达的中文意思或句子语境，我可以帮你判断最可能的目标词（例如 product, producer, protectress 等）并给出更准确的用法。"]}
{"word":"products","summary":{"en":"Products are items made or grown to be sold; “product” can also mean a result, or (in math) the answer to multiplication.","zh":"products 指可出售的产品/商品；product 也可表示“结果/产物”，或（数学）“乘积”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that are made or grown to be sold; goods or items offered by a company or store.","zh":"（可出售的）产品；商品；某公司或商店提供的物品。"},"examples":[{"en":"This company sells eco-friendly products.","zh":"这家公司销售环保产品。"},{"en":"Customers can compare products online before buying.","zh":"顾客可以在购买前在线比较不同产品。"}]},{"partOfSpeech":"n.","definition":{"en":"A result or outcome that is produced by a process, situation, or action.","zh":"（过程、情况或行为产生的）结果；产物。"},"examples":[{"en":"His confidence is a product of years of practice.","zh":"他的自信是多年练习的结果。"}]},{"partOfSpeech":"n.","definition":{"en":"In math, the number you get when you multiply two or more numbers together.","zh":"（数学）乘积（多个数相乘得到的结果）。"},"examples":[{"en":"The product of 6 and 7 is 42.","zh":"6和7的乘积是42。"}]}],"synonyms":["goods","items","merchandise","commodities"],"phonetic":"/ˈprɑː.dʌkts/","extraExplanation":["“Product”作“商品/产品”时很常见于商业语境：a product line（产品线）, product launch（新品发布）, product manager（产品经理）。","注意单复数：product（一个产品），products（多个产品）。在购物或市场语境中，products 常指“各类商品”。","“a product of …”是常见搭配，表示“……的产物/结果”，语气中性：a product of the times（时代的产物）。"]}
{"word":"productus","summary":{"en":"A Latin adjective used in scientific writing meaning “projecting/extended outward; elongated.”","zh":"一个用于科学写作的拉丁形容词，意为“向外伸出/延伸；拉长的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in scientific descriptions) “produced/extended outward”; projecting, elongated, or drawn out.","zh":"（拉丁语，常见于科学描述）“向外延伸/伸出”；指突出的、拉长的、延展的。"},"examples":[{"en":"In some Latin species descriptions, productus describes a part that sticks out noticeably.","zh":"在一些拉丁语的物种描述中，productus 用来形容某个部位明显向外突出。"},{"en":"The shell margin is described as productus, meaning it extends outward.","zh":"壳缘被描述为 productus，意思是它向外延伸。"}]}],"synonyms":["projecting","protruding","extended","elongated"],"phonetic":"/proʊˈdʌktəs/","extraExplanation":["productus 是拉丁动词 producere（“引出、使向前、延长”）的过去分词，字面意思是“被延长/被伸出”。","在现代英语里它不是常用词，更多作为拉丁形容词出现在生物分类、解剖或古老的学术拉丁描述中，用来精确说明结构“外突、延伸”。","如果你是在文献里看到 Productus 首字母大写，它也可能是一个属名（某些化石腕足类等的分类名称），此时应按专有名词理解，而不是普通形容词。"]}
{"word":"produit","summary":{"en":"*Produit* is a French word meaning “product,” and in math it also means “the product (of multiplication).”","zh":"*produit* 是法语，意思是“产品/商品”，在数学里也表示“乘积”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a product; an item that is made or sold.","zh":"（法语）产品；商品；制成或出售的物品。"},"examples":[{"en":"In French, *produit* means “product.”","zh":"在法语里，*produit* 的意思是“产品/商品”。"},{"en":"Ce produit est très populaire. (This product is very popular.)","zh":"Ce produit est très populaire.（这个产品很受欢迎。）"}]},{"partOfSpeech":"n.","definition":{"en":"(French, math) the product (result) of a multiplication.","zh":"（法语，数学）乘积（乘法运算的结果）。"},"examples":[{"en":"Le produit de 3 et 4 est 12. (The product of 3 and 4 is 12.)","zh":"Le produit de 3 et 4 est 12.（3 和 4 的乘积是 12。）"}]}],"synonyms":["product","item","goods","merchandise","(math) product"],"phonetic":"/proʊˈdwiː/","extraExplanation":["*Produit* 是法语阳性名词：un produit（一个产品），复数是 produits。","你可能在经济学里见到 *produit intérieur brut*（PIB），对应英语的 GDP（gross domestic product，国内生产总值）。在这种搭配中，*produit* 更接近“产出/生产总值”的意思。"]}

