{"word":"proecclesiastical","summary":{"en":"“Proecclesiastical” means in favor of church authority or church influence, especially in politics or public policy.","zh":"“proecclesiastical”指“亲教会/支持教权（尤其在政治或公共政策中支持教会影响）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the authority, interests, or system of the Christian Church (especially an established church) in public life or politics.","zh":"支持或偏向教会（尤指国教或既有教会体系）的权威、利益或制度，常用于公共事务或政治语境。"},"examples":[{"en":"In the 19th century, some newspapers took a proecclesiastical stance on education policy.","zh":"在19世纪，一些报纸在教育政策上采取了亲教会（支持教会）的立场。"},{"en":"Her essay criticizes proecclesiastical arguments that religion should control state law.","zh":"她的文章批评那些主张宗教应当掌控国家法律的亲教会论点。"},{"en":"The party split between secular reformers and proecclesiastical members.","zh":"该党在世俗改革派与亲教会成员之间发生分裂。"}]}],"synonyms":["pro-church","church-aligned","clericalist","pro-clerical"],"phonetic":"/ˌproʊ ɪˌkliːziˈæstɪkəl/","extraExplanation":["词形拆解：pro- 表示“支持/赞成”，ecclesiastical 表示“教会的、教权的”（源自希腊语 ekklēsia“集会/教会”）。因此 proecclesiastical 常用于描述“亲教会、偏向教权”的政治或社会立场。","使用场景提示：该词较罕见、偏学术/历史写作；日常表达更常用 pro-church 或 church-aligned。"]}
{"word":"proeconomy","summary":{"en":"Proeconomy (more commonly pro-economy) means supporting the economy or prioritizing economic growth in policy or messaging.","zh":"proeconomy（更常见写作 pro-economy）指支持经济、偏向促进经济增长或把经济置于优先位置的政策/表态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, usually written with a hyphen: pro-economy) supporting economic growth, business, or market-friendly policies.","zh":"（少见，通常写作 pro-economy）支持经济增长、商业发展或偏向市场的政策；“亲经济/亲商”的。"},"examples":[{"en":"The mayor ran on a pro-economy platform focused on jobs and investment.","zh":"市长以“亲经济”的政纲参选，重点是就业和投资。"},{"en":"Critics said the plan was pro-economy but not strong enough on the environment.","zh":"批评者说这个计划偏“亲经济”，但对环境保护不够有力。"}]},{"partOfSpeech":"n.","definition":{"en":"(label/stance) a position or message that prioritizes the economy over other goals (such as public health or environmental protection).","zh":"（立场/标签）把“经济优先”作为主要目标的观点或表态（有时相对于公共健康、环境等）。"},"examples":[{"en":"Her pro-economy message appealed to small business owners.","zh":"她“经济优先”的表态吸引了小企业主。"}]}],"synonyms":["pro-economy","business-friendly","pro-business","pro-growth","economy-first","market-friendly"],"phonetic":"/ˌproʊ ɪˈkɑnəmi/","extraExplanation":["“proeconomy”不是非常标准或常见的单词形式，更常见的写法是带连字符的“pro-economy”。英语里“pro-”常作前缀，表示“支持/赞成”（如 pro-democracy 亲民主、pro-choice 支持选择权）。","在政治与媒体语境中，“pro-economy”常带有“强调经济、可能相对忽视其他议题”的含义；具体褒贬取决于上下文。更中性、常用的表达还有：business-friendly（亲商的）、pro-growth（促增长的）、economy-first（经济优先的）。"]}
{"word":"proeducation","summary":{"en":"“Pro-education” means supporting education and policies that strengthen learning and schools.","zh":"“pro-education”指支持教育，以及强化学习与学校的相关政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting education; favoring policies or actions that improve schooling, learning, or educational funding.","zh":"支持教育的；赞成改善学校、学习或教育经费等政策与行动的。"},"examples":[{"en":"The senator ran on a pro-education platform that promised higher teacher salaries.","zh":"这位参议员以“支持教育”的政纲参选，承诺提高教师薪资。"},{"en":"Many parents joined a pro-education group to advocate for safer schools.","zh":"许多家长加入支持教育的团体，为更安全的校园发声。"}]}],"synonyms":["education-friendly","supportive of education","pro-school","education-focused"],"phonetic":"/ˌproʊ ˌɛdʒəˈkeɪʃən/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-democracy 支持民主、pro-environment 支持环保）。因此 pro-education 常写作带连字符的 pro-education，或在正式写作中用更常见的表达：education-friendly、supportive of education。","在新闻与公共政策语境中，pro-education 常与 funding（经费）、reform（改革）、public schools（公立学校）、teacher pay（教师薪资）等词搭配出现。"]}
{"word":"proeducational","summary":{"en":"Proeducational means supportive of education.","zh":"proeducational 指“支持教育的、亲教育的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting education or favoring educational programs, policies, or funding.","zh":"支持教育的；赞成教育项目、政策或经费投入的。"},"examples":[{"en":"The candidate ran on a proeducational platform, promising more funding for public schools.","zh":"这位候选人以支持教育的平台参选，承诺增加公立学校的经费。"},{"en":"Our community is strongly proeducational and invests in libraries and after-school programs.","zh":"我们的社区非常支持教育，会投资图书馆和课后项目。"}]}],"synonyms":["pro-education","education-friendly","supportive of education","education-supporting"],"phonetic":"/ˌproʊˌɛdʒəˈkeɪʃənəl/","extraExplanation":["“pro-” 是常见前缀，表示“支持、赞成”（如 pro-democracy 亲民主、pro-environment 亲环保）。因此 proeducational 通常可理解为“亲教育/支持教育”。","proeducational 不是最常见的标准词形；更常见的表达是 “pro-education” 或 “pro-education policies”。在正式写作中，建议用更常见的形式以避免读者觉得生造或不自然。"]}
{"word":"proegumenal","summary":{"en":"Proegumenal means “related to a proegumenos,” a deputy or acting abbot in an Eastern Christian monastery.","zh":"proegumenal 指“与副院长/代理院长（proegumenos）有关的”，多用于东正教等东方基督宗教修道院语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a proegumenos (a deputy or acting abbot) in an Eastern Christian monastery.","zh":"（东正教等东方基督宗教修道院中）与“副院长/代理院长”（proegumenos）有关的；副院长的；代理院长的。"},"examples":[{"en":"The monastery’s proegumenal duties included organizing daily services and supervising novices.","zh":"这座修道院里，副院长的职责包括安排每日礼拜并指导新入修士。"},{"en":"A proegumenal appointment is usually temporary, filling the leadership role until a new abbot is chosen.","zh":"副院长/代理院长的任命通常是临时性的，用来在选出新院长前补上领导空缺。"}]}],"synonyms":["deputy-abbot (related)","acting-abbot (related)","monastic (context-dependent)"],"phonetic":"/proʊˌɛɡjəˈmɛnəl/","extraExplanation":["“proegumenal”来自“proegumenos”（希腊语前缀 pro- 表示“在前/代理”，以及 hegoumenos 表示“带领者、修道院院长”）。因此它多见于东正教或东方礼传统的修道院语境中，指与“代理院长/副院长”这一职务相关的事务、权力或职责。","这个词在日常英语里非常罕见，主要出现在宗教史、教会研究、修道院制度介绍等学术或专业文本中。"]}
{"word":"proelectric","summary":{"en":"“Proelectric” (often written “pro-electric”) means favoring or supporting electric power or electric-powered technology.","zh":"“proelectric”（常写作“pro-electric”）指支持或偏好电力/电动技术（电气化）的立场或倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring electricity or electric-powered technology (such as electric vehicles) over non-electric alternatives","zh":"支持或偏好用电力/电动技术（如电动车）而不是非电力替代方案的；挺电动的"},"examples":[{"en":"Her city has a proelectric policy that encourages electric buses and charging stations.","zh":"她所在的城市有一套“支持电动化”的政策，鼓励使用电动公交并建设充电站。"},{"en":"The company’s proelectric strategy focuses on replacing gas equipment with electric models.","zh":"该公司的“挺电动”战略重点是用电动设备替换燃油设备。"}]}],"synonyms":["pro-electric","in favor of electrification","electric-friendly","pro-EV"],"phonetic":"/ˌproʊ ɪˈlɛktrɪk/","extraExplanation":["“proelectric”不是非常常见的标准词，更常见写法是带连字符的“pro-electric”，意思是“支持电动化/电气化”。在新闻、政策讨论或环保语境中，有时会用它来表达立场（例如支持电动车、可再生能源驱动的电气化）。","使用时注意语气：它通常带有“立场/主张”的色彩，类似“pro-choice（支持选择权）”“pro-environment（支持环保）”里的“pro-（支持）”。"]}
{"word":"proelectrical","summary":{"en":"“Proelectrical” is uncommon and usually means “pro-electric / in favor of electrification,” or less commonly “professional electrical.”","zh":"“proelectrical”不常见，通常指“支持电气化/偏向电力方案”，较少情况下指“专业电气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; sometimes used (especially in marketing or technical writing) to mean “supporting or favoring electrical systems/solutions.”","zh":"不是标准词典词；有时（多见于营销或技术语境）用来表示“支持/偏向电气化或电力方案的”。"},"examples":[{"en":"Our company takes a proelectrical approach, recommending electric heat pumps instead of gas boilers.","zh":"我们公司采取偏向电气化的方案，推荐电动热泵而不是燃气锅炉。"},{"en":"The plan is proelectrical: it prioritizes electrifying buses and building charging stations.","zh":"这个计划偏向电气化：它优先推动公交电动化并建设充电站。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or for professional electrical work (rare; often intended to mean “professional electrical”).","zh":"与专业电气工作有关的（较少见；常常其实是想表达“专业电气/专业电工的”）。"},"examples":[{"en":"Use proelectrical tools only if you’re trained and certified.","zh":"只有在你受过培训并取得资质时，才使用专业电气工具。"}]}],"synonyms":["pro-electric","pro-electrification","electrification-friendly","electric-focused"],"phonetic":"/ˌproʊ ɪˈlɛktrɪkəl/","extraExplanation":["“proelectrical”在正式英语里不常见，容易让读者困惑。更自然的表达通常是：\n- pro-electric（支持电气化的）\n- pro-electrification（支持电气化政策的）\n- professional electrical（专业电气的）\n写作时建议根据你要表达的意思改用以上更常见的形式。"]}
{"word":"proelectrification","summary":{"en":"Proelectrification means supporting or advocating electrification.","zh":"proelectrification 指“支持或倡导电气化/电力化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or advocating electrification (switching a system, region, or sector to electric power).","zh":"支持或倡导“电气化/电力化”（把某个系统、地区或行业改用电力）的。"},"examples":[{"en":"The city council adopted a pro-electrification policy for buses and municipal vehicles.","zh":"市议会通过了一项支持公交和市政车辆电气化的政策。"},{"en":"Her pro-electrification stance focused on cleaner air and lower fuel costs.","zh":"她支持电气化的立场强调更清洁的空气和更低的燃料成本。"}]},{"partOfSpeech":"n.","definition":{"en":"a position, movement, or argument in favor of electrification.","zh":"支持电气化的立场、运动或论点。"},"examples":[{"en":"Pro-electrification is growing as battery technology improves.","zh":"随着电池技术进步，支持电气化的声音正在增多。"},{"en":"The report presents a strong pro-electrification case for home heating.","zh":"这份报告为家庭供暖电气化提出了有力的支持论证。"}]}],"synonyms":["pro-electrification","electrification-friendly","in favor of electrification"],"phonetic":"/ˌproʊɪˌlɛktrəfəˈkeɪʃən/","extraExplanation":["这是一个由“pro-（支持）+ electrification（电气化）”构成的复合词，写作时常见形式有 pro-electrification（更常见、清晰）或 pro electrification（较少见）。","多用于公共政策与能源转型语境，例如：交通电动化（EVs）、建筑供暖电气化（热泵）、工业用能电气化。","在较正式的写作里，有时会用更常见的表达替代：in favor of electrification / supportive of electrification / electrification-friendly。"]}
{"word":"proelectrocution","summary":{"en":"“Proelectrocution” (usually written “pro-electrocution”) means favoring electrocution, especially as an execution method.","zh":"“proelectrocution”（常写作“pro-electrocution”）指赞成电刑，尤指作为处决方式的电椅处决。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) Supporting or advocating electrocution (especially as a method of execution).","zh":"（罕见、非标准用法）支持或主张电刑（尤其指作为处决方式的电椅处决）。"},"examples":[{"en":"Some activists accused the senator of taking a pro-electrocution stance on capital punishment.","zh":"一些活动人士指责那位参议员在死刑议题上持“支持电刑”的立场。"},{"en":"The article criticized the film for sounding pro-electrocution rather than questioning the death penalty.","zh":"那篇文章批评这部电影听起来像是在“支持电刑”，而不是质疑死刑。"}]}],"synonyms":["pro–death penalty","pro–capital punishment","pro–electric chair"],"phonetic":"/ˌproʊɪˌlɛktrəˈkjuːʃən/","extraExplanation":["这个词更常见的写法是带连字符的 **pro-electrocution**，由前缀 **pro-**（“支持/赞成”）+ **electrocution**（“触电/电刑”）构成。因为 **electrocution** 在现代英语里通常首先让人想到“意外触电身亡”，所以在死刑语境中用它容易显得刺耳或带有强烈立场；更常见、更明确的说法包括 **pro–death penalty**（支持死刑）或 **pro–electric chair**（支持电椅处决）。"]}
{"word":"proelimination","summary":{"en":"Pro-elimination means supporting the removal or abolition of something.","zh":"Pro-elimination 指“支持消除/废除某事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or advocating the elimination (removal, ending, or abolition) of something.","zh":"支持或主张“消除/废除/取消”某事物的；主张淘汰某事物的。"},"examples":[{"en":"The group took a pro-elimination stance toward single-use plastics.","zh":"该团体对一次性塑料持支持淘汰的立场。"},{"en":"Some lawmakers are pro-elimination of the outdated regulation.","zh":"一些立法者支持废除这项过时的法规。"}]},{"partOfSpeech":"n.","definition":{"en":"A position, argument, or movement that favors elimination of something (less common as a noun; usually written with a hyphen).","zh":"支持消除/废除的立场、论点或运动（作名词较少见；通常加连字符）。"},"examples":[{"en":"In the debate, pro-elimination focused on reducing long-term costs.","zh":"在辩论中，“支持废除的一方”强调降低长期成本。"}]}],"synonyms":["in favor of eliminating","supporting elimination","eliminationist (context-dependent)"],"phonetic":"/ˌproʊ ɪˌlɪməˈneɪʃən/","extraExplanation":["“proelimination”并不是标准或常见的拼写；更自然的写法是 **pro-elimination**（加连字符），或直接说 **in favor of eliminating… / supportive of eliminating…**。","在正式写作里，如果你想表达“主张彻底消除某事物的人/理论”，有时也会用 **eliminationist**（如 *eliminationist policy*），但具体含义要看语境。","常见搭配：**pro-elimination stance/argument/campaign**；反义表达：**anti-elimination** 或 **against eliminating…**。"]}
{"word":"proem","summary":{"en":"Proem means a formal introduction or preface to a work, especially in literary or classical contexts.","zh":"Proem 指作品的正式序言/前言，尤其常见于文学或古典语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introduction (often a formal preface) to a book, poem, speech, or other written work.","zh":"（书、诗、演讲等的）序言；前言（常指较正式的开篇引言）。"},"examples":[{"en":"The poet begins the epic with a short proem explaining why the story matters.","zh":"诗人用一段简短的序言（proem）来说明这个史诗故事为何重要。"},{"en":"In the proem, the author thanks her teachers and outlines the book’s main themes.","zh":"在序言中，作者感谢了老师，并概述了本书的主要主题。"}]},{"partOfSpeech":"n.","definition":{"en":"A preliminary or introductory section that sets the tone, purpose, or background before the main content starts.","zh":"开场引子；铺垫性的开头部分（在正文前交代基调、目的或背景）。"},"examples":[{"en":"The documentary’s proem offers historical context before the interviews begin.","zh":"纪录片的开场引子在采访开始前提供了历史背景。"},{"en":"Her proem is calm and reflective, preparing the reader for a serious discussion.","zh":"她的开篇语气平静而沉思，为严肃的讨论做了铺垫。"}]}],"synonyms":["preface","introduction","prologue","foreword"],"phonetic":"/ˈproʊ.iːm/","extraExplanation":["“proem”常见于文学、古典研究与较正式的写作语境，比“preface/intro”更书面、更带古典色彩。","词源来自希腊语 *prooimion*（意为“在歌曲之前的部分”），后来进入拉丁语与英语，因而常与史诗、颂歌、长诗等体裁相关。","在古典文学中，序言（proem）有时包含对缪斯女神的召唤（invocation），用来确立主题与权威感。"]}
{"word":"proembryo","summary":{"en":"A proembryo is the very early stage of an embryo, especially in plants, before clear organs form.","zh":"proembryo 指胚胎（尤指植物）发育的非常早期阶段，在器官明显形成之前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early developmental stage of an embryo, especially in plants (often the mass of cells formed soon after fertilization, before the embryo’s organs are clearly formed).","zh":"原胚；前胚：胚胎发育的早期阶段，尤指植物中受精后不久形成的细胞团，在器官尚未清晰分化之前。"},"examples":[{"en":"Under the microscope, the researchers observed the proembryo dividing into distinct cell layers.","zh":"在显微镜下，研究人员观察到原胚分裂并逐渐形成不同的细胞层。"},{"en":"In many plants, the proembryo develops inside the ovule after fertilization.","zh":"在许多植物中，受精后原胚在胚珠内发育。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the earliest form of an embryo in some animals, before clear body structures appear (less common usage than in botany).","zh":"（较少用）某些动物胚胎的最初形态，指明显身体结构出现之前的早期胚胎。"},"examples":[{"en":"The textbook uses “proembryo” to describe the very first embryonic cell stages.","zh":"这本教材用“proembryo”来描述最初的胚胎细胞阶段。"}]}],"synonyms":["early embryo","embryonic stage","embryo (early stage)"],"phonetic":"/ˌproʊˈɛmbrioʊ/","extraExplanation":["词源上，pro- 表示“在前、早期”，embryo 表示“胚胎”，因此 proembryo 字面意思就是“胚胎之前/更早的胚胎阶段”。","在植物学里更常见：常用于描述受精后形成的早期细胞团，之后会进一步分化出胚体（embryo proper）、胚柄（suspensor）等结构。不同教材对阶段划分略有差异，但总体都指“非常早期的胚胎”。","这是偏学术的生物学术语，日常英语很少用；写作或阅读论文时常与 fertilization（受精）、ovule（胚珠）、cell division（细胞分裂）、differentiation（分化）等词一起出现。"]}
{"word":"proembryonic","summary":{"en":"“Proembryonic” means connected to the earliest pre-embryo stage of development, especially in plants.","zh":"“proembryonic”指与胚胎形成之前的极早期（前胚/原胚期）发育阶段有关，尤常用于植物学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the very early stage of development before a clear embryo is fully formed (the “proembryo” stage), especially in plants and sometimes in animals.","zh":"与胚胎形成前的极早期发育阶段有关的（“前胚/原胚”阶段），常用于植物学，有时也用于动物胚胎学。"},"examples":[{"en":"In many flowering plants, the proembryonic stage begins right after fertilization.","zh":"在许多被子植物中，前胚期在受精后不久就开始。"},{"en":"Researchers compared proembryonic cells with later embryonic tissues to track gene activity.","zh":"研究人员比较了前胚期细胞与后期胚胎组织，以追踪基因活性。"}]}],"synonyms":["pre-embryonic","early-embryonic (context-dependent)"],"phonetic":"/ˌproʊɛmbrɪˈɑnɪk/","extraExplanation":["“pro-”表示“在……之前/早期”，加上“embryo（胚胎）”与形容词后缀“-ic”，整体意思就是“胚胎形成更早之前的”。","该词在普通日常英语中很少见，更多出现在植物胚胎发生（embryogenesis）、细胞分裂模式、组织分化等学术语境中。","相关名词常见：proembryo（前胚/原胚）。学习时可与“embryonic（胚胎的）”对比：proembryonic 更强调“更早的胚胎前期”。"]}
{"word":"proemial","summary":{"en":"Proemial means “introductory” or “prefatory,” like an opening that sets up what follows.","zh":"proemial 指“引言的、序言的”，用于形容为后文铺垫的开头部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Introductory; serving as a preface or opening to a longer work or speech.","zh":"（文章、演讲等）开头的；序言性质的；引言的。"},"examples":[{"en":"The first chapter is proemial, outlining the book’s main questions.","zh":"第一章是引言性质的，概述了本书的核心问题。"},{"en":"She gave a proemial remark to set the context before the debate began.","zh":"在辩论开始前，她做了几句开场说明来交代背景。"}]}],"synonyms":["introductory","prefatory","preliminary","opening"],"phonetic":"/proʊˈiːmiəl/","extraExplanation":["“proemial”是较少见、偏书面/学术的词，常用来形容“序言、开场白、引子”这一类内容。日常英语里更常用的替代词有：introductory, prefatory, preliminary。","词源上与“proem”（序言、引言）相关，来自希腊语 *prooimion*，本意是“在歌曲/诗篇前的引子”。因此它常带有“为正文铺垫、定调”的感觉。"]}
{"word":"proemium","summary":{"en":"Proemium means a formal preface or the opening part of a speech or work, especially in classical rhetoric.","zh":"proemium 指（较正式/文学或古典修辞中的）序言、引言或演说的开端部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A preface or introductory section of a book, speech, or other work (often formal or literary).","zh":"（常较正式/文学）序言；引言；开场白。"},"examples":[{"en":"In the proemium, the author explains why the book matters today.","zh":"在序言中，作者解释了这本书为何在当下重要。"},{"en":"The speech opened with a short proemium thanking the audience.","zh":"演讲以一段简短的开场白向听众致谢。"}]},{"partOfSpeech":"n.","definition":{"en":"In classical rhetoric, the opening part of a speech meant to introduce the topic and win the audience’s attention and goodwill.","zh":"（古典修辞）演说的开端部分，用来引入主题并争取听众的注意与好感。"},"examples":[{"en":"The orator’s proemium was designed to make the listeners trust him.","zh":"这位演说家的开场部分旨在让听众信任他。"},{"en":"Ancient manuals describe the proemium as the place to set the tone.","zh":"古代修辞手册把开端部分视为用来奠定基调的位置。"}]}],"synonyms":["preface","introduction","prologue","opening","prelude"],"phonetic":"/proʊˈiːmiəm/","extraExplanation":["该词来自拉丁语 prooemium，进一步可追溯到希腊语 prooímion，意为“序曲/开场”。在英语里它很书面、偏学术或古典修辞语境；日常写作中更常用 preface、introduction 或 prologue。","在文学与古典文本研究中，你可能会看到类似表达，如 “the proemium to the Iliad（《伊利亚特》的开头引子）”，用来指作品开篇的引入与定调部分。"]}
{"word":"proempire","summary":{"en":"Pro-empire describes support for an empire or imperial rule; it can also mean a supporter of empire.","zh":"pro-empire 指“亲帝国的/支持帝国统治的”，也可指“亲帝国者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting an empire or imperial rule; favoring the power or expansion of an empire","zh":"支持帝国或帝国统治的；拥护帝国势力或扩张的"},"examples":[{"en":"Some newspapers took a pro-empire position during the war.","zh":"一些报纸在战争期间采取了亲帝国的立场。"},{"en":"The senator was criticized for making pro-empire speeches.","zh":"这位参议员因发表亲帝国演讲而受到批评。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports an empire or imperialism","zh":"亲帝国者；支持帝国或帝国主义的人（或团体）"},"examples":[{"en":"Pro-empires argued that overseas colonies would strengthen trade.","zh":"亲帝国者认为海外殖民地会加强贸易。"},{"en":"In the debate, pro-empires and anti-imperialists clashed over foreign policy.","zh":"在辩论中，亲帝国者与反帝国主义者就外交政策发生冲突。"}]}],"synonyms":["pro-imperial","pro-imperialist","imperialist (context-dependent)","pro-colonial (context-dependent)"],"phonetic":"/ˌproʊˈɛm.paɪɚ/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-democracy 亲民主、pro-choice 支持选择权）。因此 pro-empire 常用于政治与历史语境，带有立场色彩。","这个词通常写作 pro-empire（加连字符），也可见到 proempire 或 pro empire，但在正式写作中更常用连字符以避免误读。","与之相近但更常见的词是 “pro-imperial”/“pro-imperialist”（亲帝国主义的）。在讨论殖民主义与历史创伤时，这类标签可能具有争议性，使用时注意语境与当事人的自我称呼。"]}
{"word":"proempiricism","summary":{"en":"Proempiricism means support for empiricism—prioritizing observation and evidence in forming knowledge.","zh":"Proempiricism 指支持经验主义——在获取知识时优先重视观察与证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for empiricism—the view that knowledge should be based mainly on observation, experience, and evidence rather than only on theory or pure reasoning.","zh":"支持经验主义——认为知识主要应建立在观察、经验与证据之上，而不是只依赖理论或纯粹推理的观点。"},"examples":[{"en":"Her proempiricism shows in how she trusts data from experiments more than abstract speculation.","zh":"她的亲经验主义体现在：她更相信实验数据，而不是抽象的臆测。"},{"en":"The article argues for proempiricism in public policy, emphasizing measurable results.","zh":"这篇文章主张公共政策应走亲经验主义路线，强调可衡量的结果。"}]}],"synonyms":["support for empiricism","pro-empiricism stance","empiricist leaning","evidence-based approach"],"phonetic":"/ˌproʊɛmˈpɪrɪˌsɪzəm/","extraExplanation":["“pro-”是常见前缀，表示“赞成/支持”。因此 proempiricism 通常可理解为“亲经验主义、支持经验方法”的立场或倾向。","该词并不算高频学术术语，写作中更常见的表达是 “a pro-empiricism stance/position” 或直接说 “support for empiricism”。在正式论文里也常用 “empiricist” 或 “empiricist approach”。","哲学语境中，经验主义常与“理性主义（rationalism）”对比：前者强调来自感官经验与观察的证据，后者强调理性推导与先天知识。"]}
{"word":"proempiricist","summary":{"en":"Proempiricist describes someone (or a stance) that favors empiricism—relying on observation, experience, and evidence.","zh":"proempiricist 指支持经验主义的人或立场，强调依靠观察、经验与证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports empiricism—the view that knowledge should be based mainly on observation, experience, and evidence.","zh":"支持经验主义的人——认为知识主要应建立在观察、经验与证据之上。"},"examples":[{"en":"As a proempiricist, she trusts data from experiments more than abstract speculation.","zh":"作为一名支持经验主义的人，她更相信实验数据，而不是抽象的推测。"},{"en":"The proempiricist in the group asked, “What evidence do we have?”","zh":"小组里的那位支持经验主义者问：“我们有什么证据？”"}]},{"partOfSpeech":"adj.","definition":{"en":"Supporting empiricism; favoring evidence from observation and experience.","zh":"支持经验主义的；偏向以观察与经验为依据的。"},"examples":[{"en":"He took a proempiricist approach to the debate and focused on measurable results.","zh":"他在辩论中采取偏经验主义的立场，专注于可测量的结果。"},{"en":"Her proempiricist attitude makes her cautious about claims without data.","zh":"她偏经验主义的态度让她对缺乏数据的说法保持谨慎。"}]}],"synonyms":["empiricist","evidence-based thinker","pro-empirical"],"phonetic":"/ˌproʊɛmˈpɪrɪsɪst/","extraExplanation":["这个词比较少见，更常见的表达是 “pro-empiricism / pro-empirical / an empiricist”。结构上是 pro-（支持、赞成）+ empiricist（经验主义者）。在哲学与科学方法论语境中使用较多，用来强调“立场上更偏向经验与证据”，常与 rationalist（理性主义者）、a priori（先验的）等概念对比。"]}
{"word":"proemployee","summary":{"en":"Pro-employee means supportive of employees’ interests, rights, and working conditions.","zh":"pro-employee 指“亲员工/支持员工权益”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting employees’ interests and rights; favoring workers rather than management.","zh":"支持员工利益与权利的；偏向劳动者而非管理层的。"},"examples":[{"en":"The new policy is widely seen as pro-employee because it expands paid sick leave.","zh":"这项新政策被普遍认为是“亲员工”的，因为它扩大了带薪病假。"},{"en":"A pro-employee culture encourages managers to listen to workers’ concerns.","zh":"“亲员工”的企业文化会鼓励管理者倾听员工的诉求。"},{"en":"Some critics argue the reform is too pro-employee and raises costs for small businesses.","zh":"一些批评者认为这项改革过于“亲员工”，会提高小企业成本。"}]}],"synonyms":["worker-friendly","employee-friendly","pro-labor"],"phonetic":"/ˌproʊ ɪmˈplɔɪiː/","extraExplanation":["“pro-”是一个常见前缀，意思是“支持/赞成”。因此 pro-employee 直译就是“支持员工的”。在新闻、职场讨论和公共政策语境中很常见，常与 pro-business（亲商）、pro-labor（支持劳工/工会）对比使用。","拼写上常见两种：pro-employee（带连字符，更常见）和 proemployee（较少见）。正式写作里通常建议用连字符以便阅读。"]}
{"word":"proemployer","summary":{"en":"Pro-employer means favoring employers’ interests or policies.","zh":"pro-employer 指“偏向/支持雇主（资方）利益或政策的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting employers’ interests, rights, or policies (often in contrast to pro-worker or pro-union views).","zh":"亲雇主的；支持雇主利益、权利或政策的（常与亲劳工/亲工会立场相对）。"},"examples":[{"en":"Some critics say the proposal is too pro-employer and doesn’t protect workers enough.","zh":"一些批评者认为这项提案过于亲雇主，对劳动者的保护不足。"},{"en":"The law was seen as pro-employer because it made it easier to hire and fire.","zh":"这部法律被视为亲雇主，因为它让雇佣和解雇更容易。"}]}],"synonyms":["employer-friendly","business-friendly","pro-business"],"phonetic":"/ˌproʊ ɪmˈplɔɪər/","extraExplanation":["“pro-”表示“支持/赞成”。因此 pro-employer 通常写作带连字符的 pro-employer，常见于新闻、政策讨论、劳动法与工会议题中。","该词往往带有立场色彩：使用者可能在批评某政策偏向资方，也可能是中性描述某观点更重视企业灵活用工或降低成本。"]}
{"word":"proemployment","summary":{"en":"Proemployment means supporting or promoting more jobs and higher employment.","zh":"Proemployment 指“支持就业、促进增加工作岗位/提高就业率”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or aiming to increase employment (more jobs); job-creating.","zh":"支持就业、旨在增加就业（创造更多工作岗位）的；促就业的。"},"examples":[{"en":"The government introduced proemployment policies to help small businesses hire more workers.","zh":"政府推出了促就业政策，帮助小企业雇用更多员工。"},{"en":"They argued that tax cuts would be proemployment rather than pro-profit.","zh":"他们认为减税会更促就业，而不是只促利润。"}]},{"partOfSpeech":"n.","definition":{"en":"a stance, approach, or set of policies that favors increasing employment.","zh":"促就业的立场、做法或政策组合。"},"examples":[{"en":"Her platform is strongly proemployment, focusing on training and apprenticeships.","zh":"她的政纲非常促就业，重点放在职业培训和学徒制上。"},{"en":"The report compares proemployment strategies across different countries.","zh":"这份报告比较了不同国家的促就业策略。"}]}],"synonyms":["pro-employment","job-creating","employment-friendly","pro-jobs","job-friendly"],"phonetic":"/ˌproʊ ɪmˈplɔɪmənt/","extraExplanation":["更常见的写法是带连字符的 **pro-employment**，尤其在正式写作或新闻中（例如：pro-employment measures）。不带连字符 **proemployment** 也能见到，但相对少。","前缀 **pro-** 表示“支持、赞成”（如 pro-democracy 亲民主、pro-choice 支持选择权），加在名词或形容词前形成“支持……的/有利于……的”。"]}
{"word":"proemptosis","summary":{"en":"A rare rhetorical term meaning answering objections before they are raised.","zh":"一个较少见的修辞术语，指在别人提出反对前先预设并回应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric, rare) A technique in which a speaker or writer anticipates an objection or question and answers it in advance to strengthen the argument.","zh":"（修辞学，较少用）一种论证技巧：在对方提出质疑或反对之前，先预想到并提前回应，以加强论点。"},"examples":[{"en":"Before anyone says the plan is too expensive, let me show you the cost savings over five years.","zh":"在有人说这个计划太贵之前，我先给大家看看五年内能省下的成本。"},{"en":"The author uses proemptosis to address readers’ doubts early in the essay.","zh":"作者在文章一开始就用“预先回应反对意见”的方式处理读者可能的疑虑。"}]}],"synonyms":["prolepsis","prebuttal","anticipation","preemption"],"phonetic":"/ˌproʊɛmˈptoʊsɪs/","extraExplanation":["这个词在现代英语中很少见，多出现在修辞学或文学分析里。含义接近更常用的术语 prolepsis（预先反驳/预先回应）或 preemption（先发制人的处理）。","词源上可理解为“pro-（在前）+（与拿走/抢先有关的词根）”，强调“抢先一步把对方的疑问先处理掉”。在写作中常见的做法是用句型：“You may think…, but … / Some might argue…, however … / Before you ask…, …”来实现类似效果。"]}
{"word":"proems","summary":{"en":"Proems means “introductions/prefaces,” usually in a formal or literary style.","zh":"proems 是 proem 的复数，意为“（正式或文学性的）序言、引言、开场白”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an introduction or preface to a speech, book, or poem (often a formal opening section)","zh":"（演讲、书籍或诗歌的）序言；开场白；引言（常指较正式的开头部分）"},"examples":[{"en":"The novel begins with a short proem explaining the historical setting.","zh":"这部小说以一段简短的序言开篇，解释了历史背景。"},{"en":"In the proem, the speaker asks the audience to listen with an open mind.","zh":"在开场白中，演讲者请求听众以开放的心态聆听。"},{"en":"Many epic poems include a proem that introduces the theme and the hero.","zh":"许多史诗都有序诗/序言，用来介绍主题和主人公。"}]}],"synonyms":["preface","introduction","opening","prologue"],"phonetic":"/ˈproʊɛm/","extraExplanation":["“proem”较书面、带古典色彩，常用于文学或修辞语境；日常英语更常说 “preface / introduction / opening”。","词源来自希腊语 *prooimion*（意为“前奏、序曲”），因此它常带有“为正文定调、铺垫主题”的感觉。","你输入的 “proems” 是复数形式：one proem（一个序言），two proems（两个序言）。"]}
{"word":"proenforcement","summary":{"en":"Pro-enforcement means supporting stricter law/rule enforcement or supporting law-enforcement agencies.","zh":"pro-enforcement 指支持更严格的法律/规则执行，或支持执法机构与执法人员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the enforcement of laws or rules, especially by the police or other authorities.","zh":"支持（法律或规则的）执行；尤指支持警方或其他执法机构的执法。"},"examples":[{"en":"The mayor ran on a pro-enforcement platform, promising stricter policing.","zh":"市长以“支持严格执法”的政纲参选，承诺更严格的警务措施。"},{"en":"Some residents are pro-enforcement, while others worry about over-policing.","zh":"一些居民支持加强执法，而另一些人担心过度执法。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting agencies or officials whose job is to enforce laws (law enforcement).","zh":"支持执法机构或执法人员（即“law enforcement”）。"},"examples":[{"en":"He describes himself as pro-enforcement and says he backs higher funding for the police.","zh":"他形容自己支持执法机构，并表示赞成增加警方经费。"},{"en":"The group’s pro-enforcement messaging drew criticism from civil-rights advocates.","zh":"该组织的“支持执法”宣传引来民权倡议者的批评。"}]}],"synonyms":["tough-on-crime","pro-police","in favor of enforcement","supporting strict enforcement"],"phonetic":"/ˌproʊ ɪnˈfɔrsmənt/","extraExplanation":["“proenforcement”更常见的写法是带连字符的 **pro-enforcement**，也可能写作 **pro enforcement**（分开写）。这是由前缀 **pro-**（支持、赞成）+ enforcement（执行、执法）构成。","该词常用于政治与社会议题语境，尤其涉及“治安、警务、执法力度”等讨论。使用时注意语气：在不同社群中，它可能被理解为“支持治安/支持警察”，也可能被批评为“忽视执法过当”。根据场合可用更中性的表达，如 **in favor of law enforcement** 或 **supporting stricter enforcement**。"]}
{"word":"proenlargement","summary":{"en":"Pro-enlargement means supporting the expansion of a group or union, especially by adding new members.","zh":"pro-enlargement 指支持某个组织或联盟扩大规模，尤指通过吸收新成员来扩员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the expansion (enlargement) of an organization, group, or political union by adding more members or increasing its scope","zh":"支持（组织、团体或政治联盟）扩大、扩员（如吸收新成员）"},"examples":[{"en":"The senator took a pro-enlargement stance on admitting new states to the union.","zh":"这位参议员对接纳新州加入联邦持支持扩员的立场。"},{"en":"Pro-enlargement voters argued that expansion would increase security and trade.","zh":"支持扩大的人认为扩张会提升安全与贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"the policy, attitude, or movement that supports enlargement","zh":"支持扩大（扩员）的政策、态度或主张"},"examples":[{"en":"Within the party, pro-enlargement grew stronger after the election.","zh":"在党内，选后支持扩员的力量更强了。"},{"en":"The debate was framed as pro-enlargement versus anti-enlargement.","zh":"这场辩论被概括为“支持扩大”对“反对扩大”。"}]}],"synonyms":["expansionist (context-dependent)","in favor of enlargement","pro-expansion"],"phonetic":"/ˌproʊ ɪnˈlɑrdʒmənt/","extraExplanation":["“pro-enlargement”常见于政治与国际关系语境，尤其是在讨论欧盟（EU enlargement）或北约等联盟是否应接纳新成员时。","构词方式：pro-（赞成、支持）+ enlargement（扩大、扩员）。写作中常加连字符：pro-enlargement；也可不加连字符，但正式文本更偏好有连字符。","相关对立表达：anti-enlargement（反对扩大）、enlargement skeptics（对扩大持怀疑者）。"]}
{"word":"proenzym","summary":{"en":"A proenzyme is an inactive precursor that is converted into an active enzyme (also called a zymogen).","zh":"proenzyme 指“酶原/酶前体”，是一种不活性的形式，经过转化后变成有活性的酶（也叫 zymogen）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a precursor (inactive form) of an enzyme that must be chemically changed to become active; also called a zymogen","zh":"酶原；酶的前体（不活性的形式），需要经过化学变化后才会变成有活性的酶；也叫“酶原体/酶原（zymogen）”"},"examples":[{"en":"Trypsinogen is a proenzyme that becomes the active enzyme trypsin in the small intestine.","zh":"胰蛋白酶原（trypsinogen）是一种酶原，会在小肠中转变成有活性的胰蛋白酶（trypsin）。"},{"en":"Many digestive enzymes are produced first as proenzymes to protect the tissues that make them.","zh":"许多消化酶会先以酶原的形式生成，以保护产生它们的组织不被“自我消化”。"}]}],"synonyms":["zymogen","enzyme precursor","inactive enzyme precursor"],"phonetic":"/ˌproʊˈɛnzaɪm/","extraExplanation":["“proenzyme”常用于生物化学/生理学语境，强调“先不活化、之后再活化”的安全机制，避免酶在错误的位置提前分解蛋白质等物质。","词形提示：pro- 表示“前、预先”；与之对应的常见同义词是 “zymogen（酶原）”。","你输入的拼写“proenzym”多见于缩写、品牌名或非正式写法；标准英文拼写通常是 “proenzyme”。"]}
{"word":"proenzyme","summary":{"en":"A proenzyme is an inactive form of an enzyme that becomes active after a specific change.","zh":"proenzyme 指“酶原”，即需经特定转变后才会活化的酶的非活性前体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An inactive precursor of an enzyme that must be changed (often by cutting it) to become an active enzyme.","zh":"（生物化学）酶原：一种处于不活化状态的酶前体，需要经过转变（常见为被切割）后才成为有活性的酶。"},"examples":[{"en":"Pepsin is produced in the stomach as a proenzyme called pepsinogen.","zh":"胃里的胃蛋白酶最初以一种称为胃蛋白酶原的酶原形式产生。"},{"en":"Digestive enzymes are often stored as proenzymes to protect cells from self-digestion.","zh":"消化酶常以酶原形式储存，以避免细胞被自身消化。"}]}],"synonyms":["zymogen","enzyme precursor"],"phonetic":"/ˌproʊˈɛnˌzaɪm/","extraExplanation":["在课本和科研论文里，proenzyme 更常被称为 zymogen（“酶原”）。它们之所以先以不活化形式存在，常见原因是安全：例如胰腺分泌的蛋白酶如果在细胞内就活化，会损伤组织。","常见的活化方式叫 proteolytic cleavage（蛋白水解切割）：通过切掉一段小肽链，改变构象，让活性位点“打开”。例如 trypsinogen（胰蛋白酶原）→ trypsin（胰蛋白酶）。"]}
{"word":"proepimeron","summary":{"en":"A thoracic sclerite in insects located in front of the epimeron, used in anatomical and taxonomic descriptions.","zh":"昆虫胸部外骨骼上位于 epimeron 前方的一块骨片，常用于形态与分类描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) A small hardened plate (sclerite) on an insect’s thorax located in front of the epimeron; used as a reference point in insect anatomy and species descriptions.","zh":"（昆虫学）昆虫胸部外骨骼上的一块小型硬化板（骨片），位于 epimeron（侧后片/侧后板）的前方；常用作形态学与分类描述的定位结构。"},"examples":[{"en":"In some flies, the proepimeron bears a row of fine hairs that helps with identification.","zh":"在一些蝇类中，proepimeron 上会有一排细毛，有助于鉴别物种。"},{"en":"The description notes that the proepimeron is glossy and lacks bristles.","zh":"该描述指出 proepimeron 表面有光泽且没有刚毛。"}]}],"synonyms":["pre-epimeron (rare)","thoracic sclerite (general)"],"phonetic":"/proʊˌɛpɪˈmɛrən/","extraExplanation":["这个词主要出现在昆虫形态学（尤其是双翅目等昆虫的分类检索表与物种描述）里，日常英语中几乎不会用到。","词源上可拆为 pro-（在前）+ epimeron（昆虫胸部侧面的一块骨片名称），因此字面意思就是“在 epimeron 前面的结构”。不同类群对胸部各骨片的边界划分可能略有差异，具体位置通常需要结合解剖图或检索表。"]}
{"word":"proepiscopist","summary":{"en":"Someone (or something) that supports a bishop-led church system (episcopacy).","zh":"（人或观点）支持由主教治理的教会制度（主教制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports episcopacy (a church system governed by bishops)","zh":"主张主教制（由主教治理的教会制度）的人；拥护主教制度者"},"examples":[{"en":"During the debate over church governance, he was known as a proepiscopist.","zh":"在关于教会治理方式的争论中，他被认为是主教制的拥护者。"},{"en":"Some writers contrasted proepiscopists with presbyterians in discussions of church authority.","zh":"一些作者在讨论教会权威时，把主教制拥护者与长老制支持者作对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring episcopacy (bishop-led church government)","zh":"支持主教制的；倾向由主教治理教会的"},"examples":[{"en":"The pamphlet takes a strongly proepiscopist position.","zh":"这本小册子采取了强烈的亲主教制立场。"},{"en":"Her proepiscopist views shaped how she read church history.","zh":"她的亲主教制观点影响了她解读教会史的方式。"}]}],"synonyms":["pro-episcopal","episcopalist","supporter of episcopacy"],"phonetic":"/ˌproʊɪˈpɪskəpɪst/","extraExplanation":["这个词由 pro-（支持……的）+ episcop-（与“主教”有关，源自希腊语 episkopos“监督者/主教”）+ -ist（……主义者/支持者）构成，常见于宗教史与教会政治讨论。","多出现在基督教不同教会治理模式的争论语境：episcopacy（主教制）强调主教的层级治理；常与 presbyterian / presbyterianism（长老制）或 congregationalism（会众制）对比，尤其见于英国国教与相关历史争辩文本中。"]}
{"word":"proepisternum","summary":{"en":"A specialized entomology term for the anterior portion of an insect’s thoracic episternum (a hardened side plate).","zh":"昆虫学术语，指昆虫胸部侧胸板（episternum）的前部硬化骨片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In insect anatomy) the front (anterior) part of the episternum, a hardened side plate on the thorax—especially on the prothorax.","zh":"（昆虫解剖）前侧板（proepisternum）：侧胸板（episternum）的前部，是胸部侧面的一个硬化骨片（常指前胸的这一部分）。"},"examples":[{"en":"Under the microscope, the proepisternum has a distinct ridge used for identification.","zh":"在显微镜下，前侧板有一条明显的隆起，可用于物种鉴定。"},{"en":"The key notes that the proepisternum is smooth in this species but punctured in a close relative.","zh":"检索表指出，这个物种的前侧板较光滑，而近缘种则有点刻（小凹点）。"}]}],"synonyms":["(technical) anterior episternum","(related term) episternum"],"phonetic":"/ˌproʊˌɛpɪˈstɝnəm/","extraExplanation":["该词主要用于昆虫分类学与形态学描述，不是日常英语。常见于学术论文、检索表（taxonomic keys）和昆虫解剖图注。","词素理解：pro- 表示“前、在前”，episternum 指“侧胸板（胸部外骨骼的一块侧板）”。因此 proepisternum 字面义就是“侧胸板的前部”。","相近结构名词常成对出现，如：proepisternum（前侧板）与 anepisternum（上侧板/前上侧板，因类群而异），以及与 epimeron（侧胸板的另一块）等一起用于定位胸部外骨骼。"]}
{"word":"proequality","summary":{"en":"Pro-equality means supporting equal rights and opportunities for everyone.","zh":"Pro-equality 指“支持人人享有平等权利与机会”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting equality of rights and opportunities for all people (for example, regardless of gender, race, sexuality, or disability).","zh":"支持人人享有平等权利与机会（例如不分性别、种族、性取向或身心状况）。"},"examples":[{"en":"The organization is openly pro-equality and welcomes people from all backgrounds.","zh":"这个组织公开支持平等，并欢迎来自各种背景的人。"},{"en":"She voted for pro-equality policies in education and hiring.","zh":"她投票支持教育与雇用方面的平等政策。"}]},{"partOfSpeech":"n.","definition":{"en":"a belief, stance, or movement that supports equality.","zh":"支持平等的立场、信念或运动。"},"examples":[{"en":"His pro-equality is clear in the way he treats his team.","zh":"他对平等的支持在他对待团队的方式上很明显。"},{"en":"The campaign centered on pro-equality and anti-discrimination.","zh":"这场运动以支持平等与反歧视为核心。"}]}],"synonyms":["egalitarian","pro-equal-rights","pro-civil-rights","anti-discrimination"],"phonetic":"/ˌproʊ ɪˈkwɑːləti/","extraExplanation":["“pro-”是英语前缀，表示“支持、赞成”。因此 pro-equality 字面意思就是“赞成平等”。实际写法中更常见的是带连字符的 **pro-equality**（也可写作 pro equality，在标题或口号中偶见）。","该词常用于公共议题与社会运动语境（如 civil rights 公民权、gender equality 性别平等、marriage equality 婚姻平等等），用来表明立场。正式写作里也常用更具体的表达，如 **support equality / advocate for equality**。"]}
{"word":"proestrus","summary":{"en":"Proestrus is the first stage of an animal’s heat cycle, before ovulation, when mating is usually not accepted yet.","zh":"Proestrus 指动物发情周期的第一阶段（排卵前），通常尚未接受交配。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The first stage of the estrous (heat) cycle in many female mammals (such as dogs), when the body begins preparing for ovulation; there may be swelling and bloody discharge, but the female usually does not accept mating yet.","zh":"（多种雌性哺乳动物如犬的）发情周期的第一阶段；身体开始为排卵做准备，常见外阴肿胀、少量血性分泌物，但通常尚不接受交配。"},"examples":[{"en":"During proestrus, the dog may attract male dogs but will usually not let them mate.","zh":"在发情前期（proestrus），母犬可能会吸引公犬，但通常不会让其交配。"},{"en":"The veterinarian explained that the bleeding we noticed could be a normal sign of proestrus.","zh":"兽医解释说，我们注意到的出血可能是发情前期的正常表现。"}]}],"synonyms":["pre-estrus","pre-oestrus"],"phonetic":"/proʊˈiːstrəs/","extraExplanation":["这个词多用于兽医学与繁殖学，尤其常见于犬的发情周期描述（proestrus → estrus → diestrus/metestrus → anestrus）。","词形上，pro- 表示“之前/在……前”，estrus 指“发情期/动情期”，合起来就是“发情之前的阶段”。","不同物种的发情周期表现与持续时间差异很大；猫等某些动物可能不明显出血，因此不要用犬的特征去套用所有动物。"]}
{"word":"proethical","summary":{"en":"“Proethical” means supporting or promoting ethical principles and behavior.","zh":"“proethical”表示支持或提倡伦理原则与道德行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In favor of ethical principles or supporting ethical behavior; promoting ethics.","zh":"支持伦理原则的；提倡合乎道德行为的；有利于伦理的。"},"examples":[{"en":"The company adopted a proethical policy to prevent bribery and conflicts of interest.","zh":"公司采用了支持伦理的政策，以防止贿赂和利益冲突。"},{"en":"Teachers try to create a proethical classroom culture where honesty is valued.","zh":"老师努力营造一种提倡伦理的课堂文化，让诚实受到重视。"}]}],"synonyms":["ethical","principled","morally responsible","values-based","ethics-focused"],"phonetic":"/proʊˈɛθɪkəl/","extraExplanation":["“proethical”由前缀“pro-”（支持、赞成）+ “ethical”（伦理的、道德的）组成，常见于较正式的写作（如商业合规、教育、政策讨论）。日常口语里更常说“ethical”（合乎道德的）或“ethics-focused / values-based”（以伦理/价值为中心的）。","有时会写作带连字符的形式“pro-ethical”，含义相同；是否加连字符多取决于写作风格指南或作者习惯。"]}
{"word":"proethnic","summary":{"en":"“Proethnic” means supportive of ethnic groups, ethnic identity, or ethnic diversity.","zh":"“proethnic”指支持族群／民族群体、族群认同或族群多样性的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring ethnic groups, ethnic identity, or ethnic diversity (often used in politics, education, or cultural policy).","zh":"支持或倾向于族群／民族群体、族群认同或族群多样性的（常用于政治、教育或文化政策语境）。"},"examples":[{"en":"The candidate ran on a proethnic platform that promised stronger protections for minority languages.","zh":"这位候选人以亲族群的平台参选，承诺更有力地保护少数族群语言。"},{"en":"Some educators argue that proethnic curricula help students feel seen and valued.","zh":"一些教育工作者认为，亲族群的课程设置能让学生感到被看见、被重视。"}]}],"synonyms":["pro-ethnic","multicultural","diversity-supporting","pro-minority","ethnically inclusive"],"phonetic":"/ˌproʊˈɛθnɪk/","extraExplanation":["“proethnic”并不是非常常见的标准词，更多见于学术或政策讨论中，也常写作带连字符的形式“pro-ethnic”。","前缀“pro-”表示“支持、赞成”（如 pro-democracy 支持民主；pro-choice 支持选择权）。因此 pro-ethnic 通常指“支持族群/民族文化与权益”。","语义上它一般带正面倾向，但在争论性语境里也可能被对立方用来评价某种立场；写作时建议明确你所指的具体政策或观点（如 language rights, multicultural education 等）。"]}
{"word":"proethnically","summary":{"en":"“Proethnically” means “in a way that supports or emphasizes ethnic identity.”","zh":"proethnically 指“以支持或强调族群／民族身份的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that supports, emphasizes, or is favorable toward ethnicity or ethnic identity (often in social, political, or academic discussions).","zh":"（多用于社会、政治或学术语境）以支持、强调或倾向于族群／民族身份的方式。"},"examples":[{"en":"The campaign message was framed proethnically, highlighting each community’s traditions and languages.","zh":"竞选信息以“亲族群”的方式来表达，强调各族群的传统与语言。"},{"en":"Some critics argue that the policy is written proethnically rather than focusing on shared civic values.","zh":"一些批评者认为该政策写得过于“亲族群”，而不是强调共同的公民价值。"}]}],"synonyms":["in a pro-ethnic way","in favor of ethnic identity","ethnically oriented","pro-ethnic"],"phonetic":"/ˌproʊˈɛθnɪkli/","extraExplanation":["“pro-”是英语里常见的前缀，表示“支持、赞成”（如 pro-democracy 亲民主、pro-choice 支持选择权）。因此 proethnically 通常可理解为“以支持族群认同的方式”。","该词非常不常见，很多情况下更自然的表达是：in a pro-ethnic way / in favor of ethnic identity / ethnically oriented（侧重族群）。","在写作中要注意语气：在一些语境里它可能被理解为“强调族群差异”，也可能被理解为“尊重多元文化”，具体取决于上下文。"]}
{"word":"proetid","summary":{"en":"“Proteid” is an old term for “protein.”","zh":"“Proteid”是“protein（蛋白质）”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) a protein; a complex substance found in living cells, made of amino acids.","zh":"（旧式用法）蛋白质；存在于生物细胞中的复杂物质，由氨基酸构成。"},"examples":[{"en":"In older biology books, you may see “proteid” used where we now say “protein.”","zh":"在较早的生物学书里，你可能会看到用“proteid”来表达我们现在说的“protein（蛋白质）”。"},{"en":"The lab report mentioned proteids in muscle tissue.","zh":"实验报告提到了肌肉组织中的蛋白质。"}]}],"synonyms":["protein"],"phonetic":"ˈproʊtiˌaɪd","extraExplanation":["“Proteid”多见于19世纪到20世纪早期的生物学/生理学文献，现在基本被“protein”取代。阅读老教材或老论文时遇到它，通常就按“蛋白质”理解即可。"]}
{"word":"proetidae","summary":{"en":"Proetidae is the scientific name for a family of extinct trilobites from the Paleozoic Era.","zh":"Proetidae 是“原肋虫科”的学名，指古生代的一科已灭绝三叶虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct trilobites (marine arthropods), known from the Paleozoic Era; members are often called proetid trilobites","zh":"（古生物）原肋虫科：一类已灭绝的三叶虫（海生节肢动物）家族，生存于古生代；其成员常被称为“原肋虫类（三叶虫）”"},"examples":[{"en":"Proetidae fossils are common in some Paleozoic marine rock layers.","zh":"在一些古生代海相岩层中，原肋虫科的化石很常见。"},{"en":"The museum display compares Proetidae with other trilobite families.","zh":"博物馆展柜把原肋虫科与其他三叶虫科作了对比。"}]}],"synonyms":["proetids","proetid trilobites","Proetus (related genus)"],"phonetic":"/proʊˈɛtɪdiː/","extraExplanation":["“Proetidae”是生物分类学中的“科（family）”名，按拉丁化规则常以 -idae 结尾，读写上更像学术名词而非日常英语词汇。","名称来自其代表属“Proetus（原肋虫属）”。在科名层级上，它高于“属（genus）”、低于“目（order）”。","学习与阅读古生物资料时，常见相关表达：proetid (adj./n.) “原肋虫科的；原肋虫科成员”。"]}
{"word":"proette","summary":{"en":"“Proette” is not a common English word; it’s usually a misspelling or a proper name.","zh":"“Proette”不是常见英语单词；通常是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often a misspelling or a proper name (e.g., a surname/username/brand).","zh":"不是常见英语词典里的标准单词；最常见的情况是拼写错误，或作为专有名词（如姓氏/用户名/品牌名）。"},"examples":[{"en":"I couldn’t find “proette” in the dictionary—do you mean “protest” or “proponent”?","zh":"我在词典里找不到“proette”——你是不是想写“protest（抗议）”或“proponent（支持者）”？"},{"en":"Proette is listed as a last name in some records.","zh":"在一些记录里，Proette 被列为姓氏。"}]}],"phonetic":"/proʊˈɛt/","extraExplanation":["“proette”看起来像由“pro-（支持/专业）”加上法语来源的后缀“-ette（小的；有时也指女性）”构成，但它并不是现代英语里固定使用的正规词汇。","如果你是在文章/对话/游戏/品牌里看到这个词，请把原句贴出来；我可以根据上下文判断它是不是拼写错误（例如：protest, prostate, proponent, roulette 等）或是专有名词。"]}
{"word":"proettes","summary":{"en":"“Proettes” is a rare, informal word meaning female professionals, and it’s often just a mistaken way to say “pros.”","zh":"“proettes”很少见，通常指女性职业人士/女专业选手，但很多时候只是把“pros”误写成了“proettes”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, informal plural of “proette,” meaning women who are professionals (female “pros”).","zh":"“proette”的非正式复数形式，指女性职业人士/女“高手”（女“pro”）。"},"examples":[{"en":"The article praised the proettes on the women’s golf tour.","zh":"那篇文章称赞了女子高尔夫巡回赛上的女职业选手。"},{"en":"In older writing, “proettes” was sometimes used for women working in a profession.","zh":"在较旧的文字里，“proettes”有时用来指从事某一职业的女性。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or mistaken plural form people sometimes use when they mean “pros” (professionals).","zh":"常见误写/误用：有人想表达“pros（职业人士/专业选手）”却写成“proettes”。"},"examples":[{"en":"Do you mean “pros” (professionals) instead of “proettes”?","zh":"你是不是想说“pros（职业人士）”，而不是“proettes”？"}]}],"synonyms":["pros","professionals","women professionals","female pros"],"phonetic":"/proʊˈɛts/","extraExplanation":["“proette”由“pro（专业人士）+ -ette（常见于法语借词的后缀，英语里有时表示“小的/女性的”）”构成。因为“-ette”带有“女性化/小型化”的语感，在现代英语里可能显得过时或带轻微贬义/不够尊重，所以更常用中性表达：women professionals / female pros / pros。","如果你是在特定领域（如某篇旧文章、某个团队名、用户名/品牌名）看到“proettes”，也可能是刻意的戏仿或自称，并不代表标准词汇。"]}
{"word":"proetus","summary":{"en":"Proetus is a king in Greek mythology, famous in stories about his conflict with Acrisius and the fate of his daughters (the Proetides).","zh":"普罗伊托斯是希腊神话中的国王人物，以与阿克里修斯的冲突及其女儿（普罗伊托斯之女）的传说而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a king of Argos (or Tiryns), twin brother and rival of Acrisius, known in several myths including the story of the “Proetides” (his daughters).","zh":"（希腊神话）普罗伊托斯：阿尔戈斯（或提林斯）的国王，阿克里修斯的孪生兄弟兼对手；与多则神话相关，尤以“普罗伊托斯之女（Proetides）”的故事著名。"},"examples":[{"en":"In Greek myth, Proetus and Acrisius fought over the kingship of Argos.","zh":"在希腊神话中，普罗伊托斯与阿克里修斯为争夺阿尔戈斯王位而争斗。"},{"en":"Some versions say Proetus’s daughters were driven mad and later cured by the seer Melampus.","zh":"有些版本说普罗伊托斯的女儿发狂，后来被先知墨兰普斯治愈。"}]}],"synonyms":["Proitos"],"phonetic":"/proʊˈiːtəs/","extraExplanation":["“Proetus”也常见拼写变体“Proitos”（更贴近希腊语转写）。","他与“普罗伊托斯之女（Proetides）”的传说常被用来讨论“亵渎神明—惩罚—净化/治愈”的母题，在文学与艺术中偶有引用。"]}
{"word":"proevolution","summary":{"en":"Proevolution means “in favor of evolution,” often used as a label in education or culture debates.","zh":"proevolution 指“支持进化论的”，常作为教育或社会文化争论中的立场标签。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the theory of evolution (often used in discussions about science education or debates with creationism).","zh":"支持或赞同进化论的（常用于科学教育或与神创论相关的讨论中）。"},"examples":[{"en":"The group is openly proevolution and promotes biology education in schools.","zh":"这个团体公开支持进化论，并推动学校里的生物教育。"},{"en":"Some people label the curriculum as proevolution because it teaches natural selection.","zh":"有些人把这套课程称为“支持进化论”，因为它讲授自然选择。"}]},{"partOfSpeech":"n.","definition":{"en":"a pro-evolution position, viewpoint, or movement.","zh":"支持进化论的立场、观点或运动。"},"examples":[{"en":"His writing reflects a strong proevolution stance in the science-and-religion debate.","zh":"他的文章在科学与宗教的争论中体现出强烈的支持进化论立场。"}]}],"synonyms":["pro-evolution","evolution-supporting","in favor of evolution"],"phonetic":"/ˌproʊˌɛvəˈluʃən/","extraExplanation":["“proevolution”更常见的写法是“pro-evolution”（带连字符）或“pro evolution”（分开写），在正式写作中用连字符更清晰。","这个词通常带有“立场标签”的语气，常出现在公共政策、科学教育（如是否在课堂教授进化论）、以及宗教与科学的社会讨论中；在纯科学论文里更常直接用“evolutionary theory / evolution”而不是“proevolution”。"]}
{"word":"proevolutionary","summary":{"en":"Proevolutionary means “supporting the theory of evolution or its teaching.”","zh":"proevolutionary 指“支持进化论或支持其教学”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring evolution (especially the scientific theory of evolution and its teaching).","zh":"支持或赞成进化（尤指支持科学的进化论及其教学）。"},"examples":[{"en":"The museum’s new exhibit takes a proevolutionary approach to explaining biodiversity.","zh":"博物馆的新展览用支持进化论的角度来解释生物多样性。"},{"en":"In the debate, she argued for a proevolutionary science curriculum.","zh":"在辩论中，她主张采用支持进化论的科学课程。"}]}],"synonyms":["pro-evolution","pro-Darwinian","pro-science (in this context)","evolution-supporting"],"phonetic":"/ˌproʊˌɛvəˈluːʃəˌnɛri/","extraExplanation":["这个词更常见的写法是带连字符的 **pro-evolutionary**；其中 **pro-** 表示“支持、赞成”。","它常用于社会/教育语境（例如学校课程、公共政策、宗教与科学的讨论），用来表达立场；在学术论文里更常直接用 **evolutionary**（“与进化有关的”）而不是 **proevolutionary**（“支持进化论的”）。"]}
{"word":"proevolutionist","summary":{"en":"A proevolutionist is someone (or something) that supports the theory of evolution.","zh":"proevolutionist 指支持进化论的人，或表示“支持进化论的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports the scientific theory of evolution (especially in debates about biology, education, or religion)","zh":"支持进化论（尤其在生物学、教育或宗教相关讨论中）的人"},"examples":[{"en":"Some proevolutionists argue that evolution should be taught as a core part of biology.","zh":"一些支持进化论的人认为，进化论应作为生物学的核心内容来教授。"},{"en":"The debate included proevolutionists and creationists.","zh":"这场辩论包括支持进化论者和神创论者。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting the theory of evolution","zh":"支持进化论的"},"examples":[{"en":"She wrote a proevolutionist article about natural selection.","zh":"她写了一篇支持进化论、讨论自然选择的文章。"},{"en":"The museum takes a proevolutionist approach in its human-origins exhibit.","zh":"这家博物馆在人类起源展览中采取支持进化论的立场。"}]}],"synonyms":["pro-evolution","evolutionist (context-dependent)","supporter of evolution","advocate of evolution"],"phonetic":"/ˌproʊˌɛvəˈluːʃənɪst/","extraExplanation":["“pro-”表示“支持……的/赞成……的”（如 pro-choice、pro-democracy）。因此 proevolutionist 字面意思就是“支持进化论的人/立场”。","在正式写作中，更常见、更中性的表达是 “supporter/advocate of evolution”（进化论的支持者）或 “pro-evolution”（支持进化论的）。有些语境下 proevolutionist 带有辩论色彩，可能显得对立感更强。"]}
{"word":"proexamination","summary":{"en":"“Proexamination” is a rare term, usually meaning a preliminary check before something, or (very rarely) supportive questioning.","zh":"“Proexamination”较少见，通常指事前的初步检查；极少情况下指支持某一方的询问。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A preliminary examination done before a main event or procedure; a pre-examination.","zh":"（少见/非标准用法）在主要事件或程序之前进行的初步检查；预检。"},"examples":[{"en":"The clinic scheduled a proexamination to check his blood pressure before surgery.","zh":"诊所安排了一次“proexamination”，在手术前先测量他的血压。"},{"en":"Please complete the proexamination form before your interview.","zh":"请在面试前填写预检表/初步审核表。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Examination or questioning intended to support someone’s position (as opposed to cross-examination that challenges it).","zh":"（非常少见）为支持某一方立场而进行的询问或审查（相对“cross-examination”质询/盘问）。"},"examples":[{"en":"In court, the witness was first questioned in a proexamination, then in cross-examination.","zh":"在法庭上，证人先接受支持性的询问，然后接受交叉盘问。"}]}],"synonyms":["pre-examination","preliminary examination","screening","direct examination"],"phonetic":"/ˌproʊ ɪɡˌzæməˈneɪʃən/","extraExplanation":["“proexamination”不是常见标准词汇，很多情况下人们更常写：\n- **pre-examination / preexamination**（检查或考试前的预检/预考）\n- 法律语境通常用 **direct examination**（主询问）与 **cross-examination**（交叉盘问），而不是“proexamination”。\n如果你告诉我你的具体语境（医疗/考试/法律/辩论），我可以帮你选最自然的表达。"]}
{"word":"proexecutive","summary":{"en":"“Proexecutive” (more often “pro-executive”) means supporting executive power in government.","zh":"“proexecutive”（更常写作“pro-executive”）指在政治上支持或偏向政府行政权的一方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring, supporting, or strengthening executive power in government (the president, prime minister, governor, etc.)","zh":"（政治语境）支持或强调政府行政权（如总统、总理、州长等权力）的；亲行政权的"},"examples":[{"en":"Some lawmakers took a pro-executive stance during the national security debate.","zh":"在国家安全的辩论中，一些立法者采取了亲行政权的立场。"},{"en":"The proposal was criticized as pro-executive because it reduced legislative oversight.","zh":"这项提案因削弱立法监督而被批评为亲行政权的。"}]}],"synonyms":["pro-executive","executive-friendly","executive-leaning"],"phonetic":"/ˌproʊ ɪɡˈzɛkjətɪv/","extraExplanation":["“proexecutive”更常见的写法是带连字符的“pro-executive”。它不是日常高频词，主要出现在政治评论、宪政讨论或新闻分析中，用来描述“更倾向于行政部门/行政权”的立场。","语义上它常与“checks and balances（制衡）”“executive overreach（行政权越界）”“executive authority（行政权力）”“legislative oversight（立法监督）”等概念一起出现，表达对行政权扩张的支持或担忧。"]}
{"word":"proexemption","summary":{"en":"Pro-exemption means supporting the idea that someone should be exempt from a rule, tax, or duty.","zh":"Pro-exemption 指支持让某人免受某项规定、税费或义务约束的观点。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"support for granting an exemption (a rule, tax, or duty being waived for someone)","zh":"支持给予“豁免”（让某项规定、税费或义务对某人不适用）"},"examples":[{"en":"The group is pro-exemption and wants small businesses to be exempt from the new fee.","zh":"该团体支持豁免，希望小企业免于缴纳这项新费用。"},{"en":"Her pro-exemption stance is popular among farmers who face rising costs.","zh":"她支持豁免的立场在面临成本上涨的农民中很受欢迎。"}]}],"synonyms":["in favor of an exemption","supportive of exemptions","pro-waiver"],"phonetic":"/ˌproʊ ɪɡˈzempʃən/","extraExplanation":["“proexemption”不是常见的标准英语单词，更常见的写法是带连字符的“pro-exemption”（表示“支持豁免”），或写成短语“in favor of an exemption / supportive of exemptions”。","如果你原本想写的是“preemption”（/priˈempʃən/，先占、优先权；法律上也可指联邦法优先于州法），那是另一个完全不同的词。你可以告诉我你的句子语境，我可以帮你确认应当用哪个词。"]}
{"word":"proexercise","summary":{"en":"“Proexercise” is an informal term meaning “supporting or promoting exercise,” and it can also be used as a program or app name.","zh":"“proexercise”是较非正式的说法，意思是“支持/提倡运动”；也可能是某个课程或应用的名称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Supporting or promoting exercise and physical activity; pro-fitness.","zh":"（非正式、非标准用法）支持或提倡运动与身体活动的；偏向健身的。"},"examples":[{"en":"Our school is trying to build a more proexercise culture with more PE and clubs.","zh":"我们学校想通过增加体育课和社团来打造更“proexercise（倡导运动）”的文化。"},{"en":"She follows a proexercise lifestyle: daily walks, stretching, and strength training.","zh":"她的生活方式很“proexercise”：每天散步、拉伸，还做力量训练。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A name sometimes used for an exercise program, product, app, or campaign.","zh":"（较少见）有时用作某个运动计划、产品、应用或宣传活动的名称。"},"examples":[{"en":"I downloaded ProExercise to track my workouts and steps.","zh":"我下载了 ProExercise 来记录训练和步数。"}]}],"synonyms":["pro-exercise","exercise-friendly","fitness-focused","promoting exercise"],"phonetic":"/ˌproʊˈɛksərsaɪz/","extraExplanation":["“proexercise”不是常见标准词，更多像是把前缀 pro-（支持、赞成）和 exercise（运动）拼在一起的自造词或品牌名。更自然的写法通常是 “pro-exercise”（带连字符）或直接说 “exercise-friendly / fitness-focused / promoting exercise”。","如果你是在某个软件、课程或品牌里看到的 ProExercise，它很可能是专有名词（名称），大小写以原出处为准。"]}
{"word":"proexperiment","summary":{"en":"“Proexperiment” is not standard; it usually means “pro-experiment,” supportive of experimentation/trying things.","zh":"“proexperiment”不是标准词，通常可理解为“pro-experiment”：支持实验、鼓励尝试与试错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; often used as a made-up or informal form of “pro-experiment,” meaning supporting or favoring experimentation (trying things out to learn or improve).","zh":"不是标准词典词；常见为非正式/自造的“pro-experiment”（支持实验/试验、主张多尝试以学习或改进）。"},"examples":[{"en":"Our team is very pro-experiment—we test small changes before making big decisions.","zh":"我们团队很“支持实验”——会先做小测试，再做大决策。"},{"en":"She has a pro-experiment attitude in the kitchen and tries new recipes all the time.","zh":"她在厨房里很“爱尝试”，总在试新菜谱。"}]},{"partOfSpeech":"n.","definition":{"en":"A viewpoint or stance that experimentation is good or necessary (informal).","zh":"一种立场/观点：认为做实验或尝试是好的或必要的（非正式用法）。"},"examples":[{"en":"His proexperiment shows in how he runs the class: lots of hands-on trials.","zh":"他的“支持实验”立场体现在教学方式上：大量动手试验。"}]}],"synonyms":["pro-experiment","supportive of experimentation","experimental-minded","in favor of trials","pro-trial-and-error"],"phonetic":"/proʊ ɪkˈspɛrəmənt/","extraExplanation":["“pro-”是英语常见前缀，意思是“支持、赞成”（如 pro-democracy 赞成民主）。所以你看到“proexperiment/pro-experiment”时，通常可理解为“赞成做实验/鼓励试错”。更标准的写法一般是加连字符：pro-experiment，或直接说 in favor of experimentation / supportive of experimentation。","如果你想表达“专业实验/实验专家”，通常不会用 proexperiment，而会说 professional experimenter（较少见）或 researcher / experimental scientist（更常见）。"]}
{"word":"proexperimentation","summary":{"en":"“Proexperimentation” (more commonly “pro-experimentation”) means supportive of experimentation—encouraging trying and testing new ideas.","zh":"“proexperimentation”（更常写作“pro-experimentation”）指“支持实验/试验”的立场或态度，强调鼓励尝试并检验新想法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring experimentation (especially in science, technology, education, or policy); having a positive attitude toward trying new methods and testing ideas","zh":"支持/赞成实验与试验（常用于科学、技术、教育或政策领域）；倾向于通过尝试新方法来检验想法"},"examples":[{"en":"Our lab has a pro-experimentation culture, so students are encouraged to test bold ideas.","zh":"我们的实验室文化偏向“支持实验”，所以鼓励学生去验证大胆的想法。"},{"en":"The company’s pro-experimentation mindset helped it improve the product quickly.","zh":"公司“支持试验”的思维方式帮助它快速改进了产品。"}]}],"synonyms":["experimental-friendly","innovation-friendly","open to experimentation","pro-innovation"],"phonetic":"/ˌproʊ ɪkˌspɛr.ə.mɛnˈteɪ.ʃən/","extraExplanation":["“proexperimentation”更常见的写法是带连字符的 **pro-experimentation**，也可以写成两词 **pro experimentation**（作定语时更常见）。在正式写作中，建议使用连字符以提高可读性。","这个词多用于讨论“文化/态度/政策立场”（例如：a pro-experimentation approach/culture/policy），不是非常固定的词典词条，更像是由 **pro-（支持）+ experimentation（实验、试验）** 组合出来的表达。"]}
{"word":"proexpert","summary":{"en":"“Proexpert” is an informal/branding term meaning a professional expert or expert-level/pro-grade.","zh":"“proexpert”多为非正式或品牌用语，指“专业专家”，也可作标签表示“专家级/专业级”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, marketing/online username) A “professional expert”; someone presented as highly skilled or authoritative in a field.","zh":"（非正式，多用于营销/网名）“专业专家”；指被宣传或自称在某领域非常专业、权威的人。"},"examples":[{"en":"Ask a ProExpert before you change your training plan.","zh":"在你改变训练计划前，先问问“ProExpert”（专业人士）。"},{"en":"She brands herself as a ProExpert in skincare.","zh":"她把自己包装成护肤领域的“ProExpert”（专业专家）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(label) Describing something as “professional-grade” or “expert-level.”","zh":"（用作标签）形容某物“专业级”“专家级”。"},"examples":[{"en":"This app has ProExpert tools for photo editing.","zh":"这个应用有用于修图的 ProExpert（专家级）工具。"},{"en":"They advertised a ProExpert service package.","zh":"他们宣传了一套 ProExpert（专业级）服务套餐。"}]}],"synonyms":["professional","specialist","authority","expert","pro-level","professional-grade"],"phonetic":"/ˌproʊˈɛkspɝt/","extraExplanation":["“proexpert”不是标准词典里的常见单词，更像是把 pro（professional，专业的/职业的）+ expert（专家）拼在一起的品牌词、产品名或用户名。正式写作里更常用“professional expert / subject-matter expert (SME) / specialist”。","注意语气：因为“expert”本身就有“专业人士”的含义，“pro expert / proexpert”在英语里有时会显得重复或偏广告风；在简历、学术或正式商务文本中建议用更具体的头衔（如“certified trainer”“data analyst”）。"]}
{"word":"proexporting","summary":{"en":"Pro-exporting means favoring or promoting exports as a policy or strategy.","zh":"pro-exporting 指“支持或促进出口”的政策或战略立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or encouraging a country’s exports (selling goods and services abroad), often as an economic policy stance","zh":"支持或鼓励出口的（通常指一种经济政策立场）"},"examples":[{"en":"The government introduced pro-exporting policies to help local firms reach overseas markets.","zh":"政府推出亲出口政策，帮助本土企业进入海外市场。"},{"en":"A pro-exporting strategy can create jobs, but it may also increase reliance on foreign demand.","zh":"亲出口战略可能创造就业，但也可能加大对海外需求的依赖。"}]}],"synonyms":["export-oriented","pro-trade","trade-promoting"],"phonetic":"/ˌproʊ ˈekspɔːrtɪŋ/","extraExplanation":["“pro-exporting”更常见的写法是加连字符（pro-exporting）。你输入的“proexporting”可能是合写或拼写变体。","在经济与政治语境中，pro- 常表示“支持/倾向于”，如 pro-business（亲商）、pro-democracy（支持民主）。"]}
{"word":"proexposure","summary":{"en":"“Proexposure” is uncommon; it usually means “pro-exposure” (supporting exposure/publicity) or “pro exposure” (professional-level exposure controls, especially in photography).","zh":"“proexposure”不常见；通常指“pro-exposure”（支持曝光/公开）或“pro exposure”（多指摄影中的专业曝光控制）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) In favor of exposure; supporting making something visible or publicly known.","zh":"（不常见）支持“曝光/公开”；主张让某事被看见或被公众知道。"},"examples":[{"en":"Some journalists take a pro-exposure stance when investigating corruption.","zh":"一些记者在调查腐败时采取支持曝光的立场。"},{"en":"The documentary has a pro-exposure message: problems can’t be solved if they stay hidden.","zh":"这部纪录片传达了支持曝光的观点：问题如果一直被隐藏，就无法解决。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Informal/industry use) Professional-level “Exposure” (often referring to camera exposure settings or a tool/app name); essentially “pro exposure.”","zh":"（非正式/行业用法）专业级的“曝光/曝光控制”（常指相机曝光设置或某些工具/应用名称）；相当于“pro exposure（专业曝光）”。"},"examples":[{"en":"Switch to Pro Exposure mode to manually set ISO, shutter speed, and brightness.","zh":"切换到专业曝光模式，手动设置 ISO、快门速度和亮度。"},{"en":"This editor includes Pro Exposure controls for highlights and shadows.","zh":"这个编辑器包含用于高光和阴影的专业曝光控制。"}]}],"synonyms":["pro-exposure","pro publicity","in favor of disclosure","manual exposure","professional exposure controls"],"phonetic":"/ˌproʊ ɪkˈspoʊʒər/","extraExplanation":["“proexposure”不是常见的标准英文拼写。更常见的写法是带连字符的“pro-exposure”，或拆开写“pro exposure”。","如果你想表达“事前/预先曝光”（例如医学里的“预防性暴露/暴露前”），常见词是“pre-exposure”（如 pre-exposure prophylaxis，简称 PrEP）。你可以告诉我你的具体语境（摄影/医学/新闻等），我可以帮你选最自然的说法。"]}
{"word":"proextension","summary":{"en":"Proextension means extending something forward (a rare, technical anatomy term).","zh":"proextension 指“向前伸展”的动作（较少见的解剖学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/biomechanics) the movement of extending a body part forward, away from the body’s centerline; forward extension.","zh":"（解剖/生物力学）把身体某部位向前伸展的动作；前伸（前向伸展）。"},"examples":[{"en":"In the exam, the doctor noted limited proextension of the patient’s shoulder.","zh":"检查中，医生注意到病人的肩部前伸范围受限。"},{"en":"The therapist practiced gentle proextension and retraction to improve joint mobility.","zh":"治疗师让患者练习轻柔的前伸和后缩，以改善关节活动度。"}]}],"synonyms":["forward extension","protraction (in some contexts)"],"phonetic":"/ˌproʊɪkˈstɛnʃən/","extraExplanation":["这个词在日常英语里很少见，更多出现在医学、解剖学、兽医学或运动科学的专业语境中。","它通常与 retraction（后缩/回收）成对出现；有时也会与 protraction（前伸/前移）一起讨论，但具体区别会因学科和关节/结构而略有不同。"]}
{"word":"proextravagance","summary":{"en":"“Proextravagance” means supporting extravagance or extravagant spending; it can also refer to that viewpoint or policy.","zh":"“proextravagance”表示支持奢侈/铺张（的），也可指这种立场或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring extravagance (spending too much or living in a very luxurious, showy way)","zh":"支持或赞成“奢侈/铺张”的（指花费过度或生活方式非常奢华、张扬）"},"examples":[{"en":"Some critics call the campaign proextravagance because it encourages people to buy luxury goods.","zh":"一些批评者称这场活动是“proextravagance（鼓吹奢侈）”，因为它鼓励人们购买奢侈品。"},{"en":"Her proextravagance attitude clashes with her parents’ simple lifestyle.","zh":"她那种支持奢华铺张的态度与父母朴素的生活方式相冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or policy that supports extravagant spending or luxury","zh":"支持奢侈消费或铺张生活的观点/立场/政策"},"examples":[{"en":"The article argues that proextravagance messaging can increase unnecessary consumption.","zh":"这篇文章认为，鼓吹奢侈的宣传可能会增加不必要的消费。"},{"en":"Voters rejected the proextravagance proposal during a time of economic hardship.","zh":"在经济困难时期，选民否决了那项支持铺张的提案。"}]}],"synonyms":["profligate","spendthrift","pro-luxury","in favor of extravagance"],"phonetic":"/ˌproʊɪkˈstrævəɡəns/","extraExplanation":["“proextravagance”不是非常常见的标准词，更常见的写法是加连字符的“pro-extravagance”，意思是“亲……/支持……”（pro-）+“奢侈、铺张”（extravagance）。","在正式写作中，如果你想表达“支持奢侈消费/奢华生活”，也可以用更自然的表达：“in favor of extravagance / supportive of extravagant spending / pro-luxury (spending)”等。"]}

