{"word":"prog","summary":{"en":"“Prog” is an informal abbreviation meaning a computer program/programming, progressive rock, or (mainly UK) progress.","zh":"“prog”是非正式缩写，可指电脑程序/编程、前卫摇滚，或（主要英式）进展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A computer program; sometimes also short for “programming.”","zh":"（非正式）电脑程序；有时也指“编程”的简称。"},"examples":[{"en":"This app has a bug in the prog, so it keeps crashing.","zh":"这个应用的程序里有个漏洞，所以一直崩溃。"},{"en":"I’m learning Python prog at school.","zh":"我在学校学 Python 编程。"}]},{"partOfSpeech":"n.","definition":{"en":"(music, informal) Progressive rock (“prog rock”) or progressive music in general.","zh":"（音乐，非正式）前卫摇滚（prog rock），或泛指“前卫”风格音乐。"},"examples":[{"en":"He’s really into prog—bands like Yes and Genesis.","zh":"他很喜欢前卫摇滚，比如 Yes 和 Genesis 这样的乐队。"},{"en":"This album mixes metal with prog elements.","zh":"这张专辑把金属和前卫风格元素混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mainly UK) Short for “progress,” often used in notes or reports.","zh":"（非正式，主要英式）“progress（进展）”的缩写，常见于记录或报告中。"},"examples":[{"en":"Any prog on the project this week?","zh":"这个项目这周有进展吗？"},{"en":"Prog: fixed two issues and updated the schedule.","zh":"进展：修复了两个问题并更新了时间表。"}]}],"synonyms":["program (informal: “prog”)","prog rock","progress (abbr., mainly UK)"],"phonetic":"/prɑɡ/","extraExplanation":["“prog”是缩写，用法取决于语境：在科技圈最常指program/programming；在音乐圈常指progressive rock；在英式工作记录里也可能写作progress。正式写作中通常不要用“prog”，而是写全称以免误解。"]}
{"word":"progambling","summary":{"en":"“Pro-gambling” means supporting gambling or policies that legalize/expand it.","zh":"“Pro-gambling”指支持赌博，或支持使赌博合法化/扩大的政策立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in favor of gambling; supporting legal gambling or the expansion of gambling activities","zh":"支持赌博的；主张赌博合法化或扩大赌博活动的"},"examples":[{"en":"The senator took a pro-gambling position and voted to allow more casinos.","zh":"这位参议员采取了支持赌博的立场，并投票允许开设更多赌场。"},{"en":"Some local businesses are pro-gambling because they believe it will bring tourism and jobs.","zh":"一些本地企业支持赌博，因为他们认为这会带来旅游和就业。"},{"en":"She argues that strict regulation is better than a blanket ban, so she is often labeled pro-gambling.","zh":"她认为严格监管比全面禁止更好，因此常被贴上“支持赌博”的标签。"}]}],"synonyms":["in favor of gambling","pro-casino","pro-legalization (of gambling)"],"phonetic":"/ˌproʊ ˈɡæmblɪŋ/","extraExplanation":["“progambling”更常见的写法是 **pro-gambling**（带连字符），因为 **pro-** 是前缀，意思是“支持、赞成”。在新闻、政策讨论中常见（如 pro-gun, pro-choice）。","它通常用于描述政治立场或政策倾向，语气较中性；但在一些语境中可能带有评价色彩（取决于说话者对赌博的态度）。"]}
{"word":"progamete","summary":{"en":"A progamete is an immature reproductive cell that later becomes a mature gamete.","zh":"progamete 指将来会发育成成熟配子的未成熟生殖细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young or immature reproductive cell that will develop into a fully functional gamete (sperm or egg).","zh":"（生物）配子前体；未成熟的生殖细胞，之后会发育成成熟的配子（精子或卵细胞）。"},"examples":[{"en":"In some organisms, a progamete matures into a motile sperm cell.","zh":"在一些生物中，配子前体会成熟为能运动的精子细胞。"},{"en":"The microscope slide showed progametes at different stages of development.","zh":"显微镜载玻片上显示了处在不同发育阶段的配子前体。"}]}],"synonyms":["gamete precursor","immature gamete","pre-gamete"],"phonetic":"/ˌproʊˈɡæmiːt/","extraExplanation":["“pro-”有“在……之前、前期”的意思，“gamete”是“配子”。所以progamete从构词上就能理解为“配子形成之前的细胞阶段”。","该词属于较少见的专业术语，不同教材/研究领域有时会用更常见的说法，比如“immature gamete（未成熟配子）”“gamete precursor（配子前体）”。"]}
{"word":"progamic","summary":{"en":"“Progamic” is not a standard English word; it is probably a misspelling of “programmatic,” meaning related to a plan or organized program.","zh":"“progamic”不是规范英语词，通常是“programmatic”的拼写错误；“programmatic”表示与计划或组织化项目相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard) Likely a misspelling of “programmatic.”","zh":"（非标准用法）很可能是“programmatic”的拼写错误。"},"examples":[{"en":"I couldn’t find “progamic” in the dictionary—did you mean “programmatic”?","zh":"我在词典里找不到“progamic”——你是不是想写“programmatic”？"},{"en":"The report uses the term “programmatic changes,” not “progamic changes.”","zh":"报告里用的是“programmatic changes（项目/规划层面的变更）”，不是“progamic changes”。"}]},{"partOfSpeech":"adj.","definition":{"en":"programmatic: relating to a plan, program, or organized set of actions (often used in business, government, or policy).","zh":"programmatic：与计划、项目或一套组织化行动有关的（常用于商业、政府或政策语境）。"},"examples":[{"en":"They made programmatic reforms to improve the education system.","zh":"他们进行了项目/规划层面的改革来改善教育体系。"},{"en":"We need a programmatic approach, not one-off fixes.","zh":"我们需要系统性的方案，而不是一次性的修补。"},{"en":"The charity focuses on programmatic impact—what its programs actually change.","zh":"这个慈善机构关注项目成效——它的项目真正带来了哪些改变。"}]}],"synonyms":["planned","systematic","strategic","policy-related"],"phonetic":"/ˌproʊɡrəˈmætɪk/","extraExplanation":["“progamic”在英语中不是常见或规范的拼写。最接近、最常用的目标词通常是“programmatic”。","“programmatic”在不同语境里可译为“项目层面的/规划性的/系统性的”。在政策与公益领域，也常指“围绕项目设计与执行”的（如 programmatic spending 项目支出）。"]}
{"word":"proganosaur","summary":{"en":"“Proganosaur” is not a standard English word; it’s likely a misspelling or a fictional term meaning a dinosaur-like creature.","zh":"“proganosaur”不是标准英语词，可能是拼写错误或虚构用语，指类似恐龙的生物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or likely misspelled term; it is not a recognized English word in major dictionaries. It may be intended to mean a dinosaur-like reptile (often in fiction or casual writing).","zh":"一个不规范或很可能拼写错误的词；主流英语词典中通常查不到。可能想表达“类似恐龙的爬行动物/怪兽”（多见于虚构作品或随意写法）。"},"examples":[{"en":"I couldn’t find “proganosaur” in a dictionary—did you mean “prosauropod” or another dinosaur name?","zh":"我在词典里找不到“proganosaur”——你是不是想写“prosauropod（原蜥脚类）”或其他恐龙名称？"},{"en":"In the game’s lore, a “proganosaur” is described as an ancient, dinosaur-like beast.","zh":"在这款游戏的设定里，“proganosaur”被描述为一种远古的、像恐龙一样的野兽。"}]}],"synonyms":["dinosaur (informal, if referring generally)","prehistoric reptile","fictional dinosaur-like creature"],"phonetic":"/proʊˈɡænəˌsɔr/","extraExplanation":["“proganosaur”很可能是拼写误差或自造词。你可以检查来源（书名/游戏/文章）里的拼写，或告诉我上下文句子，我可以更准确判断想表达的词。","常见可能目标：\n- prosauropod：原蜥脚类（早期植食性恐龙类群）\n- Proganochelys：原龟属（早期龟类）\n- Prognathodon：一种沧龙（海生爬行动物属名，不是恐龙）","英语里“-saur/-saurus”常用于“蜥蜴/恐龙”相关命名（来自希腊语 sauros“蜥蜴”）。如果你想写的是科学名称，通常会以大写开头并按拉丁学名形式出现。"]}
{"word":"proganosauria","summary":{"en":"Proganosauria is a rare, technical paleontology term for a primitive early reptile group used mainly in older or specialized classifications.","zh":"Proganosauria 是罕见的古生物学术语，在一些较早或较专业的分类体系中用来指代原始的早期爬行动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name used in some classifications for an early group of primitive reptiles (now mostly of historical/technical interest in paleontology).","zh":"（古生物学术语）一些分类体系中使用的名称，指一类早期、原始的爬行动物群（如今多为历史性/技术性用法）。"},"examples":[{"en":"In older paleontology books, Proganosauria may appear as a group of early reptiles.","zh":"在较早的古生物学书籍中，可能会出现 Proganosauria 作为早期爬行动物类群的名称。"},{"en":"The term Proganosauria is not common in modern biology classes.","zh":"Proganosauria 这个词在现代生物课中并不常见。"}]}],"synonyms":["early reptiles","primitive reptiles","basal reptiles"],"phonetic":"/proʊˌɡænəˈsɔriə/","extraExplanation":["这个词属于非常专业的系统分类用语，而且在不同年代、不同作者的分类方案里可能含义不完全一致；现代文献更常用更新的类群名称与系统发育框架来描述这些“早期爬行动物”。","如果你是在论文、书目或化石资料里看到它，建议同时核对作者、年份与其所给出的诊断特征/包含范围（included taxa），以确定它在该文本中的具体指代。"]}
{"word":"progenerate","summary":{"en":"“Progenerate” means “to procreate; to produce offspring,” but it is rare and old-fashioned in modern English.","zh":"“progenerate”意为“生育、繁衍后代”，但在现代英语中较少见且偏旧式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to produce offspring; to procreate (rare/old-fashioned).","zh":"繁衍后代；生育（较少见/较旧式用法）。"},"examples":[{"en":"Many animals can progenerate quickly when food is plentiful.","zh":"当食物充足时，许多动物能够很快繁衍。"},{"en":"The text uses “progenerate” as a formal way to say “procreate.”","zh":"这段文字用“progenerate”作为“procreate（生育）”的正式说法。"}]}],"synonyms":["procreate","reproduce","breed"],"phonetic":"/proʊˈdʒɛnəˌreɪt/","extraExplanation":["“progenerate”在现代英语里非常少见，通常用更常见的“procreate”（生育、繁殖）或“reproduce”（繁殖）来表达。","词源上可理解为 pro-（向前、为了）+ generate（产生、生成）。在较早或更正式的文体中偶尔会出现。"]}
{"word":"progeneration","summary":{"en":"A rare, formal noun meaning procreation or, less commonly, offspring/descendants.","zh":"一个罕见且正式的名词，主要指“生殖/繁衍”，较少情况下也可指“子孙后代”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) The act of producing offspring; procreation.","zh":"（罕见，正式）繁衍后代；生殖。"},"examples":[{"en":"Some older texts use “progeneration” to mean the natural process of procreation.","zh":"一些较早的文本会用“progeneration”来表示自然的生殖过程。"},{"en":"The author discussed marriage mainly in terms of progeneration and family duty.","zh":"作者主要从繁衍后代和家庭责任的角度讨论婚姻。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) Offspring; descendants collectively.","zh":"（罕见，正式）子孙后代（总称）。"},"examples":[{"en":"He spoke of his progeneration as a source of pride.","zh":"他把自己的子孙后代视为骄傲的来源。"},{"en":"The estate was intended to remain in the family’s progeneration.","zh":"这处产业原本打算留给家族的后代。"}]}],"synonyms":["procreation","reproduction","offspring","descendants"],"phonetic":"/ˌproʊdʒɛnəˈreɪʃən/","extraExplanation":["“progeneration”在现代英语里非常少见，更常用的词是“procreation”（生育/生殖）、“reproduction”（繁殖/复制）或“offspring/descendants”（后代）。","词源上可拆为pro-（向前、往前）+ generation（产生、世代），因此既可指“繁衍的行为”，也可指“后代”。在阅读旧书、宗教或哲学文献时更可能遇到。"]}
{"word":"progenerative","summary":{"en":"Progenerative means “promoting or producing new creation,” sometimes used for systems (like grammar or AI) that can generate new outputs.","zh":"progenerative 指“促进或产生新的创造”，有时用于描述（如语法或 AI）能生成新输出的系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing, promoting, or encouraging the creation of something new (such as ideas, language, or biological offspring).","zh":"产生、促进或鼓励新事物的生成（如想法、语言或生物后代）。"},"examples":[{"en":"The workshop was designed to be progenerative, helping students turn small ideas into full projects.","zh":"这个工作坊的设计具有促进生成的作用，帮助学生把小点子发展成完整项目。"},{"en":"Some policies aim to be progenerative by supporting young families and childcare.","zh":"一些政策旨在促进生育与家庭发展，例如支持年轻家庭和托育服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"In linguistics or AI contexts: able to generate new, well-formed expressions (for example, a grammar or system that can produce many sentences).","zh":"（语言学或人工智能语境）具有生成能力：能够产生新的、合乎规则的表达（例如能产出大量句子的语法或系统）。"},"examples":[{"en":"A progenerative grammar can produce an unlimited number of sentences from a limited set of rules.","zh":"生成型语法可以用有限的规则产生无限数量的句子。"},{"en":"Researchers want progenerative models that can create useful text without copying training data.","zh":"研究人员希望模型具备促进生成的能力，能创造有用文本而不是照搬训练数据。"}]}],"synonyms":["generative","creative","productive","innovative","procreative (biological sense)"],"phonetic":"/proʊˈdʒɛnərətɪv/","extraExplanation":["“progenerative”不是日常高频词，更常见的表达包括：creative（有创造力的）、generative（生成的）、productive（富有产出的）、procreative（生殖的，偏生物/人类繁衍语境）。","词形上可拆为 pro-（支持、促进）+ generative（生成的）。在写作中使用时，最好给出明确语境（教育/创意/技术/人口政策等），避免读者觉得生僻或含义不清。"]}
{"word":"progenies","summary":{"en":"“Progenies” means the children/descendants (offspring) of someone or something; it can also mean products/results that come from an earlier source (less common).","zh":"“Progenies”指某人或某物的子女/后代（后裔、子孙）；也可指由先前来源产生的产物/结果（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Children or descendants of a person, group, or animal; offspring (plural form of “progeny”).","zh":"某人、某群体或动物的子女；后代；子孙（“progeny”的复数形式）。"},"examples":[{"en":"The king’s progenies were raised in different regions of the country.","zh":"国王的子女在国家不同地区长大。"},{"en":"Many animals protect their progenies until they can survive on their own.","zh":"许多动物会保护自己的幼崽，直到它们能独立生存。"},{"en":"They traced their progenies back to a common ancestor.","zh":"他们把自己的后代追溯到同一位祖先。"}]},{"partOfSpeech":"n.","definition":{"en":"People, things, or ideas that come from an earlier source; results or products (less common; often used with “the progeny of …”).","zh":"源自先前事物的人、物或思想；产物；结果（较少见，常用“the progeny of ……”表达）。"},"examples":[{"en":"These new styles are progenies of earlier musical traditions.","zh":"这些新风格是早期音乐传统的产物。"},{"en":"The policy’s progenies included unexpected social changes.","zh":"该政策的“后果/产物”包括一些意想不到的社会变化。"}]}],"synonyms":["offspring","descendants","children","heirs","issue","lineage"],"phonetic":"/ˈprɑːdʒəni/","extraExplanation":["“Progeny”在现代英语里多数情况下既可作不可数（整体意义：后代/子孙），也可作可数（一个或多个后代）。因此写“progenies”并非错误，但在日常写作中更常见的是用“progeny”表示复数概念，或直接用更口语的“children / descendants / offspring”。","在比喻义（“……的产物/结果”）里，更常见的固定搭配是“the progeny of …”。写“progenies”也可以，但会显得更正式或不那么常用。"]}
{"word":"progenital","summary":{"en":"A rare adjective meaning “reproductive; related to producing offspring.”","zh":"一个较少见的形容词，意为“生殖的；与繁衍后代有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to reproduction or the ability to produce offspring; procreative.","zh":"（较少见）与生殖或繁衍后代能力有关的；生殖的。"},"examples":[{"en":"Some early medical writers used “progenital” to describe reproductive functions.","zh":"一些早期医学作者用“progenital”来描述生殖功能。"},{"en":"The text contrasts progenital organs with those used mainly for digestion.","zh":"这篇文章将生殖器官与主要用于消化的器官作对比。"}]}],"synonyms":["reproductive","procreative","generative"],"phonetic":"/proʊˈdʒɛnɪtəl/","extraExplanation":["“progenital”在现代英语里非常少见，多数场合人们会用更常见的词：reproductive / procreative / generative（生殖的、繁衍的）。","它容易和“congenital”（先天的，出生时就有的）混淆；如果你想表达“先天的/出生就有的”，通常应使用 congenital。","词根联想：progeny（后代）、progenitor（祖先/始祖）。"]}
{"word":"progenitive","summary":{"en":"Progenitive means “able to produce offspring” or “relating to reproduction,” and it can rarely mean a producer of offspring.","zh":"progenitive 指“能生育/能繁殖后代的”或“与生殖相关的”，少数情况下也可作名词指“生殖者/始祖”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to produce offspring; relating to begetting or generation.","zh":"能繁殖后代的；与生育、繁衍有关的。"},"examples":[{"en":"In biology, progenitive cells can give rise to new cells.","zh":"在生物学中，progenitive（能产生后代的）细胞可以产生新细胞。"},{"en":"The article discussed progenitive health, focusing on fertility and reproduction.","zh":"这篇文章讨论了与生育相关的健康问题，重点关注生育力与繁殖。"}]},{"partOfSpeech":"n.","definition":{"en":"Something or someone that produces offspring; a begetter or progenitor (rare).","zh":"能产生后代的人或事物；生殖者、始祖（较少用）。"},"examples":[{"en":"The poet described the earth as the progenitive of all living things.","zh":"诗人把大地描写为万物的“生殖之源”。"}]}],"synonyms":["fertile","reproductive","procreative","generative"],"phonetic":"/proʊˈdʒɛnɪtɪv/","extraExplanation":["这个词在现代英语里比较少见，更多出现在学术写作（生物学、医学、人口学）或较文学化的语境中。日常表达里更常用 fertile（多产的/能生育的）、reproductive（生殖的）、procreative（生育的）。","词源来自拉丁语 progenies（后代、子孙），与 progenitor（祖先/始祖）同源。注意它不是常见语法术语；不要和 genitive（属格）混淆。"]}
{"word":"progenitiveness","summary":{"en":"Progenitiveness means the ability to produce offspring, and sometimes (figuratively) to produce many ideas or results.","zh":"progenitiveness 指繁殖力、生殖能力；也可比喻为产出很多想法或成果的“多产”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to produce offspring; reproductive capacity; fecundity.","zh":"生殖能力；繁殖力；多产（指能生育后代的能力）。"},"examples":[{"en":"Some species are valued for their progenitiveness in captivity.","zh":"有些物种因其在人工饲养环境中的繁殖力而受到重视。"},{"en":"Poor nutrition can reduce progenitiveness in many animals.","zh":"营养不良会降低许多动物的繁殖能力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The ability to generate many results or ideas; productivity.","zh":"（比喻）产出能力；创造力；多产（指成果或想法很多）。"},"examples":[{"en":"The team’s progenitiveness led to a steady stream of new proposals.","zh":"团队的“多产”带来了源源不断的新提案。"},{"en":"Her writing shows progenitiveness, with essays published almost weekly.","zh":"她的写作十分多产，几乎每周都有文章发表。"}]}],"synonyms":["fertility","fecundity","prolificness","productivity"],"phonetic":"/proʊˌdʒɛnɪtɪv.nəs/","extraExplanation":["“progenitiveness”较少见、偏正式，常见替代词包括“fertility / fecundity”（繁殖力）以及“productivity”（生产力、产出）。","词根来自拉丁语：progenitor（祖先、始祖；产生者）相关。理解为“产生后代/产生成果的能力”会更好记。","在文学或学术写作中偶尔出现，用于强调“不断产生”的特质；日常英语里通常不会用这个词。"]}
{"word":"progenitor","summary":{"en":"A formal word meaning an ancestor/original parent, or a founder/originator of something.","zh":"较正式的词：指祖先/始祖，也可指某事物的开创者或奠基者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, animal, or plant from which others are descended; an ancestor or original parent.","zh":"（人/动物/植物的）祖先；始祖；原始亲本"},"examples":[{"en":"She discovered that her progenitor came from a small village in Ireland.","zh":"她发现自己的祖先来自爱尔兰的一个小村庄。"},{"en":"The wolf is considered a progenitor of many domestic dog breeds.","zh":"狼被认为是许多家犬品种的祖先。"},{"en":"In biology, a progenitor cell can develop into more specialized cells.","zh":"在生物学中，祖细胞可以发育成更专门化的细胞。"}]},{"partOfSpeech":"n.","definition":{"en":"The originator or early founder of an idea, tradition, system, or group.","zh":"（思想/传统/制度/群体的）开创者；奠基者"},"examples":[{"en":"Many people see her as a progenitor of modern environmental activism.","zh":"许多人把她视为现代环保行动的开创者。"},{"en":"The film is often described as a progenitor of the superhero genre.","zh":"这部电影常被称为超级英雄类型的先驱之作。"}]}],"synonyms":["ancestor","forebear","forefather","founder","originator","forerunner"],"phonetic":"/proʊˈdʒɛnɪtɚ/","extraExplanation":["“progenitor”语气偏正式，常见于历史、族谱、学术写作与生物学语境；日常口语里更常用“ancestor（祖先）”“forefather（祖先/先辈）”“founder（创始人）”。","词源来自拉丁语 pro-（向前）+ gignere（生育、产生），含义是“生出/产生某物的人或事物”。在生物学中常与“progenitor cell（祖细胞）”搭配，强调“能分化但未完全专门化”的阶段。"]}
{"word":"progenitorial","summary":{"en":"“Progenitorial” means ancestral or related to parents/lineage (a rare word in modern English).","zh":"“progenitorial”表示“祖先的/与父母或血统有关的”（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to parents, ancestors, or one’s lineage; ancestral.","zh":"与父母、祖先或血统有关的；祖传的；祖先的。"},"examples":[{"en":"The family kept a progenitorial home in the village for generations.","zh":"这家族在村里保留了一座祖传老宅，延续了好几代。"},{"en":"Her stories often return to progenitorial roots and migration.","zh":"她的故事常常回到祖先根源与迁徙经历。"}]}],"synonyms":["ancestral","parental","hereditary","lineal","forebears’"],"phonetic":"/pɹoʊˌdʒɛnəˈtɔɹiəl/","extraExplanation":["“Progenitorial”在现代英语中非常罕见，更常见的表达是“ancestral（祖先的）”“parental（父母的）”“hereditary（遗传的/世袭的）”“lineal（直系的）”。写作时若想更自然，通常会用这些词来替代。","词源上与拉丁语“progenitor（祖先/始祖）”有关；在学术或文学性语境中偶尔可见，用来强调“源头、血缘传承”的意味。"]}
{"word":"progenitors","summary":{"en":"Progenitors are ancestors or original sources that give rise to later people or things.","zh":"progenitors 指“祖先/先辈”，也可指“某事物的起源或前身”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or animals/plants) who are the original ancestors of a family line; forebears.","zh":"（人或动植物的）祖先；先辈；始祖。"},"examples":[{"en":"Her progenitors came to the U.S. in the 1800s.","zh":"她的祖先在19世纪来到美国。"},{"en":"Many cultures honor their progenitors through stories and ceremonies.","zh":"许多文化会通过故事和仪式纪念祖先。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that produces or starts another thing; an early cause or origin.","zh":"（事物的）起源；发端；始作俑者。"},"examples":[{"en":"Some historians call the printing press a progenitor of modern mass media.","zh":"一些历史学家把印刷机称为现代大众媒体的起源之一。"},{"en":"These early experiments were progenitors of today’s technology.","zh":"这些早期实验是当今技术的前身。"}]}],"synonyms":["ancestors","forebears","forefathers","forerunners","precursors","originators"],"phonetic":"/proʊˈdʒɛnɪtərz/","extraExplanation":["progenitor 来自拉丁语 pro-（向前）+ genitor（生育者、父亲），所以核心感觉是“生出后代的人/事物”。","progenitors 是复数形式；单数是 progenitor。语气比 ancestors 更正式、书面，常见于历史、族谱（genealogy）或学术写作。","文学里常用来强调“源头/始祖”的庄重感，例如讨论“一个民族的progenitors（始祖）”或“某种思想的progenitors（思想源头）”。"]}
{"word":"progenitorship","summary":{"en":"Progenitorship means the status or role of being an ancestor or originator.","zh":"Progenitorship 指“作为祖先或创始者的身份/地位”，强调起源与传承关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the status or role of being a progenitor (an ancestor or originator); the fact of coming before and giving rise to later people, groups, or ideas","zh":"祖先（或创始者）的身份/地位；作为起源与源头、先于并孕育后世的人群、群体或思想的事实"},"examples":[{"en":"The museum exhibit explored the progenitorship of early farming communities in the region.","zh":"博物馆展览探讨了该地区早期农耕社群的祖先渊源与起源地位。"},{"en":"In the novel, the hero searches for the truth about his family’s progenitorship.","zh":"在小说中，主人公追寻自己家族祖源与先祖身份的真相。"}]}],"synonyms":["ancestry","lineage","parentage","forebears","origin"],"phonetic":"proʊˈdʒɛnɪtərʃɪp","extraExplanation":["“progenitorship”较少见，多用于学术写作（历史、人类学、谱系研究）或较正式的文学语境。日常表达更常用“ancestry（血统/祖源）”“lineage（世系/家族传承）”或“origin（起源）”。","词尾“-ship”常表示“身份、状态、职务”（如 friendship 友谊、leadership 领导力/领导地位）。因此 progenitor（祖先/创始者）+ -ship 强调“作为祖先/创始者的身份或地位”。"]}
{"word":"progenitress","summary":{"en":"A formal word meaning a female ancestor or female originator.","zh":"正式用语，指“女祖先”或（比喻）“女性开创者/始创者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female ancestor; the earliest known woman in a family line.","zh":"女祖先；（家族谱系中）最早的女性祖先。"},"examples":[{"en":"In the family tree, she is listed as the progenitress of several branches.","zh":"在家谱中，她被列为多个分支的女祖先。"},{"en":"The legend honors a brave queen as the tribe’s progenitress.","zh":"传说把一位勇敢的女王尊为该部族的女性始祖。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman who originates or starts something (a tradition, a movement, or a group).","zh":"（比喻）开创者、始创者（女性）；某种传统、运动或团体的女性发起人。"},"examples":[{"en":"Many consider her the progenitress of modern community libraries.","zh":"许多人认为她是现代社区图书馆的女性开创者。"},{"en":"The writer is sometimes called the progenitress of a new style of storytelling.","zh":"这位作家有时被称为一种新叙事风格的女性开创者。"}]}],"synonyms":["foremother","female ancestor","foundress","originator"],"phonetic":"/proʊˈdʒɛnɪtrəs/","extraExplanation":["“progenitress”较为少见、偏正式，常见于历史、谱系研究或较文学化的写作中；日常英语里更常用“female ancestor / foremother”。","词源上来自拉丁语系：pro-（向前）+ gen-（生育、产生），与“progenitor”（祖先/始祖，性别中性或常指男性）对应；“progenitress”特指女性。"]}
{"word":"progenitrix","summary":{"en":"Progenitrix means a female ancestor or, figuratively, a female originator of something, and it is very formal.","zh":"progenitrix 指“女性祖先/女始祖”，也可比喻为某事物的“女性起源或创始者”，语体非常正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female ancestor; a woman from whom a family or line of descent begins","zh":"女性祖先；女始祖（某个家族或血统的起源人物）"},"examples":[{"en":"In the family history, she is remembered as the progenitrix of several generations.","zh":"在家族史中，人们把她视为几代人的女始祖。"},{"en":"The novel portrays a fierce progenitrix who holds the clan together.","zh":"小说刻画了一位强势的女始祖，把宗族凝聚在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"the female parent or source of something (used figuratively, often in formal writing)","zh":"（比喻义，较正式）某事物的“女性起源/根源/创始者”"},"examples":[{"en":"Some critics call the poet the progenitrix of a new literary style.","zh":"一些评论家称这位诗人是一种新文学风格的“女创始者”。"}]}],"synonyms":["foremother","female ancestor","ancestress","matriarch","originator (figurative)"],"phonetic":"/proʊˈdʒɛnətrɪks/","extraExplanation":["这个词非常正式、带点古典气息，日常英语里更常用 female ancestor / foremother 或 ancestress。","词源来自拉丁语：progenitor（祖先、始祖）+ -trix（表示女性施事者的后缀，如 actress）。现在 -trix 这类“女性专门形式”的词在现代英语里较少新造，但在文学或历史语境中仍会出现。"]}
{"word":"progeniture","summary":{"en":"Progeniture means a person’s offspring/descendants, or (less commonly) the act of producing offspring.","zh":"Progeniture 指一个人的子女/后代；较少见时也可指繁衍（生殖）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s children or descendants; offspring (often used as a collective word).","zh":"（常作集合名词）子女；后代；子孙。"},"examples":[{"en":"The writer left her books to her progeniture.","zh":"那位作家把她的书留给了她的后代。"},{"en":"They gathered for a reunion with their progeniture and grandchildren.","zh":"他们聚在一起，与子女和孙辈团聚。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of producing offspring; reproduction (formal/less common).","zh":"（较正式/较少见）生殖；繁衍的过程。"},"examples":[{"en":"The article discussed progeniture in different animal species.","zh":"那篇文章讨论了不同动物物种的繁殖过程。"}]}],"synonyms":["offspring","descendants","children","issue (legal)","posterity"],"phonetic":"/proʊˈdʒɛnɪtʃər/","extraExplanation":["“progeniture”语气偏正式，常见于法律、历史、文学或学术语境。日常英语里更常说“children / kids / offspring / descendants”。","词源上与拉丁语 *progenitor*（祖先、始祖）相关，因此带有“家族传承、世系”的色彩。文学或历史叙述中用它，会比“children”更庄重、更强调血脉延续。"]}
{"word":"progenity","summary":{"en":"“Progenity” is a rare noun meaning offspring or descendants; today, “progeny” is much more common.","zh":"“progenity”是个较少见的名词，意为“子嗣/后代”；现代英语更常用“progeny”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"offspring or descendants; one’s children or later generations (rare/old-fashioned).","zh":"子嗣；后代；后裔（较少见/较古旧用法）。"},"examples":[{"en":"In the old family records, he wrote about his progenity with pride.","zh":"在旧家谱里，他自豪地写到自己的后代。"},{"en":"The legend says the hero’s progenity spread across the land.","zh":"传说这位英雄的后裔遍布各地。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, rare) the young produced by an organism; offspring in general.","zh":"（生物学，较少见）由某个生物产生的幼体/后代；统称后代。"},"examples":[{"en":"The study measured the health of the progenity after environmental changes.","zh":"这项研究测量了环境变化后后代的健康状况。"}]}],"synonyms":["progeny","offspring","descendants","issue"],"phonetic":"/proʊˈdʒɛnɪti/","extraExplanation":["“progenity”在现代英语中非常少见，更常用的是“progeny”（后代、子孙）。如果你是在写作或考试中使用，通常建议用“progeny”。","它和“progenitor”（祖先、始祖）同源，都来自拉丁语词根，和“产生、繁衍”的意思有关。","“Progenity”也可能是专有名词（例如公司名）；如果你看到的是标题或品牌，语义可能不按普通词汇来理解。"]}
{"word":"progeny","summary":{"en":"“Progeny” is a formal noun meaning someone’s offspring/descendants, or (figuratively) something produced by an earlier source.","zh":"“progeny”是较正式的名词，指子女/后代，也可引申为由某事物产生的产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s children or descendants; offspring.","zh":"（某人的）子女；后代；后裔。"},"examples":[{"en":"The artist’s progeny inherited her love of music.","zh":"那位艺术家的子女继承了她对音乐的热爱。"},{"en":"Many families keep records of their progeny for generations.","zh":"许多家族会把后代的记录保存好几代。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that comes from an earlier source; a result or product of something (often ideas, projects, or styles).","zh":"（比喻）由某事物产生的结果或产物（常指想法、项目、风格等的“衍生物”）。"},"examples":[{"en":"The new app is a progeny of years of research.","zh":"这款新应用是多年研究的产物。"},{"en":"Modern pop is, in part, the progeny of earlier musical traditions.","zh":"现代流行音乐在一定程度上是早期音乐传统的衍生结果。"}]}],"synonyms":["offspring","descendants","children","issue","lineage"],"phonetic":"/ˈprɑːdʒəni/","extraExplanation":["“Progeny”语气偏正式，常见于新闻、学术写作或文学语境；日常口语更常用“children / kids / descendants”。","词源来自拉丁语 *progenies*，与“pro-（向前）+ gen-（生、产生）”有关，因此既可指“后代”，也可引申为“由某事产生的产物”。"]}
{"word":"progeotropic","summary":{"en":"Progeotropic is a medical adjective meaning “toward the ground,” especially describing the direction of nystagmus in vestibular disorders.","zh":"Progeotropic 是医学形容词，意为“朝向地面（向下侧）”，常用于描述前庭疾病中眼震的方向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing eye movements (nystagmus) or symptoms that beat/shift toward the ground (the downward side) when the head is turned.","zh":"（医学）指眼震（nystagmus）或症状在转头/侧卧时朝向地面（向下侧）方向跳动或偏移。"},"examples":[{"en":"In lateral canal BPPV, the patient showed progeotropic nystagmus when lying on either side.","zh":"在外侧半规管型良性阵发性位置性眩晕（BPPV）中，患者侧卧到任一侧时出现向地性（progeotropic）眼震。"},{"en":"The clinician noted that the fast phase was progeotropic, suggesting a specific canalith pattern.","zh":"临床医生注意到快相为向地性（progeotropic），提示特定的耳石运动模式。"}]}],"synonyms":["geotropic","toward the ground","downward-beating (in context)"],"phonetic":"/ˌproʊˌdʒiːəˈtrɑːpɪk/","extraExplanation":["该词多见于前庭医学/耳鼻喉科文献，尤其用于描述“外侧（水平）半规管BPPV”的眼震方向。临床上常与 ageotropic（背地性/远离地面）对照，用来帮助判断病变侧别与耳石所在位置（如管腔游离或附着）。","词源拆解：pro-（向前/朝向）+ geo-（地）+ -tropic（转向/趋向），整体可理解为“朝向地面”。在实际阅读中也常直接看到 geotropic（向地性）作为近义表达。"]}
{"word":"progeotropism","summary":{"en":"Progeotropism means growth toward gravity (downward), especially in plant roots.","zh":"progeotropism 指植物朝重力方向（向下）的生长反应，常见于根。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant growth response in which an organ grows in the direction of gravity (downward), such as roots growing into the soil.","zh":"向地性（正向向地性）：植物器官沿重力方向（向下）生长的反应，例如根向土壤深处生长。"},"examples":[{"en":"Roots usually show progeotropism, growing downward into the ground.","zh":"根通常表现出向地性，向下生长进入土壤。"},{"en":"In a germinating seed, progeotropism helps the root find water and minerals.","zh":"在种子萌发时，向地性帮助根找到水分和矿物质。"}]}],"synonyms":["positive geotropism","positive gravitropism"],"phonetic":"/ˌproʊˌdʒiˈɑːtrəˌpɪzəm/","extraExplanation":["词源提示：pro-（向前/朝向）+ geo-（地、地球）+ -tropism（向性，指生物对刺激产生的定向生长/运动反应）。","对比概念：负向向地性（negative geotropism）指“背离重力方向”生长，典型例子是茎常向上生长。","在现代教材里更常用的术语是 positive gravitropism（正向向重力性）或 positive geotropism；progeotropism 属于较偏学术/较旧的用法。"]}
{"word":"progeria","summary":{"en":"Progeria is a very rare genetic disease that causes premature aging in children.","zh":"Progeria 指一种极罕见的遗传病，会导致儿童出现早发性衰老表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very rare genetic condition that causes children to show signs of aging much earlier than normal","zh":"一种极其罕见的遗传性疾病，会让儿童过早出现类似衰老的表现"},"examples":[{"en":"Progeria is extremely rare, and most doctors will never see a case in person.","zh":"早衰症非常罕见，大多数医生一生中可能都不会亲眼见到病例。"},{"en":"Children with progeria usually grow normally at first, but they later develop signs of premature aging.","zh":"患有早衰症的孩子起初通常发育正常，但之后会出现早发性衰老的迹象。"},{"en":"The film raised public awareness of progeria and the families affected by it.","zh":"这部影片提高了公众对早衰症以及受其影响家庭的关注。"}]}],"synonyms":["Hutchinson–Gilford progeria syndrome","HGPS"],"phonetic":"/proʊˈdʒɪriə/","extraExplanation":["医学上常见的类型叫 Hutchinson–Gilford progeria syndrome（HGPS），通常与 LMNA 基因突变有关；它并不是“正常衰老加速版”，而是一种特定的罕见病。","使用这个词时要注意表达的尊重与敏感：可说“children/people with progeria（患有早衰症的人）”，避免把疾病当作标签来称呼个体。"]}
{"word":"progermination","summary":{"en":"“Progermination” (more often written “pro-germination”) means promoting germination; it can also refer to something that helps seeds sprout.","zh":"“progermination”（更常写作“pro-germination”）指“促进发芽”；也可指“促使种子萌发的因素/物质”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology; uncommon) Promoting or encouraging germination (the sprouting of seeds or spores).","zh":"（生物学；不常见）促使或有利于发芽（种子或孢子开始萌发）。"},"examples":[{"en":"Researchers tested a pro-germination treatment to help older seeds sprout.","zh":"研究人员测试了一种促发芽处理方法，帮助较老的种子萌发。"},{"en":"Warm temperatures and moisture create pro-germination conditions for many plants.","zh":"温暖的温度和充足的水分会为许多植物创造有利于发芽的条件。"}]},{"partOfSpeech":"n.","definition":{"en":"A factor, condition, or substance that promotes germination.","zh":"促发芽因素；促发芽条件或物质。"},"examples":[{"en":"Light can act as a pro-germination signal for some seeds.","zh":"对某些种子来说，光照可以作为促发芽信号。"},{"en":"They added a pro-germination hormone to the growth medium.","zh":"他们在培养基中加入了一种促发芽激素。"}]}],"synonyms":["germination-promoting","sprouting-promoting","seed-activating"],"phonetic":"/ˌproʊˌdʒɝməˈneɪʃən/","extraExplanation":["“progermination / pro-germination”不是常见日常词，更常见于植物学、农业或论文写作中；常见写法带连字符：pro-germination。","很多学习者会把它和“procrastination（拖延）”混淆；两者意义完全不同：germination=发芽，pro-表示“促进/支持”。"]}
{"word":"progestational","summary":{"en":"“Progestational” means related to progesterone or having progesterone-like effects; it can also refer to a progesterone-like drug (progestin).","zh":"progestational 指“与黄体酮（孕激素）相关”或“具有黄体酮样作用”；也可指一类具有孕激素样作用的药物（progestin）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to progesterone or causing effects like progesterone (a hormone involved in the menstrual cycle and pregnancy).","zh":"与黄体酮（孕激素）有关的；或产生类似黄体酮作用的（黄体酮参与月经周期与妊娠相关过程）。"},"examples":[{"en":"The doctor prescribed a progestational medication to help regulate her menstrual cycle.","zh":"医生开了具有孕激素作用的药物，帮助她调节月经周期。"},{"en":"Some birth control pills contain progestational hormones.","zh":"有些避孕药含有孕激素样的激素成分。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug or substance with progesterone-like activity (a progestin).","zh":"具有黄体酮样作用的药物或物质（即“孕激素/合成黄体酮”，progestin）。"},"examples":[{"en":"Different progestationals can have different side effects.","zh":"不同的孕激素类药物可能有不同的副作用。"},{"en":"Her treatment plan included an estrogen and a progestational.","zh":"她的治疗方案包括雌激素和一种孕激素类药物。"}]}],"synonyms":["progesterone-related","progestogenic","progestin (as a noun in many contexts)"],"phonetic":"/ˌproʊdʒɛˈsteɪʃənəl/","extraExplanation":["在医学语境里，progestational 常用来描述“具有孕激素作用”的性质；更常见、也更口语/临床上更常用的名词是 progestin（合成孕激素）。progesterone 是人体自然产生的黄体酮。","词形提示：progest- 来自 progesterone（黄体酮），-ational 表示“与……有关/具有……性质”。因此看到 progestational，通常可以联想到“孕激素相关/孕激素样”。"]}
{"word":"progesterone","summary":{"en":"Progesterone is a hormone that regulates the menstrual cycle and supports pregnancy; it can also refer to the hormone used as a medicine.","zh":"Progesterone（孕激素/黄体酮）是一种调节月经周期并支持妊娠的激素；也可指其作为药物使用的形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural hormone (especially made by the ovaries and placenta) that helps regulate the menstrual cycle and supports pregnancy by preparing and maintaining the uterus lining","zh":"一种天然激素（主要由卵巢与胎盘分泌），用于调节月经周期，并通过准备与维持子宫内膜来支持妊娠"},"examples":[{"en":"Progesterone levels rise after ovulation.","zh":"排卵后，孕激素（黄体酮）水平会上升。"},{"en":"During pregnancy, progesterone helps maintain the uterine lining.","zh":"在怀孕期间，孕激素（黄体酮）有助于维持子宫内膜。"}]},{"partOfSpeech":"n.","definition":{"en":"a medication form of this hormone used in birth control, hormone therapy, or fertility and pregnancy-related care","zh":"这种激素的药物形式，用于避孕、激素治疗，或与生育/妊娠相关的医疗护理"},"examples":[{"en":"Her doctor prescribed progesterone to help regulate her cycle.","zh":"医生开了孕激素（黄体酮）来帮助调节她的月经周期。"},{"en":"Some forms of birth control contain a progestin, which acts like progesterone.","zh":"一些避孕方式含有“孕激素类”（progestin），其作用类似孕激素（黄体酮）。"}]}],"synonyms":["(hormone sense) luteal hormone","(medicine context) progesterone therapy","(related, not exact) progestin"],"phonetic":"/proʊˈdʒɛstərˌoʊn/","extraExplanation":["“progesterone”在中文里常译为“孕激素”或“黄体酮”。严格来说，“黄体酮”常指具体化学物质（progesterone 本身），而临床上还会出现“孕激素类/孕激素制剂”（progestins），它们是结构不同但功能相近的合成药物。","词源提示：pro-（为、支持）+ gestation（妊娠）→ 字面上有“支持妊娠的激素”之意，能帮助记忆其核心功能。","文化与沟通提醒：涉及激素、月经、避孕与怀孕的话题在不同文化中敏感度不同；在医疗沟通中用中性、尊重的表达（如“reproductive health/生殖健康”）通常更合适。"]}
{"word":"progestin","summary":{"en":"A progesterone-like hormone used especially in contraception and hormone therapy.","zh":"一种类似孕酮作用的激素，尤其常用于避孕与激素治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural or synthetic hormone that acts like progesterone, often used in birth control and hormone therapy.","zh":"一种天然或合成的激素，作用类似于黄体酮（孕酮），常用于避孕药和激素治疗。"},"examples":[{"en":"Many birth control pills contain both estrogen and a progestin.","zh":"许多避孕药含有雌激素和一种孕激素。"},{"en":"The doctor recommended a progestin to help regulate her menstrual cycle.","zh":"医生建议使用孕激素来帮助调节她的月经周期。"}]}],"synonyms":["synthetic progesterone (informal)","gestagen (more technical/European usage)"],"phonetic":"/proʊˈdʒɛstɪn/","extraExplanation":["“Progestin”是医学与药学里的常用词，指“具有孕酮样作用的物质”。英文中“progesterone（孕酮）”通常特指人体天然激素；而“progestin”常指药物中的合成孕激素（也可泛指任何具有孕酮样作用的激素）。","常见语境：避孕（如口服避孕药、皮下植入剂、部分宫内节育器IUD）、更年期或激素替代治疗、以及某些妇科疾病的治疗。不同种类的progestin在副作用与适应症上可能不同，日常阅读健康信息时可留意具体名称（如 levonorgestrel 等）。"]}
{"word":"progestogen","summary":{"en":"Progestogen is a progesterone-like hormone (natural or synthetic), important in the menstrual cycle, pregnancy, and some contraceptives and hormone therapies.","zh":"孕激素是作用类似黄体酮的一类激素（天然或合成），与月经周期、妊娠以及某些避孕与激素治疗相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hormone (natural or synthetic) that has effects like progesterone, especially preparing the lining of the uterus for pregnancy and helping maintain pregnancy; it is also used in some hormonal medicines.","zh":"孕激素（天然或合成）的一类激素，作用类似黄体酮，主要使子宫内膜为怀孕做准备并帮助维持妊娠；也用于某些激素类药物中。"},"examples":[{"en":"Some birth control pills contain a progestogen to help prevent pregnancy.","zh":"一些避孕药含有孕激素，用来帮助预防怀孕。"},{"en":"Doctors may prescribe a progestogen with estrogen in hormone therapy to protect the uterine lining.","zh":"在激素治疗中，医生可能会把孕激素与雌激素一起开具，以保护子宫内膜。"}]}],"synonyms":["gestagen","progestational hormone","progesterone (as a specific natural example)"],"phonetic":"/proʊˈdʒɛstədʒən/","extraExplanation":["“progestogen”是英式/国际医学用语，在美国临床语境中更常见到“progestin”（通常指合成孕激素）。但严格说，“progestogen”可包含天然黄体酮（progesterone）及其类似物，而“progestin”多指合成类。","与“progesterone（黄体酮）”的关系：progesterone是具体的一种天然激素；progestogen是更大的“类别名”。","常见搭配：progestogen-only pill（仅含孕激素的避孕药，俗称迷你丸）、combined pill（雌激素+孕激素复方避孕药）、IUD with progestogen（含孕激素的宫内节育器/宫内系统）。"]}
{"word":"progged","summary":{"en":"“Progged” is an informal past form meaning “programmed,” and sometimes “probed/asked questions.”","zh":"“progged”是非正式的过去式，主要表示“编程/设定好了”，有时也表示“试探性追问/打听”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Informal past tense/past participle of “prog” meaning “programmed” (set up instructions in a computer, device, or system).","zh":"“prog”的非正式过去式/过去分词，意思是“编程了/设定好了”（为电脑、设备或系统写入指令或设置流程）。"},"examples":[{"en":"I progged the coffee machine to start at 7 a.m.","zh":"我把咖啡机设定成早上7点自动启动。"},{"en":"The drone was progged to return home if the battery got low.","zh":"无人机被设定为电量低时自动返航。"}]},{"partOfSpeech":"v.","definition":{"en":"Informal past tense/past participle of “prog” meaning “checked or probed” (asked questions to find out more).","zh":"“prog”的非正式过去式/过去分词，也可指“试探性地打听/追问”（通过提问来了解更多）。"},"examples":[{"en":"She progged him about his plans for after graduation.","zh":"她追问他毕业后的打算。"},{"en":"I gently progged to see if he needed help.","zh":"我委婉地试探了一下，看他是否需要帮忙。"}]}],"synonyms":["programmed","coded","set up","configured","probed","questioned"],"phonetic":"/prɑɡd/","extraExplanation":["“progged”常见于口语、短信、论坛或技术圈的非正式写法，等同于“programmed”。更正式的写法通常用“programmed”（美式也常用“programed”）。","“prog”还有“前卫摇滚（progressive rock）”的简称，但“progged”在这个音乐义下不常用；更常见的是“prog rock”或“proggy（adj.）”。"]}
{"word":"progger","summary":{"en":"“Progger” is an informal noun most often meaning a progressive-rock fan; more rarely, it can mean a programmer.","zh":"“progger”是非正式名词，最常指“前卫摇滚乐迷”；较少情况下也可指“程序员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A fan of progressive rock (“prog”), or someone involved in prog music (as a listener, musician, etc.).","zh":"（非正式）前卫摇滚（prog）的乐迷；也可指从事或参与前卫摇滚的人（听众、乐手等）。"},"examples":[{"en":"My uncle is a real progger—he still collects old Yes and Genesis albums.","zh":"我叔叔是真正的前卫摇滚迷——他到现在还在收藏 Yes 和 Genesis 的老专辑。"},{"en":"The festival attracted proggers from all over Europe.","zh":"这个音乐节吸引了来自欧洲各地的前卫摇滚乐迷。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A programmer; someone who writes computer programs.","zh":"（非正式，较少见）程序员；写计算机程序的人。"},"examples":[{"en":"Ask a progger to review the code before you ship it.","zh":"上线前让程序员检查一下代码。"}]}],"synonyms":["prog fan","prog enthusiast","progressive-rock fan","programmer (rare sense)"],"phonetic":"/ˈprɑɡɚ/","extraExplanation":["“progger”最常见的语境是音乐圈：由“prog（progressive rock，前卫摇滚）+ -er（表示人）”构成，类似“rocker（摇滚乐迷）”。前卫摇滚常与较长篇幅、复杂编曲、概念专辑等风格特征相关。","表示“程序员”的用法更口语、更小众；在多数场合直接说“programmer”更自然，也更不容易引起误解。"]}
{"word":"proggers","summary":{"en":"“Proggers” is a slang plural meaning progressive people (often insulting), and less commonly programmers.","zh":"“proggers”是俚语复数，主要指进步派（多带贬义），较少情况下也指程序员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, usually plural) People who are politically progressive; often used in a mocking or dismissive way.","zh":"（俚语，常用复数）政治立场偏进步的人；常带嘲讽或轻蔑语气。"},"examples":[{"en":"Some commentators use “proggers” to insult progressives instead of debating their ideas.","zh":"有些评论员用“proggers”来辱骂进步派，而不是讨论他们的观点。"},{"en":"He posted a rant about “proggers” on social media.","zh":"他在社交媒体上发了一通骂“proggers”的牢骚。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) Programmers; people who write computer programs.","zh":"（非正式，较少见）程序员；写电脑程序的人。"},"examples":[{"en":"The meetup was full of proggers sharing coding tips.","zh":"聚会里都是程序员在分享编码技巧。"}]}],"synonyms":["progressives","the left (informal)","liberals (context-dependent)","programmers (less common)","developers (tech context)"],"phonetic":"/ˈprɑɡərz/","extraExplanation":["“proggers”多见于英式/网络语境，通常是把“progressives（进步派）”缩成“prog”，再加上带点戏谑的复数后缀“-ers”。在政治讨论中它常被当作标签化、贬义称呼；正式写作或礼貌交流中建议用“progressives / progressive voters”等更中性的说法。","在技术圈把“programmer”说成“prog”并不算主流；更常见的是“dev(s)（开发者）”“coder(s)（码农/写代码的人）”“programmer(s)（程序员）”。"]}
{"word":"progging","summary":{"en":"“Progging” is informal slang meaning either doing programming (coding) or doing something related to prog (progressive rock/metal), depending on context.","zh":"“progging”是非正式俚语：可指写代码/编程，也可指与前卫摇滚/金属（prog）相关的活动，具体看语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) Doing computer programming; writing or working on code.","zh":"（非正式）做计算机编程；写代码或处理程序代码。"},"examples":[{"en":"I’ll be progging tonight—trying to fix a bug in my app.","zh":"我今晚要写代码——试着修复我应用里的一个 bug。"},{"en":"He’s been progging all afternoon for his coding class.","zh":"他为了编程课整个下午都在写代码。"}]},{"partOfSpeech":"v.","definition":{"en":"(music slang) Doing something related to “prog” music (progressive rock/metal), such as playing, writing, or listening to it.","zh":"（音乐俚语）与“前卫/前卫摇滚（prog）”相关的活动，比如演奏、创作或听前卫摇滚/金属。"},"examples":[{"en":"We were progging in the garage—lots of odd time signatures.","zh":"我们在车库里玩前卫——用了很多不规则拍子。"},{"en":"She’s progging again, blasting classic prog rock on headphones.","zh":"她又在听前卫了，耳机里放着经典前卫摇滚。"}]}],"synonyms":["coding","programming","hacking (informal)","listening to prog","playing prog"],"phonetic":"ˈprɑɡɪŋ","extraExplanation":["“progging”不是标准词典里的常用词，更常见于口语、论坛或聊天中，来自缩写“prog”（program/programming 或 progressive rock）再加上 -ing。","语境很关键：在技术圈通常指“programming（编程）”；在音乐圈则多指“prog（前卫摇滚/金属）”相关。正式写作里建议用“programming”或更明确的表达（如“listening to prog rock”）。"]}
{"word":"proglottic","summary":{"en":"Proglottic means “related to a tapeworm segment (proglottis).”","zh":"proglottic 指“与绦虫的节片（孕节，proglottis）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a proglottis (one body segment of a tapeworm).","zh":"与（绦虫的）孕节/节片（proglottis）有关的；节片的。"},"examples":[{"en":"Under the microscope, the proglottic segments were packed with eggs.","zh":"在显微镜下，这些绦虫的孕节（节片）里充满了虫卵。"},{"en":"The lab report described proglottic tissue consistent with a tapeworm infection.","zh":"实验室报告描述了与绦虫感染相符的孕节组织。"}]}],"synonyms":["proglottid","proglottidal","proglottidean"],"phonetic":"/ˌproʊˈɡlɑtɪk/","extraExplanation":["“Proglottic”是寄生虫学/医学中的专业词，常用于描述绦虫（tapeworm）的“节片（proglottis）”。临床或检验语境里，你也可能更常见到名词“proglottid/proglottis”（节片）以及形容词“proglottid/proglottidal”，含义非常接近。","词源上可拆成 pro-（向前）+ glott-（舌/说话相关的词根，但在此为历史构词成分）+ -ic（形容词后缀）。日常英语中几乎不会用到，多出现在教材、检验报告或科研文章里。"]}
{"word":"proglottid","summary":{"en":"A proglottid is one body segment of a tapeworm, often containing reproductive organs and eggs.","zh":"proglottid 指绦虫的一个体节（节片），常含生殖器官并可能携带虫卵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A segment of a tapeworm’s body; each proglottid is one section that can contain reproductive organs and may produce eggs.","zh":"绦虫的体节（节片）；绦虫身体由许多节片组成，每个节片常含有生殖器官，并可能产生虫卵。"},"examples":[{"en":"The microscope slide showed several proglottids from a tapeworm.","zh":"显微镜载玻片上显示出几段绦虫的体节。"},{"en":"In some infections, proglottids may be passed in the stool.","zh":"在某些感染中，绦虫节片可能会随粪便排出。"}]}],"synonyms":["tapeworm segment","segment"],"phonetic":"/proʊˈɡlɑtɪd/","extraExplanation":["词源上，proglottid 来自希腊语词根，意为“舌头/小舌状的片段”，用来形容这些节片常呈扁平或片状。","这个词多见于医学、寄生虫学或兽医学语境；日常英语里不常用，通常会和 tapeworm（绦虫）、segment（节/体节）、egg（虫卵）等词一起出现。"]}
{"word":"proglottidean","summary":{"en":"Proglottidean means “of or related to a tapeworm proglottid (segment).”","zh":"proglottidean 意为“与绦虫的孕节（节片）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a proglottid (one of the small body segments of a tapeworm).","zh":"与孕节（绦虫身体的一节/一个节片）有关的；孕节的。"},"examples":[{"en":"Under the microscope, the technician identified proglottidean structures typical of a tapeworm.","zh":"在显微镜下，检验人员辨认出典型的绦虫孕节相关结构。"},{"en":"Proglottidean segments may be visible in stool in some tapeworm infections.","zh":"在某些绦虫感染中，粪便里可能会看到孕节样的节片。"}]}],"synonyms":["proglottid","segmental (tapeworm)"],"phonetic":"proʊˌɡlɑːˈtaɪdiən","extraExplanation":["这是一个生物学/医学用的专业形容词，来自名词 proglottid（孕节、节片）。proglottid 指绦虫由许多“节”组成的体节，每一节往往含有生殖结构。","词根来源与希腊语有关：pro-（在前）+ glōtta/glōssa（舌头），因为早期形态观察时认为这些节片有点像“舌状”的小片。"]}
{"word":"proglottides","summary":{"en":"Proglottides are the segment units of a tapeworm (plural form of proglottid).","zh":"Proglottides 指绦虫的体节（proglottid 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of proglottid: one of the small, repeated body segments of a tapeworm (a type of parasitic flatworm).","zh":"proglottid（绦虫体节）的复数：指绦虫身体上一个个重复排列的小节片（寄生扁形动物的体节）。"},"examples":[{"en":"The doctor explained that tapeworm proglottides can sometimes be seen in stool.","zh":"医生解释说，有时可以在粪便中看到绦虫的体节（proglottides）。"},{"en":"In the lab, students examined proglottides under a microscope.","zh":"在实验室里，学生们用显微镜观察绦虫体节。"}]}],"synonyms":["tapeworm segments","proglottid (singular)"],"phonetic":"/proʊˈɡlɑːtɪˌdiːz/","extraExplanation":["词源：来自希腊语 proglottis（意为“舌头状的部分”），在寄生虫学中用来指绦虫像“节片”一样的身体单位。","学习提示：proglottides 是复数形式；单数是 proglottid。临床语境里常与 tapeworm（绦虫）、stool sample（粪便样本）、parasite（寄生虫）等词一起出现。"]}
{"word":"proglottis","summary":{"en":"A proglottis is one segment of a tapeworm.","zh":"proglottis 指绦虫身体的一个体节（节段）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A single segment (one of the repeating sections) of a tapeworm’s body.","zh":"（绦虫身体的）体节；由许多重复节段组成的其中一节。"},"examples":[{"en":"Under the microscope, the scientist counted several proglottides in the tapeworm sample.","zh":"在显微镜下，科学家在绦虫样本中数了好几个体节。"},{"en":"Some tapeworm proglottides contain eggs and can break off from the adult worm.","zh":"一些绦虫体节含有虫卵，并可能从成虫身上脱落。"}]}],"synonyms":["tapeworm segment"],"phonetic":"/proʊˈɡlɑːtɪs/","extraExplanation":["proglottis 是寄生虫学/医学里的专门词，多见于讲解绦虫（tapeworm, cestode）的结构：头节（scolex）后面连接许多体节（proglottides）。体节会逐渐成熟，后段常充满卵，被称为“孕节（gravid proglottid）”，有时会脱落并随粪便排出。","词源上来自希腊语成分：pro-（向前）+ glottis（与“舌/口”相关的词根），但在现代英语中它的固定用法就是“绦虫体节”。复数通常写作 proglottides（也可见 proglottises）。"]}
{"word":"prognathi","summary":{"en":"“Prognathi” is usually a word part related to a projecting jaw; you’ll most often see it in “prognathic” or “prognathism.”","zh":"“prognathi”通常作为构词成分表示“颌部向前突出”；更常见于“prognathic / prognathism”等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not common as a standalone word) A word part used in anatomy/anthropology meaning “having a projecting jaw” or “relating to jaw protrusion.” Often seen in words like *prognathic* and *prognathism*.","zh":"（不常单独使用）用于解剖学/人类学的词根/构词成分，表示“下颌（或上下颌）向前突出”或“与颌部前突有关”。常见于 *prognathic*（颌前突的）和 *prognathism*（颌前突）等词。"},"examples":[{"en":"The report describes a skull as prognathic, meaning the jaw projects forward.","zh":"报告把该头骨描述为 *prognathic*，意思是下颌向前突出。"},{"en":"In orthodontics, prognathism can affect a person’s bite and speech.","zh":"在正畸学中，*prognathism*（颌前突）会影响咬合与发音。"}]}],"synonyms":["prognathic","prognathism","jaw protrusion"],"phonetic":"/prɑɡˈnæθɪk/","extraExplanation":["你输入的 **prognathi** 更像是“词根/词干”而不是常用完整词。在学术语境（解剖学、人类学、牙科）更常见的是：\n- **prognathic**（形容词）：颌前突的\n- **prognathism**（名词）：颌前突（现象/特征）\n词源来自希腊语：**pro-**（向前）+ **gnathos**（下颌）。"]}
{"word":"prognathic","summary":{"en":"Prognathic describes a jaw—especially the lower jaw—that protrudes forward.","zh":"prognathic 指（尤指下颌）向前突出的颌/下巴特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a jaw (especially the lower jaw) that sticks out farther than usual.","zh":"（尤指下颌）前突的；下巴/颌骨比一般更向前突出。"},"examples":[{"en":"The dentist noted a prognathic lower jaw.","zh":"牙医指出他的下颌前突。"},{"en":"Some ancient skulls show a more prognathic face than most modern humans.","zh":"一些古代头骨的面部前突程度比大多数现代人更明显。"}]}],"synonyms":["protruding-jawed","projecting-jawed","forward-jutting"],"phonetic":"/ˌprɑɡˈnæθɪk/","extraExplanation":["这是一个较正式、偏医学/人类学的形容词，常见于牙科（咬合、颌面结构）、正畸、以及人类学对头骨特征的描述。日常英语更常用的说法是“a protruding jaw / an underbite（地包天）”。","词源上来自希腊语成分：pro-（向前）+ gnathos（颌、下巴），所以字面意思就是“下巴向前”。","使用时注意它描述的是“结构特征”，最好搭配名词如 jaw / chin / face（prognathic jaw/face），避免用来评价外貌好坏。"]}
{"word":"prognathism","summary":{"en":"Prognathism is the forward projection of the jaw, especially the lower jaw.","zh":"Prognathism 指颌骨（尤指下颌）向前突出的一种状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition in which the jaw (usually the lower jaw) sticks out farther than normal, making the chin or teeth appear more forward","zh":"（颌骨）前突；下颌或上颌向前突出的一种状况（常指下颌），使下巴或牙齿看起来更向前"},"examples":[{"en":"The dentist noted mild prognathism and suggested an orthodontic evaluation.","zh":"牙医发现有轻度下颌前突，并建议做正畸评估。"},{"en":"In some cases, prognathism can affect chewing and speech.","zh":"在一些情况下，颌前突会影响咀嚼和发音。"},{"en":"Photos showed her profile changed after surgery for severe prognathism.","zh":"照片显示她在严重颌前突手术后侧脸轮廓发生了变化。"}]}],"synonyms":["jaw protrusion","mandibular prognathism","protruding jaw","underbite (related)"],"phonetic":"/prɑɡˈneɪθɪzəm/","extraExplanation":["这是一个医学/牙科术语，常见于正畸（orthodontics）与颌面外科（maxillofacial surgery）的语境。不同类型包括“下颌前突”（mandibular prognathism）与“上颌前突”（maxillary prognathism），临床上可能与遗传、发育、牙齿咬合（malocclusion）等因素相关。","在日常英语中更常说“a protruding jaw / underbite（地包天）”，而“prognathism”更偏正式、学术或诊断用语。"]}
{"word":"prognathous","summary":{"en":"Prognathous describes a jaw that projects forward (often used in medical or anthropological contexts).","zh":"prognathous 指（通常在医学或人类学语境中）颌部向前突出的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a jaw (especially the lower jaw) that sticks out farther than normal; projecting forward.","zh":"（尤指下颌）前突的；下巴向前突出的。"},"examples":[{"en":"Some primates have a prognathous face, with the jaw projecting forward.","zh":"有些灵长类动物的脸是下颌前突的，下巴向前伸出。"},{"en":"The dentist noted a slightly prognathous lower jaw.","zh":"牙医注意到下颌略微前突。"}]}],"synonyms":["projecting-jawed","protruding-jawed","jaw-protruding"],"phonetic":"/prɑɡˈneɪθəs/","extraExplanation":["这个词常见于医学、牙科与人类学（anthropology）语境，用来描述“颌部前突”的面部特征。日常英语中更常说：a protruding jaw（突出的下巴）或 an underbite（地包天，通常指下牙在前）。","词源：来自希腊语前缀 pro-（向前）+ gnathos（颌、下巴）。","文化与表达提醒：谈论人的面部特征时，prognathous 是比较“中性、技术性”的描述；在日常交流中最好避免用来评价外貌，可改用更温和或更具体的医学/牙科说法。"]}
{"word":"prognathy","summary":{"en":"Prognathy is a (usually medical) term for a jaw that protrudes forward, especially the lower jaw.","zh":"prognathy 指（多用于医学语境的）突颌/前突颌，通常强调下颌向前突出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/medicine) A condition in which the jaw—especially the lower jaw—projects forward more than usual; protruding jaw structure (prognathism).","zh":"（解剖/医学）下颌（尤指下颌骨）向前突出、超过正常范围的状态；颌突（亦称“前突颌/突颌”，对应 prognathism）。"},"examples":[{"en":"The orthodontist noted mild prognathy and recommended further evaluation.","zh":"正畸医生指出有轻度突颌，并建议进一步检查。"},{"en":"In anthropology, prognathy can be described by measuring how far the jaw projects from the face.","zh":"在人类学中，可通过测量下颌相对面部前突的程度来描述突颌。"}]}],"synonyms":["prognathism","jaw protrusion","mandibular protrusion"],"phonetic":"/prɑːɡˈneɪθi/","extraExplanation":["词源来自希腊语：pro-（向前）+ gnathos（颌、下颌）。常见于医学、牙科正畸与人类学写作中。","学习提示：日常英语里更常用 prognathism（颌突）或形容词 prognathous（突颌的）。prognathy 相对更少见，但含义相同/非常接近。"]}
{"word":"progne","summary":{"en":"“progne” is not a standard English word; you likely mean “prognosis/prognostic/prognosticate” (prediction, often medical).","zh":"“progne”不是标准英语单词；你可能想写“prognosis/prognostic/prognosticate”（预测，常指医学预后）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or incomplete form of words like “prognosis,” “prognostic,” or “prognosticate,” which relate to predicting what will happen (often in medicine).","zh":"不是标准英语单词。很可能是拼写错误或未打完的词，常见可能是“prognosis / prognostic / prognosticate”等，与“预测（常用于医学预后）”有关。"},"examples":[{"en":"I think you meant “prognosis”: The doctor gave her a good prognosis.","zh":"我觉得你想写的是“prognosis”：医生说她的预后很好。"},{"en":"“Prognostic” is often used in medical writing: Prognostic factors include age and overall health.","zh":"“prognostic”常见于医学写作：预后因素包括年龄和整体健康状况。"}]}],"phonetic":"/ˈprɑɡni/","extraExplanation":["“progn-”这一词根来自希腊语，含义与“预先知道/预测”有关，所以常见于医学语境：\n- prognosis：对疾病结果的“预后/预测”\n- prognostic：表示“预后的/预测性的”（形容词）\n- prognosticate：动词，“预测、预言”（语气更正式）\n如果你告诉我你想表达的句子或语境（医学/一般预测），我可以帮你选最合适的词。"]}
{"word":"prognose","summary":{"en":"“Prognose” is a rare verb meaning “to predict/forecast,” especially a medical prognosis.","zh":"“prognose”是一个罕用动词，意为“预测/预后判断”，尤常指医学上的预后。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To predict or forecast what will happen, especially in medicine (how an illness will develop).","zh":"（罕用）预测、预后判断；尤指医学上判断疾病的发展趋势（预后）。"},"examples":[{"en":"The doctor tried to prognose how quickly she would recover.","zh":"医生试着判断她会恢复得多快。"},{"en":"It’s hard to prognose the outcome with so little information.","zh":"信息这么少，很难预测结果。"}]},{"partOfSpeech":"v.","definition":{"en":"(By extension, rare) To make an informed guess about a future result based on signs or evidence.","zh":"（引申，罕用）根据迹象或证据对未来结果作出推测。"},"examples":[{"en":"Analysts prognosed a slowdown in sales next quarter.","zh":"分析师预测下个季度销量会放缓。"}]}],"synonyms":["predict","forecast","foresee","prognosticate"],"phonetic":"/prɑɡˈnoʊz/","extraExplanation":["“prognose”在现代英语里非常少见。日常和学术写作中更常用的是名词“prognosis”（预后、前景）和动词“prognosticate”（预言、预测）。","如果你想表达“疾病的预后”，最自然的说法是：“The prognosis is good/bad.”（预后良好/不良）。","拼写提醒：很多学习者输入“prognose”其实是想写“prognosis”。如果你告诉我你的句子语境（医疗/商业/天气等），我可以帮你选最地道的词。"]}
{"word":"prognosed","summary":{"en":"“Prognosed” means “predicted,” especially a doctor’s prediction about how an illness will develop.","zh":"“Prognosed”表示“预测/预估”，尤指医生对疾病发展和结局的预后判断。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “prognose”: to predict or estimate what will happen in the future, especially the likely course of a disease or situation.","zh":"“prognose”的过去式/过去分词：预测、估计将来会发生什么，尤指对疾病或局势发展结果的判断（预后判断）。"},"examples":[{"en":"The doctors prognosed a full recovery after surgery.","zh":"医生预测手术后会完全康复。"},{"en":"Early reports prognosed that the storm would weaken overnight.","zh":"早期报告预测这场风暴会在夜间减弱。"}]}],"synonyms":["predicted","forecast","anticipated","projected","estimated"],"phonetic":"/prɑɡˈnoʊzd/","extraExplanation":["“prognosed”较常见于医学或较正式的书面语；日常英语里更常说“predicted / expected”。","注意区分：diagnose=诊断（确定是什么病）；prognose=预后判断（接下来会怎样）。名词“prognosis”更常用，如：The prognosis is good（预后良好）。"]}
{"word":"prognoses","summary":{"en":"“Prognoses” means predictions about future outcomes, especially medical ones (plural of “prognosis”).","zh":"prognoses 指对未来结果的预测，尤指医学上的“预后”（prognosis 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “prognosis”: a prediction about how an illness, situation, or project is likely to develop in the future (especially the expected outcome).","zh":"“prognosis”的复数：对疾病、形势或项目未来发展（尤其是结果/结局）的预测。"},"examples":[{"en":"The doctor discussed several possible prognoses with the patient.","zh":"医生和病人讨论了几种可能的预后。"},{"en":"Economists offered different prognoses for the job market next year.","zh":"经济学家对明年的就业市场给出了不同的预测。"}]}],"synonyms":["predictions","forecasts","outlooks","projections"],"phonetic":"/prɑːɡˈnoʊsiːz/","extraExplanation":["发音与拼写：单数是 prognosis /prɑːɡˈnoʊsɪs/，复数变为 prognoses /prɑːɡˈnoʊsiːz/（注意结尾 -sis 变 -ses 的复数规则，读音也会变化，如 crisis→crises）。","使用场景：在医学里最常见，常与 good/poor prognosis（预后好/差）、long-term prognosis（长期预后）搭配；在商业、政治等领域也可用来表示“前景预测”。","易混词：diagnosis（诊断：是什么病/问题） vs. prognosis（预后：未来会怎样/结果如何）。"]}
{"word":"prognosing","summary":{"en":"“Prognosing” means predicting what will happen next, especially a disease’s likely course.","zh":"“Prognosing”指预测未来走向，尤其是对疾病预后作出判断。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"predicting or estimating what will happen in the future, especially the likely course of a disease or situation (present participle of “prognose”).","zh":"预测或推测未来会发生什么，尤其指对疾病或某种状况的发展结果作出判断（“prognose”的现在分词）。"},"examples":[{"en":"The doctor is prognosing a full recovery within six weeks.","zh":"医生预测六周内会完全康复。"},{"en":"Experts are prognosing slower economic growth next year.","zh":"专家预测明年经济增长会放缓。"},{"en":"It’s too early to be prognosing the outcome based on one test.","zh":"仅凭一次检测就预测结果还为时过早。"}]}],"synonyms":["predicting","forecasting","projecting","estimating"],"phonetic":"/prɑɡˈnoʊzɪŋ/","extraExplanation":["“prognosing”多见于医学语境，强调根据症状、检查结果和经验来判断“病程走向/预后”。日常英语里更常用 predict / forecast；写作或正式语境才更常见 prognose/prognosing。","注意区分：diagnose 是“诊断（现在得了什么病）”，prognose/prognosing 是“预后判断（接下来可能怎样发展）”，prognosis 是名词“预后/预测结果”。"]}
{"word":"prognosis","summary":{"en":"Prognosis means an expert prediction of how an illness or situation will develop and what outcome is likely.","zh":"Prognosis 指对疾病或某种情况未来发展及可能结果的专业预测，最常见于医学语境（预后）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doctor’s or expert’s judgment about how an illness or situation is likely to develop in the future; the expected outcome.","zh":"（医生或专家对疾病或情况）未来发展趋势的判断；预后/结局的预测。"},"examples":[{"en":"The doctor said her prognosis is good, and she should recover fully.","zh":"医生说她的预后良好，应该能完全康复。"},{"en":"Early treatment can improve the prognosis for many patients.","zh":"及早治疗可以改善许多患者的预后。"},{"en":"After the accident, his long-term prognosis was uncertain.","zh":"事故之后，他的长期预后仍不确定。"}]},{"partOfSpeech":"n.","definition":{"en":"A forecast about what will happen in the future in a non-medical context (often used in formal writing).","zh":"（非医学语境）对未来结果的预测（常用于较正式的表达）。"},"examples":[{"en":"The economic prognosis for next year is cautiously optimistic.","zh":"明年的经济前景预测是谨慎乐观的。"},{"en":"Without more funding, the prognosis for the project is poor.","zh":"如果没有更多资金，这个项目的前景预测不佳。"}]}],"synonyms":["outlook","forecast","prediction","expectation","prospect"],"phonetic":"/prɑɡˈnoʊsɪs/","extraExplanation":["词源提示：prognosis 来自希腊语，意为“事先知道/预先判断”。因此它常带有“基于专业知识的预测”之意，而不只是随口猜测。","用法区分：prognosis 常用于“疾病/治疗后的结果预测”，而 diagnosis（诊断）强调“现在是什么病/问题是什么”。两者在医疗英语中非常常见、容易混淆。","搭配建议：常见搭配有 good/poor prognosis（预后好/差）、long-term prognosis（长期预后）、prognosis for...（对……的预后/前景）。"]}
{"word":"prognostic","summary":{"en":"Prognostic usually means ‘relating to predicting an outcome,’ especially in medicine.","zh":"Prognostic 通常指“与预测结果有关”，尤用于医学中的“预后判断”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to predicting how a disease, condition, or situation will develop in the future (especially the likely outcome).","zh":"（尤指医学中）与预测疾病、状况或局势未来发展及结局有关的；预后（判断）的。"},"examples":[{"en":"The doctor explained the prognostic factors that affect survival.","zh":"医生解释了影响生存率的预后因素。"},{"en":"Early detection is important for a better prognostic outlook.","zh":"早期发现对更好的预后很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign or statement used to predict a future outcome; a forecast (less common in everyday English).","zh":"（较少见）用于预测未来结果的征兆或说法；预示。"},"examples":[{"en":"They treated the sudden drop in sales as a prognostic of tougher months ahead.","zh":"他们把销量的突然下滑视为未来几个月更艰难的预兆。"}]}],"synonyms":["predictive","prognostical","foretelling","indicative"],"phonetic":"/prɑɡˈnɑstɪk/","extraExplanation":["“prognostic”常见于医疗英语：prognosis（名词：预后/预测）更常用；prognostic（形容词）多搭配factor, sign, marker, indicator（如：prognostic marker 预后标志物）。","词源来自希腊语 pro-（在前）+ gignōskein（知道/辨识），核心含义是“提前知道、预先判断”。","区分：diagnostic（诊断的）回答“现在是什么病/问题”；prognostic（预后的）回答“接下来可能会怎样”。"]}
{"word":"prognosticable","summary":{"en":"Prognosticable means “able to be predicted,” often referring to a medical prognosis.","zh":"prognosticable 指“可预测的”，常用于医学上表示“可进行预后判断的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be predicted or forecast, especially based on signs or evidence (often used in medicine).","zh":"可预测的；可预后判断的（尤用于医学，根据症状或证据来推测结果）。"},"examples":[{"en":"In early-stage cases, the disease is often prognosticable with regular tests and imaging.","zh":"在早期病例中，通过定期检查和影像学评估，这种疾病的走向通常是可预测的。"},{"en":"The doctor explained that the outcome is more prognosticable when treatment begins promptly.","zh":"医生解释说，如果及时开始治疗，结果就更容易做出预后判断。"}]}],"synonyms":["predictable","foreseeable","projectable","prognostic"],"phonetic":"/ˌprɑɡˈnɑstɪkəbəl/","extraExplanation":["“prognosticable”较少见，更常见的表达是“predictable / foreseeable”，医学语境里常用“has a good/poor prognosis（预后好/差）”或“prognostic (factor)（预后相关的/预后因素）”。","构词提示：prognostic（预后的/预测的）+ -able（可……的）→ “可进行预后判断的”。"]}
{"word":"prognostical","summary":{"en":"Prognostical means “predictive” or “showing signs of what will happen,” and it can also relate to medical prognosis.","zh":"prognostical意为“预示性的/预测性的”，也可指与医学“预后”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Predicting what will happen in the future; serving as a sign of something to come.","zh":"（正式）预示未来将发生什么的；作为某事将要发生的征兆的。"},"examples":[{"en":"Dark clouds can be prognostical of a storm.","zh":"乌云可能预示着暴风雨。"},{"en":"The early drop in sales was prognostical of a difficult year.","zh":"早期销量下滑预示着这一年会很艰难。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to making a medical prognosis (a prediction about the course of an illness).","zh":"与（医学上的）预后判断有关的；与病程预测有关的。"},"examples":[{"en":"The doctor discussed the prognostical value of the test results.","zh":"医生讨论了检测结果在预后判断方面的价值。"},{"en":"They needed more data before making any prognostical statements.","zh":"在做出任何预后性判断之前，他们还需要更多数据。"}]}],"synonyms":["prognostic","predictive","foretelling","prophetic","indicative"],"phonetic":"/ˌprɑɡˈnɑstɪkəl/","extraExplanation":["“prognostical”在现代英语里较少见，更常用的是“prognostic”或“predictive”。在文学或较正式的写作中你可能还会看到“prognostical”。","词源提示：来自希腊语词根“gnosis”（知识）相关，带有“凭迹象来判断/预言”的含义。"]}
{"word":"prognostically","summary":{"en":"“Prognostically” means “from the viewpoint of prognosis; as a predictor of future outcomes,” especially in medical contexts.","zh":"“prognostically”意为“从预后的角度；就预测未来结果而言”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to prognosis (a prediction about how an illness or situation will develop).","zh":"以预后（对疾病或情况发展结果的预测）相关的方式；从预后角度。"},"examples":[{"en":"Prognostically, early detection usually leads to better outcomes.","zh":"从预后角度看，早期发现通常会带来更好的结果。"},{"en":"The tumor is small and localized, which is prognostically favorable.","zh":"肿瘤较小且局限，这是预后上有利的。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to describe something as a predictor of future results (often in medicine or statistics).","zh":"（常用于医学或统计）作为预测未来结果的指标而言。"},"examples":[{"en":"Age can be prognostically important in this condition.","zh":"在这种病情中，年龄可能是预后上重要的因素。"},{"en":"This biomarker is prognostically useful for identifying high-risk patients.","zh":"这种生物标志物在预后上很有用，可用于识别高风险患者。"}]}],"synonyms":["in terms of prognosis","predictively","as a predictor","from a prognostic standpoint"],"phonetic":"/ˌprɑɡˈnɑs.tɪ.kli/","extraExplanation":["“prognostically”多见于医学论文、临床报告和统计研究中，语气偏正式。日常英语里通常会用更简单的说法替代，比如 “in terms of prognosis / for prognosis / as a predictor”。","词形来源：prognosis（预后、预测）→ prognostic（预后相关的；可预测的）→ prognostically（副词形式）。常见搭配：prognostically favorable/unfavorable（预后好/差）、prognostically significant（预后上显著）、prognostically important/useful（预后上重要/有用）。"]}
{"word":"prognosticate","summary":{"en":"Prognosticate means to predict the future, often in a formal, evidence-based, or expert-sounding way.","zh":"Prognosticate 指预测未来，语气通常更正式，常带“基于迹象/专业判断”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to predict what will happen in the future, especially by using signs, evidence, or expert judgment","zh":"预测（未来会发生什么），尤指根据迹象、证据或专业判断来推断"},"examples":[{"en":"It’s hard to prognosticate how the economy will look next year.","zh":"很难预测明年的经济会是什么样。"},{"en":"Doctors are careful not to prognosticate too confidently about recovery.","zh":"医生会谨慎，不会对康复情况做过于肯定的预测。"}]},{"partOfSpeech":"v.","definition":{"en":"to give a formal or public prediction (often in a serious or slightly old-fashioned style)","zh":"（以正式、公开的方式）预言/预测（语气常较严肃或略带书面、古雅）"},"examples":[{"en":"Commentators prognosticated a close election, but the result wasn’t even.","zh":"评论员预测选举会很胶着，但结果并不接近。"},{"en":"He loved to prognosticate at dinner parties about where technology was heading.","zh":"他喜欢在晚宴上预言科技的发展方向。"}]}],"synonyms":["predict","forecast","foretell","project"],"phonetic":"/prɑɡˈnɑstɪˌkeɪt/","extraExplanation":["词源提示：prognosticate 来自希腊语根 gnō- / gno-（“知道”），同源词有 diagnose（诊断）、prognosis（预后/预判）。因此它带有“根据已知信息作判断”的感觉，而不一定是“算命式”的预测。","语体/语感：比 predict 更正式、更书面；日常口语中通常用 predict/guess/forecast。prognosticate 有时也带一点“说得头头是道地预测”的调侃意味，取决于语境。","常见搭配：prognosticate about + 主题（prognosticate about the future）；it’s difficult/hard to prognosticate…（很难预测……）。"]}
{"word":"prognosticated","summary":{"en":"“Prognosticated” means “predicted/forecast,” often in a formal way.","zh":"“prognosticated”意为“预测/预言”，常带正式语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"predicted or forecast something that would happen in the future (often in a formal or academic tone)","zh":"（多为正式或学术语气）预测、预言未来会发生的事"},"examples":[{"en":"The economist prognosticated a recession if interest rates kept rising.","zh":"这位经济学家预测，如果利率继续上升，经济将会衰退。"},{"en":"Many critics prognosticated that the film would win awards.","zh":"许多影评人预测这部电影会获奖。"},{"en":"She prognosticated the outcome based on the data she had.","zh":"她根据现有数据预测了结果。"}]},{"partOfSpeech":"v.","definition":{"en":"(medical, formal) diagnosed the likely course or outcome of a disease; gave a prognosis","zh":"（医学/正式）判断疾病的可能发展与结局；给出预后判断"},"examples":[{"en":"The doctor prognosticated a full recovery after surgery.","zh":"医生判断手术后很可能会完全康复。"},{"en":"It was difficult to prognosticate the patient’s long-term outlook.","zh":"很难判断病人长期的预后情况。"}]}],"synonyms":["predicted","forecast","projected","foresaw","anticipated"],"phonetic":"/prɑɡˈnɑstəˌkeɪtɪd/","extraExplanation":["“prognosticated”是动词“prognosticate”的过去式/过去分词，语气比“predict”更正式，常见于新闻评论、学术写作、经济与政治分析等语境。","词源来自希腊语：pro-（在前）+ gnostikos（知道的），字面含义接近“提前知道”。因此它常暗示一种基于证据、专业判断或系统分析的预测，而不只是随口猜测。"]}
{"word":"prognosticates","summary":{"en":"“Prognosticates” means “predicts/forecasts,” usually in a formal tone.","zh":"“prognosticates”意为“预测/预报”，语气较正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to predict or forecast what will happen in the future, often based on clues or patterns (sometimes used humorously or critically for “guessing” with confidence)","zh":"（常根据线索或规律）预测、预报未来会发生什么；有时带调侃或批评意味，指“很有把握地猜测”"},"examples":[{"en":"Analysts prognosticate that interest rates will fall next year.","zh":"分析师预测明年利率会下降。"},{"en":"It’s too early to prognosticate about the election results.","zh":"现在就预测选举结果还为时过早。"},{"en":"He loves to prognosticate about the weather, but he’s often wrong.","zh":"他很爱预测天气，但经常不准。"}]}],"synonyms":["predict","forecast","project","anticipate","foretell"],"phonetic":"/prɑɡˈnɑs.təˌkeɪts/","extraExplanation":["“prognosticate”比较正式，常见于新闻、商业、政治评论等语境。日常口语里更常用“predict / forecast / guess”。","词源来自希腊语（pro- “在前” + gnostikos “有关知识/判断的”），核心感觉是“提前做出判断”。有时会隐含一种‘说得头头是道但未必准’的语气，取决于上下文。","常见搭配：prognosticate that + 从句；prognosticate about + 话题。"]}
{"word":"prognosticating","summary":{"en":"Prognosticating means predicting or forecasting future events, often in a formal or expert-sounding way.","zh":"prognosticating 指预测未来（常带正式或专家式语气）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making predictions about what will happen in the future, especially in a formal or “expert” way","zh":"对未来进行预测（尤指以正式或“专家”口吻进行的预测）"},"examples":[{"en":"Everyone was prognosticating about the election results all week.","zh":"大家一整周都在预测选举结果。"},{"en":"It’s hard to stop prognosticating when the economy feels uncertain.","zh":"当经济让人感到不确定时，很难不去预测接下来会怎样。"}]},{"partOfSpeech":"v.","definition":{"en":"forecasting how a situation will develop, often based on signs, data, or experience (common in medicine, business, and sports)","zh":"根据迹象、数据或经验来预判事态走向（常见于医学、商业、体育等语境）"},"examples":[{"en":"Doctors avoid prognosticating too early because recovery can surprise them.","zh":"医生通常避免过早下预后判断，因为康复情况可能出人意料。"},{"en":"Analysts are prognosticating slower growth next quarter.","zh":"分析师预测下个季度增长会放缓。"}]}],"synonyms":["predict","forecast","project","anticipate","speculate"],"phonetic":"/ˌprɑɡˈnɑstəˌkeɪtɪŋ/","extraExplanation":["“prognosticating”是动词“prognosticate”的现在分词/动名词形式，语气偏正式；在日常口语里更常用“predict / forecast / guess”。","词源上与“prognosis（预后、预测）”同源，来自希腊语，含“提前（pro-）知道（-gnosis）”的意思。","在英语里这个词有时带一点调侃意味：说某人“prognosticating”可能暗示他/她讲得很像专家、但未必真那么准。"]}
{"word":"prognostication","summary":{"en":"A formal word meaning a prediction about the future.","zh":"一个较正式的词，表示对未来的预测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prediction about what will happen in the future (often based on signs, patterns, or expert judgment)","zh":"对未来将发生之事的预测（常基于迹象、规律或专业判断）"},"examples":[{"en":"The economist’s prognostication suggested inflation would fall by summer.","zh":"那位经济学家的预测认为通货膨胀会在夏天前下降。"},{"en":"Weather prognostications aren’t always accurate, especially during storms.","zh":"天气预测并不总是准确，尤其在暴风雨期间。"}]}],"synonyms":["prediction","forecast","projection","prophecy"],"phonetic":"/prɑˌnɑstɪˈkeɪʃən/","extraExplanation":["“Prognostication”语气偏正式，常见于新闻、学术或评论文章。日常口语更常用 prediction / forecast / guess。","词源来自希腊语：pro-（在前）+ gignōskein（知道），字面有“预先知道”的意思。","带一点“占卜/预言”的色彩时，可用于强调预测的不确定或带神秘感；更中性时则接近“基于数据/经验的判断”。"]}
{"word":"prognostications","summary":{"en":"“Prognostications” means formal predictions about the future.","zh":"“prognostications”表示较正式的“对未来的预测/预报”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"predictions or forecasts about what will happen in the future, often based on signs, trends, or expert judgment","zh":"（对未来的）预测；预报（常基于迹象、趋势或专家判断）"},"examples":[{"en":"The economist’s prognostications about inflation turned out to be accurate.","zh":"这位经济学家对通货膨胀的预测后来被证明很准确。"},{"en":"Despite gloomy prognostications, the company reported strong sales.","zh":"尽管有悲观的预测，公司仍公布了强劲的销售额。"},{"en":"His prognostications were more hope than evidence.","zh":"他的预测更多是希望，而不是证据。"}]}],"synonyms":["predictions","forecasts","projections","outlooks","prophecies"],"phonetic":"/prɑɡˌnɑstɪˈkeɪʃənz/","extraExplanation":["“prognostications”是复数形式，单数是“prognostication”。更常见、更日常的说法是“prediction / forecast”。“prognostication”语气更正式，常见于新闻、学术评论、政治分析等语境。","词源上与希腊语有关，含有“预先知道/判断”的意思。它有时带一点“郑重其事的预言式判断”的感觉，但通常仍指基于信息做出的预测，而不一定是神秘的预言。","近义词：predictions, forecasts, projections, outlooks。常见搭配：make prognostications about…, gloomy/optimistic prognostications。文学/修辞中也会用来强调“预言式口吻”，例如评论家对社会走向的“prognostications”。"]}
{"word":"prognosticative","summary":{"en":"“Prognosticative” means “predictive; indicating what is likely to happen,” often in formal or medical contexts.","zh":"“prognosticative”意为“具有预测/预示作用的”，常用于较正式或医学（预后）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Predicting or suggesting what will happen in the future; prognostic.","zh":"预示未来的；预后的；带有预测意味的。"},"examples":[{"en":"The doctor’s report was cautiously prognosticative about the patient’s recovery.","zh":"医生的报告对病人的康复持谨慎的预后判断。"},{"en":"Dark clouds can be prognosticative of a storm, but they don’t guarantee it.","zh":"乌云可能预示暴风雨，但并不一定就会发生。"},{"en":"Her early comments were prognosticative of the team’s later success.","zh":"她早期的评论预示了团队后来的成功。"}]}],"synonyms":["prognostic","predictive","foretelling","portentous"],"phonetic":"/prɑɡˈnɑstɪkətɪv/","extraExplanation":["“prognosticative”很少见，日常英语里更常用 prognostic 或 predictive。它常出现在医学语境（如 prognosis/预后）或较正式的写作中。","词根来自希腊语：pro-（在前）+ gnost-（知道）。同源词包括 prognosis（预后/预测）与 prognosticate（预测，动词）。"]}
{"word":"prognosticator","summary":{"en":"A prognosticator is a person who predicts the future, often used in formal writing or media commentary, sometimes with a slightly humorous or critical tone.","zh":"prognosticator 指“预测未来的人”，多见于较正式或媒体评论语境，有时带轻微调侃或批评语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who predicts what will happen in the future (often based on signs, trends, or analysis)","zh":"预言者；预测者（常根据迹象、趋势或分析来推测未来）"},"examples":[{"en":"Political prognosticators predict a close election this year.","zh":"政治预测人士预测今年的选举会很胶着。"},{"en":"In the novel, a village prognosticator warns of a harsh winter.","zh":"在小说里，一位村里的预言者警告说冬天会很严酷。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who makes predictions, sometimes in an overly confident or showy way (often used with mild humor or criticism)","zh":"（常带调侃或批评）爱预测的人；自信满满的“预言家”"},"examples":[{"en":"Every sports prognosticator on TV had a different winner.","zh":"电视上的每个体育“预言家”都预测了不同的赢家。"},{"en":"Don’t be a prognosticator—wait for the facts.","zh":"别急着当“预测家”——等事实出来再说。"}]}],"synonyms":["predictor","forecaster","seer","prophet","soothsayer"],"phonetic":"/proʊˈnɑːstɪˌkeɪtɚ/","extraExplanation":["词源：来自拉丁语 *prognosticare*（预先知道、预告）与 *prognostic*（预兆、预测）同源。","语体与语感：*prognosticator* 偏正式、书面，也常见于媒体评论（政治、经济、体育）中；有时带一点“评论员爱乱猜”的轻微讽刺意味。","相关词对比：*predictor* 更中性常用；*forecaster* 多用于天气/经济等较专业的“预测”；*seer* 更偏神秘、宗教或文学语境。"]}
{"word":"prognosticators","summary":{"en":"Prognosticators are people who make predictions about the future, especially in public commentary like politics, business, or sports.","zh":"prognosticators 指做未来预测的人，常见于政治、商业、体育等公共评论语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who predict or forecast what will happen in the future, often based on signs, trends, or expertise.","zh":"预言者；预测者：根据迹象、趋势或专业判断来预测未来会发生什么的人。"},"examples":[{"en":"Political prognosticators expected a close election.","zh":"政治预测人士预计这会是一场势均力敌的选举。"},{"en":"Sports prognosticators picked the home team to win this weekend.","zh":"体育评论预测者认为本周末主队会赢。"}]}],"synonyms":["forecasters","predictors","pundits"],"phonetic":"/pɹɑɡˈnɑstɪˌkeɪtɚz/","extraExplanation":["prognosticator 语气常见于新闻与评论（政治、经济、体育等），带一点“自称能预测/喜欢预测”的意味，既可中性（专家分析），也可略带调侃（预测未必准）。","词源上与希腊语前缀 pro-（“在前、预先”）和 gnosis（“知识”）有关，因此有“凭知识做预判”的感觉。","常见近义说法：forecaster（更中性、常用于天气/数据预测）、predictor（泛指预测者）、pundit（评论员/专家，常参与预测）。"]}
{"word":"prognosticatory","summary":{"en":"Formal adjective meaning “predictive,” especially about prognosis (how something will turn out).","zh":"正式用语的形容词，意为“预测性的”，尤指“预后/结果走向的判断”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to making predictions about what will happen in the future, especially about how a situation (often an illness) will develop.","zh":"与对未来结果作出预测有关的，尤指对病情或事态发展作出预后/预判的。"},"examples":[{"en":"The doctor used prognosticatory signs to estimate the patient’s recovery time.","zh":"医生利用一些预后征象来估计病人的恢复时间。"},{"en":"The report’s prognosticatory language suggested the economy might slow down.","zh":"报告中带有预测性的措辞暗示经济可能会放缓。"}]}],"synonyms":["predictive","prognostic","foretelling","forecasting"],"phonetic":"/prɑɡˈnɑstɪkəˌtɔri/","extraExplanation":["这个词比较少见、偏正式，多见于医学（prognosis“预后”）或评论写作中。日常英语更常用 predictive / forecasting / prognostic。","词形结构：prognosticatory 来自 prognostic（预后/预测的）+ -atory（表示“与……有关的、起……作用的”形容词后缀）。"]}
{"word":"prognostics","summary":{"en":"“Prognostics” means evidence-based predictions about future outcomes, especially a disease’s likely course.","zh":"“prognostics”指基于迹象与证据对未来结果的预测，尤指疾病的预后走向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Information or signs used to predict how an illness or situation will develop in the future; a forecast based on evidence.","zh":"用于预测疾病或情况未来发展（结局、走向）的信息或迹象；基于证据的预判。"},"examples":[{"en":"The doctor reviewed the patient’s test results to discuss the prognostics.","zh":"医生查看了病人的检查结果，以讨论预后判断。"},{"en":"Early sales numbers are useful prognostics for how the product will perform.","zh":"早期销量数据是预测产品表现的有用指标。"}]},{"partOfSpeech":"n.","definition":{"en":"The field or practice of making such predictions, especially in medicine (often used as “prognosis” in modern English).","zh":"进行此类预测的领域或做法，尤指医学中的预后判断（现代英语中更常用“prognosis”）。"},"examples":[{"en":"In oncology, prognostics helps guide treatment choices.","zh":"在肿瘤学中，预后评估有助于指导治疗选择。"},{"en":"The course included basic prognostics and risk assessment.","zh":"这门课程包含基础预后判断与风险评估。"}]}],"synonyms":["prognosis","forecast","prediction","outlook","projection"],"phonetic":"/ˌprɑɡˈnɑstɪks/","extraExplanation":["“prognostics”来自希腊语词根：pro-（在前）+ gignōskein（知道、认识），字面意思是“预先知道”。","在医学语境里更常见的搭配是：a good/poor prognosis（预后好/差）、prognostic factors（预后因素）、prognostic marker（预后标志物）。日常英语里，“prognostics”相对书面、偏专业。"]}
{"word":"progoneate","summary":{"en":"“progoneate” isn’t a standard word; you probably mean “prognosticate” = to predict or forecast.","zh":"“progoneate”不是标准单词；你可能想写“prognosticate”，意思是“预测/预报”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“progoneate” is not a standard English word; it is most likely a misspelling of “prognosticate.”","zh":"“progoneate”不是标准英语单词；很可能是把“prognosticate”拼错了。"},"examples":[{"en":"I couldn’t find “progoneate” in a dictionary—did you mean “prognosticate”?","zh":"我在词典里找不到“progoneate”——你是不是想写“prognosticate”？"},{"en":"If you meant “prognosticate,” it means to predict something will happen.","zh":"如果你想写的是“prognosticate”，它的意思是“预测将会发生某事”。"}]},{"partOfSpeech":"v.","definition":{"en":"(prognosticate) to predict or forecast what will happen in the future, often using signs, evidence, or expert judgment.","zh":"（prognosticate）预测、预报未来会发生什么，常基于迹象、证据或专业判断。"},"examples":[{"en":"Experts prognosticate that prices will rise next year.","zh":"专家预测明年价格会上涨。"},{"en":"It’s hard to prognosticate the outcome of the election this early.","zh":"这么早很难预测选举结果。"},{"en":"She tried to prognosticate his mood from his tone of voice.","zh":"她试图从他的语气推测他的情绪。"}]}],"synonyms":["predict","forecast","foretell","project","estimate"],"phonetic":"/prɑɡˈnɑstɪkeɪt/","extraExplanation":["“prognosticate”较正式，常见于新闻、学术或商业语境；日常口语更常用“predict / forecast / guess”。","词源上与希腊语“gnosis（知识）”有关，所以带有“根据知识/迹象来判断”的感觉。"]}
{"word":"progospel","summary":{"en":"“Progospel” (more commonly “pro-gospel”) means supportive of or promoting the Christian gospel or gospel music.","zh":"“Progospel”（更常写作“pro-gospel”）指支持或推广基督教福音或福音音乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or promoting the Christian gospel (the teachings about Jesus) or gospel music","zh":"支持或推广基督教“福音”（关于耶稣的教义）或福音音乐的"},"examples":[{"en":"The station has a pro-gospel lineup on Sunday mornings.","zh":"这家电台周日早上安排的是偏福音风格的节目。"},{"en":"Her pro-gospel message focuses on hope and forgiveness.","zh":"她偏向福音的讯息强调希望与宽恕。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or approach that actively promotes the gospel (rare)","zh":"积极推广福音的人、团体或做法（较少见）"},"examples":[{"en":"Some critics called the group a pro-gospel movement.","zh":"一些评论者称这个团体为“亲福音”的运动。"}]}],"synonyms":["pro-Christian","evangelical (context-dependent)","gospel-centered"],"phonetic":"/ˌproʊˈɡɑspəl/","extraExplanation":["“progospel”更常见的写法是“pro-gospel”（带连字符），表示“亲……、支持……”的立场。单写成一个词时，常见于账号名、品牌名或网名。","这里的“gospel”可以指宗教意义上的“福音”，也可以指“福音音乐（gospel music）”。具体含义通常要看语境（电台、合唱团、音乐节多指音乐；教会宣讲、信仰讨论多指宗教信息）。"]}
{"word":"progovernment","summary":{"en":"Pro-government means supporting a government or those in power.","zh":"pro-government 指“支持政府或执政者的；亲政府的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a government, its policies, or the people in power (often used in politics and news).","zh":"支持政府、其政策或执政者的（常用于政治与新闻语境）。"},"examples":[{"en":"The newspaper is widely seen as pro-government.","zh":"这家报纸被普遍认为是亲政府的。"},{"en":"Pro-government groups organized a rally in the capital.","zh":"亲政府团体在首都组织了一场集会。"},{"en":"He gave a pro-government speech before the election.","zh":"他在选举前发表了一篇支持政府的演讲。"}]}],"synonyms":["government-supporting","pro-regime","regime-friendly","pro-establishment"],"phonetic":"ˌproʊˈɡʌvərnmənt","extraExplanation":["“pro-”作前缀表示“支持、赞成”，常见搭配还有 pro-democracy（亲民主的）、pro-business（亲商的）、pro-choice（支持女性堕胎选择权的）。","写法上常见为 pro-government（更规范、清晰），也有人写成 progovernment；作定语时通常加连字符更易读：a pro-government stance（亲政府立场）。","语气与立场：该词多用于描述政治立场，通常偏中性，但在高度对立的语境中可能带有批评或指责意味，具体取决于说话者立场与上下文。"]}
{"word":"prograde","summary":{"en":"Prograde means moving forward in the usual direction of rotation or orbit (opposite of retrograde).","zh":"prograde 指（天文中）沿常规的自转/公转方向“顺行”（与 retrograde 逆行相对）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Moving forward in the same direction as the normal or primary rotation or orbit (the opposite of retrograde).","zh":"（天文）顺行的；与主要自转或公转方向一致的（反义：retrograde 逆行）。"},"examples":[{"en":"Most planets in our solar system orbit the Sun in a prograde direction.","zh":"太阳系中大多数行星绕太阳公转都是顺行方向。"},{"en":"The moon’s prograde motion is easier to describe once you know the reference direction.","zh":"一旦你明确了参考方向，月球的顺行运动就更容易描述。"}]},{"partOfSpeech":"v.","definition":{"en":"To move in a prograde direction; to advance forward (used mainly in technical or scientific writing).","zh":"（较少用，偏技术/科学）顺行；向前推进。"},"examples":[{"en":"In the simulation, the satellite progrades along its planned orbit.","zh":"在模拟中，卫星沿着预定轨道顺行运行。"}]}],"synonyms":["direct","forward-moving","progressive (in motion context)"],"phonetic":"/ˈproʊˌɡreɪd/","extraExplanation":["“pro-”表示“向前/支持”，“-grade”与“走/步伐/移动”有关（同源于表示“行走、步伐”的词根）。因此 prograde 字面上有“向前走”的感觉。","天文学里“顺行/逆行”一定要先说明参照系：通常以从太阳北极上方看、与大多数行星绕日公转一致的方向为“顺行”。同一个运动在不同参照系下可能被描述不同。","在占星语境里也常见 prograde（行星顺行）与 retrograde（行星逆行）。占星中的“逆行”是从地球视角看到的视运动，并不代表行星真的倒着绕太阳转。"]}
{"word":"program","summary":{"en":"Program most commonly means a planned series of activities (a program) or computer software; as a verb, it means to code or schedule.","zh":"program 常指“项目/计划”或“计算机程序”；作动词时可表示“编程”或“编排/安排日程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of instructions or a plan designed to achieve a result; often a scheduled series of activities.","zh":"为达成某个结果而制定的一套指令或计划；也常指安排好的活动/项目流程。"},"examples":[{"en":"The museum offers an education program for children every summer.","zh":"博物馆每年夏天都会为孩子们提供一个教育项目。"},{"en":"Our fitness program includes running, stretching, and strength training.","zh":"我们的健身计划包括跑步、拉伸和力量训练。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of coded instructions that a computer follows to perform tasks; a piece of software.","zh":"让计算机执行任务的一组编码指令；程序/软件。"},"examples":[{"en":"I installed a program to edit photos.","zh":"我安装了一个用于编辑照片的程序。"},{"en":"This program runs automatically every night.","zh":"这个程序每晚都会自动运行。"}]},{"partOfSpeech":"v.","definition":{"en":"To give instructions to a computer or machine by writing code or setting controls.","zh":"通过编写代码或设置控制来给计算机或机器下达指令；编程。"},"examples":[{"en":"She learned to program in Python.","zh":"她学会了用 Python 编程。"},{"en":"We need to program the robot to avoid obstacles.","zh":"我们需要给机器人编程，让它避开障碍物。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan or arrange events, activities, or broadcasts (such as TV shows) in a schedule.","zh":"为活动或播出内容（如电视节目）做安排与排期；编排。"},"examples":[{"en":"The channel programs movies on weekends.","zh":"这个频道把电影安排在周末播出。"}]}],"synonyms":["plan","schedule","project","software","application (app)","code"],"phonetic":"/ˈproʊ.ɡræm/","extraExplanation":["美式英语中更常见拼写是 program；英式英语通常写作 programme（尤其指“活动/项目/电视节目单”时）。在计算机语境下，英式也常用 program。","program 既可以指“长期项目/计划”（education program），也可以指“计算机程序”。根据上下文判断最自然。","常见搭配：a training/education program（培训/教育项目）、a computer program（计算机程序）、program a device（给设备设定/编程）、TV program（电视节目）。"]}
{"word":"programable","summary":{"en":"Programmable means able to be set or controlled by instructions, especially for devices and computers.","zh":"Programmable 指“可编程的”，即可通过指令预先设定或控制（多用于设备与计算机）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be programmed or controlled by giving it instructions (especially a device or computer system).","zh":"可编程的；可通过输入指令来设定或控制的（尤指设备或计算机系统）。"},"examples":[{"en":"This thermostat is programmable, so it can lower the temperature at night.","zh":"这个恒温器是可编程的，所以它能在夜间自动把温度调低。"},{"en":"Many robots are programmable to perform different tasks.","zh":"许多机器人是可编程的，可以执行不同的任务。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be planned or arranged in advance in a fixed way (less common).","zh":"可预先设定的；可按固定方式提前安排的（较少见）。"},"examples":[{"en":"The lights follow a programmable schedule.","zh":"这些灯按可预设的时间表运行。"}]}],"synonyms":["configurable","customizable","automated","computer-controlled"],"phonetic":"/ˈproʊɡræməbəl/","extraExplanation":["你输入的 **programable** 通常被认为是拼写错误；标准拼写是 **programmable**（中间双写 m）。","词源上来自 **program + -able**（“可以……的”）。英语里类似构词在拼写上常出现辅音双写（如 *run → runnable*）。","英式英语中有时会看到 **programme**（名词：节目/方案），但动词一般仍写作 **program**；而“可编程的”通常写 **programmable**。"]}
{"word":"programatic","summary":{"en":"“Programmatic” means related to a program or clearly planned agenda; in marketing it often means automated, data-driven ad buying.","zh":"“Programmatic（常见误拼 programatic）”指与方案/计划有关、具有明确规划的；在营销领域常指数据驱动的自动化“程序化广告投放”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “programmatic”) Related to a program, plan, or set of organized actions—often meaning “based on a clear plan or agenda.”","zh":"（常见拼写为 programmatic）与“计划/方案/项目”有关的；有明确规划或纲领性的。"},"examples":[{"en":"The new policy is programmatic: it lays out steps, timelines, and goals.","zh":"新政策具有纲领性：它列出了步骤、时间表和目标。"},{"en":"We need a programmatic approach to improve public health, not one-off actions.","zh":"我们需要一个有系统规划的方法来改善公共健康，而不是零散的一次性行动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In advertising/tech) Using software and data to automatically buy, place, or manage ads or other media in real time.","zh":"（广告/科技）指用软件和数据自动化、实时地购买、投放或管理广告/媒体资源的。"},"examples":[{"en":"They shifted more budget to programmatic advertising to reach the right audience.","zh":"他们把更多预算转向程序化广告，以触达合适的受众。"},{"en":"Programmatic bidding can adjust prices automatically based on performance.","zh":"程序化竞价可以根据效果自动调整价格。"}]}],"synonyms":["planned","systematic","strategic","agenda-driven","automated (in ad tech)"],"phonetic":"/ˌproʊɡrəˈmætɪk/","extraExplanation":["你写的 **programatic** 少了一个 **m**；标准拼写是 **programmatic**。在商务和公共政策语境里，programmatic 常指“有明确计划和框架的”；在营销行业里则常直接指“程序化广告（programmatic advertising）”。","词源上它来自 **program**（计划/程序）+ **-matic**（表示“与……有关/具有……性质”），所以核心感觉是“按一套既定程序或计划来做事”。"]}
{"word":"programed","summary":{"en":"“Programed” means “programmed” (past tense/participle of program); “programmed” is the more common spelling.","zh":"“programed”表示“program”的过去式/过去分词，但更常见、更推荐的拼写是“programmed”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “program” (to write computer instructions or to plan/schedule something).","zh":"“program”的过去式和过去分词（指编写计算机程序，或规划/安排活动）。"},"examples":[{"en":"She programed the robot to follow a line on the floor.","zh":"她给机器人编程，让它沿着地上的线行走。"},{"en":"The conference was programed to start at 9 a.m.","zh":"会议被安排在上午9点开始。"}]}],"synonyms":["programmed","coded","scheduled","planned"],"phonetic":"ˈproʊɡræmd","extraExplanation":["在美式英语中，作动词时的过去式/过去分词通常写作 **programmed**（双写 m），这是更常见、更被广泛接受的拼写。**programed** 也能见到，尤其在较老的文本或个别风格指南中，但在正式写作、学术或职场邮件里建议优先用 **programmed**。","如果你想表达“预先设定的/被设定好的”（像机器或人的反应），也常用过去分词作形容词：**a programmed response**（预设反应）。"]}
{"word":"programein","summary":{"en":"A program is a planned schedule of activities or a computer software application; to program means to plan/set something or write code.","zh":"program 可指活动安排/节目单或计算机程序；作动词时表示安排/设定，或编程写代码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a planned set of activities or events; also a list of items in a show or meeting","zh":"一套计划好的活动/事件；也可指演出或会议的“节目单/议程表”"},"examples":[{"en":"What’s the program for today’s meeting?","zh":"今天会议的议程是什么？"},{"en":"The festival program includes music, food, and games.","zh":"节日活动安排包括音乐、美食和游戏。"}]},{"partOfSpeech":"n.","definition":{"en":"a set of instructions that a computer follows (software)","zh":"（计算机）程序；软件指令集"},"examples":[{"en":"I installed a new program to edit photos.","zh":"我安装了一个新的照片编辑软件。"},{"en":"This program runs faster on a newer computer.","zh":"这个程序在较新的电脑上运行更快。"}]},{"partOfSpeech":"vt.","definition":{"en":"to plan or arrange something carefully","zh":"安排；规划；预设"},"examples":[{"en":"We programmed the lights to turn off at midnight.","zh":"我们把灯设置成午夜自动关闭。"},{"en":"The museum programmed special events for the holiday.","zh":"博物馆为假期安排了特别活动。"}]},{"partOfSpeech":"v.","definition":{"en":"to write computer code; to create software","zh":"编程；写代码；开发软件"},"examples":[{"en":"She programs for a living.","zh":"她靠编程谋生。"},{"en":"I’m learning to program in Python.","zh":"我正在学习用 Python 编程。"}]}],"synonyms":["plan","schedule","agenda","software","application","code"],"phonetic":"/ˈproʊɡræm/","extraExplanation":["你输入的“programein”看起来像是拼写错误，最接近的常见表达是 **program**（名词/动词）或短语 **program in + 语言**（用某种语言编程，如 program in Python）。","英式英语常见拼写是 **programme**（多用于“节目单/活动安排”），美式英语通常统一写 **program**（无论是“活动安排”还是“计算机程序”）。"]}
{"word":"programer","summary":{"en":"A programmer is someone who writes and works on computer software.","zh":"programmer 指编写并维护计算机软件的人（程序员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes, tests, and maintains computer programs (software).","zh":"程序员；编程人员：编写、测试并维护计算机程序（软件）的人。"},"examples":[{"en":"She is a programmer at a startup.","zh":"她是一家初创公司的程序员。"},{"en":"Good programmers write clear code and fix bugs quickly.","zh":"优秀的程序员会写出清晰的代码，并能快速修复漏洞。"},{"en":"He learned Python and became a programmer.","zh":"他学习了 Python，成为了一名程序员。"}]}],"synonyms":["coder","developer","software engineer"],"phonetic":"/ˈproʊɡræmər/","extraExplanation":["你输入的 **programer** 常见为拼写错误；标准拼写是 **programmer**（中间有两个 m）。","在美式英语中更常用 **programmer**；而 **coder / developer / software engineer** 各有侧重点：coder 偏“写代码”，developer 偏“开发产品/功能”，software engineer 偏“工程化设计与系统思维”。"]}
{"word":"programers","summary":{"en":"“Programmers” means people who write software.","zh":"“programmers”指编写软件的程序员（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of programmer) People who write, test, and maintain computer programs (software).","zh":"（programmer 的复数）程序员：编写、测试并维护计算机程序（软件）的人。"},"examples":[{"en":"The programmers fixed the bug before the product launch.","zh":"程序员们在产品发布前修复了这个漏洞。"},{"en":"Our team needs programmers who know Python.","zh":"我们的团队需要会 Python 的程序员。"}]}],"synonyms":["software developers","coders","developers","software engineers"],"phonetic":"/ˈproʊɡræmər/","extraExplanation":["“programers”通常是拼写错误，正确拼写是“programmers”（中间要有双写 mm）。因为“program + -er”构成“programmer”，按照英语拼写习惯会双写 m。","英式英语里“programme”常指“电视节目/活动安排”，但“computer program/programmer”在美式和英式中都通常写作 program/programmer。"]}
{"word":"programing","summary":{"en":"Programming most often means writing computer code; it can also mean TV/radio show scheduling.","zh":"Programming 最常指“编程/写代码”，也可指“电视/广播的节目编排”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or skill of writing instructions (code) that a computer can run; software development","zh":"编程；写代码（为计算机编写可运行的指令）；软件开发"},"examples":[{"en":"She is learning programming to build simple apps.","zh":"她正在学习编程来开发简单的应用。"},{"en":"Good programming helps a team avoid bugs and save time.","zh":"好的编程能帮助团队减少漏洞并节省时间。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of planned TV/radio shows or events offered by a channel or organization","zh":"（电视/广播的）节目编排；节目内容"},"examples":[{"en":"Weekend programming includes movies and sports.","zh":"周末的节目编排包括电影和体育赛事。"},{"en":"The station changed its programming to attract younger listeners.","zh":"该电台调整了节目内容以吸引更年轻的听众。"}]}],"synonyms":["coding","software development","computer programming","TV scheduling","broadcast programming"],"phonetic":"/ˈproʊɡræmɪŋ/","extraExplanation":["你写的 **programing** 通常是拼写错误；更常见的正确拼写是 **programming**（中间有两个 m）。在美式英语中，动词 **program** 加 -ing 通常写作 **programming**。","英式英语中有时会看到名词 **programme**（“节目/计划”），但在“编程（写代码）”这个意思上，一般仍用 **program/programming**。"]}
{"word":"programist","summary":{"en":"“Programist” is usually a misspelling; the common word is “programmer,” meaning someone who writes software (and less commonly, someone who schedules programs for TV/radio/events).","zh":"“programist”通常是拼写错误；常用词是“programmer”，主要指软件开发/写程序的人（较少也指电视/广播/活动的节目编排者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes computer programs (software).","zh":"程序员；编写计算机程序（软件）的人。"},"examples":[{"en":"She works as a programmer at a game company.","zh":"她在一家游戏公司做程序员。"},{"en":"The programmer fixed the bug in the app.","zh":"程序员修复了这个应用里的漏洞。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who plans or schedules programs, especially for TV, radio, or events.","zh":"（电视/广播/活动的）节目编排者；策划与安排节目的人。"},"examples":[{"en":"The festival programmer chose films from around the world.","zh":"电影节的策展/编排人员挑选了来自世界各地的影片。"}]}],"synonyms":["coder","software developer","software engineer"],"phonetic":"/ˈproʊɡræmər/","extraExplanation":["“programist”通常被认为是拼写错误。更常用的标准拼写是“programmer”（美式、最常见）或“programmer/programmist”（其中“programmist”较少见，偏英式/较旧用法）。","在日常英语里，说“a programmer”通常默认指“写软件的人”。如果指“节目编排者”，常出现在媒体或活动语境中，如“festival programmer”。"]}
{"word":"programistic","summary":{"en":"Programistic means “related to a program or set plan,” especially a political or organizational platform; it’s rare, and programmatic is more common.","zh":"programistic 指“与方案/计划有关，尤其是政纲或组织规划”，但该词较少见，更常用的是 programmatic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a program (a planned set of actions), especially in politics or organizations; setting out goals and methods.","zh":"与“方案/计划”（一套预定行动）有关的，尤指政治或组织层面；阐明目标与方法的。"},"examples":[{"en":"The candidate gave a programistic speech focused on education reform.","zh":"这位候选人发表了一场“纲领性”的演讲，重点谈教育改革。"},{"en":"Their programistic platform promised lower taxes and better public services.","zh":"他们的纲领/政纲承诺减税并改善公共服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) In a computing context, relating to computer programs; similar to “programmatic.”","zh":"（较少见）在计算机语境中：与程序有关的；类似 programmatic（程序化的）。"},"examples":[{"en":"We need a programistic way to generate these reports automatically.","zh":"我们需要一种“程序化”的方式来自动生成这些报告。"}]}],"synonyms":["programmatic","program-based","policy-oriented","systematic"],"phonetic":"/ˌproʊɡrəˈmɪstɪk/","extraExplanation":["“programistic”在现代英语里非常少见，很多时候人们想表达的是更常用、更标准的形容词：**programmatic**（政纲性的；按程序/自动化的）或 **program-based**（基于项目/方案的）。在写作或考试中，建议优先用 programmatic。","在政治语境里，programmatic 常指“有明确政策纲领与执行路径”，区别于空泛的口号式表达。"]}
{"word":"programma","summary":{"en":"“Program” means a plan/schedule of activities or a computer application; as a verb, it means to plan or to code.","zh":"“Program”指活动计划/安排或计算机程序；作动词指安排规划或编程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US) a plan of activities or events; (also) a set of instructions a computer follows to do a task.","zh":"（美式）计划、活动安排；（也指）计算机程序（让电脑完成任务的一组指令）。"},"examples":[{"en":"The festival program includes music, food, and games.","zh":"节日活动安排包括音乐、美食和游戏。"},{"en":"I installed a new program to edit photos.","zh":"我安装了一个新的程序来编辑照片。"}]},{"partOfSpeech":"v.","definition":{"en":"to plan or organize something; to write code that tells a computer what to do.","zh":"规划或安排某事；编写程序（写代码让电脑做事）。"},"examples":[{"en":"They program the training schedule for new employees.","zh":"他们为新员工安排培训日程。"},{"en":"She learned to program in Python.","zh":"她学会了用 Python 编程。"}]}],"synonyms":["plan","schedule","agenda","app","software","code"],"phonetic":"/ˈproʊɡræm/","extraExplanation":["“programma”常见于意大利语，意思接近英语的“program/programme”。如果你想查英语单词，最接近的是“program”（美式拼写）或“programme”（英式拼写，常用于“活动安排/电视节目表”；但在英式英语里“computer program”通常也写作“program”）。","发音方面，“program”的重音在前一音节：PRO-gram。"]}
{"word":"programmabilities","summary":{"en":"“Programmabilities” means multiple forms or degrees of programmability—how programmable different systems are.","zh":"“Programmabilities”指多种/不同程度的可编程性，用于比较不同系统“有多可编程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be programmed; the extent to which a device, system, or material can be controlled or customized by writing instructions (code)","zh":"可编程性；（设备、系统或材料）能被写入指令并被控制/定制的程度"},"examples":[{"en":"Modern robots are valued for their programmability, not just their strength.","zh":"现代机器人受重视的不只是力量，还有它们的可编程性。"},{"en":"The new controller improves programmability and reduces setup time.","zh":"新控制器提高了可编程性，并减少了设置时间。"}]},{"partOfSpeech":"n.","definition":{"en":"plural form of “programmability,” used when comparing or listing multiple kinds or degrees of programmability across different systems","zh":"“programmability（可编程性）”的复数；用于比较或列举不同系统的多种可编程性/不同层面的可编程程度"},"examples":[{"en":"The report compares the programmabilities of several microcontrollers.","zh":"这份报告比较了几款微控制器的可编程性差异。"},{"en":"Different programmabilities matter in different contexts, from education to industrial automation.","zh":"从教育到工业自动化，不同层面的可编程性在不同场景下都很重要。"}]}],"synonyms":["programmability","customizability","configurability","flexibility"],"phonetic":"/ˌproʊɡræməˈbɪlətiz/","extraExplanation":["“programmabilities”在日常英语里不算常见，因为“programmability”通常作为不可数名词使用。只有在学术、工程或对比分析中，才会用复数来强调“多种类型/多个维度的可编程性”（例如硬件可编程性、软件可编程性、接口层面的可编程性）。","相关常见搭配：high/low programmability（高/低可编程性），improve programmability（提升可编程性），degree/level of programmability（可编程程度）。"]}
{"word":"programmability","summary":{"en":"Programmability means how easily a system can be programmed or reprogrammed to perform different tasks.","zh":"Programmability 指系统被编程或重新编程以执行不同任务的容易程度与能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or ability of a system (especially hardware or software) to be programmed or easily reprogrammed to do different tasks.","zh":"（尤指硬件或软件系统的）可编程性；能够被编程或方便地重新编程以完成不同任务的特性。"},"examples":[{"en":"The programmability of modern chips lets one device run many different applications.","zh":"现代芯片的可编程性让一台设备能够运行许多不同的应用。"},{"en":"Engineers improved the robot’s programmability so it could switch tasks quickly.","zh":"工程师提升了机器人的可编程性，使它能快速切换任务。"}]}],"synonyms":["reprogrammability","flexibility","configurability"],"phonetic":"/ˌproʊˌɡræməˈbɪləti/","extraExplanation":["“programmability”常见于计算机科学与工程语境，强调“灵活性/可定制性”。在讨论芯片、网络设备、自动化系统时，经常与 scalability（可扩展性）、flexibility（灵活性）、configurability（可配置性）一起出现。","词形提示：program + -able（可……的）+ -ity（……性）→ “可编程的性质”。注意美式英语中常用拼写 program；英式有时写 programme，但在计算机领域通常也用 program。"]}
{"word":"programmable","summary":{"en":"Programmable means a device or system can be controlled or customized by writing or setting instructions (software).","zh":"Programmable 指设备或系统能通过编写或设定指令（软件）来控制或自定义功能。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be programmed (given instructions that control what it does), especially in a computer or electronic device.","zh":"可编程的；能被设定程序（用指令控制其运作）的，尤指电脑或电子设备。"},"examples":[{"en":"This thermostat is programmable, so you can set different temperatures for day and night.","zh":"这个恒温器是可编程的，所以你可以为白天和夜晚设置不同温度。"},{"en":"The robot has a programmable arm that can repeat the same movement precisely.","zh":"这台机器人有可编程的机械臂，可以精确重复同一个动作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed so its behavior can be changed by software rather than by rebuilding the hardware.","zh":"（设备/系统）可通过软件改变行为，而不必改造硬件的。"},"examples":[{"en":"Many modern cars have programmable features controlled through the dashboard software.","zh":"许多现代汽车有通过中控软件控制的可编程功能。"},{"en":"A programmable chip can be updated with new functions after it is installed.","zh":"可编程芯片在安装后还能更新加入新功能。"}]}],"synonyms":["configurable","customizable","software-controlled","user-programmable"],"phonetic":"/ˈproʊɡræməbl/","extraExplanation":["“programmable”来自“program + -able”。在日常英语里常见搭配有：programmable thermostat（可编程恒温器）、programmable robot（可编程机器人）、programmable logic controller/PLC（可编程逻辑控制器，工厂自动化常用）。","区分：programmable（可被设置/写程序控制）≠ automatic（自动的，不一定能让你自定义规则）。可编程强调“你可以设定规则/指令”。"]}
{"word":"programmar","summary":{"en":"“Programmar” is not standard English; you likely mean “programmer.”","zh":"“programmar”不是标准英文；你很可能想写“programmer（程序员）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; in modern English, you almost always mean “programmer” (a person who writes computer programs).","zh":"非标准拼写；现代英语中通常你想表达的是“programmer”（程序员，编写计算机程序的人）。"},"examples":[{"en":"I think “programmar” is a misspelling of “programmer.”","zh":"我觉得“programmar”是“programmer”的拼写错误。"},{"en":"She is a programmer who builds mobile apps.","zh":"她是一名开发手机应用的程序员。"}]}],"synonyms":["programmer","coder","software developer"],"phonetic":"/ˈproʊɡræmɚ/","extraExplanation":["“programmar”不是常见或标准的英文单词。最常见的正确词是：\n- programmer：程序员（人）\n- program：程序/编程（名词或动词，AmE 常用拼写；BrE 常见 programme 表示“节目/计划”）\n如果你告诉我你想表达“人”还是“程序/计划”，我可以给你更准确的词和用法。"]}
{"word":"programmata","summary":{"en":"Programmata is a rare, formal plural of program/programma; in modern English, “programs” is usually preferred.","zh":"Programmata是program/programma较少见、偏正式的复数；现代英语通常用“programs”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “programma/program,” meaning plans, schedules, or sets of instructions (especially in academic, formal, or historical contexts). In everyday English, “programs” is much more common.","zh":"“programma/program（计划/项目/程序）”的复数形式，指多个计划、日程或一组指令（多见于学术、正式或历史语境）。日常英语更常用“programs”。"},"examples":[{"en":"The conference materials listed several programmata for different research groups.","zh":"会议资料列出了不同研究小组的多个项目/安排。"},{"en":"In older academic writing, you may see programmata where modern English would use programs.","zh":"在较早的学术写作中，你可能会看到programmata，而现代英语通常写programs。"}]}],"synonyms":["programs","plans","schedules"],"phonetic":"ˌproʊɡrəˈmɑːtə","extraExplanation":["“programmata”源自希腊语/拉丁语传统的复数形式：单数常写programma（也可对应英语program），复数为programmata。现代英语里这种“古典复数”（像data、criteria那样）相对少见，尤其在美式英语中通常直接用programs。","如果你是在编程语境里看到它，有时作者是想显得更“古典/学术”，但一般不会影响理解：把它当作“多个programs”即可。"]}
{"word":"programmatic","summary":{"en":"Programmatic means related to a program or policy, driven by software, or (sometimes critically) done in a rigid, formulaic way.","zh":"Programmatic 可指与计划/纲领有关、由软件程序驱动，或（有时带批评）按固定套路机械执行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a program (a plan of activities) or to an official set of aims/policies (often in politics or organizations).","zh":"与“计划/项目”有关；或与组织、政党的纲领/政策主张有关（常用于政治或机构语境）。"},"examples":[{"en":"The candidate’s programmatic goals include improving public schools and reducing crime.","zh":"这位候选人的纲领性目标包括改善公立学校和降低犯罪率。"},{"en":"We need a programmatic approach to training, not random workshops.","zh":"我们需要对培训采取项目化/系统性的做法，而不是零散的讲座。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done by or controlled through a computer program; written for software systems (common in tech).","zh":"通过计算机程序完成或控制的；面向软件系统编写的（科技语境常用）。"},"examples":[{"en":"They made programmatic changes to the website using an API.","zh":"他们通过 API 对网站进行了程序化修改。"},{"en":"Programmatic advertising buys online ads automatically based on data.","zh":"程序化广告会基于数据自动购买线上广告位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often critical) Following a fixed “program” in a rigid or formulaic way; not flexible.","zh":"（常带批评）按固定“套路/程序”机械地执行；缺乏灵活性。"},"examples":[{"en":"His apology sounded programmatic rather than sincere.","zh":"他的道歉听起来像照本宣科，而不是真诚的。"},{"en":"The meeting became programmatic—everyone repeated the same points.","zh":"会议变得很程式化——大家反复说同样的观点。"}]}],"synonyms":["planned","systematic","policy-based","software-driven","automated","formulaic"],"phonetic":"/ˌproʊɡrəˈmætɪk/","extraExplanation":["“programmatic”在科技语境里常见于“programmatic advertising（程序化广告）”“programmatic access（程序化访问）”，强调“由系统按规则自动执行”，不一定表示“有计划”。","和“programmable”不同：programmable强调“可被编程/可设置”，programmatic更强调“由程序驱动/以项目或纲领为中心/按固定套路进行”。"]}
{"word":"programmatically","summary":{"en":"Programmatically means doing something through code or in a rule-based, systematic way.","zh":"programmatically 指通过代码自动完成，或以规则化、系统化的方式进行。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Using computer code or automated instructions rather than doing something by hand.","zh":"用程序代码或自动化指令来完成（而不是手工完成）。"},"examples":[{"en":"We programmatically generate the report every night.","zh":"我们每晚用程序自动生成报告。"},{"en":"The app programmatically checks for updates in the background.","zh":"这个应用会在后台用程序自动检查更新。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is systematic and follows a planned set of steps (often emphasizing an algorithmic or rule-based approach).","zh":"以系统化、按预先步骤进行的方式（常强调算法或规则驱动）。"},"examples":[{"en":"She programmatically reviewed each chapter using the same checklist.","zh":"她用一套固定清单按步骤系统地复习每一章。"},{"en":"The team programmatically evaluated all candidates with the same criteria.","zh":"团队用同一套标准有条理地评估所有候选人。"}]}],"synonyms":["automatically","by code","in code","systematically","algorithmically"],"phonetic":"/ˌproʊɡrəˈmætɪkli/","extraExplanation":["“programmatically”最常见于技术语境，意思是“通过写代码实现”。在日常语境里也可引申为“按既定流程、有条理地”。","词形拆解：program（程序/编程）+ -matic（……式的）+ -ally（副词）。因此它天然带有“按程序/按规则”的感觉。","搭配很常见：programmatically generate/create/update/access/modify/verify（用程序生成/创建/更新/访问/修改/验证）。"]}
{"word":"programmatist","summary":{"en":"A (rare) word for someone who insists on clear programs/plans and carries them out, especially in politics or organizations.","zh":"（较少见）指强调明确纲领/计划并推动落实的人，尤用于政治或组织语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who strongly favors clear programs, plans, or platforms (especially in politics or organizations) and focuses on carrying them out.","zh":"主张并坚持明确“纲领/计划/政纲”（尤指政治或组织层面），并强调执行的人。"},"examples":[{"en":"She’s a programmatist: she wants a written platform and measurable goals, not vague promises.","zh":"她是个“纲领派”：她要的是写清楚的政纲和可衡量的目标，而不是含糊的承诺。"},{"en":"The committee chose a programmatist to turn ideas into a workable plan.","zh":"委员会选了一位擅长按计划推进的人，把想法变成可执行的方案。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who prefers a systematic, structured approach to solving problems (rather than acting spontaneously).","zh":"做事偏向系统化、结构化解决问题（而非临时起意）的人。"},"examples":[{"en":"As a programmatist, he breaks big tasks into steps and deadlines.","zh":"作为一个做事很有章法的人，他会把大任务拆成步骤和截止日期。"},{"en":"Her programmatist style keeps the team organized during busy weeks.","zh":"她这种按计划推进的风格，让团队在忙碌的几周里保持有序。"}]}],"synonyms":["planner","policy-minded person","platform-focused person","systematic person"],"phonetic":"/ˈproʊɡrəˌmætɪst/","extraExplanation":["“programmatist”在现代英语中相对少见，更多时候人们会用更常见的词来表达类似含义：如在政治语境中用“policy-minded”（重政策的）、“platform-focused”（重政纲的）或“ideologue”（意识形态强的人，语气可能更负面）；在做事风格上用“planner”（规划者）、“systematic person”（做事有条理的人）。","注意不要把“programmatist”与“pragmatist（务实派）”混为一谈：pragmatist强调“什么有效就做什么”，而programmatist更强调“按既定纲领/方案推进”。"]}
{"word":"programme","summary":{"en":"“Programme” is the British spelling for a plan/schedule (events, TV) or an organized project; it can also mean a computer “program,” and as a verb it means to arrange or code.","zh":"“programme”是英式拼写，常指节目/日程安排或机构项目；也可指计算机程序；作动词表示安排或编程（美式多写 program）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A planned set of activities or events, often with a schedule (e.g., a TV/radio show schedule or an event plan).","zh":"（有安排的）活动/事件计划或节目表（如电视/广播节目、活动日程安排）。"},"examples":[{"en":"What’s on the programme tonight?","zh":"今晚的节目表有什么？"},{"en":"The concert programme lists the songs and performers.","zh":"音乐会节目单列出了曲目和表演者。"}]},{"partOfSpeech":"n.","definition":{"en":"A structured plan by an organization or government to achieve a goal (education, health, training, etc.).","zh":"（机构/政府为达成目标制定的）项目、计划（如教育、健康、培训等）。"},"examples":[{"en":"She joined a leadership development programme.","zh":"她参加了领导力发展项目。"},{"en":"The city launched a recycling programme.","zh":"这座城市启动了回收项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of instructions written for a computer to perform tasks (British spelling; in American English this is usually spelled “program”).","zh":"计算机程序（一套指令；英式拼写，常见的美式拼写为 program）。"},"examples":[{"en":"I wrote a small programme to organize the data.","zh":"我写了一个小程序来整理数据。"}]},{"partOfSpeech":"vt.","definition":{"en":"To plan or arrange a series of events or activities.","zh":"安排、规划（活动/事项）。"},"examples":[{"en":"The festival is programmed to run for three days.","zh":"该节日被安排为期三天。"}]},{"partOfSpeech":"v.","definition":{"en":"To write or set instructions for a computer; to code (British spelling; American spelling: “program”).","zh":"编程、写代码（英式拼写；美式拼写：program）。"},"examples":[{"en":"He learned to programme in Python.","zh":"他学会了用 Python 编程。"}]}],"synonyms":["program","schedule","plan","project","initiative"],"phonetic":"/ˈproʊ.ɡræm/","extraExplanation":["“programme”主要是英式拼写；美式英语中多数情况下写作“program”。在英国/英联邦国家：电视/活动用 programme；计算机也常用 programme（但在技术领域也常见 program）。在美国：几乎所有含义通常都写 program。","词源来自法语 programme，最终可追溯到希腊语 programma，含义与“公开写出来的通知/计划”有关。","常见搭配：a training programme（培训项目），a TV programme（电视节目），programme notes（节目单/演出说明），to be programmed to do something（被设定/被安排去做某事）。"]}
{"word":"programmed","summary":{"en":"“Programmed” usually means “coded/set with instructions” or “scheduled/planned in advance,” and it can also describe people as “conditioned” to act automatically.","zh":"“Programmed”常指“编程/设定指令”或“预先安排”；也可形容人“被条件化”而机械反应。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “program”: to write code for (a computer) or to design instructions for (a machine/system) to follow.","zh":"“program”的过去式/过去分词：为（电脑）编写程序；为（机器/系统）设定要执行的指令。"},"examples":[{"en":"She programmed the robot to pick up small objects.","zh":"她给机器人编程，让它能拾起小物体。"},{"en":"The app was programmed to send a reminder at 8 a.m.","zh":"这个应用被设定为早上8点发送提醒。"}]},{"partOfSpeech":"adj.","definition":{"en":"planned or scheduled in advance; arranged to happen at a certain time or in a certain way.","zh":"预先安排好的；按计划/按固定方式进行的。"},"examples":[{"en":"The lights turn off at midnight—it’s programmed.","zh":"灯会在午夜自动熄灭——这是预设好的。"},{"en":"The museum has programmed events every weekend.","zh":"博物馆每个周末都有安排好的活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person or mind) trained or conditioned to think or act in a particular way, often automatically.","zh":"（指人或思维）被训练/被“条件化”成某种固定反应（常带“机械化”或“被灌输”的意味）。"},"examples":[{"en":"He felt programmed to apologize even when he wasn’t wrong.","zh":"他觉得自己被“设定”成即使没错也会先道歉。"}]}],"synonyms":["coded","set","configured","scheduled","planned","prearranged","preset","conditioned"],"phonetic":"/ˈproʊɡræmd/","extraExplanation":["拼写提示：美式英语更常见 programmed（双写 m），也可见 programed（单写 m）但相对少；英式英语在动词形式中也常用 programmed。","语感提示：形容词 programmed 在科技语境里多指“预设/自动化”；在描述人时可能带一点批评色彩，暗示“像机器一样被操控或缺少独立思考”。"]}
{"word":"programmer","summary":{"en":"A programmer is someone who writes code to create or maintain software.","zh":"programmer 指编写代码来开发或维护软件的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes computer programs (code) to make software, apps, or systems work.","zh":"程序员；编写计算机程序（代码）来让软件、应用或系统运行的人。"},"examples":[{"en":"She is a programmer who builds mobile apps.","zh":"她是一名开发手机应用的程序员。"},{"en":"The programmer fixed the bug in the code.","zh":"程序员修复了代码里的漏洞（bug）。"},{"en":"Many programmers use Python because it is easy to learn.","zh":"很多程序员使用 Python，因为它比较容易学。"}]}],"synonyms":["coder","developer","software engineer"],"phonetic":"/ˈproʊɡræmər/","extraExplanation":["在日常英语里，programmer 通常指“写代码的人”。在职场上也常用更具体的称呼，比如 software engineer（软件工程师，范围可能更广，除了写代码还包括设计与协作）、developer（开发者，偏“开发产品/功能”）。","在一些语境中，programmer 也可以指“为某个活动安排节目的人”（例如电视台节目编排者），但现代口语里最常见的还是“程序员”。"]}
{"word":"programmers","summary":{"en":"“Programmers” usually means people who write software; it can also mean people who schedule/curate programs (TV, radio, festivals).","zh":"“programmers”通常指编写软件的程序员；也可指负责安排/策划节目或内容的人（如电视、广播、电影节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes computer programs (software) using code.","zh":"程序员；编写计算机程序（软件）的人。"},"examples":[{"en":"Many programmers use Python for data analysis.","zh":"很多程序员用 Python 做数据分析。"},{"en":"The company is hiring programmers to build a mobile app.","zh":"这家公司正在招聘程序员来开发手机应用。"}]},{"partOfSpeech":"n.","definition":{"en":"People who plan or organize a schedule of events or broadcasts (e.g., TV/radio programmers).","zh":"（电视/广播等的）节目编排人员；负责安排播出内容的人。"},"examples":[{"en":"The festival’s programmers selected films from around the world.","zh":"电影节的策展/编排人员从世界各地挑选影片。"},{"en":"TV programmers decided to move the show to a later time slot.","zh":"电视台的编排人员决定把这个节目调到更晚的时段。"}]}],"synonyms":["software developers","coders","developers","schedulers","curators"],"phonetic":"/ˈproʊɡræmərz/","extraExplanation":["“programmer”主要有两类常见用法：①软件开发领域的“程序员”；②媒体/活动领域负责“编排节目/内容的人”。在英语里，语境通常能帮助你判断是哪一种。","词形提示：programmer 是单数；programmers 是复数。英式拼写常见为 programme/programme r（用于“节目”义），而美式通常统一写作 program/programmer。"]}
{"word":"programmes","summary":{"en":"“Programmes” is the British plural of “programme,” meaning planned projects/activities, TV/radio shows, or (especially in BrE) computer programs.","zh":"“programmes”是英式英语中“programme”的复数，可指项目/活动计划、电视或广播节目，也可指（尤在英式用法中）计算机程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “programme” (British spelling): a planned series of events, activities, or actions designed to achieve a particular result.","zh":"“programme”的复数（英式拼写）：为实现某个目标而规划的一系列活动、步骤或行动。"},"examples":[{"en":"The school runs after‑school programmes for reading and sports.","zh":"这所学校开设课后阅读和体育项目。"},{"en":"The government introduced new programmes to support small businesses.","zh":"政府推出了新项目来扶持小企业。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “programme”: TV or radio shows, especially as items in a schedule.","zh":"“programme”的复数：电视或广播节目（也指节目表中的条目）。"},"examples":[{"en":"What programmes are on tonight?","zh":"今晚有什么节目？"},{"en":"I like documentaries, but I rarely watch live programmes.","zh":"我喜欢纪录片，但我很少看直播节目。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “programme”: (computing, especially in British English) software instructions that tell a computer what to do; programs.","zh":"“programme”的复数：（计算机领域，尤见于英式英语）让电脑执行任务的软件/程序；programs。"},"examples":[{"en":"Install the security updates before running other programmes.","zh":"运行其他程序之前先安装安全更新。"},{"en":"These programmes help students learn coding step by step.","zh":"这些程序帮助学生循序渐进地学习编程。"}]}],"synonyms":["programs","shows","broadcasts","projects","initiatives","schemes","software","applications"],"phonetic":"/ˈproʊɡræmz/","extraExplanation":["“programmes”是英式拼写；美式英语通常写作“programs”。在计算机语境里，美式几乎只用“programs”，而英式既可用“programmes”（较传统）也常用“programs”（越来越常见）。","注意区分：programme/program（名词：项目/节目/程序） vs. program (动词：为……编程、安排、设定)。"]}
{"word":"programming","summary":{"en":"Programming most commonly means writing computer code; it can also mean arranging TV/radio shows or event schedules.","zh":"Programming 最常见指“编程/写代码”；也可指“节目编排或活动日程安排”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or skill of writing instructions (code) that a computer can follow to perform tasks or solve problems","zh":"编程；写出计算机能执行的指令（代码），用来完成任务或解决问题的活动/技能"},"examples":[{"en":"She is learning programming to build her own app.","zh":"她正在学习编程，想自己做一个应用程序。"},{"en":"Programming requires patience and careful thinking.","zh":"编程需要耐心和严谨的思考。"},{"en":"In this class, we practice programming with Python.","zh":"在这门课里，我们用 Python 练习编程。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of planning or arranging what will happen (for example, on TV/radio or at an event)","zh":"（电视/广播/活动等的）节目编排；日程安排"},"examples":[{"en":"Tonight’s TV programming includes a documentary and a movie.","zh":"今晚的电视节目安排包括一部纪录片和一部电影。"},{"en":"The festival’s programming focuses on local music.","zh":"这个节庆的活动安排主要聚焦本地音乐。"}]}],"synonyms":["coding","software development","scheduling","programming schedule"],"phonetic":"/ˈproʊɡræmɪŋ/","extraExplanation":["“programming”最常见指“写代码”。它来自“program（程序/计划）+ -ing”，表示“正在进行的活动/过程”。在科技语境里，programming ≈ coding（写代码），但 programming 更强调“设计思路、结构与解决问题”，coding 更偏“把代码写出来”的动作。","在媒体与文化语境中，programming 也常指“节目编排/策展式安排”，比如 museum programming（博物馆教育活动安排）、community programming（社区活动安排）。"]}
{"word":"programmist","summary":{"en":"“Programmist” is a rare word meaning “programmer,” and it’s often treated as a nonstandard or regional alternative to “programmer.”","zh":"“programmist”是较少用的词，意思通常等同于“programmer（程序员）”，但在现代英语里常被视为非主流或带地区色彩的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who writes computer programs; a computer programmer.","zh":"（较少用）编写计算机程序的人；程序员。"},"examples":[{"en":"She works as a programm*ist* (more commonly, a programmer) at a game studio.","zh":"她在一家游戏工作室做programmist（更常见的说法是programmer，程序员）。"},{"en":"The job post says “programmists,” but most American companies would write “programmers.”","zh":"招聘信息写的是“programmists”，但大多数美国公司会写“programmers”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Broad/older use, rare) A person who plans or organizes programs (such as events or broadcasts).","zh":"（较宽泛/较旧的用法，少见）负责规划或组织“节目/项目”的人（如活动或广播节目）。"},"examples":[{"en":"In older contexts, a programm*ist* could mean someone who designs a radio program schedule.","zh":"在较旧的语境里，programm*ist*也可能指设计电台节目编排的人。"}]}],"synonyms":["programmer","software developer","coder"],"phonetic":"/ˈproʊɡræmɪst/","extraExplanation":["“programmist”在现代英语里比较少见，很多时候会被当作“programmer”的拼写错误。它在一些地区或受俄语/东欧英语影响的语境中更常出现（例如把“程序员”译作programmist）。","在美国英语里，日常与职场最自然的说法是“programmer”（程序员）或更具体的“software developer / software engineer”（软件开发者/软件工程师）。"]}
{"word":"programmng","summary":{"en":"Programming is writing computer code (and sometimes also means planning/scheduling events).","zh":"Programming主要指“编程/写代码”，有时也指“（节目或活动）编排与安排”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or job of writing computer programs (instructions that tell a computer what to do)","zh":"（计算机）编程；编写程序的活动或工作"},"examples":[{"en":"She is learning programming to build websites.","zh":"她正在学习编程来制作网站。"},{"en":"Programming takes practice and patience.","zh":"编程需要练习和耐心。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of setting or arranging something to happen in a planned way (e.g., scheduling)","zh":"（较少见）安排；设定（让某事按计划发生），如“节目编排/时间安排”"},"examples":[{"en":"The theater’s programming includes films and live talks.","zh":"这家剧院的节目编排包括电影和现场讲座。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to writing computer programs","zh":"与编程有关的；用于编程的"},"examples":[{"en":"He bought a programming book for beginners.","zh":"他买了一本给初学者的编程书。"}]}],"synonyms":["coding","software development","computer programming","scheduling","planning"],"phonetic":"/ˈproʊɡræmɪŋ/","extraExplanation":["你输入的“programmng”应为 **programming**。常见拼写是 **programming**（双m）。你可能也会看到 **programing**（单m），但在现代英语里更常用、也更标准的是 **programming**，尤其在“计算机编程”语境中。"]}
{"word":"programs","summary":{"en":"Programs can mean planned activities/projects, computer software, or TV/radio shows (and sometimes printed event booklets).","zh":"Programs 可指：项目/活动安排、电脑软件程序、电视/广播节目（也可指演出节目单）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of program: a set of planned activities or events, often offered by an organization.","zh":"program 的复数：一系列计划好的活动或项目，常由机构提供。"},"examples":[{"en":"The library offers free programs for children every weekend.","zh":"图书馆每个周末都为儿童提供免费的活动项目。"},{"en":"Our school has exchange programs with two countries.","zh":"我们学校和两个国家有交流项目。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of program: a computer program—software that tells a computer what to do.","zh":"program 的复数：计算机程序（软件）——用来指挥电脑做什么的指令集合。"},"examples":[{"en":"I installed two new programs on my laptop.","zh":"我在笔记本电脑上安装了两个新软件。"},{"en":"Some programs run in the background and use memory.","zh":"有些程序会在后台运行并占用内存。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of program: a broadcast schedule or a single show on TV/radio; also a printed booklet for a concert or play.","zh":"program 的复数：电视/广播节目（或节目表）；也可指音乐会、戏剧的节目单。"},"examples":[{"en":"There are several news programs on at night.","zh":"晚上有好几个新闻节目。"},{"en":"We picked up programs at the theater entrance.","zh":"我们在剧院入口处拿了节目单。"}]}],"synonyms":["projects","activities","software","applications (apps)","shows"],"phonetic":"/ˈproʊɡræmz/","extraExplanation":["美式英语常用拼写是 program；英式英语在“电脑程序”这个意思上也常写作 program，但在“活动/计划/课程”这类意思上有时会看到 programme（更偏英式）。","在英语里 program 既可以是“项目/计划”（如 health program 健康项目），也可以是“软件/程序”（如 antivirus program 杀毒软件），语境通常能帮助你判断。"]}
{"word":"progravid","summary":{"en":"A medical adjective meaning a woman has been pregnant before (not her first pregnancy).","zh":"一个医学形容词，表示女性曾经怀孕过（非初次妊娠）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having been pregnant before; describing a woman who is currently pregnant and has had one or more previous pregnancies.","zh":"（医学/产科）经产的；指曾经怀孕过的（女性），常用于描述目前怀孕且有既往妊娠史的人。"},"examples":[{"en":"In the patient notes, she is described as progravid, so this is not her first pregnancy.","zh":"在病历记录中，她被描述为“progravid”，因此这不是她的第一次怀孕。"},{"en":"Doctors often compare care for a primigravid patient and a progravid patient.","zh":"医生常会比较初孕（primigravid）与经孕（progravid）患者的管理方式。"}]}],"synonyms":["multigravid (related, more common)","previously pregnant (plain-English paraphrase)"],"phonetic":"/proʊˈɡrævɪd/","extraExplanation":["这是较少见、偏专业的产科用词。更常见的对应词是：primigravid（初孕，第一次怀孕）与 multigravid（多次怀孕）。在临床写作里也常用 G（gravida，妊娠次数）来表示，例如 G2 表示第 2 次妊娠。","词根 gravid 来自拉丁语 gravis（“重的”），与 pregnancy（怀孕）里“负担/承载”的隐喻有关；在医学英语中，gravid 就有“怀孕的”之意。"]}
{"word":"progrede","summary":{"en":"“Prograde” means moving forward in the normal/positive direction of rotation or orbit (astronomy/space).","zh":"“Prograde” 指（天体/航天中）顺行：沿着自转或公转的常规（正向）方向运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely intended word: “prograde” — moving forward or in the same direction as the usual (positive) rotation or orbit.","zh":"你可能想查的是：prograde——（天体）顺行的；沿着通常（正向）自转或公转方向运动的。"},"examples":[{"en":"Most planets in our solar system have prograde orbits around the Sun.","zh":"太阳系中大多数行星都沿着顺行轨道绕太阳公转。"},{"en":"A prograde moon orbits in the same direction as its planet’s rotation.","zh":"顺行卫星的公转方向与行星自转方向相同。"}]},{"partOfSpeech":"vi.","definition":{"en":"To move in a prograde direction; to advance in the normal direction of rotation or orbit (technical use).","zh":"（术语）顺行；沿着自转或公转的正常方向前进。"},"examples":[{"en":"The spacecraft will prograde briefly to raise its orbit.","zh":"航天器将短暂顺行，以提高轨道高度。"}]}],"synonyms":["direct","forward (in orbital context)","with the rotation"],"phonetic":"/ˈproʊˌɡreɪd/","extraExplanation":["“progrede” 不是常见英文单词，最接近的常见拼写是 **prograde**（多见于天文学/航天）或 **progressed**（progress 的过去式/过去分词，表示“进步了/推进了”）。如果你想表达“进步、进展”，更可能需要的是 **progress** / **progressed**。","词源提示：**pro-**（向前）+ **grade**（步、走），整体有“向前走/顺着走”的感觉，因此在天体运动里指“顺着常规方向”。"]}
{"word":"progrediency","summary":{"en":"“Progrediency” means the quality of making steady progress or moving forward over time (a rare word).","zh":"“progrediency”指“持续推进、稳步进展的性质”（较少见的用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of progressing; gradual forward development or advancement","zh":"进展性；逐步向前发展的状态或性质"},"examples":[{"en":"The project showed progrediency week by week, with each test performing better than the last.","zh":"这个项目每周都有进展性，每次测试都比上一次表现更好。"},{"en":"She valued steady progrediency over sudden, risky changes.","zh":"她更看重稳定的进展性，而不是突然且冒险的改变。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics, rare) a tendency for an action or process to move forward in time or unfold progressively","zh":"（语言学，罕见）进行性/推进性：动作或过程随时间向前展开的倾向"},"examples":[{"en":"Some analyses describe the verb phrase as having progrediency, emphasizing an unfolding event.","zh":"有些分析把这个动词短语描述为具有进行性（推进性），强调事件在展开。"}]}],"synonyms":["progress","progression","advancement","development","forward movement"],"phonetic":"/proʊˈɡrɛdiənsi/","extraExplanation":["“progrediency”是比较少见的名词，多数场合更常用“progress / progression / advancement”。看到它时，一般可理解为“逐步推进、持续进展的性质”。","词源可追溯到拉丁语 progredi（向前走、前进）。相关词还有 prograde（向前推进的）与 progredient（向前发展的；较少用）。"]}
{"word":"progredient","summary":{"en":"Progredient means “progressing or moving forward step by step,” especially in formal or medical contexts.","zh":"progredient 指“逐步推进、进行性发展”，常见于正式或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving forward; progressing or developing step by step (often used in formal or scientific writing).","zh":"向前推进的；逐步发展的（多用于正式或科学语境）。"},"examples":[{"en":"The disease has a progredient course, gradually worsening over time.","zh":"这种疾病呈进行性进展，会随着时间逐渐加重。"},{"en":"We studied how progredient changes in the climate affect local agriculture.","zh":"我们研究了气候的渐进变化如何影响当地农业。"}]}],"synonyms":["progressive","advancing","developing","gradual"],"phonetic":"/proʊˈɡriːdiənt/","extraExplanation":["“progredient”比较少见，常见于医学或学术文章，意思接近“progressive（进行性的）”。","词源来自拉丁语 progredi（向前行走、前进），其中 pro- 表示“向前”，gradi 表示“走、迈步”（也可联想 grade/gradual 里的“步/级”概念）。"]}
{"word":"progress","summary":{"en":"“Progress” means improvement or forward movement toward a goal, or the process of moving forward over time.","zh":"“progress”表示朝目标前进、取得进展，也可指事情随时间推进的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Forward movement toward a goal; improvement or development over time.","zh":"朝目标前进的过程；进步、发展。"},"examples":[{"en":"She is making good progress in English.","zh":"她的英语进步很快。"},{"en":"We’ve made progress on the project, but we’re not finished yet.","zh":"我们在项目上有进展，但还没完成。"}]},{"partOfSpeech":"vi.","definition":{"en":"To move forward or continue developing; to advance.","zh":"向前推进；继续发展、进展。"},"examples":[{"en":"As the day progressed, the weather got colder.","zh":"随着一天推进，天气变得更冷了。"},{"en":"The talks are progressing slowly.","zh":"会谈进展缓慢。"}]}],"synonyms":["advance","improvement","development","headway","move forward"],"phonetic":"/ˈprɑːɡrəs/","extraExplanation":["在教育或工作场景里，progress 常与 make progress（取得进展）搭配使用；也常说 in progress（正在进行中）。","词源来自拉丁语 pro-（向前）+ gradi（走），核心意象是“向前走”。"]}
{"word":"progressed","summary":{"en":"“Progressed” means “moved forward or improved; developed over time,” and it is the past tense/past participle of “progress.”","zh":"“progressed”表示“前进、进步；发展”，是“progress”的过去式和过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “progress”: to move forward or improve; to develop over time.","zh":"“progress”的过去式和过去分词：前进、进步；（事物）随着时间发展。"},"examples":[{"en":"Her English progressed quickly after she started reading every day.","zh":"她开始每天阅读后，英语进步得很快。"},{"en":"The project progressed from a small idea to a real product.","zh":"这个项目从一个小点子发展成了真正的产品。"},{"en":"The patient’s condition has progressed despite treatment.","zh":"尽管接受治疗，病人的病情仍然有所发展（加重/进展）。"}]}],"synonyms":["advanced","improved","developed","moved forward"],"phonetic":"/prəˈɡrɛst/","extraExplanation":["“progressed”常用在完成时或被动相关结构中：has/have progressed（已经取得进展），had progressed（到过去某时已经进展）。","在医学、科技、学术语境里，“condition/disease has progressed”常表示“病情进展/加重”；在学习、事业语境里更偏正面，表示“进步”。"]}
{"word":"progresser","summary":{"en":"“Progresser” is a French verb meaning “to make progress.” In English, use “progress” instead.","zh":"“Progresser”是法语动词，意思是“取得进步/进展”。英语中应使用“progress”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(French verb) to make progress; to improve gradually over time.","zh":"（法语动词）取得进步；逐渐改善、进展。"},"examples":[{"en":"In French, “Je progresse en anglais” means “I’m making progress in English.”","zh":"在法语里，“Je progresse en anglais”的意思是“我的英语在进步。”"},{"en":"She has progressed a lot this year.","zh":"她今年进步很大。"},{"en":"The project is progressing slowly.","zh":"项目进展缓慢。"}]}],"synonyms":["improve","advance","develop"],"phonetic":"/prəˈɡrɛs/","extraExplanation":["“progresser”不是标准英语单词，而是法语动词；在英语语境中一般不会这样写。英语里通常用：动词 progress（如：I’m progressing. / The project is progressing.），名词 progress（如：make progress），形容词 progressive（如：a progressive policy）。","发音提示：如果你是在学法语，“progresser”的法语发音大致为 /pʁɔ.ɡʁe.se/；但在英语学习中更建议掌握英语 progress 的读音与用法。"]}
{"word":"progresses","summary":{"en":"“progresses” usually means “moves forward/develops over time” (3rd-person singular of the verb progress).","zh":"“progresses”通常表示“向前推进/逐步发展”（动词progress的第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"moves forward or improves over time; develops step by step","zh":"随着时间向前推进或逐渐改善；循序渐进地发展"},"examples":[{"en":"As the story progresses, the main character becomes more confident.","zh":"随着故事的发展，主角变得更自信。"},{"en":"The disease progresses quickly without treatment.","zh":"如果不治疗，疾病会迅速恶化。"},{"en":"The meeting progresses from introductions to planning the next steps.","zh":"会议从自我介绍推进到规划下一步。"}]}],"synonyms":["advances","develops","moves forward","improves","evolves"],"phonetic":"/ˈprɑːɡrɛsɪz/","extraExplanation":["“progresses”通常是动词“progress”的第三人称单数（he/she/it progresses），也可以是名词“progress”的复数形式（the progresses），但名词复数用法较少，更多时候人们说“progress”（不可数）来表示“进展/进步”。","常见搭配：progresses slowly/rapidly（进展缓慢/迅速）；progresses through stages（经历各阶段）；as time progresses（随着时间推移）。"]}
{"word":"progressing","summary":{"en":"“Progressing” means moving forward or improving; it can describe ongoing development or be the -ing form of “progress.”","zh":"“progressing”表示“在前进/在进步/在推进”，既可作形容词，也可作“progress”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Moving forward; developing or improving over time (often step by step).","zh":"在前进的；在发展或进步中的（常指循序渐进）。"},"examples":[{"en":"She is progressing quickly in English.","zh":"她的英语进步很快。"},{"en":"The project is progressing according to plan.","zh":"项目正按计划推进。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “progress”: to move forward or develop.","zh":"“progress（进步/推进）”的现在分词：指向前推进、发展。"},"examples":[{"en":"The child is progressing from simple words to full sentences.","zh":"这个孩子正在从简单词语进步到完整句子。"}]}],"synonyms":["advancing","improving","developing","moving forward"],"phonetic":"/prəˈɡrɛsɪŋ/","extraExplanation":["“progressing”既可以当形容词（a progressing economy 发展中的经济），也常见于进行时态里作动词的一部分（is progressing 正在推进）。","在日常英语里，比起单独说“progressing”，更常说“making progress”（取得进展/进步），语气更自然：I’m making progress in math.（我数学在进步。）"]}
{"word":"progression","summary":{"en":"Progression means a step-by-step development or ordered sequence, often used for learning/career paths or for chord changes in music.","zh":"Progression 指按步骤推进的发展过程或有序序列，常用于学习/职业进阶，也可指音乐中的和弦进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sequence of steps or changes in which something develops, improves, or moves forward over time","zh":"（事物）随时间发展的过程；一连串的步骤或变化；进展"},"examples":[{"en":"The progression from beginner to intermediate level can take several months.","zh":"从初学到中级的进阶可能需要几个月。"},{"en":"We watched the progression of the storm as it moved toward the coast.","zh":"我们观察到风暴向海岸移动时的发展变化。"}]},{"partOfSpeech":"n.","definition":{"en":"a series arranged in order, especially in education, training, or work (often: a planned path)","zh":"（教育/训练/工作中的）按顺序安排的系列；（常指）规划好的晋升/进阶路径"},"examples":[{"en":"The course has a clear progression: basics first, then practice, then projects.","zh":"这门课的学习进程很清晰：先基础，再练习，最后做项目。"},{"en":"Her career progression was fast after she changed teams.","zh":"她换了团队后，职业晋升很快。"}]},{"partOfSpeech":"n.","definition":{"en":"in music, a movement from one chord to another in a pattern (often: chord progression)","zh":"（音乐）和弦进行：按模式从一个和弦走向另一个和弦"},"examples":[{"en":"This song uses a simple chord progression.","zh":"这首歌用了简单的和弦进行。"}]}],"synonyms":["development","advance","growth","sequence","evolution","course"],"phonetic":"/prəˈɡrɛʃən/","extraExplanation":["“progression”常和“progress”混用，但语气不同：progress更偏“取得的进步/成果”（不可数或可数），progression更偏“按顺序发展的过程或阶段”（强调顺序与过程）。例如：make progress（取得进步） vs. the progression of skills（技能的发展顺序）。","常见搭配：a natural progression（自然的发展过程）、career progression（职业发展/晋升路径）、learning progression（学习进阶）、the progression of a disease（疾病的发展/病程）、chord progression（和弦进行）。"]}
{"word":"progressional","summary":{"en":"Progressional means ‘related to gradual progress or forward development.’ It’s a rare word; ‘progressive’ is more common.","zh":"progressional 指“与逐步进展/向前发展有关的”。这个词较少见，更常用 progressive。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to progression; moving forward or developing step by step","zh":"与进展/发展有关的；逐步向前推进的"},"examples":[{"en":"The report takes a progressional view of the patient’s recovery over six months.","zh":"这份报告以“逐步进展”的角度回顾了患者六个月的康复情况。"},{"en":"In a progressional training plan, the exercises become harder each week.","zh":"在循序渐进的训练计划中，每周的练习都会更有难度。"}]}],"synonyms":["progressive","developmental","advancing","incremental"],"phonetic":"/prəˈɡrɛʃənəl/","extraExplanation":["“progressional”在现代英语中比较少见，更常用的是“progressive”（渐进的/进步的）或“developmental”（发展的）。","学习时要注意它常被误写/误读为“processional”（游行的；队列的；入场曲的），两者词形相近但意思不同：progressional 强调“进展”，processional 强调“队列/仪式性行进”。"]}
{"word":"progressionally","summary":{"en":"“Progressionally” means “step by step, in stages, as something develops.”","zh":"“progressionally”表示“循序渐进地、分阶段地（随着事物发展而推进）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens in stages or follows a sequence; step by step as something progresses.","zh":"以逐步推进、按阶段（按顺序）发展的方式；循序渐进地。"},"examples":[{"en":"The course is designed so students learn progressionally, moving from basic skills to more complex ones.","zh":"这门课程的设计让学生循序渐进地学习，从基础技能逐步过渡到更复杂的内容。"},{"en":"Her responsibilities increased progressionally over the first year at the company.","zh":"她在公司第一年里的职责是逐步增加的。"}]}],"synonyms":["progressively","gradually","step by step","in stages","incrementally"],"phonetic":"/prəˈɡrɛʃənəli/","extraExplanation":["“progressionally”并不常见，日常英语里更常用的是 “progressively”（逐渐地、渐进地）。如果你想表达“按步骤/分阶段”，也常用 “step by step” 或 “in stages”。"]}
{"word":"progressionary","summary":{"en":"“Progressionary” means related to gradual progress or development over time.","zh":"“progressionary”指与随时间逐步进展或发展的过程有关（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to progress or development over time; moving forward step by step.","zh":"与进步或随时间发展的过程有关的；循序渐进向前发展的。"},"examples":[{"en":"The report described a progressionary change in the city’s public transportation system.","zh":"报告描述了这座城市公共交通系统的渐进式变化。"},{"en":"She prefers a progressionary approach to learning, starting with basics and adding skills gradually.","zh":"她更喜欢循序渐进的学习方法：先打基础，再逐步增加技能。"}]}],"synonyms":["progressive","developmental","incremental","evolutionary","step-by-step"],"phonetic":"/prəˈɡrɛʃəˌnɛri/","extraExplanation":["“progressionary”在现代英语中非常少见，更常用的替代表达是“progressive”“developmental”“incremental”或“step-by-step”。","它通常是由“progression（进展、进程）+ -ary（形容词后缀，表示‘与……有关的’）”构成，意思接近“与进展过程有关的”。在写作中若想更自然，建议优先用更常见的词。"]}
{"word":"progressionism","summary":{"en":"Progressionism is the belief that society should improve through progress and reform; it can also refer to progressive, child-centered educational ideas.","zh":"进步主义指主张社会应通过进步与改革不断改善；也可指教育上的进步主义理念（以学生为中心、强调实践与做中学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or policy that society can and should improve over time through reform, science, education, or better government (often linked to “progressive” politics).","zh":"进步主义（认为社会能够并且应该通过改革、科学、教育或更好的治理不断改善的思想或政策，常与“进步派/自由派”政治相关）。"},"examples":[{"en":"Her research looks at how progressionism shaped public education in the early 1900s.","zh":"她的研究探讨了20世纪初进步主义如何塑造公共教育。"},{"en":"Critics argue that progressionism can ignore traditions that communities value.","zh":"批评者认为进步主义可能会忽视社区珍视的传统。"},{"en":"The party’s platform reflects a form of progressionism focused on social welfare.","zh":"该党的政纲体现了一种强调社会福利的进步主义。"}]},{"partOfSpeech":"n.","definition":{"en":"In educational contexts, an approach that emphasizes child-centered learning, practical skills, and learning by doing (often connected to progressive education).","zh":"（教育语境）进步主义教育观：强调以学生为中心、重视实践能力与“做中学”（常与进步教育相关）。"},"examples":[{"en":"The school adopted progressionism by adding project-based learning and fewer rote tests.","zh":"这所学校采用进步主义理念，增加项目式学习，减少死记硬背的考试。"},{"en":"Teachers debated whether progressionism improves discipline and basic skills.","zh":"教师们讨论进步主义是否能提升纪律与基础技能。"}]}],"synonyms":["progressivism","reformism","progressive thought","social reform"],"phonetic":"/prəˈɡrɛʃəˌnɪzəm/","extraExplanation":["“progressionism”常与“progressivism（进步主义）”意义接近，但前者使用频率更低，通常出现在学术写作或历史讨论中。","在美国历史语境里，它常让人联想到19世纪末到20世纪初的“进步时代（Progressive Era）”，当时许多人主张用立法、社会改革与公共政策来应对工业化带来的问题。"]}
{"word":"progressionist","summary":{"en":"A progressionist supports progressive reforms, especially in politics or education.","zh":"progressionist 指支持进步改革的人，常见于政治或教育语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports progressive ideas and reforms in society or politics.","zh":"进步主义者；支持社会或政治改革、强调进步理念的人。"},"examples":[{"en":"As a progressionist, she pushed for stronger labor protections and voting rights.","zh":"作为一名进步主义者，她推动更强的劳工保护和投票权。"},{"en":"The city council included both conservatives and progressionists, so compromise was necessary.","zh":"市议会里既有保守派也有进步主义者，因此必须妥协。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports progressive approaches to education, emphasizing practical learning and student-centered methods.","zh":"（教育）进步主义者；支持以学生为中心、强调实践与探究式学习的人。"},"examples":[{"en":"Many progressionists in education prefer projects and discussion over rote memorization.","zh":"许多教育领域的进步主义者更偏好项目与讨论，而不是死记硬背。"},{"en":"The school adopted progressionist ideas, giving students more choice in what they study.","zh":"这所学校采纳了进步主义理念，让学生在学习内容上有更多选择。"}]}],"synonyms":["progressive","progressivist","reformer","liberal (in some contexts)"],"phonetic":"/prəˈɡrɛʃənɪst/","extraExplanation":["“progressionist”常见于政治或教育语境，意思接近“progressive（进步派的）”。在当代英语里，更常用的名词形式是“progressive”或“progressivist”。","词形提示：progress（进步）+ -ion（名词后缀）+ -ist（表示“……主义者/支持者”）。"]}
{"word":"progressions","summary":{"en":"“Progressions” means step-by-step developments or sequences, often used for change over time, structured learning/training, or chord sequences in music.","zh":"“progressions”指循序渐进的变化或顺序发展过程，常用于描述时间中的进展、学习/训练的递进安排，或音乐中的和弦进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A series of changes or developments that happen step by step over time.","zh":"（事物随时间）逐步发生的一连串变化；进展过程"},"examples":[{"en":"We studied the progression of the disease over six months.","zh":"我们研究了这种疾病在六个月内的进展过程。"},{"en":"The movie shows the progression from childhood to adulthood.","zh":"这部电影展现了从童年到成年的成长过程。"}]},{"partOfSpeech":"n.","definition":{"en":"A planned sequence (especially of lessons, exercises, or tasks) that increases in difficulty or builds skills.","zh":"（课程/练习/任务等）循序渐进的安排；递进训练"},"examples":[{"en":"This textbook has a clear progression from basic to advanced topics.","zh":"这本教材从基础到进阶安排得很清晰。"},{"en":"Try a progression of exercises to strengthen your core safely.","zh":"尝试一套循序渐进的练习，安全地强化核心力量。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a sequence of chords or musical ideas that move from one to another (often called a chord progression).","zh":"【音乐】（和弦等的）进行；和弦进行"},"examples":[{"en":"That jazz progression sounds complex but smooth.","zh":"那段爵士和弦进行听起来复杂却很流畅。"},{"en":"Practice the ii–V–I progression in all keys.","zh":"把 ii–V–I 的和弦进行在所有调上都练一遍。"}]}],"synonyms":["developments","advances","evolution","sequence","series","chord changes"],"phonetic":"/prəˈɡrɛʃənz/","extraExplanation":["“progressions”是“progression”的复数。常见搭配：the progression of + 名词（……的进展/演变）；a progression from A to B（从A到B的递进/转变）；in progression（按顺序、依次）。","在健身/学习语境里，progression 强调“循序渐进、逐步加量/加难度”，比单纯的“progress”更有“步骤和结构”的感觉。","音乐里常说 chord progression（和弦进行）。在流行与爵士中，有些“固定进行”非常常见，如 I–V–vi–IV（流行常用）与 ii–V–I（爵士常用）。"]}
{"word":"progressism","summary":{"en":"Progressism is the belief that society should move forward through reform and new ideas, especially in politics.","zh":"Progressism 指主张社会应通过改革与新理念不断进步的思想，尤其常见于政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a belief that society should improve through reform and new ideas; often used in politics to support social and economic changes that promote fairness and modern solutions","zh":"进步主义（主张社会应通过改革与新理念不断改善；常用于政治语境，支持推动公平与现代化的社会与经济变革）"},"examples":[{"en":"Progressism often focuses on expanding access to education, healthcare, and workers’ rights.","zh":"进步主义常常关注扩大教育、医疗和劳动者权利的可及性。"},{"en":"Some voters support progressism because they want stronger protections for the environment.","zh":"一些选民支持进步主义，因为他们希望对环境有更强的保护。"}]}],"synonyms":["progressivism","progressive politics","reformism"],"phonetic":"/prəˈɡrɛsɪzəm/","extraExplanation":["“progressism”在英语里能被理解，但更常见、更标准的拼写是“progressivism”。在新闻、学术写作和正式场合通常用“progressivism”。","在美国政治语境中，“progressivism”常与“liberalism（自由派）”有关但不完全相同：进步主义通常更强调结构性改革（例如反垄断、劳工保护、社会福利、监管等）。在不同国家或语境里，它的具体主张会有所变化。","词根“progress（进步）”来自拉丁语，相关形容词是“progressive（进步的）”。常见搭配：progressive policies（进步政策）、a progressive agenda（进步议程）。"]}
{"word":"progressist","summary":{"en":"A (less common) word for someone who supports progressive change, especially in politics.","zh":"指支持进步与改革的人（用法较少，常用 progressive / progressivist）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports progress and reform, especially in politics and society; someone with progressive ideas (a less common form of “progressive” or “progressivist”).","zh":"主张进步与改革的人（尤指政治与社会领域）；进步主义者（较少用法，常见对应词为 progressive / progressivist）。"},"examples":[{"en":"Many progressists argue for stronger environmental protections and social programs.","zh":"许多进步主义者主张更严格的环保保护与社会福利项目。"},{"en":"In the debate, she was labeled a progressist because she supported voting-rights reforms.","zh":"在辩论中，她因支持选举权改革而被称为进步主义者。"}]}],"synonyms":["progressive","progressivist","reformer","liberal (context-dependent)"],"phonetic":"/prəˈɡrɛsɪst/","extraExplanation":["“progressist”在现代英语里不算常见，更常见的是：\n- progressive（既可作形容词“进步的”，也可作名词“进步派人士”）\n- progressivist（名词，更明确指政治上的进步主义者）\n在写作或正式表达中，用 progressive/progressivist 往往更自然、更容易被理解。","语境提示：在美国政治语境里，progressive 常与支持扩大社会保障、劳工权益、医疗与教育公共投入、环境保护等政策立场相关；但在不同国家或语境中，“进步派/改革派”的具体含义可能有所不同。"]}
{"word":"progressive","summary":{"en":"Progressive commonly means “supporting reform or new ideas,” “gradually advancing,” or (in grammar) “in the -ing form showing an action in progress.” It can also mean a person with progressive political views.","zh":"progressive 常指“主张改革/新思想的”“逐步推进的/渐进的”，或（语法）“进行时/进行体的”；也可指“进步派人士/改革派人士”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting gradual improvement, reform, or new ideas (often in politics or society).","zh":"主张逐步改良、改革或新思想的（常用于政治或社会议题）。"},"examples":[{"en":"She has progressive views on education and social policy.","zh":"她在教育与社会政策方面持进步/改革派观点。"},{"en":"The city adopted a progressive plan to reduce pollution.","zh":"这座城市采取了一项更进步的（更有前瞻性的）减污计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving forward step by step; happening in stages over time.","zh":"逐步向前的；循序渐进发生的。"},"examples":[{"en":"The disease can cause progressive memory loss.","zh":"这种疾病可能导致进行性/渐进性的记忆衰退。"},{"en":"We saw progressive improvement after a few weeks of practice.","zh":"练习几周后，我们看到逐步的进步。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a verb form that shows an action in progress (e.g., “is running,” “was studying”).","zh":"（语法）进行时/进行体的：表示动作正在进行（如 is running, was studying）。"},"examples":[{"en":"In “She is reading,” the verb is in the present progressive.","zh":"在“She is reading”中，动词使用的是现在进行时。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports progressive ideas, especially in politics.","zh":"进步派人士；改革派人士（尤指政治立场）。"},"examples":[{"en":"Many progressives pushed for healthcare reform.","zh":"许多进步派人士推动了医疗改革。"}]}],"synonyms":["forward-looking","reform-minded","liberal (in some political contexts)","gradual","incremental"],"phonetic":"/prəˈɡrɛsɪv/","extraExplanation":["词源提示：progressive 来自 progress（进步、进展）。在新闻语境里，progressive 常指“政治上偏自由派/改革派”的立场；但在医学里常见 progressive disease（进行性疾病），意思是“会逐渐加重”。","语法点：英语里常说 present progressive（现在进行时）和 past progressive（过去进行时）。在现代语法书中也常用 present continuous（现在进行时）来表达同一概念。"]}
{"word":"progressively","summary":{"en":"“Progressively” means gradually over time, often suggesting something becomes more and more intense or noticeable.","zh":"“progressively”表示“逐渐地、循序渐进地”，常强调某种变化“越来越……”明显或严重。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a gradual way, happening step by step over time.","zh":"逐渐地；循序渐进地（随着时间一步一步发生）。"},"examples":[{"en":"Her English improved progressively over the year.","zh":"她的英语在这一年里逐渐进步。"},{"en":"The pain became progressively worse after the injury.","zh":"受伤后疼痛变得越来越严重。"}]},{"partOfSpeech":"adv.","definition":{"en":"To an increasing degree; more and more.","zh":"越来越……；程度不断增加。"},"examples":[{"en":"The city is becoming progressively more crowded.","zh":"这座城市正变得越来越拥挤。"},{"en":"He grew progressively less patient during the long wait.","zh":"在漫长的等待中，他变得越来越没耐心。"}]}],"synonyms":["gradually","increasingly","step by step","more and more","little by little"],"phonetic":"/prəˈɡrɛsɪvli/","extraExplanation":["“progressively”常用于书面语、新闻和学术表达，强调变化不是突然发生，而是持续、缓慢地推进。日常口语里也可以用“gradually”或“more and more”来替换，语气更自然。","常见搭配：progressively + 比较级（progressively worse/better/more/less），用来强调“越来越……”的趋势。"]}
{"word":"progressiveness","summary":{"en":"Progressiveness means support for progressive reform or the quality of being open to change and improvement.","zh":"progressiveness 指支持进步改革的倾向，或“愿意接受新观念并追求改进”的进步性特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to support social or political reform, aiming for greater equality, rights, and modern solutions to problems.","zh":"进步主义；支持社会或政治改革的倾向，强调平等、权利与现代化解决方案。"},"examples":[{"en":"Progressiveness often shows up in policies that expand voting rights or worker protections.","zh":"进步主义常体现在扩大投票权或加强劳动者保护的政策中。"},{"en":"In some countries, progressiveness is linked with environmental regulations and public healthcare.","zh":"在一些国家，进步主义常与环保法规和公共医疗相关联。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being progressive—open to new ideas, change, and improvement.","zh":"进步性；愿意接受新观念、改变并追求改进的特质。"},"examples":[{"en":"The school is known for the progressiveness of its teaching methods.","zh":"这所学校以其教学方法的进步性而闻名。"},{"en":"Her progressiveness at work led the team to try new tools and faster workflows.","zh":"她在工作中的进步性促使团队尝试新工具和更高效的流程。"}]}],"synonyms":["progressivism","liberalism (in some contexts)","reform-mindedness","forward-looking attitude","openness to change"],"phonetic":"/prəˈɡrɛsɪvnəs/","extraExplanation":["“progressiveness”常见于政治与社会讨论中，语气通常偏正式。它与“progressivism（进步主义）”关系密切：前者更像“特质/倾向”，后者更像“思想体系/运动”。","不同语境下“progressive/进步的”可能带有立场色彩：在支持者眼中意味着公平与改革；在批评者口中可能暗示“变化太快”或“干预过多”。理解时要注意说话者的立场与语境。"]}
{"word":"progressives","summary":{"en":"“Progressives” usually means people who support progressive politics or reform; it can also be the plural adjective meaning “gradually improving.”","zh":"“progressives”通常指支持进步政治/改革的进步派人士；也可作形容词复数，表示“逐步改进的、进步的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who support progressive ideas, especially in politics (often favoring social reform, equality, and government action to solve problems)","zh":"进步派人士；（尤指政治上的）自由派/改革派，主张社会改革、平等与通过公共政策解决问题"},"examples":[{"en":"Progressives in Congress pushed for stronger climate policies.","zh":"国会中的进步派推动更强力度的气候政策。"},{"en":"In this city, progressives and moderates often disagree on housing rules.","zh":"在这座城市，进步派和温和派常常在住房规定上意见不一。"},{"en":"She’s a progressive who supports expanding healthcare access.","zh":"她是进步派，支持扩大医疗服务的可及性。"}]},{"partOfSpeech":"adj.","definition":{"en":"plural of “progressive”: moving forward or improving gradually; supporting progress and reform","zh":"“progressive”的复数：逐步进步的；支持进步与改革的"},"examples":[{"en":"The company introduced progressive changes to its parental-leave policy.","zh":"公司对育儿假政策进行了循序渐进的改进。"},{"en":"They chose progressive teachers who encouraged critical thinking.","zh":"他们选择了鼓励批判性思维的进步型老师。"}]}],"synonyms":["liberals","reformers","left-leaning voters","social democrats","progressive Democrats"],"phonetic":"/prəˈɡrɛsɪv/","extraExplanation":["在美国英语里，progressives 常用来指民主党内或更广泛政治光谱中的“进步派”，通常强调：社会公平（如种族与性别平等）、劳工权益、医疗与教育的公共投入、环境保护等。具体立场会因国家与语境而不同。","在语气上，progressive 在政治语境里可能是自我认同的标签，也可能是他人带有评价色彩的称呼；写作时可根据语境选择更中性的说法，如 “left-leaning voters（偏左选民）” 或 “reform-minded politicians（倾向改革的政治人物）”。"]}
{"word":"progressivism","summary":{"en":"Progressivism is a reform-oriented political and social movement focused on reducing inequality and improving society, often through government action; it also refers to the U.S. Progressive Era movement (late 19th–early 20th century).","zh":"进步主义是强调改革、减少不平等并改善社会（常通过政府行动实现）的政治与社会运动；也可特指美国19世纪末至20世纪初的进步时代改革运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political and social movement that supports reform to reduce inequality and improve conditions through government action (such as stronger labor rights, consumer protections, and social welfare)","zh":"进步主义（主张通过改革与政府行动减少不平等、改善社会状况的政治与社会运动，如加强劳工权利、消费者保护与社会福利）"},"examples":[{"en":"Progressivism often emphasizes policies like higher minimum wages and stronger protections for workers.","zh":"进步主义常强调提高最低工资、加强对劳动者的保护等政策。"},{"en":"In the U.S., progressivism is usually linked to expanding social programs and regulating big business.","zh":"在美国语境中，进步主义通常与扩大社会项目、加强对大企业的监管有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, especially in the United States) the Progressive Era reform movement in the late 1800s and early 1900s, aimed at fighting corruption and improving public health, education, and working conditions","zh":"（历史义，尤指美国）进步时代的改革运动（约19世纪末至20世纪初），旨在反腐败并改善公共卫生、教育与工作条件"},"examples":[{"en":"Progressivism during the Progressive Era led to reforms like food safety laws and changes in city government.","zh":"进步时代的进步主义推动了食品安全法等改革，也改变了城市治理。"},{"en":"Many history textbooks discuss progressivism as a response to problems created by rapid industrialization.","zh":"许多历史教材把进步主义视为对快速工业化带来问题的回应。"}]}],"synonyms":["progressive movement","reformism","social reform"],"phonetic":"/prəˈɡrɛsɪˌvɪzəm/","extraExplanation":["在当代美国政治中，“progressive / progressivism”常用来描述偏左、强调经济与社会公平的立场，但不同人对其政策范围与优先顺序理解不一；在不同国家语境中也可能对应不同议题组合。","词源上来自“progress（进步）+ -ivism（主义）”。注意它不等同于“liberalism（自由主义）”，两者有重叠但侧重点可能不同。"]}
{"word":"progressivist","summary":{"en":"“Progressivist” usually refers to a person (or idea) that supports progressive political and social reforms.","zh":"“progressivist”通常指支持进步主义政治与社会改革的人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports progressive political and social reforms, such as expanding civil rights, improving social welfare, or strengthening protections for workers and the environment.","zh":"进步主义者；主张政治与社会改革的人（如扩大公民权利、改善社会福利、加强劳工与环境保护等）。"},"examples":[{"en":"Many progressivists argue that government should play a role in reducing poverty.","zh":"许多进步主义者认为政府应在减少贫困方面发挥作用。"},{"en":"The candidate appealed to progressivists by supporting stronger environmental regulations.","zh":"这位候选人通过支持更严格的环保法规来争取进步主义者的支持。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or supporting progressive ideas or reforms in politics and society.","zh":"进步主义的；支持政治与社会改革的。"},"examples":[{"en":"She is known for her progressivist views on education and healthcare.","zh":"她因在教育与医疗方面的进步主义观点而闻名。"},{"en":"The organization promotes a progressivist agenda focused on workers’ rights.","zh":"该组织推动以劳工权利为核心的进步主义议程。"}]}],"synonyms":["progressive","reformer","liberal (in some contexts)"],"phonetic":"/prəˈɡrɛsɪvɪst/","extraExplanation":["“progressivist”和“progressive”含义相近，但语气与语域略有差别：\n- “progressive”更常见、更中性，可作名词或形容词。\n- “progressivist”也常见于政治评论语境，有时会带一点“标签化”的感觉（褒贬取决于说话者立场）。","在美国历史语境中，“Progressivism（进步主义）”常让人联想到20世纪初“进步时代（Progressive Era）”的一些改革议题（如反垄断、公共卫生、选举改革等）。现代语境下则更常指偏自由派的政策取向。"]}
{"word":"progressivistic","summary":{"en":"An uncommon adjective meaning “related to or supportive of progressivism,” especially in politics.","zh":"一个较少见的形容词，意为“与进步主义有关或支持进步主义”（尤指政治语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or relating to progressivism, especially in politics (favoring social reform and government action to address inequality).","zh":"（尤指政治上）支持或与进步主义有关的；主张社会改革、并倾向用政府行动来改善不平等。"},"examples":[{"en":"Her writing takes a progressivistic view of healthcare and education policy.","zh":"她的文章以进步主义立场看待医疗与教育政策。"},{"en":"The candidate’s progressivistic platform focused on workers’ rights.","zh":"这位候选人的进步主义政纲强调劳工权益。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a general belief in social or cultural “progress,” often used in academic or critical writing.","zh":"体现对社会或文化“进步”的普遍信念（常见于学术或评论性写作）。"},"examples":[{"en":"Some critics argue the book has a progressivistic assumption that history always moves forward.","zh":"一些评论者认为这本书带有一种进步主义假设：历史总是向前发展的。"}]}],"synonyms":["progressive","progressivist","reformist","left-leaning (context-dependent)"],"phonetic":"/prəˌɡrɛsəˈvɪstɪk/","extraExplanation":["“progressivistic”比较少见，更常用的是“progressive”（如 progressive policies, progressive voters）。在政治语境中，两者含义接近，但“progressivistic”更像是书面/评论用语，有时带一点“标签化”或批评的味道（取决于语气与上下文）。","如果你想表达中性或更自然的英语，通常用“progressive”；如果你在写评论、分析或强调“某种意识形态倾向”，才更可能用“progressivistic”。"]}
{"word":"progressivity","summary":{"en":"Progressivity means the quality of being progressive (supporting reform), the degree of being progressive (especially in taxation), or— in linguistics— the expression of an ongoing action.","zh":"progressivity 可指进步性/改革倾向、（尤其税制的）累进程度，或在语言学中指表达动作正在进行的“进行体/进行式”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being progressive; support for gradual improvement or reform","zh":"进步性；倾向于逐步改良与改革的特质或状态"},"examples":[{"en":"The organization’s progressivity shows in its strong support for education and public health.","zh":"这个组织的进步性体现在它对教育和公共卫生的有力支持上。"},{"en":"People disagreed about the progressivity of the new policy, even though it aimed to reduce inequality.","zh":"尽管新政策旨在减少不平等，人们仍对它的进步性意见不一。"}]},{"partOfSpeech":"n.","definition":{"en":"the degree to which something becomes higher in stages, especially as income or another base increases (often about taxes)","zh":"（常指税制等）累进程度；随着收入或基数增加而分级提高的程度"},"examples":[{"en":"Economists debated the progressivity of the tax system.","zh":"经济学家们讨论了该税制的累进程度。"},{"en":"Higher progressivity means high-income earners pay a larger share.","zh":"更高的累进性意味着高收入者承担更高比例的税负。"}]},{"partOfSpeech":"n.","definition":{"en":"in linguistics, the expression of an ongoing action (the progressive aspect), often formed with “be + -ing”","zh":"（语言学）进行体/进行式；表达动作正在进行（常见形式为“be + -ing”）"},"examples":[{"en":"In “She is studying,” the verb phrase shows progressivity.","zh":"在“She is studying”中，动词短语体现了进行体（进行式）。"},{"en":"English often marks progressivity with “be” plus an -ing form.","zh":"英语常用“be + 动词-ing”来标记进行体。"}]}],"synonyms":["progressiveness","reformism","liberalism (context-dependent)","tax progressiveness (tax context)","progressive aspect (linguistics)"],"phonetic":"/ˌprɑːɡrɛˈsɪvəti/","extraExplanation":["“progressivity”在社会与政治语境里，通常指“进步派/改革派”的倾向（progressive ideas），强调通过制度改良让社会更公平或更现代化；不同国家和语境下，“进步”的具体主张可能不同。","在税收讨论中，“progressivity”常与“progressive tax（累进税）”搭配，关注税率或税负是否随收入上升而上升；相对概念包括“regressivity（累退性）”。","语言学里的“progressivity”更偏技术性，指“动作正在进行”的语法意义；注意它不等同于“将来一定会进步”，而是描述动作的时间状态。"]}
{"word":"progressor","summary":{"en":"A “progressor” is someone or something that shows progress; in medical/scientific contexts, it often means a case where a disease is progressing.","zh":"“progressor”指取得进步的人或向前发展的事物；在医学/科研语境中常指病情在进展的病例/患者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that makes progress or moves forward (in learning, work, development, etc.).","zh":"取得进步的人；推进发展/向前发展之事物（学习、工作、发展等方面）。"},"examples":[{"en":"As a new language learner, she was a fast progressor.","zh":"作为语言初学者，她进步很快。"},{"en":"The team needs steady progressors who keep improving every week.","zh":"团队需要那些能持续进步、每周都在提升的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in medicine/science) A patient, disease, or condition that shows progression (for example, a cancer that keeps growing despite treatment).","zh":"（尤用于医学/科研）病情出现进展（例如肿瘤持续增长、治疗无效）的患者或疾病/病程。"},"examples":[{"en":"In the study, progressors had worse outcomes than non-progressors.","zh":"在研究中，病情进展组（progressors）的结局比非进展组更差。"},{"en":"Doctors monitored whether each patient was a progressor after therapy.","zh":"医生观察治疗后每位患者是否属于病情进展者。"}]}],"synonyms":["improver","advancer","mover","developer","(medical) progressing case","(medical) disease progressor"],"phonetic":"/prəˈɡrɛsɚ/","extraExplanation":["“progressor”由“progress（进步/进展）+ -or（做某事的人/事物）”构成，是比较正式、偏书面或专业的词。日常英语里更常说“someone who is making progress / improving”。","在医学论文或临床语境中常与“non-progressor（非进展者）”对比使用；也常见于短语“disease progressor / tumor progressor”。"]}
{"word":"progressus","summary":{"en":"Progressus is a Latin word meaning “progress/advance,” sometimes used in English in academic, motto, or literary-style writing.","zh":"Progressus 是拉丁语词，意为“进步/推进”，在英语中多用于学术、校训或带古典风格的写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in academic or motto contexts) progress; an advance or forward movement.","zh":"（拉丁语；多用于学术或格言语境）进步；推进；向前发展。"},"examples":[{"en":"The report used the Latin term progressus to describe the steady advance of the project.","zh":"报告用拉丁词 progressus 来描述项目的稳步推进。"},{"en":"In some university mottos, progressus suggests growth through learning and effort.","zh":"在一些大学校训里，progressus 表示通过学习与努力获得成长与进步。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, in English writing) the course or process of development over time.","zh":"（引申于英语写作）发展过程；进展历程。"},"examples":[{"en":"She studied the progressus of modern science from the 1600s to today.","zh":"她研究了从17世纪到今天现代科学的发展历程。"},{"en":"The author traces the progressus of the main character from fear to courage.","zh":"作者描写了主人公从恐惧走向勇敢的成长过程。"}]}],"synonyms":["progress","advance","development","growth","improvement"],"phonetic":"/prəˈɡrɛsəs/","extraExplanation":["progressus 是拉丁语名词，来自动词 progredi（向前走、前进）。它在古典拉丁语里常指“前进、行进、发展”。在英语中并不常作为日常词汇使用，多见于学术写作、格言/校训、或带有古典风格的文本。","发音会因读者采用“英语化拉丁读法”或“古典拉丁读法”而不同；这里给出的是常见的英语化读法，便于英语学习者理解与朗读。"]}
{"word":"progs","summary":{"en":"“Progs” most commonly means “programs” (informal). It can also mean “pokes/prods” (BrE verb form) or refer to progressive rock (informal).","zh":"“progs”最常见指“程序/软件”（非正式）。也可指“戳/捅”（英式动词形式），或指前卫摇滚（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Programs, especially computer programs or apps.","zh":"（非正式）程序；（尤指）电脑软件/应用。"},"examples":[{"en":"I installed a few new progs on my laptop.","zh":"我在笔记本上装了几个新软件。"},{"en":"These progs run in the background.","zh":"这些程序在后台运行。"}]},{"partOfSpeech":"v.","definition":{"en":"(mainly British) Third-person singular of “prog”: to poke or prod (someone or something), often with a finger or a sharp object.","zh":"（主要英式）“prog”的第三人称单数：戳、捅、刺（人或物），常用手指或尖物。"},"examples":[{"en":"He progs the fire with a stick to keep it burning.","zh":"他用棍子拨弄火堆让它继续燃烧。"},{"en":"She progs him in the arm to get his attention.","zh":"她戳了戳他的胳膊引起注意。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Progressive rock music or things related to it (short for “prog”).","zh":"（非正式）前卫摇滚（“prog”的简称）或与之相关的事物。"},"examples":[{"en":"He’s been listening to a lot of progs lately.","zh":"他最近听了很多前卫摇滚。"}]}],"synonyms":["programs","apps","software","poke","prod","jab"],"phonetic":"/prɑɡz/","extraExplanation":["“progs”最常见于口语/聊天里的缩写，用来省略“programs”。在正式写作里通常还是写全“programs”。","动词“prog”表示“戳/捅”时更偏英式用法；美式英语里更常用“poke / prod”。","音乐里的“prog”是“progressive rock（前卫摇滚）”的简称；语境通常会提到乐队、专辑或曲风。"]}
{"word":"proguanil","summary":{"en":"Proguanil is an antimalarial drug used to prevent or treat malaria, often in combination with other medicines.","zh":"Proguanil（丙胍）是一种抗疟药，常与其他药物联用，用于预防或治疗疟疾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antimalarial medicine, often used with other drugs (such as atovaquone) to prevent or treat malaria","zh":"一种抗疟药，常与其他药物（如阿托伐醌）联用，用于预防或治疗疟疾"},"examples":[{"en":"Proguanil is often combined with atovaquone for malaria prevention during travel.","zh":"旅行期间，为预防疟疾，丙胍常与阿托伐醌联合使用。"},{"en":"Ask a clinician how to take proguanil and for how long after leaving a malaria-risk area.","zh":"请咨询临床医生：丙胍该怎么服用，以及离开疟疾风险地区后需要继续服用多久。"}]}],"synonyms":["antimalarial drug","malaria prophylaxis medicine"],"phonetic":"/proʊˈɡwɑːnɪl/","extraExplanation":["“Proguanil”是药物通用名（generic name），在一些地区也可能以复方药出现，例如“atovaquone/proguanil”。它属于医学/药学词汇，日常英语中多出现在处方、旅行门诊建议、药品说明书等语境。","用药相关信息会因地区耐药情况、个人健康状况与是否怀孕/哺乳等因素而不同；学习词义之余，实际使用务必以医生或药师指导为准。"]}
{"word":"proguardian","summary":{"en":"“ProGuardian” is a non-standard coined term/name meaning supportive of guardianship or protective like a guardian.","zh":"“ProGuardian”多为自造词/名称，含义偏“支持监护/守护”或“像监护人一样保护”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A coined or brand-like term meaning “in favor of being a guardian” or “supporting/protecting like a guardian.” It is not a standard dictionary word and is often used as a name (e.g., an app, service, team, or username).","zh":"一个自造词或品牌式用语，通常表示“支持担任监护人/守护者”或“像监护人一样保护”。它不是常见词典词条，更多用作名称（如应用、服务、团队或用户名）。"},"examples":[{"en":"The nonprofit launched ProGuardian to help families understand legal guardianship.","zh":"该非营利机构推出了 ProGuardian，帮助家庭了解法定监护。"},{"en":"Her ProGuardian account posts safety tips for students.","zh":"她的 ProGuardian 账号发布面向学生的安全提示。"}]},{"partOfSpeech":"adj.","definition":{"en":"(As a descriptive label) relating to protective oversight, safety, or guardianship—emphasizing prevention and support.","zh":"（作描述性标签）与保护性监管、安全或监护有关——强调预防与支持。"},"examples":[{"en":"The clinic uses a proguardian approach to elder care, focusing on prevention.","zh":"这家诊所采用“proguardian式”的长者照护方式，侧重预防。"}]}],"synonyms":["protector","guardian","safeguard","protect","protection-focused"],"phonetic":"/proʊˈɡɑrdiən/","extraExplanation":["这个词看起来由前缀 pro-（“支持、赞成”）+ guardian（“监护人/守护者”）组合而来。英语里常见类似构词，如 pro-democracy（支持民主）、pro-environment（支持环保）。\n\n如果你是在某个产品、游戏、社群或网站里看到 ProGuardian，它更可能是专有名称；此时大小写通常写作 ProGuardian。","在文学或固定习语中并不常见；若要用更自然的英语表达“守护/保护”，可以用 protect, safeguard, guardian, protector 等更常见词。"]}
{"word":"progymnasium","summary":{"en":"A (European, especially German) preparatory secondary school/track leading to a Gymnasium.","zh":"（欧洲尤其德国）通向 Gymnasium 的预备性中学/学制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in some European countries, especially Germany) a secondary school or school track that prepares younger students for an academic high school (a Gymnasium).","zh":"（在一些欧洲国家，尤指德国）为进入学术型高中（Gymnasium）做准备的中学/学制（通常面向较低年级学生）。"},"examples":[{"en":"After primary school, she entered a progymnasium and later moved on to a Gymnasium.","zh":"小学毕业后，她进入了一所 progymnasium，后来又升入了 Gymnasium。"},{"en":"The town’s progymnasium offered Latin and advanced math to prepare students for higher studies.","zh":"这座小镇的 progymnasium 开设拉丁语和高等数学，帮助学生为更高阶段的学习做准备。"}]}],"synonyms":["preparatory school (context-dependent)","pre-Gymnasium (informal)"],"phonetic":"/ˌproʊdʒɪmˈneɪziəm/","extraExplanation":["这个词主要出现在欧洲教育语境中，不同国家/地区制度不完全一致；在德国历史上，“Progymnasium”常指未覆盖完整年级或尚未具备完整办学资格的“准 Gymnasium”，学生之后通常需要转入完整的 Gymnasium 才能继续走大学预科路线。","词源上，“pro-”有“在……之前/预备”的意思，“gymnasium”在德语里指学术型中学（不是体育馆）。"]}
{"word":"progymnosperm","summary":{"en":"An extinct Devonian plant group with gymnosperm-like wood but spore reproduction.","zh":"已灭绝的泥盆纪植物类群：有类似裸子植物的木质结构，但以孢子繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group of Devonian plants that had wood like gymnosperms but reproduced by spores (not seeds), often seen as a bridge between ferns and seed plants","zh":"前裸子植物（已灭绝的一类泥盆纪植物）：具有类似裸子植物的木质部/木材特征，但通过孢子而不是种子繁殖，常被视为从蕨类到种子植物的过渡类群"},"examples":[{"en":"Scientists study progymnosperms to understand how early forests evolved.","zh":"科学家研究前裸子植物，以了解早期森林是如何演化的。"},{"en":"Archaeopteris is a famous example often discussed in connection with progymnosperms.","zh":"始祖树（Archaeopteris）是讨论前裸子植物时常提到的著名例子。"}]}],"synonyms":["(related) early woody spore plants","(related) Archaeopteris (example)"],"phonetic":"/ˌproʊdʒɪmnoʊˈspɝːm/","extraExplanation":["词源提示：pro- 表示“在……之前/早期”，gymnosperm 表示“裸子植物”。因此 progymnosperm 字面含义是“早期/前（阶段的）裸子植物”。","学术语境中它通常指泥盆纪（约4亿年前）的一些维管植物类群：它们能形成“木材”（次生木质部），但生命周期仍以“孢子繁殖”为主，尚未出现真正的种子。"]}
{"word":"progymnospermic","summary":{"en":"An academic adjective meaning “having features like progymnosperms,” transitional between ferns and early gymnosperms.","zh":"学术用形容词，指“具有前裸子植物特征”，在蕨类与早期裸子植物之间呈过渡性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a progymnosperm—an extinct group of Devonian-era plants that had fern-like reproduction (spores) but gymnosperm-like wood (secondary growth).","zh":"与“前裸子植物”（一种已灭绝的泥盆纪植物类群）有关或类似：它们在繁殖上像蕨类（用孢子），但在结构上像裸子植物（具有类似裸子植物的木质部与次生生长）。"},"examples":[{"en":"Some Devonian fossils show progymnospermic features, such as strong woody stems but spore-based reproduction.","zh":"一些泥盆纪化石显示出前裸子植物式（progymnospermic）的特征，例如粗壮的木质茎，但仍以孢子繁殖。"},{"en":"Researchers described the specimen as progymnospermic because its anatomy bridges ferns and early seed plants.","zh":"研究人员将该标本描述为前裸子植物式，因为它的解剖结构连接了蕨类与早期种子植物之间的过渡。"}]}],"synonyms":["progymnospermous"],"phonetic":"/ˌproʊdʒɪmˌnoʊˈspɝːmɪk/","extraExplanation":["“progymnospermic”主要用于古植物学/植物进化语境，强调“过渡性特征”。常见参照类群包括泥盆纪的 Archaeopteris（有树木般的木材结构，但仍以孢子繁殖）。","相关词：progymnosperm（名词，前裸子植物），progymnospermous（形容词，同义/近义）。"]}
{"word":"progymnospermous","summary":{"en":"An adjective meaning “related to or resembling progymnosperms,” an extinct group important in plant evolution.","zh":"形容词：指“与前裸子植物有关或类似前裸子植物”，常用于描述植物演化中重要的已灭绝类群特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a progymnosperm (an extinct group of early seed-plant relatives with fern-like reproduction but woody growth).","zh":"与前裸子植物（已灭绝的一类早期种子植物近亲，繁殖上类似蕨类但具有木质生长）有关的；类似前裸子植物的。"},"examples":[{"en":"The fossil wood shows progymnospermous features, suggesting an early step toward seed plants.","zh":"这些化石木材表现出前裸子植物的特征，暗示它们是向种子植物演化的早期一步。"},{"en":"Researchers described the specimen as progymnospermous based on its branching pattern and secondary xylem.","zh":"研究人员根据其分枝模式和次生木质部，将该标本描述为前裸子植物型（progymnospermous）。"}]}],"synonyms":["progymnosperm (related)","gymnospermous (related)","seed-plant–like (informal)"],"phonetic":"/ˌproʊdʒɪmnoʊˈspɝːməs/","extraExplanation":["“Progymnospermous”来自 pro-（在……之前、早期的）+ gymnosperm（裸子植物）。该词多用于古植物学/化石植物学，强调一种“介于蕨类与裸子植物之间”的特征组合：例如有发达的木质部（像树木一样增粗生长），但繁殖方式可能仍以孢子为主（不像真正的种子植物）。常见代表类群如泥盆纪的 Archaeopteris（始祖树）。","在现代植物分类里几乎不会用来描述现生植物；它更多是对化石材料的形态与演化位置做“相似性”判断时使用的形容词。"]}
{"word":"progypsy","summary":{"en":"Progypsy (often written pro-Gypsy) means supportive of Romani (Roma) people or their rights.","zh":"progypsy（常写作 pro-Gypsy）指支持罗姆人（Roma）或支持其权益的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring Gypsies (Romani people); advocating for the rights or positive treatment of Romani communities.","zh":"支持或偏向“吉普赛人”（罗姆人/罗姆民族）；主张罗姆社群权益或更友善对待罗姆人的。"},"examples":[{"en":"The organization is openly pro-Gypsy and works to reduce discrimination against Roma communities.","zh":"这个组织公开支持罗姆人，并致力于减少对罗姆社群的歧视。"},{"en":"Her pro-Gypsy stance focuses on equal access to housing and education.","zh":"她的亲罗姆立场重点关注住房与教育的平等机会。"}]}],"synonyms":["pro-Roma","pro-Romani","Roma-friendly","supportive of Roma rights"],"phonetic":"/proʊˈdʒɪpsi/","extraExplanation":["“progypsy”更常写作带连字符的“pro-Gypsy”。需要注意：英语里“Gypsy”在一些语境中可能被视为带偏见或冒犯性的称呼，尤其当它被用来泛化刻板印象时。更中性、尊重的用法通常是“Roma / Romani people（罗姆人/罗姆民族）”。如果你想表达支持立场，也可以说“pro-Roma / pro-Romani”来避免不必要的冒犯。"]}

