{"word":"projacient","summary":{"en":"A rare adjective meaning “projecting forward” or “lying in front.”","zh":"一个罕见的形容词，表示“向前突出”或“位于前方”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Projecting or extending forward; lying in front of something.","zh":"（罕见/技术用语）向前突出的；位于某物前方的。"},"examples":[{"en":"In some older anatomy texts, the nasal bone is described as projacient to nearby structures.","zh":"在一些较早的解剖学教材中，鼻骨被描述为在附近结构之前、较为前突。"},{"en":"The castle’s projacient tower made it easier to watch the road below.","zh":"城堡那座向前突出的塔楼让人更容易观察下方的道路。"}]}],"synonyms":["projecting","protruding","jutting","prominent","forward"],"phonetic":"/proʊˈdʒeɪʃənt/","extraExplanation":["“projacient”在现代英语里非常少见，多见于旧文献或特定领域（如解剖学、几何/描述性写作）。更常见的现代替代词有：projecting（突出）、protruding（凸出）、jutting（伸出）。","词源上可理解为“向前抛/掷”（拉丁语 jacere “to throw” 的相关词根），含义与“project（投射/突出）”在概念上相近。","拼写上也常与更常见的近形词混淆，如 projacent / projecient。若你是在某篇文章里看到它，发我句子我可以帮你判断最合适的现代替换表达。"]}
{"word":"project","summary":{"en":"“Project” most commonly means a planned piece of work with a clear goal; as a verb it can mean to plan, to show on a screen, or to predict.","zh":"“project”最常指有明确目标的项目/课题；作动词可表示规划组织、投影展示或预测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A planned piece of work with a specific goal, usually done over a period of time (often by a team).","zh":"（通常由团队在一段时间内完成的）项目；计划性的工作，具有明确目标。"},"examples":[{"en":"Our class project is to make a poster about recycling.","zh":"我们的课堂项目是制作一张关于回收的海报。"},{"en":"The company started a new project to improve customer service.","zh":"公司启动了一个新项目来提升客户服务。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan and organize a piece of work, especially a large task (often used in business or engineering).","zh":"规划并组织（某项工作/任务），尤指较大的工程或商业任务。"},"examples":[{"en":"The manager will project the timeline and budget for the launch.","zh":"经理将为发布计划排出时间表和预算。"}]},{"partOfSpeech":"vt.","definition":{"en":"To show an image or video on a screen using a projector.","zh":"用投影仪把图像或视频投到屏幕上。"},"examples":[{"en":"They projected the slides onto the wall.","zh":"他们把幻灯片投影到墙上。"}]},{"partOfSpeech":"vt.","definition":{"en":"To estimate or predict something in the future based on current information.","zh":"根据现有信息估算/预测（未来情况）。"},"examples":[{"en":"Experts project that prices will rise next year.","zh":"专家预测明年价格会上涨。"}]},{"partOfSpeech":"vt.","definition":{"en":"To imagine or express your feelings, fears, or ideas as if they belong to someone else (psychology).","zh":"（心理学）把自己的情绪、恐惧或想法“投射”到别人身上；以为别人也有同样的感受。"},"examples":[{"en":"He was projecting his own insecurity onto his coworkers.","zh":"他把自己的不安全感投射到了同事身上。"}]}],"synonyms":["plan","assignment","task","initiative","predict","forecast","display"],"phonetic":"/ˈprɑːdʒekt/","extraExplanation":["“project”作名词时最常见，学习场景里常指“作业/课题”。作动词时含义较多：商业语境常用“project costs/sales”（预测成本/销量）；课堂或会议里常见“project the slides”（投影幻灯片）。","词形小提示：名词重音在前（PRO-ject），动词常重音在后（pro-JECT），口语中能帮助你区分。"]}
{"word":"projectable","summary":{"en":"“Projectable” describes something that can be projected for display, or (technically) can be projected/mapped in geometry or cartography.","zh":"“Projectable”指某物适合/能够被投影显示；在技术语境中也指可进行几何或制图投影（映射）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be projected or displayed onto a surface (such as a screen) using a projector","zh":"可用投影机投射到屏幕/表面上的；可投影显示的"},"examples":[{"en":"Use a projectable image format for the classroom presentation.","zh":"课堂演示请使用可投影显示的图像格式。"},{"en":"The teacher asked for projectable slides with large text.","zh":"老师要求幻灯片要适合投影，字体要大。"}]},{"partOfSpeech":"adj.","definition":{"en":"(technical) able to be mapped or projected from one surface or space to another (as in geometry or cartography)","zh":"（技术/数学）可做映射/投影的；可投影到另一表面或空间的（如几何、制图）"},"examples":[{"en":"Some shapes are projectable onto a plane without losing key properties.","zh":"有些形状可以投影到平面上而不失去关键性质。"},{"en":"The method works only for projectable surfaces.","zh":"这种方法只适用于可投影的曲面。"}]}],"synonyms":["projectible","displayable (on a screen)","suitable for projection"],"phonetic":"/prəˈdʒɛk.tə.bəl/","extraExplanation":["“projectable”在日常英语里不算特别常用，但在教育科技（课件、图片、字体是否适合投影）和数学/制图（projection 投影、映射）语境中很常见。","词形上是 project（投影/投射）+ -able（“能够……的”），常和 image, slides, format, surface 等词搭配。"]}
{"word":"projected","summary":{"en":"“Projected” most often means ‘estimated/expected for the future,’ and it can also mean ‘shown by a projector’ or ‘sticking out.’ It is also the past form of “project.”","zh":"“Projected”最常见意思是“预计的/预测的”，也可指“投影显示的”或“突出的/外伸的”，并且还是动词“project”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Estimated or expected in the future, based on current information (often used for numbers like cost, sales, or temperature).","zh":"（形）根据现有信息对未来作出的估计或预测（常用于成本、销量、气温等数据）。"},"examples":[{"en":"The projected cost of the project is $2 million.","zh":"该项目的预计成本是200万美元。"},{"en":"Meteorologists say the projected high tomorrow is 30°C.","zh":"气象学家说，明天的预计最高气温是30℃。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Shown on a surface (like a screen or wall) using light, as in a movie or presentation.","zh":"（形）用投影方式显示在屏幕或墙面上的。"},"examples":[{"en":"The projected image was blurry, so we adjusted the focus.","zh":"投影画面有点模糊，所以我们调整了焦距。"},{"en":"Please read the projected slide and answer the questions.","zh":"请阅读投影出来的幻灯片并回答问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Sticking out or extending outward from a surface.","zh":"（形）突出的；向外伸出的。"},"examples":[{"en":"A projected beam supported the roof.","zh":"一根外伸的梁支撑着屋顶。"},{"en":"The building has projected balconies overlooking the street.","zh":"这栋楼有向外伸出的阳台，俯瞰街道。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of “project”: to estimate or predict; to plan and show what may happen in the future.","zh":"（动）“project”的过去式/过去分词：估算、预测；推测并展示未来可能发生的情况。"},"examples":[{"en":"They projected a 10% increase in revenue next year.","zh":"他们预测明年收入将增长10%。"},{"en":"The team projected the timeline and shared it with clients.","zh":"团队预估了时间表并与客户分享。"}]}],"synonyms":["estimated","expected","predicted","forecast","anticipated","planned"],"phonetic":"/prəˈdʒɛktɪd/","extraExplanation":["“projected”在商业/财务语境中非常常见：projected sales（预计销量）、projected revenue（预计收入）、projected expenses（预计支出）。它表示“基于假设与数据的预测”，不等于保证会发生。","和 forecast 的差别：forecast 常用于天气、经济等“预测”；projected 更强调“根据模型/计划推算出来的预计数值”。"]}
{"word":"projectedly","summary":{"en":"“Projectedly” means “according to a projection/forecast; expected to happen in the future.”","zh":"“Projectedly”表示“按照预测/推算：预计将会发生”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is expected or estimated to happen in the future (based on a projection or forecast).","zh":"以预测的方式；按照推算/预估的结果（将会）发生。"},"examples":[{"en":"Sales are projectedly higher in the second quarter because of the new product launch.","zh":"由于新产品发布，第二季度的销售额预计会更高。"},{"en":"The company is projectedly profitable by 2027 if costs stay stable.","zh":"如果成本保持稳定，这家公司预计在2027年前后实现盈利。"}]}],"synonyms":["according to projections","as projected","predictedly","expectedly","forecastedly"],"phonetic":"/prəˈdʒɛktɪdli/","extraExplanation":["“projectedly”较少见，也偏正式，常出现在商业、财经、数据预测类写作中；更常见的表达通常是“is projected to…”（被预测将……）、“according to projections”（根据预测）、“expectedly/likely/predicted”之类。","词源上来自动词“project”（预测、规划）加上副词后缀“-edly”，强调“根据推算结果而言”。在日常口语中用它会显得生硬，写作时可优先选用更自然的结构。"]}
{"word":"projectile","summary":{"en":"A projectile is something thrown or fired through the air; in science, it relates to objects in “projectile motion.”","zh":"projectile 指被投掷或射出的抛射物/射弹；在理科语境中常与“抛体运动”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An object that is thrown or fired through the air, especially as a weapon (for example, a bullet, arrow, or rock).","zh":"抛射物；（尤指武器的）射弹（如子弹、箭、石块等）"},"examples":[{"en":"The gun fired a projectile at high speed.","zh":"枪以高速射出一枚射弹。"},{"en":"A stone became a dangerous projectile in the strong wind.","zh":"在强风中，一块石头可能变成危险的抛射物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving forward through the air after being thrown or fired.","zh":"抛射的；被投出或射出后在空中前进的"},"examples":[{"en":"The engineers studied projectile motion.","zh":"工程师研究抛体运动。"},{"en":"The projectile path curved downward because of gravity.","zh":"由于重力作用，抛射轨迹向下弯曲。"}]}],"synonyms":["missile","bullet","shot","munition","rocket"],"phonetic":"/prəˈdʒek.təl/","extraExplanation":["“Projectile”常见于两个语境：\n1）日常/新闻：指“飞来的东西”，尤其与武器、暴力事件相关；\n2）理工/物理：与“projectile motion（抛体运动）”搭配，强调受重力影响的运动轨迹。","词源提示：来自拉丁语词根 *pro-*（向前）+ *iacere*（投掷），核心感觉是“向前掷出去的东西”。","搭配很常见：a projectile weapon（投射武器）、projectile motion/trajectory（抛体运动/弹道轨迹）、high-velocity projectile（高速射弹）。"]}
{"word":"projectiles","summary":{"en":"“Projectiles” is the plural of “projectile”: objects thrown or fired through the air, especially bullets or other missiles; also anything launched with force in general.","zh":"projectiles 是 projectile 的复数：指被投掷或发射、在空中飞行的物体，尤指子弹等弹射物；也可泛指任何被施力抛出/射出的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An object that is thrown or fired through the air, especially a weapon’s missile (such as a bullet, arrow, or shell).","zh":"被投掷或发射、在空中飞行的物体，尤指武器的弹射物（如子弹、箭、炮弹等）。"},"examples":[{"en":"The police recovered several projectiles from the wall.","zh":"警方从墙里取出了几枚弹射物。"},{"en":"In physics class, we studied the path of a projectile moving under gravity.","zh":"在物理课上，我们学习了在重力作用下弹射体的运动轨迹。"},{"en":"Arrows and stones were common projectiles in ancient battles.","zh":"在古代战争中，箭和石块是常见的投射物。"}]},{"partOfSpeech":"n.","definition":{"en":"Anything launched forward with force, not necessarily a weapon (for example, a ball or debris).","zh":"任何被施力向前抛出或射出的东西，不一定是武器（例如球或碎片）。"},"examples":[{"en":"The strong wind turned loose branches into dangerous projectiles.","zh":"强风把松动的树枝变成了危险的飞来物。"},{"en":"A baseball becomes a projectile the moment it leaves the pitcher’s hand.","zh":"棒球离开投手手的那一刻就成了抛射体。"}]}],"synonyms":["missiles","shots","bullets","shells","objects","debris"],"phonetic":"/prəˈdʒek.taɪlz/","extraExplanation":["“Projectile”常见于两类语境：①日常/新闻里的武器相关（bullet, shell 等）；②科学/物理里的“抛射体运动”（projectile motion），强调在重力等作用下的轨迹（trajectory）。","词形提示：projectile 是单数；projectiles 是复数。发音上常见两种重音：名词多为 /prəˈdʒek.taɪl/（更常见），形容词有时读 /ˈprɑː.dʒek.t̬əl/（如 projectile vomiting 这个固定搭配里常见形容词读法）。"]}
{"word":"projecting","summary":{"en":"“Projecting” can mean sticking out, showing an image on a screen, estimating the future, presenting an impression, or (in psychology) attributing your feelings to others.","zh":"“Projecting”可指：凸出、投影、预测、展现形象，或（心理学）把自己的感受投射到别人身上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) sticking out or extending forward/outward from a surface or line.","zh":"（某物）凸出的；向外伸出的。"},"examples":[{"en":"A projecting ledge offered a little shade.","zh":"一个凸出的岩架提供了一点阴凉。"},{"en":"Be careful of the projecting nail.","zh":"小心那颗突出的钉子。"}]},{"partOfSpeech":"v.","definition":{"en":"showing or displaying an image or sound onto a surface (like a screen) using a device.","zh":"（用设备）把影像或声音投射到某个表面（如屏幕）上。"},"examples":[{"en":"They are projecting the movie onto a large screen.","zh":"他们正在把电影投射到大屏幕上。"},{"en":"The teacher is projecting the slides for the class.","zh":"老师正在为全班投影幻灯片。"}]},{"partOfSpeech":"v.","definition":{"en":"estimating or predicting something in the future, often using current data.","zh":"（根据现有数据）预测；推算（未来情况）。"},"examples":[{"en":"She is projecting next month’s sales based on this week’s numbers.","zh":"她正在根据本周的数据预测下个月的销售额。"},{"en":"The report is projecting a slow recovery.","zh":"报告预测复苏会比较缓慢。"}]},{"partOfSpeech":"v.","definition":{"en":"presenting yourself or an idea in a particular way to others; giving a certain impression.","zh":"（对外）展现（形象/观点）；给人某种印象。"},"examples":[{"en":"He is projecting confidence during the interview.","zh":"他在面试中展现出自信。"},{"en":"The brand is projecting a friendly image.","zh":"这个品牌在塑造亲切的形象。"}]},{"partOfSpeech":"v.","definition":{"en":"(psychology) unconsciously attributing your own feelings, fears, or motives to someone else.","zh":"（心理学）投射：把自己的感受、恐惧或动机不自觉地归到别人身上。"},"examples":[{"en":"She was projecting her anxiety onto her coworkers.","zh":"她把自己的焦虑投射到同事身上。"},{"en":"Stop projecting—ask what he actually meant.","zh":"别再投射了——直接问他到底是什么意思。"}]}],"synonyms":["jutting","protruding","extending","casting","displaying","forecasting","predicting","portraying","communicating","attributing"],"phonetic":"/prəˈdʒɛktɪŋ/","extraExplanation":["“projecting”常见有两种身份：\n1) 形容词：projecting + 名词（a projecting balcony 凸出的阳台）。\n2) 动词现在分词：be projecting（正在投影/预测/展现/投射）。\n语境不同，含义差别很大。"]}
{"word":"projectingly","summary":{"en":"“Projectingly” is a rare adverb meaning “sticking out/extended forward,” and sometimes “projecting one’s feelings or assumptions onto others.”","zh":"“Projectingly”是很少见的副词，主要表示“向外突出/向前伸出”，有时也指“把自己的情绪或想法投射到他人身上”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that sticks out or extends forward; protrudingly","zh":"以向外突出的方式；向前伸出的样子"},"examples":[{"en":"The shelf was mounted so that it jutted projectingly from the wall.","zh":"这个架子被安装得从墙上向外突出。"},{"en":"A small ledge ran projectingly beneath the window.","zh":"窗下有一条向外伸出的窄檐。"}]},{"partOfSpeech":"adv.","definition":{"en":"(less common) in a way that projects ideas, feelings, or expectations onto someone or something","zh":"（较少见）以“投射”的方式把自己的想法、情绪或期待加在别人或事物上"},"examples":[{"en":"He spoke projectingly, assuming everyone would share his excitement.","zh":"他说话带着“投射”，以为大家都会和他一样兴奋。"},{"en":"Try not to read projectingly into her silence; she may just be tired.","zh":"别用“投射”的方式解读她的沉默；她可能只是累了。"}]}],"synonyms":["protrudingly","juttingly","outward","forward","assumptively"],"phonetic":"/prəˈdʒɛktɪŋli/","extraExplanation":["“projectingly”非常少见，多用于较旧或较文学化的写法。更常见的表达是“protrudingly / jutting out / extending outward”。","词形上，它是由动词“project（伸出；投射）”加上副词后缀“-ingly”构成，表示“以……的方式”。","如果你是写作学习者，日常英语里建议改用更常用的副词或短语来避免生硬。"]}
{"word":"projection","summary":{"en":"Projection most commonly means a future estimate (a projection) or an image shown on a screen; it can also mean a map method or a psychology term.","zh":"Projection最常指“对未来的预测/估算”或“投影画面/投影行为”；也可指“地图投影法”或心理学中的“投射”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a guess or estimate about what will happen in the future, based on current information (often about numbers like sales, costs, or population)","zh":"基于现有信息对未来的推测或估算（常用于销售、成本、人口等数据）"},"examples":[{"en":"Our sales projections for next year are optimistic.","zh":"我们对明年的销售预测很乐观。"},{"en":"The report includes population projections through 2050.","zh":"这份报告包含截至2050年的人口预测。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of showing an image or video on a screen, or the image that is shown (often using a projector)","zh":"投影；把图像/视频投到屏幕上的行为，或投出的画面（常用投影仪）"},"examples":[{"en":"The classroom has a projector for video projection.","zh":"教室里有投影仪用来播放投影画面。"},{"en":"The projection was too dim to read.","zh":"投影太暗了，看不清。"}]},{"partOfSpeech":"n.","definition":{"en":"a map or diagram method of representing the round Earth on a flat surface","zh":"（地图）投影法；把球形地球表示在平面上的方法"},"examples":[{"en":"The Mercator projection distorts areas near the poles.","zh":"墨卡托投影会把靠近两极的面积夸大变形。"},{"en":"Different map projections are used for different purposes.","zh":"不同的地图投影适用于不同用途。"}]},{"partOfSpeech":"n.","definition":{"en":"(psychology) the act of attributing your own feelings or motives to someone else","zh":"（心理学）投射：把自己的感受或动机归因到别人身上"},"examples":[{"en":"Saying “everyone is against me” can be a form of projection.","zh":"说“大家都在针对我”可能是一种投射。"},{"en":"Therapy helped him notice when he was using projection.","zh":"治疗帮助他意识到自己什么时候在进行投射。"}]}],"synonyms":["forecast","estimate","prediction","display","screening"],"phonetic":"/prəˈdʒekʃən/","extraExplanation":["在日常英语里，projection最常见的两类是“预测/估算”（business projections）和“投影画面/投影行为”（video projection）。注意和predict（动词：预测）、forecast（名词/动词：预测，常用于天气或经济）区分。","“地图投影”（map projection）在地理与新闻语境里很常见，也常引发文化讨论：不同投影会造成面积或形状的视觉偏差，影响人们对国家大小与位置的直观印象。"]}
{"word":"projectional","summary":{"en":"Projectional means “related to projection,” used in contexts like image projection, psychological projection, or mathematical/map projection.","zh":"projectional 意为“与投射/投影有关的”，可用于影像投影、心理投射或数学/地图投影等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to projecting something (showing or throwing an image, light, or sound onto another surface).","zh":"与“投射/投影”有关的（把影像、光线或声音投到另一表面上）。"},"examples":[{"en":"The museum installed a projectional system to display animations on the wall.","zh":"博物馆安装了一套投影系统，把动画展示在墙面上。"},{"en":"Projectional lighting can change the mood of a room quickly.","zh":"投影式灯光可以很快改变房间的氛围。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology, relating to projection—attributing your own feelings or motives to someone else.","zh":"（心理学）与“投射”有关的：把自己的情绪或动机归因到他人身上。"},"examples":[{"en":"His accusation sounded projectional, as if he was describing his own behavior.","zh":"他的指责听起来像是一种投射，仿佛在描述他自己的行为。"},{"en":"The therapist noted a projectional pattern in how she interpreted her coworkers’ intentions.","zh":"治疗师指出，她解读同事意图的方式带有投射性的模式。"}]},{"partOfSpeech":"adj.","definition":{"en":"In mathematics or mapping, relating to a projection (a method of representing a shape or the Earth on another surface).","zh":"（数学/制图）与“投影”有关的：把形状或地球表面用某种方法表示在另一表面上。"},"examples":[{"en":"The article compares projectional methods used in different map designs.","zh":"这篇文章比较了不同地图设计中使用的投影方法。"},{"en":"Projectional geometry studies properties that stay the same under projection.","zh":"射影几何研究在投影变换下保持不变的性质。"}]}],"synonyms":["projective","projected","relating to projection"],"phonetic":"/prəˈdʒɛkʃənəl/","extraExplanation":["“projectional”在日常英语中不算常见，更常见的是“projected / projection / projective”。在不同学科里，它的含义会随语境变化：影视与展陈偏“投影显示”，心理学偏“心理投射”，数学与制图偏“（射）影/地图投影”。写作时尽量给出领域线索（如 lighting, therapy, geometry, map），读者更容易理解。"]}
{"word":"projectionist","summary":{"en":"A projectionist is the person who runs the projector to show films or other projected visuals.","zh":"projectionist 指操作放映/投影设备、负责播放电影或投影画面的人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who operates a movie projector and shows films in a cinema (traditionally from a projection booth).","zh":"电影放映员；负责操作放映机、在电影院放映电影的人（传统上在放映室工作）。"},"examples":[{"en":"The projectionist started the film right on time.","zh":"放映员准时开始放电影。"},{"en":"If the picture goes out of focus, the projectionist can adjust it.","zh":"如果画面失焦，放映员可以进行调整。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, someone who manages or presents projected images (for example, slides or digital projections) at an event or in a theater setting.","zh":"（广义）负责投影展示的人（例如在活动或剧场中管理幻灯片或数字投影）。"},"examples":[{"en":"At the conference, a projectionist handled the slides for each speaker.","zh":"在会议上，有人负责为每位演讲者操作投影幻灯片。"},{"en":"The theater hired a projectionist to run the visuals during the show.","zh":"剧院雇了投影操作人员在演出期间播放视觉影像。"}]}],"synonyms":["film projectionist","projection operator","cinema projectionist"],"phonetic":"/prəˈdʒɛkʃənɪst/","extraExplanation":["“projectionist”在老式电影院文化中很常见：放映员会更换胶片卷、调焦、调亮度，还要处理胶片断裂等突发状况。随着数字放映普及，这个职业在一些地方减少了，但在艺术影院、电影节和胶片放映（如35mm、70mm）场景里仍很重要。","词源上来自“project（投射）+ -ion + -ist（从事某事的人）”。相关词：projector（投影机/放映机）、projection booth（放映室）、screening（放映/展映）。"]}
{"word":"projectionists","summary":{"en":"“Projectionists” are people who operate projectors—especially those who show movies in theaters.","zh":"“projectionists”指操作投影设备的人，尤指在电影院负责放映电影的放映员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to operate a movie projector and show films (traditionally in a movie theater).","zh":"放映员；电影放映师（传统上在电影院操作放映机的人）。"},"examples":[{"en":"The projectionist started the film right on time.","zh":"放映员准时开始放映电影。"},{"en":"In older theaters, projectionists had to change reels during the movie.","zh":"在较老的电影院里，放映员需要在电影播放过程中更换胶片盘。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who presents images or slides using a projector (for example, in a classroom or at an event).","zh":"投影操作人员；幻灯放映者（在课堂或活动中用投影设备展示图片/幻灯的人）。"},"examples":[{"en":"At the conference, a projectionist managed the slides behind the stage.","zh":"在会议上，一名投影操作人员在舞台后面管理幻灯片。"}]}],"synonyms":["movie projectionists","film projectionists","projection operators"],"phonetic":"/prəˈdʒekʃənɪsts/","extraExplanation":["“projectionist”来自“project（投射/放映）+ -ion + -ist（从事某职业的人）”。在数字放映普及之前，电影院放映是一门很专业的工种：要校准画面与声音、控制亮度、并在合适时间换片。","在一些电影文化语境里，projectionist常带有“幕后守护者”的意味：观众看见的是银幕，但放映员在看不见的地方维持整场电影顺利进行。"]}
{"word":"projections","summary":{"en":"Projections are usually future estimates or predictions; they can also mean images shown on a screen, or (in psychology) attributing your feelings to others.","zh":"projections 通常指对未来的估算/预测；也可指投影/放映的影像；在心理学中还指把自身情绪或问题“投射”到别人身上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prediction or estimate about what will happen in the future, based on current information (often numbers like sales, costs, or population).","zh":"（基于现有信息作出的）预测；推算（常指销量、成本、人口等数字）"},"examples":[{"en":"Our sales projections for next quarter are higher than last year’s.","zh":"我们对下个季度的销量预测比去年更高。"},{"en":"The report includes projections of inflation and unemployment.","zh":"这份报告包含对通货膨胀和失业率的预测。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of showing an image or video on a screen, or the image that is shown that way.","zh":"投影；放映；（被投射/放映的）影像"},"examples":[{"en":"The projections on the wall made the room feel like a museum exhibit.","zh":"墙上的投影让房间感觉像博物馆展区。"},{"en":"Please turn off the lights so we can see the projection clearly.","zh":"请把灯关掉，这样我们才能更清楚地看到投影。"}]},{"partOfSpeech":"n.","definition":{"en":"In psychology, the act of unconsciously attributing your own feelings or faults to someone else.","zh":"（心理学）投射：把自己的情绪或缺点无意识地归因到别人身上"},"examples":[{"en":"Sometimes anger at others is a projection of your own stress.","zh":"有时对他人的愤怒是你自身压力的投射。"},{"en":"The therapist suggested his accusations might be projections.","zh":"治疗师认为他的指责可能是一种投射。"}]}],"synonyms":["forecasts","estimates","predictions","outlooks","screenings"],"phonetic":"/prəˈdʒekʃənz/","extraExplanation":["“Projection(s)”在职场里非常常见，尤其在商业与数据语境中：sales projections（销量预测）、revenue projections（营收预测）、budget projections（预算推算）。通常暗示“有依据的估算”，但不保证一定发生。","“projection”还有“放映/投影”的意思，和 projector（投影仪）同词根；在会议室里说 “the projection isn’t working” 通常指投影画面出问题。","心理学的“projection（投射）”在日常对话里偶尔也会用，常见说法是 “You’re projecting.”（你在投射），语气可能带点指责，表示对方把自己的问题怪到别人身上。"]}
{"word":"projective","summary":{"en":"Projective means ‘related to projection or mapping’ (common in geometry/art) or, in psychology, ‘related to projective tests’ using ambiguous stimuli.","zh":"Projective 指“与投影/映射有关的”（常见于几何/艺术），或在心理学中指“与投射测验有关的”（用模糊刺激引发解释）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to mapping, projection, or representing something on a different space or surface (especially in math, art, or geometry).","zh":"与“投影/映射”有关的；指把事物表示到另一个空间或表面上（尤用于数学、艺术或几何）。"},"examples":[{"en":"In art class, we studied projective techniques to draw a 3D scene on a flat page.","zh":"在美术课上，我们学习了投影技巧，把三维场景画在平面纸上。"},{"en":"Projective geometry helps explain how perspective works in drawings.","zh":"射影几何有助于解释绘画中的透视原理。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology: relating to tests where people interpret unclear images or situations, which may reveal their feelings or personality.","zh":"（心理学）与“投射测验”有关的；指让人解释模糊图像或情境，从而可能反映其情绪或人格。"},"examples":[{"en":"The therapist used a projective test to explore the client’s emotions.","zh":"治疗师使用投射测验来了解来访者的情绪。"},{"en":"Some researchers debate how reliable projective methods are.","zh":"一些研究者会讨论投射方法的可靠性。"}]}],"synonyms":["projected (only in some contexts)","perspectival (art context)","projection-based"],"phonetic":"/prəˈdʒek.tɪv/","extraExplanation":["词源提示：projective 来自 project（投射、投影）。在数学语境里常见搭配是 projective geometry（射影几何）与 projective space（射影空间）；在心理学里常见搭配是 projective test / projective techniques（投射测验/投射技术）。","学习区分：projective（射影的/投影相关的）不同于 projected（被投影的；预计的）。例如：a projected cost（预计成本）不是 projective cost。"]}
{"word":"projectively","summary":{"en":"“Projectively” means “from a projective (projection-based) point of view,” mainly used in mathematics.","zh":"“projectively”主要用于数学，表示“从射影（投影）角度/用射影方法来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way related to projection or projective methods, especially in mathematics (projective geometry).","zh":"以“投影/射影”的方式；（尤指数学中）用射影几何的方法或观点来看。"},"examples":[{"en":"Two shapes can look different, but projectively they may be equivalent.","zh":"两个形状看起来不同，但从射影角度看，它们可能是等价的。"},{"en":"Projectively, parallel lines meet at a point at infinity in projective geometry.","zh":"在射影几何里，从射影观点看，平行线会在“无穷远点”相交。"},{"en":"The theorem is easiest to describe projectively rather than using distances and angles.","zh":"这个定理用射影方式来描述，比用距离和角度更容易。"}]}],"synonyms":["in projective terms","from a projective point of view","by projection"],"phonetic":"/prəˈdʒɛktɪvli/","extraExplanation":["“projectively”多见于数学/几何学术写作，指用射影几何（projective geometry）的框架来讨论性质。射影几何强调在投影变换下保持不变的关系（如“共线”“交点”），而不是长度、角度。","在日常英语中很少用到；更常见的表达是“from a projective point of view / in projective terms”。"]}
{"word":"projectivity","summary":{"en":"Projectivity usually means “the property of being projective,” especially in linguistics: structures that can be drawn without crossing links.","zh":"Projectivity 通常指“投射性/射影性”；在语言学中多指句法关系连线不交叉的结构性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) The property of a sentence structure in which words and their relationships can be drawn above the sentence without crossing lines; roughly, phrases form “continuous” spans.","zh":"（语言学）投射性：一种句法结构性质，指把词与词之间的依存/成分关系画成连线时不会出现交叉；大致对应“短语在句子中占连续区间”。"},"examples":[{"en":"Many dependency grammar parsers assume projectivity to simplify analysis.","zh":"许多依存语法解析器为了简化分析，会假设结构是投射的。"},{"en":"English allows some non-projective patterns, but they are less common than in some other languages.","zh":"英语也会出现一些非投射结构，但相比某些语言并不那么常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math/logic, statistics) The quality of being projective—related to projection or behaving well under projection (meaning depends on the field).","zh":"（数学/逻辑/统计等）投射性质：与“投影”或“在投影下保持某种性质”有关的特性（具体含义取决于学科与语境）。"},"examples":[{"en":"In projective geometry, researchers study projectivity and invariants under projection.","zh":"在射影几何中，研究者会讨论投射性质以及在投影下不变的量。"},{"en":"The paper discusses projectivity assumptions in the model.","zh":"这篇论文讨论了该模型中的投射性假设。"}]}],"synonyms":["projectiveness","projective property"],"phonetic":"/ˌprɑːdʒɛkˈtɪvəti/","extraExplanation":["“projectivity”来自形容词 projective（投射的/射影的）+ 名词后缀 -ity（……性）。在语言学里，它常和 dependency parsing（依存句法分析）一起出现：投射结构更容易用高效算法处理；而非投射（non-projective）结构常见于有自由语序、成分可远距离移位的语言。","如果你看到的上下文是语言学，相关对比词通常是 projective vs. non-projective（投射 vs. 非投射）；常见搭配有 projectivity constraint（投射性约束）、projectivity assumption（投射性假设）。","在数学里，“projectivity”有时也可指一种变换（射影变换）或与射影空间相关的性质；遇到该用法时，最好结合具体学科（如 projective geometry、projective transformation）来确定准确含义。"]}
{"word":"projector","summary":{"en":"A projector is a machine that projects images onto a screen or wall.","zh":"projector 指把图像/视频投到屏幕或墙上的“投影仪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that sends an image or video onto a screen or wall using light (often from a computer).","zh":"投影仪；投影机：用光把图像或视频投到屏幕或墙上的设备（常连接电脑）。"},"examples":[{"en":"The teacher turned on the projector to show the slides.","zh":"老师打开投影仪来展示幻灯片。"},{"en":"Can you connect your laptop to the projector?","zh":"你能把笔记本电脑连接到投影仪吗？"}]}],"synonyms":["projection unit","beamer (more common in British/European English)"],"phonetic":"/prəˈdʒɛktər/","extraExplanation":["常见搭配：projector screen（投影幕/屏幕）、overhead projector（老式“投影胶片”的投影仪，简称 OHP）、LCD projector / digital projector（数字投影仪）。","在会议或课堂语境里，projector 很常指“把电脑画面投出来”的设备；如果是电影放映，用词也可说 film projector（电影放映机）。"]}
{"word":"projectors","summary":{"en":"“Projectors” is the plural of “projector,” most commonly meaning devices that display images/video on a screen.","zh":"“projectors”是“projector”的复数，最常指把图像/视频投到屏幕上的投影设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that throws (projects) an image or video onto a screen or wall, often used in classrooms, offices, or home theaters.","zh":"投影仪；投影设备（把图像或视频投射到屏幕或墙面上，常用于教室、会议或家庭影院）"},"examples":[{"en":"The teacher turned off the lights and used the projector to show the slides.","zh":"老师关了灯，用投影仪展示幻灯片。"},{"en":"We bought a small projector for movie nights at home.","zh":"我们买了一台小投影仪，在家里看电影用。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that projects or puts forward an idea, plan, or image; someone who imagines or predicts something.","zh":"提出者；设想者（把想法/计划“投射”出去的人或事物；也可指预测、想象的人）"},"examples":[{"en":"In the story, he is a projector of grand plans but rarely finishes them.","zh":"在故事里，他总爱提出宏伟计划，但很少真正完成。"}]}],"synonyms":["beamers","projecting devices","image projectors"],"phonetic":"/prəˈdʒɛktər/","extraExplanation":["“projector”来自动词 project（投射；提出）。在现代英语里，最常见的意思是“投影仪”。在电影语境中也常见相关搭配，如 film projector（放映机，偏传统胶片）与 digital projector（数字投影仪）。"]}
{"word":"projectress","summary":{"en":"“projectress” is not a standard English word; it’s likely a misspelling (often of “projectors” or “project”).","zh":"“projectress”不是标准英语词，通常是拼写错误（多半想写“projectors”或“project”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or typo of a real word (commonly: “projectors,” “projectress” is not used in modern English).","zh":"不是标准英语单词。更可能是拼写错误或输入错误（常见可能是“projectors/投影仪（复数）”；“projectress”在现代英语中不常用/基本不用）。"},"examples":[{"en":"Did you mean “projectors” (devices that project an image onto a screen)?","zh":"你是不是想写“projectors”（把影像投到屏幕上的设备，投影仪）？"},{"en":"If you meant “project,” you could write: “We’re starting a new project next week.”","zh":"如果你想写“project（项目）”，可以这样写：“We’re starting a new project next week.（我们下周开始一个新项目。）”"}]}],"phonetic":"/prəˈdʒɛktrɛs/","extraExplanation":["“projectress”看起来像把“project”加上表示女性的后缀“-ess”（如 actress, waitress），但“project”不是表示人的名词，所以这种构词在英语里不自然、几乎不用。","如果你告诉我这词出现的句子/上下文，我可以帮你判断你真正想表达的是“projectors（投影仪）”“project（项目/投射）”“progress（进展）”还是别的词。"]}
{"word":"projectrix","summary":{"en":"“Projectrix” is usually a proper name (brand/product/username) rather than a standard English word; meaning depends on context.","zh":"“Projectrix” 通常是专有名称（品牌/产品/用户名），不是常见英语词汇；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (brand, product, username, or company name). It is not a standard dictionary word in general English, so its exact meaning depends on the specific context where you saw it.","zh":"专有名词（品牌、产品、用户名或公司名）。它一般不属于常见英语词典词汇，因此具体含义取决于你看到它的语境。"},"examples":[{"en":"I couldn’t find a general dictionary definition for Projectrix; it may be the name of a tool or service.","zh":"我找不到 Projectrix 的通用词典释义；它可能是某个工具或服务的名称。"},{"en":"Can you share the sentence or website where you saw “Projectrix”?","zh":"你能把看到 “Projectrix” 的句子或网站发我吗？"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, rare) A coined word that looks like “project” + “-trix,” often used to suggest a person or system that projects, plans, or manages projects.","zh":"（非正式、较少见）一种造词，看起来由 “project（项目/投射）” + “-trix” 组成，常用来暗示“做项目的人/系统”，如投射、规划或管理项目的角色。"},"examples":[{"en":"She jokingly called herself a “projectrix” because she’s always organizing group projects.","zh":"她开玩笑说自己是 “projectrix”，因为她总是在组织小组项目。"},{"en":"The team used “Projectrix” as a nickname for their project-planning dashboard.","zh":"团队把他们的项目规划看板昵称为 “Projectrix”。"}]}],"synonyms":["(if meaning is project-management tool) project manager","planner","dashboard","project management software"],"phonetic":"/prəˈdʒɛktrɪks/","extraExplanation":["“Projectrix” 不像是标准英语词汇，更像是品牌名或自造词。后缀 “-trix” 在英语里有时用来形成带“女性执行者/角色”色彩的名词（如 dominatrix），但在现代用法中更多是一种风格化、戏谑或品牌化的造词方式。","如果你告诉我它出现的领域（软件、建筑、电影投影、商业项目管理等）或给出一句原文，我可以更准确地解释它在该语境中的含义，并提供更贴切的同义表达。"]}
{"word":"projects","summary":{"en":"“Projects” most often means multiple planned pieces of work (“projects”), but it can also be the verb “projects” meaning “predicts” or “shows/throws forward.”","zh":"“projects”最常见是名词复数“项目/任务”；也可以是动词第三人称单数，表示“预测”或“投射/投送”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Planned pieces of work with a goal, usually needing time, steps, and sometimes a team.","zh":"为达成目标而计划进行的工作/任务，通常需要时间、步骤，有时需要团队合作。"},"examples":[{"en":"Our class has three projects this semester.","zh":"我们这学期有三个项目。"},{"en":"She is working on a science project about plants.","zh":"她正在做一个关于植物的科学项目。"},{"en":"The company canceled several projects to save money.","zh":"公司为了省钱取消了几个项目。"}]},{"partOfSpeech":"v.","definition":{"en":"To estimate or predict something in the future based on information you have now.","zh":"根据现有信息对未来进行估计或预测。"},"examples":[{"en":"Experts project that prices will rise next year.","zh":"专家预测明年价格会上涨。"},{"en":"The report projects a steady increase in sales.","zh":"报告预测销售将稳定增长。"}]},{"partOfSpeech":"v.","definition":{"en":"To show an image, light, or sound onto a surface, or to send it forward.","zh":"把影像/光/声音投射到某个表面上；或向前投送。"},"examples":[{"en":"They projected the movie onto a white wall.","zh":"他们把电影投影到一面白墙上。"},{"en":"The lighthouse projects a strong beam far out to sea.","zh":"灯塔把强光远远地投向海面。"}]}],"synonyms":["tasks","assignments","initiatives","plans","predicts","forecasts"],"phonetic":"/ˈprɑːdʒekts/","extraExplanation":["“projects”常见有两种用法：①作名词复数=多个“项目/任务”；②作动词第三人称单数=“预测/投射”。句子里如果前面是主语（如Experts/Report/It），后面跟宾语或从句，往往是动词“project(s)”。","名词“project”在学校语境里常指“作业型项目”（如science project）；在职场语境里更像“项目管理”的项目（有预算、时间表、里程碑）。"]}
{"word":"projecture","summary":{"en":"A rare/old word meaning either a plan/scheme or a projection/protrusion.","zh":"一个罕见/古旧词，可指“计划/方案”或“突出/投影（projection）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A plan, scheme, or design that someone intends to carry out; a proposal.","zh":"（罕见/古旧）计划；方案；设想（指打算实行的提议）"},"examples":[{"en":"The inventor submitted a bold projecture to the committee.","zh":"这位发明家向委员会提交了一个大胆的方案。"},{"en":"Their projecture for a new canal promised great profit.","zh":"他们修建新运河的计划 обещ promised 巨大利润。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A projecting or being projected; an outward extension; a projection.","zh":"（罕见/古旧）突出；伸出部分；投射/投影（即“projection”之义）"},"examples":[{"en":"A small projecture of rock jutted out over the path.","zh":"一小块岩石突出在小路上方。"},{"en":"He studied the projecture of the building’s front wall.","zh":"他研究了那栋建筑前墙的外凸部分。"}]}],"synonyms":["plan","proposal","scheme","projection","protrusion"],"phonetic":"/prəˈdʒɛktʃɚ/","extraExplanation":["“projecture”在现代英语中几乎不用，通常会用更常见的词：表示“方案/计划”多用 plan / proposal / scheme；表示“投影/突出部分”多用 projection / protrusion。","如果你原本想写的是“projection（投影；预测；突出部分）”或“projector（投影仪）”，告诉我你的句子语境，我可以帮你选最自然的词。"]}
{"word":"projectus","summary":{"en":"Projectus is a Latin-based term used mainly in scientific contexts meaning “projecting/protruding,” not a common modern English word.","zh":"projectus 是拉丁语来源的词，主要在科学语境中表示“突出的/向外伸出的”，并非现代常用英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in scientific English) “projected” or “protruding,” describing something that sticks out.","zh":"（拉丁语；用于科学英语）“向外伸出的／突出的”，用来描述某物向外突出。"},"examples":[{"en":"In some older anatomical descriptions, a structure may be labeled “projectus” to mean it projects outward.","zh":"在一些较旧的解剖学描述中，某个结构可能被标注为“projectus”，表示它向外突出。"},{"en":"The species name *projectus* often refers to a protruding part of the animal or plant.","zh":"物种名 *projectus* 常用来指该动物或植物具有“突出的”某个部位。"}]},{"partOfSpeech":"other","definition":{"en":"(Not standard modern English) A Latin form related to “project,” seen mainly in academic or historical texts rather than everyday writing.","zh":"（非现代标准英语）与“project（投射/突出）”相关的拉丁语形式，主要见于学术或历史文本，不用于日常英语。"},"examples":[{"en":"If you meant the English word, you probably want “project” (a plan or piece of work).","zh":"如果你想写英语词，通常你要的是“project”（项目/计划/作业）。"},{"en":"If you meant “projection,” that’s the noun for the act/result of projecting.","zh":"如果你想表达“投射/突出物”，名词一般用“projection”。"}]}],"synonyms":["projecting","protruding","prominent","jutting"],"phonetic":"/proʊˈjɛk.təs/","extraExplanation":["“projectus”来自拉丁语动词 *projicere*（向前扔、投射），在生物学命名（拉丁化的种加词）或较旧的解剖/形态学描述里偶尔出现，用来概括“某部分明显向外突出”的特征。","如果你是在写英文论文或报告，通常不直接用“projectus”，而会用更常见的英文形容词：*projecting, protruding, prominent* 等。"]}
{"word":"projet","summary":{"en":"“projet” is usually a misspelling of “project,” meaning a planned task or piece of work; as a verb, “project” can mean to predict or to project/show something.","zh":"“projet”通常是“project”的拼写错误，表示“项目/计划性工作”；作动词时，“project”可表示“预测”或“投射/放映/表现”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling of) **project**: a planned piece of work with a specific goal, often done at school or at work.","zh":"（常见拼写错误）**project**：为实现某个目标而进行的计划性工作或任务，常见于学校或职场。"},"examples":[{"en":"Our class science project is due on Friday.","zh":"我们班的科学项目周五截止。"},{"en":"She led a project to improve customer service.","zh":"她领导了一个改善客户服务的项目。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan or estimate something about the future based on current information.","zh":"根据现有信息对未来做预测或推算。"},"examples":[{"en":"The report projects sales will rise next year.","zh":"报告预测明年销量会上升。"},{"en":"We projected the budget for the next three months.","zh":"我们估算了未来三个月的预算。"}]},{"partOfSpeech":"v.","definition":{"en":"To send out or show something, such as light, an image, or a feeling/idea.","zh":"投射、放映（光、影像），或表现/传达（感情、想法）。"},"examples":[{"en":"The projector projected a map onto the screen.","zh":"投影仪把地图投到屏幕上。"},{"en":"He projected confidence during the interview.","zh":"他在面试中表现得很自信。"}]}],"synonyms":["plan","assignment","task","initiative","forecast","estimate","predict","display","cast"],"phonetic":"/ˈprɑːdʒekt/","extraExplanation":["“projet”在英语里最常见的是把 **project** 拼错了（少了字母 c）。如果你是在写英文作业/邮件，建议改为 **project**。","另外，**projet** 也是法语单词，意思接近“计划/方案/项目”。在英文文本中如果看到它，可能是在引用法语或与法语背景相关的语境。","发音小提示：名词 **PRO-ject** 重音常在前（/ˈprɑːdʒekt/）；动词 **pro-JECT** 重音常在后（同一拼写但重音变化）。"]}
{"word":"projets","summary":{"en":"“Projets” is usually a misspelling of “projects” (plural of project): planned pieces of work with a goal, schedule, and resources. As a verb, “project” can mean to predict or to show an image on a screen.","zh":"“Projets” 通常是把英文 “projects（项目）” 拼错了；projects 是 project 的复数，指有目标、时间表与资源安排的计划性工作。作动词时，project 还可表示“预测”或“投影/放映”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of project) planned pieces of work with a specific goal, time frame, and often a team or budget.","zh":"（project 的复数）“项目”：为达成特定目标而计划进行的一项工作，通常有时间表、团队或预算。"},"examples":[{"en":"We have three projects to finish before June.","zh":"我们在六月前要完成三个项目。"},{"en":"Her school projects focus on climate and recycling.","zh":"她的学校项目主要关注气候与回收利用。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan or predict something by thinking about the future; to estimate.","zh":"预测；推测；估算（根据未来情况进行判断）。"},"examples":[{"en":"The company projects higher sales next year.","zh":"公司预测明年销售额会更高。"},{"en":"It’s hard to project costs when prices keep changing.","zh":"当价格不断变化时，很难估算成本。"}]},{"partOfSpeech":"v.","definition":{"en":"To show an image or video on a screen using a projector; to cast light or an image.","zh":"（用投影仪）投影；放映；（把光或影像）投射到某处。"},"examples":[{"en":"They projected the slides onto the wall.","zh":"他们把幻灯片投影到墙上。"},{"en":"The movie is projected in 4K.","zh":"这部电影以 4K 放映。"}]},{"partOfSpeech":"n.","definition":{"en":"A large, planned task or assignment done over time (often in school or at work).","zh":"（常指学习/工作中）需要较长时间完成的任务；课题；作业。"},"examples":[{"en":"My final project is a short documentary.","zh":"我的期末课题是一部短纪录片。"},{"en":"This is a team project, so everyone has a role.","zh":"这是团队任务，所以每个人都有分工。"}]}],"synonyms":["plans","tasks","assignments","initiatives","programs","forecast","predict","estimate","display","project (onto a screen)"],"phonetic":"/ˈprɑːdʒekt/","extraExplanation":["你输入的 “projets” 更常见是两种情况：\n1）英文里常见的拼写错误：应为 “projects”。\n2）法语单词 “projets”（projet 的复数），意思也相当于英语的 “projects（项目）”。\n\n另外注意英语里 project 的重音会影响读音：名词常读 /ˈprɑːdʒekt/，动词常读 /prəˈdʒekt/（重音后移）。"]}
{"word":"projicience","summary":{"en":"Proficiency means a high level of skill or ability in something.","zh":"Proficiency 指在某项技能或领域中的高水平熟练度、精通。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high level of skill or ability in something gained through practice and experience","zh":"（通过练习与经验获得的）熟练度；精通水平"},"examples":[{"en":"She has proficiency in English and Spanish.","zh":"她英语和西班牙语都很熟练。"},{"en":"It takes time to develop proficiency in coding.","zh":"培养编程熟练度需要时间。"},{"en":"The job requires proficiency with Excel.","zh":"这份工作要求熟练使用 Excel。"}]}],"synonyms":["skill","competence","expertise","mastery"],"phonetic":"/prəˈfɪʃənsi/","extraExplanation":["你输入的“projicience”应为拼写错误；正确拼写是 proficiency（常见误拼：*profeciency / proficency* 等）。","常见搭配：proficiency in + 领域/技能（proficiency in math）；proficiency with + 工具/软件（proficiency with Photoshop）；language proficiency（语言能力）；a high/low level of proficiency（熟练度高/低）。","词源提示：来自 Latin *proficere*（向前进步），因此有“通过学习变得更熟练”的含义。"]}
{"word":"projicient","summary":{"en":"Projicient is a very rare adjective meaning “projecting outward” or “propelling forward.”","zh":"Projicient 是一个非常少见的形容词，表示“向外突出”或“向前投射/推进”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"projecting forward; jutting out; extending outward.","zh":"向前突出的；伸出的；外凸的。"},"examples":[{"en":"A projicient ledge protected the doorway from rain.","zh":"一段向外突出的檐口为门口挡雨。"},{"en":"The statue’s projicient arm looks as if it’s reaching toward the crowd.","zh":"雕像向前伸出的手臂看起来像是在伸向人群。"}]},{"partOfSpeech":"adj.","definition":{"en":"(very rare) throwing or sending something forward; propelling.","zh":"（非常少见）把某物向前抛出/送出；推进的。"},"examples":[{"en":"In older scientific writing, light was sometimes described in projicient terms.","zh":"在较早的科学写作中，光有时会用“向前射出”的说法来描述。"}]}],"synonyms":["projecting","protruding","jutting","prominent"],"phonetic":"/proʊˈdʒɪʃənt/","extraExplanation":["“projicient”在现代英语中非常罕见，通常你会看到更常用的词：**projecting**（突出的/伸出的）或 **protruding**（凸出的）。","它来自拉丁语词根，和 **project**（投射；项目）同源，核心概念是“向前抛/向前伸”。","很多学习者输入“projicient”其实是想写 **proficient**（熟练的）。如果你的意思是“很擅长/很熟练”，正确拼写通常是 **proficient**。"]}
{"word":"projiciently","summary":{"en":"“Proficiently” means doing something with skill and competence.","zh":"“Proficiently”表示“熟练地、有能力地做某事”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a skilled and competent way; showing a good level of ability from practice or training.","zh":"熟练地；有能力地（通过练习或训练表现出较高水平）。"},"examples":[{"en":"She can speak English proficiently after two years of study.","zh":"经过两年的学习，她已经能熟练地说英语了。"},{"en":"He uses Excel proficiently at work.","zh":"他在工作中能熟练地使用 Excel。"},{"en":"To work here, you must communicate proficiently with customers.","zh":"要在这里工作，你必须能熟练地与客户沟通。"}]}],"synonyms":["skillfully","competently","adeptly","expertly"],"phonetic":"/prəˈfɪʃəntli/","extraExplanation":["“projiciently”不是常见英文拼写，最可能想写的是 **proficiently**（熟练地）。","词形关系：**proficient**（adj. 熟练的）→ **proficiency**（n. 熟练程度）→ **proficiently**（adv. 熟练地）。"]}
{"word":"projournalistic","summary":{"en":"Projournalistic means supportive of journalism or leaning toward a journalistic style.","zh":"projournalistic 指“支持新闻业/新闻自由”的，或“偏新闻写作风格”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting journalism or journalists; favorable toward journalistic work, values, or freedoms.","zh":"支持新闻业或新闻工作者的；倾向肯定新闻价值、新闻自由或新闻工作的。"},"examples":[{"en":"The organization takes a projournalistic stance and funds local reporting.","zh":"该组织采取支持新闻业的立场，并资助本地新闻报道。"},{"en":"Her projournalistic comments emphasized the need for press freedom.","zh":"她支持新闻业的发言强调了新闻自由的必要性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Written or framed in a way that favors a journalistic style (e.g., focusing on facts, quotes, and timely reporting).","zh":"带有“新闻写作”倾向的；以新闻报道的方式来组织内容（如强调事实、引语与时效）。"},"examples":[{"en":"The report’s tone felt projournalistic, with short paragraphs and direct quotes.","zh":"这份报告的语气很“新闻化”，段落短、引用直接。"},{"en":"He rewrote the introduction to be more projournalistic and less academic.","zh":"他重写了开头，让它更偏新闻写法、没那么学术。"}]}],"synonyms":["pro-journalism","pro-press","supportive of journalism","journalism-friendly","press-friendly"],"phonetic":"/ˌproʊˌdʒɝːnəˈlɪstɪk/","extraExplanation":["“projournalistic”不是非常常见的标准词，更常见的写法是带连字符的“pro-journalistic”，或用更自然的表达：“pro-journalism”（支持新闻业的）、“pro-press”（支持新闻自由/媒体的）、“supportive of journalism”（支持新闻的）。","构词法：前缀“pro-”表示“支持/赞成”，加上“journalistic”（新闻的、新闻写作风格的）。因此语义通常是“支持新闻业/新闻自由”，或“偏新闻写作风格”。在正式写作中，若担心读者不熟悉，建议改用更常见表达。"]}
{"word":"projudicial","summary":{"en":"Prejudicial means likely to cause unfair judgment or to disadvantage someone, especially in legal or official contexts.","zh":"Prejudicial 指可能导致不公正判断或对某人不利的（尤用于法律或正式裁决语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of information, comments, or actions) likely to cause unfair judgment or harm someone’s chance of being treated fairly, especially in law or official decisions.","zh":"（指信息、评论或行为）可能造成不公平判断或损害某人获得公正对待机会的，尤用于法律或正式裁决中。"},"examples":[{"en":"The judge told the jury to ignore any prejudicial statements.","zh":"法官告诉陪审团要忽略任何可能造成偏见的不当陈述。"},{"en":"Publishing that rumor could be prejudicial to her case.","zh":"发布那个谣言可能会对她的案件造成不利影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"causing disadvantage; harmful to someone’s interests.","zh":"造成不利影响的；有害于某人利益的。"},"examples":[{"en":"Missing the deadline may be prejudicial to your application.","zh":"错过截止日期可能会对你的申请不利。"},{"en":"The policy change was prejudicial to small businesses.","zh":"政策变动对小企业不利。"}]}],"synonyms":["biased","unfair","damaging","harmful","detrimental"],"phonetic":"/ˌprɛdʒəˈdɪʃəl/","extraExplanation":["“projudicial”并不是常见标准英语单词。你可能想写的是 **prejudicial**（最常见，法律语境里指“有偏见/不利于公正的”）。","如果你本来想表达“支持司法/赞成司法机构”的意思，更自然的写法是 **pro-judicial**（加连字符），但这个词也不算常用；更常见说法是 **supportive of the judiciary** 或 **in favor of judicial oversight**。","词源提示：**prejudicial** 来自 *prejudice*（偏见；成见）。法律中常见搭配有 **prejudicial evidence**（可能误导陪审团、影响公正的证据）与 **unduly prejudicial**（过度不利、偏见性过强）。"]}

