{"word":"prokaryote","summary":{"en":"A prokaryote is an organism (like bacteria) whose cells lack a nucleus.","zh":"prokaryote 指原核生物（如细菌），其细胞没有细胞核。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A living organism whose cells do not have a nucleus or other membrane-bound organelles; most are bacteria or archaea.","zh":"原核生物；其细胞没有细胞核，也没有其他被膜包裹的细胞器；主要包括细菌和古菌。"},"examples":[{"en":"Bacteria are prokaryotes, so they don’t have a nucleus.","zh":"细菌是原核生物，所以它们没有细胞核。"},{"en":"Many prokaryotes can live in extreme environments, such as hot springs.","zh":"许多原核生物能生活在极端环境中，例如温泉里。"},{"en":"Antibiotics often target processes found in prokaryotes.","zh":"抗生素常常针对原核生物特有的生命过程。"}]}],"synonyms":["bacterium (informal/common context)","prokaryotic organism"],"phonetic":"/proʊˈkɛri.oʊt/","extraExplanation":["词源：pro-（“在……之前”）+ karyon（希腊语“核”）。因此 prokaryote 字面意思是“没有（真正）细胞核的生物”。","与 eukaryote（真核生物）对比：真核细胞有细胞核（DNA 在细胞核内），而原核细胞的 DNA 通常位于细胞质中的“拟核区”（nucleoid）。","学习提示：日常英语里更常说 bacteria（细菌）。在生物课或科普文章里才更常用 prokaryote / prokaryotic（原核的）。"]}
{"word":"proke","summary":{"en":"“Proke” is a rare/archaic verb meaning “to poke/stir” or “to probe/investigate.” In modern English it’s uncommon and is often a misspelling of “poke” or “probe.”","zh":"“proke”是罕见/古用动词，可表示“戳/拨弄”或“探查/调查”。现代英语中很少用，常见情况是把“poke”或“probe”拼错。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to poke, prod, or stir something, often to search around or test it.","zh":"（罕见/古用）戳、捅、拨弄（某物）；常指为了寻找或试探而翻找、探一探。"},"examples":[{"en":"He proked the ashes with a stick to find a live coal.","zh":"他用棍子拨弄灰烬，想找出还燃着的炭火。"},{"en":"She proked around in the drawer until she found the key.","zh":"她在抽屉里翻找了一阵，直到找到钥匙。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to probe or investigate; to search into something carefully.","zh":"（罕见/古用）探查；仔细调查（某事）。"},"examples":[{"en":"Reporters began to proke into the deal after the sudden resignation.","zh":"在突然辞职之后，记者开始深入调查那笔交易。"}]}],"synonyms":["poke","prod","stir","rummage","probe","investigate"],"phonetic":"/proʊk/","extraExplanation":["“proke”在现代英语里非常少见，很多时候是拼写错误或误读，常见目标词可能是：\n- “poke” /poʊk/（戳、捅；随便翻找）\n- “probe” /proʊb/（探查、探测；深入追问）\n如果你是在作业、小说或歌词里看到的“proke”，把上下文句子发来，我可以帮你判断更可能是哪一个。"]}
{"word":"prokeimenon","summary":{"en":"A prokeimenon is a liturgical chant/psalm verse sung before the Epistle in Eastern Christian services.","zh":"prokeimenon 指东方基督宗教礼仪中在《书信》读经前吟唱的圣咏经句（常带回应句）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox/Eastern Catholic liturgy) A chant or psalm verse sung or read before the Epistle (Scripture reading), usually with a repeated refrain.","zh":"（东正教/东方礼天主教礼仪）在《书信》（圣经读经）之前吟唱或诵读的圣咏句/经句，通常带有重复的副歌（回应句）。"},"examples":[{"en":"At the Divine Liturgy, the prokeimenon is chanted before the Epistle reading.","zh":"在圣礼仪中，prokeimenon 会在《书信》读经前被吟唱。"},{"en":"The choir repeated the refrain of the prokeimenon while a soloist sang the verse.","zh":"独唱者唱出经句时，诗班重复 prokeimenon 的回应句。"}]},{"partOfSpeech":"n.","definition":{"en":"The specific text (the chosen psalm verse and refrain) appointed for that moment in the service.","zh":"（指具体内容）礼仪中该环节所指定的那段经文（所选的圣咏经句与回应句）。"},"examples":[{"en":"Today’s prokeimenon comes from the Psalms and highlights the theme of mercy.","zh":"今天的 prokeimenon 选自《圣咏》，强调“怜悯”的主题。"},{"en":"The reader checked the book to find the proper prokeimenon for the feast day.","zh":"读经员查看礼仪书，寻找节日所用的正确 prokeimenon。"}]}],"synonyms":["prokimenon","prokeimen"],"phonetic":"/proʊˈkiːmɪnɑn/","extraExplanation":["词源来自希腊语 προκείμενον（prokeímenon），意思是“放在前面的/在前面的”，指“在读经之前”的那段吟唱或经句。","在东正教传统中，它常与“阿利路亚（Alleluia）经句”相对应：prokeimenon 通常在《书信》前，Alleluia 常在《福音》前。不同礼仪日（主日、节日、斋期等）会指定不同的 prokeimenon。","英语里也常见拼写 prokeimenon / prokeimenon; 有时可见变体 prokimenon（更接近部分传统的转写）。"]}
{"word":"proker","summary":{"en":"“Proker” is usually an Indonesian abbreviation for “program kerja” (a work program/plan). In English, it’s not standard and may be a misspelling of another word.","zh":"“proker”通常是印尼语中“program kerja（工作计划/活动方案）”的简称；在英语里不是标准用词，可能是其他词的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard; mainly Indonesian) Short for “program kerja,” meaning a planned set of activities or a work program (often used in student organizations or committees).","zh":"（非标准英语；主要为印尼语用法）“program kerja”的简称，指“工作计划/活动方案”（常见于学生组织、社团或委员会）。"},"examples":[{"en":"Our proker for this semester includes a charity event and two workshops.","zh":"我们这学期的 proker 包括一次慈善活动和两场工作坊。"},{"en":"Please submit the proker to the committee by Friday.","zh":"请在周五前把 proker（工作计划）提交给委员会。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/unclear in English) A misspelling or informal shortening of another word (commonly confused with “broker,” “proctor,” or “procurer”), depending on context.","zh":"（英语中罕见/含义不清）可能是拼写错误或口语缩写，常被误写成与 “broker / proctor / procurer” 等词相关，具体取决于语境。"},"examples":[{"en":"Did you mean “broker” (someone who buys and sells for others)?","zh":"你想写的是 “broker”（经纪人）吗？"},{"en":"In the exam hall, a “proctor” supervises the test.","zh":"在考场里，“proctor” 指监考老师。"}]}],"synonyms":["work plan","work program","action plan","schedule"],"phonetic":"/ˈproʊkər/","extraExplanation":["“proker”本身不是常见标准英语词条；如果你是在印尼语/校园组织语境里看到，它多半就是“program kerja（工作计划）”的简称。","如果你是在英文文章里看到“proker”，很可能是拼写错误。你可以把原句发我，我能帮你判断更可能是哪一个词（broker/proctor/procurer 等）。"]}
{"word":"prokindergarten","summary":{"en":"Prokindergarten means supporting kindergarten programs or someone who supports them.","zh":"prokindergarten 指“支持幼儿园（政策/项目）”，也可指“支持幼儿园的一方/人士”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in favor of kindergarten (especially policies that expand, fund, or require kindergarten programs)","zh":"支持幼儿园（尤其指支持扩大、资助或推行幼儿园相关政策）"},"examples":[{"en":"The candidate ran on a prokindergarten platform, promising free full-day programs.","zh":"这位候选人以支持幼儿园的政见参选，承诺提供免费的全天幼儿园项目。"},{"en":"Parents formed a prokindergarten group to lobby for more classrooms.","zh":"家长们组成了一个支持幼儿园的团体，游说增设更多教室。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or viewpoint that supports kindergarten programs","zh":"支持幼儿园的人／团体／观点"},"examples":[{"en":"Prokindergartens argued that early education helps close learning gaps.","zh":"支持幼儿园的一方认为，早期教育有助于缩小学习差距。"},{"en":"In the debate, prokindergartens and opponents disagreed about the budget.","zh":"在辩论中，支持幼儿园的一方与反对者在预算问题上意见不合。"}]}],"synonyms":["pro-kindergarten","in favor of kindergarten","supportive of kindergarten","kindergarten-friendly"],"phonetic":"/ˌproʊˈkɪndərˌɡɑrtən/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-democracy 支持民主、pro-environment 支持环保）。因此 prokindergarten 通常出现在教育政策、选举政纲或公共讨论中，用来表明立场。","这个词更常见的写法是带连字符的 “pro-kindergarten”。在正式写作中，用连字符更清晰。"]}
{"word":"proklausis","summary":{"en":"Proklausis means preliminary applause given before a performance to build excitement.","zh":"Proklausis 指演出开始前为热场、助兴而进行的预先掌声/喝彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"preliminary applause or clapping, especially given before a performance begins to encourage or “warm up” the audience and performers","zh":"（尤指演出开始前的）预先鼓掌/喝彩，用来带动气氛、鼓励演员或让观众“热起来”"},"examples":[{"en":"Before the curtain rose, the bandleader invited a brief proklausis to set the mood.","zh":"幕布升起前，乐队指挥请大家先短暂地预先鼓掌，以营造气氛。"},{"en":"The actor stepped onstage to a proklausis from the front rows.","zh":"演员一登台，前排观众就先给了一阵预先鼓掌。"}]}],"synonyms":["preliminary applause","warm-up applause","opening applause"],"phonetic":"/proʊˈklaʊsɪs/","extraExplanation":["该词源自古希腊语，和“呼喊/叫好、鼓掌”有关；在古典戏剧与公共表演的语境中，可指开场前为带动气氛而进行的掌声或喝彩。","现代英语里非常少见，多出现在古典学、戏剧史或修辞/表演研究的文本中。"]}
{"word":"prokroustes","summary":{"en":"Procrustes is a Greek-myth figure symbolizing cruel, rigid forcing of people or things to fit a fixed standard; procrustean describes such an approach.","zh":"Procrustes 指希腊神话中象征残酷、僵化“强行合模”的人物；procrustean 用来形容这种削足适履式的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Procrustes: a figure in Greek mythology who forced travelers to fit an iron bed by stretching them or cutting off their legs; used as a symbol of cruel, rigid conformity.","zh":"普罗克鲁斯忒斯（希腊神话人物）：他强迫路人“适配”一张铁床，不够长就拉伸，太长就砍掉；常用来象征残酷而僵化的强制一致。"},"examples":[{"en":"The policy became a kind of Procrustes, forcing every school to follow the same model.","zh":"这项政策变成了某种“普罗克鲁斯忒斯之床”，逼迫每所学校都照同一个模式来。"},{"en":"Critics warned that the new rules would treat students like Procrustes treated travelers.","zh":"批评者警告说，新规会像普罗克鲁斯忒斯对待旅人那样对待学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"procrustean: describing a system or rule that forces people or things to fit an arbitrary standard, often in a harsh or unfair way.","zh":"procrustean（形容词）：指用僵硬（往往武断）的标准强行让人或事物“合模”，通常带有苛刻或不公的含义。"},"examples":[{"en":"They rejected a procrustean approach to education and supported flexible learning.","zh":"他们反对教育上的“削足适履”式做法，支持更灵活的学习方式。"},{"en":"The company’s procrustean grading system ignored individual strengths.","zh":"公司的僵化评分体系忽视了个人优势。"}]}],"synonyms":["rigid","inflexible","one-size-fits-all","overly strict"],"phonetic":"/proʊˈkrʌstiːz/","extraExplanation":["你输入的“prokroustes”更常见的拼写是 **Procrustes**（也可见 Prokrustes，为转写差异）。","这个神话常引申为“**Procrustean bed**（普罗克鲁斯忒斯之床）”：比喻用单一、僵硬的标准硬套复杂多样的现实，类似中文的“削足适履”。","在写作/评论中，用它通常带批判色彩：批评制度、指标、模板、规则把人或事物“修剪到合格”，而不是因材施教或尊重差异。"]}

