{"word":"prolabium","summary":{"en":"Prolabium is the central front portion of the upper lip, mainly used in medical/anatomy contexts.","zh":"Prolabium 指上唇中央前部，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The central, front part of the upper lip (especially discussed in embryology and cleft lip/palate surgery).","zh":"（解剖）上唇中央、最前面的部分（常见于胚胎学与唇裂/腭裂相关的医学讨论）。"},"examples":[{"en":"In cleft lip repair, surgeons aim to reconstruct a natural-looking prolabium.","zh":"在唇裂修复手术中，外科医生会尽量重建外观自然的上唇中央部位（prolabium）。"},{"en":"The prolabium may lack normal muscle tissue in some congenital conditions.","zh":"在某些先天性情况中，prolabium 可能缺乏正常的肌肉组织。"}]}],"synonyms":["(medical) upper-lip midline segment","labial segment"],"phonetic":"/proʊˈleɪbiəm/","extraExplanation":["这是一个较少见的医学/解剖学术语，多用于唇裂（尤其是双侧唇裂）相关的描述。临床语境下，prolabium 常指上唇正中那块组织，有时与“前颌（premaxilla）”等结构一起被讨论。词源上可拆为 pro-（向前）+ labium（唇）。"]}
{"word":"prolabor","summary":{"en":"Pro-labor means supporting workers and labor unions, especially in political or workplace contexts.","zh":"Pro-labor 指支持劳工与工会，常用于政治或劳资关系语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting workers’ rights, labor unions, or policies that benefit employees (often used in politics and economics).","zh":"支持劳工权益、工会或有利于雇员的政策（常用于政治与经济语境）。"},"examples":[{"en":"The candidate ran on a pro-labor platform, promising stronger workplace protections.","zh":"这位候选人以亲劳工的政纲参选，承诺加强职场保护。"},{"en":"Some critics said the law was pro-labor because it made it easier to form unions.","zh":"一些批评者说这项法律偏向劳工，因为它让组建工会更容易。"}]},{"partOfSpeech":"adj.","definition":{"en":"favoring organized labor over employers in negotiations or disputes.","zh":"在谈判或劳资纠纷中更偏向工会/劳方而非资方。"},"examples":[{"en":"The mediator was seen as pro-labor, so management requested a different negotiator.","zh":"调解人被认为偏向劳方，因此资方要求更换谈判人员。"},{"en":"The newspaper’s editorial page has a pro-labor stance on strikes.","zh":"这家报纸的社论版面对罢工具有亲劳工立场。"}]}],"synonyms":["pro-union","labor-friendly","worker-friendly","union-supporting"],"phonetic":"/ˌproʊˈleɪbɚ/","extraExplanation":["“prolabor”更常见的标准拼写是带连字符的“pro-labor”。在英语里，前缀“pro-”表示“赞成/支持”（如 pro-democracy 亲民主、pro-environment 亲环保）。","语域提示：这是偏正式、偏政治评论的用词，常出现在竞选纲领、政策分析、新闻评论里。日常口语里也可以说 “supports unions / supports workers’ rights”（支持工会/劳工权益）。"]}
{"word":"prolacrosse","summary":{"en":"“Pro lacrosse” means professional-level lacrosse, or anything related to it.","zh":"“pro lacrosse”指职业（付薪）水平的长曲棍球运动，也可作形容词表示“职业长曲棍球的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"professional lacrosse; the sport of lacrosse played at a paid, elite level (including professional leagues and teams).","zh":"职业长曲棍球；指以职业（付薪）与高水平竞赛为特点的长曲棍球运动（包括职业联赛与职业队伍）。"},"examples":[{"en":"He’s trying out for a pro lacrosse team this summer.","zh":"他今年夏天要去参加一支职业长曲棍球队的选拔。"},{"en":"Pro lacrosse games are faster and more physical than most college matches.","zh":"职业长曲棍球比赛通常比大多数大学比赛节奏更快、身体对抗更强。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to professional lacrosse (used before a noun).","zh":"职业长曲棍球的（用作定语，常放在名词前）。"},"examples":[{"en":"She writes pro lacrosse coverage for a sports website.","zh":"她为一家体育网站撰写职业长曲棍球赛事报道。"},{"en":"They’re debating new pro lacrosse rules for the next season.","zh":"他们在讨论下赛季职业长曲棍球的新规则。"}]}],"synonyms":["professional lacrosse","pro lacrosse league (contextual)","pro lacrosse team (contextual)"],"phonetic":"/proʊ ləˈkrɔs/","extraExplanation":["“lacrosse（长曲棍球）”起源与北美原住民（如海尔哈·德诺索尼/易洛魁联盟等）传统运动有关，现代规则后来在加拿大与美国逐步定型。","“pro lacrosse”在北美语境里常指职业联赛体系：户外（field）如 PLL（Premier Lacrosse League）；室内（box）如 NLL（National Lacrosse League）。不同联赛在场地大小、人数与对抗强度上会有差异。","书写上常见作“pro lacrosse”（两词），也会在品牌或队名中看到连写或大写形式；口语里也常直接说“professional lacrosse”。"]}
{"word":"prolactin","summary":{"en":"Prolactin is a hormone (mainly from the pituitary gland) that promotes milk production and influences reproduction.","zh":"泌乳素是主要由脑下垂体分泌的激素，促进泌乳并影响生殖功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone made mainly by the pituitary gland that stimulates milk production after childbirth and also affects reproduction and other body functions","zh":"泌乳素（主要由脑下垂体分泌的激素），促进产后乳汁分泌，并影响生殖及其他身体功能"},"examples":[{"en":"After giving birth, prolactin levels rise to help the body produce breast milk.","zh":"分娩后，泌乳素水平会上升，帮助身体产生母乳。"},{"en":"Some medicines can increase prolactin and may cause breast discharge.","zh":"某些药物会升高泌乳素，可能导致乳汁样分泌物。"},{"en":"The doctor ordered a blood test to check prolactin levels.","zh":"医生开了抽血检查来测量泌乳素水平。"}]}],"synonyms":["luteotropic hormone"],"phonetic":"/proʊˈlæk.tɪn/","extraExplanation":["“prolactin”常见于医学/生理学语境。词源可拆解为 pro-（促进）+ lact-（乳汁，如 lactose 乳糖、lactation 哺乳）+ -in（常见于蛋白质/激素名词后缀），意思直观地指“促进乳汁（产生）的物质”。","临床上泌乳素异常升高可能与妊娠/哺乳、压力、某些精神科药物、甲状腺功能减退或垂体腺瘤等有关；但具体解读需要医生结合症状与检查结果判断。"]}
{"word":"prolamin","summary":{"en":"A prolamin is a grain storage protein (common in wheat and corn) rich in proline, often discussed in relation to gluten.","zh":"prolamin 指谷物中的一种贮藏蛋白（常见于小麦、玉米），富含脯氨酸，常在与麸质相关的话题中被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of plant storage protein found mainly in cereal grains (such as wheat, corn, barley, and rye), notable because it is rich in the amino acid proline and is soluble in alcohol-water mixtures.","zh":"一种植物贮藏蛋白，主要存在于谷物（如小麦、玉米、大麦、黑麦）中，特点是富含脯氨酸（proline），并可溶于酒精-水混合溶液。"},"examples":[{"en":"Wheat gluten contains prolamins such as gliadin, which can trigger symptoms in people with celiac disease.","zh":"小麦麸质含有醇溶蛋白（prolamin），例如麦醇溶蛋白（gliadin），可能会诱发乳糜泻患者的症状。"},{"en":"Corn’s main prolamin is called zein, and it is used in some food coatings.","zh":"玉米的主要醇溶蛋白叫玉米醇溶蛋白（zein），它被用于一些食品涂层。"}]}],"synonyms":["grain storage protein","cereal storage protein"],"phonetic":"/ˈproʊləˌmɪn/","extraExplanation":["词源提示：prolamin 来自 “proline（脯氨酸）+ -amin（与氨基/蛋白相关的词根）”，反映其富含脯氨酸的特征。","学习关联：在营养学与食品科学里，prolamin 常与“麸质（gluten）”话题一起出现。小麦的主要 prolamin 是 gliadin（麦醇溶蛋白）；大麦是 hordein；黑麦是 secalin；玉米是 zein。","文化/健康背景：在无麸质饮食（gluten-free）讨论中，经常提到某些谷物 prolamin 会引发乳糜泻（celiac disease）患者的免疫反应；但并非所有人都需要避免。"]}
{"word":"prolamine","summary":{"en":"A prolamine is an alcohol-soluble storage protein found mainly in cereal grains.","zh":"醇溶蛋白是主要存在于谷物中的一种可溶于酒精的贮藏蛋白。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of plant storage protein found mainly in cereal grains (like wheat, barley, corn, and rye), known for being soluble in alcohol and often important in food science and nutrition","zh":"一种主要存在于谷物（如小麦、大麦、玉米、黑麦）中的植物贮藏蛋白，其特点是可溶于酒精，常用于食品科学与营养学讨论"},"examples":[{"en":"Prolamines are common in many cereal grains and affect how flour behaves in baking.","zh":"醇溶蛋白常见于多种谷物中，会影响面粉在烘焙中的表现。"},{"en":"In wheat, certain prolamines are part of gluten and can cause problems for people with celiac disease.","zh":"在小麦中，某些醇溶蛋白属于麸质的一部分，可能让乳糜泻患者出现不适。"}]}],"synonyms":["alcohol-soluble storage protein","cereal storage protein"],"phonetic":"/ˈproʊləˌmiːn/","extraExplanation":["词源提示：prolamine 来自“proline（脯氨酸）+ amine（胺）”，因为这类蛋白往往富含脯氨酸和谷氨酰胺等氨基酸。","常见相关词：wheat 的 gliadin（麦醇溶蛋白）、corn 的 zein（玉米醇溶蛋白）、barley 的 hordein（大麦醇溶蛋白）、rye 的 secalin（黑麦醇溶蛋白）。在食品与医学语境中，这些名称比泛称 prolamine 更常见。","语境说明：这是偏生物化学/食品科学的术语，在日常英语里不常用；在配料、营养、过敏与麸质相关话题中可能出现。"]}
{"word":"prolamins","summary":{"en":"Prolamins are cereal-grain storage proteins (e.g., in wheat and corn), rich in proline and glutamine.","zh":"Prolamins 指谷物中的一类贮藏蛋白（如小麦、玉米），富含脯氨酸和谷氨酰胺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of plant storage proteins found mainly in cereal grains (such as wheat, barley, rye, and corn), rich in the amino acids proline and glutamine.","zh":"一类主要存在于谷物（如小麦、大麦、黑麦、玉米）中的植物贮藏蛋白，富含脯氨酸（proline）和谷氨酰胺（glutamine）。"},"examples":[{"en":"Prolamins in wheat include gliadins, which are part of gluten.","zh":"小麦中的醇溶蛋白（prolamins）包括麦醇溶蛋白（gliadins），它们是面筋（gluten）的一部分。"},{"en":"Corn prolamins are called zeins and are used in some food coatings.","zh":"玉米的醇溶蛋白叫玉米醇溶蛋白（zeins），可用于某些食品涂层。"}]}],"synonyms":["cereal storage proteins","gliadins","hordeins","secalins","zeins"],"phonetic":"ˈproʊləˌmɪn","extraExplanation":["“Prolamin”这个词来自“proline（脯氨酸）”的前半部分 + “-amin（氨基/胺）”的构词方式，强调这类蛋白与脯氨酸含量高有关。","在营养与医学语境中，人们常提到小麦/大麦/黑麦的某些prolamins与“麸质（gluten）”相关；对乳糜泻（celiac disease）或麸质敏感者来说，这一点尤其重要。","不同谷物的prolamins有专门名称：wheat=gliadins（麦醇溶蛋白）、barley=hordeins（大麦醇溶蛋白）、rye=secalins（黑麦醇溶蛋白）、corn=zeins（玉米醇溶蛋白）。"]}
{"word":"prolan","summary":{"en":"Prolan is an old term for gonadotropin hormones (FSH/LH-like) used in early medical/veterinary contexts.","zh":"Prolan 是“促性腺激素”的旧称，常见于早期医学/兽医语境，指具有类似FSH/LH作用的激素或制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical medicine) A former name for gonadotropins—hormones that stimulate the ovaries or testes; especially a gonadotropic extract once obtained from the pituitary or from pregnant mare serum (similar to FSH/LH activity).","zh":"（医学史用语）“促性腺激素”的旧称：刺激卵巢或睾丸的激素；尤指早期从垂体或孕马血清中提取、具有类似FSH/LH作用的促性腺激素制剂。"},"examples":[{"en":"Early endocrinology papers sometimes mention prolan when discussing hormones that trigger ovulation.","zh":"早期内分泌学论文在讨论诱发排卵的激素时，有时会提到 prolan。"},{"en":"In older veterinary contexts, prolan may refer to gonadotropin preparations used to manage fertility in animals.","zh":"在较旧的兽医语境中，prolan 可能指用于调控动物繁殖的促性腺激素制剂。"}]}],"synonyms":["gonadotropin","FSH","LH","PMSG","eCG"],"phonetic":"/ˈproʊlæn/","extraExplanation":["这是一个偏“历史/旧术语”，现代医学与生物学写作中更常用 gonadotropin、FSH（促卵泡激素）、LH（促黄体生成素）或 PMSG/eCG（孕马血清促性腺激素/马绒毛膜促性腺激素）等更具体的名称。","在不同年代或文献体系里，prolan 的指代可能略有差异；阅读旧文献时可结合上下文，看作者是在谈垂体来源的促性腺激素，还是孕马血清相关的制剂。"]}
{"word":"prolans","summary":{"en":"“Prolans” is a dated medical term for gonadotropic hormones (gonadotropins).","zh":"“Prolans”是一个较少见且偏旧的医学术语，指促性腺激素（gonadotropins）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, biology/medicine) Gonadotropic hormones (especially from the pituitary gland) that stimulate the ovaries or testes; an older term roughly referring to gonadotropins such as LH and FSH.","zh":"（过时用法，生物/医学）促性腺激素，尤其指脑垂体分泌、刺激卵巢或睾丸的激素；旧称，大致相当于黄体生成素（LH）与促卵泡激素（FSH）等。"},"examples":[{"en":"In older medical texts, “prolans” were described as hormones that trigger ovulation.","zh":"在较早的医学文献中，“prolans”被描述为能触发排卵的激素。"},{"en":"Modern textbooks usually use the term gonadotropins instead of prolans.","zh":"现代教材通常用“gonadotropins（促性腺激素）”而不用“prolans”。"}]}],"synonyms":["gonadotropins","LH","FSH"],"phonetic":"/ˈproʊlænz/","extraExplanation":["“prolans”是“prolan”的复数形式，属于早期内分泌学术语；现在更常用更精确的名称是LH（黄体生成素）和FSH（促卵泡激素），统称gonadotropins。","如果你是想查别的词（例如拼写为“plans / palms / prolapse”），告诉我上下文或句子，我可以帮你确认目标词。"]}
{"word":"prolapse","summary":{"en":"A medical term for an organ slipping down or out of its normal position; it can also mean the organ does this.","zh":"医学术语：指器官从正常位置下移或脱出（脱垂）；也可作动词表示发生脱垂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A condition in which an organ slips or falls out of its normal position, often in the pelvic area (for example, the uterus, bladder, or rectum).","zh":"（医学）脱垂：器官从正常位置下移或下垂，常见于骨盆区域（如子宫、膀胱或直肠）。"},"examples":[{"en":"After childbirth, some women may experience pelvic organ prolapse.","zh":"分娩后，一些女性可能会出现盆腔器官脱垂。"},{"en":"The doctor explained that a uterine prolapse can cause a feeling of heaviness or pressure.","zh":"医生解释说，子宫脱垂可能会引起下坠感或压迫感。"}]},{"partOfSpeech":"v.","definition":{"en":"(Medicine) To slip or fall out of the normal position (of an organ).","zh":"（医学）（器官）脱垂；从正常位置下移或脱出。"},"examples":[{"en":"In severe cases, the uterus may prolapse into the vagina.","zh":"在严重情况下，子宫可能会脱垂进入阴道。"},{"en":"If the rectum prolapses, it may require medical treatment.","zh":"如果直肠脱垂，可能需要医疗处理。"}]}],"synonyms":["(n.) descent","(n.) herniation (sometimes used broadly)","(v.) slip","(v.) descend"],"phonetic":"/ˈproʊlæps/","extraExplanation":["“prolapse”是医学用语，日常英语里并不常用；在沟通时更常见的相关表达有“pelvic organ prolapse（盆腔器官脱垂）”“uterine prolapse（子宫脱垂）”“rectal prolapse（直肠脱垂）”。","发音提示：重音在第一音节 PRO-lapse。","语域与文化提示：这是涉及身体与私密部位的词，在英语环境中通常出现在医生问诊、健康科普或学术语境；在非医疗场合使用时建议注意礼貌与场合。"]}
{"word":"prolapsed","summary":{"en":"“Prolapsed” describes a body part that has slipped down or out of its normal position; it’s also the past form of “prolapse.”","zh":"“prolapsed”指（医学上）器官/组织从正常位置下滑或脱出，也可作“prolapse”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Slipped down or fallen out of its normal position in the body.","zh":"（医学）脱垂的；从正常位置下滑或脱出（如器官或组织）。"},"examples":[{"en":"The doctor said the valve was prolapsed, so it wasn’t closing properly.","zh":"医生说这个瓣膜发生了脱垂，所以无法正常关闭。"},{"en":"She was treated for a prolapsed uterus after childbirth.","zh":"她在分娩后因子宫脱垂接受了治疗。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past and past participle of “prolapse” (to slip down or fall out of place, especially in the body).","zh":"“prolapse”的过去式和过去分词（指尤其在身体内下滑或脱出原位）。"},"examples":[{"en":"Part of the rectum had prolapsed and required medical care.","zh":"直肠部分发生了脱垂，需要医疗处理。"}]}],"synonyms":["displaced","slipped","fallen","herniated (esp. for discs)"],"phonetic":"/ˈproʊˌlæpst/","extraExplanation":["“prolapsed”常见于医学语境，较少用于日常对话。常搭配：prolapsed disc（椎间盘突出/脱出，口语更常说herniated disc）、prolapsed uterus（子宫脱垂）、mitral valve prolapse（二尖瓣脱垂）。","在非医学写作中，很多人会用更通俗的表达来替代，例如“out of place（移位）”“slipped（滑到不该在的位置）”。"]}
{"word":"prolapses","summary":{"en":"“Prolapses” means either “falls/slips out of its normal position” (verb) or “cases of prolapse” (plural noun), usually in medical contexts.","zh":"“Prolapses”通常用于医学语境，可表示“发生脱垂/滑脱”（动词）或“脱垂的病例/情况”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the 3rd-person singular present form of “prolapse”: to fall or slip out of the normal position (usually a body part or organ).","zh":"“prolapse”的第三人称单数现在时：指（身体部位或器官）从正常位置下垂、滑脱（多用于医学语境）。"},"examples":[{"en":"If the pelvic floor weakens, the uterus sometimes prolapses.","zh":"如果盆底肌变弱，子宫有时会发生脱垂。"},{"en":"The doctor checks whether the valve prolapses during each heartbeat.","zh":"医生会检查瓣膜是否在每次心跳时发生脱垂。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of “prolapse”: cases of an organ or body tissue slipping out of place.","zh":"“prolapse”的复数：指器官或组织发生滑脱/脱垂的情况（多用于医学语境）。"},"examples":[{"en":"The clinic sees many prolapses after childbirth, especially without proper rehab.","zh":"这家门诊在产后会看到不少脱垂病例，尤其是没有进行恰当康复时。"},{"en":"Not all prolapses require surgery; some can be managed with therapy.","zh":"并非所有脱垂都需要手术；有些可以通过治疗手段进行管理。"}]}],"synonyms":["slips","drops","sags","herniates (in some contexts)","protrudes"],"phonetic":"/ˈproʊlæpsɪz/","extraExplanation":["“prolapse / prolapses”是偏正式、医学用语，日常口语里更常说“something slipped”或“it’s sagging”，但在就医、检查报告、科普文章中会频繁出现。","常见搭配：uterine prolapse（子宫脱垂）、rectal prolapse（直肠脱垂）、mitral valve prolapse（二尖瓣脱垂）。如果你是在阅读体检/病历看到这个词，通常需要结合具体器官名称来理解。"]}
{"word":"prolapsing","summary":{"en":"“Prolapsing” is a medical word meaning an organ or tissue is slipping out of its normal position; it’s also the -ing form of “prolapse.”","zh":"“prolapsing”是医学用语，表示器官或组织从正常位置滑落/突出（脱垂）；也可作“prolapse”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) slipping or falling out of place, especially when an organ drops or bulges downward/outward.","zh":"（医学）脱垂的；（尤指器官）下垂或向外（阴道/肛门等处）突出、移位的。"},"examples":[{"en":"The doctor examined her for a prolapsing uterus.","zh":"医生检查她是否有子宫脱垂。"},{"en":"Surgery may be needed in severe cases of prolapsing tissue.","zh":"在组织严重脱垂的情况下，可能需要手术。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “prolapse”: to slip or fall out of the normal position (of an organ).","zh":"“prolapse”的现在分词：指（器官）脱垂、从正常位置滑落或突出。"},"examples":[{"en":"The valve is prolapsing and may not close properly.","zh":"这个瓣膜正在脱垂，可能无法正常关闭。"},{"en":"The nurse explained what symptoms to watch for if the organ is prolapsing.","zh":"护士说明了如果器官发生脱垂需要留意哪些症状。"}]}],"synonyms":["protruding","bulging","slipping","descending"],"phonetic":"/proʊˈlæpsɪŋ/","extraExplanation":["“prolapsing”多见于医学语境，常用来修饰名词（prolapsing uterus/rectum/valve 等），或描述影像/检查中的“正在发生脱垂”。日常英语里更常见的是名词“prolapse”（脱垂）或动词“to prolapse”（发生脱垂）。","发音与拼写提示：pro- + lapse（“滑落”之意），整体含义可理解为“向前/向外滑落”。在临床表述中，常与程度词连用：mild/moderate/severe prolapse。"]}
{"word":"prolapsion","summary":{"en":"A rare medical word meaning “prolapse,” when something slips out of its normal position in the body.","zh":"一个较少见的医学词，意思相当于“prolapse（脱垂）”，指身体某部位滑脱离开正常位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) The act or condition of slipping forward or downward out of place; a prolapse.","zh":"（医学用语，较少见）器官或组织向前或向下滑脱、脱出原位的状态；脱垂。"},"examples":[{"en":"The report noted a mild uterine prolapsion after childbirth.","zh":"报告指出产后出现轻度子宫脱垂。"},{"en":"Pelvic floor exercises may help prevent prolapsion in some patients.","zh":"骨盆底肌训练可能有助于预防部分患者的脱垂。"}]}],"synonyms":["prolapse","slipping","descent"],"phonetic":"/proʊˈlæpʃən/","extraExplanation":["“prolapsion”在现代英语里非常少见，临床与日常表达更常用“prolapse”。你可以把它理解为“prolapse”的较旧/较少用名词形式。","词源上与拉丁语 *prolapsus*（向前滑落）相关，常见搭配会出现在解剖学或妇科、直肠外科语境，例如 uterine/rectal prolapse（子宫/直肠脱垂）。"]}
{"word":"prolapsus","summary":{"en":"A medical term for an organ slipping down/out of its normal position (often pelvic organ or rectal).","zh":"医学术语，指器官从正常位置下移或脱出（常见为盆腔器官或直肠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A condition in which an organ slips down or falls out of its usual position, especially a pelvic organ (such as the uterus, bladder, or rectum) dropping into the vagina, or the rectum protruding through the anus.","zh":"（医学）脱垂：器官从正常位置向下移位或部分/全部突出，常指盆腔器官（如子宫、膀胱、直肠）向阴道内下垂，或直肠从肛门突出。"},"examples":[{"en":"After childbirth, some people experience pelvic organ prolapsus and may need pelvic floor therapy.","zh":"分娩后，有些人会出现盆腔器官脱垂，可能需要做盆底康复治疗。"},{"en":"The doctor examined him to check for rectal prolapsus.","zh":"医生为他检查是否有直肠脱垂。"}]}],"synonyms":["prolapse","pelvic organ prolapse","rectal prolapse"],"phonetic":"/proʊˈlæpsəs/","extraExplanation":["“Prolapsus”是较正式、偏医学写作的词；日常英语里更常用“prolapse”（如“uterine prolapse / pelvic organ prolapse / rectal prolapse”）。","词源来自拉丁语“prolapsus”（意为“滑落、下坠”），在医学语境中强调“从原位滑出/下垂”的状态。","这是健康与身体相关的敏感话题；英语沟通中如果担心尴尬，可以使用更中性、专业的说法，如“I was diagnosed with pelvic organ prolapse.”或“a prolapse condition”。"]}
{"word":"prolarva","summary":{"en":"A prolarva is a very early larval stage of certain insects, often right after hatching.","zh":"prolarva 指某些昆虫孵化后不久的非常早期幼虫阶段（常为第一阶段）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) A very early larval stage in some insects—often the first stage after hatching—typically small and not yet fully developed in form.","zh":"（昆虫学）某些昆虫非常早期的幼虫阶段——常指孵化后的第一阶段——个体很小，形态尚未完全发育。"},"examples":[{"en":"In some insects, the prolarva emerges from the egg and soon molts into a more typical larval form.","zh":"在一些昆虫中，前幼虫从卵中孵出后，很快蜕皮，变成更典型的幼虫形态。"},{"en":"Researchers recorded the duration of the prolarva to understand early development.","zh":"研究人员记录前幼虫阶段持续的时间，以了解早期发育过程。"}]}],"synonyms":["first-instar larva","early larval stage","newly hatched larva"],"phonetic":"/proʊˈlɑrvə/","extraExplanation":["“pro-”常表示“在……之前/早期”，因此 prolarva 可理解为“幼虫之前的早期幼虫形态”。","这是偏专业的生物学词汇，在日常英语中很少出现；在普通科普或教材里更常见的说法是 “first-instar larva（第一龄幼虫）” 或直接说 “early larval stage（早期幼虫阶段）”。"]}
{"word":"prolarval","summary":{"en":"Prolarval means “before the larval stage,” mainly used in biology/entomology.","zh":"Prolarval 指“幼虫期之前的”，主要用于生物学/昆虫学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Relating to, or occurring before, the larval stage (the early immature stage) of an animal, especially an insect.","zh":"（生物）与幼虫期之前有关的；发生在幼虫期之前的（尤指昆虫）。"},"examples":[{"en":"Some insects pass through a brief prolarval stage right after hatching.","zh":"一些昆虫在孵化后会经历一个短暂的幼前期（prolarval stage）。"},{"en":"Researchers compared gene activity in prolarval and larval tissues.","zh":"研究人员比较了幼前期与幼虫期组织中的基因活性。"}]}],"synonyms":["pre-larval","before the larval stage"],"phonetic":"/proʊˈlɑrvəl/","extraExplanation":["“pro-”是前缀，表示“在……之前/向前”，如 *pre-* 类似；“larval”来自 *larva*（幼虫）。因此 *prolarval* 直观意思就是“幼虫期之前的”。","这是偏专业的昆虫学/发育生物学用词，日常英语中很少见。写作时更常见的表达还有 *pre-larval*（幼虫前的）。"]}
{"word":"prolate","summary":{"en":"Prolate describes a shape that is stretched longer along its axis (like a rugby ball), and it can also mean a prolate ellipsoid.","zh":"prolate 指沿轴向被拉长、长于宽的形状（像橄榄球），也可指“长旋转椭球体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stretched or elongated in the direction of its axis; longer than it is wide (often used in geometry, especially for an ellipsoid).","zh":"（形状）沿轴向被拉长的；长于宽的（常用于几何学，尤指长旋转椭球体）。"},"examples":[{"en":"A rugby ball is roughly a prolate shape.","zh":"橄榄球大致是一种长轴拉长的（prolate）形状。"},{"en":"The planet was modeled as a prolate ellipsoid in the simulation.","zh":"在模拟中，这颗行星被建模为长旋转椭球体（prolate ellipsoid）。"},{"en":"The artist drew a prolate oval to suggest motion and speed.","zh":"艺术家画了一个拉长的椭圆来暗示运动与速度。"}]},{"partOfSpeech":"n.","definition":{"en":"A prolate ellipsoid (an ellipsoid stretched along one axis).","zh":"长旋转椭球体（沿某一轴拉长的椭球）。"},"examples":[{"en":"In the diagram, the left solid is a prolate and the right one is an oblate.","zh":"在图示中，左边的立体是长旋转椭球体（prolate），右边是扁旋转椭球体（oblate）。"}]}],"synonyms":["elongated","stretched","long","oval-shaped (informal)"],"phonetic":"/proʊˈleɪt/","extraExplanation":["prolate 常与 oblate 对比：prolate 是“像橄榄球/柠檬那样被拉长”，oblate 是“像扁南瓜/地球那样被压扁”（两端扁、赤道鼓）。","词源来自拉丁语 pro-（向前）+ latus（携带、带来），可理解为“向前拉长/延伸”的感觉；在数学、物理、天文学里很常见。"]}
{"word":"prolately","summary":{"en":"“Prolately” is a very rare adverb meaning “in a prolate (stretched-sphere) shape.”","zh":"“prolately”是非常少见的副词，意思是“呈长球形（拉长球体）的样子”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare) In a prolate manner; shaped like a prolate spheroid (longer than it is wide), like a stretched sphere.","zh":"（非常少见）以“长球形/长椭球形（prolate）”的方式；呈拉长的球体形状（长度大于宽度）。"},"examples":[{"en":"The planet is shaped prolately because it is stretched along its axis.","zh":"这颗行星呈长球形（prolately），因为它沿着自身轴向被拉长。"},{"en":"The model assumes the star is distorted prolately rather than perfectly spherical.","zh":"该模型假设这颗恒星被拉伸成细长的形状（prolately），而不是完美的球体。"}]}],"synonyms":["(rare) prolate-ly","elongatedly (approx.)"],"phonetic":"/ˈproʊleɪtli/","extraExplanation":["“prolately”不是日常英语常用词，主要可能出现在数学、物理或天文学的专业描述里。更常见的是形容词“prolate”（长球形的）。","如果你想表达“最近”，正确拼写是“lately”；如果你想表达“很可能/大概”，常用的是“probably”。你可以告诉我你的句子，我可以帮你确认要用哪个词。"]}
{"word":"prolateness","summary":{"en":"Prolateness most often means (rarely) being late, or (technically) how elongated a prolate shape is.","zh":"prolateness 可指（较少见）迟到，也可指（专业）长球形物体沿一轴拉长的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being late; tardiness (rare in everyday English)","zh":"迟到；晚到（在日常英语中较少用）"},"examples":[{"en":"Please excuse my prolateness—I got stuck in traffic.","zh":"请原谅我来晚了——我堵在路上了。"},{"en":"Her prolateness was unusual; she is normally on time.","zh":"她这次迟到很少见；她平时都很准时。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) the degree to which a shape is prolate—stretched longer along one axis, like a rugby ball","zh":"（专业）长旋度；指形状“长球形（prolate）”的程度，即沿某一轴被拉长（像橄榄球）"},"examples":[{"en":"The planet’s prolateness increases with faster rotation.","zh":"行星自转越快，它的长旋度往往越大。"},{"en":"Researchers measured the prolateness of the spheroid from imaging data.","zh":"研究人员根据成像数据测量了该椭球体的长旋度。"}]}],"synonyms":["lateness","tardiness","elongation"],"phonetic":"ˈproʊleɪtnəs","extraExplanation":["“prolateness”在表示“迟到”时非常少见，日常更常用的是“lateness / tardiness”。如果你想写得自然，通常用：Sorry for being late. / Sorry for my lateness.","在科学语境中，“prolateness”更常见，尤其在天文学、地球物理或几何中，用来描述物体相对“扁球形（oblate）/长球形（prolate）”的形变特征。"]}
{"word":"prolation","summary":{"en":"Prolation is mainly a music-theory term for rhythmic proportion in early notation; rarely, it can mean the act of uttering words.","zh":"Prolation 主要是音乐理论术语，指早期记谱中的节奏比例规则；较少见时也可指“发声/说话”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) A proportional relationship of note values (rhythmic lengths), especially in medieval and Renaissance mensural notation; it tells performers how to interpret timing when the “beat” changes by a ratio.","zh":"（音乐）音符时值（节奏长度）的比例关系，尤指中世纪与文艺复兴时期的“量值记谱法”中的比例规则；用于说明拍子如何按某个比例变化来演奏。"},"examples":[{"en":"In early polyphonic music, prolation helped singers keep the correct rhythmic proportions.","zh":"在早期复调音乐中，prolation 帮助歌者保持正确的节奏比例。"},{"en":"The score marks a change of prolation, so the same note shapes now sound longer.","zh":"乐谱标注了 prolation 的变化，因此相同的音符形状现在听起来更长。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of uttering or pronouncing something; a spoken expression.","zh":"（罕见）发声或说出（某事）的行为；话语的表达。"},"examples":[{"en":"The poet’s careful prolation made every consonant clear.","zh":"诗人细致的 prolation 使每个辅音都很清晰。"}]}],"synonyms":["proportion (music)","mensuration (music, related)","utterance (rare sense)","pronunciation (rare sense)"],"phonetic":"/proʊˈleɪʃən/","extraExplanation":["在“量值记谱法（mensural notation）”里，prolation 常与 tempus（时值层级）一起描述节拍如何被“二分/三分”。简单说，它是把“一个拍”在不同规则下分成两份或三份的概念，常见于中世纪与文艺复兴时期的乐谱阅读与演奏。","在现代英语里，日常谈论节奏通常会用 meter、rhythm、time signature（拍号）等词；prolation 更偏学术/历史音乐理论语境。"]}
{"word":"prolative","summary":{"en":"A rare grammar term for a case meaning “by way of; through; via,” or the name of that case.","zh":"一个较少见的语法术语：指表示“经由/通过/沿着路线”的格，或指该格本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) describing a case that means “by way of; through; via (a path/route).”","zh":"（语法）指一种“经由……；通过……；沿着……路线”的格（格位）。"},"examples":[{"en":"In some descriptions of Uralic languages, the prolative case marks movement by a route (\"via the forest\").","zh":"在一些对乌拉尔语系语言的描述中，prolative 格用来标记“经由某条路线”的移动（如“经由森林”）。"},{"en":"The grammar notes say the prolative is used for travel paths rather than destinations.","zh":"语法说明指出，prolative 多用于“行进路线”，而不是“目的地”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Grammar) the prolative case itself.","zh":"（语法）prolative 格；经由格（指该格本身）。"},"examples":[{"en":"This textbook lists the prolative among the less common spatial cases.","zh":"这本教材把 prolative 列为较少见的一类空间格。"}]}],"synonyms":["prolative case","perlative (often used for similar meanings in some traditions)"],"phonetic":"/ˈproʊləˌtɪv/","extraExplanation":["prolative 是语言学术语，日常英语里极少见，主要出现在讨论“格系统”的语法书或论文中。","它通常用于讲“路径/路线（route/path）”，可理解为“通过……走”“沿着……走”“经由……去”。不同语言学传统里也可能用 perlative 等术语描述相近概念，具体含义要以该语言/该书的定义为准。"]}
{"word":"prolatively","summary":{"en":"“Prolatively” is a rare adverb used mainly in linguistics, meaning “in a way that indicates motion/passage through.”","zh":"“prolatively”是一个较少见的副词，主要用于语言学，表示“以表达穿过/经由的路径意义的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that expresses movement or passage through something (used mainly in linguistics/grammar, especially with the “prolative case”).","zh":"（主要用于语言学/语法中，尤指“贯格/经由格”）以表示“穿过、经由某处”的方式。"},"examples":[{"en":"In some Uralic languages, a noun can be marked prolatively to mean “through the forest.”","zh":"在一些乌拉尔语系语言中，名词可以用贯格/经由格（prolative）标记来表示“穿过森林”。"},{"en":"The grammar notes that the route is expressed prolatively rather than with a preposition.","zh":"语法注释指出，这里的路线意义是用贯格/经由格（prolatively）表达的，而不是用介词表达的。"}]}],"synonyms":["through","via","by way of","along (a route)"],"phonetic":"/ˈproʊləˌtɪvli/","extraExplanation":["“prolative”来自拉丁语词根，核心含义是“沿着、通过”。在英语里它很少用于日常表达，几乎只出现在语言学论文或语法书中，用来描述某些语言（如芬兰-乌戈尔语系等）用词形变化来表示“通过/经由”的路径意义。英语通常用 through / via / along 等介词来表达同样概念。"]}
{"word":"prole","summary":{"en":"“Prole” means a working-class person, especially used in Orwell’s *1984* to describe the lowest social class.","zh":"“prole”指工人阶级/无产者，尤常见于《1984》中指社会最底层的“无产者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the working class; a proletarian (often informal, sometimes slightly derogatory depending on tone).","zh":"工人阶级成员；无产者（多为非正式用语，语气有时带轻微贬义，取决于语境）。"},"examples":[{"en":"He called the music “prole,” meaning it was made for ordinary working people.","zh":"他把那种音乐叫作“prole”，意思是给普通劳动大众听的。"},{"en":"Don’t use “prole” as an insult—it can sound rude or classist.","zh":"不要把“prole”当作骂人的话用——听起来可能很无礼、带阶级歧视。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in George Orwell’s *1984*) an ordinary person from the lowest social class, seen by the ruling class as unimportant or easily controlled.","zh":"（尤指乔治·奥威尔《1984》中）“无产者/底层民众”，被统治阶级视为无足轻重或容易操控的人。"},"examples":[{"en":"In *1984*, the Party watches everyone, but the proles are largely ignored.","zh":"在《1984》里，党监视所有人，但基本上对“proles”（底层民众）不太在意。"},{"en":"Winston hopes the proles might someday rise up and change society.","zh":"温斯顿希望“proles”有一天能起来改变社会。"}]}],"synonyms":["proletarian","worker","working-class person","laborer"],"phonetic":"/proʊl/","extraExplanation":["“prole”是“proletarian”的口语缩写，日常英语里不算常用；在讨论阶级、政治或文学（尤其《1984》）时更常见。","语域提醒：把人称作“a prole”可能带有轻视意味；更中性、更常见的说法是“working-class people”或“workers”。"]}
{"word":"proleague","summary":{"en":"“Pro league” means a professional (paid, top-level) sports/esports league.","zh":"“Pro league”指职业（有薪、顶级）的体育/电竞联赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a professional league: an organized competition in sports or esports where players/teams are paid and compete at the highest level","zh":"职业联赛：在体育或电竞等领域，由职业选手/队伍（通常领取薪酬）参加的高水平、有组织的联赛/赛事体系"},"examples":[{"en":"She hopes to play in a pro league after college.","zh":"她希望大学毕业后能进入职业联赛。"},{"en":"The team was promoted to the pro league last season.","zh":"这支队伍上赛季升入了职业联赛。"},{"en":"Many fans watch the pro league online every weekend.","zh":"很多粉丝每周末都会在网上看职业联赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective, often written “pro-league”) related to a professional league","zh":"（作形容词，常写作 pro-league）与职业联赛相关的；职业联赛级别的"},"examples":[{"en":"He has pro-league experience but is now coaching younger players.","zh":"他有职业联赛经验，但现在在带年轻选手。"},{"en":"They signed a pro-league contract with a major club.","zh":"他们与一家大俱乐部签下了职业联赛合同。"}]}],"synonyms":["professional league","major league","top-tier league","premier league (context-dependent)"],"phonetic":"/ˈproʊ liːɡ/","extraExplanation":["“Pro league”在英语里是通用说法，字面意思是“professional league（职业联赛）”。写成一个词“proleague”更常见于品牌名、网站名或特定赛事名（尤其是电竞圈），正式写作通常是“pro league”或“pro-league”。","在不同项目中，“pro league”可能指具体联赛名称（如某些国家的职业足球联赛），也可能泛指“职业联赛体系”。阅读时可结合上下文判断是专名还是泛称。"]}
{"word":"proleaguer","summary":{"en":"A pro-leaguer is a person who plays (or is associated with) a professional sports league.","zh":"pro-leaguer 指在职业体育联赛中比赛的运动员（或与职业联赛相关的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a player who competes in a professional sports league; a professional-league athlete","zh":"在职业体育联赛中比赛的运动员；职业联赛选手"},"examples":[{"en":"After college, he became a pro-leaguer and signed with a major team.","zh":"大学毕业后，他成为职业联赛选手，并与一支大球队签约。"},{"en":"Only a few rookies make it to the level of a true pro-leaguer.","zh":"只有少数新人能达到真正职业联赛选手的水平。"}]},{"partOfSpeech":"n.","definition":{"en":"someone associated with or supportive of professional leagues (less common)","zh":"与职业联赛有关的人；支持职业联赛的人（较少见）"},"examples":[{"en":"Some fans call themselves pro-leaguers because they prefer professional leagues to amateur competitions.","zh":"有些球迷自称“pro-leaguers”，因为他们更喜欢职业联赛而不是业余比赛。"}]}],"synonyms":["professional athlete","pro","major-leaguer","professional player"],"phonetic":"/proʊ ˈliːɡər/","extraExplanation":["“proleaguer”更常见的写法是带连字符的 **pro-leaguer**（pro + leaguer）。在新闻、体育评论或球迷讨论里偶尔会看到不带连字符的拼写，但并不算标准常用词。","如果你原本想查的是 **prologuer**（写序言/开场白的人）或 **prologuist**，它们和“职业联赛选手”是不同的词，拼写很接近，容易混淆。"]}
{"word":"prolectite","summary":{"en":"“Prolectite” is not a standard English word; it’s likely a misspelling (often of “proclitic” or “proleptic”).","zh":"“prolectite”不是标准常用英语词；很可能是拼写错误（常见可能是“proclitic”或“proleptic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or rare technical term. Common near-matches are “proclitic” (linguistics) and “proleptic” (rhetoric/literature).","zh":"这不是常见词典中的标准英语词；很可能是拼写错误或极少见的专业术语。常见的相近词包括“proclitic”（语言学术语）和“proleptic”（修辞/文学术语）。"},"examples":[{"en":"I couldn’t find “prolectite” in a dictionary—did you mean “proclitic” or “proleptic”?","zh":"我在词典里找不到“prolectite”——你是不是想写“proclitic”或“proleptic”？"},{"en":"If you tell me the sentence you saw it in, I can identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断正确的词。"}]}],"synonyms":["(possible intended) proclitic","(possible intended) proleptic"],"phonetic":"/proʊˈlɛktaɪt/","extraExplanation":["你可能想找的是：\n1）proclitic /proʊˈklɪtɪk/（语言学）：指“前附着词/前接词”，例如英语口语里常把 *I will* 说成 *I’ll*，其中 *’ll* 属于 clitic；而 proclitic 是附着在后面词之前的那种。\n2）proleptic /proʊˈlɛptɪk/（修辞/文学）：指“预叙/预示”，在叙事中提前提到后面才会发生的事。\n如果你能提供来源（文章/教材/截图），我也可以判断它是否其实是某个矿物或专有名词的拼写。"]}
{"word":"proleg","summary":{"en":"A proleg is a soft, leg-like appendage on a caterpillar’s abdomen used for gripping and movement.","zh":"proleg 指毛毛虫等幼虫腹部的柔软“假足/腹足”，用于抓握和移动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of some insect larvae, especially caterpillars) a short, fleshy leg-like appendage on the abdomen used for gripping and moving; not a true jointed leg.","zh":"（某些昆虫幼虫，尤指毛毛虫的）腹部上的“假足/腹足”，短而肉质，用来抓握与移动；不是真正有节的足。"},"examples":[{"en":"Caterpillars use their prolegs to grip leaves and branches.","zh":"毛毛虫用假足抓住叶子和树枝。"},{"en":"Under a microscope, you can see tiny hooks on the prolegs that help the larva hold on.","zh":"在显微镜下，你能看到假足上有细小的钩，帮助幼虫牢牢附着。"}]}],"synonyms":["false leg","abdominal proleg","larval proleg"],"phonetic":"/ˈproʊˌlɛɡ/","extraExplanation":["词源上可理解为“pro-（在前/替代）+ leg（腿）”，意思是“像腿一样的结构”，但它与昆虫真正的胸足不同：真正的足有明显的关节；假足多为柔软肉质，常带小钩（crochets）用来抓附。"]}
{"word":"prolegate","summary":{"en":"“Prolegate” is not a standard English word; it is likely a misspelling of “propagate” or “proliferate.”","zh":"“prolegate”并非规范英语词，通常是“propagate”或“proliferate”等词的拼写误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern usage; most often a misspelling of similar-looking verbs (especially “propagate” or “proliferate”).","zh":"现代英语中并非常用/规范词；多见于拼写错误，常被误写为与其形近的动词（尤其是“propagate”或“proliferate”）。"},"examples":[{"en":"I can’t find “prolegate” in a dictionary—did you mean “propagate” (spread an idea) or “proliferate” (increase quickly)?","zh":"我在词典里找不到“prolegate”——你想写的是“propagate”（传播观念）还是“proliferate”（迅速增加）吗？"}]}],"synonyms":["propagate","proliferate","delegate"],"phonetic":"/ˈproʊlɪˌɡeɪt/","extraExplanation":["“prolegate”在主流词典与语料中几乎不作为独立词条出现；在学习写作中更实用的是确认你真正想表达的意思：\n- 如果是“传播/宣传（观点、信息、宗教等）”，通常用 propagate /ˈprɑpəˌɡeɪt/。\n- 如果是“（数量）激增/迅速繁殖”，通常用 proliferate /prəˈlɪfəˌreɪt/。\n- 如果你想表达“委派/派遣”，用 delegate /ˈdɛləˌɡeɪt/（动词）或 delegation（名词）。\n把你的原句发我，我可以帮你选最准确的词。"]}
{"word":"prolegislative","summary":{"en":"Prolegislative means supporting lawmaking or the role of a legislature.","zh":"prolegislative 指“支持立法/支持立法机关作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting proposed laws, lawmaking, or the work/powers of a legislature","zh":"支持立法、支持制定法律，或支持立法机关（议会/国会）工作的"},"examples":[{"en":"The group launched a prolegislative campaign to push the bill through Congress.","zh":"该团体发起了一场支持立法的宣传活动，推动该法案在国会通过。"},{"en":"Her prolegislative stance favors clearer rules rather than relying on informal agreements.","zh":"她的支持立法立场更倾向于用更明确的规则，而不是依赖非正式协议。"},{"en":"Some voters saw the proposal as prolegislative because it strengthened the legislature’s oversight role.","zh":"一些选民认为该提案是支持立法机关的，因为它加强了立法机关的监督作用。"}]}],"synonyms":["pro-legislation","in favor of legislation","supportive of a bill","pro-law","legislation-friendly"],"phonetic":"/ˌproʊˈlɛdʒɪslətɪv/","extraExplanation":["这是一个相对少见、偏政治语境的形容词：pro-（支持）+ legislative（立法的）。在新闻或学术写作中可能出现，但日常英语里更常用 “supportive of legislation / in favor of legislation / pro-law / pro-bill”。","含义会随语境略有变化：既可以指“支持某项法案/立法行动”，也可以指“倾向强化立法机关权力/作用”（例如相对于行政权）。"]}
{"word":"prolegomena","summary":{"en":"Prolegomena are formal introductory remarks or preliminary principles given before the main argument or text.","zh":"prolegomena 指在正文或主要论证之前的正式“序论/前言”或“前提说明”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Introductory remarks or a preliminary discussion that comes before the main work, often explaining purpose, background, or method.","zh":"（书或研究的）前言、序论；正式内容之前的导论性说明，常用来交代目的、背景或方法。"},"examples":[{"en":"The book begins with prolegomena on how the author defines “culture.”","zh":"这本书以一段“序论”开篇，说明作者如何界定“文化”。"},{"en":"Before we debate the topic, I’d like to offer a few prolegomena about key terms.","zh":"在我们讨论这个话题前，我想先对几个关键术语作一点“引言式说明”。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of preliminary principles or assumptions that must be stated before a theory or argument can be understood.","zh":"（理论/论证的）预备原则或前提说明；为理解后续论证而必须先交代的基本假设。"},"examples":[{"en":"Her prolegomena clarify the assumptions behind the model.","zh":"她的“前提说明”澄清了该模型背后的假设。"},{"en":"These prolegomena are necessary to follow the argument that comes next.","zh":"要理解接下来的论证，这些“前提交代”是必要的。"}]}],"synonyms":["introduction","preface","preliminaries","opening remarks","foreword"],"phonetic":"/ˌproʊlɪˈɡɑmɪnə/","extraExplanation":["“Prolegomena”来自希腊语，原意是“先说的话”。它常见于学术著作标题或章节名，语气正式，日常口语里更常用“introduction / preface / preliminaries”。","该词形式上是复数（-a 结尾），但在英语里常当作一个整体来用；有时也会见到单数形式“prolegomenon”，但较少见。","经典例子：康德著名作品《Prolegomena to Any Future Metaphysics》（《未来形而上学导论》），使这个词在哲学与学术写作中更为常见。"]}
{"word":"prolegomenal","summary":{"en":"Prolegomenal means “introductory” or “preliminary,” especially in academic writing.","zh":"prolegomenal 指“导言性的、序论性的”，多用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as an introduction or preliminary discussion, especially to a serious academic or philosophical work.","zh":"（尤指学术或哲学著作）作为导言的；序论性的；前置说明的。"},"examples":[{"en":"The first chapter is prolegomenal, explaining key terms before the main argument begins.","zh":"第一章是序论性的，在主要论证开始前先解释关键术语。"},{"en":"Her prolegomenal remarks helped readers understand the historical background.","zh":"她的导言性说明帮助读者理解历史背景。"}]}],"synonyms":["introductory","preliminary","prefatory","preparatory","propaedeutic"],"phonetic":"/ˌproʊlɪˈɡɑmənəl/","extraExplanation":["“prolegomenal”来自名词“prolegomenon / prolegomena”，常见于人文学科写作，语气偏正式、学术。","“Prolegomena”常以复数形式出现，表示“（某书的）绪论/导论”，例如康德《Prolegomena to Any Future Metaphysics》（《未来形而上学导论》）。","使用场景上，它通常修饰“remarks / chapter / discussion / section”等，表示“用来铺垫、设定框架、界定概念”的那部分内容。"]}
{"word":"prolegomenary","summary":{"en":"Prolegomenary means introductory or preliminary—meant to come before the main discussion.","zh":"Prolegomenary 指“引言性的、序论性的”，用于在正式内容之前做铺垫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as an introduction or preliminary discussion; introductory in nature.","zh":"作为导言或前置讨论的；序言性的、引言性的。"},"examples":[{"en":"The first chapter is prolegomenary, explaining key terms before the main argument.","zh":"第一章是序言性的，在进入主要论证前先解释关键术语。"},{"en":"She wrote a prolegomenary note to help readers understand the historical context.","zh":"她写了一段引言式的说明，帮助读者理解历史背景。"}]}],"synonyms":["introductory","preliminary","prefatory","proemial"],"phonetic":"/ˌproʊlɪˈɡɑːməˌnɛri/","extraExplanation":["“prolegomenary”较少见，更常见的相关词是名词“prolegomenon / prolegomena（单/复数）”，指书或论文开头的“序论、前言、导论”。在学术写作里，你也常看到“introductory / preliminary / prefatory”。","词源来自希腊语 pro-（在前）+ legein（说），字面意思是“事先说的话”。在哲学史上，康德的书名《Prolegomena to Any Future Metaphysics》使“prolegomena/序论”这一用法更广为人知。"]}
{"word":"prolegomenist","summary":{"en":"A prolegomenist is someone who writes formal scholarly introductory remarks (prolegomena) to a work.","zh":"prolegomenist 指撰写学术性“序论/导言（prolegomena）”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or provides prolegomena—formal introductory remarks (often scholarly) that come before a main work","zh":"撰写或提供“序论 / 绪论 / 导言”（prolegomena）的人；常指在学术著作前写正式引言的人"},"examples":[{"en":"As a prolegomenist, she explained the key terms before the book’s main argument began.","zh":"作为一名序论撰写者，她在正文论证开始前先解释了关键术语。"},{"en":"The editor hired a prolegomenist to write an introductory essay for the new translation.","zh":"编辑请来一位序论作者，为新版译著写一篇导言。"}]}],"synonyms":["writer of the introduction","preface writer","introducer","commentator"],"phonetic":"/ˌproʊlɪˈɡɑmənɪst/","extraExplanation":["“prolegomenist”较罕见，多见于学术语境；更常用的表达是“the author of the prolegomena”或直接说“the writer of the introduction / preface”。","词源：prolegomena 源自希腊语，意为“先说的话（things said beforehand）”。在哲学与古典学中常见，例如康德的《Prolegomena to Any Future Metaphysics（未来形而上学导论）》使该词在英语学术界更为人熟知。","注意区分：preface/foreword/introduction 都可译为“序/前言/导言”，但 prolegomena 往往更强调“为理解后文所必需的理论前置说明”，语气更学术、更系统。"]}
{"word":"prolegomenon","summary":{"en":"A formal scholarly introduction that lays out background and key concepts before the main work.","zh":"指较正式、学术色彩浓的“序论/导言”，在正文前交代背景与关键概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introductory essay or set of remarks at the beginning of a book or scholarly work, explaining background, purpose, or key ideas.","zh":"（书籍或学术著作的）序论、导言；在正文前用来说明背景、目的或核心观点的引言部分。"},"examples":[{"en":"The book opens with a prolegomenon on why the author thinks translation is an art, not a science.","zh":"这本书以一篇序论开头，说明作者为何认为翻译是一门艺术而不是科学。"},{"en":"Before diving into the data, the professor wrote a short prolegomenon to define the main terms.","zh":"在进入数据分析之前，教授写了一段简短的序论来界定主要术语。"}]}],"synonyms":["introduction","preface","foreword","preliminary remarks","prologue"],"phonetic":"/proʊˌlɛˈɡɑːmənɑːn/","extraExplanation":["这个词来自希腊语 *pro-*（在前）+ *legein*（说、陈述），字面意思是“预先说的话”。因此常用于学术写作，语气比普通的 *introduction* 更正式、更“学术”。","常见复数形式是 *prolegomena*（/proʊˌlɛˈɡɑːmə/），在学术书名里很常见，例如：*Prolegomena to…*（“……的序论/导论”）。著名例子是康德的 *Prolegomena to Any Future Metaphysics*（《任何未来形而上学的序论》）。","学习时可把它理解为“进入正文之前的必要铺垫”：不仅是介绍，还常包含研究范围、方法、概念定义或写作立场。"]}
{"word":"prolegomenona","summary":{"en":"Prolegomena means introductory or preliminary remarks, especially in academic writing (often treated as a plural noun).","zh":"Prolegomena 指学术写作中用于引入正文的序言/导论/前言（常用作复数名词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an introduction or preliminary remarks to a book, lecture, or scholarly work; background that prepares you for what follows (often used as a plural noun).","zh":"（书、讲座或学术著作的）序言；前言；导论；用于铺垫和引入正文的背景说明（常用复数形式）。"},"examples":[{"en":"The editor added prolegomena explaining the historical context of the manuscript.","zh":"编辑加了一段导论，解释这份手稿的历史背景。"},{"en":"Before we read the poem, our teacher gave a few prolegomena about the author’s life.","zh":"在读这首诗之前，老师先讲了几句前言，介绍作者的生平。"},{"en":"Kant’s Prolegomena is often read as a shorter introduction to his larger Critique.","zh":"康德的《任何未来形而上学的导论》常被当作他更宏大《纯粹理性批判》的简要入门。"}]}],"synonyms":["introduction","preface","preliminary remarks","foreword","opening remarks"],"phonetic":"/ˌproʊlɪˈɡɑməˌnə/","extraExplanation":["你输入的 **prolegomenona** 通常被视为 **prolegomena** 的误拼。规范形式是：单数 **prolegomenon**（一段“导论/序言”），复数 **prolegomena**（多段“导论/序言”，但在英语里也常把它当作整体标题或“导论部分”来用）。","词源来自希腊语：**pro-**（在前）+ **legomena**（被说出的事），字面意思是“预先说的话”。因此多用于学术语境，比普通的 *introduction* 更正式、更“学术”。"]}
{"word":"prolegomenous","summary":{"en":"“Prolegomenous” means introductory or preliminary, like a preface to a larger work.","zh":"“prolegomenous”意为“序言性的/导论性的”，指为正文作铺垫的内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Introductory; serving as a preliminary discussion or preface to a larger work.","zh":"（较少用）序言性的；作为更大著作的前置讨论或导论。"},"examples":[{"en":"The first chapter is prolegomenous, laying out key terms before the argument begins.","zh":"第一章是序言性的，在论证开始前先界定关键术语。"},{"en":"She wrote a prolegomenous note to explain the historical background.","zh":"她写了一段序言性的说明来交代历史背景。"}]}],"synonyms":["introductory","preliminary","prefatory","prolegomenal"],"phonetic":"ˌproʊlɪˈɡɑməˌnəs","extraExplanation":["“prolegomenous”在现代英语里非常少见；更常用的形式是名词 **prolegomenon**（单数，意为“序论/导言”）和复数 **prolegomena**，以及形容词 **prolegomenal**（“导言性的/序论性的”）。","词源来自希腊语，核心意思是“在……之前说的话”，因此常见于学术写作、哲学、神学等语境中，指为正文铺垫概念与方法的部分。"]}
{"word":"prolegs","summary":{"en":"Prolegs are the non-jointed, leg-like gripping structures on caterpillars and other larvae.","zh":"Prolegs 指毛毛虫等幼虫腹部用于抓握移动的无关节“假足/腹足”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Short, stubby, leg-like structures on some insect larvae (especially caterpillars) used for gripping and moving; they are not true jointed legs.","zh":"某些昆虫幼虫（尤指毛毛虫）身上的“假足/腹足”，用于抓握和移动；不是真正有关节的足。"},"examples":[{"en":"Caterpillars use their prolegs to grip leaves as they crawl.","zh":"毛毛虫爬行时会用假足抓住叶子。"},{"en":"Unlike the three pairs of true legs near the head, the prolegs are on the abdomen.","zh":"与靠近头部的三对真足不同，假足长在腹部。"}]}],"synonyms":["false legs","abdominal legs (context-dependent)"],"phonetic":"/ˈproʊˌlɛɡz/","extraExplanation":["“Pro-”在这里有“替代/附加”的意思，“leg”是“腿/足”，合起来表示“像腿但不是真腿的结构”。","常见于生物学/昆虫学语境。毛毛虫的假足末端常有小钩（crochets），帮助它们牢牢抓住叶面或枝条。"]}
{"word":"proleniency","summary":{"en":"Proleniency means support for a lenient approach, especially in punishment or enforcement.","zh":"proleniency 指“主张宽大处理/从宽处理”，多用于惩罚或执法政策的讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"support for being lenient (not punishing or judging too harshly), especially in law, discipline, or policy.","zh":"主张宽大处理（不严厉惩罚或评判），常用于法律、纪律或政策语境。"},"examples":[{"en":"The judge’s proleniency stance led to more community service sentences than jail time.","zh":"法官偏向宽大处理，因此更多判社区服务而不是监禁。"},{"en":"Some voters are proleniency for nonviolent offenses, while others prefer stricter penalties.","zh":"一些选民支持对非暴力犯罪从宽处理，另一些人则更偏好严厉惩罚。"}]}],"synonyms":["leniency","mercy","clemency","a lenient approach","tolerance"],"phonetic":"/ˌproʊˈliːniənsi/","extraExplanation":["这是一个较少见的构词（多见于评论、社论或政策讨论），由前缀 pro-（“支持/赞成”）+ leniency（“宽容、从宽处理”）组成。","更常见、更自然的表达是：pro-leniency（带连字符）、favor leniency、be lenient、a lenient approach。正式写作中用 “a lenient approach/policy” 往往更地道。"]}
{"word":"prolepses","summary":{"en":"Prolepses are instances of prolepsis: rhetorical anticipation, narrative flashforwards, or (less commonly) a grammatical anticipatory structure.","zh":"prolepses 是 prolepsis 的复数，可指修辞上的预先反驳、叙事上的闪前（预示未来），或较少见的语法前置结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of prolepsis) In speech or writing, the act of anticipating an objection or future point and answering or mentioning it early (a rhetorical “anticipation”).","zh":"（prolepsis 的复数）在演讲或写作中，预先提出可能的反对意见或后续观点，并提前回应或点出（修辞上的“预先反驳/预先说明”）。"},"examples":[{"en":"Her prolepses made the argument feel airtight: she raised the obvious questions and answered them immediately.","zh":"她的多处预先反驳让论证显得滴水不漏：把显而易见的问题先提出来并立刻回答。"},{"en":"Good debaters often use prolepses to address concerns before the audience asks.","zh":"优秀的辩手常用预先反驳，在听众开口之前就先处理疑虑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) In storytelling, a flashforward—showing or describing events that will happen later in the timeline.","zh":"（复数）在叙事中，“闪前/预示未来”：把时间线后面才发生的事情提前呈现或描述出来。"},"examples":[{"en":"The novel uses prolepses to reveal the hero’s fate early on.","zh":"这部小说用多处闪前很早就揭示了主角的命运。"},{"en":"In film, prolepses can create suspense by letting viewers know what’s coming.","zh":"在电影里，闪前能通过让观众提前知道将发生什么来制造悬念。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) In grammar, an anticipatory use where a word (often a pronoun or object) appears early, and the full noun phrase comes later for clarity.","zh":"（复数）在语法中，“前置/预置”结构：某个词（常为代词或宾语）先出现，完整名词短语后置以便更清楚。"},"examples":[{"en":"In “I hate it, that attitude,” the early “it” is a kind of prolepsis.","zh":"在“I hate it, that attitude”里，前面的 it 就是一种前置（prolepsis）用法。"}]}],"synonyms":["anticipation","prebuttal","flashforward","foreshadowing (related)","procatalepsis (related rhetorical term)"],"phonetic":"/proʊˈlɛpsɪs/","extraExplanation":["“prolepsis”来自希腊语，含义接近“预先抓住/提前把握”。在英语学习中最常见的两个领域是：修辞（先回应反对）与叙事学（flashforward，闪前）。语法义相对少见，多见于语言学/文体分析。","文学与叙事批评里常会把 prolepsis 与 “analepsis（倒叙/闪回）”并列讨论：前者把未来提前说，后者把过去插入现在说。"]}
{"word":"prolepsis","summary":{"en":"Prolepsis is (1) a rhetorical move that answers objections before they’re raised, and (2) a grammatical forward-reference to something stated later.","zh":"Prolepsis 指（1）修辞上的“预先反驳/预先回应”，以及（2）语法上的“前指”（先用词指向后文内容）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A figure of speech in which a speaker or writer anticipates an objection or question and answers it in advance.","zh":"（修辞）预先反驳：说话者/作者预想到读者可能提出的反对或疑问，并提前回应。"},"examples":[{"en":"You may think this plan is risky—but the data shows it actually reduces costs.","zh":"你可能觉得这个计划很冒险——但数据表明它其实能降低成本。"},{"en":"Before you ask, yes, we have already tested the software on older phones.","zh":"在你问之前，是的，我们已经在旧手机上测试过这个软件。"}]},{"partOfSpeech":"n.","definition":{"en":"In grammar, the use of a pronoun or word that refers forward to something mentioned later (also called anticipatory “it” or “there” in some contexts).","zh":"（语法）前指：先用代词或词语指向后文将要出现的内容（在某些语境中也与“预备 it/there”相关）。"},"examples":[{"en":"It is surprising that he apologized so quickly. (\"It\" refers forward to the clause.)","zh":"他这么快就道歉，真令人惊讶。（It 前指后面的从句）"},{"en":"There is one thing I need to say: thank you.","zh":"有一件事我得说：谢谢你。（There 先引出后面的内容）"}]}],"synonyms":["anticipation","prebuttal","preemption","procatalepsis"],"phonetic":"/proʊˈlɛpsɪs/","extraExplanation":["这个词常见于文学批评、演讲写作与修辞学课堂。写作中使用 prolepsis 可以让论证更“有预案”，显得更周全，但用太多可能让语气像在防御或说教。","不要把 prolepsis（预先反驳/前指）和 foreshadowing（伏笔/预示情节）混淆：foreshadowing 更偏叙事手法，提示未来将发生的事件；prolepsis 更偏“提前回应/提前指代”。"]}
{"word":"proleptic","summary":{"en":"Proleptic means “anticipating the future,” especially by speaking about a later event as if it already happened, or (in grammar) using a pronoun that points forward to a later noun.","zh":"proleptic 指“预先的/预叙的”：把未来将发生的事提前说得像已经发生；在语法中也可指代词先出现、提前指向后面的名词（前置预指）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing something that anticipates or represents a future event as if it has already happened (often used in grammar, rhetoric, or literary analysis).","zh":"（多用于语法/修辞/文学分析）指“预先的、先行的”：把未来将发生的事提前表达或当作已经发生来叙述。"},"examples":[{"en":"In the novel, the narrator uses a proleptic comment that hints at the hero’s later downfall.","zh":"在小说中，叙述者用了一个“预叙式”的评论，暗示了主人公后来会失败。"},{"en":"The phrase “the late Mr. Smith” is proleptic if Mr. Smith isn’t dead yet in the story’s timeline.","zh":"如果在故事时间线里史密斯先生还没死，那么“已故的史密斯先生”这种说法就是一种“预先式”的表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"In grammar, referring to a word (often a pronoun) that appears earlier than the noun it refers to, anticipating it (cataphoric use).","zh":"（语法）指“前置预指”的用法：某个词（常为代词）在先出现，提前指向后面才出现的名词（类似“前照应/后指代”）。"},"examples":[{"en":"In “When he arrived, John sat down,” the pronoun “he” can be described as proleptic because it points forward to “John.”","zh":"在“When he arrived, John sat down”中，“he”可以说是“前置预指”的，因为它提前指向后面的“John”。"},{"en":"Teachers may call this a proleptic pronoun, but many also use the term “cataphoric.”","zh":"老师可能会把这叫作“proleptic pronoun（前置预指代词）”，不过很多人也用“cataphoric（前照应）”这个术语。"}]}],"synonyms":["anticipatory","forward-looking","predictive","cataphoric (grammar)"],"phonetic":"/ˌproʊˈlɛptɪk/","extraExplanation":["“proleptic”来自希腊语词根，含“预先抓住/先行理解”之意。在文学里常和“foreshadowing（伏笔/预示）”一起出现：foreshadowing 更像“埋线索”，而 proleptic 更像“直接提前说/提前当作已发生”。","相关名词：prolepsis（预叙/预示/前置指代的现象）。常见搭配：proleptic remark（预叙式评论）、proleptic statement（预先式陈述）、proleptic pronoun（前置预指代词）。"]}
{"word":"proleptical","summary":{"en":"Proleptical means “anticipatory” or “proleptic,” often describing a flash-forward or an advance reference to future events.","zh":"Proleptical 指“预先的/预期的”，常用于表示“预叙（闪前）”或提前提及未来事件的表达方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Anticipatory; describing something that refers to or happens in advance (often used in literature, rhetoric, or grammar).","zh":"预先的；预期的；指在事情发生前就先行提及或表现出来的（常用于文学、修辞或语法）。"},"examples":[{"en":"The novel’s proleptical opening hints at the tragic ending before the story really begins.","zh":"这部小说带有“预示性”的开头在故事真正开始前就暗示了悲剧结局。"},{"en":"In a proleptical move, the speaker answered objections before anyone raised them.","zh":"演讲者采取了“先发制人”的方式，在别人提出反对意见之前就先回应了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to “prolepsis,” a technique that jumps forward to future events (a flash-forward).","zh":"与“预叙/预示（prolepsis）”有关的；指叙事中提前展示未来事件的手法（类似“闪前/前置”）。"},"examples":[{"en":"The film uses a proleptical scene to show the hero’s fate years later.","zh":"这部电影用一段“预叙”的场景展示了主角多年后的命运。"},{"en":"Teachers may point out proleptical passages when reading stories that reveal the ending early.","zh":"老师在阅读那些提前透露结局的故事时，可能会指出其中的“预叙”段落。"}]}],"synonyms":["proleptic","anticipatory","predictive","foreshadowing"],"phonetic":"/proʊˈlɛptɪkəl/","extraExplanation":["“proleptical”是较少见的形式，更常见的是“proleptic”。它源自希腊语“prolēpsis”（意为“预先把握/预先设想”）。","在叙事与修辞中，prolepsis 常用于：①提前揭示结局或未来片段（类似 flash-forward）；②先回应潜在反对意见（英语写作里也叫“anticipating objections”）。"]}
{"word":"proleptically","summary":{"en":"“Proleptically” means doing or describing something in advance, as if the future were already present.","zh":"“Proleptically”表示“预先地/预叙地”，在未来尚未发生时就先按已发生来表述或处理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that talks about or treats something as already existing or already true before it actually happens (anticipating the future).","zh":"以“预先发生/预先成立”的方式；在事情真正发生前就先按已发生或已成立来谈论或处理。"},"examples":[{"en":"The novel refers to the hero proleptically, describing his future fame before he earns it.","zh":"这部小说以预叙方式提到主人公，在他真正成名之前就先描写了他未来的名声。"},{"en":"She apologized proleptically, assuming she would be late because of traffic.","zh":"她预先道歉，认为自己会因为堵车而迟到。"}]}],"synonyms":["in advance","anticipatorily","preemptively","predictively"],"phonetic":"/ˌproʊləpˈtɪkli/","extraExplanation":["“proleptically”来自“prolepsis（预叙/预期）”，常见于文学与修辞分析：作者在叙事较早处先透露后面会发生的事（有点像“提前剧透”）。","在语法里，prolepsis 也可指把后面才解释的内容先说出来（例如先用代词，再补充名词：\"I knew it—your plan would fail.\"）。这里的副词 proleptically 用来描述这种“先行/预先”的说法或写法。"]}
{"word":"proleptics","summary":{"en":"Proleptics are preventive measures/agents, or (in writing/grammar) anticipatory expressions that point ahead or pre-answer objections.","zh":"proleptics 可指预防性措施/手段；也可指写作或语法中的“预示/预先回应”的表达方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Preventive measures or agents; things used to prevent a disease or problem (a less common word).","zh":"预防措施或预防性手段；用于防止疾病或问题的东西（较少见用法）。"},"examples":[{"en":"Vaccination, clean water, and mosquito nets are proleptics against many infections.","zh":"疫苗、清洁饮水和蚊帐是预防许多感染的预防性手段。"},{"en":"Good study habits can be proleptics for last-minute stress.","zh":"良好的学习习惯可以是应对临时抱佛脚压力的“预防针”。"}]},{"partOfSpeech":"n.","definition":{"en":"In language and writing, proleptic expressions or constructions—ways of speaking that anticipate something (for example, a future event or a listener’s objection).","zh":"在语言与写作中，指“预示/预先提到”的表达或结构——提前把将发生的事或可能的反对意见说出来。"},"examples":[{"en":"The narrator’s early hints about the ending are proleptics that build suspense.","zh":"叙述者在前文对结局的暗示属于预示性的写法，能营造悬念。"},{"en":"“You’ll say it’s too expensive, but…” uses a proleptic move to anticipate an objection.","zh":"“你可能会说太贵了，不过……”是一种预先回应反对意见的表达方式。"}]}],"synonyms":["preventives","preventive measures","prophylactics","anticipations","foreshadowings"],"phonetic":"/proʊˈlɛptɪks/","extraExplanation":["“proleptics”来自形容词 proleptic（预先的、预示的），源于希腊语 prolepsis，核心含义是“提前抓住/提前说到”。在文学里常与 flashforward（倒叙到未来/预示性片段）相关；在修辞里也可指预先回应对方可能提出的质疑。","在现代英语里，更常见的日常说法是 preventive measures（预防措施）或 prophylactics（预防用品/避孕用品，语境更具体）；“proleptics”相对书面且少见。"]}
{"word":"proles","summary":{"en":"“Proles” means working-class people; it’s often used in political/literary contexts (notably Orwell’s *1984*) and can sound derogatory.","zh":"“proles”指工人阶级/无产者，多见于政治或文学语境（尤其《1984》），且常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Working-class people, especially those seen (often unfairly) as ordinary, uneducated, or lacking political power; short for “proletarians.”","zh":"（复数名词）无产者、工人阶级大众；常带贬义，指被认为普通、缺乏教育或缺少政治影响力的人（“proletarians”的缩略）。"},"examples":[{"en":"In the novel, the Party keeps the proles distracted with cheap entertainment.","zh":"在小说里，党用廉价娱乐让“proles”分心。"},{"en":"Some commentators use “proles” to describe the working majority, but it can sound insulting.","zh":"有些评论者用“proles”指大多数劳动者，但听起来可能带侮辱性。"}]}],"synonyms":["proletarians","the working class","workers","laborers"],"phonetic":"/proʊlz/","extraExplanation":["“proles”最常见于乔治·奥威尔《1984》中：指占人口多数的底层劳动者。奥威尔用这个词强调阶级分化与政治控制，因此在现代英语里常带文学/政治语境。","语气提醒：在现实对话中用“proles”称呼他人容易显得轻蔑；更中性的说法是“working-class people / workers / the working class”。"]}
{"word":"proletaire","summary":{"en":"Proletaire means a working-class person (a proletarian), often used in political or historical contexts.","zh":"proletaire 指“无产者/工人阶级成员”（相当于 proletarian），多用于政治或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the working class, especially someone who earns a living by wage labor and has little or no property","zh":"无产者；工人阶级成员（尤指靠领工资谋生、几乎没有或没有财产的人）"},"examples":[{"en":"In the 19th century, many factory workers were described as proletaires.","zh":"在19世纪，许多工厂工人被称为“proletaires（无产者）”。"},{"en":"The novel focuses on the daily struggles of the proletaire in an industrial city.","zh":"这部小说聚焦于工业城市里无产者的日常挣扎。"}]}],"synonyms":["proletarian","worker","wage earner","member of the proletariat"],"phonetic":"/ˌproʊləˈtɛr/","extraExplanation":["“prolétaire / proletaire”常见于法语或带法语色彩的英文写作中；英语里更常用的形式是 **proletarian**（名词/形容词）或 **the proletariat**（无产阶级，集体名词）。","该词常出现在马克思主义与社会学语境：与拥有资本的 **bourgeoisie（资产阶级）** 对比。用于日常英语时可能显得偏学术或政治化，需注意语境。"]}
{"word":"proletairism","summary":{"en":"A rare term for an ideology focused on the working class (the proletariat), often associated with Marxist thought.","zh":"一个罕用词，指以工人阶级（无产阶级）为中心的思想或意识形态，常与马克思主义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A political or social ideology that centers on the proletariat (working class), often linked to Marxist ideas and working-class leadership.","zh":"（罕用）以无产阶级（工人阶级）为核心的政治或社会思想，常与马克思主义及工人阶级领导相关。"},"examples":[{"en":"In early 20th-century debates, some writers used “proletairism” to argue that workers should lead social change.","zh":"在20世纪早期的一些争论中，有作者用“proletairism”主张工人应当领导社会变革。"},{"en":"The pamphlet praised proletairism and criticized elite-controlled politics.","zh":"这本小册子赞扬proletairism，并批评由精英控制的政治。"}]}],"synonyms":["proletarianism","proletarism","working-class ideology","Marxism (context-dependent)"],"phonetic":"/ˌproʊləˈtɛriəˌrɪzəm/","extraExplanation":["“proletairism”在现代英语中非常少见，更多时候你会看到更常用的拼写与形式：**proletarianism**（无产阶级主义）或 **proletarism**。在写作或学习中，建议优先使用更标准、更常见的 **proletarianism**，以避免读者困惑。","词根提示：**prolet-** 来自拉丁语 *proletarius*，指古罗马社会中“财产很少、主要贡献是子女（proles）的人”，后来在现代政治语境中发展为“无产阶级/工人阶级”的含义。","文化与语境：该词通常出现在政治理论、历史文本或带有意识形态色彩的文章中；日常英语交流里几乎不用。","文学/思想脉络：与马克思主义语境中的 **proletariat**（无产阶级）及“工人阶级的政治主体性”讨论有关，常与“bourgeois（资产阶级）”“class struggle（阶级斗争）”等概念同场出现。"]}
{"word":"proletarian","summary":{"en":"Proletarian means a member of the working class with little property, or something related to that class (often in Marxist contexts).","zh":"proletarian 指“无产者/无产阶级成员”，也可作形容词表示“无产阶级的”，多见于马克思主义或阶级政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker (especially an industrial wage worker) who does not own much property; in Marxist theory, a member of the working class who sells labor to live.","zh":"无产者；（尤指工业）靠工资生活、几乎没有私有财产的工人阶级成员；在马克思主义理论中指出卖劳动力维持生活的工人阶级。"},"examples":[{"en":"In Marxist theory, the proletarian and the capitalist have opposing economic interests.","zh":"在马克思主义理论中，无产者与资本家在经济利益上相对立。"},{"en":"Many early 20th-century writers described the daily life of proletarian families in crowded cities.","zh":"许多20世纪初的作家描写了拥挤城市里无产者家庭的日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the working class, especially in the context of Marxism or class politics.","zh":"无产阶级的；与工人阶级有关的（常用于马克思主义或阶级政治语境）。"},"examples":[{"en":"The novel has a strong proletarian viewpoint, focusing on factory workers.","zh":"这部小说带有鲜明的无产阶级视角，聚焦工厂工人。"},{"en":"He criticized the policy for ignoring proletarian concerns like wages and housing.","zh":"他批评该政策忽视了无产阶级对工资和住房等问题的关切。"}]}],"synonyms":["worker","working-class","laborer","wage earner"],"phonetic":"/ˌproʊləˈtɛriən/","extraExplanation":["“proletarian”来自拉丁语 *proletarius*，在古罗马指“除了孩子（后代）几乎没有财产、能为国家贡献的只有子女的人”。后来在19世纪的社会思想与马克思主义中，逐渐固定为“无产阶级/工人阶级”的术语。","语体提醒：它常带政治、历史与学术色彩（例如“proletarian revolution 无产阶级革命”“proletarian literature 无产阶级文学”）。在日常英语里，如果只是说“工人/劳动者”，更常用 *worker* 或 *working-class*。","文学与文化：你可能会在俄国文学、20世纪现实主义作品，或政治演讲/历史文本中看到它，用来强调阶级身份与社会结构。"]}
{"word":"proletarianise","summary":{"en":"Proletarianise means “to make (someone/something) proletarian” or “to become proletarian,” usually in a Marxist or political context.","zh":"proletarianise 指“使……无产阶级化”或“变得无产阶级化”，多用于马克思主义或政治语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a person, group, or society more like the proletariat (the working class), especially in terms of economic position, culture, or politics","zh":"使（个人、群体或社会）更“无产阶级化”（更接近工人阶级的经济地位、文化或政治立场）"},"examples":[{"en":"The policy was meant to proletarianise rural workers by pushing them into factory jobs.","zh":"这项政策旨在通过把农村劳动力推入工厂工作，使他们无产阶级化。"},{"en":"Some critics said the movement tried to proletarianise art and literature.","zh":"一些批评者说，这场运动试图让艺术和文学无产阶级化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become proletarian; to shift toward a working-class position or identity","zh":"（某人或某群体）变得无产阶级化；向工人阶级的处境或身份转变"},"examples":[{"en":"As small businesses closed, many families proletarianised over time.","zh":"随着小企业倒闭，许多家庭逐渐无产阶级化。"},{"en":"In the novel, the young intellectual proletarianises and joins the workers.","zh":"在小说中，这位年轻知识分子无产阶级化并加入工人行列。"}]}],"synonyms":["proletarianize","radicalize (in some contexts)","working-classify (rare)"],"phonetic":"/proʊˌlɛtəˈrɛriəˌnaɪz/","extraExplanation":["这是一个带有明显马克思主义/社会主义语境的词，常见于政治理论、历史研究或批评文章中；日常英语里很少用。","拼写上，英式英语常写作 proletarianise，美式英语更常见 proletarianize；意思相同。","词根 proletarian 来自“proletariat（无产阶级）”，通常指主要靠出卖劳动获得收入的工人阶层。"]}
{"word":"proletarianised","summary":{"en":"Proletarianised means “made part of the wage-earning working class,” often in social or Marxist analysis.","zh":"proletarianised 指“被无产阶级化”，即转变为以工资为生的工人阶级，常见于社会学或马克思主义语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or group) turned into wage workers with little or no property; made part of the working class (the proletariat).","zh":"（指个人或群体）被转变为靠工资谋生、几乎没有财产的人；被“无产阶级化”。"},"examples":[{"en":"As small farms failed, many rural families became proletarianised and moved to the city for factory work.","zh":"随着小农场倒闭，许多农村家庭被无产阶级化，进城到工厂工作。"},{"en":"The report argues that rapid industrial change has proletarianised skilled workers by reducing their control over their work.","zh":"报告认为，快速的产业变革使熟练工人无产阶级化，因为他们对工作的掌控被削弱了。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “proletarianise/proletarianize”: to make someone or something proletarian (part of the wage-earning working class).","zh":"“proletarianise/proletarianize（使无产阶级化）”的过去式/过去分词：使某人或某群体成为以工资为生的工人阶级。"},"examples":[{"en":"Industrialization proletarianised many artisans who once worked independently.","zh":"工业化使许多曾经独立谋生的手工业者无产阶级化。"}]}],"synonyms":["proletarianized","reduced to wage labor","made working-class","impoverished (context-dependent)"],"phonetic":"/prəˌliːtəˈriənaɪzd/","extraExplanation":["这是一个典型的马克思主义/社会学用语，常用于讨论“阶级结构变化”。“proletarianise/proletarianize”表示人们失去土地、工具或小企业等生产资料后，只能出卖劳动力领取工资。","拼写上：英式常见 proletarianised / proletarianise；美式更常见 proletarianized / proletarianize。学术写作中两者都可见。","语体上较正式、偏学术或政治经济学讨论；日常英语里更常用 become working-class / become wage workers / lose their livelihood 等说法。"]}
{"word":"proletarianising","summary":{"en":"Proletarianising means making someone/something become part of the working class (or becoming so), especially through loss of economic independence.","zh":"proletarianising 指“使……无产阶级化”或“正在无产阶级化”，常用于学术/政治经济讨论，强调经济独立性下降、转为依赖工资劳动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Making someone or something become proletarian (part of the working class), especially by reducing their economic independence or status; causing a group to become more like wage laborers.","zh":"使某人或某群体“无产阶级化”（更像工人阶级/雇佣劳动者），尤指削弱其经济独立性或社会地位。"},"examples":[{"en":"Rapid industrial growth was proletarianising many rural families.","zh":"快速的工业化正在使许多农村家庭无产阶级化。"},{"en":"Some critics argued that the reforms were proletarianising small shop owners.","zh":"一些批评者认为这些改革正在让小店主无产阶级化。"}]},{"partOfSpeech":"v.","definition":{"en":"Becoming proletarian; moving into working‑class conditions (used to describe a person, group, or society).","zh":"（某人/群体/社会）变得无产阶级化，逐渐进入工人阶级式的生活与劳动条件。"},"examples":[{"en":"As land prices rose, the community was proletarianising.","zh":"随着地价上涨，这个社区正在无产阶级化。"},{"en":"He wrote about an intellectual class proletarianising under economic pressure.","zh":"他写到知识阶层在经济压力下逐渐无产阶级化。"}]}],"synonyms":["proletarianizing","working-classing (rare)","declassing (context-dependent)","impoverishing (partial)"],"phonetic":"/proʊˌliːtəˈriənaɪzɪŋ/","extraExplanation":["“proletarianising”多见于社会学、历史与政治经济学写作，语感偏学术/批判性，常与马克思主义语境相关：proletariat（无产阶级）指主要依靠出卖劳动力获得工资的人群。","词形来源：proletarian（无产阶级的）+ -ise/-ize（使……化）+ -ing（进行/动名词）。英式常拼作 proletarianise，美国常见 proletarianize。","文学与思想语境中，它常用于讨论工业化、城市化、资本主义发展对小农、手工业者或中产群体“向雇佣劳动者转化”的过程。"]}
{"word":"proletarianism","summary":{"en":"Proletarianism means the working-class–centered ideas or movement, often linked to Marxism/socialism.","zh":"Proletarianism 指以工人阶级/无产阶级为中心的思想或运动，常与马克思主义/社会主义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ideas, conditions, or political movement connected with the proletariat (working-class people), especially in Marxist/socialist contexts.","zh":"无产阶级思想／无产阶级立场／无产阶级运动（尤指马克思主义或社会主义语境中与工人阶级相关的理念、处境或政治运动）。"},"examples":[{"en":"The novel was praised for its proletarianism and its focus on factory workers’ lives.","zh":"这部小说因其无产阶级立场以及对工厂工人生活的关注而受到称赞。"},{"en":"In the early 20th century, proletarianism influenced labor politics and literature in many countries.","zh":"在20世纪初，无产阶级思潮影响了许多国家的劳工政治与文学。"}]}],"synonyms":["working-class politics","proletarian ideology","class-consciousness","labor movement (context-dependent)"],"phonetic":"/ˌproʊləˈtɛriənˌɪzəm/","extraExplanation":["“proletarianism”多用于学术写作、政治理论与文学评论，语气偏正式。它常指一种“以工人阶级为中心的观点/价值取向”，也可指以工人阶级为主体的政治行动或文化潮流。","词源上来自“proletarian（无产阶级的）+ -ism（主义/思潮）”。在文学中常与“proletarian literature（无产阶级文学）”“working-class realism（工人阶级现实主义）”等概念相近。"]}
{"word":"proletarianization","summary":{"en":"Proletarianization is the process of becoming part of the wage-earning working class, often by losing economic independence or control of one’s livelihood.","zh":"Proletarianization 指“无产阶级化”：人们因失去经济独立性或生产资料而转为依靠工资生活的工人阶级的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which people (often peasants, artisans, or independent workers) lose control of their own means of making a living and become wage workers (the “proletariat”)","zh":"无产阶级化：人们（常见为农民、手工业者或自雇者）失去自主谋生的生产资料与经济独立性，转而成为靠工资生活的雇佣劳动者（“无产阶级”）的过程"},"examples":[{"en":"Industrialization accelerated proletarianization as small farmers moved to cities for factory jobs.","zh":"工业化加速了无产阶级化：小农为了工厂工作迁入城市。"},{"en":"Some historians link proletarianization to the decline of traditional crafts and guilds.","zh":"一些历史学家把无产阶级化与传统手工艺和行会的衰落联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"the change in the social and political identity of a group as it comes to see itself as part of the working class","zh":"（延伸义）阶级身份转变：某个群体在社会与政治认同上逐渐把自己视为工人阶级的一部分"},"examples":[{"en":"The essay discusses proletarianization not only as an economic shift but also as a cultural one.","zh":"这篇文章讨论的无产阶级化不仅是经济转变，也是文化转变。"},{"en":"Writers of the period debated whether proletarianization would increase class consciousness.","zh":"当时的作家争论无产阶级化是否会增强阶级意识。"}]}],"synonyms":["proletarization","deskilling (related)","wage-labor formation (related)"],"phonetic":"/prəˌliːtəˌrɪənaɪˈzeɪʃən/","extraExplanation":["这个词常见于马克思主义与社会史写作：proletarian（无产阶级的）+ -ize（使……化）+ -ation（过程/结果）。核心意思不是“变穷”那么简单，而是从“自有土地/工具、相对自主的生产者”变成“必须出售劳动力换工资的人”。","相关学术语境中常与：enclosure（圈地运动）、industrialization（工业化）、urbanization（城市化）、wage labor（雇佣劳动）、class consciousness（阶级意识）一起出现。","文学/思想史中常可联系到对工人阶级形成的描写，例如狄更斯等工业时代作品涉及工厂劳动与城市贫困，但“proletarianization”本身更偏学术词汇。"]}
{"word":"proletarianize","summary":{"en":"To proletarianize is to make someone or something become more part of the working class, often used in political or Marxist contexts.","zh":"proletarianize 指“使……无产阶级化/工人阶级化”，多用于政治或马克思主义语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(usually in Marxist or political writing) to make someone or something part of the working class (the proletariat), especially by changing their job, lifestyle, or economic position.","zh":"（多用于马克思主义或政治语境）使某人或某事物“无产阶级化”，即使其成为工人阶级（无产阶级）的一部分，通常指通过工作、生活方式或经济地位的变化。"},"examples":[{"en":"Some critics say the policy could proletarianize small business owners by pushing them into wage labor.","zh":"一些批评者认为，这项政策可能会使小企业主无产阶级化，把他们推向受雇劳动。"},{"en":"The novel follows a rural family as economic hardship proletarianizes them in the city.","zh":"这部小说描写了一个农村家庭在城市中因经济困境而逐渐无产阶级化的过程。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give a group, institution, or culture a more working-class character or perspective.","zh":"使某个群体、机构或文化呈现更强的工人阶级特征或视角（带有“工人化/大众化”的意味）。"},"examples":[{"en":"The movement aimed to proletarianize art by focusing on ordinary workers’ lives.","zh":"该运动试图通过关注普通工人的生活来使艺术无产阶级化。"},{"en":"They wanted to proletarianize the party’s image and language.","zh":"他们希望让该党的形象和语言更“工人阶级化”。"}]}],"synonyms":["proletarize","reduce to wage labor (contextual)","make working-class (contextual)"],"phonetic":"/prəˈliː.təˌri.əˌnaɪz/","extraExplanation":["“proletarianize”来自“proletarian（无产阶级的）+ -ize（使……化）”。它常见于社会学、政治学与历史研究，尤其与马克思主义关于阶级结构与阶级形成（class formation）的讨论相关。","语气上偏学术或意识形态色彩，日常英语里不常用；写作中使用时，通常需要上下文说明是经济地位变化（被迫进入雇佣劳动）还是文化/组织风格的“工人化”。"]}
{"word":"proletarianly","summary":{"en":"“Proletarianly” means “in a working-class/proletarian way or from a proletarian perspective.”","zh":"“proletarianly”表示“以无产阶级/工人阶级的方式或视角”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is typical of, associated with, or from the perspective of the proletariat (the working class).","zh":"以无产阶级（工人阶级）的方式；从工人阶级的角度。"},"examples":[{"en":"The novel portrays city life proletarianly, focusing on wages, rent, and long shifts.","zh":"这部小说以无产阶级的视角描写城市生活，聚焦工资、房租和漫长的工时。"},{"en":"The speech appealed proletarianly to ordinary workers rather than to elites.","zh":"这场演讲以工人阶级的方式诉诸普通劳动者，而不是精英阶层。"}]}],"synonyms":["in a proletarian way","from a working-class perspective","working-classly (rare)"],"phonetic":"/ˌproʊləˈtɛriənli/","extraExplanation":["“proletarianly”是由形容词“proletarian”（无产阶级的）加副词后缀“-ly”构成，但在现代英语中非常少见。更常见的表达是“in a proletarian way/manner”或直接用“from a working-class perspective”。","“proletariat/无产阶级”来自马克思主义语境，常见于政治、社会学与文学批评中。由于带有明确的意识形态色彩，使用时要注意语境与语气，避免在日常场合造成不必要的对立或误解。","文学与批评语境里，它常用于描述作品的“阶级立场”或叙述方式（例如关注劳动、贫困、阶级斗争等主题）。"]}
{"word":"proletarianness","summary":{"en":"Proletarianness means the quality of being proletarian—having working-class identity, perspective, or characteristics.","zh":"Proletarianness 指“无产阶级性/工人阶级属性”，即呈现或具有工人阶级的身份、视角或特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being proletarian (belonging to, relating to, or characteristic of the working class).","zh":"“无产阶级/工人阶级”属性；无产阶级性（指属于、关于或具有工人阶级特征的状态或性质）。"},"examples":[{"en":"The novel’s proletarianness shows in its focus on factory life and low wages.","zh":"这部小说的无产阶级性体现在它聚焦工厂生活和低工资。"},{"en":"Some critics argued that the film’s proletarianness was more political than realistic.","zh":"一些评论家认为这部电影的无产阶级性更多是政治姿态，而不够写实。"}]}],"synonyms":["working-class character","proletarian character","proletarian nature","proletarian identity","proletarianism"],"phonetic":"/proʊləˈtɛriənnəs/","extraExplanation":["“proletarianness”比较少见，更常见的表达是“proletarian character / proletarian nature / proletarian identity（无产阶级特征/性质/身份）”，或在政治理论语境中用“proletarianism（无产阶级立场/无产阶级主义）”。","词源与语境：proletarian 来自拉丁语 *proletarius*，在马克思主义语境里常指“无产阶级”（主要依靠出卖劳动力谋生、缺乏生产资料的劳动者）。在文学/电影评论中，“proletarianness”常用来评价作品是否呈现工人阶级经验、视角与价值。"]}
{"word":"proletarians","summary":{"en":"Proletarians are working-class people who mainly live by earning wages and own little property, especially in Marxist contexts.","zh":"Proletarians 指主要靠工资劳动谋生、财产较少的无产阶级，常见于马克思主义语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Working-class people who do not own much property and mainly earn a living by working for wages, especially in Marxist/socialist writing.","zh":"无产阶级（主要靠出卖劳动力赚取工资、缺乏生产资料/财产的人），尤用于马克思主义/社会主义语境。"},"examples":[{"en":"In Marxist theory, proletarians and capitalists have opposing economic interests.","zh":"在马克思主义理论中，无产者与资本家在经济利益上相对立。"},{"en":"The novel portrays proletarians struggling to survive in an industrial city.","zh":"这部小说描写了工业城市里无产者为生存而挣扎。"}]}],"synonyms":["workers","the working class","wage earners","laborers"],"phonetic":"/ˌproʊləˈtɛriənz/","extraExplanation":["“proletarians”是“proletarian”的复数。","词源来自拉丁语 *proletarius*，原指“只有子女（proles）可贡献于国家的人”，后来在近代政治经济学中逐渐发展为“缺乏财产、依靠劳动谋生的阶级”。","在日常英语中，人们更常用“the working class / workers”来表达“工人阶级/劳动者”；“proletarians”往往带有更强的意识形态或历史语境（如阶级斗争、革命）。"]}
{"word":"proletariat","summary":{"en":"Proletariat means the working class, especially people who own little property and live by wage labor.","zh":"Proletariat 指无产阶级/工人阶级，尤指财产很少、主要靠工资劳动维生的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the working class, especially people who do not own much property and who earn a living mainly by working for wages","zh":"无产阶级；工人阶级（尤指几乎不拥有财产、主要靠领取工资维生的人）"},"examples":[{"en":"In Marxist theory, the proletariat and the bourgeoisie are in conflict.","zh":"在马克思主义理论中，无产阶级与资产阶级处于冲突之中。"},{"en":"The novel portrays the daily struggles of the urban proletariat.","zh":"这部小说描写了城市无产阶级的日常艰难。"}]},{"partOfSpeech":"n.","definition":{"en":"people in a society who have low social status or limited resources (a broader, less precise use)","zh":"（较宽泛用法）社会底层民众；资源有限、地位较低的人群"},"examples":[{"en":"The policy changes affected the proletariat most strongly.","zh":"这些政策变化对底层民众的影响最大。"}]}],"synonyms":["working class","wage earners","laborers"],"phonetic":"/ˌproʊləˈtɛriət/","extraExplanation":["“proletariat”来自拉丁语 *proletarius*，在古罗马指“只有子女可贡献于国家的人”，即缺乏财产者。后来在19世纪政治经济学与马克思主义语境中，逐渐固定为“靠出卖劳动力谋生的工人阶级”。","在文学与政治写作中常见搭配：the proletariat、the industrial proletariat（产业无产阶级）、the urban proletariat（城市无产阶级）。与之相对的常见词是 bourgeoisie（资产阶级）。","经典引文（了解背景即可）：《共产党宣言》中有“Workers of the world, unite!”（全世界无产者，联合起来！）常与“proletariat”同一语境出现。"]}
{"word":"proletariate","summary":{"en":"The proletariat is the working class, especially wage earners with little or no property, often discussed in Marxist contexts.","zh":"proletariat 指无产阶级/工人阶级，尤指主要靠工资生活、几乎无财产的人，常用于马克思主义语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the working class, especially people who earn wages and own little or no property (often used in Marxist writing)","zh":"无产阶级；工人阶级（尤指靠工资生活、几乎不拥有生产资料的人；常见于马克思主义语境）"},"examples":[{"en":"Marx wrote about conflict between the bourgeoisie and the proletariat.","zh":"马克思写到资产阶级与无产阶级之间的冲突。"},{"en":"The novel follows a young man from the proletariat trying to survive in an industrial city.","zh":"这部小说讲述一位出身无产阶级的年轻人在工业城市里挣扎求生。"},{"en":"They organized unions to improve conditions for the proletariat.","zh":"他们组织工会来改善无产阶级的工作条件。"}]}],"synonyms":["working class","wage earners","laborers","the masses"],"phonetic":"/ˌproʊləˈtɛriət/","extraExplanation":["你输入的 **proletariate** 常被认为是拼写错误；标准拼写是 **proletariat**。","词源来自拉丁语 *proletarius*（意为“只有子女/后代作为财产的人”），在19世纪的社会与政治讨论中被用来指代没有财产、主要靠出卖劳动获得收入的群体。","在文学与社会写作中，这个词往往带有阶级分析的色彩，比中性说法如 “working class” 更偏理论/政治语境。"]}
{"word":"proletariatism","summary":{"en":"Proletariatism is an ideology that focuses on the working class (the proletariat) and supports organizing society around workers’ interests or leadership.","zh":"Proletariatism（无产阶级主义）指以工人阶级/无产阶级为核心的意识形态或政治立场，主张社会应以工人利益或工人领导为中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief or political doctrine that centers on the working class (the proletariat), especially the idea that society should be led by, or organized in the interests of, workers.","zh":"无产阶级主义；以工人阶级（无产阶级）为中心的思想或政治主张，强调社会应由工人阶级领导或以其利益为核心来组织。"},"examples":[{"en":"In the early 20th century, some activists promoted proletariatism as a response to extreme inequality.","zh":"在20世纪初，一些活动家把无产阶级主义作为应对严重不平等的主张来宣传。"},{"en":"The essay contrasts proletariatism with elitism in politics.","zh":"这篇文章对比了政治中的无产阶级主义与精英主义。"}]}],"synonyms":["proletarianism","working-class ideology","class-based politics","Marxist-oriented politics"],"phonetic":"/ˌproʊ.ləˈtɛr.i.əˌrɪ.zəm/","extraExplanation":["“proletariatism”并不是日常英语中很常见的词，学术或历史写作里更可能看到“proletarian (adj.) / the proletariat (n.) / proletarianism (n.)”。如果你在阅读中遇到“proletariatism”，通常是在讨论马克思主义语境下的阶级政治，意思接近“以无产阶级为核心的意识形态/立场”。","词源提示：proletariat（无产阶级）来自拉丁语 *proletarius*（财产极少、以子女/劳动力为主要贡献的人），后在19世纪政治经济学与社会主义理论中被广泛使用。","相关搭配：proletarian revolution（无产阶级革命）、dictatorship of the proletariat（无产阶级专政）、working-class politics（工人阶级政治）。","文学/文化语境：在描写工业化、劳工运动、阶级冲突的作品或评论中，可能用此类词汇表达“站在工人阶级立场”的观点。"]}
{"word":"proletaries","summary":{"en":"“Proletaries” means working-class people, especially in political or Marxist discussions.","zh":"“proletaries”指无产者/工人阶级人群，尤其常用于政治或马克思主义语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Working-class people who earn wages (especially factory or manual workers), often discussed in social or political writing.","zh":"无产者；工人阶级（尤指靠工资生活的体力劳动者，常见于社会或政治语境）"},"examples":[{"en":"The novel portrays the hard lives of urban proletaries during industrialization.","zh":"这部小说描绘了工业化时期城市无产者的艰难生活。"},{"en":"Some writers argued that proletaries deserved better wages and safer workplaces.","zh":"一些作者认为无产者应得到更高工资和更安全的工作环境。"},{"en":"In political debates, the needs of proletaries were often contrasted with those of the wealthy.","zh":"在政治辩论中，无产者的需求常常与富人阶层的利益形成对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Marxist usage) Members of the proletariat—the social class that owns little property and must sell its labor to live.","zh":"（马克思主义用法）无产阶级成员：几乎不拥有生产资料、必须出卖劳动来维持生活的人"},"examples":[{"en":"Marx wrote about how proletaries could organize to demand change.","zh":"马克思写到无产者如何组织起来争取变革。"},{"en":"The speech called on proletaries to unite across national borders.","zh":"演讲呼吁各国无产者跨越国界团结起来。"}]}],"synonyms":["proletarians","the proletariat","workers","working class","wage earners"],"phonetic":"ˈproʊləˌtɛriz","extraExplanation":["“proletaries”是“proletary”的复数，但现代英语里更常用“proletarians”或“the proletariat（无产阶级）”。","词源来自拉丁语“proletarius”，原指“只贡献子女（proles）而无财产的公民”。在19世纪工业化和社会主义/马克思主义语境中，这个词带有明确的阶级分析色彩。","文学与历史写作中常用来营造社会批判氛围：如描写工厂、矿井、贫民区、罢工与劳工运动等主题。"]}
{"word":"proletarise","summary":{"en":"Proletarise means to make people or society become proletarian (working-class wage earners), or to give something a working-class character, often in political or academic contexts.","zh":"Proletarise 指使人群或社会“无产阶级化”（成为依靠工资生活的工人阶级），也可指使事物更具工人阶级色彩，多用于政治或学术语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to turn (a person, group, or society) into the proletariat (wage-earning working class), especially by removing property, status, or independent means of living","zh":"使（某人/群体/社会）无产阶级化；使沦为依靠工资生活的工人阶级（尤指失去财产、地位或独立生计）"},"examples":[{"en":"The factory closures were said to proletarise many small shop owners.","zh":"有人说，工厂倒闭使许多小店主无产阶级化。"},{"en":"In the novel, economic change slowly proletarises the rural community.","zh":"在这部小说中，经济变迁逐渐使农村社区无产阶级化。"}]},{"partOfSpeech":"v.","definition":{"en":"to give something a proletarian character or outlook; to make it more aligned with working-class identity or politics","zh":"使带有无产阶级（工人阶级）色彩；使更贴近工人阶级身份或政治立场"},"examples":[{"en":"The party tried to proletarise its image by emphasizing workers in its campaigns.","zh":"该党试图通过在竞选中强调工人形象来“无产阶级化”自身形象。"},{"en":"Some writers proletarised their style by using everyday workplace language.","zh":"一些作家通过使用日常职场语言让文风更具工人阶级色彩。"}]}],"synonyms":["proletarianize","impoverish","declass","pauperize"],"phonetic":"/prəˈliːtəˌraɪz/","extraExplanation":["“proletarise”是英式拼写；美式更常见的是“proletarize”。两者读音与用法基本相同。","该词多见于马克思主义/社会学/历史写作，语气偏学术或政治评论；日常口语里较少用。","词根来自拉丁语“proletarius”（无产者），在马克思主义语境中常与“proletariat（无产阶级）”“bourgeoisie（资产阶级）”“class struggle（阶级斗争）”一起出现。"]}
{"word":"proletarised","summary":{"en":"“Proletarised” means made into the working class (the proletariat), often by losing property or independence and becoming wage-dependent.","zh":"“proletarised”指“无产阶级化”：因失去财产或独立性而成为依赖工资劳动的工人阶层（无产阶级）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) to make people part of the proletariat (working class), especially by taking away property, independence, or middle-class status; to turn into wage workers.","zh":"（过去式/过去分词）使人阶级地位“无产阶级化”，尤指因失去财产、独立性或中产身份而成为依赖工资劳动的工人阶层。"},"examples":[{"en":"Many small farmers were proletarised as land was consolidated into large estates.","zh":"随着土地被并入大庄园，许多小农被无产阶级化了。"},{"en":"The factory system proletarised skilled artisans who had once worked independently.","zh":"工厂制度使原本独立工作的熟练工匠无产阶级化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) having been turned into (or treated as) part of the proletariat; reduced to wage-dependent working-class conditions.","zh":"（形容词）已被无产阶级化的；被当作无产阶级对待的；处于依赖工资的工人阶级处境的。"},"examples":[{"en":"A proletarised workforce may have less control over schedules and working conditions.","zh":"被无产阶级化的劳动力往往对工作时间和工作条件的掌控更少。"},{"en":"He wrote about the proletarised poor in growing industrial cities.","zh":"他描写了不断扩张的工业城市中被无产阶级化的贫民。"}]}],"synonyms":["proletarianized","made working-class","reduced to wage labor","pauperized (partial)"],"phonetic":"/proʊˈlɛtəˌraɪzd/","extraExplanation":["“proletarise/proletarize（无产阶级化）”常见于马克思主义与社会史写作，用来描述社会群体从拥有资产或较高自主性，转为依赖出卖劳动力谋生的过程。","拼写上英式常见 proletarise / proletarised，美式常见 proletarize / proletarized；含义相同，差别主要在拼写。","语气较学术、政治色彩较强；在中性写作中，有时会用“become wage workers（成为雇佣劳动者）”“lose economic independence（失去经济独立）”等表达来替代。"]}
{"word":"proletarising","summary":{"en":"Proletarising means causing people (or work/culture) to become more proletarian—especially by turning them into wage-dependent workers.","zh":"Proletarising 指使人（或工作/文化）更“无产阶级化”，尤其是把人推向依赖工资的劳动状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) making people become part of the proletariat (the wage-earning working class), often by pushing them out of owning land, tools, or independent work.","zh":"（现在分词）使人们成为无产阶级（主要靠工资生活的工人阶级），常指让人失去土地、生产工具或独立谋生方式。"},"examples":[{"en":"Rapid industrial growth was proletarising many rural families who moved to the cities for factory jobs.","zh":"快速的工业增长使许多农村家庭无产阶级化，他们搬到城市从事工厂工作。"},{"en":"Some critics argue that the platform economy is proletarising creative work by turning freelancers into piece-rate workers.","zh":"一些批评者认为，平台经济正在使创意工作无产阶级化，把自由职业者变成按件计酬的劳动者。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle, broader/figurative) giving something a “working-class” or proletarian character, style, or politics.","zh":"（现在分词，引申）使某事物带有“工人阶级/无产阶级”的特征、风格或政治立场。"},"examples":[{"en":"The movement tried to proletarising its language so ordinary workers could relate to it.","zh":"该运动试图让语言更“工人化”，以便普通工人更有共鸣。"},{"en":"The novel was praised for proletarising literature by focusing on everyday labor and survival.","zh":"这部小说因聚焦日常劳动与生存，被称赞为让文学“无产阶级化”。"}]}],"synonyms":["proletarianizing","working-classifying","pauperizing (near meaning in some contexts)","deskilling (sometimes related)"],"phonetic":"/prəˈlɛtəˌraɪzɪŋ/","extraExplanation":["“proletarising”来自动词“proletarise / proletarize”，常见于马克思主义/政治经济学语境，讨论资本主义发展如何扩大依赖工资的劳动者群体。","拼写上：英式常用 proletarise（-ise），美式常见 proletarize（-ize）；两者意义相同。","词带有较强的学术/政治色彩，日常英语更常用更直白的说法，如 “turning people into wage workers / pushing people into low-paid work”。"]}
{"word":"proletarization","summary":{"en":"Proletarization is the process of becoming a wage laborer (part of the proletariat), often due to economic and social changes.","zh":"Proletarization 指“无产阶级化”：因经济社会变化而转为以工资为生的雇佣劳动者的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which people (often former farmers or middle-class workers) lose independent control over their work and become wage laborers, especially in industrial or capitalist societies","zh":"无产阶级化；（常指农民或小资产阶级等）失去对生产/工作的独立控制而转为领取工资的雇佣劳动者的过程，尤见于工业化或资本主义社会"},"examples":[{"en":"Industrialization accelerated proletarization as many rural families moved to cities for factory jobs.","zh":"工业化加速了无产阶级化，许多农村家庭搬到城市去做工厂工作。"},{"en":"Some historians describe proletarization as a key change in the rise of modern capitalism.","zh":"一些历史学家把无产阶级化描述为现代资本主义兴起中的关键变化。"},{"en":"The book examines the proletarization of small shop owners who could no longer compete with big chains.","zh":"这本书探讨了小店主因无法与大型连锁竞争而发生的无产阶级化。"}]}],"synonyms":["proletarianization","wage-labor formation","working-class formation"],"phonetic":"/prəˌliːtəraɪˈzeɪʃən/","extraExplanation":["这个词常用于社会学、政治经济学与马克思主义语境：强调人们从“自己拥有/掌控生产资料或技能”转向“必须出卖劳动力换取工资”的结构性变化。","在学术写作中，它经常与 urbanization（城市化）、industrialization（工业化）、deskilling（去技能化/技能贬值）、precarious work（不稳定劳动）等一起讨论。","词形结构：proletariat（无产阶级） + -ization（……化/……的过程）。与其相近但不完全相同的概念有 pauperization（贫困化，强调变穷）与 proletarianization（同义变体，较少见）。"]}
{"word":"proletarize","summary":{"en":"Proletarize means to make someone (or become) part of the wage-earning working class, often by losing economic independence.","zh":"Proletarize 指使某人/某群体（或自身）无产阶级化，转为依靠工资生活的劳动者，常暗含失去经济独立。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a person or group become part of the proletariat (the wage-earning working class), especially by removing property, status, or economic independence","zh":"使（个人或群体）无产阶级化；使成为依靠工资生活的劳动者（常指失去财产、地位或经济独立）"},"examples":[{"en":"Some critics argue that rapid industrial change can proletarize small farmers.","zh":"一些批评者认为，快速的工业变迁可能会使小农无产阶级化。"},{"en":"The company’s policies were seen as a way to proletarize independent contractors into low-paid employees.","zh":"该公司的政策被视为一种把独立承包者无产阶级化、变成低薪雇员的方式。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become proletarian (to move into the wage-earning working class)","zh":"（自身）无产阶级化；转变为以出卖劳动力为生的工人阶层"},"examples":[{"en":"In many cities, parts of the middle class began to proletarize after repeated economic crises.","zh":"在许多城市里，反复的经济危机后，一部分中产阶级开始无产阶级化。"}]}],"synonyms":["proletarianize","pauperize","declass","impoverish"],"phonetic":"/proʊˈlɛtəˌraɪz/","extraExplanation":["“proletarize”多见于社会学、政治经济学（尤其是马克思主义/劳动史）语境，强调阶级结构变化：人们从拥有土地、手艺或小生意等“自营/自雇”的地位，转向主要依赖工资收入。","近义词“proletarianize”更常见、更直观；“proletarize”相对偏学术或理论写作。"]}
{"word":"proletarized","summary":{"en":"“Proletarized” means turned into the working class, typically by losing property or economic independence.","zh":"“Proletarized”指被无产阶级化：因失去财产或经济独立而被推入工人阶级、主要靠工资生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made into a proletarian; pushed into the working class (often through loss of property, status, or control over work).","zh":"被“无产阶级化”的；被推入工人阶级（常因失去财产、地位或对劳动的控制）。"},"examples":[{"en":"Some farmers were proletarized after they lost their land and had to work for wages.","zh":"一些农民失去土地后被无产阶级化，只能靠领工资生活。"},{"en":"The novel describes a proletarized neighborhood shaped by factory layoffs.","zh":"这部小说描写了一个因工厂裁员而无产阶级化的社区。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “proletarize”: to turn a person or group into wage workers with little or no property.","zh":"“proletarize”的过去式/过去分词：使（某人或某群体）无产阶级化，使其成为几乎无财产、主要靠工资生活的人。"},"examples":[{"en":"Rapid industrial change proletarized many small shop owners over time.","zh":"快速的工业变迁随着时间让许多小店主无产阶级化。"}]}],"synonyms":["made working-class","impoverished","dispossessed","wage-dependent"],"phonetic":"/prəˈlɛtəˌraɪzd/","extraExplanation":["“proletarized / proletarize”常见于马克思主义与社会学语境，强调阶级结构的变化：人们从拥有土地/工具/小企业的“自雇或小资产”状态，转为主要依靠出售劳动力获得工资的状态。","在一般英语写作中它属于偏学术/政治词汇；日常表达里更常用更中性的说法，如 “became working-class,” “were pushed into low-wage work,” 或 “lost economic security.”"]}
{"word":"proletarizing","summary":{"en":"“Proletarizing” means making people or work become more like the wage-earning working class, often used in Marxist/social analysis.","zh":"“proletarizing”指使人群或工作关系走向“无产阶级化”，更依赖工资劳动，常用于马克思主义/社会分析语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of proletarize) making a person or group become part of the working class, especially by pushing them into wage labor and away from owning property or controlling their work.","zh":"（proletarize 的现在分词）使某人或某群体“无产阶级化”，尤指被迫转向靠工资劳动为生，并逐渐失去财产或对劳动的控制。"},"examples":[{"en":"Rapid industrial change can be proletarizing small farmers who once lived off their own land.","zh":"快速的工业变迁可能会让原本靠自家土地生活的小农被“无产阶级化”。"},{"en":"The essay argues that automation is proletarizing some white-collar jobs by reducing workers’ autonomy.","zh":"这篇文章认为，自动化正在通过削弱自主性，使一些白领工作出现“无产阶级化”。"}]},{"partOfSpeech":"v.","definition":{"en":"giving something a distinctly working-class (proletarian) character or perspective, especially in politics, culture, or language.","zh":"使某事物呈现出明显的工人阶级（无产阶级）特征或立场，常用于政治、文化或语言语境。"},"examples":[{"en":"The party focused on proletarizing its messaging to appeal to factory workers.","zh":"该党着力让宣传话语更“工人阶级化”，以吸引工厂工人。"},{"en":"Some critics say the novel is proletarizing its heroes, portraying them mainly through their labor.","zh":"一些评论者认为这部小说在“无产阶级化”其主人公，主要通过劳动来塑造他们。"}]}],"synonyms":["proletarianizing","deskilling (in some contexts)","impoverishing (partial overlap)","pushing into wage labor"],"phonetic":"prəˈlɛtəˌraɪzɪŋ","extraExplanation":["“proletarizing/无产阶级化”常见于马克思主义与社会学写作，强调一种结构性过程：人们从拥有生产资料（如土地、店铺、工具）或较强职业自主性，转变为主要依赖出卖劳动力领取工资。","语气上多偏学术或政治评论，在日常英语里不常用；写作中可用更中性的说法替代，如 “pushing people into wage labor / turning independent workers into wage workers”。"]}
{"word":"proletary","summary":{"en":"Proletary is a rare form of proletarian: a working-class wage earner, or something related to the working class.","zh":"Proletary 是 proletarian 的少见写法：指无产者/工人阶级成员，或与工人阶级相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the working class who earns wages and owns little or no property; a proletarian (rare form).","zh":"无产者、工人阶级成员（较少用的写法），通常靠工资生活，几乎没有财产。"},"examples":[{"en":"In Marxist writing, the proletary is contrasted with the capitalist class.","zh":"在马克思主义著作中，“proletary（无产者）”常与资本家阶级形成对比。"},{"en":"The novel portrays a young proletary struggling to support his family.","zh":"这部小说描写了一位年轻的无产者为养家而奋斗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or typical of the working class; proletarian (rare form).","zh":"与无产阶级/工人阶级有关的；工人阶级的（较少用的写法）。"},"examples":[{"en":"The film uses a proletary setting—small rooms, long shifts, and tight budgets.","zh":"电影采用了工人阶级式的背景：狭小的房间、漫长的班次和紧张的预算。"}]}],"synonyms":["proletarian","worker","wage earner","laborer"],"phonetic":"/ˈproʊləˌtɛri/","extraExplanation":["“proletary”在现代英语里非常少见，更常用的是“proletarian”（名词或形容词）以及“the proletariat”（无产阶级整体）。如果你在阅读政治、历史或文学文本时看到“proletary”，通常可以按“proletarian”理解。","词源可追溯到拉丁语“proletarius”，原指罗马社会中财产很少、主要贡献是“生育后代（proles）”的人群。后来在19世纪政治经济学语境中，逐渐固定为“靠出卖劳动力为生的工人阶级”。"]}
{"word":"proletcult","summary":{"en":"Proletcult was an early Soviet movement promoting a new working-class culture created by workers themselves.","zh":"Proletcult（无产阶级文化运动）是苏联早期倡导由工人阶级自创的“无产阶级文化”的运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Soviet-era cultural movement (c. 1917–1925) that aimed to create a distinct “proletarian culture” made by and for the working class, independent of traditional (bourgeois) art and institutions.","zh":"（约1917–1925年）苏俄/早期苏联的文化运动，主张由工人阶级自己创作并享用、独立于传统（资产阶级）艺术与机构的“无产阶级文化”。"},"examples":[{"en":"In her thesis, she describes Proletcult workshops where workers wrote poetry and staged plays.","zh":"在她的论文里，她描述了“无产阶级文化运动”的工作坊：工人们写诗、排戏。"},{"en":"Proletcult tried to reshape everyday life through art, education, and collective creativity.","zh":"无产阶级文化运动试图通过艺术、教育与集体创作来改造日常生活。"}]}],"synonyms":["Proletkult","proletarian culture movement"],"phonetic":"/ˈproʊlɪtˌkʌlt/","extraExplanation":["词源来自俄语“Proletkult”，是“proletarskaya kultura（无产阶级文化）”的缩合；英语里常写作 Proletcult 或 Proletkult。","它与早期苏联的前卫艺术、群众教育和工人俱乐部文化有交集，但也因“是否需要与既有文化传统切割”而引发争论；后来在政治与文化政策变化中逐渐失去独立性。","阅读与文学语境中，你可能会在讨论苏联早期文化政策、先锋派艺术（如未来主义）、以及‘艺术应服务谁’的文章里看到它。"]}
{"word":"proletkult","summary":{"en":"Proletkult was an early Soviet movement that promoted creating a distinct working-class culture.","zh":"Proletkult 是苏联早期推动建立独立“工人/无产阶级文化”的文化运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cultural and educational movement/organization in early Soviet Russia that aimed to create an independent “proletarian” (working-class) culture in art, literature, and education","zh":"（苏俄/苏联早期的）“无产阶级文化”（Proletkult）运动/组织，主张在艺术、文学与教育中建立独立的无产阶级文化"},"examples":[{"en":"After the 1917 Revolution, Proletkult groups organized theater, writing circles, and art studios for workers.","zh":"1917年革命后，Proletkult 团体为工人组织戏剧、写作小组和美术工作室。"},{"en":"Some Bolshevik leaders criticized Proletkult for wanting culture that was separate from the broader Soviet state project.","zh":"一些布尔什维克领导人批评 Proletkult 试图把文化与更广泛的苏维埃国家事业分离。"}]}],"synonyms":["proletarian culture movement","workers’ cultural movement"],"phonetic":"/ˈproʊlɪtˌkʌlt/","extraExplanation":["“Proletkult”来自俄语“proletarskaya kultura”（无产阶级文化）的缩略说法，常用于英语历史与文化研究语境。","它在1917年后迅速扩张，强调工人阶级应创造属于自己的艺术与价值观，而不仅仅是继承旧的“资产阶级文化”。","这一运动常与亚历山大·波格丹诺夫（Alexander Bogdanov）等思想人物联系在一起；后来在政治与文化政策变化中影响力下降。"]}
{"word":"proleucocyte","summary":{"en":"A proleucocyte is an immature white blood cell (a precursor to a leukocyte).","zh":"proleucocyte 指未成熟的白细胞（白血球前体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an immature (developing) white blood cell; a precursor cell that will later become a mature leukocyte.","zh":"幼白细胞；未成熟的白血球（白细胞前体），之后会发育成成熟的白细胞。"},"examples":[{"en":"The lab report noted an increase in proleucocytes in the bone marrow sample.","zh":"检验报告指出，该骨髓样本中的幼白细胞数量增加。"},{"en":"In some blood disorders, doctors may see more proleucocytes than usual.","zh":"在某些血液疾病中，医生可能会看到幼白细胞数量异常增多。"}]}],"synonyms":["proleukocyte","leukocyte precursor","white blood cell precursor"],"phonetic":"/ˌproʊˈluːkəˌsaɪt/","extraExplanation":["这是医学/血液学里的较少见（也偏旧式）的术语，常用于描述“白细胞的前体阶段”。现代教材更常用更具体的名称来区分不同谱系与阶段（例如 granulocyte precursor / myeloid precursor 等），因此在一般英语阅读中不常见。","词源上可拆解为 pro-（“在……之前/前期”）+ leucocyte（“白细胞”）。拼写上也常见变体：proleukocyte（美式更常见用 leuk-）。"]}
{"word":"proleukocyte","summary":{"en":"A proleukocyte is an immature precursor white blood cell (usually in bone marrow).","zh":"proleukocyte 指未成熟的前体白细胞（多见于骨髓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an immature (precursor) white blood cell, found mainly in bone marrow, that will develop into a mature leukocyte","zh":"前白细胞；未成熟的（前体）白细胞，主要见于骨髓，将进一步发育为成熟白细胞"},"examples":[{"en":"Under the microscope, the lab noted an increased number of proleukocytes in the bone marrow sample.","zh":"在显微镜下，实验室在骨髓样本中观察到前白细胞数量增多。"},{"en":"A proleukocyte is part of the early stages of white blood cell development.","zh":"前白细胞属于白细胞发育的早期阶段。"}]}],"synonyms":["leukocyte precursor","immature white blood cell","proleucocyte"],"phonetic":"ˌproʊˈluːkəsaɪt","extraExplanation":["这是一个医学/血液学术语，常见于检验报告或专业文章中；日常英语里很少使用。","词形来源：pro-（“在前、前期”）+ leukocyte（白细胞）。也可见拼写变体 proleucocyte（英式拼写倾向于 -leuco-）。","在临床语境中，出现“未成熟白细胞增多”可能提示骨髓反应、感染或某些血液系统疾病；具体意义需由医生结合其他指标判断。"]}
{"word":"prolia","summary":{"en":"Prolia is the brand name of denosumab, an injection used to treat osteoporosis and help prevent fractures.","zh":"Prolia 是地舒单抗（denosumab）的商品名，一种用于治疗骨质疏松、帮助预防骨折的注射药物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand-name prescription medicine (denosumab) given by injection to help treat osteoporosis and reduce the risk of bone fractures.","zh":"一种处方药品牌名（通用名 denosumab，地舒单抗），以注射方式使用，用于治疗骨质疏松并降低骨折风险。"},"examples":[{"en":"My doctor recommended Prolia to lower my risk of fractures.","zh":"医生建议我使用 Prolia 来降低骨折风险。"},{"en":"Prolia is usually given as an injection every six months.","zh":"Prolia 通常是每六个月注射一次。"},{"en":"Ask your pharmacist whether Prolia can interact with your other medicines.","zh":"可以问药师：Prolia 是否会与其他药物产生相互作用。"}]}],"synonyms":["denosumab","osteoporosis injection","bone-strengthening medicine"],"phonetic":"/ˈproʊliə/","extraExplanation":["Prolia 是商品名；其通用名是 denosumab（中文常译“地舒单抗”）。在医学语境里，人们常说“on Prolia”（正在用 Prolia 治疗）或“a Prolia shot/injection”（打一针 Prolia）。","这是处方用药，具体适应症、用法与风险需要由专业医生评估；学习词汇时可把它当作“药名/品牌名”的专有名词来理解与使用。"]}
{"word":"prolicense","summary":{"en":"“Pro license/prolicense” usually means either a professional license to do a regulated job, or a paid “Pro” software/service license with extra features.","zh":"“Pro license/prolicense”通常指两类：从事受监管职业的专业执照，或软件/服务的专业版（付费）授权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A professional license; an official permission or certification that allows someone to do a regulated job (often written as “pro license” or “pro licence” in real use).","zh":"专业执照/职业资格证；允许从事受监管职业的官方许可或认证（实际中更常写作“pro license / pro licence”）。"},"examples":[{"en":"She needs a pro license before she can work as an electrician in this state.","zh":"她需要先拿到专业执照，才能在这个州当电工。"},{"en":"The hospital checks every doctor’s pro license each year.","zh":"医院每年都会核查每位医生的执照。"}]},{"partOfSpeech":"n.","definition":{"en":"A “Pro” (paid/advanced) license for software or services, giving extra features compared with a free/basic version (often written as “Pro license”).","zh":"软件/服务的“专业版/高级版”授权（通常写作“Pro license”），比免费/基础版提供更多功能。"},"examples":[{"en":"We bought a Pro license to unlock team features.","zh":"我们购买了专业版授权来解锁团队功能。"},{"en":"The Pro license includes priority support.","zh":"专业版授权包含优先支持服务。"}]}],"synonyms":["professional license","occupational license","certification","license key","paid license"],"phonetic":"/ˈproʊ ˌlaɪsəns/","extraExplanation":["“prolicense”并不是常见的标准拼写，更多时候会写成分开的“pro license”。如果你指的是某个特定领域的专门称呼（例如足球教练的 “UEFA Pro Licence/Pro License” 或某款软件的授权名），告诉我具体场景，我可以给更贴近语境的释义与例句。","英式拼写常见 “licence”(名词)/“license”(动词) 的区分；美式英语通常名词和动词都写 “license”。"]}
{"word":"prolicidal","summary":{"en":"Prolicidal means “related to or involving the killing of one’s own offspring” (rare usage).","zh":"prolicidal 指“与弑子（父母杀害亲生子女）有关的；导致子女死亡的”（用法较罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) relating to killing one’s own offspring; causing the death of offspring.","zh":"（罕见）与杀害自己子女有关的；导致子女死亡的。"},"examples":[{"en":"The novel centers on a mother’s prolicidal despair after the war.","zh":"这部小说聚焦于一位母亲在战后陷入绝望并走向弑子行为。"},{"en":"The court considered whether the act was prolicidal or accidental.","zh":"法院审查该行为究竟属于弑子还是意外。"}]}],"synonyms":["filicidal","infanticidal","child-killing"],"phonetic":"/ˌproʊlɪˈsaɪdəl/","extraExplanation":["“prolicidal”非常少见，更多时候会看到名词“prolicide”（弑子，尤指父母杀害亲生子女）以及更常用的形容词“filicidal/filicide”（杀害子女的/杀害子女）。","词源上常与拉丁语相关：proles（后代、子女）+ -cide（杀害）+ -al（……的）。","在新闻报道中更常用“filicide/infanticide”（杀婴）等更常见、明确的词；“prolicidal”多见于学术、法律或文学语境。"]}
{"word":"prolicide","summary":{"en":"Prolicide is a rare noun meaning the killing of one’s own offspring.","zh":"Prolicide是一个罕见名词，指杀害自己的子女或后代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the killing of one’s own offspring; the act of killing children or descendants.","zh":"（罕见）杀害自己的子女/后代；杀子（女）行为。"},"examples":[{"en":"The article compared infanticide, filicide, and the rarer term prolicide.","zh":"这篇文章比较了infanticide（杀婴）、filicide（杀子女）以及更少见的prolicide。"},{"en":"In some legal writing, prolicide is used to mean the killing of a person’s own offspring.","zh":"在一些法律写作中，prolicide用来表示杀害自己子女的行为。"}]}],"synonyms":["filicide","infanticide","homicide"],"phonetic":"/ˈproʊlɪsaɪd/","extraExplanation":["这个词非常少见，日常英语里几乎不用；更常见的是 **infanticide**（杀婴）、**filicide**（杀子女）、**parricide**（杀父母）、**homicide**（杀人）。","词源上可拆成 **proles**（拉丁语：后代/子女）+ **-cide**（“杀”的后缀，如 pesticide 杀虫剂）。","如果你是想表达“多产的/高产的”，常见词是 **prolific**，可能是拼写误差。"]}
{"word":"proliferant","summary":{"en":"Proliferant means growing or spreading quickly, especially in scientific contexts; rarely, it can be a noun for something that proliferates.","zh":"Proliferant 指迅速增长或扩散的（多用于科学语境）；少见情况下也可作名词，指会增殖的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Growing or increasing quickly; tending to multiply or spread (often used in scientific writing).","zh":"（常用于科研写作）迅速增长的；易繁殖/扩散的。"},"examples":[{"en":"Some bacteria are proliferant in warm, wet conditions.","zh":"有些细菌在温暖潮湿的环境中繁殖得很快。"},{"en":"The report warned about proliferant misinformation on social media.","zh":"报告警告社交媒体上虚假信息迅速扩散。"}]},{"partOfSpeech":"n.","definition":{"en":"A thing (such as a cell or agent) that proliferates or promotes proliferation; a proliferating entity (rare).","zh":"（罕见）会增殖的事物（如细胞或因子）；促增殖的东西。"},"examples":[{"en":"Under the microscope, proliferants were visible around the wound edge.","zh":"在显微镜下，伤口边缘周围可以看到正在增殖的细胞/组织。"}]}],"synonyms":["proliferating","proliferative","fast-growing","rapidly spreading","multiplying"],"phonetic":"/prəˈlɪfərənt/","extraExplanation":["“Proliferant”在日常英语中很少见，更常见的是“proliferating”（正在增殖的）或“proliferative”（增殖性的，医学/生物学常用，如 proliferative disease）。","词根来自“proliferate”（增殖、激增）。写作时如果不确定是否地道，用“rapidly growing/spreading”也很自然。"]}
{"word":"proliferate","summary":{"en":"Proliferate means to increase or spread quickly, or (in biology) to multiply by producing new cells.","zh":"Proliferate 指迅速增加或扩散；在生物语境中指细胞等“增殖”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to increase quickly in number or amount; to spread rapidly","zh":"（数量或规模）迅速增加；快速扩散、蔓延"},"examples":[{"en":"Misinformation can proliferate quickly on social media.","zh":"错误信息可能在社交媒体上迅速扩散。"},{"en":"After the rain, mushrooms proliferated in the forest.","zh":"下雨后，蘑菇在森林里大量生长。"},{"en":"The city has seen coffee shops proliferate in recent years.","zh":"近年来，这座城市的咖啡店数量迅速增加。"}]},{"partOfSpeech":"v.","definition":{"en":"(biology) to grow by producing new cells; to multiply","zh":"（生物/细胞）增殖；繁殖"},"examples":[{"en":"These cells proliferate when the body is healing.","zh":"当身体在愈合时，这些细胞会增殖。"},{"en":"Doctors study how cancer cells proliferate.","zh":"医生研究癌细胞如何增殖。"}]}],"synonyms":["multiply","increase","spread","expand","mushroom"],"phonetic":"/prəˈlɪfəˌreɪt/","extraExplanation":["“proliferate”常用于偏正式/学术语境，描述“快速增多”且往往带有“难以控制”的感觉（如谣言、武器、害虫）。日常口语里也可用 increase/spread 更简单。","词源与“prolific（多产的）”同源，来自拉丁语，核心含义与“产生后代/产生更多”有关。常见搭配：proliferate rapidly；proliferate across/throughout；the proliferation of + 名词（……的扩散/激增）。"]}
{"word":"proliferated","summary":{"en":"“Proliferated” means “increased or spread quickly” (or “reproduced and grew in number”).","zh":"proliferated 表示“迅速增多/快速扩散”（或“繁殖、数量增长”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of things or ideas) to increase quickly in number or spread rapidly.","zh":"（事物或想法）迅速增多；快速蔓延、扩散。"},"examples":[{"en":"Misinformation proliferated online during the crisis.","zh":"危机期间，网络上的错误信息迅速蔓延。"},{"en":"After the new law, small businesses proliferated in the area.","zh":"新法律出台后，这个地区的小企业大量涌现。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of living things) to reproduce and grow in number.","zh":"（生物）繁殖；数量增多。"},"examples":[{"en":"Bacteria proliferated in the warm, humid environment.","zh":"细菌在温暖潮湿的环境中大量繁殖。"},{"en":"In spring, plants proliferate when there is enough rain.","zh":"春天雨水充足时，植物会大量生长繁殖。"}]}],"synonyms":["multiplied","spread","grew","expanded","mushroomed"],"phonetic":"/prəˈlɪfəˌreɪtɪd/","extraExplanation":["proliferated 是 proliferate 的过去式/过去分词。常见搭配：proliferate rapidly（迅速增多）、proliferate across/throughout（在……各处扩散）、the proliferation of + 名词（……的激增）。","语气上常用于“增长得太多、太快”这一含义，既可中性（如商店增多），也可带负面（如谣言、武器、垃圾信息扩散）。"]}
{"word":"proliferates","summary":{"en":"“Proliferates” means “grows or spreads quickly,” and in biology it can mean “multiplies by producing many new cells.”","zh":"“proliferates”表示“迅速大量增加/快速扩散”；在生物医学语境中可指“增殖（产生大量新细胞）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of numbers, problems, ideas, or things) to increase quickly and in large amounts; to spread rapidly","zh":"（数量、问题、想法或事物）迅速大量增加；快速扩散"},"examples":[{"en":"Misinformation proliferates quickly on social media.","zh":"错误信息在社交媒体上迅速扩散。"},{"en":"After the new rule, paperwork proliferated across the whole department.","zh":"新规定出台后，文书工作在整个部门里激增。"}]},{"partOfSpeech":"v.","definition":{"en":"(in biology/medicine) to grow by producing many new cells or offspring","zh":"（生物/医学）通过产生大量新细胞或后代而增殖"},"examples":[{"en":"Cancer cells can proliferate if they are not treated.","zh":"如果不治疗，癌细胞可能会增殖。"},{"en":"Bacteria proliferate in warm, wet conditions.","zh":"细菌在温暖潮湿的环境中容易繁殖。"}]}],"synonyms":["spreads","multiplies","increases","expands","mushrooms"],"phonetic":"/prəˈlɪfəˌreɪts/","extraExplanation":["“proliferates”是动词“proliferate”的第三人称单数形式（he/she/it proliferates）。常见搭配：proliferate rapidly/quickly；proliferate in/through/across（在某处/在某范围内扩散）。","词源来自拉丁语词根 pro-（向前）+ -fer（携带/产生），带有“产生出许多”的感觉，因此既可指“数量激增”，也可指“细胞/细菌增殖”。","语体上偏正式，常用于新闻、学术、商务写作；日常口语里常用 spread / grow / increase 来替换。"]}
{"word":"proliferating","summary":{"en":"Proliferating means increasing quickly or spreading rapidly.","zh":"proliferating 表示迅速增加或快速扩散。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to increase rapidly in number or spread quickly (often used for things like rumors, apps, weapons, or cells)","zh":"（数量）迅速增加；（范围）快速扩散（常用于谣言、应用、武器、细胞等）"},"examples":[{"en":"False stories were proliferating online after the earthquake.","zh":"地震后，网上的虚假消息迅速扩散。"},{"en":"Small coffee shops are proliferating in the neighborhood.","zh":"这附近的小咖啡店越来越多。"},{"en":"Cancer cells can proliferate if the disease isn’t treated early.","zh":"如果不及早治疗，癌细胞可能会快速增殖。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to increase or spread quickly (less common; often used in passive voice)","zh":"使……迅速增加或扩散（较少见；常用被动语态）"},"examples":[{"en":"Easy sharing tools have proliferated misinformation.","zh":"便捷的分享工具助长了虚假信息的扩散。"},{"en":"The company’s low prices proliferated copycat products in the market.","zh":"该公司的低价在市场上引发了更多仿制品的出现。"}]}],"synonyms":["spreading","multiplying","increasing","growing","expanding"],"phonetic":"/prəˈlɪfəˌreɪtɪŋ/","extraExplanation":["“proliferating”是动词“proliferate”的现在分词/动名词形式，常用来描述一种“失控式、蔓延式”的增长，语气往往偏中性到负面（例如谣言、武器、垃圾信息的扩散），但也可中性（例如商店、物种、创意的增加）。","词源来自拉丁语 *proles*（后代）+ *ferre*（带来、产生），因此在生物学里常见“细胞增殖（cell proliferation）”。","常见搭配：proliferating + online/on social media（在网上扩散）；proliferating + rapidly/quickly（迅速增加）；a proliferating number of + 名词复数（越来越多的……）。"]}
{"word":"proliferation","summary":{"en":"Proliferation means a rapid increase or spread; it’s often used for growth in numbers, biological cell growth, or the spread of weapons (especially nuclear).","zh":"Proliferation 指“迅速增加或扩散”，常用于数量增长、生物细胞增殖，以及武器（尤指核武器）扩散等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rapid increase in number, amount, or spread of something","zh":"（数量、规模或影响的）迅速增加；扩散；激增"},"examples":[{"en":"The city has seen a proliferation of coffee shops in recent years.","zh":"近年来，这座城市的咖啡店数量迅速增加。"},{"en":"Doctors are concerned about the proliferation of antibiotic-resistant bacteria.","zh":"医生们担心耐药细菌的扩散。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of producing many new things (such as cells, products, or copies)","zh":"（细胞、产品或复制品等的）大量产生；增殖过程"},"examples":[{"en":"The drug slows the proliferation of cancer cells.","zh":"这种药能减缓癌细胞的增殖。"},{"en":"Digital tools allow the rapid proliferation of online content.","zh":"数字工具使网络内容得以迅速大量产生。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics/war) the spread of weapons—especially nuclear weapons—to more countries or groups","zh":"（政治/军事）武器（尤指核武器）的扩散到更多国家或组织"},"examples":[{"en":"The treaty aims to prevent nuclear proliferation.","zh":"该条约旨在防止核扩散。"},{"en":"Leaders debated how to stop the proliferation of advanced missiles.","zh":"领导人讨论如何阻止先进导弹的扩散。"}]}],"synonyms":["rapid increase","growth","spread","expansion","multiplication"],"phonetic":"/prəˌlɪfəˈreɪʃən/","extraExplanation":["词源：来自拉丁语 *proles*（后代）+ *-fer*（携带、产生），核心含义是“产生很多、繁殖”。","常见搭配：the proliferation of + 名词（某事物的激增/扩散）；prevent/stop proliferation（防止扩散）；rapid/massive proliferation（快速/大规模激增）。","语域提示：在新闻与学术写作中很常见，语气偏正式；日常口语里常用 *a lot of / more and more / spread* 来替代。"]}
{"word":"proliferations","summary":{"en":"“Proliferations” means multiple instances of rapid increase or spread (plural of “proliferation”).","zh":"“proliferations”指多次或多种“迅速增加/扩散”，是“proliferation”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rapid increase in number or amount; the spread of something (often used in formal or academic writing)","zh":"（数量或规模的）迅速增加；（事物的）扩散（常用于正式或学术语境）"},"examples":[{"en":"The proliferation of smartphones changed how people communicate.","zh":"智能手机的迅速普及改变了人们的沟通方式。"},{"en":"Many cities are concerned about the proliferation of short-term rentals.","zh":"许多城市担心短期租赁房源的激增。"},{"en":"The report discusses the proliferation of misinformation online.","zh":"这份报告讨论了网络上虚假信息的扩散。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of making copies very quickly; multiplying (less common)","zh":"快速繁殖、增殖的过程（较不常见）"},"examples":[{"en":"Scientists studied the proliferation of cells in the lab.","zh":"科学家在实验室研究细胞的增殖。"},{"en":"Stress can affect the proliferation of healthy tissue.","zh":"压力会影响健康组织的增殖。"}]}],"synonyms":["rapid growth","increase","expansion","spread","multiplication"],"phonetic":"/prəˌlɪfəˈreɪʃən/","extraExplanation":["“proliferations”是复数形式，表示“多种/多次的迅速增加或扩散”。日常口语里更常用“rapid growth / spread”，而“proliferation(s)”更偏书面、新闻或学术写作。","常见搭配：the proliferation of + 名词（如 technology / weapons / rumors / apps）。在国际新闻中也常见“nuclear proliferation（核扩散）”。"]}
{"word":"proliferative","summary":{"en":"Proliferative means rapidly growing or increasing, especially through cell or tissue growth; it can also describe fast expansion more generally.","zh":"Proliferative 指快速生长或增加，尤指细胞/组织的增殖；也可泛指迅速扩张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Growing or increasing quickly by producing many new cells, parts, or individuals; rapidly expanding.","zh":"（通过产生许多新细胞/部分/个体而）快速生长或增加的；迅速扩张的。"},"examples":[{"en":"Doctors monitored the patient for proliferative changes in the tissue.","zh":"医生监测患者组织是否出现增殖性变化。"},{"en":"The company’s proliferative growth created new jobs across the region.","zh":"公司的迅速扩张在整个地区创造了新的工作岗位。"}]}],"synonyms":["rapid-growing","expanding","multiplying","burgeoning"],"phonetic":"/proʊˈlɪfəˌreɪtɪv/","extraExplanation":["“proliferative”常见于医学与生物学语境，尤其指“细胞增殖”相关的情况，例如 proliferative retinopathy（增殖性视网膜病变）或 proliferative phase（增殖期）。在日常语境中也可引申为“迅速蔓延/大量出现”，但正式写作中更常见。","词根提示：来自拉丁语 proles（后代）+ ferre（携带/产生），核心意思是“产生更多后代/新东西”。常见相关词：proliferate（v. 增殖/激增）、proliferation（n. 扩散/增殖）。"]}
{"word":"proliferous","summary":{"en":"Proliferous means producing many new growths or offspring; very fertile or highly productive (especially in biology/botany).","zh":"Proliferous 指能产生许多新生长或后代的；多产的、繁殖力强的（尤用于生物/植物学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing many new parts, offspring, or growths; very fertile or highly productive (often used in biology or botany).","zh":"（常用于生物学/植物学）能产生许多新个体或结构的；多产的；繁殖力强的。"},"examples":[{"en":"Some plants are proliferous and can produce new shoots from the flower head.","zh":"有些植物是多产的，甚至能从花头长出新的嫩芽。"},{"en":"The biologist described the bacterium as proliferous under warm, wet conditions.","zh":"生物学家形容这种细菌在温暖潮湿的条件下繁殖力很强。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having many offspring or much output; very productive (less technical, less common than “prolific”).","zh":"（较少见、较口语化）产出很多的；非常多产的（不如“prolific”常用）。"},"examples":[{"en":"He was a proliferous writer in his early years, publishing several essays each month.","zh":"他早年写作非常多产，每个月发表好几篇随笔。"}]}],"synonyms":["prolific","productive","fecund","fertile","abundant"],"phonetic":"/proʊˈlɪfərəs/","extraExplanation":["“proliferous”来自拉丁语词根，和“proliferation（增殖/激增）”“proliferate（增殖；迅速增加）”同源。日常英语里，形容“多产的作家/艺术家”更常用的是“prolific”。","在植物学里，“proliferous”常指某些部位（如花序、花头）会继续长出新的芽或小植株，这种“继续长”的感觉比一般的“fertile（肥沃/能生育的）”更强调“不断生成新的结构”。"]}
{"word":"proliferously","summary":{"en":"“Proliferously” means “rapidly and in large numbers; abundantly.”","zh":"“proliferously”表示“迅速大量地增殖/扩散；繁多地、充沛地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that produces or increases rapidly; abundantly and in large numbers.","zh":"以迅速增多、繁殖或大量产生的方式；大量地、繁多地。"},"examples":[{"en":"Bacteria can grow proliferously in warm, moist conditions.","zh":"细菌在温暖潮湿的环境中可能会大量繁殖。"},{"en":"During the rainy season, weeds spread proliferously across the field.","zh":"雨季时，杂草在田里迅速蔓延。"},{"en":"The author wrote proliferously in his early career, publishing several books in a few years.","zh":"这位作者在职业早期写作非常多产，几年内出版了好几本书。"}]}],"synonyms":["abundantly","rapidly","in large numbers","profusely","prolifically"],"phonetic":"/proʊˈlɪfərəsli/","extraExplanation":["“proliferously”在现代英语里相对少见、偏书面；日常表达更常用“rapidly / quickly / in large numbers / abundantly”，在写作方面常用“prolifically（多产地）”。","词源上来自“proliferate（增殖、扩散）/ proliferous（多产的、繁殖旺盛的）”，常用于生物学、生态学或描述事物扩散（如谣言、产品、想法）。","用在“写作很多、产量很高”的语境时，母语者更自然的搭配通常是“write prolifically / produce prolifically”。"]}
{"word":"prolific","summary":{"en":"Prolific means producing a lot—especially lots of work, ideas, or results; it can also mean reproducing quickly in biology.","zh":"prolific 指“多产的/高产的”，常形容作品、想法或成果很多；在生物语境中也指“繁殖力强的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing a lot of something (such as work, ideas, art, or results); very productive.","zh":"多产的；高产的（指作品、想法、成果等很多）；非常有生产力的。"},"examples":[{"en":"She is a prolific writer who publishes a new book almost every year.","zh":"她是一位多产的作家，几乎每年都会出版一本新书。"},{"en":"The team was prolific in generating new ideas during the meeting.","zh":"这个团队在会议上提出了大量新点子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology) Producing many young, seeds, or offspring.","zh":"（生物）繁殖力强的；能产出许多幼体、种子或后代的。"},"examples":[{"en":"Rabbits are prolific and can have several litters each year.","zh":"兔子繁殖力很强，每年可以生好几窝。"},{"en":"This plant is prolific, spreading quickly by producing many seeds.","zh":"这种植物繁殖力旺盛，会通过大量结籽迅速扩散。"}]}],"synonyms":["productive","fruitful","fertile","abundant"],"phonetic":"/prəˈlɪfɪk/","extraExplanation":["词源上来自拉丁语 proles（后代）+ -fic（制造/产生），核心感觉是“不断产出很多”。在写作或新闻里常用来形容作者/艺术家/研究者“作品很多”，语气通常偏中性到褒义，但也可暗示“数量多于质量”，要看上下文。"]}
{"word":"prolificacy","summary":{"en":"Prolificacy means the quality of producing a lot, or (in biology) having high fertility.","zh":"prolificacy 指“多产”的特质；在生物学中可指“繁殖力强/高生育力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of producing a lot of something (such as work, ideas, or writing).","zh":"多产；高产（指作品、想法、写作等产出很多）。"},"examples":[{"en":"Her prolificacy as a novelist is impressive—she publishes almost every year.","zh":"她作为小说家的多产令人佩服——几乎每年都有新书出版。"},{"en":"The team’s prolificacy led to a steady stream of new product ideas.","zh":"团队的多产带来了源源不断的新产品点子。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology, the ability to produce many offspring or seeds; high fertility.","zh":"（生物学）繁殖力强；高生育力（能产生许多后代或种子）。"},"examples":[{"en":"Rabbits are known for their prolificacy, especially in favorable environments.","zh":"兔子以繁殖力强而闻名，尤其在环境适宜时。"},{"en":"Scientists studied the plant’s prolificacy to improve crop yields.","zh":"科学家研究这种植物的高产繁殖能力，以提高作物产量。"}]}],"synonyms":["fruitfulness","fecundity","productiveness","abundance"],"phonetic":"/prəˈlɪfɪkəsi/","extraExplanation":["“prolificacy”来自形容词“prolific”（多产的），常见于较正式的书面语或学术语境。日常口语里，人们更常说“productivity（生产力/效率）”或直接用“prolific（多产的）”。","区分：prolificacy强调“产出数量很多”这一特质；productivity更偏向“单位时间产出多少/效率”。"]}
{"word":"prolifical","summary":{"en":"Prolific means producing a lot—especially lots of work, ideas, or results; in biology, producing many offspring.","zh":"Prolific 指“多产的、高产的”；在生物学语境中也指“繁殖力强的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing a lot of something (such as work, ideas, books, or art); very productive.","zh":"（作品、想法、成果等）产出很多的；多产的；高产的。"},"examples":[{"en":"She is a prolific writer who publishes a new book almost every year.","zh":"她是一位多产的作家，几乎每年都会出版一本新书。"},{"en":"The company’s prolific innovation helped it grow quickly.","zh":"这家公司高产的创新能力帮助它迅速成长。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology) Producing many offspring, seeds, or fruits.","zh":"（生物）繁殖力强的；多结果实/多产种子的。"},"examples":[{"en":"Rabbits are known for being prolific breeders.","zh":"兔子以繁殖力强而闻名。"},{"en":"This plant is prolific in warm, sunny areas.","zh":"这种植物在温暖、阳光充足的地区生长繁盛（结果多）。"}]}],"synonyms":["productive","fruitful","fertile","abundant","creative"],"phonetic":"/prəˈlɪfɪk/","extraExplanation":["你输入的“prolifical”通常被认为是拼写错误；标准拼写是 **prolific**。英语里也有名词 **prolificacy**（多产；繁殖力强）和副词 **prolifically**（多产地）。","用法小提示：**prolific** 常与表示成果的名词搭配，如 *prolific writer/artist/inventor*, *prolific output*, *prolific career*。在文学评论中也常用来形容作家“笔耕不辍、作品数量多”。"]}
{"word":"prolifically","summary":{"en":"Prolifically means “in a very productive or abundant way,” especially producing many works or growing/spreading a lot.","zh":"prolifically 意为“多产地、丰盛地”，常指产出很多作品/成果，或生长、繁殖、扩散很多。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that produces many works, ideas, or results (often used for writing, art, research, etc.).","zh":"多产地；大量地（常用于写作、艺术、研究等产出很多作品、想法或成果）。"},"examples":[{"en":"She writes prolifically, publishing two novels a year.","zh":"她写作非常多产，每年出版两本小说。"},{"en":"The scientist worked prolifically and published dozens of papers.","zh":"这位科学家高产地工作，发表了几十篇论文。"}]},{"partOfSpeech":"adv.","definition":{"en":"In large quantities; very abundantly (of something growing or appearing a lot).","zh":"大量地；繁盛地（指某物生长或出现得很多）。"},"examples":[{"en":"Wildflowers grew prolifically after the spring rains.","zh":"春雨过后，野花大量繁盛地生长。"},{"en":"The plant spreads prolifically if you don’t control it.","zh":"如果不加控制，这种植物会大量蔓延。"}]}],"synonyms":["productively","abundantly","copiously","fertilely"],"phonetic":"/proʊˈlɪfɪkli/","extraExplanation":["词源提示：prolific 来自拉丁语，和“生育/结果很多”有关，所以既能形容人“作品很多”（写作、发表、创作），也能形容植物或事物“长得多、出现得多”。","常见搭配：write/publish prolifically（高产写作/发表）；breed/spread prolifically（大量繁殖/扩散）；grow prolifically（繁盛生长）。","语感区别：prolifically 强调“产出数量多”，不一定表示质量高；想强调“写得好”可用 brilliantly / beautifully / skillfully。"]}
{"word":"prolificalness","summary":{"en":"“Prolificalness” means the state of being prolific, but it is uncommon; “prolificness” or “prolificacy” is usually preferred.","zh":"“prolificalness”表示“多产的状态”，但很少用；通常更推荐用“prolificness”或“prolificacy”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being prolific; producing many works, results, or offspring","zh":"多产；丰产；创作或产出很多的状态"},"examples":[{"en":"Her prolificalness as a novelist is impressive—she publishes almost every year.","zh":"她作为小说家的多产令人印象深刻——几乎每年都会出版作品。"},{"en":"The research team’s prolificalness led to several papers in top journals.","zh":"这个研究团队的高产使他们在顶级期刊上发表了多篇论文。"}]}],"synonyms":["prolificness","prolificacy","productivity","fecundity"],"phonetic":"/prəˈlɪfɪkəlnəs/","extraExplanation":["“prolificalness”在现代英语里很少见，通常被视为不标准或不自然的构词。更常用、更地道的名词是“prolificness”（多产）或“prolificacy”（多产/繁殖力）。正式写作中建议用这两个词之一。","词根来自“prolific”（多产的、能繁殖的）。“-ness”常用来把形容词变成名词（如 kindness），但“prolific + -ness”已经足够表达意思，因此再加“-al-”形成“prolificalness”会显得累赘或不常见。"]}
{"word":"prolificate","summary":{"en":"“Prolificate” is a rare verb meaning “to make or become prolific; to produce more.”","zh":"“prolificate”是个罕用动词，意为“使/变得多产；产出更多”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To make or become prolific; to increase in productivity or in the number of things produced (such as books, artworks, or ideas).","zh":"（罕用）使（某人/某事）多产；变得多产；提高产出（如书、作品或想法的数量）。"},"examples":[{"en":"After the move to a quieter city, the novelist seemed to prolificate, publishing a new book every year.","zh":"搬到更安静的城市后，那位小说家似乎变得更为多产，几乎每年都出版一本新书。"},{"en":"The editor hoped the new grant would prolificate research in the field.","zh":"编辑希望新的资助能促进该领域研究产出。"}]}],"synonyms":["become more prolific","increase productivity","produce more","multiply","proliferate"],"phonetic":"/proʊˈlɪfɪˌkeɪt/","extraExplanation":["“prolificate”在现代英语里非常少见，写作与口语中更常用的表达是形容词“prolific（多产的）”，或动词短语“become more prolific / increase productivity / produce more”。","如果你想表达“某人很能写/很能产出”，更自然的说法是：“She is a prolific writer.”（她是位多产的作家。）","词源上与拉丁语“proles（后代）”有关，核心概念是“繁殖/产出很多”。在文学评论里常用“prolific”来评价作家、艺术家或学者。"]}
{"word":"prolificated","summary":{"en":"“Prolificated” is not standard; most writers mean “proliferated” (spread/increased quickly) or “prolific” (very productive).","zh":"“prolificated”不是标准用法；多数情况下应为“proliferated”（迅速扩散/激增）或“prolific”（多产的/产量高的）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/incorrect form. In modern English, “prolificated” is rarely used and is usually a mistake for “proliferated” (spread/increased quickly) or “prolific” (producing a lot).","zh":"非标准/不常用的形式。在现代英语里“prolificated”几乎不用，通常是把“proliferated”（迅速扩散/激增）或“prolific”（多产的/产量高的）写错了。"},"examples":[{"en":"The word “prolificated” looks like a misspelling; you probably mean “proliferated.”","zh":"“prolificated”看起来像拼写错误；你可能想写“proliferated”。"},{"en":"If you mean “made a lot of work/books,” use “prolific” instead.","zh":"如果你想表达“写了很多作品/做了很多产出”，用“prolific”更合适。"}]},{"partOfSpeech":"v.","definition":{"en":"(Common intended word) “proliferated”: increased rapidly in number; spread widely.","zh":"（常见的本意词）“proliferated”：数量迅速增加；广泛蔓延/扩散。"},"examples":[{"en":"Rumors proliferated after the announcement.","zh":"公告发布后，谣言迅速扩散。"},{"en":"New cafes have proliferated in the neighborhood.","zh":"这个街区的新咖啡馆越来越多。"}]}],"synonyms":["proliferated","spread","multiplied","increased rapidly","expanded"],"phonetic":"/prəˈlɪfəˌreɪtɪd/","extraExplanation":["“prolific”来自拉丁语词根，常指“多产的、产量高的”（prolific writer 多产作家）。而“proliferate”更偏向“数量激增、迅速扩散”（ideas proliferate 观点蔓延）。两者意思相近但用法不同。","如果你写作中想表达“使……增多/扩散”，一般用动词 proliferate（不及物）或 cause/lead to a proliferation of（导致……激增）。"]}
{"word":"prolificating","summary":{"en":"“Prolificating” is a rare form meaning “producing or multiplying quickly,” but most writers mean “proliferating.”","zh":"“prolificating”很少用，意为“大量产生/迅速增多”，但大多数情况下应写“proliferating”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) producing or causing something to be produced in large numbers; multiplying quickly. (Present participle of “prolificate.”)","zh":"（罕见）大量产生；使大量出现；迅速增多。（“prolificate”的现在分词）"},"examples":[{"en":"The weeds were prolificating after the heavy rain.","zh":"大雨过后，杂草大量滋生。"},{"en":"Some online rumors keep prolificating when people share them without checking facts.","zh":"一些网络谣言在人们不核实就转发时会不断大量传播。"}]}],"synonyms":["proliferating","multiplying","spreading","breeding","increasing"],"phonetic":"/proʊˈlɪfɪˌkeɪtɪŋ/","extraExplanation":["“prolificating”在现代英语中非常少见；多数情况下人们想写的是“proliferating”（proliferate 的现在分词），意思是“迅速繁殖/激增/扩散”。在正式写作里，建议用更常见的“proliferating”。","“prolific”常用作形容词，表示“多产的；成果丰富的”（a prolific writer 多产的作家）。因此看到“prolificating”，也可能是把“prolific”与“proliferating”混用了。"]}
{"word":"prolification","summary":{"en":"Proliferation means a rapid increase or spread, especially in numbers; in biology, it means rapid cell growth.","zh":"Proliferation 指数量迅速增加或快速扩散；在生物学中指细胞等快速增殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of increasing rapidly in number or spreading quickly; rapid growth.","zh":"（数量）迅速增加或（事物）快速扩散的过程；激增。"},"examples":[{"en":"Many people worry about the proliferation of misinformation online.","zh":"很多人担心网络上错误信息的激增。"},{"en":"The city is trying to control the proliferation of illegal street vendors.","zh":"这座城市正试图控制非法街头摊贩的迅速增加。"}]},{"partOfSpeech":"n.","definition":{"en":"Biology: the rapid multiplication of cells or organisms.","zh":"【生物】细胞或生物体的快速增殖。"},"examples":[{"en":"The drug aims to slow the proliferation of cancer cells.","zh":"这种药旨在减缓癌细胞的增殖。"},{"en":"Scientists measured cell proliferation in the lab.","zh":"科学家在实验室测量了细胞增殖情况。"}]}],"synonyms":["rapid growth","increase","expansion","spread","multiplication"],"phonetic":"/prəˌlɪfəˈreɪʃən/","extraExplanation":["“prolification”不是常见标准词。大多数情况下你想表达的是 **proliferation**（激增、扩散）。在正式写作与考试中建议使用 *proliferation*。","词源提示：*proliferation* 来自 *prolific*（多产的）与拉丁语词根 *proles*（后代）+ *ferre*（携带/产生），因此常带有“快速繁殖、扩散”的含义。","常见搭配：the proliferation of + 名词（misinformation/arms/apps/weeds 等）；动词搭配：prevent/stop/control/curb the proliferation of…"]}
{"word":"prolificity","summary":{"en":"Prolificity means producing a lot—especially many works, results, or ideas.","zh":"prolificity 指“多产/高产”，尤其是作品、成果或想法产出很多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of producing many works, results, or ideas; fruitfulness or high productivity","zh":"多产；高产；成果丰硕（指作品、结果或想法产出很多）"},"examples":[{"en":"Her prolificity as a novelist surprised even her editors.","zh":"她作为小说家的多产程度，连编辑都感到惊讶。"},{"en":"The team’s prolificity led to several new product features in just one month.","zh":"团队的高产让他们在短短一个月内就推出了好几个新功能。"},{"en":"Scientists debated whether the lab’s prolificity came from better tools or better teamwork.","zh":"科学家们讨论该实验室的成果丰硕究竟来自更好的工具还是更好的协作。"}]}],"synonyms":["productivity","fruitfulness","fecundity","abundance","copiousness"],"phonetic":"/ˌproʊləˈfɪlɪti/","extraExplanation":["“prolificity”比“prolific”少见，更多出现在较正式或学术写作中。日常表达里更常用“productivity（生产力/效率）”“fruitfulness（成果丰硕）”或“prolific output（多产的产出）”。","词根来自拉丁语 *proles*（后代）+ *-fic*（产生、制造），原意与“多生育/繁殖力强”相关；现代更常指“作品或成果很多”。文学评论中常用来评价作家、诗人或学者的“创作/发表数量”。"]}
{"word":"prolificly","summary":{"en":"“Prolifically” means producing a lot, or happening in great abundance.","zh":"“Prolifically”表示“多产地”或“大量、繁盛地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that produces a lot of something (such as books, art, ideas, or babies).","zh":"多产地；大量产出地（如写作、创作、想法或生育）。"},"examples":[{"en":"She writes prolifically, publishing two novels a year.","zh":"她写作非常多产，每年出版两本小说。"},{"en":"The plant grows prolifically in warm, wet climates.","zh":"这种植物在温暖潮湿的气候中大量生长。"}]},{"partOfSpeech":"adv.","definition":{"en":"In large numbers; very abundantly (often used for things that spread or appear a lot).","zh":"数量很多地；极其繁盛地（常指大量出现或蔓延）。"},"examples":[{"en":"Wildflowers bloomed prolifically along the trail.","zh":"野花在小径旁大量盛开。"},{"en":"The rumor spread prolifically online.","zh":"谣言在网上迅速而广泛地传播。"}]}],"synonyms":["abundantly","productively","copiously","profusely"],"phonetic":"/proʊˈlɪfɪkli/","extraExplanation":["“prolificly”是常见拼写错误，正确拼法是 **prolifically**（prolific + -ly）。","词根提示：**prolific** 常用来形容“作家/艺术家很高产”或“植物/细菌繁殖旺盛”。在正式写作里，比起只说 “a lot”，用 “prolifically” 更强调“持续地产出很多”。"]}
{"word":"prolificness","summary":{"en":"Prolificness means the quality of producing a lot, such as many works, results, or offspring.","zh":"Prolificness 指“多产/高产”的特质，可用于作品成果很多或繁殖力强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being prolific; producing a lot of work, ideas, results, or offspring","zh":"多产；高产；（作品、成果或后代）产出很多的特质"},"examples":[{"en":"Her prolificness as a novelist is impressive—she publishes a new book almost every year.","zh":"她作为小说家的多产令人惊讶——几乎每年都会出版一本新书。"},{"en":"The plant’s prolificness makes it spread quickly across the garden.","zh":"这种植物的繁殖力很强，所以在花园里扩散得很快。"},{"en":"Researchers measured the prolificness of the lab animals by counting the number of offspring.","zh":"研究人员通过统计后代数量来衡量实验动物的繁殖能力。"}]}],"synonyms":["productivity","fecundity","fertility","fruitfulness","abundance"],"phonetic":"/prəˈlɪfɪknəs/","extraExplanation":["“prolificness”来自形容词“prolific（多产的）”+ 名词后缀“-ness（……的状态/性质）”。日常英语里更常用“productivity（生产力/产量）”“fertility（生育力/繁殖力）”或直接用“being prolific（很高产）”，因为“prolificness”相对少见、更偏书面。"]}
{"word":"prolificy","summary":{"en":"“Prolificy” is not standard; use “prolificacy/prolificity” (the quality of being prolific) or “prolific” (adj.).","zh":"“prolificy”不是标准拼写；通常应写“prolificacy/prolificity”（多产性/繁殖力），或用形容词“prolific”（多产的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “prolificity” or “prolificacy,” meaning the quality of producing many works, results, or offspring.","zh":"（非标准拼写）通常是把“prolificity”或“prolificacy”拼错，意思是“多产；产量高；繁殖力强的特质”。"},"examples":[{"en":"Her prolificity as a songwriter is clear from the three albums she released in one year.","zh":"她作为词曲作者的多产性，从她一年发行三张专辑就能看出来。"},{"en":"Scientists measured the prolificacy of the insects by counting how many eggs each one laid.","zh":"科学家通过统计每只昆虫产卵数量来衡量它们的繁殖力。"}]}],"synonyms":["prolificacy","prolificity","productivity","fecundity"],"phonetic":"/pɹəˈlɪfɪkəsi/","extraExplanation":["“prolificy”在现代英语中几乎不作为标准词使用。更常见的形容词是 **prolific**（多产的），名词形式通常写作 **prolificacy** 或 **prolificity**（多产性/繁殖力）。","日常写作里更自然的表达往往是：**be prolific**（很高产）或 **high productivity**（高生产力/高产出）。"]}
{"word":"prolify","summary":{"en":"“Prolify” isn’t standard; you probably mean “prolific” (adj., producing a lot) or “proliferate” (v., increase/spread quickly).","zh":"“prolify”不是标准用词；你大概率想写的是“prolific”（多产的）或“proliferate”（迅速增长/扩散）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “prolific” (adj.) or confusion with “proliferate” (v.).","zh":"不是标准英语单词；最常见是把 “prolific”（形容词）拼错，或与 “proliferate”（动词）混淆。"},"examples":[{"en":"I think you mean “prolific,” not “prolify.”","zh":"我觉得你想写的是 “prolific”，不是 “prolify”。"},{"en":"If you mean “increase quickly,” the verb is “proliferate.”","zh":"如果你想表达“快速增加”，动词是 “proliferate”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) “prolific”: producing a lot (of works, ideas, results).","zh":"（你可能想写）“prolific”：多产的；产出很多（作品、想法、成果）的。"},"examples":[{"en":"She is a prolific writer who publishes a book every year.","zh":"她是一位多产的作家，几乎每年都出版一本书。"},{"en":"The team had a prolific season, scoring in almost every game.","zh":"这个队赛季表现“火力十足”，几乎每场都有进球。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Related verb) “proliferate”: to increase quickly in number or spread rapidly.","zh":"（相关动词）“proliferate”：（数量）迅速增长；迅速扩散。"},"examples":[{"en":"Rumors proliferated after the announcement.","zh":"公告发布后，谣言迅速传播。"},{"en":"Invasive plants can proliferate and harm local ecosystems.","zh":"入侵植物会迅速繁殖并破坏当地生态系统。"}]}],"synonyms":["prolific: productive","prolific: fruitful","prolific: fecund","proliferate: multiply","proliferate: spread","proliferate: mushroom"],"phonetic":"/prəˈlɪfɪk/","extraExplanation":["“prolific”常用于人（作家、艺术家、研究者）或产出（ideas/results）。搭配很常见：a prolific author / a prolific researcher / prolific output。","“proliferate”更偏“数量变多、扩散”，主语常是事物：cells/rumors/weeds/apps 等。","词源小提示：prolific 来自拉丁语 proles（后代）+ -fic（制造/产生），所以核心感觉是“能产生很多”。"]}
{"word":"proligerous","summary":{"en":"A rare adjective meaning “producing offspring or new growth; prolific.”","zh":"一个罕见形容词，意为“能繁殖后代或产生新生长的；多产的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) producing offspring or new growth; prolific; reproductive.","zh":"（罕见）能繁殖后代或产生新生长的；多产的；繁殖性的。"},"examples":[{"en":"Some older botanical texts describe certain plants as proligerous because they produce new shoots easily.","zh":"一些较早的植物学文献用 proligerous 来形容某些植物，因为它们很容易长出新枝。"},{"en":"The proligerous colony expanded quickly in the warm season.","zh":"这个具繁殖力的群体在温暖季节迅速扩张。"}]}],"synonyms":["prolific","proliferous","fertile","productive"],"phonetic":"/proʊˈlɪdʒərəs/","extraExplanation":["proligerous 是非常少见的词，多见于较旧的科学/植物学语境。更常见、拼写更常用的近义词是 proliferous 或 prolific。","词源上通常被解释为来自拉丁语 proles（后代）+ gerere（携带、产生），因此核心含义是“带来/产生后代或新生长”。","如果你原本想查的是 proliferous（常见）或 prolific（很常用），我也可以一并对比它们在语气与用法上的区别。"]}
{"word":"prolin","summary":{"en":"Proline: a common amino acid that helps form proteins (especially collagen).","zh":"脯氨酸：一种常见氨基酸，用于构成蛋白质（尤其与胶原蛋白相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common amino acid (one of the building blocks of proteins) found in many foods and in the human body; its standard abbreviation is Pro","zh":"脯氨酸：一种常见的氨基酸（蛋白质的组成单位之一），存在于许多食物和人体中；标准缩写为 Pro"},"examples":[{"en":"Proline is important for making collagen, a protein in skin and connective tissue.","zh":"脯氨酸对合成胶原蛋白很重要；胶原蛋白存在于皮肤和结缔组织中。"},{"en":"This protein powder lists proline among its amino acids.","zh":"这款蛋白粉的成分表里把脯氨酸列在氨基酸之中。"}]}],"phonetic":"/ˈproʊliːn/","extraExplanation":["你输入的 “prolin” 更常见的标准拼写是 **proline**。在化学/生物课本或营养品标签上通常用 **proline**（或缩写 **Pro**）。","脯氨酸在结构上比较“特殊”，常被提到与蛋白质的折叠和胶原蛋白的结构有关（这也是它在生物学语境里常出现的原因）。"]}
{"word":"proline","summary":{"en":"Proline is an amino acid (a building block of proteins), common in collagen and important for protein shape.","zh":"Proline（脯氨酸）是一种构成蛋白质的氨基酸，在胶原蛋白中很常见，并影响蛋白质结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural amino acid used to build proteins; it is especially common in collagen and helps affect the shape and stability of proteins.","zh":"一种天然氨基酸，是构成蛋白质的原料之一；在胶原蛋白中含量尤其高，会影响蛋白质的形状与稳定性。"},"examples":[{"en":"Collagen is rich in proline, which helps give skin and connective tissue their structure.","zh":"胶原蛋白富含脯氨酸，这有助于皮肤和结缔组织形成结构支撑。"},{"en":"Some protein powders list proline on the amino acid profile.","zh":"一些蛋白粉会在氨基酸成分表中标出脯氨酸。"}]}],"synonyms":["amino acid"],"phonetic":"/ˈproʊliːn/","extraExplanation":["“Proline（脯氨酸）”在生物化学里常被称为“独特的氨基酸”，因为它的侧链会和自身的氨基氮相连，形成一个环状结构；这使它在蛋白质中常常影响肽链的弯折与空间构象。","日常英语里它主要出现在营养学、健身补剂成分表、医学或生物学教材中，不太用于普通日常对话。"]}
{"word":"prolines","summary":{"en":"“Prolines” means more than one proline—an amino acid that helps build proteins, especially collagen.","zh":"“Prolines”是“proline（脯氨酸）”的复数，指多种/多个脯氨酸（常见氨基酸之一，尤其与胶原蛋白相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biochemistry) Proline: an amino acid used by the body to build proteins; it is especially common in collagen (a major part of skin, tendons, and connective tissue). “Prolines” is the plural form (more than one proline molecule or proline residues in proteins).","zh":"（生物化学）脯氨酸：人体用来合成蛋白质的一种氨基酸；在胶原蛋白中含量尤其高（胶原是皮肤、肌腱和结缔组织的重要成分）。“prolines”是其复数形式（指多个脯氨酸分子或蛋白质中的多个脯氨酸残基）。"},"examples":[{"en":"Collagen contains many prolines, which help the protein keep its structure.","zh":"胶原蛋白含有许多脯氨酸，它们帮助蛋白质保持结构。"},{"en":"The lab compared the levels of prolines in different tissue samples.","zh":"实验室比较了不同组织样本中的脯氨酸含量。"}]}],"synonyms":["proline (singular)","amino acid (general term)"],"phonetic":"/ˈproʊliːn/","extraExplanation":["“Proline”常见于生物、医学与营养学语境；在蛋白质里也常说“proline residue（脯氨酸残基）”。","英文里复数“prolines”多用于科研写作：要么指“多分子/多份脯氨酸”，要么指“蛋白质序列中出现的多个脯氨酸位点”。","脯氨酸属于20种常见氨基酸之一，结构比较特殊（侧链会“回连”到氨基氮），因此在蛋白质折叠与胶原稳定性中很重要。"]}
{"word":"proliquor","summary":{"en":"Pro-liquor means supporting alcohol sales or looser alcohol laws; it can also refer to the people or groups who hold that view.","zh":"pro-liquor 指支持酒类销售或更宽松酒类法规的立场，也可指持该立场的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the sale, production, or legal availability of alcoholic drinks; favoring “liquor” interests (often in politics or policy debates).","zh":"（多用于政治/政策语境）支持酒类的生产、销售或合法供应；亲酒类（阵营/立场）。"},"examples":[{"en":"The senator took a pro-liquor stance and opposed the new restrictions on alcohol sales.","zh":"这位参议员采取亲酒类立场，反对新的酒类销售限制。"},{"en":"During the campaign, pro-liquor groups donated money to candidates who promised fewer regulations.","zh":"竞选期间，亲酒类团体向承诺减少监管的候选人捐款。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or side that supports liquor interests or looser alcohol laws.","zh":"支持酒类利益或更宽松酒类法律的人/团体/阵营。"},"examples":[{"en":"The pros and the antis argued for hours at the town meeting.","zh":"在镇民大会上，亲酒派和反酒派争论了好几个小时。"},{"en":"Local pro-liquors organized a petition against the proposed ban.","zh":"当地亲酒派组织请愿，反对拟议的禁令。"}]}],"synonyms":["pro-alcohol","wet (U.S. politics)","anti-prohibition"],"phonetic":"/ˌproʊˈlɪkɚ/","extraExplanation":["“proliquor”更常见的写法是“pro-liquor”。它通常出现在公共政策、历史（如美国禁酒运动/禁酒令时期）或选举报道中，用来对比“anti-liquor（反酒类）”。","语气上往往带有立场色彩：可能是中性描述，也可能暗含批评（例如暗示与酒类行业利益相关）。"]}
{"word":"proliterary","summary":{"en":"“Proliterary” means supportive of literature or literary culture.","zh":"“proliterary” 指“支持文学或文学文化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring literature, literary study, or literary culture","zh":"支持文学的；偏向文学（研究/文化）的"},"examples":[{"en":"The organization runs proliterary programs that encourage young people to read novels and poetry.","zh":"该组织开展支持文学的项目，鼓励年轻人阅读小说和诗歌。"},{"en":"Her proliterary views shaped the school’s decision to expand the library and writing workshops.","zh":"她支持文学的观点影响了学校扩建图书馆并增加写作工作坊的决定。"}]}],"synonyms":["pro-literary","literature-supporting","bookish (informal, sometimes with a different nuance)","in favor of literature"],"phonetic":"/ˌproʊˈlɪtərɛri/","extraExplanation":["“pro-”是英语前缀，表示“支持、赞成”（如 pro-democracy 支持民主的）。因此 *proliterary* 可理解为“支持文学/文学文化的”。","*proliterary* 并不是非常常见的标准词；更常见、更自然的表达包括 **pro-literary**（加连字符）或用短语 **in favor of literature / supportive of literature**。在正式写作中建议根据语境选用更常见的表达。"]}
{"word":"proliturgical","summary":{"en":"“Proliturgical” means favoring or promoting formal liturgical worship.","zh":"“proliturgical”指支持或推崇礼仪化、程序化的正式崇拜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring liturgy (formal, structured public worship), especially in a church context","zh":"支持或偏好“礼仪／仪式化崇拜”（有固定程序与文本的公共敬拜），尤用于教会语境"},"examples":[{"en":"Some members are proliturgical and prefer a traditional service with set prayers.","zh":"有些会友偏向礼仪崇拜，喜欢包含固定祷文的传统礼拜。"},{"en":"The new pastor is proliturgical, so the church added more readings and formal responses.","zh":"新牧师较偏礼仪传统，因此教会增加了更多经文宣读与会众的固定应答。"}]}],"synonyms":["liturgically minded","pro-liturgy","ritual-oriented","high-church (context-dependent)"],"phonetic":"/ˌproʊlɪˈtɝːdʒɪkəl/","extraExplanation":["“pro-”表示“支持、赞成”，而“liturgical”来自“liturgy（礼仪/礼拜仪式）”。因此 proliturgical 常用来描述对“高礼仪”（如圣公会、天主教、东正教或偏传统的新教礼拜形式）持支持态度的人、团体或做法。","这个词在日常英语里不算常见，更常见的表达有：liturgically minded（偏礼仪传统的）、pro-liturgy（支持礼仪的）、high-church（偏高礼仪传统的，视宗派语境而定）。","注意它通常带有宗教与教会传统的立场色彩，使用时要考虑听众背景，避免将其当作普遍的“支持仪式”来泛化。"]}
{"word":"proliturgist","summary":{"en":"A rare word meaning a person who supports formal church liturgy and set rituals.","zh":"一个较罕见的词，指支持教会礼仪与固定仪式的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly supports formal liturgy (set prayers and rituals) in Christian worship; an advocate of liturgical practice or liturgical reforms","zh":"（基督教语境）支持礼仪崇拜（固定祷文与仪式）的人；礼仪实践或礼仪改革的拥护者"},"examples":[{"en":"Some proliturigists argue that a set liturgy gives worship a shared rhythm and meaning.","zh":"一些支持礼仪的人认为，固定礼仪能让敬拜拥有共同的节奏与意义。"},{"en":"In the debate, proliturigists preferred the traditional prayers, while others wanted freer forms of worship.","zh":"在辩论中，支持礼仪的一方更偏好传统祷文，而另一方则希望更自由的敬拜形式。"}]}],"synonyms":["pro-liturgical person","liturgy advocate","liturgist (related, but broader)"],"phonetic":"/proʊˈlɪtərdʒɪst/","extraExplanation":["这个词非常少见，更多时候人们会用更常见的 liturgist（礼仪学者/礼仪工作人员）或 pro-liturgy / pro-liturgical（支持礼仪的）来表达类似意思。","构词上 pro- 表示“支持”，liturgy 指“（教会）礼仪”。如果你是在某篇文章里看到 proliturigist，也可能是作者临时造词或不常见的拼写/用法。"]}
{"word":"prolix","summary":{"en":"“Prolix” describes speech or writing that is unnecessarily long and wordy.","zh":"“prolix”用来形容说话或写作不必要地冗长、啰嗦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many words; long-winded, especially in speech or writing.","zh":"（说话或写作）冗长啰嗦的；话太多的。"},"examples":[{"en":"His report was clear, but the introduction was prolix.","zh":"他的报告很清楚，但引言部分很冗长。"},{"en":"Try not to be prolix—say what you mean in a few sentences.","zh":"尽量别啰嗦——用几句话把意思说清楚就好。"},{"en":"The professor’s prolix explanation confused some students.","zh":"教授冗长的解释让一些学生更困惑了。"}]}],"synonyms":["verbose","wordy","long-winded","rambling"],"phonetic":"/proʊˈlɪks/","extraExplanation":["“prolix”多用于比较正式的语境（写作评价、演讲反馈、学术评论），带轻微负面含义，强调“字数多但信息密度不高”。","常见搭配：prolix speech（冗长的演讲）, prolix style（啰嗦的文风）, prolix explanation（冗长的解释）。","近义词辨析：verbose 常指“用词过多/句子过长”；wordy 较口语，指“文字太多”；rambling 强调“离题、东拉西扯”。"]}
{"word":"prolixious","summary":{"en":"Prolixious means overly long and wordy (a rare variant of prolix).","zh":"prolixious 指“冗长啰嗦的”，是 prolix 的少见变体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Too long and wordy; using more words than necessary (often in a boring or overly detailed way).","zh":"（少见用法）冗长啰嗦的；用词过多、细节过度（常带有令人厌烦的语气）。"},"examples":[{"en":"His prolixious email took ten minutes to read but could have been three sentences.","zh":"他的邮件冗长啰嗦，读了十分钟，其实三句话就能说清。"},{"en":"The report is accurate, but the prolixious style hides the main point.","zh":"报告内容准确，但冗长的写法掩盖了重点。"}]}],"synonyms":["prolix","verbose","wordy","long-winded","rambling"],"phonetic":"/proʊˈlɪksiəs/","extraExplanation":["“prolixious”是“prolix”的少见变体；现代英语里更常用、更自然的是“prolix”。","词源可追溯到拉丁语 prolixus，带有“延伸得很长”的意思，因此常用来批评文章、演讲或邮件“话太多、重点不清”。"]}
{"word":"prolixity","summary":{"en":"Prolixity means excessive wordiness—writing or speaking that is too long and detailed.","zh":"prolixity 指“过度冗长、啰嗦”，即说写内容太长太繁琐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of using too many words; long-windedness in speech or writing.","zh":"冗长啰嗦；说话或写作时用词过多、拖沓的特质。"},"examples":[{"en":"The editor cut the article’s prolixity to make the main point clearer.","zh":"编辑删掉了文章的冗长啰嗦，让中心思想更清楚。"},{"en":"Her apology was sincere, but its prolixity tested everyone’s patience.","zh":"她的道歉很真诚，但过于冗长，考验了大家的耐心。"}]}],"synonyms":["wordiness","verbosity","long-windedness","diffuseness"],"phonetic":"/proʊˈlɪksəti/","extraExplanation":["“Prolixity”常用于较正式的语境（写作批评、演讲评价、学术讨论），语气偏负面，强调“过度冗长”而不只是“很长”。","词根来自拉丁语 pro-（向前）+ lōqui（说话），带有“说个不停、往前延展”的感觉。常见形容词是 “prolix”（冗长的）。","文学与修辞评论中会把“prolixity”当作需要避免的文风问题之一，常与“clarity（清晰）”“brevity（简洁）”对比。"]}
{"word":"prolixly","summary":{"en":"“Prolixly” means speaking or writing in an overly long and wordy way.","zh":"“prolixly”指说话或写作过于冗长、啰嗦。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a long-winded way; using too many words, often so it becomes boring or hard to follow.","zh":"（说话/写作）冗长地；啰嗦地；用词过多以至于显得乏味或难以理解。"},"examples":[{"en":"He explained the plan prolixly, and everyone lost track of the main point.","zh":"他把计划讲得很冗长，大家都跟丢了重点。"},{"en":"The report is prolixly written; it needs to be shorter and clearer.","zh":"这份报告写得很啰嗦；需要更短、更清楚。"}]}],"synonyms":["wordily","verbosely","long-windedly","at length"],"phonetic":"/proʊˈlɪksli/","extraExplanation":["“prolixly”来自形容词“prolix”（冗长的、啰嗦的），常用于较正式或批评性的语境，尤其是评价写作风格（如文章、报告、演讲）。","近义词里“wordily”较常见、更口语；“prolixly”更书面、更带文学/评论色彩。","常见搭配：prolixly written（写得冗长）、prolixly argued（论证得拖沓）。"]}
{"word":"prolixness","summary":{"en":"Prolixness means being unnecessarily long and wordy in speaking or writing.","zh":"prolixness 指说话或写作不必要地冗长、啰嗦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long-windedness; the quality of using more words than needed, especially in speech or writing.","zh":"冗长；啰嗦；（讲话或写作中）用词过多、表达拖沓的特点。"},"examples":[{"en":"The report was full of prolixness, so it took a long time to find the main point.","zh":"这份报告很冗长，所以花了很久才找到重点。"},{"en":"Try to cut the prolixness from your essay by using shorter sentences and clearer verbs.","zh":"试着把作文里的啰嗦删掉：用更短的句子和更明确的动词。"}]}],"synonyms":["wordiness","verbosity","long-windedness","diffuseness","garrulousness"],"phonetic":"/proʊˈlɪks.nəs/","extraExplanation":["“prolixness”常见于较正式或批评性的语境，用来评价文章、演讲或说明“说得太多但信息密度不高”。","词根上与拉丁语 *prolixus*（“流得很长、延伸很远”）有关，因此带有“延展开去、过度铺陈”的画面感。","写作建议：要避免 prolixness，可优先删掉重复信息、空泛套话（比如“in order to”“due to the fact that”一类），并用更具体的动词和名词表达。"]}
{"word":"proller","summary":{"en":"“Proller” is not standard English; it’s likely a misspelling (often of “prowler” or “roller”) or a proper name.","zh":"“proller”不是标准英语词；多半是拼写错误（常见可能为“prowler”或“roller”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (proper noun). Common intended words include “prowler” or “roller.”","zh":"不是标准英语单词。更可能是拼写错误或人名/专有名词。常见可能想写的是“prowler（潜行者）”或“roller（滚轮/卷筒）”。"},"examples":[{"en":"I couldn’t find “proller” in a dictionary—did you mean “prowler” or “roller”?","zh":"我在词典里找不到“proller”——你是不是想写“prowler”或“roller”？"},{"en":"If you tell me the sentence, I can guess what “proller” was meant to be.","zh":"如果你把完整句子发我，我可以帮你判断“proller”原本想表达哪个词。"}]}],"synonyms":["(possible intended) prowler","(possible intended) roller"],"phonetic":"/ˈproʊlər/","extraExplanation":["“proller”在常见英语语料与主流词典中基本不出现，因此更像拼写误差。最接近的常见词有：\n1) prowler /ˈpraʊlər/：指“潜行者、夜间徘徊者”，常见搭配如 night prowler。\n2) roller /ˈroʊlər/：指“滚轮、滚筒；滚动的人/物”，如 paint roller（油漆滚筒）、roller coaster（过山车）。\n如果你能提供上下文（整句、领域：游戏/机械/人名/网名等），我可以把正确词、意思与用法给你整理成标准词条。"]}
{"word":"prolocution","summary":{"en":"Prolocution means a formal public speech or the act of making such a speech.","zh":"prolocution 指正式的公开演讲或正式发言（致辞）的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal or public speech; the act of speaking publicly or officially.","zh":"正式的（公开的）演讲；公开或正式发言的行为。"},"examples":[{"en":"The chair opened the meeting with a short prolocution.","zh":"主席用一段简短的开场发言开始了会议。"},{"en":"In older writing, prolocution can refer to a prepared speech delivered on a special occasion.","zh":"在较早的文献中，prolocution 可指在特殊场合发表的预先准备好的致辞。"}]}],"synonyms":["speech","address","oration","remarks","discourse"],"phonetic":"/ˌproʊləˈkjuːʃən/","extraExplanation":["这个词在现代英语中非常少见，更常用的表达是 speech、address、opening remarks（开场致辞）等。","词源上来自拉丁语 pro-（向前、公开）+ loqui（说话），含有“公开说出”的感觉。","容易与 locution（措辞/表达方式）或 elocution（朗诵/演讲技巧）混淆：prolocution 更偏“正式发言/致辞”这件事本身。"]}
{"word":"prolocutor","summary":{"en":"A prolocutor is an official spokesperson or presiding officer who speaks for a group in a formal meeting or institution.","zh":"prolocutor 指在正式会议或机构中代表团体发言的人，或在特定语境下担任会议主持/议长式角色的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spokesperson or official representative who speaks on behalf of a group, committee, or assembly (often in formal settings).","zh":"（常用于正式场合的）发言人；（委员会、会议等的）正式代表。"},"examples":[{"en":"The committee chose Dr. Lee as its prolocutor for the press conference.","zh":"委员会选了李博士作为新闻发布会的发言人。"},{"en":"As prolocutor, she summarized the group’s decisions for the audience.","zh":"作为发言人，她向听众概括了小组的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in some British and church contexts) the presiding officer of a formal meeting or convocation, similar to a chairperson or speaker.","zh":"（尤用于英式及教会语境）会议主持人；议长式的主持官（类似主席/发言议长）。"},"examples":[{"en":"The prolocutor called the meeting to order and guided the debate.","zh":"主持官宣布会议开始并引导辩论。"},{"en":"In the convocation, the prolocutor presented the final report.","zh":"在教会会议上，主持官提交了最终报告。"}]}],"synonyms":["spokesperson","representative","delegate","chairperson","speaker"],"phonetic":"/proʊˈlɑːkjətɚ/","extraExplanation":["“prolocutor”较少见，常出现在正式机构（委员会、学术团体）或宗教机构（如英国国教的会议）中，语感偏“被指定的正式发言/主持者”。日常英语更常用 spokesperson、representative、chair (chairperson) 或 speaker（取决于具体职责）。","词源来自拉丁语前缀 pro-（“代替、代表”）+ loqui（“说话”），核心含义就是“代表他人说话”。"]}
{"word":"prolocutorship","summary":{"en":"Prolocutorship means the office or term of a prolocutor, especially a presiding speaker in certain church assemblies.","zh":"Prolocutorship 指 prolocutor（尤指特定教会会议中的议长/主持人）的职务或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, role, or term of a prolocutor (the elected presiding speaker/chair, especially in certain church or academic assemblies)","zh":"prolocutor（发言人/议长/主持人，尤指某些教会或学术议会中的当选主席）的职务、角色或任期"},"examples":[{"en":"He served one year in the prolocutorship before returning to parish work.","zh":"他担任了一年 prolocutorship（议长/主持人职务）后，回到堂区工作。"},{"en":"The election for the prolocutorship was closely watched by the clergy.","zh":"神职人员密切关注 prolocutorship（议长职务）的选举。"}]}],"synonyms":["chairmanship","speakership","presidency"],"phonetic":"/proʊˈlɑːkjətərʃɪp/","extraExplanation":["该词非常少见，主要见于英国教会体系等正式语境：如英国国教“Convocation（教士会议）”中，下议院（Lower House）的主席常称为 prolocutor，因此 prolocutorship 就是“担任该主席/发言人之职”。","词源可追溯到拉丁语 proloqui（公开说话、发言）。在现代英语里，日常更常用 chairmanship / speakership 等词，除非明确指这种特定制度下的职位。"]}
{"word":"prolocutress","summary":{"en":"Prolocutress is a rare word meaning a female presiding officer or spokesperson in a formal meeting or assembly.","zh":"Prolocutress 是个较少见的词，指在正式会议或机构中担任主持人或代表发言者的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who serves as a prolocutor—the presiding officer or spokesperson of a meeting or formal assembly (especially in certain church or academic bodies)","zh":"女议长；女发言主席：在会议或正式机构中担任主持人或代表发言者的女性（尤见于某些教会或学术机构）"},"examples":[{"en":"The committee elected a prolocutress to chair the session and present its decisions.","zh":"委员会选出一位女议长来主持会议并宣布其决定。"},{"en":"In older records, the term prolocutress appears as the female form of prolocutor.","zh":"在较早的文献记录中，prolocutress 作为 prolocutor 的女性形式出现。"}]}],"synonyms":["chair","chairperson","presiding officer","spokesperson","moderator"],"phonetic":"/proʊˈlɑkjətrəs/","extraExplanation":["“prolocutress”非常少见，带有较强的旧式/性别标记色彩；现代英语通常直接用“prolocutor”“chair”“chairperson”“presiding officer”“spokesperson”等中性词来表达。","“prolocutor”一词在英国教会语境里较常见，指某些教会会议中的主持/代表发言者；因此“prolocutress”也多出现在历史或特定体制的语境中。"]}
{"word":"prolocutrix","summary":{"en":"A rare formal word meaning a woman who presides over and speaks for an assembly.","zh":"一个较罕见的正式词，指在会议中主持并代表发言的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female prolocutor; a woman who presides over and speaks for a formal meeting or assembly (especially in some church or academic contexts)","zh":"女主席／女议长；在正式会议或议会中主持并代表发言的女性（尤用于某些教会或学术机构语境）"},"examples":[{"en":"She served as prolocutrix of the synod, guiding debate and announcing decisions.","zh":"她担任宗教会议的女议长，引导辩论并宣布决议。"},{"en":"The minutes record the prolocutrix thanking the members for their service.","zh":"会议记录写道：女主席感谢成员们的服务。"}]}],"synonyms":["presiding officer","chair","chairperson","spokeswoman","speaker"],"phonetic":"/proʊˈlɑːkjətrɪks/","extraExplanation":["该词较为罕见，来自拉丁语词根：pro-（代表、为……）+ loqui（说）。prolocutor 常见于某些宗教会议（如 synod）或传统机构中，指“代表发言的主持人”。prolocutrix 是其传统的阴性形式。","现代英语中，很多机构更倾向使用性别中立的说法，如 chair, chairperson, presiding officer, spokesperson，因此你在当代新闻或日常英语里很少见到 prolocutrix。","发音上，词尾 -trix 常见于拉丁来源的阴性名词（如 actress 的旧式对应形式），在较正式或历史语境中更可能出现。"]}
{"word":"prolog","summary":{"en":"“Prolog” usually means an opening introduction to a story (like “prologue”), and it can also mean Prolog, the logic-based programming language.","zh":"“prolog”通常指故事的序言/开场白（相当于 prologue 的一种拼写）；也可指以逻辑为基础的编程语言 Prolog。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opening section of a book, play, movie, or story that introduces background information or sets the scene (a spelling variant of “prologue”).","zh":"（prologue 的一种拼写）序言；开场白：在书、戏剧、电影或故事开头，用来交代背景、引出主题的部分。"},"examples":[{"en":"The prolog explains what happened before the main story begins.","zh":"序言解释了主故事开始之前发生了什么。"},{"en":"In the play’s prolog, the narrator warns the audience about the tragedy to come.","zh":"在这部戏的开场白里，叙述者提醒观众即将到来的悲剧。"}]},{"partOfSpeech":"n.","definition":{"en":"Prolog (capitalized): a programming language based on formal logic, often used in AI and rule-based problem solving.","zh":"Prolog（首字母大写）：一种以形式逻辑为基础的编程语言，常用于人工智能与基于规则的推理/求解。"},"examples":[{"en":"We used Prolog to write rules for a simple expert system.","zh":"我们用 Prolog 为一个简单的专家系统编写规则。"},{"en":"Prolog is good for problems where you describe facts and relationships.","zh":"Prolog 很适合那些需要描述事实与关系的问题。"}]}],"synonyms":["prologue","preface","introduction","foreword"],"phonetic":"/ˈproʊ.lɔɡ/","extraExplanation":["“prolog”在美式写法中有时作为“prologue”的简化拼写出现，尤其在出版、影视条目或分章标题里更常见；正式写作中“prologue”更普遍。","编程语言“Prolog”名称来自“PROgramming in LOGic”（逻辑编程）。它的思路更偏向“声明事实与规则，让系统推导答案”，与常见的命令式语言写法不同。"]}
{"word":"prologed","summary":{"en":"“Prologed” is a nonstandard spelling; the standard form is “prologued,” meaning “introduced with a prologue.”","zh":"“prologed”一般是非标准拼写；标准形式是“prologued”，意思是“用序言/序章引出（某作品或事件）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) past tense/past participle of “prologue”: to introduce a story, speech, or event with a prologue (an opening section).","zh":"（非标准拼写）“prologue”的过去式/过去分词：用“序言/开场”来引出故事、演讲或事件。"},"examples":[{"en":"The novel was prologued with a short scene set years earlier.","zh":"这本小说以前面一段发生在多年前的短场景作为序章来引出。"},{"en":"The director prologued the film with a voice-over explaining the history.","zh":"导演用旁白讲历史作为影片的开场序言。"}]}],"synonyms":["introduced","prefaced","opened (with)"],"phonetic":"ˈproʊlɔɡd","extraExplanation":["“prologed”通常被认为是拼写错误；标准拼写是 **prologued**（英式也常写 **prologued**）。","动词 **to prologue** 比较少见，更常用的表达是：**begin with a prologue / open with a prologue / introduce (something) with a prologue**。","名词 **prologue**（序言、序章）更常见，常见于小说、戏剧、电影与游戏的开场部分，用来交代背景或铺垫冲突。"]}
{"word":"prologi","summary":{"en":"Prologue: an opening section that introduces background or sets the scene before the main story.","zh":"Prologue：序章／序幕，在正文前交代背景、铺垫情节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introduction at the beginning of a book, play, movie, or story that gives background information or sets the scene.","zh":"（书、戏剧、电影或故事的）序章／序幕，用来交代背景或铺垫情节。"},"examples":[{"en":"The prologue explains how the two main characters first met.","zh":"序章解释了两位主角最初是如何相遇的。"},{"en":"In the film’s prologue, we see the city before the disaster.","zh":"在电影的序幕中，我们看到灾难发生前的城市。"}]},{"partOfSpeech":"n.","definition":{"en":"A short speech or section at the start of a performance, often spoken directly to the audience.","zh":"（演出开场的）简短开场白或开场段落，常直接对观众说。"},"examples":[{"en":"The actor delivered a prologue to welcome the audience.","zh":"演员用一段开场白欢迎观众。"}]}],"synonyms":["introduction","opening","preface"],"phonetic":"/ˈproʊlɔːɡ/","extraExplanation":["你输入的“prologi”在英语里不常见，最可能是想写 **prologue**（英式拼写同样是 prologue）。在戏剧研究或出版领域，有时也会看到简写 **prolog**，意思相同。","词源来自希腊语：*pro-*（在前）+ *logos*（言语／话语），所以本义就是“在正文之前的话”。","文学/戏剧中常用“prologue”来“埋伏笔”或提供世界观背景；与之相对的结尾部分常叫 **epilogue（尾声）**。"]}
{"word":"prologing","summary":{"en":"“Prologing” is usually a misspelling. For “making something last longer,” use “prolonging.”","zh":"“prologing”通常是拼写错误；表达“延长/拖长”时应写作“prolonging”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English spelling. People sometimes write this when they mean “prolonging.”","zh":"这不是标准英文拼写。人们有时会用它来表示“prolonging（延长/拖长）”。"},"examples":[{"en":"If you mean “making something last longer,” the correct spelling is “prolonging.”","zh":"如果你想表达“让某事持续更久”，正确拼写是“prolonging”。"}]},{"partOfSpeech":"v.","definition":{"en":"(prolonging) continuing something for a longer time; making it last longer (present participle of “prolong”).","zh":"（prolonging）延长（时间）；使持续更久（动词 prolong 的现在分词）。"},"examples":[{"en":"They are prolonging the meeting to discuss the budget in detail.","zh":"他们正在延长会议，以便详细讨论预算。"},{"en":"Taking breaks can help you avoid prolonging your recovery.","zh":"适当休息可以帮助你避免让康复时间拖得更久。"}]}],"synonyms":["extending","lengthening","dragging out"],"phonetic":"/prəˈlɔŋɪŋ/","extraExplanation":["“Prolog”是一个逻辑编程语言的名字，所以“Prologing”有时也会被程序员非正式地用来表示“用 Prolog 编程”。但在一般英语写作里，表示“延长”的正确词是“prolonging”。"]}
{"word":"prologise","summary":{"en":"Prologise means to write or add a prologue, or to introduce something with a preliminary explanation.","zh":"Prologise 指撰写/添加序言（开场白），也可指在进入主题前先作铺垫式说明。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to write or add a prologue (an introduction) to a book, play, speech, or other work","zh":"为书籍、戏剧、演讲或其他作品撰写或添加序言/开场白"},"examples":[{"en":"The playwright prologised the story with a short speech to explain the setting.","zh":"这位剧作家用一段简短的开场白为故事写了序言，用来解释背景。"},{"en":"In the revised edition, the author prologised the novel to give readers historical context.","zh":"在修订版中，作者为小说添加了序言，给读者提供历史背景。"}]},{"partOfSpeech":"v.","definition":{"en":"to introduce something with a preliminary explanation before the main content begins","zh":"在正式内容开始前，先用一段说明作铺垫/引入"},"examples":[{"en":"She prologised her talk by sharing a personal story before presenting the data.","zh":"她在展示数据前先讲了一个个人故事作为引入。"}]}],"synonyms":["preface","introduce","prelude","foreword (as a noun; related)","write an introduction"],"phonetic":"/ˈproʊləˌɡaɪz/","extraExplanation":["“prologise”是英式拼写，对应美式更常见的“prologize”。两者意思相同。","词根来自“prologue（序言/开场白）”。在现代英语里，这个动词比较少见；更常用的表达是“write an introduction/prologue”或“preface (a book)”。"]}
{"word":"prologised","summary":{"en":"“Prologised” means “added/wrote a prologue” or, informally, “gave a long introduction.” It’s the British spelling; American spelling is “prologized.”","zh":"“prologised”表示“加写/撰写序言（开场白）”，也可非正式指“在正题前做很长的开场铺垫”。多为英式拼写；美式为“prologized”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) Wrote or added a prologue (an introductory section) to a book, play, film, or other work.","zh":"（动词过去式/过去分词）为书、戏剧、电影等作品撰写或加上序言/开场白（prologue）。"},"examples":[{"en":"The editor prologised the new edition with a short note about the author’s life.","zh":"编辑为新版加写了一段简短的序言，介绍作者生平。"},{"en":"The playwright prologised the drama to help the audience understand the historical setting.","zh":"剧作家为该剧写了开场白，帮助观众理解历史背景。"}]},{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle, informal) Gave a long or formal introduction before getting to the main point.","zh":"（动词过去式/过去分词，非正式）在进入正题前做了很长或很正式的铺垫/开场。"},"examples":[{"en":"He prologised for ten minutes before answering the question.","zh":"他铺垫了十分钟才开始回答问题。"},{"en":"The speaker prologised with a few jokes to warm up the room.","zh":"演讲者先用几个笑话热场，作为开场铺垫。"}]}],"synonyms":["prologized","prefaced","introduced","gave an introduction"],"phonetic":"/ˈproʊləˌɡaɪzd/","extraExplanation":["“prologised”多见于英式拼写（prologise）；美式更常见拼写是“prologized”（prologize）。两者意思相同。","词根来自“prologue”（序言/开场白）。在文学与戏剧传统中，prologue常用于交代背景、主题或设定语气。","该词在现代日常英语中较少用；更常用的表达有：“added a prologue / wrote a prologue / gave a long introduction”。"]}
{"word":"prologising","summary":{"en":"Prologising means writing or adding a prologue (introductory opening) to a work.","zh":"prologising 指为作品撰写或添加序言/开场白。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “prologize/prologise”) writing or adding a prologue (an introductory section) to a book, play, speech, or other work.","zh":"（“prologize/prologise”的现在分词）为书、戏剧、演讲等撰写或添加序言/开场白（prologue）。"},"examples":[{"en":"The playwright spent the afternoon prologising to give the audience more background.","zh":"剧作家花了一下午在写开场白，好让观众了解更多背景。"},{"en":"The editor suggested prologising the memoir with a short scene from her childhood.","zh":"编辑建议在回忆录前加一段简短的童年场景作为序言。"}]}],"synonyms":["prologizing","writing a prologue","adding a prologue","introducing","prefacing"],"phonetic":"/proʊˈlɔɡaɪzɪŋ/","extraExplanation":["“prologising”是英式拼写（-ise）；美式更常见“prologizing”（-ize）。这个词在日常英语中不算常用，更常见的表达有：write a prologue / add a prologue / begin with a prologue。"]}
{"word":"prologist","summary":{"en":"A prologist is someone who writes a prologue; informally, it can also mean a person who programs in Prolog.","zh":"prologist 指写“序言/序章”的人；在非正式计算机语境中也可指使用 Prolog 语言编程的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or composes a prologue (an opening section of a book, play, speech, etc.)","zh":"序言／开场白的作者；撰写“序章/序言”的人（用于书、戏剧、演讲等的开头部分）"},"examples":[{"en":"The prologist sets the mood before the main story begins.","zh":"序言作者在正文开始前先营造氛围。"},{"en":"In older plays, a prologist might speak directly to the audience.","zh":"在较早期的戏剧里，序言作者（或序幕朗诵者）可能会直接对观众讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, informal) a person who programs in Prolog, a logic programming language","zh":"（计算机，非正式）使用 Prolog（逻辑编程语言）进行编程的人"},"examples":[{"en":"She’s a prologist who builds rule-based AI prototypes.","zh":"她是使用 Prolog 的开发者，会做基于规则的 AI 原型。"},{"en":"The team asked a prologist to help with the logic engine.","zh":"团队请了一位 Prolog 开发者来协助处理逻辑引擎。"}]}],"synonyms":["prologue writer","author of the prologue","Prolog programmer","Prolog developer"],"phonetic":"ˈproʊlədʒɪst","extraExplanation":["“prologist”在日常英语中非常少见；更常见的表达是“the writer of the prologue”或直接说“the author wrote a prologue”。","与其相近的拼写还有“prologuist”（也指写序言的人），但同样不常用。","“Prolog”（编程语言）语境下，“prologist”属于较口语、非正式的说法；更常见的是“Prolog programmer/developer”。"]}
{"word":"prologize","summary":{"en":"Prologize means to write/add a prologue, or (sometimes) to give an overly long introduction before getting to the point.","zh":"Prologize 指写/加序言；有时也指在进入正题前讲太多铺垫、开场过长。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To add a prologue to (a book, play, or other work), or to write/speak a prologue.","zh":"为（书、戏剧或其他作品）添加序言；或撰写/讲述序言。"},"examples":[{"en":"The editor asked the author to prologize the new edition with a short personal note.","zh":"编辑请作者为新版加写一段简短的个人序言。"},{"en":"Some playwrights prologize to give the audience historical background before the first scene.","zh":"有些剧作家会用序场/序言为观众在第一幕前交代历史背景。"}]},{"partOfSpeech":"v.","definition":{"en":"To introduce something at length, especially with too much preliminary talk.","zh":"冗长地铺垫或开场（常指前言过多、啰嗦）。"},"examples":[{"en":"He kept prologizing instead of answering the question directly.","zh":"他一直在啰嗦铺垫，却不直接回答问题。"}]}],"synonyms":["preface","introduce","write a prologue","add a prologue"],"phonetic":"/ˈproʊləˌɡaɪz/","extraExplanation":["“prologize”比较少见，常见表达更倾向用 “write a prologue / add a prologue”。在戏剧传统中，prologue（序场/开场白）有时由演员直接对观众讲话，用来交代背景、主题或“定调”。","在较文学或较旧的语境里，它也可带一点评价色彩：指说话者在进入正题前讲了太多“前置说明”。"]}
{"word":"prologized","summary":{"en":"“Prologized” means “added or delivered a prologue,” but it is rare in modern English.","zh":"“prologized”意为“加上（或发表）序言/开场白”，但在现代英语中很少用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To add a prologue (an introduction) to a book, play, speech, or other work; to preface with an opening section.","zh":"（罕见）为书、戏剧、演讲等添加“序言/开场白”；以序言作引言。"},"examples":[{"en":"The editor prologized the new edition with a short history of the author.","zh":"编辑在新版前加了一段简短的作者生平作为序言。"},{"en":"The playwright prologized the drama to explain the setting and main conflict.","zh":"剧作家用开场白为该剧交代背景和主要矛盾。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare) To deliver or speak in a prologue-like way; to give an introductory speech.","zh":"（罕见）用“开场白”的方式讲话；作引入性的开场发言。"},"examples":[{"en":"Before the debate began, she briefly prologized to frame the topic.","zh":"辩论开始前，她先简短地作了开场引入来界定主题。"},{"en":"He prologized about the company’s history, then moved to the main announcement.","zh":"他先用开场白谈了公司的历史，然后进入主要公告。"}]}],"synonyms":["prefaced","introduced","added a prologue","wrote a prologue"],"phonetic":"/ˈproʊləˌɡaɪzd/","extraExplanation":["“prologized”是动词“prologize”的过去式/过去分词，来源于“prologue（序言/开场白）”。在现代英语中非常少见；更常见的表达是：write/ add a prologue（写/加序言）、preface（作序）、introduce（引言）。","使用场景多与文学出版或戏剧有关：prologue在戏剧里常指开场一段台词，用来交代背景、主题或引出情节。"]}
{"word":"prologizer","summary":{"en":"A prologizer is someone who writes or delivers a prologue (an introductory section).","zh":"prologizer 指撰写或讲述序言/开场白（prologue）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes, provides, or speaks a prologue (an introduction) to a book, play, speech, or other work","zh":"为书、戏剧、演讲等撰写、提供或朗读“序言/开场白（prologue）”的人"},"examples":[{"en":"The prologizer set the scene for the play by explaining the historical background.","zh":"开场白撰写者通过解释历史背景为这出戏搭建了情境。"},{"en":"In older theater traditions, a prologizer sometimes addressed the audience directly.","zh":"在较早的戏剧传统中，讲序的人有时会直接对观众说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) something—such as a short text—that functions as a prologue or serves an introductory role","zh":"（罕见）起到序言/引言作用的事物（如一段短文字）"},"examples":[{"en":"The brief poem at the beginning acts as a prologizer for the whole collection.","zh":"开头那首短诗为整本诗集起到了“引子/序曲”的作用。"}]}],"synonyms":["prologue writer","introducer","prefacer (rare)"],"phonetic":"/ˈproʊləˌɡaɪzɚ/","extraExplanation":["“prologizer”并不常见，更常见的表达是“prologue writer”（序言作者）或在戏剧语境里说“the person who delivers the prologue”（负责开场白的人）。","prologue 常见于戏剧与小说：它通常提供背景、时间地点、人物关系或“铺垫”，帮助读者/观众更快进入故事。","注意与编程语言“Prolog（逻辑编程语言）”区分：若指与该语言相关的人，通常会说“Prolog programmer/developer”，而不是 prologizer。"]}
{"word":"prologizing","summary":{"en":"Prologizing means adding or delivering a prologue, often implying an overly long introduction that delays the main point.","zh":"prologizing 指写/说序言或做铺垫；常含“开场太长、进入重点太慢”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(gerund/present participle of prologize) Writing, speaking, or adding a prologue; introducing something with a preliminary explanation.","zh":"（prologize 的动名词/现在分词）写/说序言；加上“开场白”式的引言，用一段前言来介绍某事。"},"examples":[{"en":"The author spent a full chapter prologizing before the story finally began.","zh":"作者用了整整一章来写序言式的铺垫，故事才终于开始。"},{"en":"Stop prologizing and tell me what happened.","zh":"别再铺垫了，直接告诉我发生了什么。"}]},{"partOfSpeech":"v.","definition":{"en":"(often critical) Talking or writing at length as a preface, causing delay or making the main point slower to arrive.","zh":"（常带批评）用冗长的前言/铺垫来拖延，让重点迟迟不出现。"},"examples":[{"en":"He kept prologizing, so the meeting ran over time.","zh":"他一直在做冗长的开场铺垫，导致会议超时。"},{"en":"The essay is clear, but it does too much prologizing in the first paragraph.","zh":"文章很清楚，但第一段的铺垫太多了。"}]}],"synonyms":["prefacing","introducing","preliminaries","preambling","rambling"],"phonetic":"/ˈproʊləˌɡaɪzɪŋ/","extraExplanation":["“prologize”来自“prologue（序幕/序言）”。在文学和戏剧里，prologue 用来交代背景、主题或语气；但在日常交流中，说某人一直在 prologizing 往往暗含“太多开场白、进入正题太慢”的意思。","这个词比较少见，写作里更常用的替代说法有：“preface (something) with…（以……作为开头）”“give a long introduction（做很长的介绍）”“ramble before getting to the point（在重点前啰嗦）”。"]}
{"word":"prologlike","summary":{"en":"“Prolog-like” means similar to the Prolog programming style, especially rule-based logical inference.","zh":"“Prolog-like”指类似 Prolog 的编程风格，强调基于规则的逻辑推理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling Prolog (the logic-programming language), especially in using rules, facts, and queries to express logic and inference.","zh":"类似 Prolog（逻辑编程语言）的，尤指用“事实、规则、查询”来表达逻辑与推理的风格。"},"examples":[{"en":"The system uses a Prolog-like rule engine to infer new information from known facts.","zh":"这个系统使用类似 Prolog 的规则引擎，从已知事实中推断出新信息。"},{"en":"Their documentation is very Prolog-like: it explains the problem in terms of predicates and rules.","zh":"他们的文档很像 Prolog：用谓词和规则来解释问题。"}]}],"synonyms":["logic-programming-style","rule-based","declarative"],"phonetic":"/ˈproʊlɔɡ laɪk/","extraExplanation":["“Prolog-like”通常出现在计算机科学/程序设计语境中，用来形容一种“声明式（declarative）”的表达方式：你描述规则与关系，让系统去做推理与匹配，而不是一步步写清楚控制流程。","常见相关词：predicate（谓词）、fact（事实）、rule（规则）、query（查询）、unification（合一/统一）、backtracking（回溯）。这些都是人们说“Prolog-like”时暗示的特点。"]}
{"word":"prologos","summary":{"en":"Prologos means the prologue or opening section of a play, especially in ancient Greek drama.","zh":"Prologos 指戏剧的序言或开场部分，尤用于古希腊戏剧语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prologue; an introductory speech or section at the beginning of a play (especially in ancient Greek drama)","zh":"（尤指古希腊戏剧中的）序言；开场白；戏剧开头的引子"},"examples":[{"en":"In many Greek tragedies, the prologos gives background information before the chorus enters.","zh":"在许多希腊悲剧中，prologos 会在合唱队入场前交代背景信息。"},{"en":"The director added a short prologos to help the audience understand the story.","zh":"导演加了一段简短的 prologos，帮助观众理解剧情。"}]}],"synonyms":["prologue","prelude","introduction","opening"],"phonetic":"/proʊˈlɔːɡɔs/","extraExplanation":["“prologos”来自古希腊语 πρόλογος（pro- 表示“在前”，logos 表示“言语/话语/论述”），字面意思是“在前面的讲话”。","在古希腊戏剧结构里，prologos 通常出现在正式剧情与合唱队（chorus）登场之前，用来交代人物关系、时间地点或故事前因，因此常被译为“序幕/开场白/序言”。","英语里更常用的对应词是 “prologue”。“prologos”多见于古典学、戏剧研究或讨论希腊悲剧的语境。"]}
{"word":"prologs","summary":{"en":"A prolog/prologue is an opening introduction that sets up a story, play, or film.","zh":"prolog/prologue 指作品开头的“序言/开场引子”，用于交代背景并铺垫正文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled “prologue”) an introduction to a book, play, movie, or story that gives background or sets the scene before the main part begins","zh":"（也常拼作 prologue）序言；开场；故事/戏剧/电影的引子，用来交代背景或铺垫情节"},"examples":[{"en":"The novel opens with a short prolog that explains the family’s history.","zh":"这部小说以一段简短的序言开篇，交代了家族的历史。"},{"en":"In the play’s prolog, a narrator speaks directly to the audience.","zh":"在这出戏的开场白里，一位叙述者直接对观众讲话。"}]},{"partOfSpeech":"v.","definition":{"en":"to write or provide an introduction (a prolog/prologue) to a story or performance","zh":"为作品写序言/开场白；用序言引出正文"},"examples":[{"en":"The director prologged the film with a brief historical note.","zh":"导演用一段简短的历史说明作为电影的开场引子。"}]}],"synonyms":["prologue","preface","introduction","foreword","opening"],"phonetic":"/ˈproʊlɑːɡ/","extraExplanation":["“prolog(s)”常见于非正式拼写或受其他语言（如斯拉夫语系）影响的拼法；现代英语更常用的标准拼写是“prologue”。两者读音与意思相同。","在戏剧传统中（尤其莎士比亚时期），prologue 常由演员或“合唱队/叙述者”直接对观众讲话，用来交代背景、设定主题或提出道德/情感基调。"]}
{"word":"prologue","summary":{"en":"A prologue is an opening part of a story (or a figurative “beginning”) that provides background and sets up what follows.","zh":"prologue指故事的开场序章（也可引申为“前奏/开端”），用于交代背景并为后续情节铺垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opening section of a book, play, movie, or story that gives background information and sets the scene for what comes later.","zh":"（书、戏剧、电影或故事的）序章/序言；开场部分，用来交代背景并为后文铺垫。"},"examples":[{"en":"The novel’s prologue introduces the main conflict through a scene from the past.","zh":"这本小说的序章用一段过去的情节引出主要冲突。"},{"en":"In the play, the prologue explains where the characters are and why it matters.","zh":"在这部戏剧中，序章交代人物身处何地以及这为什么重要。"},{"en":"Some readers skip the prologue, but it often contains important clues.","zh":"有些读者会跳过序章，但它常常包含重要线索。"}]},{"partOfSpeech":"n.","definition":{"en":"A preliminary event or action that leads to something else; a beginning that foreshadows what will happen next.","zh":"（引向某事的）前奏/开端；预示后续发展的铺垫性事件。"},"examples":[{"en":"Their argument was a prologue to a long period of silence.","zh":"他们的争吵成了随后漫长沉默的前奏。"},{"en":"The small protest was a prologue to a larger movement.","zh":"那场小规模抗议是更大运动的前奏。"}]}],"synonyms":["preface","introduction","opening","foreword","prelude"],"phonetic":"/ˈproʊ.lɔɡ/","extraExplanation":["“Prologue”常见于文学与戏剧传统，尤其在莎士比亚等戏剧中，序章可能由“Chorus（合唱队/旁白）”直接向观众说明背景或主题。","对比：prologue通常发生在故事“开始之前”；而“introduction（前言/导言）”更像作者对作品的说明；“preface（序/前言）”常谈写作动机与致谢；“epilogue（尾声）”则发生在结尾之后。"]}
{"word":"prologued","summary":{"en":"“Prologued” means “added or wrote a prologue (intro) for something.”","zh":"“prologued”表示“为作品/文本加上或写了序言（开场介绍）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) Added or wrote a prologue (an introduction) for a book, play, film, speech, etc.","zh":"（过去式/过去分词）为书、戏剧、电影、演讲等添加或撰写了“序言/开场白”"},"examples":[{"en":"The new edition was prologued by a short note from the author.","zh":"新版加上了作者的一段简短序言。"},{"en":"The play was prologued to give the audience historical background.","zh":"这部戏在开场前加了序言，用来向观众交代历史背景。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describes something that has been introduced by a prologue (less common usage).","zh":"（较少用）形容某作品“有序言开场的/以序言引入的”"},"examples":[{"en":"The prologued story begins with a warning from the narrator.","zh":"这个有序言的故事以叙述者的提醒开头。"}]}],"synonyms":["introduced","prefaced","framed (contextually)","set up"],"phonetic":"/ˈproʊlɔːɡd/","extraExplanation":["“prologue”在美式英语中常见两种拼写：prologue（更常见）与prolog（较少见，常用于某些出版或戏剧写法）。动词“to prologue/prolog”意思是“写序/加序”，过去式可以写作“prologued/prologed”。","文学与戏剧里，prologue（序幕/序言）常用来交代背景、设定主题或制造悬念；例如莎士比亚《罗密欧与朱丽叶》就有著名的Prologue（由合唱队/旁白引出）。"]}
{"word":"prologuelike","summary":{"en":"“Prologuelike” means prologue-like: an introductory part that sets context before the main action.","zh":"“prologuelike”意为“像序章/序言的”，指用于开场铺垫、交代背景、为主内容做准备的部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a prologue; serving as an introductory section that sets up what follows (often in story structure or game design).","zh":"像“序章/序言”的；起到开场铺垫作用、为后文做准备的（常用于叙事结构或游戏设计）。"},"examples":[{"en":"The first chapter feels prologuelike, introducing the world without advancing the main plot much.","zh":"第一章很像序章，主要在介绍世界观，并没有太推动主线剧情。"},{"en":"The tutorial area is intentionally prologuelike to teach you the rules before the real challenge begins.","zh":"新手教学区域刻意做得像序章一样，让你在真正挑战开始前先学会规则。"}]}],"synonyms":["introductory","prefatory","prologue-like","setup"],"phonetic":"/ˈproʊlɔɡˌlaɪk/","extraExplanation":["“prologuelike”不是非常常见的标准词，更常见的写法是“prologue-like”。在游戏或写作讨论中，有时会借用“roguelike”这种构词感觉，把“X + like”连写成一个新词，表达“具有X那样的风格/功能”。","“prologue”在美式英语更常拼作“prologue”（英式也常见“prologue”），含义指作品开头用于交代背景、氛围或前因的“序章/序言”。因此“prologuelike”通常强调“铺垫感强、信息交代多、像开场引子”。"]}
{"word":"prologuer","summary":{"en":"A prologuer is someone who writes or speaks a prologue; the word is rare in modern English.","zh":"prologuer 指写或朗读“序言/开场白”的人；这个词在现代英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or delivers a prologue (an opening speech or introduction, especially to a play or book)","zh":"写序言或在戏剧/作品开头发表“开场白（序言）”的人"},"examples":[{"en":"In early theater, a prologuer might step forward to greet the audience and explain the story’s background.","zh":"在早期戏剧中，序言朗读者可能会走到台前向观众致意，并交代故事背景。"},{"en":"The director asked a prologuer to introduce the theme before the first scene began.","zh":"导演请一位序言朗读者在第一幕开始前介绍主题。"}]}],"synonyms":["prologist","prologuist","introducer (context-dependent)"],"phonetic":"/ˈproʊlɔːɡər/","extraExplanation":["“prologuer”在现代英语里非常少见；更常用的词是“prologue”（序言/开场白）以及“prologist / prologuist”（写序言的人）或直接说“the person who gives the prologue”。","词根来自“prologue”（源自希腊语，意为“在话语之前”），因此它多和戏剧、文学作品的“开头引言”相关。"]}
{"word":"prologues","summary":{"en":"“Prologues” are opening sections or introductory speeches that come before the main story or performance.","zh":"“prologues”指在正篇/正戏之前的序章或开场引言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of prologue) An opening section that introduces a story, play, or book—often giving background or setting the mood.","zh":"（prologue 的复数）作品的“序章/开场”，用于引出故事、戏剧或书籍的背景，营造氛围。"},"examples":[{"en":"The novel has two prologues that explain the family’s history before the main story begins.","zh":"这部小说有两个序章，在正篇开始前交代了家族历史。"},{"en":"In some plays, the prologues speak directly to the audience.","zh":"在一些戏剧中，序章会直接对观众说话。"}]},{"partOfSpeech":"n.","definition":{"en":"Short introductory speeches or texts that come before a performance or event.","zh":"演出或活动开始前的简短开场白/引言。"},"examples":[{"en":"The host’s prologues helped the audience understand each dance piece.","zh":"主持人的开场引言帮助观众理解每支舞的内容。"},{"en":"The festival used prologues to honor local traditions before each concert.","zh":"音乐节在每场演出前用开场引言来致敬当地传统。"}]}],"synonyms":["introductions","openings","forewords (similar, but not the same)","prefaces (related)"],"phonetic":"/ˈproʊlɔɡ/","extraExplanation":["“prologue”常见于文学与戏剧结构中，和“preface（前言）”不同：prologue通常是故事/剧情的一部分（像“第0章”），而preface更像作者写给读者的说明。","经典戏剧中有时会由“Chorus（合唱队/叙述者）”或旁白来讲 prologue，例如莎士比亚《亨利五世》以“Chorus”开场。"]}
{"word":"prologuing","summary":{"en":"Prologuing means introducing a work or speech with a prologue—an opening that sets the scene before the main content.","zh":"prologuing 指“写/加入序言或开场白”，在正文/主题前先交代背景、铺垫内容。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to write, deliver, or introduce something as a prologue (an opening section that sets context before the main work).","zh":"为作品写序/开场白；用序言来引出正文（在正文前交代背景或铺垫）。"},"examples":[{"en":"The author spent weeks prologuing the novel to establish the world’s history.","zh":"作者花了好几周为小说写序言，以建立这个世界的历史背景。"},{"en":"She is prologuing her talk with a short story about how the project began.","zh":"她用一个关于项目如何开始的小故事作为开场，引出她的演讲。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) speaking at length as an introduction before getting to the main point.","zh":"（较少见）在进入主题前讲很长的铺垫/开场话。"},"examples":[{"en":"He kept prologuing instead of answering the question directly.","zh":"他一直在铺垫，却没有直接回答问题。"}]}],"synonyms":["introducing","prefacing","setting the scene","opening","framing"],"phonetic":"/ˈproʊˌlɔɡɪŋ/","extraExplanation":["“prologuing”来自动词“to prologue”，意思是“写/加序言”。更常见的表达是“writing a prologue”或“adding a prologue”。在日常口语里，如果想表达“开场铺垫太久”，更自然的说法常用“ramble at the beginning”“give a long intro”。","拼写提示：美式英语里更常见的现在分词写法是“prologuing”，而英式有时也会看到“prologuing/prologuing”的变体；另外名词“prologue（序言/开场）”在英式拼写里常见为“prologue”，而“prolog”多见于美式或特定出版用法。"]}
{"word":"prologuise","summary":{"en":"“Prologuise” isn’t a standard word; you probably mean “prologue,” an opening introduction that sets context for a story.","zh":"“prologuise”不是标准用词；你可能想写“prologue”，指故事开头用来交代背景、铺垫情节的序言/引子。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “prologue.”","zh":"不是标准英语单词；多半是把“prologue（序言/开场）”拼错了。"},"examples":[{"en":"Did you mean “prologue”? This spelling (“prologuise”) isn’t used in English.","zh":"你是不是想写“prologue”？“prologuise”这种拼法在英语里不使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A short introduction at the beginning of a book, play, movie, or story that gives background or sets the scene.","zh":"（书/戏剧/电影/故事的）序言、开场介绍；用来交代背景或铺垫情节。"},"examples":[{"en":"The novel’s prologue explains what happened years before the main story.","zh":"这本小说的序言交代了主线故事发生前多年的事情。"},{"en":"In the prologue, the narrator hints at a secret that will matter later.","zh":"在序言里，叙述者暗示了一个之后很重要的秘密。"}]}],"synonyms":["preface","introduction","opening","foreword"],"phonetic":"ˈproʊlɔɡ","extraExplanation":["“prologue”常见于文学与戏剧：放在第一章/第一幕之前，用来“铺垫气氛、交代背景、埋伏笔”。它不同于“Chapter 1”。","容易混淆的词：\n- prolog：在美式英语里有时是“prologue”的简写；另外它也是编程语言 Prolog 的名称。\n- epilogue：结尾的“后记/尾声”，与 prologue 相对。","“prologue”来自希腊语词根，含义接近“在话语之前（before speech）”，所以有“开场白/引子”的感觉。"]}
{"word":"prologuised","summary":{"en":"“Prologuised” is a rare British form meaning “provided with a prologue,” or “to add a prologue to a work.”","zh":"“prologuised”是较少见的英式形式，意思是“加了序言/序幕的”，或“给作品加序言/序幕”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE, rare) Having been given a prologue; introduced with a prologue.","zh":"（英式英语，较少见）已加上序言/开场白的；以序言引入的。"},"examples":[{"en":"The prologuised edition includes a short note explaining why the novel was written.","zh":"这个加了序言的版本包含一段短说明，解释这部小说为何写成。"},{"en":"In a prologuised play, the audience learns key background information before Act One.","zh":"在带有序幕的戏剧中，观众会在第一幕前了解关键背景信息。"}]},{"partOfSpeech":"v.","definition":{"en":"(BrE, rare) Past tense/past participle of prologuise: to add or write a prologue for (a book, play, etc.).","zh":"（英式英语，较少见）prologuise 的过去式/过去分词：为（书、戏剧等）添加或撰写序言/序幕。"},"examples":[{"en":"The publisher prologuised the reprint to give modern readers more context.","zh":"出版社为再版添加了序言，帮助现代读者理解背景。"},{"en":"She prologuised the story with a brief memory from her childhood.","zh":"她用一段简短的童年回忆为故事写了开场白。"}]}],"synonyms":["prologized","prologued","introduced","prefaced"],"phonetic":"proʊˈlɔɡaɪzd","extraExplanation":["“prologuised”很可能是英式拼写，对应更常见的美式/通用写法：**prologized**；在出版或戏剧语境里也常见 **prologued**（更直接表示“加了序言/序幕”）。","词根来自 **prologue**（序言/序幕）。在日常英语中，这个词非常少用；更自然的表达通常是：**with a prologue**（带序言的）、**introduced by a prologue**（由序言引入）、**an edition with a new prologue**（有新序言的版本）。"]}
{"word":"prologuiser","summary":{"en":"“Prologuiser” is not standard English; it likely refers to a “prologue” or someone who writes one.","zh":"“prologuiser”不是标准英语；多半指“prologue（序言）”或“写序言的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or invented form. In most contexts, people probably mean “prologuist” (a person who writes/delivers a prologue) or “prologue” (the introductory section of a book, play, film, etc.).","zh":"这不是标准英语单词；更可能是拼写错误或自造词。在多数语境中，人们可能想表达“prologuist”（写/讲序言的人）或“prologue”（书、戏剧、电影等的序言/开场）。"},"examples":[{"en":"I couldn’t find “prologuiser” in a dictionary—did you mean “prologue” or “prologuist”?","zh":"我在词典里找不到“prologuiser”——你是不是想说“prologue”或“prologuist”？"},{"en":"The author wrote a short prologue to set the mood for the story.","zh":"作者写了一段简短的序言来为故事定下氛围。"}]}],"synonyms":["prologue","prologuist","prologue writer","introduction","preface"],"phonetic":"/ˈproʊlɔɡ juːˌzaɪzɚ/","extraExplanation":["从构词上看，你写的“prologuiser”看起来像把 prologue（序言）+ “-er”（做某事的人）拼在一起的“自造职业名词”。但英语里更常见的表达是：\n- prologuist：写/讲 prologue 的人（较少见，但能被理解）\n- prologue writer：更自然、更常用\n- prologuize：极少见，表示“写/加序言”（更常用说法是 write a prologue / add a prologue）\n\n如果你告诉我它出现的句子或你想表达的意思（“写序言的人/加序言/序言部分”），我可以帮你改成最地道的英文。"]}
{"word":"prologuising","summary":{"en":"Prologuising means writing or adding a prologue (an introductory opening), or giving a prologue-like introduction.","zh":"Prologuising 指撰写/加入序言（开场部分），或以“开场白”方式在正文前做引入。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"writing or adding a prologue (an opening section) to a book, play, film, or speech","zh":"撰写或加入“序言/开场白”（prologue），作为书、戏剧、电影或演讲的开头部分"},"examples":[{"en":"She spent the morning prologuising the novel, explaining how the story began.","zh":"她花了一上午为小说写序言，解释故事是如何开始的。"},{"en":"The director kept prologuising the film with a voice-over introduction.","zh":"导演不断用旁白开场来为电影加“序章”。"}]},{"partOfSpeech":"vi.","definition":{"en":"speaking or acting as a prologue (giving an introductory message before the main event)","zh":"像“开场白/序章”那样进行引入：在主要内容之前先做介绍或铺垫"},"examples":[{"en":"Before answering, he began prologuising about the history of the project.","zh":"在回答之前，他先像“开场”一样讲起了项目的历史。"}]}],"synonyms":["prologizing","writing a prologue","adding a prologue","introducing","prefacing"],"phonetic":"/proʊˈlɔɡaɪzɪŋ/","extraExplanation":["“prologuising”非常少见，常见形式多为美式拼写 prologizing，或更常用的表达：writing a prologue / adding a prologue。","词根来自 prologue（序言、开场），用于文学、戏剧和影视语境中较多；日常对话里通常不会用这个动词形式。"]}
{"word":"prologuist","summary":{"en":"A prologuist is someone who writes or speaks a prologue, especially for a play.","zh":"prologuist 指为戏剧等写或朗诵“序言/开场白”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes, delivers, or specializes in prologues (opening speeches or introductory sections), especially in plays or older literary works.","zh":"序言作者；开场白（序幕）撰写者/朗诵者（尤指戏剧或较早期文学作品中的开场介绍）。"},"examples":[{"en":"In Restoration theatre, the prologuist often spoke directly to the audience before the play began.","zh":"在复辟时期的英国戏剧中，序言朗诵者常在开演前直接对观众讲话。"},{"en":"The prologuist crafted a witty prologue to set the mood for the comedy.","zh":"这位序言作者写了一段机智的开场白，为喜剧定下基调。"}]}],"synonyms":["prologist","prologue writer","introducer"],"phonetic":"/ˈproʊləɡɪst/","extraExplanation":["“prologuist”比较少见；更常见的拼写是“prologist”。两者含义相同，来自“prologue（序言/开场白）”。","在英语戏剧传统里，prologue常用于：向观众交代背景、请求宽容（比如希望观众不要太苛刻）、或用幽默/讽刺引出主题。莎士比亚《亨利五世》里就有著名的“Chorus”在开头作序幕式的引导。"]}
{"word":"prologuize","summary":{"en":"Prologuize means to add or deliver a prologue—an opening introduction before the main work or message.","zh":"prologuize 指“加上或发表序言/序幕”，即在正文或主题开始前的开场引子。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To add a prologue to a book, play, speech, or other work; to preface something with an introductory prologue.","zh":"为（书、戏剧、演讲等）加上序言/开场白；用序幕作为引子。"},"examples":[{"en":"The editor decided to prologuize the new edition with a short note about the author’s life.","zh":"编辑决定在新版前加上一段简短的序言，介绍作者生平。"},{"en":"The playwright prologuized the tragedy to prepare the audience for its historical setting.","zh":"剧作家用序幕为这出悲剧铺垫，让观众先了解历史背景。"}]},{"partOfSpeech":"vi.","definition":{"en":"To speak or write a prologue; to deliver an opening introduction before the main content.","zh":"（在正文前）作序/致开场词；发表引子式的开头。"},"examples":[{"en":"Before the lecture began, she prologuized with a quick story from her childhood.","zh":"讲座开始前，她用一个童年小故事作开场。"},{"en":"He tends to prologuize, so the meeting often starts late.","zh":"他很爱先讲一段铺垫，所以会议常常开始得比较晚。"}]}],"synonyms":["prologize","preface","introduce","foreword (as a verb, informal)","prelude"],"phonetic":"ˈproʊləˌɡaɪz","extraExplanation":["“prologuize”比较少见，更常见的拼写是“prologize”（美式）或“prologue”（作名词/动词时）。在现代英语里，人们往往直接说“write a prologue / add a prologue / preface with…”来表达同样意思。","词源来自“prologue（序言、序幕）+ -ize（使……化/进行……动作）”。常用于文学、戏剧或带点幽默的语境，表示“在进入主题前先来一段开场铺垫”。"]}
{"word":"prologuized","summary":{"en":"Prologuized means “introduced with or supplied with a prologue,” and can also mean “began with a long, formal introduction.”","zh":"prologuized 指“加上/用序言（开场白）引入”，也可引申为“用一段冗长正式的铺垫开头”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle) to add a prologue to a book, play, speech, or other work; to introduce something with a prologue.","zh":"（过去式/过去分词）为书、戏剧、演讲等加上“序言/开场白”；用序言来引入内容。"},"examples":[{"en":"The editor prologuized the new edition with a short note about the author’s life.","zh":"编辑为新版加了一段简短序言，介绍作者生平。"},{"en":"The playwright prologuized the drama to explain the historical background.","zh":"剧作家在戏前加了开场白来解释历史背景。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, less common) to begin something with a long or formal introduction.","zh":"（引申义，较少见）用冗长或正式的铺垫来开头；先讲一大段引子。"},"examples":[{"en":"He prologuized his apology with a long story about what happened that day.","zh":"他先讲了一长段当天的经过，才开始道歉。"}]}],"synonyms":["prefaced","introduced","front-loaded","foreworded"],"phonetic":"/proʊˈlɑːɡjaɪzd/","extraExplanation":["“prologuized”并不常见，多见于学术写作或玩味性的表达。更常用的说法是：added a prologue / wrote a prologue / prefaced (the work) with a prologue。","拼写上既可见 prologuize（更接近英式 prologue），也有人写 prologize（偏美式、与 prolog 同形）。二者意义相同。"]}
{"word":"prologuizer","summary":{"en":"A (rare, often humorous) person who writes or adds prologues.","zh":"（少见、常带玩笑）写或爱加序言/引子的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare / humorous) A person who writes, adds, or tends to include a prologue (an introductory section) in a book, story, speech, or other work.\nExamples:\n• EN: The editor joked that he was a real prologuizer—every chapter started with an introduction.  ZH: 编辑开玩笑说他真是个“序言控”——每一章都先来一段引子。\n• EN: As a prologuizer, she uses the opening to set the mood before the plot begins.  ZH: 作为一个常写序言的人，她会用开头先营造氛围，再进入情节。","zh":"（少见/带幽默）指撰写、添加，或特别喜欢在作品前加“序言/引子”（prologue）的人。\n例句：\n• EN: The editor joked that he was a real prologuizer—every chapter started with an introduction.  ZH: 编辑开玩笑说他真是个“序言控”——每一章都先来一段引子。\n• EN: As a prologuizer, she uses the opening to set the mood before the plot begins.  ZH: 作为一个常写序言的人，她会用开头先营造氛围，再进入情节。"},"examples":[{"en":"The editor joked that he was a real prologuizer—every chapter started with an introduction.","zh":"编辑开玩笑说他真是个“序言控”——每一章都先来一段引子。"},{"en":"As a prologuizer, she uses the opening to set the mood before the plot begins.","zh":"作为一个常写序言的人，她会用开头先营造氛围，再进入情节。"}]}],"synonyms":["prologue writer","author who adds prologues","intro writer"],"phonetic":"/proʊˈlɔɡˌaɪzɚ/","extraExplanation":["这个词非常不常见，多半是把 prologue（序言/开场白）和表示“做……的人/使……”的后缀 -izer 组合出来的“自造词/幽默词”。日常英语里更常说：someone who writes a prologue / a writer who adds a prologue / an author known for long prologues。","如果你是在某本书、评论区或特定圈子里看到它，很可能是戏称某位作者“太爱写序言”。"]}
{"word":"prologuizing","summary":{"en":"“Prologuizing” (usually “prologizing”) means adding or speaking a prologue—an introductory opening before the main content.","zh":"“prologuizing”（通常写作“prologizing”）指加上或说出“序言/开场白”，在正文/重点内容之前作引入。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/rare) Writing, adding, or speaking a prologue; introducing something with a prologue-like opening.","zh":"（非标准/少见）写序言、加上序言，或用类似“开场白/序言”的方式来引入内容。"},"examples":[{"en":"The director kept prologuizing the story with long explanations before the first scene.","zh":"导演在第一幕开始前一直用很长的解释来“加序言式”地介绍故事。"},{"en":"Stop prologuizing and get to the main point.","zh":"别再铺垫开场白了，直接说重点。"}]}],"synonyms":["prologizing","introducing","prefacing","setting the scene"],"phonetic":"/ˈproʊlɔˌɡaɪzɪŋ/","extraExplanation":["“prologuizing”多半是拼写变体或临时造词，更常见的形式是 **prologizing**（美式拼写）或 **prologuing**（源自 prologue 的另一种动词构形，较少见）。","来自 **prologue**（序言/开场白）。在写作或戏剧语境里，prologue 是正文/正片之前的引入部分；口语里也可带一点轻微的调侃：说话“铺垫太久”。"]}
{"word":"prologulogi","summary":{"en":"A prologue is an opening section that introduces a story or serves as a “lead-in” to something larger.","zh":"prologue 指作品的序言/开场，也可指某件大事的“前奏/序幕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An introduction or opening section of a book, play, movie, or other work that gives background information or sets the scene.","zh":"（书、戏剧、电影等的）序言；开场部分，用来交代背景或铺垫情节。"},"examples":[{"en":"The prologue explains what happened before the story begins.","zh":"序言解释了故事开始之前发生了什么。"},{"en":"In the play’s prologue, a narrator warns the audience about the tragedy ahead.","zh":"在这出戏的序幕中，旁白提醒观众接下来会有悲剧发生。"}]},{"partOfSpeech":"n.","definition":{"en":"An opening event or period that leads into a larger, more important event (often used in news or history).","zh":"（重大事件之前的）前奏；序幕（常用于新闻或历史语境）。"},"examples":[{"en":"Small protests were the prologue to a larger political movement.","zh":"小规模抗议成了更大政治运动的前奏。"},{"en":"The first chapter felt like a prologue to the real conflict.","zh":"第一章像是主要冲突的序幕。"}]}],"synonyms":["introduction","preface","opening","lead-in","preamble"],"phonetic":"/ˈproʊ.lɔːɡ/","extraExplanation":["你输入的“prologulogi”看起来像是拼写混合或误打。英语里最接近、最常用的词是 **prologue**（序言/序幕），而 **prolog** 常见于计算机领域（Prolog 编程语言）或作为 prologue 的简写。","文学/戏剧里，prologue 常用于“交代背景、提出主题、制造悬念”。莎士比亚《罗密欧与朱丽叶》就有著名的 Prologue，用来提前概括故事走向。"]}
{"word":"prologus","summary":{"en":"Prologus is the Latin form of “prologue,” meaning an introductory section at the beginning of a work.","zh":"Prologus 是“prologue（序言/开场白）”的拉丁语形式，指作品开头的引言部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prologue; an introductory section at the beginning of a book, play, speech, or other work (Latin form).","zh":"序言；开场白；作品开头的引言部分（拉丁语形式）。"},"examples":[{"en":"The manuscript begins with a short prologus explaining why the author wrote the text.","zh":"这份手稿以一段简短的 prologus（序言）开头，解释作者为何写作。"},{"en":"In medieval copies, “Prologus” often appears as a heading before the main chapters.","zh":"在中世纪的抄本中，“Prologus”常作为标题出现在正文章节之前。"}]}],"synonyms":["prologue","preface","introduction","foreword"],"phonetic":"/ˈproʊləɡəs/","extraExplanation":["“Prologus”是拉丁语（常见于中世纪与学术语境）的写法，对应现代英语的 prologue。你可能会在古典作品、教会文献（例如武加大译本相关的序言标题）或学术版古籍中看到它作为章节标题使用。","在戏剧传统中，“prologue / prologus”不仅是“说明背景”，也常用来直接与观众对话、设定主题或语气；莎士比亚戏剧里就有著名的“Prologue”开场（学术讨论或拉丁化标题中有时也会写作 Prologus）。"]}
{"word":"prolong","summary":{"en":"Prolong means to make something last longer than it normally would, often by extending time or delaying an ending.","zh":"Prolong 指“延长、拖长”，让某事比通常持续更久，常用于时间、过程或结束被推迟的情况。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something last longer; to extend the time or duration of something.","zh":"延长（某事）的时间；使持续更久。"},"examples":[{"en":"The heavy rain prolonged the game, so we had to wait for hours.","zh":"大雨延长了比赛时间，所以我们不得不等了好几个小时。"},{"en":"Try not to prolong the meeting—everyone is tired.","zh":"尽量别把会议拖得太长——大家都累了。"}]},{"partOfSpeech":"v.","definition":{"en":"To continue for a longer time than usual; to be extended (often used in passive form).","zh":"（通常用于被动）持续更久；被延长。"},"examples":[{"en":"His recovery was prolonged by stress and lack of sleep.","zh":"压力和睡眠不足使他的康复期被延长了。"}]}],"synonyms":["extend","lengthen","continue","protract","draw out"],"phonetic":"/prəˈlɔŋ/","extraExplanation":["“prolong”常带有“本来可以更短，但被人为或因外部原因拉长”的语感，语气比“extend”更像“拖长”。例如：prolong a discussion（把讨论拖长）、prolong suffering（延长痛苦）。","常见搭配：prolong the life of…（延长……的寿命/使用年限）、prolonged period（长期/延长的一段时间）、prolonged silence（长时间沉默）。","词源提示：来自拉丁语 pro-（向前）+ longus（长），字面含义是“把长度往前推”。"]}
{"word":"prolongable","summary":{"en":"“Prolongable” means something can be extended to last longer (often used in formal contexts like contracts or visas).","zh":"“prolongable”指某事物可以被延长、延期（多用于合同、签证等正式语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be extended or made to last longer, especially in time or duration.","zh":"（尤指时间或持续性）可延长的；可延续的。"},"examples":[{"en":"The contract is prolongable by mutual agreement.","zh":"合同可在双方同意的情况下延长。"},{"en":"The visa is prolongable for another six months.","zh":"签证可再延长六个月。"}]}],"synonyms":["extendable","renewable","continuable"],"phonetic":"/proʊˈlɔŋɡəbəl/","extraExplanation":["“prolongable”较偏正式，常见于法律、行政、合同、签证、租约等语境。日常口语里更常说“can be extended / renewable”。","词形：prolong（延长）+ -able（可……的）。相关常见搭配：prolongable contract/lease/visa/permit; not prolongable（不可延期）。"]}
{"word":"prolongableness","summary":{"en":"“Prolongableness” means the quality of being able to be made longer in time; it’s a very rare word.","zh":"“prolongableness”指“可被延长的性质/可延长性”，但这个词非常少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be prolonged (made to last longer).","zh":"可延长性；能够被延长（让时间更久）的性质。"},"examples":[{"en":"The doctor discussed the prolongableness of the treatment, which might continue for several months.","zh":"医生讨论了治疗的可延长性，可能会持续好几个月。"},{"en":"Because of unexpected delays, the project’s schedule gained a kind of prolongableness.","zh":"由于意外耽搁，项目进度表呈现出某种“可被拉长”的特性。"}]}],"synonyms":["prolongability","extendability","duration","length","continuance"],"phonetic":"/prəˈlɔŋɡəbəlnəs/","extraExplanation":["“prolongableness”非常少见、偏书面且略显生硬。日常英文里更常用：prolongability（可延长性）、extendability（可延展性/可扩展性）、the ability to prolong（延长的能力），或直接用 duration（持续时间）、length（时长）。","构词：prolong（延长）→ prolongable（可延长的）→ prolongableness（可延长的性质）。这种“-ness”名词化在理论上成立，但实际使用频率很低。"]}
{"word":"prolongably","summary":{"en":"“Prolongably” means “in a way that can be prolonged/extended,” but it is very uncommon in modern English.","zh":"“prolongably”表示“以可延长/可持续的方式”，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be prolonged or extended; so that it may last longer.","zh":"以可被延长（延续）的方式；使其可能持续更久。"},"examples":[{"en":"The medication should not be used prolongably without a doctor’s advice.","zh":"未经医生建议，不应长期（以可延长的方式）使用这种药物。"},{"en":"The conflict was handled poorly and was prolongably stretched out by delays.","zh":"这场冲突处理不当，又因拖延而被一再拉长、长期化。"}]}],"synonyms":["for a long time","at length","in a prolonged way","extendedly (rare)"],"phonetic":"/proʊˈlɔŋɡəbli/","extraExplanation":["“prolongably”非常罕见，很多词典不收录，写作中更常用更自然的表达是：1) “for a long time”（持续很久），2) “in a prolonged way”（以拖长的方式），或把句子改写为使用形容词/动词：prolonged（被拉长的）/ prolong（延长）。例如：\"The delays prolonged the conflict.\"（拖延延长了冲突）。"]}
{"word":"prolongate","summary":{"en":"Prolongate means to make something last longer (formal); it can also describe something that lasts longer than usual.","zh":"Prolongate（较正式）表示“使持续更久/延长”，也可作形容词指“持续较久的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something last longer; to extend the duration of something","zh":"使（某事）持续更久；延长（时间/期限）"},"examples":[{"en":"They tried to prolongate the meeting, but most people wanted to leave.","zh":"他们试图延长会议时间，但大多数人想离开。"},{"en":"Doctors aim to prolongate life while improving its quality.","zh":"医生的目标是在提高生活质量的同时延长寿命。"}]},{"partOfSpeech":"adj.","definition":{"en":"lasting longer than usual; prolonged","zh":"（持续）比通常更久的；延长的"},"examples":[{"en":"After a prolongate drought, the river ran low.","zh":"经历了长期干旱后，河流水位变低了。"}]}],"synonyms":["prolong","extend","lengthen","protract"],"phonetic":"/proʊˈlɔŋˌɡeɪt/","extraExplanation":["“prolongate”在现代英语里相对少见、偏正式；日常更常用的是动词“prolong”或形容词“prolonged”（如：a prolonged delay 长时间的延误）。在写作或考试中，用“prolong”通常更自然。","常见搭配：prolong/prolongate + the meeting / negotiations / conflict / life / agony（延长会议/谈判/冲突/寿命/痛苦）。注意语气：用在“conflict, agony”时常带负面含义。","词源提示：来自拉丁语pro-（向前）+ longus（长），核心概念是“让时间更长”。相关词：lengthen（更口语）、extend（更通用、也可指范围/期限）。"]}
{"word":"prolongated","summary":{"en":"“Prolongated” means extended or made to last longer, but it is uncommon; “prolonged” is usually preferred.","zh":"“prolongated”表示“延长的/被延长的”，但不常用；通常更推荐用“prolonged”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Less common) lasting longer than usual; extended in time.","zh":"（较不常用）持续时间比通常更长的；延长的。"},"examples":[{"en":"Because of the storm, the meeting became a prolongated discussion about safety.","zh":"由于暴风雨，会议变成了一场关于安全的延长讨论。"},{"en":"He felt tired after a prolongated wait at the airport.","zh":"在机场经历了长时间等待后，他感到很疲惫。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past form) to make something last longer; to extend.","zh":"（过去式/过去分词）使某事持续更久；延长。"},"examples":[{"en":"They prolongated the deadline to give everyone more time.","zh":"他们延长了截止日期，让每个人都有更多时间。"}]}],"synonyms":["prolonged","extended","lengthened","drawn-out"],"phonetic":"/proʊˈlɔŋɡeɪtɪd/","extraExplanation":["“prolongated”在现代英语里不太常见。更自然、更常用的说法通常是 **prolonged**（形容词：a prolonged illness / a prolonged silence）。","词源上与拉丁语 *prolongare*（向前拉长、延长）有关；在正式或学术语境中也更常见到动词 **prolong** 和形容词 **prolonged**。"]}
{"word":"prolongating","summary":{"en":"“Prolongating” means extending something so it lasts longer; it’s a less common form, and “prolonging” is more usual.","zh":"“prolongating”表示“延长、使持续更久”；但它较少用，更常见的说法是“prolonging”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) making something last longer; extending the duration of something.","zh":"（现在分词）使某事持续更久；延长某事的时间。"},"examples":[{"en":"The rain is prolongating the road repairs.","zh":"这场雨正在延长道路维修的工期。"},{"en":"She avoided prolongating the meeting by keeping her comments brief.","zh":"她把发言说得简短，以避免把会议拖得更长。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, less common) continuing for a long time; lengthening in duration.","zh":"（形容词，用法较少）持续很久的；在时间上延长的。"},"examples":[{"en":"They faced a prolongating delay at the airport.","zh":"他们在机场遇到了持续的延误。"},{"en":"A prolongating conflict can exhaust communities.","zh":"持续的冲突会让社区筋疲力尽。"}]}],"synonyms":["prolonging","extending","lengthening","dragging out","stretching"],"phonetic":"/proʊˈlɔŋɡeɪtɪŋ/","extraExplanation":["“prolongating”来自动词“prolongate”（延长），但在现代英语里更常用、更自然的说法是“prolonging”（来自“prolong”）。在写作或口语中，如果你想表达“延长/拖长”，优先用“prolonging”。“prolongate/prolongating”更偏正式或较少见，偶尔出现在学术或法律语境中。"]}
{"word":"prolongation","summary":{"en":"Prolongation means extending something in time or the extended period itself; it’s a formal word often used in medical, legal, or academic contexts.","zh":"Prolongation 指“延长/延续”或“被延长的时间”，属于较正式用语，常见于医学、法律或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making something last longer; an extension of time","zh":"延长；延续（使某事持续更久的行为）"},"examples":[{"en":"The prolongation of the meeting made everyone late for dinner.","zh":"会议的延长让大家都错过了晚餐时间。"},{"en":"Doctors are discussing the prolongation of his treatment for another week.","zh":"医生们正在讨论将他的治疗再延长一周。"}]},{"partOfSpeech":"n.","definition":{"en":"a period of time that has been extended; continued duration","zh":"延长的时间；延续的时段"},"examples":[{"en":"Due to rain, the game went into a prolongation of play.","zh":"由于下雨，比赛进入了延长的比赛时间。"},{"en":"We didn’t expect such a long prolongation of the delay.","zh":"我们没想到延误会被延长这么久。"}]}],"synonyms":["extension","lengthening","continuation","protraction"],"phonetic":"/ˌproʊlɔŋˈɡeɪʃən/","extraExplanation":["“prolongation”来自动词“prolong”（延长、拖长）+ 名词后缀“-ation”（表示行为或结果）。在学术写作、医学、法律等更正式的语境里更常见；日常口语中更常用“extension”或直接说“make it longer”。","在英国英语里，体育比赛的“加时赛”常用“extra time”；在一些较正式的描述中也可能看到“prolongation”，但并不是最常见的日常说法。"]}
{"word":"prolongations","summary":{"en":"“Prolongations” means extensions or delays that make something last longer, often used in formal contexts.","zh":"“prolongations”指使某事持续更久的延长或延期，常用于较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lengthening or extension of time; a delay that makes something last longer","zh":"（时间的）延长；延期；使某事持续更久的拖延"},"examples":[{"en":"The project suffered repeated prolongations because of supply problems.","zh":"由于供应问题，这个项目一再延期。"},{"en":"Unexpected prolongations can increase costs and stress for the whole team.","zh":"意外的延期会增加成本，也会让整个团队压力更大。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical) an abnormally long phase or action in the body, such as a prolonged contraction","zh":"（医学）身体某个阶段或动作异常延长，例如收缩时间过长"},"examples":[{"en":"The doctor noted prolongations in the patient’s muscle contractions.","zh":"医生注意到患者的肌肉收缩时间有延长现象。"}]}],"synonyms":["extensions","delays","postponements","protractions"],"phonetic":"/ˌproʊlɔŋˈɡeɪʃən/","extraExplanation":["“prolongation”更常见于较正式/学术的语境；日常口语里，人们更常说“delay”“extension”或“taking longer than expected”。","该词来自动词“prolong”（延长）+ 名词后缀“-ation”（……的过程/结果）。在工程、法律、医学文献中出现频率更高。"]}
{"word":"prolonge","summary":{"en":"Prolong means to make something last longer, or to continue for a long time.","zh":"Prolong 意为“延长（使持续更久）”，也可指“持续很久”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something last longer; to extend in time","zh":"延长；使（某事）持续更久"},"examples":[{"en":"The meeting was prolonged by an hour because of questions.","zh":"因为提问，这次会议又延长了一个小时。"},{"en":"Try not to prolong the argument—let’s focus on solutions.","zh":"尽量不要把争论拖长——我们专注于解决方案吧。"}]},{"partOfSpeech":"vi.","definition":{"en":"to continue for a long time (often used with time expressions)","zh":"持续很久（常与时间表达连用）"},"examples":[{"en":"The negotiations prolonged into the night.","zh":"谈判一直持续到深夜。"},{"en":"The pain may prolong for several days after surgery.","zh":"手术后疼痛可能会持续几天。"}]}],"synonyms":["extend","lengthen","protract","draw out","continue"],"phonetic":"/prəˈlɔŋ/","extraExplanation":["你输入的“prolonge”更常见是动词“prolong”的拼写；“prolonge”不是标准英语形式（有时会被误写成带-e结尾）。","词形：prolonged（延长了的/被拖长的），prolonging（正在延长）。","常见搭配：prolong a meeting/delay（延长会议/拖延）；prolong the life of sth（延长……的寿命）；be prolonged by + 时间（被延长……）。","词源提示：pro-（向前）+ long（长），意思是“把时间拉长”。"]}
{"word":"prolonged","summary":{"en":"“Prolonged” usually means something lasts for a long time (often longer than expected). It can also be the verb form meaning “made longer.”","zh":"“prolonged”通常表示某事持续很久（常含“比预期更久”之意）；也可作动词形式，表示“被延长/使延长”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Continuing for a long time, or lasting longer than expected.","zh":"持续很长时间的；（比预期）拖长的。"},"examples":[{"en":"The city experienced a prolonged drought that affected crops and water supplies.","zh":"这座城市经历了持续很久的干旱，影响了农作物和供水。"},{"en":"After a prolonged silence, she finally answered the question.","zh":"在长时间的沉默之后，她终于回答了这个问题。"},{"en":"Prolonged exposure to loud noise can damage your hearing.","zh":"长时间暴露在噪音中可能会损害听力。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “prolong”: to make something last longer.","zh":"“prolong”的过去式/过去分词：使某事延长、拖长。"},"examples":[{"en":"They prolonged the meeting to discuss the budget in more detail.","zh":"他们延长了会议，以更详细地讨论预算。"},{"en":"The medication prolonged his recovery period.","zh":"这种药让他的康复期延长了。"}]}],"synonyms":["long-lasting","lengthy","extended","drawn-out"],"phonetic":"/prəˈlɔŋd/","extraExplanation":["“prolonged”最常见作形容词，常搭配：prolonged period（长期/持续一段时间）、prolonged drought（长期干旱）、prolonged illness（久病）、prolonged exposure（长期暴露）。语气通常偏正式，强调“持续时间长、拖久了”。","在文学或新闻语境中，“prolonged silence/war/crisis”等表达常用来突出紧张、压抑或问题迟迟无法解决的氛围。"]}
{"word":"prolongen","summary":{"en":"“Prolongen” is an archaic form of “prolong,” meaning to make something last longer.","zh":"“prolongen”是“prolong”的古老拼写，意思是“延长，使持续更久”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) to make something last longer; to extend the duration of something.","zh":"（古用）使某事持续更久；延长（时间、期限等）。"},"examples":[{"en":"The poet sought to prolongen the moment of joy in his song.","zh":"诗人试图在歌中把那一刻的喜悦延长。"},{"en":"Do not prolongen the debate; let us decide.","zh":"不要把辩论拖得太长；让我们做决定吧。"}]}],"synonyms":["prolong","extend","lengthen","continue","draw out"],"phonetic":"/prəˈlɔŋ/","extraExplanation":["“prolongen”是中古英语/早期现代英语中较旧的拼写形式，现代英语通常写作“prolong”。在当代写作或考试中建议使用“prolong”。","词根来自拉丁语 pro-（向前、继续）+ longus（长），所以核心含义就是“让时间/过程变长”。"]}
{"word":"prolonger","summary":{"en":"A “prolonger” is someone or something that makes something last longer.","zh":"“prolonger”指使某事持续更久的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that makes something last longer; something that prolongs","zh":"延长者；使……持续更久的人或事物；延长物"},"examples":[{"en":"Some medications act as sleep prolongers, keeping people drowsy longer than expected.","zh":"有些药物会起到“延长睡眠”的作用，让人比预期更久地昏昏欲睡。"},{"en":"A good lid can be a freshness prolonger for food in the fridge.","zh":"一个好的盖子可以成为冰箱里食物保鲜的“延长器”。"}]}],"synonyms":["extender","lengthener","preserver"],"phonetic":"/proʊˈlɔŋɡər/","extraExplanation":["“prolonger”由动词 prolong（延长、拖长）+ 后缀 -er（表示“做某事的人/物”）构成。日常英语里更常用 prolong（动词）或 prolongation（名词：延长、延长期），而 “prolonger” 多见于说明文、技术/产品描述中。"]}
{"word":"prolonges","summary":{"en":"“Prolong” means to make something last longer or to extend it.","zh":"“prolong”表示让某事持续更久或把它延长/延伸。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something last longer; to extend the time of something","zh":"使（某事）持续更久；延长（时间）"},"examples":[{"en":"The rain prolonged our trip because the roads were flooded.","zh":"下雨让我们的旅程拖得更久，因为道路被淹了。"},{"en":"They tried to prolong the meeting to discuss every detail.","zh":"他们试图延长会议，以讨论每个细节。"}]},{"partOfSpeech":"vt.","definition":{"en":"to extend something physically (in length)","zh":"（在长度上）拉长；延伸"},"examples":[{"en":"The bridge will be prolonged to reach the new highway.","zh":"这座桥将被延伸，以连接新的高速公路。"}]}],"synonyms":["extend","lengthen","continue","stretch","draw out"],"phonetic":"/prəˈlɔŋ/","extraExplanation":["“prolonges”不是常见英文拼写；如果你想表达“延长”，通常写作动词原形 **prolong**，第三人称单数是 **prolongs**（如：He prolongs the talk）。","词根提示：**pro-**（向前）+ **long**（长），有“把时间/长度往前拉长”的感觉。"]}
{"word":"prolonging","summary":{"en":"“Prolonging” means making something last longer; it can also describe something that continues for a long time.","zh":"“prolonging”表示让某事持续更久、延长；也可作形容词表示“持续很久的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something last longer; to extend the time of an event, situation, or process","zh":"使（某事）持续更久；延长（事件、情况或过程）的时间"},"examples":[{"en":"The negotiations were prolonged for weeks because neither side would compromise.","zh":"由于双方都不愿妥协，谈判被拖延了好几个星期。"},{"en":"Doctors try to prolong a patient’s life while keeping them comfortable.","zh":"医生会在尽量让病人舒适的前提下，努力延长其生命。"},{"en":"Don’t prolong the meeting—let’s make a decision.","zh":"别把会议拖得太久——我们做个决定吧。"}]},{"partOfSpeech":"adj.","definition":{"en":"continuing for a long time; longer than usual or expected","zh":"持续很久的；（比通常或预期）更长的"},"examples":[{"en":"After a prolonged silence, she finally answered.","zh":"在长时间的沉默之后，她终于回答了。"},{"en":"He took a prolonged break from social media.","zh":"他长时间暂停使用社交媒体。"}]}],"synonyms":["extending","lengthening","dragging out","protracting"],"phonetic":"/prəˈlɔŋɪŋ/","extraExplanation":["“prolonging”通常是动词“prolong”的现在分词/动名词形式：\n- 现在分词：She is prolonging the discussion.（她正在把讨论拖长。）\n- 动名词：Prolonging the pain won’t help.（延长痛苦没有帮助。）\n常见搭配：prolong a meeting/war/life/suffering（延长会议/战争/生命/痛苦）。"]}
{"word":"prolongment","summary":{"en":"“Prolongment” is a rare/nonstandard noun meaning an extension or the act of prolonging something.","zh":"“prolongment”是一个罕见/非标准名词，表示“延长；延长的行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare or nonstandard) The act of making something last longer; an extension of time.","zh":"（罕见/非标准用法）使某事持续更久的行为；延长（时间）。"},"examples":[{"en":"The meeting ran late, and the prolongment exhausted everyone.","zh":"会议拖到很晚，这种延长让大家都筋疲力尽。"},{"en":"They asked for a prolongment of the deadline because of shipping delays.","zh":"由于运输延误，他们请求延长期限。"}]}],"synonyms":["extension","prolongation","lengthening","continuation"],"phonetic":"/proʊˈlɔŋmənt/","extraExplanation":["“prolongment”在现代英语里非常少见，很多词典不收录，常被视为拼写变体或不规范用法。更常见、更自然的表达是：\n- “extension”（延长、延期，最常用）\n- “prolongation”（延长过程/延长时间，较正式）\n- 也可以直接用动词：“to prolong”（延长）\n\n如果你是在正式写作或考试中，建议用“extension”或“prolongation”。"]}
{"word":"prolongs","summary":{"en":"“Prolongs” means “makes something last longer” (he/she/it prolongs).","zh":"“prolongs”表示“使……持续更久/延长……”，是“prolong”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “prolong”) to make something last longer; to extend the duration of something.","zh":"（“prolong”的第三人称单数）使……持续更久；延长……的时间。"},"examples":[{"en":"The new medicine prolongs the patient’s life.","zh":"这种新药延长了病人的生命。"},{"en":"Talking too much only prolongs the meeting.","zh":"说太多只会让会议拖得更久。"},{"en":"Cold weather prolongs the flu season.","zh":"寒冷天气会延长流感季。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to continue for a longer time; to last longer than expected.","zh":"（较少用）持续更久；比预期更长时间才结束。"},"examples":[{"en":"If the rain prolongs, the game will be canceled.","zh":"如果雨一直下个不停，比赛就会取消。"}]}],"synonyms":["extends","lengthens","protracts","draws out","keeps going"],"phonetic":"/prəˈlɔŋ/","extraExplanation":["“prolong”语气偏正式，常用于医学、学术、新闻或书面表达中；日常口语里常用“make … longer / extend”。","常见搭配：prolong life（延长寿命）、prolong the agony/suffering（延长痛苦）、prolong a meeting/war（让会议/战争拖延）。","注意拼写与发音：pro- + long（和“long”相关），意思是“把时间拉长”。"]}
{"word":"prolotherapy","summary":{"en":"Prolotherapy is an injection-based treatment aimed at triggering healing to reduce chronic pain and improve joint or tendon/ligament stability.","zh":"Prolotherapy（增生疗法）是一种通过注射刺激修复反应来减轻慢性疼痛、改善关节或肌腱/韧带稳定性的治疗方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical injection treatment used to reduce chronic pain and improve joint or tendon/ligament stability by stimulating the body’s healing response (often by injecting an irritating solution such as dextrose).","zh":"一种注射治疗方法，用来缓解慢性疼痛并改善关节或肌腱/韧带稳定性，通过注入刺激性溶液（常见如葡萄糖）来诱发身体的修复反应。"},"examples":[{"en":"She tried prolotherapy for chronic knee pain after physical therapy didn’t help enough.","zh":"物理治疗效果不够后，她尝试用增生疗法（prolotherapy）来处理慢性膝痛。"},{"en":"Some clinics offer prolotherapy for tendon injuries, but evidence and recommendations vary by condition.","zh":"一些诊所会为肌腱损伤提供增生疗法，但不同疾病的证据与推荐程度不一致。"}]}],"synonyms":["proliferation therapy","regenerative injection therapy"],"phonetic":"/ˌproʊləˈθerəpi/","extraExplanation":["“Prolotherapy”来自“proliferation（增生、增长）”，强调通过刺激局部组织反应来促进修复，因此中文常译为“增生疗法/增殖疗法”。","在英语医学语境中，它常被归为“regenerative injection therapy（再生注射疗法）”的一种，但它与PRP（富血小板血浆）或干细胞注射并不相同；临床证据因适应症而异，是否适合需要由合格医生评估。"]}
{"word":"prolusion","summary":{"en":"Prolusion means a formal opening speech or introductory address before the main event.","zh":"prolusion 指正式的开场白或引言式致辞，用于主要内容开始之前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal introduction or opening speech, especially one given before a lecture, performance, or event.","zh":"（尤指讲座、演出或活动前的）正式开场白；序言式的致辞。"},"examples":[{"en":"The professor began the seminar with a short prolusion about why the topic matters today.","zh":"教授用一段简短的开场致辞开始研讨会，说明这个主题为何在当下重要。"},{"en":"Her prolusion welcomed the audience and set a thoughtful tone for the evening.","zh":"她的开场白欢迎了观众，并为当晚定下了沉思的基调。"}]}],"synonyms":["preface","introduction","opening address","prelude"],"phonetic":"/proʊˈluʒən/","extraExplanation":["该词较少用于日常口语，更常见于正式、学术或文学语境。常与 lecture（讲座）、address（致辞）、preface（前言）等场合搭配。","词源上与“prelude（序曲/开场）”在感觉上相近：都是“在主要内容之前的引入”。在大学传统中，prolusion 可指学者在公开讲座前的“开讲辞”。"]}
{"word":"prolusionize","summary":{"en":"A very rare verb meaning “to introduce with a formal preliminary speech or essay (a prolusion).”","zh":"一个非常罕见的动词，意思是“用正式的开场演讲或导言文章作引入（作序讲）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To give or write a prolusion; to introduce something with a formal preliminary speech, lecture, or essay.","zh":"（罕见／非规范用法）作“序讲/开场演讲”（prolusion）；用正式的前言、导言式演讲或文章为某事作引入。"},"examples":[{"en":"Before the main lecture, the professor prolusionized with a short history of the field.","zh":"在正式讲座开始前，教授用一段简短的学科史作了引入。"},{"en":"The editor prolusionized the collection with a brief introductory essay.","zh":"编辑用一篇简短的导言文章为这本文集作了开场。"}]}],"synonyms":["introduce","preface","give an introduction","deliver an opening address","prologue"],"phonetic":"/proʊˈluːʒənˌaɪz/","extraExplanation":["“prolusionize”非常少见，多半是临时造词（nonce word），由名词“prolusion”（序讲、开场讲演）加动词后缀“-ize”构成。日常英语里更常见的表达是“give an introduction / preface / deliver an opening address”。","“prolusion”源自拉丁语词根，和“prelude（序曲/前奏）”在语感上接近：都强调“正式内容之前的引入”。如果你在写作中使用“prolusionize”，建议确保读者能从上下文理解其含义，或改用更常见的说法。"]}
{"word":"prolusory","summary":{"en":"Prolusory means “introductory” or “serving as an opening/preliminary.”","zh":"prolusory 意为“引言的、开场性的、作为初步介绍的（多用于正式/学术语境）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Serving as an introduction or preliminary piece; opening or prefatory.","zh":"作为引言的；序言的；开场性的。"},"examples":[{"en":"The professor gave a prolusory lecture to outline the course goals.","zh":"教授做了一场开场讲座来概述课程目标。"},{"en":"Her prolusory remarks were brief but set a serious tone.","zh":"她的开场致辞很简短，但定下了严肃的基调。"}]}],"synonyms":["introductory","preliminary","prefatory","opening","initial"],"phonetic":"/proʊˈluːsəri/","extraExplanation":["这个词比较正式、偏书面，常见于学术或演讲场合，尤其是“prolusory lecture”（开场/导论讲座）。","词源上与拉丁语中“先行/预演、作为开端的演说”有关，所以带有“为后面内容铺垫”的感觉。","近义词里：introductory最常用、最中性；preliminary强调“初步的”；prefatory更偏“序言/前言（preface）式的”。"]}
{"word":"prolyl","summary":{"en":"Prolyl means “related to proline,” especially describing proline residues or bonds in proteins/peptides.","zh":"prolyl 表示“与脯氨酸相关的”，常用于描述蛋白质/肽中的脯氨酸残基或相关键。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or derived from the amino acid proline; used to describe a proline residue or chemical group in proteins and peptides (e.g., a prolyl bond).","zh":"与氨基酸“脯氨酸（proline）”有关的；用于描述蛋白质/肽中来自脯氨酸的残基或化学基团（如“脯氨酰键”）。"},"examples":[{"en":"Prolyl isomerization can affect how a protein folds.","zh":"脯氨酰（prolyl）异构化会影响蛋白质如何折叠。"},{"en":"The enzyme targets a prolyl peptide bond.","zh":"该酶以一个脯氨酰（prolyl）肽键为作用靶点。"}]}],"synonyms":["proline-related","proline-derived"],"phonetic":"/ˈproʊlɪl/","extraExplanation":["“prolyl”主要出现在生物化学/分子生物学语境里，不是日常英语词汇。常见搭配有：prolyl residue（脯氨酸残基）、prolyl bond / prolyl peptide bond（脯氨酰肽键）、prolyl hydroxylation（脯氨酰羟化，常见于胶原蛋白相关研究）。","词形上：proline（脯氨酸）→ prolyl（“与脯氨酸相关的”形容词）。这类“-yl”结尾常用来表示“来自某物/某基团的”（如 acetyl, methyl）。"]}

