{"word":"prom","summary":{"en":"Prom is a formal high school dance, typically held near the end of the school year.","zh":"Prom 指高中学年末举行的正式舞会（常被称为毕业舞会）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal high school dance, usually held near the end of the school year (often for juniors and seniors)","zh":"（美国等地的）高中毕业舞会/学年末正式舞会（通常面向高三高二学生）"},"examples":[{"en":"She bought a dress for prom weeks in advance.","zh":"她提前好几周就买好了参加舞会的礼服。"},{"en":"Are you going to prom this year?","zh":"你今年要去参加毕业舞会吗？"},{"en":"He asked his friend to be his prom date.","zh":"他邀请朋友当他的舞会约会对象。"}]}],"synonyms":["formal dance","school dance"],"phonetic":"/prɑm/","extraExplanation":["“Prom”是“promenade”的缩写，原意与“散步、（在舞会中）走场亮相”有关。","在美国文化里，prom常被视为高中生活的重要仪式之一：通常会穿正式礼服、拍照、结伴入场，有时还会选“Prom King/Queen（舞会王/后）”。不同学校的形式和花费差异很大。"]}
{"word":"promachinery","summary":{"en":"“Promachinery” isn’t a standard word; it’s usually read as “pro‑machinery” (supporting machinery/automation) or a brand name.","zh":"“promachinery”不是标准词；多被理解为“pro‑machinery”（支持机械/自动化）或品牌/名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually understood as “pro‑machinery” (supporting machinery/industrialization) or as a name/brand. In normal writing, use “machinery” or “pro‑machinery” depending on meaning.","zh":"不是标准英语单词；通常可理解为“pro‑machinery”（支持机械/机械化）或作为名称/品牌。在一般写作中应根据语境改用“machinery”或“pro‑machinery”。"},"examples":[{"en":"The article’s tone is strongly pro‑machinery, praising automation in farming.","zh":"这篇文章的语气明显“支持机械化”，称赞农业自动化。"},{"en":"If you mean equipment, you can just say “machinery.”","zh":"如果你想表达“设备/机器”，直接说“machinery”就可以。"}]}],"synonyms":["machinery","industrial equipment","automation (contextual)"],"phonetic":"/proʊ məˈʃiːnəri/","extraExplanation":["“pro-”是英语前缀，意思是“支持/赞成……”，常见于pro-democracy（支持民主）、pro-environment（支持环保）。把它接在名词前面时，通常会写成带连字符的形式（pro‑machinery），以便读者一眼看懂结构。","如果你是在某个网站、公司名或产品名里看到promachinery，它更可能是专有名词（品牌/用户名）。专有名词的拼写不一定遵循通用词汇规则，需要以对方官方写法为准。"]}
{"word":"promachos","summary":{"en":"Promachos means a front-line champion or defender in ancient Greek contexts, and it can also be a title like “Athena Promachos.”","zh":"Promachos 指古希腊语境中的“前线勇士/先锋捍卫者”，也可作称号，如“雅典娜·Promachos”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Greek contexts) a champion or warrior who fights in the front line; a defender who leads the charge.","zh":"（古希腊语境）冲在最前线作战的勇士；先锋、捍卫者（带头冲锋的人）。"},"examples":[{"en":"In the epic, he is praised as a promachos who never retreats from the front line.","zh":"在史诗中，他被称颂为一位绝不从前线退缩的promachos（先锋勇士）。"},{"en":"The commander chose her as promachos of the city’s defense.","zh":"指挥官选她作为城市防御的promachos（带头捍卫者）。"}]},{"partOfSpeech":"n.","definition":{"en":"(as an epithet, especially in classical studies) “front-fighter,” used of deities or heroes—most famously Athena Promachos, the protectress of Athens.","zh":"（作称号，常见于古典研究）“前线战士/前锋”的称号，可用于神祇或英雄——最著名的是“雅典娜·Promachos”，意为雅典的守护者。"},"examples":[{"en":"The statue was dedicated to Athena Promachos, emphasizing her role as protector in war.","zh":"这座雕像献给雅典娜·Promachos，强调她在战争中守护城邦的角色。"},{"en":"Scholars note that “Promachos” highlights a god’s presence at the forefront of battle.","zh":"学者指出，“Promachos”突出了神祇在战斗最前沿的存在感。"}]}],"synonyms":["champion","front-line fighter","defender","vanguard warrior"],"phonetic":"/proʊˈmɑːkəs/","extraExplanation":["词源：来自古希腊语 προμάχος（promákhos），由 pro-（“在前、向前”）+ machē（“战斗”）构成，字面意思就是“在前面战斗的人”。","文化背景：英语里这个词多见于古典学、历史写作或文学翻译，不是日常常用词。提到 Athena Promachos（雅典娜·Promachos）时，常指她作为雅典城邦的军事守护者形象；古代雅典卫城曾有著名的“雅典娜·Promachos”巨像（传说远处海上也能看见其闪光）。","使用提示：在现代英文写作中，如果读者不熟悉古希腊术语，常会在首次出现时加解释，如“promachos (front-line champion)”。"]}
{"word":"promagisterial","summary":{"en":"Promagisterial means “having or relating to the authority of a Roman magistrate exercised by a substitute (such as a proconsul).”","zh":"promagisterial 指“与古罗马代行执政官职、行使执政官权力的人或其权力有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a Roman official who acted “in place of” a magistrate and held a magistrate’s authority (for example, a proconsul or propraetor).","zh":"（古罗马）与“代理执政官/代行官职者”有关的；指代行某一执政官职、拥有相应官权的人（如行省总督 proconsul 或代理法务官 propraetor）。"},"examples":[{"en":"After his year in office ended, he received a promagisterial command in a province.","zh":"他的任期结束后，获得了一个行省的代理执政官式（promagisterial）的任命。"},{"en":"The senate debated whether granting promagisterial power would set a dangerous precedent.","zh":"元老院辩论：授予 promagisterial 权力是否会开一个危险的先例。"}]}],"synonyms":["proconsular","propraetorian","magisterial (context-dependent)"],"phonetic":"ˌproʊˌmædʒɪˈstɪriəl","extraExplanation":["“pro-”在拉丁语里有“代行、替代（in place of）”的含义，所以 promagisterial 常出现在讨论古罗马政治制度的语境中：当某人任期已满，但仍被延长或授予在外省的军政权力，就可被描述为具有 promagisterial authority。","这个词非常学术化、罕见；日常英语里更常见的是 proconsul（行省总督）、propraetor（代理法务官）或 the extension of imperium（军政权力的延长）。"]}
{"word":"promagistracy","summary":{"en":"A Roman-historical term meaning the office or authority of a promagistrate (e.g., a proconsul governing a province).","zh":"罗马史术语：指代行高级官职者（如行省的代执政官）所拥有的职位、任期或职权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Rome) the office, term of office, or authority of a promagistrate (such as a proconsul or propraetor), especially when governing a province.","zh":"（古罗马）“代行高级官职者”（如代执政官 proconsul、代法务官 propraetor）的职务、任期或职权，尤指在行省担任总督时的权力与职位。"},"examples":[{"en":"After his consulship, he sought a promagistracy in a wealthy province.","zh":"在担任执政官之后，他谋求在富裕行省获得一项“代行官职”的总督职位。"},{"en":"The historian describes how promagistracy expanded Rome’s reach outside Italy.","zh":"这位历史学家描述了“代行官职制度”如何扩大罗马在意大利以外的影响力。"}]}],"synonyms":["proconsulship","provincial governorship","pro-magistracy","promagistrate authority"],"phonetic":"/ˌproʊˈmædʒɪstrəsi/","extraExplanation":["这是一个非常学术化、偏古典学/罗马史的词，日常英语中几乎不用。更常见的写法是 hyphenated：pro-magistracy。","罗马共和国时期，原本一年一任的执政官/法务官在任期结束后，常会“以原官身份的延伸”继续掌兵或治理行省，这种延伸出来的权力与任期就可概括为 promagistracy。常见对应角色是 proconsul（代执政官）与 propraetor（代法务官）。"]}
{"word":"promagistrate","summary":{"en":"A promagistrate was a Roman official who exercised a magistrate’s powers beyond the normal term, often to govern a province or command an army.","zh":"promagistrate 指古罗马中任期结束后仍被延长或授权继续行使执政官权力的官员，常用于治理行省或指挥军队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Rome) An official who acted in place of a magistrate, usually by having a magistrate’s authority extended after their normal term (for example, a proconsul or propraetor).","zh":"（古罗马）代理（或延长任期的）执政官员；指在原本任期结束后仍继续行使某类执政官权力的人（如外省总督“前执政官”proconsul 或“前法务官”propraetor）。"},"examples":[{"en":"After his term ended, he served as a promagistrate and governed a province.","zh":"他的任期结束后，他以代理执政官（延长权力者）的身份继续治理一个行省。"},{"en":"In Roman history, promagistrates often commanded armies far from the city.","zh":"在罗马史中，代理执政官常在远离罗马城的地方统军。"}]}],"synonyms":["proconsul","propraetor"],"phonetic":"ˌproʊˈmædʒɪstreɪt","extraExplanation":["“promagistrate”由拉丁语前缀 pro-（表示“代替、代表、以……身份”）+ magistratus（官职、执政官）构成。它不是指“支持某位官员的人”，而是指“在法律上以代理/延任方式继续行使官权的人”。","常见相关职位包括：proconsul（前执政官/外省总督）与 propraetor（前法务官/外省总督）。在共和国后期与帝国早期，罗马经常通过这种“延长任期”的方式来满足外省治理与军事指挥的需要。"]}
{"word":"promajority","summary":{"en":"Promajority (more commonly pro-majority) means supporting the majority, especially in political or public-opinion contexts.","zh":"promajority（更常写作 pro-majority）指“支持多数派/多数意见”，多用于政治或舆论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the majority (the larger group of people), especially in politics or public opinion.","zh":"支持多数（占人数较多的一方）的，尤指在政治或舆论语境中。"},"examples":[{"en":"The candidate took a pro-majority stance on the referendum.","zh":"这位候选人在公投问题上采取了支持多数派的立场。"},{"en":"Some activists criticized the policy as too pro-majority and not protective enough of minority rights.","zh":"一些活动人士批评该政策过于偏向多数派，对少数群体权利保护不足。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or position that favors the majority’s preferences or interests.","zh":"偏向多数人偏好或利益的观点/立场。"},"examples":[{"en":"In the debate, she argued against a strict pro-majority approach.","zh":"在辩论中，她反对一种严格的“多数优先”做法。"}]}],"synonyms":["majoritarian","majority-favoring","majority-backed","pro-popular (in some contexts)"],"phonetic":"/proʊ məˈdʒɔrəti/","extraExplanation":["“promajority”更常见的写法是带连字符的“pro-majority”。在新闻评论、政治讨论中偶尔出现，但不是非常常用的标准词。","“pro-”前缀表示“支持/赞成”（如 pro-democracy 支持民主；pro-choice 支持选择权）。因此 pro-majority 直译就是“支持多数派/多数意见”。","使用时要注意语气：在民主制度语境里它可能是中性描述，但在谈到少数族群权益时，pro-majority 有时会带有批评意味（暗示忽视少数权利）。"]}
{"word":"promammal","summary":{"en":"A rare scientific word meaning an early mammal or mammal-like ancestor.","zh":"一个较少见的科学用词，指早期的哺乳动物或类哺乳动物祖先。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very early mammal or mammal-like ancestor in evolutionary history; a proto-mammal (used mainly in paleontology).","zh":"原始哺乳动物；（进化史上）非常早期的哺乳动物或类哺乳动物祖先（主要用于古生物学语境）。"},"examples":[{"en":"Scientists study promammals to understand how modern mammals evolved.","zh":"科学家研究原始哺乳动物，以了解现代哺乳动物是如何进化而来的。"},{"en":"In this documentary, promammals are shown as small animals living alongside reptiles.","zh":"在这部纪录片中，原始哺乳动物被展示为与爬行动物共存的小型动物。"}]}],"synonyms":["proto-mammal","early mammal","mammal ancestor"],"phonetic":"/ˌproʊˈmæməl/","extraExplanation":["“promammal”并不是日常英语常用词，更多出现在古生物学、进化生物学的科普或学术文本中。","词素上可理解为 pro-（“早期的/原始的”）+ mammal（“哺乳动物”），意思接近“proto-mammal”。不同作者有时会用它泛指早期哺乳动物或“哺乳动物样”过渡类型，具体指代可能随语境而变。"]}
{"word":"promammalia","summary":{"en":"Promammalia refers to very early mammal-like animals closely related to the origin of mammals (an uncommon/older term).","zh":"Promammalia 指与哺乳动物起源密切相关的史前早期类哺乳动物（较少用、偏旧的术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal or older term for very early mammal-like animals (close relatives/ancestors of modern mammals) that lived in prehistoric times.","zh":"（非正式或较旧的术语）指史前非常早期的“类哺乳动物”动物，即与现代哺乳动物关系很近、被认为是其近亲或祖先的一类化石动物。"},"examples":[{"en":"Some older textbooks used the word promammalia for early mammal-like forms before true mammals became common.","zh":"一些较旧的教材会用 promammalia 来指真正哺乳动物广泛出现之前的早期类哺乳动物。"},{"en":"The lecture compared promammalia with later mammals in terms of jaw and tooth evolution.","zh":"这堂课把 promammalia 与后来的哺乳动物在下颌和牙齿演化方面作了比较。"}]}],"synonyms":["protomammals","early mammal relatives","mammaliaforms"],"phonetic":"/ˌproʊməˈmeɪliə/","extraExplanation":["这个词在现代专业文献中并不算常见，更常见的相关说法包括 mammaliaforms（哺乳形类）、early mammal relatives（早期哺乳动物近亲）等。不同作者对它的范围可能不完全一致，因此阅读论文或教材时要看作者的定义。"]}
{"word":"promammalian","summary":{"en":"“Promammalian” describes features or organisms from the evolutionary stage leading up to true mammals.","zh":"promammalian 指向真哺乳动物演化之前的阶段或其特征（前哺乳动物/类哺乳动物阶段）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of the evolutionary stage just before true mammals, especially early mammal-like ancestors (often referring to late synapsids/therapsids).","zh":"与“真哺乳动物”出现之前的进化阶段有关的；指早期类哺乳动物祖先特征的（常用于描述晚期合弓类/兽孔类等）。"},"examples":[{"en":"The paper discusses promammalian traits such as changes in the jaw and ear region.","zh":"这篇论文讨论了“前哺乳动物”特征，例如下颌与耳区结构的变化。"},{"en":"Some fossils show a promammalian mixture of reptile-like and mammal-like features.","zh":"一些化石呈现出前哺乳动物式的混合特征：既像爬行动物，又像哺乳动物。"}]}],"synonyms":["proto-mammalian","mammal-like","pre-mammalian"],"phonetic":"/ˌproʊməˈmeɪliən/","extraExplanation":["该词较少出现在日常英语中，多见于古生物学、比较解剖学与演化生物学的学术语境。","含义通常是“在真正哺乳动物（crown mammals）之前的过渡阶段/类群”，但不同作者对“promammalian”所涵盖的具体范围可能不完全一致，因此阅读文献时要结合上下文与作者定义。","更常见、也更中性的相关表达包括：mammal-like（类哺乳动物的）、mammaliaform（哺乳形类的）、proto-mammal（原始哺乳动物/准哺乳动物，较口语化）。"]}
{"word":"promarriage","summary":{"en":"“Pro-marriage” means supporting marriage or encouraging marriage, especially in public debate.","zh":"“Pro-marriage”指支持婚姻或鼓励结婚，常见于公共讨论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting marriage as an institution or encouraging people to marry (often used in social or political discussions).","zh":"支持婚姻制度或鼓励结婚的（常用于社会或政治讨论）。"},"examples":[{"en":"The group promotes pro-marriage policies such as counseling programs for couples.","zh":"该团体推动“支持婚姻”的政策，例如为伴侣提供婚姻辅导项目。"},{"en":"Some voters describe themselves as pro-marriage and pro-family.","zh":"一些选民把自己描述为支持婚姻、支持家庭。"}]}],"synonyms":["in favor of marriage","pro-family (overlapping)","marriage-friendly"],"phonetic":"/proʊ ˈmærɪdʒ/","extraExplanation":["“pro-”是常见前缀，意思是“支持、赞成”。因此 pro-marriage 直译就是“支持婚姻的”。","在不同语境中，pro-marriage 可能只表示“认为婚姻很重要”，也可能与具体公共议题相关（例如婚姻政策、税收、婚姻教育等）。使用时最好结合上下文，避免让听者误解为对某一特定立场（如对同性婚姻的立场）。","写法上常见连字符：pro-marriage；有时也会写作 promarriage，但较少见，容易被读者看漏或误读。"]}
{"word":"promatrimonial","summary":{"en":"Promatrimonial means “before marriage; premarital,” but it’s uncommon in modern English.","zh":"promatrimonial 指“婚前的/结婚之前的”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening before marriage; relating to the period or situation before getting married (same idea as “premarital,” but much less common).","zh":"婚前的；与结婚之前的时期或状况有关的（含义接近 premarital，但更少见）。"},"examples":[{"en":"Some couples choose promatrimonial counseling to talk through finances and expectations before the wedding.","zh":"有些伴侣会选择婚前辅导，在婚礼前讨论财务和彼此的期待。"},{"en":"The clinic offers promatrimonial health screenings for engaged couples.","zh":"这家诊所为订婚伴侣提供婚前健康检查。"}]}],"synonyms":["premarital","prenuptial","before marriage"],"phonetic":"/ˌproʊˌmætrəˈmoʊniəl/","extraExplanation":["“promatrimonial”在现代英语里非常少见，日常交流、新闻与学术写作中更常用的是“premarital”（婚前的）或“prenuptial”（多用于“婚前协议”）。","构词上可理解为 pro-（在……之前）+ matrimonial（婚姻的），因此含义透明，但可能会让母语者觉得偏生僻或带一点“书面/法律”味。"]}
{"word":"promatrimonialist","summary":{"en":"Someone (or something) that supports and promotes marriage; pro-marriage.","zh":"指支持并倡导婚姻的人，或“亲婚姻的”立场/观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly supports marriage (especially traditional or lifelong marriage) and promotes it as a social or moral ideal","zh":"支持婚姻（尤指传统或终身婚姻）并积极倡导把婚姻视为社会或道德理想的人"},"examples":[{"en":"The columnist is a promatrimonialist who argues that marriage strengthens communities.","zh":"这位专栏作家是个婚姻倡导者，认为婚姻能强化社区凝聚力。"},{"en":"Some critics say the promatrimonialist viewpoint can overlook the needs of single people.","zh":"一些批评者认为，婚姻倡导者的观点可能会忽视单身人士的需求。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring marriage; pro-marriage","zh":"支持婚姻的；主张结婚的；亲婚姻的"},"examples":[{"en":"The organization takes a promatrimonialist stance in its public campaigns.","zh":"该组织在公共宣传中采取亲婚姻立场。"},{"en":"Her promatrimonialist message focused on commitment and shared responsibility.","zh":"她的亲婚姻信息强调承诺与共同责任。"}]}],"synonyms":["pro-marriage advocate","marriage advocate","family-values supporter"],"phonetic":"/proʊˌmætrɪˈmoʊniəlɪst/","extraExplanation":["这个词非常少见，多见于学术讨论、评论文章或较正式的写作中。常见表达通常是 pro-marriage（亲婚姻）或 marriage advocate（婚姻倡导者）。","构词上，pro- 表示“支持”，matrimonial 来自拉丁语 matrimonium（婚姻），-ist 表示“……主义者/……者”。在不同文化语境里，“支持婚姻”可能指宗教、法律或社会政策立场，使用时注意避免把“支持婚姻”等同于反对单身或反对离婚。"]}
{"word":"promaximum","summary":{"en":"“Promaximum” is not a standard English word; it usually refers to “Pro Max” (the biggest/highest-end Pro version) or is used jokingly to mean “the absolute maximum.”","zh":"“promaximum”不是标准英语词；通常指“Pro Max”（专业版中的最大/最高配），或戏谑地表示“最大值拉满/极限最大”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal, nonstandard) Likely a blend or misspelling of “Pro Max,” used to mean the biggest or highest-end “Pro” version of a product (especially Apple’s iPhone Pro Max models).","zh":"（非正式、非标准）多半是“Pro Max”的拼写变体或混写，用来指某产品中“Pro（专业版）里最大/最高配”的版本（尤其常指苹果 iPhone Pro Max 系列）。"},"examples":[{"en":"I’m thinking of upgrading to the Pro Max, not the regular Pro.","zh":"我在考虑升级到 Pro Max，而不是普通的 Pro。"},{"en":"Online sellers sometimes write “promaximum,” but the official name is “Pro Max.”","zh":"网店有时会写“promaximum”，但官方名称是“Pro Max”。"}]},{"partOfSpeech":"other","definition":{"en":"(Playful/slang) Used jokingly to mean “the absolute maximum,” often to emphasize that something is the biggest or most extreme.","zh":"（戏谑/俚语）开玩笑地表示“最大值拉满/极限最大”，强调程度很高、很夸张。"},"examples":[{"en":"Turn the volume to promaximum—just kidding, don’t!","zh":"把音量调到 promaximum——开玩笑的，别这么做！"},{"en":"He went promaximum on the decorations for the party.","zh":"他把派对装饰搞到“极限拉满”。"}]}],"synonyms":["Pro Max","maximum","the max"],"phonetic":"/ˌproʊ ˈmæksɪməm/","extraExplanation":["“Pro Max”是“Pro（专业版）+ Max（最大/最高）”的组合。很多品牌会用Max来表示更大屏幕、更强配置或更高价位。","“promaximum”不是常见标准词；在正式写作或产品名称里，建议用官方写法“Pro Max”，或直接用“maximum / the maximum”。"]}
{"word":"promazine","summary":{"en":"Promazine is a sedating phenothiazine antipsychotic drug used mainly to calm agitation or anxiety and sometimes to treat other symptoms such as nausea.","zh":"Promazine（丙米嗪）是一种具有镇静作用的吩噻嗪类抗精神病药，主要用于缓解激动或焦虑等症状，有时也用于其他症状（如恶心）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sedating antipsychotic medicine of the phenothiazine class, used to treat symptoms such as agitation, anxiety, nausea, and (less commonly today) psychosis","zh":"一种具有镇静作用的抗精神病药，属吩噻嗪类；用于缓解激动、焦虑、恶心等症状（现今较少用于治疗精神病性症状）"},"examples":[{"en":"The doctor prescribed promazine to help reduce severe agitation.","zh":"医生开了丙米嗪来帮助减轻严重的激动不安。"},{"en":"Because promazine can cause drowsiness, she was told not to drive after taking it.","zh":"由于丙米嗪可能引起嗜睡，她被告知服药后不要开车。"}]}],"synonyms":["antipsychotic","phenothiazine","neuroleptic"],"phonetic":"/ˈproʊməˌziːn/","extraExplanation":["“Promazine”是药物通用名（generic name），在医学语境中通常不加冠词直接使用（如：Promazine was prescribed...）。","它属于第一代（典型）抗精神病药，常见特点是镇静作用较明显，并可能出现口干、便秘、嗜睡等抗胆碱能相关不适；个别情况下也可能出现锥体外系反应。具体用药与风险需遵医嘱。","拼写上以“-azine”结尾的药名在英语里较常见，但并不都属于同一类药；遇到不熟悉的药名，最好结合药物类别（class）与用途来记忆。"]}
{"word":"promemorial","summary":{"en":"A formal written memorandum, especially one submitted in diplomacy; rarely, a reminder note.","zh":"正式书面备忘录，尤指外交场合递交的陈述；少见义为提醒便条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Diplomacy, formal) A written memorandum or statement presented to a government or official, often summarizing facts, requests, or a position.","zh":"（外交，正式）呈交给政府或官员的书面备忘录/陈述，常用来概述事实、诉求或立场。"},"examples":[{"en":"The embassy delivered a promemorial outlining its concerns about the new regulation.","zh":"大使馆递交了一份备忘录，概述其对新规的担忧。"},{"en":"In the promemorial, the minister asked for a meeting to clarify the disagreement.","zh":"在该备忘录中，部长请求会面以澄清分歧。"}]},{"partOfSpeech":"n.","definition":{"en":"A brief written record made to help someone remember important points; a reminder note (rare).","zh":"为帮助记住要点而写下的简短记录；提示便条（较少见）。"},"examples":[{"en":"She kept a small promemorial of key dates and contacts.","zh":"她留了一份小备忘清单，记下关键日期和联系人。"}]}],"synonyms":["memorandum","memo","aide-mémoire","diplomatic note","position paper"],"phonetic":"/ˌproʊməˈmɔriəl/","extraExplanation":["该词多见于外交与法律等正式语境，带有强烈的“呈递/递交给对方机构”的感觉；日常英语里更常用 memorandum / memo（备忘录）或 reminder note（提醒便条）。","词源上可理解为拉丁语系“为了记忆/作为提醒”的意思，近义词 aide-mémoire（法语借词）也常用于外交文书。"]}
{"word":"promenade","summary":{"en":"A promenade is a place for leisurely walking (often by the sea) or the act of strolling there.","zh":"Promenade 指（常在海边等处的）散步道/步行长廊，也可指悠闲散步这一行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a public walk or path (often along the sea or in a park) where people go for leisure","zh":"（常指海边或公园里的）散步道；步行长廊"},"examples":[{"en":"We walked along the seaside promenade after dinner.","zh":"晚饭后我们沿着海滨步行长廊散步。"},{"en":"Street musicians often play on the promenade in summer.","zh":"夏天时，街头音乐人常在步行长廊上演奏。"}]},{"partOfSpeech":"n.","definition":{"en":"a leisurely walk, especially one taken for pleasure or to be seen in public","zh":"（为消遣或社交、展示而进行的）漫步；散步"},"examples":[{"en":"They took an evening promenade through the old town.","zh":"他们傍晚在老城里漫步。"},{"en":"A Sunday promenade in the park was a common tradition.","zh":"周日在公园里散步曾是一种常见的传统。"}]},{"partOfSpeech":"v.","definition":{"en":"to walk in a relaxed way, often in a public place where people can see you","zh":"（在公共场所）悠闲地漫步；（带点社交意味地）散步"},"examples":[{"en":"Tourists promenaded along the river, taking photos.","zh":"游客们沿着河边漫步拍照。"},{"en":"Couples promenade in the square at night.","zh":"夜里情侣们在广场上散步。"}]}],"synonyms":["boardwalk","esplanade","walkway","stroll","saunter"],"phonetic":"/ˌprɑməˈnɑd/","extraExplanation":["“Promenade”来自法语，带有一点“在公共场合散步、社交、被人看见”的感觉，所以常出现在海滨城市、度假地或老欧洲城市的语境里。","在文学或叙事中，“promenade”有时暗示一种悠闲、体面或略带浪漫的氛围，比如人物在长廊散步、邂逅或闲谈。","相关搭配：take a promenade（去散步）；seaside/riverfront promenade（海滨/河畔步行长廊）；promenade deck（邮轮或船上的甲板散步区）。"]}
{"word":"promenaded","summary":{"en":"“Promenaded” means “walked leisurely,” often in a public place for pleasure or social display.","zh":"“Promenaded”表示“悠闲地散步”，常带有在公共场合休闲或社交露面的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"walked in a relaxed, unhurried way, often for pleasure or to be seen in public (past tense of “promenade”).","zh":"（promenade 的过去式）悠闲地散步；（常指为休闲、社交或在公共场合“走一走、露个面”）"},"examples":[{"en":"After dinner, they promenaded along the riverside to enjoy the cool air.","zh":"晚饭后，他们沿着河边悠闲散步，享受凉爽的空气。"},{"en":"The visitors promenaded through the old town, stopping to take photos.","zh":"游客们在老城区慢慢散步，不时停下来拍照。"},{"en":"In the novel, the couple promenaded in the park, aware of everyone watching.","zh":"小说里，那对情侣在公园里散步，知道周围的人都在看着他们。"}]}],"synonyms":["strolled","sauntered","walked","ambled"],"phonetic":"/ˈprɑməˌneɪd/","extraExplanation":["“Promenade”来自法语，带有一点“优雅、社交场合的散步”色彩；在一些语境里不只是走路，还暗含“在人多的地方来回走、被看见”。","常见搭配：promenade along/down (沿着……散步)；promenade through (在……中散步穿行)；go for a promenade（去散步）。"]}
{"word":"promenader","summary":{"en":"A promenader is a person who strolls leisurely for pleasure.","zh":"promenader 指为消遣而悠闲散步的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes a leisurely walk (a promenade), often in a public place for pleasure","zh":"散步者；漫步者（常指在公共场所悠闲散步以享受气氛的人）"},"examples":[{"en":"In the evening, promenaders filled the riverside path and stopped to watch the sunset.","zh":"傍晚时，河边小路上满是漫步的人们，大家停下来观看日落。"},{"en":"The park was designed with wide lanes so that promenaders could stroll comfortably.","zh":"这座公园设计了宽阔的步道，让散步者能舒适地慢行。"}]}],"synonyms":["stroller","walker","passerby","wanderer"],"phonetic":"/ˌprɑməˈnɑdər/","extraExplanation":["“promenader”在现代英语中不算特别常用，更常见的说法是“stroller / walker / people taking a walk”。它来自“promenade（散步；散步道）”，而“promenade”源于法语，常带有一种“为了休闲、社交、看风景而散步”的文化感觉（例如海滨长廊或公园主路）。","在文学或较正式的描写里，“promenaders”常用来营造一种悠闲、带风景与人群气息的画面，比如“evening promenaders along the seafront（海滨傍晚的漫步人群）”。"]}
{"word":"promenaderess","summary":{"en":"A rare, old-fashioned word meaning a woman who strolls or promenades.","zh":"较少见、偏旧式的词，指“散步/漫步的女子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who walks for pleasure, especially in a public place (a female “promenader”)","zh":"（尤指在公共场所）散步消遣的女子；女漫步者"},"examples":[{"en":"In the old seaside novel, the promenaderess strolls along the pier at sunset.","zh":"在那本老式海滨小说里，这位女漫步者在日落时分沿着码头散步。"},{"en":"The park was full of promenaders and promenaderesses enjoying the cool evening air.","zh":"公园里满是散步的人们，男女都有，享受着傍晚的凉风。"}]}],"synonyms":["female promenader","stroller","walker"],"phonetic":"/ˌprɑməˈnɑdərɪs/","extraExplanation":["这是一个较少见、带有旧时代/文学色彩的词，由 promenader（散步者）+ -ess（表示女性的后缀）构成。现代英语里常用更中性的说法，如 walker, stroller, pedestrian，或直接说 “a person who is out for a stroll”。","-ess（如 actress, waitress）在当代用法中有时会被视为不够中性；在写作或正式语境中，通常改用不分性别的形式（例如 actor 也可指女性）。","在文学或历史背景（维多利亚时代、旧式海滨长廊 promenade 等）中出现更自然：promenade 指“沿着海滨/林荫大道散步、社交式漫步”。"]}
{"word":"promenaders","summary":{"en":"“Promenaders” means people who stroll leisurely (often in public places), and it can also mean dancers doing a “promenade” figure in dances like square dancing.","zh":"“promenaders”指悠闲散步的人；在方块舞等舞蹈语境中也可指进行“promenade（携手绕行）”动作的舞者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who walk in a relaxed way, especially in public places, often to be seen or to enjoy the atmosphere.","zh":"（尤指在公共场所）悠闲散步的人；（常含）为了欣赏氛围或“被看见”而散步的人。"},"examples":[{"en":"On Sunday afternoons, the park is full of promenaders.","zh":"周日下午，公园里到处都是散步的人。"},{"en":"Promenaders strolled along the waterfront, stopping for coffee and photos.","zh":"散步的人沿着海滨慢慢走走停停，喝咖啡、拍照。"}]},{"partOfSpeech":"n.","definition":{"en":"In some partner or group dances (especially square dancing), people who take part in a “promenade” figure—walking together in a set pattern.","zh":"（某些双人舞/集体舞，尤指方块舞中）进行“promenade（携手绕行）”动作的舞者。"},"examples":[{"en":"At the caller’s cue, the promenaders moved around the ring.","zh":"在领舞者口令提示下，舞者们携手绕圈前进。"}]}],"synonyms":["strollers","wanderers","ramblers","flâneurs"],"phonetic":"/ˌprɑməˈneɪdərz/","extraExplanation":["“promenaders”是“promenader”的复数，来自法语“promener”（散步、带……走走）。英语里更常见的是动词/名词“promenade”（散步；散步道）以及名词“promenader”（散步者）。","语感上，“promenader”比“walker”更文雅、带一点“闲逛、观景、社交式散步”的意味；在描写海滨、林荫大道、度假胜地等场景时更常用。"]}
{"word":"promenades","summary":{"en":"“Promenades” usually means leisurely walks or the public walkways where people stroll (often by the sea).","zh":"“promenades”通常指悠闲的散步（复数）或人们散步的公共步道（常见于海滨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A leisurely walk, often taken in a public place for enjoyment or to be seen by others; also the place used for such walking (often along the sea).","zh":"（悠闲的）散步；（也可指）散步的场所/步道（常指海滨步道）。"},"examples":[{"en":"We went for an evening promenade along the beach.","zh":"我们傍晚沿着海边散步。"},{"en":"The city built a new promenade by the river for people to stroll.","zh":"这座城市在河边修建了一条新的步道供人们漫步。"},{"en":"On Sundays, families filled the promenade, chatting and enjoying the breeze.","zh":"周日时，许多家庭挤满步道，一边聊天一边享受微风。"}]},{"partOfSpeech":"v.","definition":{"en":"To walk in a relaxed way, especially in a public place; to stroll.","zh":"（在公共场所）悠闲地散步；漫步。"},"examples":[{"en":"After dinner, they promenaded through the park.","zh":"晚饭后，他们在公园里漫步。"},{"en":"Tourists like to promenade near the harbor at sunset.","zh":"游客喜欢在日落时分到港口附近散步。"}]}],"synonyms":["strolls","walks","ambles","saunters","boardwalks"],"phonetic":"/ˌprɑməˈnɑdz/","extraExplanation":["“promenades”通常是名词复数，来自法语 *promenade*，在英语里常带有“优雅地散步、在公共场合走走看看（也让别人看到）”的感觉。","在英国、法国等地，“the promenade”常特指海边的步道/滨海大道（海风、长椅、商店一带），在文学或旅行写作中很常见。","相关表达：*go for a stroll*（去散步，更口语）、*take a walk*（更中性）、*boardwalk*（木栈道，常见于海边/游乐区）。"]}
{"word":"promenading","summary":{"en":"Promenading means walking leisurely—often in public for pleasure—or parading something proudly.","zh":"Promenading 指悠闲散步（常在公共场合），也可指带点炫耀意味地展示、游行般走过。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to walk in a relaxed way, often in public, for pleasure or to be seen","zh":"（为消遣或让人看到而）悠闲散步；在公共场合漫步"},"examples":[{"en":"They spent the evening promenading along the waterfront.","zh":"他们沿着海滨悠闲地散步度过了傍晚。"},{"en":"People were promenading in the park after dinner.","zh":"晚饭后，人们在公园里散步。"}]},{"partOfSpeech":"v.","definition":{"en":"to show someone or something in a proud, noticeable way; to parade","zh":"（带着炫耀意味地）展示；夸示；游行般走过"},"examples":[{"en":"He was promenading his new suit as if he were on a runway.","zh":"他像走秀一样炫耀他的新西装。"},{"en":"She promenaded the award around the office for everyone to see.","zh":"她在办公室里拿着奖项走来走去，让大家都看到。"}]}],"synonyms":["strolling","walking","sauntering","parading","showing off"],"phonetic":"/ˌprɑːməˈneɪdɪŋ/","extraExplanation":["“promenading”是动词“promenade”的现在分词/动名词形式。更常见的口语说法是“walking”或“strolling”，而“promenade”更偏书面、带一点优雅或“在众人面前散步”的感觉。","在英美文化里，“promenade”常让人联想到海边或公园的步道（promenade），以及19世纪小说里人们穿着体面、边走边社交的场景。"]}
{"word":"promercantile","summary":{"en":"“Promercantile” means favoring mercantilist or strongly trade-centered, protectionist economic policies.","zh":"“promercantile”意为支持重商主义或偏向贸易中心、带保护主义色彩的经济政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring mercantilism or mercantile (trade-focused) economic policies","zh":"支持重商主义或偏向重商（以贸易为中心）的经济政策的"},"examples":[{"en":"The minister took a promercantile stance, arguing for tariffs to protect local manufacturers.","zh":"这位部长采取亲重商立场，主张用关税保护本地制造业。"},{"en":"Some historians describe the empire’s promercantile strategy as a way to control colonial trade.","zh":"一些历史学家把该帝国的亲重商策略描述为控制殖民地贸易的一种方式。"}]}],"synonyms":["pro-trade","pro-commerce","mercantilist","protectionist"],"phonetic":"/ˌproʊmərˈkænˌtaɪl/","extraExplanation":["“promercantile”由前缀 pro-（支持、赞成）+ mercantile（商业的、贸易的）构成，常用于政治经济讨论。","重商主义（mercantilism）多指16–18世纪欧洲常见的经济思想：强调出口、累积贵金属、保护本国工业，并常用关税与贸易管制。现代语境中说某人/某政策“promercantile”，通常是在说其偏好保护性贸易措施或以国家利益为导向的贸易政策。"]}
{"word":"promercy","summary":{"en":"“promercy / pro‑mercy” means supporting mercy or leniency (an uncommon, informal term).","zh":"“promercy / pro‑mercy”指“支持仁慈/宽恕、主张从轻”的立场（不常见、较口语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon, informal) Supporting or advocating mercy; favoring leniency instead of harsh punishment.","zh":"（不常见、非正式）支持“仁慈/宽恕”的；主张从轻处理、反对严厉惩罚的。"},"examples":[{"en":"Some activists take a pro‑mercy approach to criminal justice and argue for rehabilitation.","zh":"一些社会活动人士在刑事司法上采取“主张宽恕/从轻”的立场，强调改造与重返社会。"},{"en":"The judge’s pro‑mercy attitude led to a lighter sentence.","zh":"法官偏向宽恕的态度使判决更从轻。"}]},{"partOfSpeech":"n.","definition":{"en":"A stance or viewpoint that favors mercy or forgiveness.","zh":"主张仁慈/宽恕的立场或观点。"},"examples":[{"en":"Her speech was clearly pro‑mercy, asking the public to forgive the offender.","zh":"她的演讲明显是在呼吁宽恕，请公众原谅那名犯错者。"}]}],"synonyms":["merciful","lenient","compassionate","in favor of mercy","advocating clemency"],"phonetic":"/proʊ ˈmɝsi/","extraExplanation":["“promercy / pro‑mercy”并不是英语里的常用标准词，更常见的表达有：merciful（仁慈的）、lenient（宽容的/从轻的）、in favor of mercy（支持宽恕）、advocating clemency（主张赦免/宽大处理）。","前缀 pro- 常表示“支持/赞成”（如 pro-choice, pro-democracy）。因此 pro‑mercy 按构词逻辑可以理解为“支持宽恕/仁慈”。正式写作中建议改用更常见的词或短语。"]}
{"word":"promerger","summary":{"en":"“Promerger” (often written “pro-merger”) means supporting a merger, or a supporter of a merger.","zh":"“promerger”（常写作“pro-merger”）指支持合并的（立场），也可指支持合并的人/团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring a merger (especially of companies or organizations).","zh":"支持或赞成（尤其是公司、机构）合并的。"},"examples":[{"en":"The board took a pro-merger stance after reviewing the financial projections.","zh":"董事会在审阅财务预测后采取了支持合并的立场。"},{"en":"Pro-merger shareholders argued that the deal would strengthen the company’s competitiveness.","zh":"支持合并的股东认为这笔交易将增强公司的竞争力。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports a merger.","zh":"支持合并的人或团体。"},"examples":[{"en":"The pro-mergers emphasized long-term growth rather than short-term costs.","zh":"支持合并的一方强调长期增长，而不是短期成本。"}]}],"synonyms":["in favor of a merger","merger-supporting","for the merger"],"phonetic":"/ˌproʊˈmɝːdʒɚ/","extraExplanation":["常见写法是带连字符的“pro-merger”，也会看到合写“promerger”。“pro-”表示“支持/赞成”，如 pro-democracy（支持民主）。","多用于商业新闻与金融语境：merger（合并）与 acquisition（收购）常一起出现，合称 M&A（并购）。“pro-merger”常用来描述立场（pro-merger vs. anti-merger）。"]}
{"word":"promeristem","summary":{"en":"A very young, earliest-stage meristem at a plant’s growing tip or embryo that gives rise to other tissues.","zh":"植物生长点或胚中最早期的分生组织，能分裂并进一步分化形成其他组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The earliest, very young meristem (actively dividing plant tissue) at a growing tip or in an embryo, from which other meristems and tissues develop.","zh":"原分生组织；植物生长点或胚中最早期、最幼嫩的分生组织（能不断分裂的组织），可进一步分化形成其他分生组织与各种组织。"},"examples":[{"en":"In the shoot tip, the promeristem produces new cells that later form leaves and stems.","zh":"在茎尖处，原分生组织产生新细胞，随后形成叶和茎等结构。"},{"en":"Under a microscope, the promeristem looks like a small region of tightly packed, actively dividing cells.","zh":"在显微镜下，原分生组织看起来像一小块细胞紧密排列、分裂活跃的区域。"},{"en":"Damage to the promeristem can slow or stop a plant’s growth.","zh":"如果原分生组织受损，植物生长可能会变慢甚至停止。"}]}],"synonyms":["primordial meristem","embryonic meristem"],"phonetic":"/ˌproʊməˈrɪstəm/","extraExplanation":["“meristem（分生组织）”指植物中负责生长的细胞群；“promeristem（原分生组织）”强调“最早期/最原始”的那一段，常出现在根尖、茎尖或胚的生长区域。","在一些教材中，它与“apical meristem（顶端分生组织）”有关：可把promeristem理解为顶端分生组织中最核心、最幼嫩、分裂最旺盛的部分。"]}
{"word":"promerit","summary":{"en":"Promerit is an archaic verb meaning “to deserve or earn.”","zh":"promerit 是一个古义动词，意思是“应得；值得获得”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to deserve or earn (something), usually praise, reward, or blame.","zh":"（古义）应得；值得获得（通常指表扬、奖励或责备）。"},"examples":[{"en":"Her years of service promerit respect.","zh":"她多年的服务值得尊重。"},{"en":"Such actions promerit punishment, not praise.","zh":"这种行为应得惩罚，而不是表扬。"}]}],"synonyms":["deserve","earn","merit"],"phonetic":"/proʊˈmɛrɪt/","extraExplanation":["“promerit”在现代英语中非常少见，多见于古文或仿古的正式写作里；现代英语更常用的表达是“deserve / earn / merit”。","词源上与拉丁语“promerēre”（通过服务或功劳而获得、应得）有关，因此常带有“凭功劳应得”的语感。"]}
{"word":"promeritor","summary":{"en":"A rare word meaning a person who deserves reward or praise (a deserving person/benefactor).","zh":"一个罕见词，指有功之人：值得奖赏或称赞的人（功臣/恩人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/obsolete) A person who merits reward or praise; a benefactor or someone who has earned recognition.","zh":"（罕见/古用）有功之人；值得奖赏或称赞的人；恩人/功臣。"},"examples":[{"en":"In some older religious writings, a “promeritor” is described as someone whose good deeds deserve honor.","zh":"在一些较早的宗教著作中，“promeritor”指的是善行值得被尊崇的人。"},{"en":"The chronicler thanked the town’s promeritors for rebuilding the school after the fire.","zh":"编年史作者感谢城镇的功臣们在火灾后重建了学校。"}]}],"synonyms":["benefactor","deserving person","someone who merits praise","creditworthy person"],"phonetic":"/proʊˈmɛrɪtər/","extraExplanation":["“promeritor”在现代英语里几乎不用，更多见于早期宗教或学术文本中。词源上可追溯到拉丁语 promereri（通过功劳“获得/应得”），核心含义是“因功劳而值得奖励”。在当代更常用的表达包括: benefactor（恩人/捐助者）, someone who deserves credit（值得称赞的人）, deserving person（有功之人）。"]}
{"word":"promerops","summary":{"en":"Promerops is the scientific genus name for South African sugarbirds, nectar-feeding birds with long tails.","zh":"Promerops 是南非糖鸟的学名属名，常指吸食花蜜、尾羽较长的糖鸟类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South African birds called sugarbirds, known for feeding on nectar and having long tails (especially the Cape sugarbird and Gurney’s sugarbird).","zh":"糖鸟属（Promerops）：一种产于南非的鸟类属，常吸食花蜜，尾羽很长（代表种如开普糖鸟与格尼糖鸟）。"},"examples":[{"en":"The genus Promerops includes the Cape sugarbird, a common sight in fynbos habitats.","zh":"糖鸟属（Promerops）包括开普糖鸟，在芬波斯灌丛生境中较常见。"},{"en":"Promerops species help pollinate certain flowering plants by feeding on nectar.","zh":"糖鸟属的一些物种通过吸食花蜜帮助某些开花植物传粉。"}]}],"synonyms":["sugarbird (common name)"],"phonetic":"ˈproʊməˌrɑps","extraExplanation":["“Promerops”是鸟类学中的拉丁化属名，常见于科学写作与野外观察记录中；日常英语里更常说“sugarbird（糖鸟）”。","属名可能由希腊语词根构成（如 pro- 与 merops 等相关词根），属于学名命名传统的一部分；一般不用于比喻义或口语表达。"]}
{"word":"prometacenter","summary":{"en":"“prometacenter” is not a standard English word; it is likely a proper name such as “Prometa Center/PrometaCenter.”","zh":"“prometacenter”不是标准英语词，更可能是如“Prometa Center/PrometaCenter”的专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard term; most likely a proper name (a company/product/service) written as one word, e.g., “Prometa Center” or “PrometaCenter.” It is not a common dictionary word in English.","zh":"非标准词；更可能是专有名词（公司/产品/服务名称）被连写成一个词，例如“Prometa Center”或“PrometaCenter”。它不是英语里的常见词典词汇。"},"examples":[{"en":"I couldn’t find “prometacenter” in a dictionary—do you mean “Prometa Center” (a brand name)?","zh":"我在词典里找不到“prometacenter”——你是指“Prometa Center”（品牌名）吗？"},{"en":"Please send the official link for PrometaCenter so we can confirm what it refers to.","zh":"请把PrometaCenter的官网吗发我一下，我们好确认它具体指什么。"}]}],"synonyms":["(none; likely a proper name)"],"phonetic":"/proʊˈmɛtəˌsɛn.tɚ/","extraExplanation":["“prometacenter”看起来像把两个词连在一起写了。英语里常见的是“X Center”（某某中心），而不是一个固定词汇。","如果你本来想表达的是“data center（数据中心）”“medical center（医疗中心）”“meta center（元/综合中心）”之类的通用词，也可能是拼写或自动纠错导致的。","如果你能提供一句包含它的原句、或它出现的网站/文件名，我可以更准确地判断它的含义与用法。"]}
{"word":"promethazine","summary":{"en":"Promethazine is a prescription antihistamine used for allergies, nausea/vomiting (including motion sickness), and sedation.","zh":"Promethazine（异丙嗪）是一种处方抗组胺药，用于过敏、恶心/呕吐（含晕动症）以及镇静。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prescription antihistamine medicine used to treat allergy symptoms (like itching or runny nose), nausea/vomiting (including motion sickness), and sometimes to cause sedation (sleepiness).","zh":"一种处方抗组胺药，用于缓解过敏症状（如瘙痒、流鼻涕）、预防或治疗恶心/呕吐（包括晕车晕船），有时也用于镇静（使人嗜睡）。"},"examples":[{"en":"The doctor prescribed promethazine for her severe nausea.","zh":"医生给她开了异丙嗪来缓解严重恶心。"},{"en":"Promethazine can make you sleepy, so don’t drive after taking it.","zh":"异丙嗪可能让人犯困，所以服用后不要开车。"},{"en":"He took promethazine before the boat trip to prevent motion sickness.","zh":"他在坐船前服用了异丙嗪来预防晕船。"}]}],"synonyms":["antihistamine","antiemetic","sedative (effect)"],"phonetic":"/proʊˈmɛθəˌzin/","extraExplanation":["“Promethazine”是药物通用名（generic name），常见商品名之一是 Phenergan；不同国家/地区可能有不同商品名。","它常见的不良反应包括嗜睡、口干、头晕；与酒精、安眠药、阿片类止痛药等合用会更容易过度镇静或呼吸抑制，应遵医嘱。","儿童与老年人对镇静与副作用更敏感；尤其是幼儿使用需严格遵医嘱（一些地区对特定年龄段有明确警示/限制）。","在部分地区，含异丙嗪的“止咳/感冒复方”或与其他药物混用可能带来滥用风险；用药前确认成分与剂量很重要。"]}
{"word":"promethea","summary":{"en":"Promethea is a name linked to Prometheus, and it is also the title/heroine of Alan Moore’s comic series.","zh":"Promethea既可指与普罗米修斯相关的名字（女性化形式/象征性用名），也常指Alan Moore的漫画系列《Promethea》及其女主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine form of the name Prometheus; sometimes used as a literary or symbolic name connected to the Greek myth of Prometheus (a figure linked with fire, knowledge, and rebellion).","zh":"Prometheus（普罗米修斯）的女性化形式；有时作为文学或象征性名字使用，与希腊神话中“普罗米修斯”（象征火、知识与反抗）的意涵相关。"},"examples":[{"en":"In the poem, Promethea represents the gift of knowledge to humanity.","zh":"在这首诗中，Promethea象征把知识赠予人类。"},{"en":"The author chose the name Promethea to suggest creativity and defiance.","zh":"作者选用Promethea这个名字，暗示创造力与不屈精神。"}]},{"partOfSpeech":"n.","definition":{"en":"the title of a well-known comic/graphic novel series (and its main heroine) by Alan Moore and J. H. Williams III.","zh":"著名漫画/图像小说系列《Promethea》的标题（以及其中女主角的名字），作者为Alan Moore与J. H. Williams III。"},"examples":[{"en":"I started reading Promethea because I love Alan Moore’s storytelling.","zh":"我开始读《Promethea》，因为我喜欢Alan Moore的叙事风格。"},{"en":"Promethea blends superhero ideas with mythology and symbolism.","zh":"《Promethea》把超级英雄元素与神话、象征体系融合在一起。"}]}],"synonyms":["Prometheus (related name)"],"phonetic":"/proʊˈmiːθiə/","extraExplanation":["“Promethea”源自“Prometheus（普罗米修斯）”这一希腊神话人物的名字变体。普罗米修斯因“盗火赠人”而常被解读为人类文明、启蒙与反抗权威的象征，因此“Promethea”在文学或流行文化中常带有“灵感/知识/创造力”的联想。","Alan Moore的《Promethea》在英语文化圈里很有名，作品大量使用神话、塔罗、卡巴拉等象征系统；如果你在阅读讨论区或书单里看到“Promethea”，通常指的就是这部作品而不只是人名。"]}
{"word":"promethean","summary":{"en":"Promethean describes something boldly innovative or transformative, linked to Prometheus and often implying great risk or consequences.","zh":"Promethean 指“普罗米修斯式的”：大胆创新、带来变革，常暗含风险或代价。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Prometheus (a figure in Greek myth) or to his qualities, especially bringing new knowledge or technology to people, often with risk or suffering.","zh":"与希腊神话中的普罗米修斯有关；或指其特质，尤指把新知识/技术带给人类，常伴随风险或代价。"},"examples":[{"en":"The novel portrays a Promethean scientist who tries to remake life in the lab.","zh":"这部小说塑造了一位“普罗米修斯式”的科学家，试图在实验室里重造生命。"},{"en":"Her Promethean ambition pushed the team to attempt what no one had tried before.","zh":"她那种“普罗米修斯式”的雄心推动团队去尝试前所未有的事情。"}]},{"partOfSpeech":"adj.","definition":{"en":"Boldly creative, revolutionary, or radically innovative (often used in formal writing).","zh":"（较正式）大胆创新的、革命性的、突破性的。"},"examples":[{"en":"The company is known for its Promethean approach to renewable energy.","zh":"这家公司以其在可再生能源上的突破性思路而闻名。"},{"en":"It was a Promethean leap in design, but it also created new problems.","zh":"这在设计上是一次巨大飞跃，但也带来了新问题。"}]}],"synonyms":["innovative","visionary","revolutionary","trailblazing","bold","groundbreaking"],"phonetic":"/prəˈmiːθiən/","extraExplanation":["“Promethean”来自希腊神话的普罗米修斯（Prometheus）：他把火带给人类，因此受到惩罚。所以这个词常带有“为人类带来进步但付出代价/引发后果”的意味。","文学语境中常见于讨论《弗兰肯斯坦》（Mary Shelley）等作品：创造者像普罗米修斯一样“赋予生命/力量”，却也要面对伦理与后果。"]}
{"word":"Prometheus","summary":{"en":"Prometheus is a figure from Greek myth who brought fire to humans; in modern English it can also mean a rebel or benefactor who brings progress at personal cost.","zh":"Prometheus 指希腊神话中盗火赠人的普罗米修斯；现代英语中也可指为带来进步而反抗权威、并付出代价的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Titan who stole fire from the gods and gave it to humans, often seen as a symbol of rebellion, intelligence, and sacrifice for humanity.","zh":"（希腊神话）普罗米修斯：泰坦之一，盗取天火赠予人类，常被视为反抗权威、智慧与为人类牺牲的象征。"},"examples":[{"en":"In the myth, Prometheus gives fire to humans, which represents knowledge and progress.","zh":"在神话中，普罗米修斯把火带给人类，象征知识与进步。"},{"en":"Some writers describe a brave scientist as a modern Prometheus.","zh":"一些作家会把勇敢的科学家称为“现代的普罗米修斯”。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A person who challenges authority to bring new knowledge, freedom, or progress to others, often at great personal cost.","zh":"（引申）为他人带来新知识、自由或进步而挑战权威的人，往往要付出很大代价。"},"examples":[{"en":"She became a Prometheus figure for her community, fighting for education despite the risks.","zh":"她成了社区里的“普罗米修斯式人物”，冒着风险为教育而奋斗。"},{"en":"The article praises the inventor as a Prometheus who changed everyday life.","zh":"文章称赞这位发明家是改变日常生活的“普罗米修斯”。"}]}],"synonyms":["benefactor","rebel","champion","icon","Titan (myth)","culture hero"],"phonetic":"/prəˈmiːθiəs/","extraExplanation":["“Prometheus”来自希腊语词根，常被解释为“先见/预见”（与“Epimetheus”对照，常被解释为“后见/事后才明白”）。","在英语文化中，“a modern Prometheus（现代普罗米修斯）”是一个常见典故，最著名的文学例子是玛丽·雪莱《Frankenstein; or, The Modern Prometheus》（《弗兰肯斯坦，或现代普罗米修斯》），用来讨论科技创造、责任与代价。","常见相关表达：“Promethean”（形容词）意为“普罗米修斯式的；大胆创新、改变世界的（常带有代价或风险的含义）”。"]}
{"word":"prometheus","summary":{"en":"Prometheus is a Greek myth figure who stole fire for humans; the name also means a daring bringer of knowledge or progress.","zh":"普罗米修斯是希腊神话中为人类盗火的角色；引申为敢于带来知识或进步、但可能付出代价的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Titan who created humans (in some stories) and stole fire from the gods to give it to humanity, symbolizing knowledge, progress, and rebellion against tyranny.","zh":"（希腊神话）普罗米修斯：泰坦神（有些版本说他创造了人类），为人类盗取天火，象征知识、进步，以及对专制权力的反抗。"},"examples":[{"en":"In the myth, Prometheus gives fire to humans, changing their future.","zh":"在神话中，普罗米修斯把火带给人类，改变了人类的未来。"},{"en":"Many writers use Prometheus as a symbol of sacrifice for human progress.","zh":"许多作家把普罗米修斯当作“为人类进步而牺牲”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbolic name for a person who brings new knowledge or technology, often at great personal risk or punishment.","zh":"（引申义）“普罗米修斯式的人物”：带来新知识或新技术的人，常常要承担巨大的个人风险甚至惩罚。"},"examples":[{"en":"Some people called the scientist a modern Prometheus for challenging accepted ideas.","zh":"有人称那位科学家为“现代的普罗米修斯”，因为他挑战了被普遍接受的观念。"},{"en":"The film portrays her as a Prometheus figure who pays a high price for discovery.","zh":"这部电影把她塑造成“普罗米修斯式人物”，为发现付出高昂代价。"}]}],"synonyms":["(figurative) benefactor","(figurative) pioneer","(figurative) bringer of fire/knowledge"],"phonetic":"/prəˈmiːθiəs/","extraExplanation":["“Prometheus”源自古希腊语，常被解释为“先见/预见”（与他的兄弟 Epimetheus “后见”形成对照）。","他因盗火受罚：被锁在高加索山，鹰每天啄食他的肝脏，夜里又再生，象征无尽的折磨与代价。","文学与文化中很常见：玛丽·雪莱《弗兰肯斯坦》的副标题是《现代普罗米修斯》（The Modern Prometheus），借此讨论“创造生命/科学野心”的伦理与后果。"]}
{"word":"Promethium","summary":{"en":"Promethium (Pm) is a rare radioactive chemical element.","zh":"钷（Pm）是一种稀有的放射性化学元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Pm) that is a rare, radioactive metal in the lanthanide series","zh":"化学元素“钷”（符号 Pm），一种稀有的放射性金属，属于镧系元素"},"examples":[{"en":"Promethium is a radioactive element, so it must be handled with strict safety rules.","zh":"钷是一种放射性元素，因此必须在严格的安全规范下处理。"},{"en":"The symbol for promethium is Pm on the periodic table.","zh":"在元素周期表上，钷的符号是 Pm。"}]}],"synonyms":["Pm","element"],"phonetic":"/prəˈmiːθiəm/","extraExplanation":["“Promethium”来自希腊神话人物普罗米修斯（Prometheus），他把火带给人类；这种命名常用来暗示“能量/火/光”。","钷在自然界中非常稀少，通常是由核反应或其他放射性衰变过程产生，因此日常生活中很少接触到。"]}
{"word":"promethium","summary":{"en":"Promethium is a radioactive rare-earth chemical element (Pm).","zh":"promethium 指放射性的稀土元素“钷”（Pm）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Pm) that is a radioactive rare-earth metal; it does not occur in large natural amounts and is mainly produced in nuclear reactors for scientific and industrial uses","zh":"（化学元素）钷（符号 Pm），一种放射性的稀土金属；自然界中含量极少，主要在核反应堆中人工制备，用于科研与工业"},"examples":[{"en":"Promethium is a rare-earth element with the symbol Pm.","zh":"钷是一种稀土元素，符号为 Pm。"},{"en":"Because promethium is radioactive, it must be handled with care in laboratories.","zh":"由于钷具有放射性，在实验室中必须谨慎处理。"}]}],"synonyms":["Pm (chemical symbol)","element 61 (informal)"],"phonetic":"/proʊˈmiːθiəm/","extraExplanation":["钷的英文名 promethium 来自希腊神话人物 Prometheus（普罗米修斯），他把“火”带给人类；这与钷的“放射性发光/能量”联想有关。","它是元素周期表中原子序数 61 的元素。由于所有同位素都有放射性且半衰期有限，钷在自然界很难长期大量存在。"]}
{"word":"promic","summary":{"en":"“Promic” isn’t a standard English word. It’s often a typo for “pro mic” (professional microphone) or “promise.”","zh":"“promic”不是标准英文词，常见是把“pro mic（专业麦克风）”或“promise（承诺）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) A common misspelling or typing of “pro mic” or other similar-looking words (often “promise”).","zh":"（不是标准英语单词）常见的拼写/输入错误，可能想写“pro mic”（专业麦克风）或其他相近的词（常见如“promise”）。"},"examples":[{"en":"I couldn’t find “promic” in the dictionary—did you mean “pro mic” or “promise”?","zh":"我在词典里找不到“promic”——你是想写“pro mic”还是“promise”吗？"}]},{"partOfSpeech":"phrase","definition":{"en":"“pro mic”: a professional-quality microphone (used for recording, broadcasting, or performance).","zh":"“pro mic”：专业级麦克风（用于录音、播音或演出）。"},"examples":[{"en":"For podcasts, a pro mic can make your voice sound clearer.","zh":"做播客时，专业麦克风能让你的声音更清晰。"},{"en":"She brought a pro mic to record the interview.","zh":"她带了专业麦克风来录这次采访。"}]}],"synonyms":["professional microphone","studio mic","broadcast mic"],"phonetic":"/ˈproʊ ˌmaɪk/","extraExplanation":["“promic”本身不是常见或标准的英文拼写，所以最实用的做法是先确认你想表达的意思。","如果你想说“承诺”，正确拼写是 promise；如果你想说“专业麦克风”，更常见写法是 pro mic（两个词），也可以写作 pro-mic（带连字符）。"]}
{"word":"promilitarism","summary":{"en":"Promilitarism means supporting or promoting strong military power and influence.","zh":"promilitarism 指支持或宣扬强化军事力量与军事影响的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for or advocacy of strong military power, military values, or increased military spending and influence in society and politics.","zh":"亲军国主义；支持或提倡强化军事力量、军事价值观，或提升军费与军方在社会政治中的影响力。"},"examples":[{"en":"Some commentators criticized the movie for promoting promilitarism.","zh":"一些评论者批评这部电影在宣扬亲军国主义。"},{"en":"The candidate’s promilitarism appealed to voters who prioritized national security.","zh":"这位候选人的亲军国主义立场吸引了重视国家安全的选民。"},{"en":"In schools, critics argued that certain programs encouraged promilitarism rather than civic debate.","zh":"在学校里，批评者认为某些项目是在鼓励亲军国主义，而不是促进公民讨论。"}]}],"synonyms":["pro-military stance","militaristic ideology","military advocacy","hawkishness"],"phonetic":"/ˌproʊˈmɪləˌtɛrɪzəm/","extraExplanation":["“pro-”表示“支持/赞成”，“militarism”指“军国主义”（强调军事力量与军事价值在国家与社会中的主导地位）。“promilitarism”常用于政治评论、媒体批评或学术讨论，语气往往带评价色彩。","在公共话语中，它常与“nationalism（民族主义）”“patriotism（爱国主义）”一起出现，但含义不同：爱国主义不一定主张军事优先，而“promilitarism”更强调对军事扩张、军费增长或军事介入的支持。"]}
{"word":"promilitarist","summary":{"en":"Promilitarist means supporting the military or favoring a strong military role in society and politics.","zh":"promilitarist 指“亲军方的/支持军事力量的”，强调主张军队或军事力量在社会与政治中更强势。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the military, military power, or a strong role for the armed forces in politics and society","zh":"亲军方的；支持军事力量或主张军队在政治与社会中扮演强势角色的"},"examples":[{"en":"The candidate’s promilitarist speeches appealed to voters who wanted a tougher national defense.","zh":"这位候选人亲军方的演讲吸引了希望加强国防的选民。"},{"en":"Some critics called the school program promilitarist because it celebrated war without discussing its costs.","zh":"一些批评者称这项学校项目“亲军方”，因为它歌颂战争却不谈其代价。"}]}],"synonyms":["pro-military","militaristic","hawkish","pro-defense"],"phonetic":"/ˌproʊˈmɪləˌtɛrɪst/","extraExplanation":["“promilitarist”常用于政治与社会评论语境，带有评价色彩：说话者可能在赞许（强调安全与威慑）或批评（担心军国主义、战争美化、军方过度影响政治）。","词形结构：pro-（支持、赞成）+ militarist（军国主义者/军事主义的）。日常写作中更常见的近义表达是“pro-military”。"]}
{"word":"promilitary","summary":{"en":"Promilitary means supportive of the military or favoring military influence or policies.","zh":"promilitary 指“亲军的/支持军队的”，也可指在表达或呈现上偏向赞美军事与军方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring the military, military policies, or military influence in government and society.","zh":"支持军队、军事政策，或赞成军方在政府与社会中拥有更大影响力的。"},"examples":[{"en":"The senator is known for his promilitary stance and strong defense spending proposals.","zh":"这位参议员以亲军立场和强调增加国防开支的提案而闻名。"},{"en":"Some voters liked the promilitary message, while others worried it could lead to more conflict.","zh":"一些选民喜欢这种亲军讯息，但也有人担心这会导致更多冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"Characterized by positive portrayals of the military (for example, in media, art, or education).","zh":"（媒体、艺术或教育等中）带有赞美军队、正面呈现军人的倾向的。"},"examples":[{"en":"The film was criticized as promilitary propaganda by some reviewers.","zh":"一些影评人批评这部电影带有亲军宣传色彩。"},{"en":"The museum exhibit takes a more promilitary approach, focusing on heroism and service.","zh":"这场博物馆展览更偏亲军，强调英勇与服役精神。"}]}],"synonyms":["pro-military","militaristic (often more negative)","hawkish (political context)","pro-defense"],"phonetic":"/ˌproʊˈmɪləˌtɛri/","extraExplanation":["拼写上常见两种形式：promilitary 与 pro-military。带连字符的形式在正式写作中更常见，也更容易一眼看出是“pro-（支持）+ military（军队）”的组合。","语气与立场：promilitary 通常用于描述政治立场或价值取向，可能是中性描述，也可能带批评意味（取决于语境和说话者态度）。如果只是说“支持军人/退伍军人福利”，英语里也常用 pro-veteran 或 supportive of service members，以避免被理解为支持军方政治影响力。"]}
{"word":"promin","summary":{"en":"“Prominent” means either (1) well-known/important or (2) clearly noticeable or sticking out.","zh":"“prominent”可指（1）著名的、重要的；也可指（2）显眼的、突出的/凸起的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Important, famous, or well-known (often in public life, a field, or a community).","zh":"重要的；著名的；显赫的（常指在公众领域、某行业或某个群体中）。"},"examples":[{"en":"She is a prominent scientist in cancer research.","zh":"她是癌症研究领域的一位著名科学家。"},{"en":"The article quoted several prominent leaders.","zh":"这篇文章引用了几位知名领袖的话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sticking out so it is easy to see; noticeable or projecting outward.","zh":"突出的；显眼的；凸起的（指容易被看到或向外凸出）。"},"examples":[{"en":"The building has a prominent tower you can see from far away.","zh":"那座建筑有一座很显眼的塔，远远就能看到。"},{"en":"He has a prominent nose.","zh":"他的鼻子很挺（很突出）。"}]}],"synonyms":["well-known","famous","notable","leading","outstanding","conspicuous","noticeable"],"phonetic":"/ˈprɑmənənt/","extraExplanation":["你输入的“promin”通常不是一个完整单词，更常见的是“prominent”（形容词：著名的/突出的）。在写作或查词时，建议使用完整形式“prominent”。","词源提示：prominent 来自拉丁语词根，含义与“向前/向外（pro-）+ 突出（-min-）”有关，因此既可以表示“显眼、突出”，也引申为“显赫、重要”。"]}
{"word":"promine","summary":{"en":"“Promine” is usually a misspelling of “prominent” (important, famous, or easy to notice).","zh":"“promine”通常是把“prominent”拼错了（意为重要的、著名的或显眼的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely a misspelling) “prominent”: important, well-known, or easily noticed.","zh":"（可能是拼写错误）prominent：重要的；著名的；显眼的。"},"examples":[{"en":"She is a prominent scientist in her field.","zh":"她是该领域的一位著名科学家。"},{"en":"The scar is prominent on his left cheek.","zh":"疤痕在他左脸颊上很显眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a feature) sticking out; projecting outward.","zh":"（指外形特征）突出的；向外凸起的。"},"examples":[{"en":"He has prominent cheekbones.","zh":"他的颧骨很突出。"},{"en":"The building has a prominent front balcony.","zh":"这栋楼有一个很突出的前阳台。"}]}],"synonyms":["important","well-known","notable","leading","conspicuous","outstanding"],"phonetic":"/ˈprɑmənənt/","extraExplanation":["“promine”在现代英语中不是常见单词；最常见的情况是把“prominent”少打了字母“nt”。如果你想表达“突出/使突出”，也可能是在找动词“protrude（伸出）”或“promote（促进/提拔）”。你可以告诉我你看到它的句子，我能帮你确认。"]}
{"word":"prominen","summary":{"en":"Prominent means well-known/important or easily noticed; it can also mean physically sticking out.","zh":"Prominent 表示“著名的/重要的/显眼的”，也可指“（外形）突出的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Important, well-known, or easily noticed.","zh":"重要的；著名的；显眼的。"},"examples":[{"en":"She is a prominent scientist in the field of genetics.","zh":"她是遗传学领域一位著名的科学家。"},{"en":"The tower is prominent on the skyline.","zh":"那座塔在天际线上非常显眼。"},{"en":"Education plays a prominent role in their community.","zh":"教育在他们的社区中起着重要作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sticking out from a surface; projecting outward.","zh":"突出的；凸起的。"},"examples":[{"en":"He has a prominent chin.","zh":"他的下巴很突出。"},{"en":"A prominent ridge runs along the edge of the roof.","zh":"屋顶边缘有一道明显突起的脊。"}]}],"synonyms":["well-known","notable","important","leading","conspicuous","outstanding"],"phonetic":"/ˈprɑmənənt/","extraExplanation":["你输入的“prominen”不完整/可能是拼写错误；最常见的目标词是 **prominent**（显著的、著名的）。如果你其实想查 **prominence**（名词：声望；显著），告诉我我也可以按那个词条解释。","词根小提示：*prominent* 来自拉丁语 *prominere*（向前突出），所以它既可以指“物理上突出”，也可以引申为“地位/作用突出”。"]}
{"word":"prominence","summary":{"en":"Prominence means being well-known or important, or a physical part that sticks out.","zh":"Prominence 指“显著/重要/知名”，也可指“凸起物、突出的部分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being important, famous, or easily noticed","zh":"显著；重要性；知名度"},"examples":[{"en":"She rose to prominence after her first novel became a bestseller.","zh":"她的第一部小说成为畅销书后，声名鹊起。"},{"en":"The issue gained prominence during the election.","zh":"这个议题在选举期间变得格外受关注。"}]},{"partOfSpeech":"n.","definition":{"en":"a part that sticks out or is higher than the area around it","zh":"突起物；凸出部分"},"examples":[{"en":"A bony prominence on his shoulder was visible under the skin.","zh":"他肩膀上有一处骨性突起，皮肤下清晰可见。"},{"en":"The building’s entrance has a stone prominence above the doorway.","zh":"这栋建筑的入口在门口上方有一处石制凸起装饰。"}]}],"synonyms":["importance","fame","notability","visibility","distinction"],"phonetic":"/ˈprɑmənəns/","extraExplanation":["词根提示：prominence 来自 prominent（显著的、杰出的）。pro- 有“向前”的感觉，-min- 与“突出/伸出”相关，所以既可以表示“引人注目（地位、名声）”，也可以表示“物理上的凸起”。","常见搭配：rise to prominence（崭露头角/声名鹊起）、gain prominence（变得重要/受到重视）、give prominence to（强调、突出某事）。"]}
{"word":"prominences","summary":{"en":"“Prominences” is the plural of “prominence,” meaning importance/fame, a protruding visible feature, or (in astronomy) solar prominences.","zh":"“prominences”是“prominence”的复数，可指重要性/知名度、突出的部分/隆起物，或（天文）多个日珥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"important or noticeable positions, roles, or levels of fame; being widely seen or recognized","zh":"显赫地位；重要性；知名度（指被广泛看见或认可的程度）"},"examples":[{"en":"She rose to prominence after her first novel won a major award.","zh":"她的第一部小说获得重要奖项后，名声大噪。"},{"en":"In the report, environmental issues are given greater prominence than before.","zh":"在这份报告中，环境议题比以前更受重视。"},{"en":"Several local leaders gained national prominence during the crisis.","zh":"危机期间，几位地方领导人获得了全国性的关注与声望。"}]},{"partOfSpeech":"n.","definition":{"en":"things that stick out or are easy to see; especially raised parts of a surface or landscape","zh":"凸起物；突出的部分（尤指表面或地形上隆起、显眼的部分）"},"examples":[{"en":"The map highlights the prominences of the mountain ridge.","zh":"地图标出了山脊上突出的地形。"},{"en":"The sculpture’s sharp prominences catch the light.","zh":"这座雕塑的尖锐凸起处会反光。"}]},{"partOfSpeech":"n.","definition":{"en":"huge, bright arcs of hot gas extending from the Sun’s surface (in astronomy)","zh":"（天文）日珥：从太阳表面伸出的巨大明亮高温气体拱形结构"},"examples":[{"en":"Astronomers observed prominences along the edge of the Sun during the eclipse.","zh":"日食期间，天文学家在太阳边缘观测到日珥。"},{"en":"A solar storm can be linked to large prominences and eruptions.","zh":"太阳风暴可能与巨大的日珥及喷发有关。"}]}],"synonyms":["importance","visibility","notability","eminence","salience","projection","protrusion"],"phonetic":"/ˈprɑmənəns/","extraExplanation":["“prominences”是“prominence”的复数。日常语境里更常用单数来谈“成名/重要性”（gain/achieve prominence；give prominence to）。复数多用于强调“多个突出的方面/多个显眼点”，或用于天文学里的多个“日珥”。","搭配提示：give something prominence（让某事更突出/更受关注）；come to prominence（崭露头角）；rise to prominence（声名鹊起）。"]}
{"word":"prominency","summary":{"en":"Prominency means prominence: being important or easily noticed; it can also mean a physical protrusion.","zh":"prominency（较少用）基本同 prominence：指显著/重要/知名，也可指（身体或地形）突出部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being important, well-known, or easily noticed.","zh":"显著性；重要性；知名度（指重要、出名或很显眼的状态）。"},"examples":[{"en":"She rose to prominency after her first novel became a bestseller.","zh":"她的第一部小说成为畅销书后，便声名鹊起。"},{"en":"The issue gained prominency during the election.","zh":"这个议题在选举期间变得格外受关注。"}]},{"partOfSpeech":"n.","definition":{"en":"A noticeable projection or feature on a surface, especially on the body or in geography.","zh":"突出部；凸起处（尤指身体或地形上明显的突起）。"},"examples":[{"en":"The artist emphasized the prominency of the cheekbones in the portrait.","zh":"画家在肖像中强调了颧骨的突出。"},{"en":"A rocky prominency jutted out over the sea.","zh":"一块岩石突出部伸向海面。"}]}],"synonyms":["prominence","importance","notability","standing","salience","projection","protrusion"],"phonetic":"/ˈprɑmənənsi/","extraExplanation":["“prominency”在现代英语中相对少见，更多情况下人们使用“prominence”。两者意思基本相同，但在学术写作、新闻与日常表达里，“prominence”更自然、更常见。","词源上与拉丁语词根有关：pro-（向前）+ minere（突出）。因此它既能表示“显眼/突出（物理上）”，也能引申为“显赫/重要（社会意义上）”。"]}
{"word":"prominent","summary":{"en":"Prominent means “well-known/important” or “easy to notice, sticking out.”","zh":"Prominent 表示“著名重要的”，也可指“显眼或凸出的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"well-known and important; easily noticed","zh":"著名的；重要的；显眼的"},"examples":[{"en":"She is a prominent scientist in the field of genetics.","zh":"她是遗传学领域一位著名的科学家。"},{"en":"The hotel stands in a prominent position near the river.","zh":"这家酒店坐落在河边一个显眼的位置。"}]},{"partOfSpeech":"adj.","definition":{"en":"sticking out from a surface; projecting","zh":"突出的；凸起的"},"examples":[{"en":"He has a prominent chin.","zh":"他有一个突出的下巴。"},{"en":"Be careful of the prominent nails on that board.","zh":"小心那块木板上凸出的钉子。"}]}],"synonyms":["well-known","notable","leading","distinguished","outstanding","conspicuous"],"phonetic":"/ˈprɑmənənt/","extraExplanation":["词源上，prominent 来自拉丁语 *prominere*（向前凸出）。因此它既可以表示“显眼/突出”的外形特征，也可以引申为“在社会地位、名声或影响力上突出”，即“著名、重要”。","常见搭配：prominent figure（重要人物）、prominent role（重要作用/角色）、prominent feature（显著特征）、prominent position（显要位置）。"]}
{"word":"prominently","summary":{"en":"“Prominently” means “in a very noticeable or important way.”","zh":"“prominently”表示“显眼地/突出地”或“重要地（占据显著位置）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is easily noticed or stands out; in a very visible or important position.","zh":"显眼地；突出地；在很显著或重要的位置上。"},"examples":[{"en":"The company’s logo is prominently displayed on the front door.","zh":"公司的标志显眼地展示在前门上。"},{"en":"She was prominently featured in the newspaper article.","zh":"她在那篇报纸文章中被重点报道。"},{"en":"Safety rules are posted prominently near the entrance.","zh":"安全规定被醒目地张贴在入口附近。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an important or well-known way; as a major part of something.","zh":"重要地；作为主要部分；以引人关注的方式。"},"examples":[{"en":"Climate change figures prominently in the debate.","zh":"气候变化在这场辩论中占据重要位置。"},{"en":"Education has prominently shaped his career path.","zh":"教育对他的职业道路起了重要作用。"}]}],"synonyms":["noticeably","conspicuously","clearly","visibly","in a prominent place"],"phonetic":"/ˈprɑmənəntli/","extraExplanation":["“prominently”来自形容词“prominent”（突出的、显著的）。常见搭配有：prominently displayed（醒目展示）、prominently featured（重点呈现/报道）、figure prominently（占重要地位）。","语体上较正式，新闻报道、说明文字、学术写作里很常见；日常口语也能用，但有时可用更简单的“clearly / in a noticeable way”替换。"]}
{"word":"promineo","summary":{"en":"promineo is a Latin verb meaning “I protrude / stand out,” not a common everyday English word.","zh":"promineo 是拉丁语动词，意思是“（我）凸出/显眼”，并不是常见的日常英文词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “I stand out / I project / I protrude.” Used to describe something sticking out or being prominent.","zh":"（拉丁语）“我凸出 / 我伸出 / 我显著。”用于描述某物向外突出、显眼。"},"examples":[{"en":"In Latin, promineo can mean “to protrude,” like a bone that sticks out.","zh":"在拉丁语中，promineo 可表示“凸出”，比如骨头向外突出。"},{"en":"Some anatomy texts use Latin-based terms to describe structures that promine.","zh":"一些解剖学资料会用拉丁语词根相关的术语来描述“突出的”结构。"}]}],"synonyms":["protrude","jut out","stick out","stand out"],"phonetic":"/proʊˈmɪni.oʊ/","extraExplanation":["promineo 是拉丁语动词（第一人称单数现在时），在英文里不算常用词；你更常见到的是英语形容词 prominent（显著的、突出的）或动词 protrude（突出）。","如果你想查的是英文单词，可能是把 prominent 拼成了 promineo。你可以告诉我你看到它的句子/出处，我也可以帮你确认。"]}
{"word":"promines","summary":{"en":"“Promines” is not standard English; it’s usually a misspelling of “promises.”","zh":"“promines”不是标准英语，通常是把“promises”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “promises.”","zh":"不是标准英语单词。最常见是把“promises（承诺/答应）”拼错了。"},"examples":[{"en":"Did you mean “promises” (not “promines”)?","zh":"你是想写“promises”（不是“promines”）吗？"},{"en":"Her promises sounded sincere.","zh":"她的承诺听起来很真诚。"}]},{"partOfSpeech":"other","definition":{"en":"“Promises” (correct form): plural noun of “promise” meaning commitments or assurances; also the third-person singular verb of “promise.”","zh":"“Promises”（正确拼写）：既可作名词复数，表示“承诺/许诺”；也可作动词第三人称单数，表示“答应/承诺”。"},"examples":[{"en":"He broke his promises.","zh":"他违背了自己的承诺。"},{"en":"She promises to call tonight.","zh":"她答应今晚打电话。"},{"en":"The dark clouds promise rain.","zh":"乌云预示着要下雨。"}]}],"synonyms":["commitments","pledges","assurances"],"phonetic":"/ˈprɑmɪsɪz/","extraExplanation":["“promines”常见于把 promises 拼错，或把 prominence（显著、突出）/prominent（著名的、显眼的）这些词的拼写混在一起。若你想表达“显著/突出”，更可能需要用 prominence / prominent，而不是 promises。"]}
{"word":"prominimum","summary":{"en":"“prominimum” is not standard English; it is likely a typo for “prominent” or “minimum.”","zh":"“prominimum”不是标准英语，通常是把“prominent”或“minimum”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often, it appears to be a misspelling or typo for “prominent” or “minimum,” or a mistaken blend of the two.","zh":"不是标准英语单词。最常见情况是拼写错误，可能想写“prominent（著名的/显著的）”或“minimum（最小值/最低限度）”，或把两者混在一起。"},"examples":[{"en":"(Nonstandard) prominimum → (Correct) prominent","zh":"（非标准）prominimum →（正确）prominent（显著的/知名的）"},{"en":"(Nonstandard) prominimum → (Correct) minimum","zh":"（非标准）prominimum →（正确）minimum（最小值/最低限度）"},{"en":"If you meant “minimum,” you could say: “The minimum age is 18.”","zh":"如果你想表达“minimum（最低限度）”，可以说：“The minimum age is 18.（最低年龄是18岁。）”"}]}],"phonetic":"/ˌproʊˈmɪnɪməm/","extraExplanation":["“prominimum”在常见词典与主流语料中基本不作为正规词条出现，因此写作或考试中建议避免使用。","你可以告诉我你想表达的意思或给出原句：\n- 想说“显著的/重要的/知名的”→ 用 prominent\n- 想说“最小值/最低要求”→ 用 minimum\n- 想说“有利于、倾向于（支持最小化）”这类意思→ 可能需要用短语（如 in favor of minimizing… / pro-minimum policy 等）"]}
{"word":"proministry","summary":{"en":"Proministry (often written pro-ministry) means supporting the government/ministries in parliamentary politics.","zh":"Proministry（常写作pro-ministry）指在议会政治语境中“亲政府/支持内阁”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the government (the ministry), especially in parliamentary politics","zh":"（尤指议会政治中）支持政府内阁/执政当局的"},"examples":[{"en":"Several pro-ministry lawmakers voted with the prime minister on the budget.","zh":"几位亲政府（支持内阁）的议员在预算案上与首相站在同一阵线。"},{"en":"The newspaper took a pro-ministry position during the debate.","zh":"那家报纸在辩论期间采取了亲政府的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a stance, group, or vote that supports the ministry (the government)","zh":"支持内阁/执政当局的立场、阵营或投票"},"examples":[{"en":"The bill passed with pro-ministry votes.","zh":"该法案在亲政府的投票支持下获得通过。"},{"en":"Pro-ministry forces organized to block the motion of no confidence.","zh":"亲政府力量组织起来阻止不信任案。"}]}],"synonyms":["pro-government","ministerial","government-supporting","pro-administration"],"phonetic":"/ˌproʊˈmɪnɪstri/","extraExplanation":["“ministry”在英联邦/议会制语境里常指“内阁、政府当局”（由首相及其大臣组成），不只是某个“部”（如教育部）。因此pro‑ministry相当于pro‑government/ministerial。","这种用法多见于较正式或历史性的政治写作（如报道议会投票、党派分裂、报刊立场）。现代新闻里更常用的说法是“pro-government”。","拼写上更常见的是带连字符的“pro-ministry”。写成一个词“proministry”较少见，容易与“prominence（显著）”等词混淆。"]}
{"word":"prominority","summary":{"en":"Pro-minority means supporting minority groups and their rights.","zh":"pro-minority 指支持少数群体及其权利的（常写作 pro-minority）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring minority groups, especially their rights and fair treatment in society or politics","zh":"支持少数群体（尤其是其权利与公平对待）的；亲少数族群的"},"examples":[{"en":"The senator is known for her pro-minority policies in education and voting rights.","zh":"这位参议员以其在教育与投票权方面的亲少数族群政策而闻名。"},{"en":"The organization runs pro-minority programs to reduce discrimination at work.","zh":"该组织开展亲少数群体项目，以减少职场歧视。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, idea, or policy that supports minority groups (less common use)","zh":"支持少数群体的人、观点或政策（较少见用法）"},"examples":[{"en":"In the debate, he positioned himself as a pro-minority.","zh":"在辩论中，他把自己定位为支持少数群体的一方。"}]}],"synonyms":["pro–civil rights","inclusive","equity-focused","anti-discrimination","minority-friendly"],"phonetic":"/ˌproʊməˈnɔːrəti/","extraExplanation":["“pro-minority”更常见，通常带连字符（pro- + minority），表示“支持……的”。不带连字符的写法“prominority”也能见到，但较少见，正式写作建议用“pro-minority”。","使用时语境常与公共政策、人权、反歧视、平等机会等话题相关。注意它描述立场，不等同于对某一具体少数族群的刻板印象或标签化。"]}
{"word":"promisable","summary":{"en":"“Promisable” means something can be promised or guaranteed (most common); rarely, it can describe someone who tends to make promises.","zh":"“promisable”主要指“可被承诺/保证的”；较少见地也可指“爱许诺的、容易作出承诺的（人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be promised; capable of being pledged or guaranteed","zh":"可被承诺的；可以许诺/保证的"},"examples":[{"en":"The seller must deliver only what is legally promisable in the contract.","zh":"卖方在合同中只能交付法律上可承诺的内容。"},{"en":"Not every benefit is promisable, especially when future conditions are uncertain.","zh":"并非每种利益都能被承诺，尤其是在未来条件不确定时。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) able or likely to make promises","zh":"（罕见）爱许诺的；可能会作出承诺的"},"examples":[{"en":"He was overly promisable in meetings and later struggled to deliver.","zh":"他在会议上太爱许诺，后来却很难兑现。"}]}],"synonyms":["promiseable","able to be promised","guaranteeable","pledgeable"],"phonetic":"/prəˈmaɪsəbəl/","extraExplanation":["“promisable”在日常英语中不常见，更常用的表达是“can be promised / able to be promised / promiseable（也较少见）”。在合同、政策或合规语境里，用“promisable”强调“某件事在规则允许的范围内能否被承诺”。"]}
{"word":"promiscuities","summary":{"en":"“Promiscuities” is the plural of “promiscuity,” usually referring to multiple instances of sexual casualness or, less commonly, careless mixing in a nonsexual sense.","zh":"“promiscuities”是“promiscuity”的复数，通常指多种/多次的性关系随意与不专一；较少见地也可指非性层面的随意混合或混搭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of promiscuity: having many casual sexual relationships, or (more generally) mixing with many different partners/choices without being selective","zh":"promiscuity 的复数：指有许多随意的性关系；或更广义地指“不加选择地混合/交往/搭配”"},"examples":[{"en":"The book discusses sexual promiscuities in the city during the 1920s.","zh":"这本书讨论了20世纪20年代城市中的性方面的“滥交/关系混乱”。"},{"en":"Critics blamed the band’s early promiscuities on fame and constant touring.","zh":"评论者把这支乐队早期的“私生活混乱/关系杂乱”归因于名气和频繁巡演。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of promiscuity (nonsexual): the state of mixing many different things together freely or carelessly","zh":"promiscuity 的复数（非性含义）：指把许多不同事物随意或不加分辨地混在一起的状态"},"examples":[{"en":"The study warns about the promiscuities of data sharing without clear consent rules.","zh":"这项研究警告：在没有明确同意规则时，数据共享的“随意泛化/混用”会带来风险。"},{"en":"Some readers enjoy the promiscuities of genres in modern novels.","zh":"一些读者喜欢现代小说里体裁的“混搭/杂糅”。"}]}],"synonyms":["casual relationships","multiple partners","sexual freedom (context-dependent)","mixing","indiscriminate blending"],"phonetic":"/ˌprɑməˈskjuətiz/","extraExplanation":["“promiscuities”在日常英语里较少直接使用，更常见的是不可数名词“promiscuity”，或用更具体的表达（如“casual relationships”“multiple partners”）。","涉及性含义时，这个词往往带有明显的道德评判色彩；在正式写作中可根据语境改用更中性、更描述性的说法。"]}
{"word":"promiscuity","summary":{"en":"Promiscuity most commonly means having many casual sexual partners, and more formally it can mean mixing or acting without selectivity.","zh":"Promiscuity通常指（性方面）不专一、随意；在更正式语境中也可指不加选择的混杂或“广谱/非专一性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Having or involving many casual sexual partners; not limited to one partner.","zh":"（性方面）随意的；有许多短暂性伴侣的；不专一的。"},"examples":[{"en":"The article discusses the health risks associated with sexual promiscuity.","zh":"这篇文章讨论了与性随意行为相关的健康风险。"},{"en":"He was criticized for his promiscuity, though such judgments can be culturally biased.","zh":"他因性不检点而受到批评，不过这种评判可能带有文化偏见。"}]},{"partOfSpeech":"n.","definition":{"en":"Mixing freely and often indiscriminately; not selective (used more in formal writing).","zh":"（更正式用法）混杂的；不加选择地广泛交往或使用的。"},"examples":[{"en":"Researchers warned against the promiscuity of the term, which was used too broadly.","zh":"研究者警告说这个术语被“泛化”使用，含义过于宽泛。"},{"en":"The promiscuity of the new pesticide affected many different insect species.","zh":"这种新农药的“广谱性/非选择性”影响了许多不同的昆虫种类。"}]}],"synonyms":["casual sex","multiple partners","sexual freedom","indiscrimination","nonselectivity"],"phonetic":"/prəˌmɪskjuˈɪti/","extraExplanation":["“promiscuity”在日常语境中最常指“性随意”，带有较强的道德评判色彩；在学术或医学写作中常用更中性的表达，如“multiple sexual partners（多个性伴侣）”“casual sex（随意性行为）”。","在科学领域（如生物化学、生态学），“promiscuity”可指“非专一性/广谱性”（例如某种酶能作用于多种底物），语气通常中性。","词源来自拉丁语“promiscuus”，有“混合、无区分”的意思，因此也发展出“泛化、非选择性”的抽象用法。"]}
{"word":"promiscuous","summary":{"en":"“Promiscuous” usually means having many sexual partners (often judgmental), and it can also mean not selective or indiscriminate.","zh":"“promiscuous”通常指“性关系随便（常带评判）”，也可指“不加选择的、混杂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often critical) having sexual relationships with many different people, especially without forming a committed relationship.","zh":"（常带贬义）性关系随便的；与许多人发生性关系的，尤指缺乏稳定承诺关系。"},"examples":[{"en":"The article was criticized for calling young women “promiscuous.”","zh":"这篇文章因把年轻女性称为“性生活随便”而受到批评。"},{"en":"He avoided labeling anyone promiscuous because the word can be judgmental.","zh":"他避免给任何人贴上“性关系随便”的标签，因为这个词可能带有道德评判。"}]},{"partOfSpeech":"adj.","definition":{"en":"not selective or careful; involving many different people or things without clear choice or discrimination.","zh":"不加选择的；不谨慎筛选的；把许多不同的人或事物混在一起的。"},"examples":[{"en":"The app made promiscuous use of personal data, collecting far more than it needed.","zh":"这个应用对个人数据的使用毫无节制，收集了远超所需的信息。"},{"en":"Promiscuous mixing of chemicals can be dangerous.","zh":"不加选择地混合化学品可能很危险。"}]}],"synonyms":["indiscriminate","unselective","casual","libertine (often old-fashioned)"],"phonetic":"/prəˈmɪskjuəs/","extraExplanation":["“promiscuous”在日常语境里最常指“性关系随便”，带有很强的道德评判色彩，容易冒犯他人。写作或正式表达中，如果想更中性，可以根据语境改用“sexually active（性活跃的）”“has multiple partners（有多个性伴侣）”“non‑monogamous（非一夫一妻/非单偶）”等更描述性、少评价的说法。","词源上与“混在一起、无差别地分配/混合”的含义相关，所以它也能用于“未经筛选、胡乱使用/混用”（如数据、化学品、资源），这种用法在学术或新闻写作里更常见。"]}
{"word":"promiscuously","summary":{"en":"“Promiscuously” means either having many casual sexual partners, or doing something in an indiscriminate, not-carefully-chosen way.","zh":"“promiscuously”可指（性方面）与多人随意发生关系；也可指做事不加选择、杂乱无章地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves many different partners or casual sexual relationships.","zh":"以（性关系）不专一、与多人发生关系的方式；滥交地。"},"examples":[{"en":"The rumor said he dated people promiscuously, but there was no proof.","zh":"谣言说他与人交往很随便、对象很多，但并没有证据。"},{"en":"The article discusses how society judges women more harshly for behaving promiscuously.","zh":"那篇文章讨论了社会如何更严厉地评判“行为不检点/滥交”的女性。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a mixed or indiscriminate way, without careful choice or clear order (often used about actions like using, sharing, or applying something).","zh":"杂乱地；不加选择地；不加区分地（常形容使用、分享、施用等行为）。"},"examples":[{"en":"Don’t share your password promiscuously—only give it to people you trust.","zh":"不要随便把密码到处分享——只给你信任的人。"},{"en":"He used the word promiscuously, applying it to situations where it didn’t fit.","zh":"他不加区分地使用那个词，把它用在不合适的情境里。"}]}],"synonyms":["indiscriminately","randomly","casually"],"phonetic":"/prəˈmɪskjuəsli/","extraExplanation":["“promiscuous / promiscuously”在谈到性行为时带有明显的价值判断，语气可能显得批评、羞辱或道德化；在正式写作或敏感语境中，可用更中性的表达，如“had multiple partners（有多位伴侣）”“had casual relationships（随意/短期关系）”“was sexually active（性行为活跃）”，根据事实与语气选择。","词源上来自拉丁语，核心含义是“混杂的、无差别的”，所以它也能用于非性含义：如“indiscriminately（不加选择地）”“randomly（随意地）”。"]}
{"word":"promiscuousness","summary":{"en":"Promiscuousness means the quality of being promiscuous—most often, having many casual sexual partners; more broadly, mixing or choosing without careful discrimination.","zh":"promiscuousness 指“promiscuous 的性质”：最常见是指性方面的随意与性伴侣多；也可泛指不加选择的混杂或不加区分地参与。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having many casual sexual partners, or being open to casual sex with different people.","zh":"（与不同人）随意发生性关系、性伴侣很多的状态；性放纵。"},"examples":[{"en":"The novel explores promiscuousness as a response to loneliness.","zh":"这部小说探讨了“性放纵”如何成为对孤独的一种反应。"},{"en":"They avoided judging her promiscuousness and focused on her safety and well-being.","zh":"他们避免评判她的私生活，而是关注她的安全与身心健康。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally: a lack of careful selection; mixing or taking part in many things without discrimination.","zh":"（较泛义）缺乏选择性；不加区分的混杂或参与。"},"examples":[{"en":"Some critics disliked the promiscuousness of styles in the album.","zh":"一些评论家不喜欢这张专辑在风格上的“杂糅混搭”。"},{"en":"The report warned against the promiscuousness of data sharing across departments.","zh":"报告警告不要在各部门之间不加区分地共享数据。"}]}],"synonyms":["promiscuity","casual sex","sexual permissiveness","indiscrimination","lack of selectivity"],"phonetic":"/prəˈmɪskjuəsnəs/","extraExplanation":["“promiscuousness”来自形容词 promiscuous（不加选择的、混杂的；也指性方面随意的）加名词后缀 -ness。日常英语里这个词带有较强的道德评判色彩，谈到性时容易显得不尊重或“贴标签”。更中性、更常见的表达可用：having multiple partners（有多个伴侣）、casual sex（随意性行为）、non-monogamous（非一夫一妻/非单偶）、sexual behavior/sexual history（性行为/性经历）。"]}
{"word":"promiscuousnesses","summary":{"en":"“Promiscuousnesses” is the plural of “promiscuousness,” meaning multiple instances or types of being promiscuous or indiscriminate.","zh":"“promiscuousnesses” 是 “promiscuousness”的复数，表示多种/多次“滥交”或“选择不加区分、很随意”的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural of promiscuousness: multiple instances or forms of being promiscuous (having many sexual partners, or being indiscriminate in choice).","zh":"promiscuousness 的复数：指多种/多次“滥交（性伴侣很多）”或“选择不加区分、很随意”的状态或表现。"},"examples":[{"en":"The report compared the promiscuousnesses portrayed in different TV series.","zh":"这份报告比较了不同电视剧中呈现的各种“滥交/随意”的行为模式。"},{"en":"Scientists avoid moral judgments and describe patterns rather than “promiscuousnesses.”","zh":"科学研究通常避免道德评判，更倾向于描述行为模式，而不是用“各种滥交”这样的词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Multiple cases of indiscriminate mixing or use (not necessarily sexual).","zh":"（较少见）指多种“混杂/不加选择的使用”的情况（不一定与性有关）。"},"examples":[{"en":"Critics noted the novel’s promiscuousnesses of style, mixing slang with formal language.","zh":"评论家指出这部小说在文体上有多种混杂：把俚语和正式语言混在一起。"}]}],"synonyms":["indiscriminate behaviors","multiple instances of promiscuity","casual sexual behavior (context-dependent)","indiscriminate mixing (nonsexual)"],"phonetic":"/prəˈmɪskjuəsnəsɪz/","extraExplanation":["这个词本身很少用复数；更常见的说法是用不可数名词 promiscuousness（如“His promiscuousness became a rumor.”）或改用更中性的表达，比如 “multiple partners,” “casual sex,” “indiscriminate mixing/combination”等。","在涉及性行为时，promiscuousness 往往带有强烈的评价色彩（贬义、道德批判），在正式写作或敏感语境中建议谨慎使用，避免对个人进行羞辱或贴标签。"]}
{"word":"promise","summary":{"en":"“Promise” means a firm commitment (noun) or to commit firmly (verb); it can also mean future potential.","zh":"“promise”可表示“承诺/保证”（名词或动词），也可表示“潜力、前景”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A statement that you will definitely do something or that something will happen.","zh":"承诺；保证（表示你一定会做某事或某事一定会发生的话）。"},"examples":[{"en":"He made a promise to call her every day.","zh":"他承诺每天给她打电话。"},{"en":"I can’t break my promise.","zh":"我不能违背我的承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign that someone or something is likely to be successful or good in the future.","zh":"前景；希望；潜力（指未来可能成功或变好的迹象）。"},"examples":[{"en":"The young player shows a lot of promise.","zh":"这位年轻球员展现出很大的潜力。"},{"en":"The new plan holds promise, but it needs time.","zh":"这个新计划很有希望，但需要时间。"}]},{"partOfSpeech":"v.","definition":{"en":"To tell someone that you will definitely do something or that something will happen.","zh":"承诺；保证（表示自己一定会做某事或某事会发生）。"},"examples":[{"en":"I promise I’ll help you tomorrow.","zh":"我保证明天会帮你。"},{"en":"She promised not to tell anyone.","zh":"她答应不告诉任何人。"},{"en":"The sky promised rain.","zh":"天空像是预示着要下雨。"}]}],"synonyms":["vow","pledge","commitment","assure","guarantee","potential"],"phonetic":"/ˈprɑmɪs/","extraExplanation":["“Promise”既可以是名词“承诺”，也可以是动词“承诺/保证”。常见搭配：make a promise（做出承诺）、keep a promise（守信）、break a promise（违背承诺）、promise to do sth（承诺做某事）。","“show promise / hold promise”里的 promise 不是“承诺”，而是“前景、潜力”。这在学习者中很容易混淆。","语气上，“I promise”通常比“I think / I will”更强、更正式一些，表示说话人愿意承担责任；因此在重要事情上要谨慎使用。"]}
{"word":"promised","summary":{"en":"“Promised” usually means you said you would do something (past/participle of promise), or it describes something that was assured because it was promised.","zh":"“promised”通常是“promise”的过去式/过去分词，表示已承诺；也可作形容词，指“被承诺、确定会得到的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “promise”: to say you will definitely do something or that something will happen.","zh":"“promise”的过去式和过去分词：承诺会做某事，或保证某事会发生。"},"examples":[{"en":"She promised to call me after work.","zh":"她答应下班后给我打电话。"},{"en":"They promised that the package would arrive by Friday.","zh":"他们保证包裹会在周五前送到。"},{"en":"He has promised help to his neighbors.","zh":"他已经答应要帮助邻居。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) assured or expected because it was promised; often used before a noun.","zh":"（作形容词）因“被承诺”而确定会得到的；常用于名词前。"},"examples":[{"en":"The promised support never arrived.","zh":"承诺的支持始终没有到来。"},{"en":"They finally received the promised payment.","zh":"他们终于收到了答应的款项。"}]},{"partOfSpeech":"phrase","definition":{"en":"(the promised land) a place or situation you hope for as a better future, often after a long struggle.","zh":"（the promised land）“理想之地/应许之地”：指经历艰难后向往的更好归宿或未来。"},"examples":[{"en":"For him, a stable job felt like the promised land.","zh":"对他来说，一份稳定的工作就像理想之地。"},{"en":"Many stories describe a journey toward the promised land.","zh":"许多故事描写了通往“应许之地”的旅程。"}]}],"synonyms":["vowed","pledged","swore","assured","guaranteed"],"phonetic":"/ˈprɑmɪst/","extraExplanation":["“promised”常见语法用法：\n1) 过去式：I promised yesterday.（我昨天答应了。）\n2) 过去分词：I have promised. / The help was promised.（现在完成时或被动语态）\n3) 作形容词：the promised result / the promised date（承诺过的结果/日期）。","常见搭配：promise to do（答应做某事）；promise (someone) something（答应给某人某物）；promise that + 从句（保证……）。","“the Promised Land”源自《圣经》中上帝应许给以色列人的土地（迦南）。现代英语里常被引申为“梦寐以求的更好生活/机会”，带有文化与文学色彩。"]}
{"word":"promisee","summary":{"en":"A promisee is the person who receives a promise in a contract.","zh":"promisee 指合同中接受他方承诺、享有请求履行权利的一方（受诺人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In a contract, the person to whom a promise is made (the one who receives the promised performance).","zh":"（合同中）受诺人：承诺所指向的对象，即接受对方承诺履行的一方。"},"examples":[{"en":"In the agreement, the buyer is the promisee and the seller is the promisor.","zh":"在该协议中，买方是受诺人（promisee），卖方是承诺人（promisor）。"},{"en":"If the promisor fails to perform, the promisee may have legal remedies.","zh":"如果承诺人未履行承诺，受诺人可能有法律救济。"}]}],"synonyms":["beneficiary (sometimes)","obligee (related)"],"phonetic":"/ˌprɑːməˈsiː/","extraExplanation":["“promisee”主要用于合同法语境，和“promisor（承诺人）”成对出现：promisor做出承诺，promisee接受并有权要求履行。","常见相关概念：\n- third-party beneficiary（第三人受益人）：虽非promisee，但可能从合同中受益并在特定情况下主张权利。\n- obligee（债权人/权利人）：在某些法律语境下与promisee接近，但用法不完全等同。"]}
{"word":"promisees","summary":{"en":"“Promisees” is the plural of “promisee”: the people who receive a promise, especially in legal or contract language.","zh":"promisees 是 promisee 的复数：指接受承诺的人（尤用于法律或合同语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or group) to whom a promise is made, especially in a contract or legal agreement.","zh":"（尤指合同/法律协议中）接受承诺的人；受诺人。"},"examples":[{"en":"In the contract, the buyer is the promisee and the seller is the promisor.","zh":"在合同中，买方是受诺人（promisee），卖方是许诺人（promisor）。"},{"en":"The promisees can sue if the promisor breaks the agreement.","zh":"如果许诺人违约，受诺人可以起诉。"}]}],"synonyms":["promise recipients","persons promised to","contract beneficiaries"],"phonetic":"/ˌprɑːmɪˈsiːz/","extraExplanation":["promisee 是法律/合同英语中的常用术语，日常口语里更常说 the person you promised / the person you made a promise to。","相关术语：promisor（作出承诺的人）、promisee（接受承诺的人）。在合同法里，promisee 往往是有权要求对方履行承诺的一方。"]}
{"word":"promiseful","summary":{"en":"Promiseful means ‘full of promise’—likely to succeed or develop well.","zh":"promiseful 表示“充满希望/很有前途”，指很可能成功或发展良好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing a lot of promise; likely to be successful or develop well in the future.","zh":"很有前途的；大有希望的；有望成功或良好发展的。"},"examples":[{"en":"She is a promiseful young musician with a unique style.","zh":"她是一位很有前途的年轻音乐家，风格独特。"},{"en":"The team made a promiseful start to the season.","zh":"这支队伍在赛季初有了一个很有希望的开局。"}]}],"synonyms":["promising","hopeful","full of promise","auspicious"],"phonetic":"/ˈprɑːmɪsˌfʊl/","extraExplanation":["“promiseful”比较少见，更常用的是“promising”（更地道）或“full of promise”。例如：a promising student / a student full of promise。","词形构成：promise（前景、希望）+ -ful（充满……的），整体意思就是“充满希望/前途的”。","使用建议：写作或正式表达中，用“promising”通常更自然；“promiseful”多见于较旧或偏文学的用法。"]}
{"word":"promiseless","summary":{"en":"“Promiseless” means not promising—showing little hope of success or a good future.","zh":"“promiseless”表示“不太有希望/不乐观”，指看不出成功或良好前景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not giving hope of success; unlikely to lead to a good result.","zh":"不太有希望的；不大可能成功的。"},"examples":[{"en":"The first draft looked promiseless, so she rewrote the opening.","zh":"初稿看起来不太有希望，所以她重写了开头。"},{"en":"After weeks of waiting, the search began to feel promiseless.","zh":"等待了几周后，这次寻找开始让人觉得希望渺茫。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having no promise or potential; lacking signs of future improvement.","zh":"缺乏发展潜力的；看不出未来会变好的。"},"examples":[{"en":"He left the promiseless job to study a new skill.","zh":"他离开了那份没有前景的工作去学习新技能。"},{"en":"They described the land as promiseless for farming because it was too dry.","zh":"他们说那片土地太干旱，不适合耕种，没什么前景。"}]}],"synonyms":["unpromising","hopeless","bleak","unlikely","discouraging"],"phonetic":"ˈprɑːmɪsləs","extraExplanation":["“promiseless”不是很常见的日常用词，更常见的表达是“unpromising / hopeless / bleak”。它由“promise（希望、前景）+ -less（没有）”构成，意思接近“not promising”。在写作中用它会带一点文学或正式语气。"]}
{"word":"promisemonger","summary":{"en":"A promisemonger is a person who makes many promises, often insincerely or without keeping them.","zh":"promisemonger 指经常许诺但常不兑现、带贬义的“空口承诺者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(derogatory) A person who makes many promises, especially to gain support, but often does not intend to keep them.","zh":"（贬义）指一个人常常许下承诺，尤其为了拉拢人心或获得支持，但往往并不打算兑现。"},"examples":[{"en":"Voters were tired of yet another promisemonger who disappeared after the election.","zh":"选民厌倦了又一个只会开空头支票、选后就消失的许诺者。"},{"en":"Don’t be a promisemonger—offer only what you can actually deliver.","zh":"别做空口许诺的人——只承诺你真正能做到的事。"}]}],"synonyms":["promise-breaker","empty promiser","political opportunist","charlatan","windbag"],"phonetic":"/ˈprɑmɪsˌmʌŋɡɚ/","extraExplanation":["“promisemonger”由 promise（承诺）+ -monger 构成。-monger 原意与“买卖/兜售”有关（如 fishmonger 卖鱼的人），用在抽象名词后常带贬义，表示“兜售某种东西的人”。因此 promisemonger 有“兜售承诺、开空头支票”的批评意味。","这个词偏少见、语气较强，正式写作或新闻评论中偶尔出现；日常口语更常用 promise-breaker（失信者）、someone who makes empty promises（空口承诺的人）。"]}
{"word":"promiseproof","summary":{"en":"Promiseproof (often written promise-proof) means not persuaded or influenced by promises.","zh":"promiseproof（常写作 promise-proof）指“不受承诺左右/不为许诺所动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not influenced or persuaded by promises; resistant to being tempted by offers or assurances.","zh":"不受承诺影响的；对“许诺/好处”不为所动的。"},"examples":[{"en":"She’s promiseproof—you can’t win her over with sweet promises.","zh":"她很“promiseproof”，光靠甜言蜜语的承诺打动不了她。"},{"en":"The committee tried to stay promiseproof and focus on the evidence.","zh":"委员会努力不被承诺左右，把注意力放在证据上。"}]}],"synonyms":["unswayed","unmoved","immune (to)","incorruptible","unpersuadable"],"phonetic":"/ˈprɑmɪsˌpruf/","extraExplanation":["“promiseproof”更常见的写法是带连字符的“promise-proof”，属于较口语化/写作上的临时合成词（creative compound）。意思类似“immune to promises / not swayed by promises”。","它不是非常常用的标准词汇，在正式写作中可以改用更常见的表达：\"not swayed by promises\"（不被承诺打动）、\"immune to empty promises\"（对空头承诺免疫）。","结构上借用了“X-proof”（防X、抗X）的模式，如“waterproof（防水的）”“bulletproof（防弹的）”。这里是比喻用法：不是物理上的“防”，而是心理/立场上的“抗”。"]}
{"word":"promiser","summary":{"en":"“Promiser” means the person who makes a promise, especially in a contract; it can also mean a person with strong future potential.","zh":"“Promiser”指作出承诺的人（尤指合同中的承诺方）；也可指很有前途、有潜力的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes a promise (especially in a formal or legal agreement)","zh":"作出承诺的人；（尤指在正式或法律协议中）承诺方"},"examples":[{"en":"In the contract, the promiser must deliver the goods by Friday.","zh":"在合同中，承诺方必须在周五前交付货物。"},{"en":"If the promiser breaks the promise, the other party may have legal options.","zh":"如果承诺方违约，另一方可能有法律上的救济途径。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who shows strong potential for success (a promising person)","zh":"有前途的人；很有潜力的人"},"examples":[{"en":"The coach called her a promiser after seeing her first game.","zh":"教练看了她的第一场比赛后，说她是个很有前途的选手。"},{"en":"He’s a young promiser in the tech industry.","zh":"他是科技行业里很有前途的年轻人。"}]}],"synonyms":["pledger","contracting party","promising person","rising star"],"phonetic":"/ˈprɑːmɪsɚ/","extraExplanation":["“promiser”最常见于法律或合同语境：promiser（承诺方）对应 promisee（受诺方/被承诺的一方）。日常英语里更常说“someone who promised”或直接用“promising person / rising star”来表达“有前途的人”。"]}
{"word":"promisers","summary":{"en":"“Promisers” means people who make promises; in legal contexts, it can mean the party who makes a contractual promise.","zh":"“promisers”指作出承诺的人；在法律/合同语境中也可指作出合同承诺的一方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who make promises (plural of “promiser”).","zh":"许诺的人；承诺者（“promiser”的复数）。"},"examples":[{"en":"The team needs doers, not just promisers.","zh":"团队需要行动者，而不只是许诺的人。"},{"en":"They were enthusiastic promisers during the campaign.","zh":"他们在竞选期间是非常热情的许诺者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law/Contracts) People who make a promise in a contract (often spelled “promisors”).","zh":"（法律/合同）在合同中作出承诺的一方（常拼作“promisors”）。"},"examples":[{"en":"In the agreement, the promisers must deliver the goods by Friday.","zh":"在该协议中，承诺方必须在周五前交付货物。"},{"en":"The judge asked whether the promisers had the ability to perform the contract.","zh":"法官询问承诺方是否有能力履行合同。"}]}],"synonyms":["promise-makers","people who promise","promisors (legal)","pledgers"],"phonetic":"/ˈprɑːmɪsər/","extraExplanation":["“promiser”在日常英语里不算特别常用，更常见的是用“people who promise”或根据语境说“politicians / companies / friends who make promises”。","在合同语境中常见对应词是“promisor（承诺方）”和“promisee（受诺方/接受承诺的一方）”。很多法律写作更偏好拼写“promisor(s)”。","带一点评价意味时，可以用“empty promisers（空口许诺的人）”“all talk, no action（光说不做）”来表达“只会承诺却不落实”。"]}
{"word":"promises","summary":{"en":"“Promises” is the plural of “promise” (n.) meaning commitments/assurances, and it can also refer to signs of future success; “promise” can also be a verb meaning to commit or assure.","zh":"“Promises”是“promise”的复数（名词），表示多个承诺/诺言；也可指“前景/潜力”。“promise”还可作动词，表示承诺或保证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a statement that you will definitely do something or that something will happen","zh":"承诺；诺言（表示你一定会做某事或某事一定会发生的说法）"},"examples":[{"en":"He made a promise to call her every night.","zh":"他承诺每晚都给她打电话。"},{"en":"Keep your promises, even when it’s hard.","zh":"即使很难，也要信守承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of showing signs of future success or being very good","zh":"前景；潜力（显示未来会成功或很有希望的特质）"},"examples":[{"en":"The young musician showed great promise.","zh":"这位年轻音乐家展现出很大的潜力。"}]},{"partOfSpeech":"v.","definition":{"en":"to tell someone that you will definitely do something or that something will happen","zh":"承诺；保证（表示你一定会做某事或某事会发生）"},"examples":[{"en":"I promise I’ll help you with your homework.","zh":"我保证会帮你做作业。"},{"en":"She promised to be on time.","zh":"她答应会准时到。"}]}],"synonyms":["pledge","commitment","assurance","vow","guarantee"],"phonetic":"/ˈprɑmɪs/","extraExplanation":["“Promise”既可以指具体的“诺言/承诺”，也可以指抽象的“潜力/前景”（常见搭配：show promise, full of promise）。","常见句型：promise (someone) + (that) 从句；promise to do；make a promise；keep/break a promise（信守/违背诺言）。","在礼貌表达中，“I promise”语气很强，表示高度确定；更委婉可用“I’ll try”或“I’ll do my best”。"]}
{"word":"promising","summary":{"en":"Promising usually means “likely to succeed” or “showing good potential,” and it can also mean “making a promise.”","zh":"Promising 通常表示“有前途/有潜力、很可能成功”，也可表示“正在许诺/承诺要做某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing signs that something will succeed or be good in the future; likely to have a good result","zh":"有前途的；有希望的；显示出将来会成功或有好结果的"},"examples":[{"en":"She is a promising young musician.","zh":"她是一位很有前途的年轻音乐家。"},{"en":"The early results are promising, but we need more data.","zh":"早期结果很有希望，但我们还需要更多数据。"}]},{"partOfSpeech":"adj.","definition":{"en":"making a promise; saying you will do something (often used as a participle form of “promise”)","zh":"许诺的；承诺要做某事的（常作“promise”的现在分词/分词形式）"},"examples":[{"en":"He left, promising to call the next day.","zh":"他离开时承诺第二天会打电话。"}]}],"synonyms":["hopeful","encouraging","promising-looking","up-and-coming"],"phonetic":"/ˈprɑːmɪsɪŋ/","extraExplanation":["“promising”最常见的用法是形容“有前景/有潜力”（a promising career, a promising candidate）。它强调“迹象显示未来可能成功”，比“good”更带“未来会更好”的意味。","注意区分：promising（有前途的） vs. promised（被承诺的/答应过的）。例如：a promised reward（被许诺的奖励）≠ a promising reward（听起来很吸引、看起来会不错的奖励）。"]}
{"word":"promisingly","summary":{"en":"“Promisingly” means “in a way that shows good signs for future success.”","zh":"“promisingly”表示“以显示出未来成功迹象的方式；前景看好地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows good signs for the future; with reason to expect success or improvement.","zh":"以一种显示未来前景良好、让人有理由期待成功或改善的方式；有希望地。"},"examples":[{"en":"The project is progressing promisingly after the first round of tests.","zh":"第一轮测试之后，这个项目的进展相当有希望。"},{"en":"The sky cleared promisingly, suggesting the storm might pass soon.","zh":"天空转晴，显得很有希望，暗示暴风雨可能很快就会过去。"}]}],"synonyms":["hopefully","favorably","encouragingly","auspiciously"],"phonetic":"/ˈprɑːmɪsɪŋli/","extraExplanation":["“promisingly”通常修饰动作或变化的方式（如 progress, develop, improve），强调“迹象/势头不错”，而不保证结果一定成功。","常见搭配：progress/develop promisingly（进展得很有希望），begin/start promisingly（开局不错），look promisingly（看起来前景不错）。","语气对比：hopefully 更像“主观希望”；promisingly 更像“客观迹象显示有前景”。"]}
{"word":"promisingness","summary":{"en":"“Promisingness” means the quality or degree of being promising—showing strong potential for future success.","zh":"“promisingness”指“有前途/有希望的特质或程度”，强调未来成功的潜力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of seeming likely to succeed or be good in the future; strong potential","zh":"有前途（看起来很可能成功或变好）的特质；潜力很大"},"examples":[{"en":"The promisingness of the new treatment needs to be confirmed by larger studies.","zh":"这种新疗法的前景还需要通过更大规模的研究来证实。"},{"en":"Investors argued about the promisingness of the startup’s technology.","zh":"投资者就这家初创公司的技术是否有前景展开了讨论。"},{"en":"Her early results showed the promisingness of her approach.","zh":"她早期的结果显示出她的方法很有潜力。"}]}],"synonyms":["promise","potential","prospect(s)","likelihood of success"],"phonetic":"/ˈprɑmɪsɪŋnəs/","extraExplanation":["“promisingness”是由形容词 promising（有希望的）+ 名词后缀 -ness（……的性质/状态）构成的抽象名词，意思相当于“有前途这一点/程度”。","这个词在日常英语里不算常见；更自然、更常用的替代说法有 promise（前景/潜力）、potential（潜力）、prospects（前景）、how promising … is（……有多有希望）。在学术或正式写作中偶尔会用来强调“有希望的程度”。"]}
{"word":"promisor","summary":{"en":"A promisor is the person who makes a promise, especially in a legal contract.","zh":"promisor 指作出承诺的人，尤指合同中作出法律承诺的一方（允诺人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes a promise, especially a legally binding promise in a contract","zh":"作出承诺的人；（尤指合同中）作出具有法律约束力承诺的一方（允诺人）"},"examples":[{"en":"In the contract, the promisor must deliver the goods by Friday.","zh":"在合同中，允诺人必须在周五前交付货物。"},{"en":"If the promisor fails to perform, the other party may sue for breach of contract.","zh":"如果允诺人未履行义务，另一方可以因违约起诉。"}]}],"synonyms":["promise-maker","contracting party","obligor"],"phonetic":"/ˈprɑːmɪsər/","extraExplanation":["法律语境里常与 promisee 搭配：promisor 是“做出承诺/承担义务的一方”，promisee 是“接受承诺/享有权利的一方”。","词形来源：promise（承诺）+ -or（表示“做某事的人”，如 actor, director）。"]}
{"word":"promisors","summary":{"en":"“Promisors” means people/parties who make promises, especially the party who promises in a contract.","zh":"“promisors”指作出承诺的人/各方，尤指合同中承担承诺的一方（承诺人）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person or party who makes a promise, especially in a contract.","zh":"（法律）作出承诺的人或一方，尤指在合同中作出承诺的一方（承诺人）。"},"examples":[{"en":"In the contract, the promisor agrees to deliver the goods by Friday.","zh":"在合同中，承诺人同意在周五前交付货物。"},{"en":"If the promisor fails to perform, the promisee may sue for damages.","zh":"如果承诺人未履行，受诺人可以起诉要求赔偿。"}]}],"synonyms":["promisers","obligors (legal)","contracting party (general)"],"phonetic":"/ˈprɑːmɪsɚ/","extraExplanation":["“promisors”是“promisor”的复数形式。这个词主要用于合同法语境，日常英语更常说“the person who promises（做出承诺的人）”。","在合同关系里，promisor（承诺人）对应promisee（受诺人）。很多教材也会把promisor理解为“obligor（负有义务的一方）”，把promisee理解为“obligee（享有权利的一方）”，但具体用法取决于合同结构与法域。"]}
{"word":"promiss","summary":{"en":"“Promiss” is a misspelling of “promise,” meaning a commitment (noun) or to commit (verb), and also “potential.”","zh":"“promiss” 是 “promise” 的拼写错误；promise 可表示“承诺/诺言”（名词）、“承诺/保证”（动词），也可表示“潜力/前景”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) The correct spelling is “promise.”","zh":"（常见拼写错误）正确拼写是 “promise”。"},"examples":[{"en":"I think you mean “promise,” not “promiss.”","zh":"我想你要写的是 “promise”，不是 “promiss”。"}]},{"partOfSpeech":"n.","definition":{"en":"A statement that you will definitely do something or that something will happen.","zh":"承诺；保证（表示你一定会做某事或某事一定会发生的说法）。"},"examples":[{"en":"He made a promise to call her every day.","zh":"他承诺每天给她打电话。"},{"en":"Can you keep your promise?","zh":"你能信守诺言吗？"}]},{"partOfSpeech":"v.","definition":{"en":"To tell someone you will definitely do something or that something will happen.","zh":"承诺；保证（说你一定会做某事或某事一定会发生）。"},"examples":[{"en":"I promise I’ll help you after class.","zh":"我保证下课后帮你。"},{"en":"She promised to be on time.","zh":"她承诺会准时。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign that someone or something is likely to be successful in the future.","zh":"（成功的）希望；前景（显示未来可能会成功的迹象）。"},"examples":[{"en":"The young player shows a lot of promise.","zh":"这位年轻球员很有潜力。"}]}],"synonyms":["commitment","pledge","vow","assure","guarantee"],"phonetic":"/ˈprɑːmɪs/","extraExplanation":["“promise” 来自拉丁语 *promittere*（pro- 向前 + mittere 送出/发出），核心感觉是“把话说出去、把保证放在前面”。","常见搭配：make a promise（做出承诺）；keep/break a promise（信守/违背承诺）；promise to do sth（承诺做某事）；show promise（显示潜力）。","“promise” 与 “assure/guarantee” 的区别：promise 更强调“对人做出的承诺”；guarantee 更像“保证结果/质量”；assure 常用于“让对方安心”。"]}
{"word":"promissionary","summary":{"en":"“Promissionary” is not standard; it’s usually a misspelling of “promissory,” meaning “relating to a promise,” especially in “promissory note.”","zh":"“Promissionary”不是标准用法，通常是“promissory”的拼写错误，意为“与承诺有关的”，尤其用于“promissory note（本票）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard) A common misspelling of “promissory.”","zh":"（非标准用法）常见的拼写错误，通常想写的是 “promissory（承诺的；本票的）”。"},"examples":[{"en":"I think you mean “promissory note,” not “promissionary note.”","zh":"你可能想写的是 “promissory note（本票）”，不是 “promissionary note”。"},{"en":"“Promissionary” isn’t used in standard English; use “promissory” instead.","zh":"“Promissionary” 不是标准英语用法；请改用 “promissory”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a promise; expressing a promise.","zh":"与承诺有关的；表示承诺的。"},"examples":[{"en":"His letter had a promissory tone, but no clear plan.","zh":"他的信里语气像在承诺，但没有明确计划。"},{"en":"The campaign used promissory language to win support.","zh":"竞选活动用带承诺意味的措辞来争取支持。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Finance/Law) Relating to a promissory note (a written promise to pay money).","zh":"（金融/法律）与本票有关的；本票的（本票是书面承诺偿还金钱的文件）。"},"examples":[{"en":"She signed a promissory note to repay the loan.","zh":"她签了一张本票来偿还贷款。"},{"en":"The bank reviewed the promissory agreement carefully.","zh":"银行仔细审核了这份本票相关协议。"}]}],"synonyms":["promising (general)","pledged (context-dependent)","contractual (finance/law context)"],"phonetic":"/ˈprɑːməˌsɔːri/","extraExplanation":["“promissionary”在常见词典中通常查不到，写作和考试里会被当作拼写错误。最接近且最常用的词是“promissory”（尤其常见搭配：promissory note＝本票）。","词源提示：promissory 来自 promise（承诺）。如果你想表达“传教士”，正确词是 missionary（传教士），但它和 promissory 意义完全不同。"]}
{"word":"promissive","summary":{"en":"Promissive means “related to or expressing a promise,” and in linguistics it refers to an utterance that commits the speaker to a future action.","zh":"Promissive 指“与承诺有关/表达承诺的”；在语言学中指使说话者对未来行动作出承诺的言语行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a promise; expressing or containing a promise","zh":"与承诺有关的；表示（包含）承诺的"},"examples":[{"en":"The contract includes promissive language about delivery dates.","zh":"合同里包含了关于交付日期的承诺性措辞。"},{"en":"His promissive tone made everyone expect quick results.","zh":"他那种承诺性的语气让大家都期待很快见到成效。"}]},{"partOfSpeech":"adj.","definition":{"en":"(linguistics) describing an utterance that commits the speaker to a future action (a type of speech act, like “I promise…”)","zh":"（语言学）指一种“承诺类”言语行为：说话者通过话语对未来行动作出承诺（如“I promise…”）"},"examples":[{"en":"“I’ll call you tomorrow” can function as a promissive in conversation.","zh":"“I’ll call you tomorrow（我明天给你打电话）”在对话中可以起到承诺类（promissive）的作用。"},{"en":"Researchers compared promissive statements with requests and apologies.","zh":"研究者将承诺类陈述与请求、道歉等言语行为作了比较。"}]}],"synonyms":["promising","commissive","pledging","commitment-related"],"phonetic":"/prəˈmɪsɪv/","extraExplanation":["“promissive”在日常英语中比较少见，更常见的表达是“promising（有希望的/有前景的）”“a promise（一个承诺）”“committing（有约束力的）”或“containing a promise（包含承诺的）”。写作时如果面向大众读者，通常用更常见的词会更自然。","语言学里常把承诺类言语行为叫“commissive”（承诺/许诺类，涵盖promise、offer、vow等）。有些资料也会用“promissive”更具体地指“promise”这种承诺行为本身；不同学者用词略有差异。"]}
{"word":"promissor","summary":{"en":"Promissor (usually spelled promisor) means the person who makes a promise, especially in a legal contract.","zh":"promissor（通常拼作 promisor）指作出承诺的人，尤指合同法律语境中的“承诺人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person who makes a promise or gives a formal commitment in a contract.","zh":"（法律）作出承诺或在合同中作出正式保证的一方；承诺人。"},"examples":[{"en":"In the contract, the promisor must deliver the goods by Friday.","zh":"在合同中，承诺人必须在周五前交付货物。"},{"en":"If the promisor breaks the promise, the other party may sue for damages.","zh":"如果承诺人违约，另一方可能会起诉要求赔偿。"}]}],"synonyms":["promisor","pledger","guarantor (sometimes)","covenantor (formal)"],"phonetic":"/ˈprɑmɪsər/","extraExplanation":["“promissor”常见于拼写错误或较少见的拼法；更标准、常用的拼写是 **promisor**（美式英语常见）。","这是合同法里的术语，常与 **promisee**（受诺人／受承诺的一方）成对出现：**promisor** 做出承诺，**promisee** 接受承诺。"]}
{"word":"promissorily","summary":{"en":"“Promissorily” means “in a way that makes or sounds like a promise,” often in formal or legal contexts.","zh":"“promissorily”意为“以承诺（或听起来像承诺）的方式”，多见于正式或法律语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves making a promise; as a promise would.","zh":"以承诺的方式；像（做出）承诺那样。"},"examples":[{"en":"He spoke promissorily, but he never followed through.","zh":"他说话时一副在做承诺的样子，但从未兑现。"},{"en":"The company responded promissorily, offering support without clear details.","zh":"公司以“承诺式”的口吻回应，表示会支持但没有明确细节。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Law, formal) In the manner of a promissory statement or obligation.","zh":"（法律/正式）以具有承诺效力的陈述或义务的方式。"},"examples":[{"en":"The document reads promissorily, suggesting an obligation to pay.","zh":"该文件措辞带有承诺义务的意味，暗示需要付款。"},{"en":"The email was written promissorily, though it was not a binding contract.","zh":"那封邮件写得像在作出承诺，尽管它并非具有约束力的合同。"}]}],"synonyms":["promisingly","assuringly","committally","pledge-like"],"phonetic":"/ˈprɑmɪˌsɔrəli/","extraExplanation":["“promissorily”非常少见，更常见的表达是：“in a promising/committal way”（以承诺/表态的方式）或直接用动词“promise”。","词根来自“promissory”（意为“承诺的；约定支付的”），在法律语境中常见于“promissory note”（本票/借据），指书面承诺在未来支付一定金额。"]}
{"word":"promissory","summary":{"en":"Promissory means “involving a written promise to pay,” especially in finance (promissory note).","zh":"promissory 指“与书面承诺付款有关的”，常用于金融法律语境（如 promissory note 本票）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a written promise to pay a specific amount of money, usually used in legal or financial contexts (as in a promissory note).","zh":"与“书面承诺付款”有关的（多用于法律或金融语境），常见于 promissory note（本票/期票）。"},"examples":[{"en":"She signed a promissory note agreeing to repay the loan in six months.","zh":"她签了一张本票，同意在六个月内偿还贷款。"},{"en":"The bank asked for promissory documents before releasing the funds.","zh":"银行在放款前要求提供承诺付款的文件。"}]}],"synonyms":["pledged","binding","contractual","financial"],"phonetic":"/ˈprɑːməˌsɔːri/","extraExplanation":["“promissory”来自 promise（承诺）+ -ory（表示“具有……性质/用途”的形容词后缀）。在日常口语里较少单独使用，最常见的固定搭配是 promissory note（本票/借据），属于正式、偏法律金融的词汇。","promissory note 通常是一方（借款人/出票人）向另一方（出借人/收款人）写下的无条件付款承诺；与“check/cheque（支票）”不同，本票本身就是承诺还款的文件。"]}
{"word":"promissory note","summary":{"en":"A promissory note is a formal written promise to pay a specific sum of money by a certain time or on demand.","zh":"promissory note 指“本票/借据”，即书面承诺在约定时间或见票时支付特定金额（通常含利息）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A written, signed promise to pay a specific amount of money to a person or company, either on demand or at a set future date (often with interest).","zh":"本票；借据：一种书面并签署的付款承诺，约定向某人或某公司支付特定金额，可在见票即付或在未来某一日期支付（常含利息）。"},"examples":[{"en":"She signed a promissory note to repay the loan in twelve months.","zh":"她签了一张本票，承诺在十二个月内还清贷款。"},{"en":"The promissory note says the money is due on June 1, with 5% interest.","zh":"这张本票写明6月1日到期，并按5%的利息计算。"},{"en":"Without a promissory note, it can be harder to prove the debt in court.","zh":"没有本票的话，到了法庭上可能更难证明这笔债务。"}]}],"synonyms":["IOU","note payable","loan note","debt note"],"phonetic":"/ˈprɑməˌsɔri noʊt/","extraExplanation":["“promissory note”常见于银行贷款、分期付款、个人借贷或商业融资文件中。它通常会写明本金（principal）、利率（interest rate）、到期日（maturity date）、付款方式（on demand/按期支付）、违约条款（default）以及签署人（maker）的责任。","在美国语境里，promissory note 是一种可执行的法律文书，但具体效力与细节会因州法与合同条款而不同；学习时可把它理解为“正式版本的欠条/还款承诺书”。","相关表达：sign/issue a promissory note（签署/出具本票）, pay/repay under a promissory note（按本票偿还）, promissory note payable on demand（见票即付本票）。"]}
{"word":"promissum","summary":{"en":"Promissum is a formal Latin-derived word meaning a promise or undertaking, mainly used in legal or academic contexts.","zh":"Promissum 是源自拉丁语的正式词，意为“承诺/允诺”，主要用于法律或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, formal; from Latin) A promise or undertaking; something that has been promised.","zh":"（法律/正式用语，源自拉丁语）承诺、允诺；被承诺之事。"},"examples":[{"en":"In the contract, the seller’s promissum was to deliver the goods by May 1.","zh":"在合同中，卖方的 promissum 是在5月1日前交付货物。"},{"en":"The court examined whether the promissum created a binding obligation.","zh":"法院审查该 promissum 是否构成具有约束力的义务。"}]}],"synonyms":["promise","undertaking","pledge","commitment","assurance"],"phonetic":"/prəˈmɪsəm/","extraExplanation":["“promissum”是拉丁语词形（意为“已经承诺之事/承诺”），在英语里多见于法律史、拉丁法律格言或学术写作中；日常英语通常直接用 promise 或 undertaking。","相关拉丁词形：单数 promissum；复数常见 promissa（“承诺事项”）。"]}
{"word":"promissvry","summary":{"en":"Promissory means “related to a written promise to pay,” especially in financial/legal contexts (as in “promissory note”).","zh":"Promissory 指“与书面承诺付款有关的”，常用于金融/法律语境（如 promissory note 本票/借据）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a written promise to pay a certain amount of money (often used in finance and law).","zh":"与书面承诺付款有关的（常用于金融和法律语境）。"},"examples":[{"en":"She signed a promissory note to repay the loan within one year.","zh":"她签了一张本票（promissory note），承诺在一年内还清贷款。"},{"en":"The bank asked for promissory documents as proof of the debt.","zh":"银行要求提供本票类文件作为债务证明。"}]}],"synonyms":["contractual","binding","written","financial"],"phonetic":"/ˈprɑːmɪˌsɔːri/","extraExplanation":["你输入的“promissvry”常见是拼写错误，正确拼写是 **promissory**。","最常见搭配是 **promissory note**（本票/借据），指一方书面承诺在未来某个时间向另一方支付一定金额。它在英语里经常出现在合同、贷款、欠款等正式场景中。","词源上来自 *promise*（承诺）+ 形容词后缀 *-ory*（表示“与……有关的”），因此字面意思就是“与承诺有关的”。"]}
{"word":"promit","summary":{"en":"Permit means to allow or give permission; as a noun, it’s an official permission document.","zh":"permit 表示“允许/许可”；作名词时指“许可证、执照”等官方许可文件。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to allow something to happen; to give permission","zh":"允许；准许（某事发生）；许可"},"examples":[{"en":"The school does not permit students to use phones in class.","zh":"学校不允许学生在课堂上使用手机。"},{"en":"Smoking is not permitted here.","zh":"这里不允许吸烟。"}]},{"partOfSpeech":"n.","definition":{"en":"an official document that gives you permission to do something","zh":"许可证；执照（官方许可文件）"},"examples":[{"en":"You need a parking permit to leave your car here.","zh":"你需要停车许可证才能把车停在这里。"},{"en":"He applied for a work permit.","zh":"他申请了工作许可。"}]}],"synonyms":["allow","let","authorize","approve","license"],"phonetic":"/pərˈmɪt/","extraExplanation":["“promit”不是标准英文拼写。你很可能想写的是“permit”。注意：作动词时重音在后（perMIT），作名词时重音常在前（PERmit），但这里我只给出一个常用的美式 IPA。"]}
{"word":"promitosis","summary":{"en":"Promitosis is a rare biology term meaning a primitive or simplified form of mitosis in some microorganisms.","zh":"Promitosis（原始有丝分裂）是较少见的生物学术语，指某些微生物中较原始或较简化的有丝分裂形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a primitive type of cell (nuclear) division seen in some microorganisms, considered an early or simplified form of mitosis","zh":"（生物）原始有丝分裂：某些微生物中出现的一种较原始的细胞（细胞核）分裂方式，被认为是有丝分裂的早期或简化形式"},"examples":[{"en":"Some protozoa show promitosis rather than the typical mitosis seen in animal cells.","zh":"一些原生动物表现为原始有丝分裂，而不是动物细胞中常见的典型有丝分裂。"},{"en":"In this group, researchers described promitosis as a simpler way for the nucleus to divide.","zh":"在这一类群中，研究者把原始有丝分裂描述为细胞核分裂的一种更简化方式。"}]}],"synonyms":["primitive mitosis","atypical mitosis"],"phonetic":"/ˌproʊmaɪˈtoʊsɪs/","extraExplanation":["这是一个比较少见的专业术语，多用于细胞生物学/原生生物学文献。不同教材对它的界定可能略有差异：有的强调“早期进化阶段的有丝分裂样过程”，有的强调“与典型纺锤体结构或染色体行为不同”。如果你是在某篇论文里看到该词，最好结合该文对纺锤体、核膜（是否保持完整）与染色体分离方式的描述来理解。"]}
{"word":"promittere","summary":{"en":"“promittere” is a Latin verb meaning “to promise; to pledge,” and less commonly “to send forth/put forward.”","zh":"“promittere”是拉丁语动词，常指“承诺、允诺”，较少见也可指“送出/提出”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Latin) to promise; to pledge (something)","zh":"（拉丁语）承诺；允诺；保证（某事）"},"examples":[{"en":"In Latin, “promittere” means “to promise.”","zh":"在拉丁语中，“promittere”的意思是“承诺”。"},{"en":"He swore to help and used the verb “promittere” in the text.","zh":"他发誓要帮助，并在文本中使用了动词“promittere”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common, Latin) to send forth; to let out or put forward","zh":"（较少见，拉丁语）送出；放出；提出（主张/内容）"},"examples":[{"en":"Some Latin authors use “promittere” for sending something forward into view.","zh":"一些拉丁作家用“promittere”表示把某物送出、呈现出来。"}]}],"synonyms":["promise","pledge","vow"],"phonetic":"/proʊˈmɪtɛreɪ/","extraExplanation":["“promittere”由前缀 pro-（向前）+ mittere（送出、派遣）构成，所以核心画面是“把话/承诺送到未来”，引申为“许诺”。","它与英语中许多词同源或相关：commit（托付/承诺）、permit（允许）、submit（提交）、transmit（传送）等，都来自拉丁语 mittere 的“发送”概念。","在英语语境里它通常作为拉丁引文出现，而不是日常英语单词；日常表达一般用 promise / pledge。"]}
{"word":"promittor","summary":{"en":"A legal term for a person who makes a promise (the obligor in a contract).","zh":"法律用语：作出承诺、在合同中承担义务的一方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person who makes a promise; the party who undertakes an obligation in a contract (similar to “promisor”).","zh":"（法律）立诺人；作出承诺/承担合同义务的一方（类似于 promisor）。"},"examples":[{"en":"In the contract, the promittor must deliver the goods by July 1.","zh":"在合同中，立诺人必须在7月1日前交付货物。"},{"en":"If the promittor fails to perform, the other party may sue for breach of contract.","zh":"如果立诺人未履行义务，另一方可以起诉违约。"}]}],"synonyms":["promisor","obligor","covenantor"],"phonetic":"/prəˈmɪtər/","extraExplanation":["“promittor”多见于法律英语或较旧/较少用的写法；在现代合同法语境中更常见的是“promisor”（作出承诺的人）与“promisee”（接受承诺的人）。","词源可追溯到拉丁语“promittere”（承诺、允诺）。在一般日常英语里很少用“promittor”，写作时用“promisor”更自然。"]}
{"word":"promnesia","summary":{"en":"Promnesia is a condition where recent memories are weak but older memories stay clearer.","zh":"Promnesia 指近期记忆较差、远期记忆相对清晰的记忆障碍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A memory problem in which a person has difficulty remembering recent events while older, long-term memories remain relatively clear.","zh":"一种记忆障碍：近期记忆较差，但较久远的长期记忆相对清晰。"},"examples":[{"en":"After the accident, he showed promnesia: he could describe his childhood clearly but forgot what he ate for breakfast.","zh":"事故后他出现了近事遗忘（promnesia）：能清楚描述童年，却想不起早餐吃了什么。"},{"en":"The doctor asked questions to check whether her symptoms suggested promnesia or another type of memory disorder.","zh":"医生通过提问判断她的症状是否属于近事遗忘（promnesia）或其他记忆障碍。"}]}],"synonyms":["impaired recent memory","difficulty forming new memories","anterograde memory impairment"],"phonetic":"/prɑmˈniʒiə/","extraExplanation":["词源提示：promnesia 来自希腊语词根，pro-（向前/在……之前）+ mnēsis（记忆）。它在医学或心理学语境里更常见。","易混淆点：它强调“近期记忆更差、远期记忆更好”的对比；与更常见的 amnesia（失忆）相比，promnesia 是更具体的描述。也常被拿来与“顺行性遗忘（anterograde amnesia）”作比较，但两者不完全等同。"]}
{"word":"promo","summary":{"en":"“Promo” is an informal word for promotion or a short piece of advertising used to publicize something.","zh":"“promo”是promotion的口语缩写，表示促销／宣传，或用于推广的短广告内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A promotion, especially advertising or marketing meant to attract attention to a product, event, or idea.","zh":"（非正式）促销／宣传；指为吸引人们关注产品、活动或想法而做的广告或营销推广。"},"examples":[{"en":"They posted a promo for the new album on social media.","zh":"他们在社交媒体上发布了新专辑的宣传内容。"},{"en":"Use this promo code to get 20% off.","zh":"使用这个优惠码可以打八折。"},{"en":"The movie’s promo trailer came out yesterday.","zh":"这部电影的宣传预告片昨天发布了。"}]},{"partOfSpeech":"n.","definition":{"en":"A short promotional piece (such as a video, trailer, or announcement) used to publicize something.","zh":"宣传短片／宣传片段（如短视频、预告片或公告），用来推广某事物。"},"examples":[{"en":"The radio station played a promo for the concert.","zh":"电台播放了那场演唱会的宣传片段。"},{"en":"I saw a quick promo before the show started.","zh":"演出开始前我看到了一段简短的宣传片。"}]}],"synonyms":["promotion","advertisement","ad","commercial","trailer","plug"],"phonetic":"/ˈproʊ.moʊ/","extraExplanation":["“promo”是“promotion / promotional”的口语缩写，常见于广告、媒体、零售、电商等语境。","常见搭配：promo code（优惠码）、promo video/clip（宣传视频）、promo campaign（宣传活动）、in promo（在促销中）。","语气偏口语和商业场景；在正式写作中更常用“promotion”或“promotional (material)”。"]}
{"word":"promoderation","summary":{"en":"“Promoderation” means supporting moderation and opposing extreme positions, often in political or social contexts.","zh":"“Promoderation”指支持温和、中间路线、反对极端立场，常用于政治或社会讨论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or encouraging moderation (balanced, not extreme views or actions), especially in politics, religion, or social debates.","zh":"支持或提倡“温和/中间路线”（不走极端、较为平衡的观点或行动），尤指政治、宗教或社会议题中的立场。"},"examples":[{"en":"The candidate ran a promoderation campaign, avoiding extreme positions on hot-button issues.","zh":"这位候选人以提倡温和路线为竞选主轴，刻意回避在敏感议题上的极端立场。"},{"en":"In a polarized climate, promoderation voices can be harder to hear.","zh":"在高度两极化的环境里，主张温和的声音更不容易被听见。"}]},{"partOfSpeech":"n.","definition":{"en":"Support for moderation; an attitude or movement favoring moderate approaches.","zh":"对温和路线的支持；主张采取中庸、折中或渐进做法的态度或倾向。"},"examples":[{"en":"Promoderation in the group helped keep discussions respectful and practical.","zh":"小组里对温和做法的支持，让讨论保持尊重且务实。"}]}],"synonyms":["pro-moderate","moderate","centrist","middle-of-the-road","anti-extremist"],"phonetic":"/ˌproʊˌmɑːdəˈreɪʃən/","extraExplanation":["这个词较少见，常见于评论或学术语境中，尤其讨论“去极化（depolarization）”“温和派（moderates）”或“反极端（anti-extremism）”时。","构词法：pro-（支持、赞成）+ moderation（温和、节制）。在写作中也常用更常见的表达来替代，如 “pro-moderate” 或 “in favor of moderation”。"]}
{"word":"promoderationist","summary":{"en":"Promoderationist describes someone (or something) that supports moderation and avoids extreme positions, often in politics or public debate.","zh":"promoderationist 指支持温和立场、避免极端化的人或观点，常用于政治或公共讨论语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports moderation (avoiding extremes), especially in politics, religion, or public debate","zh":"主张温和立场的人（避免走极端），常用于政治、宗教或公共讨论语境"},"examples":[{"en":"In the party’s internal debate, promoderationists argued for compromise with the opposition.","zh":"在党内争论中，主张温和路线的人主张与反对派妥协。"},{"en":"Promoderationists warned that extreme rhetoric could divide the country.","zh":"温和派警告说，极端言论可能会撕裂国家。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring moderation; opposed to extreme positions or actions","zh":"支持温和、偏向中间立场的；反对极端立场或做法的"},"examples":[{"en":"She took a promoderationist approach to the conflict, focusing on practical solutions.","zh":"她以支持温和的方式处理冲突，专注于务实的解决方案。"},{"en":"The newspaper’s promoderationist tone encouraged calmer discussion.","zh":"这家报纸偏温和的语气鼓励了更冷静的讨论。"}]}],"synonyms":["moderate","centrist","middle-of-the-road","temperate"],"phonetic":"ˌproʊˌmɑdəˈreɪʃənɪst","extraExplanation":["这个词由 pro-（支持）+ moderationist（温和派）构成，属于比较“评论/分析写作”里的造词，用来强调“明确站在温和派一边”。日常口语中更常见的说法是 moderate / centrist（中间派）或 supportive of moderation（支持温和立场）。","语境上常见于政治、宗教派别争论，或谈到公共讨论风格（呼吁理性、反对极端化）。不要与“content moderation（内容审核/内容管理）”混淆：promoderationist通常不是指“支持平台审核”，而是指“支持温和立场”。"]}
{"word":"promodern","summary":{"en":"Promodern (often written pro-modern) means supporting modern ideas or modernization, sometimes specifically modernist art or design.","zh":"Promodern（常写作pro-modern）指支持现代观念或现代化，有时也特指偏好现代主义艺术或设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting modern ideas, styles, or ways of doing things; favoring modernization","zh":"支持现代观念、风格或做法的；倾向于现代化的"},"examples":[{"en":"The mayor ran a pro-modern campaign focused on public transit and clean energy.","zh":"市长以支持现代化的竞选主张为主，重点强调公共交通和清洁能源。"},{"en":"Some critics call the new museum building too pro-modern and not respectful enough of the old neighborhood.","zh":"一些评论者认为新博物馆大楼太偏现代派，对老街区不够尊重。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characterized by a preference for modernist art, literature, or design","zh":"（在艺术、文学、设计上）偏好现代主义的；具有现代主义倾向的"},"examples":[{"en":"Her taste is strongly pro-modern: minimal lines, open space, and abstract art.","zh":"她的品味很偏现代主义：简洁线条、开放空间和抽象艺术。"},{"en":"The gallery’s pro-modern selection highlights early 20th-century experiments.","zh":"画廊偏现代主义的选品突出了20世纪早期的实验作品。"}]}],"synonyms":["pro-modern","modernizing","forward-looking","progressive","modernist (in art/design contexts)"],"phonetic":"/ˌproʊˈmɑdɚn/","extraExplanation":["“promodern”更常见的写法是“pro-modern”（带连字符），意思是“支持现代/现代化”。在正式写作中，建议用连字符以避免读者误读。","这个词不是最常用的固定词汇，很多场景也可以用更常见的表达替换，例如“modernizing”“forward-looking”“in favor of modernization”。"]}
{"word":"promodernist","summary":{"en":"Promodernist means supporting modernism, or a person who supports modernist ideas or art.","zh":"Promodernist 指支持现代主义的（或现代主义的支持者）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting modernism (especially in art, literature, architecture, or cultural ideas).","zh":"支持现代主义（尤指艺术、文学、建筑或文化观念中的现代主义）的。"},"examples":[{"en":"The magazine had a strongly promodernist editorial stance, praising experimental writing.","zh":"这本杂志的社论立场强烈支持现代主义，称赞实验性写作。"},{"en":"Her promodernist taste shows in her love of minimalist design and abstract art.","zh":"她偏爱现代主义的品味体现在她喜欢极简设计和抽象艺术上。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports modernism.","zh":"现代主义的支持者；拥护现代主义的人。"},"examples":[{"en":"He was a promodernist who defended new architecture against traditional critics.","zh":"他是现代主义的拥护者，为新建筑反驳传统派批评。"}]}],"synonyms":["pro-modern","modernist (supporter)","progressive (in arts)"],"phonetic":"ˌproʊˈmɑdərnɪst","extraExplanation":["“promodernist”由前缀 pro-（支持、赞成）+ modernist（现代主义者/现代主义的）构成，多用于讨论20世纪的现代主义运动（如文学中的意识流、艺术中的抽象/立体主义、建筑中的功能主义等）。在学术写作或评论中更常见；日常口语里人们更常说 “pro-modern” 或 “a supporter of modernism”。"]}
{"word":"promodernistic","summary":{"en":"Promodernistic means “in favor of modernism/modernistic ideas,” but it’s rare; pro-modern or modernist is more common.","zh":"promodernistic 指“支持现代主义/现代风格思想的”，但用法较少；更常见的是 pro-modern 或 modernist。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring modernism or modernistic ideas (especially in art, literature, design, or architecture)","zh":"支持或赞成现代主义/现代风格思想的（尤指艺术、文学、设计或建筑领域）"},"examples":[{"en":"Her essay takes a promodernistic view of early 20th-century painting.","zh":"她的文章从支持现代主义的角度解读20世纪早期绘画。"},{"en":"The museum’s promodernistic policies encouraged experimental exhibits.","zh":"博物馆偏向现代主义的政策鼓励实验性展览。"}]}],"synonyms":["pro-modern","pro-modernism","modernist","modernistic"],"phonetic":"/ˌproʊˌmɑːdərˈnɪstɪk/","extraExplanation":["“promodernistic”并不是常见标准词，更多像是由前缀 pro-（支持）+ modernistic（现代风格的）临时组合出来的形容词。在正式写作中更常用：pro-modern、pro-modernism、modernist（现代主义的/现代主义者）或 modernistic（现代风格的）。","如果你想表达“支持现代化（modernization）”，通常用 pro-modernization 或 pro-development，而不是 promodernistic。"]}
{"word":"promonarchic","summary":{"en":"Promonarchic means in favor of monarchy.","zh":"promonarchic 指“支持君主制的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting a monarchy or favoring the system of having a king or queen as head of state.","zh":"支持君主制的；赞成以国王或女王为国家元首的制度的。"},"examples":[{"en":"The party’s platform is openly promonarchic and opposes turning the country into a republic.","zh":"该党的政纲公开支持君主制，反对把国家变成共和国。"},{"en":"Some newspapers took a promonarchic stance during the constitutional debate.","zh":"在宪法辩论期间，一些报纸采取了支持君主制的立场。"}]}],"synonyms":["pro-monarchy","monarchist","royalist"],"phonetic":"/ˌproʊ mɑrˈnɑr kɪk/","extraExplanation":["“promonarchic”通常出现在政治讨论、历史写作或新闻评论中，语气相对正式。更常见的写法是带连字符的“pro-monarchic”。","它并不一定表示支持“专制”，而是泛指支持“君主制”这种体制；在不同国家语境中，可能指支持“立宪君主制”（君主权力受宪法限制）或更传统的君主制。"]}
{"word":"promonarchical","summary":{"en":"Promonarchical means supporting a monarchy (rule by a king or queen).","zh":"promonarchical 指“支持君主制（由国王或女王统治）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a monarchy or favoring rule by a king or queen.","zh":"支持君主制的；拥护由国王或女王统治的。"},"examples":[{"en":"The party took a promonarchical position during the constitutional debate.","zh":"在宪法辩论期间，该政党采取了拥护君主制的立场。"},{"en":"Promonarchical newspapers argued that the crown provided stability.","zh":"拥护君主制的报纸主张王室能带来稳定。"}]}],"synonyms":["monarchist","pro-monarchy","royalist"],"phonetic":"/ˌproʊməˈnɑrkɪkəl/","extraExplanation":["构词提示：pro- 表示“支持、赞成”，monarchical 来自 monarchy（君主制）/ monarch（君主）。因此 promonarchical = “支持君主制的”。","语体与使用场景：多见于政治学、历史写作或新闻评论等较正式语境；日常对话里更常说 pro-monarchy 或 monarchist。","相关表达区分：royalist 常指“支持王室/王权的人或立场”，在特定历史语境中也可指支持某一位君主或王朝；promonarchical 更强调“制度层面（君主制）”。"]}
{"word":"promonarchicalness","summary":{"en":"A rare noun meaning support for or inclination toward monarchy as a political position.","zh":"一个较少见的名词，指对君主制的支持或亲君主制的政治倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for, or a tendency to favor, a monarchy (rule by a king or queen), especially as a political attitude or belief.","zh":"拥护君主制、倾向支持由国王或女王统治的政治制度（君主制）的态度或立场。"},"examples":[{"en":"His promonarchicalness was clear in his speeches praising the royal family.","zh":"他在演讲中称赞王室，明显表现出拥护君主制的立场。"},{"en":"The party’s promonarchicalness appealed to voters who wanted a strong symbolic head of state.","zh":"该党对君主制的支持吸引了那些希望国家有强有力象征性元首的选民。"}]}],"synonyms":["monarchism","pro-monarchy sentiment","royalism","monarchist sentiment"],"phonetic":"/ˌproʊməˈnɑrkɪkəlnəs/","extraExplanation":["这个词非常少见，更多时候人们会用更常见的表达：pro-monarchy / pro-monarchist views（亲君主制的观点）、monarchism（君主主义）、support for the monarchy（支持君主制）。","构词法：pro-（赞成、支持）+ monarchical（君主制的）+ -ness（名词后缀，表示“性质/状态”），所以字面意思就是“亲君主制的性质/倾向”。","常见于政治评论、历史写作或学术语境，用来讨论某人/某团体对君主制的态度；日常口语中不太会用。"]}
{"word":"promonarchist","summary":{"en":"Promonarchist means supporting monarchy, or a person who supports monarchy.","zh":"Promonarchist 指“支持君主制的（人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring monarchy (a king or queen as head of state).","zh":"支持或赞成君主制（以国王或女王为国家元首）的。"},"examples":[{"en":"Some newspapers took a promonarchist position during the constitutional debate.","zh":"在宪法辩论期间，一些报纸采取了亲君主制的立场。"},{"en":"Her promonarchist views were unpopular on campus.","zh":"她支持君主制的观点在校园里并不受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports monarchy.","zh":"支持君主制的人；亲君主派。"},"examples":[{"en":"Promonarchists argued that the royal family provided national unity.","zh":"亲君主派认为王室能提供国家凝聚力。"},{"en":"The rally included republicans, monarchists, and a few promonarchists.","zh":"集会中有共和派、君主派以及少数亲君主派。"}]}],"synonyms":["pro-monarchy","monarchist","royalist"],"phonetic":"/ˌproʊˈmɑnərkɪst/","extraExplanation":["“pro-”表示“支持/赞成”，因此 promonarchist 多用于政治讨论或历史语境中，用来表明立场（如与 republican “共和派/主张共和制的”相对）。","在英语写作中也常见拼写为 pro-monarchist（加连字符），尤其在新闻或学术文章里更清晰。"]}
{"word":"promonarchists","summary":{"en":"Pro-monarchists are people who support a monarchy.","zh":"promonarchists 指支持君主制的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who support monarchy (a king or queen as head of state), especially in politics or public debate","zh":"支持君主制（以国王或女王为国家元首）的人，尤指在政治或公共议题中的立场"},"examples":[{"en":"Pro-monarchists argued that the monarchy provides national stability.","zh":"亲君主制人士认为君主制能带来国家稳定。"},{"en":"In the referendum campaign, pro-monarchists and republicans held competing rallies.","zh":"在公投运动中，亲君主制阵营和共和派分别举行集会互相较劲。"}]}],"synonyms":["monarchists","royalists"],"phonetic":"/ˌproʊ ˈmɑːnərkɪsts/","extraExplanation":["“Pro-”表示“支持、赞成”，因此 pro-monarchist（亲君主制者）常与 republican（共和派）对比使用；在讨论“是否保留王室/是否改为共和国”的政治语境中很常见。","用法上既可写作 pro-monarchist / pro-monarchists，也常见连字符形式；在新闻写作中也可能用 monarchist 来泛指“君主主义者”，而 pro-monarchist 更强调“支持君主制”这一立场。"]}
{"word":"promonarchy","summary":{"en":"Promonarchy means supporting a monarchy, or a supporter of monarchy.","zh":"promonarchy 指“亲君主制的”，也可指“君主制的支持者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring a monarchy (rule by a king or queen).","zh":"支持或拥护君主制（由国王或女王统治）的。"},"examples":[{"en":"The party took a promonarchy position during the constitutional debate.","zh":"在宪法辩论期间，该政党采取了亲君主制的立场。"},{"en":"Some promonarchy groups argue that a monarch can provide national unity above politics.","zh":"一些亲君主制团体认为，君主可以在党派政治之上提供国家凝聚力。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports a monarchy.","zh":"支持君主制的人；亲君主制团体。"},"examples":[{"en":"Promonarchy activists organized a rally calling for the restoration of the crown.","zh":"亲君主制活动人士组织了一场集会，呼吁恢复王室统治。"}]}],"synonyms":["pro-monarchy","monarchist","pro-monarchist","royalist"],"phonetic":"/ˌproʊ ˈmɑnɚki/","extraExplanation":["“promonarchy”由前缀 pro-（支持、赞成）+ monarchy（君主制）构成；也常写作“pro-monarchy”（加连字符更常见），意思更直观。","这是政治语境词，常用来描述立场或阵营；在中立写作中可用“pro-monarchy/pro-monarchist”，避免带有贬褒色彩。"]}
{"word":"promonocyte","summary":{"en":"A promonocyte is an immature precursor cell that develops into a monocyte.","zh":"promonocyte 指“前单核细胞”，是发育成单核细胞的未成熟前体细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of immature white blood cell (a precursor to a monocyte) found mainly in the bone marrow; it develops into a monocyte, which later can become a macrophage in tissues","zh":"前单核细胞：一种未成熟的白细胞（单核细胞的前体），主要存在于骨髓中；可发育为单核细胞，之后在组织中还可进一步成为巨噬细胞"},"examples":[{"en":"In normal blood, promonocytes are usually not seen because they stay in the bone marrow.","zh":"在正常外周血中通常看不到前单核细胞，因为它们主要停留在骨髓里。"},{"en":"The lab report noted increased immature cells, including promonocytes, which required further evaluation.","zh":"检验报告提示未成熟细胞增多，包括前单核细胞，需要进一步评估。"}]}],"synonyms":["monocyte precursor","immature monocyte"],"phonetic":"/ˌproʊˈmɑnəˌsaɪt/","extraExplanation":["词源拆解：pro- 表示“在……之前/前”，mono- 表示“单”，-cyte 表示“细胞”。合起来就是“单核细胞之前的细胞阶段”。","常见学习提示：promonocyte 多用于血液学/病理学语境；日常英语中更常见的是 monocyte（单核细胞）和 macrophage（巨噬细胞）。"]}
{"word":"promonopolist","summary":{"en":"A promonopolist is a person—or a viewpoint—that favors monopolies or monopoly power.","zh":"promonopolist 指支持垄断（或垄断力量）的人，或指偏向垄断的观点/立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or advocates monopolies (situations where one company controls a market)","zh":"支持或主张垄断的人（即某家公司在市场中占据唯一或绝对控制地位的情况）"},"examples":[{"en":"Some critics called him a promonopolist because he argued that one giant firm would make the industry more efficient.","zh":"一些批评者称他为“支持垄断者”，因为他认为由一家巨头公司掌控行业会更高效。"},{"en":"The senator denied being a promonopolist and said he supported competition and antitrust enforcement.","zh":"这位参议员否认自己支持垄断，并表示他支持竞争与反垄断执法。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring monopoly power","zh":"支持或偏向垄断力量的"},"examples":[{"en":"The report takes a promonopolist view, claiming consumers benefit when one platform dominates.","zh":"这份报告持“支持垄断”的观点，声称当一个平台占据主导时消费者会受益。"},{"en":"Her promonopolist arguments were unpopular in a class focused on fair competition.","zh":"在一门强调公平竞争的课程里，她那些支持垄断的论点并不受欢迎。"}]}],"synonyms":["pro-monopoly","monopoly-friendly","anti-competitive"],"phonetic":"/ˌproʊməˈnɑːpələst/","extraExplanation":["“promonopolist”由前缀 pro-（支持、赞成）+ monopolist（垄断者）构成，但它并不是日常高频词。更常见的表达包括：pro-monopoly（支持垄断的）、monopoly-friendly（对垄断友好的）、anti-competitive（反竞争的）。","在经济与法律语境中，它常与 antitrust（反垄断）、competition policy（竞争政策）、market dominance（市场支配地位）等概念一起出现。使用时要注意语气：在公共讨论中它常带批评意味。"]}
{"word":"promonopolistic","summary":{"en":"Pro-monopolistic describes policies or actions that support monopolies or reduce competition.","zh":"pro-monopolistic 指支持垄断或削弱市场竞争的政策或行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting monopolies (markets dominated by one firm) or policies that make monopolies more likely","zh":"支持或偏向垄断（由一家企业主导市场）或更容易导致垄断的政策"},"examples":[{"en":"Critics called the new regulation pro-monopolistic because it made it harder for small competitors to enter the market.","zh":"批评者称这项新规“偏向垄断”，因为它让小型竞争者更难进入市场。"},{"en":"Some economists argue that certain patent rules can be pro-monopolistic if they block innovation for too long.","zh":"一些经济学家认为，某些专利规则如果长期阻碍创新，可能会偏向垄断。"}]}],"synonyms":["anti-competitive","monopoly-friendly","competition-reducing","favoring market concentration"],"phonetic":"/ˌproʊˌmɑnəpəˈlɪstɪk/","extraExplanation":["“pro-monopolistic”常写作带连字符的形式（pro-monopolistic），更清晰易读；也有人写作不带连字符的“promonopolistic”，但较少见。","该词多见于经济学、商业新闻与公共政策讨论中，带有明显评价色彩，常用于批评某项政策/行为“有利于大公司、削弱竞争”。","相关近义表达：anti-competitive（反竞争的）、monopoly-friendly（偏向垄断的）、favoring market concentration（促进市场集中）。"]}
{"word":"promonopoly","summary":{"en":"Promonopoly means supporting or favoring monopoly power in a market.","zh":"promonopoly 指“支持或偏向垄断（垄断势力/垄断市场）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting a monopoly (a situation where one company or group controls a market).","zh":"支持或偏向“垄断”的；主张由一家企业或团体控制某个市场的。"},"examples":[{"en":"Some critics say the new regulations are promonopoly because they make it harder for small businesses to compete.","zh":"一些批评者说新规“偏向垄断”，因为它让小企业更难竞争。"},{"en":"Promonopoly policies can reduce consumer choice and raise prices.","zh":"偏向垄断的政策可能减少消费者选择并抬高价格。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or position that supports monopoly power.","zh":"支持垄断势力的立场或观点。"},"examples":[{"en":"The report takes a strongly promonopoly stance toward large tech mergers.","zh":"这份报告对大型科技并购采取了强烈的“支持垄断”立场。"}]}],"synonyms":["pro-monopoly","monopoly-friendly","anti-competitive"],"phonetic":"/ˌproʊməˈnɑːpəli/","extraExplanation":["“promonopoly”不是日常高频词，更常见的写法是连字符形式“pro-monopoly”。它由前缀“pro-”（支持）+“monopoly”（垄断）组成，常用于商业、经济与公共政策讨论中。","相关概念：如果一项政策被认为会削弱竞争、提高市场集中度，就可能被批评为“pro-monopoly”。相对立的常见表达是“pro-competition”（支持竞争）或“anti-monopoly / antitrust”（反垄断）。"]}
{"word":"promontoried","summary":{"en":"“Promontoried” means “having many headlands or jutting high points of land,” especially along a coast.","zh":"“promontoried”意为“多海岬/多突出处的（尤指海岸）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having promontories (high points of land that stick out into the sea or a lake); marked by jutting headlands.","zh":"有海角/岬角的；以突出的海岬、峭壁为特征的。"},"examples":[{"en":"The island’s promontoried coast is beautiful but difficult to access by boat.","zh":"这座岛屿的海岸线多海岬，景色很美，但乘船不容易靠近。"},{"en":"We hiked along a promontoried shoreline, stopping at each rocky overlook.","zh":"我们沿着多岬角的海岸徒步，在每个岩石观景点停留。"}]}],"synonyms":["headland-studded","rugged","craggy","promontory-rich"],"phonetic":"/prəˈmɑn.təˌrɪd/","extraExplanation":["“promontoried”比较少见，更多时候会用“promontory-rich / headland-studded / rugged (coastline)”来表达类似意思。","词根来自拉丁语 *promontorium*（向前突出的山/岬），由 *pro-*（向前）+ 与“山/丘”相关的词根构成；在文学或描写性写作中，用它可以让画面感更强、更凝练。"]}
{"word":"promontories","summary":{"en":"Promontories are high, projecting pieces of land, especially along a coast.","zh":"promontories 指突出的高地/岬角，尤指海岸边伸入海中的地形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"High points of land that stick out into the sea or into a lower area (like a valley); headlands or cliffs.","zh":"（伸入海中或低地的）岬角；海角；突出的高地/悬崖。"},"examples":[{"en":"We hiked along the coast and stopped at several rocky promontories to watch the sunset.","zh":"我们沿着海岸徒步，在几个岩石岬角停下来观看日落。"},{"en":"From the promontory, you can see the entire bay.","zh":"从岬角上你能看到整个海湾。"}]}],"synonyms":["headlands","capes","points","cliffs"],"phonetic":"/ˈprɑmənˌtɔriz/","extraExplanation":["“promontory”常见于地理、旅行写作和文学描写中，带有一种画面感：高处向外伸出、视野开阔、常伴随峭壁与海浪。","词源来自拉丁语 *promontorium*，含义接近“向前突出的山/高地”。","相关近义词：*headland*（更口语、常用于海岸地形）、*cape*（常用于地名，如 Cape Cod）、*cliff*（强调悬崖本身，不一定“伸出”）。"]}
{"word":"promontory","summary":{"en":"A promontory is a high piece of land that juts out from the coast or stands out from surrounding land.","zh":"promontory 指向外伸出的高地，常为伸入海/湖/河的岬角，也可指地形中突出的部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high piece of land that sticks out into the sea, a lake, or a river; a headland.","zh":"（伸入海、湖或河中的）岬；海角；突出的高地。"},"examples":[{"en":"They stood on the promontory and watched the waves crash below.","zh":"他们站在岬角上，看着海浪在下方拍打礁石。"},{"en":"A lighthouse was built on the rocky promontory to warn ships.","zh":"人们在那片岩石岬角上建了一座灯塔来提醒船只。"}]},{"partOfSpeech":"n.","definition":{"en":"A prominent or projecting part of something (especially a natural feature), like a hill or ridge that stands out.","zh":"（尤指自然地形）突出的部分；凸起处（如显眼的山丘或山脊）。"},"examples":[{"en":"From the promontory of the hill, you can see the entire valley.","zh":"从那座山的突出高地上，你能看到整片山谷。"},{"en":"The castle sat on a promontory above the town.","zh":"城堡坐落在城镇上方的一处突出的高地上。"}]}],"synonyms":["headland","cape","point","outcrop","bluff"],"phonetic":"/ˈprɑmənˌtɔri/","extraExplanation":["“promontory”常用于描写风景、旅行和文学场景，语气较书面，比日常的“point/headland”更正式，也更有画面感。","词源来自拉丁语，含义大致是“向前伸出/突起的地方”。在文学中常用来营造“高处俯瞰”“临海险峻”的氛围。","近义词区分：headland更常指海边岬角；cape常指较大、较知名的海角（如Cape Cod）；cliff强调“峭壁”而不一定“伸入水中”。"]}
{"word":"promoral","summary":{"en":"Promoral (usually “pro-moral”) means supporting or promoting moral values or behavior.","zh":"promoral（通常写作 pro-moral）指支持或提倡道德价值与道德行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually written “pro-moral”) Supporting or encouraging moral behavior, moral values, or ethical standards.","zh":"（少见；通常写作“pro-moral”）支持或提倡道德行为、道德价值观或伦理标准的。"},"examples":[{"en":"The campaign uses pro-moral messages about honesty and respect.","zh":"这项活动用提倡诚信与尊重的“亲道德”信息来宣传。"},{"en":"Some critics say the film is pro-moral, because it clearly rewards kindness and punishes cruelty.","zh":"一些评论者认为这部电影偏“亲道德”，因为它明显奖赏善良、惩罚残忍。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an argument or policy that is based on moral reasons (rather than purely practical or economic ones).","zh":"形容某种论证或政策主要基于道德理由（而非纯粹的实用或经济理由）。"},"examples":[{"en":"Her pro-moral stance focuses on protecting vulnerable people, even if it costs more.","zh":"她的“亲道德”立场强调保护弱势群体，即使成本更高也在所不惜。"}]}],"synonyms":["ethical","moral","value-based","prosocial","principled"],"phonetic":"/proʊˈmɔrəl/","extraExplanation":["“promoral”不是英语里很常见、很固定的词；在正式写作中更常见的是加连字符的“pro-moral”，意思类似“pro-choice / pro-life”里的“pro-（支持）”。","在学术或新闻语境中，你也可以根据具体含义选择更自然的替代词：\n- 强调“讲道德/说教味”：moralistic\n- 强调“合乎伦理”：ethical\n- 强调“促进社会良性行为”：prosocial\n- 强调“价值观导向”：value-based"]}
{"word":"promorph","summary":{"en":"Promorph is an uncommon biology term meaning an idealized basic overall form used to describe or compare structures.","zh":"Promorph 是生物学中较少见的术语，指用于描述或比较结构的理想化“基本总体形态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, uncommon) The basic or idealized overall form/shape of an organism or of a body part, used as a reference in describing structure.","zh":"（生物学，较少见）生物体或某一器官/部位的基本或理想化“总体形态/外形”，用作描述结构时的参照。"},"examples":[{"en":"In comparative anatomy, the promorph helps researchers describe how a limb is organized overall before discussing details.","zh":"在比较解剖学中，promorph 有助于研究者先描述一条肢体的整体组织方式，再讨论细节。"},{"en":"The paper classifies leaf promorphs as a way to compare species.","zh":"该论文用叶片的 promorph（整体形态类型）来比较不同物种。"}]}],"synonyms":["basic form","overall form","morphological type","prototype form"],"phonetic":"/ˈproʊmɔrf/","extraExplanation":["这个词在日常英语中几乎不用，主要出现在形态学（morphology）相关的学术语境里。可理解为“用于比较与描述的典型总体外形/形态框架”。词源上可拆为 pro-（在前、作为基础）+ morph（形态）。如果你是在某篇论文/教材里看到它，也可能与更常见的 promorphology（形态原型学/原型形态学）相关。"]}
{"word":"promorphological","summary":{"en":"Promorphological means “about basic overall form or shape,” a rare/technical term in biology.","zh":"promorphological 指“与生物整体基本外形/形状有关”，属于罕见且偏专业的生物学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to promorphology—the study or description of an organism’s basic external form or overall shape (often used in older or very technical biology writing).","zh":"与“前形态学/基本形态学（promorphology）”有关的——研究或描述生物整体外形、基本形状的（多见于较旧或很专业的生物学语境）。"},"examples":[{"en":"The paper uses a promorphological classification based on overall body shape.","zh":"这篇论文使用一种以前形态学为基础、按整体体型分类的方法。"},{"en":"Promorphological terms can sound old-fashioned compared with modern morphological analysis.","zh":"与现代“形态学分析”相比，前形态学术语听起来可能更偏旧式。"}]}],"synonyms":["morphological","shape-based","form-related"],"phonetic":"/ˌproʊˌmɔrˈfɑlədʒɪkəl/","extraExplanation":["“promorphological”非常少见，更多情况下你会看到“morphological（形态学的）”。如果你的意思是一般的“形态上的/结构上的”，通常用 morphological 更自然。","词源上可拆为 pro-（前、基本）+ morph（形态）+ -logical（……学的/与……相关的）。在一些早期生物学或分类学文献里，promorphology 用来强调“整体外形/基本几何形”的描述，而不深入到细部结构。"]}
{"word":"promorphologically","summary":{"en":"“Promorphologically” is a rare adverb meaning “with a bias toward morphology,” in linguistics or biology depending on context.","zh":"“promorphologically” 很少见，意思是“从偏向形态学（词法/生物形态）的角度、以支持形态学的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that favors or emphasizes morphology (the study of word forms or forms/structure in biology).","zh":"以支持或强调“形态学/词法（或生物形态）”的方式；从偏向形态学的角度。"},"examples":[{"en":"The author argues pro‑morphologically, saying word endings carry the most reliable clues to meaning.","zh":"作者从偏向词法的角度论证，认为词尾变化提供了最可靠的意义线索。"},{"en":"In this paper, species are grouped pro‑morphologically rather than by genetic markers.","zh":"本文更偏向以形态特征而不是基因标记来对物种分组。"}]}],"synonyms":["from a morphological perspective","with a morphological bias","morphology-focused"],"phonetic":"ˌproʊˌmɔrˈfɑlədʒɪkli","extraExplanation":["这个词非常少见，通常不出现在常规词典中，更像是临时造词（ad hoc coinage）。构词上可理解为 pro-（“支持/偏向”）+ morphologically（“形态学地/从形态角度”）。","在语言学里，morphology 指“词法/形态学”（如词根、前后缀、屈折变化：walk/walked）。在生物学里，morphology 指“形态学”（如外形结构特征）。因此具体含义要看学科语境。","更自然的写法常用：from a morphological perspective（从形态学角度），or with a morphological bias（带有形态学偏向）。"]}
{"word":"promorphologist","summary":{"en":"A (rare) term for a scientist who studies general/formal patterns of organism shape (promorphology).","zh":"（较罕见）指研究生物形态总体模式与可能形式（promorphology/前形态学）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies promorphology—general patterns and possible forms (shapes/structures) of organisms, especially in biological morphology.","zh":"研究“前形态学／原形态学（promorphology）”的科学家；关注生物体形态（形状、结构）的总体模式与可能形式（多见于生物形态学语境）。"},"examples":[{"en":"The promorphologist compared leaf shapes to describe a plant’s overall form.","zh":"这位 promorphologist 比较了叶片形状来描述植物的整体形态。"},{"en":"In older biology texts, a promorphologist might classify organisms by recurring structural patterns.","zh":"在较早期的生物学著作中，promorphologist 可能会按反复出现的结构模式来给生物分类。"}]}],"synonyms":["morphologist","biological morphologist","anatomist (context-dependent)"],"phonetic":"/proʊˌmɔrˈfɑlədʒɪst/","extraExplanation":["这个词在现代英语里非常少见，更多出现在较早的形态学（morphology）或分类学（taxonomy）相关文献中。日常或当代学术写作里更常用的说法通常是 morphologist（形态学家）或 evolutionary/developmental morphologist（进化/发育形态学研究者）。","词形可拆解为 pro-（“在前、先于、原初”）+ morphology（形态学）+ -ist（从事某领域的人）。不同学科里 pro- 也可能表示“赞成”，但在这里更接近“原初/基本形式”的含义，需结合语境判断。"]}
{"word":"promorphology","summary":{"en":"A rare term meaning the study of early-stage (developmental) form and structure in organisms.","zh":"一个较少用的术语，指研究生物发育早期的形态与结构（发育形态学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, biology) The study of an organism’s form in its early developmental stages; early-stage or developmental morphology.","zh":"（较少用，生物学）研究生物在发育早期阶段的形态；早期/发育形态学。"},"examples":[{"en":"The paper uses promorphology to describe how the embryo’s shape changes over time.","zh":"这篇论文用 promorphology 来描述胚胎形状如何随时间变化。"},{"en":"In some older texts, promorphology is discussed alongside embryology and comparative anatomy.","zh":"在一些较早的文献中，promorphology 常与胚胎学和比较解剖学一起讨论。"}]}],"synonyms":["developmental morphology","ontogenetic morphology","embryonic morphology"],"phonetic":"/ˌproʊmɔrˈfɑlədʒi/","extraExplanation":["这个词非常少见，多出现在较旧或较专业的学术语境里。现代文献更常用 developmental morphology（发育形态学）、ontogenetic morphology（个体发生形态学）或直接写 embryonic morphology（胚胎形态学）。","词源上可理解为 pro-（“在前、早期”）+ morphology（形态学），强调“形态的早期阶段”。如果你是在某篇论文里看到它，通常是在强调“发育初期的外形/结构特征”。"]}
{"word":"promos","summary":{"en":"“Promos” means promotional materials/ads or special promotional deals (informal plural of “promo”).","zh":"“promos”常指宣传物料/广告，或促销优惠活动；是“promo”的非正式复数用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Promotional materials or advertisements (often short videos, posters, social posts, etc.).","zh":"宣传素材；广告宣传内容（常见于短片、海报、社媒内容等）。"},"examples":[{"en":"The studio released new promos for the movie.","zh":"片方发布了这部电影的新宣传片/宣传物料。"},{"en":"I’m editing promos for our spring campaign.","zh":"我在剪辑我们春季活动的宣传内容。"}]},{"partOfSpeech":"n.","definition":{"en":"Special promotional offers or deals meant to encourage people to buy something.","zh":"促销活动；优惠（用来刺激购买的特别活动）。"},"examples":[{"en":"Check the app for today’s promos.","zh":"去App里看看今天的优惠活动。"},{"en":"They’re running promos on drinks all week.","zh":"他们整周都在对饮品做促销。"}]}],"synonyms":["promotions","ads","advertisements","promotional materials","specials","deals"],"phonetic":"/ˈproʊmoʊz/","extraExplanation":["“promos”是“promotion(s)”或“promotional (materials)”的口语/书面缩写，常见于市场营销、娱乐行业和社交媒体语境。","相关常用搭配：promo video（宣传片）、promo poster（宣传海报）、promo code（优惠码）、promo deal（促销优惠）。","在较正式的写作中，通常用完整形式“promotions”或“promotional materials”。"]}
{"word":"promotability","summary":{"en":"Promotability means how likely or suitable someone is to be promoted, often used as an evaluation category in the workplace.","zh":"Promotability 指一个人在职场中被晋升的可能性/适合度，也常作为绩效或人才评估指标使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being likely to be promoted at work; how suitable someone is for a higher position.","zh":"（职场中）可晋升性；一个人被提拔到更高职位的可能性/适合程度。"},"examples":[{"en":"Her strong communication skills improved her promotability.","zh":"她很强的沟通能力提高了她的可晋升性。"},{"en":"The training program focuses on building promotability for new employees.","zh":"这个培训项目重点帮助新员工提升可晋升性。"},{"en":"Managers should give feedback that helps employees increase their promotability.","zh":"管理者应提供能帮助员工提升可晋升性的反馈。"}]},{"partOfSpeech":"n.","definition":{"en":"A factor used in evaluation (often in HR) to estimate an employee’s future advancement potential.","zh":"（人力资源/绩效评估中）用于判断员工未来晋升潜力的评估指标。"},"examples":[{"en":"In the review, promotability was rated separately from current performance.","zh":"在这次评审中，可晋升性与当前绩效被分开评分。"},{"en":"High performance doesn’t always mean high promotability.","zh":"高绩效并不总是意味着高可晋升性。"}]}],"synonyms":["promotion potential","advancement potential","readiness for promotion","career prospects","upward mobility (related)"],"phonetic":"/prəˌmoʊtəˈbɪləti/","extraExplanation":["“Promotability”常见于公司绩效考核、人才盘点（talent review）和继任计划（succession planning）语境中。它通常不仅看“做得好不好”（performance），还看“能不能胜任更大范围/更高复杂度的工作”，例如领导力、影响力、跨团队协作、学习速度与承担责任的意愿。","在沟通中可以用更具体的说法来表达：例如“readiness for promotion（晋升准备度）”“promotion potential（晋升潜力）”。在一些职场文化里，直接谈“promotability”可能听起来偏评估/偏HR，用更具体的能力描述会更自然。"]}
{"word":"promotable","summary":{"en":"“Promotable” means someone is eligible or likely to be promoted to a higher position.","zh":"“promotable”指某人具备晋升资格或有较大可能被晋升。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be promoted (moved to a higher job position or rank).","zh":"可被晋升的；有晋升资格的。"},"examples":[{"en":"She’s a strong performer and clearly promotable this year.","zh":"她表现很出色，今年显然具备晋升条件。"},{"en":"The review focuses on whether employees are promotable or need more training.","zh":"这次评估主要看员工是否具备晋升潜力，还是需要更多培训。"}]}],"synonyms":["eligible for promotion","promotion-ready","advancement-ready"],"phonetic":"/prəˈmoʊtəbl/","extraExplanation":["“promotable”常用于职场人力资源语境（HR/绩效评估），表示“具备晋升条件/潜力”，偏正式、评价性用语。","词形拆解：promote（晋升/促进）+ -able（能够……的）= “能够被晋升的”。常见搭配：promotable employees / promotable candidate / promotable talent。"]}
{"word":"promote","summary":{"en":"Promote means to encourage growth or progress, to raise someone to a higher position, or to publicize something to gain attention.","zh":"Promote 指促进发展、晋升提拔，或对某事进行宣传推广以获得关注。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To help something happen or grow; to encourage or support it.","zh":"促进；推动；助长（某事的发展或发生）。"},"examples":[{"en":"The program promotes healthy eating in schools.","zh":"这个项目促进学校里的健康饮食。"},{"en":"They planted trees to promote cleaner air.","zh":"他们种树来促进空气更洁净。"}]},{"partOfSpeech":"vt.","definition":{"en":"To raise someone to a higher job rank or position.","zh":"晋升；提拔（某人到更高的职位或等级）。"},"examples":[{"en":"She was promoted to manager after two years.","zh":"两年后她被晋升为经理。"},{"en":"Hard work doesn’t always guarantee you’ll get promoted.","zh":"努力工作并不总能保证你会被晋升。"}]},{"partOfSpeech":"vt.","definition":{"en":"To advertise or actively try to increase sales or attention for a product, event, idea, or person.","zh":"推广；宣传（产品、活动、理念或某人，以吸引关注/提高销量）。"},"examples":[{"en":"The band is promoting its new album online.","zh":"这支乐队正在网上宣传他们的新专辑。"},{"en":"The city promoted the festival to attract tourists.","zh":"这座城市宣传该节日以吸引游客。"}]}],"synonyms":["encourage","advance","support","boost","publicize","advertise","market","upgrade"],"phonetic":"/prəˈmoʊt/","extraExplanation":["“promote”常见搭配：promote + 名词（promote health/peace/understanding）；be promoted to + 职位（be promoted to supervisor）；promote + 产品/活动（promote a movie/a brand）。","含义区分：promote（积极推动/宣传）比“support”（支持）更强调主动采取行动；比“advertise”（做广告）更宽泛，除了广告还包括公关、活动、传播等方式。","词源提示：来自拉丁语“promovere”，意为“向前推进”，所以既可以指推动事物发展，也可以指把人“往上推”到更高职位。"]}
{"word":"promoted","summary":{"en":"“Promoted” usually means someone was raised to a higher position, or something was advertised to gain attention.","zh":"“promoted”通常表示某人被升职/晋升，或某事物被宣传推广以获得关注。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"raised to a higher position, rank, or level (often at work or in an organization)","zh":"被提升到更高的职位、级别或层级（常用于工作或组织中）"},"examples":[{"en":"She was promoted to manager after two years.","zh":"两年后她被升为经理。"},{"en":"He got promoted because of his strong performance.","zh":"他因为出色的表现而被升职。"}]},{"partOfSpeech":"vt.","definition":{"en":"helped to make something popular by advertising or supporting it","zh":"推广、宣传某事物，使其更受欢迎"},"examples":[{"en":"The movie was promoted heavily on social media.","zh":"这部电影在社交媒体上被大力宣传。"},{"en":"The company promoted its new product with free samples.","zh":"公司通过赠送试用装来推广新产品。"}]}],"synonyms":["advanced","elevated","upgraded","publicized","advertised"],"phonetic":"/prəˈmoʊtɪd/","extraExplanation":["“promoted”既可以描述“人被升职”（be promoted），也可以描述“事物被推广”（a product is promoted）。中文里常分别对应“升职/晋升”和“宣传/推广”。","常见搭配：be promoted to + 职位/级别（be promoted to senior engineer）；get promoted（口语更常用）；promote A to B（把A提升为B）。"]}
{"word":"promotement","summary":{"en":"“Promotement” is a rare, nonstandard form meaning “promotion.” Use “promotion” in modern English.","zh":"“promotement”是罕见且非标准的形式，意思接近“promotion（晋升/推广）”。现代英语中应使用“promotion”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) The act of promoting someone or something; promotion or advancement.","zh":"（非标准/罕见）提升、晋升或推广的行为；相当于 promotion（晋升/推广）。"},"examples":[{"en":"The correct word in modern English is “promotion,” not “promotement.”","zh":"现代英语里正确用法是“promotion”，而不是“promotement”。"},{"en":"She worked hard for a promotion at her company.","zh":"她为在公司获得晋升而努力工作。"}]}],"synonyms":["promotion","advancement","elevation","upgrade","marketing"],"phonetic":"/prəˈmoʊtmənt/","extraExplanation":["“promotement”在当代英语中几乎不用，通常被视为拼写错误或不自然的造词；标准表达是“promotion”。","构词上看，它像把动词 promote 加上名词后缀 -ment（如 development），但英语里习惯用 promotion（来自拉丁语词源的名词形式），因此更地道、更常见。","如果你在旧文本、非母语写作或某些非正式场合看到“promotement”，建议在正式写作/考试中改为“promotion”。"]}
{"word":"promoten","summary":{"en":"Promote means to support or encourage something, advertise it, or give someone a higher job position.","zh":"Promote 表示促进/推广/宣传某事，或使某人升职晋升。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to help something become more popular, successful, or widely known; to encourage or support it","zh":"促进；推广；宣传（使某事更受欢迎、更成功或更广为人知）"},"examples":[{"en":"The city is trying to promote tourism.","zh":"这座城市正在努力推广旅游业。"},{"en":"This program promotes healthy eating in schools.","zh":"这个项目在学校里促进健康饮食。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone a higher position or rank in a job or organization","zh":"升职；晋升（给某人更高的职位或级别）"},"examples":[{"en":"She was promoted to manager last month.","zh":"她上个月被晋升为经理。"},{"en":"They promoted him for his strong performance.","zh":"由于表现出色，他们给他升了职。"}]},{"partOfSpeech":"vt.","definition":{"en":"to advertise or market a product, event, or idea","zh":"推销；促销（为产品、活动或理念做广告/营销）"},"examples":[{"en":"The company is promoting its new phone online.","zh":"公司正在网上宣传它的新手机。"},{"en":"We need to promote the event on social media.","zh":"我们需要在社交媒体上宣传这次活动。"}]}],"synonyms":["encourage","support","advance","advertise","market","publicize"],"phonetic":"/prəˈmoʊt/","extraExplanation":["“promoten”不是标准英语拼写，通常你想写的是“promote”。正确形式：promote / promotes / promoted / promoting。","常见搭配：promote A (推广/促进A)；promote sb to + 职位（把某人晋升为……）；promote A as B（把A宣传为B）。"]}
{"word":"promoter","summary":{"en":"A promoter is usually someone or a group that organizes or publicizes something; in science it can mean a reaction booster (chemistry) or a gene-control DNA region (biology).","zh":"promoter 通常指组织或宣传某事的人/机构；在科学语境中也可指化学促进剂或生物学中的基因启动子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that helps start, support, or publicize an event, product, or idea (often by organizing it or trying to attract attention)","zh":"（活动、产品或理念的）发起者；推动者；推广者（常指组织并吸引关注）"},"examples":[{"en":"The promoter booked the venue and advertised the concert online.","zh":"主办方订好了场地，并在网上为演唱会做宣传。"},{"en":"She works as a club promoter, bringing in guests for weekend parties.","zh":"她做夜店推广，负责为周末派对拉客。"},{"en":"Local business groups were strong promoters of the new festival.","zh":"当地商业团体是新节日的积极推动者。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance that helps a chemical process happen faster or more effectively (common in chemistry)","zh":"（化学）促进剂；助剂（帮助反应更快或更有效进行的物质）"},"examples":[{"en":"Adding a promoter increased the catalyst’s performance.","zh":"加入促进剂提高了催化剂的性能。"},{"en":"The reaction needs a catalyst and a promoter to run efficiently.","zh":"这种反应需要催化剂和促进剂才能高效进行。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific DNA region that controls when and how strongly a gene is turned on (biology/genetics)","zh":"（生物/遗传学）启动子（控制基因何时以及多强表达的DNA区域）"},"examples":[{"en":"The promoter determines where transcription begins.","zh":"启动子决定转录从哪里开始。"},{"en":"Scientists used a strong promoter to increase protein production.","zh":"科学家使用强启动子来提高蛋白质产量。"}]}],"synonyms":["organizer","publicist","backer","sponsor","advocate"],"phonetic":"/prəˈmoʊtər/","extraExplanation":["在日常英语里，promoter 最常见的是“活动主办/推广的人或机构”（如 concert promoter）。在学术语境中，它也很常见：化学里的 promoter 是“增强催化/反应效果的助剂”，生物学里的 promoter 是“基因表达的调控区域（启动子）”。判断含义时主要看上下文：音乐/活动→主办推广；实验/反应→化学助剂；基因/转录→启动子。"]}
{"word":"promoters","summary":{"en":"“Promoters” are people or organizations that promote or organize something, especially events, products, ideas, or new businesses.","zh":"“promoters”指推广或组织推动某事的人或组织，常用于活动、产品、理念或新企业等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or organizations that help make something happen by supporting, advertising, or organizing it (such as an event, product, or idea).","zh":"推动某事发生的人或组织；通过支持、宣传或组织来推广（如活动、产品或理念）的人。"},"examples":[{"en":"The concert promoters booked the venue and advertised the show.","zh":"演唱会主办/推广方订好了场地，并为演出做了宣传。"},{"en":"Community promoters encouraged residents to join the health program.","zh":"社区推广人员鼓励居民参加健康项目。"}]},{"partOfSpeech":"n.","definition":{"en":"In business and finance, people who help start a company or raise interest and investment in it.","zh":"（商业/金融）发起或促成公司成立，并为其吸引关注与投资的人。"},"examples":[{"en":"The promoters presented the business plan to potential investors.","zh":"发起人向潜在投资者展示了商业计划。"},{"en":"Early promoters of the startup owned shares in the company.","zh":"这家初创公司的早期发起人持有公司股份。"}]}],"synonyms":["organizers","marketers","advertisers","sponsors","backers"],"phonetic":"/prəˈmoʊtərz/","extraExplanation":["“promoters”是“promoter”的复数。日常语境里常指活动主办方/推广方（比如演唱会promoter）。在一些国家的公司法语境中，promoter也可指“公司发起人”，含义更偏正式。","相关词：promote（v. 推广；提升/晋升）、promotion（n. 推广；促销；晋升）、publicist（n. 公关宣传人员，侧重媒体曝光）。"]}
{"word":"promotes","summary":{"en":"“Promotes” means encourages or helps something develop, advertises something, or raises someone to a higher position.","zh":"“promotes” 表示促进/推动发展、宣传推广，或晋升某人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person, idea, or action) to encourage or support something so it grows, happens, or becomes more popular.","zh":"（人、想法或行为）促进、推动、支持某事发展或发生。"},"examples":[{"en":"The program promotes healthy eating at school.","zh":"这个项目在学校推动健康饮食。"},{"en":"Good sleep promotes better learning.","zh":"良好的睡眠能促进更好的学习。"}]},{"partOfSpeech":"v.","definition":{"en":"to advertise or publicize a product, event, or service in order to attract attention or customers.","zh":"宣传、推广（产品、活动或服务），以吸引关注或顾客。"},"examples":[{"en":"The company promotes its new app online.","zh":"这家公司在网上推广它的新应用。"},{"en":"She promotes the concert on social media.","zh":"她在社交媒体上宣传这场音乐会。"}]},{"partOfSpeech":"v.","definition":{"en":"to raise someone to a higher position or rank; to give a promotion.","zh":"晋升某人；提升职位或级别。"},"examples":[{"en":"He works hard and hopes the manager promotes him soon.","zh":"他努力工作，希望经理很快晋升他。"},{"en":"The officer promotes her team members based on performance.","zh":"这名主管根据表现提拔团队成员。"}]}],"synonyms":["encourages","supports","advances","boosts","publicizes","advertises","markets","elevates"],"phonetic":"/prəˈmoʊts/","extraExplanation":["“promotes” 是动词 promote 的一般现在时第三人称单数形式（he/she/it promotes）。常见搭配：promote health（促进健康）、promote growth（促进增长）、promote a product/event（推广产品/活动）、promote someone to + 职位（把某人晋升为……）。"]}
{"word":"promoting","summary":{"en":"“Promoting” means encouraging development, advertising/publicizing something, or giving someone a higher position.","zh":"“promoting”可指促进发展、宣传推广，或晋升提拔。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"encouraging or helping something grow, spread, or become successful; supporting development or improvement","zh":"促进（某事）发展、传播或成功；推动、助长"},"examples":[{"en":"The school is promoting healthy eating habits.","zh":"学校正在推广健康饮食习惯。"},{"en":"Good sleep promotes better memory and mood.","zh":"良好的睡眠能促进更好的记忆力和情绪。"}]},{"partOfSpeech":"v.","definition":{"en":"trying to increase awareness, interest, or sales of something; advertising or publicizing","zh":"宣传（某事）以提高知名度、兴趣或销量；推广"},"examples":[{"en":"She is promoting the new movie on social media.","zh":"她正在社交媒体上宣传这部新电影。"},{"en":"They’re promoting a sale this weekend.","zh":"他们正在宣传本周末的促销活动。"}]},{"partOfSpeech":"v.","definition":{"en":"moving someone to a higher job position or rank; giving a promotion","zh":"晋升（某人）；提拔"},"examples":[{"en":"The company is promoting him to manager.","zh":"公司正在把他晋升为经理。"},{"en":"She was promoted after promoting the team’s success for years.","zh":"她多年来推动团队成功后获得了晋升。"}]}],"synonyms":["encouraging","supporting","advancing","publicizing","advertising","boosting","uplifting"],"phonetic":"/prəˈmoʊtɪŋ/","extraExplanation":["“promoting”是动词“promote”的现在分词/动名词形式：可以表示正在进行的动作（They are promoting...），也可以像名词一样使用（Promoting teamwork is important. 促进团队合作很重要）。","常见搭配：promote health/learning/peace（促进健康/学习/和平）；promote a product/brand/event（推广产品/品牌/活动）；promote someone to + 职位（晋升某人到……）。"]}
{"word":"promotingly","summary":{"en":"“Promotingly” means “in a way that promotes or supports,” sometimes specifically “in a promotional/advertising way.”","zh":"“promotingly”表示“以促进、推动的方式”，有时特指“以宣传/促销的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that promotes or helps something grow, spread, or succeed; supportively.","zh":"以促进、推动（某事）发展、传播或成功的方式；起推动作用地。"},"examples":[{"en":"The organization spoke promotingly about reading programs for young children.","zh":"该组织以推动性的方式谈到面向幼儿的阅读项目。"},{"en":"She wrote promotingly of the new policy because it could reduce waste.","zh":"她以促进性的态度撰写了这项新政策，因为它可能减少浪费。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a promotional/advertising manner; in a way meant to market or publicize something.","zh":"以宣传、促销的方式；以营销推广为目的地。"},"examples":[{"en":"The product was described promotingly in the video, highlighting its main features.","zh":"视频以促销口吻介绍了该产品，强调了它的主要功能。"},{"en":"The company posted promotingly on social media to attract new customers.","zh":"公司在社交媒体上以宣传方式发帖以吸引新客户。"}]}],"synonyms":["supportively","encouragingly","advocatingly","in a promotional way","for promotional purposes"],"phonetic":"/prəˈmoʊtɪŋli/","extraExplanation":["“promotingly”在现代英语中较少见，写作里更常用、更自然的说法是：\n- supportively（支持性地）\n- in a way that promotes…（以促进……的方式）\n- for promotional purposes / in a promotional way（出于宣传目的/以宣传方式）\n在正式写作中，如果你想表达“带宣传性质地”，用“promotional”相关表达通常更地道。"]}
{"word":"promotion","summary":{"en":"Promotion most commonly means a job advancement, and it can also mean marketing or sales activities to increase attention or purchases.","zh":"Promotion 最常见意思是“升职/晋升”，也可指“推广/促销/宣传”等营销活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an act of moving someone to a higher job position or rank; an advancement","zh":"（职位/军衔的）晋升；升职"},"examples":[{"en":"She got a promotion after leading the project successfully.","zh":"她成功带领项目后获得了晋升。"},{"en":"He’s hoping for a promotion to manager this year.","zh":"他希望今年能升职当经理。"}]},{"partOfSpeech":"n.","definition":{"en":"activities meant to make people notice, buy, or support a product, service, event, or idea; advertising/marketing","zh":"（产品/活动/理念的）推广；促销；宣传"},"examples":[{"en":"The movie’s promotion included interviews and social media ads.","zh":"这部电影的宣传包括采访和社交媒体广告。"},{"en":"They’re running a weekend promotion: buy one, get one free.","zh":"他们在做周末促销：买一送一。"}]}],"synonyms":["advancement","raise","elevation","marketing","advertising","publicity","sales promotion"],"phonetic":"/prəˈmoʊʃən/","extraExplanation":["“promotion”在职场语境里几乎总是“升职/晋升”；在商业语境里多指“推广/促销”。常见搭配：get/receive a promotion（获得晋升）、be up for promotion（有机会被提拔）、promotion to + 职位（晋升为……）、sales promotion（销售促销）、promotion campaign（推广活动）。","词源上来自拉丁语“promovere”（向前推动），所以既能表示“把人往前推到更高职位”，也能表示“推动产品/想法让更多人知道”。"]}
{"word":"promotional","summary":{"en":"Promotional describes something used to advertise or boost sales/interest, or something that helps someone advance (especially at work).","zh":"promotional 指“用于宣传/促销的”，也可指“有助于晋升或提升发展的（尤指职场）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to advertise or help sell a product, service, event, or idea; meant to attract attention and increase interest.","zh":"用于宣传或促销的；旨在吸引注意、提升兴趣并促进销售（或推广活动/观念）。"},"examples":[{"en":"The company released a promotional video for the new phone.","zh":"公司发布了一段新手机的宣传视频。"},{"en":"We’re offering a promotional discount this week only.","zh":"我们本周推出限时促销折扣。"},{"en":"She wore a promotional T-shirt at the event.","zh":"她在活动上穿了一件宣传T恤。"}]},{"partOfSpeech":"adj.","definition":{"en":"Serving to help someone’s career, status, or chances of success; advancing (often used in workplaces).","zh":"有助于晋升或提升地位的；有利于发展（常用于职场语境）。"},"examples":[{"en":"Leading this project could be very promotional for your career.","zh":"负责这个项目对你的职业发展很有帮助。"},{"en":"He chose tasks that were more promotional than routine work.","zh":"他选择了更有助于晋升的任务，而不是日常琐事。"}]}],"synonyms":["advertising","marketing","publicity","sales","advancing","career-boosting"],"phonetic":"/prəˈmoʊʃənəl/","extraExplanation":["“promotional”来自动词 promote（促进、推广、晋升）+ 形容词后缀 -ional，常见搭配有：promotional campaign（宣传活动/推广活动）、promotional material(s)（宣传资料）、promotional offer（促销优惠）、promotional code（优惠码）。","在商业语境中，“promotional”通常偏“营销/促销”；在职场语境中则更接近“有助于升职/增加曝光”的意思。注意不要把它和“promotion（晋升/促销活动）”的具体名词含义混淆。"]}
{"word":"promotions","summary":{"en":"“Promotions” most often means either job advancements (promotions at work) or sales/marketing activities (special offers or advertising).","zh":"“promotions”最常见指两类：职场中的晋升/升职，或商业中的促销/推广活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A move to a higher position or rank in a job or organization, usually with more responsibility and often higher pay.","zh":"（工作或组织中的）晋升；升职（通常责任更大，常伴随加薪）"},"examples":[{"en":"She got a promotion after leading the project successfully.","zh":"她成功领导了这个项目后获得了晋升。"},{"en":"He’s hoping for a promotion this year.","zh":"他希望今年能升职。"}]},{"partOfSpeech":"n.","definition":{"en":"Activities or advertising used to increase sales or public interest in a product, service, event, or brand.","zh":"促销；推广（通过活动或广告提高销量或关注度）"},"examples":[{"en":"The store is running a promotion: buy one, get one free.","zh":"这家店在做促销：买一送一。"},{"en":"They used social media for the promotion of the new app.","zh":"他们用社交媒体来推广这款新应用。"}]}],"synonyms":["advancements","raises","upgrades","sales","discounts","campaigns","marketing"],"phonetic":"/prəˈmoʊʃənz/","extraExplanation":["“promotions”是名词复数形式。单数是“promotion”。根据语境，它最常见的两种意思是：1）升职（职场语境）；2）促销/推广（商业营销语境）。","搭配提示：\n- 升职：get/receive a promotion（获得晋升）, a promotion to manager（晋升为经理）, promotion prospects（晋升前景）\n- 促销：run a promotion（开展促销）, sales promotion（促销活动）, promotional materials（宣传资料）","词源小知识：promotion 来自拉丁语“promovere”（向前推动）。所以它既可以表示“把人往更高职位推动”（晋升），也可以表示“推动产品被更多人知道”（推广/促销）。"]}
{"word":"promotive","summary":{"en":"Promotive means “intended to promote or encourage progress,” often used in formal contexts like education, policy, or research.","zh":"Promotive 指“用于促进、推动进步的”，常见于较正式的教育、政策或研究语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to promote something (such as sales, growth, or awareness); encouraging progress or improvement.","zh":"用于促进某事（如销售、增长或认知）；起推动、促进作用的。"},"examples":[{"en":"The company launched a promotive campaign to increase brand awareness.","zh":"公司发起了一项促进性的宣传活动来提高品牌知名度。"},{"en":"Teachers often use promotive feedback to help students improve.","zh":"老师常用促进性的反馈来帮助学生进步。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In psychology/education) Helping or supporting another person’s learning or success, especially through cooperative interaction.","zh":"（心理学/教育语境）通过合作互动来帮助或支持他人的学习与成功的；具有促进作用的。"},"examples":[{"en":"In group work, promotive interaction means students encourage and assist one another.","zh":"在小组合作中，“促进性互动”指学生彼此鼓励并互相帮助。"},{"en":"The study measured how promotive behaviors affected team performance.","zh":"该研究衡量了促进性行为如何影响团队表现。"}]}],"synonyms":["promoting","encouraging","supportive","facilitative"],"phonetic":"/prəˈmoʊtɪv/","extraExplanation":["“promotive”来自动词 promote（促进、提升）。在日常英语里更常见的搭配是 promotional（促销的、推广的，偏商业营销）和 promotive（促进性的、推动发展的，语气更“功能性/效果导向”）。例如：promotional email（促销邮件）更常见；promotive measures（促进性措施）多见于政策、教育、研究或正式写作。","常见搭配：promotive effect（促进作用/效果），promotive factor（促进因素），promotive interaction（促进性互动），promotive measures/policies（促进性措施/政策）。"]}
{"word":"promotiveness","summary":{"en":"Promotiveness means the quality or strength of promoting or encouraging growth, success, or improvement.","zh":"Promotiveness 指“促进性/推动力”，即促进增长、成功或改进的性质或强度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or power of promoting or helping something develop, succeed, or increase (often used in academic or formal writing)","zh":"促进性；推动力（指促进某事发展、成功或增长的性质或作用，常见于学术或正式文体）"},"examples":[{"en":"Researchers tested the promotiveness of the new training program on employee performance.","zh":"研究人员测试了这个新培训项目对员工绩效的促进性。"},{"en":"The report discusses the promotiveness of public transit for economic growth.","zh":"报告讨论了公共交通对经济增长的促进作用。"},{"en":"They compared the promotiveness of different fertilizers on plant growth.","zh":"他们比较了不同肥料对植物生长的促进效果。"}]}],"synonyms":["promoting effect","promotional power","stimulating effect","facilitating effect","supportiveness"],"phonetic":"/prəˈmoʊtɪvnəs/","extraExplanation":["“promotiveness”并不是日常高频词，更常见于论文、研究报告或政策文本，用来抽象概括“促进作用/促进程度”。在更自然的英语里，人们常改用：the promoting effect（促进作用）、the ability to promote…（促进……的能力）、promotional value（推广价值，偏市场营销）、how well it promotes…（它在多大程度上促进……）。"]}
{"word":"promotor","summary":{"en":"“Promotor” usually means a promoter (someone who promotes/organizes something). It is also common in public health for a community health worker, and sometimes used for a gene “promoter” in biology.","zh":"“promotor”通常指推广者/主办方（promoter 的较少见拼写）。它也常用于公共卫生，指社区健康工作者；在生物学中有时也指基因的“启动子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly) a person or company that promotes something (an event, product, or idea), especially by organizing it or trying to make it popular; a less common spelling of “promoter.”","zh":"（常见用法）推广或宣传某事物（活动、产品或理念）的人或公司，常通过组织或宣传来让它更受欢迎；也可视为“promoter”的较少见拼写。"},"examples":[{"en":"The promotor organized the concert and handled the advertising.","zh":"这位推广人/主办方组织了演唱会并负责宣传。"},{"en":"They hired a promotor to build interest in the new brand.","zh":"他们雇了一位推广人员来提高新品牌的关注度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Public health, especially in U.S. Spanish-speaking communities) a community health worker who connects people with health education and services; often used from Spanish “promotor/promotora (de salud).”","zh":"（公共卫生领域，尤其在美国西语社区）社区健康工作者，帮助居民获得健康教育与医疗服务；常来自西语“promotor/promotora（de salud）”。"},"examples":[{"en":"A promotor visited the neighborhood to share information about diabetes prevention.","zh":"一位社区健康工作者到社区分享糖尿病预防信息。"},{"en":"The clinic works with promotores to reach migrant families.","zh":"诊所与社区健康工作者合作，服务流动劳工家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Genetics) a “promoter”: a region of DNA that helps start the transcription of a gene (the on/off control area).","zh":"（生物/遗传学）“启动子/启动区”：DNA上一段区域，帮助启动基因的转录（类似开关控制区）。"},"examples":[{"en":"The mutation occurred in the promotor region, reducing gene expression.","zh":"突变发生在启动子区域，导致基因表达降低。"},{"en":"Scientists tested whether the promotor was strong enough to drive the gene.","zh":"科学家测试该启动子是否足够强以驱动该基因。"}]}],"synonyms":["promoter","organizer","publicist","sponsor","community health worker"],"phonetic":"/proʊˈmoʊtər/","extraExplanation":["在一般英文里更常见的拼写是 promoter；promotor 多见于两类语境：①西语影响的公共卫生/社区工作（如 promotor(a) de salud），②生物学里把 promoter 写成 promotor 的变体（部分资料或写作习惯）。写作时若不确定，日常语境优先用 promoter。"]}
{"word":"promotorial","summary":{"en":"Promotorial means ‘related to promotion,’ and it is most often used in scientific contexts for ‘tumor-promoting’ effects.","zh":"Promotorial 意为“与促进/推广有关”，最常见于科研语境，指“具有肿瘤促进作用”的影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to promoting something (especially marketing, publicity, or encouraging an activity).","zh":"与推广、宣传或促进某事有关的（尤指营销、宣传或鼓励某种活动）。"},"examples":[{"en":"The company launched a promotorial campaign to introduce the new app.","zh":"公司发起了一项推广宣传活动来介绍这款新应用。"},{"en":"She wrote a short promotorial post for the event on social media.","zh":"她在社交媒体上为这场活动写了一篇简短的宣传帖。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Relating to tumor promotion—the stage in carcinogenesis where certain agents help already-initiated cells grow or proliferate.","zh":"（生物/医学）与“肿瘤促进”有关的——在致癌过程中，某些因子帮助已发生初始变化的细胞生长或增殖的阶段。"},"examples":[{"en":"Researchers tested the chemical for promotorial effects in a mouse model.","zh":"研究人员在小鼠模型中测试了该化学物质的肿瘤促进作用。"},{"en":"Alcohol is sometimes discussed as a possible promotorial factor rather than a direct initiator.","zh":"酒精有时被讨论为可能的“促进因子”，而非直接的“起始因子”。"}]}],"synonyms":["promotional","promoting","promoter-related","tumor-promoting"],"phonetic":"/ˌproʊməˈtɔriəl/","extraExplanation":["“promotorial”在日常英语中非常少见；更常见的表达是“promotional”（宣传的）或“promoting”（促进/推广的）。在科研写作里它更常出现在“promotorial effect/activity”（促进作用/促进活性）这样的搭配中，尤其是讨论致癌过程（initiation 起始 → promotion 促进 → progression 进展）。写作时如果不是医学/毒理学语境，通常用“promotional”会更自然。"]}
{"word":"promotress","summary":{"en":"A rare word meaning “female promoter.” In modern English, “promoter” is usually used instead.","zh":"一个很少见的词，意思是“女推广者/女宣传者”。现代英语通常直接用不分性别的 promoter。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who promotes something (such as an event, product, or idea); a female promoter.","zh":"（罕见）女推广者；女推销/宣传人员；女倡导者。"},"examples":[{"en":"The promotress organized a small concert tour for local musicians.","zh":"这位女推广人组织了本地音乐人的小型巡演。"},{"en":"In the article, she was described as a promotress of public health education.","zh":"文章称她是公共健康教育的倡导者。"}]}],"synonyms":["promoter","advocate","supporter","champion"],"phonetic":"/prəˈmoʊtrəs/","extraExplanation":["“promotress”非常少见，属于带有性别标记的旧式用法（-ess 表示“女性”，如 actress）。现代英语更常用不分性别的“promoter”或“advocate”，因此在正式写作中一般建议用“promoter”。"]}
{"word":"promotrix","summary":{"en":"A rare formal word meaning “female promoter.”","zh":"一个罕见的正式用语，意思是“女推广者/女倡导者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female promoter; a woman who promotes, supports, or advances an idea, cause, person, or project (rare, formal).","zh":"女推动者；女推广者；指推动、支持或促进某个理念、事业、人物或项目的女性（罕见、正式用语）。"},"examples":[{"en":"In the old records, she is described as a promotrix of education in the community.","zh":"在旧档案中，她被描述为当地教育事业的女推动者。"},{"en":"The article praised her as a promotrix of public health reform.","zh":"文章称赞她是公共卫生改革的女倡导者。"}]}],"synonyms":["promoter","advocate","supporter","sponsor","champion"],"phonetic":"/prəˈmoʊtrɪks/","extraExplanation":["“promotrix”是由拉丁语词尾“-trix”（表示女性施动者，如“aviatrix”）构成的女性形式，对应更常见的“promoter”。现代英语里一般不特别区分性别，通常用“promoter/advocate/sponsor”等更自然。","在法律或历史文献中偶尔可见该词，用来强调某个角色是女性；日常写作中使用可能显得古旧或刻意。"]}
{"word":"promovable","summary":{"en":"“Promovable” (rare) means capable of being moved forward or advanced; in most everyday contexts, use “movable” or “promotable” instead.","zh":"“promovable”（少见）指可被向前推进或转移；日常语境更常用“movable”（可移动的）或“promotable”（可晋升的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be moved forward, advanced, or shifted; movable or transferable (rare/technical).","zh":"可被向前推进、推进发展或转移的；可移动的（较少见/偏技术用法）。"},"examples":[{"en":"The design includes a promovable platform that can slide forward for easier access.","zh":"这个设计包含一个可推进的平台，可以向前滑动以便更容易取用。"},{"en":"In some older legal writing, certain rights were described as promovable from one holder to another.","zh":"在一些较早的法律写作中，某些权利被描述为可从一个持有人转移给另一个人。"}]}],"synonyms":["movable","transferable","shiftable","advanceable"],"phonetic":"/proʊˈmuːvəbəl/","extraExplanation":["“promovable”在现代英语里很少见，很多时候人们其实想说的是：\n- “movable / moveable”（可移动的）\n- “promotable”（可被提拔的/可晋升的，指人或职位发展）\n如果你是在工作、简历或绩效语境里表达“可晋升”，通常用“promotable”。如果是物体“可移动”，用“movable”。","词源上可联系拉丁语“promovere”（向前推动、推进），因此“promovable”可理解为“可被推进/向前移动的”。在工程、结构描述或较旧的正式文体中偶尔会出现。"]}
{"word":"promoval","summary":{"en":"“Promoval” is not standard English; it’s usually a misspelling of “promotion” (most common) or another word depending on context.","zh":"“promoval”不是标准英语；通常是“promotion”等词的拼写错误，具体取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) promotional activity; the act of promoting something (more commonly: “promotion” or “promotional work”).","zh":"（非标准/较少见）宣传推广活动；推广某事的行为（更常用：promotion 或 promotional work）。"},"examples":[{"en":"The company increased its online promovals before the product launch. (Better: promotions)","zh":"公司在产品发布前增加了线上推广活动。（更好：promotions）"},{"en":"We need a stronger promotion plan, not just a few short ads.","zh":"我们需要更强的推广计划，而不只是几条短广告。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling of a common word, depending on context—often “promotion,” sometimes “approval,” “removal,” or “proposal.”","zh":"可能是常见词的拼写错误，需看语境——常见是 promotion，有时也可能是 approval、removal 或 proposal。"},"examples":[{"en":"If you meant “promotion,” you can say: I got a promotion at work.","zh":"如果你想表达“升职/晋升”，可以说：I got a promotion at work.（我升职了。）"},{"en":"If you meant “approval,” you can say: The plan needs approval from the manager.","zh":"如果你想表达“批准/同意”，可以说：The plan needs approval from the manager.（计划需要经理批准。）"}]}],"synonyms":["promotion","promotions","promotional campaign","marketing","advertising"],"phonetic":"/prəˈmoʊvəl/","extraExplanation":["“promoval”在标准英语里几乎不用，很多拼写检查也会把它当作错误。正式写作/考试建议用“promotion”（推广/升职）或“promotions”（促销活动）。","如果你把原句发我（例如一整句），我可以帮你判断最可能想写的是哪个词，并给出更自然的表达。"]}
{"word":"promove","summary":{"en":"“Promove” isn’t standard English; you probably mean “promote.”","zh":"“promove”不是标准英语；你很可能想写“promote”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of “promote.”","zh":"不是标准英语单词，通常是把“promote”拼错了。"},"examples":[{"en":"I think you meant “promote,” not “promove.”","zh":"我觉得你想写的是“promote”，不是“promove”。"},{"en":"Correct: The company wants to promote the new product.","zh":"正确：公司想要推广这款新产品。"}]}],"synonyms":["promote (correct spelling)","advance","encourage","boost","advertise"],"phonetic":"/prəˈmoʊt/","extraExplanation":["“promote”常见意思包括：①晋升（promote someone to manager）②推广/促销（promote a product）③促进（promote peace/health）。如果你告诉我你想表达的中文或句子语境，我可以帮你选最合适的用法并改写句子。"]}
{"word":"promovent","summary":{"en":"“Promovent” is not a standard word; it’s usually a misspelling of “promotion” or “promote,” or an intended idea like “promote an event.”","zh":"“promovent” 不是标准单词；通常是把 “promotion” 或 “promote” 拼错，或想表达“宣传/推广某个活动（promote an event）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “promotion” (noun) or “promote” (verb), especially in contexts like advertising, marketing, or school/work advancement.","zh":"不是标准英文单词。最常见是把 “promotion”（名词）或 “promote”（动词）拼错，常见于广告营销或升职/晋升等语境。"},"examples":[{"en":"I think “promovent” is a typo—did you mean “promotion”?","zh":"我觉得 “promovent” 是拼写错误——你想写的是 “promotion” 吗？"},{"en":"If you want to talk about advertising, you can say “promote an event,” not “promovent.”","zh":"如果你想表达“宣传活动”，可以说 “promote an event”，而不是 “promovent”。"}]},{"partOfSpeech":"n.","definition":{"en":"“promotion” (n.): an act of advertising something; or a move to a higher position or rank.","zh":"“promotion”（名词）：（1）促销/推广/宣传；（2）升职/晋升。"},"examples":[{"en":"The store is running a promotion this weekend.","zh":"这家店这周末在做促销。"},{"en":"She got a promotion after two years at the company.","zh":"她在公司工作两年后升职了。"}]},{"partOfSpeech":"vt.","definition":{"en":"“promote” (vt.): to encourage or support something; or to advertise something to make it popular.","zh":"“promote”（及物动词）：（1）促进/推动；（2）宣传/推广，使更受欢迎。"},"examples":[{"en":"The program promotes healthy eating.","zh":"这个项目促进健康饮食。"},{"en":"They’re promoting the new movie online.","zh":"他们在网上宣传这部新电影。"},{"en":"We need to promote the event on social media.","zh":"我们需要在社交媒体上推广这次活动。"}]}],"synonyms":["promote","advertise","market","publicize","support","encourage"],"phonetic":"/prəˈmoʊt/","extraExplanation":["“promovent” 之所以常出现，是因为有人把 “promo(tion)” 和 “event” 两个词混在一起想表达“活动推广”。更自然的英文说法是：promote an event / event promotion / promotional event。"]}
{"word":"promovere","summary":{"en":"*Promovere* is a Latin verb meaning “to move forward; to advance; to promote,” and it is the source of English “promote.”","zh":"*Promovere* 是拉丁语动词，意为“推动向前、推进、提升/促进”，也是英语 “promote” 的词源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to move forward; to advance; to promote.","zh":"（拉丁语）推动向前；推进；提升/促进。"},"examples":[{"en":"In Latin texts, *promovere* often means “to push forward” or “to advance a plan.”","zh":"在拉丁文献中，*promovere* 常表示“推动向前”或“推进某个计划”。"},{"en":"The English verb “promote” ultimately comes from Latin *promovere*.","zh":"英语动词“promote（提升/促进）”最终源自拉丁语 *promovere*。"}]}],"synonyms":["advance","promote","further"],"phonetic":"/proʊˈmoʊ.wɛ.reɪ/","extraExplanation":["*Promovere* 是拉丁语动词，由 **pro-**（向前）+ **movere**（移动）构成，字面意思是“向前移动、推动”。因此它既可以指物理上的“推到前面”，也常引申为“推进事业/计划”“提升某人地位”。","它是英语 **promote**、**promotion** 的词源之一：英语里更常用 promote 来表达“晋升/促销/促进”，而 *promovere* 通常只在拉丁语学习、古典文献或词源说明中出现。"]}
{"word":"prompt","summary":{"en":"“Prompt” most commonly means an instruction/request (especially for writing or AI), and it can also mean “to cause” (vt.) or “quick/immediate” (adj.).","zh":"prompt 最常见是“提示/指令”（尤其用于写作或AI）；也可作动词“促使”，或形容词“迅速的/及时的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A request or instruction that tells someone (or a computer program/AI) what to do, especially what to write, say, or create.","zh":"（尤指对电脑程序/AI的）提示、指令：告诉对方要做什么，尤其是要写什么、说什么或生成什么。"},"examples":[{"en":"The teacher gave us a writing prompt about a memorable day.","zh":"老师给了我们一个写作提示，主题是“难忘的一天”。"},{"en":"Try a clear prompt like: “Summarize this article in three bullet points.”","zh":"试试清晰的提示，比如：“用三个要点总结这篇文章。”"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause someone to act or speak, often by reminding or encouraging them.","zh":"促使；提示（某人行动或开口），常带“提醒/鼓励”的意味。"},"examples":[{"en":"Her question prompted him to explain his decision.","zh":"她的问题促使他解释自己的决定。"},{"en":"The error message prompted me to check my password.","zh":"错误提示促使我去检查密码。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done quickly and without delay; immediate.","zh":"迅速的；及时的；立刻的。"},"examples":[{"en":"Thank you for your prompt reply.","zh":"感谢你的迅速回复。"}]}],"synonyms":["cue","instruction","signal","remind","encourage","quick","immediate"],"phonetic":"/prɑmpt/","extraExplanation":["在AI语境里，prompt 常指“给模型的输入指令”。写好 prompt 的关键通常是：目的明确（要什么产出）、提供必要背景（对象/场景/限制条件）、指定格式（比如表格/要点/字数）、给出示例或标准（如果有）。","常见搭配：writing prompt（写作题目/提示）、prompt reply/response（及时回复）、prompt someone to do something（促使某人做某事）。"]}
{"word":"promptbook","summary":{"en":"A promptbook is a theater script with cue notes used to run a performance.","zh":"promptbook 指用于演出运行的“提示本”：包含剧本与各类舞台提示标注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A book used in theater that contains the script plus the stage manager’s notes (cues for lighting, sound, entrances, exits, and scene changes).","zh":"（戏剧）提示本；舞台监督用的剧本本子，除了台词还包含灯光、音效、演员上下场、换景等提示与标注。"},"examples":[{"en":"The stage manager checked the promptbook to call the lighting cue.","zh":"舞台监督查看提示本来报灯光提示。"},{"en":"During rehearsals, she added new blocking notes to the promptbook.","zh":"排练时，她把新的走位标注写进提示本。"},{"en":"If the actor forgot a line, the prompter could follow along in the promptbook.","zh":"如果演员忘词，提词员可以对照提示本跟进。"}]},{"partOfSpeech":"v.","definition":{"en":"To record or organize performance cues and notes in a promptbook for a production.","zh":"把演出提示与标注整理并记录进提示本（为某个剧目做提示本工作）。"},"examples":[{"en":"He was hired to promptbook the new production.","zh":"他被聘来为新制作整理提示本。"},{"en":"We promptbooked Act II after the technical rehearsal.","zh":"技术彩排后我们把第二幕的提示整理进提示本。"}]}],"synonyms":["prompt script","stage manager’s book","cue book"],"phonetic":"/ˈprɑmptˌbʊk/","extraExplanation":["“promptbook”主要用于戏剧制作语境，尤其在英美剧场里常与stage manager（舞台监督）、cues（提示点）一起出现。它往往是一本活文件：排练与技术联排（tech rehearsal）时不断更新。","相关角色提示：prompter（提词员）是给演员“提词”的人；stage manager（舞台监督）则常负责“报提示”（calling cues），promptbook是他们工作的核心工具之一。"]}
{"word":"promptbooks","summary":{"en":"Promptbooks are theater scripts marked with cues and production notes used to run rehearsals and performances.","zh":"promptbooks 指带有提示与制作注记的戏剧提示本，用于排练与演出执行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book (script) used in theater rehearsals and performances that includes the full text plus cues and notes for actors, stage managers, and crew (e.g., entrances, exits, lighting, sound, props).","zh":"（戏剧）提示本／导演提示本：用于排练和演出的剧本本子，除台词外还写有提示与工作注记（如演员上下场、灯光、音效、道具等）。"},"examples":[{"en":"The stage manager kept the promptbook open to call every lighting cue.","zh":"舞台监督把提示本摊开，用来逐条报灯光提示。"},{"en":"During rehearsals, the director added blocking notes to the promptbook.","zh":"排练时，导演把走位（调度）注记写进提示本里。"}]}],"synonyms":["prompt copy","production script","stage manager’s book","cue script"],"phonetic":"/ˈprɑmptˌbʊk/","extraExplanation":["“Promptbook”常见于剧场语境，通常由舞台监督（stage manager）维护，里面会记录排练过程中不断更新的“走位/调度（blocking）”、换景、音乐与音效点、灯光号（cue）等。","也常被称为“prompt copy”。“promptbooks”是其复数形式，表示多本提示本（例如不同剧目或不同版本）。"]}
{"word":"prompted","summary":{"en":"“Prompted” means caused or encouraged someone to act, speak, or think; it can also describe something that was triggered by a cause.","zh":"“Prompted”表示“促使/引发”，既可指促使某人行动/表达/思考，也可形容某事是“由……引起的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “prompt”: caused someone to do, say, or think something; triggered a reaction or action","zh":"“prompt”的过去式/过去分词：促使某人做/说/想某事；引发反应或行动"},"examples":[{"en":"The teacher’s question prompted a lively discussion.","zh":"老师的问题引发了热烈的讨论。"},{"en":"The news prompted him to call his family right away.","zh":"这条消息促使他立刻给家人打电话。"},{"en":"Her comment prompted me to rethink my plan.","zh":"她的评论让我重新思考我的计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"encouraged or triggered by something (often used before a noun in formal writing)","zh":"由某事促成/引起的（常见于较正式表达，作定语）"},"examples":[{"en":"The company issued a statement after prompted concerns from customers.","zh":"在顾客提出的担忧促使下，公司发布了一份声明。"},{"en":"They made changes in response to prompted feedback.","zh":"他们根据促成这些改变的反馈做出了调整。"}]}],"synonyms":["triggered","caused","sparked","led to","induced","encouraged"],"phonetic":"/ˈprɑmptɪd/","extraExplanation":["“prompt”作动词时，常见搭配是：prompt + someone + to do sth（促使某人做某事）；prompt + a reaction/discussion/change（引发反应/讨论/改变）。","写作中更自然的表达通常是：“prompted by …”=“由……引起/促成”。例如：“Prompted by public pressure, the mayor apologized.”（在公众压力促使下，市长道歉。）"]}
{"word":"prompter","summary":{"en":"A prompter is someone or something that provides cues or lines to help a performer or speaker, especially in theater or on TV.","zh":"prompter 指在演员或演讲者忘词/需要提示时提供台词或提示的人或设备，常见于戏剧和电视播报。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who quietly gives an actor or speaker the next line or cue when they forget, especially in a theater.","zh":"（尤指戏剧中）在演员忘词时小声提示台词或提示出场时机的人；提词员。"},"examples":[{"en":"The prompter whispered the next line from the side of the stage.","zh":"提词员在舞台侧边小声提示下一句台词。"},{"en":"When the actor paused, the prompter gave a quick cue.","zh":"演员停顿时，提词员快速给了提示。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or system that displays text for a speaker to read, especially a teleprompter used in TV or public speaking.","zh":"（尤指电视或演讲用的）提词器；（电子）提词系统（teleprompter）。"},"examples":[{"en":"The news anchor read the script from a prompter.","zh":"新闻主播从提词器上读稿。"},{"en":"She practiced her speech with a prompter to keep the timing smooth.","zh":"她用提词器练习演讲，以保证节奏顺畅。"}]}],"synonyms":["cue-giver","prompt book holder","teleprompter (for the device)","cue card reader"],"phonetic":"/ˈprɑːmptər/","extraExplanation":["“prompter”来自动词 prompt（提示、促使）。在传统剧院里，提词员常站在舞台侧边或靠近“提词箱”（prompt box）的位置，以便不打扰观众又能及时提醒演员。","在现代语境中，电视台或大型演讲常用的“提词器”更常说 teleprompter；口语里也可能直接叫 prompter。"]}
{"word":"prompters","summary":{"en":"“Prompters” are people or tools that give cues or reminders; in theater, they help actors by supplying forgotten lines.","zh":"prompters 指提供提示/线索的人或工具；在戏剧中常指帮助演员忘词时补台词的提词员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or things that give prompts—helpful reminders, cues, or suggestions about what to say or do","zh":"给予提示的人或事物——用来提醒、给线索或建议你该说什么/做什么"},"examples":[{"en":"The teacher used picture prompters to help students speak in English.","zh":"老师用图片提示物来帮助学生用英语开口。"},{"en":"On the app, short questions act as prompters for daily journaling.","zh":"在这个应用里，简短的问题充当每日写日记的提示。"}]},{"partOfSpeech":"n.","definition":{"en":"(theater) people whose job is to quietly give actors their lines when they forget","zh":"（戏剧）提词员：在演员忘词时悄悄提示台词的人"},"examples":[{"en":"During rehearsal, the prompters helped the actors stay on track.","zh":"排练时，提词员帮助演员保持进度、不跑戏。"},{"en":"Even experienced performers sometimes rely on prompters for long speeches.","zh":"即使是经验丰富的表演者，有时也会在长台词上依赖提词员。"}]}],"synonyms":["cue-givers","reminders","coaches","teleprompters","prompter(s)"],"phonetic":"/ˈprɑmptərz/","extraExplanation":["“prompter”来自动词“prompt”（提示、催促）。在传统剧场里，prompter常在舞台边或“提词箱”(prompt box)附近，低声提示台词；现代演出也可能使用屏幕式提词器（teleprompter）。","在AI与写作语境中，prompter也常指“写提示词/提问的人”，即通过给出清晰问题或指令来引导模型生成内容的人。"]}
{"word":"promptest","summary":{"en":"“Promptest” means “the most prompt”—the fastest to respond or act without delay.","zh":"“promptest”表示“最及时的/反应最快的”，即毫不拖延地回应或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “prompt”: the most prompt; the quickest to act or respond without delay.","zh":"“prompt”的最高级：最及时的；反应最快的；毫不拖延的。"},"examples":[{"en":"Of all the applicants, she was the promptest in replying to emails.","zh":"在所有申请者中，她回复邮件最及时。"},{"en":"Thank you for your promptest attention to this matter.","zh":"感谢你对此事最及时的关注。"}]}],"synonyms":["most prompt","quickest","most punctual","most timely"],"phonetic":"/ˈprɑmptɪst/","extraExplanation":["“promptest”在现代英语里相对少见，很多情况下更常用“most prompt”。但在较正式或带一点修辞感的写法中，仍可能看到“promptest”。","词根“prompt-”来自拉丁语，含有“准备好、立刻”的意味，因此“prompt”常与“reply/response/attention/payment”搭配。"]}
{"word":"prompting","summary":{"en":"Prompting means giving cues to help someone respond, or (in AI) writing prompts to guide an AI’s output.","zh":"Prompting 指给予提示以帮助回应，也可指（AI 领域）编写提示词来引导生成结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving someone a hint, cue, or reminder to help them speak, remember, or act","zh":"给人提示、暗示或提醒，以帮助对方说话、回忆或行动的行为"},"examples":[{"en":"The actor needed a little prompting to remember his lines.","zh":"这位演员需要一点提示才能想起台词。"},{"en":"With gentle prompting, the child answered the question.","zh":"在温和的提示下，孩子回答了问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(in AI and tech) writing or refining instructions (prompts) to guide an AI system’s output","zh":"（在人工智能与科技语境中）编写或优化“提示词/指令”（prompt），以引导 AI 生成结果的做法"},"examples":[{"en":"Good prompting can help the chatbot give more accurate answers.","zh":"好的提示词写法能让聊天机器人给出更准确的回答。"},{"en":"She’s learning prompting techniques for image generation.","zh":"她正在学习用于图像生成的提示词技巧。"}]},{"partOfSpeech":"adj.","definition":{"en":"encouraging or causing someone to respond or take action (often used before a noun)","zh":"促使某人回应或采取行动的（常用于名词前）"},"examples":[{"en":"The teacher asked a prompting question to start the discussion.","zh":"老师提出了一个引导性问题来开启讨论。"},{"en":"A prompting email reminded us to submit the form.","zh":"一封催办邮件提醒我们提交表格。"}]}],"synonyms":["cueing","hinting","nudging","encouraging","prompt engineering"],"phonetic":"/ˈprɑmptɪŋ/","extraExplanation":["在日常英语里，prompting 常见于“需要提示/被提示”的场景，例如表演时有人在台下“提词”。","在 AI 语境中，prompting 通常指“写提示词/指令”的技能；更具体的说法包括 prompt engineering（提示词工程），但日常交流里说 prompting 也很常见。"]}
{"word":"promptings","summary":{"en":"Promptings are gentle inner urges or helpful hints that push someone toward an action or answer.","zh":"Promptings 指内心的驱使/暗示，或在特定情境中帮助他人回答或行动的提示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inner feelings, ideas, or urges that gently push you to do something (often used as “the promptings of conscience/heart”).","zh":"内心的暗示、冲动或推动你去做某事的感觉（常用于“良心/内心的驱使”）。"},"examples":[{"en":"She followed the promptings of her conscience and returned the lost wallet.","zh":"她遵从良心的驱使，把捡到的钱包归还了。"},{"en":"On a sudden prompting, I called my grandmother just to check in.","zh":"一时的冲动/心血来潮，我打电话给外婆问候一下。"}]},{"partOfSpeech":"n.","definition":{"en":"Hints or reminders that help someone say or do the right thing, especially in a performance, interview, or test.","zh":"提示、提醒（帮助某人在表演、面试或考试中说/做对的内容）。"},"examples":[{"en":"The actor forgot his line, so the stage manager gave a few quiet promptings from the side.","zh":"演员忘词了，舞台监督在旁边轻声提示了几句。"},{"en":"The teacher’s promptings guided the students toward the correct answer without giving it away.","zh":"老师的提示引导学生接近正确答案，但没有直接把答案说出来。"}]}],"synonyms":["urges","impulses","instincts","nudges","hints","cues"],"phonetic":"/ˈprɑmptɪŋz/","extraExplanation":["“promptings”常见于较正式或文学性的表达，尤其是“the promptings of conscience/heart/instinct”（良心/内心/本能的驱使）。","和“impulse”相比，“prompting”更像“温和的推动/提醒”，不一定是冲动到难以控制。"]}
{"word":"promptitude","summary":{"en":"Promptitude means being ready and quick to act or respond, especially in a timely, efficient way.","zh":"Promptitude 指“迅速且有准备地行动或回应”，强调及时、高效的反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Readiness and quickness to act; promptness.","zh":"迅速行动的准备与反应；敏捷；及时。"},"examples":[{"en":"She answered the customer’s question with promptitude.","zh":"她很迅速地回答了顾客的问题。"},{"en":"The firefighters’ promptitude helped prevent the fire from spreading.","zh":"消防员的迅速反应帮助阻止了火势蔓延。"}]}],"synonyms":["promptness","readiness","alacrity","quickness","dispatch"],"phonetic":"/ˈprɑmptəˌtud/","extraExplanation":["“Promptitude”比较正式，常见于书面语或较庄重的场合；日常口语里更常用“promptness”“readiness”“quick response”。","词源上与“prompt”（迅速的、及时的）同源，带有“随时准备好并立刻行动”的语感。","常见搭配：with promptitude（迅速地）；show promptitude（表现出迅速反应）；promptitude in responding/acting（在回应/行动上的迅速）。"]}
{"word":"promptive","summary":{"en":"Promptive means encouraging or guiding someone to respond or act, often by giving a prompt or cue.","zh":"promptive 指通过提示或线索来促使、引导别人做出回应或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Encouraging or causing someone to act, speak, or respond quickly; giving a prompt.","zh":"促使（人）迅速行动或回应的；起到提示、催促作用的。"},"examples":[{"en":"Her promptive question helped the shy student start talking.","zh":"她那句带有提示性的提问帮助害羞的学生开始开口。"},{"en":"The app sends promptive reminders so you don’t forget your tasks.","zh":"这个应用会发送起到催促作用的提醒，帮助你不忘记任务。"}]},{"partOfSpeech":"adj.","definition":{"en":"Giving a hint or cue that guides someone toward an answer or decision.","zh":"起提示作用的；引导（人）做出答案或决定的。"},"examples":[{"en":"Try giving a promptive clue instead of telling the answer directly.","zh":"试着给一个提示性的线索，而不是直接把答案说出来。"},{"en":"The teacher used promptive gestures to guide the class.","zh":"老师用提示性的手势来引导全班。"}]}],"synonyms":["prompting","encouraging","suggestive","inciting","stimulating"],"phonetic":"/ˈprɑmptɪv/","extraExplanation":["“promptive”在现代英语中比较少见，更常用的替代表达有：prompting / encouraging / suggestive / leading（尤其是“leading question”表示“诱导性提问”）。","词形上由“prompt（提示、促使）+ -ive（形容词后缀）”构成，意思相对直观；正式写作里偶尔会用来强调“具有促发、引导作用”的特征。"]}
{"word":"promptly","summary":{"en":"“Promptly” means doing something without delay, and it can also mean being exactly on time.","zh":"“promptly”表示“立刻、毫不拖延地”，也可表示“准时地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"quickly and without delay; at once.","zh":"迅速地；毫不耽搁地；立刻。"},"examples":[{"en":"Please reply promptly to confirm your appointment.","zh":"请尽快回复以确认你的预约。"},{"en":"She promptly apologized after realizing her mistake.","zh":"她意识到自己犯错后立刻道歉。"}]},{"partOfSpeech":"adv.","definition":{"en":"at the arranged or expected time; punctually.","zh":"准时地；按预定时间地。"},"examples":[{"en":"The train left promptly at 8:00 a.m.","zh":"火车在早上八点准时发车。"}]}],"synonyms":["quickly","immediately","right away","without delay","punctually"],"phonetic":"/ˈprɑmptli/","extraExplanation":["“promptly”常用于更正式的语境（邮件、通知、服务行业），语气比“quickly”更强调“不要拖延/应当及时处理”。","常见搭配：reply/respond promptly（及时回复）、pay promptly（及时付款）、deal with/handle promptly（及时处理）、leave promptly（准时离开）。"]}
{"word":"promptness","summary":{"en":"Promptness means being quick and not delaying, especially in replying or acting on time.","zh":"Promptness 指做事或回复迅速、不拖延，尤其强调及时行动和守时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of doing something quickly, without delay; being on time.","zh":"迅速；及时；守时（做事不拖延的品质）"},"examples":[{"en":"We appreciate your promptness in replying to our email.","zh":"我们很感谢你及时回复我们的邮件。"},{"en":"Promptness is important when customers are waiting.","zh":"当顾客在等待时，及时处理很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Polite/formal) The quality of being quick to act or respond (often used in business or service contexts).","zh":"（礼貌/正式）反应快、处理快（常用于商务或服务语境）"},"examples":[{"en":"Thank you for your promptness in addressing this issue.","zh":"感谢你迅速处理这个问题。"},{"en":"Her promptness and professionalism made a good impression.","zh":"她的迅速反应和专业态度给人留下了好印象。"}]}],"synonyms":["quickness","timeliness","readiness","responsiveness","punctuality"],"phonetic":"/ˈprɑmptnəs/","extraExplanation":["“promptness”来自形容词“prompt”（迅速的、及时的），后缀“-ness”表示“……的性质/状态”。所以它强调的是一种稳定的品质，而不只是一次性的“很快”。","在英文邮件里，“Thank you for your promptness”常见于较正式的表达，语气礼貌但有距离；更日常也可以说“Thanks for getting back to me so quickly.”","易混词：\n- “punctuality”更侧重“准时到达”（时间点）；\n- “promptness”更侧重“及时行动/回复”（减少等待）。"]}
{"word":"promptorium","summary":{"en":"Promptorium means a storehouse/repository, and it can also refer to a medieval Latin–English dictionary (notably the Promptorium Parvulorum).","zh":"Promptorium 指“贮藏库/储备处”，也可指中世纪的拉丁语—英语词典（尤指《Promptorium Parvulorum》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a storehouse or repository; a place where things are stored for later use","zh":"贮藏处；储藏库；存放备用物品的地方"},"examples":[{"en":"The monastery kept a promptorium for grain and tools.","zh":"修道院设有一个贮藏库，用来存放谷物和工具。"},{"en":"In older writing, a “promptorium” could mean a general repository of useful supplies.","zh":"在较早的文字中，“promptorium”可指存放各种有用物资的储藏处。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a medieval Latin–English wordbook or dictionary, especially the famous “Promptorium Parvulorum”","zh":"（常大写）中世纪的拉丁语—英语词汇书/词典，尤指著名的《Promptorium Parvulorum》"},"examples":[{"en":"Scholars cite the Promptorium Parvulorum when studying Middle English vocabulary.","zh":"研究中古英语词汇时，学者常引用《Promptorium Parvulorum》。"},{"en":"The promptorium was compiled to help learners find everyday words.","zh":"这部词典编写出来是为了帮助学习者查找日常用词。"}]}],"synonyms":["repository","storehouse","depot","archive","wordbook"],"phonetic":"/prɑmpˈtɔriəm/","extraExplanation":["“Promptorium”源自拉丁语，和“prompt”（现成的、立刻可用的）同源，核心含义是“随时可取用的储备”。","《Promptorium Parvulorum》（常译“儿童/初学者词库”）是15世纪左右的著名拉丁语—英语词汇汇编，对研究中古英语拼写与词义很重要。"]}
{"word":"promptress","summary":{"en":"“Promptress” means a female theater prompter who helps actors by prompting forgotten lines.","zh":"“promptress”指戏剧中的女提词员，在演员忘词时提示台词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who prompts actors in a play by giving them forgotten lines (a female prompter).","zh":"（戏剧中）女提词员；女提示员（在演员忘词时提示台词的人）。"},"examples":[{"en":"The promptress whispered the next line from the wings when the actor froze.","zh":"演员突然卡住时，女提词员在台侧低声提示了下一句台词。"},{"en":"In older theater programs, you might see “promptress” listed among the staff.","zh":"在较早的剧院节目单里，你可能会看到工作人员中写着“promptress（女提词员）”。"}]}],"synonyms":["prompter","stage prompter","souffleuse"],"phonetic":"/ˈprɑmptrəs/","extraExplanation":["“promptress”由“prompter（提词员）+ -ess（表示女性的后缀）”构成。现代英语里更常用不分性别的“prompter”或“stage prompter”，因为职业称呼越来越倾向于中性表达。","该词带有较明显的年代感，常见于旧式戏剧语境、节目单或文学描写中。"]}
{"word":"prompts","summary":{"en":"“Prompt(s)” most commonly means a question/instruction that guides your response, or a computer message that asks you to do something; as a verb, it means to encourage or cause someone to act/speak.","zh":"“prompt(s)”常指引导你作答的“题目/提示”，也可指电脑上的“提示信息”；作动词时表示“促使/提醒某人行动或说话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A written or spoken instruction or question that tells someone what to do, or asks them to respond (often in exams, writing tasks, or discussions).","zh":"（口头或书面的）提示、指示；（要求你作答或行动的）问题/题目（常见于考试、写作任务或讨论）。"},"examples":[{"en":"Read the prompt carefully before you start writing.","zh":"动笔之前先仔细阅读写作题目（提示）。"},{"en":"The teacher gave us a prompt about our favorite holiday memory.","zh":"老师给了我们一个提示题：写一段你最喜欢的假期回忆。"}]},{"partOfSpeech":"n.","definition":{"en":"A short piece of text shown by a computer or app that asks you to enter information or choose an action.","zh":"（计算机/应用显示的）提示信息；（要求输入或选择操作的）提示语。"},"examples":[{"en":"Follow the on-screen prompts to reset your password.","zh":"按照屏幕提示来重置密码。"},{"en":"A prompt popped up asking me to allow notifications.","zh":"弹出一个提示问我是否允许通知。"}]},{"partOfSpeech":"vt.","definition":{"en":"To encourage someone to speak or act; to remind them to do something.","zh":"促使；鼓励（某人说话或行动）；提醒（某人去做某事）。"},"examples":[{"en":"Her question prompted him to explain his decision.","zh":"她的问题促使他解释自己的决定。"},{"en":"Please prompt me if I forget to bring the document.","zh":"如果我忘了带文件，请提醒我一下。"}]}],"synonyms":["cue","instruction","question","reminder","signal","encourage","urge"],"phonetic":"/prɑmpt/","extraExplanation":["在AI语境里，prompt 常指“给AI的指令/输入文本”，用于引导模型生成回答，例如：\"Write a polite email\"。中文里常译为“提示词/指令/提问”。"]}
{"word":"promptuary","summary":{"en":"Promptuary means a ready-reference handbook or, more rarely, a theater promptbook.","zh":"promptuary 指“速查手册/指南”，较少见时也指“戏剧提示本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A handbook or guide that gives ready-made directions, rules, or reminders; a book meant to help you respond or act quickly.","zh":"速查手册；指南；（提供现成指示/规则/提醒、便于迅速应对的）手册。"},"examples":[{"en":"The new manager kept a promptuary of emergency procedures by the phone.","zh":"新经理把一本应急流程速查手册放在电话旁。"},{"en":"Actors in the past sometimes relied on a promptuary of cues and lines.","zh":"过去有些演员会依靠一本提示台词与提示点的手册。"}]},{"partOfSpeech":"n.","definition":{"en":"A promptbook used in theater—notes and instructions that help a performance run smoothly (an older/rare use).","zh":"（戏剧）提示本；提示书（记录提示、走位、灯光等以确保演出顺利的旧式/少见用法）。"},"examples":[{"en":"The stage manager marked the changes in the promptuary before rehearsal.","zh":"舞台监督在排练前把改动标在提示本里。"},{"en":"In the archive, the promptuary shows where music and lighting were cued.","zh":"在档案里，这本提示书显示音乐和灯光从哪里开始提示。"}]}],"synonyms":["handbook","manual","guide","reference book","vade mecum","promptbook"],"phonetic":"/prɑmpˈtjuˌɛri/","extraExplanation":["这个词很少见，带有较强的“书面/古典”色彩。现代英语里更常用 handbook / manual / guide / promptbook（戏剧）来表达同类意思。","词源上与拉丁语 promptuarius（“放在手边、随取随用的”）有关，核心感觉是“随时可用、便于迅速查到”。因此它常指“便于快速反应的速查型资料”。"]}
{"word":"prompture","summary":{"en":"“Prompture” is a rare/archaic noun meaning “prompting” or “urging/instigation.”","zh":"“prompture”是罕见/古旧名词，意思是“催促、促使、怂恿（推动某人去做某事）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of prompting; an urging or instigation (rare/archaic).","zh":"催促、怂恿；促使某人去做某事的行为（罕见/古旧用法）。"},"examples":[{"en":"At the prompture of his friends, he finally applied for the job.","zh":"在朋友们的催促下，他终于去申请了那份工作。"},{"en":"She acted not from her own will, but from the prompture of fear.","zh":"她的行动并非出于本意，而是被恐惧所驱使。"}]}],"synonyms":["prompting","urging","instigation","encouragement","pressure"],"phonetic":"/ˈprɑmptʃɚ/","extraExplanation":["“prompture”不是现代英语里的常用词，更多被视为罕见或古旧形式。它由“prompt（促使、催促）”加上名词后缀“-ure（表示‘……的行为/结果’）”构成，意思接近 urging/instigation。","在当代写作里，一般用更自然的表达：the urging of…, at someone’s urging, encouragement, pressure, prompting。除非你在读古文、仿古文体或做文学风格化写作，否则不建议使用。"]}
{"word":"promptus","summary":{"en":"“Promptus” is a Latin word meaning “ready/prepared,” mostly seen in mottos rather than everyday English.","zh":"“Promptus”是拉丁语，意为“准备好/就绪”，多见于校训或格言，日常英语中很少使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; rare in modern English) ready; prepared; quick to act.","zh":"（拉丁语；现代英语中罕见）准备好的；迅速行动的；敏捷的。"},"examples":[{"en":"The school crest includes the Latin word “promptus,” meaning “ready.”","zh":"学校徽章上有拉丁词“promptus”，意思是“准备好”。"},{"en":"In some mottos, “promptus” suggests being ready to serve or respond.","zh":"在一些格言中，“promptus”表示“随时准备服务或回应”。"}]}],"synonyms":["ready","prepared","quick","prompt"],"phonetic":"ˈprɑmptəs","extraExplanation":["“promptus”主要是拉丁语词形（相当于英语的 ready/prepared）。在英语文本里通常只会出现在校训、格言、徽章、家族纹章或仿古/学术语境中。","如果你想查的是英语单词“prompt”（提示；促使；迅速的），很可能是拼写误差；告诉我你的句子语境，我可以按“prompt”给出更常用的释义与用法。"]}
{"word":"proms","summary":{"en":"“Proms” usually means the plural of “prom” (high school formal dances). In the UK, “the Proms” can also mean the famous BBC classical concert series.","zh":"“proms”通常是“prom（高中正式舞会）”的复数；在英国语境中，“the Proms”也可指著名的 BBC 逍遥音乐节（古典音乐会系列）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of prom: a formal dance for high school students (usually near the end of the school year).","zh":"prom 的复数：高中生参加的正式舞会（通常在学年末举行）。"},"examples":[{"en":"Many students saved money for their proms.","zh":"很多学生为参加毕业舞会攒钱。"},{"en":"She went to two proms—one at her school and one at her friend’s school.","zh":"她参加了两场舞会——一场在自己学校，另一场在朋友的学校。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, often capitalized) The Proms: a famous series of classical music concerts, especially the BBC Proms in London.","zh":"（英国，常大写）The Proms：著名的古典音乐音乐会系列，尤指伦敦的 BBC Proms。"},"examples":[{"en":"They listened to the Proms on the radio.","zh":"他们通过广播收听了逍遥音乐节的演出。"},{"en":"The BBC Proms attracts music lovers from around the world.","zh":"BBC 逍遥音乐节吸引世界各地的乐迷。"}]}],"synonyms":["prom","formal dance","school dance","BBC Proms","Promenade Concerts"],"phonetic":"/prɑmz/","extraExplanation":["在美国语境中，prom（舞会）常被视为高中生活的重要“仪式感”事件：会穿礼服/西装、拍合照、可能会租豪车或订花束，常见于高年级（尤其是 senior prom）。","英国的 The Proms 全名常指 “Promenade Concerts”（逍遥音乐会）：传统上部分观众可以站着听（promenading），气氛相对亲民，常有“Last Night of the Proms”等特色场次。"]}
{"word":"promulgate","summary":{"en":"“Promulgate” means to officially make a law/rule known to the public, or to spread an idea widely.","zh":"“promulgate”指正式颁布/公布法律或规则，也可指广泛传播某种思想或信息。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially announce a new law, rule, or policy so that it becomes known to the public (and often begins to take effect)","zh":"（正式）颁布；公布（法律、规则或政策），使公众知晓（常也意味着开始生效）"},"examples":[{"en":"The government promulgated new safety regulations for factories.","zh":"政府颁布了新的工厂安全规定。"},{"en":"The school promulgated a revised code of conduct at the start of the semester.","zh":"学校在学期开始时公布了修订后的行为准则。"}]},{"partOfSpeech":"vt.","definition":{"en":"to spread an idea, belief, or information widely (often in a formal or organized way)","zh":"传播；宣扬（思想、信念或信息，常带有正式或有组织的意味）"},"examples":[{"en":"The organization works to promulgate public-health information in rural areas.","zh":"该组织致力于在农村地区传播公共卫生信息。"},{"en":"Some writers used newspapers to promulgate their political views.","zh":"一些作家借助报纸来传播他们的政治观点。"}]}],"synonyms":["announce","proclaim","publish","issue","enact","broadcast","disseminate"],"phonetic":"/ˈprɑməlˌɡeɪt/","extraExplanation":["“promulgate”常见于法律、政府和机构语境，语气比“announce（宣布）”更正式，强调“让公众知道并执行/生效”的过程。","词源来自拉丁语，原义与“公开、宣布”相关。搭配上常用：promulgate a law/regulation/decree/policy（颁布法律/条例/法令/政策）。","近义词辨析：\n- enact：强调“通过并制定成法律”（立法程序）\n- issue：强调“发布/下发”（公文、声明）\n- proclaim：更像“宣告”，语气更强烈但不一定带来制度上的生效"]}
{"word":"promulgated","summary":{"en":"“Promulgated” means officially published/enacted (especially laws or rules), or more generally spread widely.","zh":"“promulgated”意为（尤指法律法规）正式公布/颁布，也可指广泛传播、使众所周知。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a government, organization, or authority) to officially announce a new law, rule, or agreement so it becomes known and can be put into effect; past tense/past participle of “promulgate.”","zh":"（政府、组织或权威机构）正式公布/颁布新的法律、规则或协议，使其为公众所知并开始生效；为“promulgate”的过去式/过去分词。"},"examples":[{"en":"The new regulations were promulgated by the ministry last Friday.","zh":"新规已于上周五由该部正式颁布。"},{"en":"Once the constitution was promulgated, the courts began applying it.","zh":"宪法一经公布，法院便开始适用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to spread an idea, belief, or information widely; made widely known.","zh":"广泛传播（思想、信仰或信息）；使广为人知。"},"examples":[{"en":"The group promulgated its message through flyers and social media.","zh":"该团体通过传单和社交媒体广泛传播其主张。"},{"en":"The theory was promulgated in universities across the country.","zh":"这一理论在全国各地的大学中被广泛传播。"}]}],"synonyms":["enacted","issued","proclaimed","declared","published","announced","circulated","disseminated"],"phonetic":"/ˈprɑməlˌɡeɪtɪd/","extraExplanation":["“promulgate”来自拉丁语 *promulgare*，含“公开宣布、让大众知道”的意思。现代英语里常见于法律与政策语境（如 *promulgate a law/regulation*），语气比 *announce* 更正式，强调“官方发布/使生效”。","常见搭配：*promulgated by*（由……颁布）、*promulgated on*（于某日颁布）、*promulgated regulations/ordinance/constitution*（颁布规章/条例/宪法）。"]}
{"word":"promulgates","summary":{"en":"“Promulgates” means officially making a law or rule known (often so it takes effect), or more generally spreading an idea widely.","zh":"“promulgates”指（正式）颁布/公布法律或规章（常带使其生效之意），也可指广泛传播某种思想或信息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to officially announce a law, rule, or decision so it becomes known and effective","zh":"（正式）颁布、公布（法律、规章或决定），使其为公众所知并生效"},"examples":[{"en":"The government promulgates new regulations to improve food safety.","zh":"政府颁布新规以提高食品安全。"},{"en":"The constitution says when a law is promulgated, it must be published for the public to read.","zh":"宪法规定，法律一经公布，必须发布供公众查阅。"}]},{"partOfSpeech":"v.","definition":{"en":"to spread an idea, belief, or message widely","zh":"传播、推广（思想、信念或信息）"},"examples":[{"en":"The organization promulgates its mission through community events and social media.","zh":"该组织通过社区活动和社交媒体传播其使命。"},{"en":"Teachers can promulgate respect and curiosity in the classroom.","zh":"老师可以在课堂上传递尊重与好奇心。"}]}],"synonyms":["proclaims","issues","enacts","publishes","announces","broadcasts","disseminates"],"phonetic":"/ˈprɑːməlˌɡeɪts/","extraExplanation":["“promulgates”是动词“promulgate”的第三人称单数（he/she/it promulgates）。常见于法律、政府与正式文件语境：强调“正式公布/颁布”，比“announce（宣布）”更正式、也更偏“让其具有法律或制度效力”。","词源来自拉丁语 *promulgare*，与“公开（publicly）”的概念相关，因此常与law/regulation/decree/constitution等词搭配。"]}
{"word":"promulgating","summary":{"en":"Promulgating means officially announcing and putting a rule or law into effect, or spreading an idea widely.","zh":"Promulgating 指正式颁布并使法律/规则生效，或广泛传播某种观点/信息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"officially announcing or putting a law, rule, or idea into effect (often by a government or authority)","zh":"（通常指政府或权威机构）正式颁布、公布并使（法律/规则/政策等）生效的"},"examples":[{"en":"The agency is promulgating new safety rules for airlines.","zh":"该机构正在颁布新的航空安全规定。"},{"en":"After months of debate, the city began promulgating the updated housing code.","zh":"经过数月辩论后，该市开始正式公布并实施更新后的住房法规。"}]},{"partOfSpeech":"v.","definition":{"en":"spreading an idea, belief, or information so that many people know it","zh":"传播（观点/信念/信息），使更多人知晓"},"examples":[{"en":"The group focused on promulgating information about public health.","zh":"该团体专注于传播公共健康信息。"},{"en":"She spent years promulgating the message of equal education for all.","zh":"她多年致力于传播“人人享有平等教育”的理念。"}]}],"synonyms":["proclaiming","issuing","enacting","publishing","announcing","circulating","spreading"],"phonetic":"/ˈprɑməlˌɡeɪtɪŋ/","extraExplanation":["“promulgating”是动词“promulgate”的现在分词/动名词形式。最常见于正式或法律语境：to promulgate a law/regulation/constitution（颁布法律/法规/宪法）。","词源上来自拉丁语，核心含义是“让某事公开、让大家知道”。因此既可指“官方颁布使生效”，也可指“广泛传播”。","常见搭配：promulgate rules/regulations（颁布规章）、promulgate a decree（颁布法令）、promulgate standards（发布标准）。"]}
{"word":"promulgation","summary":{"en":"Promulgation means the official public issuing of a law or rule (and sometimes the wide spreading of an idea).","zh":"promulgation 指法律/规则等的正式公布与颁布（有时也指思想信息的广泛传播）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The official act of making a new law, rule, or decision publicly known so it can be followed.","zh":"（法律、规则、决定的）正式公布；颁布；发布（使公众知晓并开始遵行）"},"examples":[{"en":"The promulgation of the new traffic law will take effect next month.","zh":"新交通法的颁布将于下个月生效。"},{"en":"After promulgation, agencies must explain how they will enforce the regulation.","zh":"在正式公布后，各机构必须说明将如何执行该规定。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of spreading an idea, belief, or message widely.","zh":"（思想、信念、信息的）传播；广泛宣扬"},"examples":[{"en":"The group focused on the promulgation of health information in rural areas.","zh":"该团体专注于在农村地区传播健康信息。"},{"en":"Social media can speed up the promulgation of rumors as well as facts.","zh":"社交媒体既能加速事实的传播，也会加速谣言的传播。"}]}],"synonyms":["proclamation","publication","issuance","announcement","dissemination"],"phonetic":"/ˌprɑːməlˈɡeɪʃən/","extraExplanation":["词源提示：来自拉丁语 *promulgare*，其中 *pro-* 有“向前、公开”的意思，*mulgare* 与“让人知道/公开宣布”相关，因此整体带有“公开发布”的感觉。","使用场景：在新闻与法律语境里常见搭配有 *promulgation of a law/regulation/constitution*；比起 *announcement* 更正式、更偏“具有法律或制度效力的公布”。","易混词对比：*enactment* 强调“通过/制定成为法律”（过程与结果），*promulgation* 强调“公布让大家知道并开始执行”（公开生效的环节）。"]}
{"word":"promulgations","summary":{"en":"“Promulgations” means official publications or announcements—especially of laws or rules (plural form of “promulgation”).","zh":"“promulgations”指（尤其是法律或规章的）正式公布/颁布的公告或行为，是“promulgation”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Official announcements or publications of a law, rule, decision, or idea; acts of making something officially known.","zh":"（法律、规章、决定或观点的）正式公布/颁布；公布的行为或公告。"},"examples":[{"en":"The court waited for the promulgations of the new regulations before changing its procedures.","zh":"法院在改变办事流程前，先等待新规章的正式公布。"},{"en":"Several promulgations from the health department clarified what businesses must do.","zh":"卫生部门发布的几项公告澄清了企业必须采取的措施。"}]}],"synonyms":["proclamations","announcements","publications","decrees"],"phonetic":"/ˌprɑːməlˈɡeɪʃənz/","extraExplanation":["“promulgations”是复数形式；单数是“promulgation”。它常见于法律、政府或机构语境，强调“以权威方式对外发布”，比普通的“announcement（通知）”更正式、更具法律/制度色彩。","词源来自拉丁语，含义接近“使公众知道”。在法律写作中常与“rules/regulations/laws/edicts（规章/法规/法令）”搭配。"]}
{"word":"promulgator","summary":{"en":"A promulgator is someone who officially or publicly makes a law, policy, or idea known.","zh":"promulgator 指正式或公开发布、颁布并使某项法律/政策/理念为人所知的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who publicly announces, proclaims, or makes a law, rule, or idea widely known.","zh":"公布者；颁布者；宣传者（指公开宣布、宣告，或使法律/规则/理念广为人知的人）。"},"examples":[{"en":"The senator became a key promulgator of the new education reform.","zh":"这位参议员成了新教育改革的重要颁布者/推动宣传者。"},{"en":"In the organization, she was the promulgator of the updated safety policy.","zh":"在这个组织里，她是新版安全政策的发布者/宣导者。"}]}],"synonyms":["announcer","proclaimer","publisher","advocate","promoter"],"phonetic":"/ˈprɑm.əlˌɡeɪ.tɚ/","extraExplanation":["“promulgator”来自动词“promulgate”（颁布；公布；传播），常见于法律、政府公告、宗教或政策文件等正式语境。日常英语里更常用“supporter / advocate / spokesperson / promoter / messenger”等词来表达“推动或宣传某理念的人”。","与之相关的名词还有“promulgation”（颁布；公布；传播这一行为/过程）。在法律语境中，“promulgate a law”强调通过正式程序把法律对公众发布，使其生效或可被遵守。"]}
{"word":"promulgators","summary":{"en":"“Promulgators” means people who formally make laws, rules, or information publicly known.","zh":"“promulgators”指正式公布/颁布法律、规则或信息的人（名词复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who officially announce, spread, or make a law, rule, idea, or piece of information widely known.","zh":"（尤指官方）公布、颁布或传播法律、规则、理念或信息的人。"},"examples":[{"en":"The promulgators of the new safety regulations held a press conference.","zh":"新安全法规的颁布者召开了新闻发布会。"},{"en":"In history books, kings and councils often appear as the main promulgators of laws.","zh":"在历史书中，国王与议会常被描写为法律的主要颁布者。"}]}],"synonyms":["proclaimers","issuers","announcers","advocates","promoters"],"phonetic":"ˈprɑməlˌɡeɪtərz","extraExplanation":["“promulgators”是名词复数，单数是“promulgator”，来自动词“promulgate”（公布、颁布、传播）。这个词常见于法律、政府、公文、学术写作中，语气比“announcers（宣布者）/spreaders（传播者）”更正式，强调“通过权威或正式渠道让公众知晓”。","搭配提示：常见于 the promulgators of a law/policy/rule/regulation（某法律/政策/规则/条例的颁布者）；也可用于 ideas/doctrines（思想/教义）的传播者，但通常仍偏正式。"]}
{"word":"promulgatory","summary":{"en":"Promulgatory means ‘having to do with formally announcing or putting a law/rule into effect.’","zh":"promulgatory 指“与法律/规定的正式颁布、公布或生效有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to promulgation—formally announcing, publishing, or putting a law/rule into official effect.","zh":"与“颁布/公布”有关的；指正式宣布、发布，或使法律/规定正式生效的。"},"examples":[{"en":"The court discussed the promulgatory steps required before the regulation could take effect.","zh":"法院讨论了该法规生效前所需的颁布程序。"},{"en":"Some countries require a promulgatory notice in an official gazette.","zh":"一些国家要求在官方公报上发布颁布公告。"}]}],"synonyms":["promulgative","declaratory","official","formal","publicizing"],"phonetic":"/ˈprɑːməlɡəˌtɔːri/","extraExplanation":["“promulgatory”较为少见，主要出现在法律、行政或学术写作中；日常英语更常用“to promulgate（颁布）”“promulgation（颁布）”，或用“official/formal publication（官方/正式发布）”来表达。","词根来自拉丁语“promulgare”（公开、公布），常见搭配包括：promulgatory decree（颁布令）、promulgatory notice（颁布公告）、promulgatory act/steps（颁布行为/步骤）。"]}
{"word":"promulge","summary":{"en":"Promulge means to officially publish or announce a law or rule (and sometimes to spread an idea).","zh":"promulge 指正式颁布/公布法律或规则（有时也指传播某种观点）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially announce or make a rule, law, or policy publicly known so people must follow it","zh":"（尤指政府或机构）正式颁布；公布（法律、规章、政策）"},"examples":[{"en":"The government promulgated new safety regulations for factories.","zh":"政府颁布了新的工厂安全法规。"},{"en":"The rules were promulgated online and posted on public notice boards.","zh":"这些规定在网上公布，并张贴在公共公告栏上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to spread an idea or belief so that many people learn about it (less common)","zh":"传播；宣扬（观点、信仰等）（较少见）"},"examples":[{"en":"The organization worked to promulgate the idea of equal access to education.","zh":"该组织致力于传播人人平等接受教育的理念。"}]}],"synonyms":["enact","issue","proclaim","declare","publish"],"phonetic":"/ˈprɑːməlɡ/","extraExplanation":["“promulge”常见于正式/法律语境，语气比“announce（宣布）”更正式，核心含义是“正式对外公布，使其生效或被遵守”。","常见搭配：promulge a law/regulation/decree/constitution（颁布法律/条例/法令/宪法）；be promulgated（被颁布）。","词源提示：来自拉丁语 *promulgare*，含“公开、使人知道”之意；因此常强调“公开发布”的动作。"]}
{"word":"promulged","summary":{"en":"“Promulged” is a rare/old form meaning “officially proclaimed,” but modern standard English usually uses “promulgated.”","zh":"“promulged”是较罕见/旧式的“正式公布、颁布”，现代标准用法通常写作“promulgated”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/old-fashioned) past tense of “promulge,” meaning to officially announce or make a law/rule known to the public; in modern English this is usually written as “promulgated.”","zh":"（罕见/旧式）“promulge”的过去式，意思是“正式公布、颁布（法律/规则）”；现代英语通常写作“promulgated”。"},"examples":[{"en":"The king promulged a new decree to raise taxes.","zh":"国王颁布了一项提高税收的新法令。"},{"en":"The policy was promulged to all provincial officials.","zh":"这项政策已向各省官员正式公布。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling of “promulgated.”","zh":"“promulgated”的常见拼写错误。"},"examples":[{"en":"Many people write “promulged,” but the standard form is “promulgated.”","zh":"很多人会写“promulged”，但标准形式是“promulgated”。"}]}],"synonyms":["proclaimed","announced","declared","issued","enacted","published"],"phonetic":"/prəˈmʌldʒd/","extraExplanation":["在现代英语里，最常见、最正式的搭配是 **promulgate a law/regulation/constitution**（颁布法律/法规/宪法）。法律英语中它强调“通过权威程序对外公布，使其生效或让公众知晓”，比普通的 announce 更“法律/官方”。","词形提示：标准动词是 **promulgate**，过去式/过去分词是 **promulgated**。**promulge / promulged** 多见于较旧文本或非标准用法。"]}
{"word":"promulger","summary":{"en":"Promulger means someone who announces or officially publishes a law, rule, or idea.","zh":"Promulger 指“公布/颁布（法律、规则或理念）的人或团体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that publicly announces, proclaims, or formally puts a rule, law, or idea into effect.","zh":"公布者；颁布者；传播者（指公开宣布、正式颁布法律/规则/理念的人或团体）。"},"examples":[{"en":"The promulger of the new policy released the final rules on Monday.","zh":"新政策的颁布者在周一公布了最终规则。"},{"en":"In many countries, the president is the promulger of laws passed by the legislature.","zh":"在许多国家，总统会对议会通过的法律进行公布/颁布。"},{"en":"The organization acted as a promulger of public health guidance during the crisis.","zh":"在危机期间，该组织充当了公共卫生指南的传播者。"}]}],"synonyms":["promulgator","announcer","proclaimer","publisher","issuer"],"phonetic":"/ˈprɑːməlɡər/","extraExplanation":["“promulger”在现代英语中比较少见，更常用的是“promulgator”，或者直接用动词“promulgate（颁布/公布/传播）”。","词尾“-er”常表示“做某事的人/物”（agent noun），所以 promulger = “promulgate 的执行者/实施者”。在法律、政府公告、制度发布等语境里更常见。"]}
{"word":"promulges","summary":{"en":"Promulgate means to officially announce or make something (especially a law or rule) publicly known.","zh":"Promulgate 指正式公布、颁布（尤指法律或规章），或公开宣告并使众人知晓。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually used as \"promulgate\" or \"promulgates\") to officially announce or make a law, rule, or idea known to the public.","zh":"（通常用作“promulgate / promulgates”）正式公布或颁布（法律、规章），或公开宣告（观点、政策）。"},"examples":[{"en":"The government promulgated a new tax law last week.","zh":"政府上周颁布了一项新的税法。"},{"en":"The school promulgates clear rules about academic honesty.","zh":"学校公布了关于学术诚信的明确规定。"}]},{"partOfSpeech":"vt.","definition":{"en":"To spread an idea or belief widely so that many people know it.","zh":"广泛传播（理念、信念），使更多人知晓。"},"examples":[{"en":"The campaign sought to promulgate the message of public health.","zh":"这场宣传活动旨在传播公共卫生的信息。"}]}],"synonyms":["proclaim","announce","publish","issue","declare","enact"],"phonetic":"/ˈprɑməlˌɡeɪt/","extraExplanation":["你输入的“promulges”更像是拼写错误；标准动词是 **promulgate**，第三人称单数现在时是 **promulgates**（He/She promulgates a law）。","词源上来自拉丁语 *promulgare*，与“公开（publicly）+宣布（announce）”的含义相关，因此常用于正式语境（政府、机构文件）。"]}
{"word":"promulging","summary":{"en":"Promulgate means to officially announce or publish something (especially a law or rule) or to spread an idea widely.","zh":"promulgate 指正式公布/颁布（尤指法律法规），也可指广泛传播某种理念。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Commonly used as) to officially announce or publish a law, rule, or idea so that it becomes known to the public.","zh":"（常用）正式公布或颁布（法律、规则、政策或理念），使公众知晓。"},"examples":[{"en":"The government promulgated new safety regulations for food factories.","zh":"政府颁布了新的食品工厂安全法规。"},{"en":"The university promulgated a new policy on academic integrity.","zh":"大学发布了一项关于学术诚信的新政策。"},{"en":"The goal was to promulgate the idea that everyone deserves equal rights.","zh":"目标是推广“人人享有平等权利”的理念。"}]},{"partOfSpeech":"vt.","definition":{"en":"To spread an idea or belief widely; to make it well known.","zh":"广泛传播（观点或信念）；使其广为人知。"},"examples":[{"en":"The organization worked to promulgate environmental awareness in local schools.","zh":"该组织致力于在当地学校推广环保意识。"},{"en":"Writers and teachers can help promulgate a culture of respect.","zh":"作家和教师可以帮助传播尊重的文化。"}]}],"synonyms":["announce","proclaim","publish","issue","enact","declare","circulate","disseminate"],"phonetic":"/ˈprɑːməlˌɡeɪt/","extraExplanation":["你输入的 **promulging** 多半是拼写错误；正确常见形式是 **promulgating**（promulgate 的现在分词）或原形 **promulgate**。","promulgate 常见于法律、政府、公文语境，语气比 announce/publish 更“正式”，强调“官方颁布并使其生效/被公众知晓”。","词源来自拉丁语 *promulgare*（pro- “向前” + *mulgare* “公开/传播”相关），因此带有“公开传播”的含义。"]}
{"word":"promuscidate","summary":{"en":"“Promuscidate” is not a recognized English word; it is likely a misspelling (often of “promulgate” or “procrastinate”).","zh":"“promuscidate” 不是规范英语单词；多半是拼写错误（常见可能是 “promulgate” 或 “procrastinate”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; likely a misspelling or a made-up word. Common intended words include “promulgate” (to officially announce) or “procrastinate” (to delay doing something).","zh":"不是主要英语词典中的标准单词；很可能是拼写错误或自造词。常见的可能目标词包括 “promulgate”（正式公布/颁布）或 “procrastinate”（拖延）。"},"examples":[{"en":"If you meant “promulgate”: The government will promulgate the new law next week.","zh":"如果你想写的是 “promulgate”：政府将于下周正式颁布新法律。"},{"en":"If you meant “procrastinate”: I procrastinate when I feel overwhelmed.","zh":"如果你想写的是 “procrastinate”：当我感到压力很大时，我就会拖延。"}]}],"phonetic":"/ˌproʊ.mjuːˈsɪ.deɪt/","extraExplanation":["你输入的 “promuscidate” 看起来像把两个常见词的字母混在一起：\n- “promulgate”（常见于法律/公告语境）\n- “procrastinate”（常见于学习、工作与时间管理语境）\n如果你能提供一句包含该词的原句（你想表达的意思/上下文），我可以更准确判断你真正想用的词，并给出更贴切的释义和例句。"]}
{"word":"promuscis","summary":{"en":"Proboscis = a long nose/snout (elephant) or a long feeding mouthpart (insects).","zh":"Proboscis 指“长鼻/长吻”（如大象）或“昆虫的细长取食口器”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely you meant) a long, tube-like nose or snout, especially of certain animals such as elephants, tapirs, or some insects.","zh":"（你可能想写的是）长而管状的鼻子或口鼻部，常见于大象、貘，或某些昆虫等动物。"},"examples":[{"en":"An elephant uses its proboscis to pick up food and drink water.","zh":"大象用它的长鼻卷起食物并喝水。"},{"en":"Some insects have a proboscis for sucking nectar from flowers.","zh":"一些昆虫有口器（喙）用来吸食花蜜。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, flexible mouthpart of some insects used for feeding (for example, a butterfly’s or mosquito’s).","zh":"某些昆虫用于取食的细长可弯曲口器（例如蝴蝶或蚊子的）。"},"examples":[{"en":"The butterfly uncoiled its proboscis to sip nectar.","zh":"蝴蝶伸出卷曲的口器来吸花蜜。"},{"en":"Mosquitoes pierce skin using their proboscis.","zh":"蚊子用口器刺破皮肤。"}]}],"synonyms":["snout (for animals)","trunk (elephant)","mouthpart (in insects)"],"phonetic":"/proʊˈbɑːsɪs/","extraExplanation":["你输入的“promuscis”在英语里不常见，最接近且常见的词是 **proboscis**。拼写提示：**pro-bos-cis**（中间是 **bo**，不是 **mu**）。","词源小知识：proboscis 来自希腊语，含义与“向前伸出的鼻/口器”相关，所以既可指大象的“长鼻”，也可指昆虫的“口器”。"]}
{"word":"promutagen","summary":{"en":"A promutagen becomes mutagenic only after metabolic or chemical activation.","zh":"前诱变剂：需经代谢或化学活化后才具有致突变性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that is not directly mutagenic itself but can become mutagenic after it is changed (activated) by metabolism or another chemical process.","zh":"前诱变剂；本身不一定直接致突变，但在体内代谢或经过化学“活化”后会变成致突变物质的化合物。"},"examples":[{"en":"Some chemicals are promutagens because they need liver enzymes to become mutagenic.","zh":"有些化学物质是前诱变剂，因为它们需要肝脏酶的作用才会变成致突变物质。"},{"en":"In toxicology tests, researchers may add metabolic activation to detect promutagens.","zh":"在毒理学测试中，研究人员可能会加入代谢活化体系来检测前诱变剂。"}]}],"synonyms":["mutagen precursor","pro-mutagen"],"phonetic":"/proʊˈmjuːtədʒən/","extraExplanation":["“promutagen”常见于遗传毒理学（genetic toxicology）与致癌风险评估语境，强调“需要被代谢后才显现致突变性”。因此在实验中常会配合“代谢活化体系”（如S9 mix）来模拟体内代谢。","容易与“mutagen（致突变剂）”混淆：mutagen可直接造成DNA突变；promutagen则往往需要先被机体酶（尤其肝酶）转化成“ultimate mutagen（最终致突变体）”。"]}
{"word":"promycelia","summary":{"en":"Promycelia are the early hyphal structures that grow from certain fungal spores and produce new spores (plural of promycelium).","zh":"Promycelia 指某些真菌孢子萌发后形成的早期菌丝结构，并可产生新孢子（promycelium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of promycelium: short, early hyphal threads that grow from a fungal spore (especially in rust and smut fungi) and produce spores such as basidiospores","zh":"promycelium（前菌丝/原菌丝）的复数：由真菌孢子（尤指锈菌、黑粉菌）萌发形成的短小早期菌丝结构，可在其上产生如担孢子等孢子"},"examples":[{"en":"Under the microscope, several promycelia emerged from the germinating teliospore.","zh":"在显微镜下，可以看到多个前菌丝从正在萌发的冬孢子中长出。"},{"en":"The researcher counted how many basidiospores formed on each promycelium; the results were reported for the promycelia as a group.","zh":"研究者统计每条前菌丝上形成的担孢子数量，并将结果按前菌丝群体（promycelia）汇总报告。"}]}],"synonyms":["promyceliums (less common plural)","epibasidia (context-dependent)"],"phonetic":"/ˌproʊmaɪˈsiːliə/","extraExplanation":["“promycelium / promycelia”常见于植物病理学与真菌学教材或论文，尤其描述锈菌、黑粉菌的生活史。它通常与“teliospore（冬孢子）”一起出现：冬孢子萌发后先形成前菌丝，再在其上产生担孢子。","拼写提示：单数 promycelium（以 -um 结尾），复数 promycelia（以 -ia 结尾），类似 bacterium → bacteria。"]}
{"word":"promycelial","summary":{"en":"Promycelial means “related to a promycelium,” a short fungal filament formed during spore germination (often in rust and smut fungi).","zh":"promycelial 指“与前菌丝有关的”，即某些真菌孢子萌发时形成的短菌丝结构（常见于锈菌、黑粉菌）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a promycelium (a short fungal filament that develops when certain spores germinate, especially in rust and smut fungi).","zh":"与“前菌丝（promycelium）”有关的；指某些真菌（尤其是锈菌、黑粉菌）孢子萌发后形成的短菌丝结构。"},"examples":[{"en":"Under the microscope, the researcher observed promycelial cells forming from the germinating spore.","zh":"在显微镜下，研究人员观察到萌发的孢子形成了前菌丝细胞。"},{"en":"Promycelial development is an important stage in the life cycle of many smut fungi.","zh":"前菌丝的发育是许多黑粉菌生活史中的重要阶段。"}]}],"synonyms":["promycelium-related","basidial (context-dependent)"],"phonetic":"/ˌproʊmaɪˈsiːliəl/","extraExplanation":["“promycelium”常见于植物病理学与真菌学语境，尤其描述锈菌/黑粉菌等担子菌类群在特定孢子（如厚垣孢子/冬孢子）萌发后形成的结构；该结构往往与后续产生孢子（如担孢子）以及感染过程有关。","词形上：pro-（向前、早期）+ mycelium（菌丝体），因此“promycelial”可理解为“前菌丝阶段/前菌丝相关的”。"]}
{"word":"promycelium","summary":{"en":"A short fungus structure formed from a germinating resting spore (often a teliospore) that produces basidiospores; essentially a basidium in rusts and smuts.","zh":"由休眠孢子（常为冬孢子）萌发形成的短结构，用来产生担孢子；在锈菌、黑粉菌中相当于担子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In some fungi (especially rusts and smuts), a short hyphal structure that grows out of a resting spore (often a teliospore) and produces spores (basidiospores). It functions like a basidium.","zh":"（真菌学）在一些真菌（尤其是锈菌、黑粉菌）中，从休眠孢子（常为冬孢子/厚垣孢子，teliospore）萌发形成的一段短菌丝结构，用来产生孢子（担孢子，basidiospores），功能相当于担子。"},"examples":[{"en":"After the teliospore germinates, it forms a promycelium that produces basidiospores.","zh":"冬孢子萌发后，会形成前菌丝体，并产生担孢子。"},{"en":"In smut fungi, the promycelium is a key stage in the life cycle.","zh":"在黑粉菌中，前菌丝体是生活史中的关键阶段。"}]}],"synonyms":["metabasidium","basidium"],"phonetic":"/ˌproʊmaɪˈsiːliəm/","extraExplanation":["“promycelium”常见于植物病理学与真菌学教材中，主要用于描述锈菌、黑粉菌等担子菌类群在“冬孢子萌发”后的结构阶段。","在不少资料里，promycelium 与 “metabasidium（后担子）”几乎同义：它会发生减数分裂并形成担孢子，进而感染新的寄主。","词源可拆为 pro-（前、初期）+ mycelium（菌丝体），强调这是“菌丝体形成的早期/前期结构”。"]}
{"word":"promyelocyte","summary":{"en":"A promyelocyte is an early-stage granulocyte (immature white blood cell) mainly found in bone marrow.","zh":"promyelocyte 指主要存在于骨髓的早期粒细胞（未成熟白细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An immature white blood cell (a developing granulocyte) found mainly in bone marrow; it is an early stage in forming neutrophils, eosinophils, or basophils.","zh":"（主要存在于骨髓中的）早幼粒细胞：一种未成熟的白细胞（粒细胞的早期发育阶段），之后会进一步发育成中性粒细胞、嗜酸性粒细胞或嗜碱性粒细胞。"},"examples":[{"en":"Doctors examined the bone marrow and found an increased number of promyelocytes.","zh":"医生检查骨髓后发现早幼粒细胞数量增多。"},{"en":"In normal blood tests, promyelocytes are usually not seen in the bloodstream.","zh":"在正常的血液检查中，外周血里通常看不到早幼粒细胞。"},{"en":"Acute promyelocytic leukemia (APL) is a cancer involving abnormal promyelocytes.","zh":"急性早幼粒细胞白血病（APL）是一种与异常早幼粒细胞有关的癌症。"}]}],"synonyms":["precursor cell (contextual)","immature granulocyte (broader term)"],"phonetic":"/proʊˈmaɪ.ə.loʊ.saɪt/","extraExplanation":["词源拆解：pro-（在……之前、早期）+ myelo-（骨髓）+ -cyte（细胞），字面意思是“骨髓里的早期细胞”。","学习提示：在医学语境里它常与白血病（leukemia）或骨髓检查（bone marrow exam / biopsy）一起出现；日常英语里很少用。","用法注意：promyelocyte 是可数名词；复数为 promyelocytes。"]}
{"word":"promythic","summary":{"en":"“Promythic” means pro-myth: it supports or promotes mythic stories or myth-making.","zh":"“Promythic”意为“支持神话（或神话化/造神）的”：偏向或推动神话叙事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting, favoring, or promoting myths or myth-making (often used in academic, literary, or cultural discussion).","zh":"支持、偏向或推动神话（或“神话化/造神”）的（常见于学术、文学或文化讨论）。"},"examples":[{"en":"Some critics call the film’s national heroes “promythic,” because it turns history into legend.","zh":"一些评论家称这部电影对民族英雄的塑造是“promythic”的，因为它把历史变成了传奇。"},{"en":"Her writing takes a promythic approach, using gods and archetypes to explain human behavior.","zh":"她的写作采用promythic的方式，用诸神与原型来解释人类行为。"}]}],"synonyms":["pro-myth","myth-supporting","myth-promoting","mythologizing"],"phonetic":"/proʊˈmɪθɪk/","extraExplanation":["“promythic”不是非常常见的标准词，更像是由“pro-（支持、赞成）+ mythic（神话的）”组合出来的学术/评论用词。你也可能在相近表达中看到：myth-making（造神/神话化）、mythologizing（把……神话化）。","语气上它不一定是褒义：有时表示“赞美并强化神话叙事”，有时也带批评意味，指“把复杂的现实简化成英雄神话”。"]}

