{"word":"proracing","summary":{"en":"“Pro racing” means professional, high-level competitive racing, or something related to that world.","zh":"“pro racing”指“职业级别的竞速/比赛”，也可作形容词表示“与职业竞速相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"professional racing; competitive racing done by paid, elite athletes/drivers under official rules (often in motorsports, cycling, running, etc.).","zh":"职业比赛／职业竞速；由受雇或顶尖选手在正式规则下进行的竞技比赛（常见于赛车、自行车、跑步等）。"},"examples":[{"en":"He trained for years before entering pro racing.","zh":"他训练了很多年才进入职业比赛。"},{"en":"Pro racing teams need sponsors to cover travel and equipment costs.","zh":"职业车队需要赞助商来承担差旅和器材费用。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to, designed for, or happening in professional racing.","zh":"与职业竞速有关的；为职业比赛设计的；发生在职业比赛中的。"},"examples":[{"en":"She bought pro racing tires for better grip on the track.","zh":"她买了职业赛用轮胎，以便在赛道上有更好的抓地力。"},{"en":"The documentary shows the pressure of pro racing life.","zh":"这部纪录片展示了职业竞速生活的压力。"}]}],"synonyms":["professional racing","elite racing","top-level racing","motorsport (contextual)"],"phonetic":"/ˈproʊ ˌreɪsɪŋ/","extraExplanation":["“pro”是“professional”的常见缩写，表示“职业的/专业的”。写作时更常见两种形式：pro racing（分开写）或 pro-racing（作定语时用连字符更清晰，如 pro-racing circuit）。","在不同领域里它指的项目会变化：在北美语境中常让人联想到赛车运动（如 NASCAR、IndyCar），但也可指职业自行车赛、职业跑步等。"]}
{"word":"prorailroad","summary":{"en":"“Pro-railroad” means supporting railroads or railway expansion, or someone who supports them.","zh":"“pro-railroad”指支持铁路/铁路扩张的（立场），也可指支持铁路的人或群体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting railroads or railway development; favoring policies that help rail transport.","zh":"支持铁路或铁路建设的；倾向于促进铁路运输与相关政策的。"},"examples":[{"en":"The senator took a pro-railroad position on the transportation bill.","zh":"这位参议员在交通法案上采取了支持铁路的立场。"},{"en":"Local businesses formed a pro-railroad coalition to argue for better passenger service.","zh":"当地企业组成了一个支持铁路的联盟，主张改善客运服务。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or viewpoint that supports railroads or rail expansion.","zh":"支持铁路或铁路扩张的人、团体或观点。"},"examples":[{"en":"Pro-railroads say trains reduce highway traffic and pollution.","zh":"支持铁路的人认为火车能减少公路拥堵和污染。"}]}],"synonyms":["pro-rail","rail-supporting","rail-friendly","in favor of rail","pro-transit"],"phonetic":"/ˌproʊˈreɪlˌroʊd/","extraExplanation":["“pro-”是英语里很常见的前缀，意思是“支持、赞成”（与“anti- 反对”相对）。因此“pro-railroad”通常用于政治、政策、城市规划或公共讨论中，表示立场或倾向。","写法上常见带连字符：pro-railroad。也可能写作 pro railroad（较少见，尤其在正式写作里不如带连字符清晰）。"]}
{"word":"prorata","summary":{"en":"Prorata (more commonly written “pro rata”) means “in proportion,” especially for prorated fees, salaries, or refunds.","zh":"prorata（更常写作 pro rata）意为“按比例”，常用于费用、工资或退款等按时间/份额折算的情况。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In proportion; calculated or distributed according to a rate or share (often used in finance, law, rent, salaries, refunds).","zh":"按比例；按份额计算或分配（常用于金融、法律、房租、薪资、退款等语境）。"},"examples":[{"en":"You’ll be charged on a prorata basis for the days you used the service.","zh":"你将按使用服务的天数按比例收费。"},{"en":"The annual bonus was paid prorata because she joined the company midyear.","zh":"因为她年中入职，年终奖金按比例发放。"},{"en":"If you cancel early, the landlord may refund rent prorata.","zh":"如果你提前解约，房东可能按比例退还房租。"}]},{"partOfSpeech":"n.","definition":{"en":"A prorated amount or calculation based on proportion (less common as a noun in everyday English).","zh":"按比例计算的金额/结果；按比例分摊（作名词时较少见）。"},"examples":[{"en":"The invoice includes a prorata for the partial month.","zh":"这张发票包含了对不满一个月部分的按比例金额。"}]}],"synonyms":["pro rata","proportionally","in proportion","prorated"],"phonetic":"/proʊ ˈreɪtə/","extraExplanation":["“prorata”常见写法是连写“prorata”，也常写作“pro rata”（更常见、较正式）。意思源自拉丁语 pro rata（按既定比例/按份额）。","在实际文件里常和这些词搭配：prorata charge（按比例费用）、prorata refund（按比例退款）、prorata share/allocation（按比例份额/分配）、prorata basis（按比例计）。"]}
{"word":"proratable","summary":{"en":"“Proratable” means something can be divided or calculated proportionally, especially in contracts and billing.","zh":"“Proratable”指可按比例分摊或折算，常用于合同与计费场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be divided, calculated, or distributed in proportion (often based on time, usage, or shares).","zh":"可按比例分摊的；可按比例计算/分配的（常按时间、使用量或份额）。"},"examples":[{"en":"Your refund is proratable if you cancel halfway through the year.","zh":"如果你在年中取消，你的退款可以按比例计算。"},{"en":"The annual bonus is proratable for employees who joined midyear.","zh":"年终奖金对年中入职的员工可按比例发放。"},{"en":"Some fees are not proratable, so you may not get any money back.","zh":"有些费用不能按比例退还，所以你可能拿不回钱。"}]}],"synonyms":["proportional","pro rata","allocable","apportionable"],"phonetic":"/proʊˈreɪtəbəl/","extraExplanation":["“Proratable”常见于合同、订阅、保险和薪资等正式语境，表示按某个比例（尤其是按天数/月份）来计算金额或权益。","相关词：prorate（v. 按比例分摊/折算）；proration（n. 按比例分摊）；pro rata（adv./adj. 拉丁语“按比例地/按比例的”，在法律和商业文本中很常见，如“refund on a pro rata basis”。"]}
{"word":"Prorate","summary":{"en":"Prorate means to calculate or divide something proportionally, usually based on time used.","zh":"Prorate 指按比例（通常按使用时间或份额）计算或分摊金额。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to divide or calculate an amount proportionally, based on time used or a share of the whole","zh":"按比例分摊；（常按时间或份额）比例计算"},"examples":[{"en":"Your first month’s rent will be prorated because you moved in on the 15th.","zh":"你在15号入住，所以第一个月的房租会按天数比例计算。"},{"en":"We’ll prorate the annual fee if you cancel mid-year.","zh":"如果你在年中取消，我们会按比例退还年费。"},{"en":"The bonus was prorated according to how long each employee worked that year.","zh":"奖金按员工当年的工作时长比例分配。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be divided or calculated proportionally","zh":"按比例分摊；按比例计算（多用于被动或描述结果）"},"examples":[{"en":"The subscription cost prorates to about $2 a day.","zh":"订阅费用按比例算下来大约每天2美元。"},{"en":"Charges will prorate automatically on your next bill.","zh":"费用会在你下一期账单中自动按比例计算。"}]}],"synonyms":["apportion","allocate","divide proportionally","proportion"],"phonetic":"/ˌproʊˈreɪt/","extraExplanation":["“prorate”常见于账单、租房、会员订阅、保险等场景，核心意思是“只为实际使用的部分付费/退款”。","词源上来自拉丁语前缀“pro-”（按比例、向前）+ “rate”（比率/费用），所以很好记：按“费率比例”来算。","常见搭配：prorated rent（按比例房租）、prorated refund（按比例退款）、prorated amount/fee（按比例金额/费用）。也常见形容词形式“prorated”。"]}
{"word":"prorate","summary":{"en":"Prorate means to calculate or divide a cost, payment, or amount fairly in proportion to time used or a partial period.","zh":"Prorate 指将费用、付款或金额按使用时间或部分周期按比例公平计算/分摊。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to divide an amount (especially money, costs, or time) fairly according to a proportion, such as the number of days used or the part of a period completed","zh":"按比例分摊；按实际使用的比例计算（尤指费用、金额或时间）"},"examples":[{"en":"Your first month’s rent will be prorated because you moved in mid-month.","zh":"因为你在月中搬入，第一个月的房租会按比例计算。"},{"en":"We will prorate the subscription fee if you cancel before the end of the year.","zh":"如果你在年底前取消订阅，我们会按比例退还订阅费。"},{"en":"The refund is prorated based on how many days of service you used.","zh":"退款会根据你使用服务的天数按比例计算。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of an amount) to be calculated or adjusted proportionally","zh":"（金额等）按比例计算或调整"},"examples":[{"en":"The fee prorates automatically when you change your plan.","zh":"当你更改套餐时，费用会自动按比例调整。"},{"en":"If the employee starts late, the salary prorates for that pay period.","zh":"如果员工晚入职，该工资期的薪水会按比例计算。"}]}],"synonyms":["apportion","allocate","proportion","divide proportionally","prorate (pro rata)"],"phonetic":"/ˈproʊˌreɪt/","extraExplanation":["“prorate”常见于租房、工资、订阅、保险等场景。它强调“按时间或份额公平分摊”。例如：月费30美元，一个月30天，用了10天，则按比例费用=30×(10/30)=10美元。","词源上与拉丁语“pro rata”（按比例）有关；在正式文件里你也可能看到短语“pro rata”（意思相近）。"]}
{"word":"prorated","summary":{"en":"“Prorated” means calculated proportionally, especially for money based on time or use.","zh":"“prorated”指按比例计算/分摊，常用于根据时间或使用量折算金额。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Divided and calculated in proportion to a period of time, amount, or use (often for bills, rent, salary, fees, or refunds).","zh":"按比例分摊/折算的（通常根据时间、数量或使用量来计算账单、房租、工资、费用或退款）。"},"examples":[{"en":"Your first month’s rent will be prorated because you moved in on the 10th.","zh":"因为你是10号入住的，你第一个月的房租会按比例折算。"},{"en":"The annual membership fee is prorated if you join midyear.","zh":"如果你在年中加入，年费会按比例计算。"},{"en":"We received a prorated refund for the unused days.","zh":"我们收到了未使用天数对应的按比例退款。"}]},{"partOfSpeech":"v.","definition":{"en":"To divide and calculate something in proportion (usually money) based on time, use, or a fraction of a whole.","zh":"（通常指金额）按比例分摊/折算（根据时间、使用量或整体的一部分来计算）。"},"examples":[{"en":"The company prorated my bonus for the months I worked.","zh":"公司按我实际工作的月份比例折算了我的奖金。"},{"en":"They prorated the bill when we changed plans halfway through the month.","zh":"我们在月中更改套餐后，他们把账单按比例重新计算了。"}]}],"synonyms":["proportional","proportioned","allocated","apportioned"],"phonetic":"/proʊˈreɪtɪd/","extraExplanation":["“prorated”常见于美式商务/账单语境（租房、水电网费、订阅、保险、工资）。核心思路是“不是算整份，而是按你实际占用的那一部分来算”。","拼写也常见作“pro-rated”，含义相同。计算上常用公式：应付金额 = 全额 ×（实际天数/总天数）或 ×（实际使用量/总使用量）。"]}
{"word":"prorater","summary":{"en":"A prorater is someone or something that calculates a proportional (prorated) amount, often for partial time periods.","zh":"prorater 指按比例（prorated）计算金额的人或工具，常用于不足整段时间的费用/退款计算。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, company, or tool that prorates something (divides a cost, payment, or amount proportionally, usually by time or usage)","zh":"按比例分摊（费用/金额）的人、公司或工具（通常按时间或使用量来计算）"},"examples":[{"en":"The insurer uses a prorater to calculate how much premium to refund after you cancel mid‑month.","zh":"保险公司用按比例计算系统来算你在月中取消后应退还多少保费。"},{"en":"Ask the billing team who the prorater is for partial-month charges.","zh":"如果是按月不足整月的费用，问一下账单团队由谁来按比例分摊计算。"}]}],"synonyms":["prorating tool","pro-rater","billing calculator","proration calculator"],"phonetic":"/proʊˈreɪtər/","extraExplanation":["“Prorater”来自动词“prorate”（按比例分摊/分摊计算）。在美国常见于账单、订阅、租金、保险保费、工资等场景：比如只用了一部分月份，就按天数或使用量计算应付/应退金额。","拼写上也常见作“pro-rater”或“prorater”；更常用的表达往往是直接说“proration/prorated amount（按比例金额）”或“prorate calculator（按比例计算器）”。"]}
{"word":"prorates","summary":{"en":"“Prorates” means calculates or charges something proportionally (pro rata), often for time or usage.","zh":"“prorates”表示按比例（pro rata）计算或收费，常用于按时间或用量分摊费用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to divide, calculate, or charge something proportionally (according to a fraction of time, use, or shares)","zh":"按比例分摊；按（时间/用量/份额）比例计算或收费"},"examples":[{"en":"The landlord prorates the rent if you move in mid-month.","zh":"如果你在月中搬入，房东会按比例计算房租。"},{"en":"Your subscription fee is prorated when you cancel early.","zh":"你提前取消订阅时，费用会按比例退还/计算。"},{"en":"The company prorates bonuses based on how long employees worked that year.","zh":"公司会根据员工当年工作时长按比例发放奖金。"}]}],"synonyms":["apportion","allocate","proportion","distribute proportionally","prorate"],"phonetic":"/proʊˈreɪts/","extraExplanation":["“Prorate”常见于账单、薪资、租金、订阅等场景，意思是“按比例（pro rata）计算”。例如：只使用了一个月中的10天，就只付（或退）10/30的费用。","词源上与拉丁语短语“pro rata”（按比例）有关；英语里也常看到名词/形容词形式“prorated / pro-rated”（已按比例计算的）。"]}
{"word":"prorating","summary":{"en":"Prorating means calculating or dividing a payment, fee, or refund proportionally based on part of a period or share used.","zh":"Prorating 指把费用/付款/退款按使用的时间或份额“按比例”计算或分摊。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to divide or calculate an amount proportionally, based on time used, partial service, or a share of the whole","zh":"按比例分摊；按使用时间/份额比例计算（费用、工资、退款等）"},"examples":[{"en":"Your rent will be prorated because you moved in on the 15th.","zh":"因为你在15号才搬进来，你的房租会按比例计算。"},{"en":"The subscription fee is prorated if you cancel mid-month.","zh":"如果你在月中取消订阅，费用会按比例退还/结算。"},{"en":"They prorated the annual bonus based on months worked.","zh":"他们按工作月份比例发放年终奖金。"}]},{"partOfSpeech":"n.","definition":{"en":"a proportional division or calculation of an amount (often used as a gerund or adjective-like word in business contexts)","zh":"按比例分摊/计算（常作动名词或类形容词，用于商业语境）"},"examples":[{"en":"We need to discuss prorating for partial months.","zh":"我们需要讨论针对不满整月的按比例计算方式。"},{"en":"The policy includes prorating of charges and refunds.","zh":"该政策包含费用与退款的按比例结算。"}]}],"synonyms":["apportion","allocate","proportion","divide proportionally","prorate"],"phonetic":"/ˌproʊˈreɪtɪŋ/","extraExplanation":["“Prorate”常见于账单、租房、工资、保险、订阅等场景。核心概念是“按实际使用的比例来算”，比如按天数、按月数、按份额分摊。","拼写提示：prorate / pro-rate（有时会写成带连字符的形式）。名词常见搭配：prorated amount（按比例金额）、prorated refund（按比例退款）、prorated charge（按比例收费）。"]}
{"word":"proration","summary":{"en":"Proration means dividing a payment or amount proportionally, often based on time used.","zh":"Proration 指按比例分摊或按使用时间等比例计算费用/金额。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of dividing an amount (money, time, costs, benefits, etc.) proportionally, usually based on time used or part received.","zh":"按比例分摊（金额、时间、费用、福利等）的行为，通常根据使用时间或实际获得的部分来计算。"},"examples":[{"en":"Your first month’s rent is subject to proration because you moved in mid-month.","zh":"因为你在月中入住，你的第一个月房租会按比例计算。"},{"en":"The company calculated a proration of health insurance premiums for new employees.","zh":"公司为新员工按比例计算了健康保险保费。"}]}],"synonyms":["pro rata allocation","apportionment","proportional division","allocation"],"phonetic":"/proʊˈreɪʃən/","extraExplanation":["“Proration”常见于租房、工资、订阅服务、保险等场景，意思是“按比例算”。例如：月费30美元，但只用了10天（一个月按30天算），则通常按10/30计费。","常见搭配：proration of rent（房租按比例）、proration of salary（工资按比例）、subject to proration（需按比例计算）、prorated amount（按比例后的金额）。","相关词：pro rata（按比例地，常用于正式/法律/财务语境），prorate（动词：按比例分摊/计算）。"]}
{"word":"prore","summary":{"en":"Pro re means “for the matter at hand,” used mainly in formal or legal contexts.","zh":"Pro re 表示“就此事而言/就事论事”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Latin, used in formal/legal English) “for the matter/thing (in question)”; referring to the specific issue being discussed.","zh":"（拉丁语，常见于正式/法律英语）“就该事项/就此事而言”；指正在讨论的具体问题。"},"examples":[{"en":"The judge asked counsel to address the argument pro re, not to bring up unrelated issues.","zh":"法官要求律师就此事本身进行论证，不要提出无关问题。"},{"en":"We don’t need a long history lesson—let’s speak pro re and decide what to do next.","zh":"我们不需要长篇背景介绍——就事论事，决定下一步怎么办。"}]}],"synonyms":["as to the matter","with respect to the issue","regarding the point","on the question"],"phonetic":"/ˌproʊ ˈreɪ/","extraExplanation":["“pro re”来自拉丁语：pro（为了/就……而言）+ re（事情/事项，ablative形式）。在英语里它多出现在法律写作或较正式的讨论中，用来强调“就当前议题本身”。","你输入的“prore”更像是把“pro re”连写了；现代英语里“prore”本身不是常见单词。若你想查的是别的词（如“prone / pro rata / prorate”），告诉我正确拼写我可以再解释。"]}
{"word":"proreader","summary":{"en":"A proofreader is someone who checks written text for errors before publication.","zh":"proofreader指在出版或发布前检查文字错误的校对员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to read text carefully to find and correct mistakes (especially spelling, grammar, punctuation, and formatting) before it is published or shared.","zh":"（出版或发布前）仔细审读文字、找出并改正错误（尤其是拼写、语法、标点、版式等）的人；校对员。"},"examples":[{"en":"The proofreader caught three spelling mistakes in the final draft.","zh":"校对员在终稿里发现了三个拼写错误。"},{"en":"Before we print the brochure, a proofreader will check the layout and punctuation.","zh":"在我们印刷宣传册之前，校对员会检查版式和标点。"},{"en":"She works as a proofreader for an online magazine.","zh":"她在一家网络杂志做校对工作。"}]}],"synonyms":["copyeditor","editor (general)","checker"],"phonetic":"/ˈpruːfˌriːdɚ/","extraExplanation":["你输入的“proreader”更常见的正确拼写是“proofreader”。“proof”在这里指“校样/打样稿”（proofs），所以proofreader就是“看校样的人”。在正式写作或简历中建议使用proofreader。","与proofreader相关的常见词：copyeditor（文字编辑，常会改写句子与风格；比proofreader更深入）、editor（编辑，范围更广）。proofreader通常以“查错”为主。"]}
{"word":"prorealism","summary":{"en":"Prorealism means support for realism, either as a philosophical view or an artistic/literary style.","zh":"Prorealism 指“亲/支持现实主义”，可用于哲学观点或艺术/文学写实风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Support for, or an attitude favoring, realism (the view that things exist independently of our beliefs, or the style of representing life as it is).","zh":"支持或倾向于“现实主义”（指认为事物独立于我们的信念而存在的观点，或在艺术中如实表现生活的风格）。"},"examples":[{"en":"His essay argues for prorealism in philosophy, saying the world exists whether we describe it or not.","zh":"他的文章在哲学上主张亲现实主义，认为世界是否被我们描述都客观存在。"},{"en":"The director’s prorealism shows in the film’s natural dialogue and ordinary settings.","zh":"这位导演的亲现实主义体现在电影自然的对白和日常的场景中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or characterized by support for realism.","zh":"与支持现实主义有关的；带有亲现实主义倾向的。"},"examples":[{"en":"They took a prorealism position in the debate about truth and perception.","zh":"在关于真理与感知的辩论中，他们采取了亲现实主义立场。"},{"en":"Her prorealism approach avoids exaggeration and focuses on everyday details.","zh":"她的亲现实主义方法避免夸张，专注于日常细节。"}]}],"synonyms":["pro-realism","support for realism","realist stance","realist approach"],"phonetic":"/proʊˈriːəˌlɪzəm/","extraExplanation":["“prorealism”不是特别常见的标准词，更常见的写法是“pro-realism”（加连字符），意思就是“亲/支持现实主义”。","前缀“pro-”表示“支持、赞成”（如 pro-democracy 亲民主）；“realism”在不同领域含义略不同：哲学里强调“客观存在”，艺术/文学里强调“写实、贴近生活”。阅读时要根据语境判断。","近义表达（按语境选用）：“support for realism / realist stance / realist approach”。反向表达常见为“anti-realism”（反现实主义）。"]}
{"word":"prorealist","summary":{"en":"Prorealist means supporting realism (a practical, fact-based view), or a person who supports it.","zh":"Prorealist 指支持现实主义（务实、基于事实的观点），也可指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring realism (the idea of focusing on what is practical and real rather than idealistic), especially in politics, international relations, philosophy, or art.","zh":"支持或倾向于“现实主义”的（强调务实、符合现实而非理想化），常见于政治、国际关系、哲学或艺术语境。"},"examples":[{"en":"Her prorealist view is that policy should be based on facts and power, not wishes.","zh":"她的亲现实主义观点是：政策应建立在事实与力量之上，而不是愿望之上。"},{"en":"The article argues for a prorealist approach to foreign affairs.","zh":"这篇文章主张以亲现实主义的方式处理外交事务。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports realism (a realist) in a particular field.","zh":"支持现实主义的人（在某一领域持现实主义立场的人）。"},"examples":[{"en":"As a prorealist, he rejects overly optimistic predictions.","zh":"作为亲现实主义者，他拒绝过度乐观的预测。"}]}],"synonyms":["pro-realist","realist (in context)","pragmatic","hard-nosed"],"phonetic":"/ˌproʊˈriə.lɪst/","extraExplanation":["“prorealist”更常见的写法是带连字符的“pro-realist”，意思是“支持现实主义立场的”。在国际关系（IR）中，realism（现实主义）通常强调国家利益、权力与安全；“pro-realist”往往指更赞同这种分析框架的人。","在艺术语境里，realism（现实主义）指真实、如实地描绘生活；“prorealist/pro-realist”可指偏好这种风格或主张回归写实表达。"]}
{"word":"prorealistic","summary":{"en":"“Prorealistic” means favoring or aiming for realism, though it’s uncommon; “pro-realist/pro-realism” or “realistic” is more standard.","zh":"“prorealistic”表示支持或追求现实主义/写实效果，但不算常见；更标准的说法常用“pro-realist/pro-realism”或“realistic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting, favoring, or advocating realism (the idea of showing things as they really are, without idealizing).","zh":"支持／偏好现实主义的；主张如实呈现、不加美化的。"},"examples":[{"en":"The director took a prorealistic approach, keeping the dialogue natural and imperfect.","zh":"这位导演采取了偏现实主义的手法，让对白更自然、带点不完美。"},{"en":"Her prorealistic style avoids glamorous filters and focuses on everyday life.","zh":"她偏现实主义的风格避免使用华丽滤镜，而是聚焦日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Designed to look extremely real; aiming for a realistic effect.","zh":"（较少见）旨在看起来高度逼真；追求真实效果的。"},"examples":[{"en":"The makeup was so prorealistic that the scars looked authentic on camera.","zh":"这妆效非常逼真，镜头里疤痕看起来很真实。"}]}],"synonyms":["pro-realist","pro-realism","realistic","naturalistic","true-to-life"],"phonetic":"/ˌproʊriˈælɪstɪk/","extraExplanation":["“prorealistic”不是非常常见或固定的标准词，更常见的表达是“pro-realism / pro-realist”（支持现实主义）或直接用“realistic / naturalistic”（写实的／自然主义的）。在写作里如果想更地道，通常把“pro-”作为前缀加连字符：pro-realist, pro-realism。"]}
{"word":"proreality","summary":{"en":"Proreality means “in favor of reality”: focusing on facts and real-world conditions rather than fantasy or idealization.","zh":"Proreality 指“支持现实/基于现实”：强调事实与真实处境，而不是幻想或理想化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring reality over fantasy or idealized versions; emphasizing what is real, factual, or practical.","zh":"支持现实（而非幻想或理想化）；强调真实、事实或务实。"},"examples":[{"en":"Her proreality approach focuses on facts, not wishful thinking.","zh":"她的“支持现实”做法注重事实，而不是一厢情愿。"},{"en":"The film is praised for its proreality tone and honest portrayal of everyday life.","zh":"这部电影因其“贴近现实”的基调和对日常生活的真实呈现而受到称赞。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or movement that promotes realistic thinking or policies based on actual conditions.","zh":"一种强调现实思维或依据客观情况制定政策的观点/倾向。"},"examples":[{"en":"In debates, his proreality is refreshing because it deals with real constraints.","zh":"在辩论中，他强调现实的立场让人耳目一新，因为他会面对真实的限制。"}]}],"synonyms":["realistic","pragmatic","reality-based","fact-based","down-to-earth"],"phonetic":"/ˌproʊriˈælɪti/","extraExplanation":["“proreality”并不是非常常见的标准词，更像是由前缀 pro-（支持、赞成）+ reality（现实）临时组合出来的新造词/网络用词。正式写作里更常见的表达有：reality-based（基于现实的）、pragmatic（务实的）、realistic（现实的）、fact-based（基于事实的）。","使用时要注意语境：它通常带有“反对粉饰、反对幻想”的含义，但在某些场合也可能被理解为“过于冷酷/不浪漫”。"]}
{"word":"prorean","summary":{"en":"“Prorean” isn’t a standard English word; you probably mean “protean” (changeable, versatile).","zh":"“prorean”不是标准英语单词；你可能想写“protean”（多变的、适应力强的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “protean”) able to change easily and take many different forms; versatile and adaptable.","zh":"（可能想写的是：protean）多变的；能轻易改变形态的；多才多艺、适应力强的。"},"examples":[{"en":"The startup has a protean business model that shifts with the market.","zh":"这家初创公司的商业模式非常多变，会随着市场而调整。"},{"en":"She’s a protean actor who can play comedy and tragedy equally well.","zh":"她是一位多才多艺的演员，喜剧和悲剧都能演得很好。"}]}],"synonyms":["versatile","adaptable","changeable","multifaceted","mutable"],"phonetic":"/ˈproʊtiən/","extraExplanation":["“prorean”在英语里不是常见单词，最接近且常被拼错的词是 **protean**。","**protean** 源自希腊神话中的海神 **Proteus**，他能随意变形，因此这个词常用来形容“变化多端、适应性强”。","常见搭配：protean nature / protean personality / protean skills。"]}
{"word":"prorebate","summary":{"en":"Prorebate is an uncommon term usually meaning either a rebate for professional customers or a pro-rated rebate calculated by time/usage.","zh":"Prorebate 是不常见用词，通常指给专业客户的返利，或指按时间/用量折算的按比例返利。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon) a rebate (partial refund or discount) offered to “pro” (professional) customers, members, or partners.","zh":"（不常见）给“pro”（专业人士/专业客户、会员或合作伙伴）提供的返利/回扣（部分退款或折扣）。"},"examples":[{"en":"This store gives a prorebate to licensed contractors on tools.","zh":"这家店会给持证承包商购买工具提供专业返利。"},{"en":"Ask customer service whether the prorebate applies to online orders.","zh":"可以问客服这个专业返利是否适用于线上订单。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes used to mean a pro-rated rebate (a rebate reduced or calculated according to time or usage).","zh":"有时也被用来指“按比例计算的返利”（根据使用时间/用量折算的返利）。"},"examples":[{"en":"If you cancel mid-month, you may receive a prorebate based on the remaining days.","zh":"如果你在月中取消，可能会按剩余天数获得按比例返利。"},{"en":"The carrier issued a prorebate after the plan change.","zh":"套餐变更后，运营商发放了按比例返利。"}]}],"synonyms":["rebate","discount","cashback","pro rebate","pro-rated rebate"],"phonetic":"/ˌproʊ ˈriːˌbeɪt/","extraExplanation":["“prorebate”不是常见标准词，更常见的写法是分开写成“pro rebate”，或直接写“pro-rated rebate / prorated rebate（按比例返利）”。在合同、账单或促销条款里看到该词时，最好结合上下文确认它指的是“专业客户专属返利”还是“按比例折算的返利”。","词根提示：rebate = 返利/回扣/退款；pro- 在这里通常表示“professional（专业的）”，而不是“赞成（pro）”。"]}
{"word":"prorebel","summary":{"en":"“Prorebel” (more commonly “pro-rebel”) means supporting or favoring rebels.","zh":"“prorebel”（更常写作“pro-rebel”）指支持或偏向叛军/反抗者的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring rebels (people who fight against a government or authority), especially in politics or war reporting.","zh":"支持或同情叛军的（指反抗政府或权威的人），常见于政治或战争报道中。"},"examples":[{"en":"The newspaper was accused of taking a pro-rebel stance.","zh":"这家报纸被指责采取亲叛军立场。"},{"en":"Some countries provided pro-rebel groups with supplies.","zh":"一些国家向亲叛军的团体提供物资。"}]}],"synonyms":["pro-insurgent","pro-opposition","rebel-supporting","pro-revolutionary"],"phonetic":"/ˌproʊˈrɛbəl/","extraExplanation":["“prorebel”更常见的写法是带连字符的“pro-rebel”。“pro-”表示“支持/赞成……的”，例如：pro-democracy（亲民主的）、pro-choice（支持选择权的）。","“rebel”既可作名词（叛乱者/反抗者），也可作动词（反抗）。在新闻语境里，“pro-rebel”通常是形容某个立场、团体或政策“偏向叛军”。","使用时要注意语气与立场：在不同国家/媒体中，“rebel”可能被称为“freedom fighters（自由战士）”或“insurgents（叛乱分子）”，带有不同评价色彩。"]}
{"word":"prorecall","summary":{"en":"“Prorecall” (more commonly written “pro-recall”) means supporting a political recall, or a person/group in favor of a recall campaign.","zh":"“prorecall”（更常写作“pro-recall”）指支持政治罢免的；也可指支持罢免行动的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a political recall (an effort to remove an elected official from office before the end of their term)","zh":"支持“罢免”（在任期结束前通过投票等方式撤换民选官员）的"},"examples":[{"en":"Several pro-recall groups began collecting signatures last week.","zh":"上周，多个支持罢免的团体开始收集签名。"},{"en":"The mayor faced strong pro-recall pressure after the scandal.","zh":"丑闻之后，市长面临强烈的支持罢免的压力。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports a recall campaign","zh":"支持罢免行动的人或团体"},"examples":[{"en":"Pro-recalls say the official has lost the public’s trust.","zh":"支持罢免者表示这位官员已失去公众信任。"}]}],"synonyms":["pro-recall","in favor of a recall","supporting a recall"],"phonetic":"/ˌproʊ rɪˈkɔl/","extraExplanation":["“prorecall / pro-recall / pro recall”更常见于新闻与社交媒体语境，属于临时组合用法，并非固定的标准词条拼写；更规范的写法通常加连字符：pro-recall。","美国政治语境里，recall 常指“罢免选举/罢免程序”（recall election）。因此 pro-recall 与 anti-recall 常成对出现，分别表示支持/反对罢免。"]}
{"word":"proreciprocation","summary":{"en":"“Proreciprocation” is a very rare/nonstandard word meaning support for reciprocity (mutual exchange).","zh":"“proreciprocation”非常少见且偏非标准，意思是“支持互惠/互相回报（互利交换）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare / nonstandard) Support for reciprocation; a pro-reciprocity stance (being in favor of mutual exchange).","zh":"（非常少见／非标准用法）支持“互惠/互相回报”的立场；主张互惠（赞成双方彼此交换、回报）。"},"examples":[{"en":"In negotiations, their proreciprocation approach focused on mutual concessions.","zh":"在谈判中，他们的“支持互惠”做法强调双方都要让步。"},{"en":"The policy was written from a proreciprocation viewpoint: benefits should go both ways.","zh":"该政策从“主张互惠”的角度制定：利益应当是双向的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Describing something that promotes reciprocation; pro-reciprocity.","zh":"（少见）形容促进互惠/互相回报的；主互惠的。"},"examples":[{"en":"They proposed a proreciprocation agreement between the two schools.","zh":"他们提出两所学校之间的一项“促进互惠”的协议。"}]}],"synonyms":["pro-reciprocity","support for reciprocity","reciprocity","mutual exchange"],"phonetic":"/ˌproʊrɪˌsɪprəˈkeɪʃən/","extraExplanation":["“proreciprocation”不是常见词，很多词典里找不到，通常更自然的说法是：\n- “reciprocation”（互相回报、互惠行为）\n- “reciprocity”（互惠、互利关系，更常用、更正式）\n- “pro-reciprocity” 或 “in favor of reciprocity”（支持互惠/主张互惠）\n写作或正式场合建议用上述更标准的表达，以免读者困惑。"]}
{"word":"prorecognition","summary":{"en":"“Prorecognition” is not a standard word; it is most likely a misspelling of “prerecognition,” meaning foreknowledge of future events (often paranormal).","zh":"“prorecognition”不是标准英语词；更可能是“prerecognition”的误拼，指对未来事件的预知（常见于超自然语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “prerecognition”) the supposed ability to know or sense an event before it happens; foreknowledge, especially in paranormal contexts.","zh":"（可能想写：prerecognition）对未来事件的预知能力；（尤指超自然/灵异语境中的）预感、预知。"},"examples":[{"en":"In the novel, the heroine’s prerecognition saves the town from a flood.","zh":"在小说里，女主角的预知能力让小镇躲过了洪水。"},{"en":"Some people describe a strong dream as prerecognition, though there is no scientific proof.","zh":"有些人把强烈的梦称为“预知”，但这并没有科学证据。"}]},{"partOfSpeech":"phrase","definition":{"en":"(As written: “pro recognition”) recognition that is favorable or supportive; praise or approval (informal and uncommon phrasing).","zh":"（按字面：pro recognition）正面的认可；支持性的赞赏/肯定（非正式且不常见的说法）。"},"examples":[{"en":"The campaign focused on pro recognition of nurses’ work.","zh":"这场活动强调对护士工作的正面认可。"},{"en":"She wanted pro recognition, not criticism, after presenting her idea.","zh":"她展示想法后希望得到肯定，而不是批评。"}]}],"synonyms":["prerecognition","foreknowledge","premonition","precognition"],"phonetic":"/ˌpriˌrɛkəɡˈnɪʃən/","extraExplanation":["“prorecognition”不是常见的标准英语拼写。更常见、最接近的词是 **prerecognition**（预知），前缀 **pre-** 表示“在……之前”。","前缀 **pro-** 通常表示“支持、赞成”（如 pro-choice）或“职业的/专业的”（professional 的口语 pro），但 **prorecognition** 作为一个合成词很少见。","如果你想表达“认可/认出”，标准词是 **recognition**；如果想表达“事先识别/提前识别”，更常见说法是 **early recognition** 或 **prior recognition**。"]}
{"word":"proreconciliation","summary":{"en":"Proreconciliation means supporting reconciliation and efforts to restore friendly relations after conflict.","zh":"proreconciliation 指“支持和解的”，强调支持修复冲突后的关系与推动和解的努力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting reconciliation (the process of restoring friendly relations after conflict); favoring policies or actions that bring opposing sides together.","zh":"支持和解的；主张通过政策或行动让对立双方重建友好关系的。"},"examples":[{"en":"The senator took a proreconciliation stance after the election.","zh":"选举后，这位参议员采取了支持和解的立场。"},{"en":"Proreconciliation voices called for dialogue instead of revenge.","zh":"支持和解的声音呼吁对话，而不是报复。"}]}],"synonyms":["pro-reconciliation","conciliatory","peace-seeking","bridge-building"],"phonetic":"/ˌproʊˌrɛkənˌsɪliˈeɪʃən/","extraExplanation":["“proreconciliation”在实际英文中更常见的写法是带连字符的“pro-reconciliation”，意思是“亲/支持……的”。在新闻、政治评论、社会议题（如族群冲突、内战后重建、真相与和解委员会等）语境里更常见。","构词提示：pro- = “支持/赞成”，reconciliation = “和解；调解；（关系）修复”。把它们连在一起，就表示“支持和解的”。"]}
{"word":"prorector","summary":{"en":"A prorector is a senior university leader who assists or acts for the rector/president, often in charge of a particular area.","zh":"prorector 指大学高级管理者，协助或代表校长/校监处理事务，常分管特定领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A senior university administrator who helps lead the institution, often acting on behalf of the rector/president and overseeing a specific area (such as academics, research, or student affairs).","zh":"（大学）副校长；协理校长（高级行政职位，常代表校长/校监处理事务，并分管如教学、科研或学生事务等领域）。"},"examples":[{"en":"She was appointed prorector for academic affairs at the university.","zh":"她被任命为该大学分管教学事务的副校长。"},{"en":"The prorector signed the agreement while the rector was abroad.","zh":"校长出国期间，由副校长代表签署了协议。"}]}],"synonyms":["vice-rector","deputy rector","vice chancellor (in some systems)","provost (often closest in U.S. context)"],"phonetic":"/proʊˈrɛktɚ/","extraExplanation":["“prorector”多见于欧洲及部分采用欧式大学治理结构的国家/地区（如部分北欧、东欧、拉美高校的英文译名）。在美国更常见的对应称呼是“provost”（教务长）或“vice president/vice chancellor”（副校长），具体对应要看学校组织架构。","词源上，“pro-”有“代行、代理”的含义（如“pro tem”），因此“prorector”常带“代校长/代表校长行使职权”的意味。使用时最好结合该校官方英文头衔来翻译与理解。"]}
{"word":"prorectorate","summary":{"en":"The prorectorate is the office or administrative body led by pro-rectors at a university.","zh":"prorectorate 指大学中由副校长（pro-rectors）领导的管理机构或办公室。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of pro-rectors and the office/administration they lead at a university (often responsible for areas like academics, research, or student affairs)","zh":"（大学里的）副校长团队及其负责的管理机构/办公室（常分管教学、科研或学生事务等）"},"examples":[{"en":"The prorectorate oversees academic policy and quality assurance.","zh":"副校长管理机构负责学术政策与质量保障。"},{"en":"She works in the prorectorate for research and innovation.","zh":"她在分管科研与创新的副校长办公室工作。"}]}],"synonyms":["pro-rector's office","vice-rectorate","university administration"],"phonetic":"/ˌproʊˈrɛktərət/","extraExplanation":["该词多见于欧洲（尤其是英式/欧陆）高校语境。在一些学校里，rector 相当于“校长/校监”，pro-rector 则是“副校长/校长助理”；prorectorate 指由这些 pro-rector 组成的领导班子或其行政部门。","写法有时会分开或加连字符，如 pro-rectorate。不同国家/学校的职务名称对应关系不完全一致，翻译时常需结合具体组织架构（如对应中国高校的“分管副校长办公室/校领导办公室”）。"]}
{"word":"proredemption","summary":{"en":"Pro-redemption means supporting redemption (second chances/forgiveness), and more rarely can relate to the redemption of financial securities.","zh":"Pro-redemption 指“支持救赎/改过自新（给第二次机会）”；较少见时也可指与金融证券“赎回”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring redemption—especially the idea that someone can be forgiven, rehabilitated, or given a second chance.","zh":"支持“救赎/改过自新”的；主张给人改正与被宽恕机会的（常用于道德、宗教或刑事司法语境）。"},"examples":[{"en":"Her writing has a strongly pro-redemption message: people can change.","zh":"她的作品带有强烈的“支持救赎”讯息：人是可以改变的。"},{"en":"The program takes a pro-redemption approach to reentry, focusing on growth rather than punishment.","zh":"该项目对重返社会采取“支持改过自新”的立场，更强调成长而不是惩罚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(finance, less common) relating to money or actions used to redeem a bond, share, or other security (often seen as “for redemption” in documents).","zh":"（金融，用法较少）与赎回债券、股份或其他证券有关的；用于赎回的（文件中常写作“for redemption/用于赎回”）。"},"examples":[{"en":"The company set aside funds for redemption of the notes at maturity.","zh":"公司预留资金用于到期时赎回该票据。"},{"en":"Check the prospectus for details on redemption terms and timing.","zh":"请查阅招股说明书了解赎回条款与时间安排。"}]}],"synonyms":["forgiving","rehabilitative","second-chance","pro-forgiveness","(finance) for redemption"],"phonetic":"/ˌproʊ rɪˈdɛmpʃən/","extraExplanation":["“proredemption”本身不算常见标准拼写，更常见的是带连字符的 **pro-redemption**（表示“支持救赎/支持赎回”）。如果你是在特定文章或合同里看到它，也可能只是作者的连写风格。","语境很关键：在人文/影视评论里多指“救赎、宽恕、改过自新”；在金融文本里则更常对应“赎回（redeem securities）”，很多时候直接写 **for redemption** 会更自然。"]}
{"word":"proreduction","summary":{"en":"Proreduction is not a standard word; it is usually an informal label meaning “in favor of reduction,” or it may be a mistake for production or reduction.","zh":"proreduction 不是标准词；多为非正式标签，意为“支持减少/降低”，也可能是把 production 或 reduction 写错/弄混。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard dictionary word; most often used as a made-up or informal label meaning “in favor of reduction” (for example, supporting policies that reduce costs, emissions, harm, or risk).","zh":"不是标准词典词；多用于临时造词或非正式标签，表示“支持减少/降低”（例如支持降低成本、排放、伤害或风险的政策）。"},"examples":[{"en":"The group described its plan as proreduction because it aims to cut carbon emissions.","zh":"该组织称其计划为 proreduction，因为目标是减少碳排放。"},{"en":"She supports a proreduction approach to plastic use in the office.","zh":"她支持在办公室采取减少塑料使用的 proreduction 做法。"}]},{"partOfSpeech":"other","definition":{"en":"Common misspelling or confusion with production (“the making of goods, films, etc.”) or reduction (“the act of making something less”).","zh":"常见的拼写/用词混淆：可能想写 production（生产；制作）或 reduction（减少；降低）。"},"examples":[{"en":"If you meant production: “Film production takes months.”","zh":"如果你想表达 production：“电影制作需要数月。”"},{"en":"If you meant reduction: “A reduction in price helped sales.”","zh":"如果你想表达 reduction：“降价促进了销售。”"}]}],"synonyms":["pro-reduction","in favor of reduction","reduction-focused","supporting cuts","supporting lower emissions"],"phonetic":"/ˌproʊ rɪˈdʌkʃən/","extraExplanation":["“pro-”是英语前缀，常表示“赞成/支持”（如 pro-choice, pro-democracy）。把它和名词 reduction（减少）直接拼在一起写成 proreduction 并不常见；更自然的写法通常是“pro-reduction”（加连字符）或用短语：in favor of reduction / reduction-focused / supportive of reducing…","如果这是你在某篇文章、政策文件或品牌名里看到的词，它可能是作者为了“口号化/标签化”而创造的用法。正式写作中建议改成更常见的表达，以避免读者误解。"]}
{"word":"proreferendum","summary":{"en":"“Pro-referendum” describes someone or something that supports holding a referendum or supports a referendum proposal.","zh":"“pro-referendum”指支持举行公投或支持某项公投提案的立场/人/团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a referendum (a public vote on an important political question).","zh":"支持举行或支持某项公投（就重大政治议题进行的全民投票）的。"},"examples":[{"en":"Pro-referendum groups gathered signatures to trigger a national vote.","zh":"支持公投的团体收集连署，以启动全国投票。"},{"en":"The candidate took a pro-referendum stance on constitutional reform.","zh":"这位候选人在宪政改革议题上采取支持公投的立场。"}]}],"synonyms":["in favor of a referendum","referendum-supporting","pro-plebiscite"],"phonetic":"/ˌproʊ ˌrɛfəˈrɛndəm/","extraExplanation":["“pro-”是英语常见前缀，表示“赞成/支持”（如 pro-democracy 亲民主、pro-choice 支持选择权）。因此 pro-referendum 通常出现在政治新闻或评论中，用来描述“支持公投”的立场或阵营。","在不同国家/地区，referendum 的制度与法律门槛差异很大，所以 pro-referendum 有时也隐含“支持以直接民主方式决定争议议题”的价值取向。"]}
{"word":"proreform","summary":{"en":"Pro-reform means supporting reforms—changes intended to improve a system.","zh":"pro-reform 指“支持改革的”，强调赞成通过改革来改进制度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting political, economic, or social reforms (changes meant to improve a system).","zh":"支持改革的；拥护（政治、经济或社会）改革的（指为了改进制度而进行的改变）。"},"examples":[{"en":"She is a pro-reform candidate who wants to reduce corruption.","zh":"她是一位支持改革的候选人，想要减少腐败。"},{"en":"The pro-reform group called for fairer elections.","zh":"这个拥护改革的团体呼吁更公平的选举。"},{"en":"Pro-reform lawmakers pushed the bill through parliament.","zh":"支持改革的立法者推动法案在议会通过。"}]}],"synonyms":["reform-minded","reformist","progressive (in some contexts)","pro-change"],"phonetic":"/ˌproʊrɪˈfɔrm/","extraExplanation":["这个词通常写作 **pro-reform**（带连字符），也有媒体写作 **proreform**。意思不变，主要是排版风格差异。","**pro-** 是常见前缀，表示“支持、赞成”（如 pro-democracy 亲民主的；pro-choice 支持女性选择权的）。","语境上多用于政治新闻或评论，强调立场（支持改革）而不是具体改革内容。"]}
{"word":"proreformist","summary":{"en":"Proreformist means supporting reform or someone who supports reform, often used in politics.","zh":"proreformist 指“支持改革的”或“改革派”，多用于政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting political, social, or economic reform; favoring changes that improve a system.","zh":"支持改革的；赞成通过改革来改善制度的。"},"examples":[{"en":"The proreformist candidate promised to reduce corruption and simplify taxes.","zh":"这位支持改革的候选人承诺减少腐败并简化税制。"},{"en":"Proreformist voices grew louder after the economic crisis.","zh":"经济危机之后，支持改革的声音变得更强。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that supports reform.","zh":"改革派人士；支持改革的团体或个人。"},"examples":[{"en":"Proreformists in the party pushed for more transparent elections.","zh":"党内的改革派推动更透明的选举。"},{"en":"The government held talks with proreformists and conservatives.","zh":"政府与改革派和保守派进行了会谈。"}]}],"synonyms":["reform-minded","reformist","progressive","pro-change"],"phonetic":"ˌproʊ rɪˈfɔrmɪst","extraExplanation":["“proreformist”常见写法是带连字符的“pro-reformist”，在新闻报道和政治语境中更常用。","构词法：pro-（支持）+ reform（改革）+ -ist（…主义者/…派）。可同时用作形容词（修饰人或立场）和名词（指改革派）。","语气一般偏中性，但在政治报道中可能带有立场色彩，需结合语境判断。"]}
{"word":"prorefugee","summary":{"en":"“Pro-refugee” describes a person, group, or viewpoint that supports refugees and policies that help protect them.","zh":"“Pro-refugee”指支持难民及帮助、保护难民相关政策的人、团体或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting refugees and policies that protect or help them (e.g., asylum, resettlement, access to services).","zh":"支持难民及其保护/援助政策的（例如庇护、安置、获得公共服务）。"},"examples":[{"en":"The group ran a pro-refugee campaign to raise money for legal aid.","zh":"这个团体发起了支持难民的倡议，为法律援助筹款。"},{"en":"She spoke from a pro-refugee perspective, emphasizing safety and human rights.","zh":"她从支持难民的立场发言，强调安全与人权。"},{"en":"The article criticized pro-refugee organizations for being too idealistic.","zh":"这篇文章批评支持难民的组织过于理想化。"}]}],"synonyms":["refugee-supporting","pro-asylum","pro-immigrant (broader)","humanitarian (broader)"],"phonetic":"/ˌproʊ ˈrɛfjudʒiː/","extraExplanation":["“pro-refugee”常作定语（pro-refugee policy/activists/protests）。写作中更常见带连字符的形式“pro-refugee”；不加连字符（pro refugee）较少见。","“pro-”在英语里表示“支持……的/赞成……的”（如 pro-democracy, pro-choice）。它通常带有政治或社会议题的立场色彩；在讨论中尽量区分“支持难民的基本权利/人道援助”与“支持某项具体移民政策”，以避免沟通误解。"]}
{"word":"proregent","summary":{"en":"A proregent is a deputy regent who rules temporarily on behalf of the rightful ruler.","zh":"proregent 指“代理摄政者”，即临时代替合法统治者（或摄政者）行使权力的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person appointed to act as regent (ruler on someone else’s behalf), especially as a deputy or stand-in regent","zh":"（尤指副手性质的）摄政代理人；代行摄政者"},"examples":[{"en":"During the king’s illness, a proregent governed in his name until he recovered.","zh":"国王患病期间，一位摄政代理人以国王名义治理国家，直到他康复。"},{"en":"The council named her proregent to handle state affairs while the heir was still a minor.","zh":"议会任命她为摄政代理人，在继承人尚未成年时处理国政。"}]}],"synonyms":["deputy regent","acting regent","regent (in context)","proxy ruler","viceroy (related)"],"phonetic":"/ˌproʊˈriːdʒənt/","extraExplanation":["“pro-”在英语里常表示“代替、代表、代理”（如 *proconsul* 总督、*proxy* 代理人）。因此 *proregent* 字面意思就是“代理摄政者”。","该词比较少见，历史或文学语境里更常见的相关词是 *regent*（摄政者）与 *viceroy*（总督/总督王，代表君主统治某地）。"]}
{"word":"prorelease","summary":{"en":"Prorelease (more commonly written pro-release) means “in favor of release” and is rare in everyday English; it can also refer to the pro-release side in a debate.","zh":"Prorelease（更常见写法为 pro-release）表示“支持释放/发布”的，日常英语中较少见；也可指辩论中支持释放的一方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) supporting or favoring the release of someone or something (for example, a prisoner, a report, or a product). Often written with a hyphen: pro-release.","zh":"（不常见）支持或赞成“释放/放出/发布（某人或某物）”的；常写作带连字符的 pro-release。"},"examples":[{"en":"The group took a pro-release position on nonviolent offenders.","zh":"该团体对非暴力罪犯采取了支持释放的立场。"},{"en":"Some fans are pro-release and want the studio to publish the deleted scenes.","zh":"一些粉丝支持发布，希望片方放出删减片段。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a person, group, or viewpoint that supports release; shorthand for “pro-release side.”","zh":"（不常见）支持释放的一方/立场；可指支持释放的人或群体。"},"examples":[{"en":"In the debate, the prorelease argued that early release reduces overcrowding.","zh":"在辩论中，支持释放的一方认为提前释放能缓解拥挤问题。"}]}],"synonyms":["pro-release","in favor of release","supporting release","advocating release"],"phonetic":"/ˌproʊ rɪˈliːs/","extraExplanation":["“pro-”在英语里表示“支持/赞成”，如 pro-democracy（支持民主的）。因此 pro-release 通常是临时组合出来的词，用来表达“支持释放/发布”。","写作上更常见的是加连字符的 **pro-release**。如果你想表达“发布前/预发布”，更常用的词是 **prerelease / pre-release**（例如 prerelease version 发布前版本）。如果你能告诉我上下文句子，我也可以帮你判断你要的是哪一个。"]}
{"word":"proreptilia","summary":{"en":"Proreptilia is an older, mostly outdated term for a proposed group of very early primitive reptiles or reptile-like animals.","zh":"Proreptilia是一个较旧、如今多已不用的术语，指曾被提出的非常早期原始爬行动物或类爬行动物的类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in older zoology) a proposed group of very early, primitive reptiles or reptile-like animals; the term is largely obsolete in modern classification.","zh":"（旧式动物学用法）一种曾被提出的分类群，指非常早期、原始的爬行动物或类爬行动物；在现代分类中多已不再使用。"},"examples":[{"en":"Some older textbooks used “Proreptilia” for primitive reptiles close to the first amniotes.","zh":"一些较老的教材会用“Proreptilia”来指接近最早羊膜动物的原始爬行动物。"},{"en":"In many modern sources, Proreptilia is avoided because it does not match current evolutionary classifications.","zh":"在许多现代资料中，人们会避免使用Proreptilia，因为它不符合当前的演化分类方法。"}]}],"synonyms":["primitive reptiles","stem reptiles"],"phonetic":"/ˌproʊrɛpˈtɪliə/","extraExplanation":["“Pro-”有“在……之前/早期”的意思，“reptilia”是“爬行动物”。因此这个词字面上像“早于典型爬行动物的（类群）”。","该词常见于较早的系统分类/教材中；现代生物学更强调“单系群”（共同祖先及其全部后代），因此一些旧名（包括Proreptilia）会被认为不够精确或不再采用。"]}
{"word":"proreptilian","summary":{"en":"Proreptilian means “before/early reptile,” used mainly in evolution and fossil studies.","zh":"proreptilian 意为“早于/早期的爬行动物（或类爬行祖先）”，主要用于演化与古生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, evolutionary) Relating to very early reptiles or to animals that lived before true reptiles and show reptile-like features.","zh":"（生物学/演化）与最早期的爬行动物有关的；或指真正爬行动物出现之前、具有爬行类特征的动物（及其特征）。"},"examples":[{"en":"Some fossils show proreptilian traits, such as a more reptile-like skull.","zh":"一些化石显示出前爬行类（proreptilian）的特征，例如更像爬行动物的头骨结构。"},{"en":"The paper discusses a proreptilian stage in vertebrate evolution.","zh":"这篇论文讨论了脊椎动物演化中的“前爬行类”阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"An organism viewed as a very early reptile or a reptile-like ancestor before true reptiles (informal/technical use).","zh":"（较少见/技术性用法）被视为最早期爬行动物或真正爬行动物之前的“类爬行祖先”的生物。"},"examples":[{"en":"The author calls these animals proreptilians, though the classification is debated.","zh":"作者把这些动物称为前爬行类（proreptilians），但这种分类仍有争议。"}]}],"synonyms":["early reptilian","primitive reptile (context-dependent)","reptile-like ancestor","stem reptile (technical)"],"phonetic":"/ˌproʊrɛpˈtɪliən/","extraExplanation":["词源上可拆为 pro-（“在……之前/早期”）+ reptilian（“爬行动物的”）。因此它常出现在演化与古生物学语境中，用来强调“早于典型爬行动物、但带有爬行类特征”。","这不是日常英语词汇，更常见的写法与近义表达包括: “early reptile(s)（早期爬行动物）”、 “reptile-like ancestor(s)（类爬行祖先）”、以及更学术的 “stem reptile(s)（爬行类干群）”。不同学者对分类标准可能不同。"]}
{"word":"proreption","summary":{"en":"Proprioception is your body’s sense of where it is and how it’s moving without needing to look.","zh":"Proprioception 指身体不靠视觉也能感知自身位置与运动的能力（本体感觉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The body’s ability to sense the position, movement, and balance of its parts without looking (often called “body awareness”).","zh":"本体感觉：身体在不看（不依靠视觉）的情况下，感知各部位位置、运动与平衡的能力（也常说“身体觉察”）。"},"examples":[{"en":"With eyes closed, she could still touch her nose easily because of proprioception.","zh":"即使闭上眼睛，她也能轻松摸到鼻子，这是因为本体感觉。"},{"en":"Yoga and tai chi can improve proprioception and balance.","zh":"瑜伽和太极可以提升本体感觉与平衡能力。"}]}],"synonyms":["body awareness","kinesthetic sense","position sense"],"phonetic":"/ˌproʊpri.oʊˈsɛpʃən/","extraExplanation":["你输入的“proreption”很可能是拼写错误；标准拼写是 **proprioception**。","这个词常用于运动训练、物理治疗与医学语境，比如“踝关节扭伤后本体感觉下降”。","词源来自拉丁语 *proprius*（“自身的”）+ *-ception*（“感觉/感知”），字面意思是“对自身的感知”。"]}
{"word":"prorepublican","summary":{"en":"Pro-Republican means supporting the Republican Party (most commonly in the U.S.), or more generally supporting republican (non-monarchic) government.","zh":"pro-Republican 指支持（最常见为美国）共和党；也可泛指支持共和政体（非君主制）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring the Republican Party (in the U.S.) or its candidates/policies.","zh":"支持（美国）共和党或其候选人/政策的。"},"examples":[{"en":"The newspaper was often described as pro-Republican during election season.","zh":"在选举季，这家报纸常被形容为偏向共和党的。"},{"en":"Her voting record is strongly pro-Republican.","zh":"她的投票记录明显更支持共和党。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more general) supporting a republican form of government (a system without a monarch).","zh":"（较广义）支持共和政体（不由君主统治的制度）的。"},"examples":[{"en":"In the 19th century, some writers argued for pro-Republican reforms.","zh":"在19世纪，一些作家主张推行支持共和政体的改革。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports the Republican Party (or, less commonly, republican government).","zh":"共和党的支持者（较少见：共和政体的支持者）。"},"examples":[{"en":"He is a lifelong pro-Republican and volunteers in local campaigns.","zh":"他一生都支持共和党，并在地方竞选中做志愿者。"}]}],"synonyms":["Republican-leaning","right-leaning (often, context-dependent)","conservative (often, context-dependent)","GOP-friendly (U.S., informal)"],"phonetic":"/ˌproʊ rɪˈpʌblɪkən/","extraExplanation":["拼写上更常见的形式是 **pro-Republican**（带连字符）或 **pro Republican**；在正式写作里也常把 Republican 大写，因为多指美国政党。","在不同国家/地区，“Republican”可能指不同政党或政治立场；如果语境没有明确国家，建议在写作中补充说明（如 “pro-Republican in the U.S.”）。"]}
{"word":"proresearch","summary":{"en":"“Proresearch” is not a standard English word; it’s usually a name/label meaning “professional, pro-level research.”","zh":"“proresearch”不是标准英语词，通常作名称/标签使用，表示“专业级研究/专业研究”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) Used as a name/label meaning “professional research” or “research done at a professional level.”","zh":"（非标准词典词）常用作名称/标签，表示“专业研究”或“以专业水准进行的研究”。"},"examples":[{"en":"Our team uses ProResearch as the internal name for our professional research unit.","zh":"我们团队把 ProResearch 作为专业研究部门的内部名称。"},{"en":"She shared a ProResearch report with clear methods and data.","zh":"她分享了一份 ProResearch 报告，方法和数据都很清晰。"}]},{"partOfSpeech":"other","definition":{"en":"As an adjective-like label: “pro-level” + “research,” describing tools, services, or skills aimed at serious research work.","zh":"作类似形容词的标签：“专业级 + 研究”，用于描述面向严肃研究工作的工具、服务或技能。"},"examples":[{"en":"This database is marketed as a proresearch tool for graduate students.","zh":"这个数据库被宣传为面向研究生的“专业研究”工具。"},{"en":"He wants proresearch training in academic writing and data analysis.","zh":"他想要学术写作和数据分析方面的“专业研究”训练。"}]}],"synonyms":["professional research","rigorous research","academic research","research services"],"phonetic":"/ˌproʊˈriːsɝːtʃ/","extraExplanation":["“proresearch”更常见的写法通常是分开写：pro research / professional research。合并写在英语里往往像品牌名、项目名、用户名或标签（tag）。","发音上一般按 pro + research 来读；正式写作中建议使用 professional research 或 rigorous research 来表达“专业/严谨的研究”。"]}
{"word":"proreservationist","summary":{"en":"A preservationist supports protecting historic, cultural, or natural things from damage or major change.","zh":"preservationist 指主张保护历史、文化或自然事物不被破坏或大幅改变的人（或这种立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports protecting old buildings, historic places, cultural heritage, or the natural environment from damage or change","zh":"主张保护（古建筑、历史遗址、文化遗产或自然环境）的人；保护主义者"},"examples":[{"en":"Local preservationists opposed the plan to tear down the 1920s theater.","zh":"当地的保护主义者反对拆除那座20世纪20年代的剧院。"},{"en":"She is a preservationist who works to save historic neighborhoods.","zh":"她是一名保护主义者，致力于拯救历史街区。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting the protection of historic, cultural, or natural things from being harmed or altered","zh":"支持保护历史、文化或自然事物不被破坏或改变的"},"examples":[{"en":"The group took a preservationist approach to the renovation.","zh":"该团体对这次翻新采取了保护优先的做法。"},{"en":"He holds preservationist views about the city’s architecture.","zh":"他对这座城市的建筑持保护主义观点。"}]}],"synonyms":["conservationist","heritage advocate","historic preservationist"],"phonetic":"/ˌprɛzɚˈveɪʃənɪst/","extraExplanation":["你输入的“proreservationist”更常见的拼写是 **preservationist**；如果你想表达“支持保护的（立场）”，也可以写 **pro-preservationist**（带连字符）。","在环保语境中，**preservationist** 常强调“尽量保持原状、少开发”；而 **conservationist** 通常强调“在可持续管理下使用资源”。两者有重叠，但侧重点不同。"]}
{"word":"proresignation","summary":{"en":"“Pro-resignation” means supporting or calling for someone to resign.","zh":"“Pro-resignation”表示支持或呼吁某人辞职/下台。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring someone’s resignation from a job or position (often used in politics or workplace news).","zh":"支持或赞成某人辞去工作或职务（常用于政治或职场新闻语境）。"},"examples":[{"en":"Several lawmakers took a pro-resignation stance after the scandal.","zh":"丑闻发生后，一些立法者表态支持辞职。"},{"en":"The editorial was openly pro-resignation, arguing the CEO should step down.","zh":"那篇社论公开主张辞职，认为首席执行官应当下台。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint, movement, or message that calls for or endorses resignation.","zh":"主张或呼吁辞职的立场、运动或信息。"},"examples":[{"en":"Pro-resignation messages spread quickly on social media.","zh":"主张辞职的信息在社交媒体上迅速传播。"},{"en":"The protest turned into a pro-resignation rally.","zh":"抗议活动演变成一场要求辞职的集会。"}]}],"synonyms":["in favor of resignation","resignation-supporting","calling for resignation","pro-step-down"],"phonetic":"/ˌproʊ ˌrɛzɪɡˈneɪʃən/","extraExplanation":["“proresignation”更常见的写法是“pro-resignation”（带连字符）或“pro resignation”（分开写）。它由“pro-（支持）+ resignation（辞职/下台）”构成，常用来描述一种立场：认为某人应该辞职。","语体上偏新闻/评论/政治语境；日常口语更常说“in favor of (someone) resigning”或“think (someone) should resign/step down”。","相关表达：“call for someone’s resignation（要求某人辞职）”“demand resignation（要求辞职）”“step down（下台/辞职，较委婉）”。"]}
{"word":"prorestoration","summary":{"en":"“Pro-restoration” means supporting restoration—often the return of an old political order (like a monarchy), or the repair/return of something to its earlier condition.","zh":"“Pro-restoration”指支持“恢复/复原”，常见含义包括支持旧政权（如君主制）回归，或支持把建筑/文物等修复到较早状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring a restoration (the return of a previous system, ruler, or institution, especially a monarchy).","zh":"支持“复辟/复位/恢复旧制度”（常指君主制或旧政权回归）的。"},"examples":[{"en":"Many pro-restoration pamphlets argued for bringing the king back.","zh":"许多亲复辟的小册子主张让国王回归。"},{"en":"He belonged to a pro-restoration faction during the political crisis.","zh":"在那场政治危机中，他属于亲复辟派。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting the restoration or repair of something to its earlier condition (often in conservation, architecture, or art).","zh":"支持把某物修复到较早状态的（常用于文物、建筑或艺术修复）。"},"examples":[{"en":"The committee took a pro-restoration approach to the historic theater.","zh":"委员会对这座历史剧院采取了支持修复的立场。"},{"en":"Her pro-restoration plan focused on using traditional materials.","zh":"她的修复方案倾向使用传统材料。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or viewpoint that supports restoration (either political or physical restoration, depending on context).","zh":"支持复辟/复位/修复的一方、团体或立场（含义取决于语境）。"},"examples":[{"en":"The pro-restoration side gained influence after the negotiations.","zh":"谈判后，支持复辟的一方影响力上升了。"}]}],"synonyms":["pro-restoration","restorationist","pro-monarchy (political context)","in favor of restoration"],"phonetic":"/ˌproʊˌrɛstəˈreɪʃən/","extraExplanation":["“prorestoration”更常见的写法是 **pro-restoration**（加连字符），也常写作 **pro restoration**（分开写）。连字符更常用于把它当作一个形容词来修饰名词（如 pro-restoration movement）。","历史语境里，“Restoration”常特指1660年英国王政复辟（查理二世回归）。因此在英美历史写作中，pro-restoration 往往带有明确的政治含义；在艺术/建筑领域则多指“支持修复、复原”的立场。"]}
{"word":"prorestriction","summary":{"en":"“Prorestriction” means supporting restrictions or stricter rules; it’s informal and less common, often used in debates.","zh":"“prorestriction”表示“支持限制/更严格规则”，较口语、并不常见，多用于议题辩论中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, often used in debates) in favor of restrictions; supporting rules that limit something (for example, movement, speech, trade, or public behavior).","zh":"（非正式，多用于讨论/辩论）支持限制的；赞成用规则来约束或减少某事（如出行、言论、贸易或公共行为）。"},"examples":[{"en":"Some voters are prorestriction because they believe stricter rules improve public safety.","zh":"一些选民支持限制，因为他们认为更严格的规则能提高公共安全。"},{"en":"The article compares prorestriction and anti-restriction views on online content rules.","zh":"这篇文章比较了在网络内容规则上“支持限制”和“反对限制”的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A prorestriction view, policy, or group; the position of supporting restrictions.","zh":"支持限制的立场/政策/群体；“赞成限制”的观点。"},"examples":[{"en":"Prorestriction gained support after the incident.","zh":"事件发生后，支持限制的立场获得了更多支持。"},{"en":"In the meeting, prorestriction argued for tighter licensing rules.","zh":"在会议上，支持限制的一方主张更严格的许可规定。"}]}],"synonyms":["pro-restriction","in favor of restrictions","supporting stricter rules","restrictionist"],"phonetic":"/ˌproʊrɪˈstrɪkʃən/","extraExplanation":["“prorestriction”不是非常标准或常见的词，更像是“pro- + restriction”的临时组合（类似 pro-choice / pro-life）。写作时更常见的表达是：pro-restriction（加连字符）、in favor of restrictions、supporting stricter rules。","使用场景通常出现在政策议题（如公共卫生措施、枪支管制、移民、网络审查等）的对比表达中，常与 anti-restriction / against restrictions 搭配。"]}
{"word":"prorevision","summary":{"en":"“Prorevision” is not standard English; you probably mean “provision” (supply/contract clause) or “revision” (editing/change).","zh":"“prorevision”不是标准英语；你可能想写“provision（供应/条款）”或“revision（修订/修改）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or accidental blend of “provision” (supplying/arrangement) and “revision” (editing/change).","zh":"不是标准英语单词。很可能是“provision（供给/条款/安排）”和“revision（修订/修改）”的拼写错误或误拼混合。"},"examples":[{"en":"I couldn’t find “prorevision” in a dictionary—did you mean “provision” or “revision”?","zh":"我在词典里找不到“prorevision”——你想写的是“provision”还是“revision”？"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “provision”: a supply of something needed, or an arrangement/condition written in a contract or law.","zh":"如果你想表达“provision”：指所需物资的供应；或指合同/法律中的条款、规定。"},"examples":[{"en":"The hotel made provisions for guests with disabilities.","zh":"这家酒店为残障客人做了安排。"},{"en":"The contract includes a provision about late payments.","zh":"合同里有一条关于逾期付款的条款。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “revision”: a change made to improve something, especially writing; or the act of studying again (BrE usage).","zh":"如果你想表达“revision”：指为改进而做的修改（尤指文字）；或指复习（英式英语常用）。"},"examples":[{"en":"Please send me the revised version after one more revision.","zh":"再修改一次后，请把修订版发给我。"},{"en":"I need to do some revision before the exam.","zh":"考试前我需要复习一下。"}]}],"synonyms":["provision","revision","clause","supply","edit","amendment"],"phonetic":"/prəˈvɪʒən/","extraExplanation":["“prorevision”有时会出现在打字或自动纠错造成的文本里，但在正式写作中建议改用你真正想表达的词。","快速判断：和“合同/条款/准备”有关，多半用 provision；和“改稿/修改/修订”有关，多半用 revision。"]}
{"word":"prorevisionist","summary":{"en":"Prorevisionist means supporting revisionism—favoring changes to an accepted doctrine, interpretation, or policy, often in political/ideological debates.","zh":"prorevisionist 指“亲修正主义的”，即支持对既有理论、解释或政策进行修订（常见于政治/意识形态讨论）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting political “revisionism,” meaning favoring changes to an existing official doctrine, historical interpretation, or policy (often used in ideological debates, especially within Marxist/communist contexts).","zh":"支持“修正主义”的；主张对既有官方理论、历史解释或政策进行调整/修订的（常见于意识形态争论，尤见于马克思主义/共产主义语境）。"},"examples":[{"en":"In the debate, the pro-revisionist group argued that the party’s economic policy needed updating.","zh":"在辩论中，亲修正主义派认为党的经济政策需要更新。"},{"en":"Some writers were labeled pro-revisionist because they questioned the traditional interpretation of the revolution.","zh":"一些作家因质疑对革命的传统解读而被贴上“亲修正主义”的标签。"}]}],"synonyms":["pro-revisionist","revisionist (supportive context)","reformist (sometimes)"],"phonetic":"/ˌproʊ rɪˈvɪʒənɪst/","extraExplanation":["“pro-”表示“支持/赞成”。“revisionist/修正主义者”在一般英语里可指“主张修订既有观点的人”，但在冷战及左翼政治讨论中常带强烈立场色彩：一方用它批评对方“背离正统理论”。因此在阅读或写作时，要注意它可能是中性描述，也可能是带批判意味的标签。","拼写上常见两种：prorevisionist 与 pro-revisionist（带连字符更常见、更清晰）。"]}
{"word":"prorevolution","summary":{"en":"Pro-revolution means “supporting a revolution or revolutionary change.”","zh":"pro-revolution 指“支持革命或革命性变革”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a revolution or revolutionary change (often used in political writing).","zh":"支持革命或革命性变革的（常用于政治语境）。"},"examples":[{"en":"Some student groups took a pro-revolution stance during the protests.","zh":"一些学生团体在抗议期间采取了支持革命的立场。"},{"en":"The newspaper was accused of publishing pro-revolution articles.","zh":"这家报纸被指责刊登支持革命的文章。"}]}],"synonyms":["revolutionary","pro-revolutionary","radical (context-dependent)","insurrectionist (stronger/negative in some contexts)"],"phonetic":"/ˌproʊˌrɛvəˈluʃən/","extraExplanation":["“prorevolution”更常见的写法是 **pro-revolution**（带连字符），也会写成 **prorevolutionary**（更明确地表示“亲革命/支持革命者的”）。","前缀 **pro-** 表示“赞成、支持”（如 pro-democracy 亲民主；pro-choice 支持选择权）。因此该词通常出现在新闻报道、历史叙述或政治评论中。","使用时要注意语气：在不同语境里，“pro-revolution”可能是自我认同（正面），也可能是他人指控（负面），取决于说话者立场。"]}
{"word":"prorevolutionary","summary":{"en":"Prorevolutionary describes people, ideas, or actions that support a revolution or revolutionary change.","zh":"prorevolutionary 用来形容支持革命或革命性变革的人、观点或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting a political or social revolution; favoring revolutionary change.","zh":"支持政治或社会革命的；赞成革命性变革的。"},"examples":[{"en":"The newspaper took a prorevolutionary stance during the uprising.","zh":"在起义期间，这家报纸采取了亲革命的立场。"},{"en":"Some students shared prorevolutionary ideas, while others argued for gradual reform.","zh":"一些学生传播亲革命的观点，而另一些人主张渐进式改革。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports a revolution (less common).","zh":"支持革命的人（较少见）。"},"examples":[{"en":"The authorities arrested several prorevolutionaries after the protest.","zh":"抗议之后，当局逮捕了几名亲革命者。"}]}],"synonyms":["revolutionary (supporting change)","radical (in politics)","insurgent (context-dependent)","pro-reform (sometimes, but often milder)"],"phonetic":"/ˌproʊˌrɛvəˈluʃəˌnɛri/","extraExplanation":["“prorevolutionary”常见于政治评论、历史写作中，更常写作带连字符的形式“pro-revolutionary”。其中“pro-”表示“支持/赞成”，如：pro-democracy（亲民主）、pro-choice（支持选择权）。","常见对立词：counterrevolutionary（反革命的/反革命者）、anti-revolutionary（反革命的）。在不同历史语境中，“revolutionary/革命”可能带有强烈价值判断，使用时注意语气与立场表达。"]}
{"word":"prorevolutionist","summary":{"en":"A prorevolutionist is someone who supports a revolution; it can also describe ideas or actions that favor revolution.","zh":"prorevolutionist 指支持革命的人；也可形容支持革命的观点或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or advocates for a revolution, especially major political or social change.","zh":"支持或主张革命（尤其是重大政治或社会变革）的人。"},"examples":[{"en":"Some prorevolutionists argued that peaceful reform had already failed.","zh":"一些支持革命的人认为和平改革已经失败。"},{"en":"The government arrested several prorevolutionists for distributing pamphlets.","zh":"政府以散发传单为由逮捕了几名支持革命的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Supporting or favoring a revolution (used as an adjective, often before a noun).","zh":"支持革命的；赞成革命的（作形容词用，常置于名词前）。"},"examples":[{"en":"He wrote prorevolutionist essays under a pen name.","zh":"他用笔名写过支持革命的文章。"},{"en":"The group’s prorevolutionist message spread quickly online.","zh":"该组织支持革命的主张在网上迅速传播。"}]}],"synonyms":["revolutionary","revolutionist","insurrectionist","radical","pro-revolution"],"phonetic":"/ˌproʊˌrɛvəˈluʃənɪst/","extraExplanation":["“pro-”表示“支持……的”，加在名词前构成复合词（如 pro-democracy 支持民主的）。因此 prorevolutionist = pro- + revolution + -ist（……主义者/拥护者）。","该词并不常见，更常见的表达有 revolutionary（革命的/革命者）, pro-revolution（支持革命的）, revolutionary activist（革命活动者）。在写作中根据语境选择更自然的词会更地道。","注意语气与立场：在不同历史与文化语境中，“revolutionist/革命者”可能是褒义（追求解放与变革）或贬义（被指为颠覆者）。正式写作中可用更中性的 reformer（改革者）或 dissident（异议人士）来降低情绪色彩。"]}
{"word":"prorex","summary":{"en":"Prorex means a viceroy or acting ruler—someone who governs in place of a king.","zh":"Prorex 指“总督/摄政者”，即代替国王行使统治权的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a viceroy; a person who rules in place of a king or sovereign (often used in historical or Latin-based contexts).","zh":"总督；摄政者；代替君主行使统治权的人（多见于历史或拉丁语语境）。"},"examples":[{"en":"In Roman and early modern writing, a prorex governed a territory on behalf of the monarch.","zh":"在罗马及近代早期的著作中，prorex 指代表君主治理领地的人。"},{"en":"After the king’s death, a prorex was appointed until a new ruler was chosen.","zh":"国王去世后，可能会任命一位 prorex，直到选出新统治者。"}]}],"synonyms":["viceroy","regent","governor","deputy ruler"],"phonetic":"/ˈproʊrɛks/","extraExplanation":["该词来自拉丁语：pro-（“代替、代表”）+ rex（“国王”）。因此字面意思就是“代王/代理国王”。在现代英语中非常少见，更常用的对应词是 viceroy（总督/副王）或 regent（摄政）。","如果你原本想输入的是别的词（例如 prox “接近的/代理” 或某个品牌名），告诉我上下文（句子/领域），我可以帮你确认。"]}
{"word":"prorhinal","summary":{"en":"A rare anatomical adjective meaning “in front of the rhinal sulcus,” often used in brain anatomy (e.g., prorhinal cortex).","zh":"较少见的解剖学形容词，指“位于鼻沟（rhinal sulcus）之前的”，常用于脑部解剖（如鼻沟前皮层）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, especially neuroanatomy) Located in front of or relating to the rhinal sulcus (a groove near the olfactory/temporal-limbic region of the brain).","zh":"（解剖学/神经解剖学）位于鼻沟（rhinal sulcus，一条与嗅觉/颞叶边缘系统相关的脑沟）之前的；与鼻沟前部相关的。"},"examples":[{"en":"Researchers measured activity in the prorhinal cortex during an odor-learning task.","zh":"研究人员在气味学习任务中测量了鼻沟前皮层（prorhinal cortex）的活动。"},{"en":"The lesion extended into the prorhinal area but spared the hippocampus.","zh":"病灶延伸到鼻沟前区，但避开了海马。"}]}],"synonyms":["anterior rhinal"],"phonetic":"/proʊˈraɪnəl/","extraExplanation":["“prorhinal”是非常专业、偏学术文献的词，常见搭配有 prorhinal cortex（鼻沟前皮层）、prorhinal area（鼻沟前区）。","词形上：pro- 表示“在……之前/前方”，rhinal 来自与“鼻/嗅觉（rhino-）”相关的词根；但在这里主要是“rhinal sulcus（鼻沟）”这一解剖结构的名称。","如果你是在论文或解剖图谱里看到它，也可能与“perirhinal（鼻周的/嗅周的，常指 perirhinal cortex 嗅周皮层）”并列出现：perirhinal 通常更常见，prorhinal 更强调“位于鼻沟之前的那一部分”。"]}
{"word":"prorhipidoglossomorpha","summary":{"en":"Prorhipidoglossomorpha is a rare taxonomic term for a proposed group of primitive marine gastropods, linked to a rhipidoglossan (“fan-like”) radula.","zh":"Prorhipidoglossomorpha 是一个较罕见的分类学术语，指被提出的一类原始海生腹足类，常与“扇舌型（扇状）齿舌”特征相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A proposed clade/group of primitive marine snails (gastropod mollusks) characterized by a rhipidoglossan-type radula (a “fan-like tongue” with many small teeth).","zh":"（动物学/分类学）一个被提出的原始海生蜗牛（腹足纲软体动物）类群，其典型特征是具有“扇舌型”齿舌（齿舌上有许多细小齿）。"},"examples":[{"en":"Some researchers place certain early gastropod lineages in Prorhipidoglossomorpha based on radula structure.","zh":"一些研究者会依据齿舌结构，将某些早期腹足类支系归入 Prorhipidoglossomorpha。"},{"en":"The paper compares Prorhipidoglossomorpha with other gastropod groups using shell and feeding traits.","zh":"该论文用贝壳与取食特征来比较 Prorhipidoglossomorpha 与其他腹足类类群。"}]}],"synonyms":["rhipidoglossomorphs","Rhipidoglossomorpha (related term)","rhipidoglossan (related adjective)"],"phonetic":"/ˌproʊrɪˌpɪdoʊɡlɔːsoʊˈmɔːrfə/","extraExplanation":["这个词非常少见，更多情况下你会在学术文献里看到更常用的相关术语 **Rhipidoglossomorpha**（扇舌类群）或描述性短语如 *rhipidoglossan radula*（扇舌型齿舌）。","词源上可拆成：*rhipido-*（扇、扇形）+ *glosso-*（舌）+ *-morpha*（形态/类群），强调“齿舌像扇子一样排列很多齿”的特征。","如果这是从文献中抄来的拼写，建议你再核对一次原文：有些资料会出现非常接近但不同的拼写（例如以 **Proto-** 或 **Rhipido-** 开头），在分类学中不同拼写可能对应不同作者或不同层级的类群名称。"]}
{"word":"proritual","summary":{"en":"“Proritual” isn’t a standard word; it’s likely a misspelling or an informal form of “pro-ritual” or “pre-ritual.”","zh":"“proritual”不是标准词，通常是拼写错误或非正式写法，可能指“pro-ritual”或“pre-ritual”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. It looks like a misspelling or a made-up form, often intended to mean “supporting rituals” (pro- + ritual) or “before a ritual” (pre-ritual).","zh":"不是标准英语单词。看起来像拼写错误或临时造词，常见可能想表达“支持仪式的（pro- + ritual）”或“仪式前的（pre-ritual）”。"},"examples":[{"en":"I can’t find “proritual” in a dictionary—did you mean “ritual” or “pre-ritual”?","zh":"我在词典里找不到“proritual”——你是不是想说“ritual（仪式）”或“pre-ritual（仪式前的）”？"},{"en":"In some online posts, people use “pro-ritual” to describe traditions they want to keep.","zh":"在一些网络帖子里，有人用“pro-ritual”来形容他们想保留的传统/仪式。"}]}],"synonyms":["ritual","ceremony","tradition","pre-ritual (contextual)","pro-ritual (informal)"],"phonetic":"/ˌproʊˈrɪtʃuəl/","extraExplanation":["“pro-”作前缀通常表示“支持/赞成”（如 pro-choice, pro-environment）。“pre-”表示“之前”（如 pre-game, pre-meeting）。所以如果你想表达“仪式之前的准备”，更自然的是 pre-ritual；如果想表达“赞成仪式/传统”，可以写成 pro-ritual（带连字符），但这不是常用词，更常见表达是 in favor of rituals / supportive of traditions。","如果你告诉我你看到它的句子或语境（哪篇文章/对话里），我可以帮你判断它到底想表达哪一种意思，并给出更地道的替代表达。"]}
{"word":"proritualistic","summary":{"en":"Pro-ritualistic means supporting or preferring rituals and formal ceremony.","zh":"Pro-ritualistic 指“支持或偏好仪式与正式礼节”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring ritualistic practices; believing that rituals and formal ceremonies are important.","zh":"支持或偏好仪式化做法的；认为仪式与正式礼节很重要的。"},"examples":[{"en":"Some members are pro-ritualistic and want the ceremony to follow every traditional step.","zh":"有些成员偏向仪式化，希望典礼遵循每一个传统步骤。"},{"en":"Her pro-ritualistic attitude shows in the way she insists on formal greetings and set routines.","zh":"她偏好仪式化的态度体现在她坚持正式问候和固定流程上。"}]}],"synonyms":["pro-ceremonial","in favor of ritual","pro-traditional (context-dependent)"],"phonetic":"/ˌproʊˌrɪtʃuəˈlɪstɪk/","extraExplanation":["“proritualistic”并不是非常常见或固定的拼写，更常见的写法是带连字符的 **pro-ritualistic**（pro- 表示“赞成/支持”）。","如果你想表达“过于仪式化、流于形式”，更常用的词是 **overly ritualistic** / **too ritualistic**；如果想表达“仪式之前的”，可能是 **pre-ritual** / **pre-ritualistic**（语境较少见）。"]}
{"word":"prorogate","summary":{"en":"Prorogate means to officially suspend a parliament’s session until a later date, or more generally to postpone something.","zh":"Prorogate 指（尤指议会）正式宣布休会至日后再开会；也可泛指“推迟”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially end (pause) a meeting or session of a parliament or similar body until a later date, without dissolving it or calling an election","zh":"（尤指议会）正式宣布休会/中止会期，延后至日后再开会（但不解散、通常也不触发选举）"},"examples":[{"en":"The prime minister advised the monarch to prorogue Parliament until next month.","zh":"首相建议君主让议会休会到下个月。"},{"en":"The opposition said the government used prorogation to avoid debate.","zh":"反对党称政府利用休会来回避辩论。"}]},{"partOfSpeech":"vt.","definition":{"en":"to postpone or delay something to a later time","zh":"延迟；推迟（到以后）"},"examples":[{"en":"They prorogated the decision until more data was available.","zh":"他们把决定推迟到有更多数据之后再做。"}]}],"synonyms":["suspend","adjourn","recess","postpone","delay"],"phonetic":"/proʊˈroʊɡeɪt/","extraExplanation":["这个词最常见于英联邦政治语境（如英国、加拿大），通常由国家元首（君主或总督）根据政府建议宣布“prorogue Parliament”。与 dissolve（解散议会并引发选举）不同，prorogue 只是结束这一会期，之后会开启新的会期（new session）。","词源来自拉丁语 prorogare，含义与“延长/延期（a term）”有关，所以也引申出一般性的“推迟”。在日常英语里，表示“推迟”更常用 postpone/delay，prorogate 更偏正式、法律/政治用语。"]}
{"word":"prorogation","summary":{"en":"Prorogation is the formal ending of a parliament’s session (without dissolving it), usually to resume later.","zh":"Prorogation 指议会正式休会：结束本会期但不解散，之后通常会再开会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal act of ending (pausing) a session of a parliament or other legislative body without dissolving it, so it will meet again later.","zh":"（议会等立法机构的）休会；正式结束本届会议但不解散，之后还会再开会。"},"examples":[{"en":"The prime minister asked the head of state to approve the prorogation of Parliament.","zh":"首相请求国家元首批准议会休会。"},{"en":"After prorogation, lawmakers will return for a new session with a fresh agenda.","zh":"休会之后，议员将返回开启新的会期并讨论新的议程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, less common) The extension or postponement of a legal deadline or time period.","zh":"（法律，较少用）延期；延长法定期限或时间。"},"examples":[{"en":"The court granted a prorogation of the filing deadline.","zh":"法院批准延长提交期限。"}]}],"synonyms":["adjournment","suspension (of Parliament)","recess (similar, but not identical)","postponement (general)"],"phonetic":"/ˌproʊrəˈɡeɪʃən/","extraExplanation":["“prorogation”常见于英式政治语境（如英国、加拿大等采用议会制的国家）。它与“dissolution（解散）”不同：prorogation 只是结束当前会期，议员席位仍在；解散则通常意味着要举行大选、重新组成议会。","词源上与拉丁语 *prorogare*（延长、延期）有关，所以在法律语境里也可指“延期”。新闻报道中常讨论 prorogation 是否会影响议会监督政府或推动/阻止某些法案。"]}
{"word":"prorogations","summary":{"en":"Prorogations are official suspensions or endings of a parliamentary session (and sometimes other formal postponements).","zh":"prorogations 指对议会会期的正式休会/中止（也可泛指正式延期）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Politics/Law) periods when a parliament, legislative session, or court case is formally ended or suspended until a later date (usually by an authority such as a head of state).","zh":"（政治/法律）指议会会期或某些法律程序被正式结束或中止，并在之后某个日期再恢复（通常由国家元首等权力机关决定）。"},"examples":[{"en":"The prime minister requested prorogations to pause Parliament before the new session began.","zh":"首相请求进行数次议会休会（prorogations），以在新会期开始前暂停议会运作。"},{"en":"Opponents argued the prorogations reduced lawmakers’ time to debate the bill.","zh":"反对者认为这些休会缩短了议员讨论法案的时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(General, less formal) delays or extensions—official acts of postponing something to a later time.","zh":"（一般较不正式用法）延后或延期——指把某事正式推迟到更晚的时间。"},"examples":[{"en":"After several prorogations, the deadline was moved to next month.","zh":"经历了数次延期（prorogations）后，截止日期被推到下个月。"},{"en":"The project suffered repeated prorogations because of budget issues.","zh":"由于预算问题，这个项目一再延期（prorogations）。"}]}],"synonyms":["suspensions","adjournments","postponements","extensions"],"phonetic":"/ˌproʊrəˈɡeɪʃənz/","extraExplanation":["“Prorogation”最常见于英国、加拿大等采用议会制度的国家，指由君主/总督等在政府建议下让议会“休会”。它不同于“recess（例行休会）”：prorogation通常是正式结束一段会期，并会清掉或重置部分议程。","词形提示：prorogations 是复数；单数是 prorogation。相关动词是 prorogue（使休会/使延期）。"]}
{"word":"prorogator","summary":{"en":"A rare term meaning a person who officially postpones or extends something (especially a session or proceeding).","zh":"较少见的词，指正式宣布延期或延长某事的人（尤指会议或程序）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who prorogues (formally postpones or extends something), especially an official who orders a delay or extension.","zh":"宣布延期或延长（某事）的人员；尤指下令使某事正式延期/延长的官员。"},"examples":[{"en":"The prorogator announced that the legislative session would be delayed until next month.","zh":"这位宣布延期的官员宣布本届立法会议将推迟到下个月。"},{"en":"In the story, the prorogator keeps postponing the trial to avoid a final decision.","zh":"在故事里，那个“拖延者”不断推迟审判，以回避最终裁决。"}]}],"synonyms":["postponer","delayer","one who prorogues","official who extends a session"],"phonetic":"/prəˈroʊɡeɪtɚ/","extraExplanation":["“Prorogator”在现代英语里非常少见，多用于法律/历史/正式语境。日常更常用的说法是“the person who prorogues”或直接用动词短语表达（如“official who postponed/extended …”）。","与英国等议会制度相关时，prorogue 指“（君主或政府）宣布议会休会/延会（prorogation）”，因此 prorogator 可指下令或宣布议会延会的一方（在不同体制中可能是君主、总督或政府代表）。","词源上来自拉丁语 prorogare（延长、延期），与 prorogue 同源。"]}
{"word":"prorogue","summary":{"en":"Prorogue means to officially suspend a parliament’s session until a later date, usually by a head of state.","zh":"prorogue 指由国家元首正式宣布议会本届会议休会，推迟到日后再开会。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a head of state) to officially end a session of parliament until the next session begins, without dissolving the parliament or triggering an election.","zh":"（国家元首）正式宣布议会本届会议休会，直到下届会议开始；不等同于解散议会，也通常不会触发选举。"},"examples":[{"en":"The president can prorogue parliament for a short period in some countries.","zh":"在一些国家，总统可以让议会短期休会。"},{"en":"The government asked the monarch to prorogue Parliament before the new legislative agenda was announced.","zh":"政府在公布新的立法议程前，请求君主宣布议会休会。"},{"en":"Critics argued that proroguing the legislature reduced time for debate.","zh":"批评者认为让立法机构休会减少了辩论时间。"}]}],"synonyms":["suspend (a session)","close (a session)","adjourn (less formal/technical, not the same)"],"phonetic":"/proʊˈroʊɡ/","extraExplanation":["“prorogue”常见于英联邦或采用议会制的国家（如英国、加拿大）政治语境。日常生活中不常用，更多出现在新闻、法律与政治评论中。","容易混淆的概念：\n- prorogue（休会）：暂停本届议会会议，之后同一届议会还会再开会。\n- dissolve（解散）：结束这一届议会，通常会举行大选。\n- adjourn（休庭/休会）：议会自行决定短暂休会（常用于日程安排），不一定需要国家元首的正式程序。","词源提示：来自拉丁语“prorogare”，有“延长（期限）”之意，所以核心感觉是“把会议往后延”。"]}
{"word":"prorogued","summary":{"en":"“Prorogued” means formally suspended or postponed (especially of a parliament or official session) until a later date.","zh":"“Prorogued”指（尤指议会或正式会议）被正式宣布休会或延期，暂时中止到以后再继续。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a parliament, court, or official meeting) to discontinue or suspend it formally until a later time; to postpone without ending it completely.","zh":"（指议会、法庭或正式会议）依法/正式宣布休会或延期到以后再开；暂时中止但不彻底结束。"},"examples":[{"en":"The prime minister prorogued Parliament until October.","zh":"首相宣布议会休会，延期到十月再开。"},{"en":"The session was prorogued after a heated debate.","zh":"在一场激烈辩论之后，本次会议被宣布休会。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective/past participle) having been formally suspended or postponed.","zh":"（形容词/过去分词）已被正式宣布休会/延期的；已被正式中止的。"},"examples":[{"en":"With the legislature prorogued, no new bills could be debated.","zh":"议会休会后，新的法案就无法进行辩论。"},{"en":"The prorogued meeting will resume next month.","zh":"延期的会议将于下个月继续召开。"}]}],"synonyms":["suspended","postponed","adjourned","deferred"],"phonetic":"/prəˈroʊɡd/","extraExplanation":["“prorogued”多见于英联邦政治语境（如英国、加拿大、澳大利亚等），常与“Parliament（议会）”搭配。它通常表示由国家元首或其代表（如君主、总督）在政府建议下宣布“休会/延期”，与“dissolved（解散议会，之后通常要大选）”不同：prorogue 是暂停，dissolve 是结束这一届议会。","词源来自拉丁语 pro-（向前）+ rogare（提议/询问），含“把会议推到以后”的意思。","常见相关表达：prorogue Parliament（宣布议会休会）；a prorogation（休会/延期）；adjourn（会议暂时休会，通常更日常、程序性；prorogue 更正式、政治性更强）。"]}
{"word":"proroguer","summary":{"en":"Prorogue means to officially end a parliamentary session until a later date, without dissolving the parliament.","zh":"Prorogue 指正式宣布议会会期休会/暂停至日后再开，但不解散议会。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially discontinue (end) a session of a parliament or other legislature without dissolving it, usually until a later date","zh":"（由国家元首或有权机关）宣布（议会等）休会/暂停会期，但不解散议会，通常改期再开"},"examples":[{"en":"The prime minister asked the head of state to prorogue Parliament until October.","zh":"首相请求国家元首将议会休会至十月。"},{"en":"The opposition argued that the government prorogued the legislature to avoid a difficult vote.","zh":"反对派认为政府宣布议会休会是为了躲避一场棘手的表决。"}]}],"synonyms":["suspend (a session)","adjourn (formal/legislative, sometimes)","discontinue (a session)"],"phonetic":"/proʊˈroʊɡ/","extraExplanation":["“proroguer”不是常见的英语词形；英语通常用动词 **prorogue**（/proʊˈroʊɡ/）。你输入的“proroguer”更像是法语 **proroger**（意为“延期、延长”）的影响。","政治语境里，**prorogue** 不等于 “dissolve” （解散议会并通常触发选举）。prorogue 只是让本次会期结束、议程清空，之后可再开新会期。","词源要点：来自拉丁语 *prorogare*（延长、延期）。在英联邦国家（如英国、加拿大）新闻中较常见。"]}
{"word":"prorogues","summary":{"en":"“Prorogues” means officially ending (and suspending) a parliament’s session, usually by a head of state.","zh":"“prorogues”指（通常由国家元首）正式宣布议会本届会议结束并休会。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a head of state) to officially end a session of a parliament or legislature, stopping its meetings until the next session begins.","zh":"（国家元首）正式宣布议会/立法机关本届会议结束，使其停止开会，直到下届会议开始。"},"examples":[{"en":"The prime minister asked the monarch to prorogue Parliament until next month.","zh":"首相请求君主将议会休会，直到下个月。"},{"en":"The president prorogues the legislature at the end of its annual session.","zh":"总统在年度会议结束时宣布立法机关休会。"}]},{"partOfSpeech":"vt.","definition":{"en":"to postpone or discontinue something formally (less common outside legal or governmental contexts).","zh":"正式延期或中止某事（在法律或政府语境外较少见）。"},"examples":[{"en":"The committee prorogued the hearing to allow more time for review.","zh":"委员会将听证会延期，以便有更多时间审查。"}]}],"synonyms":["suspend","dismiss (a parliament)","end a session","postpone","adjourn (similar, not identical)"],"phonetic":"/prəˈroʊɡ/","extraExplanation":["“prorogue”主要用于英联邦等议会制度语境（如英国、加拿大）。它与“adjourn（休会/暂时散会）”不同：adjourn通常由议会自身决定、是短期暂停；prorogue往往由国家元首（或其代表，如加拿大总督）依照惯例/权力宣布，意味着本届会议结束，未完成的议案可能需要在下届重新提出。","词形提示：你输入的“prorogues”多见于一般现在时第三人称单数（He/She prorogues…），也可能是复数主语（They prorogue…）的拼写形式；原形是 “prorogue”。"]}
{"word":"proroguing","summary":{"en":"Proroguing means officially ending a parliament’s session (without dissolving it), or more generally postponing something.","zh":"proroguing 指正式宣布议会本会期结束并休会（不解散），也可泛指延期、推迟。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of prorogue) ending a session of a parliament or legislature officially, without dissolving it, until a later date.","zh":"（prorogue 的现在分词）正式宣布议会/立法机构本会期结束，但不解散议会，暂停到以后再开会。"},"examples":[{"en":"The prime minister was accused of proroguing Parliament to avoid tough questions.","zh":"首相被指责通过“休会”来回避尖锐质询。"},{"en":"After proroguing the legislature, the government promised a new session with a fresh agenda.","zh":"政府宣布议会休会后，承诺在新会期提出新的议程。"}]},{"partOfSpeech":"v.","definition":{"en":"(More general) postponing or delaying something to a later time.","zh":"（较一般用法）把某事延期、推迟到以后。"},"examples":[{"en":"They kept proroguing the decision until the budget was clearer.","zh":"他们一直把决定往后拖，直到预算更明朗。"}]}],"synonyms":["suspending (a session)","adjourning","postponing","deferring","putting off"],"phonetic":"/proʊˈroʊɡɪŋ/","extraExplanation":["“prorogue / prorogation”主要用于英联邦政治语境（如英国、加拿大）。它与 dissolve（解散议会）不同：prorogue 是结束本会期、暂停开会；dissolve 通常会触发选举。","因为休会会让议会暂停辩论与审议法案，所以在政治新闻里常带有“被用来规避监督/争议”的含义。常见搭配：prorogue Parliament / the legislature；the prorogation of Parliament。"]}
{"word":"proromance","summary":{"en":"Pro-romance means “in favor of romance,” especially romantic relationships or romantic plotlines.","zh":"Pro-romance 指“支持浪漫/恋爱”的，常用于表示偏好恋爱关系或浪漫剧情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or encouraging romance or romantic relationships; favoring romantic storylines or “shipping.”","zh":"支持或鼓励恋爱/浪漫关系的；偏好浪漫情节或“嗑CP”的。"},"examples":[{"en":"Some viewers are strongly pro-romance and want the main characters to end up together.","zh":"有些观众非常偏向恋爱线，希望主角最后在一起。"},{"en":"The author took a pro-romance approach and added more tender scenes.","zh":"作者采取了偏浪漫的写法，加入了更多温柔的情节。"}]},{"partOfSpeech":"n.","definition":{"en":"a pro-romance stance or viewpoint (the belief that romance is a good or important element).","zh":"“支持恋爱/浪漫”的立场或观点（认为恋爱是好的或重要的元素）。"},"examples":[{"en":"Her pro-romance is clear in how she talks about relationships.","zh":"她谈论亲密关系的方式明显体现了她支持浪漫的立场。"}]}],"synonyms":["pro-love","romance-friendly","shipping-friendly","pro-relationship"],"phonetic":"/ˌproʊ roʊˈmæns/","extraExplanation":["“proromance”更常写成 **pro-romance**（带连字符），因为 **pro-** 是前缀，表示“支持、赞成”。在网络讨论、影评、同人圈/粉丝文化里比较常见，用来表达“偏恋爱线/支持官配或CP”。","如果你想表达“支持浪漫主义（Romanticism 文学艺术运动）”，通常说 **pro-Romanticism**；如果你本来想输入的是 **prominence**（显著、重要）或 **performance** 等单词，也可以告诉我你的语境，我来帮你确认。"]}
{"word":"proromantic","summary":{"en":"Pro-romantic means favoring or encouraging romance (and sometimes Romanticism in art).","zh":"Pro-romantic 指“支持/鼓励浪漫爱情”（有时也指偏向艺术文学中的浪漫主义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting, favoring, or encouraging romance or romantic relationships; likely to view romance positively.","zh":"支持、赞成或鼓励浪漫（爱情）与恋爱关系；倾向于正面看待浪漫。"},"examples":[{"en":"Her stories are openly pro-romantic: they celebrate falling in love without cynicism.","zh":"她的故事明显是“支持浪漫”的：歌颂恋爱，不带犬儒。"},{"en":"The film has a pro-romantic tone, even though the characters face real problems.","zh":"这部电影整体基调偏“支持浪漫”，尽管角色也要面对现实问题。"},{"en":"Some people are pro-romantic, while others prefer a more practical approach to relationships.","zh":"有些人偏“支持浪漫”，另一些人则更务实地看待关系。"}]},{"partOfSpeech":"adj.","definition":{"en":"favoring Romantic-era values in art and literature (emotion, imagination, nature), rather than strict realism or rationalism.","zh":"（文学艺术语境）偏向“浪漫主义时期”的价值观（情感、想象、自然），而非严格的现实主义或理性主义。"},"examples":[{"en":"His poetry is pro-romantic, focusing on emotion and wild landscapes.","zh":"他的诗歌带有亲浪漫主义倾向，强调情感与旷野景观。"},{"en":"The critic called the novel pro-romantic because it prioritizes passion over social rules.","zh":"评论家称这部小说“亲浪漫主义”，因为它更重激情而非社会规范。"}]}],"synonyms":["romance-friendly","pro-love","pro-relationship","romantic-minded"],"phonetic":"/ˌproʊ roʊˈmæn.tɪk/","extraExplanation":["“proromantic”更常见的写法是 **pro-romantic**（带连字符），因为 **pro-** 是前缀，表示“支持/赞成”。在日常英语里这个词不算高频，更常用的表达包括 **romantic**, **pro-love**, **pro-relationship**，或直接说 **supports/encourages romance**。","注意区分：**romantic**（浪漫的/爱情的）描述“风格或气质”；**pro-romantic** 则强调“立场/态度”——你是否支持浪漫、是否认可浪漫的重要性。"]}
{"word":"proromanticism","summary":{"en":"Preromanticism is a late-1700s movement that came before Romanticism, stressing emotion, nature, and imagination.","zh":"前浪漫主义是18世纪后期浪漫主义之前的思潮，强调情感、自然与想象力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an artistic and literary movement (mainly in the late 1700s) that came before Romanticism and helped lead to it, emphasizing emotion, nature, imagination, and interest in folk culture and the medieval past","zh":"（主要指18世纪后期的）前浪漫主义：浪漫主义之前的艺术与文学思潮，为浪漫主义铺路，强调情感、自然、想象力，以及对民间文化与中世纪题材的兴趣"},"examples":[{"en":"Preromanticism helped shift literature away from strict rules and toward personal feeling.","zh":"前浪漫主义促使文学从严格的规则转向更强调个人情感。"},{"en":"In preromantic poetry, nature is often shown as powerful and emotionally meaningful.","zh":"在前浪漫主义诗歌中，自然常被写得强大而富有情感意义。"},{"en":"Many scholars connect preromanticism with early Gothic novels and sentimental writing.","zh":"许多学者把前浪漫主义与早期哥特小说和感伤文学联系起来。"}]}],"synonyms":["pre-Romanticism","early Romantic movement","proto-Romanticism"],"phonetic":"/ˌpriˌroʊˈmæntɪˌsɪzəm/","extraExplanation":["“Preromanticism”常见拼写是“pre-Romanticism / preromanticism”。你输入的“proromanticism”在学术写作中较少见，通常会被视为拼写变体或误拼。","它不是一个单一、统一的“学派”，更像是后人用来概括：启蒙时代后期某些作家开始反对过度理性与古典规范，转而强调情感体验、自然崇高感（the sublime）、个人心灵与想象。","在英语文学史里，常会提到与之相关的人物/潮流：感伤主义（sentimentalism）、坟场派诗歌（Graveyard poetry）、早期哥特文学（Gothic fiction），以及对民歌、民间传说的兴趣。"]}
{"word":"proroyal","summary":{"en":"Pro-royal means supporting the monarchy or the royal family.","zh":"proroyal（更常写作 pro-royal）指“支持君主制或王室的；拥王的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the monarchy, a king/queen, or royal authority; royalist.","zh":"支持君主制、国王/女王或王室权威的；拥王的。"},"examples":[{"en":"The newspaper took a pro-royal stance during the constitutional crisis.","zh":"在宪政危机期间，这家报纸采取了拥王立场。"},{"en":"Pro-royal groups organized a rally in support of the king.","zh":"拥王团体组织了一场支持国王的集会。"}]},{"partOfSpeech":"adj.","definition":{"en":"in favor of the royal family or royal traditions (often in debates about national identity or culture).","zh":"赞成王室家族或王室传统的（常见于有关国家认同或文化的讨论）。"},"examples":[{"en":"Her views are strongly pro-royal, especially when it comes to national ceremonies.","zh":"她的观点很拥护王室，尤其在国家仪式方面。"},{"en":"The film was criticized for having a pro-royal message.","zh":"这部电影因带有拥王信息而受到批评。"}]}],"synonyms":["royalist","monarchist","pro-monarchy","pro-monarch"],"phonetic":"/ˌproʊ ˈrɔɪəl/","extraExplanation":["“pro-”是常见前缀，意思是“支持/赞成”。因此 pro-royal 直译就是“支持王室的”。","拼写上常见写法是带连字符的 **pro-royal**；写成一个词 **proroyal** 较少见，通常出现在标题、标签或非正式写法中。","语气可能带立场色彩：在政治语境里，它常与 **anti-royal**（反王室的）对比。"]}
{"word":"proroyalty","summary":{"en":"“Pro-royalty” means supportive of the royal family or the monarchy.","zh":"“Pro-royalty”指支持王室或君主制、立场亲王室。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting the royal family or the monarchy; favoring royal rule or royal interests","zh":"支持王室或君主制的；亲王室的"},"examples":[{"en":"The newspaper took a pro-royalty stance during the coronation.","zh":"在加冕期间，这家报纸采取了亲王室的立场。"},{"en":"Some voters are strongly pro-royalty, while others want to end the monarchy.","zh":"一些选民强烈亲王室，而另一些人希望结束君主制。"}]}],"synonyms":["pro-monarchy","monarchist","royalist"],"phonetic":"/ˌproʊ ˈrɔɪəlti/","extraExplanation":["“pro-royalty”由前缀 pro-（支持、赞成）+ royalty（王室／王权）组成，常见于政治与媒体语境，尤其在讨论英国、泰国、日本等仍保留君主制国家的公共议题时。","它通常带有“立场/倾向”的意味：pro-royalty（亲王室）常与 anti-royalty / republican（反王室／共和派）形成对比。"]}
{"word":"prorrhesis","summary":{"en":"Parrhesia means fearless, frank speech—speaking the truth openly even when it’s risky.","zh":"Parrhesia 指“敢于直言”的坦率表达：即使有风险也公开说真话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) Frank, bold, and honest speech—especially speaking openly even when it may be risky or unpopular.","zh":"（修辞/哲学）直言不讳、坦率而大胆的表达——尤其指在可能有风险或不受欢迎的情况下仍公开说真话。"},"examples":[{"en":"In the meeting, she practiced parrhesia and criticized the plan directly.","zh":"在会议上，她直言不讳，直接批评了这个计划。"},{"en":"Parrhesia can be respected, but it can also offend people who prefer indirect talk.","zh":"直言不讳可能会赢得尊重，但也可能冒犯喜欢含蓄表达的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific act or moment of speaking with fearless openness.","zh":"一次具体的“勇敢直言”的发言/时刻。"},"examples":[{"en":"His parrhesia surprised the audience, but it started an important discussion.","zh":"他的直言让观众很惊讶，但也开启了一场重要的讨论。"}]}],"synonyms":["frankness","candor","outspokenness","plain speaking"],"phonetic":"/pəˈriːziə/","extraExplanation":["你输入的 **prorrhesis** 很可能是拼写误差；常见且接近的词是 **parrhesia**（直言、敢言），源自希腊语，常见于修辞学与哲学讨论。","在西方文化语境里，**parrhesia** 不只是“诚实”，还强调“在权力或压力面前仍敢讲真话”的勇气；学者如福柯（Michel Foucault）讨论过它与伦理、权力关系的联系。"]}
{"word":"prorsa","summary":{"en":"“Prorsa” isn’t a standard English word; it’s likely a misspelling of “prose,” meaning ordinary non-poetic language or writing style.","zh":"“prorsa”不是标准英语词，可能是“prose”的拼写错误；prose指非诗歌的普通语言/散文体及其写作风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “prose”) Ordinary written or spoken language (not poetry), often used for novels, essays, and everyday speech.","zh":"（可能想输入的是：prose）散文体、非诗歌的普通语言；常用于小说、文章和日常表达。"},"examples":[{"en":"She prefers reading prose to poetry.","zh":"比起诗歌，她更喜欢读散文（散文体作品）。"},{"en":"The book is written in clear, simple prose.","zh":"这本书用清晰、朴素的散文体写成。"},{"en":"In everyday conversation, we speak in prose, not verse.","zh":"在日常对话中，我们用的是普通语言（散文体），不是韵文。"}]},{"partOfSpeech":"n.","definition":{"en":"Writing that is clear and direct (using normal sentences rather than poetic lines).","zh":"（文体）以正常句子为主、清晰直接的写作方式（区别于诗行/韵文）。"},"examples":[{"en":"Try to keep your prose concise in an academic essay.","zh":"写学术论文时尽量让你的散文表达简洁。"},{"en":"His prose style is informal and friendly.","zh":"他的散文文风很随和、亲切。"}]}],"synonyms":["nonfiction (context-dependent)","writing","plain language"],"phonetic":"/proʊz/","extraExplanation":["“prorsa”不是常见英语单词，很可能是拼写错误。最接近且常用的是“prose”（散文体/非诗歌语言）。","“prose”常与“poetry/verse（诗歌/韵文）”对比：poetry更强调节奏、押韵、意象；prose更接近日常表达，常见于小说、随笔、新闻与学术写作。","相关词：prosaic（平淡无奇的；缺乏诗意的）。注意：prosaic带有评价色彩，常表示“乏味、不浪漫”。"]}
{"word":"prorsad","summary":{"en":"“prorsad” isn’t a standard English word; it’s likely a misspelling (e.g., “prorated” or “prosaic”).","zh":"“prorsad”不是标准英语单词；很可能是拼写错误（例如“prorated”或“prosaic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/term from another context.","zh":"不是标准英语单词；更可能是拼写错误，或是姓名/专有术语。"},"examples":[{"en":"I couldn’t find “prorsad” in a dictionary—did you mean “prosaic” or “prorated”?","zh":"我在词典里查不到“prorsad”——你想写的是“prosaic（平淡的/散文的）”还是“prorated（按比例分摊的）”吗？"},{"en":"Could you share the sentence where you saw “prorsad”?","zh":"你能把“prorsad”出现的句子发我吗？"}]}],"phonetic":"N/A","extraExplanation":["“prorsad”在常见英英词典中不收录，通常表示拼写有误或是特定圈子用语/人名/品牌名。","如果你是在描述“按比例分摊/按比例计算”，很可能想写的是 prorated（如：a prorated refund 按比例退款）。","如果你想表达“（文章/风格）平淡无奇、像散文一样不华丽”，可能是 prosaic（如：a prosaic explanation 平淡的解释）。","把原句或你想表达的中文意思发来，我可以帮你定位最接近的正确单词。"]}
{"word":"prorsal","summary":{"en":"Prorsal (rare) means “directed forward” or “toward the front,” mainly in technical anatomy/morphology contexts.","zh":"Prorsal（罕见）主要用于解剖/形态学语境，表示“向前的、位于前部的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Directed forward; situated toward the front (especially in anatomy or descriptions of body parts).","zh":"（罕见/专业用语）向前的；位于前部的（尤用于解剖或描述身体部位的方向）。"},"examples":[{"en":"In some older anatomical descriptions, a prorsal process is one that points forward.","zh":"在一些较早的解剖描述中，prorsal process 指“朝前突出的突起”。"},{"en":"The author contrasts the prorsal edge with the rear margin of the structure.","zh":"作者将该结构的 prorsal 边缘与其后缘作对比。"}]}],"synonyms":["anterior","forward","front-facing","rostral (in some contexts)"],"phonetic":"/ˈprɔːrsəl/","extraExplanation":["“prorsal”非常少见，多出现在较旧或非常专业的解剖/形态学文本中。词根上可理解为“pro-（向前）+ -s-（与方向/姿态相关的构词成分）”，整体表示“朝前”。","学习时更常见、也更通用的词通常是 anterior（前部的）、forward-facing（朝前的）或 rostral（向吻端/头部前方的，神经解剖常用）。","也有人把它和 dorsal（背侧的）或 prostral/prorostral（更常见于神经解剖的“吻侧/更靠前”）混淆；如果你是在具体句子里看到它，可以把原句发来，我可以帮你确认作者想表达的方向术语。"]}
{"word":"prorump","summary":{"en":"A rare verb meaning “to burst out suddenly” (or “to cause a sudden outburst”).","zh":"一个罕见动词，意思是“突然爆发”（或“使突然爆发”）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare/archaic) To burst or break out suddenly; to erupt.","zh":"（罕见/古旧）突然爆发；迸发；喷发。"},"examples":[{"en":"Laughter prorumped from the back of the room.","zh":"教室后排突然爆发出笑声。"},{"en":"Anger prorumped into shouting before he could stop himself.","zh":"他还没来得及克制，怒火就爆发成了喊叫。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) To cause something to burst forth; to bring about a sudden outburst.","zh":"（罕见/古旧）使……突然迸发；引发爆发。"},"examples":[{"en":"The rude comment prorumped a storm of complaints.","zh":"那句无礼的话引发了一阵投诉风波。"},{"en":"The news prorumped protests across the city.","zh":"这条消息引发全城抗议爆发。"}]}],"synonyms":["burst out","erupt","break out","flare up","spew forth"],"phonetic":"/proʊˈrʌmp/","extraExplanation":["这个词在现代英语里非常少见，多见于较早期或模仿古典文风的写作。更常用的替代词有：burst out, erupt, break out, flare up。","词源上可理解为 pro-（向前、向外）+ rump（猛冲/破裂的感觉），整体语感像“向外猛地冲破而出”。"]}
{"word":"proruption","summary":{"en":"Proruption means a sudden bursting out or outbreak; it’s a rare word, sometimes used for volcanic eruptions.","zh":"Proruption 指“突然冲出/爆发”，很少见；有时用于描述火山喷发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden breaking out or bursting forth (often used for a sudden appearance, outbreak, or surge).","zh":"突然冲出；迸发；爆发（常指突然出现、疫情/情绪/活动的爆发或激增）。"},"examples":[{"en":"A proruption of cheers erupted when the team scored in the final seconds.","zh":"球队在最后几秒进球时，观众爆发出一阵欢呼。"},{"en":"The news triggered a proruption of anger online.","zh":"这条新闻引发了网络上一阵愤怒的爆发。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology) a sudden volcanic outburst or eruption.","zh":"（地质）火山的突然喷发。"},"examples":[{"en":"Historical records describe a proruption that covered nearby fields with ash.","zh":"史料记载了一次火山突然喷发，火山灰覆盖了附近的田地。"}]}],"synonyms":["eruption","outburst","burst","surge","breakout"],"phonetic":"/proʊˈrʌpʃən/","extraExplanation":["这个词非常少见，很多场合更常用 eruption（喷发/爆发）、outburst（情绪或行为的爆发）、surge（激增）。","词源上可理解为 pro-（向前/向外）+ rupture（破裂）。可把 proruption 记成“向外破裂而冲出”。"]}

