{"word":"prov","summary":{"en":"“prov” is a written abbreviation most often meaning province, provisional, or proverb, depending on context.","zh":"“prov”是书面缩写，常见含义有：省（province）、临时/暂定（provisional）、谚语（proverb），需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “province” (a region of a country).","zh":"“province（省；行政区）”的缩写。"},"examples":[{"en":"BC is a prov. in Canada.","zh":"BC（不列颠哥伦比亚）是加拿大的一个省。"},{"en":"The report compares data by prov. and territory.","zh":"这份报告按省和地区比较数据。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “provisional” (temporary; not final).","zh":"“provisional（临时的；暂定的）”的缩写。"},"examples":[{"en":"These are prov. results and may change.","zh":"这些是暂定结果，可能会变化。"},{"en":"We have a prov. schedule for next week.","zh":"我们有一份下周的临时日程表。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “proverb,” often used in dictionaries or academic notes.","zh":"“proverb（谚语）”的缩写，常见于词典或学术注释中。"},"examples":[{"en":"See Prov. 3:5 for the quote.","zh":"这句引文见《箴言》3:5。"},{"en":"The term appears in several prov. collections.","zh":"这个词出现在几部谚语汇编中。"}]}],"synonyms":["province","provisional","proverb"],"phonetic":"/prɑv/","extraExplanation":["“prov.”最常见于书面语：比如表格、注释、词典条目、政府或学术材料中。口语里一般直接说全称（province / provisional / proverb）。","在引用《圣经·箴言》时，英语里常用“Prov.”表示“Proverbs”（例如：Prov. 3:5）。具体含义通常要看上下文判断。"]}
{"word":"provability","summary":{"en":"Provability means the ability of a statement or claim to be proved true by evidence or logical rules.","zh":"Provability 指一个陈述或主张能够通过证据或逻辑规则被证明为真的“可证明性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or fact of being able to be proved true (shown by evidence or logical reasoning).","zh":"可证明性；能够被证明为真的性质（可用证据或逻辑推理来证明）。"},"examples":[{"en":"The provability of the claim depends on the data we can collect.","zh":"这个说法是否可证明，取决于我们能收集到哪些数据。"},{"en":"In mathematics, we care about whether a statement has provability within a given system of rules.","zh":"在数学里，我们关心一个陈述在某套规则体系内是否具有可证明性。"}]}],"synonyms":["provableness","demonstrability","verifiability"],"phonetic":"/ˌpruːvəˈbɪləti/","extraExplanation":["“provability”常见于数学、逻辑学、哲学与计算机科学语境，强调“能否在某个规则/系统里被严格证明”。日常英语更常用“can be proved / be provable”或“proof”。","词形：prove（证明）→ provable（可证明的）→ provability（可证明性）。也常与“validity（有效性）”“truth（真理/真实性）”区分：一个命题可能“是真的”但在某个形式系统里未必“可证明”。"]}
{"word":"provable","summary":{"en":"Provable means something can be proven true with evidence or logical reasoning.","zh":"Provable 指“可被证明为真”，能用证据或逻辑推导来证明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be shown to be true using evidence, logic, or math; demonstrable.","zh":"可被证明为真的；可用证据、逻辑或数学证明的。"},"examples":[{"en":"In mathematics, the statement is provable from the axioms.","zh":"在数学中，这个命题可以从公理出发被证明。"},{"en":"We need a provable reason for the error, not just a guess.","zh":"我们需要一个可证明的出错原因，而不只是猜测。"},{"en":"The claim is provable if you can provide reliable data.","zh":"如果你能提供可靠数据，这个主张就是可证明的。"}]}],"synonyms":["demonstrable","verifiable","testable","evident (in some contexts)"],"phonetic":"/ˈpruːvəbl/","extraExplanation":["“provable”常见于学术、法律、科技语境，语气比“likely（很可能）”“believable（可信）”更强，强调“能被证明”。","常见搭配：provable fact（可证明的事实）、provable claim（可证明的主张）、provable beyond doubt（无可置疑地可证明；法律语境里更常见的是 beyond a reasonable doubt）。","近义词细微区别：demonstrable（可演示/可证明，偏“展示出来”）、verifiable（可核实，强调“可通过检查验证”）、proven（已被证明的，强调结果已成立）。"]}
{"word":"provableness","summary":{"en":"Provableness means the quality of being provable—able to be shown true with evidence or reasoning.","zh":"Provableness 指“可证明性”，即某事能否通过证据或推理被证明为真。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being provable; how able something is to be shown true with evidence or logic","zh":"可证明性；（某事）能够被证据或逻辑证明为真的程度"},"examples":[{"en":"The provableness of the claim depends on the data we can collect.","zh":"这个说法的可证明性取决于我们能收集到的数据。"},{"en":"In math class, we focused on the provableness of each step in the argument.","zh":"在数学课上，我们强调论证中每一步的可证明性。"}]}],"synonyms":["provability","verifiability","demonstrability"],"phonetic":"/ˈpruːvəbəlnəs/","extraExplanation":["“provableness”在现代英语中比较少见，更常用的对应词是“provability”（尤其在数学、逻辑、计算机科学语境中）或更通用的“verifiability”（可核验性/可验证性）。","构词上：prove（证明）+ -able（可……的）+ -ness（……的性质），字面意思就是“可被证明这件事的性质”。"]}
{"word":"provably","summary":{"en":"“Provably” means “in a way that can be proven with evidence or logic,” often used in formal or academic contexts.","zh":"“provably”表示“以可证明的方式（有证据或逻辑可证）”，常用于正式或学术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be proven; with proof that is possible to show logically or with evidence.","zh":"以可证明的方式；能够通过逻辑或证据证明地。"},"examples":[{"en":"This algorithm is provably correct under these assumptions.","zh":"在这些假设下，这个算法在逻辑上是可证明正确的。"},{"en":"The medicine is provably effective in large clinical trials.","zh":"这种药物在大规模临床试验中被证明是有效的。"},{"en":"He is provably innocent based on the video evidence.","zh":"根据视频证据，他可以被证明是无辜的。"}]}],"synonyms":["demonstrably","verifiably","evidently (less formal/less strict)"],"phonetic":"/ˈpruːvəbli/","extraExplanation":["“provably”常见于学术写作、法律、数学和计算机科学中，语气比“clearly / definitely”更严谨，强调“有可检验的证明”。","常见搭配：provably true/false（可证真/可证伪）、provably correct（可证明正确）、provably safe（可证明安全）、provably innocent（可证明无罪）、provably better（可证明更好）。","注意区分：provably（可证明地）≠ probably（很可能）。两者拼写相近但意义差别很大。"]}
{"word":"provaccination","summary":{"en":"Pro-vaccination means supporting vaccines and vaccination.","zh":"pro-vaccination 表示“支持疫苗与疫苗接种”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting vaccination; in favor of vaccines and vaccination policies.","zh":"支持疫苗接种的；赞成疫苗与接种政策的。"},"examples":[{"en":"She is strongly pro-vaccination and encourages her community to get vaccinated.","zh":"她坚定支持疫苗接种，并鼓励社区居民去接种。"},{"en":"The clinic shared pro-vaccination information to address common myths.","zh":"诊所分享了支持接种的科普信息，以回应常见误解。"}]}],"synonyms":["pro-vaccine","in favor of vaccination","supportive of vaccination"],"phonetic":"/ˌproʊˌvæk.səˈneɪ.ʃən/","extraExplanation":["拼写与书写：更常见的写法是带连字符的“pro-vaccination”。不加连字符写成“provaccination”也能被理解，但在正式写作（新闻、论文、政策文件）中通常建议用连字符。","语体与语境：该词常用于公共卫生、政策讨论和社交媒体表达立场，例如“pro-vaccination campaign/stance/message（支持接种的活动/立场/信息）”。","构词法提示：“pro-”表示“支持、赞成”，类似还有“pro-choice（支持选择权的）”“pro-environment（支持环保的）”。"]}
{"word":"provaccine","summary":{"en":"“Pro-vaccine” means supporting vaccines and vaccination; it’s most often used as an adjective.","zh":"“Pro-vaccine”指支持疫苗与疫苗接种；最常用作形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting vaccines or vaccination; in favor of using vaccines to prevent disease.","zh":"支持疫苗或疫苗接种的；赞成用疫苗预防疾病的。"},"examples":[{"en":"She is pro-vaccine and encourages her family to get their shots on time.","zh":"她支持疫苗，并鼓励家人按时接种。"},{"en":"The clinic shared pro-vaccine information to address common fears.","zh":"诊所分享了支持疫苗的资讯，以回应常见的担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports vaccines or vaccination (less common than “pro-vaccine advocate” or “vaccine supporter”).","zh":"支持疫苗或疫苗接种的人（不如“pro-vaccine advocate/支持疫苗者”常用）。"},"examples":[{"en":"In the debate, several pro-vaccines spoke about protecting infants and older adults.","zh":"在辩论中，几位支持疫苗的人谈到保护婴儿和老年人。"},{"en":"He describes himself as a pro-vaccine but also asks careful questions about safety.","zh":"他称自己支持疫苗，但也会认真询问安全性问题。"}]}],"synonyms":["pro-vaccination","in favor of vaccination","vaccine-supporting","vaccine-positive","supports immunization"],"phonetic":"/proʊ ˈvæk.sin/","extraExplanation":["这个词更常写作“pro-vaccine”（带连字符），也会写作“pro vaccine”。在新闻与社交媒体中常用于对比“anti-vaccine/anti-vax（反疫苗）”。","语气上，“pro-vaccine”通常是立场描述；若想更中性或更正式，可以用“supports vaccination（支持接种）”“in favor of vaccination（赞成接种）”。","名词用法较少见；表达“支持疫苗的人”更自然的说法包括“pro-vaccine advocate”“vaccine supporter”。"]}
{"word":"provaccinist","summary":{"en":"A provaccinist is someone who supports vaccination.","zh":"provaccinist 指支持疫苗接种的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports vaccination and encourages its use to prevent disease","zh":"支持疫苗接种、并鼓励用疫苗预防疾病的人；亲疫苗者"},"examples":[{"en":"She is a provaccinist who reminds her family to get their flu shots every year.","zh":"她是个亲疫苗者，每年都会提醒家人去打流感疫苗。"},{"en":"Provaccinists say vaccines save lives and protect vulnerable people in the community.","zh":"亲疫苗者认为疫苗能挽救生命，并保护社区中的脆弱人群。"}]}],"synonyms":["vaccine advocate","pro-vaccination supporter"],"phonetic":"/ˌproʊˈvæk.sə.nɪst/","extraExplanation":["这个词常见写法是带连字符的“pro-vaccinist”，也有人写作“provaccinist”。它通常出现在公共卫生、新闻评论或社交媒体讨论中，带有立场色彩；在较正式的学术写作里，更常用“vaccine advocate（疫苗倡导者）”或“pro-vaccination（支持接种的）”。","注意区分：provaccinist（支持接种的人） vs. pro-vaccination（支持接种的立场/形容词用法） vs. vaccination（接种行为/过程）。"]}
{"word":"provand","summary":{"en":"Provand is an old/rare word meaning rations or provisions (and more rarely, an allowance of support, sometimes linked to the church).","zh":"Provand 是较古/少见的词，主要指口粮、给养（更罕见时指供养津贴，偶与教会俸禄相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"food, provisions, or supplies (especially rations given to soldiers, prisoners, or people in an institution); an allowance of food.","zh":"（尤指发给士兵、囚犯或机构人员的）口粮；给养；食物与补给。"},"examples":[{"en":"The captain ordered extra provand for the crew before the long voyage.","zh":"船长在长途航行前下令给船员增加口粮。"},{"en":"In the old records, prisoners received bread as their daily provand.","zh":"在旧档案中，囚犯每天的口粮是一份面包。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) a fixed allowance or income for support, especially connected with a church office; a prebend.","zh":"（罕见/古义）用于供养的定额津贴或收入；（与教会职务相关的）俸禄、圣职俸金。"},"examples":[{"en":"He lived on a small provand granted by the church.","zh":"他靠教会发放的一小笔俸禄生活。"}]}],"synonyms":["provisions","rations","supplies","victuals","food allowance"],"phonetic":"/ˈprɑvənd/","extraExplanation":["“provand”在现代英语中很少见，常出现在历史记载、古文或方言语境里；日常更常用的是“provisions / rations / supplies”。","词源与古法语 *provende*（供给、口粮）有关，也与现代词“provisions（给养）”同源。"]}
{"word":"provant","summary":{"en":"Provant is an archaic word meaning food or supplies—especially rations or provisions.","zh":"provant 是一个较古老的词，指食物或补给品，尤其是口粮或给养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) Food or supplies, especially rations or provisions for a journey, an army, or a household.","zh":"（古语）食物或补给品；尤指旅途中、军队或家庭的口粮／给养。"},"examples":[{"en":"The soldiers received their provant before marching at dawn.","zh":"士兵们在黎明出发前领到了口粮。"},{"en":"They packed dried meat and bread as provant for the long trip.","zh":"他们把风干肉和面包当作长途旅行的干粮。"}]}],"synonyms":["provisions","supplies","rations","victuals"],"phonetic":"/ˈproʊvənt/","extraExplanation":["“provant”在现代英语中很少使用，多见于历史文献或仿古写作里，意思接近“provisions / rations（补给、口粮）”。","词源上与“provide（供给）/ provision（供给物）”同源，读到它时可以把它理解为“供给物、干粮”。","在当代写作中通常用“provisions, supplies, rations”来替代，更自然、更常见。"]}
{"word":"provascular","summary":{"en":"Provascular describes early, developing plant vascular tissue—the precursor to xylem and phloem.","zh":"Provascular 指植物早期正在发育的维管前体组织，即将分化为木质部与韧皮部的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially botany) Relating to the earliest, developing vascular tissue (the precursor of xylem and phloem) in a plant organ.","zh":"（生物学，尤指植物学）与植物器官中最早形成、正在发育的维管组织有关的；指木质部与韧皮部的前体组织。"},"examples":[{"en":"Scientists tracked provascular cells to understand how leaf veins form.","zh":"科学家追踪原维管细胞，以了解叶脉是如何形成的。"},{"en":"In the young root, provascular tissue appears before the xylem and phloem fully differentiate.","zh":"在幼根中，原维管组织会在木质部和韧皮部分化完成之前出现。"}]}],"synonyms":["prevascular","vascular precursor","early vascular (tissue)"],"phonetic":"/proʊˈvæskjələr/","extraExplanation":["“Pro-”常表示“在……之前/早期的”，因此 provascular 的核心含义是“维管组织形成之前或早期阶段的”。它多见于植物发育与解剖学论文（如讨论叶脉、根、茎的维管分化过程）。","学习时可与 vascular（维管的）对比：vascular 描述成熟的输导系统；provascular 强调“尚未完全分化、处于前体阶段”的组织或细胞。"]}
{"word":"prove","summary":{"en":"“Prove” most often means to show something is true with evidence, or to show your ability; it can also mean to turn out to be true over time (“prove to be”).","zh":"prove 常指“用证据证明为真”，也可指“证明自己的能力/价值”；还可表示“结果证明是……”（prove to be）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to show that something is true by giving evidence or a convincing argument","zh":"通过证据或有说服力的论证来证明某事是真的"},"examples":[{"en":"Can you prove that the document is real?","zh":"你能证明这份文件是真的吗？"},{"en":"The data proved his theory wrong.","zh":"数据证明他的理论是错的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to show your ability or worth through actions; to demonstrate that you are capable or good enough","zh":"用行动证明自己的能力或价值；证明自己够好/做得到"},"examples":[{"en":"She worked hard to prove herself at her new job.","zh":"她努力工作来在新工作中证明自己。"},{"en":"You don’t need to prove anything to anyone.","zh":"你不需要向任何人证明什么。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a person or thing) to turn out to be; to be shown to be true after time or experience","zh":"（人或事物）结果是；后来被证明是（某种情况）"},"examples":[{"en":"The plan proved to be too expensive.","zh":"结果证明这个计划太贵了。"},{"en":"He proved unreliable in a crisis.","zh":"在危机中他被证明并不可靠。"}]}],"synonyms":["demonstrate","show","verify","establish","confirm"],"phonetic":"/pruv/","extraExplanation":["常见搭配：prove (that) + 从句（证明……）；prove + 名词/代词（证明某事/某人）；prove to be + 形容词/名词（结果证明是……）。","相关词：proof（n. 证据、证明）；proven（adj. 已被证明的，如 a proven method）。"]}
{"word":"provect","summary":{"en":"Provect means “advanced,” especially advanced in age; it can also mean mature or far progressed.","zh":"provect 指“进展很深的”，最常见是“年事已高的”；也可指“成熟的、发展到后期的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"advanced in age; elderly (often used in formal or literary writing).","zh":"年事已高的；上了年纪的（多用于正式或文学语境）。"},"examples":[{"en":"A provect gentleman sat by the window, reading in the afternoon light.","zh":"一位年事已高的绅士坐在窗边，在午后的光线里读书。"},{"en":"The village still remembers her provect years, when she told stories to the children.","zh":"村里仍记得她年事已高的那些年，她常给孩子们讲故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"well advanced in development; mature or far progressed (less common).","zh":"发展到很成熟阶段的；进展很深的（较少见）。"},"examples":[{"en":"After months of work, the project was in a provect stage.","zh":"经过数月的工作，这个项目已进入相当成熟的阶段。"}]}],"synonyms":["elderly","aged","advanced in years","mature","well-developed"],"phonetic":"/prəˈvɛkt/","extraExplanation":["“provect”比较少见，常见于较旧或较正式的英文；日常表达更常用 elderly, aged, advanced in age。","词源来自拉丁语 provectus（意为“向前推进、进展”），所以既可指“年岁进展”（年纪大），也可引申为“进展很深/成熟”。"]}
{"word":"provection","summary":{"en":"Provection is a rare noun meaning forward transport or movement, mostly used in scientific contexts.","zh":"Provection 是个少见名词，主要在科学语境中指“向前运输/移动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) forward carrying or movement of something; transport in a forward direction.","zh":"（不常用）向前的携带或移动；向前运输。"},"examples":[{"en":"In some scientific writing, “provection” describes the forward movement of particles by a flow.","zh":"在一些科学写作中，“provection”用来描述颗粒被流体带动向前移动。"},{"en":"The paper contrasts diffusion with provection to explain how a substance spreads.","zh":"论文将扩散与 provection 作对比，解释物质如何扩散开来。"}]}],"synonyms":["transport","carrying forward","forward movement"],"phonetic":"/prəˈvɛkʃən/","extraExplanation":["“Provection”在现代日常英语里非常少见，主要出现在某些专业语境（如流体、传输过程的描述）中。","学习与使用时要注意它常被误写或误读成更常见的词：protection（保护）、projection（投射/预测）、provocation（挑衅/激怒）。如果你是在作业或邮件里看到“provection”，很可能需要根据上下文确认是否拼写错误。","相关概念：advection 常用来指“平流/随流输送”（更常见）；convection 指“对流”（机制不同）。"]}
{"word":"proved","summary":{"en":"“Proved” is the past tense/past participle of “prove,” meaning “show something is true” or “demonstrate ability.” It can also (less commonly) mean “tested/verified,” like “proven.”","zh":"“proved”是“prove”的过去式/过去分词，常表示“证明某事为真”或“证明自己有能力”。也可（较少见）表示“经检验/被证实的”，类似“proven”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “prove”: to show that something is true with evidence or facts","zh":"“prove”的过去式和过去分词：用证据或事实证明某事为真"},"examples":[{"en":"She proved her point with clear data.","zh":"她用清晰的数据证明了自己的观点。"},{"en":"The test proved that the water was unsafe.","zh":"检测证明这水不安全。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “prove”: to show (yourself) to be able or good at something; to demonstrate through results","zh":"“prove”的过去式和过去分词：通过结果证明（自己）有能力或擅长某事"},"examples":[{"en":"He proved himself to be a reliable leader.","zh":"他证明了自己是一位可靠的领导者。"},{"en":"The team proved they could win under pressure.","zh":"这支队伍证明了他们能在压力下取胜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) tested or verified; shown to be true or effective (similar to “proven”)","zh":"（较少见）经过检验的；被证实有效/属实的（类似“proven”）"},"examples":[{"en":"This method has proved results in many schools.","zh":"这种方法在许多学校里都取得了经验证的效果。"}]}],"synonyms":["demonstrated","shown","verified","confirmed","established"],"phonetic":"/pruvd/","extraExplanation":["“proved”和“proven”都可作“prove”的过去分词。美式英语里两者都常见，但：\n- “has proved”更常用于动作/结论（已经证明……）。\n- “a proven method”更常用于形容词，表示“经验证的/被证实有效的”。\n在英式英语中，“proved”作过去分词更常见。"]}
{"word":"proveditor","summary":{"en":"“proveditor” usually means a professional editor, or the name of an advanced editing tool (“Pro Editor”) in software.","zh":"“proveditor”通常指“专业编辑”，也可能是软件里的高级编辑工具/模式名（Pro Editor）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a professional editor; someone whose job is to edit writing, video, audio, or other content at a high level","zh":"专业编辑；以高水平编辑文字、视频、音频等内容为职业的人"},"examples":[{"en":"We hired a pro editor to polish the manuscript before publication.","zh":"我们请了一位专业编辑在出版前润色这本手稿。"},{"en":"As a pro editor, she can spot unclear sentences quickly.","zh":"作为专业编辑，她能很快发现句子不清楚的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"a “Pro Editor” tool or feature name (often in apps/software), meaning an advanced editing mode designed for experienced users","zh":"“Pro Editor（专业编辑器）”工具/功能名（常见于软件/应用），指面向熟练用户的高级编辑模式"},"examples":[{"en":"Open Pro Editor to adjust color and contrast more precisely.","zh":"打开 Pro Editor 来更精确地调整颜色和对比度。"},{"en":"The Pro Editor offers more controls than the basic editor.","zh":"Pro Editor 提供的控制选项比基础编辑器更多。"}]}],"synonyms":["professional editor","editor","advanced editor","pro-level editor"],"phonetic":"/ˌproʊˈɛdɪtər/","extraExplanation":["“proveditor”并不是一个非常固定的标准英语单词，更常见的写法是分开写或首字母大写：pro editor / Pro Editor。","在口语或营销文案里，pro 常表示“专业级的（professional-level）”。如果你是在某个软件里看到它，多半是功能名称；如果是在招聘或团队介绍里看到它，多半指“专业编辑”。"]}
{"word":"proveditore","summary":{"en":"Proveditore is a historical Italian term (often a variant of provveditore) meaning an appointed commissioner/supervisor or administrator, especially in Venetian contexts.","zh":"proveditore 是历史性的意大利语用词（常为 provveditore 的变体/拼写），指受任命的专员、监督官或行政官，尤见于威尼斯相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian, historical) An appointed official or commissioner—often a supervisor/administrator in charge of a city, territory, supplies, or public works (especially in the Venetian Republic).","zh":"（意大利语，历史用语）受任命的官员/专员，常指负责城市、领地、军需补给或公共事务的监督与行政官（尤见于威尼斯共和国时期）。"},"examples":[{"en":"In Venetian records, a provveditore might be sent to govern a coastal town.","zh":"在威尼斯的历史档案中，provveditore 可能被派去治理某个海岸城镇。"},{"en":"The provveditore inspected supplies and reported back to the central government.","zh":"这位 provveditore 负责检查军需补给，并向中央政府汇报。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, variant/misspelling) Often used to mean the same as Italian provveditore (“superintendent/commissioner”).","zh":"（较少见，变体/拼写误差）常被用来表达与意大利语 provveditore 相同的意思（“监督官/专员”）。"},"examples":[{"en":"The document spells it as proveditore, but the role described matches provveditore.","zh":"文件里写作 proveditore，但其职务描述与 provveditore 相符。"}]}],"synonyms":["commissioner","superintendent","administrator","governor","official"],"phonetic":"/proʊˌvɛdiˈtɔːreɪ/","extraExplanation":["“Proveditore”在意大利语里更常见的标准拼写是“provveditore”。你可能在历史、法律或档案语境中见到它，尤其与威尼斯共和国的行政体系有关。","词源上与意大利语动词“provvedere”（安排、供给、照料）相关，因此该职位常带有“负责供应/管理/监督”的含义。"]}
{"word":"provedly","summary":{"en":"“Provedly” means “in a proven way; demonstrably,” but it’s uncommon—“provably/demonstrably” are more natural choices.","zh":"“provedly”意为“已被证明地、可证实地”，但较少见；更自然的说法通常是“provably / demonstrably”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has been proven or shown to be true; demonstrably.","zh":"以已经被证明为真的方式；可证实地。"},"examples":[{"en":"This method is provedly effective for beginners.","zh":"这种方法已被证明对初学者有效。"},{"en":"The drug is provedly safe when taken as directed.","zh":"按说明服用时，这种药已被证明是安全的。"}]}],"synonyms":["provably","demonstrably","verifiably","evidently"],"phonetic":"/ˈpruːvɪdli/","extraExplanation":["“provedly”比较少见，更常用的是“provably”或“demonstrably”。在正式写作中，如果你想表达“可被证明地/确凿地”，通常建议用更常见的词来避免显得生硬或不自然。","词形上，“provedly”来自动词“prove（证明）”的过去式/过去分词“proved”加副词后缀“-ly”。但因为英语里更习惯用“provably（可证明地）”，所以“provedly”在语料中出现频率较低。"]}
{"word":"provedor","summary":{"en":"“Provedor” is usually not an English spelling; the English word is “provider,” meaning a supplier of services/goods or someone who supports a family.","zh":"“provedor”通常不是英语拼写；对应的英语是“provider”，指服务/商品的供应商或家庭的供养者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that supplies something (such as goods, services, or information)","zh":"提供者；供应商（提供商品、服务或信息的人或机构）"},"examples":[{"en":"The company is a provider of cloud storage services.","zh":"这家公司是云存储服务的提供商。"},{"en":"We changed our internet provider to get a faster connection.","zh":"我们更换了网络服务提供商来获得更快的网速。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who provides money, support, or care, especially for a family","zh":"供养者；养家者（为家庭提供经济支持或照料的人）"},"examples":[{"en":"She is the main provider for her children.","zh":"她是孩子们的主要供养者。"},{"en":"He worked two jobs to be a reliable provider.","zh":"他做两份工作来成为可靠的养家者。"}]}],"synonyms":["supplier","vendor","service provider","purveyor","caretaker"],"phonetic":"/prəˈvaɪdər/","extraExplanation":["“provedor”本身不是常见英语拼写，更常见于葡萄牙语（以及与之相近的用法）。在英语里对应的词通常是 **provider**；在西班牙语里常见对应是 **proveedor**（多一个 e）。如果你是在写英文简历、合同或技术文档，建议用 **provider**。"]}
{"word":"provedore","summary":{"en":"“Provedore” isn’t standard English; it’s usually meant to be “purveyor” (a supplier/provider).","zh":"“provedore”不是标准英语，通常是想写“purveyor”（供应商/提供者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) Often a misspelling of “purveyor,” meaning a person or company that supplies goods or services (sometimes with the idea of supplying something specific, like food, art, or information).","zh":"（不是标准英语单词）常见为“purveyor”的误拼，指提供/供应商品或服务的人或公司（有时带有“专门供应某类东西”的感觉，如食品、艺术或信息）。"},"examples":[{"en":"The company is a purveyor of organic coffee to local cafés.","zh":"这家公司是本地咖啡馆的有机咖啡供应商。"},{"en":"Some critics called the website a purveyor of misinformation.","zh":"一些批评者称该网站是虚假信息的传播者/提供者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/extended use) A seller or dealer, especially one who provides goods to the public.","zh":"（较少见的引申）售卖者、经销商，尤指向大众提供商品的人。"},"examples":[{"en":"Street vendors once served as purveyors of snacks near the station.","zh":"过去车站附近的小贩常常是零食的售卖者。"}]}],"synonyms":["supplier","provider","vendor","distributor"],"phonetic":"/pərˈveɪər/","extraExplanation":["“provedore”也可能受到其他语言影响而拼出来：\n- 西班牙语/葡萄牙语“proveedor”= 供应商\n- 意大利语“provveditore”= 供给者/管理员（较正式）\n如果你是在合同、采购或供应链语境里看到的，英文里更常用 supplier / vendor / provider。"]}
{"word":"proven","summary":{"en":"“Proven” means tested and shown to be true or effective; it’s also a common past participle of “prove” in American English.","zh":"“Proven”表示“经过验证、被证实真实或有效”；在美式英语中也常作为“prove”的过去分词使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Known to be true or effective because it has been tested, shown, or demonstrated.","zh":"因经过检验、证实而被认为真实或有效的；有验证依据的。"},"examples":[{"en":"This is a proven method for learning vocabulary faster.","zh":"这是一个经过验证、能更快学词汇的方法。"},{"en":"The vaccine is proven safe and effective.","zh":"该疫苗已被证实是安全且有效的。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “prove”: to show something is true, or to demonstrate it with evidence.","zh":"“prove”的过去分词：证明某事为真；用证据证实。"},"examples":[{"en":"He has proven his point with clear data.","zh":"他用清晰的数据证明了他的观点。"},{"en":"The new design has proven popular with customers.","zh":"新设计已被证明很受顾客欢迎。"}]}],"synonyms":["verified","confirmed","demonstrated","established","tested"],"phonetic":"/ˈpruːvən/","extraExplanation":["在美式英语里，“proven”常用作形容词（proven results / proven track record）。但在动词形式中，很多教材会强调过去分词是“proved”。实际使用中，“proven”也非常常见，尤其在美国英语里（He has proven...).","常见搭配：proven + noun（proven solution/strategy/technique）；a proven track record（有可靠的成绩记录）；to be proven wrong/right（被证明错/对）。"]}
{"word":"provenance","summary":{"en":"Provenance means the origin of something—especially a documented history of where it came from and who owned it.","zh":"Provenance 指事物的来源，尤指可追溯、成文记录的流传与所有权历史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The origin or source of something, especially the history of who owned it and where it came from.","zh":"（尤指艺术品、古董等的）来源；出处；（历任）所有权与流传历史。"},"examples":[{"en":"The museum asked for the painting’s provenance before buying it.","zh":"博物馆在购买这幅画之前要求提供它的来源（流传）证明。"},{"en":"Without clear provenance, the artifact might be illegal or fake.","zh":"如果没有清晰的来源记录，这件文物可能是非法所得或赝品。"}]},{"partOfSpeech":"n.","definition":{"en":"The background or origin of a person, idea, or piece of information.","zh":"（人、观点或信息的）来历；背景；起源。"},"examples":[{"en":"She explained the provenance of the data used in the report.","zh":"她解释了报告中数据的来源。"},{"en":"Understanding the provenance of this tradition helps us respect it better.","zh":"了解这一传统的起源能帮助我们更好地尊重它。"}]}],"synonyms":["origin","source","background","lineage","history","pedigree"],"phonetic":"/ˈprɑvənəns/","extraExplanation":["“provenance”常用于艺术市场、博物馆与学术研究中，用来判断真伪、合法性与价值。没有可靠的provenance，作品可能涉及盗窃、走私或伪造。","词源来自法语 *provenir*（“来自、起源于”）。因此它常带有“可追溯的来源记录”这种正式语感。","近义词区分：*origin/source* 更口语、泛指；*provenance* 更强调“可追踪的来源链条/记录”。"]}
{"word":"provenances","summary":{"en":"“Provenances” means the origins/sources of things, or (in art and antiques) the documented history of ownership.","zh":"“Provenances”指事物的来源；在艺术品/古董领域尤指可追溯的传承记录（历任所有者等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The origins or sources of something (especially information, data, or materials).","zh":"（事物的）来源、出处（尤指信息、数据或材料的来源）。"},"examples":[{"en":"The report lists the provenances of the data used in the study.","zh":"这份报告列出了研究中所用数据的来源。"},{"en":"When sharing news online, it helps to check the provenance of the claim.","zh":"在网上分享新闻时，核实说法的出处很有帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"In art, antiques, and collectibles: the documented history of ownership and location of an object.","zh":"（艺术品、古董、收藏品的）来源记录；传承记录（指物品的历任所有者与流传地点等可追溯的历史）。"},"examples":[{"en":"The museum verified the painting’s provenance before putting it on display.","zh":"博物馆在展出这幅画前核实了它的来源记录。"},{"en":"Strong provenances can raise the value of antiques.","zh":"可靠的传承记录会提高古董的价值。"},{"en":"The dealer couldn’t provide provenances for the items, so buyers were cautious.","zh":"商家无法提供这些物品的来源记录，所以买家很谨慎。"}]}],"synonyms":["origins","sources","backgrounds","lineage","history of ownership"],"phonetic":"/ˈprɑvənənsɪz/","extraExplanation":["“Provenances”是“provenance”的复数。艺术与文物领域常用来判断真伪与合法性，例如确认是否涉及被盗、走私或战争时期掠夺的文物。","词源来自法语 provenir（意为“来自、出自”）。在学术与技术写作里，provenance 也常指“数据溯源/数据血缘（data provenance/lineage）”，强调数据从哪里来、经过了哪些处理步骤。"]}
{"word":"Provencal","summary":{"en":"Provencal/Provençal usually means “from Provence (southern France)” and can also refer to the regional Occitan language variety once widely used there.","zh":"Provencal/Provençal 通常指“来自法国普罗旺斯的”；也可指普罗旺斯地区的奥克语方言（普罗旺斯语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Provence, a region in southeastern France, or to its culture, people, or traditions.","zh":"（与）普罗旺斯（法国东南部地区）有关的；普罗旺斯的（文化、人民、传统等）。"},"examples":[{"en":"We tried Provençal food like ratatouille and tapenade.","zh":"我们尝了普罗旺斯风味的食物，比如蔬菜杂烩（ratatouille）和橄榄酱（tapenade）。"},{"en":"She loves Provençal fabrics with floral patterns.","zh":"她很喜欢带花卉图案的普罗旺斯风格布料。"}]},{"partOfSpeech":"n.","definition":{"en":"The Occitan language variety traditionally spoken in Provence; sometimes used broadly for Occitan.","zh":"普罗旺斯语：奥克语（Occitan）在普罗旺斯地区的传统方言；有时也泛指奥克语。"},"examples":[{"en":"Some poems were written in Provençal during the Middle Ages.","zh":"中世纪有些诗歌是用普罗旺斯语写的。"},{"en":"He is studying Provençal to read old songs.","zh":"他在学普罗旺斯语，以便读懂古老的歌曲。"}]}],"synonyms":["of Provence","Provençal (spelling variant)","Occitan (broader term, in the language sense)"],"phonetic":"/ˌproʊvənˈsɑːl/","extraExplanation":["英语里常见两种拼法：Provençal（带ç，更接近法语）与 Provencal（不带变音符，英文里也常用）。发音一般按英语读 /ˌproʊvənˈsɑːl/。","文化联想：Provençal 常让人想到薰衣草田、地中海饮食、乡村市集，以及“马赛皂”等南法意象；在艺术史里也常与描绘南法光线的画作联系在一起。"]}
{"word":"provencal","summary":{"en":"Provençal (also spelled Provencal) means “from Provence” or refers to the Provence variety of Occitan.","zh":"Provençal（也写作 Provencal）可指“普罗旺斯的”，也可指普罗旺斯地区的奥克语方言/语言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Provence, a region in southeastern France (or to its culture, people, or style).","zh":"（与法国东南部普罗旺斯地区有关的）普罗旺斯的；普罗旺斯人/文化/风格的。"},"examples":[{"en":"They rented a Provençal farmhouse surrounded by lavender fields.","zh":"他们租了一座典型的普罗旺斯乡间农舍，周围是薰衣草田。"},{"en":"The restaurant serves Provençal cuisine with olive oil, tomatoes, and herbs.","zh":"这家餐厅供应普罗旺斯菜肴，常用橄榄油、西红柿和香草。"}]},{"partOfSpeech":"n.","definition":{"en":"The Provençal language/dialect (often used to refer to varieties of Occitan spoken in Provence).","zh":"普罗旺斯语/方言（常指在普罗旺斯使用的奥克语〔Occitan〕变体）。"},"examples":[{"en":"Some poems were written in Provençal rather than standard French.","zh":"一些诗歌是用普罗旺斯语写的，而不是标准法语。"},{"en":"He studied Provençal to read medieval songs in the original.","zh":"他学习普罗旺斯语，以便阅读中世纪歌曲的原文。"}]}],"synonyms":["Provencal","from Provence","Occitan (Provençal variety)"],"phonetic":"/proʊˌvɑnˈsɑl/","extraExplanation":["在英语里常见两种拼写：Provençal（带变音符号ç）和 Provencal（不带符号）。两者意思相同；在正式出版物或学术语境中更常保留 ç。","文化联想：Provençal 常让人想到“普罗旺斯风格”——薰衣草、阳光、石头房子、橄榄油与香草（如百里香、迷迭香）等意象。","文学与历史：中世纪的“吟游诗人”（troubadours）在法国南部使用奥克语（Occitan）创作，其中一支与普罗旺斯地区相关，因此有时会看到 Provençal 与中世纪抒情诗传统联系在一起。"]}
{"word":"provencalize","summary":{"en":"“Provençalize” means to give something a Provençal (Provence) character, or (in language/literature) to express it in Provençal forms.","zh":"“provencalize”指使某物具有普罗旺斯特色；或在语言/文学语境中用普罗旺斯语（或其形式）来表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something adopt the language, style, or cultural character of Provence (southern France); to give something a Provençal flavor","zh":"使（某物）带有法国南部普罗旺斯地区的语言、风格或文化特征；使之“普罗旺斯化”"},"examples":[{"en":"The chef Provençalized the menu by adding olive oil, garlic, and herbs.","zh":"主厨在菜单里加入橄榄油、大蒜和香草，让整份菜单更有普罗旺斯风味。"},{"en":"Some translators try not to Provençalize the story too much, so it still feels broadly French.","zh":"有些译者会避免把故事过度“普罗旺斯化”，以免读起来不像普遍意义上的法式风格。"}]},{"partOfSpeech":"vt.","definition":{"en":"to render (speech or writing) in Provençal, or to use Provençal forms of words (in linguistics/literary contexts)","zh":"（语言/文学语境）用普罗旺斯语（常指奥克语的一种方言）来表达；或把词语改成普罗旺斯语的形式"},"examples":[{"en":"In his poems, he sometimes Provençalized French place-names to match local pronunciation.","zh":"在诗歌里，他有时会把法语地名“普罗旺斯语化”，以贴近当地发音。"},{"en":"The play was partly Provençalized to reflect the region where it was performed.","zh":"这出戏有一部分被“普罗旺斯语化”，以呼应演出所在的地区。"}]}],"synonyms":["localize","regionalize","make more Provençal","Occitanize (rare)"],"phonetic":"/ˌproʊvənˈsɑːlaɪz/","extraExplanation":["“Provençalize”很少见，多出现在文化研究、文学评论或语言学讨论中。它来自“Provençal（普罗旺斯的/普罗旺斯语的）+ -ize（使……化）”。","“Provençal / Provençal language”在历史上常与“Occitan（奥克语）”相关：普罗旺斯语通常被视为奥克语的一种地区变体。19世纪法国南部的“Félibrige（费利布里日）”文学运动曾推动奥克语/普罗旺斯语复兴，因此相关评论里偶尔会见到这类动词。"]}
{"word":"Provence","summary":{"en":"Provence is a region in southeastern France; it can also mean the lifestyle or style associated with that region.","zh":"Provence 指法国东南部的普罗旺斯地区；也可指与该地区相关的风情或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A region in southeastern France on the Mediterranean, famous for lavender fields, vineyards, olive groves, and historic towns.","zh":"法国东南部的普罗旺斯地区，濒临地中海，以薰衣草田、葡萄园、橄榄林和历史古镇闻名。"},"examples":[{"en":"They spent a week driving through Provence during lavender season.","zh":"他们在薰衣草盛开的季节自驾游普罗旺斯一周。"},{"en":"The market in Provence was full of olives, cheeses, and fresh herbs.","zh":"普罗旺斯的集市上摆满了橄榄、奶酪和新鲜香草。"}]},{"partOfSpeech":"n.","definition":{"en":"The culture, scenery, or style associated with that region (often used in cooking, décor, or travel writing).","zh":"与该地区相关的风情、景致或风格（常用于美食、家居装饰或旅行写作中）。"},"examples":[{"en":"The restaurant serves Provence-inspired dishes with rosemary and olive oil.","zh":"这家餐厅提供普罗旺斯风味的菜肴，常用迷迭香和橄榄油。"},{"en":"Her kitchen has a Provence look: light colors, rustic wood, and pottery.","zh":"她的厨房有普罗旺斯风格：浅色调、质朴木材和陶器。"}]}],"synonyms":["(region) southeastern France","the South of France","Provençal (related adjective)"],"phonetic":"/prəˈvɑːns/","extraExplanation":["“Provence”常在英语里唤起一种“南法阳光与慢生活”的想象：薰衣草、香草（如百里香、迷迭香）、橄榄油、葡萄酒与石头小镇。","在英语写作中也常见“Provençal”（普罗旺斯的／普罗旺斯人／普罗旺斯语），如：Provençal cuisine（普罗旺斯菜）、Provençal accent（普罗旺斯口音）。"]}
{"word":"provence","summary":{"en":"Provence is a well-known region in southeastern France; it can also describe the style or atmosphere associated with that region.","zh":"Provence 指法国东南部著名的普罗旺斯地区；也可指带有该地区特色的风格或氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A region in southeastern France on the Mediterranean, known for lavender fields, hill towns, and Provençal culture and cuisine (e.g., olive oil, herbs, rosé wine).","zh":"（法国）普罗旺斯：法国东南部地中海沿岸的一个地区，以薰衣草、山城、以及普罗旺斯文化与饮食（如橄榄油、香草、桃红葡萄酒）闻名。"},"examples":[{"en":"They spent the summer in Provence, visiting small villages and local markets.","zh":"他们在普罗旺斯度过了夏天，走访小村庄和当地集市。"},{"en":"Provence is famous for its lavender fields in July.","zh":"普罗旺斯以七月的薰衣草花田闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or atmosphere associated with that region, especially in art, décor, or writing (evoking sun, countryside, and rustic charm).","zh":"普罗旺斯风格／氛围：指与该地区相关的审美或气质，常用于艺术、家居装饰或写作中（带有阳光、乡村与质朴魅力的感觉）。"},"examples":[{"en":"The café tries to create a Provence feel with light colors and simple wooden tables.","zh":"这家咖啡馆用浅色调和朴素木桌营造出普罗旺斯的感觉。"},{"en":"Her novel is set in Provence and focuses on everyday life in the countryside.","zh":"她的小说以普罗旺斯为背景，描写乡村的日常生活。"}]}],"phonetic":"/prəˈvɑns/","extraExplanation":["“Provence”是专有地名，英语中首字母必须大写：Provence。对应中文常译为“普罗旺斯”。","它与“Provençal”（普罗旺斯的、普罗旺斯人/文化的）相关；英语里常见搭配如：Provençal cuisine（普罗旺斯菜）、Provençal herbs / herbs de Provence（普罗旺斯香草）。","在文学与旅行写作中，Provence常用来唤起“南法阳光、慢生活、乡村市场”的意象。"]}
{"word":"provencial","summary":{"en":"Provincial means related to a province or outside the main cities, and it can also mean narrow-minded or unsophisticated.","zh":"provincial 指“省级的/地方性的（非大城市中心的）”，也可指“眼界较窄、不够见多识广的”（有时带贬义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having to do with a province or regions outside the capital or major cities; not central.","zh":"与省份或首都/大城市以外的地区有关的；地方性的；非中心的。"},"examples":[{"en":"The museum started as a small provincial collection before it became famous.","zh":"这家博物馆最初只是一个小型的地方性馆藏，后来才出名。"},{"en":"She works for the provincial government.","zh":"她在省政府工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not sophisticated or worldly; narrow in experience or perspective (sometimes critical).","zh":"不够见多识广的；眼界较窄的（有时带贬义）。"},"examples":[{"en":"He has a provincial attitude toward art and only likes what he already knows.","zh":"他对艺术的态度有些狭隘，只喜欢自己熟悉的东西。"},{"en":"Try not to sound provincial when talking with people from other countries.","zh":"和其他国家的人交流时，尽量不要显得眼界狭窄。"}]}],"synonyms":["regional","local","parochial"],"phonetic":"/prəˈvɪnʃəl/","extraExplanation":["你输入的“provencial”通常是拼写错误；标准拼写是 provincial。","provincial 在英式/美式语境中既可以是中性词（“省级的、地方的”），也可能带轻微贬义（“土气的、见识不广的”）。是否冒犯取决于语境和语气，写作中如要保持客观，可用 regional（地区的）或 local（本地的）替换。"]}
{"word":"provend","summary":{"en":"“Provend” is a rare/archaic form meaning “proven; shown to be true.”","zh":"“provend”是少见/古语形式，意思是“已被证明的；证实为真”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/Scottish) past participle of “prove”; meaning “proven” or “shown to be true.”","zh":"（古语/苏格兰英语）“prove”的过去分词；意思是“已被证明的、被证实为真”。"},"examples":[{"en":"The medicine is provend safe in many studies.","zh":"许多研究已经证明这种药是安全的。"},{"en":"He sought a provend method rather than a risky experiment.","zh":"他想要一种已被证实有效的方法，而不是冒险的实验。"}]}],"synonyms":["proven","proved","demonstrated","established","verified"],"phonetic":"/ˈpruːvənd/","extraExplanation":["“provend”在现代标准英语里非常少见，多数情况下人们会写“proven”（更常用于形容词：a proven fact/solution）或“proved”（更常作为动词过去式/过去分词：He proved it / It was proved）。","如果你是在阅读较老的文本、苏格兰相关写作，或在诗歌/方言中见到“provend”，通常可以直接理解为“proven”。"]}
{"word":"provender","summary":{"en":"Provender means food for livestock, and more rarely (literary/humorous) provisions for people.","zh":"Provender 指牲畜饲料；也可（较少见、偏文学或幽默）指人的口粮、给养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food for livestock (such as hay, grain, or feed).","zh":"（牛马等）牲畜饲料；草料（如干草、谷物、饲料）。"},"examples":[{"en":"The farmer stored provender for the winter.","zh":"农夫为过冬储存了牲畜饲料。"},{"en":"They ran low on provender after the long drought.","zh":"长期干旱后，他们的饲料快用完了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary or humorous) Food or provisions for people; supplies to live on.","zh":"（文学或诙谐用法）人吃的食物；口粮；给养。"},"examples":[{"en":"The travelers packed enough provender for three days.","zh":"旅人带了足够三天的口粮。"},{"en":"He joked that coffee was his daily provender.","zh":"他开玩笑说咖啡就是他每天的“口粮”。"}]}],"synonyms":["animal feed","feed","fodder","forage","provisions"],"phonetic":"/ˈprɑvəndɚ/","extraExplanation":["“Provender”在现代英语中偏书面、带一点古风感，日常更常用“feed / animal feed / fodder”。用在人类食物上时通常是刻意的文学化或幽默效果。","词源来自法语与拉丁语，和“provide（提供）”同源，核心含义是“供给、给养”。"]}
{"word":"provenders","summary":{"en":"“Provenders” is the plural of “provender,” meaning animal feed (most common) or, less commonly, food/provisions for people.","zh":"“Provenders”是“provender”的复数，最常指家畜饲料；较少见时指人用的食物/给养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food for livestock (animal feed), such as hay or grain.","zh":"（尤指干草、谷物等）家畜饲料。"},"examples":[{"en":"The farmer stored provender in the barn for the winter.","zh":"农夫把饲料储存在谷仓里，准备过冬。"},{"en":"Horses need clean water and good provender every day.","zh":"马每天都需要干净的水和好的饲料。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Food or provisions for people, especially for a journey; supplies.","zh":"（较少见）供人食用的食物或旅途口粮；给养。"},"examples":[{"en":"They packed enough provender for three days on the trail.","zh":"他们为三天的徒步行程准备了足够的口粮。"},{"en":"In old stories, travelers often carried dried meat as provender.","zh":"在旧故事里，旅人常带干肉作口粮。"}]}],"synonyms":["feed","fodder","animal feed","provisions","supplies"],"phonetic":"/ˈprɑvəndɚ/","extraExplanation":["“provender”现在多用于较文学化或带乡村/农场气息的语境；现代日常英语里更常说 animal feed / fodder（动物饲料）。","你输入的“provenders”是复数形式，表示“多种饲料/给养”或“（不同批次的）饲料”。"]}
{"word":"provene","summary":{"en":"“Provene” is not standard English; you probably mean “proven” or “provenance.”","zh":"“provene”不是标准英语；你可能想写“proven”或“provenance”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling of “proven” (past participle of “prove”) or sometimes confusion with “provenance.”","zh":"不是标准英语单词；通常是把“proven”（prove 的过去分词/过去分词形容词）拼错了，有时也会与“provenance”（来源、出身）混淆。"},"examples":[{"en":"“Provene” isn’t correct; write “proven” instead.","zh":"“provene”不正确；应写“proven”。"},{"en":"Her method is proven to work.","zh":"她的方法已被证明有效。"},{"en":"The museum checked the painting’s provenance (its history of ownership).","zh":"博物馆核查了这幅画的 provenance（来源/流传与所有权历史）。"}]}],"phonetic":"/ˈproʊvən/","extraExplanation":["“Proven”在美式英语里很常见，可作形容词用，表示“已被证实的/可靠的”（a proven technique）。\n“Prove”的过去分词在英式英语中也常见“proved”。两者通常都对，但搭配“has/have”时美式更常用“proven”。\n“Provenance”主要用于艺术品、古董、档案等语境，指“来历/出处/流传记录”。"]}
{"word":"provenience","summary":{"en":"Provenience means the documented origin and history of an object; in archaeology, it often specifically means the exact place where it was found.","zh":"Provenience 指物品有记录的来源与流传史；在考古学中常特指其精确出土地点与地层位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The documented history of where an object has been, who owned it, and how it was collected—especially in museums, archaeology, and art.","zh":"（尤用于博物馆、考古与艺术领域）对一件物品“从哪里来、经过谁之手、如何被收集/流传”的有记录的来源与流传史。"},"examples":[{"en":"The museum refused to buy the statue because its provenience was unclear.","zh":"博物馆拒绝购买那座雕像，因为它的来源与流传记录（provenience）不清楚。"},{"en":"Archaeologists carefully record an artifact’s provenience to understand its context.","zh":"考古学家会仔细记录文物的出土来源信息（provenience），以理解它的背景与语境。"}]},{"partOfSpeech":"n.","definition":{"en":"In archaeology, the exact find-spot of an artifact (its precise location and position in the ground).","zh":"（考古学）文物的精确出土地点/位置（包括在地层中的具体位置与方位）。"},"examples":[{"en":"The arrowhead’s provenience was a burial layer dated to the 12th century.","zh":"那枚箭头的出土位置（provenience）来自一处可追溯到12世纪的墓葬地层。"},{"en":"Without provenience data, the pottery loses much of its scientific value.","zh":"没有出土位置信息（provenience），陶器的科学研究价值会大打折扣。"}]}],"synonyms":["origin","source","background","provenance"],"phonetic":"/prəˈviːniəns/","extraExplanation":["易混词：provenance（常见拼法）与 provenience（较常用于考古学）。很多场合两者都指“来源/流传史”，但在考古语境中，provenience 更强调“精确出土地点与地层位置”；provenance 更常指“所有权与流传记录”。","词源提示：两者都与法语 provenir（“来自、起源于”）相关。在博物馆与艺术市场里，清晰的来源记录有助于避免赃物、非法盗掘与文化遗产争议。"]}
{"word":"provenient","summary":{"en":"Provenient (rare) means “originating from” or “related to an object’s documented origin (provenance),” often used in archaeology/museums.","zh":"Provenient（罕用）意为“起源于/来自”，或“与物品的来源与传承记录（provenance）有关”，多用于考古与博物馆语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) originating from; coming from a particular source or place.","zh":"（罕用）起源于；来自某个来源或地点。"},"examples":[{"en":"The manuscript is provenient from a private collection in Spain.","zh":"这份手稿来自西班牙的一个私人收藏。"},{"en":"Many artifacts are provenient from the same excavation site.","zh":"许多文物都来自同一个发掘地点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal, specialized) relating to provenance (the documented origin/ownership history) of an object, especially in archaeology or museum contexts.","zh":"（正式/专业）与“来源/传承记录”（provenance）有关的，尤指考古或博物馆语境中物品的来历与流传。"},"examples":[{"en":"The curator requested provenient information before the purchase.","zh":"馆长在购买前要求提供与来源相关的信息。"},{"en":"Without provenient records, the item’s history is difficult to verify.","zh":"没有来源记录，这件物品的历史很难核实。"}]}],"synonyms":["originating","deriving","coming from","of known origin","traceable"],"phonetic":"/prəˈviːniənt/","extraExplanation":["“provenient”在现代英语中非常少见，多出现在考古学、人类学、博物馆学等领域的学术写作里；日常表达通常用“from / originating from / coming from”。","容易与“provenance（来源；来历；传承记录）”混淆：provenance是常用名词；provenient是相对少见的形容词，意思接近“having a provenance / of known origin”。","拼写上也容易被误认为“proven”或“convenient”。如果你想表达“被证明的/证实的”，应使用“proven”；表达“方便的”则是“convenient”。"]}
{"word":"provenly","summary":{"en":"“Provenly” means “in a proven way; demonstrably,” but it is uncommon—“provably” or “demonstrably” is usually preferred.","zh":"“provenly”意为“以已被证明的方式；可证实地”，但用法较少，通常更推荐用“provably”或“demonstrably”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has been proven; demonstrably (rare in modern English).","zh":"以已被证明的方式；可证实地（现代英语中较少用）。"},"examples":[{"en":"This method has been provenly effective in small clinical trials.","zh":"这种方法在小规模临床试验中已被证实有效。"},{"en":"The claim is not provenly true, so we should be cautious.","zh":"这个说法并没有被可证实地证明为真，所以我们应该谨慎。"}]}],"synonyms":["provably","demonstrably","verifiably","evidently","in a proven way"],"phonetic":"/ˈpruːvənli/","extraExplanation":["“provenly”在当代英语里很少见，尤其在正式写作中更常用“provably / demonstrably / in a proven way”。","“provenly”常出现在较旧的文本、非母语者写作，或个别作者为了强调“已经被证明”而造用的语感中；但它并非最自然的选择。","想表达“可被证明为真/可证伪”的逻辑语气时，优先用“provably”（如：provably false/true）。想表达“有证据支持、确实如此”时，用“demonstrably”也很常见。"]}
{"word":"provent","summary":{"en":"“Provent” is likely a misspelling of “prevent,” meaning to stop something from happening or to keep someone from doing something.","zh":"“provent”很可能是“prevent”的拼写错误，意思是阻止某事发生或阻止某人做某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stop something from happening; to keep something from occurring","zh":"阻止（某事）发生；预防"},"examples":[{"en":"Wearing a seat belt can help prevent serious injuries.","zh":"系安全带可以帮助预防严重受伤。"},{"en":"The police tried to prevent the crowd from entering the building.","zh":"警察试图阻止人群进入大楼。"},{"en":"Good handwashing prevents the spread of germs.","zh":"勤洗手能防止病菌传播。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep someone from doing something; to stop someone","zh":"阻止某人做某事；使某人无法（做某事）"},"examples":[{"en":"I was prevented from speaking because the meeting ended early.","zh":"会议提前结束，我没能发言。"},{"en":"Heavy snow prevented us from driving to the airport.","zh":"大雪使我们无法开车去机场。"}]}],"synonyms":["stop","avoid","keep (from)","block","hinder"],"phonetic":"/prɪˈvɛnt/","extraExplanation":["“provent”不是常见的英文单词拼写，通常是把 **prevent**（阻止/预防）拼错了。","常见搭配：**prevent + 名词**（prevent accidents 预防事故）；**prevent A from doing B**（阻止A做B）。注意：美式英语里 *prevent* 后面有时会省略 *from*（prevent people entering），但学习阶段建议保留 *from* 更清晰。"]}
{"word":"proventricular","summary":{"en":"An adjective meaning “of or relating to the proventriculus,” the glandular first stomach of birds before the gizzard.","zh":"形容词：指“与前胃有关的”，前胃是鸟类在砂囊（胗）之前的腺胃部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the proventriculus (the glandular part of a bird’s stomach, before the gizzard).","zh":"与前胃有关的（鸟类胃的腺胃部分，位于砂囊/胗之前）。"},"examples":[{"en":"In birds, proventricular glands secrete digestive juices before food reaches the gizzard.","zh":"在鸟类中，前胃腺会在食物到达砂囊（胗）之前分泌消化液。"},{"en":"The report described proventricular inflammation in several sick chickens.","zh":"报告描述了几只生病鸡的前胃炎症。"}]}],"synonyms":["proventriculus-related","glandular-stomach (bird)"],"phonetic":"/proʊˌvɛnˈtrɪkjələr/","extraExplanation":["“Proventriculus”常见于鸟类解剖与兽医/家禽养殖语境：鸟类胃分成两段——前胃（腺胃，负责分泌胃液）和砂囊/胗（gizzard，负责研磨食物）。因此“proventricular”多用在医学、病理或生理描述中。","词源上，pro- 有“在前”之意，ventricle/ventriculus 与“胃/腹腔”相关；整体意思就是“前胃的”。"]}
{"word":"proventricule","summary":{"en":"A bird’s glandular stomach before the gizzard.","zh":"鸟类砂囊/肌胃之前的腺胃（分泌消化液的胃部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In birds and some other animals) the glandular stomach that comes before the gizzard, where digestive juices are produced.","zh":"（鸟类及某些动物的）腺胃；位于砂囊/肌胃之前的胃部，主要分泌消化液。"},"examples":[{"en":"In chickens, food passes from the esophagus into the proventricule before reaching the gizzard.","zh":"在鸡的消化系统中，食物会先从食道进入腺胃（proventricule），然后再到砂囊/肌胃。"},{"en":"The veterinarian examined the bird’s proventricule to check for signs of infection.","zh":"兽医检查了这只鸟的腺胃，以确认是否有感染迹象。"}]}],"synonyms":["glandular stomach"],"phonetic":"/ˌproʊvɛnˈtrɪkjuːl/","extraExplanation":["“proventricule”是一个较偏生物学/兽医学的词，多用于描述鸟类消化系统。常见对比：\n- proventricule（腺胃）：分泌胃液、进行化学消化\n- gizzard（砂囊/肌胃）：肌肉发达，用来研磨食物（常借助吞下的小石子）\n在日常英语中更常听到“stomach”或直接说“the bird’s glandular stomach”。","词源上，pro- 有“在……之前”的意思，ventricule 与“胃/腹室”相关，因此整体含义可理解为“在（肌胃）之前的胃”。"]}
{"word":"proventriculi","summary":{"en":"Proventriculi are the glandular stomach parts (plural) before the gizzard, especially in birds.","zh":"Proventriculi 指“腺胃/前胃”（复数），多见于鸟类，位于砂囊之前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of proventriculus: the glandular “true stomach” (or stomach-like organ) that comes before the muscular gizzard, especially in birds; also used for a similar organ in some insects.","zh":"proventriculus 的复数：指位于砂囊（gizzard）之前、负责分泌消化液的“腺胃/前胃”，多用于鸟类；也可指某些昆虫中类似功能的器官。"},"examples":[{"en":"In birds, the proventriculi secrete enzymes and acid before food moves to the gizzard.","zh":"在鸟类中，腺胃（proventriculi）会分泌酶和酸，食物随后进入砂囊。"},{"en":"The report compared the proventriculi of different species to explain their diets.","zh":"报告比较了不同物种的腺胃（proventriculi），以解释它们的饮食差异。"}]}],"synonyms":["proventriculus (singular form)","glandular stomach (descriptive)","foregut (broader term, context-dependent)"],"phonetic":"/ˌproʊvɛnˈtrɪkjəˌlaɪ/","extraExplanation":["这是一个偏专业的解剖学/动物学用词。单数是 proventriculus（腺胃/前胃）。在鸟类消化系统里，食物通常先到腺胃进行化学消化（分泌胃液），再到砂囊进行机械研磨。","词源来自拉丁语：pro-（在……之前）+ ventriculus（小肚子/胃），字面意思是“在胃之前的（小）胃”。"]}
{"word":"proventriculus","summary":{"en":"The proventriculus is the glandular “true stomach” in birds, where digestive juices are secreted before food goes to the gizzard.","zh":"proventriculus 指鸟类的腺胃（“真胃”），负责分泌消化液，食物随后进入砂囊/肌胃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A glandular part of a bird’s stomach (also called the “true stomach”) that secretes digestive juices before food moves to the gizzard for grinding.","zh":"（鸟类胃的）腺胃；也常被称为“真胃”，负责分泌消化液，食物随后进入砂囊/肌胃进行研磨。"},"examples":[{"en":"In chickens, the proventriculus releases enzymes that begin digestion before the food reaches the gizzard.","zh":"在鸡的消化系统中，腺胃会分泌酶，食物到达砂囊之前就开始消化。"},{"en":"The vet examined the bird’s proventriculus to check for signs of infection.","zh":"兽医检查了鸟的腺胃，以确认是否有感染迹象。"}]}],"synonyms":["glandular stomach","true stomach (in birds)"],"phonetic":"/ˌproʊvɛnˈtrɪkjələs/","extraExplanation":["词源提示：proventriculus 来自拉丁语，pro- 有“在前”的意思，ventriculus 是“胃/小胃”。因此它字面上可理解为“在前面的胃”，对应鸟类消化道里位于砂囊（gizzard）之前、负责分泌消化液的部分。","学习对比：proventriculus（腺胃，分泌消化液） vs. gizzard（砂囊/肌胃，负责磨碎食物）。在鸟类解剖或家禽养殖资料里，这两个词常一起出现。"]}
{"word":"prover","summary":{"en":"A prover is someone (or in math/CS, a program) that proves something is true.","zh":"prover 指证明某事为真的人；在数学/计算机中也可指（自动）定理证明器等证明程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who proves something; someone who shows that a statement, claim, or idea is true","zh":"证明者；证实某事的人（用证据或论证表明某个说法是真的）"},"examples":[{"en":"In science, a prover must provide clear evidence for a claim.","zh":"在科学中，证明者必须为一个主张提供清晰的证据。"},{"en":"The prover presented documents that confirmed the timeline.","zh":"证明者出示了文件，证实了时间线。"}]},{"partOfSpeech":"n.","definition":{"en":"(math/logic) someone or something that produces a formal proof, especially a computer program used to check proofs","zh":"（数学/逻辑）证明工具或证明程序；尤指用于生成或检验证明的计算机程序（定理证明器）"},"examples":[{"en":"The team used an automated prover to verify the theorem.","zh":"团队使用自动定理证明器来验证该定理。"},{"en":"A proof assistant can act as a prover by checking each step.","zh":"证明助理可以作为证明器来检查每一步。"}]}],"synonyms":["demonstrator","validator","verifier","theorem prover"],"phonetic":"/ˈpruːvɚ/","extraExplanation":["“prover”来自动词“prove”（证明）。在日常英语里更常见的是“someone who proves…”这种描述；在数学与计算机领域，“(theorem) prover / automated prover”很常用，指“定理证明器/自动证明器”。","不要与“provider”（提供者）混淆：prover=证明者；provider=提供者。拼写相近但意义不同。"]}
{"word":"proverb","summary":{"en":"A proverb is a short traditional saying that gives advice or expresses a general truth.","zh":"proverb 指“谚语/格言”：简短而传统的说法，用来表达普遍真理或人生建议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short, well-known saying that expresses a general truth or piece of advice, often based on common experience.","zh":"谚语；格言：一种简短、广为人知的句子，表达普遍道理或劝诫，常源自生活经验。"},"examples":[{"en":"“A stitch in time saves nine” is a proverb about fixing problems early.","zh":"“A stitch in time saves nine（小洞不补，大洞吃苦）”是一条强调及早解决问题的谚语。"},{"en":"My grandmother taught me a proverb: “Actions speak louder than words.”","zh":"我奶奶教过我一句谚语：“Actions speak louder than words（行胜于言）。”"}]}],"synonyms":["saying","adage","maxim","aphorism"],"phonetic":"/ˈprɑː.vɝːb/","extraExplanation":["“Proverb”常用于较正式或书面语；日常对话里，人们也会说“a saying”或“an old saying”。","在文学与文化中，谚语常用来传递集体经验和价值观；不同文化可能有意义相近但表达不同的谚语。"]}
{"word":"proverbed","summary":{"en":"“Proverbed” is a literary, old-fashioned adjective meaning “proverbial; widely known,” and it can also be the past participle of “proverb.”","zh":"“proverbed”是较文学、偏旧式的形容词，表示“谚语般众所周知的”，也可作动词 proverb 的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, old-fashioned) Mentioned in a proverb; well-known from being often talked about; proverbial.","zh":"（文学/旧式用法）被谚语提到的；因常被谈论而出名的；谚语般众所周知的。"},"examples":[{"en":"He was the proverbed hero of the town, praised in every story.","zh":"他是镇上“众所周知的”英雄，几乎每个故事都会夸他。"},{"en":"Their proverbed hospitality made visitors feel at home.","zh":"他们“人人称道”的好客让来访者宾至如归。"}]},{"partOfSpeech":"other","definition":{"en":"(Grammar) Past participle of “proverb” meaning “to put into a proverb; to express as a proverb.”","zh":"（语法）动词 proverb 的过去分词：把……写成/说成谚语；用谚语来表达。"},"examples":[{"en":"The lesson was proverbed into a short saying that everyone could remember.","zh":"这个道理被提炼成一句简短的谚语，大家都记得住。"}]}],"synonyms":["proverbial","well-known","famed","legendary"],"phonetic":"/ˈprɑvərbd/","extraExplanation":["“proverbed”在现代英语里不常用，更常见的对应词是“proverbial（众所周知的/传说中的）”。在文学作品或较古典的语境中，你可能会见到“proverbed”用来制造一种书卷气或复古的味道。"]}
{"word":"proverbial","summary":{"en":"Proverbial means ‘widely talked about and familiar,’ or ‘having the style of a proverb.’","zh":"proverbial 指“广为人知、常被提及的（典型的）”，也可指“具有谚语风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Commonly referred to or widely known because it has been talked about many times (often in a fixed, familiar way).","zh":"因被反复提及而广为人知的；常被引用的（常带有固定、熟悉的说法）。"},"examples":[{"en":"He’s the proverbial “life of the party.”","zh":"他就是人们常说的“派对灵魂人物”。"},{"en":"We ran into the proverbial traffic jam on the way to the airport.","zh":"去机场路上我们遇到了人人都懂的那种“典型堵车”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or expressed as a proverb; having the style of a proverb (short, wise, and memorable).","zh":"与谚语有关的；用谚语表达的；具有谚语风格的（简短、有智慧、好记）。"},"examples":[{"en":"Her advice was brief and almost proverbial.","zh":"她的建议很简短，几乎像一句谚语。"},{"en":"The novel is full of proverbial sayings about money and work.","zh":"这本小说里有很多关于金钱和工作的谚语式说法。"}]}],"synonyms":["typical","famous","well-known","classic","time-honored","aphoristic"],"phonetic":"/prəˈvɝbiəl/","extraExplanation":["“proverbial”常用在固定搭配“the proverbial + 名词/短语”里，意思是“大家都听过、典型的那个……”，常带一点幽默或调侃的语气。","不要把“proverbial”误用成“proved（被证实的）”。它强调的是“被广泛流传/常被提及”，不强调真假。"]}
{"word":"proverbialism","summary":{"en":"Proverbialism means using proverbs as a speaking/writing style, or a proverb-like saying.","zh":"Proverbialism 指使用谚语的语言风格/现象，或某一句“像谚语”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of proverbs (traditional short sayings) in speaking or writing; a style that relies on proverbs","zh":"（口语或写作中）使用谚语/格言的做法；偏好用谚语表达的语言风格"},"examples":[{"en":"Her speeches are full of proverbialism, like “A stitch in time saves nine.”","zh":"她的演讲充满了“谚语化”的表达，比如“及时一针省九针。”"},{"en":"The novel’s rural characters speak with heavy proverbialism.","zh":"小说里的乡村人物说话时大量使用谚语。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular expression that sounds like a proverb; a proverb-like saying","zh":"某一句带有谚语味道的说法；类似谚语的表达"},"examples":[{"en":"“Better safe than sorry” is a common proverbialism in English.","zh":"“Better safe than sorry”（小心总比后悔好）是英语里常见的一句“谚语式说法”。"},{"en":"He ended the email with a proverbialism to soften the criticism.","zh":"他在邮件末尾用一句谚语式的话来缓和批评的语气。"}]}],"synonyms":["use of proverbs","proverb usage","proverb-like saying","maxim","aphorism"],"phonetic":"/prəˈvɝ.bi.əˌlɪ.zəm/","extraExplanation":["“proverbialism”比较偏学术或书面，用在语言学、文学评论里，描述某种说话/写作习惯（喜欢引用谚语），或把某句话当作“谚语式表达”来讨论。日常对话里更常见的说法是：the use of proverbs / a proverb-like saying。","注意区分：proverb（谚语，本体） vs. proverbial（形容词：众所周知的；像谚语的） vs. proverbialism（名词：使用谚语的现象/风格，或某一句谚语式表达）。"]}
{"word":"proverbialist","summary":{"en":"A proverbialist is someone who frequently uses proverbs, or someone who collects and studies proverbs.","zh":"proverbialist 指常引用谚语的人，也可指收集与研究谚语的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who often uses proverbs (traditional sayings) when speaking or writing","zh":"（说话或写作时）常引用谚语、格言的人"},"examples":[{"en":"My grandfather is a real proverbialist—every lesson comes with a saying.","zh":"我爷爷真是个“谚语达人”——每次讲道理都会配一句谚语。"},{"en":"In her speeches, she sounds like a proverbialist, quoting old sayings to persuade the audience.","zh":"她的演讲听起来像个爱用谚语的人，用老话来打动听众。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who collects, studies, or writes about proverbs (an author or compiler of proverb collections)","zh":"收集、研究或编纂谚语的人（谚语集的作者或编者）"},"examples":[{"en":"The book was edited by a proverbialist who compared sayings from many cultures.","zh":"这本书由一位编纂谚语的人编辑，他比较了多种文化中的谚语。"},{"en":"As a proverbialist, she traced how a proverb changed over time.","zh":"作为研究谚语的人，她追踪了一条谚语如何随时间变化。"}]}],"synonyms":["proverb-user","compiler of proverbs","collector","paremiologist (more technical)"],"phonetic":"/prɑːˈvɝːbiəlɪst/","extraExplanation":["“proverbialist”在现代英语里不算常用，更常见的说法是“someone who loves/uses proverbs（喜欢/常用谚语的人）”。在学术语境中，研究谚语的更专业词是“paremiologist（谚语学者）”。","词源上来自“proverb（谚语）+ -ist（从事者/爱好者）”。在文学或演讲描写中，用它可以突出一个人说话带有“老话连篇、用格言讲道理”的风格。"]}
{"word":"proverbialize","summary":{"en":"“Proverbialize” means to turn something into a proverb or to speak/write using proverbs.","zh":"“proverbialize”指把某事谚语化，或在说话/写作中使用谚语。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn something into a proverb; to express something in the form of a proverb.","zh":"把某事变成谚语；用谚语的形式来表达某事。"},"examples":[{"en":"Writers sometimes proverbialize everyday advice to make it easier to remember.","zh":"作家有时会把日常建议谚语化，让人更容易记住。"},{"en":"Over time, people proverbialize a clever line and repeat it as common wisdom.","zh":"久而久之，人们会把一句机智的话谚语化，并把它当作常识反复引用。"}]},{"partOfSpeech":"vi.","definition":{"en":"to use proverbs (in speech or writing).","zh":"（在口语或写作中）使用谚语。"},"examples":[{"en":"He tended to proverbialize when giving life advice.","zh":"他在给人生建议时往往爱引用谚语。"},{"en":"Some speeches proverbialize too much and sound old-fashioned.","zh":"有些演讲谚语用得太多，听起来就有点老派。"}]}],"synonyms":["turn into a proverb","express as a proverb","cast in proverbial form","use proverbs"],"phonetic":"/prəˈvɝːbiəˌlaɪz/","extraExplanation":["“proverbialize”由“proverb（谚语）+ -ize（使……化）”构成，意思就是“使之成为谚语/使之谚语化”。","这个词在现代英语里不算常用，更常见的表达是“turn into a proverb”“express as a proverb”或“use a proverb”。"]}
{"word":"proverbially","summary":{"en":"“Proverbially” means “as people commonly say; in a way described by a proverb.”","zh":"“proverbially”表示“俗话说；可谓；用谚语/惯用说法来形容”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is typical of or well described by a proverb; as people commonly say.","zh":"以谚语所形容的方式；用俗话说；照大家常说的那样。"},"examples":[{"en":"She is, proverbially, the “early bird” in our team—always the first to arrive.","zh":"她在我们团队里可谓“早起的鸟儿”——总是第一个到。"},{"en":"The two companies are proverbially like oil and water: they don’t mix well.","zh":"这两家公司可谓“水火不容”，很难合作。"},{"en":"He had his proverbially “hands full” after taking on two extra projects.","zh":"他又接了两个项目后，可谓“忙得不可开交”。"}]}],"synonyms":["typically","commonly","famously","as the saying goes"],"phonetic":"/prəˈvɝːbiəli/","extraExplanation":["“proverbially”常用来引出一个大家熟悉的说法或固定比喻，语气通常较书面、带一点强调或幽默：表示“正如俗话所说”。","它不一定真的引用某条具体谚语；更多时候是说某种描述“非常典型、几乎成了固定说法”。常见搭配：proverbially speaking（俗话说）；be proverbially + adj./phrase（可谓……）。"]}
{"word":"proverbic","summary":{"en":"“Proverbic” is a rare, nonstandard form meaning “proverb-like; widely recognized.” Use “proverbial” in standard English.","zh":"“proverbic”是少见的非标准形式，意思接近“像谚语一样、众所周知的”。标准英语中建议用“proverbial”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) Having the nature of a proverb; commonly said or widely recognized, like a proverb. (Standard form: “proverbial.”)","zh":"（非标准用法）具有谚语的性质；像谚语一样被人常说、广为人知。（标准形式：proverbial）"},"examples":[{"en":"He became the proverbial example of hard work in our town.","zh":"他成了我们镇上“勤奋”的典型例子（人们常挂在嘴边的那种）。"},{"en":"It’s the proverbial “calm before the storm.”","zh":"这就是所谓的“暴风雨前的宁静”。"}]}],"synonyms":["proverbial","well-known","classic","time-honored"],"phonetic":"/prəˈvɝbiəl/","extraExplanation":["“proverbic”在现代英语中非常少见，通常会被视为拼写错误或非标准变体。写作和正式场合建议使用“proverbial”。","“proverbial”常用来表示“众所周知的、常被提起的”，不一定真的来自某一句具体谚语，而是强调“大家都这么说/这么认为”。"]}
{"word":"proverbing","summary":{"en":"“Proverbing” means speaking by using proverbs, or making something become a widely repeated proverb (rare in modern everyday English).","zh":"“Proverbing”指用谚语说话，或使某事变成广为流传的谚语（现代日常英语较少用）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “proverb”) Using or speaking in proverbs; expressing an idea in the form of a short traditional saying.","zh":"（动词 proverb 的现在分词）用谚语说话；用简短传统格言来表达意思。"},"examples":[{"en":"He kept proverbing about patience, but never explained what he meant.","zh":"他一直用关于耐心的谚语来讲道理，却从不解释自己真正的意思。"},{"en":"In the novel, the old farmer is always proverbing, teaching lessons through sayings.","zh":"在小说里，那位老农夫总爱用谚语说话，用格言来教人道理。"}]},{"partOfSpeech":"v.","definition":{"en":"Making something become a proverb or widely repeated saying; turning an event or phrase into a well-known example.","zh":"使某事变成谚语或广为流传的说法；把某件事/一句话变成众所周知的典型。"},"examples":[{"en":"Over time, people began proverbing the story into a warning about pride.","zh":"久而久之，人们把这个故事“谚语化”，当作对骄傲的警示。"},{"en":"The speech was quoted so often that the line was proverbing among students.","zh":"那段演讲被引用得太多，以至于那句话在学生中逐渐成了口头格言。"}]}],"synonyms":["speaking in proverbs","quoting proverbs","using sayings","moralizing"],"phonetic":"ˈprɑvɝbɪŋ","extraExplanation":["“proverbing”在现代英语中比较少见，更多见于文学描写或带点幽默/讽刺的语境，用来形容某人总爱用谚语来讲道理。日常更常用的说法是：“speaking in proverbs / quoting proverbs / using proverbs”。","相关词：proverb（谚语）；proverbial（众所周知的；谚语般的）。"]}
{"word":"proverbiologist","summary":{"en":"A (usually humorous/nonstandard) word meaning someone who studies or collects proverbs.","zh":"（多为幽默/非标准用法）指研究或收集谚语的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, collects, or writes about proverbs; a (often humorous or nonstandard) term for a proverb scholar.","zh":"研究、收集或撰写谚语的人；（常带幽默或非标准用法）指“谚语研究者”。"},"examples":[{"en":"The article was written by a proverbiologist who compared sayings from different cultures.","zh":"这篇文章出自一位“谚语研究者”之手，他比较了不同文化中的俗语。"},{"en":"As a proverbiologist, she keeps a notebook of proverbs she hears in daily life.","zh":"作为一名“谚语研究者”，她会把日常听到的谚语记在本子上。"},{"en":"He joked that he was a proverbiologist because he always had a saying for every situation.","zh":"他开玩笑说自己是“谚语学家”，因为任何场合他都有一句俗语能对上。"}]}],"synonyms":["paremiologist","proverb scholar","proverb collector"],"phonetic":"/ˌprɑvɝˌbiˈɑlədʒɪst/","extraExplanation":["“proverbiologist”并不是常见的规范词，更多像是把“proverb（谚语）”套进“biologist（生物学家）”这种构词框架里，带一点玩笑或自创的感觉。","更常见、更正式的对应词是“paremiologist”（谚语学者/谚语研究者）。在学术语境中建议用“paremiologist”或“proverb scholar”。"]}
{"word":"proverbiology","summary":{"en":"“Proverbiology” is a nonstandard, playful term meaning the study of proverbs; the standard word is “paremiology.”","zh":"“proverbiology”是非标准的戏称，常指“研究谚语”；更标准的词是“paremiology（谚语学）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard / humorous) The study, collection, or analysis of proverbs; used as a playful blend of “proverb” + “biology.”","zh":"（非标准/幽默用法）对谚语的研究、收集或分析；常被理解为把“proverb（谚语）”和“biology（生物学）”拼在一起的戏称。"},"examples":[{"en":"In our linguistics club, we jokingly called our proverb project “proverbiology.”","zh":"在我们的语言学社团里，我们开玩笑把谚语项目叫作“proverbiology”。"},{"en":"Her “proverbiology” notes compare similar proverbs across different cultures.","zh":"她的“proverbiology”笔记比较了不同文化中相似的谚语。"}]}],"synonyms":["paremiology","proverb study","proverb research"],"phonetic":"/ˌprɑvərbaɪˈɑlədʒi/","extraExplanation":["“proverbiology”不是英语里的常见标准词，更像是自造词/玩笑说法。","如果你想表达“谚语学/谚语研究”，更标准的术语是 **paremiology**（谚语学），指对谚语的收集、分类与研究。","相关词：**proverb**（谚语）；**saying**（俗语/格言）；**idiom**（习语，和谚语不同，通常不表达完整人生道理）。"]}
{"word":"proverbize","summary":{"en":"“Proverbize” means to put something into a proverb-like form, or for a saying to become widely quoted like a proverb.","zh":"“proverbize”指把一句话或观点变成谚语式的表达，或指某种说法逐渐像谚语一样被广泛引用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to express something in the form of a proverb; to turn an idea or statement into a proverb-like saying","zh":"把某事用谚语（格言）的形式表达；把一种想法或说法变成像谚语一样的固定说法"},"examples":[{"en":"The teacher proverbized the lesson: “Practice makes perfect.”","zh":"老师把这节课的要点用谚语表达出来：“熟能生巧。”"},{"en":"Writers sometimes proverbize everyday observations so readers remember them.","zh":"作家有时会把日常观察“谚语化”，让读者更容易记住。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become widely repeated and accepted like a proverb; to become proverbial","zh":"（说法/观点）变得像谚语一样被广泛重复与接受；变成“约定俗成的名言”"},"examples":[{"en":"Over time, the warning proverbized and everyone quoted it as if it were ancient wisdom.","zh":"随着时间推移，这句警告变得像谚语一样流传开来，大家引用时仿佛是古老智慧。"}]}],"synonyms":["proverbialize","make proverbial","turn into a proverb","coin a proverb"],"phonetic":"/ˈprɑvərˌbaɪz/","extraExplanation":["“proverbize”在现代英语中较少见，更常见的拼写是“proverbialize”。两者意思基本相同。","词源上来自“proverb（谚语）+ -ize（使……化）”。在写作中，这个动词常用于讨论风格：把一句话改写得更精炼、好记、像格言一样有“可引用性”。"]}
{"word":"proverblike","summary":{"en":"“Proverblike” describes words or writing that sound like a proverb—short, memorable, and full of general wisdom.","zh":"“proverblike”用来形容像谚语一样的表达：简短易记、富含普遍智慧或忠告。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a proverb: short, memorable, and expressing a general truth or piece of advice.","zh":"像谚语一样的：简短、有记忆点，并表达普遍道理或忠告。"},"examples":[{"en":"Her advice was proverblike: “Measure twice, cut once.”","zh":"她的建议很像谚语：“三思而后行（量两次再下刀）。”"},{"en":"The speaker ended with a proverblike line that everyone remembered.","zh":"演讲者用一句谚语般的结尾，让大家都记住了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Style) Having the tone or wording typical of proverbs; aphoristic.","zh":"（文体）带有谚语式的语气或措辞；格言式的。"},"examples":[{"en":"The novel is full of proverblike phrases that sound wise and old.","zh":"这部小说里有许多谚语式的句子，听起来睿智而古朴。"},{"en":"His writing is simple and proverblike, so it’s easy to quote.","zh":"他的写作简洁、格言式，很容易被引用。"}]}],"synonyms":["aphoristic","pithy","gnomic","sententious"],"phonetic":"/ˈprɑvɝbˌlaɪk/","extraExplanation":["“proverblike”由 proverb（谚语）+ like（像……一样）构成，常见于描写语言风格：强调“简短、易记、含有道理”。","近义词里，aphoristic 更偏“格言/警句式”（较正式），pithy 强调“精炼有力”，folksy 则偏“民间/口语化的智慧”。"]}
{"word":"proverbs","summary":{"en":"Proverbs are traditional, widely known sayings that express general truths or practical advice.","zh":"Proverbs 指“谚语/格言”，是传统且广为流传的短句，用来表达普遍真理或生活经验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Short, well-known traditional sayings that express a general truth, practical advice, or a moral lesson.","zh":"谚语；格言：简短、广为人知的传统说法，用来表达普遍真理、生活经验或道德教训。"},"examples":[{"en":"There’s a proverb that says, “Actions speak louder than words.”","zh":"有句谚语说：“行动胜于言辞。”"},{"en":"Many cultures use proverbs to teach children how to behave.","zh":"许多文化用谚语来教孩子如何做人做事。"},{"en":"He quoted old proverbs to make his point sound wiser.","zh":"他引用古老的谚语，让自己的观点听起来更有智慧。"}]},{"partOfSpeech":"n.","definition":{"en":"Popular sayings used in speech or writing to make an idea clearer or more persuasive.","zh":"（在口语或写作中）常用的俗语/成语式表达，用来让观点更清楚或更有说服力。"},"examples":[{"en":"Writers sometimes use proverbs to add rhythm and memorability to a sentence.","zh":"作家有时用谚语来增强句子的节奏感和记忆点。"},{"en":"In everyday conversation, a proverb can summarize a situation quickly.","zh":"在日常对话里，一句谚语能迅速概括一种处境。"}]}],"synonyms":["sayings","adages","maxims","aphorisms"],"phonetic":"/ˈprɑvɝbz/","extraExplanation":["“proverb”常见的单数形式是 proverb；你输入的“proverbs”是复数，表示“多条谚语”。","谚语往往来自长期口耳相传的生活经验，因此很多文化里会出现意义相近的谚语，但用的意象不同（例如中文“覆水难收”与英文“Don’t cry over spilled milk”都表达“过去的事别再后悔”）。","常见搭配：an old proverb（一句古老的谚语）、a Chinese proverb（中国谚语）、to quote a proverb（引用谚语）。","近义词辨析：saying（俗语/说法，更口语）、idiom（习语，意思常不能从字面推断）、maxim（格言，偏正式/书面）、adage（古老格言，偏书面）。"]}
{"word":"provers","summary":{"en":"“Provers” means people or devices that verify or test something (plural of “prover”).","zh":"“provers”是“prover”的复数，指用于测试或验证的人或设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “prover”: a person or device that tests, verifies, or demonstrates that something is correct or works properly.","zh":"“prover”的复数：指进行测试、验证或证明某事正确/有效的人或设备。"},"examples":[{"en":"The lab hired two provers to verify the new measurement method.","zh":"实验室雇了两名验证人员来核实新的测量方法。"},{"en":"In the pipeline industry, provers check whether flow meters are reading accurately.","zh":"在管道行业里，检定装置（provers）用来检查流量计读数是否准确。"}]}],"synonyms":["verifiers","testers","inspectors","validators"],"phonetic":"/ˈpruːvɚz/","extraExplanation":["“provers”常见于技术语境（如计量、工程、软件测试）。例如“meter prover”（流量计检定装置）是一种用于校准/检定仪表的设备。","很多学习者会把“provers”和“Proverbs（箴言）”混淆：Proverbs 是《圣经》中的一卷书名，也泛指“谚语（proverbs）”。如果你想查的是“proverbs（谚语）”，告诉我我可以按谚语词条再解释。"]}
{"word":"proves","summary":{"en":"“Proves” means ‘shows something is true’ or ‘turns out to be’ (third-person singular of prove).","zh":"“proves”是“prove”的第三人称单数，表示“证明……”或“结果是……”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to show that something is true or correct by using evidence, facts, or reasoning","zh":"用证据、事实或推理证明某事是真的或正确的"},"examples":[{"en":"The experiment proves that the new medicine works.","zh":"实验证明这种新药有效。"},{"en":"Her smile proves she is happy.","zh":"她的微笑证明她很开心。"},{"en":"Can you prove your claim with data?","zh":"你能用数据证明你的说法吗？"}]},{"partOfSpeech":"vi.","definition":{"en":"to turn out to be; to be shown (later) to be true or a certain way","zh":"结果是；后来被证明是（某种情况）"},"examples":[{"en":"The plan proves difficult to finish on time.","zh":"这个计划结果很难按时完成。"},{"en":"His guess proves right in the end.","zh":"他的猜测最后证明是对的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to show your ability or value through actions (often: prove yourself)","zh":"通过行动证明自己的能力或价值（常用：prove yourself）"},"examples":[{"en":"She proves herself as a strong leader during the crisis.","zh":"在危机中，她证明自己是一位强有力的领导者。"},{"en":"He wants to prove himself to his team.","zh":"他想向团队证明自己。"}]}],"synonyms":["demonstrates","shows","establishes","confirms","verifies","turns out"],"phonetic":"/pruvz/","extraExplanation":["“proves”是动词“prove”的第三人称单数现在时：he/she/it proves。","常见搭配：prove (that) + 从句；prove + 名词/代词；prove + 形容词（作表语，表示“结果是……”）。例如：It proves useful.","名词形式是“proof”（证据；证明）。在数学/逻辑里，proof 指“证明过程”；在法律语境中，prove 常与 evidence（证据）一起出现。"]}
{"word":"proviant","summary":{"en":"Proviant means stored or carried food and supplies, especially for travel or military use (an older word for provisions).","zh":"Proviant 指旅途或军用的食物与补给，是较旧的“provisions（给养/补给）”说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food and supplies stored or carried for a journey, expedition, or military use; provisions (often used in older or historical writing).","zh":"（旅途、远征或军用的）给养、口粮、补给（常见于较旧或历史语境）。"},"examples":[{"en":"The sailors loaded proviant before the ship left port.","zh":"船离港前，水手们装载了给养。"},{"en":"We packed enough proviant for three days of hiking.","zh":"我们为三天的徒步准备了足够的补给。"}]}],"synonyms":["provisions","supplies","rations","stores"],"phonetic":"ˈproʊviənt","extraExplanation":["“proviant”在现代英语里比较少见，更常用的是“provisions”或“supplies”。它常出现在历史小说、航海/军旅记述或仿古写法中，用来营造旧时代氛围。","词源上与“provide（提供）/provision（供给、规定）”同源，核心概念都是“事先准备并提供所需之物”，尤其指食物与基本生活物资。"]}
{"word":"provicar","summary":{"en":"“Provicar” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“provicar”不是标准英语单词，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name. Common intended words include “vicar” (a church priest) or “provoke” (to cause a reaction).","zh":"不是标准英语单词，可能是拼写错误或专有名词。常见可能想表达的词包括“vicar”（教区牧师）或“provoke”（激起、引发反应）。"},"examples":[{"en":"I couldn’t find “provicar” in standard English dictionaries—could you share a sentence where you saw it?","zh":"我在常见英语词典里找不到“provicar”，你能提供你看到它的句子吗？"},{"en":"Did you mean “vicar,” as in “the vicar spoke to the community”?","zh":"你是不是想写“vicar”，比如“那位牧师对社区发表讲话”？ "},{"en":"Did you mean “provoke,” as in “The comment provoked an argument”?","zh":"你是不是想写“provoke”，比如“那句话引发了一场争论”？"}]}],"synonyms":["vicar","provoke","provocateur","procurator","provisional"],"phonetic":"/proʊˈvaɪkər/","extraExplanation":["“provicar”看起来像把“pro-”（表示“支持/代理/向前”）和“vicar”（牧师/教区神父，也有“代理者”的含义）拼在一起，但英语里并没有常用的合成词“provicar”。","如果你是在宗教、历史或学校职位的语境中看到它，也可能是特定机构的头衔、姓氏、品牌名，或是某个语言（如西班牙语/葡萄牙语）的词形。给我原句和出处（书名、网页、截图）我可以更准确判断。"]}
{"word":"provicariate","summary":{"en":"A rare church term for the office or jurisdiction of a pro-vicar (a deputy acting for a vicar).","zh":"罕见的教会用语，指代理本堂（pro‑vicar）的职务/权限，或其管辖与行政事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, church use) The office, role, or authority of a pro-vicar (a deputy who acts for a vicar), or the area/administration under that deputy.","zh":"（罕见，教会用语）“副/代理本堂司铎（pro‑vicar）”的职务、权限，或其所管理的区域/事务。"},"examples":[{"en":"During the bishop’s illness, the provicariate handled many routine parish decisions.","zh":"主教生病期间，provicariate 负责处理许多堂区的日常决定。"},{"en":"He was appointed to a provicariate to assist the vicar with administrative work.","zh":"他被任命到一个 provicariate，协助本堂处理行政事务。"}]}],"synonyms":["vicariate","pro-vicarship","deputy vicariate"],"phonetic":"/ˌproʊ.vɪˈkɛri.ət/","extraExplanation":["这个词非常少见，多出现在特定教会体系的行政语境里。更常见、也更容易查到的相关词是 **vicariate（代牧区/教区中的代行单位）** 或 **vicarage（本堂神父住宅/堂区职务相关用语）**。","拼写上可能会见到带连字符的形式 **pro-vicariate**；不同教派与地区对 *vicar / pro-vicar* 的职称与职责划分也可能略有差异。"]}
{"word":"provid","summary":{"en":"“Provide” means to supply what is needed, to prepare/ensure for the future, or (formally) to specify a rule or condition.","zh":"“Provide”表示“提供所需之物”，也可表示“为将来做准备/确保”，在正式语境中还可表示“规定/约定”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give or supply something that is needed or wanted","zh":"提供；供给（所需或想要的东西）"},"examples":[{"en":"The school provides free lunch for students.","zh":"学校为学生提供免费午餐。"},{"en":"Can you provide more information about your plan?","zh":"你能提供更多关于你计划的信息吗？"},{"en":"This app provides a simple way to track expenses.","zh":"这个应用提供了一种简单的方式来记录开支。"}]},{"partOfSpeech":"v.","definition":{"en":"to make preparations for the future; to make sure something will be available","zh":"做准备；确保（某事物）将会有"},"examples":[{"en":"We should provide for emergencies by saving some money.","zh":"我们应该存点钱以备不时之需。"},{"en":"She provides for her family by working two jobs.","zh":"她做两份工作来养家。"}]},{"partOfSpeech":"vt.","definition":{"en":"to state or include something as a condition or requirement (often in formal writing)","zh":"规定；约定（常用于正式文件中）"},"examples":[{"en":"The contract provides that payment must be made within 30 days.","zh":"合同规定必须在30天内付款。"},{"en":"The policy provides for paid sick leave.","zh":"该政策规定带薪病假。"}]}],"synonyms":["supply","offer","furnish","give","make available"],"phonetic":"/prəˈvaɪd/","extraExplanation":["你输入的“provid”通常是拼写不完整，最常见的完整单词是 **provide**。","常见搭配：**provide A with B**（给A提供B）/ **provide B for A**（为A提供B）；例如：*They provided us with water.*（他们给我们提供了水。）","与“give”相比，**provide**更强调“满足需要、供给、保障”，语气更正式一些；在新闻、报告、说明书里很常见。"]}
{"word":"providable","summary":{"en":"“Providable” means “able to be provided or supplied,” often in formal or technical writing.","zh":"“Providable”表示“可提供/可供给的”，多用于较正式或技术性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be provided, supplied, or made available","zh":"可提供的；可供给的；可取得的"},"examples":[{"en":"This service is providable in most large cities.","zh":"这项服务在大多数大城市都可提供。"},{"en":"Additional seats are providable if enough people register early.","zh":"如果足够多人提前报名，就能提供额外座位。"},{"en":"The information is providable upon request.","zh":"该信息可应要求提供。"}]}],"synonyms":["available","obtainable","suppliable","deliverable"],"phonetic":"/prəˈvaɪdəbəl/","extraExplanation":["“providable”由动词 provide（提供）+ 形容词后缀 -able 构成，表示“能够被……的”。在日常英语中更常见的表达是 “available”（可获得的）或 “can be provided”（可以提供），而 “providable” 更常出现在较正式、技术或合同/政策类文本中。"]}
{"word":"providance","summary":{"en":"“Providence” means divine guidance/protection (or fate in a religious/literary sense) and is also the capital of Rhode Island.","zh":"“providence”指天意/神的眷顾（也可指带宗教或文学色彩的命运），同时也是美国罗德岛州首府普罗维登斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: providence) The helpful care or guidance believed to come from God or a higher power; divine protection.","zh":"（常见拼写：providence）指被认为来自上帝或更高力量的照顾与引导；天意、神的眷顾。"},"examples":[{"en":"They believed it was providence that kept them safe during the storm.","zh":"他们相信，是天意让他们在暴风雨中平安无事。"},{"en":"In many stories, providence rewards people who act with kindness.","zh":"在许多故事里，天意会回报那些善良行事的人。"}]},{"partOfSpeech":"n.","definition":{"en":"The natural order of events seen as guided by a higher purpose; fate (often used in a religious or literary tone).","zh":"（带宗教或文学色彩）指被视为有更高目的在引导的事件进程；命运。"},"examples":[{"en":"He trusted providence and stayed calm in difficult times.","zh":"他相信命运（天意），在艰难时期依然保持冷静。"},{"en":"The novel suggests that providence shapes the characters’ lives.","zh":"这部小说暗示，天意在塑造人物的人生。"}]},{"partOfSpeech":"n.","definition":{"en":"Providence: the capital city of Rhode Island, USA.","zh":"Providence：美国罗德岛州首府（普罗维登斯）。"},"examples":[{"en":"She moved to Providence for graduate school.","zh":"她为了读研究生搬到了普罗维登斯。"},{"en":"Providence is known for its universities and arts scene.","zh":"普罗维登斯以大学和艺术氛围闻名。"}]}],"synonyms":["divine guidance","divine care","God’s will","fate","destiny"],"phonetic":"/ˈprɑvəˌdəns/","extraExplanation":["“providance”通常被视为拼写错误，更常见的正确拼写是“providence”。","在英语文学中，“providence”常用来表达“上天安排/冥冥之中”的感觉，语气比日常的“luck（运气）”更庄重、带信仰色彩。"]}
{"word":"provide","summary":{"en":"“Provide” mainly means to give or make something available, and it can also mean to prepare for future needs or to stipulate something in a document.","zh":"“provide”主要表示“提供/供给”，也可表示“为将来需要做准备”，以及在合同或法律中“规定/条款要求”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To give or supply something that is needed; to make something available.","zh":"提供；供给（所需之物）；使……可获得。"},"examples":[{"en":"The school provides free lunches for students.","zh":"学校为学生提供免费午餐。"},{"en":"This website provides information about local events.","zh":"这个网站提供关于本地活动的信息。"},{"en":"They provide customers with technical support.","zh":"他们为客户提供技术支持。"}]},{"partOfSpeech":"vi.","definition":{"en":"To prepare for something in advance; to make arrangements.","zh":"预备；预先安排；做准备。"},"examples":[{"en":"We should provide for unexpected expenses.","zh":"我们应该为意外开支做准备。"},{"en":"She worked hard to provide for her family.","zh":"她努力工作来养家。"}]},{"partOfSpeech":"vt.","definition":{"en":"To state or require something in a rule, agreement, or law (often: “provide that”).","zh":"（法规/合同等）规定；条款要求（常用：provide that）。"},"examples":[{"en":"The contract provides that payment must be made within 30 days.","zh":"合同规定必须在30天内付款。"},{"en":"The policy provides for paid sick leave.","zh":"该政策规定有带薪病假。"}]}],"synonyms":["give","offer","supply","furnish","make available","equip","stipulate"],"phonetic":"/prəˈvaɪd/","extraExplanation":["常见搭配：provide + 名词（provide help/food/information）；provide A for B（为B提供A）；provide B with A（给B提供A），两种结构意思相同。","provide 与 supply 很接近：provide 更强调“让某物可用/满足需要”，语气稍正式；supply 更常强调“持续供应/供给来源”。","provide for 既可表示“为……提供所需”（provide for your family 养家），也可表示“为……做准备”（provide for emergencies 为紧急情况预备）。"]}
{"word":"provided","summary":{"en":"“Provided” most often means “given/supplied,” and it also functions as the past participle of “provide.”","zh":"“provided”最常见表示“提供的/给出的”，也可作“provide”的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given or supplied (often as information, help, or something offered)","zh":"提供的；给出的（常指信息、帮助或所给之物）"},"examples":[{"en":"The evidence provided by the witness was clear and detailed.","zh":"证人提供的证据清晰而详尽。"},{"en":"Please read the instructions provided on the first page.","zh":"请阅读第一页所提供的说明。"}]},{"partOfSpeech":"v.","definition":{"en":"past participle of “provide”: to give or supply something","zh":"“provide”的过去分词：提供；供给"},"examples":[{"en":"The school has provided free lunches for students.","zh":"学校已为学生提供免费午餐。"},{"en":"They provided support during a difficult time.","zh":"他们在艰难时期提供了支持。"}]}],"synonyms":["given","supplied","offered","furnished"],"phonetic":"/prəˈvaɪdɪd/","extraExplanation":["在学术写作和说明文中，provided 常用来修饰名词（如 provided information / provided materials），语气比 given 更正式一点。","provided that 是常见固定搭配，意思是“只要……（条件是……）”。例如：You can go out provided that you finish your homework.（只要你写完作业就可以出去。）"]}
{"word":"Providence","summary":{"en":"Providence most commonly means divine guidance or protection; it can also mean foresight/planning, and it’s also the name of the capital of Rhode Island.","zh":"Providence 常指“天意/上帝的眷顾与安排”；也可指“远见、周密筹划”；同时还是美国罗得岛州首府“普罗维登斯”的城市名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the care and guidance believed to come from God or a higher power; divine protection and planning","zh":"（常指上帝的）眷顾、庇佑；天意、神意（带有引导与安排之意）"},"examples":[{"en":"She trusted in Providence during difficult times.","zh":"在艰难时期，她相信天意会眷顾她。"},{"en":"By Providence, no one was hurt in the accident.","zh":"多亏天意庇佑，那场事故中无人受伤。"}]},{"partOfSpeech":"n.","definition":{"en":"careful planning or preparation for the future; foresight","zh":"周密筹划；未雨绸缪；远见"},"examples":[{"en":"Good Providence means saving money for emergencies.","zh":"有远见就是为紧急情况存钱。"},{"en":"With a little providence, the trip went smoothly.","zh":"稍作周全准备，旅程就很顺利。"}]},{"partOfSpeech":"n.","definition":{"en":"Providence: the capital city of Rhode Island in the United States","zh":"普罗维登斯：美国罗得岛州首府（城市名）"},"examples":[{"en":"He moved to Providence for graduate school.","zh":"他为了读研究生搬到了普罗维登斯。"}]}],"synonyms":["divine will","fate","luck","guidance","foresight","prudence"],"phonetic":"/ˈprɑvɪdəns/","extraExplanation":["“Providence”表示“天意/神意”时，常见于较正式、带宗教色彩或文学性的语境（如早期美国清教徒写作、经典小说等）。现代日常口语里，如果不想带宗教意味，更常用 luck（运气）、good fortune（好运）、fate（命运）等词。","词源上来自拉丁语 pro-（向前）+ videre（看见），本义接近“预见、前瞻”，所以它也能引申出“未雨绸缪、周密安排”的意思。","文学中常见搭配：the hand of Providence（上帝之手/冥冥之中的安排）、by Providence（蒙天意庇佑/出于天意）。"]}
{"word":"providence","summary":{"en":"Providence most often means divine guidance or God’s care; it can also mean prudent planning, or the U.S. city Providence (Rhode Island).","zh":"providence 最常指“天意/神意（上帝的眷顾与安排）”；也可指“远见、周全的规划”；或指美国城市“普罗维登斯（罗得岛州首府）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"God or a divine power thought to guide and care for people and the world; divine guidance.","zh":"（常大写）上帝；神意；天意（被认为在引导并照顾人类与世界的神圣力量）。"},"examples":[{"en":"They believed that Providence would protect them during the journey.","zh":"他们相信天意会在旅途中保护他们。"},{"en":"In the novel, the hero trusts in Providence when everything seems lost.","zh":"在小说里，当一切看似无望时，主人公仍信赖天意。"}]},{"partOfSpeech":"n.","definition":{"en":"careful planning and preparation for the future; prudence.","zh":"远见；谨慎周全的规划与准备。"},"examples":[{"en":"With a little providence, you can avoid many financial problems.","zh":"只要多一点远见，就能避免许多财务问题。"},{"en":"Saving money for emergencies is an act of providence.","zh":"为紧急情况存钱是一种有远见的做法。"}]},{"partOfSpeech":"n.","definition":{"en":"Providence: the capital city of Rhode Island in the United States.","zh":"普罗维登斯：美国罗得岛州的首府。"},"examples":[{"en":"She moved to Providence for graduate school.","zh":"她为了读研究生搬到了普罗维登斯。"},{"en":"Providence is known for its universities and arts scene.","zh":"普罗维登斯以其大学与艺术氛围而闻名。"}]}],"synonyms":["divine guidance","fate","destiny","protection","prudence","foresight"],"phonetic":"/ˈprɑvədəns/","extraExplanation":["当作“天意/神意”时，Providence 常大写，语气较文学、宗教或较正式；日常口语里更常说 fate（命运）、luck（运气）或 God’s plan（上帝的计划）。","词源来自拉丁语 pro-（向前）+ videre（看见），本义有“预见、先见之明”的含义，因此也引申出“谨慎周全的准备”。","文学语境里常见搭配：trust in Providence（信赖天意）、by Providence（出于天意/靠天意）。在一些经典作品与宗教写作中，Providence 表示“上帝的眷顾与安排”。"]}
{"word":"providences","summary":{"en":"“Providences” is the plural of “providence,” meaning either divine guidance (“God’s providence”) or careful planning for the future (foresight).","zh":"“Providences”是“providence”的复数，可指“天意/神的眷顾与安排”，也可指“未雨绸缪的周密打算（远见）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of providence) God’s care and guidance, especially the belief that events are directed for a good purpose.","zh":"（providence 的复数）上天/神的眷顾与指引；尤其指相信世事在神的安排下朝向善的结果。"},"examples":[{"en":"Many people took their survival as one of the providences of God.","zh":"许多人把自己的幸存看作是上帝眷顾的体现之一。"},{"en":"In the story, several providences help the lost traveler find his way home.","zh":"在故事里，几次“天意的安排”帮助迷路的旅人找到回家的路。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of providence) Careful planning or preparation for the future; foresight.","zh":"（providence 的复数）对未来的周密打算；远见；未雨绸缪。"},"examples":[{"en":"Good providences can prevent money problems later.","zh":"良好的未雨绸缪可以避免日后的财务麻烦。"},{"en":"Her providences included saving regularly and learning new skills.","zh":"她的长远打算包括定期储蓄和学习新技能。"}]}],"synonyms":["divine guidance","fate (religious/poetic)","foresight","prudence","planning"],"phonetic":"/ˈprɑvədəns/","extraExplanation":["“Providence”常见两种用法：小写 providence 多指“远见/谋划”或“天意”；大写 Providence 常指宗教语境中的“上帝的眷顾（Divine Providence）”。","“Providence”还是美国罗德岛州首府的城市名（Providence, Rhode Island）；如果你指的是地名，通常不会用复数 providences。"]}
{"word":"provident","summary":{"en":"Provident means planning ahead and preparing for the future, especially by saving money or taking timely precautions.","zh":"Provident 指为未来提前规划并做好准备，尤指在金钱上节俭储蓄或采取及时的预防措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful about planning for the future, especially by saving money or preparing ahead.","zh":"（尤指在钱财方面）有远见的；为将来打算的；节俭并提前准备的。"},"examples":[{"en":"She is provident and saves a little from every paycheck.","zh":"她很有远见，每次领薪水都会存一点钱。"},{"en":"A provident family plans meals and avoids wasting food.","zh":"有规划的家庭会提前安排餐食，避免浪费食物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Providing what is needed; making timely preparations (often used in formal writing).","zh":"（较正式）提供所需的；及时准备周到的。"},"examples":[{"en":"The provident measures helped the town prepare for the storm.","zh":"这些周到的措施帮助小镇为暴风雨做好了准备。"},{"en":"His provident advice prevented bigger problems later.","zh":"他那及时周到的建议避免了日后更大的问题。"}]}],"synonyms":["prudent","thrifty","frugal","foresighted"],"phonetic":"/ˈprɑvədənt/","extraExplanation":["“provident”常和“frugal（节俭的）”相近，但语气更偏“有计划、为未来做准备”，不一定是“省到很刻苦”。","常见搭配：provident person（有远见的人）、provident planning（周全的规划）、provide for the future（为未来做准备）。注意：provide是动词“提供”，provident是形容词“有远见/有准备的”。"]}
{"word":"providential","summary":{"en":"Providential describes something that happens at just the right time and seems guided by God or fate.","zh":"Providential 用来形容某事发生得恰到好处，仿佛由上帝或命运所安排。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of something that happens) seeming to be arranged or guided by God or by a helpful fate, especially at exactly the right time.","zh":"（事件）看似由上帝或某种有利的命运所安排或引导的，尤指在恰到好处的时机发生的。"},"examples":[{"en":"Meeting her on the first day felt providential, as if it was meant to happen.","zh":"第一天就遇见她让人觉得很神来之笔，仿佛注定会发生。"},{"en":"A providential break in the weather allowed the rescue team to land safely.","zh":"天气恰好转好，这个“天助”的转机让救援队得以安全降落。"},{"en":"He called it a providential sign that the lost document turned up right before the deadline.","zh":"他称这为“天意的征兆”：丢失的文件在截止前刚好出现。"}]}],"synonyms":["timely","opportune","fortuitous","fortunate"],"phonetic":"/ˌprɑvɪˈdɛnʃəl/","extraExplanation":["“providential”来自“Providence（天意/神的安排）”。在英语文化里，它常带有宗教色彩（基督教语境尤多），也可以较中性地表示“幸运而及时的巧合”。","语气上比“lucky（幸运的）”更正式、更带“似乎有更高力量在安排”的意味；在非宗教语境中使用时，注意听者可能仍会感到它有“宿命/神意”的暗示。","相关表达：by providence（凭天意/冥冥之中）；a providential coincidence（天助般的巧合）。近义词：timely, opportune, fortunate。反义倾向：unlucky, ill-fated。"]}
{"word":"providentialism","summary":{"en":"Providentialism is the belief or viewpoint that events are directed by divine providence toward a purposeful plan.","zh":"Providentialism 指相信或主張世事在神意／天意的引導下，朝某種目的性的計畫發展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that events in history and in individual lives are guided by God (or a higher power) according to a purposeful plan.","zh":"天意論／神意論：認為歷史事件與個人遭遇都在上帝（或更高力量）的引導之下，並遵循某種有目的的計畫。"},"examples":[{"en":"Some historians criticize providentialism for explaining complex events as “God’s plan.”","zh":"一些歷史學者批評天意論，因為它把複雜事件簡化成「上帝的安排」。"},{"en":"In his sermons, he used providentialism to comfort people after the disaster.","zh":"在講道中，他以天意論安慰災後的人們。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of interpreting politics or social change as being directed toward a morally “right” outcome by divine guidance, often used to justify national missions or leaders’ actions.","zh":"一種政治／社會解讀方式：把政治或社會變遷視為在神意引導下走向「道德上正確」的結果；有時用來正當化國家使命或領導者的作為。"},"examples":[{"en":"The speech had a tone of providentialism, portraying the nation’s expansion as destiny.","zh":"那篇演說帶有天意論色彩，把國家的擴張描繪成命定之事。"},{"en":"Critics argued that providentialism can excuse harmful policies by calling them inevitable.","zh":"批評者指出，天意論可能以「不可避免」之名替有害政策開脫。"}]}],"synonyms":["belief in divine providence","providence-centered view","teleological (purpose-driven) interpretation","theological determinism"],"phonetic":"/ˌprɑːvəˈdɛnʃəˌlɪzəm/","extraExplanation":["「providentialism」來自 *providence*（上帝的眷顧／天意）。它常見於宗教語境與某些歷史書寫方式：用「神意」來解釋戰爭、災難、王朝興衰等事件。","在學術寫作中，若作者強調多重原因（經濟、政治、科技、制度等），通常會避免使用帶強烈目的論色彩的天意論說法；但在宗教文本、佈道、或某些政治修辭中仍很常見。"]}
{"word":"providentially","summary":{"en":"Providentially means “as if guided by divine help or fate,” often describing a lucky, well-timed event.","zh":"providentially 表示“仿佛天意/神的眷顾般地”，常用于描述幸运且恰逢其时的事情。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that seems guided by God or by a helpful force of fate; happening at just the right time.","zh":"以一种似乎受到上帝引导或命运眷顾的方式；恰到好处、及时地发生。"},"examples":[{"en":"Providentially, a doctor was on the flight when the passenger got sick.","zh":"幸好（像是天意安排般地），那位乘客生病时，航班上正好有医生。"},{"en":"We arrived providentially before the storm closed the roads.","zh":"我们像是天意眷顾般地，刚好在暴风雨封路前赶到。"}]}],"synonyms":["fortunately","luckily","happily","as it happened","by good fortune"],"phonetic":"/ˌprɑvɪˈdɛnʃəli/","extraExplanation":["“providentially”来自“providence（天意、神的眷顾）”。它常用来表达一种带有宗教或宿命色彩的“幸好、正巧”，比“fortunately”更强调“像被安排好的一样”。","语气提醒：在多元文化语境中，这个词可能暗含宗教立场；如果想更中性，可用“fortunately / luckily / as it happened”。"]}
{"word":"providently","summary":{"en":"“Providently” means “wisely with foresight,” and sometimes (in literary/religious contexts) “as if guided by providence.”","zh":"“providently”指“有远见、明智地（为未来做准备）”；在文学/宗教语境中也可指“仿佛受到天意安排/庇佑地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows good judgment and careful planning for the future; wisely and cautiously.","zh":"以有远见、谨慎周全的方式；明智而稳妥地。"},"examples":[{"en":"She invested providently, saving money for emergencies.","zh":"她很有远见地投资，为紧急情况存钱。"},{"en":"The company providently set aside funds before the market changed.","zh":"公司有先见之明地在市场变化前预留了资金。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Less common) In a way that suggests God or fate is providing or guiding events.","zh":"（较少见）以带有“天意/神意安排、庇佑”的意味；仿佛受到上天指引地。"},"examples":[{"en":"Providently, a neighbor arrived just as we needed help.","zh":"仿佛天意般，邻居正好在我们需要帮助时赶到。"},{"en":"In the novel, the hero is providently rescued at the last moment.","zh":"在小说里，主人公在最后一刻仿佛被天意般地救下。"}]}],"synonyms":["wisely","prudently","foresightedly","cautiously","sensibly"],"phonetic":"/ˈprɑvədəntli/","extraExplanation":["“providently”来自“providence”（天意、上天的安排/眷顾）与“provide”（供给、准备）。在现代日常英语中，它更常表达“有远见地、未雨绸缪地”，带有理性规划的语气；而在文学或宗教语境中，可能更强调“冥冥之中被照顾/被安排”。","常见搭配：providently + save/invest/plan/set aside（有远见地存钱/投资/计划/预留）。","相关词对比：prudently（谨慎地）更偏“避免风险”；providently（有远见地）更偏“为未来做准备”。"]}
{"word":"providentness","summary":{"en":"Providentness means being wisely prepared for the future, especially with money or resources.","zh":"Providentness 指为未来做准备的周到与节俭，尤指金钱或资源管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being provident: careful and wise about planning for the future, especially in managing money or resources.","zh":"有远见与节俭的品质；做事周到、为未来打算（尤指理财或资源管理）"},"examples":[{"en":"Her providentness helped the family save enough for emergencies.","zh":"她的未雨绸缪让家里存下了足够的应急钱。"},{"en":"In uncertain times, providentness can mean spending less and saving more.","zh":"在不确定的时期，有远见的做法往往是少花钱、多储蓄。"}]}],"synonyms":["prudence","thrift","foresight","frugality"],"phonetic":"/ˈprɑvɪdəntnəs/","extraExplanation":["“providentness”来自形容词“provident”（有远见的、节俭的）+ 名词后缀“-ness”。日常英语里更常用“prudence”（谨慎）或“thrift”（节俭），而“providentness”显得更书面、更少见。","相关词义区分：\n- providentness：强调“为将来做准备”的周到与节制（计划性强）。\n- thrift：更偏“节俭、省钱”的习惯。\n- prudence：更广泛的“谨慎判断”，不只限于金钱。","常见搭配（更自然）：financial prudence（理财谨慎）、a provident person（有远见的人）、live thriftily（过得节俭）。"]}
{"word":"provider","summary":{"en":"A provider is a person or organization that supplies a service or something needed, especially a company offering ongoing services (like internet or healthcare).","zh":"provider 指提供服务或所需资源的人或机构，常指持续提供服务的公司（如网络或医疗服务提供者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that supplies something (such as a service, information, or money)","zh":"提供者；供应方（提供服务、信息或资金等的人或机构）"},"examples":[{"en":"The city is the main provider of public transportation.","zh":"市政府是公共交通的主要提供方。"},{"en":"Health care providers must protect patient privacy.","zh":"医疗服务提供者必须保护病人隐私。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in technology) a company that offers a specific service, such as internet, cloud computing, or phone service","zh":"（尤指科技领域）服务商；运营商（如互联网、云服务或电话服务公司）"},"examples":[{"en":"We changed our internet provider to get faster speeds.","zh":"我们换了网络服务商来获得更快的网速。"},{"en":"Choose a cloud provider that meets your security needs.","zh":"选择一个符合你安全需求的云服务提供商。"}]}],"synonyms":["supplier","vendor","service provider","operator"],"phonetic":"/prəˈvaɪdər/","extraExplanation":["“Provider”来自动词 provide（提供）+ 名词后缀 -er（做某事的人/物），字面意思是“提供的人/机构”。","在日常英语里，provider 常带有“长期、持续供给服务”的感觉，因此比 seller（卖家）更偏“服务/支持”。","常见搭配：service provider（服务提供商）、internet provider（网络服务商）、content provider（内容提供方）、healthcare provider（医疗服务提供者）。"]}
{"word":"providere","summary":{"en":"“Providere” is usually a misspelling of “provide,” meaning to supply, make available, or prepare for needs.","zh":"“providere”通常是“provide”的拼写错误，意思是提供、使可用或为需要做准备。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Common spelling: provide) To give someone something they need; to supply.","zh":"（常见拼写：provide）提供（某人所需之物）；供给。"},"examples":[{"en":"The school provides free lunch for students.","zh":"学校为学生提供免费午餐。"},{"en":"Can you provide more information?","zh":"你能提供更多信息吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something available or arrange for it to happen.","zh":"使某事可用；安排使某事发生。"},"examples":[{"en":"The hotel provides a shuttle to the airport.","zh":"酒店提供去机场的接驳车。"},{"en":"The plan provides for emergency support.","zh":"该计划安排了紧急支援。"}]},{"partOfSpeech":"vi.","definition":{"en":"To prepare for the future; to take steps in advance (often used with “for”).","zh":"为未来做准备；预先采取措施（常与 for 连用）。"},"examples":[{"en":"Parents try to provide for their children’s education.","zh":"父母会尽力为孩子的教育做准备。"},{"en":"It’s wise to provide for unexpected expenses.","zh":"为意外开支做准备是明智的。"}]}],"synonyms":["supply","offer","give","furnish","make available"],"phonetic":"/prəˈvaɪd/","extraExplanation":["“providere”不是标准英语单词，通常是把 provide 或 provider 拼错了。","provide = 动词“提供”；provider = 名词“供应者/服务提供方”（如 internet service provider）。","常见搭配：provide sb. with sth.（为某人提供某物）；provide sth. for sb.（为某人提供某物）；provide for（为……作安排/供养）。"]}
{"word":"providers","summary":{"en":"Providers are people or organizations that supply services, resources, or goods; in healthcare, it often means doctors, clinics, or hospitals.","zh":"Providers 指提供服务、资源或产品的人或机构；在医疗语境中常指医生、诊所或医院等医疗服务提供方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or organizations that supply a service, resource, or product to others (often regularly).","zh":"（经常性地）提供服务、资源或产品的人或机构；供应方。"},"examples":[{"en":"Internet providers offer different speeds and prices.","zh":"互联网服务提供商提供不同的网速和价格。"},{"en":"The hospital works with several medical equipment providers.","zh":"这家医院与多家医疗设备供应商合作。"}]},{"partOfSpeech":"n.","definition":{"en":"In insurance or healthcare, companies or professionals that deliver medical services (for example, doctors, clinics, hospitals).","zh":"（保险/医疗语境）医疗服务提供方（如医生、诊所、医院等）。"},"examples":[{"en":"Check if the provider is in your insurance network.","zh":"请确认该医疗服务提供方是否在你的保险网络内。"},{"en":"Primary care providers can refer you to a specialist.","zh":"初级保健医生（医疗服务提供方）可以把你转诊给专科医生。"}]}],"synonyms":["suppliers","vendors","service providers","providers (healthcare context: practitioners)"],"phonetic":"/prəˈvaɪdərz/","extraExplanation":["“providers”是复数形式，单数是“provider”。常见搭配：service provider（服务提供商）、internet provider/ISP（互联网服务提供商）、cloud provider（云服务商）、energy provider（能源供应商）。","在美国语境里，“provider”在医疗领域非常常用，既可指机构（clinic/hospital），也可指个人（doctor/nurse practitioner 等）。","如果你想表达“供应商（给企业供货的）”，也常用“supplier/vendor”；“provider”更偏“提供服务”。"]}
{"word":"provides","summary":{"en":"“provides” means “gives or supplies” or “makes available/ensures,” used with he/she/it.","zh":"“provides”表示“提供/供给”或“安排妥当/确保”，是provide的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give or supply something that is needed or wanted; to make something available","zh":"提供；供给（所需或想要的东西）；使可获得"},"examples":[{"en":"The school provides free lunch for students.","zh":"学校为学生提供免费午餐。"},{"en":"This app provides useful study tools.","zh":"这个应用提供有用的学习工具。"}]},{"partOfSpeech":"v.","definition":{"en":"to make arrangements so that something can happen; to ensure that something is ready","zh":"做好准备；安排妥当；确保某事能够发生"},"examples":[{"en":"The guide provides a clear plan for your first week.","zh":"这份指南为你的第一周提供了清晰的计划。"},{"en":"The contract provides for regular breaks.","zh":"合同规定（安排）定期休息。"}]}],"synonyms":["supplies","gives","offers","delivers","furnishes"],"phonetic":"/prəˈvaɪdz/","extraExplanation":["“provides”是动词“provide”的第三人称单数形式（he/she/it provides）。常见搭配：provide sth (to/for sb)（向某人提供某物），provide for sb（供养/养活某人），以及法律/正式语体中的provide that…（规定/条件是……）。"]}
{"word":"providing","summary":{"en":"“Providing” means giving or supplying something, often help, services, or information; in formal language it can also mean “to make provisions for.”","zh":"“Providing”指“提供/供给”，常用于提供帮助、服务或信息；在正式语境中也可表示“为……作安排/规定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving or supplying something (often a service, help, or information)","zh":"提供；供给（常指服务、帮助或信息的提供）"},"examples":[{"en":"Thank you for providing the documents on time.","zh":"谢谢你按时提供文件。"},{"en":"The hotel is providing free breakfast for all guests.","zh":"这家酒店为所有住客提供免费早餐。"},{"en":"We aim to provide support to new students.","zh":"我们旨在为新生提供支持。"}]},{"partOfSpeech":"v.","definition":{"en":"giving or supplying something; making something available","zh":"提供；供给；使可获得"},"examples":[{"en":"She is providing childcare while her sister works.","zh":"她在姐姐工作时提供照看孩子的帮助。"},{"en":"The guide is providing useful local tips.","zh":"导游正在提供有用的本地建议。"},{"en":"This program is providing jobs for young people.","zh":"这个项目正在为年轻人提供工作机会。"}]},{"partOfSpeech":"v.","definition":{"en":"including something needed; making sure something exists or is ready (often used in formal rules or agreements)","zh":"规定；预备；确保具备（常用于正式条款或协议中）"},"examples":[{"en":"The contract provides for paid vacation.","zh":"合同规定带薪休假。"},{"en":"The plan provides for emergency supplies.","zh":"该计划预备了应急物资。"}]}],"synonyms":["supplying","giving","furnishing","offering","delivering","making available"],"phonetic":"/prəˈvaɪdɪŋ/","extraExplanation":["“providing”是动词“provide”的现在分词/动名词形式：\n- 作名词用（动名词）：Providing clean water is important.（提供清洁用水很重要。）\n- 作动词用（现在进行时的一部分）：They are providing meals.（他们正在提供餐食。）\n\n常见搭配：provide sth (for sb)（为某人提供某物）；provide sb with sth（给某人提供某物）；provide for…（供养/为……做准备/规定）。\n\n注意与“offer”的区别：provide 更强调“供应/使具备”（往往更持续、必要），offer 更强调“主动提出/提供机会”。"]}
{"word":"providore","summary":{"en":"A providore is a (mainly Australian/NZ) supplier or purveyor of food and provisions, sometimes referring to a specialty food shop.","zh":"Providore 主要在澳新英语中指食品/物资供应商，也可指售卖特色食品的店铺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand) a supplier of food or provisions; a purveyor, often for a restaurant, café, or ship.","zh":"（澳大利亚/新西兰）食品或日用品的供应商；供货商（常指为餐馆、咖啡馆或船只供货的人/公司）。"},"examples":[{"en":"The café changed its providore to get fresher bread and dairy.","zh":"这家咖啡馆更换了供货商，以获得更新鲜的面包和乳制品。"},{"en":"Local farms act as providores for many city restaurants.","zh":"许多城市餐馆的食材由本地农场供货。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a shop or business that sells specialty food products; a deli-style store.","zh":"（较少见）出售特色食品的店铺；类似熟食店/精品食材店。"},"examples":[{"en":"We stopped at a small providore for olive oil and cheese.","zh":"我们在一家小食材店买了橄榄油和奶酪。"}]}],"synonyms":["supplier","purveyor","vendor","caterer","provisioner"],"phonetic":"ˈprɑːvəˌdɔːr","extraExplanation":["“Providore”在英式/澳新英语里更常见；在美式英语中更常用 supplier、purveyor 或 vendor 来表达类似意思。","词源与葡萄牙语 provedor（供给者、管理供给的人）有关，历史上也常用于航海语境，指负责船只补给的人或机构。"]}
{"word":"providoring","summary":{"en":"“Providoring” isn’t a standard word; it’s likely a misspelling of “providing,” which means supplying something or (more formally) “as long as / if.”","zh":"“providoring” 不是标准词，可能是 “providing” 的拼写错误；“providing” 可表示“提供”，也可更正式地表示“只要/如果”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Likely a misspelling of “providing,” the -ing form of “provide,” meaning to give or supply something, or to make something available.","zh":"（不是标准英文词）很可能是把 “providing” 拼错了。“providing” 是动词 “provide” 的 -ing 形式，意思是“提供/供给”，或“使……可用”。"},"examples":[{"en":"The school is providing free lunches for students.","zh":"学校正在为学生提供免费午餐。"},{"en":"We are providing the information you requested.","zh":"我们正在提供你所要求的信息。"},{"en":"Providing clear instructions helps everyone work faster.","zh":"提供清晰的说明能帮助大家更快完成工作。"}]},{"partOfSpeech":"conj.","definition":{"en":"(Providing = “if / on the condition that”) used to say something is true only when a condition is met.","zh":"（providing 表示“如果/只要”）用于说明只有在满足某个条件时某事才成立。"},"examples":[{"en":"You can go out, providing you finish your homework first.","zh":"你可以出去，只要你先把作业写完。"},{"en":"We’ll accept the offer, providing the price stays the same.","zh":"只要价格不变，我们就接受这个报价。"}]}],"synonyms":["supplying","giving","offering","as long as","if"],"phonetic":"/prəˈvaɪd/","extraExplanation":["“providing” 作为“如果/只要”时，更正式一些，常见于书面或较正式的口语；日常对话里也常用 “as long as”。","如果你原本想写的是 “provider”（提供者/供应商）或 “provision”（供给/规定），告诉我具体句子，我可以帮你选最准确的词。"]}
{"word":"province","summary":{"en":"A province is usually a major administrative region of a country; it can also mean areas outside the capital or big cities.","zh":"province通常指国家的省级行政区；也可指首都或大城市以外的“外省/地方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large administrative area within a country, similar to a state or region","zh":"（国家内的）省；大行政区（类似“州/地区”）"},"examples":[{"en":"Sichuan is a province in China.","zh":"四川是中国的一个省。"},{"en":"The government sent supplies to several provinces after the storm.","zh":"暴风雨过后，政府向几个省份运送了物资。"}]},{"partOfSpeech":"n.","definition":{"en":"the countryside or areas outside the capital or major cities; a region away from the center of power and culture","zh":"（常作the provinces）外省；地方；首都/大城市以外的地区（相对中心城市）"},"examples":[{"en":"She moved from the capital to the provinces for a quieter life.","zh":"她从首都搬到外省，想过更安静的生活。"},{"en":"The play was popular in the provinces before it reached New York.","zh":"这部戏在到达纽约之前，先在外地走红。"}]}],"synonyms":["region","state","territory","district"],"phonetic":"/ˈprɑːvɪns/","extraExplanation":["英美语境里，\"province\"常用来指别国的行政区（如加拿大的 provinces）。在美国国内更常说 \"state\"；在英国历史上可用 \"the provinces\" 指伦敦以外的地区。","引申义里，\"provincial\"（形容词）有时带轻微贬义，表示“地方性的、见识不广的”，使用时注意语气与场合。"]}
{"word":"provinces","summary":{"en":"“Provinces” is the plural of “province,” meaning administrative regions of a country, or (often in British English) areas outside major cities/capital.","zh":"“provinces”是“province”的复数，常指一个国家的行政区（省等），也可指（多见英式英语）大城市/首都之外的地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main administrative region of a country (often smaller than a state), usually governed as a local unit.","zh":"省；一个国家的主要行政区（常比“州”小），通常作为地方单位管理。"},"examples":[{"en":"Canada is divided into provinces and territories.","zh":"加拿大分为各省和地区。"},{"en":"She grew up in a small town in one of China’s provinces.","zh":"她在中国某个省的小城镇长大。"}]},{"partOfSpeech":"n.","definition":{"en":"Areas outside the capital or major cities; the countryside or less central parts of a country (often used in British English).","zh":"外省地区；首都或大城市以外的地方（常见于英式英语）。"},"examples":[{"en":"He was sent to work in the provinces for a few years.","zh":"他被派到外省工作了几年。"},{"en":"News from the provinces reached the capital slowly in earlier times.","zh":"在早些时候，来自外省的消息传到首都很慢。"}]}],"synonyms":["regions","administrative divisions","territories","states (in some contexts)"],"phonetic":"/ˈprɑvɪnsɪz/","extraExplanation":["“provinces”是“province”的复数。不同国家对“province”的对应行政级别不同：例如加拿大用province；美国更常用state；英国历史语境里也会用the provinces来指伦敦以外的地区。"]}
{"word":"provincia","summary":{"en":"“provincia” is Spanish for “province,” meaning an administrative region of a country.","zh":"“provincia”是西语，意思是“省/行政区”，相当于英语的“province”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a province; an administrative region of a country, usually smaller than a state or nation.","zh":"（西语）省；（国家的）行政区，通常小于国家、在一些国家也可能相当于“州”的一级或次一级行政区。"},"examples":[{"en":"In Spain, each provincia has its own capital city.","zh":"在西班牙，每个省（provincia）都有自己的省会城市。"},{"en":"She moved from the capital to a small provincia for a quieter life.","zh":"她从首都搬到一个小省（provincia），过更安静的生活。"}]}],"synonyms":["province","region","administrative area"],"phonetic":"/ˈprɑːvɪns/","extraExplanation":["“provincia”是西班牙语常用词，对应英语的“province”。在不同国家，“province”的具体行政级别不完全一样：例如加拿大常用“province”（省），而美国更常用“state”（州）。","词源上与拉丁语“provincia”有关，最初指罗马的“行省/管辖区域”，后来泛指国家的行政区域。"]}
{"word":"provincial","summary":{"en":"Provincial means (1) related to a province or area outside the capital, or (2) (often negatively) narrow-minded or unsophisticated.","zh":"provincial可指（1）省级/地方性的；也可指（2）（常含贬义）眼界狭隘、不够开阔的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with a province or a region outside a country’s capital; relating to local (not national) government or life in the provinces.","zh":"与（国家的）省份或首都以外的地区有关的；地方性的（非全国性的）；与地方政府或地方生活有关的。"},"examples":[{"en":"The provincial government announced a new public health policy.","zh":"省政府宣布了一项新的公共卫生政策。"},{"en":"She works in a provincial town far from the capital.","zh":"她在一个远离首都的地方小镇工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often negative) Narrow in interests or experience; not familiar with wider ideas, culture, or ways of life.","zh":"（常含贬义）见识狭隘的；不够开阔、不熟悉更广阔文化或观念的。"},"examples":[{"en":"He had a provincial attitude and rarely traveled.","zh":"他态度有些狭隘，也很少旅行。"},{"en":"The critic said the show felt provincial compared with major-city productions.","zh":"评论家说，与大城市的制作相比，这个演出显得有点“地方化”、格局不大。"}]}],"synonyms":["regional","local","parochial","nonmetropolitan"],"phonetic":"/prəˈvɪnʃəl/","extraExplanation":["“provincial”在英语里既可以是中性词（表示“省级/地方的”），也可以带评价色彩（表示“眼界不够开阔”）。在正式语境（新闻、政府、公文）里通常是中性；在评价人的观念或作品时更可能带贬义。","常见搭配：provincial government（省政府/地方政府）、provincial capital（省会）、provincial election（地方选举）、provincial accent（地方口音）。注意：说provincial accent通常是“地方口音”的事实描述，但在某些语境里也可能被听成带偏见，使用时要看场合。","词源提示：来自“province（省份/外省）”。在一些文化语境中，“首都/大城市 vs. 外省”会被用来暗示资源、时尚或文化中心的差异，因此provincial有时会引出“非中心、没见过世面”的联想。"]}
{"word":"provincialate","summary":{"en":"Provincialate means the office/term (and sometimes the headquarters) of a provincial, a regional superior in certain religious orders.","zh":"Provincialate 指某些修会中“省会长”（区域负责人）的职务与任期（有时也指其驻地/总部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, term, or administration of a provincial (a regional superior) in certain religious orders","zh":"（某些天主教修会中）省会长／省会长职务的任期或其管理机构"},"examples":[{"en":"During her provincialate, she focused on training new members and supporting local communities.","zh":"在她担任省会长期间，她重点培训新成员并支持当地团体。"},{"en":"The archives include letters from his provincialate in the 1980s.","zh":"档案中包含他在20世纪80年代省会长任期内的信件。"}]},{"partOfSpeech":"n.","definition":{"en":"the headquarters or residence associated with a provincial’s leadership (less common)","zh":"（较少用）省会长的驻地或与其领导相关的总部／居所"},"examples":[{"en":"Visitors were received at the provincialate before meeting the regional leaders.","zh":"访客先在省会长驻地接待处办理，再与地区负责人会面。"}]}],"synonyms":["provincial office","provincial leadership","provincial term","provincial headquarters"],"phonetic":"/prəˈvɪnʃəˌleɪt/","extraExplanation":["“provincialate”主要用于宗教语境，尤其见于天主教修会（如耶稣会、道明会等）的组织结构中：一个修会常按地区分为“province（省区）”，由“provincial（省会长）”负责。","不要把这里的“provincial”误解为“乡下的、地方性的”（常见形容词义）。在本词中，它是职务名称，强调“区域行政负责人”。"]}
{"word":"provincialism","summary":{"en":"Provincialism means either narrow, local-minded thinking or a region-specific word/expression.","zh":"provincialism 可指地方主义/眼界狭隘，也可指某地区特有的用词（地方用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong focus on local interests, ideas, or traditions, sometimes showing a narrow or limited view of the wider world.","zh":"地方主义；（有时带贬义）眼界狭隘、只关注本地利益或观念。"},"examples":[{"en":"The article criticizes the school system for provincialism and a lack of global perspective.","zh":"这篇文章批评该教育体系地方主义严重，缺乏全球视野。"},{"en":"Travel can help people move beyond provincialism by meeting different cultures.","zh":"旅行能帮助人们通过接触不同文化来走出狭隘的地方观念。"}]},{"partOfSpeech":"n.","definition":{"en":"A word, expression, or language feature used mainly in a particular region and not widely used elsewhere.","zh":"地方用语；方言词（主要在某一地区使用、在其他地方不常用的词或表达）。"},"examples":[{"en":"“Pop” for a sweet fizzy drink is a provincialism in some parts of the United States.","zh":"在美国一些地区，用“pop”指甜味汽水是一种地方用语。"},{"en":"The translator avoided provincialisms to make the dialogue understandable to a wider audience.","zh":"译者避免使用地方用语，以便让更广泛的读者理解对话。"}]}],"synonyms":["parochialism","localism","regionalism","dialectal expression"],"phonetic":"/prəˈvɪnʃəˌlɪzəm/","extraExplanation":["“provincialism”常带两层含义：一是思想/文化上的“狭隘、缺乏世界性视野”（常见于评论文章）；二是语言学里的“地方词”。语境不同，褒贬也会不同。","词源上与“province（省、地方）”有关：从“地方性的”引申到“只顾地方、不够开阔”，再引申到“只在地方使用的词语”。"]}
{"word":"provincialisms","summary":{"en":"Provincialisms are regional words, expressions, or habits, sometimes implying a local or narrow outlook.","zh":"provincialisms 指带地域色彩的用语或习惯，有时也暗含“乡土、狭隘”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, phrase, pronunciation, or custom that is typical of a particular region (not the standard form used everywhere).","zh":"地方用语；地方特色的说法、发音或习俗（不属于普遍通用的标准形式）。"},"examples":[{"en":"The novel includes many provincialisms from rural England.","zh":"这部小说包含了许多英格兰乡村的地方用语。"},{"en":"Some provincialisms can confuse readers from other regions.","zh":"有些地方用语会让其他地区的读者感到困惑。"}]},{"partOfSpeech":"n.","definition":{"en":"The habit or quality of speaking or behaving in a way strongly shaped by a local area, sometimes suggesting a narrow or limited outlook.","zh":"乡土气；过于受本地影响的言行方式（有时暗含“眼界较窄”的意思）。"},"examples":[{"en":"He worked hard to lose the provincialisms in his accent.","zh":"他努力改掉口音里的乡土痕迹。"},{"en":"The essay criticizes the provincialisms of people who dismiss anything unfamiliar.","zh":"这篇文章批评那些排斥陌生事物的人所表现出的狭隘乡土气。"}]}],"synonyms":["regionalisms","dialect words","local expressions","vernacular features"],"phonetic":"/prəˈvɪnʃəˌlɪzəmz/","extraExplanation":["“provincialisms”是复数形式；单数是“provincialism”。常见于语言学、文学评论中，用来指出作品里带有明显地域色彩的词汇/表达。","语气上通常是中性（描述地域特色），但在某些语境里也可能带轻微贬义，表示“土气、狭隘”。要看上下文（例如学术描述多为中性，社交评价可能偏负面）。"]}
{"word":"provincialist","summary":{"en":"A provincialist is someone (or something) narrowly focused on local/regional interests, often dismissing wider perspectives.","zh":"provincialist 指（人或观点）偏狭的地方主义取向：过度关注本地/本地区利益，常忽视或轻视更广泛的视角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has a narrow outlook because they are strongly influenced by local or regional attitudes, often showing limited interest in wider national or international ideas.","zh":"（常带贬义）地方主义者：因受本地或区域观念影响而眼界狭隘、对更广泛（全国或国际）事物兴趣不大的人。"},"examples":[{"en":"Some critics called him a provincialist because he dismissed ideas from outside his hometown.","zh":"一些评论家称他是地方主义者，因为他轻视来自家乡以外的观点。"},{"en":"The debate wasn’t just urban vs. rural—it was also about avoiding provincialist thinking.","zh":"这场争论不只是城市与乡村之分，也关乎避免狭隘的地方主义思维。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing strong loyalty to a particular region and a preference for local interests over broader ones.","zh":"地方主义的：强调本地区利益、偏爱本地事物而轻视更广泛利益或视角的。"},"examples":[{"en":"The policy was criticized as provincialist and short-sighted.","zh":"这项政策被批评为地方主义且目光短浅。"},{"en":"A provincialist attitude can make cooperation with other regions harder.","zh":"地方主义的态度会让与其他地区的合作更困难。"}]}],"synonyms":["parochialist","localist","narrow-minded person","regionalist"],"phonetic":"/prəˈvɪnʃəlɪst/","extraExplanation":["词语语气：provincialist 常带批评意味，强调“眼界狭隘/排外式的地方偏见”，比中性描述的 local（本地的）更负面。","词形关联：province（省/地区）→ provincial（地方的、非首都的；也可指“见识不广的”）→ provincialism（地方主义、狭隘）→ provincialist（地方主义者/地方主义的）。","使用场景：常见于政治、文化评论或媒体讨论，谈到“区域利益优先”“对外来观点不开放”等。避免用于指代某个地区的人群时的刻板化表达，可用 more locally focused（更偏向本地）等更中性的说法。"]}
{"word":"provincialities","summary":{"en":"“Provincialities” means local/regional traits in speech, manners, or attitudes, often implying narrow or unsophisticated views.","zh":"“provincialities”指言谈、习俗或观念中的地方性特点，常暗含眼界较狭窄、不够世故或不够国际化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Local or regional traits—especially in speech, manners, or attitudes—that are typical of a particular province or area (often suggesting something narrow, old-fashioned, or not cosmopolitan).","zh":"某一地区（省份/地方）特有的言谈、习俗或观念等“地方性特点”（常带有“眼界不够开阔、较保守、不够国际化”的含义）。"},"examples":[{"en":"After living abroad, she became more aware of the provincialities in her hometown’s customs.","zh":"在国外生活之后，她更能意识到家乡习俗中的一些地方性特点。"},{"en":"The novel gently mocks the provincialities of small-town life while still showing its warmth.","zh":"这部小说温和地讽刺了小镇生活的地方性，同时也展现了它的温情。"}]}],"synonyms":["local traits","regional characteristics","parochialisms"],"phonetic":"/prəˌvɪnʃiˈælətiz/","extraExplanation":["“provincialities”是复数名词，单数为“provinciality”。词根与“province（省/地方）”相关。","语气提示：在英美语境中，它常带轻微贬义，暗示“眼界狭窄/不够见多识广”。如果你想中性表达，可用“local characteristics / regional traits（地方/区域特征）”。","文学与写作中常见搭配：mock the provincialities（嘲讽地方习气）、escape one’s provincialities（摆脱地方局限）、the provincialities of small-town life（小镇生活的地方性习气）。"]}
{"word":"provinciality","summary":{"en":"Provinciality means a narrow, local-minded outlook, or (more neutrally) the quality of being regional rather than metropolitan.","zh":"Provinciality 指“地方性/狭隘的本地视角”，也可较中性地指“具有地区性而非大都市性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A limited or narrow way of thinking or behaving that comes from being strongly shaped by one local area and not being aware of wider ideas, cultures, or experiences.","zh":"（思想或行为上的）狭隘、地方性；因过于受某一地区影响而缺乏更广阔视野。"},"examples":[{"en":"She wanted to travel to escape the provinciality of her small town.","zh":"她想去旅行，以摆脱小镇生活带来的狭隘视野。"},{"en":"The book criticizes the provinciality of people who refuse to learn from other cultures.","zh":"这本书批评那些拒绝向其他文化学习的人的狭隘。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being related to a province or to areas outside major cities; local or regional character.","zh":"省级/地方性的特征；与大城市之外的地区相关的性质。"},"examples":[{"en":"The festival celebrates the provinciality of local food and music traditions.","zh":"这个节日庆祝地方饮食与音乐传统的地方特色。"},{"en":"In some countries, provinciality can simply mean life away from the capital.","zh":"在一些国家里，provinciality 也可以仅指远离首都的生活状态。"}]}],"synonyms":["narrow-mindedness","parochialism","small-town mentality","regionalism"],"phonetic":"/prəˌvɪnʃiˈælɪti/","extraExplanation":["词源与语感：provincial 来自“province（省、外省地区）”。在英语里，provincial 常带有“非首都/非大城市、较不时髦”的联想，因此 provinciality 常用于批评“眼界不够开阔、过于本地化”的心态。","语体与使用场景：provinciality 多见于较正式的书面语（评论、散文、学术写作）。日常口语里更常说 narrow-mindedness（狭隘）、small-town mentality（小镇心态）。","语义区分：它不等于“农村/乡下”。一个人住在大城市也可能有 provinciality（文化上排外、缺乏国际视野）。相反，强调“地方特色”时也可能是中性或积极的用法。"]}
{"word":"provincialization","summary":{"en":"Provincialization means making something less “universal” or central by treating it as a local or regional perspective; it can also mean reducing status or influence.","zh":"provincialization 指把某种观点或叙事从“普遍中心”拉回到“地方/区域视角之一”的过程；也可泛指地位或影响力被削弱、边缘化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making something seem less central, universal, or important by treating it as only one local or regional perspective (often used in academic discussions about history, culture, or knowledge).","zh":"（常用于学术语境）将某种观点、历史或知识“地方化/省域化”的过程：不再把它当作普遍中心或放之四海皆准，而是视为众多地方或区域视角之一。"},"examples":[{"en":"The book argues for the provincialization of Europe in world history classes.","zh":"这本书主张在世界史课堂中对“欧洲中心”的叙事进行地方化处理。"},{"en":"Provincialization helps readers see that one country’s experience is not the global standard.","zh":"地方化处理能让读者意识到：一个国家的经验并不是全球的标准。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of reducing something’s status or influence, as if turning it into a “province” rather than a center of power.","zh":"（更一般意义）降低某事物的地位或影响力，使其从“中心”变成类似“地方/边缘”的存在。"},"examples":[{"en":"Some critics saw the reform as a provincialization of the capital’s authority.","zh":"一些批评者认为这项改革削弱了首都的权威，使之被“地方化”。"},{"en":"The treaty led to the provincialization of the empire’s former leadership role.","zh":"该条约导致这个帝国昔日的领导地位被削弱、边缘化。"}]}],"synonyms":["decentering","relativization","contextualization","marginalization","de-universalization"],"phonetic":"/prəˌvɪnʃəˌlaɪˈzeɪʃən/","extraExplanation":["这个词常见于后殖民研究与全球史讨论，尤其与学者 Dipesh Chakrabarty 的《Provincializing Europe》相关。核心意思不是“否定欧洲”，而是把“欧洲经验”从被当作普遍模板的位置，放回到“众多历史路径之一”的位置。","构词理解：province（省/地方）+ -al（……的）+ -ize（使……化）+ -ation（名词化）→ “使之地方化的过程”。","注意与 provincial（adj.）日常含义“地方的/见识不广的”区分：provincialization 多用于抽象、学术性的“去中心化/去普遍化”讨论。"]}
{"word":"provincialize","summary":{"en":"To provincialize is to make something narrowly local or limited in outlook, treating broader matters as merely provincial.","zh":"provincialize 指使某事变得地方化或显得眼界狭隘，把本应更宏观的事情说成只是地方层面的。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem narrow, unsophisticated, or limited in outlook, as if it only matters in a small local area","zh":"使（某事物）显得狭隘、缺乏见识或眼界受限（仿佛只关心地方小圈子）"},"examples":[{"en":"Constantly comparing everything to your hometown can provincialize the whole conversation.","zh":"一直拿家乡来对比一切，会让整段对话变得很狭隘。"},{"en":"The article provincializes global issues by treating them as minor local problems.","zh":"这篇文章把全球议题当成小地方的问题来写，显得视野很窄。"}]},{"partOfSpeech":"vt.","definition":{"en":"to turn something into a provincial matter; to confine it to a local level rather than a broader or national/international one","zh":"使（某事）变成地方性的事务；把它局限在本地层面，而不是更广泛/国家或国际层面"},"examples":[{"en":"The debate was provincialized when leaders refused to discuss the wider economic impact.","zh":"当领导者拒绝讨论更广泛的经济影响时，这场辩论就被“地方化”了。"},{"en":"They warned that the policy could be provincialized by uneven enforcement in different regions.","zh":"他们警告说，如果各地区执行不一，这项政策可能会被“地方化”。"}]}],"synonyms":["localize","parochialize","narrow","restrict","limit"],"phonetic":"/prəˈvɪnʃəˌlaɪz/","extraExplanation":["“provincialize”来自“province（省份、地方）”。在英语里，provincial 除了“地方的”也常带有“眼界不够开阔、缺乏大城市/国际视野”的评价色彩，所以 provincialize 常用于批评：把本来更宏观的议题说小、说窄。","常见搭配：provincialize a debate/an issue/a discussion（把辩论/议题/讨论变得狭隘或地方化）。正式写作中更常见，日常口语里通常会说 “make it too local / narrow-minded”。"]}
{"word":"provincially","summary":{"en":"Provincially means either “at the provincial (regional) level” or “in a narrow, small-town-minded way,” depending on context.","zh":"provincially 可指“在省/地区层面上”，也可指“眼界狭隘、带小地方心态地”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a province (a region of a country) or to provincial government/administration.","zh":"以省（国家的一个地区）或省级政府/行政的方式；在省级层面上。"},"examples":[{"en":"The museum is funded provincially, not nationally.","zh":"这家博物馆的经费来自省级，而不是国家级。"},{"en":"The policy is managed provincially, so rules may differ by region.","zh":"这项政策在省级管理，所以各地区规则可能不同。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a narrow or unsophisticated way, as if from a small town; lacking a broad, cosmopolitan perspective.","zh":"以狭隘或不够世故的方式；带有“小地方”眼光、缺乏国际化/大城市视野。"},"examples":[{"en":"He judged the new food provincially, without trying to understand it.","zh":"他用很狭隘的眼光评价这种新食物，没试着去理解它。"},{"en":"The article feels provincially focused and ignores the wider context.","zh":"这篇文章的关注点显得很“地方化”，忽略了更大的背景。"}]}],"synonyms":["regionally","at the provincial level","parochially","narrowly"],"phonetic":"/prəˈvɪnʃəli/","extraExplanation":["“provincially”来自形容词“provincial”。它既可以是中性用法（指“省级/地区层面”），也可以带一点批评意味（指“眼界不够开阔、像小地方的人”）。语境通常能决定是中性还是贬义。","搭配提示：常见于正式写作，如“provincially funded/regulated/administered（省级资助/监管/管理）”。带评价时，常与“narrowly / parochially”意思接近。"]}
{"word":"provincialship","summary":{"en":"Provincialship means (1) a provincial, small-town outlook, or (2) the office/term of a provincial leader in certain religious orders.","zh":"Provincialship 指（1）地方性/乡土气的观念或气质；或（2）某些宗教修会中“省会长”等省级负责人的职务或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being provincial; a provincial character or outlook (often suggesting being less sophisticated than a big city).","zh":"地方性；乡土气（常含“没那么见过世面/不够城市化”的意味）。"},"examples":[{"en":"She worried that her accent would be seen as a sign of provincialship in the capital.","zh":"她担心自己的口音在首都会被看作一种“地方气”。"},{"en":"The novel gently criticizes the provincialship of the small town without mocking its people.","zh":"这部小说温和地批评了小镇的地方局限，但并不嘲笑当地人。"}]},{"partOfSpeech":"n.","definition":{"en":"the position or term of office of a provincial (a leader in some religious orders or organizations).","zh":"（宗教修会等组织中）“省会长/省长”等省级负责人之职务或任期。"},"examples":[{"en":"He served a four-year provincialship in the order before returning to teaching.","zh":"他在修会中担任了四年的省会长，之后回去教学。"},{"en":"During her provincialship, she focused on training and community outreach.","zh":"在她的省级任期内，她重点推动培训与社区服务。"}]}],"synonyms":["provincialism","parochialism","localism","provincial office","provincial leadership"],"phonetic":"/prəˈvɪnʃəlˌʃɪp/","extraExplanation":["“provincialship”并不常见：日常英语更常用“provincialism”（地方观念、偏狭）来表达第一义；第二义多见于天主教等修会语境，指“provincial（省会长）”的职务/任期。","词形上由“provincial + -ship”构成，类似“leadership / friendship”，强调“身份、状态或职位”。"]}
{"word":"provinciate","summary":{"en":"“Provinciate” isn’t standard English; you likely mean “provincial,” meaning either “from outside the capital” or “narrow-minded/unsophisticated.”","zh":"“provinciate”不是标准英文；你可能想写“provincial”，可指“外省的/非大城市的”，也可指“见识狭隘的/不够世故的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “provincial.”","zh":"不是标准英文单词。很可能是“provincial”的拼写错误。"},"examples":[{"en":"I think you meant “provincial,” not “provinciate.”","zh":"我想你要写的是“provincial”，不是“provinciate”。"},{"en":"Her “provincial” accent shows she grew up outside the capital.","zh":"她带有“provincial（外省的）”口音，说明她在首都以外长大。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Meaning of the likely intended word “provincial”) connected with areas outside the capital city; not urban or metropolitan.","zh":"（你可能想写的“provincial”的意思）与首都以外地区有关的；外省的；非大城市的。"},"examples":[{"en":"They moved from a provincial town to New York City.","zh":"他们从一个外省小镇搬到了纽约市。"},{"en":"Provincial roads can be quiet but beautiful.","zh":"外省公路可能很安静，但风景很美。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Meaning of “provincial”) narrow in experience or attitude; unsophisticated.","zh":"（“provincial”的意思）见识狭窄的；不够开阔（有时带贬义）。"},"examples":[{"en":"He dismissed their ideas as provincial and old-fashioned.","zh":"他把他们的想法斥为狭隘而过时。"},{"en":"Try not to sound provincial when discussing other cultures.","zh":"谈论其他文化时，尽量别显得狭隘。"}]}],"synonyms":["provincial","regional","local","parochial"],"phonetic":"/prəˈvɪnʃəl/","extraExplanation":["“provinciate”在常见词典中通常查不到。最常见的目标词是“provincial”（形容词），发音/prəˈvɪnʃəl/。","“provincial”有时带有轻微贬义（指“狭隘、不够见多识广”）。在跨文化交流中，使用时注意语气：描述地点时较中性，评价人或想法时更容易冒犯。"]}
{"word":"provinculum","summary":{"en":"A (rare) term for a horizontal overbar used to group symbols or indicate repetition in math notation.","zh":"一个较少见的术语，指数学记号中的“上横线”，用于分组或表示重复（如循环小数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics, typography) A horizontal bar written over several symbols to show they are grouped together, treated as one unit, or (in some contexts) repeated.","zh":"（数学/排版）写在多个符号上方的水平横线，用来表示这些符号要作为一个整体进行运算或处理；在某些语境中也可表示“重复”。"},"examples":[{"en":"In older algebra books, a provinculum is placed over a+b+c to show the whole sum is one group.","zh":"在一些较早的代数教材里，会在 a+b+c 上方画 provinculum，表示整个和式作为一个整体。"},{"en":"The expression x/(a+b) can be written with a provinculum over a+b to make the grouping clear.","zh":"表达式 x/(a+b) 可以在 a+b 上方加 provinculum，让分组更清楚。"},{"en":"Some writers use a provinculum as an overbar to mark repeating digits in decimals.","zh":"有些作者会用 provinculum（上横线）来标记小数中循环重复的数字。"}]}],"synonyms":["vinculum","overbar","overline"],"phonetic":"/proʊˈvɪŋkjələm/","extraExplanation":["词源与关系：provinculum 来自拉丁语，字面含义与“连接、束缚”有关，和更常见的 vinculum（上划线/连线）是近亲词。在现代教材里，常用的说法通常是 overbar 或 vinculum。","使用提示：在当代数学书写中，分组更常用括号、方括号或大括号；provinculum 这种说法较少见，多出现在较旧或较专门的文献里。"]}
{"word":"provine","summary":{"en":"“Provine” is a rare viticulture word meaning to propagate a vine by layering (and also the layered shoot/new plant).","zh":"“provine”是少见的葡萄栽培用词，指用压条（埋藤）法繁殖藤本植物，也可指压条的枝条/新株。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Viticulture) To propagate a grapevine (or other vine) by layering—bending a cane/shoot to the ground and covering part of it with soil so it grows roots and becomes a new plant.","zh":"（葡萄栽培）用“压条/埋藤”的方法繁殖葡萄藤（或其他藤本植物）——把枝条压到地面并覆土，使其生根，长成新株。"},"examples":[{"en":"The grower provin​ed the old vines to replace missing plants in the row.","zh":"种植者用压条法繁殖老藤，用来补齐行里缺失的植株。"},{"en":"In spring, they provine a healthy cane and keep it moist until it roots.","zh":"春天他们把健壮的枝条压埋，并保持湿润，直到它生根。"}]},{"partOfSpeech":"n.","definition":{"en":"A vine shoot/cane that has been layered for propagation; a newly rooted plant formed this way.","zh":"用于压条繁殖的埋地枝条；用这种方式生根形成的新株。"},"examples":[{"en":"Several provines took root and were separated from the parent plant later.","zh":"好几条压条都生根了，之后再与母株分离。"}]}],"synonyms":["layer (a plant)","propagate","root (by layering)"],"phonetic":"/proʊˈvaɪn/","extraExplanation":["“provine”在现代英语中很少见，主要出现在葡萄栽培/园艺语境。更常见、拼写相近的词是“province”（省/自治区等）。如果你本来想查“province”，告诉我你的语境，我可以给出对应词条。"]}
{"word":"proving","summary":{"en":"“Proving” usually means showing something is true (the -ing form of “prove”); it can also describe something that is a tough test.","zh":"“proving”通常表示“证明”（prove 的 -ing 形式）；也可作形容词，表示“很考验人的、很具挑战性的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"showing that something is true or correct by using evidence or facts (present participle of “prove”)","zh":"用证据或事实证明某事是真的或正确的（“prove”的现在分词）"},"examples":[{"en":"She is proving her point with data from the latest report.","zh":"她用最新报告的数据来证明自己的观点。"},{"en":"The experiment is proving that the new method works.","zh":"实验正在证明这种新方法有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"testing someone’s ability, patience, or strength; very challenging","zh":"对能力、耐心或意志的考验很大的；非常具有挑战性的"},"examples":[{"en":"It was a proving week for the whole team.","zh":"那一周对整个团队来说是一次严峻的考验。"},{"en":"The hike became more proving as the weather got worse.","zh":"天气越糟，这次徒步就越考验人。"}]}],"synonyms":["demonstrating","showing","establishing","confirming","verifying","testing","challenging"],"phonetic":"/ˈpruːvɪŋ/","extraExplanation":["常见搭配：\n- proving (that) + 从句：强调“证明确实如此”。例：The results are proving that…\n- prove yourself：证明自己（能力/价值）。例：He wants to prove himself at work.\n- proving ground：字面是“试验场/试炼之地”，也可比喻“锻炼与检验能力的地方”。"]}
{"word":"provingly","summary":{"en":"“Provingly” means “in a way that proves something; convincingly.” It’s rare in modern English.","zh":"“provingly”表示“以能证明某事的方式；令人信服地”。在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that proves something; convincingly, with evidence.","zh":"以能证明某事的方式；令人信服地（有证据地）。"},"examples":[{"en":"The new data provinglly supports the idea that exercise improves sleep.","zh":"新数据以令人信服的方式支持了“运动能改善睡眠”的观点。"},{"en":"She argued provinglly, using clear examples and numbers.","zh":"她用清晰的例子和数据进行论证，说得很有说服力。"}]}],"synonyms":["convincingly","persuasively","demonstrably","evidentially"],"phonetic":"/ˈpruːvɪŋli/","extraExplanation":["“provingly”这个词在现代英语中比较少见，更常用的表达是“convincingly / persuasively / in a way that proves …”。在正式写作里也常改写成“provide proof/evidence”或“demonstrate clearly”。"]}
{"word":"proviral","summary":{"en":"Proviral means “related to a provirus,” especially viral DNA integrated into a host cell’s genome; less commonly, it can mean “promoting viral infection.”","zh":"proviral 指“与前病毒有关”，尤其是整合进宿主基因组的病毒DNA；较少见时也可指“促进病毒感染/复制的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a provirus (viral genetic material that is integrated into a host cell’s DNA).","zh":"与“前病毒/原病毒”（病毒遗传物质整合进宿主细胞DNA中的形式）有关的。"},"examples":[{"en":"HIV can remain in a proviral state inside certain immune cells.","zh":"HIV可以在某些免疫细胞内以“前病毒”状态潜伏存在。"},{"en":"Researchers measured proviral DNA to estimate how much virus was hidden in the body.","zh":"研究人员通过测量前病毒DNA来估算体内隐藏的病毒量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Tending to promote or support viral infection or viral replication.","zh":"（较少见）倾向于促进或支持病毒感染或病毒复制的。"},"examples":[{"en":"Some conditions may create a proviral environment that helps the virus spread.","zh":"某些条件可能形成有利于病毒传播的“促病毒”环境。"}]}],"synonyms":["provirus-related","integrated (viral)","viral (in context)"],"phonetic":"/proʊˈvaɪrəl/","extraExplanation":["“proviral”主要用于病毒学/免疫学语境。最常见的是第一义：描述“proviral DNA”（整合在宿主基因组中的病毒DNA），常见于讨论HIV的“病毒库/潜伏感染”。","构词提示：pro-（向前/支持）+ viral（病毒的）。在专业写作中通常默认指“与前病毒有关”，而不是日常意义上的“促使病毒增多”。"]}
{"word":"provirus","summary":{"en":"A provirus is viral genetic material integrated into a host cell’s DNA, especially in retroviruses like HIV.","zh":"前病毒是整合进宿主细胞DNA中的病毒遗传物质，常见于HIV等逆转录病毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a viral genome (especially from a retrovirus) that has been inserted into a host cell’s DNA and can be copied along with the host’s genes","zh":"（尤指逆转录病毒的）病毒基因组插入宿主细胞DNA后形成的“前病毒”，可随宿主基因一起被复制"},"examples":[{"en":"HIV can form a provirus by integrating its genetic material into the DNA of immune cells.","zh":"HIV可以把遗传物质整合进免疫细胞的DNA中，形成前病毒。"},{"en":"Once the provirus is in the genome, it may stay inactive for years.","zh":"前病毒一旦进入基因组，可能会多年保持不活跃状态。"},{"en":"Scientists study proviruses to understand viral latency and relapse.","zh":"科学家研究前病毒，以理解病毒潜伏与复发机制。"}]}],"synonyms":["integrated viral DNA","latent viral genome"],"phonetic":"ˌproʊˈvaɪrəs","extraExplanation":["“pro-”在这里有“在前/前阶段”的意思；provirus 指病毒整合进宿主DNA后的阶段。对逆转录病毒（如 HIV）来说，这是其生命周期的关键一步：先把RNA逆转录成DNA，再整合到宿主染色体中。","前病毒与“潜伏（latency）”常一起出现：病毒基因可能暂时不表达，因此不容易被免疫系统或某些药物清除，这也是一些病毒感染难以根治的原因之一。","别与“proviral”混淆：proviral 是形容词，表示“前病毒的/与前病毒相关的”，如 proviral DNA（前病毒DNA）。"]}
{"word":"proviruses","summary":{"en":"Proviruses are viral DNA integrated into a host’s genome, often remaining dormant and sometimes reactivating; the term can also refer to inherited ancient viral DNA in genomes.","zh":"前病毒指整合进宿主基因组的病毒DNA，常可潜伏并可能再激活；也可指基因组中遗传下来的古老内源性病毒DNA。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A viral genome that has been inserted into a host cell’s DNA, where it can stay “silent” (inactive) or later become active to produce new viruses.","zh":"被整合进宿主细胞DNA中的病毒基因组；它可以长期“潜伏”（不活跃），也可能在之后被激活产生新病毒。"},"examples":[{"en":"HIV can form proviruses inside certain immune cells.","zh":"HIV可以在某些免疫细胞内形成前病毒。"},{"en":"Some proviruses remain dormant for years and are hard to eliminate with medicine.","zh":"一些前病毒会潜伏多年，因此很难用药物彻底清除。"}]},{"partOfSpeech":"n.","definition":{"en":"(More general use) Endogenous viral DNA passed down in a species’ genome from ancient infections; these are often inactive remnants.","zh":"（更广义）由远古感染遗留并通过遗传保留在物种基因组中的内源性病毒DNA；通常是不活跃的“残留片段”。"},"examples":[{"en":"Scientists study proviruses in animal genomes to learn about ancient viral infections.","zh":"科学家研究动物基因组中的前病毒，以了解远古病毒感染史。"},{"en":"Many proviruses are broken pieces of viral DNA that no longer make viruses.","zh":"许多前病毒是已经破损的病毒DNA片段，无法再产生病毒。"}]}],"synonyms":["integrated viral DNA","viral DNA insertion","latent viral genome"],"phonetic":"/ˈproʊˌvaɪrəsɪz/","extraExplanation":["“provirus”常用于逆转录病毒（如HIV）。它们把RNA“逆转录”为DNA，再整合进宿主DNA，形成稳定的“潜伏库（latent reservoir）”，这是治疗HIV特别困难的原因之一。","区分：provirus（整合在宿主DNA中的病毒DNA）≠ virus（完整病毒颗粒）≠ viral load（血液等体液中的病毒数量）。","词源提示：pro-（在前/预备）+ virus（病毒），可理解为“处于病毒形成前阶段的整合形态”。"]}
{"word":"provision","summary":{"en":"Provision most often means supplying what is needed, especially in services, plans, or law; it can also mean food and supplies for a trip.","zh":"Provision 常指“提供/供给（所需之物）”或“安排”，在法律中也指“条款”；也可指旅途或紧急情况的“食物与补给”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of providing or supplying something; the arrangement or supply of what is needed","zh":"提供；供给；（为需要之物所做的）供应安排"},"examples":[{"en":"The school made provisions for students with disabilities.","zh":"学校为残障学生做了相应的安排。"},{"en":"They discussed the provision of clean water to rural villages.","zh":"他们讨论了向乡村提供清洁用水的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"food and supplies prepared for a journey or an emergency","zh":"（为旅途或紧急情况准备的）食物和补给"},"examples":[{"en":"They packed provisions for the long hike.","zh":"他们为长途徒步打包了食物和补给。"},{"en":"The ship ran low on provisions after weeks at sea.","zh":"在海上航行数周后，船上的补给快用完了。"}]},{"partOfSpeech":"n.","definition":{"en":"a condition or rule in a legal document or agreement","zh":"（法律文件或协议中的）条款；规定"},"examples":[{"en":"The contract includes a provision about early termination.","zh":"合同包含一条关于提前终止的条款。"},{"en":"Under the provision, employees must receive paid leave.","zh":"根据该项规定，员工必须获得带薪休假。"}]},{"partOfSpeech":"vt.","definition":{"en":"to supply with what is needed; to provide","zh":"供给；提供（所需之物）"},"examples":[{"en":"The aid group provisioned the camp with medicine and blankets.","zh":"救援组织为营地提供了药品和毯子。"}]}],"synonyms":["supply","providing","arrangement","stipulation","clause","supplies"],"phonetic":"/prəˈvɪʒən/","extraExplanation":["“Provision”常见三种用法：①抽象的“提供/供给”（the provision of…）；②具体可数的“食物补给”（provisions，常用复数）；③法律语境中的“条款/规定”（a provision in a contract）。","词源来自拉丁语 pro-（向前）+ videre（看），原意接近“预先看到、预作准备”，所以也常与“提前准备、安排”这种语感相关。"]}
{"word":"provisional","summary":{"en":"Provisional means temporary and not final, often used for plans, decisions, or official approval that may change later.","zh":"provisional指“临时的、暂定的、未最终确定的”，常用于计划、决定或官方/法律上的暂时批准，之后可能会更改。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Temporary and likely to change later; arranged for the present time only.","zh":"临时的；暂定的（以后可能会改变）。"},"examples":[{"en":"We made a provisional schedule, but it may change next week.","zh":"我们做了一个暂定的日程，但下周可能会改。"},{"en":"She accepted the job offer on a provisional basis.","zh":"她以暂时/暂定的方式接受了这份工作邀请。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done with the understanding that it is not final, especially in official or legal situations.","zh":"（尤指官方或法律场景）暂行的；暂时有效但尚未最终确定的。"},"examples":[{"en":"The police released a provisional report after the accident.","zh":"事故发生后，警方发布了一份初步（暂行）报告。"},{"en":"The court granted provisional approval while the documents were reviewed.","zh":"在审查文件期间，法院给予了暂时批准。"}]}],"synonyms":["temporary","tentative","interim","preliminary"],"phonetic":"/prəˈvɪʒənəl/","extraExplanation":["“provisional”常见搭配：provisional plan/schedule（暂定计划/日程）、provisional agreement（暂定协议）、provisional results（初步结果）、provisional license（临时执照/暂准许可证）。","与“temporary”相比：temporary更口语、更强调“短期存在”；provisional更强调“还没最终确定，之后可能会调整”，常见于正式文本。","词源提示：来自拉丁语provisio（预先安排/准备），所以它带有“先行安排、以备后续”的感觉。"]}
{"word":"provisionality","summary":{"en":"Provisionality means the quality of being temporary or not final, often implying it may change after review or new information.","zh":"Provisionality 指“暂时性/暂定性”：并非最终结论或安排，常暗示在审查或新信息出现后可能调整。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being temporary, not final, or subject to change later","zh":"暂时性；临时状态；（结论/安排）未定性、可更改性"},"examples":[{"en":"The provisionality of the schedule means we may change the dates next week.","zh":"日程安排具有暂时性，意味着我们下周可能会改日期。"},{"en":"Scientists acknowledge the provisionality of their conclusions when new evidence appears.","zh":"当出现新证据时，科学家会承认其结论具有可修正的暂定性。"},{"en":"Living abroad taught her to accept the provisionality of plans.","zh":"在国外生活让她学会接受计划的暂定与变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(law/government) the condition of being in force only temporarily or pending a final decision","zh":"（法律/政府）临时有效的状态；在最终裁定前的暂行状态"},"examples":[{"en":"The agreement has provisionality until both sides sign the final document.","zh":"在双方签署最终文件之前，该协议仅具暂行效力。"},{"en":"The policy was introduced with provisionality, pending a full review.","zh":"该政策以暂行方式推出，等待全面审查。"}]}],"synonyms":["temporariness","tentativeness","impermanence","conditionality","provisional status"],"phonetic":"/prəˌvɪʒəˈnælɪti/","extraExplanation":["“provisionality”来自形容词“provisional”（暂时的、暂定的）+ 名词后缀“-ity”（表示“……的状态/性质”）。常用于学术写作（如科学研究、哲学、人类学）来强调：观点或结论并非“永远正确”，而是会随着信息更新而调整。","语感上，“provisionality”比“temporariness”更正式，也更强调“尚未最终确定、可被修订”的意味；而“temporariness”更偏“时间短暂”。"]}
{"word":"provisionally","summary":{"en":"“Provisionally” means temporarily or conditionally—true for now, but subject to later confirmation or change.","zh":"“Provisionally”表示“暂时地/暂定地；有条件地”，目前有效但可能会在之后确认或改变。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a temporary way; for now, until a final decision, agreement, or arrangement is made.","zh":"暂时地；临时地（在最终决定、协议或安排作出之前）。"},"examples":[{"en":"We have provisionally scheduled the meeting for Friday.","zh":"我们暂定把会议安排在周五。"},{"en":"She was provisionally accepted into the program, pending her final exam results.","zh":"她被该项目暂时录取，需等待期末考试结果。"},{"en":"The workers were provisionally housed in a nearby hotel.","zh":"工人们被暂时安置在附近的酒店里。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is conditional on later confirmation; not yet official or certain.","zh":"有条件地；待确认地（尚未正式或确定）。"},"examples":[{"en":"The deal is provisionally agreed, but lawyers still need to review the contract.","zh":"这笔交易已初步达成一致，但仍需律师审阅合同。"},{"en":"Prices are provisionally set and may change next month.","zh":"价格暂定，可能下个月会调整。"}]}],"synonyms":["temporarily","for the time being","tentatively","conditionally","preliminarily"],"phonetic":"/prəˈvɪʒənəli/","extraExplanation":["“provisionally”常见于正式/商务语境（邮件、公告、合同）：表示“暂定/初步”，隐含“可能会改、需要确认”。日常口语里也可用“for now / temporarily”。","常与这些结构搭配：provisionally scheduled（暂定日程）、provisionally accepted/approved（暂时录取/批准）、provisionally agreed（初步同意）、pending + 名词（以……为条件/等待……结果）。"]}
{"word":"provisionalness","summary":{"en":"Provisionalness means the state of being temporary and not final yet.","zh":"Provisionalness 指“暂时的、暂定的、尚未最终确定”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being provisional—temporary and not yet final or fully decided.","zh":"“临时性的、暂定的”这种性质或状态；尚未最终确定。"},"examples":[{"en":"The provisionalness of the schedule means it may change next week.","zh":"日程的暂定性意味着下周可能会改。"},{"en":"Everyone understood the provisionalness of the agreement until the lawyers reviewed it.","zh":"在律师审查之前，大家都明白这份协议只是暂定的。"}]}],"synonyms":["temporariness","tentativeness","preliminary nature"],"phonetic":"/prəˈvɪʒənəl.nəs/","extraExplanation":["“provisionalness”是由形容词“provisional（暂时的、暂定的）”加名词后缀“-ness”构成，表示“……的性质/状态”。","这个词在日常口语里不算常见，更常用的表达是“the provisional nature of …（……的暂定性质）”或直接用“it’s provisional（这是暂定的）”。","常见使用场景：临时安排（a provisional schedule）、暂定协议（a provisional agreement）、初步结果/数据（provisional results/data）、临时政府（a provisional government）。"]}
{"word":"provisionary","summary":{"en":"Provisionary can mean “temporary (provisional)” or “a supplier of provisions,” though it is not very common in modern English.","zh":"Provisionary可指“临时的（相当于provisional）”或“物资/给养供应者”，但在现代英语中不太常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often, but less commonly) temporary; intended to be used for a short time until something permanent is ready.","zh":"（较少见用法）临时的；暂时使用的，直到正式/永久的准备好为止。"},"examples":[{"en":"The clinic opened in a provisionary building while the new hospital was being constructed.","zh":"新医院施工期间，诊所在一栋临时建筑里开张。"},{"en":"They set up provisionary rules to guide the team for the first month.","zh":"他们制定了临时规则来指导团队第一个月的工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supplies provisions (food, equipment, or other necessities), especially for a trip, army, or expedition.","zh":"（较少见用法）供应者；（尤指为旅行、军队或探险）提供给养/物资的人。"},"examples":[{"en":"In the old stories, the ship’s provisionary ensured there was enough food for the voyage.","zh":"在旧故事里，船上的物资供应者确保航行途中有足够的食物。"}]}],"synonyms":["provisional","temporary","interim","supplier","purveyor"],"phonetic":"/prəˈvɪʒəˌnɛri/","extraExplanation":["“provisionary”在现代英语里不算常用。表示“临时的”时，更常见、也更标准的是“provisional”（如：a provisional agreement 临时协议）。\n\n“provisionary”还可能让人联想到“provision”（n. 给养；规定；条款 / v. 供给），但它并不等同于“provision”（名词或动词）。写作和考试中建议优先用“provisional”表达“暂时的”。"]}
{"word":"provisioned","summary":{"en":"“Provisioned” means supplied in advance with what’s needed, or (in tech) set up and ready to use.","zh":"“Provisioned”指已预先补给所需物资；在科技语境中指已配置开通、可直接使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supplied with necessary items (such as food, equipment, or resources), usually in advance.","zh":"（通常预先）配给、补给，提供所需物资（如食物、装备或资源）。"},"examples":[{"en":"The hikers were well provisioned with water and snacks.","zh":"徒步者准备得很充分，带了水和零食。"},{"en":"The ship was provisioned for a long journey.","zh":"这艘船为长途航行做好了补给准备。"}]},{"partOfSpeech":"adj.","definition":{"en":"set up and made ready for use (especially in technology: accounts, servers, devices, services).","zh":"（尤用于科技领域）已配置并开通可用（如账号、服务器、设备或服务）。"},"examples":[{"en":"All new laptops come provisioned with security software.","zh":"所有新笔记本电脑都预装了安全软件。"},{"en":"Your account has been provisioned, so you can log in now.","zh":"你的账号已开通配置完成，现在可以登录了。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “provision”: to provide or supply what is needed; to make arrangements for.","zh":"“provision”的过去式/过去分词：提供或供给所需之物；为……作安排。"},"examples":[{"en":"They provisioned the camp before winter arrived.","zh":"他们在冬天到来之前为营地补给了物资。"},{"en":"The contract provisioned extra support during peak season.","zh":"合同约定在旺季提供额外支持。"}]}],"synonyms":["supplied","stocked","equipped","provided","outfitted","set up","configured"],"phonetic":"/prəˈvɪʒənd/","extraExplanation":["“provisioned”常见于两类语境：\n1）日常/旅行/军用：强调“提前备好补给”，常与 for 连用（be provisioned for…）。\n2）IT/云服务：provision 侧重“开通+配置+分配资源”（如创建账号、分配权限、部署服务器）。在中文里常译为“开通/配置/预置/部署”，具体看对象。","和法律/合同相关时，provision 作动词常表示“作出规定/约定”（make provision for…），因此 provisioned 也可理解为“合同已规定/已安排”。"]}
{"word":"provisioner","summary":{"en":"A provisioner is a supplier—someone who provides and manages supplies, especially food or equipment.","zh":"Provisioner 指供应/筹备补给的人或公司，尤其是食物或装备等物资的提供与管理者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that supplies goods, services, or resources, especially food or equipment for an organization, trip, or event","zh":"供应商；补给者（为组织、旅行或活动提供物资/服务的人或公司，尤指食物或装备）"},"examples":[{"en":"The hotel hired a local provisioner to supply fresh produce every morning.","zh":"酒店雇了一家本地供应商，每天早上供应新鲜农产品。"},{"en":"Before the expedition, they worked with a provisioner to stock tents, fuel, and medicine.","zh":"探险出发前，他们与补给商合作，备齐帐篷、燃料和药品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person responsible for preparing and distributing supplies (often used in military, shipping, or large-institution contexts)","zh":"军需官；负责采购与发放物资的人（常用于军队、航运或大型机构语境）"},"examples":[{"en":"The provisioner checked inventory and arranged deliveries to the base.","zh":"军需官检查库存，并安排向基地送货。"},{"en":"On long voyages, the ship’s provisioner carefully rationed food and water.","zh":"在长途航行中，船上的军需官会仔细配给食物和饮水。"}]}],"synonyms":["supplier","vendor","purveyor","caterer","outfitter"],"phonetic":"/prəˈvɪʒənər/","extraExplanation":["“Provisioner”来自“provision”（给养、供给）。在现代商业英语里，它常指“提供者/供应商”；在较传统或行业语境（如航海、军队、探险）中，更强调“负责筹备与分配补给的人”。","相关词：provision（n. 供给；v. 为…提供），provisions（n. 口粮/给养，常用复数），supplier/vendor（更常见的“供应商”用词）。"]}
{"word":"provisioneress","summary":{"en":"A provisioner is someone who supplies provisions such as food and other necessities.","zh":"provisioner 指提供食品或其他必需品的供应者/补给商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that supplies provisions (especially food, equipment, or other necessities), often for travel, the military, or large events","zh":"供应者；（尤指为旅行、军队或大型活动）提供食品、装备等必需品的人或公司"},"examples":[{"en":"A local provisioner supplied fresh bread and dried fruit for the hiking trip.","zh":"一家本地供应商为徒步旅行提供了新鲜面包和干果。"},{"en":"During the expedition, the provisioner delivered water, fuel, and medical supplies every week.","zh":"在探险期间，供应商每周运送水、燃料和医疗物资。"}]}],"synonyms":["supplier","purveyor","vendor"],"phonetic":"/prəˈvɪʒənər/","extraExplanation":["你输入的“provisioneress”不是常见英语单词，最可能是拼写误差。常见形式是 provisioner（供应者/补给商），复数是 provisioners。","provisioner 来自 provision（供给、补给）。更常用的动词是 to provision（为……提供补给），例如：They provisioned the ship for a month（他们为船准备了一个月的补给）。","在现代日常语境中，provisioner 偏正式/行业用语；口语里更常说 supplier（供应商）或 caterer（餐饮供应商，偏活动供餐）。"]}
{"word":"provisioning","summary":{"en":"Provisioning means supplying or preparing what’s needed; in tech, it often means setting up and allocating resources so they’re ready to use.","zh":"Provisioning指提供或准备所需物资；在科技语境中常指配置并分配资源，使其可立即使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of providing, supplying, or preparing what is needed (often food, services, or resources)","zh":"提供、供给或准备所需之物的行为或过程（常指食物、服务或资源）"},"examples":[{"en":"The team is responsible for provisioning the new office with laptops and monitors.","zh":"这个团队负责为新办公室配备笔记本电脑和显示器。"},{"en":"Before the trip, we spent a day provisioning the boat with food and water.","zh":"出发前，我们花了一天为船只补给食物和饮用水。"}]},{"partOfSpeech":"n.","definition":{"en":"in technology, the process of setting up and allocating resources (such as user accounts, servers, or cloud services) so they are ready to use","zh":"在科技领域，指配置并分配资源（如用户账号、服务器或云服务），使其可立即使用的过程"},"examples":[{"en":"Account provisioning usually includes creating a username, setting permissions, and enabling access.","zh":"账号开通（配置）通常包括创建用户名、设置权限并启用访问。"},{"en":"Automated provisioning can deploy a new server in minutes.","zh":"自动化配置可以在几分钟内部署一台新服务器。"}]}],"synonyms":["supplying","equipping","preparing","resourcing","setup","configuration"],"phonetic":"/prəˈvɪʒənɪŋ/","extraExplanation":["“Provisioning”来自“provision（供给/给养/条款）”，既可用于日常语境（为旅行、航海、活动做补给/筹备），也常用于IT语境（开通账号、配置系统、分配云资源）。在技术写作里，它常与“deployment（部署）”并列：provisioning更强调“把资源准备好、配好权限与容量”，deployment更强调“把应用/系统发布上线”。"]}
{"word":"provisionless","summary":{"en":"Provisionless means having no supplies or having no provisions/arrangements made.","zh":"Provisionless 指“没有补给的”，也可指“未作规定/安排的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without supplies (especially food, water, or other necessities) for a journey or period of time.","zh":"没有补给的；缺乏（尤指食物、水等必需品）供给的。"},"examples":[{"en":"They set out provisionless and had to turn back when the weather changed.","zh":"他们出发时没有带补给，天气一变就不得不折返。"},{"en":"A provisionless trip across the desert is extremely dangerous.","zh":"没有补给地穿越沙漠非常危险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without making provisions or arrangements; unprovided for.","zh":"未作安排的；未预留/未准备的。"},"examples":[{"en":"The contract is provisionless on what happens if the project is delayed.","zh":"这份合同对项目延期时如何处理没有作出规定。"},{"en":"Many workers felt provisionless for retirement.","zh":"许多工人觉得自己对退休没有做好安排。"}]}],"synonyms":["unsupplied","unprovided","unprepared","without provisions","bare","unprovisioned"],"phonetic":"/prəˈvɪʒənləs/","extraExplanation":["“provisionless”由 provision（供给；准备；条款）+ -less（“没有……”）构成。常见于较正式或文学化表达：既可指“没有携带补给”，也可指“没有作出规定/安排”。在日常口语里，人们更常说 without supplies / unprepared / no provisions.","写作小提示：如果你想表达“合同里没有写/没有规定”，可以用 more natural 的说法：The contract doesn’t provide for… / There’s no provision for…；“没有带食物水”则更常说: We went without supplies/food/water."]}
{"word":"provisionment","summary":{"en":"Provisionment means supplying or arranging necessary supplies (especially food/equipment), often in military, shipping, or expedition contexts.","zh":"Provisionment 指对必需品（尤其食物、装备等）的补给与供应安排，常见于军事、航海或探险等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of supplying people (such as an army, ship, or group) with food, equipment, or other necessities; the arrangement of supplies.","zh":"（向军队、船只或人群）提供食物、装备等必需品的行为或过程；补给的安排。"},"examples":[{"en":"The expedition’s success depended on careful provisionment of food and fuel.","zh":"这次探险的成功取决于对食物和燃料的周密补给安排。"},{"en":"Winter storms delayed the provisionment of remote villages.","zh":"冬季风暴耽误了偏远村庄的物资补给。"}]},{"partOfSpeech":"n.","definition":{"en":"Supplies or provisions provided for a journey or operation (less common).","zh":"为旅程或行动准备的补给品、给养（较少见）。"},"examples":[{"en":"They checked their provisionment before setting sail.","zh":"他们起航前检查了补给品。"}]}],"synonyms":["provisioning","supply","supplying","victualing","stocking"],"phonetic":"/prəˈvɪʒənmənt/","extraExplanation":["“Provisionment”在现代英语里相对少见，更常用的说法是“provisioning”（补给、供给）或“provisions”（给养、补给品）。在军事、航海、探险、救灾等语境中更容易见到。","词根来自“provision”（预备、供给）。在写作中如果你想更自然，通常用“The provisioning of …”来表达“……的补给/供给”。"]}
{"word":"provisions","summary":{"en":"“Provisions” most commonly means supplies (especially food/necessities). It can also mean arrangements made for something, or legal/contract clauses.","zh":"“provisions”最常指（尤指食物等）物资/给养；也可指为某事做的安排/预留，或法律/合同中的条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Supplies of food and other necessities, especially for a journey, emergency, or a period of time.","zh":"（尤指旅行、紧急情况或一段时间内的）食品和生活必需品；储备物资。"},"examples":[{"en":"We packed enough provisions for three days on the trail.","zh":"我们为徒步旅行准备了够三天的给养。"},{"en":"During the storm, the town ran low on provisions.","zh":"暴风雨期间，小镇的物资快不够了。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of providing or supplying something needed (often used in the phrase “make provision(s) for”).","zh":"供给；提供所需之物（常用于短语“make provision(s) for”表示“为……作准备/预留安排”）。"},"examples":[{"en":"The school made provisions for students with disabilities.","zh":"学校为残障学生作了相应的安排。"},{"en":"We should make provision for unexpected costs.","zh":"我们应该为意外开支预留准备。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition or clause in a legal document, contract, law, or agreement.","zh":"（法律、合同、规章中的）条款；规定。"},"examples":[{"en":"The contract includes a provision about late payments.","zh":"合同中包含一条关于逾期付款的条款。"},{"en":"There is a legal provision protecting consumers.","zh":"有一项法律条款保护消费者。"}]}],"synonyms":["supplies","food","stores","rations","arrangements","measures","terms","clauses","stipulations"],"phonetic":"/prəˈvɪʒənz/","extraExplanation":["“provisions”有时会让学习者困惑：它既可以指“物资/给养”，也可以指“条款/规定”。判断方法很实用：如果语境里出现 contract, law, agreement, clause 等词，多半是“条款”；如果出现 food, water, supplies, emergency, travel 等词，多半是“给养/物资”。","语法小提示：表示“物资/给养”时常用复数provisions；表示“条款”时也常用单数a provision或复数provisions（看条款数量）。常见搭配：food provisions（食品储备）、emergency provisions（应急物资/应急措施）、provisions of the contract（合同条款）。"]}
{"word":"provisive","summary":{"en":"Provisive is a rare adjective meaning “providing/making provisions,” and it’s often a misspelling for provisional or provisionary.","zh":"Provisive 是个很罕见的形容词，意为“提供供给/做准备的”；也常被误写来代替 provisional（临时的）或 provisionary（供给/储备用的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Providing or making provisions; intended to supply what is needed.","zh":"（罕见）提供供给或做准备的；旨在提供所需之物的。"},"examples":[{"en":"The charity offered provisive support, including food and temporary housing.","zh":"该慈善机构提供了“供给性的”支持，包括食物和临时住所。"},{"en":"Some older texts use provisive to describe measures taken to ensure future needs are met.","zh":"一些较旧的文本会用 provisive 来描述为满足未来需求而采取的措施。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often a misspelling) Used by learners when they actually mean provisional (“temporary”) or provisionary (“for supplying provisions”).","zh":"（常见拼写误用）学习者有时用 provisive，其实想表达 provisional（临时的）或 provisionary（供给/储备用的）。"},"examples":[{"en":"If you mean “temporary,” use: a provisional plan.","zh":"如果你想表达“临时的”，请用：a provisional plan（临时计划）。"},{"en":"If you mean “supplying provisions,” use: provisionary supplies.","zh":"如果你想表达“供给/储备用的”，请用：provisionary supplies（储备用物资）。"}]}],"synonyms":["providing","provisionary","provisional (often intended)","supplying"],"phonetic":"/proʊˈvaɪsɪv/","extraExplanation":["provisive 在现代英语中非常少见，很多词典不收录或标为罕用。更常用的相关词有：provisional（临时的）、provisionary（供给/储备用的）、providing（提供……的）。","词根提示：provision（供给；准备）来自拉丁语词根，和 provide（提供）、provisions（给养/物资）同源。写作时通常选更常见的词会更自然。"]}
{"word":"proviso","summary":{"en":"A proviso is an added condition or clause, especially in legal or formal writing.","zh":"proviso 指（尤在法律或正式语境中）附加的条件或条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition or requirement attached to an agreement, law, or statement (often introduced by “provided that”).","zh":"（协议、法律或陈述中的）附带条件；限制性条款（常可理解为“在……条件下/但书”）。"},"examples":[{"en":"The contract includes a proviso that you must give 30 days’ notice before leaving.","zh":"合同有一项附带条件：你离职前必须提前30天通知。"},{"en":"We can approve the budget, with the proviso that costs don’t increase later.","zh":"我们可以批准预算，但条件是之后成本不能再上涨。"}]}],"synonyms":["condition","stipulation","clause","reservation","requirement"],"phonetic":"/prəˈvaɪzoʊ/","extraExplanation":["“proviso”常见于正式/法律英语，语气比“condition”更书面、带有条款感。搭配很固定：with the proviso that… / under the proviso that…；也常见“a proviso in the contract/law”。","词源来自拉丁语，原意接近“事先规定/先说好”，因此常用于表达“先把条件讲清楚”的感觉。"]}
{"word":"provisoes","summary":{"en":"A “proviso” is an added condition that limits an agreement or statement; the plural is usually “provisos.”","zh":"“proviso”指附加的限制性条件（但书条款）；其复数通常写作“provisos”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition or requirement added to an agreement, law, or statement; it limits or qualifies what is said (often introduced by “provided that”).","zh":"（合同、法律或陈述中的）附加条件／但书；用于限制或限定前述内容（常见引导词为“provided that”）。"},"examples":[{"en":"I agree to help, with the proviso that you finish your part first.","zh":"我同意帮忙，但条件是你要先完成你那部分。"},{"en":"The contract includes a proviso about late payments.","zh":"合同里有一条关于逾期付款的附加条款。"},{"en":"The policy was approved, subject to a proviso limiting its cost.","zh":"该政策获批，但附带一项限制成本的但书条款。"}]}],"synonyms":["condition","stipulation","provision","caveat","qualification"],"phonetic":"/prəˈvaɪzoʊ/","extraExplanation":["你输入的“provisoes”更常见的标准拼写是“provisos”，是名词“proviso”的复数形式。在法律与商务英语中很常见，用来表示“在某条件成立的前提下”。","“with the proviso that …”语气比日常的“as long as … / on condition that …”更正式，更像书面或合同用语。"]}
{"word":"provisor","summary":{"en":"A provisor is a temporary substitute/acting official; in some European usage, it can mean a pharmacy manager or deputy.","zh":"provisor 指临时代理人/代职者；在一些欧洲用法中也可指药房的管理者或副主管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A temporary substitute or acting official; someone appointed to fill a role for a limited time.","zh":"临时代理人；代职者（在有限时间内暂代某职务的人）。"},"examples":[{"en":"During the director’s illness, a provisor managed the department for two months.","zh":"主任生病期间，一位临时代理人管理了这个部门两个月。"},{"en":"The committee named her provisor until a permanent chair was elected.","zh":"委员会指定她为临时负责人，直到选出正式主席。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in parts of Europe) A manager or deputy in a pharmacy, sometimes the pharmacist in charge.","zh":"（尤指欧洲部分地区）药房的管理者/副主管；有时指负责的药剂师。"},"examples":[{"en":"In some German-speaking contexts, the provisor oversees daily operations in the pharmacy.","zh":"在一些德语语境中，provisor 负责药房的日常运营。"},{"en":"She worked as a provisor while the owner was on leave.","zh":"老板休假时，她以药房代理负责人（provisor）的身份工作。"}]}],"synonyms":["interim","acting official","temporary replacement","substitute","deputy"],"phonetic":"/prəˈvaɪzər/","extraExplanation":["这个词在现代英语里不算常用，很多人更常见到的是 provisional（临时的、暂定的）。provisor 通常指“人”（临时代理者），而 provisional 通常指“事物/安排”（临时的计划、协议等）。","在英美语境中，日常表达更常用 acting director / interim manager / temporary replacement；provisor 更偏正式或受其他语言影响的用法。"]}
{"word":"provisorily","summary":{"en":"“Provisorily” means temporarily or on a provisional (not final) basis.","zh":"“provisorily”表示“暂时地/临时地；暂定地（尚未最终确定）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"For a short time or until something more permanent is decided; temporarily.","zh":"暂时地；临时地（直到做出更长期或永久的决定为止）。"},"examples":[{"en":"We will meet provisorily at the library until the new office is ready.","zh":"在新办公室准备好之前，我们将暂时在图书馆见面。"},{"en":"The family is living provisorily with relatives after the storm.","zh":"暴风雨之后，这家人暂时住在亲戚家。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is based on a provisional (not final) arrangement, plan, or agreement.","zh":"以临时方案/暂定安排的方式；暂定地（基于尚未最终确定的计划或协议）。"},"examples":[{"en":"The dates are set provisorily, so they may change.","zh":"日期是暂定的，所以可能会变。"},{"en":"They agreed provisorily to the budget while waiting for more data.","zh":"在等待更多数据的同时，他们暂时同意了预算。"}]}],"synonyms":["temporarily","provisionally","for the time being","for now"],"phonetic":"/ˌprɑːvəˈzɔːrəli/","extraExplanation":["“provisorily”较正式，常见于公告、法律/行政文件或学术写作中，强调“尚未最终确定”。日常口语中更常用“temporarily”或“for now”。","拼写提示：词根与“provisional（暂定的）”一致，注意是provis-or-ily（不是*provisionally*的同义词；两者都可表示“暂时/暂定”，但“provisorily”更少见、更书面）。"]}
{"word":"provisorship","summary":{"en":"Provisorship means holding the office or temporary appointment of a provost, especially at a university.","zh":"provisorship 指（尤指大学中）担任或暂代教务长（provost）职务的职位/任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A temporary position or appointment in which someone serves as a provost (especially in a university) or holds the title/office of provost.","zh":"（尤指大学中）“教务长/院校教务负责人（provost）”的临时任职、临时职务或暂代职位。"},"examples":[{"en":"During the president’s leave, she took on the provisorship for one semester.","zh":"校长休假期间，她暂代教务长职务一个学期。"},{"en":"His provisorship focused on improving undergraduate teaching and academic standards.","zh":"他在暂代教务长期间主要推动本科教学与学术标准的提升。"}]}],"synonyms":["provostship","interim provost appointment","provost position"],"phonetic":"/ˈprɑːvɪzərˌʃɪp/","extraExplanation":["“Provisorship”属于较少见、偏正式的名词，用来指“担任provost的职位/任期（尤其是临时）”。实际写作中更常见的表达是“(interim) provostship”或“(interim) provost position/appointment”。\n\n英美高校语境中，“provost”通常指负责学术事务的高级行政主管（常译“教务长/学术事务负责人”），不同学校职责范围可能略有差异。"]}
{"word":"provisory","summary":{"en":"Provisory means temporary (provisional) or conditional, especially in formal/legal contexts.","zh":"provisory 指“临时的/暂行的（provisional）”，也可指“附带条件的”，常见于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"temporary and intended to be replaced later; provisional.","zh":"临时的；暂行的；预备性的（之后通常会被正式版本取代）。"},"examples":[{"en":"They made a provisory schedule while they waited for the final exam dates.","zh":"在等待最终考试日期时，他们先做了一份暂行的时间表。"},{"en":"A provisory agreement was signed to keep the project moving.","zh":"为让项目继续推进，他们签署了一份临时协议。"}]},{"partOfSpeech":"adj.","definition":{"en":"made with conditions added (often in formal or legal writing).","zh":"（多用于正式/法律语境）带有附加条件的；以“但书/附则”形式限定的。"},"examples":[{"en":"The funding is provisory on the committee’s approval.","zh":"这笔资金以委员会批准为前提（附条件）。"},{"en":"The policy was described as provisory, depending on future regulations.","zh":"该政策被描述为暂行的，并取决于未来的法规。"}]}],"synonyms":["provisional","temporary","interim","conditional","tentative"],"phonetic":"/prəˈvaɪzəri/","extraExplanation":["“provisory”在现代英语中不如“provisional”常见，很多场合直接用“provisional”更自然。","它与“proviso”（合同或法律条文中的“但书/附则/前提条件”）同源，因此在法律或正式文件里更容易见到“附条件、暂行”的语感。"]}
{"word":"provisos","summary":{"en":"“Provisos” are conditions or stipulations, especially in formal documents.","zh":"“provisos”指（尤用于正式文件中的）附带条件或限制性条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"conditions or requirements that must be met for something to happen or be true; stipulations","zh":"（协议、法律等中的）但书；附带条件；限制性条款"},"examples":[{"en":"The contract includes several provisos about late payments.","zh":"合同里包含了几条关于逾期付款的附带条件。"},{"en":"I’ll agree, but with the proviso that we review the plan next month.","zh":"我同意，但前提是我们下个月要复盘这个计划。"}]}],"synonyms":["conditions","stipulations","terms","requirements","caveats"],"phonetic":"/prəˈvaɪzoʊz/","extraExplanation":["“provisos”是名词“proviso”的复数，常见于法律、合同、规章制度等正式语境。日常口语里更常用“condition(s)”或“as long as…”。","常见搭配：with the proviso that…（条件是……）；subject to the proviso that…（以……为条件）。","词源提示：来自拉丁语proviso（意为“事先规定/预先考虑”），所以语感上带有“预先设定的限制条件”。"]}
{"word":"provitamin","summary":{"en":"A provitamin is a food substance that the body can convert into a vitamin.","zh":"provitamin 指食物中的一种物质，人体可将其转化为某种维生素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance in food that the body can convert into a vitamin","zh":"维生素原；（存在于食物中）可在体内转化为某种维生素的物质"},"examples":[{"en":"Beta-carotene is a provitamin that the body can turn into vitamin A.","zh":"β-胡萝卜素是一种维生素原，人体可以把它转化为维生素A。"},{"en":"Foods rich in provitamin A include carrots, sweet potatoes, and spinach.","zh":"富含维生素A原的食物包括胡萝卜、红薯和菠菜。"}]}],"synonyms":["vitamin precursor","precursor"],"phonetic":"/proʊˈvaɪtəmɪn/","extraExplanation":["“pro-”在这里表示“前体/前身”。因此 provitamin 指“维生素的前体物质”，本身不一定就是该维生素，但进入体内后可被转化。","常见搭配：provitamin A（维生素A原，常指类胡萝卜素如β-胡萝卜素）。注意区分：vitamin A（维生素A，例：视黄醇）与 provitamin A（可转化为维生素A的前体）。"]}
{"word":"provivisection","summary":{"en":"“Provivisection” (more commonly written “pro-vivisection”) means support for vivisection—experiments on live animals for research.","zh":"“provivisection”（更常写作“pro-vivisection”）指支持活体解剖/活体动物实验研究的立场或主张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"support for vivisection (performing experiments on live animals for scientific research).","zh":"支持活体解剖（在活体动物身上进行科学实验/研究）的立场或主张。"},"examples":[{"en":"The senator’s pro-vivisection position drew criticism from animal-rights groups.","zh":"这位参议员支持活体解剖的立场引来了动物权利团体的批评。"},{"en":"The debate focused on whether pro-vivisection policies can be ethical without strict regulation.","zh":"辩论聚焦在：在没有严格监管的情况下，支持活体解剖的政策是否可能合乎伦理。"}]}],"synonyms":["pro-vivisection","support for vivisection","pro–animal testing (context-dependent)"],"phonetic":"/ˌproʊˌvɪvəˈsɛkʃən/","extraExplanation":["这个词通常写作 pro-vivisection（带连字符），在新闻、伦理讨论或政策语境中更常见。它对应的反对立场是 anti-vivisection（反活体解剖）。","vivisection 一词本身带有强烈的历史与情感色彩：在现代科研语境里，人们更常用 animal testing / animal experimentation（动物实验）等更中性或更宽泛的说法。"]}
{"word":"provivisectionist","summary":{"en":"A pro-vivisectionist supports the use of experiments on living animals for scientific or medical research.","zh":"provivisectionist 指支持在活体动物身上进行科学或医学实验的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or advocates vivisection (doing experiments on living animals for scientific research)","zh":"支持或主张活体解剖（在活体动物身上进行科学实验）的人"},"examples":[{"en":"In the early 1900s, pro-vivisectionists argued that animal experiments could save human lives.","zh":"在20世纪初，支持活体解剖的人认为动物实验可以挽救人类生命。"},{"en":"The debate between antivivisectionists and pro-vivisectionists shaped public views of medical research.","zh":"反活体解剖者与支持活体解剖者之间的争论影响了公众对医学研究的看法。"}]}],"synonyms":["supporter of vivisection","advocate of vivisection"],"phonetic":"/ˌproʊˌvɪvəˈsɛkʃənɪst/","extraExplanation":["“vivisection”一词字面意思是“切开活体”，历史上常与生理学、医学研究相关；它在英语世界里带有强烈的伦理争议色彩，因此“pro-vivisectionist”通常出现在辩论、历史文献或新闻评论中，语气可能偏正式或带立场。","常见相关词：antivivisectionist（反对活体解剖者）、animal testing（动物实验，语气更中性、范围更广）、biomedical research（生物医学研究）。"]}
{"word":"provocant","summary":{"en":"Provocant means deliberately provocative—meant to spark strong reactions; less common than “provocative.”","zh":"provocant 指“刻意引起强烈反应的、挑衅/挑逗性的”，在英语中较少见，常用 provocative。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, style, remark, or artwork) intentionally causing strong reactions, especially by being daring, challenging, or sexually suggestive; provocative.","zh":"（指人、风格、言论或艺术作品）刻意引起强烈反应的；（尤指）大胆挑衅的、带有性暗示而引人注目的；挑逗性的。"},"examples":[{"en":"The photographer is known for a provocant style that challenges social norms.","zh":"这位摄影师以挑衅性的风格闻名，常常挑战社会规范。"},{"en":"Some viewers found the ad provocant, while others saw it as artistic.","zh":"一些观众觉得这则广告很挑逗/挑衅，但也有人认为它很有艺术性。"}]},{"partOfSpeech":"n.","definition":{"en":"a provocant person, comment, or thing—something used to provoke a reaction.","zh":"挑衅者；挑衅性的言论或事物（用来激起反应的东西）。"},"examples":[{"en":"He played the role of a provocant, pushing the group into debate.","zh":"他扮演“挑衅者”的角色，把大家推进了辩论。"}]}],"synonyms":["provocative","daring","suggestive","challenging","inflammatory"],"phonetic":"/prəˈvoʊkənt/","extraExplanation":["“provocant”在英语里相对少见，常见、更自然的说法通常是“provocative”。不过在时尚、艺术评论或受法语影响的语境中，你可能会看到“provocant”用来强调“刻意挑起反应”的感觉。","语气提示：它往往带有“故意挑衅/引人遐想”的意味，有时是中性（艺术上大胆），有时偏负面（不合时宜、哗众取宠），具体取决于语境。"]}
{"word":"provocare","summary":{"en":"Provocare is a Romanian word meaning “challenge/provocation,” and an Italian verb meaning “to provoke/challenge.”","zh":"Provocare 在罗马尼亚语中表示“挑战/挑衅”，在意大利语中是动词，意为“挑衅/激怒/挑战”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Romanian) a challenge; a provocation—something that tests you or pushes you to react.","zh":"（罗马尼亚语）挑战；挑衅——指考验你或促使你做出反应的事情。"},"examples":[{"en":"For her, the new job was a real provocare.","zh":"对她来说，这份新工作是真正的挑战（provocare）。"},{"en":"Don’t take his comments as a provocare; stay calm.","zh":"别把他的话当成挑衅（provocare）；保持冷静。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Italian) to provoke; to cause a reaction (often anger), or to challenge someone.","zh":"（意大利语）挑衅；激怒；引发反应；向某人发起挑战。"},"examples":[{"en":"In Italian, provocare means “to provoke.”","zh":"在意大利语里，provocare 的意思是“挑衅/激怒”。"},{"en":"Try not to provocare people online; it can start arguments.","zh":"尽量不要在网上挑衅（provocare）别人；这很容易引发争吵。"}]}],"synonyms":["challenge","provocation","dare","provoke","incite"],"phonetic":"/ˌproʊvoʊˈkɑːreɪ/","extraExplanation":["“provocare”在英语里不是常用词，但在多语言环境（如意大利语/罗马尼亚语使用者的英语表达）中偶尔会直接借用。","同源词背景：它们与英语 provoke（挑衅/激怒）同源，都可追溯到拉丁语 provocare（“召唤出来、挑战”）的概念。"]}
{"word":"provocateur","summary":{"en":"A provocateur is someone who deliberately stirs up strong reactions or conflict, often to influence or disrupt others.","zh":"provocateur 指故意挑起强烈反应或冲突的人，常带“煽动、挑拨”的负面含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who deliberately provokes trouble, conflict, or strong reactions, often to influence events or expose weaknesses.","zh":"（常指故意）挑起麻烦、冲突或激烈反应的人；煽动者。"},"examples":[{"en":"The journalist was sometimes seen as a provocateur because his questions made powerful people uncomfortable.","zh":"这位记者有时被视为“挑衅者/煽动者”，因为他的问题让有权势的人感到不舒服。"},{"en":"Online provocateurs post extreme comments to start arguments.","zh":"一些网络煽动者会发布极端言论来挑起争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone (often secretly) who incites others to cause political disorder or unrest.","zh":"（常带政治含义，且可能暗中）煽动他人制造动乱的人；挑拨者。"},"examples":[{"en":"The government blamed provocateurs for the violence during the protest.","zh":"政府把抗议期间的暴力事件归咎于“煽动者”。"},{"en":"They suspected a provocateur was trying to turn a peaceful march into a riot.","zh":"他们怀疑有人在暗中煽动，想把和平游行变成暴乱。"}]}],"synonyms":["agitator","instigator","troublemaker","rabble-rouser","stirrer"],"phonetic":"/prəˌvɑkəˈtɝ/","extraExplanation":["这个词来自法语 provocateur，和英语 provoke（挑衅、激怒）同源，因此语气通常偏负面：强调“故意引发反应/冲突”。","在艺术与文化语境里，provocateur 有时也可带一点“挑战常规、故意引发讨论”的意味（如“时尚界的 provocateur”），但仍常暗含争议性。常见搭配：political provocateur（政治煽动者）、online provocateur（网络挑衅者/煽动者）。"]}
{"word":"provocateurs","summary":{"en":"Provocateurs are people who intentionally provoke others, often to create conflict; the word is also used in political/social contexts for those who stir up unrest.","zh":"Provocateurs 指故意挑衅、激怒他人以制造冲突的人；也常用于政治/社会语境，指挑起动荡或争议的煽动者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who deliberately provoke, annoy, or challenge others—often to cause an argument, conflict, or strong reaction.","zh":"挑衅者；煽动者：故意激怒、挑战或刺激他人，常为了引发争吵、冲突或强烈反应的人。"},"examples":[{"en":"Online provocateurs posted inflammatory comments to start fights in the discussion.","zh":"一些网络挑衅者发布煽动性评论，想在讨论中挑起争端。"},{"en":"The speaker ignored the provocateurs and stayed focused on the main topic.","zh":"演讲者无视那些挑衅者，继续专注于主题。"}]},{"partOfSpeech":"n.","definition":{"en":"People who stir up political or social unrest or controversy, sometimes to influence public opinion or events.","zh":"（政治/社会）煽动者：挑起动荡或争议的人，有时为了影响舆论或事件走向。"},"examples":[{"en":"The government accused a small group of provocateurs of encouraging violence.","zh":"政府指责一小群煽动者鼓动暴力。"},{"en":"Peaceful organizers tried to keep provocateurs from disrupting the march.","zh":"和平组织者努力防止煽动者破坏游行。"}]}],"synonyms":["agitators","instigators","troublemakers","rabble-rousers","provokers"],"phonetic":"/prəˈvɑkətɝz/","extraExplanation":["“provocateurs”是复数形式，单数是“provocateur”。这个词来自法语，在英语里常带有负面含义：强调“故意”挑起冲突或制造麻烦，而不只是普通的“批评者/反对者”。","在新闻语境中，“provocateur”有时指“agent provocateur（挑衅特工/卧底煽动者）”，即假装参与某个群体、却暗中挑起违法或暴力行为以达到某种目的的人。阅读报道时要注意其是否为指控或中性描述。"]}
{"word":"provocation","summary":{"en":"Provocation means a deliberate act or comment that tries to make someone react—often with anger; it can also mean a trigger that causes a strong reaction.","zh":"Provocation 指故意激起他人反应（常是愤怒）的挑衅言行；也可指引发强烈反应的诱因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an action, remark, or event that is meant to annoy someone or make them react, often in an angry way","zh":"挑衅；挑拨；激怒他人的言行或事件（常引发愤怒反应）"},"examples":[{"en":"He stayed calm and refused to respond to the provocation.","zh":"他保持冷静，拒绝对挑衅作出回应。"},{"en":"Her rude comment felt like a provocation.","zh":"她那句粗鲁的话听起来像是在挑衅。"}]},{"partOfSpeech":"n.","definition":{"en":"a cause or reason that leads to strong feelings or a particular reaction","zh":"刺激因素；诱因（引发强烈情绪或某种反应的原因）"},"examples":[{"en":"Stress can be a provocation for headaches.","zh":"压力可能是引发头痛的诱因。"}]}],"synonyms":["challenge","taunt","insult","incitement","trigger"],"phonetic":"/ˌprɑvəˈkeɪʃən/","extraExplanation":["“Provocation”常见搭配：without provocation（无缘无故地）、respond to a provocation（回应挑衅）、an act of provocation（挑衅行为）。","语气上，“provocation”比“annoyance（烦恼）”更强，通常暗含“故意引你反应/失控”的意思；在新闻或国际关系语境中也常用来指“挑衅行为”。","词源上来自拉丁语 provōcāre，含“呼唤出来、挑战”的意思，因此带有“引对方出手/出声”的感觉。"]}
{"word":"provocational","summary":{"en":"Provocational means intended to provoke strong reactions or debate; it can also mean sexually suggestive depending on context.","zh":"provocational 指“故意引发强烈反应或争议的”，在某些语境下也可指“带性暗示、性感撩人的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to cause a strong reaction (such as anger, shock, or interest), often by challenging what people consider acceptable.","zh":"旨在引发强烈反应（如愤怒、震惊或兴趣）的；常通过挑战人们认为“可接受”的界限来刺激他人。"},"examples":[{"en":"The article took a provocative position on immigration policy.","zh":"这篇文章在移民政策上采取了挑衅性/煽动争议的立场。"},{"en":"Her provocative question made the whole class think more deeply.","zh":"她那个发人深省但带刺激性的提问让全班思考得更深入。"},{"en":"Some viewers found the film provocative, while others found it offensive.","zh":"一些观众觉得这部电影很具挑衅性/引人争议，而另一些人觉得它冒犯。"}]},{"partOfSpeech":"adj.","definition":{"en":"(About clothing or behavior) Sexually suggestive; likely to attract attention in a sexual way.","zh":"（指穿着或行为）带性暗示的；性感撩人的，容易以性方式吸引注意。"},"examples":[{"en":"He thought her outfit was too provocative for the office.","zh":"他觉得她的穿着对办公室来说太过性感/不合适。"},{"en":"The ad was criticized for using provocative imagery to sell products.","zh":"这则广告因用带性暗示的画面来推销产品而受到批评。"}]}],"synonyms":["provocative","inflammatory","controversial","incendiary","stimulating","thought-provoking","suggestive"],"phonetic":"/prəˈvɑkətɪv/","extraExplanation":["“provocative”来自“provoke”（激起、挑起），常用于讨论观点、艺术、电影、写作等：既可能是“引发思考、引发讨论”，也可能是“挑衅、惹怒”。语气是褒贬皆可，取决于语境。","与“provoking”相比：“provocative”更强调“有意为之/带目的性”；“provoking”更像“造成了某种反应”（不一定是故意）。","使用时要注意场合：谈论服装或身体相关时，容易带评价色彩，可能让人不舒服；更中性替代可用“revealing（暴露的）”“suggestive（暗示性的）”“attention-grabbing（吸睛的）”。"]}
{"word":"provocations","summary":{"en":"“Provocations” means actions/words meant to provoke someone, or more broadly, causes that trigger a strong (often negative) reaction.","zh":"“Provocations”指挑衅性的言行，或更广义上指引发强烈（常为负面）反应的诱因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Statements or actions intended to make someone angry or to trigger a strong reaction.","zh":"故意激怒他人或引发强烈反应的言行；挑衅。"},"examples":[{"en":"His constant provocations eventually started an argument.","zh":"他不断的挑衅最终引发了一场争吵。"},{"en":"The coach warned the team not to respond to provocations from the crowd.","zh":"教练警告队员不要回应观众的挑衅。"},{"en":"Online provocations can spread quickly and turn into harassment.","zh":"网络上的挑衅可能迅速扩散并演变成骚扰。"}]},{"partOfSpeech":"n.","definition":{"en":"Things that cause a particular reaction or event, especially a negative one (often followed by “for” or “to”).","zh":"引发某种反应或事件的原因（尤指负面结果；常与 for/to 连用）。"},"examples":[{"en":"Stress and lack of sleep are provocations for mistakes.","zh":"压力和睡眠不足是导致错误的诱因。"},{"en":"The sudden price increase was a provocation to public anger.","zh":"价格突然上涨成了公众愤怒的导火索。"}]}],"synonyms":["taunts","insults","incitements","triggers","instigations"],"phonetic":"/ˌpɹɑv.əˈkeɪ.ʃənz/","extraExplanation":["“provocation”的复数是“provocations”。它既可指“挑衅行为/言语”，也可更宽泛地指“诱因、导火索”。在新闻语境中常见搭配：without provocation（无端挑衅/无缘无故）、act of provocation（挑衅行为）、respond to provocation（回应挑衅）。"]}
{"word":"provocative","summary":{"en":"“Provocative” describes something that is meant to provoke a strong reaction—either to spark debate/thought or, in some contexts, to be sexually suggestive.","zh":"“Provocative”指“引发强烈反应”的事物：可以是引发思考与争论的“挑衅性/发人深省”，也可在某些语境中指“带性暗示、较暴露”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to cause a strong reaction—often interest, debate, or anger—by being surprising, challenging, or slightly offensive.","zh":"旨在引发强烈反应（常见为兴趣、争论或愤怒）的；因出人意料、挑战常规或略带冒犯而“挑衅”的。"},"examples":[{"en":"The article made a provocative claim about social media and mental health.","zh":"这篇文章提出了一个关于社交媒体与心理健康的挑衅性观点。"},{"en":"Her provocative questions pushed the class to think more deeply.","zh":"她那些发人深省（带点挑衅）的提问促使全班更深入思考。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of clothing, images, or behavior) Sexually suggestive in a way that may attract attention or be considered inappropriate in some settings.","zh":"（指衣着、图像或行为）带有性暗示、引人注目的；在某些场合可能被认为不恰当。"},"examples":[{"en":"The ad was criticized for using provocative imagery.","zh":"这则广告因使用带有性暗示的画面而受到批评。"},{"en":"The dress looked fine for a party, but it felt too provocative for the office.","zh":"这条裙子参加派对没问题，但在办公室里显得过于暴露/挑逗。"}]}],"synonyms":["provoking","controversial","inflammatory","challenging","thought-provoking","suggestive"],"phonetic":"/prəˈvɑkətɪv/","extraExplanation":["词源提示：provocative 来自拉丁语 pro-（向前）+ vocare（呼唤），本义接近“把反应‘激’出来”。所以它既可偏中性（引发思考、讨论），也可偏负面（故意挑衅、惹怒）。","语用差异：形容“观点/问题/艺术”时，常可理解为“发人深省、引发讨论”；形容“言行/言论”时，更容易带“故意挑衅”的负面色彩；形容“衣着/画面”时，多指“性感、带性暗示”。使用时注意场合与文化差异。"]}
{"word":"provocatively","summary":{"en":"Provocatively means “in a way that provokes a strong reaction,” sometimes “in a sexually suggestive or boldly challenging way,” and it can also mean “in a thought-provoking way.”","zh":"provocatively 指“以引发强烈反应的方式（常带挑衅或大胆挑战）”，也可指“以发人深省、引人思考的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is intended to cause a strong reaction (such as shock, anger, curiosity, or excitement), often by challenging what people think is normal or acceptable.","zh":"以挑衅或煽动的方式；故意引发强烈反应（如震惊、愤怒、好奇或兴奋），常常是挑战人们认为正常或可接受的事。"},"examples":[{"en":"The article was written provocatively to spark debate about censorship.","zh":"这篇文章用挑衅性的语气写成，目的是引发关于审查制度的讨论。"},{"en":"She dressed provocatively at the party and drew a lot of attention.","zh":"她在派对上穿得很性感惹眼，吸引了很多目光。"},{"en":"He spoke provocatively, as if he wanted someone to argue with him.","zh":"他说话很挑衅，好像就想让别人跟他争辩。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is stimulating or thought-provoking; likely to make people think deeply.","zh":"以发人深省的方式；引人思考、激发思维的。"},"examples":[{"en":"The professor phrased the question provocatively so students would reconsider their assumptions.","zh":"教授把问题问得很有启发性，让学生重新审视自己的假设。"},{"en":"The film ends provocatively, leaving viewers to decide what is right.","zh":"电影以耐人寻味的方式结尾，让观众自己判断什么是对的。"}]}],"synonyms":["provokingly","controversially","boldly","defiantly","incitingly","suggestively","thought-provokingly"],"phonetic":"/prəˈvɑkətɪvli/","extraExplanation":["“provocatively”来自形容词“provocative”（挑衅的/引人深思的）。在日常语境里它既可能指“故意惹怒/挑战他人”，也常用于谈论穿着或广告，暗含“性感撩人”的意味；用于学术或艺术评论时，则更偏“引人思考、敢于提出尖锐观点”。建议根据场合选择同义替换：想强调“挑衅”可用“deliberately/controversially”；想强调“发人深省”可用“thought-provokingly”。"]}
{"word":"provocativeness","summary":{"en":"Provocativeness means the quality of being provocative—likely to trigger strong reactions, debate, or controversy; sometimes it also refers to sexual suggestiveness.","zh":"Provocativeness 指“挑衅性/煽动性”的特质，容易引发强烈反应、讨论或争议；在某些语境中也可指“性感挑逗/性暗示”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being likely to provoke a strong reaction (such as interest, debate, anger, or excitement), often by being bold, challenging, or controversial.","zh":"“挑衅性/煽动性”的特质：容易引发强烈反应（如兴趣、争论、愤怒或兴奋），常因大胆、挑战或具争议而产生。"},"examples":[{"en":"The provocativeness of the headline sparked a heated debate online.","zh":"这个标题的煽动性在网上引发了激烈的争论。"},{"en":"Some viewers liked the film’s provocativeness, while others found it offensive.","zh":"一些观众喜欢这部电影的挑衅性，但也有人觉得它很冒犯。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, the quality of being sexually suggestive or enticing in a way that attracts attention.","zh":"在某些语境中，指“性感撩人/性暗示”的特质：以带有性暗示的方式吸引注意。"},"examples":[{"en":"The advertisement was criticized for the provocativeness of its imagery.","zh":"这则广告因画面过于性感挑逗而受到批评。"},{"en":"She chose an outfit that felt confident without relying on provocativeness.","zh":"她选了一套让自己很自信、但不靠性感挑逗取胜的穿搭。"}]}],"synonyms":["provocation","edginess","controversiality","incitement","suggestiveness"],"phonetic":"/prəˈvɑkətɪvnəs/","extraExplanation":["“provocativeness”来自形容词“provocative（挑衅的/煽动的）”，再加名词后缀“-ness”表示“……的特质”。","语气与场景很关键：在艺术、写作、社会议题里常偏中性（强调“引人思考/引发讨论”）；在穿着、广告等语境里可能带负面评价（强调“过度挑逗/不当”）。","常见搭配：the provocativeness of + 名词（a remark/headline/ad）；也常与“controversy（争议）”“backlash（反弹）”“spark debate（引发讨论）”连用。"]}
{"word":"provocator","summary":{"en":"A provocator is someone who intentionally provokes others or stirs conflict.","zh":"provocator 指故意挑衅他人、挑起冲突的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who deliberately provokes others; an instigator who tries to start trouble or stir strong reactions.","zh":"挑衅者；煽动者（故意激怒别人、挑起争端或引发强烈反应的人）。"},"examples":[{"en":"Online, a provocator posted insulting comments to start a fight in the comments section.","zh":"在网上，一个挑衅者发了侮辱性评论，想在评论区挑起争吵。"},{"en":"The coach warned the players not to react when a provocator tried to distract them.","zh":"教练提醒队员，遇到挑衅者故意干扰时不要上当反应。"}]}],"synonyms":["provocateur","provoker","instigator","agitator","rabble-rouser"],"phonetic":"/ˈprɑvəˌkeɪtər/","extraExplanation":["“provocator”在现代英语中不如“provocateur”常见，很多情况下人们更倾向用provocateur（尤其指“故意挑衅以引发反应的人”，也常用于政治/媒体语境）。在正式写作中，若想避免生硬或不常见的词形，可以优先选用“provocateur”或更通用的“provoker/instigator”。","词根来自拉丁语provocare（pro- 向前 + vocare 呼喊/召唤），核心含义是“引发、挑动”。"]}
{"word":"provocatory","summary":{"en":"Provocatory means intentionally causing a strong reaction; it is a less common synonym of provocative.","zh":"provocatory 指“故意引发强烈反应的；挑衅/煽动的”，是较少见的 provocative 的同义词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to provoke a reaction (often anger, debate, or strong feelings); provocative.","zh":"意在激起反应的（常指愤怒、争论或强烈情绪）；挑衅的；煽动性的。"},"examples":[{"en":"The article’s tone felt provocatory, designed to spark outrage rather than discussion.","zh":"这篇文章的语气很煽动性，似乎是为了激起愤怒而不是讨论。"},{"en":"He made a provocatory remark during the meeting, and the room went quiet.","zh":"他在会议上说了一句挑衅的话，现场一下子安静了。"}]}],"synonyms":["provocative","inflammatory","incendiary","provoking"],"phonetic":"/prəˈvɑkəˌtɔri/","extraExplanation":["“provocatory”在现代英语中比较少见，日常更常用“provocative”。在正式写作或较旧的文本里可能会见到“provocatory”。语气上通常带有“故意挑起情绪/争议”的含义。"]}
{"word":"provokable","summary":{"en":"“Provokable” means “able to be provoked; easily made to react (often angrily).”","zh":"“provokable”意为“可被激怒的；容易被挑起（常指愤怒等强烈反应）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be provoked; likely to cause someone to react (especially with anger or strong emotion) if you push them","zh":"可被激怒的；（在刺激、挑衅下）容易被引发强烈反应的"},"examples":[{"en":"He’s usually calm, but he can be provokable when people insult his family.","zh":"他平时很冷静，但如果有人侮辱他的家人，他就可能被激怒。"},{"en":"The topic is provokable in online discussions, so try to speak carefully.","zh":"这个话题在网络讨论中很容易引发激烈反应，所以尽量谨慎表达。"}]}],"synonyms":["easily provoked","irritable","touchy","reactive","quick-tempered"],"phonetic":"/prəˈvoʊkəbəl/","extraExplanation":["“provokable”在现代英语里不算常见，更常见的同义表达是“easily provoked”或“likely to be provoked”。另外也有人用拼写变体“provocable”。","注意不要和“provocative”混淆：provocative 通常指“挑衅的／引人争议或引发反应的”，强调事物本身“在挑动别人”；provokable 强调某人或某种情境“容易被激起反应”。"]}
{"word":"provoke","summary":{"en":"Provoke means to cause or trigger a strong reaction, or to deliberately annoy someone to get a response.","zh":"Provoke 指“引起/诱发强烈反应”，也可指“故意挑衅、惹怒他人以引出反应”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause a reaction or feeling, especially a strong one (such as anger, interest, or debate)","zh":"引起（反应或情绪），尤指强烈反应（如愤怒、兴趣或争论）"},"examples":[{"en":"The article provoked a lot of discussion online.","zh":"这篇文章在网上引发了很多讨论。"},{"en":"His comment provoked anger in the audience.","zh":"他的评论激起了观众的愤怒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to intentionally make someone angry or upset, often to get a response or start a conflict","zh":"故意激怒/挑衅某人，常为逼对方回应或引发冲突"},"examples":[{"en":"Stop provoking your sister—she’s already tired.","zh":"别再挑衅你妹妹了——她已经很累了。"},{"en":"He provoked the other team to distract them.","zh":"他故意挑衅对方球队来分散他们的注意力。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring about or trigger something (often used in formal or scientific contexts)","zh":"引发、诱发（常用于正式或科学语境）"},"examples":[{"en":"The test is designed to provoke an immune response.","zh":"该测试旨在诱发免疫反应。"},{"en":"Lack of sleep can provoke headaches.","zh":"睡眠不足可能诱发头痛。"}]}],"synonyms":["trigger","spark","incite","stir up","prompt","antagonize"],"phonetic":"/prəˈvoʊk/","extraExplanation":["词源上，provoke 来自拉丁语 pro-（向前）+ vocare（呼喊、叫喊），原意带有“把（某事）叫出来、引出来”的感觉，所以既可以是“引发讨论/反应”，也可以是“故意惹怒别人”。","语气区别：provoke 比 make someone angry 更带“刺激、挑衅、故意或间接造成”的意味；在新闻或学术语境中，常用 provoke 表示“引发（争议/反应）”，不一定包含恶意。","常见搭配：provoke a reaction/response；provoke anger/controversy；be provoked into doing something（被激得做某事）。"]}
{"word":"provoked","summary":{"en":"“Provoked” means caused a reaction—often anger—or is the past form of “provoke.”","zh":"“provoked”表示“激起反应（常指愤怒）”，也可作“provoke”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made someone feel angry or annoyed; caused a strong negative reaction","zh":"激怒了；惹恼了；引起强烈负面反应"},"examples":[{"en":"His rude comment provoked her, and she walked away.","zh":"他那句粗鲁的话惹恼了她，她转身走开了。"},{"en":"Don’t say that—it will only provoke an argument.","zh":"别这么说——只会引发争吵。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “provoke”: to cause a reaction, especially anger; to trigger something","zh":"“provoke”的过去式/过去分词：激起（尤其是愤怒）；引发；触发（某事）"},"examples":[{"en":"The decision provoked protests across the city.","zh":"这项决定引发了全城的抗议。"},{"en":"Her question provoked a thoughtful silence.","zh":"她的问题引发了一阵意味深长的沉默。"},{"en":"The dog was provoked and tried to bite.","zh":"那只狗被激怒了，试图咬人。"}]}],"synonyms":["angered","irritated","triggered","incited","stirred up"],"phonetic":"/prəˈvoʊkt/","extraExplanation":["“provoke”常带有“故意惹起反应”的意味，语气比 “cause” 更强，尤其常用于“激怒/挑衅”。在写作里也可用于中性或积极的“激发思考/引起讨论”，如 provoke debate / provoke curiosity。","常见搭配：provoke anger (激起愤怒), provoke an argument (引发争吵), provoke a reaction (引起反应), provoke protests (引发抗议), be provoked into doing sth（被激得做某事，如：He was provoked into shouting. 他被激得喊了出来）。"]}
{"word":"provokee","summary":{"en":"Provoke means to cause a strong reaction or intentionally annoy/challenge someone so they react.","zh":"Provoke 指“引起强烈反应”，也可指“故意挑衅、惹恼某人使其反应”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause a reaction, feeling, or event (often a strong one)","zh":"引起；激起（反应、情绪或事件，常指强烈的）"},"examples":[{"en":"The speech provoked anger across the country.","zh":"这场演讲在全国引发了愤怒。"},{"en":"That movie scene provoked a lot of discussion online.","zh":"那段电影情节在网上引起了很多讨论。"}]},{"partOfSpeech":"vt.","definition":{"en":"to intentionally annoy or challenge someone so they react","zh":"故意惹恼；挑衅（使某人做出反应）"},"examples":[{"en":"He kept making jokes to provoke her.","zh":"他不停开玩笑来惹她生气。"},{"en":"Don’t provoke the dog—it might bite.","zh":"别去招惹那只狗——它可能会咬人。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something serious, especially conflict or violence, to start","zh":"引发（冲突、争端或暴力等严重后果）"},"examples":[{"en":"The attack provoked a wider conflict.","zh":"这次袭击引发了更大范围的冲突。"},{"en":"Careless words can provoke a fight.","zh":"不经意的话可能引发争吵。"}]}],"synonyms":["cause","trigger","spark","arouse","incite","antagonize"],"phonetic":"/prəˈvoʊk/","extraExplanation":["你输入的“provokee”通常是拼写错误；正确拼写是 **provoke**。","常见搭配：**provoke a reaction/response**（引起反应）、**provoke anger/criticism**（激起愤怒/招致批评）、**provoke someone into doing sth**（挑衅某人使其做某事）。","语气与文化提醒：在公共讨论中说某人“provoked”别人，可能暗示对方“有意挑衅”，带一点指责意味；如果只是“引发/导致”，可用更中性的 **cause/trigger**。"]}
{"word":"provoker","summary":{"en":"“Provoker” usually means a person who deliberately stirs trouble or anger; less commonly, it can mean something that triggers a reaction.","zh":"“provoker”通常指故意挑起麻烦或激怒他人的人；较少见时也可指引发反应的诱因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who intentionally causes a strong reaction (such as anger, argument, or trouble) by teasing, challenging, or stirring conflict.","zh":"挑衅者；煽动者：故意引发他人强烈反应（如愤怒、争吵或麻烦）的人，通过逗弄、挑战或挑起冲突来激化局面。"},"examples":[{"en":"Don’t let the provoker control the conversation—stay calm and stick to the facts.","zh":"别让挑衅者控制谈话——保持冷静，专注事实。"},{"en":"Online provokers often post rude comments just to start a fight.","zh":"网络上的挑衅者常常发粗鲁评论，只为挑起争端。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (such as a statement, action, or event) that triggers a reaction, especially a negative one.","zh":"诱因；引发因素：引起反应（尤其是负面反应）的事物（如言论、行为或事件）。"},"examples":[{"en":"His sarcastic remark was the provoker of the argument.","zh":"他那句讽刺的话成了争吵的导火索。"},{"en":"In the report, stress is described as a common provoker of headaches.","zh":"报告中提到，压力是头痛的常见诱因。"}]}],"synonyms":["agitator","instigator","troublemaker","antagonist","provocateur","trigger","catalyst"],"phonetic":"/prəˈvoʊkər/","extraExplanation":["“provoker”来自动词 provoke（挑衅；激怒；引发）。在日常英语里更常见的是“provocateur”（带有“煽动者/挑事者”的语气，更偏新闻或正式语境）或直接说“someone who provokes others”。","用在“人”的意思时通常带贬义；用在“诱因”的意思时更中性，常见搭配有 provoker of + 情绪/问题（例如 provoker of conflict/violence/anxiety）。"]}
{"word":"provokers","summary":{"en":"“Provokers” are people who deliberately provoke others to get a reaction.","zh":"“provokers”指故意挑衅、激怒他人以引发反应的人（provoker 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who provoke others—by deliberately causing anger, arguments, or strong reactions.","zh":"挑衅者；煽动者（故意惹怒他人、引发争吵或强烈反应的人）"},"examples":[{"en":"Online provokers often post rude comments just to start arguments.","zh":"网络上的挑衅者常常发刻薄评论，只为挑起争吵。"},{"en":"The coach warned the team not to react to the provokers in the crowd.","zh":"教练提醒队员不要被看台上的挑衅者激怒而做出反应。"}]}],"synonyms":["agitators","instigators","trolls","troublemakers"],"phonetic":"/prəˈvoʊkərz/","extraExplanation":["“provokers”是“provoker”的复数。来自动词“provoke”（挑衅、激怒、引发）。在新闻或社交媒体语境里，它常带负面含义，暗示对方故意“带节奏/拱火”。","近义表达（语气有差别）：“agitators”（煽动者，更偏政治/社会运动）、“instigators”（挑起事端者）、“trolls”（网络喷子/钓鱼者，偏网络文化）。"]}
{"word":"provokes","summary":{"en":"“Provokes” means causes a strong reaction, often by irritating someone or triggering an event; it’s the third-person singular of “provoke.”","zh":"“provokes”表示引起强烈反应（常含激怒/挑衅意味）或触发事件，是“provoke”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cause a reaction (often strong), such as anger, fear, laughter, or discussion","zh":"引起（通常较强烈的）反应，如愤怒、恐惧、笑声或讨论"},"examples":[{"en":"The politician’s comments provoked public outrage.","zh":"那位政治人物的言论引发了公众的愤怒。"},{"en":"That movie ending provokes a lot of debate.","zh":"那部电影的结局引起了很多争论。"},{"en":"The smell of fresh bread provokes happy memories for me.","zh":"新鲜面包的香味会唤起我快乐的回忆。"}]},{"partOfSpeech":"v.","definition":{"en":"to deliberately make someone angry or upset; to pick a fight","zh":"故意激怒某人；挑衅（找茬）"},"examples":[{"en":"Stop provoking your sister—she’s trying to study.","zh":"别再故意惹你妹妹了——她在学习。"},{"en":"He kept provoking the other team during the game.","zh":"比赛中他一直在挑衅对方球队。"}]},{"partOfSpeech":"v.","definition":{"en":"to lead to or trigger a particular action or event","zh":"促使；触发（某个行动或事件）"},"examples":[{"en":"The report provoked the company to change its policy.","zh":"这份报告促使公司改变了政策。"},{"en":"A minor incident provoked a larger protest.","zh":"一个小事件触发了更大规模的抗议。"}]}],"synonyms":["cause","trigger","spark","stir up","incite","irritate","antagonize"],"phonetic":"/prəˈvoʊks/","extraExplanation":["“provokes”是动词“provoke”的第三人称单数（he/she/it provokes）。常见搭配：provoke anger/controversy/laughter（引发愤怒/争议/笑声）；provoke someone into doing something（激得某人去做某事）。","语气提示：provoke往往带有“引发强烈反应、甚至带点挑衅/激怒”的感觉；如果只是中性地表示“引起”，可以用cause/lead to。"]}
{"word":"provoking","summary":{"en":"“Provoking” usually means either “causing strong feelings or thought” (stimulating) or “annoying/challenging someone to get a reaction.”","zh":"“provoking”常指“引起强烈情绪或思考（发人深省）”，也可指“挑衅/惹恼他人以引发反应”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing a strong reaction (such as anger, interest, or thought); stimulating","zh":"引起强烈反应的（如愤怒、兴趣或思考）；发人深省的"},"examples":[{"en":"The article was provoking, and it sparked a heated debate.","zh":"这篇文章很挑衅/发人深省，引发了激烈的争论。"},{"en":"She asked a provoking question that made everyone stop and think.","zh":"她提出了一个发人深省的问题，让大家都停下来思考。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “provoke”: causing someone to feel angry or react; intentionally annoying or challenging someone","zh":"“provoke”的现在分词：激怒/刺激某人产生反应；故意惹恼或挑衅某人"},"examples":[{"en":"He kept provoking his brother until they argued.","zh":"他一直挑衅/惹他哥哥，直到两人吵起来。"},{"en":"Stop provoking her—she’s already upset.","zh":"别再刺激她了——她已经很难过了。"}]}],"synonyms":["stimulating","thought-provoking","inflammatory","irritating","challenging"],"phonetic":"/prəˈvoʊkɪŋ/","extraExplanation":["“provoking”有两种常见用法：一是形容词，偏“发人深省/引人深思”（provoking question/thought）；二是动词进行时或分词结构，偏“挑衅/惹怒”（provoking someone）。具体含义通常由搭配决定。","在语气上，provoking 既可能是负面的“挑衅”，也可能是中性的“激发思考”。例如 provoking debate 在学术语境中更接近“引发讨论”，不一定是故意惹怒。"]}
{"word":"provokingly","summary":{"en":"“Provokingly” means “in a deliberately provocative way,” either to trigger a reaction/argument or (less commonly) to be sexually suggestive.","zh":"“provokingly”表示“以挑衅的方式”，常指故意引发反应/争论；较少见时也指“以挑逗（带性暗示）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is intended to provoke someone—often by causing anger, strong feelings, or a reaction.","zh":"以挑衅的方式；故意激怒或引发强烈反应的方式。"},"examples":[{"en":"He spoke provokingly, as if he wanted an argument.","zh":"他说话带着挑衅，仿佛就是想吵一架。"},{"en":"The article was written provokingly to spark debate.","zh":"这篇文章写得很“挑衅”，目的是引发讨论。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is sexually suggestive or meant to attract attention.","zh":"以挑逗的方式；带有性暗示、意在吸引注意的方式。"},"examples":[{"en":"She posed provokingly for the camera.","zh":"她对着镜头摆出挑逗的姿势。"}]}],"synonyms":["provocatively","defiantly","tauntingly","baitingly","suggestively"],"phonetic":"/prəˈvoʊkɪŋli/","extraExplanation":["“Provokingly”来自形容词“provoking”（挑衅的/引人反应的）+ 副词后缀“-ly”。它不一定都是负面：在写作或艺术里，也常表示“故意刺激思考、引发讨论”。","语气差别：provokingly 更强调“故意惹你有反应”；相近的“annoyingly”更像“让人烦”，不一定是刻意挑衅；“controversially”更偏“有争议”。","第二个义项（挑逗/性感暗示）在不同文化语境中敏感度不同，使用时要注意场合与对象，避免冒犯。"]}
{"word":"provokingness","summary":{"en":"Provokingness means the quality of being provoking—either irritating/triggering reactions or (less commonly) making people think deeply.","zh":"Provokingness 指“挑衅/惹恼性”，也可（较少见）指“引人思考、发人深省的特质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being provocative—causing anger, irritation, or a strong reaction (often on purpose)","zh":"挑衅性；惹恼性（常指故意引发愤怒、反感或强烈反应的特质）"},"examples":[{"en":"The provokingness of his comments made the meeting tense.","zh":"他那番话的挑衅性让会议气氛变得紧张。"},{"en":"She apologized for the provokingness of her joke.","zh":"她为那个惹恼人的玩笑道了歉。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being thought-provoking—making people think carefully or question ideas","zh":"发人深省；引人思考（促使人认真思考或质疑观点的特质）"},"examples":[{"en":"The provokingness of the novel comes from its moral questions.","zh":"这本小说之所以发人深省，在于它提出的道德问题。"},{"en":"I liked the provokingness of the documentary—it didn’t give easy answers.","zh":"我喜欢这部纪录片的引人思考之处——它没有给出简单答案。"}]}],"synonyms":["provocativeness","provocation","irritating quality","incitement","thought-provoking quality"],"phonetic":"/prəˈvoʊkɪŋnəs/","extraExplanation":["“provokingness”在现代英语里不算常用，更常见的表达是“provocativeness”（更偏“挑衅/煽动”）或“provocation”（挑衅/刺激这一行为或言语）。如果你想表达“引人思考”，也常用“thought-provoking quality”或直接用形容词“thought-provoking”。","词根提示：provok(e) 来自拉丁语，含义接近“召唤出来/引出”，所以既可指“引出怒火”，也可指“引出思考”。"]}
{"word":"provola","summary":{"en":"Provola is a semi-soft Italian stretched-curd cheese, often mild and sometimes smoked, commonly used for melting or slicing.","zh":"Provola（普罗沃拉）是一种意大利半软质拉丝奶酪，口味多温和，也常见烟熏款，常用于切片或加热融化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a semi-soft Italian pasta filata (stretched-curd) cheese, often mild and sometimes smoked, used for slicing, melting, or eating as table cheese","zh":"普罗沃拉奶酪：一种意大利的半软质拉丝（拉伸凝乳）奶酪，口味多较温和，也常见烟熏款，可切片、加热融化或直接食用"},"examples":[{"en":"I’ll take the sandwich with provola and roasted vegetables.","zh":"我想要那份夹普罗沃拉奶酪和烤蔬菜的三明治。"},{"en":"Provola melts smoothly, so it’s great on pizza or in a panini.","zh":"普罗沃拉奶酪融化得很均匀，所以很适合做披萨或帕尼尼。"},{"en":"The smoked provola adds a gentle, smoky flavor to the pasta.","zh":"烟熏普罗沃拉给意面增添了淡淡的烟香。"}]}],"synonyms":["Italian stretched-curd cheese","provolone (related, not identical)"],"phonetic":"/proʊˈvoʊlə/","extraExplanation":["“Provola”源自意大利语，常见于意大利南部（如坎帕尼亚等地）的拉丝奶酪传统；做法与马苏里拉同属“pasta filata（拉丝）”类型。","它与“provolone（普罗卧洛内）”有关联但不完全相同：provolone通常更大、更常熟成、味道可能更浓；provola多较温和，也常见烟熏版（provola affumicata）。","在英语菜单上，“provola”有时会被当作“provolone”的简写或地区用法；点餐时如果在意口味与熟成度，可以询问是否为smoked或aged。"]}
{"word":"provolone","summary":{"en":"Provolone is a semi-hard Italian cheese often used for sandwiches and melting.","zh":"Provolone 是一种常用于三明治和加热融化的意大利半硬质奶酪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A semi-hard Italian cheese, usually pale yellow and mild to sharp in flavor, often used for sandwiches, pizza, and melting.","zh":"一种意大利半硬质奶酪，通常呈淡黄色，口味可从温和到浓烈，常用于三明治、披萨或加热融化食用。"},"examples":[{"en":"I’ll have a turkey sandwich with provolone, please.","zh":"我想要一份火鸡三明治，加普罗沃洛内奶酪。"},{"en":"Provolone melts well, so it’s great on burgers.","zh":"普罗沃洛内奶酪很容易融化，所以很适合放在汉堡上。"}]}],"synonyms":["Italian cheese","semi-hard cheese"],"phonetic":"/ˌproʊvəˈloʊni/","extraExplanation":["Provolone 源自意大利南部（传统上与坎帕尼亚等地区有关），常见有两种风格：较温和的 dolce（甜/柔和）和较熟成、味道更浓的 piccante（辛/锐）。在美国熟食店（deli）里也很常见，发音和拼写通常保持意大利语外来词的特点。"]}
{"word":"provolunteering","summary":{"en":"Provolunteering means being in favor of volunteering or promoting volunteer work.","zh":"provolunteering 指“支持/提倡志愿服务”，也可指“推动志愿服务的理念或政策”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or advocating volunteering (being in favor of volunteer work and volunteer programs)","zh":"支持或提倡志愿服务的（赞成做志愿者、支持志愿项目的）"},"examples":[{"en":"Our campus is very pro‑volunteering, so there are many chances to help in the community.","zh":"我们学校很支持志愿服务，所以有很多参与社区服务的机会。"},{"en":"She has a pro‑volunteering attitude and often encourages her friends to join local events.","zh":"她很提倡志愿服务，经常鼓励朋友参加本地活动。"}]},{"partOfSpeech":"n.","definition":{"en":"the idea, policy, or movement of promoting volunteering (often used in discussions about schools, workplaces, or government programs)","zh":"推动志愿服务的理念/政策/行动（常用于讨论学校、职场或政府项目）"},"examples":[{"en":"The report argues for provolunteering as a way to strengthen neighborhoods.","zh":"报告主张推动志愿服务，以增强社区凝聚力。"},{"en":"Some people worry that provolunteering can hide the need for better public services.","zh":"有些人担心，推动志愿服务可能会掩盖对更好公共服务的需求。"}]}],"synonyms":["pro-volunteer","in favor of volunteering","volunteer-friendly","advocating volunteerism","supportive of volunteer work"],"phonetic":"/proʊˌvɑlənˈtɪrɪŋ/","extraExplanation":["“pro-”是常见前缀，表示“支持、赞成”（如 pro-democracy 亲民主、pro-environment 亲环境）。因此 pro‑volunteering 多用来表达“支持志愿服务”的立场。","拼写上更常见的是带连字符的 pro‑volunteering；不带连字符的 provolunteering 也能见到，但更像是临时写法或标题用法。"]}
{"word":"provoquant","summary":{"en":"Provocant means “provocative,” often implying attention-grabbing or slightly shocking (sometimes sexually suggestive) style or behavior.","zh":"provocant 指“挑衅的/引人注目的”，常暗含博眼球、略带惊世骇俗（有时带性暗示）的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) provocative; intended to attract attention or cause a strong reaction, often in a slightly shocking or sexually suggestive way.","zh":"（源自法语）挑衅的；煽动反应的；常带一点“惊世骇俗/性暗示”以吸引注意或引发强烈反应。"},"examples":[{"en":"The ad was designed to be provocant, so people would talk about it online.","zh":"这则广告刻意做得很“挑衅”，好让大家在网上讨论。"},{"en":"She wore a provocant dress that drew every eye in the room.","zh":"她穿了一条颇具挑逗意味的裙子，把全场目光都吸引过来。"},{"en":"His provocant comments sparked an argument at dinner.","zh":"他那些挑衅性的评论在晚餐时引发了争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"a provocant person or thing; something meant to provoke attention or controversy (less common in modern English).","zh":"挑衅者；挑逗之物；指故意引起注意或争议的人/事物（现代英语中较少见）。"},"examples":[{"en":"The tabloids treated the celebrity as a provocant who thrived on scandal.","zh":"小报把那位名人当成靠丑闻博关注的“挑衅者”。"},{"en":"The painting became a provocant in the local art scene.","zh":"那幅画成了当地艺术圈里的“争议引爆点”。"}]}],"synonyms":["provocative","provoking","inflammatory","attention-grabbing","titillating"],"phonetic":"/prəˈvoʊkɑnt/","extraExplanation":["“provoquant”更常见于法语里（意思类似“挑衅的/引人注目的”）。英语里更常用的对应词是 **provocative**（挑衅的；引人注目的）。在时尚/广告语境中，provocant 往往带“性感、挑逗、博眼球”的语气。","拼写提醒：如果你是在英文语境里看到 **provoquant**，很可能是法语拼写被直接借用，或是把 **provocant** / **provocative** 误写成了 “provoquant”。"]}
{"word":"provost","summary":{"en":"A provost is usually a university’s top academic administrator; in some places it can also mean a town’s chief official.","zh":"provost 通常指大学的最高学术行政官（教务长）；在某些地区/旧用法中也可指城镇首长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A senior official at a university or college, often responsible for academic affairs (e.g., curriculum, faculty, research).","zh":"（大学/学院的）教务长；常负责学术事务（如课程、教师、科研等）的高级行政官员。"},"examples":[{"en":"The provost announced new guidelines for undergraduate programs.","zh":"教务长宣布了新的本科项目指导方针。"},{"en":"She met with the provost to discuss funding for her research.","zh":"她与教务长会面，讨论她研究项目的经费。"}]},{"partOfSpeech":"n.","definition":{"en":"In some cities or older usage, the chief official of a town, or an official in charge of prisons or discipline.","zh":"（部分城市或较旧用法）市镇最高行政官；或（旧时/部分地区）负责监狱或纪律的官员。"},"examples":[{"en":"In Scottish history, the provost often served as the head of the burgh (town).","zh":"在苏格兰历史中，provost 常担任自治市（城镇）的首长。"},{"en":"The old records mention a provost responsible for maintaining order.","zh":"旧档案提到一位负责维持秩序的 provost。"}]}],"synonyms":["chief academic officer","academic vice president","(UK/Scotland) lord provost","mayor (context-dependent)"],"phonetic":"/ˈproʊ.voʊst/","extraExplanation":["在北美高校语境里，provost 通常仅次于校长/校监（president/chancellor），相当于“学术负责人”（常见全称：Provost and Vice President for Academic Affairs）。不同学校权责略有差异，但通常不直接管理财务或校园运营，那更多属于 COO/VP for Administration 一类职位。","词源来自拉丁语 *praepositus*（“被置于前面的人、负责人”）。在英国/苏格兰语境中，provost 也可指市镇行政首长（类似 mayor）。"]}
{"word":"provostal","summary":{"en":"“Provostal” means “related to a provost,” especially in university administration.","zh":"“Provostal”表示“与provost（尤指大学里的教务长/学术负责人）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a provost (an official who leads or oversees a college/university, or in some traditions a senior church or civic official).","zh":"与“provost（教务长/学术负责人；某些传统中也指教会或城市的高级官员）”有关的；教务长的。"},"examples":[{"en":"The provostal office sent an email about the new academic policy.","zh":"教务长办公室发邮件通知了新的学术政策。"},{"en":"She works on provostal initiatives to improve teaching quality.","zh":"她参与教务长层面的项目，以提升教学质量。"}]}],"synonyms":["provost-related","of the provost","provost’s"],"phonetic":"/ˌproʊˈvoʊstəl/","extraExplanation":["“Provostal”在日常英语中相对少见；更常见的表达是“provost’s (office)”（教务长的/教务长办公室）或“the Office of the Provost”。","在美国大学语境里，provost通常是主管学术事务的高层管理者（如课程、师资、学术政策），常被视为校长/校监（president/chancellor）之下的最高学术官员。","在某些英国或历史语境中，provost也可能指学院院长、教会机构负责人，或旧时的城市行政长官；因此“provostal”在不同地区/传统里指向的职责可能略有差异。"]}
{"word":"provostess","summary":{"en":"“Provostess” means a woman who is a provost (a university academic leader or head of certain institutions), but it is old-fashioned; today people usually say “provost.”","zh":"“provostess”指担任provost（大学教务/学术行政负责人或某些机构负责人）的女性，但较为旧式；现代多直接用不分性别的“provost”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female provost; a woman who holds the office of provost (an administrative leader, especially at a university, or the head of certain colleges or chapters).","zh":"女教务长；女校务长；女院长：担任“provost（教务/校务行政负责人）”职务的女性（常见于大学），或某些学院/教会团体中的负责人。"},"examples":[{"en":"The provostess represented the university at the scholarship ceremony.","zh":"这位女教务长代表学校出席了奖学金颁奖典礼。"},{"en":"In the old records, the college mentioned a provostess who managed the students’ housing.","zh":"在旧档案中，这所学院提到一位负责学生住宿管理的女院长。"}]}],"synonyms":["provost","female provost"],"phonetic":"/ˈproʊvoʊstəs/","extraExplanation":["“provostess”是把女性后缀“-ess”加在“provost”后形成的旧式说法，现代英语更常用性别中立的“provost”，不论性别都可以使用。","在英国英语中，provost 也可能指某些学院（尤其是牛津、剑桥等体系中的学院）或教会机构的负责人；在美国大学语境里，provost 常指校长之下负责教学与学术事务的高级行政职位（类似“教务长/常务副校长”）。","使用建议：在正式或现代写作中，优先用“provost”；只有在历史文献、特定传统机构称谓或强调旧称时才会见到“provostess”。"]}
{"word":"provostorial","summary":{"en":"An uncommon adjective meaning “related to a provost,” especially in universities (and sometimes in military police contexts).","zh":"较少见的形容词，表示“与教务长（大学/学院高级行政官）有关的”，有时也用于军事宪兵语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a provost (an official who may be the head of a college/university, or a senior administrative officer).","zh":"与教务长／学院或大学的高级行政长官（provost）有关的；教务长的。"},"examples":[{"en":"The provostorial office oversees academic policy and faculty affairs.","zh":"教务长办公室负责学术政策与教师事务。"},{"en":"She accepted a provostorial role after years as a department chair.","zh":"在担任系主任多年后，她接受了教务长层级的职位。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a provost marshal or military provost (an officer responsible for military police matters).","zh":"与宪兵司令（provost marshal）或军事宪兵事务有关的。"},"examples":[{"en":"The memo described provostorial procedures for handling detained soldiers.","zh":"备忘录说明了处理被拘留士兵的宪兵相关程序。"}]}],"synonyms":["provostial","of the provost","administrative (context-dependent)"],"phonetic":"/ˌproʊˈvoʊstəriəl/","extraExplanation":["“provostorial”很少见，更多情况下你会看到拼写与用法更常规的形容词：**provostial**（教务长的）或短语 **of the provost**。在军队语境中也常用 **provost** 作定语（如 *provost duties*）或直接说 **provost marshal’s**（宪兵司令的）。","词根来自 *provost*（源于中古英语与古法语，含“监督、管理者”之意）+ 形容词后缀 *-orial*（“……的/与……有关的”）。因为词形较生僻，正式写作中更推荐用更常见的替代表达以避免读者困惑。"]}
{"word":"provostry","summary":{"en":"Provostry usually refers to the district, office, or residence connected to a provost in certain churches.","zh":"Provostry 通常指某些教会中与教务长（provost）相关的辖区、职务/办公室或官邸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In some Christian churches) the district, office, or residence of a provost (a senior clergy member).","zh":"（某些基督教教会中）教务长（provost，较高阶神职人员）的辖区、职务，或其官邸/住所。"},"examples":[{"en":"The bishop visited the provostry to meet with local clergy.","zh":"主教到教务长官邸拜访并会见当地神职人员。"},{"en":"Several parishes in the provostry shared resources for youth programs.","zh":"该教务长辖区内的几个堂区共同共享资源来开展青年项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A provost’s official administration or governing body, especially in church-related contexts.","zh":"（较少见）教务长的行政机构/管理体系，尤指教会相关语境。"},"examples":[{"en":"The provostry issued new guidelines for charitable work.","zh":"教务长办公室发布了新的慈善工作指南。"}]}],"synonyms":["provost’s residence","provost’s office","district (church context)","rectory (related, not identical)"],"phonetic":"/ˈproʊvɑstri/","extraExplanation":["“provostry”多见于英式或教会语境，不同宗派/地区含义会有差异：有时强调“辖区”（类似教区内的分区），有时指“官邸”或“办公室”。阅读时可结合上下文判断是“地点”还是“机构/职务”。","词源上来自“provost（教务长/主持者）+ -ry（表示机构、职务或地点）”，类似的构词还有 “rectory（牧师住宅/堂区住宅）”。"]}
{"word":"provosts","summary":{"en":"“Provosts” is the plural of “provost,” most commonly meaning university academic leaders; it can also mean civic leaders (especially in Scotland) or certain church officials.","zh":"“Provosts”是“provost”的复数，最常指大学的教务长等学术主管；也可指（尤苏格兰的）市政长官或某些教会职务负责人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A senior official at a university or college, often responsible for academic affairs (e.g., overseeing faculty, programs, and educational standards).","zh":"（大学/学院的）教务长；常负责学术事务的高级行政官（如管理师资、课程与教学质量）。"},"examples":[{"en":"The provost announced new guidelines for undergraduate education.","zh":"教务长宣布了新的本科教育指导方针。"},{"en":"She met with the provost to discuss funding for the research program.","zh":"她与教务长会面，讨论研究项目的经费问题。"}]},{"partOfSpeech":"n.","definition":{"en":"In some places, a civic leader (similar to a mayor), especially in Scotland.","zh":"（某些地区的）市政长官；尤指苏格兰的市长类官员。"},"examples":[{"en":"The provost attended the town’s annual ceremony.","zh":"这位市政长官出席了小镇的年度典礼。"}]},{"partOfSpeech":"n.","definition":{"en":"A person in charge of a cathedral or a religious chapter (less common).","zh":"（较少见）主教座堂或教会团体的负责人。"},"examples":[{"en":"The provost of the cathedral oversaw the chapter’s administration.","zh":"座堂的负责人管理教会团体的行政事务。"}]}],"synonyms":["academic vice president","chief academic officer","university administrator","(Scotland) lord provost"],"phonetic":"/ˈproʊ.voʊsts/","extraExplanation":["“Provosts”是“provost”的复数形式。美国校园里最常见的用法是“教务长”（通常是仅次于校长/校监的学术行政负责人）。不同学校架构不完全一样：有的学校称provost为“Chief Academic Officer”。","词源上与“prove”同源，来自拉丁语propositus（被任命负责的人），因此带有“被委派管理/监督”的含义。"]}
{"word":"provostship","summary":{"en":"Provostship means the office or term of a university provost (a top academic administrator).","zh":"Provostship 指大学教务长（负责学术事务的高级行政人员）的职位或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or term of a provost (a senior university administrator, often overseeing academics)","zh":"（大学）教务长/副校长（provost）的职位、任期或其职务本身"},"examples":[{"en":"She accepted the provostship at a large public university.","zh":"她接受了一所大型公立大学的教务长职位。"},{"en":"During his provostship, the university expanded several graduate programs.","zh":"在他担任教务长期间，学校扩建了多个研究生项目。"}]}],"synonyms":["provost’s office","provost tenure","provost position"],"phonetic":"/ˈproʊ.vɑːst.ʃɪp/","extraExplanation":["“Provostship”多用于高等教育语境（尤其在美国），强调“担任provost这一职务的状态/任期/职位本身”。词尾“-ship”常见于表示“身份、职位、状态或任期”（如 leadership 领导力/领导职位，stewardship 管理职责）。","不同学校对 provost 的中文译法不一，常见有“教务长”“常务副校长”“学术副校长”等；理解时可抓住核心：负责学校学术事务的高级行政岗位。"]}

