{"word":"prow","summary":{"en":"“Prow” most commonly means the front of a ship; as a verb meaning “to row,” it’s uncommon and may be a confusion with “row.”","zh":"“prow”最常见指“船头”；作动词表示“划船”并不常见，可能与“row”混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stroke with an oar, or the act of rowing a boat.","zh":"（划船时）一桨；划船的动作。"},"examples":[{"en":"With a few strong prows, the boat moved away from the dock.","zh":"用力划了几桨后，船离开了码头。"},{"en":"She kept a steady rhythm with each prow.","zh":"她每划一桨都保持稳定的节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"To row (a boat); to move a boat using oars.","zh":"划（船）；用桨使船前进。"},"examples":[{"en":"We prow across the lake every morning.","zh":"我们每天早上划船穿过湖面。"},{"en":"He learned to prow in calm water before trying the river.","zh":"他先在平静的水面学划船，再去尝试河流。"}]}],"synonyms":["bow (front of a ship)","row (if you mean to row)","oar (related word)"],"phonetic":"/praʊ/","extraExplanation":["“prow”更常见的意思其实是名词“船头”（/praʊ/），而表示“划桨/划船”的词通常是“row”（/roʊ/）。你输入的“prow”若是想表达“划船”，很可能是把“row”拼错了。","如果你想要的是“船头”的“prow”，它的读音和“plow”押韵：/praʊ/。常见搭配：the prow of the ship（船头）。"]}
{"word":"prowar","summary":{"en":"Pro-war means supporting war or military action; it can also refer to a supporter of war.","zh":"Pro-war 指支持战争或军事行动；也可指支持战争的人（亲战派）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting a war, military action, or the idea that going to war is justified.","zh":"支持战争、军事行动，或认为开战是正当的。"},"examples":[{"en":"Some newspapers took a pro-war stance after the attack.","zh":"袭击发生后，一些报纸采取了亲战立场。"},{"en":"She criticized the pro-war politicians for ignoring the human cost.","zh":"她批评那些亲战政客无视人道代价。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that supports a war or military action.","zh":"支持战争或军事行动的人（或团体）；亲战派。"},"examples":[{"en":"The debate was framed as pro-war versus anti-war.","zh":"这场辩论被描述为亲战派对反战派。"},{"en":"Pro-war voices were louder on television than in local meetings.","zh":"电视上的亲战声音比地方会议上更响亮。"}]}],"synonyms":["hawkish","militaristic","pro-intervention","supportive of war"],"phonetic":"/ˌproʊˈwɔr/","extraExplanation":["“prowar”更常见的写法是带连字符的 **pro-war**，用于表达立场（类似 **pro-choice / pro-life**）。在新闻与政治语境中常与 **anti-war**（反战）对照使用。","语气上，“pro-war”在很多语境里可能带有批评或指责色彩（暗示好战），写作时可根据需要改用更中性的表达，如 “supporting the military intervention”（支持军事干预）。"]}
{"word":"prowarden","summary":{"en":"Prowarden means a deputy or acting warden who assists the warden or fills in when needed.","zh":"Prowarden 指“副舍监/代理舍监（或副监狱长）”，协助或代替 warden 履行职责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deputy or acting warden; someone appointed to assist a warden or to take the warden’s place when needed (often in a college, dormitory, or institutional setting).","zh":"（副）舍监／（副）监狱长；协助舍监/监狱长工作，或在其缺席时代为履职的人（常见于学院宿舍、机构管理等语境）。"},"examples":[{"en":"If the warden is away, the prowarden handles student discipline and emergencies.","zh":"如果舍监不在，副舍监会处理学生纪律和紧急情况。"},{"en":"She served as prowarden of the residence hall for two semesters.","zh":"她担任了两个学期的宿舍副舍监。"}]}],"synonyms":["deputy warden","acting warden","assistant warden"],"phonetic":"/ˌproʊˈwɔrdən/","extraExplanation":["“pro-”在这里不是“支持（pro-）某事”的意思，而更接近拉丁语系用法，表示“代行/副职/代理”，类似于“pro tem（临时代理）”。因此 prowarden 更像“副舍监/代理舍监”。","该词在现代英语里不算常见，更多出现在特定机构（例如英联邦一些学院/住宿学院的职务名称）或内部文件中。不同机构可能写作 pro-warden 或 pro warden。"]}
{"word":"prowaterpower","summary":{"en":"“ProWaterPower” is not a standard word; it’s usually a name. It can also mean “supporting hydropower.”","zh":"“ProWaterPower”不是标准词，通常是名称；也可理解为“支持水力发电（支持水能）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) A brand name, username, or project name that likely combines “pro” (professional / in favor of) + “water power” (hydropower). Often used as a label rather than a normal vocabulary word.","zh":"（非标准词典词）常见于品牌名、用户名或项目名，可能由“pro”（专业的/支持……的）+“water power”（水力发电、水能）组合而成，更多是名称标签而非普通词汇。"},"examples":[{"en":"I found ProWaterPower on social media, but it seems to be a company name, not a dictionary word.","zh":"我在社交媒体上看到 ProWaterPower，但它看起来像公司名，而不是词典里的单词。"},{"en":"Their website says ProWaterPower focuses on clean hydropower solutions.","zh":"他们的网站说 ProWaterPower 专注于清洁的水力发电解决方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"pro-water-power: supporting or promoting the use of water power (hydropower) as an energy source.","zh":"pro-water-power：支持或倡导使用水能（水力发电）作为能源。"},"examples":[{"en":"She’s pro-water-power because it produces electricity with low carbon emissions.","zh":"她支持水力发电，因为它发电时碳排放较低。"},{"en":"The group launched a pro-water-power campaign to expand renewable energy.","zh":"该团体发起了支持水力发电的活动，以扩大可再生能源。"}]}],"synonyms":["pro-hydropower","hydropower (water power)","hydroelectric power"],"phonetic":"/proʊ ˈwɔtɚ ˈpaʊɚ/","extraExplanation":["“pro-”作前缀时常表示“支持……的/赞成……的”（如 pro-environment, pro-choice）。如果你想表达这个意思，更自然的写法是“pro-hydropower”或“pro–water power”（中间加连字符/空格）。","“water power”更常见的标准词是“hydropower / hydroelectric power”（水力发电）。在正式写作里，用这些词会更清晰。"]}
{"word":"prowed","summary":{"en":"“Prowed” usually means “having a prow,” used mainly in nautical or literary descriptions (often in compounds like high-prowed).","zh":"“prowed”通常表示“有船艏的”，多用于航海或文学描写（常见于 high-prowed 等复合词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a prow (the front, pointed part) like a ship; often used in descriptions such as “high-prowed” or “sharp-prowed.”","zh":"有船艏的；（像船一样）有尖前部的，常见于 high-prowed（高船艏的）、sharp-prowed（尖船艏的）等描写。"},"examples":[{"en":"A high-prowed boat cut through the waves.","zh":"一艘高船艏的小船破浪前行。"},{"en":"They carved a sharp-prowed canoe from a single log.","zh":"他们用一整段木头雕出一艘尖船艏的独木舟。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Past tense/past participle of “prow” (to fit or shape with a prow).","zh":"（罕见）动词 prow 的过去式/过去分词：给（船）装上船艏，或把前部做成船艏形状。"},"examples":[{"en":"The small vessel was newly prowed and ready for the river.","zh":"这条小船新装好了船艏，准备下河。"}]}],"synonyms":["high-bowed","sharp-bowed","having a bow"],"phonetic":"/praʊd/","extraExplanation":["“prowed”主要出现在文学或航海描写里，常以复合形容词形式出现（如 high-prowed / sharp-prowed）。日常英语里更常用的是 “the bow of the boat”（船头/船艏）来表达同类意思。","注意不要和 “proud”（自豪的，/praʊd/）混淆；虽然发音相同，但词义完全不同。"]}
{"word":"prower","summary":{"en":"“Prower” is not standard English; you probably mean “power” (ability/strength/authority; also electricity; or to supply energy).","zh":"“prower”不是标准英文，通常是把“power”拼错了（能力/力量/权力；也指电力；作动词表示供能/使运转）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “prower” is not a correct English spelling. It is most often a misspelling of “power.”","zh":"（非标准）“prower”不是正确的英文拼写，最常见是把“power”拼错了。"},"examples":[{"en":"Incorrect: The prower went out during the storm.","zh":"错误：暴风雨期间电力（prower）断了。"},{"en":"Correct: The power went out during the storm.","zh":"正确：暴风雨期间电力（power）断了。"}]},{"partOfSpeech":"n.","definition":{"en":"power: the ability to do something or to control people or events; strength or energy (often electricity).","zh":"power：做某事的能力；对人或事情的控制力；力量或能量（也常指电力）。"},"examples":[{"en":"Knowledge gives you the power to make better choices.","zh":"知识给你做出更好选择的力量。"},{"en":"The company has the power to change its policy.","zh":"公司有权力/能力改变政策。"},{"en":"Please turn off the power before you fix the machine.","zh":"修机器前请先断电。"}]},{"partOfSpeech":"vt.","definition":{"en":"power: to supply with energy (especially electricity) or to make something work.","zh":"power：给……提供动力/电力；使……运转。"},"examples":[{"en":"This battery powers the flashlight.","zh":"这块电池给手电筒供电。"},{"en":"The engine is powered by gas.","zh":"这台发动机由汽油提供动力。"}]}],"synonyms":["strength","authority","control","energy"],"phonetic":"/ˈpaʊər/","extraExplanation":["“power”和“prowess”容易被学习者混淆：\n- power 更常见，表示“力量/权力/电力”。\n- prowess（/ˈpraʊəs/）表示“高超本领、卓越能力（常用于技能或运动）”，比如: her athletic prowess（她的运动才能）。"]}
{"word":"prowersite","summary":{"en":"“Prowess” means impressive skill or ability.","zh":"“Prowess”指令人钦佩的技能或本领。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “prowess”) great skill or ability in a particular activity, often admired by others.","zh":"（可能想写的是：prowess）高超的技能或本领，尤指令人钦佩的能力。"},"examples":[{"en":"Her coding prowess helped the team solve the problem quickly.","zh":"她高超的编程本领帮助团队迅速解决了问题。"},{"en":"The athlete is known for his prowess on the court.","zh":"这位运动员以在球场上的出色实力而闻名。"},{"en":"The novel praises the hero’s prowess in battle.","zh":"这部小说称赞主人公在战斗中的英勇本领。"}]}],"synonyms":["skill","ability","expertise","mastery","talent"],"phonetic":"/ˈpraʊəs/","extraExplanation":["你输入的“prowersite”不是常见英文单词，最接近的常用词是“prowess”（/ˈpraʊəs/）。它常用于夸赞一个人在运动、工作技能、学术或某项专长上的“实力/本领”。","拼写提示：prowess 不是 *prowersite*；中间没有 -er-，结尾是 -ess。"]}
{"word":"prowess","summary":{"en":"Prowess means outstanding skill or ability that people admire.","zh":"prowess 指令人钦佩的卓越技能或能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"great skill and ability, especially shown in a particular activity (often admired by others)","zh":"高超的本领；卓越的能力（尤指在某项活动中表现出的、令人钦佩的能力）"},"examples":[{"en":"She is known for her technical prowess in software engineering.","zh":"她以在软件工程方面的技术实力而闻名。"},{"en":"The team’s defensive prowess kept their opponents from scoring.","zh":"球队出色的防守能力让对手难以得分。"},{"en":"His storytelling prowess held the audience’s attention.","zh":"他讲故事的本领牢牢吸引住了观众。"}]}],"synonyms":["skill","ability","expertise","mastery","talent"],"phonetic":"/ˈpɹaʊəs/","extraExplanation":["“prowess”常用于正式或书面语，强调“令人敬佩的实力/本领”，比“skill”更有“出众、厉害”的语气。","搭配很常见：technical/athletic/military/defensive/creative prowess（技术/运动/军事/防守/创造力方面的卓越能力）。","词源来自古法语，早期常与“勇武、英勇”相关，所以在描述体育或战争语境时仍常见这种“强悍实力”的色彩。"]}
{"word":"prowessed","summary":{"en":"Prowess means great skill or ability, often admired and often in a specific field.","zh":"Prowess 指令人钦佩的高超技能或能力，常用于某一具体领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"great skill, ability, or expertise (often in a specific activity such as sports, leadership, or a craft)","zh":"高超的技能；本领；（某方面的）卓越能力"},"examples":[{"en":"She is known for her prowess in debate.","zh":"她以辩论方面的高超本领而闻名。"},{"en":"The team showed their technical prowess during the competition.","zh":"这支队伍在比赛中展现了他们的技术实力。"},{"en":"His prowess as a chef comes from years of practice.","zh":"他作为厨师的本领来自多年的练习。"}]}],"synonyms":["skill","expertise","mastery","ability","talent"],"phonetic":"/ˈpraʊəs/","extraExplanation":["你输入的“prowessed”一般不是标准英文单词；更常见的是名词“prowess”（本领、实力）。如果你想表达“展现本领/凭实力取胜”，英文通常用动词短语：show/demonstrate one’s prowess（展现本领）。","“prowess”常用于较正式的语境，强调令人佩服的能力，搭配很常见：prowess in/at + 领域（如 prowess in math / prowess at chess）。"]}
{"word":"prowesses","summary":{"en":"“Prowesses” means multiple examples or types of great skill/ability (often in action, sports, work, or sometimes in battle in literary contexts).","zh":"“Prowesses”指多项或多种高超的技能/本领，常用于行动、运动、工作等情境；在文学语境中也可指战斗中的武勇与本领。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “prowess”: great skill or ability, especially shown through action or achievement","zh":"“prowess”的复数：高超的技能或本领，尤指在行动或成就中体现出来的能力"},"examples":[{"en":"The athlete’s prowesses were obvious in the final race.","zh":"这位运动员的多项本领在决赛中展现得很明显。"},{"en":"She is known for her musical prowesses and strong stage presence.","zh":"她以音乐才华和很强的舞台表现力而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"great skill or strength in battle or competition (a more traditional/literary use)","zh":"在战斗或竞争中的英勇与本领（较偏传统/文学的用法）"},"examples":[{"en":"In the legend, the hero proved his prowesses on the battlefield.","zh":"在传说里，这位英雄在战场上证明了自己的英勇本领。"},{"en":"The poem praises the knight’s prowesses and honor.","zh":"这首诗赞美了骑士的武勇与荣誉。"}]}],"synonyms":["skills","abilities","talents","expertise","mastery"],"phonetic":"/ˈpraʊəs/","extraExplanation":["“prowess”更常见的是不可数，用来表示“本领/能力”这一整体概念：His prowess is impressive. 当你想强调“多项技能/不同方面的才能”时，才比较可能用复数“prowesses”。不过在现代日常英语里，用“skills/abilities/talents”往往更自然。"]}
{"word":"prowessful","summary":{"en":"Prowessful means very skilled or brave—full of prowess.","zh":"prowessful 指“很有本领或很英勇的”，强调充满技艺或勇气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having great skill, ability, or bravery; full of prowess.","zh":"很有本领或勇气的；充满英勇/技艺的。"},"examples":[{"en":"She is a prowessful climber who stays calm on difficult routes.","zh":"她是一位很有本领的攀岩者，面对高难路线也能保持冷静。"},{"en":"The story praises a prowessful hero who protects the village.","zh":"这个故事称赞了一位英勇的英雄，守护着村庄。"}]}],"synonyms":["skilled","highly skilled","capable","brave","valiant","heroic"],"phonetic":"/ˈpraʊəsfəl/","extraExplanation":["“prowessful”不是常见词，更自然、更常用的表达通常是“skilled / highly skilled / capable / brave / valiant”。在正式或文学语境里偶尔会看到“prowessful”用来强调“充满英勇技艺”的感觉。","构词：prowess（英勇/高超技艺）+ -ful（充满……的）。注意不要和“powerful（强大的）”混淆：两者拼写相近，但“prowessful”强调“技能/英勇”，而“powerful”强调“力量/影响力”。"]}
{"word":"prowest","summary":{"en":"“Prowest” is usually a misspelling of “prowess,” meaning strong skill or ability (often proven by achievement).","zh":"“prowest”通常是“prowess”的误拼，意思是高超的技能或本领（多指通过成就证明的能力）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) great skill or ability in a particular activity; expertise, especially shown through achievement.","zh":"（很可能是拼写错误，正确为 prowess）在某项活动中的高超技能或本领；才干（常指通过成就表现出来的能力）。"},"examples":[{"en":"She is known for her athletic prowess on the basketball court.","zh":"她以在篮球场上的运动才能而闻名。"},{"en":"The engineer demonstrated technical prowess by solving the problem in one day.","zh":"这位工程师用一天就解决了问题，展现了过硬的技术实力。"},{"en":"His prowess in negotiation helped the team reach an agreement.","zh":"他在谈判方面的本领帮助团队达成了协议。"}]}],"synonyms":["skill","ability","expertise","mastery","talent"],"phonetic":"/ˈpraʊəs/","extraExplanation":["“prowest”在现代英语中不是常见标准拼写；最接近且常用的词是“prowess”。","“prowess”常用于较正式的语境，强调“通过表现/成果证明的能力”，搭配常见：athletic prowess（运动才能）、military prowess（军事力量/战力）、technical prowess（技术实力）。"]}
{"word":"prowfish","summary":{"en":"“Prowfish” is not a standard English word; it’s likely a misspelling of “crawfish/crayfish” (or sometimes “prawns/shrimp” depending on context).","zh":"“prowfish”不是标准英语词；多半是把“crawfish/crayfish（小龙虾/淡水螯虾）”（或视语境为“prawns/shrimp 大虾”）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or likely misspelled form; it is not a common dictionary word in English. It is often intended to mean “crawfish/crayfish” (a small freshwater lobster-like animal) or “prawns” in context.","zh":"非标准或疑似拼写错误；英语中并非常见词。语境中常见的可能意图是指“crawfish/crayfish（小龙虾/淡水螯虾）”或“prawns（对虾）”。"},"examples":[{"en":"Did you mean “crawfish”? In the U.S., people often eat crawfish at a boil.","zh":"你是不是想说“crawfish（小龙虾）”？在美国，人们常在“crawfish boil（煮小龙虾聚会）”上吃小龙虾。"},{"en":"I couldn’t find “prowfish” in a dictionary, but “crayfish” is the standard word.","zh":"我在词典里找不到“prowfish”，但“crayfish”是标准说法。"}]}],"synonyms":["crawfish","crayfish","prawn","shrimp"],"phonetic":"/ˈproʊˌfɪʃ/","extraExplanation":["“prowfish”更像是把“crawfish / crayfish（小龙虾/淡水螯虾）”听错或拼错后的写法。美国南方很常见的吃法叫“crawfish boil”。","如果你想表达海里的“大虾”，更常用“prawn(s)”或“shrimp”。把你看到这个词的原句发我，我可以帮你根据语境确定最可能的正确词。"]}
{"word":"prowfishes","summary":{"en":"“prowfishes” is not a standard English word; it’s likely a misspelling or needs context.","zh":"“prowfishes”不是标准英语词；很可能是拼写错误或需要上下文才能判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it looks like a misspelling or a rare/unclear form. You may have meant a different fish-related word or the phrase “prow fishes” (fish near the prow/bow of a boat), but this is not common.","zh":"不是标准英语词；看起来像拼写错误或非常罕见/不清楚的形式。你可能想写别的与鱼有关的词，或写成短语“prow fishes”（船头附近的鱼），但这种用法并不常见。"},"examples":[{"en":"I can’t find “prowfishes” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“prowfishes”——你能把它出现的句子发给我吗？"},{"en":"Did you mean “pufferfishes” or “parrotfishes”?","zh":"你是不是想写“pufferfishes（河豚类）”或“parrotfishes（鹦嘴鱼类）”？"}]}],"synonyms":["pufferfishes","parrotfishes","crawfishes","crayfishes"],"phonetic":"/ˈpraʊˌfɪʃɪz/","extraExplanation":["“prowfishes”更像是把两个部分黏在一起的拼写（比如“prow + fishes”）或打字误差。常见的相近词可能有：\n- pufferfishes / pufferfish（河豚）\n- parrotfishes / parrotfish（鹦嘴鱼）\n- crawfishes / crawfish（小龙虾；也常写 crayfish）\n如果你把原句或你想表达的中文意思发我，我可以帮你锁定最可能的正确词。"]}
{"word":"prowl","summary":{"en":"“Prowl” means to move around quietly and watchfully, often searching for something; as a noun it’s such a cautious search-walk.","zh":"“prowl”指为寻找目标而悄悄、警觉地徘徊或潜行；作名词指这种潜行/巡走。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move around quietly and carefully, often while looking for something (such as prey, a chance to steal, or information)","zh":"（为寻找猎物、机会或信息而）悄悄地、小心地四处走动；潜行"},"examples":[{"en":"A cat was prowling around the yard, watching the birds.","zh":"一只猫在院子里潜行，盯着那些鸟。"},{"en":"Someone was prowling outside the house late at night.","zh":"深夜有人在屋外鬼鬼祟祟地徘徊。"}]},{"partOfSpeech":"n.","definition":{"en":"a slow, quiet walk around an area while searching or watching","zh":"（带着寻找/窥探目的的）潜行；徘徊"},"examples":[{"en":"The security guard took a prowl around the building.","zh":"保安在大楼周围巡走了一圈。"},{"en":"We heard the dog’s paws during its prowl in the hallway.","zh":"我们听到狗在走廊里徘徊时的脚步声。"}]}],"synonyms":["stalk","sneak","lurk","roam","skulk"],"phonetic":"/praʊl/","extraExplanation":["“prowl”常带有“偷偷摸摸、可能不怀好意”的语感，但也可用于动物正常的“捕猎/巡游”。语境不同，感觉会从“像猫一样潜行”到“可疑的徘徊”。","常见搭配：prowl around/along (somewhere)（在某处游荡/潜行）；on the prowl（在四处寻找目标，常指寻找猎物、机会或约会对象）。","文学与文化中，“prowl”常用来营造紧张或阴森氛围，例如描写掠食者、夜里出没的人，或“危险在附近徘徊”的感觉。"]}
{"word":"prowled","summary":{"en":"“Prowled” means moved around quietly and watchfully (often to search), or paced restlessly.","zh":"“prowled”表示（为寻找目标而）悄悄警觉地走动，或因不安而来回徘徊。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move around quietly and carefully, especially while looking for something or someone","zh":"（尤指寻找某物或某人时）悄悄地、警觉地四处走动"},"examples":[{"en":"A cat prowled around the backyard, looking for a mouse.","zh":"一只猫在后院悄悄走动，寻找老鼠。"},{"en":"Security guards prowled the hallway during the night shift.","zh":"夜班时保安在走廊里巡查。"}]},{"partOfSpeech":"v.","definition":{"en":"to roam or wander in a restless way, often because you feel angry, worried, or excited","zh":"（因生气、担心或兴奋而）不安地徘徊、走来走去"},"examples":[{"en":"He prowled around the room, unable to sit still.","zh":"他在房间里来回踱步，怎么也坐不住。"},{"en":"She prowled the house, waiting for the call.","zh":"她在屋里踱来踱去，等电话。"}]}],"synonyms":["stalked","sneaked around","roamed","wandered","paced"],"phonetic":"/praʊld/","extraExplanation":["“prowled”是动词“prowl”的过去式/过去分词。这个词常带有“像捕食者一样警觉、悄无声息”的画面感，因此常用于描写动物（如猫、狼）或人（如小偷、巡逻人员）在暗处或夜里移动。","语感上，“prowl”比“walk around”更有“目的性+隐蔽性/危险感”。写作或阅读中看到它，往往暗示气氛紧张或有人在寻找目标。"]}
{"word":"prowler","summary":{"en":"A prowler is someone (or an animal) that moves around quietly and secretly, often in a suspicious way.","zh":"prowler 指（人或动物）悄悄潜行、鬼鬼祟祟四处游荡的对象，常带“可疑”含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who moves around quietly and secretly, often because they may be looking to steal or do something harmful.","zh":"潜行者；鬼鬼祟祟四处游荡的人（常指可能想偷窃或做坏事的人）。"},"examples":[{"en":"The police warned residents about a prowler in the neighborhood.","zh":"警方提醒居民注意社区里有可疑的潜行者。"},{"en":"She heard footsteps outside and thought a prowler was near the window.","zh":"她听到窗外有脚步声，觉得可能有潜行者靠近窗边。"}]},{"partOfSpeech":"n.","definition":{"en":"An animal that prowls—moving around slowly and quietly while hunting or searching for something.","zh":"（动物）潜行觅食者；悄悄游走寻找猎物的动物。"},"examples":[{"en":"At night, foxes can be silent prowlers near farms.","zh":"夜里，狐狸可能在农场附近悄无声息地游走觅食。"},{"en":"The cat was a careful prowler, watching the birds from the bushes.","zh":"那只猫是个谨慎的潜行者，在灌木丛里盯着鸟。"}]}],"synonyms":["sneak","lurker","trespasser","intruder","stalker"],"phonetic":"/ˈpraʊlər/","extraExplanation":["“prowler”来自动词“prowl”（潜行、徘徊）。在新闻、警察通报或社区公告里很常见，语气通常带有“可疑、危险”的暗示。","常见搭配：a night prowler（夜间潜行者）、a prowler in the area（附近有可疑人士）、call the police if you see a prowler（看到可疑人士就报警）。","注意区分：\"prowler\"偏“潜行的人/动物”；\"burglar\"更明确指“入室盗窃者”。有时媒体会在未确认犯罪前先用“prowler”。"]}
{"word":"prowlers","summary":{"en":"“Prowlers” usually means suspicious people moving around quietly, often with the intent to steal; it can also mean hunters/roamers searching for a target.","zh":"“prowlers”通常指夜间等鬼鬼祟祟潜行、可能意图偷窃的人；也可泛指四处游荡、寻找目标的“猎寻者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who move around quietly and secretly, often to look for something to steal or to cause trouble (plural of “prowler”).","zh":"潜行者；鬼鬼祟祟游荡的人（常带有偷窃或作恶意图；“prowler”的复数）。"},"examples":[{"en":"The neighborhood installed better lights to discourage prowlers at night.","zh":"这个社区安装了更亮的路灯来吓退夜间出没的潜行者。"},{"en":"Police warned residents to lock their windows after reports of prowlers.","zh":"警方在接到有人鬼祟徘徊的报告后，提醒居民锁好窗户。"},{"en":"The dog barked loudly, as if it sensed prowlers near the backyard gate.","zh":"那只狗大声吠叫，像是感觉到后院门附近有潜行者。"}]},{"partOfSpeech":"n.","definition":{"en":"People or animals that roam around searching for something (food, a target, a chance), often with a “hunting” feeling.","zh":"四处游荡寻找目标的人或动物（寻找食物、机会或猎物，带“觅食/猎寻”的感觉）。"},"examples":[{"en":"At dusk, owls and other prowlers become active in the trees.","zh":"黄昏时分，猫头鹰等“夜行捕食者”在树间变得活跃起来。"},{"en":"Online scammers can be prowlers too, looking for easy victims.","zh":"网络骗子也可能是“潜伏的猎手”，专找容易下手的受害者。"}]}],"synonyms":["intruders","trespassers","lurkers","sneaks","stalkers"],"phonetic":"/ˈpraʊlərz/","extraExplanation":["“prowler”来自动词“prowl”（潜行、偷偷徘徊）。在新闻或治安语境中很常见，通常暗示可疑、可能犯罪的人（如“house prowler”翻作“入室行窃者/踩点者”）。","搭配提示：常见说法有“night prowlers（夜间出没者）”“car prowlers（撬车贼）”“window/house prowler（窥窗/入室者）”。"]}
{"word":"prowling","summary":{"en":"Prowling means moving quietly and carefully while searching—often with a suspicious or predatory feeling.","zh":"prowling 指悄悄、小心地四处游荡寻找目标，常带可疑或捕猎般的语感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"moving around quietly and carefully while looking for something (often prey, a target, or trouble).","zh":"（常指为寻找猎物、目标或“找麻烦”而）悄悄地、小心地四处游荡。"},"examples":[{"en":"A cat was prowling around the bushes, watching the birds.","zh":"一只猫在灌木丛周围悄悄游荡，盯着鸟看。"},{"en":"Someone was prowling outside the house late at night.","zh":"深夜有人在房子外面鬼鬼祟祟地徘徊。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) moving in a secret, searching way; threatening or suspicious.","zh":"（形容词）潜行的；暗中搜寻的；带有威胁或可疑意味的。"},"examples":[{"en":"They noticed a prowling figure near the parking lot.","zh":"他们注意到停车场附近有个徘徊潜行的人影。"},{"en":"The movie shows a prowling danger in the dark streets.","zh":"电影展现了黑暗街道里潜伏的危险。"}]}],"synonyms":["sneaking","stalking","lurking","roaming","skulking"],"phonetic":"/ˈpraʊlɪŋ/","extraExplanation":["“prowl / prowling”常带有“捕猎者/做坏事的人在暗处寻找机会”的语感，因此比“walk around / wander”更偏“鬼鬼祟祟、带威胁”。常见搭配：prowl around/outside/through；be prowling for（在寻找……的机会/目标）。"]}
{"word":"prowlingly","summary":{"en":"“Prowlingly” means moving stealthily and watchfully while searching, often with a suspicious or threatening feeling.","zh":"“prowlingly”指“潜行式地、警觉地搜寻”，常带有可疑或威胁的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a prowling way—moving quietly and watchfully while looking for someone or something (often suggesting danger or suspicion).","zh":"以潜行的方式——悄悄地、警觉地移动并寻找某人或某物（常带有危险或可疑的含义）。"},"examples":[{"en":"A stray cat moved prowlingly through the alley, searching for food.","zh":"一只流浪猫在小巷里潜行，寻找食物。"},{"en":"He walked prowlingly around the house, as if he were looking for a way in.","zh":"他在房子周围鬼鬼祟祟地走着，好像在找进入的方法。"}]}],"synonyms":["stealthily","sneakily","furtively","suspiciously","quietly"],"phonetic":"/ˈpraʊlɪŋli/","extraExplanation":["“prowlingly”在现代英语中比较少见，更常用的表达是“prowl (around/through) …”或用副词“stealthily / suspiciously / quietly”来描述动作方式。","词形来源：prowl（潜行、徘徊搜寻）+ -ing（现在分词）+ -ly（副词后缀），整体强调“像在潜行/搜寻那样地”。"]}
{"word":"prowls","summary":{"en":"“Prowls” means to move around quietly and watchfully, often while searching; it can also mean such stealthy movements.","zh":"“Prowls”指（常带隐秘或危险意味地）悄悄徘徊、潜行并寻找目标；也可指这种潜行的动作（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move around quietly and carefully, especially while looking for something or someone (often with a sense of danger or secrecy)","zh":"（常带危险或隐秘意味地）悄悄徘徊、潜行，寻找某物或某人"},"examples":[{"en":"A cat prowls around the yard at night, hunting for mice.","zh":"猫在夜里在院子里悄悄徘徊，找老鼠。"},{"en":"He prowled the hallway, listening for footsteps.","zh":"他在走廊里潜行，侧耳听脚步声。"}]},{"partOfSpeech":"v.","definition":{"en":"to spend time moving from place to place in a watchful or suspicious way","zh":"以警惕或可疑的方式在某处游荡、徘徊"},"examples":[{"en":"Security guards noticed someone prowling near the back door.","zh":"保安注意到有人在后门附近鬼鬼祟祟地徘徊。"},{"en":"Rumors spread that thieves were prowling the neighborhood.","zh":"谣言传开，说有小偷在社区里游荡。"}]},{"partOfSpeech":"n.","definition":{"en":"quiet, stealthy movement while searching (often by an animal or a person)","zh":"（动物或人）悄悄搜寻时的潜行、徘徊"},"examples":[{"en":"We heard the prowls of a stray dog outside the tent.","zh":"我们听到帐篷外一只流浪狗徘徊的动静。"},{"en":"In the story, the villain’s prowls kept everyone awake.","zh":"在故事里，反派的潜行让大家都睡不着。"}]}],"synonyms":["sneak","skulk","stalk","lurk","prowl around"],"phonetic":"/praʊl/","extraExplanation":["“prowls”通常是动词“prowl”的第三人称单数（He/She/It prowls）或名词复数（the prowls）。","常见搭配：prowl around（四处潜行/徘徊）、prowl for（搜寻）、prowl the streets/halls（在街上/走廊里游荡）。","语感上比“walk around”更阴影、更像“猎食/窥探”的感觉，常用于猫、狼、罪犯、或带威胁的人物。"]}
{"word":"prows","summary":{"en":"“Prows” means the front parts of ships or boats.","zh":"“prows”指船或小艇的船头（前部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the front part of a ship or boat (plural of “prow”)","zh":"船头；船的前部（“prow”的复数）"},"examples":[{"en":"Waves crashed against the prows of the fishing boats.","zh":"海浪拍打着渔船的船头。"},{"en":"The prows pointed toward the open sea as the fleet departed.","zh":"舰队出发时，船头都朝向外海。"}]}],"synonyms":["bows","fronts (of boats/ships)"],"phonetic":"/praʊ/","extraExplanation":["“prow”多用于航海/文学描写，比日常口语里的“front of the boat”更有画面感。常见搭配有：the prow of a ship（船头）、at the prow（在船头处）。在一些诗歌或小说中，作者会用“prow”来强化航行、探索、命运等意象。"]}

