{"word":"prox","summary":{"en":"“prox” is an informal abbreviation meaning “proximity” (nearness) or, in medical/technical use, “proximal” (nearer).","zh":"“prox”是非正式缩写，常指“proximity（接近）”，在医学/技术语境也可指“proximal（近端的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) Short for “proximity,” meaning nearness or closeness (often used in notes, maps, or gaming like “prox chat”).","zh":"（非正式）“proximity”的缩写，表示“接近、邻近”（常见于笔记、地图标注或游戏里，如“prox chat 近距离语音”）。"},"examples":[{"en":"Stay in prox so we can hear you on prox chat.","zh":"保持在近距离范围内，这样我们才能用近距离语音听到你。"},{"en":"The device triggers an alarm when you’re in prox.","zh":"当你靠近时，这个设备会触发警报。"}]},{"partOfSpeech":"other","definition":{"en":"(technical/medical) Abbreviation for “proximal,” meaning nearer to the center of the body or to a point of attachment.","zh":"（技术/医学）“proximal（近端的）”的缩写，指更靠近身体中心或连接点的部位。"},"examples":[{"en":"Pain is located in the prox part of the forearm.","zh":"疼痛位于前臂的近端部位。"},{"en":"Measure the prox segment first, then the distal segment.","zh":"先测量近端段，再测量远端段。"}]}],"synonyms":["proximity","nearby","nearness","proximal"],"phonetic":"/prɑks/","extraExplanation":["“prox”多见于口语、聊天和简写场景，不算正式英文单词；正式写作中一般写全：proximity / proximal。","在医学/解剖里常与“distal（远端的）”成对出现：proximal = nearer，distal = farther.","游戏语境中的“prox chat”通常指“只有在一定距离内才能互相听到的语音聊天（proximity voice chat）”。"]}
{"word":"proxemic","summary":{"en":"Proxemic means relating to the use of space and distance in human communication.","zh":"proxemic 指与人际交流中“空间与距离的使用”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to proxemics—the study of how people use physical space and distance in communication and social interaction.","zh":"与“空间距离学”（proxemics）有关的；指研究人们在交流和社会互动中如何使用身体空间与距离。"},"examples":[{"en":"Different cultures have different proxemic norms about how close people stand when talking.","zh":"不同文化对交谈时站多近有不同的空间距离规范。"},{"en":"The trainer explained that stepping back can be a proxemic signal of discomfort.","zh":"培训师解释说，后退一步可能是表达不适的空间距离信号。"},{"en":"In customer service, being aware of proxemic boundaries can help you avoid making people feel crowded.","zh":"在客服工作中，了解他人的空间边界能避免让人感到被挤压。"}]}],"synonyms":["proxemics-related","spatial","distance-related"],"phonetic":"/prɑkˈsiːmɪk/","extraExplanation":["“proxemic”来自“proxemics”（空间距离学），常见于心理学、人类学、传播学等领域。该概念常与人类学家Edward T. Hall（爱德华·T·霍尔）相关，他提出不同“距离区间”（如亲密距离、个人距离、社交距离、公共距离）会影响人们如何解读礼貌、亲近或威胁等信号。"]}
{"word":"proxemics","summary":{"en":"Proxemics is the study of how people use personal space and distance as part of communication.","zh":"Proxemics 指研究人们在交流中如何使用“个人空间”和人际距离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of how people use space and distance in communication (for example, how close we stand when talking)","zh":"人际距离学；研究人们在交流中如何使用空间与距离（例如谈话时站多近）"},"examples":[{"en":"In proxemics, standing too close can feel aggressive in some cultures.","zh":"在人际距离学中，站得太近在一些文化里可能会让人觉得有攻击性。"},{"en":"The trainer explained proxemics to help staff greet customers more comfortably.","zh":"培训师讲解了人际距离学，帮助员工以更让顾客舒服的方式打招呼。"}]}],"synonyms":["the study of personal space","spatial behavior (in communication)"],"phonetic":"/prɑkˈsiːmɪks/","extraExplanation":["“proxemics”常用于人类学、社会语言学、跨文化沟通与沟通训练（如服务业、谈判、课堂管理）。","概念常与“personal space（个人空间）”一起出现。不同文化对舒适距离的期待可能差异很大，因此在跨文化场景中理解proxemics很有用。","词源与拉丁语“proximus（最近的）”有关；该术语由人类学家Edward T. Hall在20世纪提出并推广。"]}
{"word":"proxenet","summary":{"en":"Proxenet is a formal, less common word meaning “pimp,” especially in legal or French-influenced contexts.","zh":"proxenet 是较正式、较少见的词，意思是“皮条客”，常见于法律或受法语影响的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pimp; a person who gets clients for a prostitute and profits from their work","zh":"皮条客；拉皮条的人（为性工作者介绍客人并从中获利的人）"},"examples":[{"en":"The police arrested him for working as a proxenet.","zh":"警方以他从事拉皮条为由将其逮捕。"},{"en":"The film shows how a proxenet controls and exploits vulnerable people.","zh":"这部电影展示了皮条客如何控制并剥削弱势群体。"}]}],"synonyms":["pimp","procurer","panderer"],"phonetic":"/ˌprɑk.səˈnɛt/","extraExplanation":["这个词在英语里比较少见，更常见于法律、新闻报道或讨论法国社会/法律语境时；日常英语更常用 pimp 或 procurer。","词源来自法语 proxénète，进一步可追溯到希腊语，原义与“中间人/介绍人”有关；但在现代用法中几乎专指与卖淫相关的“皮条客”。","在一些国家或地区的法律文本中，你可能会看到 proxenetism（拉皮条行为/组织卖淫）这样的派生词。"]}
{"word":"proxenete","summary":{"en":"Proxenete means a pimp—someone who profits from or controls prostitution.","zh":"proxenete 指“皮条客”，即靠控制或剥削卖淫牟利的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pimp; a person who profits from or manages prostitution (a criminal and harmful role).","zh":"皮条客；靠组织或剥削卖淫牟利的人（违法且有害）。"},"examples":[{"en":"The police arrested a proxenete for running an illegal prostitution ring.","zh":"警方逮捕了一名皮条客，他经营着一个非法卖淫团伙。"},{"en":"The novel portrays the proxenete as someone who exploits vulnerable people.","zh":"小说把这个皮条客描写成剥削弱势群体的人。"}]}],"synonyms":["pimp","procurer"],"phonetic":"/ˌprɑk.səˈniːt/","extraExplanation":["“proxenete”在英语里很少见，更常见的词是“pimp”。它也对应法语“proxénète”（皮条客）。","词源上可追溯到希腊语相关词根（与“中介/撮合者”之意有关），但现代用法通常专指与卖淫相关的剥削与牟利，语境偏负面。","在学习与使用时要注意：这是敏感且强烈贬义的词，通常出现在法律、新闻报道、社会问题讨论或文学作品中。"]}
{"word":"proxenetism","summary":{"en":"Proxenetism means pimping—procuring or arranging paid sexual services for others, usually as an illegal business.","zh":"proxenetism 指“拉皮条”，即为他人招揽或安排有偿性服务的行为，通常属于违法生意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of acting as a pimp; the business of procuring or arranging paid sexual services for others (often illegal)","zh":"拉皮条；皮条行为；为他人介绍、安排有偿性服务的行为（通常违法）"},"examples":[{"en":"He was arrested for proxenetism after police found evidence that he was arranging clients for sex workers.","zh":"他因拉皮条被捕，因为警方发现证据表明他在为性工作者安排客人。"},{"en":"Some countries punish proxenetism more severely than prostitution itself.","zh":"在一些国家，拉皮条的处罚可能比卖淫本身更重。"}]}],"synonyms":["pimping","procuring","pandering"],"phonetic":"/ˌprɑkˈsɛnəˌtɪzəm/","extraExplanation":["“proxenetism”是比较正式、偏法律/学术语境的词，日常英语里更常说“pimping”（拉皮条）或“procuring”（介绍/招揽性交易）。","词源可追溯到希腊语 *proxenētēs*（中介/代理人），后来在法语中与“为性交易牵线搭桥”的含义联系更紧密，因此现代用法多指与性交易相关的“中介/控制/招揽”行为。","该词涉及性与犯罪话题，在写作或课堂讨论中建议使用客观、中性表达，并注意不同地区法律与社会态度差异。"]}
{"word":"proxenos","summary":{"en":"A proxenos was an ancient Greek citizen who acted like an honorary consul for another city-state’s visitors and interests.","zh":"proxenos 指古希腊中为另一城邦的来访者与利益提供协助与保护的“名誉领事式”人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a citizen appointed by one city-state to look after the interests of another city-state’s people (especially visitors and merchants); similar to an honorary consul.","zh":"（古希腊）由一座城邦任命、在另一座城邦居住的公民，负责照顾来访者与商人的利益；类似“名誉领事”。"},"examples":[{"en":"As a proxenos, he helped travelers from Athens find lodging and settle disputes.","zh":"作为一名 proxenos，他帮助来自雅典的旅人寻找住处并调解纠纷。"},{"en":"The city honored its proxenos for protecting foreign merchants during the war.","zh":"那座城邦表彰了它的 proxenos，因为他在战争期间保护了外国商人。"}]}],"synonyms":["honorary consul","consul","diplomatic representative","patron"],"phonetic":"/prɑkˈsiːnəs/","extraExplanation":["“proxenos”源自古希腊语，常与制度名“proxenia（款待/保护外邦人制度）”一起理解：它是一种个人与城邦之间的荣誉性关系，不是现代意义上常驻的职业外交官。","在阅读古史（如修昔底德等作者的相关记载）时，proxenos 往往出现在城邦外交、商贸往来与外邦人保护的语境中；可把它理解为“当地的外邦事务联系人/保护人”。"]}
{"word":"proxenus","summary":{"en":"A proxenus was an ancient Greek citizen who served as an official host and representative for another city-state’s visitors or interests.","zh":"proxenus 指古希腊由本城公民担任的“外邦保护人/公宾”，负责接待并代表另一个城邦的来访者或利益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a citizen appointed to help, represent, and host visitors or interests from another city-state (somewhat like an honorary consul).","zh":"（古希腊）“外邦保护人/公宾”：由本城公民担任，负责接待、协助并代表另一个城邦的来访者或利益（有点像荣誉领事）。"},"examples":[{"en":"In Athens, a proxenus might arrange lodging and introductions for visiting diplomats.","zh":"在雅典，proxenus 可能会为来访的外交使节安排住宿并引荐人脉。"},{"en":"The inscription praises him for serving as proxenus of the island city.","zh":"碑铭称赞他担任该岛城邦的 proxenus 并尽职服务。"}]}],"synonyms":["public host","honorary consul","patron (historical sense)"],"phonetic":"/prɑkˈsiːnəs/","extraExplanation":["词源来自希腊语 *proxenos*（*pro-* “为了/代表” + *xenos* “外乡人、客人”）。它不是“职业外交官”，而更像由当地名望人士担任的“对外联络与接待人”。","可类比但不等同于现代的“（荣誉）领事”：proxenus 通常不派驻国外，而是在本城为“外城邦的人”提供帮助与保护。","在古典史书与铭文语境中常见，用来说明城邦间的友好关系、贸易往来或外交网络。"]}
{"word":"proxeny","summary":{"en":"Proxeny is an ancient Greek institution in which a citizen protected and assisted visitors from another city-state, like an honorary consul.","zh":"Proxeny 指古希腊的一种制度：由本城邦公民负责保护、协助来自他城邦的访客，类似名誉领事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system in ancient Greece where a citizen of one city-state (the proxenos) officially helped and represented the interests of citizens from another city-state—similar to an honorary consul.","zh":"（古希腊）“代理保护/代管制度”：某城邦的公民（proxenos）被正式指定，在本城邦帮助并代表另一个城邦来访者的利益，类似“名誉领事”的角色。"},"examples":[{"en":"In classical Athens, proxeny helped foreign visitors find legal support and local contacts.","zh":"在古典雅典，proxeny 帮助外国来访者获得法律支持和当地人脉。"},{"en":"The inscription records that he was granted proxeny for aiding merchants from another polis.","zh":"碑文记载他因帮助另一个城邦的商人而获授“proxeny”身份。"}]}],"synonyms":["honorary consulate (roughly)","consular protection (approx.)","patronage (historical/partial)"],"phonetic":"/ˈprɑk.sə.ni/","extraExplanation":["词源来自希腊语 *proxenos*（“为外来者行动的人”）。在没有现代常设使馆的时代，proxeny 是一种重要的跨城邦“民间—官方”混合机制：由本地名望人士出面，为外邦人士提供接待、协调、法律协助与政治斡旋。","可把它类比为现代的“名誉领事/领事代理”的雏形，但它发生在城邦政治与宗教礼仪非常紧密的社会结构中，因此常带有礼遇与互惠（reciprocity）的意味。"]}
{"word":"proxi","summary":{"en":"Proxy most commonly means a person who acts for someone else, or a substitute indicator used to represent something indirectly.","zh":"Proxy 最常见指“代理人/代表”，也可指“替代指标/代替物”，用于间接代表或衡量某事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person authorized to act or vote for someone else; a representative","zh":"（被授权的）代理人；代表（代为处理事务或投票的人）"},"examples":[{"en":"She couldn’t attend the meeting, so she sent her assistant as her proxy.","zh":"她无法出席会议，于是派助理作为她的代理人。"},{"en":"Shareholders can vote by proxy.","zh":"股东可以委托他人代为投票。"}]},{"partOfSpeech":"n.","definition":{"en":"something used to represent or measure something else indirectly (often a sign or substitute)","zh":"（间接的）替代指标；代替物（用来代表或衡量另一事物）"},"examples":[{"en":"In some studies, income is used as a proxy for social status.","zh":"在一些研究中，收入被用作社会地位的替代指标。"},{"en":"Smile frequency can be a proxy for customer satisfaction.","zh":"微笑频率可以作为顾客满意度的替代指标。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to acting as a substitute or representative","zh":"代理的；替代的；代表性的"},"examples":[{"en":"He played a proxy role while the manager was away.","zh":"经理不在时，他承担了代理角色。"}]},{"partOfSpeech":"v.","definition":{"en":"to represent someone or something; to act as a substitute (less common in everyday English)","zh":"代表；代理；充当替代（较不常见的动词用法）"},"examples":[{"en":"The spokesperson proxied the organization’s views in the debate.","zh":"发言人在辩论中代表该组织表达观点。"}]}],"synonyms":["representative","agent","stand-in","delegate","substitute","surrogate"],"phonetic":"/ˈprɑksi/","extraExplanation":["你输入的“proxi”很可能是想写“proxy”。“proxy”来自拉丁语 pro + curare（照料/管理），核心含义是“代替别人处理”。","常见固定搭配：by proxy（通过代理/委托）。在公司治理、会议投票里非常常见；在科研语境里，proxy 常指“替代指标”（例如用某个可测量的量来代表一个难直接测量的概念）。","如果你其实想问的是前缀 proxi- / proximal（表示“接近、邻近”），也可以告诉我你的上下文（句子/领域），我可以按那个意思解释。"]}
{"word":"proxically","summary":{"en":"“Proxically” means “nearby” or “toward the proximal/near end,” mainly used in technical contexts.","zh":"“proxically”表示“在近处/近端地”，主要用于技术或专业语境（如解剖学）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a proximal (nearby) way; close to a point of reference.","zh":"以近端的方式；在某个参照点附近。"},"examples":[{"en":"The sensor should be placed proxically to the heat source to detect changes quickly.","zh":"为了快速检测变化，传感器应放在热源附近（近端处）。"},{"en":"Pain was felt proxically, near the shoulder, rather than in the hand.","zh":"疼痛出现在更靠近身体的部位（靠近肩部），而不是手部。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Technical) Near the center of the body or the point of attachment (opposite of distally).","zh":"（术语）靠近身体中心或肢体附着点的位置（与 distally“远端地”相对）。"},"examples":[{"en":"The nerve is compressed more proxically along the arm.","zh":"这条神经在手臂更靠近躯干的部位受到压迫。"},{"en":"Muscles that attach proxically can stabilize the joint.","zh":"近端附着的肌肉可以稳定关节。"}]}],"synonyms":["nearby","closely","locally","at close range"],"phonetic":"ˈprɑːksɪkli","extraExplanation":["“proxically”在日常英语中很少见，更常见的表达是“nearby / close (to)”；在解剖学、生物学、神经科学、机器人学等领域可能会看到，用来对应“proximal（近端的）”。","理解关键词：proximal = 靠近身体中心/起点；distal = 远离身体中心/起点。比如：the proximal end of the arm（上臂靠近肩的部分） vs. the distal end（靠近手的部分）。"]}
{"word":"proxied","summary":{"en":"“Proxied” means “done through a proxy”—either acting on someone’s behalf or (in tech) routed through a proxy server.","zh":"“Proxied”表示“通过代理完成”——要么替人代办/代表，要么（技术语境）指网络连接经由代理服务器转发。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of proxy) to do something on behalf of someone else; to represent or stand in for something.","zh":"（proxy 的过去式/过去分词）代替某人做事；代表；充当……的替身/替代指标。"},"examples":[{"en":"She proxied the vote for her colleague who was out of town.","zh":"她替外出不在的同事进行了投票（代投）。"},{"en":"In the study, income was proxied by education level.","zh":"在这项研究中，用受教育程度来代替衡量收入（作为替代指标）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often in computing) routed through a proxy server rather than connected to directly.","zh":"（常用于计算机）通过代理服务器转发/中转的，而不是直接连接的。"},"examples":[{"en":"The app stopped working when the network traffic was proxied.","zh":"当网络流量走代理（被代理转发）时，这个应用就无法正常工作了。"},{"en":"He logged in using a proxied connection to protect his IP address.","zh":"他使用代理连接登录，以保护自己的 IP 地址。"}]}],"synonyms":["represented","stood in for","substituted","delegated","routed (through a proxy)"],"phonetic":"/ˈprɑk.sid/","extraExplanation":["在学术写作里，proxy（代理变量/替代指标）很常见：当某个概念难以直接测量（如“生活质量”“社会地位”）时，会用一个更容易量化的指标来“proxied by …”（例如用“受教育年限”来近似“社会经济地位”）。","在网络语境中，“proxied”通常暗示流量经过第三方服务器转发，可能用于隐私、访问控制或缓存加速；也可能用于企业网关的统一管理。具体含义取决于上下文（安全、合规或绕过限制等）。"]}
{"word":"proxies","summary":{"en":"“Proxies” means representatives/stand-ins for someone, or (in computing) proxy servers/tools that forward internet requests.","zh":"“proxies”指代理人/代表；在计算机领域也指代理服务器/代理工具，用来转发网络请求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that act for someone else, or represent them (often with official permission).","zh":"代理人；代表（经常指获得正式授权，代替他人行事或投票的人或事物）。"},"examples":[{"en":"She couldn’t attend the meeting, so she sent a colleague as her proxy.","zh":"她无法参加会议，所以派了一位同事作为她的代表。"},{"en":"Shareholders can vote by proxy.","zh":"股东可以委托代理人投票（以代理方式投票）。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, servers or tools that stand between your device and the internet to forward requests (used for privacy, filtering, or speeding up access).","zh":"（计算机）代理服务器/代理工具：位于你的设备与互联网之间，转发请求（用于隐私、过滤或加速访问等）。"},"examples":[{"en":"Our company uses proxies to filter unsafe websites.","zh":"我们公司用代理来过滤不安全的网站。"},{"en":"Try changing your proxy settings if a site won’t load.","zh":"如果网站打不开，试着更改代理设置。"}]}],"synonyms":["representatives","agents","stand-ins","substitutes","delegates"],"phonetic":"/ˈprɑk.siz/","extraExplanation":["“proxy”的核心含义是“替身/代替者”。在商业与会议语境里常见“vote by proxy（委托投票）”“proxy vote（代理投票）”。在网络语境里，“proxy”常指“代理服务器”，与“VPN”有相似用途但不完全相同：VPN通常会把你的网络流量整体加密并通过另一台服务器转发；代理往往只针对特定应用/协议或网站进行转发，是否加密取决于具体配置。"]}
{"word":"proxim","summary":{"en":"Proxim is usually a root/short form meaning “near,” most often understood through words like proximity/proximal.","zh":"Proxim 通常作为词根或简写，表示“近、接近”，多通过 proximity/proximal 等词来理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (root/prefix) meaning “near” or “close to,” used in words like proximity, proximate, and proximal","zh":"词根/前缀，表示“近的、接近的”，常见于 proximity（接近）、proximate（接近的）、proximal（近端的）等词中"},"examples":[{"en":"In anatomy, “proximal” means closer to the center of the body.","zh":"在解剖学里，proximal 表示“更靠近身体中心的（近端的）”。"},{"en":"The word “proximity” comes from the same proxim- idea of nearness.","zh":"proximity 这个词也来自同一个 proxim- 的“接近”概念。"}]},{"partOfSpeech":"other","definition":{"en":"an informal shortening seen sometimes in technical notes (e.g., “proxim sensor”), meaning “proximity”","zh":"在一些技术场景中的非正式缩写（如 “proxim sensor”），通常指 “proximity（接近/距离感应）”"},"examples":[{"en":"The phone turns off the screen using a proxim (proximity) sensor near your ear.","zh":"手机会用靠近耳朵处的 proxim（proximity，距离）传感器来关闭屏幕。"}]}],"synonyms":["near","close","nearby"],"phonetic":"/ˈprɑːksɪm/","extraExplanation":["proxim- 的来源可追溯到拉丁语 proximus（“最近的”），与 prope（“在附近”）有关。它常出现在更正式或学术的词汇里（医学、科学、工程等）。","日常英语里一般不会单独用 proxim；更常见的是完整词 proximity / proximate / proximal。"]}
{"word":"proxima","summary":{"en":"Proxima most commonly refers to Proxima Centauri, the closest star to the Sun; it can also be a borrowed Romance-language word meaning “next,” mainly used in names.","zh":"Proxima最常指“比邻星”（Proxima Centauri，离太阳最近的恒星）；也可作为借用词表示“下一个/最近的”，多用于名称或标题中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy, proper noun) The star Proxima Centauri, the closest known star to the Sun, in the Alpha Centauri system.","zh":"（天文学，专有名词）比邻星（Proxima Centauri），目前已知距离太阳最近的恒星，属于半人马座α星（半人马座α）恒星系统。"},"examples":[{"en":"Proxima Centauri is about 4.24 light-years from Earth.","zh":"比邻星距离地球大约4.24光年。"},{"en":"Scientists have found an exoplanet candidate orbiting Proxima Centauri.","zh":"科学家发现可能有一颗系外行星绕比邻星运行。"}]},{"partOfSpeech":"other","definition":{"en":"(Borrowed from Spanish/Portuguese, used in names) “Next” (feminine form), sometimes seen in titles, brand names, or phrases.","zh":"（借自西班牙语/葡萄牙语，用于名称）“下一个/最近的”（阴性形式），有时出现在标题、品牌名或短语中。"},"examples":[{"en":"The conference will announce its próxima (next) host city soon.","zh":"大会很快会公布下一届（próxima）主办城市。"},{"en":"In Spanish, “la próxima semana” means “next week.”","zh":"在西语里，“la próxima semana”意思是“下周”。"}]}],"synonyms":["Proxima Centauri (specific reference)"],"phonetic":"/ˈprɑːksɪmə/","extraExplanation":["“Proxima”来自拉丁语“proximus”，意思是“最近的”。因此“Proxima Centauri”直译可理解为“半人马座里最近的那颗（恒星）”。","在英语里单独写“Proxima”时，最常见是指“Proxima Centauri（比邻星）”；其他场景多为专名（如科幻/影视角色名、品牌名等），含义通常借用“最近/下一个”的感觉。"]}
{"word":"proximad","summary":{"en":"“Proximad” is probably a misspelling of “proximate,” meaning “near/close” or “direct (as a cause).”","zh":"“proximad”很可能是“proximate”的拼写错误，意思是“接近的/邻近的”，也可指“直接的（近因）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) near in distance, time, or relationship; close.","zh":"（可能想写）接近的；邻近的；时间上或关系上靠近的。"},"examples":[{"en":"The hotel is in close proximity to the airport.","zh":"这家酒店离机场很近。"},{"en":"Stress is a proximate cause of his headaches.","zh":"压力是他头痛的直接原因之一。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical) directly leading to something; an immediate cause, not a deep/root cause.","zh":"（较正式/技术用法）直接导致某事的；近因的（区别于更深层的“根本原因”）。"},"examples":[{"en":"The proximate cause of the accident was speeding.","zh":"事故的直接原因是超速。"},{"en":"They studied the proximate factors that triggered the conflict.","zh":"他们研究了引发冲突的直接因素。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring nearer (often used in formal or technical writing).","zh":"使接近；使靠近（多用于正式或技术写作）。"},"examples":[{"en":"The new bridge will proximate the two communities.","zh":"这座新桥将使两个社区更加接近。"}]}],"synonyms":["near","close","nearby","immediate","direct"],"phonetic":"/ˈprɑksəmət/","extraExplanation":["“proximad”在英语里不是常见单词，最可能是把 **proximate** 拼错了（少了结尾的 -te），或想表达短语 **in close proximity (to)**（“离……很近”）。","常见搭配：**proximate cause**（直接原因/近因，法律和医学里很常见） vs. **root/underlying cause**（根本/深层原因）。"]}
{"word":"proximal","summary":{"en":"Proximal means “near”: either physically close (especially in anatomy, near the body’s center/attachment) or close in time/sequence (a near-term cause or stage).","zh":"proximal 表示“近的”：可以是空间上靠近（尤指解剖学中靠近身体中心/连接处的近端），也可以是时间或顺序上接近（近期原因或阶段）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) near in space; close to a particular point, especially the center of the body or where something is attached.","zh":"（某物）在空间上靠近的；近端的（尤指靠近身体中心或靠近连接处的）。"},"examples":[{"en":"The proximal end of your forearm is closer to your elbow than your wrist.","zh":"前臂的近端比手腕更靠近肘部。"},{"en":"In anatomy class, we learned the difference between proximal and distal bones.","zh":"在解剖课上，我们学习了近端骨与远端骨的区别。"}]},{"partOfSpeech":"adj.","definition":{"en":"near in time or order; happening soon or at an early stage.","zh":"（时间或顺序上）接近的；即将发生的；在较早阶段的。"},"examples":[{"en":"They focused on the proximal causes of the conflict rather than the distant history.","zh":"他们关注冲突的近因，而不是久远的历史背景。"},{"en":"In project planning, proximal goals can keep the team motivated.","zh":"在项目规划中，近期目标能让团队保持动力。"}]}],"synonyms":["nearby","close","near","adjacent","immediate"],"phonetic":"/ˈprɑksɪməl/","extraExplanation":["“proximal”常见于医学、解剖学、生物学与学术写作。最常搭配的是“proximal vs. distal（近端 vs. 远端）”，用来描述相对于身体中心或附着点的远近。","在社会科学与写作中，“proximal cause（近因）”常与“ultimate/underlying cause（根本原因/深层原因）”对比：proximal强调直接、临近、可触发事件的原因。"]}
{"word":"proximally","summary":{"en":"Proximally means “closer to the body’s center or to a point of attachment/origin,” especially in anatomy and technical contexts.","zh":"Proximally 意为“更靠近身体中心或连接/起点的位置”，多用于解剖、医学与技术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a position closer to the center of the body or to the point where a limb attaches to the body (used especially in anatomy/medicine).","zh":"（尤用于解剖/医学）在更靠近身体中心或更靠近肢体与身体连接处的位置；近端地。"},"examples":[{"en":"The fracture is located proximally in the left femur, near the hip.","zh":"骨折位于左股骨的近端，靠近髋部。"},{"en":"The artery branches proximally and then runs down the arm.","zh":"这条动脉在近端处分支，然后向下延伸到手臂。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a position closer to a particular reference point or origin (more general, less common outside technical writing).","zh":"（更一般的用法）更靠近某个参照点或起点；靠近起始处地。"},"examples":[{"en":"Place the sensor proximally to the heat source for quicker detection.","zh":"把传感器放在更靠近热源的位置，以便更快检测。"},{"en":"The pipe is wider proximally and narrows toward the outlet.","zh":"管道在靠近起点处更宽，向出口方向逐渐变窄。"}]}],"synonyms":["nearer","closer (to)","toward the base","toward the point of attachment"],"phonetic":"/ˈprɑk.sə.mə.li/","extraExplanation":["“proximally”来自“proximal（近端的）”，常与“distally（远端地）”成对出现：proximal/proximally 强调“更靠近躯干或起点”，distal/distally 强调“更远离躯干或起点”。","在日常英语里，人们更常说“closer to the body / closer to the base / nearer to…”；“proximally”多见于医学报告、解剖学教材、科研论文与工程说明。"]}
{"word":"PROXImate","summary":{"en":"“Proximate” means “near/close,” or “immediate/direct,” especially when talking about causes.","zh":"“proximate”表示“接近的、靠近的”，也可表示“直接的、最直接的（原因）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"near in distance, time, or relationship; close","zh":"（距离、时间或关系上）接近的；靠近的"},"examples":[{"en":"The hotel is in close proximity to the airport, so it’s very convenient.","zh":"这家酒店离机场很近，所以非常方便。"},{"en":"Their offices are proximate, and the teams meet often.","zh":"他们的办公室离得很近，因此团队经常见面。"},{"en":"The proximate date of the event is still uncertain.","zh":"活动的大致临近日期仍不确定。"}]},{"partOfSpeech":"adj.","definition":{"en":"immediate or direct (especially of a cause); closest in the chain of events","zh":"直接的；最直接的（尤指原因）；在一连串事件中最接近结果的"},"examples":[{"en":"The proximate cause of the blackout was a storm that damaged power lines.","zh":"停电的直接原因是一场暴风雨损坏了电线。"},{"en":"Lack of sleep was the proximate reason she made mistakes at work.","zh":"睡眠不足是她工作出错的直接原因。"}]}],"synonyms":["near","close","nearby","adjacent","immediate","direct"],"phonetic":"/ˈprɑksəmət/","extraExplanation":["“proximate”常见于较正式的书面语或新闻、学术语境，日常口语里更常用“near / close”。","法律中“proximate cause（近因/相当因果关系）”是一个固定搭配，指与结果在法律上足够直接、可归责的原因，并不一定是时间上最近的那一个原因。"]}
{"word":"proximate","summary":{"en":"Proximate means “close/near,” and it often refers to something immediate or directly related, especially a direct cause.","zh":"proximate 表示“接近的/邻近的”，也常指“直接的、眼前的”，尤其用于“直接原因（近因）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"near in space, time, or relationship; close (often used in formal writing).","zh":"在空间、时间或关系上接近的；邻近的（常用于正式语境）。"},"examples":[{"en":"We chose a hotel proximate to the airport.","zh":"我们选了一家靠近机场的酒店。"},{"en":"Stress can be a proximate cause of sleep problems.","zh":"压力可能是睡眠问题的近因（直接原因）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a cause) the direct or immediate one, rather than the underlying/root cause.","zh":"（指原因）直接的、眼前的（相对于根本原因）。"},"examples":[{"en":"The proximate cause of the accident was speeding.","zh":"事故的直接原因是超速。"},{"en":"The investigation focused on proximate causes, not long-term policy failures.","zh":"调查聚焦于直接原因，而不是长期的政策失误。"}]}],"synonyms":["near","close","nearby","adjacent","immediate"],"phonetic":"/ˈprɑːksəmət/","extraExplanation":["“proximate”常见于法律、科学与新闻报道中，尤其在“proximate cause（近因/直接原因）”这一搭配里：强调与结果最直接相连的原因；而“ultimate/root cause（根本原因）”指更深层、更长期的因素。","与“near/close”相比，“proximate”更正式、更书面；日常口语里通常说“near”或“close to”。"]}
{"word":"proximately","summary":{"en":"Proximately means “close/near” or “directly (as a cause),” often in formal or legal contexts.","zh":"Proximately 表示“接近地/近似地”，也可指“直接（作为原因）”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Nearly; close in time, place, or relationship (often used in formal or technical writing).","zh":"近似地；接近地（在时间、地点或关系上很接近；常见于较正式或技术性语境）。"},"examples":[{"en":"The clinic is proximately located to the subway station.","zh":"这家诊所的位置离地铁站很近。"},{"en":"The two events occurred proximately in time, so people linked them together.","zh":"这两件事发生的时间很接近，所以人们把它们联系在一起。"}]},{"partOfSpeech":"adv.","definition":{"en":"Directly or immediately, especially as a cause (common in legal writing: “proximately caused”).","zh":"直接地；近因地（尤用于法律语境，表示“直接导致/近因导致”）。"},"examples":[{"en":"The plaintiff argued the injury was proximately caused by the defective product.","zh":"原告主张该伤害是由缺陷产品直接造成的（属于近因）。"}]}],"synonyms":["nearby","closely","nearly","directly","immediately"],"phonetic":"/ˈprɑːksɪmətli/","extraExplanation":["“proximately”比较正式，日常英语里更常用的是“nearby / close by / close to”。","很多学习者会把“proximately”误当成“approximately（大约）”。两者意思不同：proximately=“接近/直接”，approximately=“大约/约莫”。","在法律英语里，“proximate cause（近因）”是一个常见概念，强调与结果之间“足够接近、可归责的直接原因”，因此常见搭配是“proximately caused”。"]}
{"word":"proximateness","summary":{"en":"“Proximateness” means closeness or the state of being near (often replaced by “proximity” or “closeness”).","zh":"“proximateness”指“接近、亲近”的状态（常用“proximity”或“closeness”替代）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being near in space, time, relationship, or similarity; closeness","zh":"接近（在空间、时间、关系或相似性上的接近）；亲近"},"examples":[{"en":"The small screen makes the characters feel within proximateness of the viewer.","zh":"小屏幕让角色显得离观众很近。"},{"en":"Their proximateness grew after they worked on the project together.","zh":"一起做项目后，他们的关系更亲近了。"},{"en":"We can’t promise immediacy, but we can offer proximateness in delivery time.","zh":"我们无法保证立刻送达，但可以保证送达时间很接近。"}]}],"synonyms":["proximity","closeness","nearness"],"phonetic":"/ˈprɑːksɪmɪtnəs/","extraExplanation":["“proximateness”并不是非常常见的标准用词，更常见的表达是 “proximity”（接近/邻近）或 “closeness”（亲近/紧密）。它由 “proximate（近的）+ -ness（名词后缀，表示性质/状态）”构成，因此意思容易从构词法推断。","在学术或较正式的写作中，通常用 “proximity” 来表示客观距离（如地理、时间），用 “closeness” 更常表示情感或关系上的亲近。"]}
{"word":"proximation","summary":{"en":"Proximation means “coming close” or “a close-but-not-exact estimate,” though it’s much less common than approximation.","zh":"Proximation指“接近”或“近似但不精确的估计”，但它远不如approximation常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of coming near to something in position, time, degree, or similarity; an estimate that is close but not exact (a less common word than “approximation”)","zh":"接近（在位置、时间、程度或相似性上）；近似估计（比“approximation”少见）"},"examples":[{"en":"The model gives a proximation of the true value, not an exact answer.","zh":"这个模型给出的是对真实数值的近似，而不是精确答案。"},{"en":"As the deadline approached, there was a clear proximation in the team’s schedule.","zh":"随着截止日期临近，团队的日程明显变得更紧迫（更接近截止点）。"}]},{"partOfSpeech":"n.","definition":{"en":"(psychology, behavior training) a step that moves gradually closer to a target behavior, often used in “successive proximation/approximation” (also called shaping)","zh":"（心理学/行为训练）逐步接近目标行为的一步，常见于“successive proximation/approximation”（也称塑造/塑形）"},"examples":[{"en":"The therapist used small rewards for each proximation toward speaking in full sentences.","zh":"治疗师对每一步接近“用完整句子表达”的行为都给予小奖励。"},{"en":"Each proximation was reinforced until the final behavior appeared.","zh":"每一步近似行为都被强化，直到最终目标行为出现。"}]}],"synonyms":["approximation","estimate","nearness","closeness","proximity"],"phonetic":"/ˌprɑksəˈmeɪʃən/","extraExplanation":["“proximation”在现代英语里比较少见；日常与学术写作中更常用的是“approximation（近似；近似值）”。如果你想表达“估算/近似”，一般选“approximation”更自然。","词根来自“proximate（接近的）/proximity（接近）”，核心概念是“变得更近”。在行为心理学语境里，你可能会看到“successive approximation（逐步接近）”比“successive proximation”更常见。"]}
{"word":"proxime","summary":{"en":"“Proxime” is a rare formal word meaning “next/nearest,” and it’s most often seen in the phrase “proxime accessit,” meaning “runner-up.”","zh":"“proxime”是一个少见的正式用词，意为“下一个/最近的”；更常见于短语“proxime accessit”，表示“亚军/次名”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(formal, rare) Next; nearest in time or order.","zh":"（正式/少见）下一个；最近的（时间或顺序上）"},"examples":[{"en":"The meeting is scheduled for Tuesday proxime.","zh":"会议安排在下周二（下一个星期二）。"},{"en":"Payment is due on the first day of the month proxime.","zh":"款项须在下一个月的第一天到期。"}]},{"partOfSpeech":"n.","definition":{"en":"(used in academic award lists) The runner-up; the person who came closest to winning.","zh":"（用于学术奖励名单）亚军；最接近获奖者的人"},"examples":[{"en":"She was named proxime accessit for her essay.","zh":"她的论文获得“proxime accessit”（亚军/次优奖）。"},{"en":"Two students received prizes, and one was listed as proxime accessit.","zh":"两名学生获奖，另有一名被列为“proxime accessit”（次名）。"}]}],"synonyms":["next","upcoming","nearest","runner-up","second place"],"phonetic":"ˈprɑːk.sɪm","extraExplanation":["“proxime”来自拉丁语，原意是“最近地/紧接着”。现代英语里非常少单独使用，多出现在拉丁短语“proxime accessit”（字面义“几乎达到/最接近”）中，常见于英国或英联邦传统的学校、大学竞赛或奖项公告里，表示“次名/亚军”。","在普通英语写作中，更自然的替代说法是 next / upcoming / the following（表示“下一个”），以及 runner-up / second place（表示“亚军”）。"]}
{"word":"proximitas","summary":{"en":"“Proximitas” is a rare Latin-derived word meaning “proximity” or “nearness.”","zh":"“proximitas”是一个较少见的拉丁借词，意思相当于“proximity（接近、邻近）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from Latin) proximity; nearness in space, time, or relationship.","zh":"（罕见；源自拉丁语）接近；邻近（指空间、时间或关系上的靠近）。"},"examples":[{"en":"In the poem, the speaker longs for proximitas—simple nearness to the beloved.","zh":"在这首诗里，叙述者渴望“proximitas”——与所爱之人单纯的靠近。"},{"en":"Researchers sometimes discuss social proximitas when communities live and work close together.","zh":"研究者有时用“social proximitas”来讨论社区在生活与工作上彼此接近的情况。"}]}],"synonyms":["proximity","nearness","closeness","adjacency"],"phonetic":"/prɑkˈsɪmɪtəs/","extraExplanation":["“proximitas”是拉丁语名词，来自“proximus”（最近的、最接近的）。在现代英语里通常不用它，而用更常见的“proximity”。在学术写作或带有古典风格的文学语境中，偶尔会借用“proximitas”来营造古典、严肃或“拉丁化”的语气。","如果你在英文文章里看到它，通常作者是刻意选择一个拉丁词来强调“亲近/邻近”这一概念，或与其他拉丁术语并列（例如法律、哲学、神学或古典研究语境）。"]}
{"word":"proximities","summary":{"en":"“Proximities” is the plural of “proximity,” meaning nearness, and sometimes “nearby areas.”","zh":"“proximities”是“proximity”的复数，主要表示“接近/邻近”，有时也指“附近地区/周边”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being near in space, time, or relationship; nearness","zh":"接近；邻近（在空间、时间或关系上）"},"examples":[{"en":"Because of the proximities of the two stations, you can walk from one to the other in five minutes.","zh":"由于两个车站距离很近，你可以五分钟内从一个走到另一个。"},{"en":"The proximities of the deadlines made the team feel stressed.","zh":"截止日期相隔很近，让团队感到压力很大。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) nearby places or surrounding area(s)","zh":"（复数）附近地区；周边"},"examples":[{"en":"There are several good restaurants in the proximities of the hotel.","zh":"酒店附近有几家不错的餐馆。"}]}],"synonyms":["nearness","closeness","vicinities","nearby areas"],"phonetic":"/prɑkˈsɪmətiz/","extraExplanation":["“proximities”是“proximity”的复数。更常见的说法是用单数“in close proximity to …”（紧邻……），或直接说“near/nearby”。","在第2个意思（“附近地区”）里，母语者更常用“in the vicinity/vicinities (of …)”或“nearby area(s)”。用“the proximities of …”虽能理解，但略显正式或不如“vicinity”自然。"]}
{"word":"proximity","summary":{"en":"Proximity means being close—physically, in time, or in relationship—often used in formal contexts like “proximity to the airport.”","zh":"Proximity 表示“接近/邻近”，可指空间、时间或关系上的接近，常用于较正式表达，如“proximity to the airport（靠近机场）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nearness in space, distance, time, or relationship; being close to something","zh":"（空间、距离、时间或关系上的）接近；邻近"},"examples":[{"en":"The hotel’s main advantage is its proximity to the airport.","zh":"这家酒店的主要优势是离机场很近。"},{"en":"Because of their proximity, the neighbors often help each other.","zh":"因为住得近，邻居们经常互相帮忙。"},{"en":"The police searched the area in close proximity to the crime scene.","zh":"警方在靠近案发现场的区域进行了搜查。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being near enough to cause an effect or create a risk","zh":"（近到足以产生影响或风险的）贴近；临近"},"examples":[{"en":"Avoid using open flames in proximity to gasoline.","zh":"避免在汽油附近使用明火。"},{"en":"The proximity of the storm made everyone anxious.","zh":"暴风雨的逼近让大家都很焦虑。"}]}],"synonyms":["closeness","nearness","vicinity","adjacency"],"phonetic":"/prɑkˈsɪməti/","extraExplanation":["“proximity”常用于较正式的书面或新闻语境，口语里也常用“closeness”或“nearby”。","常见搭配：proximity to（靠近……）；in close proximity (to)（紧挨着/非常接近）；in the proximity of（在……附近，较正式）。","词源提示：来自拉丁语“proximus”（最近的），同源词包括“proximate”（邻近的/近似的）。"]}
{"word":"proximo","summary":{"en":"Proximo (from Spanish/Portuguese) means “next/upcoming” or “nearest,” and in English it’s most often seen in phrases or as a name/brand.","zh":"Proximo（源自西/葡语）主要表示“下一个/即将到来的”或“最近的”；在英语里多见于短语或作为名称/品牌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Spanish/Portuguese) next; upcoming; the one that comes immediately after; also “nearest.”","zh":"（源自西班牙语/葡萄牙语）下一个；即将到来的；紧接着的；也可指“最近的/最接近的”。"},"examples":[{"en":"See you next time—hasta la próxima.","zh":"下次见——hasta la próxima（下次见）。"},{"en":"The next train arrives at 6:10.","zh":"下一班火车 6:10 到。"},{"en":"Is there a bank nearby—the nearest one?","zh":"附近有银行吗——最近的那家？"}]},{"partOfSpeech":"other","definition":{"en":"(Less common in English) used as a name/brand/title (e.g., a company, product, or surname).","zh":"（英语中较少见）用作名称/品牌/标题（如公司名、产品名或姓氏）。"},"examples":[{"en":"Proximo is the name of a media company.","zh":"Proximo 是一家媒体公司的名字。"}]}],"synonyms":["next","upcoming","nearest","closest"],"phonetic":"/ˈprɑːksɪmoʊ/","extraExplanation":["“próximo”在西班牙语里常见，重音在第一音节（próx-），写作时通常带重音符号：próximo。","固定说法：\"hasta la próxima\"=“下次见”。葡萄牙语里也有相近形式（próximo/próxima），意思类似“下一个/最近的”。","英语里一般不会把它当作常用词；更常见的是直接用英语 next / upcoming / nearest。"]}
{"word":"proximobuccal","summary":{"en":"A dental term describing a tooth area that is both proximal and buccal (toward the cheek).","zh":"牙科术语：描述牙齿同时处于“邻面方向”且“颊侧（靠近脸颊）”的部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the surface of a tooth that is both toward the front/midline of the dental arch (proximal) and toward the cheek (buccal); used especially in dentistry to describe a specific area or corner of a tooth surface (e.g., a “proximobuccal line angle”).","zh":"（牙科）指牙齿表面同时“靠近牙弓前方/中线的邻面（proximo-）”并“靠近脸颊的颊侧（-buccal）”的部位；常用于描述牙面某个具体区域或角（如“邻颊线角”）。"},"examples":[{"en":"The dentist noted early decay near the proximobuccal area of the molar.","zh":"牙医发现臼齿邻颊侧区域附近有早期龋坏。"},{"en":"A cavity can start at the proximobuccal line angle if plaque builds up there.","zh":"如果牙菌斑在邻颊线角堆积，蛀牙可能从那里开始。"},{"en":"The restoration was shaped to match the tooth’s proximobuccal contour.","zh":"修复体被塑形以贴合牙齿的邻颊侧外形。"}]}],"synonyms":["proximal-buccal","proximal buccal","mesiobuccal (related but different)","distobuccal (related but different)"],"phonetic":"/ˌprɑk.sə.moʊˈbʌk.əl/","extraExplanation":["这是一个高度专业的牙科复合词：proximo-（与“邻面/靠近前方或中线”相关）+ buccal（颊侧、靠近脸颊的一侧）。在牙科记录里，它常用来精准定位龋坏、缺损或修复体的位置，例如“proximobuccal surface/area（邻颊侧面/区域）”或“proximobuccal line angle（邻颊线角）”。","日常英语里几乎不会用到该词；更多出现在病历、影像报告、牙体解剖或修复学教材中。"]}
{"word":"proximolabial","summary":{"en":"Proximolabial means “toward both the neighboring-tooth side and the lip side,” mainly used in dentistry to describe tooth surfaces or corners.","zh":"proximolabial 指“同时朝向邻牙侧与唇侧”的位置，多用于牙科描述牙面、线角或牙体部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dentistry/Anatomy) Relating to the area of a tooth or structure that is both proximal (near an adjacent tooth) and labial (facing the lips).","zh":"（牙科/解剖）指同时与“邻接面”（靠近相邻牙的一侧，proximal）和“唇面”（朝向嘴唇的一侧，labial）相关的牙体部位或方向。"},"examples":[{"en":"The dentist noted slight wear on the proximolabial corner of the incisor.","zh":"牙医发现门牙的近中唇侧角有轻微磨耗。"},{"en":"A small cavity was found near the proximolabial line angle.","zh":"在近中唇侧线角附近发现了一个小龋洞。"}]}],"synonyms":["labio-proximal","mesiolabial","distolabial"],"phonetic":"/ˌprɑk.sə.moʊˈleɪ.bi.əl/","extraExplanation":["词源上可拆为 proximo-（靠近、邻近）+ labial（唇的、唇侧的）。在牙科里常用来描述“线角/点角”等位置，例如把牙的邻接面（近中/远中）与唇面组合来更精确地定位。","在前牙（门牙、犬牙）的描述中更常见，因为这些牙有明显的唇面（labial surface）。若用于更具体的方向，临床也常见 mesiolabial（近中唇侧）与 distolabial（远中唇侧）等词。"]}
{"word":"proximolingual","summary":{"en":"A rare adjective meaning “related to nearby languages or linguistic closeness.”","zh":"一个罕见形容词，表示“与附近语言或语言接近性有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to, involving, or shaped by languages spoken nearby; connected to linguistic proximity (how close languages or dialects are in geography or similarity).","zh":"（罕见）与附近使用的语言有关的；涉及或受“语言上的接近性”（地理距离近或语言相似度高）影响的。"},"examples":[{"en":"In border regions, a proximolingual environment often leads to many borrowed words.","zh":"在边境地区，proximolingual（邻近语言影响）的环境常常会带来大量借词。"},{"en":"The study looked at proximolingual influence between neighboring dialects.","zh":"这项研究考察了相邻方言之间的 proximolingual（邻近语言）影响。"}]}],"synonyms":["neighboring-language","linguistically close","contact-related","areal"],"phonetic":"/ˌprɑːk.sɪ.moʊˈlɪŋ.ɡwəl/","extraExplanation":["这个词在主流词典里通常找不到，多见于学术写作或个人造词。结构上可理解为 proximity（接近、邻近）+ lingual（语言的）。","在语言学里，如果你想用更常见、更地道的表达，可以根据语境改用：neighboring languages（相邻语言）, linguistic proximity（语言接近性）, contact between languages（语言接触）, areal influence（区域影响）。"]}
{"word":"proximus","summary":{"en":"Proximus is mainly a Latin word meaning “nearest/next,” and it is also a proper name—most notably a Belgian telecom company.","zh":"Proximus 主要是拉丁语词，意为“最近的/下一个”；也可作专有名词，最常指比利时电信公司 Proximus。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English mainly in mottos, names, or scholarly writing) “nearest; closest; next.”","zh":"（拉丁语；在英语中多见于格言、名称或学术语境）“最近的；最接近的；下一个的。”"},"examples":[{"en":"The motto uses Latin: “Proximus sum,” meaning “I am nearest.”","zh":"这句格言用了拉丁语：“Proximus sum”，意思是“我是最近的/最接近的。”"},{"en":"In some texts, proximus can mean “the next one” in a sequence.","zh":"在一些文本里，proximus 也可表示序列中的“下一个”。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name, most commonly referring to Proximus, a Belgian telecommunications company and brand.","zh":"专有名词，最常指比利时电信公司/品牌 Proximus（普罗克西姆斯）。"},"examples":[{"en":"Proximus is one of the major telecom providers in Belgium.","zh":"Proximus 是比利时主要的电信运营商之一。"},{"en":"My SIM card is from Proximus.","zh":"我的 SIM 卡是 Proximus 的。"}]}],"synonyms":["nearest","closest","next"],"phonetic":"/ˈprɑksɪməs/","extraExplanation":["“Proximus”源自拉丁语，和英语里的 proximal（近端的）、proximity（接近、邻近）是同源词根（proxim-）。在现代英语里，proximus 本身不算常用词，更常见于拉丁语引用、学术命名或品牌名称。"]}
{"word":"proxy","summary":{"en":"A proxy is a representative or substitute, or an intermediary (especially online) that acts on your behalf.","zh":"proxy 指“代理/代替者”，也可指网络中的“代理服务器”，在你与他人或互联网之间代为处理事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization authorized to act for someone else; a substitute or representative.","zh":"被授权代表他人行事的人或机构；代理人；代替者。"},"examples":[{"en":"She voted by proxy because she couldn’t attend the meeting.","zh":"她因为无法出席会议而进行了委托投票（代投）。"},{"en":"In the negotiation, the lawyer acted as a proxy for the client.","zh":"在谈判中，律师作为客户的代理人出面。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that is used to represent or measure something indirectly (a stand-in sign).","zh":"用来间接代表或衡量某事物的人或事物（替代指标/代表）。"},"examples":[{"en":"Researchers sometimes use income as a proxy for social status.","zh":"研究人员有时用收入作为社会地位的替代指标。"},{"en":"Because we couldn’t measure stress directly, we used sleep quality as a proxy.","zh":"因为无法直接测量压力，我们用睡眠质量作为替代指标。"}]},{"partOfSpeech":"n.","definition":{"en":"A server or service that acts as an intermediary between a user and the internet, often for privacy, security, or access control.","zh":"在用户与互联网之间充当中间人的服务器或服务，常用于隐私、安全或访问控制。"},"examples":[{"en":"Our company requires employees to connect through a proxy server.","zh":"公司要求员工通过代理服务器连接网络。"},{"en":"The proxy hid the device’s IP address from the website.","zh":"代理隐藏了设备的 IP 地址，使网站看不到真实地址。"}]},{"partOfSpeech":"v.","definition":{"en":"To act as a proxy for someone; to represent or substitute for them.","zh":"充当某人的代理；代表或替代某人。"},"examples":[{"en":"A colleague proxied for me at the conference.","zh":"一位同事在会议上替我出席（代我参与）。"},{"en":"In some systems, one account can proxy requests for another.","zh":"在一些系统中，一个账号可以代理另一个账号发出请求。"}]}],"synonyms":["representative","substitute","stand-in","agent","intermediary"],"phonetic":"/ˈprɑksi/","extraExplanation":["“proxy”来自拉丁语 pro（代替）+ curare（照料、管理），核心意思是“代为处理”。在日常英语里最常见的固定搭配包括：by proxy（委托；代为）、proxy vote（委托投票）、proxy server（代理服务器）。","学术写作里常见“X is a proxy for Y”（X 是 Y 的替代指标/代表），强调“不能直接测量或观察 Y，所以用 X 来间接反映”。"]}
{"word":"proxying","summary":{"en":"“Proxying” means acting as a go-between, especially relaying requests or traffic for another party (often in tech).","zh":"“Proxying”指充当中间人，替另一方转发/处理请求或流量（多用于技术语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acting as an intermediary—sending requests or information on behalf of someone/something else.","zh":"充当中间人——代表他人/其他系统转发请求或传递信息。"},"examples":[{"en":"The server is proxying user requests to an internal service.","zh":"服务器正在把用户请求代理转发到内部服务。"},{"en":"A VPN can be used for proxying traffic through another location.","zh":"VPN 可用于把流量代理到另一个地点。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle) To act as a proxy; to relay or handle communication/requests for another party.","zh":"（现在分词）作为代理进行转发；替另一方处理通信或请求。"},"examples":[{"en":"She is proxying messages between the client and the developer.","zh":"她在客户和开发者之间代传消息。"},{"en":"The gateway is proxying calls so the app doesn’t talk to the database directly.","zh":"网关在代理转发调用，这样应用就不必直接连接数据库。"}]}],"synonyms":["acting as an intermediary","forwarding","relaying","routing","tunneling"],"phonetic":"/ˈprɑk.si.ɪŋ/","extraExplanation":["“proxying”常见于技术语境（网络、软件、API）。日常英语里更常说“acting as a proxy / forwarding”。","在网络里，proxying 往往强调“代为请求并返回结果”（如反向代理 reverse proxy、正向代理 forward proxy）；而单纯的“forwarding”更偏“转发”这一动作，不一定代表你去“替对方请求”。"]}
{"word":"proxyship","summary":{"en":"Proxyship means the role or authority of acting as a proxy for someone else.","zh":"proxyship 指作为他人代理人的身份或代理权限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the role, authority, or condition of acting as a proxy (someone who represents or acts for another person).","zh":"代理（他人）的角色、权限或状态；代行他人事务的身份/资格。"},"examples":[{"en":"She accepted the proxyship so she could vote on behalf of her absent colleague.","zh":"她接受了代理权，以便能代表缺席的同事投票。"},{"en":"The contract clearly limits the proxyship to signing routine documents only.","zh":"合同明确规定该代理权限仅限于签署例行文件。"}]}],"synonyms":["proxy authority","representation","agency","delegation"],"phonetic":"/ˈprɑksiˌʃɪp/","extraExplanation":["“proxyship”不是非常常见的词，更常见的表达是“proxy”（代理人/代理）或“proxy authority / proxy arrangement”（代理权限/代理安排）。在公司治理、股东投票、法律授权等语境中更可能出现。","含义上接近“the state of being a proxy（作为代理人的身份）”，强调“身份/资格/权限”这一层面。"]}
{"word":"proxysm","summary":{"en":"Paroxysm means a sudden, intense outburst or attack (emotion or symptoms), often happening in episodes.","zh":"Paroxysm 指情绪或症状等突然强烈的爆发/发作，常呈阵发性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden, intense attack or outburst of a feeling, action, or symptom (often something unpleasant like anger, laughter, or pain)","zh":"（情绪、行为或症状的）突然爆发；（通常指不愉快的）阵发，如愤怒、笑、疼痛等"},"examples":[{"en":"He flew into a paroxysm of anger when he heard the news.","zh":"他听到消息后怒火突然爆发。"},{"en":"The child burst into a paroxysm of laughter.","zh":"孩子突然笑得前仰后合。"},{"en":"She had a paroxysm of coughing during the meeting.","zh":"她在会议中突然剧烈咳嗽了一阵。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical) a sudden worsening of a disease or symptom, especially one that happens in episodes","zh":"（医学）疾病或症状的阵发性加重；急性发作（常以一阵一阵出现）"},"examples":[{"en":"The patient experienced paroxysms of chest pain.","zh":"病人出现了阵发性胸痛。"},{"en":"Doctors monitored him for paroxysms of atrial fibrillation.","zh":"医生监测他是否出现阵发性房颤。"}]}],"synonyms":["outburst","fit","spasm","attack","flare-up"],"phonetic":"/ˈpærəkˌsɪzəm/","extraExplanation":["你输入的“proxysm”通常被认为是拼写错误；正确拼写更常见的是 **paroxysm**。","词源提示：paroxysm 来自希腊语，原意与“刺激、激起”有关，所以常用来表达“突然被某种情绪或症状猛烈袭击”的感觉。","使用感：在日常对话里可以说 “burst of anger/laughter”（一阵愤怒/大笑）；**paroxysm** 更偏书面、文学或医学语境。"]}

