{"word":"prozone","summary":{"en":"Prozone is a testing phenomenon where too much antibody can hide an immune reaction and produce a false negative or weak result.","zh":"Prozone 指抗体过量导致免疫反应不易显现、从而出现假阴性或反应偏弱的检验现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Immunology/diagnostics) A laboratory phenomenon where an excess of antibodies prevents visible antigen–antibody reactions (such as agglutination or precipitation), which can cause a false negative or weaker test result.","zh":"（免疫学/检验）“前带现象”：当抗体过量时，反而抑制抗原-抗体反应（如凝集或沉淀）的可见表现，可能导致检验结果假阴性或反应变弱。"},"examples":[{"en":"The rapid test was negative at first, but dilution revealed a prozone effect.","zh":"快速检测一开始是阴性，但稀释后显示出前带现象。"},{"en":"In cases of very high antibody levels, prozone can mask agglutination.","zh":"在抗体水平非常高的情况下，前带现象会掩盖凝集反应。"},{"en":"To avoid prozone, the lab repeated the assay with serial dilutions.","zh":"为避免前带现象，实验室用系列稀释重复了检测。"}]}],"synonyms":["prozone effect","high-dose antibody effect","hook effect (related)"],"phonetic":"/ˈproʊzoʊn/","extraExplanation":["“prozone”常见于血清学/免疫学检测语境。直观理解是：抗体太多时，每个抗原位点被“单独占满”，不容易形成能让肉眼/仪器看见的“交联网络”，于是反应看起来反而不明显。","临床与检验上常用“稀释样本再测”来排除或确认前带现象；相关概念还有“后带现象（postzone）”以及更广义的“钩状效应（hook effect）”，都可能造成结果偏低或假阴性。"]}
{"word":"prozoning","summary":{"en":"“Prozoning” means supporting zoning rules that control land use and building types.","zh":"“prozoning”指支持分区制（用地与建筑用途管制）及相关规定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or supporting zoning rules (laws that control how land and buildings can be used in an area).","zh":"支持分区制（用法律规定土地与建筑用途的制度）的；赞成实施分区管理的。"},"examples":[{"en":"The council member is strongly prozoning and wants clear rules for new housing.","zh":"这位市议员非常支持分区制，想为新住房制定清晰的规定。"},{"en":"Some residents are prozoning because they think it protects neighborhood character.","zh":"一些居民支持分区制，因为他们认为这能保护社区风貌。"}]},{"partOfSpeech":"n.","definition":{"en":"support for zoning as a policy idea or political position.","zh":"对分区制的支持（作为一种政策理念或政治立场）。"},"examples":[{"en":"In the debate, prozoning clashed with calls to loosen land-use rules.","zh":"在辩论中，支持分区制的一方与主张放宽用地规定的呼声发生冲突。"}]}],"synonyms":["pro-zoning","in favor of zoning","zoning-supportive","pro-regulation (context-dependent)"],"phonetic":"/ˌproʊˈzoʊnɪŋ/","extraExplanation":["“Zoning（分区制）”在美国城市规划中很常见，会把土地分为住宅区、商业区、工业区等，并规定建筑高度、密度、停车位、用途等。讨论“prozoning”时，常见的理由包括：减少噪音与污染、保持社区外观、让开发更可预测；反对者则可能认为某些分区规则会限制住房供应、抬高房价。","写作上更常见的形式是带连字符的 **pro-zoning**。在新闻、政策讨论或社区会议记录里也会看到合写的 **prozoning**。"]}
{"word":"prozygapophysis","summary":{"en":"A vertebra’s front articular process that joints with the vertebra ahead.","zh":"椎骨前侧用于与前一节椎骨关节连接的关节突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The anterior (front) articular process of a vertebra; the forward-facing part that forms a joint with the vertebra in front. (Also called a prezygapophysis.)","zh":"椎骨的前关节突；位于椎骨前侧、用于与前一节椎骨形成关节连接的结构。（也称 prezygapophysis。）"},"examples":[{"en":"In many reptiles, the prozygapophysis helps stabilize the spine during movement.","zh":"在许多爬行动物中，前关节突有助于在运动时稳定脊柱。"},{"en":"The fossil shows a well-preserved prozygapophysis, which helps identify the vertebra’s position.","zh":"这块化石保存了清晰的前关节突，这有助于判断椎骨的位置。"}]}],"synonyms":["prezygapophysis","anterior zygapophysis","anterior articular process"],"phonetic":"ˌproʊzɪɡəˈpɑfəsɪs","extraExplanation":["这是一个较少见但很专业的解剖学/古生物学术语，常见于脊椎动物骨骼描述与化石鉴定。","词素拆解有助记忆：pro-（向前）+ zyga-（连接/轭，指关节连接）+ -physis（生长/突起）。","与之相对的是 metazygapophysis（后关节突），两者共同参与相邻椎骨之间的关节连接与稳定。"]}
{"word":"prozymite","summary":{"en":"“Prozymite” is not a standard English word; it is likely a product/brand name or a misspelling.","zh":"“prozymite”不是标准英语词，可能是产品/品牌名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a brand name, a product name, or a misspelling of another word.","zh":"不是标准英语单词。它很可能是品牌名/产品名，或是某个单词的拼写错误。"},"examples":[{"en":"I couldn’t find “prozymite” in a dictionary—do you mean a product name or another word?","zh":"我在词典里查不到“prozymite”——你是指某个产品名，还是另一个单词？"},{"en":"Could you tell me where you saw the word “prozymite” (a label, a text, or online)?","zh":"你能告诉我你在哪里看到“prozymite”这个词吗（标签、文章还是网上）？"}]}],"phonetic":"/ˈproʊzaɪmaɪt/","extraExplanation":["“prozymite”看起来像是由“pro-（支持/促进）+ enzyme（酶）”这一类构词思路拼出来的名字，所以常见于保健品、清洁剂或农业产品的商标/产品名中；但它本身不是常见词典收录的英语词汇。","如果你把出现“prozymite”的完整句子、图片（比如包装成分表）、或你想表达的意思发我，我可以帮你判断：\n1) 是否是某个专有名词（品牌/药品/补充剂）；\n2) 是否是拼写错误；\n3) 最接近的正确英语词是什么，以及在语境中怎么翻译。"]}

