{"word":"prud","summary":{"en":"“Prud” is an informal noun meaning a prudish person (often insulting), and it can also be a nickname for “Prudence.”","zh":"“prud”是非正式名词，常指“过分拘谨保守的人”（略贬义），也可作名字“Prudence”的简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prudish person; someone who is easily shocked by sexual talk or behavior (informal, often slightly insulting)","zh":"拘谨保守的人；对性话题或行为很容易大惊小怪的人（非正式，常带轻微贬义）"},"examples":[{"en":"Don’t be such a prud—this is a normal health class topic.","zh":"别这么保守了——这是健康课的正常话题。"},{"en":"He called her a prud for refusing to watch the movie, which was unfair.","zh":"他因为她不愿看那部电影就叫她“老古板”，这其实不公平。"}]},{"partOfSpeech":"n.","definition":{"en":"a shortened form of the name Prudence (informal)","zh":"名字 Prudence 的昵称/简写（非正式）"},"examples":[{"en":"Prud is short for Prudence in the old family letters.","zh":"在那些老家书里，Prud 是 Prudence 的简称。"}]}],"synonyms":["prude","prudish person"],"phonetic":"/pruːd/","extraExplanation":["“prud”多见于口语或写作中，语气可能带嘲讽或指责；更中性的表达可以用“conservative / reserved”。","与之相关的形容词是“prudish”（过分拘谨保守的），名词常见搭配还有“a prude”（更常用的拼写）。"]}
{"word":"prude","summary":{"en":"A prude is someone who is overly strict about what is “proper,” especially about sex or sexual language.","zh":"prude 指对“得体”要求过严、尤其对性相关话题非常敏感和保守的人（多带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is easily shocked by sexual topics or language and is very strict about what is “proper.”","zh":"（对性话题或用语）很容易觉得冒犯或震惊、对“得体/端庄”要求非常严格的人。"},"examples":[{"en":"He’s such a prude—he changed the movie as soon as a kissing scene started.","zh":"他太“拘谨/保守”了——一出现接吻镜头就立刻换台。"},{"en":"She’s not a prude; she just prefers not to discuss private topics at work.","zh":"她并不是“假正经/保守”，只是更愿意不在工作场合谈私密话题。"}]}],"synonyms":["prudish person","puritan","straight-laced person","killjoy"],"phonetic":"/pruːd/","extraExplanation":["“prude”通常带有贬义，暗示这个人过度拘谨、爱评判别人。使用时要注意语气与场合，避免冒犯。","常见搭配：a total prude（特别保守/拘谨的人）；be a prude about…（在……方面很保守）。","相关词辨析：conservative（保守的）更中性，可指观念或政治立场；prudish（假正经的/过分拘谨的）是形容词，语气也偏负面。"]}
{"word":"prudelike","summary":{"en":"“Prudelike” means behaving in an overly proper or easily offended way, especially about sex or morality.","zh":"“prudelike”指表现得过分拘谨或容易被冒犯，尤其在性或道德话题上，常带贬义或讽刺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a prude; overly proper, easily shocked by sexual topics, or showing strict moral judgment in a way that feels unnatural or self-righteous.","zh":"像“假正经的人/道学家”一样的；过分拘谨、对性话题很容易大惊小怪，或以不自然、带优越感的方式严格评判道德。"},"examples":[{"en":"He made a prudelike comment when the conversation turned to dating.","zh":"聊天聊到约会时，他发表了一句很“假正经”的评论。"},{"en":"She isn’t conservative—she just dislikes prudelike jokes at work.","zh":"她并不保守——她只是讨厌在工作场合那种“假正经”的玩笑。"},{"en":"The film was criticized by some prudelike reviewers for being “too bold.”","zh":"这部电影被一些“假正经”的影评人批评“太大胆”。"}]}],"synonyms":["priggish","puritanical","prim","straitlaced","prudish"],"phonetic":"/ˈpruːdˌlaɪk/","extraExplanation":["“prudelike”由名词 prude（指对性或礼仪过分拘谨、容易受冒犯的人）+ -like（“像……一样”）构成。语气常带批评或讽刺，暗示对方不是单纯保守，而是“装正经/过度道德评判”。","使用时注意语境：它常用来形容言论或态度（prudelike remark/attitude），直接用来评价某个人（He is prudelike.）可能显得更尖刻。"]}
{"word":"prudely","summary":{"en":"“Prudely” is a rare form meaning “prudently”—doing something carefully and wisely to avoid risk.","zh":"“prudely”是很少见的形式，意思相当于“prudently”：谨慎、明智地做事以避免风险。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/archaic) In a prudent way; sensibly and carefully, especially to avoid risk or trouble.","zh":"（罕见/古体）谨慎地；审慎而明智地（尤指为避免风险或麻烦）。"},"examples":[{"en":"She acted prudely and saved some money for emergencies.","zh":"她做事很谨慎，存了一些钱以备不时之需。"},{"en":"If you invest prudely, you can reduce the chance of big losses.","zh":"如果你投资得当、谨慎行事，就能降低重大亏损的可能性。"}]}],"synonyms":["prudently","wisely","sensibly","carefully"],"phonetic":"/ˈpruːdli/","extraExplanation":["“prudely”在现代英语中非常少见，通常会写作更常用、更自然的“prudently”。如果你是在写作或考试中使用，建议用“prudently”。","词根来自“prudent”（谨慎的、审慎的）。常见搭配：act prudently（谨慎行事）、spend prudently（理性消费）、invest prudently（谨慎投资）。"]}
{"word":"prudence","summary":{"en":"Prudence means careful, sensible judgment—being cautious in a smart, positive way.","zh":"Prudence 指“审慎的判断与谨慎行事”，偏褒义，强调理智与远见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Careful, sensible judgment that helps you avoid unnecessary risk or trouble.","zh":"谨慎；审慎（用理智判断来避免不必要的风险或麻烦）"},"examples":[{"en":"Out of prudence, she saved some money for emergencies.","zh":"出于谨慎，她存了一些钱以备不时之需。"},{"en":"It’s a matter of prudence to check the contract before signing.","zh":"在签字之前检查合同是出于审慎的考虑。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional female name; also used to suggest a person who is cautious and morally careful.","zh":"（女子名）普鲁登斯；也可用来暗示一个谨慎、重视道德的人"},"examples":[{"en":"In the novel, Prudence is the character who always thinks before acting.","zh":"在小说里，普鲁登斯是那个做事前总会先考虑的角色。"}]}],"synonyms":["caution","care","carefulness","good judgment","wisdom","discretion"],"phonetic":"/ˈpruːdəns/","extraExplanation":["“prudence”来自拉丁语 prudentia，核心含义是“预见、明智的判断”。它常带褒义：不是胆小，而是“有远见的谨慎”。","常见搭配：out of prudence（出于谨慎），a measure of prudence（审慎之举），financial prudence（理财谨慎），exercise prudence（保持谨慎）。","文学提示：简·奥斯汀小说《Sense and Sensibility》常被译为《理智与情感》，“sense”在这里就接近“prudence/理智的判断”，强调克制与审慎。"]}
{"word":"prudences","summary":{"en":"“Prudences” is the plural of “prudence,” meaning careful and wise actions or judgments, often about risk or money.","zh":"“Prudences”是“prudence”的复数，指多种谨慎、明智的做法或判断，常与风险或金钱相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of prudence: careful, wise behavior and good judgment, especially about risks, money, or future consequences","zh":"prudence 的复数：谨慎、明智的行为与判断，尤其指对风险、金钱或后果的审慎考虑"},"examples":[{"en":"The company’s new policies were driven by prudences learned during the last recession.","zh":"公司的新政策源于上一次经济衰退中学到的多种谨慎做法。"},{"en":"In times of uncertainty, small prudences—saving a little, planning ahead—can make life easier.","zh":"在不确定的时期，一些小小的谨慎之举——存点钱、提前规划——会让生活更轻松。"}]}],"synonyms":["cautions","precautions","carefulness","judgments","discretion"],"phonetic":"/ˈpruːdəns/","extraExplanation":["“Prudences”在现代英语里不算特别常见；更多时候人们会用不可数名词“prudence”（谨慎）来泛指这种品质。用复数“prudences”时，通常强调“多种具体的谨慎措施/做法”。","词源来自拉丁语 prudentia，含义与“预见、明智判断”相关。常见搭配：financial prudence（财务谨慎）、a measure of prudence（一定程度的谨慎）、out of prudence（出于谨慎）。"]}
{"word":"prudent","summary":{"en":"Prudent means wise and careful, especially about avoiding risk and managing money or resources sensibly.","zh":"Prudent 指“明智而谨慎”，尤其强调避免风险、在金钱或资源上做出稳妥选择。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful and sensible; good at making decisions that avoid unnecessary risk.","zh":"谨慎的；精明稳妥的；善于做出避免不必要风险的决定。"},"examples":[{"en":"It’s prudent to save some money for emergencies.","zh":"为紧急情况存点钱是明智的。"},{"en":"She made the prudent choice to double-check the contract before signing.","zh":"她做了个谨慎的决定：签字前再次核对合同。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing wise self-control, especially with money or resources.","zh":"（尤指在金钱或资源方面）节制而明智的；会精打细算的。"},"examples":[{"en":"A prudent shopper compares prices before buying.","zh":"精明的消费者会在购买前比较价格。"}]}],"synonyms":["wise","careful","sensible","judicious","cautious"],"phonetic":"/ˈpruːdənt/","extraExplanation":["“prudent”语气通常比“careful”更强调“有判断力、深思熟虑”。它常用于建议或正式语境（如理财、政策、安全）：It would be prudent to…（……是明智的）。","常见搭配：prudent decision/choice（谨慎的决定）、prudent measures/steps（稳妥的措施）、prudent investment（审慎投资）。"]}
{"word":"prudentem","summary":{"en":"Prudent means careful, sensible, and forward-looking in decisions, especially about risk, money, or safety. “Prudentem” is the Latin inflected form of prudens.","zh":"Prudent 指“谨慎、明智、考虑长远”的决策方式，常用于风险、金钱或安全语境。“Prudentem”则是拉丁语 prudens 的变格形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful and sensible; making decisions that avoid unnecessary risk and consider the future.","zh":"谨慎而明智的；做决定时会避免不必要的风险并考虑长远。"},"examples":[{"en":"It’s prudent to save some money for emergencies.","zh":"为紧急情况存点钱是谨慎的做法。"},{"en":"She made the prudent choice to wait for more information.","zh":"她做了谨慎的选择，先等更多信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing good judgment in practical matters, especially about money or safety.","zh":"在实际事务（尤指金钱或安全）上表现出良好判断力的。"},"examples":[{"en":"A prudent driver slows down in heavy rain.","zh":"谨慎的司机在大雨中会减速。"},{"en":"They were prudent with their spending during the trip.","zh":"旅行期间他们在花钱上很谨慎。"}]}],"synonyms":["careful","sensible","wise","judicious","cautious"],"phonetic":"/ˈpruːdənt/","extraExplanation":["“prudentem”不是英语单词，而是拉丁语形态：来自形容词 prudens（“谨慎的、明智的”）的宾格单数/阳性或阴性形式，常见于拉丁文本或格言中。","英语 prudent 源自拉丁语 prudens（与 providere“预见、预先看到”相关），所以它常带有“看得远、提前防范”的意味。","常见搭配：prudent decision（谨慎的决定）、prudent approach（稳妥的方法）、prudent investment（稳健的投资）。相近词：careful（小心的，偏“注意细节”）、wise（明智的，偏“经验/判断”）；反义倾向：reckless（鲁莽的）。"]}
{"word":"prudential","summary":{"en":"Prudential means careful and practical, especially about money and risk; it’s also a formal term in finance for safety-focused regulation.","zh":"Prudential 指（尤其在金钱与风险方面）谨慎稳妥的；也可指金融领域中以安全与稳健为目标的“审慎监管/审慎标准”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to careful, practical judgment—especially about managing risk, money, or planning for the future.","zh":"（尤指在风险、金钱或未来规划方面）谨慎的；审慎的；讲求稳妥的。"},"examples":[{"en":"It’s prudential to save some money for emergencies.","zh":"为紧急情况存一笔钱是审慎的做法。"},{"en":"The company made a prudential decision to reduce debt before expanding.","zh":"公司在扩张前先降低负债，这是一个稳妥的决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Finance/insurance) Following rules meant to protect customers and keep institutions financially safe and stable.","zh":"（金融/保险）审慎监管的；遵循保护客户与保持机构稳健的规定的。"},"examples":[{"en":"Banks must meet prudential requirements such as holding enough capital.","zh":"银行必须满足审慎要求，例如持有足够的资本。"},{"en":"Prudential supervision aims to prevent a financial crisis.","zh":"审慎监管旨在防止金融危机。"}]}],"synonyms":["prudent","cautious","wise","sensible","risk-averse"],"phonetic":"/pruˈdɛnʃəl/","extraExplanation":["“prudential”来自拉丁语 prudens / prudentia（谨慎、明智）。在日常英语里，它常与 money、risk、decision、measure 等词搭配：prudential savings（稳健储蓄）、prudential measures（审慎措施）。","注意区分：prudent 更常用、语气更口语；prudential 更正式，常见于法律、公共政策、金融监管语境（如 prudential regulation / prudential standards）。"]}
{"word":"prudentialism","summary":{"en":"Prudentialism is the view that prudence and one’s long-term self-interest are central guides for rational or ethical action.","zh":"审慎主义认为，审慎判断与个人的长期利益/福祉是理性或伦理行动的核心指导原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way of thinking in ethics and politics that treats prudence (careful judgment about one’s own long-term interests) as the main guide for action.","zh":"一种伦理与政治思想取向，把“审慎/谨慎”（对自身长期利益的理性考量）视为行动的主要指导原则。"},"examples":[{"en":"From a prudentialism perspective, saving for emergencies is a moral priority because it protects your future well-being.","zh":"从审慎主义的角度看，存应急储蓄是一种道德上的优先事项，因为它能保护你未来的福祉。"},{"en":"Her argument leaned toward prudentialism: choose the policy that reduces risk and prevents predictable harm.","zh":"她的论证偏向审慎主义：选择能降低风险、避免可预见伤害的政策。"}]},{"partOfSpeech":"n.","definition":{"en":"In moral philosophy, the view that what is “rational” or “good” for a person is grounded mainly in that person’s self-interest or well-being (not necessarily in duty to others).","zh":"在道德哲学中，一种观点认为对个人而言“理性/善”的基础主要在于个人的自身利益或福祉（不一定建立在对他人的义务之上）。"},"examples":[{"en":"Critics say prudentialism explains personal choices well but struggles to justify helping strangers when it brings no benefit.","zh":"批评者认为审慎主义能很好解释个人选择，但当帮助陌生人毫无回报时，它很难给出充分理由。"},{"en":"He separated prudentialism from altruism: one focuses on your own good, the other on others’ good.","zh":"他把审慎主义与利他主义区分开：前者关注自己的利益，后者关注他人的利益。"}]}],"synonyms":["prudence-centered ethics","self-interest theory","welfare-based reasoning","practical rationalism"],"phonetic":"/pruˈdɛnʃəˌlɪzəm/","extraExplanation":["“prudentialism”来自“prudential”（审慎的）+ “-ism”（主义/学说）。它通常出现在伦理学讨论中，和“self-interest（自身利益）”“well-being（福祉）”“practical wisdom（实践智慧）”等概念相关，但不等同于“egoism（利己主义）”：审慎主义更强调长期、理性的自我关照，而不必然鼓励伤害他人。","在英语学术语境里，prudentialism常被用来对比“moralism/ethical altruism（道德利他主义）”或“deontology（义务论）”，用于讨论：一个行动是否“对我更有利/更安全”，与它是否“对他人更正当/更善良”之间的差别。"]}
{"word":"prudentialist","summary":{"en":"A prudentialist is someone who favors cautious, practical judgment and decisions based on likely consequences.","zh":"prudentialist 指强调审慎、务实判断、并根据可能后果来做决策的人（或这种立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or follows prudentialism; someone who emphasizes practical judgment, cautious decision-making, and long-term consequences (often in politics, ethics, or policy)","zh":"谨慎主义者；奉行“审慎原则/务实审慎”立场的人，强调现实判断、谨慎决策与长期后果（常见于政治、伦理或公共政策语境）"},"examples":[{"en":"As a prudentialist, she preferred small reforms over risky, sweeping changes.","zh":"作为谨慎主义者，她更偏好小步改革，而不是风险很高的激进变革。"},{"en":"The prudentialist argument focused on what would work in practice, not on perfect ideals.","zh":"谨慎主义的论证强调“实际可行”，而不是追求完美理想。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more rarely) relating to or characterized by prudentialism; guided by cautious, practical judgment","zh":"（较少见）谨慎主义的；以审慎、务实判断为特征的"},"examples":[{"en":"His prudentialist approach weighed costs and benefits before taking action.","zh":"他采取谨慎主义的做法：行动前先权衡成本与收益。"}]}],"synonyms":["pragmatist","realist","cautious decision-maker","moderate","incrementalist"],"phonetic":"/pruˈdɛnʃəlɪst/","extraExplanation":["“prudentialist”来自 prudential（审慎的、基于谨慎判断的）+ -ist（……主义者/从业者）。它通常用于较正式的学术或政治评论中，强调以风险控制与可行性为中心的立场。","它不等同于“胆小/怕事”。更接近“谨慎、务实、重视后果”，有时也可能被批评为“过于保守、缺乏理想主义”。"]}
{"word":"prudentiality","summary":{"en":"Prudentiality means the quality of being prudent—careful, practical judgment, especially about long-term well-being.","zh":"Prudentiality 指“审慎性”：谨慎且务实的判断力，常强调对长期利益与福祉的考虑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being prudent; careful, practical judgment in making decisions (similar to prudence)","zh":"审慎性；谨慎的品质；做决定时基于现实与风险的务实判断（类似 prudence）"},"examples":[{"en":"The company’s prudentiality helped it avoid risky investments.","zh":"公司的审慎性帮助它避开了高风险投资。"},{"en":"In uncertain times, prudentiality matters more than speed.","zh":"在充满不确定性的时期，审慎性比速度更重要。"},{"en":"Her prudentiality showed in the way she saved money and planned ahead.","zh":"她在存钱和提前规划的方式上体现出审慎性。"}]},{"partOfSpeech":"n.","definition":{"en":"in philosophy or ethics, practical wisdom about what actions best protect one’s long-term well-being (often used in discussions of “prudential reasons”)","zh":"（哲学/伦理学）与个人长期福祉相关的实践智慧；关于哪些行动最有利于自身长远利益的判断（常见于“prudential reasons/审慎理由”的讨论）"},"examples":[{"en":"The essay contrasts moral duty with prudentiality—what is good for you in the long run.","zh":"这篇文章对比了道德义务与审慎性——也就是从长远看对你有利的选择。"},{"en":"Some choices are guided by prudentiality rather than morality.","zh":"有些选择是由审慎性而非道德性所引导的。"}]}],"synonyms":["prudence","carefulness","caution","good judgment","practical wisdom"],"phonetic":"/pruːˌdɛnʃiˈælɪti/","extraExplanation":["“prudentiality”在现代日常英语中比较少见，更常用的是“prudence（审慎）”或“prudence in decision-making（决策中的审慎）”。在学术语境里，它有时用来强调“以自身长远利益/福祉为导向的理性考虑（prudential reasons）”，与“道德理由（moral reasons）”形成对照。","词根来自拉丁语“prudentia（审慎、远见）”。在一些伦理学与政治哲学写作中，会出现“prudential considerations（审慎考量）”“prudential reasoning（审慎推理）”等更常见搭配。"]}
{"word":"prudentially","summary":{"en":"“Prudentially” means “in a prudent, risk-aware, future-minded way.”","zh":"“prudentially”意为“以审慎、考虑风险与长远利益的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a careful, sensible way that tries to avoid unnecessary risk and protect future interests.","zh":"以谨慎、明智的方式（做事），尽量避免不必要的风险并保护长远利益。"},"examples":[{"en":"Prudentially, she saved part of every paycheck for emergencies.","zh":"出于谨慎，她每次领工资都会存一部分以备不时之需。"},{"en":"The company acted prudentially by keeping some cash in reserve.","zh":"公司谨慎行事，保留了一部分现金作为储备。"},{"en":"It may be prudentially wise to read the contract again before signing.","zh":"签字前再读一遍合同，从谨慎角度看可能更明智。"}]}],"synonyms":["prudently","wisely","cautiously","sensibly"],"phonetic":"/pruˈdɛnʃəli/","extraExplanation":["“prudentially”来自形容词“prudential”（谨慎的、审慎的），常见于较正式的语境，如商业、金融、法律或公共政策讨论中。","与“carefully”相比，“prudentially”更强调“为了长远利益/风险管理而谨慎”，不仅是小心不出错，也包含理性衡量后果的意味。"]}
{"word":"prudentialness","summary":{"en":"Prudentialness means the quality of being prudent and risk-aware, often in practical or financial decision-making.","zh":"Prudentialness 指“审慎、稳健、风险意识强”的特质，常用于实际决策或金融管理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being prudent and careful, especially about practical matters and long-term consequences","zh":"谨慎、审慎的特质；（尤指）在实际事务与长期后果上小心考虑的品质"},"examples":[{"en":"Her prudentialness showed in the way she saved money for emergencies.","zh":"她把钱存起来以备不时之需，这体现了她的审慎。"},{"en":"A bit of prudentialness can prevent avoidable mistakes at work.","zh":"多一点谨慎可以避免工作中许多本可避免的错误。"}]},{"partOfSpeech":"n.","definition":{"en":"careful, risk-aware management (often used in finance, law, or policy contexts)","zh":"（常用于金融、法律或政策语境）审慎的风险管理；稳健管理"},"examples":[{"en":"The regulators emphasized prudentialness in banking practices.","zh":"监管机构强调银行业务要保持审慎稳健。"},{"en":"The company’s prudentialness helped it survive an economic downturn.","zh":"公司的稳健审慎帮助它挺过了经济下行。"}]},{"partOfSpeech":"n.","definition":{"en":"in ethics or philosophy, concern for one’s own well-being and interests (as opposed to moral duty to others)","zh":"（伦理/哲学）对自身福祉与利益的关切（相对于对他人的道德义务）"},"examples":[{"en":"The debate contrasted prudentialness with moral responsibility.","zh":"这场讨论把自利考量与道德责任作了对比。"}]}],"synonyms":["prudence","carefulness","caution","circumspection","sound judgment","risk awareness"],"phonetic":"/pruˈdɛnʃəl.nəs/","extraExplanation":["“prudentialness”由形容词 prudential（审慎的）+ 名词后缀 -ness 构成，语法上正确，但在日常英语中相对少见。更常用的表达是 prudence（谨慎）或 prudent behavior（谨慎的行为）。","在金融领域，“prudential”常见于固定搭配，如 prudential regulation（审慎监管）、prudential standards（审慎标准），用来强调控制风险、保持稳健。","与 “Prudential” 作为专有名词（如美国保险公司 The Prudential）不同，这里的 prudentialness 是普通名词，表示一种“审慎/稳健”的性质。"]}
{"word":"prudently","summary":{"en":"“Prudently” means doing something in a careful, sensible way to avoid unnecessary risk.","zh":"“prudently”表示做事谨慎而明智，会评估风险并避免不必要的冒险。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a careful and sensible way, showing good judgment about risks and consequences.","zh":"谨慎而明智地；审慎地（会考虑风险与后果）。"},"examples":[{"en":"She invested her savings prudently in low-risk funds.","zh":"她把积蓄谨慎地投资在低风险基金里。"},{"en":"Drive prudently in the rain; the roads can be slippery.","zh":"雨天要谨慎驾驶；路面可能很滑。"},{"en":"They prudently saved some money for emergencies.","zh":"他们明智地存了一些钱以备不时之需。"}]}],"synonyms":["carefully","wisely","sensibly","cautiously","judiciously"],"phonetic":"/ˈpruːdəntli/","extraExplanation":["“prudently”来自形容词“prudent”（谨慎的、审慎的）。在英语里，它常用来描述做决定、花钱、投资、说话、开车等情境中的“理性克制、避免不必要风险”。","语气上，“prudently”通常带肯定评价，强调“做得对、判断好”。但在某些语境里也可能暗示“过于保守”，这时常搭配对比词，如 “boldly / aggressively（大胆地/激进地）”。","近义词细微差别：\n- carefully：强调小心、避免出错（动作层面）。\n- wisely：强调智慧、选择正确（判断层面）。\n- cautiously：强调谨慎甚至有点担心（风险层面）。\n“prudently”更像“既小心又有判断力”。"]}
{"word":"pruderies","summary":{"en":"“Pruderies” means overly strict or affected ideas about sexual modesty and decency (plural).","zh":"“pruderies”指对性与“端庄/体面”过度（或矫饰地）看重的观念与态度（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or affected concern with sexual “decency” and modesty; being easily shocked by sexual topics (plural of prudery).","zh":"对性话题过度（或矫饰地）强调“体面/贞洁/端庄”；对性相关内容特别容易大惊小怪（prudery 的复数）。"},"examples":[{"en":"Victorian novels are sometimes criticized for their pruderies about love and sex.","zh":"维多利亚时代的小说有时会因对爱情与性话题的过度避讳而受到批评。"},{"en":"Her pruderies made it hard to talk openly about health and relationships.","zh":"她那种过分讲究“端庄”的态度让人很难坦诚谈健康与亲密关系。"},{"en":"The article challenges the pruderies that keep sex education out of schools.","zh":"这篇文章质疑那些让性教育难以进入学校的保守避讳观念。"}]}],"synonyms":["prudery","puritanism","prudishness","sexual conservatism"],"phonetic":"/ˈpruːdəriːz/","extraExplanation":["“prudery/pruderies”通常带批评意味，暗示一种“装出来的正经”或“过度敏感”的道德姿态，而不只是一般的害羞或保守。","常见搭配：Victorian prudery（维多利亚式的性保守/避讳）、social prudery（社会层面的矫饰保守）。如果只是中性表达“保守”，可用“conservatism”或“reserve”。"]}
{"word":"prudery","summary":{"en":"Prudery is an overly strict or easily offended attitude about sexual topics and morality.","zh":"Prudery 指对性话题和道德过分拘谨、过度敏感（常带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive concern with sexual modesty or propriety; the attitude of being easily shocked by sexual topics.","zh":"过分讲究（性方面的）端庄或得体；对性话题过于敏感、容易受惊的态度。"},"examples":[{"en":"Her prudery made it hard to discuss sex education at home.","zh":"她的拘谨（对性话题的过度敏感）让在家里讨论性教育变得很困难。"},{"en":"The novel was criticized for being “immoral,” but some reviewers said that reaction was just prudery.","zh":"这本小说被批评“不道德”，但一些评论者说这种反应只是过分的道德/性方面的拘谨。"}]}],"synonyms":["puritanism","prudishness","moralism"],"phonetic":"/ˈpruːdəri/","extraExplanation":["“prudery”常带贬义，暗示这种“端庄/保守”是过头的、过分敏感甚至带有虚伪色彩。中性表达可用“modesty（端庄）”“reserve（矜持）”。","词源上与“prude（过分拘谨的人）”有关；在文学与评论语境里，常用来批评社会风气或审查标准过于保守。"]}
{"word":"prudes","summary":{"en":"“Prudes” is the plural of “prude,” meaning people who are overly strict or easily offended about sex or ‘improper’ behavior, often in a judgmental way.","zh":"“prudes”是“prude”的复数，指对性或所谓“不雅/不得体”行为过分保守、易反感且常带评判的“假正经/拘谨的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are easily shocked by sex, nudity, or “improper” behavior, and who often show this by being very strict or judgmental about morals.","zh":"（复数）假正经的人；过分拘谨、对性或“不得体”行为很容易反感并常带评判的人。"},"examples":[{"en":"Some people call her a prude because she won’t watch movies with sex scenes.","zh":"有些人说她很假正经，因为她不看有性爱镜头的电影。"},{"en":"They laughed and said the new dress was fine—only prudes would complain.","zh":"他们笑着说新裙子没问题——只有假正经的人才会抱怨。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who behaves in an overly modest way, especially to appear morally superior.","zh":"（可数）故作端庄的人；尤其指为了显得道德更高而表现得过分保守的人。"},"examples":[{"en":"He acted like a prude in public, but joked about the same topics in private.","zh":"他在公众场合装得很端庄，但私下却拿同样的话题开玩笑。"},{"en":"Don’t be a prude—it's just a normal conversation about health.","zh":"别这么假正经——这只是关于健康的正常讨论。"}]}],"synonyms":["puritans","moralists","uptight people","prudish people"],"phonetic":"/pruːdz/","extraExplanation":["“prude”通常带贬义，表示说话者不认同这种过分保守或带评判的态度；使用时要注意语境与礼貌。","词形：单数 prude，复数 prudes。常见搭配：be called a prude（被说很假正经）、prude/ prudish attitudes（保守/假正经的态度）。","相近但语气不同：conservative（保守，中性偏中性）、modest（端庄/谦逊，多为褒义或中性）；更口语、更直接的贬义表达还可能用 uptight（太紧绷、放不开）。"]}
{"word":"prudhomme","summary":{"en":"Prudhomme is mainly a French surname; historically it can also mean an upright, wise man.","zh":"Prudhomme 主要是法语姓氏；在历史语境中也可指正直贤明的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, rare in modern English) An upright, wise, and honorable man; a “man of good judgment.”","zh":"（历史用法；现代英语中少见）正直而睿智、受人敬重的人；“有德行、有判断力的人”。"},"examples":[{"en":"In medieval texts, a prudhomme is praised for fairness and good sense.","zh":"在中世纪文本里，prudhomme 常被称赞为公正且有见识。"},{"en":"The story describes him as a prudhomme who settles disputes calmly.","zh":"故事把他描写成一位沉着化解争端的 prudhomme。"}]},{"partOfSpeech":"n.","definition":{"en":"A French surname (family name).","zh":"法语姓氏（家族姓）。"},"examples":[{"en":"Chef Paul Prudhomme helped popularize Cajun cooking in the United States.","zh":"厨师保罗·普鲁多姆（Paul Prudhomme）推动了美国对卡津料理的了解与流行。"},{"en":"Prudhomme is her last name, not a job title.","zh":"Prudhomme 是她的姓，不是职业称谓。"}]}],"synonyms":["upright man","wise man","honorable man"],"phonetic":"/ˈpruːdoʊm/","extraExplanation":["Prudhomme 源自古法语 prud’homme（字面义接近“谨慎/贤明之人”）。在英语里它更多以姓氏出现；作为普通名词的用法偏文学或历史语境。","发音方面：如果指法国人名，法语读音更接近“普吕东姆”；在英语语境里常被英语化读作 /ˈpruːdoʊm/。"]}
{"word":"prudish","summary":{"en":"Prudish means overly easily offended by sexual topics or nudity; too “proper” in a judgmental way.","zh":"prudish 指对性话题或裸露等过度敏感、容易反感，带有“过分端庄、拘谨保守”的贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easily shocked or offended by sexual topics, nudity, or behavior; overly concerned with being “proper.”","zh":"对性话题、裸露或相关行为很容易反感或受冒犯的；过分讲究“端庄/得体”的。"},"examples":[{"en":"She’s a bit prudish, so try not to make sexual jokes around her.","zh":"她有点拘谨保守，所以尽量别在她面前开黄色玩笑。"},{"en":"The movie was mild, but some viewers still found it prudish to complain.","zh":"这部电影其实很温和，但还是有人以过分保守的态度抱怨。"}]}],"synonyms":["puritanical","prim","strait-laced"],"phonetic":"/ˈpruːdɪʃ/","extraExplanation":["“prudish”通常带有批评或调侃意味，暗示一个人反应过度、过分道德化；比“modest（端庄/谦逊）”更负面。","常见搭配：prudish attitude（保守拘谨的态度）、prudish about sex（对性很保守/很敏感）。","词源上与“prudence（谨慎）”有关，但现代用法更集中在“对性内容过度敏感/保守”这一点。"]}
{"word":"prudishly","summary":{"en":"“Prudishly” means behaving in an overly proper or sexually uptight way.","zh":"“Prudishly”指以过分讲究端庄、对性或“不雅”话题过度拘谨保守的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is overly concerned with proper or “modest” behavior, especially about sex, nudity, or topics seen as indecent.","zh":"以过分讲究端庄/“贞洁”的方式；尤指在性、裸露或被认为不雅的话题上过度保守、爱挑剔。"},"examples":[{"en":"She prudishly covered the painting because it showed a nude figure.","zh":"她过分保守地把那幅画盖起来，因为画里有裸体人物。"},{"en":"He spoke prudishly about dating, as if it were something shameful.","zh":"他谈到约会时显得过分拘谨保守，好像那是件可耻的事。"},{"en":"Some people prudishly avoid even saying the word “sex.”","zh":"有些人过分保守，连“性”这个词都避免说出口。"}]}],"synonyms":["primly","puritanically","strait-lacedly","modestly (sometimes, but usually weaker)"],"phonetic":"/ˈpruːdɪʃli/","extraExplanation":["“prudishly”来自形容词“prudish”（过分拘谨/道德洁癖式的保守），常带批评意味：说话者通常认为这种“端庄”是过度的、不自然的，甚至有点虚伪。","使用时注意语气：它不是中性的“保守”，而更接近“假正经/过度挑剔”。如果你只是想表达“比较保守”，可以用“conservatively”或“modestly”更客观。"]}
{"word":"prudishness","summary":{"en":"Prudishness means being overly strict or easily offended about sexual matters, often in a judgmental or narrow-minded way.","zh":"prudishness 指对性相关话题/行为过分保守、容易反感或震惊，常带有爱道德评判、狭隘的贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive concern about sexual morality or propriety; being easily shocked by sexual topics or behavior.","zh":"过分拘谨/保守的性观念；对性话题或行为特别容易感到震惊或不适。"},"examples":[{"en":"Her prudishness made it hard to discuss sex education at home.","zh":"她的拘谨保守让在家里讨论性教育变得很困难。"},{"en":"The movie isn’t very explicit, but his prudishness made him uncomfortable.","zh":"这部电影并不算露骨，但他的过度保守还是让他觉得不自在。"}]},{"partOfSpeech":"n.","definition":{"en":"A strongly moralistic attitude about what is “proper,” often used critically to suggest narrow-mindedness or judgment.","zh":"对“得体/正当”有很强的道德化要求（常带批评意味，暗示狭隘或爱评判）。"},"examples":[{"en":"Some critics say the school’s dress code reflects prudishness rather than safety concerns.","zh":"一些批评者认为学校的着装规定体现的是道德洁癖式的保守，而不是出于安全考虑。"},{"en":"He dismissed her complaint as prudishness, but she saw it as basic respect.","zh":"他把她的投诉当作保守拘谨，但她认为那是基本的尊重。"}]}],"synonyms":["prudery","primness","puritanism","stiffness","moralism"],"phonetic":"/ˈpruːdɪʃnəs/","extraExplanation":["“prudishness”来自形容词“prudish”（假正经的、过分拘谨的）+ 名词后缀“-ness”。语气通常带贬义：不仅指“保守”，还常暗含“过度敏感、爱道德评判”。","使用时注意文化差异：不同社会对“得体/冒犯”的界限不同。有时别人说你“prudish”可能是不礼貌的标签；更中性的说法可以用“conservative about sexual topics（对性话题比较保守）”。"]}
{"word":"prudist","summary":{"en":"“Prudist” (rare) means a prude or something prudish—overly concerned with modesty, especially about sex.","zh":"“prudist”（罕用）指假正经的人，或形容过分拘谨、尤其在性话题上很保守的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is overly concerned with modesty or “proper” behavior, especially about sex; a prude (rare word).","zh":"（罕用）过分讲究端庄或“规矩”的人，尤其在性话题上很保守的人；假正经的人。"},"examples":[{"en":"He’s a prudist who thinks even mild jokes are inappropriate.","zh":"他很“prudist”，觉得连温和的玩笑都不合适。"},{"en":"The novel shocked some prudists, but many readers found it honest and humane.","zh":"这部小说让一些过分保守的人很震惊，但许多读者觉得它真诚而有人情味。"}]},{"partOfSpeech":"adj.","definition":{"en":"overly modest or easily offended by sexual topics; prudish (rare).","zh":"（罕用）过分拘谨、对性话题特别敏感或易反感的；假正经的。"},"examples":[{"en":"Her prudist attitude made open discussions about health difficult.","zh":"她过分保守的态度让关于健康的公开讨论变得很困难。"},{"en":"The teacher kept the tone respectful without being prudist.","zh":"老师保持了尊重的语气，但并不假正经。"}]}],"synonyms":["prude","prudish","moralist","straight-laced"],"phonetic":"/ˈpruːdɪst/","extraExplanation":["“prudist”在现代英语里很少见；更常用的是名词“prude”（假正经的人）和形容词“prudish”（过分保守的）。","语气上通常带批评或讽刺，暗示对方不是单纯“有礼貌”，而是对自然的人体/性/情感表达过度紧张或苛刻。","相关词：prudery（过分拘谨/假正经）、moralistic（说教式道德化）、straight-laced（古板守规矩的）。"]}
{"word":"prudity","summary":{"en":"Prudity means excessive prudishness—being overly concerned with “proper” behavior, especially about sex or the body.","zh":"Prudity 指“假正经/过度拘谨保守”，尤其在性、身体或行为规范方面过分讲究体面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive concern with being “proper,” especially about sex, the body, or behavior; prudishness","zh":"（尤指在性、身体或行为方面）过度讲究“体面/正经”；假正经；拘谨保守"},"examples":[{"en":"Her prudity made it hard to talk openly about health or sex education.","zh":"她的假正经让人很难坦诚谈论健康或性教育。"},{"en":"Some critics say the film challenges social prudity by showing everyday realities.","zh":"一些评论家认为这部电影通过呈现日常现实来挑战社会的保守拘谨。"}]},{"partOfSpeech":"n.","definition":{"en":"a prude-like attitude or behavior; acting overly modest or easily shocked","zh":"过分矜持或动辄受惊的态度/行为；装作很纯洁"},"examples":[{"en":"He laughed off the accusations of prudity and said he was just being respectful.","zh":"他对“装纯”的指责一笑置之，说自己只是出于尊重。"},{"en":"The joke landed badly, and a few people reacted with prudity.","zh":"这个玩笑效果很差，有几个人表现得很受冒犯、很拘谨。"}]}],"synonyms":["prudery","prudishness","puritanism (often stronger)","modesty (not always negative)"],"phonetic":"/ˈpruːdəti/","extraExplanation":["“prudity”较少见，更常见的名词是“prudery”。形容词是“prudish”（拘谨保守的、假正经的），表示对与性/身体相关话题特别敏感或苛刻。","在语气上，“prudish / prudery / prudity”常带批评意味：说话者觉得对方不是单纯有礼貌，而是过度保守或道德审判。"]}
{"word":"prudy","summary":{"en":"“Prudy” is an informal word for a prudish person, and it can also be a female name/nickname (often from “Prudence”).","zh":"“Prudy”可指（非正式）过分拘谨/道貌岸然的人；也可作女性名字/昵称（常来自“Prudence”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A prudish person; someone who is easily shocked by sex, nudity, or “improper” language and is overly concerned with being proper.","zh":"（非正式）过分拘谨/道貌岸然的人；对性、裸露或“不得体”的语言特别敏感、容易大惊小怪，并过度强调礼节与端庄的人。"},"examples":[{"en":"Don’t be such a prudy—this scene is pretty mild.","zh":"别这么拘谨/别这么大惊小怪——这段镜头其实很温和。"},{"en":"He acted prudy about a harmless joke.","zh":"他对一个无伤大雅的玩笑表现得很道貌岸然。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name or nickname (often short for “Prudence”).","zh":"女性名字或昵称（常为 Prudence 的昵称）。"},"examples":[{"en":"Prudy said she’d call after work.","zh":"Prudy 说她下班后会打电话。"}]}],"synonyms":["prudie","prudish person","prude"],"phonetic":"/ˈpruːdi/","extraExplanation":["“prudy”多见于口语，常被当作“prudie”的变体拼写；更常见的词是 prudish（形容词：拘谨的、过分讲究体面的）和 prudishness（名词）。","作为人名时，Prudy 通常来自 Prudence（意为“谨慎/节制”），在英语文化里带有较传统、端庄的气质。使用时注意语境：指人“prudy”可能带一点取笑或批评的语气。"]}
{"word":"prue","summary":{"en":"Prue is mainly used as a female name, often short for Prudence.","zh":"Prue 主要用作女性名字，常是 Prudence 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a nickname for Prudence","zh":"女性名字，常作为 Prudence（普鲁登斯/谨慎） 的昵称"},"examples":[{"en":"Prue is short for Prudence in some English-speaking families.","zh":"在一些英语家庭里，Prue 是 Prudence 的简称。"},{"en":"Prue said she would call after work.","zh":"Prue 说她下班后会打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a surname","zh":"（少见）姓氏"},"examples":[{"en":"Dr. Prue published a new study this year.","zh":"Prue 医生今年发表了一项新研究。"}]}],"synonyms":["Prudence","Prudy"],"phonetic":"/pru/","extraExplanation":["“Prue”通常发音为 /pru/（类似中文“普鲁”的音感）。","它在流行文化中也较常见，例如英国儿童文学作家 Enid Blyton 的《The Faraway Tree》系列里有角色叫 Dame Slap（Prue Slap），以及电视剧《Charmed》中有角色 Prue Halliwell。","如果你其实想查的是拼写相近的词：prune（修剪/李子干）、prove（证明）、prey（猎物/捕食）。告诉我你想要哪一个，我可以分别解释。"]}
{"word":"pruh","summary":{"en":"“pruh” is a slang variant of “bruh,” used as an exclamation (disbelief/annoyance) or a casual address like “bro.”","zh":"“pruh”是“bruh”的俚语变体，可作感叹（不敢信/无语）或随意称呼（像“哥们”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(slang) An exclamation like “bruh,” used to show disbelief, annoyance, or “Are you serious?”","zh":"（俚语）类似于“bruh（bro 的口语）”的感叹，用来表达难以置信、不耐烦或“你认真的吗？”"},"examples":[{"en":"Pruh… you really forgot your own password again?","zh":"Pruh……你又把自己的密码忘了？"},{"en":"He said he can finish it in five minutes—pruh.","zh":"他说五分钟就能搞定——pruh（不太信）。"}]},{"partOfSpeech":"other","definition":{"en":"(slang) A casual way to address someone, like “bro/dude,” often playful.","zh":"（俚语）像“bro / dude（哥们）”一样称呼别人，语气随意，有时带点调侃。"},"examples":[{"en":"Pruh, can you help me move this table?","zh":"Pruh（哥们），你能帮我搬一下这张桌子吗？"},{"en":"What’s up, pruh?","zh":"最近咋样，pruh？"}]}],"synonyms":["bruh","bro","dude","man (slang)","seriously? (tone)"],"phonetic":"/brʌ/","extraExplanation":["“pruh”多见于网络聊天/口语玩梗写法，是“bruh”的变体拼写，用来模仿语气（更随意、也更夸张）。","“bruh”与“bro”有关，常见于美国口语与网络文化；有时也和 AAVE（非裔美国英语）语境有重叠。日常使用时注意场合：在正式写作、职场邮件中不建议使用。"]}
{"word":"pruigo","summary":{"en":"Prurigo is a medical term for itchy skin eruptions that form small bumps or nodules.","zh":"Prurigo 是医学用语，指以剧烈瘙痒并出现小丘疹或结节为特征的皮肤疹/皮肤病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A group of itchy skin conditions that cause small, raised bumps (papules) or nodules.","zh":"（医学）痒疹：一组以强烈瘙痒为主要特征、皮肤出现小丘疹或结节的皮肤病。"},"examples":[{"en":"The dermatologist said the rash might be prurigo and prescribed a topical steroid.","zh":"皮肤科医生说这种皮疹可能是痒疹，并开了外用类固醇药膏。"},{"en":"Scratching can make prurigo worse and lead to infection.","zh":"抓挠会让痒疹加重，还可能引发感染。"}]}],"synonyms":["itchy rash","pruritic eruption","prurigo nodularis (a specific type)"],"phonetic":"/prʊˈraɪɡoʊ/","extraExplanation":["你输入的“pruigo”更像是拼写错误；常见的医学词是 **prurigo**（痒疹）。如果你原本想查的是别的词（例如人名/品牌/缩写），告诉我上下文（在哪看到的、句子是什么），我可以再确认。","词源提示：**prurigo** 来自拉丁语 *prurire*（“发痒”）。在医学语境中也常见 **prurigo nodularis**（结节性痒疹）。"]}
{"word":"pruinate","summary":{"en":"Pruinate describes a surface that looks frost-dusted because it has a whitish powdery or waxy coating.","zh":"Pruinate 指表面带有像霜一样的白色粉霜/蜡质薄层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with a thin, whitish, powdery or waxy coating that looks like frost (often on fruits, leaves, or insect bodies).","zh":"表面覆盖一层薄薄的白色粉霜状或蜡质涂层，看起来像结霜（常见于果实、叶片或昆虫表面）。"},"examples":[{"en":"The grape skins looked pruinate, as if dusted with frost.","zh":"葡萄皮看起来有粉霜，好像撒了一层霜。"},{"en":"Some succulent leaves are naturally pruinate to reduce water loss.","zh":"一些多肉植物的叶片天生带粉霜，有助于减少水分流失。"},{"en":"The beetle’s pruinate shell gave it a pale, matte finish.","zh":"甲虫带粉霜的外壳让它呈现浅色的哑光质感。"}]}],"synonyms":["frosted","powdery","glaucous","bloomy"],"phonetic":"/ˈpruːəˌneɪt/","extraExplanation":["“pruinate”多用于植物学/动物学的描写，强调一种“像霜一样”的粉质或蜡质薄层（英文也常叫 bloom）。例如葡萄、李子表面的“果粉”就常被描述为 pruinate。","词源来自拉丁语 pruin(a)（霜）。在日常英语中不常用，更常见的替代表达是 “frosty-looking,” “powdery,” 或 “with a waxy bloom”。"]}
{"word":"pruinescence","summary":{"en":"Pruinescence is the natural waxy/powdery “bloom” that makes some surfaces look frosted, like on grapes or plums.","zh":"Pruinescence 指某些表面（如葡萄、李子）上天然的蜡质/粉霜状“果粉”，让它看起来像覆了一层薄霜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, waxy or powdery coating on the surface of some fruits, leaves, or insects, often giving a whitish or bluish “frosted” look.","zh":"（某些果实、叶片或昆虫表面上的）薄薄的蜡质/粉霜状覆盖层，常使表面呈现白色或蓝白色的“霜感”。"},"examples":[{"en":"Grapes often have a natural pruinescence that looks like a pale dusting.","zh":"葡萄表面常有天然的粉霜（pruinescence），看起来像薄薄的一层灰白粉。"},{"en":"The plum’s pruinescence helps give it that soft, matte finish.","zh":"李子表面的粉霜让它看起来有柔和的哑光质感。"}]}],"synonyms":["bloom","waxy coating","powdery coating"],"phonetic":"/ˌpruːɪˈnɛsəns/","extraExplanation":["这是一个相对学术、偏生物学/植物学的词，日常英语里更常用 bloom（果粉/果霜）或 waxy coating（蜡质层）来表达类似意思。","词根来自拉丁语 pruin-，与 hoarfrost（白霜）同源，因此常带有“像霜一样的粉白覆盖层”的联想。","常见搭配：pruinescence on grapes/plums（葡萄/李子上的果粉）；pruinose（adj. 有粉霜的，有霜状覆层的）。"]}
{"word":"pruinose","summary":{"en":"Pruinose means covered with a fine, frosty-looking powdery or waxy coating, often used in nature and scientific descriptions.","zh":"Pruinose 指表面覆盖一层细薄、像霜一样的粉状或蜡质覆层，常用于自然观察或科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with a fine, powdery, frosty-looking coating (like the bloom on grapes or plums).","zh":"覆盖着一层细薄的粉霜状物（像葡萄或李子表面的“果粉/白霜”）。"},"examples":[{"en":"The grapes looked pruinose, with a pale whitish bloom on the skin.","zh":"这些葡萄看起来带着粉霜，果皮上有一层淡淡的白霜。"},{"en":"In the morning light, the leaves appeared pruinose, as if dusted with frost.","zh":"在清晨的光线下，叶子看起来像覆了粉霜，仿佛撒了一层霜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having a waxy or powdery coating on a plant or animal surface.","zh":"（植/动）表面具有蜡质或粉状覆层的；具粉霜的。"},"examples":[{"en":"Some desert plants have pruinose stems that help reduce water loss.","zh":"一些沙漠植物的茎带粉霜状覆层，有助于减少水分流失。"},{"en":"The field guide noted a pruinose coating on the insect’s body.","zh":"野外指南提到这种昆虫身体表面有粉霜状覆层。"}]}],"synonyms":["powdery","frosty","bloomy","waxy-coated"],"phonetic":"/ˈpruːɪˌnoʊs/","extraExplanation":["“pruinose”多见于植物学、动物学和自然观察写作，属于比较书面、偏专业的形容词。日常英语里更常用的表达是“a powdery/waxy coating”或“a frosty bloom”。","词源提示：来自拉丁语 *pruina*（霜）。所以它常带有“像结霜一样的外观”这一视觉印象。"]}
{"word":"pruinous","summary":{"en":"Pruinous describes a surface that looks lightly frosted or powdery white, like the natural bloom on grapes or plums.","zh":"pruinous 用来形容表面有薄薄的白色粉霜/霜状物，像葡萄或李子上的天然“果粉”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with a thin, whitish, dusty “bloom” (like frost or powder), often seen on fruits, leaves, or stems.","zh":"（表面）覆有一层薄薄的白色粉霜/霜状物（像结霜或粉末），常见于果实、叶片或茎上。"},"examples":[{"en":"The pruinous coating on the grape helps protect it from drying out.","zh":"葡萄表面的粉霜有助于防止水分蒸发。"},{"en":"Some cactus stems look pruinous, as if dusted with flour.","zh":"有些仙人掌的茎看起来有粉霜状，好像撒了一层面粉。"},{"en":"The plum’s skin was naturally pruinous, giving it a pale, matte finish.","zh":"李子表皮天然带粉霜，使它呈现淡淡的哑光质感。"}]}],"synonyms":["frosted","powdery","bloomy","glaucous"],"phonetic":"/ˈpruːənəs/","extraExplanation":["“pruinous”常用于植物学/真菌学的描写，指表面那层可擦掉的白色粉霜（也叫 bloom）。它不一定是真正的“霜冻”，而可能是蜡质或微细粉末的覆盖层。","词源来自拉丁语 prūīna（霜、白霜），所以它常带有“像结霜一样”的视觉联想。"]}
{"word":"prulaurasin","summary":{"en":"Prulaurasin is a rare scientific term for a cyanogenic plant compound, mainly discussed in plant chemistry/toxicology.","zh":"Prulaurasin 是一个较少见的科学术语，指一种生氰的植物化合物，主要用于植物化学/毒理学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cyanogenic glycoside (a natural plant chemical) found in some Prunus species; when the plant tissue is damaged, it can help release compounds that may produce hydrogen cyanide.","zh":"一种生氰糖苷（植物中的天然化学物质），存在于某些李属（Prunus）植物中；当植物组织受损时，可能参与释放并生成氰化氢的相关化合物。"},"examples":[{"en":"Researchers measured prulaurasin levels in leaves to compare chemical defenses among Prunus plants.","zh":"研究人员测量叶片中的 prulaurasin 含量，用来比较不同李属植物的化学防御。"},{"en":"Because prulaurasin is cyanogenic, it is mainly discussed in plant chemistry and toxicology contexts.","zh":"由于 prulaurasin 属于生氰类物质，它主要出现在植物化学与毒理学的语境中。"}]}],"synonyms":["cyanogenic glycoside","plant glycoside"],"phonetic":"/ˌpruːˈlɔːrəˌsɪn/","extraExplanation":["这个词比较少见，更多出现在植物化学/天然产物/毒理学文献中，而不是日常英语。","“cyanogenic glycoside（生氰糖苷）”指某些植物用来防御取食者的一类物质；组织被咬碎或破坏时，相关酶反应可能释放出氰化物（例如氰化氢），因此需要注意安全与剂量问题。","如果你是在作业或论文里看到这个词，也可能存在拼写差异（不同资料的转写不完全一致）。你可以把原句或来源发我，我可以帮你确认是否是该词或更常见的近似拼写。"]}
{"word":"pruna","summary":{"en":"“Pruna” is rare in English; it usually appears as a borrowed word meaning “plum” or as a name.","zh":"“pruna”在英语中较少用，通常作为外来词表示“李子”，或作为名称出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare in English) a plum; used mostly as a foreign/borrowed word (e.g., Italian/Spanish contexts) or as a proper name.","zh":"（英语中较少见）李子；多作为外来词（如意大利语/西班牙语语境）或专有名词使用。"},"examples":[{"en":"The recipe calls for pruna, meaning a fresh plum in Italian.","zh":"这道食谱里写的 pruna，在意大利语里就是“新鲜李子”。"},{"en":"In some bilingual markets, you may see “pruna” on signs next to “plum.”","zh":"在一些双语市场里，你可能会看到标牌上把“pruna”和“plum（李子）”并排写。"}]}],"synonyms":["plum"],"phonetic":"/ˈpruːnə/","extraExplanation":["“pruna”在标准英语词典里通常不算常用词；英语里更常说 **plum**（李子）或 **prune**（西梅干/把树修剪）。如果你想查的是“prune”，拼写是 **prune**，意思常见为：n. 西梅干；v. 修剪（树枝/内容）。","“pruna”常见于罗曼语系（如意大利语、加泰罗尼亚语等）表示“李子”，和拉丁语 *prunum*（李子）有关。"]}
{"word":"prunability","summary":{"en":"Prunability means how easy it is to prune (trim/remove parts), commonly used for plants and sometimes for algorithms or decision processes.","zh":"Prunability 指“可修剪性”：修剪（剪除部分）有多容易，常用于植物，也可引申到算法或决策过程的“可剪枝性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being able to be pruned (cut back, trimmed, or removed), especially in gardening or tree care","zh":"（尤指园艺/树木养护中）可修剪性；能够被修枝、修整或剪除的程度"},"examples":[{"en":"The prunability of this shrub is high, so you can shape it easily each spring.","zh":"这种灌木的可修剪性很高，所以你每年春天都能很容易把它修整成形。"},{"en":"Good prunability helps keep fruit trees healthy and productive.","zh":"良好的可修剪性有助于让果树保持健康并提高产量。"}]},{"partOfSpeech":"n.","definition":{"en":"the ability to remove unnecessary parts from something (such as a decision process or a search tree in computing)","zh":"（引申义，常见于计算机领域）可剪枝性；从过程/结构中删除不必要部分的能力"},"examples":[{"en":"The algorithm’s prunability improves when we add stronger rules to eliminate impossible options early.","zh":"当我们加入更强的规则以便更早排除不可能选项时，这个算法的可剪枝性就会提升。"},{"en":"In practice, higher prunability often means faster search.","zh":"在实际应用中，更高的可剪枝性通常意味着更快的搜索速度。"}]}],"synonyms":["pruning ability","ease of pruning","pruning potential","trim-ability"],"phonetic":"/ˌpruːnəˈbɪləti/","extraExplanation":["“prunability”由形容词“prunable”（可修剪的）+ 名词后缀“-ity”构成，表示“……的性质/程度”。","这是一个相对少见的词，更常见、更自然的表达包括：园艺里说“easy to prune / needs little pruning（容易修剪/不太需要修剪）”，计算机里说“pruning potential（剪枝潜力）”。"]}
{"word":"prunable","summary":{"en":"Prunable means “able to be pruned”—cut back or removed (plants, or unnecessary parts like code).","zh":"Prunable 意为“可修剪/可删减的”，用于植物或可移除的冗余部分（如代码）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be cut off, trimmed, or removed, especially parts of a plant (like branches) or unnecessary parts of something (like code or options).","zh":"可修剪的；可剪除的（尤指植物枝条）；也指可删除冗余部分的（如代码、选项）。"},"examples":[{"en":"These shrubs are prunable in early spring.","zh":"这些灌木可以在早春修剪。"},{"en":"The software detects prunable functions to make the program smaller.","zh":"该软件会检测可剪除（可删减）的函数，让程序更小。"}]}],"synonyms":["trimable","cuttable","removable","reducible"],"phonetic":"/ˈpruːnəbəl/","extraExplanation":["“prunable”来自动词“prune”（修剪、删减）+ 形容词后缀“-able”（能够……的），常见于园艺语境，也常用于计算机领域，表示“可以安全移除而不影响主要功能”的部分。"]}
{"word":"prunableness","summary":{"en":"Prunableness means the quality of being prunable—able or suitable to be cut back (often plants; sometimes writing/code).","zh":"Prunableness 指“可修剪性”，即能够或适合被修剪（多用于植物，也可引申指文字/代码可删减）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being prunable (able or suitable to be cut back by pruning, especially for plants/trees or code/text in editing).","zh":"可修剪性；可被修剪（或适合修剪）的程度（常指植物/树木；也可引申指代码、文字等可删减性）。"},"examples":[{"en":"The rose bushes’ prunableness depends on the season and their overall health.","zh":"玫瑰灌木的可修剪性取决于季节以及整体健康状况。"},{"en":"Before winter, gardeners check prunableness to avoid damaging new growth.","zh":"入冬前，园丁会评估可修剪性，以免伤到新长出的枝芽。"},{"en":"The editor praised the article’s prunableness—there was plenty that could be cut without losing the main idea.","zh":"编辑称赞这篇文章“很可删减”——删掉不少内容也不会影响主旨。"}]}],"synonyms":["prunability","suitability for pruning","cut-back potential","trim-ability"],"phonetic":"/ˈpruːnəbəlnəs/","extraExplanation":["“prunableness”不是特别常见的词，更常见的说法是形容词“prunable”（可修剪的）或短语“ability to be pruned / suitability for pruning”。","构词很直观：prune（修剪）+ -able（可……的）→ prunable；再加 -ness 变成名词，表示“……的性质/状态”。","在园艺语境里更自然；在写作、编辑或编程语境中属于比喻用法，意思接近“可精简性/可删减性”。"]}
{"word":"prunably","summary":{"en":"Prunably means “in a way that can be pruned,” either by trimming plants or by removing unnecessary parts (especially in computing).","zh":"Prunably 指“以可被修剪/删减的方式”，既可用于植物修剪，也常用于计算机领域表示“可剪枝、可去除不必要部分”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be pruned (cut back, trimmed, or removed).","zh":"以一种“可以被修剪/删减”的方式（能被剪掉、修整或移除）。"},"examples":[{"en":"These shrubs grow fast, but they can be shaped prunably each spring.","zh":"这些灌木长得很快，但每年春天都可以通过修剪来塑形。"},{"en":"The tree is prunably managed to keep it away from power lines.","zh":"这棵树被以可修剪的方式管理，以免靠近电线。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Computing) In a way that allows unhelpful options or branches to be removed to reduce work.","zh":"（计算机/算法）以一种“可剪枝”的方式，把无用的选项或分支移除以减少计算量。"},"examples":[{"en":"The search space is prunably structured, so the algorithm runs faster.","zh":"搜索空间的结构便于剪枝，所以算法运行更快。"},{"en":"We designed the decision tree prunably to avoid overfitting.","zh":"我们把决策树设计得便于剪枝，以避免过拟合。"}]}],"synonyms":["trimly (rare)","in a way that can be pruned","in a prunable way","with pruning"],"phonetic":"ˈpruːnəbli","extraExplanation":["“prunably”来自 prune（修剪/删减）+ -able（能够……的）+ -ly（……地）。在日常英语中更常见的是用短语表达，如 “in a way that can be pruned / easy to prune”。在技术语境（尤其算法、搜索、机器学习）里，“prunable / prunably”更常见，表示“可剪枝、可删减”。"]}
{"word":"prunaceae","summary":{"en":"Prunaceae is an older botanical family name for stone-fruit plants like cherries, plums, peaches, apricots, and almonds.","zh":"Prunaceae 是核果类植物（如樱桃、李子、桃、杏、杏仁等）的旧植物科名，现代多并入蔷薇科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family name (older usage) for stone-fruit trees and shrubs such as cherries, plums, peaches, apricots, and almonds; in modern classification these plants are usually placed in the rose family (Rosaceae).","zh":"（旧分类用法）蔷薇目中一类植物的科名，主要指樱桃、李子、桃、杏、杏仁等核果类树木与灌木；现代分类通常将其并入蔷薇科（Rosaceae）。"},"examples":[{"en":"Peach and cherry trees were once commonly grouped under Prunaceae in older textbooks.","zh":"在较旧的教材里，桃树和樱桃树常被归入 Prunaceae（李科/核果科）。"},{"en":"The garden includes many Prunaceae plants, like plums and apricots.","zh":"这个花园里有很多 Prunaceae 植物，比如李子和杏。"}]}],"synonyms":["stone-fruit family (informal)","Prunoideae (related classification term)","Amygdaloideae (modern grouping term)"],"phonetic":"/pruːˈneɪsiˌiː/","extraExplanation":["Prunaceae 是一个在植物分类史中较常见的“旧科名”，主要围绕李属（Prunus）相关植物。许多现代系统（如 APG）不再把它当作独立的科，而是把这些植物归入蔷薇科（Rosaceae）下的一个类群（常见说法是 Amygdaloideae/Prunoideae）。因此在阅读不同年代的资料时，你可能会看到两种归类方式。","词源提示：Prunaceae 来自拉丁语 prunus（李树/李属），后缀 -aceae 表示“……科”，常见于植物科名（如 Rosaceae 蔷薇科、Fabaceae 豆科）。"]}
{"word":"prunase","summary":{"en":"Purchase means “to buy,” or “a buying/the thing bought.” It can also mean “a firm grip/foothold” in more formal contexts.","zh":"Purchase 指“购买”，也可指“购买行为/所购之物”；在较正式语境中还可表示“（攀爬等时的）着力点/稳固抓握”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to buy something; to get something by paying money","zh":"购买；用钱买到某物"},"examples":[{"en":"I purchased a new phone online.","zh":"我在网上买了一部新手机。"},{"en":"Tickets must be purchased in advance.","zh":"票必须提前购买。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of buying something; something you have bought","zh":"购买行为；所购之物"},"examples":[{"en":"Keep the receipt as proof of purchase.","zh":"保留收据作为购买凭证。"},{"en":"That was my best purchase this year.","zh":"那是我今年买得最值的一样东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a firm hold or grip that helps you pull, push, or climb (less common)","zh":"（较少见）牢固的抓握/支撑点（有助于拉、推或攀爬）"},"examples":[{"en":"The climber found purchase on a small ledge.","zh":"攀登者在一处小岩架上找到了着力点。"}]}],"synonyms":["buy","get","acquire","procure","purchase (n.) : buying","purchase (n.) : foothold"],"phonetic":"/ˈpɝːtʃəs/","extraExplanation":["你输入的“prunase”不是常见英语单词，最可能是拼写错误，常见目标词是“purchase”。如果你原本想查的是别的词（例如“Prunus/梅属”之类），告诉我上下文句子我可以帮你确认。","用法提示：动词 purchase 比 buy 更正式/书面；日常口语更常说 buy。名词短语 proof of purchase（购买凭证）很常见。"]}
{"word":"prunasin","summary":{"en":"Prunasin is a cyanogenic glycoside in some Prunus plants that can release cyanide when broken down.","zh":"Prunasin 是李属等植物中的一种产氰苷，分解后可能释放氰化物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural chemical (a cyanogenic glycoside) found in some plants of the Prunus family (such as cherry laurel and some stone-fruit seeds) that can release cyanide when the plant tissue is damaged and the compound is broken down.","zh":"一种天然化学物质（产氰苷），存在于蔷薇科李属（Prunus，如樱桃月桂、部分核果种子等）植物中；当组织受损并被分解时，可能释放氰化物（氰化氢）。"},"examples":[{"en":"Researchers measured prunasin levels in cherry laurel leaves to estimate their potential to release cyanide.","zh":"研究人员测量了樱桃月桂叶中的苦杏仁苷相关物质（prunasin）含量，以评估其潜在的产氰能力。"},{"en":"Some Prunus seeds contain prunasin, so they should not be eaten in large amounts.","zh":"一些李属植物的种子含有 prunasin，因此不宜大量食用。"}]}],"synonyms":["cyanogenic glycoside","mandelonitrile glucoside"],"phonetic":"/ˈpruːnəsɪn/","extraExplanation":["prunasin 常见于植物化学与毒理学语境，属于“产氰苷（cyanogenic glycosides）”的一种：植物细胞被咀嚼、碾碎或受损时，相关酶促反应可能使其分解释放氰化氢。","它与同类化合物（如 amygdalin，苦杏仁苷）常一起被讨论，尤其在核果类（桃、杏、李、樱桃等）种子/叶片的安全性研究中。日常学习中多作为专业术语出现。"]}
{"word":"prune","summary":{"en":"Prune means a dried plum, or to trim/remove unnecessary parts (from plants, writing, lists, etc.).","zh":"Prune既可以指“西梅干”，也可作动词表示“修剪、删减不需要的部分”（植物或内容等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dried plum (often eaten as a snack or used in cooking).","zh":"西梅干；梅干（通常指晒干/烘干的李子，用来当零食或烹饪）。"},"examples":[{"en":"She added chopped prunes to the oatmeal for sweetness.","zh":"她在燕麦粥里加了切碎的西梅干来增加甜味。"},{"en":"Prunes are often used in baking and stews.","zh":"西梅干常用于烘焙和炖菜。"}]},{"partOfSpeech":"v.","definition":{"en":"to cut off or remove unwanted parts; to trim (especially plants or trees).","zh":"修剪；剪掉不需要的部分（尤指植物、树木）。"},"examples":[{"en":"In winter, gardeners prune roses to encourage healthy growth.","zh":"冬天园丁会修剪玫瑰，以促进健康生长。"},{"en":"He pruned the branches that were blocking the window.","zh":"他把挡住窗户的树枝修剪掉了。"}]},{"partOfSpeech":"v.","definition":{"en":"to reduce something by removing less useful parts (e.g., a list, a budget, or content).","zh":"精简；删减（如名单、预算或内容，去掉不重要/不需要的部分）。"},"examples":[{"en":"The editor pruned the article to fit the word limit.","zh":"编辑把文章删减到符合字数限制。"},{"en":"We need to prune the contact list and remove old entries.","zh":"我们需要精简联系人列表，删掉过时的条目。"}]}],"synonyms":["trim","cut back","clip","reduce","pare down"],"phonetic":"/pruːn/","extraExplanation":["“prune”作动词时常用于园艺语境，含义比“cut”更具体：强调为了让植物更健康、形状更好而“有目的地修剪”。引申到工作与写作中，就是“删去多余部分，让整体更清晰/更有效”。","名词“prune”在日常英语中通常指“干的西梅”，而新鲜的李子一般说“plum”。"]}
{"word":"pruned","summary":{"en":"“Pruned” means cut back or trimmed; it’s also the past form of “prune,” used for gardening or removing unnecessary details.","zh":"“pruned”表示“被修剪/被删减的”，也是动词“prune”的过去式/过去分词，可用于园艺修剪或内容精简。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"cut or trimmed (especially by removing unwanted parts, branches, or details) to make something neater, healthier, or more focused","zh":"被修剪的；被删减的（尤指去除不需要的部分、枝条或细节，使更整洁、更健康或更聚焦）"},"examples":[{"en":"She served a salad with pruned herbs from the garden.","zh":"她用从花园里修剪过的香草做了沙拉。"},{"en":"The final report was shorter and more pruned than the first draft.","zh":"最终报告比第一稿更短，更加精简。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “prune”: to cut away unwanted branches, parts, or details","zh":"“prune”的过去式/过去分词：修剪（去掉多余枝条或部分）；删减（去掉不必要的细节）"},"examples":[{"en":"He pruned the roses in early spring.","zh":"他在早春修剪了玫瑰。"},{"en":"The editor pruned unnecessary sentences from the article.","zh":"编辑删掉了文章中不必要的句子。"},{"en":"We pruned the list to the top ten candidates.","zh":"我们把名单精简到前十名候选人。"}]}],"synonyms":["trimmed","cut back","clipped","thinned","edited","abridged","streamlined"],"phonetic":"/prund/","extraExplanation":["“pruned”常见于两类语境：\n1）园艺：prune plants（修剪植物），强调让植物更健康、长得更好；\n2）写作/信息：prune details/sentences（删减细节/句子），强调让内容更清晰、更有重点。\n注意不要与名词“prune”（西梅/西梅干）混淆。"]}
{"word":"prunell","summary":{"en":"Prunell is an old or rare word meaning a dark plum-purple color, and sometimes an old term for a durable smooth woolen cloth.","zh":"Prunell 是较少见/较旧的词，可指李子般的深紫色，也可（旧式）指一种结实光滑的呢绒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark purplish color (like a ripe plum); also used as a name for a dye or shade","zh":"深紫色（像成熟李子的颜色）；也可指这种色调/染料"},"examples":[{"en":"She chose a prunell dress because it looked elegant and understated.","zh":"她选了一件深紫色的裙子，因为看起来优雅又不张扬。"},{"en":"The sunset turned the clouds a prunell purple.","zh":"夕阳把云染成了深紫色。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a strong, smooth woolen cloth, often used for clothing","zh":"（旧式用法）一种结实、表面光滑的呢绒（常用于做衣物）"},"examples":[{"en":"In older texts, you may read about coats made of prunell.","zh":"在较旧的文章里，你可能会读到用这种呢绒做的大衣。"},{"en":"The tailor recommended prunell for its durability.","zh":"裁缝推荐这种呢绒，因为它耐穿。"}]}],"synonyms":["plum (color)","deep purple","violet (dark)","purplish"],"phonetic":"/pruːˈnɛl/","extraExplanation":["“prunell”常见于旧拼法或文学/历史语境中，更常见的相关形式有“prunelle”。词源与法语 prunelle（小李子/李子般的颜色）有关，因此它的颜色义最直观。","作为布料名的用法偏古老，现代英语里不太常用；阅读历史小说、服饰史或旧词典时更可能遇到。"]}
{"word":"prunella","summary":{"en":"Prunella most commonly refers to the herb “self-heal,” and less commonly to an old term for a dark, durable fabric.","zh":"Prunella 最常指“夏枯草/自愈草（self-heal）”，较少见的意思是旧称的一种深色耐用布料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small purple-flowered herb (often Prunella vulgaris), commonly called self-heal, found in fields and lawns and traditionally used in herbal remedies","zh":"一种开紫色小花的草本植物（常指夏枯草 Prunella vulgaris），常见于草地、路旁；传统草药中常用于“自愈/消炎”等用途"},"examples":[{"en":"Self-heal (prunella) often grows in lawns and blooms in summer.","zh":"夏枯草（prunella）常长在草坪里，并在夏天开花。"},{"en":"In some herbal traditions, prunella is brewed as a mild tea.","zh":"在一些草药传统里，夏枯草会被用来泡成淡茶。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong, dark, smooth fabric (historically used for shoes or clothing trim)","zh":"一种结实、深色、表面较平滑的织物（旧时常用于鞋面或衣物镶边）"},"examples":[{"en":"The old shoes were made with prunella uppers.","zh":"那双旧鞋的鞋面用的是 prunella 这种布料。"},{"en":"In 19th-century descriptions, prunella was mentioned as a practical, hard-wearing cloth.","zh":"在19世纪的描写中，prunella 常被提到是一种耐穿、实用的布料。"}]}],"synonyms":["self-heal","heal-all","Prunella vulgaris"],"phonetic":"/pruˈnɛlə/","extraExplanation":["“Prunella”一词与拉丁语 *prunum*（李子/梅子）有关，因其紫色花序或色泽让人联想到深紫色。","作为植物名时，最常见的是 *Prunella vulgaris*，英语里也叫 **self-heal** 或 **heal-all**；在现代语境中多用于植物学/园艺或草药文化的介绍。","作为布料名的用法较偏旧式，常见于历史文本、服饰或鞋靴的描述中。"]}
{"word":"prunellas","summary":{"en":"Prunellas is the plural of prunella: most commonly the purple-flowered plant called self-heal; it can also mean a durable woolen fabric, and more rarely a female name.","zh":"Prunellas 是 prunella 的复数：最常指开紫花的植物“夏枯草/自愈草”；也可指一种结实的毛织物；更少见时可作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low purple-flowered plant (also called self-heal) in the mint family, sometimes used in herbal medicine","zh":"（植物）夏枯草；一种开紫色小花的薄荷科植物，也常被称为“自愈草”，有时用于草药疗法"},"examples":[{"en":"Prunella grows in grassy areas and can bloom all summer.","zh":"夏枯草常生长在草地里，整个夏天都可能开花。"},{"en":"Some people make tea from prunella for minor throat discomfort, but evidence is limited.","zh":"有些人会用夏枯草泡茶来缓解轻微喉咙不适，但科学证据有限。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong, smooth woolen fabric (often used historically for clothing)","zh":"（织物）普鲁内拉呢；一种结实、表面光滑的毛织物（历史上常用于服装）"},"examples":[{"en":"The costume department chose prunella for its durable, neat finish.","zh":"服装组选择普鲁内拉呢，是因为它耐用且表面利落。"},{"en":"In older novels, you may see “prunella” describing sturdy dress fabric.","zh":"在一些较老的小说里，你可能会看到用“prunella”来形容结实的裙装面料。"}]},{"partOfSpeech":"n.","definition":{"en":"a woman’s given name (less common)","zh":"（人名）普鲁内拉（女性名字，较少见）"},"examples":[{"en":"Prunella is a traditional name found in some English-speaking families.","zh":"普鲁内拉是一些英语家庭中会使用的传统名字。"}]}],"synonyms":["self-heal","heal-all","Prunella vulgaris"],"phonetic":"/pruˈnɛlə/","extraExplanation":["“prunella”作植物时，常指拉丁学名 Prunella vulgaris（夏枯草/自愈草）。在欧洲民间传统里，它与“self-heal（自愈）”这一别名有关，但日常使用时仍建议把它当作普通野花或草药名来理解。","作织物名的“prunella”在现代较少见，多出现在历史语境、文学作品或戏剧服装描述中。"]}
{"word":"prunelle","summary":{"en":"Prunelle is a rare word meaning the pupil of the eye, and sometimes a small type of plum.","zh":"Prunelle 是个较罕见的词，可指“瞳孔”，也可指一种小李子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the pupil of the eye.","zh":"（罕用）眼睛的瞳孔。"},"examples":[{"en":"A bright light made her prunelles shrink to protect her eyes.","zh":"强光让她的瞳孔收缩，以保护眼睛。"},{"en":"In old poetic writing, prunelle can mean the dark center of the eye.","zh":"在较古老的诗意写法中，prunelle 可指眼睛中央的黑色部分（瞳孔）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a small plum; a damson-type plum.","zh":"（罕用）一种小李子；类似黑李（damson）的一类李子。"},"examples":[{"en":"The recipe called for prunelles, but any small plum would work.","zh":"食谱要求用 prunelles，但用任何小李子也可以。"},{"en":"She made jam from prunelles picked in late summer.","zh":"她用夏末采摘的小李子做了果酱。"}]}],"synonyms":["pupil","plum (small plum)"],"phonetic":"/pruˈnɛl/","extraExplanation":["“prunelle”来自法语，原义与“李子”有关，因此在一些语境里既可指水果，也可借喻“瞳孔”（像小而圆、颜色深的李子）。","在现代英语中，这个词非常少见；表达“瞳孔”更常用 pupil。法语里常说“la prunelle de ses yeux”（字面“他/她眼睛的瞳孔”），相当于英语的“the apple of one’s eye”（心肝宝贝、掌上明珠）。"]}
{"word":"prunelles","summary":{"en":"Prunelles is the plural of prunelle: most commonly it means sloes (blackthorn fruit), and more rarely/literarily it can mean the pupils of the eyes.","zh":"Prunelles 是 prunelle 的复数：最常见指黑刺李果（sloe），较少见/偏文学用法可指眼睛的瞳孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of prunelle) the dark purple fruit of the blackthorn; a sloe (sometimes used to make drinks like sloe gin).","zh":"（prunelle 的复数）黑刺李的深紫色果实；野李子（sloe）（有时用于制作如黑刺李金酒等饮品）。"},"examples":[{"en":"In late autumn, people sometimes gather prunelles to flavor homemade liqueur.","zh":"深秋时，人们有时会采集 prunelles 来给自制利口酒增味。"},{"en":"The prunelles were too tart to eat raw.","zh":"这些 prunelles 太酸了，不适合生吃。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of prunelle; literary/archaic) the pupils of the eyes.","zh":"（prunelle 的复数；文学/古用）眼睛的瞳孔。"},"examples":[{"en":"The candlelight flickered in her prunelles.","zh":"烛光在她的瞳孔（prunelles）里闪动。"},{"en":"He stared, his prunelles fixed on the horizon.","zh":"他凝视着地平线，瞳孔（prunelles）一动不动。"}]}],"synonyms":["sloes","blackthorn berries","pupils (literary sense)"],"phonetic":"/pruːˈnɛl/","extraExplanation":["“prunelles”多见于法语或带法语色彩的英文语境中；英语里更常用的说法是 sloe（黑刺李果）或 pupils（瞳孔）。","在文学表达里，用 prunelle(s) 指“瞳孔”会显得更诗意、古典，但在日常英语中较少见。","词源上与法语 prunelle 有关，本义与“李子/小黑李子”类水果相关，后来引申到“眼珠/瞳孔”的意象用法。"]}
{"word":"prunellidae","summary":{"en":"Prunellidae is the scientific name for the accentor family of small songbirds, mainly in Europe and Asia.","zh":"Prunellidae 是“accentors（岩鹨/篱雀类）”这一小型鸣禽科的科学名称，主要分布在欧洲和亚洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of small songbirds known as accentors, found mainly in Europe and Asia (e.g., the dunnock).","zh":"鸟类分类学中的一个科名，称为“岩鹨科/篱雀科”（accentors），主要分布在欧洲和亚洲（如篱雀 dunnock）。"},"examples":[{"en":"The dunnock belongs to the bird family Prunellidae.","zh":"篱雀属于鸟类的 Prunellidae（岩鹨科/篱雀科）。"},{"en":"In European field guides, Prunellidae is usually introduced as the “accentor” family.","zh":"在欧洲的观鸟图鉴里，Prunellidae 通常被介绍为“accentor（岩鹨/篱雀类）”这一科。"}]}],"synonyms":["accentors","accentor family"],"phonetic":"/pruːˈnɛlɪdi/","extraExplanation":["“Prunellidae”是拉丁化的科学名称，常见于学术论文、动物分类目录和观鸟图鉴中；日常英语更常说“accentors”。","这个科里的鸟外形多偏朴素、体型小，常在灌丛、林缘或山地活动；最为人熟知的成员之一是 dunnock（篱雀）。","不同中文资料对其译名可能不一致（如“岩鹨科/篱雀科”），可结合具体物种来确认。"]}
{"word":"prunello","summary":{"en":"“Prunello” most often means a dark purple-blue color (or something that color); less commonly it’s used loosely for a Tuscan Italian red wine (Brunello di Montalcino).","zh":"“prunello”最常指一种深紫蓝色（或指这种颜色的东西）；较少见的用法是（不太严谨地）指托斯卡纳的意大利红酒 Brunello di Montalcino。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A purple-blue color, like the plum-colored feathers of a bird or a dark purplish fabric.","zh":"一种紫蓝色（偏李子色的深紫），常用来形容羽毛或布料的颜色。"},"examples":[{"en":"She wore a prunello coat that looked almost black indoors but purple in sunlight.","zh":"她穿了一件普鲁内洛色的大衣，在室内几乎发黑，但在阳光下会显出紫色。"},{"en":"The painter mixed a prunello shade for the shadows in the portrait.","zh":"画家调出一种普鲁内洛色，用在肖像的阴影部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that is dark purple or purple-blue in color.","zh":"（形容词）指深紫色或紫蓝色的。"},"examples":[{"en":"The bird has prunello feathers along its wings.","zh":"那只鸟的翅膀边缘有深紫色的羽毛。"},{"en":"They chose prunello curtains to warm up the room.","zh":"他们选了深紫色的窗帘，让房间更有氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of Italian red wine from Tuscany (often called Brunello di Montalcino), sometimes loosely referred to as “prunello.”","zh":"一种意大利托斯卡纳的红葡萄酒（常指 Brunello di Montalcino 布鲁奈罗，有时也被不太严谨地称作 prunello）。"},"examples":[{"en":"For dinner, they opened a bottle of prunello with roasted lamb.","zh":"晚餐时，他们开了一瓶“prunello”配烤羊肉。"},{"en":"In the wine shop, ask for Brunello di Montalcino to be precise, not just prunello.","zh":"在酒铺里，为了准确，最好说 Brunello di Montalcino，而不只是说 prunello。"}]}],"synonyms":["purple","purplish","violet","indigo"],"phonetic":"/pruˈnɛloʊ/","extraExplanation":["“Prunello”在英语里相对少见：最传统的用法是指一种深紫蓝色（也常用于旧式文学或服装面料描述）。","在葡萄酒语境中更常见的是“Brunello di Montalcino”（布鲁奈罗·蒙塔奇诺），属于较知名的意大利红酒名称；把它简称为“prunello”并不标准，容易造成误会。"]}
{"word":"prunellos","summary":{"en":"Prunellos are either a dark purple dye/color or a strong woolen cloth usually dyed that color (common in older writing).","zh":"prunellos 可指深紫色染料/颜色，也可指通常染成该色的结实毛织布（多见于较旧的文字）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark purple dye; also the dark purple color made from it","zh":"深紫色染料；也指由此染出的深紫色"},"examples":[{"en":"The designer chose prunello for the accents to create a rich, formal look.","zh":"设计师选择用深紫色作点缀，营造出浓郁而正式的感觉。"},{"en":"In the painting, the shadows are tinted with prunello rather than plain black.","zh":"这幅画里的阴影带有深紫色的调子，而不是纯黑。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong woolen cloth, usually dyed a dark purplish color (often used for coats or dresses, especially in older texts)","zh":"（旧时常见的）结实的毛织布，通常染成深紫色（常用于外套或连衣裙等）"},"examples":[{"en":"In the novel, she wears a prunello cloak to the winter market.","zh":"小说里她穿着一件深紫色毛呢斗篷去冬日集市。"},{"en":"The tailor recommended prunello for its warmth and durability.","zh":"裁缝推荐用这种深紫色毛呢布，因为它保暖又耐穿。"}]}],"synonyms":["dark purple","plum (color)","violet (deep)","dyed wool cloth"],"phonetic":"/pruˈnɛloʊz/","extraExplanation":["“prunello(s)”多见于较老的英语文本或服装/染色的语境；现代日常英语里不算常用。","词源与意大利语有关，和“prugna/李子（深紫色）”的意象相关，因此常让人联想到偏李子色调的深紫。"]}
{"word":"pruner","summary":{"en":"Pruner most commonly means a tool for trimming plants; it can also (less commonly) refer to a dried plum, though “prune” is more usual for the fruit.","zh":"Pruner最常指“修枝剪/修枝工具”；也可指“西梅干”，但水果更常用prune。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool (or a person) used for cutting back plants—especially for trimming branches, stems, or shrubs.","zh":"修枝工具（或修剪植物的人）；用于修剪枝条、茎或灌木。"},"examples":[{"en":"I use hand pruners to trim the rose bushes every spring.","zh":"我每年春天用手动修枝剪修剪玫瑰灌木。"},{"en":"The gardener grabbed a pruner and cut away the dead branches.","zh":"园丁拿起修枝剪，把枯枝剪掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A dried plum, commonly eaten as food (especially known for helping digestion).","zh":"西梅干；一种常见的干果（尤其因有助于消化而出名）。"},"examples":[{"en":"She added chopped pruners to the oatmeal for a sweet flavor.","zh":"她把切碎的西梅干加到燕麦粥里，增加甜味。"},{"en":"Some people eat a pruner when they feel constipated.","zh":"有些人便秘时会吃西梅干。"}]}],"synonyms":["pruning shears","secateurs","shears","prune"],"phonetic":"/ˈpruːnɚ/","extraExplanation":["“pruner”在日常英语里更常见的是“pruning shears / pruners（修枝剪）”。如果你指的是“西梅干”，更常用的单词是“prune”（prune作名词），而不是“pruner”。","园艺语境中，prune（动词）=修剪；pruning（名词）=修剪（这项工作/过程）。常见搭配：prune a tree / prune roses。"]}
{"word":"pruners","summary":{"en":"“Pruners” usually means gardening shears used to trim plants; it can also mean people who prune.","zh":"“pruners”通常指修枝剪等园艺修剪工具；也可指修剪植物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool (usually like strong scissors) used for cutting and trimming plants, especially small branches.","zh":"修枝剪；园艺剪（像结实的剪刀，用来修剪植物，尤其是细枝）"},"examples":[{"en":"She used pruners to cut back the rose bushes.","zh":"她用修枝剪把玫瑰丛修短了一些。"},{"en":"Keep your pruners sharp so the cuts are clean.","zh":"把修枝剪保持锋利，这样剪口会更整齐。"},{"en":"I always disinfect my pruners after pruning sick plants.","zh":"修剪过生病的植物后，我总会给修枝剪消毒。"}]},{"partOfSpeech":"n.","definition":{"en":"People who prune (cut away dead or unwanted parts) from plants or trees.","zh":"修剪工；修枝的人（给植物或树木剪去枯枝或多余枝叶的人）"},"examples":[{"en":"The vineyard hired pruners for the winter season.","zh":"葡萄园在冬季雇了修剪工。"},{"en":"Skilled pruners can shape a tree without harming it.","zh":"熟练的修剪工能在不伤树的情况下把树修得好看。"}]}],"synonyms":["pruning shears","secateurs","clippers"],"phonetic":"/ˈpruːnɚz/","extraExplanation":["“Pruners”最常见指工具（修枝剪）。在园艺商店里也常见说法：hand pruners（手持修枝剪）、bypass pruners（旁通式，适合活枝，剪口更平滑）、anvil pruners（砧板式，适合枯枝但可能压伤活枝）。","词源上与动词 prune（修剪）相关。prune 也可用于比喻：prune a budget（削减预算）、prune unnecessary words（删掉多余措辞）。"]}
{"word":"prunes","summary":{"en":"“Prunes” most commonly means dried plums; it can also be the verb form meaning “cuts back/removes unnecessary parts.”","zh":"“prunes”最常见意思是“西梅干/李子干”；也可作动词，表示“修剪、删减不需要的部分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dried plums (the fruit), often eaten as a snack or used in cooking and baking.","zh":"西梅干；李子干（干制的李子果实），常作零食或用于烹饪、烘焙。"},"examples":[{"en":"She added prunes to the oatmeal for natural sweetness.","zh":"她在燕麦粥里加了些西梅干来增加天然甜味。"},{"en":"Prunes are often used in stews and desserts.","zh":"西梅干常用于炖菜和甜点。"}]},{"partOfSpeech":"v.","definition":{"en":"Cuts off unwanted parts of something (like branches, details, or options) to make it cleaner, smaller, or more effective.","zh":"修剪；删减（去掉不需要的部分，如树枝、细节或选项，使之更整洁、更精炼或更有效）。"},"examples":[{"en":"He prunes the rose bushes every spring.","zh":"他每年春天都会修剪玫瑰灌木。"},{"en":"The editor prunes the article to make it shorter.","zh":"编辑删减文章内容，使其更短。"}]}],"synonyms":["dried plums","cut back","trim","clip","prune away"],"phonetic":"/prunz/","extraExplanation":["“prune”作名词时，传统上指“干李子”。在北美，包装上有时会用“dried plums（干李子）”来替代“prunes”，因为更中性、也更容易让人联想到“水果”而不是它常见的助消化印象。","动词“prune”常用于园艺（修枝、疏剪），也可比喻“精简/删减”信息、文字或选择：prune unnecessary details（删掉不必要的细节）。"]}
{"word":"prunetin","summary":{"en":"Prunetin is a plant isoflavone studied in chemistry and biology.","zh":"Prunetin 是一种植物异黄酮，常见于化学与生物研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural plant compound (an isoflavone) found in some flowers and herbs, studied for possible biological effects such as antioxidant or anti-inflammatory activity","zh":"一种天然植物化合物（异黄酮类），存在于一些花和草本植物中；常用于研究其可能的生物作用，如抗氧化或抗炎活性"},"examples":[{"en":"Prunetin is an isoflavone that researchers often analyze in plant extracts.","zh":"Prunetin 是一种异黄酮，研究人员常在植物提取物中分析它。"},{"en":"The paper measured prunetin levels to compare different samples.","zh":"该论文测量了 prunetin 的含量，用来比较不同样本。"}]}],"synonyms":["4'-O-methylgenistein","an isoflavone"],"phonetic":"/pruːˈniːtɪn/","extraExplanation":["Prunetin 常被视为 genistein（染料木素）的甲基化衍生物之一，在化学名称上也可能写作 “4'-O-methylgenistein”。在营养与药理研究中，它更多是“被研究的成分”，而不是日常英语中常见的词。"]}
{"word":"prunetol","summary":{"en":"“Prunetol” is not a standard English word; it’s likely a misspelling or a brand name. Provide context to identify the intended word.","zh":"“prunetol”不是标准英语单词；可能是拼写错误或品牌名。请提供语境以确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a product/brand name. Please share the sentence or context so I can identify the intended word (for example, “prune,” “prunelle,” or a specific brand name).","zh":"不是标准英语单词。很可能是拼写错误，或是某个产品/品牌名。请提供所在句子或使用语境，我可以帮你判断你想写的词（例如 prune、prunelle，或某个品牌名）。"},"examples":[{"en":"I couldn’t find “prunetol” in a dictionary—can you tell me where you saw it?","zh":"我在词典里找不到“prunetol”——你是在哪里看到的？"},{"en":"If you meant “prune,” it can mean “to cut off unwanted parts,” especially in gardening.","zh":"如果你想写的是“prune”，它可以表示“修剪（去掉多余部分）”，常用于园艺。"}]}],"extraExplanation":["“prunetol”看起来像是把两个部分拼在一起（例如 prune + 其他词尾），或是把某个常见词拼错了。你可以把：1）原句贴出来；2）说明它出现在药品/护肤品/食品标签还是文章里；3）告诉我是英式还是美式来源。我就能更准确地给出正确词条与释义。"]}
{"word":"pruniferous","summary":{"en":"Pruniferous means “plum-bearing,” used mainly in botanical or literary writing.","zh":"pruniferous 意为“结李子的/产李子的”，多用于植物学或较文雅的书面语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Producing or bearing plums; relating to plum-bearing plants (genus *Prunus*).","zh":"（植物学）结李子（产李子）的；与李子属（*Prunus*）植物相关的。"},"examples":[{"en":"The botanist described the hillside as rich in pruniferous shrubs.","zh":"植物学家形容那片山坡李子属灌木很多。"},{"en":"In some older texts, pruniferous trees were valued for both fruit and timber.","zh":"在一些较早的文献中，结李子的树因果实和木材都很有价值。"}]}],"synonyms":["plum-bearing","fruit-bearing (when context is clear)"],"phonetic":"/ˌpruːnɪˈfɛrəs/","extraExplanation":["这是一个比较少见、偏书面/植物学语境的词，日常英语更常说 **plum-bearing**（结李子的）或直接说 **plum tree**（李子树）。","词源上可拆为 **pruni-**（来自拉丁语 *prunum* / *Prunus*，李子/李子属）+ **-ferous**（“携带/产生……的”，如 *coniferous* 针叶的、*odoriferous* 有香味的）。"]}
{"word":"pruniform","summary":{"en":"“Uniform” means either (1) the same and consistent, or (2) the special clothes worn by a group.","zh":"“uniform”既可表示“统一一致的”，也可表示“制服/校服”等团体统一服装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"the same in form, color, or character; not changing much","zh":"一致的；统一的；变化不大的"},"examples":[{"en":"The walls are painted a uniform white.","zh":"墙被刷成一致的白色。"},{"en":"We need a uniform system for naming files.","zh":"我们需要一套统一的文件命名系统。"}]},{"partOfSpeech":"n.","definition":{"en":"a special set of clothes worn by members of the same school, team, job, or organization","zh":"制服；校服；（同一团队/职业的）统一服装"},"examples":[{"en":"Students must wear a uniform at this school.","zh":"这所学校要求学生穿校服。"},{"en":"The nurse wore a clean uniform.","zh":"护士穿着干净的制服。"}]}],"synonyms":["consistent","even","standardized","steady","school uniform"],"phonetic":"/ˈjuːnəˌfɔrm/","extraExplanation":["你输入的“pruniform”不是常见英文单词，可能是拼写错误。最接近、最常用的词是“uniform”。如果你想查的是别的词（例如“pre-uniform”之类的组合），可以告诉我具体语境或完整句子。"]}
{"word":"pruning","summary":{"en":"Pruning means cutting away unwanted parts—most commonly from plants, and by extension from plans, writing, or data to make them better or simpler.","zh":"Pruning 指“修剪/删减”：最常用于植物修剪，也可引申为精简计划、文字或数据，使其更好或更简洁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of cutting away dead, unwanted, or overgrown parts of a plant (such as branches or buds) to improve its health, shape, or growth","zh":"（对植物的）修剪；剪去枯枝、病枝或多余枝叶，以促进健康、生长或造型"},"examples":[{"en":"Pruning in late winter helps many fruit trees produce better fruit in spring.","zh":"在冬末修剪有助于许多果树在春季结出更好的果实。"},{"en":"Regular pruning keeps the rose bush from getting too crowded.","zh":"定期修剪能防止玫瑰丛过于拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of removing unnecessary parts from something (like a plan, a list, or computer data) to make it simpler or more efficient","zh":"（比喻）删减；去除不必要的部分，使内容更精简或更高效（如计划、清单或数据）"},"examples":[{"en":"After some pruning, the report became much easier to read.","zh":"删减后，这份报告更容易阅读了。"},{"en":"The app does automatic data pruning to save storage space.","zh":"这个应用会自动清理不必要的数据以节省存储空间。"}]},{"partOfSpeech":"v.","definition":{"en":"cutting away parts of a plant (present participle of “prune”)","zh":"修剪（动词 prune 的现在分词形式）"},"examples":[{"en":"She’s pruning the hedge to keep it neat.","zh":"她正在修剪树篱，让它看起来整齐。"},{"en":"Be careful when pruning—don’t cut too close to the main stem.","zh":"修剪时要小心——不要剪得太靠近主茎。"}]}],"synonyms":["trimming","cutting back","thinning","editing","streamlining"],"phonetic":"/ˈpruːnɪŋ/","extraExplanation":["“Pruning”最常见于园艺语境：通过“剪掉一部分来让整体更好”。因此它在英语里很容易被借用到写作、项目管理、数据处理等领域，表示“删繁就简”。","文化小提示：园艺书里常见的搭配有 light pruning（轻度修剪）、heavy pruning（重度修剪）、pruning shears（修枝剪）。在比喻用法中常说 pruning the budget / pruning the schedule（精简预算/日程）。"]}
{"word":"prunitrin","summary":{"en":"“Prunitrin” isn’t a standard English word; it likely refers to (or misspells) “prunetrin,” a plant chemical used mainly in scientific writing.","zh":"“prunitrin”不是常见英语词；更可能是（或误拼）“prunetrin”，一种主要用于科研语境的植物化学物质。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A term that is not commonly used in standard English; it most likely refers to (or is a misspelling of) “prunetrin,” a plant compound (an isoflavone glycoside) found in some species of the Prunus genus and other plants, mainly used in scientific contexts.","zh":"一个不属于常见标准英语词汇的词；更可能是（或拼写有误，想写）“prunetrin（普鲁内汀苷）”，一种存在于某些李属（Prunus）及其他植物中的植物化合物（异黄酮类糖苷），主要用于科研语境。"},"examples":[{"en":"I couldn’t find “prunitrin” in an English dictionary; it may be “prunetrin,” a compound studied in plants.","zh":"我在英语词典里找不到“prunitrin”；它可能是“prunetrin”，一种在植物中被研究的化合物。"},{"en":"The paper analyzed prunetrin content in leaf extracts using lab methods.","zh":"这篇论文用实验方法分析了叶片提取物中的 prunetrin 含量。"}]}],"synonyms":["prunetrin (possible intended spelling)"],"phonetic":"/pruːˈniːtrɪn/","extraExplanation":["“prunitrin”很可能是拼写误差：如果你是在论文、成分表或化学/生物资料里看到的，建议回查原文是否为“prunetrin”或其他相近拼写（也可能是“prunetin”等）。","这类词多见于药理、植物化学、营养补充剂研究中，日常交流里几乎不用；如果你能提供句子或出处（例如一段论文/标签截图），我可以更准确判断你要找的词。"]}
{"word":"prunt","summary":{"en":"“Prunt” is a Scots/archaic word meaning to print or stamp a mark, or the mark/pattern itself.","zh":"“prunt”是苏格兰英语/古语，指“印刷/盖印/压印”，也可指“印记/压印图案”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots/archaic) To print or stamp a mark/design onto something; to impress (a pattern) onto a surface.","zh":"（苏格兰英语/古语）印刷；盖印；把图案/痕迹压印在某物表面上。"},"examples":[{"en":"The mill used to prunt patterns onto the cloth with heavy rollers.","zh":"那家工厂过去会用沉重的滚筒把花纹压印到布料上。"},{"en":"Her name was prunted on the cover in gold letters.","zh":"她的名字用金色字母印在封面上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots/archaic) A printed mark, stamp, or pattern; an impression left by printing or pressing.","zh":"（苏格兰英语/古语）印记；印章；压印出来的图案/痕迹。"},"examples":[{"en":"You can still see the prunt on the paper where the seal was pressed.","zh":"你还能看到纸上盖章时留下的印记。"},{"en":"The old book’s cover had a decorative prunt around the edges.","zh":"那本旧书的封面边缘有一圈装饰性的压印花纹。"}]}],"synonyms":["print","imprint","stamp","press","mark"],"phonetic":"/prʌnt/","extraExplanation":["“prunt”不是现代标准英语里的常用词，更多见于苏格兰英语（Scots）或较旧的文本里，意思通常和“print（印刷）/imprint（压印）/stamp（盖印）”接近。","如果你是在作业或聊天里看到“prunt”，也有可能是把“print（打印）”或“prune（修剪/删减）”拼错了；你可以把原句发我，我能帮你判断最合适的词。"]}
{"word":"prunted","summary":{"en":"“Prunted” most commonly means ‘decorated with raised bumps,’ especially on glassware; rarely, it can be the past form of a dialect verb meaning ‘to strut.’","zh":"“prunted”最常见指（玻璃器等）带凸起装饰；较少见时可作方言动词 prunt 的过去式，意为“趾高气扬地走”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decorated with small raised blobs (called “prunts”), especially on old or decorative glassware.","zh":"（尤指古董或装饰性玻璃器皿）带有小凸起装饰（称为 prunts/玻璃凸点）的。"},"examples":[{"en":"The pitcher is prunted, so it has a bumpy texture you can feel.","zh":"这个水壶是 prunted 的，所以摸起来有凹凸的质感。"},{"en":"Collectors often look for prunted goblets from earlier European styles.","zh":"收藏者常寻找早期欧洲风格的 prunted 高脚杯。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, dialect) Past tense/past participle of “prunt”: to strut or walk in a proud, showy way.","zh":"（罕见；方言）prunt 的过去式/过去分词：趾高气扬地走路，摆架子地踱步。"},"examples":[{"en":"He prunted down the street as if everyone were watching.","zh":"他趾高气扬地走在街上，仿佛所有人都在看他。"},{"en":"After the win, she prunted around the room, smiling.","zh":"赢了之后，她在房间里神气地来回走，满脸笑意。"}]}],"synonyms":["bumpy","knobbed","studded","embossed","ornamented"],"phonetic":"/ˈprʌntɪd/","extraExplanation":["“prunted”在日常英语里非常少见。你更可能在“prunted glass / prunted goblet（带凸点装饰的玻璃器）”这类描述古董或工艺品的语境中看到它。","如果你原本想表达“修剪过的”，常见拼法是“pruned”（如 pruned branches 修剪过的树枝）。"]}
{"word":"Pruntytown","summary":{"en":"Pruntytown is a place name: a small unincorporated community in Barbour County, West Virginia.","zh":"Pruntytown 是地名：美国西弗吉尼亚州巴伯县的一个小型非建制社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community in Barbour County, West Virginia, U.S.","zh":"美国西弗吉尼亚州巴伯县的一个小型非建制社区（地名）。"},"examples":[{"en":"Pruntytown is in Barbour County, West Virginia.","zh":"Pruntytown 位于西弗吉尼亚州的巴伯县。"},{"en":"They drove through Pruntytown on their way to Philippi.","zh":"他们去菲利皮（Philippi）的路上开车经过 Pruntytown。"}]}],"phonetic":"/ˈprʌnti taʊn/","extraExplanation":["这是一个专有名词（地名），通常不翻译，直接音译或保留英文拼写。","在美国，“unincorporated community”指不属于独立建制城市/镇的聚居地，通常由县（county）提供部分公共服务。","读音上常按“Prunty + town”来理解：Prunty（姓/地名成分）+ town（城镇）。"]}
{"word":"prunus","summary":{"en":"Prunus is the scientific genus name for many stone-fruit plants like cherry, plum, peach, apricot, and almond.","zh":"Prunus 是李属的学名，涵盖樱桃、李子、桃、杏、杏仁等多种核果类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of trees and shrubs in the rose family that includes cherries, plums, peaches, apricots, and almonds (often used as a scientific/Latin genus name).","zh":"蔷薇科李属（常见作拉丁学名/属名），包括樱桃、李子、桃、杏、杏仁等树木或灌木。"},"examples":[{"en":"Cherries belong to the genus Prunus.","zh":"樱桃属于李属（Prunus）。"},{"en":"In the garden, we planted Prunus trees like plum and cherry.","zh":"在花园里，我们种了李属的树，比如李子树和樱桃树。"}]},{"partOfSpeech":"other","definition":{"en":"used before a species name to show a plant’s scientific classification (e.g., Prunus serrulata).","zh":"（用于物种名之前）表示植物的科学分类/属名，如 Prunus serrulata。"},"examples":[{"en":"Prunus serrulata is a famous ornamental cherry tree.","zh":"Prunus serrulata（樱花）是一种著名的观赏樱桃树。"},{"en":"The label reads: Prunus persica (peach).","zh":"标签上写着：Prunus persica（桃）。"}]}],"synonyms":["stone-fruit genus","cherry/plum/peach genus (informal)"],"phonetic":"/ˈpruːnəs/","extraExplanation":["“Prunus”来自拉丁语，和“李子（plum）”有关，所以这个属名涵盖了很多我们熟悉的核果类水果（有硬核的果实）。","在日常英语里，人们更常说具体的水果名（cherry/plum/peach/apricot/almond），而“Prunus”多见于植物学、园艺、植物标签或科普文章中。"]}
{"word":"prurience","summary":{"en":"Prurience means an excessive, unhealthy sexual interest or lustful curiosity (usually in a critical tone).","zh":"Prurience 指对性事过度、不健康的兴趣或好色的窥探欲，通常带批评语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive or unhealthy interest in sexual matters; lustful curiosity (often used disapprovingly).","zh":"对性事过度或不健康的兴趣；好色的窥探欲（多为贬义）。"},"examples":[{"en":"The article was criticized for appealing to prurience rather than offering serious reporting.","zh":"这篇文章被批评是在迎合好色心理，而不是进行严肃报道。"},{"en":"Gossip sites often rely on prurience to attract clicks.","zh":"八卦网站常常依靠煽动好色心理来吸引点击。"}]}],"synonyms":["lust","lewdness","salaciousness","prurient interest"],"phonetic":"/ˈprʊriəns/","extraExplanation":["“prurience”常见于媒体、文学评论与法律语境，强调一种“迎合低级趣味”的性好奇心，语气偏正式且带批判。","相关形容词是“prurient”（好色的、挑逗性的），搭配常见：prurient interest / prurient curiosity。","在美国法律与审查讨论中，有时会与“obscenity（淫秽）”并提，例如判定作品是否主要诉诸“prurient interest（好色兴趣）”。"]}
{"word":"pruriency","summary":{"en":"Pruriency means an excessive, unhealthy sexual curiosity, often criticized in media or storytelling.","zh":"Pruriency 指对性相关内容过度、不健康的好奇或窥探欲，常用来批评媒体或叙事的低俗猎奇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive or unhealthy interest in sexual matters; lewd curiosity","zh":"对性相关事物过度或不健康的兴趣；好色的窥探欲"},"examples":[{"en":"The editor rejected the story because it relied on pruriency rather than real reporting.","zh":"编辑拒绝了这篇报道，因为它靠的是低俗的性噱头，而不是真正的新闻报道。"},{"en":"The documentary avoided pruriency and focused on the social issues behind the case.","zh":"这部纪录片避免低俗猎奇，而是聚焦案件背后的社会问题。"},{"en":"Critics said the camera work invited pruriency instead of empathy.","zh":"评论家说这种镜头语言引发的是低俗窥视欲，而不是同理心。"}]}],"synonyms":["lewdness","lustfulness","salaciousness","smuttiness"],"phonetic":"/prʊˈriːənsi/","extraExplanation":["“pruriency”常用于批评媒体、广告或叙事方式：强调它是在“迎合低俗的性猎奇”，而不只是“涉及性内容”。它带有强烈的负面道德评价。","词根来自拉丁语 *prurire*（“发痒、想抓挠”），引申为“难以抑制的欲望/冲动”。因此它常暗示一种“忍不住想看”的不健康好奇心。","常见搭配：*appeal to pruriency*（迎合低俗趣味）、*prurient interest*（好色的兴趣，常见于法律/媒体评论语境）。注意 *prurient* 是形容词。"]}
{"word":"prurient","summary":{"en":"“Prurient” describes an unhealthy, excessive interest in sexual matters, often implying vulgar or intrusive curiosity.","zh":"“prurient”指对性话题过度且不健康的兴趣，常带有低俗、越界的窥探意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an excessive or unhealthy interest in sexual matters (often describing looks, curiosity, or media content).","zh":"（对性话题）过度、病态地感兴趣的；（常形容目光、好奇心或媒体内容）猥亵的、好色的。"},"examples":[{"en":"The article was criticized for its prurient tone rather than serious reporting.","zh":"这篇文章因其猥亵的语气而受到批评，而不是因为严肃报道。"},{"en":"He gave a prurient glance that made people uncomfortable.","zh":"他投来一种好色的目光，让人感到不舒服。"},{"en":"The film avoids prurient details and focuses on the characters’ emotions.","zh":"这部电影避免渲染猥亵细节，而是聚焦人物情感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of interest/curiosity) Morbidly eager to know about other people’s private sexual behavior or scandal.","zh":"（指兴趣/好奇心）对他人私密性行为或丑闻怀有窥探欲、病态的好奇。"},"examples":[{"en":"Tabloids often rely on prurient curiosity about celebrities’ private lives.","zh":"小报常常依赖人们对名人私生活的窥探欲。"},{"en":"She felt the questions were prurient and refused to answer.","zh":"她觉得这些问题带有窥探和猥亵意味，于是拒绝回答。"}]}],"synonyms":["lewd","lascivious","salacious","dirty-minded","voyeuristic"],"phonetic":"/ˈprʊriənt/","extraExplanation":["词源来自拉丁语 prurire，意为“发痒”。prurient 原本有“瘙痒的/引起瘙痒的”之意，后来引申为“像痒一样难以抑制的欲望或好奇”，在现代英语里多指不健康的性好奇与猥亵倾向。","语气与使用场景：prurient 往往带强烈负面评价，常用于批评媒体、评论、目光或提问方式。它与 sexy（性感的，可能中性/正面）不同，也比 curious（好奇的，中性）更强调“越界、低俗、窥探”。","常见搭配：prurient interest / prurient curiosity（猥亵的兴趣/窥探欲），prurient detail（猥亵细节），prurient glance（好色的眼神），prurient material（淫秽内容）。在法律/新闻语境中也常与 obscenity（淫秽）讨论，但 prurient 更强调“激起或迎合低俗性欲/性好奇”。"]}
{"word":"pruriently","summary":{"en":"“Pruriently” means “in a lewd, sexually intrusive way,” often implying an unhealthy or excessive interest in sex.","zh":"“pruriently”表示“猥亵地、带有低俗性意味地”，常暗示对性有不健康或过度的兴趣。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows an unhealthy or excessive interest in sex; lewdly.","zh":"以一种对性有不健康或过度兴趣的方式；猥亵地。"},"examples":[{"en":"He stared pruriently at the model, making everyone uncomfortable.","zh":"他用猥亵的目光盯着模特，让在场的人都很不舒服。"},{"en":"The article was written pruriently to attract clicks rather than inform readers.","zh":"这篇文章以迎合低俗猎奇的方式写作，目的是吸引点击而不是提供信息。"}]}],"synonyms":["lewdly","lasciviously","salaciously"],"phonetic":"/ˈprʊriəntli/","extraExplanation":["“pruriently”来自形容词“prurient”（好色的、淫秽的）加副词后缀“-ly”。它常用于批评某种“窥淫式/猎奇式”的态度，语气偏负面，和“curiously（好奇地）”不同，强调的是不健康、令人反感的性兴趣。","常见搭配：look/stare/glance pruriently（猥亵地看）、smile pruriently（带着猥亵意味地笑）、written pruriently（以低俗猎奇方式写作）。在新闻、影评、社会评论里也常用来指“以性为噱头的内容”。"]}
{"word":"pruriginous","summary":{"en":"Pruriginous is a medical adjective meaning “itchy” or “causing itching.”","zh":"Pruriginous 是医学形容词，意思是“发痒的/引起瘙痒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) causing or relating to itching.","zh":"（医学）引起或与瘙痒有关的。"},"examples":[{"en":"The doctor described the rash as pruriginous and prescribed an anti-itch cream.","zh":"医生把这种皮疹描述为“pruriginous（引起瘙痒的）”，并开了止痒药膏。"},{"en":"Some allergies can lead to pruriginous skin irritation.","zh":"有些过敏会导致引起瘙痒的皮肤刺激。"}]}],"synonyms":["itchy","pruritic"],"phonetic":"/pruˈrɪdʒənəs/","extraExplanation":["“pruriginous”是较正式的医学用语，日常英语里更常说“itchy”（痒的）。在医生写病历或医学文章中更常见。","词源上与拉丁语“prurire（发痒）”有关；相关词包括“pruritus（瘙痒，名词）”。","常见搭配：pruriginous rash/eruption/lesions（瘙痒性皮疹/皮疹爆发/皮损）。"]}
{"word":"prurigo","summary":{"en":"Prurigo is a medical term for an intensely itchy skin condition with raised bumps or nodules.","zh":"Prurigo（痒疹）是医学术语，指一种瘙痒剧烈、伴随丘疹或结节的皮肤病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical term for a very itchy skin condition with small bumps or nodules (raised spots), often caused or worsened by scratching.","zh":"（医学）痒疹：一种非常瘙痒的皮肤病，常出现小丘疹或结节（隆起的疙瘩），往往因搔抓而加重。"},"examples":[{"en":"The dermatologist diagnosed her with prurigo and prescribed a cream to reduce the itching.","zh":"皮肤科医生诊断她为痒疹，并开了药膏来减轻瘙痒。"},{"en":"Scratching can make prurigo worse and lead to thicker, darker patches of skin.","zh":"搔抓会使痒疹加重，并可能导致皮肤变厚、变深色。"}]}],"synonyms":["pruritic rash","itchy skin eruption","prurigo nodularis (specific type)"],"phonetic":"/pruˈraɪɡoʊ/","extraExplanation":["“prurigo”来自拉丁语词根“prur-”，与“itch（痒）”相关；同源词包括“pruritus（瘙痒）”。","在医学语境里常见更具体的类型，如“prurigo nodularis（结节性痒疹）”。日常英语中不常用，更多出现在医生诊断、病历或医学科普文章中。"]}
{"word":"prurigos","summary":{"en":"“Prurigos” is the plural of “prurigo,” meaning itchy skin bumps or nodules.","zh":"“Prurigos”是“prurigo”的复数，指发痒的皮肤丘疹或结节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of prurigo: itchy skin bumps (papules or nodules) caused by long-lasting irritation or inflammation, often from scratching.","zh":"prurigo 的复数：一种会发痒的皮肤丘疹或结节，通常与长期刺激/炎症及抓挠有关。"},"examples":[{"en":"The dermatologist noted several prurigos on his arms and asked about allergies.","zh":"皮肤科医生注意到他手臂上有多处 prurigos，并询问是否有过敏史。"},{"en":"Scratching can make prurigos worse and lead to broken skin.","zh":"抓挠会让 prurigos 恶化，并可能导致皮肤破损。"}]}],"synonyms":["itchy bumps","itchy nodules","prurigo lesions"],"phonetic":"/prʊˈraɪɡoʊz/","extraExplanation":["“prurigo”是医学用语，来自拉丁语词根“prur-”，与“pruritus（瘙痒）”同源。日常英语里更常说“itchy bumps/itchy nodules（发痒的小疙瘩/结节）”。","在就医语境中，医生可能会提到“prurigo nodularis（结节性痒疹）”这一具体类型；它常与反复搔抓相关，治疗通常包括止痒、消炎以及避免诱发因素。"]}
{"word":"pruriousness","summary":{"en":"Pruriousness is likely a misspelling of prurience: an improper or excessive interest in sexual matters.","zh":"Pruriousness 很可能是 prurience 的拼写错误：指对性话题不恰当或过度的兴趣（常含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) the quality of having an unusually strong interest in sexual matters, especially in a way that feels inappropriate or overly curious.","zh":"（可能为拼写错误）指对性相关话题有过度、强烈的兴趣，常带有不恰当或窥探式的好奇。"},"examples":[{"en":"The article was written to inform, not to satisfy prurience.","zh":"这篇文章的目的在于科普信息，而不是迎合低俗的性好奇。"},{"en":"The film avoids prurience and treats the topic with respect.","zh":"这部电影避免卖弄情色，而是以尊重的方式处理这个话题。"}]}],"synonyms":["prurience","lewd curiosity","salaciousness","lustfulness"],"phonetic":"/ˈprʊriəns/","extraExplanation":["你输入的 **pruriousness** 在现代英语里很少见，通常被认为是把 **prurience**（名词）或 **prurient**（形容词）拼错了。常见搭配有：**prurient interest**（窥探式的性趣味）、**to pander to prurient tastes**（迎合低俗趣味）。","语体与语感：**prurient/prurience** 多用于较正式或评论性的语境（新闻评论、文学批评、法律/社会讨论），带明显负面评价，意思接近“低俗、窥淫”。"]}
{"word":"pruritic","summary":{"en":"Pruritic means “itchy,” used mainly in medical contexts (e.g., a pruritic rash).","zh":"pruritic 意为“瘙痒的”，主要用于医学语境（如“瘙痒性皮疹”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Itchy; causing or relating to itching, especially of the skin.","zh":"（医学）瘙痒的；引起或与瘙痒有关的（常指皮肤）。"},"examples":[{"en":"The patient has a pruritic rash on both arms.","zh":"病人两条手臂都有瘙痒性的皮疹。"},{"en":"Mosquito bites can become very pruritic at night.","zh":"蚊子叮咬在夜里可能会变得非常痒。"},{"en":"She used a mild cream to relieve the pruritic skin.","zh":"她用了温和的乳霜来缓解瘙痒的皮肤。"}]}],"synonyms":["itchy","itching","irritating (to the skin)","pruriginous (more technical)"],"phonetic":"/pruˈrɪtɪk/","extraExplanation":["“pruritic”是医学里常用的正式用词，日常英语更常说 itchy / itchy rash。","词源来自拉丁语 *prurire*（发痒）。在就医或药品说明中常见：pruritic rash（瘙痒性皮疹）、pruritic dermatitis（瘙痒性皮炎）。","发音提示：重音通常在第二音节（pru-RIT-ik）。"]}
{"word":"pruritus","summary":{"en":"Pruritus is the medical term for an itching sensation.","zh":"Pruritus 是“瘙痒/发痒感”的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an uncomfortable itching feeling on the skin (medical term for “itching”)","zh":"（医学）瘙痒；皮肤发痒的不适感"},"examples":[{"en":"After the mosquito bites, I had intense pruritus on my arms.","zh":"被蚊子叮咬后，我手臂上出现了强烈的瘙痒感。"},{"en":"The doctor asked whether the rash was painful or mainly pruritus.","zh":"医生询问这种皮疹是疼痛，还是主要以瘙痒为主。"},{"en":"Hot showers can sometimes make pruritus worse.","zh":"热水澡有时会让瘙痒更严重。"}]}],"synonyms":["itch","itching"],"phonetic":"/pruˈraɪtəs/","extraExplanation":["这是偏正式/医学用语，日常更常说 itch / itching（瘙痒）。在病历或说明书里常见：\"pruritus\" 可以单独出现，也常和部位搭配（如 pruritus of the scalp 头皮瘙痒）。","常见相关表达：pruritic（adj. 引起瘙痒的/瘙痒的）；anti-itch / antipruritic（止痒的）。","在医疗语境中，瘙痒可能与过敏、皮炎、皮肤干燥、虫咬或某些全身性问题有关；如果持续、严重或伴随黄疸/发热等症状，应就医。"]}
{"word":"prurituses","summary":{"en":"“Prurituses” is the plural of “pruritus,” meaning intense itching (a medical term).","zh":"“prurituses”是“pruritus”的复数，意思是（医学用语）瘙痒/强烈痒感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) intense itching of the skin; the sensation that makes you want to scratch.","zh":"（医学）瘙痒；使人想抓挠的皮肤强烈痒感。"},"examples":[{"en":"The doctor asked whether the patient had pruritus at night.","zh":"医生询问病人晚上是否有瘙痒感。"},{"en":"Certain soaps can trigger pruritus in people with sensitive skin.","zh":"某些肥皂会让皮肤敏感的人出现瘙痒。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “pruritus”: more than one case or type of itching.","zh":"“pruritus”的复数：多处或多种瘙痒（病例/症状）。"},"examples":[{"en":"The chart listed different prurituses with possible causes.","zh":"表格列出了不同类型的瘙痒及其可能原因。"},{"en":"He experienced prurituses on his arms and legs after hiking.","zh":"徒步后他的手臂和腿部出现了多处瘙痒。"}]}],"synonyms":["itching","itch","skin irritation","pruritus"],"phonetic":"/pruˈraɪtəsɪz/","extraExplanation":["“pruritus”是医学用语，常见于皮肤科或药品说明书中；日常英语里更常说“itching / an itch”。","“prurituses”是英语化的复数形式；在医学写作中也可能见到拉丁式复数“pruritus”不变（较少见，依写作风格而定）。","常见搭配：generalized pruritus（全身性瘙痒）、pruritus ani（肛门瘙痒）、pruritus of pregnancy（妊娠瘙痒）。"]}
{"word":"prus","summary":{"en":"“Prus” is mainly a name (a Polish surname), best known as the pen name of the writer Bolesław Prus.","zh":"“Prus”主要是人名（波兰姓氏），最著名的是作家博莱斯瓦夫·普鲁斯的笔名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Polish surname; most famously the pen name of the novelist Bolesław Prus (1847–1912).","zh":"一个波兰姓氏；最著名的是小说家博莱斯瓦夫·普鲁斯（Bolesław Prus，1847–1912）的笔名。"},"examples":[{"en":"Bolesław Prus is a major figure in Polish literature.","zh":"博莱斯瓦夫·普鲁斯是波兰文学的重要人物。"},{"en":"“Prus” is often used to refer to the author of The Doll.","zh":"“Prus”常用来指《玩偶》（The Doll）的作者。"}]}],"phonetic":"/pruːs/","extraExplanation":["“prus”本身不是常见英文单词，更常见是专有名词（人名/姓氏）。如果你想查的是国家/地区相关词，可能是拼写接近的“Prussia（普鲁士）”或“Prussian（普鲁士的）”。也可能是你想输入的其他英文单词，请告诉我你的语境（句子/领域），我可以帮你确认。"]}
{"word":"prusiano","summary":{"en":"Prussian means ‘of Prussia’ (a former German state) or a person from there; it can also suggest strict discipline traditionally associated with Prussia.","zh":"Prussian 指“普鲁士的/与普鲁士有关的”或“普鲁士人”；也可引申为带有普鲁士传统印象的严谨纪律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Prussia (a former German state) or its people, culture, or history; more generally, relating to traditional German militarism and strict discipline often associated with Prussia","zh":"与普鲁士（德国历史上的一个邦国/王国）或其人民、文化、历史有关的；也可泛指常被认为具有“普鲁士式”的严谨纪律与军国传统"},"examples":[{"en":"Prussian reforms helped modernize the state in the early 1800s.","zh":"19世纪初，普鲁士改革推动了国家的现代化。"},{"en":"Some writers describe the school system as having a Prussian sense of discipline.","zh":"有些作家形容这种学校制度带有“普鲁士式”的纪律感。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Prussia, or someone identified with Prussian culture","zh":"普鲁士人；与普鲁士文化相关的人"},"examples":[{"en":"He wrote about Prussians living in the eastern provinces.","zh":"他写到生活在东部省份的普鲁士人。"}]}],"synonyms":["of Prussia","Prussia-related"],"phonetic":"/ˈprʌʃən/","extraExplanation":["“Prusiano”是西班牙语/意大利语/葡萄牙语中“普鲁士的、普鲁士人”的说法；英语对应常用词是 **Prussian**。","历史上“普鲁士（Prussia）”曾是影响欧洲格局的重要强国，后来成为德意志统一的核心力量之一；现代地图上已不再作为国家存在。","常见文化词汇：**Prussian blue**（普鲁士蓝，一种深蓝色颜料/颜色）。"]}
{"word":"Prussia","summary":{"en":"Prussia was a historical German state/kingdom that strongly influenced German history, especially in the 19th century.","zh":"普鲁士是历史上的德国国家/王国，对德国历史影响深远，尤其在19世纪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former German state and kingdom (later a leading part of the German Empire), known for its strong military tradition and major role in the unification of Germany in the 1800s.","zh":"普鲁士：历史上的德国国家与王国（后来成为德意志帝国的主导力量之一），以强大的军国传统著称，并在19世纪德国统一中起关键作用。"},"examples":[{"en":"Prussia played a central role in the unification of Germany under Bismarck.","zh":"在俾斯麦的领导下，普鲁士在德国统一中起了核心作用。"},{"en":"After World War II, Prussia was officially dissolved as a political entity.","zh":"二战后，普鲁士作为政治实体被正式解散。"}]}],"synonyms":["Kingdom of Prussia (historical)"],"phonetic":"/ˈprʌʃə/","extraExplanation":["“Prussia”在英文里通常指历史地理与政治实体，并不等同于今天的某个国家；它的大部分领土后来分别并入现代德国、波兰、俄罗斯（加里宁格勒）等地。","英语里有时会用“Prussian”来形容与普鲁士相关的风格或气质（如纪律严明、强调军队与官僚体系），这种用法带有历史文化色彩，语境不同可能显得褒义或贬义。"]}
{"word":"prussia","summary":{"en":"Prussia is a historical German state, often linked in culture to discipline, bureaucracy, and military strength.","zh":"普鲁士是历史上的德意志国家，文化印象常与纪律、官僚体系和军事力量相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic German state and later a leading part of the German Empire, known for strong administration and a powerful military (especially from the 1700s to early 1900s).","zh":"普鲁士：历史上的德意志国家，后来成为德意志帝国的核心部分，以强大的行政体系与军事实力著称（尤其在18世纪至20世纪初）。"},"examples":[{"en":"Prussia played a major role in the unification of Germany in the 19th century.","zh":"普鲁士在19世纪德国统一过程中发挥了重要作用。"},{"en":"Many people associate Prussia with military discipline and strict bureaucracy.","zh":"许多人将普鲁士与军纪严明和严格的官僚体系联系在一起。"}]}],"synonyms":["historical German state","Kingdom of Prussia"],"phonetic":"/ˈprʌʃə/","extraExplanation":["“Prussia（普鲁士）”常被用来指一种历史形象：强调纪律、秩序与国家机器的高效运作，因此在英语里有时会出现“Prussian discipline（普鲁士式纪律）”“Prussian efficiency（普鲁士式效率）”等说法。","从地理与政治上看，普鲁士并不等同于今天的某一个国家或州；二战后相关领土被重新划分，“Prussia”作为政治实体在1947年被正式废除。"]}
{"word":"Prussian","summary":{"en":"Prussian most often means “related to Prussia,” and it can also refer to a Prussian person or the deep color known as Prussian blue.","zh":"Prussian最常指“与普鲁士有关的”；也可指普鲁士人，或指“普鲁士蓝”这种深蓝色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Prussia (a former German state) or its people, culture, or history","zh":"与普鲁士（德国历史上的一个国家/邦国）或其人民、文化、历史有关的"},"examples":[{"en":"The museum has a collection of Prussian military uniforms.","zh":"这家博物馆收藏了一批普鲁士军服。"},{"en":"He studies Prussian history in the nineteenth century.","zh":"他研究十九世纪的普鲁士历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Prussia","zh":"普鲁士人"},"examples":[{"en":"In the novel, the main character is a proud Prussian living in Berlin.","zh":"在小说里，主角是一位住在柏林、很自豪的普鲁士人。"}]},{"partOfSpeech":"adj.","definition":{"en":"a deep, dark blue color (as in “Prussian blue”)","zh":"（如“普鲁士蓝”）一种深而浓的蓝色"},"examples":[{"en":"She painted the night sky in Prussian blue.","zh":"她用普鲁士蓝画出了夜空。"},{"en":"Prussian blue is common in traditional prints and paintings.","zh":"普鲁士蓝在传统版画和绘画中很常见。"}]}],"synonyms":["Prussia-related","Prussian blue (color term)"],"phonetic":"/ˈprʌʃən/","extraExplanation":["“Prussian”来自“Prussia（普鲁士）”。普鲁士在18—19世纪对德意志统一、军事制度与官僚体系影响很大，因此英语里有时会出现“Prussian discipline（普鲁士式纪律）”这类说法，含义偏“严格、重秩序”。注意这是带历史文化色彩的概括，用于评价人或机构时语气可能显得刻板或带偏见，写作时要留意场合。","“Prussian blue（普鲁士蓝）”是一种著名颜料（深蓝色），18世纪初在欧洲被发现并广泛使用，在绘画与印染中很常见。"]}
{"word":"prussian","summary":{"en":"Prussian means “from or related to Prussia,” and can also mean a person from Prussia.","zh":"Prussian 意为“普鲁士的/与普鲁士有关的”，也可指“普鲁士人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Prussia, a former German state/kingdom (historically influential in what is now Germany and parts of Poland).","zh":"与普鲁士有关的；普鲁士的（普鲁士是历史上的德意志国家/王国，影响范围涵盖今德国及波兰部分地区）。"},"examples":[{"en":"The museum has a collection of Prussian military uniforms.","zh":"这家博物馆收藏了一批普鲁士军服。"},{"en":"In the 19th century, Prussian leadership played a major role in German unification.","zh":"在19世纪，普鲁士的领导力量在德意志统一中起了重要作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Prussia.","zh":"普鲁士人。"},"examples":[{"en":"He wrote about the life of a Prussian living in Berlin.","zh":"他写到一位住在柏林的普鲁士人的生活。"}]}],"synonyms":["of Prussia","Prussia-related"],"phonetic":"/ˈprʌʃən/","extraExplanation":["“Prussian”常出现在历史与政治语境中，尤其与普鲁士军国主义（militarism）、纪律严明的官僚体系，以及俾斯麦（Bismarck）时代的德意志统一相关。","在艺术与文化中，你可能会看到“Prussian blue（普鲁士蓝）”这种颜料名；它源自18世纪早期发现的一种深蓝色颜料，用于绘画与染色。"]}
{"word":"prussianisation","summary":{"en":"Prussianisation means the process of adopting Prussian-style (especially military and bureaucratic) organization and discipline.","zh":"Prussianisation 指“普鲁士化”：采用普鲁士式（尤指军事与官僚）的组织与纪律的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a place, institution, or group adopt Prussian (especially military and bureaucratic) ways of organization, discipline, or culture","zh":"“普鲁士化”：使某个地区、机构或群体采用普鲁士式（尤指军事与官僚体系）的组织方式、纪律或文化的过程"},"examples":[{"en":"Some historians describe the army reforms as a kind of Prussianisation of the state.","zh":"一些历史学家把这些军队改革称为国家的一种“普鲁士化”。"},{"en":"Critics feared that Prussianisation would encourage rigid hierarchy and unquestioning obedience.","zh":"批评者担心“普鲁士化”会助长僵化的等级制度和不加质疑的服从。"}]}],"synonyms":["Prussianization","militarization","bureaucratization","centralization"],"phonetic":"/ˌprʌʃənaɪˈzeɪʃən/","extraExplanation":["这个词多用于历史与政治语境，常带有评价色彩（往往偏负面），指向“强调军国主义、严格纪律、强中央集权、官僚效率”的普鲁士印象。","在19世纪德意志统一及其后德国政治制度的讨论中，“普鲁士化”常被用来描述普鲁士模式对其他德意志邦国的影响。","拼写上也常见作 Prussianization（美式拼写，-z-）；Prussianisation 为英式拼写（-s-）。"]}
{"word":"prussianise","summary":{"en":"Prussianise means to make something adopt Prussian-style discipline or institutions, often implying strict militaristic control.","zh":"Prussianise 指使某事物带上普鲁士式的制度与纪律特点，常暗含“严苛、军国主义化”的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something or someone Prussian in character, especially by adopting Prussian-style military discipline, government, or culture","zh":"使（某人或某事物）普鲁士化；尤指采用普鲁士式的军事纪律、政府制度或文化风格"},"examples":[{"en":"Some critics feared that the education system would be prussianised and become too strict.","zh":"一些批评者担心教育制度会被普鲁士化，变得过于严格。"},{"en":"The reform was described as an attempt to prussianise the army.","zh":"这项改革被形容为试图让军队普鲁士化。"}]}],"synonyms":["Prussianize","militarize","regiment","discipline","indoctrinate"],"phonetic":"/ˈprʌʃəˌnaɪz/","extraExplanation":["“prussianise”是英式拼写，美式更常写作“prussianize”。两者意思相同。","该词多见于历史或政治评论语境，常带有批评色彩，暗示“过度军国主义、等级森严、纪律至上”等联想。普鲁士（Prussia）在18–19世纪以强大的军队、官僚体系与严苛纪律著称。"]}
{"word":"prussianised","summary":{"en":"“Prussianised” means made more Prussian in style—often implying strict discipline or militaristic organization; it’s also the past form of “Prussianise.”","zh":"“Prussianised”指变得更具普鲁士风格（常含严格纪律或军事化组织的意味），也可作“Prussianise”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) having been made Prussian in character—especially in style, culture, discipline, or militaristic organization.","zh":"（英式拼写）被“普鲁士化”的——尤其指在风格、文化、纪律或军事化组织方式上变得像普鲁士。"},"examples":[{"en":"Some critics said the school system had become overly Prussianised, focusing on strict discipline.","zh":"一些批评者说学校体系变得过度普鲁士化，过分强调严格纪律。"},{"en":"The army was Prussianised by adopting Prussian training methods and ranks.","zh":"这支军队通过采用普鲁士式训练方法和军衔制度而被普鲁士化。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “Prussianise” (to make something more like Prussia, especially in a military or authoritarian way).","zh":"“Prussianise”的过去式/过去分词（使某事物更像普鲁士，尤指更军事化或更威权化）。"},"examples":[{"en":"The government gradually Prussianised the administration to improve efficiency.","zh":"政府逐步把行政体系普鲁士化，以提高效率。"}]}],"synonyms":["Prussianized","militarized","regimented","authoritarianized"],"phonetic":"/ˈprʌʃənˌaɪzd/","extraExplanation":["“普鲁士（Prussia）”历史上以高度军事化、纪律严明、官僚体系强而著称，因此“Prussianise/Prussianised”常带有批评意味，暗示过度强调服从、秩序与军国主义。","拼写提示：美式英语更常见 “Prussianized”；英式英语常见 “Prussianised”。"]}
{"word":"prussianiser","summary":{"en":"A “Prussianiser” is someone who tries to make people or institutions more Prussian/German, often through assimilation policies.","zh":"“Prussianiser”指推行普鲁士化/德意志化的人，常与同化政策和批评语气相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who promotes or carries out “Prussianisation” (making people, institutions, or culture more Prussian/German in character, especially through political or administrative pressure).","zh":"普鲁士化推行者；使他人/制度“普鲁士化”的人（指把人群、机构或文化变得更具普鲁士/德意志特征，常带政治或行政压力的意味）。"},"examples":[{"en":"In the 19th century, some officials were criticized as Prussianisers for forcing German language and laws on local communities.","zh":"在19世纪，一些官员因强制地方社群使用德语并遵循德方法律而被批评为“普鲁士化推行者”。"},{"en":"The newspaper accused the Prussianisers of weakening regional traditions.","zh":"报纸指责这些“普鲁士化推行者”削弱了地方传统。"}]}],"synonyms":["Germanizer","assimilationist","nationalizer"],"phonetic":"ˈprʌʃəˌnaɪzər","extraExplanation":["“Prussianiser”带明显的历史与政治语境，常用于讨论普鲁士王国/德意志帝国时期的同化政策（例如语言、教育、行政体系的统一），语气往往偏批评。","拼写上常见英式 -ise（prussianise, prussianiser），美式也可能见到 -ize（prussianize, prussianizer）。现代英语里这个词较少见，更常出现在历史写作或政治评论中。"]}
{"word":"prussianising","summary":{"en":"Prussianising means making something more Prussian in character, often implying militarization or strict authoritarian discipline.","zh":"Prussianising 指“普鲁士化”，常含“更军事化、更强调严格纪律或专制化”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something more Prussian in style—especially more militaristic, disciplined, or authoritarian (often used critically).","zh":"把某事物“普鲁士化”的行为或过程——尤指使其更军事化、更强调纪律或更专制（常带批评意味）。"},"examples":[{"en":"Critics warned that the reforms were Prussianising the school system by focusing too much on drill and obedience.","zh":"批评者警告说，这些改革正在让学校制度“普鲁士化”，过分强调操练与服从。"},{"en":"Some historians argue that rapid industrial growth risked Prussianising politics, strengthening the power of the military.","zh":"一些历史学家认为，快速的工业增长可能使政治“普鲁士化”，从而强化军方权力。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle/gerund of “Prussianise/Prussianize”: making something Prussian in character.","zh":"“Prussianise/Prussianize（普鲁士化）”的现在分词/动名词：使某物带有普鲁士特征。"},"examples":[{"en":"They accused the government of Prussianising the police force.","zh":"他们指责政府在把警察队伍“普鲁士化”。"},{"en":"The article describes a process of Prussianising administration across the region.","zh":"这篇文章描述了该地区行政体系被“普鲁士化”的过程。"}]}],"synonyms":["Prussianization","militarization","authoritarianization","regimentation"],"phonetic":"/ˈprʌʃənaɪzɪŋ/","extraExplanation":["“Prussianising/Prussianizing”多见于历史与政治评论语境，常用来批评某个制度向“普鲁士式”的军国主义、等级秩序、严格服从靠拢。普鲁士（Prussia）曾是德意志历史上的重要邦国，其军队与官僚体系在19世纪很有代表性。","拼写上英式常用 Prussianise，美式常用 Prussianize；“Prussianising”是英式 -ise 的现在分词形式。"]}
{"word":"prussianism","summary":{"en":"Prussianism means a Prussian-style ideology or attitude, often associated with strict discipline, obedience, and militarism.","zh":"Prussianism 指“普鲁士式”的思想或作风，常与严格纪律、服从权威和军国主义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief in, admiration for, or imitation of traditional Prussian qualities—especially strict discipline, obedience to authority, and militaristic values.","zh":"崇尚或模仿传统“普鲁士式”特质的思想或作风，尤其指严格纪律、服从权威与军国主义价值观。"},"examples":[{"en":"Some critics blamed the school’s harsh rules on Prussianism.","zh":"一些批评者把这所学校的严苛规定归咎于“普鲁士主义”。"},{"en":"The novel portrays Prussianism as pride in order and military power.","zh":"这部小说把“普鲁士主义”描写为对秩序与军事力量的自豪。"}]},{"partOfSpeech":"n.","definition":{"en":"A Prussian-like characteristic, style, or policy (often implying rigid formality).","zh":"具有普鲁士风格的特点、作风或政策（常含“刻板、僵硬”的贬义）。"},"examples":[{"en":"He spoke with a Prussianism that made the meeting feel like a drill.","zh":"他说话带着一种“普鲁士式”的僵硬，让会议像在操练。"}]}],"synonyms":["militarism","authoritarianism","rigidity","martial spirit"],"phonetic":"/ˈprʌʃənɪzəm/","extraExplanation":["“Prussianism”来自“Prussian（普鲁士的）+ -ism（主义/风格）”。普鲁士曾是德意志历史上的重要国家，以高效官僚体系、严格军纪和强调服从闻名，因此该词在英语里常带批评意味，指过度强调纪律与权威。","在历史与文学/政治评论中，它常被用来讨论德国军国主义传统，尤其在两次世界大战相关语境里更常见。"]}
{"word":"prussianization","summary":{"en":"Prussianization means the process of becoming more Prussian in character, often implying stronger German/Prussian influence and a more disciplined, militarized, or bureaucratic style.","zh":"Prussianization 指“普鲁士化”的过程，常含更强的德国/普鲁士影响，以及更强调纪律、军事化或官僚化的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a person, place, or institution more “Prussian” in style—especially more strongly German (often from Prussia), disciplined, and influenced by Prussian military or administrative traditions","zh":"“普鲁士化”：使某人、某地或某个机构更具“普鲁士”风格的过程——尤指变得更德国化（常指受普鲁士影响）、更强调纪律，并带有普鲁士的军事或官僚传统"},"examples":[{"en":"Some historians argue that the army encouraged the Prussianization of politics in the late 1800s.","zh":"一些历史学家认为，19世纪末军队推动了政治的普鲁士化。"},{"en":"The policy aimed at Prussianization by promoting German-language schooling.","zh":"该政策试图通过推广德语教育来实现普鲁士化。"}]}],"synonyms":["Germanization","militarization","bureaucratization","assimilation"],"phonetic":"/ˌprʌʃənaɪˈzeɪʃən/","extraExplanation":["“Prussianization”常出现在欧洲近代史语境中，尤其与普鲁士在德意志统一过程中的主导地位相关；也常用于讨论对非德语地区（如波兰部分地区）推行语言、教育与行政同化的政策。","词形结构：Prussian（普鲁士的）+ -ization（……化/使成为……的过程）。这种“-ization”名词通常表示“变化/转变的过程”（如 modernization 现代化）。","使用时有时带批评意味，暗示过度军事化、强硬的官僚管理或文化同化压力；具体褒贬取决于上下文。"]}
{"word":"prussianize","summary":{"en":"Prussianize means to make something adopt a strict, disciplined, Prussian-style (often militaristic) system or attitude.","zh":"prussianize 指“使……普鲁士化”，即让某事物呈现更严格、更强调纪律与等级、往往更军事化的风格。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone, something, or a system more like Prussia (especially in a strict, highly disciplined, militaristic way).","zh":"使……普鲁士化（尤指使某人、某事或制度更像普鲁士：更严格、更纪律化、更军事化）。"},"examples":[{"en":"Critics argued that the school system was being prussianized, with too much drill and obedience.","zh":"批评者认为学校体系正在被“普鲁士化”，过分强调操练和服从。"},{"en":"Some people feared the government would prussianize the police by expanding military-style training.","zh":"一些人担心政府会通过加强军事化训练来让警察“普鲁士化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to adopt Prussian-like methods or attitudes; to become more Prussian in style.","zh":"采用普鲁士式做法或态度；变得更具普鲁士风格（更强调纪律与等级）。"},"examples":[{"en":"After the defeat, the army began to prussianize in organization and command.","zh":"战败后，这支军队开始在组织和指挥上趋于普鲁士化。"}]}],"synonyms":["militarize","discipline","regiment","indoctrinate"],"phonetic":"/ˈprʌʃəˌnaɪz/","extraExplanation":["“Prussianize/Prussianise”源自历史上的普鲁士（Prussia）。在英语语境里，它常带有评价色彩，通常指“更严格、更等级分明、更军事化”的改革或倾向，不一定是中性词。","它常出现在政治史、教育史、军事史写作中，尤其与19世纪欧洲的军队改革、官僚制度与学校管理方式相关。"]}
{"word":"prussianized","summary":{"en":"Prussianized means made to adopt Prussian-style strict discipline, military organization, or rigid bureaucracy.","zh":"Prussianized 指被“普鲁士化”，即呈现普鲁士式的严纪律、军事化组织或僵硬的官僚控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past participle) Made to resemble Prussia or traditional “Prussian” culture, especially in strict military discipline, obedience, and bureaucracy.","zh":"（过去分词）被“普鲁士化”的；变得像普鲁士（传统印象中的）文化，尤指强调严格军纪、服从与官僚体系。"},"examples":[{"en":"The reforms were meant to create a more prussianized army with tighter discipline.","zh":"这些改革旨在打造一支更“普鲁士化”的军队，纪律更加严明。"},{"en":"Critics said the school system felt prussianized—too rigid and rule-bound.","zh":"批评者说这个学校体系显得“普鲁士化”——过于刻板、被规章束缚。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of prussianize) To make a country, organization, or system adopt Prussian-style military organization or strict administrative control.","zh":"（prussianize 的过去式/过去分词）使（国家、组织或制度）采取普鲁士式的军事组织方式或严格的行政控制。"},"examples":[{"en":"After the war, some leaders tried to prussianize the civil service.","zh":"战后，一些领导人试图让公务体系“普鲁士化”。"},{"en":"The new training program prussianized the recruits quickly.","zh":"新的训练项目很快把新兵训练得“普鲁士化”。"}]}],"synonyms":["militarized","regimented","bureaucratized","disciplined","indoctrinated"],"phonetic":"/ˈprʌʃəˌnaɪzd/","extraExplanation":["“普鲁士化（Prussianize）”里的“Prussian（普鲁士的）”常带有历史语感：在英语语境中，它往往不仅指地理上的普鲁士（Prussia），还暗示一种刻板印象——强调军国主义式的纪律、等级秩序、效率与服从。","该词常用于政治史、军事史或社会批评写作中，语气有时带贬义（暗示过度军事化/官僚化），但也可能是中性描述（指制度风格的转变）。"]}
{"word":"prussianizer","summary":{"en":"A (usually critical) word for someone who tries to make a system or society more “Prussian”—strict, militarized, and bureaucratic.","zh":"（多帶批評）指企圖把制度或社會變得更「普魯士式」的人——更嚴苛、更軍事化、更官僚化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who promotes or causes Prussianization (making something adopt “Prussian” traits, especially strict military discipline, rigid bureaucracy, or German/Prussian culture).","zh":"普魯士化推動者；使（某事物）採取「普魯士式」特徵的人（尤指嚴格軍紀、僵硬官僚體制或德國／普魯士文化）。"},"examples":[{"en":"Some critics called the reformers Prussianizers because they wanted stricter military discipline in schools.","zh":"一些批評者稱那些改革者為「普魯士化推動者」，因為他們想在學校引入更嚴格的軍事紀律。"},{"en":"The novelist portrays a Prussianizer who tries to reshape local traditions into a cold, uniform system.","zh":"小說描寫了一位「普魯士化推動者」，試圖把地方傳統改造成冷硬、整齊劃一的體制。"}]}],"synonyms":["Prussianizing advocate","militarizer","disciplinarian (approx.)","bureaucratizer (approx.)"],"phonetic":"/ˈprʌʃənaɪzər/","extraExplanation":["「Prussianizer」來自動詞 *Prussianize*（使普魯士化）+ 表示「做某事的人」的字尾 *-er*。","「普魯士（Prussia）」曾是德意志地區的重要國家，常被英語語境用來象徵強調軍國主義、紀律、服從與高效率官僚體系。因此這個詞在歷史／政治評論裡多帶批評或諷刺色彩。","現代日常英語中很少用到；更常見的是 *Prussianize* 或形容詞 *Prussian*（帶有普魯士式的、強調軍紀與秩序的）。"]}
{"word":"prussianizing","summary":{"en":"“Prussianizing” means making something more Prussian—strict, militarized, and highly disciplined, often as a criticism.","zh":"“prussianizing”指使某事物更“普鲁士化”——更严格、军事化、强调纪律，常带批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a person, group, or system more like Prussia, especially by promoting strict military discipline, obedience, and centralized control (often used critically).","zh":"使个人、群体或制度变得更“普鲁士化”，尤指强化严格的军队式纪律、服从和集权控制（常带批评意味）。"},"examples":[{"en":"Critics warned that the new school rules were prussianizing education, valuing obedience over curiosity.","zh":"批评者警告说，新校规在把教育“普鲁士化”，把服从看得比好奇心更重要。"},{"en":"The novelist describes a society slowly prussianizing under constant drills and surveillance.","zh":"这位小说家描写了一个在持续操练与监控下逐渐“普鲁士化”的社会。"}]}],"synonyms":["militarizing","regimenting","disciplining","centralizing"],"phonetic":"/ˈprʌʃənaɪzɪŋ/","extraExplanation":["“Prussianizing”来自“Prussianize（普鲁士化）”。普鲁士（Prussia）在18—19世纪以强大的军国主义、严密的官僚体系和强调纪律的教育/军队体系著称，因此该词在英语里常用于批评某种制度变得过度军事化、等级森严或强调服从。","语气提示：它通常不是中性词，带有“过分强硬、僵化”的暗示；在写作中多见于政治评论、历史讨论或文学中对社会控制的描写。"]}
{"word":"prussians","summary":{"en":"“Prussians” usually means people from Prussia (historical Germany) or things related to Prussia; it can also imply strict, military-style discipline in older usage.","zh":"“Prussians”通常指普鲁士人或与普鲁士有关的事物；在较旧用法中也可引申为“军国式、纪律严苛”的作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Prussia (a former German state), or relating to Prussia; historically used especially for the powerful Prussian military and government.","zh":"普鲁士人；（与）普鲁士（旧日德意志邦国）有关的。历史语境中常指强大的普鲁士军队与政府。"},"examples":[{"en":"In many 19th-century histories, the Prussians are portrayed as highly disciplined soldiers.","zh":"在许多19世纪的史书里，普鲁士人常被描写为纪律严明的士兵。"},{"en":"French and Prussian forces fought in the Franco-Prussian War (1870–1871).","zh":"法国与普鲁士军队在普法战争（1870—1871）中交战。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or connected with Prussia; often suggesting strict discipline or military efficiency (especially in older writing).","zh":"普鲁士的；与普鲁士相关的；（尤见于较旧写作）常带有“严厉、纪律森严、军国式高效”的意味。"},"examples":[{"en":"He criticized the school’s Prussian discipline.","zh":"他批评那所学校带有“普鲁士式”的严苛纪律。"},{"en":"The novel depicts a Prussian officer’s rigid sense of duty.","zh":"小说刻画了一位普鲁士军官刻板而强烈的责任感。"}]}],"synonyms":["Prussian people","Prussian","Prussia-related"],"phonetic":"/ˈprʊʃənz/","extraExplanation":["“Prussia（普鲁士）”曾是中欧重要的国家/邦国势力，尤其以军队与行政体系闻名。1871年德意志帝国建立后，普鲁士在其中占主导；二战后“普鲁士”作为政治实体在1947年被正式废除。因此现代语境里更多是历史、文化或比喻用法。","写作中把某种作风称为“Prussian”常是一种隐喻，强调“严厉、刻板、军事化”，有时带批评语气；使用时注意语境与语气，避免把它当作对现代德国人的一般描述。"]}
{"word":"prussiate","summary":{"en":"“Prussiate” is an old chemistry term for certain cyanide-based salts, especially potassium ferrocyanide or ferricyanide.","zh":"“prussiate”是旧式化学用语，指某些氰基相关的盐，尤指铁氰化钾或铁氰酸钾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt of prussic acid (hydrocyanic acid), especially a ferrocyanide such as potassium ferrocyanide (\"yellow prussiate\") or potassium ferricyanide (\"red prussiate\")","zh":"（普鲁士酸／氢氰酸的）盐，尤指铁氰化物，如铁氰化钾（“黄血盐”）或铁氰酸钾（“红血盐”）"},"examples":[{"en":"In older chemistry books, potassium ferrocyanide is often called the yellow prussiate of potash.","zh":"在较早的化学书中，铁氰化钾常被称为“钾的黄血盐（yellow prussiate of potash）”。"},{"en":"The recipe mentioned a prussiate used to produce a deep blue pigment.","zh":"配方中提到用一种“普鲁士盐”来制备深蓝色颜料。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat or prepare (something) with a prussiate; to add a ferrocyanide/ferricyanide (rare, historical usage)","zh":"用普鲁士盐处理或配制（某物）；加入铁氰化物／铁氰酸盐（较罕见、偏历史用法）"},"examples":[{"en":"The paper was prussiated to make it sensitive for early photographic printing.","zh":"这种纸经过加入铁氰化物处理，用于早期的感光印制。"}]}],"synonyms":["ferrocyanide","ferricyanide","potassium ferrocyanide","potassium ferricyanide"],"phonetic":"/ˈprʌsiˌeɪt/","extraExplanation":["“prussiate”是较旧的化学用词，现代更常直接说 ferrocyanide（铁氰化物）或 ferricyanide（铁氰酸盐）。","它与“Prussian blue（普鲁士蓝）”有关：铁氰化物/铁氰酸盐与铁盐反应可生成著名的深蓝色颜料，因此在染料、颜料和早期摄影（如蓝晒 cyanotype）等历史语境中会出现。","常见固定搭配包括：yellow prussiate of potash（黄血盐＝铁氰化钾）与 red prussiate of potash（红血盐＝铁氰酸钾）。"]}
{"word":"prussic","summary":{"en":"“Prussic” means “related to prussic (hydrocyanic) acid,” a very poisonous substance.","zh":"“prussic”意为“与普鲁士酸（氢氰酸）有关的”，常用于化学/毒理语境，强调其剧毒性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to prussic acid (hydrocyanic acid), a highly poisonous chemical compound.","zh":"与普鲁士酸（氢氰酸）有关的；指一种毒性极强的化学物质。"},"examples":[{"en":"The lab manual warned that prussic acid fumes can be deadly.","zh":"实验手册警告说，普鲁士酸的蒸气可能致命。"},{"en":"Some plants can release prussic compounds when damaged.","zh":"有些植物在受损时会释放含“普鲁士酸”性质的化合物。"}]}],"synonyms":["hydrocyanic (acid-related)","cyanide-related"],"phonetic":"/ˈprʌsɪk/","extraExplanation":["“prussic”来自“Prussia（普鲁士）”。早期这种酸曾从“普鲁士蓝（Prussian blue）”相关材料中制得，因此得名。","现代化学中更常用的名称是“hydrocyanic acid（氢氰酸）”或“cyanide（氰化物）”相关术语；在日常英语里“prussic”较少见，多见于化学/毒理学语境。","常见搭配：prussic acid（普鲁士酸/氢氰酸）。阅读安全说明时看到该词通常意味着“剧毒”，需要格外注意。"]}
{"word":"prussification","summary":{"en":"Prussification means making something more ‘Prussian,’ especially more militarized, disciplined, and authoritarian (often a critical term).","zh":"Prussification 指“普鲁士化”，即让事物更具普鲁士式特征，尤指更军国化、更强调纪律与服从、更加威权（常含批评）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a person, group, or society more like Prussia—especially by adopting strict military discipline, authoritarian government, or a highly organized state system (often used critically).","zh":"“普鲁士化”：使个人、群体或社会更像（旧）普鲁士的过程——尤指采用严格的军国纪律、威权式治理或高度组织化的国家体制（常带批评意味）。"},"examples":[{"en":"Some critics warned that the new school rules were a kind of prussification, focusing more on obedience than creativity.","zh":"一些批评者警告说，新校规是一种“普鲁士化”，更强调服从而不是创造力。"},{"en":"After the war, people debated whether the country’s politics had undergone prussification.","zh":"战后，人们争论这个国家的政治是否经历了“普鲁士化”。"}]},{"partOfSpeech":"n.","definition":{"en":"the spread of Prussian influence or style (administration, education, or culture) into another region, institution, or country.","zh":"普鲁士影响或风格（如行政、教育或文化）向其他地区、机构或国家扩散的现象。"},"examples":[{"en":"Historians sometimes describe the prussification of the army as a turning point in state-building.","zh":"历史学家有时把军队的普鲁士化描述为国家建构的转折点。"},{"en":"The novel criticizes the prussification of public life, where uniforms and rank matter more than empathy.","zh":"这部小说批评公共生活的普鲁士化：制服与等级比同理心更重要。"}]}],"synonyms":["militarization","regimentation","authoritarianization","bureaucratization"],"phonetic":"/ˌprʊsɪfɪˈkeɪʃən/","extraExplanation":["“Prussification”来自“Prussia（普鲁士）+ -ification（……化）”。普鲁士在18—19世纪以军队效率、官僚体系与强调服从的社会文化形象著称，因此该词常用于批评“军国主义化”“纪律至上”“国家机器高度化”等倾向。","在历史写作中，它有时与“Germanization（德意志化）”并列出现，但侧重点不同：prussification更强调普鲁士式的军事/行政风格，而Germanization更偏语言与民族文化同化。"]}
{"word":"prussify","summary":{"en":"Prussify means to make something more Prussian—especially more strict, militarized, and authoritarian.","zh":"Prussify 指使某事物更“普鲁士化”，尤指更严格、军事化、威权化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something more Prussian in character, especially by promoting strict discipline, militarism, or authoritarian organization","zh":"使（人或事物）更具普鲁士风格，尤指加强严格纪律、军国主义或威权式组织管理"},"examples":[{"en":"Some critics said the reforms would prussify the education system, turning schools into rigid institutions.","zh":"一些批评者说这些改革会把教育体系“普鲁士化”，让学校变得刻板僵硬。"},{"en":"After the defeat, the government tried to prussify the army by copying Prussian training methods.","zh":"战败后，政府试图通过模仿普鲁士的训练方式来“普鲁士化”军队。"}]}],"synonyms":["militarize","regiment","discipline","authoritarianize","bureaucratize"],"phonetic":"/ˈprʌsəˌfaɪ/","extraExplanation":["“prussify”来自“Prussia（普鲁士）”。在英语里它常带批评或担忧的语气，暗示把制度变得过度军事化、等级森严、服从命令。","它多用于政治、教育、军队或官僚机构等语境，而不常用于日常生活描述。"]}
{"word":"prussin","summary":{"en":"Prussian = relating to Prussia or its people; also a person from Prussia.","zh":"Prussian = 与普鲁士及其人民相关的；也可指普鲁士人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Prussia (a former German state) or its people, culture, or history.","zh":"与普鲁士（昔日德国的一个邦国）及其人民、文化或历史有关的。"},"examples":[{"en":"Prussian military traditions influenced many European armies.","zh":"普鲁士的军事传统影响了许多欧洲军队。"},{"en":"He studied Prussian history in college.","zh":"他在大学学习过普鲁士史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Prussia.","zh":"普鲁士人；来自普鲁士的人。"},"examples":[{"en":"In the novel, the Prussians are described as highly disciplined.","zh":"在小说里，普鲁士人被描写得非常守纪律。"}]}],"synonyms":["Prussia-related","German (historical context)"],"phonetic":"/ˈprʌʃən/","extraExplanation":["你输入的“prussin”更常见的拼写是 **Prussian**（普鲁士的/普鲁士人）。英语里也有词组 **Prussian blue**（普鲁士蓝，一种深蓝色颜料/颜色），在艺术与化学语境中很常见。","“Prussia/普鲁士”在历史上与近代德国的形成密切相关；在英语文本里，“Prussian”常带有“严谨、纪律严明”的文化联想，尤其出现在军事或官僚体系的描写中。"]}
{"word":"prussine","summary":{"en":"“Prussine” is a rare/old spelling of “Prussian,” meaning related to Prussia.","zh":"“Prussine”是“Prussian（普鲁士的）”的罕见/旧式拼写，表示与普鲁士有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) A variant spelling of “Prussian”; relating to Prussia (a former German state) or its people, culture, or military tradition.","zh":"（罕见/古体）“Prussian（普鲁士的）”的异体拼写；指与普鲁士（昔日德国的一个邦国）及其人民、文化或军事传统有关的。"},"examples":[{"en":"Some older texts use “Prussine” where modern English would write “Prussian.”","zh":"一些较旧的文本会用“Prussine”，而现代英语通常写作“Prussian”。"},{"en":"The museum has a collection of Prussian (sometimes spelled Prussine) uniforms and medals.","zh":"这家博物馆收藏了一批普鲁士（有时拼作 Prussine）的军服和勋章。"}]}],"synonyms":["Prussian"],"phonetic":"/ˈprʌʃən/","extraExplanation":["“Prussine”在现代英语中几乎不用，多见于旧书、旧译名或不规范拼写。学习与考试写作时建议使用标准拼写“Prussian”。","普鲁士（Prussia）在欧洲历史中影响很大，常与“Prussian discipline（普鲁士式纪律）”“Prussian militarism（普鲁士军国主义）”等表达相关。也有常见词组“Prussian blue（普鲁士蓝，一种颜料/颜色）”。"]}
{"word":"prut","summary":{"en":"“Prut” most commonly refers to the Prut River in Eastern Europe.","zh":"“Prut”最常见的意思是指东欧的普鲁特河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Prut River, a river in Eastern Europe that flows through (or along) Ukraine, Moldova, and Romania and then joins the Danube","zh":"普鲁特河（Prut River），东欧一条河流，流经（或沿着）乌克兰、摩尔多瓦与罗马尼亚，最后汇入多瑙河"},"examples":[{"en":"The Prut River forms part of the border between Romania and Moldova.","zh":"普鲁特河构成了罗马尼亚与摩尔多瓦之间的部分边界。"},{"en":"They crossed the Prut on their way south toward the Danube.","zh":"他们在南下前往多瑙河的路上渡过了普鲁特河。"}]}],"synonyms":["Prut River"],"phonetic":"/pruːt/","extraExplanation":["“Prut”在英语里通常作为专有名词使用，指“普鲁特河”。如果你本来想查的是别的词（例如拼写相近的 *prude* / *proud* / *brut* 等），告诉我上下文句子，我可以帮你确认。","词名来源与当地语言有关（该地区历史上受多种语言与文化影响），英文中一般直接采用地名的转写形式“Prut”。"]}
{"word":"pruta","summary":{"en":"“Pruta” is a Swedish verb meaning “to haggle or bargain (over the price).”","zh":"“pruta”是瑞典语动词，意思是“讨价还价（砍价）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Swedish) to bargain or haggle, especially over the price in a shop or market.","zh":"（瑞典语）讨价还价，尤其指在商店或市场对价格进行砍价。"},"examples":[{"en":"In some markets, it’s normal to pruta before you buy something.","zh":"在一些市场里，买东西前讨价还价是很常见的。"},{"en":"She tried to pruta, but the seller said the price was fixed.","zh":"她想砍价，但卖家说价格是固定的。"}]}],"synonyms":["haggle","bargain","negotiate"],"phonetic":"/ˈpruːtə/","extraExplanation":["“pruta”不是常见英语单词，更像是瑞典语动词。你可能会在谈到北欧生活、旅行购物或讨论当地习惯时看到它。","英语里对应的常用说法是：haggle / bargain / negotiate (the price)。在多数英语国家的正规商店里不常砍价，但在跳蚤市场、二手交易或部分旅游市场可以尝试。"]}
{"word":"prutah","summary":{"en":"Prutah means a tiny amount of money; historically it was the smallest unit of Israeli currency in older usage.","zh":"Prutah 指很少的钱；历史上它曾是以色列（旧用法中）的最小货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small amount of money; historically, the smallest unit of currency in Israel (especially in older texts)","zh":"极少量的钱；（历史上）以色列货币的最小单位（多见于较旧的文本）"},"examples":[{"en":"He didn’t have a prutah to his name.","zh":"他身无分文。"},{"en":"In older writings, prices were sometimes listed in prutot (plural of prutah).","zh":"在一些较旧的文字里，价格有时会用 prutot（prutah 的复数）来标注。"}]}],"synonyms":["penny (informal)","cent","small change","a pittance"],"phonetic":"/ˈpruːtə/","extraExplanation":["prutah（复数常见作 prutot）来自希伯来语，常出现在历史、宗教或文学语境中。现代以色列使用“新谢克尔”，prutah/旧的“agora”等小面额单位更多是历史用法。","在英语里，prutah 有时被借用来强调“非常少的钱”，用法类似于 not a penny / not a cent。"]}
{"word":"prutenic","summary":{"en":"“Prutenic” is a rare historical word meaning “Prussian; relating to old Prussia or the Old Prussian people/language.”","zh":"“Prutenic”是罕见的历史用语，意为“普鲁士的；与古普鲁士或古普鲁士人/语言有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, historical) Relating to Prussia or the old Prussian people/language; Prussian.","zh":"（罕见，历史用语）与普鲁士或古普鲁士人/语言有关的；普鲁士的。"},"examples":[{"en":"Some early scholars used the term “Prutenic” when discussing the Prussian language.","zh":"一些早期学者在讨论普鲁士语时会使用“Prutenic”这个词。"},{"en":"The book contains a brief note on Prutenic history in the Baltic region.","zh":"这本书对波罗的海地区的普鲁士（Prutenic）历史做了简短说明。"}]}],"synonyms":["Prussian","Old Prussian","Baltic (in some contexts)"],"phonetic":"/pruːˈtɛnɪk/","extraExplanation":["“prutenic”是非常少见的古旧词，常见于早期英文学术写作中，来自拉丁语词根（如 *Prutenus/Pruteni*），大致指“普鲁士/古普鲁士”。现代英语里通常直接用 **Prussian**。","注意区分：历史上的“古普鲁士人/普鲁士语”（波罗的海语族）与后来的“普鲁士王国/普鲁士人”（多为德语文化与国家概念）在语境上可能不同；作者使用“Prutenic”时有时是为了强调“古普鲁士”的含义。","如果你是在文献中看到这个词，也可能是印刷/拼写变体；可以对照上下文是否在谈 Baltic、Old Prussian、Teutonic Order（条顿骑士团）等主题。"]}
{"word":"prutot","summary":{"en":"“Prutot” is most likely a misspelling of French “plutôt,” meaning “rather; instead; preferably.”","zh":"“prutot”很可能是法语“plutôt”的拼写错误，意思是“宁可；更；而是；最好”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Likely) the French word “plutôt” (often misspelled as “prutot”): means “rather; instead; preferably.” It’s used to correct yourself or express a preference.","zh":"（很可能）是法语“plutôt”（常被拼错成“prutot”）：表示“宁可；更；而是；最好”。常用于自我纠正或表达偏好。"},"examples":[{"en":"It’s not red—rather, it’s orange. (French: Ce n’est pas rouge, plutôt orange.)","zh":"它不是红色——更准确说是橙色。（法语：Ce n’est pas rouge, plutôt orange.）"},{"en":"I’d rather stay home tonight. (French: Je préfère plutôt rester à la maison ce soir.)","zh":"我今晚宁可待在家。（法语：Je préfère plutôt rester à la maison ce soir.）"}]}],"synonyms":["rather","instead","preferably","more accurately"],"phonetic":"/plyˈtoʊ/","extraExplanation":["“prutot”不是标准的英语单词，也不是标准的法语拼写；最常见的目标词是法语“plutôt”（带重音符号：ô）。","在法语里，“plutôt”常用来：1）表达偏好（= rather / preferably）；2）纠正说法（= or rather / more precisely）；3）在口语中用于委婉加强语气，类似“挺/蛮……的”。","如果你想查的是英语单词，请把它放进一句话里，或告诉我你想表达的意思，我可以帮你确定正确拼写。"]}
{"word":"prutoth","summary":{"en":"“prutoth” is not a recognized English word; it likely needs context or is a misspelling.","zh":"“prutoth”不是常见英语词；多半需要上下文判断或是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a made-up word.","zh":"不是标准英语单词，可能是拼写错误、人名/地名，或自造词。"},"examples":[{"en":"“Prutoth” doesn’t appear in major English dictionaries—could you share the sentence you saw it in?","zh":"“prutoth”在主要英语词典中查不到——你能把它出现的句子发我吗？"},{"en":"If you meant “truth,” the spelling is t-r-u-t-h.","zh":"如果你想写“truth（真相）”，正确拼写是 t-r-u-t-h。"}]}],"phonetic":"/ˈpruːtɔθ/","extraExplanation":["我没找到“prutoth”作为常见英文词的来源或用法。它更像是拼写打错（例如 truth、prototype、proto-…），或是专有名词（人名/网名/游戏里的词）。","你可以告诉我：1) 你看到它的上下文句子；2) 你想表达的中文意思；3) 是否来自游戏/小说/课程/社交媒体。这样我能更准确判断它对应的词与含义。"]}

