{"word":"pry","summary":{"en":"“Pry” means either to snoop into private matters or to force something open with leverage.","zh":"“pry”既可表示打探隐私、窥探，也可表示用工具或力量把东西撬开。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to try to find out someone’s private information by asking questions in an intrusive way; to snoop","zh":"打探（隐私）；窥探；刺探"},"examples":[{"en":"I don’t want to pry, but are you feeling okay?","zh":"我不想多问，但你还好吗？"},{"en":"He was prying into her personal life at work.","zh":"他在工作场合打听她的私生活。"},{"en":"The neighbors keep prying, so she avoids talking about her family.","zh":"邻居总爱打听，所以她避免谈自己的家庭。"}]},{"partOfSpeech":"v.","definition":{"en":"to force something open or move it using a tool (like a lever) or strong pressure","zh":"撬开；用杠杆撬动；硬掰开"},"examples":[{"en":"They pried the window open with a screwdriver.","zh":"他们用螺丝刀把窗户撬开了。"},{"en":"He pried the lid off the paint can.","zh":"他把油漆桶盖撬开了。"}]}],"synonyms":["snoop","nose around","poke into","lever","force open"],"phonetic":"/praɪ/","extraExplanation":["“pry”既可指“打探隐私”（带有不礼貌、越界的语气），也可指“用工具撬开”。表达“我不想多问，但……”时常用固定搭配：“I don’t want to pry, but …”，用于礼貌地引出敏感问题。","常见搭配：pry into (someone’s life/affairs) 打探；pry open 撬开；pry (something) loose 把……撬松/撬下来。"]}
{"word":"pryer","summary":{"en":"“Pryer” usually means a nosy person who pries into others’ private business; it can also be an old spelling meaning “a person who prays.”","zh":"“pryer”通常指爱打听隐私的窥探者；也可作旧式拼写表示“祈祷者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who prays; someone devoted to prayer (an older or less common spelling of “prayer” in this sense).","zh":"祈祷者；祷告的人（较旧或较少见的拼写，用来表示“prayer”的人这一含义）。"},"examples":[{"en":"In the quiet chapel, a lone pryer knelt by the front pew.","zh":"在安静的小教堂里，一位祈祷者独自跪在前排长椅旁。"},{"en":"She was known in the village as a sincere pryer who visited the sick.","zh":"村里人都知道她是一位真诚的祈祷者，常去探望病人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who pries into other people’s private matters; a nosy intruder (from “pry”).","zh":"爱打听隐私的人；窥探者、好事者（源自动词“pry”，表示打探/窥探）。"},"examples":[{"en":"Don’t be a pryer—give them some privacy.","zh":"别做爱打听的人——给他们一点隐私。"},{"en":"Reporters were accused of being pry​ers after the accident.","zh":"事故之后，一些记者被指责为窥探者。"}]}],"synonyms":["busybody","nosy person","intruder","meddler","a person who prays"],"phonetic":"/ˈpraɪ.ər/","extraExplanation":["“pryer”有两条常见来源：一条是“prayer（祈祷）”的旧式拼写，用来指“祈祷的人”；另一条来自动词“pry（窥探/撬开）”，指“爱打听隐私的人”。阅读时可通过语境判断：宗教、教堂、祷告等语境多为第一义；隐私、八卦、记者、窥探等语境多为第二义。","现代英语中，表示“祈祷的人”更常用“someone who prays”或“a person of prayer”，而“pryer”更容易被理解为“爱窥探的人”。写作时若要避免歧义，建议选用更明确的表达。"]}
{"word":"pryers","summary":{"en":"“Pryers” means people who pry into others’ private matters (snoopers).","zh":"“pryers”指爱打探别人隐私的人（窥探者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “pryer”: a person who pries—someone who is overly curious about other people’s private affairs; a snoop.","zh":"“pryer”的复数：爱打探隐私的人；爱窥探、爱多管闲事的人；窥探者。"},"examples":[{"en":"I don’t share much online because there are always pryers looking for personal details.","zh":"我不太在网上分享，因为总有爱打探隐私的人在找个人信息。"},{"en":"The neighbors were such pryers that we stopped talking about our plans outside.","zh":"邻居太爱窥探了，我们就不在外面谈计划了。"}]}],"synonyms":["snoopers","busybody","nosy people","meddlers"],"phonetic":"/ˈpraɪɚz/","extraExplanation":["“pryers”比较少见，更常见的拼写与用法是单数“pryer”或更口语的“snoop / busybody”。","很多学习者会把“pryers”看成“prayers（祈祷，祷告）”。两者发音、意思都不同：pryers 来自动词 pry（撬开/打探），而 prayers 来自 prayer（祈祷）。如果你想表达“祈祷”，正确拼写通常是 prayers。"]}
{"word":"prying","summary":{"en":"“Prying” most often means nosy or intrusive about private matters; it can also be the -ing form of “pry,” meaning to investigate closely or to force something open.","zh":"“prying”最常指对隐私爱打探、爱窥探（带负面意味）；也可作动词“pry”的-ing形式，表示探查或用工具撬开。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"trying to find out private information in a curious or intrusive way; nosy","zh":"（对他人隐私）爱打探的；窥探的；爱管闲事的"},"examples":[{"en":"She gave him a prying look when he mentioned his salary.","zh":"他提到薪水时，她用一种爱打探的眼神看着他。"},{"en":"I don’t like prying questions about my personal life.","zh":"我不喜欢别人问那些打探我私生活的问题。"},{"en":"Stop prying into other people’s business.","zh":"别去打探别人的事。"}]},{"partOfSpeech":"v.","definition":{"en":"to look closely and carefully, often to discover something hidden; to investigate","zh":"仔细查看；探查；（常指）想发现隐藏信息"},"examples":[{"en":"He was prying into the old box to see what was inside.","zh":"他仔细翻看那个旧盒子，想看看里面有什么。"},{"en":"Reporters started prying after the rumor spread.","zh":"谣言传开后，记者开始探查。"}]},{"partOfSpeech":"v.","definition":{"en":"to force something open or move it using leverage (like a tool or your hands)","zh":"撬开；撬动（用杠杆原理或工具）"},"examples":[{"en":"They were prying the window open with a screwdriver.","zh":"他们用螺丝刀把窗户撬开。"},{"en":"He pried the lid off the paint can.","zh":"他把油漆罐的盖子撬开了。"}]}],"synonyms":["nosy","intrusive","meddlesome","inquisitive","pry","probe"],"phonetic":"/ˈpraɪ.ɪŋ/","extraExplanation":["“prying”常见两种用法：一是形容词（prying questions / prying eyes），语气多为负面，表示“爱窥探隐私”；二是动词 pry 的现在分词，用在进行时（be prying）或作定语（prying hands）也可以。","和“curious”不同：curious更中性，表示“好奇”；prying强调“越界、打扰、侵犯隐私”的感觉。","动词 pry 还有“用工具撬开”的字面意思，所以在写作里会借用这一意象：pry into secrets（像撬开东西一样去探人秘密）。"]}
{"word":"pryingly","summary":{"en":"“Pryingly” means “in a prying/nosy way,” often suggesting unwanted curiosity about private matters.","zh":"“pryingly”表示“以爱窥探/爱打听的方式”，常含贬义，指对他人隐私过度好奇。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an annoyingly curious way; in a way that tries to find out private information.","zh":"（以）爱打听、爱窥探的方式；（以）探听隐私、刺探消息的方式。"},"examples":[{"en":"She asked pryingly about my salary, so I changed the subject.","zh":"她用爱打听的语气问我的薪水，所以我换了话题。"},{"en":"He looked at the documents pryingly, as if searching for secrets.","zh":"他窥探般地看着那些文件，好像在找秘密。"}]}],"synonyms":["nosily","intrusively","meddlesomely"],"phonetic":"/ˈpraɪ.ɪŋ.li/","extraExplanation":["“pryingly”来自动词“pry”（撬开、探查）引申出的“prying”（爱窥探的、爱打听的）。它常带有负面评价，暗示越界、冒犯隐私。","日常英语里更常用“prying”作形容词（a prying question / prying eyes），或用短语表达：“in a prying way / nosily”。“pryingly”相对少见、偏书面。","近义词对比：nosily 更口语、强调“多管闲事”；intrusively 更正式、强调“侵入/打扰”；curiously 可能是中性“好奇”，不一定有冒犯。"]}
{"word":"pryingness","summary":{"en":"“Pryingness” means nosy curiosity—being too interested in other people’s private matters.","zh":"“Pryingness”指爱打听、爱窥探他人私事的性格（偏贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too interested in other people’s private business; nosy curiosity","zh":"爱打听、爱窥探他人私事的性格；好管闲事的好奇心"},"examples":[{"en":"Her pryingness made her coworkers uncomfortable.","zh":"她爱打听的性格让同事感到不舒服。"},{"en":"He apologized for his pryingness and promised to respect their privacy.","zh":"他为自己爱窥探道歉，并承诺尊重他们的隐私。"},{"en":"Pryingness can damage trust in a friendship.","zh":"爱打听可能会破坏友谊中的信任。"}]}],"synonyms":["nosiness","intrusiveness","meddlesomeness","curiosity (often negative in this context)"],"phonetic":"/ˈpraɪɪŋnəs/","extraExplanation":["“pryingness”由形容词/动名词“prying”（爱打听的、窥探的）+ 名词后缀“-ness”构成，表示“这种性质/状态”。","这个词在日常英语中不算常见；更常用的说法是“nosiness”或直接用“prying”来形容人（例如：a prying neighbor）。","语气通常偏负面，暗含“越界、不尊重隐私”的意思。"]}
{"word":"pryler","summary":{"en":"“Pryler” is rare/nonstandard; it likely means “a nosy person who pries into others’ business.”","zh":"“pryler”很少见、偏非标准；多半想表达“爱打听别人私事的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A person who pries—someone who tries to find out other people’s private information; a nosy person.","zh":"（非标准/很少见）爱打听隐私的人；爱窥探、爱探听的人。"},"examples":[{"en":"Stop being such a pryler—her personal life is none of our business.","zh":"别这么爱打听了——她的私生活不关我们的事。"},{"en":"He’s known around the office as a pryler who always asks awkward questions.","zh":"在办公室里，他以爱问尴尬问题的“爱打听的人”出名。"}]}],"synonyms":["prier","nosy person","snoop","busybody"],"phonetic":"ˈpraɪlər","extraExplanation":["“pryler”不是常见标准英语单词，更可能是拼写错误或临时造词。英语里更常用的说法是 **prier**（爱打听的人）或短语 **a nosy person / a snoop**。","如果你想表达动词“撬开/打探”，通常用 **pry**：*pry open the lid*（把盖子撬开）；*pry into someone’s life*（打探别人的生活）。","如果你本来想查的是别的词（例如 **prowler** 指“潜行者/徘徊的可疑之人”），告诉我你看到它的上下文句子，我可以帮你确认正确拼写与意思。"]}
{"word":"pryproof","summary":{"en":"Pryproof means resistant to being forced open by prying.","zh":"pryproof 指“防撬的”，不容易被撬开。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to resist being forced open with a tool (like a crowbar) or by someone trying to pry it open; hard to open by prying.","zh":"（设计成）防撬的；不易被撬开或用工具强行打开的。"},"examples":[{"en":"The safe has a pryproof door and reinforced hinges.","zh":"这个保险箱有防撬门和加固的铰链。"},{"en":"Choose a pryproof lock if you’re storing valuables.","zh":"如果你要存放贵重物品，选防撬锁更合适。"},{"en":"They installed pryproof window frames to improve security.","zh":"他们安装了防撬窗框来提高安全性。"}]}],"synonyms":["pry-resistant","tamper-resistant","break-in resistant","burglar-resistant"],"phonetic":"/ˈpraɪˌpruːf/","extraExplanation":["“pryproof”更常见的写法是“pry-proof”（带连字符），也常用“pry-resistant / tamper-resistant（防撬/防拆）”来表达类似意思。","这个词多见于安防、锁具、门窗、保险箱、电子设备外壳、包装等产品说明中。"]}
{"word":"prys","summary":{"en":"“Prys” is mainly used as a Welsh male given name (related to “Rhys”), not a common English word.","zh":"“Prys”主要作为威尔士男性人名（与“Rhys”相关），并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Welsh masculine given name, often treated as a variant spelling related to “Rhys.”","zh":"威尔士男性名字，常被视为与“Rhys”相关的变体拼写。"},"examples":[{"en":"Prys is a Welsh name you might see in Wales or in Welsh literature.","zh":"Prys 是一个威尔士名字，你可能会在威尔士或威尔士文学作品中见到。"},{"en":"His name is Prys, but some people assume it’s spelled Rhys.","zh":"他叫 Prys，但有些人会以为写作 Rhys。"}]}],"synonyms":["Rhys (related name)"],"phonetic":"/prɪs/","extraExplanation":["“Prys”在日常英语里并不是常见单词，更常见的是作为人名（尤其与威尔士名字“Rhys”相关）。如果你原本想查的是动词“pry”（撬开、打探），它的第三人称单数是“pries”，不是“prys”。你也可能想查“prize / price / prays（pray 的三单）”等相近拼写。"]}
{"word":"pryse","summary":{"en":"“Pryse” is a rare, archaic or nonstandard spelling usually meaning “prize/price.” In modern English, use “prize” or “praise” depending on your meaning.","zh":"“pryse”是很少见的古体/非标准拼写，通常相当于“prize/price”。现代英语中应根据意思使用“prize”或“praise”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/archaic) a variant spelling of “prize” or “price,” meaning value or a reward; also used as a verb meaning to value or to win a prize.","zh":"（非标准/古体拼写）“prize”或“price”的异拼，指“价值”或“奖品/奖励”；作动词可指“珍视”或“赢得奖品”。"},"examples":[{"en":"In some older texts, you may see “pryse” where modern English uses “prize.”","zh":"在一些较旧的文本里，你可能会看到用“pryse”来表示现代英语的“prize”。"},{"en":"He sought the pryse for his bravery. (archaic style)","zh":"他为自己的勇敢寻求奖赏。（古体风格）"}]}],"synonyms":["prize","price","reward","value"],"phonetic":"/praɪz/","extraExplanation":["“pryse”在现代英语中几乎不用，最常见的情况是：1）古英语/中古英语或方言拼写；2）把“praise”（赞美）拼错成“pryse”。如果你想表达“赞美”，请用“praise”；如果你想表达“奖品/奖励”或“珍视”，请用“prize”。"]}
{"word":"prytaneum","summary":{"en":"A prytaneum was an ancient Greek civic building that kept the sacred public hearth and hosted honored guests; the term is also used in names of some modern French institutions.","zh":"Prytaneum 指古希腊保存公共圣火并接待贵宾的城邦礼仪建筑；该词也用于部分现代法国机构（如军校）名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a public building that served as a city’s ceremonial center, where the sacred public hearth (fire) was kept and where honored guests and certain officials were hosted or dined at public expense.","zh":"（古希腊）市政礼仪中心建筑，保存城邦的公共圣火（公共炉火），并由城邦出资接待贵宾或供部分官员用餐的场所。"},"examples":[{"en":"In Athens, the Prytaneum housed the city’s sacred hearth and welcomed official guests.","zh":"在雅典，Prytaneum 保存着城邦的圣火，并接待官方来宾。"},{"en":"Some winners were granted meals at the Prytaneum as a public honor.","zh":"一些获胜者被授予在 Prytaneum 享用公费餐食的荣誉。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some modern contexts) a name used for certain institutions, especially in France, such as a state or military school (e.g., the Prytanée National Militaire).","zh":"（现代部分语境）某些机构的名称用法，尤指法国的一些学校或军事学校（如 Prytanée National Militaire）。"},"examples":[{"en":"He studied at the Prytanée National Militaire in France.","zh":"他曾在法国的 Prytanée National Militaire（国立军校）就读。"}]}],"synonyms":["prytaneion","civic hearth hall","ceremonial civic building"],"phonetic":"/ˌprɪtəˈniːəm/","extraExplanation":["词源来自希腊语 prytaneion，与 prytanis（“执政官/主席”一类的城邦官员）有关。Prytaneum 往往象征城邦共同体：公共炉火代表“城市的家”。","在阅读古典文献或历史学著作时，你可能会把它类比为“城市的仪式性市政厅/国宾馆+公共食堂”，但它带有强烈的宗教与象征意义，不完全等同于现代市政厅。"]}
{"word":"prytanis","summary":{"en":"Prytanis is a historical term for an ancient Greek presiding official or chief magistrate, especially in Athens.","zh":"Prytanis 是历史用语，指古希腊的主持官/首席官员，尤与雅典的议会轮值主席制度相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an official (in ancient Greece) who served as a chief magistrate or presiding officer, especially the head of a council or committee in a city-state such as Athens","zh":"（古希腊）执政官/主席官；尤指城邦（如雅典）议会或委员会的主持者、首席官员"},"examples":[{"en":"In classical Athens, a prytanis could preside over meetings of the council for a limited term.","zh":"在古典雅典，prytanis 可以在有限任期内主持议会的会议。"},{"en":"The inscription lists the names of the prytaneis who served that year.","zh":"铭文列出了当年任职的 prytaneis（prytanis 的复数）的名字。"}]}],"synonyms":["presiding officer","chief magistrate","chair (historical context)"],"phonetic":"ˈprɪtənɪs","extraExplanation":["这个词来自希腊语 prýtanis（πρύτανις）。在雅典民主制度中，常见的是复数 prytaneis，指由“部族（phyle）”轮值产生的一组主席官，负责安排议程、主持会议、处理日常政务；其轮值期也叫 prytany。不同城邦的具体职权会有差异。","读古典史或考古铭文时常遇到该词；现代英语里属于历史/学术用语，日常交流很少使用。"]}
{"word":"prytanize","summary":{"en":"“Prytanize” is a rare historical verb meaning to appoint someone as a prytanis (a presiding magistrate) in ancient Greece.","zh":"“prytanize”是一个罕见的历史动词，指在古希腊城邦中任命某人为普律塔尼斯（轮值主持/执政官）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, historical) To make someone a prytanis (a chief magistrate/presiding official) in an ancient Greek city-state; to appoint or install as prytanis.","zh":"（罕见；历史用语）使某人成为“普律塔尼斯”（古希腊城邦的首席执政/轮值主席）；任命（某人）为普律塔尼斯。"},"examples":[{"en":"In the inscription, the council voted to prytanize him for the coming month.","zh":"在那段铭文中，议会投票任命他在下个月担任普律塔尼斯。"},{"en":"Some scholars use “prytanize” to describe the act of placing a citizen in the presiding office.","zh":"一些学者用“prytanize”来描述让某位公民担任主持职务的行为。"}]}],"synonyms":["appoint","install","designate"],"phonetic":"/ˈprɪtənˌaɪz/","extraExplanation":["“prytanize”不是现代英语里的常用词，更常见的是名词/相关词：prytanis（普律塔尼斯，执政官/主席）、prytany（其任期/主席团制度）、Prytaneion（普律塔尼翁，城邦的公共会堂/官邸，常与公共宴饮、圣火等仪式相关）。","词源背景：prytanis 来自古希腊语 πρύτανις（prýtanis）。在雅典，prytaneis（复数）常指议会中轮值主持事务的一组成员；因此该动词多见于学术写作、译注或对古代制度的说明。","如果你本来想拼的是“privatize”（私有化），拼写和意思都不同：privatize = 把公有的变为私有。你也可以告诉我你的语境，我可以帮你确认要找的词。"]}
{"word":"prytany","summary":{"en":"Prytany is an ancient Athenian term for a rotating governing period (about one-tenth of a year) or, less commonly, the officials who presided during that period.","zh":"Prytany（普律塔尼）是古雅典用语，指轮值执政的一个任期单位（约一年十分之一），较少见时也可指该任期内的主持官员团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Athens) A period of about one-tenth of a year during which one tribal committee of the Council (the Boule) served as the presiding group in government.","zh":"（古雅典）“普律塔尼”（prytany）：约占一年十分之一的任期单位，在此期间，议事会（Boule）中某一部族的委员会担任政府的轮值主持团。"},"examples":[{"en":"The decree is dated to the third prytany of the year.","zh":"这项法令的日期被标注为该年度的第三个普律塔尼。"},{"en":"Each tribe took its turn, one prytany at a time, to manage daily business.","zh":"各部族轮流执政，每次以一个普律塔尼为单位处理日常政务。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The office, leadership, or body of officials (the prytaneis) who held that rotating presiding role.","zh":"（较少见）担任轮值主持职责的职位、领导权，或该组官员（普律塔尼/普律塔尼们，prytaneis）。"},"examples":[{"en":"The prytany announced the agenda for the assembly meeting.","zh":"普律塔尼主持团公布了公民大会的会议议程。"},{"en":"Under the prytany, officials handled urgent matters between assemblies.","zh":"在普律塔尼主持团任内，官员们会在两次公民大会之间处理紧急事务。"}]}],"synonyms":["term of office","presidency","administrative period"],"phonetic":"ˈprɪtəni","extraExplanation":["“prytany”源自希腊语，常见于研究雅典民主制度的历史与铭文学（碑铭）中。雅典把一年分成10个普律塔尼（后期可能有调整），对应10个部族的轮值执政安排。","你可能也会见到相关词：prytaneis（复数，指轮值主持的官员们）、Boule（五百人议事会）、ecclesia（公民大会）。这些词多用于古典学/历史语境，现代英语日常很少用。"]}
{"word":"prythee","summary":{"en":"“Prythee” is an archaic form of “please,” meaning “I pray thee.”","zh":"“prythee”是古语，相当于“please（请）”，原意为“I pray thee（我恳求你）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(archaic) A polite way to say “please,” originally meaning “I pray thee.”","zh":"（古语）一种客气地说“请”的方式，原意是“我恳求你 / 我请求你”（I pray thee）。"},"examples":[{"en":"Prithee, tell me the truth.","zh":"请你告诉我真相。"},{"en":"Prithee, good sir, grant me a moment.","zh":"先生，劳驾给我一点时间。"}]}],"synonyms":["please","pray","kindly"],"phonetic":"/ˈprɪði/","extraExplanation":["“prithee / prythee”是早期现代英语（常见于莎士比亚时代）里的礼貌请求语，相当于今天的“please”。拼写不固定：你会看到 prithee、prythee、’prithee 等。","词源上来自 “I pray thee”（我恳求你）。其中 thee 是古英语里的“你”（宾格/受格），带有古典、戏剧化的语感。","在现代写作中通常用于营造古风、戏剧或幽默的腔调；日常英语对话里几乎不用。"]}

