{"word":"Pt","summary":{"en":"“PT” is a common abbreviation; it often means physical training, part-time, patient (medical), or platinum (chemical symbol), depending on context.","zh":"“PT”是常见缩写，常见含义有体育训练、兼职、患者（医疗记录中）或铂（化学符号），需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “physical training,” usually referring to exercise class or fitness training (often in schools or the military).","zh":"“physical training（体育训练）”的缩写，通常指体能训练课或军队/学校的体能训练。"},"examples":[{"en":"We have PT every Friday morning.","zh":"我们每周五早上都有体能训练（PT）。"},{"en":"He missed PT because he was sick.","zh":"他因为生病错过了体能训练（PT）。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “part-time,” meaning working fewer hours than a full-time job.","zh":"“part-time（兼职）”的缩写，指工作时间少于全职。"},"examples":[{"en":"I’m looking for a PT job while I’m in college.","zh":"我上大学期间想找一份兼职（PT）工作。"},{"en":"She works PT at a café on weekends.","zh":"她周末在咖啡馆做兼职（PT）。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “patient,” used in medical notes to mean a person receiving medical care.","zh":"“patient（病人/患者）”的缩写，常见于医疗记录中。"},"examples":[{"en":"The PT reports less pain today.","zh":"病人（PT）表示今天疼痛减轻了。"},{"en":"Please verify the PT’s name and date of birth.","zh":"请核对患者（PT）的姓名和出生日期。"}]},{"partOfSpeech":"other","definition":{"en":"chemical symbol for platinum (a valuable metal).","zh":"铂（白金）的化学元素符号。"},"examples":[{"en":"This ring is made of Pt, not silver.","zh":"这枚戒指是铂（Pt）做的，不是银的。"}]}],"synonyms":["physical training","part-time","patient","platinum"],"phonetic":"/piː tiː/","extraExplanation":["“PT”在英语里最常见的是缩写，所以具体意思强烈依赖语境：学校/军队里多指 physical training；求职或排班语境常指 part-time；医院或病历里常指 patient；化学或珠宝语境则是铂 platinum。","读法通常按字母读：P-T。正式写作时最好首次出现写全称（physical training / part-time 等），之后再用 PT。"]}
{"word":"pt","summary":{"en":"“pt/PT” is a common abbreviation. Most often it means physical therapy/physical therapist, points (pts), Pacific Time (PT), or pint (pt).","zh":"“pt/PT”是常见缩写，最常指物理治疗/物理治疗师、分数（pts）、太平洋时间（PT）或品脱（pt）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for physical therapy (treatment to improve movement and reduce pain) or physical therapist","zh":"“physical therapy/physical therapist”的缩写：物理治疗；物理治疗师"},"examples":[{"en":"After the injury, my doctor sent me to PT.","zh":"受伤后，医生让我去做PT（物理治疗）。"},{"en":"She works in a clinic as a PT.","zh":"她在诊所当物理治疗师（PT）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for point(s), used in math, games, scores, and measurements","zh":"“point(s)”的缩写：分；点（常用于成绩、比赛、测量等）"},"examples":[{"en":"He scored 30 pts in the game.","zh":"他在比赛中拿了30分（pts）。"},{"en":"Add 2 pts for each correct answer.","zh":"每答对一题加2分（pts）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for Pacific Time (the time zone on the west coast of the U.S. and Canada)","zh":"“Pacific Time”的缩写：太平洋时间（美国/加拿大西海岸时区）"},"examples":[{"en":"The meeting starts at 10 a.m. PT.","zh":"会议在太平洋时间上午10点开始（PT）。"},{"en":"Please submit it by 5 p.m. PT.","zh":"请在太平洋时间下午5点前提交（PT）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for pint (a unit of volume, especially in the U.S. and U.K.)","zh":"“pint”的缩写：品脱（容量单位，美制/英制常见）"},"examples":[{"en":"I’d like a pt of ice cream.","zh":"我想要一品脱冰淇淋（pt）。"},{"en":"The recipe calls for 1 pt of milk.","zh":"食谱需要1品脱牛奶（pt）。"}]}],"synonyms":["physical therapy","physical therapist","points","Pacific Time","pint"],"phonetic":"/piː tiː/","extraExplanation":["“pt/PT”在英语里多为缩写，具体含义强烈依赖语境：医疗场景常指物理治疗（PT）；比分/作业评分常见pts；时间安排里常见PT（Pacific Time）。","大小写有时能提示含义：PT更常表示时区或物理治疗；pt/pts更常见于单位或“分数”。"]}
{"word":"PTA","summary":{"en":"“PTA” most commonly means the Parent-Teacher Association; it can also mean Physical Therapist Assistant or (less commonly) “prior to arrival.”","zh":"“PTA”最常见意思是“家长教师协会”；也可指“物理治疗师助理”，或较少见地表示“到达之前”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Parent-Teacher Association: an organization in a school where parents and teachers work together to support students and improve the school (often by volunteering or fundraising).","zh":"家长教师协会：学校里由家长与教师共同参与的组织，用来支持学生并改善学校（常通过志愿服务或筹款）。"},"examples":[{"en":"The PTA is holding a fundraiser to buy new library books.","zh":"家长教师协会（PTA）正在举办筹款活动，给图书馆买新书。"},{"en":"I joined the PTA to get more involved in my child’s school.","zh":"我加入了家长教师协会（PTA），想更多参与孩子的学校事务。"}]},{"partOfSpeech":"n.","definition":{"en":"Physical Therapist Assistant (also written “physical therapy assistant”): a healthcare worker who helps a physical therapist provide treatment and exercises to patients.","zh":"物理治疗师助理：在医疗机构中协助物理治疗师为病人进行康复训练与治疗的人。"},"examples":[{"en":"She works as a PTA in a rehabilitation clinic.","zh":"她在一家康复诊所当物理治疗师助理（PTA）。"},{"en":"The PTA guided the patient through simple stretching exercises.","zh":"物理治疗师助理（PTA）带着病人做了一些简单的拉伸练习。"}]},{"partOfSpeech":"phrase","definition":{"en":"Prior to arrival: used in travel or logistics to mean “before arriving.”","zh":"到达之前：在旅行或物流语境中表示“到达前”。"},"examples":[{"en":"Please complete the form PTA to speed up check-in.","zh":"请在到达之前（PTA）填写表格，以加快办理入住/登机手续。"}]}],"synonyms":["PTO (parent-teacher organization)"],"phonetic":"/ˌpiː tiː ˈeɪ/","extraExplanation":["在美国学校语境里，PTA 最常指“Parent-Teacher Association（家长教师协会）”。有些学校也用 PTO（Parent-Teacher Organization）来指类似的家校组织，但是否隶属全国性协会、组织结构等可能不同。","在医疗领域，PTA 也常见且很正式，指 Physical Therapist Assistant。根据上下文（学校/医院/邮件通知）通常可以判断是哪一种意思。"]}
{"word":"pta","summary":{"en":"PTA is an initialism most commonly meaning Parent-Teacher Association; it can also mean Physical Therapist Assistant or, less commonly, “prior to arrival.”","zh":"PTA 是一个缩略词，最常见指“家长教师协会”；也可指“物理治疗助理”，较少见时表示“到达前”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Parent-Teacher Association: a school-related organization of parents, teachers, and staff that supports students and school programs.","zh":"家长教师协会：由家长、教师和学校人员组成的组织，用来支持学生与学校活动。"},"examples":[{"en":"My mom volunteered at the PTA to help plan the school fair.","zh":"我妈妈在家长教师协会当志愿者，帮忙策划学校义卖会。"},{"en":"The PTA raised money for new library books.","zh":"家长教师协会为新图书馆书籍筹款。"}]},{"partOfSpeech":"n.","definition":{"en":"Physical Therapist Assistant: a healthcare worker who assists a physical therapist in helping patients improve movement and manage pain.","zh":"物理治疗助理：协助物理治疗师帮助病人改善活动能力、缓解疼痛的医疗人员。"},"examples":[{"en":"She works as a PTA in a rehabilitation clinic.","zh":"她在一家康复诊所做物理治疗助理。"},{"en":"The PTA guided him through simple exercises after surgery.","zh":"术后，物理治疗助理带他做一些简单的练习。"}]},{"partOfSpeech":"other","definition":{"en":"prior to arrival (less common): used in travel or shipping to mean “before arriving.”","zh":"到达前（较少见）：在旅行或运输语境中表示“到达之前”。"},"examples":[{"en":"Please complete the form PTA so check-in is faster.","zh":"请在到达前填写表格，这样办理入住会更快。"},{"en":"The hotel emailed instructions PTA.","zh":"酒店在到达前发邮件发来了说明。"}]}],"synonyms":["Parent-Teacher Association (PTA)","Parent Teacher Organization (PTO)","Physical Therapist Assistant"],"phonetic":"/ˌpiː tiː ˈeɪ/","extraExplanation":["“PTA”多为首字母缩略词，读作字母音“P-T-A”。具体含义要看语境：在学校里最常见的是 Parent-Teacher Association；在医疗行业常见的是 Physical Therapist Assistant；旅行/物流里偶尔会把 PTA 写作 prior to arrival。正式写作中第一次出现时常会先写全称再写缩写。"]}
{"word":"Ptah","summary":{"en":"Ptah is an ancient Egyptian creator god, strongly linked with craftsmanship and the city of Memphis.","zh":"Ptah（普塔）是古埃及的重要创世神，与工匠技艺和孟菲斯城关系密切。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Egyptian religion, Ptah is a major god of creation, craftsmanship, and architecture, especially associated with the city of Memphis.","zh":"在古埃及宗教中，普塔（Ptah）是重要的创世之神，也主掌工匠技艺与建筑，尤其与孟菲斯城密切相关。"},"examples":[{"en":"In the museum, we saw a statue of Ptah holding symbols of stability and life.","zh":"在博物馆里，我们看到一尊普塔的雕像，手持象征稳定与生命的符号。"},{"en":"Some texts describe Ptah as creating the world through thought and speech.","zh":"一些文献描述普塔以“思想与言语”创造世界。"}]}],"synonyms":["Egyptian creator god","Memphite god"],"phonetic":"/tɑː/","extraExplanation":["“Ptah”是专有名词，常见读法里开头的p不发音，听起来接近“tah”。","在“孟菲斯神学”（Memphite theology）中，普塔被描写为以“心（思想）”与“舌（言语）”创造万物，这一点在埃及神话体系中很有特色。","普塔也常与工匠、金工、石匠等职业联系在一起；在文化语境里，提到他往往带有“创造力、技艺、建造”的意味。"]}
{"word":"ptarmic","summary":{"en":"Ptarmic means “causing sneezing.”","zh":"ptarmic 意为“引起打喷嚏的；催嚏的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing sneezing; having a sneezing effect.","zh":"引起打喷嚏的；有催嚏作用的。"},"examples":[{"en":"Pepper can be ptarmic if you breathe in a lot of it.","zh":"如果吸入很多胡椒粉，它可能会有催嚏作用。"},{"en":"The ptarmic smell of the strong spice made him sneeze.","zh":"浓烈香料的催嚏气味让他打了个喷嚏。"}]}],"synonyms":["sternutatory","sneeze-inducing","irritating"],"phonetic":"/ˈtɑrmɪk/","extraExplanation":["“ptarmic”是较少见的词，多用于较正式或文学/医学语境，意思就是“会让人打喷嚏的”。","词源来自希腊语 *ptarmos*（打喷嚏）。你也可能见到相关词：*ptarmigan*（雷鸟）这个词的开头 *ptar-* 也和“喷嚏”有关，但“雷鸟”并不是“催嚏”的意思。"]}
{"word":"ptarmica","summary":{"en":"Ptarmica is a plant (Achillea ptarmica), known as sneezewort, with small white flowers and a history in herbal use.","zh":"Ptarmica 指一种植物（Achillea ptarmica），俗称喷嚏草，开白色小花，传统上有草药用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant (Achillea ptarmica), also called sneezewort, with small white daisy-like flowers; traditionally used in herbal medicine and sometimes to make people sneeze","zh":"一种开白色小菊状花的植物（学名 Achillea ptarmica），又称“喷嚏草/打喷嚏草”（sneezewort）；传统草药中曾用作药用或用来引发打喷嚏"},"examples":[{"en":"The garden border was planted with ptarmica for its delicate white blooms.","zh":"花坛边缘种了 ptarmica，因为它开出细致的白花。"},{"en":"In old herbal texts, ptarmica is mentioned as a plant that can cause sneezing.","zh":"在一些古老的草药书里，ptarmica 被提到可能会让人打喷嚏。"}]}],"synonyms":["sneezewort","Achillea ptarmica"],"phonetic":"/tɑrˈmaɪkə/","extraExplanation":["“Ptarmica”常见于植物学或园艺语境，现代英语里更常用名称是“sneezewort（喷嚏草）”或直接用学名“Achillea ptarmica”。","词源与希腊语有关：与“打喷嚏”相关的词根（ptarm-）提示它曾被认为能刺激鼻腔引发喷嚏，这也是 sneezewort 这个俗名的来历。","如果你在文学或自然写作中遇到它，通常是在描写草地、野花、药草知识或乡村花园的植物名录。"]}
{"word":"ptarmical","summary":{"en":"Ptarmical means “causing sneezing,” but it’s very rare in modern English.","zh":"ptarmical 指“引起打喷嚏的”，但在现代英语中非常罕见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Causing sneezing; related to sneezing.","zh":"（罕见）引起打喷嚏的；与打喷嚏有关的。"},"examples":[{"en":"Some strong perfumes can have a ptarmical effect on people with allergies.","zh":"一些浓烈的香水会让过敏体质的人产生“引发喷嚏”的反应。"},{"en":"The dusty room felt ptarmical, and I couldn’t stop sneezing.","zh":"这间满是灰尘的房间让人一直想打喷嚏，我停不下来。"}]}],"synonyms":["sneeze-inducing","sneezing","nasal-irritating"],"phonetic":"/ˈtɑrmɪkəl/","extraExplanation":["“ptarmical”非常少见，日常英语里通常不用。更常见的表达是：sneeze-inducing（会引发喷嚏的）、makes you sneeze（让你打喷嚏的）、irritating to the nose（刺激鼻子的）。","它来自与“打喷嚏”相关的词根（如 ptarmic），与“ptarmigan（雷鸟）”不是同一个词；ptarmigan 是一种鸟名，虽然拼写相似但意思完全不同。"]}
{"word":"ptarmigan","summary":{"en":"A cold-region grouse that turns white in winter.","zh":"生活在寒冷地区、冬季会变白的松鸡类鸟（雷鸟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bird in the grouse family that lives in cold northern or mountain regions and changes its feathers to white in winter for camouflage.","zh":"雷鸟（一种松鸡科鸟类，生活在寒冷的北方或高山地区，冬季羽毛会变白以便伪装）。"},"examples":[{"en":"We spotted a ptarmigan near the snowy ridge.","zh":"我们在积雪的山脊附近看见了一只雷鸟。"},{"en":"In winter, the ptarmigan’s white feathers help it blend into the snow.","zh":"冬天，雷鸟的白色羽毛帮助它融入雪地。"}]}],"synonyms":["grouse","rock ptarmigan","willow ptarmigan","white-tailed ptarmigan"],"phonetic":"/ˈtɑrmɪɡən/","extraExplanation":["发音提示：这个词的 p 不发音，读起来像 “TAR-mi-gən”。","词源小知识：ptarmigan 来自苏格兰盖尔语，意思与“雷鸟/松鸡类”相关；英语保留了不发音的 p，常让学习者困惑。","文化与语境：ptarmigan 常见于北极圈、阿拉斯加、加拿大或高山地带的自然纪录片与户外文学中，常被用来象征耐寒、隐蔽与季节变化。"]}
{"word":"ptarmigans","summary":{"en":"Ptarmigans are cold-region grouse; “ptarmigans” is the plural form.","zh":"Ptarmigans 指生活在寒冷北方地区的雷鸟；该词为复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of grouse (a chicken-like wild bird) that lives in cold northern regions; in plural, “ptarmigans” means more than one ptarmigan.","zh":"雷鸟（类似野鸡的野生鸟类），生活在寒冷的北方地区；复数“ptarmigans”指多只雷鸟。"},"examples":[{"en":"Ptarmigans turn white in winter to blend in with snow.","zh":"雷鸟在冬天会变成白色，以便和雪地融为一体。"},{"en":"We spotted a group of ptarmigans near the rocky ridge.","zh":"我们在岩石山脊附近看到一群雷鸟。"},{"en":"In Alaska, ptarmigans are common in tundra landscapes.","zh":"在阿拉斯加，雷鸟在苔原地貌中很常见。"}]}],"synonyms":["grouse","game bird"],"phonetic":"/ˈtɑrmɪɡən/","extraExplanation":["“ptarmigan”的词首字母 p 不发音，读音更像“TAR-mi-gən”。","它们在不同季节会换羽色（冬白、夏褐/灰），这是适应环境、躲避天敌的保护色策略。","常见搭配：rock ptarmigan（岩雷鸟）、willow ptarmigan（柳雷鸟/白尾雷鸟）；两者都是北极/亚北极地区常见种类。"]}
{"word":"pte","summary":{"en":"PTE most commonly means the Pearson Test of English, an English proficiency exam; it can also be a context-dependent abbreviation in other fields.","zh":"PTE最常指培生英语考试（英语能力考试）；也可能是其他领域的缩写，需结合上下文理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pearson Test of English: a standardized English-language proficiency exam often used for study, work, or immigration applications.","zh":"培生英语考试：一种标准化英语能力考试，常用于留学、工作或移民申请。"},"examples":[{"en":"I’m taking the PTE next month for my university application.","zh":"我下个月要考PTE，用于大学申请。"},{"en":"Some countries accept PTE scores for visa purposes.","zh":"一些国家接受PTE成绩用于签证申请。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation used in different fields; its meaning depends on the context (for example, education or job titles).","zh":"一个在不同领域会出现的缩写；具体含义取决于上下文（例如教育或职位名称）。"},"examples":[{"en":"In this document, PTE refers to Professional and Technical Education.","zh":"在这份文件里，PTE指的是“职业与技术教育”。"},{"en":"Please define PTE at first use so readers know what it means.","zh":"请在首次出现时解释PTE的含义，方便读者理解。"}]}],"synonyms":["Pearson Test of English","English proficiency test"],"phonetic":"/ˌpiː tiː ˈiː/","extraExplanation":["在日常英语里，看到“PTE”最常见是指“Pearson Test of English”。通常写作PTE Academic（偏学术场景）或PTE Core（偏移民/通用英语场景，视国家政策而定）。","读缩写时一般逐个字母读：P-T-E。正式写作中，如果不是大家都熟悉的缩写，最好第一次出现时写全称（full form），后面再用PTE。"]}
{"word":"ptelea","summary":{"en":"Ptelea is a plant genus (notably *Ptelea trifoliata*), often called hop tree or wafer ash.","zh":"Ptelea 指一种植物属（代表种为三叶枳椇），英语里常称 hop tree 或 wafer ash。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American shrubs or small trees (especially *Ptelea trifoliata*), commonly called hop tree or wafer ash.","zh":"一种北美原产的灌木或小乔木属（尤指三叶枳椇 *Ptelea trifoliata*），常见俗名为“啤酒花树/啤酒花木”（hop tree）或“薄饼梣”（wafer ash）。"},"examples":[{"en":"We spotted a ptelea (hop tree) near the edge of the woodland.","zh":"我们在林地边缘发现了一株Ptelea（啤酒花树）。"},{"en":"The ptelea’s flat, round fruits look a bit like little wafers.","zh":"Ptelea扁平圆形的果实看起来有点像小薄饼。"}]}],"synonyms":["hop tree","wafer ash"],"phonetic":"/ˈtliːə/","extraExplanation":["“Ptelea”常见读法为 /ˈtliːə/（开头的 p 不发音），类似很多源自希腊语的词（如 pterodactyl）。","作为植物名，它在园艺/野外植物识别语境中更常用；日常英语里更常说通俗名 hop tree 或 wafer ash。","属名来自希腊语词根，和“榆树/与榆相关的名称”有历史渊源；但现代英语中主要作为拉丁学名使用。"]}
{"word":"ptenoglossa","summary":{"en":"Ptenoglossa is a mostly historical scientific term for certain sea snails with a feather-like radula.","zh":"Ptenoglossa 是一个多见于旧文献的科学名词，指齿舌呈羽毛/梳齿状的某些海洋腹足类（海螺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now mostly historical) taxonomic group of sea snails (gastropods), characterized by a comb-like, feathered radula (“tongue”) used for feeding; ptenoglossans include groups such as wentletraps (Epitoniidae).","zh":"（多为历史用法的）一类海螺/海洋腹足类旧分类群，其特征是具有梳齿状、羽毛状的齿舌（radula，“舌头”）用于取食；其中可包括如塔螺科（Epitoniidae，俗称 wentletraps）等类群。"},"examples":[{"en":"In older malacology books, Ptenoglossa is used for snails with a feather-like radula.","zh":"在较早的软体动物学著作中，Ptenoglossa 用来指齿舌呈羽毛状的螺类。"},{"en":"Some modern classifications no longer treat Ptenoglossa as a formal group.","zh":"一些现代分类体系已不再把 Ptenoglossa 视为正式的分类单元。"}]}],"synonyms":["ptenoglossans","Ptenoglossan gastropods"],"phonetic":"/ˌtiːnəˈɡlɔsə/","extraExplanation":["词源来自希腊语：pteno-（“羽毛、翅”）+ glossa（“舌”）。这里的“舌”指软体动物的齿舌（radula），是一条带齿的“刮食器官”，不同类群齿舌形态差异很大。","这是一个在部分旧文献中出现的分类名称；当你阅读现代资料时，更常见的是具体科或更现代的系统发育分类名称，而不是把它当作一个仍通行的“正式类群”。"]}
{"word":"ptenoglossate","summary":{"en":"A zoological term for gastropods with a comb-like radula; also used for such a gastropod.","zh":"动物学术语：指具有梳状齿舌的腹足类；也可指这类腹足动物本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a sea snail or other gastropod) having a comb‑like radula (a ribbon of tiny teeth) with many slender teeth; relating to the group once called Ptenoglossa.","zh":"（指海螺等腹足类）具有“梳状齿舌”（齿舌上有许多细长齿）；与旧称“梳舌目/梳舌类”（Ptenoglossa）相关。"},"examples":[{"en":"Some marine snails are described as ptenoglossate because their radula has many fine, comb‑like teeth.","zh":"一些海洋蜗牛被称为 ptenoglossate，是因为它们的齿舌具有许多细密、梳子状的齿。"},{"en":"In older zoology books, certain predatory gastropods were grouped as ptenoglossate forms.","zh":"在较早的动物学书籍中，一些捕食性的腹足类曾被归为 ptenoglossate 类型。"}]},{"partOfSpeech":"n.","definition":{"en":"A gastropod (or gastropod type) described as ptenoglossate.","zh":"梳舌型的腹足类（或被描述为梳舌型的腹足类）。"},"examples":[{"en":"The paper compares a ptenoglossate with a taenioglossate snail.","zh":"这篇论文把一种 ptenoglossate 与一只 taenioglossate（带舌型）蜗牛作比较。"}]}],"synonyms":["ptenoglossan","pectinoglossate"],"phonetic":"/ˌtiːnoʊˈɡlɔːseɪt/","extraExplanation":["这是一个生物学/动物学术语，常见于对“齿舌（radula）”结构的描述。齿舌是许多软体动物口腔内用于刮取或撕裂食物的“齿带”。","词源可拆为 pteno-（源自希腊语，含“羽状/梳状”之意）+ gloss-（“舌”，同源于 glossary 等词）+ -ate（形容词后缀），整体意思接近“梳状的舌”。","分类学上，Ptenoglossa 作为传统类群在现代系统中可能不再常用或被重新划分；阅读新文献时可留意是否改用更具体的科/目名称，或用 ptenoglossan 这类对应形式。"]}
{"word":"pter","summary":{"en":"pter- is a Greek-based prefix meaning “wing/feather,” and the initial p is usually silent in English.","zh":"pter- 是源自希腊语的词首成分，意为“翅膀/羽毛”，在英语中词首的 p 通常不发音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix (from Greek) meaning “wing” or “feather,” used in scientific words (especially about flying reptiles). In English, the “p” is usually silent.","zh":"一个（源自希腊语的）词首成分，意思是“翅膀/羽毛”，常见于科学词汇（尤其与翼龙等有关）。在英语里这个“p”通常不发音。"},"examples":[{"en":"The word “pterodactyl” starts with pter-, and the p is silent.","zh":"“pterodactyl（翼手龙）”以 pter- 开头，而且 p 不发音。"},{"en":"Scientists use words like “pterosaur” for prehistoric flying reptiles.","zh":"科学家会用 “pterosaur（翼龙类）” 这类词来指史前会飞的爬行动物。"}]}],"synonyms":["ptero-"],"phonetic":"/tər/","extraExplanation":["pter- 来自希腊语 pterón（πτερόν，“翅膀”）。所以很多以 pter- 开头的英文科学词，读音开头更像 /t/（例如 pterodactyl 的开头听起来像 “ter-”）。","如果你其实想查的是缩写或人名/用户名里的 “pter”，告诉我上下文（在哪看到的、完整句子），我可以更准确解释。"]}
{"word":"Pteranodon","summary":{"en":"Pteranodon is a well-known toothless pterosaur (flying reptile) from the Late Cretaceous.","zh":"Pteranodon（翼手龙）是白垩纪晚期著名的无牙翼龙类飞行爬行动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large flying reptile (a pterosaur) that lived in the Late Cretaceous period, famous for being toothless and often shown with a long crest on its head.","zh":"一种生活在白垩纪晚期的大型飞行爬行动物（翼龙类），以“无牙”和常见的长头冠形象而著名。"},"examples":[{"en":"The museum display showed a Pteranodon soaring above a prehistoric sea.","zh":"博物馆展柜里展示了一只翼手龙在史前海洋上空翱翔。"},{"en":"Many people call it a dinosaur, but Pteranodon was actually a pterosaur.","zh":"很多人把它叫作恐龙，但翼手龙其实属于翼龙类。"}]}],"synonyms":["pterosaur","pterodactyl (informal)"],"phonetic":"/təˈrænəˌdɑːn/","extraExplanation":["“Pteranodon”来自希腊语：pteron（翅膀）+ anodon（无牙的），所以名字本身就暗示了它“没有牙齿”。","学习提示：Pteranodon 不是 dinosaur（恐龙）。恐龙主要是陆地上的恐龙类群；翼龙类是会飞的爬行动物，属于不同分支。","常见文化语境：在影视、科普书和玩具里，Pteranodon 常被画成在海岸或海面上滑翔、可能捕食鱼类的动物。"]}
{"word":"pteranodon","summary":{"en":"A large toothless-crested flying reptile from the late Cretaceous.","zh":"白垩纪晚期一种无牙、具头冠的大型飞行爬行动物（翼龙类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large flying reptile (a pterosaur) from the late Cretaceous period, known for its long toothless beak and a backward-pointing head crest.","zh":"翼手龙属的一种大型飞行爬行动物（翼龙类），生活在白垩纪晚期，以长而无牙的喙和向后延伸的头冠为特征。"},"examples":[{"en":"The museum’s fossil exhibit features a life-size model of a pteranodon.","zh":"博物馆的化石展里有一只等比例的翼手龙模型。"},{"en":"Many people confuse a pteranodon with a dinosaur, but it was a flying reptile.","zh":"很多人把翼手龙误认为恐龙，但它其实是会飞的爬行动物。"}]}],"synonyms":["pterosaur","flying reptile"],"phonetic":"/pˌtɛr.əˈnɑː.dɑːn/","extraExplanation":["“Pteranodon”常见于科普书、博物馆展览和流行文化（如电影）中。学习时要注意：翼龙（pterosaur）不是恐龙（dinosaur），而是与恐龙生活在同一时代的另一类爬行动物。","词源：来自希腊语 pteron（翅膀）+ an-（无）+ odon（牙齿），字面意思是“没有牙齿的翅膀”，对应它“无牙长喙”的特征。"]}
{"word":"pteranodont","summary":{"en":"A large, toothless pterosaur (often Pteranodon) known from Late Cretaceous fossils.","zh":"一种大型、无牙的翼龙类飞行爬行动物（常指无齿翼龙Pteranodon），主要见于白垩纪晚期化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large flying reptile from the Late Cretaceous period, known from fossils; it was a type of pterosaur (often referring to the genus Pteranodon).","zh":"一种生活在白垩纪晚期的大型飞行爬行动物（翼龙类），常指翼龙属“无齿翼龙”（Pteranodon）。"},"examples":[{"en":"The museum displayed a pteranodont fossil with an enormous wingspan.","zh":"博物馆展出了一具翼龙化石，翼展非常惊人。"},{"en":"In documentaries, a pteranodont is often shown gliding over ancient seas.","zh":"在纪录片里，翼龙常被描绘为掠过远古海洋滑翔。"}]}],"synonyms":["Pteranodon","pterosaur"],"phonetic":"/təˈrænəˌdɑnt/","extraExplanation":["“pteranodont”在日常英语中不如“Pteranodon”常见；严格来说，Pteranodon是一个属名（首字母常大写），而“pteranodont”有时被当作普通名词使用，表示“像无齿翼龙那样的翼龙”。","Pteranodon名字来源于希腊语：pteron（翅膀）+ anodon（无牙的），因为它没有牙齿。它并不是恐龙，而是与恐龙同时代的飞行爬行动物（翼龙类）。"]}
{"word":"pteranodontidae","summary":{"en":"Pteranodontidae is the scientific name for a family of extinct pterosaurs, including Pteranodon.","zh":"Pteranodontidae 是翼手龙科的学名，指一类已灭绝的翼龙，包括无齿翼龙（Pteranodon）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct flying reptiles (pterosaurs) best known for the genus Pteranodon, characterized by toothless beaks and often large head crests; they lived mainly in the Late Cretaceous.","zh":"翼手龙科（已灭绝的飞行爬行动物/翼龙的一科），以无齿喙和常见的大型头冠为特征，代表属为无齿翼龙（Pteranodon），主要生活在白垩纪晚期。"},"examples":[{"en":"Pteranodontidae fossils are common in marine deposits from the Late Cretaceous.","zh":"翼手龙科的化石常见于白垩纪晚期的海相沉积中。"},{"en":"Many museum displays show a Pteranodontidae skeleton with a long crest on its skull.","zh":"许多博物馆会展示翼手龙科的骨架，头骨上有一条很长的头冠。"}]}],"synonyms":["Pteranodon family"],"phonetic":"/ˌtɛrəˈnɑːdənˌtaɪdiː/","extraExplanation":["词源提示：Pteranodontidae 来自属名 Pteranodon（常译“无齿翼龙”）+ 科名后缀 -idae（动物分类学中表示“科”）。Ptera- 与“翼/翅膀”相关（同源于 pterodactyl），-odon 与“牙齿”相关，因此 Pteranodon 强调“无牙/无齿”。","学习提示：它是一个科学分类名称，日常英语中更常见的是 pterosaur（翼龙）或 Pteranodon（无齿翼龙）。书写时通常首字母大写用于属名（Pteranodon），而科名 Pteranodontidae 也常首字母大写。"]}
{"word":"pteraspid","summary":{"en":"A pteraspid is an extinct, armored, jawless fish known from ancient fossils.","zh":"pteraspid 指一种已灭绝的、有甲壳的早期无颌鱼类，常见于古代化石记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct group of early jawless armored fish (the pteraspids), known from fossils mainly in the Silurian and Devonian periods","zh":"（古生物）翼甲鱼类的一员；一种已灭绝的早期无颌、有甲壳的鱼类（主要见于志留纪与泥盆纪化石）"},"examples":[{"en":"Scientists found a pteraspid fossil in rocks dated to the Devonian period.","zh":"科学家在可追溯到泥盆纪的岩层中发现了翼甲鱼类化石。"},{"en":"A pteraspid had a hard head shield that helped protect it from predators.","zh":"翼甲鱼类的头部有坚硬的“头盾”，有助于保护它免受捕食者攻击。"}]}],"synonyms":["pteraspid fish","heterostracan"],"phonetic":"/ˈtɛrəˌspɪd/","extraExplanation":["词源提示：pteraspid 来自属名 Pteraspis，源于希腊语 pteron（“翅、翼”）+ aspis（“盾”），指这种鱼类头部（与身体前部）像“盾牌”一样的硬质甲壳形态。","语境用法：该词主要出现在古生物学、地质学与博物馆说明文字中，日常英语里很少使用。"]}
{"word":"pteraspidae","summary":{"en":"Pteraspidae: an extinct family of armored, jawless fishes from the Early Devonian.","zh":"Pteraspidae：泥盆纪早期的一类已灭绝的具骨甲无颌鱼科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct, armored, jawless fishes (heterostracans) that lived mainly in the Early Devonian period.","zh":"翼甲鱼科（Pteraspidae）：一种已灭绝的无颌、具骨甲的古鱼类家族（属异甲鱼类/异甲类），主要生活在泥盆纪早期。"},"examples":[{"en":"Fossils of pteraspidae are often found in Early Devonian rock layers.","zh":"翼甲鱼科的化石常见于泥盆纪早期的岩层中。"},{"en":"In the museum display, pteraspidae are shown as streamlined fish protected by head and body armor.","zh":"在博物馆展柜里，翼甲鱼科被展示为外形流线、头部和身体有骨甲保护的鱼类。"}]}],"synonyms":["pteraspids","pteraspid fishes"],"phonetic":"/ˌtɛr.əˈspɪd.ə.di/","extraExplanation":["“Pteraspidae”是古生物学里的分类学名称，常见的口语/通俗写法是“pteraspids”（翼甲鱼类）。","词源上可拆为希腊语 pteron（“翅/翼”）+ aspis（“盾”），呼应其头部骨甲像“盾牌”的外形特征。","它们属于无颌类（比现代有颌鱼更原始的一支），对理解脊椎动物早期演化很重要；常在科普书或地质年代相关文本中出现。","相关词：Heterostraci（异甲类，所属类群）、jawless fish（无颌鱼）、Devonian（泥盆纪）。"]}
{"word":"pteraspis","summary":{"en":"Pteraspis is an extinct armored, jawless fish known from Devonian fossils.","zh":"Pteraspis（翼甲鱼属）是已灭绝的有甲无颌鱼类，见于泥盆纪化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of armored, jawless fish (a heterostracan) that lived mainly in the Early Devonian period and is known from fossils in Europe and parts of North America","zh":"翼甲鱼属：一种已灭绝的有甲、无颌鱼类（属异甲类），主要生活在泥盆纪早期，化石见于欧洲及北美部分地区"},"examples":[{"en":"Pteraspis fossils help scientists understand early vertebrate evolution.","zh":"翼甲鱼属的化石帮助科学家了解早期脊椎动物的演化。"},{"en":"In the museum exhibit, Pteraspis is shown with a broad head shield and bony plates.","zh":"在博物馆展览中，翼甲鱼属被展示为具有宽大的头盾和骨质甲片。"}]}],"synonyms":["heterostracan (type)","armored jawless fish"],"phonetic":"/tɛrˈæspɪs/","extraExplanation":["“Pteraspis”来自希腊语词根：pter-（与“翅/翼”相关）+ aspis（盾），指它头部和身体前部明显的“盾状”骨甲。","它不是恐龙，也不是爬行动物，而是非常早期的鱼类（无颌类），常用于讲解“脊椎动物从早期到后来出现下颌与成对鳍”的演化脉络。"]}
{"word":"ptereal","summary":{"en":"“ptereal” is not standard; you probably mean “ethereal,” meaning airy, delicate, and otherworldly.","zh":"“ptereal”不是标准拼写；你可能想写“ethereal”，意思是空灵飘渺、纤细轻盈、超凡脱俗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “ethereal”) Extremely light, delicate, or airy; seeming too perfect or beautiful for this world.","zh":"（可能想写：ethereal）极其轻盈、纤细、飘渺的；美得像不属于人间。"},"examples":[{"en":"The ballerina’s movements looked ethereal on stage.","zh":"那位芭蕾舞者在舞台上的动作看起来飘逸得不真实。"},{"en":"An ethereal glow filled the room at dawn.","zh":"黎明时分，房间里充满了朦胧柔和的光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “ethereal”) Related to the sky or heavens; spiritual rather than physical.","zh":"（可能想写：ethereal）与天空/天堂相关的；偏精神性的，而非物质性的。"},"examples":[{"en":"She wrote about ethereal things like dreams and the soul.","zh":"她写的多是梦与灵魂这类更偏精神性的事物。"},{"en":"The poem contrasts earthly worries with an ethereal peace.","zh":"这首诗把尘世烦恼与超然的宁静作了对比。"}]}],"synonyms":["airy","delicate","otherworldly","heavenly","unearthly","ghostly"],"phonetic":"/ɪˈθɪriəl/","extraExplanation":["“ptereal”在英语里不是常见标准拼写；最接近、最常见的目标词通常是“ethereal”。","“ethereal”常用来形容：ethereal beauty（空灵之美）、ethereal voice（空灵嗓音）、ethereal light/mist（朦胧的光/薄雾）。多用于文学、艺术评论或描写氛围。","词源上与古希腊语“aither（上层清澈的空气/天界）”相关，因此带有“轻盈、超凡、天上般”的感觉。"]}
{"word":"pterergate","summary":{"en":"A rare winged worker ant (a worker that develops wings).","zh":"罕見的「有翅工蟻」（工蟻長出翅膀的個體）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) A winged worker ant—an unusual worker that develops wings, often due to genetic or developmental factors.","zh":"（昆蟲學）有翅工蟻——一種罕見的工蟻個體，會長出翅膀，通常與遺傳或發育因素有關。"},"examples":[{"en":"The colony produced a pterergate, which surprised the researchers because workers are normally wingless.","zh":"這個蟻群出現了一隻有翅工蟻，讓研究人員很驚訝，因為工蟻通常是沒有翅膀的。"},{"en":"Under the microscope, the pterergate showed partially developed flight muscles.","zh":"在顯微鏡下，這隻有翅工蟻顯示出部分發育的飛行肌肉。"}]}],"synonyms":["winged worker (ant)","alate worker (rare)"],"phonetic":"/ˌtɛrɚˈɡeɪt/","extraExplanation":["這個詞主要出現在螞蟻學（myrmecology）的研究文章中，日常英語幾乎不用。","詞源可拆為 pter-（與「翅膀」相關，源自希臘語 pteron）+ ergate（「工蟻／工蜂／工體」，源自希臘語 ergatēs「工人」）。","有翅工蟻通常被視為「異常型」（aberrant form）：在多數螞蟻物種中，負責繁殖的雌蟻（queen）和雄蟻（male）才有翅膀，工蟻一般無翅。研究者關心它，因為它能提供關於階級分化、發育調控與基因表現的線索。"]}
{"word":"pterian","summary":{"en":"Pterian is a rare adjective meaning “winged/relating to wings,” and in specialized anatomy it can mean “relating to the pterion (skull landmark).”","zh":"Pterian 是个罕见形容词，常指“有翅的/与翅有关”；在专门解剖学语境中也可指“与翼点（颅骨标志）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having wings; relating to wings or wing-like structures. (Rare; mostly seen in scientific or poetic contexts.)","zh":"有翅的；与翅膀或翼状结构有关的。（罕见，多见于科学或诗意用法）"},"examples":[{"en":"In the poem, the pterian creature rises above the clouds.","zh":"在诗中，那只“有翅的”生物飞升到云层之上。"},{"en":"Some older texts use pterian to describe wing-like forms in nature.","zh":"一些较早的文本用 pterian 来描述自然界中的翼状形态。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterion, a small H-shaped region on the side of the human skull where several bones meet. (Very rare; specialized anatomy usage.)","zh":"与“翼点”（pterion）有关，即人类颅侧多块骨骼交汇形成的 H 形区域。（非常罕见；解剖学专门用法）"},"examples":[{"en":"The surgeon noted the pterian area as a key landmark.","zh":"外科医生把翼点附近区域视为重要的定位标志。"}]}],"synonyms":["winged","pterous","alate"],"phonetic":"/ˈtɪriən/","extraExplanation":["pterian 不是现代英语里常见的词，更常见的相关词是 pterous（“有翅的”）或 alate（“有翅的”）。","词根 pter- 来自希腊语 pteron（“翅膀”），你会在许多与“翼/飞行”有关的词里看到它，比如 pterodactyl（翼手龙）、helicopter（直升机，字面含“螺旋翼”）。","如果你是在生物学/医学语境里遇到该词，建议同时核对原文是否其实是 pterion（翼点）或 pterous（有翅的），因为拼写很容易混淆。"]}
{"word":"pteric","summary":{"en":"Pteric means “related to wings” or “wing-like.”","zh":"pteric 指“与翅膀有关的”或“翅状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to wings or wing-like structures; winged.","zh":"与翅膀或类似翅膀的结构有关的；有翅的。"},"examples":[{"en":"Some insects have pteric patterns on their wings that help them blend into leaves.","zh":"有些昆虫的翅膀上有与翅相关的花纹，能帮助它们融入叶片环境。"},{"en":"The artist used pteric shapes to suggest flight and freedom.","zh":"这位艺术家用“翅状”的造型来暗示飞翔与自由。"}]}],"synonyms":["winged","alate","pteral","pterygoid (specific, anatomy)"],"phonetic":"/ˈtɛrɪk/","extraExplanation":["“pteric”来自希腊语词根 pter-/ptero-（与“翅膀”有关）。你会在很多科技术语里看到它，比如 pterodactyl（翼手龙）、helicopter（直升机，字面可理解为“螺旋+翼”）。","英文里以“pt-”开头的希腊来源词常见现象是 p 不发音，因此常读作以 /t/ 开头：pteric ≈ “TER-ik”。","这是比较少见、偏学术/描写性用词；日常更常用 winged（有翅的）或 relating to wings（与翅有关的）。"]}
{"word":"pterichthyodes","summary":{"en":"Pterichthyodes is a paleontological genus name for an extinct armored Devonian fish (an antiarch placoderm).","zh":"Pterichthyodes 是古生物学中的属名，指泥盆纪已灭绝的装甲鱼类（反甲类盾皮鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in paleontology for an extinct, armored prehistoric fish (an antiarch placoderm) known from Devonian-period fossils; often discussed in relation to early vertebrate evolution","zh":"古生物学中使用的一个属名，指泥盆纪时期的已灭绝、有装甲的史前鱼类（反甲鱼类的一支盾皮鱼）；常用于讨论早期脊椎动物演化"},"examples":[{"en":"In a museum display, Pterichthyodes is shown as an early armored fish with bony plates.","zh":"在博物馆展柜里，Pterichthyodes 常被展示为一种身披骨板的早期装甲鱼。"},{"en":"Researchers compare fossils like Pterichthyodes to understand how early fish moved and lived.","zh":"研究人员会比较像 Pterichthyodes 这样的化石，以了解早期鱼类如何运动与生活。"}]}],"synonyms":["antiarch placoderm (group term)","armored prehistoric fish (descriptive)"],"phonetic":"/ˌtɛrɪkˈθaɪ.əˌdoʊdz/","extraExplanation":["词源可拆解为希腊语：pter-（“翼、鳍”之意）+ ichthy-（“鱼”）+ -odes（“……样的”）。因此字面上有“像长翼/鳍的鱼”之感，符合它具装甲、并有类似“前肢/鳍”结构的古生物形象。","该词多见于学术或博物馆语境，日常英语中几乎不会使用；写作时通常作为拉丁化属名首字母大写（Pterichthyodes），并用斜体排版（*Pterichthyodes*）是常见规范。"]}
{"word":"pterichthys","summary":{"en":"Pterichthys is an extinct genus of armored Devonian fish known from fossils, especially in Scotland.","zh":"Pterichthys 指一种已灭绝的泥盆纪装甲鱼类属，主要以苏格兰化石闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct armored fish (placoderms) from the Devonian period, known from fossil remains in Scotland.","zh":"一种已灭绝的装甲鱼类属（盾皮鱼类），生活在泥盆纪；化石主要发现于苏格兰。"},"examples":[{"en":"Pterichthys is often mentioned in discussions of early vertebrate evolution.","zh":"Pterichthys 常出现在关于早期脊椎动物演化的讨论中。"},{"en":"Fossils of Pterichthys were found in Devonian rocks in Scotland.","zh":"Pterichthys 的化石在苏格兰的泥盆纪岩层中被发现。"}]}],"synonyms":["placoderm","armored fish (general term)"],"phonetic":"/ˌtɛrɪkˈθɪs/","extraExplanation":["词源：来自希腊语 pteron（“翅、翼”）+ ichthys（“鱼”），名称暗示它有像“翼”一样的鳍或外形特征。","背景：Pterichthys 属于盾皮鱼类（placoderms），这是一类早期有颌的装甲鱼；它们在古生代很繁盛，后来灭绝。","文化/文学提示：在古生物学史中，Pterichthys 是早期被研究和绘图的化石鱼之一，常见于介绍化石发现史或“远古鱼类”科普材料中。"]}
{"word":"pterid","summary":{"en":"“pterid-” is a scientific word part meaning “fern.”","zh":"“pterid-”是表示“蕨/蕨类”的科学构词成分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “fern,” used in scientific words (especially botany).","zh":"构词成分，表示“蕨类/蕨”，常用于科学词汇（尤指植物学）。"},"examples":[{"en":"Pteridology is the study of ferns.","zh":"Pteridology（蕨类学）是研究蕨类植物的学科。"},{"en":"Some textbooks describe pteridophytes as plants that reproduce by spores.","zh":"一些教材把 pteridophytes（蕨类植物）描述为通过孢子繁殖的植物。"}]}],"synonyms":["fern-","pteris-"],"phonetic":"/ˈtɛrɪd/","extraExplanation":["“pterid-”来自希腊语 pteris（蕨）。在很多以希腊语为来源的词里，开头的 p 常常不发音，所以你会听到更像“TER-id-”的开头。","常见相关词：pteridophyte（蕨类植物）、pteridology（蕨类学）。不要和 ptero-（表示“翼/翅膀”，如 pterodactyl 翼龙）混淆；两者来源不同。"]}
{"word":"pterideous","summary":{"en":"An uncommon adjective meaning “fernlike; having the appearance of a fern.”","zh":"一个不太常见的形容词，意为“像蕨的；具有蕨类外观的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having the nature or appearance of a fern; fernlike.","zh":"（植物学）具有蕨类植物的特征或外观的；像蕨的。"},"examples":[{"en":"The illustrator added pterideous leaves around the border to give the page a woodland feel.","zh":"插画师在边框周围加上了蕨状（pterideous）的叶子，让页面更有林地气息。"},{"en":"In the shaded ravine, the ground cover looked distinctly pterideous.","zh":"在阴凉的峡谷里，地被植物看起来明显带有蕨类的特征。"}]}],"synonyms":["fernlike","pteridaceous","pteridoid"],"phonetic":"/ˌtɛrɪˈdiəs/","extraExplanation":["“pterideous”较少见，常被视为“pteridous / pteridoid / pteridaceous（蕨类的）”的变体或误拼。词根来自希腊语 pteris（蕨类植物），因此多用于描述外形或质感“像蕨”。在写作或学术语境中，更常用的表达是 fernlike 或 pteridaceous。"]}
{"word":"pteridium","summary":{"en":"Pteridium is the scientific genus name for bracken ferns.","zh":"Pteridium 是“蕨/欧洲蕨（bracken fern）”的植物学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genus of large, common ferns (bracken), especially the widespread species bracken fern.","zh":"蕨属（Pteridium）：一种大型常见蕨类，尤指广布的“蕨/欧洲蕨（bracken fern）”。"},"examples":[{"en":"Pteridium often grows in open fields and along forest edges.","zh":"Pteridium 常生长在开阔地和森林边缘。"},{"en":"The hillside was covered with Pteridium (bracken) in late summer.","zh":"夏末时，那座山坡长满了 Pteridium（蕨/欧洲蕨）。"}]}],"synonyms":["bracken (common name)","bracken fern"],"phonetic":"/ptəˈɹɪdiəm/","extraExplanation":["“Pteridium”是拉丁化的学名（属名），日常英语里更常说“bracken”。在写作或科研语境中会用学名来避免不同地区俗名不一致。","该属名来自希腊语词根 pterid-（与“fern/蕨类”相关），常见于植物学术语。","补充常识：bracken 在一些地区被视为侵占性植物；另外它含有一定毒性成分，野外不建议随意采食。"]}
{"word":"pterido","summary":{"en":"“pterido-” means “fern,” mainly used in scientific terms.","zh":"“pterido-”表示“蕨/蕨类”，主要用于科学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “fern,” used in scientific words (especially botany).","zh":"（构词成分）表示“蕨类/蕨”的意思，常用于科学词汇（尤指植物学）。"},"examples":[{"en":"In botany, pteridophytes are plants that reproduce by spores, like ferns.","zh":"在植物学中，pteridophytes（蕨类植物）是通过孢子繁殖的植物，例如蕨。"},{"en":"The prefix pterido- appears in technical terms related to fern biology.","zh":"前缀 pterido- 常出现在与蕨类生物学相关的专业术语中。"}]}],"synonyms":["fern (meaning-related)"],"phonetic":"/ˈtɛrɪˌdoʊ/","extraExplanation":["“pterido-”来自希腊语 pteris（蕨）。常见同源词还有 pteridology（蕨类学）、pteridophyte（蕨类植物）。","注意拼写：英语里 pter- 开头的词（如 pterodactyl）通常 p 不发音，读起来更像以 t 开头。","如果你原本想查的是单词 fern（蕨）或 pteridophyte（蕨类植物），告诉我我也可以一起对比解释。"]}
{"word":"pteridography","summary":{"en":"Pteridography means writing about or scientifically describing ferns.","zh":"Pteridography 指对蕨类植物进行书写记录或科学描述的学问。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description or scientific study of ferns (especially writing about, classifying, or documenting them)","zh":"蕨类植物的记述或研究（尤指对蕨类进行书写、分类或记录的学问）"},"examples":[{"en":"Her thesis focused on pteridography, especially how early botanists described ferns.","zh":"她的论文研究蕨类记述学，尤其关注早期植物学家如何描述蕨类。"},{"en":"The museum’s archives include 19th-century pteridography with detailed fern illustrations.","zh":"博物馆档案中保存着19世纪的蕨类记述资料，包含精细的蕨类插图。"}]}],"synonyms":["pteridology","fern study","fern taxonomy"],"phonetic":"/ˌtɛrɪˈdɑɡrəfi/","extraExplanation":["词源：pterido- 来自希腊语 pteris（意为“蕨”），-graphy 表示“书写、记录、描述”。因此 pteridography 直译为“关于蕨类的记录/描写”。","使用场景：该词较罕见，多见于植物学史、分类学或古典文献中；现代更常用 fern study / fern taxonomy / pteridology（蕨类学）来表达类似概念。"]}
{"word":"pteridoid","summary":{"en":"Pteridoid means fern-like or related to ferns (mainly used in botanical contexts).","zh":"pteridoid 指“像蕨类的/与蕨类有关的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(botany) Resembling a fern; relating to ferns or fern-like plants.","zh":"（植物学）像蕨类的；与蕨类或蕨状植物有关的。"},"examples":[{"en":"The fossil shows pteridoid leaves, suggesting a fern-like plant once grew here.","zh":"这块化石显示出蕨状（pteridoid）的叶片，暗示这里曾生长过类似蕨类的植物。"},{"en":"In the shady valley, pteridoid vegetation covered the damp ground.","zh":"在阴湿的山谷里，蕨状植被覆盖着潮湿的地面。"}]}],"synonyms":["fernlike","fern-like","pteridaceous"],"phonetic":"/ˈtɛrɪˌdɔɪd/","extraExplanation":["“pteridoid”是比较少见的学术词，常见于植物学、古植物学（研究化石植物）或生态描述中。","词根来自希腊语“pteris”（蕨）+ “-oid”（……状的/类似的），所以整体意思就是“像蕨的”。写作中更常用的日常替代词是“fernlike”。"]}
{"word":"pteridological","summary":{"en":"Pteridological means “about the scientific study of ferns.”","zh":"pteridological 意为“与蕨类植物学（研究蕨类）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to pteridology, the scientific study of ferns and their relatives (such as horsetails and clubmosses).","zh":"与蕨类植物学有关的；指研究蕨类及其近缘植物（如木贼、石松等）的科学。"},"examples":[{"en":"She wrote a pteridological paper on fern diversity in the Appalachian Mountains.","zh":"她写了一篇关于阿巴拉契亚山脉蕨类多样性的蕨类植物学论文。"},{"en":"The museum has a small pteridological collection of pressed ferns.","zh":"这家博物馆有一小批压制蕨类标本的蕨类植物学馆藏。"}]}],"synonyms":["fern-related (informal)","pteridologic (less common)"],"phonetic":"/ˌtɛrɪdəˈlɑdʒɪkəl/","extraExplanation":["“pteridological”来自“pteridology（蕨类植物学）”。词根源于希腊语 pteris / pterid-，意为“蕨”。因此它多用于学术语境（论文标题、馆藏分类、研究方向描述等），日常英语中较少见。"]}
{"word":"pteridologist","summary":{"en":"A pteridologist is a scientist who studies ferns.","zh":"pteridologist 指研究蕨类植物的科学家（蕨类学家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies ferns (plants with fronds that reproduce by spores).","zh":"蕨类学家；研究蕨类植物（长有羽状叶、以孢子繁殖的植物）的科学家。"},"examples":[{"en":"The pteridologist identified several rare ferns in the rainforest.","zh":"这位蕨类学家在雨林里鉴定出几种罕见的蕨类。"},{"en":"If you love plants, you might enjoy a talk by a pteridologist at a botanical garden.","zh":"如果你喜欢植物，你可能会喜欢植物园里蕨类学家的讲座。"}]}],"synonyms":["fern specialist","fern expert","pteridologist (formal)"],"phonetic":"/ˌtɛrɪˈdɑlədʒɪst/","extraExplanation":["词源提示：pterid- 来自希腊语，和“蕨类”有关；-logist 表示“研究……的人/……学者”。所以 pteridologist 字面意思就是“研究蕨类的人”。","相关词：pteridology（蕨类学）；fern（蕨类植物）；botanist（植物学家，范围更广）。","语境小知识：在英语里，这类以 -logist 结尾的职业/学者词（如 biologist, geologist）常用于学术或科普语境；日常聊天里更常说“fern expert（蕨类专家）”。"]}
{"word":"pteridology","summary":{"en":"Pteridology is the scientific study of ferns and their relatives.","zh":"pteridology 指研究蕨类及其近缘植物的学科（蕨类植物学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of ferns and fern relatives (such as horsetails and clubmosses)","zh":"蕨类植物学；研究蕨类及其近缘植物（如木贼、石松等）的科学"},"examples":[{"en":"She wrote her thesis in pteridology, focusing on fern reproduction.","zh":"她的论文研究方向是蕨类植物学，重点关注蕨类的繁殖。"},{"en":"Victorian gardens helped popularize pteridology among amateur collectors.","zh":"维多利亚时代的花园让蕨类植物学在业余收藏者中更受欢迎。"}]}],"synonyms":["the study of ferns","fern science"],"phonetic":"/ˌtɛrɪˈdɑlədʒi/","extraExplanation":["词源：来自希腊语 pteris（蕨类）+ -logy（……学）。因此字面意思就是“研究蕨类的学问”。","文化背景：19世纪英国曾出现“蕨类热”（fern fever / pteridomania），许多人收集、培育蕨类并出版图鉴，这也推动了蕨类相关研究与园艺流行。","使用提示：pteridology 属于较专业的学术词；日常表达里更常说 “the study of ferns”。相关常见词：fern（蕨）、frond（蕨叶/羽状叶）、spore（孢子）。"]}
{"word":"pteridophilism","summary":{"en":"Pteridophilism means an intense fondness for ferns.","zh":"pteridophilism 指对蕨类植物的强烈喜爱或迷恋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong liking for or fascination with ferns (pteridophytes); “love of ferns.”","zh":"对蕨类植物（蕨类、蕨类植物）的强烈喜爱或迷恋；“爱蕨癖/爱蕨之情”。"},"examples":[{"en":"Her garden blog is basically a celebration of pteridophilism—ferns in every corner.","zh":"她的园艺博客几乎是在“宣扬爱蕨之情”——每个角落都是蕨类。"},{"en":"He jokingly called his habit of collecting rare ferns “pteridophilism.”","zh":"他开玩笑把自己收集稀有蕨类的习惯称为“爱蕨癖”。"}]}],"synonyms":["fern-loving","love of ferns","pteridophilia"],"phonetic":"/ˌtɛrɪˈdoʊfɪˌlɪzəm/","extraExplanation":["这是一个非常罕见、带点“自造词/玩笑词”气质的词，通常用在园艺、自然爱好者的语境里，表示对蕨类的迷恋，而不是常见的正式学术术语。","词源可拆成：pterido-（来自希腊语 pteris，意为“蕨”）+ -phil-（喜爱）+ -ism（倾向/主义）。发音里开头的 p 通常不发音，类似 psychology 的 p。"]}
{"word":"pteridophilist","summary":{"en":"A pteridophilist is someone who loves or collects ferns.","zh":"pteridophilist 指“蕨类植物爱好者/收藏者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves or collects ferns; a fern enthusiast","zh":"蕨类植物爱好者；喜欢或收藏蕨类的人"},"examples":[{"en":"My aunt is a pteridophilist—her backyard is filled with different kinds of ferns.","zh":"我阿姨是个蕨类爱好者——她家后院种满了各种蕨类植物。"},{"en":"The nature club welcomed pteridophilists and beginners alike on the fern walk.","zh":"自然社团在“蕨类徒步”活动中欢迎蕨类爱好者和初学者一起参加。"}]}],"synonyms":["fern lover","fern enthusiast"],"phonetic":"/ˌtɛrɪˈdɑːfəlaɪst/","extraExplanation":["这是一个比较少见、偏书面/趣味性的词，多用于爱好者圈子或自然写作中。","词根拆分：pterido- 来自希腊语 pteris（“蕨”），-philist 与 -phile 同源，表示“爱好者/喜欢……的人”（如 bibliophile 爱书的人）。","相关词：fern lover（更常见、更口语）；pteridophyte（蕨类植物，生物学术语）。"]}
{"word":"pteridophilistic","summary":{"en":"Fern-loving; having a strong fondness for ferns.","zh":"喜爱蕨类植物的；对蕨类特别着迷的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having a strong liking for ferns; fern-loving (often used humorously or very formally).","zh":"喜爱蕨类植物的；对蕨类植物特别着迷的（常带幽默或较书面、罕见用法）。"},"examples":[{"en":"She has a pteridophilistic taste in houseplants and keeps several kinds of ferns.","zh":"她在室内植物方面很“蕨类控”，养了好几种蕨类。"},{"en":"The garden’s pteridophilistic design features shaded paths and fern-filled corners.","zh":"这座花园的设计很偏爱蕨类：阴凉的小径旁到处是蕨丛。"}]}],"synonyms":["fern-loving","fond of ferns","fern-enthusiastic","pteridophilous (scientific)"],"phonetic":"/ˌtɛrɪdoʊfəˈlɪstɪk/","extraExplanation":["这个词非常少见，更多是“造词式/玩笑式”的学术风格形容词。日常英语里更常说：fern-loving、fond of ferns、a fern enthusiast。","词形可以拆开理解：pterido- 表示“蕨类/蕨”，-phil- 表示“爱好/喜爱”，-istic 表示“具有……倾向的”。","相关更常见的科学写法有 pteridophilous（喜蕨的，多用于生态学/昆虫学：以蕨类为栖息或取食对象）。"]}
{"word":"pteridophyta","summary":{"en":"Pteridophyta refers to seedless vascular plants (especially ferns) that reproduce by spores.","zh":"Pteridophyta 指无种子但有维管组织的植物（主要是蕨类），以孢子繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major group (division) of seedless vascular plants, especially ferns and their close relatives, that reproduce by spores instead of seeds","zh":"蕨类植物门：一大类“无种子但有维管组织”的植物，主要包括蕨类及其近缘类群，以孢子繁殖而不是用种子繁殖"},"examples":[{"en":"Ferns are classic members of Pteridophyta, spreading by spores rather than seeds.","zh":"蕨类是蕨类植物门的典型成员，通过孢子而不是种子传播。"},{"en":"In many school biology courses, Pteridophyta is contrasted with seed plants like gymnosperms and angiosperms.","zh":"在许多学校的生物课里，蕨类植物门常与裸子植物、被子植物等种子植物作对比。"}]}],"synonyms":["ferns (informal/general)","pteridophytes","seedless vascular plants"],"phonetic":"/ˌtɛr.ɪˈdɑː.fɪ.tə/","extraExplanation":["“Pteridophyta”源自希腊语：pteris（蕨）+ phyton（植物），字面意思接近“蕨类植物”。","在现代分类学中，“Pteridophyta”有时被当作传统用法的“门”，但一些新系统会把它拆分为不同谱系（如石松类、真蕨类等），因此你在不同教材/论文里可能会看到不一样的分类处理。","发音提示：重音通常在第三音节附近（-do-），整体听起来像“teer-ih-DOF-ih-tuh”。"]}
{"word":"pteridophyte","summary":{"en":"A spore-producing vascular plant (like a fern) that does not make seeds or flowers.","zh":"一种用孢子繁殖、具有维管组织但不产生种子和花的植物（如蕨类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant that reproduces by spores and has vascular tissues (xylem and phloem), such as ferns and horsetails; it does not make flowers or seeds","zh":"蕨类植物（狭义常指“蕨类/蕨类植物门”）：用孢子繁殖、具有维管组织（木质部和韧皮部）的植物，如蕨和木贼；不产生花和种子"},"examples":[{"en":"Ferns are pteridophytes, so they reproduce by spores instead of seeds.","zh":"蕨类植物属于蕨类植物，因此它们靠孢子而不是种子繁殖。"},{"en":"In humid forests, pteridophytes often grow well because they need moisture for reproduction.","zh":"在潮湿的森林里，蕨类植物常常长得很好，因为它们繁殖需要水分。"},{"en":"The textbook compares bryophytes and pteridophytes by focusing on vascular tissue.","zh":"教材通过“有没有维管组织”来比较苔藓植物和蕨类植物。"}]}],"synonyms":["fern (common term)","vascular spore plant (technical description)"],"phonetic":"/ˌtɛrɪdoʊˈfaɪt/","extraExplanation":["词源：来自希腊语 pteris（蕨）+ phyton（植物），字面意思是“蕨类植物”。","学习提示：pteridophyte 是生物学术语，日常英语里更常直接说 fern（蕨）或 fern plants（蕨类植物）。","常见对比：bryophytes（苔藓类）没有真正的维管组织；pteridophytes 有维管组织，但仍不产生种子（区别于 gymnosperms 裸子植物、angiosperms 被子植物）。"]}
{"word":"pteridophytes","summary":{"en":"Pteridophytes are spore-producing plants like ferns that have true roots, stems, and leaves but no seeds or flowers.","zh":"pteridophytes 指蕨类等用孢子繁殖的植物，有真正的根茎叶，但没有种子和花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plants such as ferns, horsetails, and club mosses that reproduce by spores instead of seeds or flowers and typically have true roots, stems, and leaves.","zh":"蕨类植物（如蕨、木贼、石松等）：用孢子而不是种子或花来繁殖，通常具有真正的根、茎、叶。"},"examples":[{"en":"Pteridophytes thrive in moist, shady forests, especially in the tropics.","zh":"蕨类植物常在潮湿阴凉的森林里生长，尤其是在热带地区。"},{"en":"Unlike flowering plants, pteridophytes do not produce seeds.","zh":"与开花植物不同，蕨类植物不产生种子。"}]}],"synonyms":["ferns (informal/partial)","seedless vascular plants"],"phonetic":"/tɛˈrɪdəˌfaɪts/","extraExplanation":["“pteridophytes”常见于生物学/植物学语境，是复数形式；单数可说“pteridophyte”（一种蕨类植物）。","词源：pterido- 来自希腊语，意为“蕨”，-phyte 意为“植物”。","在植物演化与分类中，蕨类植物常被用来对比“种子植物”（seed plants）与“苔藓植物”（mosses）：它们有维管组织（能运输水分和养分），但不结种子。"]}
{"word":"pteridophytic","summary":{"en":"“Pteridophytic” means “related to ferns and other spore-producing, non-flowering vascular plants.”","zh":"“pteridophytic”意为“与蕨类及其他以孢子繁殖的非开花维管植物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pteridophytes—plants such as ferns and their close relatives that reproduce by spores rather than seeds (i.e., non-flowering vascular plants).","zh":"与蕨类植物（广义的“蕨类植物门/类群”，如蕨、石松、木贼等）有关的；指通过孢子而非种子繁殖的非开花维管植物。"},"examples":[{"en":"The forest floor was covered with pteridophytic vegetation, especially ferns.","zh":"森林地面覆盖着许多蕨类植物相关的植被，尤其是蕨。"},{"en":"We studied pteridophytic reproduction, focusing on spores and the gametophyte stage.","zh":"我们研究了蕨类植物的繁殖，重点是孢子和配子体阶段。"}]}],"synonyms":["pteridophyte-related","fern-related","pteridological (rare)"],"phonetic":"/ˌtɛrɪdəˈfaɪtɪk/","extraExplanation":["词源提示：pterido- 来自希腊语，意为“蕨”；-phyte 意为“植物”。合起来就是“蕨类植物的”。","使用场景：这是偏学术/植物学用词，日常英语更常说 fern (蕨) 或 fern-related（与蕨相关的）。"]}
{"word":"pteridophytous","summary":{"en":"An academic adjective meaning “related to pteridophytes (ferns and other seedless vascular plants).”","zh":"学术用形容词，表示“与蕨类植物（以及其他无种子维管植物）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to pteridophytes—seedless vascular plants such as ferns, horsetails, and clubmosses.","zh":"（植物学）与蕨类植物（pteridophytes）有关的；指无种子但有维管组织的植物，如蕨类、木贼与石松等。"},"examples":[{"en":"Ferns are pteridophytous plants that reproduce by spores, not seeds.","zh":"蕨类是典型的 pteridophytous（蕨类的）植物，它们靠孢子而不是种子繁殖。"},{"en":"The textbook compares pteridophytous groups with flowering plants.","zh":"这本教材把 pteridophytous（蕨类的）类群与开花植物作比较。"}]}],"synonyms":["pteridophytic","fernlike","fern-related"],"phonetic":"/ˌtɛrɪˈdɑfəˌtaɪθəs/","extraExplanation":["词源拆解：pterido- 来自希腊语 pteris（“蕨”），-phyte 来自 phyton（“植物”），-ous 表示“……的”。因此 pteridophytous 字面意思就是“蕨类植物的”。","使用场景：该词多见于植物学、生态学或学术写作中；日常英语里更常用 fern (蕨) 或 pteridophyte / pteridophytic（蕨类植物/蕨类的）。"]}
{"word":"pteridosperm","summary":{"en":"An extinct “seed fern”: a prehistoric plant with fern-like leaves that reproduced by seeds.","zh":"一种已灭绝的“种子蕨”：叶子像蕨类，但以种子繁殖的史前植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct group of prehistoric seed plants that looked like ferns (with fern-like leaves) but reproduced by seeds rather than spores; also called a “seed fern.”","zh":"（古生物）种子蕨：已灭绝的一类史前种子植物，外形像蕨类（叶子像蕨叶），但用种子而不是孢子繁殖。"},"examples":[{"en":"Pteridosperms had fern-like fronds, but they produced seeds.","zh":"种子蕨有像蕨类一样的叶状体，但它们会产生种子。"},{"en":"Fossils show that pteridosperms were common in the Carboniferous period.","zh":"化石显示，种子蕨在石炭纪很常见。"}]}],"synonyms":["seed fern","pteridosperm (seed fern group)"],"phonetic":"/ˌtɛrədoʊˈspɝm/","extraExplanation":["“pteridosperm”来自希腊语词根：pterid-（蕨类）+ sperm（种子）。中文常译为“种子蕨”或“种子蕨类”。","它们在外形上容易与真正的蕨类混淆；关键区别是：真正的蕨类通常靠孢子繁殖，而种子蕨属于种子植物谱系。","该词更多见于地质学、古植物学与化石研究语境，日常英语不常用。"]}
{"word":"pteridospermae","summary":{"en":"Pteridospermae = extinct “seed ferns”: fern-like plants that reproduced by seeds.","zh":"Pteridospermae 指已灭绝的“种子蕨”：外形似蕨类、但以种子繁殖的史前植物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group of prehistoric plants known as seed ferns: they looked fern-like but reproduced with seeds (not spores).","zh":"一种已灭绝的史前植物类群，称为“种子蕨（seed ferns）”：外形像蕨类，但通过种子繁殖（而不是孢子）。"},"examples":[{"en":"Pteridospermae are important fossils for understanding how early seed plants evolved.","zh":"种子蕨（Pteridospermae）的化石对理解早期种子植物如何演化很重要。"},{"en":"In the Carboniferous period, some Pteridospermae had leaves that closely resembled true ferns.","zh":"在石炭纪，一些种子蕨（Pteridospermae）的叶子看起来很像真正的蕨类。"}]}],"synonyms":["seed ferns","pteridosperms"],"phonetic":"/ˌtɛrɪdoʊˈspɝːmiˌiː/","extraExplanation":["“Pteridospermae”常见于古植物学/地质学文章，是拉丁化的学术名；现代英文更常用的说法是“seed ferns”或“pteridosperms”。","词源可拆为：pterido-（与“蕨”有关，源自希腊语 pteris/pteridos）+ -spermae（“种子”，源自希腊语 sperma）。名称强调它们“像蕨类，但有种子”。","它们并不是真正的蕨类，也不是一个单一、严格的自然类群；在一些现代分类讨论中，“种子蕨”更多是形态学与演化史上的统称。"]}
{"word":"pteridospermaphyta","summary":{"en":"Pteridospermaphyta refers to extinct fern-like seed plants (“seed ferns”) known from fossils.","zh":"Pteridospermaphyta 指已灭绝的“种子蕨”类群：外形像蕨类，但以种子繁殖，主要见于化石记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of extinct, fern-like seed plants (often called “seed ferns”) known from fossils, especially common in the Paleozoic era; not true ferns because they reproduced with seeds rather than spores","zh":"（古植物）蕨类外形但以种子繁殖的已灭绝植物类群，常称“种子蕨”；主要见于古生代化石中，因以种子而非孢子繁殖，所以不是真正的蕨类"},"examples":[{"en":"Pteridospermaphyta are often described as “seed ferns” in paleobotany textbooks.","zh":"在古植物学教材中，Pteridospermaphyta 常被称为“种子蕨”。"},{"en":"Fossils of pteridosperms help scientists understand early evolution of seed plants.","zh":"种子蕨的化石有助于科学家理解早期种子植物的演化。"},{"en":"Although they looked fern-like, many Pteridospermaphyta produced seeds.","zh":"虽然外形像蕨类，但许多 Pteridospermaphyta 会产生种子。"}]}],"synonyms":["seed ferns","pteridosperms"],"phonetic":"/ˌtɛrɪdoʊspərˈmæfəɪtə/","extraExplanation":["词源提示：pterido- 来自希腊语，意为“蕨类”；sperma- 意为“种子”；-phyta 意为“植物”。整体意思就是“蕨状的种子植物”。","使用场景：这是偏学术的分类名称，常出现在古植物学、地质学与化石研究中；日常英文更常用 seed fern(s) 或 pteridosperm(s)。","分类说明：在不同教材与研究中，这个名称可能被当作一个“门/类群”的传统用法，但现代系统分类有时会用更细的谱系关系来讨论，不一定把它当作严格的自然类群。"]}
{"word":"pteridospermaphytic","summary":{"en":"Describes something connected with pteridosperms (“seed ferns”), extinct fern-like seed plants.","zh":"指与种子蕨（已灭绝的、外形似蕨但用种子繁殖的植物）相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pteridosperms (also called “seed ferns”), an extinct group of prehistoric plants that looked fern-like but reproduced by seeds.","zh":"与“种子蕨”（pteridosperms，已灭绝的一类史前植物）有关的；这些植物外形像蕨类，但靠种子繁殖。"},"examples":[{"en":"Pteridospermaphytic fossils are common in some Carboniferous rock layers.","zh":"在一些石炭纪岩层中，常见与种子蕨有关的化石。"},{"en":"The museum display compares pteridospermaphytic plants with true ferns.","zh":"博物馆展览把种子蕨类植物与真正的蕨类作对比。"}]}],"synonyms":["pteridospermous","seed-fern (related)"],"phonetic":"/ˌtɛrɪdoʊspərˈmæfɪtɪk/","extraExplanation":["这是一个非常专业的古植物学/地质学用词，常见于学术文章或博物馆说明牌中。","词根可以帮助记忆：pterido-（蕨/羽状的感觉，源自希腊语与“翅/羽”相关的词根）+ sperma（种子）+ -phyte（植物）+ -ic（……的）。直观意思就是“像蕨但有种子的植物相关的”。","在更常见的写法中，你也可能看到 pteridospermous（“种子蕨的”）或 seed-fern（通俗说法）。"]}
{"word":"pteridospermous","summary":{"en":"An adjective meaning “related to seed ferns (pteridosperms),” ancient fern-like plants that reproduced by seeds.","zh":"形容词：指“与种子蕨（种子植物型蕨类）有关的”，这类古植物外形像蕨类但以种子繁殖。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to pteridosperms (extinct “seed ferns”), or having characteristics of these ancient plants that looked like ferns but reproduced by seeds.","zh":"与种子蕨（已灭绝的“种子植物型蕨类”）有关的；或具有这类古植物特征的——外形像蕨类，但通过种子繁殖。"},"examples":[{"en":"Some Carboniferous fossils show pteridospermous features, combining fern-like leaves with seed-bearing structures.","zh":"一些石炭纪化石呈现出种子蕨特征：叶子像蕨类，但带有结种子的结构。"},{"en":"The paper argues that the specimen is pteridospermous rather than a true fern.","zh":"论文认为该标本属于种子蕨类型，而不是真正的蕨类。"}]}],"synonyms":["pteridosperm","seed-fern (related)","pteridospermic"],"phonetic":"/ˌtɛrɪdoʊˈspɝːməs/","extraExplanation":["词源上可拆为：pterido-（与蕨类/蕨叶形态相关，源自希腊语 pteris“蕨”）+ sperm（“种子”，源自希腊语 sperma）+ -ous（形容词后缀，“……的”）。因此字面意思就是“蕨-种子-的”。","“种子蕨”（pteridosperms/seed ferns）是古生代常见的一类已灭绝植物群。它们的叶子很像现代蕨类，但繁殖方式更接近种子植物，因此在古植物学与演化研究中常被用来讨论早期种子植物的出现与多样化。"]}
{"word":"pterin","summary":{"en":"Pterin is a chemical core found in several biologically important compounds, especially folate-related molecules.","zh":"pterin（蝶呤）是一种化学骨架，存在于多种重要生物分子中，尤与叶酸相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A class of nitrogen-containing compounds that form the core structure in several important biological molecules, especially folate (vitamin B9) and related cofactors.","zh":"蝶呤（pterin）：一类含氮杂环化合物，是多种重要生物分子的核心结构，尤其与叶酸（维生素B9）及其相关辅酶有关。"},"examples":[{"en":"Pterin structures are found in folate-related molecules that cells use to transfer one-carbon units.","zh":"蝶呤结构存在于与叶酸相关的分子中，细胞用它们来转移“一碳单位”。"},{"en":"Scientists study pterin derivatives to understand how certain enzymes work.","zh":"科学家研究蝶呤的衍生物，以了解某些酶是如何工作的。"}]}],"synonyms":["pteridine (related family term)","pterin core (technical phrase)"],"phonetic":"/ˈtɛrɪn/","extraExplanation":["“pterin”常见于生物化学与医学文献中，尤其与“folate（叶酸）”“biopterin（生物蝶呤）”“neopterin（新蝶呤）”等词一起出现。它更多是专业术语，日常英语中不常用。","词源上与希腊语中表示“翅膀/羽翼”的词根有关（因部分晶体外观而得名），但在现代用法中主要指这类化学骨架/母核结构。"]}
{"word":"pterins","summary":{"en":"“Pterins” is the plural of “pterin,” meaning a class of biologically important chemical compounds found in organisms, often linked to folate and enzyme-related processes.","zh":"“Pterins”是“pterin”的复数，指一类在生物体内常见、具有生物学重要性的化合物，常与叶酸及酶相关过程有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of naturally occurring chemical compounds (heterocyclic molecules) found in living organisms, often involved in important biochemical processes (for example, as parts of folate or related cofactors).","zh":"（pterin 的复数）一类天然存在的化合物（杂环分子），存在于生物体内，常参与重要的生化过程（例如作为叶酸或相关辅因子的组成部分）。"},"examples":[{"en":"Researchers measured pterins in blood samples to study folate-related metabolism.","zh":"研究人员测量血样中的 pterins，以研究与叶酸相关的代谢。"},{"en":"Some pterins act as building blocks for molecules that help enzymes work properly.","zh":"某些 pterins 作为构件，形成帮助酶正常工作的分子。"}]}],"synonyms":["pterin compounds","pteridine-related compounds"],"phonetic":"/ˈtɛrɪnz/","extraExplanation":["“pterin”里的 p 通常不发音，来自希腊语词根，含“翅/翼”的意思，用来命名这种化学结构（历史命名原因与其早期发现与描述有关）。","在生物化学中，你可能会看到相关词：folate（叶酸，属于 pterin 相关结构的一类），以及 biopterin / tetrahydrobiopterin（常写 BH4，四氢生物蝶呤，是一些酶反应的重要辅因子）。这些都和“pterin 骨架（pterin ring）”有关。"]}
{"word":"pterion","summary":{"en":"Pterion is an anatomical landmark: a bone-junction area on the side of the skull.","zh":"Pterion（翼点）是头骨侧面的一个解剖标志点，为多块颅骨的交汇处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small H-shaped region on the side of the skull where several bones meet (frontal, parietal, temporal, and sphenoid bones).","zh":"翼点：位于头骨侧面的一个小型“H”形区域，是额骨、顶骨、颞骨与蝶骨交汇处。"},"examples":[{"en":"In anatomy class, we learned to locate the pterion on the lateral skull.","zh":"在解剖课上，我们学习在头骨侧面定位翼点。"},{"en":"Trauma near the pterion can be dangerous because important vessels lie beneath it.","zh":"翼点附近的外伤可能很危险，因为其下方有重要血管。"}]}],"synonyms":["cranial landmark","skull suture junction"],"phonetic":"/ˈtɪriən/","extraExplanation":["“pterion”来自希腊语词根，与“翼（wing）”相关，指该区域与蝶骨（sphenoid bone，名称也含“楔/蝶”意象）相邻的形态联想。","在临床与法医学语境中，翼点常被提及，是因为它相对较薄，且其深部邻近脑膜中动脉分支；因此头部撞击评估时可能会特别关注这一部位。"]}
{"word":"pteris","summary":{"en":"Pteris is a type (genus) of fern, often grown as an ornamental plant.","zh":"Pteris 指一种蕨类植物属，常见于自然环境中，也常作观赏植物栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of ferns (often called “brakes”), with feather-like fronds; some species are grown as houseplants.","zh":"一种蕨类植物属（常被称为“brake/蕨”），叶片多呈羽状分裂；其中一些品种常作观赏或室内盆栽。"},"examples":[{"en":"She keeps a pteris fern on the windowsill because it likes bright, indirect light.","zh":"她在窗台养了一盆铁线蕨属（pteris）的蕨类，因为它喜欢明亮的散射光。"},{"en":"In the shade near the stream, pteris spread under the trees.","zh":"在溪边的树荫下，pteris 在林下蔓延开来。"}]}],"synonyms":["brake (fern)","fern"],"phonetic":"/ˈtɛrɪs/","extraExplanation":["“Pteris”中的 p 不发音，读起来像“TER-iss”。","词源来自希腊语 pterís（蕨类植物），并与 pterón（“翅膀”）同源，常用来形容蕨叶像羽翼一样展开。","园艺语境里你也可能看到具体种名，如 Pteris cretica（克里特蕨）等。"]}
{"word":"pterna","summary":{"en":"“pterna” is not a common English word; it is most likely a scientific genus name (Pterna) or a misspelling of a pter- word related to “wings.”","zh":"“pterna”不是常见英语词；更可能是学名属名（Pterna），或是与“翅膀/飞行”有关的 pter- 词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; most often seen as a scientific (Latin/Greek-based) name, usually capitalized as **Pterna**, used in biological classification (taxonomy) for a genus name in some sources.","zh":"不是现代英语中的常见词；最常见的用法是作为科学命名（拉丁/希腊语系）的名称，通常写作 **Pterna**（首字母大写），在一些资料中用作生物分类学里的“属名”。"},"examples":[{"en":"In some taxonomic lists, **Pterna** appears as a genus name.","zh":"在一些分类学名录中，**Pterna** 会作为一个属名出现。"},{"en":"Because it’s a scientific name, you usually see it in italics: *Pterna*.","zh":"因为它是学名，所以通常会用斜体：*Pterna*。"}]},{"partOfSpeech":"other","definition":{"en":"A likely misspelling of an English word beginning with **pter-** (from Greek, meaning “wing”), such as **pterodactyl** or **Pteranodon**.","zh":"很可能是以 **pter-** 开头的英语词的拼写错误（源自希腊语，意为“翅膀/翼”），例如 **pterodactyl（翼手龙）** 或 **Pteranodon（无齿翼龙）**。"},"examples":[{"en":"Did you mean **Pteranodon** (a type of flying reptile)?","zh":"你是不是想写 **Pteranodon（无齿翼龙）**？"},{"en":"Words with **pter-** often relate to wings or flying.","zh":"带 **pter-** 的词常和“翅膀”或“飞行”有关。"}]}],"phonetic":"/ˈtɝnə/","extraExplanation":["以 **pter-** 开头的词里，开头的 **p** 在现代英语里通常不发音（如 *pterodactyl* 读作 /ˌtɛrəˈdæktɪl/）。所以 **Pterna** 很可能会按 **TUR-nuh** 这样的感觉来读。","如果你告诉我它出现的句子或领域（生物学？化石？游戏/小说？），我可以更准确判断你想查的词是哪一个。"]}
{"word":"ptero","summary":{"en":"“ptero-” is a scientific prefix meaning “wing/feather; related to wings.”","zh":"“ptero-” 是一个科学构词前缀，表示“翅膀/羽毛；与翅膀有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form (prefix) meaning “wing,” “feather,” or “having wings,” used in scientific words.","zh":"（构词前缀）表示“翅膀 / 羽毛 / 有翼的”，常见于科学词汇中。"},"examples":[{"en":"The word “pterodactyl” starts with ptero-, meaning it is related to wings.","zh":"“pterodactyl（翼龙）”以 ptero- 开头，表示它与“翅膀”有关。"},{"en":"In biology, terms like “pterygium” are connected to wing-like structures.","zh":"在生物学中，像 “pterygium（翼状胬肉）”这类词与“翼状/像翅膀的结构”有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare) a shortened form referring to a pterosaur/pterodactyl, especially in casual writing.","zh":"（非正式，较少见）在随意写法中，作为 pterosaur / pterodactyl（翼龙类）的简写。"},"examples":[{"en":"Some fans call it a “ptero” when talking about flying reptiles in games.","zh":"有些玩家在聊游戏里的飞行爬行动物时，会把它简称为 “ptero”。"}]}],"synonyms":["pter-","ptery-"],"phonetic":"/ˈtɛroʊ/","extraExplanation":["ptero- 来自希腊语 pteron（翅膀）。在英语里，很多以 pter- 开头的词，开头的 p 通常不发音：如 pterodactyl 常读作 /ˌtɛrəˈdæk.tɪl/（听起来像以 t 开头）。","常见相关词：pterosaur（翼龙类）、pterodactyl（翼龙/翼手龙，口语也常泛指翼龙）、pterygium（翼状胬肉，医学）。"]}
{"word":"pterobranchia","summary":{"en":"Pterobranchia: a class of small, tube-dwelling, often colonial marine hemichordates.","zh":"Pterobranchia：半索动物门中的翼鳃纲，小型海洋管栖动物，常群体生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of small, colonial marine animals in the phylum Hemichordata, often living in tubes and feeding with ciliated tentacles (includes graptolites’ close relatives).","zh":"翼鳃纲（半索动物门的一纲）：一类体型很小、常成群体生活的海洋动物，常住在管状结构中，用带纤毛的触手取食（与笔石类有近缘关系）。"},"examples":[{"en":"Pterobranchia are hemichordates, so they are related (distantly) to chordates.","zh":"翼鳃纲属于半索动物门，因此与脊索动物（如鱼类、人类）有较远的亲缘关系。"},{"en":"In some textbooks, Pterobranchia is introduced when discussing the evolution of early marine animals.","zh":"一些教材会在讨论早期海洋动物的演化时介绍翼鳃纲。"}]}],"synonyms":["pterobranchs"],"phonetic":"/ˌtɛrəbræŋˈkiə/","extraExplanation":["“Pterobranchia”来自希腊语：ptero-（“翼、翅”）+ branchia（“鳃”），名称指它们用于摄食/呼吸的“翼状”触手结构。","翼鳃纲常见代表包括 Rhabdopleura 和 Cephalodiscus；其中一些已灭绝类群与古生代常见化石“笔石（graptolites）”关系密切，因此在古生物学中也很重要。","在现代分类中，翼鳃纲通常与肠鳃纲（Enteropneusta）一起归入半索动物门；学习时可把它理解为“半索动物里偏小型、管栖、群体生活的一支”。"]}
{"word":"pterobranchiate","summary":{"en":"An adjective meaning “related to pterobranchs (Pterobranchia).”","zh":"形容词：表示“与羽鳃类（Pterobranchia）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of the Pterobranchia (pterobranchs), a small group of marine animals.","zh":"与羽鳃类（Pterobranchia，羽鳃动物）有关的；具有羽鳃类特征的（海洋小型动物类群）。"},"examples":[{"en":"Scientists compared pterobranchiate features with those of other hemichordates.","zh":"科学家将羽鳃类的特征与其他半索动物进行了比较。"},{"en":"The fossil showed a pterobranchiate lifestyle, likely living in a tube on the seafloor.","zh":"化石显示出羽鳃类的生活方式，可能生活在海底的管状结构中。"}]}],"synonyms":["pterobranchian","pterobranch-related"],"phonetic":"/ˌtɛrəˈbræŋkiˌeɪt/","extraExplanation":["“pterobranchiate”是一个较少见的学术形容词，常用于动物学/古生物学论文中。它通常用来描述“像羽鳃类那样”的形态或分类特征，而不是日常英语。","羽鳃类属于半索动物门（Hemichordata）的一支，体型很小，多为海洋底栖，常在分泌的管中生活，并通过触手状结构滤食。你也可能在文献里看到相关词：pterobranch（名词，羽鳃动物）、Pterobranchia（类群名）、pterobranchian（更常见的形容词/名词形式）。"]}
{"word":"pterocarpous","summary":{"en":"Pterocarpous describes plants that have winged fruits or seeds.","zh":"pterocarpous 指植物具有带翅的果实或种子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having winged fruits or seeds (for example, fruits with a flat “wing” that helps them travel by wind).","zh":"（植物）具翅果或具翅种子；果实带有“翅”状结构，常有助于随风传播。"},"examples":[{"en":"Many maples produce winged fruits, so they can be described as pterocarpous.","zh":"许多槭树会结出带翅的果实，因此可以说它们是 pterocarpous（具翅果的）。"},{"en":"In this field guide, the plant is identified partly by its pterocarpous fruit.","zh":"在这本野外识别手册中，这种植物部分是凭借它的具翅果特征来鉴定的。"}]}],"synonyms":["wing-fruited","winged-fruited","winged-seeded"],"phonetic":"/ˌtɛr.oʊˈkɑr.pəs/","extraExplanation":["词源提示：ptero- 来自希腊语，意为“翅膀”；-carpous 来自希腊语 karpos，意为“果实”。合起来就是“带翅的果实/种子”。","使用场景：这是偏专业的植物学形容词，常见于植物志、分类检索表、学术描述中；日常英语更常说“winged fruit/seed”。"]}
{"word":"pterocarpus","summary":{"en":"Pterocarpus is a genus of tropical hardwood trees (Fabaceae), valued for red-toned timber and resin; some are known as padauk.","zh":"Pterocarpus 指豆科紫檀属的热带硬木树，因红色调木材和树脂而受重视，部分物种称为 padauk（帕杜克木）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees in the pea family (Fabaceae), known for valuable hardwoods and resin; some species are called padauk or (in trade) rosewood.","zh":"紫檀属（豆科）的一类热带树木属名，以名贵硬木和树脂闻名；部分物种在贸易中称为“缅甸花梨/帕杜克木（padauk）”或被归入“玫瑰木（rosewood）”类。"},"examples":[{"en":"The furniture was made from a Pterocarpus species prized for its deep red wood.","zh":"这件家具使用了紫檀属某种树材，以深红色木材而珍贵。"},{"en":"Scientists studied Pterocarpus trees to understand how tropical forests recover after logging.","zh":"科学家研究紫檀属树木，以了解热带森林在采伐后的恢复过程。"}]}],"synonyms":["padauk (common name for some species)","rosewood (trade term; sometimes)"],"phonetic":"/ˌtɛrəˈkɑrpəs/","extraExplanation":["“Pterocarpus”来自希腊语词根：ptero-（“翅膀”）+ karpos（“果实”），指它们常见的带“翼”的果荚，有助于随风传播。","日常英语中更常说具体树种或木材名（如 padauk、African padauk 等）；在木材贸易里有时会被笼统归到“rosewood（玫瑰木）”类别，但不同地区/法规对名称与归类可能不同。"]}
{"word":"pterocarya","summary":{"en":"Pterocarya is a genus of wingnut trees in the walnut family.","zh":"Pterocarya 指胡桃科的翅果胡桃属（wingnut）树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of walnut-family trees called wingnuts, known for their long hanging clusters of winged nuts","zh":"翅果胡桃属（又称“翅果核桃属”），胡桃科的一属落叶乔木，以成串下垂、带“翅”的坚果果实为特征"},"examples":[{"en":"Pterocarya trees are often planted in parks for their broad shade and dramatic hanging fruit clusters.","zh":"翅果胡桃属的树常被种在公园里，因为树冠大、遮阴好，而且下垂的果序很醒目。"},{"en":"The botanist identified the specimen as Pterocarya from its winged nuts and pinnate leaves.","zh":"植物学家根据带翅的坚果和羽状复叶判断标本属于翅果胡桃属。"}]}],"synonyms":["wingnut (tree)","wingnut genus","Pterocarya (scientific name)"],"phonetic":"/ˌtɛroʊˈkæriə/","extraExplanation":["读音提示：单词开头的 p 通常不发音（类似 psychology）。","词源小知识：来自希腊语 pteron（“翅膀”）+ karyon（“坚果/核”），字面意思就是“长翅的坚果”。","常见语境：多用于植物学、园林、树木鉴定等场景；日常英语里更常用的俗名是 wingnut（翅果胡桃）。"]}
{"word":"pterocaulon","summary":{"en":"Pterocaulon: a botanical genus of daisy-family flowering plants, mostly in warm parts of the Americas.","zh":"Pterocaulon：菊科的一种植物属，主要分布于美洲温暖地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the aster (daisy) family (Asteraceae), found mainly in warm regions of the Americas; some species are aromatic herbs.","zh":"一种菊科（Asteraceae）的开花植物属（Pterocaulon），主要分布在美洲温暖地区；部分物种为具芳香气味的草本植物。"},"examples":[{"en":"Pterocaulon is a genus in the daisy family.","zh":"Pterocaulon（翼茎草属）是菊科的一个植物属。"},{"en":"Some Pterocaulon species have aromatic leaves.","zh":"一些翼茎草属的物种叶片带有芳香气味。"}]}],"synonyms":["(no common everyday synonyms; usually referred to by the genus name)"],"phonetic":"/ˌtɛroʊˈkɔlən/","extraExplanation":["“Pterocaulon”是拉丁化的植物学名称，常用于学术写作、植物志与标本标签中；日常英语里不常见。","在科研或自然观察语境中，通常会把它与更具体的分类一起使用，例如“Pterocaulon species（翼茎草属的某个物种）”或写成“Pterocaulon sp.”来表示未确定到种的个体。"]}
{"word":"pterocera","summary":{"en":"Pterocera is a scientific name used for (or historically used for) “spider conchs,” large tropical sea snails with spiny, finger-like shells.","zh":"Pterocera 是“蜘蛛螺/蜘蛛海螺”等热带大型海螺的学名（或历史上使用过的属名），其贝壳常有细长的指状棘突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large tropical sea snails (marine gastropods) known for shells with long, finger-like projections; often called “spider conchs.”","zh":"一种热带大型海螺（海洋腹足类）的属名，以外壳上细长、指状突起著称；常被称为“蜘蛛螺/蜘蛛海螺”。"},"examples":[{"en":"Collectors often prize pterocera shells for their dramatic, wing-like spines.","zh":"收藏者常因其夸张、像翅膀一样的棘突而珍爱 pterocera 的贝壳。"},{"en":"In some older books, you may see the spider conch labeled as Pterocera.","zh":"在一些较旧的书里，你可能会看到蜘蛛螺被标注为 Pterocera。"}]}],"synonyms":["spider conch","Lambis (modern genus name in many sources)"],"phonetic":"/ˌtɛrəˈsɛrə/","extraExplanation":["“Pterocera”来自希腊语词根：ptero-（翅膀）+ keras（角），指贝壳边缘伸出的“角状/翼状”突起。","分类学上它在不同资料里可能出现变动：一些现代来源更常把“蜘蛛螺”归入属名 Lambis，因此你可能会看到 Pterocera 被当作旧称、同物异名或历史分类用法。"]}
{"word":"pteroceras","summary":{"en":"Pteroceras is an older scientific genus name for “spider conch” sea snails, often now placed in Lambis.","zh":"Pteroceras 是“蜘蛛凤螺/蜘蛛海螺”等海螺的较旧属名，许多现多归入 Lambis 属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name formerly used for certain large tropical sea snails with long, finger-like projections on the shell (often called “spider conchs”); many species are now commonly classified under the genus Lambis.","zh":"（旧属名）指某些热带大型海螺的一个属名，外壳边缘常有细长“指状”突起（常称“蜘蛛凤螺/蜘蛛海螺”）；许多物种现在常归入 Lambis 属。"},"examples":[{"en":"The museum label listed the shell as Pteroceras, but newer sources call it Lambis.","zh":"博物馆标签把这个贝壳标为 Pteroceras，但较新的资料称它为 Lambis。"},{"en":"Collectors sometimes use the older name Pteroceras when talking about spider conch shells.","zh":"收藏者谈到蜘蛛凤螺的贝壳时，有时会用较旧的名称 Pteroceras。"}]}],"synonyms":["spider conch","Lambis (modern classification)"],"phonetic":"/ˌtɛrəˈsɛrəs/","extraExplanation":["这是一个拉丁化的学名，来自希腊语词根 ptero-（“翼、翅”）与 keras（“角”），形容贝壳外缘像“带翅的角”一样伸出。","在现代分类中，Pteroceras 常被视为与 Lambis 相关或并入 Lambis；不同资料（尤其是旧书、旧图鉴、收藏圈）可能仍会看到 Pteroceras 的用法。"]}
{"word":"pterocles","summary":{"en":"Pterocles is the scientific genus name for certain sandgrouse, desert birds of Africa and Asia.","zh":"Pterocles 是沙鸡属的学名（属名），指一类生活在非洲与亚洲干旱地区的沙鸡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sandgrouse (desert-dwelling birds) found mainly in Africa and Asia; used as a scientific (Latin) name in biology.","zh":"（生物学拉丁学名）沙鸡属：一种主要分布于非洲和亚洲、常见于干旱与沙漠地区的鸟类属名。"},"examples":[{"en":"In the field guide, several desert birds are listed under the genus Pterocles.","zh":"在野外鸟类图鉴中，有几种沙漠鸟类被归入沙鸡属（Pterocles）。"},{"en":"A researcher recorded a Pterocles species near a dry riverbed at dawn.","zh":"一位研究者在黎明时分于干涸河床附近记录到一种沙鸡属（Pterocles）的鸟。"}]}],"synonyms":["sandgrouse (genus)"],"phonetic":"/ˈtɛrəˌkliːz/","extraExplanation":["“Pterocles”是分类学中的属名，通常在英文写作里用斜体（Pterocles），首字母大写；在口语或非学术语境中，人们更常说“sandgrouse（沙鸡）”而不是属名。","沙鸡以适应干旱环境而闻名：一些种类能长距离飞行到水源，并把水带回巢区（常被用作科普材料中的典型例子）。"]}
{"word":"pterocletes","summary":{"en":"“pterocletes” is a rare scientific-form term used to refer to sandgrouse (genus *Pterocles*).","zh":"“pterocletes”是少见的科学用词形式，用来指沙鸡（沙鸡属 *Pterocles*）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific name referring to sandgrouse birds (genus *Pterocles*); used in zoological/ornithological writing","zh":"（科学名）指沙鸡一类鸟（沙鸡属 *Pterocles*）；多见于动物学/鸟类学文本"},"examples":[{"en":"In older field guides, some sandgrouse are listed under *Pterocles* (sometimes written as “pterocletes” in notes or labels).","zh":"在较早的野外指南中，一些沙鸡会归在 *Pterocles*（有时在笔记或标签里写成“pterocletes”）。"},{"en":"The researcher compared feeding behavior across several *Pterocles* species.","zh":"研究者比较了几种沙鸡属（*Pterocles*）物种的取食行为。"}]}],"synonyms":["sandgrouse","Pterocles"],"phonetic":"/ˌtɛrəˈkliːtiz/","extraExplanation":["“pterocletes”并不是现代英语里常见的通用词，更常见的写法是属名 *Pterocles*（沙鸡属），或直接用普通名 *sandgrouse*（沙鸡）。如果你是在某本书、标本标签或旧资料中看到“pterocletes”，它很可能是在指这一属的鸟，或是对属名的变体/误写。"]}
{"word":"pteroclidae","summary":{"en":"Pteroclidae is the scientific family name for sandgrouse—desert-adapted birds mainly in Africa and Asia.","zh":"Pteroclidae 是沙鸡科的学名，指主要分布在非洲和亚洲、适应沙漠等干旱环境的鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds (sandgrouse) found mainly in dry regions of Africa and Asia, known for strong flying and living in deserts and open plains","zh":"（鸟类）沙鸡科：主要分布在非洲和亚洲干旱地区的一类鸟，善飞行，常见于沙漠与开阔荒原"},"examples":[{"en":"The Pteroclidae are adapted to life in arid environments.","zh":"沙鸡科鸟类适应了干旱环境的生活。"},{"en":"In some deserts, sandgrouse (Pteroclidae) travel long distances to reach water.","zh":"在一些沙漠里，沙鸡科鸟类会长距离飞行去找水源。"}]}],"synonyms":["sandgrouse (family)"],"phonetic":"/ˌtɛrəˈklaɪdi/","extraExplanation":["“Pteroclidae”是生物分类学中的“科名”，对应常见英文名为 sandgrouse（沙鸡/沙鸡类）。在自然纪录片或鸟类图鉴里更常见的是 sandgrouse，而不是这个拉丁化科名。","词源上来自希腊语元素：ptero-（翅膀）+ -clidae（与“分支/类群”相关的科名构词），整体用于学术分类命名。","发音上这是学术拉丁化词，实际口语中不同地区可能有轻微差异；学习时掌握 sandgrouse（更常用）会更实用。"]}
{"word":"pteroclomorphae","summary":{"en":"Pteroclomorphae is a scientific name for a proposed clade of pterosaurs, often meaning pterosaurs close to or including pterodactyloids.","zh":"Pteroclomorphae 是一个学术用名，指一种被提出的翼龙演化支，常用于表示与（或包含）翼手龙类关系更近的一群翼龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proposed clade (evolutionary group) of pterosaurs, used in some paleontology classifications—generally referring to more “advanced” pterosaurs closer to (or including) the pterodactyloids.","zh":"（古生物学分类中）一种被提出的翼龙“演化支/类群”名称；一般指较“进步”的翼龙谱系，通常与（或包含）翼手龙类（pterodactyloids）关系更近的一群。"},"examples":[{"en":"Some papers place Pteroclomorphae within the broader pterosaur family tree, but the exact definition can vary by author.","zh":"一些论文会把 Pteroclomorphae 放在更大的翼龙演化树中，但具体定义可能因作者而异。"},{"en":"In a phylogenetic analysis, the researcher tested whether certain fossils fall inside Pteroclomorphae.","zh":"在系统发育分析中，研究者检验某些化石是否落在 Pteroclomorphae 之内。"}]}],"synonyms":["pterodactyloids (related, not identical)","pterosaur clade (general)"],"phonetic":"/ˌtɛrəˌkloʊˈmɔrfiː/","extraExplanation":["这是一个主要出现在学术论文里的“分类/分支名称”，并不像“pterosaur（翼龙）”“pterodactyl（翼手龙）”那样常见于大众科普。不同研究者可能会用不同的分支定义（clade definition），因此阅读时最好看清作者在文中给出的界定方式。","词尾 -ae 常见于拉丁化的学名/类群名，常表示复数或类群层级（读者可把它理解为“某某类/某某群”）。"]}
{"word":"pteroclomorphic","summary":{"en":"A very rare/possibly invented adjective meaning “wing-shaped; having a wing-like form.”","zh":"一个极少见／可能为自造的形容词，意为“翼状的；外形像翅膀的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / likely coined) having a wing-like form; wing-shaped in appearance.","zh":"（极少见／可能为自造词）呈翼状的；外形像翅膀的。"},"examples":[{"en":"In his notes, the artist described the creature as “pteroclomorphic,” with shoulder plates that looked like folded wings.","zh":"在笔记里，艺术家把那生物写成“pteroclomorphic”，说它的肩甲看起来像折起的翅膀。"},{"en":"The designer wanted a pteroclomorphic silhouette—broad at the top and tapering like a wing.","zh":"设计师想要一种“pteroclomorphic”的轮廓——上宽下收，像翅膀一样。"}]}],"synonyms":["wing-shaped","alate","pteromorphic","winglike"],"phonetic":"ˌtɛrəˌklɑrˈmɔrfɪk","extraExplanation":["这个词不常见，在主流英语词典中通常查不到，更像是基于词根“ptero-”（与“翅膀”有关，如 pterodactyl 翼龙）+ “-morphic”（形态的）拼出来的创作词。","如果你是在论文、小说或设定集中看到它，它多半用于描写“像翅膀一样的形状/结构”。正式写作中更常用的表达有 wing-shaped、alate、pteromorphic。","也可能存在拼写误差：如果你能提供上下文句子，我可以帮你判断作者原本想用的标准词。"]}
{"word":"pterodactyl","summary":{"en":"A prehistoric flying reptile; often used casually for any pterosaur.","zh":"史前会飞的爬行动物；口语中常泛指翼龙类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flying reptile that lived in prehistoric times; commonly used to mean any pterosaur (not technically a dinosaur)","zh":"翼手龙；史前会飞的爬行动物（口语中常泛指翼龙类，但严格说不属于恐龙）"},"examples":[{"en":"The museum has a model of a pterodactyl hanging from the ceiling.","zh":"博物馆天花板上吊着一个翼手龙模型。"},{"en":"In movies, a pterodactyl is often shown swooping down and screeching.","zh":"在电影里，翼手龙常被拍成俯冲下来尖叫的样子。"}]}],"synonyms":["pterosaur","winged reptile"],"phonetic":"/ˌtɛrəˈdæk.təl/","extraExplanation":["“Pterodactyl”来自希腊语词根：ptero-（翅膀）+ dactyl（手指），意思是“有翅的手指”，因为它的翅膀由延长的手指支撑。","日常英语里很多人用 pterodactyl 指所有翼龙，但在科普语境中更常用更准确的词是 pterosaur（翼龙类）。","发音上常见拼写误读：字母 p 不发音，开头读作 /ˌtɛrəˈdæk.təl/。","在流行文化里（例如电影、儿童读物）“pterodactyl”非常常见，属于“恐龙”主题的一部分，但从分类学角度它是飞行爬行动物而不是恐龙。"]}
{"word":"pterodactyli","summary":{"en":"A pterodactyl is a prehistoric flying reptile (a pterosaur). “Pterodactyli” is an uncommon plural form; “pterodactyls” is more common in modern English.","zh":"pterodactyl 指一种史前会飞的爬行动物（翼龙类）。pterodactyli 是较少见的复数写法；现代英语更常用 pterodactyls。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common form: **pterodactyl**; plural sometimes written as **pterodactyls** or **pterodactyli**.) A type of prehistoric flying reptile (a pterosaur) that lived long before humans.\nExamples:\n• en: In the museum, we saw a pterodactyl skeleton hanging from the ceiling. | zh: 在博物馆里，我们看到一具翼手龙的骨架悬挂在天花板上。\n• en: Many people call any flying dinosaur a “pterodactyl,” but it was actually a pterosaur. | zh: 很多人把所有会飞的“恐龙”都叫“翼手龙”，但它其实属于翼龙类（pterosaur）。","zh":"（常见形式：**pterodactyl**；复数有时写作 **pterodactyls** 或 **pterodactyli**。）一种史前会飞的爬行动物（翼龙类），生活在人类出现之前。\n例句：\n• en: In the museum, we saw a pterodactyl skeleton hanging from the ceiling. | zh: 在博物馆里，我们看到一具翼手龙的骨架悬挂在天花板上。\n• en: Many people call any flying dinosaur a “pterodactyl,” but it was actually a pterosaur. | zh: 很多人把所有会飞的“恐龙”都叫“翼手龙”，但它其实属于翼龙类（pterosaur）。"},"examples":[{"en":"In the museum, we saw a pterodactyl skeleton hanging from the ceiling.","zh":"在博物馆里，我们看到一具翼手龙的骨架悬挂在天花板上。"},{"en":"Many people call any flying dinosaur a “pterodactyl,” but it was actually a pterosaur.","zh":"很多人把所有会飞的“恐龙”都叫“翼手龙”，但它其实属于翼龙类（pterosaur）。"}]}],"synonyms":["pterosaur","flying reptile"],"phonetic":"/ˌtɛrəˈdæk.təl/","extraExplanation":["“pterodactyli”看起来像拉丁化复数，但在现代英语里更常用规则复数“pterodactyls”。\n词源来自希腊语：pteron（翅膀）+ daktylos（手指），指它们的“翅膀”由延长的手指支撑。","日常英语里很多人把任何“会飞的恐龙”都叫pterodactyl；严格说它们不是恐龙（dinosaur），而是翼龙类（pterosaur）。"]}
{"word":"pterodactylian","summary":{"en":"Pterodactylian means “related to pterodactyls/pterosaurs,” and less commonly can mean “a pterodactyl-like flying reptile.”","zh":"pterodactylian 意为“与翼手龙/翼龙类有关的”，较少见地也可作名词指“一只翼手龙类飞行爬行动物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pterodactyls (extinct flying reptiles) or to the larger group of pterosaurs.","zh":"与翼手龙（已灭绝的飞行爬行动物）有关的；或与翼龙类（更大的类群）有关的。"},"examples":[{"en":"The museum has a pterodactylian fossil with an impressively long wing bone.","zh":"博物馆里有一具翼手龙类化石，翼骨长得令人惊叹。"},{"en":"Artists often give pterodactylian creatures bat-like wings, but scientists describe a thin membrane supported by a long finger.","zh":"艺术作品常把翼手龙类画成像蝙蝠一样的翅膀，但科学家描述的是由一根细长手指支撑的薄膜翼。"}]},{"partOfSpeech":"n.","definition":{"en":"A pterodactyl-like flying reptile; a member of the pterosaur group (informal/rare as a noun).","zh":"翼手龙类的飞行爬行动物；翼龙类的一员（作名词时较少见/较不正式）。"},"examples":[{"en":"In the story, a pterodactylian circles above the cliffs at dusk.","zh":"在故事里，一只翼手龙类在黄昏时分盘旋在悬崖上方。"}]}],"synonyms":["pterosaur","pterodactyl (adj., informal)","pterosaurian (rare)"],"phonetic":"/ˌtɛrəˈdæk.tɪ.li.ən/","extraExplanation":["“pterodactylian”来自“pterodactyl”（翼手龙）加形容词后缀“-ian”，常用于表示“与……有关的”。在日常英语里，人们更常说“pterosaur”（翼龙）或直接说“pterodactyl”（口语泛指）。","拼写里开头的“p”在“pterodactyl”家族词中通常不发音（源自希腊语词根），所以读音从“t”开始。"]}
{"word":"pterodactylic","summary":{"en":"A rare adjective meaning “pterodactyl-like.”","zh":"较少见的形容词，意为“像翼手龙的／与翼手龙有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a pterodactyl (a flying reptile from the time of the dinosaurs).","zh":"与翼手龙有关的；像翼手龙的（史前会飞的爬行动物）。"},"examples":[{"en":"The artist gave the creature pterodactylic wings to make it look ancient and wild.","zh":"画家给这个生物画上了翼手龙般的翅膀，让它看起来古老又野性。"},{"en":"In the movie, a pterodactylic shadow passes over the desert.","zh":"电影里，一道翼手龙般的影子掠过沙漠。"}]}],"synonyms":["pterodactyl-like","pterosaur-like","prehistoric-looking"],"phonetic":"/ˌtɛrəˈdækˌtɪlɪk/","extraExplanation":["“pterodactylic”比较少见，多用于文学描写、影评或艺术评论里，用来营造“史前、怪诞、尖翼”的画面感。日常英语里更常说“pterodactyl-like”或直接用“pterodactyl”。","词源来自希腊语：ptero-（翅膀）+ dactyl（手指），因为翼手龙的“翅膀”由延长的手指骨支撑。"]}
{"word":"pterodactylid","summary":{"en":"A pterodactylid is an extinct flying reptile in the family Pterodactylidae.","zh":"pterodactylid 指翼手龙科的一员：一种已灭绝的飞行爬行动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pterosaur of the family Pterodactylidae (an extinct group of flying reptiles), such as Pterodactylus","zh":"翼手龙科（Pterodactylidae）的一员；一种已灭绝的飞行爬行动物，例如翼手龙属（Pterodactylus）"},"examples":[{"en":"Scientists identified the fossil as a small pterodactylid from the Late Jurassic.","zh":"科学家将这块化石鉴定为晚侏罗世的一种小型翼手龙科成员。"},{"en":"In the museum display, a pterodactylid is shown gliding above the dinosaurs.","zh":"在博物馆的展览中，一只翼手龙科动物被展示成在恐龙上空滑翔的样子。"}]}],"synonyms":["pterosaur","pterodactyl (informal/common use)"],"phonetic":"ˌtɛrəˈdæk.tɪl.ɪd","extraExplanation":["“pterodactylid”常见于科普或学术语境，指“翼手龙科”的成员，比口语里常说的“pterodactyl（翼手龙）”更精确。日常交流里，人们常用“pterodactyl”泛指某些翼龙，但严格说“pterodactyl”也可以特指某些属/种。","词源来自希腊语：pteron（翅膀）+ dactylos（手指）。翼龙的“翅膀”由延长的手指支撑，因此得名。","发音提示：重音在“DAC”附近，读作类似“TER-uh-DACK-tuh-lid”。"]}
{"word":"pterodactylidae","summary":{"en":"Pterodactylidae is the scientific name for a family of extinct flying reptiles (pterosaurs), including Pterodactylus and close relatives.","zh":"Pterodactylidae 指翼手龙科，是一类已灭绝的飞行爬行动物（翼龙）的科学分类名称，包括翼手龙属及其近亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct flying reptiles (pterosaurs) that includes Pterodactylus and its close relatives; known for long wings and, in many species, a long beak with teeth","zh":"（古生物）翼手龙科：已灭绝的飞行爬行动物（翼龙类）的一科，包括翼手龙属（Pterodactylus）及其近亲；常见特征是长翼，许多种类有细长的喙并带牙齿"},"examples":[{"en":"Pterodactylidae fossils are mostly found in Late Jurassic rocks.","zh":"翼手龙科的化石多见于晚侏罗世的岩层中。"},{"en":"In the museum label, Pterodactylidae is listed under Pterosauria (pterosaurs).","zh":"在博物馆的展牌上，翼手龙科被归在翼龙目（Pterosauria）之下。"}]}],"synonyms":["pterodactylids","Pterodactylidae (taxonomic family)"],"phonetic":"/ˌtɛrəˈdæk.tɪˌlaɪ.di/","extraExplanation":["“Pterodactylidae”是拉丁化的生物分类名称，常用于学术写作与博物馆说明；日常英语里更常听到“pterodactyl”（泛指翼龙，且常被不严谨地当作一种恐龙）。","词源来自希腊语：pteron（翅膀）+ daktylos（手指），因为翼龙的翼膜主要由加长的“第四指”支撑。","发音提示：中间的“dactyl”部分常读作 /ˈdæk.tɪl/（类似“DAK-til”）。"]}
{"word":"pterodactyloid","summary":{"en":"Pterodactyloid means “of or belonging to pterodactyloids,” a major group of pterosaurs; it can also mean a member of that group.","zh":"pterodactyloid 指“与翼手龙类相关/属于翼手龙类的”，也可作名词表示“翼手龙类的一员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or belonging to pterodactyloids, a major group of pterosaurs (flying reptiles) that lived during the age of dinosaurs.","zh":"（形容词）与翼手龙类相关的；属于翼手龙类的。翼手龙类是翼龙（会飞的史前爬行动物）中的一大类，生活在恐龙时代。"},"examples":[{"en":"Scientists found a pterodactyloid fossil with a long beak and a large head crest.","zh":"科学家发现了一块翼手龙类化石，它有长喙和明显的头冠。"},{"en":"The museum exhibit compares early pterosaurs with later pterodactyloid species.","zh":"博物馆展览对比了早期翼龙与较晚出现的翼手龙类物种。"}]},{"partOfSpeech":"n.","definition":{"en":"A pterodactyloid pterosaur (a member of the pterodactyloids).","zh":"（名词）翼手龙类个体；翼手龙类翼龙（翼手龙类的一员）。"},"examples":[{"en":"This pterodactyloid had a wingspan of nearly five meters.","zh":"这只翼手龙类的翼展接近五米。"},{"en":"Researchers debated whether the specimen was a juvenile pterodactyloid or a different species.","zh":"研究人员讨论这个标本究竟是幼年翼手龙类还是另一个物种。"}]}],"synonyms":["pterodactyloid pterosaur","pterodactylid (more specific in some scientific contexts)"],"phonetic":"/ˌtɛrəˈdæk.təˌlɔɪd/","extraExplanation":["“pterodactyloid”常见于古生物学与科普写作中，日常英语里不常用。它指的是翼龙中的“翼手龙类”（Pterodactyloidea），与更早期、尾巴较长的“非翼手龙类翼龙”相对。","词源上可拆解理解：ptero-（翼、翅膀）+ dactyl-（手指）+ -oid（……样的/……类的）。翼龙的翅膀由延长的“第四指”支撑，这也是命名的背景。","学习提示：大众文化里常把所有翼龙都叫“pterodactyl”，但在科学语境中，“pterodactyloid”更精确，强调所属的大类群。"]}
{"word":"pterodactylous","summary":{"en":"A rare adjective meaning “pterodactyl-like; winged like a pterosaur.”","zh":"少见形容词，意为“似翼龙的；具有翼龙般翅膀/翼状外形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having wings like a pterodactyl; winged in a way that resembles certain extinct flying reptiles.","zh":"似翼龙的；具有类似翼龙（某些已灭绝飞行爬行动物）那样的翅膀结构的。"},"examples":[{"en":"In the exhibit, a pterodactylous creature hung from the ceiling with its wings spread wide.","zh":"在展览中，一个似翼龙的生物被吊在天花板上，翅膀大大张开。"},{"en":"The illustrator gave the dragon a pterodactylous silhouette to make it feel more prehistoric.","zh":"插画师把龙画成似翼龙的轮廓，让它更有史前感。"}]}],"synonyms":["winged","pterosaur-like","batlike"],"phonetic":"ˌtɛrəˈdæk tɪ ləs","extraExplanation":["这是一个非常少见、偏文学或科普写作的形容词。常用于描写“像翼龙那样的翼”或“翼状外形”。","词源可拆为 ptero-（来自希腊语，意为“翅膀”）+ dactyl（意为“手指/指状结构”）。翼龙的“翅膀”由延长的指骨支撑，因此有这种构词背景。","在日常英语里，人们更常用 winged、batlike、pterosaur-like（更科学）来表达相近意思。"]}
{"word":"pterodactyls","summary":{"en":"“Pterodactyls” means prehistoric flying reptiles (commonly called pterodactyls).","zh":"“pterodactyls”指史前的飞行爬行动物（常说的“翼龙”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large flying reptiles that lived in prehistoric times (often used as a general name for flying reptiles like pterosaurs).","zh":"史前的大型飞行爬行动物（常被泛指为“翼龙”等飞行爬行动物）。"},"examples":[{"en":"Kids often draw pterodactyls with big wings and sharp beaks.","zh":"孩子们常把翼龙画成有大翅膀和尖喙的样子。"},{"en":"In the museum, we saw fossils of pterodactyls hanging from the ceiling.","zh":"在博物馆里，我们看到翼龙化石悬挂在天花板上。"}]}],"synonyms":["pterosaurs","flying reptiles"],"phonetic":"/ˌtɛrəˈdæk.tɪlz/","extraExplanation":["“pterodactyl”来自希腊语：pteron（翅膀）+ dactylos（手指），意思是“翼指”。因为它们的翅膀由延长的手指支撑。","拼写里开头的 p 通常不发音（silent p），读音更像“TER-uh-DAK-til”。","严格来说，“pterodactyl”常被大众用来泛指会飞的“翼龙类”（pterosaurs）；在学术上它也可指特定类群（如 Pterodactylus）。"]}
{"word":"pterodactylus","summary":{"en":"Pterodactylus is the name of a specific genus of extinct flying reptiles (pterosaurs), often casually used to mean “pterodactyl.”","zh":"Pterodactylus 指翼手龙属（一种已灭绝的会飞爬行动物翼龙类），日常也常被泛指为“翼手龙/翼龙”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of pterosaurs (extinct flying reptiles) that lived in the Late Jurassic period; often used more generally to mean “pterodactyl,” a flying reptile from the age of dinosaurs","zh":"翼手龙属：一种生活在侏罗纪晚期的翼龙类（已灭绝的会飞爬行动物）；在日常英语中也常被泛指为“翼手龙/翼手龙类”（类似“pterodactyl”，指史前会飞的爬行动物）"},"examples":[{"en":"In the museum exhibit, Pterodactylus is shown with a long beak and a wide wingspan.","zh":"在博物馆展览中，翼手龙属被展示为长喙、翼展很大的动物。"},{"en":"People often call any pterosaur a “pterodactyl,” but Pterodactylus is a specific genus.","zh":"人们常把任何翼龙都叫作“pterodactyl（翼手龙）”，但 Pterodactylus 实际上是一个特定的属。"}]}],"synonyms":["pterodactyl (informal, general)","pterosaur (broader term)"],"phonetic":"/ˌtɛrəˈdæk.tɪləs/","extraExplanation":["发音与拼写提示：Pterodactylus 的词首 p 在英语里通常不发音（类似 pneumonia、psychology），所以读作 /ˌtɛrəˈdæk.tɪləs/。","词源小知识：来自希腊语 pteron（“翅膀”）+ daktylos（“手指”），因为翼龙的翅膀由被大大延长的“手指骨”支撑。","用法提醒：在科普/影视中常见的“pterodactyl”多是泛称，并不一定指 Pterodactylus；严格的科学语境会区分不同属/种（如 Pteranodon 也常被误叫成 pterodactyl）。"]}
{"word":"pterographer","summary":{"en":"A rare word meaning someone who describes or writes about wings.","zh":"一个较少见的词，指研究并描述“翅膀/翼”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes about or describes wings (especially in zoology/entomology); a writer or specialist focusing on wing structure.","zh":"（尤用于动物学/昆虫学）研究并描述“翅膀/翼”的人；撰写翅膀结构相关内容的作者或研究者。"},"examples":[{"en":"In older scientific books, a pterographer might carefully describe the veins of an insect’s wings.","zh":"在较早的科学著作中，pterographer 可能会仔细描述昆虫翅膀的翅脉。"},{"en":"The museum’s pterographer compared wing shapes across several species of moths.","zh":"博物馆的 pterographer 对比了几种蛾类的翅形差异。"}]}],"synonyms":["wing-morphology researcher","entomologist (in insect context)","zoologist (broadly)"],"phonetic":"/ˌtɛrəˈɡræfər/","extraExplanation":["这个词非常少见，多见于旧式或专业语境。词根来自希腊语：ptero- 表示“翅、翼”（如 pterodactyl 翼手龙），-grapher 表示“记录/书写的人”（如 biographer 传记作者）。因此字面意思就是“写翅膀的人/记录翅膀的人”。","现代英语里更常用的表达通常是 entomologist（昆虫学家）、zoologist（动物学家），或更具体的“a researcher who studies wing morphology（研究翅形/翅膀形态的研究者）”。"]}
{"word":"pterographic","summary":{"en":"Pterographic means “about describing or studying feathers (especially their arrangement).”","zh":"pterographic 指“与羽毛（尤其羽毛分布与排列）的描写或研究有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the description, mapping, or study of birds’ feathers—especially their arrangement on the body (pterography).","zh":"与鸟类羽毛的记录、描写或研究有关的，尤指羽毛在身体上的分布与排列（pterography，羽毛学/羽毛分布记述）。"},"examples":[{"en":"The museum catalog includes pterographic notes describing feather patterns on each specimen.","zh":"博物馆目录里包含了“羽毛学/羽毛分布记述”的注释，用来描述每个标本的羽毛图案。"},{"en":"Researchers used pterographic diagrams to compare feather tracts across species.","zh":"研究人员用羽毛分布图（pterographic diagrams）来比较不同物种的羽区分布。"}]}],"synonyms":["feather-descriptive","ornithological (broader)","descriptive (general)"],"phonetic":"/ˌtɛroʊˈɡræfɪk/","extraExplanation":["词源拆解：ptero- 来自希腊语，意思是“翅膀/羽毛”；-graphic 表示“书写、描绘、记录”。因此 pterographic 字面上就是“关于羽毛/翅膀的描写或记录”。","这是非常偏学术、偏生物学的词，在日常英语中很少见。更常见的表达可能是 feather pattern (羽毛图案)、feather arrangement (羽毛排列)、feather tracts (羽区)。"]}
{"word":"pterographical","summary":{"en":"Pterographical means “about the description/study of wings,” mainly in biology (especially entomology).","zh":"pterographical 指“与翅的描述/研究有关的”，主要用于生物学（尤昆虫学）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pterography: the description or study of wings (especially insect or bird wings), often focusing on wing structure or vein patterns.","zh":"与“翅部描写/翅部研究（pterography）”有关的：指对翅（尤指昆虫或鸟类翅膀）的描述或研究，常涉及翅的结构或翅脉纹理。"},"examples":[{"en":"The paper includes a pterographical key for identifying moth species by wing venation.","zh":"这篇论文包含一个用于通过翅脉来鉴别蛾类物种的翅部描述检索表。"},{"en":"She added pterographical notes to document subtle differences in the butterflies’ wings.","zh":"她补充了翅部描述笔记，用来记录蝴蝶翅膀的细微差异。"}]}],"synonyms":["pterographic","wing-descriptive","relating to wing morphology","relating to wing venation"],"phonetic":"/ˌtɛrəˈɡræfɪkəl/","extraExplanation":["这个词非常少见，实际使用中更常见的是 **pterographic**，或直接说 **wing description / wing morphology / wing venation**（翅的形态/翅脉）。","词根 **ptero-** 来自希腊语 *pteron*（“翅、羽翼”），出现在很多生物学词汇中，如 **pterodactyl**（翼手龙）。","如果你想表达“地理/地图相关”的“graphical”，那可能是拼写混淆；请告诉我你的上下文句子，我可以帮你确认你真正想用的词。"]}
{"word":"pterography","summary":{"en":"Pterography means detailed writing or description of birds’ feathers or wings.","zh":"Pterography 指对鸟类羽毛或翅膀的详细描写/记述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description or detailed writing about birds’ feathers or wings (their form, arrangement, or appearance)","zh":"（鸟类）羽毛或翅膀的描写/详细记述（如形态、排列或外观）"},"examples":[{"en":"Early ornithology books sometimes included pterography to help identify species by their plumage.","zh":"早期的鸟类学书籍有时会加入 pterography，用羽毛特征来帮助辨认物种。"},{"en":"The report’s pterography focused on the wing feathers rather than the bird’s song.","zh":"这份报告的 pterography 重点写翅羽，而不是鸟的鸣声。"}]}],"synonyms":["plumage description","feather description","ornithological description","pterylography (related)"],"phonetic":"ˌtɛrəˈɡræfi","extraExplanation":["这个词非常少见，多见于较老的博物学/鸟类学写作语境。更常用的表达通常是：description of plumage（羽色/羽毛的描述）、feather description（羽毛描述）。","词源：ptero- 来自希腊语，意为“翅膀/羽毛”；-graphy 意为“记录、描写、写作”。","相关但更专业的术语有 pterylography（研究/记录鸟体羽区的分布，即羽域）。"]}
{"word":"pteroid","summary":{"en":"A pteroid is a wrist bone in pterosaurs that supported the wing membrane.","zh":"pteroid 指翼龙手腕处支撑翼膜的一块小骨头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wrist bone in pterosaurs (flying reptiles) that helped support the wing membrane (patagium).","zh":"翼龙（会飞的爬行动物）手腕处的一块小骨头，用来支撑翼膜（翼膜/翼膜组织）。"},"examples":[{"en":"Scientists think the pteroid helped control the front edge of a pterosaur’s wing.","zh":"科学家认为，翼龙的 pteroid（翼掌骨）有助于控制翅膀前缘。"},{"en":"The fossil shows a clear pteroid near the wrist joint.","zh":"这块化石在腕关节附近清楚地显示出 pteroid（翼掌骨）。"}]}],"phonetic":"/ˈtɛrɔɪd/","extraExplanation":["“pteroid”主要用于古生物学/解剖学语境，指翼龙的特殊腕骨。它与支撑翼膜的结构有关，因此常出现在关于翼龙飞行方式、翼膜形状与运动控制的讨论中。","词根上与“pter-（翼、翅膀）”相关（如 pterodactyl），但日常英语中几乎不会用到，通常只在学术或科普文章里出现。"]}
{"word":"pteroma","summary":{"en":"Pteroma means a winglike projection or membranous expansion, mainly used in technical anatomy/zoology contexts.","zh":"pteroma 指“翼状的突起或膜状扩展结构”，主要见于解剖学/动物学等专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winglike process or membranous expansion (a structure shaped like a wing), especially in anatomy or zoology.","zh":"（解剖学/动物学）翼状突起；翼状的膜状扩展结构（形状像翅膀的部分）。"},"examples":[{"en":"The surgeon noted a small pteroma near the joint that looked like a thin flap.","zh":"外科医生注意到关节附近有一个小的翼状突起，看起来像一片薄薄的皮瓣。"},{"en":"Some anatomical texts describe a pteroma as any wing-shaped outgrowth on an organ or bone.","zh":"一些解剖学教材把“pteroma”解释为器官或骨骼上任何翼状的外生结构。"}]}],"synonyms":["winglike projection","alar process","wing-shaped outgrowth"],"phonetic":"/təˈroʊmə/","extraExplanation":["“pteroma”较少见，多出现在专业文献中。词根来自希腊语：pter-（翅膀）+ -oma（结构/肿块/体），因此整体含义是“像翅膀的结构”。","拼写以 p 开头，但在很多以 pter- 开头的英语词中（如 pterodactyl），开头的 p 通常不发音。","相关词：pterygoid（翼状的）、pteron（翅膀/翼部，常见于术语）、pterygium（翼状胬肉，眼科常用）。"]}
{"word":"pteromalid","summary":{"en":"A pteromalid is a small parasitoid wasp in the family Pteromalidae.","zh":"pteromalid 指姬小蜂科（Pteromalidae）的一类微小寄生蜂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny parasitoid wasp belonging to the family Pteromalidae (often used in biology for species that lay eggs in or on other insects).","zh":"小蜂总科中姬小蜂科（Pteromalidae）的一类微小寄生蜂（常指把卵产在其他昆虫体内或体表、幼虫以寄主为食的蜂）。"},"examples":[{"en":"Pteromalids are often used in biological control to reduce pest insect populations.","zh":"姬小蜂科的寄生蜂常用于生物防治，以降低害虫数量。"},{"en":"The researcher identified a pteromalid emerging from a fly pupa.","zh":"研究人员发现有一只姬小蜂科寄生蜂从蝇蛹中羽化出来。"},{"en":"Some pteromalid wasps parasitize beetle larvae hidden inside wood.","zh":"有些姬小蜂科寄生蜂会寄生在藏在木材里的甲虫幼虫上。"}]}],"synonyms":["pteromalid wasp","member of Pteromalidae"],"phonetic":"/ˌtɛrəˈmælɪd/","extraExplanation":["“pteromalid”是分类学/昆虫学用词，指“姬小蜂科（Pteromalidae）的成员”。日常英语里更常说“pteromalid wasp（姬小蜂科寄生蜂）”。","词源与拉丁化学名有关：Pteromalidae 来自属名 Pteromalus，因此 pteromalid 是“Pteromalidae 的（成员）”这种学术构词方式。"]}
{"word":"pteromalidae","summary":{"en":"Pteromalidae: a family of tiny parasitic wasps that develop on or in other insects.","zh":"Pteromalidae：一类小型寄生蜂科，幼虫在其他昆虫体内或体表发育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of very small parasitic wasps (chalcidoid wasps) whose larvae develop inside or on other insects, often helping control pest populations","zh":"一种小型寄生蜂科（小蜂总科/金小蜂类），幼虫在其他昆虫体内或体表发育，常对害虫种群有自然控制作用"},"examples":[{"en":"Pteromalidae are commonly reared in labs to study insect parasitism.","zh":"实验室里常会饲养金小蜂科（Pteromalidae）来研究昆虫寄生现象。"},{"en":"Some pteromalid wasps parasitize fly pupae and can reduce fly numbers.","zh":"有些金小蜂科寄生蜂会寄生在蝇的蛹上，从而降低蝇的数量。"}]}],"synonyms":["pteromalid wasps","pteromalids"],"phonetic":"/ˌtɛrəˈmælɪdi/","extraExplanation":["“Pteromalidae”是生物分类学里的“科”名，中文常译作“金小蜂科”（不同资料可能有细微差异）。在生态与农业中，它们常被提到是因为许多种类会寄生害虫（如苍蝇、甲虫等）的卵、幼虫或蛹，可用于生物防治研究。"]}
{"word":"pteromata","summary":{"en":"Pteromata is a rare scientific plural noun meaning wing-like outgrowths or structures.","zh":"pteromata 是罕见的科学用复数名词，指翼状的突起或结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) wing-like structures or membranous outgrowths on an animal or plant (technical, rare).","zh":"（复数）翼状结构；（动植物上的）膜质或翼状突起（专业用语，较少见）。"},"examples":[{"en":"Some insects have small pteromata near the body that look like tiny wings.","zh":"有些昆虫在靠近身体的位置有小的翼状突起，看起来像迷你翅膀。"},{"en":"The description notes pteromata along the edge of the specimen.","zh":"描述中提到标本边缘有翼状结构。"}]}],"synonyms":["wing-like appendages","alar outgrowths","membranous outgrowths"],"phonetic":"/ˌtɛrəˈmoʊtə/","extraExplanation":["这个词非常少见，多见于分类学/形态学的描述性文字里。一般可把它理解为“像翅膀一样的附属结构/突起”。","词形上是复数（-a 结尾常见于拉丁/希腊来源的科学名词复数），单数常写作 pteroma。","词根 ptero- 来自希腊语，意思与“翅膀/羽翼”相关（也见于 pterodactyl、pterygium 等词）。"]}
{"word":"pteromys","summary":{"en":"Pteromys is the scientific genus name for certain Old World flying squirrels.","zh":"Pteromys 是旧大陆部分鼯鼠（飞鼠）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Old World flying squirrels (family Sciuridae), including species such as the Siberian flying squirrel.","zh":"（动物学）鼯鼠属：旧大陆的一属飞鼠（松鼠科），包括如西伯利亚鼯鼠等物种。"},"examples":[{"en":"The Siberian flying squirrel is classified in the genus Pteromys.","zh":"西伯利亚鼯鼠被归入鼯鼠属（Pteromys）。"},{"en":"In some field guides, Pteromys is described as a group of gliding squirrels found across northern Eurasia.","zh":"在一些野外图鉴中，Pteromys 被描述为分布于欧亚北部、能够滑翔的松鼠类群。"}]}],"synonyms":["flying squirrel (genus)","Old World flying squirrel"],"phonetic":"ˈtɛrəˌmɪs","extraExplanation":["这是一个拉丁化的科学属名，常见于生物分类学与科普读物中；日常英语里更常说 flying squirrel（飞鼠/鼯鼠），而不是直接用 Pteromys。","词源来自希腊语：pteron（翅膀）+ mys（鼠），字面意思接近“有翅膀的鼠”，指它们能借助皮膜在树间滑翔。","注意：Pteromys 指“属”（genus），不是某一种具体动物；具体到某个物种时，会用双名法，如 Pteromys volans（西伯利亚鼯鼠）。"]}
{"word":"pteron","summary":{"en":"Pteron means “wing,” especially in technical or Greek-based biological/anatomical terms.","zh":"pteron 意为“翅/翼”，多用于技术性或希腊词源的生物学、解剖学术语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wing or wing-like part; in biology/anatomy, a structure shaped like a wing (often used in technical or Greek-based terms).","zh":"翅；翼状部分（生物学/解剖学中指形状像翅膀的结构，常见于学术或希腊词源术语中）"},"examples":[{"en":"In some insects, the pteron refers to the wing surface or a wing-like section in descriptions.","zh":"在一些昆虫的描述中，pteron 可指翅面或某个翼状区域。"},{"en":"The term pteron comes from Greek and is used to name wing-shaped anatomical features.","zh":"pteron 源自希腊语，常用来给翼状的解剖结构命名。"}]}],"synonyms":["wing","ala","ptero- (combining form)"],"phonetic":"ˈtɛrɑn","extraExplanation":["“pteron”来自希腊语 πτερόν，基本义是“翅膀/羽翼”。因此它也常作为词根 ptero- 出现在英语学术词汇中，例如：pterodactyl（翼手龙，字面“有翅的手指”）、pterygium（翼状胬肉，眼部的“翼状”增生组织）。日常英语里单独使用 “pteron” 很少，多见于生物学、医学或古典学语境。"]}
{"word":"pteronophobia","summary":{"en":"Pteronophobia means a strong fear of being tickled by feathers (or fear of feathers because of tickling).","zh":"pteronophobia 指对被羽毛挠痒（或因羽毛可能挠痒而对羽毛）的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of being tickled by feathers (or sometimes of feathers because they might be used to tickle).","zh":"对“被羽毛挠痒（挠痒痒）”的强烈恐惧；有时也指因羽毛可能用来挠痒而害怕羽毛。"},"examples":[{"en":"He avoids feather pillows because of his pteronophobia.","zh":"因为有 pteronophobia（怕羽毛挠痒/怕被羽毛挠痒），他会避开羽毛枕头。"},{"en":"She laughed nervously when her friends joked about tickling her with feathers—her pteronophobia is real.","zh":"朋友开玩笑说要用羽毛挠她痒时，她紧张地笑了笑——她的 pteronophobia 真的很严重。"}]}],"synonyms":["fear of feathers","fear of being tickled","phobia of tickling (informal)"],"phonetic":"/ˌtɛrəˌnoʊˈfoʊbiə/","extraExplanation":["词源：来自希腊语 pteron（“翅膀/羽毛”）+ phobia（“恐惧”）。","这是一个相对少见、偏科普/网络用语的词；在正式医学语境里，更常用更宽泛的表达，如 “a fear of feathers” 或 “a fear of being tickled”。","如果这种恐惧明显影响日常生活（例如回避很多场合、出现强烈焦虑），可以用更一般的说法描述感受，并考虑寻求专业帮助。"]}
{"word":"pteropaedes","summary":{"en":"Pteropaedes is a rare scientific-looking name, likely a genus name; its exact meaning depends on the biological context.","zh":"Pteropaedes 是一个少见、看起来像生物分类属名的科学名称；具体含义取决于生物学语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare scientific (Latin) name that appears to be used as a taxonomic genus name in some sources; it is not a common English vocabulary word. Meaning depends on the specific organism and the source where it appears.","zh":"一个较少见的拉丁化科学名称，在一些资料中似乎被用作生物分类学中的“属名”；它不是常见英语词汇，具体指哪种生物取决于出处与语境。"},"examples":[{"en":"The paper lists Pteropaedes among several genera, but the spelling should be checked against a current taxonomy database.","zh":"这篇论文把 Pteropaedes 列为若干属名之一，但拼写最好对照最新的分类数据库核对。"},{"en":"In older references, Pteropaedes may appear as an outdated or disputed name.","zh":"在较早的参考资料中，Pteropaedes 可能作为过时或存疑的名称出现。"}]}],"phonetic":"/ˌtɛroʊˈpiːdiːz/","extraExplanation":["这种形式（拉丁化、首字母大写）很像生物学“属名”（genus）。属名在英文文章里通常用斜体书写（如 *Pteropaedes*），并且常与种加词一起出现（例如 *Genus species*）。","如果你是在某篇论文、标本记录或数据库里看到这个词，建议你把出现的上下文（例如后面的 species 名、所属科/目、或作者与年份）发我，我可以帮你更准确地确认它指的是什么，以及是否有更常用/更新的同义名。","拼写也可能是误读或误拼。许多分类名只差一两个字母就会变成完全不同的分类单元。"]}
{"word":"pteropaedic","summary":{"en":"“Pteropaedic” is not a standard English word; you probably mean “orthopedic/orthopaedic” (related to bone and joint medicine).","zh":"“pteropaedic”不是标准英语词；你可能想写“orthopedic/orthopaedic”（骨科的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely a misspelling) relating to orthopedics: the medical care of bones, joints, muscles, and the spine.","zh":"（很可能是拼写错误）与骨科相关：指对骨骼、关节、肌肉以及脊柱等问题的医疗诊治。"},"examples":[{"en":"I think you meant orthopedic (US) / orthopaedic (UK), not pteropaedic.","zh":"我猜你想写的是 orthopedic（美式）/ orthopaedic（英式），而不是 pteropaedic。"},{"en":"She made an appointment at an orthopedic clinic for her knee pain.","zh":"她因为膝盖疼去骨科诊所预约就诊。"}]}],"synonyms":["orthopedic","orthopaedic","orthopaedical"],"phonetic":"/ˌɔrθəˈpidɪk/","extraExplanation":["“pteropaedic”不是常见或标准英语单词，日常与医学语境中几乎不会使用。最接近、也最常见的词是：\n- orthopedic（美式拼写）\n- orthopaedic（英式拼写）\n两者意思相同，都是“骨科的”。\n\n词源小提示：orth(o)- 表示“直的/矫正”，-paedic/-pedic 与“儿童/教育/矫正”有关（与 paediatrics/pediatrics 同源）。现代用法中它泛指骨骼肌肉系统的矫形与治疗，不仅限于儿童。"]}
{"word":"pteropegal","summary":{"en":"“pteropegal” isn’t a recognized English word; it’s probably a typo or a proper name. Share context to identify the intended term.","zh":"“pteropegal”不是常见英语词，可能是拼写错误或专有名词。请提供上下文以确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a very rare/proper name term. Please confirm the spelling or give a sentence for context.","zh":"不是标准英语单词；很可能是拼写错误，或是非常罕见/专有名词。请确认拼写，或提供所在句子以便判断。"},"examples":[{"en":"I can’t find “pteropegal” in major dictionaries—could you share the sentence where you saw it?","zh":"我在主要词典里查不到“pteropegal”，你能提供看到它的句子吗？"},{"en":"Did you mean “pterodactyl” (a flying reptile) or “pteropod” (a type of sea snail)?","zh":"你是不是想写“pterodactyl”（翼龙）或“pteropod”（翼足类海螺/海蜗牛的一类）？"}]}],"phonetic":"/ˌtɛrəˈpiːɡəl/","extraExplanation":["“ptero-”常见于与“翅膀/飞行”相关的词，来源于希腊语 pterón（翅膀）。例如：pterodactyl（翼龙）、pteropod（翼足类）、pterosaur（翼龙类）。","如果这是人名、地名、品牌名或生物学拉丁学名的一部分，词典里可能查不到；提供来源（书名/网页链接/截图）会更容易确认含义与读音。"]}
{"word":"pteropegous","summary":{"en":"“pteropegous” is not a standard English word; it’s likely a misspelling of a scientific term with the wing-related prefix ptero-.","zh":"“pteropegous”不是标准英语词；很可能是某个含“翼/翅”词头 ptero- 的科学术语的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a very rare/obsolete technical term built from the prefix ptero- (“wing”).","zh":"不是常见词典里的标准英语词；很可能是拼写错误，或是极少见/已废弃的技术词，含有词头 ptero-（“翅、翼”）。"},"examples":[{"en":"I can’t find “pteropegous” in standard dictionaries—did you mean “pteropodous” or another ptero- word?","zh":"我在常见词典里找不到“pteropegous”，你是不是想写“pteropodous”或其他以 ptero- 开头的词？"},{"en":"Many scientific words beginning with ptero- relate to wings, feathers, or wing-like structures.","zh":"很多以 ptero- 开头的科学词汇都和翅膀、羽毛或“翼状结构”有关。"}]}],"phonetic":"/ˌtɛrəˈpiːɡəs/","extraExplanation":["“ptero-”来自希腊语 pteron（翅膀）。如果你是在生物/解剖/古生物语境中看到这个词，它可能是排版或OCR识别错误。","你可以把原句（含前后各一两句话）贴出来，或提供来源（书名/论文/截图），我可以帮你推断它原本应是哪一个词，并给出准确释义与发音。","可能的目标词示例：pteropod（翼足类动物/翼足目相关）、pteropodous（有“翼状足”的）、pteryg- 相关词（也表示“翅/翼”，如 pterygium 等）。"]}
{"word":"pteropegum","summary":{"en":"“Pteropegum” doesn’t appear to be a standard English word; it’s likely a misspelling or a specialized proper/scientific term.","zh":"“pteropegum”看起来不是标准英语词，更可能是拼写错误或专业/科学领域的专有术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; likely a misspelling, a rare proper name, or a scientific/Latin-based term used in a specific field.","zh":"不是主流英语词典中的标准词；很可能是拼写错误、罕见专有名词，或某个专业领域使用的科学/拉丁词。"},"examples":[{"en":"I couldn’t find “pteropegum” in a dictionary—do you have the sentence or the topic it came from?","zh":"我在词典里找不到“pteropegum”——你能提供它出现的句子或主题吗？"},{"en":"It may be a scientific name (like a genus) or a typo for a similar-looking word.","zh":"它可能是科学名称（例如某个属名），或是一个外形相近单词的拼写错误。"}]}],"phonetic":"/ˌtɛrəˈpiːɡəm/","extraExplanation":["从词形看，ptero- 常见于源自希腊语的构词，意为“翼/翅”（如 pterodactyl 翼手龙）。但 “pteropegum” 这一整体拼写在常见英语词典与常见术语中不太成立。","你可以检查是否想写的是这些更常见的词：pterygium（翼状胬肉，眼科术语）、pteropod（翼足类，动物学）、pterogram（昆虫翅脉图/翅图，较专业）、pterodactyl（翼手龙，常见词）。","如果你把它所在的原句、学科（生物/医学/地质/游戏设定等）或截图发来，我可以更准确地判断它的正确拼写、含义与发音。"]}
{"word":"pterophorid","summary":{"en":"A pterophorid is a plume moth (family Pterophoridae).","zh":"pterophorid 指羽蛾科的蛾（plume moth）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the plume moth family (Pterophoridae), a small moth with wings divided into narrow, feathery “plumes.”","zh":"羽蛾科（Pterophoridae）的昆虫；一种小型蛾类，翅膀常分裂成细长、羽毛状的“羽片”。"},"examples":[{"en":"At night, a pterophorid rested on the porch light, its wings held in a T-shape.","zh":"夜里，一只羽蛾科的蛾停在门廊灯旁，翅膀呈T字形展开。"},{"en":"The field guide notes that many pterophorids are easiest to spot when they perch with narrow wings stretched sideways.","zh":"野外图鉴提到，许多羽蛾科的蛾在停栖时会把细长的翅膀水平展开，因此更容易辨认。"}]}],"synonyms":["plume moth"],"phonetic":"/ˌtɛrəˈfɔːrɪd/","extraExplanation":["“pterophorid”来自科学分类学用语：ptero-（翅）+ -phor（携带/承载）+ -id（表示“属于……的成员”）。它通常用于昆虫学、博物学或学术语境。","常见特征：羽蛾科的前后翅常分裂成数条细“羽片”，静止时常呈“T”字姿态；幼虫多取食特定植物，因此在生态与生物多样性研究中也会出现该词。"]}
{"word":"pterophoridae","summary":{"en":"Pterophoridae is the scientific family name for plume moths, moths with feather-like divided wings.","zh":"Pterophoridae 是“羽蛾科”的学名，指一类翅膀分裂成羽毛状的蛾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths commonly called plume moths, known for their wings that are split into narrow, feather-like plumes.","zh":"蛾类的一个科，常称“羽蛾科/羽蛾”，其翅膀常分裂成细长的羽毛状“羽片”。"},"examples":[{"en":"Many species in the family Pterophoridae rest with their wings held out like a T shape.","zh":"羽蛾科（Pterophoridae）的许多物种静止时会把翅展开成“T”字形。"},{"en":"The researcher identified the insect as a member of Pterophoridae based on its plume-like wings.","zh":"研究者根据它羽毛状的翅膀判断这只昆虫属于羽蛾科（Pterophoridae）。"}]}],"synonyms":["plume moth family","plume moths"],"phonetic":"ˌtɛrəˈfɔːrɪdiː","extraExplanation":["“Pterophoridae”是生物分类学（昆虫学/鳞翅目）中的拉丁化科名：ptero- 来自希腊语 pteron（翅膀），-phor- 表示“携带/承载”，整体含义可理解为“带翅的/羽状翅的”。","在英文科普或论文里，它常以斜体出现（Pterophoridae），表示正式的科名；口语或一般科普更常说 plume moth(s)（羽蛾）。"]}
{"word":"pterophorus","summary":{"en":"Pterophorus is a scientific genus name for plume moths with feather-like, divided wings.","zh":"Pterophorus 是羽蛾属的学名，指翅膀呈羽毛状、分裂状的羽蛾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plume moths (family Pterophoridae), known for wings that look split into feathery “plumes.”","zh":"羽蛾属（Pterophorus），羽蛾科的一类蛾；其翅膀常呈分裂的羽毛状“羽片”。"},"examples":[{"en":"Scientists recorded several Pterophorus species in the wetland at night.","zh":"科学家在夜间的湿地里记录到数种羽蛾属（Pterophorus）的物种。"},{"en":"A Pterophorus moth rests with its wings held out like a tiny T-shape.","zh":"一只羽蛾属（Pterophorus）的蛾停着时，会把翅膀展开，像一个小小的“T”字。"}]}],"synonyms":["plume moth (genus Pterophorus)","pterophorid moth"],"phonetic":"/ˌtɛrəˈfɔrəs/","extraExplanation":["词源：来自希腊语 pteron（翅膀）+ -phoros（携带、承载），意思接近“带翅的/携翅者”。","用法提示：Pterophorus 是学名（属名），写作时通常首字母大写并用斜体（如 *Pterophorus*）。日常英语里更常说 plume moth（羽蛾）。"]}
{"word":"pterophryne","summary":{"en":"Pterophryne is a scientific genus name for certain frogfish (marine anglerfish).","zh":"Pterophryne 是躄鱼（海洋躄鱼/鮟鱇类）中某些物种的属级学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of frogfish (marine anglerfish) in the family Antennariidae; a scientific (Latin) name used in biology.","zh":"（生物学拉丁学名）躄鱼属：躄鱼科的一属海洋躄鱼（也属于鮟鱇类的一支），常用于科学分类与研究。"},"examples":[{"en":"The specimen was identified as Pterophryne based on its fin structure and camouflage pattern.","zh":"研究人员根据鳍的结构和伪装花纹将该标本鉴定为躄鱼属（Pterophryne）。"},{"en":"Pterophryne species are benthic predators that rely on ambush hunting.","zh":"躄鱼属（Pterophryne）的物种多为底栖捕食者，常用伏击方式捕猎。"}]}],"synonyms":["frogfish (common name)","anglerfish (broader common name)"],"phonetic":"/ˌtɛrəˈfɹaɪni/","extraExplanation":["这是一个“属名”（genus name），通常出现在学术论文、博物馆标本标签或物种名的前半部分（如“Pterophryne + 种加词”）。日常英语里更常用的通俗说法是 frogfish（躄鱼）或 anglerfish（鮟鱇鱼/垂钓鱼，较宽泛）。","词源常被解释为来自希腊语成分：ptero-（“翅/翼、鳍”之意）+ phryne（“蟾蜍/癞蛤蟆”之意），暗示其外形粗糙、伪装强、像“海里的蟾蜍”。"]}
{"word":"pteropid","summary":{"en":"A pteropid is a fruit bat from the family Pteropodidae (often called a flying fox).","zh":"pteropid 指狐蝠科的果蝠（常被称为飞狐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fruit bat (family Pteropodidae), usually a large bat that eats fruit, nectar, or pollen; many are called “flying foxes.”","zh":"狐蝠科的果蝠（Pteropodidae）；多为体型较大的蝙蝠，以水果、花蜜或花粉为食，许多种也被称为“飞狐”。"},"examples":[{"en":"Pteropids are important pollinators in many tropical forests.","zh":"果蝠（狐蝠科）在许多热带森林中是重要的传粉者。"},{"en":"Some islands rely on pteropids to spread the seeds of native trees.","zh":"一些岛屿依赖狐蝠科果蝠来传播本地树木的种子。"}]}],"synonyms":["fruit bat","flying fox"],"phonetic":"/ˈtɛrəpɪd/","extraExplanation":["“pteropid”来自分类学用语，指“狐蝠科（Pteropodidae）”的成员。词根与希腊语有关：ptero- 表“翅膀”，-pod 表“足”。","日常英语里更常说 fruit bat（果蝠）或 flying fox（飞狐；通常指体型较大的果蝠）。"]}
{"word":"pteropidae","summary":{"en":"Pteropidae is the scientific family name for fruit bats (flying foxes).","zh":"Pteropidae 是果蝠/狐蝠（狐蝠科）的科学科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of bats commonly called “fruit bats” or “flying foxes,” found mainly in Africa, Asia, Australia, and nearby islands; many eat fruit, nectar, or pollen.","zh":"（蝙蝠的）狐蝠科：常被称为“果蝠/狐蝠（flying fox）”的一科，主要分布在非洲、亚洲、澳大利亚及周边岛屿；多以水果、花蜜或花粉为食。"},"examples":[{"en":"Many Pteropidae play an important role in pollinating tropical trees.","zh":"许多狐蝠科动物在为热带树木传粉方面起着重要作用。"},{"en":"Some islands depend on Pteropidae to spread seeds and help forests regrow.","zh":"一些岛屿依赖狐蝠科动物传播种子，帮助森林再生。"}]}],"synonyms":["fruit bats","flying foxes"],"phonetic":"/ˌtɛrəˈpaɪdi/","extraExplanation":["“Pteropidae”是拉丁化的科学分类名称，来自希腊语词根：ptero-（翅膀）+ -idae（动物“科”的后缀，表示“……科”）。在日常英语里，人们更常说fruit bat（果蝠）或flying fox（狐蝠），而不是直接用Pteropidae。","与很多以回声定位（echolocation）著称的蝙蝠不同，狐蝠科成员多依赖视觉和嗅觉觅食（不过也有少数例外）。在生态系统中，它们常被视为关键的传粉者和种子传播者。"]}
{"word":"pteropine","summary":{"en":"Pteropine refers to (or is) a flying fox/fruit bat in the Pteropinae group.","zh":"pteropine 指（或属于）狐蝠亚科（Pteropinae）的狐蝠/果蝠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to the flying foxes and closely related fruit bats (the group Pteropinae).","zh":"（形容词）与狐蝠及其近缘的果蝠有关的；狐蝠亚科（Pteropinae）的。"},"examples":[{"en":"Researchers compared pteropine bats with insect-eating bats to study different diets.","zh":"研究人员将狐蝠亚科的蝙蝠与食虫蝙蝠进行比较，以研究不同的饮食。"},{"en":"Pteropine species are important pollinators in many tropical forests.","zh":"狐蝠亚科的物种在许多热带森林中是重要的传粉者。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A flying fox or other fruit bat belonging to the group Pteropinae.","zh":"（名词）狐蝠亚科的蝙蝠（如狐蝠等果蝠）。"},"examples":[{"en":"The zoo’s newest pteropine is a large flying fox from Southeast Asia.","zh":"动物园最新引进的一只狐蝠亚科蝙蝠，是来自东南亚的大型狐蝠。"}]}],"synonyms":["flying fox","fruit bat","pteropodid (technical)"],"phonetic":"ˈtɛrəˌpaɪn","extraExplanation":["“pteropine”常见于动物学/分类学文章中，日常英语里不常用。更常见的说法是“flying fox（狐蝠）”或“fruit bat（果蝠）”。","词源上与希腊语词根“pter- / ptero-”（意为“翅膀”）有关；在英语里常见于如“pterodactyl（翼手龙）”“pterosaur（翼龙）”等词。"]}
{"word":"pteropod","summary":{"en":"A pteropod is a tiny ocean “sea snail” that swims with wing-like fins, often called a sea butterfly.","zh":"pteropod 指一种用翼状鳍游泳的小型海洋软体动物（翼足类），常被称为“海蝴蝶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small ocean animal (a type of sea snail) that swims by flapping wing-like “fins”; often called a “sea butterfly.”","zh":"翼足类动物；一种小型海洋浮游软体动物（海蜗牛的一类），用像翅膀的“鳍”拍动来游泳；常被称为“海蝴蝶”。"},"examples":[{"en":"Scientists study pteropods to understand changes in ocean chemistry.","zh":"科学家研究翼足类动物，以了解海洋化学的变化。"},{"en":"Some pteropods have thin shells that can be damaged when seawater becomes more acidic.","zh":"一些翼足类有很薄的壳，当海水酸性增强时可能会受损。"}]}],"synonyms":["sea butterfly","wing-footed snail"],"phonetic":"/ˈtɛrəˌpɑd/","extraExplanation":["词源：来自希腊语 ptero-（“翅膀”）+ pod-（“脚”），字面意思是“有翅膀的脚”，指它们用于游泳的翼状“足”。","常见语境：海洋生物学、浮游生物研究与气候变化报道中较常出现，尤其与“海洋酸化（ocean acidification）”相关。","相关词：sea butterfly（海蝴蝶，常指无壳或壳很薄的翼足类）；sea angel（海天使，一类捕食性的翼足类）。"]}
{"word":"pteropoda","summary":{"en":"Pteropoda are small pelagic sea snails that swim with wing-like flaps, often called sea butterflies.","zh":"Pteropoda（翼足目）指会用翼足游泳的海洋浮游蜗牛，常称“海蝴蝶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of small ocean-dwelling snails that swim using wing-like flaps; often called “sea butterflies” (and some related forms “sea angels”).","zh":"（翼足目）一类生活在海洋中的小型浮游蜗牛，用像翅膀一样的“翼足”游泳；常被称为“海蝴蝶”（相关的无壳类有时称“海天使”）。"},"examples":[{"en":"Pteropoda are tiny snails that “fly” through the water with wing-like fins.","zh":"翼足目是很小的蜗牛，会用像翅膀的鳍在水中“飞行”。"},{"en":"Scientists study Pteropoda because their shells can be affected by ocean acidification.","zh":"科学家研究翼足目，因为它们的壳会受到海洋酸化的影响。"}]}],"synonyms":["pteropods","sea butterflies","pelagic snails"],"phonetic":"/ˌtɛrəˈpɑdə/","extraExplanation":["“Pteropoda”是拉丁化的科学名称，常见于生物学/海洋学文章中；日常英语里更常说 pteropods（翼足类）或 sea butterflies（海蝴蝶）。","词源来自希腊语：ptero-（翅膀）+ -poda（脚），指它们用“像翅膀的脚”（翼足）来游泳。","很多翼足类有薄壳或无壳，因而在环境变化研究中常被用作“指示物种”（例如监测海洋酸化对钙质壳的影响）。"]}
{"word":"pteropodal","summary":{"en":"“Pteropodal” means “related to pteropods (sea butterflies) or their wing-like swimming feet.”","zh":"“pteropodal”意为“与翼足类（海蝶）或其翼状游泳足相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of pteropods (small marine snails often called “sea butterflies”), especially their wing-like swimming structures.","zh":"与翼足类（常被称为“海蝶”的小型海洋蜗牛）有关的；尤指它们用于游泳的“翼状”结构。"},"examples":[{"en":"Scientists studied the pteropodal “wings” that help sea butterflies swim.","zh":"科学家研究了海蝶用于游泳的翼足类“翼状”结构。"},{"en":"Pteropodal fossils can help researchers infer past ocean conditions.","zh":"翼足类相关的化石能帮助研究者推断过去的海洋环境。"}]}],"synonyms":["pteropod (as modifier)","pteropod-related","pelagic (broader, not exact)"],"phonetic":"/ˌtɛrəˈpɑːdəl/","extraExplanation":["“Pteropodal”主要出现在生物学、海洋学与古生物学写作中，属于专业词汇，日常英语里很少使用。","词根来源：ptero- 表示“翼/翅”（如 pterodactyl 翼龙），-pod 表示“足”（如 cephalopod 头足类），整体含义接近“翼足的/像有翅的脚”。","翼足类（pteropods）对海洋酸化研究很重要，因为它们的壳体容易受酸性海水影响，因此相关研究中会出现 pteropodal 这样的形容词。"]}
{"word":"pteropodan","summary":{"en":"Pteropodan means a pteropod (a small ocean snail with wing-like fins) or something relating to pteropods.","zh":"pteropodan 指翼足类动物（有翅状鳍的小型海洋蜗牛）或“与翼足类有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pteropod; a small ocean-dwelling mollusk (sea snail) that “flies” through the water using wing-like fins","zh":"翼足类动物；一种生活在海洋中的小型软体动物（海蜗牛），用像翅膀一样的鳍在水中“飞行”"},"examples":[{"en":"Scientists study pteropodan shells to understand how ocean acidification affects marine life.","zh":"科学家研究翼足类的壳，以了解海洋酸化如何影响海洋生物。"},{"en":"A pteropodan can look like a tiny sea butterfly drifting in the open ocean.","zh":"翼足类看起来像一只在远洋漂浮的小“海蝴蝶”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to pteropods (pteropodan animals), especially in scientific writing","zh":"（多用于科研语境）与翼足类（翼足动物）有关的"},"examples":[{"en":"The report lists pteropodan species found near Antarctica.","zh":"报告列出了在南极附近发现的翼足类物种。"},{"en":"Pteropodan fossils can be used as clues for past ocean conditions.","zh":"翼足类化石可作为推测古海洋环境的线索。"}]}],"synonyms":["pteropod","sea butterfly (informal)"],"phonetic":"/ˌtɛrəˈpɑdən/","extraExplanation":["“pteropodan”来自希腊语词根：ptero-（翅膀）+ pod-（脚），后缀 -an 表示“……的/与……有关的”或“……类的”。在现代英语中它主要出现在动物学、海洋生物学等专业文本里；日常更常见的词是 pteropod，也有人把它们称为 sea butterflies（海蝴蝶）。"]}
{"word":"pteropodial","summary":{"en":"“Pteropodial” means “related to pteropods,” small ocean snails that swim using wing-like lobes.","zh":"“pteropodial”意为“与翼足类有关的”，指一类靠翼状结构游泳的小型海洋蜗牛类生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, or characteristic of a pteropod (a small marine snail with wing-like lobes used for swimming).","zh":"与“翼足类”（pteropod，一类有翼状“足”用于游泳的小型海洋蜗牛/海螺）有关的；翼足类的。"},"examples":[{"en":"Scientists studied pteropodial shells to understand how ocean acidification affects marine life.","zh":"科学家研究翼足类的壳，以了解海洋酸化如何影响海洋生物。"},{"en":"The report describes pteropodial species that drift in cold polar waters.","zh":"报告描述了在寒冷极地海域漂流生活的翼足类物种。"}]}],"synonyms":["pteropod","pteropodous"],"phonetic":"/ˌtɛrəˈpoʊdiəl/","extraExplanation":["“pteropodial”来自“pteropod（翼足类）”，词根 ptero- 表示“翼/翅”，-pod 表示“足”。翼足类常被称为“海蝴蝶”（sea butterflies），在海洋生态系统中很重要，也常用于研究气候变化与海洋酸化。"]}
{"word":"pteropodidae","summary":{"en":"Pteropodidae is the scientific family name for fruit bats (flying foxes).","zh":"Pteropodidae 是果蝠（狐蝠）的科学分类名称（狐蝠科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of bats commonly called fruit bats or flying foxes, found mainly in tropical and subtropical regions and known for eating fruit and nectar","zh":"一种蝙蝠科（狐蝠科），常称“果蝠/狐蝠”，多分布于热带和亚热带地区，以水果和花蜜为食"},"examples":[{"en":"Many Pteropodidae species help forests by spreading seeds after eating fruit.","zh":"许多狐蝠科（Pteropodidae）物种吃完水果后会传播种子，从而帮助森林生长。"},{"en":"Researchers studied Pteropodidae to understand how nectar-feeding bats pollinate flowers.","zh":"研究人员研究狐蝠科（Pteropodidae），以了解吸食花蜜的蝙蝠如何为花朵授粉。"}]}],"synonyms":["fruit bat family","flying fox family"],"phonetic":"/ˌtɛrəˈpɑːdəˌdiː/","extraExplanation":["“Pteropodidae”是生物分类学中的拉丁化学名，指“狐蝠科”。在日常英语中更常用的说法是“fruit bat（果蝠）”或“flying fox（狐蝠）”。","词源可拆分理解：ptero- 来自希腊语，意为“翅膀”；-pod- 意为“脚”；-idae 表示“某某科”（动物分类学中常见的后缀）。","文化与语境：一些大型狐蝠（flying foxes）在太平洋岛国与东南亚很常见，既被视为重要的授粉与散播种子动物，也可能因果园损失而与人类产生冲突。"]}
{"word":"pteropodium","summary":{"en":"Pteropodium is a scientific genus name used in taxonomy, not a common English word.","zh":"Pteropodium 是分类学中的属名（拉丁学名），并非日常英语词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pteropodium: a scientific Latin name used in biological taxonomy (a genus name). It refers to a group of organisms in scientific classification, but it is not a common everyday English word.","zh":"Pteropodium：生物分类学中的拉丁学名（属名）。它用于科学分类中指代一类生物，但不是日常英语常用词。"},"examples":[{"en":"The specimen was labeled Pteropodium sp. in the herbarium records.","zh":"这份标本在植物标本馆记录中被标注为 Pteropodium sp.（Pteropodium 属的某一种）。"},{"en":"In older sources, Pteropodium may appear as a name in taxonomic lists.","zh":"在较早的资料中，Pteropodium 可能会作为分类名出现在物种名录里。"}]}],"synonyms":["genus name","taxonomic name"],"phonetic":"/ˌtɛrəˈpoʊdiəm/","extraExplanation":["这是典型的“拉丁化学名”。在英文写作中，属名通常首字母大写并用斜体：*Pteropodium*；若不确定具体物种，可写 *Pteropodium* sp.（sp. 表示“某一种”）。","该词非常专业，且不同数据库中可能存在同名、异名（synonym）或分类地位更新。若你能提供出现它的句子/领域（植物、昆虫、化石等），我可以帮你更准确地对应到具体类群与含义。"]}
{"word":"pteropodous","summary":{"en":"A zoological adjective meaning “wing-footed,” especially describing animals (like pteropods) that swim using wing-like appendages.","zh":"一个动物学形容词，意为“翼足的/翼状足的”，常指（如翼足类）用翼状附肢游泳的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having wing-like feet or fin-like appendages; related to animals that swim using such “wing” structures.","zh":"（动物学）具“翼状足”或鳍状附肢的；指用类似翅膀的结构游泳的动物。"},"examples":[{"en":"Some small sea snails are described as pteropodous because they swim with wing-like lobes.","zh":"一些小型海螺会被形容为 pteropodous，因为它们用翼状叶片游泳。"},{"en":"The paper compared pteropodous mollusks in different ocean temperatures.","zh":"这篇论文比较了不同海温下的翼足类软体动物。"}]}],"synonyms":["wing-footed","pteropod-like"],"phonetic":"/ˌtɛrəˈpɑdəs/","extraExplanation":["词源上可拆解为希腊语：ptero-（翅膀）+ -pod（脚）+ -ous（……的）。因此字面意思是“有翅膀的脚”。","这是一个偏学术/生物学用词，常与“pteropods（翼足类）”相关：它们并不是真的有翅膀，而是用脚演化出的“翼状”结构在水中划动。"]}
{"word":"pteropods","summary":{"en":"Pteropods are tiny marine snails that swim with wing-like fins (often called sea butterflies).","zh":"Pteropods 指会用“翅膀状鳍足”游泳的小型海洋蜗牛，常被叫作海蝴蝶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small ocean-dwelling snails that swim by flapping wing-like fins; they are also called “sea butterflies” (or “sea angels” for some groups) and are an important part of marine food webs.","zh":"一种生活在海洋中的小型蜗牛（海螺类软体动物），靠拍动像翅膀一样的“鳍足”游泳；常被称为“海蝴蝶”（某些类群也叫“海天使”），是海洋食物网的重要组成部分。"},"examples":[{"en":"Pteropods drift through the water and flap their fins like tiny wings.","zh":"翼足类在水中漂浮，并像小翅膀一样拍动鳍足。"},{"en":"Scientists study pteropods because their shells can be affected by ocean acidification.","zh":"科学家研究翼足类，因为海洋酸化会影响它们的壳。"}]}],"synonyms":["sea butterflies","sea angels"],"phonetic":"/ˈtɛrəˌpɑdz/","extraExplanation":["“pteropod”来自希腊语词根：ptero-（翅膀）+ -pod（脚），字面意思是“翅足”。它们属于软体动物中的腹足纲（和蜗牛、海螺同一大类）。","很多“海蝴蝶”有薄而透明的壳；一些“海天使”则没有壳。它们在极地与深海生态系统中常见，也是鱼类、鲸类等的重要食物来源。","在科普与环保讨论中，pteropods经常被当作“指示物种”，用来观察海洋酸化、海水化学变化对海洋生物的影响。"]}
{"word":"pteropsida","summary":{"en":"Pteropsida is an older scientific term for the class of ferns and fern-like plants.","zh":"Pteropsida 是一个较旧的科学术语，用来指蕨类及类似蕨类植物的“纲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now often outdated) scientific class name for ferns and fern-like plants in botanical classification.","zh":"（较旧的植物分类法用语）蕨类及类似蕨类植物的一个“纲”名。"},"examples":[{"en":"In older textbooks, many ferns were placed in the class Pteropsida.","zh":"在较旧的教材里，许多蕨类植物被归入 Pteropsida 这一纲。"},{"en":"Some sources use Pteropsida to refer broadly to fern groups rather than a modern formal rank.","zh":"有些资料把 Pteropsida 用来泛指蕨类群体，而不一定是现代正式的分类等级。"}]}],"synonyms":["ferns","Filicopsida","Polypodiopsida"],"phonetic":"/ˌtɛrəpˈsaɪdə/","extraExplanation":["这是拉丁化的分类名称：ptero-（与“翅、翼”相关，常见于 pterodactyl 等词）+ -opsida（分类学后缀，常用于“纲/类群”名）。","现代植物系统分类常改用不同的阶元与名称（例如更常说“ferns / 蕨类植物”，或在不同体系中使用 Polypodiopsida 等），所以你在新文献中看到 Pteropsida 的频率相对较低，更多出现在老式分类或概述性材料中。"]}
{"word":"pteropus","summary":{"en":"Pteropus is the scientific genus name for large fruit bats known as flying foxes.","zh":"Pteropus 指大型果蝠（飞狐/狐蝠）的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large fruit bats, commonly called flying foxes, found mainly in tropical and subtropical regions of Asia, Australia, and the Pacific islands","zh":"狐蝠属：一种大型果蝠的属，俗称“飞狐”，主要分布在亚洲、澳大利亚及太平洋岛屿的热带与亚热带地区"},"examples":[{"en":"Pteropus bats play an important role in forests by spreading seeds.","zh":"狐蝠属的蝙蝠通过传播种子在森林生态中扮演重要角色。"},{"en":"Some islands protect Pteropus species because their populations have declined.","zh":"一些岛屿保护狐蝠属物种，因为它们的数量已经下降。"}]}],"synonyms":["flying fox (common name)","fruit bat (general term)"],"phonetic":"/ˈtɛrəˌpəs/","extraExplanation":["“Pteropus”是科学拉丁名（属名），常见英文俗名是“flying fox”（飞狐/狐蝠），因为它们头部像狐狸、体型较大。","词源来自希腊语：pteron（翅膀）+ pous/pod-（脚），字面意思接近“有翅的脚”。","有些狐蝠属物种会在果园取食而被误解为“害兽”，但它们也是重要的传粉者与种子传播者；在讨论相关议题时常会涉及生态保护与人类农业冲突。"]}
{"word":"pterosaur","summary":{"en":"A pterosaur is an extinct flying reptile from the time of the dinosaurs, distinct from dinosaurs and birds.","zh":"翼龙是一种已灭绝的会飞爬行动物，生活在恐龙时代，但不同于恐龙和鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flying reptile that lived during the age of dinosaurs (the Mesozoic Era). It had wings made of skin stretched over a very long finger, and it is not the same as a dinosaur or a bird.","zh":"翼龙：生活在恐龙时代（中生代）的会飞爬行动物。它的翅膀由皮膜支撑，主要拉伸在一根特别长的手指上；它不是恐龙，也不是鸟类。"},"examples":[{"en":"Pterosaurs were the first vertebrates to evolve powered flight.","zh":"翼龙是最早演化出主动飞行能力的脊椎动物。"},{"en":"In the museum, we saw a pterosaur skeleton with huge wings.","zh":"在博物馆里，我们看到一具翅膀巨大的翼龙骨架。"},{"en":"A pterosaur could glide over the ocean looking for fish.","zh":"翼龙可以在海面上滑翔寻找鱼类。"}]}],"synonyms":["pterodactyl (common, informal)"],"phonetic":"/ˈtɛrəˌsɔr/","extraExplanation":["“pterosaur”来自希腊语：pteron（翅膀）+ sauros（蜥蜴/爬行动物），字面意思是“有翅的爬行动物”。","常见误区：翼龙不是恐龙；“恐龙”指的是Dinosauria这一类群，而翼龙属于另一支会飞的爬行动物（Pterosauria）。","在大众文化中最常被提到的例子之一是“翼手龙”（pterodactyl），但严格说“pterodactyl”常被用作泛称；科学上更准确的一个属名是 Pterodactylus。"]}
{"word":"pterosauri","summary":{"en":"A pterosaur is an ancient flying reptile from the time of dinosaurs.","zh":"pterosaur 指恐龙时代的古代飞行爬行动物“翼龙”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flying reptile that lived during the age of dinosaurs (not a dinosaur, but a close relative of reptiles).","zh":"翼龙：生活在恐龙时代的飞行爬行动物（不是恐龙本身，但与爬行动物近缘）。"},"examples":[{"en":"Pterosaurs were the first vertebrates to evolve powered flight.","zh":"翼龙是最早演化出主动飞行能力的脊椎动物。"},{"en":"The museum has a life-size model of a pterosaur hanging from the ceiling.","zh":"博物馆天花板上悬挂着一只等比例的翼龙模型。"}]}],"synonyms":["flying reptile","pterodactyl (informal/common name)"],"phonetic":"ˈtɛrəˌsɔr","extraExplanation":["你输入的 **pterosauri** 多半是把英文复数写成了类似拉丁语的形式。英语里更常用：单数 **pterosaur**，复数 **pterosaurs**。","词源小提示：**ptero-** 来自希腊语，表示“翅膀”；**-saur** 来自表示“蜥蜴/爬行动物”的词根（也常见于 *dinosaur* 这类词）。"]}
{"word":"pterosauria","summary":{"en":"Pterosauria is the scientific name for the extinct group of flying reptiles commonly called pterosaurs.","zh":"Pterosauria 是“翼龙”这一已灭绝会飞爬行动物类群的学名/分类名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order/clade) of extinct flying reptiles that lived during the age of dinosaurs; they were not dinosaurs but close relatives of reptiles.","zh":"翼龙目（或翼龙类）：一种已灭绝的会飞爬行动物类群，生活在恐龙时代；它们不是恐龙，但与爬行动物近缘。"},"examples":[{"en":"Pterosauria includes famous animals like Pteranodon and Quetzalcoatlus.","zh":"翼龙目包括一些著名成员，如无齿翼龙（Pteranodon）和风神翼龙（Quetzalcoatlus）。"},{"en":"Unlike birds, many members of Pterosauria flew with a wing supported mainly by one long finger.","zh":"与鸟类不同，许多翼龙目的动物主要靠一根特别长的手指支撑翼膜来飞行。"}]}],"synonyms":["pterosaurs","pterosaur (member of the group)","Pterosauria (scientific term)"],"phonetic":"/ˌtɛrəˈsɔriə/","extraExplanation":["“Pterosauria”来自希腊语：pteron（翅膀）+ saura（蜥蜴/爬行动物），字面意思类似“有翅的蜥蜴”。在科普语境中常用“pterosaurs（翼龙）”指该类群的成员，而“Pterosauria”更偏学术分类名。","常见误解：翼龙不是恐龙（dinosaurs），而是与恐龙同一时期生活的另一支会飞的爬行动物。","发音小提示：词尾 -saur- 在英语中常读作“sore/soar”的音（类似“索尔/索尔”），如 dinosaur（/ˈdaɪnəˌsɔr/）。"]}
{"word":"pterosaurian","summary":{"en":"Pterosaurian means “related to pterosaurs,” the extinct flying reptiles.","zh":"pterosaurian 指“与翼龙有关的”，翼龙是已灭绝的会飞行的爬行动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pterosaurs (extinct flying reptiles that lived during the age of dinosaurs).","zh":"与翼龙有关的；翼龙类的（翼龙是生活在恐龙时代、已灭绝的会飞行的爬行动物）。"},"examples":[{"en":"The museum displayed a pterosaurian fossil with a long, narrow skull.","zh":"博物馆展出了一块头骨细长的翼龙类化石。"},{"en":"Scientists compared pterosaurian wings to modern bird wings to understand flight.","zh":"科学家将翼龙类的翅膀与现代鸟类的翅膀作比较，以研究飞行原理。"}]}],"synonyms":["pterosaur","pterosaur-related"],"phonetic":"/ˌtɛrəˈsɔriən/","extraExplanation":["“pterosaurian”来自“pterosaur（翼龙）”。翼龙并不是恐龙（dinosaurs），而是一支与恐龙同时代、能主动飞行的爬行动物类群。","在科普或学术写作中，这个词常用来修饰化石、解剖结构或演化特征，如 pterosaurian anatomy（翼龙类解剖）、pterosaurian flight（翼龙类飞行）。"]}
{"word":"pterosaurs","summary":{"en":"Pterosaurs are extinct flying reptiles from the dinosaur age, but they are not dinosaurs.","zh":"翼龙是恐龙时代已灭绝的飞行爬行动物，但它们不属于恐龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flying reptile that lived during the age of dinosaurs (Mesozoic Era). Pterosaurs were not dinosaurs; they were a separate group of reptiles with wings made of skin stretched over a long finger.","zh":"翼龙：生活在恐龙时代（中生代）的飞行爬行动物。翼龙不是恐龙，而是一类独立的爬行动物；它们的翅膀由皮膜撑在一根特别长的手指上形成。"},"examples":[{"en":"Pterosaurs ruled the skies long before birds became common.","zh":"在鸟类普遍出现之前，翼龙曾主宰天空。"},{"en":"Many people think pterosaurs were dinosaurs, but they were actually flying reptiles.","zh":"很多人以为翼龙是恐龙，但它们其实是飞行爬行动物。"},{"en":"A famous pterosaur, Pteranodon, had a long crest on its head.","zh":"一种著名的翼龙——无齿翼龙（Pteranodon）——头上有很长的冠饰。"}]}],"synonyms":["pterosaur (singular)","flying reptile"],"phonetic":"/ˈtɛrəˌsɔr/","extraExplanation":["“pterosaur”来自希腊语：pteron（翅膀）+ sauros（蜥蜴/爬行动物），字面意思接近“有翅的爬行动物”。","学习提示：复数是 pterosaurs。读科普文章时常见相关词：wing membrane（翼膜）、crest（头冠）、fossil（化石）、Mesozoic（中生代）。"]}
{"word":"pterospermous","summary":{"en":"Pterospermous means “having winged seeds,” a botanical term for plants whose seeds are adapted for wind dispersal.","zh":"pterospermous 指“具翅种子的”，是植物学术语，用来形容种子带翅、适合随风传播的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having winged seeds; producing seeds with thin, wing-like extensions that help them disperse by wind.","zh":"（植物学）具翅种子的；种子带有薄薄的“翅状”结构，便于借风传播。"},"examples":[{"en":"Many maple trees are pterospermous, so their seeds can travel far in the wind.","zh":"许多槭树是具翅种子的，所以它们的种子能随风飘得很远。"},{"en":"The field guide describes the plant as pterospermous, with light, winged seeds.","zh":"这本野外指南把这种植物描述为具翅种子的，种子轻且带翅。"}]}],"synonyms":["wing-seeded","having winged seeds"],"phonetic":"/ˌtɛrəˈspɝməs/","extraExplanation":["词源提示：ptero- 来自希腊语，意为“翅/翼”（同源词如 pterodactyl“翼龙”）；-spermous 来自 sperma“种子”。合起来就是“有翅的种子”。","使用场景：该词多见于植物学描述、分类学或植物形态学文章中；日常英语里更常说 “winged seeds”。"]}
{"word":"pterospora","summary":{"en":"Pterospora is a botanical genus name, best known for the leafless forest plant called pinedrops (Pterospora andromedea).","zh":"Pterospora 是一个植物属名，最常指无叶的林下植物“松下珠”（pinedrops，Pterospora andromedea）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare plant genus in the heath family (Ericaceae), especially the species Pterospora andromedea (also called pinedrops), a leafless, non-photosynthetic plant that gets nutrients through fungi connected to tree roots.","zh":"一种稀有的植物属名（杜鹃花科 Ericaceae），尤指“松下珠”Pterospora andromedea（俗称 pinedrops）。它无叶、不进行光合作用，通过与真菌共生并间接连接树根来获取养分。"},"examples":[{"en":"Pterospora is sometimes spotted in pine forests, but it’s uncommon and easy to miss.","zh":"Pterospora 有时会在松林里被发现，但很罕见，也很容易被忽略。"},{"en":"Because Pterospora lacks green leaves, it depends on fungi rather than sunlight for energy.","zh":"由于 Pterospora 没有绿色叶片，它依赖真菌而不是阳光来获取能量。"}]}],"synonyms":["pinedrops (common name for Pterospora andromedea)"],"phonetic":"/ˌtɛrəˈspɔrə/","extraExplanation":["这是一个主要用于植物学的拉丁化名称；日常英语里更常见的是该属代表物种的俗名 pinedrops。","词源可拆为 ptero-（“翅”）+ spora（“孢子/种子”之意的构词元素），指其种子形态带“翅”，便于随风传播。","Pterospora andromedea 属于“菌异养植物”（mycoheterotrophic）：它通过真菌从周围树木获得碳源，因此常出现在针叶林或混交林的特定生态条件中。"]}
{"word":"pterostemon","summary":{"en":"Pterostemon is a scientific genus name for certain Mexican flowering plants.","zh":"Pterostemon 是指墨西哥一些开花植物的科学属名（翼蕊属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (scientific name: Pterostemon), native to Mexico; used mainly in botanical/scientific writing.","zh":"（植物学）翼蕊属（学名：Pterostemon），原产于墨西哥的一属开花植物；主要用于植物学/科学语境。"},"examples":[{"en":"The researcher recorded Pterostemon populations in central Mexico.","zh":"研究者记录了墨西哥中部的翼蕊属（Pterostemon）种群。"},{"en":"Pterostemon is usually written with a capital P because it is a genus name.","zh":"Pterostemon 通常首字母大写，因为它是属名。"}]}],"synonyms":["genus Pterostemon"],"phonetic":"/ˌtɛroʊˈstiːmən/","extraExplanation":["在生物分类学中，属名（genus）一般要首字母大写，并常用斜体书写（如 *Pterostemon*）；当你指某个具体物种时，会写成“属名 + 种加词”（如 *Pterostemon* + species epithet）。","词源提示：ptero- 来自希腊语，常见含义为“翼、翅”（如 pterodactyl）；-stemon 与“stamen（雄蕊）”相关，因此该名称大意可理解为“有翅/翼状结构的雄蕊”，反映植物形态特征。"]}
{"word":"pterostemonaceae","summary":{"en":"Pterostemonaceae is a scientific name for a plant family that includes the genus Pterostemon.","zh":"Pterostemonaceae 是翼蕊木科的学名，属于植物分类中的一个科，包含翼蕊木属（Pterostemon）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (in the order Crossosomatales) that includes the genus Pterostemon; the group is native to Mexico and is studied mainly in botanical classification.","zh":"翼蕊木科（植物分类中的一个科，隶属十字玫瑰目 Crossosomatales），包含翼蕊木属（Pterostemon）；原产于墨西哥，主要用于植物分类学研究。"},"examples":[{"en":"In her taxonomy report, she listed Pterostemonaceae under the order Crossosomatales.","zh":"在她的分类学报告里，她把翼蕊木科（Pterostemonaceae）列在十字玫瑰目（Crossosomatales）之下。"},{"en":"Pterostemonaceae is not a common word outside botany.","zh":"“Pterostemonaceae”在植物学之外并不常见。"}]}],"synonyms":["the Pterostemon family"],"phonetic":"/ˌtɛr.oʊ.stəˌmɑː.nəˈseɪ.iː/","extraExplanation":["这是一个非常专业的拉丁化植物科名：词尾“-aceae”表示“某某科”，常见于植物分类（如 Rosaceae 蔷薇科、Fabaceae 豆科）。","在日常英语里几乎不会用到；更常见的说法是“the Pterostemon family”（翼蕊木科）或直接说具体的属/种名（Pterostemon）。"]}
{"word":"pterostigma","summary":{"en":"A pterostigma is a small thickened, often colored spot on the front edge of an insect wing, common in dragonflies and related insects.","zh":"pterostigma（翅痣）是昆虫翅前缘附近的一块加厚、常带颜色的斑块，蜻蜓等昆虫上很常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thickened, often colored patch (a “spot”) near the front edge of an insect wing—especially in dragonflies, damselflies, and some wasps and bees.","zh":"（昆虫翅上的）翅痣：位于翅前缘附近、常带颜色的加厚斑块，常见于蜻蜓、豆娘以及部分蜂类、胡蜂等。"},"examples":[{"en":"The dragonfly’s pterostigma looks like a small dark rectangle near the tip of each wing.","zh":"蜻蜓每片翅膀尖端附近都有一个小小的深色矩形翅痣。"},{"en":"In many field guides, the color of the pterostigma helps identify different species.","zh":"在许多野外图鉴中，翅痣的颜色常用于区分不同物种。"}]}],"synonyms":["wing spot","stigma (in wing anatomy)"],"phonetic":"/ˌtɛrəˈstɪɡmə/","extraExplanation":["词源来自希腊语：pteron（翅膀）+ stigma（标记、斑点）。英文里常见于昆虫学/动物学文章。","翅痣除了是识别特征之一，也常被认为有助于飞行稳定：加重前缘末端、减少翅膀振动（不同类群作用可能略有差异）。","拼写提示：开头的 p 通常不发音，读起来像 “terostigma”。"]}
{"word":"pterostigmal","summary":{"en":"Pterostigmal means “related to the pterostigma,” a thickened colored spot on an insect wing.","zh":"pterostigmal 意为“与翅痣有关的”，翅痣是昆虫翅膀上的增厚有色斑点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterostigma (a thickened, often colored “spot” near the leading edge of an insect wing, especially in dragonflies and damselflies).","zh":"与翅痣有关的；指昆虫翅膀前缘近端的增厚、常带颜色的“斑点”（尤常见于蜻蜓、豆娘等）。"},"examples":[{"en":"The pterostigmal region helps stabilize the wing during flight.","zh":"翅痣相关区域有助于在飞行时稳定翅膀。"},{"en":"Under the microscope, the pterostigmal thickening is clearly visible.","zh":"在显微镜下，翅痣的增厚结构清晰可见。"}]}],"synonyms":["pterostigmatic"],"phonetic":"/ˌtɛrəˈstɪɡməl/","extraExplanation":["该词主要用于昆虫学与动物形态学写作中，日常英语很少见。","词源可拆解理解：ptero-（“翅膀”，源自希腊语）+ stigma（“标记/斑点”）。因此 pterostigmal 字面意思就是“翅膀上的标记（翅痣）的”。"]}
{"word":"pterostigmatic","summary":{"en":"An adjective meaning “related to the pterostigma,” the small colored spot near the front edge of many insect wings.","zh":"形容词，表示“与翅痣有关的”；翅痣是许多昆虫翅膀前缘（靠近翅尖）的一个小色斑/加厚区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pterostigma (the small, often colored thickened cell or “spot” near the leading edge of an insect wing, especially in dragonflies and damselflies).","zh":"与（昆虫翅膀前缘靠近翅尖处的）翅痣有关的；指翅痣的（尤常见于蜻蜓、豆娘等）。"},"examples":[{"en":"Some dragonflies have a dark pterostigmatic patch near the tip of each wing.","zh":"有些蜻蜓在每片翅膀的翅尖附近都有一块深色的翅痣相关斑块。"},{"en":"Researchers compared pterostigmatic features across several damselfly species.","zh":"研究人员比较了多个豆娘物种之间与翅痣相关的特征。"}]}],"synonyms":["pterostigmal","pterostigma-related"],"phonetic":"/ˌtɛrəstɪɡˈmætɪk/","extraExplanation":["“ptero-”源自希腊语，意为“翅”；“stigma”有“标记、斑点”之意，因此 pterostigma 指“翅上的标记/斑点”。pterostigmatic 常用于昆虫学或生物学写作中，日常英语很少见。","翅痣被认为可能与飞行稳定性有关（例如改变翅尖附近的气流与振动特性），但具体功能会因昆虫类群而异，常见于蜻蜓目昆虫的描述与分类鉴定。"]}
{"word":"pterostigmatical","summary":{"en":"A rare scientific adjective meaning “related to the pterostigma,” the small marked cell near the front edge of an insect wing.","zh":"一个少见的科学形容词，意为“与翅痣有关的”；翅痣是昆虫翅前缘附近的小斑/小翅室。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterostigma (a small, often thickened or pigmented cell/spot near the leading edge of an insect wing, especially in dragonflies and damselflies).","zh":"与（昆虫翅膀上的）翅痣有关的；指翅痣的（翅痣常见于蜻蜓、豆娘等，位于翅前缘附近，常较厚或带色）。"},"examples":[{"en":"The paper compares pterostigmatical size across several dragonfly species.","zh":"这篇论文比较了几种蜻蜓的翅痣大小差异。"},{"en":"A darker, pterostigmatical mark can help with species identification in the field.","zh":"较深色的翅痣特征常有助于野外辨识物种。"}]}],"synonyms":["pterostigmal","pterostigmatic"],"phonetic":"/ˌtɛrəstɪɡˈmætɪkəl/","extraExplanation":["“pterostigmatical”是非常少见的专业用词，多见于昆虫学/动物形态学写作。日常或科普语境里，更常用的是“pterostigma (翅痣)”本身，或说“the pterostigma is…”来描述。","词源上可拆为：ptero-（与“翅、翼”有关）+ stigma（“标记、斑点”）+ -ical（形容词后缀）。","翅痣通常位于翅的前缘靠近翅尖处；在蜻蜓等类群中常被认为与飞行稳定性、减少翅振动等功能有关，但具体作用会随类群与研究而异。"]}
{"word":"pterotheca","summary":{"en":"Pterotheca means a protective wing case/sheath in insects, especially covering the developing wing in the pupal stage.","zh":"pterotheca 指昆虫的翅鞘/翅保护套，常用于描述蛹期覆盖并保护正在发育的翅的结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) A wing case or wing sheath—an external covering that protects a developing insect wing (especially in the pupal stage).","zh":"（昆虫学）翅鞘；翅的保护套——用于保护昆虫正在发育的翅（尤指蛹期）的外部覆盖结构。"},"examples":[{"en":"Under the microscope, the pterotheca looks like a thin cover over the folded wing.","zh":"在显微镜下，翅鞘看起来像覆盖在折叠翅上的一层薄薄的外壳。"},{"en":"During the pupa stage, the wing pterotheca protects the wing as it forms.","zh":"在蛹期，翅鞘会在翅形成过程中起到保护作用。"}]}],"synonyms":["wing case","wing sheath","wing cover"],"phonetic":"/ˌtɛroʊˈθiːkə/","extraExplanation":["词源提示：ptero- 来自希腊语，意为“翅”；-theca 意为“盒、鞘、容器”。因此 pterotheca 字面含义接近“装翅的鞘/盒”。","这是一个较少见的专业术语，多出现在昆虫形态学或分类学写作中；在一般科普或课堂中更常用的说法是 wing case / wing sheath / wing pad（视昆虫类群与阶段而定）。"]}
{"word":"pterothorax","summary":{"en":"Pterothorax is the wing-bearing portion of an insect’s thorax (typically the mesothorax + metathorax).","zh":"Pterothorax 指昆虫胸部中长翅的部分（通常为中胸与后胸的合称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The wing-bearing part of an insect’s thorax (usually the middle and rear segments: the mesothorax and metathorax).","zh":"昆虫胸部中长有翅的部分（通常指中胸与后胸，即“中胸+后胸”的合称）。"},"examples":[{"en":"In most flying insects, the pterothorax contains the main flight muscles.","zh":"在多数能飞的昆虫中，pterothorax（翅胸）含有主要的飞行肌肉。"},{"en":"Scientists compared the pterothorax structure of bees and wasps to study flight efficiency.","zh":"科学家比较蜜蜂和黄蜂的翅胸结构，以研究飞行效率。"}]}],"synonyms":["wing-bearing thorax","wing thorax"],"phonetic":"/ˌtɛrəˈθɔːræks/","extraExplanation":["“ptero-”来自希腊语，意思与“翅膀”有关（如 pterodactyl 翼龙）；“thorax”指“胸部”。因此 pterothorax 直观含义就是“与翅相关的胸部”。","在昆虫解剖学里，胸部通常分为前胸（prothorax）、中胸（mesothorax）、后胸（metathorax）。翅通常长在中胸和后胸，所以常把这两段合称为 pterothorax（翅胸）。"]}
{"word":"pterotic","summary":{"en":"Pterotic means “related to the pterotic bone,” a skull bone (especially in fishes) near the ear region.","zh":"pterotic 指“与翼耳骨有关的”，即（尤指鱼类）颅骨中靠近耳区的一块骨相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterotic bone (a bone in the skull of many fishes and some other vertebrates, near the ear region).","zh":"与“翼耳骨/翼耳区骨”（许多鱼类及部分脊椎动物颅骨中、靠近耳区的一块骨）有关的。"},"examples":[{"en":"The researcher described a pterotic ridge on the fish skull.","zh":"研究者描述了鱼类颅骨上的翼耳骨嵴。"},{"en":"Damage to the pterotic region can affect structures near the ear.","zh":"翼耳骨区域受损可能影响靠近耳部的结构。"}]}],"synonyms":["otic (related, broader)","temporal (related in location, not equivalent)"],"phonetic":"/ˌtɛrəˈtɑtɪk/","extraExplanation":["“pterotic”多见于解剖学、鱼类学与古生物学论文中，日常英语很少使用。","词源上常被解释为来自希腊语 pteron（翼）+ otic（耳的）；在形态学命名里，-otic 常指“与耳区/听囊附近相关”。","常见搭配：pterotic bone（翼耳骨）、pterotic process（翼耳突）、pterotic region（翼耳骨区域）。"]}
{"word":"pterous","summary":{"en":"Pterous means “winged” or “having wings,” mainly used in scientific contexts and often seen as the suffix -pterous.","zh":"pterous 意为“有翅的/具翅的”，主要用于科学语境，常见于后缀 -pterous（……翅的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Winged; having wings or wing-like parts (often used in scientific writing).","zh":"有翅的；具翅或翅状结构的（多用于科学语境）。"},"examples":[{"en":"In entomology, many insects are described as pterous when they develop full wings.","zh":"在昆虫学中，许多昆虫在长出完整翅膀时会被描述为 pterous（有翅的）。"},{"en":"The report compared pterous and wingless forms of the same species.","zh":"报告比较了同一物种的有翅型与无翅型。"}]}],"synonyms":["winged","alate","finned (in some contexts)"],"phonetic":"/ˈtɛrəs/","extraExplanation":["该词较少单独使用，更常见于复合词或后缀形式 -pterous（表示“……翅的/……翼的”），如 dipterous（双翅的）、apterous（无翅的）。","词源来自希腊语 pteron（“翅膀”）。在英语里词首 pt- 常见“p 不发音”的情况（如 pterodactyl），因此 pterous 通常读作以 /t/ 开头。"]}
{"word":"pteroylglutamic","summary":{"en":"Pteroylglutamic refers to folic acid (vitamin B9), usually seen in the term “pteroylglutamic acid.”","zh":"pteroylglutamic 指与叶酸（维生素B9）有关，通常出现在“pteroylglutamic acid（蝶酰谷氨酸）”这一完整名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to pteroylglutamic acid (folic acid, vitamin B9), a B vitamin important for making DNA and for healthy red blood cells.","zh":"与“蝶酰谷氨酸”（即叶酸/维生素B9）有关的；叶酸是一种B族维生素，对DNA合成和红细胞健康很重要。"},"examples":[{"en":"Pteroylglutamic acid is another name for folic acid (vitamin B9).","zh":"Pteroylglutamic acid（蝶酰谷氨酸）是叶酸（维生素B9）的另一种名称。"},{"en":"Many prenatal vitamins include pteroylglutamic acid to help prevent certain birth defects.","zh":"许多孕期维生素含有pteroylglutamic acid（叶酸），以帮助预防某些出生缺陷。"}]}],"synonyms":["folic acid","vitamin B9","folate"],"phonetic":"/ˌtɛrəjəlˌɡluːˈtæmɪk/","extraExplanation":["“pteroylglutamic”通常不会单独使用，更常见的完整写法是 **pteroylglutamic acid**（蝶酰谷氨酸），在食品标签、药品说明书或科研文章里出现。日常英语更常用 **folic acid**（叶酸）或 **folate**（叶酸盐/天然叶酸的统称）。","在营养学语境中：**folic acid**多指补充剂/强化食品里的合成形式；**folate**多指食物中天然存在的形式（如绿叶蔬菜、豆类）。"]}
{"word":"pteroylmonogl","summary":{"en":"Pteroylmonoglutamic (acid) is the chemical name for folic acid (vitamin B9).","zh":"pteroylmonoglutamic（acid）是叶酸（维生素B9）的化学名称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or being pteroylmonoglutamic acid, the chemical name for folic acid (vitamin B9), an important vitamin needed to make DNA and red blood cells.","zh":"与“蝶酰单谷氨酸”有关的；即叶酸（维生素B9）的化学名称。叶酸对合成DNA和生成红细胞很重要。"},"examples":[{"en":"Folic acid is also called pteroylmonoglutamic acid in chemical texts.","zh":"在化学资料中，叶酸也被称为蝶酰单谷氨酸。"},{"en":"The supplement label listed pteroylmonoglutamic acid as the active ingredient.","zh":"补充剂标签把蝶酰单谷氨酸列为有效成分。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a noun, in scientific writing) pteroylmonoglutamic acid itself; folic acid.","zh":"（作名词，多用于科研语境）蝶酰单谷氨酸本身；即叶酸。"},"examples":[{"en":"Researchers measured pteroylmonoglutamic acid levels in the blood.","zh":"研究人员测量了血液中的蝶酰单谷氨酸水平。"}]}],"synonyms":["folic acid","folate","vitamin B9"],"phonetic":"/ˌtɛroʊəlˌmɑnəɡluˈtæmɪk/","extraExplanation":["你输入的“pteroylmonogl”很可能是“pteroylmonoglutamic (acid)”的截断写法。日常英语更常用“folic acid / folate（叶酸）”。","在营养学里：folate通常指食物中的天然形式；folic acid常指补充剂/强化食品中的合成形式。很多化学或药典资料会用“pteroylmonoglutamic acid”来指补充剂形式的叶酸。"]}
{"word":"pterygia","summary":{"en":"Pterygia are wing-shaped tissue growths—most commonly abnormal growths on the eye (plural of pterygium).","zh":"pterygia 是“翼状”组织增生（pterygium 的复数），最常指眼部的翼状胬肉等赘生组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Abnormal wing-shaped growths of tissue, especially on the eye (often growing from the white of the eye toward the cornea).","zh":"（医学）翼状赘片；尤指眼部的翼状胬肉等“翼状”组织增生，常从眼白（结膜）向角膜生长。"},"examples":[{"en":"The doctor said the pterygia were caused by long-term sun and wind exposure.","zh":"医生说这些翼状赘片是长期日晒和风沙刺激造成的。"},{"en":"He wore sunglasses to prevent his pterygia from getting worse.","zh":"他戴太阳镜以防翼状赘片加重。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy/Zoology) Wing-like membranes or folds of tissue (plural of pterygium).","zh":"（解剖/动物学）翼状膜；呈“翅膀状”的膜或皮褶（pterygium 的复数）。"},"examples":[{"en":"Some animals have pterygia that help them glide or move through water.","zh":"有些动物有翼状膜，能帮助它们滑翔或在水中移动。"}]}],"synonyms":["pterygiums","wing-shaped growths","pterygium (singular)"],"phonetic":"/təˈrɪdʒiə/","extraExplanation":["“pterygia”是“pterygium”的复数形式。临床上最常见的指“翼状胬肉”（pterygium）：一种结膜组织向角膜侵犯的增生，外观像三角形/翼状的肉膜，常与紫外线、风沙、干燥刺激有关。","词源来自希腊语 pteryx / pteryg-，意思是“翅膀”。因此它也可用于描述身体或动物结构中“像翅膀一样”的膜状组织。","发音小提示：结尾 -gia 常读作 /dʒiə/（类似“jee-uh”）。"]}
{"word":"pterygial","summary":{"en":"Pterygial means “wing-like” or “related to a pterygium,” often used in medical (especially eye) contexts.","zh":"pterygial 意为“翼状的”或“与翼状胬肉有关的”，常用于医学（尤指眼科）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a pterygium (a small, wing-shaped growth of tissue), especially in the eye.","zh":"与翼状胬肉有关的（翼状胬肉是呈“翅状/翼状”的小块组织增生），尤指眼部。"},"examples":[{"en":"The doctor noted mild pterygial changes on the nasal side of the cornea.","zh":"医生记录到角膜鼻侧有轻微的翼状胬肉样改变。"},{"en":"Surgery was recommended because the pterygial tissue was slowly growing toward the pupil.","zh":"由于翼状胬肉组织正缓慢向瞳孔方向生长，医生建议手术处理。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wing-like; shaped like a small wing or fin (used in anatomy and zoology).","zh":"翼状的；像小翅膀或鳍一样的（用于解剖学与动物学语境）。"},"examples":[{"en":"Some fish have pterygial folds that help stabilize movement in water.","zh":"一些鱼类有翼状褶皱，能帮助在水中保持稳定运动。"},{"en":"The diagram labels a pterygial membrane connecting the structures.","zh":"图示标注了一层连接这些结构的翼状膜。"}]}],"synonyms":["winglike","alar","pterygoid (related form, not always interchangeable)"],"phonetic":"/təˈrɪdʒiəl/","extraExplanation":["词源提示：pterygial 来自希腊语 pteryx / pteryg-，意为“翅膀”。因此它既可指“像翅膀一样的”，也常在眼科中专指与“翼状胬肉（pterygium）”相关的改变或组织。"]}
{"word":"pterygiophore","summary":{"en":"A fin-supporting bone/cartilage in fishes that anchors fin rays.","zh":"鱼类鳍的内部支撑骨/软骨结构，用于固定和支撑鳍条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small supporting bone or cartilage in a fish’s fin that anchors and supports the fin rays (the “internal fin support” inside the body).","zh":"（鱼类）鳍支骨；鳍的内部支撑结构（骨或软骨），用来固定并支撑鳍条。"},"examples":[{"en":"In many fishes, the dorsal fin rays attach to pterygiophores.","zh":"在许多鱼类中，背鳍的鳍条附着在鳍支骨上。"},{"en":"The specimen shows enlarged pterygiophores near the anal fin.","zh":"该标本在臀鳍附近显示出增大的鳍支骨。"}]}],"synonyms":["fin support","fin-supporting element"],"phonetic":"/ˌtɛrɪˈdʒiəˌfɔr/","extraExplanation":["词源提示：pterygiophore 来自希腊语词根 pterygi-（“鳍、翼”）+ -phore（“携带、承载”），字面意思是“承载鳍的结构”。","使用场景：这是解剖学与鱼类学（ichthyology）里的专业术语，常见于学术论文、解剖图谱和形态学描述中，日常英语中几乎不用。","相关词：fin ray（鳍条）、dorsal/anal fin（背鳍/臀鳍）、cartilage（软骨）、ossified（骨化的）。"]}
{"word":"pterygium","summary":{"en":"Pterygium is a wing-shaped growth on the surface of the eye that may irritate the eye or affect vision if it reaches the cornea.","zh":"pterygium 指眼表面呈“翼状”生长的组织（翼状胬肉），可能引起刺激，长到角膜时可能影响视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, raised growth on the eye (usually on the white part) that can slowly extend toward the cornea and sometimes irritate vision.","zh":"（眼部）翼状胬肉：眼睛表面（多在眼白处）长出的隆起组织，可能逐渐向角膜延伸，有时会刺激或影响视力。"},"examples":[{"en":"The doctor said the redness was caused by a pterygium.","zh":"医生说眼睛发红是翼状胬肉引起的。"},{"en":"He wore sunglasses to reduce irritation from his pterygium.","zh":"他戴太阳镜来减轻翼状胬肉带来的刺激。"},{"en":"If a pterygium grows onto the cornea, it can affect vision.","zh":"如果翼状胬肉长到角膜上，可能会影响视力。"}]}],"synonyms":["surfer’s eye","ocular surface growth"],"phonetic":"/təˈrɪdʒiəm/","extraExplanation":["词源提示：pterygium 来自希腊语 pteryx（“翅膀”），因为这种增生组织常呈三角形或像“翅膀”一样向角膜方向延伸。","常见语境：多出现在眼科/医学语境，也有人俗称“surfer’s eye（冲浪者的眼）”，因为长期日晒、风沙、灰尘等刺激会增加风险。","学习提醒：不要与“stye（麦粒肿）”“conjunctivitis（结膜炎，红眼病）”混淆；pterygium 通常是慢性增生，不是急性化脓的小包。"]}
{"word":"pterygiums","summary":{"en":"“Pterygiums” (plural of “pterygium”) are tissue growths on the eye that can extend onto the cornea and cause irritation or vision problems.","zh":"“pterygiums”（pterygium的复数）指眼部翼状胬肉，可能向角膜生长，引起刺激不适或视力问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A growth of tissue on the eye (usually starting from the inner corner) that can spread over the cornea and may cause irritation or blurred vision. “Pterygiums” is the plural of “pterygium.”","zh":"（眼部）翼状胬肉：通常从眼睛内侧眼角的结膜长出，可能向角膜延伸，造成刺激、异物感或视力模糊。“pterygiums”为“pterygium”的复数。"},"examples":[{"en":"The doctor said my pterygiums were likely related to years of sun and wind exposure.","zh":"医生说我的翼状胬肉可能与多年日晒和风沙刺激有关。"},{"en":"He wears sunglasses to prevent his pterygiums from getting worse.","zh":"他戴太阳镜来防止翼状胬肉加重。"},{"en":"In severe cases, pterygiums can grow onto the cornea and affect vision.","zh":"在严重情况下，翼状胬肉可能长到角膜上并影响视力。"}]}],"synonyms":["pterygia","surfer’s eye (informal)"],"phonetic":"/təˈrɪdʒiəmz/","extraExplanation":["发音与拼写提示：也常见复数写作“pterygia”（更偏学术/医学用法）；“pterygiums”在临床书写中也很常见。","常见语境：多出现在眼科（ophthalmology）就诊记录、体检报告或健康科普文章里。与“pinguecula（睑裂斑/黄斑样结膜变性）”相关但不同：pinguecula通常不长到角膜上，而pterygium可能侵入角膜。","成因与预防的常见表述：英语材料里经常把它和UV exposure（紫外线暴露）、dryness（干燥）、dust/wind（风沙）联系起来；因此会建议sunglasses、hat、lubricating eye drops等。"]}
{"word":"pterygo","summary":{"en":"Pterygo- is a medical/anatomy word part meaning “wing” or “wing-shaped.”","zh":"pterygo- 是医学/解剖学中的构词成分，表示“翼、翼状（像翅膀一样）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “wing” or “wing-shaped,” used in medical/anatomical terms (especially parts near the jaw).","zh":"（构词成分）表示“翼、翅”或“翼状的”，常用于医学/解剖学术语（尤其与颌部附近结构有关）。"},"examples":[{"en":"In anatomy, “pterygoid” refers to a wing-shaped bone or structure near the jaw.","zh":"在解剖学中，pterygoid 指靠近下颌的“翼状”骨或结构。"},{"en":"Dentists may mention the “pterygoid muscles” when talking about how the jaw moves.","zh":"牙医在讨论下颌运动时可能会提到 “pterygoid muscles（翼肌）”。"}]}],"synonyms":["pteryg-"],"phonetic":"/ˈtɛrɪɡoʊ/","extraExplanation":["pterygo- 来自希腊语 pteryx / pteryg-，意思是“翅膀、翼”。因此它常出现在描述“翼状/像翅膀一样伸展”的解剖结构中。","拼写以 p 开头但常不发音，这和很多希腊来源词相似（如 psychology 的 p 也不发音）。"]}
{"word":"pterygobranchiate","summary":{"en":"A rare zoological adjective meaning “having wing-like gills.”","zh":"一个罕见的动物学形容词，意为“具有翼状鳃的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) having wing-like gills; relating to organisms that breathe with wing-shaped gill structures.","zh":"（指动物）具有翼状鳃的；与“翼状鳃”呼吸结构有关的。"},"examples":[{"en":"Some early zoological texts describe certain worms as pterygobranchiate because of their wing-like gills.","zh":"一些早期动物学文献把某些蠕虫描述为 pterygobranchiate，因为它们有翼状的鳃。"},{"en":"The specimen was labeled pterygobranchiate, indicating a particular gill form used for respiration.","zh":"这个标本被标注为 pterygobranchiate，表示它具有一种特定的鳃形态用于呼吸。"}]}],"synonyms":["wing-gilled (rare/technical paraphrase)"],"phonetic":"/ˌtɛrɪɡoʊˈbræŋkiˌeɪt/","extraExplanation":["这是一个非常少见的生物学/动物学形容词，多见于分类学描述或旧式学术写作，日常英语几乎不会用到。","词源可拆为 pterygo-（来自希腊语，意为“翅、翼”）+ branchia（意为“鳃”）+ -ate（构成形容词），整体字面意思就是“有翼状鳃的”。","在阅读学术材料时，你也可能看到相关词形：pterygobranch（名词/形容词，指具有这类鳃结构的生物或与之相关的）或 pterygobranchia（指“翼鳃类/翼鳃结构”，视语境而定）。"]}
{"word":"pterygode","summary":{"en":"“Pterygoid” is an anatomy term meaning “related to the wing-like parts of the sphenoid bone or the jaw’s chewing muscles,” and it can also name one of those muscles.","zh":"“Pterygoid”是解剖学用语，指“与蝶骨翼突或下颌咀嚼相关的翼肌有关”，也可作名词指其中一块翼肌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the pterygoid processes of the sphenoid bone, or to the pterygoid muscles used for chewing and moving the jaw.","zh":"（解剖）与蝶骨的翼突有关的；或与翼肌（用于咀嚼与下颌运动的肌肉）有关的。"},"examples":[{"en":"The dentist suspected a pterygoid muscle spasm after the long procedure.","zh":"牙医在长时间治疗后怀疑出现了翼肌痉挛。"},{"en":"Pain near the jaw can involve the pterygoid muscles, especially when chewing.","zh":"靠近下颌的疼痛可能与翼肌有关，尤其是在咀嚼时。"}]},{"partOfSpeech":"n.","definition":{"en":"A pterygoid muscle (one of a pair of muscles on each side of the jaw).","zh":"翼肌（下颌两侧的一对肌肉之一）。"},"examples":[{"en":"The therapist massaged the medial pterygoid to reduce jaw tension.","zh":"治疗师按摩了内翼肌以减轻下颌紧张。"}]}],"synonyms":["wing-shaped (informal meaning only)","pterygoid muscle (for the noun sense)"],"phonetic":"/ˈtɛrɪˌɡɔɪd/","extraExplanation":["你输入的“pterygode”常见于把 **pterygoid** 拼错的情况；标准拼写通常是 **pterygoid**。","词源提示：来自希腊语 *pteryx / pterygon*（“翅膀”）+ *-oid*（“……形状的/类似……的”），因为“翼突（pterygoid process）”外形像翅膀。","常见搭配：**lateral pterygoid / medial pterygoid**（外翼肌/内翼肌）；**pterygoid process**（翼突）；多用于医学、牙科、解剖学语境。"]}
{"word":"pterygodum","summary":{"en":"“Pterygodum” is not a standard English word; it is most likely a misspelling of “pterygium” (a wing-shaped growth on the eye).","zh":"“pterygodum”不是标准英语词，最可能是“pterygium（翼状胬肉）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) A rare or nonstandard form; most commonly people mean “pterygium,” a medical term for a wing-shaped growth on the eye.","zh":"（可能为拼写错误）一个罕见或不规范的写法；多数情况下人们想表达的是“pterygium（翼状胬肉）”，指眼睛表面呈翼状生长的组织。"},"examples":[{"en":"I couldn’t find “pterygodum” in standard dictionaries—did you mean “pterygium”?","zh":"我在常见词典里找不到“pterygodum”——你是不是想写“pterygium”？"},{"en":"The doctor diagnosed him with a pterygium and recommended protecting his eyes from sun and dust.","zh":"医生诊断他有翼状胬肉，并建议防晒、防风沙以保护眼睛。"}]}],"synonyms":["pterygium (likely intended)"],"phonetic":"/ˈtɛrɪɡoʊdəm/","extraExplanation":["“pterygodum”在常见英语词典与医学词汇中并不常见，更像是把“pterygium /tɚˈrɪdʒiəm/（翼状胬肉）”拼错了。","词根提示：pterygo- 来自希腊语，意为“翅膀、翼状”（如 pterodactyl 翼手龙、pterygoid 翼状骨）。如果你能提供上下文（句子/来源领域：医学、昆虫学、植物学等），我可以更准确判断你要找的词。"]}
{"word":"pterygogenea","summary":{"en":"A rare, obsolete zoological term for a taxonomic group of winged insects.","zh":"一个罕见且已较少使用的动物学术语，指“有翅昆虫”的历史类群名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(zoology, obsolete) A historical taxonomic name used in some older classifications for winged insects—roughly corresponding to what is now called the winged-insect group (Pterygota).","zh":"（动物学，旧用法）早期分类学中曾用的一个类群名称，指“有翅的昆虫”，大致相当于现代所说的有翅亚纲（Pterygota）。"},"examples":[{"en":"In a few 19th‑century texts, insects were divided into Apterygogenea (wingless) and Pterygogenea (winged).","zh":"在一些19世纪的文献中，昆虫被分为无翅类（Apterygogenea）与有翅类（Pterygogenea）。"},{"en":"The term Pterygogenea is rarely used in modern entomology because newer classifications are preferred.","zh":"由于现代分类体系更常用，Pterygogenea 这个术语在当代昆虫学中很少出现。"}]}],"synonyms":["Pterygota (modern term)","winged insects"],"phonetic":"/ˌtɛrɪɡoʊˈdʒiːniə/","extraExplanation":["词源可拆为希腊语 pteryx / pterygo-（“翅、翼”）+ genea（“产生、族群/谱系”）之意，整体带有“生出翅的/有翅的族群”的含义。","这是偏“文献/历史分类”用语：在现代学术写作里更常见的是 Pterygota（有翅昆虫）或直接用 winged insects。阅读老资料时遇到该词，可把它理解为“有翅的昆虫类群”。"]}
{"word":"pterygoid","summary":{"en":"“Pterygoid” is an anatomy term meaning “related to the pterygoid area of the skull or jaw,” and it can also refer to a pterygoid muscle.","zh":"pterygoid 是解剖学用语，指“与翼突/翼肌相关的”；也可指某块翼肌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the pterygoid processes of the sphenoid bone or to the pterygoid muscles of the jaw (used especially in the terms “medial pterygoid” and “lateral pterygoid”).","zh":"（解剖）与蝶骨的翼突（pterygoid processes）或下颌的翼肌（pterygoid muscles）有关的（常见于“内翼肌 / 外翼肌”等术语）。"},"examples":[{"en":"The lateral pterygoid muscle helps move the jaw forward and side to side.","zh":"外翼肌有助于使下颌前伸并左右移动。"},{"en":"Pain near the pterygoid region can affect chewing.","zh":"翼突附近区域的疼痛会影响咀嚼。"}]},{"partOfSpeech":"n.","definition":{"en":"A pterygoid muscle (especially the medial pterygoid or lateral pterygoid).","zh":"翼肌（特指内翼肌或外翼肌）。"},"examples":[{"en":"The dentist suspected spasm of a pterygoid after the long procedure.","zh":"牙医怀疑在长时间治疗后出现了翼肌痉挛。"},{"en":"Massage techniques may target the pterygoid to reduce jaw tension.","zh":"按摩手法可能会针对翼肌来减轻下颌紧张。"}]}],"synonyms":["pterygoid muscle","medial pterygoid","lateral pterygoid","pterygoid process"],"phonetic":"/ˈtɛrɪˌɡɔɪd/","extraExplanation":["词源提示：pterygoid 来自希腊语 pteryx（意为“翅膀”）相关词根，因为蝶骨的“翼突”形状像翅状突起。","学习提示：在医学/解剖学里它多作为形容词出现（pterygoid muscle / pterygoid process / pterygoid plate）。日常英语中很少单独使用。"]}
{"word":"pterygoidal","summary":{"en":"An anatomical adjective meaning “related to the pterygoid bones/processes or jaw muscles.”","zh":"解剖学形容词，表示“与翼突（骨/骨突）或翼状肌（颌部肌肉）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid processes (wing-like bones of the sphenoid) or the pterygoid muscles in the jaw.","zh":"与翼突（蝶骨上的翼状骨突）或翼状肌（下颌的咀嚼肌群）有关的。"},"examples":[{"en":"The dentist noted tenderness in the pterygoidal region near the jaw.","zh":"牙医指出下颌附近的翼突相关区域有压痛。"},{"en":"Pain during chewing can involve the pterygoidal muscles.","zh":"咀嚼时的疼痛可能与翼状肌有关。"}]}],"synonyms":["pterygoid","pterygoidean"],"phonetic":"/ˌtɛrɪˈɡɔɪdəl/","extraExplanation":["“pterygoidal”是医学/解剖学用语，常见于牙科、颌面外科、耳鼻喉科等语境；日常英语更常用“pterygoid”（如：pterygoid muscle）。","词根提示：pterygo- 来自希腊语“pteryx/pteryg-”（翅膀），因为“翼突”形状像小翅膀；-al 表示“……的/与……有关的”。"]}
{"word":"pterygoidean","summary":{"en":"An anatomical adjective meaning “related to the pterygoid (wing-like) region of the skull near the jaw.”","zh":"解剖学形容词，指“与颅底靠近下颌的翼突（翼状）区域有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid processes (wing-like parts of the sphenoid bone) or the pterygoid region of the skull, near the jaw.","zh":"与翼突（蝶骨上呈“翼状”的突起）或翼突区相关的；位于颅底、靠近下颌的部位。"},"examples":[{"en":"The surgeon carefully avoided the pterygoidean area to protect nearby nerves.","zh":"外科医生小心避开翼突区，以保护附近的神经。"},{"en":"Pain can sometimes be referred from pterygoidean muscles during jaw movement.","zh":"下颌运动时，疼痛有时可能源自翼突区相关的肌肉。"}]}],"synonyms":["pterygoid","pterygoidal"],"phonetic":"/ˌtɛrɪˈɡɔɪdiən/","extraExplanation":["“pterygo-”来自希腊语，意为“翅膀”，因为翼突在形状上像小翼；“pterygoidean”多见于解剖学、牙科与颌面外科文献中，日常英语很少使用。","常见相关词：pterygoid（翼突的/翼状的），pterygoid muscles（翼肌：内侧翼肌、外侧翼肌），pterygoid process（翼突）。"]}
{"word":"pterygomalar","summary":{"en":"An anatomy term meaning “related to the pterygoid area and the cheekbone (zygomatic/malar) area.”","zh":"解剖学术语，指“与翼突区和颧骨（脸颊骨）区域相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid region (near the sphenoid bone) and the malar/zygomatic (cheek) bone; used in anatomy and anthropology to describe structures or features connecting these areas.","zh":"（解剖学/人类学）与翼突区（蝶骨附近）和颧骨（脸颊骨）相关的；用于描述连接或涉及这两处的结构或特征。"},"examples":[{"en":"The report described a pterygomalar groove near the cheekbone.","zh":"报告描述了颧骨附近的翼突—颧骨沟。"},{"en":"In skull measurements, pterygomalar landmarks help compare facial shape.","zh":"在颅骨测量中，翼突—颧骨的标志点有助于比较面部形态。"}]}],"synonyms":["pterygozygomatic","zygomatic (related term)","pterygoid (related term)"],"phonetic":"/ˌtɛrɪɡoʊˈmeɪlər/","extraExplanation":["这个词由 pterygo-（“翼突”，源自希腊语，意为“翼/翅”）和 malar（“颧骨/脸颊”）组成，常见于解剖学、牙科、颅面外科和体质人类学的专业描述中。","在实际文献中，你更常看到它作为复合结构名词的一部分出现（如 pterygomalar fissure / groove / region），而不是单独使用。"]}
{"word":"pterygomandibular","summary":{"en":"An anatomy/dentistry adjective meaning “related to the pterygoid region and the lower jaw (mandible).”","zh":"解剖/牙科用形容词，表示“与翼肌区及下颌骨相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the pterygoid region (near the pterygoid muscles of the jaw) and the mandible (lower jawbone); used mainly in anatomy and dentistry.","zh":"翼下颌的；与翼肌区（靠近翼肌的区域）和下颌骨（下颌）有关的；主要用于解剖学与口腔/牙科语境。"},"examples":[{"en":"The dentist injected anesthetic near the pterygomandibular space.","zh":"牙医在翼下颌间隙附近注射了麻醉剂。"},{"en":"Pain in the pterygomandibular region can affect jaw opening.","zh":"翼下颌区域的疼痛可能会影响张口。"}]}],"synonyms":["jaw-related","mandibular (partial)","pterygoid (partial)"],"phonetic":"/ˌtɛrɪɡoʊmænˈdɪbjələr/","extraExplanation":["“pterygomandibular”常见于牙科与口腔颌面外科，例如“pterygomandibular space（翼下颌间隙）”和“pterygomandibular raphe（翼下颌缝/翼下颌襞）”。这些结构与下牙槽神经阻滞麻醉（inferior alveolar nerve block）的定位有关。","构词提示：pterygo- 来自希腊语 pteryx（“翼、翅膀”），指楔骨的“翼突/翼状结构”；mandibular 来自 mandible（下颌骨）。合在一起就是“与翼肌区 + 下颌相关”。"]}
{"word":"pterygomaxillary","summary":{"en":"An anatomy term meaning “related to the pterygoid area and the upper jaw (maxilla).”","zh":"解剖学术语：指“与翼突区域及上颌骨（上颌）相关的/翼上颌的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid process (a part of the sphenoid bone) and the maxilla (upper jaw), especially the region where they meet in the skull.","zh":"（解剖）翼上颌的；与蝶骨翼突与上颌骨相关的，尤指两者在颅骨中相邻/相接的区域。"},"examples":[{"en":"The injection was placed near the pterygomaxillary fissure.","zh":"注射点放在翼上颌裂附近。"},{"en":"Dentists study pterygomaxillary anatomy to understand nerve pathways.","zh":"牙科医生学习翼上颌区的解剖结构，以了解神经走行。"}]}],"synonyms":["pterygoid-maxillary (hyphenated form)","pterygomaxillaris (Latinized form, less common in English)"],"phonetic":"/ˌtɛrɪɡoʊˈmæk.səˌlɛr.i/","extraExplanation":["这是一个医学/牙科常见的解剖学形容词，由 pterygo-（与“翼/翼突”相关）+ maxillary（上颌的）组成。常见搭配包括：pterygomaxillary fissure（翼上颌裂）、pterygomaxillary region（翼上颌区）。","在临床语境中，它常用于描述与上颌后方深部空间、血管神经通道相关的位置（例如上颌神经及其分支附近），因此多见于口腔颌面外科、麻醉与影像学报告。"]}
{"word":"pterygopalatal","summary":{"en":"An anatomical adjective meaning “related to the pterygoid region and the palatine bone,” often used in terms like “pterygopalatine fossa.”","zh":"解剖学形容词，表示“与翼突区域及腭骨相关”，常见于如“翼腭窝（pterygopalatine fossa）”等术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid region of the sphenoid bone and the palatine bone (especially the area called the pterygopalatine fossa) in the skull.","zh":"与蝶骨的翼突区域以及腭骨相关的（尤指颅骨中的“翼腭窝/翼腭区”）。"},"examples":[{"en":"The maxillary nerve passes through the pterygopalatine fossa.","zh":"上颌神经会经过翼腭窝。"},{"en":"Inflammation can spread through pterygopalatal spaces in the midface.","zh":"炎症可能通过中面部的翼腭间隙扩散。"}]}],"synonyms":["pterygopalatine"],"phonetic":"/ˌtɛrɪɡoʊˈpælət̬əl/","extraExplanation":["这个词多用于解剖学、牙科、耳鼻喉科与影像学语境，常见搭配包括：pterygopalatine fossa（翼腭窝）、pterygopalatine ganglion（翼腭神经节）、pterygopalatine canal（翼腭管）。","词源可拆解理解：pterygo- 来自希腊语 pteryx/pterygon（“翼、翅”），指蝶骨的“翼突”；palatal 来自 palate（“腭”），指腭骨/上腭区域。把它当作“翼突 + 腭”的复合形容词记忆最稳。"]}
{"word":"pterygopalatine","summary":{"en":"An anatomical adjective meaning “related to the pterygoid region and the palatine bone,” commonly seen in terms like pterygopalatine fossa/ganglion.","zh":"解剖学形容词，表示“与翼突区域及腭骨有关”，常见于翼腭窝/翼腭神经节等术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid region of the sphenoid bone and the palatine bone (an anatomical term, often used in names of structures in the deep face).","zh":"（解剖学术语）与蝶骨的翼突区域以及腭骨有关的；常用于面部深部结构的名称中。"},"examples":[{"en":"The pterygopalatine fossa contains nerves and blood vessels that supply the face.","zh":"翼腭窝内含有为面部供给的神经和血管。"},{"en":"Inflammation near the pterygopalatine ganglion can cause facial pain.","zh":"翼腭神经节附近的炎症可能引起面部疼痛。"},{"en":"The surgeon approached the tumor through the pterygopalatine region.","zh":"外科医生通过翼腭区域接近肿瘤。"}]}],"synonyms":["sphenopalatine","pterygoid-palatine"],"phonetic":"/ˌtɛrɪɡoʊˈpælətˌaɪn/","extraExplanation":["词源提示：pterygo- 来自希腊语，意为“翼/翅”，在解剖学中常指蝶骨的“翼突（pterygoid）”；palatine 与“腭（palate）/腭骨”有关。合起来表示与“翼突—腭骨”相关的部位。","常见搭配：pterygopalatine fossa（翼腭窝，深面部的一个重要空间）；pterygopalatine ganglion（翼腭神经节，与泪腺分泌、鼻腔黏膜等的神经调节有关）。医学文献里也常见近义/相关词 sphenopalatine（蝶腭的），但两者所指结构不完全相同。"]}
{"word":"pterygopharyngeal","summary":{"en":"A medical/anatomical adjective meaning “related to the pterygoid area and the pharynx (throat),” especially the pterygopharyngeus muscle or nearby structures.","zh":"医学/解剖学形容词，指“与翼突区域及咽部（喉咙）相关的”，尤指翼咽肌或其附近结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygopharyngeus muscle (a small muscle that connects the pterygoid region of the skull to the pharynx/throat) or to the pterygomandibular area near the pharynx.","zh":"与翼咽肌（连接颅骨翼突区域与咽部/喉咙的一块小肌肉）有关的；或与靠近咽部的翼下颌相关区域有关的（解剖/医学用语）。"},"examples":[{"en":"The surgeon identified a pterygopharyngeal fold during the examination.","zh":"外科医生在检查时辨认出一个翼咽襞。"},{"en":"Pain was suspected to involve the pterygopharyngeal region of the pharynx.","zh":"疼痛被怀疑与咽部的翼咽相关区域有关。"}]}],"synonyms":["pharyngeal (general)","anatomical (general)"],"phonetic":"/ˌtɛrɪɡoʊfəˈrɪndʒiəl/","extraExplanation":["这是非常专业的解剖学/耳鼻喉或口腔颌面外科词汇，日常英语中几乎不会用到。","词根拆解有助记忆：pterygo- 表示“翼突/像翅膀的结构”（源自希腊语 pteryx “翅膀”）；pharyngeal 表示“咽的/咽部的”。合起来就是“与翼突区域—咽部相关的”。","在文献里你可能会看到相关结构如 pterygopharyngeus（翼咽肌）、pterygopharyngeal fold（翼咽襞），常用于描述咽侧壁附近的肌肉或黏膜皱襞。"]}
{"word":"pterygopharyngean","summary":{"en":"An anatomical adjective meaning “related to the pterygopharyngeus (pterygopharyngeal) muscle/region involved in swallowing.”","zh":"一个解剖学形容词，表示“与翼咽肌（翼咽部/翼咽区域）有关”，该结构参与吞咽时咽部收缩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the pterygopharyngeus muscle (also called the pterygopharyngeal part of the superior pharyngeal constrictor), a muscle bundle that helps constrict the pharynx during swallowing.","zh":"（解剖）与翼咽肌相关的；翼咽肌（也常指上咽缩肌的翼咽部）是一束参与吞咽时咽部收缩的肌纤维。"},"examples":[{"en":"The report mentions tenderness near the pterygopharyngean region during swallowing.","zh":"报告提到患者吞咽时翼咽肌相关区域有压痛。"},{"en":"In anatomy lab, we traced the pterygopharyngean fibers toward the pharyngeal wall.","zh":"在解剖实验课上，我们追踪了翼咽部肌纤维走向咽壁。"}]}],"synonyms":["pterygopharyngeal","pterygopharyngeus (related to)"],"phonetic":"/ˌtɛrɪɡoʊfəˈrɪndʒiən/","extraExplanation":["这个词非常罕见，多出现在解剖学/医学语境中。更常见的表达是 pterygopharyngeus（翼咽肌）或 pterygopharyngeal（翼咽的）。","词根提示：pterygo- 来自“翼状突”（pterygoid process，蝶骨上的结构）；pharynge- 指“咽”。因此整体含义就是“与翼状突/翼咽相关的”。"]}
{"word":"pterygophore","summary":{"en":"A fin-supporting bone/cartilage element in fish that anchors fin rays to the body.","zh":"鱼鳍内部用来支撑并固定鳍条到身体的骨/软骨结构（鳍基骨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bone or cartilage element in a fish’s fin that supports and anchors the fin rays to the body (part of the fin skeleton).","zh":"（鱼类）鳍基骨：位于鱼鳍内部、用于支撑并把鳍条固定到身体上的小块骨质或软骨结构（鳍骨骼的一部分）。"},"examples":[{"en":"In many bony fish, pterygophores connect the dorsal fin rays to the vertebral region.","zh":"在许多硬骨鱼中，鳍基骨把背鳍的鳍条连接并固定在靠近脊椎的区域。"},{"en":"The researcher counted pterygophores to compare fin structure between species.","zh":"研究者通过统计鳍基骨的数量来比较不同物种的鳍部结构。"}]}],"synonyms":["pterygiophore","fin pterygiophore"],"phonetic":"/təˈrɪɡəˌfɔr/","extraExplanation":["该词多见于鱼类学（ichthyology）和比较解剖学。常见说法有 *pterygiophore* 或 *fin pterygiophore*。","词源来自希腊语：*pteryx/pteryg-*（“翼、鳍”）+ *-phore*（“携带、承载”），字面意思是“承载鳍（或翼）的结构”。","学习时可顺带区分：*fin ray*（鳍条，常是外侧可见的条状支撑）与 *pterygophore*（更靠内、把鳍条固定到身体骨骼/肌肉上的支撑件）。"]}
{"word":"pterygopodium","summary":{"en":"A pterygopodium is a clasper—one of the paired male reproductive organs of sharks and rays used to transfer sperm.","zh":"pterygopodium 指鲨、鳐等雄性软骨鱼类的交接器（成对生殖器官），用于传递精子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in male sharks and rays) a paired reproductive organ used to transfer sperm; a clasper.","zh":"（雄性鲨鱼和鳐等软骨鱼类的）交接器；用于传递精子的成对生殖器官；交合鳍（俗称“clasper”）。"},"examples":[{"en":"Male sharks have pterygopodia that help deliver sperm during mating.","zh":"雄鲨具有 pterygopodia，用于在交配时传递精子。"},{"en":"Researchers examined the pterygopodium to determine the fish’s sex and maturity.","zh":"研究人员检查了 pterygopodium，以判断这条鱼的性别和成熟度。"}]}],"synonyms":["clasper","mixopterygium"],"phonetic":"ˌtɛrɪɡoʊˈpoʊdiəm","extraExplanation":["这个词多见于动物学/解剖学文献，尤其是软骨鱼类（如鲨、鳐）的繁殖结构描述。日常英语更常用的说法是 **clasper**（交接器）。","词源上可拆为 **pterygo-**（与“翼/鳍”相关，来自希腊语 *pteryx* “wing/翼”）+ **-podium**（“足/附肢”，来自希腊语 *pous/pod-* “foot/足”），字面有“像翼一样的附肢”之意，贴合其位于腹鳍附近、呈附肢状的结构。"]}
{"word":"pterygosphenoid","summary":{"en":"An anatomical term meaning “related to the pterygoid process and the sphenoid bone.”","zh":"解剖学术语，指“与翼突及蝶骨相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the pterygoid process and the sphenoid bone (structures at the base of the skull).","zh":"（解剖）与翼突（pterygoid process）和蝶骨（sphenoid bone）两者有关的；翼突-蝶骨的。"},"examples":[{"en":"The surgeon identified a pterygosphenoid fracture near the skull base.","zh":"外科医生发现了颅底附近的翼突-蝶骨骨折。"},{"en":"Pain may radiate from the pterygosphenoid region in some head and jaw conditions.","zh":"在一些头部与颌部疾病中，疼痛可能从翼突-蝶骨区域放射。"}]}],"synonyms":["pterygo-sphenoid","pterygoid-sphenoid"],"phonetic":"/ˌtɛrɪɡoʊˈsfiːnɔɪd/","extraExplanation":["这是医学/解剖学里的复合词：pterygo- 指“翼突”（来自希腊语 pteryx，意为“翅/翼”），sphenoid 指“蝶骨”（来自希腊语 sphēn，意为“楔子”，形容其楔形）。在临床或影像学描述中常用来定位“颅底、上颌后方”的相关结构或病变。拼写上也常见带连字符的形式：pterygo-sphenoid。"]}
{"word":"pterygospinous","summary":{"en":"An anatomy term meaning “related to the pterygoid region and the sphenoid spine,” especially in phrases like “pterygospinous ligament.”","zh":"解剖学术语，指“与翼突区域及蝶骨棘相关”，常见于“翼棘韧带”等搭配。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid process (a part of the sphenoid bone near the jaw) and the sphenoid spine; used especially to describe a ligament, bony bridge, or opening in the skull.","zh":"与翼突（蝶骨靠近下颌的结构）和蝶骨棘相关的；尤用于描述颅底的翼棘韧带、骨性桥或孔。"},"examples":[{"en":"The report mentioned calcification of the pterygospinous ligament.","zh":"报告提到翼棘韧带出现钙化。"},{"en":"A pterygospinous bar can sometimes compress nearby nerves.","zh":"翼棘骨桥有时会压迫附近的神经。"}]}],"synonyms":["pterygospinous ligament (related term)","pterygospinous bar (related term)"],"phonetic":"/ˌtɛrɪɡoʊˈspaɪnəs/","extraExplanation":["“pterygospinous”主要出现在解剖学、口腔颌面外科、影像学（CT/MRI）和神经解剖的语境中，常与 pterygospinous ligament（翼棘韧带）、pterygospinous bar（翼棘骨桥）、pterygospinous foramen（翼棘孔）搭配使用。","词源上可拆解理解：pterygo- 指“翼突/翼状结构”（来自希腊语 pteryx，意为“翅膀”），spinous 指“棘突/棘状的”。合起来就是“与翼突和棘相关”。","在临床上提到它，往往是因为该结构变成骨性桥时，可能影响下颌神经分支附近的空间；不过这属于专业医学内容，具体意义要结合影像与症状判断。"]}
{"word":"pterygostaphyline","summary":{"en":"A rare anatomical adjective describing structures related to both the pterygoid (jaw) region and the soft-palate/uvula area.","zh":"一个少见的解剖学形容词，指与翼突（颌部）区域及软腭/悬雍垂区域都相关的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid region (near the jaw) and the staphyle/uvula area of the soft palate; used in anatomy to describe muscles, folds, or structures connecting these parts.","zh":"（解剖学）与翼突区（靠近下颌）以及软腭的悬雍垂/腭垂区域相关的；常用于描述连接这些部位的肌肉、皱襞或结构。"},"examples":[{"en":"The surgeon noted a pterygostaphyline fold during the oral exam.","zh":"外科医生在口腔检查时记录到了一个翼突—悬雍垂相关的皱襞。"},{"en":"Some anatomy texts mention pterygostaphyline fibers near the soft palate.","zh":"一些解剖学教材会提到软腭附近的翼突—悬雍垂相关纤维。"}]}],"synonyms":["pterygoid-palatal (contextual)","pterygo-uvular (contextual)"],"phonetic":"/ˌtɛrɪɡoʊstəˈfaɪlaɪn/","extraExplanation":["这是一个非常专业的解剖学形容词，主要出现在旧一些或偏专业的医学/解剖学文献中。常见的相关词根：pterygo-（来自希腊语，意为“翼/翼状”，在解剖里常指翼突或翼状结构），staphyl-（来自希腊语，意为“小葡萄”，在解剖里指悬雍垂/腭垂，因为形状像小葡萄）。","在现代教材里，你更常见到的是更具体的结构名称（例如某些腭部肌肉或皱襞的标准名称），而不是直接用这个复合形容词。"]}
{"word":"pterygota","summary":{"en":"Pterygota = the winged-insect group (most modern insects).","zh":"Pterygota 指“有翅昆虫”这一大类（涵盖大多数现代昆虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major group (subclass) of insects that have wings or evolved from winged ancestors (most modern insects, such as butterflies, flies, and beetles).","zh":"（昆虫学）有翅亚纲：指具有翅膀或由有翅祖先演化而来的昆虫大类（包括大多数现代昆虫，如蝴蝶、苍蝇、甲虫等）。"},"examples":[{"en":"Butterflies and beetles are both members of the Pterygota.","zh":"蝴蝶和甲虫都属于有翅亚纲（Pterygota）。"},{"en":"In many textbooks, insects are divided into Apterygota and Pterygota.","zh":"在许多教材里，昆虫常被分为无翅类（Apterygota）和有翅类（Pterygota）。"}]}],"synonyms":["winged insects"],"phonetic":"ˌtɛrɪˈɡoʊtə","extraExplanation":["“Pterygota”是学术用语，常见于生物学/昆虫学教材或论文中；日常英语里通常会说“winged insects（有翅昆虫）”。","词源来自希腊语：pteryx/pteryg- 表示“翅膀”，-ota 为分类学后缀。","分类地位在不同体系中可能有细微差异（如称为“subclass/亚纲”或更高层级的“clade/演化支”），但核心含义都是“有翅或由有翅祖先演化的昆虫”。"]}
{"word":"pterygote","summary":{"en":"A pterygote is a winged insect (or one descended from winged insects), classified in Pterygota.","zh":"pterygote 指有翅昆虫（或由有翅祖先进化而来的昆虫），分类上属于 Pterygota。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winged insect; a member of the insect group Pterygota (insects that have wings, or evolved from winged ancestors).","zh":"有翅昆虫；指昆虫中“有翅亚纲/有翅类（Pterygota）”的成员（现有翅，或由有翅祖先进化而来）。"},"examples":[{"en":"Butterflies, bees, and dragonflies are all pterygotes.","zh":"蝴蝶、蜜蜂和蜻蜓都属于有翅昆虫（pterygotes）。"},{"en":"Some pterygotes, like fleas, lost their wings over time but are still classified within Pterygota.","zh":"有些有翅类成员（如跳蚤）在进化中失去了翅膀，但分类上仍属于有翅类（Pterygota）。"}]}],"synonyms":["pterygotan","winged insect","member of Pterygota"],"phonetic":"/ˈtɛrɪˌɡoʊt/","extraExplanation":["词源提示：pterygote 来自希腊语词根 pteryx / pteryg-，意思是“翅膀”。在生物学语境里，它常用于分类学或进化讨论，因此多见于科普、论文或教材，而在日常英语中很少使用。","相关概念：与之相对的是 apterygote（无翅昆虫/原始无翅类），指从未拥有翅膀的昆虫谱系（注意与“后天失去翅膀”的类群区分）。"]}
{"word":"pterygotous","summary":{"en":"“Pterygotous” means “having wings,” used mostly in biological/scientific writing.","zh":"“pterygotous”意为“有翅的”，多用于生物学/科学写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having wings; winged (especially in scientific descriptions of animals, such as insects).","zh":"有翅的；具翼的（多用于科学/生物学描述，如昆虫）。"},"examples":[{"en":"Adult insects are pterygotous, while many larvae are wingless.","zh":"成虫阶段的昆虫通常是有翅的，而许多幼虫则无翅。"},{"en":"The paper compares pterygotous and apterous forms within the same species.","zh":"这篇论文比较了同一物种中有翅型与无翅型。"}]}],"synonyms":["winged","alate","pterygote"],"phonetic":"/tɛˈrɪɡətəs/","extraExplanation":["该词较少见，主要出现在昆虫学、动物学等学术语境中。词根来自希腊语：pteryx/pteryg- 表“翅膀”，-tous/-ous 表“具有……的”。常见对立词：apterous（无翅的）。"]}
{"word":"pterygotrabecular","summary":{"en":"A rare anatomical/embryological adjective meaning “related to the pterygoid region and the trabecular part of the skull base.”","zh":"一个少见的解剖/胚胎学形容词，表示“与翼突区以及颅底小梁部分相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pterygoid region (near the sphenoid bone) and the trabecular part of the embryonic skull base; used mainly in anatomy/embryology to describe structures or connections between these areas.","zh":"（解剖/胚胎学）与翼突区（蝶骨附近）和胚胎颅底的“小梁（trabecular）”部分相关的；常用来描述这两部分之间的结构或连接。"},"examples":[{"en":"The report described a pterygotrabecular connection seen in an embryologic diagram of the skull base.","zh":"报告描述了在颅底胚胎学示意图中看到的翼突-小梁连接。"},{"en":"Some texts mention a pterygotrabecular bar as a developmental element near the sphenoid region.","zh":"一些教材提到“翼突-小梁条（bar）”是蝶骨区域附近的发育结构。"}]}],"synonyms":["pterygoid-trabecular (hyphenated variant)"],"phonetic":"ˌtɛrɪɡoʊtrəˈbɛkjələr","extraExplanation":["这是一个非常专业的复合词：pterygo- 来自希腊语，意为“翼/翼状”（常见于 pterygoid：翼突）；trabecular 指“小梁、梁状结构”。合在一起通常用于胚胎学或颅颌面解剖学文献里，指与“翼突区域”和“胚胎颅底小梁部分”相关的结构或关系。","在临床普通英语中几乎不用；更多出现在学术文章、解剖图谱或发育学讨论中。阅读时可把它理解为“翼突区—小梁区相关的”。"]}
{"word":"pterygotus","summary":{"en":"Pterygotus: an extinct genus of large eurypterids, commonly called sea scorpions.","zh":"Pterygotus：一种已灭绝的海蝎类属，常被称为“海蝎/海蝎子”（sea scorpion）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large eurypterids (“sea scorpions”) that lived in ancient seas and rivers hundreds of millions of years ago","zh":"一种已灭绝的海蝎（广义：海蝎类/广翅鲎虫类）属，体型常较大，生活在数亿年前的海洋与河口等水域"},"examples":[{"en":"Pterygotus is often described as one of the larger “sea scorpions” in the fossil record.","zh":"在化石记录中，Pterygotus 常被描述为体型较大的“海蝎”之一。"},{"en":"Fossils of Pterygotus help scientists reconstruct ancient aquatic ecosystems.","zh":"Pterygotus 的化石有助于科学家重建古代水域生态系统。"}]}],"synonyms":["eurypterid","sea scorpion"],"phonetic":"/tɛˈrɪɡəˌtəs/","extraExplanation":["“Pterygotus”常见于古生物学与科普写作中，指一种已灭绝的海蝎类（eurypterids）。海蝎并不是真正的蝎子，而是与鲎、蛛形纲动物有亲缘关系的一类古代节肢动物。","词名源自希腊语词根：pteryg-（与“翅、翼”有关）+ -otus/ous（与“耳”有关），大致含义可理解为“翼状的耳/耳状结构”，一般被认为与其身体某些结构外形有关。"]}
{"word":"pteryla","summary":{"en":"A pteryla is a feather-growing tract on a bird’s skin.","zh":"pteryla 指鸟类皮肤上长羽毛的“羽区/羽毛生长带”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ornithology) A feather tract: a defined strip or patch of skin on a bird where feathers grow, separated from bare areas called apteria.","zh":"（鸟类学）羽区：鸟类皮肤上长羽毛的特定条带或区域，与无羽区（apteria）相隔。"},"examples":[{"en":"In many birds, the pterylae form clear lines across the body, with bare apteria between them.","zh":"在许多鸟类身上，羽区（pterylae）会在体表形成清晰的线条，中间夹着无羽区（apteria）。"},{"en":"Researchers mapped each pteryla to compare feather patterns among related species.","zh":"研究人员绘制每一条羽区的位置，用来比较近缘物种之间的羽毛分布模式。"}]}],"synonyms":["feather tract","pterylae (plural)"],"phonetic":"/ˈtɛrɪlə/","extraExplanation":["“pteryla”主要用于鸟类解剖与分类研究领域，日常英语中非常少见。","词源来自希腊语 pteron（“翅、羽”），因此常见于含 pter-/ptero- 的学术词（如 pterodactyl 翼手龙）。","相关对比概念：pterylae（有羽毛生长的“羽区”） vs. apteria（不长羽毛的“无羽区”）。"]}
{"word":"pterylae","summary":{"en":"Pterylae are the feather-growing tracts on a bird’s skin.","zh":"Pterylae 指鸟类皮肤上羽毛生长的“羽区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In birds) the feather tracts—specific lines or patches of skin where feathers grow, separated by areas with few or no feathers.","zh":"（鸟类）羽区；鸟体表上羽毛生长的条带或斑块区域，其间夹有少羽或无羽的皮肤区域。"},"examples":[{"en":"In many birds, the pterylae form clear patterns that help scientists describe feather arrangement.","zh":"在许多鸟类中，羽区会形成清晰的图案，帮助科学家描述羽毛的分布方式。"},{"en":"During dissection, students identified the pterylae and the bare areas between them.","zh":"在解剖课上，学生辨认出了羽区以及其间的裸露区域。"}]}],"synonyms":["feather tracts","pteryla (singular)","pterylosis (related term)"],"phonetic":"/ˈtɛrɪliː/","extraExplanation":["“pterylae”是复数形式，单数是“pteryla”。在鸟类学中常与“pterylosis（羽区分布/羽区格局）”一起出现，用来讨论羽毛在身体表面的排列与演化。","词源来自希腊语“pteron”（翅膀/羽毛）相关词根，因此多见于生物学、解剖学和分类学语境中，日常英语里很少使用。"]}
{"word":"pterylographic","summary":{"en":"A technical adjective meaning “about mapping or describing birds’ feather-tract patterns.”","zh":"一个技术性形容词，指“与鸟类羽毛分布（羽区）图谱的描绘或研究有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pterylography: the study or description/mapping of the feather-tract patterns (pterylae) on a bird’s body.","zh":"与羽区学/羽区图谱有关的；指研究或描述（绘制）鸟类身体上羽毛分布区（羽区，pterylae）模式的。"},"examples":[{"en":"The paper includes pterylographic diagrams of several seabird species.","zh":"这篇论文包含数种海鸟的羽区图示（羽区图谱）。"},{"en":"Pterylographic characters can help distinguish closely related bird species.","zh":"羽区图谱特征有助于区分亲缘关系很近的鸟类物种。"}]}],"synonyms":["pterylographical","ornithological (broader)","morphological (broader)"],"phonetic":"/ˌtɛr.ə.laɪˈɡræf.ɪk/","extraExplanation":["该词非常专业，常见于鸟类学（ornithology）与形态学（morphology）文献。词根 pterylo- 来自希腊语，和“羽毛/翅膀”相关；-graphic 表示“记录、描绘、图示”。因此 pterylographic 常用于“羽区图”“羽毛分布图”的研究语境中，而日常英语中几乎不用。"]}
{"word":"pterylographical","summary":{"en":"Pterylographical means “about mapping or describing a bird’s feather tracts.”","zh":"pterylographical 指“与描绘/记录鸟类羽毛分布（羽区）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to pterylography—the scientific description or mapping of feather tracts (pterylae) on birds.","zh":"与“翼羽区学/羽毛区图谱学”（pterylography）有关的；指对鸟类羽毛生长区域（羽区、羽束分布）的记录、描绘或研究。"},"examples":[{"en":"The paper includes pterylographical diagrams showing feather tracts on the owl’s body.","zh":"论文包含翼羽区学的图示，展示猫头鹰身体上的羽毛分布区域。"},{"en":"A pterylographical study can help compare closely related bird species.","zh":"翼羽区学研究有助于比较亲缘关系很近的鸟类物种。"}]}],"synonyms":["pterylographic","ornithological (broader)","anatomical (broader)"],"phonetic":"/ˌtɛr.əˌlaɪ.ɡræf.ɪ.kəl/","extraExplanation":["该词非常少见，多见于鸟类学（ornithology）或动物形态学文献。更常见的相关名词是 pterylography（翼羽区学/羽毛区图谱学），以及 pterylae（羽区，羽毛成片生长的区域）。","词根来源可理解为：pterylo-（与羽毛/翅相关）+ -graphical（描写、绘制的）。日常英语里几乎不会用到。"]}
{"word":"pterylography","summary":{"en":"Pterylography is the scientific study or mapping of how feathers are arranged on a bird’s body.","zh":"Pterylography 指对鸟类身体羽毛（羽区）分布方式的研究或描绘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or mapping of the arrangement of feathers (feather tracts) on birds’ bodies","zh":"（鸟类）羽毛区（羽区）分布的研究或描绘；羽区学"},"examples":[{"en":"Pterylography helps ornithologists compare feather tracts across different bird species.","zh":"羽区学帮助鸟类学家比较不同鸟种之间的羽毛分布区域。"},{"en":"The paper included a pterylography diagram showing where the feathers grow densely and where they are sparse.","zh":"论文中包含一张羽区学示意图，显示羽毛密集生长和稀疏分布的区域。"}]}],"synonyms":["pterylographical study","feather-tract mapping"],"phonetic":"/ˌtɛrɪˈlɑɡrəfi/","extraExplanation":["词源：pterylo- 来自希腊语 pterylon（“小羽毛/羽毛区”），-graphy 表示“描写、记录、绘图”。因此 pterylography 字面意思是“对羽毛区的记录/描绘”。","背景：鸟类的羽毛通常不是均匀覆盖全身，而是沿着特定“羽区”（pterylae）生长，中间夹着相对裸露或羽毛较少的“无羽区”（apteria）。羽区学常用于鸟类分类、形态比较，以及理解飞行与保温等功能。"]}
{"word":"pterylological","summary":{"en":"“Pterylological” means “about the scientific study of how feathers are arranged on birds.”","zh":"“pterylological”指“与研究鸟类羽毛（羽区）分布排列的学科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to pterylogy—the study of the arrangement of feathers (feather tracts) on birds.","zh":"与羽区学有关的；指研究鸟类羽毛（羽区/羽毛生长区）分布与排列的。"},"examples":[{"en":"The researcher wrote a pterylological description of the owl’s feather tracts.","zh":"研究者写了一份关于猫头鹰羽区分布的羽区学描述。"},{"en":"Pterylological data can help compare different bird species.","zh":"羽区学数据可以帮助比较不同的鸟类物种。"}]}],"synonyms":["pterylogical (rare variant)","related to pterylogy","feather-tract (descriptive)"],"phonetic":"/ˌtɛr.ə.ləˈlɑː.dʒɪ.kəl/","extraExplanation":["“pterylological”较罕见，更多时候会看到名词“pterylogy”（羽区学）或相关词“pterylography”（对羽区进行记录/描绘）。","词根提示：pterylo- 来自希腊语，和“羽毛/翅膀”相关；-logical 表示“……学的/与……研究相关的”。"]}
{"word":"pterylology","summary":{"en":"Pterylology is the study of how feathers are arranged and distributed on birds’ bodies.","zh":"pterylology 指研究鸟类羽毛（尤其羽区）排列与分布的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of the arrangement and distribution of feathers on a bird’s body (especially the feather tracts, called pterylae).","zh":"（鸟类学中）羽区学：研究鸟类身体上羽毛的排列与分布，尤其是羽区（pterylae）的科学。"},"examples":[{"en":"Pterylology helps ornithologists compare species by mapping their feather tracts.","zh":"羽区学能帮助鸟类学家通过绘制羽区来比较不同物种。"},{"en":"In a museum lab, she studied pterylology to understand how a bird’s plumage is organized.","zh":"在博物馆实验室里，她学习羽区学以了解鸟类羽毛覆盖的组织方式。"}]}],"synonyms":["pterylogy","pterylography"],"phonetic":"ˌtɛrɪˈlɑlədʒi","extraExplanation":["这是一个相当冷门的术语，多见于鸟类学/解剖学文献。词根来自希腊语：pteryl- 与“羽毛/羽翼”有关，-logy 表示“学科/研究”。","与之相关的词有 pterylogy（同义较常见）以及 pterylography（强调“记录/描绘羽区”的研究或方法）。"]}
{"word":"pterylosis","summary":{"en":"Pterylosis means the feather-tract pattern on a bird’s body.","zh":"pterylosis 指鸟类身体上羽区与无羽区的分布模式（羽毛生长的“地图”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) The pattern or arrangement of feather tracts (feathered areas) and bare areas on a bird’s skin.","zh":"（动物学）羽区：鸟类皮肤上羽毛生长的区域（羽区）与无羽区域的分布与排列模式。"},"examples":[{"en":"Different species can be identified partly by differences in their pterylosis.","zh":"不同物种有时可以通过羽区分布（pterylosis）的差异来辅助辨识。"},{"en":"Researchers documented the chick’s pterylosis as its feathers began to emerge.","zh":"研究人员在雏鸟羽毛开始长出时记录了它的羽区分布。"}]}],"synonyms":["feather-tract pattern","feather tract arrangement","pterylography (related field/term)"],"phonetic":"/ˌtɛrəˈlaɪsɪs/","extraExplanation":["这是一个较为专业的鸟类学术语，常与“pterylae（羽区/羽毛生长带）”对照使用：pterylosis 指整体的“分布模式”，而 pterylae 指具体的“羽区带”。","词源来自希腊语：pteron（翅膀/羽毛）+ -osis（状态/过程），可理解为“羽毛分布的状态”。在鸟类分类与比较解剖中，羽区分布常被用来描述不同类群的皮肤与羽毛结构差异。"]}
{"word":"pteryrygia","summary":{"en":"Pterygia are wing-shaped tissue growths, most commonly on the eye (plural of pterygium).","zh":"Pterygia 指翼状胬肉（pterygium）的复数，常见于眼部的翼状组织增生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of pterygium: a small, wing-shaped growth of tissue, especially on the eye (from the white part toward the cornea).","zh":"pterygium（翼状胬肉）的复数：一种小的“翼状”组织增生，最常见于眼部，从结膜（眼白）向角膜生长。"},"examples":[{"en":"The doctor said the redness was caused by pterygia and recommended sunglasses for UV protection.","zh":"医生说发红是翼状胬肉（pterygia）引起的，并建议戴太阳镜防紫外线。"},{"en":"People who work outdoors sometimes develop pterygia over time.","zh":"长期户外工作的人有时会逐渐出现翼状胬肉（pterygia）。"}]}],"synonyms":["pterygium (singular)","eye growth (general)","conjunctival growth (general)"],"phonetic":"/tərˈɪdʒiə/","extraExplanation":["你输入的 **pteryrygia** 很可能是拼写误差；医学上更常见的是 **pterygia**（复数）/ **pterygium**（单数）。","词源来自希腊语 **pteryx**（“翅膀”），因为这种增生外形像一片小翅膀。","这是偏医学/眼科用词，日常英语里不常用；一般会直接说 “a pterygium (growth on the eye)”。"]}
{"word":"ptg","summary":{"en":"PTG is an initialism most commonly meaning either “Parent-Teacher Group” (school organization) or “post-traumatic growth” (a psychology term), depending on context.","zh":"PTG 是缩写，常见含义包括“家长教师组织”（学校团体）或“创伤后成长”（心理学术语），需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Parent-Teacher Group: a school organization made up of parents/guardians and teachers that supports school activities and fundraising (similar to PTO/PTA).","zh":"家长教师组织：由家长/监护人与教师组成的学校团体，常用于支持学校活动与募款（类似 PTO/PTA）。"},"examples":[{"en":"The PTG is organizing a bake sale to raise money for new library books.","zh":"家长教师组织（PTG）正在举办义卖，为图书馆新书募款。"},{"en":"If you want to volunteer, you can sign up through the PTG.","zh":"如果你想当志工，可以通过 PTG 报名。"}]},{"partOfSpeech":"other","definition":{"en":"Post-traumatic growth: positive psychological change that can happen after a person goes through a difficult or traumatic event.","zh":"创伤后成长：人在经历重大困难或创伤事件后，可能出现的积极心理改变。"},"examples":[{"en":"Some people describe PTG as finding new meaning in life after a crisis.","zh":"有些人把 PTG 形容为在危机之后找到新的生命意义。"},{"en":"Therapy helped her understand both trauma and PTG.","zh":"治疗帮助她理解创伤与创伤后成长（PTG）两者。"}]}],"synonyms":["PTO","PTA","parent-teacher organization","post-traumatic growth"],"phonetic":"/pi ti dʒi/","extraExplanation":["“PTG”多为缩写，具体含义强烈依赖使用场景（学校通知、心理学文章、医疗文件、游戏/网络社群等）。如果你告诉我你在哪里看到它（例如邮件、论文、聊天、游戏界面），我可以锁定最准确的解释。"]}
{"word":"ptilichthyidae","summary":{"en":"Ptilichthyidae is the scientific family name for quillfish-related marine fishes.","zh":"Ptilichthyidae 是与鳍毛鱼（quillfish）相关的一类海水鱼的科级学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name for the quillfish group of marine fishes (e.g., the genus *Ptilichthys*), found in the North Pacific.","zh":"（生物分类）鳍毛鱼科／羽鳍鱼科：一类海水鱼的科级分类名称（例如鳍毛鱼属 *Ptilichthys*），主要分布于北太平洋。"},"examples":[{"en":"The quillfish belongs to the family Ptilichthyidae.","zh":"鳍毛鱼（quillfish）属于鳍毛鱼科（Ptilichthyidae）。"},{"en":"Researchers recorded Ptilichthyidae in rocky coastal habitats of the North Pacific.","zh":"研究人员在北太平洋的岩礁海岸栖息地记录到了鳍毛鱼科（Ptilichthyidae）的鱼类。"}]}],"synonyms":["Ptilichthyids","quillfish family"],"phonetic":"/ˌtɪlɪkˈθaɪ.əˌdiː/","extraExplanation":["这是拉丁化的生物学分类名称，结尾“-idae”表示“科”（family）。","词源可拆解理解：ptil-（源自希腊语，意为“羽毛/羽状”）+ ichthys（希腊语“鱼”）+ -idae（科名后缀）。这种构词常见于动物分类学。","在英文写作中它通常以斜体属名+正体科名的形式出现（如 *Ptilichthys* 属于 Ptilichthyidae），首字母一般大写。"]}
{"word":"ptiliidae","summary":{"en":"Ptiliidae: a family of extremely tiny beetles called featherwing beetles.","zh":"Ptiliidae：一种体型极小、常称羽翅甲虫（羽翅甲虫科）的甲虫科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extremely small beetles, often called featherwing beetles, known for having very narrow hind wings fringed with long hairs","zh":"一种体型极小的甲虫科，常称“羽翅甲虫科”（featherwing beetles），其后翅很狭窄，边缘有长毛状缘毛"},"examples":[{"en":"Ptiliidae are among the smallest free-living insects in the world.","zh":"羽翅甲虫科（Ptiliidae）是世界上最小的自由生活昆虫之一。"},{"en":"Under a microscope, a Ptiliidae beetle’s fringed wings look like tiny feathers.","zh":"在显微镜下，羽翅甲虫科甲虫的缘毛翅看起来像微小的羽毛。"}]}],"synonyms":["featherwing beetles"],"phonetic":"/ˌtɪliˈaɪdi/","extraExplanation":["“Ptiliidae”是昆虫分类学里的拉丁化科名，日常英语里不常用；写作或口语中更常见的通俗名称是“featherwing beetles”（羽翅甲虫）。","科名常以“-idae”结尾，表示“某某科”（family）；读写时可把它理解为“Ptilium（某属名）+ -idae（某科）”。","这类甲虫常见于腐殖质、落叶层、真菌等潮湿环境中，以孢子、微生物或腐屑为食。"]}
{"word":"ptilimnium","summary":{"en":"Ptilimnium is a botanical genus name (a scientific Latin name) in the carrot family (Apiaceae).","zh":"Ptilimnium 是伞形科（芹科）植物的一个属名（植物学拉丁学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the carrot family (Apiaceae), used as a scientific (Latin) name in botany","zh":"（植物学拉丁学名）伞形科（芹科，Apiaceae）的一类开花植物属名"},"examples":[{"en":"Ptilimnium is a genus in the Apiaceae family.","zh":"Ptilimnium 是伞形科（芹科）中的一个植物属。"},{"en":"The herbarium label lists the specimen as Ptilimnium.","zh":"标本馆标签把该植物标注为 Ptilimnium。"}]}],"synonyms":["genus name","botanical Latin name","scientific name"],"phonetic":"/ˌtɪlˈɪmniəm/","extraExplanation":["这个词属于“学名/拉丁名”，常见于植物志、标本标签、学术论文中；在日常英语里几乎不会使用。","学名通常用斜体书写，属名首字母大写：Ptilimnium；在同一段落中再次出现时，有时会缩写为 P.（如 P. capillaceum）。","如果你是在书上或数据库里看到的拼写是“ptilimnium”（全小写），一般只是排版或输入习惯；标准写法多为 Ptilimnium。"]}
{"word":"ptilinal","summary":{"en":"An entomology term meaning “related to the ptilinum or the ptilinal suture” on certain flies.","zh":"昆虫学用语：指与某些苍蝇头部的额囊（ptilinum）或额囊缝（ptilinal suture）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ptilinum (an inflatable sac on the head of some flies) or to the ptilinal suture (the seam left on the fly’s head after the ptilinum is used).","zh":"与（某些苍蝇头部的）额囊/翻出囊（ptilinum，可充气的囊状结构）有关的；或与额囊缝（ptilinal suture，使用额囊后在头部留下的缝线/裂缝痕迹）有关的。"},"examples":[{"en":"In many higher flies, the ptilinal suture is visible as a curved line on the face.","zh":"在许多较高级的双翅目昆虫中，额囊缝常可见为脸部的一条弯曲线。"},{"en":"The ptilinal sac helps the adult fly break out of the puparium during emergence.","zh":"额囊在羽化时帮助成虫苍蝇顶破蛹壳（蛹壳化的外壳）出来。"}]}],"synonyms":["ptilinum-related","(of flies) cyclorrhaphous (related term)"],"phonetic":"/ˈtɪlɪnəl/","extraExplanation":["“ptilinal”是昆虫学（尤其是双翅目 Diptera）里的专业形容词，常见于搭配：ptilinal suture（额囊缝）。它来源于“ptilinum”（额囊/翻出囊），这是许多“有额囊缝的苍蝇类”（Cyclorrhapha）成虫羽化时会外翻充气、用来撑开蛹壳的结构；完成羽化后额囊缩回，头部留下环状或弧状的缝痕，即“ptilinal suture”。","发音上，英语里以希腊语源的词首“pt-”常把 p 弱化不发音（类似 pterodactyl），所以常读作以 /t/ 开头。"]}
{"word":"ptilinum","summary":{"en":"Ptilinum is a scientific genus name for certain feather mosses.","zh":"Ptilinum 是某些羽藓类苔藓的属名（科学拉丁名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of pleurocarpous mosses (feather mosses), best known for the species *Ptilinum crista-castrensis* (“knight’s plume” or “ostrich-plume feather moss”).","zh":"一种羽藓类（侧蒴藓）的藓类属名（羽藓属），最著名的物种是 *Ptilinum crista-castrensis*，常被称为“骑士羽”“鸵羽藓/羽状藓”。"},"examples":[{"en":"In the shaded conifer forest, **Ptilinum** often forms soft, feathery carpets on the ground.","zh":"在阴湿的针叶林里，**Ptilinum（羽藓属）**常在地面形成柔软、羽毛状的苔藓地毯。"},{"en":"The field guide lists *Ptilinum crista-castrensis* as a common feather moss in boreal regions.","zh":"野外图鉴把 *Ptilinum crista-castrensis* 列为北方针叶林地区常见的羽藓之一。"}]}],"synonyms":["feather moss (general term)","*Ptilinum* (genus)","*Ptilinum crista-castrensis* (species)"],"phonetic":"/ˌtɪlˈaɪnəm/","extraExplanation":["这是一个较偏专业的拉丁学名（属名），多见于植物学、苔藓学或自然观察/野外图鉴中，日常英语里几乎不会单独使用。","词根常与希腊语 *ptilon*（“羽毛”）相关，因此这类苔藓的外形常被描述为“feathery（羽毛状的）”。"]}
{"word":"ptilo","summary":{"en":"ptilo- is a scientific word part meaning “feather/feather-like.”","zh":"ptilo- 是表示“羽毛/羽状”的科学构词成分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific combining form meaning “feather” or “plume,” used in biology and medicine (often in words about feathers or feather-like structures).","zh":"（科学）构词成分，表示“羽毛 / 羽状物”，常用于生物学、医学等词汇中（与羽毛或羽毛状结构有关）。"},"examples":[{"en":"In some insects, a ptilo- structure may refer to something feather-like under a microscope.","zh":"在一些昆虫研究中，ptilo- 相关结构可能指显微镜下“羽毛状”的形态。"},{"en":"You may see ptilo- in technical terms like ptilosis or ptiloerection.","zh":"你可能在一些专业词里见到 ptilo-，例如 ptilosis 或 ptiloerection。"}]}],"synonyms":["plum(o)-","pter(o)- (related: “wing,” not “feather”)"],"phonetic":"/ˈtaɪloʊ/","extraExplanation":["ptilo- 来自希腊语 ptilon（“羽毛”）。它通常不是一个可以单独使用的英语单词，而是出现在复合词里。","拼写上常见以 pt- 开头的希腊来源词：在现代英语里，词首的 p 通常不发音或非常弱；实际读音更接近 “TY-loh”。","相关词举例：ptilosis（眼睑异常长睫毛/多睫等医学术语，具体含义因语境而定）、ptiloerection（羽毛竖起；类似于哺乳动物的起鸡皮疙瘩）。"]}
{"word":"ptilocercus","summary":{"en":"Ptilocercus is the scientific genus name for the pen-tailed treeshrew.","zh":"Ptilocercus 是笔尾/羽尾鼩鼱的学名属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the pen-tailed treeshrew, a small Southeast Asian mammal.","zh":"（生物）“羽尾鼩鼱属”的学名属名，指东南亚的一类小型哺乳动物（代表物种为笔尾/羽尾鼩鼱）。"},"examples":[{"en":"Ptilocercus lowii is the best-known species in the genus Ptilocercus.","zh":"Ptilocercus lowii 是羽尾鼩鼱属中最知名的物种。"},{"en":"Researchers studied Ptilocercus to understand early mammal evolution.","zh":"研究人员研究羽尾鼩鼱属，以了解早期哺乳动物的演化。"}]}],"synonyms":["pen-tailed treeshrew (common name)"],"phonetic":"/ˌtɪloʊˈsɝkəs/","extraExplanation":["“Ptilocercus”是拉丁化的科学命名，常见于动物学论文与分类目录中；日常英语里更常用的名称是“pen-tailed treeshrew（笔尾/羽尾鼩鼱）”。","这个属最常被提到的特点之一是尾巴末端有羽毛状的簇毛，因此中文与英文俗名都围绕“尾巴”的特征来命名。"]}
{"word":"ptilonorhynchidae","summary":{"en":"Ptilonorhynchidae = the bowerbird family (a bird family known for decorative courtship bowers).","zh":"Ptilonorhynchidae＝园丁鸟科（以雄鸟装饰性求偶亭而著名的鸟类科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds known as the bowerbirds, found mainly in Australia and New Guinea; many males build decorative “bowers” to attract mates.","zh":"一种鸟类科名，称为园丁鸟科（园丁鸟/造园鸟），主要分布于澳大利亚和新几内亚；许多雄鸟会建造并装饰“求偶亭（bower）”来吸引配偶。"},"examples":[{"en":"Ptilonorhynchidae are famous for the males’ bower-building behavior.","zh":"园丁鸟科以雄鸟的“筑求偶亭”行为而闻名。"},{"en":"Researchers studied courtship displays in the family Ptilonorhynchidae.","zh":"研究人员研究了园丁鸟科的求偶展示行为。"}]}],"synonyms":["bowerbird family","bowerbirds"],"phonetic":"/ˌtaɪləˌnɔrɪŋˈkɪdi/","extraExplanation":["这是一个“学名/分类学名称”（科名），常见于生物学、鸟类学文章中；日常英语里更常说 bowerbirds（园丁鸟/造园鸟）。","词源上可拆为希腊语/拉丁化构词：ptilo-（羽毛）+ rhynch-（喙）+ -idae（动物分类学中表示“科”的后缀）。","园丁鸟的“bower（求偶亭）”不是巢（nest）：主要用于展示与求偶，真正的巢通常在别处用于产卵育雏。"]}
{"word":"ptilonorhynchinae","summary":{"en":"Ptilonorhynchinae is the scientific name of a bowerbird subfamily, used mainly in ornithology and taxonomy.","zh":"Ptilonorhynchinae 是园丁鸟的一个“亚科”学名，主要用于鸟类学与生物分类学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily within the bowerbird family (Ptilonorhynchidae), including many of the “true bowerbirds” known for building decorative bowers during courtship","zh":"园丁鸟科（Ptilonorhynchidae）中的一个亚科分类单元，包含许多以筑造并装饰求偶“庭院/拱棚”（bower）而闻名的典型园丁鸟"},"examples":[{"en":"Some field guides group several bowerbird species under the subfamily Ptilonorhynchinae.","zh":"一些野外鸟类图鉴会把若干园丁鸟物种归入园丁鸟亚科 Ptilonorhynchinae。"},{"en":"Researchers compared display behavior across Ptilonorhynchinae to understand how bower-building evolved.","zh":"研究人员比较了 Ptilonorhynchinae 各成员的展示行为，以理解筑庭求偶如何演化。"}]}],"synonyms":["bowerbird subfamily","Ptilonorhynchidae (family name; related term)"],"phonetic":"/ˌtɪlənoʊrɪŋˈkaɪni/","extraExplanation":["这是一个拉丁化的生物分类名称（亚科名），多用于鸟类学、生态学与系统分类学的学术写作中，日常英语里很少出现。","词源可拆解理解：ptilon-（源自希腊语，意为“羽毛”）+ rhynch-（源自希腊语，意为“喙/嘴”）+ -inae（动物分类学中表示“亚科”的后缀）。","相关上位分类常见写法：Family Ptilonorhynchidae（园丁鸟科）→ Subfamily Ptilonorhynchinae（园丁鸟亚科）→ Genus/Species（属/种）。"]}
{"word":"ptilopaedes","summary":{"en":"Ptilopaedes is a rare scientific genus name; its exact reference depends on context.","zh":"Ptilopaedes 是较少见的科学属名，具体所指需结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ptilopaedes: a rare scientific (Latinized) genus name used in biological taxonomy; the exact organism it refers to depends on the specific field/source using the name.","zh":"Ptilopaedes：一种较少见的拉丁化生物学属名（分类学用语）；具体指哪一类生物取决于使用该名称的学科与来源。"},"examples":[{"en":"In the paper, Ptilopaedes is listed as a genus in the classification table.","zh":"在论文中，Ptilopaedes 被列为分类表中的一个属名。"},{"en":"Because Ptilopaedes is a taxonomic name, it is usually capitalized and italicized.","zh":"因为 Ptilopaedes 是分类学名称，它通常首字母大写并用斜体。"}]}],"phonetic":"/ˌtaɪləˈpiːdiːz/","extraExplanation":["从构词看，ptilo- 常见于希腊语词根，和“羽毛/纤毛/翅状结构”有关（如 ptilopsis、ptilinum 等），但仅凭词形无法可靠确定 Ptilopaedes 对应的具体生物类群。","学术写作里，属名（genus）通常写作斜体，首字母大写；种名（species epithet）通常小写并与属名一起斜体（如 Genus species）。","如果你能提供看到该词的上下文（例如出自哪篇文章、哪本书、或它后面是否跟着一个小写的种加词），我可以更准确地说明它指的是什么以及常见译名。"]}
{"word":"ptilopaedic","summary":{"en":"“Ptilopaedic” is not recognized as a standard English word; it’s likely a misspelling (often of “orthopaedic/orthopedic”).","zh":"“ptilopaedic”不是标准英语词；多半是拼写错误（常见是把“orthopaedic/orthopedic”拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a very rare, non-dictionary form. In most contexts, the intended word may be “orthopaedic/orthopedic” (relating to bones, joints, and muscles) or “paediatric/pediatric” (relating to children’s medicine).","zh":"不是标准英语词；很可能是拼写错误或极少见、未收录的形式。多数语境下，可能想写的是“orthopaedic/orthopedic（骨科的）”或“paediatric/pediatric（儿科的）”。"},"examples":[{"en":"I couldn’t find “ptilopaedic” in a dictionary—did you mean “orthopaedic”?","zh":"我在词典里找不到“ptilopaedic”——你是不是想写“orthopaedic（骨科的）”？"},{"en":"She booked an orthopedic appointment for her knee pain.","zh":"她因为膝盖疼预约了骨科门诊。"}]}],"phonetic":"/ˌtaɪloʊˈpiːdɪk/","extraExplanation":["“ptilopaedic”看起来像把“orthopaedic/orthopedic（英式/美式拼法）”误拼了。英式常见 -ae-（orthopaedic），美式通常简化为 -e-（orthopedic）。","如果你能提供一句包含该词的原句或告诉我你想表达的领域（医学/教育/其他），我可以更准确判断你要找的正确单词。"]}
{"word":"ptilosis","summary":{"en":"A medical term for loss of eyelashes or eyebrows.","zh":"表示睫毛或眉毛脱落的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Loss of eyelashes or eyebrows; a kind of hair loss affecting the eyelids/eyebrow area.","zh":"（医学）睫毛或眉毛脱落；发生在眼睑/眉毛部位的一种脱发。"},"examples":[{"en":"The dermatologist diagnosed her with ptilosis after noticing missing eyelashes on both lids.","zh":"皮肤科医生注意到她上下眼睑都有睫毛缺失后，诊断为睫毛脱落（ptilosis）。"},{"en":"Ptilosis can be caused by conditions like blepharitis or autoimmune disease.","zh":"睫毛脱落（ptilosis）可能由睑缘炎或自身免疫性疾病等引起。"}]}],"synonyms":["madarosis (often used for eyebrow/eyelash loss)","loss of eyelashes","eyelash loss","eyebrow loss"],"phonetic":"/taɪˈloʊsɪs/","extraExplanation":["该词主要用于医学语境，日常英语中很少使用。更常见的说法是 “loss of eyelashes/eyebrows（睫毛/眉毛脱落）”。","词源来自希腊语：ptilōsis（羽毛/毛发脱落），与 ptilon（羽毛）相关。","临床上常需要进一步查找原因（例如炎症、感染、甲状腺问题、斑秃、药物或拔毛习惯等），因此常与眼科或皮肤科评估一起出现。"]}
{"word":"ptilota","summary":{"en":"Ptilota is a scientific genus name for certain red seaweeds (red algae).","zh":"Ptilota 是某些红藻（海藻）的属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for certain red algae (seaweeds), found in cold or temperate oceans.","zh":"（生物分类）海藻的一属名：指某些红藻（海藻），常见于寒冷或温带海域。"},"examples":[{"en":"Ptilota is a genus of red algae often found along rocky coasts in colder waters.","zh":"Ptilota 是一种红藻属，常见于较冷海域的岩石海岸。"},{"en":"In the field guide, Ptilota was listed under red algae (Rhodophyta).","zh":"在野外图鉴中，Ptilota 被列在红藻门（Rhodophyta）之下。"}]}],"synonyms":["(no common everyday synonyms; related: red algae, Rhodophyta, seaweed)"],"phonetic":"/taɪˈloʊtə/","extraExplanation":["“Ptilota”是拉丁化的学名（属名），日常英语里不常用，多出现在海洋生物学、藻类学、自然观察图鉴或学术文章中。","词源与希腊语有关：ptilon（羽毛）一类的词根常用来表示“羽状/羽毛状”的形态特征；这类属名往往暗示藻体外形可能呈羽状分枝。","在正式写法中，属名首字母要大写并用斜体：Ptilota；如果你告诉我你看到它的具体句子/上下文，我可以帮你判断它指的是哪一类海藻或是哪篇资料里的用法。"]}
{"word":"ptinid","summary":{"en":"“ptinid” is not a recognized English word; it’s likely a misspelling.","zh":"“ptinid”不是可识别的英文单词，更可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or random letters, so it doesn’t have an accepted dictionary meaning.","zh":"不是标准英语单词。更可能是拼写错误或随机字母，因此没有公认的词典释义。"},"examples":[{"en":"I can’t find “ptinid” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“ptinid”——你是不是想写别的词？"},{"en":"If you tell me the sentence, I can guess the correct spelling.","zh":"如果你把句子发我，我可以帮你猜出正确拼写。"}]}],"extraExplanation":["“ptinid”看起来不像常见英文单词。你可以：\n1）检查是否漏打/多打了字母；\n2）把它出现的完整句子贴出来；\n3）告诉我你想表达的中文意思。\n我也可以根据上下文帮你推测可能的目标词（例如与“printed / pinned / pointed / timid / pint”等相近的拼写）。"]}
{"word":"ptinidae","summary":{"en":"Ptinidae is the beetle family that includes spider beetles and deathwatch beetles, some of which are pests of stored products or wood.","zh":"Ptinidae 指皮蠹甲科：包含蜘蛛甲虫、敲木甲虫等的一科甲虫，其中一些会危害储粮或蛀食木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small beetles that includes spider beetles and deathwatch beetles; many species can damage stored food (like grains) or wood.","zh":"皮蠹甲科（Ptinidae）：一类小型甲虫的科，包括蜘蛛甲虫、敲木甲虫等；不少种类会危害储藏食品（如谷物）或蛀食木材。"},"examples":[{"en":"Some Ptinidae species are common pests in stored flour and cereals.","zh":"某些皮蠹甲科昆虫常见于面粉和谷物等储藏食品害虫中。"},{"en":"The deathwatch beetle, a member of Ptinidae, can damage old wooden furniture.","zh":"敲木甲虫属于皮蠹甲科，可能会损害老旧木家具。"}]}],"synonyms":["spider beetles (group)","deathwatch beetles (group)","beetle family (taxonomic term)"],"phonetic":"/ˈtɪnɪdi/","extraExplanation":["“Ptinidae”是昆虫分类学中的“科”名，常见于学术文章、博物馆标本标签、害虫鉴定报告中，日常英语里更常说具体的昆虫名称（如 spider beetle、deathwatch beetle）。","名称来自属名 Ptinus 的拉丁化形式；在较新的分类系统中，部分传统上分开的类群被重新归并到 Ptinidae，因此不同资料来源可能在范围上略有差异。"]}
{"word":"ptinoid","summary":{"en":"Ptinoid means “birdlike” and is a rare, mostly scientific term.","zh":"ptinoid 意为“似鸟的”，是较罕见、偏科学语境的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Birdlike; relating to birds, especially in form or features.","zh":"（罕用）似鸟的；与鸟类有关的，尤指外形或特征像鸟。"},"examples":[{"en":"The fossil shows a ptinoid skull shape, suggesting a connection to early birds.","zh":"这块化石呈现出似鸟的头骨形态，暗示它与早期鸟类可能有关联。"},{"en":"In older scientific writing, some reptiles were described as having ptinoid traits.","zh":"在较早的科学著作中，一些爬行动物被描述为具有似鸟的特征。"}]}],"synonyms":["birdlike","avian","ornithoid"],"phonetic":"/ˈtaɪnɔɪd/","extraExplanation":["该词非常少见，多见于较早期或较专业的生物学/古生物学语境。常见的现代替代表达包括：birdlike（似鸟的）、avian（鸟类的）、ornithoid（似鸟的，亦较学术）。","词源上可理解为来自希腊语词根 ptin-/pten-（与“鸟、羽翼”相关）+ -oid（“……样的/类似……的”）。"]}
{"word":"ptinus","summary":{"en":"Ptinus is a scientific genus name for spider beetles; some species are pantry or museum pests.","zh":"Ptinus 是蛛甲虫的一个属名；部分物种可能成为食品储藏或博物馆藏品的害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small beetles (family Ptinidae), often called spider beetles; some species can be household or stored‑product pests.","zh":"一种小型甲虫的属名（蛛甲科 Ptinidae），常称“蛛甲虫”；其中一些物种会成为家庭或储藏食品害虫。"},"examples":[{"en":"The museum sealed the storage boxes after finding Ptinus beetles near the textiles.","zh":"博物馆在纺织品附近发现了 Ptinus 蛛甲虫后，把储藏箱密封起来。"},{"en":"Some Ptinus species feed on dried foods and can infest pantries.","zh":"某些 Ptinus 物种以干燥食品为食，可能侵扰食品储藏柜。"}]}],"synonyms":["spider beetle","ptinid (beetle)"],"phonetic":"/ˈtaɪnəs/","extraExplanation":["“Ptinus”是拉丁化的学名（属名），常见于生物学/昆虫学文本中；在日常英语里更常说“spider beetle（蛛甲虫）”或具体到某个物种名（例如以属名+种加词的二名法出现）。","写法提示：属名首字母大写并斜体（*Ptinus*）；复数在英语中常写作“Ptinus beetles”或用更高阶分类名“ptinids（蛛甲科甲虫）”。"]}
{"word":"ptisan","summary":{"en":"A ptisan is a herbal infusion—an “herbal tea” made without real tea leaves.","zh":"ptisan 指花草浸泡饮（草本茶），通常不含真正的茶叶与咖啡因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a herbal infusion (a caffeine-free drink) made by steeping herbs, flowers, or fruit in hot water; often called an “herbal tea”","zh":"花草浸泡饮（通常不含咖啡因）；用热水浸泡草药、花或水果制成，常被称为“花草茶/草本茶”"},"examples":[{"en":"After dinner, she drank a chamomile ptisan to help her relax.","zh":"晚饭后，她喝了一杯洋甘菊花草茶来放松。"},{"en":"The café offers ptisans like peppermint, hibiscus, and ginger.","zh":"这家咖啡馆提供薄荷、洛神花和姜等花草浸泡饮。"}]}],"synonyms":["ptisane","herbal tea","herbal infusion","tisane"],"phonetic":"/pəˈtiːzən/","extraExplanation":["“ptisan”较少见，更常见的拼写是“ptisane”（英式/法式用法更常见）。在日常英语里，人们通常直接说“herbal tea”，但严格来说它不含茶叶（不是Camellia sinensis），所以更准确的说法是“herbal infusion/ptisane”。","词源可追溯到法语/拉丁语，最早与用来缓解不适的“大麦水/药用浸泡饮”有关；后来词义扩展到各种草本浸泡饮。"]}
{"word":"ptisans","summary":{"en":"Partisan means a strong supporter of one side (often political), or something biased toward one side.","zh":"partisan 指（常见于政治）坚定支持某一方的人，也可形容“有党派倾向、偏向一方的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong supporter of a person, group, or cause (often in politics)","zh":"（常指政治上的）坚定支持者；党派拥护者"},"examples":[{"en":"In the election, both parties tried to energize their partisans.","zh":"在选举中，两党都试图鼓舞各自的坚定支持者。"},{"en":"She remained a partisan of the reform movement even when it became unpopular.","zh":"即使改革运动变得不受欢迎，她仍然是其坚定支持者。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing strong support for one side, especially in a political conflict","zh":"（尤指政治冲突中）偏袒一方的；党派性的"},"examples":[{"en":"The news report sounded partisan rather than neutral.","zh":"这篇新闻报道听起来更像是带有党派倾向，而不是中立的。"},{"en":"Try to avoid partisan language when discussing sensitive issues at work.","zh":"在工作中讨论敏感议题时尽量避免带有党派倾向的措辞。"}]}],"synonyms":["supporter","advocate","follower","ally","biased","one-sided"],"phonetic":"/ˌpɑr.təˈzæn/","extraExplanation":["你输入的“ptisans”看起来像拼写错误；最可能是 **partisans**（partisan 的复数）。另一个常见相近词是 **artisans**（工匠），但意思完全不同：artisan 指“手工艺人/工匠”，partisan 指“党派支持者/偏袒一方的人”。","partisan 常用于政治语境，也可更广泛指在争议中“站队”的人或带有明显立场的表达。","发音重音在最后一节：par-ti-SAN（/ˌpɑr.təˈzæn/）。"]}
{"word":"PTO","summary":{"en":"PTO most commonly means “paid time off” from work; it can also mean a school Parent-Teacher Organization or a machine’s power take-off.","zh":"PTO最常指“带薪休假”；也可指学校的家长教师组织，或机械上的动力输出装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"paid time off; time you are allowed to be away from work (for vacation, illness, personal reasons) while still being paid","zh":"带薪休假；指员工因度假、生病或个人事务请假，但仍照常领薪的时间"},"examples":[{"en":"I’m taking PTO next Friday to visit my family.","zh":"我下周五要请带薪假去看家人。"},{"en":"Check how much PTO you have left before you book the trip.","zh":"订旅行前先查一下你还剩多少带薪假。"},{"en":"Some companies let employees use PTO for sick days and vacation days.","zh":"有些公司允许员工用带薪假同时覆盖病假和年假。"}]},{"partOfSpeech":"n.","definition":{"en":"Parent-Teacher Organization; a school group that supports students and school activities","zh":"家长教师组织；在学校里由家长与教师组成、支持学生与学校活动的团体"},"examples":[{"en":"The PTO is raising money for new library books.","zh":"家长教师组织正在为图书馆新书筹款。"},{"en":"She volunteered to help at the PTO meeting.","zh":"她自愿去家长教师组织的会议帮忙。"}]},{"partOfSpeech":"n.","definition":{"en":"power take-off; a device on a tractor or truck that transfers engine power to another machine (like a mower or pump)","zh":"动力输出装置；常见于拖拉机等，用来把发动机动力传给割草机、泵等外接设备"},"examples":[{"en":"Turn off the engine before connecting the PTO shaft.","zh":"连接动力输出轴之前先关闭发动机。"},{"en":"The mower runs through the tractor’s PTO.","zh":"割草机通过拖拉机的动力输出装置运转。"}]}],"synonyms":["paid leave","vacation time (for the paid-leave meaning)","leave time"],"phonetic":"/ˌpiː tiː ˈoʊ/","extraExplanation":["在职场英语里，PTO最常指“Paid Time Off（带薪休假）”。不同公司制度不一样：有的把年假、病假、事假合并成一桶PTO；也有的分开计算。常见搭配有：request PTO（申请带薪假）、use PTO（使用带薪假）、PTO balance（剩余带薪假额度）。","在美国学校语境里，PTO常与PTA并列：PTA（Parent-Teacher Association）通常是更正式、可加入全国组织的协会；PTO一般更独立、以本校为单位，具体规则因学校而异。"]}
{"word":"pto","summary":{"en":"PTO most commonly means “paid time off” in the workplace, but it can also mean “power take-off,” “please turn over,” or “parent-teacher organization,” depending on context.","zh":"PTO最常见指职场中的“带薪休假”，也可能指“动力输出装置/轴”“请翻页（背面）”或“家长教师组织”，需看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"paid time off (time away from work that is paid, often covering vacation, sick days, and personal days)","zh":"带薪休假/带薪休假时间（员工请假但仍领取工资，常把年假、病假、事假等合并计算）"},"examples":[{"en":"New employees get 10 days of PTO per year.","zh":"新员工每年有10天PTO（带薪休假）。"},{"en":"I’m taking PTO on Friday to go to the doctor.","zh":"我周五要请PTO去看医生。"},{"en":"How much PTO do I have left?","zh":"我还剩多少PTO？"}]},{"partOfSpeech":"n.","definition":{"en":"power take-off (a device on a tractor or truck that sends engine power to another machine, like a mower or pump)","zh":"动力输出轴/动力输出装置（拖拉机或卡车把发动机动力传给割草机、泵等设备的装置）"},"examples":[{"en":"Turn off the engine before you connect the PTO.","zh":"连接PTO之前先把发动机关掉。"},{"en":"The mower runs through the tractor’s PTO.","zh":"割草机通过拖拉机的PTO运转。"}]},{"partOfSpeech":"other","definition":{"en":"Please turn over (used in writing at the bottom of a page to tell the reader to look at the other side)","zh":"请翻页/请翻面（写在纸张底部，提示读者看背面）"},"examples":[{"en":"Read the instructions—PTO for the last step.","zh":"请阅读说明——最后一步在背面（PTO）。"}]},{"partOfSpeech":"n.","definition":{"en":"Parent-Teacher Organization (a school group of parents and teachers that supports school activities and fundraising)","zh":"家长教师组织（由家长和教师组成的学校组织，用于支持活动与筹款）"},"examples":[{"en":"The PTO is raising money for new library books.","zh":"家长教师组织正在为新图书筹款。"},{"en":"She volunteered at the PTO meeting.","zh":"她在家长教师组织的会议上做志愿者。"}]}],"synonyms":["paid leave","paid vacation time","leave time","time off","vacation days"],"phonetic":"/ˌpiːtiːˈoʊ/","extraExplanation":["在职场里，PTO最常见，通常表示“带薪休假总额度”，把vacation（年假）、sick leave（病假）、personal day（事假）等合并成一个“池子”。不同公司政策差异很大：有的需要提前申请，有的病假也从PTO里扣。","在书面材料里看到PTO（Please Turn Over）时，多出现在试卷、表格或说明书页面底部，提醒你“背面还有内容”。","在机械领域的PTO（power take-off）是专业缩写，常见于农业、工程车辆说明；语境通常会出现tractor、mower、shaft等词，避免与“带薪休假”混淆。"]}
{"word":"ptochocracy","summary":{"en":"Ptochocracy means rule by the poor; it’s rare and usually critical in tone.","zh":"ptochocracy 指“贫民统治”，较罕见，通常带批评或讽刺语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Government or rule by the poor (especially the very poor), often used critically to suggest a society led by poverty or by those lacking property.","zh":"贫民统治；由穷人（尤其是赤贫者）掌权的政治形态。常带批评意味，暗示社会被贫困阶层或缺乏财产者所主导。"},"examples":[{"en":"Some writers warned that the country was sliding into a ptochocracy after years of economic crisis.","zh":"一些作者警告说，经历多年经济危机后，这个国家正滑向“贫民统治”。"},{"en":"He used “ptochocracy” as an insult, implying the new leaders had no education or resources.","zh":"他把“ptochocracy”当作辱骂，暗示新领导人既缺乏教育也缺乏资源。"}]}],"synonyms":["government by the poor","rule by the masses","mob rule (pejorative)"],"phonetic":"/ˌtoʊkəˈkrɑːsi/","extraExplanation":["词源来自希腊语：ptōchos（穷人、乞丐）+ -cracy（统治）。类似构词还有 democracy（民主）、aristocracy（贵族统治）、plutocracy（富豪统治）。","这是一个非常少见、偏学术/修辞性的词。现实写作中更常用的相关表达有：government by the poor（穷人掌权的政府）、rule by the masses（大众统治，语气中性或视语境而定）、mob rule（暴民统治，强烈贬义）、plutocracy（富豪统治，常用于对比）。"]}
{"word":"ptochogony","summary":{"en":"Ptochogony means the production or increase of poverty.","zh":"Ptochogony 指“贫困的产生或加剧”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the production or growth of poverty (the process by which people or societies become poorer over time)","zh":"贫困的产生或加剧（指个人或社会在一段时间内变得更贫穷的过程）"},"examples":[{"en":"The report examined ptochogony in rural areas after years of drought.","zh":"这份报告研究了多年干旱之后农村地区贫困加剧的过程。"},{"en":"Some writers blamed unfair wages, not personal failure, for ptochogony.","zh":"一些作者认为，导致贫困产生的原因是不公平的工资制度，而不是个人失败。"}]}],"synonyms":["impoverishment","pauperization","the growth of poverty","poverty"],"phonetic":"/ˌtoʊkəˈɡɑːni/","extraExplanation":["这是一个非常罕见、偏学术或历史文本里的词，日常英语几乎不用。更常见的说法是 poverty, impoverishment, the growth of poverty。","词源来自希腊语：ptōchos（穷人）+ -gony（“出生/产生”，同词根见于 progeny“后代”、cosmogony“宇宙起源论”）。因此它强调“贫困被制造/生成”的过程，而不只是“贫穷的状态”。"]}
{"word":"ptochology","summary":{"en":"Ptochology is a rare word meaning the study of poverty or beggary.","zh":"ptochology 是个罕用词，意思是“研究贫困或乞讨的学问”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the study of poverty, beggary, or the lives and conditions of poor people.","zh":"（罕用）贫困学：研究贫穷、乞讨，或贫困群体生活与处境的学问。"},"examples":[{"en":"Her dissertation is in ptochology, focusing on how cities respond to homelessness.","zh":"她的论文方向是贫困学，重点研究城市如何应对无家可归问题。"},{"en":"The author mixes history and ptochology to describe life among the urban poor.","zh":"作者把历史与贫困学结合起来，描写城市贫民的生活。"}]}],"synonyms":["poverty studies","the study of poverty","social policy (related)","welfare studies (related)"],"phonetic":"/toʊˈkɑlədʒi/","extraExplanation":["这个词非常少见，多出现在较旧或较学术化的语境中。词源来自希腊语 ptōchós（乞丐、穷人）+ -logy（……学）。现代英语里更常用的表达是 poverty studies（贫困研究）、the study of poverty（对贫困的研究），或在政策语境中用 social policy / welfare studies（社会政策/福利研究）。"]}
{"word":"ptolemaean","summary":{"en":"Ptolemaean means “connected with Ptolemy,” especially the Earth-centered (geocentric) model of the universe.","zh":"ptolemaean 意为“与托勒密相关的”，尤指以地球为中心的（地心说）宇宙模型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ptolemy (especially Claudius Ptolemy) or to the ideas and works associated with him, most notably the Earth-centered model of the universe.","zh":"与托勒密（尤指克劳狄乌斯·托勒密）或与其思想与著作相关的；最常指“地心说”的宇宙体系。"},"examples":[{"en":"In the Ptolemaean system, the Earth was placed at the center of the cosmos.","zh":"在托勒密体系中，地球被置于宇宙的中心。"},{"en":"Medieval astronomy relied heavily on Ptolemaean tables to predict planetary motion.","zh":"中世纪天文学在预测行星运动时很大程度依赖托勒密的天文表。"}]}],"synonyms":["Ptolemaic","geocentric (in context)"],"phonetic":"/ˌtɑləˈmiən/","extraExplanation":["“Ptolemaean”常出现在学术或历史语境中，尤其与托勒密的《天文学大成》（Almagest）有关。该书系统化了古代希腊天文学，并用“本轮—均轮”等模型来解释行星的逆行现象。","拼写与发音提示：词中“ae”在美式英语里通常读作长音 /i/（类似“ee”）。","相关词：Ptolemy（托勒密）；Ptolemaic（更常见的形容词拼法，含义相近）；geocentric（地心的）；Copernican（哥白尼的，日心说相关）。"]}
{"word":"ptolemaian","summary":{"en":"Ptolemaian (more commonly spelled Ptolemaic) means “related to the Ptolemaic Dynasty of Egypt” or “related to Ptolemy’s Earth-centered astronomy.”","zh":"ptolemaian（更常写作 ptolemaic）意为“与埃及托勒密王朝有关的”或“与托勒密的地心说天文学有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Greek-Egyptian Ptolemaic Dynasty that ruled Egypt (305–30 BCE), based in Alexandria.","zh":"与古埃及的托勒密王朝有关的（约公元前305—前30年），其统治中心在亚历山大港。"},"examples":[{"en":"Cleopatra VII was the last ruler of the Ptolemaian (Ptolemaic) dynasty.","zh":"克利奥帕特拉七世是托勒密王朝最后一位统治者。"},{"en":"The museum has coins from the Ptolemaian period in Egypt.","zh":"这家博物馆收藏有埃及托勒密时期的硬币。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Claudius Ptolemy (Ptolemy), especially his astronomy and the Earth-centered model of the universe.","zh":"与托勒密（克劳狄乌斯·托勒密）有关的，尤指他的天文学理论与“地心说”宇宙模型。"},"examples":[{"en":"In the Ptolemaian system, planets move in complex circles called epicycles.","zh":"在托勒密体系中，行星以称为“本轮”的复杂圆周运动运行。"},{"en":"Copernicus challenged the Ptolemaian view with a Sun-centered model.","zh":"哥白尼用日心模型挑战了托勒密式的观点。"}]}],"synonyms":["Ptolemaic"],"phonetic":"/ˌtɑːləˈmeɪən/","extraExplanation":["“Ptolemaian”常见的标准拼写是“Ptolemaic”。两者意思相同，但在学术写作与词典中通常使用“Ptolemaic”。","“Ptolemaic dynasty（托勒密王朝）”与“Ptolemaic system（托勒密体系/地心说）”容易混淆：前者是历史王朝，后者是天文学模型。可以通过搭配词区分：dynasty/period/court（王朝/时期/宫廷）多指历史；system/model/astronomy（体系/模型/天文学）多指科学理论。"]}
{"word":"ptolemaic","summary":{"en":"Ptolemaic means related either to Ptolemy’s Earth-centered astronomy or to the Ptolemaic dynasty that ruled Egypt.","zh":"ptolemaic 指与托勒密的“地心说”天文学体系有关，或与统治埃及的“托勒密王朝”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ptolemy (especially Claudius Ptolemy, the ancient Greek scientist) or to his ideas, particularly the Earth-centered model of the universe.","zh":"与托勒密（尤其是古希腊科学家克劳狄乌斯·托勒密）或其思想有关的；尤指“地心说”的宇宙模型。"},"examples":[{"en":"In the Ptolemaic system, Earth is at the center and the sun and planets move around it.","zh":"在托勒密体系中，地球位于中心，太阳和行星围绕它运动。"},{"en":"The telescope helped challenge the Ptolemaic view of the heavens.","zh":"望远镜的出现帮助人们挑战了托勒密式的天体观。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Ptolemaic dynasty, the Greek rulers of Egypt after Alexander the Great (including Cleopatra).","zh":"与托勒密王朝有关的；指亚历山大大帝之后统治埃及的希腊化王朝（包括克利奥帕特拉）。"},"examples":[{"en":"Scholars study Ptolemaic Egypt to understand the mix of Greek and Egyptian culture.","zh":"学者研究托勒密时期的埃及，以理解希腊文化与埃及文化的融合。"},{"en":"Cleopatra was a queen of the Ptolemaic dynasty.","zh":"克利奥帕特拉是托勒密王朝的女王。"}]}],"synonyms":["geocentric (for the astronomy sense)","Alexandrian (sometimes, in historical context)"],"phonetic":"/ˌtɑl əˈmeɪ ɪk/","extraExplanation":["“Ptolemaic”这个词常让学习者混淆，因为它既可能指“托勒密（天文学家）的地心体系”，也可能指“托勒密王朝（埃及统治者）”。在学术写作里，前者常与astronomy、geocentric、epicycle（本轮）等词一起出现；后者常与Egypt、Alexandria、Cleopatra 等词同现。","常见搭配：Ptolemaic system / Ptolemaic model（托勒密体系/模型）；Ptolemaic dynasty / Ptolemaic Egypt（托勒密王朝/托勒密时期的埃及）。"]}
{"word":"ptolemaical","summary":{"en":"“Ptolemaical” is an uncommon spelling of “Ptolemaic,” meaning related to Ptolemy, especially his geocentric astronomical system.","zh":"“Ptolemaical”是较少见的拼写，等同于“Ptolemaic”，指与托勒密有关，尤指其地心说天文学体系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spelling variant of **Ptolemaic**) relating to the ancient Greek-Egyptian scholar **Ptolemy** (Claudius Ptolemaeus), especially his work in astronomy and geography.","zh":"（**Ptolemaic** 的拼写变体）与古希腊—埃及学者**托勒密**（Claudius Ptolemaeus）有关的，尤指他在天文学与地理学方面的著作与体系。"},"examples":[{"en":"Medieval European astronomy was strongly influenced by Ptolemaic ideas.","zh":"中世纪欧洲的天文学深受托勒密思想影响。"},{"en":"Some older books use the spelling “Ptolemaical.”","zh":"一些较旧的书会使用 “Ptolemaical” 这种拼写。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the **Ptolemaic system** of astronomy, which places the Earth at the center of the universe (a geocentric model).","zh":"与**托勒密天文学体系**有关的（以地球为宇宙中心的“地心说”模型）。"},"examples":[{"en":"The Ptolemaic model used epicycles to explain the planets’ motion.","zh":"托勒密模型用“本轮（epicycles）”来解释行星运动。"},{"en":"Copernicus challenged the Ptolemaic view with a heliocentric theory.","zh":"哥白尼用日心说挑战了托勒密的地心观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Old-fashioned or based on an outdated worldview.","zh":"（引申）过时的；基于陈旧世界观的。"},"examples":[{"en":"Calling the internet a “fad” sounds a bit Ptolemaic now.","zh":"如今把互联网称作“一时的潮流”听起来有点“过时”。"}]}],"synonyms":["Ptolemaic","geocentric","Earth-centered","(figurative) outdated","old-fashioned"],"phonetic":"/ˌtɑləˈmeɪɪk/","extraExplanation":["“Ptolemaical”在现代英语中很少见，更常用的是“Ptolemaic”。如果你在学术写作或考试中使用，建议优先选用标准拼写“Ptolemaic”。","托勒密最著名的天文学著作是《天文学大成》（Almagest）。在该体系中，地球位于中心，行星通过“本轮/均轮”等结构来解释看似倒退的运行（逆行）。","文学或评论写作中，Ptolemaic 有时被用作隐喻，表示“以自我/旧观念为中心”的思考方式。"]}
{"word":"ptolemaism","summary":{"en":"Ptolemaism is Ptolemy’s Earth-centered model of the universe, or belief in that model.","zh":"Ptolemaism 指托勒密的地心宇宙模型，或对该模型的信奉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ancient geocentric (Earth-centered) model of the universe associated with the Greek-Egyptian astronomer Ptolemy, in which the Sun, Moon, and planets were thought to move around Earth (often described using circles and “epicycles”).","zh":"托勒密体系；托勒密的地心宇宙模型：一种古代以地球为中心的宇宙观，认为太阳、月亮和行星围绕地球运动（常用“本轮/均轮”等圆周与“周转圆/本轮”来解释）。"},"examples":[{"en":"In medieval Europe, Ptolemaism shaped how scholars understood the heavens.","zh":"在中世纪欧洲，托勒密体系影响了学者对天体的理解。"},{"en":"Copernicus challenged Ptolemaism by proposing a Sun-centered system.","zh":"哥白尼提出日心说，从而挑战了托勒密体系。"}]},{"partOfSpeech":"n.","definition":{"en":"belief in or support for Ptolemy’s geocentric astronomy; acceptance of the Ptolemaic worldview.","zh":"对托勒密地心天文学的信奉或支持；接受托勒密式世界观。"},"examples":[{"en":"The debate was not only scientific but also philosophical, pitting Ptolemaism against newer ideas.","zh":"这场争论不仅是科学层面的，也是哲学层面的：托勒密主义与新观点相对立。"}]}],"synonyms":["Ptolemaic system","geocentrism","geocentric model"],"phonetic":"/təˈlimaɪˌɪzəm/","extraExplanation":["“Ptolemaism”来自天文学家克劳狄乌斯·托勒密（Claudius Ptolemy）。他的著作《天文学大成》（Almagest）系统整理并发展了地心模型，用“周转圆（epicycles）”等机制来解释行星逆行等现象。","在西方历史语境中，它常与“Copernicanism（哥白尼主义/日心体系）”“Galilean astronomy（伽利略的天文学观察）”并列，用来讨论科学范式更替。文学或历史写作中也会把它当作“旧秩序/传统权威”的象征。"]}
{"word":"ptolemaist","summary":{"en":"A Ptolemaist is a supporter of Ptolemy’s Earth-centered (geocentric) astronomy; it can also mean “Ptolemaic” as an adjective.","zh":"Ptolemaist 指支持托勒密地心天文学的人；也可作形容词，表示“托勒密体系的/地心说的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows or supports the ideas of Ptolemy, especially the Ptolemaic (Earth-centered) model of the universe.","zh":"托勒密学派的人；支持托勒密观点的人，尤指支持“托勒密地心说”（以地球为中心的宇宙模型）的人。"},"examples":[{"en":"Some early astronomers were Ptolemaists and defended the Earth-centered universe.","zh":"一些早期天文学家是托勒密学派，主张并捍卫地心宇宙观。"},{"en":"In the debate, the Ptolemaist argued that the heavens move around the Earth.","zh":"在辩论中，那位托勒密学派人物认为天体围绕地球运动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or supporting Ptolemy’s astronomy, especially the geocentric system.","zh":"与托勒密天文学有关的；支持托勒密体系的，尤指支持地心说的。"},"examples":[{"en":"The textbook describes the Ptolemaist view before introducing Copernicus.","zh":"这本教材先介绍托勒密式观点，然后才引入哥白尼理论。"},{"en":"Medieval scholars often worked within a Ptolemaist framework.","zh":"中世纪学者常在托勒密式的理论框架内研究。"}]}],"synonyms":["Ptolemaic","geocentrist","geocentric"],"phonetic":"/tɑˈlɪmi.ɪst/","extraExplanation":["“Ptolemaist”来自古希腊—罗马时期的天文学家克劳狄乌斯·托勒密（Claudius Ptolemy）。托勒密在《天文学大成》（Almagest）中系统化了地心宇宙模型，用“本轮/均轮”等结构来解释行星的逆行现象。","在欧洲历史语境中，“Ptolemaist”常与“Copernican（哥白尼的）/heliocentric（日心的）”对比，用来指支持旧的地心体系的人或观点。文学与历史写作里也会把它当作“保守旧模型”的象征性标签。"]}
{"word":"ptolemean","summary":{"en":"Ptolemaean means ‘related to Ptolemy,’ especially the geocentric (Earth-centered) model; it can also mean a person who supports that model.","zh":"Ptolemaean 指“与托勒密有关”，尤指地心说体系；也可指“地心说的支持者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ptolemy (especially Claudius Ptolemy) or to his ideas, most notably the Earth-centered (geocentric) model of the universe.","zh":"与托勒密（尤指克劳狄乌斯·托勒密）或其思想有关的；尤指托勒密的“地心说”（地球为宇宙中心）体系。"},"examples":[{"en":"The Ptolemaean system placed Earth at the center of the cosmos.","zh":"托勒密体系把地球放在宇宙的中心。"},{"en":"Copernicus challenged the Ptolemaean view of the heavens.","zh":"哥白尼挑战了托勒密式的天体观。"}]},{"partOfSpeech":"n.","definition":{"en":"A supporter of the Ptolemaean (geocentric) system.","zh":"托勒密地心说的支持者；地心说拥护者。"},"examples":[{"en":"Some medieval scholars remained Ptolemaeans long after new observations appeared.","zh":"即使出现了新的观测结果，一些中世纪学者仍长期是托勒密派（地心说拥护者）。"}]}],"synonyms":["Ptolemaic","geocentric"],"phonetic":"/ˌtɑləˈmiːən/","extraExplanation":["“Ptolemaean / Ptolemaic”常见于科学史与文学语境：文艺复兴到近代早期的作品里，经常用“Ptolemaean spheres（托勒密的天球）”“Ptolemaean cosmos（托勒密宇宙）”来指传统的地心宇宙观。","拼写上“Ptolemaean”是较传统/较少见的变体；现代英语更常用“Ptolemaic”。两者意思基本相同。"]}
{"word":"Ptolemy","summary":{"en":"Ptolemy refers to (1) the ancient scholar Claudius Ptolemy and (2) several kings of Egypt’s Ptolemaic dynasty.","zh":"Ptolemy 指（1）古代学者克劳狄乌斯·托勒密，以及（2）埃及托勒密王朝中多位名为“托勒密”的国王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Claudius Ptolemy (c. AD 100–170), a Greek-Egyptian scholar in Alexandria known for influential works on astronomy, geography, and mathematics (e.g., the geocentric “Ptolemaic system”).","zh":"（专有名词）托勒密（约公元100—170年），亚历山大里亚的希腊—埃及学者，以天文学、地理学和数学著作闻名（如以地球为中心的“托勒密体系/地心说模型”）。"},"examples":[{"en":"Ptolemy’s model placed Earth at the center of the universe.","zh":"托勒密的模型把地球放在宇宙的中心。"},{"en":"In geography class, we learned how Ptolemy tried to map the known world.","zh":"在地理课上，我们学习了托勒密如何尝试绘制当时已知的世界地图。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The name of several kings of the Ptolemaic dynasty, the Greek rulers of Egypt after Alexander the Great (including Cleopatra’s family).","zh":"（专有名词）托勒密王朝多位埃及国王的名字；该王朝是亚历山大大帝之后统治埃及的希腊裔王族（包括克利奥帕特拉家族）。"},"examples":[{"en":"Cleopatra belonged to the Ptolemaic dynasty founded by Ptolemy I.","zh":"克利奥帕特拉属于由托勒密一世建立的托勒密王朝。"},{"en":"Many rulers in that dynasty were named Ptolemy, which can be confusing in history books.","zh":"那个王朝很多统治者都叫托勒密，所以历史书里很容易看混。"}]}],"synonyms":["Claudius Ptolemy","Ptolemaic dynasty","Ptolemaic"],"phonetic":"/ˈtɑləmi/","extraExplanation":["“Ptolemy”常见于两类语境：一是科学史里的学者“Claudius Ptolemy（克劳狄乌斯·托勒密）”，二是古埃及希腊化时期“托勒密王朝”的国王名（如 Ptolemy I, II…）。阅读时可通过上下文判断。","科学史中常提到《Almagest（天文学大成）》与“Ptolemaic system（托勒密体系/地心体系）”。后来哥白尼的日心说取代了其宇宙结构，但托勒密在观测整理与数学建模方面仍有重要历史地位。","拼写以 P 开头但读音不发 /p/：英语里通常读作 /ˈtɑləmi/，可记成“TAH-luh-mee”。"]}
{"word":"ptolemy","summary":{"en":"Ptolemy is best known as the ancient scholar whose geocentric model shaped astronomy for centuries; it is also a historical male name (especially of the Ptolemaic rulers of Egypt).","zh":"Ptolemy（托勒密）最常指提出地心宇宙体系的古代学者；也可作历史上的男性名字，尤指古埃及托勒密王朝诸王的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Claudius Ptolemy (2nd century CE), a Greek-Egyptian scholar in Roman Alexandria, famous for astronomy, geography, and the Earth-centered (geocentric) model of the universe.","zh":"托勒密（约公元2世纪），罗马时期亚历山大的希腊裔埃及学者，以天文学、地理学以及“地心说”（宇宙以地球为中心）闻名。"},"examples":[{"en":"Ptolemy’s geocentric model influenced European astronomy for over a thousand years.","zh":"托勒密的地心模型影响了欧洲天文学一千多年。"},{"en":"In class, we compared Copernicus’s heliocentric theory with Ptolemy’s system.","zh":"课堂上我们比较了哥白尼的日心说和托勒密体系。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, especially in historical contexts (e.g., several kings of ancient Egypt’s Ptolemaic dynasty).","zh":"男性名字（多见于历史语境，如古埃及托勒密王朝的多位国王）。"},"examples":[{"en":"Several rulers of Egypt were named Ptolemy.","zh":"埃及有好几位统治者都叫托勒密。"},{"en":"The novel features a character named Ptolemy.","zh":"这本小说里有个角色名叫托勒密。"}]}],"synonyms":["Claudius Ptolemy","Ptolemaic"],"phonetic":"/ˈtɑləmi/","extraExplanation":["“Ptolemy”常见两条文化线索：①学者托勒密（Claudius Ptolemy），代表作包括《天文学大成》（常被称为《Almagest》）与《地理学》；②托勒密王朝（Ptolemaic dynasty），由亚历山大大帝的将领托勒密一世建立，著名人物包括克娄巴特拉七世。","现代英语里提到“Ptolemaic system / Ptolemaic model”，通常特指“地心说”的宇宙体系；在学术或科普语境中很常见。"]}
{"word":"ptomain","summary":{"en":"Ptomaine (often misspelled “ptomain”) is a dated word for chemicals from decaying tissue and, historically, for “food poisoning.”","zh":"Ptomaine（常误拼为 ptomain）是较过时的词，可指腐败组织产生的尸胺类物质，也曾被用来指“食物中毒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foul-smelling chemical (one of several amines) produced when animal tissue decays; historically thought to cause illness","zh":"（腐败的动物组织分解时产生的）尸胺类恶臭化学物质；过去曾被认为会导致生病"},"examples":[{"en":"The garbage had a strong, rotten smell, sometimes linked to ptomaine compounds.","zh":"垃圾散发出强烈的腐臭味，有时会与尸胺类化合物联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, informal) food poisoning; sickness believed to come from spoiled food","zh":"（过时、非正式）食物中毒；过去认为由变质食物引起的不适"},"examples":[{"en":"In old novels, characters may say they got “ptomaine poisoning” after a bad meal.","zh":"在一些老小说里，人物吃了不好的饭后可能会说自己得了“ptomaine poisoning（尸胺中毒）”。"},{"en":"Today we usually say “food poisoning,” not “ptomaine.”","zh":"现在我们通常说“food poisoning（食物中毒）”，而不说“ptomaine”。"}]}],"synonyms":["food poisoning","spoiled food","decay products"],"phonetic":"/ˈtoʊ.meɪn/","extraExplanation":["你输入的“ptomain”通常是“ptomaine”的拼写变体/误拼。现代英语里这个词很少单独使用，更常见于旧说法“ptomaine poisoning”。","“ptomaine poisoning”在历史上很流行，但现在被认为不准确：大多数食物中毒来自细菌、病毒或其毒素，而不是“ptomaines（尸胺类物质）”本身。"]}
{"word":"ptomaine","summary":{"en":"An old term for toxins from decaying food, and (in older usage) for food poisoning.","zh":"一个较旧的词：指食物腐败产生的毒性物质，也常被旧式用法用来指“食物中毒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) a toxic substance formed when protein-rich food (like meat or fish) decays; historically believed to cause food poisoning.","zh":"（过时用法）指富含蛋白质的食物（如肉、鱼）腐败时产生的“毒素”；过去常被认为是食物中毒的原因。"},"examples":[{"en":"People once blamed “ptomaine” for stomach illness after eating spoiled meat.","zh":"过去人们常把吃了变质肉后的肠胃不适归咎于“ptomaine”。"},{"en":"The term ptomaine is now rarely used in medical writing.","zh":"在医学写作中，“ptomaine”这个词现在很少使用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common in older speech) food poisoning (though this is scientifically inaccurate).","zh":"（旧式口语）食物中毒（但从科学角度并不准确）。"},"examples":[{"en":"He said he got ptomaine from the potato salad, but it was likely bacterial food poisoning.","zh":"他说自己吃土豆沙拉得了“ptomaine”，但更可能是细菌性食物中毒。"}]}],"synonyms":["food poisoning","bacterial food poisoning","toxin","putrefaction product"],"phonetic":"/ˈtoʊ.meɪn/","extraExplanation":["“Ptomaine”来自法语 ptomaïne，源头与希腊语 ptōma（“尸体/倒下的东西”）有关。","19世纪末到20世纪初，“ptomaine poisoning（腐胺中毒）”常被当作食物中毒的解释；现代医学更常用“food poisoning（食物中毒）”或更具体的病原（如 salmonella 沙门氏菌、norovirus 诺如病毒）。","严格来说，ptomaines 是腐败过程中产生的一类胺（如 putrescine、cadaverine），它们往往气味难闻，但并不等同于造成典型急性食物中毒的主要毒素/病原。"]}
{"word":"ptomaines","summary":{"en":"“Ptomaines” are toxic compounds associated with decaying matter; the term is old-fashioned and often replaced today by “bacterial toxins/food poisoning.”","zh":"ptomaines 指与腐败物质相关的有毒化合物；该词较为过时，现代多用“细菌毒素/食物中毒”等说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ptomaine: poisonous amines formed during the decay of animal or plant tissue (historically believed to be a common cause of food poisoning).","zh":"ptomaine 的复数：动物或植物组织腐败过程中产生的有毒胺类（历史上曾被认为是食物中毒的常见原因）。"},"examples":[{"en":"Early writers blamed many cases of food poisoning on ptomaines.","zh":"早期的文章把许多食物中毒病例归咎于腐胺类毒素（ptomaines）。"},{"en":"The report mentioned ptomaines, but modern testing found bacterial toxins instead.","zh":"报告提到了 ptomaines，但现代检测发现真正原因是细菌毒素。"}]}],"synonyms":["toxins","bacterial toxins","decay products"],"phonetic":"/ˈtoʊmeɪn/","extraExplanation":["“Ptomaine/ptomaines（腐胺类毒素）”是19世纪末到20世纪初常见的说法，当时人们以为食物变质会产生一种固定的“腐败毒素”导致中毒。现代食品安全与医学更常用“细菌毒素（toxins）”“细菌污染（bacterial contamination）”等说法；很多所谓“ptomaine poisoning”其实是沙门氏菌、肉毒毒素等引起的。日常英语里这个词较少见，多出现在历史语境或非正式、过时的表述中。"]}
{"word":"ptomainic","summary":{"en":"An uncommon adjective meaning “related to chemicals from decay (ptomaines),” often found in older discussions of food poisoning.","zh":"较少见的形容词，表示“与腐败分解产生的化合物（腐胺/尸胺类）有关”，多见于旧式的食物中毒讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ptomaines (chemical compounds formed during the decay of animal or plant matter); sometimes used more generally to mean “from rotting matter” or “food-poisoning related,” though this usage is old-fashioned.","zh":"与“腐胺/尸胺类（ptomaines）”有关的（这些化合物会在动植物腐败分解时产生）；也常被较旧的用法泛指“来自腐败物质的/与食物中毒相关的”。"},"examples":[{"en":"Early writers blamed “ptomainic poisoning” for illnesses that we now know were caused by bacteria like Salmonella.","zh":"早期一些作者把疾病归因于“ptomainic poisoning（腐胺中毒）”，而我们现在知道很多其实是沙门氏菌等细菌导致的。"},{"en":"The doctor noted a ptomainic smell from the spoiled meat, suggesting it was unsafe to eat.","zh":"医生指出变质肉类有一种“腐败分解的气味”，暗示它不适合食用。"}]}],"synonyms":["putrid","decaying","rotten","foul"],"phonetic":"/toʊˈmeɪnɪk/","extraExplanation":["“Ptomainic”源自“ptomaine”（19世纪常用词），而“ptomaine”又来自希腊语 ptōma（意为“尸体/倒下的东西”）。当时人们曾误以为食物中毒主要由“ptomaines（腐败产生的胺类）”引起，所以会出现“ptomainic poisoning”这类说法；现代科学更常用“food poisoning（食物中毒）”“bacterial contamination（细菌污染）”“toxins（毒素）”等表述。","在现代英文中，“ptomainic”非常少见，更多见于历史文献、旧医学写作，或作为带文学色彩的“腐败、令人作呕”的形容。写作时若想更自然，通常改用“putrid（腐臭的）”“decaying（腐烂的）”“rotten（腐坏的）”。"]}
{"word":"ptomains","summary":{"en":"“Ptomaines” is the plural of “ptomaine,” an old-fashioned term for toxins from decay, often used (incorrectly) to mean the cause of food poisoning.","zh":"“Ptomaines”是“ptomaine”的复数，指腐败产生的毒性物质；旧时常（不准确地）用来指食物中毒的原因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ptomaine) A toxic substance formed during the decay of animal or plant matter; historically (and often incorrectly) used to mean the cause of food poisoning.","zh":"（ptomaine 的复数）腐败的动植物组织在分解过程中产生的有毒物质；历史上常被（但多半不准确地）用来指“食物中毒的原因”。"},"examples":[{"en":"In older books, people warned that spoiled meat could contain ptomaines.","zh":"在较早的书里，人们警告变质的肉可能含有 ptomaines。"},{"en":"He said he got sick from “ptomaines,” but the doctor explained it was probably bacteria.","zh":"他说自己是因为“ptomaines”生病的，但医生解释更可能是细菌导致的。"}]}],"synonyms":["foodborne toxin","decay toxin (informal)","(old-fashioned) ptomaine poisoning"],"phonetic":"/ˈtoʊmeɪnz/","extraExplanation":["“ptomaine”这个词在19世纪末到20世纪初的英语里很常见，当时人们以为食物中毒主要来自腐败产生的化学毒素（ptomaines）。现代医学认为大多数食物中毒由细菌、病毒或其产生的毒素引起，所以在当代英语中，这个词多见于历史语境、旧文学，或带一点“老派说法/不严谨”的感觉。"]}
{"word":"ptomatropine","summary":{"en":"Ptomatropine is a rare, older medical term for an atropine-related drug once used to dilate pupils in eye care.","zh":"Ptomatropine 是较少见的旧式医学用语，指一种与阿托品相关、曾用于眼科散瞳的药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug (an anticholinergic compound) related to atropine, formerly used especially in eye care to dilate the pupil (a mydriatic) or reduce eye spasms.","zh":"一种与阿托品相关的抗胆碱药物，过去多用于眼科，用来散大瞳孔（散瞳）或减轻眼部痉挛。"},"examples":[{"en":"The ophthalmologist noted that ptomatropine was once used as a mydriatic, but newer options are more common today.","zh":"眼科医生提到，托马托品（ptomatropine）过去曾用作散瞳药，但如今更常用的是较新的药物。"},{"en":"Because of its atropine-like effects, ptomatropine can cause dry mouth and blurred vision.","zh":"由于它具有类似阿托品的作用，托马托品可能引起口干和视物模糊。"}]}],"synonyms":["mydriatic (general term)","atropine (related drug)"],"phonetic":"/ˌtoʊməˈtroʊpiːn/","extraExplanation":["这是一个较少见、偏历史用法的药名；在现代临床语境中更常见的是 atropine（阿托品）、tropicamide（托吡卡胺）、cyclopentolate（环喷托酯）等散瞳/睫状肌麻痹药。","词形可拆为 ptoma-（与“腐败产物/尸胺类”相关的词根，见 ptomaine）+ atropine（阿托品）相关部分；但在实际英语使用中通常把它当作一个整体药名记忆即可。"]}
{"word":"ptoses","summary":{"en":"Ptoses is the plural of ptosis, meaning drooping—especially of the upper eyelid—or, medically, the drooping of an organ.","zh":"Ptoses 是 ptosis 的复数，主要指（医学）上眼睑下垂，也可泛指器官下垂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The drooping of an upper eyelid (a medical condition).","zh":"（医学）上眼睑下垂（上眼皮下垂的一种情况）。"},"examples":[{"en":"The doctor said her ptosis might be caused by a nerve problem.","zh":"医生说她的上眼睑下垂可能与神经问题有关。"},{"en":"He had mild ptosis in his left eye after the injury.","zh":"受伤后，他左眼出现轻度上眼睑下垂。"}]},{"partOfSpeech":"n.","definition":{"en":"A downward displacement or drooping of an organ (medical use).","zh":"（医学）器官下垂；脏器下移。"},"examples":[{"en":"The report mentioned a ptosis of the stomach.","zh":"报告提到胃下垂。"}]}],"synonyms":["drooping","eyelid droop","prolapse (broader medical term)"],"phonetic":"/ˈtoʊsɪs/","extraExplanation":["你输入的“ptoses”是“ptosis”的复数形式：ptosis → ptoses（很多以 -is 结尾的医学名词，复数会变成 -es，例如 diagnosis → diagnoses）。","词源来自希腊语 ptōsis，意思是“下落/坠落”，所以它在医学里常用来指“下垂、下陷”。","在日常英语中，这个词几乎只出现在医学或健康相关语境（如眼科、神经科）。如果只是描述“眼皮有点耷拉”，口语里也可能说 droopy eyelid。"]}
{"word":"ptosis","summary":{"en":"Ptosis is a medical term most commonly meaning drooping of the upper eyelid.","zh":"Ptosis 是医学术语，最常指上眼睑下垂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Drooping of the upper eyelid.","zh":"（医学）上眼睑下垂。"},"examples":[{"en":"After the surgery, she noticed mild ptosis in her right eye.","zh":"手术后，她发现右眼有轻微的上睑下垂。"},{"en":"The doctor checked whether the ptosis affected his vision.","zh":"医生检查上睑下垂是否影响了他的视力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical, broader) Abnormal drooping of an organ or body part (less common).","zh":"（医学，较广义）器官或身体部位的异常下垂（较不常见）。"},"examples":[{"en":"In older medical writing, ptosis could refer to drooping in other parts of the body.","zh":"在较早的医学文献中，ptosis 有时也可指身体其他部位的下垂。"}]}],"synonyms":["drooping eyelid","eyelid droop"],"phonetic":"/ˈtoʊsɪs/","extraExplanation":["词源：来自希腊语 ptōsis，意思是“下落、下垂”。在现代英语里最常见的用法是指“上眼睑下垂”。","常见相关表达：\n- eyelid ptosis（眼睑下垂）\n- congenital ptosis（先天性上睑下垂）\n- acquired ptosis（后天性上睑下垂）\n- ptosis surgery / ptosis repair（上睑下垂矫正手术）\n临床上医生也可能会区分“真性下垂”（肌肉/神经问题）与“假性下垂”（比如皮肤松弛造成的视觉效果）。"]}
{"word":"ptotic","summary":{"en":"“Ptotic” is a medical adjective meaning “drooping,” especially referring to a drooping eyelid (ptosis).","zh":"“ptotic”是医学形容词，表示“下垂的”，尤其指眼睑下垂（ptosis）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to ptosis; having a drooping or sagging position (especially of an eyelid).","zh":"（医学）与上睑下垂（ptosis）有关的；呈下垂/下坠状态的（尤指眼睑）。"},"examples":[{"en":"The doctor noted a ptotic left eyelid during the exam.","zh":"医生在检查时注意到患者左眼睑有下垂（ptotic）的情况。"},{"en":"After the nerve injury, her eyelid became slightly ptotic.","zh":"神经受伤后，她的眼睑出现轻微下垂。"}]}],"synonyms":["drooping","sagging","ptosed"],"phonetic":"/ˈtoʊtɪk/","extraExplanation":["“ptotic”较少单独在日常英语中出现，更多见于医学/解剖学语境。更常用的相关名词是“ptosis（上睑下垂）”，医生也常说“droopy eyelid（眼皮耷拉/下垂）”。","词源来自希腊语词根，和“fall/falling（下落、下垂）”有关。常见搭配：ptotic eyelid（下垂的眼睑）、ptotic breast（乳房下垂，医学语境）、ptotic kidney（肾下垂/游走肾）。","拼写容易与“exotic”等词混淆；注意“pt-”开头在英语中p通常不发音。"]}
{"word":"ptp","summary":{"en":"PTP is an abbreviation most often meaning point-to-point; in some technical contexts it means Precision Time Protocol, and informally it can mean pay-to-play.","zh":"PTP是缩写，最常见指点对点；在某些技术语境指精确时间协议；在非正式语境中也可指付费才能参与（pay-to-play）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) point-to-point: a direct connection or communication between two endpoints (common in networking, telecom, and travel).","zh":"（缩写）点对点：两个端点之间的直接连接或沟通（常见于网络、电信与交通出行语境）。"},"examples":[{"en":"This route is PTP, so you don’t need to transfer in another city.","zh":"这条航线是PTP（点对点），所以你不需要在其他城市中转。"},{"en":"A PTP link connects the two offices directly.","zh":"一条PTP链路把两间办公室直接连接起来。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Precision Time Protocol: a network standard for synchronizing clocks very accurately (used in finance, telecom, and industrial systems).","zh":"（缩写）精确时间协议：一种在网络中实现高精度时钟同步的标准（用于金融、电信与工业系统）。"},"examples":[{"en":"Our servers use PTP to keep timestamps consistent across the network.","zh":"我们的服务器使用PTP来让全网时间戳保持一致。"},{"en":"PTP synchronization is important for high-frequency trading systems.","zh":"PTP同步对高频交易系统很重要。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) pay-to-play: a situation where participation or access depends on paying money (often used critically).","zh":"（缩写，非正式）花钱买机会/付费才能参与：指必须付钱才能获得参与或资源（常带批评意味）。"},"examples":[{"en":"Some people say the event feels PTP because you have to pay to get a speaking slot.","zh":"有人说这个活动很PTP，因为你得付钱才能拿到发言名额。"},{"en":"They criticized the program as PTP and unfair to smaller teams.","zh":"他们批评这个项目是PTP，对小团队不公平。"}]}],"synonyms":["point-to-point","direct connection","Precision Time Protocol (IEEE 1588)","pay-to-play"],"phonetic":"/ˌpiː tiː ˈpiː/","extraExplanation":["PTP是缩写，不同领域含义不同。看到PTP时，先看上下文：如果在网络/线路/航班里，多半是point-to-point；如果在“时钟同步、时间戳、IEEE 1588”等技术语境里，通常是Precision Time Protocol；如果在活动、资源、名额与付费争议中，可能指pay-to-play。"]}
{"word":"pts","summary":{"en":"“pts/PTS” is an abbreviation most often meaning “points” (score), and sometimes “post-traumatic stress” in medical/mental-health contexts.","zh":"“pts/PTS”常见为“points（分数/点数）”的缩写；在医疗/心理健康语境中也可指“post-traumatic stress（创伤后应激）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) points; a short form often used in games, sports, grading, or online posts to mean a score or number of points.","zh":"（缩写）分数；常用于游戏、运动、成绩或网络表达中，表示“得分/点数”。"},"examples":[{"en":"I earned 500 pts in the first round.","zh":"我在第一轮拿了500分。"},{"en":"Final exam: 100 pts total.","zh":"期末考试：总分100分。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) post-traumatic stress; commonly written as PTS, especially in medical or mental-health contexts (often related to PTSD).","zh":"（缩写）创伤后应激；常见于医疗或心理健康语境（常与PTSD相关）。"},"examples":[{"en":"The doctor noted signs of PTS after the accident.","zh":"医生记录了事故后出现的创伤后应激迹象。"},{"en":"Some veterans experience PTS symptoms like nightmares.","zh":"一些退伍军人会经历如噩梦等创伤后应激症状。"}]}],"synonyms":["points","score","PTSD (related)"],"phonetic":"/pi ti ɛs/","extraExplanation":["“pts”在日常聊天里最常见的意思是“points（分数/点数）”，尤其在游戏、考试、活动积分里。正式写作中一般写全“points”。","“PTS”也可能出现在医疗记录或心理健康讨论中，指“post-traumatic stress（创伤后应激）”。更常见的完整诊断写法是“PTSD（post-traumatic stress disorder，创伤后应激障碍）”；PTS有时更像是症状或状态的简写，具体以语境为准。","读音通常按字母拼读：P-T-S。"]}
{"word":"PTSD","summary":{"en":"PTSD is post-traumatic stress disorder, a condition that can follow trauma and causes symptoms like flashbacks, nightmares, avoidance, and heightened alertness.","zh":"PTSD指創傷後壓力疾患，可能在創傷後出現，常見症狀有閃回、惡夢、迴避與過度警覺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Post-traumatic stress disorder: a mental health condition that can happen after experiencing or witnessing a terrifying or deeply stressful event, causing symptoms like flashbacks, nightmares, avoidance, and being easily startled.","zh":"創傷後壓力疾患（創傷後壓力障礙）：在經歷或目睹恐怖或高度壓力事件後可能出現的心理健康狀況，常見症狀包括閃回、惡夢、迴避、容易受驚等。"},"examples":[{"en":"After the accident, he was diagnosed with PTSD and started therapy.","zh":"事故之後，他被診斷出有PTSD，並開始接受治療。"},{"en":"Some people with PTSD avoid places or sounds that remind them of what happened.","zh":"有些PTSD患者會迴避讓他們想起事件的地點或聲音。"},{"en":"PTSD can affect anyone, not only soldiers.","zh":"PTSD可能影響任何人，不只會出現在軍人身上。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: the lasting emotional shock or stress someone feels after a very upsetting experience.","zh":"（非正式）指人在非常難受的經歷後留下的持續性心理衝擊或壓力感（不一定是正式診斷）。"},"examples":[{"en":"I still have PTSD from that embarrassing presentation in college. (informal)","zh":"我到現在還對大學那次丟臉的報告有『PTSD』。（口語誇張用法）"},{"en":"Be careful using PTSD as a joke—it's a real medical condition for many people.","zh":"用PTSD開玩笑要小心——對很多人來說那是真實的醫療診斷。"}]}],"synonyms":["post-traumatic stress disorder","trauma disorder","combat stress (older/related term, not exact)"],"phonetic":"/ˌpiː tiː ɛs ˈdiː/","extraExplanation":["PTSD是縮寫，全名為Post-Traumatic Stress Disorder。常見於戰爭、嚴重事故、暴力、災害、性侵等創傷事件之後，但也可能出現在其他重大壓力事件後。","在英文語境中，PTSD有時被口語化拿來形容『陰影很大』的感覺；但因為它是嚴肅的醫療名詞，正式寫作或面對當事人時建議避免輕率使用。","相關詞彙：trauma（創傷）、trigger（觸發因素）、flashback（閃回）、nightmare（惡夢）、hypervigilance（過度警覺）。"]}
{"word":"ptt","summary":{"en":"PTT most commonly means “push-to-talk” (radio/app feature) or “paid time off” (work leave). In science it can mean “parts per trillion.”","zh":"PTT 最常指「按鍵通話（push-to-talk）」或「帶薪休假（paid time off）」。在科學領域也可指「兆分之一（parts per trillion）」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"push-to-talk: a feature on radios or apps where you press a button to speak and release it to listen.","zh":"按鍵通話／按下說話（對講機或通訊軟體的功能）：按住按鈕講話、放開就收聽。"},"examples":[{"en":"This walkie-talkie has PTT—hold the button while you speak.","zh":"這台對講機有 PTT 功能——講話時要按住按鈕。"},{"en":"In the app, tap PTT to send a quick voice message.","zh":"在這個 App 裡，點 PTT 就能快速傳語音。"}]},{"partOfSpeech":"n.","definition":{"en":"paid time off: vacation/sick leave time that you can take while still getting paid (often used at work).","zh":"帶薪休假（常見於職場）：休假時仍照領薪水的假期總額（常把年假、病假等合併計算）。"},"examples":[{"en":"I’m using my PTT next week to take a short trip.","zh":"我下週要用 PTT（帶薪休假）去小旅行。"},{"en":"New employees get 10 days of PTT per year.","zh":"新進員工每年有 10 天的 PTT（帶薪休假）。"}]},{"partOfSpeech":"n.","definition":{"en":"parts per trillion: a unit for extremely small concentrations in science and environmental reports (abbrev. PTT; more commonly written as ppt).","zh":"兆分之一（濃度單位）：用於表示極微量的濃度（縮寫有時寫 PTT；更常見寫 ppt）。"},"examples":[{"en":"The chemical was detected at 5 ptt in the water sample.","zh":"水樣中檢測到該化學物質濃度為 5 ptt。"},{"en":"These instruments can measure pollutants at the ptt level.","zh":"這些儀器能測到 ptt 等級的污染物濃度。"}]}],"synonyms":["push-to-talk","walkie-talkie mode","paid time off","PTO","leave","vacation time","parts per trillion","ppt"],"phonetic":"/pi ti ti/","extraExplanation":["在中文／台灣語境中，「PTT」也常指台灣知名的BBS站「批踢踢實業坊」（通常直接說 PTT）。不過這不是英文裡的通用義，屬於特定文化與平台名稱。","職場裡的「PTT（paid time off）」在美國很常見，但不同公司制度差很多：有些把年假、病假合併成一個池（PTT/PTO），有些則分開計算。"]}
{"word":"ptts","summary":{"en":"PTTS is usually an acronym; a common meaning is “post-traumatic stress symptoms,” but it can also be community-specific.","zh":"PTTS通常是首字母缩写；常见含义之一是“创伤后应激症状”，也可能是特定社群/机构内部用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean “post-traumatic stress symptoms” (stress reactions after a traumatic event) in some medical/psychology writing.","zh":"在一些医学/心理学语境中可指“创伤后应激症状”（经历创伤事件后出现的压力反应）。"},"examples":[{"en":"The report tracked PTTS in survivors six months after the accident.","zh":"这份报告追踪了事故幸存者在六个月后的PTTS（创伤后应激症状）。"},{"en":"If you think you have PTTS, consider talking to a mental health professional.","zh":"如果你怀疑自己有PTTS（创伤后应激症状），可以考虑咨询心理健康专业人士。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some organizations or online communities with a meaning specific to that group (not a standard dictionary word).","zh":"在某些组织或网络社群中使用的缩写，含义取决于该群体（不属于通用词典词汇）。"},"examples":[{"en":"In our chat, PTTS means a project status update.","zh":"在我们的群聊里，PTTS表示项目进度更新。"},{"en":"What does PTTS stand for in this document?","zh":"在这份文件里PTTS代表什么？"}]}],"synonyms":["PTSS (often used for “post-traumatic stress symptoms”)"],"phonetic":"/ˌpiː tiː tiː ˈɛs/","extraExplanation":["“PTTS”不是非常通用的英文缩写，常见含义会因领域而变。若你告诉我它出现的场景（比如聊天、医疗报告、游戏、学校/公司文件），我可以更准确地判断它的全称与意思。"]}
{"word":"pty","summary":{"en":"“pty” is usually an abbreviation in company names meaning a privately held company (often “Pty Ltd”); less commonly it can mean “party” in casual notes.","zh":"“pty”通常是公司名称中的缩写，表示私人持有的公司（常见于“Pty Ltd”）；较少情况下也可在随手写法中表示“party（聚会）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Used in some countries (especially Australia and South Africa) in company names to mean “Proprietary,” indicating a privately held company (often seen as “Pty Ltd”).","zh":"（缩写）常见于公司名称中（尤其在澳大利亚、南非），表示“Proprietary（私人/非上市）”，通常以“Pty Ltd”出现，指私人有限公司。"},"examples":[{"en":"She works for GreenLeaf Pty Ltd in Sydney.","zh":"她在悉尼的 GreenLeaf Pty Ltd 工作。"},{"en":"The contract was signed by Horizon Pty Ltd.","zh":"合同由 Horizon Pty Ltd 签署。"}]},{"partOfSpeech":"other","definition":{"en":"(informal abbrev., less common) Short for “party” in notes or casual writing.","zh":"（非正式缩写，较少见）在随手记或口语化写法中可作“party（聚会）”的简写。"},"examples":[{"en":"Pty at my place on Friday.","zh":"周五来我家聚会（Pty）。"},{"en":"Are you going to the office pty?","zh":"你要去公司的聚会吗？"}]}],"synonyms":["Pty Ltd (related form)","Ltd (similar function in other systems)"],"phonetic":"/ˌpiː tiː ˈwaɪ/","extraExplanation":["“Pty”最常见、最正式的用法是公司法语境中的缩写，常与“Ltd”连用（Pty Ltd）。不同国家的公司类型缩写不同：美国常见 Inc. / LLC；英国常见 Ltd；澳大利亚/南非常见 Pty Ltd。","在公司名里，“Pty”通常不需要翻译成一个固定中文词，可按语境理解为“私人有限公司/非上市公司”。"]}
{"word":"ptyalagogic","summary":{"en":"Ptyalagogic means “saliva-stimulating”—something that makes you produce more saliva.","zh":"ptyalagogic 意为“催涎的/促唾液分泌的”，指会让人分泌更多唾液的东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing or increasing the flow of saliva; salivary-stimulating","zh":"引起或增加唾液分泌的；催涎的"},"examples":[{"en":"Sour candies can have a ptyalagogic effect and make your mouth water.","zh":"酸味糖果可能有催涎作用，让你口水直流。"},{"en":"The doctor noted that the medication was mildly ptyalagogic.","zh":"医生指出这种药物有轻微的催涎作用。"}]}],"synonyms":["saliva-stimulating","sialagogic","salivary"],"phonetic":"/ˌtaɪəˈlæɡɑːdʒɪk/","extraExplanation":["这是一个很少见、偏医学/语言学词汇的形容词，来自希腊语词根：ptyal-（唾液）+ -agogic（引出、促使）。日常英语里更常用的说法是“saliva‑stimulating / makes you salivate（让人流口水）”。","相关名词是“ptyalagogue”（催涎剂、促唾液分泌的药物或物质）。"]}
{"word":"ptyalagogue","summary":{"en":"A ptyalagogue is something that stimulates saliva production.","zh":"ptyalagogue 指能促进唾液分泌的物质或药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or medicine that increases the flow of saliva; a salivary stimulant","zh":"（药物/物质）促唾液分泌剂；催涎剂"},"examples":[{"en":"The dentist prescribed a ptyalagogue to help relieve dry mouth.","zh":"牙医开了一种催涎剂来帮助缓解口干。"},{"en":"Some sour candies can act as a mild ptyalagogue.","zh":"一些酸味糖果可能起到轻微的促唾液分泌作用。"}]}],"synonyms":["sialogogue","saliva stimulant","salivary stimulant"],"phonetic":"/ˌtaɪəˈlæɡoʊɡ/","extraExplanation":["这是一个较少见、偏医学/药学的词。词根 ptyalo- 来自希腊语，意思是“唾液”；后缀 -agogue 表示“引出、促使产生”。因此 ptyalagogue 字面意思就是“促使（唾液）产生的东西”。","在现代日常英语里，更常见的说法是 “saliva stimulant” 或 “sialogogue（催涎剂）”；ptyalagogue 多见于较旧或更专业的文献。"]}
{"word":"ptyalectases","summary":{"en":"Ptyalectases are abnormal dilations of salivary ducts/glands (plural form).","zh":"ptyalectases 指唾液腺导管或唾液腺的异常扩张（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ptyalectasis: an abnormal widening (dilation) of salivary ducts or salivary glands.","zh":"ptyalectasis 的复数：唾液腺导管或唾液腺的异常扩张（扩张症）。"},"examples":[{"en":"The radiology report mentioned ptyalectases in both parotid glands.","zh":"影像报告提到两侧腮腺出现 ptyalectases（导管/腺体扩张）。"},{"en":"In some chronic inflammatory conditions, ptyalectases can be seen on imaging.","zh":"在一些慢性炎症情况下，影像检查可能看到 ptyalectases。"}]}],"synonyms":["sialectases","salivary duct ectasia","sialodochiectasia"],"phonetic":"ˌtaɪəˈlɛktəsiz","extraExplanation":["这是非常偏医学、且相对少见的词，多用于影像学或病理学语境。日常英语几乎不会用到。","词源可拆解为：ptyalo-（与唾液/唾液腺有关）+ -ectasis（扩张）。临床上更常见的相关词是 sialectasis（同样指唾液导管扩张）。","注意拼写：单数是 ptyalectasis，复数是 ptyalectases（结尾 -ses 常读作 /-siz/）。"]}
{"word":"ptyalectasis","summary":{"en":"Ptyalectasis means dilation of a salivary duct.","zh":"ptyalectasis 指唾液腺导管的扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"abnormal widening (dilation) of a salivary gland duct (a tube that carries saliva).","zh":"唾液腺导管的异常扩张（导管变宽）。"},"examples":[{"en":"The imaging report mentioned ptyalectasis in the submandibular duct.","zh":"影像报告提到颌下腺导管出现唾液导管扩张（ptyalectasis）。"},{"en":"Ptyalectasis can be associated with blockage or chronic inflammation of the salivary glands.","zh":"唾液导管扩张可能与阻塞或唾液腺的慢性炎症有关。"}]}],"synonyms":["salivary duct dilatation","duct ectasia"],"phonetic":"/ˌtaɪəˈlɛktəsɪs/","extraExplanation":["这是一个较少见的医学术语，多见于影像学或病理学描述。词源可拆解为：ptyal-（与“唾液”有关，源自希腊语）+ -ectasis（“扩张、膨大”）。","与它相关、你更常在临床文本中看到的近义表达包括：salivary duct dilatation（唾液导管扩张）或 duct ectasia（导管扩张）。"]}
{"word":"ptyalin","summary":{"en":"Ptyalin is salivary amylase, an enzyme in saliva that begins starch digestion in the mouth.","zh":"Ptyalin 指唾液淀粉酶，是唾液中的一种酶，在口腔中开始分解淀粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme in saliva (salivary amylase) that begins the digestion of starch by breaking it into simpler sugars.","zh":"唾液中的一种酶（唾液淀粉酶），能把淀粉分解成更简单的糖类，从而开始淀粉的消化过程。"},"examples":[{"en":"Ptyalin starts breaking down starch while food is still in your mouth.","zh":"食物还在口腔里时，ptyalin 就开始分解淀粉。"},{"en":"Chewing well helps ptyalin mix with food and begin digestion.","zh":"充分咀嚼能让 ptyalin 更好地与食物混合并启动消化。"}]}],"synonyms":["salivary amylase","amylase"],"phonetic":"/ˈtaɪəlɪn/","extraExplanation":["“ptyalin”是较旧的术语，现代生物学/医学写作中更常用“salivary amylase（唾液淀粉酶）”。","词源来自希腊语 ptyalon（唾液），因此拼写里有不常见的“pty-”开头。"]}
{"word":"ptyalins","summary":{"en":"Ptyalins are salivary enzymes (salivary amylase) that begin starch digestion in the mouth.","zh":"Ptyalins 指唾液中的酶（唾液淀粉酶），在口腔中开始消化淀粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of ptyalin) An enzyme in saliva (salivary amylase) that begins the digestion of starch into sugars in the mouth.","zh":"（ptyalin 的复数）唾液中的一种酶（唾液淀粉酶），在口腔中开始把淀粉分解成糖。"},"examples":[{"en":"Ptyalins start breaking down starchy foods as soon as you chew.","zh":"你一咀嚼，ptyalins 就开始分解含淀粉的食物。"},{"en":"Because her saliva production was low, the action of ptyalins was reduced.","zh":"因为她唾液分泌较少，ptyalins 的作用就减弱了。"}]}],"synonyms":["salivary amylase","amylase (in saliva)","ptyalin"],"phonetic":"/ˈtaɪəlɪnz/","extraExplanation":["“ptyalin”较常见于生理学/医学语境，日常英语里更常说“salivary amylase（唾液淀粉酶）”。","词源来自希腊语，和“唾液”有关；这个词在现代科普或课堂材料中有时会出现，但在临床沟通中不如“amylase”常用。"]}
{"word":"ptyalism","summary":{"en":"Ptyalism means excessive saliva or abnormal drooling (a medical term).","zh":"ptyalism 指唾液分泌过多或异常流口水（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive production of saliva; unusual drooling.","zh":"唾液分泌过多；异常流口水。"},"examples":[{"en":"The dentist noted mild ptyalism after the procedure.","zh":"牙医注意到手术后有轻度唾液分泌过多。"},{"en":"Some medicines can cause ptyalism as a side effect.","zh":"有些药物可能会以唾液分泌过多作为副作用。"}]}],"synonyms":["drooling","hypersalivation","sialorrhea"],"phonetic":"/ˈtaɪəˌlɪzəm/","extraExplanation":["“ptyalism”是医学用语，较正式；日常英语更常说“drooling（流口水）”或“excess saliva（唾液过多）”。","词源来自希腊语“ptyalon（唾液）”。常见相关情境包括：怀孕早期（有时会出现唾液增多）、某些药物副作用、口腔或神经系统问题等。若症状明显或伴随吞咽困难、口腔疼痛等，应咨询专业医生。"]}
{"word":"ptyalisms","summary":{"en":"“Ptyalism(s)” means excessive salivation (too much saliva).","zh":"“ptyalism(s)”指唾液分泌过多（流涎增多）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive production of saliva; abnormal salivation (often leading to drooling).","zh":"唾液分泌过多；异常流涎（常导致流口水）。"},"examples":[{"en":"Some medications can cause ptyalism as a side effect.","zh":"有些药物可能会引起唾液分泌过多作为副作用。"},{"en":"During early pregnancy, she experienced ptyalism and needed to sip water often.","zh":"怀孕早期，她出现流涎增多，经常需要小口喝水。"}]}],"synonyms":["excessive salivation","hypersalivation","drooling","sialorrhea"],"phonetic":"/ˈtaɪəˌlɪzəm/","extraExplanation":["“ptyalism(s)”是医学用语，日常英语更常说“drooling”（流口水）或“excessive salivation”（唾液过多）。","词源来自希腊语“ptyalon”（唾液）。","在医学语境中，它可能与怀孕（如妊娠早期）、胃食管反流、某些药物、口腔刺激、或中毒等因素相关；若症状明显，通常建议就医评估原因。"]}
{"word":"ptyalize","summary":{"en":"“Ptyalize” means to secrete saliva (to salivate), mainly in medical or formal contexts.","zh":"“ptyalize”指分泌唾液/流口水，多见于医学或正式语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to produce or secrete saliva; to salivate (often used in medical or formal writing).","zh":"分泌唾液；流口水（多用于医学或正式语境）。"},"examples":[{"en":"Some medications can ptyalize patients and make swallowing uncomfortable.","zh":"某些药物会让病人分泌大量唾液，导致吞咽不适。"},{"en":"The smell of food made him ptyalize.","zh":"食物的气味让他开始流口水。"}]}],"synonyms":["salivate","drool"],"phonetic":"/ˈtaɪəˌlaɪz/","extraExplanation":["“ptyalize”是比较少见、偏医学/书面语的词；日常英语更常说“salivate”或“drool”。","词源来自希腊语“ptyalon”（唾液）。因为开头的“pt-”组合在英语里不常见，读音里通常不发 /p/，类似“pterodactyl”（翼手龙）里开头的 p 也常不发音。"]}
{"word":"ptyalized","summary":{"en":"“Ptyalized” is a rare medical word meaning “mixed with saliva,” often describing food after chewing.","zh":"“ptyalized”是较少见的医学用词，意思是“与唾液混合/被唾液润湿”，常用来描述咀嚼后的食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Mixed with saliva; made moist or softened by saliva, usually during chewing.","zh":"（医学/较少用）被唾液浸润的；与唾液混合的；在咀嚼时被唾液润湿、软化的。"},"examples":[{"en":"Proper digestion begins when food is well ptyalized before swallowing.","zh":"良好的消化从食物在吞咽前被充分“唾液化”（充分与唾液混合）开始。"},{"en":"The nurse noted that the patient’s food was not adequately ptyalized, suggesting he was swallowing too quickly.","zh":"护士记录到病人的食物没有充分与唾液混合，提示他吞咽得太快。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of ptyalize: to mix with saliva; to salivate (onto).","zh":"ptyalize 的过去式/过去分词：使与唾液混合；（向……）分泌唾液。"},"examples":[{"en":"He ptyalized the mouthful and then swallowed.","zh":"他把这一口充分与唾液混合后才吞下。"}]}],"synonyms":["salivated","insalivated","mixed with saliva"],"phonetic":"/ˈtaɪəˌlaɪzd/","extraExplanation":["“ptyal-”词根来自希腊语，和“唾液/唾液分泌”有关（可联想到医学词 ptyalism，指流涎/唾液分泌过多）。","这个词在日常英语中非常少见，更常用的表达是“mixed with saliva / salivated / well-chewed”。在英式拼写中也可能见到 ptyalised。"]}
{"word":"ptyalizing","summary":{"en":"Ptyalizing means mixing something (especially food) with saliva, usually while chewing.","zh":"ptyalizing 指（尤其是食物在咀嚼时）与唾液混合、被唾液润湿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"mixing food with saliva; salivating on or moistening with saliva (usually during chewing and digestion).","zh":"用唾液与食物混合；（通常指咀嚼、消化时）用唾液润湿或使其带有唾液。"},"examples":[{"en":"Chewing slowly helps with ptyalizing the food before swallowing.","zh":"慢慢咀嚼有助于在吞咽前让食物充分与唾液混合。"},{"en":"In digestion, enzymes in saliva begin working while the food is ptyalizing in the mouth.","zh":"在消化过程中，食物在口中与唾液混合时，唾液中的酶就开始起作用。"}]},{"partOfSpeech":"v.","definition":{"en":"the act or process of mixing with saliva (present participle of “ptyalize”).","zh":"用唾液混合的行为或过程（“ptyalize”的现在分词）。"},"examples":[{"en":"The textbook describes ptyalizing as an early step in digestion.","zh":"教材把“唾液混合”描述为消化的早期步骤之一。"}]}],"synonyms":["salivating","moistening with saliva","insalivating"],"phonetic":"/ˈtaɪəlaɪzɪŋ/","extraExplanation":["这个词非常少见，多见于医学、生理学或较正式的科普写作。日常英语里通常直接说 “mixing with saliva / salivating / moistening (food) with saliva”，或用更常见的表达如 “chewing and salivating”。","词源来自希腊语词根 ptyal-，与“唾液”有关；同一词根也出现在 ptyalin（唾液淀粉酶）等术语中。"]}
{"word":"ptyalocele","summary":{"en":"A rare medical term for a saliva-filled cyst-like swelling involving a salivary gland/duct.","zh":"一个较少见的医学术语，指与唾液腺/导管相关、含唾液的囊样肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A cyst-like swelling or herniation involving a salivary gland or salivary duct, usually filled with saliva.","zh":"（医学）与唾液腺或唾液导管有关的囊样肿胀/疝出，通常内含唾液。"},"examples":[{"en":"The surgeon suspected a ptyalocele after noticing a soft, fluctuant swelling near the salivary duct.","zh":"外科医生看到唾液导管附近柔软、波动感的肿块后，怀疑是唾液囊肿（ptyalocele）。"},{"en":"Imaging helped distinguish a ptyalocele from an abscess.","zh":"影像检查帮助区分唾液囊肿（ptyalocele）与脓肿。"}]}],"synonyms":["sialocele","salivary cyst"],"phonetic":"/ˌtaɪəloʊˈsiːl/","extraExplanation":["这个词非常少见，多见于医学/解剖学语境；临床上更常用的近义词是 sialocele（唾液囊肿），其中 sialo- 也表示“唾液”。","词源上 ptyalo- 来自希腊语，表示“唾液”；-cele 表示“疝/囊状突出”（也见于 hydrocele 等词）。"]}
{"word":"ptyalogenic","summary":{"en":"Ptyalogenic means “causing or producing saliva,” a rare medical adjective.","zh":"ptyalogenic 指“引起或促进唾液分泌的（催涎的）”，是较罕见的医学形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Causing or producing saliva; salivation-inducing.","zh":"（医学）引起或促进唾液分泌的；催涎的。"},"examples":[{"en":"Some medications can have a ptyalogenic effect, leading to excessive drooling.","zh":"一些药物可能具有催涎作用，导致流口水增多。"},{"en":"The dentist avoided strongly ptyalogenic flavors during the procedure.","zh":"牙医在操作过程中避免使用强烈的催涎味道。"}]}],"synonyms":["sialagogic","sialagogue (related noun)","salivation-inducing"],"phonetic":"/ˌtaɪ.ə.ləˈdʒɛn.ɪk/","extraExplanation":["这个词非常少见，临床或论文里更常用的是 hypersalivation（唾液过多）或 sialagogue / sialogogue（促唾液分泌剂，名词）。","词源上可拆为 ptyalo-（唾液）+ -genic（产生……的）。因此字面意思就是“产生唾液的/引起流涎的”。","如果你想表达“致病的”，常见词是 pathogenic；表达“致热的”是 pyrogenic；表达“植物来源/植物促生的”是 phytogenic。你输入的 ptyalogenic 可能也会被误拼为这些常见词。"]}
{"word":"ptyalolith","summary":{"en":"A ptyalolith is a salivary stone formed in a salivary gland or duct.","zh":"ptyalolith 指在唾液腺或唾液管内形成的唾液结石（唾石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small stone (calculus) that forms in a salivary gland or its duct, which can block saliva flow and cause pain or swelling (a type of salivary stone).","zh":"（唾液腺或唾液管内形成的）唾液结石/唾石，可阻塞唾液流出并引起疼痛或肿胀。"},"examples":[{"en":"The doctor suspected a ptyalolith because the swelling got worse during meals.","zh":"医生怀疑是唾石，因为肿胀在吃饭时更明显。"},{"en":"An ultrasound can help detect a ptyalolith in the salivary duct.","zh":"超声检查可以帮助发现唾液管内的唾石。"},{"en":"Warm compresses and hydration may help a small ptyalolith pass on its own.","zh":"热敷和补充水分可能有助于较小的唾石自行排出。"}]}],"synonyms":["sialolith","salivary stone","salivary calculus"],"phonetic":"/ˌtaɪ.əˈlɑː.lɪθ/","extraExplanation":["这个词较少见，临床上更常用的说法是 **sialolith**（唾液结石），相关疾病称 **sialolithiasis**（唾液结石症）。","词源可拆解为：**ptyalo-**（唾液）+ **-lith**（石头），与 **lith** 相关的词还有 *kidney stone (renal calculus)*、*gallstone* 等。","常见症状包括：进食时疼痛或腮腺/颌下腺肿胀（因为吃东西会刺激分泌唾液，但被“石头”堵住）。严重或反复者可能需要口腔科/耳鼻喉科处理。"]}
{"word":"ptyalolithiasis","summary":{"en":"A rare medical term meaning salivary stone disease (similar to sialolithiasis).","zh":"较少见的医学术语，指唾液腺/唾液管结石（类似 sialolithiasis）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The formation or presence of salivary stones (calculi), usually in the salivary glands or ducts; a rare technical term similar to sialolithiasis.","zh":"（医学）唾液结石（唾石）的形成或存在，通常发生在唾液腺或唾液管内；较少见的专业用语，含义接近 sialolithiasis（唾液腺结石症）。"},"examples":[{"en":"The dentist suspected ptyalolithiasis because the patient had pain and swelling when eating.","zh":"牙医因患者在进食时出现疼痛和肿胀而怀疑是唾液结石（ptyalolithiasis）。"},{"en":"Imaging was ordered to rule out ptyalolithiasis in the submandibular duct.","zh":"医生安排影像检查，以排除/确认颌下腺导管的唾液结石（ptyalolithiasis）。"}]}],"synonyms":["sialolithiasis","salivary stone disease"],"phonetic":"/ˌtaɪəloʊlɪˈθaɪəsɪs/","extraExplanation":["词根拆解：ptyalo- 表示“唾液”，-lith- 表示“石/结石”，-iasis 表示“疾病状态/病症”。因此字面意思就是“唾液结石病”。","该词在现代临床英语里不如 sialolithiasis（更常用）常见；读到它时通常可直接理解为“唾液腺/唾液管结石”。","常见相关症状在英文里会写作 pain/swelling with meals（进食时疼痛/肿胀），因为唾液分泌增加会使阻塞更明显。"]}
{"word":"ptyalorrhea","summary":{"en":"Ptyalorrhea is the medical term for excessive salivation or drooling.","zh":"ptyalorrhea 是“流涎过多/唾液分泌过多”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive production or flow of saliva; abnormal drooling.","zh":"流涎过多；唾液分泌或外流异常增多（口水过多）。"},"examples":[{"en":"The dentist noted ptyalorrhea during the exam and asked about new medications.","zh":"牙医在检查时注意到患者流涎过多，并询问是否最近开始服用新药。"},{"en":"Ptyalorrhea can make speaking and swallowing uncomfortable.","zh":"流涎过多可能让说话和吞咽变得不舒服。"}]}],"synonyms":["sialorrhea","hypersalivation","drooling"],"phonetic":"/ˌtaɪəˈlɔːriə/","extraExplanation":["词源：ptyalo- 来自希腊语，意为“唾液”，-rrhea 表示“流出/流动”（同类词如 diarrhea“腹泻”）。","医学语境中更常见的近义词是 sialorrhea（也指“流涎过多”）；在日常英语里更常说 drooling（流口水），但 drooling 语气更口语，也可用于“垂涎/着迷”。","常见诱因包括某些药物副作用、口腔/咽喉刺激、神经系统疾病或吞咽功能受影响等；这是症状名，不一定指单一疾病。"]}
{"word":"ptychoparia","summary":{"en":"Ptychoparia is a scientific name for a genus of Cambrian trilobite fossils.","zh":"Ptychoparia 是寒武纪三叶虫化石的一个属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct trilobites (marine arthropods) that lived in the Cambrian Period, known from fossil remains.","zh":"（古生物）一种已灭绝的三叶虫属（海生节肢动物），生存于寒武纪，主要以化石遗骸为人所知。"},"examples":[{"en":"The museum’s Cambrian display includes a fossil labeled Ptychoparia.","zh":"博物馆的寒武纪展区里有一件标注为 Ptychoparia 的化石。"},{"en":"Researchers compared Ptychoparia specimens to understand early trilobite evolution.","zh":"研究人员比较了 Ptychoparia 的标本，以了解早期三叶虫的演化。"}]}],"synonyms":["trilobite genus","Cambrian trilobite"],"phonetic":"/ˌtɪkəˈpɛriə/","extraExplanation":["这是古生物学中的拉丁化学名（属名），通常用于论文、展品标签和分类讨论中。日常英语里很少用到，更多出现在“trilobite（三叶虫）”“Cambrian（寒武纪）”“fossil（化石）”等语境。","读法在学术交流中可能略有差异，但常见的英语读法接近“tik-uh-PAIR-ee-uh”。"]}
{"word":"ptychoparid","summary":{"en":"A ptychoparid is an extinct trilobite, especially one in the group Ptychopariida.","zh":"ptychoparid 指已灭绝的三叶虫，尤指褶颊目（Ptychopariida）类群的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of extinct marine arthropod (a trilobite), especially one belonging to the group Ptychopariida, common in Cambrian fossils.","zh":"一种已灭绝的海洋节肢动物（三叶虫），尤指属于“褶颊目（Ptychopariida）”类群的三叶虫，常见于寒武纪化石中。"},"examples":[{"en":"The museum displayed a ptychoparid trilobite from Cambrian rocks.","zh":"博物馆展出了一件来自寒武纪岩层的褶颊目三叶虫化石。"},{"en":"Researchers compared the ptychoparid’s head shield with other early trilobites.","zh":"研究人员将这种褶颊目三叶虫的头甲与其他早期三叶虫作比较。"}]}],"synonyms":["ptychopariid","trilobite (general term)"],"phonetic":"/ˌtɪkoʊˈpærɪd/","extraExplanation":["“ptychoparid”来自科学分类用语：Ptychopariida（褶颊目）+ 后缀 -id（表示“……类的成员”）。在古生物学文章里，常用它指“褶颊目三叶虫的成员/化石”。","三叶虫是古生代常见的海洋动物，尤其在寒武纪化石中数量多、种类丰富，因此常作为地层与古生态研究的材料。"]}
{"word":"ptychopariid","summary":{"en":"A ptychopariid is a trilobite (or a feature) belonging to the group Ptychopariida, especially common in Cambrian fossils.","zh":"ptychopariid 指褶颊三叶虫目（Ptychopariida）的三叶虫（或其相关特征），常见于寒武纪化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trilobite belonging to the group (order) Ptychopariida, common especially in the Cambrian period","zh":"（古生物）ptychopariid：指属于“褶颊三叶虫目（Ptychopariida）”的三叶虫，尤以寒武纪常见"},"examples":[{"en":"The fossil bed contains several ptychopariids and other Cambrian trilobites.","zh":"这个化石层含有几种褶颊三叶虫目成员（ptychopariids）以及其他寒武纪三叶虫。"},{"en":"Ptychopariids are often used to help date Cambrian rock layers.","zh":"ptychopariids 常被用来辅助测定寒武纪地层的年代。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the trilobite group Ptychopariida","zh":"（古生物）与褶颊三叶虫目（Ptychopariida）有关的；具有其特征的"},"examples":[{"en":"The paper describes ptychopariid features of the cephalon (head shield).","zh":"这篇论文描述了头甲上具有褶颊三叶虫目特征（ptychopariid）的形态。"}]}],"synonyms":["ptychopariidan","ptychopariid trilobite","member of Ptychopariida"],"phonetic":"ˌtɪkoʊˈpærɪˌɪd","extraExplanation":["该词多见于英文学术写作（古生物学、地层学）。词尾 -id 常表示“属于某类/某群体的成员”（如 hominid），因此 ptychopariid 可理解为“属于 Ptychopariida 的（个体/成员）”。","Ptychopariida 是三叶虫（trilobite）的一个传统分类群，常与寒武纪海洋生态与地层对比研究相关。不同资料中也可能见到形近词 ptychopariidan（同义，常作形容词/名词）。"]}
{"word":"ptychopterygial","summary":{"en":"A rare scientific adjective meaning “related to a folded wing/fin structure.”","zh":"一个罕见的科学形容词，意为“与折叠的翅/鳍结构有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a folded wing/fin structure (especially in zoology/anatomy); pertaining to a “folded-fin/wing” region or feature.","zh":"（尤用于动物学/解剖学）与“折叠的翅/鳍”结构有关的；指与折叠鳍/翅部位或特征相关的。"},"examples":[{"en":"The paper describes a ptychopterygial fold near the base of the fin.","zh":"这篇论文描述了鳍基部附近的一个折叠鳍（ptychopterygial）褶皱。"},{"en":"Researchers compared ptychopterygial features across several fish species.","zh":"研究人员比较了多种鱼类之间的折叠鳍相关特征。"}]}],"synonyms":["pterygial","fin-related (general)","wing-related (general)"],"phonetic":"/ˌtɪkoʊpˈtɛrɪdʒiəl/","extraExplanation":["词源提示：ptycho- 来自希腊语，表示“折叠”；-pteryg- 来自希腊语 pteryx/pteryg-，表示“翅、翼、鳍”。因此 ptychopterygial 常见于生物学写作，用来描述“与折叠的翅/鳍结构相关”的特征。","使用场景：这是非常专业的学术词，通常出现在动物学、比较解剖学、形态学论文或标本描述中，日常英语几乎不用。"]}
{"word":"ptychopterygium","summary":{"en":"A rare scientific genus name used in biological taxonomy.","zh":"一个罕见的生物分类学属名（科学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) A scientific Latin genus name used for certain organisms; it is a highly technical term mainly seen in academic writing and species names.","zh":"（生物分类学）一个拉丁化的属名，用于某些生物的科学命名；非常专业，主要出现在学术文章和物种学名中。"},"examples":[{"en":"In the paper, the specimens were assigned to the genus Ptychopterygium based on wing structure.","zh":"在论文中，这些标本因其翅的结构而被归入Ptychopterygium属。"},{"en":"The database lists several species under Ptychopterygium.","zh":"数据库在Ptychopterygium属名下列出若干物种。"}]}],"phonetic":"/ˌtɪkɑp.təˈrɪdʒi.əm/","extraExplanation":["这是一个非常罕见的词，日常英语里几乎不会用到；多数情况下它以“属名”的身份出现，按惯例首字母要大写（Ptychopterygium），并常与物种名一起构成双名法学名（如：Ptychopterygium + species）。","词形来自希腊语词根：ptycho-（折叠、褶皱）+ pteryg-（翅膀），-ium 为常见的拉丁/希腊名词结尾；整体含义可理解为“折翅/褶翼”之类的描写性命名。"]}
{"word":"ptychosperma","summary":{"en":"Ptychosperma is a genus of tropical palms, sometimes grown as ornamental trees.","zh":"Ptychosperma 是一个热带棕榈植物属，部分种类常作观赏树栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical palm trees (family Arecaceae), native mainly to Australia, New Guinea, and nearby islands; some species are grown as ornamental landscape palms.","zh":"一种棕榈科的热带棕榈植物属（主要原生于澳大利亚、新几内亚及周边岛屿）；其中一些种被用作观赏园林植物。"},"examples":[{"en":"Ptychosperma palms are often planted in warm coastal gardens.","zh":"Ptychosperma 属的棕榈常被种在温暖的海滨花园里。"},{"en":"The label says Ptychosperma elegans, a popular ornamental palm.","zh":"标签写着 Ptychosperma elegans（优雅棕榈），是一种很受欢迎的观赏棕榈。"}]}],"synonyms":["(related) solitaire palm (for Ptychosperma elegans)"],"phonetic":"/ˌtaɪkoʊˈspɝmə/","extraExplanation":["这是一个拉丁化的植物学名称，书写时属名通常首字母大写并用斜体：*Ptychosperma*；若指某个具体物种，会写成“属名 + 种加词”，如 *Ptychosperma elegans*。","词源来自希腊语：*ptyche*（“褶皱、折叠”）+ *sperma*（“种子”），大意与“带褶皱/纹理的种子”有关。","日常英语里较少直接说 ptychosperma，更常在园艺、苗圃标签或植物学语境中出现；口语中人们往往用具体物种的俗名来称呼。"]}
{"word":"ptysmagogue","summary":{"en":"A ptysmagogue is something that makes you produce more saliva.","zh":"ptysmagogue 指“促使唾液分泌的东西（促唾液剂/催涎剂）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a medicine or herb) that stimulates the flow of saliva; a salivation-inducing agent","zh":"促唾液剂；催涎剂（促使唾液分泌的物质，常见于药物或草药）"},"examples":[{"en":"Sour candy can act as a mild ptysmagogue by making your mouth water.","zh":"酸味糖果可以作为一种轻度的促唾液剂，让人“口水直流”。"},{"en":"In dentistry, a ptysmagogue may be used to help patients who have dry mouth.","zh":"在牙科或口腔治疗中，促唾液剂有时用于帮助口干的患者。"}]}],"synonyms":["sialagogue","salivary stimulant"],"phonetic":"/ˌtɪzˈmæɡəɡ/","extraExplanation":["这个词非常少见，多用于医学或药学语境；日常英语更常说 **sialagogue**（同义词）或更简单的表达：**something that makes you salivate / makes your mouth water**（让你分泌唾液的东西）。","词源来自希腊语：**ptysma**（唾液）+ **-agogue**（“引导/促使……的东西”，也见于 *demagogue*）。","读写提示：开头的 **pt-** 在英语借词里通常不发 /p/（类似 *pterodactyl*），所以发音从 /t/ 开始更自然。"]}
{"word":"ptyxis","summary":{"en":"Ptyxis is a technical noun meaning “folding,” especially how a leaf is folded in the bud.","zh":"ptyxis 是一個偏技術性的名詞，意思是「摺疊」，尤其指葉子在芽中尚未展開時的摺疊方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) the way a leaf is folded or arranged in the bud before it opens.","zh":"（植物學）葉子在芽中尚未展開時的摺疊或排列方式。"},"examples":[{"en":"In some ferns, the ptyxis protects the young leaf as it develops.","zh":"在一些蕨類植物中，ptyxis 會保護正在發育的幼葉。"},{"en":"The textbook compares different types of ptyxis seen in budded leaves.","zh":"課本比較了帶芽葉片中可見的不同 ptyxis 類型。"}]},{"partOfSpeech":"n.","definition":{"en":"(General/technical) the act or pattern of folding (used in some scientific writing).","zh":"（一般／技術用法）摺疊的動作或摺疊的型式（見於部分科學文章）。"},"examples":[{"en":"The author uses ptyxis to describe repeated folding in the structure.","zh":"作者用 ptyxis 來描述結構中的反覆摺疊。"}]}],"synonyms":["folding","leaf folding","vernation"],"phonetic":"/ˈtɪk.sɪs/","extraExplanation":["「ptyxis」來自希臘語詞根，與「折疊、層疊」的意思相關；因為開頭有不發音的 p（pt-），所以讀音像「tiksis」。","在植物學裡，它常和「vernation（葉在芽中的排列）」一起出現：vernation 偏向“排列/方式”的大類概念，而 ptyxis 更聚焦在“摺疊”這件事本身。"]}

