{"word":"rc","summary":{"en":"“RC” is an abbreviation most commonly meaning remote control; it can also mean Roman Catholic or resistor–capacitor in electronics, depending on context.","zh":"“RC”是缩写，最常见指“遥控器”；也可能指“罗马天主教”或电子学中的“电阻-电容”，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) remote control (a handheld device used to control a TV, air conditioner, etc. from a distance).","zh":"（缩写）遥控器（用来远距离控制电视、空调等的手持设备）。"},"examples":[{"en":"I can’t find the RC for the TV.","zh":"我找不到电视的遥控器（RC）了。"},{"en":"Use the RC to turn down the volume.","zh":"用遥控器（RC）把音量调小。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Roman Catholic (relating to the Catholic Church).","zh":"（缩写）罗马天主教的；天主教徒。"},"examples":[{"en":"He was raised in an RC family.","zh":"他在天主教（RC）家庭中长大。"},{"en":"The school has an RC tradition.","zh":"这所学校有天主教（RC）的传统。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) resistor–capacitor (an electronics term for circuits that use a resistor and a capacitor together, often for timing or filtering).","zh":"（缩写）电阻-电容（电子学术语，指电阻与电容组合的电路，常用于定时或滤波）。"},"examples":[{"en":"This RC circuit creates a short delay.","zh":"这个RC电路会产生一个短延迟。"},{"en":"We measured the RC time constant in lab.","zh":"我们在实验中测了RC时间常数。"}]}],"synonyms":["remote control (for meaning 1)","Catholic (for meaning 2)","R-C (electronics, for meaning 3)"],"phonetic":"/ˌɑrˈsi/","extraExplanation":["“RC/rc”通常是缩写，具体意思要看语境：家电场景最常见是remote control；宗教/学校背景里可能是Roman Catholic；理工科文本里常见是resistor–capacitor。","写作中如果担心读者不懂，第一次出现常会先写全称（remote control/ Roman Catholic/ resistor–capacitor），后面再用RC。"]}
{"word":"rcd","summary":{"en":"RCD most commonly means a residual current device—an electrical safety switch that trips when it detects current leakage; it can also mean “record” in some computing contexts.","zh":"RCD最常指漏电保护装置（检测到漏电会跳闸断电的安全开关）；在某些计算机语境中也可指“记录（record）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) residual current device: a safety switch that cuts off electricity when it detects a dangerous current leak (often used for shock protection).","zh":"（缩写）RCD：漏电保护装置/漏电断路器；检测到漏电等危险电流时会自动断电，用于防触电。"},"examples":[{"en":"The electrician installed an RCD to protect the bathroom circuit.","zh":"电工安装了一个RCD来保护浴室线路。"},{"en":"If the RCD keeps tripping, there may be a fault in an appliance.","zh":"如果RCD总是跳闸，可能是某个电器有故障。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) record (a stored set of information), especially in computing or databases.","zh":"（缩写）记录；尤指计算机/数据库中的一条数据记录。"},"examples":[{"en":"Create a new RCD for each customer in the database.","zh":"在数据库中为每位客户创建一条新记录（RCD）。"},{"en":"This RCD contains the user’s ID and login time.","zh":"这条记录（RCD）包含用户ID和登录时间。"}]}],"synonyms":["(residual current device) safety switch","(residual current device) circuit breaker","(residual current device, US equivalent) GFCI","(record) entry"],"phonetic":"ˌɑr siː ˈdiː","extraExplanation":["在电气领域，RCD在英式/欧式标准中非常常见（例如英国、澳大利亚、新西兰）。在北美更常见的相关术语是GFCI（Ground Fault Circuit Interrupter，接地故障断路器），功能类似。","“RCD”作为“record（记录）”的缩写在不同公司/系统里并不统一；如果你是在某个软件、表格或课件里看到的，最好结合上下文确认具体指什么。"]}
{"word":"rce","summary":{"en":"RCE most commonly means “Remote Code Execution,” a serious security vulnerability that lets attackers run code on a target system remotely.","zh":"RCE 最常见指“远程代码执行”，一种严重的安全漏洞，可让攻击者远程在目标系统上运行代码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(cybersecurity) Remote Code Execution: a type of security flaw that lets an attacker run commands or software on another computer/server from a distance, often without permission.","zh":"（网络安全）远程代码执行：一种安全漏洞，攻击者可以在远处未经授权地在目标电脑/服务器上运行命令或程序。"},"examples":[{"en":"The team patched an RCE vulnerability in the web server.","zh":"团队修补了该 Web 服务器中的一个 RCE 漏洞。"},{"en":"If exploited, the RCE could allow attackers to take control of the system.","zh":"如果被利用，这个 RCE 可能让攻击者控制整个系统。"},{"en":"We scanned our software dependencies for known RCE issues.","zh":"我们扫描了软件依赖项，查找已知的 RCE 问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(general) An abbreviation whose meaning depends on context; often used as initials for organizations, programs, or titles.","zh":"（一般）一个需结合语境理解的缩写；常作为机构、项目或头衔的首字母缩写。"},"examples":[{"en":"What does RCE stand for in this document?","zh":"在这份文件里，RCE 代表什么？"},{"en":"RCE can mean different things in different fields.","zh":"RCE 在不同领域可能有不同含义。"}]}],"synonyms":["remote code execution","code execution vulnerability","RCE vulnerability"],"phonetic":"ˌɑr si ˈi","extraExplanation":["在技术文章里，RCE（Remote Code Execution）通常被认为是非常严重的漏洞类型之一，因为它可能让攻击者直接在目标机器上“执行代码/命令”。常见触发点包括输入校验不严、反序列化漏洞、命令注入、模板注入等。","读到缩写时，最好看它第一次出现处是否有全称（例如“Remote Code Execution (RCE)”）。如果你能告诉我你看到“rce”的句子/领域（例如网络安全、学校课程、机构名称），我也可以给出更精准的释义。"]}
{"word":"RCEP","summary":{"en":"RCEP is a major Asia-Pacific trade agreement that promotes easier trade and economic cooperation among its members.","zh":"RCEP 是亚太地区的重要贸易协定，推动成员之间更便利的贸易与经济合作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Regional Comprehensive Economic Partnership: a large free trade agreement among many Asia-Pacific countries, designed to reduce trade barriers and strengthen economic cooperation.","zh":"《区域全面经济伙伴关系协定》：亚太地区多个国家之间的大型自由贸易协定，旨在降低贸易壁垒并加强经济合作。"},"examples":[{"en":"RCEP aims to make trade among member countries easier through common rules.","zh":"RCEP 旨在通过统一规则，让成员国之间的贸易更便利。"},{"en":"Some companies changed their supply chains to benefit from RCEP tariff reductions.","zh":"一些公司为了利用 RCEP 的关税下降，调整了供应链。"}]}],"synonyms":["Regional Comprehensive Economic Partnership","trade pact","free trade agreement (FTA)"],"phonetic":"/ˌɑr si i ˈpi/","extraExplanation":["读法与用法：RCEP 是缩写，英语里常读作每个字母（R-C-E-P）。在写作中第一次出现时通常先写全称“Regional Comprehensive Economic Partnership (RCEP)”，后文再用 RCEP。","背景要点：RCEP 于 2020 年签署，覆盖东盟十国以及中国、日本、韩国、澳大利亚、新西兰等（最初也包括印度谈判但未加入）。其影响常被讨论在关税、原产地规则、区域供应链整合等话题中。","相关表达：free trade agreement (FTA)（自由贸易协定）；tariff reduction（关税削减）；rules of origin（原产地规则）；member economies/countries（成员经济体/国家）。"]}
{"word":"rchauff","summary":{"en":"“rchauff” doesn’t match a standard English word; it may be a typo or incomplete. Please provide the intended spelling or a sentence context.","zh":"“rchauff”不像标准英文单词，可能是拼写错误或未输入完整。请提供正确拼写或句子语境。"},"phonetic":"N/A","extraExplanation":["“rchauff”看起来不像是一个常见的英文单词、缩写或固定短语，可能是拼写错误或不完整的输入。","你可以告诉我：1）你想查的完整单词/短语；或 2）它出现的句子/上下文；或 3）你是不是想输入“chauffeur（司机）”“rechauffé（法语借词，指‘改写/再加工的作品或重炒冷饭’）”之类的词？我可以据此帮你确认并解释。"]}
{"word":"rchitect","summary":{"en":"An architect designs buildings or is the planner/creator of an important idea or system.","zh":"architect 指“建筑师”，也可指某项重要计划或系统的“策划者/缔造者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who designs buildings and often supervises their construction.","zh":"建筑师；负责设计建筑物并常常监督施工的人。"},"examples":[{"en":"She wants to become an architect and design schools.","zh":"她想成为一名建筑师，设计学校。"},{"en":"The architect presented the new museum plan to the city.","zh":"建筑师向城市展示了新博物馆的设计方案。"}]},{"partOfSpeech":"n.","definition":{"en":"The person who plans or creates something important (often used as “the architect of …”).","zh":"某事的策划者／缔造者（常用作“……的缔造者/幕后推手”）。"},"examples":[{"en":"She was the architect of the company’s growth strategy.","zh":"她是公司增长战略的主要策划者。"},{"en":"He is considered the architect of the peace agreement.","zh":"他被认为是和平协议的主要推动者。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan, design, or carefully arrange something.","zh":"策划；设计；精心安排（某事）。"},"examples":[{"en":"They architected a new system to improve customer service.","zh":"他们设计了一个新系统来改善客户服务。"},{"en":"The team architected the project from start to finish.","zh":"团队从头到尾规划了这个项目。"}]}],"synonyms":["designer","planner","creator","mastermind","builder"],"phonetic":"/ˈɑɹ.kəˌtɛkt/","extraExplanation":["你输入的“rchitect”很可能是拼写少了开头的字母 a，正确拼写是 “architect”。","“architect”既可指“建筑师”，也常比喻“某项计划/制度的缔造者”。在科技行业里，动词用法（architect a system）很常见，表示“规划系统架构”。"]}
{"word":"rclame","summary":{"en":"“Reclame” (often misspelled as “rclame”) is a rare word meaning “advertising/publicity,” and it can also mean “to promote.”","zh":"“reclame”（常被误拼为“rclame”）是个较少用的词，表示“广告/宣传”，也可作动词表示“宣传、推广”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Publicity or advertising; a piece of promotional writing meant to attract attention.","zh":"（较少用）宣传；广告；用于吸引注意的宣传文字/推广内容。"},"examples":[{"en":"The café relied on social media reclame to bring in new customers.","zh":"这家咖啡馆依靠社交媒体宣传来吸引新顾客。"},{"en":"In older texts, you may see the word “reclame” used for newspaper advertising.","zh":"在较旧的文本里，你可能会看到“reclame”用来指报纸广告。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To promote or publicize something.","zh":"（较少用）宣传；推广；为……做广告。"},"examples":[{"en":"The brand tried to reclame its new product with posters and short videos.","zh":"这个品牌用海报和短视频来宣传新产品。"}]}],"synonyms":["advertising","publicity","promotion","propaganda (context-dependent)"],"phonetic":"/rəˈklɑːm/","extraExplanation":["“rclame”看起来像拼写错误。英语里更常见的相关词是：\n- **reclame**（较少见，源自法语/荷兰语语境）：指“广告、宣传”。\n- **reclaim**（很常见）：意为“收回、重新获得；开垦（土地）”。\n如果你想查的是“reclaim”，告诉我语境/句子，我可以给你更准确的释义和用法。"]}
{"word":"rcn","summary":{"en":"“RCN” is an acronym with different meanings; commonly it refers to the UK’s Royal College of Nursing, but it can also refer to other organizations depending on context.","zh":"“RCN”是一个多义缩写；常见指英国皇家护理学院，但也可能指其他机构，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"RCN: Royal College of Nursing (a professional organization and trade union for nurses in the United Kingdom).","zh":"RCN：英国皇家护理学院（英国护士的专业组织与工会）。"},"examples":[{"en":"She contacted the RCN for advice about workplace rights.","zh":"她联系了RCN，咨询关于职场权益的建议。"},{"en":"The RCN published new guidance for nurses.","zh":"RCN发布了护士新指南。"}]},{"partOfSpeech":"other","definition":{"en":"RCN: Radio Caracas Nacional (a Venezuelan radio network; sometimes seen in media/history contexts).","zh":"RCN：委内瑞拉“加拉加斯国家电台”（常见于媒体或历史语境）。"},"examples":[{"en":"The documentary used audio archives from RCN.","zh":"这部纪录片使用了来自RCN的音频档案。"}]},{"partOfSpeech":"other","definition":{"en":"RCN: A general abbreviation that can vary by field (e.g., a company name, a network name, or a technical label). The intended meaning depends on context.","zh":"RCN：在不同领域含义不一的缩写（例如公司名、网络名或技术标签），具体含义需要看上下文。"},"examples":[{"en":"What does RCN stand for in this report?","zh":"在这份报告里RCN代表什么？"},{"en":"RCN appears as a label in the settings menu.","zh":"RCN在设置菜单里作为一个标签出现。"}]}],"synonyms":["initialism","acronym (general category)"],"phonetic":"/ɑr si ɛn/","extraExplanation":["“RCN”最常见的理解之一是英国的Royal College of Nursing，尤其在英国医疗、护理行业新闻与职场权益话题中经常出现。","因为缩写在不同国家与专业领域会重复使用，遇到“rcn/RCN”时，最好结合文本主题（医疗、媒体、科技、公司名等）判断。你也可以把出现RCN的完整句子发来，我可以帮你精准判读。"]}
{"word":"rcpt","summary":{"en":"“rcpt” is a common abbreviation for “receipt” (proof of payment or delivery).","zh":"“rcpt”常用作“receipt（收据/回执）”的缩写，表示付款或送达的凭证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation (esp. in accounting, shipping, or file names) for “receipt,” meaning proof that something was paid for or received.","zh":"“receipt（收据/回执）”的缩写（常见于会计、物流或文件名中），表示付款或收货的凭证。"},"examples":[{"en":"Please email the RCPT to our finance team for reimbursement.","zh":"请把收据（RCPT）发邮件给财务，以便报销。"},{"en":"Attach the rcpt.pdf when you submit your expense report.","zh":"提交报销单时请附上 rcpt.pdf（收据文件）。"},{"en":"The package is delivered—RCPT confirmed.","zh":"包裹已送达——回执（RCPT）已确认。"}]}],"synonyms":["receipt","proof of purchase","acknowledgment","delivery confirmation"],"phonetic":"/rɪˈsit/","extraExplanation":["“rcpt”多见于表格栏位、系统缩写、文件名（如 rcpt_2026-02-15.pdf）或票据打印信息中，属于非正式写法；正式英文写作里通常直接写 receipt。","在电子邮件/技术场景中，容易与“read receipt（阅读回执）”混用：read receipt 指对方是否打开邮件的回执，而 receipt 更常指付款或收货凭证。"]}
{"word":"rct","summary":{"en":"RCT usually means “randomized controlled trial,” a research study design used to test whether a treatment or program works.","zh":"RCT 通常指“随机对照试验”，是一种用来检验治疗或项目是否有效的研究设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “randomized controlled trial,” a scientific study where people are randomly put into groups (e.g., treatment vs. control) to test whether an intervention works","zh":"“randomized controlled trial（随机对照试验）”的缩写：一种科学研究方法，将参与者随机分组（如治疗组与对照组），用来检验某种干预是否有效"},"examples":[{"en":"The new medicine was tested in an RCT before it was approved.","zh":"这款新药在获批前经过了随机对照试验（RCT）测试。"},{"en":"RCTs are often used in medical research to compare a treatment with a placebo.","zh":"在医学研究中，RCT 常用于将治疗方法与安慰剂进行比较。"}]}],"synonyms":["randomized controlled trial","controlled trial","clinical trial (often, but not always, an RCT)"],"phonetic":"/ˌɑr siː ˈtiː/","extraExplanation":["RCT 在循证医学（evidence-based medicine）中非常常见，因为“随机分组”可以减少偏差，让结论更可靠。","常见写法：an RCT / RCTs；也可写作 R.C.T.，但现代学术写作更常省略句点。"]}
{"word":"rcvr","summary":{"en":"rcvr = informal abbreviation of receiver (device/receiving end, or football receiver).","zh":"rcvr = receiver 的非正式缩写（可指接收器/接收端，或美式橄榄球接球手）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal abbreviation of “receiver.” Common in texting, technical notes, and sports (especially American football).","zh":"“receiver（接收器/接收方/接球手）”的非正式缩写。常见于短信、技术记录与体育语境（尤其是美式橄榄球）。"},"examples":[{"en":"Can you check the rcvr settings on the radio?","zh":"你能检查一下无线电的 rcvr（接收器）设置吗？"},{"en":"He played as a rcvr in high school football.","zh":"他在高中美式橄榄球里打 rcvr（接球手）位置。"}]}],"synonyms":["receiver","rx (technical abbreviation for receiver)"],"phonetic":"/rɪˈsiːvər/","extraExplanation":["“rcvr”多见于空间有限或追求简写的场合（短信、表格、设备标签、工程记录）。正式写作里通常写全称“receiver”。","在美式橄榄球里，“rcvr”常指“(wide) receiver”，即主要负责接传球的球员；在通信/电子领域则多指“接收器/接收端”。"]}

