{"word":"reobject","summary":{"en":"“Reobject” means to object again, especially in formal or legal situations.","zh":"“Reobject”表示“再次反对/重新提出异议”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to object again; to raise an objection a second time (often in formal or legal contexts)","zh":"再次反对；重新提出异议（常用于正式或法律语境）"},"examples":[{"en":"If new evidence appears, the defense may reobject to the admission of the document.","zh":"如果出现新证据，辩方可能会再次反对该文件被采纳。"},{"en":"She reobjected when the meeting returned to the same proposal.","zh":"当会议回到同一个提案时，她再次提出反对。"}]}],"synonyms":["object again","renew an objection","raise an objection again","re-raise an objection"],"phonetic":"/ˌriːəbˈdʒɛkt/","extraExplanation":["“reobject”由前缀 re-（“再次、重新”）+ object（“反对”）构成，属于较少见的用法。日常英语里更常说 “object again” 或 “renew an objection”。","在法律或会议记录中，有时会看到类似表达，用来强调“之前已经反对过，现在再次提出异议”。"]}
{"word":"reobjected","summary":{"en":"“Reobjected” means “objected again” (rare).","zh":"“reobjected”意为“再次提出反对/异议”（较少用）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Past tense of “reobject”: to object again; to raise an objection again, often after new information or a repeated issue.","zh":"（罕见）“reobject”的过去式：再次提出反对；在新情况出现或问题重现时重新提出异议。"},"examples":[{"en":"When the witness changed their story, the defense reobjected to the question.","zh":"当证人改变说法时，辩方再次对这个问题提出异议。"},{"en":"I reobjected, because the same mistake kept happening in the report.","zh":"我再次表示反对，因为报告里同样的错误一直在发生。"}]}],"synonyms":["objected again","raised another objection","renewed an objection","protested again"],"phonetic":"/ˌriːəbˈdʒɛktɪd/","extraExplanation":["“reobjected”在现代英语里很少见，更常见的表达是“objected again / raised another objection”。在正式写作（尤其法律语境）里，有时会用“re-objected”（加连字符）来强调“再次提出反对”这个动作。","注意发音与含义：这里的核心词是动词“object”（提出异议），不是名词“object”（物体/对象）。"]}
{"word":"reobjecting","summary":{"en":"“Reobjecting” means objecting again (a rare form), especially in formal or legal contexts.","zh":"“reobjecting”指“再次反对/再次提出异议”（较少见），在正式或法律语境中更可能出现。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) objecting again; raising the same objection a second time, often after something changes or after a pause.","zh":"（不常用）再次反对；把同一个反对意见再提出一次，常见于情况变化或间隔一段时间后。"},"examples":[{"en":"After hearing the revised plan, she was reobjecting to the cost.","zh":"听完修订后的计划后，她再次反对费用问题。"},{"en":"The defense lawyer kept reobjecting when the witness repeated the same claim.","zh":"当证人反复说同一件事时，辩护律师不断再次提出异议。"}]}],"synonyms":["objecting again","raising an objection again","renewing an objection","protesting again"],"phonetic":"/ˌriːəbˈdʒɛktɪŋ/","extraExplanation":["“reobjecting”来自很少见的动词“re-object / reobject（再次提出异议）”。在正式写作里，更自然的说法通常是：“objecting again（再次反对）”“raising the objection again（再次提出异议）”。\n在法律/庭审语境中，更常见的是“renewing an objection（重新/继续提出异议）”，意思是为了让记录清楚，或在新问题出现时再次提出。","拼写上有时会写成“re-objecting”（加连字符更清楚），避免读者把它误读成“re-”+“object（物体）”。"]}
{"word":"reobjectivization","summary":{"en":"Reobjectivization means making something objective again, often in academic contexts about evidence, analysis, or treating experience as an object of study.","zh":"reobjectivization 指“再客观化”：让某事再次被当作客观对象来看待，常见于学术语境（证据、分析、把经验作为研究对象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of making something objective again, especially after it has been treated as subjective, personal, or dependent on a viewpoint.","zh":"再客观化：把某事物再次变得“客观”的过程，尤指在它曾被当作主观、个人或依赖观点的东西之后。"},"examples":[{"en":"The study argues for the reobjectivization of moral debate by using shared evidence and clear definitions.","zh":"这项研究主张通过共享证据和清晰定义，使道德讨论再客观化。"},{"en":"In the discussion, reobjectivization happens when feelings are translated into measurable claims.","zh":"在讨论中，当情绪被转化为可衡量的主张时，就发生了再客观化。"}]},{"partOfSpeech":"n.","definition":{"en":"In social theory, the process of treating people, experiences, or relationships as objects again—often for analysis—sometimes with the risk of reducing their human complexity.","zh":"在社会理论中：把人、经验或关系再次当作“对象”来对待（常用于分析），但可能带来把人的复杂性简化为“物”的风险。"},"examples":[{"en":"The author warns that reobjectivization can erase lived experience if it becomes only numbers and categories.","zh":"作者警告说，如果只剩数字和分类，再客观化会抹去真实的生活经验。"},{"en":"The therapist avoided reobjectivization by letting the client choose the words that described their story.","zh":"治疗师通过让来访者自己选择描述故事的词语，避免了再客观化。"}]}],"synonyms":["re-objectification","renewed objectivization","objectification (context-dependent)","reframing as objective"],"phonetic":"/ˌriˌɑbˌdʒɛk.tə.və.zaɪˈʃən/","extraExplanation":["这个词比较少见，多出现在哲学、社会学、批判理论或心理学写作中，用来讨论“客观/主观”的拉扯，或讨论把经验重新纳入可分析、可测量框架的过程。","构词上：re-（再次）+ objectivize（使客观化）+ -ation（名词后缀）。它常与 objectivization（客观化）和 reification（物化）一起讨论，但 reobjectivization 更强调“再次”回到客观化的状态。"]}
{"word":"reobjectivize","summary":{"en":"“Reobjectivize” means to make something objective again or to treat it again as an object (often in academic contexts).","zh":"“reobjectivize”指“再次客观化／再次对象化”，常用于学术语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something objective again; to treat a person, experience, or idea as an object or as “objective” rather than subjective","zh":"使再次客观化；把某人／某种经验或观念再次当作“客体”或“客观事实”来对待（而非主观感受）"},"examples":[{"en":"After the crisis, the team tried to reobjectivize the debate by focusing on verifiable data.","zh":"危机过后，团队试图把讨论再次客观化，把重点放在可核实的数据上。"},{"en":"Some critics argue that the film reobjectivizes women by showing them mainly as bodies, not people.","zh":"一些评论者认为这部电影把女性再次物化，因为主要把她们呈现为“身体”而不是“人”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(philosophy/psychology) to turn a subjective experience back into an object of analysis, as if it were separate from the self","zh":"（哲学／心理学）把主观体验重新当作可分析的“对象”，仿佛它与自我分离"},"examples":[{"en":"In therapy, naming the feeling can help reobjectivize it and make it easier to manage.","zh":"在治疗中，为情绪命名能帮助把它重新对象化，从而更容易应对。"},{"en":"The author reobjectivizes memory, treating it as a thing that can be stored, edited, and displayed.","zh":"作者把记忆重新对象化，把它当成一种可以储存、编辑和展示的东西。"}]}],"synonyms":["reobjectify","objectivize again","reify (again)"],"phonetic":"/ˌriːəbˈdʒɛktəˌvaɪz/","extraExplanation":["这个词非常少见，多见于学术语境（如现象学、批评理论、性别研究、心理治疗写作）。构词上是 re-（再、重新）+ objectivize（使客观化／对象化）。在批评语境里，它常带有负面含义，接近“再次物化”；在研究或治疗语境里，则更中性，强调“重新把某种体验当作可讨论、可观察的对象”。"]}
{"word":"reobjects","summary":{"en":"“Reobjects” is a rare verb meaning “objects again,” and it can also (uncommonly) mean “turns data back into an object” in computing.","zh":"“reobjects”是个较罕见的动词，表示“再次反对”；在计算机语境中也可（不常见地）指“把数据重新转回对象”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to object again; to raise an objection a second time or in response to something new.","zh":"（罕见用法）再次反对；在出现新情况或新说法时重新提出异议。"},"examples":[{"en":"She objected at first, and later reobjects when the plan changes again.","zh":"她一开始就反对，后来当计划又变动时再次提出异议。"},{"en":"The defense reobjects after the witness adds new details.","zh":"证方证人补充了新细节后，辩方再次提出异议。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Computing, uncommon) to turn data or text back into an object form (for example, in software design).","zh":"（计算机领域，较少见）把数据或文本重新转回“对象”的形式（如在软件设计中）。"},"examples":[{"en":"The tool reobjects the JSON into class instances.","zh":"这个工具把 JSON 重新转成类的实例对象。"},{"en":"After editing the file, the program reobjects the data for processing.","zh":"编辑文件后，程序将数据重新对象化以便处理。"}]}],"synonyms":["object again","renew an objection","raise another objection","deserialize (computing)","rehydrate (computing)"],"phonetic":"/ˌriːəbˈdʒekts/","extraExplanation":["“re-”是英语前缀，常表示“再次、重新”；“object”作动词时意思是“反对”。因此“reobject(s)”从构词上容易理解，但在日常英语里非常少用。更常见的说法是：object again / raise another objection / renew one’s objection（再次/重新提出反对）。","在软件语境里，“object”指“对象”（面向对象编程）；“reobject”偶尔被用来描述把数据重新变回对象的过程，但更常见的术语是 deserialize（反序列化）或 rehydrate（复原对象）。"]}
{"word":"reobligate","summary":{"en":"Reobligate means to obligate again, especially to renew or reassign legal/financial responsibility or funds.","zh":"reobligate 指“再次使承担义务”，尤其指在法律/财务上重新承诺或重新分配资金、责任。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to obligate again; to make a person or organization legally or financially responsible once more (often by renewing or reassigning funds or a contract).","zh":"再次使承担义务；再次使某人或某机构在法律或财务上负有责任（常指续签合同、重新分配或重新承诺资金）。"},"examples":[{"en":"The agency reobligated the unused funds to cover the updated contract costs.","zh":"该机构将未使用的资金重新承诺，用于支付更新后的合同费用。"},{"en":"If the original agreement expires, the parties may reobligate the project under a new contract.","zh":"如果原协议到期，双方可能在新合同下重新对该项目承担义务。"}]}],"synonyms":["recommit","reallocate (funds)","renew (a contract)","reauthorize"],"phonetic":"/ˌriˈɑːblɪɡeɪt/","extraExplanation":["“reobligate”常见于政府采购、拨款与预算管理语境，意思是把已“obligate（承诺/占用）”的资金在规则允许下再次承诺或重新绑定到某个合同/项目上。它比一般的“renew（续签）”更偏法律与财务流程用语。"]}
{"word":"reobligated","summary":{"en":"“Reobligated” means funds were officially committed again to a purpose (common in government/contract accounting).","zh":"“Reobligated”指资金被正式再次承诺/再次占用到某一用途（常见于政府或合同财务语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of money or funds) assigned again to a legal obligation or purpose; officially committed again.","zh":"（指资金）被再次拨付/再次承诺用于某项法律义务或用途；被正式重新占用（重新承诺）。"},"examples":[{"en":"The unused funds were reobligated to support the new phase of the project.","zh":"未使用的资金被重新占用，用于支持项目的新阶段。"},{"en":"After the contract was modified, part of the budget was reobligated to cover additional work.","zh":"合同修改后，部分预算被重新承诺，用于支付额外工作。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of reobligate: to obligate (commit) funds again for a specific purpose, often in government or contract accounting.","zh":"reobligate 的过去式/过去分词：将资金再次形成“义务”（再次承诺/再次占用），常见于政府财务或合同会计语境。"},"examples":[{"en":"The agency reobligated $50,000 from the canceled order to a different vendor.","zh":"该机构将取消订单中释放的5万美元重新占用，用于另一家供应商。"},{"en":"These dollars were deobligated and later reobligated under the amended agreement.","zh":"这笔资金先被解除占用，随后在修订协议下再次占用。"}]}],"synonyms":["recommitted","reallocated (sometimes)","reassigned (sometimes)","reapplied (sometimes)"],"phonetic":"/ˌriˈɑbləˌɡeɪtɪd/","extraExplanation":["“obligate funds”在政府/合同财务里通常不是“付钱(pay)”，而是“把预算正式承诺出去”，形成支出义务；之后才可能付款。","“reobligated”常出现在审计、拨款、采购、合同变更（modification）文件中，表示把已释放/未用完的资金重新绑定到新的用途或同一项目的后续阶段。","相关常见词：deobligate（解除占用/释放资金）、obligation（资金义务）、appropriation（拨款）、allocation（分配）。"]}
{"word":"reobligating","summary":{"en":"Reobligating means committing an obligation again—especially re-committing funds in government or contract budgeting.","zh":"reobligating 指“再次承担/设定义务”，常用于政府或合同预算中，表示把已释放的资金重新承诺、重新拨付。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place under an obligation again; to commit (money or resources) again after it was released or deobligated","zh":"再次使承担义务；（尤指资金/资源）在解除或撤销原承诺后重新承诺、重新拨付"},"examples":[{"en":"The agency is reobligating unused funds to support the project extension.","zh":"该机构正在将未用资金重新承诺，用于支持项目延期。"},{"en":"They are reobligating money that was previously deobligated at the end of the fiscal year.","zh":"他们正在把财政年度末曾被解除承诺的资金重新承诺。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become obligated again; to take on an obligation again","zh":"再次承担义务；重新负有义务"},"examples":[{"en":"If the contract terms change, the parties may be reobligating under the revised agreement.","zh":"如果合同条款发生变化，双方可能会在修订后的协议下重新承担义务。"}]}],"synonyms":["recommit","reallocate (funds)","reassign (funds)","re-pledge","renew (an obligation)"],"phonetic":"/ˌriːˈɑːbləˌɡeɪtɪŋ/","extraExplanation":["“reobligate / reobligating”常见于美国政府采购与预算语境：obligate 指“把预算资金正式承诺到某个合同/项目上”；deobligate 是“解除该承诺、释放资金”；reobligate 则是“把释放出来的资金再次承诺到新的或调整后的用途上”。因此它比一般的“再次让某人承担义务”更常带有“重新拨付/重新占用预算额度”的含义。","词形拆解：re-（再、重新）+ obligate（使负有义务/使受约束）。在正式文件中常见被动结构：Funds were reobligated…（资金被重新承诺/重新拨付）。"]}
{"word":"reobligation","summary":{"en":"Reobligation means a renewed obligation, especially in legal or debt-finance contexts (often involving restructuring or replacing an existing debt).","zh":"Reobligation 指“重新产生的义务/债务”，多用于法律或债务金融语境（常涉及债务重组或用新债替换旧债）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law/finance) The act of obligating someone again, or the state of being obligated again; a renewed legal or financial duty.","zh":"（法律/金融）再次使某人承担义务的行为；或再次处于承担义务的状态；指重新产生的法律或财务责任。"},"examples":[{"en":"The contract included a clause that prevented reobligation after termination.","zh":"合同包含一项条款，禁止在终止后再次产生义务（reobligation）。"},{"en":"After the dispute was settled, the parties agreed to a limited reobligation under new terms.","zh":"争议解决后，双方同意在新条款下承担有限的重新义务。"}]},{"partOfSpeech":"n.","definition":{"en":"(Debt/municipal finance) A restructuring or refinancing in which a new obligation is issued or arranged to replace, extend, or cover an existing one (often used when discussing bonds or public debt).","zh":"（债务/市政金融）一种债务重组或再融资：通过发行或安排新的债务来替代、展期或覆盖既有债务（常用于债券或公共债务语境）。"},"examples":[{"en":"The city pursued reobligation to extend maturities and reduce near-term payments.","zh":"该市通过再承担债务安排（reobligation）来延长到期日并降低短期偿付压力。"},{"en":"Investors asked whether the plan was a true repayment or a reobligation of the debt.","zh":"投资者询问该方案是真正偿还，还是对债务进行再承担/再融资（reobligation）。"}]}],"synonyms":["renewed obligation","recommitment","refinancing (context-dependent)","debt restructuring (context-dependent)"],"phonetic":"/ˌriˌɑbləˈɡeɪʃən/","extraExplanation":["“reobligation”多见于法律文件、公共财政或债务重组语境，日常英语中很少用。常见构词思路是 re-（再次）+ obligation（义务/债务）。","在市政债券（municipal bonds）或公共债务讨论中，它可能指用新的债务安排“接续”旧债（例如展期、替换、结构调整）。具体含义会因合同或法规而不同，阅读时建议结合上下文（如是否发行新债、是否改变到期日/利率、是否只是法律义务的重新确认）。"]}
{"word":"reoblige","summary":{"en":"“Reoblige” means to oblige again—either to do someone another favor (often as a return favor) or, more formally, to require again.","zh":"“reoblige”指“再次帮忙/再施恩惠”（常带回报人情之意），也可更正式地表示“再次使负有义务、再次要求”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to oblige again; to do a favor or service for someone another time (often implying returning kindness).","zh":"再次帮忙；再一次施以恩惠或提供服务（常含“回报对方的好意”之意）。"},"examples":[{"en":"Thanks for picking me up yesterday—could you reoblige and drive me to the airport tomorrow?","zh":"谢谢你昨天来接我——你明天能再帮我一次，送我去机场吗？"},{"en":"She felt she should reoblige him after all the help he had given her.","zh":"他帮了她那么多，她觉得自己应该回报他、再帮他一次。"}]},{"partOfSpeech":"vt.","definition":{"en":"to place someone under obligation again; to bind or require again (formal/rare).","zh":"（正式/少见）使某人再次负有义务；再次要求或约束。"},"examples":[{"en":"The new agreement seemed to reoblige the parties to follow the original schedule.","zh":"这份新协议似乎让双方再次必须遵守原来的时间表。"}]}],"synonyms":["help again","do (someone) a favor again","return the favor","oblige again"],"phonetic":"ˌriəˈblaɪdʒ","extraExplanation":["“reoblige”由 re-（再次）+ oblige（使有义务；帮忙）构成，整体语感偏正式、书面且较少见。日常表达中更常用：help you again / do you a favor again / return the favor（回你一个人情）。","在礼貌请求里，“Could you reoblige…?” 带一点旧式英语或幽默感；如果怕显得生硬，可以改说 “Could you do me a favor again…?”。"]}
{"word":"reobliged","summary":{"en":"Reobliged means “obliged again” or “bound again by a renewed duty,” and it’s the past form of the rare verb reoblige.","zh":"reobliged 意为“再次负有义务/被重新约束”，也是少见动词 reoblige（使再次负有义务）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal, rare) obliged again; placed under a renewed obligation.","zh":"（正式/少见）再次负有义务的；被重新要求履行责任的。"},"examples":[{"en":"After the contract was amended, the company was reobliged to deliver the goods by June.","zh":"合同修订后，公司再次被要求在六月前交付货物。"},{"en":"With the new evidence, the witness felt reobliged to tell the whole truth.","zh":"有了新的证据后，证人觉得自己再次有义务说出全部真相。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of reoblige: to oblige again; to bind again by duty, promise, or law.","zh":"reoblige 的过去式/过去分词：使再次负有义务；以责任、承诺或法律再次约束。"},"examples":[{"en":"The revised terms reobliged both parties to keep the information confidential.","zh":"修订后的条款使双方再次有义务对信息保密。"},{"en":"They were reobliged by policy to complete the training every year.","zh":"根据规定，他们每年都必须再次完成培训。"}]}],"synonyms":["obliged again","required again","rebound","recommitted","bound again"],"phonetic":"/ˌriəˈblaɪdʒd/","extraExplanation":["“reoblige / reobliged”在现代英语里非常少见，常见于法律、合同、政策或正式文件语境，表示“再次使……负有义务/再次约束”。日常表达更常用：be required to do sth again（再次被要求……）、be obligated to（有义务……）、be bound to（受约束必须……）。","词形上：re-（再、重新）+ oblige（使有义务）。如果你是在财政/政府拨款语境看到“re-obligated”，也可能指“重新拨付/重新承诺资金”（属于专业用法）。"]}
{"word":"reobliging","summary":{"en":"Reobliging means helping or obliging someone again (a rare, formal word).","zh":"Reobliging 指“再次帮忙/再次施惠”（较少见、偏正式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of reoblige) doing a favor for someone again; obliging again.","zh":"（reoblige 的现在分词）再次帮某人一个忙；再次施以恩惠／照顾。"},"examples":[{"en":"Thanks for reobliging—could you send the file one more time?","zh":"谢谢你再次帮忙——你能再发一次文件吗？"},{"en":"She kept reobliging her neighbors, even when she was busy.","zh":"即使很忙，她也一再帮邻居的忙。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) showing willingness to help again; repeatedly helpful.","zh":"（较少见）再次表现得乐于助人；一再热心帮忙的。"},"examples":[{"en":"His reobliging manner made it easy to ask for help.","zh":"他那种再次乐于帮忙的态度，让人很容易开口求助。"}]}],"synonyms":["help again","do a favor again","oblige again","assist again"],"phonetic":"/ˌriːəˈblaɪdʒɪŋ/","extraExplanation":["“reobliging”来自动词“reoblige”（re- + oblige），意思是“再一次使某人受惠/再帮一次忙”。在现代英语中非常少见，更常用的表达是“help again / do me a favor again / oblige me again”。","在正式或较文学化的语境里，你可能会看到“oblige”用来表示“帮忙、施惠”，例如：I’m obliged to you（我很感激你）。"]}
{"word":"reobscure","summary":{"en":"Reobscure means to make something unclear or hidden again.","zh":"Reobscure 指“再次使变得不清楚或被遮蔽”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something obscure again; to hide, cover, or make unclear after it had become clearer or more visible","zh":"再次使某事变得晦涩/不清楚；在曾经更清晰或更显眼之后，又把它遮掩或弄得难以理解"},"examples":[{"en":"The editor clarified the sentence, but later revisions reobscured its meaning.","zh":"编辑把句子改得更清楚了，但后来的修改又把意思弄得晦涩不明。"},{"en":"Smoke reobscured the stage lights during the second act.","zh":"第二幕时，烟雾又把舞台灯光遮住了。"}]}],"synonyms":["obscure again","rehide","reconceal","cloud","blur"],"phonetic":"/ˌriəbˈskjʊr/","extraExplanation":["“re-”表示“再、重新”。“reobscure”= re- + obscure（使晦涩/遮蔽），意思是“再次使变得不清楚”。这个词在日常英语里很少见，更常用的表达是 “make … obscure again / obscure … again / cloud again”。","拼写上因为词根以元音 o 开头，所以会出现 re + obscure → reobscure（中间连着两个元音），读起来通常是 /ˌriəb-/。"]}
{"word":"reobservation","summary":{"en":"Reobservation means observing something again to verify or update what you saw before.","zh":"reobservation 指为核对或更新先前结果而进行的再次观察。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of observing something again, often to confirm, correct, or update earlier observations","zh":"重新观察；再观察（通常为了确认、纠正或更新先前的观察结果）"},"examples":[{"en":"The researchers scheduled a reobservation of the patient after two weeks.","zh":"研究人员安排在两周后对病人进行再次观察。"},{"en":"Reobservation helped the team confirm that the first reading was inaccurate.","zh":"再次观察帮助团队确认第一次读数不准确。"}]}],"synonyms":["follow-up observation","reexamination","recheck","second look","reassessment"],"phonetic":"/ˌriˌɑbzɚˈveɪʃən/","extraExplanation":["“reobservation”不是非常常见的日常词，更常出现在学术写作（医学、心理学、天文学、野外调查等）中，用来强调“为了核对/复查而再次观察”。在普通交流里，人们更常说 “observe again / recheck / follow-up observation”。"]}
{"word":"reobserve","summary":{"en":"Reobserve means to observe something again, especially to check details or confirm results.","zh":"reobserve 指“再次观察”，常用于核对细节或确认结果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to observe something again, often to check, confirm, or notice details you missed before","zh":"再次观察（某事物），常用于核对、确认或发现之前忽略的细节"},"examples":[{"en":"After reading the report, the teacher asked the students to reobserve the experiment carefully.","zh":"读完报告后，老师让学生仔细重新观察这个实验。"},{"en":"Try to reobserve the scene and notice what has changed.","zh":"试着重新观察那个场景，看看有什么变化。"}]},{"partOfSpeech":"vt.","definition":{"en":"(science/astronomy) to make a new observation of the same object or event, especially as part of follow-up research","zh":"（科学/天文学）对同一对象或事件再次进行观测，常用于后续研究"},"examples":[{"en":"The team plans to reobserve the star next month to confirm the measurements.","zh":"团队计划下个月重新观测那颗恒星，以确认测量结果。"}]}],"synonyms":["observe again","take another look","reexamine","review","revisit"],"phonetic":"/ˌriːəbˈzɝv/","extraExplanation":["“re-”是常见前缀，表示“再一次/重新”。“reobserve”在日常英语中不算常用，更自然的表达常是“observe again / take another look / reexamine”。但在科研语境（尤其是观测与测量）里，“reobserve”更像一个精确、正式的动词。"]}
{"word":"reobserved","summary":{"en":"“Reobserved” means “observed again,” usually to check or study something.","zh":"“reobserved”表示“再次观察/重新观察”，多用于核对或研究。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) observed again; looked at or noticed something a second time (often to confirm, check, or study it).","zh":"（动词过去式/过去分词）再次观察；重新查看或注意到某事（常用于确认、核对或研究）。"},"examples":[{"en":"After a short break, the scientist reobserved the cells under the microscope.","zh":"短暂休息后，科学家再次在显微镜下观察这些细胞。"},{"en":"I reobserved his reaction and realized he was more nervous than he seemed.","zh":"我又观察了一下他的反应，才发现他比表面看起来更紧张。"},{"en":"The teacher reobserved the class to see whether the new rule was working.","zh":"老师再次观察课堂，看看新规定是否奏效。"}]}],"synonyms":["observed again","looked again","rechecked","reviewed"],"phonetic":"ˌriəbˈzɝvd","extraExplanation":["“re-”是英语里常见的前缀，表示“再一次、重新”。因此 reobserve = observe again。","这个词在日常口语中不算常见，更常用的替代表达有：observe again / look again / take another look / review (data/footage) 等，具体看语境（科学研究更常见 reobserve）。"]}
{"word":"reobserving","summary":{"en":"Reobserving means observing something again to confirm or notice details.","zh":"reobserving 指再次观察某事，以确认或发现细节。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"watching or noticing something again, often to check details or confirm a first impression","zh":"再次观察或留意某事，常用于核对细节或确认最初的判断"},"examples":[{"en":"After reobserving the experiment, she realized the temperature was recorded incorrectly.","zh":"在重新观察实验后，她发现温度记录错了。"},{"en":"I’m reobserving the street at different times of day to understand the traffic patterns.","zh":"我在一天不同时间重新观察这条街，以了解车流规律。"}]}],"synonyms":["observing again","taking another look","reexamining","reviewing"],"phonetic":"/ˌriːəbˈzɝːvɪŋ/","extraExplanation":["“re-”是常见前缀，表示“再一次 / 重新”。因此 reobserve = observe（观察）+ re-（再一次）。","“reobserving”多见于学术写作、研究记录、报告等语境；日常口语里也可以用更常见的说法，如 “looking again / observing again / taking another look”。"]}
{"word":"reobtain","summary":{"en":"Reobtain means to obtain something again, especially something you had before.","zh":"reobtain 指“再次获得”，尤指把曾经拥有的东西重新拿回来。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to get something again, especially something you had before (often after losing it or giving it up)","zh":"重新获得；再度取得（尤指曾经拥有但失去或放弃之后又拿回来）"},"examples":[{"en":"She worked hard to reobtain her professional license after moving back.","zh":"她搬回来后努力重新取得她的职业执照。"},{"en":"The museum hoped to reobtain the painting that had been stolen years ago.","zh":"博物馆希望重新寻回多年前被盗的那幅画。"}]}],"synonyms":["regain","get back","recover","retrieve"],"phonetic":"/ˌriːəbˈteɪn/","extraExplanation":["reobtain = re-（再次）+ obtain（获得）。在正式或书面语中更常见；口语里常用 get back（拿回）或 regain（重获）。","常见搭配：reobtain permission/approval（重新获得许可/批准）、reobtain a license（重新取得执照）、reobtain custody（重新获得监护权）。"]}
{"word":"reobtainable","summary":{"en":"Reobtainable means something can be obtained again.","zh":"reobtainable 指“可以再次获得/重新取得的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be obtained again; possible to get back or acquire again after losing it.","zh":"可再次获得的；能重新取得的（丢失或用完后还能再得到）。"},"examples":[{"en":"The document is reobtainable from the website if you lose the printed copy.","zh":"如果你弄丢了纸质版，这份文件可以从网站上重新获取。"},{"en":"Some data is reobtainable, but the original handwritten notes are not.","zh":"有些数据可以重新获得，但原始手写笔记就不行了。"},{"en":"In many libraries, out-of-print books are not always reobtainable.","zh":"在很多图书馆里，绝版书并不总是能重新获得。"}]}],"synonyms":["recoverable","retrievable","replaceable","obtainable again"],"phonetic":"/ˌriːəbˈteɪnəbəl/","extraExplanation":["这个词由 re-（再次、重新）+ obtainable（可获得的）组成，常见于较正式的写作或说明文（如文件、数据、资源管理）。日常口语里更常说 “you can get it again / get it back”。"]}
{"word":"reobtained","summary":{"en":"“Reobtained” means “got again,” usually something you had before.","zh":"“reobtained”表示“重新获得、再次得到”，通常指曾经拥有过的东西。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “reobtain”: got something again, especially something you had before (often after losing it).","zh":"“reobtain”的过去式/过去分词：再次获得（尤指曾经拥有、后来失去的东西）。"},"examples":[{"en":"She reobtained her passport after contacting the embassy.","zh":"她联系大使馆后再次拿回了护照。"},{"en":"The museum reobtained the painting that had been stolen years ago.","zh":"博物馆重新获得了那幅多年前被盗的画。"},{"en":"He reobtained access to his account after resetting his password.","zh":"他重置密码后重新获得了账户访问权限。"}]}],"synonyms":["got back","regained","recovered","retrieved"],"phonetic":"/ˌriːəbˈteɪnd/","extraExplanation":["“re-”表示“再次、重新”。“reobtain / reobtained”比较正式，常见于法律、新闻、学术或官方语境。日常口语里更常说“get back / regain / recover”。例如：get my keys back（把钥匙拿回来）、regain confidence（重拾信心）、recover a file（恢复文件）。"]}
{"word":"reobtaining","summary":{"en":"“Reobtaining” means getting something again—regaining or retrieving what you had before.","zh":"“reobtaining”表示再次获得、重新取得以前拥有的东西。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"getting something again; regaining or retrieving something you had before (present participle of “reobtain”)","zh":"再次获得；重新取得（“reobtain”的现在分词/动名词）"},"examples":[{"en":"The team is reobtaining access to the data after fixing the security settings.","zh":"修复安全设置后，团队正在重新获得对数据的访问权限。"},{"en":"Reobtaining your passport may take a few weeks, so apply early.","zh":"重新办理护照可能需要几周时间，所以要尽早申请。"},{"en":"She focused on reobtaining the skills she had lost during her long break.","zh":"她专注于重新找回自己在长时间休息中生疏的技能。"}]}],"synonyms":["regaining","retrieving","reacquiring","getting back"],"phonetic":"/ˌriːəbˈteɪnɪŋ/","extraExplanation":["“re-”是英语里很常见的前缀，表示“再次、重新”。因此 reobtain = obtain（获得）+ re-（再次）。","“reobtain / reobtaining”语气较正式，常见于法律、行政或学术写作中（如重新取得许可、访问权、文件等）。日常口语里更常用 get back / regain / retrieve。"]}
{"word":"reobtainment","summary":{"en":"Reobtainment means obtaining something again—getting it back.","zh":"reobtainment 指“再次取得、重新获得（把东西拿回来）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of obtaining something again; getting something back after losing it or giving it up","zh":"再次取得；重新获得（失去或放弃后又拿回）"},"examples":[{"en":"The reobtainment of his passport took two weeks after it was lost.","zh":"他护照遗失后，重新拿回护照花了两周时间。"},{"en":"They began legal steps for the reobtainment of the property.","zh":"他们开始采取法律措施以重新取得该房产。"}]}],"synonyms":["reacquisition","recovery","regaining","retrieval"],"phonetic":"/ˌriəbˈteɪnmənt/","extraExplanation":["“reobtainment”在现代英语中比较少见，更多时候人们会用更常见、更自然的词，比如“reacquisition（重新取得）”“recovery（找回/恢复）”或“getting something back（把……拿回来）”。","构词上：re-（再次）+ obtain（获得）+ -ment（名词后缀，表示“行为/结果”），因此字面意思就是“再次获得的行为/结果”。"]}
{"word":"reobtains","summary":{"en":"“Reobtains” means “gets something again; regains it,” and is a formal verb form used often in official writing.","zh":"“Reobtains”表示“再次获得、重新取得”，较正式，常用于官方或书面语。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"gets something again; regains or retrieves something previously had (third-person singular of “reobtain”)","zh":"再次获得；重新取得（动词 reobtain 的第三人称单数）"},"examples":[{"en":"After the appeal, she reobtains her driver’s license.","zh":"上诉后，她重新拿回了驾照。"},{"en":"If the package is returned, the sender reobtains the item.","zh":"如果包裹被退回，寄件人会重新取回物品。"}]}],"synonyms":["regains","retrieves","recovers","gets back","reclaims"],"phonetic":"/ˌriːəbˈteɪn/","extraExplanation":["“re-”表示“再次/重新”，所以 reobtain 字面意思就是“再次获得”。它比 get back、regain 更正式，常见于法律、行政、合同或书面语环境。","日常口语里更常说：get something back（把某物拿回来）、regain（重新获得，尤指能力/控制权/健康）。"]}
{"word":"reoccasion","summary":{"en":"“Reoccasion” means to cause something to happen again.","zh":"“reoccasion”表示“使某事再次发生；重新引起”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause (something) to happen again; to bring about anew","zh":"使（某事）再次发生；重新引起"},"examples":[{"en":"The policy change could reoccasion the same problems we had last year.","zh":"政策变化可能会重新引起我们去年遇到的同样问题。"},{"en":"A careless remark reoccasioned old tensions in the team.","zh":"一句不经意的话重新引发了团队里的旧矛盾。"}]}],"synonyms":["cause again","bring about again","rekindle","revive","trigger again"],"phonetic":"/ˌriəˈkeɪʒən/","extraExplanation":["这个词非常少见，多用于较正式或书面语境。构词上是 re-（再次）+ occasion（引起/导致），意思接近更常用的 cause again、bring back、rekindle（重新点燃/激起）。","在现代英语里，人们通常不用 reoccasion，而会说 re-create the problem、trigger the issue again、revive old memories 等，更自然、更常见。"]}
{"word":"reoccupation","summary":{"en":"Reoccupation means occupying something again—often a territory—or resuming an activity after a break.","zh":"reoccupation 指“再次占据/重新占领”（常用于领土语境），也可指“中断后恢复从事某事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of occupying a place again (especially a country, city, or territory after it was left, lost, or liberated).","zh":"再次占领；重新占据（尤指国家、城市或领土在撤离、失去或解放之后再次被占领/驻军）。"},"examples":[{"en":"After the war, the reoccupation of the region was controversial.","zh":"战争结束后，对该地区的重新占领引发了争议。"},{"en":"The treaty set rules for the reoccupation of the capital.","zh":"该条约为重新占领首都制定了规则。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of starting an activity, job, or practice again after a break; resumption.","zh":"重新从事；恢复（某项活动、工作或习惯）。"},"examples":[{"en":"Her doctor encouraged the gradual reoccupation of normal daily routines.","zh":"她的医生鼓励她逐步恢复正常的日常作息。"},{"en":"The reoccupation of the workshop brought life back to the neighborhood.","zh":"工坊的重新启用让社区又恢复了生气。"}]}],"synonyms":["reoccupation (re-occupation)","reoccupation of territory","resumption","return","reentry"],"phonetic":"/ˌriˌɑk.jəˈpeɪ.ʃən/","extraExplanation":["“reoccupation”由 re-（再次）+ occupation（占领；占用；职业）构成。它在新闻与历史语境里常指“重新占领/重新驻军”，语气可能较敏感；在日常与医学/康复语境里也可指“恢复做事、恢复日常活动”。","近义表达取决于语境：军事/政治语境可用 “re-occupation / renewed occupation”；日常语境更常用 “resumption / returning to (work/activities)”。"]}
{"word":"reoccupations","summary":{"en":"Reoccupations means instances of occupying a place again—either moving back in or regaining control, especially in historical/political contexts.","zh":"Reoccupations 指“重新占据/重新入住”的多次情况，也可指（尤其在历史/政治语境中）对地区的“重新占领/重新控制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of occupying a place again after leaving it; the state of being occupied again","zh":"重新占据；重新入住（离开后再次占用某地的行为/过程，或再次被占用的状态）"},"examples":[{"en":"After the renovation, the building’s reoccupation was delayed by safety checks.","zh":"翻新后，这栋楼的重新入住因安全检查而推迟。"},{"en":"The town planned the reoccupation of evacuated areas once the wildfire was contained.","zh":"一旦野火得到控制，该镇计划让疏散区域重新有人居住。"}]},{"partOfSpeech":"n.","definition":{"en":"official or military control of a territory again (often used in historical or political contexts)","zh":"（常用于历史/政治语境）再次占领；重新控制某片领土"},"examples":[{"en":"The treaty discussed the reoccupation of the region after the ceasefire.","zh":"条约讨论了停火后对该地区的重新控制。"},{"en":"Historians debate the consequences of the reoccupation for local communities.","zh":"历史学家讨论这次重新占领对当地社区的影响。"}]}],"synonyms":["reentry","return","resettlement","reoccupation (singular)","reoccupation of","repossession (context-dependent)"],"phonetic":"/ˌriˌɑkjəˈpeɪʃənz/","extraExplanation":["“reoccupations”是名词“reoccupation”的复数形式。前缀 re- 表示“再次”，occupation 表示“占据/占用/居住”。在新闻与历史写作中，它常用于描述撤离后“重新入住”，或战争、政权更迭后的“重新占领”。"]}
{"word":"reoccupied","summary":{"en":"Reoccupied means taken over or used/lived in again after being away or after losing control.","zh":"reoccupied 表示在离开或失去控制后“再次占领”或“重新使用/入住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of reoccupy: to take control of a place again, or to live/use it again after being away","zh":"reoccupy 的过去式/过去分词：再次占领（控制）某地；或在离开后再次居住/使用某处"},"examples":[{"en":"The army reoccupied the town after weeks of fighting.","zh":"经过数周的战斗后，军队重新占领了这座城镇。"},{"en":"After repairs, the family reoccupied their home.","zh":"修缮后，这家人重新入住他们的房子。"}]},{"partOfSpeech":"adj.","definition":{"en":"occupied again; used or lived in again (often in formal writing)","zh":"再次被占用/被使用/被居住的（常见于较正式的表达）"},"examples":[{"en":"The reoccupied building still smelled of fresh paint.","zh":"这栋重新启用的建筑仍然有新油漆的味道。"},{"en":"The area became reoccupied once the danger passed.","zh":"危险过去后，这一地区又有人返回并重新居住。"}]}],"synonyms":["retook","reclaimed","moved back into","resettled","re-entered"],"phonetic":"/ˌriˈɑkjəˌpaɪd/","extraExplanation":["“re-”是常见前缀，表示“再一次/重新”。reoccupy 常用于两类语境：①军事或政治语境（重新占领领土）；②日常语境（房屋修缮后重新入住、场地重新启用）。","易混词：occupy（占用/占领）强调“正在占用”；reoccupy（重新占用/重新占领）强调“之前占用过—后来离开/失去—现在又回来”。"]}
{"word":"reoccupies","summary":{"en":"“Reoccupies” means “occupies again” (moves back in or takes control again).","zh":"“reoccupies”表示“再次占用/重新入住或重新占领”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to occupy (a place, building, or area) again after leaving it; to move back in or take possession again","zh":"（离开后）再次占用/居住（某地）；重新进驻或重新取得占有权"},"examples":[{"en":"After repairs, the family reoccupies the apartment.","zh":"修好后，这家人重新搬回公寓居住。"},{"en":"The army reoccupies the town after the retreat.","zh":"撤退后，军队重新进驻该城镇。"},{"en":"Once the office reoccupies the building, meetings will return to normal.","zh":"办公室一旦重新使用这栋楼，会议就会恢复正常。"}]}],"synonyms":["moves back in","returns to","retakes","reenters","reclaims"],"phonetic":"/ˌriˈɑkjəˌpaɪz/","extraExplanation":["“re-”是常见前缀，表示“再次、重新”。因此 reoccupy = occupy（占用/居住/占领） + re-（再次）。","“reoccupies”是第三人称单数现在时（he/she/it reoccupies）。常见时态还有：reoccupied（过去式/过去分词）、reoccupying（现在分词）。"]}
{"word":"reoccupy","summary":{"en":"Reoccupy means to take a place back and use it again, or (in politics/war) to regain control of a place.","zh":"reoccupy 指重新占用并再次使用某处；也可指（政治/战争中）重新占领、夺回控制权。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take back and use a place again; to move into or use a building/area again after leaving it","zh":"重新占用；再次入住/使用（某处）；（离开后）再度回到并使用"},"examples":[{"en":"After repairs were finished, the family reoccupied their apartment.","zh":"修缮完成后，这家人重新入住了他们的公寓。"},{"en":"The museum was closed for months, but staff reoccupied the offices last week.","zh":"博物馆关闭了几个月，但工作人员上周重新回到办公室办公。"}]},{"partOfSpeech":"vt.","definition":{"en":"(politics/war) to take control of a place again after it was lost or left","zh":"（政治/战争）重新占领；夺回并再次控制（某地）"},"examples":[{"en":"The army reoccupied the town after the retreat.","zh":"撤退后，军队重新占领了这座城镇。"},{"en":"The country reoccupied the border area during the conflict.","zh":"冲突期间，该国重新控制了边境地区。"}]}],"synonyms":["move back in","return","retake","reclaim","resume occupancy"],"phonetic":"/ˌriːˈɑːkjəˌpaɪ/","extraExplanation":["“re-”表示“再次/重新”，因此 reoccupy = occupy（占用/占领）+ re-（再）。在日常语境里更常见于“重新入住/恢复使用某建筑”，在新闻语境里也可指“重新占领某地”。","近义表达（偏日常）：move back in（搬回去）、return to the building（回到那栋楼）。偏军事/政治：retake（夺回）、reclaim（收复）。语气上 reoccupy 较正式。"]}
{"word":"reoccupying","summary":{"en":"Reoccupying means occupying or using a place again, or taking a role/position again.","zh":"reoccupying 指再次占领或使用某地，或再次担任某个职位/角色。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of reoccupy) taking control of a place again after leaving it, or using a building/space again.","zh":"（reoccupy 的现在分词）在离开后再次占领某地，或再次使用某个建筑/空间。"},"examples":[{"en":"The army is reoccupying the border town after months of fighting.","zh":"经过数月战斗后，军队正在重新占领这座边境小镇。"},{"en":"The family is reoccupying their apartment now that repairs are finished.","zh":"维修完成后，这家人正在重新搬回并使用他们的公寓。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of reoccupy) taking a job, role, or position again.","zh":"（reoccupy 的现在分词）再次担任某个工作、角色或职位。"},"examples":[{"en":"She is reoccupying the manager’s role while her colleague is on leave.","zh":"同事休假期间，她正在再次担任经理的职责。"}]}],"synonyms":["retaking","reclaiming","moving back into","resuming","taking back"],"phonetic":"/ˌriˈɑkjəˌpaɪɪŋ/","extraExplanation":["“reoccupy”常用于军事与政治语境，表示“收复/重新占领”；也可用于日常语境，如“重新入住、重新使用某个空间”。","在新闻写作中，“reoccupying”通常暗示之前曾被迫撤离、失守或暂停使用，因此带有“回到原本控制/使用状态”的含义。"]}
{"word":"reoccur","summary":{"en":"Reoccur means to happen again, especially after a break or repeatedly.","zh":"reoccur 表示“再次发生”，尤指中断后再出现或反复发生。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of something) to happen again, often repeatedly or after a break.","zh":"（某事）再次发生；（尤指）反复发生或中断后又发生。"},"examples":[{"en":"The pain may reoccur if you stop taking the medicine too soon.","zh":"如果你太早停药，疼痛可能会再次出现。"},{"en":"Every winter, the same problem tends to reoccur.","zh":"每年冬天，同样的问题往往会反复发生。"}]}],"synonyms":["recur","happen again","return","come back"],"phonetic":"/ˌriːəˈkɝː/","extraExplanation":["“reoccur”由 re-（再次）+ occur（发生）构成，常用于描述症状、问题、事件在一段时间后“又出现”。","拼写提示：常见变体是“recur”。在现代英语中，“recur”更常用；很多场合两者可互换。更严格的区分里，有人用“recur”表示周期性反复，用“reoccur”表示再次出现一次，但实际写作中不必过度纠结，选择更常见的“recur”通常更自然。"]}
{"word":"reoccurred","summary":{"en":"“Reoccurred” means “happened again” (past tense of reoccur).","zh":"“reoccurred”表示“再次发生/重新出现”（reoccur 的过去式）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of an event or problem) to happen again after happening before; to come back.","zh":"（事件或问题）再次发生；重新出现。"},"examples":[{"en":"The same error reoccurred after the software update.","zh":"软件更新后，同样的错误又再次发生了。"},{"en":"Her headaches reoccurred when she stopped sleeping well.","zh":"当她睡眠变差时，头痛又复发了。"}]}],"synonyms":["recurred","happened again","returned","came back","reappeared"],"phonetic":"/ˌriəˈkɝd/","extraExplanation":["“reoccurred”来自动词“reoccur”的过去式/过去分词，意思是“再次发生”。日常写作中更常见的拼法是“recurred”（来自“recur”），两者意思几乎相同。","有时人们会用“reoccur”强调“再次出现/再发生一次”的感觉；“recur”更常用于“周期性反复出现”（如症状、节日、主题）——但在很多语境里可以互换。","拼写小提醒：不要写成“reoccured”；正确是“reoccurred”（双 r）。"]}
{"word":"reoccurrence","summary":{"en":"Reoccurrence means the return or happening again of something (often written as “recurrence”).","zh":"reoccurrence 指某事“再次发生/复发/再度出现”（更常见写法为 recurrence）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of happening again; a repeated event or return of something after it has happened before.","zh":"再次发生；复发；某事在发生过一次之后又再次出现。"},"examples":[{"en":"There has been a reoccurrence of flooding in the same neighborhood this year.","zh":"今年同一个社区又再次发生了洪水。"},{"en":"The doctor adjusted the treatment to prevent a reoccurrence of the infection.","zh":"医生调整了治疗方案，以防感染复发。"},{"en":"We updated our safety rules to reduce the reoccurrence of the same mistakes.","zh":"我们更新了安全规定，以减少同样错误再次出现。"}]}],"synonyms":["recurrence","return","reappearance","relapse"],"phonetic":"/ˌriː.əˈkɝː.əns/","extraExplanation":["“reoccurrence”由 re-（再次）+ occurrence（发生）组成，意思就是“再次发生”。在日常英语中，更常见的拼写是 “recurrence”（少一个 o），尤其在医学、统计或正式写作里（如：the recurrence of cancer）。不过 “reoccurrence”也能用，强调“再一次发生”时偶尔会见到。","注意区分：recurrence/reoccurrence 指“事件再次发生”；“repetition”更偏向“重复做同一动作/说同一句话”。"]}
{"word":"reoccurrences","summary":{"en":"“Reoccurrences” means repeated events—things that happen again.","zh":"“reoccurrences”指事情再次发生、重复出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"events, problems, or situations that happen again after happening before; repeated occurrences (plural of “reoccurrence”).","zh":"再次发生的事件/问题/情况；重复出现（“reoccurrence”的复数）。"},"examples":[{"en":"Doctors are trying to prevent reoccurrences of the infection.","zh":"医生正努力防止感染再次发生。"},{"en":"We saw several reoccurrences of the same error in the report.","zh":"我们在报告里看到了同样错误的多次重复出现。"},{"en":"After the repair, there were no reoccurrences of the noise.","zh":"维修后，噪音没有再出现。"}]}],"synonyms":["recurrences","repeat events","repetitions","returns"],"phonetic":"/ˌriəˈkɝːəns/","extraExplanation":["“reoccurrence”在英语里存在，但更常见、更标准的表达通常是“recurrence / recurrent”，尤其在医学、技术、新闻写作中。一般来说：recurrence=复发/再现（常用）；reoccurrence=再次发生（强调“又发生了一次”，但使用频率较低）。写作时若不确定，用“recurrences”更自然。"]}
{"word":"reoccurring","summary":{"en":"Reoccurring means happening again—either repeatedly or again after a break. In many contexts, “recurring” is the more common spelling for repeated events.","zh":"reoccurring 表示“再次发生/反复出现”。在很多语境中，表示“反复出现”更常用、更规范的写法是 recurring。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening again and again over time; repeated (often used like “recurring”)","zh":"一再发生的；反复出现的（常被当作 recurring 的同义写法）"},"examples":[{"en":"She has reoccurring headaches every winter.","zh":"她每年冬天都会反复头痛。"},{"en":"The report highlights a reoccurring problem in customer service.","zh":"报告强调了客服中一个反复出现的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening again after stopping; occurring again (more literal sense: “occurring again”)","zh":"在中断后再次发生的；重新出现的（更字面：再次发生）"},"examples":[{"en":"After months of calm, the reoccurring storm warnings worried residents.","zh":"平静了几个月后，重新出现的暴风警报让居民担忧。"},{"en":"We changed the settings to prevent the error from reoccurring.","zh":"我们更改了设置以防止错误再次发生。"}]}],"synonyms":["recurring","repeated","frequent","periodic","returning"],"phonetic":"/ˌriː.əˈkɝː.ɪŋ/","extraExplanation":["“Reoccurring”在实际使用中常被用来表示“反复发生”，但更规范、更常见的写法通常是“recurring”（反复出现的）。如果你想强调“再次发生（重新出现）”，用“reoccurring”在逻辑上更贴近字面；若只是“周期性/持续反复”，写“recurring”更自然。","词形提示：re-（再次）+ occurring（发生的）。在正式写作里，很多编辑会把“reoccurring problems”改为“recurring problems”。"]}
{"word":"reoccurs","summary":{"en":"Reoccurs means happens again or returns repeatedly.","zh":"reoccurs 意为“再次发生；反复出现”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of an event, problem, or situation) to happen again after it has happened before; to return repeatedly.","zh":"（事件、问题或情况）再次发生；反复出现。"},"examples":[{"en":"The rash reoccurs every winter when the air gets dry.","zh":"每到冬天空气变干时，这种皮疹就会复发。"},{"en":"If the error reoccurs, please restart the app and contact support.","zh":"如果这个错误再次出现，请重启应用并联系技术支持。"},{"en":"Her nightmares reoccur whenever she feels stressed.","zh":"每当她感到压力大时，噩梦就会反复出现。"}]}],"synonyms":["recurs","happens again","returns","comes back","reappears"],"phonetic":"/ˌriəˈkɝz/","extraExplanation":["“reoccurs”是动词“reoccur”的第三人称单数（he/she/it reoccurs）。常见同义表达还有“happens again”“comes back”“returns”。","拼写提示：英语里也常用更短的“recur /rɪˈkɝ/”（recurs）。两者意思几乎相同；“recur”在正式写作中更常见，“reoccur”更直观地强调“再次发生”。"]}
{"word":"reoffend","summary":{"en":"Reoffend means to commit a crime again after a previous offense.","zh":"reoffend 指在已有犯罪/违法记录后再次犯罪（再犯）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to commit a crime again after having been punished or after a previous offense","zh":"在受过处罚或已有前科后，再次犯罪；再犯"},"examples":[{"en":"The program aims to help people leaving prison so they don’t reoffend.","zh":"这个项目旨在帮助出狱人员，避免他们再次犯罪。"},{"en":"He was arrested again after he reoffended within a year of release.","zh":"他出狱不到一年又再犯，因此再次被捕。"}]}],"synonyms":["relapse into crime","offend again","recommit a crime"],"phonetic":"/ˌri.oʊˈfɛnd/","extraExplanation":["“re-”表示“再次”，所以 reoffend = offend（犯罪/违法）+ re-（再）。在日常英语里，这个词多用于法律与社会新闻语境，较正式；更口语的说法常见有 “commit a crime again / break the law again”。","常见搭配：reoffend rate（再犯率）、likelihood to reoffend（再犯可能性）、reoffend within X months/years（在X个月/年内再犯）。名词形式是 reoffending（再犯行为）。"]}
{"word":"reoffense","summary":{"en":"“Reoffense” means committing an offense again, or a second/subsequent offense (often in legal contexts).","zh":"“reoffense”指再次犯罪/再犯，也可指第二次或多次的违法犯罪行为（多用于法律语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of committing an offense again; offending a second time (or more) after a previous offense","zh":"再次犯罪；再犯（在已有前科或先前违法之后又犯同类或其他罪行）"},"examples":[{"en":"The program aims to reduce reoffense by helping people find stable jobs after release.","zh":"该项目旨在通过帮助出狱人员找到稳定工作来降低再犯率。"},{"en":"He was punished more severely because the court considered it a reoffense.","zh":"由于法院将其视为再犯，他受到更严厉的惩罚。"}]},{"partOfSpeech":"n.","definition":{"en":"(law) a second or subsequent offense, often used when discussing repeat offenders and sentencing","zh":"（法律）第二次或多次的犯罪/违法行为（常用于讨论累犯与量刑）"},"examples":[{"en":"Some laws increase penalties for a reoffense within a certain time period.","zh":"一些法律规定在特定时间内再犯将加重量刑。"},{"en":"The judge reviewed his record to determine whether this counted as a reoffense.","zh":"法官查看了他的记录，以判断这是否构成再犯。"}]}],"synonyms":["recidivism","repeat offense","relapse into crime"],"phonetic":"/ˌriː.əˈfɛns/","extraExplanation":["“reoffense”在新闻报道、犯罪学或政策讨论中常见，但日常英语里更常用动词“reoffend”（再次犯罪）。例如：He reoffended after release.（他出狱后又犯罪了。）","注意拼写：reoffense / re-offense 有时会加连字符；英式英语里也可能看到“re-offence”（offence 为英式拼法）。"]}
{"word":"reoffer","summary":{"en":"Reoffer means to offer something again or to put something back on sale.","zh":"Reoffer 表示再次提出（报价/提议等）或把某物重新上市出售。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to offer something again, especially after it was refused, expired, or changed","zh":"再次提出（报价/提议等）；（在被拒绝、到期或条件变化后）重新提供"},"examples":[{"en":"After the buyer rejected the first price, the seller reoffered at a lower rate.","zh":"买家拒绝了第一次报价后，卖方以更低的价格重新报价。"},{"en":"We can reoffer the same plan next month if the budget is approved.","zh":"如果预算获批，我们下个月可以再次提出同样的方案。"}]},{"partOfSpeech":"v.","definition":{"en":"to put something back on the market or make it available for sale again","zh":"（将商品/房源等）重新上市；再次出售"},"examples":[{"en":"The agent reoffered the apartment after the first deal fell through.","zh":"第一笔交易告吹后，经纪人把那套公寓重新挂牌出售。"},{"en":"Tickets are sometimes reoffered when people cancel their reservations.","zh":"有人取消预订时，门票有时会再次放出销售。"}]}],"synonyms":["offer again","renew an offer","repropose","resubmit","relist"],"phonetic":"/ˌriːˈɔfər/","extraExplanation":["“reoffer”常见于商业、招聘、房地产、票务等语境：reoffer a price（重新报价）、reoffer a position（再次发出录用/职位邀请）、reoffer a property（房源重新挂牌）。也常写作带连字符的“re-offer”，含义相同。"]}
{"word":"reoffered","summary":{"en":"“Reoffered” means “offered again.”","zh":"“reoffered”意为“再次提供/重新提出”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Offered again; presented again for someone to accept or buy.","zh":"再次提出（供人接受或购买）；重新报价/重新提供。"},"examples":[{"en":"They reoffered the job after the first candidate declined.","zh":"第一位候选人拒绝后，他们又重新把这份工作提供给了别人。"},{"en":"The store reoffered the discount during the holiday weekend.","zh":"这家店在假日周末又重新推出了折扣。"},{"en":"I reoffered my help when I saw she was still struggling.","zh":"看到她还在吃力，我又一次提出要帮忙。"}]}],"synonyms":["offered again","renewed (an offer)","presented again","proposed again"],"phonetic":"/ˌriˈɔfərd/","extraExplanation":["“reoffered”是动词“reoffer”的过去式/过去分词：re-（再次）+ offer（提供）。常见于商业与正式语境，表示“再次提出/再度销售”。","在金融/证券语境中，reoffered 常指“（承销商）将证券再次向市场出售/再发行”，例如“reoffered bonds（再度发行的债券）”。日常口语里更常用 “offered again / offered it again”。"]}
{"word":"reoffering","summary":{"en":"Reoffering means offering something again; in finance, it often refers to selling securities to the public again.","zh":"Reoffering 指“再次提供/再度发售”；在金融领域常指证券的再次公开发售。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of offering something again, especially selling shares or securities to the public again","zh":"再次发行；再度公开发售（尤指公司再次向公众出售股票或证券）"},"examples":[{"en":"The company raised money through a reoffering of its shares.","zh":"这家公司通过再次公开发售股票来筹集资金。"},{"en":"After the price stabilized, the bank planned a reoffering to investors.","zh":"在价格趋稳后，银行计划向投资者进行再度发售。"}]},{"partOfSpeech":"v.","definition":{"en":"offering something again; presenting a proposal or opportunity a second time","zh":"再次提供；再度提出（某个提案、机会或条件）"},"examples":[{"en":"They considered reoffering the job to the second-choice candidate.","zh":"他们考虑把这份工作再次提供给第二人选。"},{"en":"The store is reoffering last year’s popular items.","zh":"这家店正在再次推出去年的热门商品。"}]}],"synonyms":["reoffer","reissue","resale","secondary offering"],"phonetic":"/ˌriˈɔfərɪŋ/","extraExplanation":["在金融语境中，reoffering 常见于承销与发行文件里：指证券“再次向市场出售/公开发售”。有时会出现在短语 reoffering price（再度发售价/再发行价格）中。","日常语境里更常用 reoffer（再次提供/再提出）。reoffering 作为名词时，多见于较正式或商业/金融文本。"]}
{"word":"reoffers","summary":{"en":"“Reoffers” means offers something again, often in business or after a previous offer was declined or changed.","zh":"“reoffers”表示“再次提出/重新提供”，常用于商务场景或在先前提议被拒绝、撤回或调整后再次提出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to offer something again (for example, after it was rejected, withdrawn, or changed)","zh":"再次提出（例如在被拒绝、撤回或修改后重新提出）"},"examples":[{"en":"The company reoffers the job to another candidate after the first person declines.","zh":"第一位候选人拒绝后，公司把这份工作重新提供给另一位候选人。"},{"en":"She reoffers her help when she sees he is still struggling.","zh":"她看到他仍然很吃力，就再次提出愿意帮忙。"}]},{"partOfSpeech":"vt.","definition":{"en":"(business/retail) to put a product, service, or property back on the market for sale","zh":"（商业/零售）把产品、服务或房产重新投放市场出售"},"examples":[{"en":"The store reoffers the item online after it sells out in stores.","zh":"门店售罄后，这家商店在网上重新上架该商品。"},{"en":"The agent reoffers the apartment at a lower price.","zh":"中介以更低的价格重新挂牌这套公寓。"}]}],"synonyms":["offer again","renew an offer","reintroduce","put back on the market","relist"],"phonetic":"/ˌriˈɔfɚz/","extraExplanation":["“reoffers”通常是动词 reoffer 的第三人称单数（he/she/it reoffers）。在商务语境里也常见于“reoffer the position/contract/property（重新提出岗位/合同/重新挂牌房源）”。"]}
{"word":"reoffset","summary":{"en":"Reoffset means to offset again—either to rebalance costs/payments after changes or to reset alignment/offset in layout and printing.","zh":"reoffset 指“再次抵消/对冲”，也可指在排版或印刷中“重新设置偏移量/对齐”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to offset again; to balance, counteract, or compensate for something after a change or new calculation","zh":"再次抵消；在变动或重新计算后，再次用某事来平衡、对冲或补偿另一事物"},"examples":[{"en":"After updating the budget, we reoffset the extra costs by cutting travel expenses.","zh":"更新预算后，我们通过削减差旅费来再次抵消额外成本。"},{"en":"The system will reoffset your payments if the invoice amount changes.","zh":"如果发票金额发生变化，系统会重新对冲（抵扣）你的付款。"}]},{"partOfSpeech":"vt.","definition":{"en":"(printing/graphics) to set the offset or alignment again, especially after moving a layout or adjusting a machine","zh":"（印刷/制图）重新设置偏移量或对齐位置，尤指在移动版面或调整机器之后"},"examples":[{"en":"If the logo shifts, reoffset it by a few pixels.","zh":"如果标志位置偏了，就把它重新偏移几个像素。"},{"en":"The operator reoffset the plates to correct the misalignment.","zh":"操作员重新调整（偏移）印版以纠正套准不良。"}]}],"synonyms":["offset again","rebalance","reapply the offset","readjust","realign"],"phonetic":"/ˌriːˈɔfˌsɛt/","extraExplanation":["“reoffset”不是日常高频词，更常见于会计/结算（重新抵扣、重新对冲）或排版/图形软件（重新设置偏移量）等语境。","写作中若想更自然：会计语境常用“recalculate and offset again / apply the offset again”；排版语境常用“realign / adjust the offset / reposition”。"]}
{"word":"reoil","summary":{"en":"Reoil means to oil something again for lubrication and protection.","zh":"Reoil 指给某物重新上油，用于润滑和保护（如防锈）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to apply oil again to a machine, tool, or surface so it moves smoothly and is protected from rust","zh":"给机器、工具或表面重新上油（以润滑、防锈）"},"examples":[{"en":"After cleaning the chain, reoil it to prevent rust.","zh":"清洁链条后要重新上油，防止生锈。"},{"en":"You should reoil the hinges if the door starts squeaking.","zh":"如果门开始吱呀作响，你应该给铰链重新上油。"}]}],"synonyms":["oil again","lubricate","re-lubricate","grease"],"phonetic":"/riˈɔɪl/","extraExplanation":["“re-”是常见前缀，表示“再一次/重新”。因此 reoil 字面意思就是“再上油”。在说明书或维修语境里很常见。","在实际写作中也常见拼写为 “re-oil”（加连字符）以避免连读时看不清。"]}
{"word":"reoiled","summary":{"en":"“Reoiled” means “oiled again,” usually for maintenance or lubrication.","zh":"“Reoiled”意为“重新上油”，多用于保养或润滑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of reoil) to put oil on something again, usually to lubricate, protect, or maintain it.","zh":"（reoil 的过去式/过去分词）给某物再次上油，通常为了润滑、防锈或保养。"},"examples":[{"en":"After cleaning the hinges, I reoiled them so the door wouldn’t squeak.","zh":"清理门铰链后，我又给它们上了油，这样门就不会吱呀响。"},{"en":"The mechanic reoiled the chain before the long ride.","zh":"长途骑行前，修理工重新给链条上了油。"},{"en":"Make sure the tools are dry before they’re reoiled and stored.","zh":"工具在重新上油并收纳前，务必先擦干。"}]}],"synonyms":["oiled again","re-lubricated","lubricated again","reapplied oil"],"phonetic":"/ˌriˈɔɪld/","extraExplanation":["“reoiled”多见于说明书、维修记录、保养步骤等语境。日常口语里也常用“oiled it again / put oil on it again”。"]}
{"word":"reoiling","summary":{"en":"“Reoiling” means putting oil on something again for lubrication or protection.","zh":"“Reoiling”指再次给某物上油，用于润滑或保护（如防锈）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of applying oil again to a machine, tool, or surface so it runs smoothly or is protected","zh":"再次给机器、工具或表面上油（润滑/防锈）的行为"},"examples":[{"en":"Regular reoiling keeps the sewing machine quiet and smooth.","zh":"定期再次上油能让缝纫机运转更安静、更顺畅。"},{"en":"After cleaning the hinge, a little reoiling stopped the squeak.","zh":"清洁铰链后再上一点油，吱呀声就消失了。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “reoil”: applying oil again to something","zh":"“reoil”的现在分词：正在再次给某物上油"},"examples":[{"en":"She is reoiling the bike chain before the long ride.","zh":"长途骑行前，她正在给自行车链条重新上油。"},{"en":"I’m reoiling the pan to prevent rust.","zh":"我正在给锅重新抹油以防生锈。"}]}],"synonyms":["oiling again","relubricating","re-lubricating","reapplying oil"],"phonetic":"riˈɔɪlɪŋ","extraExplanation":["“reoiling”多用于保养与维修语境（如机器、门铰链、链条、工具）。常见搭配：reoil a hinge/chain/motor（给铰链/链条/电机重新上油）。与“oil”相比，它强调“再一次、恢复润滑”。"]}
{"word":"reoils","summary":{"en":"Recoil means to move back suddenly, or to react with strong dislike; it can also mean the backward kick of a gun.","zh":"Recoil 表示突然后退/缩回，或强烈反感；也可指枪的后坐力。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to move suddenly backward, especially because of a shock or impact","zh":"（尤指因冲击或惊吓而）突然后退，缩回"},"examples":[{"en":"She recoiled when the dog barked right next to her.","zh":"那只狗在她身旁突然吠叫时，她吓得往后一缩。"},{"en":"The child recoiled from the hot pan.","zh":"孩子看到热锅就往后退开。"}]},{"partOfSpeech":"vi.","definition":{"en":"to react strongly with fear, disgust, or moral shock; to shrink away emotionally","zh":"（因恐惧、厌恶或道德震惊而）强烈反感，退缩"},"examples":[{"en":"Many people recoil at the idea of hurting an animal.","zh":"许多人一想到伤害动物就会反感。"},{"en":"He recoiled from her rude comments.","zh":"他对她粗鲁的话感到反感而退缩。"}]},{"partOfSpeech":"n.","definition":{"en":"the sudden backward movement of something after a force, especially a gun after firing","zh":"（受力后的）后坐力；（尤指枪射击后的）后坐"},"examples":[{"en":"The recoil of the rifle surprised him.","zh":"步枪的后坐力让他吃了一惊。"},{"en":"Good posture helps you control recoil.","zh":"良好的姿势能帮助你控制后坐力。"}]}],"synonyms":["flinch","shrink back","jerk back","pull back","kick back"],"phonetic":"/rɪˈkɔɪl/","extraExplanation":["你输入的“reoils”很可能是拼写错误，常见正确形式是 **recoils**（动词第三人称单数：he/she/it recoils；或名词复数：the recoils）。词根上是 *re-*（向后）+ *coil*（卷起/盘绕），所以有“向后缩回”的画面感。"]}
{"word":"reometer","summary":{"en":"A rheometer is a device used to measure how materials flow and deform, especially viscosity.","zh":"rheometer（流变仪）是一种测量材料如何流动与变形的仪器，常用于测黏度等流变性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure how a liquid or soft material flows and deforms (its rheological properties, such as viscosity)","zh":"流变仪：用来测量液体或软材料的流动与变形特性（流变性质，如黏度等）的仪器"},"examples":[{"en":"The lab used a rheometer to measure the viscosity of the new polymer solution.","zh":"实验室用流变仪来测量这种新聚合物溶液的黏度。"},{"en":"A rheometer can show how a paint flows at different temperatures.","zh":"流变仪可以显示油漆在不同温度下的流动表现。"}]}],"synonyms":["viscometer","rheology instrument"],"phonetic":"/riˈɑːmɪtər/","extraExplanation":["你输入的“reometer”更常见的标准拼写是 **rheometer**（前面多了字母组合 **rh-**）。在科学英语里，**rheo-** 来自希腊语，和“流动”有关（同源词：rheology 流变学）。","在日常语境中，人们有时会把 rheometer 和 **viscometer（黏度计）**混用，但 rheometer 通常更“综合”，能测多种流变性质，不只黏度。"]}
{"word":"reomission","summary":{"en":"Remission means a medical improvement (symptoms lessen), or more generally a reduction/cancellation such as debt or punishment.","zh":"Remission 指（医学上的）病情缓解期，也可指更广义的减轻或免除，如债务或处罚的减免。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A period when a disease becomes less active or symptoms greatly improve; it may be temporary or long-lasting.","zh":"（医学）缓解期；指疾病活动减弱或症状明显改善的一段时间，可能是暂时或长期的。"},"examples":[{"en":"After treatment, her cancer went into remission.","zh":"治疗后，她的癌症进入了缓解期。"},{"en":"The doctor said the disease is in remission, but we still need regular checkups.","zh":"医生说病情处于缓解期，但仍需要定期复查。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of forgiving someone or canceling a punishment, debt, or payment.","zh":"（债务/处罚等的）免除；（对人的）宽恕。"},"examples":[{"en":"The judge granted remission of part of the fine.","zh":"法官批准减免部分罚款。"},{"en":"The government offered tax remission to small businesses.","zh":"政府向小企业提供税收减免。"}]},{"partOfSpeech":"n.","definition":{"en":"A reduction in the amount or intensity of something unpleasant (such as pain or fever).","zh":"（不适的）减轻；（如疼痛、发烧等）程度下降。"},"examples":[{"en":"He felt a brief remission of pain after taking the medicine.","zh":"他吃药后疼痛短暂减轻。"},{"en":"There was a remission in the fever overnight.","zh":"发烧在夜间有所减轻。"}]}],"synonyms":["relief","improvement","abatement","reprieve","cancellation","forgiveness"],"phonetic":"/rɪˈmɪʃən/","extraExplanation":["你输入的 **reomission** 常见是拼写错误，更可能想写的是 **remission**（缓解期/减免/宽恕）。","词源上，remission 来自拉丁语 *remittere*（“放回、放松、减轻”），所以它既能表示“症状减轻”，也能表示“处罚/债务减免”。"]}
{"word":"reomit","summary":{"en":"“Reomit” means to omit something again, especially when revising or reprinting a text.","zh":"“reomit”指“再次省略/再一次漏掉”，常用于修订或再版时把某内容又删去。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to leave out (something) again; to omit once more, often in a revision or later version of a text","zh":"再次省略（某事物）；在修订或后续版本中又一次把某内容删去/漏掉"},"examples":[{"en":"In the final draft, the editor reomitted two paragraphs that had been added by mistake.","zh":"在最终稿中，编辑又把误加的两段重新省略掉了。"},{"en":"Please don’t reomit the safety warning in the next printing.","zh":"请不要在下一次印刷时再次漏掉安全警告。"}]}],"synonyms":["re-omit","omit again","leave out again","remove again"],"phonetic":"/ˌriːoʊˈmɪt/","extraExplanation":["“reomit”比较少见，更常见的写法是“re-omit”（加连字符），意思更清晰：re-（再一次）+ omit（省略）。在正式写作中，如果担心读者不熟悉，可改用更常见的表达：“omit again / leave out again / remove again”。"]}
{"word":"reopen","summary":{"en":"Reopen means to open something again or to start operating again after being closed.","zh":"Reopen表示“重新打开”或“在关闭后重新开放/恢复运营”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to open again after being closed","zh":"（关上后）重新打开；再打开"},"examples":[{"en":"Please reopen the window—it's too hot in here.","zh":"请把窗户重新打开——这里太热了。"},{"en":"The store will reopen at 9 a.m. tomorrow.","zh":"这家店将于明天上午9点重新开门营业。"},{"en":"They reopened the discussion after new evidence appeared.","zh":"在出现新证据后，他们重新开始讨论。"}]},{"partOfSpeech":"v.","definition":{"en":"to begin operating or being available again (for a business, school, road, etc.)","zh":"（机构/道路等）重新开放；恢复运营/通行"},"examples":[{"en":"The museum reopened after months of renovation.","zh":"博物馆在数月翻新后重新开放。"},{"en":"The highway reopened once the snow was cleared.","zh":"积雪清理完后，高速公路恢复通行。"}]}],"synonyms":["open again","resume","restart","restore"],"phonetic":"/ˌriːˈoʊpən/","extraExplanation":["“re-”是常见前缀，表示“再次/重新”。所以reopen = re-（再）+ open（打开/开放）。","在美式英语里，reopen既可表示“把东西再打开”（reopen the door/file），也常用于“重新开业/复课/恢复通行”（reopen the restaurant/schools/roads）。"]}
{"word":"reopened","summary":{"en":"“Reopened” means something was opened again after being closed (verb past form) or describes something that is open again (adjective).","zh":"“reopened”表示某事在关闭后再次开启（动词过去式/过去分词），也可作形容词表示“重新开放的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “reopen”: opened again after being closed (a place, business, case, discussion, etc.)","zh":"“reopen”的过去式/过去分词：在关闭后再次开启（场所、商店、案件、讨论等）"},"examples":[{"en":"The museum reopened after months of renovation.","zh":"博物馆在数月翻新后重新开放。"},{"en":"Police reopened the case when new evidence appeared.","zh":"当出现新证据时，警方重新立案调查。"},{"en":"We reopened the discussion to hear everyone’s ideas.","zh":"我们重新开启讨论，听取大家的想法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) open again; operating again after being closed","zh":"（形容词）重新开放的；恢复营业/运行的"},"examples":[{"en":"The reopened restaurant was packed on its first night back.","zh":"那家重新开业的餐馆在回归的第一晚就座无虚席。"},{"en":"Only the reopened roads are safe to use right now.","zh":"目前只有重新开放的道路可以安全通行。"}]}],"synonyms":["opened again","resumed","restored","reactivated"],"phonetic":"/ˌriːˈoʊpənd/"}
{"word":"reopener","summary":{"en":"A reopener is something that makes a closed case, issue, or situation open again; less commonly, it can mean a tool used to open something again.","zh":"reopener 指使已结束的案件/议题/局面再次被打开的事物；较少情况下也可指用于再次打开某物的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that causes a case, discussion, or situation to be opened again after it seemed finished (often used in law, politics, or the news).","zh":"使某个案件、讨论或局面在看似结束后再次被重新开启的事物（常用于法律、政治或新闻语境）。"},"examples":[{"en":"The new witness statement could be a real reopener for the case.","zh":"这份新的证人陈述可能会成为让案件重新启动的关键因素。"},{"en":"A fresh round of layoffs became a painful reopener of old worries.","zh":"新一轮裁员让人痛苦地再次想起旧日的担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"A device, tool, or method used to open something again (less common; more literal meaning).","zh":"用于再次打开某物的装置、工具或方法（较少见，更偏字面意思）。"},"examples":[{"en":"He bought a jar reopener to help his grandmother open tight lids again.","zh":"他买了一个“开罐辅助器”，帮助奶奶再次打开很紧的盖子。"}]}],"synonyms":["game-changer","new evidence","trigger","reviver","catalyst"],"phonetic":"/ˌriˈoʊpənər/","extraExplanation":["“reopener”在新闻与法律中很常见，常搭配：a case reopener（让案件重启的证据/线索）、a deal reopener（让协议重新谈判的因素）、a debate reopener（让争论再度升温的事件）。","词形上来自动词 re-open（重新打开/重启）+ -er（表示“……的人/物/工具”）。很多时候它指“触发重启的因素”，而不是指“重启的动作”。"]}
{"word":"reopening","summary":{"en":"“Reopening” most often means opening again after being closed (as a noun or adjective), and it can also be the -ing form of “reopen.”","zh":"“reopening”多指关闭后再次开放/恢复（可作名词或形容词），也可作“reopen”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of opening something again, or starting an activity/business again after it was closed","zh":"重新开放；重新开始（营业/活动）"},"examples":[{"en":"The museum’s reopening is scheduled for next month.","zh":"博物馆计划下个月重新开放。"},{"en":"After repairs, the bridge is ready for reopening.","zh":"维修后，这座桥已准备重新通行（重新开放）。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening again after being closed; opened again","zh":"重新开放的；再次开启的"},"examples":[{"en":"The company announced the reopening date for its stores.","zh":"公司公布了门店重新开业的日期。"},{"en":"There were strict rules during the reopening phase.","zh":"在重新开放阶段有严格规定。"}]},{"partOfSpeech":"v.","definition":{"en":"the action of opening again (present participle used as a verb form)","zh":"重新打开；再次开启（reopen 的 -ing 形式）"},"examples":[{"en":"They are reopening the road after the storm.","zh":"暴风雨过后，他们正在重新开放这条道路。"},{"en":"We’re reopening the discussion at tomorrow’s meeting.","zh":"我们将在明天的会议上重新开启讨论。"}]}],"synonyms":["resumption","return","restart","relaunch","recommencement"],"phonetic":"/ˌriːˈoʊpənɪŋ/","extraExplanation":["“reopening”常见于公共场所或机构（museum, school, border, store）在关闭后恢复运作的语境；也常用于抽象事物，如“reopening a case / a debate”（重启案件/讨论）。","在新闻语境中，“reopening”有时带有阶段性管理的含义（如逐步恢复、附带限制），可与“phased reopening / gradual reopening（分阶段/逐步重开）”搭配。"]}
{"word":"reopenings","summary":{"en":"“Reopenings” means the acts or events of opening again after a closure, often used for businesses, schools, roads, or public places.","zh":"“reopenings”指关闭后再次开放的行为或事件，常用于描述商家、学校、道路或公共场所的复工/重启。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of opening something again after it has been closed (plural of “reopening”)","zh":"重新开放；再度开启（“reopening”的复数）"},"examples":[{"en":"The museum’s reopenings were delayed because of renovations.","zh":"由于翻新工程，博物馆的重新开放被推迟了。"},{"en":"After the storm, there were several reopenings of roads as crews cleared debris.","zh":"暴风雨过后，工作人员清理残骸，许多道路陆续重新开放。"}]},{"partOfSpeech":"n.","definition":{"en":"times or events when places or activities start operating again, especially after a shutdown or pause","zh":"（尤指停业、停课或中断后）重新恢复营业/运作的阶段或事件"},"examples":[{"en":"Many restaurants planned reopenings in early summer.","zh":"许多餐馆计划在初夏重新开业。"},{"en":"The city announced reopenings of parks and libraries.","zh":"这座城市宣布公园和图书馆将重新开放。"}]}],"synonyms":["restarts","resumptions","renewed openings","returns to operation"],"phonetic":"/ˌriːˈoʊpənɪŋz/","extraExplanation":["“reopenings”常见于新闻语境，尤其是谈到疫情（COVID-19）后的“逐步重启/分阶段恢复”。用复数通常强调“多次、多个地点或多个阶段”的重新开放。","词形提示：reopening（单数）→ reopenings（复数）。也可作形容词用法：a reopening plan（重开计划）。"]}
{"word":"reopens","summary":{"en":"“Reopens” means “opens again” or “starts again,” and it’s the third-person singular form of “reopen” (he/she/it reopens).","zh":"“Reopens”表示“重新开放”或“重新启动/恢复进行”，是动词“reopen”的第三人称单数形式（他/她/它 reopens）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to open again after being closed (e.g., a store, school, road, museum)","zh":"（在关闭后）重新开放；再度开门（如商店、学校、道路、博物馆）"},"examples":[{"en":"The museum reopens on Monday after renovations.","zh":"博物馆翻新后将于周一重新开放。"},{"en":"If the weather improves, the airport reopens this evening.","zh":"如果天气好转，机场今晚会重新开放。"}]},{"partOfSpeech":"v.","definition":{"en":"to start again or return to activity after a pause (e.g., a case, investigation, debate, or negotiations)","zh":"（在暂停后）重新启动；恢复进行（如案件、调查、辩论或谈判）"},"examples":[{"en":"The police reopen the investigation after receiving new evidence.","zh":"警方在获得新证据后重新启动调查。"},{"en":"The committee reopens the discussion at next week’s meeting.","zh":"委员会将在下周会议上重新展开讨论。"}]}],"synonyms":["opens again","resumes","restarts","recommences","reinstates","revives"],"phonetic":"/ˌriˈoʊpənz/"}
{"word":"reoperate","summary":{"en":"Reoperate means to operate again, especially to perform a second surgery.","zh":"reoperate 指“再次操作”，尤指“再次手术”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to operate again; to perform an operation a second time (often because the first attempt did not solve the problem).","zh":"再次操作；再进行一次手术（常因第一次未解决问题）。"},"examples":[{"en":"The surgeon had to reoperate because the bleeding did not stop.","zh":"因为出血没有停止，外科医生不得不再次手术。"},{"en":"If the machine fails again, the technician may need to reoperate the system from the start.","zh":"如果机器再次故障，技术员可能需要从头重新操作系统。"}]},{"partOfSpeech":"vt.","definition":{"en":"(medicine, transitive) to perform a second surgical operation on (a patient or body part).","zh":"（医学，及物）对（病人或身体部位）再次实施手术。"},"examples":[{"en":"They decided to reoperate on his knee after the infection cleared.","zh":"感染控制后，他们决定对他的膝盖再次手术。"},{"en":"The doctor said they might need to reoperate on the wound if it reopens.","zh":"医生说如果伤口再次裂开，可能需要再次手术。"}]}],"synonyms":["operate again","perform a second operation","re-do the operation","rework"],"phonetic":"/ˌriːˈɑːpəˌreɪt/","extraExplanation":["“reoperate”在日常英语中比较少见，更常见的表达是“operate again”或医学里用“reoperate on + 人/部位”。","前缀“re-”表示“再次”，所以该词直观含义就是“再操作/再手术”。在医学语境中更常出现在较正式的病例记录或论文里。"]}
{"word":"reoperated","summary":{"en":"Reoperated means “operated again,” most commonly referring to a second surgery; it can also mean something started operating again.","zh":"reoperated 意为“再次进行手术”（最常见）；也可指机器、系统等“重新运转”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(especially in medicine) to operate on someone again; to perform another surgical operation because the first one didn’t fully solve the problem or complications happened.","zh":"（尤用于医学）再次给某人动手术；因为第一次手术未完全解决问题或出现并发症而进行第二次（或更多次）手术。"},"examples":[{"en":"The patient was reoperated after internal bleeding was found.","zh":"发现内出血后，病人又接受了一次手术。"},{"en":"She was reoperated to remove the remaining tissue.","zh":"她再次手术以切除残留组织。"}]},{"partOfSpeech":"vi.","definition":{"en":"to operate again; to start running again after stopping (a machine, system, business, etc.).","zh":"再次运转；在停止后重新运行（机器、系统、企业等）。"},"examples":[{"en":"After repairs, the factory reoperated at full capacity.","zh":"维修后，工厂恢复满负荷运转。"},{"en":"The website was reoperated after the server reboot.","zh":"服务器重启后，网站恢复运行。"}]}],"synonyms":["re-operated","operated again","re-run","restart","resume operation"],"phonetic":"/ˌriˈɑpəˌreɪtɪd/","extraExplanation":["在医疗语境里更常见的写法是带连字符的 **re-operated**（也可写作 **reoperated**）。带连字符时更直观，表示“再做一次手术”。","在新闻或病历记录中，**was reoperated** 往往省略了宾语，默认指“再次手术治疗（同一位病人/同一部位）”。"]}
{"word":"reoperates","summary":{"en":"Reoperates means “operates again,” and can also mean “does surgery again,” especially in medical contexts.","zh":"reoperates 表示“再次运转/重新操作”，在医学语境中也可指“再次手术”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to operate again; to start using, running, or working again (often after stopping or repairing).","zh":"再次运转；重新开始操作或运行（常指停止或修理后再次开始）。"},"examples":[{"en":"After the software update, the system reoperates normally.","zh":"软件更新后，系统重新正常运转。"},{"en":"If the machine shuts down, it usually reoperates after a reset.","zh":"如果机器停机，通常重置后会再次运行。"}]},{"partOfSpeech":"vt.","definition":{"en":"(medical) to perform surgery again on a patient, usually because of a complication or a new problem.","zh":"（医学）对病人再次手术（通常因并发症或出现新问题）。"},"examples":[{"en":"The surgeon reoperates if there is internal bleeding.","zh":"如果出现内出血，外科医生会再次手术。"},{"en":"She needed to be reoperated on to remove the infection.","zh":"为了清除感染，她需要再次接受手术。"}]}],"synonyms":["restart","resume","run again","reactivate","reopen","re-operate (on)"],"phonetic":"/ˌriˈɑpəˌreɪt/","extraExplanation":["“reoperates”是动词“reoperate”的第三人称单数（he/she/it reoperates）。在医学语境中更常见的表达是“re-operate (on someone)”或被动式“be reoperated on”。拼写上也常见带连字符的“re-operate”，意思相同。"]}
{"word":"reoperating","summary":{"en":"Reoperating means operating again or being back in operation after stopping.","zh":"Reoperating 指“再次操作/再次运行”，或“停下后恢复运转”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) doing an operation again; operating something again after stopping or after a first operation.","zh":"（现在分词）再次进行操作；在停止后或第一次操作后重新运行/重新操作某物。"},"examples":[{"en":"The factory is reoperating the old production line after repairs.","zh":"维修后，工厂正在重新运行那条旧生产线。"},{"en":"After a brief shutdown, the system is reoperating normally.","zh":"短暂停机后，系统正在恢复正常运行。"},{"en":"The team is reoperating the equipment to double-check the results.","zh":"团队正在再次操作设备以复核结果。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective-like) working again; in operation again.","zh":"（形容词式用法）再次运转的；恢复运行的。"},"examples":[{"en":"A reoperating plant can meet demand more quickly than building a new one.","zh":"一座恢复运行的工厂比新建一座更能迅速满足需求。"},{"en":"They announced that the reoperating service would start on Monday.","zh":"他们宣布该恢复运行的服务将于周一开始。"}]}],"synonyms":["running again","operating again","restarting","resuming operation","reactivating"],"phonetic":"/ˌriˈɑpəˌreɪtɪŋ/","extraExplanation":["“reoperating”常见于技术、工业、交通服务等语境，强调“恢复运行/再次启动”。","在医学语境里更常写作“re-operating / reoperating (on a patient)”，表示“再次手术/二次开刀”；为了避免歧义，有时会加连字符 re-operating。"]}
{"word":"reoperation","summary":{"en":"Reoperation means an operation done again, especially a second surgery to correct a problem from an earlier one.","zh":"reoperation 指“再次进行的手术”，尤其是为纠正或处理先前手术问题而进行的复手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation performed again, usually to fix a problem or complication from an earlier operation.","zh":"（通常指为解决上一次手术的问题或并发症而进行的）再次手术、复手术。"},"examples":[{"en":"After the infection didn’t improve, the patient needed a reoperation.","zh":"感染没有好转后，病人需要再次手术。"},{"en":"The doctor explained the risks of reoperation before scheduling a new procedure.","zh":"医生在安排新的手术前解释了复手术的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of operating again (in medicine or other technical contexts).","zh":"再次操作；重新运作（可用于医学或其他技术语境）。"},"examples":[{"en":"The reoperation of the system requires shutting it down for maintenance.","zh":"系统的重新运作需要为维护而关机。"}]}],"synonyms":["repeat surgery","second operation","revision surgery","reintervention"],"phonetic":"/ˌriːˌɑːpəˈreɪʃən/","extraExplanation":["在医学语境里，reoperation 通常比 repeat surgery 更偏正式、更像写在病历或研究论文里的用词；日常口语里医生也可能说 another surgery / a second surgery。","词形构成：re-（再、重新）+ operation（手术/操作）。注意与 revision surgery（修复性手术，强调“修正/重做”）和 reintervention（再次介入治疗，范围可能包含手术或其他治疗）在医学文献中的区别。"]}
{"word":"reophore","summary":{"en":"A reophore is the current-carrying lead/terminal of an electrical component.","zh":"reophore 指电子元件上用来导通电流的引线或接线端。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wire or metal lead of an electrical component that carries current into or out of the device (a terminal/lead).","zh":"（电子元件的）引线；接线端（用于让电流进入或离开元件的导线/金属端子）。"},"examples":[{"en":"Solder the reophores of the resistor to the circuit board pads.","zh":"把电阻的引线焊接到电路板焊盘上。"},{"en":"Be careful not to bend the reophore too close to the capacitor body.","zh":"注意不要在离电容本体太近的地方弯折引线。"}]}],"synonyms":["lead","terminal","pin","wire lead"],"phonetic":"ˈriəˌfɔr","extraExplanation":["“reophore”较少见，更多在旧式或较正式的技术文献中出现；日常电子工程里通常直接说 lead(s)、terminal(s)、pin(s)。","词源来自希腊语：rheo-（流动，指电流的“流”）+ -phore（携带者），字面意思是“携带电流的部分”。"]}
{"word":"reoppose","summary":{"en":"Reoppose means to oppose something again.","zh":"reoppose 指“再次反对；重新提出反对”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to oppose something again (for example, after it is proposed a second time or after a pause)","zh":"再次反对；重新提出反对（例如某事再次被提出或中断后又重新出现）"},"examples":[{"en":"After the bill was revised and introduced again, several lawmakers reopposed it.","zh":"法案修改后再次提交，一些议员又重新表示反对。"},{"en":"The community reopposed the plan when the developer returned with a new proposal.","zh":"开发商带着新方案回来时，社区再次提出反对。"}]}],"synonyms":["oppose again","renew opposition","re-oppose","object again"],"phonetic":"/ˌriəˈpoʊz/","extraExplanation":["“reoppose”由前缀 re-（再一次、重新）+ oppose（反对）组成，意思直观但非常少见。更常见的写法是带连字符的 “re-oppose”，或者直接用更自然的表达：oppose again / renew opposition / oppose it once more。","由于 “re-” 结尾元音与 “oppose” 开头元音相连，书写时加连字符（re-oppose）更清晰，也更符合常见英文排版习惯。"]}
{"word":"reopposed","summary":{"en":"“Reopposed” means “opposed again,” especially when something returns for another discussion or vote.","zh":"“Reopposed”意为“再次反对（某事）”，常用于某事被重新提出讨论或表决时。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of reoppose: to oppose something again, often after it appears in a new form or is brought back for another vote or discussion.","zh":"reoppose 的过去式/过去分词：再次反对某事，常见于某事以新形式出现、或被重新提出表决/讨论时。"},"examples":[{"en":"Several lawmakers who had accepted the earlier compromise reopposed the bill after new amendments were added.","zh":"一些曾接受早先妥协方案的议员在加入新修正案后又再次反对该法案。"},{"en":"The plan was reopposed during the second round of public hearings.","zh":"在第二轮公众听证会上，这项计划再次遭到反对。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjectival use) having been opposed again.","zh":"（形容词用法）再次被反对的。"},"examples":[{"en":"The reopposed proposal was sent back to committee.","zh":"这项再次遭到反对的提案被送回委员会。"}]}],"synonyms":["opposed again","renewed opposition","challenged again","resisted again"],"phonetic":"/ˌriəˈpoʊzd/","extraExplanation":["“reopposed”来自前缀 re-（再次）+ oppose（反对）。它在日常英语中不算常见，更常见的表达是 “was opposed again / faced renewed opposition / was reintroduced and opposed”。在新闻、政治或法律语境里更可能看到。"]}
{"word":"reopposes","summary":{"en":"“Reopposes” means “opposes again” (third-person singular of reoppose).","zh":"“reopposes”意为“再次反对”，是动词 reoppose 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to oppose again; to state or show opposition a second time (often after the issue is raised again)","zh":"再次反对；在某事重新被提出后，再一次表态或采取行动表示反对"},"examples":[{"en":"When the proposal returned to the agenda, she reopposes it in the meeting.","zh":"当该提案再次回到议程上时，她在会议上再次表示反对。"},{"en":"He reopposes the plan after the team changes the budget assumptions.","zh":"在团队更改预算假设后，他又一次反对这个计划。"}]}],"synonyms":["oppose again","reiterate opposition","renew opposition","continue to oppose"],"phonetic":"/ˌriːəˈpoʊz/","extraExplanation":["“reopposes”是动词“reoppose”的第三人称单数现在时（he/she/it reopposes）。","这个词在现代英语里不算常见；更自然的表达通常是“opposes again / renews opposition / continues to oppose / reiterates his/her opposition（重申反对）”。","前缀 re- 常表示“再次、重新”。因此 reoppose 的核心意思就是“再度反对”。"]}
{"word":"reopposing","summary":{"en":"“Reopposing” means opposing something again (the -ing form of “reoppose”).","zh":"“reopposing”指“再次反对”，是“reoppose”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to oppose again; to start opposing something again after a pause or a change in circumstances","zh":"再次反对；在暂停或情况变化后重新开始反对（某事）"},"examples":[{"en":"After the revised plan was announced, several residents began reopposing the project.","zh":"修订方案公布后，一些居民又开始重新反对这个项目。"},{"en":"The senator stopped criticizing the bill for a month, then returned to reopposing it in public speeches.","zh":"这位参议员有一个月没再批评该法案，之后又在公开演讲中重新反对它。"}]},{"partOfSpeech":"other","definition":{"en":"present participle/gerund form of “reoppose” (used to describe the action of opposing again)","zh":"“reoppose”的现在分词/动名词形式，用来表示“再次反对”的动作或正在发生的状态"},"examples":[{"en":"Reopposing the proposal, the committee asked for more evidence.","zh":"委员会在再次反对该提案时，要求提供更多证据。"}]}],"synonyms":["oppose again","renew opposition (to)","reassert opposition (to)","object again"],"phonetic":"/ˌriəˈpoʊzɪŋ/","extraExplanation":["“reoppose / reopposing”并不是非常常见的英语词形；在更自然的表达里，人们常用“oppose … again”“renew opposition to …”“reassert opposition to …”。","拼写上有时会看到连字符形式“re-opposing”，表示“re-（再次）+ opposing（反对）”。写作时可根据风格选择是否加连字符。"]}
{"word":"reopposition","summary":{"en":"Reopposition means renewed or repeated opposition—resistance that comes back again.","zh":"reopposition 指“重新/再次出现的反对”，即反对态度或阻力又回来了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"renewed or repeated opposition to a person, plan, policy, or idea; opposition that happens again after a pause or change in circumstances","zh":"再次出现或重新形成的反对；在情况变化或暂停之后又重新发生的反对（针对某人、计划、政策或观点）"},"examples":[{"en":"The proposal faced reopposition after new costs were revealed.","zh":"新的成本被披露后，该提案再次遭到反对。"},{"en":"After a brief period of support, reopposition grew within the party.","zh":"在短暂支持之后，党内的反对声再次升高。"}]}],"synonyms":["renewed opposition","resurgent opposition","renewed resistance","opposition again"],"phonetic":"/ˌriːˌɑːpəˈzɪʃən/","extraExplanation":["“reopposition”并不是非常常见、固定的词，更多见于学术写作或政治评论中，用来强调“反对再次发生”。实际使用里更常写作“renewed opposition / opposition again”，或写成带连字符的“re-opposition”（强调“re-”=再次）。","构词法提示：re-（再次）+ opposition（反对）。如果读者不熟悉这个合成形式，用更常见的表达会更自然。"]}
{"word":"reoppress","summary":{"en":"“Reoppress” is a very rare/nonstandard verb meaning “to oppress again.” More common: “re-oppress” or “oppress again.”","zh":"“reoppress”是非常罕见/不规范的动词，意思是“再次压迫”。更常见写法是“re-oppress”或“oppress again”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Very rare / nonstandard) To oppress again; to put a person or group back under harsh control or unfair treatment.","zh":"（非常罕见/不规范）再次压迫；把某人或某群体重新置于残酷控制或不公平对待之下。"},"examples":[{"en":"After the reforms, many feared the new rulers would reoppress the same communities.","zh":"改革之后，许多人担心新统治者会再次压迫同样的群体。"},{"en":"History warns us that a nation can reoppress minorities if protections are removed.","zh":"历史提醒我们：如果取消保护措施，一个国家可能会再次压迫少数群体。"}]}],"synonyms":["re-oppress","oppress again","subjugate again","re-enslave"],"phonetic":"/ˌriːəˈprɛs/","extraExplanation":["“reoppress”不是常见标准拼写。英语里更自然的写法通常是“oppress again”（再次压迫）或“re-oppress”（加连字符，强调“再次”）。","如果你的意思是“压抑/克制（情绪、想法）”，常用词是“repress”（如：repress anger 压抑愤怒），这和“oppress（压迫）”含义不同。"]}
{"word":"reoppression","summary":{"en":"“Reoppression” means renewed oppression—oppression happening again (rare; often written “re-oppression”).","zh":"“reoppression”指“再次/重新出现的压迫”（较少见，常写作“re-oppression”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of oppressing someone again; renewed oppression after a period of relief or freedom (rare, often written with a hyphen: “re-oppression”)","zh":"再次压迫；在一段缓和或获得自由之后重新出现的压迫（较少见，常写作 re-oppression）"},"examples":[{"en":"After the brief reforms, many people feared reoppression by the old regime.","zh":"短暂改革之后，许多人担心旧政权会再次施压与压迫。"},{"en":"The novel ends with a warning about re-oppression if citizens stop paying attention to their rights.","zh":"小说以警告收尾：如果公民不再关注自身权利，压迫可能会卷土重来。"}]}],"synonyms":["re-oppression","renewed oppression","a return to oppression","resurgent oppression"],"phonetic":"/ˌriːəˈprɛʃən/","extraExplanation":["“reoppression”不是常见标准词，更常见的写法是“re-oppression”（用连字符强调“再次”）。在学术或新闻写作中，人们更常用“renewed oppression / a return to oppression”。","很多学习者把它与“repression（镇压；压制；（心理）压抑）”混淆。两者不同：oppression 更强调长期的制度性不公与压迫；repression 常指对言论/活动的镇压或对情绪的压抑。"]}
{"word":"reorchestrate","summary":{"en":"Reorchestrate means to arrange something again—especially to rewrite music for different instruments, or to reorganize parts of a system so they work together better.","zh":"Reorchestrate 指“再次编排/重新统筹”：常见于音乐中的“重新配器”，也可引申为把系统、计划的各部分重新组织得更协调。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To arrange or rewrite music so it is played by different instruments (to create a new orchestration).","zh":"（音乐）为不同乐器重新配器；改编配器。"},"examples":[{"en":"The composer reorchestrated the piano piece for a full orchestra.","zh":"作曲家把这首钢琴曲重新配器，改编成了完整的管弦乐版本。"},{"en":"They reorchestrated the film’s theme to make it sound darker and more dramatic.","zh":"他们重新配器了电影主题曲，让它听起来更黑暗、更有戏剧性。"}]},{"partOfSpeech":"vt.","definition":{"en":"To reorganize how parts of a plan, system, or project work together (often for better coordination).","zh":"（引申）重新组织、重新统筹（计划/系统/项目的各部分协作方式）。"},"examples":[{"en":"After the merger, the company reorchestrated its teams to reduce overlap.","zh":"合并后，公司重新统筹团队结构，以减少重复工作。"},{"en":"We need to reorchestrate the rollout so marketing and support are aligned.","zh":"我们需要重新统筹上线计划，让市场和支持团队步调一致。"}]}],"synonyms":["rearrange","reorganize","reconfigure","recompose","rescore","rework"],"phonetic":"/ˌriˈɔrkəˌstreɪt/","extraExplanation":["这个词由 re-（再次）+ orchestrate（编排/统筹）构成。字面意思来自“管弦乐配器”，因此在商业、科技语境里常用作比喻：像指挥一样把不同部分重新安排到更协调的节奏中。","在科技领域，orchestrate 常指“编排多个服务/流程”（例如云服务、容器、工作流）；reorchestrate 就是“重新编排/调整编排方案”。"]}
{"word":"reorchestrated","summary":{"en":"Reorchestrated means “arranged again for an orchestra or a different instrumentation.”","zh":"reorchestrated 指“为管弦乐队或不同乐器配置重新配器（重新编曲配器）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"arranged again (or differently) for an orchestra or for a different set of instruments.","zh":"（为管弦乐队或不同乐器组合）重新配器的；重新编曲配器的。"},"examples":[{"en":"The composer released a reorchestrated version of the theme for full orchestra.","zh":"作曲家发布了这段主题的全编制管弦乐重新配器版本。"},{"en":"In the concert, they played several reorchestrated songs from the video game.","zh":"音乐会中，他们演奏了几首来自电子游戏的重新配器歌曲。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “reorchestrate”: to arrange music again for an orchestra or a new instrumentation.","zh":"“reorchestrate”的过去式/过去分词：为管弦乐队或新的乐器配置再次进行配器编写。"},"examples":[{"en":"She reorchestrated the piano piece for strings and woodwinds.","zh":"她把那首钢琴曲重新配器为弦乐与木管版本。"},{"en":"The studio reorchestrated the soundtrack to fit the new scene.","zh":"录音棚为了配合新场景，对原声带进行了重新配器。"}]}],"synonyms":["reorchestrated (as adj.)","re-scored","rearranged","re-instrumented"],"phonetic":"/ˌriˈɔrkəˌstreɪtɪd/","extraExplanation":["“reorchestrated”常见于电影配乐、游戏音乐与音乐剧领域：为了适配新的情绪、场景长度、预算或演出阵容，会在不改变核心旋律的情况下调整配器（例如把小编制改成大编制，或把交响化版本改得更流行/电子）。","与“rearranged（重新编曲）”相比，“reorchestrated”更强调“配器/乐器分工与音色层次”的变化，而不一定大改和声或曲式。"]}
{"word":"reorchestrates","summary":{"en":"“Reorchestrates” means arranges music again for different instruments, or (more generally) reorganizes and coordinates something again.","zh":"“reorchestrates”指“重新配器/重新编曲”，也可比喻为“重新统筹组织协调”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to arrange a piece of music again for a different group of instruments (to make a new orchestration)","zh":"（将一首乐曲）重新配器；为不同的乐器组合重新编曲"},"examples":[{"en":"The composer reorchestrates the theme for full orchestra in the final movement.","zh":"作曲家在终乐章把主题重新配器为完整交响乐团版本。"},{"en":"She reorchestrated the song for strings and woodwinds.","zh":"她把这首歌重新配器，改为弦乐和木管为主。"}]},{"partOfSpeech":"v.","definition":{"en":"to reorganize or coordinate a plan, process, or group of people again, often in a more effective way","zh":"（比喻）重新统筹；重新组织协调（计划、流程或人员），使其更有效"},"examples":[{"en":"After the merger, management reorchestrates teams to reduce duplicated work.","zh":"并购后，管理层重新统筹团队，以减少重复工作。"},{"en":"The director reorchestrates the schedule so the crew can finish on time.","zh":"导演重新安排拍摄计划，让剧组能按时完成。"}]}],"synonyms":["rearranges","reorganizes","recoordinates","restructures","re-scores"],"phonetic":"/ˌriˈɔrkəˌstreɪts/","extraExplanation":["“re-”表示“再次、重新”。“orchestrate”本义是“配器/编曲”，在商业或日常语境中常被借用来表示“像指挥乐团一样统筹协调多个要素”，因此“reorchestrate”也常用于“重新整合流程、资源、团队”的意思。","词形提示：reorchestrates 是第三人称单数（he/she/it reorchestrates）。原形是 reorchestrate。"]}
{"word":"reorchestrating","summary":{"en":"Reorchestrating means arranging something again—especially reworking musical orchestration, or reorganizing a complex plan/system.","zh":"reorchestrating 指“重新编配/配器”（多用于音乐），也可引申为“重新统筹、重组复杂的计划或系统”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange (music) again for an orchestra, or to change how instruments are used in a piece","zh":"（音乐）重新为管弦乐队配器；调整某首作品的配器与乐器分工"},"examples":[{"en":"She is reorchestrating the theme to feature more woodwinds.","zh":"她正在重新配器这段主题，让更多木管乐器来突出旋律。"},{"en":"The composer spent weeks reorchestrating the final movement.","zh":"作曲家花了好几周重新配器最后一个乐章。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to reorganize or coordinate parts of a plan, team, or system in a new way","zh":"（引申）重新组织或协调计划、团队或系统的各部分，使其以新的方式运作"},"examples":[{"en":"The company is reorchestrating its teams to respond faster to customers.","zh":"公司正在重新组织各团队，以更快回应客户需求。"},{"en":"We’re reorchestrating the workflow so approvals don’t take so long.","zh":"我们正在重新调整工作流程，让审批不要拖太久。"}]}],"synonyms":["rearranging","reworking","recomposing","reconfiguring","reorganizing","restructuring","recoordinating"],"phonetic":"/ˌriˈɔr.kəˌstreɪ.tɪŋ/","extraExplanation":["“orchestrate”原本是音乐术语，指“为乐队编配/配器”；在现代英语里常引申为“统筹、协调（复杂的活动）”。因此“reorchestrating”既可用于音乐语境，也常见于商业与科技语境（如重组团队、重构流程、重新编排服务之间的协作）。","形式上它是动词“reorchestrate”的现在分词/动名词，可用于进行时（is reorchestrating）或作名词性用法（Reorchestrating takes time）。"]}
{"word":"reorchestration","summary":{"en":"Reorchestration means arranging existing material again—most often re-scoring music for different instruments; more broadly, it can mean reorganizing how parts of a system work together.","zh":"Reorchestration 指对已有内容进行“重新编排”，最常见是音乐上的重新配器；引申也可指对系统各部分协作方式的重新组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of arranging an existing piece of music again (often for different instruments or a different style)","zh":"（音乐）对已有作品进行重新配器/改编（常为不同乐器或不同风格）"},"examples":[{"en":"The film score is a reorchestration of an older theme for a full symphony orchestra.","zh":"这部电影配乐是把一个较老的主题重新配器，改成适用于完整交响乐团的版本。"},{"en":"Her reorchestration highlights the woodwinds and softens the brass.","zh":"她的重新配器突出了木管，并弱化了铜管的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of reorganizing how parts work together (especially in business or technology), using an existing system as the base","zh":"（引申）在原有基础上重新组织各部分如何协作（尤指商业或技术系统）"},"examples":[{"en":"The team proposed a reorchestration of services to reduce delays between components.","zh":"团队提出对各项服务进行重新编排式的调整，以减少组件之间的延迟。"},{"en":"After the merger, the company began a reorchestration of roles and workflows.","zh":"并购后，公司开始对岗位与工作流程进行重新整合与安排。"}]}],"synonyms":["re-scoring","rearrangement","reorchestration","reorganization","restructuring"],"phonetic":"ˌriˌɔr.kəˈstreɪ.ʃən","extraExplanation":["这个词来自 orchestrate（为乐队配器/编排）+ re-（再次），最常见于音乐语境：把同一旋律或作品改写成适合不同编制（如室内乐、管弦乐、爵士大乐队）的版本。","在科技领域它有时被借用，类似“重新编排/重新编排流程”，尤其在谈系统或服务如何协同（如工作流编排、服务编排）时使用；但在正式写作中也常用更通用的词如 reorganization / restructuring。"]}
{"word":"reordain","summary":{"en":"Reordain mainly means to ordain someone again, especially in a church context.","zh":"reordain 主要指（在教会语境中）对某人再次按立/重新授职。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To ordain again; to confer religious authority (especially the priesthood) on someone a second time.","zh":"（尤指授予神职）再次按立；重新授予宗教职权。"},"examples":[{"en":"Some churches do not recognize his earlier ordination and require him to be reordained.","zh":"一些教会不承认他先前的按立，因此要求他重新按立。"},{"en":"After joining a different denomination, she chose to be reordained as a minister.","zh":"加入不同宗派后，她选择重新被按立为牧师。"}]},{"partOfSpeech":"vt.","definition":{"en":"To order or arrange again; to set something in a new order (rare in modern use).","zh":"（较少见）重新安排；再一次下令或整顿顺序。"},"examples":[{"en":"The committee voted to reordain the agenda for the next meeting.","zh":"委员会投票决定为下次会议重新安排议程。"}]}],"synonyms":["ordain again","reconsecrate","recommission"],"phonetic":"/ˌriː.ɔrˈdeɪn/","extraExplanation":["这个词最常见于宗教语境，尤其是讨论不同教派（denomination）之间是否互相承认“按立/授职”（ordination）时。是否需要 reordain 往往涉及教会制度与神学立场，而不只是个人能力或资历。","词形拆解：re-（再次）+ ordain（按立；任命）。现代英语里，非宗教意义上的“重新安排”通常更常用 reorder / rearrange。"]}
{"word":"reordained","summary":{"en":"Reordained means “ordained again,” usually referring to being officially made clergy again by a church.","zh":"reordained 指“再次受按立”，通常用于教会语境，表示再次被正式立为神职人员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in a church) ordained again; made a priest/minister again by a formal religious ceremony.","zh":"（尤指教会中）再次受按立；通过宗教仪式再次被立为神职人员。"},"examples":[{"en":"After joining a different denomination, he was reordained as a minister.","zh":"加入另一个宗派后，他再次受按立成为牧师。"},{"en":"Some churches require clergy to be reordained before serving in a new role.","zh":"有些教会要求神职人员在担任新职务前重新受按立。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “reordain”: to ordain again (especially in a church).","zh":"“reordain”的过去式/过去分词：再次按立（尤指在教会中）。"},"examples":[{"en":"She was reordained in 2020 and began leading a new congregation.","zh":"她在2020年再次受按立，并开始带领一个新的会众。"},{"en":"They reordained him after he returned to ministry.","zh":"他回到牧职后，他们再次为他按立。"}]}],"synonyms":["ordained again","recommissioned","reinstated (in ministry)"],"phonetic":"/ˌriɔrˈdeɪnd/","extraExplanation":["“ordain/按立”常用于基督宗教语境，指教会通过仪式正式授予某人神职身份或权柄。是否需要“reordain/重新按立”取决于宗派制度与教会传统：有的承认其他宗派的按立，有的要求重新按立。"]}
{"word":"reordaining","summary":{"en":"Reordaining means ordaining someone again, especially in a religious context.","zh":"reordaining 指（多在宗教语境中）为某人再次举行按立/授职。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of ordaining someone again (especially a priest or minister), usually because their previous ordination is questioned or not recognized","zh":"再次为某人举行授职（尤其指牧师/神职人员的按立），通常因为先前的按立受到质疑或不被承认"},"examples":[{"en":"The church debated whether reordaining him was necessary after he changed denominations.","zh":"他改宗后，教会讨论是否有必要为他再次按立。"},{"en":"Some traditions avoid reordaining clergy and instead recognize the earlier ordination.","zh":"有些传统避免再次按立神职人员，而是承认其先前的按立。"}]},{"partOfSpeech":"vt.","definition":{"en":"ordaining someone again (doing the ceremony or officially giving the religious office again)","zh":"再次为某人按立/授职（重新举行仪式或重新正式授予神职）"},"examples":[{"en":"The bishop is reordaining candidates whose original records were lost.","zh":"主教正在为那些原始记录遗失的候选人重新按立。"},{"en":"He worries that reordaining her might imply her first ordination was invalid.","zh":"他担心重新按立她会暗示她第一次的按立无效。"}]}],"synonyms":["re-ordain","ordain again","reconsecrate"],"phonetic":"/ˌriːɔrˈdeɪnɪŋ/","extraExplanation":["“reordain / reordaining”主要用于基督宗教语境（如天主教、东正教、圣公会及部分新教）。是否需要再次按立，常与“宗派之间是否承认彼此圣职”（例如是否承认使徒传承、按立礼的有效性）有关。","词形上，reordaining 是动词 reordain 的现在分词/动名词形式；在句中可作动词（正在重新按立）或名词（重新按立这件事）。"]}
{"word":"reordains","summary":{"en":"“Reordains” means “ordains again,” especially in a church setting, or more generally “appoints/establishes again.”","zh":"“reordains”意为“再次按立”（多用于宗教语境），也可泛指“再次任命/重新确立”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(religion) To ordain again; to make someone an official member of the clergy a second time.","zh":"（宗教）再次按立；把某人第二次按立为神职人员。"},"examples":[{"en":"The bishop reordains priests whose earlier ordinations are judged invalid.","zh":"主教会重新按立那些先前按立被判定无效的神父。"},{"en":"In some churches, a minister may be reordained after joining a different denomination.","zh":"在一些教会里，牧师加入不同宗派后可能需要重新按立。"}]},{"partOfSpeech":"vt.","definition":{"en":"More generally, to appoint or establish again in a role or office.","zh":"（较广义）再次任命；重新确立某人的职位或身份。"},"examples":[{"en":"After the merger, the company reordains several managers to their former roles.","zh":"合并后，公司把几位经理重新任命回原来的岗位。"},{"en":"The council reordains the committee with updated rules.","zh":"委员会在更新规则后被议会重新设立。"}]}],"synonyms":["re-ordain","ordain again","reappoint","reinstate"],"phonetic":"/ˌriːɔːrˈdeɪn/","extraExplanation":["“reordains”是动词“reordain”的第三人称单数（he/she/it reordains）。常见于教会语境，涉及某次按立是否被认可（例如跨宗派、程序被认为无效等），因此需要“重新按立”。","在日常英语中更常用的表达往往是“reappoint”（重新任命）或“reinstate”（恢复原职/原状）；“reordain”带有明显的宗教或正式仪式色彩。"]}
{"word":"reorder","summary":{"en":"Reorder means either to change the order of things or to place an order again.","zh":"reorder既可以表示“重新排列顺序”，也可以表示“再次订购/补订”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To arrange things in a new or different order; to change the sequence or position of items.","zh":"把事物重新排列；改变顺序或位置。"},"examples":[{"en":"Please reorder the pages so they’re in the correct order.","zh":"请把这些页面重新排序，让它们按正确顺序排列。"},{"en":"We reordered the furniture to make the room feel bigger.","zh":"我们把家具重新摆放，让房间看起来更大。"},{"en":"The app lets you reorder your playlist anytime.","zh":"这个应用让你随时可以重新排列播放列表。"}]},{"partOfSpeech":"v.","definition":{"en":"To order again, usually because you need more of something (especially goods or supplies).","zh":"再次订购（通常是因为需要补货或再次购买）。"},"examples":[{"en":"We need to reorder printer ink before we run out.","zh":"我们需要在用完之前再次订购打印机墨盒。"},{"en":"If your size is sold out, you can reorder when it’s back in stock.","zh":"如果你的尺码卖完了，你可以在补货后再次下单。"}]}],"synonyms":["rearrange","reshuffle","re-sequence","order again","rebook"],"phonetic":"/ˌriˈɔrdər/","extraExplanation":["“re-”是英语里常见的前缀，表示“再一次/重新”。所以“reorder”可以字面理解为“再次排序/再次订购”。","注意根据语境判断：在文件、列表、步骤、布局里多指“重新排列”；在购物、补货、供应场景里多指“再次下单/补订”。"]}
{"word":"reordered","summary":{"en":"Reordered means arranged again into a different order (as a verb form or an adjective).","zh":"reordered 表示“重新排列成不同顺序”（可作动词的过去式/过去分词，也可作形容词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of reorder) arranged again in a new order.","zh":"（reorder 的过去式/过去分词）重新排列；按新的顺序整理。"},"examples":[{"en":"The teacher reordered the worksheets by student number.","zh":"老师按学生编号把练习册重新排序。"},{"en":"After the update, the app menu was reordered to make it easier to use.","zh":"更新后，应用菜单被重新排列，更容易使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) put into a new order; rearranged.","zh":"（形容词）已重新排序的；已重新排列的。"},"examples":[{"en":"Please check the reordered list for any mistakes.","zh":"请检查这份重新排序的名单有没有错误。"},{"en":"She preferred the reordered paragraphs because the story felt clearer.","zh":"她更喜欢重新排列后的段落，因为故事更清楚了。"}]}],"synonyms":["rearranged","reshuffled","sorted again","reorganized"],"phonetic":"/ˌriːˈɔrdərd/","extraExplanation":["“re-”表示“再次/重新”，和“order（顺序；整理）”组合，reorder 就是“重新整理顺序”。在写作或数据处理中常见：reorder chapters/files/items。"]}
{"word":"reordering","summary":{"en":"Reordering means either rearranging things into a new order or placing an order again.","zh":"Reordering 可指“重新排序/重排”，也可指“再次下单/重新订购”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of changing the order of things; rearranging","zh":"重新排序；调换顺序（把事物按新的顺序排列）"},"examples":[{"en":"The app allows reordering of the playlist by dragging songs up or down.","zh":"这个应用可以通过上下拖动歌曲来对播放列表重新排序。"},{"en":"Reordering the steps made the instructions much easier to follow.","zh":"把步骤重新排序后，说明更容易理解了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of placing an order again (buying the same item again)","zh":"再次下单；重新订购（把同一商品再买一次）"},"examples":[{"en":"We’re reordering printer paper because we’re running low.","zh":"我们快用完打印纸了，所以要再次下单。"},{"en":"Reordering is simple—just click “Buy again.”","zh":"重新订购很简单——点一下“再次购买”就行。"}]},{"partOfSpeech":"v.","definition":{"en":"moving items into a different sequence; changing their arrangement (often used as a verb form)","zh":"重新排列；更改顺序（常作动词的 -ing 形式使用）"},"examples":[{"en":"I’m reordering the files so the newest ones appear first.","zh":"我在重新排列文件，让最新的排在最前面。"},{"en":"She spent the afternoon reordering her notes before the exam.","zh":"她花了一下午在考试前把笔记重新整理排序。"}]}],"synonyms":["rearrangement","reshuffling","reorganization","reordering (again)","re-purchase"],"phonetic":"/ˌriːˈɔr.dɚ.ɪŋ/","extraExplanation":["“reordering”既可以指“重新排序/重排”（更换顺序），也可以指“重新订购/再下单”（再次购买）。具体看语境：playlist / steps / files 多半是“重排”；paper / supplies / item 多半是“再订购”。","在写作里，表示“重新排序”时常见搭配有：reordering of + 名词（the reordering of priorities）。表示“重新订购”时常见搭配有：reordering + 物品（reordering ink cartridges）。"]}
{"word":"reorders","summary":{"en":"“Reorders” means either rearranges something into a new order, or orders something again.","zh":"“reorders” 可指“重新排列顺序”，也可指“再次订购/重新下单”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to change the order of something; to arrange it again in a different sequence","zh":"重新排列；把……按不同顺序再安排"},"examples":[{"en":"The teacher reorders the questions from easiest to hardest.","zh":"老师把问题重新排序，从最简单到最难。"},{"en":"The app reorders your photos by date automatically.","zh":"这个应用会按日期自动重新排列你的照片。"}]},{"partOfSpeech":"v.","definition":{"en":"to order something again (for example, buying more of the same item)","zh":"再次订购；重新下单（再买同样的东西）"},"examples":[{"en":"She reorders the same coffee beans every month.","zh":"她每个月都会再次订购同一种咖啡豆。"},{"en":"Our office reorders paper when supplies run low.","zh":"办公室在纸张快用完时会重新下单采购。"}]}],"synonyms":["rearranges","reshuffles","reorganizes","orders again","repurchases"],"phonetic":"/ˌriːˈɔːrdərz/","extraExplanation":["“reorders” 是动词 “reorder” 的第三人称单数形式（he/she/it reorders）。常见有两种意思：①“重新排列顺序”；②“再次订购”。具体含义要看语境（例如句子里出现 list/files/photos 多半是①；出现 goods/supplies/online 多半是②）。","构词上是 re-（再、重新）+ order（顺序/订购）。同一个词因为 order 既有“顺序”也有“订购”的意思，所以 reorder 也会有两类用法。"]}
{"word":"reordinate","summary":{"en":"Reordinate means to ordain someone again, especially in a church context; more rarely, it can mean to put something back into order.","zh":"Reordinate 通常指在教会语境中“再次按立/再授圣职”；较少见地也可指“重新整理、重新安排”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to ordain again (especially a priest or minister) or to confer holy orders a second time","zh":"（尤指对神职人员）再次授圣职、重新按立"},"examples":[{"en":"Some churches refuse to reordinate clergy who were ordained in another denomination.","zh":"有些教会拒绝对在其他宗派已受按立的神职人员再次按立。"},{"en":"After joining the new church, he was asked whether he needed to be reordinated.","zh":"加入新教会后，有人问他是否需要重新按立。"}]},{"partOfSpeech":"v.","definition":{"en":"to arrange again or put back into order (rare; often replaced by ‘reorganize’)","zh":"重新安排、重新整理（较少见；常用 reorganize 代替）"},"examples":[{"en":"They tried to reordinate the schedule to make room for the new class.","zh":"他们试着重新调整日程，为新课程腾出时间。"}]}],"synonyms":["reordain","ordain again","reorganize","rearrange"],"phonetic":"/ˌriˈɔrdəˌneɪt/","extraExplanation":["这个词很少见，最常出现在宗教语境，指“再次按立/再授圣职”。在日常英语里，如果你想表达“重新整理/重新安排”，通常用 reorganize / rearrange / reschedule 更自然。","拼写上也容易让人联想到 coordinate（协调）或 ordination（按立）。如果你想说“重新协调”，更常用 re-coordinate（或 simply coordinate again）。"]}
{"word":"reordination","summary":{"en":"Reordination means ordaining someone again, usually in a church setting.","zh":"Reordination 指在宗教（多为教会）语境中对某人进行再次按立/重新授予神职。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of ordaining someone again, especially making a person (often a member of the clergy) officially a priest/minister for a second time","zh":"（尤指宗教领域）再度按立；重新授予神职/圣职（使某人再次被正式任命为牧师、神父等）"},"examples":[{"en":"Some churches require reordination if a minister transfers from a different denomination.","zh":"有些教会要求牧师若从其他宗派转来，需要重新按立。"},{"en":"The bishop refused the request for reordination.","zh":"主教拒绝了重新按立的请求。"}]}],"synonyms":["re-ordination","second ordination","reconsecration (related, not always the same)"],"phonetic":"/ˌriˌɔr.dəˈneɪ.ʃən/","extraExplanation":["“reordination”多见于基督宗派相关语境，讨论焦点常在于：不同教会/宗派是否承认彼此的按立有效性、是否需要“再次按立”。在日常英语中比较少用，学术或教会文件里更常见。","词形拆解：re-（再、重新）+ ordination（按立/任命）。在一些传统中，“ordination”带有强烈的宗教仪式与权威认可含义，因此“reordination”往往涉及教义与制度层面的争议。"]}
{"word":"reorganise","summary":{"en":"Reorganise means to arrange something again in a new, usually better, way.","zh":"reorganise 指把某事物重新安排或重组，通常是为了更好地运作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change the structure or arrangement of something so it works better or differently; to put it in a new order","zh":"（为更好地运作或改变方式而）重组；重新安排；改组"},"examples":[{"en":"The company reorganised its sales team to focus on online customers.","zh":"公司对销售团队进行了重组，以便更专注于线上客户。"},{"en":"I reorganised my notes by topic before the exam.","zh":"考试前我按主题重新整理了笔记。"}]},{"partOfSpeech":"vi.","definition":{"en":"to organize yourself or your work again after a change or problem","zh":"（在变化或问题之后）重新组织/调整（自己的工作或计划）"},"examples":[{"en":"After the move, we needed a week to reorganise and settle in.","zh":"搬家后，我们需要一周时间重新调整并安顿下来。"},{"en":"Let’s reorganise and try a different plan.","zh":"我们重新组织一下，换个计划试试。"}]}],"synonyms":["rearrange","restructure","revise","reorder","overhaul"],"phonetic":"/ˌriˈɔrɡəˌnaɪz/","extraExplanation":["“reorganise”是英式拼写；美式更常用“reorganize”。两者意思相同。","常见名词形式：reorganization / reorganisation（重组；改组；重整）。在商业语境中常指公司结构、部门或流程的调整。"]}
{"word":"reorganised","summary":{"en":"“Reorganised” means something has been reorganized—its structure or arrangement has been changed to work better.","zh":"“reorganised”表示已经被重组或重新安排，即为了更高效而改变结构或布局。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “reorganise”: to change the structure or arrangement of something to make it work better","zh":"“reorganise”的过去式和过去分词：重新组织；调整结构或安排，使其更高效"},"examples":[{"en":"The company reorganised its sales team to improve customer service.","zh":"公司重组了销售团队，以提升客户服务。"},{"en":"After the merger, the departments were reorganised.","zh":"合并之后，各部门进行了重组。"}]},{"partOfSpeech":"adj.","definition":{"en":"rearranged or restructured","zh":"已重新安排的；已重组的"},"examples":[{"en":"We moved faster with a reorganised schedule.","zh":"在重新安排的日程下，我们推进得更快。"}]}],"synonyms":["restructured","rearranged","reshaped","realigned","revamped"],"phonetic":"/ˌriˈɔrɡənaɪzd/","extraExplanation":["“reorganised”是英式拼写（-ise）。美式英语更常写作“reorganized”（-ize），意思相同。","常见搭配：reorganised team/department/system/plan（重组的团队/部门/系统/计划）。语境多用于公司、政府机构、学校或项目管理等。"]}
{"word":"reorganiser","summary":{"en":"Reorganiser means a person or tool that reorganizes something; it’s the British spelling of reorganizer.","zh":"reorganiser 指“重新组织/整理的人或工具”，是 reorganizer 的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, tool, or thing that reorganizes something (puts it into a new, better order)","zh":"重新组织者；改组工具/事物（把某物重新整理成更好的结构或顺序）"},"examples":[{"en":"The new manager became the main reorganiser of the department.","zh":"新经理成了这个部门的主要改组者。"},{"en":"This app works as a photo reorganiser and sorts pictures by date.","zh":"这个应用可以当作照片整理工具，按日期把图片分类。"}]}],"synonyms":["reorganizer","restructurer","organizer","planner"],"phonetic":"/ˌriˈɔrɡəˌnaɪzər/","extraExplanation":["“reorganiser”是英式拼写；美式更常写作“reorganizer”。两者意思相同。","词根拆分：re-（再次）+ organize（组织）+ -er（做……的人/物），所以整体就是“再次组织的人或工具”。"]}
{"word":"reorganising","summary":{"en":"Reorganising means arranging something again in a new or better structure; it can also mean the process of doing so.","zh":"reorganising 指把某事重新组织/调整成更好的结构；也可指这一过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “reorganise/reorganize”: arranging something again in a new, more effective way (often a system, team, or company).","zh":"“reorganise/reorganize”的现在分词：对某事物进行重新组织/调整，使其更有条理或更有效（常指系统、团队或公司）。"},"examples":[{"en":"The company is reorganising its sales team to focus on online customers.","zh":"公司正在重组销售团队，把重点放在网购客户上。"},{"en":"We’re reorganising the schedule so everyone gets a fair break.","zh":"我们正在调整日程安排，让每个人都能公平休息。"},{"en":"She spent the weekend reorganising her notes for the exam.","zh":"她周末用来重新整理考试笔记。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a noun/gerund) the act or process of reorganising.","zh":"（作名词/动名词）重新组织/重整的行为或过程。"},"examples":[{"en":"Reorganising takes time, but it can make work much smoother.","zh":"重组需要时间，但它能让工作更顺畅。"},{"en":"After the reorganising, communication improved a lot.","zh":"重整之后，沟通改善了很多。"}]}],"synonyms":["restructuring","rearranging","reorganizing","reshuffling","overhauling"],"phonetic":"/ˌriˈɔrɡəˌnaɪzɪŋ/","extraExplanation":["“reorganising”是英式拼写；美式通常写作“reorganizing”。两者意思相同。","在职场语境里，它常带有“结构调整/部门重组/流程再设计”的含义，有时也会让人联想到公司裁员或职责变化，但不一定总是负面。"]}
{"word":"reorganization","summary":{"en":"Reorganization means arranging something again in a new way, especially changing a company’s structure to work better.","zh":"reorganization 指重新组织/调整安排；也常指公司或机构的结构性“重组”，以提升效率或表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of organizing something again in a new way to improve how it works.","zh":"把某事物重新组织、重新安排（通常为了让它更有效）。"},"examples":[{"en":"The reorganization of the library made it easier to find books.","zh":"图书馆的重新整理让找书更容易了。"},{"en":"After the move, we did a full reorganization of the kitchen shelves.","zh":"搬家后，我们把厨房架子彻底重新整理了一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"A change in the structure of a company or institution (such as departments, roles, or leadership), often to reduce costs or improve performance.","zh":"（公司/机构的）重组；改组（如部门、岗位或管理层的调整，常为降本增效）。"},"examples":[{"en":"The company announced a reorganization to streamline operations.","zh":"公司宣布重组以精简运营。"},{"en":"Many employees were reassigned during the reorganization.","zh":"在重组期间，许多员工被重新分配岗位。"},{"en":"The merger led to a major reorganization of the two teams.","zh":"合并导致两个团队进行了大规模重组。"}]}],"synonyms":["restructuring","rearrangement","realignment","overhaul","reform"],"phonetic":"/ˌriˌɔrɡənəˈzeɪʃən/","extraExplanation":["“reorganization”常用于商业与管理语境，含义比普通的“reorganizing”更正式，常暗示组织结构、权责或流程的系统性调整。","拼写上美式更常见“reorganization”，英式有时也写“re-organisation / reorganization”；是否加连字符（re-）通常取决于风格指南与排版习惯。"]}
{"word":"reorganizational","summary":{"en":"“Reorganizational” means related to reorganization—changing how an organization is structured or run.","zh":"“reorganizational”意为“与重组/重新组织有关的”，指改变组织结构或运作方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to reorganizing something—changing its structure, roles, or systems to work better.","zh":"与“重组/重新组织”有关的——改变结构、角色或制度以更好地运作。"},"examples":[{"en":"The company announced a reorganizational plan to reduce costs and speed up decision-making.","zh":"公司宣布了一项重组计划，以降低成本并加快决策速度。"},{"en":"After the merger, there were reorganizational changes in several departments.","zh":"合并之后，多个部门出现了重组性的变化。"}]}],"synonyms":["restructuring","organizational","reorganization-related"],"phonetic":"/ˌriˌɔrɡənəˈzeɪʃənəl/","extraExplanation":["“reorganizational”常见于商业、管理、政府等正式语境，表示“与重组相关的”。在日常口语里，人们更常说“reorganization”或直接说“organizational changes / restructuring”。","常见搭配：reorganizational plan（重组计划）、reorganizational changes（重组性变动）、reorganizational effort（重组工作/努力）。","相关近义表达：restructuring（重组/改组，尤其公司结构）、organizational（组织的）、administrative（行政的）。其中“restructuring”在企业语境里更常用、更自然。"]}
{"word":"reorganizationist","summary":{"en":"A reorganizationist is someone who advocates reorganizing or restructuring a system or organization.","zh":"reorganizationist 指主张对某个组织或制度进行重组/重构的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or calls for reorganizing an organization, system, or institution (such as a company, government, or political party)","zh":"主张（或支持）对组织、制度或机构（如公司、政府、政党）进行重组的人"},"examples":[{"en":"The reorganizationists argued that the company needed fewer departments and clearer roles.","zh":"这些重组派认为公司需要更少的部门和更清晰的分工。"},{"en":"In the debate, reorganizationists pushed for a complete rewrite of the party’s rules.","zh":"在辩论中，重组派主张彻底改写党的章程。"}]}],"synonyms":["reformer","restructurer","restructuring advocate","change agent","modernizer"],"phonetic":"/ˌriˌɔrɡənaɪˈzeɪʃənɪst/","extraExplanation":["这个词在现代英语里很少见，更常见的说法是 reformer（改革者）、restructuring advocate（主张重组的人）、change agent（变革推动者）。","构词可以拆开理解：re-（再次）+ organize（组织）+ -ation（名词后缀）+ -ist（“……主义者/支持者”）。","语境上常出现在政治史或组织管理讨论中，用来强调“不是小修小补，而是结构性调整/重建”的立场。"]}
{"word":"reorganizations","summary":{"en":"“Reorganizations” means multiple changes or rounds of restructuring—organizing something again in a new way, often in companies or institutions.","zh":"“reorganizations”指多次重组/改组，即把组织或系统重新安排成新的结构，常用于公司或机构语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Changes to the structure of something (such as a company, team, or system) to make it work better; the act of organizing again in a new way.","zh":"对某事物（如公司、团队或系统）的结构进行调整以改善运作；重新组织、改组。"},"examples":[{"en":"The company announced several reorganizations after the merger.","zh":"合并后，公司宣布进行了几次重组。"},{"en":"These reorganizations are meant to cut costs and speed up decision-making.","zh":"这些重组旨在降低成本并加快决策速度。"},{"en":"Staff felt uncertain during the reorganizations, but communication helped.","zh":"在重组期间员工感到不安，但良好的沟通有所帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"Specific events or rounds of restructuring (often in business or government).","zh":"（常用于商业或政府）具体的一次或多次结构调整/改制行动。"},"examples":[{"en":"Three reorganizations in two years created confusion about roles.","zh":"两年内三次重组让大家对职责分工感到困惑。"},{"en":"The department is preparing for another reorganization next quarter.","zh":"该部门正在为下个季度的再次改组做准备。"}]}],"synonyms":["restructurings","reforms","overhauls","rearrangements","realignments"],"phonetic":"/ˌriˌɔrɡənəˈzeɪʃənz/","extraExplanation":["“reorganizations”是复数形式，常见于职场语境，尤其指并购后、业务转型时对部门、汇报关系、岗位职责的调整。","搭配很常见：organizational reorganization（组织重组）、internal reorganization（内部重组）、major/minor reorganization（重大/小幅重组）。"]}
{"word":"reorganize","summary":{"en":"Reorganize means to arrange something again in a new, more effective way, or to change a group/system’s structure.","zh":"reorganize 指把某事重新整理/重组以更有效，或指团体/系统调整结构并重新组织。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange something again in a new, clearer, or more effective way (people, tasks, information, plans, etc.)","zh":"把某事重新安排/重组，使之更清晰或更有效（人员、任务、信息、计划等）"},"examples":[{"en":"We need to reorganize the schedule so everyone can attend the meeting.","zh":"我们需要重新安排日程，这样大家都能参加会议。"},{"en":"She reorganized her notes by topic before the exam.","zh":"考试前她按主题把笔记重新整理了一遍。"},{"en":"The company reorganized its teams to improve communication.","zh":"公司重组了团队以改善沟通。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a group or system) to change its structure or arrangement; to become organized again","zh":"（团体或系统）调整结构/重新组织；重新变得有条理"},"examples":[{"en":"After the merger, the department reorganized into three smaller units.","zh":"合并后，这个部门重组为三个更小的单位。"},{"en":"The volunteers reorganized quickly after the sudden change of plans.","zh":"计划突然改变后，志愿者们很快重新组织起来。"}]}],"synonyms":["restructure","rearrange","revise","reorder","reshuffle","reconfigure"],"phonetic":"/ˌriːˈɔrɡənaɪz/","extraExplanation":["“re-”表示“再次/重新”，与“organize（组织；整理）”结合形成“reorganize”。","美式拼写常见为 reorganize；英式拼写也常见 reorganise（-ise）。两者意思相同。","常用于工作与学习场景：reorganize a team/department（重组团队/部门）、reorganize files/notes（重新整理文件/笔记）、reorganize a plan/schedule（调整计划/日程）。"]}
{"word":"reorganized","summary":{"en":"“Reorganized” means arranged again in a new structure or order (often to improve efficiency).","zh":"“reorganized”表示“重新组织/改组/整理过”，常指为提升效率而调整结构或顺序。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"arranged again in a new way to make something work better or differently","zh":"重新安排或改组，使事物以新的方式运作（通常为了更有效或不同）"},"examples":[{"en":"After the merger, the company was reorganized into three smaller teams.","zh":"合并之后，公司被重新组织成三个更小的团队。"},{"en":"My notes are reorganized by topic, so they’re easier to review.","zh":"我的笔记按主题重新整理过，所以更容易复习。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of reorganize: to change the structure or order of something again","zh":"reorganize 的过去式/过去分词：再次改变某事物的结构或顺序"},"examples":[{"en":"We reorganized the schedule to reduce overtime.","zh":"我们重新调整了日程安排，以减少加班。"},{"en":"The library has reorganized its shelves by genre.","zh":"图书馆已按体裁重新整理书架。"}]}],"synonyms":["restructured","rearranged","reshuffled","reordered","overhauled"],"phonetic":"/ˌriːˈɔrɡənaɪzd/","extraExplanation":["“re-”表示“再一次/重新”，所以 reorganize 强调“把原本的组织结构再调整”。","美式英语常写 reorganize；英式英语常写 reorganise（-ize / -ise 的拼写差异，意思相同）。"]}
{"word":"reorganizer","summary":{"en":"Reorganizer means a person or tool that reorganizes something into a new order or structure.","zh":"Reorganizer 指“重新组织/重整”的人或工具，把事物按新的顺序或结构整理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, group, or tool that reorganizes something (puts it into a new order or structure).","zh":"对某事进行重新组织的人、团体或工具（把事物按新的顺序或结构整理）。"},"examples":[{"en":"She became the project’s reorganizer, redesigning the schedule and team roles.","zh":"她成了这个项目的“重组者”，重新设计了进度表和团队分工。"},{"en":"This app works as a photo reorganizer that sorts pictures by date and place.","zh":"这个应用相当于照片整理工具，会按日期和地点给图片重新排序。"}]}],"synonyms":["restructurer","organizer","rearranger","coordinator"],"phonetic":"/ˌriːˈɔrɡəˌnaɪzər/","extraExplanation":["“reorganizer”由 re-（再次）+ organize（组织）+ -er（做某事的人/工具）构成，常用于描述“负责把系统、团队、文件、信息重新整理的人”，也可指“用于重新整理的工具/软件”。","实际写作中更常见的表达有：a person who reorganizes… / a reorganization tool；当指人时也常用 organizer（组织者/筹办者），但 reorganizer 更强调“把原有东西重新组织”。"]}
{"word":"reorganizers","summary":{"en":"Reorganizers are people, groups, or tools that reorganize something—arranging it again in a better or different way.","zh":"Reorganizers 指进行重新组织/重新安排的人、团体或工具，把事物以更好或不同的方式重新整理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People, groups, or tools that reorganize something (change its structure so it is arranged in a better or different way).","zh":"对某事物进行“重新组织/重新安排”的人、团体或工具（把结构调整得更合理或不同）。"},"examples":[{"en":"The reorganizers created new teams to improve communication.","zh":"重组人员建立了新团队，以改善沟通。"},{"en":"After the merger, reorganizers reviewed every department’s roles.","zh":"并购后，重组团队审查了每个部门的职责分工。"},{"en":"Some file reorganizers can sort your documents automatically.","zh":"一些文件整理工具可以自动对你的文档进行分类。"}]}],"synonyms":["restructurers","rearrangers","organizers","coordinators"],"phonetic":"/ˌriˈɔrɡəˌnaɪzərz/","extraExplanation":["“reorganizers”是“reorganizer”的复数。词形结构：re-（再次）+ organize（组织）+ -er（做……的人/工具）+ -s（复数）。因此既可指“重组的人/团队”，也可指“用来重组/整理的工具（如软件）”。","常见搭配：corporate reorganizers（企业重组人员/团队）、department reorganizers（部门重组者）、file/folder reorganizers（文件/文件夹整理工具）。"]}
{"word":"reorganizes","summary":{"en":"“Reorganizes” means arranges something again or restructures a group/system to work better.","zh":"“reorganizes”表示把某事重新整理，或对团队/系统进行重组以更有效运作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to arrange something again in a new, clearer, or more effective way","zh":"把某事物重新组织/重新安排，使其更清晰或更有效"},"examples":[{"en":"She reorganizes her notes before every exam.","zh":"她每次考试前都会重新整理笔记。"},{"en":"The manager reorganizes the team to improve communication.","zh":"经理重新调整团队来改善沟通。"}]},{"partOfSpeech":"v.","definition":{"en":"to change the structure of a group, company, or system (for example, roles, departments, or rules)","zh":"对团体、公司或系统进行重组（例如调整部门、职责或规则）"},"examples":[{"en":"The company reorganizes its departments after the merger.","zh":"公司在合并后重组各个部门。"},{"en":"The school reorganizes its schedule to give students more study time.","zh":"学校重新安排课程表，让学生有更多自习时间。"}]}],"synonyms":["rearranges","restructures","reorders","reshuffles","revamps"],"phonetic":"/ˌriˈɔrɡəˌnaɪz/","extraExplanation":["“re-”表示“再次/重新”，所以 reorganize = organize（组织）+ re-（重新）。","美式常见拼写是 organize / reorganize；英式常见拼写是 organise / reorganise。","“reorganizes”是第三人称单数现在时（he/she/it reorganizes）。如果说“正在重组”，常用 is reorganizing。"]}
{"word":"reorganizing","summary":{"en":"Reorganizing means changing the arrangement or structure of something to create a better order; it can also mean the process of doing this.","zh":"reorganizing 指为了更好的秩序而重新调整安排或结构；也可指“重组/重新整理”的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing the way something is arranged or structured so it works better; putting it into a new order","zh":"重新调整……的安排或结构，使其更有效；重新排序"},"examples":[{"en":"We’re reorganizing the office so teams can sit together.","zh":"我们正在重新调整办公室布局，让团队能坐在一起。"},{"en":"She spent the weekend reorganizing her notes for the exam.","zh":"她用周末时间重新整理了考试笔记。"},{"en":"The company is reorganizing its departments to cut costs.","zh":"公司正在重组各部门以降低成本。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or act of reorganizing something","zh":"重组；重新整理（这一过程或行为）"},"examples":[{"en":"After the reorganizing, communication became faster.","zh":"重组之后，沟通变得更快了。"},{"en":"The reorganizing of the library took two months.","zh":"图书馆的重新整理花了两个月。"}]}],"synonyms":["restructuring","rearranging","reordering","reshaping","revamping"],"phonetic":"/ˌriˈɔrɡəˌnaɪzɪŋ/","extraExplanation":["reorganizing 来自动词 reorganize（re- “再次” + organize “组织/整理”）。英式拼写常见为 reorganise。","在职场语境里，reorganizing 常指“重组/改组”（如部门、流程）；在生活语境里更常指“整理收纳”（如房间、文件）。"]}
{"word":"reorient","summary":{"en":"Reorient means to adjust direction or focus again, or to regain your sense of direction.","zh":"reorient 指“重新调整方向/重点”，也可指“重新辨明方向、重新适应”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To change the direction, position, or focus of something (or someone) so it is correctly aligned or aimed again.","zh":"使（某物/某人）重新调整方向、位置或重点；重新对准。"},"examples":[{"en":"The guide helped us reorient the map so north was at the top.","zh":"向导帮我们把地图重新调整方向，让北方在上面。"},{"en":"After the merger, the company reoriented its strategy toward online services.","zh":"合并后，公司把战略重点重新调整到线上服务。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become oriented again; to find your bearings after being confused or in a new place.","zh":"（自己）重新辨明方向；重新适应（陌生环境/新情况）。"},"examples":[{"en":"I got off at the wrong station and needed a minute to reorient.","zh":"我在错误的车站下车了，需要一点时间重新辨明方向。"},{"en":"After a short break, she reoriented and continued the presentation confidently.","zh":"短暂休息后，她重新理清思路，自信地继续演讲。"}]}],"synonyms":["realign","redirect","refocus","reposition","recalibrate"],"phonetic":"/ˌriˈɔriˌɛnt/","extraExplanation":["词根提示：orient 表示“使朝向东方/确定方向”，来自 “Orient（东方）”。后来引申为“熟悉环境、找到方位/定位重点”。re- 表示“再次”，所以 reorient 就是“再次定位/重新调整方向或重点”。","常见搭配：reorient yourself（让自己重新找准方向/状态）；reorient toward/to + 目标（把重点转向……）；reorientation（名词：重新定位/重新调整）。"]}
{"word":"reorientate","summary":{"en":"Reorientate means to turn something again to a new direction, or to refocus and adjust thinking/behavior to fit a new situation; it can also mean to regain your sense of place.","zh":"reorientate 指把某物重新调整到新的方向；也指重新聚焦、调整思维或做法以适应新情况；还可指重新找回方向感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change the position or direction of something so it faces a new way; to turn or align again","zh":"重新调整（某物）的方向或位置；使重新对准"},"examples":[{"en":"Please reorientate the map so north is at the top.","zh":"请把地图重新摆正，让北方在上面。"},{"en":"The engineer reorientated the camera toward the stage.","zh":"工程师把摄像头重新对准舞台。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change how someone thinks or acts so they can adapt to a new situation; to refocus","zh":"重新调整（思维/做法）以适应新情况；重新定位重点"},"examples":[{"en":"After the company changed goals, the team had to reorientate its strategy.","zh":"公司更换目标后，团队不得不重新调整策略。"},{"en":"Moving abroad forced her to reorientate her expectations.","zh":"搬到国外迫使她重新调整自己的期待。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become familiar with a new place or situation again; to regain your sense of direction","zh":"（在新环境中）重新适应；重新找回方向感"},"examples":[{"en":"I got lost in the building and needed a minute to reorientate.","zh":"我在楼里迷路了，需要一点时间重新辨认方向。"},{"en":"After waking up, he paused to reorientate himself.","zh":"醒来后，他停了一下让自己重新清醒并辨认环境。"}]}],"synonyms":["reorient","realign","redirect","refocus","adjust"],"phonetic":"/ˌriːˈɔːriənˌteɪt/","extraExplanation":["“reorientate”在英式英语中更常见；美式英语里更常用、更简洁的形式是“reorient”。两者意思相同。","词源结构：re-（再次）+ orient（定位/朝向）。既可指物理方向（地图、摄像头、身体），也可指抽象方向（目标、策略、思路）。"]}
{"word":"reorientated","summary":{"en":"Reorientated means redirected or adjusted to a new direction or focus (BrE spelling; AmE usually reoriented).","zh":"reorientated 指“重新定位/重新调整方向或重点”（英式拼写；美式更常用 reoriented）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of reorientate) to change the direction, position, or focus of something so it faces or works in a new way.","zh":"（reorientate 的过去式/过去分词）使……重新定位；改变……的方向、立场或重点，使其朝向新的方向/方式。"},"examples":[{"en":"The company reorientated its strategy toward online sales.","zh":"公司把战略重点重新调整到线上销售。"},{"en":"After the merger, the team was reorientated to new goals and processes.","zh":"并购后，团队被重新导向新的目标和流程。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) having been redirected or adjusted to a new direction or purpose.","zh":"（形容词）已被重新定位/重新调整方向或目标的。"},"examples":[{"en":"She felt reorientated after a few days in the new job.","zh":"在新工作适应了几天后，她感觉自己重新进入了状态。"},{"en":"The reorientated program focuses more on student well-being.","zh":"这个经过重新调整的项目更关注学生的身心健康。"}]}],"synonyms":["reoriented","redirected","refocused","realigned","repositioned"],"phonetic":"/ˌriˈɔriˌɛn.tɪd/","extraExplanation":["“reorientated”常见于英式英语；美式英语更常用拼写“reoriented”。两者意思相同。","词根提示：re-（再次）+ orient（使朝向/定位）。除了“方向”，也常指“工作重点/策略重心”的转移。"]}
{"word":"reorientating","summary":{"en":"“Reorientating” means turning something to a new direction or changing focus/strategy to a new direction.","zh":"“reorientating”指把某物转向新的方向，或把注意力/目标/策略重新调整到新的方向。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing the direction or position of something; turning it to face a new way","zh":"改变某物的方向或位置；把它转向新的朝向"},"examples":[{"en":"The crew is reorientating the satellite so its solar panels face the sun.","zh":"工作人员正在重新调整卫星的方向，让它的太阳能板对准太阳。"},{"en":"She paused to reorientate the map and find north again.","zh":"她停下来把地图重新转正，再次找到北方。"}]},{"partOfSpeech":"v.","definition":{"en":"changing the focus, goals, or way of thinking of a person, group, or plan","zh":"改变个人/团队/计划的重点、目标或思路；重新调整方向"},"examples":[{"en":"After the budget cuts, the company is reorientating its strategy toward online services.","zh":"预算削减后，公司正在把战略重新调整到线上服务。"},{"en":"The workshop helped students reorientate their study habits.","zh":"这次工作坊帮助学生重新调整学习习惯。"}]}],"synonyms":["reorienting","realigning","redirecting","repositioning","refocusing"],"phonetic":"/ˌriˈɔriənteɪtɪŋ/","extraExplanation":["“reorientating”是动词“reorientate”的现在分词/动名词形式（也常写作“reorienting”，更偏美式；“reorientating”更常见于英式英语）。","词根可拆为 re-（再次）+ orient（定向/定位，和“the Orient（东方）”同源：早期欧洲人用“向东方定位”来辨别方向）。因此它既可指“把物体转向”，也常引申为“把注意力/策略重新对准某个方向”。"]}
{"word":"reorientation","summary":{"en":"Reorientation means adjusting your direction or focus, or (in healthcare) helping someone regain awareness of time and place.","zh":"Reorientation 指重新调整方向/重心，或（在医疗照护中）帮助恢复对时间与地点等的辨识能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of changing direction, position, or focus; adjusting to a new situation or environment","zh":"重新定向；（对环境/目标的）重新调整与适应"},"examples":[{"en":"After moving to a new city, the first few weeks were a period of reorientation.","zh":"搬到新城市后，最开始的几周是一段重新适应的时期。"},{"en":"The therapist helped him with reorientation after the injury.","zh":"治疗师帮助他在受伤后进行重新定向（重新适应与找回方向感）。"},{"en":"The company’s reorientation toward renewable energy changed its long-term plans.","zh":"公司将重心重新转向可再生能源，改变了长期规划。"}]},{"partOfSpeech":"n.","definition":{"en":"the restoration of someone’s sense of time, place, or identity (often in medical or care settings)","zh":"（常用于医疗/照护语境）帮助恢复对时间、地点或自我身份的辨识能力"},"examples":[{"en":"Nurses used gentle questions for reorientation: “Do you know what day it is?”","zh":"护士用温和的问题来帮助重新定向：“你知道今天星期几吗？”"},{"en":"Frequent reorientation can reduce anxiety in patients with dementia.","zh":"经常进行重新定向能减轻失智症患者的焦虑。"}]}],"synonyms":["readjustment","realignment","refocusing","recalibration","repositioning","retraining"],"phonetic":"/ˌriˌɔr.i.ənˈteɪ.ʃən/","extraExplanation":["“reorientation”由 re-（再次）+ orientation（定向；方向感；适应）构成，常见于三类语境：①生活与学习：到新环境后的“适应期”；②工作与战略：组织“转向/调整方向”；③医疗照护：针对谵妄、失智或术后意识混乱的“定向力训练”。","常见搭配：a period of reorientation（重新适应期）；reorientation to/ toward…（转向/重新聚焦于……）；provide/offer reorientation（提供定向提示）；reorientation therapy（定向训练/定向疗法，常与现实导向 reality orientation 相关）。"]}
{"word":"reorientations","summary":{"en":"“Reorientations” means changes or adjustments in direction, focus, or viewpoint (plural of reorientation).","zh":"“reorientations”指在方向、重点或观点上的重新调整（reorientation 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Changes in direction, focus, or point of view; processes of turning again toward a new goal or way of thinking.","zh":"方向、重点或观点的重新调整；把注意力或行动转向新目标/新思路的过程。"},"examples":[{"en":"After the merger, the company went through several reorientations to match the new market.","zh":"合并后，公司经历了几次重新定位，以适应新市场。"},{"en":"Moving to a new country often requires reorientations in daily habits and social norms.","zh":"搬到新的国家通常需要在日常习惯和社会规范上做出重新适应与调整。"},{"en":"Therapy can help with reorientations in how you see yourself and your relationships.","zh":"心理咨询可以帮助你在自我认知和人际关系的看法上进行重新调整。"}]},{"partOfSpeech":"n.","definition":{"en":"(More specific) The act of helping someone regain their sense of direction or understanding after confusion or disruption.","zh":"（更具体）在迷失、混乱或遭遇变化后，帮助某人重新找回方向感或理解的行为。"},"examples":[{"en":"Clear signs in the airport allowed quick reorientations for travelers.","zh":"机场清晰的指示牌让旅客能迅速重新辨明方向。"},{"en":"The teacher’s summary provided a reorientation after the difficult reading.","zh":"老师的总结在阅读难点之后起到了“重新理清思路”的作用。"}]}],"synonyms":["realignments","shifts","adjustments","refocusing","repositionings"],"phonetic":"/ˌriːˌɔːriənˈteɪʃənz/","extraExplanation":["“reorientation”由 re-（再次、重新）+ orientation（方向、定位、取向）构成。既可指物理上的“重新定向”，也常见于商业（战略调整）、教育（学习方向调整）、心理与社会议题（价值观/身份认同的再定位）等语境。","常见搭配：strategic reorientation（战略重心调整）、policy reorientation（政策转向）、cultural reorientation（文化适应/再定位）。"]}
{"word":"reoriented","summary":{"en":"Reoriented means changed to a new direction or focus, or having found your direction again.","zh":"reoriented 指“重新定向/重新调整方向或重点”，也可指“重新找回方向感”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or thing) adjusted or turned to face a different direction, position, or focus; changed to a new orientation.","zh":"（人或事物）被重新调整到不同的方向、位置或关注重点；重新定向的。"},"examples":[{"en":"After getting lost, I looked at the map and felt reoriented.","zh":"迷路之后，我看了地图，感觉自己重新找到了方向。"},{"en":"The company became reoriented toward online sales.","zh":"这家公司把重点重新转向了线上销售。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense of “reorient”: to change direction or focus; to help someone find their direction again.","zh":"“reorient”的过去式：改变方向或重点；帮助某人重新辨明方向。"},"examples":[{"en":"The signs reoriented visitors toward the main entrance.","zh":"这些指示牌把访客引导回正门方向。"},{"en":"The new manager reoriented the team’s goals for the next quarter.","zh":"新经理重新调整了团队下个季度的目标。"}]}],"synonyms":["redirected","refocused","realigned","repositioned","adjusted"],"phonetic":"/ˌriˈɔriˌɛn.tɪd/","extraExplanation":["“re-”表示“再次/重新”，与“orient”（定向、使适应）组合成“reorient”。在职场语境里常指“调整战略重点”（reorient toward…）；在空间语境里常指“重新辨别方向”。","美式英语里更常见拼写是 reorient / reoriented；英式英语中也常见 reorientate / reorientated。"]}
{"word":"reorienting","summary":{"en":"Reorienting means adjusting direction or shifting focus to fit a new situation.","zh":"reorienting 指重新调整方向，或把重心/策略转向以适应新情况。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing direction, position, or alignment so something faces a new way; adjusting so it points correctly again","zh":"改变方向、位置或对齐方式，使某物转向新的方向；重新校准指向"},"examples":[{"en":"The pilot kept reorienting the plane toward the runway.","zh":"飞行员不断把飞机重新调整方向对准跑道。"},{"en":"After the map app froze, I restarted it and reoriented the screen to north.","zh":"地图应用卡住后我重启了它，并把屏幕方向重新调整为朝北。"}]},{"partOfSpeech":"v.","definition":{"en":"changing your goals, priorities, or way of thinking to fit a new situation","zh":"调整目标、优先事项或思维方式，以适应新情况"},"examples":[{"en":"The company is reorienting its strategy toward renewable energy.","zh":"这家公司正在把战略重新调整为面向可再生能源。"},{"en":"After moving abroad, she spent months reorienting herself to a new culture.","zh":"搬到国外后，她花了几个月让自己重新适应一种新文化。"}]}],"synonyms":["realigning","redirecting","adjusting","refocusing","reshaping"],"phonetic":"/ˌriˈɔːriˌentɪŋ/","extraExplanation":["“reorienting”是动词“reorient”的现在分词/动名词形式，常用于进行时（is reorienting）或作名词性用法（Reorienting takes time）。","既可指“物理方向”的重新定位，也常用于更抽象的“重心/策略/观念”的转向；商业、教育与心理适应语境里很常见。"]}
{"word":"reorients","summary":{"en":"“Reorients” means “turns or adjusts again,” either physically (direction/position) or mentally/strategically (focus and priorities).","zh":"“Reorients”表示“重新调整/重新定向”，既可指物理方向位置的调整，也可指思路、重点或策略的重新定位。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of reorient) to change direction or position so something faces a new way; to turn again.","zh":"（reorient 的第三人称单数）使（某物）改变方向或位置，重新朝向；再次转向。"},"examples":[{"en":"She reorients the map so north is at the top.","zh":"她把地图重新摆正，让北方在上面。"},{"en":"The camera automatically reorients when you rotate the phone.","zh":"你转动手机时，相机会自动重新调整方向。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of reorient) to change the focus, goals, or approach of a person, group, or plan; to shift priorities.","zh":"（reorient 的第三人称单数）重新调整（人/团队/计划）的重点、目标或方法；改变优先事项。"},"examples":[{"en":"After the market changed, the company reorients its strategy toward online sales.","zh":"市场变化后，公司把战略重新调整到线上销售。"},{"en":"The teacher reorients the discussion back to the main question.","zh":"老师把讨论重新引回到核心问题。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of reorient) to help someone regain their sense of direction or understanding after confusion.","zh":"（reorient 的第三人称单数）帮助某人在迷失/困惑后重新辨明方向或理清思路。"},"examples":[{"en":"A short break reorients him after a long meeting.","zh":"短暂休息能让他在长会后重新理清思路。"},{"en":"Clear signs reorient visitors who get lost in the building.","zh":"清晰的标识能帮助在大楼里迷路的访客重新找到方向。"}]}],"synonyms":["realigns","redirects","adjusts","refocuses","repositions"],"phonetic":"/ˌriːˈɔːriˌɛnts/","extraExplanation":["“reorients”来自动词 reorient（re- + orient）。re- 表示“再次/重新”，orient 表示“定向、使朝向、使适应”。","拼写上常见 reorient 与 re-orient 两种形式；含义相同。英式写法里带连字符的版本更常见一些。","在商业与写作语境中，reorient 常指“调整重点/策略”，比“turn”更强调“为了适应新情况而改变方向”。"]}
{"word":"reornament","summary":{"en":"Reornament means to decorate something again by adding new decorative details.","zh":"Reornament 指“再次装饰”，即重新添加装饰细节。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to decorate again; to add new ornaments or decorative details to something that has been decorated before","zh":"再次装饰；重新加上装饰物或装饰细节"},"examples":[{"en":"After the renovation, they reornamented the hall with simple lights and fresh flowers.","zh":"翻新后，他们用简洁的灯光和鲜花重新装饰了大厅。"},{"en":"The designer decided to reornament the dress with a new lace collar.","zh":"设计师决定给这条裙子重新加上新的蕾丝领。"}]}],"synonyms":["redecorate","re-embellish","adorn again","decorate again"],"phonetic":"/ˌriˈɔrnəmənt/","extraExplanation":["“reornament”由 re-（再次、重新）+ ornament（装饰）构成，但在现代英语里非常少见。日常更常用的说法是 “decorate again / redecorate / re-embellish”。","在艺术修复、建筑翻新或服装改造的语境中，这个词更容易出现，用来强调“原本就有装饰→后来改动→现在又重新加装饰”。"]}
{"word":"reotene","summary":{"en":"“reotene” isn’t standard English; you probably mean “routine.”","zh":"“reotene”不是标准英文；你很可能想写“routine（惯例/日常流程）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “routine” (a regular way of doing things).","zh":"不是标准英文单词。很可能是“routine”的拼写错误（指做事的固定方式、日常惯例）。"},"examples":[{"en":"Did you mean “routine”? I have a morning routine: coffee, shower, then work.","zh":"你是不是想写“routine”？我有一个早晨的日常：咖啡、洗澡，然后上班。"},{"en":"Exercise became part of her daily routine.","zh":"锻炼成了她日常生活的一部分。"}]}],"synonyms":["habit","custom","regular schedule","pattern"],"phonetic":"/ruˈtin/","extraExplanation":["“reotene”在常见英语词典中一般查不到。如果你想表达“日常惯例/固定流程”，最常用的是 routine。","如果你指的是科学名词，也可能想写“retene”（一种多环芳香烃，常见于地球化学/燃烧产物相关语境），但这属于专业词汇。你可以告诉我你看到它的句子或领域，我可以帮你确认。"]}
{"word":"reoutfit","summary":{"en":"Reoutfit means to dress again or provide a new outfit.","zh":"Reoutfit 指重新穿戴或再次配备一套新服装。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to dress someone (or yourself) in new clothes, or to provide a new outfit again","zh":"（给某人或自己）重新穿戴、换上一套新的衣服；再次配备服装"},"examples":[{"en":"We had to reoutfit the actors after the costumes got wet.","zh":"戏服弄湿后，我们不得不给演员们重新换装。"},{"en":"She reoutfitted herself for the evening event.","zh":"她为晚上的活动重新换了一身衣服。"},{"en":"The company reoutfitted the team with winter jackets.","zh":"公司为团队重新配发了冬季外套。"}]}],"synonyms":["change outfits","get changed","redress","refit","re-equip"],"phonetic":"/ˌriːˈaʊtˌfɪt/","extraExplanation":["“re-”表示“再次/重新”，加在“outfit”（给…配备服装；装备）前形成动词“reoutfit”。它在日常口语中不算常见，更常见的表达是“change outfits / get changed / refit / re-equip / re-dress（更偏舞台/儿童）”，但在戏剧、电影制作、零售、团队制服等语境里更自然。"]}
{"word":"reoutfitted","summary":{"en":"Reoutfitted means “equipped again,” usually with updated gear or features.","zh":"reoutfitted 指“重新配备/再次装备”，通常带有升级或更新之意。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle) outfitted again; equipped again, often with new or updated gear, clothing, or parts.","zh":"（过去式/过去分词）再次配备；重新装备（常指换上新的或升级的装备、衣物或部件）。"},"examples":[{"en":"The hiking team reoutfitted the older members with lighter backpacks.","zh":"徒步队给年长队员重新配备了更轻的背包。"},{"en":"After the renovation, the restaurant was reoutfitted with modern lighting and new chairs.","zh":"翻新后，这家餐厅重新配备了现代灯具和新椅子。"},{"en":"The company reoutfitted its delivery vans to run on electricity.","zh":"公司把送货车重新改装为电动。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle, less common) dressed again or provided with a new set of clothes.","zh":"（过去式/过去分词，较少见）重新穿戴；重新给（某人）置办衣物。"},"examples":[{"en":"The costumes were cleaned and reoutfitted for the next performance.","zh":"戏服清洗后又重新整理配备，用于下一场演出。"}]}],"synonyms":["reequipped","refitted","retrofitted","retooled","upgraded"],"phonetic":"/ˌriːˈaʊtˌfɪtɪd/","extraExplanation":["“reoutfitted”来自前缀 re-（再次、重新）+ outfit（为……配备/装备）。常见于新闻、商业、工程与户外语境，强调“升级、改装、重新配置”。","在美式英语里，outfit 作动词时很常见（outfit a team / outfit a room），加上 re- 就表示“再一次装备/配置”，语气偏正式。"]}
{"word":"reoutfitting","summary":{"en":"Reoutfitting means equipping something again or upgrading it with new items or parts.","zh":"Reoutfitting 指对某物重新装备或用新物品/部件进行升级改装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of equipping something again, or giving it new equipment, clothing, or parts (often to update, repair, or prepare for a new use)","zh":"重新配置/装备（某物）；重新换装、更新设备或部件（常为升级、修复或适应新用途）"},"examples":[{"en":"The navy is reoutfitting the ship with new radar and safety systems.","zh":"海军正在为这艘船重新配置新的雷达和安全系统。"},{"en":"Reoutfitting the office for hybrid work took several weeks.","zh":"为了适应混合办公，重新布置并更新办公室设备花了好几周。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of reoutfit) equipping something again or with new items","zh":"（reoutfit 的现在分词）正在重新装备/换装；用新物品再次配备"},"examples":[{"en":"They are reoutfitting the old bus to turn it into a mobile library.","zh":"他们正在把那辆旧巴士重新改装成一座移动图书馆。"},{"en":"She’s reoutfitting her hiking kit before the next trip.","zh":"她在下次旅行前正在把徒步装备重新补齐并更新。"}]}],"synonyms":["refitting","retrofitting","re-equipping","upgrading","overhauling"],"phonetic":"/ˌriːˈaʊtˌfɪtɪŋ/","extraExplanation":["“re-”表示“再次/重新”，outfit表示“装备、配备（衣物或器材）”。因此 reoutfit 常用于“船只/车辆/房屋/办公室/团队”等的升级改装或重新配备。","拼写上有时也可见作 re-outfitting（加连字符），尤其在标题或正式写作中。"]}
{"word":"reoutline","summary":{"en":"“Reoutline” means to outline something again, usually to reorganize its structure more clearly.","zh":"“reoutline”表示把内容重新拟大纲/重组结构，使其更清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make an outline again; to revise the structure/plan of a piece of writing, a presentation, or a project","zh":"重新拟大纲；重新梳理（文章、演讲或项目）的结构/计划"},"examples":[{"en":"After getting feedback, I reoutlined my essay to make the main argument clearer.","zh":"收到反馈后，我重新拟了文章大纲，让中心论点更清楚。"},{"en":"Let’s reoutline the presentation so the timeline comes before the results.","zh":"我们把演示重新梳理一下结构，让时间线放在结果之前。"}]}],"synonyms":["restructure","reorganize","revise the outline","replan","reframe"],"phonetic":"ˌriˈaʊtˌlaɪn","extraExplanation":["“re-”表示“再一次/重新”，outline 指“提纲、轮廓”。reoutline 常见于写作与项目管理语境，强调把结构重新安排，而不只是改几个句子。"]}
{"word":"reoutlined","summary":{"en":"“Reoutlined” means you made an outline again or reorganized the main points.","zh":"“reoutlined”表示你重新列了提纲，或把主要要点重新整理了一遍。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “reoutline”: to make a new outline of something, or to organize the main points again (often more clearly).","zh":"“reoutline”的过去式/过去分词：为某事重新列提纲；把主要要点重新整理（通常更清晰）。"},"examples":[{"en":"After the teacher’s feedback, I reoutlined my essay to improve the structure.","zh":"根据老师的反馈，我重新列了文章的提纲来改善结构。"},{"en":"We reoutlined the presentation so the key points came first.","zh":"我们重新整理了演示的提纲，让关键点放在最前面。"}]}],"synonyms":["reorganized","restructured","reframed","replanned","rearranged"],"phonetic":"/ˌriːˈaʊtlaɪnd/","extraExplanation":["“re-”表示“再次/重新”，outline 作动词时是“概述、列提纲”。所以 reoutline 常用于写作、报告、项目计划等场景，强调“重新组织要点”，不一定表示内容完全改变，而是结构与重点的调整。","在学术写作中，reoutline 往往发生在收到反馈（feedback）后：先抓论点与段落逻辑，再回头改句子细节。"]}
{"word":"reoutlining","summary":{"en":"Reoutlining means making an outline again to reorganize or clarify ideas.","zh":"reoutlining 指“重新列大纲”，用来重组结构或让思路更清晰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making an outline again, often to reorganize or clarify a plan, document, or piece of writing","zh":"重新列大纲（再次拟定提纲），通常为了重组结构或让计划、文件、文章更清晰"},"examples":[{"en":"After the teacher’s feedback, I spent an hour reoutlining my essay.","zh":"根据老师的反馈，我花了一个小时重新给文章列大纲。"},{"en":"Reoutlining the presentation helped us see the main message more clearly.","zh":"重新整理演示的大纲让我们更清楚地看到核心信息。"}]},{"partOfSpeech":"v.","definition":{"en":"revising the outline of something; outlining it again","zh":"再次为某事拟定提纲；重做结构框架"},"examples":[{"en":"She is reoutlining the report to match the new requirements.","zh":"她正在重新整理报告的大纲，以符合新要求。"},{"en":"We kept reoutlining until the chapters flowed naturally.","zh":"我们不断重列大纲，直到各章衔接自然。"}]}],"synonyms":["re-outline","reorganizing the outline","restructuring","replanning","reframing"],"phonetic":"/ˌriˈaʊtˌlaɪnɪŋ/","extraExplanation":["“reoutlining”常见于写作与项目管理语境：当主题、受众或要求变化时，先“reoutline（重列大纲）”能更快发现结构问题，比如重点不突出、顺序不合理或论据重复。也常与“reorganize / restructure / revise the outline”互换使用，但“reoutlining”更强调“回到大纲层面重新规划”。"]}
{"word":"reoutput","summary":{"en":"Tell me which word/phrase (or paste the previous content) you want re-output.","zh":"請告訴我你要重新輸出的單字／片語（或貼上先前內容）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"I need the word or phrase you want me to re-output (and if you want any changes, like simpler definitions or more examples).","zh":"我需要你想要我重新輸出的單字或片語（如果你也想調整內容，例如更簡單的解釋或更多例句，也請告訴我）。"},"examples":[{"en":"Please tell me the word you mean, e.g., “reoutput.”","zh":"請告訴我你指的是哪個詞，例如「reoutput」。"},{"en":"If you want me to re-output the last entry, paste it here.","zh":"如果你想我重新輸出上一個詞條，請把它貼在這裡。"}]}],"phonetic":"/ˌriːˈaʊtˌpʊt/"}
{"word":"reoutrage","summary":{"en":"“Reoutrage” is a rare way to say “outrage again,” meaning to cause renewed anger or shock.","zh":"“reoutrage”较少见，用来表示“再次激起愤怒/震惊”，即引发新一轮不满或公愤。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare, nonstandard) To outrage again; to make people angry or shocked again, especially by repeating an offensive act or reopening a painful issue.","zh":"（罕见/非标准用法）再次激起愤怒或震惊；尤指重复冒犯行为或重新揭开令人痛苦的事件，从而让公众“再度被激怒”。"},"examples":[{"en":"The new video could reoutrage viewers who were already upset last year.","zh":"这段新视频可能会让去年就已经很不满的观众再次被激怒。"},{"en":"Bringing up the scandal during the ceremony may reoutrage the victim’s family.","zh":"在仪式上提起那场丑闻，可能会再次激怒受害者家属。"}]}],"synonyms":["reignite outrage","spark outrage again","cause renewed outrage","inflame anger"],"phonetic":"/ˌriːˈaʊt.reɪdʒ/","extraExplanation":["“reoutrage”并不是常见的标准词汇，多数情况下更自然的表达是：reignite outrage（重新点燃愤怒）、spark outrage again（再次引发公愤）、cause renewed outrage（造成新一轮愤怒/公愤）。","构词上可以理解为 re-（再、重新）+ outrage（激怒/公愤）。在新闻或评论写作里，常用名词搭配：renewed outrage（新一轮公愤）、public outrage（公众愤怒）。"]}
{"word":"reovercharge","summary":{"en":"“Reovercharge” means to overcharge again—either charging someone too much again or overcharging a battery again.","zh":"“reovercharge”指“再次过度收费/再次多收费”，也可指“再次过度充电”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to charge (a customer) too much again; to overcharge again after already doing so","zh":"再次多收费用；在已收费过高的基础上又一次多收费"},"examples":[{"en":"The customer complained that the hotel reovercharged her for the minibar items.","zh":"那位顾客抱怨酒店在迷你吧物品上又一次多收了她的钱。"},{"en":"Please double-check the invoice so we don’t reovercharge anyone.","zh":"请再核对一下发票，避免我们再次多收任何人的费用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overcharge (a battery or device) again, usually by charging past safe limits a second time","zh":"再次过度充电（对电池或设备）；通常指第二次把电充过头、超过安全范围"},"examples":[{"en":"If you reovercharge a lithium battery, it can overheat and become dangerous.","zh":"如果你让锂电池再次过度充电，它可能会过热并变得危险。"},{"en":"The manual warns users not to reovercharge the device after a full charge.","zh":"说明书警告用户在充满电后不要再次过度充电。"}]}],"synonyms":["overcharge again","charge too much again","re-overcharge"],"phonetic":"/ˌriːˈoʊvɚˌtʃɑrdʒ/","extraExplanation":["“reovercharge”不是很常见的标准词，实际写作中更常见的是带连字符的“re-overcharge”，或改用更自然的表达，如“overcharge again / charge again at an inflated price”。","在电池语境里，人们更常说“overcharge (the battery) again”或直接用“overcharge”。若讨论安全与技术说明，建议用更清晰的说法（例如：avoid overcharging; do not charge beyond the rated limit）。"]}
{"word":"reoverflow","summary":{"en":"“reoverflow” is a rare/nonstandard word meaning “to overflow again” or “a second overflow.”","zh":"“reoverflow”较少见、偏非标准，表示“再次溢出”或“第二次溢出（事件）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare / nonstandard) to overflow again; to spill over a second time after being controlled or reduced.","zh":"（罕见/非标准用法）再次溢出；在已被控制或减少后又第二次外溢。"},"examples":[{"en":"After the storm, the river reoverflowed and flooded the fields again.","zh":"暴风雨过后，河水再次溢出，又淹没了田地。"},{"en":"If the tank is refilled too quickly, it may reoverflow.","zh":"如果水箱回填得太快，可能会再次溢出。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a second overflow event; another instance of spilling over.","zh":"（罕见）再次溢出（的事件）；第二次外溢的情况。"},"examples":[{"en":"Engineers redesigned the drain to prevent a reoverflow.","zh":"工程师重新设计了排水系统，以防再次溢流。"}]}],"synonyms":["overflow again","spill over again","a second overflow","another overflow"],"phonetic":"/ˌriːˈoʊvərfloʊ/","extraExplanation":["“reoverflow”不是常见英语词，更多时候人们会说“overflow again / overflowed again（再次溢出）”或“a second overflow（第二次溢出）”。","在计算机语境里，人们通常说“buffer overflow（缓冲区溢出）”“stack overflow（栈溢出）”。如果想表达“再次发生溢出”，更自然的说法是“overflow again”或“another overflow”。"]}
{"word":"reovertake","summary":{"en":"“Reovertake” means to pass someone again and regain the lead.","zh":"“Reovertake”指在被超过后再次反超，重新领先。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to overtake someone or something again after being passed or losing the lead","zh":"（在被超过或失去领先后）再次超过（某人/某物），重新夺回领先"},"examples":[{"en":"After the pit stop, she managed to reovertake her rival on the next lap.","zh":"进站之后，她在下一圈设法再次超过了对手。"},{"en":"The faster train slowed down at a station, but it later reovertook the local train.","zh":"那趟更快的列车在车站减速了，但后来又再次超过了慢车。"},{"en":"Our team fell behind early, then reovertook the lead in the final minutes.","zh":"我们队一开始落后，但在最后几分钟重新夺回了领先。"}]}],"synonyms":["overtake again","retake the lead","regain the lead","pass again"],"phonetic":"/ˌriːˌoʊvərˈteɪk/","extraExplanation":["“reovertake”由前缀 re-（再次）+ overtake（超过）组成，常见于赛车、骑行、跑步等“你追我赶”的语境。","在正式写作中，有时也会用更自然的表达替代，如 “overtake again / regain the lead / retake the lead”。"]}
{"word":"reoverwork","summary":{"en":"“Reoverwork” means to overwork again—making someone (or yourself) work too much after a break or recovery.","zh":"“Reoverwork”表示“再次过度工作/再次让……过劳”，常指休息或恢复后又把工作量推得过大。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone work too much again; to overwork again after a rest or recovery","zh":"（再次）让……过度工作；让……在休息或恢复后又过劳"},"examples":[{"en":"After a short break, the manager reoverworked the team to meet the deadline.","zh":"短暂休息后，经理又让团队过度加班来赶截止日期。"},{"en":"Be careful not to reoverwork your shoulder after the injury.","zh":"受伤后要小心，别让肩膀再次过度劳累。"}]},{"partOfSpeech":"vi.","definition":{"en":"to work too much again (often used when talking about your own workload)","zh":"（再次）过度工作；又把自己累过头（常用于谈自己的工作量）"},"examples":[{"en":"I promised myself I wouldn’t reoverwork, but I took on three new projects.","zh":"我答应自己不再过度工作，但还是接了三个新项目。"}]}],"synonyms":["overwork again","work too hard again","re-exhaust (rare)"],"phonetic":"/ˌriˌoʊvərˈwɝk/","extraExplanation":["“reoverwork”不是很常见，更常见的表达是“overwork again”或“work myself too hard again”。写作时也常写成“re-overwork”（加连字符）来让结构更清晰。"]}
{"word":"reovirus","summary":{"en":"A reovirus is a double-stranded RNA virus that commonly infects humans and animals, often with mild or no symptoms.","zh":"reovirus（呼肠孤病毒）是一类双链RNA病毒，可感染人类与动物，常见为轻微或无症状感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a virus with a double-stranded RNA genome that commonly infects humans and many animals, usually causing mild or no illness; the name comes from “respiratory enteric orphan” because early strains were found in the airways and intestines and were not clearly linked to disease","zh":"呼肠孤病毒；一种双链RNA病毒，可感染人类及多种动物，通常导致轻微或无症状感染；名称源自“respiratory enteric orphan（呼吸道-肠道-孤儿）”，指早期发现于呼吸道和肠道，但当时未明确与疾病相关"},"examples":[{"en":"Reoviruses are often found in the respiratory tract or intestines and may not cause serious symptoms.","zh":"呼肠孤病毒常见于呼吸道或肠道，可能不会引起严重症状。"},{"en":"Some researchers study reovirus because it can be used in experiments to understand how viruses enter cells.","zh":"一些研究者研究呼肠孤病毒，因为它可用于实验，帮助理解病毒如何进入细胞。"},{"en":"In rare cases, certain reoviruses can be linked to disease in animals.","zh":"在少数情况下，某些呼肠孤病毒可能与动物疾病有关。"}]}],"synonyms":["respiratory enteric orphan virus"],"phonetic":"/ˈriː.oʊˌvaɪ.rəs/","extraExplanation":["“reovirus”一词源自缩写：REO = respiratory（呼吸道） + enteric（肠道） + orphan（“孤儿”，指当时未能与特定疾病对应）。后来发现它们确实能引起感染，但在人类中多较轻或不典型。","读音中常见的分段是“REE-oh-VY-rus”。在科普或医学语境里，reovirus既可泛指“呼肠孤病毒”这类病毒，也常特指其代表种（如 mammalian orthoreovirus）。"]}
{"word":"reoviruses","summary":{"en":"Reoviruses are a group of double‑stranded RNA viruses; some infect humans and animals and may cause mild respiratory or intestinal illness.","zh":"呼肠孤病毒是一类含双链RNA的病毒；可感染人和动物，可能引起轻微的呼吸道或肠道症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of viruses (family Reoviridae) that contain double‑stranded RNA; some infect humans and animals and can cause mild respiratory or intestinal illness, though many infections cause few or no symptoms","zh":"呼肠孤病毒（呼肠孤病毒科）的一类病毒，含双链RNA；可感染人和动物，有时引起轻微的呼吸道或肠道症状，但很多感染可能无明显症状"},"examples":[{"en":"Reoviruses can spread through the fecal–oral route, especially in settings with poor hygiene.","zh":"呼肠孤病毒可能通过粪—口途径传播，尤其在卫生条件较差的环境中。"},{"en":"In the lab, scientists study reoviruses to understand how double‑stranded RNA viruses replicate.","zh":"在实验室里，科学家研究呼肠孤病毒，以了解双链RNA病毒如何复制。"},{"en":"Some reoviruses infect animals and may cause diarrhea in young livestock.","zh":"一些呼肠孤病毒会感染动物，可能导致幼龄家畜腹泻。"}]}],"synonyms":["Reoviridae (virus family)","dsRNA viruses"],"phonetic":"ˈriːoʊˌvaɪrəsɪz","extraExplanation":["“reovirus”一词来自缩写：respiratory + enteric + orphan（最初在呼吸道和肠道中发现、但一度未与明确疾病对应的“孤儿”病毒）。","在医学与科研语境中也常见到“Reoviridae（呼肠孤病毒科）”“reovirus infection（呼肠孤病毒感染）”等搭配；有些成员（如轮状病毒 rotavirus）与腹泻相关，但“reovirus”本身常指另一支系的呼肠孤病毒。"]}
{"word":"reown","summary":{"en":"Reown means to own something again or to accept something as yours again.","zh":"reown 指“重新拥有（财物）”或“重新承认/承担（责任、身份等）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to own something again, especially after losing it or giving it up; to regain ownership of","zh":"重新拥有；（尤指失去或放弃后）再度取得……的所有权"},"examples":[{"en":"After paying off the loan, she could reown the car in her own name.","zh":"还清贷款后，她就能以自己的名义重新拥有那辆车。"},{"en":"The museum hopes to reown the artifact that was stolen decades ago.","zh":"博物馆希望重新取得那件几十年前被盗文物的所有权。"}]},{"partOfSpeech":"vt.","definition":{"en":"to publicly accept something as one’s own again (such as a responsibility, decision, or identity)","zh":"重新认同并承担（责任/决定/身份等）；再次“把……当作自己的”"},"examples":[{"en":"He apologized and reowned his earlier mistake.","zh":"他道歉并重新承认自己先前的错误。"},{"en":"She decided to reown her background and speak proudly about it.","zh":"她决定重新拥抱自己的出身，并自豪地谈起它。"}]}],"synonyms":["reacquire","regain","recover","take back","reposses"],"phonetic":"/ˌriˈoʊn/","extraExplanation":["“reown”在日常英语里相对少见，更常见的表达是“own again / regain ownership of / take back ownership of”。写作中也常见带连字符的形式“re-own”，更清楚地表示“再次拥有”。","在法律或财产语境（房产、车辆、文物归还）里，“reown”容易让人联想到“恢复所有权”的概念；如果需要更正式，可以用“reacquire”或“recover (legal) ownership”。"]}
{"word":"reoxidation","summary":{"en":"Reoxidation means being oxidized again, especially in chemical, battery, or corrosion processes.","zh":"reoxidation 指“再氧化”，常用于化学反应、电池过程或腐蚀等语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which something is oxidized again (for example, after it has been reduced), often involving loss of electrons or gain of oxygen","zh":"再氧化；重新被氧化的过程（例如在被还原之后再次发生氧化），通常涉及失去电子或与氧结合"},"examples":[{"en":"During cycling in the battery, reoxidation of the electrode material can reduce performance over time.","zh":"在电池的充放电循环中，电极材料的再氧化可能会随着时间推移降低性能。"},{"en":"The catalyst is regenerated by reoxidation in the presence of oxygen.","zh":"该催化剂在氧气存在下通过再氧化得以再生。"},{"en":"To prevent reoxidation of the metal surface, the parts were stored in a dry, inert environment.","zh":"为防止金属表面再氧化，这些零件被存放在干燥的惰性环境中。"}]}],"synonyms":["re-oxidation","reoxidizing","oxidation again"],"phonetic":"/ˌriˌɑksəˈdeɪʃən/","extraExplanation":["“re-”表示“再次”，因此 reoxidation 字面意思就是“再一次氧化”。它常见于电化学（电池与电极反应）、催化反应循环、金属腐蚀与表面处理等语境中。","在氧化还原反应里，reoxidation 常与 “reduction（还原）”成对出现：某物先被还原，之后在氧气或其他氧化剂作用下再次被氧化。"]}
{"word":"reoxidise","summary":{"en":"Reoxidise means to oxidize again—often returning something to an oxidized state after it was reduced.","zh":"Reoxidise 指“再氧化”，常用于指物质在被还原后再次回到氧化态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to oxidize again; to cause something to regain oxygen or lose electrons again (often after it was reduced).","zh":"再氧化；使（物质）再次发生氧化反应（常指被还原后再次失去电子或重新与氧结合）。"},"examples":[{"en":"After the metal was cleaned, it began to reoxidise in the air.","zh":"金属清洁后，在空气中又开始再氧化。"},{"en":"The catalyst helps the compound reoxidise during the reaction cycle.","zh":"催化剂帮助该化合物在反应循环中再氧化。"}]},{"partOfSpeech":"v.","definition":{"en":"(in industry/biology) to restore an oxidized state again so a substance can be reused or continue working.","zh":"（工业/生物语境）使恢复到氧化态，以便物质可再利用或继续发挥作用。"},"examples":[{"en":"Engineers reoxidise the material to regenerate the filter.","zh":"工程师通过再氧化该材料来再生过滤器。"},{"en":"Cells reoxidise NADH to NAD+ to keep metabolism running.","zh":"细胞把 NADH 再氧化成 NAD+，以维持代谢进行。"}]}],"synonyms":["reoxidize","oxidize again","re-oxidize"],"phonetic":"/ˌriˈɑk.səˌdaɪz/","extraExplanation":["“reoxidise”是英式拼写；美式拼写更常见的是“reoxidize”。两者意思完全相同，只是 -ise / -ize 的地区差异。","在化学里，“氧化”不一定意味着“加氧”，更常指“失去电子/氧化态升高”；因此“reoxidise”常见于氧化还原循环（如催化、代谢）中。"]}
{"word":"reoxidised","summary":{"en":"Reoxidised means “oxidized again,” and is also the past form of reoxidise.","zh":"reoxidised 意为“再次被氧化的”，也可作 reoxidise 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"oxidized again (after being reduced or after a first oxidation), often forming oxides once more","zh":"再次被氧化的（在被还原或首次氧化之后又重新发生氧化），常指再次形成氧化物"},"examples":[{"en":"After heating in air, the metal surface became reoxidised.","zh":"在空气中加热后，金属表面再次被氧化了。"},{"en":"The pigment was reduced during processing and later reoxidised, changing its color.","zh":"该颜料在加工过程中被还原，之后又重新氧化，颜色随之改变。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “reoxidise”: to oxidize something again","zh":"“reoxidise”的过去式/过去分词：使（某物）再次氧化"},"examples":[{"en":"They reoxidised the catalyst to restore its activity.","zh":"他们让催化剂重新氧化，以恢复其活性。"},{"en":"The material was reoxidised under controlled conditions.","zh":"该材料在受控条件下被重新氧化。"}]}],"synonyms":["reoxidized","oxidized again","re-oxidized"],"phonetic":"/ˌriːˈɑːk.səˌdaɪzd/","extraExplanation":["“reoxidised”是英式拼写；美式常写作“reoxidized”。两者意思相同，多见于化学、材料科学与电化学语境（如金属表面、催化剂、染料/颜料、氧化还原循环）。","词形拆解：re-（再次）+ oxidise/oxidize（氧化）+ -ed（过去分词/形容词用法）。在论文里常用作被动语态或形容词：was reoxidised / reoxidised surface。"]}
{"word":"reoxidising","summary":{"en":"“Reoxidising” means oxidizing again or becoming oxidized again, especially in scientific contexts.","zh":"“reoxidising”表示再次氧化或重新被氧化，尤其常用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"oxidizing again; undergoing oxidation a second time (often in chemistry or metallurgy).","zh":"再次氧化的；重新发生氧化反应的（常见于化学或冶金语境）。"},"examples":[{"en":"The copper surface is reoxidising after we cleaned it.","zh":"我们清洁过后，铜表面又在重新氧化。"},{"en":"Reoxidising can reduce the quality of the finished metal.","zh":"重新氧化可能会降低成品金属的质量。"}]},{"partOfSpeech":"v.","definition":{"en":"the process of oxidizing something again; the present participle of “reoxidise/reoxidize.”","zh":"再次使……氧化；“reoxidise/reoxidize”的现在分词形式，也可指重新氧化这一过程。"},"examples":[{"en":"Heating the sample in air is reoxidising the compounds.","zh":"在空气中加热样品会让这些化合物再次氧化。"},{"en":"They avoided reoxidising the material by storing it under nitrogen.","zh":"他们把材料放在氮气环境中保存，以避免再次氧化。"}]}],"synonyms":["reoxidizing","oxidizing again","re-oxidizing"],"phonetic":"/ˌriˈɑk.səˌdaɪ.zɪŋ/","extraExplanation":["“reoxidising”是英式拼写；美式更常写作“reoxidizing”。意思相同。","在氧化还原（redox）语境里，reoxidise通常指某物先被还原（gain electrons，失去氧），之后又被氧化（lose electrons，得到氧/失去电子）。在材料、催化、电化学等领域很常见。"]}
{"word":"reoxidize","summary":{"en":"Reoxidize means to oxidize again, especially after a substance has been reduced.","zh":"reoxidize 指“再次氧化”，尤其是指物质在被还原之后又重新氧化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to oxidize again; to restore oxygen to a substance after it has been reduced (lost oxygen or gained electrons)","zh":"再氧化；使（已被还原的物质）再次氧化，重新与氧结合（或失去电子）"},"examples":[{"en":"After the metal surface was reduced in the furnace, it began to reoxidize when exposed to air.","zh":"金属表面在炉内被还原后，一接触空气就开始再氧化。"},{"en":"Chemists try to prevent the catalyst from reoxidizing during storage.","zh":"化学家会尽量防止催化剂在储存过程中再氧化。"}]}],"synonyms":["oxidize again","re-oxidize"],"phonetic":"/ˌriˈɑk.səˌdaɪz/","extraExplanation":["在化学与材料科学中，“reoxidize”常用于描述：还原环境（如氢气、真空、高温）处理后的金属或氧化物，一旦回到含氧环境（空气、氧气、水蒸气）就“回氧化”。","相关概念：oxidize（氧化）、reduce（还原）、reduction/oxidation（氧化还原反应）。有时也会写作 re-oxidize。"]}
{"word":"reoxidized","summary":{"en":"Reoxidized means “oxidized again,” often after being reduced, or it can describe something that has been oxidized again.","zh":"reoxidized 表示“再次被氧化”，常指在被还原之后又重新氧化；也可作形容词表示“再次氧化过的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of reoxidize) to oxidize again, usually after something was previously reduced (gained electrons) or had its oxidation reversed.","zh":"（reoxidize 的过去式/过去分词）再次氧化；通常指某物先被还原（得到电子）或氧化状态被逆转后，又重新发生氧化。"},"examples":[{"en":"After the solution was exposed to air, the reduced metal ions reoxidized quickly.","zh":"溶液暴露在空气中后，被还原的金属离子很快又被重新氧化。"},{"en":"The catalyst was reduced during the reaction and then reoxidized in the next step.","zh":"催化剂在反应中被还原，然后在下一步又被重新氧化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a substance/material that has been oxidized again.","zh":"（作形容词）指某种物质/材料已再次被氧化的。"},"examples":[{"en":"The reoxidized surface showed a darker color.","zh":"再次氧化后的表面颜色更深。"},{"en":"They compared the reoxidized sample with the freshly prepared one.","zh":"他们把再次氧化的样品与新制备的样品进行了对比。"}]}],"synonyms":["oxidized again","re-oxidized","reoxidation (noun form)"],"phonetic":"/ˌriˈɑːksəˌdaɪzd/","extraExplanation":["“reoxidize / reoxidized”常见于化学、电化学与材料科学语境，尤其在“氧化-还原循环（redox cycle）”里：物质在不同步骤中反复被还原与再氧化。","前缀 re- 表示“再次”。如果你在论文里写作，常与“reduced（被还原的）/ oxidized（被氧化的）/ reoxidation（再氧化）/ oxidation state（氧化态）”等搭配出现。"]}
{"word":"reoxidizing","summary":{"en":"Reoxidizing means oxidizing again or becoming oxidized again.","zh":"reoxidizing 指“再次氧化”或“重新被氧化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to oxidize again; to make something undergo oxidation again after it was reduced or previously oxidized","zh":"再次氧化；使（物质）在还原或先前氧化之后重新发生氧化反应"},"examples":[{"en":"After the catalyst was reduced, the technician reoxidized it to restore its activity.","zh":"催化剂被还原后，技术员将其再氧化，以恢复活性。"},{"en":"Be careful: heating the metal in air can reoxidize the surface.","zh":"小心：在空气中加热金属会使表面再次氧化。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a substance) undergoing oxidation again","zh":"（物质）再次被氧化；重新发生氧化过程"},"examples":[{"en":"The sample was reoxidizing during storage because oxygen leaked into the container.","zh":"由于氧气渗入容器，样品在储存期间正在再氧化。"}]}],"synonyms":["oxidizing again","re-oxidizing","re-oxidation (related noun)"],"phonetic":"/ˌriˈɑk.səˌdaɪ.zɪŋ/","extraExplanation":["“re-”表示“再次/重新”，因此 reoxidize = oxidize again。常见于化学、材料科学与电化学语境：例如金属表面形成氧化层、催化剂在“还原—再氧化”循环中调节活性。","在实验记录里，reoxidizing 常作为现在分词使用：描述正在发生的过程（The material is reoxidizing）或作定语（a reoxidizing surface）。"]}
{"word":"reoxygenate","summary":{"en":"Reoxygenate means to add oxygen again or restore oxygen levels (in water, blood, or tissues).","zh":"reoxygenate 指再次补充氧气或恢复氧含量（常用于水体、血液或组织）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add oxygen to something again; to restore oxygen levels","zh":"（再）给……补充氧气；使……重新含氧/恢复氧含量"},"examples":[{"en":"The lake was reoxygenated to help fish survive the summer heat.","zh":"为了帮助鱼类熬过夏季高温，湖水被重新补充了氧气。"},{"en":"In the hospital, the team worked to reoxygenate the patient’s blood.","zh":"在医院里，医疗团队努力让病人的血液重新获得足够的氧气。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become oxygenated again; to regain oxygen","zh":"重新含氧；恢复氧气含量"},"examples":[{"en":"After the storm, the surface water began to reoxygenate.","zh":"暴风雨过后，表层水开始重新含氧。"},{"en":"Once the blockage was removed, the tissue slowly reoxygenated.","zh":"一旦阻塞被清除，组织就会慢慢重新获得氧气。"}]}],"synonyms":["re-aerate","oxygenate","reaerate","restore oxygen levels"],"phonetic":"/ˌriˈɑk.sə.dʒə.neɪt/","extraExplanation":["常见于环境科学与医学语境：如“水体复氧”（改善缺氧水域）、“组织/血液再氧合”（缺氧后恢复供氧）。","构词上是 re-（再次）+ oxygenate（使含氧、供氧），因此含义直观，多用于技术或正式表达。"]}
{"word":"reoxygenize","summary":{"en":"Reoxygenize means to add oxygen again or restore oxygen levels.","zh":"Reoxygenize 指“重新供氧/恢复含氧量”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add oxygen again; to restore oxygen to something (especially water, blood, or a closed space).","zh":"再次供氧；重新为某物补充氧气（尤指水体、血液或密闭空间）。"},"examples":[{"en":"Engineers reoxygenized the lake to help fish survive after the algae bloom.","zh":"工程师给湖水重新供氧，帮助鱼类在藻华之后存活。"},{"en":"After the shutdown, the system was cleaned and reoxygenized before restarting.","zh":"停机后，系统在重启前被清洁并重新供氧。"}]}],"synonyms":["re-aerate","oxygenate","add oxygen back","restore oxygen levels"],"phonetic":"/ˌriˈɑksɪdʒəˌnaɪz/","extraExplanation":["“re-”表示“再次/重新”，“oxygen”是“氧气”，“-ize”表示“使……化/使成为……”。因此 reoxygenize 直译就是“使重新含氧”。","这个词多见于环境科学/水产养殖/工程语境（如给水体增氧、恢复处理系统的含氧量），日常口语里更常说 “add oxygen back” 或 “re-aerate”。"]}
