{"word":"req","summary":{"en":"“Req” is an abbreviation meaning either “request” or “requirement,” depending on context.","zh":"“req”是缩写，常指“request（请求）”或“requirement（需求/要求）”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short form of “request” (often used in emails, notes, or lists to mean something asked for or required)","zh":"“request（请求/要求）”的缩写（常见于邮件、便签或清单中，表示被请求的事项或要求）"},"examples":[{"en":"Your req has been approved; we’ll process it today.","zh":"你的请求已获批准；我们今天会处理。"},{"en":"Please submit the req by Friday.","zh":"请在周五前提交该请求/申请。"}]},{"partOfSpeech":"n.","definition":{"en":"a short form of “requirement” (common in technical or project documents to mean a needed condition or spec)","zh":"“requirement（需求/要求/规范）”的缩写（常见于技术或项目文档中，表示必须满足的条件或规格）"},"examples":[{"en":"This feature doesn’t meet the security req.","zh":"这个功能不符合安全要求。"},{"en":"List all system reqs before development starts.","zh":"在开发开始前列出所有系统需求。"}]}],"synonyms":["request","requirement","spec","ask"],"phonetic":"/rɛk/","extraExplanation":["“req”多见于非正式或半正式书写：邮件标题、聊天、工单系统、项目文档等。在正式写作或对外文件里，通常写全称“request/requirement”，避免读者误解。","也会出现复数“reqs”，表示多个请求或需求。不同团队的习惯可能不同：有的把“req”默认当“request”，技术团队更常当“requirement”。"]}
{"word":"reqd","summary":{"en":"“reqd” is a written abbreviation of “required,” meaning something is necessary or mandatory.","zh":"“reqd”是“required”的书面缩写，表示某项是必需的/必须的。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) short for “required”; needed or necessary, especially in forms, instructions, or technical writing.","zh":"（缩写）“required”的简写；表示“必需的/必须的”，常见于表格、说明书或技术文件中。"},"examples":[{"en":"Please fill in all reqd fields before submitting the form.","zh":"提交表格前请填写所有必填（reqd）字段。"},{"en":"A photo ID is reqd for entry.","zh":"入场需要（reqd）带照片的身份证件。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) used to mark something as demanded by a rule, standard, or assignment.","zh":"（缩写）用于标注某项内容是按规则、标准或作业要求“必须提供/必须完成”的。"},"examples":[{"en":"Safety training: reqd annually.","zh":"安全培训：每年必做（reqd）。"},{"en":"Reading reqd: Chapters 1–3.","zh":"必读（reqd）：第1—3章。"}]}],"synonyms":["required","necessary","mandatory","needed"],"phonetic":"/rɪˈkwaɪərd/","extraExplanation":["“reqd”多见于书面场景（如表格、清单、工程/医疗/法律记录、作业要求），口语里一般直接说 required。","正式写作或对外沟通中通常建议写全 required，避免读者不熟悉缩写。","常见变体：req’d（带撇号）也表示 required。"]}
{"word":"requaerere","summary":{"en":"requaerere is a Latin verb meaning “to seek again; to inquire/search carefully,” and it is related by origin to English words like require and query.","zh":"requaerere 是拉丁语动词，意思是“再次寻找；仔细探究／询问”，在词源上与英语 require、query 等词相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to seek again; to ask or inquire carefully; to look for information or a person.","zh":"（拉丁语）再次寻找；仔细询问／探究；查找信息或某人。"},"examples":[{"en":"In the old text, requaerere means “to search again,” not simply “to find.”","zh":"在古文中，requaerere 的意思是“再次寻找”，而不只是“找到”。"},{"en":"The scholar used requaerere to describe re-checking evidence in the archives.","zh":"那位学者用 requaerere 来形容在档案中重新核查证据。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common; Latin legal/administrative sense) to demand or request back; to call for something that is owed.","zh":"（较少见；拉丁语法律／行政语境）索回；要求归还或要求应得之物。"},"examples":[{"en":"Some legal Latin uses requaerere for demanding what is due.","zh":"在一些法律拉丁语用法中，requaerere 可指要求应得之物。"}]}],"synonyms":["(Latin) quaerere","seek","inquire","search","ask"],"phonetic":"/ˌrɛkwəˈrɛreɪ/","extraExplanation":["这是拉丁语动词不定式（infinitive）。更常见的拼写是 **requirere**（“寻求、要求”），它后来进入法语并影响英语 **require**（需要／要求）。你给的 **requaerere** 也可被理解为由 **re-**（再次）+ **quaerere**（寻找、询问；英语 *query* 的同源词）构成。","在英语学习中，你通常不会在日常写作里用 requaerere；它更可能出现在古典学、历史、法学或语源学讨论中，用来解释英语词汇（如 *require, inquire, query*）的来源与意义变化。"]}
{"word":"requalification","summary":{"en":"Requalification means the process of becoming qualified again, especially by meeting requirements anew.","zh":"Requalification 指重新取得资格或再次符合要求/标准的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of becoming qualified again, or meeting a required standard again (often after a change in rules, time, or performance).","zh":"重新取得资格；再度符合要求或标准的过程（常因规则变化、时间或表现而需要再次达标）。"},"examples":[{"en":"After the certification rules changed, employees had to complete requalification training.","zh":"认证规则改变后，员工必须完成重新资格认证培训。"},{"en":"The athlete’s injury delayed his requalification for the national team.","zh":"伤病使他重新取得国家队资格的进程被推迟了。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports or competitions: the process of qualifying again for a later stage or event.","zh":"（体育/竞赛）再次获得晋级或参赛资格的过程。"},"examples":[{"en":"The team secured requalification by winning the final match.","zh":"球队通过赢下最后一场比赛确保了再次晋级资格。"}]}],"synonyms":["recertification","renewal","relicensing","reaccreditation"],"phonetic":"/ˌriːˌkwɑːləfəˈkeɪʃən/","extraExplanation":["词形结构：re-（再次）+ qualification（资格、资质）。在正式语境中很常见，尤其是培训、证照、合规（compliance）和体育赛事报道里。","近义表达常用 re-certification（重新认证）、renewal（续期/更新）、re-licensing（重新发照/复照）。区别在于：renewal 更强调“续期”，requalification 更强调“再次达到资格标准”。"]}
{"word":"requalified","summary":{"en":"Requalified means “qualified again,” often after renewal, review, or regaining eligibility.","zh":"requalified 指“重新取得资格/再次符合资格”，常用于续期、复审或恢复资格的情境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"qualified again after meeting the requirements a second time (often after losing eligibility or needing to renew).","zh":"再次符合资格的；重新取得资格的（常指曾失去资格或需要复审/续期后又达标）。"},"examples":[{"en":"After completing the training, she was requalified to work as a lifeguard.","zh":"完成培训后，她重新取得了救生员的工作资格。"},{"en":"The athlete was requalified to compete after the test results were reviewed.","zh":"复核检测结果后，这名运动员被恢复参赛资格。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of requalify: to make someone qualify again, or to qualify again yourself.","zh":"requalify 的过去式/过去分词：使（某人）重新具备资格；（自己）再次符合资格。"},"examples":[{"en":"He requalified for the loan after paying down his debt.","zh":"他还清一部分债务后，重新符合贷款资格。"},{"en":"The team requalified for the tournament the following year.","zh":"这支队伍在第二年重新获得了该赛事的参赛资格。"}]}],"synonyms":["qualified again","regained eligibility","recertified","re-certified","reaccredited"],"phonetic":"/ˌriˈkwɑləˌfaɪd/","extraExplanation":["“requalified”常见于体育比赛（恢复参赛资格/重新获得晋级资格）、职业证照（重新认证/复证）、以及金融（重新符合贷款资格）等语境。","拼写上既可写作 requalified（更常见），也可写作 re-qualified（强调“再次取得资格”的过程，尤其在正式写作中偶见）。"]}
{"word":"requalify","summary":{"en":"Requalify means to qualify again or to require someone to qualify again, usually by meeting updated rules, training, or tests.","zh":"requalify 指“重新取得资格”或“要求某人重新取得资格”，多与规则更新、培训或考试有关。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to qualify again; to meet the required conditions again (often after a break, change, or failure to qualify).","zh":"重新取得资格；再次符合要求（常指中断、变化或未达标后再次达标）。"},"examples":[{"en":"After taking a year off, she had to requalify for the team.","zh":"休学一年后，她必须重新取得进入队伍的资格。"},{"en":"Pilots must requalify every year through training and tests.","zh":"飞行员必须每年通过训练和测试来重新取得资格。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone qualify again by requiring them to pass a test, training, or evaluation.","zh":"（通过要求考试、培训或评估）使某人重新获得资格。"},"examples":[{"en":"The company requalified all technicians after the new safety rules were introduced.","zh":"新安全规定出台后，公司要求所有技术员重新取得资格。"}]}],"synonyms":["recertify","qualify again","re-certify","relicense","reaccredit"],"phonetic":"/ˌriːˈkwɑːləˌfaɪ/","extraExplanation":["“re-”是常见前缀，表示“再次、重新”。因此 requalify 通常用于需要定期复证或因规则变化而重新审核资格的场景（如职业证照、运动参赛资格、飞行/医疗等）。","在英式英语里，qualify 还常指“获得某个职业资格（如教师资格）”。requalify 也可表示“转行或进修后重新拿到资格/改拿新资格”。"]}
{"word":"requalifying","summary":{"en":"“Requalifying” means qualifying again or meeting requirements again; it can also describe a test or process used to regain eligibility.","zh":"“requalifying”指“重新取得资格/再次达标”，也可形容“用于重新获得资格的”考试或流程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of requalify) to qualify again; to meet the required conditions again after losing eligibility or after a time period.","zh":"（requalify 的现在分词）重新取得资格；在失去资格或过期后再次满足要求。"},"examples":[{"en":"She is requalifying for the scholarship after improving her grades.","zh":"她在成绩提高后，正在重新取得奖学金资格。"},{"en":"The team is requalifying for the playoffs by winning key games.","zh":"球队通过赢下关键比赛，正在重新获得季后赛资格。"},{"en":"Drivers may be requalifying for a license after renewing their medical exam.","zh":"一些司机在更新体检后，可能正在重新取得驾照资格。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something done to regain eligibility (for example, a test, process, or course).","zh":"（作形容词用）用于重新获得资格的；与“重新认证/重新达标”有关的（如考试、流程或课程）。"},"examples":[{"en":"He failed the first test but passed the requalifying exam.","zh":"他第一次考试没通过，但通过了补考（重新取得资格的考试）。"},{"en":"The company introduced a requalifying process for returning employees.","zh":"公司为返岗员工推出了重新资质审核流程。"}]}],"synonyms":["qualifying again","regaining eligibility","re-certifying","reapplying","renewing qualification"],"phonetic":"/ˌriːˈkwɑːləˌfaɪɪŋ/","extraExplanation":["“requalify / requalifying”常见于有“资格会失效或需要周期性审核”的场景，比如：体育比赛的晋级资格（qualify for the finals）、证照/资质复审（license/certification requalification）、工作或福利资格重新审核（requalify for benefits）。","拼写提示：requalify = re-（再次）+ qualify（取得资格）。英式与美式发音略有差异；这里给出的是美式常见读法。"]}
{"word":"requarantine","summary":{"en":"Requarantine means to quarantine again, usually because of new risk or updated rules.","zh":"Requarantine 指“再次隔离”，通常因为出现新的风险或规定更新。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a person, animal, or group into quarantine again (often after new exposure, new symptoms, or a rule change)","zh":"（因再次接触、出现新症状或规定变化等）让人/动物/群体再次隔离"},"examples":[{"en":"After a new close contact was confirmed, the school had to requarantine several students.","zh":"在确认出现新的密切接触者后，学校不得不让几名学生再次隔离。"},{"en":"If you test positive again, the clinic may requarantine you for a short period.","zh":"如果你再次检测呈阳性，诊所可能会让你短期再次隔离。"}]}],"synonyms":["quarantine again","re-isolate","isolate again"],"phonetic":"/ˌriˈkwɔrənˌtin/","extraExplanation":["“re-”是英语常见前缀，表示“再次/重新”。因此 requarantine = re-（再次）+ quarantine（隔离）。这个词在公共卫生语境（例如疫情防控、传染病暴露追踪）中更常见，属于较新的、以需要为导向的用法。","在写作中也常见更自然的表达：“quarantine again / go back into quarantine / be placed back in quarantine”。正式文件或新闻标题里更可能看到单词形式 requarantine。"]}
{"word":"requeen","summary":{"en":"“Requeen” most commonly means to replace a queen bee in a hive; more rarely, it can mean to crown someone queen again.","zh":"“requeen”最常指在蜂群中更换蜂王；较少见时也可指让某人再次成为女王/再次加冕。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to replace a queen (especially a queen bee) with a new one","zh":"（尤指养蜂）更换蜂王；重新立蜂王"},"examples":[{"en":"The beekeeper decided to requeen the hive after the colony became aggressive.","zh":"蜂农决定给蜂群重新立蜂王，因为蜂群变得很有攻击性。"},{"en":"It’s often best to requeen in late spring when the colony is growing.","zh":"通常在晚春蜂群增长时更适合更换蜂王。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone a queen again; to crown again (rare)","zh":"让某人成为女王（再次）；再次加冕（较少见）"},"examples":[{"en":"In the play’s ending, the heroine is requeened after returning from exile.","zh":"在戏剧结尾，女主角流亡归来后再次加冕为王后。"},{"en":"Legends sometimes requeen a fallen ruler to restore order.","zh":"传说有时会让失势的统治者“再度登基”以恢复秩序。"}]}],"synonyms":["replace the queen","introduce a new queen","re-crown (rare)"],"phonetic":"/riːˈkwiːn/","extraExplanation":["“requeen”最常见于养蜂语境：re- 表示“再次/重新”，queen 指“蜂王”。更换蜂王通常是为了改善蜂群性格、提升产卵能力或降低分蜂风险。","在一般英语里表示“再次加冕/再次成为女王”的用法非常少见，更多是文学、戏剧或游戏设定中的写法。"]}
{"word":"requench","summary":{"en":"Requench is a literary word meaning “to quench again,” especially to satisfy thirst or refresh/cool something again.","zh":"Requench 是较文学化的词，意思是“再次止渴/再度满足”，也可指“再次冷却或使重新清凉”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) to satisfy or quench again; to drink or take in something so that thirst (or desire) is stopped again.","zh":"（文学/较少用）再次解渴；再度满足（口渴或强烈欲望）。"},"examples":[{"en":"After the long hike, they stopped at a spring to requench their thirst.","zh":"长途徒步后，他们在泉边停下来，再次解渴。"},{"en":"He returned to the old songs to requench his need for comfort.","zh":"他回到那些老歌里，重新满足自己对安慰的渴望。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary) to cool or refresh again, especially by dipping into liquid (e.g., metal being cooled in water).","zh":"（文学/较少用）再次冷却、使重新清凉；尤指再次浸入液体中冷却（如金属淬火）。"},"examples":[{"en":"The smith lifted the blade and then lowered it again to requench it in water.","zh":"铁匠举起刀刃，又把它放入水中再次冷却。"}]}],"synonyms":["quench again","sate again","slake again","refresh again","cool again"],"phonetic":"/ˌriːˈkwɛntʃ/","extraExplanation":["“Re-”表示“再次”，加在“quench（止渴/熄灭/抑制）”前形成“requench”。这个词在现代日常英语中很少见，更常见的是用“quench again”或直接用“quench”。","在文学语境里，“quench/reqench”不仅可指“口渴”，也常比喻“欲望、痛苦、好奇心”等强烈感受的暂时平息。"]}
{"word":"request","summary":{"en":"Tell me the word or phrase you want to look up, and I’ll provide a clear bilingual entry with examples.","zh":"请告诉我你要查询的单词或短语，我会给出清晰的中英释义与例句。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"I’m not sure what you want to look up. Please tell me the English word/phrase (or upload a sentence) you want explained.","zh":"我不确定你想查询什么。请告诉我你要解释的英文单词/短语（或上传一个包含它的句子）。"},"examples":[{"en":"What word would you like me to explain?","zh":"你想让我解释哪个单词？"},{"en":"Please send the word, and I’ll give meanings and examples.","zh":"请把单词发给我，我会提供释义和例句。"}]}],"synonyms":["ask","request","inquire","seek"],"phonetic":"/rɪˈkwɛst/"}
{"word":"requeste","summary":{"en":"“Request” means to ask for something politely/formally, or the act of doing so.","zh":"“request”表示（礼貌或正式地）请求/要求，或指这种请求本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to ask for something politely or formally","zh":"（礼貌或正式地）请求；要求（得到某物）"},"examples":[{"en":"She requested a meeting with her manager.","zh":"她请求和经理见面。"},{"en":"Passengers are requested to keep their seatbelts fastened.","zh":"乘客请系好安全带。"}]},{"partOfSpeech":"n.","definition":{"en":"an act of asking for something politely or formally","zh":"（礼貌或正式的）请求；要求"},"examples":[{"en":"We received your request for more information.","zh":"我们收到了你索取更多信息的请求。"},{"en":"At your request, I’ll send the file again.","zh":"应你的要求，我会再发送一次文件。"}]}],"synonyms":["ask","request for","seek","appeal (for)","petition","solicit"],"phonetic":"/rɪˈkwɛst/","extraExplanation":["“requeste”通常不是标准英语拼写。你可能想写的是 **request**（名词/动词）或 **requested**（request 的过去式/过去分词）。另外，法语里有 *requête*（请求）之类的词形，容易造成拼写混淆。","固定搭配：**at someone’s request**（应某人要求）；更正式的写法里常见被动结构：**be requested to do sth**（被要求做某事）。"]}
{"word":"requested","summary":{"en":"“Requested” means “asked for,” often in formal or polite contexts; it can also be the past form of “request.”","zh":"“requested”表示“被请求的/所索取的”，多用于正式或礼貌场合；也可作动词“request”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"asked for something politely or formally; sought (often used in emails, forms, or instructions).","zh":"（礼貌或正式地）请求得到某物；索取（常用于邮件、表格或说明中）。"},"examples":[{"en":"Please find the requested documents attached.","zh":"请查收附件中的所请求文件。"},{"en":"The manager requested a meeting for Monday morning.","zh":"经理请求周一上午开会。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense or past participle of “request”: to ask for something.","zh":"“request”的过去式/过去分词：请求；要求（提出）。"},"examples":[{"en":"She requested more time to finish the project.","zh":"她请求更多时间来完成项目。"},{"en":"They requested that we arrive early.","zh":"他们要求我们早点到。"}]}],"synonyms":["asked for","sought","solicited","called for"],"phonetic":"/rɪˈkwɛstɪd/","extraExplanation":["在正式英语里，“requested”常出现在固定搭配中，比如 “the requested information/documents（所需信息/文件）”。这通常比 “wanted” 更正式、更礼貌。","注意语气区别：request 通常表示礼貌提出或正式提出；require 则更像“必须/强制要求”，语气更硬。"]}
{"word":"requester","summary":{"en":"A requester is someone (or something, in computing) that makes a request.","zh":"requester 指提出请求的人（或在计算机中发出请求的程序/设备）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that asks for something, especially a service, information, or goods","zh":"请求者；提出请求的人（或团体），尤指请求服务、信息或物品的人"},"examples":[{"en":"The requester must provide a valid email address.","zh":"请求者必须提供有效的电子邮箱地址。"},{"en":"Please contact the requester if you need more details.","zh":"如果你需要更多细节，请联系请求者。"}]},{"partOfSpeech":"n.","definition":{"en":"(in computing or networks) the user, program, or device that sends a request to another system","zh":"（计算机/网络）发出请求的用户、程序或设备"},"examples":[{"en":"The server logs the requester’s IP address.","zh":"服务器会记录请求方的 IP 地址。"},{"en":"If the requester is not authorized, the system will reject the request.","zh":"如果请求方未获授权，系统将拒绝该请求。"}]}],"synonyms":["asker","applicant","petitioner","requesting party"],"phonetic":"/rɪˈkwɛstər/","extraExplanation":["“requester”来自动词 request（请求）+ 后缀 -er（表示“做某事的人/物”）。在日常英语中也可用 ask-er 或 the person who requested，但在正式场景（表格、客服、法律、IT 文档）里更常用 requester。","在英式英语里也常见近义词 applicant（申请人，偏向申请职位/学校/许可）与 petitioner（请愿人，偏向正式请愿）。选择用词取决于“请求”的类型与正式程度。"]}
{"word":"requesters","summary":{"en":"“Requesters” means people who make requests, especially in formal or workplace systems.","zh":"“requesters”指提出请求的人，尤其常用于正式或职场/系统流程中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who ask for something (such as information, help, or a service)","zh":"提出请求的人；请求者（如索取信息、寻求帮助或服务的人）"},"examples":[{"en":"The requesters asked for more time to finish the project.","zh":"请求者要求更多时间来完成这个项目。"},{"en":"Online requesters often need to provide an email address for a reply.","zh":"在网上提出请求的人通常需要提供邮箱以便回复。"}]},{"partOfSpeech":"n.","definition":{"en":"in workplaces or systems: people who submit a formal request (for example, a purchase, a document, or access)","zh":"（职场/系统中）提交正式申请的人（如采购申请、文件申请或权限申请的提交者）"},"examples":[{"en":"Requesters must get manager approval before the order is placed.","zh":"请求者必须先获得经理批准，才能下单。"},{"en":"The IT team will contact requesters if more details are needed.","zh":"如果需要更多信息，IT 团队会联系申请人。"}]}],"synonyms":["applicants","petitioners","askers","requesting parties","submitters"],"phonetic":"/rɪˈkwɛstɚz/","extraExplanation":["“requester”常见于行政、采购、客服与IT工单等语境，指“发起请求/提交申请的人”。在采购流程里，requester通常是提出需求的人，不一定是最终审批人（approver）或购买执行人（buyer/purchaser）。","口语里更常说“people who requested…”或直接用“customers/users”，而“requesters”更偏正式、偏系统用语。"]}
{"word":"requesting","summary":{"en":"“Requesting” means politely or formally asking for something; it can also describe someone who is making a request.","zh":"“requesting”表示（正在）正式或礼貌地提出请求；也可作形容词，指“在请求中的/提出请求的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"asking for something formally or politely; seeking to get something.","zh":"（正式或礼貌地）请求、要求（某物）；寻求获得（某物）。"},"examples":[{"en":"The customer is requesting a refund.","zh":"顾客正在要求退款。"},{"en":"She is requesting more time to finish the project.","zh":"她正在请求更多时间来完成项目。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “request”: to ask for something formally or politely.","zh":"“request”的现在分词：正式或礼貌地提出请求。"},"examples":[{"en":"I’m requesting a copy of my medical records.","zh":"我正在申请一份我的病历副本。"},{"en":"They’re requesting that everyone arrive on time.","zh":"他们要求每个人准时到达。"}]}],"synonyms":["asking","seeking","applying for","petitioning"],"phonetic":"/rɪˈkwɛstɪŋ/","extraExplanation":["“request”通常比“ask”更正式，常用于邮件、表格、客服或官方场景。常见搭配：request information / request a refund / request permission / request that + 从句。注意：request后面接人时，多用request something from someone（向某人请求某物）。"]}
{"word":"requestion","summary":{"en":"“Requestion” means to question again, often to clarify or confirm information.","zh":"“requestion”意思是“再次提问/再询问”，常用于澄清或确认信息。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to ask a question again; to question someone again to get clearer or more accurate information","zh":"再次提问；为获得更清楚或更准确的信息而再问一次"},"examples":[{"en":"I had to requestion him because his first answer was unclear.","zh":"他的第一次回答不清楚，所以我不得不再问他一次。"},{"en":"The lawyer requestioned the witness to confirm the timeline.","zh":"律师再次询问证人以确认时间线。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to reconsider or challenge something by questioning it again","zh":"（较少见）通过再次质疑来重新审视或挑战某事"},"examples":[{"en":"After reading the report, she began to requestion the decision.","zh":"读完报告后，她开始重新质疑这个决定。"}]}],"synonyms":["re-question","question again","ask again","reinterrogate","cross-examine"],"phonetic":"/riˈkwɛstʃən/","extraExplanation":["“requestion”在现代英语里比较少见，更常见的说法是：\n- re-question（带连字符，更直观）\n- question again / ask again（最常用、最自然）\n在正式写作或法律语境中偶尔会见到“requestion（某人）”。"]}
{"word":"requestor","summary":{"en":"A requestor is the person or group that makes a request.","zh":"requestor 指提出请求的人或机构（请求方）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that asks for something (information, a service, money, etc.).","zh":"提出请求的人；请求方（个人或机构）。"},"examples":[{"en":"The requestor must provide a phone number for follow-up.","zh":"请求方必须提供电话号码以便后续联系。"},{"en":"Please reply directly to the requestor within two business days.","zh":"请在两个工作日内直接回复请求方。"}]}],"synonyms":["requester","applicant","petitioner","inquirer"],"phonetic":"/rɪˈkwɛstɚ/","extraExplanation":["“requestor”和“requester”都表示“请求的人/请求方”。在现代英语中，requester 更常见；requestor 多见于法律、政府文件或较正式的流程文本中（例如表格、条例、合规文书）。","拼写差异通常不影响含义，但在写作时可根据场景选择：日常与一般商务偏用 requester；需要贴合某些制度/表格原文时可能保留 requestor。"]}
{"word":"requestors","summary":{"en":"“Requestors” means people who make requests; it’s a more formal variant of “requesters.”","zh":"requestors 指“提出请求的人”，是较正式的 requesters 的变体写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who make a request; people who ask for something (especially in formal or business contexts).","zh":"提出请求的人；请求者（常用于正式或商务语境）。"},"examples":[{"en":"All requestors must fill out the online form before the deadline.","zh":"所有请求者都必须在截止日期前填写在线表格。"},{"en":"The system notifies requestors when their request is approved or denied.","zh":"当请求被批准或拒绝时，系统会通知请求者。"}]}],"synonyms":["requesters","applicants","petitioners"],"phonetic":"/rɪˈkwɛstərz/","extraExplanation":["“requestor”和“requester”意思相同，都是“提出请求的人”。在日常英语里更常见的是“requester(s)”。“requestor(s)”更常出现在法律文件、政府/医疗/IT工单系统等偏正式的写法中。","拼写小提示：requestor = request + -or（表示“做某事的人/物”）；requester = request + -er。两者都正确，只是使用场景和习惯不同。"]}
{"word":"requests","summary":{"en":"“Requests” is the plural form of the noun “request,” meaning polite or formal asks; it can also be the verb “request” in the present tense (he/she/it requests).","zh":"“requests”既可以是名词“request”的复数（多个请求），也可以是动词“request”的第三人称单数现在时（他/她/它请求/要求）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of asking for something politely or formally; something you ask for","zh":"请求；要求（礼貌或正式地提出想要某物或某事）"},"examples":[{"en":"I made a request for more time to finish the project.","zh":"我提出请求，希望有更多时间完成这个项目。"},{"en":"Your request has been approved.","zh":"你的请求已获批准。"}]},{"partOfSpeech":"v.","definition":{"en":"to ask for something politely or formally","zh":"请求；要求（礼貌或正式地提出）"},"examples":[{"en":"We request that all visitors sign in at the front desk.","zh":"我们要求所有访客在前台登记。"},{"en":"She requested a quiet room away from the elevator.","zh":"她请求安排一间远离电梯的安静房间。"}]}],"synonyms":["ask","appeal","petition","application","demand (stronger)"],"phonetic":"/rɪˈkwɛsts/","extraExplanation":["“request”比“ask”更正式，常用于邮件、公告、工作场合或服务场景。","常见搭配：make a request（提出请求）、grant/approve a request（批准请求）、deny/reject a request（拒绝请求）、request that + 从句（正式表达：要求/请求……）。","语气提示：在礼貌沟通中，可以用“I’d like to request…”或“Could I request…?”来降低命令感。"]}
{"word":"requeued","summary":{"en":"“Requeued” means put back into a queue to wait or be processed again, often used in computing.","zh":"“requeued”表示“被重新放回队列/重新排队”，常见于计算机语境中指任务或消息被重新入队等待重试。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of requeue) Put someone or something back into a line (queue) to wait again.","zh":"（requeue 的过去式/过去分词）把某人或某物重新放回队列/排队中，再次等待。"},"examples":[{"en":"After the system error, the requests were requeued and processed again.","zh":"系统出错后，请求被重新放回队列，并再次处理。"},{"en":"If you miss your turn, you may be requeued at the end of the line.","zh":"如果你错过了轮到你的机会，你可能会被重新排到队伍末尾。"}]},{"partOfSpeech":"v.","definition":{"en":"(computing/logistics) Sent back into a processing queue because it failed, timed out, or needs to be retried.","zh":"（计算机/物流）由于失败、超时或需要重试而被送回处理队列。"},"examples":[{"en":"The email was requeued because the server was temporarily unavailable.","zh":"由于服务器暂时不可用，这封邮件被重新入队等待发送。"},{"en":"Jobs that exceed the time limit are requeued automatically.","zh":"超出时间限制的任务会自动重新入队。"}]}],"synonyms":["queued again","put back in the queue","reinserted","resubmitted","retried"],"phonetic":"/ˌriːˈkjuːd/","extraExplanation":["“re-”是常见前缀，表示“再次/重新”；“queue”在英式英语里常指“排队”，在技术语境中常指“队列（等待处理的任务列表）”。因此“requeued”在技术文档、日志（logs）里很常见，意思通常是“被重新放回队列以便重试”。"]}
{"word":"requicken","summary":{"en":"Requicken means to revive or make lively again (or to become lively again). It’s somewhat literary.","zh":"requicken 指“使重新恢复活力/使复苏”，或“重新活跃起来”，语体偏文学、书面。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something lively, active, or strong again; to revive or refresh","zh":"使（某人/某物）重新充满活力；使复苏、振作"},"examples":[{"en":"A short walk outside can requicken your mind after hours of studying.","zh":"学习了好几个小时后，到外面散步一会儿能让你的头脑重新振作起来。"},{"en":"The spring rain requickened the garden after a long dry spell.","zh":"春雨在漫长的干旱之后让花园重新恢复生机。"},{"en":"Her kindness seemed to requicken his hope.","zh":"她的善意似乎重新点燃了他的希望。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become lively or active again; to revive","zh":"重新活跃起来；复苏"},"examples":[{"en":"As the music started, the crowd requickened.","zh":"音乐一响起，人群又活跃了起来。"},{"en":"After a few days of rest, his energy requickened.","zh":"休息几天后，他的精力又恢复了。"}]}],"synonyms":["revive","refresh","reenergize","reinvigorate","animate"],"phonetic":"/ˌriˈkwɪkən/","extraExplanation":["“requicken”带有较强的文学/书面语色彩，日常英语里更常用 revive, refresh, reenergize, bring back to life 等。","词根 quick 在古英语里有“活着的、有生命的”的意思（例如 the quick and the dead 中的 quick 指“活人”），所以 requicken 有“让……重新有生命/活力”的感觉。"]}
{"word":"Requiem","summary":{"en":"A requiem is a Mass for the dead or a musical work (or figurative tribute) that honors someone or something lost.","zh":"Requiem 指安魂弥撒、安魂曲，也可引申为对逝者或逝去事物的挽歌式致敬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of music (often a choral work) written to honor and remember someone who has died.","zh":"（常指合唱）安魂曲；为悼念逝者而作的音乐作品。"},"examples":[{"en":"They performed Mozart’s Requiem in memory of the victims.","zh":"他们演出了莫扎特的《安魂曲》，以纪念遇难者。"},{"en":"The film ends with a quiet requiem that feels like a farewell.","zh":"电影以一段安静的“安魂曲”收尾，像是在告别。"}]},{"partOfSpeech":"n.","definition":{"en":"A Mass or religious service for the dead, especially in the Roman Catholic tradition.","zh":"（尤指天主教的）安魂弥撒；追思亡者的宗教礼仪。"},"examples":[{"en":"A requiem was held at the cathedral the next morning.","zh":"第二天早上，大教堂举行了安魂弥撒。"},{"en":"In some communities, the requiem includes prayers for the soul of the deceased.","zh":"在一些社群里，安魂礼会包含为亡者灵魂祈祷的内容。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbolic expression of mourning or an elegy—something said or done as a final tribute.","zh":"象征性的悼词/挽歌；对逝去之人或事物的最后致敬。"},"examples":[{"en":"The essay is a requiem for a disappearing way of life.","zh":"这篇文章是对一种正在消失的生活方式的挽歌。"},{"en":"Her last poem reads like a requiem for lost youth.","zh":"她的最后一首诗读起来像是对逝去青春的挽歌。"}]}],"synonyms":["Mass for the dead","funeral mass","dirge","elegy","lament","tribute"],"phonetic":"/ˈrɛkwiəm/","extraExplanation":["“Requiem”来自拉丁语开头祷词“Requiem aeternam dona eis”（愿他们得享永恒安息）。因此它既可指宗教礼仪，也可指以此为主题的音乐体裁。","在音乐与文学中，requiem 常带有“庄严、哀悼、告别”的气氛。著名作品包括莫扎特《Requiem》、威尔第《Requiem》、福雷《Requiem》等。","常见搭配：a requiem for…（为……的挽歌/悼念）；hold/attend a requiem（举行/参加安魂礼）；Requiem Mass（安魂弥撒）。"]}
{"word":"requiem","summary":{"en":"A requiem is a funeral mass or music for the dead, and by extension any solemn tribute mourning something lost.","zh":"requiem 指安魂曲/追思弥撒，也可引申为对逝去之人或消逝之物的庄重悼念与挽歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A funeral song, mass, or other piece of music written or performed in memory of someone who has died.","zh":"安魂曲；追悼音乐（为逝者创作或演奏的葬礼弥撒/哀悼作品）"},"examples":[{"en":"Mozart’s Requiem is one of the most famous works in Western classical music.","zh":"莫扎特的《安魂曲》是西方古典音乐中最著名的作品之一。"},{"en":"The choir performed a requiem for the victims of the disaster.","zh":"合唱团为灾难的遇难者演唱了一首安魂曲。"}]},{"partOfSpeech":"n.","definition":{"en":"An act or expression of remembrance and mourning for someone or something that has ended.","zh":"（对逝去之人或终结之事的）悼念；挽歌式的纪念"},"examples":[{"en":"The novel reads like a requiem for a vanished way of life.","zh":"这部小说读起来像是一首为消逝生活方式写的挽歌。"},{"en":"Her speech became a quiet requiem for the community they had lost.","zh":"她的演讲成了一首为他们失去的社区而作的静默挽歌。"}]}],"synonyms":["funeral mass","dirge","elegy","memorial"],"phonetic":"/ˈrɛkwiəm/","extraExplanation":["“Requiem”源自拉丁语弥撒中的开头句“Requiem aeternam dona eis”（赐予他们永恒安息）。因此它常与天主教/基督宗教的追思礼仪相关，但在现代英语里也可比喻“为某种逝去之物写的挽歌”。","文学与音乐中常见搭配：Requiem Mass（安魂弥撒）、a requiem for…（为……写的挽歌）。","常见作品名举例：Mozart’s Requiem、Fauré’s Requiem、Verdi’s Requiem。"]}
{"word":"requiems","summary":{"en":"“Requiems” means memorial songs or musical works for the dead (plural of “requiem”).","zh":"“requiems”指为逝者创作或演唱的悼念歌曲/安魂曲（“requiem”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of requiem: a song, prayer, or musical work (often a Mass) for someone who has died; a funeral hymn or memorial piece.","zh":"requiem 的复数：为逝者而作的悼念之歌、祈祷或音乐作品（常指“安魂弥撒”）；葬礼圣歌或纪念曲。"},"examples":[{"en":"The choir performed two requiems in memory of the victims.","zh":"合唱团演唱了两部安魂曲，以纪念遇难者。"},{"en":"Mozart’s requiems are often discussed in music history classes.","zh":"莫扎特的安魂曲常在音乐史课堂上被讨论。"},{"en":"The poem reads like one of his quiet requiems for lost friends.","zh":"这首诗读起来像是他为失去的朋友写的静默挽歌。"}]}],"synonyms":["funeral hymns","dirges","elegies","memorial pieces"],"phonetic":"/ˈrɛkwiəmz/","extraExplanation":["“Requiem”源自拉丁语安魂弥撒开头的词句“Requiem aeternam”（意为“赐予他们永恒的安息”）。因此它既可指宗教仪式中的“安魂弥撒”，也常泛指为逝者创作的哀悼音乐或挽歌。","在西方音乐文化中，著名的安魂曲包括莫扎特《安魂曲》、威尔第《安魂曲》、福雷《安魂曲》等；文学里也会把“requiem”借喻为对逝去之物的告别与纪念（如“a requiem for a dream / a requiem for a generation”这类表达）。"]}
{"word":"requienia","summary":{"en":"Requiem means a funeral Mass/service for the dead, a musical work written for such a service, or a mournful tribute/farewell.","zh":"requiem 指“安魂弥撒/追思礼拜”、为其创作的“安魂曲”，也可泛指对逝者或逝去事物的“挽歌/悼念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Christian (especially Catholic) service or Mass for a dead person; a funeral service","zh":"（尤指天主教的）安魂弥撒；为逝者举行的追思礼拜/葬礼仪式"},"examples":[{"en":"They held a requiem for the victims at the cathedral.","zh":"他们在大教堂为遇难者举行了安魂弥撒。"},{"en":"A requiem Mass was offered in his memory.","zh":"人们为纪念他举行了安魂弥撒。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of music written for a requiem service, or any serious musical work that mourns the dead","zh":"安魂曲（为安魂弥撒而作的音乐）；亦指哀悼逝者的庄严乐曲"},"examples":[{"en":"Mozart’s Requiem is one of the most famous works in Western classical music.","zh":"莫扎特的《安魂曲》是西方古典音乐中最著名的作品之一。"},{"en":"The film ends with a requiem that feels both sad and beautiful.","zh":"电影在一段既悲伤又唯美的“安魂曲”式音乐中结束。"}]},{"partOfSpeech":"n.","definition":{"en":"a speech, poem, or expression of mourning; a farewell to something that has ended","zh":"悼词/挽歌；（对某事物终结的）告别与哀悼"},"examples":[{"en":"The novel reads like a requiem for a lost generation.","zh":"这部小说读起来像是一代人逝去的挽歌。"},{"en":"His article was a requiem for the old neighborhood.","zh":"他的文章像是对老街区的一篇挽歌。"}]}],"synonyms":["funeral Mass","memorial service","dirge","elegy","lament"],"phonetic":"/ˈrɛkwiəm/","extraExplanation":["你输入的“requienia”不是常见英语词，最接近的是“requiem”（安魂弥撒/安魂曲）。如果你想表达“为……写一篇挽歌/悼念”，英语里常用搭配是“a requiem for ...”（如：a requiem for a dream）。","词源小知识：requiem来自拉丁语安魂弥撒开头的词句“Requiem aeternam dona eis”（愿他们得享永恒安息），因此这个词天然带有“悼念、安息”的宗教与文化色彩。"]}
{"word":"requiescat","summary":{"en":"A Latin word used to mean “may he/she rest,” usually in memorial contexts (often in “requiescat in pace,” i.e., R.I.P.).","zh":"拉丁语词，表示“愿他/她安息”，多用于悼念语境（常见于“requiescat in pace”，即R.I.P.）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English in formal or literary contexts) “May he/she rest,” especially said about someone who has died; often seen as part of “requiescat in pace (R.I.P.).”","zh":"（拉丁语；在英语中多用于正式或文学语境）“愿他/她安息”，常用于悼念逝者；常见于短语“requiescat in pace（R.I.P.）”。"},"examples":[{"en":"Requiescat in pace—may her memory be a blessing.","zh":"Requiescat in pace——愿她安息，愿她的记忆带来祝福。"},{"en":"The old gravestone bore the words “requiescat in pace.”","zh":"那块古老的墓碑上刻着“requiescat in pace”。"},{"en":"In a solemn, old-fashioned tone, he murmured, “requiescat,” and lowered his head.","zh":"他用庄重而古典的语气低声说道：“requiescat”，并低下了头。"}]}],"synonyms":["R.I.P.","rest in peace","may he/she rest"],"phonetic":"/ˌreɪkwiˈɛskɑt/","extraExplanation":["“requiescat”是拉丁语动词的虚拟式（相当于祝愿语气），直译是“愿他/她休息/安息”。英语里单独使用较少，更常与“in pace（在平安中）”连用，形成墓志铭或悼词中常见的“requiescat in pace”。","在文学中，这类拉丁语悼亡表达常用来营造庄严、古典或宗教氛围；如果在日常英语对话里使用，通常会显得非常正式或带有复古色彩。","相关常见表达：R.I.P.（Rest in peace）、May he/she rest in peace（愿他/她安息）。"]}
{"word":"requiescence","summary":{"en":"Requiescence means a quiet, restful state—calm, stillness, or inactivity, often in formal or literary writing.","zh":"Requiescence 指安静、休息般的状态，即平静、静止或不活跃，多见于正式或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being quiet, still, or at rest; inactivity or calm.","zh":"安静、静止或休息的状态；不活跃、平静。"},"examples":[{"en":"The town fell into requiescence after the festival ended.","zh":"节日结束后，小镇恢复了宁静。"},{"en":"After weeks of stress, she finally found a moment of requiescence.","zh":"在连续几周的压力后，她终于找到片刻的安宁。"},{"en":"The lake’s surface was in perfect requiescence, like glass.","zh":"湖面极其平静，像玻璃一样。"}]}],"synonyms":["stillness","calm","rest","quiet","inactivity","quiescence"],"phonetic":"/ˌriːkwiˈɛsəns/","extraExplanation":["这个词比较少见，常见于较正式或文学性的语境，用来表达“寂静、静止、安宁”的氛围。日常英语里更常用 quiet, calm, stillness, rest 等词。","词源来自拉丁语 *requiescere*（休息、安息），与 *requiem*（安魂曲）同源，因此在文学中有时会带一点“安息/沉寂”的色彩，但不一定指死亡。"]}
{"word":"requin","summary":{"en":"Requin is the French word for “shark,” sometimes used figuratively for a ruthless predator in business or politics.","zh":"Requin 是法语里“鲨鱼”的意思，也可引申指商业或政治中的掠夺者、狠角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French word) a shark.","zh":"（法语词）鲨鱼。"},"examples":[{"en":"In French, “requin” means “shark.”","zh":"在法语里，“requin”的意思是“鲨鱼”。"},{"en":"The documentary is titled Les requins (“The sharks”).","zh":"这部纪录片的标题是《Les requins》（“鲨鱼们”）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, from French use) a ruthless or predatory person, especially in business or politics.","zh":"（引申义，源自法语用法）指在商业或政治中“吃人不吐骨头”的人；掠夺者。"},"examples":[{"en":"Some people call aggressive investors “requins” in French.","zh":"在法语里，有人会把咄咄逼人的投资者称为“requins”。"},{"en":"He was seen as a requin of the industry, always hunting for weaker competitors.","zh":"他被视为行业里的“鲨鱼”，总在寻找更弱的竞争对手下手。"}]}],"synonyms":["shark","predator","vulture (figurative)","cutthroat (figurative)"],"phonetic":"/rəˈkæn/","extraExplanation":["“requin”是法语单词，英语里并不常作为日常词汇使用，但可能会出现在法语语境、书名/电影名、品牌名或人名中。","法语发音带鼻化元音（-in），英语母语者常用近似读法；如果你是在英语文本里看到它，通常可直接理解为“shark（鲨鱼）”。"]}
{"word":"requins","summary":{"en":"“Requins” is the French plural for “sharks,” and it can also mean predatory people (like ruthless business or loan sharks).","zh":"“requins”是法语中“鲨鱼”的复数，也可比喻掠食性的人（如冷酷商人或高利贷者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French plural) “sharks.” Used when talking about sharks in French, or in French titles/contexts in English.","zh":"（法语复数）“鲨鱼”。多用于法语语境，或英语中引用法语标题/场合时。"},"examples":[{"en":"In the documentary, the narrator says, “Les requins sont essentiels à l’océan.”","zh":"在纪录片里，旁白说：“鲨鱼对海洋生态至关重要。”"},{"en":"The museum has a section called “Requins et raies” (sharks and rays).","zh":"博物馆有一个展区叫“Requins et raies”（鲨鱼与鳐鱼）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, from French) predatory people, especially ruthless businesspeople or “loan sharks.”","zh":"（比喻义，源自法语）指“掠夺性的人”，尤指冷酷无情的商人或“放高利贷的人（高利贷者）”。"},"examples":[{"en":"Some articles call them “requins de la finance” (sharks of finance).","zh":"有些文章称他们为“requins de la finance”（金融鲨鱼）。"},{"en":"She warned him not to borrow money from those “requins.”","zh":"她警告他别向那些“鲨鱼”（高利贷者）借钱。"}]}],"synonyms":["sharks","predators","loan sharks"],"phonetic":"/rəˈkæ̃/","extraExplanation":["“requins”是法语名词“requin”的复数形式；法语里单数是un requin，复数是des requins。","法语里“requin”也常像英语“shark”一样用作比喻，形容在商业/金钱上很“狠”、很会占便宜的人，例如“requin de la finance”（金融掠食者）。","如果你是在英语阅读中看到“requins”，通常意味着作者在引用法语（如片名、章节名、法语报道），而不是标准英语单词。"]}
{"word":"requir","summary":{"en":"Require means “need” or “officially demand,” often because of rules or necessity.","zh":"Require 表示“需要”或“（因规定/权威而）要求”，常用于正式语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to need something; to make something necessary","zh":"需要（某物）；使……成为必要"},"examples":[{"en":"A passport is required to enter the country.","zh":"进入该国需要护照。"},{"en":"This job requires patience and careful attention to detail.","zh":"这份工作需要耐心和对细节的仔细关注。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially demand or request something (often by a rule, law, or authority)","zh":"（常因规定、法律或权威）要求；规定必须"},"examples":[{"en":"The school requires students to wear uniforms.","zh":"学校要求学生穿校服。"},{"en":"The form requires your signature.","zh":"这份表格需要你的签名。"}]},{"partOfSpeech":"vt.","definition":{"en":"to order someone to do something","zh":"命令/要求某人做某事"},"examples":[{"en":"They required him to apologize in public.","zh":"他们要求他公开道歉。"},{"en":"The judge required the company to pay a fine.","zh":"法官要求该公司缴纳罚款。"}]}],"synonyms":["need","demand","request","necessitate","call for"],"phonetic":"rɪˈkwaɪər","extraExplanation":["你输入的“requir”通常是拼写未完成或拼写错误；标准拼写是 **require**。第三人称单数：requires；过去式/过去分词：required；现在分词：requiring。","常见搭配：**require + 名词**（require a passport）；**require + someone + to do**（require students to wear uniforms）。注意一般不说 *require to do*（除非主语就是执行者，且语气较正式）。","在正式英语里常见结构：**require that + 从句**（The law requires that he be present.）。美式英语中从句里常用“虚拟式”动词原形 **be**。"]}
{"word":"requirable","summary":{"en":"Requirable means something can be required (especially in formal or legal contexts).","zh":"Requirable 指“可以被要求为必要的”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be required; something that can be demanded as necessary by a rule, contract, or authority","zh":"可被要求的；（按规定、合同或权威）可以被强制要求为必要的"},"examples":[{"en":"Is parental consent requirable for this field trip?","zh":"这次校外活动是否可以要求家长同意？"},{"en":"The court decided that the document was not legally requirable.","zh":"法院裁定该文件在法律上不能被强制要求。"}]}],"synonyms":["demandable","enforceable","mandatory (more common)","required (more common)"],"phonetic":"/rɪˈkwaɪrəbəl/","extraExplanation":["“requirable”在现代英语中比较少见，日常表达更常用“required”（被要求的）或“mandatory”（强制的）。","语感上，“requirable”强调“在原则/规则上是否可以要求（能不能要求）”，而“required/mandatory”更常见于说明“确实必须做”。","常见搭配语境偏正式或法律/规章：legally requirable（法律上可被要求的）、requirable documents（可要求提交的文件）。"]}
{"word":"require","summary":{"en":"Require means “need” or “make necessary,” often in formal situations or because of rules.","zh":"require 表示“需要/使成为必须”，常用于正式场合或因规则而产生的义务。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to need something or make something necessary (often because of a rule, law, or situation)","zh":"需要；要求（常因规则、法律或情况而必须）"},"examples":[{"en":"Most jobs require good communication skills.","zh":"大多数工作都需要良好的沟通能力。"},{"en":"The law requires drivers to wear seat belts.","zh":"法律要求司机系安全带。"},{"en":"This task requires careful planning.","zh":"这项任务需要周密的计划。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially order or request something, especially in a formal or authoritative way","zh":"正式要求；命令（尤指以权威或正式方式）"},"examples":[{"en":"The manager required everyone to submit the report by Friday.","zh":"经理要求每个人在周五前提交报告。"},{"en":"Applicants are required to provide proof of identity.","zh":"申请人被要求提供身份证明。"}]}],"synonyms":["need","demand","necessitate","call for"],"phonetic":"/rɪˈkwaɪər/","extraExplanation":["用法提示：require 后面常接名词（require help）、动名词（require meeting—较少见，更常说 require a meeting）、或不定式结构（require someone to do something）。被动语态很常见：be required to do…（被要求/必须做……）。","语气区别：require 比 need 更正式、更“带规则/义务”的感觉；request 则更礼貌、偏“请求”。"]}
{"word":"required","summary":{"en":"“Required” means necessary or officially demanded; it’s often used for rules, conditions, and instructions.","zh":"“required”表示“必需的/必须的”，常用于规则、条件与说明中的“要求”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"needed or necessary in order to do something; not optional","zh":"必需的；需要的；不可缺少的"},"examples":[{"en":"A passport is required for international travel.","zh":"出国旅行需要护照。"},{"en":"Good communication is required to work well as a team.","zh":"要做好团队合作，良好的沟通是必需的。"},{"en":"No experience is required for this entry-level job.","zh":"这份入门级工作不要求经验。"}]},{"partOfSpeech":"adj.","definition":{"en":"officially demanded or made necessary by a rule, law, teacher, or situation","zh":"（因规定/法律/要求而）必须的；强制的"},"examples":[{"en":"Safety training is required by law in many workplaces.","zh":"在许多工作场所，安全培训是法律规定必须进行的。"},{"en":"Students are required to submit the assignment by Friday.","zh":"学生必须在周五前交作业。"}]},{"partOfSpeech":"v.","definition":{"en":"the past participle form of “require,” used in passive voice or perfect tenses","zh":"“require”的过去分词；用于被动语态或完成时"},"examples":[{"en":"You are required to show ID at the entrance.","zh":"入场时你需要出示身份证件。"},{"en":"The report has required several revisions.","zh":"这份报告已经需要过好几次修改。"}]}],"synonyms":["necessary","needed","mandatory","compulsory","essential"],"phonetic":"rɪˈkwaɪɚd","extraExplanation":["“required”常见于正式场合（学校、公司制度、法律、说明书）。口语里也可用“need to / have to / must”来表达“必须”。","对比：required 更强调“外部规定或条件”；necessary 更强调“客观需要”；mandatory 表示“强制性的”，语气通常更强。"]}
{"word":"requirement","summary":{"en":"A requirement is something necessary or a condition/standard you must meet.","zh":"requirement 指“必须具备的东西”或“必须满足的条件/标准”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is needed or demanded; a condition that must be met.","zh":"要求；必备条件；必须满足的事情。"},"examples":[{"en":"A valid ID is a requirement for opening a bank account.","zh":"开设银行账户需要有效身份证件，这是一个要求。"},{"en":"Meeting the deadline is a basic requirement of this job.","zh":"按时完成任务是这份工作的基本要求。"},{"en":"The course has several requirements, including regular attendance.","zh":"这门课有几个要求，包括按时出勤。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific rule or standard set by an organization, school, or law.","zh":"（机构/学校/法律规定的）具体规定或标准。"},"examples":[{"en":"Applicants must satisfy the visa requirements before traveling.","zh":"申请人必须在出行前满足签证要求。"},{"en":"The building failed to meet safety requirements.","zh":"这栋楼未达到安全标准/要求。"}]}],"synonyms":["necessity","condition","standard","qualification","prerequisite","rule"],"phonetic":"/rɪˈkwaɪərmənt/","extraExplanation":["“requirement”常用作可数名词：a requirement / the requirements（多项要求）。在学习/工作语境里，requirements 往往指一组必须完成的事项（如课程要求、入职要求）。","注意与“prerequisite”的区别：requirement 是“必须满足的要求/条件”，prerequisite 更强调“前置条件（做某事之前必须先有的条件）”。例如：A prerequisite for the course is basic algebra（先修代数）。"]}
{"word":"requirements","summary":{"en":"“Requirements” means the necessary conditions or rules you must follow or meet.","zh":"“requirements”指必须遵守或达到的要求、条件或规定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is needed or demanded; a condition you must meet.","zh":"要求；必需条件；你必须满足的规定/条件。"},"examples":[{"en":"Meeting the visa requirements can take several weeks.","zh":"满足签证要求可能需要好几周。"},{"en":"The job requirements include strong communication skills.","zh":"这份工作的要求包括良好的沟通能力。"},{"en":"One requirement for graduation is completing a final project.","zh":"毕业的一项要求是完成毕业项目。"}]}],"synonyms":["conditions","criteria","prerequisites","standards","needs"],"phonetic":"/rɪˈkwaɪərmənts/","extraExplanation":["“requirements”通常是名词复数，来自“requirement”（要求、必要条件）。在学校、工作、法律/政策、产品说明书里很常见。","常见搭配：meet/satisfy the requirements（满足要求）；minimum requirements（最低要求）；system requirements（系统需求）；entry requirements（入学/入境要求）。","在口语或较随意的语境中，有时也会用“needs”表达“需求”，但“requirements”更正式、更偏规则或标准。"]}
{"word":"requirer","summary":{"en":"“Requirer” means the person or party who requires something (often in formal or legal writing).","zh":"“Requirer”指“提出要求的人/要求方”，多见于较正式或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that requires something; someone who demands or makes a condition necessary","zh":"提出要求的人；要求某事的人或机构"},"examples":[{"en":"The requirer of the documents must sign this form.","zh":"文件的要求方必须在这份表格上签字。"},{"en":"In the contract, the requirer can ask for changes before approval.","zh":"在合同中，要求方可以在批准前提出修改。"}]}],"synonyms":["requester","applicant","demandant","claimant","the requesting party"],"phonetic":"/rɪˈkwaɪrɚ/","extraExplanation":["“requirer”在现代英语里不算常用名词，更常见的表达是“the person who requires … / the party requesting … / requester / applicant / demand(er)”。\n- 在法律、合同、技术文档中偶尔会看到“requirer”，用来指“提出要求的一方（要求方）”。\n- 日常交流中一般用“requester（请求者）”或“the one who requires it（需要它的人）”。"]}
{"word":"requirere","summary":{"en":"Require means “need” or “officially demand.”","zh":"require 表示“需要”或“（正式）要求”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to need something; to have to have it","zh":"需要某物；必须要有"},"examples":[{"en":"This job requires a driver’s license.","zh":"这份工作需要驾驶执照。"},{"en":"Plants require sunlight and water to grow.","zh":"植物生长需要阳光和水。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially demand that someone do something (often by a rule, law, or authority)","zh":"（常因规定、法律或权威）要求某人做某事"},"examples":[{"en":"The school requires students to wear uniforms.","zh":"学校要求学生穿校服。"},{"en":"By law, employers are required to provide a safe workplace.","zh":"法律要求雇主提供安全的工作环境。"}]}],"synonyms":["need","demand","call for"],"phonetic":"/rɪˈkwaɪər/","extraExplanation":["你输入的“requirere”看起来像是拼写错误，常见正确拼写是 **require**。","常见句型：**require + 名词**（require a license）；**require + 人 + to do**（require students to wear…）；被动：**be required to do**（are required to provide…)."]}
{"word":"requirers","summary":{"en":"“Requirers” means the people or organizations that require something (plural).","zh":"“Requirers”指提出要求或需要某事的人/机构（复数），多用于正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or organizations that require (demand or make necessary) something; plural of “requirer.”","zh":"提出要求的人或机构；需要某事的人或机构（“requirer”的复数）。"},"examples":[{"en":"The grant’s requirers asked applicants to submit a budget plan.","zh":"这项资助的要求方让申请者提交预算方案。"},{"en":"Different requirers may ask for different documents.","zh":"不同的要求方可能会要求不同的文件。"}]}],"synonyms":["demanders","requesters","claimants","those who require"],"phonetic":"/rɪˈkwaɪrərz/","extraExplanation":["“requirer”由动词 require（要求；需要）+ 后缀 -er 构成，表示“做某事的人/物”。但在日常英语中，更常用的是“people who require…”或用更具体的词（如 requesters 申请/请求的人、employers 雇主、regulators 监管机构）。","“requirer(s)”在法律、合同或正式文件里更常见，用来指“提出要求的一方/方”。"]}
{"word":"requires","summary":{"en":"“Requires” means “needs” or “officially demands,” often used for rules, standards, or necessary conditions.","zh":"“requires”表示“需要”或“（正式）要求”，常用于规则、标准或必要条件。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to need something; to be necessary","zh":"需要；必不可少"},"examples":[{"en":"This job requires patience and good communication skills.","zh":"这份工作需要耐心和良好的沟通能力。"},{"en":"A valid ticket is required to enter the museum.","zh":"进入博物馆需要有效门票。"}]},{"partOfSpeech":"v.","definition":{"en":"to officially ask for something or make something mandatory (often in rules, laws, or instructions)","zh":"（正式）要求；规定必须"},"examples":[{"en":"The school requires students to wear uniforms.","zh":"学校要求学生穿校服。"},{"en":"The form requires you to provide your address.","zh":"这张表格要求你填写地址。"}]},{"partOfSpeech":"v.","definition":{"en":"to demand something because a situation makes it necessary","zh":"（形势所迫）需要；要求（必须采取行动）"},"examples":[{"en":"The situation requires immediate action.","zh":"形势需要立即采取行动。"},{"en":"This kind of work requires careful planning.","zh":"这类工作需要周密的计划。"}]}],"synonyms":["needs","demands","calls for","necessitates","requires"],"phonetic":"/rɪˈkwaɪərz/","extraExplanation":["“requires”是动词“require”的第三人称单数：He/She/It requires...；过去式/过去分词是required。","常见搭配：require + 名词（require practice 需要练习）；require sb. to do sth.（require students to read 要求学生阅读）；be required to do（被要求做……）。","“require”通常比“need”更正式、更像规则或标准；“demand”语气更强，强调强烈要求或不满。"]}
{"word":"requiring","summary":{"en":"“Requiring” means needing something or being demanding; it is also the -ing form of “require.”","zh":"“requiring”表示“需要……；要求很高”，也可以是“require”的现在分词形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"needing something; demanding a lot of effort, time, or skill","zh":"需要某物的；要求很高（很费力/费时/费技能）的"},"examples":[{"en":"This is a requiring job, so you need to be patient and careful.","zh":"这份工作要求很高，所以你需要有耐心并且细心。"},{"en":"The project is requiring more money than we expected.","zh":"这个项目比我们预想的更需要资金。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “require”: to need something; to demand that something must be done","zh":"“require”的现在分词形式：需要；要求（必须做某事）"},"examples":[{"en":"The recipe is requiring two eggs and a cup of milk.","zh":"这个食谱需要两个鸡蛋和一杯牛奶。"},{"en":"The school is requiring students to wear uniforms.","zh":"学校要求学生穿校服。"},{"en":"He’s requiring everyone to arrive on time.","zh":"他要求所有人准时到。"}]}],"synonyms":["needing","demanding","calling for","challenging"],"phonetic":"/rɪˈkwaɪrɪŋ/","extraExplanation":["“require”通常表示“规则/条件上的必须”（更强、更正式），而“request”更像“请求/希望”（语气更委婉）。例如：The law requires...（法律规定必须……） vs. I request...（我请求……）。","在日常写作里，“requiring”作形容词比较少见，更常用“demanding / challenging”来表达“要求高、费力”。例如：a demanding job（高要求的工作）。"]}
{"word":"requisite","summary":{"en":"Requisite means “necessary” (adj.) or “a required thing/condition” (n.), often in formal contexts like jobs or rules.","zh":"Requisite 表示“必需的”（形容词）或“必需之物/必要条件”（名词），多用于较正式语境，如招聘、规定等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Needed for a particular purpose; necessary.","zh":"（较正式）为达成某个目的所必需的；必要的。"},"examples":[{"en":"Applicants must have the requisite experience to do the job.","zh":"申请者必须具备胜任这份工作的必要经验。"},{"en":"A calm attitude is requisite for handling emergencies.","zh":"冷静的态度是处理紧急情况所必需的。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal) A thing that is needed; a requirement.","zh":"（较正式）必需之物；必要条件；要求。"},"examples":[{"en":"Fluency is a requisite for this customer-facing role.","zh":"流利的语言能力是这个面向客户岗位的必要条件。"},{"en":"They gathered all the requisites for the trip: passports, tickets, and insurance.","zh":"他们准备好了旅行所需的一切：护照、机票和保险。"}]}],"synonyms":["necessary","required","essential","indispensable","prerequisite"],"phonetic":"/ˈrɛkwəzɪt/","extraExplanation":["“Requisite”语气偏正式，常见于招聘、合同、学术写作，意思接近“necessary/required”，但更强调“为某个目的所必需的条件或资格”。","常用搭配：the requisite + 名词（the requisite skills/qualifications/experience）以及 be requisite for/to（be requisite for success / be requisite to complete the task）。","词源上来自拉丁语 *requirere*（要求、需要），与“require（需要/要求）”同源，因此在语感上也常与“requirement（要求）”相呼应。"]}
{"word":"requisitely","summary":{"en":"Requisitely means “in an exquisitely beautiful and carefully made way.”","zh":"requisitely 表示“极其精美、细腻、讲究地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an extremely beautiful, delicate, and carefully made way; with refined quality and great attention to detail.","zh":"以极其精美、细腻、考究的方式；品质高雅、非常讲究细节地。"},"examples":[{"en":"The room was requisitely decorated with soft lighting and fresh flowers.","zh":"房间被装饰得极其精致，有柔和的灯光和鲜花。"},{"en":"She wore a requisitely tailored suit for the interview.","zh":"她面试时穿了一套剪裁非常考究的西装。"},{"en":"The watch is requisitely crafted, down to the smallest details.","zh":"这块表的工艺极其精细，连最小的细节都处理得很到位。"}]}],"synonyms":["exquisitely","beautifully","finely","elegantly","delicately"],"phonetic":"/ˈrɛkwəzətli/","extraExplanation":["“requisitely”来自形容词“requisite /ˈrɛkwəzɪt/”（必要的；必需的）与“exquisite /ɪkˈskwɪzɪt/”（精美的）在拼写上很像，学习者容易混淆。注意：requisitely表达“精美地/考究地”，而不是“必要地”。","使用场景多偏文学或较正式的描写，常搭配：requisitely decorated / crafted / detailed / designed / tailored。日常口语里也可用“beautifully”“perfectly”“finely”替换。"]}
{"word":"requisiteness","summary":{"en":"Requisiteness means the state or quality of being necessary or required.","zh":"Requisiteness 指“必要性/必需性”，表示某事对达成目标是必须的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being necessary or required for a particular purpose.","zh":"（为实现某目的而）必要性；必需性。"},"examples":[{"en":"We discussed the requisiteness of a passport before booking the trip.","zh":"我们在订机票前讨论了护照的必要性。"},{"en":"The report emphasizes the requisiteness of clear communication in emergencies.","zh":"报告强调了在紧急情况下清晰沟通的必要性。"}]}],"synonyms":["necessity","requirement","essentialness","indispensability"],"phonetic":"/ˈrɛkwəzɪtnəs/","extraExplanation":["“requisiteness”比较少见、偏正式的名词，更常用的表达是“necessity / requirement / essential nature”。在日常英语里，你通常会说“the necessity of…”或“a requirement”。","词根来自“requisite”（必需的/必需品），常见搭配包括：requisite skills（必备技能）、requisite documents（必需文件）。相比之下，“requisiteness”多见于学术或法律语境。"]}
{"word":"requisites","summary":{"en":"Requisites are things that are necessary or required; as an adjective, requisite means “necessary.”","zh":"requisites 指必需的事物/条件；作形容词时 requisite 表示“必要的、必需的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something that is necessary for a particular purpose; a requirement","zh":"为某个目的所必需的事物；必备条件；要求"},"examples":[{"en":"A passport is a requisite for international travel.","zh":"护照是国际旅行的必备条件。"},{"en":"Patience is a requisite for learning a new language.","zh":"学习一门新语言需要耐心，这是必备条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"necessary; required for something to happen or be done","zh":"必要的；必需的；必备的"},"examples":[{"en":"Requisite training must be completed before you start the job.","zh":"开始工作前必须完成必要的培训。"},{"en":"He doesn’t have the requisite experience for the role.","zh":"他没有这个职位所需的必要经验。"}]}],"synonyms":["requirement","necessity","essential","condition","prerequisite"],"phonetic":"ˈrɛkwəzɪt","extraExplanation":["“requisites”是“requisite”的复数名词形式，常见于较正式的语境（如规则、合同、学术写作）。","常与“prerequisite”对比：requisite=必需条件（不强调先后）；prerequisite=先决条件（强调必须先满足/先完成）。"]}
{"word":"requisition","summary":{"en":"A requisition is an official request or order for supplies or documents; it can also mean to officially request or take something for public or official use.","zh":"requisition 指对物资/文件等的正式申请或调拨令；作动词也可指正式申请，或在公共/官方需要时征用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an official request or order for something, especially supplies or documents","zh":"（尤指物资或文件的）正式申请；正式调拨/征用令"},"examples":[{"en":"The lab submitted a requisition for new safety goggles.","zh":"实验室提交了一份申请，要求采购新的安全护目镜。"},{"en":"Please attach the requisition form to your purchase request.","zh":"请把领用/采购申请表附在你的采购申请后面。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially request or order something (often for work or military use)","zh":"正式申请；下达调拨/征用（常用于工作或军用）"},"examples":[{"en":"The manager requisitioned more computers for the new team.","zh":"经理正式申请为新团队增加电脑。"},{"en":"During emergencies, the government may requisition vehicles.","zh":"在紧急情况下，政府可能会征用车辆。"}]}],"synonyms":["request","order","application","demand","procurement request"],"phonetic":"/ˌrɛkwəˈzɪʃən/","extraExplanation":["“requisition”常见于行政、采购与军队语境：公司里常说“purchase requisition（采购申请单）”；在政府/军事语境中则更偏“征用、调拨”，语气比一般的“request”更正式、更有权威性。","词源上与“require（需要）”同源，核心感觉是“需要并正式要求”。"]}
{"word":"requisitionary","summary":{"en":"“Requisitionary” means “related to an official requisition or demand for supplies/services,” usually in formal or government/military contexts.","zh":"“requisitionary”意为“与正式征用/请领（requisition）有关的”，多用于政府、军队或公文等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a requisition (an official demand or order to supply goods, services, or information), especially by a government, military, or organization.","zh":"与“征用/调拨令、正式请领（requisition）”有关的；尤指政府、军队或机构正式要求提供物资、服务或信息的。"},"examples":[{"en":"During the emergency, the city issued requisitionary orders for fuel and medical supplies.","zh":"在紧急时期，市政府发布了对燃料和医疗物资的征用/调拨令。"},{"en":"The warehouse kept requisitionary records to track who requested each item.","zh":"仓库保留请领记录，以追踪每件物品是谁申请领取的。"}]}],"synonyms":["requisitional","official","administrative","procurement-related","supply"],"phonetic":"/ˌrɛkwəˈzɪʃəˌnɛri/","extraExplanation":["“requisitionary”较少见，常出现在政府行政、军事后勤、公共采购或法律/公文语境中。日常英语里更常用“requisition”作名词（a requisition）或动词（to requisition），以及形容词“requisitioned”（被征用的）。","在英美历史语境中，战争或紧急状态下政府对物资“征用/调拨”较常被讨论，因此该词带有较强的制度性、官方色彩。"]}
{"word":"requisitioned","summary":{"en":"“Requisitioned” means officially requested or taken for official use (often by an authority).","zh":"“requisitioned”表示“被正式申请/请领”，或“被当局征用（多用于紧急或官方用途）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something needed) officially requested, especially by an organization or authority.","zh":"（对所需之物）被正式申请/请领（尤指由机构或当局提出）。"},"examples":[{"en":"Extra laptops were requisitioned for the new staff.","zh":"为新员工请领了额外的笔记本电脑。"},{"en":"The clinic requisitioned more masks during the flu season.","zh":"在流感季节，诊所申请了更多口罩。"}]},{"partOfSpeech":"adj.","definition":{"en":"taken or demanded for official use by an authority (often during an emergency or war).","zh":"（常指紧急情况或战争时期）被政府/当局征用、强制调拨。"},"examples":[{"en":"During the disaster, private trucks were requisitioned to deliver supplies.","zh":"灾害期间，私人物资运输卡车被征用来运送补给。"},{"en":"Several buildings were requisitioned as temporary shelters.","zh":"几栋建筑被征用作临时避难所。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “requisition”: to officially request or to take for official use.","zh":"“requisition”的过去式/过去分词：正式申请/请领；或为公务征用。"},"examples":[{"en":"The manager requisitioned a replacement printer.","zh":"经理正式申请了一台替换打印机。"},{"en":"The army requisitioned food from local stores.","zh":"军队从当地商店征用食物。"}]}],"synonyms":["requested","ordered","demanded","commandeered","appropriated"],"phonetic":"/ˌrɛkwəˈzɪʃənd/","extraExplanation":["“requisition”常见于较正式或官僚语境（政府、公务、军队、医院、公司采购）。它既可以表示“正式申请/请领”（偏中性），也可以表示“征用/强制调拨”（带更强权力色彩）。判断含义时看上下文：是否涉及当局、紧急状态、财产被拿走等。","相关词：requisition form（请购/领用单）、requisition order（调拨令）。近义词区分：request（一般请求，语气更普通）；commandeer（多指强行征用，语气更强）。"]}
{"word":"requisitioner","summary":{"en":"A requisitioner is the person who formally requests or orders needed supplies or services, especially in official or organizational processes.","zh":"requisitioner 指在正式流程中提出申购/领用需求的人，常见于公司采购、政府或军队的物资申请。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who officially asks for or orders supplies, services, or equipment (often in a workplace, government, or military setting)","zh":"（通常在公司、政府或军队等场景中）负责正式提出申请或开具领用/采购单的人；申购人/领用申请人"},"examples":[{"en":"Please send the request to the requisitioner for approval.","zh":"请把申请发给申购人审批。"},{"en":"The requisitioner listed the exact quantity of laptops needed.","zh":"申购人列出了所需笔记本电脑的具体数量。"}]}],"synonyms":["requester","applicant","orderer","procurement requester"],"phonetic":"/ˌrɛkwəˈzɪʃənɚ/","extraExplanation":["“requisitioner”来自动词“requisition”（正式征用/调拨；正式申请领用）。在采购流程里，requisition 是“申购单/领用申请”，requisitioner 通常指发起这张单的人（提出需求的人），而不是实际下订单的采购员（buyer/purchaser）。","常见搭配：requisitioner name（申购人姓名）、requisitioner department（申购部门）、requisitioner approval（申购人审批）、submit as requisitioner（以申购人身份提交）。"]}
{"word":"requisitioners","summary":{"en":"Requisitioners are people who officially request or demand supplies, funds, or documents.","zh":"Requisitioners指正式提出申请或要求物资、资金或文件的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who officially request or demand something, especially supplies, money, or documents (often in a work, military, or government context).","zh":"（通常在工作、军队或政府等场景中）正式提出申请或要求某物的人，尤指物资、资金或文件。"},"examples":[{"en":"The requisitioners submitted a request for new laptops for the team.","zh":"申请人提交了为团队购买新笔记本电脑的申请。"},{"en":"During the emergency, requisitioners asked for food and medical supplies.","zh":"在紧急情况下，申请人要求提供食物和医疗物资。"}]}],"synonyms":["requesters","applicants","claimants","petitioners"],"phonetic":"/ˌrɛkwəˈzɪʃənərz/","extraExplanation":["“Requisitioners”是名词复数，单数是requisitioner，来自动词requisition（正式征用/调拨/申请）。这个词常见于较正式的书面语，如采购流程、军队后勤、政府部门的物资调配。","在商业或行政语境中，requisition通常指“采购申请单/领用申请”，因此requisitioner可指提出该申请的人；更日常的说法往往用requester（请求者）或applicant（申请者）。"]}
{"word":"requisitioning","summary":{"en":"Requisitioning means officially demanding, taking, or allocating supplies/property/services, often for public or military needs.","zh":"Requisitioning 指为公共或军事等需要而正式要求提供、征用或调拨物资/财产/服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of officially demanding or taking supplies, property, or services (often by a government, organization, or the military)","zh":"（常指政府、机构或军队）依法或正式征用/调拨物资、财产或服务的行为"},"examples":[{"en":"During the emergency, the city began requisitioning buses to evacuate residents.","zh":"在紧急情况下，市政府开始征用公交车来疏散居民。"},{"en":"Requisitioning food without clear rules can cause conflict with local communities.","zh":"在缺乏明确规则的情况下征用食物，可能会与当地社区产生冲突。"}]},{"partOfSpeech":"v.","definition":{"en":"officially demanding or taking something for use, especially for public or military needs","zh":"（尤指出于公共或军事需要）正式要求提供或征用某物"},"examples":[{"en":"The army is requisitioning vehicles for disaster relief.","zh":"军方正在征用车辆用于救灾。"},{"en":"The hospital was requisitioning extra beds during the outbreak.","zh":"疫情暴发期间，医院在调拨额外的病床。"}]}],"synonyms":["commandeering","seizing","appropriating","drafting","claiming"],"phonetic":"/ˌrɛkwəˈzɪʃənɪŋ/","extraExplanation":["“requisitioning”常见于正式语境（政府、军队、机构）。它通常带有“有权力或依法要求/征用”的意味，比普通的“borrowing（借用）”更强势，也比“ordering（订购/下单）”更偏向“动用资源”。","名词“a requisition”也可指“正式的领用/请领单、申请单”（如公司内部领料单）。在这种语境里更接近“申领、请领”，不一定涉及强制征用。"]}
{"word":"requisitionist","summary":{"en":"A requisitionist is a person who officially requests and arranges supplies for an organization, often in purchasing or logistics.","zh":"requisitionist 指用正式请购/申领流程为机构申请并安排物资的人，常见于采购或后勤岗位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to request, order, or obtain supplies (especially for an organization or the government) by using official request forms (requisitions).","zh":"（尤指为机构或政府）负责用正式“请购/申领单”（requisition）申请、订购或调配物资的人。"},"examples":[{"en":"During the emergency, the requisitionist arranged food and medical supplies for the shelters.","zh":"在紧急情况下，这名物资申领员为避难所安排了食物和医疗用品。"},{"en":"If you need new laptops, submit the form to the requisitionist in the purchasing office.","zh":"如果你需要新笔记本电脑，把表格交给采购办公室的请购员。"}]}],"synonyms":["procurement officer","purchasing agent","supply officer","buyer"],"phonetic":"/ˌrɛkwəˈzɪʃənɪst/","extraExplanation":["这个词相对少见，更常见的说法是 purchaser（采购员）, procurement officer（采购专员）, or supply officer（军需/物资官）。","词根来自 requisition（请购/征用；请购单）。在历史语境中，尤其在战争或灾害时期，requisition 也可指“征用民间物资”，因此 requisitionist 有时会出现在军事、政府后勤的叙述里。"]}
{"word":"requisitions","summary":{"en":"Requisitions are official requests/orders for supplies, or official acts of taking goods for public or military use.","zh":"requisitions 指（1）正式的物资/服务申请单、调拨令；或（2）官方为公共或军事用途进行的征用行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Official requests or orders for something, especially in workplaces, government, or the military.","zh":"（复数名词）正式的申请/需求单/调拨令；尤指在公司、政府或军队中提出的物资或服务需求。"},"examples":[{"en":"Please submit all supply requisitions by Friday.","zh":"请在周五前提交所有物资需求单。"},{"en":"The manager approved the requisitions for new laptops.","zh":"经理批准了购买新笔记本电脑的申请单。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Acts of officially taking or demanding property, equipment, or services for public or military use.","zh":"（复数名词）征用；（官方）为公共或军事用途而征收/调拨财物、设备或服务的行为。"},"examples":[{"en":"During the emergency, there were requisitions of trucks and fuel.","zh":"在紧急情况下，发生了对卡车和燃料的征用。"},{"en":"The historical records mention wartime requisitions of food.","zh":"历史记录提到战时对食品的征用。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb form) To officially request, require, or take something for a particular purpose.","zh":"（动词）正式要求/调拨；（尤指官方）征用某物以用于特定目的。"},"examples":[{"en":"The hospital may requisition extra beds during a crisis.","zh":"危机期间医院可能会调拨额外的病床。"},{"en":"The army requisitioned local vehicles.","zh":"军队征用了当地车辆。"}]}],"synonyms":["requests","orders","purchase requests","demands","appropriations","seizures"],"phonetic":"/ˌrɛkwəˈzɪʃənz/","extraExplanation":["“requisition”常见于较正式的语境：公司采购、政府行政流程、军队后勤等。作为名词时常指“需求单/领用单”，在采购系统里通常需要审批（approve a requisition）。","历史与文学/史料语境中，“requisition”也常指战争或紧急时期的“征用”，带有一定强制性；语气往往比一般的“request（请求）”更“官方、更有权力”。"]}
{"word":"requisitor","summary":{"en":"A requisitor is someone who makes a formal request, especially in official or legal situations.","zh":"requisitor 指提出正式请求的人，尤用于官方或法律场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes a formal request or demand (often in official or legal contexts).","zh":"提出正式请求或要求的人（常见于官方或法律语境）。"},"examples":[{"en":"The requisitor filed a written request for copies of the contract.","zh":"申请人提交了书面请求，索要合同副本。"},{"en":"In the hearing, the requisitor argued that the documents were necessary for the investigation.","zh":"在听证会上，请求人主张这些文件对调查是必要的。"}]}],"synonyms":["requester","applicant","petitioner","claimant","requisitioner"],"phonetic":"/rɪˈkwɪzɪtər/","extraExplanation":["“requisitor”比较少见，更多时候人们会用 requester / applicant / petitioner（请愿人）来表达“请求的人”。","它源自“requisition”（正式申请、征用等）。在某些法律或行政文本中，“requisitor”可指发出requisition的一方。不同领域里也可能见到更常用的“requisitioner”。"]}
{"word":"requisitorial","summary":{"en":"Requisitorial describes an authority-led, judge-driven style of investigation, especially in law.","zh":"requisitorial 指由权威（常为法官）主动主导调查与讯问的方式，尤用于法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to an official investigation, especially one led by a judge or authority who actively questions people and gathers evidence (often in a legal context).","zh":"与（官方）调查有关的；尤指由法官或当局主动讯问、主动收集证据的调查方式（常用于法律语境）。"},"examples":[{"en":"Some legal systems use a more requisitorial approach, where the judge plays an active role in investigating the facts.","zh":"一些法制体系更偏向“职权调查式”，法官会主动介入调查事实。"},{"en":"The report criticized the hearing for its requisitorial tone, with officials questioning witnesses aggressively.","zh":"该报告批评听证会带有“审讯式”的语气，官员对证人提问很强势。"}]}],"synonyms":["inquisitorial","investigative","interrogative"],"phonetic":"/ˌrɛ.kwəˈzɪ.tɔr.i.əl/","extraExplanation":["“requisitorial”常用来对比“accusatorial/adversarial（对抗式）”。在对抗式程序中，控辩双方主导举证与质证，法官更像裁判；而在职权调查式（requisitorial/inquisitorial）中，法官/调查机关更主动推进调查与讯问。","这个词较正式、偏学术或法律新闻写作；日常英语里更常见的近义表达有“investigative（调查性的）”“interrogative（讯问式的）”，但它们不一定包含“由权威主导调查”的法律含义。"]}
{"word":"requisitory","summary":{"en":"Requisitory means “required/necessary” or, less commonly, “related to a requisition.” It’s a formal, rare word today.","zh":"requisitory 表示“必须的/必要的”，或较少见地表示“与征用/调拨/申领（requisition）有关的”。如今较正式且少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"required; necessary (formal, rare).","zh":"必须的；必要的（正式用语，较少见）。"},"examples":[{"en":"ID is requisitory for entry to the building.","zh":"进入这栋楼必须出示身份证件。"},{"en":"They completed the requisitory paperwork before the trip.","zh":"出发前他们完成了必要的文件手续。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to a requisition (an official request or taking of supplies).","zh":"与“征用/调拨/正式申请（requisition）”有关的。"},"examples":[{"en":"The army issued requisitory orders for additional equipment.","zh":"军方下达了征用额外装备的命令。"},{"en":"Requisitory forms must be signed by a manager.","zh":"调拨/申领表格必须由经理签字。"}]}],"synonyms":["required","necessary","essential","mandatory","requisite"],"phonetic":"/rɪˈkwɪzəˌtɔri/","extraExplanation":["“requisitory”在现代英语里非常少见，更常用的是“required / necessary / essential”，或名词“requisite”（必要条件）与形容词“requisite”（必需的）。","它也可能让人联想到“requisition”（官方征用/调拨/申领）。如果你的语境是“必须的”，用“required/necessary”更自然；如果是“调拨/申领”，用“requisition (n.) / requisition (v.)”更常见。"]}
{"word":"requisitus","summary":{"en":"Requisitus is a rare Latin form meaning “required/requested,” usually replaced by modern English words like requisite or required.","zh":"Requisitus 是罕见的拉丁语形式，意为“被要求/被请求的”，现代英语通常用 requisite 或 required 等替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, Latin) “required; requested; sought after.” Often seen as a Latin form in older legal, academic, or church writing rather than in everyday English.","zh":"（罕见；拉丁语）“被要求的；被请求的；被寻找的”。多见于较旧的法律、学术或教会文献中的拉丁形式，而非日常英语。"},"examples":[{"en":"The document used the Latin word requisitus to mean “required.”","zh":"该文件用拉丁词 requisitus 表示“必须的/被要求的”。"},{"en":"In older records, requisitus sometimes appears where modern English would say requisite or required.","zh":"在较旧的记录中，requisitus 有时出现于现代英语会写 requisite 或 required 的位置。"}]}],"synonyms":["required","requested","requisite","needed"],"phonetic":"/ˌrɛkwəˈsɪtəs/","extraExplanation":["requisitus 是拉丁动词 requirere（寻找、要求、请求）的过去分词形式之一，意思相当于英语 required / requested。","在英语语境里它非常少见，更多是“引用拉丁语”的写法；一般写作中建议用 requisite（必需的）、required（被要求的）、requested（被请求的）。","相关词：requisite（必需条件/必需的），requisition（正式征用/调拨；正式请求）。"]}
{"word":"requit","summary":{"en":"Requit means to repay or return something—often kindness or harm—(formal/literary), and can also mean to leave (rare).","zh":"Requit 指“回报/回敬（善意或伤害）”（较正式/文学用语），也可指“离开”（较少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to repay or return (something), often in response to an action—especially by giving something similar back (kindness or harm).","zh":"回报；报答；（尤指）以同样方式回应（善意或伤害）。"},"examples":[{"en":"She worked hard to requit her parents’ sacrifices.","zh":"她努力工作来报答父母的牺牲。"},{"en":"He was determined to requit the insult with an even sharper remark.","zh":"他决心用更尖刻的话回敬那句侮辱。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reward or compensate someone for effort or service (formal/literary).","zh":"酬谢；酬报（较正式/文学用语）。"},"examples":[{"en":"The company promised to requit employees for overtime hours.","zh":"公司承诺会为员工的加班时间给予补偿。"}]},{"partOfSpeech":"v.","definition":{"en":"to leave or depart from a place; to quit (now rare/old-fashioned).","zh":"离开；退出（现较少见/偏古旧）。"},"examples":[{"en":"After the ceremony, the guests requited the hall in silence.","zh":"仪式结束后，宾客们安静地离开了大厅。"}]}],"synonyms":["repay","return","pay back","reward","recompense","retaliate (in negative contexts)"],"phonetic":"/rɪˈkwɪt/","extraExplanation":["“requit”语体偏正式，常见于文学或较庄重的表达中；日常英语里更常用 repay / return / pay back / reward。","词源上与“quit（离开/退出）”同源，因此它的一个较古老含义就是“离开”。现代最常用的含义是“回报/回敬”。","文学与固定搭配里常见：requit someone’s kindness（报答某人的好意）；requit love（回报爱情，较文学化）；requit an insult（回敬侮辱）。注意：requite 是更常见的拼写变体，尤其在“报答/回报”义上更常见。"]}
{"word":"requitable","summary":{"en":"Requitable means “capable of being repaid or reciprocated.”","zh":"requitable 指“可以被回报/得到回应的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a feeling, action, or kindness) able to be repaid, returned, or matched; capable of being requited (reciprocated).","zh":"（指感情、行为或善意）可以回报的；可以得到回应/报答的。"},"examples":[{"en":"Her generosity felt requitable, so I looked for a way to return the favor.","zh":"她的慷慨让我觉得是可以回报的，所以我想办法回她一个人情。"},{"en":"He hoped his affection was requitable, not one-sided.","zh":"他希望自己的爱意是能得到回应的，而不是单相思。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to repay someone; willing or likely to give an appropriate return.","zh":"有能力回报他人的；愿意或可能给予相称回报的。"},"examples":[{"en":"She is deeply thankful and requitable to those who helped her.","zh":"她非常感恩，也会回报那些帮助过她的人。"}]}],"synonyms":["reciprocable","returnable","repayable","requitable (rare)","capable of being reciprocated"],"phonetic":"/ˈrɛkwɪtəbəl/","extraExplanation":["这个词在现代英语里很少见，更常用的是 requite（回报/报答）以及可替换的词：reciprocate（互相回应）、return（回报）、repay（偿还）。\n词源上 re-（回、再）+ quite（古义与“偿清、回报”相关），所以核心概念是“把情意/恩惠/伤害‘回’过去”。","requitable 多用于书面语或较文学化的语境，常见搭配是 requitable affection（可回应的爱）、requitable kindness（可回报的善意）。"]}
{"word":"requital","summary":{"en":"Requital means a return for something received, especially repayment or (sometimes) revenge/retribution.","zh":"Requital 指对所受之事的回报，尤指偿还、报偿；有时也指报复/报应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A return for something received—often repayment, compensation, or (in a negative sense) revenge.","zh":"对所受之事的回报——常指偿还、报偿；在负面语境中也可指报复。"},"examples":[{"en":"She cared for him for years, but her kindness met with little requital.","zh":"她照顾他多年，但她的善意几乎没有得到回报。"},{"en":"He saw the punishment as requital for the harm he had caused.","zh":"他把惩罚看作对自己造成伤害的报应（或偿还）。"},{"en":"In tragedies, betrayal often brings swift requital.","zh":"在悲剧作品中，背叛常常很快招致报应。"}]}],"synonyms":["repayment","return","recompense","payback","retribution"],"phonetic":"/rɪˈkwaɪtəl/","extraExplanation":["“requital”较偏正式、文学化，比常见的“repayment / return / payback”更书面。日常英语里多用“repay / reward / payback”。","这个词常带有“道德因果”的色彩：好事得回报、坏事得报应；其中负面含义时可接近“retribution（惩罚性报应）”，但“requital”不一定强调惩罚，也可以是中性的“回报/回馈”。","搭配提示：常见结构有“in requital (for ...)”（作为对……的回报）、“meet with little/no requital”（几乎没有得到回报）。"]}
{"word":"requitals","summary":{"en":"Requitals are returns or paybacks for something done—either repayment of kindness or retaliation for harm.","zh":"Requitals 指对某事的回报或回敬：可以是报偿善意，也可以是对伤害的报复。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: requitals) something done in return—repayment, compensation, or payback for an action (good or bad).","zh":"（常用复数：requitals）回报；报偿；（对某种行为的）回敬/报复。"},"examples":[{"en":"She helped him for years, but her kindness received little requital.","zh":"她帮了他多年，但她的善意几乎没有得到回报。"},{"en":"He feared requital for his harsh words.","zh":"他担心自己刻薄的话会招来回敬。"}]}],"synonyms":["repayment","recompense","return","payback","retaliation"],"phonetic":"/rɪˈkwaɪtəl/","extraExplanation":["“requital”来自动词“requite”，意思是“回报、报偿”。在现代英语里它偏书面、带文学或正式语气；日常对“正面回报”更常说“reward / return”，对“报复”更常说“revenge / retaliation”。","注意拼写：你写的“requitals”如果本意是学校或音乐会的“独奏/朗诵会”，常见词是“recitals”（发音和意思都不同）。"]}
{"word":"requitative","summary":{"en":"Requitative is a rare adjective meaning “repaying or responding in return,” often implying reward or revenge.","zh":"Requitative 是较少见的形容词，意思是“以回报的方式回应”，常含“报答”或“报复”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"describing something that repays, returns, or responds to an action (especially by giving a reward, returning kindness, or taking revenge); retaliatory or reciprocating","zh":"描述对某种行为进行回报、回馈或回应的（尤其是回报善意、报答恩情，或报复）；报偿性的／报复性的／互惠的"},"examples":[{"en":"She offered requitative help after he supported her during a difficult time.","zh":"在他困难时期支持过她之后，她提供了报答性的帮助。"},{"en":"The novel ends with a requitative act of revenge.","zh":"这部小说以一次报复性的复仇行为收尾。"}]}],"synonyms":["reciprocal","retaliatory","retributive","repaying"],"phonetic":"/rɪˈkwaɪtətɪv/","extraExplanation":["“requitative”在现代英语中非常少见，多见于旧式或文学性写作。更常用的表达包括：reciprocal（互惠的）、retaliatory（报复性的）、retributive（惩罚/报应性的）、repaying（回报的）。","它源自动词“requite”（回报、报答、报复）。常见名词是“requital”（回报；报复），例如：an act of requital（报复/回报的行为）。"]}
{"word":"requite","summary":{"en":"Requite means to repay or return something—especially kindness, harm, or love—in response to what you received.","zh":"Requite 指“回报/偿还”，可用于报答恩情、回敬伤害或回应爱意，语体较书面、文学化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give something back in return for a favor, help, or kindness; to repay","zh":"回报（恩惠、帮助或好意）；报答"},"examples":[{"en":"I don’t know how to requite your kindness.","zh":"我不知道该如何报答你的好意。"},{"en":"She tried to requite his help by supporting his project.","zh":"她试着通过支持他的项目来回报他的帮助。"},{"en":"They invited us to dinner to requite our hospitality.","zh":"他们请我们吃晚饭，以回报我们的款待。"}]},{"partOfSpeech":"vt.","definition":{"en":"to repay (often harm or injury) with an action; to return in kind","zh":"报复；以同样方式回敬（常指伤害或恶行）"},"examples":[{"en":"He vowed to requite the insult.","zh":"他发誓要回敬那次侮辱。"},{"en":"In old stories, heroes often requite evil with justice.","zh":"在古老故事里，英雄常以正义回击邪恶。"}]},{"partOfSpeech":"vt.","definition":{"en":"to return or respond to someone’s love or feelings; to love in return","zh":"回报（爱意）；回应感情；以爱相报"},"examples":[{"en":"She wished he would requite her love.","zh":"她希望他能回应她的爱。"},{"en":"His feelings were deep, but they were not requited.","zh":"他的感情很深，但没有得到回应。"}]}],"synonyms":["repay","return","reciprocate","reward","pay back","avenge"],"phonetic":"/rɪˈkwaɪt/","extraExplanation":["“requite”在现代英语中偏书面、文学化，比“repay / return”更正式，常见搭配有“requite someone for something”（因某事报答某人）和“requite someone with something”（以某物回报某人）。","常见相关表达：不常用但很地道的被动形式“be requited”（得到回报/回应），尤其用于“love/feelings”。"]}
{"word":"requited","summary":{"en":"Requited means a feeling—especially love—has been returned; it can also mean to repay or return kindness.","zh":"requited指感情（尤其爱情）得到了回应；也可表示回报、报答他人的善意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a feeling, especially love) returned in the same way by another person.","zh":"（尤指爱情等感情）得到对方回应的、被回报的。"},"examples":[{"en":"Her love was finally requited, and they started dating.","zh":"她的爱终于得到了回应，他们开始交往了。"},{"en":"He feared his feelings would never be requited.","zh":"他害怕自己的感情永远得不到回应。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give something back or to respond to a feeling or action in a suitable way (often used in formal writing).","zh":"回报；报答；以适当方式回应（常见于较正式的语境）。"},"examples":[{"en":"She tried to requite his kindness with a thoughtful gift.","zh":"她想用一份贴心的礼物来回报他的善意。"},{"en":"They believed good deeds would be requited in time.","zh":"他们相信善行终会得到回报。"}]}],"synonyms":["returned","reciprocated","repaid","rewarded"],"phonetic":"/rɪˈkwaɪtɪd/","extraExplanation":["“requited”最常见的固定搭配是“requited love”（两情相悦/被回应的爱），对应的常用反义表达是“unrequited love”（单相思/得不到回应的爱）。","词源上与“quit（偿清、清偿）”同源，核心感觉是“把欠的还回去”，因此既可指“回报恩情”，也可指“回应爱意”。","在文学与诗歌中常用来写爱情的“回应/不回应”，语气往往较书面、带一点浪漫或悲剧色彩。"]}
{"word":"requiteful","summary":{"en":"Requiteful means grateful and appreciative, often implying a wish to repay kindness.","zh":"Requiteful 指“感激的、感恩的”，常含“想回报恩情”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling or showing gratitude; thankful and appreciative (often with the sense of wanting to repay kindness).","zh":"感激的；感恩的；心怀谢意的（常带有“想回报恩情”的意味）。"},"examples":[{"en":"I’m deeply requiteful for your help during my first week at work.","zh":"我非常感激你在我工作第一周给予的帮助。"},{"en":"She wrote a requiteful note to the neighbors who brought food after the storm.","zh":"她给暴风雨后送来食物的邻居写了一张表达感激的便条。"}]}],"synonyms":["grateful","thankful","appreciative","obliged"],"phonetic":"/rɪˈkwaɪtfəl/","extraExplanation":["“requiteful”来自动词“requite”（回报、报答）。因此它的语气通常比“grateful”更强调“受恩想报”的感觉。不过在现代英语里，“requiteful”较少见，日常更常用“grateful / thankful / appreciative”。","文学或较正式的语境里可能会看到它，用来营造较古典、书面化的表达风格。"]}
{"word":"requiteless","summary":{"en":"Requiteless means not repaid or rewarded—given or felt without return.","zh":"requiteless 表示“没有回报的；未获报偿的”，多见于文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not repaid, rewarded, or returned; without requital.","zh":"未获回报的；没有得到报偿/回报的。"},"examples":[{"en":"She gave requiteless help to strangers during the storm.","zh":"暴风雨期间，她无偿地帮助了陌生人。"},{"en":"His requiteless love made the poem feel quietly sad.","zh":"他得不到回报的爱让这首诗带着淡淡的忧伤。"}]}],"synonyms":["unrequited","unrewarded","unreturned"],"phonetic":"/rɪˈkwaɪtləs/","extraExplanation":["“Requiteless”比较少见，偏文学/诗歌用法，意思接近“unrequited（得不到回报的）”“unrewarded（未获酬谢的）”。","构词上可理解为：requite（报答、回报）+ -less（没有……的），即“没有回报/报答的”。"]}
{"word":"requitement","summary":{"en":"A requirement is something you must have or do; a necessary condition.","zh":"requirement 指你必须具备或必须做到的事；必要条件或要求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is needed or demanded; a rule or condition you must meet.","zh":"要求；必备条件；（必须满足的）规定或条件。"},"examples":[{"en":"A valid passport is a requirement for international travel.","zh":"有效护照是国际旅行的必备条件。"},{"en":"One requirement for the job is strong communication skills.","zh":"这份工作的一个要求是良好的沟通能力。"},{"en":"Students must meet the graduation requirements.","zh":"学生必须满足毕业要求。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of needing something or making something necessary.","zh":"需要；要求（某事变得必要的行为或过程）。"},"examples":[{"en":"The requirement of safety checks slowed the process.","zh":"安全检查的要求让流程变慢了。"},{"en":"There is a legal requirement to report the accident.","zh":"法律要求必须报告这起事故。"}]}],"synonyms":["condition","necessity","prerequisite","qualification","rule"],"phonetic":"/rɪˈkwaɪɚmənt/","extraExplanation":["你写的“requitement”通常是拼写错误；正确拼写是 **requirement**（常见）。","发音与拼写小提示：requirement 来自 require（需要/要求）+ -ment（名词后缀），中间有 **-ire-**，容易漏写或写成 -it-。"]}
{"word":"requiter","summary":{"en":"A rare word meaning someone who repays or returns something (a favor or an injury).","zh":"一个较少见的词，指“回报/报复的人”（回馈恩惠或伤害）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who requites something (pays back, returns a favor or an injury); someone who gives something in return","zh":"报答者；回报者（回馈恩惠或报复伤害的人）"},"examples":[{"en":"He wanted to be a requiter of kindness, not someone who only received help.","zh":"他想成为一个回报善意的人，而不是只接受帮助的人。"},{"en":"In old stories, the hero is often a requiter of debts—good or bad.","zh":"在一些古老故事里，英雄常常是“偿还恩债”的人——不论好坏。"}]}],"synonyms":["repayer","avenger","one who returns a favor"],"phonetic":"rɪˈkwaɪtər","extraExplanation":["“requiter”在现代英语里非常少见，更常见的动词是“requite”（回报、报答、报复）。日常表达里，人们通常会说“return a favor / repay someone / pay someone back”。","很多学习者把“requiter”误写成“recruiter”（招聘者、招募人员）。如果你想表达“招聘人员”，正确拼写是“recruiter”。"]}
{"word":"requiters","summary":{"en":"A recruiter is someone who finds and hires people for jobs (or recruits people for an organization).","zh":"recruiter 指负责招聘/招募人员的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to find and hire people for jobs (or to sign people up for an organization, such as the military).","zh":"招聘者；招募人员（负责为公司找人并录用，或为组织如军队招募成员的人）。"},"examples":[{"en":"A recruiter contacted me on LinkedIn about a new role.","zh":"一位招聘人员在领英上联系我，介绍一个新职位。"},{"en":"The recruiter scheduled my first interview for next week.","zh":"招聘人员把我的第一轮面试安排在下周。"},{"en":"A military recruiter visited our school to talk about service options.","zh":"一位军队招募官来我们学校介绍服役选择。"}]}],"synonyms":["hiring manager","talent scout","headhunter","staffing specialist","talent acquisition specialist"],"phonetic":"/rɪˈkruːtər/","extraExplanation":["你输入的“requiters”很可能是拼写错误，更常见的正确拼写是“recruiters”（recruiter 的复数）。","recruiter（单数）→ recruiters（复数）。发音基本不变，只是复数在结尾加 /z/ 或 /s/ 的感觉。"]}
{"word":"requites","summary":{"en":"“Requite” means to repay a kindness or to return someone’s feelings (often love). “Requites” is the third-person singular form.","zh":"“requite”意为“回报恩惠”或“回应感情（常指爱情）”；“requites”是其第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to repay or return (a kindness, service, or help); to reward or pay back","zh":"回报；报答（恩惠、帮助、服务等）"},"examples":[{"en":"She always requites kindness with kindness.","zh":"她总是以善报善。"},{"en":"They helped him for years, and he finally requited their support.","zh":"他们帮助了他多年，他终于回报了他们的支持。"}]},{"partOfSpeech":"vt.","definition":{"en":"to return (a feeling), especially love or affection","zh":"回应（感情），尤指回馈爱意或好感"},"examples":[{"en":"He loved her deeply, but she didn’t requite his feelings.","zh":"他深深地爱着她，但她没有回应他的感情。"},{"en":"I hope you’ll requite my trust with honesty.","zh":"我希望你能以诚实来回报我的信任。"}]}],"synonyms":["repay","return","reward","pay back","reciprocate"],"phonetic":"/rɪˈkwaɪt/","extraExplanation":["“requites”是动词“requite”的第三人称单数形式（he/she/it requites）。","这个词语气偏正式、偏书面，常见搭配有：requite kindness（报答恩情）、requite love（回报/回应爱）。在日常口语里更常用“repay / return”。"]}
{"word":"requiting","summary":{"en":"“Requiting” means returning or repaying a feeling or action (often love or kindness), in a formal/literary tone.","zh":"“requiting”指回报或回应某种感情或行为（常指爱或善意），语气较正式/文学化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"returning a feeling (especially love) or responding to something in the same way.","zh":"回报（感情，尤指爱）；以同样方式回应。"},"examples":[{"en":"He hoped she was requiting his love.","zh":"他希望她能回应他的爱。"},{"en":"She smiled back, requiting his kindness.","zh":"她也回以微笑，回应他的善意。"}]},{"partOfSpeech":"vt.","definition":{"en":"repaying someone for a help, service, or injury (often used in formal or literary writing).","zh":"报答（恩情、帮助）；报复（伤害）（多用于正式或文学语境）。"},"examples":[{"en":"They worked hard, requiting the trust their teacher placed in them.","zh":"他们努力学习，以回报老师对他们的信任。"},{"en":"In old stories, heroes are described as requiting a wrong.","zh":"在古老故事里，英雄常被描述为“报复冤屈”。"}]}],"synonyms":["reciprocating","returning","repaying","requiting (formal)","answering (literary)"],"phonetic":"/rɪˈkwaɪtɪŋ/","extraExplanation":["“requiting”来自动词 requite 的现在分词/动名词形式，语气偏正式、偏文学。日常口语更常用 return (someone’s love), reciprocate, repay。","常见搭配：requite someone’s love / kindness / trust；也可见于诗歌或小说里表达“爱而得不到回应”（unrequited love = 单相思/无回应的爱）。"]}
{"word":"requiz","summary":{"en":"“Requiz” is an informal, uncommon word meaning to quiz again or a repeat/make-up quiz.","zh":"“requiz”是较少见的非正式用词，表示“再测验/补测”，也可指“一次重复的小测验”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, not widely used) to quiz someone again; to give a quiz a second time.","zh":"（非正式用法，较少见）再测验；对某人再提问；把测验再进行一次。"},"examples":[{"en":"The teacher decided to requiz the class after reviewing the material.","zh":"老师复习完内容后，决定再给全班测验一次。"},{"en":"If you missed the first quiz, we can requiz you next week.","zh":"如果你错过了第一次小测，我们下周可以再给你补测一次。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a noun, informal) a second quiz; a repeat quiz.","zh":"（作名词，非正式）补测；重做的小测验。"},"examples":[{"en":"There will be a requiz on Friday for students who were absent.","zh":"周五会有一次补测，给缺席的学生参加。"}]}],"synonyms":["quiz again","retest","give a make-up quiz","retake (a quiz)"],"phonetic":"/ˌriːˈkwɪz/","extraExplanation":["“re-”是英语里常见的前缀，表示“再一次/重新”。因此从构词上说 *re-quiz*（也可写作 *requiz*）很容易理解，但在真实写作中并不常见。更自然的表达通常是：**quiz again**, **give a make-up quiz**, **retake the quiz**。","如果你在学校/课堂语境里想表达“补测”，美式英语更常用 **make-up quiz**。"]}
{"word":"requotation","summary":{"en":"Requotation means quoting again, or in trading, being given a new price after the original quote changes.","zh":"Requotation 指“再次引用/重复引用”，也可指交易中因原报价变化而出现的“重新报价”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of quoting something again; a repeated quotation","zh":"再次引用；重复引用（某段话或文字）"},"examples":[{"en":"The essay included a requotation from the novel to support the main argument.","zh":"这篇文章再次引用了小说中的一句话来支持中心论点。"},{"en":"Please avoid unnecessary requotation and explain the idea in your own words.","zh":"请避免不必要的重复引用，并用自己的话解释观点。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance/trading) a new price quote given after the original quote cannot be honored","zh":"（金融/交易）重新报价；原报价无法成交时给出的新报价"},"examples":[{"en":"Because the market moved quickly, the platform sent a requotation with a different price.","zh":"由于市场波动很快，平台发来了一个不同价格的重新报价。"},{"en":"Traders may reject a requotation if the new price is worse than expected.","zh":"如果新价格比预期更差，交易者可能会拒绝重新报价。"}]}],"synonyms":["re-quote","re-quoting","repeated quotation","requote","new quote"],"phonetic":"/ˌriːkwoʊˈteɪʃən/","extraExplanation":["在一般写作语境里，requotation 比较少见，更常用的是 repeat the quotation / quote again，或用名词 repeated quotation。","在外汇、差价合约（CFD）等快速变动市场中，requote/requotation 常见：当你下单时原来的报价已经变化，平台会“重新给价”，你可以接受或拒绝。"]}
{"word":"requote","summary":{"en":"Requote means to quote something again, or (in business) to provide an updated price quote.","zh":"Requote 指再次引用，或（在商业中）重新/更新报价。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to quote again; to repeat the exact words or a passage from a source.","zh":"再次引用；重新引述（某人的原话或某段文字）。"},"examples":[{"en":"In her new article, she requoted the same line from the novel to support her argument.","zh":"在她的新文章里，她再次引用了小说中的同一句话来支持观点。"},{"en":"Please requote the author accurately, including the full sentence.","zh":"请准确地重新引用作者的话，包括完整句子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(business/finance) to give a new quote or updated price, often after conditions change.","zh":"（商业/金融）重新报价；在条件变化后给出更新的价格/报价。"},"examples":[{"en":"Because material costs went up, the supplier had to requote the project.","zh":"由于材料成本上涨，供应商不得不对该项目重新报价。"},{"en":"The insurer will requote your premium if you change your coverage.","zh":"如果你更改保障范围，保险公司会重新给你的保费报价。"},{"en":"The travel agent requoted the flights after the airline changed its fees.","zh":"航空公司调整费用后，旅行代理重新报了机票价格。"}]}],"synonyms":["quote again","re-quote","repeat","cite again","revise a quote","reprice"],"phonetic":"/ˌriˈkwoʊt/","extraExplanation":["“requote”在商务英语里很常见，尤其出现在报价单（quote/quotation/estimate）场景：当数量、规格、汇率、材料成本、有效期等变化时，就需要“requote”。","日常写作中也可表示“再次引用”，但更常见的表达是“quote again / re-quote / cite again”；在正式文件中用“requote”会更简洁。"]}
{"word":"requoted","summary":{"en":"“Requoted” means “quoted again,” especially a price that is offered again (often changed), and in trading it refers to receiving a new price because the original quote can’t be filled.","zh":"“requoted”指“再次报价/重新引用”，常用于价格被调整后重新报出；在交易中指原报价无法成交而给出新的报价。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"quoted again; repeated a quotation or price (often after changing it).","zh":"再次报价；重新引用（某句话或某个价格，常指在调整后再报）。"},"examples":[{"en":"The article requoted a line from the novel to support its point.","zh":"这篇文章再次引用了小说中的一句话来支持它的观点。"},{"en":"The seller requoted the price after I asked about shipping.","zh":"我问了运费后，卖家重新报了价格。"}]},{"partOfSpeech":"v.","definition":{"en":"(Finance/Trading) given a new quoted price after an earlier quote could not be filled at that price.","zh":"（金融/交易）因原报价无法成交而被重新报价（给出新的成交价）。"},"examples":[{"en":"My market order was requoted during the high-volatility news event.","zh":"在新闻引发的高波动时段，我的市价单被重新报价了。"},{"en":"If your trade is requoted, you can accept the new price or cancel.","zh":"如果你的交易被重新报价，你可以接受新价格或取消。"}]}],"synonyms":["quoted again","repeated","re-cited","repriced","re-quoted"],"phonetic":"/ˌriˈkwoʊtɪd/","extraExplanation":["“requote / requoted”在外汇、差价合约等快速变动的市场里很常见：当你点下单时，屏幕上的价格可能已经变化，平台就会“重新报价”。这并不一定表示错误，但通常与流动性不足、波动剧烈或执行机制有关。不同平台对是否允许 requote（以及滑点/拒单规则）可能不同，阅读交易条款会更清楚。"]}
{"word":"requoting","summary":{"en":"Requoting means quoting again, or (in finance) offering a new price quote when the original one is no longer available.","zh":"Requoting 指“再次引用”；在金融语境中也指“原报价不可用时重新给出报价”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of quoting something again (for example, repeating a sentence, line, or passage), often to clarify, correct, or emphasize","zh":"再次引用（某句话、句子或段落），常用于澄清、纠正或强调"},"examples":[{"en":"In the revised article, the journalist is requoting the witness to correct an earlier mistake.","zh":"在修订后的报道中，记者再次引用证人的话来纠正先前的错误。"},{"en":"Try requoting the key sentence so your reader remembers the main point.","zh":"试着再次引用关键句，让读者记住要点。"}]},{"partOfSpeech":"v.","definition":{"en":"in trading/finance, the act of giving a new quote (a new price) after the original price is no longer available","zh":"（金融/交易）重新报价：在原报价已不可成交时给出新的价格"},"examples":[{"en":"The broker kept requoting because the market was moving fast.","zh":"由于市场波动很快，经纪商不断重新报价。"},{"en":"If you see requoting on the platform, check your slippage settings or execution method.","zh":"如果你在平台上看到“重新报价”，检查你的滑点设置或成交方式。"}]}],"synonyms":["quoting again","re-citing","repeating a quote","re-pricing (finance)"],"phonetic":"/ˌriˈkwoʊtɪŋ/","extraExplanation":["“re-”表示“再次”，加在“quote（引用/报价）”前面形成“requote”。在写作里多指“再次引用”；在外汇/差价合约等交易语境里，“requote”常见于平台提示，意思是原价格无法成交，系统/经纪商给出新价格，交易者需要接受或拒绝。"]}

