{"word":"rerack","summary":{"en":"Rerack means to put something back on a rack, especially returning gym weights, or to reorganize items on a rack again.","zh":"Rerack 指把东西放回架子上（最常见是健身房把重量片/杠铃归位），也可指把架子上的物品重新整理上架。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to put something back onto a rack after using it (especially weights in a gym).","zh":"（尤指健身房）用完后把东西放回架子上；把重量片/杠铃归位。"},"examples":[{"en":"Please rerack your weights when you finish your set.","zh":"做完一组后请把重量片放回架子上。"},{"en":"He reracked the barbell carefully to avoid damaging the equipment.","zh":"他小心把杠铃放回架子上，避免损坏器材。"}]},{"partOfSpeech":"v.","definition":{"en":"to arrange or reorganize items on a rack or shelf again (often in stores or storage areas).","zh":"（商店/仓储）把架子上的物品重新摆放、重新上架。"},"examples":[{"en":"The staff reracked the shoes by size and color.","zh":"店员按尺码和颜色把鞋子重新摆上架。"},{"en":"We need to rerack these products so the labels face forward.","zh":"我们得把这些商品重新摆放，让标签朝前。"}]}],"synonyms":["put back","return","re-shelve","reorganize","restock"],"phonetic":"/ˌriˈræk/","extraExplanation":["“rerack”常见于健身房礼仪用语：用完器械或重量片要“rerack your weights”，表示把器材归位，方便他人使用，也更安全。","在零售/仓库语境里，rerack带有“重新整理陈列”的意思，通常因为摆放凌乱、补货或调整分类。"]}
{"word":"reracked","summary":{"en":"“Reracked” means put something back on a rack, especially returning weights to the rack after lifting.","zh":"“Reracked”指把东西重新放回架子上；在健身语境中尤指把杠铃/哑铃等重量放回器械架。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"put something back onto a rack or into its proper racked position (past tense/past participle of “rerack”)","zh":"把某物放回架子上；重新上架（“rerack”的过去式/过去分词）"},"examples":[{"en":"After checking the items, she reracked them neatly on the shelf.","zh":"检查完物品后，她把它们整齐地重新放回架子上。"},{"en":"Please rerack the clothes by size and color.","zh":"请按尺码和颜色把衣服重新挂回衣架。"}]},{"partOfSpeech":"vt.","definition":{"en":"(gym/weightlifting) put the barbell or weights back onto the rack after a set (past tense/past participle)","zh":"（健身/举重）做完一组后把杠铃或重量放回杠铃架/器械架上（过去式/过去分词）"},"examples":[{"en":"He reracked the bar and stepped back to rest.","zh":"他把杠铃放回架上，然后退后休息。"},{"en":"Reracked weights keep the gym safe and tidy.","zh":"把重量放回原位能让健身房更安全、更整洁。"}]}],"synonyms":["put back","return to the rack","restack","re-shelve"],"phonetic":"/ˌriˈrækt/","extraExplanation":["“rerack”常见于健身房礼仪：做完动作后把杠铃片、哑铃等放回器械架，英文里也常直接说“rerack your weights”。","拼写上常写作 rerack / reracked（美国英语里更常见这种写法）；有时也会看到 re-rack / re-racked。因为词尾是 /k/ 音，过去式通常写作 reracked（-ed 发 /t/）。"]}
{"word":"reracker","summary":{"en":"“reracker” is not a standard English word; it’s likely a misspelling (often of “racker,” “retracker,” or “re-rack”).","zh":"“reracker”不是标准英语单词；多半是拼写错误，常见可能是“racker”“retracker”或“re-rack”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a very rare/brand-specific term.","zh":"不是标准英语单词；很可能是拼写错误，或只在特定品牌/圈子里使用的罕见用语。"},"examples":[{"en":"I couldn’t find “reracker” in a dictionary—did you mean “retracker” or “racker”?","zh":"我在词典里找不到“reracker”——你是想写“retracker”还是“racker”吗？"},{"en":"If you tell me the sentence it appears in, I can help you identify the correct word.","zh":"如果你把它出现的句子发我，我可以帮你判断正确的词。"}]}],"phonetic":"/riˈrækər/","extraExplanation":["“reracker”可能想表达的常见目标词有：\n1) racker /ˈrækər/：指“折磨人的事物/人”（something that racks you，如 nerve-racker 令人紧张的事），或在某些语境里指“把东西放上架的人/装架器”。\n2) retracker：多见于技术语境，指“重新追踪/重新跟踪”的工具或程序。\n3) re-rack (动词)：常用于健身房，表示“把杠铃片/器械放回架子上（归位）”。如果你原本想写的是这个，用法如：Please re-rack your weights."]}
{"word":"reracks","summary":{"en":"“Reracks” means “puts back on the rack again,” especially returning gym weights or items to their proper place.","zh":"“reracks”表示“重新放回架上/归位”，常指把健身房器械或物品放回原位。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put something back onto a rack again (for example, returning items to a shelf or weights to a gym rack).","zh":"把某物重新放回架子上（例如把物品放回货架，或把健身器械的杠铃片放回器械架）。"},"examples":[{"en":"After you finish, please rerack the dumbbells.","zh":"用完后请把哑铃放回架上。"},{"en":"The employee reracks the books in the correct order.","zh":"员工把书重新按正确顺序放回书架上。"}]}],"synonyms":["put back","return","restock","replace"],"phonetic":"/ˌriˈræk/","extraExplanation":["“rerack”在健身房语境里非常常见，通常是礼貌或规则提醒：用完器械要把重量片/哑铃“归位”。在口语里也会看到写成“re-rack”。","你输入的“reracks”多半是第三人称单数（He/She reracks）或名词复数很少用；更常见是动词用法。"]}
{"word":"reradiate","summary":{"en":"Reradiate means to give off radiation or energy again after receiving it, especially in physics and engineering.","zh":"Reradiate 指在接收或吸收辐射/能量后再次把它发射出去，常用于物理与工程语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Physics/engineering) To send out (radiation, waves, or energy) again after absorbing or receiving it.","zh":"（物理/工程）在吸收或接收到辐射、波或能量后，再次把它发射/辐射出去。"},"examples":[{"en":"Some materials absorb sunlight and then reradiate the energy as heat.","zh":"有些材料会吸收阳光，然后把能量以热的形式再辐射出来。"},{"en":"The antenna receives the signal and reradiates it in a new direction.","zh":"天线接收信号后，会把它向新的方向再辐射出去。"}]},{"partOfSpeech":"v.","definition":{"en":"To spread an idea, feeling, or influence again; to project it outward once more (figurative, less common).","zh":"（引申，较少见）再次传播某种想法、情绪或影响力；再度向外传递。"},"examples":[{"en":"After the crisis, the community tried to reradiate hope through local events.","zh":"危机过后，社区试图通过本地活动再次传递希望。"}]}],"synonyms":["re-emit","emit again","retransmit","reflect (sometimes)"],"phonetic":"/ˌriˈreɪdiˌeɪt/","extraExplanation":["词源很好理解：re-（再次）+ radiate（发射/辐射）。在科学语境里最常见，常与 heat（热）、infrared（红外）、signal（信号）、antenna（天线）等词一起出现。","与 radiate 的区别：radiate 强调“向外发出”；reradiate 强调“先接收/吸收，再发出（再辐射）”。","在电磁学里也常见 reradiation（再辐射）这个名词，用来描述物体或天线把接收到的电磁波再次辐射出去的现象。"]}
{"word":"reradiated","summary":{"en":"Reradiated means “sent out again,” especially energy like heat/light/radio waves after being absorbed.","zh":"Reradiated 指“再次发射/再辐射”，尤指物体吸收后把热、光或电磁波等能量再向外释放。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of reradiate) to send out energy (especially heat, light, or radio waves) again after absorbing it or receiving it.","zh":"（reradiate 的过去式/过去分词）指在吸收或接收到能量（尤指热、光或无线电波）之后，再次把能量向外发射出去。"},"examples":[{"en":"The dark pavement absorbed sunlight and reradiated heat into the air at night.","zh":"深色路面吸收了阳光，夜里又把热量再辐射到空气中。"},{"en":"The metal surface reradiated the infrared energy it had absorbed.","zh":"金属表面把它吸收的红外能量再辐射了出去。"},{"en":"In the lab, the signal was reradiated by the antenna and picked up by a nearby receiver.","zh":"在实验室里，信号被天线再辐射，并被附近的接收器接收到。"}]},{"partOfSpeech":"vt.","definition":{"en":"(more general) to spread or broadcast something again, especially a signal, information, or influence.","zh":"（更泛指）再次传播或再广播（尤指信号、信息或影响）。"},"examples":[{"en":"A local station reradiated the emergency announcement every hour.","zh":"当地电台每小时再广播一次紧急通告。"},{"en":"The message was reradiated through multiple channels, reaching more people.","zh":"这条信息通过多个渠道被再次传播，触达了更多人。"}]}],"synonyms":["re-emitted","re-emitted","radiated again","retransmitted","rebroadcast"],"phonetic":"/ˌriˈreɪdiˌeɪtɪd/","extraExplanation":["“reradiated”常见于科学与工程语境：例如物体吸收太阳能后以红外线形式“再辐射”热量；在无线电/天线领域也可指天线把接收到的电磁波再次发射，从而让附近设备接收。","在气候与温室效应的讨论中，也会出现“地表吸收太阳能并以红外辐射形式再辐射”的表述；注意它强调“再次发射”，不等同于单纯的“反射（reflect）”。"]}
{"word":"reradiates","summary":{"en":"“Reradiates” means emits energy again after absorbing it, or broadcasts a signal again.","zh":"“reradiates”指（吸收后）再辐射能量/热/光，或指把信号、节目再次播送/转发。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to send out (radiation, heat, light, or energy) again after absorbing it; to emit again","zh":"（吸收后）再次把（辐射/热/光/能量）向外发出；再辐射"},"examples":[{"en":"The ground absorbs sunlight during the day and reradiates heat at night.","zh":"地面白天吸收阳光，夜晚会把热量再辐射出来。"},{"en":"Some materials reradiate energy more slowly than others.","zh":"有些材料再辐射能量的速度比其他材料更慢。"}]},{"partOfSpeech":"v.","definition":{"en":"to broadcast or transmit again (a signal or program)","zh":"（信号或节目）再次播送；转发再发射"},"examples":[{"en":"The station reradiates the emergency message to nearby towns.","zh":"该电台把紧急信息转播到附近城镇。"}]}],"synonyms":["re-emit","radiate again","give off","retransmit","rebroadcast"],"phonetic":"/ˌriˈreɪdiˌeɪt/","extraExplanation":["“reradiate”由前缀 re-（再次）+ radiate（辐射、发散）组成。你输入的“reradiates”是第三人称单数（he/she/it reradiates）。","在科普语境里它常见于“热辐射/地球能量收支”：物体先吸收能量，再以红外辐射等形式“再辐射”出去。"]}
{"word":"reradiating","summary":{"en":"Reradiating means re-emitting energy (like heat, light, or radio waves) after absorbing it.","zh":"Reradiating 指吸收能量后再次把能量（如热、光或无线电波）辐射/放射出去。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving off (emitting) radiation again after absorbing it; sending energy out again as light, heat, radio waves, etc.","zh":"（吸收后）再次辐射、再发射能量；把光、热、无线电波等再次放射出去。"},"examples":[{"en":"Dark pavement absorbs sunlight and then keeps reradiating heat into the air at night.","zh":"深色路面吸收了阳光，夜里会不断把热量再辐射到空气中。"},{"en":"Some gases trap energy by absorbing infrared and reradiating it back toward the surface.","zh":"一些气体会通过吸收红外线并把能量再辐射回地表来“留住”热量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a thing) able to send out radiation again; re-emitting energy.","zh":"（用于描述事物）具有再辐射能力的；会把吸收的能量重新放射出来的。"},"examples":[{"en":"A reradiating surface can make a room feel warmer even after the heater turns off.","zh":"会再辐射的表面即使在暖气关闭后也能让房间感觉更暖。"},{"en":"In antenna design, nearby metal can act as a reradiating element and change the signal pattern.","zh":"在天线设计中，附近的金属可能成为再辐射元件，从而改变信号方向图。"}]}],"synonyms":["re-emitting","releasing","radiating again","reflecting (in some contexts)"],"phonetic":"/ˌriˈreɪdiˌeɪtɪŋ/","extraExplanation":["“reradiating”来自动词 reradiate（re- + radiate）。常见于物理/工程语境：\n1）热学：物体吸收能量后以热辐射（多为红外）形式再释放。\n2）电磁/天线：导体在电磁波作用下产生电流并“再辐射”电磁波，可能加强或干扰信号。\n日常英语里更常见的相关词是 radiate（辐射/散发）与 re-emit（再发射）。"]}
{"word":"reradiation","summary":{"en":"Reradiation is energy that a surface absorbs and then emits again as radiation, often as heat (infrared).","zh":"Reradiation 指表面吸收能量后再次以辐射形式释放出来的能量/过程，常见为以热（红外）形式再辐射。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which energy (especially heat or light) absorbed by a surface is emitted again as radiation","zh":"（再）辐射：物体表面吸收能量（尤其是热或光）后，再次以辐射形式释放出来的过程"},"examples":[{"en":"Dark asphalt heats up in the sun and later warms the air through reradiation.","zh":"深色沥青在阳光下变热，之后会通过再辐射让空气变暖。"},{"en":"Reradiation from the ground is one reason nights can stay warm in cities.","zh":"地面的再辐射是城市夜晚仍可能偏暖的原因之一。"}]}],"synonyms":["re-emission","thermal radiation","radiative emission"],"phonetic":"/ˌriˌrædiˈeɪʃən/","extraExplanation":["在气象与气候语境里，reradiation 常指地表吸收太阳短波辐射后，以红外长波辐射的形式“再放出来”。这与“反射（reflection）”不同：反射更像镜面把光弹回去；再辐射则是先吸收、再以热辐射释放。","也可在工程/通信里泛指“再辐射的能量”，但日常学习中最常见的是环境科学（地表—大气能量交换、温室效应等）的用法。"]}
{"word":"rerail","summary":{"en":"Rerail means to put a rail vehicle back on the tracks, and it can also mean to get something back on track (figuratively).","zh":"Rerail指让脱轨的列车/车厢复轨；也可比喻让事情回到正轨。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a train, railcar, or other rail vehicle back onto the tracks after it has come off","zh":"（火车/车厢等）脱轨后使其重新上轨道（复轨）"},"examples":[{"en":"The crew worked overnight to rerail the freight cars.","zh":"工作人员通宵作业让货运车厢复轨。"},{"en":"It took two cranes to rerail the locomotive safely.","zh":"用了两台起重机才安全地让机车复轨。"}]},{"partOfSpeech":"vt.","definition":{"en":"to get back on track; to return to a steady or successful course (often used figuratively)","zh":"（比喻）让事情回到正轨；重新走上稳定/成功的道路"},"examples":[{"en":"A new plan helped rerail the project after weeks of delays.","zh":"一项新方案让拖延数周的项目重回正轨。"},{"en":"Regular check-ins can rerail your study routine.","zh":"定期检查进度能让你的学习节奏回到正轨。"}]}],"synonyms":["re-rail","put back on the tracks","get back on track","restore","realign"],"phonetic":"/riˈreɪl/","extraExplanation":["“rerail”常见于铁路行业报道和事故通报中；名词形式是“rerailing”（复轨作业）。","比喻用法与“get back on track / put … back on track（回到正轨）”很接近，但“rerail”更有“脱轨后再复位”的画面感。"]}
{"word":"rerailer","summary":{"en":"A rerailer is a railway tool that helps put a derailed wheel back onto the track.","zh":"Rerailer 指铁路上的复轨器，用来帮助脱轨车轮回到轨道上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool or device used to guide a derailed train wheel back onto the rail","zh":"（铁路）复轨器；用于把脱轨的车轮引回轨道的工具或装置"},"examples":[{"en":"The maintenance crew brought a rerailer to put the wheel back on the track.","zh":"维修人员带来了复轨器，把车轮重新放回轨道上。"},{"en":"After the minor derailment, workers installed a rerailer and moved the car slowly forward.","zh":"发生轻微脱轨后，工人安装了复轨器，让车厢缓慢向前移动。"}]}],"synonyms":["re-railing device","rerailing tool","rail rerailer"],"phonetic":"/ˌriːˈreɪlər/","extraExplanation":["“Rerailer”主要用于铁路语境，常见于维修/救援场景。它通常是金属斜坡状或导向结构，让车轮在缓慢移动中“爬”回钢轨上。不同铁路公司可能有不同型号（便携式或固定式）。"]}
{"word":"reraise","summary":{"en":"“Reraise” most often means to throw an exception again after catching it, especially in programming.","zh":"“reraise”最常见的意思是（在编程中）捕获异常后再次抛出，让异常继续向上传播。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Programming) To raise an exception or error again after catching it, so it continues to propagate to the caller.","zh":"（编程）在捕获异常/错误之后，再次抛出它，使其继续向上层调用者传播。"},"examples":[{"en":"In Python, you can catch an exception, log it, and then reraise it.","zh":"在 Python 中，你可以捕获异常、记录日志，然后再把它重新抛出。"},{"en":"We reraise the error so the API client still receives the correct failure response.","zh":"我们重新抛出这个错误，这样 API 客户端仍然会收到正确的失败响应。"}]},{"partOfSpeech":"vt.","definition":{"en":"To raise something again (rare in everyday English).","zh":"再次举起/再次抬高某物（在日常英语中较少见）。"},"examples":[{"en":"The workers reraise the flag at dawn.","zh":"工人们在黎明时分再次升起旗帜。"}]}],"synonyms":["rethrow","throw again","propagate"],"phonetic":"/ˌriːˈreɪz/","extraExplanation":["“reraise”最常见于编程语境，尤其是 Python。Python 里在 except 块中单独写 `raise` 通常表示“把当前捕获到的异常原样重新抛出”；有些语言/框架也会用 `rethrow`（重新抛出）来表达同样概念。","重新抛出常用于：先做清理（cleanup）、记录日志（logging）、补充上下文信息（context），但不“吞掉”异常，让上层仍能感知并处理失败。"]}
{"word":"reraised","summary":{"en":"“Reraised” means “raised again,” often for flags, hands, prices, or an issue brought up again.","zh":"“reraised”表示“再次举起/提高/重新提出”，常用于旗帜、手、价格或把某个议题再次提起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"raised again; lifted or increased again after being lowered or stopped","zh":"再次举起；在降低或停止后又一次抬起/提高"},"examples":[{"en":"After the storm passed, the flag was reraised at sunrise.","zh":"暴风雨过去后，国旗在日出时再次升起。"},{"en":"The museum reraised the protective barrier after the event ended.","zh":"活动结束后，博物馆又把防护栏重新立了起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to raise again; to lift, rebuild, or increase again (often used for prices, rates, or flags)","zh":"再次提高/举起；重新抬起、重建或再度上调（常用于价格、费率、旗帜等）"},"examples":[{"en":"The company reraised prices after a short discount period.","zh":"短暂打折期结束后，公司又把价格上调了。"},{"en":"Officials reraised the issue during the next meeting.","zh":"官员们在下次会议上又重新提出了这个问题。"},{"en":"She reraised her hand to ask a follow-up question.","zh":"她又举起手来问一个追问问题。"}]}],"synonyms":["raised again","lifted again","reinstated","restored","increased again"],"phonetic":"/ˌriːˈreɪzd/","extraExplanation":["“reraised”来自动词“reraise（再次提高/举起）”的过去式或过去分词。写作中也常见带连字符的形式“re-raised”，两者意思相同；带连字符在正式编辑体中更常见，尤其当“re-”前缀可能引起误读时。"]}
{"word":"reraises","summary":{"en":"“Reraises” means “raises again,” especially in poker where it means raising after someone has raised.","zh":"“reraises”表示“再次提高/再次提出”，在扑克中常指“在别人加注后再加注”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"raises again; increases something a second time or brings it up again for discussion","zh":"再次提高；再次把（某事）提出来讨论/处理"},"examples":[{"en":"The company reraises prices after a rise in shipping costs.","zh":"由于运费上涨，这家公司再次提高价格。"},{"en":"She reraises the same concern at every meeting.","zh":"她在每次会议上都会再次提出同样的担忧。"}]},{"partOfSpeech":"v.","definition":{"en":"(poker) makes a raise after someone else has raised; increases the bet again","zh":"（扑克）在别人加注后再加注；再次提高下注额"},"examples":[{"en":"He reraises pre-flop to pressure the original raiser.","zh":"他在翻牌前再加注，以给最初加注的人施压。"},{"en":"When she reraises, it usually means she has a strong hand.","zh":"当她再加注时，通常说明她牌力很强。"}]}],"synonyms":["raises again","increases again","brings up again","reintroduces","(poker) 3-bets"],"phonetic":"/ˌriˈreɪzɪz/","extraExplanation":["“reraises”是动词“reraise”的第三人称单数（he/she/it reraises）。日常语境里常见于“再次提价/再次提出问题”；在扑克语境里几乎是固定术语，指“在对方加注之后再加注”。"]}
{"word":"rerake","summary":{"en":"Rerake means to rake something again (a less common form; often written re-rake).","zh":"rerake 指“再耙一次”，用法较少见，常写作 re-rake。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to rake again; to gather, smooth, or clear something with a rake one more time","zh":"再用耙子耙一次；再次把（落叶、草、碎石等）聚拢、整平或清理"},"examples":[{"en":"After the storm, we had to rerake the leaves off the lawn.","zh":"暴风雨过后，我们得把草坪上的落叶再耙一遍。"},{"en":"Rerake the gravel so the path looks even.","zh":"把碎石再耙平一下，让小路看起来更整齐。"}]}],"synonyms":["rake again","re-rake"],"phonetic":"/riˈreɪk/","extraExplanation":["“rerake”是由前缀 re-（再一次）+ rake（用耙子耙）构成的动词，但在日常英语里相对少见；更常见的写法是带连字符的 “re-rake”，或直接说 “rake again”。","如果你想表达“重新参加考试/补考/再拍一次镜头”，更常用的是 “retake”。（例如：retake the exam / retake the photo）"]}
{"word":"reran","summary":{"en":"“Reran” means “ran again” or “repeated/reshowed” something; it is the past tense of “rerun.”","zh":"“reran”表示“又跑了一次/重新做了一遍/重播了”，是“rerun”的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “rerun”: to run again; to do something again from the beginning, or to show/broadcast something again (like a movie or TV show).","zh":"“rerun”的过去式：再跑一次；把某事从头再做一次；（电影/节目等）重播、再放映。"},"examples":[{"en":"He reran the race after the first start was stopped.","zh":"第一次起跑被叫停后，他又重新跑了一次比赛。"},{"en":"The TV channel reran the episode last night.","zh":"那个电视频道昨晚重播了这一集。"},{"en":"I reran the analysis to double-check the results.","zh":"我把分析又做了一遍，以便再次核对结果。"}]}],"synonyms":["repeated","did again","replayed","re-broadcast","run again"],"phonetic":"ˌriˈræn","extraExplanation":["“reran”是动词“rerun”的不规则过去式：rerun → reran → rerun。现在时常用“rerun(s)”，过去时用“reran”。","在美式英语里，“rerun”也常作名词，表示“重播/重映”（a rerun）。但“reran”只用作动词过去式。"]}
{"word":"rerank","summary":{"en":"Rerank means to rank something again, often to reorder search results, candidates, or recommendations using new criteria.","zh":"Rerank 指“重新排名/再排序”，常用于把搜索结果、候选人或推荐内容按新标准重新排列。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange people or things in a new order of importance or position; to give a new ranking","zh":"（把人或事物）重新排序；重新排名"},"examples":[{"en":"After reviewing the interviews, the committee reranked the top candidates.","zh":"复核面试后，委员会把最优秀的候选人重新排名。"},{"en":"The search engine reranks results based on what you click.","zh":"搜索引擎会根据你的点击行为对结果重新排序。"}]},{"partOfSpeech":"vt.","definition":{"en":"(in computing/AI) to reorder items—especially search results or recommendations—using an additional model or new information","zh":"（计算机/AI）用额外模型或新信息对条目（尤指搜索结果、推荐内容）再排序"},"examples":[{"en":"The system uses a second model to rerank the top 100 documents.","zh":"系统使用第二个模型对前100篇文档再排序。"},{"en":"We rerank the recommendations to prioritize freshness and diversity.","zh":"我们对推荐结果再排序，以优先考虑新鲜度和多样性。"}]}],"synonyms":["reorder","re-rank","reclassify","reshuffle"],"phonetic":"/ˌriːˈræŋk/","extraExplanation":["词源与构词：re- 表示“再、重新”，rank 表示“排名”。所以 rerank 字面意思就是“重新排名”。","使用场景：在日常英语里也能用，但在科技语境（搜索引擎、信息检索、推荐系统、LLM 等）里非常常见，通常指“先粗排，再精排”。","常见搭配：rerank results（重排结果）、rerank candidates（重排候选人）、rerank documents/items（重排文档/条目）、reranking model（重排模型）。"]}
{"word":"rerate","summary":{"en":"Rerate means to rate something again or to revise an existing price/rate after review.","zh":"rerate 指「重新評分」，也可指在審核後「重新核定費率／重新計價」。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to rate again; to judge or score something a second time, often after getting new information or feedback","zh":"重新評分／重新評定；在獲得新資訊或回饋後再做一次評價或打分"},"examples":[{"en":"After reading the reviews, I rerated the movie from 3 stars to 4.","zh":"看完評論後，我把那部電影從三顆星重新評為四顆星。"},{"en":"The teacher rerated the essays because the grading rubric was updated.","zh":"因為評分標準更新了，老師把作文重新評分。"}]},{"partOfSpeech":"vt.","definition":{"en":"to revise an existing rate or price (for example, insurance, shipping, or telecom charges)","zh":"重新核定費率／重新定價（例如保險、運輸或電信費用）"},"examples":[{"en":"The insurer rerated the policy after the customer moved to a different city.","zh":"客戶搬到另一個城市後，保險公司重新核定了保單費率。"},{"en":"Our phone plan was rerated based on the new contract terms.","zh":"我們的手機方案依照新的合約條款重新計價了。"}]}],"synonyms":["reassess","reevaluate","reappraise","revise","reprice"],"phonetic":"/ˌriˈreɪt/","extraExplanation":["「rerate」= re-（再一次）+ rate（評分／定價）。日常語境多指「重新評分」；在商業或合約語境（保險、電信、運輸）常指「重新核定費率／重新計價」。"]}
{"word":"rerated","summary":{"en":"“Rerated” means “rated again” or “given a new rating/price.”","zh":"“rerated”表示“重新评级”或“重新定价/重新设定费率”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to rate again; to give a new rating (for example, a film, product, employee, or customer account)","zh":"重新评级；再次给出评分/等级（如电影、产品、员工或客户账户）"},"examples":[{"en":"After the rules changed, the movie was rerated for its violent scenes.","zh":"规则改变后，这部电影因为暴力镜头被重新评级。"},{"en":"The insurance company rerated the policy based on the customer’s updated health information.","zh":"保险公司根据客户更新的健康信息对保单进行了重新评级。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change someone’s or something’s rate or price again (especially in billing, shipping, or services)","zh":"重新定价/重新设定费率（尤用于计费、运输或服务）"},"examples":[{"en":"If your package is heavier than expected, the carrier may rerate the shipping cost.","zh":"如果包裹比预期更重，承运方可能会重新计算运费。"},{"en":"The hotel rerated the room after adding breakfast to the booking.","zh":"酒店在订单加入早餐后重新调整了房价。"}]}],"synonyms":["reassessed","reclassified","re-evaluated","repriced"],"phonetic":"/ˌriːˈreɪt/","extraExplanation":["“rerated”通常写作带连字符的 **re-rated**（更清晰，尤其在正式写作中），意思是“被重新评级/重新定价”。在口语或非正式文本里也会看到不加连字符的 **rerated**。","常见搭配：**be re-rated**（被重新评级）、**rerate a policy**（重新评估/调整保单费率）、**rerate shipping**（重新计费运费）。"]}
{"word":"rerating","summary":{"en":"Rerating means rating something again and giving it a new score or level.","zh":"Rerating 指对某事物再次评分/评级，并给出新的分数或等级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a new rating or a change to an existing rating after reviewing something again (such as a film, product, or a person’s performance)","zh":"（在重新评估之后给出的）重新评级；改评（如对电影、产品或表现重新打分）"},"examples":[{"en":"After watching the movie again, I posted a rerating on my blog.","zh":"我又看了一遍这部电影后，在博客上发了一个重新评分。"},{"en":"The app update led to a rerating from 3 stars to 4 stars.","zh":"应用更新后，评分从3星改评为4星。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of rating again; reviewing and giving a new score or level","zh":"重新评分；重新评定（再次评审并给出新的分数或等级）"},"examples":[{"en":"We’re rerating all the candidates after the second interview round.","zh":"第二轮面试后，我们会对所有候选人重新评定。"},{"en":"The website is rerating older restaurants based on recent customer feedback.","zh":"该网站会根据近期顾客反馈对老餐厅重新评分。"}]}],"synonyms":["reassessment","re-evaluation","regrading","review"],"phonetic":"/ˌriːˈreɪtɪŋ/","extraExplanation":["“rerating”常见于评价体系：比如影评/商品星级（star rating），也常见于金融语境的“信用评级/债券评级”（credit/bond rating）被机构重新调整。不同语境下，rerating 既可以表示“重新打分”，也可能暗含“评级上调/下调”。"]}
{"word":"rere","summary":{"en":"“rere” is not a standard English word; it is usually a typo or shorthand for something like “re-” or “reread.”","zh":"“rere”不是标准英文单词，通常是拼写错误或“re- / reread”等的简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most often appears as a typo or informal shorthand (for example, someone meaning “re-” as a prefix, or “reread” / “re-read”).","zh":"不是标准英文单词。最常见的情况是拼写错误或随手的简写（例如想表达前缀“re-”，或想写“reread / re-read（重读）”）。"},"examples":[{"en":"I don’t recognize “rere” as an English word—did you mean “reread” or “re-” (as in “rewrite”)?","zh":"我不把“rere”当作英文单词——你是想写“reread（重读）”还是前缀“re-”（比如 rewrite 重新写）？"},{"en":"The message says “rere,” but the context suggests they meant “re-read the email.”","zh":"信息里写的是“rere”，但从上下文看更像是想说“把邮件再读一遍（re-read the email）”。"}]}],"phonetic":"Unknown","extraExplanation":["在英语里常见的是前缀 **re-**，表示“再次、重新”（如 *redo, rewrite, replay*）。如果你想查的是 **re-** 或 **reread / re-read**，告诉我你想表达的句子或场景，我可以给你更准确的词条、用法和例句。"]}
{"word":"reread","summary":{"en":"Reread means to read something again, usually to understand or check it more carefully.","zh":"reread 指把内容再读一遍，通常为了更仔细地理解或检查。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to read something again, often to understand it better, remember details, or check for mistakes","zh":"重读；再读（常为更好理解、记住细节或检查错误）"},"examples":[{"en":"I had to reread the paragraph because I didn’t understand it the first time.","zh":"我不得不把那段重读一遍，因为第一次没看懂。"},{"en":"Before sending the email, I reread it to check for typos.","zh":"在发送邮件前，我把它重读了一遍，检查有没有错别字。"},{"en":"She reread his last message again and again.","zh":"她一遍又一遍地重读他最后那条消息。"}]}],"synonyms":["read again","go over","review"],"phonetic":"/ˌriːˈriːd/","extraExplanation":["“reread”由前缀 re-（“再次”）+ read 组成，意思很直观：把已经读过的内容再读一遍。","常见搭配：reread the chapter/notes/instructions（重读章节/笔记/说明）。"]}
{"word":"rereader","summary":{"en":"A rereader is someone who reads something again, often for enjoyment or deeper understanding.","zh":"rereader 指会把某些内容再读一遍的人，常为享受或加深理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who reads a book, text, or message again (often because they enjoy it, study it, or want to notice new details)","zh":"反复阅读者；重读某本书/文本/信息的人（常因喜爱、学习或想发现新细节）"},"examples":[{"en":"I’m a rereader—I’ve read this novel three times.","zh":"我是个反复阅读者——这本小说我读了三遍。"},{"en":"As a rereader, she notices themes she missed the first time.","zh":"作为重读者，她会注意到第一次没发现的主题。"},{"en":"Teachers often encourage students to be rereaders when a text is difficult.","zh":"当文本较难时，老师常鼓励学生进行重读。"}]}],"synonyms":["re-reader","repeat reader","rereading fan"],"phonetic":"/ˌriːˈriːdɚ/","extraExplanation":["“rereader”由前缀 re-（再次）+ reader（读者）构成，强调“再读一遍”。在英语里更常见的表达也包括 “someone who rereads” 或 “I like to reread books”。"]}
{"word":"rereading","summary":{"en":"“Rereading” means reading something again, often to understand it better or notice new details.","zh":"“rereading”指把内容再读一遍，常用于加深理解或发现新细节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of reading something again (often to understand it better or notice new details)","zh":"重新阅读；再读（常为更好理解或发现新细节）"},"examples":[{"en":"On my rereading of the novel, I noticed many clues I missed the first time.","zh":"我重读这本小说时，注意到了很多第一次没发现的线索。"},{"en":"Rereading your essay can help you catch small grammar mistakes.","zh":"重读你的作文能帮助你发现一些小的语法错误。"}]},{"partOfSpeech":"v.","definition":{"en":"reading something again (present participle of “reread”)","zh":"再读；重读（动词“reread”的现在分词）"},"examples":[{"en":"I’m rereading the email to make sure I understood the tone.","zh":"我在重读这封邮件，确认我理解了语气。"},{"en":"She spent the weekend rereading her notes before the exam.","zh":"她周末花时间重读笔记，为考试做准备。"}]}],"synonyms":["reading again","re-reading","reviewing","going over"],"phonetic":"/ˌriˈriːdɪŋ/","extraExplanation":["“rereading”来自“re-（再、重新）+ read（阅读）”。在学习语境里，rereading常指为了加深理解而第二次、第三次阅读；在文学阅读中也常用来表达“重读后有新感受”。","常见搭配：rereading a book/novel/article；on a rereading of…（在重读……时）。"]}
{"word":"rereads","summary":{"en":"“Rereads” means “reads again.”","zh":"“rereads”表示“再读一遍/重读”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to read something again (a second time or more), often to understand it better or notice new details","zh":"把某物再读一遍（或多遍），常为更好理解或发现新细节"},"examples":[{"en":"She rereads the email before she sends it.","zh":"她在发送邮件前会把邮件再读一遍。"},{"en":"He rereads the chapter to prepare for the test.","zh":"他为了考试复习，把那一章又读了一遍。"},{"en":"If a sentence is confusing, reread it slowly.","zh":"如果某句话让你困惑，就慢慢再读一遍。"}]}],"synonyms":["reads again","reviews","goes over","revisits"],"phonetic":"/ˌriˈrid/","extraExplanation":["“rereads”是动词第三人称单数（he/she/it rereads）。原形是“reread”，过去式和过去分词常见写法是“reread”（读音可与原形相同），也有人写作“reread”但读音会随时态变化；在学习中记住含义“再读一遍”最重要。"]}
{"word":"rerebrace","summary":{"en":"“Re-embrace” means to embrace again, or to accept/adopt something again.","zh":"“re-embrace”指再次拥抱，或重新接纳／回归／采纳某种事物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to embrace again; to hug someone again","zh":"再次拥抱；重新拥抱（某人）"},"examples":[{"en":"After years apart, they re-embraced at the airport.","zh":"多年分别后，他们在机场再次相拥。"},{"en":"She re-embraced her son and started to cry.","zh":"她再次抱住儿子，忍不住哭了起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to accept, return to, or adopt again (an idea, habit, culture, or relationship)","zh":"重新接纳；重新回归／采纳（观念、习惯、文化或关系）"},"examples":[{"en":"Many people re-embrace old traditions during the holidays.","zh":"很多人在节日期间会重新回归一些传统。"},{"en":"He re-embraced healthy routines after a difficult year.","zh":"经历艰难的一年后，他重新开始坚持健康的作息。"}]}],"synonyms":["reunite with","hug again","renew","return to","re-adopt"],"phonetic":"/ˌriː ɪmˈbreɪs/","extraExplanation":["“rerebrace”不是常见英文拼写；你很可能想写的是 **re-embrace**（也可写作 **reembrace**）。","拼写上常见两种：**re-embrace**（更清晰，尤其在正式写作中）与 **reembrace**（更紧凑）。","如果你的意思是“再次抱一下”，用 **hug again** 也很自然；如果是“重新接纳/回归某种理念或生活方式”，用 **return to** / **re-adopt** 也常见。"]}
{"word":"rerecord","summary":{"en":"“Rerecord” means to record again—either to fix/update a recording or to create a new version of the same song.","zh":"“rerecord”指“重新录制”：可以是为修正/更新而再录一次，也可以是把同一首歌做成新的录音版本。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to record something again, usually to improve quality, fix mistakes, or update the content","zh":"把（内容）重新录制；再录一遍（通常为了提升质量、修正错误或更新内容）"},"examples":[{"en":"We had to rerecord the interview because the audio was too noisy.","zh":"因为音频噪音太大，我们不得不把采访重新录一遍。"},{"en":"The singer rerecorded the chorus to make the pronunciation clearer.","zh":"歌手把副歌重新录制了一遍，让发音更清晰。"},{"en":"Please rerecord your answer and speak a little louder.","zh":"请把你的回答重新录一遍，声音大一点。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a new recording of the same song/album, often with a different arrangement or under different ownership","zh":"（同一首歌/专辑）再录新版本（常见于改编、重制，或因版权/发行原因）"},"examples":[{"en":"The band rerecorded their early songs for a special anniversary album.","zh":"乐队为纪念专辑把早期歌曲重新录制成新版本。"},{"en":"She rerecorded the track with an acoustic arrangement.","zh":"她用原声编曲把那首歌重新录了一版。"}]}],"synonyms":["record again","redo","re-tape","re-record"],"phonetic":"/ˌriːrɪˈkɔrd/","extraExplanation":["在音乐产业里，rerecord 常涉及“重新录音权”（re-recording restriction）。一些歌手会在合约限制期结束后，把旧歌“再录”成新版本，以便掌握新录音的版权和收益。","拼写上也常见作 re-record（带连字符），意思相同；口语里也有人写作 rerecord。"]}
{"word":"rerecorded","summary":{"en":"“Rerecorded” means recorded again, or having been recorded again.","zh":"“rerecorded”表示“重新录制的/已重新录制”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “rerecord”: to record something again (often to improve quality or replace an earlier version).","zh":"“rerecord”的过去式/过去分词：把某物重新录制（常为提高质量或替换旧版本）。"},"examples":[{"en":"The singer rerecorded the track to fix a few notes.","zh":"歌手重新录制了这首曲子来修正几个音。"},{"en":"We rerecorded the voice-over because the first take had too much noise.","zh":"我们重新录了旁白，因为第一版噪音太大。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that has been recorded again.","zh":"形容某物已被重新录制。"},"examples":[{"en":"This album includes two rerecorded songs from the band’s early years.","zh":"这张专辑收录了乐队早期两首歌的重新录制版本。"},{"en":"Please upload the rerecorded audio file by Friday.","zh":"请在周五前上传重新录制的音频文件。"}]}],"synonyms":["recorded again","re-cut (music)","retracked (studio)","remade (informal)"],"phonetic":"/ˌriːrɪˈkɔːrdɪd/","extraExplanation":["“重新录制”在音乐行业里很常见：艺人可能为了提升编曲/音质、改变风格、补录人声，或出于版权与发行策略而把旧歌再录一遍。近年也常见“re-recording / re-recorded version（重录版）”的说法。"]}
{"word":"rerecording","summary":{"en":"Rerecording means recording something again, or the new version made by recording again (often in music).","zh":"Rerecording 指把内容再录一次的过程，或指重新录制出来的新版本（常用于音乐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of recording something again (audio, video, or data), often to improve quality or replace an earlier version","zh":"（音频、视频或数据的）重新录制；再次录音/录像/记录，常为提升质量或替换旧版本"},"examples":[{"en":"The band scheduled a rerecording of the vocals because the first take was too quiet.","zh":"乐队安排重新录制人声，因为第一版太小声。"},{"en":"We lost the interview file, so we asked for a rerecording.","zh":"我们丢了采访文件，所以请求对方重新录一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"a new version that has been recorded again (especially a song, album, or soundtrack)","zh":"重新录制的版本（尤指歌曲、专辑或原声带的新版本）"},"examples":[{"en":"Fans compared the rerecording with the original to hear the differences.","zh":"粉丝把重新录制版和原版做对比，听差别。"},{"en":"The rerecording includes two bonus tracks.","zh":"这张重新录制版包含两首加赠曲目。"}]}],"synonyms":["re-recording","new recording","remake (music)","re-recorded version"],"phonetic":"/ˌriːrɪˈkɔːrdɪŋ/","extraExplanation":["在音乐行业里，rerecording 常与版权/母带（master）有关：艺人可能为了拥有新录音的控制权，或为了让旧歌以新的声音与制作方式重新发布，而推出“重录版”。近年也常见于流行音乐宣传语境（例如“re-recorded version/重新录制版”）。","拼写上也常见作 re-recording（加连字符）；意思相同。"]}
{"word":"rerecords","summary":{"en":"“Rerecords” can mean (1) records again (verb, 3rd person) or (2) new recordings made by recording again (plural noun).","zh":"“rerecords”可指（1）再次录制（动词第三人称单数），或（2）重录后的新录音（复数名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to record something again (for example, to improve quality, fix mistakes, or make a new version)","zh":"把某物再次录制（例如为了提升质量、修正错误或制作新版本）"},"examples":[{"en":"She rerecords the vocals to get a cleaner sound.","zh":"她重新录制人声，以获得更干净的音色。"},{"en":"The actor rerecords several lines because the background noise was too loud.","zh":"因为背景噪音太大，那位演员重新录制了几句台词。"}]},{"partOfSpeech":"n.","definition":{"en":"new recordings made by recording again (plural)","zh":"重新录制后的新录音（复数）"},"examples":[{"en":"The album includes rerecords of his early hits.","zh":"这张专辑收录了他早期热门歌曲的重新录制版本。"},{"en":"Fans compared the rerecords with the original tracks.","zh":"粉丝们把重录版和原版音轨做了对比。"}]}],"synonyms":["re-records","records again","remakes","new recordings"],"phonetic":"/ˌriːˈrɛkɔrdz/","extraExplanation":["“rerecords”常见有两种用法：\n1）动词：第三人称单数（he/she/it rerecords）。\n2）名词：复数，表示“重录版/重录的录音”。\n书写上也常见作“re-records / re-record”，加连字符更清晰。"]}
{"word":"reredos","summary":{"en":"A reredos is an ornate panel or screen behind a church altar.","zh":"reredos 指教堂祭坛后方的华丽装饰背屏/墙饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative screen, wall, or panel behind and above the altar in a church, often carved or painted.","zh":"（教堂中）祭坛后方并向上延伸的装饰性屏风/墙面/板饰，常有雕刻或绘画。"},"examples":[{"en":"The cathedral’s reredos was covered with gold leaf and detailed carvings.","zh":"这座大教堂的祭坛背屏覆有金箔，并有精细的雕刻。"},{"en":"During the tour, we learned that the reredos tells Bible stories through images.","zh":"参观时我们了解到，这座祭坛背屏通过图像讲述《圣经》故事。"}]}],"synonyms":["altarpiece","altar backdrop","retable"],"phonetic":"/ˈrɪrˌdɑs/","extraExplanation":["词源来自中古法语，最终可追溯到拉丁语，含义与“在后面（behind）”有关，所以它指的就是祭坛“后方”的装饰结构。","它主要用于基督教礼拜空间（尤其是天主教与英国圣公会传统较常见），既有装饰作用，也常承载宗教叙事（圣徒、圣经场景等）。","容易与 altar screen / rood screen 混淆：reredos 通常在祭坛后方；rood screen（十字架屏风）多是隔开圣坛与会众区的结构，位置与功能不同。"]}
{"word":"reredoses","summary":{"en":"“Reredoses” means gives or takes another dose again, usually in a medical context.","zh":"“reredoses”表示（再次）给药或（再次）服用一剂药物，常用于医学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone another dose of a medicine or drug; to administer a dose again","zh":"再次给（某人）用药；重新给药（再给一剂/一量）"},"examples":[{"en":"The nurse reredoses the patient if the pain returns.","zh":"如果疼痛又回来，护士会给病人再次用药。"},{"en":"The doctor reredoses the antibiotic after the test results come back.","zh":"检查结果出来后，医生再次给病人使用抗生素。"}]},{"partOfSpeech":"v.","definition":{"en":"to take another dose of a medicine or drug; to dose oneself again","zh":"再次服用/摄入一剂药物；再服一剂"},"examples":[{"en":"Don’t reredose without checking the label or calling a pharmacist.","zh":"没看清说明书或没咨询药师前，不要自行再次服药。"},{"en":"He reredoses too soon and feels dizzy.","zh":"他过早再次服药，结果感到头晕。"}]}],"synonyms":["re-dose","administer another dose","give another dose","repeat the dose","redose"],"phonetic":"/ˌriːˈdoʊzɪz/","extraExplanation":["“reredoses”通常是动词“re-dose”的第三人称单数形式（he/she/it reredoses）。在正式写作中更常见写作“re-dose / re-doses”（带连字符），尤其在医学或药学语境里，用来强调“再给一剂”。","与“repeat a dose（重复一剂）”不同，“re-dose”往往暗示因症状复发、剂量不足、呕吐吐出药物等原因而“再次给药/补一剂”，具体是否需要再给药必须遵循医嘱或药品说明。"]}
{"word":"reree","summary":{"en":"“reree” isn’t standard English; it’s likely a misspelling of “referee” (a sports official).","zh":"“reree”不是标准英文；很可能是“referee”（体育比赛裁判）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“reree” is not a standard English word; it is most likely a misspelling of “referee” (the person who enforces rules in a game).","zh":"“reree”不是标准英文单词；它很可能是“referee”的拼写错误（指在比赛中执行规则的裁判）。"},"examples":[{"en":"I think you mean “referee,” the person who controls the match.","zh":"我觉得你想写的是“referee”，也就是掌控比赛的裁判。"},{"en":"The referee blew the whistle to stop the game.","zh":"裁判吹哨让比赛停止。"}]},{"partOfSpeech":"n.","definition":{"en":"referee (noun): an official who makes sure the rules are followed in a sport or game.","zh":"referee（名词）：在体育或比赛中负责确保规则被遵守的裁判/执法人员。"},"examples":[{"en":"The referee gave him a yellow card.","zh":"裁判给了他一张黄牌。"},{"en":"Ask the referee if that goal counts.","zh":"问问裁判那个进球算不算。"}]},{"partOfSpeech":"v.","definition":{"en":"referee (verb): to act as the official who controls a game and enforces the rules.","zh":"referee（动词）：担任裁判，执法比赛并执行规则。"},"examples":[{"en":"She will referee the basketball game tomorrow.","zh":"她明天将担任那场篮球赛的裁判。"}]}],"synonyms":["ref","official","umpire"],"phonetic":"/ˌrɛfəˈri/","extraExplanation":["“Referee”常见口语简称是“ref”（尤其在足球/篮球等语境里）。","如果你本来想表达“重新阅读/重新做某事”，那通常用前缀“re-”加动词：例如 reread（再读一遍）、redo（重做）。你可以告诉我你想表达的意思，我可以帮你找正确拼写。"]}
{"word":"rereel","summary":{"en":"Rereel means to wind film, tape, or line onto a reel again, often to rewind, tidy, or prepare it for use.","zh":"rereel 指把胶片、磁带或线等重新绕回卷轴上，常用于“倒回、整理或准备再次使用”的语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wind or transfer (film, tape, wire, thread, etc.) onto a reel again, usually to organize it, prepare it for use, or fix tangles","zh":"把（胶片/磁带/电线/线等）重新绕到卷轴上；重新收卷（通常为整理、准备使用或解开缠绕）"},"examples":[{"en":"We need to rereel the fishing line because it got twisted.","zh":"钓线缠在一起了，我们得把它重新绕回线轴上。"},{"en":"The technician rereeled the tape before storing it.","zh":"技术员在存放前把磁带重新收卷了一遍。"}]},{"partOfSpeech":"vt.","definition":{"en":"to rewind or respool recorded media (especially film) back onto its reel","zh":"（尤指胶片）把已播放/使用过的介质倒回并重新卷到卷轴上"},"examples":[{"en":"After screening the movie, they rereeled the film for the next show.","zh":"放映结束后，他们把胶片重新收卷，准备下一场。"}]}],"synonyms":["respool","rewind","wind back","reel in"],"phonetic":"/ˌriˈril/","extraExplanation":["“rereel”通常写作带连字符的“re-reel”，表示“再次/重新+收卷到卷轴上”。在现代日常英语里它不算特别常见，但在电影放映、录音录像、渔具或工业绕线等语境中更容易见到。"]}
{"word":"rereeve","summary":{"en":"“Reeve” is a historical word for a local official in medieval England, and it can also mean (in nautical use) to thread a rope through a pulley or opening.","zh":"“Reeve”既可指（历史上）中世纪英格兰的地方官员，也可指（航海用语）把绳索穿过滑轮或孔洞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) a local official in medieval England, similar to a manager or administrator for an area or an estate.","zh":"（历史用语）中世纪英格兰的地方官员，类似于某一地区或庄园的管理者、行政官。"},"examples":[{"en":"In the story, the reeve collected taxes for the lord of the manor.","zh":"在故事里，那位 reeve 为庄园领主征税。"},{"en":"The village reeve was responsible for keeping order.","zh":"村里的 reeve 负责维持秩序。"}]},{"partOfSpeech":"vt.","definition":{"en":"(nautical) to pass a rope or line through a hole, ring, or pulley block, especially when setting up rigging.","zh":"（航海）把绳索/缆绳穿过孔、环或滑轮组（常用于装配索具）。"},"examples":[{"en":"They reeved the line through the block and tightened the rigging.","zh":"他们把绳索穿过滑轮组，然后拉紧索具。"},{"en":"The sailor carefully reeved the rope before hoisting the sail.","zh":"水手在升帆前仔细地把绳子穿好。"}]}],"synonyms":["bailiff","steward","administrator","thread (a rope)"],"phonetic":"/riv/","extraExplanation":["你输入的“rereeve”不太常见，最可能是拼写误差：常见词是“reeve”。","“reeve（地方官）”来自古英语 *gerefa*，与现代英语里的“sheriff（郡长/治安官）”有历史渊源：*shire-reeve* 原意就是“郡的 reeve”。","文学/历史语境中更常见“reeve（官职）”；“reeve（穿绳）”则主要出现在航海、攀登或绳结/器械说明里。"]}
{"word":"rerefief","summary":{"en":"Relief most commonly means comfort after worry or pain lessens; it can also mean aid given to people in need, a refreshing break from seriousness, or a raised/contrasting design in art.","zh":"Relief 最常指烦恼或疼痛减轻后的宽慰/缓解；也可指对困难人群的救济援助、让气氛变轻松的调剂，或艺术中的浮雕/对比效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of comfort or relaxation after worry, pain, or trouble has ended or become less severe","zh":"（烦恼、疼痛或困难减轻或结束后的）宽慰；轻松；缓解"},"examples":[{"en":"I felt great relief when I heard everyone was safe.","zh":"听到大家都安全了，我感到非常宽慰。"},{"en":"This medicine gives fast relief from headaches.","zh":"这种药能快速缓解头痛。"}]},{"partOfSpeech":"n.","definition":{"en":"help given to people in need, especially money, food, or medical support (often in disasters)","zh":"（尤指灾害中的）救济；援助（如资金、食物或医疗支持）"},"examples":[{"en":"They sent disaster relief to the flooded area.","zh":"他们向洪水灾区运送了救灾援助。"},{"en":"The charity provides relief for homeless families.","zh":"这家慈善机构为无家可归的家庭提供救济。"}]},{"partOfSpeech":"n.","definition":{"en":"something that makes a situation less boring, serious, or stressful; a change that feels refreshing","zh":"（使气氛不那么沉闷、严肃或紧张的）调剂；轻松感；缓和"},"examples":[{"en":"A short walk was a welcome relief from studying all day.","zh":"短暂散步是整天学习后的好调剂。"},{"en":"His joke provided some comic relief.","zh":"他的玩笑带来了一点喜剧性缓和。"}]},{"partOfSpeech":"n.","definition":{"en":"a different, often lighter-colored area or raised design that stands out from its background (in art, sculpture, or maps)","zh":"（艺术/雕塑/地图中的）浮雕；凸起效果；（明暗）对比效果"},"examples":[{"en":"The temple wall has beautiful stone reliefs.","zh":"寺庙墙上有精美的石雕浮雕。"},{"en":"The hills are shown in relief on the map.","zh":"地图上用立体效果显示了山丘。"}]}],"synonyms":["comfort","ease","alleviation","aid","assistance","support"],"phonetic":"/rɪˈlif/","extraExplanation":["你输入的“rerefief”很可能是拼写错误，常见正确拼写是 **relief**。","常见搭配：**feel relief**（感到宽慰），**a sigh of relief**（松一口气），**pain relief**（止痛/缓解疼痛），**disaster relief**（救灾援助），**comic relief**（喜剧性调剂/缓和紧张气氛）。"]}
{"word":"reregister","summary":{"en":"Reregister means to register again, usually because information changed or you must complete the process another time.","zh":"Reregister 指“再次登记/重新注册”，通常因为信息变更或需要再走一遍注册流程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to register again (for example, for a class, an account, a service, or an official list).","zh":"再次登记；重新注册（例如课程、账号、服务或官方名册）。"},"examples":[{"en":"If you miss the deadline, you may need to reregister for the course next term.","zh":"如果你错过截止日期，可能需要下学期重新注册这门课。"},{"en":"After changing my email address, I had to reregister on the website.","zh":"更换邮箱后，我不得不在网站上重新注册。"}]},{"partOfSpeech":"v.","definition":{"en":"to enter, record, or list something again, often to correct or update information.","zh":"重新录入；再次登记（常为更正或更新信息）。"},"examples":[{"en":"The clerk asked us to reregister the vehicle with the new address.","zh":"工作人员让我们用新地址重新登记车辆信息。"},{"en":"Some users had to reregister their fingerprints after the software update.","zh":"软件更新后，一些用户需要重新录入指纹。"}]}],"synonyms":["re-register","register again","renew registration","enroll again"],"phonetic":"/ˌriːˈrɛdʒɪstər/","extraExplanation":["拼写上常见两种形式：re-register（更清晰、正式写法，尤其在美式英语中常用连字符避免连续的“re”造成阅读不便）和 reregister（较少见但也正确）。","语境上多出现在“需要再次完成注册流程”的场合，例如学籍/课程、选民登记、车辆登记、账号与安全验证等。"]}
{"word":"reregistered","summary":{"en":"Reregistered means registered again or renewed; it can describe the action (past tense) or the status (adjective).","zh":"reregistered 表示“重新登记/再次注册”，既可作动词的过去式/过去分词，也可作形容词表示“已重新注册的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to register (someone or something) again, often because a previous registration expired, changed, or had an error","zh":"（因过期、变更或信息错误等原因）再次登记／重新注册（某人或某物）"},"examples":[{"en":"I reregistered my car after I moved to a new state.","zh":"我搬到另一个州后，重新办理了汽车注册。"},{"en":"The student reregistered for classes after fixing a payment problem.","zh":"这名学生解决了缴费问题后，重新注册了课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"having been registered again; renewed in a registration system","zh":"已再次登记的；已重新注册的"},"examples":[{"en":"Your reregistered account is now active.","zh":"你的重新注册账户现在已激活。"},{"en":"Please keep a copy of the reregistered license for your records.","zh":"请保留一份重新登记后的执照副本以备查。"}]}],"synonyms":["re-registered","registered again","renewed","re-enrolled"],"phonetic":"/ˌriˈrɛdʒɪstɚd/","extraExplanation":["英语里也常写作“re-registered”（加连字符），尤其在正式写作中用来避免读者把“reregister”误读为“register”。两种拼写通常意思相同，按机构/风格指南要求选择即可。"]}
{"word":"reregistering","summary":{"en":"“Reregistering” means registering again, often to update, renew, or restore a registration in official or technical systems.","zh":"“reregistering”表示“重新登记/重新注册”，常用于信息更新、续期，或在官方/技术系统中恢复登记状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"registering again; going through a registration process a second time (often because details changed, a registration expired, or a system requires renewal).","zh":"重新登记；再次进行注册流程（常因信息变更、登记过期，或系统要求续办/更新）。"},"examples":[{"en":"I’m reregistering my car because I moved to a new state.","zh":"我正在重新登记我的车，因为我搬到了另一个州。"},{"en":"Some students are reregistering for classes after changing their schedules.","zh":"一些学生在改课表后正在重新注册课程。"},{"en":"The app logged me out, so I’m reregistering my device.","zh":"这个应用把我登出了，所以我正在重新注册我的设备。"}]},{"partOfSpeech":"v.","definition":{"en":"(Computing/technical) registering again with a system so it recognizes something—such as a device, account, license, or software component—after an update or reset.","zh":"（计算机/技术）在更新或重置后再次向系统登记，使系统重新识别设备、账号、许可证或软件组件等。"},"examples":[{"en":"After the update, the printer stopped working until I finished reregistering it.","zh":"更新后打印机不能用了，直到我把它重新注册好才恢复。"},{"en":"Try reregistering the license if the software says it can’t be verified.","zh":"如果软件提示无法验证许可证，试试重新注册许可证。"}]}],"synonyms":["registering again","renewing registration","re-enrolling","reapplying","re-signing up"],"phonetic":"ˌriːˈrɛdʒɪstərɪŋ","extraExplanation":["“reregistering”来自动词“reregister”（re- 表示“再次” + register 表示“登记/注册”）。在日常语境里常见于：车辆/选民登记、课程注册、会员续办；在技术语境里常见于：设备重新绑定、账号重新登记、软件许可证重新激活等。","拼写上也常见作“re-registering”（加连字符更清楚），两种写法通常都能接受，取决于机构/编辑风格。"]}
{"word":"reregisters","summary":{"en":"“Reregisters” means “registers again,” commonly used for renewing or repeating an official registration.","zh":"“reregisters” 意为“再次登记/重新注册”，常用于续办或重复办理正式注册。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"registers again; records or enrolls someone or something again (often because a previous registration expired or details changed).","zh":"再次登记；把某人或某物重新注册/重新备案（常因旧登记到期或信息变更）。"},"examples":[{"en":"She reregisters her car every year in her home state.","zh":"她每年都在本州给自己的车重新注册。"},{"en":"The system automatically reregisters the device after a software update.","zh":"系统会在软件更新后自动为该设备重新登记。"}]},{"partOfSpeech":"v.","definition":{"en":"(about a signal, measurement, or device) registers again; shows a reading again.","zh":"（指信号、测量值或设备）再次显示/再次记录读数。"},"examples":[{"en":"After the reset, the meter reregisters the correct temperature.","zh":"重置后，仪表再次显示正确的温度。"}]}],"synonyms":["registers again","renews (registration)","re-enrolls","reenters","re-submits (registration)"],"phonetic":"/ˌriːˈrɛdʒɪstərz/","extraExplanation":["“reregisters” 是动词 “reregister” 的第三人称单数（he/she/it reregisters）。常见于正式语境：车辆上牌、选民登记、课程注册、设备/软件授权登记等。","构词：re-（再次）+ register（登记/注册）。英语里 re- 常表示“重新做一次”，如 reapply（重新申请）、renew（续期/更新）。","拼写提示：美式英语常用 reregister（双 re-）；也有人写作 re-register（加连字符）来避免读起来拗口，两者意思相同。"]}
{"word":"reregistration","summary":{"en":"Reregistration means registering again, usually for renewal or to update information.","zh":"reregistration 指“再次注册/重新登记”，多用于续期或更新信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of registering again, often because information has changed or a previous registration expired.","zh":"重新登记；再次注册（通常因信息变更或原登记过期）。"},"examples":[{"en":"Students must complete reregistration each semester to confirm their course choices.","zh":"学生每学期都必须完成重新注册，以确认选课。"},{"en":"If you change your address, reregistration may be required for your vehicle.","zh":"如果你更改了地址，你的车辆可能需要重新登记。"}]}],"synonyms":["re-registration","renewal","re-enrollment","reapplication"],"phonetic":"/ˌriːˌrɛdʒəˈstreɪʃən/","extraExplanation":["这个词常见于比较正式的场景（学校、政府机构、会员系统等）。在日常口语里，人们更常说 re-register / register again，名词也常写作 re-registration（带连字符）或 reregistration（不带连字符），两者意思相同。","构词：re-（再、重新）+ registration（登记、注册）。拼写上有时会出现连字符，是为了更易读，并不改变含义。"]}
{"word":"reregulate","summary":{"en":"“Reregulate” means to regulate again, often after deregulation or policy changes.","zh":"“reregulate”指再次监管或重新制定/调整管制，常发生在放松管制或政策变动之后。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to regulate again; to bring something back under rules, control, or official standards after it has been changed or loosened","zh":"再次监管；重新制定规则或恢复管制（通常在规则被改变或放松之后）"},"examples":[{"en":"After the market crisis, the government decided to reregulate the financial industry.","zh":"市场危机之后，政府决定重新监管金融行业。"},{"en":"Some voters want to reregulate utilities to keep prices stable.","zh":"一些选民希望重新监管公共事业，以保持价格稳定。"}]},{"partOfSpeech":"vt.","definition":{"en":"to adjust or fine-tune regulation again to make it work better","zh":"再次调整监管措施；重新校准规则以让其更有效"},"examples":[{"en":"The agency reregulated the policy to close loopholes.","zh":"该机构重新调整政策以堵住漏洞。"},{"en":"We may need to reregulate the process if safety standards change.","zh":"如果安全标准改变，我们可能需要重新调整流程的监管。"}]}],"synonyms":["regulate again","reimpose regulation","tighten regulation","restore regulation"],"phonetic":"/ˌriˈrɛɡjəˌleɪt/","extraExplanation":["“reregulate”由前缀 re-（再、重新）+ regulate（监管、调控）构成，常见于政治、经济与公共政策语境，用来对比 deregulate（放松管制、解除监管）。在新闻与学术写作中更常见，日常口语里也可以用 “regulate again / bring back regulation” 来表达同样意思。"]}
{"word":"reregulated","summary":{"en":"Reregulated means regulated again—usually after rules were loosened or removed—often with new or stricter controls.","zh":"reregulated 指“再次/重新受到监管”，通常发生在监管曾被放松或取消之后，并常伴随新的或更严格的规定。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of reregulate) to regulate again, often by changing existing rules after they have been loosened, removed, or shown to be ineffective.","zh":"（reregulate 的过去式/过去分词）再次进行监管；通常指在规则被放松、取消或证明无效后，重新制定或加强规章。"},"examples":[{"en":"After several accidents, the industry was reregulated to improve safety.","zh":"发生几起事故后，该行业被重新监管以提高安全性。"},{"en":"The government reregulated parts of the financial market after the crisis.","zh":"金融危机后，政府对金融市场的部分领域重新实施监管。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that has been regulated again (under new or renewed rules).","zh":"（形容词）指在新规则或恢复的规则下被再次监管的。"},"examples":[{"en":"The reregulated market required clearer labeling and stricter inspections.","zh":"重新监管后的市场要求更清晰的标签和更严格的检查。"},{"en":"In the reregulated sector, companies must report emissions every month.","zh":"在重新监管的领域，公司必须每月报告排放数据。"}]}],"synonyms":["re-regulated","regulated again","recontrolled","reimposed (controls)"],"phonetic":"/ˌriˈrɛɡjəˌleɪtɪd/","extraExplanation":["“reregulate”常见于公共政策与经济新闻语境，尤其谈到金融、能源、电信、交通、食品药品等行业。它通常暗示先前经历过“deregulation（放松监管/去监管）”，随后因风险、事故或市场失灵而“再监管”。注意区别：re-regulate（再次监管）≠ regulate better（监管得更好）；前者强调“再次/重新”，后者强调“改进程度”。"]}
{"word":"reregulating","summary":{"en":"“Reregulating” means regulating or adjusting something again, especially rules, controls, or settings.","zh":"“reregulating”指对某事物再次进行监管或调节，尤其是规则、管控措施或系统参数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of reregulate) adjusting rules, controls, or settings again—often to correct problems or respond to new conditions.","zh":"（reregulate 的现在分词）再次调整规则、管控或设置——常用于纠正问题或应对新情况。"},"examples":[{"en":"The agency is reregulating the industry after a series of safety failures.","zh":"在一系列安全事故之后，该机构正在对该行业重新监管。"},{"en":"Engineers are reregulating the system to keep the temperature stable.","zh":"工程师正在重新调节系统，以保持温度稳定。"},{"en":"The city is reregulating short-term rentals to protect long-term housing.","zh":"该市正在重新规范短租，以保护长期住房。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) controlling or managing something again in a careful, rule-based way.","zh":"（较少见）以更谨慎、更强调规则的方式再次控制或管理某事物。"},"examples":[{"en":"After the merger, the team is reregulating internal workflows and approvals.","zh":"合并之后，团队正在重新规范内部流程和审批。"}]}],"synonyms":["re-regulating","readjusting","recalibrating","revising regulations","tightening oversight"],"phonetic":"/ˌriːˈrɛɡjəˌleɪtɪŋ/","extraExplanation":["“reregulating”由前缀 re-（再次、重新）+ regulate（管理/调节/监管）构成，常见于政策与技术语境：政策里多指“重新监管/再规制”，技术里多指“重新调节参数”。","在公共讨论中，“reregulate”常暗示先前经历过放松监管（deregulate），后来因问题出现而再次加强或重设规则。"]}
{"word":"reregulation","summary":{"en":"Reregulation means regulating something again, usually by bringing back or updating rules.","zh":"Reregulation 指“重新监管”，通常是通过恢复或更新规则来再次进行管制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of regulating something again, often by introducing new rules after rules were removed or changed","zh":"重新监管；再次制定或加强规章制度（常指在放松管制后重新引入或调整规则）"},"examples":[{"en":"After the crisis, many people called for reregulation of the financial industry.","zh":"危机之后，许多人呼吁对金融行业重新监管。"},{"en":"The government’s reregulation focused on safety standards and consumer protection.","zh":"政府的重新监管重点放在安全标准和消费者保护上。"}]}],"synonyms":["renewed regulation","reimposition of regulations","regulatory reform","tightened oversight"],"phonetic":"/ˌriˌrɛɡjəˈleɪʃən/","extraExplanation":["“reregulation”多见于公共政策、经济与法律语境，常与“deregulation（放松管制/解除监管）”形成对比：先放松，再因风险或问题出现而“重新监管”。","构词法：re-（再次）+ regulation（监管/规章）。在写作中也可能写作“re-regulation”。"]}
{"word":"rereign","summary":{"en":"“Rereign” means to reign again or return to rule (very rare in modern English).","zh":"“rereign”表示“再次统治、重新掌权”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To reign again; to return to power as ruler after a break.","zh":"（罕用）再次统治；在中断后重新掌权、再度为王。"},"examples":[{"en":"After years in exile, the king returned to rereign.","zh":"流亡多年后，国王归来再度统治。"},{"en":"The novel imagines a fallen dynasty trying to rereign.","zh":"这部小说想象了一个没落王朝试图再次执政。"}]}],"synonyms":["reign again","return to power","retake the throne","restore the monarchy"],"phonetic":"/riˈreɪn/","extraExplanation":["“rereign”由前缀 re-（再一次）+ reign（统治）构成，但在现代英语里非常少见。通常更自然的说法是：**reign again**（再次统治）或 **return to the throne**（重返王位）。","常见易混淆：**reign**（统治）vs **rein**（马缰绳）vs **rain**（下雨），三者同音 /reɪn/，但意思完全不同。","多用于历史/文学语境，用来强调“复辟、重掌权力”的戏剧性。"]}
{"word":"rerelease","summary":{"en":"“Rerelease” means to release something again, or the new version that is released again.","zh":"“rerelease”指把某物再次发行/发布，也可指这次再发行的版本（再版/重映）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to release (a product, movie, song, book, etc.) again, often in a new edition, format, or time period","zh":"（将产品、电影、歌曲、书等）再次发行/再发布，常伴随新版、不同格式或在不同时间推出"},"examples":[{"en":"The studio will rerelease the movie in theaters for its 20th anniversary.","zh":"片方将为纪念上映20周年把这部电影重新在影院上映。"},{"en":"They rereleased the album on vinyl with bonus tracks.","zh":"他们把这张专辑以黑胶形式再版发行，并加收了加赠曲目。"}]},{"partOfSpeech":"n.","definition":{"en":"a new release of something that was released before","zh":"再发行；再版；再次发布（的版本）"},"examples":[{"en":"The rerelease includes restored audio and new artwork.","zh":"这次再版包含修复过的音频和新的封面设计。"},{"en":"Fans are excited about the rerelease of the classic game.","zh":"粉丝们对这款经典游戏的再发行很兴奋。"}]}],"synonyms":["reissue","relaunch","republish","reprint","reopen"],"phonetic":"/ˌriːrɪˈliːs/","extraExplanation":["在娱乐与出版领域，rerelease 常用于“院线重映”“周年纪念版”“修复版”“豪华版”等场景；也可用于软件/游戏的“复刻再发行”。","拼写上常见两种形式：rerelease（美式写法常见）与 re-release（用连字符更清晰）。发音与重音通常落在第二部分：re-RE-lease。"]}
{"word":"reremice","summary":{"en":"“Reremice” isn’t a standard word; you probably mean “reminisce” = to remember and talk about the past, often fondly.","zh":"“reremice”不是标准英语词；你可能想写“reminisce”，意为（常带怀旧地）回忆并谈论往事。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word.) Likely a misspelling of “reminisce,” meaning to think or talk about pleasant memories from the past.","zh":"（不是标准英语单词。）很可能是“reminisce”的拼写错误，意思是回忆、追忆过去（常指愉快的回忆）。"},"examples":[{"en":"I think you meant “reminisce”: We reminisced about our school days.","zh":"我猜你想写的是“reminisce”：我们一起追忆学生时代。"},{"en":"She likes to reminisce with old friends over tea.","zh":"她喜欢和老朋友喝茶聊天、回忆往事。"}]},{"partOfSpeech":"vi.","definition":{"en":"(reminisce) to think about past experiences, often with warmth or nostalgia.","zh":"（reminisce）回想过去的经历，常带温情或怀旧之感。"},"examples":[{"en":"On holidays, he often reminisces about his childhood.","zh":"在节假日，他常常回忆自己的童年。"},{"en":"They reminisced for hours about their first jobs.","zh":"他们聊了好几个小时，回忆第一份工作。"}]},{"partOfSpeech":"vt.","definition":{"en":"(reminisce) to tell someone about your memories; to recall out loud.","zh":"（reminisce）向别人讲述回忆；把往事说出来。"},"examples":[{"en":"Grandpa reminisced about life during the war.","zh":"爷爷讲起了战争年代的生活。"},{"en":"She reminisced that the town used to be much quieter.","zh":"她回忆说，这个小镇以前安静得多。"}]}],"synonyms":["remember","recall","look back (on)","think back (on)","recollect"],"phonetic":"/ˌrɛmɪˈnɪs/","extraExplanation":["“reminisce”来自拉丁语词根，和“memory（记忆）”相关。它常带有温柔、怀旧的情绪色彩；如果只是中性地“回想”，也可以用“remember/recall”。","常见搭配：reminisce about + 往事（reminisce about college days）；reminisce with + 某人（reminisce with friends）。"]}
{"word":"reremind","summary":{"en":"“Re-remind” means to remind someone again.","zh":"“re-remind”表示“再提醒一次”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remind someone again; to bring something back to someone’s attention once more","zh":"再提醒；重新提醒某人（把某事再次提出来让对方注意）"},"examples":[{"en":"Can you re-remind me to call the doctor tomorrow?","zh":"你能明天再提醒我给医生打电话吗？"},{"en":"I’ll re-remind the team about the deadline at the end of the meeting.","zh":"我会在会议结束时再提醒团队截止日期。"}]}],"synonyms":["remind again","give a reminder","prompt again"],"phonetic":"ˌriːrɪˈmaɪnd","extraExplanation":["“reremind”不是常见的标准拼写，更常见写法是 **re-remind**（加连字符）或直接用 **remind again**。在正式写作里一般避免“reremind”。","前缀 **re-** 表示“再次、重新”。当后面接的词以 r 开头时，常用连字符（re-remind）来让阅读更清晰。"]}
{"word":"reremmice","summary":{"en":"“Reminisce” means to think or talk about past experiences, often in a nostalgic way.","zh":"“reminisce” 指回忆或谈论过去的经历，常带怀旧情绪。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to talk or think about pleasant memories from the past, often with some nostalgia","zh":"回忆往事；追忆（常带怀旧情绪）"},"examples":[{"en":"We sat by the fire and reminisced about our school days.","zh":"我们坐在火炉旁，追忆学生时代的日子。"},{"en":"She likes to reminisce about her first job in New York.","zh":"她喜欢回忆自己在纽约的第一份工作。"},{"en":"The photo made me reminisce about my grandparents.","zh":"那张照片让我想起了祖父母。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to remember something from the past (less common)","zh":"使某人回忆起（较少见用法）"},"examples":[{"en":"That song always reminisces him of his hometown.","zh":"那首歌总让他想起家乡。"}]}],"synonyms":["remember","recall","look back","think back","reflect"],"phonetic":"/ˌrɛmɪˈnɪs/","extraExplanation":["你输入的“reremmice”很可能是拼写错误，正确拼写通常是 **reminisce**。","**reminisce** 常与介词 **about** 连用（reminisce about + 往事）。","这个词带有“温柔地回想、带点怀旧”的语感；如果只是“想起/记起”，更常用 **remember** 或 **recall**。"]}
{"word":"reremouse","summary":{"en":"“Reremouse” isn’t a standard English word; it’s likely a typo or a name.","zh":"“Reremouse”不是标准英语词；更可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it does not appear in common dictionaries. It may be a misspelling, a made-up word, a username, or a typing error.","zh":"不是标准英语词汇；常见词典中通常找不到。可能是拼写错误、造词、用户名，或输入错误。"},"examples":[{"en":"I couldn’t find “reremouse” in a dictionary—did you mean “dormouse”?","zh":"我在词典里找不到“reremouse”——你是不是想说“dormouse（睡鼠）”？"},{"en":"If “reremouse” is a name in a game, it may not have a dictionary meaning.","zh":"如果“reremouse”是游戏里的名字，它可能没有词典释义。"}]}],"phonetic":"/ˈriːriːmaʊs/","extraExplanation":["“reremouse”很可能是拼写偏差或键盘误触。你可以检查：是否想输入 **dormouse**（睡鼠，常见于《爱丽丝梦游仙境》里）、**mouse**（老鼠/鼠标）、或某个专有名词（账号名、角色名、项目名）。","如果你告诉我它出现的句子/语境（聊天、文章、游戏、代码等），我可以更准确判断它原本想表达的词，并给出正确释义与用法。"]}
{"word":"rerent","summary":{"en":"Rerent means to rent something again, or to rent it out again (sometimes: to sublet).","zh":"Rerent 指“再次出租”，有时也指“转租（把租来的再租给别人）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rent (a property) again, often to a new tenant after the previous rental ends","zh":"再次出租（房产），通常是在上一位租客结束租约后租给新租客"},"examples":[{"en":"After the tenants moved out, the landlord rerented the apartment within two weeks.","zh":"租客搬走后，房东在两周内就把公寓再次出租了。"},{"en":"They cleaned and repainted the room so they could rerent it quickly.","zh":"他们把房间打扫并重新粉刷，以便能尽快再次出租。"}]},{"partOfSpeech":"v.","definition":{"en":"to rent out something you rent from someone else to another person (often called sublet)","zh":"把自己租来的东西再出租给别人（常称为转租）"},"examples":[{"en":"The contract says you can’t rerent the house without the owner’s permission.","zh":"合同规定未经房东同意不得把房子转租出去。"},{"en":"She rerented her parking space to a coworker for the summer.","zh":"她把自己租的车位在夏天转租给了一位同事。"}]}],"synonyms":["re-rent","rent again","lease again","sublet","sublease"],"phonetic":"/ˌriːˈrɛnt/","extraExplanation":["“rerent”常写作“re-rent”（带连字符），在房产/租赁语境中更常见。","表示“把自己租来的房子再租给别人”时，日常英语里更常用“sublet / sublease（转租）”，而“rerent”有时也指“房东再次出租”。具体含义常由语境或合同条款决定。"]}
{"word":"rerental","summary":{"en":"“Rerental” means renting something again or a second/subsequent rental period, especially in business contexts.","zh":"“Rerental”指再次出租或第二次/后续租期，常用于租赁行业的业务语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of renting something again, or a second/subsequent rental period (often after an item has been returned and rented to a new customer)","zh":"再次出租；二次/续租（常指物品归还后又租给另一位客户，或进入下一段租期）"},"examples":[{"en":"The company cleaned and inspected the car before putting it back into rerental.","zh":"公司在把车重新投入再次出租前进行了清洁和检查。"},{"en":"There is a discount for rerental customers who rent the same equipment again within 30 days.","zh":"在30天内再次租同一设备的客户可享受二次租赁折扣。"}]}],"synonyms":["re-rental","repeat rental","renewal (for extending a rental)"],"phonetic":"/ˌriˈrɛntəl/","extraExplanation":["“rerental”常见于租赁行业的书面语/业务用语（如汽车租赁、设备租赁、服装道具租赁）。它强调“同一物品被再次租出去”这一状态或流程。","日常口语里更常说：rent it again / rent again / renew the rental（续租时）/ re-rent（动词，较少见但可用）。注意：re-rental（带连字符）和rerental（不带连字符）都能见到。"]}
{"word":"rerepeat","summary":{"en":"“Rerepeat” means to repeat something again (an extra repetition), but it’s uncommon; “repeat” or “say that again” is more natural.","zh":"“rerepeat”表示“再重复一次”，但不太常见；更自然的说法是“repeat”或“say that again”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to repeat again; to say, do, or play something one more time (often because the first repeat wasn’t clear or correct)","zh":"再次重复；把某事又说/做/播放一遍（常因前一次重复仍不清楚或不正确）"},"examples":[{"en":"Sorry—I didn’t catch that. Could you re-repeat the last sentence?","zh":"不好意思，我没听清。你能把最后一句再重复一遍吗？"},{"en":"The teacher asked him to re-repeat the answer more slowly.","zh":"老师让他把答案再重复一遍，说慢一点。"}]}],"synonyms":["repeat","say again","repeat once more","restate"],"phonetic":"/ˌriːrɪˈpiːt/","extraExplanation":["“rerepeat”在标准英语里不太常见，更常用的是“repeat again”（口语里可能显得多余）或“repeat once more / say that again / repeat that”。如果你在写正式文章，建议用“repeat”或“restate”（更偏“换个说法再讲一遍”）。","构词上可理解为“re-（再）+ repeat（重复）”，表达“又重复一次”。在口语中偶尔会出现，尤其在强调“已经重复过但还要再来一次”时。"]}
{"word":"reresupper","summary":{"en":"“Reresupper” is not a standard English word; it’s likely a misspelling or an invented form meaning “have supper again.”","zh":"“reresupper”不是标准英语词，可能是拼写错误或自造词，勉强可理解为“再吃一次晚饭”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a nonstandard/invented form. If you meant “re-supper,” it would mean “to have supper again,” but this is very rare in real usage.","zh":"不是标准英语单词，可能是拼写错误或自造词。如果你想表达“re-supper（再吃一次晚饭）”，这个用法也非常少见、很不地道。"},"examples":[{"en":"I can’t find “reresupper” in a dictionary—did you mean “resurrect” or “resupply”?","zh":"我在词典里找不到“reresupper”——你是不是想写“resurrect（复活/使恢复）”或“resupply（补给）”？"},{"en":"If you mean eating again, you could say: “We had a late-night snack,” instead of “We reresupper.”","zh":"如果你是说又吃了一次，可以说：“We had a late-night snack（我们吃了个夜宵）”，而不是“We reresupper”。"}]}],"synonyms":["have supper again","eat dinner again","have a late-night snack"],"phonetic":"/ˌriːriˈsʌpər/","extraExplanation":["“reresupper”看起来像把前缀 re-（“再次”）和 supper（“晚饭”）硬拼在一起，甚至重复了 re-。英语里虽然可以临时造词让人理解，但正式写作或日常交流更常用：have supper again / eat dinner again，或根据情境用 have a late-night snack（吃夜宵）、have a second dinner（吃第二顿晚饭，较口语/幽默）。","如果你告诉我它出现的句子或来源（比如小说、游戏ID、聊天内容），我可以更准确判断你原本想查的词。"]}
{"word":"rereview","summary":{"en":"Rereview means to review something again to double-check or reconsider it.","zh":"Rereview 指对某事再审阅一次，用于复核或重新评估。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to review something again, often to check for mistakes or to reconsider a decision","zh":"再次审阅；复核；重新评估（通常为查错或重新考虑决定）"},"examples":[{"en":"Please rereview the report before you send it to the client.","zh":"请在把报告发给客户之前再复核一遍。"},{"en":"The committee will rereview the case after receiving new evidence.","zh":"委员会在收到新证据后会重新审查该案件。"}]}],"synonyms":["review again","reexamine","reassess","recheck"],"phonetic":"/ˌriːrɪˈvjuː/","extraExplanation":["“re-”是常见前缀，表示“再次/重新”。所以“rereview”字面意思就是“再 review 一次”。在正式写作中，人们也常用“review again”或“re-examine / reassess”来避免连续两个 re- 的视觉重复，但“rereview”在商务邮件、流程文件里依然很常见。"]}
{"word":"rereward","summary":{"en":"“Rereward” means to reward someone again (an additional reward). It is uncommon in everyday English.","zh":"“rereward”表示“再次奖励/再给一次报酬”，但在日常英语中很少用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to reward someone again; to give an additional reward for something already rewarded","zh":"再次奖赏；再给予报酬（对已获得奖励的行为再给一次奖励）"},"examples":[{"en":"The company decided to rereward top performers with an extra bonus at the end of the year.","zh":"公司决定在年末给表现最好的员工再奖励一笔额外奖金。"},{"en":"If the goal is met early, we may rereward the team for their effort.","zh":"如果提前达成目标，我们可能会再奖励团队的努力。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reward again in a repeated or ongoing way (less common)","zh":"反复奖赏；一再奖励（较少见）"},"examples":[{"en":"In some games, players are rerewarded each time they complete the same challenge.","zh":"在一些游戏里，玩家每次完成同一挑战都会再次获得奖励。"}]}],"synonyms":["reward again","give another reward","recompense","bonus"],"phonetic":"/ˌriˈrɪwɔrd/","extraExplanation":["“rereward”在现代英语中非常少见，更多时候人们会用“reward again”“give another reward”或“recompense”。如果你是想表达常见的“奖励/报酬”，最可能的拼写是“reward”。"]}
{"word":"rerewards","summary":{"en":"Reward means a benefit or prize you receive for good behavior or achievement, or the act of giving such a benefit.","zh":"Reward 指因良好行为或成就而得到的奖励/回报，也可指给予奖励这一行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something you receive because you did something good, worked hard, or achieved a goal","zh":"因表现良好、努力工作或达成目标而获得的奖励；回报"},"examples":[{"en":"The reward for finishing the project early was a day off.","zh":"提前完成项目的奖励是放一天假。"},{"en":"Some apps offer rewards like points or coupons.","zh":"一些应用会提供积分或优惠券等奖励。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone something good because they did something you approve of","zh":"奖励（某人）；因值得肯定的行为而给予好处"},"examples":[{"en":"They rewarded her for her honesty.","zh":"他们因为她的诚实而奖励她。"},{"en":"Good teachers reward effort, not just talent.","zh":"好的老师会奖励努力，而不只是天赋。"}]},{"partOfSpeech":"v.","definition":{"en":"to produce a good result for someone (often used with “efforts” or “work” as the subject)","zh":"带来回报；得到好结果（常以“努力/付出”等为主语）"},"examples":[{"en":"Hard work often rewards you in the long run.","zh":"从长远来看，努力工作往往会带来回报。"}]}],"synonyms":["prize","award","benefit","payoff","compensate"],"phonetic":"/rɪˈwɔrd/","extraExplanation":["你输入的“rerewards”不太常见，最可能是拼写成了“rewards”（reward 的复数，或动词第三人称单数）。如果你想表达“再次奖励”，英语更自然的说法通常是“reward again”或“re-reward”（较少见）。"]}
{"word":"rerig","summary":{"en":"Rerig means to set up or equip something again, often with a new or repaired arrangement.","zh":"Rerig 指把某物重新装配或重新设置，常用于修复或改成新的配置。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to rig again; to set up, adjust, or equip something again (often after it has been changed, damaged, or needs a new configuration).","zh":"重新装配；再次设置/调整设备或装置（常指改动、损坏后，或需要换一种配置）。"},"examples":[{"en":"After the storm, the crew had to rerig the sails before they could continue.","zh":"暴风雨过后，船员必须重新装配帆具，才能继续航行。"},{"en":"We rerigged the lights for the new stage layout.","zh":"为了新的舞台布局，我们把灯光重新布置了一遍。"},{"en":"The technician rerigged the camera on a sturdier mount.","zh":"技术员把相机重新装到更稳固的支架上。"}]}],"synonyms":["reconfigure","reset up","reassemble","refit","reinstall"],"phonetic":"/ˌriˈrɪɡ/","extraExplanation":["“rig”原本常见于航海语境，指船的“索具/帆装”（rigging）；后来也广泛用于“安装、装备、临时搭建装置”。“rerig”就是在此基础上加上re-（再次）形成的动词，常见于航海、舞台灯光、摄影器材、工程安装等场景。"]}
{"word":"rering","summary":{"en":"Rering (often written re-ring) means to ring again, and it can also mean to reset a gemstone into a new ring setting.","zh":"rering（常写作 re-ring）指“再次响铃/再按一次”，也可指“把宝石重新改镶到新的戒托/戒指上”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to ring again; to make a bell, phone, or alarm sound a second time","zh":"再次响铃；让铃声/电话/警报再响一次"},"examples":[{"en":"If no one answers, please re-ring the bell.","zh":"如果没人应门，请再按一次门铃。"},{"en":"I had to re-ring because the call dropped.","zh":"通话断了，我只好再拨一次。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put a new ring on something, especially to reset a gemstone into a different ring setting","zh":"重新配戒托/换戒台；（尤指）把宝石改镶到新的戒指款式上"},"examples":[{"en":"She decided to re-ring the diamond after the band broke.","zh":"戒圈断了之后，她决定把那颗钻石重新改镶。"},{"en":"The jeweler can re-ring the stone in a modern setting.","zh":"珠宝匠可以把这颗宝石改镶到更现代的戒托里。"}]}],"synonyms":["ring again","call back","redial","reset (a stone)","remount"],"phonetic":"/ˌriˈrɪŋ/","extraExplanation":["“rering”更常见的写法是带连字符的“re-ring”，意思更清楚：re-（再次）+ ring（响铃/按铃）。在书面英语里建议写成“re-ring”。","第二个含义（珠宝改镶）属于较专业的用法，更常见的表达还有“reset (a stone)”或“remount (a diamond)”（把宝石重新镶嵌/换戒托）。"]}
{"word":"rerise","summary":{"en":"“Rerise” means to rise again (or, rarely, to raise something again). It’s uncommon; “rise again” is more natural.","zh":"“Rerise”表示“再次升起/回升”（或较少见地表示“使再次升起”）。这个词不常用，更自然的是“rise again”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to rise again; to go up or stand up again after falling or lowering","zh":"再次升起；（跌倒、降低后）再度上升或重新站起"},"examples":[{"en":"After the price dropped in June, it began to rerise in July.","zh":"价格在六月下跌后，七月开始回升。"},{"en":"The sun seemed to rerise after the storm clouds passed.","zh":"暴风雨的乌云散去后，太阳仿佛又升了起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to rise again; to raise again (rare)","zh":"使再次升起；再度抬起（较少用）"},"examples":[{"en":"The crane operator rerised the platform to its original height.","zh":"吊车操作员把平台再次升到原来的高度。"}]}],"synonyms":["rise again","rebound","recover","increase again","climb back"],"phonetic":"/ˌriˈraɪz/","extraExplanation":["“rerise”由前缀 re-（再次）+ rise（上升）构成，但在现代英语中并不常见。更自然的表达通常是 “rise again / rise back / rebound / recover”。在诗歌或较文学化的语境里，作者可能用 “rerise” 来强调“再度升起”的画面感或节奏。"]}
{"word":"rerisen","summary":{"en":"“Rerisen” means “risen again,” either literally (the sun/moon) or figuratively (hope/confidence returning).","zh":"“rerisen”意为“再次升起/再度出现”，既可指字面上的升起（如日月），也可指抽象事物的复苏（如希望、自信）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past participle of “rerise”) to have risen again; to rise a second time after falling, sinking, or ending.","zh":"（“rerise”的过去分词）再次升起；在下降、沉没或结束之后再度上升/出现。"},"examples":[{"en":"After the storm, the sun had rerisen above the clouds.","zh":"暴风雨过后，太阳又从云层上方升起。"},{"en":"Hope, once lost, seemed to have rerisen in the community.","zh":"曾经失去的希望似乎在社区里再次升起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) having risen again; returned or renewed after a decline or disappearance.","zh":"（形容词）再度升起的；（在衰落或消失后）复苏的、重新出现的。"},"examples":[{"en":"The rerisen moon lit the quiet street.","zh":"重新升起的月亮照亮了安静的街道。"},{"en":"She spoke with rerisen confidence.","zh":"她带着重新找回的自信说话。"}]}],"synonyms":["risen again","risen anew","returned","revived","renewed"],"phonetic":"/riˈraɪzən/","extraExplanation":["“rerisen”比较少见，更常见的说法是“risen again / risen anew / returned”。在宗教或文学语境里，有时也会用“risen again”来指“复活”（如基督教语境中的复活），但日常英语里更自然的表达仍是“risen again”。","拼写上常见两种：不加连字符的“rerisen”和带连字符的“re-risen”。带连字符时更强调“再次”这一层意思。"]}
{"word":"rerises","summary":{"en":"“Rerises” means “rises again” (literally or figuratively).","zh":"“rerises”表示“再次升起/再次上升”，也可指“重新崛起”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “rerise”) to rise again; to go up again after falling, setting, or being lowered.","zh":"（动词“rerise”的第三人称单数）再次升起；在下降、落下、落山或被放低之后再度上升。"},"examples":[{"en":"After the stock market falls, it sometimes rerises in the following weeks.","zh":"股市下跌后，有时会在接下来的几周再次回升。"},{"en":"The sun rerises every morning, even after the darkest night.","zh":"即使经历最黑暗的夜晚，太阳每天早晨仍会再次升起。"}]},{"partOfSpeech":"v.","definition":{"en":"to regain status, power, or influence after a decline.","zh":"（比喻）在衰落之后重新崛起；恢复地位、权力或影响力。"},"examples":[{"en":"The team rerises as a championship contender after a few tough seasons.","zh":"经历几个艰难赛季后，这支球队重新崛起，成为冠军有力竞争者。"},{"en":"Old ideas sometimes fade, then rerises in a new form.","zh":"旧观念有时会消退，然后以新的形式再度兴起。"}]}],"synonyms":["rises again","rises once more","rebounds","returns","reappears","revives"],"phonetic":"/ˌriˈraɪzɪz/","extraExplanation":["“rerises”是“rerise”的第三人称单数（he/she/it rerises）。更常见的表达是“rises again”或“rises once more”；“rerise”本身较少见，写作中用来强调“再次上升/复起”的动作。","词形：rerise（原形）/ rerises（第三人称单数）/ rerose（过去式，较少见）/ rerisen（过去分词，较少见）/ rerising（现在分词）。"]}
{"word":"rerising","summary":{"en":"“Rerising” means rising again after a fall or pause; it can also describe something that is starting to rise again.","zh":"“rerising”表示在下降或停顿后再次上升；也可作形容词表示“回升中的/再度上升的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"rising again; becoming higher again after falling or pausing (the -ing form of “re-rise”).","zh":"再次上升；在下降或停顿后又变高（“re-rise”的 -ing 形式）。"},"examples":[{"en":"After a brief dip, prices are rerising this month.","zh":"短暂下跌后，这个月价格又在回升。"},{"en":"The report warns of rerising inflation later in the year.","zh":"报告警告说今年晚些时候通胀可能再次上升。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) starting to rise again.","zh":"（作形容词）再次上升的；回升中的。"},"examples":[{"en":"Rerising tensions made the negotiations harder.","zh":"紧张局势再度升温，让谈判更困难。"},{"en":"She felt a rerising sense of hope after the good news.","zh":"听到好消息后，她感到希望又重新升起。"}]}],"synonyms":["rising again","resurging","rebounding","climbing again"],"phonetic":"/ˌriːˈraɪzɪŋ/","extraExplanation":["“rerising”通常写作“re-rising”（加连字符）更清楚，表示“再次上升”。不加连字符也能见到，但较少见。","它来自动词“rise”（上升）加前缀“re-”（再次）。注意：rise 是不及物动词（不直接带宾语）；如果要表达“把……抬高/提高”，通常用 raise。"]}
{"word":"rerival","summary":{"en":"Rival means a competitor (noun) or to compete with / be as good as (verb).","zh":"Rival 指“竞争对手”（名词），也可指“与……竞争/媲美”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, group, or thing that you compete with; a competitor","zh":"竞争对手；对手"},"examples":[{"en":"Our team’s main rival is the school across town.","zh":"我们球队的主要对手是城另一头的那所学校。"},{"en":"The two companies are rivals in the phone market.","zh":"这两家公司在手机市场上是竞争对手。"}]},{"partOfSpeech":"vt.","definition":{"en":"to compete with someone or something; to be almost as good or successful as","zh":"与……竞争；比得上（几乎同样好/成功）"},"examples":[{"en":"Small shops can’t always rival big online stores on price.","zh":"小店在价格上不一定能与大型网店竞争。"},{"en":"Her performance rivals the best singers in the world.","zh":"她的表演可与世界上最优秀的歌手媲美。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a strong desire to compete; related to competition between opponents","zh":"竞争的；对抗的"},"examples":[{"en":"They have a rival team in the same city.","zh":"他们在同一座城市里有一支竞争队。"}]}],"synonyms":["competitor","opponent","contender","match"],"phonetic":"/ˈraɪvəl/","extraExplanation":["“rerival” 不是常见英语单词，通常是拼写错误。你可能想写的是 **rival**（对手/竞争；比得上）或 **revival**（复兴、复苏）。如果你告诉我你想表达的中文意思或给我一句上下文，我可以帮你确认正确的词。"]}
{"word":"rerivet","summary":{"en":"“Rerivet” means to rivet something again, usually during repair or reassembly.","zh":"“rerivet”指把东西用铆钉再次固定，常见于修理或重新装配。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fasten something again with rivets; to repair by putting rivets back in place","zh":"（用铆钉）再次铆接；重新用铆钉固定（多用于修理）"},"examples":[{"en":"The mechanic reriveted the loose panel on the airplane wing.","zh":"维修工把飞机机翼上松动的面板重新铆接固定。"},{"en":"After the old rivets failed, the workers reriveted the joint for safety.","zh":"旧铆钉失效后，工人为安全起见把连接处重新铆接。"}]}],"synonyms":["refasten","resecure","refit","repair"],"phonetic":"ˌriˈrɪvɪt","extraExplanation":["“rerivet”由前缀 re-（再次）+ rivet（铆钉；用铆钉固定）构成，属于比较少见但很好理解的技术/维修用词。常见于机械、航空、建筑与金属加工等语境。"]}
{"word":"rerob","summary":{"en":"“Rerob” (rare) means to rob again.","zh":"“rerob”（罕见）意思是“再次抢劫/再抢一次”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare / informal) To rob again; to steal from someone a second time.","zh":"（罕见/非正式）再次抢劫；第二次从某人那里偷/抢走财物。"},"examples":[{"en":"The scammers rerobbed the same victims a week later.","zh":"这些骗子一周后又再次骗抢了同一批受害者。"},{"en":"After the first break-in, the shop owner worried someone might rerob the store.","zh":"第一次入室盗窃后，店主担心店铺可能会再次被抢。"}]}],"synonyms":["rob again","steal again","mug again"],"phonetic":"/ˌriˈrɑb/","extraExplanation":["“rerob”不是常见标准词，更常见的表达是“rob again”（再抢一次）或“be robbed again”（再次被抢）。在正式写作中建议用更清晰的说法。","词形上可以理解为前缀“re-”（再、重新）+ “rob”（抢劫）。"]}
{"word":"rerobe","summary":{"en":"Rerobe means to dress again—especially to put a robe or formal outfit back on—or to outfit someone with new robes.","zh":"Rerobe 指“再次穿衣”，尤其是重新披上长袍/礼服；也可指给某人重新配发或更换礼袍。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to dress again; to put clothes (often a robe or formal outfit) on again","zh":"再次穿衣；重新披上（常指长袍或正式服装）"},"examples":[{"en":"After the ceremony, he rerobed for the photos.","zh":"仪式结束后，他又重新穿上礼服拍照。"},{"en":"Please rerobe before returning to the stage.","zh":"请重新穿好衣服再回到舞台。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide (someone) with a new set of robes or formal clothing","zh":"给（某人）重新配发/更换长袍或礼服"},"examples":[{"en":"The choir was rerobed with new gowns this year.","zh":"今年合唱团换发了新礼袍。"}]}],"synonyms":["dress again","put on again","change back into (a robe)","reclothe"],"phonetic":"/riˈroʊb/","extraExplanation":["“rerobe”比较少见，多见于宗教、合唱团、毕业典礼、戏剧等场合，强调“重新穿上（仪式性服装）”或“换发礼袍”。","词形结构：re-（再次）+ robe（长袍/礼服）。在日常口语里更常用 put on (your robe/clothes) again 或 change back into your robe。"]}
{"word":"reroll","summary":{"en":"“Reroll” means to roll again—often a die in games—or to restart/redo in games to get a better result.","zh":"“Reroll”指“再掷一次（骰子）”，也常指游戏里为获得更好结果而“重开/重刷”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to roll (a die) again, usually to try to get a different or better result","zh":"（通常指为得到不同或更好的结果而）再掷一次（骰子）"},"examples":[{"en":"If you don’t like your number, you can reroll once.","zh":"如果你不喜欢掷出的点数，你可以再掷一次。"},{"en":"The rules say you may reroll any die that shows a 1.","zh":"规则说你可以把点数为 1 的骰子重新掷一次。"}]},{"partOfSpeech":"v.","definition":{"en":"(in video games) to restart or repeat a process to get better items, characters, or starting conditions","zh":"（电子游戏中）反复重开/重刷，以获得更好的道具、角色或开局条件"},"examples":[{"en":"Some players reroll for a strong character at the beginning.","zh":"有些玩家会为了开局抽到强力角色而反复重开。"},{"en":"I rerolled three times until I got the item I wanted.","zh":"我重开（重刷）了三次，直到拿到想要的道具。"}]},{"partOfSpeech":"n.","definition":{"en":"an additional roll of a die; a second attempt to roll again","zh":"再次掷骰；重掷（一次额外的掷骰机会）"},"examples":[{"en":"You get one free reroll per turn.","zh":"每回合你有一次免费的重掷机会。"}]}],"synonyms":["roll again","recast (dice)","retry","restart","redo"],"phonetic":"/ˌriːˈroʊl/","extraExplanation":["“reroll”由前缀 re-（再、重新）+ roll（掷/滚动）构成，最早常见于桌游/骰子语境。","在手游/抽卡文化里，“reroll”常指“反复开局刷初始”（中文里常说“重开/刷初始/重刷”）。语气通常偏口语、玩家圈用法。"]}
{"word":"rerolled","summary":{"en":"“Rerolled” means “rolled again” to get a new random result, especially in games.","zh":"“rerolled”表示“重新掷/重新随机一次”，多用于游戏语境获得新的随机结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"rolled again; did another random roll (often for dice, character stats, or a game’s random outcome).","zh":"重新掷（骰子）/重新随机（一次）；再次“roll”以得到新的结果（常见于桌游、游戏数值或随机掉落）。"},"examples":[{"en":"I rerolled the dice because the first roll fell off the table.","zh":"我重新掷了一次骰子，因为第一次掷的骰子掉到桌子下面了。"},{"en":"She rerolled her character stats until she got higher strength.","zh":"她反复重随机角色属性，直到刷到更高的力量值。"},{"en":"The loot was bad, so we rerolled and tried again.","zh":"掉落太差了，所以我们重新随机了一次再试。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense of reroll) to apply a new roll or cylinder to something again (less common; e.g., printing or manufacturing).","zh":"（较少见）再次装上或更换滚筒/滚轮；重新进行滚压/轧制等操作（如印刷、制造领域）。"},"examples":[{"en":"The printer rerolled the paper to remove wrinkles before printing.","zh":"印刷前，操作员把纸重新过了一遍滚筒以去除褶皱。"}]}],"synonyms":["rolled again","re-rolled","tried again","recast (dice)","re-randomized"],"phonetic":"/ˌriːˈroʊld/","extraExplanation":["“reroll”在英语网络语境里非常常见，尤其是桌游/跑团（D&D等）里“再掷一次骰子”，以及电子游戏里“重刷/重抽”随机结果（例如刷属性、刷词条、刷掉落，或抽卡类游戏里常说的“重开号/重刷开局”）。","拼写上也常见连字符形式“re-rolled”，意思相同；“rerolled”更偏口语/玩家用法。"]}
{"word":"reroller","summary":{"en":"Reroller usually means someone (or something) that rolls again—most often a person who rerolls dice in games; it can also mean a rerolling/rewinding machine in manufacturing.","zh":"Reroller 通常指“再掷/再滚一次”的人或物——最常见是游戏里会重掷骰子的人；也可指制造业中的复卷/再轧设备或操作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or tool) that rolls something again, especially someone who rolls dice again in a game.","zh":"重新掷（或滚）一次的人（或工具）；尤指在游戏中“再掷骰子”的人。"},"examples":[{"en":"Our cleric is a reroller, so bad dice luck doesn’t scare him.","zh":"我们的牧师是个“再掷党”，所以骰运差也吓不倒他。"},{"en":"The house rule limits each reroller to one extra roll per turn.","zh":"按房规，每位再掷骰子的人每回合只能多掷一次。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine or worker in manufacturing that rerolls material (such as paper, film, or metal) to form a new roll or improve the finish.","zh":"（制造业）将材料（如纸张、薄膜或金属）重新卷成一卷或再次轧制以改善表面的机器或操作人员。"},"examples":[{"en":"The reroller rewinds the film onto a clean core before packaging.","zh":"复卷机在包装前把薄膜重新卷到干净的卷芯上。"},{"en":"A reroller can help remove wrinkles during the reprocessing stage.","zh":"在再加工阶段，复卷设备有助于减少褶皱。"}]}],"synonyms":["reroll user","dice reroller","rewinder","rewinding machine"],"phonetic":"/ˌriːˈroʊlər/","extraExplanation":["“reroller”是由前缀 re-（再次）+ roll（滚动/掷）+ -er（做某事的人/物）构成的名词。","在桌游/跑团语境里，它常带点口语或调侃色彩，指喜欢或经常使用“重掷（reroll）”机制的人；正式写作中也常直接用 reroll / re-roll（动词/名词）来表达。"]}
{"word":"rerollers","summary":{"en":"Rerollers are people who repeatedly roll again or restart (often in games) to get a better result.","zh":"Rerollers 指为了更好的结果而反复重掷或反复重开（常见于游戏抽卡）的那些人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who repeatedly start over or roll again (especially in video games or gacha games) to get a better result, such as a rare character or a strong starting team.","zh":"（尤指电子游戏或抽卡/扭蛋游戏中）为了刷到更好的结果（如稀有角色、强力开局）而反复重开、反复“重抽/重刷”的人。"},"examples":[{"en":"Many rerollers kept restarting the game until they pulled a top-tier character.","zh":"很多重刷党不断重开游戏，直到抽到顶级角色。"},{"en":"The community guide is mainly for rerollers who want a strong beginner account.","zh":"这份社区攻略主要写给想要强力开局账号的重刷党。"}]},{"partOfSpeech":"n.","definition":{"en":"People who roll dice again to try for a better number or outcome.","zh":"（掷骰类游戏中）为了更好的点数或结果而再次掷骰的人。"},"examples":[{"en":"In this board game, rerollers can spend one token to roll again.","zh":"在这款桌游里，玩家可以花一枚代币来重新掷骰。"},{"en":"Rerollers often take more risks because they have a second chance.","zh":"能重掷的人往往更敢冒险，因为他们有第二次机会。"}]}],"synonyms":["re-starters","resetters","re-rollers","account rerollers"],"phonetic":"/ˌriːˈroʊlərz/","extraExplanation":["“reroller”来自动词短语 reroll（再掷一次/重抽一次）+ -er（表示“做某事的人”）。在手游抽卡文化里，reroll 通常指反复创建新账号或清档重来，只为在新手福利或首抽中刷到理想角色。它有时带一点调侃意味，但不一定是贬义。"]}
{"word":"rerolling","summary":{"en":"Rerolling means trying again for a new random result, especially by rolling dice again or repeating a game’s random draw.","zh":"Rerolling指为了获得新的随机结果而再试一次，常见于重掷骰子或重复进行游戏抽取。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"rolling dice (or something similar) again to get a new result; trying again for a different random outcome.","zh":"（骰子等）再掷一次；为获得新的随机结果而“重掷/重抽”"},"examples":[{"en":"The damage was low, so I’m rerolling the dice.","zh":"伤害太低了，所以我要重掷骰子。"},{"en":"In this game, you can reroll once per turn.","zh":"在这个游戏里，你每回合可以重掷一次。"}]},{"partOfSpeech":"v.","definition":{"en":"(especially in video games) repeating a random reward/character draw by restarting or using another attempt until you get a better result.","zh":"（尤指电子游戏）反复进行随机抽取/刷新（常通过重开或再次尝试），直到抽到更好的结果"},"examples":[{"en":"She spent an hour rerolling to get a rare character.","zh":"她花了一个小时反复重抽，想抽到稀有角色。"},{"en":"Some players start new accounts just for rerolling.","zh":"有些玩家为了反复重抽，会专门开新号。"}]}],"synonyms":["rolling again","re-rolling","redrawing","retrying","resetting"],"phonetic":"/ˌriˈroʊlɪŋ/","extraExplanation":["“rerolling”常见于桌游/角色扮演游戏（如掷骰决定命中、伤害），也常见于手游抽卡文化（gacha）中，表示通过重复开局或反复尝试来追求更理想的随机结果。不同游戏对reroll的规则限制不同：可能允许“重掷一次”、或需要消耗道具/次数。"]}
{"word":"rerolls","summary":{"en":"“Rerolls” means rolling again (or extra chances to roll again), especially in games to get a new random result.","zh":"“Rerolls”指（在游戏中）再掷一次/重抽，或指额外的重掷机会，用来获得新的随机结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to roll again (especially dice) to get a new result; to try again for a different random outcome","zh":"（尤指掷骰子）再掷一次以获得新的结果；（在游戏中）重抽/重掷以换一个随机结果"},"examples":[{"en":"If you don’t like your dice result, you can reroll once.","zh":"如果你不喜欢骰子的结果，你可以再掷一次。"},{"en":"She rerolls the character stats until she gets a good combination.","zh":"她不断重抽角色数值，直到刷到一个好组合。"}]},{"partOfSpeech":"n.","definition":{"en":"additional rolls or attempts (often used in games)","zh":"（常用于游戏）额外的掷骰/重抽次数"},"examples":[{"en":"You have three rerolls left for this level.","zh":"这一关你还剩三次重掷机会。"},{"en":"The reward includes two free rerolls.","zh":"奖励包含两次免费的重抽次数。"}]}],"synonyms":["re-roll","roll again","try again","redo (a roll)","reattempt"],"phonetic":"/ˈriˌroʊl/","extraExplanation":["“reroll(s)”在桌游、TRPG（桌上角色扮演）、以及带随机机制的电子游戏里很常见：玩家为了追求更好的随机结果，会用“reroll”来表示“重掷/重抽”。有些游戏会把它设计成有限资源（例如“每关3次rerolls”）。","拼写提示：reroll = re-（再一次）+ roll（掷、滚）。第三人称单数是 rerolls；过去式/过去分词是 rerolled；动名词是 rerolling。"]}
{"word":"reroof","summary":{"en":"Reroof means to replace a building’s roof with a new one.","zh":"reroof 指给建筑物更换新屋顶（重新铺设屋顶）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a new roof on a building; to replace an old or damaged roof","zh":"给建筑物换新屋顶；重新铺设/更换旧的或损坏的屋顶"},"examples":[{"en":"They plan to reroof the house before the rainy season.","zh":"他们计划在雨季前给房子换屋顶。"},{"en":"The contractor said we should reroof after the storm damage.","zh":"承包商说暴风雨造成损坏后我们应该重新铺屋顶。"}]},{"partOfSpeech":"n.","definition":{"en":"a project or job of replacing a roof","zh":"换屋顶的工程/工作（较少用）"},"examples":[{"en":"The reroof took three days and cost more than expected.","zh":"这次换屋顶工程用了三天，费用比预期高。"}]}],"synonyms":["replace the roof","re-roof","reroofing","recover (a roof)"],"phonetic":"/ˌriːˈruːf/","extraExplanation":["“reroof”在美式英语里常见于房屋维修、建筑报价与保险理赔语境中。日常更常用的说法还有“replace the roof”或名词“reroofing”（换屋顶这一过程/行业）。","构词上是前缀“re-”（再次、重新）+ “roof”（屋顶），意思直观：把屋顶“再做一遍/重新做”。"]}
{"word":"reroofed","summary":{"en":"“Reroofed” means a building got a new roof (the old roof was replaced).","zh":"“reroofed”表示建筑物已经重新换了屋顶（旧屋顶被替换）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “reroof”: to put a new roof on a building (replace the old roof).","zh":"“reroof”的过去式/过去分词：给建筑物重新换屋顶（用新屋顶替换旧屋顶）。"},"examples":[{"en":"They reroofed the house after the storm damaged the shingles.","zh":"暴风雨把屋顶瓦片刮坏后，他们给房子重新换了屋顶。"},{"en":"The building was reroofed last summer to stop the leaks.","zh":"这栋楼去年夏天重新换了屋顶，以解决漏水问题。"}]}],"synonyms":["replaced the roof on","put a new roof on"],"phonetic":"/ˌriˈrufd/","extraExplanation":["“re-”是常见前缀，表示“再次、重新”。因此 reroof = re-（重新）+ roof（屋顶/给……盖屋顶）。在房屋维修语境里很常见，通常指“整体换新屋顶”，而不只是小修补（repair the roof / patch a leak）。"]}
{"word":"reroofs","summary":{"en":"“Reroofs” means “replaces a building’s roof with a new one.”","zh":"“Reroofs”表示“（给建筑物）重新换/盖屋顶”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of “reroof”) to put a new roof on a building again; to replace an old roof with a new one.","zh":"（动词“reroof”的第三人称单数）给建筑物重新盖屋顶；更换旧屋顶。"},"examples":[{"en":"She reroofs old houses and restores them carefully.","zh":"她会给老房子重新盖屋顶，并细心修复。"},{"en":"The contractor reroofs the building every 20–30 years, depending on the materials.","zh":"承包商会根据材料情况每20到30年给这栋楼重新换一次屋顶。"}]}],"synonyms":["replaces the roof","re-roofs","puts on a new roof","reslates (UK, for slate roofs)"],"phonetic":"/ˌriːˈruːfs/","extraExplanation":["“reroofs”来自前缀 re-（表示“再次、重新”）+ roof（屋顶）。常见基本形式：reroof（原形），reroofed（过去式/过去分词），reroofing（现在分词）。在日常表达里也常说 “replace the roof / get a new roof”。"]}
{"word":"reroot","summary":{"en":"“Reroot” means to set a new “root” again—most often in computing (changing a system’s root directory or root access), and sometimes in biology (a plant growing roots again).","zh":"“Reroot”指“再次设为根/重新生根”：最常见于计算机领域（更改根目录或重新获得 root 权限），也可指植物再次生根。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Computing) to change the root directory or root access of a system (for example, making a different folder the “/” root, or regaining root privileges on a device).","zh":"（计算机）重新设置系统的根目录或 root 权限（例如把某个文件夹改成“/”根目录，或在设备上重新获取 root 权限）。"},"examples":[{"en":"After moving the project to a new server, we had to reroot the file paths.","zh":"把项目迁到新服务器后，我们得重新设置文件路径的根目录。"},{"en":"If the update breaks your setup, you may need to reroot the app’s directory.","zh":"如果更新把你的配置弄坏了，你可能需要重新设定应用目录的根路径。"}]},{"partOfSpeech":"v.","definition":{"en":"to root again; to give new roots to (a plant) after it has been moved or damaged.","zh":"（使）再次生根；（植物移栽或受损后）重新长出根。"},"examples":[{"en":"Keep the cutting moist until it reroots.","zh":"保持插条湿润，直到它重新生根。"},{"en":"The storm uprooted several shrubs, but some may reroot in the spring.","zh":"暴风把几棵灌木连根拔起，但有些可能在春天重新生根。"}]}],"synonyms":["re-root","reestablish","reconfigure","replant"],"phonetic":"/ˌriːˈruːt/","extraExplanation":["“reroot”是由 re-（再次）+ root（根/根目录）构成的动词。在日常英语里不算常用，更多见于技术语境（如 Linux/Unix 文件系统、服务器部署、手机系统 root 权限等）。","技术写作中有时会出现相关表达：re-root (the filesystem)、change the root directory、regain root access。拼写上既可写作 reroot，也可写作 re-root（更强调词根）。"]}
{"word":"rerope","summary":{"en":"Rerope means to rope something again, often with a new or adjusted rope.","zh":"Rerope 指把某物重新用绳子固定（常因更换或调整绳索）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a rope on (something) again; to rope again, especially after changing or replacing the rope.","zh":"（重新）给……系上绳子；再次用绳索固定（常指更换绳子或调整后再系/再布置）。"},"examples":[{"en":"After we replaced the old line, we had to rerope the load before lifting it.","zh":"更换旧绳后，我们得把货物重新系绳固定，才能起吊。"},{"en":"The climbers stopped to rerope the route with a safer line.","zh":"攀登者停下来，用更安全的绳子重新布绳这条线路。"}]},{"partOfSpeech":"vi.","definition":{"en":"to put on a rope again or start using a rope again (without naming an object).","zh":"再次上绳；重新使用绳索（不直接说明对象）。"},"examples":[{"en":"If the knot slips, don’t keep pulling—stop and rerope.","zh":"如果绳结打滑，别继续硬拉——停下来重新上绳。"}]}],"synonyms":["rope again","retie","restring","rehang (with a rope)"],"phonetic":"/riˈroʊp/","extraExplanation":["“rerope”由前缀 re-（再次）+ rope（绳索/用绳索固定）构成，属于较小众的动词，常见于攀岩、救援、吊装、牧场作业等语境。日常英语里更常用的表达有：tie it again / rope it again / put a new rope on it。"]}
{"word":"rerose","summary":{"en":"“Rerose” is a rare past tense form meaning “rose again.”","zh":"“rerose”是较少见的过去式，用来表示“再次升起/重新出现”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense of “rerise”) to rise again; to get up or become active again after falling, stopping, or being interrupted.","zh":"（“rerise”的过去式）再次升起；在倒下、停止或中断之后重新站起/重新出现/重新活跃。"},"examples":[{"en":"After the storm passed, the sun rerose over the hills.","zh":"暴风雨过去后，太阳又从山丘上升起。"},{"en":"Old fears rerose when he heard the same song again.","zh":"当他再次听到那首歌时，旧日的恐惧又涌上心头。"}]}],"synonyms":["rose again","rose back up","came back","returned"],"phonetic":"/ˌriˈroʊz/","extraExplanation":["“rerose”很少在日常口语中使用，更常见的表达是 “rose again / rose back up / came back”。","它来自动词 “rerise”（re- 表示“再次” + rise “升起”）。形式类似于 rise–rose–risen；因此 rerise–rerose–rerisen。"]}
{"word":"reroute","summary":{"en":"Reroute means to change the route and send something a different way, or for something to travel by a different route.","zh":"Reroute 指“改道/改线路”，把人、车、航班、包裹或信号等改走另一条路线，也可指“改道”这一行为。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to send or direct someone or something along a different route (often because the usual way is blocked or not ideal)","zh":"（因道路封闭、拥堵等）将某人/某物改道，改走另一条路线"},"examples":[{"en":"The police rerouted traffic away from the accident.","zh":"警方把车流改道，避开事故现场。"},{"en":"Our flight was rerouted due to bad weather.","zh":"由于恶劣天气，我们的航班被改航线了。"},{"en":"Can you reroute this delivery to our new address?","zh":"你能把这单配送改送到我们的新地址吗？"}]},{"partOfSpeech":"vi.","definition":{"en":"(of traffic, flights, or signals) to go by a different route","zh":"（车流、航班或信号）改走另一条路线，改道"},"examples":[{"en":"When the main road closed, buses rerouted through downtown.","zh":"主干道关闭后，公交车改道穿过市中心。"},{"en":"Internet traffic rerouted automatically after the outage.","zh":"断线后，网络流量自动改道。"}]},{"partOfSpeech":"n.","definition":{"en":"a change of route; the act of sending something a different way","zh":"改道；改线；改路（这一行为或结果）"},"examples":[{"en":"The app suggested a reroute to avoid heavy traffic.","zh":"应用建议改道以避开严重拥堵。"},{"en":"We had to make a reroute because the bridge was closed.","zh":"因为桥封了，我们不得不改道。"}]}],"synonyms":["redirect","divert","detour","re-route"],"phonetic":"/ˌriːˈraʊt/","extraExplanation":["“reroute”由前缀 re-（再次/重新）+ route（路线）构成，常用于交通、物流、航班与网络/通信领域。","在美式英语中常见搭配：reroute traffic（改道车流）、reroute a flight（改航班/改航线）、reroute a package（改寄包裹）、reroute calls（电话转接/改线路）。","与 detour 的区别：detour 常指“绕行的那条路/绕行本身”（更偏“绕路”），reroute 更强调“把原本的路线重新安排到另一条路线”。"]}
{"word":"rerouted","summary":{"en":"“Rerouted” means something was directed onto a different route than planned.","zh":"“rerouted”表示某人或某物被改道，改走与原计划不同的路线。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “reroute”: to send or direct someone or something along a different route than originally planned.","zh":"“reroute”的过去式/过去分词：把某人或某物改道，改用与原计划不同的路线。"},"examples":[{"en":"Due to an accident, traffic was rerouted onto side streets.","zh":"由于发生事故，车辆被改道到附近的支路上。"},{"en":"The airline rerouted our flight through Chicago because of the storm.","zh":"因为暴风雨，航空公司把我们的航班改道经由芝加哥中转。"},{"en":"Customer calls were rerouted to a new support center.","zh":"客户来电被转接到新的客服中心。"}]},{"partOfSpeech":"adj.","definition":{"en":"directed along a different route; changed in path (often used to describe traffic, shipments, flights, or calls).","zh":"被改道的；路线被更改的（常用于交通、货运、航班或电话转接等）。"},"examples":[{"en":"Rerouted buses will stop at the temporary station.","zh":"改道的公交车将停靠临时车站。"},{"en":"We followed the rerouted path around the construction site.","zh":"我们沿着改道后的路线绕开了施工区域。"}]}],"synonyms":["redirected","diverted","rechanneled"],"phonetic":"/ˌriˈraʊtɪd/","extraExplanation":["“re-”表示“再次/重新/改”，加上“route（路线）”，合起来就是“重新规划路线、改道”。","注意拼写与发音：美式中“route”常读 /raʊt/（像“rout”），所以“rerouted”常读 /ˌriˈraʊtɪd/。在不同地区也可能听到“route”读 /ruːt/。"]}
{"word":"reroutes","summary":{"en":"“Reroutes” usually means “changes to a different route,” and it can be a verb (he/she/it reroutes) or a plural noun (reroutes).","zh":"“Reroutes”通常表示“改道/重新规划路线”，既可作动词第三人称单数（reroutes），也可作名词复数（reroutes）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person, company, or system) changes the route or direction of something, usually to avoid a problem or improve efficiency.","zh":"（人、公司或系统）改变某物的路线或方向，通常是为了避开问题或提高效率。"},"examples":[{"en":"The airline reroutes flights around the storm.","zh":"航空公司把航班改道以避开暴风雨。"},{"en":"If traffic is heavy, the app reroutes you to a faster road.","zh":"如果交通拥堵，导航应用会把你重新规划到更快的道路。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “reroute”: alternative routes chosen to replace the original one.","zh":"“reroute”的复数：用来替代原路线的改道路线/绕行路线。"},"examples":[{"en":"Several reroutes are available while the bridge is closed.","zh":"桥梁封闭期间有几条可选的绕行路线。"},{"en":"The map shows reroutes for buses during the parade.","zh":"地图显示了游行期间公交车的改道路线。"}]}],"synonyms":["redirects","diverts","rechannels","detours (around)","replans (a route)"],"phonetic":"/ˌriˈraʊts/","extraExplanation":["“reroute”由 re-（再次/重新）+ route（路线）构成，常用于交通、物流、网络（数据包路径）等场景。","注意拼写：英式英语里也常见 route 的发音差异，但拼写通常不变；“reroute”在美式里常读作“ree-ROUT”。"]}
{"word":"rerouting","summary":{"en":"Rerouting means changing to a different route, especially for traffic, travel, delivery, or network data.","zh":"Rerouting 指“改道/重新规划路线”，常用于交通出行、物流配送或网络数据传输。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of sending traffic, people, or information by a different route than originally planned","zh":"改道；重新规划路线（把车辆、人或信息从原定路线改走另一条路的过程）"},"examples":[{"en":"Due to road construction, there will be rerouting around the downtown area.","zh":"由于道路施工，市中心周边将进行改道。"},{"en":"The airline announced rerouting because of severe weather.","zh":"航空公司因恶劣天气宣布航线改道。"},{"en":"Network rerouting helped keep the website online during the outage.","zh":"网络改路由帮助网站在故障期间保持在线。"}]},{"partOfSpeech":"other","definition":{"en":"changing the route of something; directing it to go another way","zh":"正在改道的；把……改走另一条路径的"},"examples":[{"en":"Rerouting traffic will reduce congestion near the bridge.","zh":"将车流改道会减少桥附近的拥堵。"},{"en":"We’re rerouting deliveries to avoid the closed highway.","zh":"我们正在把送货路线改道，以避开封闭的高速公路。"}]}],"synonyms":["diversion","redirecting","detour","rechanneling"],"phonetic":"/ˌriˈraʊtɪŋ/","extraExplanation":["“Rerouting”常见于交通与物流语境，也常用于计算机网络：例如路由器在某条线路故障时，会把数据包自动“改道”到可用路径，以保持连接稳定。","拼写上是 re-（再次）+ route（路线）+ -ing（名词化/进行时形式）。在美式英语中，route 常读作 /raʊt/，因此 rerouting 常读 /ˌriˈraʊtɪŋ/。"]}
{"word":"rerow","summary":{"en":"Rerow means to row again (most common), and less commonly to rearrange into rows again.","zh":"Rerow 常指“再次划船/划回去”，较少见指“重新排成行、调整行顺序”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to row (a boat) again, or to row back over the same route","zh":"再次划船；（沿同一路线）再划一遍/划回去"},"examples":[{"en":"The wind turned, so they had to rerow to the shore.","zh":"风向变了，所以他们不得不再划回岸边。"},{"en":"If we miss the marker, we’ll rerow the last section.","zh":"如果我们错过标记点，就把最后那一段再划一遍。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to arrange something into rows again; to put into a new row order","zh":"（较少见）重新排成行；重新调整行的顺序"},"examples":[{"en":"After adding new data, she rerowed the table to group items by date.","zh":"加入新数据后，她把表格重新按日期分组排列各行。"}]}],"synonyms":["row again","re-row","row back","rearrange","reorder"],"phonetic":"/ˌriˈroʊ/","extraExplanation":["“rerow”由前缀 re-（“再一次/重新”）+ row（划船/排成行）构成。写作时更常见的形式是带连字符的“re-row”，尤其在不常见或可能引起歧义时。"]}
{"word":"reroyalize","summary":{"en":"“Reroyalize” means to make something royal again or restore a monarchy/royal status.","zh":"“reroyalize”表示“使再次王室化/恢复王权或王室地位”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something royal again; to restore royal status, privileges, or a monarchy after it has been removed","zh":"使再次成为王室/恢复王权；在王室地位或君主制被取消后，使其重新获得王室身份或特权"},"examples":[{"en":"After the revolution, some groups tried to reroyalize the country by bringing back the monarchy.","zh":"革命之后，一些团体试图通过恢复君主制来让国家“重新王室化”。"},{"en":"The novelist imagines a future where the old family is reroyalized and returns to the palace.","zh":"这位小说家想象了一个未来：旧王族被重新册封并回到宫殿。"}]}],"synonyms":["restore the monarchy","reinstate","re-enthrone","re-crown","re-monarchize"],"phonetic":"/ˌriˈrɔɪəˌlaɪz/","extraExplanation":["这是一个非常少见、带有“造词感”的动词，常见构词法是 re-（再次）+ royalize（使王室化）。在新闻/历史讨论中偶尔用于谈“复辟、恢复王室地位”，也可能带一点讽刺或文学夸张的语气。","更常见、更自然的表达通常是 restore the monarchy（恢复君主制）、reinstate the royal family（恢复王室）、re-enthrone（使复位/复辟）、re-crown（再次加冕）。"]}
{"word":"rerub","summary":{"en":"Rerub means to rub something again, usually to clean, polish, or spread something more evenly.","zh":"rerub 指把某物再擦一次/再揉搓一次，常用于清洁、抛光或让涂抹更均匀。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rub again; to apply rubbing a second time, often to clean, polish, or spread something more evenly","zh":"再擦；再揉搓；再次用摩擦的方式处理（常为清洁、抛光或涂抹更均匀）"},"examples":[{"en":"The stain didn’t come out, so she rerubbed the spot with soap.","zh":"污渍没去掉，所以她又用肥皂把那一块重新擦了一遍。"},{"en":"If the lotion feels uneven, rerub it into your skin.","zh":"如果乳液涂得不均匀，就再把它揉搓进皮肤里。"},{"en":"After the wax dried, he rerubbed the table to make it shine.","zh":"蜡干了之后，他又把桌子重新擦了一遍，让它更亮。"}]}],"synonyms":["rub again","reapply","polish again","wipe again","scrub again"],"phonetic":"/riˈrʌb/","extraExplanation":["“rerub”由前缀 re-（再次）+ rub（擦、揉搓）组成，意思直观，常用于需要“重复同一动作”的场景（清洁、护肤、抛光、处理污渍等）。在正式写作中也可用 “rub again / rub it again” 来表达，更自然常见。"]}
{"word":"rerummage","summary":{"en":"“Rerummage” means to rummage again—to search through things again, often in a hurried, messy way.","zh":"“rerummage”指“再次翻找”，常带有匆忙、把东西翻乱的感觉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rummage again; to search through things again in a rough or hurried way (often because you didn’t find what you needed the first time)","zh":"再翻找；再次（匆忙地）翻弄、搜寻（常因第一次没找到）"},"examples":[{"en":"I rerummaged my backpack but still couldn’t find my keys.","zh":"我又把背包翻了一遍，但还是找不到钥匙。"},{"en":"She rerummaged the drawer for the receipt she was sure she had kept.","zh":"她又把抽屉翻找了一遍，想找那张她确定保存过的收据。"}]}],"synonyms":["rummage again","search again","look through again","go through again"],"phonetic":"/ˌriːˈrʌmɪdʒ/","extraExplanation":["“rerummage”= re-（再次）+ rummage（翻找、乱翻）。它不是很常见，但在口语或写作中可以用来强调“又翻了一遍”。","“rummage”通常带有“把东西翻得有点乱、很急”的感觉；如果只是更有条理地找，可以用“search again / look again”。"]}
{"word":"rerun","summary":{"en":"Rerun means to do something again or to broadcast a TV program again; it can also mean the repeat broadcast itself.","zh":"rerun 指“再次运行/重新进行”，也指节目“重播”；还可作名词表示“重播的节目/集数”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to run again; to repeat an action or process","zh":"再次运行；重新进行某个动作或流程"},"examples":[{"en":"If the program crashes, save your work and rerun it.","zh":"如果程序崩溃了，先保存工作，然后重新运行它。"},{"en":"They had to rerun the experiment because the first results were unclear.","zh":"因为第一次结果不清楚，他们不得不重新做实验。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a TV show, movie, etc.) to be broadcast again","zh":"（电视节目、电影等）重播"},"examples":[{"en":"The channel will rerun the series this weekend.","zh":"这个频道周末会重播这部剧。"},{"en":"They reran the interview after receiving many requests.","zh":"因为很多人要求，他们把那段采访重播了一次。"}]},{"partOfSpeech":"n.","definition":{"en":"a repeat broadcast of a TV show, episode, or program","zh":"（电视节目/剧集的）重播；重播的那一集/那一期"},"examples":[{"en":"I missed the episode, so I watched the rerun the next day.","zh":"我错过了那一集，所以第二天看了重播。"},{"en":"The summer schedule is full of reruns.","zh":"暑期节目表里到处都是重播。"}]}],"synonyms":["repeat","run again","replay","rebroadcast","do over"],"phonetic":"/ˌriˈrʌn/","extraExplanation":["“rerun”既可作动词也可作名词。作名词时在美式英语里很常见，尤其指电视节目“重播”。","书写上常见作一个词“rerun”；也有人写作“re-run”，但现代用法里合写更普遍。"]}
{"word":"rerunning","summary":{"en":"“Rerunning” means doing something again—often re-running a process/program/test or re-airing a TV show.","zh":"“Rerunning”指把某事再做一次——常见于重新运行流程/程序/测试，或电视节目重播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of doing, running, or performing something again (especially a process, program, or test)","zh":"重新运行；再次执行（尤指流程、程序或测试）"},"examples":[{"en":"After fixing the bug, we’re rerunning the test.","zh":"修复漏洞后，我们正在重新运行测试。"},{"en":"Rerunning the analysis gave the same result.","zh":"重新运行分析得到了相同的结果。"}]},{"partOfSpeech":"v.","definition":{"en":"doing or running something again; repeating a run or performance","zh":"正在重新运行；再次执行；重跑/重演"},"examples":[{"en":"The script is rerunning because the server restarted.","zh":"由于服务器重启，这个脚本正在重新运行。"},{"en":"I’m rerunning the washing machine cycle to get the clothes cleaner.","zh":"我在把洗衣机的洗涤程序再运行一次，让衣服更干净。"}]},{"partOfSpeech":"v.","definition":{"en":"broadcasting or showing a TV show, movie, or episode again (a repeat)","zh":"（电视/节目）重播；再次播出"},"examples":[{"en":"They’re rerunning last night’s episode this afternoon.","zh":"他们今天下午会重播昨晚那一集。"},{"en":"The channel is rerunning old sitcoms all weekend.","zh":"这个频道整个周末都在重播老情景喜剧。"}]}],"synonyms":["running again","re-running","repeating","redoing","replaying","rebroadcasting"],"phonetic":"/ˌriˈrʌnɪŋ/","extraExplanation":["“rerun”= re-（再次）+ run（运行/播出）。在日常英语里，它既常用于“电脑程序/流程重新运行”，也常用于“电视节目重播”。","拼写注意：rerun 的现在分词要双写 n → rerunning（类似 run → running）。"]}
{"word":"reruns","summary":{"en":"“Reruns” usually means repeated showings of a program; it can also be the verb “to rerun,” meaning to run or show again.","zh":"“reruns”通常指节目等的重播；也可作动词“rerun”的第三人称，表示再运行或重播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"repeated showings of a TV program, movie, or broadcast that has been shown before","zh":"（电视节目、电影或播出内容的）重播；重映"},"examples":[{"en":"There’s nothing new on tonight—just reruns.","zh":"今晚没什么新节目——只有重播。"},{"en":"I grew up watching reruns of old sitcoms.","zh":"我小时候常看老情景喜剧的重播。"}]},{"partOfSpeech":"v.","definition":{"en":"to run, broadcast, or show again","zh":"再运行；重播；重放；重映"},"examples":[{"en":"They rerun the episode every summer.","zh":"他们每年夏天都会重播那一集。"},{"en":"If the test fails, rerun it with the correct settings.","zh":"如果测试失败，就用正确的设置重新运行。"}]}],"synonyms":["repeats","replays","rebroadcasts","reissues"],"phonetic":"/ˈriˌrʌnz/","extraExplanation":["“rerun”最常见于电视语境，指“播过的节目再次播放”。在科技语境中也很常见，比如“rerun a program/script”（重新运行程序/脚本）。","口语里常说“a rerun of + 节目名”（某节目的一次重播）；复数“reruns”常用来概括“都是重播内容”。"]}

