{"word":"reub","summary":{"en":"“Reub” is an informal nickname for Reuben/Ruben, and it can also mean a Reuben sandwich in casual North American English.","zh":"“Reub”是 Reuben/Ruben 的昵称，也可在北美口语中指 Reuben 三明治。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a casual short form of the male name “Reuben” (also spelled “Ruben”).","zh":"男性名字“Reuben / Ruben”的非正式简称（昵称）。"},"examples":[{"en":"Reub is coming over after work.","zh":"Reub 下班后会过来。"},{"en":"Everyone calls him Reub, but his full name is Reuben.","zh":"大家都叫他 Reub，但他的全名是 Reuben。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially in delis) short for a Reuben sandwich (corned beef, Swiss cheese, sauerkraut, and Russian/Thousand Island dressing on rye).","zh":"（非正式，尤见于熟食店/餐馆）“Reuben 三明治”的简称（常见配料：腌牛肉、瑞士奶酪、酸菜、俄式/千岛酱，黑麦面包）。"},"examples":[{"en":"I’ll take a reub and a pickle on the side.","zh":"我要一份 reub，旁边再来个腌黄瓜。"},{"en":"Their reub is huge—definitely enough to share.","zh":"他们家的 reub 很大，绝对够两个人分着吃。"}]}],"synonyms":["Reuben","Ruben","Reuben sandwich"],"phonetic":"/ruːb/","extraExplanation":["“Reuben”是《圣经》中人物名（雅各的长子），来源于希伯来语。英语里常把较长的人名缩短成一两个音节做昵称（如 Ben=Benjamin）。","“Reub”指三明治时多见于北美口语或菜单简写；正式写法通常还是 Reuben。"]}
{"word":"reuben","summary":{"en":"Reuben most commonly refers to a grilled deli sandwich with corned beef, Swiss cheese, sauerkraut, and dressing; it can also be a male name from the Bible.","zh":"Reuben最常指一种煎烤的熟食店风格三明治（咸牛肉、瑞士奶酪、酸菜和酱料）；也可作男子名，源自《圣经》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hot sandwich made with corned beef (or pastrami), Swiss cheese, sauerkraut, and Russian or Thousand Island dressing, usually grilled on rye bread","zh":"鲁本三明治：一种热三明治，常用黑麦面包夹咸牛肉（或熏牛肉）、瑞士奶酪、酸菜，并加俄式/千岛酱后煎烤"},"examples":[{"en":"I’ll have a Reuben with extra sauerkraut, please.","zh":"我想要一份鲁本三明治，酸菜多加一点。"},{"en":"The diner is famous for its classic Reuben on rye.","zh":"这家小餐馆以经典的黑麦鲁本三明治出名。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name; also the name of Jacob’s first son in the Bible (Old Testament)","zh":"男子名“Reuben”；也指《圣经·旧约》中雅各的长子流便"},"examples":[{"en":"Reuben is a traditional name with biblical roots.","zh":"Reuben 是一个有《圣经》渊源的传统名字。"},{"en":"In the Bible story, Reuben is Jacob’s firstborn son.","zh":"在《圣经》故事里，流便是雅各的长子。"}]}],"synonyms":["Reuben sandwich","corned beef sandwich (similar)","pastrami Reuben (variant)"],"phonetic":"/ˈruːbən/","extraExplanation":["“Reuben”作为三明治名称时，通常不翻译成“流便”，而是音译或直接写作“鲁本三明治”。在菜单上你也可能看到写成“Reuben sandwich”。","关于起源有不同说法：一种说法与美国内布拉斯加州奥马哈有关，另一种说法与纽约的熟食店文化有关；无论哪种版本，它都属于典型的美式熟食店（deli/diner）料理。"]}
{"word":"reubenites","summary":{"en":"Reubenites means the people descended from Reuben—the biblical tribe of Reuben.","zh":"Reubenites 指流便的后裔，即《圣经》中“流便支派”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The descendants of Reuben (Jacob’s eldest son), a group known in the Hebrew Bible as the tribe of Reuben.","zh":"流便的后裔（雅各的长子），在《希伯来圣经/旧约》中被称为“流便支派”的人。"},"examples":[{"en":"In the Hebrew Bible, the Reubenites are listed among the twelve tribes of Israel.","zh":"在《希伯来圣经/旧约》中，流便人被列为以色列十二支派之一。"},{"en":"The Reubenites settled on the east side of the Jordan River in many biblical accounts.","zh":"在许多圣经记载中，流便人定居在约旦河东岸。"}]}],"synonyms":["the tribe of Reuben","descendants of Reuben"],"phonetic":"/ˈruːbəˌnaɪts/","extraExplanation":["“Reubenites”是专有名词复数，来自人名“Reuben（流便）”。在英语中也可写作“Reubenites of the tribe of Reuben（流便支派的人）”。","常见语境是宗教、历史或文学讨论（如谈到以色列十二支派、古代近东地理与部族分布）。日常英语里很少使用。","相关经文中常见拼写为 Reubenites（流便人）；单数可用 Reubenite（一个流便人），但实际文本中复数更常见。"]}
{"word":"reuchlinian","summary":{"en":"“Reuchlinian” means “related to Johann Reuchlin” or “connected to the Reuchlin controversy about Jewish books and Hebrew studies.”","zh":"“reuchlinian”指“与约翰·罗伊希林有关的”，也可指“与罗伊希林事件（关于犹太书籍与希伯来研究的争论）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Johann Reuchlin (1455–1522), a German Renaissance humanist and scholar known for defending Jewish books and promoting the study of Hebrew.","zh":"与约翰·罗伊希林（Johann Reuchlin，1455–1522）有关的；指这位德国文艺复兴人文主义者与学者（以捍卫犹太典籍、推动希伯来语研究而闻名）。"},"examples":[{"en":"The article discusses Reuchlinian scholarship in early modern Europe.","zh":"这篇文章讨论了近代早期欧洲的“罗伊希林式”学术研究。"},{"en":"A Reuchlinian approach often values careful reading of Hebrew sources.","zh":"“罗伊希林式”的方法往往重视对希伯来语资料的细致研读。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Reuchlin’s role in the Reuchlin Affair/controversy (early 1500s) about whether Jewish books should be censored or destroyed.","zh":"与罗伊希林在“罗伊希林事件/争论”（16世纪初：围绕是否应审查或焚毁犹太书籍）中的立场与影响有关的。"},"examples":[{"en":"The pamphlet war created a sharply Reuchlinian versus anti-Reuchlinian divide.","zh":"这场小册子论战形成了鲜明的“亲罗伊希林”与“反罗伊希林”对立。"},{"en":"Some historians call the defense of Hebrew texts a Reuchlinian turning point in Christian humanism.","zh":"一些历史学者把对希伯来典籍的捍卫称为基督教人文主义的一个“罗伊希林式”转折点。"}]}],"synonyms":["Reuchlin-related","Reuchlinian (Reuchlin controversy sense)"],"phonetic":"/rɔɪˈklɪniən/","extraExplanation":["“Reuchlinian”来自人名 Reuchlin（罗伊希林）+ 形容词后缀 -ian，表示“属于/有关……的人或思想”。","在学术写作里常见搭配有：Reuchlinian humanism（罗伊希林式人文主义）、Reuchlinian scholarship（罗伊希林相关/式学术）、Reuchlinian controversy/affair（罗伊希林事件/争论）。","该词较偏学术、历史语境，日常英语中很少使用；有时也会与 anti-Reuchlinian（反罗伊希林的）并列出现，用于描述当时争论双方。"]}
{"word":"reuchlinism","summary":{"en":"Reuchlinism: ideas linked to Johann Reuchlin, especially defending Jewish texts and promoting Hebrew studies in Renaissance Europe.","zh":"罗伊希林主义：与罗伊希林相关的思想倾向，尤指为犹太典籍辩护并推动文艺复兴时期的希伯来语/犹太学术研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a movement or viewpoint associated with the German humanist Johann Reuchlin (1455–1522), especially his defense of Jewish books and his encouragement of studying Hebrew and Jewish scholarship in Renaissance Europe","zh":"与德国人文主义者约翰·罗伊希林（Johann Reuchlin, 1455–1522）相关的思想或运动，尤指他为犹太书籍辩护、推动在文艺复兴时期欧洲学习希伯来语与犹太学术传统"},"examples":[{"en":"In some histories of the Renaissance, Reuchlinism is linked to the rise of Christian Hebrew studies.","zh":"在一些文艺复兴史著中，“罗伊希林主义”常被视为基督教希伯来学兴起的一个相关因素。"},{"en":"The debate over whether to burn Jewish texts helped make Reuchlinism a symbol of scholarly tolerance.","zh":"围绕是否焚毁犹太典籍的争论，使“罗伊希林主义”在一定程度上成了学术宽容的象征。"}]}],"synonyms":["Reuchlin’s humanism","Christian Hebraism (related context)"],"phonetic":"/ˈrɔɪçlɪˌnɪzəm/","extraExplanation":["“Reuchlinism”是非常少见的历史术语，多出现在文艺复兴与宗教思想史研究中。它通常指围绕罗伊希林的立场与影响形成的“倾向”：反对焚毁犹太书籍、主张通过学习希伯来语与原典来进行更严谨的圣经研究。","词形上是 Reuchlin + -ism（表示“主义/思潮/倾向”）。注意它并不是一个现代常用的宗教派别名称，更像学术写作里的概括性标签。"]}
{"word":"reuel","summary":{"en":"Reuel is a male first name, best known from the Bible and sometimes seen in modern names.","zh":"Reuel 是男性名字，最广为人知的来源是《圣经》，现代人名中也偶尔使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name of Hebrew origin, known especially from the Bible (as a name for Moses’ father-in-law in some passages) and used as a modern personal name.","zh":"一个源自希伯来语的男性名字，尤其见于《圣经》（在部分经文中作为摩西岳父的名字），现代也可作人名使用。"},"examples":[{"en":"In some Bible translations, Moses’ father-in-law is called Reuel.","zh":"在一些《圣经》译本中，摩西的岳父被称为 Reuel。"},{"en":"His middle name is Reuel, a family name passed down for generations.","zh":"他的中间名是 Reuel，这是家族世代沿用的名字。"}]}],"phonetic":"/ˈruːəl/","extraExplanation":["“Reuel”通常被认为来自希伯来语，常被解释为“上帝的朋友/上帝的牧者”等含义（不同学者与资料说法略有差异）。","《出埃及记》中摩西岳父有时称“流珥（Reuel）”，有时称“叶忒罗（Jethro）”；很多读者会困惑，这可能与称号/名字并用、或不同传统记载有关。","在英语文化中它也因作家 J. R. R. Tolkien 的全名 John Ronald Reuel Tolkien 而较为人熟知。"]}
{"word":"reundercut","summary":{"en":"“Reundercut” means to undercut again—most often to lower a price/offer again to beat a competitor; less commonly, to redo an undercut haircut.","zh":"“reundercut”指“再次压价/再一次挤掉对方”，最常用于商业竞争；较少情况下可指把 undercut 发型再修一次。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to undercut again; to lower a price, offer, or position once more to beat a competitor (often written as “re-undercut” or said as “undercut again”).","zh":"再次“压价/挤掉对方”；再一次用更低的价格、条件或策略来赢过竞争者（常写作 re-undercut，口语也常说 undercut again）。"},"examples":[{"en":"After their rival dropped the price, the company reundercut by another 5%.","zh":"对手降价后，这家公司又再压价了5%。"},{"en":"If you keep reundercutting, you may start a price war.","zh":"如果你一直再压价，可能会引发价格战。"}]},{"partOfSpeech":"v.","definition":{"en":"to redo an undercut hairstyle (less common; usually written as “re-undercut”).","zh":"把“底部剃短、上面留长”的 undercut 发型再修一次/重做一次（较少见；通常写作 re-undercut）。"},"examples":[{"en":"I asked my barber to reundercut the sides because they’d grown out.","zh":"我让理发师把两侧的底部再修短一点，因为已经长出来了。"}]}],"synonyms":["re-undercut","undercut again","outbid","outprice","beat on price"],"phonetic":"/ˌriːˌʌndərˈkʌt/","extraExplanation":["“reundercut”并不是非常标准或常见的拼写。更常见的是加连字符的 **re-undercut**，或直接说 **undercut again**。","在商业语境里，**undercut** 常指用更低价格/更好条件抢走生意；加上 **re-** 表示“再次、重新”做同样的动作。"]}
{"word":"reundergo","summary":{"en":"Reundergo means to undergo or experience something again.","zh":"reundergo 指“再次经历/再承受某事”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to undergo something again; to experience the same process, treatment, or difficulty a second time","zh":"再次经历；再承受（同一过程、治疗或困难等）"},"examples":[{"en":"After the test was inconclusive, he had to reundergo the procedure.","zh":"由于检测结果不明确，他不得不再次接受该程序/检查。"},{"en":"The company did not want to reundergo months of negotiations.","zh":"公司不想再经历数月的谈判。"}]}],"synonyms":["undergo again","go through again","repeat","relive"],"phonetic":"/ˌriˌʌnˈdɚɡoʊ/","extraExplanation":["“reundergo”在现代英语中很少见，更常见、更自然的写法是“re-undergo”，或者用“undergo again / go through again”来表达。","该词由前缀“re-”（再次）+ “undergo”（经历/承受）构成，常用于较正式的语境（医疗、法律、程序、谈判等）。"]}
{"word":"reundertake","summary":{"en":"Reundertake means to take on or start a task again.","zh":"Reundertake 指“重新承担或重新开始做某项任务”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to undertake (start or accept responsibility for) something again; to take up a task or project a second time, often after stopping or failing before","zh":"再次承担或着手某事；把曾经中断、失败或完成过的任务/项目再做一遍"},"examples":[{"en":"After the funding returned, the team decided to reundertake the research project.","zh":"资金恢复后，团队决定重新开展这项研究项目。"},{"en":"She reundertook her piano lessons after a long break.","zh":"她在中断很久后又重新开始上钢琴课。"},{"en":"We had to reundertake the application process because the form was submitted incorrectly.","zh":"因为表格提交有误，我们不得不重新走一遍申请流程。"}]}],"synonyms":["restart","resume","take up again","retry","recommence"],"phonetic":"/ˌriˌʌndərˈteɪk/","extraExplanation":["“re-”是英语中很常见的前缀，表示“再一次/重新”（如 redo, rebuild, reconsider）。因此 reundertake 的核心意思就是“undertake again”。","这个词在日常口语中不算常见，很多场合可以用更自然的表达替换，比如: restart (重新开始), take up again (再次开始/重新从事), resume (恢复/继续)。"]}
{"word":"reundulate","summary":{"en":"Reundulate means “to undulate again,” either happening naturally (waves returning) or caused by something.","zh":"Reundulate 指“再次起伏/再度波动”，可指自然重新泛起波纹，也可指使某物再度呈波浪状。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become wavy or ripple again; to undulate again (often used in literary or descriptive writing).","zh":"再次起伏；再度呈波浪状（常见于文学或描写性文字）。"},"examples":[{"en":"As the wind returned, the tall grass began to reundulate across the field.","zh":"风又起时，高高的草在田野里再次起伏如浪。"},{"en":"The lake surface reundulated after the boat passed.","zh":"小船驶过后，湖面又重新泛起层层波纹。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something ripple or move in waves again.","zh":"使……再次起伏；使……再度呈波浪状。"},"examples":[{"en":"A sudden gust reundulated the curtain, sending soft waves through the fabric.","zh":"一阵突如其来的风使窗帘再次起伏，布面荡出柔和的波纹。"},{"en":"The drummer’s steady beat seemed to reundulate the crowd.","zh":"鼓手稳定的节拍仿佛让人群再次涌动起来。"}]}],"synonyms":["undulate again","ripple again","wave again","swell again"],"phonetic":"/ˌriˈʌndʒəˌleɪt/","extraExplanation":["“reundulate”由前缀 re-（“再、重新”）+ undulate（“起伏、波动”）构成，属于比较少见、偏文学的词。日常表达更常用 “ripple again / become wavy again”。","在描写自然景象（草海、云层、水面、沙丘）或群体运动（人群涌动）时，这个词能营造更诗意、画面感更强的语气。"]}
{"word":"reundulation","summary":{"en":"Reundulation means a renewed or repeated wave-like motion.","zh":"reundulation 指“再次出现或反复出现的波动/起伏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a renewed or repeated wave-like motion; a second (or further) series of undulations.","zh":"再次出现的波动；反复的起伏（第二次或更多次的“波状运动”）。"},"examples":[{"en":"After the first shock passed, a reundulation of the water rocked the boat.","zh":"第一次冲击过去后，水面又出现一阵波动，把小船晃得摇摆不定。"},{"en":"The crowd’s applause came in waves, a reundulation that filled the hall.","zh":"掌声一波接一波地响起，反复回荡，充满了整个大厅。"}]}],"synonyms":["renewed wave","repeated undulation","resurgence","oscillation"],"phonetic":"ˌriʌn.jəˈleɪ.ʃən","extraExplanation":["这个词非常少见，通常出现在较正式或技术性的语境里（如物理、地质、文学描写）。它由前缀 re-（“再次、重新”）+ undulation（“波动、起伏”）构成。日常英语里更常用的表达是 renewed waves / another wave / repeated undulations 等。"]}
{"word":"reune","summary":{"en":"“Reune” is not a standard English word; you probably mean “reunite,” meaning to come together again or bring people/things together again.","zh":"“reune”不是标准英语词；你可能想写“reunite”，意思是再次团聚或使人/事物重新聚在一起。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “reunite”) to come together again after being separated; to bring people or things together again.","zh":"（可能想写的是：reunite）在分开之后再次团聚；使人或事物重新聚在一起。"},"examples":[{"en":"After many years apart, the two friends reunited at a class reunion.","zh":"分开多年后，这两位朋友在同学会上重聚了。"},{"en":"The rescue team worked to reunite lost children with their families.","zh":"救援队努力让走失的孩子与家人团聚。"},{"en":"The museum reunited the two parts of the ancient statue.","zh":"博物馆把那尊古代雕像的两部分重新合在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) to reunite someone with someone/something.","zh":"（较少见）使某人与某人/某物重新相聚或重新结合。"},"examples":[{"en":"The program reunited her with her birth mother.","zh":"这个项目让她与生母重逢。"}]}],"synonyms":["rejoin","meet again","get back together","reconnect","bring together"],"phonetic":"/ˌriːjuˈnaɪt/","extraExplanation":["“reune”不是常见英语单词拼写。最可能的目标词是 **reunite**（重新团聚/重聚）。常见拼写提示：re + unite（再次 + 联合）。","常用搭配：**reunite with**（与……重聚），**reunite A with B**（使A与B重聚/重合）。"]}
{"word":"reunfold","summary":{"en":"Reunfold means to unfold again, or (figuratively) to reveal something again.","zh":"reunfold 指“再次展开”，也可比喻“再次展现/揭示（故事、记忆等）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to unfold again; to open out or spread out after being folded or closed","zh":"再次展开；把折叠或合拢的东西重新打开、摊开"},"examples":[{"en":"She carefully reunfolded the map to check the next turn.","zh":"她小心地把地图再次展开，查看下一个转弯。"},{"en":"After the clothes dried, he reunfolded the blanket and laid it on the bed.","zh":"衣服晾干后，他把毯子重新展开，铺在床上。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to reveal or show something again, especially details, memories, or a story","zh":"（比喻）再次展现/揭示（细节、记忆或故事）"},"examples":[{"en":"As they talked, old memories seemed to reunfold in her mind.","zh":"他们交谈时，往事仿佛又在她脑海里重新展开。"},{"en":"The documentary reunfolds the events of that night through new interviews.","zh":"这部纪录片通过新的采访，再次呈现了那一夜的经过。"}]}],"synonyms":["unfold again","open again","spread out again","reopen","reveal again","revisit"],"phonetic":"/ˌriːʌnˈfoʊld/","extraExplanation":["“reunfold”由前缀 re-（再次）+ unfold（展开）构成，属于不太常见、较偏书面或文学的用法。日常英语里更常说 “unfold again / open again / unfold it again”，比喻义则常用 “reveal again / revisit / retell”。"]}
{"word":"reunification","summary":{"en":"Reunification means bringing separated parts back together into one whole again.","zh":"Reunification 指把分离的部分重新合为一个整体的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of bringing parts of something back together again as one (such as a country, a family, or an organization)","zh":"重新统一；再度合并（把分开的部分重新变成一个整体，如国家、家庭或组织）"},"examples":[{"en":"The reunification of Germany happened in 1990.","zh":"德国在1990年实现了重新统一。"},{"en":"After years apart, the reunion led to the reunification of the family.","zh":"多年分离后，这次团聚促成了家庭的重新团圆与统一。"}]}],"synonyms":["unification","reunion","remerger","reintegration"],"phonetic":"/ˌriːˌjuːnəfəˈkeɪʃən/","extraExplanation":["“Reunification”常出现在历史与政治语境，尤其指因战争、分裂或制度差异而分开的地区/国家再次合为一体。","词形结构：re-（再次）+ unify（统一）+ -fication（使……成为……的过程/行为），意思直观地就是“再次变成一个整体的过程”。","相关表达：national reunification（国家统一）、reunification talks（统一谈判）、peaceful reunification（和平统一）。注意与“reunion（团聚）”区分：reunion更偏“人/群体的再次相聚”，reunification更偏“结构或政治实体的重新合并”。"]}
{"word":"reunifications","summary":{"en":"Reunifications means multiple instances of reunification—bringing separated parts back together into one again.","zh":"reunifications 指“重新统一/重新合并”的复数形式，表示多次或多种“再次合为一体”的过程或事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of bringing parts, groups, or a country back together into one unit again; the plural form refers to multiple such events or processes","zh":"（再次）统一；重新合并；（复数）多次/多种形式的重新统一或合并"},"examples":[{"en":"Historians study political reunifications in Europe after major wars.","zh":"历史学家研究欧洲在重大战争后发生的政治统一。"},{"en":"The company’s reunifications of separate teams improved communication.","zh":"公司把分散团队重新合并后，沟通变得更顺畅。"},{"en":"Family reunifications can take months because of immigration paperwork.","zh":"由于移民手续，家庭团聚（重新团聚）可能需要几个月。"}]}],"synonyms":["reunions","reintegrations","mergers","unifications","recombination"],"phonetic":"/ˌriːˌjuːnəfəˈkeɪʃən/","extraExplanation":["“reunification”常见于政治与历史语境，例如“German reunification（德国统一，1990年）”。也可用于更日常的场景，如“family reunification（家庭团聚）”在移民政策中很常见。","构词提示：re-（再次）+ unify（统一）+ -cation（名词后缀）→ reunification（重新统一/合并）。复数 reunifications 用于强调“发生过多次”或“不同类型的统一/合并”。"]}
{"word":"reunified","summary":{"en":"“Reunified” means brought together again into one whole, especially after separation.","zh":"“reunified”表示在分离之后“重新合为一体/重新统一”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “reunify”; to bring parts of a country, group, or family together again into one.","zh":"“reunify”的过去式/过去分词；使（国家、团体或家庭的）分裂部分再次合为一体。"},"examples":[{"en":"The two organizations reunified after years of working separately.","zh":"这两个组织在分开运作多年后重新合并。"},{"en":"They hope the country can be reunified through peaceful talks.","zh":"他们希望这个国家能通过和平谈判实现重新统一。"}]},{"partOfSpeech":"adj.","definition":{"en":"brought together again into one whole; no longer separated.","zh":"重新合为一体的；不再分离的。"},"examples":[{"en":"After the reforms, the reunified team worked more smoothly.","zh":"改革之后，重新整合的团队配合得更顺畅。"},{"en":"A reunified family often needs time to rebuild trust.","zh":"重新团聚的家庭通常需要时间来重建信任。"}]}],"synonyms":["reunited","recombined","rejoined","merged again","unified again"],"phonetic":"/ˌriːˈjuːnəˌfaɪd/","extraExplanation":["“reunify / reunified”常用于政治与历史语境，表示“重新统一”，例如德国在1990年实现统一（German reunification）。在更日常的语境里，也可用于组织、部门或家庭“重新合并/团聚”。","常见搭配：reunify a country / reunify the party / reunify the family；也常和“peacefully, through negotiations”等表达一起出现，强调以和平方式重新统一。"]}
{"word":"reunifies","summary":{"en":"“Reunifies” means “unites again,” especially bringing separated parts back into one.","zh":"“reunifies”表示“再次统一/重新合并”，常指把分开的部分重新合为一体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bring parts of something (such as a country, group, or family) together again into one unit; to unite again","zh":"（使）再次统一；（使）重新合并为一体（如国家、团体或家庭）"},"examples":[{"en":"The new agreement reunifies the two organizations under one name.","zh":"新协议使这两个组织以一个名称重新合并。"},{"en":"The policy aims to reunify families separated by war.","zh":"这项政策旨在让因战争分离的家庭重新团聚。"}]}],"synonyms":["reunite","recombine","rejoin","reintegrate","unify again"],"phonetic":"/riˈjunəˌfaɪz/","extraExplanation":["“reunifies”是动词“reunify”的第三人称单数现在时（he/she/it reunifies）。常见搭配：reunify a country / reunify families / reunify two groups。","在历史语境中，它常用来指国家“再次统一”，例如德国在1990年实现统一（German reunification）。"]}
{"word":"reunify","summary":{"en":"Reunify means to make something united again after it has been separated.","zh":"Reunify 指把原本分开的事物再次统一/合并。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bring parts, groups, or people back together into one unit again; to make united again","zh":"使（部分、群体或人）重新合为一体；使再次统一"},"examples":[{"en":"The two departments were reunified after years of working separately.","zh":"这两个部门在分开运作多年后重新合并了。"},{"en":"The organization hopes to reunify the community after the conflict.","zh":"该组织希望在冲突后让社区重新团结起来。"}]}],"synonyms":["reunite","recombine","reintegrate","merge"],"phonetic":"/ˌriˈjunəˌfaɪ/","extraExplanation":["“Reunify”由 re-（再次）+ unify（统一，使合一）构成，常用于“重新统一/重新合并”的语境。","它在政治与历史语境中很常见，例如谈到国家、地区或团体在分裂后“重新统一”。更常见的相关名词是 reunification（重新统一）。","与 reunite（重聚）相比，reunify 更强调“成为一个整体/一个体系”（例如一个国家、一个机构），而 reunite 更常用于人或家庭成员的“重逢/团聚”。"]}
{"word":"reunifying","summary":{"en":"“Reunifying” means bringing separated parts back together into one again.","zh":"“reunifying”表示把分开的部分再次合并，使之重新成为一个整体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"bringing people, places, or parts together again into one whole after being separated","zh":"（使）在分离之后再次合而为一；重新统一"},"examples":[{"en":"The reunifying efforts focused on bringing the divided community back together.","zh":"这些重新统一的努力重点在于让分裂的社区重新团结起来。"},{"en":"The agreement created a plan for reunifying the two regions.","zh":"该协议制定了重新统一这两个地区的计划。"}]},{"partOfSpeech":"v.","definition":{"en":"the act or process of bringing together again; reuniting or restoring unity","zh":"重新统一的行为或过程；再联合、恢复统一"},"examples":[{"en":"Reunifying a team after a conflict takes time and trust.","zh":"在冲突之后让团队重新团结需要时间和信任。"},{"en":"They discussed reunifying the organization under one leadership structure.","zh":"他们讨论在一个领导架构下重新统一该组织。"}]}],"synonyms":["reuniting","recombining","reintegrating","bringing back together","restoring unity"],"phonetic":"/ˌriˈjuːnəˌfaɪɪŋ/","extraExplanation":["“reunifying”来自 re-（再次）+ unify（使统一）。在新闻与历史语境中常用于政治或国家层面的“统一/再统一”（如地区分裂后的重新合并），也可用于家庭、组织、社群等更日常的“重新凝聚”。","词形提示：常见原形是 unify；过去式/过去分词 unified；名词是 reunification（重新统一）。"]}
{"word":"reunion","summary":{"en":"Reunion means a meeting or coming together again after a period of separation.","zh":"Reunion 指“久别后的重聚/团聚”，也可指“再次联合、重新统一”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meeting of people who have not seen each other for a long time, often to remember the past (family, classmates, coworkers, etc.)","zh":"（久别后）重聚；团聚；聚会（常为家人、同学、同事等久别重逢并回忆往事）"},"examples":[{"en":"We’re going to our high school reunion this summer.","zh":"我们今年夏天要去参加高中同学会。"},{"en":"The family reunion brought everyone together after years apart.","zh":"这次家庭团聚让多年未见的亲人们聚在了一起。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of bringing people, groups, or things together again after separation","zh":"再次联合；重新结合；复合（指人与群体或事物在分离后再度合在一起）"},"examples":[{"en":"The reunion of the two brothers was emotional.","zh":"两兄弟的重逢令人动容。"},{"en":"There were calls for the reunion of the two organizations.","zh":"有人呼吁两家组织重新合并。"}]}],"synonyms":["gathering","get-together","homecoming","reunification"],"phonetic":"/ˌriːˈjuːnjən/","extraExplanation":["词源提示：re- 表示“再次”，union 表示“联合、结合”。所以 reunion 字面意思就是“再次结合”，既可指人们的重聚，也可指组织或国家等的重新统一。","常见搭配：family reunion（家庭团聚）、class reunion（同学会）、school reunion（校友聚会）、reunion tour（乐队/歌手重组巡演）、reunion dinner（团圆饭，语境中也可指节日团聚的晚餐）。"]}
{"word":"reunionism","summary":{"en":"Reunionism means supporting or advocating reunion—especially the reunification of a divided country or region.","zh":"Reunionism 指主张“重聚/再统一”的立场或运动，尤指分裂国家或地区的重新统一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief, policy, or movement that supports reuniting separated people, regions, or political entities (especially parts of a nation that has been divided).","zh":"（主张）把分离的人群、地区或政治实体重新统一／团聚的理念、政策或运动（尤指分裂国家的重新统一）。"},"examples":[{"en":"Reunionism became a central topic in debates about the future of the divided country.","zh":"“统一主义”成为关于这个分裂国家未来走向的辩论核心话题。"},{"en":"Some parties promote reunionism through peaceful negotiation and cultural exchange.","zh":"一些政党通过和平谈判与文化交流来推动“统一主义”。"}]}],"synonyms":["reunification","unification","reunification movement","pro-unification"],"phonetic":"/ˌriːˈjuːnjənɪzəm/","extraExplanation":["“reunionism”不是日常高频词，更常见的对应说法是“reunification”（重新统一/复归统一）或“unification”（统一）。当它出现时，往往带有明确的政治立场色彩，强调“应该重新合并/回归一个整体”的主张。","在现实语境里，它可能用于讨论“国家分裂后的再统一”（例如朝鲜半岛、爱尔兰岛等相关议题），也可能用于更宽泛的历史或政治讨论。具体指向要看上下文。"]}
{"word":"reunionist","summary":{"en":"Reunionist means a person (or viewpoint) that supports bringing separated groups or political units back together.","zh":"reunionist 指支持分裂的团体或政治实体“重新统一/合并”的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports the reunion of separated groups, countries, or organizations (bringing them back together as one)","zh":"主张“重新统一/复归合一”的人；支持分裂的团体、国家或组织重新合并的人"},"examples":[{"en":"Some reunionists argued that the two regions should become one country again.","zh":"一些主张统一的人认为这两个地区应该再次成为一个国家。"},{"en":"In the debate, reunionists emphasized shared history and culture.","zh":"在辩论中，主张统一的人强调共同的历史与文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting the reunion of separated groups or political units; pro-reunification","zh":"支持重新统一的；主张复归合一的"},"examples":[{"en":"He took a reunionist position on the question of national unity.","zh":"在国家统一问题上，他采取了主张统一的立场。"},{"en":"The newspaper published several reunionist editorials.","zh":"那家报纸发表了几篇主张统一的社论。"}]}],"synonyms":["pro-reunification","unification supporter","reunifier","integrationist"],"phonetic":"/ˌriːˈjuːnjənɪst/","extraExplanation":["reunionist 来自 reunion（重新团聚/重新合并）+ -ist（表示“……主义者/支持者”）。它常见于政治语境，指支持“重新统一”的人或立场。","在历史写作中，它有时会被用来描述美国内战后强调“国家重新团结”的观点或群体；在其他地区语境里，也可能指支持某个分裂地区“回归/统一”的立场。具体含义通常要看上下文。"]}
{"word":"reunionistic","summary":{"en":"Reunionistic means ‘pro-reunification,’ especially in political contexts.","zh":"reunionistic 指“支持重新统一/再合并的”，尤用于政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or advocating reunion (the re-uniting of separated people, groups, or regions), especially in a political or national sense.","zh":"主张“重新统一/重新合并”的（尤指政治或国家层面的统一诉求）。"},"examples":[{"en":"Some reunionistic groups campaign for the two regions to reunify under one government.","zh":"一些主张统一的团体呼吁两地在同一政府之下重新统一。"},{"en":"His reunionistic speeches focused on shared history and a common future.","zh":"他的统一主义演讲强调共同的历史与共同的未来。"}]}],"synonyms":["pro-reunification","unificationist","reunification-minded","integrationist"],"phonetic":"/ˌriːˌjuːniəˈnɪstɪk/","extraExplanation":["“reunionistic”并不是非常常见的英语词，更常见的表达有：pro-reunification（支持统一的）、unificationist（统一主义的）、reunification-minded（倾向统一的）。","词形上它来自 reunion（重聚/再联合）+ -istic（“……主义的/……倾向的”），常用于政治语境，比如谈到分裂地区的“reunification（重新统一）”。使用时要注意语境，避免把它误当成单纯“同学会/家庭重聚”的 reunion。"]}
{"word":"reunions","summary":{"en":"Reunions are meetings or moments of coming together again after time apart.","zh":"Reunions 指久别后的重聚或重逢的时刻/聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gathering of people who have not seen each other for a long time (often family, classmates, or former coworkers)","zh":"久别重逢的聚会（常见于家人、同学或前同事）"},"examples":[{"en":"Our high school reunion is next summer.","zh":"我们的高中同学会在明年夏天。"},{"en":"She flew home for a family reunion during the holidays.","zh":"她在假期飞回家参加家庭聚会。"},{"en":"Reunions can feel awkward at first, but they’re often fun.","zh":"聚会一开始可能会尴尬，但通常很有趣。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of meeting again after a separation; a return to being together","zh":"重聚；再度相见（与……重新在一起的行为或过程）"},"examples":[{"en":"Their reunion at the airport was emotional.","zh":"他们在机场的重逢很感人。"},{"en":"After years apart, the reunion felt unreal.","zh":"分开多年后，这次重逢让人感觉不真实。"}]}],"synonyms":["get-together","gathering","meetup","homecoming","reconnection"],"phonetic":"/ˌriːˈjuːnjən/","extraExplanation":["“reunion”常用于“school reunion（同学会）”“class reunion（班级聚会）”“family reunion（家庭聚会）”。在美国文化里，reunion 往往带有“叙旧、更新近况”的意味，有时也会出现一点比较与尴尬，但通常是友好的社交场合。","词形提示：你输入的“reunions”是复数形式；单数是“reunion”。"]}
{"word":"reunitable","summary":{"en":"“Reunitable” means able to be reunited or brought together again.","zh":"“reunitable”表示“能够重新团聚/重新合并”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be reunited; capable of coming together again after being separated.","zh":"可重新团聚的；能够再度合并/重聚的。"},"examples":[{"en":"The siblings were separated for years, but they were reunitable after the war ended.","zh":"兄弟姐妹分离多年，但战争结束后他们仍有机会重新团聚。"},{"en":"The two parts look damaged, yet they may be reunitable with careful repair.","zh":"这两部分看起来受损，但如果小心修复，可能还能重新拼合在一起。"}]}],"synonyms":["reunifiable","able to be reunited","capable of reuniting","reconnectable"],"phonetic":"/ˌriːjuːˈnaɪtəbəl/","extraExplanation":["“reunitable”由 re-（再次）+ unite（联合/团聚）+ -able（能够……的）构成，字面意思就是“能够再次联合/团聚”。","它在日常英语里不算常见，更常见的表达是：can be reunited / able to reunite / reunifiable。"]}
{"word":"reunite","summary":{"en":"Reunite means to come together again after separation, or to bring people/things together again.","zh":"Reunite 指分开后再次团聚/重逢，也可指使人或事物重新联合在一起。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to come together again after being separated; to meet again","zh":"（分开后）再次团聚；重逢"},"examples":[{"en":"After ten years apart, the old friends reunited at a wedding.","zh":"分别十年后，这些老朋友在一场婚礼上重逢。"},{"en":"The family reunited at the airport after the long trip.","zh":"长途旅行后，这家人在机场团聚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring people or groups together again; to join again","zh":"使再次团聚；使重新联合"},"examples":[{"en":"The program helps reunite lost pets with their owners.","zh":"这个项目帮助走失的宠物与主人团聚。"},{"en":"The treaty aimed to reunite the two regions into one country.","zh":"这项条约旨在让两个地区重新统一为一个国家。"}]}],"synonyms":["rejoin","reconnect","get back together","reunify"],"phonetic":"/ˌriːjuˈnaɪt/","extraExplanation":["“re-”表示“再次”，“unite”表示“联合、团结”，所以 reunite 字面意思就是“再次联合”。常见搭配：reunite with（与……重逢/团聚）、reunite A and B（使A和B重聚/重新合并）。","文化语境里，reunite 常用于“家庭团聚（family reunion）”“同学会/老友重聚（reunion）”“失散亲人团圆”等场景，语气通常偏温暖、带情感色彩。"]}
{"word":"reunited","summary":{"en":"Reunited means brought together again after being separated, often used for people, families, or even pets and owners.","zh":"Reunited 指分开后再次团聚/重逢，常用于人、家庭，也可用于宠物与主人等重新相聚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"brought together again after being separated","zh":"（分开后）再次团聚的；重新相聚的"},"examples":[{"en":"After ten years apart, the sisters were finally reunited.","zh":"分开十年后，这对姐妹终于团聚了。"},{"en":"The reunited family took a photo at the airport.","zh":"团聚的一家人在机场拍了张照片。"}]},{"partOfSpeech":"v.","definition":{"en":"came together again after being separated","zh":"（分开后）再次团聚；重新相聚"},"examples":[{"en":"He reunited with his childhood friend at the reunion.","zh":"他在同学聚会上和儿时朋友重逢了。"},{"en":"The lost dog was reunited with its owner.","zh":"走失的狗和主人重新团聚了。"}]}],"synonyms":["reconnected","rejoined","brought back together","met again"],"phonetic":"/ˌri.juˈnaɪ.tɪd/","extraExplanation":["“reunited”既常作形容词（reunited family 团聚的家庭），也常作动词“reunite”的过去式/过去分词（They reunited. 他们重逢了）。","常见搭配：be reunited with（与……重逢/团聚）；a reunited family（团聚的家庭）。注意：reunion（n. 聚会/重逢）指“活动/场合”，reunite（v. 团聚）指“动作”。"]}
{"word":"reunitedly","summary":{"en":"“Reunitedly” means “in a reunited way; together again after being separated.”","zh":"“reunitedly”表示“以重聚的方式；分离后重新在一起”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows people or things have come back together again after being separated.","zh":"以（人与人或事物）重新团聚、重合为一体的方式；带着“重聚后”的状态。"},"examples":[{"en":"After years apart, the siblings stood reunitedly at their father’s bedside.","zh":"分离多年后，兄妹们在父亲病床前以重聚的姿态站在一起。"},{"en":"The band played reunitedly for one final concert.","zh":"乐队重聚后一起演出，举办了最后一场音乐会。"}]}],"synonyms":["together again","in reunion","after reuniting","once again together"],"phonetic":"/ˌri(j)uˈnaɪtɪdli/","extraExplanation":["“reunitedly”较少见，更自然的表达常用：together again / once again together / after reuniting / in reunion。","构词上是 reunited（重聚的）+ -ly（副词后缀），表示“以……的方式”。在写作中偶尔用于强调“重聚的状态/情绪”，但在口语中不常用。"]}
{"word":"reuniter","summary":{"en":"Reuniter means someone or something that brings people back together after being separated.","zh":"reuniter 指让分离的人重新团聚、或让分开的事物重新合在一起的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that reunites people or brings separated parts back together","zh":"使人们重聚的人；使分离的事物重新合在一起的事物"},"examples":[{"en":"The family thanked the volunteer who became their reuniter after years apart.","zh":"这家人感谢那位志愿者——多年分别后，是他让他们重新团聚。"},{"en":"In the story, music is the reuniter that connects old friends again.","zh":"在故事里，音乐是让老朋友再次连结的“重聚者”。"}]}],"synonyms":["reconciler","unifier","connector","peacemaker"],"phonetic":"/ˌri.juˈnaɪ.tɚ/","extraExplanation":["“reuniter”是由动词“reunite（使重聚/再结合）”加上表示“……的人/物”的后缀“-er”构成，字面意思就是“促成重聚的人/事物”。","这个词在日常英语里不算常见；更常用的表达包括“someone/something that reunites …（使……重聚的人/事物）”或直接用动词“reunite”。在某些文学或修辞语境里，用“reuniter”可以让表达更凝练、更有拟人化效果。"]}
{"word":"reuniters","summary":{"en":"“Reuniters” means people who help bring separated people or groups together again.","zh":"“reuniters”指促成分离的人或团体重新团聚的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who reunite others; those who bring separated people or groups back together again","zh":"让人们重新团聚的人；促使分离的人或团体再次合在一起的人"},"examples":[{"en":"The volunteers became reuniters, helping families find each other after the storm.","zh":"这些志愿者成了“团聚促成者”，在暴风雨后帮助家庭成员彼此找到对方。"},{"en":"In many communities, social workers act as reuniters for children and their parents.","zh":"在许多社区里，社工常常充当孩子与父母的“团聚促成者”。"}]}],"synonyms":["reunification workers","connectors","matchmakers","mediators"],"phonetic":"/ˌriːjuːˈnaɪtərz/","extraExplanation":["“reuniter”来自动词“reunite”（使重聚、重新联合）加上表示“做某事的人”的后缀“-er”。“reuniters”是其复数形式。这个词不算常用，更常见的说法是“people who reunite families / family reunification workers / reunification volunteers”等，根据语境选择更自然。"]}
{"word":"reunites","summary":{"en":"“Reunites” means “brings together again” or “meets again after separation.” It is the third-person singular form of “reunite.”","zh":"“Reunites”表示“再次聚在一起/重聚”，是“reunite”的第三人称单数现在时形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bring people or things together again after they have been separated; to join again","zh":"（使）在分离后再次相聚；重新联合"},"examples":[{"en":"The festival reunites families who live far apart.","zh":"这个节日让住得很远的家人再次团聚。"},{"en":"The coach reunites the old teammates for one last game.","zh":"教练把老队友们重新召集起来打一场告别赛。"}]},{"partOfSpeech":"v.","definition":{"en":"to meet again after a period of separation (often about friends, family, or couples)","zh":"（人们）在一段分离后重逢（常指朋友、家人或伴侣）"},"examples":[{"en":"After years abroad, she reunites with her best friend.","zh":"在国外多年后，她与最好的朋友重逢。"},{"en":"He reunites with his son at the airport.","zh":"他在机场与儿子重逢。"}]}],"synonyms":["brings back together","reconnects","regathers","rejoins"],"phonetic":"/ˌri.juˈnaɪts/","extraExplanation":["“reunites”是动词“reunite”的第三人称单数现在时形式（he/she/it reunites）。例如：\"The movie reunites the main characters.\"（这部电影让主角们再次相聚。）","词形拆解：re-（再次）+ unite（联合、团结）→ reunite（再次联合/重聚）。常见名词形式是“reunion”（重聚、同学会）。"]}
{"word":"reuniting","summary":{"en":"Reuniting means coming together again after being apart, or bringing people/things together again.","zh":"reuniting 指分开后再次团聚，或使人/事物重新聚在一起。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of reunite) coming together again after being apart; bringing people or things together again.","zh":"（reunite 的现在分词）在分开一段时间后再次团聚；使人或事物重新聚在一起。"},"examples":[{"en":"After years apart, the family is reuniting in New York.","zh":"分开多年后，这家人将在纽约重新团聚。"},{"en":"The charity is reuniting lost pets with their owners.","zh":"这个慈善机构正在帮助走失的宠物与主人重聚。"},{"en":"We’re reuniting with old friends from college this weekend.","zh":"这个周末我们要和大学老朋友重聚。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of meeting again after separation (used as a gerund).","zh":"重聚、再会的行为或过程（作动名词用）。"},"examples":[{"en":"Reuniting with her sister brought her a lot of comfort.","zh":"与姐姐重聚给了她很大的安慰。"},{"en":"They planned a small dinner to celebrate the reuniting of the team.","zh":"他们计划办一场小晚餐来庆祝团队重聚。"}]}],"synonyms":["getting back together","reconnecting","coming together again","bringing back together","rejoining"],"phonetic":"/ˌriːjuːˈnaɪtɪŋ/","extraExplanation":["“reunite”由 re-（再次）+ unite（联合、团结）组成，所以语感上常带有“分开之后再次在一起”的温情或重要性。","常见搭配：reuniting with（与……重聚）、reuniting families（让家庭团聚）、reuniting a band/team（让乐队/团队重组或再聚）。","注意与“meet again（再见面）”的区别：meet again 更中性；reunite 更强调曾经分离、现在重新结合（常有情感色彩）。"]}
{"word":"reunition","summary":{"en":"“Reunition” is rare and usually nonstandard; people typically mean “reunion” (a get-together again) or “reunification” (the act of reuniting).","zh":"“reunition”很罕见，通常属于非标准用法；一般想表达“reunion（重聚/聚会）”或“reunification（重新统一/合并）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/incorrect spelling) A reunion; a gathering or coming together again after being apart.","zh":"（罕见/常被视为拼写错误）重聚；分开一段时间后再次相聚或聚会。"},"examples":[{"en":"Many people write “reunition,” but the standard spelling is “reunion.”","zh":"很多人会写成“reunition”，但标准拼写是“reunion”。"},{"en":"The family planned a reunion to celebrate their grandparents’ anniversary.","zh":"这家人计划举办一次家庭重聚来庆祝祖父母的结婚纪念日。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) The act of reuniting or bringing things back together; reunification.","zh":"（罕见，较正式）重新合并；使分离的事物再次结合（类似“reunification”）。"},"examples":[{"en":"Talks focused on the reunification of the two groups.","zh":"会谈重点在于两个团体的重新合并。"},{"en":"They hoped for reunification after years of separation.","zh":"经历多年分离后，他们希望能重新团聚/统一。"}]}],"synonyms":["reunion","reunification","regathering","reassembly"],"phonetic":"/ˌri.juˈnɪʃən/","extraExplanation":["“reunition”在现代英语中非常少见，很多时候被当作把“reunion（重聚）”和“reunification（重新统一/合并）”混在一起写出来的非标准拼写。正式写作或考试中建议用“reunion”或“reunification”。","常见搭配：family reunion（家庭聚会/重聚）、school reunion（同学会）、reunification of a country/region（国家/地区统一）。"]}
{"word":"reunitive","summary":{"en":"Reunitive means “helping to reunite; bringing back together,” but it is rare in modern English.","zh":"reunitive 意为“促成重聚的、使重新团聚的”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"tending to bring people or things back together; having the effect of reuniting.","zh":"倾向于（使人或事物）重新团聚的；具有促成重聚作用的。"},"examples":[{"en":"The reunitive dinner helped the family reconnect after years apart.","zh":"这顿促成团聚的晚餐帮助一家人在多年分离后重新联系起来。"},{"en":"They planned a reunitive trip to their hometown to see old friends again.","zh":"他们计划了一次促成重聚的返乡之旅，再次见到老朋友。"}]}],"synonyms":["reuniting","reunifying","reconciliatory","unifying"],"phonetic":"/riˈjunɪtɪv/","extraExplanation":["“reunitive”在现代英语里非常少见，多数情况下母语者更常用 reuniting / reunifying / bringing people together 来表达同样意思。","构词上由 re-（再次）+ unite（联合、团聚）+ -ive（……的、具有……作用的）组成，字面意思就是“具有重新团聚作用的”。"]}
{"word":"reunpack","summary":{"en":"Reunpack means to unpack something again, often to check or reorganize it.","zh":"Reunpack 指把东西再次拆开/打开取出，常用于检查或重新整理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to unpack something again (usually because you need to check, rearrange, or remove something).","zh":"再次把（东西）拆开、打开并取出内容物（通常因为需要检查、整理或拿出某物）。"},"examples":[{"en":"At airport security, I had to reunpack my suitcase to show the charger.","zh":"在机场安检时，我不得不把行李箱重新打开并取出东西，好出示充电器。"},{"en":"If the package looks damaged, reunpack it carefully and check the items inside.","zh":"如果包裹看起来受损，请小心重新拆开检查里面的物品。"}]},{"partOfSpeech":"vt.","definition":{"en":"to unpack again and then pack again in a different way (to organize better).","zh":"重新拆开后再按不同方式打包（为了更好地整理）。"},"examples":[{"en":"We reunpacked the box and packed the books with more padding.","zh":"我们把箱子重新拆开，然后给书加了更多缓冲材料再重新打包。"},{"en":"She reunpacked her backpack so the heavier items were closer to her back.","zh":"她把背包重新整理打包，让较重的东西更靠近背部。"}]}],"synonyms":["unpack again","open up again","unpack and repack","repack"],"phonetic":"/ˌriːʌnˈpæk/","extraExplanation":["“reunpack”由前缀 re-（表示“再次”）+ unpack（拆开/打开包装）构成。它在口语和工作场景中偶尔会用到，但比 “unpack again” 更少见；写作中也可以用更自然的表达，如 “open it up again” 或 “unpack it and repack it.”"]}
{"word":"reuphold","summary":{"en":"“Reuphold” means “uphold again,” but it’s rare; native speakers usually say “reaffirm,” “reassert,” or “uphold again.”","zh":"“reuphold”意为“再次维持/维护”，但非常少见；更常用的是“reaffirm / reassert / uphold again”等表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to uphold again; to support, defend, or maintain something once more (rare and not standard in modern English)","zh":"再次维护/支持/坚持某事（较少见、现代英语中不常用）"},"examples":[{"en":"The court’s ruling seemed to reuphold the earlier decision.","zh":"法院的裁决似乎再次维持了先前的决定。"},{"en":"Leaders tried to reuphold public trust after the scandal.","zh":"丑闻之后，领导人试图重新维护公众信任。"}]}],"synonyms":["reaffirm","reassert","renew","uphold again"],"phonetic":"/ˌriːʌpˈhoʊld/","extraExplanation":["“reuphold”在当代英语里非常少见，很多读者会觉得不自然。通常更常用、更地道的表达是：\n- reassert（重新强调/重申）\n- reaffirm（再次确认/重申）\n- renew (support/commitment)（重新给予支持/更新承诺）\n- uphold again / continue to uphold（再次维持/继续维护）\n如果你想表达“重新装潢家具的外皮/重新包布”，常见正确词是 **reupholster**，不是 reuphold。"]}
{"word":"reupholster","summary":{"en":"Reupholster means to put new covering and padding on furniture.","zh":"reupholster 指给家具重新更换包布/皮和软垫。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put new fabric/leather and padding on a piece of furniture (like a sofa or chair) to repair it or change its look","zh":"（给沙发、椅子等）重新装饰软垫；重新包（布/皮）"},"examples":[{"en":"We decided to reupholster the old armchair instead of buying a new one.","zh":"我们决定把那把旧扶手椅重新包起来，而不是买新的。"},{"en":"The couch was reupholstered in blue fabric to match the living room.","zh":"这张沙发重新换成了蓝色布料，以搭配客厅。"}]}],"synonyms":["recover","refurbish","restore"],"phonetic":"/ˌriː.ʌpˈhoʊl.stɚ/","extraExplanation":["词形拆分：re- 表示“再次/重新”，upholster 表示“给家具装软垫并包面料”。合在一起就是“重新给家具换面料和填充”。","常见语境：家居翻新、二手家具修复、室内设计。相比 repair（修理）更强调“换外层面料和软垫”的工艺。","发音小提示：重音通常在第二个音节（-PHOL-），读起来像“ree-up-HOL-ster”。"]}
{"word":"reupholstered","summary":{"en":"Reupholstered means furniture was covered again with new fabric/leather and padding.","zh":"Reupholstered 指家具已重新包面：更换新的布料/皮革和填充物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of reupholster: to put new fabric/leather and padding on a piece of furniture (often to repair or refresh it)","zh":"reupholster 的过去式/过去分词：给家具重新包面（更换布料/皮革与填充物），常用于修复或翻新"},"examples":[{"en":"They reupholstered the sofa in dark blue velvet.","zh":"他们把沙发重新包面，换成了深蓝色天鹅绒。"},{"en":"The chair was reupholstered to match the new curtains.","zh":"这把椅子重新包面了，以搭配新窗帘。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing furniture that has been covered again with new upholstery","zh":"（形容词用法）指家具已经重新包面/重新换过面料"},"examples":[{"en":"We bought a reupholstered armchair at a vintage shop.","zh":"我们在一家复古店买了一把重新包面的扶手椅。"},{"en":"The reupholstered seats look brand-new.","zh":"这些重新包面的座椅看起来像全新的一样。"}]}],"synonyms":["refurbished","recovered","restored","renovated"],"phonetic":"/ˌri.ʌpˈhoʊlstərd/","extraExplanation":["“Upholstery” 指家具的“软包部分”，通常包括面料/皮革、海绵或棉絮等填充物，以及固定用的钉子/订书钉等。","在家装语境里，reupholster 常见于沙发（sofa/couch）、扶手椅（armchair）、餐椅（dining chair）等；比起直接买新的，重新包面可以保留框架、改变风格，也更环保。","拼写里 re- 表示“再次”，upholster 表示“给家具做软包/包面”，合起来就是“重新包面”。"]}
{"word":"reupholsterer","summary":{"en":"A reupholsterer is a professional who repairs or replaces the fabric and padding on furniture.","zh":"reupholsterer 指专门为家具更换或修复面料与填充物的师傅（强调“重新包面/重新装潢”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to replace or repair the fabric, padding, and springs on furniture (such as sofas and chairs)","zh":"（给家具）重新装潢/换面料的人；家具重新包面师傅（如给沙发、椅子更换布料、填充物、弹簧等）"},"examples":[{"en":"We hired a reupholsterer to fix our old armchair instead of buying a new one.","zh":"我们请了一个重新包面师傅修理旧扶手椅，而不是买新的。"},{"en":"The reupholsterer showed us several fabrics that match the living room style.","zh":"重新装潢师傅给我们看了几种与客厅风格相配的面料。"}]}],"synonyms":["upholsterer","furniture upholsterer"],"phonetic":"/ˌriː.ʌpˈhoʊl.stɚ.ɚ/","extraExplanation":["“reupholsterer”来自动词 reupholster（给家具重新包面/重新装潢）+ 表示“从事某工作的人”的后缀 -er。常见于家居装修、古董修复与室内设计语境。","在英语里也常听到更口语、更常用的说法 upholsterer（装潢师傅/家具包面师傅）；reupholsterer 更强调“重新”更换旧家具的面料与填充。"]}
{"word":"reupholsteries","summary":{"en":"“Reupholsteries” means reupholstery shops or multiple reupholstery jobs.","zh":"“reupholsteries”指多家重新装潢店，或多项家具重新装潢的工作/工序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the businesses or workshops that reupholster furniture (places where old furniture is given new fabric and padding)","zh":"家具重新装潢（换布、换填充物等）的店铺／作坊（复数）"},"examples":[{"en":"We took the antique chair to one of the local reupholsteries for an estimate.","zh":"我们把那把古董椅拿到附近的一家重新装潢店估价。"},{"en":"Many reupholsteries can match the original fabric style if you bring a sample.","zh":"很多重新装潢店如果你带样布，就能尽量匹配原来的布料风格。"}]},{"partOfSpeech":"n.","definition":{"en":"the processes or jobs of reupholstering furniture","zh":"重新装潢（给家具换面料与填充物等）的工作／工序（复数）"},"examples":[{"en":"The sofa needs reupholsteries, not just a quick cleaning.","zh":"这张沙发需要重新装潢，而不只是简单清洁。"},{"en":"They specialized in careful reupholsteries for vintage couches.","zh":"他们擅长为复古沙发做细致的重新装潢。"}]}],"synonyms":["reupholstery shops","upholstery shops","reupholstery work","upholstery work"],"phonetic":"/ˌriː.ʌpˈhoʊl.stɚ.iːz/","extraExplanation":["“reupholsteries”来自名词“reupholstery”，更常见的表达通常是“reupholstery shops”（重新装潢店）或直接说“reupholstery”（不可数：这类工作/服务）。在日常英语里，“reupholsteries”作为复数不算特别常见，但在谈“多家店”或“多项装潢工作”时可以用。"]}
{"word":"reupholstering","summary":{"en":"Reupholstering means replacing or repairing a piece of furniture’s fabric/leather covering (and often its padding).","zh":"Reupholstering 指给家具更换或修复外层布面/皮面，并常常连同内里填充一起翻新。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of replacing or repairing the covering (fabric/leather) and padding of furniture","zh":"（家具的）重新装潢；重换面料与填充（如沙发、椅子）"},"examples":[{"en":"Reupholstering the sofa cost less than buying a new one.","zh":"给沙发重新装潢的费用比买新的更便宜。"},{"en":"They are reupholstering the dining chairs with durable fabric.","zh":"他们正在用耐用的布料给餐椅重新装潢。"},{"en":"After reupholstering, the old armchair looked brand new.","zh":"重新装潢后，那把旧扶手椅看起来像全新的一样。"}]},{"partOfSpeech":"v.","definition":{"en":"recovering furniture with new fabric/leather and often replacing some padding","zh":"给家具换新面料/皮革，并常常更换部分填充物"},"examples":[{"en":"She is reupholstering a vintage chair for her apartment.","zh":"她正在为公寓重新装潢一把复古椅子。"},{"en":"We’re reupholstering the headboard to match the curtains.","zh":"我们在给床头板重新包面料，让它和窗帘相配。"}]}],"synonyms":["recovering","reupholstery","re-covering (furniture)","refurbishing (furniture)"],"phonetic":"/ˌriː.ʌpˈhoʊl.stɚ/","extraExplanation":["“Reupholster”= re-（再次）+ upholster（装潢/为家具包面）。日常里常见于家居翻新、二手家具改造（upcycling）或修复（restoration）的语境。","和“refinishing（重新上漆/做表面处理）”不同，reupholstering 主要针对“布面/皮面和内里填充”，而不是木头表面。"]}
{"word":"reupholsters","summary":{"en":"“Reupholsters” means “covers furniture with new upholstery again.”","zh":"“reupholsters”意为“给家具重新包面/更换软包”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to cover a piece of furniture with new fabric/leather and padding again; to replace the upholstery.","zh":"（第三人称单数）给家具重新装上（布料/皮革与填充物）；更换家具的包面。"},"examples":[{"en":"She reupholsters old chairs to match modern living rooms.","zh":"她给旧椅子重新包面，让它们更搭现代客厅。"},{"en":"The shop reupholsters sofas, stools, and dining seats.","zh":"那家店提供沙发、凳子和餐椅的重新包面服务。"},{"en":"He reupholsters the armchair instead of buying a new one.","zh":"他选择给扶手椅重新包面，而不是买新的。"}]}],"synonyms":["recovers","re-covers","re-cushions","re-trims","restores (furniture)"],"phonetic":"/ˌriʌpˈhoʊlstɚz/","extraExplanation":["“re-”表示“再次/重新”。“upholster”指给家具加上填充物并用布料或皮革包覆；常见搭配：reupholster a sofa/chair/armchair（给沙发/椅子/扶手椅重新包面）。","这个词多用于家居、装修、二手家具修复语境；在北美也常与“refinish（重新上漆/翻新木质部分）”一起出现：refinish and reupholster（木部翻新+软包更换）。"]}
{"word":"reupholstery","summary":{"en":"Reupholstery is the process of re-covering and re-padding furniture with new materials.","zh":"Reupholstery 指用新面料和填充物为家具等重新装潢、翻新。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of putting new fabric and padding on furniture (or a vehicle seat), usually to repair or refresh it","zh":"（家具或车座等的）重新装潢；换面料与填充物（通常为修复或翻新）"},"examples":[{"en":"The old sofa looks brand-new after reupholstery.","zh":"那张旧沙发重新装潢后看起来像新的。"},{"en":"We chose durable fabric for the chair’s reupholstery.","zh":"我们为这把椅子的重新装潢选择了耐用的面料。"},{"en":"Reupholstery can cost less than buying new furniture, especially for solid wood pieces.","zh":"重新装潢的费用有时比买新家具更低，尤其是实木家具。"}]}],"synonyms":["re-covering","refurbishing (furniture)","reupholstering"],"phonetic":"/ˌriːʌˈpoʊlstəri/","extraExplanation":["“re-”表示“再一次/重新”，加在“upholstery（装潢/软包）”前形成“reupholstery”，强调把旧家具的面料、海绵/填充物等拆掉并更换。","常见搭配：reupholstery fabric（重装面料）、reupholstery shop（装潢店）、reupholstery project（翻新项目）。动词通常说 reupholster（给……重新装潢）。"]}
{"word":"reuplift","summary":{"en":"Reuplift means to lift something up again or to encourage someone again after a setback.","zh":"Reuplift 指“再次抬起某物”或“在受挫后再次鼓舞某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lift something up again; to raise something back to a higher position","zh":"再次把某物抬起；把某物重新举到更高的位置"},"examples":[{"en":"We had to reuplift the box after it slipped from the shelf.","zh":"箱子从架子上滑下来后，我们得把它再抬上去。"},{"en":"The workers reuplifted the fallen beam into place.","zh":"工人们把倒下的横梁重新抬回原位。"}]},{"partOfSpeech":"vt.","definition":{"en":"to uplift someone again; to improve someone’s mood or hope after a setback","zh":"再次鼓舞（某人）；在受挫后让某人的情绪或希望重新振作"},"examples":[{"en":"Kind words can reuplift a friend who feels defeated.","zh":"温暖的话语能再次鼓舞感到挫败的朋友。"},{"en":"The team meeting helped reuplift everyone after the loss.","zh":"那次团队会议在失利后帮助大家重新振作。"}]}],"synonyms":["lift again","raise again","uplift again","encourage","cheer up","revive"],"phonetic":"/ˌriːʌpˈlɪft/","extraExplanation":["“reuplift”不是很常见的标准词，日常英语里更常用“lift again / raise again”（再次抬起）或“uplift again / cheer up / encourage”（再次鼓舞）。","它由前缀“re-（再次）”+“uplift（抬起；鼓舞）”构成；写作时也可能见到带连字符的形式“re-uplift”，更清楚易读。"]}
{"word":"reurge","summary":{"en":"“Reurge” means to urge someone again, repeating a strong request or suggestion.","zh":"“Reurge”表示再次催促或重申强烈的请求/建议（更常写作 re-urge）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to urge someone again; to repeat a request or strong suggestion","zh":"再次催促（某人）；重申请求或强烈建议"},"examples":[{"en":"I reurged him to apply before the deadline.","zh":"我再次催促他在截止日期前申请。"},{"en":"The teacher reurged the class to check their work carefully.","zh":"老师再次提醒全班要仔细检查作业。"}]}],"synonyms":["urge again","press","reiterate","remind"],"phonetic":"/ˌriˈɝːdʒ/","extraExplanation":["“reurge”这个拼写在现代英语里比较少见；更常见的写法是带连字符的 **re-urge**（表示“再一次urge”），或改用更自然的表达，如 **urge again / remind / press**。","如果你原本想写的是 **resurge**（“再次出现/复兴”），那是另一个不同的词，意思更接近“重新兴起”。"]}
{"word":"reusability","summary":{"en":"Reusability means the ability or quality of being used again, especially in sustainability, design, and software.","zh":"Reusability 指“可重复使用性/可复用性”，常用于环保、设计工程与软件领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be used again, often in different situations or for different purposes.","zh":"可重复使用性；可复用性（指某物能再次使用，常用于不同场景或用途）"},"examples":[{"en":"This water bottle’s reusability helps reduce plastic waste.","zh":"这个水瓶可重复使用，有助于减少塑料垃圾。"},{"en":"In software, reusability means you can use the same code in many projects.","zh":"在软件中，可复用性意味着同一段代码可以用于很多项目。"}]},{"partOfSpeech":"n.","definition":{"en":"In design or engineering, the ability of a part, material, or system to be reused after cleaning, repair, or refitting.","zh":"（设计/工程）再利用能力（指部件、材料或系统经过清洁、维修或改装后还能再次使用）"},"examples":[{"en":"The team improved the reusability of the packaging by making it easy to wash.","zh":"团队通过让包装易清洗来提升其再利用能力。"},{"en":"Rocket reusability can greatly lower the cost of space launches.","zh":"火箭的可重复使用性可以大幅降低航天发射成本。"}]}],"synonyms":["reuse","recyclability (related but different)","reusableness"],"phonetic":"/riˌjuːzəˈbɪləti/","extraExplanation":["“Reusability”由 reuse（再使用）+ -ability（……的能力/性质）构成，常见于环保语境（减少一次性用品）和技术语境（软件模块、组件设计）。","常见搭配：reusability of materials（材料的可再利用性）；improve/enhance reusability（提高可复用性）；focus on reusability（重视可复用性）。"]}
{"word":"reusable","summary":{"en":"Reusable means something can be used again instead of being thrown away after one use.","zh":"Reusable 指“可再次使用”的物品，不是用一次就丢弃的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be used again; designed to be used more than once.","zh":"可重复使用的；设计成可以用多次的。"},"examples":[{"en":"Bring a reusable water bottle to reduce plastic waste.","zh":"带一个可重复使用的水瓶来减少塑料垃圾。"},{"en":"The company switched to reusable containers for deliveries.","zh":"这家公司改用可重复使用的容器来送货。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Able to be used in different situations or projects without changing much.","zh":"（计算机）可复用的；能在不同场景或项目中重复使用而无需大改的。"},"examples":[{"en":"We wrote reusable code to save time on future projects.","zh":"我们写了可复用的代码，以节省未来项目的时间。"}]}],"synonyms":["recyclable (related but different)","multi-use","durable (partly related)"],"phonetic":"/riːˈjuːzəbəl/","extraExplanation":["“Reusable”常见于环保语境（reusable bag / cup / straw），强调“减少一次性用品（single-use）”。","词形结构：re-（再、重新）+ use（使用）+ -able（能够……的）。常见对应词：reusable vs. disposable（一次性的）。"]}
{"word":"reusableness","summary":{"en":"Reusableness means the quality of being reusable—able to be used again.","zh":"Reusableness 指“可重复使用的特性/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being able to be used again (being reusable)","zh":"可重复使用性；可再利用的特性"},"examples":[{"en":"The reusableness of these containers helps reduce plastic waste.","zh":"这些容器的可重复使用性有助于减少塑料垃圾。"},{"en":"Designers are improving the reusableness of products by using stronger materials.","zh":"设计师通过使用更坚固的材料来提升产品的可重复使用性。"}]}],"synonyms":["reusability","reusability (of something)","recyclability (related but not the same)"],"phonetic":"/riˈjuːzəbəlnəs/","extraExplanation":["“reusableness”在现代英语中比较少见，更常用、更自然的说法是“reusability”。两者意思几乎相同，但在商业、工程、环保语境里通常会选择“reusability”（如：software reusability 软件复用性；packaging reusability 包装可重复使用性）。","构词上，“reusable（可重复使用的）+ -ness（名词后缀，表示性质/状态）→ reusableness”。虽然语法上成立，但因为“reusability”更固定、更常见，所以写作时建议优先用“reusability”。"]}
{"word":"reusabness","summary":{"en":"Reusability means the ability to be used again, especially to save resources or effort.","zh":"Reusability 指“可重复使用性/可复用性”，强调能再次使用以节省资源或工作量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability or quality of being able to be used again (often to reduce waste, cost, or effort)","zh":"可重复使用性；可复用性（指某物能够再次使用的能力或特性，常用于减少浪费、成本或工作量）"},"examples":[{"en":"The reusability of glass bottles helps cut down on plastic waste.","zh":"玻璃瓶的可重复使用性有助于减少塑料垃圾。"},{"en":"In software, good reusability means you can use the same code in different projects.","zh":"在软件领域，良好的可复用性意味着你可以在不同项目中复用同一段代码。"},{"en":"They tested the reusability of the masks after several washes.","zh":"他们测试了口罩在多次清洗后的可重复使用性。"}]}],"synonyms":["reuse","recyclability (related)","reusableness (less common)"],"phonetic":"/riˌjuːzəˈbɪləti/","extraExplanation":["你输入的“reusabness”通常被认为是拼写错误。英语里更常用的名词是 **reusability**（最常见），有时也会看到较少用的 **reusableness**。","在日常语境里（环保、产品设计）常说 reusability；在编程语境里也常说 reusability，意思接近“复用性/可重用性”。"]}
{"word":"reuse","summary":{"en":"Reuse means using something again—either the same way or for a new purpose.","zh":"Reuse 指把某物再次使用：可以继续原用途，也可以改作他用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use something again, often for a similar purpose","zh":"再使用；重复使用（某物），常用于相似用途"},"examples":[{"en":"We can reuse these glass jars to store rice and beans.","zh":"我们可以重复使用这些玻璃罐来存放米和豆子。"},{"en":"Please reuse your towel to save water during your stay.","zh":"入住期间请重复使用毛巾，以节约用水。"}]},{"partOfSpeech":"v.","definition":{"en":"to use something again in a new way or for a different purpose","zh":"改作他用；以新的方式再次利用（某物）"},"examples":[{"en":"She reused old wooden pallets to make a garden table.","zh":"她把旧木托盘改作他用，做成了一张花园桌。"},{"en":"The author reused a traditional myth as the base for a modern story.","zh":"这位作者借用传统神话，作为现代故事的基础。"}]}],"synonyms":["use again","repurpose","reutilize"],"phonetic":"/riˈjuːz/","extraExplanation":["“reuse”常见于环保语境（Reduce, Reuse, Recycle：减少、再使用、回收）。其中 reuse 强调“东西还没变成垃圾前就继续用/改用”，而 recycle 通常指“回收后加工再制成新材料”。","词形提示：reuse（动词）→ reusable（可重复使用的，形容词）；reuse（名词用法较少，常写作 “the reuse of water/containers” 表示“再利用”）。"]}
{"word":"reuseable","summary":{"en":"“Reusable” means something can be used again and again, not just once.","zh":"“Reusable”指“可重复使用的”，不是一次性用品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be used again (instead of being thrown away after one use).","zh":"可重复使用的；可再次利用的（不是一次性用完就丢）。"},"examples":[{"en":"Bring a reusable water bottle to reduce plastic waste.","zh":"带一个可重复使用的水瓶来减少塑料垃圾。"},{"en":"The store gives a discount if you bring a reusable bag.","zh":"如果你自带可重复使用的购物袋，商店会打折。"},{"en":"Reusable containers are common in school lunches.","zh":"可重复使用的饭盒在学校午餐中很常见。"}]}],"synonyms":["recyclable","refillable","durable","multi-use","washable"],"phonetic":"/riˈjuzəbəl/","extraExplanation":["你输入的 **reuseable** 通常被视为拼写错误；标准拼写是 **reusable**（来自 reuse + -able）。","发音上常见为 /riˈjuzəbəl/，中间的 “-se-” 读音会弱化成 /zə/。","有时也会看到 **re-use**（带连字符）用于强调“再次使用”的动作，但形容词通常写作 **reusable**。"]}
{"word":"reuseableness","summary":{"en":"“Reuseableness” means the quality of being reusable, but it’s uncommon; “reusability” is more standard.","zh":"“reuseableness”表示“可重复使用性”，但不常见；更标准的说法是“reusability”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being reusable; the ability of something to be used again (often after cleaning, refilling, or repairing)","zh":"可重复使用性；可再利用的特性（常指清洗、补充或修理后还能再用）"},"examples":[{"en":"The designer improved the bottle’s reusableness by making it easier to wash.","zh":"设计师通过让瓶子更容易清洗，提高了它的可重复使用性。"},{"en":"We should consider the reusableness of packaging to reduce waste.","zh":"为了减少浪费，我们应该考虑包装的可重复使用性。"}]}],"synonyms":["reusability","reusableness","reusability (of something)","ability to be reused"],"phonetic":"/ˌriːˈjuːzəbəlnəs/","extraExplanation":["“reuseableness”在现代英语里很少见，更常用的是“reusableness”或“reusability”。在正式写作（学术、商业、工程）中，通常选“reusability”。","构词上：reuse（再使用）→ reusable（可再使用的）→ reusableness / reusability（名词：可再使用性）。拼写里更常见的是去掉一个 e 的“reusableness”。"]}
{"word":"reuseabness","summary":{"en":"Reusableness means the quality of being reusable (though “reusability” is much more common).","zh":"Reusableness 指“可重复使用性”，但更常见、更标准的说法是 reusability。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The quality of being reusable; the degree to which something can be used again.","zh":"（不常用）可重复使用性；某物再次被使用的程度。"},"examples":[{"en":"The reusableness of these containers reduces waste.","zh":"这些容器的可重复使用性减少了浪费。"},{"en":"Designers improved the reusableness of the packaging by making it easier to clean.","zh":"设计师通过让包装更易清洁来提高其可重复使用性。"}]}],"synonyms":["reusability","reusability rate","reusability potential"],"phonetic":"/riˈjuːzəbəlnəs/","extraExplanation":["“reusableness”这个词在现代英语里比较少见，更常用的是 **reusability**（更正式/更常见）或 **reusability of + 名词**。","你输入的拼写“reuseabness”看起来像是把 *reuse* 和 *-ableness* 拼在一起时漏/多了字母。更标准的拼写是 **reusableness**（仍较少用）或直接用 **reusability**。","词形小提示：*reusable*（可重复使用的，adj.）→ *reusability*（可重复使用性，n.）是最常见的一组搭配。"]}
{"word":"reused","summary":{"en":"“Reused” means used again; it can also be the past form of “reuse.”","zh":"“reused”表示“再次使用的/被重复利用的”，也可作“reuse”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used again instead of being thrown away; used more than once (often to reduce waste).","zh":"再次使用的；重复利用的（常指为了减少浪费）。"},"examples":[{"en":"These bottles are washed and reused.","zh":"这些瓶子被清洗后再重复使用。"},{"en":"The company sells reused packaging to cut down on trash.","zh":"这家公司出售重复利用的包装来减少垃圾。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “reuse”: to use something again.","zh":"“reuse”的过去式/过去分词：再次使用；重复利用。"},"examples":[{"en":"We reused last year’s decorations for the party.","zh":"我们重复使用了去年的派对装饰。"},{"en":"The paper was reused for notes.","zh":"这张纸被再次用来记笔记。"}]}],"synonyms":["used again","repurposed","secondhand (sometimes)","recycled (related, but not the same)"],"phonetic":"/riˈjuzd/","extraExplanation":["在环保语境里，reuse（重复使用）常和 recycle（回收再加工）区分：reuse 是“直接再用”，recycle 通常需要“加工处理后再利用”。","reused 作形容词时常见于二手市场或包装领域，例如 reused materials（重复利用材料）、reused packaging（重复利用包装）。"]}
{"word":"reuses","summary":{"en":"“reuses” means “uses again” (third-person singular of “reuse”), often in everyday or environmental contexts.","zh":"“reuses”表示“再次使用/再利用”，是动词“reuse”的第三人称单数形式，常见于日常与环保语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “reuse”) to use something again, instead of throwing it away.","zh":"（“reuse”的第三人称单数）再次使用某物，而不是把它丢掉。"},"examples":[{"en":"She reuses glass jars to store spices.","zh":"她会重复利用玻璃罐来装香料。"},{"en":"Our office reuses scrap paper for quick notes.","zh":"我们办公室会把废纸再利用来记便签。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use something again for a different purpose (repurpose).","zh":"把某物改作他用（再利用/再用途）。"},"examples":[{"en":"He reuses old T-shirts as cleaning rags.","zh":"他把旧T恤改成抹布来用。"},{"en":"The hotel reuses leftover soap by recycling it into new bars.","zh":"那家酒店把剩余肥皂回收处理，做成新的香皂。"}]}],"synonyms":["use again","repurpose","reutilize","reclaim"],"phonetic":"/riˈjuz/","extraExplanation":["“reuses”是动词“reuse”的第三人称单数形式（he/she/it reuses）。原形是reuse。","美式发音常重读第二音节：re-USE（/riˈjuz/）。名词“reuse”也存在，意思是“再利用”，但日常里更常用作动词。","在环保语境里常见“reduce, reuse, recycle”（减少、再利用、回收）。与“recycle（回收再加工）”不同，“reuse（再利用）”通常不需要复杂加工，直接再次使用即可。"]}
{"word":"reusing","summary":{"en":"“Reusing” means using something again rather than throwing it away.","zh":"“reusing”指把东西再次使用，而不是丢掉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using something again instead of throwing it away or buying a new one; putting an item back into service for the same or a different purpose","zh":"再次使用某物（而不是丢弃或购买新的）；把物品重新投入使用（可用于同一或不同用途）"},"examples":[{"en":"We’re reusing glass jars to store spices.","zh":"我们在重复利用玻璃罐来装香料。"},{"en":"Reusing old boxes can save money when you move.","zh":"搬家时重复使用旧纸箱可以省钱。"},{"en":"The factory is reusing water to reduce waste.","zh":"工厂在循环使用水以减少浪费。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in phrases like “reusing materials”) describing something that is being used again","zh":"（用于如“reusing materials”等短语）表示某物正在被再次使用的"},"examples":[{"en":"They launched a program for reusing materials from construction sites.","zh":"他们启动了一个项目，用于重复利用建筑工地的材料。"},{"en":"Reusing fabric scraps is common in small craft businesses.","zh":"在小型手工艺生意中，重复利用布料边角料很常见。"}]}],"synonyms":["using again","reutilizing","repurposing"],"phonetic":"/riˈjuzɪŋ/","extraExplanation":["“reuse / reusing”常见于环保与可持续语境：强调“减少浪费、延长物品寿命”。常与“reduce, reuse, recycle（减量、再用、回收）”一起出现。","与 recycle（回收）相比，reuse（再用）通常不需要把材料加工成新原料；因此更直接、更省能耗。"]}
{"word":"reuters","summary":{"en":"Reuters is a global news agency often cited as a source in English-language reporting.","zh":"Reuters（路透社）是全球性新闻机构，英文报道中常作为信息来源被引用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major international news organization that provides news reports and financial information to newspapers, websites, and businesses worldwide.","zh":"路透社：一家重要的国际新闻机构，向全球媒体与企业提供新闻报道与财经信息。"},"examples":[{"en":"According to Reuters, the company plans to cut costs this year.","zh":"据路透社报道，这家公司计划今年削减成本。"},{"en":"I read the breaking news on the Reuters website.","zh":"我在路透社网站上看到了突发新闻。"},{"en":"Many newspapers reprint stories from Reuters.","zh":"许多报纸会转载路透社的报道。"}]}],"synonyms":["the Reuters news agency","the wire (informal, in journalism)"],"phonetic":"/ˈrɔɪtərz/","extraExplanation":["“Reuters”常在英文新闻里作为信息来源出现：According to Reuters… / Reuters reported that…，中文常译为“据路透社报道……”。","路透社源于19世纪，由Paul Julius Reuter创办；现在常与“Reuters style（路透写作规范）”一起被提及，强调简洁、客观、可核实的信息呈现。","发音提示：重音通常在第一个音节（ROY-），结尾的-s表示复数形式的拼写，但作为机构名称是专有名词。"]}
{"word":"reutilise","summary":{"en":"Reutilise means to use something again (British spelling of reutilize).","zh":"reutilise 指“再次使用/再利用”，是 reutilize 的英式拼写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Mainly British spelling) to use something again, often in a new way or for a different purpose; reuse.","zh":"（主要为英式拼写）再次使用某物，常指以新的方式或不同用途再利用；重复使用。"},"examples":[{"en":"We can reutilise old glass jars to store spices.","zh":"我们可以再利用旧玻璃罐来装香料。"},{"en":"The report reutilises data from last year’s survey.","zh":"这份报告再次使用了去年的调查数据。"}]}],"synonyms":["reuse","use again","repurpose","recycle (sometimes, depending on context)"],"phonetic":"/ˌriːˈjuːtəlˌaɪz/","extraExplanation":["“reutilise”是“reutilize”的英式拼写，两者意思相同。","和“reuse”相比，“reutilise”更正式、更常见于学术写作、商业或环保语境。日常口语里通常更常说“reuse”。"]}
{"word":"reutilised","summary":{"en":"“Reutilised” means “used again,” especially by repurposing something to reduce waste.","zh":"“reutilised”表示“再次使用/重复利用”，常强调通过改作他用来减少浪费。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"used again, often for a new purpose instead of being thrown away","zh":"再次使用；（常指不丢弃而）重复利用，常用于新用途"},"examples":[{"en":"The glass jars were reutilised as storage containers.","zh":"这些玻璃罐被重复利用来当收纳容器。"},{"en":"Parts from the old machine were reutilised in the new model to reduce waste.","zh":"旧机器的一些零件被重新利用到新型号里，以减少浪费。"}]}],"synonyms":["reused","repurposed","recycled","used again"],"phonetic":"/ˌriːˈjuːtəˌlaɪzd/","extraExplanation":["“reutilised”是英式拼写；美式更常写作“reutilized”。两者意思相同。","常见于环保、工程、制造等语境，强调“再利用/再循环利用”，比一般的“used again”更正式、更偏书面。"]}
{"word":"reutilising","summary":{"en":"“Reutilising” means using something again, often in a practical or eco-friendly way.","zh":"“reutilising”表示再次使用某物，常带有实用或环保的含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using something again, often to reduce waste or save money (present participle of “reutilise/reutilize”)","zh":"再次使用某物，常为减少浪费或节省成本（为“reutilise/reutilize”的现在分词）"},"examples":[{"en":"The company is reutilising old packaging to cut costs.","zh":"这家公司正在重复利用旧包装以降低成本。"},{"en":"Reutilising glass jars is an easy way to reduce household waste.","zh":"重复利用玻璃罐是减少家庭垃圾的简单方法。"},{"en":"They’re reutilising the building as a community center.","zh":"他们把这栋建筑重新利用作社区中心。"}]}],"synonyms":["reusing","repurposing","using again","recycling (sometimes)"],"phonetic":"/ˌriːˈjuːtəˌlaɪzɪŋ/","extraExplanation":["“reutilising”是英式拼写；美式常写作“reutilizing”。含义相同。","它通常强调“直接再次使用/重新用途”（reuse/repurpose），不一定像“recycling”那样需要把材料分解再加工。"]}
{"word":"reutilization","summary":{"en":"Reutilization means using something again, often for a new purpose, especially in formal or technical contexts.","zh":"reutilization 指“再利用/重复利用”，多用于正式或技术语境，强调把资源再次使用（常可用于新用途）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of using something again, especially for a new purpose (often to reduce waste or cost).","zh":"再利用；重复利用（尤指为新的用途，以减少浪费或成本）。"},"examples":[{"en":"The city promotes water reutilization for parks and public gardens.","zh":"这座城市推广再生水的再利用，用于公园和公共花园。"},{"en":"Reutilization of packaging can cut down on trash.","zh":"包装的再利用可以减少垃圾。"}]}],"synonyms":["reuse","re-use","repurposing","reapplication"],"phonetic":"/ˌriˌjuːtələˈzeɪʃən/","extraExplanation":["“Reutilization”常见于较正式的写作与技术/政策语境（如环境、工业工程、资源管理）。日常英语里更常说“reuse”或“reusing”。","在环保语境中可与“recycling（回收再加工）”区分：reutilization/reuse强调“直接再次使用”或“换个用途再用”，而recycling通常需要把材料处理后再变成新产品。"]}
{"word":"reutilizations","summary":{"en":"“Reutilizations” means repeated uses or reuses of something, especially in formal contexts.","zh":"“reutilizations”指对某物的重复使用/再次利用，语气较正式，常用于报告或专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or processes of using something again, often for a new purpose (plural of “reutilization”)","zh":"再次利用、重复使用的行为或过程（“reutilization”的复数），常指为新的用途再使用"},"examples":[{"en":"Many companies are exploring the reutilizations of packaging to reduce waste.","zh":"许多公司正在探索包装的再次利用方式，以减少浪费。"},{"en":"The report lists several possible reutilizations for old factory buildings.","zh":"报告列出了旧工厂建筑的几种可能再利用方式。"}]}],"synonyms":["reuses","reuse","repurposings","reapplications","recycling (sometimes, depending on context)"],"phonetic":"/ˌriːˌjuːt̬ələˈzeɪʃən/","extraExplanation":["“reutilization”由 re-（再次）+ utilization（利用）组成，语气较正式，常见于环保、工程、商业报告等语境。日常英语里更常用 reuse（再用/重复使用）或 repurpose（改作他用）。","拼写提示：英式英语中也常见 reutilisation（-sation/-zation 的差异）。"]}
{"word":"reutilize","summary":{"en":"Reutilize means to use something again, often in a new way to reduce waste.","zh":"reutilize 指把某物再次使用，常带“换个用途、减少浪费”的意思。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use something again, especially for a different purpose (often to save money or reduce waste)","zh":"再利用；重新使用（常指换个用途，节省成本或减少浪费）"},"examples":[{"en":"Instead of throwing the jars away, we can reutilize them to store spices.","zh":"别把玻璃罐扔掉，我们可以再利用它们来装香料。"},{"en":"The company plans to reutilize old shipping containers as small offices.","zh":"公司计划把旧集装箱再利用，改造成小办公室。"}]}],"synonyms":["reuse","use again","repurpose"],"phonetic":"/ˌriːˈjuːtəˌlaɪz/","extraExplanation":["“reutilize”常见于环保、工程、制造等较正式的语境，语气比“reuse”更书面一些。日常口语里更常说“reuse”。","在资源管理领域也常和“recycle（回收再生）”对比：reuse/reutilize 通常是不经过复杂加工的再使用；recycle 则往往需要处理后再制成新材料。"]}
{"word":"reutilized","summary":{"en":"“Reutilized” means used again (reused), often after cleaning or for a new purpose.","zh":"“reutilized”表示“被再次使用/再利用”，常指经过处理或用于新用途。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used again (reused), often for a new purpose; reused instead of thrown away.","zh":"再次使用的（再利用的）；常指为了新用途而重复使用，而不是丢弃。"},"examples":[{"en":"The company reutilized old shipping containers as storage units.","zh":"这家公司把旧的运输集装箱再利用成储物间。"},{"en":"Some materials can be cleaned and reutilized safely.","zh":"有些材料可以清洗后安全地再利用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use something again, sometimes in a different way or after processing/cleaning.","zh":"再利用；重复使用（有时指经过处理、清洗或以不同方式再次使用）。"},"examples":[{"en":"We reutilized the data from last year to compare trends.","zh":"我们再利用去年的数据来对比趋势。"},{"en":"The lab reutilized glass bottles after sterilizing them.","zh":"实验室在消毒后再利用玻璃瓶。"}]}],"synonyms":["reused","repurposed","recycled (broader)","re-employed","reapplied"],"phonetic":"ˌriˈjuːtəˌlaɪzd","extraExplanation":["“reutilize”比“reuse”更正式，常见于商业、工程、环保和学术语境，强调“再次投入使用”的过程（例如清洗、消毒、改造或重新加工）。","在环保语境中，“reuse（再使用）/reutilize（再利用）”通常比“recycle（回收再造）”更省资源：reuse更多是直接继续用；recycle往往需要把材料打碎、熔化或再加工。"]}
{"word":"reutilizes","summary":{"en":"“Reutilizes” means “uses again,” often for a new purpose, especially in formal or technical contexts.","zh":"“reutilizes”表示“再次使用/再利用”，常用于较正式或技术语境，强调把现有东西重新用于（可能是新的）用途。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"uses something again, often for a new purpose; reuses","zh":"再次使用某物，常用于新的用途；再利用"},"examples":[{"en":"The company reutilizes old parts to reduce waste.","zh":"这家公司再利用旧零件来减少浪费。"},{"en":"She reutilizes glass jars as containers for spices.","zh":"她把玻璃罐再利用，当作香料的收纳容器。"}]},{"partOfSpeech":"v.","definition":{"en":"(computing/engineering) uses an existing resource, component, or code again instead of creating a new one","zh":"（计算机/工程）重复使用现有资源、组件或代码，而不是重新创建"},"examples":[{"en":"The program reutilizes data from the previous session.","zh":"该程序会重复使用上一轮会话的数据。"},{"en":"This design reutilizes the same module across different products.","zh":"这个设计在不同产品中重复使用同一个模块。"}]}],"synonyms":["reuses","repurposes","recycles","uses again"],"phonetic":"/ˌriːˈjuːtəˌlaɪzɪz/","extraExplanation":["“reutilizes”是动词“reutilize”的第三人称单数形式（he/she/it reutilizes）。","“reutilize”比“reuse”更正式、更偏书面语，常见于环保、工程、商业或学术语境；日常口语里通常直接说“reuse / use again”。","词形结构：re-（再、重新）+ utilize（利用）。因此它常带有“更有效地利用现有资源”的语气。"]}
{"word":"reutilizing","summary":{"en":"“Reutilizing” means using something again, often in a practical or systematic way.","zh":"“reutilizing”指把某物再次利用，常带有更正式、系统化的语气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"using something again, often for a new purpose (present participle of “reutilize”)","zh":"再次利用（常指用于新的用途；为“reutilize”的现在分词）"},"examples":[{"en":"The company is reutilizing old shipping containers as small offices.","zh":"这家公司把旧集装箱再次利用，改造成小型办公室。"},{"en":"By reutilizing leftover fabric, she reduced waste and saved money.","zh":"通过再次利用剩余布料，她减少了浪费，也省了钱。"},{"en":"The city is reutilizing treated wastewater for irrigation.","zh":"这座城市把处理过的废水再利用，用于灌溉。"}]}],"synonyms":["reusing","using again","repurposing","reapplying","reclaiming"],"phonetic":"/ˌriˈjuːtəˌlaɪzɪŋ/","extraExplanation":["“reutilize”由前缀 re-（再次）+ utilize（利用）组成，语气比更常见的 “reuse” 更正式，常见于商业、工程、环保等语境。","易混词对比：reuse=再用同样用途；recycle=回收后加工成原料再制成新物；repurpose=改作他用（用途变化更明显）。"]}
{"word":"reutter","summary":{"en":"Reutter is an archaic word meaning a cavalryman (often a German mercenary horseman), and it can also be a surname.","zh":"Reutter是一个较古老的词，指骑兵（常为德国雇佣骑兵），也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A cavalry soldier, especially a German mercenary horseman in Europe (16th–17th centuries); a variant spelling of “reiter/reuter.”","zh":"（古用）骑兵士兵，尤指16–17世纪欧洲（常为德国）的雇佣骑兵；是“reiter/reuter”的异拼。"},"examples":[{"en":"In the old chronicle, a band of reutters rode into the town at dawn.","zh":"在那本旧编年史里，一队reutter在黎明时骑马进入城镇。"},{"en":"The playwright described the reutter as a hired horseman with a pistol and saber.","zh":"剧作家把reutter描写成一名受雇的骑兵，配有手枪和军刀。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Reutter will speak at the conference tomorrow.","zh":"Reutter博士明天将在会议上发言。"}]}],"synonyms":["reiter","cavalryman","horseman"],"phonetic":"/ˈraɪtɚ/","extraExplanation":["“reutter”在现代英语里很少见，多出现在历史写作或文学作品中，常与“reiter / reuter”互为异拼，指文艺复兴到近代早期的德国雇佣骑兵。","注意不要与新闻机构“Reuters（路透社）”混淆；两者拼写与读音都不同。"]}
{"word":"reutterance","summary":{"en":"Reutterance means saying something again—a repeated statement, often used in more formal or linguistic contexts.","zh":"reutterance 指“再次说出、重复陈述的话语”，较偏正式或语言学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of saying something again; a repeated statement or expression","zh":"再次说出；重复的话语（重复陈述或表达）"},"examples":[{"en":"Please give a clear reutterance of your main point so everyone can follow.","zh":"请把你的要点清楚地再说一遍，这样大家都能跟上。"},{"en":"In the meeting, her reutterance sounded more confident the second time.","zh":"在会议上，她第二次重复时听起来更有自信。"}]},{"partOfSpeech":"n.","definition":{"en":"a second or renewed act of speaking—often used in linguistics or formal writing to describe repetition for emphasis or clarification","zh":"再一次/重新发言（常见于语言学或较正式写作中，指为强调或澄清而重复）"},"examples":[{"en":"The teacher asked for a reutterance to check the student’s pronunciation.","zh":"老师要求再说一遍，以检查学生的发音。"},{"en":"Reutterance can help listeners process complex information.","zh":"重复表达能帮助听众处理复杂信息。"}]}],"synonyms":["repetition","restatement","repeat","saying again"],"phonetic":"/ˌriˈʌtərəns/","extraExplanation":["这个词相对少见，更常见的表达是 repeat, say again, restate，或名词 repetition / restatement。","词形结构：re-（再次）+ utterance（话语；发声）。因此它的核心意思就是“再次说出”。在日常交流中用更自然的替代词会更地道。"]}
{"word":"reuttered","summary":{"en":"“Reuttered” means “said again” (re-uttered). It is uncommon; “repeated” or “said again” is more natural in everyday English.","zh":"“reuttered”表示“再次说出/重复说出”（re-uttered）。该词较少见，日常更常用“repeated”或“said again”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"said again; repeated aloud (past tense of re-utter)","zh":"再次说出；重复说出（re-utter 的过去式）"},"examples":[{"en":"He reuttered the warning so everyone could hear it clearly.","zh":"他把警告又说了一遍，让大家都能听清楚。"},{"en":"The judge reuttered the question, but the witness stayed silent.","zh":"法官又重复了一遍问题，但证人仍然沉默。"}]}],"synonyms":["repeated","restated","reiterated","said again"],"phonetic":"/riˈʌtərd/","extraExplanation":["“reuttered”在实际英语中比较少见，更常见的表达是“repeated / said again / restated”。在写作中也常写作带连字符的“re-uttered”，意思更直观。","词源上可理解为 re-（再次）+ utter（说出、发声）。其中“utter”比“say”更偏书面、强调“发声说出”，常用于正式或文学语境。"]}
{"word":"reuttering","summary":{"en":"Reuttering means “saying something again,” and in legal writing it can mean “presenting/putting a document (often a forged one) into circulation again.”","zh":"Reuttering 指“再次说出、重述”，在法律语境中也可指“再次出示或再次流通某文件（常与伪造相关）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"saying something again; repeating words or sounds (often in writing or speech).","zh":"再次说出（某话）；复述、重述（常见于口语或写作）。"},"examples":[{"en":"In the summary, avoid reuttering every detail from the report.","zh":"在总结里，避免把报告的每个细节都重新复述一遍。"},{"en":"Her reuttering of the promise made it feel more sincere.","zh":"她再次说出那个承诺，让人感觉更真诚。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of using or putting into circulation a document or statement again, especially in legal contexts (for example, presenting a previously issued or forged document again).","zh":"（尤指法律语境）再次“使用/提交/流通”某文件或说法；例如再次出示已发行的或伪造的文件。"},"examples":[{"en":"The contract mentioned penalties for the reuttering of altered documents.","zh":"合同提到，对再次提交被篡改文件将有处罚。"},{"en":"In some legal writing, reuttering can refer to passing the same forged note again.","zh":"在一些法律文本中，reuttering 可指再次使用同一张伪造票据。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of reutter: to say or express again; to repeat.","zh":"reutter 的现在分词：再次说出；重复表达。"},"examples":[{"en":"He kept reuttering the same complaint until someone listened.","zh":"他不停地重复同样的抱怨，直到有人愿意听。"},{"en":"Try not to spend the whole meeting reuttering what others already said.","zh":"尽量别在会议上一直重复别人已经说过的话。"}]}],"synonyms":["repeating","restating","saying again","echoing"],"phonetic":"/ˌriˈʌtərɪŋ/","extraExplanation":["“reutter / reuttering”在现代日常英语里不算常用，更常见的替代说法是 repeat、say again、restate。","注意法律英语里的“utter/uttering”有“出示、提交、使（票据/文件）进入流通”的含义，尤其常见于伪造（forgery）相关语境；“reuttering”就是“再次出示/再次流通”。普通口语中一般不会这样用。"]}
{"word":"reutters","summary":{"en":"“Reuters” is a major international news agency; it’s often cited as a source for breaking and financial news.","zh":"“Reuters”指路透社，是重要的国际通讯社，常被用作突发新闻和财经新闻的消息来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Reuters: an international news agency (wire service) that provides news reports to newspapers, TV channels, websites, and financial markets.","zh":"路透社：一家国际新闻通讯社（通讯社/新闻社），向报纸、电视台、网站和金融市场提供新闻报道。"},"examples":[{"en":"According to Reuters, the company will announce its earnings next week.","zh":"据路透社报道，这家公司将于下周公布财报。"},{"en":"The Reuters report was widely shared online.","zh":"这篇路透社报道在网上被广泛转发。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used before a noun to mean “from Reuters” or “published by Reuters.”","zh":"作定语：表示“路透社的 / 由路透社发布的”。"},"examples":[{"en":"I read it in a Reuters article.","zh":"我是在一篇路透社文章里读到的。"},{"en":"Traders reacted quickly to Reuters headlines.","zh":"交易员对路透社的新闻标题反应很快。"}]}],"synonyms":["news agency","wire service","press agency"],"phonetic":"/ˈrɔɪtərz/","extraExplanation":["你输入的“reutters”很可能是拼写错误；正确常见拼写是 **Reuters**（路透社）。","读音来自创办人 Paul Reuter（保罗·路透）的姓；Reuters 是全球最常被引用的新闻来源之一，尤其在财经新闻中很常见。","常见搭配：**according to Reuters**（据路透社），**a Reuters report/article**（一篇路透社报道/文章），**Reuters headlines**（路透社标题）。"]}
