{"word":"reyield","summary":{"en":"“Reyield” means to yield or produce again, especially results or returns after repeating a process.","zh":"“Reyield”表示“再次产出/再次产生（结果或回报）”，常用于重复某个过程之后。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to yield again; to produce or give a result a second time (often after being processed, tested, or used before)","zh":"再次产出；再次产生（结果/收益）；再度让出（多用于经过处理、测试或使用之后）"},"examples":[{"en":"After the soil was treated, the field began to reyield a good harvest.","zh":"土壤处理后，这片田地又重新产出了好收成。"},{"en":"We cleaned the data and reran the model to see whether it would reyield the same results.","zh":"我们清洗了数据并重新运行模型，看它是否会再次得到相同结果。"}]},{"partOfSpeech":"v.","definition":{"en":"(business/finance) to yield again in profit or returns; to generate returns again","zh":"（商业/金融）再次带来收益或回报；重新产生回报"},"examples":[{"en":"With better management, the project may reyield profits next year.","zh":"如果管理改善，这个项目明年可能会再次带来利润。"},{"en":"Investors hope the market will reyield strong returns after the downturn.","zh":"投资者希望市场在低迷后能再次带来强劲回报。"}]}],"synonyms":["yield again","produce again","regenerate","return","generate again"],"phonetic":"/riˈjild/","extraExplanation":["“reyield”由前缀 re-（再次、重新）+ yield（产出、让出）构成，但在现代英语里相对少见，更多时候人们会直接说 “yield again / produce again / generate returns again”。在技术写作或较正式的语境中，你可能偶尔会见到它。"]}
{"word":"Reykja","summary":{"en":"“Reykja” is mainly an Icelandic name element meaning “smoke/steam,” best known from “Reykjavík,” and is not a standard English word by itself.","zh":"“Reykja”主要是冰岛语地名成分，意为“烟/蒸汽”，常见于“Reykjavík（雷克雅未克）”，本身并非标准英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name element from Icelandic, seen in place names like “Reykjavík,” meaning “smoke/steam” (often referring to geothermal steam). Not a standard standalone English word.","zh":"源自冰岛语的词素/地名成分，常见于“Reykjavík（雷克雅未克）”等地名中，意思是“烟/蒸汽”（多指地热蒸汽）。它本身不是标准的英语单词。"},"examples":[{"en":"Reykjavík comes from Icelandic “reykja” (smoke/steam) + “vík” (bay).","zh":"Reykjavík 源自冰岛语：reykja（烟/蒸汽）+ vík（海湾）。"},{"en":"In travel writing, you may see “reykja-” explained as referring to geothermal steam.","zh":"在旅游文章里，你可能会看到 reykja- 被解释为与地热蒸汽有关。"}]}],"synonyms":["geothermal steam (context)","smoke (context)"],"phonetic":"/ˈreɪkjə/","extraExplanation":["“Reykja”更像是冰岛语中的构词成分/词根，而不是英语里可独立使用的词。英语语境中通常只在介绍冰岛地名来源、历史或语言文化时出现。","在冰岛的自然环境里，“烟/雾”常指温泉与地热活动产生的蒸汽，因此这个词根带有明显的地理与文化背景色彩。"]}
{"word":"Reykjavik","summary":{"en":"Reykjavik is the capital and largest city of Iceland.","zh":"Reykjavik（雷克雅未克）是冰岛的首都和最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Iceland, located on the country’s southwest coast.","zh":"冰岛的首都和最大城市，位于该国西南海岸。"},"examples":[{"en":"Reykjavik is the capital of Iceland.","zh":"雷克雅未克是冰岛的首都。"},{"en":"Many travelers use Reykjavik as a base to visit the Golden Circle.","zh":"很多游客以雷克雅未克为据点去游览“黄金圈”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal/contextual) The national government or political center of Iceland, used as a place name to represent officials and decision-making.","zh":"（非正式/语境）用地名指代冰岛的政府或政治中心，代表官方决策层。"},"examples":[{"en":"The new policy was announced in Reykjavik on Monday.","zh":"新政策于周一在雷克雅未克发布。"},{"en":"People in the countryside sometimes say ‘Reykjavik doesn’t understand us.’","zh":"乡村地区的人有时会说：“雷克雅未克（当局）不了解我们。”"}]}],"synonyms":["Iceland’s capital","the Icelandic capital"],"phonetic":"/ˈreɪkjəˌvɪk/","extraExplanation":["词源：来自古诺尔斯语，常被解释为“烟雾湾/冒烟的海湾”（与地热蒸汽有关）。","发音提示：英语里重音通常在第一个音节（REY-），中间的“kja”常被弱读成类似“kyuh”。","文化语境：雷克雅未克常被作为观赏极光、体验地热温泉（如 Blue Lagoon 周边地区）以及参加音乐/艺术节的起点。"]}
{"word":"reynard","summary":{"en":"Reynard is a literary word for a fox, especially the clever trickster fox in medieval European stories; it can also be a rare male name.","zh":"Reynard 是“狐狸”的文学用词，尤指中世纪欧洲故事里机智狡黠的狐狸形象；也可作少见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fox, especially as a character in medieval European animal stories (often clever or trickster-like).","zh":"狐狸（尤指中世纪欧洲动物寓言/史诗中的角色名，常带“狡黠、诡计多端”的形象）。"},"examples":[{"en":"In the old tale, Reynard tricks the other animals with clever words.","zh":"在古老的故事里，雷纳德（狐狸）用花言巧语骗过其他动物。"},{"en":"The poet compares the politician to Reynard, suggesting he is sly.","zh":"诗人把那位政客比作“雷纳德（狐狸）”，暗示他很狡猾。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name (rare in modern use).","zh":"男子名（现代较少见）。"},"examples":[{"en":"Reynard appears as a character name in some novels and films.","zh":"Reynard 有时会作为小说或电影中的人物名字出现。"}]}],"synonyms":["fox","vixen (female fox)","tod (dialect/literary)"],"phonetic":"/ˈrɛnərd/","extraExplanation":["“Reynard”最早是狐狸角色的名字，来自中世纪法语《Roman de Renart》（《雷纳尔传奇/列那狐传奇》）系列故事。后来这个名字太有名，英语里就把 reynard 当作“狐狸”的文学用词来用，带一点古典、寓言或讽刺的味道。","常见文化意涵：Reynard 往往代表“机智但狡猾”的狐狸形象；在写作中用它比直接说 fox 更文学化，也更强调人格化的“狡计/诡计”。"]}
{"word":"reynards","summary":{"en":"“Reynards” means foxes, especially in a literary/old-fashioned style, and can also suggest sly, clever people.","zh":"“Reynards”指“狐狸”（偏文学/古雅用法），也可引申为“狡猾机灵的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Foxes (plural of “reynard”); also used to mean clever, tricky people like foxes.","zh":"狐狸（reynard 的复数）；也可比喻像狐狸一样狡猾、机灵的人（多为文学/较文雅用法）。"},"examples":[{"en":"In the old tale, the reynards outsmart the other animals.","zh":"在古老的故事里，这些“reynards”（狐狸）智胜其他动物。"},{"en":"The poet called the spies “reynards” to suggest they were sly and hard to catch.","zh":"诗人把那些间谍称为“reynards”，暗示他们狡猾而难以抓住。"}]}],"synonyms":["foxes","vixens","sly ones","tricksters"],"phonetic":"/ˈreɪnɑrdz/","extraExplanation":["“Reynard”原本是中世纪欧洲动物寓言里一只著名狐狸的名字（Reynard the Fox），后来这个名字在英语里就被借来当作“狐狸”的文学用词。尤其在中古法语/欧洲寓言传统中很常见，因此在现代英语里会显得偏书面或带古典/童话气息。","如果你在阅读文学作品或寓言时看到“reynard(s)”，通常不是专有名词，而是借用这个文化典故来强调“狐狸般的狡黠”。"]}
{"word":"reynold","summary":{"en":"Reynold is mainly a personal name; many people actually use the surname spelling “Reynolds.”","zh":"Reynold 主要是人名；很多情况下更常见的姓氏拼写是“Reynolds”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name and surname (family name); more commonly spelled “Reynolds” as a surname.","zh":"男性名字或姓氏（家族姓）；作为姓更常见的拼写是“Reynolds”。"},"examples":[{"en":"Reynold moved to Chicago for work.","zh":"Reynold 为了工作搬到了芝加哥。"},{"en":"I met Ms. Reynold at the conference.","zh":"我在会议上见到了 Reynold 女士。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) used informally as a shortened or mistaken form of “Reynolds,” especially in names of people or companies.","zh":"（较少见）在口语或非正式写法中，有时被当作“Reynolds”的缩写或误写，常见于人名或公司名。"},"examples":[{"en":"Did you mean Reynolds, with an “s” at the end?","zh":"你是想写 Reynolds（结尾有个 s）吗？"},{"en":"The email signature says “Reynold,” but the ID badge says “Reynolds.”","zh":"邮件签名写的是“Reynold”，但工牌上写的是“Reynolds”。"}]}],"synonyms":["Reynolds (common spelling, esp. surname)"],"phonetic":"/ˈrɛnəld/","extraExplanation":["“Reynold”通常来自日耳曼语系的人名，常被解释为与“建议/统治（rule）”相关的含义（不同来源说法略有差异）。","英语里更常见的是姓氏“Reynolds”（末尾带 s）。如果你在查某位名人或品牌，多半需要用“Reynolds”才能找到更准确的信息。","如果你指的是工程/物理里的“雷诺数”，标准写法是 **Reynolds number**（以科学家 Osborne Reynolds 命名）。"]}
{"word":"Reynolds","summary":{"en":"Reynolds is most commonly a surname; in science/engineering it can also refer to the Reynolds number (Re).","zh":"Reynolds 最常见是姓氏；在科学/工程语境中也可指“雷诺数”（Re）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); used for many people and places in English-speaking countries","zh":"姓氏（家族姓）；在英语国家常见的人名或地名用法"},"examples":[{"en":"My teacher’s last name is Reynolds.","zh":"我老师的姓是 Reynolds。"},{"en":"Ms. Reynolds will call your parents if you’re absent again.","zh":"如果你再缺席，Reynolds 女士会联系你的父母。"}]},{"partOfSpeech":"n.","definition":{"en":"short for Reynolds number (Re), a value used in fluid mechanics to describe how a fluid flows (more smooth/laminar vs. more turbulent)","zh":"“雷诺数”的简称（Re）；流体力学中的一个数值，用来描述流体流动状态（更平稳的层流 vs. 更紊乱的湍流）"},"examples":[{"en":"At a high Reynolds number, the flow is more likely to become turbulent.","zh":"在较高的雷诺数下，流动更可能变成湍流。"},{"en":"Engineers often calculate Reynolds before designing a pipe system.","zh":"工程师在设计管道系统前常常会计算雷诺数。"}]}],"phonetic":"/ˈrɛnəldz/","extraExplanation":["“Reynolds number（雷诺数）”以英国科学家 Osborne Reynolds（奥斯本·雷诺兹）命名，是工程与物理中非常常见的专有名词。","作为姓氏，Reynolds 的读音常见为 /ˈrɛnəldz/，末尾 -s 发 /z/ 音。"]}
{"word":"reyoke","summary":{"en":"Reyoke means to yoke or harness again, literally (animals) or figuratively (to bind someone back to duties or control).","zh":"Reyoke 指“再次套上轭/重新套驾”，可指字面给牲畜重新套轭，也可比喻“重新使受束缚或受控制”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a yoke on (animals) again; to harness again","zh":"（给牲畜）再次套上轭；重新套驾"},"examples":[{"en":"After the break, the farmer reyoked the oxen and went back to plowing.","zh":"休息后，农夫又给牛套上轭，继续犁地。"},{"en":"The team had to reyoke the horses before the cart could move.","zh":"车队得先重新给马套上轭，马车才能走。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to bring back under control or obligation again; to tie back to a duty or system","zh":"（比喻）再次使受约束/受控制；重新套入某种责任或体系"},"examples":[{"en":"She didn’t want to be reyoked to a job that made her unhappy.","zh":"她不想再被“套回”一份让她不快乐的工作。"},{"en":"The reform aimed to reyoke local leaders to national rules.","zh":"这项改革旨在让地方领导重新受国家规则约束。"}]}],"synonyms":["reharness","re-hitch","reconnect","rebind","reenslave (strong/negative)"],"phonetic":"/ˌriˈjoʊk/","extraExplanation":["“reyoke”由前缀 re-（再次）+ yoke（轭；束缚）构成，字面意思是“再套上轭”。在现代英语里它相对少见，更常见的是用 reattach/reharness（重新套驾）或 figuratively use yoke again（再次束缚）。","yoke 在文学与宗教语境里常象征“束缚、责任或压迫”（如“under the yoke”在……的压迫之下），所以 reyoke 的比喻用法通常带有“重新被束缚/重新承担义务”的感觉。"]}
{"word":"reyoked","summary":{"en":"“Reyoked” means “yoked again”—reharnessed or rejoined; it can also mean being bound together again in a figurative sense.","zh":"“reyoked”表示“再次套上轭/重新连接”；也可比喻“再次被捆绑在一起、重新受约束或重新协作”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “re-yoke”: to put a yoke on again; to harness or join (animals, people, or parts) together again.","zh":"“re-yoke”的过去式/过去分词：再次套上轭；把（牲畜/人/部件）重新套上、重新连接或重新捆在一起。"},"examples":[{"en":"After the break, the farmer reyoked the oxen and went back to plowing.","zh":"休息之后，农夫把牛重新套上轭，又回去犁地了。"},{"en":"The mechanic reyoked the two parts so the machine could run smoothly again.","zh":"技师把两个部件重新连接好，让机器又能顺畅运转。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) To bring back into close cooperation or control; to bind together again.","zh":"（比喻）使再次紧密合作或再次受约束；把关系重新“捆”在一起。"},"examples":[{"en":"The coach tried to reyoke the team after weeks of conflict.","zh":"在几周的矛盾之后，教练试图让球队重新凝聚起来。"},{"en":"They felt reyoked to old responsibilities when they moved back home.","zh":"他们搬回家后，觉得自己又被旧的责任重新束缚住了。"}]}],"synonyms":["reharnessed","rejoined","reconnected","reattached","reunited","bound again"],"phonetic":"/ˌriˈjoʊkt/","extraExplanation":["“yoke”原意是“轭”（套在牛马颈上的木架），引申为“把……连接/束缚在一起”。加前缀“re-”表示“再次、重新”，所以“reyoked”就是“再次套轭/重新连接”。","比喻用法里，“yoke”有时带有“束缚、压迫”的语感（例如 religious/political contexts 中的“under the yoke”）。如果只是想表达“重新合作/重新联合”，也可用更中性的词，如 “reunited / reconnected”。"]}
{"word":"reyoking","summary":{"en":"“Revoking” means officially taking back or canceling something like a license, permission, or access.","zh":"“revoking”指正式收回或取消某事，如吊销执照、撤销许可或取消权限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of officially taking back, canceling, or ending something (such as a license, permission, or a law)","zh":"正式收回、取消或终止某事（如执照、许可或法律）的行为"},"examples":[{"en":"The city is revoking the restaurant’s license because of repeated health violations.","zh":"由于多次违反卫生规定，市政府正在吊销那家餐厅的执照。"},{"en":"They considered revoking his access to the building after the security incident.","zh":"安全事件发生后，他们考虑取消他进入大楼的权限。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “revoke”: officially taking back, canceling, or ending something","zh":"“revoke”的现在分词：正在正式收回、取消或终止某事"},"examples":[{"en":"The government is revoking the permit starting next month.","zh":"政府将从下个月开始撤销该许可。"},{"en":"She’s revoking her consent because the terms changed.","zh":"因为条款改变，她正在撤回同意。"}]}],"synonyms":["canceling","withdrawing","rescinding","annulling"],"phonetic":"/rɪˈvoʊk/","extraExplanation":["你写的“reyoking”大概率是拼写错误，正确拼写通常是 **revoking**。","**revoke /rɪˈvoʊk/** 常用于较正式的场景（法律、行政、规定），常见搭配有：revoke a license（吊销执照）、revoke permission（撤销许可）、revoke access（取消访问权限）、revoke a law/order（废止法律/命令）。","易混词：**evoke**（唤起，引起）与 **revoke**（撤销）拼写相近但意思相反方向。"]}
{"word":"reyouth","summary":{"en":"“Reyouth” is a rare, nonstandard word meaning “to rejuvenate” or “renew youth,” mostly seen in marketing.","zh":"“Reyouth”是少见、非标准的用法，多见于营销语境，意思接近“使恢复青春/活力、重返年轻”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/rare) to make someone or something seem young again; to rejuvenate.","zh":"（非标准/少见用法）使某人或某物重现年轻；使恢复活力。"},"examples":[{"en":"The spa promises to re-youth your skin in just two weeks.","zh":"这家水疗中心宣称两周内就能让你的皮肤“重返年轻”。"},{"en":"A new haircut can re-youth your look.","zh":"换个新发型可以让你的整体感觉更显年轻。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, usually marketing) renewed youth; a return to a youthful state.","zh":"（少见，多用于营销语境）再度的青春；回到年轻状态。"},"examples":[{"en":"Their slogan is “Reyouth for everyone.”","zh":"他们的口号是“人人都能再度青春”。"}]}],"synonyms":["rejuvenate","renew","revitalize","restore youthfulness","make (someone/something) look younger"],"phonetic":"/ˌriˈjuːθ/","extraExplanation":["“reyouth / re-youth”不是常见标准英语词，更多见于广告文案、品牌名或创意写法。更自然的表达通常用：rejuvenate（使恢复青春/活力）、make … look younger（让……看起来更年轻）、restore youthfulness（恢复年轻感）。","构词上可理解为前缀 re-（再次）+ youth（青春），但在正式写作中建议改用更常见的词，以免读者觉得不地道或不明白。"]}
{"word":"reyson","summary":{"en":"Reyson is mainly used as a personal name, not a common English word.","zh":"Reyson 主要作为人名使用，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or surname). It is not a common standard English vocabulary word; it is usually used as a name.","zh":"人名（名字或姓氏）。它不是常见的标准英语词汇，通常作为姓名使用。"},"examples":[{"en":"Reyson is my classmate in math.","zh":"Reyson 是我数学课的同学。"},{"en":"Mr. Reyson will speak at the meeting today.","zh":"Reyson 先生今天会在会议上发言。"}]}],"synonyms":["(name)"],"phonetic":"/ˈreɪsən/","extraExplanation":["“Reyson”在英语里更像姓名拼写，而不是词典里常见的单词。如果你原本想查的是“reason”（原因/理由），拼写是 r-e-a-s-o-n，读音是 /ˈriːzən/。","也可能与姓氏拼写“Rayson / Rayston / Raison”等相近；不同家庭或地区会有不同拼法。"]}

