{"word":"rez","summary":{"en":"“Rez” is an informal word that can mean a (Native American) reservation, screen resolution, or to resurrect someone in a game.","zh":"“rez”是非正式用语，可指（美洲原住民）保留地、屏幕分辨率，或在游戏中“复活”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A reservation, especially a Native American reservation.","zh":"（非正式）保留地；尤其指美洲原住民保留地。"},"examples":[{"en":"He grew up on the rez and later moved to the city for college.","zh":"他在保留地长大，后来为了上大学搬到了城市。"},{"en":"She went back to the rez to visit her grandparents.","zh":"她回到保留地去看望祖父母。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, tech) Screen resolution; the number of pixels that make up an image or display.","zh":"（非正式，科技）屏幕分辨率；构成图像或显示器的像素数量。"},"examples":[{"en":"This video looks blurry because the rez is too low.","zh":"这段视频看起来很糊，因为分辨率太低了。"},{"en":"Try increasing the rez in your settings.","zh":"试着在设置里把分辨率调高。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, gaming) To resurrect someone (bring them back to life) in a video game.","zh":"（非正式，游戏）复活（把角色从死亡状态带回）。"},"examples":[{"en":"Can you rez me after the fight?","zh":"打完这波你能复活我吗？"},{"en":"The healer rezzed the tank right away.","zh":"治疗立刻把坦克复活了。"}]}],"synonyms":["reservation","res","resolution","resurrect","revive"],"phonetic":"/rɛz/","extraExplanation":["“rez”表示“（原住民）保留地”时，属于口语缩写。在涉及原住民社区与历史议题的语境中，有些人可能觉得随意或带刻板印象；更正式、中性的说法是“reservation”或具体部族/社区名称。","在游戏语境里，“rez”来自“resurrect（复活）”的缩写；在科技语境里，“rez”来自“resolution（分辨率）”的缩写。"]}
{"word":"rezbanyite","summary":{"en":"“rezbanyite” is not a standard English vocabulary item; it’s likely a rare proper name or a misspelling.","zh":"“rezbanyite”不是标准常用英语词汇；更可能是冷门专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a common English word; it appears to be a specialized proper name (possibly a mineral name) or a misspelling. I can’t confirm a standard dictionary definition without more context.","zh":"这不是常见的英语词；它看起来像是某个专门领域的专有名词（可能是矿物名称）或拼写错误。在缺少语境的情况下，我无法确认标准词典释义。"},"examples":[{"en":"I couldn’t find “rezbanyite” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主流英语词典里找不到“rezbanyite”——你能把看到它的句子发我吗？"},{"en":"If you meant a mineral, please tell me the source (book/article/website) so I can verify the meaning.","zh":"如果你指的是矿物名称，请告诉我来源（书/文章/网站），我才能核实含义。"}]}],"phonetic":"/ˌrɛzˈbæniˌaɪt/","extraExplanation":["这个词很可能属于非常冷门的专名（例如矿物名、地名、姓氏、用户名/游戏名），也可能只是拼写接近某个词但拼错了。","你可以提供：①它出现的句子或段落；②相关领域（地质/化学/游戏/人名等）；③你怀疑的正确拼写（或同一页面上相似的词）。有了语境我就能给出准确释义、发音和例句。"]}
{"word":"Reznor","summary":{"en":"Reznor is a surname, most commonly referring to American musician and composer Trent Reznor (Nine Inch Nails).","zh":"Reznor 是一个姓氏，最常见的指代是美国音乐人、作曲家特伦特·雷兹诺（九寸钉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname, best known in popular culture as the last name of Trent Reznor (born 1965), an American musician, singer-songwriter, producer, and composer; founder and primary member of the industrial rock band Nine Inch Nails.","zh":"一个姓氏；在流行文化中最知名的是指特伦特·雷兹诺（Trent Reznor，1965年生），美国音乐人、创作歌手、制作人和作曲家；工业摇滚乐队九寸钉（Nine Inch Nails）的创始人及核心成员。"},"examples":[{"en":"Trent Reznor is the founder of Nine Inch Nails.","zh":"特伦特·雷兹诺是九寸钉乐队的创始人。"},{"en":"Reznor has also composed film scores with Atticus Ross.","zh":"雷兹诺也与阿提克斯·罗斯一起为电影配乐。"}]}],"synonyms":["Trent Reznor","Nine Inch Nails (related)","Reznor and Ross (related)"],"phonetic":"/ˈrɛz.nɚ/","extraExplanation":["“Reznor”作为单独词出现时，通常是指“Trent Reznor”这位音乐人（而不是一个常见英文词汇）。在音乐语境里，你可能会看到如“Reznor’s work / Reznor and Ross”等表达。","Trent Reznor 的风格常与“industrial rock（工业摇滚）”“electronic（电子）”“dark/atmospheric（阴郁/氛围感）”等词搭配出现。","如果你是在歌词、影评或音乐评论里看到“Reznor”，它多半是以姓氏代指本人，这在英文里很常见（用姓称呼公众人物）。"]}
{"word":"rezone","summary":{"en":"Rezone means to officially change how land is allowed to be used under local zoning rules.","zh":"Rezone 指按地方分区规定正式改变土地/建筑的允许用途（重新划区）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change the official zoning classification of a piece of land or a building (for example, from residential to commercial)","zh":"对一块土地或建筑进行“重新划区/重新分区”（改变官方用途分区，例如从住宅用地改为商业用地）"},"examples":[{"en":"The city voted to rezone the area from industrial to residential.","zh":"市政府投票决定把该地区从工业用地重新划为住宅用地。"},{"en":"They want to rezone the lot so they can build apartments.","zh":"他们想把这块地重新划区，这样就能建公寓。"},{"en":"Residents protested plans to rezone the neighborhood for high-rise buildings.","zh":"居民抗议将社区重新划区以建设高层建筑的计划。"}]}],"synonyms":["redesignate","reclassify","change the zoning of","rezone for"],"phonetic":"/ˌriˈzoʊn/","extraExplanation":["“Rezone”常见于美国/加拿大等地的城市规划语境。分区（zoning）是地方政府用来规定土地用途与开发强度的规则，涉及住宅/商业/工业用途、建筑高度、容积率、停车位等。","“Rezone”通常暗示需要公开程序（听证会、规划委员会、市议会投票等），因此在新闻里常与社区意见、房价、交通与环境影响等话题一起出现。"]}
{"word":"rezoned","summary":{"en":"“Rezoned” means land has had its official zoning classification changed.","zh":"“Rezoned” 指土地的官方分区/用途规划已被更改（重新划区）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of rezone: to change the official zoning classification of land (for example, from residential to commercial).","zh":"rezone 的过去式/过去分词：对土地进行“重新划区/重新分区”，即改变官方的土地用途规划（如从住宅用地改为商业用地）。"},"examples":[{"en":"The city rezoned the area from industrial to residential.","zh":"市政府把这片区域从工业用地重新划为住宅用地。"},{"en":"After the land was rezoned, apartments could be built there legally.","zh":"土地重新划区后，就可以合法建设公寓了。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing land or an area whose zoning status has been changed.","zh":"（形容词用法）指已被重新划区、用途规划已改变的土地/区域。"},"examples":[{"en":"Developers are buying rezoned lots near the new subway line.","zh":"开发商正在购买地铁新线附近那些已重新划区的地块。"}]}],"synonyms":["reclassified","redesignated","reallocated (land use)"],"phonetic":"/ˌriˈzoʊnd/","extraExplanation":["“Zoning（分区规划）”在美国城市管理中很常见：政府会把土地划为住宅、商业、工业等区域，并规定建筑高度、密度、用途等。Rezone/rezoned 往往出现在新闻、地产、社区听证会（public hearing）语境里，常伴随争议（如交通、房价、环境影响）。"]}
{"word":"rezones","summary":{"en":"“Reason” means a cause/justification, the power of logical thinking, or the act of thinking logically.","zh":"“reason”可指原因/理由、理性（判断力），也可作动词表示推理、讲道理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cause or explanation for something; a justification","zh":"原因；理由；解释"},"examples":[{"en":"What’s the reason you’re late?","zh":"你迟到的原因是什么？"},{"en":"She had good reasons for leaving early.","zh":"她有充分的理由提前离开。"}]},{"partOfSpeech":"n.","definition":{"en":"the ability to think clearly and make sensible judgments","zh":"理性；判断力"},"examples":[{"en":"Try to listen to reason.","zh":"尽量讲道理／听取理性意见。"},{"en":"Anger can cloud your reason.","zh":"愤怒会蒙蔽你的理性。"}]},{"partOfSpeech":"v.","definition":{"en":"to think logically; to form conclusions from facts","zh":"推理；理性思考；得出结论"},"examples":[{"en":"We reasoned that the store must be closed.","zh":"我们推断那家店一定关门了。"},{"en":"It’s hard to reason with someone who won’t listen.","zh":"跟不愿意听的人讲道理很难。"}]}],"synonyms":["cause","explanation","justification","logic","rationale"],"phonetic":"/ˈriːzən/","extraExplanation":["“rezones” 不是标准英语拼写；最常见的情况是想写 “reasons”（reason 的复数），发音相近但拼写不同。","如果你想表达“原因/理由（复数）”，建议用：reasons。例：I have my reasons.（我有我的理由。）"]}
{"word":"rezoning","summary":{"en":"Rezoning is changing the legal land-use rules for a property or area (and it can also mean the act of doing so).","zh":"Rezoning 指更改某块土地或区域的法定用途分区规则，也可指这一更改行为本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of changing how a piece of land may legally be used under local zoning laws (for example, from residential to commercial)","zh":"（土地）重新分区；更改分区用途（依照地方分区法，将土地用途从住宅等改为商业等）"},"examples":[{"en":"The city approved rezoning that allows apartments to be built near the subway station.","zh":"市政府批准了重新分区，使地铁站附近可以建设公寓。"},{"en":"Neighbors opposed the rezoning because they feared more traffic and noise.","zh":"邻居们反对重新分区，因为他们担心交通和噪音会增加。"},{"en":"Rezoning can raise property values, but it can also change the character of a neighborhood.","zh":"重新分区可能抬高房价，但也可能改变社区的风貌。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change the legal zoning classification of land (often by a city or local government)","zh":"为（土地）重新划分用途分区；更改分区类别（通常由市政府或地方政府进行）"},"examples":[{"en":"The council voted to rezone the area from industrial to mixed-use.","zh":"市议会投票决定将该地区从工业用地改为综合用途。"},{"en":"Developers asked the city to rezone the lot so they could build a hotel.","zh":"开发商请求市政府为那块地重新分区，以便他们建酒店。"}]}],"synonyms":["reclassification","zoning change","land-use change"],"phonetic":"/ˌriːˈzoʊnɪŋ/","extraExplanation":["“Rezoning”常见于美国/加拿大等地的城市规划语境中，涉及地方政府对土地用途的法规调整。常与公众听证会（public hearing）、规划委员会（planning commission）、分区条例（zoning ordinance）一起出现。","常见相关搭配：apply for rezoning（申请重新分区）、rezoning request/proposal（重新分区申请/提案）、rezoning approval/denial（获批/被拒）、upzoning（提高容积率或允许更高密度开发）、downzoning（降低允许的开发强度）。"]}

