{"word":"rl","summary":{"en":"“RL” is an abbreviation most commonly meaning “real life,” and in tech it often means “reinforcement learning.”","zh":"“RL”是缩写，最常见指“现实生活”；在技术语境中常指“强化学习”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Real life; used online to mean life outside the internet or a game.","zh":"（缩写）现实生活；常用于网络语境，指离开网络/游戏之外的生活。"},"examples":[{"en":"I can’t join the raid tonight—something came up in RL.","zh":"我今晚不能参加团队副本——现实生活里有事。"},{"en":"She’s quiet online but very outgoing in RL.","zh":"她在网上很安静，但在现实生活中很外向。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., tech) Reinforcement learning, a type of machine learning where an agent learns by trial and error using rewards.","zh":"（缩写，技术）强化学习；一种机器学习方法，让“智能体”通过试错并根据奖励来学习。"},"examples":[{"en":"This paper compares supervised learning and RL on the same task.","zh":"这篇论文比较了监督学习和强化学习在同一任务上的表现。"},{"en":"RL is often used in robotics and game-playing AI.","zh":"强化学习常用于机器人和对弈类人工智能。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) A role label or shorthand in specific communities (meaning can vary by context).","zh":"（缩写）在某些圈子/社群里的角色标签或简称（具体含义取决于语境）。"},"examples":[{"en":"What does “RL” mean in this server?","zh":"在这个群里“RL”是什么意思？"}]}],"synonyms":["IRL (for “real life”)","reinforcement learning (spelled out)"],"phonetic":"/ɑr ɛl/","extraExplanation":["“RL”常见于聊天、论坛、游戏与技术文章中。因为缩写在不同圈子会有不同含义，最好根据上下文判断：如果谈到上班、家庭、线下安排，多半是 real life；如果谈到 AI、算法、agent、reward，多半是 reinforcement learning。","读作字母名 “R-L”。有些人也会写作“IRL”（in real life，现实中/线下）。"]}
{"word":"rld","summary":{"en":"RLD is an online abbreviation; it usually refers to real-life drama or issues, and sometimes means real-life death.","zh":"RLD 是网络缩写；通常指现实生活的矛盾/麻烦，有时也指现实中的死亡。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used online; meaning depends on context, often referring to problems or conflict happening in real life (not online).","zh":"网络常见缩写；含义依语境而定，常指发生在现实生活中的麻烦或冲突（不是在网上）。"},"examples":[{"en":"I’m not joining the chat tonight—too much RLD at home.","zh":"我今晚不进群聊了——家里现实生活的事太多了。"},{"en":"The community got quiet because of some RLD between members.","zh":"因为成员之间出现一些现实生活的矛盾，社区变得很安静。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation meaning “real-life death,” used in gaming or online discussions to distinguish real events from fictional ones.","zh":"（较少见）缩写，表示“现实中的死亡”，在游戏或网络讨论中用来区分现实事件与虚构内容。"},"examples":[{"en":"They clarified it was RLD, not something in the game story.","zh":"他们澄清那是现实中的死亡，不是游戏剧情。"}]}],"synonyms":["RL drama","IRL (in real life)"],"phonetic":"/ˌɑr ɛl ˈdi/","extraExplanation":["“RLD”不是一个非常固定、通用的缩写，不同圈子含义可能不同；常见写法也可能是“RL drama（现实生活的戏/矛盾）”或直接写“RL（real life）”。","如果你是在某个具体平台、游戏、聊天记录里看到的，我可以根据上下文帮你确定最可能的意思。"]}
{"word":"rle","summary":{"en":"RLE usually means run-length encoding, a basic compression method for repeated data.","zh":"RLE 通常指游程编码，一种针对重复数据的基础压缩方法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Run-Length Encoding: a simple way to compress data by replacing repeated values with one value plus the number of times it repeats.","zh":"游程编码（Run-Length Encoding）：一种简单的压缩方法，把连续重复的值用“值 + 重复次数”来表示。"},"examples":[{"en":"RLE compresses long runs of the same pixel color in an image.","zh":"RLE 可以压缩图像中同一像素颜色长时间连续出现的片段。"},{"en":"The file got smaller after using RLE, but only because the data had many repeats.","zh":"使用 RLE 后文件变小了，但这是因为数据里有很多重复内容。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “run-length encoding,” often used in programming, data compression, and image processing.","zh":"“run-length encoding（游程编码）”的缩写，常见于编程、数据压缩与图像处理领域。"},"examples":[{"en":"This library supports RLE and Huffman coding.","zh":"这个库支持 RLE 和哈夫曼编码。"}]}],"synonyms":["run-length encoding","RLE compression"],"phonetic":"/ˌɑr ˌɛl ˈi/","extraExplanation":["RLE 的效果强烈依赖数据特性：如果有大量“连续重复”（例如大片纯色、很多相同字符连在一起），压缩率会很好；但如果数据变化频繁，RLE 可能几乎无效，甚至会变大。","在计算机图形学里，RLE 常用于简单位图或早期格式；在学习压缩算法时，它常作为“最容易理解的无损压缩”示例。"]}
{"word":"rleas","summary":{"en":"Release means to let go/free, or to make something public (publish/issue). As a noun, it can mean freedom or a newly issued product.","zh":"Release 常指“释放/放开”，也可指“发布/发行”。作名词可表示“获释/释放”或“新发行的作品”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to let someone or something go free; to stop holding or keeping them","zh":"释放；放走；松开（不再控制或扣留）"},"examples":[{"en":"They released the bird back into the wild.","zh":"他们把那只鸟放回了野外。"},{"en":"Please release the button to stop the machine.","zh":"请松开按钮让机器停止。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something available to the public (a movie, music, information, a statement, etc.)","zh":"发布；公布；发行（电影、音乐、信息、声明等）"},"examples":[{"en":"The company will release a new app next month.","zh":"这家公司下个月将发布一款新应用。"},{"en":"Police released a statement about the incident.","zh":"警方发布了关于该事件的声明。"}]},{"partOfSpeech":"vt.","definition":{"en":"to allow something to flow out or come out (gas, liquid, energy, feelings)","zh":"释放（气体、液体、能量、情绪等）"},"examples":[{"en":"The factory released smoke into the air.","zh":"工厂向空气中排放了烟。"},{"en":"Exercise can release stress.","zh":"运动可以释放压力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of freeing someone/something; or a new product (such as a movie, album, or software) made available to the public","zh":"释放；发布；（电影/专辑/软件等的）发行作品"},"examples":[{"en":"The prisoner’s release was announced this morning.","zh":"今早宣布了那名囚犯获释的消息。"},{"en":"This is the band’s latest release.","zh":"这是这支乐队最新发行的作品。"}]}],"synonyms":["free","let go","set free","publish","issue","launch","unveil"],"phonetic":"/rɪˈlis/","extraExplanation":["你输入的“rleas”很可能是拼写错误，常见目标词是 **release**。如果你原本想查别的词（例如 *relais* 或某个缩写），告诉我上下文句子我可以帮你确认。"]}
{"word":"rlic","summary":{"en":"A relic is something left from the past—an old object, a religious item, or an outdated leftover from earlier times.","zh":"relic 指“过去遗留下来的东西”，可指历史遗物、宗教圣物，也可比喻过时的旧事物/旧制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old object from the past that is kept because it is historically important or has special meaning","zh":"遗物；古物（因具有历史意义或特殊价值而被保存的旧物）"},"examples":[{"en":"The museum displayed relics from ancient Egypt.","zh":"博物馆展出了古埃及的遗物。"},{"en":"This old radio is a relic of my grandparents’ time.","zh":"这台老收音机是我祖父母那个时代的遗物。"}]},{"partOfSpeech":"n.","definition":{"en":"a holy object connected with a saint or religious figure, kept for religious respect","zh":"圣物；圣髑（与圣人或宗教人物有关、受敬奉的物品）"},"examples":[{"en":"The church keeps a relic believed to belong to the saint.","zh":"这座教堂保存着一件被认为属于那位圣人的圣物。"},{"en":"Pilgrims traveled to see the relic.","zh":"朝圣者远道而来瞻仰圣物。"}]},{"partOfSpeech":"n.","definition":{"en":"something left over from an earlier time or an old system, often seen as outdated","zh":"遗留物；旧制度/旧事物的残余（常带“过时”的含义）"},"examples":[{"en":"Some people think the rule is a relic of the past.","zh":"有些人认为这条规定是过去时代遗留下来的东西。"},{"en":"The building is a relic from the colonial period.","zh":"这座建筑是殖民时期遗留下来的。"}]}],"synonyms":["artifact","antique","remains","memento","heirloom","survivor"],"phonetic":"/ˈrɛlɪk/","extraExplanation":["你输入的“rlic”很可能是拼写少了一个字母，正确拼写通常是 **relic**。","词源来自拉丁语 *reliquiae*（“遗留下来的东西”）。在英语里既可指“历史遗物”，也常用于比喻“过时的旧规/旧观念”。","在文学与新闻写作中，*relic* 常带有“时间留下的痕迹”的画面感，比如 *a relic of a bygone era*（逝去年代的遗迹/遗存）。"]}
{"word":"rly","summary":{"en":"“rly” is an informal abbreviation of “really” used online or in texts.","zh":"“rly”是“really”的非正式缩写，常用于网络或短信聊天。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet/texting) short for “really,” used to show surprise, doubt, or emphasis.","zh":"（网络/短信）“really”的缩写，用来表示惊讶、怀疑或强调。"},"examples":[{"en":"Rly? I thought the meeting was tomorrow.","zh":"真的？我还以为会议是明天。"},{"en":"I’m rly tired today.","zh":"我今天真的很累。"},{"en":"Do you rly want to quit?","zh":"你真的想辞职吗？"}]}],"synonyms":["really","seriously (depending on tone)","for real (informal)"],"phonetic":"/ˈrɪli/","extraExplanation":["“rly”常见于聊天、短信、社交媒体等非正式场合；在正式写作或邮件中建议写全 “really”。","根据语气不同，“rly?” 常带有“真的假的/你确定吗”的感觉；而 “rly” 放在形容词前（rly good, rly tired）通常就是“很/非常”。"]}
