{"word":"rven","summary":{"en":"“rven” is likely a misspelling of “raven”: a large black bird; also related forms mean eating very eagerly or being extremely hungry (ravenous).","zh":"“rven”很可能是“raven”的拼写错误：指渡鸦；相关用法还可表示狼吞虎咽或极其饥饿（ravenous）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a large black bird (a type of crow), often associated with mystery or old stories.","zh":"（可能想查的词）渡鸦：一种体型较大的黑色鸟类（鸦科），在故事与传说中常带有神秘色彩。"},"examples":[{"en":"A raven sat on the fence and watched us quietly.","zh":"一只渡鸦停在篱笆上，安静地看着我们。"},{"en":"In many myths, ravens are seen as clever messengers.","zh":"在许多神话里，渡鸦被视为聪明的信使。"}]},{"partOfSpeech":"vi.","definition":{"en":"to eat very eagerly and quickly; to devour.","zh":"狼吞虎咽；贪婪地吃；大口吞食。"},"examples":[{"en":"After the long hike, we ravened for dinner.","zh":"长途徒步后，我们特别渴望吃晚饭。"},{"en":"The kids ravened through the snacks in minutes.","zh":"孩子们几分钟就把零食狼吞虎咽地吃完了。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing intense hunger or desire (often used before a noun).","zh":"极其饥饿的；极度渴望的（常用于名词前）。"},"examples":[{"en":"He gave the bread to a ravenous dog.","zh":"他把面包给了一只饿得发狂的狗。"},{"en":"She had a ravenous appetite after swimming.","zh":"游泳后她胃口大开。"}]}],"synonyms":["(n.) crow (general)","(adj.) very hungry","(vi.) devour"],"phonetic":"/ˈreɪvən/","extraExplanation":["“rven”本身不是常见英文单词，最可能是拼写少了一个字母，想查的是 **raven** /ˈreɪvən/（渡鸦）。如果你其实想查 **even**（甚至/平的/偶数）或别的词，告诉我你想表达的中文意思或给我一个句子，我可以帮你定位正确单词。","文化小知识：渡鸦在英语文学中很有名，例如埃德加·爱伦·坡的诗《The Raven》（《乌鸦》）让“raven/乌鸦类”常被联想到神秘、预兆与阴郁氛围。"]}
{"word":"rvient","summary":{"en":"Revenant means someone (or something) that returns, especially a figure believed to come back from the dead; it can also describe returning/reappearing feelings or themes in literature.","zh":"Revenant 指“归来者”，尤指传说中从死亡中回来的亡者；也可作形容词，表示情感、记忆或主题的“回归/再现”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who returns, especially someone believed to come back from the dead (often in stories or folklore)","zh":"归来者；（尤指传说中）亡者返魂、还魂者"},"examples":[{"en":"In the novel, a mysterious revenant appears at the old mansion every winter.","zh":"在小说里，每年冬天那座老宅都会出现一位神秘的“还魂者”。"},{"en":"The villagers feared he was a revenant and avoided the graveyard at night.","zh":"村民们害怕他是“亡者返魂”，夜里都避开墓地。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to something that returns or reappears, especially a feeling, memory, or theme","zh":"（事物）回归的；再现的（尤指情感、记忆或主题）"},"examples":[{"en":"A revenant sadness returned whenever she heard that song.","zh":"每当她听到那首歌，一种回归的忧伤就会涌上心头。"},{"en":"The film uses revenant images of childhood to tell the story.","zh":"这部电影用反复再现的童年意象来讲述故事。"}]}],"synonyms":["returnee","ghost","apparition","reappearance"],"phonetic":"/ˈrɛvənɑnt/","extraExplanation":["你输入的“rvient”很可能是拼写误差。英语里比较接近且常见的词是 **revenant**（常见于文学、恐怖/奇幻题材）。另外，法语 **revient** 表示“回来/返回（第三人称）”，但它不是英语单词。若你想查的是法语或其他词，请告诉我上下文句子。","词源提示：**revenant** 来自法语 *revenir*（回来），在英语中常带有“从死亡/消失中归来”的文学色彩。你可能在小说、哥特文学或电影标题中见过它（如 *The Revenant*）。"]}
{"word":"rvulsant","summary":{"en":"Revulsant means “causing strong disgust,” and it can also mean (in older medical use) a counterirritant.","zh":"revulsant 意为“令人强烈厌恶的”；在较旧的医学用法中还可指“对抗性刺激剂／发红剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing a strong feeling of disgust or repulsion; revolting","zh":"令人厌恶的；引起强烈反感的"},"examples":[{"en":"The revulsant smell made everyone step back.","zh":"那股令人作呕的气味让大家都往后退。"},{"en":"He described the violence in revulsant detail.","zh":"他用令人反感的细节描写了暴力场面。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical, less common) a substance used to irritate the skin to draw blood to the surface and relieve deeper pain (a counterirritant)","zh":"（医学，较少见）发红剂／刺激剂：通过刺激皮肤使血液流向表面，以减轻深层疼痛的物质（对抗性刺激剂）"},"examples":[{"en":"In older medical texts, mustard plaster was used as a revulsant.","zh":"在较早的医学文献中，芥末膏曾被用作发红剂（revulsant）。"}]}],"synonyms":["revolting","disgusting","repulsive","nauseating","off-putting"],"phonetic":"/rɪˈvʌlsənt/","extraExplanation":["这个词比较少见，更常用的是 revolting / disgusting / repulsive。形容“令人厌恶的”时，revulsant 语气偏书面、带有“引起生理或心理强烈反胃/排斥”的感觉。","词源上与 revulsion（强烈厌恶、反感）相关；在医学旧用法里，revulsant 指“刺激皮肤以转移或减轻深部不适”的药物或方法。"]}
