{"word":"SD","summary":{"en":"“SD” is a common abbreviation that can mean South Dakota, Secure Digital (SD card), or standard deviation, depending on context.","zh":"“SD”是常见缩写，常指南达科他州、Secure Digital（SD 存储卡）或标准差，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for the U.S. state of South Dakota","zh":"美国南达科他州（South Dakota）的缩写"},"examples":[{"en":"She moved to Rapid City, SD for a new job.","zh":"她为了新工作搬到了南达科他州（SD）的拉皮德城。"},{"en":"The package was sent to Sioux Falls, SD.","zh":"包裹寄到了南达科他州（SD）的苏福尔斯。"}]},{"partOfSpeech":"other","definition":{"en":"short for Secure Digital (SD): a common type of memory card used in cameras, phones, and other devices","zh":"Secure Digital 的简称：一种常见的存储卡（SD 卡），用于相机、手机等设备"},"examples":[{"en":"My camera says the SD card is full.","zh":"我的相机提示 SD 卡已满。"},{"en":"Insert the SD card to transfer the photos.","zh":"插入 SD 卡来传输照片。"}]},{"partOfSpeech":"other","definition":{"en":"short for standard deviation in statistics: a number that shows how spread out the data are","zh":"统计学中 standard deviation（标准差）的缩写：表示数据分散程度的数值"},"examples":[{"en":"The mean is 70, and the SD is 8.","zh":"平均值是 70，标准差（SD）是 8。"},{"en":"A larger SD means the results vary more.","zh":"SD 越大，结果波动越大。"}]}],"synonyms":["South Dakota","Secure Digital","standard deviation"],"phonetic":"/ˌɛsˈdiː/","extraExplanation":["“SD”是非常常见的缩写，具体含义高度依赖语境：地址/车牌常指“南达科他州”，电子产品说明书里多指“存储卡”，学术论文或数据分析里则常指“标准差”。如果你告诉我出现的场景（比如一句话或图片），我可以帮你确定是哪一个。"]}
{"word":"SDR","summary":{"en":"SDR is a common abbreviation that can mean software-defined radio, Special Drawing Rights (IMF), or standard dynamic range (video).","zh":"SDR是常见缩写，可能指软件定义无线电、特别提款权（IMF），或标准动态范围（影音显示）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Software-defined radio: a radio communication system where many traditional hardware functions (like tuning and modulation) are done by software.","zh":"软件定义无线电：一种无线电通信系统，把传统由硬件完成的功能（如调谐、调制等）改由软件实现。"},"examples":[{"en":"I built an SDR to listen to aircraft signals.","zh":"我做了一个SDR来接收飞机的信号。"},{"en":"With an SDR dongle, you can explore many bands on a laptop.","zh":"用SDR小棒（接收器），你可以在笔记本电脑上探索很多频段。"}]},{"partOfSpeech":"n.","definition":{"en":"Special Drawing Rights: an international reserve asset created by the IMF, used as a unit of account and to support countries’ reserves.","zh":"特别提款权：国际货币基金组织（IMF）创设的一种国际储备资产，用作记账单位并支持各国储备。"},"examples":[{"en":"The loan was valued in SDR rather than U.S. dollars.","zh":"这笔贷款以SDR而不是美元计价。"},{"en":"Countries can exchange SDR for usable currencies through IMF arrangements.","zh":"各国可通过IMF机制把SDR兑换成可使用的货币。"}]},{"partOfSpeech":"n.","definition":{"en":"Standard dynamic range: the “normal” range of brightness and color in video/display, contrasted with HDR (high dynamic range).","zh":"标准动态范围：视频/显示的“常规”亮度与色彩范围，与HDR（高动态范围）相对。"},"examples":[{"en":"This movie is available in SDR and HDR.","zh":"这部电影同时提供SDR和HDR版本。"},{"en":"My monitor looks better in SDR mode for older games.","zh":"我的显示器在SDR模式下玩老游戏看起来更好。"}]}],"synonyms":["software-defined radio (for the radio meaning)","Special Drawing Rights (full form)","standard dynamic range (full form)"],"phonetic":"ˌɛs diː ˈɑr","extraExplanation":["“SDR”是缩写，在不同领域含义差别很大。常见三种是：无线电（Software-defined radio）、国际金融（Special Drawing Rights）、影音显示（Standard dynamic range）。如果你告诉我上下文（例如在哪篇文章/设备菜单/课程里看到），我可以帮你锁定最准确的含义与用法。"]}

