{"word":"SF","summary":{"en":"SF most commonly means science fiction or San Francisco, depending on context.","zh":"SF最常见指“科幻”或“旧金山”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Science fiction: stories (books, films, etc.) about imagined future science, technology, space travel, aliens, or other unreal but science-based ideas.","zh":"科幻（science fiction）：以未来科技、太空旅行、外星人等为题材的想象故事（小说、电影等）。"},"examples":[{"en":"I love SF movies about space exploration.","zh":"我喜欢关于太空探索的科幻电影。"},{"en":"This novel mixes SF and mystery.","zh":"这本小说把科幻和推理结合在一起。"}]},{"partOfSpeech":"other","definition":{"en":"San Francisco, California (abbreviation).","zh":"旧金山（美国加州，缩写）。"},"examples":[{"en":"I’m flying to SF for a conference.","zh":"我要飞去旧金山参加会议。"},{"en":"SF has great food and beautiful views.","zh":"旧金山有很棒的食物和漂亮的景色。"}]}],"synonyms":["sci-fi (for science fiction)","San Fran (informal, for San Francisco)"],"phonetic":"/ˌɛs ˈɛf/","extraExplanation":["“SF”是缩写，读作字母音“ess-eff”。在不同语境里最常见的两种含义是“science fiction（科幻）”和“San Francisco（旧金山）”。","在书评、影评、论坛中，“SF”通常指科幻类型；在行程、聊天、地图语境中，“SF”更可能指旧金山。"]}
{"word":"sfc","summary":{"en":"SFC is a context-dependent abbreviation; common meanings include Service Function Chaining (networking) and Super Famicom (gaming).","zh":"SFC 是一个依上下文而定的缩写；常见含义包括网络中的“服务功能链”和游戏中的“Super Famicom（超任日版名称）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in different fields; the meaning depends on context (for example, in networking, business, or gaming).","zh":"一个在不同领域里使用的缩写；具体意思取决于上下文（例如网络、商业或游戏等）。"},"examples":[{"en":"What does SFC stand for in this document?","zh":"在这份文件里，SFC 代表什么？"},{"en":"In networking, SFC often refers to a specific architecture.","zh":"在网络领域，SFC 常常指一种特定的架构。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, networking) Service Function Chaining: routing network traffic through a specific ordered set of network services (e.g., firewall → load balancer → intrusion detection).","zh":"（计算机/网络）服务功能链（Service Function Chaining）：把网络流量按指定顺序依次经过一组网络服务（如 防火墙→负载均衡→入侵检测）。"},"examples":[{"en":"The company uses SFC to ensure traffic passes through the firewall and then the IDS.","zh":"这家公司用 SFC 来确保流量先经过防火墙，再经过入侵检测系统。"},{"en":"SFC can simplify how security policies are applied across a network.","zh":"SFC 可以简化安全策略在网络中的应用方式。"}]},{"partOfSpeech":"other","definition":{"en":"(finance, India) Small Finance Bank/Small Finance Company: a type of institution focused on basic banking and lending services, often for underserved customers.","zh":"（金融/印度）小型金融银行/小型金融公司：一种侧重基础银行与信贷服务的机构，常服务于金融覆盖不足的人群。"},"examples":[{"en":"She took a micro-loan from an SFC in her town.","zh":"她从本地一家 SFC 申请了一笔小额贷款。"},{"en":"Many SFCs focus on serving rural areas.","zh":"许多 SFC 重点服务农村地区。"}]},{"partOfSpeech":"other","definition":{"en":"(gaming) Super Famicom: the Japanese name for the Super Nintendo Entertainment System (often written as SFC).","zh":"（游戏）Super Famicom（超级任天堂主机在日本的名称），常缩写为 SFC。"},"examples":[{"en":"He collects SFC cartridges from the 1990s.","zh":"他收藏 90 年代的 SFC 游戏卡带。"},{"en":"This game was released on the SFC in Japan.","zh":"这款游戏在日本是以 SFC 平台发行的。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌɛs ɛf ˈsi/","extraExplanation":["SFC 是典型的“多义缩写”。最可靠的方法是看上下文：它出现在哪个行业（网络/金融/游戏/合同/组织名称）以及前后有哪些关键词。","如果你把含有 SFC 的完整句子或截图发来，我可以帮你精确判断这里的 SFC 指哪一个。"]}
{"word":"sforzando","summary":{"en":"Sforzando is a music term meaning a sudden, strong accent on a note or chord, often marked as “sfz.”","zh":"Sforzando是音乐术语，表示在某个音或和弦上突然、强烈的重音，常用“sfz”标记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden, strong accent or emphasis on a single note or chord in music.","zh":"（音乐）在一个音或和弦上突然、强烈的重音/强调。"},"examples":[{"en":"The pianist played the chord with a sharp sforzando.","zh":"钢琴家用一个明显的sforzando（强重音）弹了那个和弦。"},{"en":"Look for the “sfz” marking; it tells you to add a sudden accent.","zh":"找一下“sfz”的标记；它提示你要加一个突然的重音。"}]},{"partOfSpeech":"adj.","definition":{"en":"Marked or performed with a sudden strong accent (often written as sfz in sheet music).","zh":"（音乐术语）带有突然强重音的；以突然强重音演奏的（常写作sfz）。"},"examples":[{"en":"Play the opening note sforzando, then quickly return to a softer dynamic.","zh":"开头的音要用sforzando强奏，然后迅速回到更弱的力度。"},{"en":"The sforzando attack made the melody sound dramatic.","zh":"这个sforzando式的起音让旋律听起来更有戏剧性。"}]}],"synonyms":["accent","emphasis","stress"],"phonetic":"/sfɔrˈzɑn.doʊ/","extraExplanation":["“sforzando”来自意大利语，和动词“sforzare”（用力、强迫、加力）有关，所以它的核心感觉是“突然用力一下”。常见缩写：sfz；也会看到sf或fz。","在乐谱里，sforzando通常表示“瞬间强烈强调”，不一定等同于一直保持强（f）。很多时候是“重击一下，然后立刻回落”。","在古典音乐评论或排练中，人们也会把它当作一种“效果/处理”来谈，比如“add a sforzando”表示“在这里做一个突然的强调”。"]}

