{"word":"Svalbard","summary":{"en":"Svalbard is a Norwegian Arctic island group, also known for its special treaty-based international status.","zh":"Svalbard（斯瓦尔巴）是挪威的北极群岛，也因《斯瓦尔巴条约》带来的特殊国际地位而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Arctic archipelago (group of islands) that is part of Norway, located north of mainland Europe.","zh":"斯瓦尔巴群岛：位于北极的群岛，属于挪威，地处欧洲大陆以北。"},"examples":[{"en":"Svalbard is known for its polar bears and long winter nights.","zh":"斯瓦尔巴以北极熊和漫长的极夜而闻名。"},{"en":"She joined a research team studying climate change in Svalbard.","zh":"她加入了一个在斯瓦尔巴研究气候变化的团队。"}]},{"partOfSpeech":"n.","definition":{"en":"The name of a treaty-based region with special international rules, especially about residence, business, and demilitarization (no military use).","zh":"（条约制度下的）斯瓦尔巴地区：具有特殊国际规则的区域，尤其涉及居住、经商以及非军事化。"},"examples":[{"en":"Under the Svalbard Treaty, citizens of many countries may live and work in Svalbard.","zh":"根据《斯瓦尔巴条约》，许多国家的公民可以在斯瓦尔巴居住和工作。"},{"en":"The treaty requires Svalbard to remain demilitarized.","zh":"该条约要求斯瓦尔巴保持非军事化。"}]}],"synonyms":["Svalbard archipelago","Spitsbergen (largest island, not an exact synonym)"],"phonetic":"/ˈsvɑlˌbɑrd/","extraExplanation":["“Svalbard”在英语里通常指整个群岛；其中最大的岛叫“Spitsbergen（斯匹次卑尔根岛）”，很多人会把Spitsbergen误当成Svalbard的同义词，但严格来说Spitsbergen只是其中一部分。","“Svalbard Global Seed Vault（斯瓦尔巴全球种子库）”很常见：它是一个用于保存全球作物种子的设施，常被媒体称为“末日种子库（Doomsday Vault）”，与气候变化、粮食安全等话题经常一起出现。"]}
{"word":"svelte","summary":{"en":"Svelte means slim and graceful, or sleek and elegant in style/design.","zh":"Svelte 指“苗条优雅”，也可指“风格/设计简洁利落、精致有型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or their body) slim and graceful in an attractive way.","zh":"（人或身材）苗条而优雅的；轻盈好看的。"},"examples":[{"en":"She has a svelte figure and moves with confidence.","zh":"她身材苗条，走起路来自信又优雅。"},{"en":"The dancer looked svelte in a simple black outfit.","zh":"那位舞者穿着简洁的黑色服装，看起来很轻盈优雅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of clothes, design, or style) sleek, smooth, and elegant; polished-looking.","zh":"（衣着、设计或风格）线条利落的；简洁雅致的；精致有型的。"},"examples":[{"en":"The new app has a svelte design that’s easy to navigate.","zh":"这款新应用的设计简洁利落，操作起来很顺手。"},{"en":"He wore a svelte suit to the interview.","zh":"他面试时穿了一套剪裁利落的西装。"}]}],"synonyms":["slim","slender","lean","graceful","sleek","elegant","streamlined"],"phonetic":"/svɛlt/","extraExplanation":["“svelte”来自意大利语 svelto，原意接近“敏捷、灵活”，后来在英语里更多用来形容“苗条、线条好看、利落优雅”。常见搭配：svelte figure / svelte body / svelte look / svelte design。注意：它通常是褒义词，但用在人身上有时会带一点“刻意强调身材”的感觉，视语境而定。"]}
{"word":"SVP","summary":{"en":"SVP most commonly means “please” (from French), but it can also be a technical abbreviation such as “standard vapor pressure,” depending on context.","zh":"SVP 最常见表示“请”（源自法语），也可能是如“标准蒸气压”等技术缩写，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from French) “Please”; used in messages or labels to politely ask for something.","zh":"（源自法语）“请”；在信息或标签中用来礼貌地提出请求。"},"examples":[{"en":"Send me the file today, SVP.","zh":"请今天把文件发给我，SVP。"},{"en":"SVP, can you help me check this form?","zh":"请你帮我看一下这份表格，可以吗？"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation for “Standard Vapor Pressure” (science/engineering).","zh":"“标准蒸气压”的缩写（科学/工程领域）。"},"examples":[{"en":"The SVP increases as temperature rises.","zh":"温度升高时，SVP 会增大。"},{"en":"We calculated SVP to compare the liquids.","zh":"我们计算 SVP 来比较这些液体。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing/tech) An abbreviation used in some contexts for “Secure Virtual Private (network)” or other organization-specific terms; meaning depends on the document/system.","zh":"（计算机/技术）在某些语境中可作“安全虚拟专用（网络）”等缩写；具体含义取决于文件/系统。"},"examples":[{"en":"Check the manual—SVP here refers to a network setting.","zh":"查看手册——这里的 SVP 指的是一种网络设置。"}]}],"synonyms":["please (for the French sense)"],"phonetic":"/ˌɛsviːˈpiː/","extraExplanation":["“SVP”最常见的日常用法来自法语缩写“s’il vous plaît”，相当于英文“please”。在英语环境里它多见于短信、聊天或较随意的书面沟通中；正式英文邮件一般直接写“please”。","如果你是在某篇论文、产品说明或工作文件里看到“SVP”，也可能是专业缩写（如标准蒸气压等）。遇到这种情况，最好结合上下文或查看该文件的缩写表。"]}

