{"word":"sy","summary":{"en":"“sy” is commonly a casual texting short form of “see you,” and it can also mean “school year” in education contexts.","zh":"“sy”常见于聊天中，作为“see you（再见）”的随意缩写；在教育语境里也可表示“school year（学年）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(texting) Short for “see you,” used to say goodbye and indicate you will meet or talk again later.","zh":"（短信/聊天）“see you”的缩写，用来道别，表示之后再见/再联系。"},"examples":[{"en":"Gotta go—sy later!","zh":"我得走了——回头见！"},{"en":"Thanks for your help, sy tomorrow.","zh":"谢谢你的帮助，明天见。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “school year” (often written as SY), used in education contexts.","zh":"“school year”（学年）的缩写（常写作SY），用于教育场景。"},"examples":[{"en":"Enrollment increased in SY 2025–2026.","zh":"在2025—2026学年，入学人数增加了。"},{"en":"The policy starts next SY.","zh":"这项政策将从下个学年开始实施。"}]}],"synonyms":["see you","cya","cu","see ya","SY (school year)"],"phonetic":"/si ju/","extraExplanation":["在聊天里写“sy”有时会被理解为很随意的告别语，但更常见、更明确的写法是“cu / c u / cya / see ya”。如果怕对方看不懂，可以直接写“see you”。"]}
{"word":"sybarite","summary":{"en":"A sybarite is someone who loves luxury and pleasure, often in a way that seems self-indulgent.","zh":"sybarite 指爱奢华与享受、常被认为有些自我放纵的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who enjoys luxury, comfort, and pleasure, especially fine food, drink, and an easy life","zh":"追求享乐与奢华生活的人；沉溺于美食美酒与舒适享受的人（享乐主义者）"},"examples":[{"en":"He was known as a sybarite who spent weekends at expensive resorts.","zh":"他以享乐主义者著称，周末常去昂贵的度假村。"},{"en":"Some people call her a sybarite because she loves fine dining and designer clothes.","zh":"有人称她为享乐主义者，因为她喜欢高级餐厅和名牌服装。"},{"en":"The novel portrays a sybarite bored by ordinary pleasures.","zh":"这部小说刻画了一个对普通享受感到厌倦的享乐者。"}]}],"synonyms":["hedonist","pleasure-seeker","epicurean","bon vivant"],"phonetic":"/ˈsɪbəˌraɪt/","extraExplanation":["“sybarite”源自古希腊城市 Sybaris（西巴里斯），古代作家常用它来象征奢侈、纵欲与讲究享受的生活方式。","语气提示：这个词常带一点批评或讽刺意味，暗示“过度追求享受”。中性表达可用 “someone who enjoys comfort/luxury”。"]}
{"word":"sybaritic","summary":{"en":"Sybaritic means devoted to luxury and pleasure.","zh":"sybaritic 指“沉迷奢华与享乐的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loving luxury, pleasure, and comfort; focused on enjoying rich or sensual experiences.","zh":"奢靡享乐的；沉迷于舒适与感官享受的。"},"examples":[{"en":"They spent a sybaritic weekend at a seaside resort, eating well and doing nothing else.","zh":"他们在海边度假村度过了一个奢享的周末，吃得很好，几乎什么也不做。"},{"en":"The novel describes a sybaritic life of fine wine, silk sheets, and late nights.","zh":"这部小说描写了由美酒、丝质床单和深夜狂欢构成的享乐生活。"}]}],"synonyms":["hedonistic","luxurious","self-indulgent","sensual"],"phonetic":"/ˌsɪbəˈrɪtɪk/","extraExplanation":["“sybaritic”源自古希腊城市 Sybaris（西巴里斯），在古代以富裕和奢华闻名，因此这个词常带有“过度享乐、缺乏节制”的含义（有时略带贬义）。","常见搭配：sybaritic lifestyle/pleasures/luxury（奢靡的生活方式/享乐/奢华）。写作中常用于描写人物沉溺享受、与“自律/艰苦”形成对比。"]}
{"word":"sycamore","summary":{"en":"A large shade tree; in the U.S., usually the American sycamore with peeling, mottled bark.","zh":"一种高大的遮荫树；在美国通常指树皮斑驳、会剥落的美洲悬铃木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tree with broad leaves, often found near streets or rivers; in American English it usually refers to the American sycamore, known for its mottled, peeling bark","zh":"一种高大的阔叶树，常见于街道或河边；在美式英语中通常指“美洲悬铃木”，以斑驳、会剥落的树皮著称"},"examples":[{"en":"The sycamore’s bark peeled in patches, showing white and tan underneath.","zh":"悬铃木的树皮一块块剥落，露出下面的白色和浅褐色。"},{"en":"They picnicked under a sycamore by the river.","zh":"他们在河边一棵悬铃木下野餐。"},{"en":"Our street is lined with sycamores that give great shade in summer.","zh":"我们这条街两旁种着悬铃木，夏天遮阴效果很好。"}]}],"synonyms":["plane tree","American sycamore","platanus"],"phonetic":"/ˈsɪkəˌmɔr/","extraExplanation":["在美式英语里，sycamore 通常指 American sycamore（Platanus occidentalis，美洲悬铃木）。在英式英语里，sycamore 常指 sycamore maple（Acer pseudoplatanus，假悬铃木/欧洲槭树的一种）。所以读英美文学或看纪录片时，具体是哪一种树要看地区语境。","sycamore 在英语文化中常作为“高大、古老、遮荫”的意象出现，常见于描写乡村、河岸或街景的文字。你也可能见到 “sycamore tree” 这种更明确的说法。"]}
{"word":"sycophancy","summary":{"en":"Sycophancy means insincere flattery used to gain advantage, especially toward powerful people.","zh":"sycophancy 指为谋取好处而对有权势者进行不真诚的奉承与谄媚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive praise or flattery used to gain favor from someone in power (often in a dishonest or self-serving way).","zh":"（为讨好有权势者而表现出的）阿谀奉承；谄媚（通常带有不真诚、图利的意味）。"},"examples":[{"en":"The manager was tired of the sycophancy around the CEO and wanted honest feedback instead.","zh":"经理厌倦了大家对CEO的阿谀奉承，更希望听到真诚的反馈。"},{"en":"Her compliments sounded like sycophancy, not genuine respect.","zh":"她的夸奖听起来像是谄媚，而不是真正的尊重。"}]}],"synonyms":["flattery","fawning","toadying","bootlicking","obsequiousness"],"phonetic":"/ˈsɪkəfənsi/","extraExplanation":["“sycophancy”是强烈贬义词，强调“讨好+功利目的”。如果只是礼貌称赞，常用“praise”“compliment”。如果想表达“卑躬屈膝地讨好”，也可用“toadying”“bootlicking”（更口语、更尖刻）。","词源来自希腊语，原义与“告密/诬告”有关，后来发展为“靠巴结权贵谋利的人及其行为”。在职场或政治语境中很常见，用来批评不敢讲真话的文化。"]}
{"word":"sycophant","summary":{"en":"A sycophant is someone who flatters powerful people to gain favor or personal benefit.","zh":"sycophant 指为了讨好权势、谋取私利而阿谀奉承的人（贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who flatters someone (especially someone powerful) in order to gain an advantage.","zh":"（尤指对有权势的人）阿谀奉承、拍马屁以获取好处的人。"},"examples":[{"en":"Everyone could tell he was a sycophant who praised the boss just to get promoted.","zh":"大家都看得出来他是个马屁精，为了升职才拼命夸老板。"},{"en":"She disliked sycophants and preferred honest feedback.","zh":"她讨厌阿谀奉承的人，更喜欢诚实的反馈。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports a powerful person or group in a dishonest or self-serving way; a servile follower.","zh":"以不诚实或自利的方式依附权势、卑躬屈膝的追随者。"},"examples":[{"en":"The leader surrounded himself with sycophants who never challenged his decisions.","zh":"那位领导身边围满了唯唯诺诺的追随者，从不质疑他的决定。"},{"en":"In the story, the hero refuses to become a sycophant to the corrupt court.","zh":"在故事里，主人公拒绝去巴结腐败的朝廷。"}]}],"synonyms":["flatterer","toady","yes-man","bootlicker"],"phonetic":"/ˈsɪkəfənt/","extraExplanation":["“sycophant”在现代英语里语气很负面，常暗含“为了利益而奉承、缺乏原则”。它和较中性的“compliment（赞美）”“praise（表扬）”不同，强调动机不纯。","发音里“c”不读/k/，而是/s/：sycophant /ˈsɪkəfənt/。","近义词：flatterer, toady, yes-man（口语）。反义表达可用：straight talker（直言者）, truth-teller（讲真话的人）。"]}
{"word":"sycophantic","summary":{"en":"Sycophantic means insincerely flattering someone powerful to get something.","zh":"sycophantic 指为了得到好处而对有权势的人虚伪奉承。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively praising or flattering someone (especially someone powerful) in a way that is insincere, in order to gain an advantage.","zh":"（尤指对有权势的人）阿谀奉承的；过度讨好、带有功利目的且不真诚的。"},"examples":[{"en":"The manager was tired of sycophantic compliments from people who wanted promotions.","zh":"经理厌倦了那些想升职的人阿谀奉承的恭维。"},{"en":"Her sycophantic tone made the praise feel fake.","zh":"她那种谄媚的语气让称赞听起来很假。"}]}],"synonyms":["obsequious","fawning","ingratiating","servile"],"phonetic":"/ˌsɪkəˈfæntɪk/","extraExplanation":["“sycophantic”常带强烈贬义，强调“虚伪 + 目的性”（为了好处而奉承）。比“polite / respectful（礼貌/尊重）”更负面。","词源来自希腊语，历史上与“告密者/诬告者”有关，后来意义转为“谄媚者”的态度。现代英语里常用于职场、政治或名人圈等权力关系明显的场景。"]}
{"word":"Sydney","summary":{"en":"Sydney is most commonly the name of a major city in Australia, and it is also used as a personal name.","zh":"Sydney 最常指澳大利亚的大城市“悉尼”，也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large coastal city in New South Wales, Australia, famous for its harbor and landmarks such as the Sydney Opera House and Harbour Bridge.","zh":"澳大利亚新南威尔士州的沿海大城市，以海港及悉尼歌剧院、海港大桥等地标闻名。"},"examples":[{"en":"I’m flying to Sydney next week for a conference.","zh":"我下周要飞去悉尼参加一个会议。"},{"en":"Sydney is known for its beautiful harbor.","zh":"悉尼以其美丽的海港而闻名。"},{"en":"We watched the fireworks in Sydney on New Year’s Eve.","zh":"我们在除夕夜在悉尼看了烟花。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name (used for any gender, though often male in some regions).","zh":"人名“Sydney”（可用于任何性别；在一些地区更常见于男性）。"},"examples":[{"en":"Sydney said she would call me later.","zh":"Sydney 说她晚点会给我打电话。"},{"en":"His name is Sydney, but everyone calls him Syd.","zh":"他叫 Sydney，但大家都叫他 Syd。"}]}],"phonetic":"/ˈsɪdni/","extraExplanation":["“Sydney”作地名时通常不加冠词（说“in Sydney”，不说“in the Sydney”）。但特定地点可能带冠词，如“the Sydney Opera House（悉尼歌剧院）”。","常见相关表达：Sydney Opera House（悉尼歌剧院）、Sydney Harbour（悉尼港/悉尼海港）、Sydney Harbour Bridge（悉尼海港大桥）。"]}
{"word":"sydney","summary":{"en":"Sydney is most commonly the name of Australia’s largest city; it is also used as a personal name.","zh":"Sydney 最常指澳大利亚最大的城市“悉尼”，也可作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sydney: the largest city in Australia, in the state of New South Wales, famous for its harbor, beaches, and landmarks such as the Sydney Opera House and Harbour Bridge.","zh":"悉尼：澳大利亚最大的城市，位于新南威尔士州，以海港、海滩以及悉尼歌剧院、海港大桥等地标闻名。"},"examples":[{"en":"I’m flying to Sydney for a conference next week.","zh":"我下周要飞去悉尼参加一个会议。"},{"en":"Sydney has a mild climate compared with many other Australian cities.","zh":"和澳大利亚许多其他城市相比，悉尼的气候较温和。"}]},{"partOfSpeech":"n.","definition":{"en":"Sydney: a given name (more common in the U.S. as “Sydney”), used for people of any gender, though often used for girls.","zh":"Sydney：人名（在美国更常见的拼写为 Sydney），可用于任何性别，但常用于女孩。"},"examples":[{"en":"Sydney said she’d join us after class.","zh":"Sydney 说她下课后会来找我们。"},{"en":"I met a guy named Sydney at the workshop.","zh":"我在工作坊认识了一个叫 Sydney 的男生。"}]}],"phonetic":"/ˈsɪdni/","extraExplanation":["“Sydney”作为地名源自英国政治家 Thomas Townshend（1st Viscount Sydney）的头衔；18世纪末英国殖民时期，新南威尔士的首任总督 Arthur Phillip 用这个名字为定居点命名。","英文中常见拼写对比：Sydney（更常见、现代）、Sidney（也可作人名，历史上常见）。发音相同，但拼写在不同国家/年代的使用习惯略有差异。","在文学与文化中，悉尼常与“港湾城市”“海边生活方式”联系在一起；旅行写作里也常用 “Sydney Harbour” 来强调其标志性的天然海港景观。"]}
{"word":"sylf","summary":{"en":"A sylph is a mythical air spirit; in older literary use, it can also mean a very slender, graceful woman.","zh":"sylph 指“空气精灵”；在较旧的文学用法中，也可指“身形纤细、优雅的女子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in stories) an imaginary spirit of the air; a light, graceful fairy-like being.","zh":"（多见于故事中）空气之灵；一种轻盈、优雅、像仙子一样的虚构生物。"},"examples":[{"en":"In the fantasy novel, a sylph guides the traveler through the clouds.","zh":"在那本奇幻小说里，一个空气精灵引导旅人穿过云层。"},{"en":"The poet compared the breeze to a sylph dancing over the lake.","zh":"诗人把微风比作在湖面上起舞的空气精灵。"}]},{"partOfSpeech":"n.","definition":{"en":"A very slender, graceful woman (a literary or old-fashioned use).","zh":"身形纤细、举止优雅的女子（文学或较旧的用法）。"},"examples":[{"en":"On stage, the dancer looked like a sylph in white.","zh":"舞台上，那位舞者穿着白衣，看起来像个轻盈的仙子。"},{"en":"The novel describes her as a sylph, quick and delicate.","zh":"小说把她描写成一个“sylph”，轻快而纤秀。"}]}],"synonyms":["air spirit","sprite","fairy","nymph"],"phonetic":"/sɪlf/","extraExplanation":["“sylf”通常被认为是“sylph”的拼写错误或变体；标准拼写更常见的是 sylph。","sylph 一词在西方神秘学传统里与“元素精灵”有关：16世纪的帕拉塞尔苏斯（Paracelsus）把自然精灵分为四类——空气（sylphs）、水（undines）、火（salamanders）、土（gnomes）。","在现代英语中，sylph 更常出现在文学、诗歌、奇幻作品或较有古典气息的描写里。"]}
{"word":"syllabe","summary":{"en":"A syllable is one beat of speech built around a vowel sound.","zh":"syllable 指以一个元音为核心的一拍（一个音节）的发音单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of pronunciation that has one vowel sound (with or without surrounding consonants) and forms all or part of a word.","zh":"音节：发音单位，包含一个元音音素（前后可有辅音），构成一个词的全部或一部分。"},"examples":[{"en":"The word “water” has two syllables: wa-ter.","zh":"“water”这个词有两个音节：wa-ter。"},{"en":"Try clapping once for each syllable to practice pronunciation.","zh":"练发音时可以每个音节拍一下手。"},{"en":"In English, stress often falls on one syllable more than the others.","zh":"英语里重音常常落在某一个音节上。"}]}],"synonyms":["beat (informal)","speech unit"],"phonetic":"/ˈsɪləbəl/","extraExplanation":["你输入的“syllabe”通常是“syllable”的拼写错误。英语正确拼法是 syllable（中间是 -la-，结尾是 -ble）。","学习音节时也常配合“重音（stress）”一起学：比如 PHO-to（重音在第一个音节），pho-TOG-ra-phy（重音位置会变化）。"]}
{"word":"syllabic","summary":{"en":"“Syllabic” means related to syllables, or based on syllables in writing or poetry.","zh":"“syllabic”指“与音节有关/以音节为单位”，也可指音节文字或按音节数构成的诗体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to syllables; divided into or measured by syllables (the beats in a word).","zh":"与音节有关的；按音节划分或以音节来计量的（音节是单词里的节拍/单位）。"},"examples":[{"en":"English spelling is not always syllabic, so one syllable can be written in different ways.","zh":"英语拼写不总是“按音节对应”的，所以同一个音节可能有不同的拼写方式。"},{"en":"When you clap the syllables in a word, you are doing a syllabic analysis.","zh":"当你把一个单词的音节拍出来时，你就在做音节（syllabic）分析。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made up of or using syllables, especially when writing words with symbols for each syllable.","zh":"由音节构成或使用音节来书写的，尤指用“一个符号代表一个音节”的书写体系。"},"examples":[{"en":"Japanese kana is a syllabic writing system: each character usually represents a syllable.","zh":"日语假名是一种音节文字：每个符号通常代表一个音节。"},{"en":"Some languages use syllabic scripts instead of alphabetic ones.","zh":"有些语言使用音节文字，而不是字母文字。"}]},{"partOfSpeech":"adj.","definition":{"en":"In poetry: having a fixed number of syllables per line (for example, 10 syllables).","zh":"（诗歌中）每行有固定音节数的（例如每行10个音节）。"},"examples":[{"en":"A syllabic poem focuses on counting syllables rather than counting stresses.","zh":"音节诗更强调数音节，而不是数重音。"},{"en":"Haiku is often discussed as a syllabic form, though English haiku doesn’t always follow strict syllable counts.","zh":"俳句常被说成是音节诗体，不过英语俳句并不总是严格遵循音节数。"}]}],"synonyms":["syllable-based","syllabified"],"phonetic":"/sɪˈlæbɪk/","extraExplanation":["在语言学里，syllabic 常和 alphabetic（字母文字）对比：字母文字更偏“字母对应音位/音素”，而音节文字更偏“符号对应音节”。","在发音学习中，syllabic 也常用于讨论“音节结构”和“重音/节奏”，例如把单词按音节拆开来帮助拼读。"]}
{"word":"syllable","summary":{"en":"A syllable is one beat or unit of sound in a word, usually built around one vowel sound.","zh":"syllable 指“音节”，是单词中的一个发音节拍/单位，通常以一个元音音素为核心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of pronunciation in a word, usually containing one vowel sound (with or without surrounding consonants).","zh":"音节：词中的一个发音单位，通常包含一个元音音素（前后可带辅音）。"},"examples":[{"en":"\"Water\" has two syllables: wa-ter.","zh":"“water”有两个音节：wa-ter。"},{"en":"The teacher asked us to clap the syllables in each word.","zh":"老师让我们把每个单词的音节拍手打出来。"}]}],"synonyms":["sound unit","beat (in a word)"],"phonetic":"/ˈsɪləbəl/","extraExplanation":["英语里“音节”常用来帮助：1）拼读（把长词分块读）；2）重音（哪一节读得更重）；3）诗歌节奏（如押韵、音步）。","音节数不一定等于字母数，也不一定等于“元音字母数”，更接近“元音音素”的数量。例如：\"fire\"在不同口音/语速下可能听起来像1个或接近2个音节。","常见相关词：syllabic（adj. 音节的/按音节的），syllabification（n. 音节划分）。"]}
{"word":"syllables","summary":{"en":"“Syllables” are the sound units that make up words; they help with pronunciation, stress, and rhythm.","zh":"“syllables”指构成单词的发音单位（音节），有助于掌握发音、重音与节奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The units of sound in a word, usually built around one vowel sound; syllables help you pronounce and stress words correctly.","zh":"（词的）音节：由一个元音音素为核心组成的发音单位；音节能帮助正确发音与掌握重音。"},"examples":[{"en":"The word “computer” has three syllables: com-pu-ter.","zh":"“computer”这个词有三个音节：com-pu-ter。"},{"en":"Clap the syllables to help you hear the rhythm of the word.","zh":"用拍手打音节可以帮助你听出这个词的节奏。"},{"en":"She counted the syllables to make sure the poem fit the meter.","zh":"她数音节来确保诗歌符合格律。"}]},{"partOfSpeech":"n.","definition":{"en":"A short part of a spoken word (a syllable) when describing how words are divided or pronounced.","zh":"（口语词汇说明中）音节：用于描述单词如何分段或发音的短语音部分。"},"examples":[{"en":"Break the word into syllables: “in-for-ma-tion.”","zh":"把这个词拆成音节：“in-for-ma-tion。”"},{"en":"Stress the first syllable in “happy.”","zh":"“happy”的重音在第一个音节。"}]}],"synonyms":["beats (informal)","sound units","syllable units"],"phonetic":"/ˈsɪləbəlz/","extraExplanation":["在英语里，很多学习者会把“音节（syllable）”和“音素（sound）”混淆：音节更像“发音的节拍/节奏单位”，而不是单个字母或单个音。","重音（stress）通常落在某个音节上，不同的重音位置可能改变词性或意思（如 REcord 名词 vs reCORD 动词）。掌握音节有助于听力、拼读、连读和朗读。","在诗歌与说唱中，音节数常用来控制节奏与韵律；因此你会看到人们“数音节”来写歌词或检查格律。"]}
{"word":"syllabus","summary":{"en":"A course outline that explains what you will study and how the class works.","zh":"说明课程学什么、怎么上、怎么评分的课程大纲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An outline (plan) of what will be taught in a course, including topics, schedule, assignments, and rules.","zh":"（课程）教学大纲：概述课程将教授的内容，包括主题安排、进度、作业与课堂规则等。"},"examples":[{"en":"The professor posted the syllabus online before the first class.","zh":"教授在第一节课前把教学大纲发布到网上。"},{"en":"Please read the syllabus carefully to understand the grading policy.","zh":"请仔细阅读教学大纲，了解评分规则。"},{"en":"According to the syllabus, we have a quiz every Friday.","zh":"根据教学大纲，我们每周五都有一次小测。"}]}],"synonyms":["course outline","course plan","curriculum (broader)"],"phonetic":"/ˈsɪləbəs/","extraExplanation":["“syllabus”常见于美式英语的大学/中学语境，通常在开课第一周发放（纸质或线上）。它不仅列出课程内容，也常包含出勤、迟交、学术诚信等政策。","词源上来自拉丁语/希腊语相关形式，历史上曾因抄写/印刷误差形成现在的拼写；但在现代英语中它就是“课程大纲”的固定用词。","复数形式常见两种：syllabuses（更常用、更口语）与 syllabi（更偏正式/学术）。"]}
{"word":"syllogism","summary":{"en":"A syllogism is a logical argument that uses two premises to reach a conclusion.","zh":"syllogism 指“三段论”，用两个前提推导出一个结论的逻辑论证方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of logical reasoning where a conclusion is drawn from two statements (premises), often in the pattern: general rule + specific case → conclusion.","zh":"三段论：一种逻辑推理方式，由两个前提推出一个结论，常见结构是：一般规则 + 具体情况 → 结论。"},"examples":[{"en":"A classic syllogism is: All humans are mortal; Socrates is human; therefore Socrates is mortal.","zh":"经典的三段论是：所有人都会死；苏格拉底是人；因此苏格拉底会死。"},{"en":"The lawyer tried to build a syllogism to show the defendant must be innocent.","zh":"律师试图用三段论来证明被告必然无罪。"},{"en":"In philosophy class, we practiced writing syllogisms with clear premises and conclusions.","zh":"在哲学课上，我们练习用清晰的前提和结论来写三段论。"}]}],"synonyms":["deductive argument","logical deduction","reasoning"],"phonetic":"/ˈsɪl.ə.dʒɪ.zəm/","extraExplanation":["“syllogism”常与“premise（前提）”“conclusion（结论）”一起出现。学习时要注意：三段论的形式可能正确，但如果前提本身不真实，结论依然可能不可靠。","常见类型包括：范畴三段论（如“所有A都是B；C是A；所以C是B”）。日常写作中也常用类似结构来让论证更有条理。","词源来自希腊语，常见于哲学、逻辑学、辩论与法律语境。相关词：deduction（演绎推理）、induction（归纳推理）、fallacy（谬误）。"]}
{"word":"sylvan","summary":{"en":"“Sylvan” means woodland-like or relating to forests, often with a poetic, peaceful tone.","zh":"“sylvan”指与森林/林地有关、如林间般的（常带诗意和宁静之感）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with woods or forests; having a natural, woodland feeling.","zh":"（与）森林、林地有关的；带有林间自然气息的。"},"examples":[{"en":"They rented a small cabin in a sylvan valley.","zh":"他们在一个林木葱郁的山谷里租了一间小木屋。"},{"en":"The painting shows a sylvan scene with tall trees and soft light.","zh":"这幅画描绘了一幅林间景致：高大的树木和柔和的光线。"},{"en":"She loves the sylvan quiet of early morning walks.","zh":"她喜欢清晨散步时那种林间的宁静。"}]}],"synonyms":["woodland","forested","wooded","rustic","pastoral"],"phonetic":"/ˈsɪl.vən/","extraExplanation":["“sylvan”带有较文学、诗意的色彩，比常见的“wooded/forested”更强调一种“林中意境”（宁静、幽美）。","词源来自拉丁语“silva”（森林）。因此你也会看到拼写变体“silvan”。","常见搭配：sylvan glade（林间空地）、sylvan retreat（林中隐居处/幽静去处）、sylvan setting（林木环绕的环境）。","在文学中常用来描写田园或神话式的自然景象（例如“sylvan nymphs”指林中仙女/树精一类的形象）。"]}
{"word":"sylvania","summary":{"en":"Sylvania is a proper name used for some places and a famous lighting brand.","zh":"Sylvania 是一个专有名词，可指一些地名，也可指知名照明品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used for places and organizations; for example, a city in Ohio (U.S.), and the name of a well-known lighting/electronics brand.","zh":"专有名词：用于地名或机构名；例如美国俄亥俄州的城市 Sylvania，也是一家知名照明/电子品牌的名称。"},"examples":[{"en":"She grew up in Sylvania, Ohio, before moving to Detroit.","zh":"她在美国俄亥俄州的 Sylvania 长大，后来搬到底特律。"},{"en":"We replaced the old bulbs with Sylvania LEDs.","zh":"我们把旧灯泡换成了 Sylvania 的 LED 灯泡。"}]}],"synonyms":["sylvan (related word)","Transylvania (related place-name)","Pennsylvania (related place-name)"],"phonetic":"/sɪlˈveɪniə/","extraExplanation":["“Sylvania”常被理解为与森林有关的名字：它与拉丁语 silva（“森林”）同源，给人“林地、树林”的联想，也因此常见于地名、品牌名或小说/影视中的虚构国名。","注意大小写：作专有名词一般要大写（Sylvania）。如果你想表达“森林的/林间的”，英语里更常用形容词 sylvan（如 “a sylvan path” 林间小路）。"]}
{"word":"Sym","summary":{"en":"“Sym” is most often an abbreviation for “symptom,” and it also appears as the word part sym-/syn- meaning “together/with.”","zh":"“Sym”最常见是“symptom（症状）”的缩写；它也可作为词根/前缀sym-/syn-，表示“一起/共同”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal abbreviation) “sym.” = symptom.","zh":"（非正式缩写）“sym.”= symptom（症状）。"},"examples":[{"en":"The chart says “sym.”: fever and cough.","zh":"病历表上写着“sym.”：发烧和咳嗽。"},{"en":"Any new sym. after taking the medicine?","zh":"吃了药之后有新的症状（sym.）吗？"}]},{"partOfSpeech":"other","definition":{"en":"(as a word part) sym- / syn- = “together; with; same,” used in many English words.","zh":"（作词根/前缀）sym- / syn- 表示“一起；共同；相同”，常见于许多英语单词中。"},"examples":[{"en":"Symmetry means parts are the same on both sides.","zh":"symmetry（对称）表示两边部分相同。"},{"en":"In “sympathy,” sym- suggests “with,” and -pathy relates to “feeling.”","zh":"在“sympathy（同情）”里，sym-有“与……一起/共同”的意思，-pathy与“感觉/情感”有关。"}]}],"synonyms":["symptom (abbr.)","syn- (word part)"],"phonetic":"/sɪm/","extraExplanation":["在英语里常见的“sym-”来自希腊语前缀“syn-（一起）”。因为发音影响，syn-在某些字母前会变成sym-（例如在p、b、m前）：sympathy, symbol, symphony；而在其他情况下常见syn-：synchronize, synonym。写作时看到sym-，通常可以联想到“共同/一起”的核心含义。"]}
{"word":"sym","summary":{"en":"“sym” is commonly an informal abbreviation for “symptom,” and sometimes for “symmetry.” It can also refer to the prefix “sym-,” meaning “together/with.”","zh":"“sym”常见用作非正式缩写，最常指“symptom（症状）”，有时也指“symmetry（对称性）”。它也可能指前缀“sym-”，表示“共同/一起/与……”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Abbreviation for “symptom.”","zh":"（非正式）“symptom（症状）”的缩写。"},"examples":[{"en":"Any sym after you take the medicine?","zh":"你吃药后有任何症状（sym）吗？"},{"en":"No sym of infection so far.","zh":"到目前为止没有感染症状（sym）。"}]},{"partOfSpeech":"n.","definition":{"en":"(math/physics, informal) Abbreviation for “symmetry.”","zh":"（数学/物理，非正式）“symmetry（对称性）”的缩写。"},"examples":[{"en":"Check the sym of the graph around the y-axis.","zh":"检查这张图像关于 y 轴的对称性（sym）。"},{"en":"The crystal has high sym.","zh":"这种晶体的对称性（sym）很高。"}]},{"partOfSpeech":"other","definition":{"en":"A prefix meaning “together” or “with,” used in words like “sympathy” and “symphony.”","zh":"表示“共同/一起/与……”的前缀，用于 sympathy（同情）、symphony（交响乐）等词。"},"examples":[{"en":"In “sympathy,” sym- suggests “together,” and -pathy relates to feeling.","zh":"在“sympathy”里，sym- 有“共同”的含义，-pathy 与“感受”有关。"},{"en":"“Synchronous” uses syn- (a close variant of sym-) to mean “at the same time.”","zh":"“synchronous”用 syn-（与 sym- 很接近的变体）表示“同时”。"}]}],"synonyms":["symptom (full form)","symmetry (full form)"],"phonetic":"/sɪm/","extraExplanation":["“sym-”来自希腊语，原本是“syn-”（一起）。在某些字母前（特别是 p/b/m），发音更顺口时会把 n 变成 m，所以 syn- 变成 sym-：sympathy、symphony、symbol 等。","在医学记录或聊天里写“sym”通常能被理解为 symptom，但正式写作中建议写全称“symptom(s)”。"]}
{"word":"symb","summary":{"en":"“symb.” is a shortened form of “symbol.”","zh":"“symb.” 是 “symbol（符号/象征）” 的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “symbol” (often used in notes, dictionaries, math, or technical writing).","zh":"“symbol”（符号、象征）的缩写（常见于笔记、词典、数学或技术写作中）。"},"examples":[{"en":"In the table, “symb.” stands for “symbol.”","zh":"在这个表格里，“symb.” 代表 “symbol（符号）”。"},{"en":"Please write the symb. for sodium: Na.","zh":"请写出钠的符号：Na。"}]}],"synonyms":["symbol (full form)"],"phonetic":"/ˈsɪmbəl/","extraExplanation":["“symb.” 常见于较正式的缩写场景，比如词典条目、教材表格、研究笔记或工程文档中。日常写作里一般直接写完整的 “symbol”。","不要把 “symb.” 和 “sym.”（有时也表示 symbol，或在医学里表示 symptom=症状）混淆；具体含义要看上下文。"]}
{"word":"symballein","summary":{"en":"Symballein is an Ancient Greek verb meaning “to throw together,” and by extension “to compare/connect ideas” or “to contribute.”","zh":"Symballein 是古希腊语动词，原义为“丢到一起”，引申为“对照/联系观念”或“促成/贡献”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(from Ancient Greek) to throw together; to put or bring things together (often used when explaining the origin of the word “symbol”).","zh":"（源自古希腊语）把……丢到一起；把事物放在一起或使其结合（常用于解释“symbol/符号”的词源）。"},"examples":[{"en":"The Greek verb symballein literally means “to throw together.”","zh":"希腊动词 symballein 的字面意思是“丢到一起”。"},{"en":"Some writers use symballein to explain how a symbol brings different ideas together.","zh":"一些作者用 symballein 来解释“符号”如何把不同的观念结合在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to compare or consider side by side; to interpret by connecting ideas.","zh":"把……放在一起比较；通过联系不同观念来理解或解释。"},"examples":[{"en":"To understand the poem, we symballein its images with its theme.","zh":"要理解这首诗，我们把它的意象与主题放在一起对照理解。"},{"en":"Historians symballein different sources to form a clearer picture.","zh":"历史学家把不同资料放在一起对照，从而形成更清晰的认识。"}]},{"partOfSpeech":"vi.","definition":{"en":"to contribute (to a result or discussion).","zh":"促成；对（结果或讨论）有所贡献。"},"examples":[{"en":"New evidence can symballein to a better conclusion.","zh":"新的证据可以促成更好的结论。"},{"en":"Her comments symballein to the team’s plan.","zh":"她的意见对团队的计划有所帮助。"}]}],"synonyms":["combine","connect","compare","contribute","link"],"phonetic":"/sɪmˈbæleɪn/","extraExplanation":["symballein 来自古希腊语 συμβάλλειν（sym- 表“共同/一起” + ballein 表“投掷”）。这个“把东西丢在一起”的画面后来引申为“组合、对照、联系”，并影响了英语词汇如 symbol（符号，原意可理解为“把意义拼合在一起的东西”）以及 symbolize、symbolic 等。","在英语里，symballein 不是日常常用词，多见于词源学、古典学或文学/哲学讨论中。日常表达通常用 combine / compare / connect / contribute 等更常见的词。"]}
{"word":"symbiosis","summary":{"en":"Symbiosis means a close long-term relationship where two different organisms live together; it can also describe a mutually helpful partnership between people or groups.","zh":"Symbiosis 指两种不同生物长期共同生活的紧密关系；也可引申为人与组织之间互利依存的合作关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a close relationship between two different living things that live together, often for a long time; at least one of them benefits (and sometimes both do)","zh":"（生物）共生：两种不同生物长期紧密地生活在一起的关系；至少一方受益（有时双方都受益）"},"examples":[{"en":"Clownfish and sea anemones live in symbiosis: the fish get protection, and the anemone gets food scraps.","zh":"小丑鱼与海葵处于共生关系：小丑鱼获得保护，海葵获得食物残渣。"},{"en":"Some plants depend on symbiosis with fungi to absorb nutrients from the soil.","zh":"有些植物依赖与真菌的共生来从土壤中吸收养分。"}]},{"partOfSpeech":"n.","definition":{"en":"a cooperative relationship between people, groups, or organizations that benefits them (often used in business, politics, or culture)","zh":"（引申义）互利关系/共生关系：人与人、团体或组织之间互相依赖并受益的合作关系（常用于商业、政治或文化语境）"},"examples":[{"en":"The two companies developed a symbiosis: one provided technology, and the other provided distribution.","zh":"两家公司形成了共生关系：一家提供技术，另一家提供渠道。"},{"en":"In many cities, art and tourism exist in symbiosis.","zh":"在许多城市，艺术与旅游呈现共生关系。"}]}],"synonyms":["mutualism","interdependence","partnership","coexistence"],"phonetic":"/ˌsɪm.baɪˈoʊ.sɪs/","extraExplanation":["“symbiosis”来自希腊语：syn-（一起）+ bios（生命/生活），字面意思是“一起生活”。生物学里它是总称，常见类型包括：mutualism（互利共生，双方受益）、commensalism（偏利共生，一方受益另一方基本无影响）、parasitism（寄生，一方受益另一方受害）。日常写作中如果想强调“双方互利”，可以直接用“mutualism”或在句子里说明双方都受益。","常见搭配：live in symbiosis（处于共生状态）、a symbiotic relationship（共生关系，形容词为 symbiotic）。"]}
{"word":"symbiotic","summary":{"en":"Symbiotic describes a close relationship—often in nature or cooperation—where both sides benefit or strongly depend on each other.","zh":"Symbiotic 指一种非常紧密的关系，常见于自然界或合作中，通常表示互利或高度相互依赖。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living closely together in a relationship where both sides benefit; based on mutual support.","zh":"共生的；互利共存的（双方都受益，彼此支持）。"},"examples":[{"en":"The clownfish and the sea anemone have a symbiotic relationship.","zh":"小丑鱼和海葵之间有一种共生关系。"},{"en":"Their symbiotic partnership helped the small business grow quickly.","zh":"他们这种互利的合作关系帮助小公司迅速成长。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving a very close, dependent relationship between two people or groups (sometimes suggesting they rely on each other too much).","zh":"（人或群体）关系紧密且相互依赖的（有时暗示过度依赖）。"},"examples":[{"en":"The CEO and the design team formed a symbiotic working relationship.","zh":"CEO 和设计团队形成了紧密互赖的合作关系。"},{"en":"Some critics say the media and celebrities have a symbiotic connection.","zh":"一些评论者认为媒体与名人之间存在互利共生的关系。"}]}],"synonyms":["mutually beneficial","interdependent","mutualistic","cooperative"],"phonetic":"/ˌsɪm.baɪˈɑː.tɪk/","extraExplanation":["“Symbiotic”来自生物学术语“symbiosis（共生）”。在自然界里常见三种关系：mutualism（互利共生，双方受益）、commensalism（偏利共生，一方受益另一方不受影响）、parasitism（寄生，一方受益另一方受损）。日常英语里说“symbiotic”多半强调互利或紧密互赖。","常见搭配：symbiotic relationship（共生关系/互利关系）、symbiotic partnership（互利合作）、symbiotic bond（共生纽带）。容易混淆：sympathetic（同情的）与 symbiotic（共生的）拼写相近但意思不同。"]}
{"word":"symbiotically","summary":{"en":"Symbiotically means “in a mutually beneficial, closely connected way,” used in both everyday contexts and biology.","zh":"symbiotically 指“以共生、互利且紧密关联的方式”，既可用于日常语境，也可用于生物学。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves a close relationship between two different people, groups, or things that helps both of them.","zh":"以共生的方式；指两方建立紧密关系并彼此受益。"},"examples":[{"en":"The small café and the bookstore next door work symbiotically: customers often visit both.","zh":"这家小咖啡馆和隔壁书店以共生方式合作：顾客常常两边都去。"},{"en":"Technology and education can grow symbiotically when schools use new tools thoughtfully.","zh":"当学校有意识地使用新工具时，科技与教育可以共生式地发展。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to symbiosis in biology (a close, long-term interaction between different species).","zh":"以（生物学）共生的方式；指不同物种之间长期而紧密的相互作用。"},"examples":[{"en":"Certain fungi live symbiotically with tree roots, helping the trees absorb nutrients.","zh":"某些真菌与树根共生，帮助树木吸收养分。"},{"en":"Clownfish and sea anemones can live symbiotically in the ocean.","zh":"小丑鱼和海葵可以在海洋中共生。"}]}],"synonyms":["mutually","interdependently","cooperatively","in tandem"],"phonetic":"/ˌsɪm.baɪˈɑt̬.ɪ.kli/","extraExplanation":["词形提示：symbiotically 来自 symbiotic（共生的）+ -ally（以……方式）。名词是 symbiosis（共生）。","用法区分：日常写作里常把 symbiotically 用于商业/社会关系，强调“互利共赢”；生物学语境则更中性，指长期共处与相互影响（不一定总是完全“对等互利”，具体要看共生类型）。"]}
{"word":"symbol","summary":{"en":"A symbol is something that represents another meaning—either an idea (like peace) or a technical sign (like + or H).","zh":"symbol 指“代表某种意义的东西”：既可以是象征性的事物（如和平的象征），也可以是技术性记号（如 +、H）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sign, object, or image that represents something else (often an idea, quality, or organization).","zh":"象征；符号：用来代表其他事物（常见为概念、品质或组织）的标志、物体或图像。"},"examples":[{"en":"The dove is a symbol of peace.","zh":"鸽子是和平的象征。"},{"en":"The heart symbol often means love.","zh":"爱心符号通常表示爱。"}]},{"partOfSpeech":"n.","definition":{"en":"A mark or character used in writing, math, science, or music to stand for something.","zh":"（书写/数学/科学/音乐中的）符号：用来表示某事物的记号或字符。"},"examples":[{"en":"‘+’ is the symbol for addition.","zh":"“+”是加法的符号。"},{"en":"The symbol H stands for hydrogen.","zh":"符号H代表氢。"}]}],"synonyms":["sign","emblem","icon","token","mark"],"phonetic":"/ˈsɪmbəl/","extraExplanation":["在文学与艺术里，symbol（象征）常用来表达更深层的含义：表面是一个具体事物（如“玫瑰”），背后指向抽象概念（如“爱情”或“美”）。读小说或看电影时，作者/导演可能会反复出现某个物件或颜色来加强象征意义。","常见搭配：a symbol of + 抽象名词（a symbol of hope/peace/freedom）；national symbol（国家象征）；status symbol（身份象征）；symbolic meaning（象征意义）。"]}
{"word":"symbolic","summary":{"en":"Symbolic means “having a deeper meaning as a symbol” or “mainly representing something rather than doing something practical.”","zh":"symbolic 表示“具有象征意义、用来象征某种观念”，也可指“象征性的、偏形式代表而非实际作用”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using symbols to represent ideas or qualities; having a meaning beyond the literal one.","zh":"象征性的；用符号来表达观念或品质；含有超越字面意义的含义。"},"examples":[{"en":"The dove is symbolic of peace in many cultures.","zh":"在许多文化中，鸽子象征和平。"},{"en":"In the novel, the storm is symbolic, showing the character’s inner conflict.","zh":"在小说里，暴风雨具有象征意义，用来表现人物的内心冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"Expressed mainly through symbols rather than direct, practical action; representing something in a formal way.","zh":"象征式的；主要通过象征或形式来表达，而非直接的实际行动；具有代表意义的。"},"examples":[{"en":"The company made a symbolic donation to show support, but it didn’t change much.","zh":"公司做了一笔象征性的捐款以示支持，但并没有带来太大改变。"},{"en":"They exchanged symbolic gifts during the ceremony.","zh":"他们在仪式上互赠象征性的礼物。"}]}],"synonyms":["representative","emblematic","figurative","token","metaphorical"],"phonetic":"/sɪmˈbɑlɪk/","extraExplanation":["“symbolic”常与介词 of 连用：be symbolic of…（象征……）。也常见搭配：symbolic meaning（象征意义）、symbolic gesture/action（象征性姿态/行动）。","在文学与艺术中，symbolic 常指“意象/细节承载更深层主题”：例如一扇门象征机会与选择、冬天象征衰败或沉寂等。理解时可以问自己：这个事物在故事里反复出现吗？是否对应人物情感或主题？"]}
{"word":"symbolical","summary":{"en":"Symbolical means “symbolic”—representing deeper ideas through symbols rather than literal meaning.","zh":"symbolical 意为“象征性的”，用符号或意象表达更深层含义，而非字面意义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using symbols or images to represent deeper ideas rather than literal meaning; symbolic.","zh":"象征性的；用符号或意象表达更深层含义（而非字面意思）的。"},"examples":[{"en":"In the story, the river is symbolical of change and time.","zh":"在故事里，这条河象征着变化与时间。"},{"en":"The painting’s colors are symbolical, not realistic.","zh":"这幅画的颜色是象征性的，并不写实。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or expressed through a system of symbols (often in art, literature, or religion).","zh":"与符号体系有关的；通过符号体系表达的（常见于艺术、文学或宗教语境）。"},"examples":[{"en":"Many religious rituals have a symbolical meaning for believers.","zh":"许多宗教仪式对信徒来说都有象征意义。"},{"en":"The author uses symbolical characters to represent social groups.","zh":"作者用象征性人物来代表不同的社会群体。"}]}],"synonyms":["symbolic","representative","emblematic","allegorical"],"phonetic":"/sɪmˈbɑlɪkəl/","extraExplanation":["“symbolical”和“symbolic”意思几乎一样，但现代英语里更常用“symbolic”。在写作中用“symbolical”会显得稍微正式或偏文学。","常见搭配：be symbolical of（象征……）、symbolical meaning（象征意义）、symbolical representation（象征性呈现）。","文学里常见的象征意象：路/旅程（人生）、光/黑暗（希望/无知）、季节（成长与衰老）等。"]}
{"word":"symbolically","summary":{"en":"“Symbolically” means ‘in a way that uses symbols’ or ‘as a meaningful gesture rather than a practical action.’","zh":"“symbolically”表示“以象征方式（用意象表达含义）”或“象征性地（重在表态/仪式而非实际效果）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a symbolic way—using symbols or images to represent ideas rather than stating them directly.","zh":"以象征的方式——用符号或意象来代表某种观念，而不是直接说明。"},"examples":[{"en":"In the poem, the river flows symbolically as a sign of time passing.","zh":"在这首诗里，河流以象征的方式流动，表示时间的流逝。"},{"en":"She cut her hair symbolically to mark a new beginning.","zh":"她象征性地剪短头发，表示一个新的开始。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is mainly for meaning or appearance, not for practical effect; as a gesture.","zh":"象征性地（多指重在意义或姿态，而非实际作用）；作为一种表示。"},"examples":[{"en":"The company paid him one dollar symbolically to make the agreement official.","zh":"公司象征性地付给他一美元，用来使协议在形式上生效。"},{"en":"They held a symbolic ceremony, and the key was handed over symbolically.","zh":"他们举行了象征性的仪式，并象征性地交接了钥匙。"}]}],"synonyms":["figuratively","emblematically","representatively","ritually","ceremonially"],"phonetic":"/sɪmˈbɑlɪkli/","extraExplanation":["“symbolically”常出现在文学、艺术与文化解读里，强调“意象背后的含义”。例如鸽子象征和平、白色象征纯洁等；当你说某个动作是symbolically做的，也可能表示“重在表态/仪式感”，不一定带来实际改变。","常见搭配：symbolically represent（象征性地代表）、symbolically important/significant（具有象征意义的）、act/gesture symbolically（以象征方式行动/表达）。"]}
{"word":"symbolise","summary":{"en":"Symbolise means to represent or stand for something, often an abstract idea, using a symbol or meaningful image.","zh":"symbolise 意为“象征、代表”，指用符号或有意义的形象来表达某种（常为抽象的）含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to represent something using a symbol; to stand for or mean something deeper than the literal object","zh":"用符号来表示；象征；代表（更深层的意义）"},"examples":[{"en":"In many cultures, a white dove can symbolise peace.","zh":"在许多文化中，白鸽可以象征和平。"},{"en":"The crown symbolises the power of the monarchy.","zh":"王冠象征君主制的权力。"},{"en":"For her, the old key symbolised freedom.","zh":"对她来说，那把旧钥匙象征着自由。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use symbols in art, writing, or design to communicate ideas or feelings","zh":"（在艺术、写作或设计中）运用象征手法来表达思想或情感"},"examples":[{"en":"The poet symbolised grief through images of winter and empty fields.","zh":"诗人用冬天和空旷的田野来象征悲伤。"},{"en":"In the film, the repeated water scenes symbolise change.","zh":"在电影里，反复出现的水的场景象征变化。"}]}],"synonyms":["represent","stand for","signify","embody"],"phonetic":"/ˈsɪm.bəˌlaɪz/","extraExplanation":["“symbolise”是英式拼写；美式英语更常写作“symbolize”。两者意思与用法相同。","词根来自“symbol”（符号/象征）；动词形式表示“让某物成为象征/用来代表某种含义”。"]}
{"word":"symbolises","summary":{"en":"“Symbolises” means “represents or stands for something (often with a deeper meaning).”","zh":"“symbolises”表示“象征、代表（常含更深层意义）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to represent something using a symbol; to stand for or mean something in a deeper or indirect way","zh":"用象征来代表某事；象征或意味着（更深层或间接的含义）"},"examples":[{"en":"In many cultures, a dove symbolises peace.","zh":"在许多文化中，鸽子象征和平。"},{"en":"The broken chain symbolises freedom from oppression.","zh":"断开的锁链象征摆脱压迫的自由。"},{"en":"For her, the old photo symbolises a happier time.","zh":"对她来说，那张旧照片象征一段更快乐的时光。"}]},{"partOfSpeech":"vt.","definition":{"en":"to be a sign of something; to show that something exists or is happening","zh":"作为……的迹象；表明某事存在或正在发生"},"examples":[{"en":"Their silence symbolises a lack of trust.","zh":"他们的沉默表明缺乏信任。"},{"en":"A falling temperature often symbolises the coming of winter.","zh":"气温下降常常预示冬天将至。"}]}],"synonyms":["represents","stands for","signifies","embodies","denotes"],"phonetic":"ˈsɪmbəˌlaɪzɪz","extraExplanation":["“symbolises”是英式拼写（-ise）。美式英语更常写作“symbolizes”（-ize），意思相同。它是动词“symbolise/symbolize”的第三人称单数形式：He/She/It symbolises..."]}
{"word":"Symbolism","summary":{"en":"Symbolism means using symbols to represent deeper ideas; it can also mean a work’s symbolic system, or the late-1800s art/literature movement called Symbolism.","zh":"symbolism 指用象征来表达更深层含义；也可指作品/文化中的象征体系，或19世纪末的“象征主义”艺术文学流派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The use of symbols (objects, colors, actions, or images) to represent deeper ideas or feelings, especially in literature and art.","zh":"（尤指文学与艺术中的）象征手法：用符号（物体、颜色、动作、意象等）来代表更深层的思想或情感。"},"examples":[{"en":"In the novel, the storm is symbolism for the character’s inner conflict.","zh":"在小说里，暴风雨象征着人物内心的冲突。"},{"en":"Many people see the dove as symbolism of peace.","zh":"许多人把鸽子看作和平的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular system or style of using symbols; symbolic meaning in a work, culture, or religion.","zh":"（特定作品/文化/宗教中的）象征体系；象征意义的整体风格与运用。"},"examples":[{"en":"The film’s religious symbolism is easy to miss if you don’t know the story.","zh":"如果不了解背景，这部电影的宗教象征意味很容易被忽略。"},{"en":"Traditional Chinese symbolism often links the dragon with power and good fortune.","zh":"中国传统象征体系中，龙常与权力和好运相连。"}]},{"partOfSpeech":"n.","definition":{"en":"Symbolism (capital S): a late-19th-century European artistic and literary movement that used suggestion and symbols rather than direct description.","zh":"（首字母大写）象征主义：19世纪末欧洲的文学与艺术流派，强调暗示与象征，而非直接描写。"},"examples":[{"en":"Symbolism influenced many modern poets through its focus on mood and imagery.","zh":"象征主义因强调氛围与意象而影响了许多现代诗人。"},{"en":"Baudelaire is often discussed as a key figure connected to Symbolism.","zh":"波德莱尔常被视为与象征主义密切相关的重要人物。"}]}],"synonyms":["symbolic meaning","imagery","allegory (related)","metaphor (related)"],"phonetic":"/ˈsɪm.bə.lɪ.zəm/","extraExplanation":["在文学分析里，symbol（象征物）和 symbolism（象征手法/象征体系）不同：symbol 是“是什么”（比如玫瑰），symbolism 是“怎么用、用来表达什么”（用玫瑰表达爱情、短暂、美等）。","学习时可留意：象征通常不是“固定答案”。同一意象在不同文化或不同作品里可能含义不同，最可靠的线索来自文本语境（人物经历、反复出现的意象、作者的提示）。","常见搭配：heavy symbolism（象征意味很重）、political symbolism（政治象征）、use of symbolism（象征手法的运用）。"]}
{"word":"symbolism","summary":{"en":"Symbolism means using a symbol to express a deeper meaning; it can also refer to the Symbolist art/literature movement.","zh":"symbolism 指用象征来表达深层含义；也可指“象征主义”艺术/文学流派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The use of symbols (objects, colors, actions, or images) to represent deeper ideas or feelings, especially in literature, art, and film.","zh":"象征主义；象征手法：用“符号”（物体、颜色、动作、意象等）来表达更深层的思想或情感，常见于文学、艺术与电影。"},"examples":[{"en":"In the novel, the broken watch is symbolism for lost time and regret.","zh":"在小说里，那块坏掉的手表象征着失去的时间与后悔。"},{"en":"The director uses light and shadow as symbolism to show hope versus fear.","zh":"导演用光与影的象征手法来表现希望与恐惧的对立。"},{"en":"Cherry blossoms often carry symbolism of beauty and short-lived life.","zh":"樱花常被用来象征美丽与生命的短暂。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or movement in art and literature (especially late 19th century) that suggests meaning indirectly through symbols and mood rather than direct description.","zh":"象征主义（艺术与文学流派）：尤其指19世纪末的象征主义运动，强调通过象征与氛围暗示意义，而非直接描写。"},"examples":[{"en":"French Symbolism influenced many modern poets.","zh":"法国象征主义影响了许多现代诗人。"},{"en":"The poem’s imagery and musical language reflect Symbolism.","zh":"这首诗的意象与音乐性语言体现了象征主义风格。"}]}],"synonyms":["symbolic meaning","imagery (in context)","allegory (related but not the same)","metaphor (related)","Symbolism (movement)"],"phonetic":"/ˈsɪm.bəˌlɪ.zəm/","extraExplanation":["在阅读文学作品时，“symbolism”通常回答的是：作者让某个具体事物“代表”什么抽象概念。例如“dove（鸽子）→ peace（和平）”、“storm（暴风雨）→ inner conflict（内心冲突）”。需要注意：象征并不总是固定公式，具体含义常取决于作品语境与文化背景。","区分：symbol（符号/象征物）是“东西本身”；symbolism（象征手法/象征意义/象征主义）是“用它来表达更深含义的方式或效果”。在写作或分析时常用句型：“X is a symbol of Y.” / “X symbolizes Y.” / “The symbolism of X suggests…”","作为文学史术语的“Symbolism（象征主义）”常与现实主义、自然主义等形成对比：它更重视主观感受、氛围与暗示。"]}
{"word":"symbolization","summary":{"en":"Symbolization means the process of representing something with symbols, especially in math, logic, art, or literature.","zh":"Symbolization 指“符号化/象征化”的过程，即用符号来代表事物，常用于数学、逻辑、艺术与文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of representing something with a symbol (such as a sign, mark, or image).","zh":"用符号（如标志、记号、图像）来代表某事物的行为或过程；符号化。"},"examples":[{"en":"In math, symbolization helps us write complex ideas in a short form.","zh":"在数学中，符号化帮助我们用简短的形式表达复杂的思想。"},{"en":"The poem’s symbolization of winter suggests loneliness and silence.","zh":"这首诗把“冬天”符号化，用来暗示孤独与寂静。"}]},{"partOfSpeech":"n.","definition":{"en":"the use of symbolic meaning in art, language, or literature; turning something into a symbol of an idea or feeling.","zh":"在艺术、语言或文学中运用象征意义；把某物当作观念或情感的象征来使用。"},"examples":[{"en":"The director relies on visual symbolization, like shadows and mirrors, to show fear.","zh":"导演依靠视觉象征（如影子和镜子）来表现恐惧。"},{"en":"Different cultures may interpret the same symbolization in different ways.","zh":"不同文化可能会以不同方式解读同一种象征表达。"}]}],"synonyms":["representation","symbolic representation","encoding","symbolizing"],"phonetic":"/ˌsɪmbələˈzeɪʃən/","extraExplanation":["“symbolization”常见于学术语境（语言学、心理学、文学批评、数学与逻辑）。日常英语里更常用“symbolism（象征主义/象征手法）”或动词“symbolize（象征）”。","在文学分析中，symbolization强调“把某事物处理成象征”的过程；而symbolism更偏向“作品里象征系统/象征手法”的总体风格与效果。"]}
{"word":"symbolize","summary":{"en":"Symbolize means to represent or stand for an idea or meaning, often in culture, art, or literature.","zh":"Symbolize 指“象征、代表”，用某个符号或事物来表达更深层的意义，常见于文化、艺术与文学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to represent something (an idea, quality, or event) by using a symbol, image, object, or action","zh":"用符号、图像、物品或行为来代表（某个想法、特质或事件）"},"examples":[{"en":"In many cultures, a dove symbolizes peace.","zh":"在许多文化中，鸽子象征和平。"},{"en":"The broken chain symbolized freedom after years of control.","zh":"断裂的锁链象征着在多年控制之后获得的自由。"}]},{"partOfSpeech":"vt.","definition":{"en":"to be a clear sign of something; to stand for something in a broader sense","zh":"成为某事的明显标志；在更广义上代表某事"},"examples":[{"en":"Her promotion symbolized a change in the company’s attitude toward young leaders.","zh":"她的晋升象征着公司对年轻领导者态度的改变。"}]}],"synonyms":["represent","stand for","signify","embody"],"phonetic":"/ˈsɪm.bəˌlaɪz/","extraExplanation":["“symbolize”常用于文化、文学与艺术分析中，强调“象征意义”而不只是“指代”。例如文学里“雨”常象征忧伤或净化，但具体含义会因作品与语境而变化。","常见搭配：symbolize peace/hope/love；symbolize a new beginning；A symbolizes B（A象征B）。注意它通常是及物动词，后面直接接宾语。"]}
{"word":"symbolized","summary":{"en":"“Symbolized” means “represented as a symbol” or is the past form of “symbolize,” meaning “stood for an idea.”","zh":"“symbolized”表示“用符号表示/被象征化”，也可作“symbolize”的过去式，意为“象征、代表某种含义”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Represented something using a symbol; shown as a sign, image, or letter that stands for an idea.","zh":"用符号来表示；用标志、图像或字母来代表某种概念。"},"examples":[{"en":"In the chart, each country was symbolized by a different color.","zh":"在图表中，每个国家都用不同的颜色来表示。"},{"en":"The dove symbolized peace in many cultures.","zh":"在许多文化中，鸽子象征和平。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “symbolize”: to use something as a symbol of an idea or feeling.","zh":"“symbolize”的过去式/过去分词：用某物作为某种思想或情感的象征。"},"examples":[{"en":"The broken chain symbolized freedom from oppression.","zh":"断裂的锁链象征摆脱压迫的自由。"},{"en":"In the story, winter symbolized loneliness and hardship.","zh":"在故事里，冬天象征孤独与艰难。"}]}],"synonyms":["represented","stood for","signified","denoted","embodied"],"phonetic":"/ˈsɪm.bəˌlaɪzd/","extraExplanation":["“symbolized”常见于两种用法：①作动词（过去式/过去分词），强调“某物象征/代表了某含义”；②作形容词，表示“被符号化的/用符号表示的”（多见于学术或图表说明，如“data are symbolized by dots”）。","拼写上英式也常见“symbolised”，美式通常写“symbolized”。"]}
{"word":"symbolizes","summary":{"en":"“Symbolizes” means “represents or expresses a deeper meaning as a symbol.”","zh":"“symbolizes”表示“象征、代表（更深层含义）”，也可指“用符号来表示”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to represent or mean something as a symbol (often an idea, quality, or larger meaning)","zh":"象征；代表（某种观念、品质或更深层含义）"},"examples":[{"en":"In many cultures, a dove symbolizes peace.","zh":"在许多文化中，鸽子象征和平。"},{"en":"For her, the old key symbolizes freedom and a fresh start.","zh":"对她来说，那把旧钥匙象征自由与新的开始。"}]},{"partOfSpeech":"v.","definition":{"en":"to express something by using a symbol or symbols","zh":"用符号来表示（用象征手法表达）"},"examples":[{"en":"The red color on the map symbolizes danger areas.","zh":"地图上的红色表示危险区域。"},{"en":"In the logo, the circle symbolizes unity.","zh":"在这个标志里，圆形象征团结。"}]}],"synonyms":["represents","stands for","signifies","denotes","embodies"],"phonetic":"ˈsɪmbəˌlaɪzɪz","extraExplanation":["“symbolizes”是动词“symbolize”的第三人称单数（he/she/it symbolizes）。常见搭配：A symbolizes B（A象征B）。","与“stand for”很像：两者都可表示“代表/象征”。“symbolize”更强调“象征意义、联想与文化含义”，而“stand for”常用于缩写、标志或明确对应关系（如“USA stands for…”）。"]}
{"word":"symbolizing","summary":{"en":"“Symbolizing” means representing something (an idea or feeling) through a symbol, especially in literature, art, or culture.","zh":"“symbolizing”表示“象征、代表”，指用某个符号或形象来表达某种思想或情感，常见于文学、艺术与文化语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"representing an idea, feeling, or quality through a symbol; standing for something else (often in art, literature, or culture).","zh":"用象征来代表某种思想、情感或特质；象征、代表（常用于艺术、文学或文化语境）。"},"examples":[{"en":"In the novel, the white whale is symbolizing obsession and the unknown.","zh":"在这部小说里，白鲸象征着执念与未知。"},{"en":"The dove is symbolizing peace in many cultures.","zh":"在许多文化中，鸽子象征和平。"}]},{"partOfSpeech":"v.","definition":{"en":"using symbols or symbolic meaning in order to express something indirectly.","zh":"用象征手法来间接表达某种含义。"},"examples":[{"en":"The poet is symbolizing grief through images of winter and fading light.","zh":"诗人用冬天与渐暗的光来象征悲伤。"}]}],"synonyms":["representing","signifying","standing for","embodying"],"phonetic":"/ˈsɪm.bəˌlaɪ.zɪŋ/","extraExplanation":["“symbolizing”是动词“symbolize”的现在分词/动名词形式，常见于进行时（is/are symbolizing）或作补语、定语等：例如“a flag symbolizing freedom（象征自由的旗帜）”。","在文学分析中，英语里常用句型是“A symbolizes B”（A象征B）。如果是被动结构，也常见“be symbolized by”（由……象征）。"]}
{"word":"symbology","summary":{"en":"Symbology means a system or study of symbols and what they represent.","zh":"Symbology 指符号的体系或对符号及其含义的研究与运用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study, system, or use of symbols, especially to represent ideas in art, religion, literature, maps, or science.","zh":"符号学；符号体系；象征符号的研究或运用（尤指在艺术、宗教、文学、地图或科学中用符号表达意义）。"},"examples":[{"en":"The symbology of the national flag includes colors that represent freedom and unity.","zh":"国旗的象征体系包括代表自由与团结的颜色。"},{"en":"In the novel, the river’s symbology suggests both danger and rebirth.","zh":"在这部小说中，河流的象征意义既暗示危险，也暗示重生。"},{"en":"Cartographers use a standard symbology so everyone can read maps the same way.","zh":"制图人员使用统一的符号体系，让所有人都能用同一种方式读懂地图。"}]}],"synonyms":["symbolism","iconography","semiotics","sign system"],"phonetic":"/ˌsɪmˈbɑːlədʒi/","extraExplanation":["“symbology”常与“symbolism”混用，但语感上略有差别：\n- “symbology”更偏“符号系统/符号用法/符号规则”（例如地图符号、宗教图像、标志系统）。\n- “symbolism”更常指“象征意义/象征手法”（尤其在文学、艺术分析中更常见）。\n例如：map symbology（地图符号体系）很自然；the symbolism of the rose（玫瑰的象征意义）更常见。","词源提示：来自“symbol（符号）+ -logy（学科/研究）”，因此常带“研究/体系化”的意味。"]}
{"word":"symbolon","summary":{"en":"Symbolon is an ancient Greek token—often split in two—used for recognition or as proof of an agreement; more broadly, it can mean a symbolic sign.","zh":"Symbolon 指古希腊用于相认或证明约定的“信物/凭证”（常折成两半），也可引申为象征性的标记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a token (often broken in two) used as a sign of identity, agreement, or recognition when the matching pieces were put together.","zh":"（古希腊）一种“信物/凭证”（常被折成两半），用来表示身份、约定或彼此相认；把两块拼合即可验证。"},"examples":[{"en":"In the story, two strangers recognize each other by fitting their symbolon together.","zh":"在故事里，两位陌生人把各自的 symbolon 拼在一起，从而相认。"},{"en":"The host kept one half of the symbolon as proof of the guest-friendship agreement.","zh":"主人保存 symbolon 的一半，作为宾主友谊契约的证明。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a sign or symbol that represents something else (an early sense connected to the modern word “symbol”).","zh":"（引申义）象征物；用来代表其他事物的标记（与现代英语 symbol 的意义相关）。"},"examples":[{"en":"The author uses the ring as a symbolon of loyalty.","zh":"作者把戒指作为忠诚的象征（symbolon）。"}]}],"synonyms":["token","tally","emblem","sign","symbol"],"phonetic":"/ˈsɪm.bə.lɑn/","extraExplanation":["symbolon 来自古希腊语 σύμβολον（sýmbolon），本义与“拼合、对上”有关：把一件物品分成两半，各持一半，日后用来核对身份或确认约定。这种“可拼合的信物”也影响了后来的“symbol（符号/象征）”概念。","在古希腊文化中，它常与“客友关系/款待之谊”（guest-friendship）相关：两家族或两个人建立长期互助的社会关系，会留下可传承的凭证。"]}
{"word":"symbols","summary":{"en":"“Symbols” is the plural of “symbol.” It can mean (1) things that represent ideas (like a dove for peace) or (2) written characters/signs used in systems like math, writing, or computing.","zh":"“symbols”是“symbol”的复数。可指（1）象征某种观念/意义的事物（如鸽子象征和平），也可指（2）在数学、书写或计算机中使用的符号/字符。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sign, mark, picture, or object that represents an idea, feeling, group, or something else (often beyond its literal meaning).","zh":"象征（符号）；用来代表某种思想、情感、群体或其他事物的标志/图像/物体（常超出字面意义）。"},"examples":[{"en":"In many cultures, a dove is a symbol of peace.","zh":"在许多文化中，鸽子是和平的象征。"},{"en":"The company changed its symbol to look more modern.","zh":"这家公司更换了标志，让它看起来更现代。"},{"en":"In the novel, the river becomes a symbol of freedom.","zh":"在小说里，这条河成了自由的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A character used in writing, math, music, or science to stand for something (for example, letters, punctuation, or operators like +).","zh":"符号（字符）；在书写、数学、音乐或科学中用来表示某物的字符（如字母、标点或“+”等运算符）。"},"examples":[{"en":"What does the symbol “@” mean in an email address?","zh":"电子邮箱地址里的“@”符号是什么意思？"},{"en":"Use the correct symbol for degrees: 30°C.","zh":"要用正确的温度符号：30°C。"},{"en":"In algebra, x is a symbol for an unknown number.","zh":"在代数里，x 是表示未知数的符号。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing and programming, a non-alphanumeric character used for special purposes (such as #, $, or _), or a named unit such as a function/variable name depending on context.","zh":"（计算机/编程）特殊符号；或在某些语境中指“符号名/标识符”的单位（如变量名、函数名等，视上下文而定）。"},"examples":[{"en":"Don’t use spaces—use an underscore symbol instead.","zh":"不要用空格——用下划线符号代替。"},{"en":"The password must include letters, numbers, and symbols.","zh":"密码必须包含字母、数字和符号。"},{"en":"The debugger couldn’t find the symbol because the name was misspelled.","zh":"调试器找不到该符号，因为名字拼错了。"}]}],"synonyms":["signs","icons","emblems","marks","characters"],"phonetic":"/ˈsɪmbəlz/","extraExplanation":["“symbol”既可指“象征意义”（文学、文化里常见），也可指“具体符号字符”（数学、标点、电脑密码里常见）。学习时可用语境区分：谈意义→symbol of…；谈字符→the symbol for… / a symbol like +.","词形：symbol（单数）；symbols（复数）。常见搭配：a symbol of hope（希望的象征）；national symbols（国家象征）；the symbol for percent (%)（百分号的符号）。","文学用法：小说或诗歌里常说“X becomes a symbol of Y”（X 成为 Y 的象征），用来提示读者“背后含义”而不只看表面。"]}
{"word":"symbolum","summary":{"en":"Symbolum is a rare word meaning a Christian creed, and historically it can also mean an identifying token or sign.","zh":"Symbolum 是一个较少见的词，主要指基督教“信经”；在历史语境中也可指用于识别身份的“凭证/标记”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a creed or formal statement of Christian belief (especially the Apostles’ Creed or Nicene Creed).","zh":"（基督教）信经；正式的信仰宣言（尤指《使徒信经》或《尼西亚信经》）。"},"examples":[{"en":"In early church history, the Nicene Symbolum helped unify doctrine.","zh":"在早期教会历史中，《尼西亚信经》（Symbolum）有助于统一教义。"},{"en":"The professor asked us to compare different symbola used in worship.","zh":"教授让我们比较礼拜中使用的不同信经（symbola）。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, rare) a token or sign used to identify someone or prove membership.","zh":"（历史用法，较少见）用于识别身份或证明成员资格的凭证；暗号；标记。"},"examples":[{"en":"They carried a small symbolum to show they belonged to the group.","zh":"他们携带一个小凭证（symbolum）来证明自己属于该团体。"},{"en":"In old texts, a symbolum could function like a password or badge.","zh":"在旧文献中，symbolum 有时起到类似口令或徽章的作用。"}]}],"synonyms":["creed","confession of faith","article of faith","token","sign"],"phonetic":"/ˈsɪmbələm/","extraExplanation":["“symbolum”源自拉丁语，来自希腊语 *symbolon*，本义与“凭证、对号之物”有关；后来在基督教传统中常专指“信经”。","在英语中它非常少见，多出现在神学、教会史或引用拉丁文/德语（Symbolum）语境里；日常英语通常说 *creed* 或直接说 *the Apostles’ Creed / the Nicene Creed*。"]}
{"word":"symmertrical","summary":{"en":"Symmetrical means balanced and matching on both sides (showing symmetry).","zh":"Symmetrical 指“对称的、均衡的”，两侧在形状或结构上相互对应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same shape, size, or pattern on both sides of a central line or point; evenly balanced.","zh":"对称的；（以中心线或中心点为界）两侧形状、大小或结构相同的；均衡的。"},"examples":[{"en":"The butterfly’s wings are almost perfectly symmetrical.","zh":"这只蝴蝶的翅膀几乎完全对称。"},{"en":"Try to keep your posture symmetrical when you lift heavy boxes.","zh":"搬重箱子时尽量保持身体姿势对称、均衡。"},{"en":"The room looks calmer with a symmetrical arrangement of chairs and tables.","zh":"把椅子和桌子对称摆放会让房间看起来更安静协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"In math or science, unchanged when something is rotated, reflected, or shifted in a certain way (showing symmetry).","zh":"（数学/科学）具有对称性；在某种旋转、镜像或平移下保持不变的。"},"examples":[{"en":"A circle is symmetrical around its center.","zh":"圆以圆心为中心具有对称性。"},{"en":"The molecule is symmetrical, which affects how it reacts.","zh":"该分子是对称的，这会影响它的反应方式。"}]}],"synonyms":["balanced","even","proportionate","mirror-image","harmonious"],"phonetic":"/səˈmɛtrɪkəl/","extraExplanation":["你输入的“symmertrical”更常见的正确拼写是 **symmetrical**（注意：只有一个 m，常见拼写是 sym-me-tri-cal）。","词源小提示：symmetrical 来自 Greek/Latin 词根 **sym-**（一起）+ **metron**（测量），核心意思是“（两边）量起来一样”。","相关词：**symmetry**（n. 对称；对称性）；反义词：**asymmetrical**（adj. 不对称的）。日常表达里也常说 **a symmetrical design/layout**（对称的设计/布局）。"]}
{"word":"symmetallism","summary":{"en":"Symmetallism is a (rare) term for bimetallism: a money system using two metals, usually gold and silver, as legal tender.","zh":"Symmetallism 是一个较少见的词，指“双金属本位制（bimetallism）”：以两种金属（多为金银）作为法定货币的制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A monetary system in which two metals (usually gold and silver) are used as legal tender, often with an official exchange ratio between them; another term for bimetallism.","zh":"一种以两种金属（通常为黄金和白银）作为法定货币的货币制度，常规定两者的官方兑换比率；也可作“双本位制（bimetallism）”的别称。"},"examples":[{"en":"Some politicians argued for symmetallism to increase the money supply by using both gold and silver.","zh":"一些政治人物主张实行symmetallism（双金属本位制），以通过同时使用金银来扩大货币供应。"},{"en":"Under symmetallism, the government may set a fixed ratio between gold and silver coins.","zh":"在symmetallism制度下，政府可能会规定金币与银币之间的固定比价。"}]}],"synonyms":["bimetallism","double standard","two-metal standard"],"phonetic":"/ˌsɪməˈtælɪzəm/","extraExplanation":["这个词多见于19世纪末至20世纪初的货币制度讨论，尤其与“金本位 vs. 金银复本位”的争论有关。由于市场价格会波动，若官方比价与市价不一致，容易出现“劣币驱逐良币”（人们把更值钱的金属囤积或熔化）的现象。","在现代英语中更常用的说法是 bimetallism；symmetallism 相对少见，常出现在历史或经济学文献里。"]}
{"word":"symmetria","summary":{"en":"“Symmetria” means symmetry—balanced, proportionate arrangement—most often seen in classical (Greek/Latin) contexts; modern English usually uses “symmetry.”","zh":"“symmetria”意为“对称/匀称”，多见于古典（希腊/拉丁）语境；现代英语一般用“symmetry”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"symmetry; a balanced and proportional arrangement of parts (often used in Latin/Greek contexts or as a variant form of “symmetry”).","zh":"对称；各部分均衡、成比例的排列（常见于拉丁/希腊语语境中，或作为“symmetry”的变体形式）。"},"examples":[{"en":"The architect admired the symmetria of the building’s façade.","zh":"这位建筑师欣赏这座建筑立面的对称之美。"},{"en":"In biology, symmetria can describe how an organism’s body parts are arranged evenly.","zh":"在生物学中，symmetria 可以描述生物体身体结构如何均匀排列。"}]}],"synonyms":["symmetry","balance","proportion","harmony"],"phonetic":"/sɪˈmiːtriə/","extraExplanation":["“Symmetria”源自希腊语 συμμετρία（symmetria），与“共同/一起（syn-/sym-)”和“尺度/测量（metron）”有关，原意偏向“有共同的尺度、比例协调”，后来发展为我们熟悉的“对称/匀称”。","在现代英语里最常用的形式是“symmetry”。“symmetria”更多出现在古典学、艺术史、哲学文本的引用里，或作为较少见的拼写形式。若你的目标是日常英语写作，通常建议用“symmetry”。"]}
{"word":"symmetric","summary":{"en":"Symmetric describes something that has matching sides (mirror-like) or is balanced/equal in structure or arrangement.","zh":"symmetric 指“对称的”（像镜像一样两边相同），也可指“均衡/对等的”（结构或安排上相互匹配）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two sides or parts that are the same size and shape, like a mirror image across a center line or point.","zh":"（形状或结构）对称的；两边（或两部分）大小形状相同，像沿中线或中心点镜像一样。"},"examples":[{"en":"A butterfly’s wings are roughly symmetric.","zh":"蝴蝶的翅膀大致是对称的。"},{"en":"Fold the paper in half to check if the design is symmetric.","zh":"把纸对折，看看这个图案是否对称。"}]},{"partOfSpeech":"adj.","definition":{"en":"Balanced and evenly matched in arrangement, importance, or numbers (not necessarily perfectly mirror-image).","zh":"（安排、重要性或数量上）均衡的；对等的（不一定是严格的镜像对称）。"},"examples":[{"en":"They tried to create a symmetric schedule, with equal time for work and rest.","zh":"他们试图制定一个均衡的日程，让工作和休息时间相等。"},{"en":"The agreement is symmetric: both sides have the same responsibilities.","zh":"这份协议是对等的：双方承担相同的责任。"}]}],"synonyms":["symmetrical","balanced","even","mirror-image"],"phonetic":"/səˈmɛtrɪk/","extraExplanation":["“symmetric”常见于数学、科学与设计领域，对应名词是“symmetry（对称性）”。日常表达里也常用来形容“均衡、对等”。","易混词：\n- symmetric（对称的）：强调“相同/镜像/均衡”。\n- asymmetrical（不对称的）：两边不一致。\n- symmetrical 也是常见拼写与用法，含义与 symmetric 基本相同，只是形式更长，英美都能用。"]}
{"word":"symmetrical","summary":{"en":"Symmetrical means “having matching sides” or “well-proportioned and evenly balanced.”","zh":"symmetrical 表示“对称的”或“匀称、比例协调的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same shape, size, or arrangement on both sides (balanced around a center line or point).","zh":"对称的；两侧在形状、大小或排列上相同（围绕中线或中心点保持平衡）。"},"examples":[{"en":"The butterfly’s wings are nearly symmetrical.","zh":"蝴蝶的翅膀几乎是对称的。"},{"en":"The building has a symmetrical façade with matching windows on each side.","zh":"这栋建筑的正立面很对称，两边的窗户相互对应。"}]},{"partOfSpeech":"adj.","definition":{"en":"Well-balanced or evenly developed; showing a pleasing proportion.","zh":"匀称的；比例协调、发展均衡的（常指外形或结构看起来舒服）。"},"examples":[{"en":"Her face is symmetrical, with evenly spaced features.","zh":"她的脸很匀称，五官分布很均衡。"},{"en":"Designers often aim for a symmetrical layout to create a calm, orderly feeling.","zh":"设计师常用对称布局来营造平静、有秩序的感觉。"}]}],"synonyms":["balanced","even","well-proportioned","harmonious"],"phonetic":"/sɪˈmɛtrɪkəl/","extraExplanation":["词源提示：symmetrical 来自 Greek（希腊语）symmetria，意思是“共同的测量/比例一致”，所以它既可以指“几何上的对称”，也常引申为“整体均衡、比例协调”。","用法对比：symmetrical（对称、匀称）常强调“左右/两边对应”；balanced（平衡）更强调“整体不偏不倚”，不一定要求两边完全一样。"]}
{"word":"symmetrically","summary":{"en":"Symmetrically means ‘in a balanced, mirrored way,’ either physically (shape/layout) or more abstractly (equal treatment of two sides).","zh":"symmetrically 表示“以对称、均衡的方式”，既可指形状/布局上的对称，也可指对双方（两类情况）的同等对应处理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is the same on both sides; evenly balanced or mirrored.","zh":"以对称的方式；两侧（或各部分）均衡、镜像地。"},"examples":[{"en":"The windows are placed symmetrically on either side of the door.","zh":"窗户对称地安装在门的两侧。"},{"en":"She arranged the books symmetrically on the shelf to make it look neat.","zh":"她把书对称地摆在书架上，让它看起来整齐。"},{"en":"The butterfly’s wings spread symmetrically.","zh":"蝴蝶的翅膀对称地展开。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a corresponding or equal way between two related parts, groups, or situations.","zh":"（在两方或两类相关事物之间）以对应、相等的方式。"},"examples":[{"en":"The policy should apply symmetrically to both employees and managers.","zh":"这项政策应同等适用于员工和经理。"},{"en":"If you raise prices, you should also raise wages symmetrically.","zh":"如果你提高价格，也应相应地提高工资。"}]}],"synonyms":["evenly","uniformly","in a balanced way","in a mirrored way"],"phonetic":"/sɪˈmɛtrɪkli/","extraExplanation":["“symmetrically”常用于艺术、建筑与自然界（如脸部、翅膀、花瓣）的描述，强调“看起来平衡、左右一致”。在更抽象的语境（经济、政策、规则）中，它强调“对两方一视同仁、条件一致”。","常见搭配：symmetrically arranged（对称地排列）、symmetrically placed（对称地放置）、symmetrically distributed（对称分布）、apply symmetrically（对双方同等适用）。"]}
{"word":"symmetrize","summary":{"en":"Symmetrize means to make something symmetric; in math/physics, it means to transform an expression or matrix into a symmetric form.","zh":"symmetrize 指“使……对称”；在数学/物理中常指把表达式或矩阵改写/处理成对称形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something symmetric; to arrange or change it so both sides (or parts) match in shape, position, or pattern","zh":"使……对称；把……调整成两侧（或各部分）在形状、位置或图案上相互对应"},"examples":[{"en":"The designer symmetrized the logo so it looks balanced.","zh":"设计师把标志做成对称的，让它看起来更均衡。"},{"en":"She symmetrized the photo by cropping it equally on both sides.","zh":"她把照片两边等量裁切，使画面更对称。"}]},{"partOfSpeech":"vt.","definition":{"en":"(math/physics) to modify an expression, matrix, or operator so it becomes symmetric (often by averaging it with its transpose or by treating variables in a symmetric way)","zh":"（数学/物理）对称化；把表达式、矩阵或算子改写为对称形式（常见做法是与其转置取平均，或用对称方式处理变量）"},"examples":[{"en":"To reduce numerical error, we symmetrize the matrix before solving the system.","zh":"为减少数值误差，我们在求解方程组前先对矩阵进行对称化。"},{"en":"The paper symmetrizes the equation to make the proof simpler.","zh":"论文将方程对称化，以使证明更简洁。"}]}],"synonyms":["make symmetric","balance","even out","symmetrify","regularize"],"phonetic":"/ˈsɪməˌtraɪz/","extraExplanation":["“symmetrize”常见于学术写作，尤其是线性代数、量子物理、统计与数值计算中。一个常见做法是把矩阵A变为(A + Aᵀ)/2，使结果满足对称矩阵的性质，便于分析或计算。"]}
{"word":"symmetry","summary":{"en":"Symmetry means balanced, matching parts—often a mirror-like shape—or a harmonious correspondence between related things.","zh":"Symmetry 指“对称/均衡”：常见为左右镜像的形状对称，也可指事物之间结构或意义上的呼应与和谐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a balanced and matching arrangement of parts (in shape, size, or position), especially when one side mirrors the other","zh":"对称；（形状、大小或位置上）各部分均衡、相互对应的排列，尤指两侧镜像相同"},"examples":[{"en":"The butterfly’s wings show perfect symmetry.","zh":"蝴蝶的翅膀呈现出完美的对称。"},{"en":"Architects often use symmetry to make a building look calm and stable.","zh":"建筑师常用对称让建筑看起来平静而稳重。"}]},{"partOfSpeech":"n.","definition":{"en":"a pleasing balance or harmony between related things (such as ideas, actions, or parts of a story)","zh":"（事物之间的）匀称与和谐；（如观点、行为或叙事结构的）对照与呼应"},"examples":[{"en":"There is a symmetry between the beginning and the ending of the novel.","zh":"这部小说的开头与结尾之间有一种对称式的呼应。"},{"en":"The two speeches had an interesting symmetry: both promised change but avoided details.","zh":"两次演讲有种有趣的对称：都承诺改变，却都回避细节。"}]}],"synonyms":["balance","harmony","proportion","regularity"],"phonetic":"/ˈsɪmətri/","extraExplanation":["词源提示：symmetry 来自希腊语 symmetria，原意是“共同的度量/比例”，所以它不仅指“左右镜像”，也常指“比例协调、结构呼应”的美感。","常见搭配：bilateral symmetry（两侧对称）、radial symmetry（辐射对称，如海星）、symmetry in nature（自然界的对称）、symmetry between A and B（A 与 B 之间的对称/对应）。","相关词：symmetric（adj. 对称的）、asymmetric（adj. 不对称的）。日常口语里也会说 “The design is very symmetrical.”"]}
{"word":"sympath","summary":{"en":"Sympathy means caring understanding for someone’s pain, and it can also mean support for someone’s ideas or cause.","zh":"Sympathy 指对他人痛苦的同情与理解，也可指对某种观点或事业的赞同与支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of caring about and understanding someone’s sadness, trouble, or pain","zh":"同情；怜悯；对他人痛苦或困难的理解与关怀"},"examples":[{"en":"I felt deep sympathy for her after the accident.","zh":"事故之后，我对她深感同情。"},{"en":"Please accept our sympathy for your loss.","zh":"请接受我们对你失去亲人的慰问。"},{"en":"He showed sympathy by listening without judging.","zh":"他不加评判地倾听，以此表达同情。"}]},{"partOfSpeech":"n.","definition":{"en":"agreement with someone’s ideas, goals, or situation; support","zh":"赞同；支持（对某种想法、目标或处境的认同）"},"examples":[{"en":"The plan gained sympathy from many voters.","zh":"这个计划获得了许多选民的支持。"},{"en":"She had sympathy for the workers’ demands.","zh":"她赞同工人的诉求。"}]}],"synonyms":["compassion","pity","understanding","support","solidarity"],"phonetic":"/ˈsɪmpəθi/","extraExplanation":["你输入的“sympath”通常不是一个完整的英语单词，更常见的是词根/词干形式，出现在 sympathy（同情）和 sympathize（同情；赞同）里。","词源上，sym- 表示“共同/一起”，-path- 与“感受、情感”有关（也见于 empathy 共情）。所以 sympathy 字面感觉像“与他人一起感受”。","常见搭配：feel sympathy for sb（同情某人）；express/offer sympathy（表达慰问）；have sympathy with sth（更英式：赞同/支持某事）。若想表达“我同情你”，更自然的说法是 I’m sorry you’re going through this. 或 I sympathize with you.（语气更正式）。"]}
{"word":"Sympatheia","summary":{"en":"Sympatheia is a philosophical term (especially Stoic) meaning the deep interconnectedness of all things; more rarely, it can mean sympathy or shared feeling.","zh":"Sympatheia 多用于哲学（尤指斯多葛学派），指万物深度相互关联的“共感/共通感应”；较少情况下也可指同情或共同感受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In philosophy, especially Stoicism) the idea that all parts of the universe are deeply interconnected and “feel with” one another, so events in one part can affect the whole.","zh":"（哲学用语，尤指斯多葛学派）“共感/共通感应”的观念：宇宙万物彼此深度相连，仿佛能“同感”，一处的变化会牵动整体。"},"examples":[{"en":"The Stoics used sympatheia to explain why the cosmos functions like one living system.","zh":"斯多葛学派用 sympatheia 来解释为何宇宙像一个有生命的整体在运作。"},{"en":"In his essay, he connects environmental ethics to sympatheia—the sense that humans and nature are inseparable.","zh":"在文章中，他把环境伦理与 sympatheia 联系起来——强调人类与自然不可分割。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; general sense) sympathy or shared feeling.","zh":"（罕见；一般义）同情；共情；共同的感受。"},"examples":[{"en":"She wrote about sympatheia as a quiet bond of shared sorrow.","zh":"她写到 sympatheia 是一种共享悲伤的静默纽带。"}]}],"synonyms":["interconnectedness","cosmic sympathy","sympathy","shared feeling"],"phonetic":"/ˌsɪm.pəˈθiː.ə/","extraExplanation":["Sympatheia 源自希腊语 sympatheia（syn- “共同” + patheia “感受/情感”），字面意思是“共同感受”。在斯多葛学派中，它不仅是人与人之间的同情，更是一种宇宙论：世界由同一理性（logos）贯通，万物之间存在“共振式”的联系。","在英语学术写作中，它常出现在古典哲学、宗教史与生态思想等语境里；日常英语更常用 sympathy（同情）或 empathy（共情）。"]}
{"word":"sympatheia","summary":{"en":"Sympatheia is a philosophical term meaning a natural, mutual connectedness among all things; rarely, it can mean sympathy.","zh":"sympatheia 常指哲学上的“万物相互感应/共感”的自然联系；较少情况下也可指“同情/共鸣”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially Stoicism) A natural connectedness or mutual “sympathy” among all parts of the universe, where things influence and respond to each other.","zh":"（哲学，尤指斯多葛学派）“共感／相互感应”：指宇宙万物之间存在一种自然的联系与共鸣，彼此影响、相互回应。"},"examples":[{"en":"The Stoics used sympatheia to explain why events in nature seem connected rather than random.","zh":"斯多葛学派用 sympatheia 来解释为什么自然界的事件看起来彼此相关，而不是随机发生。"},{"en":"In this view, sympatheia links human emotions to the wider order of the cosmos.","zh":"在这种观点中，sympatheia 把人的情感与更宏大的宇宙秩序联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Sympathy; a feeling of shared emotion or understanding.","zh":"（罕见）同情；共鸣；对他人情感的理解与感同身受。"},"examples":[{"en":"Her letter was written with genuine sympatheia for the families affected.","zh":"她的信带着真诚的 sympatheia，关怀那些受影响的家庭。"}]}],"synonyms":["interconnectedness","cosmic sympathy","affinity","sympathy (rare sense)"],"phonetic":"/ˌsɪm.pəˈθiː.ə/","extraExplanation":["sympatheia 源自古希腊语 sympatheia（syn- “共同” + pathos “感受/经历”）。在斯多葛学派中，它常与“logos（理性/宇宙理则）”等概念一起出现，用来说明世界是一个相互牵连的整体，因此“命运/因果”具有连贯性。","在现代英语里，这个词多见于哲学、古典学或宗教研究写作；日常表达通常用 sympathy（同情）或 interconnectedness（相互关联）。"]}
{"word":"sympathetic","summary":{"en":"Sympathetic mainly means kind and understanding toward someone’s pain, and it can also mean supportive of an idea or cause.","zh":"sympathetic 主要指对他人的痛苦表示同情与体谅；也可指对某观点或事业表示赞同与支持。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing understanding, kindness, and care for someone who is suffering or having a difficult time.","zh":"（对他人的痛苦或困难）表示同情、体谅、关心的。"},"examples":[{"en":"She was very sympathetic when I told her about my family problems.","zh":"我告诉她我的家庭问题时，她非常体谅并表示关心。"},{"en":"The nurse gave him a sympathetic look.","zh":"护士同情地看了他一眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Agreeing with and supporting a person, idea, or cause (often: “sympathetic to”).","zh":"（对某人/观点/事业）赞同并支持的（常用：sympathetic to）。"},"examples":[{"en":"Many students are sympathetic to the workers’ demands.","zh":"许多学生同情并支持工人的诉求。"},{"en":"He’s sympathetic to the idea, but he worries about the cost.","zh":"他赞同这个想法，但担心成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to shared feelings; emotionally responsive (a more formal/literary use).","zh":"（较正式/文学用法）情感上能共鸣的；能引起共感的。"},"examples":[{"en":"The novel creates a sympathetic bond between the reader and the main character.","zh":"这部小说在读者与主角之间建立起一种共情的联系。"}]}],"synonyms":["compassionate","understanding","kind","supportive","caring"],"phonetic":"/ˌsɪm.pəˈθɛtɪk/","extraExplanation":["常见易混：sympathetic（同情、体谅）≠ sympathetic system（交感神经系统，医学术语）。日常交流里说“a sympathetic person”通常指温柔体贴、会安慰人的人。","与 empathic/empathetic 的区别：sympathetic 更偏“为你难过/关心你”，empathetic 更偏“设身处地理解你在感受什么”。两者都可褒义，但语气侧重点不同。","固定搭配：be sympathetic to + 人/观点/事业（表示支持）；a sympathetic ear（愿意倾听并安慰的人/态度）。"]}
{"word":"sympathetically","summary":{"en":"“Sympathetically” means “in a kind, understanding way” or “in a supportive/agreeing way,” depending on context.","zh":"“sympathetically”表示“同情地、体谅地”，也可指“支持地、赞同地”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a kind, caring way that shows you understand someone’s feelings or situation.","zh":"同情地；体谅地（以关心、理解他人处境与感受的方式）。"},"examples":[{"en":"She listened sympathetically as he talked about losing his job.","zh":"他谈到失业时，她同情地倾听。"},{"en":"The teacher spoke sympathetically to the student who was upset.","zh":"老师体谅地对那位难过的学生说话。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a supportive way; showing approval or agreement with someone’s goals, ideas, or cause.","zh":"支持地；赞同地（对某人的观点、目标或事业表示支持）。"},"examples":[{"en":"Many readers responded sympathetically to her message about mental health.","zh":"许多读者对她关于心理健康的呼吁表示支持。"},{"en":"He looked sympathetically on the plan to help refugees.","zh":"他对帮助难民的计划表示赞同。"}]}],"synonyms":["kindly","compassionately","understandingly","supportively"],"phonetic":"/ˌsɪm.pəˈθɛt̬.ɪ.kli/","extraExplanation":["“sympathetically”常见两种含义：①对人的情绪/遭遇表示同情与理解；②对某个观点或立场“持同情/支持态度”。语境通常能区分：若后面接人和情绪，多是①；若接计划、政策、事业，多是②。","易混词：empathetically（共情地）更强调“设身处地感受对方的感受”；sympathetically更常表示“关心、同情并支持”，不一定真的“感同身受”。"]}
{"word":"sympathise","summary":{"en":"Sympathise means to feel compassion for someone or to support/agree with a person or cause.","zh":"sympathise 表示“同情、理解某人”，也可表示“赞同或支持某人/某项事业”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to feel sympathy for someone; to understand and share their feelings, especially sadness or trouble","zh":"同情；对某人的处境感同身受（尤指在困难或悲伤时）"},"examples":[{"en":"I really sympathise with you—losing a job is stressful.","zh":"我真的很同情你——失业很有压力。"},{"en":"She sympathised with his anxiety before the exam.","zh":"她理解并同情他考前的焦虑。"}]},{"partOfSpeech":"vi.","definition":{"en":"to agree with or support an idea, a group, or a cause (often used with “with”)","zh":"赞同；支持（某种观点、团体或事业，常与 with 搭配）"},"examples":[{"en":"Many people sympathise with the workers’ demands for safer conditions.","zh":"许多人支持工人关于更安全工作条件的诉求。"},{"en":"He doesn’t sympathise with their political views.","zh":"他不赞同他们的政治观点。"}]}],"synonyms":["sympathize","feel for","empathize (with)","understand","support","be in favor of"],"phonetic":"/ˈsɪmpəˌθaɪz/","extraExplanation":["“sympathise”是英式拼写；美式英语更常写作“sympathize”。两者意思与用法相同。","常见搭配：sympathise with sb（同情/理解某人；或赞同某人/某方立场）；sympathise with a cause（支持某项事业）。语境决定是“同情”还是“支持”。"]}
{"word":"sympathize","summary":{"en":"Sympathize means to feel compassion for someone’s suffering, or to support/agree with a cause or viewpoint.","zh":"sympathize 指“同情、表示关怀”，也可指“赞同/支持某个观点或事业”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to feel sorry for someone and share their sadness or trouble; to show compassion","zh":"同情；对某人的悲伤或困境感到难过并表示关怀"},"examples":[{"en":"I really sympathize with you—it must be stressful to lose your job.","zh":"我真的很同情你——失去工作一定很有压力。"},{"en":"She sympathized with the family after their loss.","zh":"在他们失去亲人后，她对那家人表示了同情。"}]},{"partOfSpeech":"vi.","definition":{"en":"to agree with or support an idea, goal, or cause, even if you cannot fully help","zh":"赞同；支持（某种观点、目标或事业），即使未必能实际参与或帮忙"},"examples":[{"en":"Many people sympathize with the protesters’ demands.","zh":"很多人赞同抗议者的诉求。"},{"en":"I sympathize with your point of view, but I still think the plan is risky.","zh":"我理解并赞同你的观点，但我仍然觉得这个计划有风险。"}]}],"synonyms":["feel for","commiserate","pity","understand","support"],"phonetic":"/ˈsɪmpəˌθaɪz/","extraExplanation":["常见搭配：sympathize with + 人/群体/观点（sympathize with you / sympathize with their situation / sympathize with the cause）。","注意区分：sympathy（同情）偏“为你难过”；empathy（共情）更强调“设身处地感受你的感受”。","语气与使用场景：sympathize 常用于表达关怀与支持，但不等于“解决问题”。例如 I sympathize, but... 往往表示“我理解你，但我不同意/我做不到”。"]}
{"word":"sympathized","summary":{"en":"“Sympathized” means you felt (or showed) sympathy or support, usually used with “with.”","zh":"“sympathized”表示“同情/理解（某人）”或“支持（某观点/事业）”，常与 with 搭配。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “sympathize”) Felt pity, concern, or understanding for someone’s bad situation; shared their feelings.","zh":"（sympathize 的过去式/过去分词）对某人的困境感到同情、关心或理解；与其共情（强调同情/理解）。"},"examples":[{"en":"I sympathized with her after she lost her job.","zh":"她失业后，我很同情她。"},{"en":"Many people sympathized with the victims of the storm.","zh":"许多人同情这场风暴的受害者。"},{"en":"He sympathized, but he still couldn’t change the decision.","zh":"他表示同情，但仍无法改变这个决定。"}]},{"partOfSpeech":"v.","definition":{"en":"Showed support for an idea, group, or cause (often without openly joining).","zh":"（对某个想法、团体或事业）表示支持或赞同（常指未公开加入但态度倾向支持）。"},"examples":[{"en":"She sympathized with their demand for safer working conditions.","zh":"她支持他们对更安全工作环境的诉求。"},{"en":"Some neighbors sympathized with the protest, even if they didn’t attend.","zh":"一些邻居支持那场抗议，即使他们没有到场。"}]}],"synonyms":["felt sorry for","pitied","understood","commiserated","supported"],"phonetic":"/ˈsɪmpəˌθaɪzd/","extraExplanation":["常用搭配是 sympathized with + 人/群体/观点（sympathized with her / with their cause）。","sympathize 更偏“同情、理解”，不一定表示你“经历过同样的事”；如果想表达“设身处地感受对方的感受”，常用 empathize（empathized）。","英式与美式都常见拼写 sympathize；-ize 结尾在美式写法中更常见。"]}
{"word":"sympathizer","summary":{"en":"A sympathizer is someone who supports or agrees with a person/cause, or someone who shows compassion and understanding for another’s feelings.","zh":"sympathizer 指“支持/认同某人或某事业的人”，也可指“对他人处境表示理解与同情的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or agrees with someone (or a group/cause), often without taking direct action.","zh":"同情者；支持者（常指认同某人/某团体或某事业，但未必直接参与行动）。"},"examples":[{"en":"She is a sympathizer of the environmental movement, but she doesn’t attend protests.","zh":"她是环保运动的支持者，但她不参加抗议活动。"},{"en":"The group relied on sympathizers to spread its message online.","zh":"该组织依靠支持者在网上传播信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who shows understanding and compassion for someone’s feelings or difficulties.","zh":"对他人处境表示理解与同情的人。"},"examples":[{"en":"After the accident, he found comfort in friends and sympathizers.","zh":"事故之后，他从朋友和同情者那里获得安慰。"},{"en":"She wrote to a sympathizer who truly understood her loss.","zh":"她写信给一位真正理解她失去亲人的同情者。"}]}],"synonyms":["supporter","ally","advocate","well-wisher"],"phonetic":"/ˈsɪm.pəˌθaɪ.zɚ/","extraExplanation":["“sympathizer”在新闻语境里常带一点“政治立场/阵营”的意味，比如“a sympathizer of the rebels（叛军的同情者/支持者）”。有时会被用来暗示“支持但不公开参与”，因此语气可能偏敏感；若想更中性，可用“supporter（支持者）”或“ally（盟友）”。","词根提示：sympathy（同情）+ -izer（……的人）。注意它既可指“同情理解的人”，也可指“政治/理念上的支持者”，要根据上下文判断。"]}
{"word":"sympathizes","summary":{"en":"“Sympathizes” means someone feels sympathy/understanding for others, or supports a cause or viewpoint.","zh":"“sympathizes”表示对他人表示同情/理解，也可表示赞同或支持某种观点或立场。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel sympathy for someone; to share or understand their feelings (especially sadness, trouble, or pain)","zh":"同情（某人）；对（某人的处境/感受）感同身受（尤指不幸、困难或痛苦）"},"examples":[{"en":"She sympathizes with victims of the earthquake.","zh":"她同情地震的受害者。"},{"en":"I sympathize with you—I know how stressful this can be.","zh":"我很同情你——我知道这会有多大压力。"},{"en":"He sympathizes with her loss and offered to help.","zh":"他对她的失去表示同情，并提出帮忙。"}]},{"partOfSpeech":"v.","definition":{"en":"to support or agree with an idea, plan, or group; to be on their side","zh":"赞同；支持（某种观点/计划/团体）；站在……一边"},"examples":[{"en":"Some voters sympathize with the movement’s goals.","zh":"一些选民认同这场运动的目标。"},{"en":"Her parents don’t sympathize with her decision to quit school.","zh":"她父母不赞同她退学的决定。"}]}],"synonyms":["feels sorry for","understands","pities","commiserates","supports","agrees with"],"phonetic":"ˈsɪmpəˌθaɪzɪz","extraExplanation":["“sympathizes”是第三人称单数（he/she/it sympathizes）。原形是 sympathize。","常见搭配：sympathize with + 人/群体/感受（更常用）；sympathize with + 观点/立场（表示“赞同/支持”）。","易混点：sympathize（同情/理解）不等于 empathize（更强调“设身处地体会”，共情更强）。"]}
{"word":"sympathomimetic","summary":{"en":"Sympathomimetic: a drug (or describing a drug) that imitates sympathetic “fight-or-flight” effects in the body.","zh":"sympathomimetic：拟交感神经的（或拟交感神经药），指模拟人体“战或逃”交感神经反应的作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing a drug that mimics the effects of the sympathetic nervous system, such as increasing heart rate, raising blood pressure, or opening airways.","zh":"（医学）拟交感神经的；指一种药物能模拟交感神经系统的作用，例如使心率加快、血压升高或支气管扩张。"},"examples":[{"en":"Albuterol is a sympathomimetic drug used to open the airways during an asthma attack.","zh":"沙丁胺醇（albuterol）是一种拟交感神经药，用于在哮喘发作时扩张气道。"},{"en":"Some cold medicines contain sympathomimetic ingredients that can raise blood pressure.","zh":"一些感冒药含有拟交感神经成分，可能会升高血压。"}]},{"partOfSpeech":"n.","definition":{"en":"A sympathomimetic drug or substance.","zh":"拟交感神经药（或拟交感神经物质）。"},"examples":[{"en":"The doctor prescribed a sympathomimetic to help relieve bronchospasm.","zh":"医生开了一种拟交感神经药来缓解支气管痉挛。"}]}],"synonyms":["adrenergic","sympathetic agonist"],"phonetic":"/ˌsɪm.pə.θoʊ.məˈmɛt.ɪk/","extraExplanation":["词源上，sympatho- 指“交感神经（sympathetic nervous system）”，-mimetic 来自 mimetic（模仿的），整体意思就是“模仿交感神经作用的”。","学习提示：医学语境中常见相关词包括 adrenergic（肾上腺素能的）和 bronchodilator（支气管扩张剂）。许多拟交感神经药会让人感觉“更兴奋/更警觉”，因此可能引起心悸、手抖或失眠等副作用；有高血压或心脏病史的人通常需要特别注意用药。"]}
{"word":"sympathy","summary":{"en":"Sympathy means compassion for someone’s suffering, and it can also mean support or agreement with an idea or group.","zh":"sympathy 主要表示对他人痛苦的关心与理解（同情），也可表示对观点或群体的认同与支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feeling of caring about and understanding someone’s pain, trouble, or sadness; compassion","zh":"对他人的痛苦、困难或悲伤感到关心与理解；同情、怜悯"},"examples":[{"en":"I have great sympathy for people who lose their jobs suddenly.","zh":"我非常同情那些突然失业的人。"},{"en":"She offered sympathy after hearing about his father’s death.","zh":"听说他父亲去世后，她表达了慰问与同情。"},{"en":"He didn’t want sympathy—he wanted practical help.","zh":"他不想要同情，他想要实际的帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"agreement with or support for an idea, goal, or group","zh":"对某种观点、目标或群体的认同与支持"},"examples":[{"en":"Many voters had sympathy for the workers’ demands.","zh":"许多选民支持工人的诉求。"},{"en":"I’m in sympathy with your plan, but we need more time.","zh":"我赞同你的计划，但我们需要更多时间。"}]}],"synonyms":["compassion","pity","understanding","concern","support"],"phonetic":"/ˈsɪmpəθi/","extraExplanation":["sympathy 通常指“理解并关心他人的痛苦”，但不一定亲身经历同样的事；empathy（共情）更强调“设身处地感受对方的情绪”。例如：I feel sympathy for you（我同情你） vs. I empathize with you（我能感同身受）。","常见搭配：express/offer sympathy（表达/给予慰问）、feel sympathy for sb.（同情某人）、have sympathy with/for sth.（赞同/支持某事）。在正式语境里，表达慰问也常说：Please accept my condolences（请接受我的哀悼）。","文学与常见表达中常出现的结构：\"win/lose someone’s sympathy\"（赢得/失去某人的同情）；\"a plea for sympathy\"（博取同情的请求）。"]}
{"word":"sympatric","summary":{"en":"Sympatric describes species or populations that live in the same geographic area.","zh":"Sympatric 指物种或种群在同一地理区域内同域分布。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, ecology) Living in the same geographic area as another species or population, so they can potentially interact or interbreed.","zh":"（生物学、生态学）与另一物种或种群生活在同一地理区域内，因此可能发生互动或（在近缘情况下）杂交。"},"examples":[{"en":"These two frog species are sympatric in the same rainforest valley.","zh":"这两种青蛙在同一片雨林山谷中是同域分布（sympatric）的。"},{"en":"Researchers compared sympatric populations to allopatric ones to see how quickly they diverge.","zh":"研究人员比较了同域种群与异域种群，以观察它们分化的速度。"}]}],"synonyms":["coexisting","co-occurring (in ecology)","same-range (informal)"],"phonetic":"/ˌsɪm.pəˈtrɪk/","extraExplanation":["词源：sym- 表示“共同、一起”，-patric 与“故土/地域”（patria）有关，因此 sympatric 字面意思是“在同一地域的”。","常见对比词：allopatric（异域的、地理隔离的）。相关概念：sympatric speciation（同域物种形成，指在没有明显地理隔离的情况下产生新物种）。","用法提示：sympatric 多用于学术写作/科普语境，不常用于日常口语。常见搭配有 sympatric species / populations / distribution。"]}
{"word":"symphonia","summary":{"en":"SYPHONIA is a formal/rare word meaning (1) a symphony or musical harmony, and (2) in Byzantine history, an ideal cooperation between Church and State; it can also name a medieval instrument in some sources.","zh":"symphonia 是较正式/少见的词，可指（1）交响曲或音乐和声；（2）拜占庭历史中“教会与国家协作和谐”的理念；在部分资料中也可作中世纪某些乐器的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music, formal/rare) A symphony; a harmonious musical performance or composition.","zh":"（音乐，正式/少见）交响曲；和谐的合奏或乐曲。"},"examples":[{"en":"The program notes described the piece as a symphonia celebrating spring.","zh":"节目单介绍这首作品是一部歌颂春天的“symphonia”（交响曲）。"},{"en":"In medieval Latin, “symphonia” could refer to music played in harmony.","zh":"在中世纪拉丁语中，symphonia 可以指和声演奏的音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"(History/Religion) The Byzantine idea of harmony or cooperation between the Church and the State.","zh":"（历史/宗教）拜占庭传统中“教会与国家和谐合作”的理念。"},"examples":[{"en":"The scholar explained symphonia as an ideal balance between imperial authority and church leadership.","zh":"学者将 symphonia 解释为皇权与教会领袖之间的理想平衡。"},{"en":"Debates about symphonia often appear in discussions of Eastern Orthodox political theology.","zh":"关于 symphonia 的讨论常见于东正教政治神学的研究中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A medieval musical instrument name used for certain bagpipes or a hurdy-gurdy (usage varies by source).","zh":"（历史）中世纪对某些风笛或手摇琴（hurdy-gurdy）的称呼（不同资料说法不一）。"},"examples":[{"en":"Some manuscripts mention the symphonia among instruments used for festive dancing.","zh":"一些手稿提到在节庆舞会中使用的乐器里有 symphonia。"}]}],"synonyms":["symphony","harmony","concord","accord"],"phonetic":"/sɪmˈfoʊniə/","extraExplanation":["“symphonia”源自希腊语 *symphōnía*，核心意思是“同声、和谐”（syn- = 一起；phōnē = 声音）。因此它既能指“音乐上的和声/合奏”，也能被引申为“关系上的和谐”。","在英语里它相对少见，更常见的对应词是 **symphony**（交响曲）。学术写作或历史语境（尤其拜占庭/东正教研究）中更可能看到 **symphonia**。","“教会—国家的 symphonia”并不等同于“政教合一”，更强调一种“分工但协作”的理想模式：皇帝/国家维护秩序，教会提供 духов/精神权威。"]}
{"word":"symphonic","summary":{"en":"“Symphonic” means related to a symphony or orchestra, or having an orchestra-like rich, grand sound.","zh":"“symphonic”指与交响曲/管弦乐团有关，或具有管弦乐般宏大、丰富的音响效果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a symphony or to symphony orchestras; having the rich, grand sound of an orchestra.","zh":"与交响曲或交响乐团有关的；具有管弦乐般宏大、丰富音响的。"},"examples":[{"en":"Beethoven’s symphonic music is powerful and dramatic.","zh":"贝多芬的交响性音乐充满力量而且戏剧性很强。"},{"en":"The film has a symphonic soundtrack with strings, brass, and percussion.","zh":"这部电影的原声带具有交响风格，有弦乐、铜管和打击乐。"},{"en":"Some rock bands create a symphonic sound by adding an orchestra.","zh":"有些摇滚乐队通过加入管弦乐团来营造交响化的音色。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In music) Written for or performed by a full orchestra.","zh":"（音乐）为完整的管弦乐队创作的；由管弦乐队演奏的。"},"examples":[{"en":"Mahler is known for large symphonic works.","zh":"马勒以大型交响作品而闻名。"},{"en":"They released a symphonic version of the song arranged for orchestra.","zh":"他们发布了这首歌的交响版本，改编为管弦乐编制。"}]}],"synonyms":["orchestral","symphony-like","grand","lush"],"phonetic":"/sɪmˈfɑnɪk/","extraExplanation":["“symphonic”来自“symphony（交响曲）”，在英语里常用来形容两类东西：①与交响曲/交响乐团有关（symphonic music, symphonic concert）；②更广义地形容“像交响乐一样层次丰富、气势宏大”的风格（a symphonic sound）。","常见搭配：symphonic orchestra（交响乐团），symphonic poem（交响诗），symphonic metal（交响金属，一种把金属乐与管弦/合唱融合的风格）。注意它通常不直接表示“和谐的”，那更常用“harmonious”。"]}
{"word":"symphonically","summary":{"en":"“Symphonically” means “in a symphonic/orchestral way,” either literally with a full orchestra or more generally with rich, coordinated complexity.","zh":"“symphonically”表示“以交响（管弦乐）的方式”，既可指由完整乐队演奏/改编，也可泛指层次丰富、协调配合的复杂效果。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a symphonic way; like a symphony—rich, coordinated, and involving many parts working together.","zh":"以交响乐的方式；像交响曲一样——丰富、协调，由许多部分共同配合。"},"examples":[{"en":"The music swelled symphonically, with strings, brass, and drums rising together.","zh":"音乐以交响般的方式渐强，弦乐、铜管和鼓点一同涌起。"},{"en":"The film’s soundtrack develops symphonically, building themes and variations over time.","zh":"这部电影的配乐以交响化方式展开，随着时间推进不断建立主题与变奏。"}]},{"partOfSpeech":"adv.","definition":{"en":"With a full orchestra, or in the style of symphonic (orchestral) music.","zh":"以完整管弦乐队演奏；或以交响乐（管弦乐）的风格。"},"examples":[{"en":"The composer reworked the song symphonically for the concert hall.","zh":"作曲家把这首歌改编成交响化版本，用于音乐厅演出。"},{"en":"They performed the pop hit symphonically with the city orchestra.","zh":"他们与市交响乐团合作，以交响编制演绎这首流行金曲。"}]}],"synonyms":["orchestrally","in an orchestral manner","harmoniously","grandly"],"phonetic":"/sɪmˈfɑnɪkli/","extraExplanation":["“symphonically”来自动词/名词“symphony（交响曲/交响乐）”，后缀“-ically”表示“以……的方式”。常见搭配有：symphonically arranged（交响化编曲）、symphonically structured（交响式结构）、symphonically developed（交响式展开）。","它既可用于“音乐听起来像交响曲那样宏大、层次丰富”，也可用于更抽象的比喻：例如说一个团队“symphonically”协作，强调多方配合、整体协调。"]}
{"word":"symphonies","summary":{"en":"“Symphonies” is the plural of “symphony,” meaning orchestral musical works, and sometimes orchestras that perform them.","zh":"“symphonies”是“symphony”的复数，主要指交响曲；有时也指交响乐团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large, usually multi-movement pieces of music written for an orchestra.","zh":"交响曲：为管弦乐队创作的规模较大、通常由多个乐章组成的音乐作品。"},"examples":[{"en":"Beethoven wrote nine symphonies that are still performed worldwide.","zh":"贝多芬创作了九部交响曲，至今仍在世界各地演出。"},{"en":"We listened to a live orchestra play symphonies from the Romantic period.","zh":"我们听现场管弦乐队演奏了浪漫主义时期的交响曲。"}]},{"partOfSpeech":"n.","definition":{"en":"Orchestras or concert groups that perform symphonic music (short for “symphony orchestras”).","zh":"（非正式用法）交响乐团：演奏交响音乐的管弦乐团（“symphony orchestras”的简称）。"},"examples":[{"en":"Several symphonies will tour the region this summer.","zh":"今年夏天将有几支交响乐团在本地区巡演。"},{"en":"The city funds its symphonies through public and private support.","zh":"这座城市通过公共与私人支持来资助交响乐团。"}]}],"synonyms":["orchestral works","symphonic works","symphony orchestras"],"phonetic":"/ˈsɪm.fə.niz/","extraExplanation":["“symphonies”是“symphony”的复数。单数在音乐语境中更常见（a symphony / the symphony），复数常用于概括某位作曲家的多部作品（e.g., Mahler’s symphonies）或指多个交响乐团。","词源来自希腊语，原义与“和谐地一起发声”有关，因此也常带有“宏大、协调、层次丰富”的联想。"]}
{"word":"symphonious","summary":{"en":"“Symphonious” describes sounds that blend together in a pleasing, harmonious, musical way.","zh":"“symphonious”指声音融合得悦耳、和谐、富有音乐感（带有“像交响般协调”的意味）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Pleasantly sounding together; harmonious and musical.","zh":"（声音）悦耳和谐的；如同交响般协调的。"},"examples":[{"en":"The choir’s voices blended into a symphonious whole.","zh":"合唱团的歌声融合成一种悦耳和谐的整体。"},{"en":"They chose symphonious background music for the wedding dinner.","zh":"他们为婚宴选择了和谐悦耳的背景音乐。"},{"en":"In the quiet hall, the strings and woodwinds created a symphonious texture.","zh":"在安静的大厅里，弦乐与木管营造出和谐悦耳的音色层次。"}]}],"synonyms":["harmonious","melodious","musical","euphonic","tuneful"],"phonetic":"/sɪmˈfoʊniəs/","extraExplanation":["“symphonious”常用来形容多种声音“配合得很好”，不一定真的指“交响乐”，但带有“像交响乐那样协调、丰富”的感觉。","词源上来自“symphony（交响乐/和声）”+ “-ous（……的）”。在文学或评论中，它既可描述音乐，也可比喻语言、自然声（如风声与鸟鸣）或整体氛围的和谐。"]}
{"word":"symphonize","summary":{"en":"“Symphonize” means to harmonize in music or, figuratively, to be in agreement.","zh":"“symphonize”指（在音乐上）和谐合奏/合唱，也可比喻指彼此一致、相契合。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to play or sing in harmony; to make different sounds fit together like a symphony","zh":"（使）和谐合奏/合唱；使不同声音像交响乐一样协调"},"examples":[{"en":"The choir symphonized beautifully with the orchestra.","zh":"合唱团与管弦乐队配合得非常和谐。"},{"en":"The composer tried to symphonize folk melodies with classical strings.","zh":"作曲家试图把民间旋律与古典弦乐融合在一起。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be in agreement; to match or be consistent (often used figuratively)","zh":"（比喻）一致；相互契合、相符合"},"examples":[{"en":"Her actions didn’t symphonize with her words.","zh":"她的行动与她的话并不一致。"},{"en":"In a good team, different ideas can symphonize instead of compete.","zh":"在一个好的团队里，不同想法可以相互契合，而不是彼此争抢。"}]}],"synonyms":["harmonize","blend","accord","agree","coordinate"],"phonetic":"/ˈsɪmfəˌnaɪz/","extraExplanation":["“symphonize”比较少见，更多时候英语会用“harmonize”（协调、和声）或“be in harmony/agree”（一致）来表达相近意思。","词根与“symphony（交响乐）”同源，来自希腊语中表示“同声、和谐”的成分，因此既可用于音乐语境，也可引申到“观点/行为相一致”的比喻用法。"]}
{"word":"symphony","summary":{"en":"A symphony is usually a large orchestral piece in several movements; it can also mean an orchestra or, figuratively, a harmonious mix of sounds.","zh":"symphony 通常指由多个乐章组成的大型管弦乐作品；也可指交响乐团，或比喻“和谐的声音/组合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, complex piece of classical music for an orchestra, usually in several movements (sections).","zh":"交响曲：为管弦乐队创作的、篇幅较长且结构复杂的古典音乐作品，通常由多个乐章组成。"},"examples":[{"en":"We listened to Beethoven’s Fifth Symphony in class.","zh":"我们在课上听了贝多芬的《第五交响曲》。"},{"en":"The symphony has four movements, and the last one is very dramatic.","zh":"这部交响曲有四个乐章，最后一个非常富有戏剧性。"}]},{"partOfSpeech":"n.","definition":{"en":"An orchestra or an organization that performs orchestral music (often used in names).","zh":"交响乐团：演出管弦乐的乐团或机构（常用于名称中）。"},"examples":[{"en":"She plays violin in the Chicago Symphony.","zh":"她在芝加哥交响乐团拉小提琴。"},{"en":"The city’s symphony is performing outdoors this weekend.","zh":"这个城市的交响乐团这周末将在户外演出。"}]},{"partOfSpeech":"n.","definition":{"en":"A pleasing combination of sounds or parts working well together (often used metaphorically).","zh":"（比喻）和谐的组合：声音或各部分配合得很协调、悦耳的整体。"},"examples":[{"en":"The morning birdsong felt like a symphony of nature.","zh":"清晨的鸟鸣像一场大自然的交响乐。"},{"en":"In the kitchen, the sizzling, chopping, and laughter became a symphony of daily life.","zh":"在厨房里，滋滋作响、切菜声和笑声汇成了日常生活的交响。"}]}],"synonyms":["orchestral work","orchestra","harmonious blend"],"phonetic":"/ˈsɪm.fə.ni/","extraExplanation":["词源：symphony 来自希腊语 symphōnia，意为“共同发声、和谐的声音”。因此它既可以指具体的“交响曲”，也常被用作比喻，表示“多种元素配合得很和谐”。","文化提示：在西方古典音乐里，交响曲通常由3到4个乐章组成；常见作曲家包括海顿、莫扎特、贝多芬、柴可夫斯基等。日常英语中，人们也会把任何“丰富而协调的声音”称作 a symphony（如 a symphony of sounds）。","文学/常见表达：在写作中，symphony 常用于描写氛围与感官体验，例如“a symphony of colors/sounds”，强调层次感与整体和谐。"]}
{"word":"symphony orchestra","summary":{"en":"A large classical orchestra that performs symphonies and similar concert music.","zh":"主要演奏交响曲等古典音乐会作品的大型管弦乐团。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A large orchestra that mainly performs symphonies and other classical concert works, usually with strings, woodwinds, brass, and percussion.","zh":"交响乐团：一种规模较大的管弦乐团，主要演奏交响曲及其他古典音乐会作品，通常包含弦乐、木管、铜管和打击乐。"},"examples":[{"en":"She plays violin in the city’s symphony orchestra.","zh":"她在这座城市的交响乐团拉小提琴。"},{"en":"The symphony orchestra performed Beethoven’s Fifth Symphony tonight.","zh":"今晚交响乐团演奏了贝多芬《第五交响曲》。"},{"en":"A symphony orchestra often needs a conductor to keep everyone together.","zh":"交响乐团通常需要指挥来让大家合在一起。"}]}],"synonyms":["orchestra","philharmonic orchestra","symphony"],"phonetic":"/ˈsɪmfəni ˈɔrkɪstrə/","extraExplanation":["“symphony orchestra”和“philharmonic orchestra”在日常英语里通常指同一种类型的乐团，差别多是名称或机构背景，而不是固定的编制差异。","交响乐团常见编制包括弦乐组（小提琴、中提琴、大提琴、低音提琴）+木管（长笛、双簧管、单簧管、巴松等）+铜管（圆号、小号、长号、大号）+打击乐；规模会随曲目变化。","语境提示：在英语里说“the orchestra”常指古典管弦乐团；若是流行/爵士的大乐队，通常会说“big band”而不是“orchestra”。"]}
{"word":"symphysis","summary":{"en":"A symphysis is a cartilage-based joint that firmly unites two bones, allowing only slight movement.","zh":"symphysis 指由软骨连接两块骨头的“联合”，结构牢固但只能轻微活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A joint where two bones are firmly connected by cartilage (not freely movable).","zh":"一种由软骨把两块骨牢固连接起来的关节（活动度较小、非自由活动）。"},"examples":[{"en":"The pubic symphysis connects the left and right pubic bones.","zh":"耻骨联合把左右两块耻骨连接在一起。"},{"en":"During pregnancy, the symphysis can become more flexible.","zh":"怀孕期间，联合处可能变得更有弹性（更松弛）。"}]}],"synonyms":["cartilaginous joint","union"],"phonetic":"/ˈsɪm.fə.sɪs/","extraExplanation":["词源来自希腊语，意为“生长在一起、联合”。医学上常见于解剖学术语：如 pubic symphysis（耻骨联合）与 intervertebral symphysis（椎间联合/椎间联合处，通常指椎间盘连接的联合类型）。"]}
{"word":"symporter","summary":{"en":"A symporter is a membrane protein that cotransports different molecules in the same direction across a cell membrane.","zh":"symporter 指一种膜蛋白，能把不同分子沿同一方向协同跨膜转运。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A membrane transport protein that moves two (or more) different substances across a cell membrane in the same direction at the same time (a type of cotransporter).","zh":"一种膜转运蛋白，可同时把两种（或以上）不同物质沿同一方向跨膜运输（属于“同向协同转运/共转运”）。"},"examples":[{"en":"The sodium–glucose symporter brings glucose into intestinal cells using the sodium gradient.","zh":"钠-葡萄糖同向转运体利用钠离子梯度把葡萄糖带入肠道细胞。"},{"en":"Many symporters use the energy stored in ion gradients rather than ATP directly.","zh":"许多同向转运体利用离子梯度中储存的能量，而不是直接使用ATP。"}]}],"synonyms":["cotransporter","symport protein","symport transporter"],"phonetic":"ˈsɪmˌpɔrtər","extraExplanation":["“symporter”常见于细胞生物学/生理学语境：它属于secondary active transport（继发性主动转运），通常借助Na+或H+的电化学梯度来“顺带”运输另一种分子。","对比记忆：uniporter（单向转运体）只运一种物质；antiporter（反向转运体）把两种物质向相反方向交换运输；symporter（同向转运体）把两种物质向同一方向一起运。","词源小提示：sym- 表示“共同/一起”，-porter 来自“携带/运输”。"]}
{"word":"symposia","summary":{"en":"“Symposia” is the plural of “symposium,” meaning formal expert meetings or conferences focused on a specific topic.","zh":"“Symposia”是“symposium”的复数，指围绕特定主题的正式专家研讨会/专题会议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “symposium”: formal meetings or events where experts give talks and discuss a specific topic (often academic or professional).","zh":"“symposium”的复数：围绕某一主题（常见于学术/专业领域）举行的研讨会、专题会议，通常包含专家报告与讨论。"},"examples":[{"en":"The university hosts several symposia on climate change each year.","zh":"这所大学每年都会举办几场关于气候变化的专题研讨会。"},{"en":"Researchers presented new findings at international symposia.","zh":"研究人员在国际研讨会上发布了新发现。"},{"en":"She attended symposia on public health and education policy.","zh":"她参加了关于公共卫生和教育政策的研讨会。"}]}],"synonyms":["conferences","seminars","workshops","forums","colloquia"],"phonetic":"/sɪmˈpoʊziə/","extraExplanation":["“symposia”是来自拉丁/希腊语系的复数形式（symposium → symposia），在正式写作中较常见；口语和一般写作里也常用规则复数“symposiums”。两者通常都被接受。","词源可追溯到古希腊“symposion”，原意与“饮宴、聚会”有关，后来引申为“围绕主题的讨论/交流”。现代英语中多指学术或专业研讨会。"]}
{"word":"symposiast","summary":{"en":"A participant in a symposium (discussion meeting; historically, a wine-and-conversation gathering).","zh":"参加 symposium 的人（现代多指研讨会参与者；历史上也指宴饮谈话聚会的参与者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes part in a symposium (a meeting for discussion or, in older usage, a drinking-and-conversation gathering).","zh":"参加专题讨论会的人；（较古老用法）参加宴饮与谈话聚会的人。"},"examples":[{"en":"The symposiasts debated how artificial intelligence should be regulated.","zh":"与会的讨论者就人工智能应如何监管展开辩论。"},{"en":"In the ancient-style banquet, the symposiasts recited poems between cups of wine.","zh":"在仿古的宴饮中，宾客们在举杯之间吟诵诗歌。"}]}],"synonyms":["participant","attendee","panelist","discussant"],"phonetic":"/sɪmˈpoʊziæst/","extraExplanation":["词源与文化背景：symposiast 来自 symposium（专题讨论会/宴饮聚会）。在古希腊语里，symposium 原指“共同饮酒的聚会”，往往包含音乐、诗歌与哲学谈话（柏拉图《会饮篇》The Symposium 就以此为背景）。现代英语中 symposium 更常指“学术/专业研讨会”，因此 symposiast 也常指“与会的讨论者”。","使用提示：这个词比较书面、偏少见。日常表达里更常用 participant、attendee、panelist（小组讨论成员）等。"]}
{"word":"Symposion","summary":{"en":"Symposion most commonly refers to an ancient Greek drinking party with conversation; it can also be a rare variant of “symposium.”","zh":"Symposion 通常指古希腊的酒宴雅集（饮酒并交谈）；也可作为“symposium（研讨会）”的少见变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Ancient Greece) a drinking party where people ate, drank wine, and talked—often about art, politics, or philosophy.","zh":"（尤指古希腊）酒宴/雅集：人们边用餐饮酒边交谈，常讨论艺术、政治或哲学等话题。"},"examples":[{"en":"In Ancient Athens, a symposion often included music, poetry, and long conversations.","zh":"在古雅典，symposion 常包含音乐、诗歌和长时间的谈话。"},{"en":"Plato’s writing describes a symposion where guests debate the meaning of love.","zh":"柏拉图的作品描写了一场 symposion，宾客们辩论“爱”的意义。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; modern use) a formal meeting or conference for discussion; a variant spelling of “symposium.”","zh":"（较少见；现代用法）专题研讨会/学术会议；是“symposium”的一种变体拼写。"},"examples":[{"en":"The department hosted a symposion on climate policy (more commonly spelled symposium).","zh":"系里举办了一场关于气候政策的 symposion（更常见拼写为 symposium）。"}]}],"synonyms":["symposium","banquet","feast","salon"],"phonetic":"/sɪmˈpoʊziən/","extraExplanation":["“Symposion”来自希腊语 *symposion*，字面意思是“共同饮酒”。在古希腊文化中，它不只是聚会喝酒，更是一种社交与思想交流的场域。","文学与文化关联：柏拉图的对话篇《会饮篇》（常译自 *Symposium*）就以一次酒宴为框架，让人物讨论“爱（Eros）”。因此在英语语境里，这个词常带一点“有思想含量的聚会/讨论”的文化色彩。","拼写提示：现代英语里更常见的是“symposium”。“symposion”多见于古典学、历史或文学研究的语境，用来强调其“古希腊酒宴”的原始含义。"]}
{"word":"symposion","summary":{"en":"Symposion is a historical Greek-style drinking-and-discussion gathering, and it can also be a less common spelling of “symposium” (a formal conference).","zh":"Symposion 既可指古希腊的宴饮讨论聚会，也可作为“symposium（研讨会）”的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) In ancient Greece, a drinking party where people ate, drank wine, and talked—often with music, poetry, or debate.","zh":"（历史用语）古希腊的酒宴／宴饮聚会：人们一边用餐饮酒（常是葡萄酒），一边交谈，常伴有音乐、诗歌或辩论。"},"examples":[{"en":"In Plato’s works, the symposion is a setting for deep conversations about love and virtue.","zh":"在柏拉图的著作中，symposion 常被用作深入讨论爱情与美德的场景。"},{"en":"The guests reclined, drank wine, and listened to poetry at the symposion.","zh":"客人们斜倚而坐，饮酒并聆听诗歌——这是 symposion 的典型场面。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common spelling of “symposium,” meaning a formal meeting or conference for discussion, usually with several speakers.","zh":"“symposium”的较少见拼写：指专题研讨会／学术会议，通常由多位发言者进行讨论。"},"examples":[{"en":"She presented her research at an international symposion on climate policy.","zh":"她在一次国际气候政策研讨会（symposion）上展示了自己的研究。"},{"en":"The university hosted a symposion on public health and education.","zh":"这所大学举办了一个关于公共健康与教育的研讨会（symposion）。"}]}],"synonyms":["symposium","conference","seminar","colloquium"],"phonetic":"/sɪmˈpoʊ.zi.ən/","extraExplanation":["“symposion”源自古希腊语 συμπόσιον（sympósion），字面意思是“一起喝酒”（syn- ‘一起’ + posis ‘饮用’）。在古希腊文化里，它不仅是娱乐性的酒宴，也是一种重要的社交与思想交流空间。","文学/哲学中最著名的例子是柏拉图的《会饮篇》（英语常译为 The Symposium），书中以一次 symposion 为框架展开关于“爱”的讨论。"]}
{"word":"symposium","summary":{"en":"A symposium is a formal event where experts discuss a topic, or a published set of writings on one topic.","zh":"symposium 指围绕某一主题的正式研讨会，也可指期刊/书中关于同一主题的专题论文（文章）合集。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal meeting or conference where people discuss a particular topic, often with several speakers giving short talks.","zh":"研讨会；专题会议：围绕某一主题进行讨论的正式会议，常由多位讲者发表简短演讲。"},"examples":[{"en":"She presented her research at an international symposium on climate change.","zh":"她在一场关于气候变化的国际研讨会上展示了她的研究。"},{"en":"The university will host a symposium on AI ethics next month.","zh":"这所大学下个月将举办一场关于人工智能伦理的研讨会。"}]},{"partOfSpeech":"n.","definition":{"en":"A collection of essays, articles, or talks on a single subject, published together (often in an academic context).","zh":"（学术）专题论文集；专刊：围绕同一主题汇编出版的一组文章、论文或讲稿。"},"examples":[{"en":"The journal published a symposium on modern poetry.","zh":"这本期刊刊登了一组关于现代诗歌的专题论文。"}]}],"synonyms":["conference","seminar","forum","panel discussion","colloquium"],"phonetic":"/sɪmˈpoʊziəm/","extraExplanation":["“symposium”源自希腊语，原意是“饮酒聚会”，在古希腊常指边饮酒边进行的讨论与辩论。现代英语里更偏“正式学术研讨会”的含义，但仍保留“多人围绕同一主题交流”的核心概念。","常见搭配：host/hold/attend a symposium（举办/召开/参加研讨会）；symposium on/about + 主题（关于……的研讨会）。在学术写作中也常见“a symposium in a journal（期刊专题）”。"]}
{"word":"symposiums","summary":{"en":"“Symposiums” is the plural of “symposium,” usually meaning conferences for discussion and expert talks; it can also refer to a historical Greek-style banquet discussion.","zh":"“symposiums”是“symposium”的复数，通常指专题研讨会/会议；也可指历史上的古希腊宴饮式会谈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A meeting or conference where people discuss a particular topic, often with several speakers giving talks.","zh":"关于某一主题的研讨会/专题会议，通常有多位讲者发言并进行讨论。"},"examples":[{"en":"The university hosted two symposiums on climate change this year.","zh":"这所大学今年举办了两场关于气候变化的研讨会。"},{"en":"At the medical symposium, experts shared new research and answered questions.","zh":"在医学研讨会上，专家分享了新研究并回答问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, historical) A social gathering with food and drink, especially in ancient Greece, where people talked, debated, or enjoyed entertainment.","zh":"（较少见，历史义）宴饮聚会，尤指古希腊的酒宴，人们在席间交谈、辩论或娱乐。"},"examples":[{"en":"In Plato’s writing, a symposium becomes a setting for philosophical conversation.","zh":"在柏拉图的作品中，“symposium”常作为哲学对话发生的场景。"}]}],"synonyms":["conferences","seminars","forums","panels"],"phonetic":"/sɪmˈpoʊziəmz/","extraExplanation":["“symposiums”是“symposium”的复数形式；在学术英语里也常见复数“symposia”，更偏正式。","词源来自希腊语，原意与“共同饮酒”相关，所以它既有现代的“学术研讨会”义，也有古典的“宴饮会谈”义。"]}
{"word":"sympt","summary":{"en":"“sympt” is an abbreviation for “symptom,” mostly used in medical notes.","zh":"“sympt”是“symptom（症状）”的缩写，主要用于医疗记录。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Short for “symptom”; used mainly in medical notes or informal writing.","zh":"（缩写）“symptom（症状）”的缩写；主要见于病历记录或较随意的书写中。"},"examples":[{"en":"Pt reports no sympt of fever or cough.","zh":"病人报告没有发烧或咳嗽的症状。"},{"en":"Common sympt include headache and nausea.","zh":"常见症状包括头痛和恶心。"}]}],"synonyms":["symptom","sx (medical abbreviation)"],"phonetic":"/sɪmpt/","extraExplanation":["“sympt”多见于临床/护理记录（如“Pt”=patient 病人），正式英文写作中一般不要用，建议写全“symptom(s)”。","在普通交流里，如果你是想表达“症状”，最自然的词是“symptom”；“sympt”通常只作为书面缩写，不太会被单独读出来。"]}
{"word":"symptom","summary":{"en":"A symptom is a sign of illness (often felt by the patient) or a sign that a bigger problem exists.","zh":"symptom 指（1）疾病的症状（多为患者主观感受）；（2）更大问题存在的征兆或表象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sign that someone has an illness or a health problem, usually something the person feels (such as pain, fever, or nausea).","zh":"（疾病或健康问题的）症状；通常指患者自己感觉到的不适（如疼痛、发烧、恶心）。"},"examples":[{"en":"Common symptoms of the flu include fever, cough, and body aches.","zh":"流感的常见症状包括发烧、咳嗽和全身酸痛。"},{"en":"If you have severe symptoms, you should see a doctor right away.","zh":"如果症状严重，你应该立刻就医。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign that a larger problem exists, especially in society, an organization, or a situation.","zh":"（更大问题的）征兆；（尤指社会、组织或某种局势中的）表象。"},"examples":[{"en":"Rising prices can be a symptom of inflation.","zh":"物价上涨可能是通货膨胀的一个征兆。"},{"en":"High employee turnover is often a symptom of poor management.","zh":"员工流动率高往往是管理不善的表象。"}]}],"synonyms":["indication","sign","warning sign"],"phonetic":"/ˈsɪmptəm/","extraExplanation":["“Symptom”常和“sign”一起出现，但两者有区别：一般来说，symptom 多指患者“主观感受”（如头痛、恶心），sign 多指医生或他人“客观观察/测量到”的体征（如皮疹、血压升高）。日常英语里二者有时会被混用，但在医学语境中区分更严格。","常见搭配：have symptoms（有症状）、develop symptoms（出现症状）、symptoms of + 疾病（……的症状）、treat/relieve symptoms（治疗/缓解症状）。"]}
{"word":"symptoma","summary":{"en":"A symptom is something you feel or notice that suggests illness or a problem; it can also mean a sign of a bigger issue in a situation.","zh":"symptom 指你感觉到或注意到、提示疾病或问题的“症状”；也可引申为某种更大问题的“迹象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change in your body or mind that shows you may have an illness or problem, especially something you feel and describe (like pain or nausea)","zh":"（尤指你自己能感觉并描述的）症状；表明可能生病或出现问题的身体或心理变化（如疼痛、恶心）"},"examples":[{"en":"Fever and a sore throat are common symptoms of the flu.","zh":"发烧和喉咙痛是流感的常见症状。"},{"en":"If you have these symptoms, see a doctor right away.","zh":"如果你有这些症状，请立刻就医。"},{"en":"Stress can cause physical symptoms like headaches.","zh":"压力可能引起像头痛这样的躯体症状。"}]},{"partOfSpeech":"n.","definition":{"en":"a sign that something is wrong in a situation (not only in medicine)","zh":"（非医学）征兆；迹象（表示某种情况出了问题）"},"examples":[{"en":"Rising prices can be a symptom of a weak economy.","zh":"物价上涨可能是经济疲软的征兆。"},{"en":"The lack of trust is a symptom of deeper problems in the team.","zh":"缺乏信任是团队更深层问题的迹象。"}]}],"synonyms":["indication","sign","warning sign","evidence"],"phonetic":"/ˈsɪm(p)təm/","extraExplanation":["“symptoma”在英语里不常用，通常你要找的是 **symptom**（单数）或 **symptoms**（复数）。","医学里常区分 **symptom** 和 **sign**：**symptom** 是患者“感觉到”的（如疼痛、头晕）；**sign** 是医生“观察或测量到”的（如皮疹、血压升高）。"]}
{"word":"symptomatic","summary":{"en":"“Symptomatic” means showing symptoms or being a sign of a deeper problem or broader trend.","zh":"“symptomatic”指“有症状的”，也可指“作为更深层问题或更大趋势的征兆/代表”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing symptoms of an illness or problem; having signs that something is wrong.","zh":"有症状的；显示出疾病或问题征兆的。"},"examples":[{"en":"He is symptomatic of the flu: a high fever and a bad cough.","zh":"他表现出流感症状：高烧和严重咳嗽。"},{"en":"The slow computer is symptomatic of a deeper issue, like low memory.","zh":"电脑变慢是更深层问题（比如内存不足）的征兆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Typical of or representing a larger situation; serving as a sign of a broader trend.","zh":"具有代表性的；反映更大范围情况或趋势的。"},"examples":[{"en":"Her story is symptomatic of the challenges many new graduates face.","zh":"她的经历具有代表性，反映了许多应届毕业生面临的挑战。"},{"en":"These comments are symptomatic of a culture that discourages questions.","zh":"这些评论反映了一种不鼓励提问的文化。"}]}],"synonyms":["indicative","suggestive","characteristic","representative"],"phonetic":"/ˌsɪmp.təˈmæt̬.ɪk/","extraExplanation":["“symptomatic”来自“symptom（症状）”。日常医学语境里常与“of”搭配：be symptomatic of…（是……的症状/征兆）。","常见对比：\n- symptomatic（有症状的/表征性的） vs. asymptomatic（无症状的）\n- symptom（症状，主观感受或表现） vs. sign（体征，更偏客观可测量）"]}
{"word":"symptomatology","summary":{"en":"Symptomatology means the study of symptoms or the overall pattern of symptoms.","zh":"symptomatology 指“症状学”，也可指“症状的整体模式/集合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study and description of symptoms (especially of a disease), including how symptoms appear and relate to one another.","zh":"症状学；症状的研究与描述（尤指疾病），包括症状如何出现以及彼此之间的关系。"},"examples":[{"en":"In medical school, we learned symptomatology before we studied specific diseases.","zh":"在医学院，我们先学症状学，然后才学习具体疾病。"},{"en":"The report focuses on the symptomatology of long COVID, such as fatigue and brain fog.","zh":"这份报告聚焦于长新冠的症状表现，如疲劳和“脑雾”。"}]},{"partOfSpeech":"n.","definition":{"en":"The set or pattern of symptoms shown by a person or group.","zh":"（某人或某群体的）症状集合；症状模式。"},"examples":[{"en":"Her symptomatology includes headaches, nausea, and sensitivity to light.","zh":"她的症状包括头痛、恶心以及对光敏感。"},{"en":"Doctors compared the symptomatology of different patients to find a common cause.","zh":"医生比较不同病人的症状模式，以寻找共同原因。"}]}],"synonyms":["symptoms","symptom pattern","clinical presentation","symptom profile"],"phonetic":"/ˌsɪmp.tə.məˈtɑː.lə.dʒi/","extraExplanation":["这是偏正式的医学/心理学用词，日常英语更常说 symptoms（症状）或 symptom pattern（症状模式）。","词源上：symptom（症状）+ -logy（……学/研究）。常见于学术论文、病例讨论与临床记录。"]}
{"word":"symptomless","summary":{"en":"Symptomless means having no symptoms, even if a condition exists.","zh":"symptomless 指“无症状的”，即使身体状况/感染可能存在。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no symptoms of an illness or condition, even though the condition may still be present.","zh":"（疾病或状况）无症状的；虽可能存在问题但没有表现出症状的。"},"examples":[{"en":"Some people can carry a virus and stay symptomless for days.","zh":"有些人可能携带病毒，但在好几天里都无症状。"},{"en":"The infection may be symptomless at first, so regular checkups matter.","zh":"这种感染一开始可能无症状，所以定期检查很重要。"}]}],"synonyms":["asymptomatic","without symptoms","subclinical"],"phonetic":"/sɪmp.təm.ləs/","extraExplanation":["“symptomless”常见于医学与公共健康语境，强调“没有症状≠没有感染/没有风险”。日常英语里更常用的近义表达是“asymptomatic”（无症状的），在新闻、医疗说明和研究报告中尤其常见。","构词法：symptom（症状）+ -less（没有……的）。这种“-less”后缀也见于“harmless（无害的）”“endless（无尽的）”。"]}
{"word":"symptoms","summary":{"en":"“Symptoms” are signs or feelings that suggest an illness or a problem, and the word can also be used figuratively for problems in systems or situations.","zh":"“symptoms”指显示疾病或问题存在的症状/征象，也可引申为某个系统或局势出现问题的迹象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Signs or feelings that show you may have an illness or a problem (usually noticed by the person, like pain or nausea).","zh":"症状；（通常由本人感觉到的）生病或出现问题的征象或不适，如疼痛、恶心等。"},"examples":[{"en":"She has flu symptoms: a fever, a sore throat, and a cough.","zh":"她有流感症状：发烧、喉咙痛和咳嗽。"},{"en":"If your symptoms get worse, see a doctor right away.","zh":"如果症状加重，请立刻就医。"},{"en":"Stress can cause physical symptoms like headaches or stomachaches.","zh":"压力会引起头痛、胃痛等身体症状。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign that something is wrong in a situation or system (not only health).","zh":"（不只指健康）某种情况或系统出问题的迹象。"},"examples":[{"en":"High turnover can be a symptom of poor management.","zh":"员工流动率高可能是管理不善的迹象。"},{"en":"These delays are symptoms of deeper problems in the supply chain.","zh":"这些延误是供应链更深层问题的征兆。"}]}],"synonyms":["signs","indications","warning signs","manifestations"],"phonetic":"/ˈsɪm(p)təmz/","extraExplanation":["“symptom”常指病人主观感受到的不适（如疼痛、头晕）；与“sign（体征）”不同，sign 通常是医生或他人可观察/测量到的客观结果（如皮疹、发烧、血压异常）。日常交流中两者有时会混用，但在医学语境里区分更严格。","常用搭配：have symptoms（有症状）；develop symptoms（出现症状）；relieve/ease symptoms（缓解症状）；worsen symptoms（加重症状）；symptoms of + 疾病/问题（……的症状/迹象）。","词源提示：symptom 来自希腊语，原意是“发生的事情/征兆”，所以它也常用来比喻“问题的表象”。"]}
{"word":"Syn","summary":{"en":"“Syn” usually refers to the prefix syn- meaning “together/same time,” or it can be shorthand for “synonym(s).”","zh":"“Syn”通常指前缀 syn-（表示“一起/同时”），也可作为“synonym(s)（同义词）”的简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “together,” “with,” or “at the same time,” used in many English words (e.g., synchronize, synonym).","zh":"前缀，表示“共同、一起”“伴随”“同时”，常用于许多英语单词中（如 synchronize 同步；synonym 同义词）。"},"examples":[{"en":"In “synchronize,” syn- means doing things at the same time.","zh":"在“synchronize（同步）”中，syn- 表示“同时进行”。"},{"en":"A “synonym” is a word with the same or nearly the same meaning as another word.","zh":"“synonym（同义词）”指与另一个词意思相同或相近的词。"}]},{"partOfSpeech":"other","definition":{"en":"an informal abbreviation for “synonym(s)” in notes or dictionaries.","zh":"非正式缩写，常在笔记或词典中表示“synonym(s)（同义词）”。"},"examples":[{"en":"Syn: happy → glad, joyful.","zh":"Syn：happy → glad, joyful（同义词：高兴的 → 开心的、愉快的）。"}]}],"phonetic":"/sɪn/","extraExplanation":["syn- 来自希腊语，原意接近“共同、一起”。在拼写上常见变体为 sym-，通常出现在 b、m、p 前面，便于发音：例如 symphony（交响乐）、symptom（症状）、symmetry（对称）。"]}
{"word":"syn","summary":{"en":"“syn” is usually an abbreviation for “synonym”; in some tech contexts it can mean “synchronization,” though “sync” is more common.","zh":"“syn”通常是“synonym（同义词）”的缩写；在一些技术语境中也可指“同步”，但更常见的写法是“sync”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “synonym,” used in dictionaries or word lists to introduce words with a similar meaning","zh":"“synonym（同义词）”的缩写，常见于词典或单词表，用来引出意思相近的词"},"examples":[{"en":"In the dictionary, “syn” is followed by words that mean almost the same thing.","zh":"在词典里，“syn”后面通常会列出意思几乎相同的词。"},{"en":"The notes say: “happy (syn: glad, joyful).”","zh":"笔记里写着：“happy（syn: glad, joyful）”。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “synchronization/synchronize” in some technical contexts (less common than “sync”)","zh":"在某些技术语境中表示“synchronization / synchronize（同步/同步化）”的缩写（不如“sync”常见）"},"examples":[{"en":"Check the settings to make sure the files are set to syn automatically.","zh":"检查设置，确保文件被设为自动同步（syn）。"},{"en":"The app needs a syn before you can see the latest updates.","zh":"这个应用需要先同步（syn）才能看到最新更新。"}]}],"synonyms":["abbr. for synonym","abbr. for synchronization (tech)"],"phonetic":"/sɪn/","extraExplanation":["“syn-”也是一个常见前缀，来自希腊语，意思是“共同、一起”。例如：synchronize（同步）、synthesis（综合）、synergy（协同作用）、sympathy（同情）。注意：写作前缀时通常用连字符：syn-。"]}
{"word":"synactic","summary":{"en":"Syntactic means “related to sentence structure (syntax).” “Synactic” is usually a misspelling of “syntactic.”","zh":"syntactic 表示“与句法/句子结构有关的”；synactic 通常是 syntactic 的拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly: syntactic) related to syntax—the rules for how words are arranged to form sentences.","zh":"（常用写法：syntactic）与“句法”有关的；指词语如何排列组合成句子的规则。"},"examples":[{"en":"In English, word order is an important syntactic feature.","zh":"在英语里，语序是一个重要的句法特征。"},{"en":"The teacher corrected a syntactic error in my sentence.","zh":"老师纠正了我句子里的一个句法错误。"},{"en":"We’ll compare the syntactic patterns of English and Chinese.","zh":"我们将比较英语和汉语的句法模式。"}]}],"synonyms":["grammatical (broader)","structural","syntactical"],"phonetic":"/sɪnˈtæk.tɪk/","extraExplanation":["“synactic”通常被认为是“syntactic”的拼写错误或非标准拼写。学术写作、语言学教材与词典中几乎都使用“syntactic”。","“syntactic”来自“syntax”（句法、语法结构），常见搭配：syntactic structure（句法结构）、syntactic rules（句法规则）、syntactic analysis（句法分析）。","区分：syntactic（句法层面：词序/结构） vs. grammatical（语法层面更广：时态、主谓一致、词形变化等也包括在内）。"]}
{"word":"synaeresis","summary":{"en":"Synaeresis is the combining of two adjacent vowel sounds into a single syllable, especially in poetry or careful pronunciation discussion.","zh":"Synaeresis 指把相邻两个元音并合成一个音节，常见于诗歌格律或语音讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In phonetics and poetry, the merging of two adjacent vowel sounds into one syllable (often to fit a meter or a natural pronunciation).","zh":"（语音学与诗歌中）将相邻的两个元音音合并为一个音节（常用于符合诗歌格律或更贴近自然发音）。"},"examples":[{"en":"In poetry, synaeresis can turn “fiery” into one syllable to match the meter.","zh":"在诗歌中，synaeresis 可以把 “fiery” 合并读成一个音节，以符合格律。"},{"en":"The singer used synaeresis, blending two vowels so the line felt smoother.","zh":"歌手使用了 synaeresis，把两个元音融合在一起，使这一句更顺畅。"}]}],"synonyms":["vowel coalescence","syllable contraction"],"phonetic":"/ˌsɪnəˈiːrəsɪs/","extraExplanation":["发音提示：synaeresis 通常指“两个元音合成一个音节”，常见于诗歌朗诵或歌唱中；与之相对的概念是 diaeresis（分音/分成两个音节，例如有时把 “cooperate” 标成 “coöperate” 来提示分开读）。","词源小知识：来自希腊语，含义与“结合/融合”有关，因此用来描述元音的“并合”。","在英语学习中，它常用于解释诗歌格律或某些单词在不同语速、口音下音节数变化的现象。"]}
{"word":"synaesthesia","summary":{"en":"Synaesthesia is when one sense automatically triggers another (and it can also mean a literary technique that mixes sensory images).","zh":"synaesthesia 指“联觉”：一种感觉会自动引发另一种感觉；也可指文学中混合感官意象的写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A neurological or perceptual condition in which stimulation of one sense automatically triggers an experience in another sense (for example, seeing colors when hearing music).","zh":"一种神经/知觉现象：某一种感觉受到刺激时，会自动引发另一种感觉体验（例如听到音乐会“看见”颜色）。"},"examples":[{"en":"She has synaesthesia and says certain songs look bright blue to her.","zh":"她有联觉，她说某些歌曲在她眼里是明亮的蓝色。"},{"en":"With synaesthesia, a sound might feel like a texture or a taste.","zh":"在联觉中，声音可能会让人感觉像一种触感或味道。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature and art, a technique that mixes sensory descriptions, such as describing a color as “loud” or a sound as “warm.”","zh":"在文学与艺术中，一种把不同感官描写混合在一起的修辞/写法，比如说“响亮的颜色”或“温暖的声音”。"},"examples":[{"en":"The poet uses synaesthesia, calling the perfume a “sweet, golden sound.”","zh":"诗人用了联觉写法，把香味写成“甜美、金色的声音”。"},{"en":"In art criticism, synaesthesia can describe writing that blends sight, sound, and touch.","zh":"在艺术评论里，“联觉”也可指把视觉、听觉和触觉交织在一起的文字表达。"}]}],"synonyms":["synesthesia","cross-sensory perception","sensory blending"],"phonetic":"/ˌsɪnəsˈθiːʒə/","extraExplanation":["拼写也常见作 synesthesia（美式更常用这种拼法）；synaesthesia 是英式拼法。两者意思相同。","常见类型包括：字形—颜色联觉（看到数字/字母会自动对应颜色）、声音—颜色联觉（听到声音会“看见”颜色）、词语—味觉联觉（某些词会引发特定味道）。","文学上的“联觉”不一定表示作者真的有这种神经现象，更多是为了让描写更生动，比如把“尖锐的味道”“柔软的光线”这种跨感官表达用来增强画面感。"]}
{"word":"synagogue","summary":{"en":"A synagogue is a Jewish place of worship, and it can also mean the Jewish congregation that meets there.","zh":"synagogue 指犹太教会堂（礼拜与学习的场所），也可指在该处聚会的会众团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Jewish place of worship; the building where Jewish people gather to pray, study, and hold community services","zh":"犹太教会堂；犹太人聚会祷告、学习与举行宗教仪式的场所（建筑）"},"examples":[{"en":"They went to the synagogue on Saturday morning.","zh":"他们星期六早上去会堂做礼拜。"},{"en":"The synagogue also offers Hebrew classes for children.","zh":"这座会堂也为孩子们开设希伯来语课程。"},{"en":"After the service, people talked outside the synagogue.","zh":"礼拜结束后，人们在会堂外聊天。"}]},{"partOfSpeech":"n.","definition":{"en":"the Jewish community or congregation that meets in a synagogue","zh":"（某会堂的）犹太会众；会堂团体"},"examples":[{"en":"The synagogue organized a food drive for local families.","zh":"该会众组织了一次为当地家庭募捐食品的活动。"},{"en":"Her synagogue welcomed new members warmly.","zh":"她所在的会众热情欢迎新成员。"}]}],"synonyms":["Jewish house of worship","shul","temple (in some Jewish communities)"],"phonetic":"/ˈsɪnəˌɡɑɡ/","extraExplanation":["“synagogue”来自希腊语，意思是“聚集在一起”。在英语里它既可指建筑，也可指“会众/团体”。","在犹太教传统中，安息日（Sabbath）通常从周五日落开始到周六日落结束，因此许多礼拜活动会在周五晚或周六进行。","与“temple（圣殿）”不同，synagogue一般指各地的会堂；在当代英语中，指犹太教礼拜场所时用“synagogue”最常见也最中性。使用时注意尊重宗教与族群身份，避免把它当作泛指的“教堂”。"]}
{"word":"synapse","summary":{"en":"A synapse is the junction where nerve signals pass between neurons (or from a neuron to another cell).","zh":"synapse 指神经信号在神经元之间（或神经元与其他细胞之间）传递的连接处，即“突触”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A junction (connection point) between two nerve cells where signals pass from one to another.","zh":"（神经）突触：两个神经细胞之间传递信号的连接处。"},"examples":[{"en":"Learning happens when synapses in the brain change and strengthen.","zh":"学习发生在大脑中的突触发生改变并变得更强的时候。"},{"en":"Researchers measured synapse activity to understand memory.","zh":"研究人员测量突触活动来理解记忆。"}]},{"partOfSpeech":"n.","definition":{"en":"A connection point that allows information to pass between neurons and other cells (such as muscle cells).","zh":"突触：神经元与其他细胞（如肌肉细胞）之间传递信息的连接点。"},"examples":[{"en":"At the synapse, chemical messengers help a nerve signal reach a muscle.","zh":"在突触处，化学信使帮助神经信号传到肌肉。"},{"en":"Some medicines affect how signals cross the synapse.","zh":"一些药物会影响信号如何跨越突触传递。"}]}],"synonyms":["neural junction","junction","connection point"],"phonetic":"/ˈsɪnæps/","extraExplanation":["词源：synapse 来自希腊语，意思大致是“连接、接合”。它强调的是“信号在连接处被传递”的过程。","常见搭配：synaptic（突触的，形容词），synaptic connection（突触连接），synaptic plasticity（突触可塑性，指突触会随学习与经验而改变）。","文化/语境提示：在科普文章里，synapse 常与“学习、记忆、习惯形成”一起出现，用来解释大脑如何通过连接的变化来适应环境。"]}
{"word":"synapsis","summary":{"en":"Synapsis is the pairing of homologous chromosomes during meiosis, enabling genetic recombination.","zh":"Synapsis 指减数分裂中同源染色体的配对过程，有助于发生遗传重组。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, genetics) The pairing of homologous chromosomes during meiosis (especially in prophase I), which helps enable crossing over.","zh":"（生物/遗传学）减数分裂过程中同源染色体的配对（尤指第一次减数分裂前期），有助于发生交换（交叉互换）。"},"examples":[{"en":"During meiosis, synapsis brings homologous chromosomes together so genetic material can be exchanged.","zh":"在减数分裂中，synapsis 会让同源染色体靠拢，从而使遗传物质能够发生交换。"},{"en":"Problems with synapsis may lead to errors in chromosome separation.","zh":"synapsis 出现问题可能会导致染色体分离出错。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A joining or close connection of two structures or parts.","zh":"（较少见）两种结构或部分之间的连接或紧密结合。"},"examples":[{"en":"The paper described a synapsis between two tissue layers as the embryo developed.","zh":"论文描述了胚胎发育过程中两层组织之间的结合（synapsis）。"}]}],"synonyms":["chromosome pairing","homologous pairing"],"phonetic":"/sɪˈnæpsɪs/","extraExplanation":["synapsis 常出现在细胞生物学/遗传学教材里，重点发生在“减数分裂第一次前期（prophase I）”。这一步同源染色体通过“联会复合体（synaptonemal complex）”稳定配对，为后续的“交叉互换（crossing over）”创造条件。","词形上，synapsis 来自希腊语词根，含义与“连接、联合”有关；注意不要把 synapsis（染色体配对）和 synapse（神经元之间的突触）混淆，两者拼写相近但指代不同。"]}
{"word":"synaptic","summary":{"en":"Synaptic means “related to a synapse,” the connection point where neurons communicate.","zh":"Synaptic 意为“与突触有关的”，突触是神经元进行信息交流的连接点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to synapses (the tiny junctions where nerve cells communicate with each other, often using chemicals called neurotransmitters).","zh":"与“突触”有关的；指神经细胞之间进行信息传递的微小连接处（常通过神经递质）。"},"examples":[{"en":"Learning can strengthen synaptic connections in the brain.","zh":"学习可以增强大脑中的突触连接。"},{"en":"The drug may affect synaptic transmission, changing how signals travel between neurons.","zh":"这种药物可能影响突触传递，改变信号在神经元之间传播的方式。"},{"en":"Researchers measured synaptic activity to understand memory formation.","zh":"研究人员测量突触活动来理解记忆如何形成。"}]}],"synonyms":["neural","neuronal","neurochemical"],"phonetic":"/sɪˈnæp.tɪk/","extraExplanation":["“Synaptic”常见于神经科学与心理学语境，如：synaptic plasticity（突触可塑性，指突触连接随经验而改变）、synaptic cleft（突触间隙）、synaptic transmission（突触传递）。","词根提示：synapse 来自希腊语，含“连接、接合”之意；-ic 表示“……的/与……有关的”，因此 synaptic = “与连接点（突触）有关的”。"]}
{"word":"synaptonemal","summary":{"en":"A biology term meaning “related to the synaptonemal complex” in meiosis.","zh":"生物学术语，指“与减数分裂中的联会复合体有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the synaptonemal complex, a structure that forms between paired homologous chromosomes during meiosis and helps them align and exchange DNA (crossing over).","zh":"与“联会复合体”有关的；指减数分裂时在同源染色体配对之间形成的一种结构，帮助它们对齐并进行DNA交换（交叉互换）。"},"examples":[{"en":"The synaptonemal complex is essential for proper chromosome pairing during meiosis.","zh":"联会复合体对减数分裂过程中染色体正确配对至关重要。"},{"en":"Researchers used microscopy to observe synaptonemal structures in developing eggs.","zh":"研究人员用显微镜观察发育中的卵细胞里的联会相关结构。"},{"en":"Mutations affecting synaptonemal proteins can lead to infertility.","zh":"影响联会复合体蛋白的突变可能导致不育。"}]}],"synonyms":["(in context) synaptonemal complex-related"],"phonetic":"/ˌsɪnæp.təˈniː.məl/","extraExplanation":["“synaptonemal”通常几乎只在专业语境中出现，最常见的搭配是 synaptonemal complex（联会复合体）。","词源提示：synapto- 有“连接、结合”的含义（可联想到 synapse“突触/连接点”，但两者是不同概念），-emal/-emal 相关形式用于构成形容词，表示“与……有关”。"]}
{"word":"sync","summary":{"en":"“Sync” means to make things match in time or to update data so devices are the same; it can also mean the state of being synchronized.","zh":"“sync”指让事物在时间上协调一致，或在科技语境中同步数据使设备内容一致；也可指“同步”的状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make things happen at the same time or work together in the same rhythm or schedule.","zh":"使（事物）同步；让它们在同一时间发生或协调一致地运作。"},"examples":[{"en":"Let’s sync our calendars so we don’t double-book meetings.","zh":"我们把日历同步一下，免得会议安排重复。"},{"en":"The dancers tried to sync their steps with the music.","zh":"舞者努力让步伐与音乐同步。"}]},{"partOfSpeech":"v.","definition":{"en":"(Technology) To copy or update the same data on two or more devices so they match.","zh":"（科技）同步数据；让两个或多个设备上的数据一致（复制/更新）。"},"examples":[{"en":"My photos sync automatically from my phone to the cloud.","zh":"我的照片会从手机自动同步到云端。"},{"en":"Please sync your changes before you close the document.","zh":"关闭文档前请先同步你的修改。"}]},{"partOfSpeech":"n.","definition":{"en":"Synchronization; a synchronized relationship or matching timing.","zh":"同步（状态/过程）；同步的关系或一致的时间点。"},"examples":[{"en":"The team’s success depends on sync between design and engineering.","zh":"团队的成功取决于设计和工程之间的同步与协作。"}]}],"synonyms":["synchronize","coordinate","align","match","update"],"phonetic":"/sɪŋk/","extraExplanation":["“sync”是“synchronize”的口语/缩写形式，常见于工作沟通和科技语境（如日历、通讯录、云端）。","在影视里“lip-sync”指“对口型”（画面嘴形与声音同步），也可引申为表演时假唱。"]}
{"word":"synch","summary":{"en":"Synch is an informal spelling of sync, meaning to synchronize or match so things work together.","zh":"Synch 是 sync 的非正式拼写，表示“同步/对齐”，让事物协调运作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) to synchronize; to make things happen at the same time or work well together.","zh":"（非正式）使同步；使在同一时间发生或协调运作。"},"examples":[{"en":"Let’s synch our calendars before we book the meeting.","zh":"我们先把日程同步一下再订会议。"},{"en":"The sound and video didn’t synch, so the movie looked strange.","zh":"声音和画面不同步，所以电影看起来很奇怪。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to match or align; to be in agreement or consistent.","zh":"（非正式）匹配/对齐；一致、相符。"},"examples":[{"en":"Make sure your numbers synch with the report.","zh":"确保你的数据和报告一致。"},{"en":"Their stories don’t synch, so someone is probably lying.","zh":"他们的说法对不上，所以很可能有人在撒谎。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in the phrase “in synch”) in sync; happening together or working smoothly as a group.","zh":"（用于短语“in synch”）同步；配合默契、运转顺畅。"},"examples":[{"en":"After a few practices, the dancers were finally in synch.","zh":"练了几次之后，舞者们终于同步了。"},{"en":"The team plays better when everyone is in synch.","zh":"当大家配合默契时，球队打得更好。"}]}],"synonyms":["sync","synchronize","coordinate","align","match","bring into sync"],"phonetic":"/sɪŋk/","extraExplanation":["“synch”是“sync”的另一种拼写（尤其常见于英式或较旧的写法），两者都来自“synchronize”的缩写。现代美式英语中更常写作“sync”。","在技术语境里很常见：sync data（同步数据）、sync up（对齐/协调一下）。口语里也常用“sync up”表示“碰一下进度/对一下信息”。"]}
{"word":"synchronal","summary":{"en":"Synchronal means happening at the same time, especially in scientific or technical contexts.","zh":"Synchronal 指“同时发生的/同步的”，多用于科学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; synchronous.","zh":"同时发生的；同步的。"},"examples":[{"en":"The sensors record synchronal changes in temperature and pressure.","zh":"这些传感器记录温度和压力的同步变化。"},{"en":"In biology, synchronal development means individuals reach a stage at the same time.","zh":"在生物学中，“同步发育”指个体在同一时间达到某个阶段。"}]},{"partOfSpeech":"adj.","definition":{"en":"In geology (stratigraphy), formed or deposited at the same time in different places.","zh":"（地质学/地层学）在不同地点于同一时期形成或沉积的（同生的）。"},"examples":[{"en":"These rock layers are considered synchronal across the basin.","zh":"这些岩层在整个盆地范围内被认为是同生的。"},{"en":"The fossils help show which deposits are synchronal.","zh":"这些化石有助于判断哪些沉积物是同生的。"}]}],"synonyms":["synchronous","simultaneous","concurrent"],"phonetic":"/ˈsɪŋkrənəl/","extraExplanation":["“synchronal”比更常见的“synchronous”更偏学术/技术语境，常见于生物学、地质学等领域。日常英语里通常用“synchronous”来表达“同步的”。","词源上与“syn-（一起）+ chron-（时间）”有关，含义核心就是“同一时间”。"]}
{"word":"synchronisation","summary":{"en":"Synchronisation means making things happen at the same time or keeping systems matched in time.","zh":"Synchronisation 指让事物同时发生或让系统在时间上保持一致（同步）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making things happen at the same time, or work together in the correct order","zh":"使事情同时发生或按正确顺序协同运作的过程；同步"},"examples":[{"en":"Good synchronisation between the sound and the video makes the film feel natural.","zh":"声音和画面良好的同步会让电影看起来更自然。"},{"en":"The team worked on synchronisation so the dancers moved together.","zh":"团队在做同步协调，让舞者动作一致。"}]},{"partOfSpeech":"n.","definition":{"en":"a state in which two or more systems match in time (for example, clocks, devices, or signals)","zh":"两个或多个系统在时间上保持一致的状态（如时钟、设备或信号）"},"examples":[{"en":"The two clocks are in perfect synchronisation.","zh":"这两只钟完全同步。"},{"en":"If synchronisation is lost, the audio may lag behind the video.","zh":"如果同步丢失，音频可能会落后于视频。"}]}],"synonyms":["synchronization","coordination","timing","alignment","sync"],"phonetic":"/ˌsɪŋkrənaɪˈzeɪʃən/","extraExplanation":["“synchronisation”是英式拼写；美式更常写作“synchronization”。两者意思相同，只是拼写习惯不同。","常见搭配：in synchronisation (with)（与……同步）；synchronisation between A and B（A与B之间的同步）。","在科技语境里，它常指设备/数据/信号的时间对齐；在表演或体育里，常指动作配合一致。"]}
{"word":"synchronise","summary":{"en":"Synchronise means to make things happen at the same time or to keep devices/data updated to match (British spelling of synchronize).","zh":"Synchronise 指使事物在时间上同步，或让设备/数据更新一致（synchronize 的英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE spelling) to make two or more things happen at the same time, move together, or match exactly in time.","zh":"（英式拼写）使两个或多个事物同时发生、同步运作或在时间上完全一致。"},"examples":[{"en":"We need to synchronise the audio with the video.","zh":"我们需要让音频和视频同步。"},{"en":"The dancers tried to synchronise their movements.","zh":"舞者努力让动作保持一致。"}]},{"partOfSpeech":"v.","definition":{"en":"(Technology) to make data on different devices or accounts the same by updating them to match.","zh":"（科技）通过更新，使不同设备或账号上的数据保持一致（同步）。"},"examples":[{"en":"Please synchronise your phone with your laptop.","zh":"请把你的手机和笔记本电脑同步。"},{"en":"My notes synchronised automatically to the cloud.","zh":"我的笔记自动同步到了云端。"}]}],"synonyms":["synchronize","coordinate","align","match","sync"],"phonetic":"/ˈsɪŋkrəˌnaɪz/","extraExplanation":["“synchronise”是英式拼写；美式更常写作“synchronize”，读音相同。","常见搭配：synchronise A with B（让A与B同步）；synchronise clocks（校准时钟）；synchronise data/files（同步数据/文件）。","在舞蹈、音乐、工程、项目管理中常指“时间配合”；在手机/电脑软件里常指“数据一致”。"]}
{"word":"synchroniser","summary":{"en":"A synchroniser is a person, device, or software component that makes things happen together in time (stay synchronized).","zh":"synchroniser 指让事物在时间上保持一致（同步）的人、设备或软件组件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that makes two or more events, processes, or devices happen at the same time (in sync).","zh":"使两个或多个事件、过程或设备同时发生（同步）的人或事物；同步器。"},"examples":[{"en":"In the lab, the synchroniser aligns the timing of the sensors.","zh":"在实验室里，同步器用来对齐传感器的时间。"},{"en":"The DJ used a beat synchroniser to keep the tracks in sync.","zh":"DJ 用节拍同步器让两首歌保持同步。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A tool, component, or program that coordinates timing or data so different parts of a system work together correctly.","zh":"（计算机）用于协调时间或数据，使系统不同部分正确协同工作的工具、组件或程序；同步模块。"},"examples":[{"en":"The app’s synchroniser updates your notes across devices.","zh":"这个应用的同步模块会在不同设备间更新你的笔记。"},{"en":"A thread synchroniser prevents tasks from interfering with each other.","zh":"线程同步器可以防止任务互相干扰。"}]}],"synonyms":["synchronizer","sync device","coordinator","timekeeper"],"phonetic":"/ˈsɪŋkrəˌnaɪzər/","extraExplanation":["“synchroniser”是英式拼写；美式更常写作“synchronizer”。含义相同。","词根来自“synchronize”（同步）+ “-er”（做某事的人/物），字面意思就是“用来同步的东西/人”。"]}
{"word":"synchronism","summary":{"en":"Synchronism means things happening at the same time, or being in the same stage of development (often in scientific contexts).","zh":"Synchronism 指事情同时发生的同步性，也可指（尤其在科学语境中）处于同一发展阶段的同步状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fact of happening at the same time; being simultaneous","zh":"同时发生；同步性"},"examples":[{"en":"There was a synchronism between the power outage and the storm.","zh":"停电和暴风雨同时发生，呈现出同步性。"},{"en":"The dancers trained for perfect synchronism with the music.","zh":"舞者训练以达到与音乐完美同步。"}]},{"partOfSpeech":"n.","definition":{"en":"in biology, the state of developing or occurring at the same stage (especially in a group)","zh":"（生物学）同一阶段的发生或发展；同步发育"},"examples":[{"en":"The researcher measured synchronism in the cell cycle.","zh":"研究人员测量了细胞周期的同步性。"},{"en":"High synchronism made the experiment easier to analyze.","zh":"较高的同步性让实验更容易分析。"}]}],"synonyms":["simultaneity","synchrony","concurrence","coincidence"],"phonetic":"/ˈsɪŋ.krəˌnɪz.əm/","extraExplanation":["“synchronism”较偏正式，常见于学术写作（如生物学、历史学、哲学）。日常英语里更常用“synchrony”或“synchronization”（同步/同步化）。","词源提示：来自“syn-”（一起）+“chronos”（时间，希腊语），所以核心含义就是“同一时间”。"]}
{"word":"synchronization","summary":{"en":"Synchronization is the process of making actions, timing, or data line up so things happen together and work smoothly.","zh":"Synchronization 指让动作、时间或数据对齐，使事情同时发生并顺畅协同的“同步”过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making things happen at the same time, or matching actions/events so they work together smoothly","zh":"同步；使事情在同一时间发生，或让动作/事件匹配并顺畅协同的过程"},"examples":[{"en":"Good synchronization between the music and the lights makes the show feel professional.","zh":"音乐和灯光的良好同步会让演出更专业。"},{"en":"The coach worked on the synchronization of the team’s movements.","zh":"教练训练队员动作的同步性。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of keeping devices, systems, or data consistent and up to date with each other","zh":"（设备/系统/数据的）同步；让不同设备或系统的数据保持一致并及时更新的过程"},"examples":[{"en":"Turn on cloud synchronization to keep your files the same on your phone and laptop.","zh":"打开云同步，让手机和笔记本里的文件保持一致。"},{"en":"The app failed because data synchronization stopped in the background.","zh":"应用出错是因为后台数据同步停止了。"}]},{"partOfSpeech":"n.","definition":{"en":"in biology, the matching of timing in body processes (for example, hormones or sleep cycles)","zh":"（生物学）同步；身体过程在时间上的一致（如激素分泌或睡眠周期）"},"examples":[{"en":"Light exposure can affect the synchronization of our sleep cycle.","zh":"光照会影响我们睡眠周期的同步。"}]}],"synonyms":["coordination","alignment","timing","sync"],"phonetic":"/ˌsɪŋkrənaɪˈzeɪʃən/","extraExplanation":["词源提示：synchronization 来自 Greek（希腊语）syn-（一起）+ chronos（时间），核心意思就是“在时间上对齐”。","常见搭配：time synchronization（时间同步）、data synchronization（数据同步）、synchronization issue/problem（同步问题）、synchronize A with B（使A与B同步）。","语体区别：日常口语里常说 sync（同步/同步一下），更简短；正式写作或技术场景更常用 synchronization。"]}
{"word":"synchronize","summary":{"en":"Synchronize means to make things happen together or to keep data the same across systems.","zh":"synchronize 指让事物同时/协调进行，或让不同设备与系统的数据保持一致。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make two or more things happen at the same time or move/work together in a coordinated way","zh":"使（两件或多件事）同时发生，或使其协调一致地运作/进行"},"examples":[{"en":"The dancers synchronized their movements with the music.","zh":"舞者把动作与音乐同步起来。"},{"en":"We need to synchronize our schedules so we can meet next week.","zh":"我们需要把日程安排同步一下，好在下周见面。"}]},{"partOfSpeech":"v.","definition":{"en":"to match or update information between devices, accounts, or systems so they contain the same data","zh":"（在设备/账号/系统之间）同步数据，使信息一致或保持更新"},"examples":[{"en":"My phone automatically synchronizes photos to the cloud.","zh":"我的手机会自动把照片同步到云端。"},{"en":"Please synchronize your calendar with the team’s shared calendar.","zh":"请把你的日历与团队共享日历同步。"}]}],"synonyms":["sync","coordinate","align","match","harmonize"],"phonetic":"/ˈsɪŋkrəˌnaɪz/","extraExplanation":["常见搭配：synchronize A with B（把A与B同步/协调）；synchronize data/files（同步数据/文件）；synchronize clocks（校对时钟）。","在英美科技语境里，sync 是 synchronize 的常见缩写（如 sync your phone）。日常口语里更常说 “sync” 而不是完整的 “synchronize”。"]}
{"word":"synchronized","summary":{"en":"Synchronized means happening at the same time or coordinated to match timing; it can also be the past form of “synchronize.”","zh":"synchronized 表示“同步的/同时发生的/协调一致的”，也可作动词 synchronize 的过去式或过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; working together in a coordinated way.","zh":"同步的；同时发生的；协调一致的。"},"examples":[{"en":"The dancers moved in synchronized steps.","zh":"舞者以同步的步伐移动。"},{"en":"We need synchronized clocks for the experiment.","zh":"这个实验需要同步的时钟。"},{"en":"The team worked in a synchronized way to finish on time.","zh":"团队协调一致地工作，按时完成。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to match in time (for example, devices or systems set to the same clock).","zh":"（设备/系统）被校准到同一时间的；已同步的。"},"examples":[{"en":"Make sure your phone is synchronized with the cloud.","zh":"确保你的手机已经与云端同步。"},{"en":"The subtitles are synchronized with the audio.","zh":"字幕与音频是同步的。"}]},{"partOfSpeech":"v.","definition":{"en":"To synchronize (to cause things to happen at the same time); past tense or past participle form of “synchronize.”","zh":"使同步；使同时发生（“synchronize”的过去式/过去分词）。"},"examples":[{"en":"They synchronized the two videos before uploading.","zh":"他们在上传前把两个视频同步好了。"},{"en":"Our calendars have synchronized automatically.","zh":"我们的日历已经自动同步了。"}]}],"synonyms":["in sync","simultaneous","coordinated","aligned","matched","in step"],"phonetic":"/ˈsɪŋkrəˌnaɪzd/","extraExplanation":["“synchronized”常见于科技语境（如设备、数据、云端“同步”）以及表演/运动语境（动作“整齐一致”）。","词根来自“syn-”（一起）+ “chron”（时间），和“chronology（年代学/编年）”“chronicle（编年史）”同源。","在文学或修辞中，synchronized 常用来强调群体动作或情绪的“整齐一致”，例如“synchronized laughter（齐声笑）”“synchronized applause（整齐的掌声）”。"]}
{"word":"synchronizer","summary":{"en":"A synchronizer is something (a person, device, or software) that makes events or signals line up in time so they work together.","zh":"synchronizer 指让事件或信号在时间上对齐、步调一致，从而协同工作的同步器（人/设备/软件）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, device, or program that makes two or more things happen at the same time or work together in step (in sync).","zh":"同步器；用于让两个或多个事物在同一时间发生或步调一致地运作的人、设备或程序。"},"examples":[{"en":"The audio synchronizer keeps the music matched to the video.","zh":"音频同步器让音乐与视频保持一致。"},{"en":"In the lab, a synchronizer triggers the camera and the light at the same moment.","zh":"在实验室里，同步器会在同一时刻触发相机和灯光。"}]},{"partOfSpeech":"n.","definition":{"en":"In electronics or computing, a circuit/component (or software mechanism) that aligns signals or data with a clock to reduce timing errors.","zh":"（电子/计算机）同步器：将信号或数据与时钟对齐、减少时序错误的电路/组件（或软件机制）。"},"examples":[{"en":"A two-stage synchronizer is often used to safely bring an external signal into a digital system.","zh":"为了安全地把外部信号引入数字系统，常会使用两级同步器。"},{"en":"Without a synchronizer, the input may arrive at the wrong time and cause glitches.","zh":"没有同步器，输入可能在错误的时间到达并导致故障/毛刺。"}]}],"synonyms":["sync device","time aligner","coordinator","synchroniser"],"phonetic":"/ˈsɪŋkrəˌnaɪzər/","extraExplanation":["词形提示：synchronizer 来自 synchronize（使同步）+ -er（表示“做某事的人/物”）。英式拼写常见为 synchroniser。","常见近义表达（按语境）：device/program that syncs things（让……同步的设备/程序）、time-aligner（时序对齐器，偏技术）、coordinator（协调者，语义更宽）。"]}
{"word":"synchronoscope","summary":{"en":"A synchronoscope is a device used in power systems to show whether two AC sources are synchronized (same frequency and phase).","zh":"synchronoscope 指一种电力系统用仪表，用来显示两路交流电源是否同频同相，以便进行同步并网。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument that shows whether two alternating-current (AC) electrical sources are at the same frequency and phase, used especially when synchronizing (connecting) a generator to a power grid.","zh":"同步指示器；同步检相器：用来显示两路交流电源（如发电机与电网）是否同频、同相的仪表，常用于并网同步操作。"},"examples":[{"en":"Before closing the breaker, the operator watched the synchronoscope to confirm the generator was in step with the grid.","zh":"在合上断路器之前，操作员观察同步指示器，确认发电机与电网已同步。"},{"en":"If the synchronoscope spins quickly, the frequency difference is still too large to synchronize safely.","zh":"如果同步指示器转得很快，说明频率差仍然太大，不适合安全并网。"}]}],"synonyms":["synchroscope","phase indicator (context-dependent)"],"phonetic":"/ˌsɪŋkrəˈnɑːskəp/","extraExplanation":["词源上可拆成 synchro-（同步）+ -scope（观察/显示的仪器，如 microscope 显微镜）。因此它的核心含义就是“用来观察同步状态的仪表”。","在电力工程语境里，它常出现在发电机“并网（synchronizing to the grid）”流程中：读数/指针方向通常表示发电机相位“超前或滞后（lead/lag）”，转动速度反映频率差大小。不同设备的标记可能不同，实际操作需遵循现场规程。"]}
{"word":"synchronous","summary":{"en":"Synchronous means happening at the same time or operating in real time (especially in communication/technology).","zh":"Synchronous 指“同时发生的/同步的”，也常指（沟通或技术上）“实时进行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; coordinated so actions occur together.","zh":"同时发生的；同步进行的；协调一致地一起进行的。"},"examples":[{"en":"The swimmers started in a synchronous dive.","zh":"游泳选手以同步跳水的方式一起入水。"},{"en":"We held a synchronous online meeting so everyone joined at the same time.","zh":"我们开了同步线上会议，让所有人同时加入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technology/communication) Working in real time, where sending and receiving happen immediately, not delayed.","zh":"（科技/沟通）实时的；即时交互的（不是延迟的、异步的）。"},"examples":[{"en":"Video calls are synchronous communication, unlike email.","zh":"视频通话是同步沟通，不像电子邮件那样是异步的。"},{"en":"The app uses synchronous updates, so you see changes instantly.","zh":"这个应用使用同步更新，所以你能立刻看到变化。"}]}],"synonyms":["simultaneous","coordinated","in sync","real-time"],"phonetic":"/ˈsɪŋkrənəs/","extraExplanation":["“synchronous”常与“asynchronous（异步的）”对比使用：同步=必须同时在线/同时发生；异步=不需要同一时间进行（如邮件、留言板）。","词根提示：syn- 表示“共同/一起”，chron- 表示“时间”（如 chronology 年代学、chronicle 编年史）。理解词根能帮助记忆：synchronous = “同一时间一起发生”。"]}
{"word":"synchronously","summary":{"en":"“Synchronously” means happening at the same time or in step; in tech, it often means operations that wait for completion before continuing.","zh":"“synchronously”表示“同时/同步地”；在技术语境中常指“需等待完成再继续”的同步执行方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"At the same time; in a way that happens together in time or in step with something else.","zh":"同步地；同时地；以时间上一起发生或步调一致的方式。"},"examples":[{"en":"The two dancers moved synchronously to the music.","zh":"两位舞者随着音乐同步地移动。"},{"en":"During the show, the lights changed synchronously with the beat.","zh":"演出时，灯光随着节拍同步变化。"},{"en":"The swimmers kicked synchronously to keep the rhythm.","zh":"游泳者同步踢腿以保持节奏。"}]},{"partOfSpeech":"adv.","definition":{"en":"In computing/engineering, in a way that requires waiting for a step to finish before the next step continues (blocking).","zh":"（计算机/工程）以同步方式；需要等待某一步完成后才能继续下一步（阻塞）的方式。"},"examples":[{"en":"The app loads data synchronously, so the screen may freeze for a moment.","zh":"这个应用以同步方式加载数据，所以屏幕可能会卡顿一下。"},{"en":"If you send the request synchronously, you must wait for the response.","zh":"如果你同步发送请求，就必须等待回应。"}]}],"synonyms":["simultaneously","in unison","in sync","together"],"phonetic":"/ˈsɪŋkrənəsli/","extraExplanation":["词源提示：synchronously 来自 synchronous（同步的）+ -ly（副词后缀）。核心概念是“同一时间/同一步调”。","常见对比：synchronously（同步地） vs. asynchronously（异步地）。异步通常表示不必等待，可先做别的事，之后再处理结果。","常见搭配：work/move/change synchronously（同步工作/移动/变化）；run/execute synchronously（同步运行/执行）。"]}
{"word":"synchrotron","summary":{"en":"A circular particle accelerator, often used to create powerful synchrotron light for research.","zh":"一种环形粒子加速器，常用于产生强大的同步辐射光供科研使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large machine that accelerates charged particles (like electrons or protons) to very high speeds in a circular path using magnets; the particles can be used for physics experiments or to produce intense light (synchrotron radiation) for research.","zh":"同步加速器：一种大型装置，利用磁铁让带电粒子（如电子、质子）在环形轨道中加速到极高速度；可用于粒子物理实验，或产生强光（同步辐射）用于科研。"},"examples":[{"en":"Scientists use a synchrotron to study the structure of proteins.","zh":"科学家用同步加速器来研究蛋白质的结构。"},{"en":"The museum collaborated with a synchrotron facility to analyze the pigments in an ancient painting.","zh":"博物馆与同步加速器设施合作，分析一幅古画中的颜料成分。"}]}],"synonyms":["particle accelerator","accelerator (general)"],"phonetic":"/ˈsɪŋkrəˌtrɑn/","extraExplanation":["“synchrotron”来自“synchro-（同步）+ -tron（装置）”。它的核心概念是：随着粒子能量增加，磁场强度等参数会“同步”调整，以保持粒子在同一条环形轨道上运行。","在很多新闻或科研语境里，“a synchrotron”常指“同步辐射光源设施”（比如用于材料、医学、生物、考古研究的强X射线光源），不只是做高能物理的加速器本体。"]}
{"word":"synclinal","summary":{"en":"Synclinal means ‘related to a syncline,’ a downward-bending fold in rock layers.","zh":"synclinal 指“与向斜有关”，即岩层向下弯曲的褶皱或构造。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a syncline; describing a fold or structure in rock layers that bends downward like a trough (with the youngest layers typically in the center).","zh":"与向斜有关的；形容岩层向下弯曲呈“槽状”的褶皱或地质构造（通常中心为较新的地层）。"},"examples":[{"en":"The geologist mapped a synclinal fold running across the valley.","zh":"地质学家绘制了穿过山谷的一条向斜褶皱。"},{"en":"Oil and gas can sometimes accumulate in synclinal structures if sealed properly.","zh":"如果封闭条件合适，油气有时会在向斜构造中聚集。"}]},{"partOfSpeech":"n.","definition":{"en":"A synclinal ridge or valley; a feature formed by synclinal folding (less common).","zh":"向斜形成的山脊或谷地；由向斜褶皱塑造的地貌（较少用）。"},"examples":[{"en":"The hike followed a long synclinal through layers of sandstone.","zh":"徒步路线沿着一条漫长的向斜地带穿行，周围是砂岩层。"}]}],"synonyms":["syncline-related","downfolded (in geology)","trough-like (of strata)"],"phonetic":"/sɪnˈklaɪnəl/","extraExplanation":["“synclinal”来自“syncline（向斜）”。在基础地质学里常与“anticlinal（背斜的）”成对出现：背斜像拱起的屋顶，向斜像下凹的槽。","实际写作中更常见的搭配是“synclinal fold / synclinal axis / synclinal structure”。日常英语很少用，多见于地质、地理与环境科学文章。"]}
{"word":"syncopal","summary":{"en":"“Syncopal” means “related to fainting (syncope),” commonly used in medical contexts (e.g., a syncopal episode).","zh":"syncopal 指“与晕厥/昏厥有关的”，多用于医学表达，如 syncopal episode（晕厥发作）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to syncope: a brief loss of consciousness (“fainting”) caused by a temporary drop in blood flow to the brain.","zh":"与“晕厥/昏厥（syncope）”有关的：因脑部暂时供血不足而出现的短暂意识丧失（昏倒）。"},"examples":[{"en":"The patient had a syncopal episode while standing in a hot room.","zh":"病人在闷热的房间里站着时发生了一次晕厥。"},{"en":"She was taken to the ER after a syncopal event at work.","zh":"她在工作时发生晕厥后被送到急诊。"},{"en":"The doctor asked about dizziness before the syncopal attack.","zh":"医生询问她在晕厥发作前是否有头晕。"}]}],"synonyms":["fainting-related","syncopy (rare)"],"phonetic":"/ˈsɪŋkəpəl/","extraExplanation":["“syncopal”主要用于医学语境，常见搭配有：syncopal episode/event（晕厥发作/事件）、syncopal attack（晕厥发作）。日常英语更常说：faint / fainting。","词源上与“syncope（晕厥）”同源，来自希腊语，原意有“切断/中断”的感觉，用来形容意识短暂“中断”。","注意区分：syncope（晕厥）≠ seizure（癫痫发作）≠ cardiac arrest（心脏骤停）。不过出现反复晕厥应及时就医评估原因（如脱水、低血压、心律问题等）。"]}
{"word":"syncopate","summary":{"en":"syncopate = to shift musical stress to weak/off-beats (and by extension, to shift expected timing for effect).","zh":"syncopate = （音乐）做切分：把重音移到弱拍/反拍；引申为为了效果错开预期的时机或强调点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(In music) to shift the normal beat by stressing weak beats or off-beats, creating a lively, unexpected rhythm.","zh":"（音乐）通过强调弱拍或切分音，把重音从常规强拍上移开，从而产生跳跃、出其不意的节奏感。"},"examples":[{"en":"Jazz musicians often syncopate the rhythm to make it swing.","zh":"爵士乐手常常用切分节奏让音乐更有律动（swing）。"},{"en":"Try clapping a steady beat while the melody syncopates on the off-beats.","zh":"试着先用手打出稳定节拍，而旋律在弱拍上做切分。"}]},{"partOfSpeech":"v.","definition":{"en":"(More general) to shift the expected timing or emphasis of something for effect.","zh":"（引申）为了效果而把某事的预期时机或强调点“错开/提前/延后”。"},"examples":[{"en":"The poet syncopates the line breaks to create tension.","zh":"诗人通过错开断行来制造紧张感。"},{"en":"The film’s editing syncopates quiet moments with sudden cuts.","zh":"影片剪辑把安静段落与突然切换交错，形成冲击。"}]}],"synonyms":["shift the beat","accent the off-beat","displace the accent","syncopation"],"phonetic":"/ˈsɪŋ.kə.peɪt/","extraExplanation":["“syncopate”常见于音乐学习语境，名词是“syncopation”（切分/切分节奏）。在流行、爵士、拉丁音乐里很常见：你会感觉节奏“卡在”不太预期的位置上。","记忆小提示：syn-（一起/组合）+ -cope（源自表示“切/敲”的词根）+ -ate（动词后缀），可以联想成“把节拍切开并重新组合”。"]}
{"word":"syncopation","summary":{"en":"Syncopation is the shifting of musical stress to off-beats; in language, it can mean shortening a word by omitting sounds.","zh":"Syncopation 常指音乐中的“切分节奏/重音错位”；在语言学里也可指“省音/缩略”（省去某些音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical technique that shifts the normal beat by stressing off-beats or weak beats, creating a lively, surprising rhythm.","zh":"（音乐）切分/切分节奏：把重音放在通常较弱或非重拍的位置上，产生跳跃、出其不意的节奏感。"},"examples":[{"en":"Jazz often uses syncopation to make the rhythm feel energetic and playful.","zh":"爵士乐常用切分节奏，让律动更有活力、更俏皮。"},{"en":"The pianist added syncopation, so the melody sounded like it was dancing around the beat.","zh":"钢琴家加入切分后，旋律听起来像在拍点周围跳舞。"},{"en":"In many pop songs, syncopation helps the chorus feel more catchy.","zh":"很多流行歌里，切分能让副歌更“洗脑”。"}]},{"partOfSpeech":"n.","definition":{"en":"In language and poetry, the shortening of a word by leaving out sounds or letters (often from the middle), especially in older or literary forms.","zh":"（语言/诗歌）省音/缩略：省去词中的某些音或字母（常在中间），多见于较古老或文学性的用法。"},"examples":[{"en":"Some older texts show syncopation in spellings like “ev’ry” for “every.”","zh":"一些旧文本会出现省音拼写，比如用“ev’ry”代替“every”。"},{"en":"Poets sometimes use syncopation to fit the rhythm of a line.","zh":"诗人有时会用省音来配合诗行的节奏。"}]}],"synonyms":["off-beat accent","rhythmic displacement","accent shift"],"phonetic":"/ˌsɪŋ.kəˈpeɪ.ʃən/","extraExplanation":["在音乐里，syncopation 常和“backbeat（强调第2和第4拍）”“off-beat（偏拍）”一起出现：它不只是“节奏快”，而是“重音位置出乎意料”。常见于爵士、放克（funk）、拉丁音乐、嘻哈等风格。","词源提示：syn-（一起/共同）+ copation（源自拉丁语，和“敲击/节拍”相关）。学习时可以把它记成“把拍点（beat）‘错开’来强调”。"]}
{"word":"syncope","summary":{"en":"Syncope most commonly means fainting (temporary loss of consciousness). In linguistics, it means dropping sounds from the middle of a word.","zh":"Syncope最常指“晕厥/昏厥”。在语言学中指“词中间语音脱落”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A temporary loss of consciousness, usually caused by a brief drop in blood flow to the brain; fainting.","zh":"（医学）短暂的意识丧失，通常因大脑供血短暂不足而发生；昏厥、晕厥。"},"examples":[{"en":"He experienced syncope after standing up too quickly.","zh":"他站起来太快后发生了晕厥。"},{"en":"The doctor asked whether she had chest pain before the syncope.","zh":"医生询问她在晕厥前是否有胸痛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Linguistics) The loss of one or more sounds (especially a vowel) from the middle of a word in speech over time.","zh":"（语言学）词中间一个或多个语音（尤其是元音）在口语或语言演变中脱落。"},"examples":[{"en":"In casual speech, “family” is sometimes pronounced like “fam-ly,” an example of syncope.","zh":"在随意口语里，“family”有时读成类似“fam-ly”，这就是一种音脱落（syncope）。"},{"en":"Historical syncope helped change some older word forms into modern ones.","zh":"历史上的中间音脱落促成了一些旧词形向现代词形的变化。"}]}],"synonyms":["fainting","faint","blackout","sound loss","vowel deletion"],"phonetic":"/ˈsɪŋ.kə.pi/","extraExplanation":["这个词有两个常见领域用法：医学里的“晕厥”和语言学里的“中音脱落”。写作或交流时，最好根据上下文明确领域，避免误解。","医学语境中常见搭配有：vasovagal syncope（血管迷走性晕厥）、cardiac syncope（心源性晕厥）、syncope episode（一次晕厥发作）。"]}
{"word":"syncretize","summary":{"en":"Syncretize means to blend different beliefs, ideas, or practices into a single system.","zh":"Syncretize 指把不同的信仰、观念或做法融合为一个体系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to combine different ideas, beliefs, or practices into one system; to make a synthesis from multiple traditions","zh":"把不同的思想、信仰或做法融合成一个体系；将多种传统综合为一体"},"examples":[{"en":"Over time, the festival syncretized local customs with imported religious rituals.","zh":"随着时间推移，这个节日把本地习俗与外来的宗教仪式融合在一起。"},{"en":"Some modern spiritual movements syncretize elements of Buddhism, Christianity, and psychology.","zh":"一些现代灵性运动会把佛教、基督教和心理学的元素融合在一起。"},{"en":"The novel shows how immigrant communities syncretize old traditions with new cultural norms.","zh":"这部小说展现了移民社群如何把旧传统与新的文化规范融合起来。"}]}],"synonyms":["blend","combine","integrate","merge","synthesize"],"phonetic":"/ˈsɪŋkrəˌtaɪz/","extraExplanation":["“syncretize”常用于宗教学、人类学、文化研究中，描述不同宗教或文化接触后发生的“融合/混合”（如民间信仰与官方宗教的结合）。","词源来自希腊语 synkretismos（意为“克里特人的联合/结盟”），后来引申为“把不同事物结合起来”。","语气通常偏中性、学术；在讨论文化挪用或权力关系时，也可能带有批评意味，取决于语境。"]}
{"word":"syncytial","summary":{"en":"Syncytial describes tissue made of fused cells with multiple nuclei, or (in medicine) tissue related to the placenta’s syncytiotrophoblast.","zh":"syncytial 指由细胞融合形成、含多核的合胞体组织；在医学语境中也常指与胎盘的合体滋养层相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a syncytium: a mass of cells that share cytoplasm and contain multiple nuclei, often formed when cells fuse together.","zh":"与“合胞体”有关的：指一团细胞共享细胞质、含有多个细胞核的结构，通常由细胞融合形成。"},"examples":[{"en":"Some viruses can cause syncytial changes in infected tissue.","zh":"一些病毒会在感染组织中引起合胞体样改变。"},{"en":"The report described syncytial cells under the microscope.","zh":"报告描述了显微镜下的合胞体细胞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In human development/medicine) Related to the syncytiotrophoblast, a layer of the placenta important for nutrient exchange between mother and fetus.","zh":"（人体发育/医学）与“合体滋养层”有关：指胎盘的一层结构，对母体与胎儿之间的营养交换很重要。"},"examples":[{"en":"Syncytial tissue in the placenta helps regulate exchange of substances.","zh":"胎盘中的合体滋养层组织有助于调控物质交换。"},{"en":"Doctors monitor syncytial function in certain pregnancy complications.","zh":"在某些妊娠并发症中，医生会监测合体滋养层的功能。"}]}],"synonyms":["multinucleated (in some contexts)","syncytium-forming (informal/technical)"],"phonetic":"/sɪnˈsɪʃəl/","extraExplanation":["词源提示：syncytial 来自 syn-（“一起”）+ cyt-（“细胞”）+ -ial（形容词后缀），字面含义接近“细胞连在一起的”。","使用场景：这是生物学、病理学、胚胎学等学科里的专业词，日常英语很少用。常见搭配包括 syncytial cells（合胞体细胞）、syncytial layer（合胞层）、syncytial formation（合胞体形成）。","易混点：syncytial（形容词）对应名词 syncytium（合胞体）。发音上也容易混，注意词尾 -tial 常读成 /ʃəl/。"]}
{"word":"syndicate","summary":{"en":"A syndicate is a group that works together (often businesses or banks), or a criminal organization; as a verb, it means to form such a group or to sell content for publication in many outlets.","zh":"syndicate 可指合作的联合体/财团，也可指犯罪集团；作动词可指结成联合体，或把内容授权给多家媒体刊登/播出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group (often of companies, banks, or journalists) that works together to handle a large task, share costs, or share rights.","zh":"（常指公司、银行或记者等组成的）联合体/财团；为完成大型任务、分担成本或共享权利而合作的团体。"},"examples":[{"en":"A syndicate of banks agreed to lend money for the new airport.","zh":"多家银行组成的银团同意为新机场提供贷款。"},{"en":"The newspaper belongs to a syndicate that shares articles with smaller papers.","zh":"这家报纸属于一个内容联合体，会把文章分享给较小的报社。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of people involved in organized crime, especially to control an illegal business.","zh":"（尤指控制非法生意的）犯罪集团；黑帮组织。"},"examples":[{"en":"Police said the gang was part of an international crime syndicate.","zh":"警方称该团伙是一个国际犯罪集团的一部分。"},{"en":"The novel follows a detective investigating a powerful syndicate.","zh":"这部小说讲述一名侦探调查一个势力强大的犯罪组织。"}]},{"partOfSpeech":"v.","definition":{"en":"To organize or combine people or organizations into a syndicate; also, to sell the rights to publish or broadcast (content) to multiple outlets.","zh":"使结成联合体；（也指）把（内容）的刊登/播出权卖给多家媒体进行“辛迪加发行/联播”。"},"examples":[{"en":"The loan was syndicated among several lenders to reduce risk.","zh":"这笔贷款由多个放贷方组成银团来分散风险。"},{"en":"Her comic strip was syndicated and appeared in hundreds of newspapers.","zh":"她的连环漫画被辛迪加发行，在数百家报纸上刊登。"}]}],"synonyms":["consortium","alliance","coalition","cartel","ring","combine"],"phonetic":"/ˈsɪndɪkət/","extraExplanation":["“syndicate”既可以是中性/正面的（如银行银团、新闻稿件联合供稿），也可以带强烈负面含义（crime syndicate 犯罪集团）。判断褒贬主要看上下文。","在媒体领域，“syndicated column/show”指同一专栏或节目被多家媒体同时购买并刊登/播出；在金融领域，“syndicated loan”是银团贷款，常用于金额很大的项目融资。"]}
{"word":"syndicated","summary":{"en":"“Syndicated” usually means content is licensed to many media outlets; in finance, it means a large loan shared by multiple lenders.","zh":"“syndicated”常指内容被授权给多家媒体联合刊登/播出；在金融中指由多家贷款方共同承担的大额银团贷款。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a TV/radio show, newspaper column, comic strip, etc.) sold or licensed to be used by many different newspapers, stations, or websites at the same time.","zh":"（指电视/广播节目、报刊专栏、连环漫画等）被出售或授权给多家媒体同时刊登/播出；联合发行的。"},"examples":[{"en":"Her advice column is syndicated in more than 200 newspapers.","zh":"她的咨询专栏在200多家报纸上联合刊登。"},{"en":"We watched a syndicated rerun of the sitcom after school.","zh":"放学后我们看了一集这部情景喜剧的联合播出重播。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In finance) funded or arranged by a group of banks or lenders that share the risk, especially for a very large loan.","zh":"（金融）由多家银行/贷款方共同提供或安排的（通常用于大额贷款），分摊风险的。"},"examples":[{"en":"The company took out a syndicated loan to finance the new factory.","zh":"公司申请了一笔银团贷款来为新工厂融资。"},{"en":"The deal was supported by several lenders through a syndicated facility.","zh":"这笔交易通过银团授信获得了多家贷款方支持。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “syndicate”: to sell or provide content to many outlets, or to organize something (like a loan) through a group.","zh":"“syndicate”的过去式/过去分词：把内容授权给多家平台，或通过一个团体（如多家银行）来组织安排（如贷款）。"},"examples":[{"en":"The series was syndicated internationally within a year.","zh":"这部剧在一年内就实现了国际联合发行。"},{"en":"The loan was syndicated among five banks.","zh":"这笔贷款由五家银行组成银团来分担。"}]}],"synonyms":["distributed","licensed","broadcast","rerun","pooled","shared"],"phonetic":"/ˈsɪndɪˌkeɪtɪd/","extraExplanation":["“syndicated”在媒体语境里很常见：一份内容（例如专栏、节目）不是只在一家媒体独家发布，而是授权给很多家同时使用，因此常和“rerun（重播）”“column（专栏）”“show（节目）”一起出现。","在金融语境里常见搭配是“syndicated loan（银团贷款）”，强调多家机构一起出资、共同承担风险。"]}
{"word":"syndrom","summary":{"en":"Syndrome means a group of symptoms (or related behaviors/feelings) that tend to occur together.","zh":"Syndrome 指常一起出现的一组症状（或引申为一组相关的行为/感受）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of symptoms (signs of illness or condition) that often happen together and show a particular disease or medical condition","zh":"（医学）综合征：一组经常一起出现的症状或体征，提示某种疾病或状态"},"examples":[{"en":"Down syndrome is a genetic condition that affects development.","zh":"唐氏综合征是一种影响发育的遗传性状况。"},{"en":"The doctor recognized a syndrome based on the pattern of symptoms.","zh":"医生根据症状组合识别出一种综合征。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) a typical group of feelings, behaviors, or problems that often appear together in a certain situation","zh":"（引申）一组常一起出现的感受、行为或问题（常指某种情境下的典型模式）"},"examples":[{"en":"Some people experience ‘impostor syndrome’ at work.","zh":"有些人在工作中会经历“冒名顶替综合征/冒充者综合征”。"},{"en":"He joked about having ‘Monday syndrome’ because he felt tired every Monday.","zh":"他开玩笑说自己有“周一综合征”，因为每到周一就很疲惫。"}]}],"synonyms":["condition","disorder","set of symptoms","pattern"],"phonetic":"/ˈsɪnˌdroʊm/","extraExplanation":["你输入的“syndrom”通常是拼写错误；标准拼写是 **syndrome**。","词源上来自希腊语，含义接近“共同出现/一起跑来”，所以用来指“成套出现的一组症状或特征”。","在日常英语里，像 *impostor syndrome* 这类说法很常见；它不一定是严格医学诊断，更多是描述一种普遍体验。"]}
{"word":"syndrome","summary":{"en":"A syndrome is a set of symptoms or problems that appear together, especially in medicine.","zh":"syndrome 指经常一起出现的一组症状或问题，尤指医学上的“综合征”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of symptoms or signs that often happen together and show a particular medical condition","zh":"（医学）综合征：经常一起出现的一组症状或体征，提示某种特定疾病或健康状况"},"examples":[{"en":"Doctors diagnosed her with irritable bowel syndrome (IBS).","zh":"医生诊断她患有肠易激综合征（IBS）。"},{"en":"Down syndrome is caused by an extra copy of a chromosome.","zh":"唐氏综合征是由多出一条染色体引起的。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of related behaviors, feelings, or problems that are seen together (often used in psychology or everyday speech)","zh":"（引申）一组相关的行为、感受或问题（常用于心理学或日常表达中）"},"examples":[{"en":"Some people describe feeling nervous in public as a kind of 'impostor syndrome.'","zh":"有些人把在公众场合感到紧张称为一种“冒名顶替综合征”。"},{"en":"After the mistake, he had a classic 'fear of failure' syndrome at work.","zh":"犯错之后，他在工作中出现了典型的“害怕失败综合征”。"}]}],"synonyms":["condition","disorder","set of symptoms","cluster"],"phonetic":"/ˈsɪnˌdroʊm/","extraExplanation":["词源提示：syndrome 来自希腊语 syn-（一起）+ dromos（奔跑），字面意思像“共同出现”。因此它强调“多种表现同时出现的一套模式”，而不一定指单一原因。","用法提醒：医学上 syndrome 通常指“症状组合”，可能有多种原因；而 disease（疾病）更强调明确的病理过程或原因。日常表达里一些“X syndrome”（如 impostor syndrome）并非正式医学诊断，更多是描述一种常见心理体验。"]}
{"word":"synecdoche","summary":{"en":"Synecdoche is a figure of speech where a part stands for the whole (or the whole for a part).","zh":"Synecdoche（提喻）是一种修辞：用部分指代整体，或用整体指代部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A figure of speech in which a part of something is used to refer to the whole, or the whole is used to refer to a part.","zh":"一种修辞手法：用部分指代整体，或用整体指代部分。"},"examples":[{"en":"In “All hands on deck,” “hands” means the sailors (the whole people).","zh":"在“全员到甲板上（All hands on deck）”里，“hands（手）”指的是水手（整体的人）。"},{"en":"The phrase “new wheels” can mean a new car.","zh":"短语“new wheels（新轮子）”可以指一辆新车。"}]}],"synonyms":["figure of speech","trope","pars pro toto","totum pro parte"],"phonetic":"/sɪˈnɛkdəki/","extraExplanation":["“synecdoche”的常见对比词是“metonymy（转喻）”。两者都用A来指代B，但侧重点不同：synecdoche强调“部分-整体”关系（part–whole），比如“wheels=car”；metonymy强调“密切关联”但不一定是部分整体关系，比如“the White House=美国政府/白宫方面”。","发音小提示：重音通常在第二个音节（-NEC-）。","文学与演讲中常见：例如用“crown（王冠）”指代“君主制/王权”（有时也可视为转喻，取决于语境）。判断时看它是否真的是整体的一部分。"]}
{"word":"synergic","summary":{"en":"Synergic means working together in a way that creates a stronger combined result (synergy).","zh":"Synergic 指“协同的”：通过配合产生更强的整体效果（协同效应）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Working well together so the combined effect is greater than the sum of each part alone; producing synergy.","zh":"协同的；互相配合的，使整体效果大于各部分简单相加（产生“协同效应”）。"},"examples":[{"en":"The team took a synergic approach, combining design and engineering from day one.","zh":"团队采用协同的方法，从第一天起就把设计和工程结合起来。"},{"en":"These two medicines can have a synergic effect, so the doctor adjusted the dose carefully.","zh":"这两种药可能产生协同效应，所以医生谨慎地调整了剂量。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to cooperation between people, groups, or systems to achieve better results together.","zh":"与合作/协作有关的；强调通过人、团队或系统配合来达成更好结果的。"},"examples":[{"en":"A synergic partnership helped the small company enter new markets.","zh":"一次协同合作帮助这家小公司进入了新市场。"},{"en":"Teachers and parents need a synergic relationship to support students.","zh":"老师和家长需要协同关系来支持学生。"}]}],"synonyms":["synergistic","cooperative","collaborative","mutually reinforcing"],"phonetic":"/sɪˈnɝːdʒɪk/","extraExplanation":["“synergic”在日常英语里不如“synergistic”常见；很多情况下你会看到（也更推荐使用）“synergistic effect / synergistic relationship”。两者意思基本相同，只是“synergistic”更常用、更自然。","词源来自希腊语：syn-（一起）+ ergon（工作），核心概念是“一起工作产生更强效果”。","常见搭配：synergic/synergistic effect（协同效应）、synergic/synergistic relationship（协同关系）、synergy（名词：协同；协同效应）。"]}
{"word":"synergism","summary":{"en":"Synergism means a cooperative interaction that creates a stronger-than-expected combined effect.","zh":"Synergism 指“协同作用/协同效应”，即合作性相互作用使总体效果强于预期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The interaction of two or more things (such as people, drugs, or forces) that produces a combined effect greater than the sum of their separate effects.","zh":"（协同作用）两种或多种事物（如人、药物、力量）相互作用，产生的总体效果大于各自效果之和。"},"examples":[{"en":"Good teamwork creates synergism: the group solves problems faster than any one person alone.","zh":"良好的团队合作会产生协同作用：团队解决问题比任何一个人单独做都更快。"},{"en":"Doctors warned that taking those two medicines together could cause dangerous synergism.","zh":"医生警告说，那两种药一起服用可能会产生危险的协同作用。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/ecology, a relationship in which interacting organisms or factors increase each other’s effectiveness or survival.","zh":"（生物/生态）相互作用的生物或因素彼此增强对方的效能或生存能力的关系。"},"examples":[{"en":"The pollinator and the plant show synergism: each benefits from the other’s activity.","zh":"传粉者与植物表现出协同关系：双方都从对方的活动中获益。"},{"en":"Researchers found synergism between diet and exercise in improving heart health.","zh":"研究人员发现，饮食和运动在改善心脏健康方面存在协同作用。"}]}],"synonyms":["synergy","cooperation","collaboration","mutual reinforcement","combined effect"],"phonetic":"/ˈsɪnərˌdʒɪzəm/","extraExplanation":["“Synergism”常见于科学与商业写作，比日常口语更正式。口语里更常说“synergy”（协同效应）或“work well together”（配合得很好）。","词源来自希腊语“syn-”（一起）+ “ergon”（工作），字面意思是“一起工作”。","与“additive effect（相加效应）”对比：additive 只是1+1=2；synergism 强调1+1>2。也可对比“antagonism（拮抗作用）”，表示相互抵消或产生相反效果。"]}
{"word":"synergist","summary":{"en":"A synergist is someone who helps people or parts work together to create a stronger combined result.","zh":"synergist 指促成协同的人，帮助不同的人或部分更好地配合，产生更强的整体效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works with others so that the combined effort produces a better result than each person working alone.","zh":"协同者；协作促成者（与他人合作，使整体效果大于各自单独努力之和的人）。"},"examples":[{"en":"As a synergist, she connects the designers and engineers so the product feels both beautiful and practical.","zh":"作为协同者，她把设计师和工程师连接起来，让产品既美观又实用。"},{"en":"The coach acted as a synergist, helping the players use their different strengths as one team.","zh":"教练扮演了协同者的角色，帮助队员把不同优势凝聚成一个团队。"}]}],"synonyms":["facilitator","collaborator","integrator","coordinator"],"phonetic":"/ˈsɪnɚdʒɪst/","extraExplanation":["“synergist”来自“synergy（协同作用）”，常见于商业、科研、医疗或团队管理语境，强调“整合资源/专长”带来“1+1>2”的效果。","近义词提示：facilitator（促进者，偏“推动过程”）、collaborator（合作者，偏“共同参与”）、integrator（整合者，偏“把部分合成整体”）。语气上“synergist”更强调“产生协同效应”。","词形提示：synergistic（adj. 协同的）；synergize（v. 使协同/产生协同效应）。"]}
{"word":"synergistic","summary":{"en":"Synergistic describes cooperation that produces an extra-strong result—better than working separately.","zh":"Synergistic指协同合作产生额外增益的效果，即比各自单独做更好（1+1>2）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Working together in a way that creates a stronger or better result than each part could achieve alone.","zh":"协同的；产生“1+1>2”效果的（各部分合作后带来比单独更强/更好的结果）。"},"examples":[{"en":"The marketing and design teams took a synergistic approach to the product launch.","zh":"市场和设计团队用协同的方式推进产品发布。"},{"en":"Their skills are synergistic: her planning and his creativity make the project stronger.","zh":"他们的技能很协同：她擅长规划，他富有创意，让项目更强。"}]}],"synonyms":["collaborative","cooperative","complementary"],"phonetic":"/ˌsɪnərˈdʒɪstɪk/","extraExplanation":["“synergistic”来自“synergy（协同效应）”，常用于商业、团队合作、科技、医学等语境，强调合作带来的额外增益（常说“the whole is greater than the sum of its parts”）。","常见搭配：synergistic effect（协同效应）、synergistic relationship/partnership（协同关系/合作）、work synergistically（协同合作）、highly synergistic（高度协同）。","易混词：\n- cooperative（合作的）：强调愿意合作，不一定产生额外增益。\n- complementary（互补的）：强调“互相补足”，常常也能带来协同，但重点在“互补”。"]}
{"word":"synergy","summary":{"en":"Synergy means a stronger, better result produced by working together than by working separately.","zh":"Synergy 指“协同效应”：一起合作带来的结果比单独行动更好、更强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The extra power, benefit, or success you get when people or things work well together (so the result is better than each part alone).","zh":"协同效应；协同作用（指人或事物配合后产生的效果比各自单独相加更好）。"},"examples":[{"en":"There’s great synergy between the design team and the engineers.","zh":"设计团队和工程师之间有很强的协同效应。"},{"en":"The new partnership created synergy and helped both companies grow faster.","zh":"新的合作产生了协同效应，帮助两家公司更快增长。"},{"en":"We’re looking for synergy across departments, not competition.","zh":"我们希望各部门协同合作，而不是彼此竞争。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/medicine, the combined effect of two drugs or influences that is stronger than their separate effects.","zh":"（生物/医学）协同作用（两种药物或因素合用产生的效果强于各自单独作用）。"},"examples":[{"en":"These two medicines can have a synergy that improves pain relief.","zh":"这两种药物可能产生协同作用，从而更好地缓解疼痛。"}]}],"synonyms":["cooperation","collaboration","coordination","teamwork"],"phonetic":"/ˈsɪnərdʒi/","extraExplanation":["词源来自希腊语：syn-（一起）+ ergon（工作），字面意思是“共同工作”。","常见搭配：create/achieve synergy（创造/实现协同效应）, synergy between A and B（A与B之间的协同）, team synergy（团队协同）。","语域提示：synergy 在商业与职场语境中很常见，有时会被当作“管理术语/流行语（buzzword）”。在正式写作中最好配合具体内容说明“协同”体现在哪里。"]}
{"word":"syngeneic","summary":{"en":"Syngeneic describes something (especially a transplant or research model) involving genetically identical individuals.","zh":"syngeneic 指“同基因的”，常用于描述发生在基因相同个体之间的移植或研究模型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Genetically identical or nearly identical; coming from the same genetic background (often used for cells, tissues, or organisms).","zh":"（生物/医学）同基因的；遗传背景相同或几乎相同的（常用于细胞、组织或个体）。"},"examples":[{"en":"Syngeneic mice are used in experiments to reduce immune rejection.","zh":"同基因小鼠常用于实验，以减少免疫排斥反应。"},{"en":"The researchers performed a syngeneic tumor transplant model.","zh":"研究人员进行了同基因肿瘤移植模型。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving a transplant or interaction between genetically identical individuals of the same species.","zh":"（多指移植/相互作用）发生在同一物种且基因相同个体之间的。"},"examples":[{"en":"A syngeneic transplant typically avoids graft-versus-host disease.","zh":"同基因移植通常可避免移植物抗宿主病。"},{"en":"They compared syngeneic and allogeneic transplantation outcomes.","zh":"他们比较了同基因移植与异基因移植的结果。"}]}],"synonyms":["genetically identical","isogenic (near-synonym in lab contexts)"],"phonetic":"/ˌsɪn.dʒəˈniː.ɪk/","extraExplanation":["词源提示：syngeneic 来自 syn-（“共同、一起”）+ gene（“基因”）+ -ic（形容词后缀），字面意思是“基因在一起/共同的”。","常见对比词：allogeneic（异基因的，来自同种但基因不同个体）；autologous（自体的，来自同一个体）；xenogeneic（异种的，来自不同物种）。","使用场景：在免疫学与肿瘤学里很常见，例如“syngeneic mouse model（同基因小鼠模型）”用于研究肿瘤与免疫系统的相互作用。"]}
{"word":"synn","summary":{"en":"“synn” is usually a nonstandard spelling (often meaning “syn” = synonym) or a stylized name; it’s not a common dictionary word.","zh":"“synn”通常是不规范拼写（常指“syn”=synonym 同义词）或风格化名字；不是常见的词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling people sometimes use online for “syn” (short for “synonym”), or a stylized name/username. It is not a common standard English word.","zh":"一种不规范的拼写，有时在网络上用作“syn”（“synonym”的缩写，意为“同义词”）的变体，或作为风格化的人名/用户名。它不是常见的标准英语单词。"},"examples":[{"en":"In my notes, I wrote “synn” by mistake, but I meant “syn” for synonym.","zh":"我在笔记里不小心写了“synn”，但我想写的是表示“同义词”的“syn”。"},{"en":"Her username online is “Synn,” but it doesn’t have a dictionary meaning.","zh":"她的网名是“Synn”，但它没有词典里的固定含义。"}]}],"synonyms":["syn (abbr.)"],"phonetic":"/sɪn/","extraExplanation":["“synn”在标准英语词典里通常查不到。如果你想查的是：\n1）syn：常见于词典/笔记里的缩写，表示“synonym（同义词）”。\n2）sin：意为“罪/罪过”。发音可能与“synn”相同（/sɪn/）。\n3）Synn：可能是人名、姓氏或品牌名，需要具体上下文（句子/领域）才能解释更准确。"]}
{"word":"synod","summary":{"en":"A synod is a formal church council or assembly where leaders meet to discuss and decide religious or administrative issues.","zh":"synod 指教会的正式会议或议会，教会领袖在其中讨论并决定宗教或行政事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal meeting or council of church leaders (especially bishops) to discuss and decide church matters.","zh":"（尤指主教等）教会领袖的正式会议/宗教会议，用来讨论并决定教会事务。"},"examples":[{"en":"The bishop attended a synod to discuss church reforms.","zh":"主教参加了一次宗教会议，讨论教会改革。"},{"en":"At the synod, leaders voted on a new policy for local parishes.","zh":"在宗教会议上，领袖们就一项针对地方堂区的新政策进行表决。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian traditions, a governing body or assembly of a church (for example, at a regional or national level).","zh":"在某些基督教传统中，指教会的管理机构/议会（如地区或全国层级的教会大会）。"},"examples":[{"en":"The Lutheran synod oversees schools and missions in the region.","zh":"该路德宗教会大会负责该地区的学校和宣教事务。"}]}],"synonyms":["council","assembly","convention"],"phonetic":"/ˈsɪn.əd/","extraExplanation":["词源：synod 来自希腊语 synodos，意为“聚会、集会”，字面上可理解为“共同走在一条路上的人”。","用法提示：synod 常见于基督宗教语境；在天主教、东正教、圣公会及部分新教传统中都可能出现，但具体权力与结构因宗派而异。","相关词：synodal（adj. 宗教会议的）；Synod of Bishops（天主教“世界主教会议”）。"]}
{"word":"synonym","summary":{"en":"A synonym is a word or phrase with the same or nearly the same meaning as another word.","zh":"synonym 指与另一个词意思相同或几乎相同的词或短语（同义词/近义表达）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word (or phrase) that has the same or nearly the same meaning as another word in the same language.","zh":"（同一语言中）与另一个词意思相同或几乎相同的词（或短语）。"},"examples":[{"en":"“Big” is a synonym of “large.”","zh":"big 是 large 的同义词。"},{"en":"In writing, using synonyms can help you avoid repeating the same word too many times.","zh":"写作时，使用同义词可以避免同一个词重复太多次。"},{"en":"“Begin” and “start” are near-synonyms, but they don’t match in every situation.","zh":"begin 和 start 是近义词，但并非所有场景都能完全互换。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the same or nearly the same meaning; equivalent in meaning.","zh":"（意义上）相同或几乎相同的；同义的。"},"examples":[{"en":"For many people, “home” is synonymous with “comfort.”","zh":"对许多人来说，home 几乎等同于 comfort（“家”与“舒适”同义/同义相当）。"},{"en":"In everyday speech, “cheap” is sometimes synonymous with “low-cost,” but it can also mean “poor quality.”","zh":"在日常口语中，cheap 有时等同于 low-cost（低成本），但它也可能表示“质量差”。"}]}],"synonyms":["equivalent","near-synonym","substitute word","alternate word"],"phonetic":"/ˈsɪnəˌnɪm/","extraExplanation":["“synonym”常用于学习词汇与写作：通过同义替换让表达更自然，但要注意语气（formal/informal）、搭配（collocation）和含义范围（如“child”与“kid”语气不同）。","区分：synonym（同义词） vs. antonym（反义词）；“near-synonym”表示“近义词”，意思接近但不能在所有语境互换。","词源：来自希腊语 syn-（一起）+ onoma（名字），字面意思是“同名/同一个名字”。"]}
{"word":"synonymic","summary":{"en":"Synonymic means “having the same or nearly the same meaning,” or “related to synonyms,” and is less common than synonymous.","zh":"synonymic表示“同义的”或“与同义词有关的”，但比synonymous更少见，常见于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of words or expressions) having the same or nearly the same meaning; synonymous.","zh":"（指词语或表达）意思相同或几乎相同的；同义的。"},"examples":[{"en":"In this context, “big” and “large” are synonymic.","zh":"在这个语境里，“big”和“large”是同义的。"},{"en":"The translator chose a synonymic phrase to keep the tone natural.","zh":"译者选用了一个同义短语，让语气更自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving synonyms (especially in linguistics or dictionary work).","zh":"与同义词有关的；涉及同义词的（尤用于语言学或词典编写）。"},"examples":[{"en":"The paper includes a synonymic analysis of key terms.","zh":"这篇论文包含对关键词的同义关系分析。"},{"en":"A synonymic dictionary groups words by meaning.","zh":"同义词词典按意义把词语归类。"}]}],"synonyms":["synonymous","equivalent (in meaning)","near-synonymous"],"phonetic":"/ˌsɪnəˈnɪmɪk/","extraExplanation":["“synonymic”在日常英语中比较少见，更常用的是“synonymous”。两者意思很接近，但“synonymic”更容易出现在语言学、词典学等偏学术的语境中。","词形小提示：synonym（同义词，名词）→ synonymy（同义关系，名词）→ synonymic / synonymous（同义的，形容词）。"]}
{"word":"synonymity","summary":{"en":"Synonymity means the state or relationship of being synonymous (having the same or nearly the same meaning). It’s less common than “synonymy.”","zh":"Synonymity 指“同义性/同义关系”，即词语意义相同或近似的关系；它比 synonymy 更少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being synonymous; a synonym relationship between words or expressions","zh":"同义性；（词语之间的）同义关系"},"examples":[{"en":"In many dictionaries, synonymity is shown through synonym lists.","zh":"在许多词典中，同义性会通过同义词列表呈现出来。"},{"en":"The synonymity of “big” and “large” is strong, but they are not always interchangeable.","zh":"“big”和“large”的同义性很强，但并不总能互换使用。"}]},{"partOfSpeech":"n.","definition":{"en":"the use or presence of synonyms in language, writing, or a particular text","zh":"（在语言或文本中的）同义词使用现象；同义表达的存在"},"examples":[{"en":"Academic writing sometimes avoids too much synonymity to keep terms consistent.","zh":"学术写作有时会避免过多的同义词堆叠，以保持术语一致。"},{"en":"Poetry may increase synonymity to create rhythm and emphasis.","zh":"诗歌可能会增加同义表达，以营造节奏与强调。"}]}],"synonyms":["synonymy","equivalence (in meaning)","near-synonymy"],"phonetic":"/ˌsɪnəˈnɪməti/","extraExplanation":["“synonymity”在现代英语中相对少见，更常用的对应名词是“synonymy”（同义关系/同义现象）。在语言学或词典学的语境里，你更容易看到“synonymy”。","注意区分：synonymous（形容词：同义的）→ synonymy / synonymity（名词：同义关系）。"]}
{"word":"synonymous","summary":{"en":"Synonymous means “having the same meaning,” or more broadly “closely associated with” something.","zh":"Synonymous 表示“同义的”，也可泛指“几乎等同、紧密相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same or nearly the same meaning as another word or phrase.","zh":"与另一个词或短语意思相同或几乎相同的。"},"examples":[{"en":"“Big” and “large” are often synonymous in everyday English.","zh":"在日常英语中，“big”和“large”常常是同义的。"},{"en":"In this context, “purchase” is synonymous with “buy.”","zh":"在这个语境里，“purchase”与“buy”同义。"}]},{"partOfSpeech":"adj.","definition":{"en":"Closely associated with something; commonly linked in people’s minds.","zh":"与某事物紧密相关；在人们印象中几乎等同或总被联系在一起的。"},"examples":[{"en":"For many people, Paris is synonymous with romance.","zh":"对许多人来说，巴黎几乎就是浪漫的代名词。"},{"en":"His name became synonymous with excellent customer service.","zh":"他的名字成了优质客户服务的代名词。"}]}],"synonyms":["equivalent","similar","interchangeable","comparable","akin"],"phonetic":"/səˈnɑnəməs/","extraExplanation":["“synonymous”常见搭配是“be synonymous with…（与……同义/等同）”。注意：完全同义的情况并不多，很多词只是“近义”，在语气、正式程度或使用场景上会有差别（例如：child vs. kid）。","词源上来自希腊语：syn-（一起）+ onoma（名字），字面意思是“同名的”，引申为“同义的”。"]}
{"word":"synonymously","summary":{"en":"“Synonymously” means “as synonyms; treating two words or ideas as having the same meaning.”","zh":"“synonymously”表示“作为同义词地使用；把两个词或概念当作意义相同来对待”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses a synonym; as another word with the same or nearly the same meaning.","zh":"以同义词的方式；用意思相同或相近的另一个词来表达。"},"examples":[{"en":"In this article, “kids” and “children” are used synonymously.","zh":"在这篇文章里，“kids”和“children”被当作同义词交替使用。"},{"en":"Some people use “anxious” and “eager” synonymously, but careful writing can separate them.","zh":"有些人把“anxious”和“eager”当同义词用，但严谨写作会把它们区分开。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that treats two things as equivalent or interchangeable (often in discussion or writing).","zh":"以等同或可互换的方式（常用于讨论或写作中，把两者当成一回事）。"},"examples":[{"en":"The terms are sometimes used synonymously in everyday speech, even if experts disagree.","zh":"这些术语在日常口语中有时会被等同使用，尽管专家并不认同。"},{"en":"Don’t use “price” and “value” synonymously in business contexts.","zh":"在商业语境中不要把“price（价格）”和“value（价值）”等同使用。"}]}],"synonyms":["interchangeably","equivalently","as synonyms"],"phonetic":"/sɪˈnɑnəməsli/","extraExplanation":["“synonymously”多用于写作/学术语境，常见搭配是：be used synonymously with…（与……同义使用）、use A and B synonymously（把A和B当同义词用）。","注意它并不表示“同时/一起”，而是强调“当作同义或等同来用”。口语里有时会用“interchangeably（可互换地）”来表达相近意思。"]}
{"word":"synopses","summary":{"en":"“Synopses” means several brief overviews of the main points of something.","zh":"“synopses”指多个“概要/梗概”，用来简要概括主要内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “synopsis”: short summaries that give the main points of something (such as a story, article, movie, or plan).","zh":"“synopsis”的复数：简要概述，概括某个作品或计划的主要内容（如故事、文章、电影或方案）。"},"examples":[{"en":"Please submit synopses of the three articles before class.","zh":"请在上课前提交那三篇文章的概要。"},{"en":"The publisher asked for synopses of each chapter.","zh":"出版社要求提供每一章的内容提要。"}]}],"synonyms":["summaries","overviews","outlines","abstracts"],"phonetic":"/sɪˈnɑːpsiz/","extraExplanation":["“synopses”是“synopsis”的不规则复数形式（-is 结尾常变为 -es），类似：analysis → analyses，crisis → crises。","词源来自希腊语，含义是“共同看/总览”，所以它强调“把要点放在一起快速看懂”。","在学术与出版语境中，synopsis 通常比 summary 更偏“结构化、覆盖全篇要点”的概要（如章节梗概、剧情梗概）。"]}
{"word":"synopsis","summary":{"en":"A synopsis is a brief, often formal, overview of the main points of a story, book, film, or document.","zh":"synopsis 指对故事、书影音或文档要点的简短（常较正式）概述/梗概。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short summary that gives the main points of a story, book, film, play, or plan.","zh":"（故事、书、电影、戏剧或计划的）梗概；简介；概要。"},"examples":[{"en":"Can you give me a brief synopsis of the movie before we watch it?","zh":"在我们看电影前，你能给我一个简短的剧情梗概吗？"},{"en":"The back cover includes a synopsis of the novel.","zh":"封底上有这本小说的内容简介。"},{"en":"Please attach a one-page synopsis of your research project.","zh":"请附上一页的研究项目概要。"}]},{"partOfSpeech":"n.","definition":{"en":"A condensed outline used in academic or professional writing to present key ideas quickly.","zh":"（学术或专业写作中的）提要；要点式概述，用于快速呈现核心内容。"},"examples":[{"en":"The professor asked for a synopsis of each chapter.","zh":"教授要求每章写一个提要。"},{"en":"Her report begins with a synopsis of the main findings.","zh":"她的报告以主要发现的概述开头。"}]}],"synonyms":["summary","overview","outline","abstract","brief"],"phonetic":"/səˈnɑːp.sɪs/","extraExplanation":["“synopsis”常见于书影音的剧情简介、论文/报告的提要。语气比“summary”更正式一些，也更强调“提纲式的浓缩概述”。","词源来自希腊语，含义接近“看在一起/一览”（syn- 表示“共同”，-opsis 表示“看”），因此有“把要点放在一起给你一眼看懂”的感觉。"]}
{"word":"synopsise","summary":{"en":"Synopsis means a short summary of the main points of something (often a book or movie).","zh":"synopsis 指对某事（常见于书或电影）的要点进行简短概括的“梗概/摘要”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short summary of a book, movie, speech, article, or event that gives the main points.","zh":"（书、电影、演讲、文章或事件的）简要概要，梗概，内容摘要。"},"examples":[{"en":"The back cover includes a brief synopsis of the novel.","zh":"封底上有这本小说的简要梗概。"},{"en":"Can you give me a quick synopsis of the plot?","zh":"你能快速给我概括一下剧情吗？"},{"en":"Her synopsis highlighted the key findings of the report.","zh":"她的摘要突出了报告的关键发现。"}]}],"synonyms":["summary","outline","overview","abstract","brief"],"phonetic":"/sɪˈnɑːp.sɪs/","extraExplanation":["你输入的“synopsise”通常是拼写错误；标准拼写是“synopsis”（名词）。复数是“synopses”（发音不同，结尾像“seez”）。","“synopsis”常用于写作与学术场景，指“把主要信息浓缩在一起”的摘要；在电影/小说语境中也常指“剧情简介”。"]}
{"word":"synoptic","summary":{"en":"Synoptic means “providing an overview or summary,” and it’s also used in meteorology for large-scale weather patterns.","zh":"Synoptic 指“概述性的/综述的”，也可用于气象学表示“大范围的天气形势”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving a short, clear overview of something; summarizing the main points.","zh":"（对内容）概述性的；提纲挈领的；综述的"},"examples":[{"en":"The report includes a synoptic overview of the year’s results.","zh":"这份报告包含对全年成果的概述。"},{"en":"She wrote a synoptic summary of the novel for her class.","zh":"她为课堂写了这本小说的概述。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Weather) Describing the overall weather pattern in a large area, often shown on maps.","zh":"（气象）天气形势的；天气综观的（常指大范围、在天气图上展示）"},"examples":[{"en":"The meteorologist explained the synoptic situation over the Pacific.","zh":"气象学家解释了太平洋上空的天气形势。"},{"en":"Synoptic charts help predict where storms may move.","zh":"天气形势图有助于预测风暴可能的移动路径。"}]}],"synonyms":["summary","overview","concise","outline","general","panoramic"],"phonetic":"/sɪˈnɑptɪk/","extraExplanation":["词源提示：synoptic 来自希腊语 syn-（一起）+ optic（看），字面意思接近“把整体一起看”。因此它常用于“总览/综述”的语境。","常见搭配：synoptic overview / synoptic summary（概述）；synoptic chart（天气形势图）。","相关词对比：synopsis（n. 内容提要/简介）是名词；synoptic（adj. 概述性的）是形容词。","在宗教与文学研究中也常见：the Synoptic Gospels（《对观福音》：马太、马可、路加），因三者内容结构相近，便于“对照观看”。"]}
{"word":"synostosis","summary":{"en":"Synostosis means two bones fuse together, sometimes abnormally (especially in the skull) or surgically.","zh":"Synostosis 指两块骨头发生融合，可为异常情况（常见于颅骨）或手术造成的融合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal or surgical joining (fusion) of two bones that are normally separate.","zh":"两块通常应分开的骨头异常或通过手术发生的“骨性融合/骨性连结”。"},"examples":[{"en":"Cranial synostosis can change the shape of a baby’s head.","zh":"颅骨骨性融合可能会改变婴儿头部的形状。"},{"en":"The doctor explained that the wrist pain was caused by a synostosis between two small bones.","zh":"医生解释说，手腕疼痛是由两块小骨之间的骨性融合引起的。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific condition in which certain skull sutures fuse too early (also called craniosynostosis).","zh":"一种特指疾病：头骨的某些骨缝过早闭合（也叫“颅缝早闭/颅骨早闭”，英文常用 craniosynostosis）。"},"examples":[{"en":"Early surgery may be recommended for some types of synostosis to allow normal brain growth.","zh":"对某些类型的颅缝早闭，可能会建议尽早手术以利于大脑正常生长。"},{"en":"The pediatrician referred the child to a specialist to check for synostosis.","zh":"儿科医生把孩子转诊给专科医生检查是否有颅缝早闭。"}]}],"synonyms":["bony fusion","bone fusion","osseous fusion"],"phonetic":"/ˌsɪnəsˈtoʊsɪs/","extraExplanation":["词源提示：syn- 表示“共同、一起”，osteo-/ostos 表示“骨”。synostosis 字面意思就是“骨连在一起”。","常见搭配：bony synostosis（骨性融合）、radioulnar synostosis（桡尺骨融合）、craniosynostosis（颅缝早闭）。医学语境中更常见的是 craniosynostosis 这个更具体的词。"]}
{"word":"synovial","summary":{"en":"“Synovial” means related to the fluid or membrane inside joints that helps them move smoothly.","zh":"“synovial” 指与关节内的滑液或滑膜有关，帮助关节顺畅活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to synovia (synovial fluid) or the synovial membrane inside a joint, which helps the joint move smoothly.","zh":"与滑液（关节液）或关节内的滑膜有关的；滑液的；滑膜的。"},"examples":[{"en":"The doctor said the pain might come from inflammation of the synovial membrane.","zh":"医生说疼痛可能来自滑膜的炎症。"},{"en":"Synovial fluid lubricates the knee so it can bend and straighten more easily.","zh":"滑液为膝关节起润滑作用，让它更容易屈伸。"}]}],"synonyms":["articular","joint-related"],"phonetic":"/səˈnɔɪviəl/","extraExplanation":["在医学语境中，synovial 最常见的搭配是 synovial fluid（滑液/关节液）与 synovial membrane（滑膜）。它常出现在关节相关疾病中，例如：synovitis（滑膜炎）、rheumatoid arthritis（类风湿性关节炎）。","词源上与 “egg（蛋）”有关：synovia 在早期被认为外观像蛋清一样黏滑，因此得名。了解这个联想有助于记忆它“润滑、黏滑”的特点。"]}
{"word":"synovitis","summary":{"en":"Synovitis is inflammation of the lining of a joint, causing pain and swelling.","zh":"Synovitis 指关节内滑膜的炎症，常导致疼痛和肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the synovial membrane (the lining of a joint), which can cause joint pain, swelling, warmth, and stiffness.","zh":"滑膜炎：关节滑膜（关节内壁的衬里）发生炎症，常引起关节疼痛、肿胀、发热感和僵硬。"},"examples":[{"en":"The doctor suspected synovitis because her knee was swollen and painful after exercise.","zh":"医生怀疑是滑膜炎，因为她运动后膝盖肿胀并疼痛。"},{"en":"Rest and anti-inflammatory medicine helped reduce the synovitis in his wrist.","zh":"休息和抗炎药帮助减轻了他手腕的滑膜炎。"},{"en":"Ultrasound showed fluid in the joint, which can happen with synovitis.","zh":"超声显示关节内有积液，这在滑膜炎时可能出现。"}]}],"synonyms":["joint inflammation","synovial inflammation"],"phonetic":"/ˌsɪnəˈvaɪtɪs/","extraExplanation":["词源提示：synovitis = synov-（与“滑液/关节液 synovial”有关）+ -itis（“炎症”）。医学英语里很多疾病名都以 -itis 结尾，如 arthritis（关节炎）、tendonitis（腱炎）。","易混淆点：synovitis（滑膜炎）指“滑膜的炎症”；arthritis（关节炎）是更广义的“关节炎”，可能由多种原因造成，其中也可能包括滑膜发炎。","常见语境：在运动损伤、过度使用（overuse）、类风湿关节炎等情况下，医生可能会提到 synovitis。日常交流中更常说 “joint inflammation” 或直接说 “my knee is inflamed/swollen”。"]}
{"word":"syntactic","summary":{"en":"Syntactic means “related to sentence structure and word order (syntax).”","zh":"syntactic 指“与句子结构、词序等句法有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to syntax: the rules for how words are arranged to form phrases and sentences.","zh":"与句法有关的；与词语如何组合成短语和句子规则有关的。"},"examples":[{"en":"The sentence is understandable, but it has a syntactic error.","zh":"这句话能看懂，但有一个句法错误。"},{"en":"In English, word order is an important syntactic feature.","zh":"在英语中，词序是一个重要的句法特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the structure (grammar) of a language rather than meaning (semantics) or sound (phonology).","zh":"侧重语言结构/语法层面（而非意义或语音）的。"},"examples":[{"en":"They compared syntactic patterns across different languages.","zh":"他们比较了不同语言之间的句法模式。"},{"en":"Her writing improved syntactically after she learned to use clauses correctly.","zh":"她学会正确使用从句后，写作在句法上有了提升。"}]}],"synonyms":["grammatical","structural"],"phonetic":"/sɪnˈtæk.tɪk/","extraExplanation":["“syntactic”常见于语言学、写作评改与学术写作中。学习者常把它和“semantic（语义的）”混淆：syntactic关注“形式/结构”（比如词序、从句结构），semantic关注“意思/含义”。","常见搭配：syntactic structure（句法结构）、syntactic rules（句法规则）、syntactic analysis（句法分析）、syntactic ambiguity（句法歧义）。例如 “I saw the man with a telescope.” 的歧义可来自句法结构。"]}
{"word":"syntactical","summary":{"en":"Syntactical means “related to sentence structure (syntax).”","zh":"syntactical 表示“与句子结构（句法）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the rules of sentence structure (syntax): how words and phrases are arranged to make meaning.","zh":"与句子结构规则（句法）有关的；指词语和短语如何排列组合以表达意义。"},"examples":[{"en":"The essay has a few syntactical errors, but the ideas are clear.","zh":"这篇文章有一些句法错误，但观点很清晰。"},{"en":"Changing the word order can create a syntactical difference in meaning.","zh":"改变词序会造成意义上的句法差异。"}]}],"synonyms":["syntactic","grammatical (often broader)"],"phonetic":"/sɪnˈtæk.tɪ.kəl/","extraExplanation":["“syntactical”和“syntactic”意思几乎相同，都表示“句法的”。在现代语言学写作中，“syntactic”更常见、更正式一些；在一般写作或口语里两者都能用。","“syntax”指“句法/句子结构”，所以“syntactical”常出现在写作批改、语言学习、语言学等语境中。"]}
{"word":"syntactically","summary":{"en":"Syntactically means “in terms of sentence structure (syntax),” often contrasted with meaning (semantics).","zh":"syntactically 意为“在句法/语法结构上”，常与语义（semantics）相对。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to syntax (the rules for how words are arranged to form sentences).","zh":"在句法上；就语法结构而言（与词语如何排列组成句子的规则有关）。"},"examples":[{"en":"The sentence is syntactically correct but sounds unnatural.","zh":"这句话在句法上是正确的，但听起来不自然。"},{"en":"Syntactically, this phrase functions like a noun.","zh":"从句法上看，这个短语的功能像名词。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that focuses only on sentence structure, not meaning.","zh":"从形式结构角度；只看句子结构而不讨论意义。"},"examples":[{"en":"Two expressions can be syntactically similar but semantically different.","zh":"两个表达可能在句法上相似，但在语义上不同。"},{"en":"The parser compares the inputs syntactically before checking meaning.","zh":"解析器会先从句法上比较输入，再检查含义。"}]}],"synonyms":["grammatically (roughly)","structurally","in terms of syntax"],"phonetic":"/sɪnˈtæk.tɪ.kli/","extraExplanation":["“syntactically”常用于语言学、写作教学、以及计算机领域（如编译器、自然语言处理）。它经常与“semantically（在语义上）”成对出现，用来区分“结构是否符合规则”和“意思是否合理”。","常见搭配：syntactically correct/valid（句法正确/有效）、syntactically similar（句法相似）、syntactically ill-formed（句法不合格/不成句）。"]}
{"word":"syntax","summary":{"en":"Syntax means the rules for arranging words (in language) or symbols (in programming/logic) into correct structures.","zh":"Syntax 指语言中词语的排列规则（句法），也指编程/逻辑等形式系统中符号的书写规则（语法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the set of rules for how words and phrases are arranged to form sentences (grammar structure)","zh":"句法；语法结构：词与短语如何组合成句子的规则"},"examples":[{"en":"English syntax usually follows the order subject–verb–object.","zh":"英语句法通常遵循“主语—动词—宾语”的顺序。"},{"en":"The sentence is understandable, but its syntax is awkward.","zh":"这句话能懂，但句法结构很别扭。"}]},{"partOfSpeech":"n.","definition":{"en":"the rules for how symbols are arranged in a formal system, such as programming languages or logic","zh":"（形式系统的）语法规则；句法：如编程语言或逻辑中符号的排列规则"},"examples":[{"en":"A missing semicolon can cause a syntax error.","zh":"少了一个分号可能会导致语法错误（syntax error）。"},{"en":"The command is correct in meaning, but the syntax is wrong.","zh":"这个命令意思对，但语法写法不对。"}]}],"synonyms":["sentence structure","word order","grammar","(computing) grammar"],"phonetic":"/ˈsɪnˌtæks/","extraExplanation":["“Syntax”来自希腊语，原意是“把东西放在一起”，强调“组合/排列”的规则。","语言学里常把 syntax（句法）和 morphology（形态，如词缀变化）区分开：morphology 更关注“词怎么变”，syntax 更关注“词怎么排”。","在编程语境中，syntax 指“写法规则”；与 semantics（语义，含义）相对：语法对不代表意思对，意思对也可能写法不合规。"]}
{"word":"synteny","summary":{"en":"Synteny is a genetics term for genes being located together on a chromosome, often with their order conserved across species.","zh":"synteny 是遗传学术语，指基因在染色体上共同出现（常指顺序在不同物种间仍较为保守）的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In genetics, the presence of genes on the same chromosome (or in the same chromosomal region), especially when that gene order is preserved across different species.","zh":"（遗传学）共线性：指基因位于同一条染色体（或同一染色体区域）上，尤其强调在不同物种之间这些基因的相对位置/顺序仍被保留。"},"examples":[{"en":"Researchers compared human and mouse genomes to find regions of synteny.","zh":"研究人员比较了人类和小鼠基因组，以寻找共线性区域。"},{"en":"High synteny suggests the chromosome segment has changed little over evolution.","zh":"较高的共线性通常表明该染色体片段在进化过程中变化不大。"}]}],"synonyms":["conserved gene order","chromosomal colocalization"],"phonetic":"/ˈsɪn.tə.ni/","extraExplanation":["词源：synteny 来自希腊语 syn-（“一起”）+ -teny（与“带、条”相关），在基因组学语境里常用来描述“染色体上的基因一起出现/一起排列”。","概念补充：在早期文献中，synteny 有时仅指“在同一染色体上”（不一定强调顺序）；现代基因组学里更常把“顺序也相对保留”的情况称为 conserved synteny（保守共线性）。","常见搭配：region/block of synteny（共线性区域/片段）、conserved synteny（保守共线性）、synteny analysis（共线性分析）。","相关概念区分：orthologs（直系同源基因）强调基因来源关系；synteny 强调基因在染色体上的相邻/排列关系。两者常一起用于推断进化与基因功能。"]}
{"word":"synthermal","summary":{"en":"Synthermal means ‘having the same temperature’ (technical), similar to isothermal.","zh":"synthermal 指“同温/等温的”（技术用语），近义词是 isothermal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Having the same or uniform temperature; isothermal.","zh":"（技术用语）同温的；等温的。"},"examples":[{"en":"The experiment was designed to keep the chamber synthermal throughout the test.","zh":"该实验旨在让测试过程中腔室始终保持同温。"},{"en":"Synthermal conditions help reduce errors caused by temperature differences.","zh":"同温条件有助于减少由温差引起的误差。"}]}],"synonyms":["isothermal","same-temperature","uniform-temperature"],"phonetic":"/sɪnˈθɝməl/","extraExplanation":["“synthermal”较少见，多见于较旧或特定领域的技术写作；更常用的同义词是“isothermal（等温的）”。","词源上可理解为 syn-（共同、一起）+ thermal（热的、温度的），表达“温度相同/一致”。在学术或工程语境中更容易遇到。"]}
{"word":"syntheses","summary":{"en":"Syntheses is the plural of synthesis, meaning processes or results of combining parts into a whole.","zh":"Syntheses 是 synthesis 的复数，指把多个部分综合成整体的过程或综合后的成果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of synthesis: combinations of different parts, ideas, or substances into a whole; also the final combined products or written summaries created from those parts.","zh":"“synthesis”的复数：把不同部分、观点或物质结合成整体的过程；也指这种结合后的成果（如综合结论、综合性文本或合成产物）。"},"examples":[{"en":"The report compares several studies and offers two possible syntheses of the results.","zh":"这份报告比较了多项研究，并提出了两种对结果的综合解释。"},{"en":"In chemistry class, we learned about syntheses that produce new compounds.","zh":"在化学课上，我们学习了能生成新化合物的合成反应。"},{"en":"Good literature reviews often include syntheses, not just summaries.","zh":"好的文献综述通常包含“综合”，而不仅是“摘要”。"}]}],"synonyms":["combinations","integrations","fusions","blends","compilations"],"phonetic":"/ˈsɪnθəˌsiz/","extraExplanation":["这是一个不规则复数形式：synthesis → syntheses。拼写上把 -is 变为 -es；读音上单数常读 /-sɪs/，复数常读 /-siz/。","学术写作里常说 “a synthesis of sources”（对资料的综合），强调把多方观点联系起来形成自己的结论；而 “summary” 更偏向按原文顺序概括。"]}
{"word":"synthesis","summary":{"en":"Synthesis means combining parts or ideas into a coherent whole; in science, it also means forming a substance by combining simpler ones.","zh":"Synthesis 指把部分或观点整合成一个连贯整体；在科学中也指由简单物质结合形成新物质的“合成”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of combining different parts, ideas, or substances to form a whole; the act of putting things together into one connected system or understanding","zh":"综合；合成：把不同部分、观点或物质组合起来形成整体的过程；把事物整合成一个连贯体系或理解"},"examples":[{"en":"Good writing often shows synthesis: it connects evidence from several sources into one clear argument.","zh":"好的写作常体现“综合”：把多个来源的证据连接起来，形成一个清晰的论点。"},{"en":"The report is a synthesis of years of research and interviews.","zh":"这份报告是多年研究与访谈的综合成果。"}]},{"partOfSpeech":"n.","definition":{"en":"in chemistry and biology, the formation of a compound by combining simpler substances (for example, a cell making proteins)","zh":"（化学/生物）合成：由较简单的物质结合生成化合物的过程（例如细胞合成蛋白质）"},"examples":[{"en":"Plants use photosynthesis to support the synthesis of sugars.","zh":"植物通过光合作用来支持糖类的合成。"},{"en":"Protein synthesis happens in cells and is essential for growth.","zh":"蛋白质合成发生在细胞中，对生长至关重要。"}]},{"partOfSpeech":"n.","definition":{"en":"in philosophy and criticism, a new idea or position that results from combining or resolving opposing ideas","zh":"（哲学/批评）综合（统一）：把对立观点结合或调和后形成的新观点或立场"},"examples":[{"en":"The speaker offered a synthesis of tradition and innovation.","zh":"演讲者提出了传统与创新的综合。"}]}],"synonyms":["integration","combination","fusion","composition","amalgamation"],"phonetic":"/ˈsɪnθəsɪs/","extraExplanation":["“synthesis”常用于学术写作，强调不只是“总结（summary）”，而是把多条信息进行比较、归类、联系，形成你自己的整体观点或框架。写作任务里常见的要求是“synthesize sources”（综合多个来源）。","词源上来自希腊语，含义是“放在一起、组合起来”。因此它既可以指“思想的综合”，也可以指“化学上的合成”。","常见搭配：a synthesis of A and B（A与B的综合）；the synthesis of new evidence（对新证据的综合）；chemical synthesis（化学合成）；protein/DNA synthesis（蛋白质/DNA合成）。"]}
{"word":"synthesise","summary":{"en":"Synthesise means to combine separate parts into a coherent whole; in science, it also means to make a substance by combining simpler chemicals.","zh":"Synthesise 指把分散的部分综合成一个整体；在科学领域也指通过组合较简单的化学物质来合成某种物质。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to combine different ideas, pieces of information, or materials into one clear whole","zh":"把不同的想法、信息或材料综合起来，形成一个整体"},"examples":[{"en":"The report synthesises data from several studies into one conclusion.","zh":"这份报告把几项研究的数据综合起来，得出一个结论。"},{"en":"Try to synthesise what you read and explain it in your own words.","zh":"试着把你读到的内容加以综合，并用自己的话解释出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(science/chemistry) to make a substance by combining simpler chemicals, often artificially rather than naturally","zh":"（科学/化学）通过组合较简单的化学物质来合成某种物质，通常指人工合成"},"examples":[{"en":"Scientists synthesised a new compound in the lab.","zh":"科学家在实验室里合成了一种新化合物。"},{"en":"Vitamin C can be synthesised for supplements.","zh":"维生素C可以被合成用于补充剂。"}]},{"partOfSpeech":"vi.","definition":{"en":"to form a whole by combining parts (used less often without an object)","zh":"（较少用作不及物）通过结合各部分而形成整体"},"examples":[{"en":"In the final chapter, the themes begin to synthesise.","zh":"在最后一章，这些主题开始融合成一个整体。"}]}],"synonyms":["combine","integrate","merge","unify","blend","compile","bring together","synthesize"],"phonetic":"/ˈsɪnθəˌsaɪz/","extraExplanation":["“synthesise”是英式拼写；美式拼写更常见的是“synthesize”。两者意思相同。","学习写作时常见搭配：synthesise/synthesize information, ideas, research, evidence（综合信息/观点/研究/证据）。","在学术写作里，“summarize”更偏“概括”，而“synthesise/synthesize”强调把多来源内容“整合并形成新的整体观点”。"]}
{"word":"synthesize","summary":{"en":"Synthesize means (1) combine information or ideas into a new whole, or (2) make something through chemical/biological processes.","zh":"Synthesize 的意思是（1）把信息或想法整合成新的整体；（2）通过化学/生物过程合成或生成某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To combine different ideas, pieces of information, or parts into a new whole (such as a clear plan, explanation, or conclusion).","zh":"把不同的想法、信息或部分整合成一个新的整体（如清晰的计划、解释或结论）。"},"examples":[{"en":"In her essay, she synthesized research from several books into one clear argument.","zh":"在她的文章中，她把多本书的研究整合成一个清晰的论点。"},{"en":"Try to synthesize what you learned today and explain it in your own words.","zh":"试着把你今天学到的内容整合起来，用自己的话讲出来。"},{"en":"The report synthesizes customer feedback and sales data to recommend changes.","zh":"这份报告把客户反馈和销售数据综合起来，提出改进建议。"}]},{"partOfSpeech":"vt.","definition":{"en":"To produce something by chemical or biological processes (often in a lab or in the body).","zh":"通过化学或生物过程合成/生成某物（常指在实验室或在体内）。"},"examples":[{"en":"The company synthesized a new material that is lighter and stronger.","zh":"这家公司合成了一种更轻、更坚固的新材料。"},{"en":"Plants synthesize sugars from carbon dioxide and water using sunlight.","zh":"植物利用阳光把二氧化碳和水合成糖类。"}]}],"synonyms":["combine","integrate","merge","blend","compile","create"],"phonetic":"/ˈsɪnθəˌsaɪz/","extraExplanation":["学习写作与阅读时，synthesize 常与 summarize（总结）对比：summarize 更像“把内容变短”；synthesize 更像“把多个来源的观点融合起来，形成自己的结构与结论”。","学术场景常见搭配：synthesize evidence（综合证据）、synthesize findings（整合研究发现）、synthesize sources（整合资料来源）。科学场景常见搭配：synthesize a compound/material（合成化合物/材料）、synthesize protein（合成蛋白质）。"]}
{"word":"synthesizer","summary":{"en":"A synthesizer is usually an electronic instrument that makes and shapes sounds, especially for music; it can also mean a system that generates output like synthesized speech.","zh":"synthesizer 通常指电子合成器（用于制造并塑造声音，尤指音乐）；也可指生成合成输出的系统，如语音合成器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An electronic instrument or device that creates sounds (often musical) by generating and shaping electronic signals.","zh":"（常指音乐用的）合成器；一种通过产生并塑造电子信号来制造声音的电子乐器或设备。"},"examples":[{"en":"She played the melody on a synthesizer instead of a piano.","zh":"她用合成器而不是钢琴来弹奏旋律。"},{"en":"Modern pop music often uses synthesizers to create rich background sounds.","zh":"现代流行音乐常用合成器来营造丰富的背景音色。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine or software system that produces a particular output by combining different inputs (for example, a speech synthesizer that generates spoken voice).","zh":"（机器或软件）合成装置；通过组合不同输入来生成特定输出的系统（如语音合成器可生成声音）。"},"examples":[{"en":"The app includes a speech synthesizer for reading text aloud.","zh":"这个应用带有语音合成器，可以把文字读出来。"},{"en":"Engineers tested a sound synthesizer to imitate natural instruments.","zh":"工程师测试了一个声音合成器，用来模仿自然乐器。"}]}],"synonyms":["synth","electronic keyboard","sound generator","speech synthesizer"],"phonetic":"/ˈsɪnθəˌsaɪzɚ/","extraExplanation":["“synthesizer”来自“synthesize”（合成），核心概念是把多个元素“组合成一个新的整体”。在音乐里，它通常通过振荡器（产生波形）、滤波器（削减或强化频段）、包络（控制音量/音色随时间变化）等来塑造音色。","文化上，合成器在20世纪后半叶对电子乐、流行乐、电影配乐影响很大；像80年代的“synth-pop（合成器流行）”就以合成器音色为标志。"]}
{"word":"synthetase","summary":{"en":"A synthetase is an enzyme that builds molecules—often using ATP energy.","zh":"synthetase 指“合成酶”，催化分子构建/连接，且常需要ATP能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that catalyzes the synthesis (building) of a molecule, usually by joining smaller parts together, often using energy (commonly from ATP).","zh":"合成酶：一种催化“合成/构建”分子的酶，通常把较小的部分连接成较大的分子，并且常常需要能量（多来自ATP）。"},"examples":[{"en":"DNA ligase is a kind of synthetase that helps join pieces of DNA together.","zh":"DNA连接酶可以看作一种合成酶，帮助把DNA片段连接起来。"},{"en":"Aminoacyl‑tRNA synthetases attach amino acids to tRNA during protein synthesis.","zh":"氨酰‑tRNA合成酶在蛋白质合成过程中把氨基酸连接到tRNA上。"}]}],"synonyms":["enzyme","ligase (related in many contexts)","ATP-dependent enzyme"],"phonetic":"/ˈsɪnθəˌteɪs/","extraExplanation":["在生物化学命名里，**synthetase（合成酶）**通常表示反应需要能量输入（常用ATP），而**synthase**一般指不直接使用ATP的“合成”反应。两者在中文里常都译作“合成酶”，但在英文科研写作中区分很重要。","词根提示：**synth-** 来自希腊语，表示“组合、拼合”；**-ase** 是酶类名称常见后缀。看到“某某‑synthetase”通常就能推测它把某种东西“接上去/拼起来”。"]}
{"word":"synthetic","summary":{"en":"Synthetic most commonly means ‘man-made, not natural,’ especially for materials; it can also mean ‘fake or unnatural’ in a figurative sense.","zh":"Synthetic最常指“人造/合成、非天然”（尤其用于材料）；也可引申为“做作/不真诚、不自然”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made by people using chemical or industrial processes rather than occurring naturally.","zh":"（通常指材料/物质）人造的；由化学或工业过程制造的，而非天然形成的。"},"examples":[{"en":"The jacket is made from synthetic fibers that dry quickly.","zh":"这件夹克由合成纤维制成，干得很快。"},{"en":"Some people prefer natural fragrances over synthetic ones.","zh":"有些人更喜欢天然香味，而不是合成香味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Artificial or not genuine; made to look real but lacking natural authenticity.","zh":"（比喻）不真诚的；做作的；看起来像真的但缺少自然真实感的。"},"examples":[{"en":"Her smile looked synthetic, like she was forcing it.","zh":"她的笑容看起来很假，像是硬挤出来的。"}]}],"synonyms":["man-made","artificial","manufactured","fake (figurative)"],"phonetic":"/sɪnˈθɛtɪk/","extraExplanation":["在日常英语里，synthetic最常见的搭配是synthetic fiber（合成纤维）、synthetic materials（合成材料）、synthetic rubber（合成橡胶）。它通常是中性词，强调“人造/合成”，不一定表示“质量差”。","与artificial相比：artificial更常带“仿造、非天然、可能不够真实/不如天然”的语气；synthetic更偏“化学合成、工业制造”的客观描述。"]}
{"word":"synthetically","summary":{"en":"“Synthetically” means “in an artificial or chemically made way,” not naturally.","zh":"“synthetically”表示“以人造/化学合成的方式”，不是自然形成的。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a synthetic or artificial way; not naturally.","zh":"以合成的/人造的方式；不是自然形成的。"},"examples":[{"en":"The jacket is synthetically dyed to keep the color bright.","zh":"这件夹克是用合成染料染色的，以保持颜色鲜艳。"},{"en":"Some materials behave differently when they are produced synthetically.","zh":"有些材料在人造合成生产时会表现得不一样。"}]},{"partOfSpeech":"adv.","definition":{"en":"By chemical synthesis (made by combining substances through chemical reactions).","zh":"通过化学合成（用化学反应把物质组合制得）。"},"examples":[{"en":"This vitamin is produced synthetically in large factories.","zh":"这种维生素是在大型工厂里通过化学合成生产的。"},{"en":"The drug can be made synthetically instead of extracted from plants.","zh":"这种药物可以用化学合成制造，而不是从植物中提取。"}]}],"synonyms":["artificially","chemically","man-made (in a way)","in a lab (informal)"],"phonetic":"/sɪnˈθɛtɪkli/","extraExplanation":["“synthetically”常和“made/produced/created/dyed”等动词搭配，强调“人造/合成”的方式。注意它不同于“authentically（真实地）”或“naturally（自然地）”。在食品与护肤品语境里，它常用来对比“天然成分（natural ingredients）”。"]}
{"word":"synthetics","summary":{"en":"Synthetics are things made artificially rather than naturally—often man‑made fabrics, and sometimes synthetic chemicals/drugs or financial instruments.","zh":"Synthetics 指人造/合成的东西——常见为人造面料，也可指合成化学品/药物或金融中的合成工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Artificially made materials (not natural), especially man‑made fibers or fabrics like polyester or nylon.","zh":"人造材料（非天然），尤指人造纤维或面料，如涤纶、尼龙。"},"examples":[{"en":"Many sports shirts are made from synthetics that dry quickly.","zh":"很多运动衫用的是快干的人造面料。"},{"en":"People with sensitive skin sometimes prefer cotton over synthetics.","zh":"皮肤敏感的人有时更喜欢棉质而不是人造纤维。"}]},{"partOfSpeech":"n.","definition":{"en":"Synthetic products as a group, often referring to man‑made chemicals or drugs.","zh":"合成制品（总称），常指人造化学品或合成药物。"},"examples":[{"en":"The clinic warned about the dangers of synthetics sold online.","zh":"诊所警告了网售合成药物的危险。"},{"en":"Some cleaners contain synthetics that can irritate the lungs.","zh":"有些清洁剂含有可能刺激肺部的合成化学物质。"}]},{"partOfSpeech":"n.","definition":{"en":"Financial instruments designed to imitate other assets (e.g., a “synthetic” position in a stock).","zh":"（金融）用来模拟其他资产表现的合成工具/合成头寸（如“合成”持有某只股票）。"},"examples":[{"en":"The fund used synthetics to get exposure to the market without buying the shares directly.","zh":"该基金用合成工具获取市场敞口，而不直接买入股票。"}]}],"synonyms":["man-made materials","artificial fibers","synthetic fabrics","artificials","synthetic products"],"phonetic":"/sɪnˈθɛtɪks/","extraExplanation":["“synthetics”是复数名词，常见于服装/面料语境（the synthetics＝人造纤维类面料）。对应的形容词是“synthetic”（人造的、合成的）。","词根来自希腊语“synthesis”（合成、综合）。在新闻或公共卫生语境里，“synthetics”有时特指“合成毒品/新型合成物”。","在金融里说“synthetic(s)”通常与衍生品有关（如期权、互换），意思是“用组合方式复制某种资产的收益/风险”。"]}
{"word":"synthetikos","summary":{"en":"Synthetikos is a rare Greek-based word meaning “combining parts into a whole,” and it is the source of “synthetic.”","zh":"Synthetikos 是一个罕见的希腊语外来词，意为“把部分组合成整体的”，也是 synthetic 的词源。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) A Greek-derived adjective meaning “able to put together; combining parts into a whole.” It is the root behind the English word “synthetic.”","zh":"（罕见）源自希腊语的形容词，意为“能把东西组合起来的；综合的；把部分合成整体的”。它也是英语 synthetic（合成的/综合的）的词源。"},"examples":[{"en":"In some linguistics notes, *synthetikos* is used to describe forms created by combining smaller parts.","zh":"在一些语言学笔记中，*synthetikos* 用来描述由较小部分组合而成的形式。"},{"en":"The idea of *synthetikos* thinking is to build a whole picture from many details.","zh":"*synthetikos* 思维的意思是从许多细节搭建出完整图景。"}]}],"synonyms":["synthetic","combined","integrative","composite"],"phonetic":"/sɪnˈθɛtɪkɑs/","extraExplanation":["*synthetikos*（συνθετικός）来自希腊语：syn-（“一起/共同”）+ thetos（“放置、安排”相关），核心概念是“把东西放到一起、进行组合”。在现代英语学习中，你更常见到的是 synthetic（合成的；人造的；综合的）以及 synthesis（综合；合成）。","它不是现代英语里的常用词，更多出现在词源学、古典学或少量学术写作中；日常表达一般用 synthetic / combined / integrative 等。"]}
{"word":"syntony","summary":{"en":"Syntony means harmony or being in tune; in psychology it can mean a normal, well-attuned mood.","zh":"syntony 指“和谐、合拍、同调”；在心理学中也可指“心境正常、与现实协调”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Harmony or being “in tune” with someone or something (in feelings, ideas, mood, or style).","zh":"和谐；合拍；（与人或事物在情感、想法、气氛或风格上）同调、契合。"},"examples":[{"en":"There was a feeling of syntony between the two speakers, and the audience relaxed.","zh":"两位演讲者之间有一种合拍的感觉，观众也放松了。"},{"en":"The team worked in syntony, finishing the project ahead of schedule.","zh":"团队配合默契，提前完成了项目。"},{"en":"Good teaching creates syntony with students’ needs and emotions.","zh":"好的教学会与学生的需求和情绪形成契合。"}]},{"partOfSpeech":"n.","definition":{"en":"(Psychology/Psychiatry) A state of normal, well-balanced mood; emotional attunement to reality (often contrasted with being out of tune or withdrawn).","zh":"（心理学/精神医学）心境正常、平衡的状态；情感与现实相协调（常与“脱离、退缩、失调”形成对比）。"},"examples":[{"en":"After a few weeks of rest, he returned to syntony and could focus again.","zh":"休息几周后，他的心境恢复平衡，又能重新专注。"},{"en":"The clinician noted improved syntony during the follow-up visit.","zh":"在复诊时，临床医生记录到他的情绪协调性有所改善。"}]}],"synonyms":["harmony","attunement","rapport","alignment","resonance"],"phonetic":"/ˈsɪntəni/","extraExplanation":["“Syntony”较少见，更常见的相关词是“syntonic”（形容词，意为“同调的/协调的”）。","词源上可理解为 syn-（一起、共同）+ tone（音调），所以核心意象是“调到同一个频率”。","在日常英语里，“in tune / in harmony / attunement / rapport”更常用；在心理学或较正式的写作中才更可能见到“syntony”。"]}
{"word":"syphilis","summary":{"en":"Syphilis is a bacterial STI that can become serious if untreated but is usually curable with antibiotics, especially when found early.","zh":"梅毒是一种细菌引起的性传播感染，不治疗可能很严重，但通常在早期发现时可用抗生素治愈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sexually transmitted infection (STI) caused by bacteria, which can cause sores, rashes, and serious health problems if not treated","zh":"一种由细菌引起的性传播感染（性病），可出现溃疡、皮疹等症状；若不治疗，可能导致严重健康问题"},"examples":[{"en":"Syphilis is treatable, especially when it is found early.","zh":"梅毒是可以治疗的，尤其是在早期发现时。"},{"en":"If you notice a painless sore or an unusual rash, a clinic can test for syphilis and other STIs.","zh":"如果你发现无痛性溃疡或异常皮疹，诊所可以检测梅毒和其他性传播感染。"},{"en":"Doctors often prescribe antibiotics to treat syphilis.","zh":"医生常用抗生素来治疗梅毒。"}]}],"synonyms":["STI (general term)","sexually transmitted infection (general term)","treponemal infection (medical)"],"phonetic":"/ˈsɪfəlɪs/","extraExplanation":["“syphilis”在中文常译为“梅毒”。它属于性传播感染，但也可能在怀孕期间从母亲传给胎儿（先天梅毒）。","这个词来自16世纪的一首拉丁语叙事诗《Syphilis sive morbus gallicus》，诗中人物名叫Syphilus，后来被用来指这种疾病。","学习与健康相关的词汇时，英语里常用更中性、医学化的表达，如“STI testing（性传播感染检测）”“treatment（治疗）”“screening（筛查）”，避免污名化。"]}
{"word":"syphon","summary":{"en":"Syphon (more commonly spelled siphon) is a tube/device or the action of transferring liquid by suction/gravity, and it can also mean secretly diverting money or resources.","zh":"Syphon（更常见拼作 siphon）指“虹吸管/虹吸装置”或“用虹吸转移液体”，也可引申为“（常带负面）挪用、抽走资金或资源”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tube or device used to move liquid from one container to another, usually by letting it flow down through the tube once started.","zh":"（通常作 siphon）虹吸管；虹吸装置：用管子把液体从一个容器转移到另一个容器，通常靠液体向下流动（虹吸作用）来完成。"},"examples":[{"en":"Use a syphon to transfer the gasoline into a safe container.","zh":"用虹吸管把汽油转移到安全的容器里。"},{"en":"The brewer syphoned the beer into bottles.","zh":"酿酒师用虹吸把啤酒转到瓶子里。"}]},{"partOfSpeech":"v.","definition":{"en":"To move liquid through a tube from one place to another, especially by siphon action; also, to take money/resources away (often secretly or unfairly).","zh":"（通常作 siphon）用虹吸法输送（液体）；（也可引申）抽走/挪用（资金、资源，常含偷偷或不公平之意）。"},"examples":[{"en":"They syphoned water out of the flooded basement.","zh":"他们把积水从被淹的地下室里抽走。"},{"en":"The report said the funds were syphoned off into private accounts.","zh":"报告称资金被转走到了私人账户里。"}]}],"synonyms":["siphon","tube","drain","pump","divert","channel","reroute"],"phonetic":"/ˈsaɪfən/","extraExplanation":["“Syphon”是“siphon”的较少见拼写（英式拼写里更常见“siphon”），两者意思相同。日常科学/工程语境几乎都写作“siphon”。","常见搭配：siphon/syphon off（把钱或资源“抽走、挪走”），多用于新闻与商业语境，带负面含义。","文学与历史用法中，“siphon”也指古代或现代的引水管道/排水装置，但学习时优先掌握“用管子把液体虹吸过去”和“siphon off 挪用资金”这两类用法。"]}
{"word":"Syria","summary":{"en":"Syria is a Middle Eastern country on the Mediterranean; in some contexts it can also mean a larger historical region.","zh":"Syria 指中东地中海东岸的国家（叙利亚）；在某些语境下也可指更大的历史区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the Middle East on the eastern coast of the Mediterranean Sea; its capital is Damascus.","zh":"叙利亚：位于中东、地中海东岸的国家；首都是大马士革。"},"examples":[{"en":"Syria’s capital city is Damascus.","zh":"叙利亚的首都是大马士革。"},{"en":"Many ancient trade routes passed through Syria.","zh":"许多古代商路曾穿越叙利亚。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/Geographic) A broader region sometimes called “Greater Syria,” referring to parts of the eastern Mediterranean area in historical contexts.","zh":"（历史/地理）“大叙利亚”一词有时指更广的东地中海地区，在历史语境中可能包含周边部分地区。"},"examples":[{"en":"In some historical texts, “Syria” can refer to a larger region than the modern country.","zh":"在一些历史文献中，“Syria（叙利亚）”可能指比现代国家更大的区域。"}]}],"synonyms":["Syrian Arab Republic"],"phonetic":"/ˈsɪriə/","extraExplanation":["“Syria”是专有名词，日常写作要大写。对应形容词/国籍常用 Syrian（叙利亚的/叙利亚人）。","在新闻语境中常会出现 Syria / Syrian refugee（叙利亚/叙利亚难民）、Syrian civil war（叙利亚内战）等固定搭配；理解时注意区分“国家（现代叙利亚）”与“历史区域（大叙利亚）”。"]}
{"word":"Syrian","summary":{"en":"“Syrian” means from Syria (adjective) or a person from Syria (noun).","zh":"“Syrian”表示“叙利亚的”（形容词）或“叙利亚人”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Syria, its people, or its culture.","zh":"叙利亚的；与叙利亚、叙利亚人民或文化有关的。"},"examples":[{"en":"Syrian food often includes dishes like hummus and kibbeh.","zh":"叙利亚食物常见的菜有鹰嘴豆泥（hummus）和肉丸（kibbeh）。"},{"en":"She studies Syrian history and literature.","zh":"她研究叙利亚的历史与文学。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Syria.","zh":"叙利亚人。"},"examples":[{"en":"He is a Syrian living in New York.","zh":"他是一位住在纽约的叙利亚人。"},{"en":"Many Syrians have moved abroad in recent years.","zh":"近年来许多叙利亚人移居海外。"}]}],"synonyms":["Syrian (nationality adjective/noun)"],"phonetic":"/ˈsɪriən/","extraExplanation":["“Syrian”是国籍/族群形容词与名词。国籍形容词通常大写：Syrian。","发音里常见的重音在第一个音节：SYR-ian。","文化语境：叙利亚位于西亚（中东地区），日常英语中也常出现在新闻、历史、移民与人道议题的语境里。表达时注意使用中性、尊重的说法（如 Syrian people / Syrians）。","相关词：Syria（叙利亚），Syriac（叙利亚语/叙利亚基督徒传统相关；与Syrian不同），Damascus（大马士革，叙利亚首都）。"]}
{"word":"syrian","summary":{"en":"Syrian means “from Syria” or “a person from Syria.”","zh":"Syrian 表示“叙利亚的”，也可指“叙利亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from or relating to Syria (a country in the Middle East), or to its people or culture","zh":"叙利亚的；与叙利亚（中东国家）及其人民、文化有关的"},"examples":[{"en":"Syrian food often includes dishes like hummus and kibbeh.","zh":"叙利亚美食常见的菜有鹰嘴豆泥（hummus）和烤肉丸（kibbeh）。"},{"en":"She is Syrian, but she grew up in Canada.","zh":"她是叙利亚人，但在加拿大长大。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Syria","zh":"叙利亚人"},"examples":[{"en":"Many Syrians have built new lives in different countries.","zh":"许多叙利亚人在不同国家开始了新的生活。"}]}],"synonyms":["from Syria","Syrian (nationality adjective)"],"phonetic":"/ˈsɪriən/","extraExplanation":["“Syrian”既可以指国籍/族裔（a Syrian），也可以指与叙利亚相关的事物（Syrian culture）。谈到战争或难民等话题时，英语里更常用“Syrian people / Syrians”来强调“人”，表达更尊重、更不标签化。"]}
{"word":"syringe","summary":{"en":"A syringe is a tool used to inject or remove liquids; as a verb, it means to do that using a syringe.","zh":"syringe 指“注射器/针筒”；作动词表示“用注射器注射、抽取或冲洗液体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical tool with a tube and a plunger, used to inject liquid into the body or remove fluid from it.","zh":"注射器；针筒（带筒身和推杆的医疗器具，用来把液体注入体内或抽出液体）"},"examples":[{"en":"The nurse filled the syringe with vaccine and gave him the shot.","zh":"护士把疫苗吸入注射器里，然后给他打了一针。"},{"en":"The doctor used a syringe to draw blood for a test.","zh":"医生用注射器抽血做化验。"}]},{"partOfSpeech":"v.","definition":{"en":"To inject, rinse, or clean using a syringe.","zh":"用注射器注入（药液等）；用注射器冲洗/清洁"},"examples":[{"en":"The wound was syringed with clean water to remove dirt.","zh":"伤口用干净的水通过注射器冲洗，去除污物。"},{"en":"The medication is syringed slowly into the feeding tube.","zh":"药液通过注射器缓慢注入喂食管。"}]}],"synonyms":["hypodermic syringe","injector","needle (informal, when referring to an injection)"],"phonetic":"/səˈrɪndʒ/","extraExplanation":["“syringe”最常见的搭配有：disposable syringe（一次性注射器）、needle and syringe（针头和注射器）、fill a syringe（把液体吸入针筒）、inject with a syringe（用注射器注射）。","在医疗语境中，syringe 不一定总带针头：有些用于冲洗、抽取液体或连接导管（如 feeding tube）。","词源上与希腊语中“管子/笛管”相关，强调“管状器具”的形状。"]}
{"word":"syrup","summary":{"en":"Syrup is a thick sweet liquid used for food, drinks, or medicine; it can also describe something overly sweet or sentimental.","zh":"Syrup 指用于食物、饮料或药物的浓稠甜液体（糖浆）；也可引申形容过分甜腻、矫情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, sweet liquid used to flavor food or drinks, or used in some medicines","zh":"糖浆；（也指）用于食物/饮料调味的浓稠甜液体，或某些药用糖浆"},"examples":[{"en":"I like pancakes with maple syrup.","zh":"我喜欢在煎饼上淋枫糖浆。"},{"en":"Add a little syrup to the iced coffee.","zh":"在冰咖啡里加一点糖浆。"},{"en":"The doctor prescribed cough syrup for her sore throat.","zh":"医生给她开了止咳糖浆来缓解喉咙痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"sweet in an excessive or unnatural way (often about words, songs, or emotions)","zh":"过分甜腻的；矫情的（常形容言语、歌曲或情感）"},"examples":[{"en":"His apology sounded a bit syrupy to me.","zh":"他的道歉在我听来有点甜腻、显得不真诚。"},{"en":"Some people find the movie too syrupy.","zh":"有些人觉得这部电影太煽情、太“甜腻”。"}]}],"synonyms":["sweetener","molasses","cough syrup (medicine)","sugary (adj., similar meaning to syrupy)"],"phonetic":"/ˈsɪrəp/","extraExplanation":["“syrup”最常见的是食物里的“糖浆”，如 maple syrup（枫糖浆）、corn syrup（玉米糖浆）、chocolate syrup（巧克力糖浆）。在美式语境里，pancakes/waffles（松饼/华夫饼）配 syrup 很典型。","形容词 “syrupy” 常带轻微贬义，表示“甜得发腻、过于煽情/做作”。日常表达里也会说 “too sweet” 来更口语地表达类似意思。"]}
{"word":"syrupy","summary":{"en":"Syrupy means thick and sweet like syrup, or (figuratively) overly sentimental and “too sweet.”","zh":"syrupy 指像糖浆一样浓稠甜腻；也可比喻（语言/情感等）过度煽情、甜得发腻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thick, sticky, and sweet, like syrup.","zh":"像糖浆一样浓稠、黏黏的、甜的。"},"examples":[{"en":"The pancakes were covered in a syrupy sauce.","zh":"煎饼上淋满了浓稠的糖浆。"},{"en":"The air felt syrupy and humid in the summer heat.","zh":"在夏天的热气里，空气又闷又黏。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language, music, or emotion) Too sweet, sentimental, or romantic in a way that feels exaggerated or not sincere.","zh":"（指语言/音乐/情感）甜腻、过度煽情的，显得夸张或不真诚。"},"examples":[{"en":"The movie’s ending was a little syrupy for my taste.","zh":"这部电影的结尾对我来说有点太煽情了。"},{"en":"He wrote a syrupy love letter that felt over the top.","zh":"他写了一封甜腻到有点夸张的情书。"}]}],"synonyms":["thick","sticky","viscous","cloying","saccharine","overly sentimental"],"phonetic":"/ˈsɪrəpi/","extraExplanation":["“syrupy”既可形容真实的口感（黏稠甜），也常用于比喻：形容氛围、声音或表达“甜得发腻”。在书评或影评里，它常带一点负面评价，暗示“太刻意煽情”。","搭配很常见：syrupy sweet（甜腻）、syrupy voice（甜腻/黏糊的嗓音）、syrupy sentiment（过度煽情）、syrupy melody（甜得发腻的旋律）。"]}
{"word":"syst","summary":{"en":"“syst” is a medical abbreviation meaning “systolic,” especially in blood pressure notes.","zh":"“syst”是医学缩写，表示“systolic（收缩压/收缩期）”，常见于血压记录。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) systolic; relating to the heart’s contraction phase (often used in blood pressure readings).","zh":"（缩写）收缩压的；与心脏收缩期有关（常用于血压记录）。"},"examples":[{"en":"BP: 120/80 (syst/diast).","zh":"血压：120/80（收缩压/舒张压）。"},{"en":"His systolic pressure (syst) is a bit high today.","zh":"他今天的收缩压（syst）有点高。"}]}],"synonyms":["syst. (common written form)","systolic"],"phonetic":"/sɪst/","extraExplanation":["“syst”更常见的写法是“syst.”，主要出现在医疗记录里，表示“systolic（收缩期/收缩压）”。血压通常写成“systolic/diastolic（收缩压/舒张压）”。","在日常英语里，人们一般不会单独说“syst”，而是直接说“systolic”或说“top number（上面的那个数）”。"]}
{"word":"system","summary":{"en":"A system is an organized set of connected parts or rules that work together, ranging from machines and biology to procedures and social structures.","zh":"system 指由相互关联的部分或规则组成并共同运作的整体，可用于机器、生物、流程方法，也可指社会制度/体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of connected parts that work together as a whole to achieve a purpose.","zh":"由相互关联的部分组成、共同运作以实现某个目的的整体（系统）。"},"examples":[{"en":"The school has a new grading system.","zh":"学校采用了一套新的评分系统。"},{"en":"Our bodies have an immune system that fights disease.","zh":"我们的身体有免疫系统来对抗疾病。"}]},{"partOfSpeech":"n.","definition":{"en":"A method or organized way of doing something; a set of rules or procedures.","zh":"做事的方法或组织方式；一套规则或流程。"},"examples":[{"en":"I need a better system for managing my time.","zh":"我需要一套更好的时间管理方法。"},{"en":"The company created a system to handle customer complaints.","zh":"公司建立了一套处理客户投诉的流程。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of related things in nature or science, such as planets or organs, treated as a unit.","zh":"自然或科学中相互关联的一组事物（如行星、器官等），作为一个整体来研究。"},"examples":[{"en":"Pluto is in our solar system.","zh":"冥王星在我们的太阳系中。"}]},{"partOfSpeech":"n.","definition":{"en":"A large social or political structure that influences how people live, work, or are treated (often used critically).","zh":"影响人们生活、工作或被对待方式的大型社会或政治结构（常带批评意味）。"},"examples":[{"en":"Many people feel the system is unfair to the poor.","zh":"许多人觉得这个体制对穷人不公平。"}]}],"synonyms":["structure","network","framework","organization","method"],"phonetic":"/ˈsɪstəm/","extraExplanation":["“system”既可以指具体的技术/生物系统（如交通系统、免疫系统），也常用于更抽象的“制度/体制”（the system）。在口语或媒体中说“fight the system”通常表示反抗不公的制度或权力结构。","搭配很常见：operating system（操作系统）、public transportation system（公共交通系统）、education system（教育体系）、systemic problems（系统性问题）。其中“systemic”强调问题来自整体结构，而不只是个别事件。"]}
{"word":"systema","summary":{"en":"Systema most commonly refers to a Russian martial art; it can also be a Latin term meaning “system,” seen in some scientific titles.","zh":"Systema 最常指一种俄罗斯武术；也可作拉丁语，意为“系统/体系”，常见于部分科学著作标题中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Russian martial art and self-defense method that emphasizes relaxed movement, breathing, and adaptability rather than fixed techniques","zh":"一种俄罗斯武术/自卫体系，强调放松的动作、呼吸与适应性，而不是固定套路"},"examples":[{"en":"He started training Systema to improve his movement and calmness under pressure.","zh":"他开始练习 Systema，以提升动作能力和在压力下的冷静。"},{"en":"Systema classes often focus on breathing and natural body mechanics.","zh":"Systema 的课程常常重视呼吸与身体的自然力学。"}]},{"partOfSpeech":"n.","definition":{"en":"a Latin word meaning “system,” sometimes used in titles of scientific works (for example, in taxonomy)","zh":"拉丁语，意为“系统/体系”，有时用于科学著作标题中（例如分类学）"},"examples":[{"en":"The title uses the Latin word systema to mean “a system of classification.”","zh":"标题里用拉丁词 systema 表示“分类体系”。"},{"en":"“Systema Naturae” is a famous work in the history of biological classification.","zh":"《Systema Naturae（自然系统）》是生物分类史上的著名著作。"}]}],"synonyms":["martial art","self-defense system","combat system"],"phonetic":"/sɪˈstiːmə/","extraExplanation":["在英语语境里，大写“Systema”更常指俄罗斯武术流派；小写“systema”则更可能出现在拉丁文或学术标题中。","“Systema”作为武术名称通常不翻译，直接音译或保留原词；谈到“system”这种普通含义时，英语里更常用 system。"]}
{"word":"systemat","summary":{"en":"“Systemat” is a rare, nonstandard verb meaning “to systematize; to organize into a system.”","zh":"“systemat”是罕见的非标准动词，用来表示“使系统化；整理成体系”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/Nonstandard) to organize something into a system; to arrange in an orderly, methodical way (similar to “systematize”).","zh":"（罕见/非标准用法）把某事系统化；按体系整理，使之有条理（类似 systematize）。"},"examples":[{"en":"The researcher tried to systemat the notes into clear categories.","zh":"研究者试着把笔记系统化，分成清晰的类别。"},{"en":"We need to systemat our workflow so everyone follows the same steps.","zh":"我们需要把工作流程系统化，让每个人都按同样的步骤来。"}]}],"synonyms":["systematize","organize","classify","structure","arrange"],"phonetic":"/ˈsɪstəmæt/","extraExplanation":["“systemat”在现代英语里几乎不用，很多情况下是拼写不完整或误拼，通常你想表达的是：\n1) systematize（使系统化、使条理化）\n2) systematization（系统化）\n3) systematic（有系统的、有条理的）\n如果你是在某篇文章/教材里看到“systemat”，也可能是某些语言（如部分斯拉夫语言）对英语词的借用形式或截短形式。"]}
{"word":"systematic","summary":{"en":"Systematic describes something done in an organized, methodical way, following a clear system or plan.","zh":"Systematic 指“有系统、有条理、按方法与步骤进行的”，强调做事方式遵循明确的计划或规则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done in a careful, organized, step-by-step way, often following a plan or method","zh":"有系统的；有条理的；按步骤进行的（通常遵循计划或方法）"},"examples":[{"en":"She is systematic in her study habits, reviewing notes every night.","zh":"她的学习习惯很有系统，每晚都会复习笔记。"},{"en":"We need a systematic approach to solve this problem.","zh":"我们需要用系统化的方法来解决这个问题。"},{"en":"The researchers collected data in a systematic way.","zh":"研究人员以系统的方式收集数据。"}]},{"partOfSpeech":"adj.","definition":{"en":"done according to a system or set of rules; methodical rather than random","zh":"按某套体系/规则进行的；有方法的（而非随意的）"},"examples":[{"en":"The file names follow a systematic pattern.","zh":"这些文件名遵循一个有规律的模式。"},{"en":"He made a systematic search of the room.","zh":"他对房间进行了有步骤的搜查。"}]}],"synonyms":["methodical","organized","structured","orderly","planned"],"phonetic":"/ˌsɪstəˈmætɪk/","extraExplanation":["“systematic”强调“按系统/方法做事”，常见搭配：systematic approach（系统化方法）、systematic review（系统综述，学术中指按明确标准检索与评估研究）、systematic error（系统误差，实验中来自仪器或方法的偏差）。","易混词：systemic（系统性的/全身性的）更多指“影响整个系统的”，如 systemic problem（体制性问题）、systemic disease（全身性疾病）；systematic 更偏“做事方式有条理”。"]}
{"word":"systematical","summary":{"en":"“Systematical” means “systematic/methodical,” but it’s uncommon today; “systematic” is usually preferred.","zh":"“systematical”意为“系统的/有条理的”，但现代用得较少；通常更推荐用“systematic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Less common) Systematic; done or arranged according to a system, plan, or method.","zh":"（较少用）系统的；有条理的；按某种体系、计划或方法进行/安排的。"},"examples":[{"en":"She took a systematical approach to studying and reviewed a little every day.","zh":"她用一种有条理的方式学习，每天复习一点。"},{"en":"The report gives a systematical description of the experiment steps.","zh":"这份报告对实验步骤做了系统的描述。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Regular and consistent in how something is done; methodical.","zh":"（较少用）做事有规律、前后一致的；循序渐进的；有方法的。"},"examples":[{"en":"With systematical training, his writing improved quickly.","zh":"通过有规律的训练，他的写作进步很快。"}]}],"synonyms":["systematic","methodical","organized","orderly"],"phonetic":"/ˌsɪs.təˈmæt.ɪ.kəl/","extraExplanation":["“systematical”和“systematic”意思基本相同，但现代英语里更常用的是“systematic”。如果你想表达“有条理的学习/工作方式”，更自然的说法通常是“systematic approach”或“methodical approach”。","在学术写作里，“systematic review”（系统综述）是固定搭配，几乎不会写成“systematical review”。"]}
{"word":"systematically","summary":{"en":"Systematically means doing something in an organized, step-by-step way according to a plan or system.","zh":"Systematically 表示“有系统地、按步骤地”去做事，强调遵循计划或流程。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an organized, methodical way, following a clear system or plan.","zh":"有系统地；按步骤、按方法地（遵循清晰的体系或计划）。"},"examples":[{"en":"She systematically reviewed her notes before the exam.","zh":"考试前，她有系统地复习了笔记。"},{"en":"The team systematically tested each part of the software to find the bug.","zh":"团队按步骤逐一测试软件的每个部分来找出漏洞。"},{"en":"To improve your English, practice systematically: set goals, study daily, and review regularly.","zh":"要提高英语，可以系统练习：设定目标、每天学习、定期复习。"}]}],"synonyms":["methodically","in an organized way","step by step","in a structured manner"],"phonetic":"/ˌsɪstəˈmætɪkli/","extraExplanation":["“systematically”常与动词搭配，强调“有计划地逐项进行”，常见搭配有：systematically analyze（系统分析）、systematically investigate（系统调查）、systematically review（系统复习）。","语气上比“carefully（仔细地）”更强调“按既定方法/流程”，不一定表示慢或谨慎，而是强调结构与步骤。"]}
{"word":"systematicness","summary":{"en":"Systematicness means the quality of being organized and methodical in the way you do things.","zh":"Systematicness 指做事有组织、讲方法、按步骤进行的“条理性/系统性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being systematic; doing things in an organized, methodical, step-by-step way","zh":"系统性；条理性；按步骤、按方法有组织地做事的特质"},"examples":[{"en":"Her systematicness made the project run smoothly.","zh":"她的条理性让项目进展得很顺利。"},{"en":"We need more systematicness in how we track customer feedback.","zh":"我们需要在追踪客户反馈的方式上更有系统性。"}]}],"synonyms":["systematicity","orderliness","methodicalness","organization","structure"],"phonetic":"/ˌsɪs.təˈmæt.ɪk.nəs/","extraExplanation":["“systematicness”比较少见，更常用的是“systematic approach / systematic method（系统化的方法）”或名词“systematicity（系统性）”。在正式写作里，用这些更自然。","易混淆：systematic（有条理、按步骤的）强调“方法/过程”；systemic（系统性的）强调“整个系统层面的问题”，如 systemic risk（系统性风险）。"]}
{"word":"systematikos","summary":{"en":"“Systematikos” is a Greek-based form meaning “systematic”—organized, methodical, and done according to a plan or system.","zh":"“systematikos”是源自希腊语的形式，意思相当于“systematic”：有系统、有条理、按计划或体系进行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"organized and done according to a clear plan or system; methodical","zh":"有系统的；按明确计划或体系进行的；有条理的"},"examples":[{"en":"She took a systematic approach to studying, reviewing a little every day.","zh":"她用系统的方法学习，每天复习一点。"},{"en":"The team did a systematic search of the building room by room.","zh":"团队对大楼进行了系统搜查，一间房一间房地查。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to classification or arranging information into categories","zh":"与分类学或把信息按类别整理有关的"},"examples":[{"en":"The book offers a systematic classification of regional dialects.","zh":"这本书对各地方言进行了系统分类。"}]}],"synonyms":["systematic","methodical","organized","structured","orderly"],"phonetic":"/ˌsɪstəˈmætɪkɑs/","extraExplanation":["“systematikos”是希腊语 μετα写（音译）形式，常见于学术或古典语境；在现代英语里通常不用“systematikos”，而用更常见的形容词“systematic”。","词源上与希腊语“σύστημα (systēma, 系统/整体)”相关，因此含义核心是“有组织的、成体系的”。在读哲学、逻辑学或古典文献时可能会见到这种音译拼写。"]}
{"word":"systematise","summary":{"en":"“Systematise” means to organize something into a clear, orderly system.","zh":"“systematise”指把事物按清晰、有条理的体系进行整理与规范化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to organize something according to a clear system or plan; to make it more orderly and methodical","zh":"使系统化；按明确的体系或计划来整理，使更有条理"},"examples":[{"en":"We need to systematise our notes before the final exam.","zh":"期末考试前我们需要把笔记系统化整理一下。"},{"en":"The company systematised its training program so every new employee learned the same basics.","zh":"公司把培训流程系统化，确保每位新员工都学到相同的基础内容。"}]}],"synonyms":["systematize","organize","standardize","structure","regularize"],"phonetic":"/ˈsɪstəməˌtaɪz/","extraExplanation":["“systematise”是英式拼写；美式更常写作“systematize”。两者意思完全相同。","词根来自“system”（系统）+ 后缀“-ise/-ize”（使……化），常用于学术写作或正式语境，如：systematise data（系统整理数据）、systematise procedures（规范流程）。"]}
{"word":"systematization","summary":{"en":"Systematization means organizing something into a clear, structured system—often used in academic, management, or technical contexts.","zh":"Systematization 指把零散内容整理成清晰、有结构的体系，常用于学术、管理或技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of organizing something into a clear system, with rules, methods, or a structure","zh":"把某事组织成一个清晰的体系或系统的过程（建立规则、方法或结构）"},"examples":[{"en":"The systematization of customer feedback helped the team find the main problems quickly.","zh":"把客户反馈系统化之后，团队能更快找出主要问题。"},{"en":"Without systematization, the documents were hard to search and easy to lose.","zh":"没有系统化管理，这些文件很难查找，也很容易丢失。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular way of arranging ideas, knowledge, or procedures into a system","zh":"把思想、知识或流程整理成体系的一种具体方式"},"examples":[{"en":"Different teachers have different systematizations of grammar rules.","zh":"不同老师对语法规则有不同的系统化整理方式。"},{"en":"The paper proposes a new systematization for classifying research methods.","zh":"这篇论文提出了一种新的研究方法分类体系。"}]}],"synonyms":["organization","structuring","classification","ordering","codification","rationalization"],"phonetic":"/ˌsɪstəˌmətaɪˈzeɪʃən/","extraExplanation":["词形拆解：system（系统）+ -atize（使……化/使成为）+ -ation（名词后缀，表示过程或结果）。意思上接近“把零散内容变成有结构、可重复使用的体系”。","常见搭配：systematization of data / knowledge / procedures（数据/知识/流程的系统化）；常用于学术写作、管理、工程与信息整理场景。","近义词细微差别：organization 更泛（整理组织）；standardization 强调统一标准；systematization 强调形成“系统/框架”，让内容更有逻辑、更可操作。"]}
{"word":"systematize","summary":{"en":"Systematize means to organize something into a well-ordered system, especially to make it more efficient and consistent.","zh":"Systematize 指把某事整理并建立成有条理的体系，通常为了更高效、更一致。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to organize something into a clear system or method so it works more efficiently and consistently","zh":"把某事整理成清晰的体系或方法，使其更高效、更一致地运作"},"examples":[{"en":"We need to systematize the filing process so everyone can find documents quickly.","zh":"我们需要把归档流程系统化，这样每个人都能快速找到文件。"},{"en":"The researcher systematized the data by grouping it into categories.","zh":"研究人员把数据系统化，通过分组归类来整理。"},{"en":"They systematized training for new staff with step-by-step guidelines.","zh":"他们用分步骤的指导把新员工培训流程系统化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make knowledge, rules, or ideas more structured by arranging them into an ordered framework","zh":"把知识、规则或想法整理成更有结构的框架，使其更有条理"},"examples":[{"en":"The textbook systematizes basic grammar into short, easy lessons.","zh":"这本教材把基础语法系统化，分成简短易学的课程。"},{"en":"Her goal was to systematize the company’s policies into one handbook.","zh":"她的目标是把公司的政策系统化，汇总成一本手册。"}]}],"synonyms":["organize","structure","standardize","formalize","streamline"],"phonetic":"/ˈsɪstəˌmaɪz/","extraExplanation":["“systematize”常用于学术、管理与流程改进语境，强调把零散的东西变成“可复制、可执行”的体系。","词形提示：system（系统）+ -atize（使……化/使成为……），类似的词有 modernize（现代化）、standardize（标准化）。"]}
{"word":"systematizer","summary":{"en":"A systematizer is someone or something that makes things orderly by creating a system.","zh":"systematizer 指通过建立体系来使事物更有条理的人或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that organizes ideas, information, or work into a clear system or method.","zh":"把想法、信息或工作整理成清晰体系/方法的人或事物。"},"examples":[{"en":"As a systematizer, she turned messy notes into a step-by-step procedure.","zh":"作为一名系统化整理者，她把杂乱的笔记整理成一步一步的流程。"},{"en":"The new software acts as a systematizer for our customer records.","zh":"这款新软件充当了我们客户档案的系统化整理工具。"}]}],"synonyms":["organizer","planner","classifier","methodologist","coordinator"],"phonetic":"/ˈsɪstəˌmaɪt̬aɪzɚ/","extraExplanation":["“systematizer”来自动词 systematize（使系统化、使条理化）+ 表示“……的人/物”的后缀 -er。日常英语中更常见的说法是 organizer（组织者）、planner（规划者）或 someone who systematizes things（把事情系统化的人）。在学术或管理语境里，“systematizer”偶尔用来强调把零散内容整理成可复用的体系（例如流程、分类法、框架）。"]}
{"word":"systemic","summary":{"en":"Systemic means “connected to the whole system,” often describing deep, widespread issues or system-level change; it can also mean “methodical,” though that sense is less common.","zh":"Systemic 指“与整个系统有关的”，常用于描述深层、广泛的系统性问题或系统层面的改变；也可指“有系统的/有条理的”（较不常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an entire system (such as a society, organization, or body), not just one part; widespread and built into the way the system works.","zh":"系统性的；影响整个系统的（如社会、组织或身体），而不只是某一部分；根植于系统运作方式的。"},"examples":[{"en":"The report found systemic problems in the school district, not just a few bad teachers.","zh":"报告发现学区存在系统性问题，而不只是少数老师不好。"},{"en":"Many people argue that systemic racism affects housing, education, and policing.","zh":"许多人认为系统性种族主义影响住房、教育和执法。"},{"en":"We need systemic change, not temporary fixes.","zh":"我们需要系统性的改变，而不是临时修补。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done in a planned, organized way; methodical.","zh":"有系统的；有条理的；按步骤进行的。"},"examples":[{"en":"She took a systemic approach to studying: outline, review, then practice tests.","zh":"她用有系统的方法学习：先列提纲、再复习、然后做模拟题。"},{"en":"The team made a systemic effort to document every step of the process.","zh":"团队有条理地记录了流程中的每一步。"}]}],"synonyms":["system-wide","structural","institutional","deep-rooted","methodical"],"phonetic":"/sɪˈstɛmɪk/","extraExplanation":["“Systemic”在新闻与社会议题中非常常见，通常强调问题不是个别人的错误，而是制度、规则或长期习惯导致的结构性结果。","注意区分：systemic（系统性的/结构性的）常与systematic（有系统的/按步骤的）混淆；前者侧重“来自系统本身”，后者侧重“做事有条理”。"]}
{"word":"systemise","summary":{"en":"“Systemise” means to organize something into a clear, structured system (BrE spelling of “systemize”).","zh":"“systemise”指把某事物整理成清晰、有结构的体系（英式拼写，对应美式“systemize”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to organize something in a clear, orderly system; to make it systematic","zh":"使……系统化；把……整理成有条理的体系"},"examples":[{"en":"The company systemised its training so every new employee learned the same steps.","zh":"公司把培训系统化，让每位新员工都学习同样的步骤。"},{"en":"We need to systemise our notes before the exam.","zh":"考试前我们需要把笔记系统整理一下。"}]},{"partOfSpeech":"v.","definition":{"en":"to develop or adopt a structured method for doing something","zh":"为某事建立或采用一套有结构的方法"},"examples":[{"en":"After a few projects, she systemised the way she planned her weekly tasks.","zh":"做了几个项目后，她把每周任务规划的方法固定成一套流程。"}]}],"synonyms":["systematize","organize","standardize","streamline","structure"],"phonetic":"/ˈsɪstəˌmaɪz/","extraExplanation":["“systemise”更常见于英式英语（BrE）；美式英语（AmE）更常用拼写“systemize”。两者意思相同，只是拼写习惯不同。"]}
{"word":"systemless","summary":{"en":"Systemless means lacking an organized system; in computing it can mean operating without an OS or system-level support.","zh":"Systemless 指“无系统的、缺乏组织结构的”；在计算机语境中也可指“不依赖操作系统或系统级支持”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a system; lacking an organized structure, method, or set of rules.","zh":"无系统的；缺乏组织结构、方法或规则的。"},"examples":[{"en":"Their systemless approach to studying made it hard to improve.","zh":"他们用一种无系统的学习方式，很难进步。"},{"en":"The notes were systemless—ideas were scattered across different pages.","zh":"这些笔记很无系统——想法散落在不同页面上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Not requiring or not using an operating system or system-level software; working in a very minimal environment.","zh":"（计算机）不需要或不使用操作系统/系统级软件的；在极简环境下运行的。"},"examples":[{"en":"Some devices boot into a systemless mode for recovery tasks.","zh":"一些设备会启动到无系统模式来执行恢复任务。"},{"en":"The tool can run in a systemless environment with only basic drivers.","zh":"这个工具可以在只含基础驱动的无系统环境中运行。"}]}],"synonyms":["unstructured","disorganized","haphazard","unordered","chaotic"],"phonetic":"/ˈsɪstəm.ləs/","extraExplanation":["“-less”是常见后缀，表示“没有……”。例如：wireless（无线上网/无线的）、homeless（无家可归的）、careless（粗心的）。所以 systemless 直译就是“没有系统的”。","在日常英语里，systemless 不算高频词；更常见的替代表达有: unstructured（缺乏结构的）、disorganized（缺乏条理的）、haphazard（随意的/没有计划的）。在技术语境中才更可能看到 systemless 这种说法。"]}
{"word":"systems","summary":{"en":"“Systems” means multiple organized sets of connected parts working together, or multiple institutions/structures (like education or political systems).","zh":"“systems”指多个由部分组成并共同运作的系统，也可指多个制度/体系（如教育体系、政治体制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of system: groups of connected parts that work together as a whole (e.g., a computer system, the school system).","zh":"system 的复数：由相互连接的部分组成、协同运作的整体（如：计算机系统、教育体系）。"},"examples":[{"en":"Modern cities rely on transportation systems to move people efficiently.","zh":"现代城市依靠交通系统来高效运送人群。"},{"en":"The hospital upgraded its computer systems to protect patient data.","zh":"医院升级了计算机系统以保护病人数据。"},{"en":"Different political systems can shape how a country is governed.","zh":"不同的政治体制会影响一个国家如何被治理。"}]}],"synonyms":["networks","structures","frameworks","setups","organizations"],"phonetic":"/ˈsɪstəmz/","extraExplanation":["“system”既可以指具体的技术/组织系统（如 IT system、rail system），也可以指更抽象的“体制/体系”（如 education system、legal system）。用复数“systems”时，常表示“多套系统”或“多个领域的系统”。","在学术或新闻语境中，“systems”也常用于更宏观的概念，比如“economic systems（经济制度/体系）”“ecosystems（生态系统）”。"]}
{"word":"systemwide","summary":{"en":"“Systemwide” means affecting or applying to the entire system, not just a part.","zh":"“systemwide”表示“全系统范围的”，指影响或适用于整个系统，而非局部。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Affecting or applying to an entire computer system, organization, or network (not just one part).","zh":"影响或适用于整个系统、整个组织或整个网络（而不只是其中一部分）。"},"examples":[{"en":"The update includes a systemwide security patch.","zh":"这次更新包含一个全系统的安全补丁。"},{"en":"They announced a systemwide policy change on remote work.","zh":"他们宣布了一个全公司的远程办公政策变更。"},{"en":"A systemwide outage disrupted services for hours.","zh":"一次全系统故障导致服务中断了好几个小时。"}]}],"synonyms":["organization-wide","company-wide","network-wide","across-the-board","system-wide"],"phonetic":"/ˈsɪstəmˌwaɪd/","extraExplanation":["“systemwide”常见于科技与管理语境，强调范围覆盖“整个系统”。写作上也常见作定语：systemwide update / systemwide policy / systemwide outage。","近义表达：“across the entire system”“organization-wide / company-wide / network-wide”。根据语境选择更贴切的范围词（组织、公司、网络等）。","拼写提示：美式英语中常见合写“systemwide”，也有人写作“system-wide”。两者意思相同，但同一篇文章里最好保持一致。"]}
{"word":"systole","summary":{"en":"Systole is the heart’s contraction phase, and it also refers to the systolic (top) number in blood pressure.","zh":"Systole 指心脏收缩并泵血的阶段，也可指血压中的收缩压（上面的数字）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the phase of the heartbeat when the heart muscle contracts and pumps blood out of the chambers (especially the ventricles)","zh":"（心动周期中的）收缩期；心脏肌肉收缩并将血液泵出心腔（尤其是心室）的阶段"},"examples":[{"en":"During systole, the left ventricle pumps blood into the aorta.","zh":"在收缩期，左心室把血液泵入主动脉。"},{"en":"High systolic blood pressure can increase the risk of stroke.","zh":"收缩压偏高会增加中风风险。"}]},{"partOfSpeech":"n.","definition":{"en":"the “top number” in a blood pressure reading, called systolic pressure","zh":"（血压读数中的）收缩压，即血压的“上面那个数字”"},"examples":[{"en":"Her systole (systolic pressure) was 130, and her diastole was 85.","zh":"她的收缩压是130，舒张压是85。"},{"en":"Try to measure your systole at the same time each day for consistency.","zh":"为了保持一致性，尽量每天在同一时间测量收缩压。"}]}],"synonyms":["contraction phase","systolic phase","ventricular contraction"],"phonetic":"/ˈsɪs.tə.li/","extraExplanation":["词源提示：systole 来自希腊语，意为“收缩/拉紧”。常与 diastole（舒张期）成对出现。","学习搭配：systolic pressure（收缩压）/ systolic murmur（收缩期杂音）/ systolic blood pressure（收缩期血压）。","发音注意：重音在第一个音节；中间的 -st- 连读清晰。"]}
{"word":"systolic","summary":{"en":"Systolic means related to the heart’s contraction phase, especially the top number of blood pressure.","zh":"systolic 指与心脏收缩期有关，尤其常用于血压的上压（收缩压）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to systole—the phase when the heart contracts and pumps blood out; often used for the top number in a blood pressure reading (systolic pressure).","zh":"与“收缩期”有关的；指心脏收缩并把血液泵出时的阶段；也常指血压读数中的上压（收缩压）。"},"examples":[{"en":"Her systolic blood pressure is 120, which is the top number in the reading.","zh":"她的收缩压是120，也就是血压读数里的上面那个数字。"},{"en":"The doctor noted an elevated systolic pressure during the checkup.","zh":"医生在检查时记录到她的收缩压偏高。"},{"en":"Systolic contraction pushes blood from the left ventricle into the aorta.","zh":"收缩期的收缩会把血液从左心室推入主动脉。"}]}],"synonyms":["contractile","of systole"],"phonetic":"/sɪˈstɑːlɪk/","extraExplanation":["常见搭配：systolic blood pressure（收缩压，上压）对比 diastolic blood pressure（舒张压，下压）。血压写作“120/80 mmHg”时，120 通常就是 systolic。","词源提示：systolic 来自希腊语，和“收缩（contraction）”相关；在医学英语里多用于心脏周期与血压测量的语境。"]}

