{"word":"TNT","summary":{"en":"TNT usually means a powerful explosive (trinitrotoluene) and is also used figuratively for something with explosive impact or trouble-making potential.","zh":"TNT通常指强力炸药（三硝基甲苯），也可比喻指爆发力强或容易“引爆麻烦”的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful explosive (trinitrotoluene), often used in bombs and demolition; also used as a standard unit for measuring explosive power","zh":"一种强力炸药（三硝基甲苯），常用于爆破、炸弹等；也常作为衡量爆炸威力的标准单位（TNT当量）"},"examples":[{"en":"The movie showed a building being destroyed with TNT.","zh":"电影里演了用TNT把一栋楼炸毁。"},{"en":"The blast was equal to about one ton of TNT.","zh":"这次爆炸的威力大约相当于一吨TNT。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, figurative) something or someone with explosive energy, strong impact, or potential to cause trouble","zh":"（非正式，比喻）爆发力很强的人或事；影响巨大、可能“引爆麻烦”的东西"},"examples":[{"en":"That topic is TNT—bring it up and the whole room will argue.","zh":"那个话题简直是TNT——一提出来全场就要吵起来。"},{"en":"Her new song is pure TNT on stage.","zh":"她的新歌在舞台上爆发力十足。"}]}],"synonyms":["trinitrotoluene","explosive","dynamite (informal)","bomb (general)","powder keg (figurative)"],"phonetic":"/ˌtiːˌɛnˈtiː/","extraExplanation":["TNT是缩写，来自化学名“trinitrotoluene（三硝基甲苯）”。在口语里通常按字母读 /ˌtiːˌɛnˈtiː/。","“TNT当量”常用于新闻或科普中对比爆炸能量（例如“相当于多少吨TNT”），帮助非专业读者理解威力大小。","在日常交流里把某人/某事说成“like TNT”或“is TNT”，多是比喻“容易引爆、能量很猛、影响很大”，语气可夸张但不一定真的指爆炸物。"]}
{"word":"tnt","summary":{"en":"TNT most commonly means a powerful explosive (trinitrotoluene), but it can also be a brand/organization abbreviation or informal online shorthand for “try not to.”","zh":"TNT最常指强力炸药（三硝基甲苯）；也可能是品牌/机构的缩写，或网络中“try not to（尽量别……）”的简写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful explosive made from trinitrotoluene, often used in bombs, demolition, and mining.","zh":"一种强力炸药（三硝基甲苯），常用于炸弹、爆破拆除和采矿。"},"examples":[{"en":"The old building was brought down using TNT.","zh":"那栋旧楼用TNT爆破拆除。"},{"en":"The police found sticks of TNT hidden in the warehouse.","zh":"警方在仓库里发现了藏起来的TNT炸药。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation used as a name for organizations or brands (for example, a TV network).","zh":"用作机构或品牌名称的缩写（例如电视台/频道名称）。"},"examples":[{"en":"That show used to air on TNT.","zh":"那个节目以前在TNT频道播出。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, online) Short for “try not to,” used in phrases like “TNT laugh.”","zh":"（非正式/网络用语）“try not to（尽量别……）”的缩写，常见于“TNT laugh（憋笑）”等表达。"},"examples":[{"en":"This is a TNT laugh challenge—try not to laugh.","zh":"这是个TNT憋笑挑战——尽量别笑。"}]}],"synonyms":["trinitrotoluene","explosive"],"phonetic":"/ˌtiːɛnˈtiː/","extraExplanation":["“TNT”最常见的来源是化学名 trinitrotoluene（三硝基甲苯）的缩写，英语里通常当作不可数名词使用（也会说“sticks of TNT”等具体数量表达）。","在不同语境中，TNT 也可能是专有名词缩写（如电视网络名称）；遇到大写缩写时，最好结合上下文判断具体含义。","网络用法“TNT=try not to”比较口语化，多见于短视频标题或挑战类内容，并非正式英语。"]}

