{"word":"tp","summary":{"en":"“TP/tp” is a common abbreviation, most often meaning “toilet paper,” and in gaming often meaning “teleport.”","zh":"“TP/tp”是常见缩写，最常指“toilet paper（卫生纸/厕纸）”，在游戏中常指“teleport（传送）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “toilet paper.”","zh":"“toilet paper（卫生纸/厕纸）”的缩写。"},"examples":[{"en":"Do we have any TP left in the bathroom?","zh":"浴室里还有厕纸（TP）吗？"},{"en":"I forgot to buy TP at the store.","zh":"我忘了在店里买卫生纸（TP）了。"}]},{"partOfSpeech":"other","definition":{"en":"(gaming/slang) an abbreviation for “teleport,” meaning to move instantly to another place in a game.","zh":"（游戏俚语）“teleport（传送）”的缩写，指在游戏中瞬间移动到另一个地点。"},"examples":[{"en":"TP to me when you’re ready.","zh":"你准备好就传送（TP）到我这边。"},{"en":"My TP is on cooldown.","zh":"我的传送（TP）还在冷却中。"}]},{"partOfSpeech":"other","definition":{"en":"(general) an abbreviation used in some fields to mean “test plan,” “technical preview,” or other context-specific phrases; the exact meaning depends on where it appears.","zh":"（通用）在不同领域中可表示“test plan（测试计划）”“technical preview（技术预览版）”等；具体含义取决于使用场景。"},"examples":[{"en":"Please review the TP before we start testing.","zh":"开始测试前请先审阅测试计划（TP）。"},{"en":"They released a TP build for early users.","zh":"他们给早期用户发布了一个技术预览版（TP）。"}]}],"synonyms":["toilet paper","teleport (game slang)"],"phonetic":"/ˌtiːˈpiː/","extraExplanation":["“TP”最常见的读法是按字母读：/ˌtiːˈpiː/（T-P）。","在日常聊天里，如果只看到“tp”而没有上下文，最常见的理解通常是“toilet paper（厕纸）”。在游戏聊天中则很常指“teleport（传送）”。","如果你能告诉我出现“tp”的场景（比如一句话、游戏名、工作文档），我可以帮你锁定最准确的含义。"]}
{"word":"TPA","summary":{"en":"TPA is a common abbreviation that can mean a third-party administrator (insurance/benefits), thyroid peroxidase antibody (a lab marker), or Tampa International Airport (code TPA).","zh":"TPA是常见缩写，可能指第三方管理机构（保险/福利）、甲状腺过氧化物酶抗体（化验指标），或美国坦帕国际机场（代码TPA）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Third-Party Administrator,” a company hired to handle administrative tasks (often insurance claims, benefits, or payroll) for another organization","zh":"“Third-Party Administrator（第三方管理机构/第三方理赔管理公司）”的缩写：受雇为其他机构处理行政事务（常见于保险理赔、员工福利或薪资等）"},"examples":[{"en":"Our employer uses a TPA to process health insurance claims.","zh":"我们雇主使用一家TPA来处理医疗保险理赔。"},{"en":"Contact the TPA if you need help with your benefits paperwork.","zh":"如果你需要福利申请材料方面的帮助，请联系TPA。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “thyroid peroxidase antibody,” a blood-test marker related to autoimmune thyroid disease","zh":"“thyroid peroxidase antibody（甲状腺过氧化物酶抗体）”的缩写：一种血液检测指标，常用于评估自身免疫性甲状腺疾病"},"examples":[{"en":"The lab report shows elevated TPA levels, so the doctor ordered more thyroid tests.","zh":"化验单显示TPA水平升高，所以医生安排了更多甲状腺检查。"},{"en":"Ask your clinician what your TPA result means in your case.","zh":"你可以问临床医生：你的TPA结果在你的具体情况中意味着什么。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for Tampa International Airport (airport code: TPA) in Florida, U.S.","zh":"美国佛罗里达州坦帕国际机场的机场代码（TPA）"},"examples":[{"en":"I’m flying into TPA tomorrow morning.","zh":"我明天早上飞到TPA（坦帕国际机场）。"},{"en":"The cheapest tickets were to TPA instead of Miami.","zh":"最便宜的机票是飞TPA，而不是迈阿密。"}]}],"synonyms":["T-P-A (spelled out)","third-party administrator (for sense 1)","thyroid peroxidase antibody (for sense 2)","Tampa International Airport (for sense 3)"],"phonetic":"/ˌtiː piː ˈeɪ/","extraExplanation":["“TPA”是首字母缩写，在不同领域含义差异很大。读到它时最重要的是看上下文：在人力资源/保险文件里常指第三方管理机构；在医疗化验单里可能指甲状腺相关抗体；在旅行语境里常是机场代码。","读字母缩写时，英语里通常逐个念字母：T-P-A。写作中第一次出现时，正式文本常会先写全称再写（TPA）。"]}
{"word":"TPP","summary":{"en":"TPP most often refers to the Trans-Pacific Partnership (a trade agreement proposal). In medical contexts, it can mean total parenteral nutrition.","zh":"TPP最常指跨太平洋伙伴关系协定（贸易协定构想）；在医学语境中也可指全肠外营养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually) the Trans-Pacific Partnership: a proposed international trade agreement among Pacific Rim countries, discussed widely in politics and economics in the 2010s.","zh":"（通常指）跨太平洋伙伴关系协定：一项在2010年代广受讨论的国际贸易协定构想，涉及多个环太平洋国家，在政治与经济领域常被提及。"},"examples":[{"en":"The TPP became a major topic in U.S. political debates during the 2016 election.","zh":"TPP在2016年美国大选期间成为政治辩论的重要议题。"},{"en":"Supporters said the TPP could expand trade, while critics worried about jobs and regulations.","zh":"支持者认为TPP能扩大贸易，而批评者担心就业与监管问题。"},{"en":"After the U.S. withdrawal, several countries moved forward with a revised deal related to the TPP.","zh":"美国退出后，多个国家推进了一份与TPP相关的修订版协议。"}]},{"partOfSpeech":"n.","definition":{"en":"A common abbreviation in medicine for “total parenteral nutrition,” giving nutrition through an IV when a person cannot eat normally.","zh":"医学中常用缩写，指“全肠外营养”：当病人无法正常进食时，通过静脉输注提供营养。"},"examples":[{"en":"After surgery, the patient was placed on TPP/TPN for a short period.","zh":"手术后，病人短期内使用TPP/TPN进行营养支持。"},{"en":"The doctor explained that TPP provides calories and nutrients directly into the bloodstream.","zh":"医生解释说，TPP会将热量与营养直接输入血液。"}]}],"synonyms":["Trans-Pacific Partnership","CPTPP (related revised agreement)","TPN (medical: total parenteral nutrition)"],"phonetic":"/ˌtiː piː ˈpiː/","extraExplanation":["在新闻与社会议题里，TPP最常指“Trans-Pacific Partnership”。后来与其相关、由多国继续推动的版本常写作CPTPP（Comprehensive and Progressive Agreement for Trans-Pacific Partnership，中文常译“全面与进步跨太平洋伙伴关系协定”）。","医学语境中更常见的写法是TPN（total parenteral nutrition）；有些地区或旧资料也会看到TPP的写法。阅读时可用上下文（贸易/政治 vs. 医疗/营养）来判断。"]}

