{"word":"TSA","summary":{"en":"TSA most commonly means the U.S. Transportation Security Administration, the agency that runs airport security screening.","zh":"TSA最常指美国“运输安全管理局”，负责机场等交通运输的安检。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Transportation Security Administration: a U.S. government agency responsible for security in transportation, especially airport screening.","zh":"（美国）运输安全管理局：负责交通运输安全的政府机构，尤其负责机场安检。"},"examples":[{"en":"You have to show your ID to the TSA at the security checkpoint.","zh":"在安检口你必须向TSA出示身份证件。"},{"en":"TSA rules limit the size of liquids you can bring on a plane.","zh":"TSA规定限制你带上飞机的液体容量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a name used by some organizations for different meanings (often in specific fields), e.g., a local authority or association.","zh":"（较少见）一些机构也会用TSA表示其他名称（多见于特定领域），例如某些地方机构或协会的缩写。"},"examples":[{"en":"In this document, TSA refers to a local Safety Authority, not the U.S. airport agency.","zh":"在这份文件里，TSA指的是当地的“安全管理机构”，不是美国机场安检的那个部门。"}]}],"synonyms":["Transportation Security Administration","airport security (general meaning)"],"phonetic":"/ˌtiː ɛs ˈeɪ/","extraExplanation":["在美国语境里，TSA最常出现在旅行场景：机场“安检”排队、液体/随身行李限制、鞋子和皮带检查、以及“precheck（TSA PreCheck）”等项目。","因为TSA是缩写，阅读时要看上下文：在旅游/机场几乎总是指Transportation Security Administration；在行业报告或其他国家/地区的材料里，可能指不同机构名称。"]}
{"word":"Tsar","summary":{"en":"A tsar is (1) the pre-1917 emperor of Russia, or (2) a powerful official in charge of a major policy area (often spelled “czar” in this sense).","zh":"Tsar 指（1）1917年前俄罗斯皇帝“沙皇”，也可指（2）负责重大事务的强势主管（此义常拼作 czar）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the title of the emperor (supreme ruler) of Russia before 1917","zh":"（1917年前）俄罗斯皇帝的称号；沙皇"},"examples":[{"en":"The last tsar of Russia was Nicholas II.","zh":"俄罗斯最后一位沙皇是尼古拉二世。"},{"en":"Many history books discuss life under the tsar.","zh":"许多历史书会讨论沙皇统治下的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"a powerful official who is put in charge of a major government effort (often used in the U.S.), such as drug policy or climate policy","zh":"（常用于美国）负责某项重大政府事务的强势主管/“总管”，如“缉毒总管”“气候总管”"},"examples":[{"en":"The government appointed a new drug czar to coordinate policy.","zh":"政府任命了一位新的“缉毒总管”来协调政策。"},{"en":"She served as the city’s housing czar during the crisis.","zh":"在危机期间，她担任该市的住房事务“总管”。"}]}],"synonyms":["emperor","monarch","autocrat","policy chief","chief coordinator"],"phonetic":"/zɑr/","extraExplanation":["英文也常写作 czar（尤其是第二种“事务总管”的意思），而 tsar 更常见于历史语境指俄罗斯统治者。两者读音相同。","词源上与拉丁语 Caesar（凯撒）有关，因此在一些语言里也形成了类似“皇帝/帝王”的称号（如德语 Kaiser）。"]}
{"word":"tsar","summary":{"en":"Tsar (also spelled czar) means the Russian emperor before 1917, and it can also mean a powerful official in charge of a policy area.","zh":"Tsar（也拼作czar）指1917年以前的俄国沙皇，也可指负责某一政策领域的强势“专员/主管”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The emperor (autocratic ruler) of Russia before 1917; sometimes used more broadly for other Slavic monarchs such as in Bulgaria or Serbia.","zh":"（1917年之前的）俄国沙皇；有时也泛指其他斯拉夫国家（如保加利亚、塞尔维亚）的君主。"},"examples":[{"en":"Tsar Nicholas II was the last tsar of Russia.","zh":"尼古拉二世是俄国最后一位沙皇。"},{"en":"In history class, we learned how the tsar’s power shaped Russia’s politics.","zh":"在历史课上，我们学习了沙皇的权力如何影响俄国政治。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern English, an informal title for a powerful government official in charge of a specific policy area (often used by the media).","zh":"（现代英语，非正式）“专员/主管”，指负责某一政策领域、权力很大的政府官员（常见于媒体用语）。"},"examples":[{"en":"The city appointed a “drug tsar” to coordinate anti-drug efforts.","zh":"该市任命了一位“禁毒专员”来统筹反毒工作。"},{"en":"Reporters criticized the new housing tsar’s plan.","zh":"记者批评了新任“住房主管”的计划。"}]}],"synonyms":["czar","emperor","autocrat","policy chief"],"phonetic":"/zɑr/","extraExplanation":["“tsar”也常拼作“czar”。两种拼写都常见；“czar”在美国媒体语境里尤其常见，用来比喻“某领域的强势主管”。","词源与“Caesar（凯撒）”有关：拉丁语“Caesar”经由斯拉夫语言演变成“tsar/цар”。因此它带有“皇帝/帝王”的历史意味。","语体提醒：把某人称作“policy tsar / czar”有时会带一点批评或夸张色彩（暗示权力过大或作风强硬），在正式文件里通常不用。"]}
{"word":"tshort","summary":{"en":"A T-shirt is a casual short-sleeved shirt shaped like a “T.”","zh":"T-shirt 指一种休闲短袖上衣，形状像字母“T”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casual shirt with short sleeves and usually a round neck, shaped like the letter “T.”","zh":"T恤；一种休闲上衣，通常为短袖、圆领，形状像字母“T”。"},"examples":[{"en":"I usually wear a T-shirt and jeans on weekends.","zh":"我周末通常穿T恤和牛仔裤。"},{"en":"This T-shirt is too tight around the shoulders.","zh":"这件T恤肩膀那儿太紧了。"}]}],"synonyms":["tee","tee shirt"],"phonetic":"/ˈtiˌʃɝt/","extraExplanation":["你输入的“tshort”在英语里通常不是标准拼写，更常见的是 **T-shirt**（也写作 **tee shirt** 或简写 **tee**）。","“T-shirt”来自它的形状像字母“T”：身体部分像竖线，袖子像横线。日常口语里常说：**a tee**（一件T恤）。"]}
{"word":"tsk","summary":{"en":"A written tongue-click showing disapproval or impatience.","zh":"表示不赞同或不耐烦的“咂舌/啧”声（文字写法）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written representation of a clicking sound made with the tongue to show disapproval, impatience, or to gently scold someone (similar to “tut” or “tut-tut”).","zh":"用文字表示的“咂舌/啧”的声音，常用来表达不赞同、不耐烦，或轻微责备（类似 tut / tut-tut）。"},"examples":[{"en":"Tsk, you forgot to lock the door again.","zh":"啧，你又忘了锁门。"},{"en":"“Tsk-tsk,” she said, shaking her head.","zh":"“啧啧，”她摇着头说。"}]}],"synonyms":["tut","tut-tut","tsk-tsk"],"phonetic":"/tsk/","extraExplanation":["“tsk”通常出现在对话或网络文字里，用来模仿口腔发出的咂舌声；也常写作“tsk-tsk”来加强语气。","英语里和它很接近的还有“tut”或“tut-tut”（更偏英式写法），语气多为轻微责备或不赞成。"]}
{"word":"tsunami","summary":{"en":"A tsunami is a huge sea wave caused mainly by underwater earthquakes or eruptions; it can also be used figuratively for an overwhelming surge.","zh":"tsunami 指多由海底地震/火山等引起的巨大海浪（海啸）；也可比喻压倒性的突发洪流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large ocean wave (or series of waves) caused mainly by an underwater earthquake, volcanic eruption, or landslide, which can flood coastal areas.","zh":"（通常由海底地震、火山爆发或海底滑坡引起的）海啸；可在沿海造成严重淹没的巨大海浪（或海浪群）。"},"examples":[{"en":"A powerful tsunami hit the coast after the earthquake.","zh":"地震后，一场强烈的海啸袭击了海岸。"},{"en":"The warning system alerted residents to evacuate before the tsunami arrived.","zh":"预警系统提醒居民在海啸到来前撤离。"},{"en":"After the tsunami, many communities needed clean water and shelter.","zh":"海啸过后，许多社区需要清洁饮水和住所。"}]},{"partOfSpeech":"n.","definition":{"en":"Used figuratively: a sudden, overwhelming surge of something (such as emotion, problems, or information).","zh":"（比喻）某事物的突然而压倒性的“巨浪/洪流”（如情绪、问题、信息等）。"},"examples":[{"en":"She felt a tsunami of grief after hearing the news.","zh":"听到消息后，她感到悲伤如海啸般汹涌而来。"},{"en":"The team faced a tsunami of emails after the product launch.","zh":"产品发布后，团队面对如海啸般涌来的邮件。"}]}],"synonyms":["seismic sea wave","tidal wave (common but imprecise)"],"phonetic":"/tsuˈnɑmi/","extraExplanation":["“tsunami”一词来自日语：tsu（津，港口）+ nami（波，海浪），因此也常被解释为“港口之波”。它描述的是由海底扰动造成的长波，和由风吹出来的普通海浪不同。","在英语新闻与科普中常见搭配：tsunami warning（海啸警报）、tsunami wave(s)（海啸波）、tsunami evacuation route（海啸疏散路线）。需要注意的是，媒体有时会说“tidal wave”（潮汐波）来指海啸，但严格来说这不是同一个概念。"]}

