{"word":"ty","summary":{"en":"“ty” is a casual abbreviation meaning “thank you,” mostly used in texting and online chat.","zh":"“ty”是“thank you”的随意缩写，多用于短信和网络聊天。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, texting) Abbreviation of “thank you.”","zh":"（非正式，短信/聊天）“thank you”的缩写，表示“谢谢”"},"examples":[{"en":"ty for your help!","zh":"谢谢你的帮助！"},{"en":"Ty! I really appreciate it.","zh":"谢谢！我真的很感激。"}]},{"partOfSpeech":"other","definition":{"en":"A short form for “thank-you,” often used in casual notes or online messages.","zh":"“thank-you（感谢）”的简写，常见于随手便条或网络消息中"},"examples":[{"en":"TY card = thank-you card.","zh":"TY card = 感谢卡。"},{"en":"Send a quick ty after the interview.","zh":"面试后发个简短的致谢消息。"}]}],"synonyms":["thanks","thx","thank you"],"phonetic":"/tiː ˈwaɪ/","extraExplanation":["“ty”主要用于非常随意的场合（聊天、游戏、社交平台）。在正式邮件、求职申请、老师/客户沟通中，建议写完整的“Thank you”或更正式的表达（如“Thank you very much,” “I appreciate your help.”），更礼貌、更专业。"]}
{"word":"tycoon","summary":{"en":"A tycoon is a very rich and powerful business leader; historically, it could also refer to a Japanese high ruler.","zh":"tycoon 指富有且有权势的商界大亨；在历史语境中也可指日本的高位统治者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very wealthy, powerful person in business or industry (often someone who controls a large company or an entire sector).","zh":"（通常指掌控大型公司或某个行业的）大亨；巨商；财阀。"},"examples":[{"en":"She became a tech tycoon after selling her startup for billions.","zh":"她的创业公司以数十亿美元出售后，成了科技大亨。"},{"en":"The media mogul was a tycoon who influenced politics and entertainment.","zh":"那位媒体大亨影响着政治和娱乐界。"}]},{"partOfSpeech":"n.","definition":{"en":"A title used in Japan for a high-ranking military ruler (historical use; similar to ‘shogun’).","zh":"（历史用法）日本的最高军事统治者称号（类似“将军/幕府将军”）。"},"examples":[{"en":"In some older English texts, “tycoon” appears as a translation connected to Japanese rulers.","zh":"在一些较早的英文文本中，“tycoon”会作为与日本统治者相关的译法出现。"}]}],"synonyms":["mogul","magnate","business magnate","captain of industry"],"phonetic":"/taɪˈkun/","extraExplanation":["“tycoon”在现代英语里最常见的意思是“商界大亨”。它常用来描述在某个行业拥有巨大财富与影响力的人（如 real estate tycoon 房地产大亨、oil tycoon 石油大亨、media tycoon 媒体大亨）。","词源上，“tycoon”来自日语“taikun（大君）”，原意指“伟大的君主”。19世纪西方与日本接触时用来称呼日本高层统治者，后来在英语里意义转向为“权势巨大的商业人物”。","相关近义词：mogul（大亨，常指媒体/娱乐等领域）、magnate（财阀/巨头，偏正式）、baron（常见于“robber baron”历史语境）。"]}
{"word":"tygan","summary":{"en":"Tygan is mainly used as a personal name, not a common English vocabulary word.","zh":"Tygan 主要用作人名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (proper noun), used for a person; not a standard common English dictionary word","zh":"人名（专有名词）；不是常见的英语词汇（更常见于名字）"},"examples":[{"en":"Tygan is in my English class.","zh":"Tygan 在我的英语课上。"},{"en":"I met someone named Tygan at the library.","zh":"我在图书馆认识了一个叫 Tygan 的人。"}]}],"phonetic":"ˈtaɪɡən","extraExplanation":["“Tygan”更常见的用法是作为名字（拼写也可能有变体，如 Tegan / Teagan 等）。如果你是想查一个词义（不是人名），可以告诉我它出现的句子或你想表达的意思，我可以帮你确认是不是拼写应为其他单词（例如 tigon、tycoon 等）。"]}
{"word":"tying","summary":{"en":"“Tying” means the act of making a knot or fastening something, and it’s also the -ing form of “tie” used for actions in progress.","zh":"“tying”表示“系/打结/绑住”的动作，也可以是动词 tie 的 -ing 形式，用来表达正在进行的“系、绑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of fastening something with a knot, string, or similar material; the process of making a knot","zh":"打结；系住；用绳/带等把东西固定起来的动作或过程"},"examples":[{"en":"Tying the ribbon neatly takes practice.","zh":"把丝带系得整齐需要练习。"},{"en":"He finished the tying and checked that the knot was tight.","zh":"他系好后又检查结是否牢固。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “tie”: fastening or connecting with a knot or with something that holds things together","zh":"“tie”的现在分词：正在系、绑、打结；把东西连接或固定在一起"},"examples":[{"en":"She is tying her shoes.","zh":"她正在系鞋带。"},{"en":"I’m tying these cables together to keep them tidy.","zh":"我把这些线缆绑在一起，让它们更整齐。"},{"en":"He hurt his finger while tying a fishing line.","zh":"他系鱼线时弄伤了手指。"}]}],"synonyms":["knotting","fastening","binding"],"phonetic":"/ˈtaɪ.ɪŋ/","extraExplanation":["“tying”既可以当名词（the tying：系结这一动作），也常见于进行时/分词结构（be tying：正在系）。学习时可通过句型区分：the tying of...（名词用法） vs. is tying...（动词用法）。","常见搭配：tying a knot（打结）、tying your shoes（系鞋带）、tying up a bag（把袋口系紧）、tying someone to a chair（把某人绑在椅子上，语境多为负面/犯罪场景，使用需谨慎）。"]}
{"word":"tyke","summary":{"en":"Tyke means a small child (often a young boy) or, less commonly, a small dog, said in a friendly, informal way.","zh":"tyke 指“小孩子（常指小男孩）”，也可指“小狗”，多为亲昵、口语化的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young child, especially a small boy (often used in a friendly, informal way)","zh":"小孩子；（尤指）小男孩（常为亲切、非正式说法）"},"examples":[{"en":"Come here, you little tyke—let me fix your jacket.","zh":"过来呀，小家伙——我帮你整理一下外套。"},{"en":"When I was a tyke, I loved building forts out of blankets.","zh":"我小时候最爱用毯子搭“堡垒”。"}]},{"partOfSpeech":"n.","definition":{"en":"a small dog (especially a mixed-breed), sometimes used playfully","zh":"小狗；（尤指）杂种小狗（有时带玩笑/亲昵称呼）"},"examples":[{"en":"That tyke keeps following me around the neighborhood.","zh":"那只小狗一直在街区里跟着我。"},{"en":"She adopted a scruffy little tyke from the shelter.","zh":"她从收容所领养了一只毛茸茸的小狗。"}]}],"synonyms":["kid","little one","youngster","child","pup"],"phonetic":"/taɪk/","extraExplanation":["“tyke”语气通常亲昵、口语化，带一点调侃但不粗鲁；用在陌生孩子身上要注意场合，避免显得不礼貌。","词源上与苏格兰/北方英语中表示“孩子/小家伙”的用法有关，因此在英国英语里也常见；美式英语里多作为轻松口吻的称呼。","常见近义称呼（语气不同）：kid（中性常用），little one（更温柔），brat（偏负面，指“熊孩子”），urchin（文学/戏谑，常指“小淘气”或“街头小孩”）。"]}
{"word":"tylerism","summary":{"en":"Tylerism is a rare noun meaning “the ideas or style associated with someone named Tyler,” especially U.S. President John Tyler; it can also be used informally online as a playful label for a modern Tyler’s style.","zh":"Tylerism 是个罕见名词，指“与某位名叫 Tyler 的人相关的思想/政策或风格”，尤其在历史语境中指美国总统 John Tyler 的政治立场；网络上也可作非正式戏称，指某位当代 Tyler 的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The ideas, policies, or characteristic style associated with a person named Tyler—most commonly used in historical writing to mean the politics associated with U.S. President John Tyler (1790–1862).","zh":"（罕见）与名叫 Tyler 的某个人相关的思想、政策或典型风格——在历史语境中最常指与美国第十任总统约翰·泰勒（John Tyler）的政治立场/政策相关的东西。"},"examples":[{"en":"Some newspapers attacked what they called “Tylerism” during the political disputes of the 1840s.","zh":"一些报纸在19世纪40年代的政治争论中抨击他们所谓的“Tylerism（泰勒主义）”。"},{"en":"The author contrasts Jacksonian ideas with Tylerism to show how parties were shifting.","zh":"作者把杰克逊主义与“Tylerism（泰勒主义）”对比，以展示政党立场如何变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, modern) A joking or fan-made label for the style, brand, or worldview associated with a contemporary public figure named Tyler (for example, an artist).","zh":"（非正式·现代）粉丝或玩笑式的说法，用来指代某位名叫 Tyler 的当代公众人物（如艺术家）的风格、品牌或“世界观”。"},"examples":[{"en":"Online, people describe his bold outfits as “Tylerism.”","zh":"在网上，人们把他大胆的穿搭称作“Tylerism”。"},{"en":"That kind of humor is pure Tylerism.","zh":"那种幽默感简直就是“Tylerism”。"}]}],"synonyms":["(historical) Tyler’s policies","(informal) Tyler-style","Tyler-esque style"],"phonetic":"/ˈtaɪlərɪzəm/","extraExplanation":["“Tylerism”不是高频词，通常只会在特定语境里出现：要么是历史/政治写作中谈到 John Tyler 及其立场，要么是网络语境里把某个名叫 Tyler 的人的风格戏称为一种“主义”。理解时要先看上下文在指哪位 Tyler。","后缀 -ism 在英语里常用来表示“主义/思想体系/风格”（如 realism 现实主义、capitalism 资本主义）。因此 “Tylerism” 的核心含义往往是“泰勒式的（思想/风格）”。"]}
{"word":"tylerite","summary":{"en":"A rare historical word meaning a follower of Wat Tyler (linked to the 1381 Peasants’ Revolt).","zh":"罕见历史词：指沃特·泰勒的追随者（与1381年英格兰农民起义相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or follower of Wat Tyler, especially in reference to the English Peasants’ Revolt of 1381 (a rare historical term).","zh":"（罕见历史用语）指沃特·泰勒（Wat Tyler）的支持者或追随者，尤指1381年英格兰农民起义中的泰勒派/泰勒追随者。"},"examples":[{"en":"Some chroniclers used “Tylerites” to describe the rebels who rallied behind Wat Tyler.","zh":"一些编年史作者用“Tylerites”来指称聚集在沃特·泰勒旗帜下的起义者。"},{"en":"The play depicts a crowd of Tylerites demanding fairer laws and lower taxes.","zh":"这部戏描写一群泰勒追随者要求更公平的法律与更低的税负。"}]}],"synonyms":["rebel","insurgent","follower (of Wat Tyler)"],"phonetic":"/ˈtaɪlərˌaɪt/","extraExplanation":["“Tylerite”由人名“Tyler”加上表示“……追随者/信奉者”的后缀“-ite”构成（如：Luddite 卢德分子）。它带有明显的历史语境色彩，现代英语中几乎不用于日常表达，更多出现在历史写作或对中世纪英格兰社会运动的讨论里。","相关阅读线索：Wat Tyler（沃特·泰勒）是1381年英格兰农民起义的重要领袖之一，因此“Tylerite(s)”可用来概括当时追随他的一部分起义者。"]}
{"word":"tylerize","summary":{"en":"“Tylerize” is an informal, playful verb meaning to make something fit Tyler’s style or identity.","zh":"“Tylerize”是非正式的玩笑式动词，表示把某物调整成符合 Tyler 的风格或标识。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, rare) To make something more like Tyler, or to do something in Tyler’s style; to adapt something to match a person named Tyler (often used playfully online).","zh":"（非正式、少见）把某物“变得更像 Tyler”，或用 Tyler 的风格去做事；把某物调整成符合名叫 Tyler 的人的偏好（常见于网络玩笑式用法）。"},"examples":[{"en":"Can you tylerize the playlist so it has more indie rock?","zh":"你能把歌单“tylerize”一下，多放点独立摇滚吗？"},{"en":"They tylerized the presentation—shorter, funnier, and more direct.","zh":"他们把演示“tylerize”了——更短、更搞笑、更直接。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, rare) To turn something into a “Tyler” version; to brand or rename something with “Tyler” as a key identity.","zh":"（非正式、少见）把某物变成“Tyler 版本”；用“Tyler”作为核心标识来包装或改名。"},"examples":[{"en":"The meme page tylerized the slogan for April Fools’ Day.","zh":"那个梗图主页在愚人节把标语“tylerize”成了 Tyler 风格的版本。"}]}],"synonyms":["personalize","customize","tailor","adapt","rebrand"],"phonetic":"/ˈtaɪlərˌaɪz/","extraExplanation":["“tylerize”不是常见词，更多是临时造词/网络用语。英语里常用后缀 -ize 表示“使变成……/使具有……特征”（如 modernize, standardize），所以把人名 Tyler 加上 -ize，就有“让它更 Tyler”的意思。","有时它也会被当作对 tailor（量身定做）的谐音梗来用：tylerize ≈ tailorize（让它更符合某人的口味）。"]}
{"word":"tympanic","summary":{"en":"Tympanic usually means “related to the eardrum,” and sometimes “drum-like” in sound.","zh":"tympanic 通常指“与鼓膜有关”，有时也指“鼓声般的/像鼓一样共鸣的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the eardrum (the thin membrane inside the ear).","zh":"与鼓膜（耳内的薄膜）有关的；鼓膜的。"},"examples":[{"en":"The doctor saw redness on the tympanic membrane.","zh":"医生看到鼓膜发红。"},{"en":"A tympanic infection can cause ear pain and reduced hearing.","zh":"鼓膜相关的感染可能会引起耳痛和听力下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a drum or sounding like a drum; resonant.","zh":"与鼓有关的；像鼓声一样的；有共鸣的。"},"examples":[{"en":"The hall produced a tympanic boom when the door slammed.","zh":"门猛地关上时，大厅里发出像鼓一样的轰响。"},{"en":"The composer wanted a tympanic effect to build tension.","zh":"作曲家想用类似鼓声的效果来营造紧张感。"}]}],"synonyms":["eardrum-related","drumlike","resonant"],"phonetic":"/tɪmˈpænɪk/","extraExplanation":["“tympanic”来自希腊语 *tympanon*（鼓）。医学里常见搭配是 *tympanic membrane*（鼓膜）与 *tympanic cavity*（鼓室，中耳的一部分）。","日常英语中更常说“eardrum”；“tympanic”更偏医学/专业用语。"]}
{"word":"tympanitis","summary":{"en":"Tympanitis means inflammation of the eardrum and/or middle ear.","zh":"tympanitis 指鼓膜和/或中耳（鼓室）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the tympanum (the eardrum and/or the middle ear).","zh":"鼓室炎；鼓膜（耳膜）和/或中耳的炎症。"},"examples":[{"en":"The doctor suspected tympanitis because the eardrum looked red and swollen.","zh":"医生怀疑是鼓室炎，因为耳膜看起来发红并且肿胀。"},{"en":"Severe ear pain and fever can sometimes be signs of tympanitis.","zh":"剧烈耳痛和发烧有时可能是鼓室炎的迹象。"},{"en":"Treatment for tympanitis depends on the cause, such as infection or injury.","zh":"鼓室炎的治疗取决于病因，例如感染或外伤。"}]}],"synonyms":["myringitis","otitis media (related)","middle ear inflammation"],"phonetic":"/ˌtɪm.pəˈnaɪ.tɪs/","extraExplanation":["这是偏医学/耳鼻喉科用词，日常英语里更常听到的是 otitis media（中耳炎）或 eardrum inflammation（耳膜发炎）。","词根提示：tympan- 与 “tympanum（鼓膜/鼓室）”有关，-itis 表示“炎症”（如 bronchitis 支气管炎、tonsillitis 扁桃体炎）。","如果你在医学报告或较正式文本中看到 tympanitis，它通常是在强调“鼓膜/鼓室的炎症”这一部位。"]}
{"word":"tympanum","summary":{"en":"Tympanum most commonly means the eardrum; it can also mean a drum-like hearing organ in animals/insects or a decorated architectural space above a doorway.","zh":"tympanum 最常指“鼓膜（耳鼓）”；也可指动物/昆虫的鼓膜听觉器官，或建筑中门口拱内上方可装饰的门楣壁区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, stretched membrane in the ear (the eardrum) that vibrates when sound waves hit it, helping you hear.","zh":"（耳）鼓膜；在耳内的一层薄膜，受到声波冲击会振动，帮助听觉形成。"},"examples":[{"en":"Loud noise can damage the tympanum and affect hearing.","zh":"巨大的噪音可能损伤鼓膜，影响听力。"},{"en":"The doctor checked his tympanum for signs of infection.","zh":"医生检查了他的鼓膜，看是否有感染迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"In some animals (especially insects), a drum-like hearing organ used to detect sound or vibrations.","zh":"（某些动物，尤指昆虫的）鼓膜器官；一种像鼓面一样的听觉结构，用来感知声音或振动。"},"examples":[{"en":"Many insects sense vibrations through a tympanum on the body.","zh":"许多昆虫通过身体上的鼓膜器官感知振动。"},{"en":"The tympanum helps the insect detect predators.","zh":"鼓膜器官帮助昆虫察觉捕食者。"}]},{"partOfSpeech":"n.","definition":{"en":"In architecture, the (often decorated) triangular or semicircular area above a doorway, especially in a church, inside the arch.","zh":"（建筑）门楣拱内的山墙面/门楣壁；常见于教堂门口拱门内、可雕刻装饰的三角形或半圆形区域。"},"examples":[{"en":"The cathedral’s tympanum is carved with scenes from the Bible.","zh":"这座大教堂的门楣壁雕刻着《圣经》故事场景。"},{"en":"They studied the tympanum above the main entrance for its symbolism.","zh":"他们研究主入口上方门楣壁的象征意义。"}]}],"synonyms":["eardrum","tympanic membrane"],"phonetic":"/ˈtɪm.pə.nəm/","extraExplanation":["词源提示：tympanum 来自拉丁语/希腊语，原意与“鼓（drum）”有关，所以无论是耳中的鼓膜，还是昆虫的鼓膜器官、以及拱门上像“鼓面”一样的装饰区，都共享“薄膜/鼓面”的形象。","使用注意：日常英语里更常说 eardrum（鼓膜）。tympanum 比较偏医学、生物学或艺术史/建筑史语境。"]}
{"word":"tympany","summary":{"en":"Tympany is a medical term for gas-caused swelling (often of the abdomen) and the drumlike hollow sound heard when tapping a gas-filled area.","zh":"Tympany 是医学用语，指因积气导致的鼓胀（常见于腹部），也可指叩诊时出现的鼓样空响（鼓音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) An abnormal swelling of the abdomen (or another body area) caused by trapped gas; a “bloated,” drum-like distension.","zh":"（医学）因气体积聚导致的异常胀大（常指腹部）；呈“鼓胀”样的膨隆。"},"examples":[{"en":"The doctor noted abdominal tympany and ordered tests to check for bowel obstruction.","zh":"医生发现腹部鼓胀，并安排检查以排除肠梗阻。"},{"en":"After surgery, the patient developed tympany due to slowed intestinal movement.","zh":"术后患者因肠蠕动减慢出现腹部胀气鼓胀。"}]},{"partOfSpeech":"n.","definition":{"en":"A drumlike sound, especially the hollow, resonant sound heard when tapping (percussing) a gas-filled area of the body.","zh":"（尤指体检时）敲击含气部位出现的鼓样、空响的声音。"},"examples":[{"en":"On percussion, there was tympany over the stomach area.","zh":"叩诊时，胃部区域呈鼓音。"},{"en":"Tympany can suggest excess gas rather than fluid.","zh":"鼓音常提示气体过多而非积液。"}]}],"synonyms":["bloating","abdominal distension","gaseous distension","tympanitic sound"],"phonetic":"/ˈtɪm.pə.ni/","extraExplanation":["“tympany”源自希腊语 *tympanon*（鼓），所以它的核心意象是“像鼓一样鼓起来/发出鼓样回声”。在临床语境中常与腹胀、肠梗阻或胃肠积气等一起出现，更多见于书面或医学记录。","不要与“tympanum”（鼓膜/中耳鼓室相关）混淆：两者词源相关，但一个主要讲“鼓胀/鼓音”，另一个是耳部解剖名词。"]}
{"word":"tyndallization","summary":{"en":"Tyndallization is intermittent sterilization: repeated heating with rest periods to kill microbes, including spores that germinate between heatings.","zh":"Tyndallization 指“间歇灭菌法”：通过多次加热并在间隔期静置，使芽孢萌发后再被杀灭，从而达到灭菌效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sterilization method that uses repeated heating (usually steaming) with cooling periods in between to kill microorganisms, including spores that germinate between heatings; also called intermittent sterilization.","zh":"一种灭菌方法：通过“反复加热（常为蒸汽加热）+间隔冷却/静置”的循环来杀灭微生物；间隔期让芽孢萌发，再在下一次加热中被杀死，也称“间歇灭菌法”。"},"examples":[{"en":"Because the medium couldn’t be autoclaved, the lab used tyndallization over three days.","zh":"因为这种培养基不能高压灭菌，实验室采用了为期三天的间歇灭菌法（tyndallization）。"},{"en":"Tyndallization relies on heating cycles so that spores can germinate and then be destroyed in later rounds.","zh":"Tyndallization 依靠加热循环：先让芽孢在间隔期萌发，再在后续加热中被消灭。"}]}],"synonyms":["intermittent sterilization","fractional sterilization"],"phonetic":"/ˌtɪn.də.laɪˈzeɪ.ʃən/","extraExplanation":["该词来自英国物理学家 John Tyndall（廷德尔）。他在19世纪的微生物研究中强调：单次加热可能杀不死耐热芽孢，因此需要“加热—静置—再加热”的多次循环。","典型做法是连续几天每天加热一次（常见说法是“3天法”），每次加热后放置一段时间让残存芽孢萌发成更易被热杀死的营养细胞。","局限：并不总能保证像高压灭菌（autoclaving）那样可靠；对某些芽孢或操作条件不理想时可能失败，因此现代实验室更常用高压灭菌或过滤灭菌。"]}
{"word":"tyndallize","summary":{"en":"Tyndallize means to make a substance show the Tyndall effect—visible light scattering due to tiny suspended particles.","zh":"Tyndallize 指使物质呈现丁达尔效应：因微小悬浮颗粒导致可见的光散射。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a liquid or mixture show the Tyndall effect (light scattering), often by creating or emphasizing tiny suspended particles; more broadly, to make something appear “hazy” by fine dispersion.","zh":"使液体或混合物产生（或更明显地呈现）丁达尔效应（光散射），通常通过形成或强调极微小的悬浮颗粒；引申为使物质因微粒分散而显得“朦胧/浑浊”。"},"examples":[{"en":"The lab assistant tyndallized the solution so the light beam would be visible.","zh":"实验助理让溶液出现丁达尔效应，以便能看到光束。"},{"en":"Fog droplets tyndallize the air, making car headlights look like bright cones.","zh":"雾滴使空气呈现丁达尔效应，让车灯看起来像明亮的光锥。"}]}],"synonyms":["cause light scattering","make (a mixture) colloidal","render hazy"],"phonetic":"/ˈtɪn.dəˌlaɪz/","extraExplanation":["“tyndallize”来自物理学家 John Tyndall（约翰·丁达尔）。丁达尔效应常用来区分真溶液与胶体：胶体中的微粒会散射光，使光路可见（例如牛奶、雾、含尘空气）。","该词在日常英语里非常少见，更常见的表达是 “show/exhibit the Tyndall effect” 或 “cause light scattering”。在科学写作中使用会更自然。"]}
{"word":"typ","summary":{"en":"“typ” is a casual short form of “type,” mainly used online.","zh":"“typ”是“type”的非正式缩写，主要用于网络交流。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an informal abbreviation of “type,” often used in texting or online chat to mean the kind or category of something, or to introduce a classification (e.g., “this typ of music”).","zh":"“type”的非正式缩写，常见于短信或网络聊天中，表示“类型/种类”，或用于引出分类（如“这种音乐的typ”）。"},"examples":[{"en":"What typ of phone do you use?","zh":"你用什么类型的手机？"},{"en":"This typ of joke doesn’t translate well.","zh":"这种类型的笑话不太好翻译。"},{"en":"Typ “yes” if you agree.","zh":"同意的话就打“yes”。"}]}],"synonyms":["type (standard spelling)","kind","sort"],"phonetic":"/taɪp/","extraExplanation":["“typ”多见于非正式场合（聊天、游戏、社交媒体）。在正式写作、邮件或作业中建议写完整的“type”。","注意语境：有时“typ”也可能只是把“type”少打了一个字母的拼写错误。"]}
{"word":"typal","summary":{"en":"Typal means “representative of a type,” and in academic/literary contexts it can mean “related to an archetypal pattern.”","zh":"typal 指“典型的/有代表性的”；在学术或文学语境中也可指“与原型模式有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Representative of a type; typical; having the main features of a group or category.","zh":"典型的；有代表性的；体现某一类事物主要特征的。"},"examples":[{"en":"The story has a typal hero who leaves home, faces trials, and returns changed.","zh":"这个故事里有一个典型的英雄：离家出发、经历考验、归来时已改变。"},{"en":"That reaction is typal of how people respond under pressure.","zh":"那种反应很典型，代表了人们在压力下的常见反应。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an original model or archetype; based on a symbolic “pattern” used to interpret other things (often in literature or religion).","zh":"（常用于文学或宗教语境）与原型/母题有关的；基于象征性“模式”来解读其他事物的。"},"examples":[{"en":"In typal readings of myths, the flood can represent renewal as well as destruction.","zh":"在神话的原型式解读中，洪水既可以象征毁灭，也可以象征更新。"},{"en":"Some critics discuss the typal journey as a pattern shared across many cultures’ stories.","zh":"一些评论家讨论“原型式的旅程”作为许多文化故事共有的模式。"}]}],"synonyms":["typical","representative","archetypal","prototypical"],"phonetic":"/ˈtaɪpəl/","extraExplanation":["“typal”比“typical”更少见，也更偏书面语。日常表达里多用 typical；在文学批评、神话研究、宗教研究中更常看到 typal（强调“原型/模式”而不只是“常见”）。","常见搭配：typal figure（原型人物/典型人物）、typal pattern（原型模式）、typal story/journey（原型故事/旅程）。","词源提示：来自 type（类型/模子）+ -al（形容词后缀），意思是“与某种类型/模式有关的”。"]}
{"word":"type","summary":{"en":"Type most commonly means a category or kind; it can also mean a typical kind of person, a font style, or the action of writing with a keyboard.","zh":"Type最常见的意思是“类型/种类”；也可指“某类人的典型”、 “字体/字形”，或动词“打字/键入、归类贴标签”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind or category of something; a group of things that share the same qualities","zh":"类型；种类；（具有共同特征的）类别"},"examples":[{"en":"What type of music do you like?","zh":"你喜欢哪种类型的音乐？"},{"en":"This type of phone is cheaper but less durable.","zh":"这种手机更便宜，但不太耐用。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular person or thing seen as a typical example of a group (often based on personality or style)","zh":"（某类人的）典型；（某种风格/性格的）代表"},"examples":[{"en":"He’s the quiet type.","zh":"他是那种比较安静的人。"},{"en":"She’s my type—smart and funny.","zh":"她是我喜欢的类型——聪明又幽默。"}]},{"partOfSpeech":"n.","definition":{"en":"a printed style or letters used in printing (also called a typeface or font)","zh":"（印刷或屏幕上的）字体；字形（也可说 typeface/font）"},"examples":[{"en":"This book uses a large type that’s easy to read.","zh":"这本书用的是大字号字体，读起来很轻松。"}]},{"partOfSpeech":"v.","definition":{"en":"to write using a keyboard (computer/phone/typewriter)","zh":"（用键盘）打字；键入"},"examples":[{"en":"Please type your name and email address.","zh":"请键入你的姓名和邮箱地址。"},{"en":"I typed the report in one hour.","zh":"我用一个小时把报告打完了。"}]},{"partOfSpeech":"v.","definition":{"en":"to classify or label someone or something as a certain kind (often unfairly or too simply)","zh":"把……归类；给……贴标签（常含“过于简单/不公平”的意味）"},"examples":[{"en":"I don’t want to be typed as just a comedy actor.","zh":"我不想被贴上“只能演喜剧”的标签。"}]}],"synonyms":["kind","sort","category","class","group","genre","font"],"phonetic":"/taɪp/","extraExplanation":["“type”作“类型”时非常常用：type of + 名词（a type of fruit 一种水果）。","“my type”是口语表达，意思是“我喜欢的那种人/风格”。语气可能带有主观评价，使用时注意场合。","“type”与“font/typeface”有关：在排版与印刷领域，type更偏“字形/铅字/字体样式”的概念，日常电脑环境里更常说 font。"]}
{"word":"typecast","summary":{"en":"Typecast means to repeatedly assign someone the same kind of role or to label someone as a certain type (often unfairly).","zh":"Typecast 指（多用于演艺）把人固定在某类角色上，或更广义地把人简单贴标签、归类（常带不公平/刻板意味）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To repeatedly choose an actor for the same kind of role, so they become strongly associated with that character type (sometimes limiting their opportunities).","zh":"（影视/戏剧）反复让演员出演同一类角色，使其被固定在某种“角色类型”上（有时会限制其发展）。"},"examples":[{"en":"After playing villains for years, he worried he would be typecast.","zh":"多年演反派后，他担心自己会被定型。"},{"en":"She didn’t want to be typecast as the ‘cute best friend.’","zh":"她不想被定型成“可爱闺蜜”这种角色。"}]},{"partOfSpeech":"v.","definition":{"en":"To classify or label a person or thing into a particular type, often too simply or unfairly.","zh":"把人或事物简单（有时不公平地）归类或贴标签为某一类型。"},"examples":[{"en":"It’s easy to typecast a quiet student as uninterested, but that may be wrong.","zh":"人们很容易把安静的学生贴上“不感兴趣”的标签，但这可能是错的。"},{"en":"Don’t typecast the city as dangerous based on one news story.","zh":"别因为一条新闻就把这座城市定性为危险。"}]},{"partOfSpeech":"n.","definition":{"en":"A fixed or stereotyped role or category that someone is repeatedly put into, especially in acting.","zh":"（尤指演艺圈）被反复分配的固定/刻板角色类型；定型。"},"examples":[{"en":"He tried to break out of his typecast by taking a serious drama role.","zh":"他接了严肃的剧情片角色，试图摆脱定型。"}]}],"synonyms":["stereotype","pigeonhole","label","categorize"],"phonetic":"/ˈtaɪpˌkæst/","extraExplanation":["“typecast”来自 type（类型）+ cast（选角/分配角色）。在影视行业里常带一点负面含义：演员因为某一类角色太成功而被制作方“安全地”重复使用，导致形象单一。","常见搭配：be typecast as…（被定型为……）；avoid being typecast（避免被定型）；break out of a typecast（摆脱定型）。","相关词：stereotype（刻板印象/使成刻板）、pigeonhole（把……硬塞进某类/给……贴标签，较口语）。"]}
{"word":"typed","summary":{"en":"“Typed” most commonly means written using a keyboard (not handwritten). It can also be the past form of “type.”","zh":"“typed”最常见意思是“用键盘打出来的/打印的（非手写）”；也可以是“type”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"written on a computer, phone, or typewriter using a keyboard (not handwritten).","zh":"用键盘在电脑、手机或打字机上输入并写出的（不是手写的）。"},"examples":[{"en":"Please submit a typed copy of your essay.","zh":"请提交一份你作文的打印/打字版。"},{"en":"Her name was typed at the top of the form.","zh":"她的名字被打在表格的顶部。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “type”: to enter letters or numbers using a keyboard.","zh":"“type”的过去式和过去分词：用键盘输入文字或数字。"},"examples":[{"en":"I typed the report last night.","zh":"我昨晚把报告打出来了。"},{"en":"She typed too fast and made a few mistakes.","zh":"她打得太快，出了几个错误。"}]}],"synonyms":["keyboarded","entered","keyed in","printed (context-dependent)"],"phonetic":"/taɪpt/","extraExplanation":["在学校或正式文件语境里，typed 常常暗含“清晰、规范、可读性强”的要求；有些老师会明确写成 typed, double-spaced（打印/打字版，双倍行距）。","英式英语里也常用 typed，但在某些场景会更常看到 typed up（把草稿整理成打字版/电子版）。"]}
{"word":"typees","summary":{"en":"“Types” usually means different kinds/categories, or it can mean “writes on a keyboard.”","zh":"“types”通常表示“不同种类/类型”，也可以表示“用键盘打字”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “type”: different kinds or categories of people or things.","zh":"“type”的复数：不同的类型、种类（人或事物的分类）。"},"examples":[{"en":"This store sells many types of bread.","zh":"这家店卖很多种类的面包。"},{"en":"There are two types of questions on the test.","zh":"考试里有两种题型。"}]},{"partOfSpeech":"v.","definition":{"en":"to write using a keyboard (third-person singular of “type”).","zh":"用键盘打字（“type”的第三人称单数形式）。"},"examples":[{"en":"She types very fast.","zh":"她打字很快。"},{"en":"He types the report every morning.","zh":"他每天早上把报告打出来。"}]}],"synonyms":["kinds","categories","classes","sorts"],"phonetic":"/taɪps/","extraExplanation":["“typees”通常不是标准英文拼写。你可能想写的是 **types**（type 的复数/动词形式）或 **type**（单数/原形）。如果你告诉我你想表达的句子，我也可以帮你选最自然的写法。"]}
{"word":"typeface","summary":{"en":"A typeface is the design style of printed letters (often casually called a “font”).","zh":"typeface 指文字的设计风格（常被口语上称作 font，即“字体”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of letters, numbers, and symbols that share the same design style (e.g., Times New Roman, Arial).","zh":"（同一风格设计的）字体；字型（如 Times New Roman、Arial）"},"examples":[{"en":"Choose a typeface that is easy to read for long paragraphs.","zh":"选择一种适合长段落阅读、易读的字体。"},{"en":"This brand uses a bold typeface in its logo.","zh":"这个品牌在标志中使用了粗体字型。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular design within a larger font family (often used loosely as “font”).","zh":"（常被宽泛地当作 font 使用）某一款具体字形设计；字型样式"},"examples":[{"en":"The designer paired a serif typeface with a sans-serif one.","zh":"设计师把一种衬线字体和一种无衬线字体搭配在一起。"},{"en":"On websites, a clean typeface can make the layout feel modern.","zh":"在网页上，简洁的字体能让版面显得更现代。"}]}],"synonyms":["font (common but not always precise)","type","lettering style"],"phonetic":"/ˈtaɪpˌfeɪs/","extraExplanation":["在排版里，typeface 通常指“设计风格”（比如 Helvetica 这种字型设计），而 font 更常指“具体文件/具体样式与大小”（例如 Helvetica Bold 12 pt）。不过在日常英语里，很多人会把 typeface 和 font 混用，也不算错误。","常见相关词：serif（衬线字体，如 Times）、sans-serif（无衬线字体，如 Arial）、monospace（等宽字体，如 Courier）、script（手写体/花体）。","在品牌与书籍排版中，选择 typeface 不只是美观：它会影响可读性、语气与文化联想（例如衬线字体更“传统/正式”，无衬线更“现代/简洁”）。"]}
{"word":"types","summary":{"en":"“Types” most commonly means “kinds/categories” (plural of type). It can also mean “writes with a keyboard” (he/she/it types).","zh":"“types”最常见表示“种类/类型”（type 的复数）；也可表示“（他/她/它）打字、输入”（动词 type 的第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Different kinds or categories of things or people.","zh":"不同的种类；类型（复数）。"},"examples":[{"en":"There are many types of music, like jazz, pop, and classical.","zh":"音乐有很多种类型，比如爵士、流行和古典。"},{"en":"What types of food do you like best?","zh":"你最喜欢哪些类型的食物？"}]},{"partOfSpeech":"v.","definition":{"en":"Writes text using a keyboard (third-person singular of “type”).","zh":"用键盘打字（动词 type 的第三人称单数）。"},"examples":[{"en":"She types very fast for her job.","zh":"她为了工作打字非常快。"},{"en":"He types the report and sends it to his manager.","zh":"他把报告打好并发给经理。"}]}],"synonyms":["kinds","categories","sorts","varieties"],"phonetic":"/taɪps/","extraExplanation":["“types”最常见是名词复数，表示“多种类型”。常用搭配：types of + 名词（types of animals / types of problems）。","当“types”作动词时，主语通常是第三人称单数（he/she/it），相当于“打字、输入”。例如：She types emails every day."]}
{"word":"TypeScript","summary":{"en":"TypeScript is a Microsoft-created language that extends JavaScript with optional types and compiles to JavaScript.","zh":"TypeScript 是微软开发的语言，在 JavaScript 基础上加入可选类型等特性，并编译为 JavaScript。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A programming language developed by Microsoft that adds optional static typing and other features to JavaScript, and is compiled into JavaScript.","zh":"由微软开发的一种编程语言，在 JavaScript 的基础上增加可选的静态类型等功能，并会被编译成 JavaScript。"},"examples":[{"en":"We use TypeScript to catch bugs early with type checks.","zh":"我们用 TypeScript 通过类型检查更早发现 bug。"},{"en":"This TypeScript code compiles to JavaScript for the browser.","zh":"这段 TypeScript 代码会编译成浏览器可运行的 JavaScript。"}]},{"partOfSpeech":"n.","definition":{"en":"A file type or code written in the TypeScript language (often with the .ts or .tsx extension).","zh":"TypeScript 语言写成的代码或文件类型（常见扩展名为 .ts 或 .tsx）。"},"examples":[{"en":"Please rename the file to TypeScript and save it as index.ts.","zh":"请把这个文件改成 TypeScript，并保存为 index.ts。"},{"en":"Our React component is in TypeScript, so the file ends with .tsx.","zh":"我们的 React 组件用 TypeScript 写，所以文件以 .tsx 结尾。"}]}],"synonyms":["TS"],"phonetic":"/ˈtaɪpˌskrɪpt/","extraExplanation":["TypeScript 常被称为“JavaScript 的超集（superset）”：绝大多数 JavaScript 代码在 TypeScript 里也能运行，但 TypeScript 额外提供类型标注、接口（interfaces）、更强的开发工具提示等。","它不是直接替代 JavaScript：最终会“编译/转译（compile/transpile）”成 JavaScript，才能在浏览器或 Node.js 中执行。","日常口语里大家常说“TS”。在招聘与项目文档中也很常见，比如“TypeScript + React/Node.js”。"]}
{"word":"typescript","summary":{"en":"TypeScript is a typed superset of JavaScript that compiles to JavaScript.","zh":"TypeScript 是带类型的 JavaScript 超集，会编译成 JavaScript。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A programming language developed by Microsoft that adds optional static types and other features to JavaScript, and is usually compiled (transpiled) into JavaScript.","zh":"一种由微软开发的编程语言，在 JavaScript 基础上加入可选的静态类型等特性，通常会被编译（转译）成 JavaScript。"},"examples":[{"en":"We use TypeScript to catch bugs earlier with type checking.","zh":"我们用 TypeScript 通过类型检查更早发现 bug。"},{"en":"This project is written in TypeScript, but it runs as JavaScript in the browser.","zh":"这个项目用 TypeScript 编写，但在浏览器里是以 JavaScript 形式运行的。"},{"en":"If you know JavaScript, learning TypeScript is usually straightforward.","zh":"如果你懂 JavaScript，学习 TypeScript 通常会比较顺。"}]}],"synonyms":["TS","typed JavaScript (informal)"],"phonetic":"/ˈtaɪpˌskrɪpt/","extraExplanation":["TypeScript 常被称为 JavaScript 的“超集”（superset）：大部分 JavaScript 代码在 TypeScript 里也能直接使用，然后你可以逐步加上类型标注来提高可读性与可维护性。","在真实开发中，TypeScript 常与前端框架（如 React、Angular、Vue）以及 Node.js 后端一起使用；文件扩展名通常是 .ts（以及含 JSX 的 .tsx）。","口语/社区里常把 TypeScript 简称为 “TS”。"]}
{"word":"typeset","summary":{"en":"“Typeset” means to arrange text into a publishable layout, or describes pages that are already laid out for printing.","zh":"“typeset”指把文字排版成可出版的版面；也可形容“已排版好的”页面/校样。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange text for printing or publishing (traditionally using movable type; now often using software)","zh":"（为印刷或出版）排版、排字（传统用活字；现在多用排版软件）"},"examples":[{"en":"The publisher will typeset the manuscript before it goes to print.","zh":"出版社会在印刷前把稿件排版。"},{"en":"She typeset the magazine article in a clean, readable layout.","zh":"她把杂志文章排成清爽、易读的版式。"},{"en":"We need to typeset the equations carefully so they look correct.","zh":"我们需要仔细排版这些公式，确保显示正确。"}]},{"partOfSpeech":"adj.","definition":{"en":"already arranged in final printing form","zh":"已排版好的；已排成付印形式的"},"examples":[{"en":"Please review the typeset pages for any mistakes.","zh":"请校对已排版的页面，看看有没有错误。"},{"en":"The author received a typeset proof to check.","zh":"作者收到了一份排版样（校样）用于检查。"}]}],"synonyms":["set (type)","format","layout","compose"],"phonetic":"/ˈtaɪpˌsɛt/","extraExplanation":["“typeset”最初指把金属活字一块块排进排版框（movable type）。现在多指用排版软件（如 InDesign、LaTeX、Word 的版式功能）把文字、标题、图片与空白间距等整理成可出版的版面。","出版流程里常见搭配：typeset pages（排好版的页面）、typeset proof（校样/排版样）、typesetting（排版工作）。"]}
{"word":"typesetter","summary":{"en":"A typesetter is someone who arranges text for printing or page layout.","zh":"typesetter 指负责把文字进行排版以便印刷或出版的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to arrange text for printing (traditionally by setting metal type, now usually by preparing page layout on a computer).","zh":"排字工；排版员（传统上用铅字排版，如今多指用电脑进行版面排版的人）"},"examples":[{"en":"In the old days, a typesetter set each letter by hand before the pages could be printed.","zh":"过去，排字工必须在印刷前把每个字母都手工排好。"},{"en":"The publisher hired an experienced typesetter to prepare the book’s layout.","zh":"出版社聘请了一位有经验的排版员来制作书的版面。"}]}],"synonyms":["compositor","typesetter","layout artist","page designer"],"phonetic":"/ˈtaɪpˌsɛtər/","extraExplanation":["“typesetter”来自“type（活字/铅字）+ set（摆放/设置）”。在数字排版普及前，排字是一门非常专业的工艺，涉及选字、排版、行距与版面整齐度等。","历史上常见的相关技术包括手工活字排版，以及后来的 Linotype（莱诺排版机）等热排技术；进入计算机时代后，这个角色更多转向桌面出版（DTP）与字体/版式设计。","在文学与出版史语境中，typesetter 常被用来象征“印刷文化”“出版业工人”或“文字如何被制造成书页”的过程。"]}
{"word":"typesetting","summary":{"en":"Typesetting is arranging text on a page for publishing, focusing on fonts, spacing, and layout.","zh":"Typesetting 指为出版而进行的排版：安排文字的字体、间距与版面布局。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of arranging text (and sometimes images) on a page for printing or digital publishing, including choices of font, spacing, and layout","zh":"排版；（为印刷或数字出版）将文字（有时包括图片）按字体、间距与版面布局进行安排的过程"},"examples":[{"en":"Good typesetting makes a long article easier to read.","zh":"良好的排版会让长文章更容易阅读。"},{"en":"The book’s typesetting looks clean, with comfortable spacing and clear headings.","zh":"这本书的排版很干净，行距舒适，标题也清晰。"},{"en":"We finished the editing, and the manuscript is now in typesetting.","zh":"我们完成了编辑，稿子现在进入排版阶段。"}]}],"synonyms":["typography","page layout","composition","formatting"],"phonetic":"/ˈtaɪpˌsɛtɪŋ/","extraExplanation":["“Typesetting”最初指活字印刷时代把金属字块一块块“排”进版面（set type）。如今也常用于电子排版（如杂志、论文、书籍的版式设计）。","相关词：typography（字体排印/字体设计，更强调字体与文字风格）；layout（版面/布局，更强调整体结构）；formatting（格式设置，更常指在软件里调格式，如标题、缩进、项目符号）。"]}
{"word":"typette","summary":{"en":"A “typette” is a small, compact typewriter (sometimes a product name).","zh":"“typette”指小型、轻便的打字机（有时也指某些产品名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small or lightweight typewriter (an old-fashioned typing machine), sometimes used as a brand name for compact typewriters","zh":"小型打字机；轻便打字机（较旧式的打字工具，也有时作为某些便携式打字机的品牌名）"},"examples":[{"en":"She found an old typette in her grandfather’s desk and tried typing a letter.","zh":"她在祖父的书桌里找到一台旧的轻便小打字机，试着打了一封信。"},{"en":"The museum displays a typette alongside early office equipment.","zh":"博物馆把一台小型打字机和早期办公设备一起展出。"}]}],"synonyms":["portable typewriter","compact typewriter","small typewriter"],"phonetic":"/taɪˈpɛt/","extraExplanation":["“typette”由“type（打字）+ -ette（表示“小、轻巧”的后缀）”构成，语气上有“迷你款”的感觉。","这个词在现代英语里不算常用；更常见的说法是“(portable/compact) typewriter（便携式/小型打字机）”。","在一些历史资料或广告语境中，Typette 可能被用作某种便携式打字机的产品名（类似商标/系列名），具体指哪一款要看上下文。"]}
{"word":"typewrite","summary":{"en":"To write by typing, originally on a typewriter; today often replaced by “type.”","zh":"指用键盘（原本是打字机）打字写作；现代更常用“type”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to write text using a typewriter or a keyboard (often in a steady, mechanical way)","zh":"用打字机或键盘打字；以较机械、连续的方式输入文字"},"examples":[{"en":"She learned to typewrite on an old typewriter in school.","zh":"她在学校用一台旧打字机学会了打字。"},{"en":"Could you typewrite the notes and email them to me?","zh":"你能把笔记打出来并邮件发给我吗？"}]},{"partOfSpeech":"n.","definition":{"en":"the act of typing or typed writing (less common)","zh":"打字这一行为；打出来的文字（较少用）"},"examples":[{"en":"His typewrite was fast but noisy on the old machine.","zh":"他在旧机器上打字很快，但声音很大。"}]}],"synonyms":["type","key in","enter","keyboard"],"phonetic":"/ˈtaɪpˌraɪt/","extraExplanation":["“typewrite”最初指用打字机（typewriter）打字；在现代英语里，人们更常说“type”来表示在电脑或手机上输入文字。“typewrite”听起来更偏旧式或强调“打字机时代”的感觉。"]}
{"word":"typewriter","summary":{"en":"A typewriter is mainly a machine for typing on paper; less commonly, it can mean a person whose job is typing.","zh":"typewriter主要指“打字机”；较少见的意思是“打字员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine used for typing characters on paper, usually by pressing keys that strike an inked ribbon","zh":"打字机：一种在纸上打出文字的机器，通常通过按键让字模击打带墨色的色带来印字"},"examples":[{"en":"She typed her first novel on a typewriter.","zh":"她用打字机打出了自己的第一部小说。"},{"en":"The office still keeps an old typewriter as a backup.","zh":"办公室还留着一台旧打字机作为备用。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who types, especially someone whose job is typing (now less common)","zh":"打字员：以打字为主要工作的人（如今较少用）"},"examples":[{"en":"In the 1950s, many companies hired typewriters to prepare letters.","zh":"在20世纪50年代，许多公司会雇用打字员来准备信件。"}]}],"synonyms":["typing machine (for the device)","typist (for the person)"],"phonetic":"/ˈtaɪpˌraɪtɚ/","extraExplanation":["“typewriter”这个词由“type（字模/字体）+ writer（书写者）”构成。随着电脑普及，打字机多见于历史语境、复古风格或文学描写中。","在文学里，打字机常用来营造“机械、节奏感、创作劳动”的氛围；比如描写键盘敲击声、纸张卷动等细节，能突出写作过程的可见性与艰辛。"]}
{"word":"typewriting","summary":{"en":"Typewriting means the act, skill, or work of typing on a typewriter (and sometimes refers generally to traditional typing).","zh":"Typewriting 指用打字机打字的行为、技能或相关工作（有时也泛指传统打字方式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or skill of typing text on a typewriter (and sometimes, more broadly, typing in a traditional “typewriter style”).","zh":"（尤指用）打字机打字的行为；打字技能（有时也泛指传统“打字机式”的打字方式）。"},"examples":[{"en":"She learned typewriting in high school before computers were common.","zh":"在电脑普及之前，她在高中学过打字机打字。"},{"en":"His typewriting speed improved after daily practice.","zh":"他每天练习后，打字机打字速度提高了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or used for typing on a typewriter (often describing skills, classes, or work).","zh":"与打字机打字有关的；用于打字机打字的（常用于描述技能、课程或工作）。"},"examples":[{"en":"She took a typewriting course at the community college.","zh":"她在社区学院上了打字机打字课程。"},{"en":"The job required basic typewriting skills.","zh":"这份工作要求基本的打字机打字技能。"}]}],"synonyms":["typing","keyboarding","typography (not the same; printing/letter design)"],"phonetic":"/ˈtaɪpˌraɪtɪŋ/","extraExplanation":["“Typewriting”在20世纪更常见，因为当时办公主要靠打字机。如今更常用的说法是“typing”，尤其指电脑或手机输入；但在历史、复古语境，或强调打字机时仍会用“typewriting”。","词源上，typewriter（打字机）+ -ing 形成名词，表示“进行打字机打字这件事/这项技能”。"]}
{"word":"typhoean","summary":{"en":"Typhoean means “like Typhon”: monstrous, chaotic, and violently stormy (a literary adjective).","zh":"Typhoean 意为“堤丰般的”：怪物般、混乱且狂暴如风暴（偏文学用语的形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Typhon (also spelled Typhoeus), a giant monster in Greek mythology; often used to suggest something monstrous, chaotic, or violently powerful.","zh":"与希腊神话中的巨怪“堤丰”（Typhon/ Typhoeus）有关的；常用来形容怪物般、混乱或极其强大的力量。"},"examples":[{"en":"The poet described the volcano’s eruption as a Typhoean fury.","zh":"诗人把火山喷发形容为“堤丰般”的狂怒。"},{"en":"A Typhoean storm rolled in, loud with thunder and wind.","zh":"一场“堤丰般”的风暴袭来，雷鸣风吼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Like a whirlwind or tempest; violently stormy and destructive.","zh":"（文学用语）如旋风或暴风雨般的；狂暴而具有破坏性的。"},"examples":[{"en":"The ship struggled against Typhoean seas.","zh":"船只在堤丰般的怒海中艰难前行。"},{"en":"His Typhoean temper flared up without warning.","zh":"他的堤丰般的暴脾气毫无预兆地爆发了。"}]}],"synonyms":["monstrous","titanic","tempestuous","violent","cataclysmic"],"phonetic":"/taɪˈfoʊiən/","extraExplanation":["“Typhoean”源自希腊神话中的 Typhon（堤丰），他常被描写为象征毁灭性的风暴与混乱的怪物，因此这个词在英文里多出现在诗歌、史诗或较高文体中，用来制造“史诗级、怪物级、灾变级”的氛围。","常见拼写变体：Typhoean / Typhonian（都表示“堤丰般的”），但“Typhoean”更偏文学色彩。可在一些古典/浪漫主义作品中见到类似用法（如描写自然力量或恶魔般的混乱）。"]}
{"word":"typhoid","summary":{"en":"Typhoid is an infectious disease (typhoid fever) spread mainly through contaminated food or water; it can also mean “related to typhoid.”","zh":"typhoid 指“伤寒/伤寒热”，多经受污染的食物或水传播；也可作形容词表示“与伤寒有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious infectious disease caused by the bacterium *Salmonella Typhi*, usually spread through contaminated food or water, causing high fever, weakness, stomach pain, and other symptoms","zh":"伤寒：由伤寒沙门氏菌引起的严重传染病，通常通过被污染的食物或水传播，可导致高烧、乏力、腹痛等症状"},"examples":[{"en":"Typhoid is more common in places without clean drinking water.","zh":"在缺乏安全饮用水的地方，伤寒更常见。"},{"en":"The doctor suspected typhoid and ordered a blood test.","zh":"医生怀疑是伤寒，于是安排了血液检查。"},{"en":"Vaccination can help prevent typhoid before traveling to some countries.","zh":"去某些国家旅行前接种疫苗可以帮助预防伤寒。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to typhoid fever","zh":"与伤寒（伤寒热）有关的；伤寒性的"},"examples":[{"en":"He was treated in a typhoid ward.","zh":"他在伤寒病房接受治疗。"},{"en":"Typhoid symptoms can include persistent fever and fatigue.","zh":"伤寒的症状可能包括持续发烧和疲劳。"}]}],"synonyms":["typhoid fever"],"phonetic":"/ˈtaɪ.fɔɪd/","extraExplanation":["“typhoid”来自“typhus（斑疹伤寒等）”一词的历史用法，早期人们常把不同的“高热性疾病”混淆；现代医学中，typhoid 指“伤寒（typhoid fever）”，而 typhus 指“斑疹伤寒（群）”，是不同疾病。","在英语里常见搭配：typhoid fever（伤寒）、typhoid vaccine（伤寒疫苗）、typhoid outbreak（伤寒暴发）、typhoid carrier（伤寒带菌者；典故人物“Typhoid Mary”指无症状携带并传播疾病的人）。"]}
{"word":"Typhon","summary":{"en":"Typhon is a monster in Greek mythology; in older/literary English, it can also be a spelling of “typhoon.”","zh":"Typhon 指希腊神话中的怪物“提丰”；在较旧或文学英语中也可作为“typhoon（台风）”的异拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A huge, terrifying monster (a giant or dragon-like creature) who fought the gods, especially Zeus.","zh":"（希腊神话）提丰：一种巨大而可怕的怪物（常被描绘为巨人或龙形生物），与诸神（尤其宙斯）交战。"},"examples":[{"en":"In Greek myth, Typhon was one of Zeus’s most dangerous enemies.","zh":"在希腊神话中，提丰是宙斯最危险的敌人之一。"},{"en":"The poet compared the roaring volcano to Typhon waking from sleep.","zh":"诗人把咆哮的火山比作沉睡中苏醒的提丰。"}]},{"partOfSpeech":"n.","definition":{"en":"A variant spelling of “typhoon,” used mainly in older or literary English.","zh":"“typhoon（台风）”的异拼写，主要见于较旧或文学性的英文。"},"examples":[{"en":"Some older texts spell the storm as “typhon” instead of “typhoon.”","zh":"一些较早的文本会把“typhoon（台风）”拼作“typhon”。"},{"en":"The ship was damaged by a typhon in the South China Sea.","zh":"那艘船在南海遭遇台风（旧拼法：typhon）而受损。"}]}],"synonyms":["Typhoeus","typhoon (for the storm meaning)"],"phonetic":"/ˈtaɪfɑn/","extraExplanation":["“Typhon（提丰）”来自希腊语 Typhōn，是希腊神话里的怪物之名；英语里的“typhoon（台风）”与其拼写相近，因此在部分旧文或文学作品中会出现“typhon=台风”的用法。现代英语里，指热带气旋时几乎都写作“typhoon”。","文学里用“Typhon”常带有“灾厄、狂暴、毁灭性力量”的象征意味，可用来比喻火山、暴风或战争等。"]}
{"word":"typhon","summary":{"en":"Typhon is a monstrous figure in Greek mythology, and it can also (rarely) mean an old form of “typhoon.”","zh":"Typhon 指希腊神话中的怪物提丰，也可（罕见）作“typhoon（台风）”的旧式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A gigantic, destructive monster (often described as a many-headed serpent or dragon) who fought Zeus; a symbol of chaotic natural forces.","zh":"（希腊神话）提丰：巨大的毁灭性怪物（常被描写为多头巨蛇或巨龙），与宙斯交战；常象征混沌而狂暴的自然力量。"},"examples":[{"en":"In Greek myth, Typhon challenges Zeus for control of the world.","zh":"在希腊神话中，提丰挑战宙斯，争夺世界的统治权。"},{"en":"The poem compares the earthquake’s roar to Typhon waking under the earth.","zh":"这首诗把地震的轰鸣比作沉睡在地下的提丰苏醒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) An older spelling or literary form of “typhoon,” meaning a powerful tropical storm.","zh":"（罕见）“typhoon（台风）”的旧拼写或文学用法，指强烈的热带风暴。"},"examples":[{"en":"Some older texts use “typhon” where we would now write “typhoon.”","zh":"一些较旧的文本会用“typhon”，而现代通常写作“typhoon”。"}]}],"synonyms":["Typhoeus","(rare, storm sense) typhoon"],"phonetic":"/ˈtaɪˌfɑn/","extraExplanation":["“Typhon（提丰）”来自希腊神话体系，常与“Typhoeus”互作异名或相关形象。在英文写作里，Typhon常被用作文学意象，来暗示‘风暴、火山、地震’等失控的自然力量。","它与“typhoon（台风）”在拼写上相近，但现代英语中表示气象现象时通常用“typhoon”；“typhon”更多保留在神话、文学或较旧的用法中。"]}
{"word":"typhonian","summary":{"en":"Typhonian usually means “related to Typhon” and suggests chaotic, violent, mythic power; it can also refer to a specific modern occult tradition.","zh":"Typhonian 通常指“与堤丰有关”，常带有混乱、暴烈、神话式力量的意涵；也可指现代神秘学中的一个特定“堤丰传统/堤丰派”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Typhon, a monster in Greek mythology, or to forces imagined as chaotic, destructive, or primal (often used in literary or symbolic contexts).","zh":"与希腊神话中的怪物“堤丰（Typhon）”有关；或指被想象为混乱、毁灭、原始的力量（常见于文学或象征性语境）。"},"examples":[{"en":"The poem describes a Typhonian storm rising from the sea.","zh":"这首诗描写了一场“堤丰式”的风暴从海上升起。"},{"en":"He painted a Typhonian landscape—dark, volcanic, and violent.","zh":"他画了一幅堤丰式的景象——黑暗、火山般、充满暴烈感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Typhonian tradition in modern Western occultism (a specific esoteric movement).","zh":"与现代西方神秘学中的“堤丰派/堤丰传统（Typhonian tradition）”有关（指特定的秘传流派）。"},"examples":[{"en":"She is researching Typhonian writings in twentieth-century occult circles.","zh":"她正在研究二十世纪神秘学圈子里的堤丰派著作。"},{"en":"The author uses Typhonian imagery to suggest otherworldly transformation.","zh":"作者借用堤丰派的意象来暗示异界般的转化。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who belongs to, supports, or studies the Typhonian tradition (less common).","zh":"堤丰派/堤丰传统的成员、支持者或研究者（较少见）。"},"examples":[{"en":"Some Typhonians debate how to interpret the group’s earliest texts.","zh":"一些堤丰派人士在争论该团体最早文本的解读方式。"}]}],"synonyms":["Typhonic","chthonic","chaotic","stormy","volcanic"],"phonetic":"/taɪˈfoʊniən/","extraExplanation":["“Typhonian”源自 Typhon（堤丰）。在希腊神话里，Typhon 常被描述为巨大、可怕、与风暴/火山/混乱相关的怪物，因此在文学里“Typhonian”常带有“混沌、暴烈、毁灭性、原初力量”的色彩。","在神秘学语境中，“Typhonian tradition”通常指与 20 世纪英国神秘学家 Kenneth Grant（肯尼斯·格兰特）相关的一支传统；因此当你在书评、学术文章或 occult（神秘学）讨论中看到 Typhonian，多半是这个专门含义。"]}
{"word":"typhonic","summary":{"en":"Typhonic means “related to a typhoon” or, in literary contexts, “related to Typhon (Greek mythology).”","zh":"Typhonic 指“与台风有关的”，也可在文学语境中指“与希腊神话的堤丰（Typhon）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a typhoon; stormy or hurricane-like (rare in everyday English).","zh":"与台风有关的；像台风一样的（在日常英语中较少见）。"},"examples":[{"en":"Typhonic winds battered the coastline overnight.","zh":"台风般的强风在夜里猛烈袭击了海岸。"},{"en":"The sailors prepared for typhonic weather in the open sea.","zh":"水手们为公海上的台风式天气做好了准备。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Typhon, a giant monster in Greek mythology (mainly in literary or scholarly writing).","zh":"与希腊神话中的怪物“堤丰（Typhon）”有关的（多见于文学或学术语境）。"},"examples":[{"en":"The poem describes a typhonic force rising from the earth.","zh":"这首诗描写了一股如堤丰般的力量从大地升起。"},{"en":"In some retellings, Zeus battles a typhonic enemy.","zh":"在一些改写故事里，宙斯与堤丰般的敌人交战。"}]}],"synonyms":["typhoon-related","stormy","tempestuous","cyclonic","hurricane-like"],"phonetic":"/taɪˈfɑnɪk/","extraExplanation":["“typhonic”比较少用；更常见的表达是“typhoon-related”或直接用“typhoon”的形容用法（如“typhoon winds/typhoon season”）。","词源上，“typhonic”可与希腊神话中的 Typhon（堤丰）相关，因此在文学里常带有“毁灭性、怪力、混沌”的意象。"]}
{"word":"typhoon","summary":{"en":"A typhoon is a powerful tropical storm in the western Pacific.","zh":"typhoon 指发生在西北太平洋的强热带风暴（台风）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very strong tropical storm in the western Pacific Ocean (the same kind of storm is called a hurricane in the Atlantic and eastern Pacific).","zh":"（发生在西北太平洋的）台风；一种非常强的热带气旋。（同类风暴在大西洋和东太平洋通常称为“飓风”）"},"examples":[{"en":"A typhoon hit the coast last night, bringing heavy rain and strong winds.","zh":"昨晚台风登陆海岸，带来暴雨和强风。"},{"en":"The city issued typhoon warnings and closed schools for safety.","zh":"城市发布台风警报，并为安全起见停课。"},{"en":"After the typhoon, many roads were blocked by fallen trees.","zh":"台风过后，许多道路被倒下的树木堵住了。"}]}],"synonyms":["tropical cyclone","severe tropical storm","cyclone (regional term)"],"phonetic":"/taɪˈfuːn/","extraExplanation":["用法提示：英语里“typhoon / hurricane / cyclone”指的是同一种类型的热带气旋，主要区别在于发生海域的不同：西北太平洋常用 typhoon；大西洋与东太平洋常用 hurricane；印度洋和南太平洋常用 cyclone。","文化与语感：新闻与天气预报中常见搭配有 “typhoon warning（台风警报）”“typhoon season（台风季）”“make landfall（登陆）”。"]}
{"word":"typhus","summary":{"en":"Typhus is a serious infectious disease with fever and rash, typically spread by lice, fleas, or mites.","zh":"Typhus（斑疹伤寒）是一种以发烧和皮疹为典型症状、常由虱子/跳蚤/螨传播的严重传染病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious infectious disease that causes high fever, headache, and rash, usually spread by body lice, fleas, or mites (especially in crowded or unsanitary conditions)","zh":"斑疹伤寒：一种严重的传染病，常见症状有高烧、头痛和皮疹，通常由虱子、跳蚤或螨传播（多见于拥挤或卫生条件差的环境）"},"examples":[{"en":"In the past, typhus often spread quickly in crowded prisons and refugee camps.","zh":"过去，斑疹伤寒常在拥挤的监狱和难民营中迅速传播。"},{"en":"Doctors treated the patient for typhus after he developed a fever and a rash.","zh":"病人出现发烧和皮疹后，医生按斑疹伤寒进行治疗。"}]}],"synonyms":["epidemic typhus","murine typhus"],"phonetic":"/ˈtaɪfəs/","extraExplanation":["“typhus”不要和“typhoid（伤寒）”混淆：两者是不同疾病。typhus 通常与虱子/跳蚤/螨等传播有关；typhoid 多与受污染的食物或水有关。","词源与历史：typhus 来自希腊语，和“迷糊、昏沉”的状态有关。历史上它常与战争、饥荒、拥挤和缺乏卫生条件相伴，因此在一些历史与文学作品中会作为社会灾难与公共卫生危机的象征出现。","常见搭配：typhus outbreak（斑疹伤寒暴发）、louse-borne typhus（虱传斑疹伤寒）、epidemic typhus（流行性斑疹伤寒）。"]}
{"word":"typi","summary":{"en":"“typi” isn’t a standard word; it’s usually a shortened or mistyped form of another word (often “typical”).","zh":"“typi”不是标准单词；通常是其他词（常见为“typical”）的缩写或打字错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; most often seen as a truncated form (informal shortening) of “typical” or as part of a typo.","zh":"本身不是标准英语单词；最常见是“typical（典型的）”的口语/打字缩写，或只是打字错误的一部分。"},"examples":[{"en":"In casual texting, someone might write “typi” but mean “typical.”","zh":"在随意聊天里，有人可能打“typi”，但想表达的是“typical（典型的）”。"},{"en":"I think “typi” is a typo—did you mean “type” or “typo”?","zh":"我觉得“typi”是个拼写错误——你想写的是“type（打字/类型）”还是“typo（错别字）”？"}]}],"synonyms":["typical (intended)","type (possible intended word)","typo (possible intended word)"],"phonetic":"/ˈtaɪpi/","extraExplanation":["“typi”经常出现在手机输入法自动联想或手滑漏打一个字母的情况下。最可能的目标词包括：typical（典型的）、type（打字/类型）、typo（拼写错误）、typing（正在打字）。如果你告诉我你想表达的句子，我可以帮你确定最合适的词。"]}
{"word":"typic","summary":{"en":"Typic means “typical” or “representative,” but it’s uncommon in modern English; “typical” is usually preferred.","zh":"typic 意为“典型的/有代表性的”，但现代英语中较少用，一般更常用 typical。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Typical; having the main features of a particular type; representative.","zh":"典型的；具有某一类型的主要特征；有代表性的。"},"examples":[{"en":"The weather is typic of early spring—sunny but still cold.","zh":"这种天气很典型，像初春一样——有阳光但仍然冷。"},{"en":"Her calm voice is typic of a good teacher.","zh":"她沉稳的声音很典型，像一位好老师。"}]}],"synonyms":["typical","representative","characteristic"],"phonetic":"/ˈtɪpɪk/","extraExplanation":["“typic”在现代英语里比较少见，更常用的是“typical”。在日常写作和考试中，建议用“typical”，以避免显得不自然或被当作拼写错误。","常见搭配：be typical of…（……很典型/很符合……的特征）；a typical example（典型例子）。"]}
{"word":"typical","summary":{"en":"Typical means “usual or normal,” or “a good example of a common type.”","zh":"typical 表示“通常的/正常的”，也可指“具有代表性的、典型的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the usual features of a particular group or situation; normal and expected.","zh":"具有某一类事物或情境的典型特征；通常的、正常且符合预期的。"},"examples":[{"en":"It’s typical for it to rain a lot here in spring.","zh":"这里春天多雨是很常见（很典型）的。"},{"en":"She gave a typical answer: polite but not very detailed.","zh":"她给了一个很典型的回答：礼貌但不太详细。"}]},{"partOfSpeech":"adj.","definition":{"en":"Representing what is most common; a good example of a type (a “typical case” or “typical example”).","zh":"代表最常见的情况；作为某一类别的好例子（“典型案例/典型例子”）。"},"examples":[{"en":"A typical case takes about two weeks to recover.","zh":"典型情况下，大约需要两周恢复。"},{"en":"This is a typical example of modern American architecture.","zh":"这是现代美国建筑的一个典型例子。"}]}],"synonyms":["usual","normal","common","standard","characteristic","representative"],"phonetic":"/ˈtɪpɪkəl/","extraExplanation":["“typical”常用来描述“符合常态/常见规律”。语气一般中性，但在口语里也可能带一点轻微的评价（比如：Typical! 表示“果然如此/就知道会这样”）。","常见搭配：typical of…（是……的典型特征），a typical + 名词（典型的……），It’s typical for + 人/地方 + to…（对……来说很常见）。"]}
{"word":"typicality","summary":{"en":"Typicality means “how typical something is,” or how well it represents the usual example of a group; it’s also a key idea in category research (e.g., robin vs. penguin as birds).","zh":"Typicality 指“典型性/代表性”，即某事物有多符合某类事物的常见特征；在范畴研究中也常用来比较成员是否像该类别的典型例子（如知更鸟比企鹅更像“鸟”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being typical; how well something represents the usual or standard example of a group","zh":"典型性；代表性（指某事物在多大程度上符合某类事物的常见/标准特征）"},"examples":[{"en":"Researchers checked the typicality of the sample to make sure it represented the whole population.","zh":"研究人员检查样本的典型性，以确保它能代表整体人群。"},{"en":"Her accent has a high typicality for that region.","zh":"她的口音非常具有该地区的典型性。"}]},{"partOfSpeech":"n.","definition":{"en":"in psychology and linguistics, the degree to which an item is seen as a good example of a category","zh":"（心理学/语言学）范畴典型性（指某个成员被认为多像某一类别的“好例子”）"},"examples":[{"en":"A robin often has higher typicality for the category “bird” than a penguin.","zh":"在“鸟”这一范畴中，知更鸟通常比企鹅更具典型性。"},{"en":"Typicality can influence how quickly people recognize words and categories.","zh":"典型性会影响人们识别词语和范畴的速度。"}]}],"synonyms":["representativeness","normality","ordinariness"],"phonetic":"/ˌtɪpɪˈkæləti/","extraExplanation":["“typicality”来自形容词 typical（典型的）+ 名词后缀 -ity（表示“性质/状态”）。在日常写作里，它常见于学术语境（如研究报告、心理学/语言学论文）。","近义词常见有 representativeness（代表性）和 normality（常态性），但语感不同：representativeness 更强调“能否代表整体”，typicality 更强调“像不像典型例子”。"]}
{"word":"typically","summary":{"en":"“Typically” means “usually/most often” or “in a characteristic way.”","zh":"“Typically”表示“通常/多半”或“具有典型特征地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the usual way; normally; most often","zh":"通常；一般；多半情况下"},"examples":[{"en":"I typically drink coffee in the morning.","zh":"我通常早上喝咖啡。"},{"en":"Typically, the store closes at 9 p.m.","zh":"这家店一般晚上九点关门。"},{"en":"Teenagers typically need more sleep than adults.","zh":"青少年通常比成年人需要更多睡眠。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a way that is typical of a person, group, or thing; characteristically","zh":"具有典型特征地；一贯地"},"examples":[{"en":"He typically avoids conflict and stays quiet.","zh":"他一贯避免冲突，保持沉默。"},{"en":"The dish is typically served with rice.","zh":"这道菜通常会配米饭一起上。"}]}],"synonyms":["usually","normally","generally","commonly"],"phonetic":"/ˈtɪpɪkli/","extraExplanation":["“typically”常用于概括“多数情况/一般规律”，语气比“always（总是）”弱，表示常见但不绝对。","常见搭配：typically + 动词（typically go/need/mean）；Typically, + 句子（放句首作概括）。","近义词细微区别：usually（更口语、更常用）；normally（强调“正常情况下”）；generally（更概括、更宏观）。"]}
{"word":"typicalness","summary":{"en":"“Typicalness” means the degree to which something is typical or representative.","zh":"“Typicalness”指某事物有多典型、代表性有多强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being typical; the degree to which something represents what is normal or expected for a group, category, or situation","zh":"典型性；（某事物）有多“典型”、多能代表某一类或某种情况的程度"},"examples":[{"en":"Researchers measured the typicalness of each face to see which ones people judged as most “average.”","zh":"研究人员测量每张脸的典型性，看看人们认为哪些脸最“平均”。"},{"en":"The typicalness of the example makes it easy for beginners to understand the rule.","zh":"这个例子的典型性很强，所以初学者很容易理解这条规则。"}]}],"synonyms":["typicality","representativeness"],"phonetic":"/ˈtɪpɪkəlnəs/","extraExplanation":["“typicalness”是由 typical + -ness 构成的名词，意思是“典型性”。在日常口语里更常见的说法是 “how typical something is”。在学术场景（尤其是心理学、语言学与分类研究）中，“typicalness”更常用，用来描述某个项目在一个类别中的代表性或原型程度。","相关常见搭配：degree of typicalness（典型性程度）、high/low typicalness（高/低典型性）、a typicalness rating（典型性评分）。","近义表达（按语境选择）：typicality（更常见、更正式）、representativeness（代表性，偏统计/抽样语境）、averageness（平均感，偏口语/感受）。"]}
{"word":"typicus","summary":{"en":"Typicus is a Latin-based term seen in scientific naming meaning “typical,” often referring to the standard/nominate form.","zh":"typicus 多见于科学命名中的拉丁语用法，表示“典型的”，常指标准型或指名类型。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Used in scientific (Latin) names to mean “typical” or “standard,” often referring to the nominate (originally described) form of a species or subspecies.","zh":"用于科学（拉丁语）命名中，表示“典型的／标准的”，常指某物种或亚种的指名（最初描述的、代表性的）类型。"},"examples":[{"en":"In older zoological writing, “typicus” may mark the nominate subspecies—the “typical” form.","zh":"在较早的动物学文献中，“typicus”可能用来标记指名亚种，也就是“典型”的那一型。"},{"en":"The epithet typicus literally means “typical” in Latin, so it often appears in taxonomy.","zh":"typicus 这个词在拉丁语里字面意思就是“典型的”，所以常见于分类学命名。"}]},{"partOfSpeech":"other","definition":{"en":"A Latin adjective meaning “typical” (not a common standalone English word outside scholarly contexts).","zh":"拉丁语形容词，意为“典型的”（在英语里一般不作为日常单词单独使用，多见于学术语境）。"},"examples":[{"en":"A Latin gloss might translate typicus as “typical.”","zh":"在拉丁语注释或对照中，typicus 常被译为 “typical（典型的）”。"}]}],"synonyms":["typical","nominate"],"phonetic":"/ˈtɪpɪkəs/","extraExplanation":["“typicus”最常见于生物分类学的拉丁双名法（或三名法）里，作为种加词/亚种加词出现，而不是英语里的常用词。","在动物学里你可能会看到“指名亚种（nominate subspecies）”：当一个物种被再细分为多个亚种时，最先命名、与物种同名的那个亚种被称为指名亚种；某些旧文献会用“typicus”来表达“典型型”。现代命名实践中是否使用以及如何使用，会因学科与年代而异。"]}
{"word":"typification","summary":{"en":"Typification means defining or treating something as a type or typical example; in taxonomy, it also means officially assigning a type specimen/species.","zh":"Typification指将事物按“类型”来界定或当作典型例子来描述；在分类学中也指正式指定模式标本/模式种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something a typical example (a “type”) of a group, or describing something by its type","zh":"将某事物归为某一“类型”的行为或过程；把某事物作为某类的典型例子来界定或描述"},"examples":[{"en":"In linguistics, typification helps researchers group languages by shared features.","zh":"在语言学中，typification（类型化）帮助研究者按共同特征对语言进行分组。"},{"en":"The typification of certain accents as “uneducated” is a harmful stereotype.","zh":"把某些口音typification为“没受教育”的做法是一种有害的刻板印象。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, taxonomy) the designation of a type specimen or type species that officially defines a name","zh":"（生物学/分类学）指定模式标本或模式种，用以正式界定某个名称"},"examples":[{"en":"The typification of the plant name was based on a specimen collected in 1902.","zh":"该植物名称的typification是以1902年采集的标本为依据完成的。"},{"en":"Typification is important for stable scientific naming.","zh":"Typification对科学命名的稳定性很重要。"}]}],"synonyms":["classification","categorization","typing","designation (taxonomy)","stereotyping (in social contexts)"],"phonetic":"/ˌtɪpəfɪˈkeɪʃən/","extraExplanation":["这个词在日常英语里不算常见，更常出现在学术写作中（如语言学、社会学、分类学）。一般语境下可用更常见的词替换：classification（分类）、categorization（归类）、stereotyping（贴刻板标签，偏负面）。","词形结构：type（类型）+ -fication（使成为/使……化的过程）。同类后缀的词还有 identification（识别/确认）、justification（正当化/理由说明）。","在社会文化讨论中，typification有时指“把复杂的人或现象简化成某种固定类型”，容易导致偏见；写作时可根据立场选择中性或批判性的表达。"]}
{"word":"typified","summary":{"en":"Typified means “was a typical example of” or “was characterized by,” often used in formal writing.","zh":"Typified 表示“是……的典型/代表”或“以……为特征”，常用于较正式的表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of typify) to be a typical example of something; to show the main qualities of something clearly.","zh":"（typify 的过去式/过去分词）成为……的典型；清楚地体现某事物的主要特征。"},"examples":[{"en":"Her calm leadership typified the team’s culture.","zh":"她沉着的领导风格体现了团队文化的典型特征。"},{"en":"The report typified the problems many small businesses face.","zh":"这份报告概括性地呈现了许多小企业面临的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective, often in passive form) described or understood as typical of something.","zh":"（作形容词用，常见于被动形式）被描述/被认为是……的典型的。"},"examples":[{"en":"The era was typified by rapid technological change.","zh":"那个时代的特点是技术迅速变化。"},{"en":"His style is typified by simple lines and neutral colors.","zh":"他的风格以简洁线条和中性色为典型特征。"}]}],"synonyms":["represented","exemplified","characterized","symbolized","embodied"],"phonetic":"/ˈtɪpəˌfaɪd/","extraExplanation":["“typified by …”是非常常见的学术/书面表达，意思是“以……为特征”。例如：“The region is typified by hot summers.”=“这个地区的特点是夏季炎热。”","注意与“typical (of)”的区别：typical常用来评价“很常见/很符合某类”，而typify/typified更强调“代表、体现、概括某类的特征”。"]}
{"word":"typify","summary":{"en":"Typify means to be a typical example of something or to represent its main features.","zh":"Typify 指“作为典型、体现主要特征”，也可指“作为代表/范例（尤其在分析或写作中）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To be a typical example of something; to represent the main characteristics of a group, idea, or situation.","zh":"作为……的典型；体现某类人/事物/情况的主要特征。"},"examples":[{"en":"This small town typifies the quiet lifestyle of rural America.","zh":"这个小镇体现了美国乡村安静的生活方式。"},{"en":"Her calm leadership typifies what the team needs right now.","zh":"她沉着的领导风格正体现了团队现在需要的品质。"}]},{"partOfSpeech":"vt.","definition":{"en":"To symbolize or serve as a model/example of something, especially in writing or analysis.","zh":"（尤指在写作或分析中）象征或作为……的范例/代表。"},"examples":[{"en":"In the novel, the storm typifies the characters’ inner conflict.","zh":"在这部小说里，暴风雨象征了人物的内心冲突。"},{"en":"The researcher used one case to typify a broader trend.","zh":"研究者用一个案例来代表更广泛的趋势。"}]}],"synonyms":["exemplify","represent","embody","illustrate","characterize"],"phonetic":"/ˈtɪpəˌfaɪ/","extraExplanation":["“typify”来自“type（类型、典型）+ -ify（使成为）”，核心感觉是“让人一看就觉得：这就是典型的那一类”。","常见搭配：typify a culture/era/style/attitude（体现一种文化/时代/风格/态度）。在学术写作中也常用来表达“用某例代表某趋势/特征”。","与“represent”相比，“typify”更强调“典型性（typical）”；与“symbolize”相比，“typify”不一定是象征意义，也可以是现实特征上的典型。"]}
{"word":"typikos","summary":{"en":"Typikos is a rare Greek-derived word meaning “typical/according to rules,” and in Orthodox settings it can refer to liturgical rules (often called a typikon).","zh":"Typikos 是较少见的希腊语借词，表示“典型的/按规矩的”；在东正教语境中也可指礼仪规程（英语更常见 typikon）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Greek) typical; conventional; done according to established rules or form.","zh":"（源自希腊语）典型的；常规的；按既定规则或形式进行的。"},"examples":[{"en":"His response was typikos—polite, brief, and predictable.","zh":"他的回应很typikos——礼貌、简短，而且很可预料。"},{"en":"The meeting followed a typikos structure with set greetings and closing remarks.","zh":"会议按typikos的固定流程进行：有规定的问候和结束语。"}]},{"partOfSpeech":"n.","definition":{"en":"In Eastern Orthodox contexts, a set of formal rules or a guidebook for how services should be conducted (often referred to in English as a “typikon”).","zh":"（东正教语境）礼仪应如何进行的一套正式规程或指南（英语里常称为“typikon/礼仪规程书”）。"},"examples":[{"en":"The monk consulted the typikos to confirm the order of the chants.","zh":"修士查阅typikos来确认圣歌的次序。"},{"en":"Different monasteries may follow slightly different typikos traditions.","zh":"不同修道院遵循的typikos传统可能略有差异。"}]}],"synonyms":["typical","conventional","formal","by-the-book","typikon"],"phonetic":"/ˈtɪpɪkoʊs/","extraExplanation":["“typikos”对应希腊语 τυπικός（typikós），与“type（类型、范式）”同源，核心感觉是“按范式/按规矩”。在日常英语里更常用的是 typical（典型的）或 formal（正式的）。","在东正教礼仪领域，更常见的英文拼写是 typikon（指礼仪规程书/礼仪秩序），你看到的 typikos 往往是直接转写或在学术/宗教语境中的用法。"]}
{"word":"typing","summary":{"en":"“Typing” means the activity of entering text with a keyboard, or the action of typing happening now.","zh":"“typing”指用键盘输入文字的活动/技能，也可指正在打字这一动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or skill of using a keyboard to write text (for example, on a computer, phone, or typewriter)","zh":"打字（用键盘输入文字的活动或技能，如在电脑、手机或打字机上）"},"examples":[{"en":"My typing is slow, so I need more time for the exam.","zh":"我打字很慢，所以考试需要更多时间。"},{"en":"She practices typing every day to improve her speed.","zh":"她每天练习打字来提高速度。"},{"en":"Good typing skills are helpful for office jobs.","zh":"良好的打字技能对办公室工作很有帮助。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of entering text right now; the -ing form of “type” used to show an action in progress or as a noun (gerund)","zh":"正在输入文字；“type”的 -ing 形式，可表示进行中的动作或作名词（动名词）"},"examples":[{"en":"I’m typing an email to my teacher.","zh":"我正在给老师打邮件。"},{"en":"Stop typing and listen for a moment.","zh":"先别打字，听我说一会儿。"},{"en":"Typing while walking can be dangerous.","zh":"走路时打字可能很危险。"}]}],"synonyms":["keyboarding","text entry","typing (in)"],"phonetic":"/ˈtaɪpɪŋ/","extraExplanation":["在现代英语里，“typing”最常见指“用电脑/手机键盘输入文字”；在较旧的语境中也可以指“用打字机打字”。","常见搭配：typing speed（打字速度）、typing test（打字测试）、touch typing（盲打/不看键盘打字）。"]}
{"word":"typist","summary":{"en":"A typist is someone whose job is typing documents, especially in office settings.","zh":"typist 指以打字为工作的人，常见于办公室文书场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to type documents (often quickly and accurately), especially for office work.","zh":"打字员；以打字为职业的人（通常强调速度与准确性），多用于办公室文书工作。"},"examples":[{"en":"She worked as a typist in a law firm before becoming a paralegal.","zh":"她在成为法律助理之前，曾在一家律师事务所当打字员。"},{"en":"The report was dictated to a typist and then reviewed by the manager.","zh":"这份报告先口述给打字员打出来，然后由经理审阅。"}]}],"synonyms":["data entry clerk","clerk","secretary (sometimes, depending on context)"],"phonetic":"/ˈtaɪpɪst/","extraExplanation":["“Typist”在较早的职场语境中很常见，尤其在打字机（typewriter）时代；如今随着电脑普及，这个职业称呼在部分场景中会被“administrative assistant（行政助理）”“data entry clerk（数据录入员）”等更宽泛的职位名替代，但“typist”仍可指擅长打字的人。","搭配很常见：fast/slow typist（打字快/慢的人）、skilled typist（熟练的打字员）、audio typist（听打员：听录音并打字）。"]}
{"word":"typo","summary":{"en":"“Typo” usually means a typing/printing mistake (a “typographical error”).","zh":"“typo”通常指打字或排版造成的错误（即“typographical error”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mistake in typing or printing (especially a misspelling), short for “typographical error.”","zh":"打字或印刷时出现的错误（尤指拼写错误），“typographical error”的简称。"},"examples":[{"en":"There’s a typo in my email address on the form.","zh":"表格上我的邮箱地址有一个拼写错误。"},{"en":"Sorry—“teh” was a typo; I meant “the.”","zh":"抱歉，“teh”是打字错误；我想写的是“the”。"}]},{"partOfSpeech":"v.","definition":{"en":"To type something, often quickly or informally (commonly used in tech/chat contexts).","zh":"打字输入（常用于聊天或技术语境，带有随意/快速的感觉）。"},"examples":[{"en":"I’ll typo the changes into the document now.","zh":"我现在把修改内容打进文档里。"},{"en":"He typoed the password wrong and got locked out.","zh":"他把密码打错了，结果被锁定了。"}]}],"synonyms":["typographical error","misprint","misspelling","error"],"phonetic":"/ˈtaɪpoʊ/","extraExplanation":["“typo”最常见的用法是名词，指“打字/排版错误”。动词用法在口语和网络交流里能见到，但在正式写作中更常用“type”或“enter”。"]}
{"word":"typographical","summary":{"en":"Typographical means “about typography (text design/layout)” or “about a small typing/printing mistake,” often in “typographical error.”","zh":"typographical 指“与排版/字体设计有关的”，也可指“与笔误/排印错误有关的”（常见于 typographical error）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the style, arrangement, and appearance of printed text (such as fonts, spacing, and layout).","zh":"与排版有关的；指印刷文字的样式、编排和外观（如字体、行距、版面等）。"},"examples":[{"en":"The book’s typographical design makes it easy to read.","zh":"这本书的排版设计让阅读更轻松。"},{"en":"We adjusted the typographical layout to fit more text on the page.","zh":"我们调整了排版布局，让一页能容纳更多文字。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a small error made while typing or printing (often in the phrase “typographical error”).","zh":"与打字/印刷造成的小错误有关（常见于短语“typographical error”，即“笔误/排印错误”）。"},"examples":[{"en":"There’s a typographical error in the last paragraph.","zh":"最后一段里有一个笔误。"},{"en":"Please report any typographical mistakes you notice.","zh":"如果你注意到任何排印错误，请告诉我们。"}]}],"synonyms":["typographic","type-related","printing-related"],"phonetic":"/ˌtaɪpəˈɡræfɪkəl/","extraExplanation":["“typographical”来自“type”（铅字/打字）+ “-graph-”（写/记录）+ “-ical”（……的）。在现代英语里，它既可以指“排版风格”，也常用于“typographical error（笔误）”。","容易混淆的说法：\n- typographical error：通常指打字/排版导致的字母、数字、符号等小错误（如拼错、漏字）。\n- grammatical error：语法错误。\n- spelling mistake：拼写错误（不一定由打字造成）。","相关常用搭配：typographical design（排版设计）、typographical layout（版式/版面）、typographical conventions（排版规范）。"]}
{"word":"typography","summary":{"en":"Typography is the design and arrangement of text—fonts, spacing, and layout—to improve readability and visual style.","zh":"Typography 指文字的設計與編排（字體、間距、版面等），用來提升可讀性與視覺風格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The art and technique of arranging printed or digital text (type)—including fonts, spacing, and layout—to make writing readable and visually appealing.","zh":"排版／字體設計：將印刷或數位文字（字型）以字體、字距、行距與版面等方式加以編排，使內容更易讀且更美觀的藝術與技術。"},"examples":[{"en":"Good typography makes a long article easier to read.","zh":"好的排版能讓長文章更容易閱讀。"},{"en":"The designer changed the typography by using a cleaner font and more line spacing.","zh":"設計師透過改用更清爽的字體並增加行距來調整排版。"},{"en":"Modern typography is important in websites and mobile apps, not just in books.","zh":"現代排版不只用在書本，也很重要於網站與手機 App。"}]},{"partOfSpeech":"n.","definition":{"en":"The style or appearance of printed text in a particular design, such as the fonts used in a brand or poster.","zh":"（特定設計中的）字體風格／文字呈現：例如品牌或海報所使用的字體與文字樣式。"},"examples":[{"en":"The typography of the movie poster feels bold and dramatic.","zh":"那張電影海報的字體風格給人強烈而戲劇化的感覺。"},{"en":"They chose rounded typography to make the brand look friendly.","zh":"他們選擇圓潤的字體風格，讓品牌看起來更親切。"}]}],"synonyms":["type design","typesetting","lettering (sometimes, depending on context)"],"phonetic":"/taɪˈpɑːɡrəfi/","extraExplanation":["Typography 常被翻成「排版」或「字體設計」。它不只是選哪一種字體（font），也包含字距（kerning）、字母間距（tracking）、行距（leading）、段落與版面配置等，目標是兼顧可讀性與視覺美感。","易混淆：typeface 指「字體家族／字型設計」（如 Times New Roman）；font 常指同一 typeface 的某個具體樣式（如 Times New Roman Bold 12pt）。日常口語裡很多人會把 font 當成 typeface 用。"]}
{"word":"typology","summary":{"en":"Typology means a system or study of classifying things into types, often used in fields like linguistics, psychology, and archaeology.","zh":"Typology 指把事物按共同特征分成不同类型的“分类体系”，也指对这些类型进行研究，常见于语言学、心理学与考古学等领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system for classifying things into types, based on shared features","zh":"类型学；分类法：根据共同特征把事物归类成不同“类型”的体系"},"examples":[{"en":"In psychology, typology is often used to group personality patterns.","zh":"在心理学里，类型学常被用来把人格模式分组。"},{"en":"The museum’s typology organizes tools by material and function.","zh":"博物馆的分类法按材料和用途来整理工具。"}]},{"partOfSpeech":"n.","definition":{"en":"the study of types and classification in a particular field (especially linguistics, anthropology, or archaeology)","zh":"（某一学科中的）类型研究；类型学研究（尤指语言学、人类学或考古学）"},"examples":[{"en":"Linguistic typology compares languages to see what structures are common worldwide.","zh":"语言类型学比较不同语言，看看哪些结构在全球更常见。"},{"en":"Archaeological typology helps date artifacts by comparing their forms.","zh":"考古类型学通过比较器物的形制来帮助断代。"}]}],"synonyms":["classification","categorization","taxonomy","system of types"],"phonetic":"/taɪˈpɑːlədʒi/","extraExplanation":["词源上，typology 来自 type（类型）+ -logy（研究/学科），因此既可以指“分类体系”，也常指“对类型的研究”。","在语言学里，typology 常和 genealogy（谱系/亲缘）对比：genealogy 研究语言“像家族树一样”的历史来源；typology 则研究语言结构“长得像不像”，不一定有亲缘关系。"]}
{"word":"typos","summary":{"en":"“Typos” means small writing/typing mistakes (the plural of “typo”).","zh":"“typos”指文字/打字中的小错误，是“typo（笔误）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “typo”) mistakes in written or typed text, such as wrong letters, missing words, or incorrect spelling.","zh":"（“typo”的复数）指书写或打字中的错误，比如字母打错、漏词或拼写错误。"},"examples":[{"en":"Sorry about the typos in my email—I was in a hurry.","zh":"抱歉我邮件里有些错别字/笔误——我太赶了。"},{"en":"The report is good, but it still has a few typos.","zh":"报告内容不错，但还是有几个笔误。"},{"en":"Please check for typos before you submit the form.","zh":"提交表格前请检查是否有拼写/输入错误。"}]}],"synonyms":["mistakes","errors","misspellings","misprints"],"phonetic":"/ˈtaɪpoʊ/","extraExplanation":["“typo”是“typographical error”的口语缩写，意思是“排印/排版错误、打字错误”。在日常英语里，人们常用“typo/typos”泛指各种小的文字错误（不一定真的与排版有关）。","常见搭配：fix/correct typos（改正笔误）、a couple of typos（几个小错误）、full of typos（错误很多）。","注意区分：typo 通常指“无心之失”的小错误；如果是系统性的语法问题或用词不当，更常说 grammar mistakes / wording issues。"]}
{"word":"typus","summary":{"en":"Typus is a rare, Latin-based word meaning “type,” especially a “type specimen” in biology/taxonomy.","zh":"typus 是较少见的拉丁语来源词，意为“类型”，尤其指生物分类学中的“模式标本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type; a standard example or model (often used in academic or Latin-influenced writing).","zh":"类型；典型范例/标准样本（常见于学术或受拉丁语影响的用法）。"},"examples":[{"en":"In older texts, “typus” is used where we would now say “type.”","zh":"在一些较旧的文本中，“typus”常用来表示我们现在说的“type（类型）”。"},{"en":"The design follows a classical typus of Roman lettering.","zh":"这种设计遵循罗马字母的经典范式。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, taxonomy) a type specimen or reference example used to define a species or group.","zh":"（生物/分类学）模式标本；用来界定某物种或类群的参照标本。"},"examples":[{"en":"The museum preserves the typus for this species.","zh":"博物馆保存着该物种的模式标本。"},{"en":"Researchers compared new samples to the typus to confirm the identification.","zh":"研究人员将新样本与模式标本对比，以确认鉴定结果。"}]}],"synonyms":["type","model","archetype","prototype","type specimen"],"phonetic":"/ˈtaɪpəs/","extraExplanation":["“typus”源自拉丁语（与英语 type 同源），在现代英语里并不常用；更常见的是直接用 type。你更可能在生物分类、博物馆标本记录、或较旧/偏学术的文献中看到它。","在分类学语境中，typus 常接近 “type specimen（模式标本）” 的概念：它不是“最典型的个体”，而是被指定为命名与比对的权威参照。"]}
{"word":"tyramine","summary":{"en":"Tyramine is a naturally occurring chemical found especially in aged or fermented foods and can affect blood pressure, particularly in people taking MAOI medications.","zh":"酪胺是一种天然化学物质，尤其常见于陈年或发酵食物中；它可能影响血压，服用 MAOI 类药物者需特别注意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural substance (a biogenic amine) made from the amino acid tyrosine, found in some foods and produced in the body; it can affect blood pressure and other body functions","zh":"一种天然物质（生物胺），由氨基酸“酪氨酸”分解产生，存在于某些食物中、人体也会生成；它可能影响血压等生理功能"},"examples":[{"en":"Aged cheeses can contain high levels of tyramine.","zh":"陈年奶酪可能含有较高水平的酪胺。"},{"en":"People taking MAOI antidepressants are often advised to avoid foods high in tyramine.","zh":"正在服用单胺氧化酶抑制剂（MAOI）类抗抑郁药的人，通常会被建议避免高酪胺食物。"},{"en":"The doctor explained that tyramine can trigger a dangerous rise in blood pressure for some patients.","zh":"医生解释说，酪胺对某些患者可能引发危险的血压升高。"}]}],"synonyms":["biogenic amine"],"phonetic":"/ˈtaɪrəˌmin/","extraExplanation":["“酪胺（tyramine）”常见于发酵、腌制、陈放的食物（如陈年奶酪、腊肉/香肠、酱油、泡菜、部分葡萄酒/啤酒等）。","它最常见的健康相关语境是与 MAOI 类药物的相互作用：MAOI 会降低体内分解酪胺的能力，可能导致“高血压危象”（严重血压飙升）。如在用药或有相关病史，应遵医嘱饮食。","词源上与“tyrosine（酪氨酸）”相关：tyramine 是酪氨酸在微生物发酵/代谢过程中脱羧形成的产物。"]}
{"word":"tyrann","summary":{"en":"A tyrant is a cruel or unfair ruler, or anyone who controls others harshly.","zh":"tyrant 指“暴君”，也可指“专横控制他人的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cruel or unfair ruler; someone who uses power in a harsh, controlling way","zh":"暴君；专横的人（用残酷或不公正的方式掌权或控制他人）"},"examples":[{"en":"The story is about a tyrant who rules the kingdom through fear.","zh":"这个故事讲的是一位用恐惧统治王国的暴君。"},{"en":"At work, he acted like a tyrant and never listened to anyone.","zh":"在工作中，他表现得像个专横的人，从不听别人意见。"},{"en":"She refused to let anyone become a tyrant over her choices.","zh":"她拒绝让任何人对她的选择专横控制。"}]}],"synonyms":["despot","dictator","oppressor","bully"],"phonetic":"/ˈtaɪrənt/","extraExplanation":["你输入的“tyrann”通常不是完整单词，更常见的是“tyrant（暴君）”或“tyranny（暴政）”。","词源上来自希腊语 *tyrannos*（暴君/僭主）。在英语里常见相关词：*tyranny*（暴政/专横统治）、*tyrannical*（残暴的；专横的）。","文学与文化里，“tyrant”常用来描写通过恐惧与压迫维持权力的统治者（如莎士比亚作品中常出现类似形象）。"]}
{"word":"tyrannical","summary":{"en":"“Tyrannical” describes cruel, unfair, power-abusing behavior or rule—like a tyrant.","zh":"“tyrannical”指暴虐、专横、滥用权力的（像暴君一样）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using power in a cruel, unfair, or oppressive way; like a tyrant.","zh":"暴虐的；专横的；像暴君一样滥用权力、压迫他人的。"},"examples":[{"en":"The king became tyrannical and punished anyone who disagreed with him.","zh":"国王变得很暴虐，任何不同意他的人都会被惩罚。"},{"en":"She quit the job because her boss had a tyrannical management style.","zh":"她辞职了，因为老板的管理方式很专横。"},{"en":"People protested against the tyrannical rules that limited free speech.","zh":"人们抗议那些限制言论自由的专制规定。"}]}],"synonyms":["oppressive","despotic","dictatorial","authoritarian","overbearing"],"phonetic":"/tɪˈrænɪkəl/","extraExplanation":["“tyrannical”来自“tyrant（暴君）”。它常用于政治语境（tyrannical ruler/government），也可用于日常生活，形容某人控制欲强、对他人不公（tyrannical parent/boss）。","语气很强，带明显贬义：不仅是“严格（strict）”，而是“苛刻+不讲理+压迫”。如果只是规则多但出于秩序与安全，通常用 strict，而不是 tyrannical。","常见搭配：tyrannical regime（暴政）、tyrannical rule（暴虐统治）、tyrannical control（专横控制）。近义词有 authoritarian（威权的，较中性/学术）、oppressive（压迫性的，强调让人喘不过气）。"]}
{"word":"tyrannise","summary":{"en":"Tyrannise means to rule cruelly or to bully and dominate others unfairly.","zh":"tyrannise 指施行暴政，或以强势不公平地欺压、支配他人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to rule or govern people in a cruel, unfair way; to act like a tyrant","zh":"以残酷、不公的方式统治；实行暴政"},"examples":[{"en":"The general was accused of tyrannising the country for decades.","zh":"这位将军被指控对这个国家实行暴政长达数十年。"},{"en":"History shows how easily a leader can tyrannise a nation when there are no checks and balances.","zh":"历史表明，当缺乏制衡时，领导人很容易对一个国家施行专制统治。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bully or dominate someone, using power to control them unfairly","zh":"欺压；专横地支配（他人），用权力不公平地控制"},"examples":[{"en":"He tyrannised his coworkers by threatening to report them for small mistakes.","zh":"他用“要去告状”来威胁同事，把小错误当把柄进行欺压。"},{"en":"No one should be tyrannised at home or at school.","zh":"任何人都不该在家里或学校里受到欺压。"}]}],"synonyms":["oppress","dominate","bully","tyrannize","subjugate"],"phonetic":"ˈtɪrəˌnaɪz","extraExplanation":["“tyrannise”是英式拼写；美式更常写作“tyrannize”。两者意思相同，发音也基本一样。","词根来自“tyrant”（暴君、专制者）。常用于严肃语境（政治、历史、人权），也可用于日常语境表示“以强凌弱/霸道控制”。"]}
{"word":"tyrannize","summary":{"en":"Tyrannize means to use power to oppress or bully others unfairly or cruelly.","zh":"tyrannize 指滥用权力对他人进行残酷或不公的欺压、压迫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to treat people cruelly or unfairly by using power or control over them; to bully or oppress","zh":"以权势残酷或不公地对待他人；欺压、压迫"},"examples":[{"en":"The dictator tyrannized the country for decades.","zh":"那位独裁者压迫这个国家数十年。"},{"en":"Some managers tyrannize their staff by threatening them and ignoring their needs.","zh":"有些管理者用威胁、无视需求来欺压员工。"},{"en":"He refused to let fear tyrannize him into silence.","zh":"他拒绝让恐惧压得他不敢发声。"}]}],"synonyms":["oppress","bully","dominate","abuse","subjugate"],"phonetic":"/ˈtɪrəˌnaɪz/","extraExplanation":["“tyrannize”来自“tyrant（暴君）”，常用来形容掌权者对人民、上级对下属、强者对弱者的压迫。语气较强，带明显道德批评。","常见搭配：tyrannize over sb（对某人施暴政/欺压），be tyrannized by sth（被某事物“支配/折磨”，如 fear、worry）。"]}
{"word":"tyrannos","summary":{"en":"tyrannos is a Greek root meaning “tyrant,” mainly used in scientific names like Tyrannosaurus.","zh":"tyrannos 是表示“暴君/专制者”的希腊语词根，主要用于像 Tyrannosaurus（霸王龙）这样的科学名称中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Greek root meaning “tyrant” or “despot,” seen in some English scientific words (especially dinosaur names).","zh":"希腊语词根，意为“暴君/专制者”，常见于一些英语科学词汇（尤其是恐龙名称）中。"},"examples":[{"en":"In the name Tyrannosaurus, tyrannos means “tyrant.”","zh":"在名字 Tyrannosaurus（霸王龙）中，tyrannos 表示“暴君/暴虐的统治者”。"},{"en":"The word tyrannosaur comes from tyrannos + -saur (“lizard”).","zh":"tyrannosaur（暴龙类/霸王龙类）由 tyrannos + -saur（“蜥蜴”）构成。"}]}],"synonyms":["tyrant (meaning; not the same form)"],"phonetic":"/tɪˈræn.oʊs/","extraExplanation":["严格来说，tyrannos 在现代英语里很少单独作为一个“词”使用；它更常见于构词成分（词根/前缀）中，比如 Tyrannosaurus（霸王龙，字面“暴君蜥蜴”）。","来源是古希腊语 τύραννος（tyrannos，“暴君”）。在命名学（尤其生物分类命名）里，常用希腊语/拉丁语词根来组合出“字面意义清晰”的名称。"]}
{"word":"tyrannosaur","summary":{"en":"A tyrannosaur is a huge predatory dinosaur, often referring to Tyrannosaurus rex (T. rex).","zh":"tyrannosaur 指巨大的食肉恐龙，常特指霸王龙（T. rex）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large meat-eating dinosaur that lived in North America in the late Cretaceous period; short for “tyrannosaurus,” especially Tyrannosaurus rex (T. rex).","zh":"一种非常巨大的食肉恐龙，生活在白垩纪晚期的北美；常用作“tyrannosaurus（霸王龙属）”的简称，尤其指霸王龙（T. rex）。"},"examples":[{"en":"In the museum, the tyrannosaur skeleton towered over the visitors.","zh":"在博物馆里，那具霸王龙骨架高高耸立在参观者上方。"},{"en":"Many people call any big predatory dinosaur a tyrannosaur, but T. rex is the most famous one.","zh":"很多人会把大型掠食性恐龙都叫作“霸王龙”，但最有名的还是霸王龙（T. rex）。"}]}],"synonyms":["tyrannosaurus","T. rex"],"phonetic":"/tɪˈræn.ə.sɔr/","extraExplanation":["“tyrannosaur”在日常英语里常指“霸王龙（T. rex）”，但在古生物学语境中也可以更广泛地指“暴龙类/暴龙科（tyrannosaurs/tyrannosaurids）”这一类群。","词源上来自希腊语：tyrannos（暴君）+ sauros（蜥蜴/蜥蜴类），所以常见中文译作“霸王龙”。","在流行文化中（如电影、小说），“tyrannosaur”常被写成强大、危险的顶级掠食者形象；但真实动物行为仍需依据化石证据推测。"]}
{"word":"Tyrannosaurus","summary":{"en":"Tyrannosaurus is a famous genus of huge meat-eating dinosaurs, especially T. rex.","zh":"Tyrannosaurus 指一种著名的巨型食肉恐龙属，尤指霸王龙（T. rex）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large meat-eating dinosaur that lived in western North America near the end of the age of dinosaurs; it is famous for its huge head, powerful jaws, and very small front arms (especially Tyrannosaurus rex).","zh":"一种体型巨大的食肉恐龙，生活在恐龙时代末期的北美西部；以巨大的头骨、强有力的颌部和很短的前肢而闻名（尤指霸王龙 T. rex）。"},"examples":[{"en":"Tyrannosaurus rex is one of the most famous dinosaurs in the world.","zh":"霸王龙是世界上最著名的恐龙之一。"},{"en":"In the museum, we saw a Tyrannosaurus skeleton with enormous teeth.","zh":"在博物馆里，我们看到了一具霸王龙骨架，牙齿非常巨大。"},{"en":"People often imagine a Tyrannosaurus roaring in movies, though we don’t know exactly what sound it made.","zh":"人们常在电影里想象霸王龙在咆哮，不过我们并不确定它真实会发出什么声音。"}]}],"synonyms":["T. rex","tyrant lizard"],"phonetic":"/taɪˌrænəˈsɔrəs/","extraExplanation":["“Tyrannosaurus”来自希腊语：tyrannos（暴君、专制者）+ sauros（蜥蜴），意思是“暴君蜥蜴”。因此它常被翻译为“霸王龙”。","在日常英语里，“Tyrannosaurus”常作为属名（genus）使用；更常见、更具体的说法是“Tyrannosaurus rex”（简称 T. rex）。","流行文化（电影、游戏、玩具）让它成为“最强掠食者”的代表形象，但科学研究会随着新化石和新方法不断更新。"]}
{"word":"tyrannosaurus","summary":{"en":"Tyrannosaurus is a famous giant carnivorous dinosaur, especially Tyrannosaurus rex (T. rex).","zh":"tyrannosaurus 指著名的巨大食肉恐龙，尤其是霸王龙（T. rex）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large meat-eating dinosaur that lived in North America in the late Cretaceous period; the most famous species is Tyrannosaurus rex (often called T. rex).","zh":"一种生活在白垩纪晚期北美洲的巨大食肉恐龙；最著名的物种是霸王龙（Tyrannosaurus rex，常简称 T. rex）。"},"examples":[{"en":"Tyrannosaurus rex is one of the best-known dinosaurs in the world.","zh":"霸王龙是世界上最著名的恐龙之一。"},{"en":"In the museum, the tyrannosaurus skeleton towered over the other fossils.","zh":"在博物馆里，霸王龙的骨架高高耸立在其他化石之上。"},{"en":"Many movies show a tyrannosaurus chasing people, though real behavior is still studied.","zh":"很多电影会演霸王龙追人，但它真实的行为仍在研究中。"}]}],"synonyms":["Tyrannosaurus rex","T. rex","(informal) rex"],"phonetic":"/taɪˌrænəˈsɔrəs/","extraExplanation":["“Tyrannosaurus”来自希腊语：tyrannos（暴君、专制者）+ sauros（蜥蜴），字面意思是“暴君蜥蜴”。因此中文常译作“霸王龙”。","在日常英语里，“tyrannosaurus”有时被非正式地用来形容“特别巨大、很吓人”的东西（多见于儿童文学、广告或夸张表达），但这不是它的主要字面义。","文化上它因《侏罗纪公园》等作品而极其出名；写作时更常用更具体的“(Tyrannosaurus) rex / T. rex”。"]}
{"word":"tyrannous","summary":{"en":"Tyrannous means cruelly oppressive or unreasonably controlling, like a tyrant.","zh":"tyrannous 指“暴虐专横、压迫性的”，也可指“不合理地苛刻、控制欲强”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using power in a cruel, unfair, or oppressive way; like a tyrant.","zh":"暴虐的；专横的；像暴君一样滥用权力、残酷压迫的。"},"examples":[{"en":"People protested against the tyrannous ruler and his secret police.","zh":"人们抗议那位暴虐的统治者以及他的秘密警察。"},{"en":"The law was seen as tyrannous because it punished peaceful speech.","zh":"这项法律被认为很专横，因为它惩罚和平的言论。"},{"en":"In the novel, the tyrannous king demands obedience from everyone.","zh":"在小说里，那位暴虐的国王要求所有人绝对服从。"}]},{"partOfSpeech":"adj.","definition":{"en":"Unreasonably strict or controlling (sometimes about rules, demands, or even habits).","zh":"苛刻到不合理的；控制欲强的（有时形容规则、要求，甚至习惯）。"},"examples":[{"en":"She quit because of the tyrannous schedule that left no time to rest.","zh":"她辞职了，因为那种苛刻的排班让人完全没时间休息。"},{"en":"He described the office rules as tyrannous and pointless.","zh":"他形容办公室规定既专横又毫无意义。"}]}],"synonyms":["oppressive","despotic","authoritarian","dictatorial","tyrannical","harsh"],"phonetic":"/ˈtɪrənəs/","extraExplanation":["“tyrannous”来自“tyrant（暴君）”。语气通常比“strict（严格）”更强，带有“滥权、压迫、残酷”的道德批评色彩。","常见搭配：tyrannous ruler/government（暴政统治者/政府），tyrannous laws（专横的法律），tyrannous demands（霸道的要求）。","文学语境里常用来描写“暴君式权力”与“反抗”，例如谈论君主专制、独裁统治或压迫性的社会制度时。"]}
{"word":"tyrannously","summary":{"en":"“Tyrannously” means “in a cruel and oppressive, tyrant-like way.”","zh":"“tyrannously”意为“以残暴压迫、暴君式的方式（专横地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cruel, oppressive, or unfairly authoritarian way; like a tyrant.","zh":"以暴君式的方式；残暴、压迫或专横不公地。"},"examples":[{"en":"The ruler taxed the poor tyrannously and silenced anyone who complained.","zh":"统治者以暴政方式向穷人征重税，并压制任何抱怨的人。"},{"en":"She felt her boss behaved tyrannously, controlling every small detail of her work.","zh":"她觉得老板很专横，把工作中的每个小细节都要控制。"}]}],"synonyms":["oppressively","despotically","authoritarianly","dictatorially","cruelly"],"phonetic":"/tɪˈrænəsli/","extraExplanation":["“tyrannously”来自“tyrant（暴君）/ tyranny（暴政）”。它通常用于批评权力被滥用的情境，不仅限于政治统治，也可用于家庭、学校、职场等人际关系中的“专横控制”。","语气较强，带明显道德评判色彩；如果想更中性，可以用“strictly（严格地）”“authoritatively（以权威口吻地）”，但这些词不一定包含“残酷/压迫”的意思。"]}
{"word":"tyranny","summary":{"en":"Tyranny means cruel, unfair rule or oppressive control.","zh":"Tyranny 指残酷不公的统治，也可泛指令人压迫的严格控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cruel or unfair use of power, especially by a government or ruler.","zh":"暴政；专制统治（尤指政府或统治者残酷、不公地运用权力）。"},"examples":[{"en":"People protested against the tyranny of the dictator.","zh":"人们抗议独裁者的暴政。"},{"en":"Freedom of speech is often the first victim of tyranny.","zh":"言论自由往往是暴政下最先受害的。"}]},{"partOfSpeech":"n.","definition":{"en":"Strict control that feels oppressive in everyday life (often used more generally, sometimes in a dramatic way).","zh":"（泛指）令人窒息的严格控制；压迫感（有时带夸张语气）。"},"examples":[{"en":"He complained about the tyranny of constant emails.","zh":"他抱怨不停的邮件带来的“压迫感”。"},{"en":"Some students call it the tyranny of exams.","zh":"有些学生把它称为考试的“暴政”。"}]}],"synonyms":["despotism","oppression","dictatorship","autocracy","authoritarian rule"],"phonetic":"/ˈtɪrəni/","extraExplanation":["词源：tyranny 来自希腊语 tyrannos（僭主/暴君）。在古希腊早期，tyrannos 不一定完全是贬义，后来逐渐固定为“残酷不公的统治”。","语体提示：tyranny 常用于严肃语境（政治、人权、历史），也可以用于日常夸张表达（如“the tyranny of...”），但正式写作中应避免过度夸大。","文学与文化：英语里常见对“反抗暴政”的表达，如 Thomas Jefferson 的名言 “Rebellion to tyrants is obedience to God.”（反抗暴君即是服从上帝），体现英美政治文化中对专制的警惕。"]}
{"word":"Tyranosaurus","summary":{"en":"Tyrannosaurus is a huge carnivorous dinosaur, best known as Tyrannosaurus rex (T. rex).","zh":"Tyrannosaurus 指一种巨大的食肉恐龙，最常见的是霸王龙 Tyrannosaurus rex（T. rex）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large meat-eating dinosaur that lived in North America near the end of the Age of Dinosaurs; short for Tyrannosaurus rex (often written T. rex)","zh":"一种生活在恐龙时代末期、北美洲的巨大食肉恐龙；常指“霸王龙”（Tyrannosaurus rex，常写作 T. rex）"},"examples":[{"en":"Tyrannosaurus rex is one of the most famous dinosaurs in the world.","zh":"霸王龙是世界上最著名的恐龙之一。"},{"en":"In the museum, we saw a Tyrannosaurus skeleton with huge teeth.","zh":"在博物馆里，我们看到了一具霸王龙骨架，牙齿非常巨大。"},{"en":"Many movies show a Tyrannosaurus chasing people, but real animals didn’t behave exactly like that.","zh":"很多电影里霸王龙会追人，但真实动物的行为并不一定完全如此。"}]}],"synonyms":["Tyrannosaurus rex","T. rex","tyrannosaur"],"phonetic":"/tɪˌrænəˈsɔrəs/","extraExplanation":["你写的 **Tyranosaurus** 常见于误拼；标准拼写是 **Tyrannosaurus**（中间有 **nn**）。","名称来自希腊语词根：**tyrannos**（暴君）+ **sauros**（蜥蜴），意思是“暴君蜥蜴”。","在科普与流行文化中最常提到的是 **Tyrannosaurus rex**，其中 **rex** 是拉丁语“国王”，所以中文常译为“霸王龙”。"]}
{"word":"tyrant","summary":{"en":"A tyrant is a cruel, unfair person who abuses power—especially a ruler, but also anyone who controls others harshly.","zh":"tyrant 指残酷不公、滥用权力的“暴君/专制者”，也可指在工作或生活中霸道控制他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cruel or unfair ruler who has complete power and does not respect people’s rights","zh":"暴君；专制者：拥有绝对权力、残酷或不公正、无视人民权利的统治者"},"examples":[{"en":"The country suffered under a tyrant for decades.","zh":"这个国家在暴君统治下受苦了几十年。"},{"en":"In many stories, the hero rises up against a tyrant.","zh":"在许多故事里，英雄会起身反抗暴君。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who abuses power and controls others in a cruel or unreasonable way (for example, at work or at home)","zh":"（工作或家庭中的）霸道的人；横暴者：滥用权力、以残酷或不讲理的方式控制他人的人"},"examples":[{"en":"He was a tyrant in the office, shouting at employees for small mistakes.","zh":"他在办公室里像个暴君，为了小错误就对员工大喊大叫。"},{"en":"She refused to let a tyrant boss ruin her confidence.","zh":"她不让一个霸道的老板毁掉自己的自信。"}]}],"synonyms":["dictator","despot","oppressor","bully","autocrat"],"phonetic":"/ˈtaɪrənt/","extraExplanation":["“tyrant”常带强烈负面评价，不只是“严格的人”。形容老师/父母很严格但不残酷时，更自然用“strict”或“tough”。如果是“爱管控、爱发号施令”，可以用“bossy”。","词源来自古希腊语 tyrannos，最初可指“以非正统方式掌权的人”，不一定完全负面；后来在英语中逐渐固定为“残暴的专制者”。","常见搭配：a tyrant ruler（暴君统治者）、a petty tyrant（小霸王/小独裁者，指小范围内滥用权力的人）、under a tyrant’s rule（在暴政之下）。"]}
{"word":"tyrants","summary":{"en":"Tyrants are people who use cruel, unfair power—often rulers, but it can also mean any overly controlling bully.","zh":"tyrants 指以残酷不公方式掌权的人（多指统治者），也可泛指生活中专横霸道、爱控制他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who rule with cruel, unfair power and do not allow freedom or opposition.","zh":"暴君；专制者：以残酷、不公的方式掌权，不允许自由或反对的人。"},"examples":[{"en":"The people rose up against the tyrants who had controlled the country for decades.","zh":"人民起来反抗那些统治国家几十年的暴君。"},{"en":"History books often describe tyrants as leaders who silence critics.","zh":"历史书常把暴君描述为压制批评者的领导人。"}]},{"partOfSpeech":"n.","definition":{"en":"People who act like bullies by controlling others in a harsh, selfish way (not necessarily in politics).","zh":"（非政治语境）专横的人；霸道者：用强硬、自私的方式控制他人的人。"},"examples":[{"en":"He was a tyrant at work, shouting at everyone over small mistakes.","zh":"他在工作中很专横，为一点小错就对所有人大喊大叫。"},{"en":"Don’t let small tyrants ruin your day—set clear boundaries.","zh":"别让小小的“霸道者”毁了你的一天——要设定清晰的界限。"}]}],"synonyms":["dictators","despots","oppressors","bullies","authoritarians"],"phonetic":"/ˈtaɪrənts/","extraExplanation":["“tyrant”源自希腊语 tyrannos，最初指“没有合法继承权的统治者”，不一定是坏人；后来意义逐渐转为“残暴的统治者”。","文学中常见“tyrant”来象征压迫与反抗，例如莎士比亚作品里常用来批判滥权者。"]}
{"word":"Tyre","summary":{"en":"“Tyre” usually means a vehicle wheel’s rubber ring (British spelling of “tire”). Rarely, it can mean “tire” (become/make tired).","zh":"“tyre”通常指“轮胎”（英式拼写，对应美式 tire）；很少情况下也可作动词表示“疲倦/使疲倦”，但现代多写作 tire。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rubber ring filled with air (or sometimes solid) that fits around a wheel; it helps a vehicle grip the road and ride smoothly. (British spelling of “tire.”)","zh":"（英式拼写）轮胎：套在车轮外圈的橡胶环（通常充气，也可能为实心），帮助车辆抓地并减震行驶。"},"examples":[{"en":"My car needs new tyres before winter.","zh":"我的车在冬天前需要换新轮胎。"},{"en":"Check the tyre pressure once a month.","zh":"每个月检查一次轮胎气压。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/old-fashioned) To make someone tired; to become tired. (More common spelling today: “tire.”)","zh":"（罕见/旧式）使……疲倦；变得疲倦。（现代更常用拼写：tire）"},"examples":[{"en":"A long walk can tyre young children.","zh":"走很长的路会让小孩子累。"}]}],"synonyms":["tire","wheel tire","rubber"],"phonetic":"/ˈtaɪər/","extraExplanation":["“tyre”和“tire”读音相同：英式英语更常用“tyre”表示“轮胎”，而美式英语几乎总写作“tire”。但表示“疲倦”时，两种英语通常都写作“tire”。","常见搭配：tyre pressure（胎压）、spare tyre（备胎）、flat tyre（爆胎/没气的轮胎）、winter tyres（冬季轮胎）。"]}
{"word":"tyre","summary":{"en":"Tyre (BrE) means a vehicle wheel’s rubber ring; in AmE it’s usually spelled tire.","zh":"tyre（英式拼写）指车辆车轮外的橡胶轮胎；美式英语通常拼作 tire。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick rubber ring filled with air (or solid) that fits around a wheel, helping a vehicle move smoothly and grip the road","zh":"（车辆的）轮胎；（包在车轮外的）橡胶胎，通常充气，用来减震并增加抓地力"},"examples":[{"en":"My bike tyre is flat, so I need to pump it up.","zh":"我的自行车轮胎没气了，所以我需要给它打气。"},{"en":"Winter tyres can improve safety on snowy roads.","zh":"冬季轮胎能提高在积雪道路上的安全性。"},{"en":"The mechanic checked the tyre pressure before the trip.","zh":"出发前，修车师傅检查了轮胎气压。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fit a wheel with tyres","zh":"给（车轮）装轮胎"},"examples":[{"en":"They tyre the racing cars with new rubber before the event.","zh":"比赛前他们给赛车装上新的轮胎。"},{"en":"The workshop can tyre your bike while you wait.","zh":"你等着的时候，这家店可以帮你的自行车装轮胎。"}]}],"synonyms":["tire (AmE)"],"phonetic":"/taɪr/","extraExplanation":["“tyre”是英式拼写；美式英语更常写作“tire”。意思相同：名词指“轮胎”，动词指“给车轮装轮胎”。","注意不要和动词“tire”（感到疲倦）混淆：I’m tired.（我累了） 这里的“tired”与轮胎无关。"]}
{"word":"tyres","summary":{"en":"“Tyres” is the British English plural of “tyre,” meaning the rubber wheels on vehicles.","zh":"“tyres”是英式英语中“tyre”的复数，指车辆的橡胶轮胎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rubber coverings filled with air (or made solid) that fit around the wheels of vehicles, helping them grip the road and absorb shocks.","zh":"（车辆）轮胎：套在车轮外面的橡胶制品（多为充气），用于抓地、防震。"},"examples":[{"en":"My car needs new tyres before winter.","zh":"我的车在冬天前需要换新轮胎。"},{"en":"Check the tyre pressure once a month.","zh":"每个月检查一次轮胎气压。"}]}],"synonyms":["tires","wheels (informal, not exact)"],"phonetic":"/taɪrz/","extraExplanation":["“tyres”是英式拼写（British English），美式英语通常拼作“tires”。在国际交流中，两种拼写都能理解，但在写作中最好与所用英语体系保持一致。"]}
{"word":"tyrian","summary":{"en":"Tyrian means “from Tyre” or “deep purple (Tyrian purple),” often linked to ancient luxury and royalty.","zh":"Tyrian 可指“提尔的（来自提尔城）”，也可指“提尔紫/深紫色”，常与古代奢华与王权相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Tyre, an ancient Phoenician city famous in the Mediterranean world.","zh":"与提尔（Tyre，腓尼基古城）有关的；提尔的。"},"examples":[{"en":"Tyrian merchants were known for trading luxury goods across the sea.","zh":"提尔的商人以在海上贸易奢侈品而闻名。"},{"en":"The poem mentions Tyrian sailors and distant ports.","zh":"这首诗提到了提尔的水手和遥远的港口。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a rich purple color, especially the famous dye historically produced in Tyre (“Tyrian purple”).","zh":"（指颜色）提尔紫的；深紫色的（尤指历史上在提尔制作的“提尔紫”染料）。"},"examples":[{"en":"The actor wore a cloak of Tyrian purple to suggest royalty.","zh":"演员披着提尔紫的斗篷来暗示王权。"},{"en":"In old stories, Tyrian dye is a symbol of wealth and power.","zh":"在古老故事里，提尔紫染料是财富与权力的象征。"},{"en":"The sunset painted the clouds a Tyrian shade.","zh":"夕阳把云彩染成了提尔紫般的色调。"}]}],"synonyms":["Tyre-related","Phoenician (context-dependent)","purplish","deep purple"],"phonetic":"/ˈtɪriən/","extraExplanation":["“Tyrian purple（提尔紫）”在古代极其昂贵，传统上由海螺（murex）分泌物制成，制作过程费时费工，因此常与王权、贵族、宗教仪式相联系。","在英语文学和宗教/历史语境中，Tyrian 常用来营造“古代奢华、权势与传奇”的氛围；遇到 “Tyrian” 时，很多情况下可直接联想到 “Tyrian purple”。"]}
{"word":"tyrigan","summary":{"en":"“tyrigan” is not a common dictionary English word; it’s likely a misspelling or a proper/fantasy name.","zh":"“tyrigan”不是常见的词典英语单词；更可能是拼写错误或专有/奇幻作品中的名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a made-up/proper name (often seen in fantasy or gaming contexts).","zh":"不是标准英语单词。可能是拼写错误，或是虚构/专有名词（常见于奇幻作品或游戏语境）。"},"examples":[{"en":"I searched several dictionaries, but “tyrigan” doesn’t appear as a common English word.","zh":"我查了好几本词典，但“tyrigan”并不是常见的英语单词。"},{"en":"In the novel, Tyrigan is the name of a warrior from the northern kingdom.","zh":"在小说里，Tyrigan 是来自北方王国的一名战士的名字。"}]}],"phonetic":"ˈtɪrɪɡən","extraExplanation":["“tyrigan”很可能是你想写的其他词。你可以回想一下它出现的上下文（一句话或一段文字），我就能更准确判断。","一些可能的近似词：\n- tyranny（暴政）/ˈtɪrəni/\n- tyrant（暴君）/ˈtaɪrənt/\n- tyrannical（暴虐的、专横的）/tɪˈrænɪkəl/\n- Tír na nÓg（爱尔兰神话“青春之地”，音译有多种写法）","如果这是人名/地名/角色名，通常没有固定词典释义；意义要看作者设定。把你看到它的句子发来，我可以帮你解释。"]}
{"word":"tyrnan","summary":{"en":"Tyrnan is mainly used as an Irish-origin surname, and more rarely as a first name.","zh":"Tyrnan 主要用作（多为爱尔兰来源的）姓氏，也较少用作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most commonly Irish in origin.","zh":"一个姓氏（家族姓），常见于爱尔兰背景。"},"examples":[{"en":"Ms. Tyrnan will join the meeting at 3 p.m.","zh":"Tyrnan 女士将在下午三点参加会议。"},{"en":"I saw the name Tyrnan in an Irish family history record.","zh":"我在一份爱尔兰家族史记录里看到过 Tyrnan 这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (first name), rare in modern English usage.","zh":"一个名字（名），在现代英语里比较少见。"},"examples":[{"en":"Tyrnan is an uncommon first name, so people may ask how to spell it.","zh":"Tyrnan 是个不常见的名字，所以别人可能会问怎么拼。"}]}],"synonyms":["Tyrnan (as a name has no true synonyms)","Irish surname"],"phonetic":"/ˈtɪrnən/","extraExplanation":["“Tyrnan”更常见作为专有名词（人名/姓氏），而不是普通英语词汇；如果你是在文章里看到它，通常指某个人或某个家族。","如果你原本想查的是发音/拼写相近的普通词，可能是：tyranny（暴政）、tyrant（暴君）、Tyrone（泰隆，地名/人名）。你可以告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"tyro","summary":{"en":"Tyro means a beginner or novice, especially someone new to a skill or field.","zh":"tyro 指某个技能或领域的初学者/新手（偏书面用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beginner or someone new to a skill, job, or activity; a novice","zh":"新手；初学者；生手"},"examples":[{"en":"As a tyro in programming, she started with simple exercises.","zh":"作为编程新手，她从简单练习开始。"},{"en":"The tyro reporter made a few mistakes but learned quickly.","zh":"这位新手记者犯了些小错，但学得很快。"}]}],"synonyms":["novice","beginner","newcomer","learner","rookie"],"phonetic":"/ˈtaɪroʊ/","extraExplanation":["“tyro”是比较偏书面、较正式的词，日常口语里更常用“beginner”或“newbie”。","词源来自拉丁语“tiro/tyro”，原意与“新兵、学徒”有关，因此常带有“刚入门、还在学习”的语感。"]}
{"word":"tyrosinase","summary":{"en":"Tyrosinase is an enzyme involved in making melanin and is also known for causing browning in cut fruits and vegetables.","zh":"酪氨酸酶是一种参与黑色素生成的酶，也常用于解释切开水果蔬菜后的褐变现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that helps produce melanin (the pigment that gives color to skin, hair, and eyes) by speeding up reactions involving the amino acid tyrosine.","zh":"酪氨酸酶；一种参与黑色素生成的酶，通过催化与酪氨酸相关的反应来帮助产生皮肤、头发和眼睛的色素。"},"examples":[{"en":"Tyrosinase is important for melanin production in the skin.","zh":"酪氨酸酶对皮肤中黑色素的生成很重要。"},{"en":"Some skin-lightening products claim to reduce dark spots by inhibiting tyrosinase.","zh":"一些美白产品声称通过抑制酪氨酸酶来减少色斑。"}]},{"partOfSpeech":"n.","definition":{"en":"In food science, an enzyme that can cause browning in fruits and vegetables when they are cut or bruised (enzymatic browning).","zh":"（食品科学）一种会导致水果、蔬菜在切开或碰伤后发生褐变的酶（酶促褐变）。"},"examples":[{"en":"Apple slices turn brown partly because tyrosinase reacts with oxygen.","zh":"苹果片变褐部分是因为酪氨酸酶与氧气发生反应。"},{"en":"Lemon juice can slow browning by reducing tyrosinase activity.","zh":"柠檬汁可通过降低酪氨酸酶活性来减缓褐变。"}]}],"synonyms":["polyphenol oxidase (often used in food science)","PPO (abbrev., in food science)"],"phonetic":"/taɪˈroʊsəˌneɪs/","extraExplanation":["词源小提示：tyrosinase 来自 tyrosine（酪氨酸）+ -ase（常见的“酶”后缀）。看到 -ase 结尾，通常可以判断它是某种酶。","使用语境：在皮肤护理/医学里常谈“抑制 tyrosinase（酪氨酸酶）”以减少色素沉着；在食品领域常用来解释水果切开后“变褐”。"]}
{"word":"tyrosine","summary":{"en":"Tyrosine is an amino acid used to build proteins and make key brain and thyroid chemicals.","zh":"酪氨酸是一种氨基酸，用于合成蛋白质，并参与生成重要的神经与甲状腺相关物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An amino acid used by the body to build proteins and to make important chemicals like dopamine, norepinephrine, epinephrine, and thyroid hormones.","zh":"一种氨基酸，人体用它来合成蛋白质，并制造多巴胺、去甲肾上腺素、肾上腺素以及甲状腺激素等重要物质。"},"examples":[{"en":"Tyrosine is found in many protein-rich foods such as dairy, meat, and beans.","zh":"酪氨酸存在于许多高蛋白食物中，例如奶制品、肉类和豆类。"},{"en":"In biology class, we learned that tyrosine helps the body make certain neurotransmitters.","zh":"在生物课上我们学到，酪氨酸帮助身体制造某些神经递质。"}]},{"partOfSpeech":"n.","definition":{"en":"A building block in proteins; in some proteins, tyrosine can be chemically modified (phosphorylated) to help control cell signaling.","zh":"蛋白质的组成单位之一；在某些蛋白质中，酪氨酸可被化学修饰（如磷酸化），从而参与调控细胞信号传递。"},"examples":[{"en":"Scientists studied how tyrosine phosphorylation affects cell growth.","zh":"科学家研究酪氨酸的磷酸化如何影响细胞生长。"}]}],"synonyms":["L-tyrosine (in supplements)"],"phonetic":"/ˈtaɪrəˌsin/","extraExplanation":["词源提示：tyrosine 来自希腊语 tyros，意思是“奶酪”。它最早是从奶酪蛋白（酪蛋白）中分离得到的，因此得名。","学习提醒：日常英语里它主要出现在营养学、医学和生物化学语境中。作为补充剂（supplement）时常写作 L-tyrosine，但是否适合服用应以医疗建议为准。"]}
{"word":"tyrosinemia","summary":{"en":"Tyrosinemia is a rare inherited disorder that prevents normal breakdown of tyrosine, leading to harmful buildup in the body.","zh":"Tyrosinemia（酪氨酸血症）是一种罕见遗传病，因无法正常分解酪氨酸而导致有害物质在体内累积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare genetic (inherited) disorder in which the body cannot properly break down the amino acid tyrosine, causing harmful substances to build up in the blood and tissues","zh":"一种罕见的遗传性疾病，身体无法正常分解氨基酸“酪氨酸（tyrosine）”，导致有害物质在血液和组织中累积"},"examples":[{"en":"The baby was diagnosed with tyrosinemia after abnormal newborn screening results.","zh":"新生儿筛查结果异常后，这个宝宝被诊断为酪氨酸血症（tyrosinemia）。"},{"en":"People with tyrosinemia may need a special low-tyrosine diet and regular medical follow-ups.","zh":"酪氨酸血症患者可能需要低酪氨酸的特殊饮食，并定期复诊。"}]}],"synonyms":["tyrosinaemia (BrE spelling)","hereditary tyrosinemia"],"phonetic":"/taɪˌroʊsɪˈniːmiə/","extraExplanation":["词源与构词：tyrosine（酪氨酸）+ -emia（血液中的……，常见于医学词，如 anemia 贫血）。因此 tyrosinemia 字面意思是“血中酪氨酸相关异常”。","常见类型与背景（仅作语言与常识科普）：医学上常提到 I/II/III 型酪氨酸血症，分别与不同酶缺陷相关，表现和严重程度不同；有些类型与肝脏或神经系统问题有关。具体诊断与治疗需由专业医生决定。","语境提示：这个词多出现在医学报告、科研论文、新生儿筛查（newborn screening）或遗传咨询（genetic counseling）中，日常口语较少用。"]}
{"word":"tyrosinosis","summary":{"en":"Tyrosinosis is a medical term for an abnormal buildup of tyrosine in the body.","zh":"Tyrosinosis 指体内酪氨酸异常堆积（或过高）的医学状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) An abnormal buildup or excessive presence of the amino acid tyrosine in the body, typically due to a metabolic disorder.","zh":"（医学）体内酪氨酸（tyrosine）异常堆积或含量过高，通常与代谢异常有关。"},"examples":[{"en":"The doctor considered tyrosinosis after seeing persistently high tyrosine levels in the blood test.","zh":"医生在发现血检中的酪氨酸水平持续偏高后，考虑是否为酪氨酸异常堆积（tyrosinosis）。"},{"en":"Early detection of tyrosinosis can help prevent complications through diet and medical treatment.","zh":"及早发现酪氨酸异常堆积可通过饮食控制与医疗治疗来帮助预防并发症。"}]}],"synonyms":["tyrosinemia","hypertyrosinemia"],"phonetic":"/ˌtaɪrəˈsaɪnoʊsɪs/","extraExplanation":["“tyrosinosis”在现代医学英语中并不常见，更常见的相关术语是“tyrosinemia /ˌtaɪrəˈsiːniə/（酪氨酸血症）”，尤其指遗传性氨基酸代谢疾病导致的酪氨酸升高。","词源上可拆解为 tyrosine（酪氨酸）+ -osis（表示“异常状态/疾病状态”的后缀），因此字面意思就是“与酪氨酸相关的异常状态”。","如果你是在论文、旧教材或检验报告里看到该词，通常需要结合上下文判断：它可能泛指“酪氨酸过高/堆积”的状态，也可能被用来指代某类“tyrosinemia”。"]}
{"word":"tyrrhene","summary":{"en":"“Tyrrhene” is a literary/historical adjective meaning “Tyrrhenian/Etruscan,” especially connected to the Tyrrhenian Sea or ancient Etruscans.","zh":"“Tyrrhene”是较偏文学/历史的形容词，意为“第勒尼安（海）的；伊特鲁里亚的”，常指第勒尼安海或古代伊特鲁里亚人相关事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Tyrrhenians (an ancient people often identified with the Etruscans) or to the Tyrrhenian Sea (the part of the Mediterranean west of Italy).","zh":"与提勒尼亚人（古代民族，常与伊特鲁里亚人相关）或与第勒尼安海（意大利西侧的地中海海域）有关的。"},"examples":[{"en":"They sailed across the Tyrrhene waters toward the Italian coast.","zh":"他们穿越第勒尼安海域，驶向意大利海岸。"},{"en":"Some Latin poets use “Tyrrhene” as a poetic way to say “Etruscan.”","zh":"一些拉丁诗人会用“Tyrrhene”作为“Etruscan（伊特鲁里亚的）”的诗意说法。"}]}],"synonyms":["Tyrrhenian","Etruscan"],"phonetic":"/tɪˈriːn/","extraExplanation":["“Tyrrhene”在现代英语里较少见，更多出现在文学、历史或古典研究语境中；日常写作更常用“Tyrrhenian”（如 the Tyrrhenian Sea）。","词源可追溯到希腊语对提勒尼亚人的称呼（Tyrrhenoi）。在古典文学中，它常带有“古意/诗意”的风格色彩。"]}
{"word":"tyrrheni","summary":{"en":"Tyrrhenian means “of the Tyrrhenian Sea” or (in classical contexts) “of the ancient Tyrrheni/Etruscans.”","zh":"Tyrrhenian 指“第勒尼安海的”，或在古典语境中指“古代Tyrrheni/伊特鲁里亚人的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Tyrrhenian Sea (the part of the Mediterranean Sea west of Italy).","zh":"与第勒尼安海（位于意大利以西的地中海海域）有关的；第勒尼安海的。"},"examples":[{"en":"We sailed along the Tyrrhenian coast of Italy.","zh":"我们沿着意大利的第勒尼安海岸航行。"},{"en":"The city has a mild Tyrrhenian climate.","zh":"这座城市有温和的第勒尼安海沿岸气候。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Tyrrheni (often identified with the Etruscans), a people of ancient Italy.","zh":"与古代“Tyrrheni”（常被认为就是伊特鲁里亚人）有关的；伊特鲁里亚的。"},"examples":[{"en":"Some Greek writers used “Tyrrhenian” to refer to the Etruscans.","zh":"一些希腊作家用“Tyrrhenian”来指伊特鲁里亚人。"},{"en":"Tyrrhenian art influenced early Roman culture.","zh":"第勒尼安（伊特鲁里亚）艺术影响了早期罗马文化。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the ancient Tyrrheni (Etruscans); a Tyrrhenian.","zh":"古代Tyrrheni（伊特鲁里亚人）的一员；第勒尼安人。"},"examples":[{"en":"In the legend, a Tyrrhenian teaches the hero a ritual.","zh":"在传说中，一位第勒尼安人教英雄一种仪式。"}]}],"synonyms":["Etruscan (in the ancient-people sense)","of the Tyrrhenian Sea"],"phonetic":"/tɪˈriːniən/","extraExplanation":["“tyrrheni”更像是拉丁/学术拼写（可指古代的Tyrrheni族群，常与Etruscans=伊特鲁里亚人联系在一起）。英语里更常见的形式是 **Tyrrhenian**（形容词/名词）。","词源上与希腊语 **Tyrrhēnoi**（Τυρρηνοί）相关；在古典文献中，“Tyrrhenian”既可指人群/文化，也常用于地理（Tyrrhenian Sea）。"]}
{"word":"tyrtaean","summary":{"en":"Tyrtaean describes stirring, patriotic, war-encouraging language or poetry.","zh":"Tyrtaean 指鼓舞人心、爱国且带有战斗号召力的语言或诗歌风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of poetry, speech, or style) strongly patriotic and intended to encourage people to fight bravely; martial and rallying.","zh":"（诗歌、演讲或风格）强烈爱国、旨在鼓舞人们英勇作战的；尚武的、号召性的。"},"examples":[{"en":"The film ends with a tyrtaean speech that urges the soldiers to hold the line.","zh":"影片以一段充满鼓舞性的尚武演讲收尾，号召士兵坚守防线。"},{"en":"His tyrtaean verses were written to lift morale during the war.","zh":"他写下这些鼓舞士气的爱国战诗，用于战争时期提振士气。"}]}],"synonyms":["martial","patriotic","rallying","jingoistic","militant"],"phonetic":"/tɝˈtiːən/","extraExplanation":["“tyrtaean”来自古希腊诗人 Tyrtaeus（提耳泰奥斯，据说生活在公元前7世纪），他以战争与爱国主题的诗歌闻名，常被认为用于在战时鼓舞士气。","这个词多用于文学批评或较正式的写作中，用来形容“带有战斗号召力的爱国激情”，语感偏书面。"]}

